{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "i think it's partially because the⋮menu says \"Up to date!\" even though u got an old dev version.  another tricky thing is click the \"Up to date!\"  can update to newest dev version.",
			"post_id": 47,
			"date_added": 1458795948
		},
		{
			"comment_id": 2,
			"body": "> [basxto](#comment_5_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): The version system is confusing. People who use 3.5 get told, they use an outdated version, despite that's actually the last stable release\n\nlatest stable release should be 3.6\n3.5 is really outdated.",
			"post_id": 47,
			"date_added": 1458816528
		},
		{
			"comment_id": 3,
			"body": "> [basxto](#comment_7_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): https://github.com/HelloZeroNet/ZeroNet/releases\n> 3.6 is in development\n\ni think @nofish forgot to release 3.6 in github.\n3.6 is the latest stable release.\nbelieve me, i'm an old man in ZN ;)",
			"post_id": 47,
			"date_added": 1458823551
		},
		{
			"comment_id": 4,
			"body": "> [basxto](#comment_8_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): oh, then he is about to develop 3.7 now?\n\nyes. when 3.7 stable is out, u'll get a notification in UI asking for update.",
			"post_id": 47,
			"date_added": 1458823782
		},
		{
			"comment_id": 5,
			"body": "different from normal download way,  we need to click the `View Raw` or `Raw` button to download it.",
			"post_id": 64,
			"date_added": 1460461960
		},
		{
			"comment_id": 7,
			"body": "> [nofish](#comment_8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The hub feature is required because technical reasons, but like i also written there: if you don't want to trust the hub owner, then you can create your own hub\n\ni have an idea: a user can choose a primary hub and 2+ backup hubs.\nfor example, the user publishes sth to primary hub A first, and then publishes to backup hubs B and C in the background. also, anyone comments to the user's profile publishes to A first and then B, C. if A's owner censors the user, the user can leaves A and marks B as primary hub and chooses D as a new backup hub. thus, anything will not be lost including comments to the user's profile.\nif there is no backup hub, things will be lost even though the user can switch hub. with concern about data losing, users will do as @ks want to do-- to be the hub owner and only user of that hub. in this case, the hub feature will be useless.",
			"post_id": 65,
			"date_added": 1460638599
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}