{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1567878918,
			"title": "Revenge on a scammer",
			"body": "So I have a photo of the REAL ID of a scammer (checked it, he's dumb and careless) , a link to his personal facebook and one of his phone numbers. What harm can I do with this to get a revenge? This guy is a fucking parasite, is no better than garbage, he deserves it.",
			"added": 1567878917
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1567878918_114mSgWDZpRknb492fpx91DL6jSNgRRXba": [
			{
				"comment_id": 1,
				"body": "> [edgelordofdecent](#comment_97_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Call his cell phone service and pretend to be him and you can social engineer them into loading his phone number onto your phone. You can then probably hack into a lot of his social media accpunts.\n\nThat's actually interesting. But the phone number it's not from his home country so probably he won't have any social media linked to it. But keep the ideas coming! I'm still searching what can I do with the phone number.",
				"added": 1567880351
			},
			{
				"comment_id": 2,
				"body": "> [bigbadbob](#comment_605_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): That's pretty dumbass thing to do. [...]\n\nHe impersonated the landlord of a flat. He had the keys because he previously rented it. So after leaving, he made copies of the keys and showed it to a bunch of people and charged them with a deposit after giving them the real keys of a flat he didn't own. We think he's now away in his fucking home country, so Police can't do shit.",
				"added": 1567881133
			},
			{
				"comment_id": 3,
				"body": "And for the record, the photo of the ID I have is his real one from his home country, Argentina, already checked with the public records of the country. And also the phone number is from a cheap company, probably a prepaid card.",
				"added": 1567881748
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_607_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): k.\n\nWhat would the risk be? Anyways, sugestions are always welcome and I'll see if it's worth it or not. As he's probably in another country, legally he won't be able to do anything. I'm searching about what can I do to fuck his passport with his ID but every movement needs to be paid in that shithole country.",
				"added": 1567882886
			},
			{
				"comment_id": 5,
				"body": "> [bigbadbob](#comment_608_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): The risk would be doing something illegal and potentially getting pinched.  Like you could call him with voip and spam or even pretend to be a police officer and try to convince him to go the the local police station or fuck with like that him somhow... but im pretty sure impersonating a cop is highly illegal.  Would not be worth the potential charges.  Or find out where he is and pay him a visit and Kick him right in the nutz... also illegal.\n\nIf I had spare time and money to waste, I could do the visit thing and fly back within the same day, and the police wouldn't be able to do anything if I'm already out of the country, but it's not the case :/ \n\n> [bigbadbob](#comment_609_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Best thing IMO would be to use the truth to warn others online.  Make it so if anyone was to ever search him, they would see that he is a scammer.  Hit him in the reputation.  Safe approach with potential huge results.\n\nI'm actually interested in this. How could I do this so when a company searchs for his name he appears as a scammer?",
				"added": 1567886784
			},
			{
				"comment_id": 6,
				"body": "> [redlibertyreal](#comment_10_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Does he know that you know? Make sure he does, that will frighten him. Then tell him that you forgive him and turn the other cheek, and do nothing with that information.\n\nI'm not christian nor from any other religion or shit like that, so no.",
				"added": 1567888585
			},
			{
				"comment_id": 7,
				"body": "> [bigbadbob](#comment_610_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Red does have a point, You don't need to be religious to walk away from bullshit.  Its less toxic for yourself in a lot of ways.  Sometimes writing it off and moving forward is best for you.  Why let this fool waste any more time... but its nice to warn others as well.  To bad the police are mostly useless for most things.  The whole situation is aggravating but its up to you how aggravating it has to be.\n\nI prefer ruining his reputation so he can't work again. Will be looking into how to do that.",
				"added": 1567889987
			},
			{
				"comment_id": 8,
				"body": "> [bigbadbob](#comment_611_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Scamming people does earn a hit on the reputation in my books\n\nYes, but not if no one knows. So I have to figure out how to properly make it public so whenever you search his name the scamming comes up.",
				"added": 1567891519
			},
			{
				"comment_id": 9,
				"body": "> [redlibertyreal](#comment_12_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Imagine if you were judged by the public solely for the worst thing YOU have ever done! We are all humans, we all do and have done bad things. Why revenge? What good is vengeance if you want mercy for yourself but justice for everyone else? We are all guilty of something. Would you yourself be employable if all the public saw this thread and the lengths you would go to ruin the public image of a person who once wronged you? How do you even know for sure it is the same person and not a decoy? You don't. I implore you yet again to please turn the other cheek. You have real power over this person, be the better person and do what he did not do when he had power over you, and show mercy. An eye for an eye makes the whole world blind, it has to stop somewhere, let that be here!\n\nI can't believe you're actually defending someone who has stolen thousands of dollars to innocent people, people that really made an effort to pay the deposit for the rent. I don't ask for mercy on myself, and I don't care if the worst thing I've done gets public, because it won't be anything serious. I muted you, so gtfo.",
				"added": 1567895006
			},
			{
				"comment_id": 10,
				"body": "> [bigbadbob](#comment_613_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Can do a million good things, But its always that one bad thing that gets remembered.  I wish i could imagine your scenario rather than live it.  I do not advocate for revenge but it happens.  A little accountability is not a horrible thing if it produces positive results.  revenge is toxic, accountability is more like constructive criticism, lol\n\nHe's a scammer. It wasn't just a bad thing. Having a fake ID was a bad thing, making copies of the keys for a house you don't own was another bad thing. Showing it like you're the landlord was another bad thing. Stealing money from innocent people is yet ANOTHER bad thing.",
				"added": 1567896210
			},
			{
				"comment_id": 11,
				"body": "> [bigbadbob](#comment_615_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I agree, sounds like real dick.  Needs a kick in the nutz.  And he will surely get one if he keeps being a piece of shit scammer.  You got burned and you gotta do what you gotta do to be ok with it,  I only say revenge is toxic if it prolongs the burn, consumes you, or makes matters worst, like tit for tat.  Doing something legal that warns others of this scam is not my definition of revenge.   Be more like civic duty.  Unless it wasted more time and cost me more than i lost.  Thiefs do make my blood boil, I aint gonna lie.\n\nHe didn't even scam me, he scammed a friend and some other unknown people. Call it revenge, civic duty or whatever, it would be good to act as \"karma\" and get back at him. Because, if anyone still doesn't know it, real karma or \"universal justice\" does not exist.",
				"added": 1567897446
			},
			{
				"comment_id": 12,
				"body": "> [bigbadbob](#comment_616_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so its fake? Possible burner phone?\n\nHe had a fake ID, but I got the info of his real ID. And yeah, the phone number is no longer in use.",
				"added": 1567938290
			},
			{
				"comment_id": 13,
				"body": "I'm a little bit disappointed, I was hoping for a more hacker-ish response. But that's ok.",
				"added": 1568284316
			}
		]
	},
	"comment_vote": {}
}