{"cert_user_id": "dzmitry-lahoda@github", "next_comment_id": 7, "comment": {"1604066864_mirrored_DaniellMesquita_github": [{"comment_id": 1, "body": "I have 5TB HDD inside my laptop and 1TB SSD. HDD is unecrypted, SSD is. I want data of zero net to be stored on 5TB HDD. And metadata(part of metadata) on SSD. Specifically, any of\r\n```\r\nGeoLite2-City.mmdb\r\ncert-rsa.pem\r\nchart.db\r\ncontent.db\r\nkey-rsa.pem\r\nlock.pid\r\nsites.json\r\ntrackers.json\r\nusers.json\r\n```\r\nwhich is need to represent me as me and needed to export in order to restore my control over stuff on other machine and is security stuff should be configurable to be placed onto that of SSD. I am usual user and cannot setup custom links onto files. ", "added": 1549277029, "modified": 1549277029, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1621#issuecomment-460254209", "source_type": "github"}, {"comment_id": 2, "body": "I want export all my data. I.e. if I have uploaded stuff into zeronet or created site or marked some stuff as my (i.e. forcing seeding without collecting that as garbage) I want to be able to back up it. I do not want backup to work only and only if I impersonated it as me(copying users.json and keys), but I want backup by other means without authentication. I.e. I want `data` to be split by my vs other semantics. From this I can start using zeronet as public syncthing.", "added": 1549277212, "modified": 1549277212, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1621#issuecomment-460255059", "source_type": "github"}, {"comment_id": 3, "body": "@blurHY , I cannot create symlinks because I am casual user, not power. And even if I am power user, I still find it hard to do it each time I setup zeronet to my friends. And that approach may play bad with #323.", "added": 1549277899, "modified": 1549277899, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1621#issuecomment-460258681", "source_type": "github"}, {"comment_id": 4, "body": "@blurHY , regarding backup. I want to be sure that my uploads into zeronet are not lost. So I want to setup other `consume only` zeronet device (in other place) which will peer ALL data which I uploaded or want persistently peer. That mean I will avoid copying data 2 times into 2 different places and same time devices will participate in sharing (e.g. syncthing will not share data if I do backup into it)", "added": 1549278057, "modified": 1549278057, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1621#issuecomment-460259513", "source_type": "github"}, {"comment_id": 5, "body": "@blurHY , I find zeronet unusable by dozens of people I know. I.e. I cannot sell them to install and run zeronet as I do with telegram instead of viber or qbittorrent insread of xyzfoobar. So this is my list of `List of most needed things for ZeroNet`, and if it upvoted, I will create separate issue. Same time I do experiments with other p2p techs out there, which may work better.", "added": 1549278219, "modified": 1549278219, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1621#issuecomment-460260364", "source_type": "github"}], "1604067186_mirrored_DaniellMesquita_github": [{"comment_id": 6, "body": "LineageOS. I have 300 USD phone with 128 GB and 6 cores. I can attach it with USB type c storage of larger size. My relatives has no PCs at all.", "added": 1549296485, "modified": 1549296590, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1808#issuecomment-460371932", "source_type": "github"}]}}