{
	"next_post_id": 5,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "png",
	"user_name": "Theopolus01",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1613182920,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1613183232,
			"body": "My username is Theopolus, a chacter in the Bible whom the books of Luke and Acts were both written to.  I choose this title because I am a Christian before anything else, that means I follow Christ.  I believe that Jesus the Christ (or Messiah) was incarnate God, who walked among men, and willing allowed himself to be sacrificed for the sins of those who put their trust in Him.  Feel Free to contact me if you have questions about Christianity. ",
			"date_added": 1613183230,
			"meta": "{\"img\":\"491,700,fffccceee222777888aaabbb555ddd999000666333,000120000034200005060000526067053809A15400297B00097CD7009C267101200090\"}"
		},
		{
			"post_id": 1613184200,
			"body": "Monastic Orders in the 21st Century. \n\nI have taken on living by myself since my wife and family were taken from me.  I live in peace knowing that God controls every aspect of humanity.  I write this during the great artic blast across North America in 2021, one of the coldest winters on record.  I write this from an undisclosed location, but normally we aren't as cold as we are this year, or even this night as I write this note.  Humanity itself has taken on a dark shift, with a world wide pandemic and a type of elite high tech oligarchy forming, I am returning to the more primitive and basic.  I feel a huge need to record and make notes of major historical events.  Maybe this will be seen by some in the future who will be able to use this for Historical purposes. Also I'm inspired by the Irish monks of the middle ages which preserved written history as Europe and the Middle east burned.  The Irish monks preserved some of the legacy of humanity to that point, and if not for their remote location and dedication to preservation, much of antiquities would have been lost.  Today that same effort must be made, since antiquities is seen as a vile work of the white man, and contradictory to post modern critical theory.  For this reason I have taken on the post of creating a monastic order in secret.  If you wish to know more, please write to me using zero mail.   I plan to publish encrypted text, and it will be for the brother and sisters of this order.  I also plan to submit writing like this to describe the happenings of the day in case all is lost.  I do believe ZeroNet will be preserved in some form and fashion. \n\nWhat is my mission?\nPreservation of history, the good, the bad and the ugly.  Nothing is so remote as to not be documented and recorded.  I will try my best to glean positions and arguments for and against, but I will allow testimony alone to determine motive.\n\nHow will I do this mission?\nFrom my computer I wish to share via ZeroNet and other decentralized networks truth in all it's forms.  Some practical, some observation, and some speculation, but all truth.\n\nLong Term Preservation?\nI am in the process now of creating a method using lasers to etch data onto stainless steel sheets, that when scanned can be reloaded to computers.  Essentially ticker tape on steel.  These will be placed in archival boxes and stashed in a nearby cave for long term storage.   \n\nIf your reading this, ask yourself, what about today should be known 100 years from today.  What information do you think will be lost the annals of time?  Preservation, though not necessarily the best practice, is a last ditch effort to preserve Truth.  \n\nAsk yourself, who do you put your trust in?   Is it God of the Bible?  If so, consider the calling to the order.\n\n",
			"date_added": 1613184197
		},
		{
			"post_id": 1613226084,
			"body": "Today I will reveal a little of the past I'm running from, but I won't tell you exactly what I did or why I'm running.  I can tell you a little bit of history, I was listening to a podcast and they were talking about I.B.M. being involved with the Nazi with The Holocaust.  I.B.M. took a contract to conduct a survey of all residence in Germany to determine heritage, language and culture.  This was then used to out the Jews.  Today, it's already being done, except it's about how easily you can be manipulated.  You see, if you are considered a \"Fundamentalist\" you are deemed as being a danger to society, unable to adapt to what is coming next. Majority of those people 1) voted for Donald Trump 2) Donated money to his election 3) Displayed some kind of message on social media supporting him.   These are the first wave that need to be removed.  The software was actually written a while back, and used to round up Christians in China.  The roundup in America will begin in the next few months.  First a major event will occur that will determine that \"Fundamentalist Christians\" are considered a threat, expect that in the next few weeks.  When that happens Social media will produce lists of people with phone numbers and addresses, and police will start arrests.  At first this will be for \"Re-education\" but like in China, not many will ever come out of these camps. \n\nJust know this, your phone will be the evidence that convicts you.  If you go to church, or you associate with friends, you attend a study, you fellowship over a cup of coffee, it is all be recorded, and will be used for being in association with dangerous people.  Your property will be seized and you will be sent to a camp for re-education.  \n\nWith a pandemic, only devout Christians will be targeted, this was done on purpose.  ",
			"date_added": 1613226080
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}