{
	"next_post_id": 5,
	"next_comment_id": 2,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Eau",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Utilisateur ZeroNet aléatoire",
	"post": [
		{
			"post_id": 1,
			"date_added": 1597906408,
			"body": "Bonjour ZeroMe!"
		},
		{
			"post_id": 1597908828,
			"body": "The site that is reputed to have the best moderation by the European Commission is one of the most rotten for example I saw a topic on \"the best vegetable is broccoli\" it was removed by moderation when we were supposed to talk about everything except illegal topics and flood. there is also the topic \"American vs Japanese cartoon\" which is censored sorry I should say moderated or just deleted because censorship it happens before the publication according to one of the moderator of the site moreover it is not censorship since it is not the government that decides but this private company that is why they chased cycling from their territories. This private company has the perfect right to suppress the \"Tour de France 2019\". There is someone who took me for an idiot by saying only racist messages are deleted\" while there are also harmless topics that are deleted. For 2 months I didn't stand up against these deletions because of the behavior of the users there was tension with \"feminist (extremist is the norm now)\" organizations that pretend to be the good guys, It is impossible to criticize him \"whoever has a bad guy can be against my noble cause\" and the anti-Semitic conspiracy incels who harassed these people preventing the slightest criticism of these extremists : so a woman who said she wanted to cut off men's balls goes on the news to say she was harassed (it was after this event), there is also a journalist who received threats and that is why I hesitated to stand up against censorship in the first months.\nThe law has not been passed but it is still being applied by some private companies. \n\n\"For the defenders of freedoms, especially La Quadrature du Net, platforms will in fact be pushed to \"over-moderate\", i.e. to censor questionable content \"as a precaution\", simply so as not to run the risk of being fined. With a risk of being used as a tool by the political authorities. Busy sorting out content from the grey zone, i.e. shocking, questionable but not necessarily illegal content, platforms could automatically censor any content reported by an official authority, such as the police, fears the association.\"",
			"date_added": 1597908826
		},
		{
			"post_id": 1602588056,
			"body": "Hello\n\nWhen in school we studied propaganda in the 20th century, I sincerely didn't think that I would ever experience that, especially not in such a rude way.\n\nWell most people might not understand if I show the image. (which comes from an education manual) and I have a little trouble knowing that those who criticize the image have good or bad intentions, especially since I share the worldview of those with bad intentions. The image is incriticizable without being categorized as a great villain.",
			"date_added": 1602588053
		},
		{
			"post_id": 1634795671,
			"body": "about the recent threats, the left does not speak about it, the extreme right spoke about it, useless to shout to the recuperation by the extreme right I left you a little time in case the left is not aware. original source: \"France Bleu Poitou\" and no \"Valeur Actuelle\"",
			"date_added": 1634795667
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "The subject was 410 I understand that they don't want any polemic because of what happened 3 years ago and this image is from the 5th grade textbook if the image was inverted it would be a scandal but in this case it's almost only a scandal for shady people from the extreme right and it disturbs me because I see an unhealthy intention in this image. I had the impression that the message in the manual was \"x are the good guys y are the bad guys\" It's not only in the manual it's also in the commercials, the movies with these commercials and these movies I have the impression that we're all going to die stupid. I found the image but I don't feel like sharing it because I look like a nasty",
			"post_uri": "17KJTfEhSfdJHgyCqvjD4yMVU1a55bcrs8_1602588056",
			"date_added": 1608558072
		}
	],
	"follow": []
}