{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Création de mon site",
			"body": "Salut tout le monde ! J'aimerais créer un site sur ZeroNet, quelqu'un peut-il m'aider ? Sur ce site j'aimerai proposer du contenu à télécharger. Merci !",
			"added": 1485093201
		},
		{
			"topic_id": 2,
			"title": "Anonymat",
			"body": "Comment être réellement anonyme sur zeronet ?",
			"added": 1485281633
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"2_1pGdkP4RBt8QW66TEBLLY3124RzVw4mSg": [
			{
				"comment_id": 1,
				"body": "> [zerofreedom](#comment_13_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv): ça dépend par rapport à qui tu souhaite être anonyme.À ton voisin qui pourrait surveiller ton réseau ?Aux autres peers de zeronet?À ton FAI ?À un état ou multinationale milliardaire qui est capable de dépenser des millions juste pour te retrouver si tu leur pose problème  ?\n> Je vais essayer de décrire la méthode pour contrer la surveillance d'un état ou multinationale, qui est le plus haut niveau et malheuresement le plus chiant.\n> TLDR disponible à la fin\n> Utiliser linux avec uniquement des logiciels libre et relativement connu (donc ayant 100x moins de problèmes de sécurités que les logiciels propriétaires), utilise tor avec tor browser (tu peux utiliser tor avec firefox mais il faut désactiver pas mal de variables qui présentent un risque, tor browser est déjà configuré comme il faut).\n> Au mieux ne te connecte jamais depuis chez toi mais toujours depuis la rue dans un endroit sans caméra (et ni sur le chemin) sur un réseau wifi dont tu n'as normalement pas accès (bien sur l'adresse mac de ton interface réseau  doit être changé aléatoirement à chaque connexion).\n> Quand tu écris ou poste quelque chose sur internet vérifie qu'il n'y aucun moyen de faire le lien avec ta vie en dehors d'internet.\n> Ce qui est cool avec zeronet, puisque tu uploades les sites tu peux regarder au niveau des scripts java: ont peut donc les considérer comme open source. Il faudrait que les gens commemcent à vérifier les scripts java des sites zeronet comme ont fait avec les logiciels open source. Ont pourrait alors être certain (ou presque, une erreur peut toujours passer inaperçu) que le site n'utilise pas javascript pour essayer de trouver ta vraie identité.\n> N'utilise pas de VPN loué: tu n'as pas accès à leur configuration donc aucun moyen de savoir si c'est sécurisé ou s'ils enregistrent quelque chose. La seule exception à ça c'est les loueurs de vpn qui acceptent le payment en bitcoin (les payements bancaire nécéssitent ta vraie identité sauf compte volé) et dont tu as accès à leur vps (virtual private host) en ssh. Mais c'est toujours pas génial parce qu'ils quand même un contrôle total.Le meilleur vpn à utiliséer est celui dans la situation suivante:\n> \n> choisir un pays qui possède des FAI qui ne partagent pas les données de leur client aux autres pays. Pour en être certain il faut y travailler ou connaître quelqu'un qui y travaille et à qui on peut faire confiance. Ou réussir à avoir un accès à leur réseau d'entreprise et de voir ce qu'il s'y trouve.\n> installer un nano-ordinateur avec système chiffré à la racine (au cas où il serait pas assez bien planqué )pour s'en servir comme vpn et le planquer à un endroit avec accès internet. La personne qui possède l'abonnement de cet accès internet ne doit pas vous connaître ni connaître l'existance de cet appareil pirate.Il faut répéter ce processus une deuxième fois dans un autre pays avec fai ne partageant pas leur données (explication de pourqoui plus bas).-Ensuite ZeroNet peut-être installé en remote host, cad connecté à distance comme un proxy. Il y en a sur internet http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies ou tu peux t'en faire un toi-même (il y aura un mot de passe que tu peux choisir) si tu souhaites uploader toi-même les sites que tu visites (sinon ça serait le proxy choisi sur internet qui pourrait disparaître).\n> \n> Pourquoi utiliser un vpn chez un fai ne partageant pas ses données ? imagine la situation suivante:home -> vpn -> tor -> site weble fai sait que home se connecte à vpn. vpn sait que home se connecte à tor, point de sortie sait que quelqu'un se connecte à site.A priori tout va bien. Mais c'est une erreur de penser ça à cause du fait que si les FAI de home, vpn, utilisateur de tor peuvent se partagent leurs données (ou pire si c'est le même pour tous) ils peuvent retrouver l'identité de celui qui s'est connecté au site web en regardant les temps de connexion: si home s'est connecté au vpn à 18h00:00 et que vpn s'est connecté à tor onion 1 à 18h00:05 et que onion 1 s'est connecté à onion 2 à 18h00:7 et que onion 2 s'est connecté à onion sortie à 18h00:9 et que onion sortie st'est connécté à site web à 18h00:12, les fai peuvent par algorithme déterminer qui est à l'rigine de cette connexion. Il y a alors deux moyens de contrer ça:utiliser plusieurs fai différents ne se partageant pas leurs connexions (ou au mieux n'ayant pas de connexions enregistrés, il y en a eu un en France mais il s'est fait vite fermé par l'état), ou alors le fait qu'il y ait tellement de connexions en même temps à ces points que les algorithmes ne soient pas assez précis. On peut aussi retarder les connexions avec le vpn, mais forcément déjà que c'est lent avec to ça sera encore plus chiant.\n> Il faut obligatoirement 2 vpn dans deux pays différents avec \"bon\" fai pour la raison suivante:Si tout fai se partagent sauf celui du pays où est installé le vpn, ils sauront qui se connecte si ce dernier se connecte à une adresse dans un pays avec fai partageant.\n> TLDR;En gros le plan: \n> accès internet avec abonné sans lien avec vous  +sans caméra -> vpn dans pays sans fai partageant données ->  2 ème vpn dans un autre pays avec fai sans partage de données ->tor -> proxy zeronet -> tor -> site zeronet.\n\nOk, merci c'est exactement ce que je voulais savoir.\n\nJe fais bientôt acheter un nouvel ordinateur, si tu as des conseils je suis preneur...\nDonc j'ai prévu sur cet ordinateur de ne pas mettre windows, je vais le faire tourner sous Tails, sous Tails je mets Qubes OS, puis j'ouvre box une version de linux que je n'ai pas encore choisie (si tu as des conseils je veux bien encore une fois). Le tout connecté avec plusieurs proxys, les vpn et vps j'ai encore besoin de conseils. Bien sûr avec Tor ;)",
				"added": 1485366209
			}
		]
	},
	"comment_vote": {
		"12_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1
	}
}