{
	"title": "The News Gateway",
	"description": "Copy Pasting news from WWW",
	"links": "Can't see images/videos?\nInstall **IPFS** or **Gateway Redirect browser addon**",
	"next_post_id": 31,
	"demo": false,
	"modified": 1529446724,
	"post": [
		{
			"post_id": 30,
			"title": "YouTube’s Blocks MIT Courses, Blender Videos, and More (Updated)",
			"date_published": 1529358641,
			"body": "Several popular YouTube accounts, including those belonging to 'MIT OpenCourseWare' and the 'Blender Foundation,' have had all their videos blocked. People who try to access the videos are informed that they are not available in their country, suggesting that YouTube's piracy filters have been triggered. It's unclear, however, who or what is to blame.\n---\nSource: *torrentfreak.com/youtubes-piracy-filter-blocks-mit-courses-blender-videos-and-more-180618/*\n\nTo protect copyright holders, YouTube uses an advanced piracy recognition system that flags and disables videos which are used without permission.\n\nThis system, known as Content ID, works well most of the time, but it is far from perfect.\n\nIt’s not well equipped to determine whether content deployment is protected under ‘fair use’, and in some cases it even views white noise or birds chirping as piracy.\n\nOver the past several days, an even more worrying trend has appeared. Several popular YouTube accounts including those belonging to ‘MIT OpenCourseWare‘ and the ‘Blender Foundation,’ have suddenly had all their videos blocked.\n\nPeople who try to watch one of the freely available MIT courses on YouTube get the following message, which typically appears as an anti-piracy notice if an uploader doesn’t have the rights to show content locally.\n\n“This video contains content from MIT. It is not available in your country.”\n\nThe message appears in all locations that we were able to check, suggesting that it may very well apply worldwide. In any case, on social media there’s no shortage of people mentioning that they can no longer access the courses.\n\nThe issue hasn’t gone unnoticed by MIT’s OpenCourseWare team which is investigating the matter, without pointing fingers.\n\n“You may have noticed that we are having some trouble with our videos! Please stand by. The elves are working around the clock to fix the issue,” they write, referring people to non-video content in the meantime.\n\nInterestingly, the MIT case doesn’t appear to be an isolated incident. Another organization that was hit by the same mysterious blocking efforts is the Blender Foundation.\n\nThe nonprofit organization, which is leading the development of the open source 3D content-creation application Blender, has also had its videos blocked.\n\nTon Roosendaal, Chairman of the Blender Foundation, noticed the issue on Saturday and contacted YouTube. “This is most probably an error from their side,” Roosendaal said.\n\nAt the time of writing, the issue still hasn’t been resolved. \n\nBoth organizations have verified YouTube accounts and many subscribers, which makes them high profile targets. However, two days have passed and it’s still unclear what’s going on.\n\nThe blocking message is part of YouTube’s piracy filter system, but why it was triggered is unknown. As the original publishers, both certainly have the right to publish the videos in question.\n\nLooking even further, we were able to spot dozens of accounts which show similar “blocking” messages. They include verified ones, such as India’s Press Information Bureau, soccer club Sparta Praha, and England Rugby.\n\nTorrentFreak reached out to YouTube to ask why the videos of these accounts have been blocked but at the time of publication, we had yet to hear back. Something appears to be awfully wrong though.\n\nThe timing of the incident is interesting, to say the least. This week there’s an important vote scheduled in the European Parliament, which will determine the course of EU copyright law.\n\nOne of the most contested changes is the so-called “upload filter,” which is detailed in Article 13 of the copyright reform proposal. According to opponents, such YouTube-like piracy filters are a threat to free speech.\n\nThese apparent “mistakes” show that there is a point to that.\n\nIronically, even French politicians, who were expected to vote in favor of the upload filters, may now reconsider their stance after YouTube temporarily disabled their account following three copyright strikes.\n\n**Update:** YouTube notes that the issue is related to its updated partner agreements. The company is working on a solution. We updated the title to reflect this and avoid confusion.\n\n“Videos on a limited number of sites have been blocked as we updated our partner agreements. We are working with MITOpenCourseWare and Blender Foundation to get their videos back online,” a YouTube spokesperson tells TorrentFreak.\n\n**Update 2:** Blender’s Ton Roosendaal notes that YouTube wants the organization to sign a monetization agreement.\n\n“Google sent a contract to Blender Foundation in which we have to accept monetizing our Youtube channel content. Time for a more lengthy article… meanwhile, here’s the contract.”"
		},
		{
			"post_id": 29,
			"title": "Ontario's Bold Basic Income Experiment Creates High Expectations",
			"date_published": 1525650694,
			"body": "The pilot project is already creating a huge impact.\n---\nBy Emma Paling, Daniel Tencer\nSource: **www.huffingtonpost.ca/2018/05/05/ontarios-basic-income-experiment-pilot-project_a_23425399**\n\n![Families](https://ipfs.io/ipfs/QmR5QiCosaBYCmZcmdrU5DoAxgiGXoFpbAReyePsQ6qNow)\n _The Mendowegan and Segura families are participants in Ontario's basic income pilot project._\n\nSherry Mendowegan has accomplished a lot in the past six months. The mother-of-two bought her first vehicle and graduated with her high school diploma in March.\n\n\"Next is my college, post-secondary, and then hopefully I get some work,\" she told HuffPost Canada.\n\nGoing to college would have been out of reach for Mendowegan even last year. But as a participant in Ontario's basic income pilot program, she and her husband, Dan, can now afford the tuition. She starts at Thunder Bay's Confederation College in September to study office administration.\n\n\"Our life has changed,\" Mendowegan, 41, said in an interview. \"We're not struggling where we're paying our bills and that's it.\"\n\n![](https://ipfs.io/ipfs/QmdECwjqK3awtAZq35avBMuLjNoUJGguPxEfsHDqAWfu4z)\n_Sherry Mendowegan graduated with her high school diploma in March._\n\nOntario is one of the first places in the world to test out a guaranteed basic income. Launched in April 2017, the program has enrolled more than 4,000 people who live on less than $34,000 individually or $48,000 as a couple. This includes people who are working, going to school or living on financial assistance.\n\nFor three years, single participants will receive $16,989 annually and couples will receive $24,027. People making other income will see this amount reduced by 50 cents for every dollar earned. Participants with disabilities are eligible for another $6,000 per year.\n\nA third-party research team will evaluate the effects on people's physical and mental health, food security, stress and anxiety, housing stability, education and employment. Their responses will be compared against a control group — low-income participants who won't receive the basic income but will fill out surveys about their life and well-being.\n\n## 'I want my kids to look up to me'\n\nGrowing up in the Ginoogaming First Nation, an Anishinaabe community in northern Ontario, Mendowegan said she didn't see the point in staying in school. She dropped out when she was about 15.\n\n\"I just didn't want to go to school, I guess,\" she said. \"But now that I'm an adult and have responsibilities, it's very important to have your Grade 12. I'm very glad I went back to get it. I want my kids to look up to me.\"\n\n![](https://ipfs.io/ipfs/QmesFXN9pdJLBGAcvErpoXBe9WbATn7Y8Vnc2vZ6dYuarf)\n_ Sherry Mendowegan and her husband, Dan, have two children. They've been receiving basic income since November under Ontario's pilot project. _\n\nBefore being accepted to the basic income program, Mendowegan and her husband were living on money from Ontario Works, the province's financial assistance program. Because she's Aboriginal, she could have received funding for college from her community, but that would have been seen as \"income\" by the government. Her payments would have been reduced.\n\n\"I wouldn't ever have been able to afford it,\" she said.\n\nThere are hefty requirements to be eligible for Ontario Works. Even though Mendowegan was completing high school and her husband stayed at home raising their infant daughter and 12-year-old son, both had to look for work constantly and report proof of that ongoing search to the government.\n\n\"You have to hand in everything that comes to you. If my mom were to give me $40 if I was running short, I had to report that,\" Mendowegan said. \"I feel that I'm more in control [on basic income]. I don't have to look up and say, 'OK, we got this. We have to show it to somebody.' There's more privacy.\"\n\nFor backers of the basic income, that's one of the key upshots of the idea — it's a no-strings-attached benefit, making it a less intrusive and less judgmental way of delivering financial assistance.\n\n## Designing the experiment\n\nCurrent welfare programs are \"means-tested,\" meaning government officials have to pry into the details of your life to determine whether you qualify, said Hugh Segal, the Conservative senator — and former chief of staff in the government of Brian Mulroney — who essentially designed Ontario's basic income pilot project.\n\n\"That is stigmatizing and unproductive, whereas if there was an automatic process where people (had their incomes) topped up, and did not isolate them, that would be better,\" he said.\n\nUnder Ontario's version of the basic income, if it were implemented, tax returns would be used to determine who receives a basic income payment, significantly reducing government meddling.\n\nSegal, a longtime advocate of basic income, also argues the scheme will eliminate a key disincentive for low-income people to join the workforce. With traditional welfare, any money you earn is clawed back from your benefits. But under the basic income pilot, the government lets you keep part of what you earned in the workforce.\n\n\"That does not build in the massive disincentive to working when you're on welfare,\" Segal told HuffPost Canada.\n\n![](https://ipfs.io/ipfs/QmchVW7ZWYs8qhLY5Nqqp9ayxnSArzoZBfhGuFbqj4aGJq)\n_ Luis and Leanna Segura opened their own business in Lindsay, Ont. two years ago. _\n\nIn fact, the majority of people participating in Ontario's pilot project — about 70 per cent — have jobs of some sort, according to the provincial government. One couple in the town of Lindsay shatters the expected stereotype of basic income recipients: Luis and Leanna Segura are business owners.\n\nTwo years ago, they sold their house and quit their jobs to take a chance on entrepreneurship, opening Fresh Fuell, a restaurant on the town's main street that serves healthy meals.\n\n\"Like any new business, it's a struggle and a gamble,\" said Luis Segura, who saw his first basic income payment just before Christmas. \"It's going great. We have great community support. Our sales and projections are on point.\"\n\nDespite their solid numbers, money was tight. He and Leanna decided to apply for basic income right before she gave birth to their youngest child.\n\n\"Being a sole proprietor, she's not really able to take mat leave,\" he said. \"As tight as it was, we knew it was going to get tighter.\"\n\n![Restaurant](https://ipfs.io/ipfs/QmT13eR8Q3E1WGye3x3C3c5483FNNoS3eydKqtaboUnmH7)\n_ Luis and Leanna Segura run Fresh Fuell restaurant in Lindsay, Ont. _\n\nBasic income has been a huge help while raising their now six-month-old baby and three older children, Segura said. They're able to afford kids' activities that would have been luxuries before. Their daughter is a competitive gymnast and their son is now learning jiu jitsu.\n\nSegura said he thinks the program has been a boon for local businesses. Since the program launched, Fresh Fuell's customers have been spending more, he said.\n\n\"Business has been great. I wonder if it has that ripple effect here now because other people are on basic income in the community and have that little extra to come in ... go out for dinner, go out for lunch,\" he told HuffPost.\n\n\"You can see people out with that flexibility to spend a little more. That's a plus for everyone — for the person spending, for the person receiving.\"\n\n##  Global interest in basic income\n\nOntario is by no means the only place experimenting with a basic income of some sort. Over the past few years, projects have been set up in the Netherlands, Kenya, and Stockton, Calif., among other places, although Finland has announced its basic income experiment won't extend past its scheduled end this year. A number of municipalities in Scotland are currently setting up basic income projects as well.\n\nIn fact, Ontario officials have compared notes with those running the basic income projects in Finland and the Netherlands; the province's project was designed not to copy the European experiments.\n\nAll these schemes are happening today because of a recent, fundamental shift in thinking about work and inequality.\n\n\"Our economy has been creating vast wealth for people at the top and not doing the same for others,\" Segal said.\n\n\"A lot of thoughtful governments are beginning to ask themselves, are we dealing with the gap between rich and poor as effectively as we might, and what are the political costs of not doing so?\"\n\n![Segal](https://ipfs.io/ipfs/QmVyD2swP9UdLrqojSRQMwRok1H3SdbsEnsdWpRaaKkySh)\n_ Hugh Segal is the retired Conservative politician who essentially designed Ontario's basic income pilot project. _\n\nThe rapid rise of automation in the workforce has created the spectre of machines taking many of our existing jobs. A 2013 study from Oxford University estimated that 47 per cent of jobs in the U.S. are at risk from automation. We are facing the growing prospect that new industries and jobs will not appear quickly enough to employ all those who have become obsolete in the digital economy.\n\nThat's certainly the concern among many of the prominent high-tech executives who have come out in favour of a basic income scheme — among them Facebook founder Mark Zuckerberg and Tesla and SpaceX CEO Elon Musk.\n\n> Our economy has been creating vast wealth for people at the top and not doing the same for others. - Hugh Segal\n\nIt's also among the reasons Ontario's Liberal premier, Kathleen Wynne, gives for launching the province's basic income project.\n\n\"The realities of our uncertain economy, the technological change going on right now, the uncertainty of what work is going to look like ... all of that points to the fact we need to look at everything,\" Wynne said in an interview with HuffPost Canada.\n\nShe said that, growing up in the 1960s and 1970s, there was a lot of talk about how work would change.\n\n\"The three-day day work week hasn't come to fruition; instead, we see people piecing together different jobs,\" she said. \"The disruption of technology that we might have expected then is actually on us now. The urgency of this question has increased over the last decade. It's important and people are interested.\"\n\n![Musk](https://ipfs.io/ipfs/QmbGoJbaBoDvMofmNBpZCqa5NtVZBWeU8is8nTGFCpCMdk)\n_ Facebook CEO Mark Zuckerberg and Tesla and SpaceX CEO Elon Musk are proponents of basic income. _\n\nBut if the basic income has any chance of widespread adoption, it will have to overcome bipartisan political opposition. The criticism from conservatives is obvious — giving away \"money for nothing\" is morally objectionable from the right-wing point of view.\n\nBut there is resistance from the left as well. A number of socialist thinkers have come out against the idea, arguing that with a basic income, there will be less incentive to pay workers a living wage.\n\nIn the words of City University of New York professor and renowned anti-capitalist David Harvey, oligarchs like Musk and Zuckerberg \"know their technologies are putting people out of work by the millions and that those millions will not form a market for their products if they have no income.\"\n\n## The cost of basic income\n\nThere is, of course, the elephant in the room when it comes to the basic income: its cost.\n\nOntario's government is nowhere near estimating what a province-wide scheme would cost, but this month, the federal Parliamentary Budget Office issued a report estimating that if Ontario's scheme went nationwide, it would cost Canada $43 billion a year.\n\nBut proponents of the basic income say these studies fail to take into account the savings government would see in other areas if poverty was reduced.\n\n\"Poverty is the greatest predictor of hospitalization and health problems,\" Segal said. He points to research by University of Manitoba professor Evelyn Forget, who is credited with rediscovering a long-forgotten basic income experiment in Dauphin, Man., in the 1970s. When the town's residents were given a \"mincome\" for three years, use of the publicly funded health insurance system dropped by eight per cent, Forget's research showed.\n\n> Poverty is the greatest predictor of hospitalization and health problems. - Hugh Segal\n\nGiven that Canada spent an estimated $242 billion on health-care costs in 2017, a decrease of eight per cent nationally would amount to a savings of more than $19 billion on health care costs nationally, offsetting nearly half of the estimated cost of a basic income.\n\nMeanwhile, many wonder whether Ontario's basic income project can withstand the winds of political change. The province is heading towards an election in June, and \"there is a lot of risk\" that the project could be shelved by a future government, Wynne said, which would be \"a great shame.\"\n\n\"The info we can gain from this will be invaluable going forward,\" she said.\n\n![](https://ipfs.io/ipfs/QmcDSA6DqnztJYvwNwuLqDknj4LNoyfFX8q3QWMc4N1VDC)\n_ Ontario Premier Kathleen Wynne introduced the basic income project, and a spokesperson for Conservative Leader Doug Ford said he would continue it if elected in June. _\n\nThe governing Liberals are trailing in the polls to Doug Ford's Progressive Conservative party, and political commentators are urging Ford to end the basic income experiment as one way to reduce government spending.\n\nBut, in a move that surprised many observers, the Ford campaign has said it supports the pilot project.\n\n\"We look forward to seeing the results,\" a party spokesperson said in April — highlighting, again, the potential for a basic income to become a policy championed by both sides of the political aisle.\n\n> I've got no bad reviews of it. Nothing. - Sherry Mendowegan\n\nFor her part, Mendowegan hopes it isn't just seen to completion but also extended beyond three years.\n\n\"I've got no bad reviews of it. Nothing,\" she said. \"It's a huge difference in our lifestyle right now. It's more positive, the way that we're raising our kids now.\n\n\"When I was on Ontario Works, I did feel stressed, living monthly to monthly. With the pilot program, it's just a little bit more, but it helps us. We can do more with our families.\"\n\n_This story is part of HuffPost Canada's No Strings Attached project. We will be following the Mendowegan and Segura families on their journey with the Ontario pilot project, and examining the debate over the potential for basic income in a future where precarious work is increasingly common._"
		},
		{
			"post_id": 28,
			"title": "Los hechos probados de la sentencia del caso de La Manada",
			"date_published": 1524776101,
			"body": "\"La denunciante sintió un intenso agobio y desasosiego que le produjo estupor y le hizo adoptar una actitud de sometimiento\"\n---\nFuente: politica.elpais.com/politica/2018/04/26/actualidad/1524750769_505497.html\n\nLa sentencia de la Audiencia de Navarra por la que los cinco miembros de La Manada han sido condenados a 9 años de cárcel por abusos sexuales señala que la víctima sintió \"un intenso agobio y desasosiego\" en el portal en el que ocurrieron los hechos, \"que le produjo estupor y le hizo adoptar una actitud de sometimiento y pasividad, determinándole a hacer lo que los procesados le decían que hiciera, manteniendo la mayor parte del tiempo los ojos cerrados\". Estos son los hechos probados que detalla la sentencia:\n\n“A.- Los procesados: D. José Ángel Prenda Martínez, de 26 años de edad, con antecedentes penales no computables a efectos de reincidencia; D. Ángel Boza Florido, de 24 años, con antecedentes penales no computables a efectos de reincidencia; D. Antonio Manuel Guerrero Escudero, de 27 años, sin antecedentes penales; D. Alfonso Jesús Cabezuelo Entrena, de 27 años, con antecedentes penales no computables a efectos de reincidencia y D. Jesús Escudero Domínguez de 26 años, sin antecedentes penales; se encontraban sobre las 2:50 horas del día 7 de julio de 2016, en la Plaza del Castillo de Pamplona, donde se estaba celebrando un concierto con motivo de las fiestas de San Fermín.\n\nJosé Ángel Prenda Martínez estaba sentado en el segundo banco, entrando a la derecha a la Plaza del Castillo, cuando se acercó “la denunciante”, quien tenía 18 años, había llegado a Pamplona en un vehículo particular, sobre las 18:30 horas del día 6 de julio, acompañada de su amigo D. R. dejando estacionado el vehículo en el Soto de Lezkairu.\n\nAmbos subieron en dos ocasiones a la Plaza del Castillo, en la segunda, conocieron a un grupo de personas procedentes de Palencia y Castellón; R. se fue de la plaza sobre las 1:30 horas al lugar donde estaba estacionado el coche.\n\n\"La denunciante”, se mantuvo en la Plaza del Castillo con dichas personas, concretamente se intercambió el número de teléfono móvil con uno de los chicos que integraban el grupo procedente de Palencia : A., permaneció con el grupo, hasta el momento en que se fijó que había un chico que era el novio de una chica de su Universidad, se acercó a él y entabló conversación, estuvieron bebiendo, bailando y cantando hasta que le perdió de vista, en ese momento trató de dar con el grupo de Palencia y Castellón, al no lograrlo se sentó en el banco donde estaba José Ángel Prenda.\n\nEstando sentados en el banco “la denunciante” y José Ángel Prenda, ambos iniciaron una conversación, acercándose posteriormente al banco, primero Ángel Boza y después los otros tres acusados.\n\n“La denunciante” a las 2,57, 09, llamó desde su teléfono móvil al teléfono de A., con una duración de 25’.\n\nEl objeto de la llamada era obtener información sobre lo que iban a hacer, existían dificultades para la audición porque había mucho ruido y además había música como de bares, “la denunciante” le expresó algo similar a : ¿donde estáis? ¿Qué vais a hacer?, A. le contestó que : “… iban a por un bocadillo o algo así.” y la denunciante respondió : “… vale pues quedamos después para ir a ver los encierros.”, sin llegar a concretar la cita.\n\nDespués de esta llamada, “la denunciante”, dijo a los procesados que se iba a ir al coche para descansar, ofreciéndose estos para acompañarle.\n\nLas seis personas salieron sobre las 03:00:45 de la Plaza del Castillo introduciéndose, en el pasillo existente entre las carpas de las terrazas de los establecimientos de hostelería Casino Eslava y Bar Txoko, siguiendo por la Calle Espoz y Mina, donde dos de los procesados, no identificados, se acercaron al Hotel Europa quedándose retrasada “la denunciante”.\n\nEn este lugar, concretamente a la entrada del establecimiento, junto a la escalera que da acceso a la recepción, se hallaba el encargado de control de acceso de clientes al Hotel, D., a quien se dirigieron dichos dos procesados pidiéndole una habitación por horas “para follar”, indicándoles que eso no era posible y que se dirigieran a otros establecimientos; sin que la denunciante hubiera escuchado esta parte de la conversación.\n\nSeguidamente “la denunciante” y procesados siguieron su camino, por la Avenida de Carlos III en sentido ascendente dirección hacia la Plaza de la Libertad, girando a la derecha continuando por la calle Cortes de Navarra.\n\nEn este trayecto uno de los procesados, empezó a cogerle del hombro y de la cadera, “la denunciante” sintiéndose incómoda, propuso girar a la izquierda, tomando el inicio de la Calle Paulino Caballero.\n\nB.- Una vez en la calle Paulino Caballero, José Ángel Prenda reparó en que una mujer accedía al portal del inmueble número 5, después de mantener una breve conversación con ella, simulando que estaba alojado, cogió uno de los ascensores y subió al segundo piso, bajando al portal por las escaleras.\n\nSeguidamente, José Ángel Prenda abrió la puerta de acceso al portal.\n\nEntretanto, “la denunciante” y los otros cuatro procesados, permanecían apoyados en la pared divisoria del acceso a los garajes de los inmuebles número 3 y 5 de la Calle Paulino Caballero\n\nHallándose las cinco personas así ubicadas, Angel Boza y “la denunciante”, estaban besándose en la boca; mientras se hallaba en esa situación, José Ángel Prenda desde la puerta de acceso al portal, que mantenía abierta, dijo \"vamos, vamos\". En ese momento Ángel Boza, quien le había dado la mano para besarse, tiró de ella hacia él, cogiéndole de la otra mano Alfonso Jesús Cabezuelo; ambos la apremiaron a entrar en el portal tirando de “la denunciante”, quien de esa guisa entró en el recinto de modo súbito y repentino, sin violencia.\n\nCuando le introdujeron en el portal, los procesados, le dijeron \"calla\", significándole que guardara silencio mediante el gesto de llevarse la mano abierta a la boca.\n\nDe esa forma “la denunciante” y los procesados llegaron a la puerta ubicada en el interior de portal, situada a la izquierda de los ascensores, de vinilo traslúcido, mediante la que se accede a un rellano, entrando a este espacio, tras subir un tramo de cinco peldaños se accede a otro rellano, girando a la izquierda desde este espacio se accede por tres escalones a un habitáculo de forma irregular y tamaño reducido (unos 3 m²); concretamente se trata de una zona sin salida de 2,73 metros de largo, por 1,02 metros de ancho y 1,63 metros de ancho en la parte más amplia.\n\nCuando “la denunciante” accedió al primer rellano, la puerta de acceso, estaba abierta, tenía delante de ella a uno de los procesados y detrás a otros. De este modo fue dirigida por los procesados al habitáculo que se acaba de describir, donde los acusado le rodearon.\n\nAl encontrarse en esta situación, en el lugar recóndito y angosto descrito, con una sola salida, rodeada por cinco varones, de edades muy superiores y fuerte complexión, conseguida conforme a lo pretendido y deseado por los procesados y querida por estos, “la denunciante” se sintió impresionada y sin capacidad de reacción. En ese momento notó como le desabrochaban la riñonera que la llevaba cruzada, como le quitaban el sujetador sin tirantes abriendo un clip y le desabrochaban el jersey que tenía atado a la cintura; desde lo que experimentó la sensación de angustia, incrementada cuando uno de los procesados acercó la mandíbula de la denunciante para que le hiciera una felación y en esa situación, notó como otro de los procesados le cogía de la cadera y le bajaba los leggins y el tanga.\n\n“La denunciante” sintió un intenso agobio y desasosiego, que le produjo estupor y le hizo adoptar una actitud de sometimiento y pasividad, determinándole a hacer lo que los procesados le decían que hiciera, manteniendo la mayor parte del tiempo los ojos cerrados.\n\nLos procesados, conocieron y aprovecharon la situación de la denunciante en el cubículo al que la habían conducido, para realizar con ella diversos actos de naturaleza sexual, con ánimo libidinoso, actuando de común acuerdo.\n\nEn concreto y al menos “la denunciante” fue penetrada bucalmente por todos los procesados; vaginalmente por Alfonso Jesús Cabezuelo y José Ángel Prenda, éste último en dos ocasiones, al igual que Jesús Escudero Domínguez quien la penetró una tercera vez por vía anal, llegando a eyacular los dos últimos y sin que ninguno utilizara preservativo. Durante el desarrollo de los hechos Antonio Manuel Guerrero, grabó con su teléfono móvil seis vídeos con una duración total de 59 segundos y tomó dos fotos; Alfonso Jesús Cabezuelo Entrena, grabó del mismo modo un vídeo, con una duración de 39 segundos.\n\nFinalizados estos hechos, los procesados se marcharon escalonadamente.\n\nAntes de abandonar cubículo, Antonio Manuel Guerrero Escudero se apoderó, en su propio beneficio, del terminal de teléfono móvil, marca Samsung Galaxy nº IMEI XXXXXXXXX, valorado en 199,19 €, que “la denunciante” llevaba en su riñonera, quitándole la funda, extrayendo la tarjeta SIM de la compañía jazztel y la tarjeta de memoria, micro SD arrojándolas en el lugar de los hechos.\n\nEl primero en salir fue Ángel Boza Florido, sobre las 03:27:05 hs. siguiéndole progresivamente los restantes procesados, hasta que formaron un grupo.\n\nEntretanto “la denunciante”, cuando advirtió que se habían ido todos los procesados, se puso el sujetador, se subió los leggins y el tanga, luego, cogió el jersey atándoselo a las caderas; seguidamente buscó la riñonera para coger el teléfono móvil y llamar a R.. Cuando comprobó que el teléfono móvil no estaba en la riñonera, se incrementó su inquietud y desasosiego, comenzó a llorar, cogió su riñonera y salió del habitáculo a la calle llorando.\n\nLa denunciante”, accedió a las 03:29:45, a la Avenida de Roncesvalles, procedente de la Calle Paulino Caballero, continuó caminando sola y sin cruzarse con ninguna persona por dicha Avenida durante unos 20 segundos, hasta sentarse en el primer banco situado en la zona central de la Avenida.\n\nC.- “La denunciante” tomó asiento en el banco, llorando desconsoladamente, hasta el punto que llamó la atención de una pareja, que al verle llorar se desviaron de su trayectoria, dirigiéndose al banco para atenderle; llamaron al teléfono 112, personándose poco después una patrulla de la Policía Municipal.\n\nFue trasladada desde el lugar de los hechos hasta el Servicio de Urgencias de Complejo Hospitalario de Navarra, donde se le revisó ginecológicamente a partir de las 5: 20 horas, administrándosele tratamiento anticonceptivo de emergencia y profiláctico.\n\nComo consecuencia de los hechos “la denunciante” tuvo lesiones consistentes en : lesión eritematosa en zona de horquilla posterior en la zona de la cinco horarias para cuya curación precisó de una primera asistencia facultativa.\n\nSe le realizó una prueba de detección de alcohol que determino un resultado positivo de 0,91 +/- 0,05 g/l de alcohol en sangre y 1,46 +/- 0,06 g/l de alcohol en orina.\n\nD.- Los procesados José Ángel Prenda Martinez, Ángel Boza Florido y Jesús Escudero Domínguez, se dirigieron al Hotel Yoldi en el que pidieron una habitación sin obtenerla; seguidamente acudieron al Hotel Avenida donde intentaron dormir, introduciéndose a escondidas, sin conseguirlo. Más tarde entraron en el portal de una vivienda y accedieron al último piso, donde se quedaron a dormir, al tiempo Ángel Boza se fue del lugar, contactó con Antonio Manuel Guerrero y Alfonso Jesús Cabezuelo, quienes se habían quedado continuando la fiesta separados de los anteriores.\n\nA las 6.50 horas José Ángel Prenda Martinez, envió desde su teléfono móvil WhatsApp a dos chats: a “ la Manada”, al que pertenecen todos los procesados excepto Ángel Boza Florido, además de otras personas y a “ Disfrutones SFC.”. En estos WhatsApp escribió “follándonos a una los cinco” “todo lo que cuente es poco” “puta pasada de viaje” “hay video” en el remitido al chat “ la Manada” y “follándonos los cinco a una, vaya puto desfase, del ATC Madrid era, ja, ja”., en el enviado a “ Disfrutones SFC.”.\n\nSobre las 8:20 horas José Ángel Prenda, Ángel Boza, Antonio Manuel Guerrero y Alfonso Jesús Cabezuelo, fueron identificados por agentes de la Policía Foral de Navarra, en el callejón de la plaza de toros, dejándoles marchar.\n\nCuando salieron los cuatro procesados de la plaza de toros, Antonio Manuel Guerrero tiró el teléfono móvil de “la denunciante”, en una zona donde había desperdicios situada en la cuesta de Labrit, cerca del frontón; en este lugar fue recogido sobre las 9:30 horas por Dª\n\nPosteriormente los cuatro procesados, se juntaron con Jesús Escudero, desplazándose los cinco en autobús al barrio de San Jorge. Entretanto agentes de la Policía Foral de Navarra localizaron el vehículo Fiat XXXX matrícula XXXXX, con el que los acusados se habían desplazado a esta ciudad, estacionado en la calle Doctor Simón Blasco del Barrio de San Jorge, posteriormente fueron detenidos a las 11:15, horas del día 7 de julio de 2016, por agentes de la Policía Municipal de Pamplona.\n\nE.- Con carácter previo a los hechos “la denunciante” no presentaba ningún trastorno de la personalidad ni antecedentes de desestabilización psicológica, por el contrario tenía una adecuada adaptación en los distintos ámbitos (personal, educacional, social y familiar); como consecuencia de los mismos sufre trastorno de estrés postraumático. A partir del mes de septiembre de 2017, está recibiendo de forma continuada tratamiento psicológico administrado por el Centro de Atención Integral a Mujeres Víctimas de Agresión Sexual de la Comunidad de Madrid (CIMASCAM); no es posible la valoración de secuelas psicológicas al ser preciso que transcurra un tiempo de alrededor de dos años desde la producción de los hechos.\n\nF.- Los gastos irrogados al Servicio Navarro de Salud por la asistencia sanitaria prestada a “la denunciante” en el Servicio de Urgencia Hospitalaria y el Servicio de Obstetricia y Ginecología del Hospital Virgen del Camino, ascienden a 1.531,37 euros”."
		},
		{
			"post_id": 27,
			"title": "When Kim met Moon: All the key moments from a historic day",
			"date_published": 1524879391,
			"body": "![Hands](https://ipfs.io/ipfs/QmTyWimGCBALANV7nqn2nSzVrNfUinTiVeiLp9pAczie24)\n**(CNN) -** The first meeting between North Korea's Kim Jong Un and his counterpart Moon Jae-in was rich in symbolism, and moments made for the cameras to mark the historic occasion.\n---\nBy Euan McKirdy, CNN\nSource: edition.cnn.com/2018/04/27/asia/key-moments-korean-summit-intl/index.html\n\nThe world was watching when Kim stepped across the line that separates the divided Koreas to shake hands with Moon and take part in the the first face-to-face meeting of the two countries' leaders for more than a decade.\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/Qmet5cfBBDBVGh79jgdpWdE6NcMexMm3ttVtNC9vmMedsW\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n## Moon steps into North Korean territory\n\nWhile Kim had been expected to step onto the South Korean side of the demilitarized zone for Friday's summit, there had been no plans for Moon to do the same in the north.\nThat's when the highly-choreographed proceedings went off script.\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmWjEKZk3EiAUi3nPJds35dj4hrd8AWXTvpYYqdmxSKDbh\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\nA transcript of the conversation showed Kim said he \"was filled with excitement because of the meeting at this historic site.\" He added that he was \"very moved\" that Moon had \"come all the way to (the MDL) to greet him.\"\nWhen he asked Kim when it would be possible for him to visit the North, Kim said: \"Maybe this is the right time for you to enter the North Korean territory.\"\nKim then took Moon's hand and led him over the raised demarcation line to the northern side.\nIt was an impromptu decision by both sides, a spokesman for Moon said.\n\n## South faces North across oval table \n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmPJSHkk6wezkTEph7hJAHQNYsTY4pbnVxdUFvQ6Z7zFD6\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\nThe summit got underway when key officials, including Moon and Kim, took their places at a bespoke oval table in the Peace House on the South Korean side of the DMZ.\nThe table was made with special measurements in mind -- it's 2018 millimeters long and 1953 millimeters wide -- the year of the summit and the year of the ceasefire struck in the Korean War.\nKim's sister Kim Yo Jong sat beside her older brother, the only woman among six delegates, three from each country.\n\n## Jog to lunch\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmWM6xmfmsfuqiViRHY3BEuLcBBRvbaRcQLfrHZEvgRFTv\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\nAfter morning talks, Kim traveled back to the northern side of the demilitarized zone in a limousine surrounded by 12 bodyguards, who ran alongside the vehicle.\nNot one to take chances, despite being in one of the most secure locations in the world, Kim's car was followed by minders to and from the talks.\nThe car and the phalanx of guards reappeared after the lunch break, jogging back to the location of a tree-planting ceremony.\n\n## Planting roots\n\nThe day's events were rich in symbolism which extended to a ceremony involving a tree planted in 1953, the year the Korean War ceasefire was signed.\nWearing white gloves to grip their shovels, the leaders moved soil from the others' territory: Kim's came from a mountain on the southern island of Jeju, while Moon used earth from Mount Paektu in the north, before each leader watered the tree with water from the others' territory.\nThey unveiled a plaque near the tree that reads: \"Peace and prosperity planted,\" along with the names of the two leaders and the date.\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmUSt7BxNjEy5wqg7THDGBi8JncWUz9Gjue1Vjex565G55\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n## 30 minutes of private talks\n\nEarlier in the day, as Kim departed Pyongyang for the DMZ, North Korean state media said Kim would \"open-heartedly discuss\" issues relating to peace and prosperity on the Korean Peninsula.\nAfter the tree-planting ceremony, they seemed to do just that.\nThe two leaders made their way to a footbridge, which was recently repainted sky blue -- the same color as that of the Korean Unification Flag as well as the United Nations Flag -- and talked for around 30 minutes.\nThe entire conversation was aired live on television worldwide, though it was impossible to hear what was said.\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmNT8yVqSd1pcxahWMKxAmsGHqsyRChjgibYCdj8aaaB5e\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n## 'A new era of peace has just begun'\n\nThe day started with a handshake and ended with hugs.\nThe two leaders embraced after signing a declaration pledging to denuclearize the Korean Peninsula and formally end the Korean War. \n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/QmY2cCHnSrGvP8h2qaWvUyZC4M8h887g4Y47yUfvnkLCPe\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\nIn the document, called the \"Panmunjom Declaration for Peace, Prosperity and Unification on the Korean Peninsula,\" the countries vowed to end hostile acts towards each other.\n\"The two leaders solemnly declare ... that there will be no more war on the Korean Peninsula and a new era of peace has begun.\" "
		},
		{
			"post_id": 26,
			"title": "Matrix and Riot confirmed as the basis for France’s Secure Instant Messenger app",
			"date_published": 1524741391,
			"body": "Hi folks, We’re incredibly excited that the Government of France has confirmed it is in the process of deploying a huge private federation of Matrix homeservers spanning the whole government, and developing a fork of Riot.im for use as their official secure communications client! The goal is to replace usage of WhatsApp or Telegram for official purposes.\n---\nBy Matthew Hodgson, Source: **matrix.org/blog/2018/04/26/matrix-and-riot-confirmed-as-the-basis-for-frances-secure-instant-messenger-app/**\n\nIt’s a unbelievably wonderful situation that we’re living in a world where governments genuinely care about openness, open source and open-standard based communications – and Matrix’s decentralisation and end-to-end encryption is a perfect fit for intra- and inter-governmental communication.  Congratulations to France for going decentralised and supporting FOSS! We understand the whole project is going to be released entirely open source (other than the operational bits) – development is well under way and an early proof of concept is already circulating within various government entities.\n\nI’m sure there will be more details from their side as the project progresses, but meanwhile here’s the official press release, and an English translation too. We expect this will drive a lot of effort into maturing Synapse/Dendrite, E2E encryption and matrix-{react,ios,android}-sdk, which is great news for the whole Matrix ecosystem! The deployment is going to be speaking pure Matrix and should be fully compatible with other Matrix clients and projects in addition to the official client.\n\nSo: exciting times for Matrix.  Needless to say, if you work on Open Government projects in other countries, please get in touch – we’re seeing that Matrix really is a sweet spot for these sort of use cases and we’d love to help get other deployments up and running.  We’re also hoping it’s going to help iron out many of the UX kinks we have in Riot.im today as we merge stuff back. We’d like to thank DINSIC (the Department responsible for the project) for choosing Matrix, and can’t wait to see how the project progresses!\n\n### English Translation:\n#### The French State creates its own secure instant messenger\n\nBy the summer of 2018, the French State will have its own instant messenger, an alternative to WhatsApp and Telegram.\n\nIt will guarantee **secure, end-to-end encrypted conversations** without degradation of the user experience. It will be compatible with any mobile device or desktop, state or personal. In fact until now the installation of applications like WhatsApp or Telegram was not possible on professional mobile phones, which hindered easy sharing of information and documents.\n\nLed by the **Interministerial Department of State Digital, Information and Communication Systems** (DINSIC), the project is receiving contributions from the **National Agency for Information System Security** (ANSSI), the IT Directorship (DSI) of the **Armed Forces** and the **Ministry of Europe and Foreign Affairs**.\n\nThe tool developed is based on **open source software** (Riot) that implements an **open standard** (Matrix). Powered by a Franco-British startup (New Vector), and benefiting from many contributions, this communication standard has already caught the attention of other states such as the **Netherlands** and **Canada**, with whom DINSIC collaborates closely.\n\nThe Matrix standard and its open source software are also used by private companies such as Thales, which has driven the teams to come together to ensure the interoperability of their tools and cooperate in the development of free and open source software.\n\nAfter 3 months of development for a very limited cost, this tool is currently being tested in the State Secretary for Digital, DINSIC and in the IT departments of different ministries. It should be rolled out during the summer in administrations and cabinets.\n\n_**“With this new French solution, the state is demonstrating its ability to work in an agile manner to meet concrete needs by using open source tools and very low development costs. Sharing information in a secure way is essential not only for companies but also for a more fluid dialogue within administrations.” – Mounir Mahjoubi, Secretary of State to the Prime Minister, in charge of Digital.**_"
		},
		{
			"post_id": 25,
			"title": "Socks5 Proxies for Telegram",
			"date_published": 1523969091.856,
			"body": "Go to **Menu**, **Settings**, **Connection Type**, select **TCP with custom Sock5-Proxy** on **Hostname** use the IP number, on **Port** the port number. Select the values from the following list:\n\n<video controls style=\"max-width: 100%\" autoplay loop>\n  <source src=\"https://ipfs.io/ipfs/Qmezh4Y8zaQtrjN4EfbatbXXNC38hXozBhiSmQV5x7KEU4\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video>\n\n---\n\n| IP Number | Port | Country |\n| - | - | - |\n| 123.134.185.156 | 1080 | China |\n| 13.229.10.101 | 8080 | Singapore |\n| 98.162.25.29 | 31679 | United States |\n| 46.101.209.178 | 1080 | Germany |\n| 200.142.181.113 | 39880 | Brazil |\n| 216.144.230.233 | 15993 | United States |\n| 184.178.172.5 | 15303 | United States |\n| 222.52.76.50 | 1080 | China |\n| 70.168.93.218 | 17026 | United States |\n| 103.18.82.1 | 1080 | Bangladesh |\n| 120.199.64.163 | 1080 | China |\n| 114.99.24.155 | 1080 | China |\n| 47.74.240.77 | 8000 | Singapore |"
		},
		{
			"post_id": 24,
			"title": "Google Workers Urge C.E.O. to Pull Out of Pentagon A.I. Project",
			"date_published": 1522858346.896,
			"body": "WASHINGTON — Thousands of Google employees, including dozens of senior engineers, have signed a letter protesting the company’s involvement in a Pentagon program that uses artificial intelligence to interpret video imagery and could be used to improve the targeting of drone strikes.\n---\nSource: nytimes.com/2018/04/04/technology/google-letter-ceo-pentagon-project.html\nBy SCOTT SHANE and DAISUKE WAKABAYASHI\n\nThe letter, which is circulating inside Google and has garnered more than 3,100 signatures, reflects a culture clash between Silicon Valley and the federal government that is likely to intensify as cutting-edge artificial intelligence is increasingly employed for military purposes.\n\n> Dear Sundar,\n**We believe that Google should not be in the business of war. Therefore we  ask that Project Maven be cancelled, and that Google draft, publicize and enforce a clear policy stating that neither Google nor its contractors will ever build warfare technology.**\nGoogle is implementing Project Maven, a customized AI surveillance engine that uses “Wide Area Motion Imagery” data captured by US Government drones to detect vehicles and other objects, track their motions, and provide results to the Department of Defense.\nRecently, Googlers voiced concerns about Maven internally. Diane Greene \nresponded, assuring them that the technology will not “operate or fly drones” and “will not be used to launch weapons.” While this eliminates a narrow set of direct applications, the technology is being built for the military, and once it’s delivered it could easily be used to assist in these tasks.\n**This plan will irreparably damage Google’s brand and its ability to compete for talent.** Amid growing fears of biased and weaponized AI, Google is already  struggling to keep the public’s trust. By entering into this contract, Google will join the ranks of companies like Palantir, Raytheon, and General Dynamics. The argument that other firms, like Microsoft and Amazon, are also participating doesn’t make this any less risky for Google. Google’s unique history, its motto _Don’t Be Evil_, and its direct reach into the lives of billions of users set it apart.\nWe cannot **outsource the moral responsibility of our technologies to third parties**. Google’s stated values make this clear: \nEvery one of our users is trusting us. Never jeopardize that. Ever.\nThis contract puts Google’s reputation at risk andstands in direct opposition to our core values. \n**Building this technology to assist the US Government in military surveillance  – and potentially lethal outcomes – is not acceptable**.\n**Recognizing Google’s moral and ethical responsibility, and the threat to Google’s reputation, we request that you**:\n1. Cancel this project immediately\n2. Draft,publicize, and enforce a clear policy stating that neither Google nor \nits contractors will ever build warfare technology\n\n“We believe that Google should not be in the business of war,” says the letter, addressed to Sundar Pichai, the company’s chief executive. It asks that Google pull out of Project Maven, a Pentagon pilot program, and announce a policy that it will not “ever build warfare technology.”\n\nThat kind of idealistic stance, while certainly not shared by all Google employees, comes naturally to a company whose motto is “Don’t be evil,” a phrase invoked in the protest letter. But it is distinctly foreign to Washington’s massive defense industry and certainly to the Pentagon, where the defense secretary, Jim Mattis, has often said a central goal is to increase the “lethality” of the United States military.\n\nFrom its early days, Google has encouraged employees to speak out on issues involving the company. It provides internal message boards and social networks where workers challenge management and one another about the company’s products and policies. Recently, the heated debate around Google’s efforts to create a more diverse work force spilled out into the open.\n\nGoogle employees have circulated protest petitions on a range of issues, including Google Plus, the company’s lagging competitor to Facebook, and Google’s sponsorship of the Conservative Political Action Conference.\n\nEmployees raised questions about Google’s involvement in Project Maven at a recent companywide meeting. At the time, Diane Greene, who leads Google’s cloud infrastructure business, defended the deal and sought to reassure concerned employees. A company spokesman said most of the signatures on the protest letter had been collected before the company had an opportunity to explain the situation.\n\nThe company subsequently described its work on Project Maven as “non-offensive” in nature, though the Pentagon’s video analysis is routinely used in counterinsurgency and counterterrorism operations, and Defense Department publications make clear that the project supports those operations. Both Google and the Pentagon said the company’s products would not create an autonomous weapons system that could fire without a human operator, a much-debated possibility using artificial intelligence.\n\nBut improved analysis of drone video could be used to pick out human targets for strikes, while also better identifying civilians to reduce the accidental killing of innocent people.\n\nWithout referring directly to the letter to Mr. Pichai, Google said in a statement on Tuesday that “any military use of machine learning naturally raises valid concerns.” It added, “We’re actively engaged across the company in a comprehensive discussion of this important topic.” The company called such exchanges “hugely important and beneficial,” though several Google employees familiar with the letter would speak of it only on the condition of anonymity, saying they were concerned about retaliation.\n\nThe statement said the company’s part of Project Maven was “specifically scoped to be for non-offensive purposes,” though officials declined to make available the relevant contract language. The Defense Department said that because Google is a subcontractor on Project Maven to the prime contractor, ECS Federal, it could not provide either the amount or the language of Google’s contract. ECS Federal did not respond to inquiries.\n\nGoogle said the Pentagon was using “open-source object recognition software available to any Google Cloud customer” and based on unclassified data. “The technology is used to flag images for human review and is intended to save lives and save people from having to do highly tedious work,” the company said.\n\nSome of Google’s top executives have significant Pentagon connections. Eric Schmidt, former executive chairman of Google and still a member of the executive board of Alphabet, Google’s parent company, serves on a Pentagon advisory body, the Defense Innovation Board, as does a Google vice president, Milo Medin.\n\nIn an interview in November, Mr. Schmidt acknowledged “a general concern in the tech community of somehow the military-industrial complex using their stuff to kill people incorrectly, if you will.” He said he served on the board in part “to at least allow for communications to occur” and suggested that the military would “use this technology to help keep the country safe.”\n\nAn uneasiness about military contracts among a small fraction of Google’s more than 70,000 employees may not pose a major obstacle to the company’s growth. But in the rarefied area of artificial intelligence research, Google is engaged in intense competition with other tech companies for the most talented people, so recruiters could be hampered if some candidates are put off by Google’s defense connections.\n\nAs Google defends its contracts from internal dissent, its competitors have not been shy about publicizing their own work on defense projects. Amazon touts its image recognition work with the Department of Defense, and Microsoft has promoted the fact that its cloud technology won a contract to handle classified information for every branch of the military and defense agencies.\n\nThe current dispute, first reported by Gizmodo, is focused on Project Maven, which began last year as a pilot program to find ways to speed up the military application of the latest A.I. technology. It is expected to cost less than $70 million in its first year, according to a Pentagon spokeswoman. But the signers of the letter at Google clearly hope to discourage the company from entering into far larger Pentagon contracts as the defense applications of artificial intelligence grow.\n\nGoogle is widely expected to compete with other tech giants, including Amazon and Microsoft, for a multiyear, multibillion-dollar contract to provide cloud services to the Defense Department. John Gibson, the department’s chief management officer, said last month that the Joint Enterprise Defense Infrastructure Cloud procurement program was in part designed to “increase lethality and readiness,” underscoring the difficulty of separating software, cloud and related services from the actual business of war.\n\nThe employees’ protest letter to Mr. Pichai, which has been circulated on an internal communications system for several weeks, argues that embracing military work could backfire by alienating customers and potential recruits.\n\n“This plan will irreparably damage Google’s brand and its ability to compete for talent,” the letter says. “Amid growing fears of biased and weaponized AI, Google is already struggling to keep the public’s trust.” It suggests that Google risks being viewed as joining the ranks of big defense contractors like Raytheon, General Dynamics and the big-data firm Palantir.\n\n“The argument that other firms, like Microsoft and Amazon, are also participating doesn’t make this any less risky for Google,” the letter says. “Google’s unique history, its motto Don’t Be Evil, and its direct reach into the lives of billions of users set it apart.”\n\nLike other onetime upstarts turned powerful Silicon Valley behemoths, Google is being forced to confront the idealism that guided the company in its early years. Facebook started with the lofty mission of connecting people all over the world, but it has recently come under fire for becoming a conduit for fake news and being used by Russia to influence the 2016 election and sow dissent among American voters.\n\nPaul Scharre, a former Pentagon official and author of “Army of None,” a forthcoming book on the use of artificial intelligence to build autonomous weapons, said the clash inside Google was inevitable, given the company’s history and the booming demand for A.I. in the military.\n\n“There’s a strong libertarian ethos among tech folks, and a wariness about the government’s use of technology,” said Mr. Scharre, a senior fellow at the Center for a New American Security in Washington. “Now A.I. is suddenly and quite quickly moving out of the research lab and into real life.”\n"
		},
		{
			"post_id": 23,
			"title": "A radical proposal to keep your personal data safe ",
			"date_published": 1522724700,
			"body": "The surveillance imposed on us today is worse than in the Soviet Union. We need laws to stop this data being collected in the first place \n\nBy Richard Stallman, president of the Free Software Foundation\n\n---\nSource: **theguardian.com/commentisfree/2018/apr/03/facebook-abusing-data-law-privacy-big-tech-surveillance**\n\nJournalists have been asking me whether the revulsion against the abuse of Facebook data could be a turning point for the campaign to recover privacy. That could happen, if the public makes its campaign broader and deeper.\n\nBroader, meaning extending to all surveillance systems, not just Facebook. Deeper, meaning to advance from regulating the use of data to regulating the accumulation of data. Because surveillance is so pervasive, restoring privacy is necessarily a big change, and requires powerful measures.\n\nThe surveillance imposed on us today far exceeds that of the Soviet Union. For freedom and democracy’s sake, we need to eliminate most of it. There are so many ways to use data to hurt people that the only safe database is the one that was never collected. Thus, instead of the EU’s approach of mainly regulating how personal data may be used (in its General Data Protection Regulation or GDPR), I propose a law to stop systems from collecting personal data.\n\nThe robust way to do that, the way that can’t be set aside at the whim of a government, is to require systems to be built so as not to collect data about a person. The basic principle is that a system must be designed not to collect certain data, if its basic function can be carried out without that data.\n\nData about who travels where is particularly sensitive, because it is an ideal basis for repressing any chosen target. We can take the London trains and buses as a case for study.\n\nThe Transport for London digital payment card system centrally records the trips any given Oyster or bank card has paid for. When a passenger feeds the card digitally, the system associates the card with the passenger’s identity. This adds up to complete surveillance.\n\nI expect the transport system can justify this practice under the GDPR’s rules. My proposal, by contrast, would require the system to stop tracking who goes where. The card’s basic function is to pay for transport. That can be done without centralising that data, so the transport system would have to stop doing so. When it accepts digital payments, it should do so through an anonymous payment system.\n\nFrills on the system, such as the feature of letting a passenger review the list of past journeys, are not part of the basic function, so they can’t justify incorporating any additional surveillance.\n\nThese additional services could be offered separately to users who request them. Even better, users could use their own personal systems to privately track their own journeys.\n\nBlack cabs demonstrate that a system for hiring cars with drivers does not need to identify passengers. Therefore such systems should not be allowed to identify passengers; they should be required to accept privacy-respecting cash from passengers without ever trying to identify them.\n\nHowever, convenient digital payment systems can also protect passengers’ anonymity and privacy. We have already developed one: GNU Taler. It is designed to be anonymous for the payer, but payees are always identified. We designed it that way so as not to facilitate tax dodging. All digital payment systems should be required to defend anonymity using this or a similar method.\n\nWhat about security? Such systems in areas where the public are admitted must be designed so they cannot track people. Video cameras should make a local recording that can be checked for the next few weeks if a crime occurs, but should not allow remote viewing without physical collection of the recording. Biometric systems should be designed so they only recognise people on a court-ordered list of suspects, to respect the privacy of the rest of us. An unjust state is more dangerous than terrorism, and too much security encourages an unjust state.\n\nThe EU’s GDPR regulations are well-meaning, but do not go very far. It will not deliver much privacy, because its rules are too lax. They permit collecting any data if it is somehow useful to the system, and it is easy to come up with a way to make any particular data useful for something.\n\nThe GDPR makes much of requiring users (in some cases) to give consent for the collection of their data, but that doesn’t do much good. System designers have become expert at manufacturing consent (to repurpose Noam Chomsky’s phrase). Most users consent to a site’s terms without reading them; a company that required users to trade their first-born child got consent from plenty of users. Then again, when a system is crucial for modern life, like buses and trains, users ignore the terms because refusal of consent is too painful to consider.\n\nTo restore privacy, we must stop surveillance before it even asks for consent.\n\nFinally, don’t forget the software in your own computer. If it is the non-free software of Apple, Google or Microsoft, it spies on you regularly. That’s because it is controlled by a company that won’t hesitate to spy on you. Companies tend to lose their scruples when that is profitable. By contrast, free (libre) software is controlled by its users. That user community keeps the software honest.\n\n- Richard Stallman is president of the Free Software Foundation, which launched the development of a free/libre operating system GNU\n\nCopyright 2018 Richard Stallman. Released under Creative Commons NoDerivatives License 4.0"
		},
		{
			"post_id": 21,
			"title": "200,000,000 Monthly Active Users",
			"date_published": 1521738565,
			"body": "Within the last 30 days, Telegram was used by **200,000,000** people. This is an insane number by any standards. If Telegram were a country, it would have been the sixth largest country in the world.\n![Telegram 200 Million](https://ipfs.io/ipfs/QmV1LY6h7VAM57Bh3NknXy6sbi7bBYKVc6tEByDof2VFU5)\n---\n\nSource: https://t.me/durov/74\nPavel Durov\n\nWe owe reaching this milestone to you alone – our users. We have never promoted Telegram with ads, so all these **200 million people** are on Telegram because **you** invited them to join.\n\nThis is why you – our users – have been and will always be our only priority. Unlike other popular apps, Telegram doesn’t have shareholders or advertisers to report to. We don’t do deals with marketers, data miners or government agencies. Since the day we launched in August 2013 we haven’t disclosed a **single byte** of our users' private data to third parties.\n\nWe operate this way because we don’t regard Telegram as an organization or an app. For us, Telegram is an **idea**; it is the idea that **everyone on this planet has a right to be free**. \n\n> Above all, we at Telegram believe in **people**. We believe that humans are inherently intelligent and benevolent beings that deserve to be trusted; trusted with freedom to share their thoughts, freedom to communicate privately, freedom to create tools. This philosophy defines everything we do. \n\nThis was the reason why Telegram became the first messaging app to roll out end-to-end encryption to tens of millions of users in **2013**. This was also the reason why Telegram became the first mainstream messaging app to fully **open source its client code**, and why Telegram became the first popular messenger to provide **100% open APIs** for third party app and bot developers.\n\nOver the years, our unconditional trust in people allowed us to do things other apps were hesitant to implement; things such as support for insanely large group chats, unlimited broadcast channels and a free user-generated sticker platform. In all these cases, our belief in people yielded extraordinary results, and users put these tools to great use.\n\nWhat inspires us most is that, judging by the rapid growth of Telegram’s popularity, this belief might be mutual. While we unconditionally believe in people, it turns out **200,000,000** humans also believe in us.\n\nThank you for this – we will always have your back.\n\n![Telegram Ship](https://ipfs.io/ipfs/QmT7JuF58RNmziwJA83kxVUUnMNC4tqfok65LyYD3ux8Uj)"
		},
		{
			"post_id": 20,
			"title": "The Crypto- Keepers",
			"date_published": 1504537706,
			"body": "It’s 7:30 p.m. on a Monday in June at an undisclosed location somewhere in northern Europe. I’m sitting in a private dining room in an upscale hotel, talking to Pavel Durov—the “Mark Zuckerberg of Russia,” a young internet mogul who had built the country’s most popular social network and lost it to the Kremlin all before he turned thirty. Not long after the famed American whistleblower Edward Snowden had fled to Russia to avoid federal prosecution, Durov had offered Snowden a job—but then himself had to flee Russia because of a widening conflict with the Russian government. Initially hailed as a cyber-dissident because of his spat with the Kremlin, Durov has since drawn the repeated, aggressive interest of American intelligence officials, as well.\n\n---\nSource: https://thebaffler.com/salvos/the-crypto-keepers-levine\nBy: Yasha Levine\n\nA group of wealthy tourists milled around in the lobby, excitedly chattering about their day of sightseeing and museum tours. Our conversation was of a darker nature. Durov and I were talking about the murky, hyper-paranoid world of the crypto-obsessed privacy movement—a place where spies ruled, nothing was what it seemed, and no one could be trusted.\n\nFor me, the paranoia made sense. For the last three years I had been investigating the grassroots crypto tech accessories at the heart of today’s powerful privacy movement: internet anonymizers, encrypted chat apps, untraceable drop boxes for whistleblowers, and super-secure operating systems that even the NSA supposedly couldn’t crack. These tools were promoted by Pulitzer Prize-winning journalists, hackers, whistleblowers, and the biggest and most credible names in the privacy trade—from Edward Snowden to the Electronic Frontier Foundation and the American Civil Liberties Union. Apps like Tor and Signal promised to protect users from America’s all-seeing surveillance apparatus. And the cryptographers and programmers who built these people’s crypto weapons? Well, many of them claimed to live on the edge: subversive crypto-anarchists fighting The Man, pursued and assailed by shadowy U.S. government forces. Citing harassment, some of them had fled the United States altogether, forced to live in self-imposed exile in Berlin.\n\nAt least that’s how they saw themselves. My reporting revealed a different reality. As I found out by digging through financial records and FOIA requests, many of these self-styled online radicals were actually military contractors, drawing salaries with benefits from the very same U.S. national security state they claimed to be fighting. Their spunky crypto-tech also turned out, on closer inspection, to be a jury-rigged and porous Potemkin Village version of secure digital communications. What’s more, the relevant software here was itself financed by the U.S. government: millions of dollars a year flowing to crypto radicals from the Pentagon, the State Department, and organizations spun off from the CIA.\n\nMy investigation of this community had brought me a lot of abuse: smears and death threats lobbed by military contractors against me and my colleagues; false slanderous stories planted in the press about me being a sexist bully and a CIA agent paid to undermine trust in encryption. So I learned long ago to approach my sources with skepticism and wariness—especially someone as infamous as Durov, who had recently gotten into the crypto business with Telegram, which now enjoys the distinction of being ISIS’s favorite chat app.\n\n# Mogul on the Move\nDurov, who asked me to obscure the location of our meeting because of his ongoing conflict with the Russian government, was wary, too. He had a right to be.\n\nNow thirty-two, he is a multimillionaire—and, if the papers are to be believed, Russia’s most radical internet mogul. In 2006, while only twenty-two, he had cofounded VKontakte (“In Contact”), a Facebook social networking clone that became more popular in Russia and across the former Soviet Union than Facebook itself. The company didn’t stay under his control for long. In 2011, following mass opposition protests against Vladimir Putin’s ruling party organized largely via social media, the government wanted a firmer grasp over VKontakte. Durov resisted, and pulled off all sorts of acts of defiance: he took photos of documents ordering the company to block certain political groups and posted them online, and publicly mocked officials of Russia’s FSB state security forces.\n\nBut the Kremlin persisted, and finally got its way. Durov had wearied of the Russian state’s steady barrage of dramatic pressure tactics—including attempts by police to raid Durov’s apartment, a bizarre blackmail incident involving what Durov says was a fake video purporting to show him in a black Mercedes running over a traffic cop, and trumped-up criminal charges that forced him to flee the country. So in 2014, the young social media mogul was forced to sell his 20 percent stake of VKontakte to a business concern run by Uzbek-born Alisher Usmanov, a scary billionaire loyal to President Putin. Stripped of his empire, Durov could no longer claim to be the Zuckerberg of the Russian polis.\n\nDurov fled Russia and, after making a strategic investment on the two-\nisland nation of St. Kitts and Nevis, became a citizen of the Caribbean. For the past three years, he’s lived the life of an autonomous, self-facilitating multimillionaire, wandering the globe living in luxurious hotels, while forsaking material possessions like land and real estate. Durov could have done anything he wanted, and so while in exile, he worked with his elder brother Nikolai on the next big thing: channeling his time and wealth—estimated to be about $300 million—into the development of a new messaging app, Telegram.\n\nWith about 100 million users worldwide, Telegram is ten times smaller than Facebook’s WhatsApp, its closest competitor. But Telegram has found success in strange places: it’s huge in Iran and big in Uzbekistan. It’s got some users in Europe, as well as a growing fan base among Russia’s journalists. It’s also been a big hit with Al-Qaeda and ISIS, who seem to see Telegram as the most secure tool on the market. The groups have used the app’s encrypted chats to plan attacks, while deploying its “public channels” feature to broadcast propaganda, recruit lone-wolf terrorists and claim responsibility for successful strikes. Telegram has been implicated in attacks in France, Germany, Turkey and, most recently, in Durov’s hometown of St. Petersburg, where a lone suicide bomber struck a metro station in the heart the city, killing fifteen people and maiming many more.\n\n# Getting the Message\nNot surprisingly, the Russian government has again put Durov in its sights. Russian security officials have been pressuring him to share data with them, or risk having his service blocked. But the Russians aren’t the only ones trying to put the screws on Durov. Apparently, the Americans want a piece of the action, too.\n\nAs a waitress brought out a plate of bread and some appetizers—sliced squid and tuna tartar—Durov explained that over the past several years, the FBI has been attempting to pressure him into secretly cooperating with the agency, and that agents had gone as far as trying to bribe one of his developers into becoming a mole. He had never fully discussed the details of his run-ins with the FBI in public—until now.\n\nDurov says the pressure started in 2014, shortly after he sold his stake in VKontakte. That’s when he first started routinely getting interviewed and questioned by FBI agents on the American border. Sometimes they would detain him for further questioning on entry; other times they would catch up with him to “chat” while he was at the gate getting ready to board a plane. At first, the FBI was curious about his work portfolio at VKontakte and the company’s relationship with Russian law enforcement, including the procedures it followed for complying with government data requests. “I wasn’t comfortable with these questions,” he said. “I had no inclination of becoming an American mole, so I just provided them with the minimum information that was already available in the media.”\n\nOn later trips, though, FBI officials began asking about Telegram. Where was it based? How did it work? How could the FBI get in touch with Durov in the future? The agents followed up with friendly notes by email, telling Durov to reach out to them if he had trouble or needed help with anything. Durov says he continued to ignore the overtures, but the FBI clearly wanted something; the question was what. In 2016, Durov got his answer. That May, he flew from Europe to San Francisco to attend the annual Google I/O conference. The first morning of his visit, two FBI agents showed up unannounced at eight in the morning at a Mountain View home he was renting through Airbnb. “How did they get the address?” Durov asks. “Maybe they tracked my sim card? Followed me from the airport? Maybe they got the info from Uber? I don’t know.”\n\nIn any event, the two agents were clearly on a mission. “Right away they started asking about Telegram, which made me worry,” says Durov, explaining that it didn’t take long for his early-morning visitors to get to the point: the FBI wanted to set up some kind of informal backchannel process that would enable Telegram to hand over data on particular users in the event of a terrorist threat; they even came prepared with official-looking documents in hand. “They showed me a court order and told me, ‘We respect your values about privacy and cryptography very much, and we respect what you’re trying to do. But there is terrorism, it is a serious problem and we have a duty to protect society. We hope you understand and share our views. We want to create a process of data exchange so that you can help us when there is a terrorist threat,’” Durov recounted. During the twenty-minute interview, the agents made it clear they hoped that this was just the start of a long and fruitful relationship.\n\nTelegram is registered in the UK as Telegram Messenger LLP, a company owned by two other companies—one in the British Virgin Islands; the other in Belize. Its data is also cut up and spread out over multiple jurisdictions—part of Durov’s master plan that in theory made legal access to user data as difficult as possible. The company had no legal presence in the United States, and so the FBI had no real authority to demand anything from Durov or his company. Durov said he understood that the court order was a ruse—an attempt to get him to cooperate—but he played along and promised that he would get back to the agents after he had Telegram’s legal team look at the document.\n\nStill, Durov says he was a bit shaken by the experience. “In Russia, the FSB guys I’ve interacted with were not impressive. They were of middling ability; not really qualified. In the United States, the FBI is different. The ones who questioned me were competent. They spoke multiple languages. They had done their research, and knew exactly what questions to ask. They were of a high caliber. And I understood that America has so many resources dedicated to security that it is downright scary. Law enforcement in America is so much more efficient.”\n\n# Whack-a-Mole\nThe FBI agents went away, but they weren’t done. As Durov tells it, they also had set their sights on a Telegram developer who had flown in for the Google conference, and was also staying at the same Mountain View Airbnb with Durov. (An FBI spokesman declined to discuss any details of Durov’s account with The Baffler.)\n\nThis developer had already been stopped and questioned at the airport by agents from the FBI’s cyber division, but the FBI scheduled a follow-up meeting at a San Francisco café. The agents who met the developer there started by peppering him with general questions about Telegram’s architecture and how its encryption algorithm worked, all while lavishing him with praise for his expert knowledge. It didn’t take them long to get to what they really wanted: access, for which they were willing to pay. Durov would not disclose the name of this developer, but he recounted the story that his employee eventually told him. The FBI wanted to work out an arrangement in which the developer would secretly feed its operatives information about Telegram’s inner workings—things like new features and other components of the service’s architecture that they might want to know about. The arrangement would be strictly confidential, and they were willing to pay. “We will make it worth your while,” they said. They said he would be “consulting” for the FBI—a thinly veiled euphemism for what was clearly a pay-off. “The FBI agents gave him a range,” said Durov, munching on a piece of bread. “It was on the order of tens of thousands of dollars.”\n\nAfter the developer turned down the offer, the FBI met him one more time. This time, the FBI interviewers asked that he not say a word to anyone about their conversation—and especially not to tell his boss. “They were specific,” said Durov. “Don’t tell Pavel about this, this is our secret.”\n\nHe shrugged and smiled. It appeared that the FBI was unable to close the deal. “We pay our developers very well,” he said in a small flourish of managerial self-congratulation. “Our developers are all millionaires. Naturally they can’t be bribed with that kind of offer.”\n\nThe FBI trying to turn his own employee into a mole against him? I was expecting Durov to make a big deal out of this disclosure. Silicon Valley companies and crypto privacy types jump at any opportunity to paint themselves as victims of government oppression, and frequently blow up tiny incidents that might redound to their brand advantage in the secrecy wars. Think, for example, of how Apple turned the FBI’s request to unlock a single phone used in a 2015 terrorist attack in San Bernardino that left fourteen people dead into a stand against government oppression—even as the company was also submitting to China’s data demands. (In the end, of course, the FBI got the data it was seeking in the San Bernardino case by using a third-party data hack.) Or there was the recent case of a developer who had worked for Tor, an internet anonymity tool funded by the Pentagon, and fled to Germany after an FBI agent left his business card at her parents’ home.\n\nGiven Durov’s libertarian leanings and his proximity to that world, I thought he would start raving against government tyranny—but Durov was surprisingly, almost unnervingly, levelheaded and reasonable about the whole thing. He was troubled and upset by the FBI’s pressure tactics, and pledged to resist all attempts by the agency to get at Telegram’s data. But he wasn’t surprised that it happened, either. After all, that’s what the FBI was there to do. “Basically, the Americans are doing their job. Look at it from their perspective. Here’s a young guy, his app is used by terrorists. We need to find out who he is. What kind of team he has. This is logical. I don’t see anything extraordinary in this,” he said. “I could have gone public with this when it happened and made a big stink. ‘Look at me, look how the Americans are putting the screws on me.’ But I thought it would be a bit pretentious and melodramatic.”\n\nSo why make the story public now? Durov says that he’s coming forward to make a bigger point that’s typically lost in the self-dramatizing scripting of Silicon Valley showdowns with the Feds: what happened to Telegram is quite representative of how the government seeks to gain influence over big data services. “I’m raising this issue only to point out that American security agencies are persistent and pushy, and that they’re just carrying out their jobs. They’ll catch up with you at the airport. They show up unannounced at your Airbnb—the address of which no one should know but you. They try to pay off developers. One way or another, the FBI is very carefully doing its job, and they do all this in the span of just a couple of days that my team and I spend in America,” he says.\n\nIf the FBI was so persistent and pushy with Telegram—going as far as trying to bribe its employees while they are on a short business trip—then what does the U.S. government do to companies permanently based in America? “I can’t imagine myself or anyone else running a privacy-oriented app in that environment. They may start their information requests with data related to terrorism and then gradually widen it to who knows what.”\n\n# Encrypt or Die!\nIn June 2013, Edward Snowden engineered a data leak heard round the world. An NSA contractor working for the Beltway data and law colossus Booz Allen Hamilton, Snowden blew the whistle on America’s internet surveillance apparatus, and helped shine a light on the symbiotic relationship between Silicon Valley and the U.S. government.\n\nDocuments that he stole from an NSA facility in Hawaii provided the first real evidence that our most respected tech companies—including Google, Facebook, and Apple—worked closely with American spies, secretly tapping their own server farms for the NSA and FBI. Snowden’s dramatic leak put the issue of privacy on the internet on the map in a way that it had never been before.\n\nSuddenly, internet privacy was netting daily cable news coverage, Frontline investigations, and Pulitzer prizes. There were anti-surveillance protests, online campaigns, and a flurry of reports by government watchdogs and consumer rights nonprofits. Back in 2013, it seemed like we could be on the verge of a global movement that would galvanize people to push for meaningful privacy laws that would not only curb government surveillance, but put limits on Silicon Valley’s unrestricted data collection practices, as well. But things went a different way.\n\nNow, four years after the Snowden leak, we can see that all that energy and outrage and potential for civic action has been redirected into a narrow band of mass-politics-by-app. The new consensus, bruited loudly in and around Silicon Valley, holds that all we need to do to protect ourselves from surveillance is download whatever crypto chat app is in vogue at the moment, and run it on our iPhones. Instead of finding political and democratic solutions to the government and corporate surveillance crisis plaguing our society, the privacy movement somehow ended up in a libertarian rut. In remarkably short order, online privacy advocates had abandoned the idea that people and politics could change the world for the better, and instead chased something closer to an NRA fantasy: the idea that if everyone was equipped with a crypto weapon powerful enough, they could single-handedly take on both corporations and powerful spy agencies like the NSA. They could use technology to guarantee their own privacy on their own terms.\n\nEdward Snowden himself has been the principal promoter of this idea, never missing an opportunity to tell people that collective politics is useless, and that arming yourself with technology is where it’s at. He shrugged off the for-profit surveillance that powered the businesses of Silicon Valley, pithily telling the Washington Post that “Twitter doesn’t put warheads on foreheads.” Instead, he saw private companies like Apple and Facebook as allies—perhaps the only places that offered even a modicum of safety in the dangerous wilderness of the internet. To him, private developers and software engineers were the true protectors of the people, and he called on them to rise up against government oppression. “If you want to build a better future, you’re going to have to do it yourself. Politics will take us only so far and if history is any guide, they are the least reliable means of achieving the effective change . . . at the end of the day, law is simply letters on a page. They’re not gonna jump up and protect your rights,” he told the audience at Fusion’s 2016 Real Future Fair in Oakland via video-robot link from Moscow. To Snowden—now a leaker-\nturned-political-philosopher—political movements and collective action were fickle, merely human endeavors that offered no guarantees; encryption and computer technology was a sure thing, based on the laws of math and physics. “Technology works differently than law,” the fugitive leaker told the crowd at the Real Future Fair. “Technology knows no jurisdiction.”\n\nIt was an absurd position. Substitute “technology” with “assault rifle” and Snowden’s speech turns into something you’d hear at a Republican CPAC conference. Still, Snowden got a standing ovation at the Real Future Fair. And why not? From the moment Snowden appeared on the scene, his tech-centric worldview has been backed up by a chorus of award-winning journalists, privacy activists, left-leaning think-tankers, and powerful advocacy groups like the Electronic Freedom Foundation and the ACLU. Silicon Valley supported Snowden’s call to arms, as well. A brave new cohort of app developers backed very narrow technological privacy solutions that they claimed would protect their users from government snooping, all while shamelessly tracking these very same users for private profit and gain.\n\nAs it happened, Snowden’s call to encryption-arms helped inspire Pavel Durov to build Telegram. “I am far from politics and cannot lobby for a ban on total surveillance,” he wrote in October 2013, a few months after Snowden fled to Moscow and right before Durov in turn had to flee Russia. “But there is something that we as IT-entrepreneurs and programmers can do. We can develop and finance technologies aimed at making total surveillance technically impossible.”\n\nIn America, the initial movement to take the anti-surveillance fight to Silicon Valley fizzled and turned into something else that was at once bizarre and pathetic: privacy activists working with Google and Facebook to fight the NSA with privacy technology. This made precisely as much sense as siding with Blackwater (or Xe or Acadami or whatever the Pentagon contractor calls itself now) against the U.S. Army. Yet this trend of politics-by-app went into overdrive after Donald Trump was elected president. You saw it everywhere: civil libertarians, privacy advocates, and demoralized liberals arose to proclaim that encryption—even the stuff rolled out by Silicon Valley surveillance giants—was the only thing that could protect us from a totalitarian Trump administration.\n\n“Trump Is President. Now Encrypt Your Email,” urged New York magazine’s technology editor Max Read in an opinion piece published in the New York Times in March. “In the weeks after Donald J. Trump won the election, a schism threatened to break my group of friends in two. Not a political argument brought about by the president-elect, or a philosophical fight over the future of the country, but a question of which app we should be using to chat. . . .” Buzzfeed concurred: “Here’s How To Protect Your Privacy In Trump’s America: Easy tips to shield yourself from expanded government surveillance,” wrote the outlet, offering its millennial readers a listicle guide to “going dark” on the net.\n\nWhat were these apps? Who made them? Did they really work? That’s where the story got even stranger.\n\n# Secrets and Lies\nDurov’s involuntary encounters with the FBI drive home one unpleasant fact of life in the big data economy: today’s app-obsessed privacy movement relies almost entirely on crypto tools that were hatched and funded by America’s foreign policy apparatus—a body of agencies and organizations that came out of an old-school Cold War propaganda project run by the CIA.\n\nIn 1948, the CIA was given a blank check to wage a full-spectrum “covert operations” program to contain and roll back the spread of communism, starting with the Soviet Union and Eastern Europe. Radio propaganda was a central tool in this covert war of ideas, and the CIA used private front groups to run stations with names like “Radio Liberation from Bolshevism” and “Radio Free Europe.” In the 1950s and 1960s, the agency expanded its radio network to include operations targeting communist, left-leaning, and otherwise suspiciously reformist forces that might be spreading the dread bacillus of Bolshevism through Asia and Latin America.\n\nThe idea was to prevent these states from exercising sovereign control over their information space—as well as to dominate and influence people’s ideas in a way that aligned with America’s interests. As far as the CIA was concerned, this sub rosa propaganda operation was a beauty, and the agency still proudly boasts that it remains one of the most successful covert psychological warfare projects ever run by the United States.\n\nEventually, the CIA’s multi-tentacled propaganda operation shed its covert status, and was transformed by Congress into the Broadcasting Board of Governors, a sister federal agency to the State Department. With a nearly billion-dollar budget, today the BBG operates America’s sprawling foreign propaganda nexus. The American public is only dimly aware of the BBG’s existence, but this media empire leaves almost no corner of the world untouched by satellite, television and radio transmissions. And just as was the case nearly seventy years ago under the CIA, the mission of the BBG is to systematically perpetrate the very same thing that America’s esteemed political establishment is currently accusing Russia of doing: sponsoring news—some of it objective, some wildly distorted—as part of a broader campaign to project geopolitical power.\n\nBut there was more. When the internet spread around the world, it became a powerful medium of influence, and the U.S. government moved ruthlessly to exploit its competitive edge against rivals under the banner of “Internet Freedom.” The policy, put into place by Secretary of State Hillary Clinton, was about more than just broadcasting news. Its aim was to weaponize this global communications technology in all sorts of creative ways to weaken rivals, topple unfriendly governments, and support opposition movements from China to Russia and Iran, Syria, and Libya. “The Obama administration is leading a global effort to deploy ‘shadow’ internet and mobile phone systems that dissidents can use to undermine repressive governments that seek to silence them by censoring or shutting down telecommunications networks,” reported the New York Times in 2011, when the Internet Freedom program first got going in a major way.\n\n> The effort includes secretive projects to create independent cellphone networks inside foreign countries, as well as one operation out of a spy novel in a fifth-floor shop on L Street in Washington, where a group of young entrepreneurs who look as if they could be in a garage band are fitting deceptively innocent-looking hardware into a prototype ‘Internet in a suitcase.’ . . . The suitcase could be secreted across a border and quickly set up to allow wireless communication over a wide area with a link to the global Internet.\n\nThis was just the beginning. Over the next several years, the BBG, backed by the State Department, expanded the Internet Freedom initiative into a $50 million a year program funding hundreds of projects targeting countries across the world—China, Cuba, Vietnam, and Russia. And here things, yet again, took a turn for the surreal: the Internet Freedom apparatus was designed to project power abroad—yet it also emerged as the primary mover and shaker in America’s domestic privacy movement. It funded activists and privacy researchers, worked with the EFF and ACLU and even companies like Google. Wherever you looked, privacy tools funded by this agency dominated the scene. That included the most ardently promoted privacy products now on offer: Tor, the anonymous internet browsing platform that powers what’s known as the “dark web,” and Signal, the chat app championed by Edward Snowden. Both of them took in millions in government cash to stay afloat.\n\n# From a Whisper to a Scream\nWhen Pavel Durov first had VKontakte taken away from him by the Kremlin and fled Russia, he was hailed in the West as a hero—a modern-day Sakharov who fought for freedom and paid the price with his business. America’s crypto and privacy community embraced him, too. But it did not take long for the relationship to sour—and the chief culprit was Signal, a crypto mobile phone app built by a small opaque company called Open Whisper Systems, aka Quiet Riddle Ventures LLC.\n\nInvented by a self-styled radical cryptographer who goes by the name of Moxie Marlinspike (although his real name may or may not be Matthew Rosenfeld or Mike Benham), Signal was brought to life with funding from the BBG-supported Open Technology Fund (which has pumped in almost $3 million since 2013), and appears to rely on continued government funding for survival. Despite the service’s close ties to an organization spun off from the CIA, the leading lights of America’s privacy and crypto community back the app. “I use Signal every day. #notesforFBI,” Snowden tweeted out to legions of followers who went out and downloaded the app en masse. Marlinspike leveraged Snowden’s praise to the max, featuring the leaker’s endorsement prominently on his company’s website: “Use anything by Open Whisper Systems.”\n\nLargely thanks to Snowden’s endorsement and support, Signal has become the go-to encrypted chat app among American journalists, political organizers, and activists—from anarchists to Marxists to Black Lives Matter. These days, it’s also the secure planning app of first resort for opposition rallies targeting Trump. The app’s even made major inroads into Silicon Valley, with Marlinspike working with management at Facebook and Google to get them to adopt the chat app’s encryption architecture into their mobile chat programs, including WhatsApp. Not surprisingly, Facebook’s adoption of Signal into its WhatsApp program won plaudits from the BBG; managers at the propaganda shop boasted that government-funded privacy tools were now going to be used by a billion people.\n\nDespite Open Whisper’s continued ties to the U.S. government, leading lights of America’s privacy and crypto community have taken to warning off people from using anything else. That includes Telegram, which deploys a custom-built cryptographic technique designed by Pavel Durov’s brother, Nikolai, a mathematician. Even Snowden has taken it upon himself to shoo people away from Telegram, advising political activists, journalists, dissidents, whistleblowers—in short, everyone—to use Signal or even Facebook’s WhatsApp instead. “By default, it is less safe than @WhatsApp, which makes [it] dangerous for non-experts,” he tweeted in response to a question from a Telegram-curious supporter.\n\nBut for an app designed to hide people from the prying eyes of the U.S. government, Signal’s architecture has given some security and crypto experts pause. Its encryption algorithm is supposed to be flawless, but the app’s backend runs as a cloud service on Amazon, which is itself a major CIA contractor. The program also requires that users connect the app to a real mobile phone number and give access to their entire address book—strange behavior for an app that is supposed to hide people’s identities. Signal also depends on Google and Apple to deliver and install the app on people’s phone, and both of those companies are surveillance partners of the NSA. “Google usually has root access to the phone, there’s the issue of integrity. Google is still cooperating with the NSA and other intelligence agencies,” wrote Sander Venema, a developer who trains journalists on security. “I’m pretty sure that Google could serve a specially modified update or version of Signal to specific targets for surveillance, and they would be none the wiser that they installed malware on their phones.” And given Signal’s narrow marketing to political activists and journalists, the app works like a flag: it might encrypt messages, but it also tags users as people with something to hide—a big fat sign that says: “WATCH ME, PLEASE.”\n\nAnd anyway, Signal or no Signal, if your enemy was the United States government, it didn’t really matter what crypto app you used. A recent dump of CIA hacking-tool documents published by WikiLeaks revealed that the agency’s Mobile Devices Branch has developed all sorts of goodies to grab phone data, even when it’s quarantined by the firewalls of apps like Signal and WhatsApp or even Telegram. “These techniques permit the CIA to bypass the encryption of WhatsApp, Signal, Telegram, Wiebo, Confide, and Cloackman by hacking the ‘smart’ phones that they run on and collecting audio and message traffic before encryption is applied,” wrote WikiLeaks.\n\nDurov admitted that cryptography has its limits. Still, as he recounted how Snowden had talked down Telegram, Durov was frustrated and bewildered. He says he and his brother were very cautious about choosing cryptography techniques promoted by American experts—particularly since the NSA docs leaked by Snowden revealed the NSA secretly paid RSA, an influential computer security firm, to use a flawed technique that the NSA knew how to crack. The Durov brothers wondered if the same thing could now be happening with other popular encryption algorithms. They became even more concerned when Telegram began to draw public attacks on social media from American cryptography experts. “They based their criticism of our approach not on any actual weakness, but solely on the fact that we didn’t use the algorithms they were promoting,” he said. “Since they failed to engage in any meaningful conversation on cryptography, we started to realize there was some other agenda they were pushing rather than finding truth or maximizing security.”\n\nBut the attacks continued. Not only were Snowden and his crypto allies telling people to trust Facebook, a company that runs on surveillance and partners with the NSA; they were also promoting an app that was actively funded by the foreign policy wing of the U.S. national security state. It just didn’t make any sense.\n\nDurov was dumbfounded. As we sat talking, he told me he could not understand how people could trust a supposedly anti-government weapon that was being funded by the very same U.S. government it was supposed to protect its users from.\n\nI told him that I shared his bewilderment. Throughout all my reporting on this set of crypto radicals funded by a CIA spinoff, I asked a simple question that no one could properly answer: If apps like Signal really posed a threat to the NSA’s surveillance power, why would the U.S. government continue to fund them? I couldn’t help but think of how this alignment of government and corporate power would have been received among the tech and media establishment in the United States had something similar taken place in the former Soviet Union: imagine if the KGB funded a special crypto fax line and told Aleksandr Solzhenitsyn and dissident samizdat writers to use it, promising that it was totally shielded from KGB operatives. Then imagine that Solzhenitsyn would not only believe the KGB, but would tell all his dissident buddies to use it: “It’s totally safe.” The KGB’s efforts would be mercilessly ridiculed in the capitalist West, while Solzhenitsyn would be branded a collaborator at worst, or a stooge at best. Ridiculous as this fusion of tech and state interests under the rubric of dissidence is on the face of things, in America this plan can somehow fly.\n\nAs I laid out this analogy, Durov nodded in agreement. “I don’t think it’s a coincidence that we both understand how naïve this kind of thinking is, and that we were both born in the Soviet Union.”\n\n# Trusting the Force\nPolitical agreement wasn’t exactly what I was expecting when I prepared to meet with Pavel Durov. From what I had read in the press, our politics and view of the world could not be further apart. He was a libertarian, a guy who threw 5,000-ruble notes down at pedestrians just to watch them scramble and fight to pick them up, someone who tweeted out that Hitler and Stalin were no different on the day that people across the former Soviet Union celebrated their victory over Nazi Germany.\n\nStill, on a personal level, he was likeable and even humble. For someone in the crypto world, he was also unexpectedly realistic about the limits of cryptography, displaying none of the cult-like belief in technology that you see in America’s privacy movement. But there was something else as well: he was a fighter.\n\nBegin with the simple fact that he was publicly coming out to detail the FBI’s attempt to bribe his team and pressure Telegram into secretly working with the agency—despite Durov’s own disclaimers and efforts to downplay the revelation, it was a big deal. Despite being chased out of Russia, he wasn’t throwing in with the U.S. security apparatus, but electing instead to fight a two-front war. It was an unusual and impressive move. Most people who run afoul of politics in Russia and find themselves seeking safety in the West as modern-day dissidents usually fall into line with the West’s own propaganda aims, uncritically siding with American interests and players, no matter how unpleasant. Think Pussy Riot fleeing Russia and criticizing Vladimir Putin, while doing photo ops with Secretary of State Hillary Clinton.\n\nAs far as his cryptography, well, there’s no assurance that Telegram will prove to be more secure than its Silicon Valley rivals. Then again, there’s no way that the West’s spy-funded, profit-driven quest for online privacy can yield any reasonable approximation of the real thing, either.\n\nIn our post-Snowden world, we have outsourced our privacy politics to crypto apps. By doing so, we’ve entered a paranoid game theory nightmare world—a place where regular people have no true power and must put their faith in the people and organizations stoking the algorithms that make this crypto tech. In the end, it all comes down to trust. But can any of these people and organizations be really trusted? The young Russian mogul on the skids with the Kremlin? The former American spy-for-hire on the run and hiding out in Russia? Boutique crypto apps funded by the regime change wing of the State Department? Google and Facebook, who partner with the NSA?\n\nConfused? Don’t know who to trust? Well, that’s the state of our privacy movement today.\n"
		},
		{
			"post_id": 19,
			"title": "FBI attempts to backdoor Telegram",
			"date_published": 1504881900,
			"body": "If you haven’t read it yet, here’s the full story about the US agencies’ attempts to infiltrate Telegram last year:  http://127.0.0.1:43110/15ThY8kpAbjidWNfXHeyDT48noj6ArYjmz/?Post:20:The+Crypto-+Keepers\n\nIt tells how the FBI tried to influence me and bribe our engineer in May 2016 to make Telegram less secure. Luckily, since neither of us are US citizens, we could afford to refuse their offers and I was able to tell the public about these attempts. If we were American citizens, the FBI would have likely tried to silence us using a legal procedure called a \"gag order\" – when the US authorities can not only demand that you do something (like plant a backdoor into your app), but also prohibit you from telling the public about it (otherwise you can end up in jail).  \n\n---\n\nSource: https://t.me/durov/59\nBy: Pavel Durov\n\n\n\nThat whole story made me ask myself this question: if our team experienced such pressure during just one week’s trip to America, what kind of pressure are US-based tech companies facing every day? How can a privacy oriented company permanently operate from America? We can hope that the open US legal system would defend them, but due to the secrecy of these “gag orders” we would never even know if things went wrong. And unfortunately, Edward Snowden’s revelations confirm some of the worst fears.\n\nThe article also provides facts that confirm something that I always feared could be true – that some of the famous and most vocal US-based influencers within the cryptography world are sponsored by the US government to push the agenda of its agencies. Some past cases are widely known (like NSA infiltrating RSA), but it looks like the level of collaboration between US agencies and these influential “privacy advocates” is much deeper.\n\nAll of this makes protecting privacy really hard, particularly considering the fact that Google and Apple – the two companies which we are dependent on for mobile operating systems – are based in the US. I don't see any easy recipe or solution to fix this. I wish one day huge companies like Apple and Google can become independent of any government that distort the mission of their founders (maybe start their own countries?).\n\nUntil then, I’ll continue doing my part building Telegram and protecting our users, even if that will require speaking out under gag orders. I know this can probably get me into trouble some day, as it did in the past when I was living in Russia. But this is the only way I can imagine myself going forward, so I don't have and won’t have any regrets. It’s all worth it because of you guys – the millions of users who entrusted their private data to Telegram."
		},
		{
			"post_id": 18,
			"title": "WhatsApp vulnerability allows snooping on encrypted messages",
			"date_published": 1484316000,
			"body": "Exclusive: Privacy campaigners criticise WhatsApp vulnerability as a ‘huge threat to freedom of speech’ and warn it could be exploited by government agencies\n---\n\nSource: https://www.theguardian.com/technology/2017/jan/13/whatsapp-backdoor-allows-snooping-on-encrypted-messages\n\nA security vulnerability that can be used to allow Facebook and others to intercept and read encrypted messages has been found within its WhatsApp messaging service.\n\nFacebook claims that no one can intercept WhatsApp messages, not even the company and its staff, ensuring privacy for its billion-plus users. But new research shows that the company could in fact read messages due to the way WhatsApp has implemented its end-to-end encryption protocol.\n\nPrivacy campaigners said the vulnerability is a “huge threat to freedom of speech” and warned it could be used by government agencies as a backdoor to snoop on users who believe their messages to be secure.\n\nWhatsApp has made privacy and security a primary selling point, and has become a go to communications tool of activists, dissidents and diplomats.\n\nWhatsApp’s end-to-end encryption relies on the generation of unique security keys, using the acclaimed Signal protocol, developed by Open Whisper Systems, that are traded and verified between users to guarantee communications are secure and cannot be intercepted by a middleman. \n\nHowever, WhatsApp has the ability to force the generation of new encryption keys for offline users, unbeknown to the sender and recipient of the messages, and to make the sender re-encrypt messages with new keys and send them again for any messages that have not been marked as delivered.\n\nThe recipient is not made aware of this change in encryption, while the sender is only notified if they have opted-in to encryption warnings in settings, and only after the messages have been re-sent. This re-encryption and rebroadcasting effectively allows WhatsApp to intercept and read users’ messages.\n\nThe security loophole was discovered by Tobias Boelter, a cryptography and security researcher at the University of California, Berkeley. He told the Guardian: “If WhatsApp is asked by a government agency to disclose its messaging records, it can effectively grant access due to the change in keys.”\n\nThe vulnerability is not inherent to the Signal protocol. Open Whisper Systems’ messaging app, Signal, the app used and recommended by whistleblower Edward Snowden, does not suffer from the same vulnerability. If a recipient changes the security key while offline, for instance, a sent message will fail to be delivered and the sender will be notified of the change in security keys without automatically resending the message.\n\nWhatsApp’s implementation automatically resends an undelivered message with a new key without warning the user in advance or giving them the ability to prevent it.\n\nBoelter reported the vulnerability to Facebook in April 2016, but was told that Facebook was aware of the issue, that it was “expected behaviour” and wasn’t being actively worked on. The Guardian has verified the loophole still exists. \n\nSteffen Tor Jensen, head of information security and digital counter-surveillance at the European-Bahraini Organisation for Human Rights, verified Boelter’s findings. He said: “WhatsApp can effectively continue flipping the security keys when devices are offline and re-sending the message, without letting users know of the change till after it has been made, providing an extremely insecure platform.”\n\nBoelter said: “[Some] might say that this vulnerability could only be abused to snoop on ‘single’ targeted messages, not entire conversations. This is not true if you consider that the WhatsApp server can just forward messages without sending the ‘message was received by recipient’ notification (or the double tick), which users might not notice. Using the retransmission vulnerability, the WhatsApp server can then later get a transcript of the whole conversation, not just a single message.”\n\nThe vulnerability calls into question the privacy of messages sent across the service, which is used around the world, including by people living in oppressive regimes. \n\nProfessor Kirstie Ball, co-director and founder of the Centre for Research into Information, Surveillance and Privacy, called the existence of a vulnerability within WhatsApp’s encryption “a gold mine for security agencies” and “a huge betrayal of user trust”. She added: “It is a huge threat to freedom of speech, for it to be able to look at what you’re saying if it wants to. Consumers will say, I’ve got nothing to hide, but you don’t know what information is looked for and what connections are being made.”\n\nIn the UK, the recently passed Investigatory Powers Act allows the government to intercept bulk data of users held by private companies, without suspicion of criminal activity, similar to the activity of the US National Security Agency uncovered by the Snowden revelations. The government also has the power to force companies to “maintain technical capabilities” that allow data collection through hacking and interception, and requires companies to remove “electronic protection” from data. Intentional or not, WhatsApp’s vulnerability to the end-to-end encryption could be used in such a way to facilitate government interception.\n\nJim Killock, executive director of Open Rights Group, said: “If companies claim to offer end-to-end encryption, they should come clean if it is found to be compromised....In the UK, the Investigatory Powers Act means that technical capability notices could be used to compel companies to introduce flaws – which could leave people’s data vulnerable.”\n\nA WhatsApp spokesperson told the Guardian: “Over 1 billion people use WhatsApp today because it is simple, fast, reliable and secure. At WhatsApp, we’ve always believed that people’s conversations should be secure and private. Last year, we gave all our users a better level of security by making every message, photo, video, file and call end-to-end encrypted by default. As we introduce features like end-to-end encryption, we focus on keeping the product simple and take into consideration how it’s used every day around the world.\n\n“In WhatsApp’s implementation of the Signal protocol, we have a “Show Security Notifications” setting (option under Settings > Account > Security) that notifies you when a contact’s security code has changed. We know the most common reasons this happens are because someone has switched phones or reinstalled WhatsApp. This is because in many parts of the world, people frequently change devices and Sim cards. In these situations, we want to make sure people’s messages are delivered, not lost in transit.”\n\nAsked to comment specifically on whether Facebook/WhatApps had accessed users’ messages and whether it had done so at the request of government agencies or other third parties, it directed the Guardian to its site that details aggregate data on government requests by country.\n\nWhatsApp later issued another statement saying: “WhatsApp does not give governments a ‘backdoor’ into its systems and would fight any government request to create a backdoor.”\n\nConcerns over the privacy of WhatsApp users has been repeatedly highlighted since Facebook acquired the company for $22bn in 2014. In August 2015, Facebook announced a change to the privacy policy governing WhatsApp that allowed the social network to merge data from WhatsApp users and Facebook, including phone numbers and app usage, for advertising and development purposes.\n\nFacebook halted the use of the shared user data for advertising purposes in November after pressure from the pan-European data protection agency group Article 29 Working Party in October. The European commission then filed charges against Facebook for providing “misleading” information in the run-up to the social network’s acquisition of messaging service WhatsApp, following its data-sharing change."
		},
		{
			"post_id": 17,
			"title": "SpaceX first successful 2017 mission ",
			"date_published": 1484423384.268,
			"body": "![SpaceX’s Falcon 9 rocket at launchpad](https://ipfs.io/ipfs/Qmf4wSPDcetQJca5MnN6m8teMVsvsXwPdWE98DSuhGmXc7)\n\nSpaceX’s Falcon 9 rocket has delivered 10 satellites to low-Earth orbit for Iridium, a global leader in mobile voice and data satellite communications.\n---\nThe 10 satellites are the first of at least 70 satellites that SpaceX will be launching for Iridium’s next generation global satellite constellation, Iridium NEXT.\n\nSpaceX targeted launch of Iridium-1 was from Space Launch Complex 4E at Vandenberg Air Force Base in California. The instantaneous launch window opened on January 14 at 9:54:39 am PST or 5:54:39 pm UTC. The satellites was began deployment about an hour after launch.\n\n![Falcon 9 first stage has landed on Just Read the Instructions](https://ipfs.io/ipfs/QmUwjPyBAaGFnDQVtJSAoLb9tYHYpqREUpdrC9HHRDRVDV)\n\nFalcon 9 first stage has landed on Just Read the Instructions."
		},
		{
			"post_id": 16,
			"title": "First payments of basic income go out today",
			"date_published": 1484079192.035,
			"body": "The Finnish basic income experiment is being conducted  among 2,000 persons between ages 25 and 58, who will receive a monthly basic income of €560 for two years. They will receive their first basic income payments from Kela today. \n---\n\nSource: http://www.kela.fi/web/en/news-archive/-/asset_publisher/lN08GY2nIrZo/content/first-payments-of-basic-income-go-out-today?_101_INSTANCE_3a1vR0IztzeZ_redirect=%2Fweb%2Fen\n\nThose participating in the experiment will be paid a basic income from 1 January 2017 until 31 December 2018. The payments are made on the second business day of each month, with the exception of January 2017, when the payment date is 9 January 2017.\n\nThe amount of the basic income will remain the same throughout the experiment. The basic income is also not reduced by any earned income that the participants may have. Participants who find work during the experiment continue to be paid a basic income.\n\nAccording to Marjukka Turunen, head of Kela's legal affairs unit, one of the most common questions is if it is really true that you can keep the basic income even if you work part-time, for instance. \"When we reply that the purpose of the basic income is specifically to encourage recipients to seek employment, we get a very positive reaction.\n\n## Have you been selected to participate in the basic income experiment? Please keep in mind the following:\n\nIf you have been selected for the experiment, please report any benefits or restrictions that hinder payment of the basic income. Payment of the basic income will be interrupted, for example, if you start military service, are granted a pension or move abroad.\n\nDuring the experiment, the participants will be monitored in terms of their success in finding employment. However, the monitoring will primarily be based on register data. It is not necessary to notify Kela if you receive a basic income and find work during the experiment. The basic income is tax free and does not affect the amount of your taxable income.\n\nOther social benefits will be governed by the same rules as before.\nAccording to Marjukka Turunen, if someone finds work during the experiment, any earnings they have will affect for example the general housing allowance and social assistance. People may lose their entitlement to such benefits if they find work and their earnings exceed a certain limit.\n\nThe basic income replaces unemployment benefits either partially or completely. For example, if the unemployment benefit, including increases for children, is larger than the basic income, the difference between the unemployment benefit and the basic income is paid to the basic income recipient. The qualifying conditions for labour market subsidy and basic unemployment allowance payments remain the same, as do the practical steps required when receiving unemployment benefits. This means that anyone receiving unemployment benefits along with a basic income will need to complete unemployment status reports and submit them to Kela. Participation in the basic income experiment need not be indicated in the unemployment status report.\n\nAdditional information: kela.fi/basicincome\n"
		},
		{
			"post_id": 15,
			"title": "AÑO DE LAS ENERGÍAS RENOVABLES",
			"date_published": 1483559622.783,
			"body": "Declárase el Año 2017 como el “AÑO DE LAS ENERGÍAS RENOVABLES”\n---\nFuente: https://www.boletinoficial.gob.ar/#!DetalleNorma/157240/20170104\n\nDecreto 9/2017\n\nDocumentación oficial. Leyenda.\n\nBuenos Aires, 03/01/2017\n\nVISTO y CONSIDERANDO:\n\nQue a partir de la sanción de la Ley Nº 27.191, modificatoria de la Ley N° 26.190 por la que se estableció el “Régimen de Fomento Nacional para el Uso de Fuentes Renovables de Energía Destinada a la Producción de Energía Eléctrica”, se ha iniciado un proceso que apunta a lograr una contribución de las fuentes renovables de energía hasta alcanzar el VEINTE POR CIENTO (20%) del consumo de energía eléctrica nacional, al 31 de diciembre de 2025.\n\nQue, asimismo, la búsqueda de la diversificación energética mediante fuentes limpias, se ha tornado una política de estado, en línea con los compromisos asumidos por la REPÚBLICA ARGENTINA con la adopción del “Acuerdo de París”, celebrado en el marco de la COP21, y aprobado por la Ley N° 27.270.\n\nQue en este sentido, se destaca que el aprovechamiento de los recursos energéticos renovables tanto para la generación de electricidad como para usos térmicos, tiene numerosos beneficios que incluyen, en primer lugar, la reducción de emisiones de gases de efecto invernadero y otros gases nocivos que están asociados al uso de combustibles fósiles; en segundo lugar, la seguridad energética al no depender de otros países para el aprovisionamiento de energía; y por último, la creación de empleos locales calificados tanto para la instalación como para la fabricación de componentes y equipamiento, así como también para la provisión de servicios de mantenimiento.\n\nQue durante el año 2016 se llevaron adelante numerosas acciones tendientes a incentivar la inversión a gran escala en el sector de energías renovables. Las principales acciones se englobaron en el denominado Programa RenovAr, a partir del cual se adjudicaron 59 proyectos que, una vez instalados, aportarán una cantidad de energía eléctrica equivalente al 6% de la demanda nacional.\n\nQue en esta línea, durante el año 2017, se prevé avanzar en la realización de las obras necesarias para comenzar a disfrutar de nuevas fuentes de energía limpia y amigable con el ambiente, que resultan indispensables para el desarrollo del país.\n\nQue en virtud de lo expresado en los considerandos anteriores, corresponde resaltar y difundir en el año 2017 la importancia del uso de las energías renovables para el desarrollo del país, en un ambiente sustentable.\n\nQue la presente medida se dicta en uso de las facultades conferidas por el artículo 99, inciso 1, de la CONSTITUCIÓN NACIONAL.\n\nPor ello,\n\nEL PRESIDENTE\nDE LA NACIÓN ARGENTINA\nDECRETA:\n\nARTÍCULO 1° — Declárase el Año 2017 como el “AÑO DE LAS ENERGÍAS RENOVABLES”.\n\nARTÍCULO 2° — Dispónese que durante el Año 2017, toda la documentación oficial de la ADMINISTRACIÓN PÚBLICA NACIONAL, centralizada y descentralizada, así como en los Entes autárquicos dependientes de ésta, deberá llevar la leyenda “2017 - AÑO DE LAS ENERGÍAS RENOVABLES”.\n\nARTÍCULO 3° — En orden a lo establecido en el artículo 1° del presente, el PODER EJECUTIVO NACIONAL auspiciará actividades, seminarios, conferencias y programas educativos que contribuyan a la difusión en el país de diferentes aspectos relativos al desarrollo y uso de las energías renovables.\n\nARTÍCULO 4° — Invítase a los Gobiernos Provinciales y al de la CIUDAD AUTONOMA DE BUENOS AIRES a adherir al presente decreto.\n\nARTÍCULO 5° — Comuníquese, publíquese, dése a la DIRECCIÓN NACIONAL DEL REGISTRO OFICIAL y archívese. — MACRI. — Marcos Peña.\n\nFecha de publicación 04/01/2017"
		},
		{
			"post_id": 14,
			"title": "Hayao Miyazaki Calls Artificial Intelligence Animation ‘An Insult To Life Itself’",
			"date_published": 1481657640,
			"body": "![Hayao Miyazaki](https://ipfs.io/ipfs/QmW66yUvyhuKAij8t7R39Vu5tqUX99ooWywfahEK2Koe2h)\n\nMiyazaki says he would \"never wish to incorporate this technology\" into his work.\n---\n\n_Vikram Murthi_\n\nSource: http://www.indiewire.com/2016/12/hayao-miyazaki-artificial-intelligence-animation-insult-to-life-studio-ghibli-1201757617/\n\nStudio Ghibli director Hayao Miyazaki, responsible for such animation classics as “Spirited Away” and “My Neighbor Totoro,” recently came out of retirement for a new short film entitled “Boro the Caterpillar” and an untitled feature film. Before audiences around the world see new work from the legendary filmmaker, they can watch him articulate his principles regarding animation. In a widely-circulated clip from NHK’s documentary series “NHK Special: Hayao Miyazaki — The One Who Never Ends,” Miyazaki lays down his opinions on AI animation, i.e. animation created by artificial intelligence. Watch the clip below.\n\nAfter seeing a brief demo of a grotesque zombie-esque creature, Miyazaki pauses and says that it reminds him of a friend of his with a disability so severe he can’t even high five. “Thinking of him, I can’t watch this stuff and find [it] interesting. Whoever creates this stuff has no idea what pain is whatsoever. I am utterly disgusted. If you really want to make creepy stuff, you can go ahead and do it. I would never wish to incorporate this technology into my work at all. I strongly feel that this is an insult to life itself.”\n\nNear the end of the clip, after hearing that the animators’ goal is to create a machine that “draws pictures like humans do,” Miyazaki’s comments are even more grim. “I feel like we are nearing to the end of the times. We humans are losing faith in ourselves…”\n\nMiyazaki’s “Boro the Caterpillar” will premiere at the Studio Ghibli museum in Mitaka, Tokyo by June or July 2017.\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"https://ipfs.io/ipfs/QmYxB3tEQuLZGzGRrhVHXq6ijZTkQenUEYEJYwSL3EiZsN\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> "
		},
		{
			"post_id": 13,
			"title": "A universal basic income: the answer to poverty, insecurity, and health inequality?",
			"date_published": 1481582127,
			"body": "Early evidence suggests substantial health dividends\n---\nSource: http://www.bmj.com/content/355/bmj.i6473\n\nFor four years in the mid-1970s an unusual experiment took place in the small Canadian town of Dauphin. Statistically significant benefits for those who took part included fewer physician contacts related to mental health and fewer hospital admissions for “accident and injury.” Mental health diagnoses in Dauphin also fell. Once the experiment ended, these public health benefits evaporated.1 What was the treatment being tested? It was what has become known as a basic income—a regular, unconditional payment made to each and every citizen. This ground breaking experiment, an early randomised trial in the social policy sphere, ran out of money before full statistical analysisafter a loss of political interest.\n\nThe link between inequality and poor health outcomes is long established.2 The actual mechanisms behind that link are less understood. The data from the Dauphin study, re-examined by a team from the University of Manitoba in the 2000s, suggest there might be an association between income insecurity and poorer health.1 All adults in Dauphin earning below $13 800 (£11 000; €13 000) were eligible for the grant of $4800 a year. The researchers compared Dauphin with other similar towns and looked for relative improvements in outcomes using public health and schooling data from the time.\n\nRecently, there have been increasing calls for dialogue on a universal basic income (UBI) from political parties, think tanks (including the Royal Society for the Encouragement of Arts, Manufactures, and Commerce (RSA)), civic activists, trade unions, and leading entrepreneurs such as Tesla chief executive Elon Musk. These calls are a response to growing income insecurity, some sense that welfare systems may be failing, and as a preparation for the potential effects of automation and artificial intelligence on employment prospects in industries that might be better served by machines.3 UBI-style pilots are planned in Finland, the Netherlands, and Canada as a potential answer to these questions and concerns.4\n\nWhile the Dauphin study included just the poorest residents of one small city, if we assume that it indicates a causal link between extra cash and better health then three effects could have been in play. Firstly, the cash sum itself would have reduced economic inequality directly. Secondly, the unconditional nature of the payment could have reduced income insecurity. Thirdly, there is a positive social multiplier whereby positive behaviours associated with greater financial security tend to reinforce one another—for example, more teenagers staying on in school because they see their peers doing likewise. Taken together, these effects could mean that financial insecurity is a key vector through which inequality worsens health outcomes for the least advantaged. It is certainly a serviceable hypothesis.\n\nDauphin was not an isolated study. A little known, unintentional, basic income pilot took place in North Carolina during the 1990s. Four years into a longitudinal comparative mental health study of Cherokee American Indian and non-American Indian children from ages 9 to 16, a casino was built on Cherokee land. As part of the deal, all Cherokee Indian adults received a share of the profits—roughly $4000 per year each.\n\nThe results were again striking. Children whose families received the payments showed significantly better emotional and behavioural health by age 16 relative to their non-tribal peers, who did not receive payments. Parents also reported that the drug and alcohol intake of their partners decreased after the payments began.5 These reported changes among adults were uncontrolled observations, but the researchers noted no other major policy changes during the study.\n\nMullainathan and Shafir describe a process of cognitive “bandwidth scarcity” whereby scarcity of resources impedes sound decision making with clear potential for negative health outcomes.6 The Canadian and North Carolina case studies suggest that bandwidth scarcity could be confronted through an unconditional universal basic income. Complex systems of tax credits and social security, such as currently used in the UK, send confusing signals, not least through poorly understood and sometimes arbitrary conditions and welfare sanctions that create new hardships for recipients.\n\nHealth professionals should be concerned. The evidence suggests that a universal basic income could help improve recipients’ mental and physical health. The RSA has already called for a trial of a universal basic income in the UK.7 It would give people a better foundation and greater control over their lives in and out of work. Failure to test this promising intervention in a rigorous way would be a failure of government and a missed opportunity to invest in the health and wellbeing of an increasingly insecure and unequal society.\n\n## Footnotes\nCompeting interests: I have read and understood BMJ policy on declaration of interests and declare that the RSA advocates for universal basic income in the UK.\n\n_Provenance and peer review: Commissioned; not externally peer reviewed._\n\n## References\n\n1. ↵Forget EL. The town with no poverty: using health administration data to revisit outcomes of a Canadian guaranteed annual income field experiment. 2011. https://public.econ.duke.edu/~erw/197/forget-cea%20(2).pdf\n1. ↵Pickett K, Wilkinson R. The spirit level: why more equal societies almost always do better. 2009. https://www.equalitytrust.org.uk/resources/the-spirit-level\n1. ↵Ford M. Rise of the robots: technology and the threat of a jobless future.Oneworld Publications, 2015.\n1. ↵Kela. Experimental study on a universal basic income. http://www.kela.fi/web/en/experimental-study-on-a-universal-basic-income\n1. ↵Akee R, Simeonova E, Costello EJ, Copeland W. How does household income affect child personality traits and behaviors? NBER working paper No 21562. 2015. http://www.nber.org/papers/w21562\n1. ↵Mullainathan S, Shafir E. Scarcity: why having too little means so much.Allen Lane, 2013.\n1. ↵RSA. Creative citizen, creative state—the principled and pragmatic case for a universal basic income. 2015. https://www.thersa.org/discover/publications-and-articles/reports/basic-income"
		},
		{
			"post_id": 12,
			"title": "The World's First Open Source RISC-V-based 32-bit μC",
			"date_published": 1481309362,
			"body": "![](https://ipfs.io/ipfs/Qme6GP1KPotLaWqJiYNMi2tKaoL4N4FyhYDqJGLGv4ZyR4)\n\nThe OnChip Open-V microcontroller is a completely free (as in freedom) and open source 32-bit microcontroller based on the RISC-V architecture.\n---\nSource: https://www.crowdsupply.com/onchip/open-v\n\n![](https://ipfs.io/ipfs/QmUH8oLkZRgXsZivrQsvkb9jqfpisRweFjL2aQTQw8ovoX)\n\nThe Open-V has a host of built-in peripherals you’d expect of any modern microcontroller and was designed to compete with the capabilities of ARM M0-based microcontrollers. This crowdfunding campaign will bring the Open-V into mass production and make it widely available to anyone. If you love hacking on embedded controllers, breaking down closed-source barriers, having the freedom to learn how things work even down to the transistor level, or have dreamed of spinning your own silicon, then this campaign is for you and we need your help!\n\n## First Mass-produced RISC-V Chip\nThe Reduced Instruction Set Computing (RISC) paradigm has been around for decades and many processors fall into this category. RISC-V (pronounced “risk-five”) is a particular implementation of RISC concepts as an open source instruction set architecture (ISA). Although the RISC-V standard has been around (and evolved) since 2010, it has never been used in a chip available on the open market. Some chips have been manufactured using RISC-V, but they have been relegated to the research lab and academia. We’re going to change that. With the OnChip Open-V, for the first time ever, you will be able to purchase a RISC-V-based chip and use it in real projects and products. This isn’t just a one-time thing - we’re planning on keeping the Open-V in production for as long as there is demand. Our initial manufacturing run will produce approximately 70,000 chips.\n\n![An Open-V bare die](https://ipfs.io/ipfs/Qmc5vHf5gD3LiJRKPK8tM69rxDQnHkSWdrspCWVfquWXPf)\n_An Open-V bare die_\n\n## Free and Open Source Silicon\nWe’ve open sourced all files for the entire OnChip Open-V design, including the register-transfer level (RTL) files for the CPU and all peripherals and the development and testing tools we use. These sources are available under the MIT license from our GitHub account.\n\nWe think open source integrated circuit (IC) design will give the semiconductor industry the reboot it needs to get out of the deep innovation rut dug by the entrenched players. Just like open source software ushered in the last two decades of software innovation, open source silicon will unleash a flood of hardware innovation. The Open-V microcontroller is one concrete step in that direction.\n\nWith open silicon, you can:\n- completely understand how your hardware works\n- build customized ICs without reinventing the wheel\n- optimize performance by tuning parameters usually hidden\n- teach a new generation of engineers with a real-world example\n- debug and even correct errors in a chip without waiting for the vendor\n- reduce costs by cutting out licensing fees\n\n![A bare Open-V die wire bonded to our OSH Park test board](https://ipfs.io/ipfs/QmY3rZF7ebeQq9FwVyut23XCo9jD5EfQKWeqaewg2HfPXW)\n_A bare Open-V die wire bonded to our OSH Park test board_\n\n## Chips & Development Boards\nIn this campaign, you can order the Open-V chips themselves and a development board we’ve designed around the Open-V chip.\n\n### Open-V Chip Specifications\n - Package\n  - QFN-32\n  - No other packages are planned for the first run\n - Processor\n  - RISC-V ISA version 2.1\n  - 1.2 V operation\n - Memory\n  - 8 KB SRAM\n - Clock\n  - 32 KHz - 160 MHz\n  - Two PLLs, user-tunable with muxers and frequency dividers\n  - includes all clocking and bias circuitry\n - Analog Signals\n  - Two 10-bit ADC channels, each running at up to 10 MS/s\n  - Two 12-bit DAC channels\n - Timers\n  - One general-purpose 16-bit timer\n  - One 16-bit watch dog timer (WDT)\n - General Purpose Input/Ouput\n  - 16 programmable GPIO pins\n  - two external interrupts\n - Interfaces\n  - SDIO port (e.g., microSD)\n  - Two SPI ports\n  - I2C\n  - UART\n - Programming and Testing\n  - Built-in debug module for use with gdb and JTAG\n  - Programmable PRBS-31/15/7 generator and checker for interconnect testing\n  - Compatible with the Arduino IDE\n\n## Open-V Dev Board Specifications\nThe dev board comes completely assembled.\n - USB 2.0 controller\n - 1.2 V and 3.3 V voltage regulators\n - Clock reference\n - Breadboard-compatible breakout header pins\n - microSD receptacle\n - Micro USB connector (power and data)\n - JTAG connector\n - 32 KB EEPROM\n - 32-pin QFN Open-V microcontroller\n - Dimensions: 55 mm x 30 mm (excluding USB receptacle)\n\n![Render of the Open-V dev board](https://ipfs.io/ipfs/QmTghotBidoZmEbcF7deM1jnL96Zykghbu1VXb2spnqVpn)\n_Render of the Open-V dev board_\n\n## Arduino Compatibility\nThe Open-V core is Arduino-compatible, which means you will benefit from the abundant resources of the Arduino community. As we make progress toward manufacturing the first batch of Open-V chips, we will release demos showing how Open-V can be used with the Arduino toolchain and other resources.\n\nOf course, the Open-V chip can be used completely independently from the Arduino ecosystem. For example, the RISC-V ecosystem is rapidly growing and immediately applicable for Open-V development.\n\n## RISC-V\nMany commercial microcontrollers feature proprietary, licensed instruction sets. Licensed instruction sets and microprocessor cores restrict the process of modifying the core for different purposes such as improving performance and adapting it to specific applications.\n\nRISC-V is a new open instruction set architecture (ISA) designed by the Berkeley Architecture Group with the aim to support architecture research and education. RISC-V is fully available to public and has advantages such as a smaller footprint size, support for highly-parallel multi-core implementations, variable-length instructions to support an optional dense instruction, ease of implementation in hardware, and energy efficiency.\n\nMoreover, because Open-V and RISC-V are open, a curious person will be able to read and modify the register-transfer level (RTL) and propose changes to enhance the performance of Open-V. A maker would be able to understand the architecture by testing the RTL core with FPGAs or simulators. Already, researchers made some interesting RISC-V-based chips unrelated to Open-V.\n\n## Peripherals\nThe OnChip Open-V is the first microcontroller featuring both an open source CPU and open source peripherals. The glue between the CPU and peripherals (i.e., the buses), is also open source, both the specification and the actual implementation. Currently, we have ADC, DAC, SPI, I2C, UART, GPIO, PWM, and timer peripherals designed and tested in real silicon. We are working on other peripherals, such as USB 2, USB3, internal NVRAM and/or EEPROM, and a convolutional neural network (CNN).\n\n### The Importance of Buses\nThe Open-V microcontroller uses several portions of the Advanced Microcontroller Bus Architecture (AMBA) open standard for on-chip interconnection. This makes any Open-V functional block, such as the core or any of the peripherals, easy to incorporate into existing chip designs that also use AMBA. We hope this will motivate other silicon companies to release RISC-V-based microcontrollers using the peripherals they’ve already developed and tested with ARM-based cores.\n\nWe think buses are so important, we even wrote a paper about them for IEEE LASCAS 2016.\n\n## Chip Comparison\nPower and area simulations show that a RISC-V architecture like that used in the Open-V can be used to replace ARM M0+ microcontrollers with similar performance. The table below shows some comparable chipsets and how they stack up.\n\n![Chip Comparison](https://ipfs.io/ipfs/Qmam5S5Xc5GM4nZeHF2ciEMPLhzw4DPcvicU4UK4cuNv7e)\n_* Dynamic power measurement condition for Open-V: three while loops executed from SRAM, all peripheral clocks disabled, VDD = 1.2 V, Temperature = 25° C_\n\n## Non-volatile Memory\nNotably absent from the Open-V specifications is an internal non-volatile memory. The dev board will ship with an external 32 KB EEPROM, but the Open-V chip itself currently does not have an internal non-volatile memory. We are working to change that and hope to include non-volatile memory in the first batch of Open-V chips, but there are challenges yet to overcome.\n\nIntegration of non-volatile memory on regular CMOS technology is a challenge since the intellectual property is controlled by only a few companies and literature is lacking. Similarly, an IP license for NVRAM for pure CMOS has been difficult to find. Just a few companies control this market, their licensing offices are not friendly, and they haven’t yet responded to us as we would hope.\n\nEEPROM will require additional masks and will increase the cost of the mask set, as well as increase the wafer cost. We have designed our own NVRAM, to be really open, and we are aiming to test it in the MPW in March 2017 (see schedule below). We are doing a design effort to get our NVRAM design to accommodate at least a bootloader capable of getting data from an external EEPROM and/or SD Card.\n\n![Our wire bonding machine at work](https://ipfs.io/ipfs/QmPVtuRvDec69xw3iTWZfUAy6RL3H35kzZnu2jVoH2p1aJ)\n_Our wire bonding machine at work_\n\n## Changing the Semiconductor Industry\n\nWe have over 30 years of cumulative experience designing chips in the semiconductor industry and we believe the industry can do better. We aim to open the door to chip design to a larger community and in so doing drive down the cost of innovation.\n\nThe semiconductor industry is today where the operating system and compiler industry was several decades ago: knowledge is concentrated in a small number of specialists using highly inefficient tools whose configuration and parameter tweaking alone take up the vast majority of the time and effort expended. We need to move away from a world in which a team with US- and India-based engineers cost upward of $100,000 per day.\n\nThe problem is simple: the people supposedly solving problems in the semiconductor industry are not themselves users of their own solutions. For example, rarely does a chip designer know the end application of the chip they are designing or the company who commissioned the chip in the first place. Similarly, the creators of electronic design automation (EDA) tools (the software used to design new chips) aren’t in the business of designing chips.\n\nThe solution is equally simple: spread the knowledge of chip design to those people who actually need a new chip to solve a real problem. The best way to do this is by open sourcing everything from the ground up. This will spur innovation and force existing players to be more competitive.\n\nThe OnChip Open-V is a concrete step in this direction. With the Open-V, for the first time, open silicon will be widely available. We hope it will be used in ways we haven’t yet imagined.\n\n![An Open-V bare die in a tray](https://ipfs.io/ipfs/QmamBELAQh16PXKK3138C17id8XiBpFn9nVxnshfmcPf1T)\n_An Open-V bare die in a tray_\n\n## Manufacturing Plan\n\nThe microcontroller will be manufactured by Taiwan Semiconductor Manufacturing Company (TSMC), who has a lot of experience manufacturing integrated circuits with state-of-the-art features. The development boards will be made and assembled separately.\n\n_2017_\n - 03/31 MPW Design Review\n - 04/24 MPW with v2 prototype tapeout\n - 06/17 PCBs for v2 fabricated\n - 07/18 Bare dies received\n - 08/25 MPW dies completely tested\n - 09/13 PCB for packaged chip tested\n - 10/26 Production level final design review\n - 11/22 Production level tapeout\n\n_2018_\n - 01/19 Wafer level testing/sorting\n - 02/23 Package level testing/sorting\n - 03/22 PCBs populated and tested\n - 04/27 Delivery\n\n![Our testing board with a wire-bonded Open-V bare die](https://ipfs.io/ipfs/QmSjDC2XyoN5JaBb79v1XfMukwPGUCRHEqY9C1vKevJzcU)\n_Our testing board with a wire-bonded Open-V bare die_\n\n## Risks & Challenges\n\nAn analog and digital integrated circuit design is a complex venture, involving architecture design, circuit design, verification, software design, and more. As with any major engineering project, the Open-V carries the risks associated with such complexity. Although rigorous debugging and testing has been and will continue to be exercised throughout this project, there exists the possibility of bugs creeping in. Commercial chips often have bugs, but usually their bugs have a work around that can impact performance but not be a complete showstopper. However, a single unfixable bug is enough to make a chip unusable.\n\nWe are confident we can minimize the impact of potential bugs in the following three ways:\n\n1. Our well-defined design flow and functional project management.\n1. Our 30+ years of aggregate experience taping out integrated chips.\n1. Our enthusiasm for solving high-level challenges.\n\nWhile the third parties associated with the project are trustworthy and have a track record of good work, it’s also clear their activities constitute a risk not in our control. Of course, we will keep everyone updated at each milesone and we will be transparent about any problems that might arise."
		},
		{
			"post_id": 11,
			"title": "Mar del Plata, una película de terror: investigan a la Bonaerense",
			"date_published": 1480727438,
			"body": "La repercusión de la denuncia del integrante de lavaca Bruno Ciancaglini impulsó la apertura de un sumario administrativo a cargo de la Auditoría General de Asuntos Internos del Ministerio de Seguridad provincial. No hay noticias aún de que el Ministerio Público Fiscal haya abierto una investigación, tal como es su obligación. Qué dice el fiscal que fue consultado esa madrugada de terror por la policía. El caso originó que muchos marplatenses compartieran sus experiencias de abusos policiales, pero también su impotencia por la impunidad que los protege, por inacción de la justicia.\n---\n\nSource (Argentina): http://www.lavaca.org/notas/mar-del-plata-una-pelicula-de-terror-investigan-a-la-bonaerense/\n\nEl Ministerio de Seguridad bonaerense ordenó un sumario administrativo para investigar la detención arbitraria y los abusos policiales denunciados por lavaca. A través de su jefe de prensa se comunicaron ayer con la redacción de MU, en horas de la tarde, para informar que la denuncia había sido remitida a Guillermo Berra, titular de la división de Asuntos Internos de Ministerio.\n\nTambién se comunicó el fiscal marplatense Guillermo Nicora, quien intervino en el procedimiento de esa madrugada de pesadilla. Detalló:\n\n“La policía me llamó a las 6 de la mañana. Me dijeron que les había sacado una foto y eso era coacción agravada. Les dije que eso no era ningúna coacción, que la gente tiene ese derecho”.\n\nLuego explicó las características particulares de la administración de justicia en suelo marplatense:\n\n- Si es un delito penal (en este caso, coacción agravada) la policía llama al fiscal para que intervenga.\n- Si es contravencional, no.  Explica Nicoria. “Desde 1999 los fiscales no tenemos actuación en el ámbito contravencional, solo la policía”. Esto significa que la policía hace todo el procedimiento y recién después, lo remite a un juez de paz. Para que quede claro: no hay ningún control del procedimiento policial.\n\nEste caso es un ejemplo de cómo funciona el sistema en manos de la policía Bonaerense: ante la negativa del fiscal de legitimar la detención de Ciancaglini, la policía la justificó armando una causa contravencional.\n\n¿Qué pasa cuando se denuncia este uso abusivo de la fuerza y de  la ley?\n\n- Hasta el momento el Ministerio Público Fiscal no se presentó ante la justicia para impulsar que se investigue la actuación policial, tal como es su obligación.\n- Consultado el fiscal Nicoria sobre si él iba a investigar el abuso policial del que tiene evidente conocimiento, respondió: “Me solidarizo con Bruno y ofrezco dar testimonio, porque esto es una barbaridad”.\n\nPor su parte, la presidenta de la Comisión de Derechos Humanos de la Cámara de Diputados de la Nación, Victoria Donda, habló con Federico Salvai, jefe de gabinete de la gobernadora María Eurgenia Vidal, para expresar su preocupación por la seguridad de las víctimas, en especial de las que no pudieron ser identificadas con nombre y apellido por Bruno. En su crónica describe los golpes que recibió uno de los detenidos: es probable que esas personas –testigos de esta denuncia- estén ahora en una celda de la policía bonaerense, y por lo tanto, expuestas a presiones y amenazas.\n\n## La violencia cotidiana\n\nFueron innumerables las expresiones de solidaridad, ofrecimiento de apoyo legal y repudio por la violencia policial, entre ellas la del Centro de Estudios Legales y Sociales (CELS) y el Sindicato de Prensa de Buenos Aires (SiPreBA), que en un comunicado “rechaza categóricamente los abusos policiales ocurridos en ocasión de la cobertura del Festival Internacional de Cine de Mar del Plata”.\n\nTambién fueron muchísimos los mensajes de marplatenses que compartieron sus experiencias de abusos policiales. Un ejemplo es este que, firmado con nombre, apellido y DNI, relata:\n\n_“En mi barrio esto es el pan de cada día!! Nuestros hijos viven estas situaciones como normales. Lo peor no es que ellos crean que los policías tienen derecho a hacerles eso porque es su deber. Lo peor es que no hay manera de que una denuncia llegue más lejos que una nota en el diario. Las denuncias ante la fiscalía quedan archivadas por falta de pruebas. Y lo que los señores policías hacen queda invisibilizado. A mi hijo le rompieron la moto, lo cagaron a trompadas y patadas, le robaron la gorra y los cigarrillos, le quitaron el DNI, lo putearon, lo discriminaron por usar gorra de visera, etc. etc. etc. y como no hay testigos no pasa nada. Al otro lo apuntaron con la ametralladora porque les dijo que no lo podían maltratar. Por supuesto que siempre a los gritos y puteadas. Otro día estaban jugando a la pelota en la plaza y les pidieron los documentos y a uno se lo perdieron, los subieron al patrullero y los llevaron a la comisaría, Ahí metieron al más grande en el calabozo y al más chiquito lo dejaron encerrado en el patrullero hasta que le dio un ataque de pánico. Después lo soltaron y le dijeron que raje de ahí o lo cagaban a patadas. Disculpen que les cuente todo esto, pero lo que sucedió ayer me conmovió hasta las lágrimas porque no se puede hacer nada. Déspotas, tiranos, ladrones, completamente violentos, y están armados !!! Les mando un abrazo desde Mar del Plata y mis disculpas por la vergüenza de policía que tenemos”._\n\nOtro mensaje sintetiza los muchos abrazos escritos que recibimos:\n\n_Querido Bruno,_\n\n_Me parte el corazón y el alma lo que contás. No entra en la cabeza de este pibe de 24 años, que cada vez desconfía más del mundo y de sus monstruosidades, que un visitante como vos, que se acerca a cubrir el que creo yo es uno de los acontecimientos más bellos, enriquecedores y fascinantes de esta ciudad, tenga que pasar por las experiencias que con tanta habilidad conseguiste transmitir en palabras._\n\n_Lo lamento muchísimo._\n\n_Por supuesto que lo lamento por vos.  Porque nadie se merece pasar por semejante situación, jamás en la vida.  La impotencia que debe generar semejante privación de libertad y derechos es indescriptible, por lo que realmente me deja sin palabras tu testimonio _\n\n_Pero también lo lamento un poco por mí, y por todos los marplatenses. Porque no termino de entender cómo semejantes atrocidades pueden pasar en mi ciudad, en mi hogar de toda la vida. Porque que me cuentes que estas barbaridades ocurren acá me hacen sentir como si ocurriesen en el patio mismo de mi casa, me parten el alma y me llenan de lágrimas de rabia y decepción._\n\n_Entiendo que es posible que jamás vuelvas a pensar en Mar del Plata de la misma manera. Me parece una lástima que nunca más puedas disfrutar como antes de las maravillas que puede llegar ofrecer este lugar que aparentemente hoy en día está bajo la “protección” de seres de tan bajo nivel._\n\n_Sin embargo, quiero dejarte la puerta abierta para que el año que viene, siempre y cuando estés de acuerdo, pueda remendarlo recibiéndote por cuenta propia, de parte mía y de todos los marplatenses, y asegurándome de que no te falte nada para que puedas llevar a cabo tanto la cobertura del festival como tu disfrute del mismo._\n\n_Porque nadie debería perderse de un evento tal, a pesar de que los malvivientes (porque estos son los verdaderos malvivientes) hayan querido mancillarlo para vos por siempre._\n\n_Te espero de brazos abiertos, y esperando que estés dispuesto a nunca bajar los tuyos._\n\n_Y por favor, nunca calles. Porque testimonios como el tuyo ayudan a abrirle los ojos a más de uno._\n\n_De parte mía y de todos los marplatenses  te mando el abrazo más fuerte que pueda darse, y espero verte el año que viene, para demostrarle a los cobardes lo que es tener un par de pelotas bien puestas”._\n\nA todas las personas que nos hicieron sentir tan acompañados queremos decirles: gracias. Nos dan fuerza para seguir."
		},
		{
			"post_id": 10,
			"title": "Mar del Plata, una película de terror",
			"date_published": 1480640037,
			"body": "![El patrullero en el que fue retenido, esposado.](https://ipfs.io/ipfs/QmWQXJ7ap1NjCdVRXH11FG6Md9xL4exCFgBppLdNKwnfED)\n\nEl periodista de lavaca, Bruno Ciancaglini, viajó a Mar del Plata para cubrir el Festival Internacional de Cine. En la madrugada del sábado fue esposado y retenido durante 4 horas en un patrullero. Un testimonio en primera persona de la pesadilla que representa estar en manos de la Bonaerense.\n---\n\nSource (Argentina) : http://www.lavaca.org/notas/mar-del-plata-una-pelicula-de-terror/\n\n(por Bruno Ciancaglini, integrante de lavaca)\n\nTecleo y me duelen las muñecas. Parece que pasaron semanas, pero no. Fueron tres días nada más. Y dos noches. Dos noches en las que me dormía  con  las  manos  debajo de la almohada y de repente las sacaba para ver si las esposas todavía seguían ahí.\n\nSábado 26 de noviembre.\n\nDesde el martes estaba cubriendo por tercera vez consecutiva el Festival Internacional de Cine de Mar del Plata. Ese  día  había entrevistado al crítico y programador peruano John Campos  Gómez en su habitación del hotel  Hermitage, con vista al mar, y había visto lo que para mí fueron las dos mejores películas argentinas del festival: Hermia  & Helena, último largo de Matías  Piñeyro, y Monger, un documental sobre el submundo del ”turismo sexual” en Buenos Aires. Una película es el reverso de la otra:  Piñeyro  es argentino y vive en Estados Unidos. Filma, con elegancia y precisión, a una mujer argentina que viaja a Estados Unidos por una beca, sus encuentros amorosos y pormenores en una Nueva York diurna y nevada.  Jeff Zorrilla es norteamericano y vive en Argentina. Su película es un documental oscuro y provocador sobre un estadounidense que vive en Buenos Aires y oficia como nexo entre turistas que viajan exclusivamente para tener sexo con prostitutas locales. Dos miradas sobre la soledad y el desarraigo.\n\nEsa noche estábamos en una fiesta organizada por DAC (Directores Argentinos Cinematográficos) en un gran boliche sobre la playa. Un conocido, de casualidad, me presentó a Zorrilla. Lo felicité por la película y cuando me dispuse a bombardearlo con preguntas sobre el rodaje y sobre cómo se había acercado a los personajes, se encendieron las luces: la fiesta había terminado. Alguien propuso ir a la plaza Cristobal Colón a tomar una cerveza; ahí  había un  kiosko que vende alcohol toda la noche. Luego supe que en Mar del Plata hay ley seca, que después de las 22 solo bares y  restaurantes pueden vender alcohol, pero ahí estaba, a la vista de todos, lo que por eso mismo no advertí que era la excepción a esa regla.\n\nAccedí a ir a la plaza, entre otras cosas, porque quería hablar con Jeff sobre Monger. Llegamos y alguien compró la cerveza, pero  antes de destaparla Zorrilla decidió irse: al otro día tenía varias cosas que hacer antes de la entrega de premios y ya eran las cuatro de la mañana. Quedó un grupo conformado por una guionista argentina, dos directores colombianos, uno brasilero y yo, que con la partida de Jeff ya no tenía mucho incentivo para estar ahí. Se acercó un marplatense solitario que necesitaba hablar con alguien sobre sus problemas  familiares. Yo me sacrifiqué por el resto del grupo, mientras ellos  tomaban la cerveza y hablaban de cine, de sus estudios en la universidad, del informe de Lanata  sobre los extranjeros que vienen a estudiar y otras cosas que escuché solo lateralmente.\n\nEn ese momento se bajaron cuatro  policías de un patrullero. Se acercaron de manera intimidatoria y a los gritos. Cuando me di vuelta el marplatense ya se había ido, casi como un acto reflejo. Una oficial bastante alterada  pateó la botella de cerveza al piso. Los otros nos ordenaron que les mostráramos los documentos. Como no lo tenía, les mostré  la credencial de prensa que  llevaba  colgada en el pecho.\n\n-Tranquilos, somos invitados del festival de cine- le dije.\n\n-A mí qué carajo me importa- respondió.\n\nLe digo que no puede tratarnos así, que no conocemos la ciudad y que no estamos molestando a nadie. Me dice que somos infractores por estar tomando  alcohol en la vía pública. Le digo que yo no estoy tomando. Me dice que estamos cometiendo una contravención. Los cuatro oficiales se van turnando para discutir con cada uno de nosotros. Todos ellos están tensos, duros.\n\nEl oficial me  hace saber que tiene autoridad como para llevarme detenido. Le digo que tengo derechos. Se  ríe y da media vuelta. En ese momento, tomo la decisión que marcaría el destino irreversible de una noche que ya estaba clareando. Me alejo unos metros, apunto a los oficiales con el celular y saco dos fotos.\n\nClick, click.\n![La foto que desató la pesadilla.](https://ipfs.io/ipfs/QmYCjhDXjJMJWcRMpxnr7aTqSbedyJ3Qv2gZGSXEgPTg2Q)\nFlashback.\n\n_Son las cuatro de la tarde de ese mismo sábado. Camino por la avenida Peralta Ramos desde el Hotel Provincial  hacia el hotel  donde me hospedo. Cuatro policías van a paso acelerado detrás de un muchacho de gorra y camiseta de fútbol. En un momento, el muchacho  detiene la marcha y, en tono conciliatorio, les dice: “Dale, loco, no me peguen”. La respuesta no tarda en llegar: uno de los policías saca un tubo de gas pimienta y se lo tira en la cara. El viento trae la sustancia hasta mis ojos. El muchacho se aleja caminando. Los policías, satisfechos, lo dejan ir. Me acerco al que tiró el gas y lo increpo. Con desprecio, me  pide que me retire. Pregunto a unos comerciantes y transeúntes por qué hicieron eso, pero nadie sabe: nadie vio un robo, nadie vio un altercado o algo parecido._\n\nVolvemos a la madrugada del sábado. Ya es prácticamente de día. Los oficiales  se abalanzan sobre mí. Me agarran de los brazos y me llevan hasta el patrullero. Me empujan contra el capó, me ordenan que abra las piernas y que me calle la boca. Uno pone su mano sobre mi nuca, y quedo  acostado sobre el calor del motor, mirando e  horizonte vertical. A los demás los obligan a alejarse y les dicen que no me va a pasar nada. Le doy la billetera a mi amigo colombiano. Me sacan las demás cosas que tenía encima: el celular y la credencial de prensa.\n\nCada vez que pregunto por qué me detienen, me responden “callate la boca”.\n\nPasa media hora.\n\nYa es completamente de día.\n\nMe dicen que  están esperando al “superior” para que él decida mi situación. Mientras tanto, hablan entre ellos en voz alta para que los escuche:\n\n-¿Viste qué giles que son estos? Se piensan que porque son periodistas pueden hacer lo que quieran.\n\n-Y mirá cómo terminan… ¿Este va derecho al penal, no?\n\n-Sí, porque lo que hizo es coacción agravada, así que se come 12 horas allá, aunque para mí no dura ni dos (risas).\n\nLlega el “superior”. Conversa a lo lejos con algunos de ellos. Se acerca. Con tono intimidante, me dice que estoy en falta, cometiendo una contravención y que además puedo ir preso por coacción agravada, porque sacar fotos es una forma de amenazar a un funcionario público. Le digo que está equivocado. Me dice que me calle la boca. Habla un rato más en secreto con otro de los oficiales. Los demás me miran y se  ríen. Vuelve y, con la convicción de quien sabe que ha ganado la partida, me dice:\n\n-Claro, vos no vas a publicar nada de esto, porque te tiene que dar vergüenza ¿Qué le vas a decir a tu jefe? ¿Qué van a pensar de vos en el festival? Estás tomando alcohol a cualquier hora, no  tenés  excusas, te pueden echar.\n\nA esa altura ya no tenía ni fuerza ni ganas para explicarle que:\n\n1. No estaba tomando alcohol.\n1. No tengo jefe.\n1. No tengo nada que ocultar ante el festival ni ante nadie.\n\nAsí y todo se lo dije, pero no le importó. Me di cuenta de que estaba en serios problemas. El “superior” estaba convencido -en su concepción del  trabajo como un sistema  de  jerarquías, con premios y castigos y quizás consciente  de la precarización que sufre la profesión-, de que un redactor joven  detenido a altas horas de la madrugada por “tomar alcohol en la vía pública”  jamás se animaría a poner en riesgo su trabajo o su prestigio y preferiría que nadie se entere de lo que pasó.\n\nOrdenó que me esposaran y se retiró. “Ponele los ganchos duros, para que aprenda”, sugirió antes de irse. Así fue que uno de los oficiales me calzó las esposas- las clásicas, las “duras”, las de metal- y casi sin despegar los dientes  recitó mis derechos. Pedí  acceder a uno solo de ellos: llamar a mi abogada. Respondieron que  podía hacerlo en la comisaría, a una cuadra de donde estaba esposado, muy cerca del kiosco que transgredía la ley seca, justo al lado del Hotel Provincial y en la entrada del Auditorio Astor Piazzolla, en el mismo edificio donde unas horas después sería la entrega de premios del festival. Para ese momento solo quedaban la guionista y mi amigo colombiano. Me dijeron que me esperarían en la puerta de la comisaría.\n\nMe suben al patrullero. Voy con  dos oficiales: la mujer y el hombre  que se dio el gusto de esposarme. Ponen el auto en marcha. En vez de dar la vuelta para ir a la comisaría, toman dirección en el sentido opuesto. Pienso que en algún momento van a girar, pero siguen varias cuadras.\n\n-La comisaría es para el otro lado- digo.\n\n-Callate la boca- responde el oficial.\n\nSiguen varias cuadras más en el sentido contrario a la comisaría. Por primera vez siento miedo. El oficial me dice que la podría haber terminado antes, que por  hablar de más ahora estoy acá, que no sé lo que me espera. Continúan dando vueltas  por calles de Mar del Plata que no conozco, lejos del Hotel Provincial, lejos de la comisaría a la que tenía que ir.\n\nPor fin, estacionan el auto frente a un edificio. Es el complejo Vucetich, escuela y centro de operaciones de la bonaerense en Mar del Plata, aunque yo aprenderé unos minutos más tarde que es otra cosa.\n\nSiempre esposado, me llevan hasta un pasillo en el fondo del salón central. Me hacen esperar mirando la pared. El oficial me dice que me va a ver un médico para verificar que no tengo heridas. Me repite que me esperan 12 horas de detención. Pienso que no podré ir a la entrega de premios ni a las funciones para las que ya tenía entrada. Llega otro oficial  con dos detenidos más. Uno de ellos está  sin remera y tiene  todo el cuerpo ensangrentado (incluso los tobillos), con  cortes y moretones. En fila, los tres miramos una pared descascarada  con inscripciones en lapicera. Leo “yuta puta”, “ratis de mierda”.\n\nEl  que está sin remera  le pide al policía que le afloje las esposas. El policía deniega  la petición. El hombre, evidentemente dolorido, insiste. El oficial niega de nuevo  (no hace falta aclarar el grado de cordialidad de sus respuestas). El muchacho ensangrentado se  da vuelta y, mirándolo a los ojos, repite: “Dale,  aflojame las esposas”. Antes de que pudiera pestañear, el policía lo da vuelta, lo agarra de  la nuca y le estrella la cara contra la pared. Le da una patada  en los pies y le golpea la cabeza contra el piso. “Mi” oficial me  arrastra hacia  un pasillo perpendicular. Me  apreta  contra la pared, carga el puño como si en cualquier momento  me fuera a soltar una trompada y  me  grita  que en la calle mandan ellos, que no me vuelva a hacer el piola nunca más, que iba a terminar mal, que ellos hacen lo que quieren y que no les importa si soy periodista o lo que mierda sea. El puño de su mano apunta a mi cara y tiembla como si estuviera haciendo  un gran esfuerzo para no soltarlo. Afloja. Me desplaza de nuevo hacia el primer pasillo, donde el muchacho en  cuero, ahora con nuevas heridas camufladas entre las otras, ya está reincorporado. Se acerca la oficial y me grita al oído: “Mirá  cómo terminaste, gil. Esposado. Y yo acá diciéndote lo que  tenés  que hacer. Que te quede claro que acá mandamos nosotros, ¿Eh?”. El oficial vuelve a cargar el puño y ella insiste, esperando una respuesta: “¿Eh?”. El muchacho de cuero me advierte: “No digas nada porque te van a pegar”. Confío en su criterio. Miro al piso y no respondo. La oficial insiste dos o tres veces más  esperando una respuesta, pero  me quedo  callado. El  oficial baja la mano. Se ríen.\n\nMe hacen pasar a la sala del “médico”.\n\nAhora me  doy cuenta  de  que esa espera en ese pasillo no es casual. Todo lo contrario: es  el momento clave,  el punto ciego. Durante  esa espera y  en ese pasillo  está  el limbo.\n\nEl médico es una señora que está sentada en un escritorio  frente a una computadora. Es amable, tranquila, respetuosa; casi en sintonía con lo que pasa del otro lado de la puerta de su despacho. Sin levantar la vista de la pantalla, me pregunta si tengo heridas, si tengo tatuajes, si tengo alguna enfermedad, cuánto mido, cuánto peso, dónde vivo.\n\nMe llevan nuevamente hacia el patrullero. Me dicen que mi situación depende del fiscal. Que lo que hice es un delito penal, por lo tanto puedo ir derecho a la cárcel o pasar, repiten, doce horas en la comisaría. El auto está estacionado y el policía empieza a limpiar la puerta con un cepillo. Me doy cuenta de que las manos me laten, la circulación no fluye bien, me duelen las muñecas y siento, por primera vez, desesperación por sacarme las esposas. Una de las peores cosas de estar esposado, además de sentir literalmente  el control arbitrario que ejerce el Estado sobre el cuerpo a través de ese artefacto que reduce la  motricidad y la integridad psicológica de una persona, es no poder rascarse.\n\nTerminan la limpieza del auto y arrancamos de nuevo. Ahora sí vamos hacia la comisaría del Hotel Provincial.\n\nLos oficiales me dejan hacer preguntas, están más tranquilos. Ya me dieron la lección que querían. En la puerta está mi amigo colombiano tratando de no dormirse de pie. Son las 8:30 de la mañana. Los oficiales bajan y me quedo solo en el patrullero media hora más, con las manos que me laten cada vez más. Se acerca el que tuvo el gusto de esposarme y me dice: “Ya  quedás en libertad. Esto fue para que aprendas nada más”.\n\nMe baja del auto. Camino esposado por la alfombra roja, la misma que unas horas después, entre flashes y cámaras, será transitada por celebridades del festival.\n\nEntro a la comisaría. Me sacan las esposas. Me miro las manos y están deformadas.\n\n![Mano inflamada](https://ipfs.io/ipfs/QmX2tZu56DEqktsxTM15m4mMawDMTJSqrr989wwpCVDKgK)\n\nLa oficial y el que tuvo el gusto de esposarme me devuelven mis únicas pertenencias, que para ellos eran armas: el celular y la acreditación de prensa. Me dicen que firme el acta. La leo.\n\nDice que soy infractor de los artículos 72 y 74, inciso A del régimen contravencional. Más tarde buscaré qué significa esto:\n\n_**Artículo 72.- (Dec-Ley 9163/78 y Dec-Ley 9399/79)** Será sancionado con pena de multa del quince (15) al cuarenta (40) por ciento del haber mensual del Agente de Seguridad (Agrupamiento Comando) de la Policía de la Provincia de Buenos Aires y arresto de hasta cuarenta (40) días, el que transite o se presente en lugares accesibles al público en estado de ebriedad o se embriague en lugar público o abierto al público. La pena se duplicará si se ocasionare molestias a los demás (*). \n\n**Artículo 74.- (Dec-Ley 9164/78, Dec-Ley 9321/79, Dec-Ley 9399/79)** Serán reprimidos con multa entre el quince (15) y el cuarenta (40) por ciento del haber mensual del Agente de Seguridad (Agrupamiento Comando) de la Policía de la Provincia de Buenos Aires y/o arresto de dos (2) a treinta (30) días: \n\n **a.**- Los que individualmente o en grupo, en lugar público o abierto al público, profieran gritos, se reúnan tumultuosamente, insulten, amenacen o provoquen de cualquier manera. _\n\nNunca me hicieron un control de alcoholemia ni me vieron con una botella en la mano, por lo tanto la primera infracción no tiene sustento.\n\nRespecto a la segunda, tendremos que discutir qué entiende la Bonaerense por amenaza, insulto o provocación. Pero eso lo hablaré con mi abogada.\n\nAgarré mi celular y me colgué la credencial de prensa en el pecho. Lo último que hice fue sacarle una foto a la patente del patrullero en el que me pasearon durante  esa madrugada. Los dos policías, la mujer y el que tuvo gusto de esposarme, me gritaron algo que no entendí.\n\n![Patrullero](https://ipfs.io/ipfs/QmWQXJ7ap1NjCdVRXH11FG6Md9xL4exCFgBppLdNKwnfED)\n\nVolví  inmediatamente a Buenos Aires. Me perdí la entrega de premios y algunas funciones que quería ver.\n\nMe queda un sabor amargo de una experiencia que venía siendo perfecta. Pasé grandes momentos con amigos y vi buenas películas. Como La flor (primera parte), de Mariano Llinás- película que esperaba poder ver desde hace años-, que luego de tres horas y media de historias delirantes y tenebrosas termina con un cartel y una palabra que entendemos como una promesa.\n\nYo, después de más de cuatro horas estar esposado, me alejo caminando por la avenida Peralta Ramos y pienso en esa misma palabra, pero con signos de pregunta:\n\n¿Continuará?"
		},
		{
			"post_id": 9,
			"title": "Beyond Nokia: A love story",
			"date_published": 1479671781,
			"body": "![Nokia Love](https://ipfs.io/ipfs/QmVpyyKkJsydqXuM3gMe1ZpPAYKbF6G4R7uGAHNqehSML1)\nIt was October 2011. Verena Rentrop and Elsie Parumog, two Nokia staff stationed on opposite sides of the world, were having a routine work chat about the company’s IT processes when something more pressing came up.\n---\n\n_Note from ZeroBlog Admin: I love Nokia :D ¿Do you?_\n\n_Source:_ https://techcrunch.com/2016/11/20/a-love-story/\n\n_By Steve O'Hear_\n\nWith another wave of restructuring underway, which would see Nokia lay off tens of thousands of employees over the next few years, conversations like these and the close but remote relationship that the two had established might soon come to an end.\n\nWhat they and their fellow Nokians needed was a way to stay in touch. And so, with little fuss or fanfare, Rentrop and Parumog set up the ‘Beyond Nokia’ Facebook group.\n\nFast forward a little over five years, and by November 10th 2016 the closed group, to which Rentrop had continued to vet new applications, had reached a respectable but unremarkable 952 members.\n\n“In the afternoon I posted a message encouraging everyone to invite their former Nokia colleagues to the group, hoping that we would reach 1,000 members by the end of year,” she recalls.\n\nThe following day the group had doubled in size, which Rentrop says was a “huge surprise and totally unexpected”. And then another seven days later it passed 19,000 members, and is currently adding over 1,000 new members each day.\n\n“[That’s] a mind-blowing number if you compare it to employee figures of Nokia. Soon it will be close to the amount of people fired during the last two years,” says Rentrop.\n\nBut more remarkable than how fast the ‘Beyond Nokia’ Facebook group has grown in recent weeks (and  despite laying relatively dormant for five years) is the affinity that ex-Nokians still have for the company. And, of course, for each other.\n\n“It’s a love story,” says Sotiris Makrygiannis, who was previously director of applications and site manager of Nokia’s Helsinki R&D center. “I’ve never seen such a large group of people adoring a company. It’s remarkable. All these tens of thousands of people lost their jobs and instead of hating the company, actually admiring the company”.\n\n![Nokia Love](https://ipfs.io/ipfs/QmPE2snwkebTBPK3XMH3PQvqKnpdErsToMJ8cgWGzkiSjv)\n\nTo understand why, Rentrop points me to Nokia’s old company slogan: Connecting People. ”It was not just a marketing phrase,” she says, “for many members Nokia became a family”. That sentiment is echoed in the hundreds of messages and photos currently being posted to the group every hour.\n\n“It was a 120,000 person company, yet felt a lot smaller and I can’t put my finger on why that was,” says one of the group’s members.\n\n“The halls of any Nokia house resonated, for some years, with energy and belief that we could achieve anything. You would walk to a different floor and someone was planning something meaningful, and you could see it in their faces. I loved that,” adds another.\n\nUnsurprisingly, given that Nokia was once a prolific hardware maker, device nostalgia is also a recurring theme. Pictures of discontinued and cherished Nokia phones are being posted along with photos of dozens of models and prototypes that never made it to market.\n\nThis is only dwarfed by the other types of Nokia memorabilia being shared. From pens used by various ex-employees to sign their original Nokia contracts, company swag adorned with sometimes undecipherable marketing jargon, to neon signs salvaged from Nokia factories since retired.\n\n![Nokia Love](https://ipfs.io/ipfs/QmSoLUtE31sf71pwEz7HeiNf3qoAeNcRzC5g4oem94WReg)\n\nChocolate is another topic of discussion. European countries like Switzerland and Belgium may be best-known for their chocolate-making capabilities but Nokia’s home country can also hold its own.\n\nExplains Rentrop: “Travelling around the world was for some their primary job, for others cherished on seldom occasions. It seems one thing most trips had in common was Fazer chocolate from Finland. It was the most wanted travel gift among colleagues and has since turned into the most wanted taste for people who are beyond Nokia”.\n\nThe group’s content is also littered with sometimes arcane references to various inside jokes over the years. Reflecting Nokia’s once global presence, with its multiple offices spread throughout the world, conference calls come in for particular ridicule and affection.\n\n“It looks like a huge number of working hours were spent in phone conferences,” says Rentrop. “Sweet memories of ‘mute vs un-mute’, dogs barking, toilet visits, private chats on an open line, parallel chats with meeting participants, and who can forget the many times ‘James Bond’ joined routine calls”.\n\nBut a love story wouldn’t be complete without at least one marriage. And at Nokia there were many.\n\n![Nokia Love](https://ipfs.io/ipfs/QmPyeibND9BSTpq8yvCyTnnYkMhz7UzRvEdZiq4sQHXCxA)\n\nMultiple stories are being shared of Nokia employees who crossed borders and found love. From Denmark to Brazil, the U.S. to Hungary, Finland to China, and many other parts of the world, to connect with that one special Nokian for the rest of their lives.\n\nThose relationships have also given birth to a new generation of the Nokia family  — quite literally. “The best Nokia ‘product’ is now 12 years old, our loving daughter,” writes a member of the group.\n\nMeanwhile, Beyond Nokia (and a spin-off site called ‘Nokia People’) continues on its mission to connect ex-Nokians and the broader Nokia family. At last check, the group now stands at 21,000 members. And counting."
		},
		{
			"post_id": 8,
			"title": "The iBrain is Here",
			"date_published": 1472059451,
			"body": "![The iBrain is Here](https://ipfs.io/ipfs/Qma1VRfadGJu8HqNtNKvwE1JvJuKLPCUp1iVxrQQjnYttM)\n\nAn exclusive inside look at how artificial intelligence and machine learning work at Apple\n---\n\n_Note from the ZeroBlog Admin: Don't buy Apple! Is evil! :P_\n\n_Source_: https://backchannel.com/an-exclusive-look-at-how-ai-and-machine-learning-work-at-apple-8dbfb131932b\n\n_By Steven Levy_\n\n**On July 30, 2014,** Siri had a brain transplant.\n\nThree years earlier, Apple had been the first major tech company to integrate a smart assistant into its operating system. Siri was the company’s adaptation of a standalone app it had purchased, along with the team that created it, in 2010. Initial reviews were ecstatic, but over the next few months and years, users became impatient with its shortcomings. All too often, it erroneously interpreted commands. Tweaks wouldn’t fix it.\n\nSo Apple moved Siri voice recognition to a neural-net based system for US users on that late July day (it went worldwide on August 15, 2014.) Some of the previous techniques remained operational — if you’re keeping score at home, this includes “hidden Markov models” — but now the system leverages machine learning techniques, including deep neural networks (DNN), convolutional neural networks, long short-term memory units, gated recurrent units, and n-grams. (Glad you asked.) When users made the upgrade, Siri still looked the same, but now it was supercharged with deep learning.\n\nAs is typical with under-the-hood advances that may reveal its thinking to competitors, Apple did not publicize the development. If users noticed, it was only because there were fewer errors. In fact, Apple now says the results in improving accuracy were stunning.\n\n![Senior VP for Internet Software and Services Eddy Cue](https://ipfs.io/ipfs/QmSUFkb8spgpmSs3wMZdFTUA9eJW6EJ5VEBJNRLFcgmu3t)\n_Senior VP for Internet Software and Services Eddy Cue_\n\n“This was one of those things where the jump was so significant that you do the test again to make sure that somebody didn’t drop a decimal place,” says Eddy Cue, Apple’s senior vice president of internet software and services.\n\nThis story of Siri’s transformation, revealed for the first time here, might raise an eyebrow in much of the artificial intelligence world. Not that neural nets improved the system — of course they would do that — but that Apple was so quietly adept at doing it. Until recently, when Apple’s hiring in the AI field has stepped up and the company has made a few high-profile acquisitions, observers have viewed Apple as a laggard in what is shaping up as the most heated competition in the industry: the race to best use those powerful AI tools. Because Apple has always been so tight-lipped about what goes on behind badged doors, the AI cognoscenti didn’t know what Apple was up to in machine learning. “It’s not part of the community,” says Jerry Kaplan, who teaches a course at Stanford on the history of artificial intelligence. “Apple is the NSA of AI.” But AI’s Brahmins figured that if Apple’s efforts were as significant as Google’s or Facebook’s, they would have heard that.\n\n“In Google, Facebook, Microsoft you have the top people in machine learning,” says Oren Etzioni of the Allen Institute for AI. “Yes, Apple has hired some people. But who are the five leaders of machine learning who work for Apple? Apple does have speech recognition, but it isn’t clear where else [machine learning] helps them. Show me in your product where machine learning is being used!\n\n“I’m from Missouri,” says Etzioni, who is actually from Israel. “Show me.”\n\n**Well, earlier this month,** Apple did show where machine learning is being used in its products — not to Etzioni, but to me. (Oren, please read.) I spent the better part of a day in the boardroom of One Infinite Loop at the Cupertino headquarters, getting a core dump of the company’s activities in AI and machine learning from top Apple executives (Cue, senior worldwide marketing vice president Phil Schiller, and senior vice president of software engineering Craig Federighi), as well as two key Siri scientists. As we sat down, they handed me a dense, two-page agenda listing machine-learning-imbued Apple products and services — ones already shipping or about to — that they would discuss.\n\nThe message: _We’re already here. A player. Second to none.\n\nBut we do it our way._\n\nIf you’re an iPhone user, you’ve come across Apple’s AI, and not just in Siri’s improved acumen in figuring out what you ask of her. You see it when the phone identifies a caller who isn’t in your contact list (but did email you recently). Or when you swipe on your screen to get a shortlist of the apps that you are most likely to open next. Or when you get a reminder of an appointment that you never got around to putting into your calendar. Or when a map location pops up for the hotel you’ve reserved, before you type it in. Or when the phone points you to where you parked your car, even though you never asked it to. These are all techniques either made possible or greatly enhanced by Apple’s adoption of deep learning and neural nets.\n\nYes, there is an “Apple brain” — it’s already inside your iPhone.\n\n![Face recognition? Apple is in the game with its neural nets.](https://ipfs.io/ipfs/Qmbyo5pjtnwKwWsjgj4KZTVTW7CAHECSmJ64NZCJUP7oHk)\n_Face recognition? Apple is in the game with its neural nets._\n\nMachine learning, my briefers say, is now found all over Apple’s products and services. Apple uses deep learning to detect fraud on the Apple store, to extend battery life between charges on all your devices, and to help it identify the most useful feedback from thousands of reports from its beta testers. Machine learning helps Apple choose news stories for you. It determines whether Apple Watch users are exercising or simply perambulating. It recognizes faces and locations in your photos. It figures out whether you would be better off leaving a weak Wi-Fi signal and switching to the cell network. It even knows what good filmmaking is, enabling Apple to quickly compile your snapshots and videos into a mini-movie at a touch of a button. Apple’s competitors do many similar things, but, say its executives, none of those AI powers can pull those things off while protecting privacy as closely as Apple does. And, of course, none of them make Apple products.\n\nAI isn’t new to Apple: as early as the 1990s it was using some machine learning techniques in its handwriting recognition products. (Remember Newton?) Remnants of those efforts are still to be found in today’s products that convert hand-scrawled Chinese characters into text or recognize the letter-by-letter input of an Apple Watch user finger-“scribbling”a custom message on the watch face. (Both of those features were produced by the same ML team of engineers.) Of course, in earlier days, machine learning was more primitive, and deep learning hadn’t even been buzzworded yet. Today, those AI techniques are all the rage, and Apple bristles at the implication that its learning is comparatively shallow. In recent weeks, CEO Tim Cook has made it a point to mention that the company is on it. And now, its top leaders are elaborating.\n\n![The Apple Watch uses machine learning in its fitness-related apps.](https://ipfs.io/ipfs/QmekFxSbYHxhhFnxgTQeoLEvZWkAmsBTDZCe4oV3gwsSXG)\n_The Apple Watch uses machine learning in its fitness-related apps._\n\n“We’ve been seeing over the last five years a growth of this inside Apple,” says Phil Schiller. “Our devices are getting so much smarter at a quicker rate, especially with our Apple design A series chips. The back ends are getting so much smarter, faster, and everything we do finds some reason to be connected. This enables more and more machine learning techniques, because there is so much stuff to learn, and it’s available to [us].”\n\nEven as Apple is bear-hugging machine learning, the executives caution that the embrace is, in a sense, business as usual for them. The Cupertino illuminati view deep learning and ML as only the latest in a steady flow of groundbreaking technologies. Yes, yes, it’s transformational, but not more so than other advances, like touch screens, or flat panels, or object-oriented programming. In Apple’s view, machine learning isn’t the final frontier, despite what other companies say. “It’s not like there weren’t other technologies over the years that have been instrumental in changing the way we interact with devices,” says Cue. And no one at Apple wants to even touch on the spooky/scary speculations that invariably come up in AI discussions. As you’d expect, Apple wouldn’t confirm whether it was working on self-driving cars, or its own version of Netflix. But the team made it pretty clear that Apple was not working on Skynet.\n\n“We use these techniques to do the things we have always wanted to do, better than we’ve been able to do,” says Schiller. “And on new things we haven’t be able to do. It’s a technique that will ultimately be a very Apple way of doing things as it evolves inside Apple and in the ways we make products.”\n\nYet as the briefing unfolds, it becomes clear how much AI has already shaped the overall experience of using the Apple ecosystem. The view from the AI establishment is that Apple is constrained by its lack of a search engine (which can deliver the data that helps to train neural networks) and its inflexible insistence on protecting user information (which potentially denies Apple data it otherwise might use). But it turns out that Apple has figured out how to jump both those hurdles.\n\nHow big is this brain, the dynamic cache that enables machine learning on the iPhone? Somewhat to my surprise when I asked Apple, it provided the information: about 200 megabytes, depending on how much personal information is stored (it’s always deleting older data). This includes information about app usage, interactions with other people, neural net processing, a speech modeler, and “natural language event modeling.” It also has data used for the neural nets that power object recognition, face recognition, and scene classification.\n\nAnd, according to Apple, it’s all done so your preferences, predilections, and peregrinations are private.\n\nThough Apple wasn’t explaining everything about its AI efforts, I did manage to get resolution on how the company distributes ML expertise around its organization. The company’s machine learning talent is shared throughout the entire company, available to product teams who are encouraged to tap it to solve problems and invent features on individual products. “We don’t have a single centralized organization that’s the Temple of ML in Apple,” says Craig Federighi. “We try to keep it close to teams that need to apply it to deliver the right user experience.”\n\nHow many people at Apple are working on machine learning? “A lot,” says Federighi after some prodding. (If you thought he’d give me the number, you don’t know your Apple.) What’s interesting is that Apple’s ML is produced by many people who weren’t necessarily trained in the field before they joined the company. “We hire people who are very smart in fundamental domains of mathematics, statistics, programming languages, cryptography,” says Federighi. “It turns out a lot of these kinds of core talents translate beautifully to machine learning. Though today we certainly hire many machine learning people, we also look for people with the right core aptitudes and talents.”\n\n![From left, Senior Vice President of Software Engineering Craig Federighi listens to Siri Senior Director Alex Acero discuss the voice recognition software at Apple headquarters.](https://ipfs.io/ipfs/QmXt7ADFMQyC1HM1awXYjTD5diwaNjJUoH5GgC62uARn94)\n_From left, Senior Vice President of Software Engineering Craig Federighi listens to Siri Senior Director Alex Acero discuss the voice recognition software at Apple headquarters._\n\nThough Federighi doesn’t say it, this approach might be a necessity: Apple’s penchant for secrecy puts it at a disadvantage against competitors who encourage their star computer scientists to widely share research with the world. “Our practices tend to reinforce a natural selection bias — those who are interested in working as a team to deliver a great product versus those whose primary motivation is publishing,” says Federighi. If while improving an Apple product scientists happen to make breakthroughs in the field, that’s great. “But we are driven by a vision of the end result,” says Cue.\n\nSome talent in the field comes from acquisitions. “We’ve recently been buying 20 to 30 companies a year that are relatively small, really hiring the manpower,” says Cue. When Apple buys an AI company, it’s not to say, “here’s a big raw bunch of machine learning researchers, let’s build a stable of them,” says Federighi. “We’re looking at people who have that talent but are really focused on delivering great experiences.”\n\nThe most recent purchase was Turi, a Seattle company that Apple snatched for a reported $200 million. It has built an ML toolkit that’s been compared to Google’s TensorFlow, and the purchase fueled speculation that Apple would use it for similar purposes both internally and for developers. Apple’s executives wouldn’t confirm or deny. “There are certain things they had that matched very well with Apple from a technology view, and from a people point of view,” says Cue. In a year or two, we may figure out what happened, as we did when Siri began showing some of the predictive powers of Cue (no relation to Eddy!), a small startup Apple snatched up in 2013.\n\nNo matter where the talent comes from, Apple’s AI infrastructure allows it to develop products and features that would not be possible by earlier means. It’s altering the company’s product road map. “Here at Apple there is no end to the list of really cool ideas,” says Schiller. “Machine learning is enabling us to say yes to some things that in past years we would have said no to. It’s becoming embedded in the process of deciding the products we’re going to do next.”\n\nOne example of this is the Apple Pencil that works with the iPad Pro. In order for Apple to include its version of a high-tech stylus, it had to deal with the fact that when people wrote on the device, the bottom of their hand would invariably brush the touch screen, causing all sorts of digital havoc. Using a machine learning model for “palm rejection” enabled the screen sensor to detect the difference between a swipe, a touch, and a pencil input with a very high degree of accuracy. “If this doesn’t work rock solid, this is not a good piece of paper for me to write on anymore — and Pencil is not a good product,” says Federighi. If you love your Pencil, thank machine learning.\n\n**Probably the best measure** of Apple’s machine learning progress comes from its most important AI acquisition to date, Siri. Its origins came from an ambitious DARPA program in intelligent assistants, and later some of the scientists started a company, using the technology to create an app. Steve Jobs himself convinced the founders to sell to Apple in 2010, and directed that Siri be built into the operating system; its launch was the highlight of the iPhone 4S event in October 2011. Now its workings extend beyond the instances where users invoke it by holding down the home button or simply uttering the words “Hey, Siri.” (A feature that itself makes use of machine learning, allowing the iPhone to keep an ear out without draining the battery.) Siri intelligence is integrated into the Apple Brain, at work even when it keeps its mouth shut.\n\nAs far as the core product is concerned, Cue cites four components of the product: speech recognition (to understand when you talk to it), natural language understanding (to grasp what you’re saying), execution (to fulfill a query or request), and response (to talk back to you). “Machine learning has impacted all of those in hugely significant ways,” he says.\n\n![Siri Advanced Development Head Tom Gruber (top) and Siri speech guru Alex Acero](https://ipfs.io/ipfs/QmaQZ8AcQjsmhZhExXQpnQav54rfVS7AHsE1zzyCnwiWv7)\n_Siri Advanced Development Head Tom Gruber (top) and Siri speech guru Alex Acero_\n\nSiri’s head of advanced development Tom Gruber, who came to Apple along with the original acquisition (his co-founders left after the 2011 introduction), says that even before Apple applied neural nets to Siri, the scale of its user base was providing data that would be key in training those nets later on. “Steve said you’re going to go overnight from a pilot, an app, to a hundred million users without a beta program,” he says. “All of a sudden you’re going to have users. They tell you how people say things that are relevant to your app. That was the first revolution. And then the neural networks came along.”\n\nSiri’s transition to a neural net handling speech recognition got into high gear with the arrival of several AI experts including Alex Acero, who now heads the speech team. Acero began his career in speech recognition at Apple in the early ’90s, and then spent many years at Microsoft Research. “I loved doing that and published many papers,” he says. “But when Siri came out, I said, ‘This is a chance to make these deep neural networks all a reality, not something that a hundred people read about, but used by millions.’” In other words, he was just the type of scientist Apple was seeking — prioritizing product over publishing.\n\nWhen Acero arrived three years ago, Apple was still licensing much of its speech technology for Siri from a third party, a situation due for a change. Federighi notes that this is a pattern Apple repeats consistently. “As it becomes clear a technology area is critical to our ability to deliver a great product over time, we build our in-house capabilities to deliver the experience we want. To make it great, we want to own and innovate internally. Speech is an excellent example where we applied stuff available externally to get it off the ground.”\n\nThe team began training a neural net to replace Siri’s original. “We have the biggest and baddest GPU (graphics processing unit microprocessor) farm cranking all the time,” says Acero. “And we pump lots of data.” The July 2014 release proved that all those cycles were not in vain.\n\n“The error rate has been cut by a factor of two in all the languages, more than a factor of two in many cases,” says Acero. “That’s mostly due to deep learning and the way we have optimized it — not just the algorithm itself but in the context of the whole end-to-end product.”\n\nThe “end-to-end” reference is telling. Apple isn’t first company to use DNNs in speech recognition. But Apple makes the argument that by being in control of the entire delivery system, it has an advantage. Because Apple makes its own chips, Acero says he was able to work directly with the silicon design team and the engineers who write the firmware for the devices to maximize performance of the neural net. The needs of the Siri team influenced even aspects of the iPhone’s design.\n\n“It’s not just the silicon,” adds Federighi. “It’s how many microphones we put on the device, where we place the microphones. How we tune the hardware and those mics and the software stack that does the audio processing. It’s all of those pieces in concert. It’s an incredible advantage versus those who have to build some software and then just see what happens.”\n\nAnother edge: when an Apple neural net works in one product, it can become a core technology used for other purposes. So the machine learning that helps Siri understand you becomes the engine to handle dictation instead of typing. As a result of the Siri work, people find that their messages and emails are more likely to be coherent if they eschew the soft keyboard and instead click on the microphone key and talk.\n\nThe second Siri component Cue mentioned was natural language understanding. Siri began using ML to understand user intent in November 2014, and released a version with deeper learning a year later. As it had with speech recognition, machine learning improved the experience — especially in interpreting commands more flexibly. As an example, Cue pulls out his iPhone and invokes Siri. “Send Jane twenty dollars with Square Cash,” he says. The screen displays a screen reflecting his request. Then he tries again, using a little different language. “Shoot twenty bucks to my wife.” Same result.\n\nApple now says that without those advances in Siri, it’s unlikely it would have produced the current iteration of the Apple TV, distinguished by sophisticated voice control. While the earlier versions of Siri forced you to speak in a constrained manner, the supercharged-by-deep-learning version can not only deliver specific choices from a vast catalog of movies and songs, but also handle concepts: _Show me a good thriller with Tom Hanks. (If Siri is really smart, it’ll rule out The Da Vinci Code._) “You wouldn’t be able to offer that prior to this technology,” says Federighi.\n\nWith iOS 10, scheduled for full release this fall, Siri’s voice becomes the last of the four components to be transformed by machine learning. Again, a deep neural network has replaced a previously licensed implementation. Essentially, Siri’s remarks come from a database of recordings collected in a voice center; each sentence is a stitched-together patchwork of those chunks. Machine learning, says Gruber, smooths them out and makes Siri sound more like an actual person.\n\nAcero does a demo — first the familiar Siri voice, with the robotic elements that we’ve all become accustomed to. Then the new one, which says, “Hi, what can I do for you?” with a sultry fluency. What made the difference? “Deep learning, baby,” he says.\n\nThough it seems like a small detail, a more natural voice for Siri actually can trigger big differences. “People feel more trusting if the voice is a bit more high-quality,” says Gruber. “The better voice actually pulls the user in and has them use it more. So it has an increasing-returns effect.”\n\nThe willingness to use Siri, as well as the improvements made by machine learning, becomes even more important as Apple is finally opening Siri up to other developers, a process that Apple’s critics have noted is long overdue. Many have noted that Apple, whose third-party Siri partners number in the double figures, is way behind a system like Amazon’s Alexa, which boasts over 1000 “skills” provided by outsider developers. Apple says the comparison doesn’t hold, because on Amazon users have to use specific language to access the skills. Siri will integrate things like SquareCash or Uber more naturally, says Apple. (Another competitor, Viv — created by the other Siri co-founders — also promises tight integration, when its as-yet-unannounced launch date arrives.)\n\nMeanwhile, Apple reports that the improvements to Siri have been making a difference, as people discover new features or find more success from familiar queries. “The number of requests continues to grow and grow,” says Cue. “I think we need to be doing a better job communicating all the things we do. For instance, I love sports, and you can ask it who it thinks is going to win the game and it will come back with an answer. I didn’t even know we were doing that!”\n\n**Probably the biggest** issue in Apple’s adoption of machine learning is how the company can succeed while sticking to its principles on user privacy. The company encrypts user information so that no one, not even Apple’s lawyers, can read it (nor can the FBI, even with a warrant). And it boasts about not collecting user information for advertising purposes.\n\nWhile admirable from a user perspective, Apple’s rigor on this issue has not been helpful in luring top AI talent to the company. “Machine learning experts, all they want is data,” says a former Apple employee now working for an AI-centric company. “But by its privacy stance, Apple basically puts one hand behind your back. You can argue whether it’s the right thing to do or not, but it’s given Apple a reputation for not being real hardcore AI folks.”\n\nThis view is hotly contested by Apple’s executives, who say that it’s possible to get all the data you need for robust machine learning without keeping profiles of users in the cloud or even storing instances of their behavior to train neural nets. “There has been a false narrative, a false trade-off out there,” says Federighi. “It’s great that we would be known as uniquely respecting user’s privacy. But for the sake of users everywhere, we’d like to show the way for the rest of the industry to get on board here.”\n\nThere are two issues involved here. The first involves processing personal information in machine-learning based systems. When details about a user are gleaned through neural-net processing, what happens to that information? The second issue involves gathering the information required to train neural-nets to recognize behaviors. How can you do that without collecting the personal information of users?\n\nApple says it has answers for both. “Some people perceive that we can’t do these things with AI because we don’t have the data,” says Cue. “But we have found ways to get that data we need while still maintaining privacy. That’s the bottom line.”\n\nApple handles the first issue — protecting personal preferences and information that neural nets identify — by taking advantage of its unique control of both software and hardware. Put simply, the most personal stuff stays inside the Apple Brain. “We keep some of the most sensitive things where the ML is occurring entirely local to the device,” Federighi says. As an example, he cites app suggestions, the icons that appear when you swipe right. Ideally, they are exactly the apps you intended to open next. Those predictions are based on a number of factors, many of them involving behavior that is no one’s business but your own. And they do work — Federighi says 90 percent of the time people find what they need by those predictions. Apple does the computing right there on the phone.\n\nOther information Apple stores on devices includes probably the most personal data that Apple captures: the words people type using the standard iPhone QuickType keyboard. By using a neural network-trained system that watches while you type, Apple can detect key events and items like flight information, contacts, and appointments — but information itself stays on your phone. Even in back-ups that are stored on Apple’s cloud, the information is distilled in such a way that it can’t be inferred by the backup alone. “We don’t want that information stored in Apple servers,” says Federighi. “There is no need that Apple as a corporation needs to know your habits, or when you go where.”\n\nApple also tries to minimize the information kept in general. Federighi mentions an example where you might be having a conversation and someone mentions a term that is a potential search. Other companies might have to analyze the whole conversation in the cloud to identify those terms, he says, but an Apple device can detect it without having the data leave the user’s possession — because the system is constantly looking for matches on a knowledge base kept on the phone. (It’s part of that 200 megabyte “brain.”)\n\n“It’s a compact, but quite thorough knowledge base, with hundreds of thousands of locations and entities. We localize it because we know where you are,” says Federighi. This knowledge base is tapped by all of Apple’s apps, including the Spotlight search app, Maps, and Safari. It helps on auto-correct. “And it’s working continuously in the background,” he says.\n\nThe question that comes up in machine learning circles, though, is whether Apple’s privacy restrictions will hobble its neural net algorithms — that’s the aforementioned second issue. Neural nets need massive amounts of data to be sufficiently trained for accuracy. If Apple won’t suck up all its users’ behavior, how will it get that data? As many other companies do, Apple trains its nets on publicly available corpuses of information (data sets of stock images for photo recognition, for instance). But sometimes it needs more current or specific information that could only come from its user base. Apple tries to get this information without knowing who the users are; it anonymizes data, tagging it with random identifiers not associated with Apple IDs.\n\nBeginning with iOS 10, Apple will also employ a relatively new technique called Differential Privacy, which basically crowd-sources information in a way that doesn’t identify individuals at all. Examples for its use might be to surface newly popular words that aren’t in Apple’s knowledge base or its vocabulary, links that suddenly emerge as more relevant answers to queries, or a surge in the usage of certain emojis. “The traditional way that the industry solves this problem is to send every word you type, every character you type, up to their servers, and then they trawl through it all and they spot interesting things,” says Federighi. “We do end-to-end encryption, so we don’t do that.” Though Differential Privacy was hatched in the research community, Apple is taking steps to apply it on a massive scale. “We’re taking it from research to a billion users,” says Cue.\n\n“We started working on it years ago, and have done really interesting work that is practical at scale,” explains Federighi. “And it’s pretty crazy how private it is.” (He then describes a system that involves virtual coin-tossing and cryptographic protocols that I barely could follow — and I wrote a book about cryptography. Basically it’s about adding mathematical noise to certain pieces of data so that Apple can detect usage patterns without identifying individual users.) He says that Apple’s contribution is sufficiently significant — and valuable to the world at large — that it is authorizing the scientists working on the implementation to publish a paper on their work.\n\n**While it’s clear that machine learning** has changed Apple’s products, what is not so clear is whether it is changing Apple itself. In a sense, the machine learning mindset seems at odds with the Apple ethos. Apple is a company that carefully controls the user experience, down to the sensors that measure swipes. Everything is pre-designed and precisely coded. But when engineers use machine learning, they must step back and let the software itself discover solutions. Can Apple adjust to the modern reality that machine learning systems can themselves have a hand in product design?\n\n“It’s a source of a lot of internal debate,” says Federighi. “We are used to delivering a very well-thought-out, curated experience where we control all the dimensions of how the system is going to interact with the user. When you start training a system based on large data sets of human behavior, [the results that emerge] aren’t necessarily what an Apple designer specified. They are what emerged from the data.”\n\nBut Apple isn’t turning back, says Schiller. “While these techniques absolutely affect how you design something, at the end of the day we are using them because they enable us to deliver a higher quality product.”\n\nAnd that’s the takeaway: Apple may not make declarations about going all-in on machine learning, but the company will use it as much as possible to improve its products. That brain inside your phone is the proof.\n\n“The typical customer is going to experience deep learning on a day-to-day level that [exemplifies] what you love about an Apple product,” says Schiller. “The most exciting [instances] are so subtle that you don’t even think about it until the the third time you see it, and then you stop and say, _How is this happening?_”\n\nSkynet can wait.\n\n_Creative Art Direction by: Redindhi Studio\nPhotography by: Michelle Le\nThanks to Sandra Upson and Miranda Katz._"
		},
		{
			"post_id": 7,
			"title": "Donald Trump will control the NSA – what this means for your privacy",
			"date_published": 1478833595,
			"body": "Earlier this week, Donald Trump won a stunning election victory that will put him in charge of the world’s most powerful mass surveillance infrastructure.\n---\nOriginal: https://protonmail.com/blog/trump-control-nsa-privacy/\nBy _Andy Yen_\n\nRegardless of which side of the political spectrum you are on, Trump’s control over the NSA is now an indisputable fact, and we think it is worth taking a closer look at what this means. It is important to note that as a Swiss company which benefits from Swiss government support, **ProtonMail follows the Swiss policy of neutrality. We do not take any position for or against Trump**, nor any position for or against any particular country or government. We believe privacy is an universal value, so we do not take any sides.\n\nHowever, given America’s significant influence on the world, and the large number of ProtonMail users who come from the US, we are not a disinterested party.  Furthermore, we realise that the implications of a Trump presidency also interest a large proportion of the ProtonMail community, so we are here today to offer our unbiased opinion.\n\n## How much power over the NSA does Trump have?\nDue to the way the US government is structured, President Trump will have a large amount of control over the NSA. The NSA is not different from any other federal agency which the president controls. The US president will be able to dictate how the agency operates through his power to appoint the NSA Director. The NSA Director needs to be confirmed through majority vote by the US Senate, but due to Republican control over the Senate, President Trump will have complete freedom to appoint anyone he wants to carry out his orders.\n\nAs a federal agency however, the activities of NSA are governed by federal law, in particular, the Foreign Intelligence Surveillance Act. However, with Republican control over both houses of Congress, President Trump would have broad power to rewrite FISA as he sees fit or introduce a new law. Of course, a new law could be subject to court challenge which could eventually work its way up to the US Supreme court, but Trump is also expected to gain control over the Supreme court. Therefore, all things considered, there is no denying that President Trump would have broad powers to re-shape the US surveillance apparatus to serve his agenda.\n\n## Should Americans Be Worried?\n**Since Trump’s victory, the number of new users coming to ProtonMail has doubled compared to the previous week**. Many of our new users have voiced a few common concerns both on Twitter and also in emails to us. Given Trump’s campaign rhetoric against journalists, political enemies, immigrants, and Muslims, there is concern that Trump could use the new tools at his disposal to target certain groups. As the NSA currently operates completely out of the public eye with very little legal oversight, all of this could be done in secret.\n\n##It is not Trump’s fault\nIt is tempting to blame all this on Trump and his supporters, but that is taking the easy way out. All Trump does is put a new face on the existing privacy problem, so now it concerns a segment of the population that previously didn’t care as much. **ProtonMail users have always come from both the left and right side of the political spectrum**. Today, we are seeing an influx of liberal users, but ProtonMail has also long been popular with the political right, who were truly worried about big government spying, and the Obama administration having access to their communications. Now the tables have turned.\n\nThe same terror the political right has experienced is now being felt in liberal bubbles such as Silicon Valley for the first time. The left is correct to be terrified of a Trump-led NSA snooping on their communications, **especially since Silicon Valley giants like Google and Facebook can be forced to spy on users on behalf of Trump’s NSA**. However, this precedent was not set by Trump – he hasn’t even taken office yet. **The first major incident of a US tech giant being complicit in US government spying actually took place in 2015 under the Obama administration**.\n\n## Privacy is something we must all champion\nOne of the problems with having a technological infrastructure that can be abused for mass surveillance purposes, is that governments can and do change, quite regularly in fact. **This demonstrates that privacy isn’t just a liberal or conservative issue, it is something that we all need to champion**, regardless of our political leanings. _This is why ProtonMail is committed to building a safe haven for all people in the world, regardless of nationality, political views, or religious beliefs_.\n\nThe only way to protect our freedom is to build technologies, such as end-to-end encryption, which cannot be abused for mass surveillance. **Governments can change, but the laws of mathematics upon which encryption is based, are much harder to change**.\n\n## What can you do to protect your privacy rights?\n\nPrivacy is a non-partisan issue, and we hope politicians around the world wake up to the fact that **privacy is not only essential for democracy, it is also critical for securing the growing digital economy**. In the case of encrypted email services such as ProtonMail, you even get better security in addition to the privacy. Privacy is a cause that we should all be able to unify behind, regardless of political beliefs.\n\nIn the meantime, there are fortunately a growing number of services which can help to keep government spies out of your communications, so there is no need to worry regardless of who wins the election. For securing your email, ProtonMail offers free encrypted email accounts, although you can support ProtonMail by donating or upgrading to a paid account.\n\nFor defending against NSA mass surveillance, we also recommend the Signal messaging app, using a VPN service, or using an alternative search engine such as duckduckgo.com or qwant.com. But most importantly, spread the word about the dangers of mass surveillance so politicians take note and make protecting our digital rights a priority.\n\n_Best Regards,\nThe ProtonMail Team_"
		},
		{
			"post_id": 6,
			"title": "Valerian and the City of a Thousand Planets (Luc Besson) - First Trailer",
			"date_published": 1478804463.525,
			"body": "![Valerian and the City of a Thousand Planets](https://ipfs.io/ipfs/QmNoYcjDxAJq7szXwNuqDtXBihgTxYxx9m5A5NnJNk3Eod)\n\nRooted in the classic graphic novel series, Valerian and Laureline- visionary writer/director Luc Besson advances this iconic source material into a contemporary, unique and epic science fiction saga.\n---\nValerian (Dane DeHaan) and Laureline (Cara Delevingne) are special operatives for the government of the human territories charged with maintaining order throughout the universe.\n\nUnder directive from their Commander (Clive Owen), Valerian and Laureline embark on a mission to the breathtaking intergalactic city of Alpha, an ever-expanding metropolis comprised of thousands of different species from all four corners of the universe. Alpha’s seventeen million inhabitants have converged over time- uniting their talents, technology and resources for the betterment of all. Unfortunately, not everyone on Alpha shares in these same objectives; in fact, unseen forces are at work, placing our race in great danger.\n\n<video controls style=\"max-width: 100%\">\n  <source src=\"https://ipfs.io/ipfs/QmdTfmiWPLKVpXDrwGwpj1itJNvqd6SNLuDXKhwNvjHmLu\" type=\"video/mp4\">\nYour browser does not support the video element.\n</video> "
		},
		{
			"post_id": 5,
			"title": "Trump Picks Top Climate Skeptic to Lead EPA Transition",
			"date_published": 1474939185,
			"body": "Choosing Myron Ebell means Trump plans to drastically reshape climate policies\n---\nSource: https://www.scientificamerican.com/article/trump-picks-top-climate-skeptic-to-lead-epa-transition/?wt.mc=SA_Twitter-Share\n\nDonald Trump has selected one of the best-known climate skeptics to lead his U.S. EPA transition team, according to two sources close to the campaign.\n\nMyron Ebell, director of the Center for Energy and Environment at the conservative Competitive Enterprise Institute, is spearheading Trump’s transition plans for EPA, the sources said.\n\nThe Trump team has also lined up leaders for its Energy Department and Interior Department teams. Republican energy lobbyist Mike McKenna is heading the DOE team; former Interior Department solicitor David Bernhardt is leading the effort for that agency, according to sources close to the campaign.\n\nEbell is a well-known and polarizing figure in the energy and environment realm. His participation in the EPA transition signals that the Trump team is looking to drastically reshape the climate policies the agency has pursued under the Obama administration. Ebell’s role is likely to infuriate environmentalists and Democrats but buoy critics of Obama’s climate rules.\n\nEbell, who was dubbed an “elegant nerd” and a “policy wonk” by Vanity Fair, is known for his prolific writings that question what he calls climate change “alarmism.” He appears frequently in the media and before Congress. He’s also chairman of the Cooler Heads Coalition, a group of nonprofits that “question global warming alarmism and oppose energy-rationing policies.”\n\nEbell appears to relish criticism from the left.\n\nIn a biography submitted when he testified before Congress, he listed among his recognitions that he had been featured in a Greenpeace “Field Guide to Climate Criminals,” dubbed a “misleader” on global warming by Rolling Stone and was the subject of a motion to censure in the British House of Commons after Ebell criticized the United Kingdom’s chief scientific adviser for his views on global warming.\n\nMore recently, Ebell has called the Obama administration’s Clean Power Plan for greenhouse gases illegal and said that Obama joining the Paris climate treaty “is clearly an unconstitutional usurpation of the Senate’s authority.”\n\nHe told Vanity Fair in 2007, “There has been a little bit of warming ... but it’s been very modest and well within the range for natural variability, and whether it’s caused by human beings or not, it’s nothing to worry about.”\n\nEbell’s views appear to square with Trump’s when it comes to EPA’s agenda. Trump has called global warming “bullshit” and he has said he would “cancel” the Paris global warming accord and roll back President Obama’s executive actions on climate change (ClimateWire, May 27).\n\nLeading the Trump DOE team: GOP hired gun McKenna.\n\nThe president of MWR Strategies is well known in Republican energy circles. He was director of policy and external affairs for the Virginia Department of Environmental Quality under then-Gov. George Allen (R) and was an external relations specialist at the Energy Department during the George H.W. Bush administration.\n\nHis lobbying clients in 2016 include Koch Companies Public Sector LLC, Southern Company Services, Dow Chemical Co. and Competitive Power Ventures Inc., according to public disclosures.\n\nAnd heading Interior’s transition effort is Bernhardt, co-chairman of the Natural Resources Department at the law firm Brownstein Hyatt Farber Schreck.\n\nHe served as Interior’s solicitor during the George W. Bush administration after holding several other high-ranking jobs at the department.\n\nIn addition to the EPA, Interior and DOE team leaders, GOP energy expert Mike Catanzaro is also working on energy policy for the Trump transition team (Greenwire, Sept. 14).\n\nDuring the Obama transition in 2008, a relatively small team was assembled ahead of the election in order to map out broad policy goals.\n\nFollowing the election, the operation expanded dramatically and teams were dispatched to work out of agencies to gather information from political staffers and career officials, write flurries of memos and compile thick binders of intelligence to hand over to the incoming leadership (Greenwire, Aug. 19, 2016).\n\nShould Trump win in November, Ebell, McKenna and Bernhardt will likely be leading similar efforts to reform their respective agencies.\n\nEbell and McKenna directed questions about their roles to the Trump transition team. The Trump campaign and Bernhardt did not respond to requests for comment.\n\nThis story also appears in E&E Daily.\n\nReprinted from ClimateWire with permission from Environment & Energy Publishing, LLC. E&E provides daily coverage of essential energy and environmental news at www.eenews.net."
		},
		{
			"post_id": 4,
			"title": "Five New Reasons Why You Should Move to Argentina If Trump Wins",
			"date_published": 1478632860,
			"body": "![Trump](https://ipfs.io/ipfs/QmaZ7mBpaqxPB7UrhUKHEAVB6RudfNzZZjkBdECtHuf67B)\n\nSure, Canada is right there. But may I suggest you try our country instead?\n---\n> *Disclamer from the ZeroBlog owner, (this is not part of the original). Despite the humor on this note I can tell that the description of Argentina is accurate enough.*\n\nOriginal: http://www.thebubble.com/move-to-argentina-if-trump-wins/\n\nDear US voter,\n\nHi. Adrian Bono here. Journalist, political wonk and avid consumer of your outrageous pop culture.\n\nI am writing today to extend my hand in solidarity. We’re only hours away from the results and, to much of the world’s consternation, Republican candidate Donald Trump remains popular and the prospect of a surprise win is looking like a possibility.\n\nAt the same time, social media is rife with foreshadowing articles about professors predicting that the real estate mogul is headed for a win or artificial intelligence systems saying Trump “is indeed more popular than Barack Obama was in 2008” and will without a doubt defeat Hillary Clinton on Tuesday.\n\nAnd in a year that has given us Brexit in the UK, Duterte in the Philippines and Colombia’s middle finger to a historic peace process, the idea of living under the tyrannical rule of a racist misogynist whose intrinsic understanding of the world can be easily challenged by the yellow teletubby is keeping you awake at night. You haven’t had this much trouble falling asleep since you were a kid and decided it would be a good idea to rent Stephen King’s It and not cover your eyes during that horrid scene.\n\nThe problem this time is that it’s not just little George that is being pulled into the storm drain of American politics but all of humanity. Since a Donald Trump presidency will have an (almost certainly) negative effect on every person on the planet, we all share a concern over the electoral fate of the United States.\n\nHas the world gone mad? Perhaps. Because even though scholars and social scientists agree that we’re living in the most prosperous and peaceful time in human history, we just can’t shake off the feeling that it’s all slowly but steadily going to shit. And in this post-truth world of self-fulfilled prophecies, a Trump presidency would be the cherry on top of a very strange 2016, also known as the year of living stupidly.\n\nThis scenario is expected to trigger a mass exodus from the US as many younger, more progressive voters decide to leave their pumpkin spice lattes behind and look for greener pastures in nations that are culturally similar but are perceived as being less of an asshole. And according to Google, it seems Canada is the most popular destination for potential future trexpats. (Yes. In the year of silly portmanteaus, “trexpat” is what I came up with. I smell a Pulitzer!)\n\n> **Trexpat** */noun/*\n>    A political expatriate, most commonly from the United States, who decides to leave their own country out of outrage and/or fear of the direct or indirect effects of a Donald Trump presidency. Synonym: trefugee (which sounds less glamorous, so let’s not).\n\nLook, I get it. Canada is awesome. And they have Justin Trudeau so it’s hard to compete with that. But if you still feel like your geographical proximity to Trumpland may give you cooties, I am here to suggest an alternative and pretty cool destination:\n\n![Argentinian flag](https://ipfs.io/ipfs/QmY1pHbQHPV189gySq8a1YEsuNLvvfQ16SojhzLyVqQcv4)\n\nThat’s right. Argentina.\n\nThe country of tango, beef and Evita. And while this brief characterization pretty much sums up the entire country, truth is there’s a lot more than meets the eye on this side of the equator. It’s not just that the cultural similarities are astonishing (Buenos Aires has Uber too!) but from a political point of view this country is a Berniebro’s wet dream.\n\nWhile Canada seems like an obvious choice for those who want to play it safe and still be able to seldom cross the border to have a deep fried Snickers bar, Argentina remains a place for the adventurous, the romantic and the slightly sociopathic. Because no matter how fucked up a nation can be, it will still be better than the United States of Trump.\n\nSo as you count down the hours to D-day, here are the five reasons why you should pick Argentina in the event of a Donald Trump presidency.\n\n## 1. OUR LEADERS ARE CRAZY BUT NOT BATSHIT CRAZY\n\nSeveral decades ago, South America in general was perceived by the US (and I blame Hollywood for this one) as nothing but a mysterious land of dense jungles, aging Nazis, bloody dictatorships, kidnappings and villains with funny accents that pretty much looked like this:\n\n![Trump](https://ipfs.io/ipfs/QmfSKFAbTseGDSNj3gntzaRKLRDDFqCoZWuvkKYJh9awuK)\n\nFortunately for us, South America’s dark ages are long gone and the whole region eventually became a much better place to live, producing colorful political leaders that, while flawed and corrupt (hey, nobody’s perfect), you still wanted to have a few beers with.\n\nArgentina is of course no exception, starting with President Carlos Menem, who was in office from 1989 to 1999. He was our 90s! And while you guys were arguing over who wore it better, Brenda or Kelly, down here it was all about the sideburns. You think Trump has a bad hair problem? Check out these bad boys:\n\n![el presidente](https://ipfs.io/ipfs/QmYzYZ7pgFCvkZ8WwkDAkMPHu79i2sGjZz3QrJkRfAV18d)\n*The president of every South American nation (AKA “el presidente”) circa 1985, according to the movies.*\n\nOh, not to worry. He got rid of that look eventually. Here he is with Queen Elizabeth II, looking presentable and stuff.\n\nNow, let me be clear: corruption ran rampant during his administration and his government’s economic policy led to Argentina’s largest economic meltdown with 50 percent of the population living in poverty by 2001 but damn, was he charismatic!\n\nLook! Here he is perpetuating the stereotype that all Argentines know how to dance tango.\n\nhttps://www.youtube.com/watch?v=O_ya5mbBRpE\n\nActually, no. That was terrible dancing. However, it would appear political strategists from all over the ideological spectrum believe the best way to connect with plebeians in Argentina is through the art of dancing.\n\nCristina Kirchner does it.\n\nhttps://www.youtube.com/watch?v=zgdSj5n56NY\n\nMauricio Macri does it.\n\nhttps://www.youtube.com/watch?v=X2WUVO9Vef8\n\nAnd who could forget totally out-of-sync dancer Walter Wayar? He ran for mayor of Salta and lost, but his awkward dancing will forever live in our hearts.\n\nhttps://www.youtube.com/watch?v=KWvAnD3whxA\n\nWhen it comes to the Politicians Behaving Badly department, none of them are an exception. Corruption is endemic here and is (probably) still going strong so I’m not going near that mess today. Let’s focus on irreverent or politically incorrect public demeanor instead. Is Donald Trump worse?\n\nWell, former President Cristina Kirchner’s strong nationalism caused her to wade into some shallow discrimination a few times, like when she said Europeans were “mostly xenophobes” (she later said she didn’t mean it) and made some weird faces when one of her staffers talked about his Montenegro heritage. Did I mention she also suggested ISIS was probably just a bunch of actors and that the US might try to kill her? She did. And who could forget about that time she showed up in a wheelchair on national television, all dressed in white, to dissolve Argentina’s intelligence agency.\n\nhttps://www.youtube.com/watch?v=M40FIzOa0_8\n\nTerrifying, isn’t she?\n\nI guess we could say from all of Argentina’s recent leaders, and while analyzing her political persona, she is the most Trump-like. When in office, she was authoritarian, paranoid. vengeful. She spoke ill of journalists who were critical of her, she deeply polarized the population and constantly tried to convince us that the entire world was against her. But she never had the power (or intent) to obliterate a small country or believed we should build a wall to keep people from crossing into the country. Last year her party’s candidate lost the elections and while she did throw a tantrum of sorts, she didn’t say the system was rigged nor called for a foreign power to hack Mauricio Macri’s computer.\n\nWhen it comes to misogyny, President Mauricio Macri is far from perfect. He has been in hot water in the past after he said during an interview that all women liked to be catcalled and that telling them that they had a “nice ass” should be taken as a compliment because lighten up, women!\n\nThe difference is that after this incident made national headlines, one of his own daughters  confronted him and yelled at him and forced him to apologize on Twitter.\n\n![Trump](https://ipfs.io/ipfs/QmWcE85yYy7i46NGnHNQyP55Cc3yiGnXc5mkr6aw6tBmrg)\n\nIvanka should take note.\n\nLook. Argentina still has some crazies with really controversial positions out there, like homophobic Alfredo Olmedo, who called for separate restrooms for gays, or Luis D’Elía, who takes pride in saying he hates white people. And yet, their extreme views never really become mainstream. On the contrary, their own hateful rhetoric pushes them to the fringes of their own parties, unlike he-who-shall-not-be-named.\n\nSo if you’re trying to escape the impunity of Trumpism, this is a good place for you.\n\n## 2. WE LOVE IMMIGRANTS DOWN HERE\n\n![Welcome to Argentina](https://ipfs.io/ipfs/Qma6iJrTsHiw5ziYVGnKubqCsECAQzU1hd8VPbBJHmgitk)\n*Despite this desolate appearance, Argentina does actually have people and cities. (Photo via elmeme.com)*\n\nArgentina is a nation of immigrants and people here are proud of their heritage, a mix between the great European immigration from the 19th century and the local indigenous population. It’s right there in Section 25 of the Constitution:\n\n“The Federal Government shall foster European immigration; and may not restrict, limit or burden with any tax whatsoever, the entry into the Argentine territory of foreigners who arrive for the purpose of tilling the soil, improving industries, and introducing and teaching arts and sciences.”\n\nOh, don’t be put out by that “European” part. It was written a long time ago by white men in ridiculous dresses. Don’t take it seriously. We love everybody! Guess who’s happily accepting 3000 Syrian refugees? We are.\n\nAs a concept, this is so deeply ingrained in the Argentine ethos that any efforts to tighten border security are almost universally met with accusations of xenophobia. Basically Donald Trump’s worst nightmare. And not only that. Just like Canadians, we’re happy to let citizens from all over the world come to our hospitals for health care or universities for higher education at no or very (very) low charge. Not so bad, eh? Even right now the population is up in arms over some recent comments made by a Peronist senator who suggested that other South American countries were taking advantage of Argentina’s lax immigration policies and were “sending us their worst.” Oh, no you didn’t!\n\nArgentina is a melting pot. People here speak Rioplatense Spanish, move like the Italians, shop like ~~Americans~~ people from the US, party like Brazilians and dress like the French. And when someone from abroad moves into the neighborhood, the locals will make it their lives’ mission to prove that this is the best country in the world. Besides, Argentina is yuge! There are thousands and thousands of square kilometers waiting to be turned into hipster coffee shops in Patagonia. There is so much unexploited land here that there’s even this urban legend that right-wingers love to float from time to time that says that “the Zionists” (yeah, you know where this is going, don’t you) were trying to “take over the south of Argentina” and set up some kind of Israel 2.0 there. I mean, seriously? Considering all the Nazis that fled Europe and were allowed safe passage to Argentina that sounds like a pretty terrible idea to me.\n\nAnd while Argentina is the only country in the region where less than 50 percent of the population has a positive view of the United States (at least until last year), don’t let that confuse you. The problem is not you, it’s your government’s foreign policy and its unforgivable decision to look the other way when the darkest chapter in Argentine history had just begun. To be fair, the Carter administration tried hard to reverse its predecessor’s apathy but the damage had already been done and Henry Kissinger will go down in Argentine history as Satan incarnate.\n\nSure, you may occasionally run into some asshole who screams “yanqui go home” at you but chances are most people you meet here will be more interested in cooking an asado for you and teaching you how to swear like a local.\n\nAnd if you still don’t trust me, here’s a list of (fictional and non-fictional) people who chose to move to Argentina because it’s all good here.\n\n- The Soup Nazi\n- Actual Nazis\n-  Butch Cassidy and the Sundance Kid\n- Actual Adolf Hitler (like, some people say that, for real)\n- Dexter Morgan (the serial killer guy)\n- Sebastian Shaw (technically a Nazi but also a mutant)\n- Hannibal Lecter\n\nIf you can look past the fact that all of them are blood-thirsty villains (and one of them is Adolf Hitler) then you should follow their lead and just move here.\n\n## 3. POP CULTURE HERE IS VERY SIMILAR TO US POP CULTURE\n\n![The Simpsons](https://ipfs.io/ipfs/QmWHY7sZtM1AJiA6nuFV3p44wzhnGNg6VHzyU533aoUxU3)\n*Dear The Simpsons: Except for hipsters in Palermo, no one in this country wears those ridiculous hats. No one.*\n\nNo, I’m serious.\n\nNetflix? Check. Starbucks? Check. Uber? Check. Game of Thrones? Check. Did you know Argentines are obsessed with The Simpsons*? And I mean obsessed. To the point that the early seasons managed to shape the vernacular of Argentine millennials in such a degree that it’s almost impossible to have a conversation with a local 30-something without having them quote Homer or Mr. Burns every five minutes.\n\nhttps://www.youtube.com/watch?v=wHQczpyUfvw\n\nFriends long before yours and this year the latest season of The X-Files was broadcast here simultaneously with New York. (Suck it, California!) We obsess over Apple products (that we can’t afford) and Dancing with the Stars (which, trust me, is a lot more… audacious than your prudish US version). Don’t believe me? See for yourself.\n\nYup. Never underestimate the power of softcore porn on network television.\n\nLove the Kardashians and Ru Paul’s Drag Race? Don’t worry, E! is down here too. So are MTV, HBO and Fox News (Fox News!) Although I should warn you, Ru Paul has nothing on Moria Casán.\n\nhttps://www.youtube.com/watch?v=4s6pwMMm3Fk\n\nPeople here obsess over Tinder, Twitter and take out. And Argentines are not just the most fluent English speakers in Latin America, we also celebrate Saint Patrick’s and Halloween, much to the chagrin of some local nationalists who believe that celebrating on October 31st is just another imperialist marketing ploy (like Christmas).\n\nWe are the country of Evita, Che Guevara and Pope Francis. And yes, when it comes to politics, we’re as polarized as the United States, except that instead of arguing about assault rifles we fight over whether football matches should be broadcast for free or not (they shouldn’t). And here’s another fun coincidence: we kicked the British out too twice once after a failed attempt to invade us in 1807**. You may also find it interesting to know that we are a constitutional republic with division of powers, just like you! In fact, don’t tell anyone but our Constitution is “loosely based” on yours.\n\nWe are also a nation of imperfect exceptionalism. For instance, there has to be a downside to living here. Unfortunately for all of humanity, there is no Apple Store here. I know, it’s tragic. I don’t know where we find the strength to get out of bed every morning, but we do so anyway fully aware that some day, somehow, Tim Cook will make our lives a better place.\n\nAlso, this:\n\nhttps://www.youtube.com/watch?v=6t9B0KDfiQo\n\nYes. People still clap when their plane lands safely, a way of showing the pilot their appreciation for not killing them all. Which I guess is understandable if they were flying a Wright Flyer in 1903 but they are not. So stop. Forever.\n\n* Only the first ten seasons because we all know the show went downhill after that.\n\n** Technically we were still a part of Spain back then, but that was a long time ago and no one cares anymore. So stop.\n\n## 4. ARGENTINA IS AN EXTREMELY (ALBEIT SOMETIMES CONTRADICTORY) PROGRESSIVE COUNTRY\n\n![Pride parade](https://ipfs.io/ipfs/QmRVVAYoA1f9U4YRZPx3V2B8eT7iyg1yQJq2wjHhXYqEck)\n*Remember when I said this country is a Berniebro’s wet dream? I wasn’t kidding. (Photo via La Campora Diversa)*\n\nSorry, ~~America~~ United States, but when it comes to marriage equality, Argentina came first. The #NiUnaMenos movement against gender violence that recently spread throughout the Americas? We invented that shit. Obamacare? Please. We’ve had universal healthcare for a while now. Student debt? We don’t know what that is. Christopher Columbus? Bad guy (at least to half of the population). I already mentioned immigration so no need to go back to that. And politically speaking, everyone is to the left of Bernie Sanders. Or forced to move there for electoral purposes.\n\nWhen it comes to the younger generations, some millennials surely hold controversial or conservative positions when it comes to some social issues but generally speaking they are bleeding-heart liberals and politically active. Unions are gods and workers’ rights are more sacred than cats were in ancient Egypt. Your Uber driver wasn’t that great? You better think twice before rating him anything less than five stars! Do you want him to lose his job and go hungry? Didn’t think so. Although depending on who you ask, Uber is an imperialist money-grabber that is leaving cab drivers out of work. So I guess you’re a monster either way.\n\nAnd in case you’re wondering, even though the Macri administration is seen as center-right by Argentina’s standards, they follow the ideals — and are mostly aligned with — the Democratic party. Or at least that’s what they say when privately meeting with the media.\n\nYes, my friends. There are many contradictions in this country. In practice, we really suck at saving the planet. But in theory, we think climate change is 100 percent real and needs to be addressed. We complain about disastrous customer service everywhere, but when a client complains we just shrug and look the other way.\n\nBut at its core, Argentines are inherently empathetic and while there is still a lot to be done to eradicate sexism, racism, homophobia and body shaming practices, this country is definitely in the right direction.\n\nWhat’s that? “What about a woman’s right to choose?” you say? Sorry, no comment. Next time.\n\n## 5. IN CASE OF WORLD WAR III, WE’RE FAR AWAY FROM THE ACTION\n\n![Nuke](https://ipfs.io/ipfs/QmUTM7sSUFaejcnsHMnjgNzBwhfAFcq9QVZidjK9PZPtPB)\n*Probably not Buenos Aires.*\n\nLet’s face it. A Trump presidency brings us closer to midnight and the doomsday clock is already at 11:57. True, once Colombia manages to abandon its conflict with the FARC there will be officially no more wars in the Western Hemisphere. But taking into consideration his major misunderstanding of international relations, there’s a chance he could spark a global conflict that humanity has pretty much made up its mind that it’s going to happen. So much so that there’s already a Wikipedia page about it. And even if he doesn’t do it, it’s possible that Clippy and Siri will go full Skynet on our asses and kill us all in our sleep in the next ten years.\n\nSo if you’re looking to increase your chances of survival, Argentina is not a bad place to reset your life. First of all, our DSL and 4G connections suck, so Siri will have a hard time tracking you on Find my Friends. But also, there’s a reason why most bad guys migrate to the land of the Pampas and that is because oh my God, it’s so far away from everything I feel like dying.\n\n![Clippy](https://ipfs.io/ipfs/QmTBquFbcz9pWfFyRzQE2wSWNNdqUQ5bdjNkQt751EWvJW)\n*Never trust Clippy.*\n\nIn fact, the city of Ushuaia, in the southernmost tip of Argentina, is known as the “city at the end of the world.” Have you ever tried to talk your grandparents in Spain into flying to Argentina. I did. I also failed. Because “think of the many times we could go to Paris in 12 hours!” Whatever.\n\nIn pop culture, Argentina is seen as such a distant, mysterious land that according to local lore, the Knights Templar came all the way here to hide the Holy Grail in some Patagonian mountain. I’m not kidding, it’s a thing! (Although Dan Brown then published The Da Vinci Code and changed the conventional wisdom forever).\n\nAnd during World War II, Argentina remained neutral (because it could) and finally decided to join team USA when the Axis powers were pretty much dead so… you know. Just something to think about.\n\nThere’s no ISIS here, no wars, no minutemen, no militias, no mass shootings, no climate change deniers, no creationists, no idiots dressed as evil clowns coming to haunt you in your sleep.\n\nSo, while I’m certainly not predicting Armageddon if The Donald wins, it is good to know that there’s a nation probably willing to offer you sanctuary at no extra cost, except for an overpriced steak in some Palermo parrilla.\n\nSo there you go. I’ve done my part. Now go vote.\n\nOtherwise that terrifying scene from Stephen King’s It that I mentioned earlier is about to get a lot more real.\n\n![Trump](https://ipfs.io/ipfs/QmZ4UBpRw2rT8TNZJhBx5tZWCb9LbPvC4Zgdk28gze3AA2)\n\n**By Adrian Bono**"
		},
		{
			"post_id": 3,
			"title": "Time to Move the Standing Rock Pipeline - nytimes.com",
			"date_published": 1478204853,
			"body": "![Niv Bavarsky](https://ipfs.io/ipfs/QmT57XN4TrLsM6D9JVyDGEZFspf48svWQW7RRfQV14Bx1Y)\n\nPresident Obama has pointed a way out of a dangerous standoff over an oil pipeline being built in North Dakota. He told an interviewer on Tuesday that the Army Corps of Engineers was looking for a new pipeline route, presumably away from the Standing Rock Sioux Reservation, whose members and allies have been protesting the project for months, saying it threatens the tribe’s sacred lands and water supply.\n---\nIt was a welcome hint of good news in an intensely bitter confrontation that came wrapped in historic injustice and seemed destined to end in grief. The $3.7 billion Dakota Access pipeline is meant to carry crude oil from the Bakken fields of western North Dakota to Illinois, 1,170 miles to the east. It would not enter tribal land but it would pass close enough for the Sioux to fear grave damage from a leak or spill. Its current proposed route runs less than half a mile north of the reservation and under the Missouri River, a source of drinking water. Though the pipeline would mostly cross private property, the tribe also argues that these have been the Sioux’s ancestral lands since antiquity, and construction would damage sites of deep cultural and historic significance, including burial grounds.\n\nA federal judge in September denied the tribe’s request for an injunction to block construction, but the tribe has continued to press the Army corps to withhold permits, which the builders need because the pipeline would cross a navigable waterway. The Sioux accuse the corps of being a rubber stamp for the oil industry, of ignoring its objections and of illegally issuing permits in violation of the Clean Water Act, the National Historic Preservation Act and other federal laws — charges that the corps denies.\n\nThe tribe’s sense of grievance is understandable, given that the pipeline was shifted in its direction, away from Bismarck, N.D., because federal regulators saw it as a potential threat to that city’s water supply.\n\nThe Dakota and Lakota of the Standing Rock tribe would hardly be the first American Indians to pay the price for white people who want to move environmental hazards out of sight, out of mind and out of their water faucets. If the federal government shifts the pipeline route again — perhaps closer to Bismarck — maybe that will prompt a full, meaningful discussion of the pipeline’s merits, with a fairer assessment of its true costs.\n\nA pipeline may well be the most profitable and efficient way to move a half-million barrels of crude oil a day across the Plains. But in a time of oil gluts and plummeting oil prices, is it worth it? Is it worth the degradation of the environment, the danger to the water, the insult to the heritage of the Sioux?\n\nThe law-enforcement response to the largely peaceful Standing Rock impasse has led to grim clashes at protest camps between hundreds of civilians and officers in riot gear. The confrontation cannot help summoning a wretched history. Not far from Standing Rock, in the Black Hills of South Dakota, sacred land was stolen from the Sioux, plundered for gold and other minerals, and then carved into four monumental presidential heads: an American shrine built from a brazen act of defacement.\n\nThe Sioux know as well as any of America’s native peoples that justice is a shifting concept, that treaties, laws and promises can wilt under the implacable pressure for mineral extraction. But without relitigating the history of the North American conquest, perhaps the protesters can achieve their aim to stop or reroute the pipeline.\n\n“We are monitoring this closely,” Mr. Obama said. “I think as a general rule, my view is that there is a way for us to accommodate sacred lands of Native Americans.” Of course there is. There has to be.\n\nBy THE EDITORIAL BOARD\n\nSource: http://www.nytimes.com/2016/11/04/opinion/time-to-move-the-standing-rock-pipeline.html"
		},
		{
			"post_id": 2,
			"title": "The History of Chatbots - Infographic",
			"date_published": 1478288434.353,
			"body": "![The History of Chatbots](https://ipfs.io/ipfs/QmZQR1UJvNoqGP5bpbuUXTit9VfEri77SWx4tzVtHYS72R)\nInfographic by Futurism.com\n---\n![The History of Chatbots](https://ipfs.io/ipfs/Qme7jZ9Jxz7vN1qS9QBgawCfL1DkFgMaKYWybWz4E3eqN3)"
		},
		{
			"post_id": 1,
			"title": "Crash testing",
			"date_published": 1433033779.604,
			"body": "![SOMEONE is learning how to take down the internet.](https://ipfs.io/ipfs/QmRcyYDxYtcye6avC3KUQP2XWvCQtMMRhEe4M1pBisUb8X)\n\nRecent attacks on the internet could be a prelude to far worse ones\n---\n\n“SOMEONE is learning how to take down the internet.” This was the headline of a blog post Bruce Schneier, a noted cyber-security expert, wrote in mid-September. It looked prescient when, on October 21st, Dynamic Network Services (Dyn), a firm that is part of the internet-address system, was disrupted by what is called a “distributed denial of service” (DDoS) attack. (Essentially, a DDoS floods servers with requests until they can no longer cope.) For hours, hundreds of sites were hard to reach, including those of Netflix, PayPal and Twitter.\n\nThe attack on Dyn was only the latest in a string of similar ones. On September 20th, for instance, the victim was Brian Krebs, an American journalist who often reports on internet criminals. The server where he hosts his blog became the target of one of the largest DDoS attacks on record (it was bombarded with data equivalent to almost half a percent of the internet’s entire capacity). Most of the other recent digital assaults, however, were more discerning—as if the attacker “were looking for the exact point of failure,” Mr Schneier wrote in his blog post.\n\nIt is not clear who the attackers are, although security analysts suspect they are either Chinese or Russian. At any rate, all the attacks used the same software, called Mirai, whose source code has been leaked online. It mainly scours the internet for devices such as webcams, digital video recorders and home routers in which easy-to-guess factory-set passwords (“12345” or even “password”) have not been changed. The program then turns those it can gain access to into a huge army of digital slaves that can be directed to inundate targets with requests. Shortly after the attack on Dyn, XiongMai Technologies, one of the biggest makers of webcam components, announced it would recall some products and provide owners of others with software updates to improve security.\n\nThis may help, but not much can be done in the short run other than to appeal to owners of internet-connected devices to change their passwords. To fix the problem properly, Mr Krebs argued in a blog post, the makers of such devices, collectively called the “internet of things” (IoT), would all have to recall vulnerable systems and change their careless approach to security. Since this is unlikely to happen, regulators may have to step in. Indeed, the European Commission is already working on legislation to require better security in IoT devices. Lawsuits against negligent device-makers would also help.\n\nAs for the goal of the attacks, it could be something other than to take down the internet. Many fret that such virtual weapons could be turned to full blast just before or on November 8th, when America will elect a new president and House of Representatives, and also many senators and state governors. A DDoS could not paralyse voting machines, for hardly any of them are connected to the internet. But striking all kinds of websites, from those of online media to the government’s, could spread chaos—and the feeling that the elections are somehow being “rigged”.\n\nSource: http://www.economist.com/news/science-and-technology/21709286-recent-attacks-internet-could-be-prelude-far-worse-ones-crash-testing?fsrc=scn/tw/te/pe/ed/crashtesting\n\nReception:\n> *Elon Musk (twitter)*: Only a matter of time before advanced AI is used to do this. Internet is particularly susceptible to a gradient descent algo.\n> *Random user (twitter)*: #elonmusk will this lead to the first AI v AI conflict?\n> *Elon Musk (twitter)*: good chance\n> *Elon Musk (twitter)*: There would def be millions of agents simultaneously doing a Monte Carlo sim & combining the results to build a map of weaknesses"
		}
	]
}