{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1564584559_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y": 1,
		"1564651346_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565218244_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1565229380_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1516098717_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1565410872_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565424353_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1565430707_16joHUdKRd7Qfjp6fjTfHkaqwkrUhj7svk": 1,
		"1565575614_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565682447_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565677132_19ouxiGbVPzjqbCeAWLx4udeggoUsfEhdV": 1
	},
	"next_comment_id": 28,
	"comment": {
		"1564584559_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y": [
			{
				"comment_id": 1,
				"body": "USE\nKaffieId is a fully decentralized Id Provider - Id Signature creation happens locally, on the computer doing the registration. Because of this, KaffieId does not ensure unique usernames.\n\n===================\n\nO KaffieId é um provedor de ID totalmente descentralizado - a criação da Assinatura de ID ocorre localmente, no computador que faz o registro. Por causa disso, o KaffieId não garante nomes de usuários exclusivos.\n\nhttp://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/",
				"added": 1564642766
			},
			{
				"comment_id": 2,
				"body": "> [blurhy](#comment_274_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Ah, not unique.\nThat's ok to be decentralized, because id is just a name binding to the public key\n\nthe name or id, i know it is not unique, because there is no way to be unique if it is decentralized unless you use the namecoin network, but i prefer it this way, which uses ALL directly within the zeronet network, i think more safe like that without relying on anything outside the zeronet network: D",
				"added": 1564645470
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "font = https://torrents.io/tracker-list/\n\n\nudp://bt.xxx-tracker.com:2710/announce\nudp://tracker.torrent.eu.org:451/announce\nhttp://torrent.nwps.ws:80/announce\nudp://tracker.ds.is:6969/announce\nudp://tracker.0o.is:6969/announce\nudp://retracker.hotplug.ru:2710/announce\nhttps://opentracker.xyz:443/announce\nhttp://open.trackerlist.xyz:80/announce\nudp://tracker.birkenwald.de:6969/announce\nudp://amigacity.xyz:6969/announce\nudp://retracker.netbynet.ru:2710/announce\nhttp://tracker.gbitt.info:80/announce\nudp://newtoncity.org:6969/announce\nhttps://tracker.nanoha.org:443/announce\nhttp://tracker.files.fm:6969/announce\nudp://opentor.org:2710/announce\nhttps://tracker.publictorrent.net:443/announce\nhttp://tracker.yoshi210.com:6969/announce\nudp://bt.reyesleon.eu:53/announce\nudp://tracker.opentrackr.org:1337/announce\nudp://retracker.lanta-net.ru:2710/announce\nhttp://tracker3.itzmx.com:6961/announce\nudp://tracker.filepit.to:6969/announce\nhttps://tracker.vectahosting.eu:2053/announce\nudp://tracker.kiwifarms.net:8000/announce\nhttp://bt1.xxxxbt.cc:6969/announce\nudp://tracker.lelux.fi:6969/announce\nudp://tracker.beeimg.com:6969/announce\nudp://zephir.monocul.us:6969/announce\nudp://retracker.baikal-telecom.net:2710/announce\nudp://explodie.org:6969/announce\nudp://retracker.akado-ural.ru:80/announce\nudp://bt.dy20188.com:80/announce\nudp://tracker.filemail.com:6969/announce\nudp://tracker.moeking.me:6969/announce\nudp://exodus.desync.com:6969/announce\nudp://tracker.nyaa.uk:6969/announce\nudp://tracker.fixr.pro:6969/announce\nudp://tracker.tiny-vps.com:6969/announce\nudp://ipv6.tracker.harry.lu:80/announce\nudp://tracker.supertracker.net:1337/announce\nudp://ipv4.tracker.harry.lu:80/announce\nhttps://tracker.fastdownload.xyz:443/announce\nhttp://t.nyaatracker.com:80/announce\nhttps://t.quic.ws:443/announce\nhttp://tracker.bt4g.com:2095/announce\nudp://tracker-udp.gbitt.info:80/announce\nudp://tracker.nibba.trade:1337/announce\nhttps://opentracker.co:443/announce\nudp://9.rarbg.com:2710/announce\nhttp://retracker.goodline.info:80/announce\nudp://opentracker.sktorrent.org:6969/announce\nudp://tracker.coppersurfer.tk:6969/announce\nudp://tracker.cyberia.is:6969/announce\nhttps://tracker6.lelux.fi:443/announce\nhttp://retracker.sevstar.net:2710/announce\nudp://tracker.openbittorrent.com:80/announce\nhttp://tracker.internetwarriors.net:1337/announce\nudp://9.rarbg.to:2710/announce\nudp://9.rarbg.me:2710/announce\nhttp://tracker1.itzmx.com:8080/announce\nudp://tracker2.itzmx.com:6961/announce\nudp://open.demonii.si:1337/announce\nudp://denis.stalker.upeer.me:6969/announce\nudp://open.stealth.si:80/announce\nhttp://tracker4.itzmx.com:2710/announce",
				"added": 1564716423
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_802_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Can you comment the source?\n\nhttps://torrents.io/tracker-list/",
				"added": 1564720897
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_804_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Okay. LOL.\n\nI thought maybe that was it, but not really expecting you to be redundant.\n\nI removed https trackers on Syncronite because ZeroNet doesn't support them.\n\ngood to know, alias did not understand this properly, how it works, alias know very little about zeronet yet.\n\nBecause the programming part I have a NOTION, but I do not know javascript for example, then I have to learn, to be able to modify things here, in zeronet: D, just bitcoin collaborate and reach at least 300 million dollars that I will be able to dedicate myself more to develop some things here.",
				"added": 1564721662
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 6,
				"body": "tradução pt-br\nO ZeroNet é governado por uma pessoa. E isso deve ser corrigido\nVárias pessoas chegaram à conclusão de que eu vou roubar os direitos dos nofish'es. Não é isso que eu quis dizer, no entanto, se é assim que todos me entendem, pode ser um problema meu, não seu.\n\nVamos lutar contra a centralização de outra maneira. Vamos escrever nossa própria implementação ZeroNet, para outras plataformas, em outro idioma. Completamente independente do que o atual ZeroNet parece. Continue algo que o mkg20001 tenha iniciado.\n\nObrigado a todos por uma discussão maravilhosa.\n\nComo todos sabem, @nofish é o autor do ZeroNet. Primeiro de tudo, deixe-me dizer que aprecio seu trabalho e o respeito.\n\nNo entanto, temos um problema - atualmente, o @nofish é o único homem que tem acesso a:\n\nZeroTalk, ZeroMe, etc., outras zites\nZeroHello\nRepositório do GitHub e ZeroUpdate\nIsso leva a alguns problemas. Vamos discuti-los um por um:\n\nPlataformas sociais\nNo ZeroNet, qualquer site que suporte conteúdo de usuário não pode realmente viver sem qualquer interação de seu proprietário. O ZeroTalk depende do nofish para aumentar o limite de tamanho de dados do usuário. O ZeroMe depende do nofish por causa da lista de hubs. Escusado será dizer que, se nofish nos deixar, ficaríamos presos aos sites atuais sem mais atualizações.\n\nZeroHello\nA página inicial do ZeroNet é a página que recebe qualquer usuário. No entanto, ele pode fazer um pouco mais do que apenas dar as boas-vindas a alguém - ele recebe os chamados direitos \"ADMIN\". Isto significa que, se nofish é hackeado (o que não seria uma surpresa para ser honesto), o código ZeroHello pode ser alterado para destruir toda a rede. O que é ainda mais assustador é que as mudanças se espalham imediatamente sobre o ZeroNet, destruindo tudo em poucos minutos.\n\nRepositório do GitHub e ZeroUpdate\nEsses dois lugares são os lugares onde o ZeroNet hospeda seu código-fonte, e é isso que ele usa para atualizar. Nós temos dois problemas aqui de uma vez:\n\nEnvenenamento por código. Já discutimos isso, então vou pular essa parte\nAtualizar parada. Isso pode ser ainda mais perigoso a longo prazo\nO ZeroNet visa a descentralização. Todos os seus sites são descentralizados, portanto, não há um único ponto de falha dentro da rede. Dentro da rede. Dentro. Mas ainda há centralização fora do ZeroNet. E é nofish.\n\nCaso o nofish entre em apuros, o desenvolvimento do ZeroNet irá parar. A maioria dos usuários recebe atualizações do ZeroUpdate ou do GitHub. No entanto, se os repositórios pararem de ser atualizados, não haverá maneira de sincronizar o código entre os pares.\n\nVocê pode dizer: apenas bifurque a rede! Crie sua própria SuperNet! Sim. SuperNet. Não é o ZeroNet. Nem todo mundo vai mudar para o meu garfo. Ou seu garfo. Ou algum outro garfo. O ZeroNet será dividido em partes pequenas que não podem se comunicar entre si: alguns garfos se tornariam desatualizados, outros deixariam de ser suportados. A incrível comunidade ZeroNet seria destruída. Em um único segundo.\n\nExiste alguma solução?\n\nUma maneira possível de corrigir isso é ajudar o nofish a trabalhar no projeto. Ter um único dono é ruim. Ter vários proprietários é um pouco melhor, mas é melhor que nada.\n\nO abaixo é apenas uma das possíveis soluções. Vários usuários derrubaram isso. Assim, é apenas aqui para fins históricos. Estamos em andamento para fazer uma solução melhor, no entanto, algumas partes ainda podem ser válidas.\n\nVeja o que deve ser feito para implementar isso agora:\n\n(opcionalmente) Crie uma organização no GitHub - isso ajudará a se comunicar sobre o projeto e trabalhar em plugins\nAdicione outros usuários como colaboradores ao repositório do GitHub\nDar chaves privadas de ZeroHello, ZeroUpdate, ZeroMe, ZeroTalk e provavelmente alguns outros sites para os usuários mais confiáveis\nJuntos, podemos fazer uma solução melhor fazendo o seguinte:\n\nConfigurando o repositório do GitHub com cuidado:\nPoderíamos permitir mesclar solicitações de pull se houver pelo menos 3 de 5 aceitações (no caso de 4 pessoas participarem, é claro)\nNão permitindo alterações no py3 ou master sem solicitações pull - este será outro wall de segurança para evitar a incorporação de códigos maliciosos\nUma maneira de alterar a lista de membros se a rede votar para alterá-la\nIsso pode ser feito com permissões de proprietário para alguns dos usuários confiáveis\nMelhorar o suporte a vários passos\nSe os membros decidirem que algo deve ser mudado e chegarem a um consenso, as zites devem ser atualizadas\nSe o consenso não for alcançado, nenhuma mudança deve ser feita\nFinalmente, temos que discutir que grupo de pessoas deveria realmente ter o direito de governar a rede. Aqui está a melhor solução que pude encontrar:\n\nnofish é incluído automaticamente\nVocê pode votar em qualquer usuário (incluindo você mesmo) postando um comentário abaixo. Por favor, explique por que você vota em alguém (ou porque você se promove) para que possamos ter certeza de que você não é um bot, e que entendemos se a pessoa mencionada é um desenvolvedor principal, se eles podem desenvolver plugins para ZeroNet, zites, ou se eles são bons em teoria, ou se podem trazer boas ideias, etc.\nSe você apoia alguém, você pode postar seu próprio comentário ou apenas votar em outra pessoa (se a pessoa A promove a pessoa B e você concorda com esse comentário, isso é um voto para B, não para A)\nVocê pode",
				"added": 1564738692
			},
			{
				"comment_id": 7,
				"body": "my placing ANY limit on what the site owner does is a mistake, as this will give the site a chance to get attacked.\n\nThe zeronet sites are GREAT the way they are.\n\nOne thing I would change about zeronet and websites would be.\n\nAdd support for at least 3 login system.\n\nZeroID (Centralized Identification) http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/\n\nKaffieID (Decentralized Identification) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nKxoId (semi-decentralized identification) http://127.0.0.1:43110/kxonet.bit/?/kxoid\n\nThis to me is something that should be standard, ALL sites are supported by default in cloning, of course the owner can remove and do whatever he wants on his site.\n\nAnother thing I agree with is that, yes it is dangerous is centralization of the initial page of zeronet.\n\nAnd they should come up with a more flexible template that each one could put in their copy the sites they wanted on the homepage by default and redistribute.\n\nI think it would be interesting to do this.\n\nAnd in the case of development I think we should ALWAYS focus on developing ALL within the zeronet network itself.\n\nUsing and or creating new functionality, I think we should ALWAYS have at least 3 zeronet source code backup sites from different owners and ALWAYS all sites come with the default cloning option.\n\nAnd kind of could develop something to make it easier to create hubs or things that help generate more decentralization, but ALWAYS in a simplified way that even a donkey like me can use.\n\nThanks for the work of ALL, this network is amazing, and it's changing the world.\n\n\n\n==================================\ntexto em pt-br\n\nmeu colocar QUALQUER limite, no que o DONO do site, faça, é um erro, pois isto dará chance do site ser atacado.\n\nOs sites da zeronet , são ÓTIMOS do jeito que são.\n\nUma coisa que eu mudaria na zeronet e nos sites seria.\n\nAdicionar suporte a pelo menos 3 sistema de logins.\n\nZeroID (identificação centralizada) http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/\n\nKaffieID(identificação descentralizada) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nKxoId(identificação semi-descentralizada) http://127.0.0.1:43110/kxonet.bit/?/kxoid\n\nIsto para mim é algo que deveria ser padrão, TODOS os sites , terem suporte por padrão na clonagem, claro podendo o dono remover e fazer o que quiser no site dele.\n\nOutra coisa que concordo é que , é perigosa sim está centralização da pagina inicial da zeronet.\n\nE deveriam bolar um modelo , mais flexivel, que cada um pudesse colocar na sua cópia os sites que quisesse na pagina inicial por padrão e redistribuir.\n\nAcho que seria interessante fazer isto.\n\nE no caso do desenvolvimento acredito que deveriamos , SEMPRE focar em desenvolver TUDO , dentro da própria rede zeronet.\n\nUsando e ou criando funcionalidades novas, tipo acho que deveriamos SEMPRE ter no minimo 3 sites de backup do código fonte da zeronet,  de donos diferentes e SEMPRE todos os sites, virem com a opção padrão de clonagem.\n\nE tipo poderiam desenvolver algo para facilitar a criação de hubs ou coisas que ajudem a gerar mais descentralização , mas SEMPRE de forma simplificada, que até mesmo um burro como eu consiga usar.\n\nObrigado pelo trabalho de TODOS, está rede é incrivel, e está mudando o mundo.",
				"added": 1564739325
			},
			{
				"comment_id": 8,
				"body": "> [sergery](#comment_1_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC): Zerome,Zerotalk,and none of the other zites' centralisation is a problem in my opinion.When something happens,anyone can still create their own.The real problem is Zerohello for sure.When something happens to it,the whole Zeronet can be fckd up.Not completely destroyed,but would be much harder to use.The only solution for that is to hard code it into the source,so it cannot be changed by anyone remotely.Or not even zerohello,but a simplified version of it where you can reach your downloaded zites,etc.\n\nExactly, I complement by saying that it would be an ABSURD ERROR, put, ANY mechanism by default would take away the power of the SITE OWNER.\n\nDon't put it, for God's sake, don't put it by default.\n\nFor this would surely be used against the network.\n\nOther than that this is not a problem as you just copy the site or clone it.\n\nThe only thing I agree with is that the homepage should be more flexible so that everyone can implement, modify and distribute it as they wish, this would solve the problem.\n\n\n======================================================\ntexto em pt-br\n\nexato,  eu complemento dizendo que seria UM ERRO ABSURDO, colocar , QUALQUER mecanismo, por padrão , tirasse o poder do DONO DO SITE.\n\nNão coloquem isto , pelo amor de deus, não coloquem isto por padrão.\n\nPois isto com toda certeza seria usado contra a rede.\n\nFora que ISTO não é um problema, pois basta copiar o site ou clonar o mesmo.\n\nA unica coisa que concordo é que a página inicial, deveria ser mais flexivel, para cada um poder implementar , modificar ela e distribuir como quisesse, isto acho que resolveria o problema.",
				"added": 1564739528
			},
			{
				"comment_id": 9,
				"body": "But simply put, what zeronet, has to focus on is just giving the network individuals more decentralization and power.\n\nIt's like focusing on not having even a center point in it.\n\nAlways clear giving anyone the option to use something \"centralized\" in it, such as zeroid for example.\n\nI think it's a mistake that it is the default login system as well, and I think they should focus mainly on increasing standard support for decentralized login / name systems like KaffieID (decentralized identification) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz /\n\nApart from the zeronet homepage, which would allow each copy of zeronet to have its homepage modified as desired, other than http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/, and can easily put another lay and ready, for me would be perfect zeronet.\n\nBecause basically everything about it is the user and owner of the site you choose.\n\n\n===========================\ntexto em PT-BR\n\nmas simplificando , o que a zeronet, TEM que focar é só em dar mais descentralização e poder aos individuos da rede.\n\nE tipo focar em não ter NEM UM PONTO central na mesma.\n\nSempre claro dando a opção a quem quiser, usar algo \"centralizado\" nela, como o zeroid por exemplo.\n\nEu acho um erro ele ser o sistema de login padrão bem dizer, e acho que deveriam focar principalmente em aumentar o suporte padrão a sistemas de logins/nomes descentralizados como o KaffieID(identificação descentralizada) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nTirando a página inicial da zeronet, que bastaria permitir que cada cópia da zeronet, possa ter sua página inicial modificado, como quisesse, sem ser a http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/ , podendo colocar outra de maneira facil para um leigo e pronto, para mim estaria perfeita a zeronet.\n\nPois basicamente tudo nela é o usuário e dono do site que escolhe.",
				"added": 1564740238
			},
			{
				"comment_id": 10,
				"body": "I saw here and there talking about using namecoin and system id, centralized login or almost that.\n\nGuys in my opinion the way is zeronet, only with the public key of the site owner, since good, that being able to use namecoin is just a cool bonus, but I do not give a damn.\n\nThe most important for me would be to try to help increase standard support for sites with decentralized id system support like\nKaffieID (Decentralized Identification) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nor http://127.0.0.1:43110/cryptoid.bit/, which I believe to be decentralized as well.\n\nThis for me is making the zeronet homepage http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/ more flexible and can modify the websites shown by default on the homepage.\n\nI think you just need to change this, there is of course also be able to change there the site we use to upgrade to zeronet, in case it would just basically make it all interchangeable if the user wanted to.\n\nnofish THANK YOU for your work, zeronet, is and will change the world.\n\n==============================\ntexto em PT-BR\n\nvi aqui um e outro falando de usar namecoin e sistema id, login centralizado ou quase isto.\n\nGente na minha opinião o modo como é a zeronet, somente com a chave publica do dono do site, já mais que bom, isto de poder usar o namecoin é só um bonus legal, mas eu nem dou bola.\n\nO mais importante para mim seria tentar ajudar no aumento de suporte padrão de sites com suporte a sistema de id DESCENTRALIZADOS como o  do \nKaffieID(identificação descentralizada) http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nou o http://127.0.0.1:43110/cryptoid.bit/ , que acredito ser descentralizado também.\n\nIsto para mim e deixar mais flexivel a página inicial da zeronet http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/ , podendo modificar os site mostrado por padrão na página inicial.\n\nAcho que só precisa mudar isto, há e claro, também poder mudar ali o site que usamos para atualizar a zeronet, no caso, seria só basicamente deixar tudo isto trocavel, caso o usuário queria.\n\nnofish MUITO OBRIGADO pelo teu trabalho, a zeronet, está e vai mudar o mundo .",
				"added": 1564741117
			},
			{
				"comment_id": 11,
				"body": "> [filips](#comment_114_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): thecollector: \n\n\n\nthecollector is on drugs, can only uahehuaae, as someone will charge for something that is made NOBODY CONTROLLING FUCK.\n\nThere are people who can only be either retarded or drugged, it is not possible, the guy, did not understand, that this is a decentralized network, it is made not to have to be stopped, to have no way to cover for its use, the most you will be able to charge at some point, this when you add the function of private sites, is for someone to access your site, other than that you can not prevent it, other than putting a password in a file and etc, but basically there is not.",
				"added": 1564946849
			},
			{
				"comment_id": 12,
				"body": "> [thecollector](#comment_3_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi): wow thanks buddy... i clearly said im not a coder!!!\n\nwhat you said in NOTHING has to do with programming, but that the meaning of a decentralized network is to have NO ATTACK, does not make any sense, because you do not even know the meaning of the word decentralized.\n\nBut that's ok, nobody is born knowing, it happens, I think it's funny, because what you said is NOT possible to do in a decentralized network, because the principle of it is that NO ONE controls her and everyone controls her.\n\nType in the specific case of zeronet, each node sends directly and its site, in the case in the site that the person create and this is it.\n\nThe only \"flaw\" would be to have a fixed homepage yet, which probably nofish is already working on making it flexible, because I believe that just letting it flexible, for EVERY copy, can have your homepage and ready.\n\nBasically the important thing is EVERYTHING at zeronet, to be DECENTRALIZED, in which case each site has its owner and only IT can delete everything from the site it created, including our posts, so it is best to have a direct copy of things, like cloning. the site and then using it, thus having FULL control over our content on zeronet and only being able to remove it if we want to.\n\n==================\noriginal em PT-BR\n\no que tu falou em NADA tem haver com saber programação, e sim que o significado de rede descentralizada é NÃO TER COMO SER ATACADA , não faz o menor sentido, pois tu não sabe nem o sentido da palavra DESCENTRALIZADA.\n\nMas tudo bem, ninguém nasce sabendo, acontece , eu acho engraçado isto, pois o que senhor falou NÃO É POSSIVEL fazer em uma rede descentralizada, pois o principio da mesma é que NINGUÉM controla ela e todos controlam ela.\n\nTipo no caso especifico da zeronet, cada nó manda diretamente e seu site, no caso no site que a pessoa CRIAR e é isto.\n\nA unica \"falha\" seria ter uma página inicial fixa ainda, que provavelmente o nofish já está trabalhando em flexibilizar a mesma, pois acredito que seja só deixar ela flexivel, para CADA cópia, poder ter sua página inicial e pronto.\n\nBasicamente o importante é TUDO na zeronet, ser DESCENTRALIZADO, no caso cada site tem seu dono e somente ELE pode deletar tudo do site que ele criou, inclusive nossas postagens, por isto o mais adequado é nós termos uma cópia direta das coisas, tipo clonando o site e depois usando ele , assim, tendo controle TOTAL sobre nosso conteudo na zeronet e só sendo possivel remover caso NÓS mesmos queiramos.",
				"added": 1564977014
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 13,
				"body": "son say what you want here, no one will or can't stop you from talking here, BUT they can ban you from sites other than Yours or people can mutate you so they wouldn't see your posts.\n\nBut other than that, you can clone some site and own the site and talk and do whatever you want on it.\n\nWelcome to the place where we have real freedom.\n\nBut remember, even freedom comes at a cost, which is YOUR keeping your content, the only way to have no censorship.\n\nFor as YOU control, no one can take it down.\n\n======================\n\noriginal PT-BR\nfilho fale o que quiser aqui, ninguém vai ou pode lhe impedir de falar aqui, MAS podem te banir dos sites que NÃO FOREM TEU ou o pessoal pode te mutar, assim sendo eles não veriam as tuas postagens.\n\nMas fora isto, tu pode clonar algum site e ser DONO DO SITE e falar e fazer o que quiser NELE.\n\nSeja bem vindo ao lugar onde  temos real liberdade.\n\nMas lembre-se até mesmo a liberdade tem um custo, que é TU manter o teu conteudo, unica maneira de não ter censura.\n\nPois como TU controla, ninguem pode tirar do ar.\n\n\nMute a Zeronet user to mask unwanted uploads 静音用户 , guide\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2\n\nHow to mute/hide zeronet user's posts/content from all zeronet sites\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1516322022_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
				"added": 1565251695
			},
			{
				"comment_id": 14,
				"body": "> [kaffie](#comment_883_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Being hateful does not mean you are free. Be careful not to fall into controlled opposition narratives. Hate, by it's nature, provides an inequality which combats true free speech. Yes, you can say hateful things by having free speech, but in practice you'd learn why hating people (especially in line with official narratives) is a poor choice. [...]\n\nI think he can say whatever he wants, the problem HERE is not clearnet and here I deny retaliating in kind, possibly.\n\nSo, I advise, ALWAYS try to be polite, because I think that's the best thing to do, because I believe NO ONE likes to be treated badly or something, but that's that, if he believes this or that is bad, There is no way he can say it other than saying he doesn't like or hate it.\n\nAnd in case this site in question must have an owner, I think it is nofish, so if the same does not like it can ban it.\n\nWhich would take away his freedom to talk HERE on this site, but then just clone this site and hey, he would have TOTAL freedom to speak the nonsense he wants, but it's always good to remember, what is silly to us, can be something serious for others.\n\nFor example, I don't see proof of the existence of God, but I don't care if the person believes and even likes to talk about it, to see other people's views and what evidence they have of their existence.\n\nSimply put, I find zeronet very good for the very high freedom we have here, but remembering that I at least support TALKING ANYTHING, NOT DOING.\n\nAnd if he wants to follow examples with the murderers, who attacked in el paso texas or the mosque there that the other killer killed PACIFIC Muslims, because we can't confuse the terrorists with peasants.\n\n\n==============================\n\noriginal PT-BR\n\neu acho que ele pode dizer o que quiser, o problema que AQUI não é a clearnet e aqui nego retaliar na mesma moeda ele, possivelmente.\n\nEntão, eu aconselho , SEMPRE a pessoa tentar ser educada, pois acho que é a melhor coisa a fazer , pois acredito que NINGUÉM goste de ser mau tratado ou  coisa do tipo, mas é aquilo, se ele acredito que isto ou aquilo é ruim, não vai ter como ele dizer de outra forma a não ser dizendo que não gosta ou odeia.\n\nE no caso este site em questão deve ter um dono, acho que é  o nofish , então , CASO o mesmo não goste ele pode banir ele.\n\nO que tiraria a liberdade dele falar AQUI, neste site, mas dai bastaria ele clonar este site e pronto, ele teria TOTAL liberdade de falar a bobagem que ele quiser , mas é bom sempre lembrar, que o que é bobagem para nós, pode ser algo sério para outros.\n\nEu por exemplo, não vejo provas da existencia de deus, mas não me importo se a pessoa acredita e gosto até de conversar sobre, para ver a visão de outras pessoas e quais provas ela tem da existencia do mesmo.\n\nSimplificando , acho muito bom a zeronet pela altissima liberdade que temos aqui, mas  lembrando que EU pelo menos apoio FALAR qualquer coisa, e NÃO FAZER.\n\nE se ele quiser seguir exemplos com os assassinos , que atacaram em el paso texas ou a mesquita lá que o, outro assassino, matou mulçumanos PACIFICOS, pois  não podemos confundir , os terroristas, com gente paficifica.",
				"added": 1565252705
			},
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_885_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just keep in mind that the biggest threat to free speech is propaganda preying on the ignorant. Free speech alone can lead to problems. It needs to be supplemented by a good unbiased education.\n\nFreedom of speech is freedom of speech, if we want to dictate what we can and can't say, it's a problem, because EVERY person thinks certain things are good and others bad, WE CAN'T LIMIT people.\n\nUnfortunately it is life, every time we talk to someone we have to try to be polite, but we can never guarantee that we will not offend someone with something we talk about, because what offends me may not offend you.\n\nSo it is a danger to want to dictate what is right to say or not.\n\nI assume that we can say EVERYTHING, we just CAN'T DO EVERYTHING, because as soon as I try to hurt someone PHYSICALLY mainly, there will be a reaction, alias we can have a reaction from someone even talking, so it's ALWAYS GOOD, we have in mind that not everyone reacts the same way to what we say.\n\nBut like HERE, let's just talk or write, there will be no physical contact with you and anyone who is offended may very well block the person.\n\nI believe the wisest thing is to cherish total freedom of speech / thought.\n\nBut with one detail, if ANYONE disagrees with this, the MAXIMUM this one can do here is block me on his page and or mutate me.\n\nThis to me is the best part of zeronet, no one is obliged here to see what you don't want.\n\n\n======================================\nORIGINAL PT-BR\n\nliberdade de expressão é liberdade de expressão, se nós quisermos ditar o que pode ou não falar, é um problema, pois CADA pessoa acha certas coisas boas e outras ruins, NÃO PODEMOS LIMITAR as pessoas.\n\nInfelizmente é a vida, toda vez que formos falar com alguém temos que tentar ser educados, mas não temos nunca como garantir que não vamos ofender alguém com algo que falamos, pois o que me ofende, pode não te ofender.\n\nPor isto é um perigo, querer ditar o que é certo falar ou não.\n\nEu parto do principio que podemos falar TUDO, só não podemos É FAZER TUDO, pois assim que eu tentar ferir alguém FISICAMENTE principalmente , vai ter reação, alias podemos ter uma reação de alguém até mesmo por falar, então é SEMPRE BOM, termos em mente que nem todos reagem do mesmo jeito ao que falamos.\n\nMas como AQUI, só vamos falar ou escrever, não terá contato fisico em si com alguém e quem se ofender pode muito bem bloquear a pessoa.\n\nAcredito que o mais sensato é  prezarmos por liberdade total de fala/pensamento.\n\nMas com um detalhe, caso QUALQUER um discorde disto, o MÁXIMO, que este alguém pode fazer aqui, é me bloquear na página dele e ou me mutar.\n\nIsto para mim é a melhor parte da zeronet, ninguém é obrigado aqui a ficar vendo o que NÃO QUER.",
				"added": 1565254419
			},
			{
				"comment_id": 17,
				"body": "> [bigbadbob](#comment_62_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): free speech is the right to say anything yes,   It also means others can say anything they want.  Some people talk shit looking for a fight,  and sometimes they find it.  Its all good.\n\nexactly.\nAnd here is not going to be the daddy state to protect him, except that here is the law is as follows, the site owner is the SUPREME being, each site has its supreme being, which is the owner, HE DECIDES if you can talk, post, send stuff and etc.\n\nAnd to solve this, just creating your own place, zeronet is very good for this, just clone the site in question and you're done.\n\n============================\noriginal em PT-BR\n\nexatamente.\nE aqui não vai ter o papai estado para proteger ele, fora que aqui é a lei é a seguinte, o dono do site é o ser SUPREMO , cada site tem seu ser supremo, que é o dono , ELE DECIDE se você pode falar, postar, enviar coisas e etc\n\nE para resolver isto , só criando o teu próprio lugar , zeronet é muito bom por isto, pois é só clonar o site em questão e pronto.",
				"added": 1565254700
			},
			{
				"comment_id": 18,
				"body": "> [theosis](#comment_20_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Assuming emotion behind someone's words is an ad hominem.\n\nThis varies from person to person, so it is complicated to say that X is right to speak and Y is not right.\n\nBecause there are people who are offended if the person questions or states that the holocaust did not exist, as it had in another topic.\n\nI basically find it a lack of respect, based on what I know, that millions of people died in both concentration camps and war, but I wonder why the citizen in question says this, because for some reason he must find this .\n\nI find it hard that this didn't really happen, but I'm ALWAYS open to chatting about EVERYTHING.\n\n==================================\noriginal PT-BR\nisso varia de pessoa para pessoa, por isso é complicado dizer que X é certo falar e Y não é certo.\n\nPois tem gente que se ofende, se a pessoa questionar ou afirmar que o holocausto não existiu, como teve em outro tópico.\n\nEu basicamente acho uma falta de respeito, baseado no que sei, que é que milhões de pessoas morreram tanto em campos de concentração , quanto na guerra , mas gostaria de saber porque o cidadão em questão diz isto, pois por algum motivo ele deve achar isto.\n\nEu acho dificil isto não ter acontecido realmente, mas eu SEMPRE estou aberto a conversar SOBRE TUDO.",
				"added": 1565254988
			},
			{
				"comment_id": 19,
				"body": "> [anonkraut](#comment_8_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh): Communism owes me 20 years of my life because I've been there (unlike most of the  people glorifying it nowadays).\n\nIn my country, Brazil the people are very communist, socialist, I think this is basically for the lack of information of the people.\n\nThe information I have is that communism / socialism is as cruel and deadly as Nazism.\n\nI do not like either, I would say that I am quite libertarian or anarcocapitalist today, but unfortunately still living in a world where people believe that the STATE gives them something.\n\nAll the state does is steal from them via taxes and return a small portion of services, when it returns.\n\n===========================\noriginal PT-BR\nno meu pais, brasil o povo é bastante comunista, socialista  , eu acho que isto é basicamente pela falta de informação das pessoas.\n\nAs informações que tenho é que o comunismo/socialismo, é tão cruel e mortifero, quanto o nazismo.\n\nNão gosto de nem um dos dois, eu diria que eu sou hoje bastante libertário ou anarcocapitalista, mas que infelizmente ainda vive em um mundo onde as pessoas acreditam que o ESTADO, DÁ alguma coisa a elas.\n\nSendo que TUDO que o estado faz é ROUBAR delas via impostos e devolver uma pequena parte em serviços, isto quando devolve.",
				"added": 1565255291
			},
			{
				"comment_id": 21,
				"body": "> [kaffie](#comment_887_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Genuine offense is almost always caused by poor education of the offending party, and their disrespect of others. Though \"being offended\" in recent years has become a way of shutting down conversation. This includes calling things \"hate speech\".\n\n\"This includes calling things \"hate speech\"  :/\nYes :/",
				"added": 1565255778
			},
			{
				"comment_id": 22,
				"body": "> [kaffie](#comment_887_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Could you give a brief overview of how things work in brazil? Is there private ownership of businesses? Do you use centrally managed currency? Is there an emphasis on oil or renewable energies? do you use cars/roads or electric transportation/rails? How are institutes of knowledge and information infrastructure set up? I'm very curious. Something tells me it's just capitalism with wealth redistribution, like most western countries.\n\n\n\n\nHere basically the state controlled everything, and we had a communist / socialist government for about 16 years with the PT mainly.\n\nKind in the previous government were no longer respecting private property and basically wanted to implement the SAME kind of china and cuba government here.\n\nNow in the current government with Jair Bolsonaro, the government has begun to respect private property a little more, but the state remains heavily contaminated with communist in various positions and sectors placed by the previous government and hence we are basically cleaning up the country.\n\nTrying to privatize and diminish the state, tax burden and so on.\n\nBut I doubt that the state will do what I think is right, which is REALLY, to allow anyone to provide transportation, energy and so on.\n\nLike, it's less worse than a year ago, as we're getting closer to the US model of government, which is not a wonder, but it's less worse than Cuba, China, Russia, and North Korea's style of government. where the citizen has no freedom.\n\nThere is about income distribution, yes, there is the so-called family scholarship here, which is money that the state gives to poor families with children studying as far as they can remember.\n\nThat alias had plenty of fraud in the past government.\n\nalias the government of the PT = workers' party, same name as the hitler's party, which to me demonstrates that the Nazis would be leftist and not rightist as scholars and specialists insist on saying, because just like Nazism (pt), the The workers' party here from my country wanted the same thing as the Nazis, they even hated the Jews.\n\nOf course a little disguise is a matter of hatred towards the Jews, but clearly you see they say that Israel was bad and blablabla.\n\nBasically Lula's previous government spent and stole trillions of the people, to distribute 1% to the people and the rest to his friendly communist countries and of course for their own benefit.\n\n====================================\noriginal PT-BR\n\nAqui basicamente o estado controlava tudo , e tivemos um governo comunista/socialista por  uns 16 anos com o PT principalmente.\n\nTipo no governo anterior não estavam mais respeitando propriedade privada e basicamente queriam implementar o MESMO tipo de governo da china e cuba aqui.\n\nAgora no atual governo com Jair Bolsonaro, o governo começou a respeitar um pouco mais as propriedades privadas, mas o estado continua muito contaminado com comunista em vários cargos e setores, colocados pelo governo anterior e dai estamos basicamente limpando o pais.\n\nTentando privatizar e diminuir o estado, carga tributária e etc.\n\nMas duvido que o estado , vai fazer o que eu acho certo, que é REALMENTE, permitir qualquer um prestar o serviço de transporte, energia e etc.\n\nTipo, está menos pior do que 1 ano atrás, pois estamos nos aproximando do modelo dos EUA de governo, o que não é nem uma maravilha, mas é menos pior do que o estilo de governo de cuba, china , russia e coreia do norte, onde o cidadão não tem liberdade.\n\nHá e sobre distribuição de renda, tem sim, tem o chamado bolsa familia aqui, que é um dinheiro que o estado dá a familias pobres com filhos estudando até onde lembre.\n\nQue alias tinha bastante fraudes no governo passado.\n\nalias o governo do PT = partido dos trabalhadores , mesmo nome do partido do hitler, o que para mim demonstra que os nazista seriam de esquerda e não de direita como estudiosos e especialistas insistem em dizer, pois assim como o nazismo (pt) , o partido dos trabalhadores daqui do meu pais , queria a mesma coisa dos nazistas, até mesmo odiavam os judeus.\n\nClaro disfarçam um pouco está questão do odeio para com os judeus, mas claramente tu via eles dizem que israel era ruim e blablabla.\n\nBasicamente o governo anterior de Lula, gastou e roubou trilhões do povo , para distruibir 1% ao povo e o resto aos paises comunistas amigos dele e claro para beneficio próprio deles.",
				"added": 1565256614
			},
			{
				"comment_id": 23,
				"body": "> [kaffie] \nWhat you said is what I understood what the US based on youtubers would be like.\n\nThat basically either you have money or you're fucked, because NOTHING is free there.\n\nBut then the problem comes in, do you think that's OK, stealing from you to give to someone else?\n\nI don't think, I think IF you think there's anyone in need of help, YOU as you seem to be worried, should help and not the state.\n\nOr in case you basically want the state to steal someone, because YOU want to help other people, NOBODY stops you or anyone else from helping people.\n\nI find my system of government less worse, because I think anarcocapitalism or libertarianism is better for this, because NO ONE should be stolen via taxes to help anyone.\n\n=======================\noriginal PT-BR\n\no que tu falou é o que eu entendi como seria os EUA baseado em youtubers que vi falarem.\n\nQue basicamente  ou tu tem dinheiro ou tu está fudido, pois NADA é de graça ai.\n\nMas ai entra o problema, tu acha CERTO, te roubarem para dar a outra pessoa ?\n\nEu não acho, eu acho que SE tu acha que tem alguém precisando de ajuda, TU como parece estar preocupada, deveria ajudar e não o estado.\n\nOu no caso tu basicamente quer que o estado roube alguém , porque TU quer ajudar as outras pessoas, sendo que NINGUÉM impede você ou qualquer outro de ajudar as pessoas.\n\nEu acho meu sistema de governo menos pior, pois acho que o anarcocapitalismo ou libertarianismo, é melhor por isto, pois NINGUÉM deve ser roubado via impostos, para ajudar ninguém.",
				"added": 1565261272
			},
			{
				"comment_id": 24,
				"body": "> [kaffie]\n\nIt is wrong for the STATE / GOVERNMENT to steal others via taxes to help you, because by what right do you think you need more than the other one who works or not, because the state steals from people via taxes with the excuse of HELPING people like you, but when you go buy something, you pay taxes too.\n\nIt makes no sense to think that the state solves problems, the state is the problem.\n\nAnd I don't think it's on the side of the elite, because I think the decentralization that I support is the opposite that the elite wants, which in this case is the centralization of power, the elite wants, which is only achieved by following your logic, that in order to help you with benefits, the state needs more power, they need to use the force of coercion to withdraw money from other people who worked, voluntarily exchange services with others, and the state gets in between money to give you help.\n\nI don't think it's fair that I get robbed to help someone, and the state steals ALL kkkk, like it doesn't make any sense.\n\n==================================\noriginal PT-BR\né errado o ESTADO/GOVERNO roubar os outros via impostos para te ajudar, pois com qual direito tu acha que precisa mais que o outro que trabalha ou não, pois o estado rouba das pessoas via impostos com a desculpa de AJUDAR pessoas como tu, mas quando tu vai comprar algo , tu também paga impostos.\n\nNão faz o menor sentido, achar que o ESTADO resolve problemas, O ESTADO É O PROBLEMA.\n\nE eu não acho que esteja do lado da elite, pois eu acho que a  DESCENTRALIZAÇÃO que apoio, é o contrário que a elite quer, que no caso é a centralização de poder, que a elite quer, o que só é conseguido seguindo a tua lógica, que para poder te ajudar com beneficios, o estado precisa de mais poder, eles precisam usar a força da coerção para retirar dinheiro de outras pessoas que trabalharam , trocam serviços de forma voluntária com outras pessoas e o estado entra no meio ROUBANDO parte deste dinheiro para lhe dar em forma de ajuda.\n\neu não acho justo, eu ser roubado para ajudar alguém , sendo que o estado rouba TODOS kkkk, tipo não faz o menor sentido.",
				"added": 1565266616
			},
			{
				"comment_id": 25,
				"body": "> [kaffie](#comment_897_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): You're still operating within the imperialist framework. [...]\n\n\"You are still operating within the imperialist structure.\"\n\nI am wanting to live in PEACE, with no one robbing me to have to be supporting others and I defending the imperialist structure?\n\nSince I argue for something completely contrary to this, which is free trade and non-coercion, YOU who are advocating stealing from me to give you money makes no sense what you said.\n\nIt's simple thing, I don't want to give my money to anyone, simple.\n\nI want to live in peace, doing voluntary exchanges with anyone I want.\n\nYour method of government, which is an imperialist structure, for to SUSTAIN YOU without you working, someone will have to be robbed for this to happen.\n\n===================================================\noriginal PT-BR\n\"Você ainda está operando dentro da estrutura imperialista.\"\n\nEu sou quero viver em PAZ , sem ninguém me roubando para ter que ficar sustentando os outros e EU que defendo a estrutura imperialista ?\n\nSendo que defendo algo completamente contrário a isto, que é o livre comercio e a não coerção, TU que está defendendo me roubarem para te darem dinheiro, não faz o menor sentido o que tu disse.\n\nÉ simples a coisa, EU NÃO QUERO DAR MEU DINHEIRO para ninguém, simples.\n\nQuero viver em paz, fazendo trocas voluntárias com quem eu quiser.\n\nO teu metodo de governo, que é uma estrutura imperialista, pois para TE SUSTENTAR, sem tu trabalhar , alguém vai ter que ser roubado para isto acontecer.",
				"added": 1565268164
			}
		],
		"1516098717_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 15,
				"body": "thank you",
				"added": 1565253498
			}
		],
		"1516322022_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 20,
				"body": "thank you",
				"added": 1565255384
			}
		],
		"1565525838_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 26,
				"body": "torrent (piratebay) http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1565529103
			}
		],
		"1565682447_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 27,
				"body": "> [nickwa](#comment_349_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I am about to go to sleep, so if there is no peers, thats why. It says 13 peers now, but not sure if that will hold up.\n\nI'll be one more peer my friend, because I want people to add support to decentralized systems like KaffieID, THANK YOU for the work.\n\n===================\noriginal PT-BR\n\nvou ser mais um peer meu amigo, pois quero que o povo adicione suporte aos sistemas descentralizados como o KaffieID , OBRIGADO pelo trabalho.",
				"added": 1565688374
			}
		]
	},
	"comment_vote": {
		"855_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"271_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"274_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"858_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"853_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"805_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"409_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1276_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"859_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"814_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"114_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"866_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"433_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"885_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"62_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"887_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"22_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"889_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"17_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"896_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"897_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"266_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"947_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"90_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"349_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"2_1N11NsibgNVZrsTpnsSbhb65jxQme4wmET": 1
	}
}