{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "what if the world is an illusion?",
			"body": "what do you think if this world is only to contain a super-intelligent AI : you, me the world is a big AI.\n\nhow we can unite and see the true world (the world of our creators) ?\n\nbased on :\n\nmy dreams:\nin some of my dreams I see live colors, more true than in this world\n\nmovies: \nmatrix, thirteen floor, the machine \n\nscience: \nhttps://www.youtube.com/watch?v=cvMlUepVgbA\nhttps://en.wikipedia.org/wiki/Brain_in_a_vat\nhttp://www.futura-sciences.com/magazines/matiere/infos/actu/d/physique-effet-casimir-dynamique-on-cree-lumiere-partir-vide-34780/ (we can create photon with the void)\nthe fact that we haven't find the ultimate \"solid\" particle (after quarks, ....) , maybe we will only find electromagnetic repulsion?\n\nphilosophy:\nhttp://www.simulation-argument.com/simulation.html",
			"added": 1457720577
		}
	],
	"topic_vote": {
		"1_1MW2VNNw6afkT5ZvhK1b3RhUoB93u44cPE": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1MW2VNNw6afkT5ZvhK1b3RhUoB93u44cPE": [
			{
				"comment_id": 1,
				"body": "> [pycole](#comment_9_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): If we one day find this theory to be true, we'll probably try to ascend/travel to the higher reality (exploration is awesome, no?). The problem is that we'll have to ask ourselves the big question: is this the highest level?...And then we find that it isn't, travel to the next one, repeat ad infinitum. Since each universe must be more advanced than the one it simulates, we will have an increasingly harder time comprehending our surroundings. In addition, detecting cosmic aberrations will become more challenging--along with determining ways to travel upwards.I hope that answers something for you--or raises even more interesting questions.\n\nthanks, that's a good argument",
				"added": 1457787250
			},
			{
				"comment_id": 2,
				"body": "> [superlugia](#comment_2_1AFL4FFT3BuEDwTwVqychMq4LbxjuEY5Ss): There is always a possibility but also maybe not been a AI but a person who played a game called the universe(which could relate to god but god is a gamer). A real person could be playing our game. If it were real I wouldn't stress that much over it as it is real as it gets in here.Also Plato's allegory of the cave which puts reason that we can only make of what our reality is through our senses.\n\nif that is true, how to be close to the exit?",
				"added": 1457787460
			},
			{
				"comment_id": 3,
				"body": "> [superlugia](#comment_3_1AFL4FFT3BuEDwTwVqychMq4LbxjuEY5Ss): Sorry I don't know what you mean.\n\nI mean is there any chance that we reach the exit and see the root universe ?",
				"added": 1457900567
			}
		]
	},
	"comment_vote": {
		"2_1AFL4FFT3BuEDwTwVqychMq4LbxjuEY5Ss": 1
	}
}