{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1524276223_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1
	},
	"next_comment_id": 28,
	"comment": {
		"1520480628_19k3r2zgWTUszFvHSBBrxDWzEt83VqY7BA": [
			{
				"comment_id": 1,
				"body": "Of source, to take/steal the land of others. And do something with it. It seems to me kind of immoral to just annihilate other people and then don't use their resources. It happened a lot in history. Best example is the Gold which came from South America to Europe, which did not work as intended at all.  \nIf war, then to get something. Never for moral stuff. It kind of defeats morality if war has to sustain it, I guess.",
				"added": 1520625107
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_150_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i rather think people should not hurt anyone, kill anyone, even if they would have to escape or be killed themself. I think God (christianity) do not given us (in Bible) right to kill others for any reason.\n\nYou don't need \"rights\" to kill anyone. This is the essence of war.",
				"added": 1521309426
			}
		],
		"1521057855_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": ">  2 years ago, even. \nYou are probably getting older into another cohort. If you live in a big city, there are different areas where they gather. If you are in a small town, there are just different avenues or whole domains where they are occupying or distracting themselves. cf the effect when the around 30ies have children and vanish from the face of the Earth for five years, because of milk, shit and less sleep than a soldier at war.\n>  I mean, take mass shootings for instance. \nThere are interesting book on crime history and they have many examples of crazies. Our country went up from under one million inhabitants 150 years ago to soon 10 million under BAU scenarios in about 15 years - at the same geographical size. Good advice is to discount 75% on (over)population numbers.\n\nProgress is an illusion. Happiness isn't.",
				"added": 1521308717
			}
		],
		"1521965207_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 4,
				"body": "This is a foolhardy idea. What makes you think the Russians don't rat you out if you accidentally step on their toes or linger into their territory of expertise (without tarnishing anybody's personal and professional reputation here)? What if they... no, they HAVE a clearance office somewhere near D.C. where Dmitry can phone in deals. The FBI does care about law enforcement and getting stuff done. I do not think they hesitate to throw the odd bad guy under a foreign bus if this means to receive findings for free. \nBut if you just want to be opaque for the general data collectors like marketing or your credit scoring agency, then by all means use all Russian mail providers to segregate your communication with corporations. It probably will even be advantageous because they'll profile you as either having a fuckton of money or none, which depending on context can both be very useful.",
				"added": 1522063526
			},
			{
				"comment_id": 5,
				"body": "It is almost impossible to time the usage of social networks in a way such as the spooks can't put 2 and 2 together. Fake accounts have no mobile phone attached e.g. They stick out like a signal flare in the desert at night. The input required to fool social networks (except G+, obviously) has to go through either Android or iOS, which both rat you out. Android=Google and iOS is being used 99.5% by consumer sheep who don't fiddle with privacy settings. A social client on iOS without telltale signatures makes you standing out like nothing else. You will be flagged.  \nDigitally private and secure communication is only possible on a laptop which lacks wifi, geographical awareness of any kind and a PI-hole or similar, directly attacked via LAN, not by wifi, provided you are not under direct surveillance.",
				"added": 1522066089
			}
		],
		"1522586677_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 6,
				"body": "ZN isn't about privacy, but \"undeletability\" aka against censorship. If there are more suites like cjdns around with simple and built in routing, then skyscrapers can be used to make stealth networks around known checkpoints where states and corporations are doing deep packet inspection.",
				"added": 1522588762
			},
			{
				"comment_id": 7,
				"body": "Where you mount something like https://en.wikipedia.org/wiki/RONJA and have stealth connections. There are some manufacturers looking into it, but it seems 5G will drown those efforts. Too bad, FSO and cjdns would fit together like nothing else. \nOh, I re-read my sentence, I meant to use high points to route around the known checkpoints or simply go local as guifi.net does. They are so big they are \"their own media space\".",
				"added": 1522589511
			},
			{
				"comment_id": 8,
				"body": "Every country has either the deep packet inspection boxes in place or up and running. ZN-traffic is very easy to detect and filter. There are billions on services like gmail, youtube and facebook, all pointing to the big data silos and then there are a few hundred thousand endpoints which generate weird p2p-traffic to each other in those treacherous bursts. \nZeronet has a unique burst structure which is probably already profiled, just like they can almost reliably detect bittorrent's uTP and filter this out, while very similarly structured non-bittorrent UDP traffic gets through, because bittorrent clients have their own traffic/burst finger print. I am not even speaking of packet content, just the traffic timing, size and clustering of packets. Around 2000 or so I thought federated services are a solution, but that was before every god damn country on this earth installed middle ware boxes with DPI. \n\nAh, look at this, the detractors are already here. Nothing to interrupt on the open www, did they send you here just for us five to become annoyed? Lovely.",
				"added": 1522595744
			}
		],
		"1522317542_1FenK9SJK21haGBvxM7vZNCLp1Z9hsCWUc": [
			{
				"comment_id": 9,
				"body": "Wait, it doesn't use a DHT?",
				"added": 1522596000
			},
			{
				"comment_id": 10,
				"body": "A simple \"put in here some other peer\" to bootstrap is enough.",
				"added": 1522598269
			}
		],
		"1522601837_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "> [achinese](#comment_29_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q): This ip is super cool\n\nOthers are 64.6.64.6, 4.2.2.2, 8.8.8.8 and so on. There are many.",
				"added": 1522615186
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_246_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): But this is the fastest and one you had listed is a Google DNS IP address.\n\nJust listing a few. I don't know how tech literate 0net users are, considering how easy it is to set it up and wanted to mention a few more. 8.8 etc. is google and they log for sure.",
				"added": 1522667076
			}
		],
		"1523124773_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": [
			{
				"comment_id": 13,
				"body": "What are those?",
				"added": 1523223866
			}
		],
		"1523809606_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 14,
				"body": "The js on zeronet requires at least 56k level speeds.",
				"added": 1524303159
			}
		],
		"1524276223_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 15,
				"body": "We were enraged about sjws since about a decade. Speech codes, not because being in polite society, but because of an external morality not relevant or present in the discussion, since the 80ies. \nThey infested slowly everything.",
				"added": 1524317699
			}
		],
		"1524327364_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": [
			{
				"comment_id": 16,
				"body": "The oblivion problem is solved pretty easily: The creators (e.g. famous, pissed off youtube stars, conspiracy ranters like a certain AJ etc.) just have to install a Raspberry Pi at home self hosting the videos indefinitely for dtube, 0n etc.",
				"added": 1524910529
			},
			{
				"comment_id": 18,
				"body": "I loathe how bitchy the \"skeptic\" community got lately but only a handful of them decided to at least add other sites like dtube or minds.com or - there was a window of opportunity to turn the wheel on this one - gab.ai. There are probably hundreds of local sites in all languages who are in a game theoretically very dark pit against youtube and netflix and they won't mind some additional traffic there from the big house numbers for the time being until the censors can ax them too, but I guess this train is already moving out of the station. \nTo summarize: If you can produce videos and upload to more than just youtube and know what a usb-mike is - you can install some local/VPS helpers to support a decentralized youtube. Imagine a 300k subscriber explaining what ZN, Freenet or ipfs is and the exploding heads of those who want to censor them.",
				"added": 1525031381
			}
		],
		"1524919462_1GWuBys3FxxUX3iRfuEqdRtNgbawiHJ6mu": [
			{
				"comment_id": 17,
				"body": "9869753342232\n\nhahaha",
				"added": 1524921603
			}
		],
		"1524903149_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 19,
				"body": "I was walking in a forest and turned a stone. There was a qr code on it. How weird.",
				"added": 1525557675
			}
		],
		"1526202087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 20,
				"body": "Probably not literally. The Internet is tightly watched, tor and i2p are monitored, GNU is being ridiculed by policy (anything with GNU can't be part of a gov contract)",
				"added": 1526225123
			}
		],
		"1526062041_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"comment_id": 21,
				"body": "du -h . in the zeronet directory gives you an estimate",
				"added": 1526228552
			},
			{
				"comment_id": 22,
				"body": "I forgot if 0n uses sparse files though.",
				"added": 1526417947
			}
		],
		"1526399646_13eAqDw564Ut7PKZnmrCHeMUKc8PQk4Xaj": [
			{
				"comment_id": 23,
				"body": "wait what\n\nVollgeldinitiative on my zeronet?! wtf",
				"added": 1526418396
			}
		],
		"1526415723_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 24,
				"body": "Any assumptions about the universe and its reasons of being thereof are useless.",
				"added": 1526420256
			}
		],
		"1537652215_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": [
			{
				"comment_id": 25,
				"body": "> fascism is also a form of socialism (Mussolini was raised by communists and wrote his manifesto as a reporter working for a socialist newspaper) - just a nationalist form of it.\n\n\"At this juncture the antithesis between the two theories must appear complete and absolute. Liberalism, Democracy, and Socialism look upon social groups as aggregates of living individuals; for Fascism they are the recapitulating unity of the indefinite series of generations. For Liberalism, society has no purposes other than those of the members living at a given moment. For Fascism, society has historical and immanent ends of preservation, expansion, improvement, quite distinct from those of the individuals which at a given moment compose it; so distinct in fact that they may even be in opposition. Hence the necessity, for which the older doctrines make little allowance, of sacrifice, even up to the total immolation of individuals, in behalf of society; hence the true explanation of war, eternal law of mankind, interpreted by the liberal-democratic doctrines as a degenerate absurdity or as a maddened monstrosity.\"",
				"added": 1537715473
			}
		],
		"1537887891_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 26,
				"body": "Get a pi-hole and install ZN and openvpn on it to browse it via VPN. \n(yeah, typical useless advice and proposal, but maybe this works)",
				"added": 1537992045
			}
		],
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 27,
				"body": "I don't know but it seems to me he invented a whole new protocol at one time and changed the world and now he only uses what he already invented and tweaks around. Compare this to bittorrent and the handful of companies behind it, they can't wrap their heads around their own invention. \nBoth this and ZN are kludges hammered together with screeching nails on its engineers blackboard. \nMaybe it works, maybe it doesn't, but the world needs either simple data formats or simple protocol solving a problem, not a variety of different ideas chained together in a way which makes the single project in that chain indispensable AND probably prime inter pares, so you can't just make your own kludge with other chain parts who supposedly follow the standard. Look at systemd for what I mean, as a weaker phenomena, or any new web standard and what formats are allowed - and then only partially supported in the real world implementation, another troubling fact of kludges. \nI always ask myself, ok, how fast could the standard library of Python, nodejs or a maniac armed with gcc implement something which acts exactly the same?",
				"added": 1539466362
			}
		]
	},
	"comment_vote": {
		"28_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": 1
	}
}