{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Сколько тут кодеров?",
			"body": "Кодеры, откликнитесь. Сам пишу на Python, Java, немного Lua. Когда-то писал на JavaScript, знаю основы PHP. Теперь думаю выучить Rust.",
			"added": 1499407211
		},
		{
			"topic_id": 2,
			"title": "во что играете, зеронетчики?",
			"body": "Наверняка ведь играете. Майнкрафт, майнтест? Давайте списочек.",
			"added": 1546890724
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "На peeper стало писать что подпись контента не удалась. Что с этим делать?",
				"added": 1499408962
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 2,
				"body": "Ну шелл само собой, куда без него. Ещё Haskell очень нравится, тоже хочу выучить.",
				"added": 1499485724
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 3,
				"body": "tox",
				"added": 1502980657
			}
		],
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": [
			{
				"comment_id": 4,
				"body": "> [sangokas](#comment_9_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb): 1) переписать i2p на более быстром c++\nЭто бред и не нужно, у джавы и так приличная скорость. Выигрыш будет в паре наносекунд, которые никто не заметит.\n Зато скорость и сложность разработки вырастут в разы.",
				"added": 1523780519
			},
			{
				"comment_id": 7,
				"body": "i2p или джава? и нафига оно там?",
				"added": 1523789131
			},
			{
				"comment_id": 8,
				"body": "Лучше подкроватный сервер. Сомневаюсь что роутер вытянет, даже если заоптимизировать.",
				"added": 1523791224
			},
			{
				"comment_id": 9,
				"body": "Ну а нафиг он кому-то сдался? Только гикам, в качестве игрушки. Однокнопочные не смогут осилить такие сложные инструменты.",
				"added": 1523814993
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 5,
				"body": "У меня Manjaro, до этого сидел на дебиане, а ещё раньше на минте и убунте. На серверах дебиан ставлю.",
				"added": 1523780672
			}
		],
		"2_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": [
			{
				"comment_id": 6,
				"body": "Естьь примеры на джаваскрипте? Охота посмотреть. Особенно как с ключами работают.",
				"added": 1523780737
			}
		],
		"1_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": [
			{
				"comment_id": 10,
				"body": "**Будущее за**:\n* Rust - новый подход к управлению памятью устаняет целый класс уязвимостей. Большинство ошибок отлавливаются на этапе компиляции. Cargo. C / C++ не умрут, но Rust должен занять весомое место на рынке, просто для этого нужно время.\n* JavaScript - веб-макак много, они дешёвые и тупые (не хотят осваивать другие языки). Поэтому их говноскрипт будет пихатся везде где пихается. Привет electron, react native и иже с ними. Стоит ожидать экспансию говноскрипта во все щели.\n* PHP - ну тут понятно, большая часть веба на нём. Пыха будет развиваться, вот в 7 версии ей скорости прибавили.\n* Qt - всё больше приложений пишется на нём и он развивается. Стоит ожидать, что когда-нибудь будет сильно доминировать над GTK.\n* p2p и шифрование - мощности современных устройств позволяют в некоторых случаях избавится от серверов. Зеронет тому пример.\n\n**Отстой**:\n* HTTP - это не чувствуется пока не начинаешь работать с ним, особенно на низком уровне. Наиговнейшее говно, от которого нужно избавится.\n* Rest API - туда же.\n\n**Непонятно что**:\n* Go - не совсем понятно что это и для чего. Вроде бы системный язык, но с какими-то странными заморочками. Из-за GC я бы не стал его использовать.",
				"added": 1523869238
			}
		],
		"2_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 11,
				"body": "Тут кто-то держит гит. Правда хз как, не интересовался.",
				"added": 1523870600
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 12,
				"body": "С таким рвением проще жизнь наладить. Позволишь говнолюдям сломать себя?",
				"added": 1546594881
			}
		],
		"1_18Xtf4D6fjV5LcbfbfwbCLhevDPWFvXnDp": [
			{
				"comment_id": 13,
				"body": "генерировать контент",
				"added": 1546594934
			},
			{
				"comment_id": 15,
				"body": "что-то активность стала совсем околонулевая, кажись зеронет теряет популярность",
				"added": 1547129194
			}
		],
		"2_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 14,
				"body": "вообще",
				"added": 1546942308
			}
		],
		"1_18iNiFsd2V5Xkzf9B1QoAgvqsnHe8EGBam": [
			{
				"comment_id": 16,
				"body": "ePayments",
				"added": 1547428018
			}
		],
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 17,
				"body": "я бы захерачил что-нибудь интересное, но времени нет(",
				"added": 1548107844
			},
			{
				"comment_id": 18,
				"body": "Есть 2 идеи:\n1) Нормальный чат. Возможно с комнатами и конечно же с приватом.\n2) Блоговая платформа. Многим всё-таки лень ковырять свой сайт, а так было бы больше интересного контента.\n3) Нормальный форум, а не это бесконечное говно без разделов. Сейчас в нём нет смысла, но когда-нибудь в будущем, если юзеров прибавится, млжно было бы запилить.\n\nКод можно держать на гит централ, если нет желания использовать обычные гит хостинги. Если я и буду что-то делать, то в очень минималистичном стиле, потому что лень и некогда.",
				"added": 1548108576
			}
		],
		"2_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 19,
				"body": "в чём смысл этой мутной хрени?",
				"added": 1553132380
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 20,
				"body": "ЛОР, балансер",
				"added": 1556552409
			}
		]
	},
	"comment_vote": {}
}