{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Подпольный Интернет",
			"body": "Собственно, сабж. \nПредставим себе такую ситуацию, когда Богоспасаемая выходит на full--КНДР mode и нам вводят Кванмён. Естественно, с принудительной подменой сертификата, полностью прослушиваемым трафиком и вот этим вот всем. \n\nКаковы шансы в таком случае развернуть свою собственную инфраструктуру связи через радиоканалы? Даже лучше всего имплементировать ЗероНет не поверх Клирнета, а полноценно, через формат меш-сети (Гиперборея там или еще что-то). Как это будет выглядеть? Реально ли? \nЯ так думаю, можно настроить инфраструктуру связи по крупным городам, а в более мелкие точки вешать спутниковые гейты.",
			"added": 1525169923
		},
		{
			"topic_id": 2,
			"title": "Битые файлы при скачке",
			"body": "В некоторых сайтах постоянно образуются ошибки при скачке. Пробовал перекачивать раз 20 - всё равно пишет: \"update xx files failed\". Собственно, как бороться?",
			"added": 1525594401
		},
		{
			"topic_id": 3,
			"title": "Хостинг картинок в Зеронете",
			"body": "Какой способ самый удобный, как считаете?",
			"added": 1525600722
		}
	],
	"topic_vote": {},
	"next_comment_id": 37,
	"comment": {
		"1_1HV141A2vZRjYcjAhoGhnmsdD9mfHAAr5e": [
			{
				"comment_id": 1,
				"body": "Ну что, похоже, пора политблог заводить.",
				"added": 1525104950
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_59_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Я думаю что флоппинет куда реалистичней в такой ситуации.\n\nНу я серьёзно спрашиваю.",
				"added": 1525170193
			},
			{
				"comment_id": 5,
				"body": "> [deepstrelok](#comment_12_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Будут zn-курьеры и Zeronet-закладкой.\n\nЯ могу себе представить такую ситуацию, но это уже как-то совсем экстремально получается.\nА вот постоянную синхронизацию сети через спутник - вполне. Пускай даже у нас скорость где-то 1 Мбит, при круглосуточной работе приемо-передатчика можно вполне успевать синхронизировать всё самое важное. Возвращаешься домой, а там уже свеженький блог Стрелка, Балансера, новые обсуждения на Рутолке и so on и so forth. \nЗеронет для такой ситуации, к слову, гораздо, на порядок даже больше подходит, чем Клирнет. Было бы место на диске.",
				"added": 1525185613
			},
			{
				"comment_id": 6,
				"body": "> [itolstoevsky](#comment_3_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z): Исходящий канал как делать? Локализуется и блокируется легко ведь.\n\nКаким образом, когда средняя мощность передатчика - 5 Вт?",
				"added": 1525206521
			},
			{
				"comment_id": 7,
				"body": "> [anotherneko](#comment_60_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): 5 Вт это дофига для радио. У того же wifi 0.2 Вт мощность передатчика.\n\nТак это спутниковый передатчик. Он с орбитальным узлом связывается. Это еще совсем крохотная мощность. Как вы его засечете?",
				"added": 1525242208
			},
			{
				"comment_id": 8,
				"body": "> [strelok](#comment_10_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Напоминаю что 5 Вт это мощность среднестатистической рации. Проблемно засечь её только в глухомани, а так, в городе её километра на полтора в эфире слышно (дальше уже постройки мешают). Единственное что в плюс - их дохрена  и выбрать нужную целая проблема. А вот в дерёвне/пгт - запросто.\n\nСтрелок, ну вы себе представляете, что такое спутниковая связь? Это небольшая параболическая антенна на карнизе. Направленного действия. Весь электромагнитный сигнал идёт сфокусированно прямо на спутник (и именно поэтому мощность такая низкая). Это не традиционная круговая мобильная связь, которая излучает во все стороны. Чтобы засечь тарелку, нужно подъезжать к ней вплотную. Это первое. Второе - сам по себе сигнал ну вообще неотличим внешне от обычного спутникового телевидения, которого в любом городе тысячи. Я лично постоянно вижу на домах эти спутниковые тарелки. И им как-то взаимные помехи не мешают, по несколько штук на одном здании висят. Сигнал-то сфокусированный.",
				"added": 1525248904
			},
			{
				"comment_id": 9,
				"body": "> [strelok](#comment_11_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): calmaquesse, вполне представляю. Но дело в том что действующая власть имеет ресурсы для обнаружения. Разумеется обнаружат только часть передатчиков, но у кого есть желание играть в рулетку? А со спутниковым телевидинием проблема решается просто - запретить и всё. А нарушителей оштрафовать на 100500 рублей и дать условно годик. Даже если такой пострадавший будет один на населенный пункт это создаст достаточный инфорезонанс чтоб остальные владельцы как минимум задумались \"а не ну его нахуй?\".\n\nНу, если так рассуждать, то смысла нет вообще сопротивляться и мутить какие-то там диджитал резистансы. На практике для такого контроля нужны огромные полицеские ресурсы, а, учитывая распространенность спутниковой связи, придётся буквально каждый дом обходить и отлавливать. \nНапример, можно просто поставить тарелку на балконе, сами стекла тонировать в матовый непрозрачный цвет, и никто не узнает, что там вообще есть тарелка, если не вломится в квартиру.",
				"added": 1525251066
			},
			{
				"comment_id": 10,
				"body": "> [strelok](#comment_12_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Ну и спутниковое тв это все таки немного другое - там же приём, передачи то не завезли. Приемопередающее оборудование оно дороже будет.\n\nДа, само оборудование отличается, терминал несколько сложнее. А наружная тарелка, насколько мне известно, ровным счётом такая же.",
				"added": 1525251132
			},
			{
				"comment_id": 11,
				"body": "> [strelok](#comment_13_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Кстати, направленные передатчики почти всегда на диаграмме направленности сигнала имеют ответвления - так что они ещё и по бокам бывает фигачат и взад.\n\nТоже верно. Но тут у тарелки очень низкая мощность - 5 Вт - а боковые излучения еще слабее. То есть, примерно на пару сотен метров с чувствительным оборудованием это можно засечь. То есть практически вполную подъезжать надо.",
				"added": 1525251223
			},
			{
				"comment_id": 12,
				"body": "> [strelok](#comment_14_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Вообще ящитаю в городе нужно мутить лазерные коммуникации (в невидимом человеку диапазоне). Ещё интересно смотрелся LiFi, но световое загрязнение не даст нормально работать. Обнаружить или задавить лазерную линию без точной информации о месторасположении (вплоть до сантиметра) нереально.\n\nА вот это очень годная идея! Слышал про такие проекты, еще читал, что у таких диапазонов сумасшедшая скорость передачи данных (на уровне оптоволокна).",
				"added": 1525251616
			},
			{
				"comment_id": 13,
				"body": "> [strellok](#comment_2_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Если диджитал резистансы сводятся к мечтам о незасекаемых каналах связи, то смысла реально нет. СССР развалился не от самиздата и не от подпольных записей рок-музыки.\n\nНе незасекаемым, а невзламываемым.",
				"added": 1525251838
			},
			{
				"comment_id": 14,
				"body": "> [strelok](#comment_16_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): strellok, само собой. Все дело всегда в деньгах. Но что-то мне подсказывает что не будет никакого кндр-ссср у нас в ближайшее время. С 50% вероятностью в ближайшие года 3-4 вся эта пиздобратия вместе с остатками денег испарится куда-нибудь.\n\nЛибо КНДР, либо дезинтеграция страны. Третьего не дано.",
				"added": 1525251956
			},
			{
				"comment_id": 16,
				"body": "> [balancer73](#comment_353_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я слышу это уже лет 25 :)\n\nЭто не значит, что рано или поздно это не сбудется. Логическая ошибка \"техасский стрелок\".",
				"added": 1525256157
			},
			{
				"comment_id": 17,
				"body": "> [anotherneko](#comment_61_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Достаточно прокатиться по основным улицам на мобильном пеленгаторе.\n\nИ что он засечет? Электромагнитный фон сам по себе высокий из-за массы электроприборов и того же Вай-Фая. Это прокатывало в СССР, когда радиоизлучения было на порядок меньше, чем сейчас.\nВы же знаете, сколько та же микроволновка излучает на Вай-Фай частотах?",
				"added": 1525256210
			},
			{
				"comment_id": 23,
				"body": "> [cdoki](#comment_4_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Фон-то высокий, только есть отличие между направленным сигналом и сигналом Wi-Fi роутера. Напряженность поля вокруг Wi-Fi роутера +- равномерная, а при проезде-пролёте мимо направленной антенны словишь пик. Беспилотники дают безграничные возможности по поиску таких антенн. Также минус сети подобной в её неустойчивой работе - работники радиоконтроля выбивают один из узлов, в итоге огромная часть сетки отключается.Её ещё нужно спроектировать правильно тогда, а не каждый согласиться повесить у себя дома передающую антенну, за которую можно будет сесть в тюрьму.\n\nВот как-раз таки меш-сеть хороша тем, что при выбывании одного узла остальные перестраивают маршруты, чтобы заместить его. В документации к CJDN это хорошо описано.\nИ разумеется, я ведь написал в ОП-посте о спутниковых гейтах-выходах. Основной трафик идёт через вай-фай по системе \"роутер-роутер\" внутри города.",
				"added": 1525261135
			},
			{
				"comment_id": 24,
				"body": "> [anotherneko](#comment_62_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): \n> Если бы она заметно излучала на этих частотах то при включении микроволновке переставал бы работать wifi во всем районе.\n\nСтранно. У меня, по крайней мере, Вай-Фай сбоит при её работе. Но ладно, насчёт остального поручиться не могу - точный спектр излучения я не знаю.\nИ всё же, однозначно, чисто умозрительно возможность засечь всё и вся невелика. Это затраты времени и средств, а укрыться можно, просто выключив на время излучатель.",
				"added": 1525264933
			},
			{
				"comment_id": 25,
				"body": "> [cdoki](#comment_6_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Средств у государства очень много, да и как укрыться, если проверять наличие излучателей, допустим, будет дрон, который пролетает через квартал за 10 секунд?\nПочему вы настолько уверены в тотальном всесилии и всеохватности нашего государства? \nОни, вон, пробовали дронов использовать в доставке почты. Дрон этого не пережил.",
				"added": 1525265500
			},
			{
				"comment_id": 26,
				"body": "Мда, что-то тотальная забитость чувствуется в ваших словах. Я, конечно, понимаю, что айтишники далеки от того, чтобы быть боевым авангардом чего-либо, но, похоже, сам факт неизбежности выстраивания успешной тотальной цифровой диктатуры в РФ вы даже не подвергаете сомнению.",
				"added": 1525266605
			},
			{
				"comment_id": 28,
				"body": "> [anotherneko](#comment_64_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Лично я подвергаю сомнению некоторые методы ее обхода.\n\nБоюсь, при тотальном обрезании Интернета предложенный мной способ - единственный. Ну, кроме эмиграции, конечно.",
				"added": 1525267932
			},
			{
				"comment_id": 31,
				"body": "> [cdoki](#comment_11_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Я раньше верил, что у Путина голоса фиктивные, что власть снимут раньше, чем она успеет ввернуть тотальный контроль. У меня в голове не укладывалось, что люди реально могут это поддерживать, но чем дальше в лес - тем больше дров. \n\nКак вы можете судить даже по этой беседе, они действительно это поддерживают.",
				"added": 1525270788
			},
			{
				"comment_id": 32,
				"body": "> [anotherneko](#comment_65_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Не единственный. Флоппинет, атмосферная оптика, с соседями можно проводную локалку организовать.\n\nФлоппинет это такая себе замена, полноценную связь между тысячами машин он не выдержит.\nПро атмосферную оптику идея интересная, но принципиально ничем не отличается от той же меш-сети через Вай-Фай, разве что засечь труднее. \nНу а про проводную локалку даже комментировать не буду, это на 20-30 человек максимум.",
				"added": 1525270969
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_342_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В Китае про ZN знают, активно с ним борются и возможностей у них куда больше. Но ZN там жива :)\n\nДа и не просто жива, а цветет и пахнет, судя по китаеязычному сегменту.\n\n> [sgushennayavoda](#comment_17_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Бляди из кремля уже всё прекрасно знают. Просто ЭТО не представляет для них никакого интереса СЕЙЧАС.\n\nДа, именно.",
				"added": 1525170695
			}
		],
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": [
			{
				"comment_id": 4,
				"body": "А смысл? 86%, дорогие мои. 86%. Всех всё устраивает. Большинство населения - бюджетники, с ними можно делать натурально всё, да, КНДР тоже можно ввести. И введут. Не Путин, так его преемник.\n\nПоэтому воевать с ними смысла нет. Это как дракон: отрубил голову один раз - выросла новая. Гораздо эффективнее создать достаточно надежные и достаточно распределенные протоколы, чтобы компетентные органы не заморачивались с их взломом.",
				"added": 1525185145
			},
			{
				"comment_id": 15,
				"body": "> [sgushennayavoda](#comment_19_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Ерунда. Прекратите повторять эту идиотскую мантру. Их нет.\n\nДа? 77% на недавних выборах \"нарисовали\"? Ну 5% можно накинуть, ну 10, но не столько же.\nЕсли бы их не было, мы бы сейчас жили в другом обществе и других условиях, не находите?",
				"added": 1525256082
			},
			{
				"comment_id": 18,
				"body": "> [strellok](#comment_4_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): За Собчачку что ли голосовать?\n\n>голосовать\nЛол.",
				"added": 1525256258
			},
			{
				"comment_id": 19,
				"body": "> [strellok](#comment_5_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Ну точно, если на выборы никто не придёт, то Путин расстроится, зарыдает и убежит.\n\nЯ намекаю на то, что вам вообще не приходит в голову существовать в отрыве от государственных институтов и т.н. \"выборов\". \nВы даже не понимаете, что Путин - он не в Кремле, он в головах.",
				"added": 1525257169
			},
			{
				"comment_id": 20,
				"body": "> [strellok](#comment_6_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Воу, воу, палехчи. Телепаты через ZN определяют, чего я не понимаю, вместе с IP адресом. xD\n> Окей, тогда я тоже намекаю:\n> Вам в голову не приходит, что даже если вы хотите \"существовать в отрыве от государственных институтов\", то у государства на этот счёт иное мнение? И у него есть возможности, чтобы своё мнение навязать, не спрашивая, чего кто там хочет.\n\nНу, знаете, ни одно государство пока еще не может тотально прозомбировать всех. Только тех, кто к этому готов и хочет этого.\nПоэтому голосовать за Собчачку просто бесполезно, да даже за Михаила Светова бесполезно. Все это части одного целого. ",
				"added": 1525257612
			},
			{
				"comment_id": 21,
				"body": "> [cdoki](#comment_2_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): А зачем создавать протоколы, если Zeronet прекрасно себя чувствует? Никто не мешает на его основе захостить базу данных, в которую грузить сообщения с симметричным 256-битным ключом шифрования. В жизни не заблокируют и не расшифруют, если, конечно, кто-нибудь ключи не сольёт.\n\nНу, я и подразумевал развитие анонимных средств коммуникации. Зеронет, Даркнет - неважно. Суть была в том, что патриоты, пытающиеся как-то взаимодействовать с зомби под названием \"российское общество\", вообще не туда воюют.",
				"added": 1525259235
			},
			{
				"comment_id": 22,
				"body": "> [cdoki](#comment_3_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Не все понимают, что анонимные средства коммуникации имеют смысл. Вечная проблема \"Мне нечего скрывать\"Нужен стимул, чтобы перейти на что-то другое. Сидел до недавнего времени в ВК, да и сидел бы дальше, не прочитай новость про Дениса Лебедева (который химик), тогда в голове щёлкнуло понимание, что следят ,а последствия могут быть плачевны.\n\nКому надо - перейдут. Те, кому не надо - тем, действительно, судя по всему, скрывать нечего. Не думаю, что посты в Одноклассниках или смехуечки на Пикабу нужно как-то шифровать. ",
				"added": 1525260014
			},
			{
				"comment_id": 27,
				"body": "> [sgushennayavoda](#comment_20_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Из ПРИШЕДШИХ(!!!) голосовать. Явку натягивали как никогда.\n\nНо всё равно тотальное большинство поддерживает Путина. Нарисовать смогли от силы 10%, даже без этого это ощутимо больше половины.",
				"added": 1525266886
			},
			{
				"comment_id": 29,
				"body": "> [strellok](#comment_13_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Вы так и не пояснили, кого им поддерживать, если не Путина.\n\nЯ просто не могу спорить с человеком в парадигме \"хороший вождь - плохой вождь\". \nКак говорил один известный длинноволосый неформал, \"у нас нет лидера\".",
				"added": 1525268009
			},
			{
				"comment_id": 30,
				"body": "> [strellok](#comment_15_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Вы сами её предложили, подняв тему процента на выборах, а теперь спорить не можете.\n\nДа потому что я подразумевал, что лезть в государственные институции вообще не стоит. А вы спрашиваете \"Кто, если не Путин?\" Это аксиома Эскобара заведомо.",
				"added": 1525268278
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 33,
				"body": "> [x86128](#comment_3_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Насколько понимаю, если кто-то что-то где-то коментит то прилетают апдейты в реальном времени, а у авторов сети интересно нет в планах сделать что-то типа push-ей?\n\nУже есть на главной странице.",
				"added": 1525422695
			}
		],
		"2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 34,
				"body": "> [geekless](#comment_47_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): На каких сайтах, например?Может там действительно файлы битые на узле источнике.\n\nZeroMail не докачивает несколько файлов, например. Еще ZeroTalk отчего-то пару файлов не может скачать.\nХотя сами сайты работают без проблем. ",
				"added": 1525596192
			}
		],
		"3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 35,
				"body": "> [anotherneko](#comment_68_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Я под это дело форкнул и немного допилил ZeroUp\n\ncontent.json download failed\nА, всё, заработало, спасибо. А какие именно изменения вы внесли?",
				"added": 1525601968
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 36,
				"body": "> [geekless](#comment_53_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я уж думаю, не сделать ли новый Ru-ZeroTalk и не обратиться ли ко всем прочим владельцам ${страна}-ZeroTalk, чтобы они сменили межсайтовую навигацию.\n\nВот да, это будет лучшим выходом. Если, конечно, контакты админа никто не знает.",
				"added": 1525630544
			}
		]
	},
	"comment_vote": {
		"354_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"10_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": 1,
		"11_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": 1,
		"69_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"53_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}