{
  "message": [
    {
      "body": ">>d88ca1a0c6\n\nIt probably doesn't exist out in the wild yet. I remember someone who bought the bundle bitching that this video wasn't included (also that they got shorted some videos)",
      "created_at": 1458699920,
      "parent": "da19d93bbadd06d048de6c4127575b98",
      "anonymous": true,
      "hashsum": "bfe45d462c56c44eba9171dc238e246e",
      "board": "ktchan"
    },
    {
      "body": ">>6125284e05\n\nYou gotta do some stuff in command prompt. Quick set of instructions for Windows users:\n\n1. Go to https://ipfs.io/docs/install/ and download the file.\n\n2. If you are on Windows 7/8/10 open the start menu and type %userprofile%, this will open a Windows Explorer window. \n\n3. Extract all files from Step 1 into this folder. You can put it elsewhere if you know how to use command prompt, but if not, just use this. \n\n4. Open start menu and type CMD, then hit enter. This will open a terminal/command prompt window.\n\n5. Type ipfs init and hit enter. You will get some text, including some that says to get started, enter: ipfs cat /ipfs/*some random massive text string* . Do what it says.\n\n6. Go back to start menu, type CMD again and open a new command prompt. Type ipfs daemon . You can now right click and save the files here. \n\n7. When you're done, close the command prompt. When you want to come back, just open command prompt and type ipfs daemon. You don't need to redo all these instructions.",
      "created_at": 1458716771,
      "parent": "b6e5008053cee61f1452960737f33454",
      "anonymous": true,
      "hashsum": "b2fa9ee4d1a37ac6c9797536439ea9c0",
      "board": "ktchan"
    },
    {
      "body": ">>d94fe60e1d\n\nI'd be more willing to seed if there was actually something worth seeding at the moment. \n\nRight now, there isn't really anything here that isn't already hosted elsewhere in a much easier way to access aside from maybe the shower scene.\n\nIf I'm going to be offering up bandwidth for the lazy people who are just going to use this as a video streaming service, it would be nice to get some stuff that aren't teasers or already included in the existing torrent bundles.",
      "created_at": 1458745754,
      "parent": "79a83f1e043118e5ef553bd94fe60e1d",
      "anonymous": true,
      "hashsum": "9933251c271d47f3ed26c7ae8b606b8a",
      "board": "ktchan"
    }
  ]
}