{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 1,
				"body": "They will drug animals to make you thing so!\nIts a poor choice! Thats it....\nEven all the movies / series try to push it on us. Fuck even the new star trek now has gay shit on it.\nSick of this pushing homo crap on people that follow the rules of creation you was born with a dick therefore you are man, born with pussy therefore you are woman.",
				"added": 1543765606
			},
			{
				"comment_id": 2,
				"body": "> [pineneedle](#comment_3_1Ji1cTwqd2B4Ka2xe22wPz5TRzQ6BM1P4): I'm a gay male so I can only speak from my own biased perspective, but hopefully it provides some relevant observations. I've never been able to look/question deeply enough to find a decisive origin for the way I feel. I was abused by my mother for almost all of my life before leaving home at 18, and I will accept that some of my intense hatred of women is due to that. But I would characterize the sexual personae of men and women more generally as the Dionysian vs the Apollonian. It's a primal dichotomy that permeates western civilization (which is to say, civilization). The female is Dionysian: all-consuming, destructive, an altar upon which we destroy ourselves and sacrifice our futures to ease the pains of the present. The Apollonian male created civilization and culture as a way to save himself from the violent, hideous chaos and death-worship of the female, which is why females are dead set on destroying civilization, and when they sink their claws into the arts, they produce anti-culture. They envy men because they cannot create, only destroy, and this goes as deep as things like the penis being directive and pointing as opposed to receptive and useless. While I think homosexuality is at some level genetic, it manifests in my mind as an appreciation of strength, beauty, intelligence, creation etc., things women embody the exact opposites of. I think males are drawn together by this shared desire Good. Most draw the line at friendship, which is the purest form of relationships as it is untainted by lust, but for some, it replaces sexual relations altogether. My point being that it (sexuality) does not exist in a realm of its own but rather originates from the same desire for Good and a better world, that all males have, that draws virtuous men towards one another. And suffice it to say, there's a reason all of the feminine wastrel fags hang out with women.\n\nIts not to late to correct your gay fag mistakes.",
				"added": 1543765929
			},
			{
				"comment_id": 3,
				"body": "> [y1ff](#comment_1_1E9Zh5SCk9dHFCaCsyMnmjApo2xtYR56Fi): Bro, the Greeks were gay back in 500 BCE.\n\nAnd they was wiped off the earth very fucking quickly.",
				"added": 1543766038
			}
		],
		"1542766666_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 4,
				"body": "Learn and use hyperdex and this wont be a problem!\n\nhttps://github.com/atomiclabs/hyperdex",
				"added": 1543767023
			}
		]
	},
	"comment_vote": {}
}