{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Contraingeniería social",
			"body": "Hola shurs, burbujeros, y resto de exiliados. Este hilo es para los que estáis aquí porque nunca vais a renunciar a la libertad de expresión o de debate, a la libre contraposición de ideas,  y por tanto a vuestra libertad de pensamiento. Ni a la de vuestros hermanos. \nVeros por aquí, colaborando y ayudando a que esto sea posible, me ha dado esperanzas. No voy a ser yo el que os cuente lo que está en juego. Urge saber si podremos hacer de la Zero una herramienta útil. En medio de toda esta propaganda y desinformación, parece que sólo podemos contemplar como se estrecha el pasillo hacia el estado totalitario. \nPara todos los que seas investigadores natos, o que ya hayáis desarrollado el instinto de contrastar la información que os venden. Quiero saber si alguien más estaría interesado en grupo o plataforma, donde poder ir volcando y analizando conjuntamente la info, especialmente de los temas que o nos ocultan o nos dan sólo una de las versiones. Tenemos mucho trabajo, por ejemplo, con el lobby feminista o en documentar como se esconden los delitos de la élite tanto financiera como política, y sus conexiones... con el lado oscuro del sistema.",
			"added": 1525606742
		},
		{
			"topic_id": 2,
			"title": "Ejército de Liberación Nuncafollista",
			"body": "Parece que El Confidencial avanza en la senda de querer vendernos la payasada del terrorismo nuncafollista:\nhttps://blogs.elconfidencial.com/alma-corazon-vida/con-dos-ovarios/2018-05-06/revolucion-incel-muerte-sexto_1559529/\nHilo en Burbuja donde algún forero comenta sobre la posibilidad de que estén cocinando ataque de falsa bandera que atribuir a esta invención de los propagandistas (o quizás busquen \"iluminar\" a algún perturbado mental ya no sé que pensar leyendo cosas así), como siguiente hito de la agenda: ...Juana Rivas/8M/Manada/Next?",
			"added": 1525652040
		},
		{
			"topic_id": 3,
			"title": "La Tribuna de Cartago lo vuelve a romper (financiación PP Badajoz)",
			"body": "http://latribunadecartagena.com/not/5470/el-pp-podria-financiarse-con-falsos-accidentes-de-coches/\nOstia como se lo curran... lo que también seáis profesionales del sector os vais a partir el chorizo.",
			"added": 1525784361
		},
		{
			"topic_id": 4,
			"title": "VOX es sionismo",
			"body": "https://www.voxespana.es/vox-israel-y-oriente-medio\n\nLos que estáis buscando alternativa a los cuatro grandes partidos españoles, que parecen estar conchabados para imponer la agenda, pues por lo menos seáis conscientes de que estaréis apoyando directamente al sionismo.\n\nHay un hilo en fp del tema, quizás sólo sea una coña, pero uno de los foreros insinúa criptojudaísmo.",
			"added": 1525870157
		}
	],
	"topic_vote": {
		"6_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"1_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": 1,
		"2_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": 1,
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": 1,
		"4_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1_1M7F6u6eucA1MoqsZWpT4XtP5iLzUHSn2b": [
			{
				"comment_id": 1,
				"body": "8=====D - - -",
				"added": 1525350726
			}
		],
		"1_1FwhwYBwon26Z5aWnpnQteWspmprCBuPTj": [
			{
				"comment_id": 2,
				"body": "lidl dimisión",
				"added": 1525438622
			}
		],
		"6_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": [
			{
				"comment_id": 3,
				"body": "Pole",
				"added": 1525447415
			}
		],
		"1_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": [
			{
				"comment_id": 4,
				"body": "mol34 has puesto tu mail que sólo con ponerlo en google (te aviso) sale TU MÓVIL entre otros datos. Me parece que no das el nivel para Zerocoches, mejor vuelve a la burbuja",
				"added": 1525519933
			}
		],
		"1_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 5,
				"body": "Totalmente de acuerdo en comenzar con la difusión y asesorarnos en utilizar correctamente la Zero. Por separado, ninguno tenemos el tiempo ni los recursos para hacer frente a redes criminales. instituciones corrompidas o medios de propaganda/desinformación con presupuestos millonarios. Por no hablar de ser un objetivo fácil.\nSin embargo como red libre, crítica, anónima, descentralizada... creo que podríamos hacer mucho.",
				"added": 1525651080
			},
			{
				"comment_id": 6,
				"body": "Artículo caso manada vincula al CGPJ con la Womens Link Worldwide (patrocinada por la Open Society de Soros):\nhttp://ramblalibre.com/2018/05/07/la-manada-denuncia-la-implicacion-de-la-open-society-y-la-fundacion-ford-en-la-estrategia-internacional-contra-la-sentencia/\nSi alguien sabe algo, o donde buscar sobre esa \"estrecha colaboración\" entre la WLW y el CGPJ que lo diga.\nVale que es ramblalibre.com y no conozco este medio. Pero igual a través de la comisión de igualdad del CGPJ...\nhttp://www.poderjudicial.es/portal/site/cgpj/menuitem.0cb0942ae6fbda1c1ef62232dc432ea0/?vgnextoid=4e18b5c4f2216310VgnVCM1000006f48ac0aRCRD&vgnextchannel=3a20f20408619210VgnVCM100000cb34e20aRCRD&vgnextfmt=default",
				"added": 1525719698
			}
		],
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 7,
				"body": "> [pq9p](#comment_10_141t775YRGcErzqqn4dwUyUQqZrjhdnN3n): ah ya puedes ir a nado, solo son 200km\n\ny a braza, si tienes que llevar el USB en el maletero xD",
				"added": 1525720076
			}
		],
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 8,
				"body": "> [zero900](#comment_9_1PgEenXoGTDU9urEFYJSsxH8wkbvy3UyVH): Ilitri vive de los anunciantes, y además bastante bien por lo que parece. Si los anunciantes se retiran a él se le encogen los huevos. Normal. Como también es normal que nosotros nos busquemos otro lugar donde escupir verdades sin dar cuentas a nadie. Cada uno barre pa' su casa.\nHe leído tus comentarios y me parece que aportan, pero aquí te diría que en última instancia Hitlitri vive de los foreros, que son lo que interesan a los anunciantes. Y después de ver como un trollaco de forochicas se dedicaba a putear para reportar las respuestas para ir sumando baneados... supongo que a la larga se quedarán cuatro gilipollas.",
				"added": 1525720774
			}
		],
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": [
			{
				"comment_id": 9,
				"body": "> [eltitiriter0](#comment_2_12jQAtBverLUwHEXJsBxo9KfWyeFSHTacq): Toma punto inseguro enfrente de una asociación feminista!!\n\nCreo que has dado en el clavo shur, yo pondría: \"Aquí te animan a denunciar aunque no lo tengas muy claro\" xD",
				"added": 1525800542
			}
		],
		"4_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": [
			{
				"comment_id": 10,
				"body": "> [ioc](#comment_23_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC): Votemos pues a la Falange Española.\n> Y encima eres ninohrata...\n\nEy por mi como si te cortas el prepu, pero que no escondan lo que son.",
				"added": 1525883450
			},
			{
				"comment_id": 11,
				"body": "> [bitcoinalaluna](#comment_9_19YFsJ8SoqRa4QEKt7whkXsNoZN5EC23HN): Vota a podemos entonces so maricon\n\nPaso, son todos la misma mierda, gilipollas",
				"added": 1525906673
			},
			{
				"comment_id": 12,
				"body": "> [ushurario](#comment_10_1KKSpUM5yc3BML9psRK2fML6mJ2mKnRD2y): Viva Israel\n\nhttps://www.youtube.com/watch?v=sRMdmTi-Wc4",
				"added": 1525907517
			},
			{
				"comment_id": 13,
				"body": "> [bitcoinalaluna](#comment_11_19YFsJ8SoqRa4QEKt7whkXsNoZN5EC23HN): Hay que votar a los mas patriotas  , a los menos nocivos para españa , VOX es la mejor opcion , ¿que coño te importa israel? , me importa españa , si quereis los mariconazos votar a pablemos , los machos de verdad votamos a VOX o DN solo que ahora vox es la opcion mas viable para llegar al parlamento\n\nEs que de donde yo soy, si fueses luciendo esas siglas te iban a partir la cara cada dos por tres. De todos modos VOX y DN están enfrentados en esto, así que mejor quédate con DN, te paso su whatsapp 662497550 que seguro que haces mucho amigos.\nYo es que si hay algo que nunca he sido, y nunca podré ser es racista (ojo, que no se confunda con que no crea que la inmigración deba de estar de alguna manera regulada) . Y tampoco tengo nada en contra de los judíos como individuos, grupo, religión o lo que sea, el sionismo es otra cosa. El sionismo es racismo, y así lo recogía la ONU hasta 1991. Un saludo patriota",
				"added": 1525954988
			}
		],
		"1_1AVJ81oqjh7RGCBxQdm5jg1TceyWXeQx3C": [
			{
				"comment_id": 14,
				"body": "Llego tarde... alguien sabe q pasó?",
				"added": 1526074260
			}
		],
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 15,
				"body": "Me encanta la idea net2. Acabo de activar el zeromail... es @zeromail.bit como el zeroid?",
				"added": 1526074796
			}
		]
	},
	"comment_vote": {
		"18_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"22_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"13_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": 1,
		"5_1AVJ81oqjh7RGCBxQdm5jg1TceyWXeQx3C": 1,
		"23_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC": 1,
		"10_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": 1,
		"13_13esZg8pXRhUWy9TdPz93TKVf7U2U36em3": 1
	}
}