{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565164789_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 1,
				"body": "Scary times, my friend.",
				"added": 1565189791
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 2,
				"body": "> [223556](#comment_22_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): There is nothing wrong with wanting to stop the genocide of your race.There is nothing wrong with calling out those that are working towards the genocide of your race.Homosexuals are vile pedophiles that corrupt society and the people in it. They are disgusting and deserve death. Link related:https://www.bitchute.com/video/FNqiV8kL4cc/\n\nwew",
				"added": 1565192488
			}
		],
		"1565164789_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 3,
				"body": "only thing we need is a way to shield users from cp silently downloading on their hard drives",
				"added": 1565192652
			}
		],
		"1565142042_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 4,
				"body": "Do you recognize that the conclusion \"Black people aren't human\" does not follow from anything you have stated?\n\nSaying that blacks and whites are genetically different, and can be categorized, at least to some extent, in different racial categories, does not mean that blacks aren't people. Because they are.",
				"added": 1565203941
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 5,
				"body": "fyi for new 8/4chan users: a lot of chans visited (ex. 0chan porn) contain cp, so either refrain from visiting them at all or be careful when you do",
				"added": 1565208635
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 6,
				"body": "This might be the most mindnumbing article I have read this year.",
				"added": 1565289028
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 7,
				"body": "Reading the article you'd almost get the impression The Daily Beast is writing as if they've uncovered some kind of terrorist network. I wonder what their motivations are.",
				"added": 1565356140
			},
			{
				"comment_id": 11,
				"body": "> [aspidochelone](#comment_31_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): They can certainly connect your IP to the file they are downloading from you. [...]\n\nBut you can see which files you are seeding, and also which files you have downloaded by looking at your data folder. You can even use a script to automatically create thumbnails for every file to quickly scan through anything and pick out any files which would be illegal to distribute (cp, copyrighted stuff, etc.)",
				"added": 1565365612
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 8,
				"body": "> [aspidochelone](#comment_27_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I started looking for some more data and found http://www.unz.com/article/the-iq-gap-is-no-longer-a-black-and-white-issue/ which explains that when African nationalities are considered, some actually beat the whites while others are far behind.  It seems to have a lot to do with poverty, refugees from war-torn areas and so on.\n\nIf you look at native (non-immigrant) populations, the African nationalities don't score higher than the white American population. Only the immigrant populations of Africans do. \nOf course you would expect that a relatively large share of African immigrants will place above the average white IQ in America, since many Africans who emigrate to the U.S.  are professionals/students/academics/etc. They are not representative of the native population from where they came. \n\nWhile environmental factors like poverty can have a negative effect on IQ (especially in the younger years of a person), by the time a person is a teenager IQ is estimated to be around 80% genetic, according to many intelligence researchers.",
				"added": 1565357903
			},
			{
				"comment_id": 12,
				"body": "@aspidochelone: I'm not sure what you mean by \"we don't see huge variations in IQ depending on which alleles get passed on in GWAS studies\"? Could you explain what you mean? \n\nRegarding the shortcomings of standardised IQ tests, I do agree with you that some IQ could be influenced by 'just having learned the right stuff', like with your example of memorising elements vs. batting averages. However not all IQ tests are created equal, and even with IQ tests that are less susceptible to these kind of memorisations (i.e. tests that are heavily 'g-loaded') the patterns still persist. Intelligence is definitely not exclusively environmental (nor is it exclusively genetic).\n\nI'm glad to see you acknowledged the twin concordance studies, but I must say there is also another important type of study which strengthens the 'more gene heavy'-model: adoption studies, and perhaps most famously the Minnesota Transracial Adoption Study, which results indicate a mix of both environmental and genetic factors.   \n\nLastly, you mention something along the lines of \"we don't know everything about it and odds are there are some crucial puzzle pieces missing that could explain some things better than any theoretical model we now have\". I wholeheartedly agree with you that there's so much we don't know, and that our current findings aren't set in stone. But on the other hand, you could apply this 'limitation of knowledge' to any other scientific field just as easily. And the science on intelligence has been relatively well known since the 1960s/70s and intelligence research is perhaps the most valid and strongest field in all the social sciences.",
				"added": 1565380151
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 9,
				"body": "> [watteau](#comment_20_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Great Britain has a moral obligation to take an interest in the welfare of the Hong Kong citizens.\n\nI'm somewhat torn on this. Disregarding the whole question on whether entities such as states (i.e. not individuals) can even hold a separate moral obligation, I think the whole international community should feel a sense of responsibility in light of the injustice like in Hong Kong. I don't know whether GB is any different than any other state, since you could argue  its responsibility lies with British citizens exclusively.",
				"added": 1565358849
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 10,
				"body": "'You are wrong'",
				"added": 1565360840
			}
		]
	},
	"comment_vote": {
		"1_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"866_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_1J3RTrQkYUfkCc6fixRZRkgWwFk1TDpD4c": 1,
		"1_1NmQXkWpG23fWV69dN2tKcqS9MYH3Zb83v": 1,
		"14_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": 1,
		"255_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"4_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"10_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"80_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"79_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"99_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"8_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg": 1,
		"20_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"30_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"9_1AARpJL8Wxtq6J3iwc5bHinsPxQFc1Z2z1": 1
	}
}