{
	"next_post_id": 33,
	"next_comment_id": 2,
	"next_follow_id": 5,
	"avatar": "jpg",
	"user_name": "mahdi2@zeroid.bit",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "A high IQ nerd destroyed by low IQ bully brother\n\nLocation: Asia",
	"post": [
		{
			"post_id": 1631372649,
			"body": "## Decentralized Bootstrapping\n1- Decentralized bootstrapping using PoW blockchain (Not mentioned in below article but I think PoS blockchain can not fight split-view attack, only PoW can. but I'm not expert):\nhttps://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/blc2.12001\n\n2- Also Certificate transparency method can be used to at least detect split-view attacks \nChromium already implemented it. But I think Version 2 of Certificate transparency is only effective (although not as effective as blockchain)",
			"date_added": 1631372644
		},
		{
			"post_id": 1631739795,
			"body": "Why ZeroNet client bootstrapper is not on, by default?",
			"date_added": 1631739788
		},
		{
			"post_id": 1632247261,
			"body": "# Two law changes that protect you from an evil sibling\n## Suggested laws:\n1- To remove financial incentive for destroying the sibling, if a child die before parents, his future heritage would not be divided between siblings.\n\n2- (optional) Sometimes the incentive for destroying you is something more than financial greed. So if one kid died before certain age (e.g. 40). There should be even a fine on surviving siblings' heritage or even confiscating surviving siblings' whole heritage\n\n## My story:\nFor myself, a rare event caused that I found out my brother's annoyances were on purpose. I don't explain annoyances, but below ones could happen to you, too:\nSeveral times he destroyed my mattresses, when I wasn't in my room. I was thinking the problem is my body or bad quality of mattresses. It is very devastating. You didn't sleep last night and you have to go after purchasing new mattress (if your family give money for that after several times) (even ordering it online and later talking to delivery mens are hard when you sleep depraved)\n\nRecently, he (or his devil fiancé) used carcinogen in my food (or an OTC taste-less drug with same health effect plus increased chance of stroke. I don't mention its name publicly). When I found out I have cancer it was too late to prove anything, because the poison has been excreted from my body long time ago\n\nSometimes the incentive for destroying you is something more than greed, like my case that in the beginning, he wanted to bring me down to his level because he wanted to pass his young ages without being forced to go to university by my parents. He made me his shield. Or sometimes your sibling wants to destroy you just because you have occupied the sofa in the morning.\n\nNotes:\nNote 1:\nThe reason nobody suggested this before me is that, victims of this situation, are died before they have chance to think or talk. A rare specific situation in my country given me this chance before death\n\nNote 2:\n\nThese laws can also be provided as an option (to potential victim). Someone can opt in that if I died before certain age (roof age allowed by law e.g. 40) this or that happens for my future heritage or my siblings' heritage.",
			"date_added": 1632247231,
			"meta": "{\"img\":\"900,506,faffffcb7fefddbdb2ba6db1ccbca2ca1eeeca3a81b91,0011221111331455411111167761111189AA98111BC7DD7CB1149EEEEE41\"}"
		},
		{
			"post_id": 1632253842,
			"body": "Decentralized Census\nI think a decentralized census (d-app) is really needed. It can detect duplicates and forged imaginary persons by face recognizing videos of participants submitted\nIt can be used also as an identity system for a block-chain based voting system. \nWhy governments want to lie about population and its related demographics? I don't want to explain more. I'm not comfortable talking about it",
			"date_added": 1632253811
		},
		{
			"post_id": 1636363144,
			"body": "For easy Arch Linux installation use Manjaro instead. Avoid GUI installers mentioned in Internet guides \n",
			"date_added": 1636363112,
			"meta": "{\"img\":\"875,700,4543444554865666876a8799999dddbcc498abbeeeeddecd,011111023301244566780189AAAA98B0CDDDDDDC84ADDEFDD784CDDDDD9487CAA885505555201111\"}"
		}
	],
	"post_like": {
		"1FAaSRe6UxTYrNiWQnnqzSgDs4Vz9tgQPy_1630178809": 1630213692,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1631691108": 1631738879,
		"15PEof54VQE7mki8G8hYa5FgkCgpYgetSg_1631577679": 1631739387
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "sorry for re-posting. Zero Me had a bug on post deleting",
			"post_uri": "14nAB5NywyhuWp8J2HUy83gLwUFqd9rbZh_1632247261",
			"date_added": 1632247302
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1FAaSRe6UxTYrNiWQnnqzSgDs4Vz9tgQPy",
			"user_name": "3rsh",
			"date_added": 1630240310
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1FAaSRe6UxTYrNiWQnnqzSgDs4Vz9tgQPy",
			"user_name": "3rsh",
			"date_added": 1630240310
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "15PEof54VQE7mki8G8hYa5FgkCgpYgetSg",
			"user_name": "irangeek@zeroid.bit",
			"date_added": 1631739406
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "14hEy7Xj73N62M8asSBeJQCSct4WwskRGd",
			"user_name": "Noldi",
			"date_added": 1631741422
		}
	]
}