{
	"title": "網上醫院&學校",
	"description": "多成中醫義務工作者",
	"links": "- [多成中醫](http://127.0.0.1:43110/1AUHC6wpgF676cEd8uZX6cU8BucGU4KAP7)\n- [多成論壇](https://duosuccess.com/bbs)\n- [平淡如我案例整理](http://blog.sina.com.cn/mianfeiyiyuan)\n- [多成中醫實名分享微博](http://weibo.com/625301248?is_hot=1)\n\n",
	"next_post_id": 4,
	"demo": false,
	"modified": 1500440119,
	"post": [
		{
			"post_id": 3,
			"title": "個人健康協會等",
			"date_published": 1500436377.309,
			"body": "以下是一些協會，排名不分先後：\n\n- [馮綺雲乳癌協會](http://efbcc.com/index.html)  ；   [馮綺雲facebook](https://www.facebook.com/ElaineFungBreastCancerCare) \n\n- [馬來西亞社會福利援助及醒覺](https://www.facebook.com/Social.Welfare.Awareness.And.Assistance/?ref=page_internal)  ；   [負責人Zurich Chong](https://www.facebook.com/zurich.chong.5) \n\n- [田雨晰先天性心臟病健康協會](https://www.facebook.com/groups/1271879866169111/?hc_ref=ARQa-pzhFI7oN_JvrQoiHLSzxjyNLvHjlSDjn_GuQSLb_exV89CgTY9j81Q1VHul4Ho) \n\n- [崔繼紅產後抑鬱症-月子病健康協會](https://www.facebook.com/groups/255741331560327/?hc_ref=ARS0U3KMSZlVyUplFCuZscKYDPqu_NMboMa7nu1D2v5Xo-C-kV__aOsCa8LLd7ZLTNE&pnref=story) \n\n- [其他健康協會（論壇分享） ](http://www.duosuccess.com/bbs/viewtopic.php?f=12&t=4338) \n\n"
		},
		{
			"post_id": 1,
			"title": "多成醫院網上全自動化醫院──現在和可見的將來，舉世無雙",
			"date_published": 1500080179,
			"body": "多成醫院網上全自動化醫院──現在和可見的將來，舉世無雙\n異病同治、同病異治、未病先治。無遠弗屆、晝夜無間、老少咸宜\n瞑眩反應是經絡臟腑病變之處和中醫治療完成之時\n用你的電腦或電話──親身體會中醫的博大精深和健康真諦\n\n>多成中醫直接源於易學（多成學校亦然），不是基於現代中醫。其可以存在於電腦代碼中，可以放在大地之上（如雨中漫步和主題公園），也可以0和1或類似的更高層次的形式存在和體現（如無字方和ς音樂），而不是只以實物的形式存在（中華文化向來崇尚無形為上）。現代中醫雖然也是同源（醫源於易），但由於千百年來的歷史、自然和人為等因素，在傳承的過程中造成了許多遺失和錯漏，很多極為寶貴的內涵和傳承都已成為過去。而多成中醫不是在現代中醫的基礎上繼承發展而來，所以不存在失傳或錯漏的問題；多成中醫多年來向公眾提供前所未有的產品和服務，其中包含了許多現代中醫早已失傳的本源和曠世絕學，是對中醫的繼承和弘揚......\n\n多成中醫網上醫院：\nhttps://www.duosuccess.com/\nhttp://127.0.0.1:43110/1AUHC6wpgF676cEd8uZX6cU8BucGU4KAP7\n \n多成中醫是一家核心業務在健康領域，產品橫跨美容、戒毒、婚姻、家庭、教育、考古、社會和犯罪學等多學科，同時也是國際上最有價值的高科技企業，從事智能健康領域的尖端研究。企業成功立足於中華五千年傳統文化，擁有比電腦和雲計算更為先進的現代頂尖科技，學術和技術水平領先全球。企業在品牌的情感引力和品質方面取得最佳平衡，費用隨奉的收費政策、快捷優秀的顧客體驗、錦上添花的高階服務和互聯網的全球自動化運作，迎合大眾市場殷切需求。她是傳統中醫和現代互聯網技術的集大成、是下一代文明的昭示和展望，她為人類健康、現代文明和世界和平作出卓越貢獻（原文参见：多成中醫研究所）。\n \n患者既可诊金随奉（根据你的能力和愿望支付，没任何压力），也可定额收费（全程自助），还有多成网购（高端服务）；無力支付者可向未知多成的需要者提供多成網址 DuoSuccess.com（病輕者每日給一人，病重者每日給五人，欲改變命運者每日給千人至萬人或以上）。\n \n对战争和暴力冲突地区的老百姓、欲自杀者、有心理危机患者、核子意外灾民和救灾志愿者、疫症患者等提供免费中医救援，当前正在进行的救援参見：网站首页》多成中醫緊急救援\n \n可按以下步骤开始使用多成：\n打开多成网站主页(繁体中文)，开始使用诊金随奉的多成网上方，每个方子底下都有详细的注意事项，有下劃線的都可以點開，请花一点时间看看，使用多成中医网上医院的所有产品都必须由网站首页进入，再点击相应的方子。\n\n（1）网上ς能纸，网上ς日历：天人合一，只需折叠贴身携带，非常方便，能纸和日历选一即可。\n    注意事项：字面朝外，每张只能使用三个自然日可以固定一个时间，在第三日的睡前或晨起除旧更新（每次如此，就不易混淆），能历是2个自然日。具体请看西格瑪能紙和日曆使用方法。\n（2）網上ς音樂：进入此网页即自动播放——每次1小时，每日1-3次或以上，之间相隔1小时或以上。（手机用户可以下载安装多成中医浏览器 http://rick-li.github.io/midi-browser/zh.html  ）。\n注意事项：在线听，打开音乐后尽量不要动电脑和手机，用“心”效果更好。每一次听之前请刷新。具体请看西格瑪音樂使用方法。\n（3）网上ς食疗：加入亲情因素，增加亲伦快乐，用心更多，效果倍增。\n注意事项：方子需打印，使用三天，食疗材料、数量、温度、时间段需按方子严格遵守。如需真太阳时，可下載上述多成中醫手機瀏覽器查看。具体请看西格瑪食療和傳統中藥使用方法\n（4）飲用水購買授權書：付款後打印此授權書，攜之在規定的時間內去市場上買飲用水，將飲用水放家中一定時間後，即可飲用。\n注意事项：留意授權書有效期，在規定時間買水，水要放置滿規定時間後飲用。購買飲用水後，授權書需立刻撕毀。具體見飲用水購買授權書使用方法。\n（5）網上ς吉祥摺紙 ：打印後按要求摺疊佩戴。具體見網上ς吉祥摺紙使用方法。\n（6）雨中漫步：全球都有雨中漫步點，找到自己所在國家城市附近的雨中漫步點，用手機或者谷歌地球根據經緯度定位起步點，根據要求漫步，1小時/次，1次/日。建議連續 7日為一療程。具體參見雨中漫步使用方法。\n\n案例疗效： \n多成中醫的用户,很多患有目前正规大医院无法治愈的绝症或久治不愈的疑难病（包括很多西医无法治愈的癌症、糖尿病、高血压、心脏病等），也有很多患者因经济条件有限，沒钱到高级医院看病，因久拖不治，越来越重，长期忍受病痛的折磨。他们都是拖着被误诊误治或者久拖不治的身体，来到多成中醫網上醫院。要治愈这些病人的疾病，难度更大。但他们有幸遇到多成中醫，遇到龍衛權中醫師，多年沉疴终得显著疗效甚至治愈，也是因祸得福！\n \n更令人惊讶的是，除极少数人之外，绝大多数患者根本就没有见过龍醫師，也不需要龍醫師诊断病情，只使用多成中醫診金隨奉的網上处方就治愈了疾病！\n \n治愈这些疑难病的部份案例可參看平淡如我的整理。http://blog.sina.com.cn/s/articlelist_1419618991_1_1.html\n\n\n如有问题想在多成論壇找答案或类似病例，可利用多成論壇本身提供的搜索功能（注意繁简体），亦可用谷歌 “關鍵詞 site:duosuccess.com” 搜索。\n \n\n多成中醫由龍衛權中醫師创办。龍衛權中醫師的簡介可見于多成中醫网站首页》醫學常識 》龍衛權中醫師（簡介和傳承）。\n \n以上内容如有不妥，与多成中醫網上醫院无关，請以官網爲準。\n"
		}
	]
}