{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1590404236,
			"title": "I've heard that my government is planning a 7,5% one time property tax",
			"body": "To get the expenses of the coronavirus crisis back my government is planning a 7,5% one time property tax on real estate owners.\n\nDoes your government have similar plans?",
			"added": 1590404235
		},
		{
			"topic_id": 1597577135,
			"title": "Italy going cashless",
			"body": "Italy has introduced its \"cashless plan\" on July 1st, 2020 which limits cash payments to 1999,99 Euro. In 2022 the limit will be lowered again to 999,99 Euro.\n\nhttps://www.ilgiornale.it/news/economia/conte-stretta-contante-sar-dolce-fair-senza-penalizzazioni-1870762.html",
			"added": 1597577133
		},
		{
			"topic_id": 1599847995,
			"title": "www's hostility against anonymous users",
			"body": "Are you using Tor for browsing the www ? That was possible to some extent, not so long ago. But that seems to have changed. Obviously the clearnet does not want people who are trying to remain anonymous\n\nHere's what i usually experience when using the TOR Browser \n\n- error messages saying things like ( we've detected suspicious activies coming from your IP address )\n\n- Recaptchas that take about 5-10 minutes to solve or even endless ones\n\n- sometimes i get a Recaptcha and after solving it, the suspicious-activities error message which requires me to solve a new captcha",
			"added": 1599847992
		},
		{
			"topic_id": 1601486791,
			"title": "EU's censorship tool is de-anonymization",
			"body": "While countries like China and Russia are censoring by using the GFW or banning TLS 1.3, the EU does that in a more clever and sneakier way. In the last weeks a lot of cryptocurrency related services suddenly made it mandatory to upload a copy of the ID in order to continue using their service. This will of course cause many people to close their accounts and many of those providers to cease their service.\n\nExpect more rules, more regulations, more bureaucracy, more paperwork, more KYC, less anonymity. \n\nThe EU is a giant super parasite with a control fetish and is doing everything in its power to keep their citizens in the fiat money prison.",
			"added": 1601486787
		},
		{
			"topic_id": 1601562719,
			"title": "Account-free crypto currency exchanges are often freezing funds",
			"body": "More and more exchanges are being forced by governments to set a trap for their users. They are freezing your funds requiring you to send them a copy of your ID and other documents.\n\nAvoid them! Or if there is no other way, only exchange a very small amount, that doesn't hurt if you lose it, but never give them any documents.",
			"added": 1601562714
		},
		{
			"topic_id": 1602235576,
			"title": "European central bank intensifies its work on a digital euro",
			"body": "As the title suggests the ECB is working on a digital Euro AND most likely on penalty fees for using cash\n\nhttps://www.ecb.europa.eu/press/pr/date/2020/html/ecb.pr201002~f90bfc94a8.en.html",
			"added": 1602235570
		}
	],
	"topic_vote": {
		"1590447717_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": [
			{
				"comment_id": 1,
				"body": "Cryptocurrencies don't need mainstream adoption. Their major use case is to escape capital controls. A wonderful protection against those giant parasites called governments.",
				"added": 1590217575
			}
		],
		"1590447717_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 2,
				"body": "The European Union will create a new currency and declare the Euro to be no longer a legal tender. Those who have cash will have to bring their notes to the bank with their ID to exchange it for the new currency. The new currency will have the exact value of the Euro but the bank will charge an exchange fee of 9,87478434553834% :)",
				"added": 1590568552
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 3,
				"body": "The police offer job attracts sociopaths, racists, psychopaths etc. i have dealt with many and most of them are simply: 'not right in the head'",
				"added": 1591523935
			}
		],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 4,
				"body": "> [krombopulusmike](#comment_25_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): VPN #1 -> TOR -> Anonymous VPN -> Anonymous and Elite SOCKS5 Proxy (if necessary for task at hand.) [...]\n\nmmmh... yes! right! but would an additional or 2 additional VPN help against the ReCaptcha harassment? Probably not...",
				"added": 1599908739
			},
			{
				"comment_id": 5,
				"body": "Another thing that struck me is that you have to register for every bullshit. Mostly with a \"recaptcha protected\" form with as much information as possible with subsequent confirmation by email or SMS",
				"added": 1599909659
			},
			{
				"comment_id": 7,
				"body": "> [driud](#comment_118_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Need to change the distribution..1-remove the goggles..2-remove the tube..3-delete mail..4-replace all these elements with something else.Deleting will make this shit unusable.From now on, the world is open..Trzeba zmienić dystrybucję..1-usunąć gogle..2-usunąć tubę..3-usunąć pocztę..4-zastąpić te wszystkie elementy czym innym.Usunięcie spowoduje niemożliwość używania tego gówna.Od tej chwili świat stoi, przed wami otworem.\n\nunfortunately this process will take a while for me to finish but i will slowly remove these clowns from my life",
				"added": 1599914933
			},
			{
				"comment_id": 9,
				"body": "> [toppfungg](#comment_20_16j1WtLKAKpemCzA2suD1aaWfie2854o5T): 我不知道你说的明网是包括哪一些。理论上，是没有网站知道你是否匿名的。之所以出错的原因，应该是在匿名状态，IP地址不断更换，被访问网站出于安全考虑，对连接进行了重置。解决的办法，就是延长Tor的链路变更间隔，将默认时间加大。应该是需要更改torrc。但是，这样一来，也会将匿名效果略微降低。\n\nI know several legit websites on which i can register/login with TOR and even use a disposable email and stay logged in for 10 hours in a row until i close Tor without having any issues. No ReCaptcha, no suspicious-activities-messages, no auto-log-out every 10 minutes...",
				"added": 1600006314
			},
			{
				"comment_id": 10,
				"body": "> [driud](#comment_126_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): If they are legal? It cooperate..Jeśli są legalne? To współpracują.\n\n100% legal",
				"added": 1600007125
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 6,
				"body": "i would like to see IPFS and ZeroNet wrapped together in a single portable cli app with no Web UI or ZeroHello",
				"added": 1599910300
			},
			{
				"comment_id": 8,
				"body": "> [beenotung](#comment_52_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): Without ZeroHello (or other alike home page), how would new users discover other zites?ZeroHello links to \"popular zites\" like ZeroTalk, ZeroSites, and ZeroMe, which is a major way to discover other Zites\n\nThat's true ! ZeroHello should not be removed from the official ZeroNet application. What i meant is, that a single portable merged version of IPFS and ZeroNet , similar to ffmpeg , would be helpful to build decentralized apps",
				"added": 1599994749
			},
			{
				"comment_id": 11,
				"body": "> [kec](#comment_27_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): Portable - perhaps wrapped in a single, deployable package like a Linux AppImage? I much prefer appimages over both docker and snaps since things are kept entirely in the userspace.\n\nyes i prefer them too",
				"added": 1600011794
			}
		],
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 12,
				"body": "> [thorburn](#comment_147_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Granted the EU is a giant parasite  [...] \n\nYou can definitely take this for granted \n\nRegarding financial independence the EU is the WORST. They are introducing more and more restrictions. Slowly and secretly. Total surveillance through the back door.\n\nThere also appears to be a trend in which exchanges (within the EU) are freezing funds, blackmailing users to send them beside other documents a copy of their ID. They are probably forced to do so. Pretty fascist methods in my eyes.",
				"added": 1601499678
			},
			{
				"comment_id": 13,
				"body": "> [xcape2net](#comment_791_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The US has required ID's to exchange fiat for cryptocurrency for years.  It is very difficult, but not impossible yet, to get around this.\n\nThe US appears to be much more crypto friendly than the EU. I see you have thousands of active crypto ATM's around the country. My country keeps shutting them down very consequently. Life expectancy of an ATM here is a few months at best.",
				"added": 1601561486
			},
			{
				"comment_id": 14,
				"body": "> [driud](#comment_133_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH):  Why Do this?\n\nso they can blackmail you",
				"added": 1601561721
			},
			{
				"comment_id": 15,
				"body": "> [thorburn](#comment_149_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): If an exchange holds your property... [...]\n\nI don't know how the law handles property rights in crypto. Is the one who has the private keys really the owner? What if 10 other persons also have them?\n\nThey will probably say something like that their systems detected suspicious acivities and they need prove the coins aren't stolen. I think no exchange like to do those things and they are put under enormous pressure by governments.",
				"added": 1601704890
			},
			{
				"comment_id": 16,
				"body": "If the EU is using such means ( stealing funds and blackmailing ) against their own citizens .... i wonder what this so called \"project of peace\" is going to do next",
				"added": 1601727071
			},
			{
				"comment_id": 17,
				"body": "> [thorburn](#comment_152_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): And I don't have much sympathy for someone complaining when they swim in a pool with sharks and get bitten\n\n I agree with you in almost everything you say but i am not complaning about anything, just pointing out what the EU is",
				"added": 1601729549
			},
			{
				"comment_id": 18,
				"body": "> [thorburn](#comment_152_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): 10 x ounces of gold\n\nthe EU is working hard on making it impossible to buy precious metals anonymously",
				"added": 1601729724
			}
		],
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 19,
				"body": "ZeroNet itself is the perfect data storage tool to make your data always accessible and untouchable. Even for very sensitive data like recovery seeds for a bitcoin address.",
				"added": 1602242370
			}
		]
	},
	"comment_vote": {
		"72_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"118_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"119_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"26_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"20_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"27_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN": 1,
		"600_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"133_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	}
}