{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1582916125,
			"title": "Linux从零到高手的进阶心得(转)",
			"body": "从2006年毕业至今，从事IT行业已经接近8个年头。\n\n一路走来有很多心路历程和技术心得都写在了51CTO的博客中，不少文字现在看来已显稚嫩，但是这正是我真实的成长之路。这八年，从最基础的网络管理员开 始，从最下层的IT工作比如说做水晶头做起，慢慢的走过国企、干过外企，做过网络管理员、系统工程师、项目经理、Linux讲师，经历过众多重大的项目 （包括政府部门、国家重要民生相关项目），流过汗熬过夜，写过心得出过书，不谦虚的说，从很多方面来看，可以算得上是个IT老鸟。所以经常也有不少认识和 不认识的朋友处于看得起的态度来问我一些技术和非技术的问题。\n\n今天我希望再一次的站在一个自诩为老鸟的位置上，谈谈我的个人观点。仅供希望入行的朋友参考，可探讨，请不要针对本文中任何观点进行钻牛角尖的行为，不认 可本人观点者请要本着友好交流的态度进行沟通，但是绝不接受挑衅性的问题，如有人认为臭屁一堆，请立即关闭本页以免耽误您的时间。\n进阶心得之一：积沙成海。\n\n还记得刚上大学那会儿学C++编程，学了很久还是云里雾里，每次抱起书本都觉得很多地方因为“没有基础”而不能理解，所以怨天尤人，责怪学校没有按照正常的认知顺序来教学。由此排斥学习C++，也因此拿到了大学里面第一个补考。\n\n面对绕不过去的补考，我只有定下心来兴平气和的看了一个暑假的C++，结果在随后的补考中考出了85分。然后以后每次再抱起当年看不懂的课本时，居然发现 当年看不懂的地方现在已经毫无理解问题了。我相信大家至少有这样的体验：小学一年级的时候也没觉得自己能学好数学，到了三年级再看一年级的数学，绝对有种 “怎么可能学不会”的感慨。\n\n学习一门技术大多时候并没有一步一个脚印的方法，太多地方给你有必须“跳跃”的体验，这时候最需要做的就是沉下心来，慢慢的领悟和吃透这些你看不懂的东 西，只有慢慢积累的量变过程才会终于有一天让你醍醐灌顶茅塞顿开。特别是希望从事IT的入门者、初学者，你们有太多的顾虑，认为自己非专科毕业，总有是不 是不适合从事这个行业的想法，我可以很负责任的告诉你，不管是在Linux行业，还是在更大范围内的IT行业并没有太多人是所谓专科毕业的，我认识太多人 大学学的专业是非IT类的，甚至还有学中医的医生转行做了IT，所有人一开始都会怀疑自己是否合适做这一行业，其他的我不知道，但是我可以很肯定的告诉 你，如果你想进入这一行，任何时候你都可以。\n\n条件是什么？是你活着。但是必须清晰的看到，要从事这一行你必须有一定时间的积累，你必须每天都要学习心得知识，最简单的方式是，抱着一本书，吃透，然后下一本。这是一个积沙成海的过程，谁也无法越过。\n进阶心得之二：思而再学。\n\n古人云学而不思则惘，死而不学则怠。从来学习就要注意学思结合，不懂的东西你看再多遍如果不加以思考，你永远不懂。是什么固然重要，但为什么才是重中之 重。IT是一门科学，有了很好的基础原理积累，你的学习之路只会越来越快，因为很多东西在后期你要使用逻辑思维进行思考，你甚至可以不知道结果，但是你必 须知道方法。你必须清晰的认识到，你今天所学习的东西越多，你就会发现你不会的东西越多，如果你不希望排山倒海般的新知识朝你涌来的感觉，你必须有加速你 学习的能力，而这些就必须依赖你的快速学习，所以思而再学尤其重要。\n进阶心得之三：提问艺术。\n\n你会遇到各种各样的问题，解决问题的过程大多非常辛苦，因为有太多的东西没有旁人的协助，你只能依靠自己。\n\n这时候你必须依靠你手头上的各类书籍、资料、通过谷歌百度等各类搜索引擎来解决你的问题。同时，你也可以加入一些QQ技术群来寻求帮助。如果是通过后者， 请一定要注意提问的方式，把你的问题描述清楚（非常重要），把你寻求解决的过程描述清楚，好让他人在充分理解你的问题。你要知道，大家都很忙，在问问题时 请一定要言简意赅的让对方了解你的问题，否则你提出的问题往往没有人会理会。\n\n我见过太多人问类似于这样的问题：我的***软件出了问题了，不知道怎么解决，大家有会的么？这种等靠要的方式万万不可取，徒增鄙视，而且多次后打击自己的信心。\n进阶心得之四：授己以渔。\n\n我必须说，使用谷歌百度等各类搜索引擎来解决你的问题将会成为你今后的主要工作之一。\n\n我曾经到不少客户的疑难现场解决问题，说实话，有不少问题我也不知道究竟是什么问题、为什么会出现这种问题以及如何解决。但是我所采取的方法都是一致的： 找到系统或者应用的出错日志，网上进行搜索。基本上靠这种方式我解决了不少困扰了客户很久的问题。究其答案我想其实很简单，只是因为我会谷歌而你不会而 已，非常简单。我坚定的认为，如果没有谷歌百度，有很多问题对我来说是很难解的。\n\n我一直有这样的想法：从某种意义上来说，各类搜索引擎是IT人很重要的生存因素。所以，你必须学会这种技能。\n进阶心得之五：贵在坚持。\n\n作家葛拉威尔在《异数》一书中指出：“人们眼中的天才之所以卓越非凡，并非天资超人一等，而是付出了持续不断的努力。只要经过1万小时的锤炼，任何人都能从平凡变成超凡。”他将此称为“一万小时定律”。\n\n要成为某个领域的专家，需要10000小时，按比例计算就是：如果每天工作8个小时，一周工作五天，那么成为一个领域的专家只需要5年，这就是所谓的一万小时定律。\n\n坚持是通向成功的法宝，你必须有坚韧的毅力熬过你进入IT行业的这5年。\n\n最后我想说，良好的入门环境也是非常重要的。这就如同习武大师宁可将武功传授给毫无功底的人也不愿意教有点猫狗功夫的人，因为一旦养成坏习惯就很难改正了。\n\n对于广大希望学习Linux的人来说，选择一本优秀的入门书非常重要，笔者当年也看过不少公认的好书，包括红帽的官方教程等。笔者也花了一年的时间酝酿并 最终写成了极其适合入门者阅读的Linux读本——《Linux系统命令及Shell脚本实践指南》，本书作为一本面向Linux入门用户的书籍，力求语 言通俗易懂，用例简单明了，便于读者阅读领会。同时，全书穿插了不少要求读者动手实践的内容，不但可加深读者对内容的理解和消化，同时也可通过动手实践激 发读者对Linux系统和Shell编程的兴趣，从而更好地驱动读者学习。本书根据笔者多年来Linux环境运维管理工作的经验编著而成，内容丰富，且注 重实践讲解，非常适合Linux初学者和基于Linux平台的软件开发者学习或查阅。有兴趣的朋友可以在京东、当当、亚马逊上试读。\n\nhttps://www.ttlsa.com/news/linux-from-zero-to-master-the-advanced-experience/",
			"added": 1582916124,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582918201,
			"title": "使用Linux系统的都是高手？使用Windows系统都是小白",
			"body": "说一下吧！小编当年为什么使用Linux，从而调入了这大坑里面。\n\n那是遥远的记忆了，因为那个时候我买了一台上网本。网上买的，又是在农村不好退货。但是这个上网本让小编我心寒了，因为看看视频动不动蓝屏了。于是小编更换了无数ghost系统。（为什么会安装，也是买了一台淘宝二手电脑，用了一天系统崩溃了。拿去电脑店吧人家也不会，所以自学会了。原来笔记本不支持usb启动。）\n\n但是用这个笔记本不到三分钟老是蓝屏，不得已而为之拿去给人家修，以为是硬件问题啦。但是跑了n家修电脑也没用没有发现硬件问题。他们也无法解决。一个偶然的机会让我知道了，Linux系统不会蓝屏。于是乎就把Linux系统安装到了上网本上了。\n\n说一下吧！小编当年为什么使用Linux，从而调入了这大坑里面。\n\n那是遥远的记忆了，因为那个时候我买了一台上网本。网上买的，又是在农村不好退货。但是这个上网本让小编我心寒了，因为看看视频懂不懂蓝屏了。于是小编更换了无数ghost系统。（为什么会安装，也是买了一台淘宝二手电脑，用了一天系统崩溃了。拿去电脑店吧人家也不会，所以自学会了。原来笔记本不支持usb启动。）\n\n但是用这个笔记本不到三分钟老是蓝屏，不得已而为之拿去给人家修，以为是硬件问题啦。但是跑了n家修电脑也没用没有发现硬件问题。他们也无法解决。一个偶然的机会让我知道了，Linux系统不会蓝屏。于是乎就把Linux系统安装到了上网本上了。\n\n那个时候我对Linux系统一窍不懂，没有C盘一切都是文件。简直是天书。但是安装上去之后，这个上网本不再蓝屏了，小编很震惊了。我靠电脑还可以不蓝屏的。\n\n不过好景不长，虽然使用Linux系统不会蓝屏了，用它看视频也可以坚持几个小时使用，但是上网本开始黑屏了。（后来知道内核问题）\n\n再用了半个月，然后安装好了Windows把它卖出去了。亏了几百块钱吧。\n\n说一下吧！小编当年为什么使用Linux，从而调入了这大坑里面。\n\n那是遥远的记忆了，因为那个时候我买了一台上网本。网上买的，又是在农村不好退货。但是这个上网本让小编我心寒了，因为看看视频懂不懂蓝屏了。于是小编更换了无数ghost系统。（为什么会安装，也是买了一台淘宝二手电脑，用了一天系统崩溃了。拿去电脑店吧人家也不会，所以自学会了。原来笔记本不支持usb启动。）\n\n但是用这个笔记本不到三分钟老是蓝屏，不得已而为之拿去给人家修，以为是硬件问题啦。但是跑了n家修电脑也没用没有发现硬件问题。他们也无法解决。一个偶然的机会让我知道了，Linux系统不会蓝屏。于是乎就把Linux系统安装到了上网本上了。\n\n那个时候我对Linux系统一窍不懂，没有C盘一切都是文件。简直是天书。但是安装上去之后，这个上网本不再蓝屏了，小编很震惊了。我靠电脑还可以不蓝屏的。\n\n不过好景不长，虽然使用Linux系统不会蓝屏了，用它看视频也可以坚持几个小时使用，但是上网本开始黑屏了。（后来知道内核问题）\n\n再用了半个月，然后安装好了Windows把它卖出去了。亏了几百块钱吧。\n\n但是从此以后认识了在Windows之外还有个Linux系统。让我大开眼界。\n\n后来看到Linux系统大多数都是命令，那么敲起来那个炫酷啊，在外人面前就是高手啊。\n\n为了满足小编我小小的虚荣心，也是为了装逼。没错一开始的确是为了装逼用的。\n\n因为小编本来就对这些电脑有兴趣的，因此特地深入了解了进入。\n\n从哪之后，我知道了电脑有权限的，这是在Windows系统上从来不知道的事情。\n\n还了解到了更多的其他的系统的信息。\n\n知道了内核什么编译git等等一系列的东西，而在Windows上我却是一无所知，只会鼠标点击。反而是操作起来Windows更为得心应手，因为以前不会的，就可以通过搜索解决，或者是粗略知道是如何解决问题的。\n\n一入Linux大坑，从此让我从一个小白变成了一个大白，这是以往不敢想的。\n\n接着又从一个普通人变成一个码农……\n\n总得来说使用Linux系统的一定会使用Windows，反过来就不一定了。",
			"added": 1582918199,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582918649,
			"title": "来自Linux小白的叹息",
			"body": "……\n\nA：***，计算机很厉害，一分钟打字可以打100多个呢！\n\nB：***也很不错啊！那图文编辑能力很牛的！\n\nC：哎呦那怎么了，***都已经让老师叫过去做成绩表了！\n\n……\n\n以上这段谈话是高中时期的我听同学口中常有话题的一角。我自己就是被这些无聊的话题，一步步带上了计算机学习道路，谁知这是一条“不归路”。一路走来伴随着自己的《计算机基础1-4》、《office基础》、《数据库基础教程》、……（已经记不清楚了）这些书籍都已经尘封。现在只有一些关于Linux的书籍还放在自己的书桌上，诸如：《Linux就该这么学》，《Red Hat Linux指南》……。这篇文章对于一名计算机专业不优秀的学生来说，是自述、，是抱怨，更是对自己没有好好学习以至现在仍是“小白”的检讨。\n\n哎，选择计算机专业就是一个错误！\n\n2000年后国家发展速度飞快，各种新鲜事物不断涌现，众多新兴的企业应运而生。对于计算机人员的需求也就变得多了起来。记得自己家的一位亲戚学习计算机专业，2005年毕业，毕业就业就能挣到2500+（2005年那会儿可是一笔不菲的工资）。加上身边的同学都喜欢计算机（或者可以说喜欢电脑游戏），自己出于对未来的考虑，加上自己本身对计算机有着很浓厚的兴趣（声明一下不是喜欢玩游戏的那种哈），07年在上中职的我毅然决然的选择了计算机专业。\n\n但是殊不知自己在选择计算机专业的时候的高薪高热职业，在自己学习五年毕业以后，既然变成了“臭大街”职业。不过让自己庆幸的是自己选择的并非计算机应用专业，而是软件专业！！！\n\n哎，为什么要选择软件专业！\n\n然而！……\n\n07年选择计算机专业的时候，专业课里有一门课是关于Database(数据库)的。自己这门课的成绩那叫一个优秀，每次测试都是班级里第一名，特别是代码编写能力非常优秀。出于自己当时对代码编写能力的自信，在读大学的时候果断的选择的软件专业。\n\n殊不知这个软件专业与自己想象中的软件专业完全是两个概念。在云里雾里待了好几年之后的结果就是自己学习的软件专业也只是勉强应付过了考试，拿到了毕业证书而已。毕业之后由于工资原因和自身学习情况，没有在从事软件行业。如今自己毕业已经这么年了，有时候有点后悔，为什么自己没有好好学习呢！事已至此，又能怎样呢？\n\n哎，为什么不选择Linux！\n\n2016年末自己已然毕业4年，对于学习似乎仅仅停留在工作中了，不过偶然机会听说了Linux运维人员待遇非常好，本着想要提升自己收入的态度靠近了它。时光倒流5年，当时还是学生的自己，就已经听说过Linux这个系统，不过仅仅停留在道听途说的地步。身边有几个爱折腾的同学也只是一时兴起才会装一个系统玩玩，从未想过学习。虽然Linux是那么优秀，但是那会儿的我们还是无法完全接受他！\n\n    提到Linux的优点，首先就是他的开源，任何人都是可以查看他的源代码的，这使得他特别的安全，而windows则不开源，所以你要经常的打补丁，修补漏洞之类的。其次，Linux内核优化的好，没有哪个Linux需要右键的刷新键（红旗Linux是为了国人的使用习惯加的），而windows则不同，微软的系统非常的复杂，而且运先行效率相对Linux要低很多。虽然Linux在桌面市场没有优势（只占1%多一点的占有率），但他在服务器行业的地位那是无敌的（20%多）。Linux占用系统资源特别少，早期的Linux，64M内存就能跑的很流畅，这也是他的优势。\n\n    学习Linux其实很是枯燥，再加上现在的自己有工作、生活中的种种事情，没有办法完全静心学习。所以常常看着放在书桌上的Linux相关书籍思考：为什么在校时期不学习Linux呢？\n\n然而这已是无法改变的事实！\n\n时过境迁，时光已经匆匆走过，过去的已经成为了历史，现在开始学习也不算晚。所以，应该把握好自己现有的时间，无论自己的出发点是什么，或为了爱好，或为了生活，或为了技术……都要坚持下去。坚持了不一定会有收获，不坚持肯定没有收获！\n\n对于我而言，由于现在工作和生活的原因没有更多的时间学习Linux，现在还是一名Linux小白。不过还是坚持每天半个小时阅读下相关linux咨询，提高自己对Linux的认识。\n\n文章写得并无任何水平，只是希望能够表达一下一个对于计算机专业爱好者的失败学习经历。我想肯定有和我一样的经历的朋友，我想悄悄的问你们一句，你们后悔吗？\n\n我不后悔，毕竟我现在还能去学习！",
			"added": 1582918646,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582959815,
			"title": "有简单易学又强大的编程语言吗？",
			"body": "",
			"added": 1582959811,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582959836,
			"title": "梦寐以求的操作系统是什么样的？",
			"body": "",
			"added": 1582959831,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582967290,
			"title": "最好用的Linux系统桌面版",
			"body": "这里要记住的第一条规则是：没有最好的 Linux 发行版。说真的，没有！但是对每个人来说会有一个最好的 Linux 发行版。此外，你认为最适合自己的 Linux 发行版通常会随着时间的推移发生变化，以匹配你的经验级别。\n\n\n考虑到这一点，让我们从以下3个方面开始：轻松、满足和挑战。\n\n最佳发行版 – 最易使用的发行版\n\n对于希望快速使用 Linux 和大量软件/应用程序而不需要命令行的用户。或者，你只是想简单地尝试一下 Linux 。对于那些用户我将会推荐……\n\nUbuntu —— 一个完整的桌面 Linux 操作系统，免费提供比其他发行版更大的社区支持。Ubuntu 社区基于 Ubuntu 宣言中的理念：软件应该是免费的，软件工具应该使用用户的当地语言，人们应该可以自由定制和以他们认为合适的任何方式改变他们的软件。\n\nManjaro —— 基于 Arch Linux 的用户友好的、面向桌面的操作系统。主要功能包括直观的安装过程，自动硬件检测，稳定的滚动释放模型，能够安装多个内核，特殊的 Bash 脚本管理图形驱动程序和广泛的桌面配置。用户将从支持和充满活力的 Manjaro 社区论坛中获益。\n\nLinux Mint —— 一个基于 ubuntu 的发行版，其目标是通过包含浏览器插件、媒体编解码器、支持 DVD 播放、Java 和其他组件来提供更完整的开箱即用体验。它还添加了自定义桌面选项和菜单、一些独特的配置工具和基于 web 的包安装界面。Linux Mint 与 Ubuntu 软件库兼容。\n\n也可以了解一下 Elementaryos.org 。\n\n最佳 Linux 发行版——最满意的发行版\n\n下面的发行版与上面的非常相似。然而，默认安装不会包括那么多酷但臃肿的特性。这需要更多的定制和研究。这不应该是困难或令人沮丧的，而是令人满意的。\n\nFedora ——（以前叫 Fedora Core ）是由社区支持的 Fedora 项目的 Linux 发行版。商业版红帽企业Linux发行版的上游来源。Fedora 包含免费和开源的许可软件包，目标是在与上游 Linux 社区密切合作的同时，走在技术的前沿。Fedora Project 还为游戏、安全、设计、科学计算、机器人等领域发布了 Fedora 的定制版本，名为 Fedora spin 。Fedora 的短版本生命周期为13个月，它一直保持着处于极度前沿意味着包更新频繁。这可能会让一些人感到害怕，或者让喜欢使用最新软件的人感到满意。\n\nDebian —— 当然，人们通常想要的是应用软件。Debian 让你无需预先安装就可以轻松访问这些文件。Debian 有超过 60000 个软件包（预编译软件，打包成很好的格式，便于安装在你的机器上）——所有的都是免费的。如果你想来一些挑战，可以尝试安装 Debian Testing 版或 Debian SID ——（我最喜欢的发行版）。\n\nopenSUSE —— openSUSE 项目有三个主要目标：使 openSUSE 成为最容易获得的 Linux 和使用最广泛的 Linux 发行版；利用开源协作，使 openSUSE 成为世界上最可用的 Linux 发行版和桌面环境，为新的和有经验的 Linux 用户服务；极大地简化和开放开发和打包过程，使 openSUSE 成为 Linux 开发人员和软件供应商的首选平台。openSUSE 现在也提供滚动发行版。\n\n还可以了解一下 solus-project.com（一个全新的 Linux 发行版）。\n\n最佳 Linux 发行版——最具有挑战性的发行版\n\n下面的发行版关注的是轻量级、简单，但比大多数发行版灵活得多。在安装过程中，你会注意到这些发行版只会安装你显式命令它们安装的内容。\n\nArch Linux —— 一个独立开发的面向有能力的 Linux 用户的发行版。它使用自己开发的软件包管理器 “pacman” 为最新的软件应用程序提供完整依赖跟踪的更新。在滚动发布系统上运行，Arch 可以从 CD 安装，也可以通过 FTP 服务器安装。默认安装提供了坚实的基础，也允许用户创建自定义安装。此外，Arch 构建系统（ABS）提供了一种轻松构建新包、修改包配置以及通过 Arch Linux 用户库与其他用户共享这些包的方法（我已经使用 Arch 一段时间了，见上图）。\n\nSlackware——一个先进的Linux操作系统，设计的首要目标是易于使用和稳定。既包括最新流行的软件，同时又保持传统的感觉，提供简单和易用性的灵活性和功能，Slackware列出了世界上最好的软件包。最初于1991年开发的类unix Linux操作系统，现在得益于全世界数百万用户和开发人员的贡献。Slackware Linux系统为新用户和经验丰富的用户提供了一个功能齐全的系统，可以适用于从桌面工作站到机房服务器。Web、ftp和电子邮件服务器已经准备好开箱即用了，还有许多流行的桌面环境可供选择。为希望开发或编译附加软件的用户提供了完整的开发工具、编辑器和开发库。\n\nGentoo—面向开发人员和网络专业人员的通用和快速Linux发行版。Gentoo Linux有一个名为Portage的高级包管理系统。与二进制软件发行版不同，源代码是根据用户的首选项在本地编译的，通常针对特定类型的计算机进行优化。选择这个名称是为了反映特定于机器的优化的改进速度很快，这是Gentoo的一个主要特性。Gentoo包管理被设计成模块化、可移植、易于维护和灵活的。\n\n还可以查看TrueOS（基于类unix的FreeBSD，能够运行Linux应用程序）。",
			"added": 1582967284,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1582967432,
			"title": "Linux 桌面系统的优势",
			"body": "当我放弃 Windows 转而使用 Linux 系统 后，我的信心不断增长。出于安全方面的考虑促使我选用 Linux 系统，但是我很快发现了很多使用 Linux 桌面系统的优势。\n\n对于那些还对 Linux 系统犹豫不决，或是那些不甚了解 Linux 系统的用户，我将通过这篇文章给大家介绍一些使用 Linux 桌面系统的优势。\n免费才是王道\n\n首先， Linux 系统完全免费。你无须为使用的操作系统或软件花费一分钱。除了免费获取软件产生的经济效益之外，你还可以在 Linux 系统中随意使用一些当前很流行的软件，比如文字处理软件和照片编辑软件——由于费用方面的原因，我们可能不太愿意花钱去购买这些软件。\n\n微软的 Office 办公软件几乎是处理各种类型文档的一种标准软件了，但是它每年的费用竟高达 70 美元。然而，你却可以免费使用 LibreOffice 软件来代替，它同样可以处理各种类型的文档，而且使用也很方便。\n\n免费软件还能让您有机会尝试新的功能，并通过它们寻求商务和休闲的新方式，而且你也不需要支付任何预期的费用。\n\n与其费尽周折的去衡量 Mac 或 Windows 系统的优点，你可以考虑下在上百款不同风格的 Linux 发行版中选择一款最适合自己的操作系统。\n\nLinux 系统甚至在硬件方面也为用户节省了不少钱，比如有些厂商——尤其是戴尔公司——为购买预安装了 Linux 系统的电脑的用户提供打折优惠。这些电脑的价格相对来说比较便宜，因为用户无须再花钱购买微软的 Windows 系统许可证。\n随心所欲的系统定制\n\n其次，在 Linux 系统中，你可以对系统功能进行任意更改。 Linux 生态系统中的核心项目之一就是桌面环境——它是一些由基础的用户程序和可视化元素组成的一个集合，比如状态栏和启动器，这些元素构成了用户与计算机的一个交互界面。\n\n有些 Linux 发行版还预安装了桌面环境。比如， Ubuntu 系统就预安装了 Unity 桌面。其它系统，比如 Debian 会在系统安装的过程中让用户选择需要的桌面环境。总之，在 Linux 系统中，用户都可以随意更换他们喜欢的桌面环境。\n\n大多数的 Linux 发行版都支持（也就是兼容）那些非常流行的桌面环境，因此，找到一款适合自己的桌面系统也非常容易。在桌面系统这个万花筒里，你可以找到界面华丽的系统桌面，比如 KDE Plasma 或者 Gnome，以及轻量级的系统桌面，比如 Xfce 和 MATE 桌面。使用任一款系统桌面，你都可以通过更改主题、系统托盘和菜单，以及仿照其它用户的桌面环境来进一步定制自己的桌面环境。\n\nLinux 系统的可定制特性完全超出你的想象力。如果你更看重系统的稳定性，你可以使用 Mint 这个发行版系统，它对硬件的兼容性非常好，而且也能确保系统顺利更新。\n\n除此之外，如果你希望及时领略前沿，你可以安装 Arch Linux ，每一款软件只要开发者一发布，你就可以进行得到最新更新。\n\n如果你介乎于两者之间，既想要稳定的系统，也想运行一些几个崭新的程序，你可以下载程序的源代码（程序员所开发的代码文件），然后自己进行编译。这就需要你使用工具来编译源代码，生成一堆你的电脑可以运行的 0 和 1 组成的二进制文件。\n\n你可以使用自己喜欢的任何方式去折腾属于自己的 Linux 系统。\n无与伦比的安全性\n\n第三，多才多艺的 Linux 系统还有一个更重要的特性：安全。\n\n起初，尽管有一些针对 Linux 系统的病毒，但是跟 Mac 系统比起来，已经屈指可数了。更重要的是，实际上 Linux 系统的核心代码是开源的，对用户完全透明，这意味着你的 Linux 系统漏洞更少。\n\n一些专有（比如，不开源）的操作系统被任务会影响用户安全，因为它们会启动一些实现方式糟糕的、不透明的进程，从而造成了巨大的威胁。\n\n比如说， Windows 系统在升级的过程中，默认情况下不会检查加密签名来验证更新文件的可靠性。\n\n而使用 Linux 系统，你可以在选择更新时通过签名检查进行严格的细粒度控制，大多数的发行版在系统更新时都默认强制安全检查。这种责任感源自于 Linux 系统的开源开发模式所带来的透明度。\n\n像 Arch Linux 这种滚动发行版则增加了更多的安全性设置，因为一些重要的补丁一旦通过验证， Arch Linux 就会马上可以使用。你可能很难找到那些每天都提供更新的单一主流操作系统，但是这样的 Linux 发行版却有很多。\n天生的编程环境\n\n很多开发者或者任何对编程有兴趣的人都得益于 Linux 桌面系统中集成的强大开发工具。其中包括那些最经典的编程工具，比如 GNU C 编译器，或者 GCC 和 GNU Autoconf 工具都是 Linux 系统中一些非常重要的基础工具。\n\nLinux 系统的大多数默认软件库都支持数十种编程语言，它包含了发行版中可以使用的预编译软件。\n\n很多因特网的基础架构和许多联网设备都运行于 Linux 系统上——从服务器到智能设备，比如安防摄像机和恒温器。在 Linux 系统下开发调试这些设备的软件非常容易。如果你有一个跟计算机相关的项目， Linux 系统可以完美地支持你完成这个项目。\n社区是 Linux 系统发展的关键\n\n最后一点， Linux 系统拥有一个团结且友好型的社区。由于 Linux 在桌面系统是一个相对小众的桌面操作系统，仅占有 3% 左右的市场份额，因此， Linux 社区更希望有更多的潜在用户加入进来。\n\nLinux 系统有很多的用户论坛，尤其是对新手比较友好的 Ubuntu 系统论坛，它包括非常丰富且全面的知识来帮助用户解决一些基本的系统问题。很多高级用户更倾向于使用 Linux 系统，因此那些 Linux 发行版都拥有非常非常详尽维基文档，以指导用户完成高级的系统应用项目。\n\n甚至还有业余的 Linux 论坛和 Reddit 讨论区，所涉及的范围包括从对比 Linux 系统各种应用软件到炫耀桌面主题等。总而言之，这是一个比 Windows 用户群更加友善的社区。\n\n我沉浸在 Linux 的世界里两年多了，我更加相信 Linux 系统对每一个用户都有所帮助。我希望这篇文章能够让你了解到 Linux 桌面系统的各种优势。但是真正的乐趣是从中发现自己感兴趣的东西！\n\nvia: What a Linux Desktop Does Better\n\n作者：Jonathan Terrasi 译者：rusking 校对：wxy\n\n本文由 LCTT 原创编译，Linux中国 荣誉推出",
			"added": 1582967425,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583300061,
			"title": "linux缺少什么软件?",
			"body": "障碍在于几个方面：首先就是前面说过的驱动问题，这个法律矛盾短期内不会有合适的解决方案，Android目前是通过对硬件接口的再包装来规避这个问题，但Android是Google主导，可以这么做，而且也有足够的实力让厂商接受它的做法，其它Linux目前来说可能性不大，目前大部分Linux都是采用厂商提供的功能有限的源码来编译驱动，与windows下的全功能驱动还是有差别的，最典型的就是节能功能差别，这也是很多电脑装了Linux比跑Windows更费电的原因之一。其次是应用软件的问题，一是`商业软件`，一是`娱乐软件`（游戏），商业软件因为市场及商业利益的原因，不太可能支持Linux桌面，即使是Mac应用也是这几年才开始有一些，但比Windows还是差很多。最后是盗版和习惯的原因，国内来说，盗版的Windows及windows下的软件用得太多了，大家都不觉得用windows有经济压力，习惯来说则是以前大家都是用Windows，要改别的很难，即使Mac现在已经这么好的，但很多人（特别是中国的用户）买了苹果电脑还是要装windows。但希望也不是没有，现在的趋势是网络化，会有越来越多的应用跑在云端，而客户端使用浏览器，这样其实是没有平台障碍的。",
			"added": 1583300117,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583301343,
			"title": "linux 破解游戏交流",
			"body": "",
			"added": 1583301334,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583377396,
			"title": "appimage和 aufs技术有关系吗？",
			"body": "",
			"added": 1583377386,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583399499,
			"title": "Gentoo的哲学",
			"body": "我之所以创建Gentoo是因为之前我没有办法找到一种我喜欢的Linux发行版。我用Linux发行版时， 其中最重要的一件事情是发行版里管理整个系统的系统工具本来是应该让用户工作更容易， 它似乎一直希望用户能够感应到这点并且能够让系统去做用户要做的工作。但是当我告诉系统我想要做些什么的时候， 似乎它更在意并且不断的传输我一个信息：“它想让我做什么！”\n\n所以我创立了Gentoo Linux并且开始设计了一种比以往的系统管理工具更为强大的Portage工具。为了完成这个目标， 我必须让它能够满足“我想要做”的事情还要让它知道并且满足其他我想到的事情。\n\n如果想要知道一个软件包是如何建立的，你可以看一下相对简单易懂的ebuild文件。如果你想知道如何有效的创建软件包，你可以参考“USE”变量。如果你想加一个软件包， 你可以考虑在现有的“树”下建立一个新的ebuild。如果你想用其中一个软件包， 最简单的方法就是emerge， 而软件包的依赖性可以自动解决。\n\n很多人都青睐Portage的工作原理， 这也是GENTOO能在短时间成长起来的原因。GENTOO系统已经成为一种“from source”的发行版，但是要注意的是GENTOO的核心工作原理并非“from source(依赖来源）”。 虽然“from source(依赖来源）”是GENTOO的重要特征之一， 将来也是GENTOO必要运行的因素之一， 可是它不是唯一兼最基本的特征。而真正的最基本特征是让所有人没有拘限地做他们想做的工作。\n\n总结一下GENTOO的“核心”特征， 我们可以想象一位用户坐在一台LINUX系统前面。“他／她想要做什么？”GENTOO的工作原理就是在没有一个指定的方法下， 让这个用户可以随心所欲的做他／她要做的事情。 \n\n 在GENTOO刚刚诞生的时候， 用户说明里缺乏一个简便的可以从来源建立软件包的方法。而现在，我们已经将它实现并且运用的很好。但是现在我们仍然缺乏一个有效的非创建型软件包的支持方安， 虽然PORTAGE系统在一开始就已经支持了二位元包， 而这个正是我们在努力的工作。\n\n有一点很重要需要说明的是我们的工具支持二位元包是因为它在Linux社区里广泛的使用和需求。如果我们的工具不支持二位元包， 那么我们就无法向外宣称我们的工具是为了让任何一个用户做他想要做的任何工作。如果我们有意的排除二位元文件的支持， 那么事实上我们是在干涉用户自己想要解决问题的方法，从而将我们自己的愿望或者我们想要用户解决问题的方法强加到用户端。同样如果我们不建立二位元包，我们也无法肯定工具可以和二位元包兼容， 也无法确定用户可以建立二位元包， 也不能够论证我们的工具可以兼容二位元包。除了原理因素外， 还有很多实际因素使我们必须要考虑建立二位元包。\n\nGENTOO原理如果用一段文字表达就是这样。每个用户都有他／她需要做的事情。GENTOO的目标或者主旨就是设计出一系列工具和系统，从而可以让用户愉快并且有效率的做完他们的事情。我们的工具让用户用上去愉快，并且让他们知道和感慨LINUX和自由软件社区是多样化和自由软件的弹性。而这个目标只有在本身工具可以直接反应出用户自己的愿望， 然后把所有的可能性公开成一个最终的实体里（源码）。 如果工具是要用户使用一个特定的方法来工作的话， 那么它是违反而不是符合用户而工作。我们发现还是有一些情形， 当中将一些“我们”的愿望强加在用户上。这个是其中的缺点， 是违反了GENTOO的原理。\n\n从另一方面来说， GENTOO的原理是创建一个更好的工具。当工具出色的工作的时候， 你几乎可以感觉不到它的存在， 因为它不会干涉也不会让你知道它的存在。 如果你不想和它互动， 它也不会强迫。 \n\n将来GENTOO的目标就是继续努力创造接近完美的工具。工具可以适应不同用户的需求而变的无比强悍。当你发现一个工具可以做你想要做的任何事情的时候， 你会不喜欢它吗？这种感觉不会棒吗？我们的任务就是将这种感觉带给更多的人们。",
			"added": 1583399488,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583402172,
			"title": "Archlinux Or Gentoo Linux??????????????????我真的不理解",
			"body": "有意义吗?\n\n将原来由专人来封装的工作留给用户, 费尽心思只为在CLI模式下能有一个更好的观感, 用尽力量去挑战测试的力量以及紧耦合的哲学, 为了什么? 除了一次次问题还有什么? 难道你通过了解那个封装的过程就长了知识和能力了吗?\n\n也许吧\n\n也许是我的脑子笨, 思想慢, 或者是根本没有能力吧, 谢谢\n\n如果你是一个很\"深\"的用户, 我想听听你的心声, 开阔一下我自己的思想",
			"added": 1583402191,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1583405547,
			"title": "NixOS",
			"body": "NixOS是独立开发的GNU/Linux发行，它旨在改进系统配置管理的现状。在NixOS中，整个操作系统，包括内核、应用程序、系统软件包、配置文件，统统都由Nix包管理器来创建。Nix将所有软件包以彼此分离的方式进行存储，因此就不存在/bin、/sbin、/lib、/usr之类的目录；相反，所有软件包都保存在/nix/store中。NixOS的其他创新特色包括可靠升级、回滚、可重现的系统配置、二进制代码基于源文件的管理模型、多用户包管理。尽管NixOS是一份研究性项目，它是一份功能性的及可用的操作系统，能进行硬件检测，使用KDE作为缺省桌面，并采用systemd进行系统服务管理。",
			"added": 1583405532,
			"parent_topic_uri": "1580999201_151eeKX8P9StVJE4SWuenHgLQb3Vae4avy"
		},
		{
			"topic_id": 1583405619,
			"title": "Guix System Distribution",
			"body": "Guix系统发行（GuixSD）是基于Linux的无状态操作系统，它围绕GNU Guix包管理器而构建。该操作系统提供先进的包管理特性，例如交易升级和回退、可重现的创建环境、无需特权的包管理、依用户而定的轮廓文献。它采用了Nix包管理器的低层机制，而软件包则使用Scheme语言的扩展被定义为原生的Guile模块。",
			"added": 1583405603,
			"parent_topic_uri": "1580999201_151eeKX8P9StVJE4SWuenHgLQb3Vae4avy"
		}
	],
	"topic_vote": {
		"1580983096_151eeKX8P9StVJE4SWuenHgLQb3Vae4avy": 1,
		"1580891805_151eeKX8P9StVJE4SWuenHgLQb3Vae4avy": 1,
		"1576988589_1Mb1o1cd1C4WigsQ8eGRGpepb1TTHwMfVP": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1577836120_1MityxAx6QVFTYWjzSJFc6nCX6eyT5W5yQ": [
			{
				"comment_id": 1,
				"body": "linux 使用方向：\n1 孤独的使用最先进的发行版，跟随大佬学习\n2 使用人数最多的发行版，做一个懒人",
				"added": 1582919149
			},
			{
				"comment_id": 2,
				"body": "debian和fedora比较有意思，新中求稳\n不知道opensuse的软件够不够新\narchlinux 软件太新了，经常出问题",
				"added": 1582928208
			},
			{
				"comment_id": 4,
				"body": "所谓的操作系统在一般用户的日常使用来说，就是一套 “常用软件” 的合集\n\n那么 选择操作系统的奥义就是：\n比如 你想用 Photoshop 吗？ ( 特指 处理 psd 文件 ) 。你是否要放弃处理 psd 文件的选择？如果是 no，那么 哈哈 告诉你吧，没有任何一个 linux unix bsd 操作系统支持处理 psd 文件，你就老老实实用 win or mac\n\n这就是选择操作系统的奥义，和操作系统本身无关",
				"added": 1582966860
			}
		],
		"1582959836_12RgeEDbGjdU852T97tqnXFmRQVkNB6rLs": [
			{
				"comment_id": 3,
				"body": "满足自己的需求就够了，简洁、高效",
				"added": 1582963045
			}
		],
		"1582967432_12RgeEDbGjdU852T97tqnXFmRQVkNB6rLs": [
			{
				"comment_id": 5,
				"body": "很多时候决定你用什么操作系统的是和你一起工作的同事",
				"added": 1582967471
			},
			{
				"comment_id": 6,
				"body": "对绝大多数人，都是浪费时间，而时间比你说的任何东西都要珍贵",
				"added": 1582967497
			},
			{
				"comment_id": 7,
				"body": "把Linux桌面呢说得再好，也有一个不可忽视的缺点：太多了。\n\n可能有人觉得多了好啊，可以选择的面就广了。对于少数喜欢折腾的人而言，选择多了是好事，但不要忘了，绝大多数人其实是不喜欢折腾的，也没有多高的计算机水平。\n\n所以，桌面多了，如果想推广Linux在桌面的应用，面临的第一个问题就是：怎么编写教材？你选哪个桌面？有人说命令行和配置文件能解决问题，但对于普通用户而言，桌面都是问题，命令行和配置文件简直就是天书了。\n\nwindows好，或者不好，都没有什么关系，系统和操作方法一脉相承，而且一个版本就一个桌面，好写教材，好培训。就算将来系统升级了，老方法也能凑合着继续用。",
				"added": 1582967574
			}
		],
		"1582967290_12RgeEDbGjdU852T97tqnXFmRQVkNB6rLs": [
			{
				"comment_id": 8,
				"body": "完美的发行版= gentoo + 二进制内核 + 二进制包 + 预装桌面 + appimage + snap + flatpak + 下载软件无需翻墙",
				"added": 1583401033
			},
			{
				"comment_id": 9,
				"body": "有没有基于 gentoo的 i3wm发行版？",
				"added": 1583400939
			}
		],
		"1583402172_12RgeEDbGjdU852T97tqnXFmRQVkNB6rLs": [
			{
				"comment_id": 10,
				"body": "DF_XYZ 2013/01/20 16:54\n\n我也挺不理解为啥Gentoo软件都要自己编译，让用户自己决定编译优化参数？\n\nArch的话，我能够配置出一个个性化的系统处理",
				"added": 1583402266
			},
			{
				"comment_id": 11,
				"body": "Xingjian_Xu 2013/01/20 17:01\n\narch原来那个安装器被删了蛮好。不上arch的主页，我连rc.d不用了都不知道，看安装wiki才知道，rc.conf不用了，gentoo的emerge似乎是有个news提醒，还是得加个arch的邮件列表啊",
				"added": 1583402308
			},
			{
				"comment_id": 12,
				"body": "心有未来 2013/01/20 19:07\n各个发型版有她特定的人群，有些人喜欢windows这样的一键安装，而有些人更喜欢自己控制编译安装。就我个人而言更喜好自己编译，这样摒弃自己不想要的东西，一切皆掌握在自己手中:)",
				"added": 1583402336
			},
			{
				"comment_id": 13,
				"body": "zcj 2013/01/20 22:16 \n\n关键是可定制性吧，没有默认使用什么这一说，想让系统成为什么样子它就是什么样子的，上大学时有时间可以多折腾下。还有装一遍这些系统的话还是能学到不少Linux相关知识的，以前我身边很多用Linux的同学都不知道etc下都有什么东西，都干什么的。不过个人认为ArchLinux可以用下，Gentoo真心不能用，升级个系统要编译一夜，也没见得系统能跑多快。",
				"added": 1583402375
			},
			{
				"comment_id": 14,
				"body": "Y-QTCe 2013/01/21 08:54\nGentoo适合有洁癖的人。 对于“ 将原来由专人来封装的工作留给用户\"这点表示不解。Arch 和 Gentoo 还不都是用包管理器来安装软件，哪有什么封装过程？",
				"added": 1583402437
			},
			{
				"comment_id": 15,
				"body": "yyliu 2013/01/21 18:53\n对你没意义就没意义了，这世界对一个人有意义的东西本来就不多",
				"added": 1583402454
			},
			{
				"comment_id": 16,
				"body": "yyliu 2013/01/21 18:56\n\ngentoo给你更多的控制权，从源码开始。提供更多选择的权利，自己动手的权利。当然还有代价，也许折腾还会有乐趣",
				"added": 1583402484
			}
		]
	},
	"comment_vote": {}
}