{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1631520906,
			"title": "web browser for p2p decentralized sites",
			"body": "https://github.com/AgregoreWeb/agregore-browser\n\nonce bep 46 is added to webtorrent, then i think p2p sites will be viable, basically having sites on bittorrent",
			"added": 1631520905
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [
			{
				"comment_id": 1,
				"body": "there are other networks\nhyperdrive, ipfs, bittorrent\n\nalso a cool browser called agregore browser",
				"added": 1629858860
			},
			{
				"comment_id": 2,
				"body": "bittorrent has bep 46 for mutable torrents which would help publishing updated content on bittorrent network\n\nipfs is great for static content\n\nhyperdrive is good for streaming\n\nuse tor and then just need a browser to put it all together",
				"added": 1629859263
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 3,
				"body": "ipfs for static content\nhyperdrive/hypercore for streaming content\nbittorrent/webtorrent for files\ngundb for p2p database\n\neither need browser support or a new browser",
				"added": 1629860080
			}
		],
		"1629908963_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc": [
			{
				"comment_id": 4,
				"body": "a new religion should take over south asia and india. south asia should also disintegrate and multiple small nation states should be made for better representation",
				"added": 1629938761
			}
		],
		"1629864664_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 5,
				"body": "this nigga be internet crazy",
				"added": 1629939015
			}
		],
		"1629867851_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 6,
				"body": "americans are destroyers of usa, also the usa spreads aids around the world",
				"added": 1629939166
			}
		],
		"1631520906_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5": [
			{
				"comment_id": 7,
				"body": "> [transcoder](#comment_34_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): i have tried it before, the webbrowser is definetely very minimal however. maybe something like galacteek may work in the future howevever\n\ni like the minimal aspect of this. i read about galacteek before but it uses ipfs only. i don't think any single alternative protocol/system will take off, they are too specialized. ipfs sucks for streaming and mutable data. they have ipns but they will still have problem. hypercore is much better for streaming. a browser that mixes these specialized protocols would be the best to deliver ane xperienc ethat everyone is already used to.\n\n> [kaffie](#comment_1196_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I don't really see the point tbh. It looks like it just merges dat and ipfs, and forces you to use a shitty web browser.\n\nthe average common person out there is not using command line or or making a single line of code. they want a browser to make everything easy so they can look at websites. this is what it does. projects like these are what is needed for average people to interact with the p2p web.",
				"added": 1631574708
			},
			{
				"comment_id": 8,
				"body": "an experience that********",
				"added": 1631574802
			}
		]
	},
	"comment_vote": {
		"3_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5": 1
	}
}