{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Carbyne, ID2020 & Junkermann",
			"body": "Quoi de mieux qu'une pandémie mondiale pour ajouter du contrôle sous couvert de \"sécurité\" et de \"bien-être\" ?\n\nLa situation catastrophique dans laquelle nos dirigeants nous ont sciemment menés va permettre à Carbyne, une société spécialisé dans le technologie et la sécurité publique.\n\nBasée à Tel-Aviv (le hasard), elle est dirigée par Amir Elichai (Ex-agent du Mossad) et propose donc ses services et sa technologie avancée en communication en ce temps de crise. On peut ajouter également qu'Epstein a participé au développement de cette société en y ajoutant des fonds...\n\nIl semblerait que le logiciel soit distribué gratuitement, c'est bien la première fois pour un juif qu'il ne fait pas payer un service.\n\nDerrière Carbyne, il y a aussi NJF Capital, et donc Nicole Junkermann, actuellement à la tête du système de santé publique au Royaume Uni (sûrement encore un hasard).\n\nLes partenaires de Carbyne : Alphabet (Google, Android ...), Microsoft, Cisco, Amazon ...\n\nVous pensez que la France est épargnée ? Non non, une expérimentation a commencé à Nice\n\nLe projet ID2020, qui a pour but d'établir une identité numérique pour les citoyens.\nLes partenaires ID2020 : Accenture, GAVI, Rockefeller Foundation, Microsoft\n\nGAVI est une organisation pour les vaccins géré par Bill et Melinda Gates (Oui, les Bilderberg sont partout :)), encore des données à filer à Microsoft et donc potentiellement à Carbyne.\n\nLe projet de ID2020 est d'ailleurs de fournir une identité digitale via des vaccins, d'où le partenariat \n\nQu'est-ce que Junkermann vient foutre ici ? C'est pas compliqué, d'une part elle travaille dans la santé publique et d'autre part elle possède une société qui spécialisée dans l'intelligence artificielle, le médical et le Big Data (Dont Larry Page s'est empressé de faire un don, dingue commet le Lolita Express peut créé de tels liens d'amitié :)) baptisée OWKIN. D'autre part le CIO de cette société est Michael Pressigout, un ancien de chez Accenture (partenaire principal de ID2020)\n\n\nVous pensez que nos politiques sont à la ramasse ? Pas du tout, tout ça est parfaitement contrôlé.\n\nhttps://t.me/wfox14",
			"added": 1585581238
		},
		{
			"topic_id": 2,
			"title": "Les marionnettes du Corona",
			"body": "Pendant que les gens applaudissent tous les soirs à 20h comme les bons veaux qu’ils sont et qu’ils lancent des pétitions pour la démission de Sibeth ou encore les plaintes contre la juive Buzyn.\nLe plan Corona se déroule parfaitement bien, les banques centrales rachètent tout ce qu’elles peuvent en imprimant des billets de manière illimitée (Source (https://wallstreetonparade.com/2020/01/federal-reserve-admits-it-pumped-more-than-6-trillion-to-wall-street-in-recent-six-week-period/)), les souverainetés encore possédées disparaissent petit à petit, le plan Kalergi se porte bien (source (http://web.archive.org/web/20200316231528/https://twitter.com/prefetrhone/status/1239679962489257984)), des drones sont déployés par la police dans les rues pour surveiller Micheline qui va acheter ses tomates (Source (https://www.ouest-france.fr/sante/virus/coronavirus/confinement/video-coronavirus-rennes-la-police-deploie-un-drone-pour-veiller-au-confinement-6792850), Source (https://www.20minutes.fr/paris/2747063-20200324-coronavirus-paris-police-utilise-drones-inciter-habitants-rester-confines))...\nQui pensez-vous combattre avec vos pétitions ? Personne, ces gens sont insignifiants. Ils occupent le bétail de par leurs interventions stériles (Oui, le débile peut être utile).\n\nEn boucle sur des citations d’une pauvre negresse qui met les doigts dans une prise pour se coiffer, les merdias mainstream et même « dissidents » ne lâchent pas le morceau, la priorité pour eux est de dénoncer les marionnettes et non les marionnettistes.\nLes lois qui passent actuellement ont très probablement de longs jours devant elles.\n\nUn taux d’infection de 0.09%, 35 000 morts dans le monde, 0.0004% de la population mondiale. On a connu mieux niveau pandémie. (Selon leurs chiffres...)\n\nCe virus n’est qu’un prétexte.\n\nhttps://telegra.ph/Carbyne-votre-sauveteur-ou-pas-03-22\nhttps://telegra.ph/ID2020-la-Junkermann-est-partout-03-22\nhttps://telegra.ph/Couillonavirus-03-23\nhttps://telegra.ph/EARN-IT-ACT-03-25\n\nhttps://t.me/wfox14",
			"added": 1586180501
		}
	],
	"topic_vote": {
		"1_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": 1,
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": 1,
		"2_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": [
			{
				"comment_id": 1,
				"body": "> [mariage](#comment_15_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): Le Renard blanc... :D\n\n:)",
				"added": 1585857015
			}
		],
		"1_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 2,
				"body": "https://www.aubedigitale.com/le-danemark-vote-une-loi-autorisant-les-vaccinations-forcees-contre-le-coronavirus/",
				"added": 1586341795
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 3,
				"body": "Sieg Heil :)",
				"added": 1587914997
			}
		]
	},
	"comment_vote": {
		"15_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": 1,
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1,
		"1_1KeqxoCY2fq38qTA4wodSFC6824p4ws4A7": 1
	}
}