{
	"next_comment_id": 6,
	"user_name": "Caropc5",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "thanks for your work :) \nKaffieID\nhttp://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\n\nThank you very much, maybe you think you did little, but no, you are doing MUCH FOR HUMANITY, because working towards decentralization is something of absurd importance today, THANK YOU",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1564190262",
			"date_added": 1564382625
		},
		{
			"comment_id": 2,
			"body": "@Styromaniac: 2, I have been on the internet since 1995/1996.\nAnd if there's one thing I'm SURE about, it's that decentralization will win, because I remember seeing napster, Kazaa and others being defeated by industry and lobbying, but this only forced the evolution of the most decentralized technologies possible.\n\nAs it is happening now, zeronet, it is a NATURAL evolution, it is very cool to be able to keep up with this evolution of the internet",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1564190262",
			"date_added": 1564383114
		},
		{
			"comment_id": 3,
			"body": "@Public id|公共账号|Anonymous Login|匿名登录: bye, I blocked you bye, talk to my hand",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1564190262",
			"date_added": 1564397302
		},
		{
			"comment_id": 4,
			"body": "Mute a Zeronet user to mask unwanted uploads 静音用户 , guide\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2\n\nKaffie, I posted a video showing how to block this retard, I already have about 20 accounts that I block here.\n\nin the case I posted the video link, of course, because it is not my account, who posted this video in question",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1564190262",
			"date_added": 1564397505
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: The good thing about zeronet is this, EVERYONE can do whatever they want, if the site is their own, if not, they have to accept the rules of the website owner.\n\nAnd if she doesn't agree it's just her cloning the site or creating one and then she does what she wants, then having TOTAL control over the site: D\n\nAnd for the sake of you blocking someone, it's YOUR option, do as you see fit, ALWAYS.\n\nBecause at zeronet, we are ultimately free, everyone accesses what they want and works their way, no one can be stopped: D, this is wonderful.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1564190262",
			"date_added": 1564407887
		}
	]
}