{
	"next_comment_id": 14,
	"comment": [
		{
			"comment_id": 1,
			"body": "Añadiría:\nhttp://www.btput.com\nhttp://www.zhangyucili.com\nhttp://dametorrents.net\nhttps://torrentproject.se/\n--------------------------------------------\nhttp://www.btsome.com\nhttp://www.btany.com/",
			"post_id": 20,
			"date_added": 1472577753
		},
		{
			"comment_id": 2,
			"body": "> [rapapobre](#comment_6_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): esos dos se han añadido aquihttp://127.0.0.1:43110/17Tzm1HYknrRiiHZ5xLJqGNooebmoLqit7/?Post:3:Torrent+Sites\n\nOk, para mí los mejores btput.com y dametorrents.net (este último para películas en latino)",
			"post_id": 20,
			"date_added": 1472581129
		},
		{
			"comment_id": 3,
			"body": "Muy bueno.\nEl enlace \"Comparativa en Wikipedia de navegadores ligeros\"  aparece Not Found\nurl=https://en.wikipedia.org/wiki/Comparison_of_lightweight_web_browsers",
			"post_id": 6,
			"date_added": 1472753247
		},
		{
			"comment_id": 4,
			"body": "No conocía HitmanPro.Alert. Parece muy interesante pero no es software libre, la licencia de prueba dura 29 días : (",
			"post_id": 25,
			"date_added": 1473009158
		},
		{
			"comment_id": 5,
			"body": "> [rapapobre](#comment_10_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): siempre gracias tus comentarios; te comento sobre la app: si la quieres gratuita(en ambos casos), sales ganando con malwarebytes.ahora bien, hitman en su version pro tiene protecciones mas amplias pero impacta en el rendimiento general del pc, forzandote a desactivar algunas.el desarrollo de ambas herramientas: malwarebytes es mas especifica para el navegador y alguna clase de archivos para apertura (pdf), hitman es para navegador, usb, ataques al s.o etcmalwarebytes lleva mas tiempo en desarrollo.\n> suerte\n\nHace tiempo usaba la versión gratuita de Malwarebytes + un cortafuegos e incluso un antivirus como Avira (free). Me gustaba y me parecía de fiar sus positivos y desinfectaba lo que a otros les costaba pero lo acabé desinstalando porque la versión gratuita sólo funcionaba bajo demanda y me daba algún falso positivo.\nDe los antivirus gratuitos el mejor es 360 Total Security (puedes activar motores de Avira y Bitdefender, además del suyo propio) y funciona en tiempo real.",
			"post_id": 25,
			"date_added": 1473024163
		},
		{
			"comment_id": 6,
			"body": "A mí no se me actualiza Zeronet automáticamente, entro en Github y si veo una versión nueva actualizo desde Zerohello",
			"post_id": 28,
			"date_added": 1473198006
		},
		{
			"comment_id": 7,
			"body": "dhtspider en Github ?",
			"post_id": 23,
			"date_added": 1473554643
		},
		{
			"comment_id": 8,
			"body": "Añadiría:\nstreamstudio\nhttps://www.streamstudio.me/\nroxplayer \nhttp://roxplayer.com/\ntorrentsTime\nhttps://torrents-time.com/\nPlayBack\nhttps://github.com/mafintosh/playback/releases/tag/v1.6.0\nAcePlayer ( el mejor, permite ver eventos deportivos y otras retransmisiones en directo)\nhttp://acestream.org/",
			"post_id": 7,
			"date_added": 1473680275
		},
		{
			"comment_id": 9,
			"body": "Torrent Tunes es una buena idea pero lamentablemente hay pocos usuarios y por tanto, pocas semillas.",
			"post_id": 32,
			"date_added": 1473983132
		},
		{
			"comment_id": 10,
			"body": "http://www.bt118.com/\nUcilicili",
			"post_id": 36,
			"date_added": 1474464123
		},
		{
			"comment_id": 11,
			"body": "Creo que por DHT, junto con btput y BTDB es de los que más resultados da.",
			"post_id": 36,
			"date_added": 1474542070
		},
		{
			"comment_id": 12,
			"body": "Estoy interesado en StreamTorrent. ¿es una aplicación web de streaming más? ¿qué ventajas tiene? ¿soporta muchos formatos de video? ¿sólo ves el .torrent que has subido o tiene buscador?\n",
			"post_id": 45,
			"date_added": 1475424042
		},
		{
			"comment_id": 13,
			"body": "BTKitty ya no funciona (al menos no a mí).",
			"post_id": 44,
			"date_added": 1475523314
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}