{
	"title": "Личный блог о разном",
	"description": "блог.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1524462048,
	"post": [
		{
			"post_id": 3,
			"title": "О телеграмме и не только",
			"date_published": 1524461909.665,
			"body": "Последние события с блокировкой телеграмма и IP-адресов амазона и гугла навели меня на мысль попытаться высказать свои мысли. Но начну я немного издалека. Если мы откроем школьный учебник истории по увидим, что люди сначала жили стадами потом родами, потом союзами родов и племенами и вот понемногу добрались до такой формы как государство. Крайней формой государства будем считать империю. При этом следует отметить, что на каждом уровне повышались возможности общества по координации действий большого количества людей. Именно поэтому государство будет всегда сильнее союза племен или отдельного племени. Просто из-за размера.\n\nНо вот в конце XX века появились некоторые забавные вещи. Во-первых средство, позволяющее передавать на другой конец планеты большие объемы данных (интернет). Во-вторых задачи, которые даже такие государства как Китай, Российская федерация или Соединенные штаты Америки в одиночку не решат. от слова совсем. Конкретные пример — термоядерный реактор ITER. В связи с этим возникает вопрос — а не пора ли такой форме как государство или как-то измениться или исчезнуть. Нет конечно существуют (существовали) некие объединения государств как НАТО или страны варшавского договора. Европейский союз. Но вот как-то результаты их деятельности не впечатляют. Одни разборки.\n\nЛадно фиг с вами не можете. По разным причинам. Так не мешайте другим пытаться. А вот нет. Мешают. Причем мешают очень активно.\n\nПока противостояние идет на технологическом уровне. «Важные дяди» пытаются ограничить шифрование. Именно так. Проблема не только в телеграмме или ватсапе. Проблема в принципе в существовании общедоступных средств скрытия и распространения информации. Запретят телеграмм. — не вопрос. Любая почтовая программа с поддержкой PGP или любого метода асимметричного шифрования. И Доказывайте хоть до упаду что ivanova@hoitmail.ci это на самом деле Петров Игорь Валерьевич. С учетом численности населения планеты Земля — угробите кучу денег и времени. Интересно сколько времени потребуется чтобы перейти к посадкам и мордобою. В массовых количествах. Единичные случаи уже есть."
		},
		{
			"post_id": 2,
			"title": "Мое скромнее мнение",
			"date_published": 1524452014.442,
			"body": "# О отношениях.\n\nВечер добрый. Сегодня хотелось бы обсудить такую вещь как феминизм. Но обсудить ее немного в необычном ключе. Постараюсь сказать что-то свое. Сразу подразумеваю, что говорить буду от первого лица, но это касается не только меня лично.\n\nНачнем с моей любимой биологии. Человек по своей сути равнинный примат. При этом следует отметить, что как биологический вид мы не относимся к тем существам внешняя разница между полами, у которых существенна. Существуют виды животных внешняя разница у которых между самцом и самкой существенна. К примеру масса тела может отличаться в два или три раза. Но это ни про нас. Такова жизнь. В свою очередь это означает, что вещей, которые может выполнить мужчина, но абсолютно не может выполнить женщина очень мало. Да возможно с меньшей эффективностью или за большее время. Возможно с большим риском для жизни и здоровья, но сделает. Другое дело насколько ей это действительно надо.\n\nБолее того на этой планете нас уже больше семи миллиардов. И просто по теории вероятности возможно многое. К примеру женщина классный пилот. Одна на семь миллиардов. Ну или пять.\n\nОзначает ли это что в 99 процентах остальных случаях женщина будет не хуже мужчины. Не факт. Означает ли это что нужно запретить пробовать. Нет. Пусть пытается. На общих основаниях. Без скидок.\n\nНо это все немного далеко от простой жизни. Пойдем немного другим путем. Возьмем среднего мужчину в возрасте 18 – 21 года. Какие у него могут быть пожелания и требования к женщине.\n\nВозьмем три возможные ситуации. На улице, в офисе (вариант на рабочем месте) и в семье.\n\nПервый пункт самый простой. В принципе никаких требований нет. Ну за исключением требования соблюдать административный и уголовный кодекс, а также другое федеральное законодательство. По сути нормальное отношение на улице одного взрослого человека к другому человеку это вежливый пофиг. У вас своя жизнь у меня своя. Вежливо обратились – можно помочь. Нет – идем своей дорогой.\n\nВ офисе. Тут все немного сложнее. Начнем с того, что при поступлении на работу все подписывают пару забавных документов. Это трудовой договори должностная инструкция. Если вы устроились на работу, где этих документов нет – вы это сделали зря. Так вот дамы и господа давайте договоримся. Раз подписали документы – давайте их соблюдать. Причем опять же без скидок вида я девочка, я уже пожилой человек и тому подобных. Вы выполняете свои служебные обязанности и не мешаете выполнять мне. Если вам нужна помощь – вежливо просите. Ну ты же мужчина – это не вежливо и не просьба. Если вы начальник – то от вас ждут нормальных распоряжений и нормальной организации работы. И тут опять же отмазка я же девочка не катит. Не устраивает – отдел кадров ждет вашего заявления. Отдельная ремарка для мужчин. Гигантская просьба она же рекомендация. Никаких романов и ухаживании на рабочем месте. Может выйти боком. Кстати уже и выходит. Смотрим последние скандалы.\n\nТеперь перейдем домой. Давайте исходить из того, что я здоровый гетеросексуальный мужчина и живу в съемной или своей квартире. Для тех, кто не понял, в договоре на аренду, покупку или ипотеку стоит моя подпись и мои имя и фамилия. В идеале у меня вообще нет вредных привычек. То есть я не употребляю наркотики и не курю, и не пью. Менее идеальный вариант – бокал вина, шампанского или бутылочка пива раз в два три месяца.\n\nКроме этого у меня есть работа. Конечно не идеальная и платят мало, но на дешевую стиральную машину и кухонную плиту я денег найду. Таким образом в рамках данного общества я автономен. Поясняю. Я в состоянии приготовить себе ужин, обед и завтрак. Если я что-то не умею, то заплачу специалисту или к примеру, схожу в кафе. В более или менее крупном городе различных блинных, пельменных и тому подобного как грязи. Я в состоянии постирать свои вещи, а также купить их себе. При этом я буду исходить, во-первых, из своих доходов и во-вторых из климатических условий, дресс-кода на рабочем месте и своего удобства. Мнение редактора космополитан и подобных изданий меня не интересует. Как и мнение тетушек, бабушек, двоюродных племянниц и всего остального человечества. Смиритесь с этим. Более того давайте учитывать, что при попытке надавить я могу и послать или слегка покалечить. А может и не слегка.\n\nПервое требования к любому гостю или совместно проживающему – не создавать проблем. Поэтому никаких разногласий с федеральным и местным законодательством. Никах скандальных тетушек или друзей. Никакой немотивированной агрессии. Лучше даже так – никакой агрессии. Ответные действия вам не понравятся. Это я могу гарантировать.\n\nВторое требование – регулярный секс. Не реже двух раз в неделю. Это не обсуждается. Я в курсе наличия критических дней, неприятностей на работе, головных болей и тому подобного. Но я не идиот. Голова два месяца болеть не может. Живот тоже. Опять же я прекрасно понимаю, что не каждая женщина способна выглядеть как модель с обложки. Более того я прекрасно понимаю, что даже модели на самом деле так не выглядят. Но это не повод довести себя до состояния – столько не пьют. Я прекрасно понимаю про восстановление после беременности. Но оно не может длиться пять лет и более. В противном случае у вас банально что-то не так со здоровьем. И это повод обратиться к врачу. Хотя бы ради того, чтобы потом не заплатить за лечение гораздо больше или не отправиться на кладбище лет на пять пораньше.\n\nНебольшая ремарка по поводу одежды и вообще красоты. Вы живете в конкретном доме с конкретным человеком. А значит его мнение и его вкусы в приоритете. Для вас важнее мнение мамы или подруги. Дверь в коридоре. Мама или подруга вас с удовольствием примет.\n\nПо поводу детей. Так уж получается, что у меня, как и у других мужчин нет матки и я не способен рожать. Более того даже кормить грудью я тоже не способен. Поэтому ожидать от меня такого же отношения к детям как вас глупо. Просто по биологическим причинам. Для меня любой ребенок проживающий на моей территории – это человек за которого я отвечаю перед законом и обществом. И я буду требовать соблюдения законов этого общества. Более того это будущий взрослый человек, которого я обязан обучить, воспитать и подготовить к жизни в этом обществе. Поэтому умиляться я скорее всего буду мало. А вот поставить в угол или дать ремнем по заднице если это необходимо – я это сделаю.\n\nЗа сим разрешите откланяться."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}