{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "Il nemico interno",
			"body": "“Ritenuta la  straordinaria  necessità  ed  urgenza  di  introdurre strumenti  volti  a  rafforzare  la  sicurezza  delle  città  e   la vivibilità  dei  territori  e  di  promuovere  interventi  volti  al mantenimento del decoro urbano” …\n\nÈ particolarmente istruttivo soffermarsi sul testo del Decreto Minniti in materia di ‘Sicurezza delle città’ mentre scorrono in sottofondo le immagini degli espianti degli uliveti di Melendugno, per l’avvio dei cantieri del “Trans Adriatic Pipeline”...\n\nhttps://www.carmillaonline.com/2017/03/29/il-nemico-interno/",
			"added": 1490858842
		},
		{
			"topic_id": 2,
			"title": "Radi0 antagoniste",
			"body": "* [Radio Onda d'Urto](http://www.radiondadurto.org/) - [streaming](http://www.simpleserver.org:8000/radiondadurto.mp3.m3u)\n\n* [Radio BlackOut](http://radioblackout.org/) - [streaming](http://stream.radioblackout.org/blackout.ogg)\n** [Radio NoTAV!](http://www.radionotav.info/) - in onda ogni giovedì dalle 13 alle 14 su Radio BlackOut\n\n* [Radio Onda Rossa](http://ondarossa.net/) - [streaming](http://stream.ondarossa.net:80/ondarossa.mp3)\n\n* [Wombat Radio](https://wombat.noblogs.org/) - [streaming](http://212.47.248.124/_stream/wombat.ogg)\n\n* [SPAZ Radio](http://spaz.org/) - [streaming](http://spaz.org/radio.m3u) / [Semi-Permanent Autonomous Zone](/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1Mof3XymVGyXDj3iBqafRHPbi7AYfGGxj1/spaz@zeroid.bit)",
			"added": 1490866934
		},
		{
			"topic_id": 3,
			"title": "Festa della semina 2017 (Leoncavallo - Milano)",
			"body": "**[Festa della semina 2017](http://leoncavallo.org/home/index.php?option=com_content&view=article&id=257:festa-della-semina-2017&catid=26:news-eventi&Itemid=178): 'I MILLE USI DELLA CANAPA E I SUOI DERIVATI'**\n\n*\"La canapa è come il maiale, non si butta via niente!\"*\n\nEdilizia, medicina, tessitura, alimentazione, carta, socialità: la canapa e i suoi derivati hanno trovato, nel corso dei millenni, applicazioni nelle principali attività produttive e ricreative umane.  La sua proibizione, figlia degli interessi industriali che nei primi anni del ‘900 iniziano a prendere forma, è invece storia recente che non ha più senso d’esistere. La “Festa della semina” quest’anno collabora con l’associazione “Milano Cannabica”, producendo un happening di 3 giorni dedicato all'uso alimentare, medico, industriale e ludico della canapa. Tre giorni  dedicati al confronto sulle pratiche di legalizzazione che si stanno affermando in Europa, e sugli enormi vantaggi economici e sociali che queste pratiche comportano.\n\n* [VENERDI 31 MARZO 2017](http://leoncavallo.org/home/index.php?option=com_icagenda&view=list&layout=event&id=1379&Itemid=110#.WNuDIXWLQ_s)\n* [SABATO 1 APRILE 2017](http://leoncavallo.org/home/index.php?option=com_icagenda&view=list&layout=event&id=1406&Itemid=110#.WNuDQ3WLQ_s)\n* [DOMENICA 2 APRILE 2017](http://leoncavallo.org/home/index.php?option=com_icagenda&view=list&layout=event&id=1405&Itemid=110#.WNuDeHWLQ_s)",
			"added": 1491033712
		},
		{
			"topic_id": 4,
			"title": "Coltiviamo marijuana per scelta di vita. Il giudice: assolti",
			"body": "E non è il primo caso in Italia...\n\nPiantare marijuana in casa, essiccarla e consumarla può essere una filosofia di vita. E anche se quella filosofia è in contrasto con la legge in vigore, ci sono giudici che – forse per rispetto alle questioni filosofiche -, decidono di non applicare le normative. O – più correttamente – di applicarle nel più blando dei modi possibili...\n\nNon è la prima sentenza favorevole ai coltivatori. Ma sulla questione le decisioni sono contrastanti (ci sono altre sentenze che considerano la coltivazione reato).\n\nI fatti si sono verificati a Milano.\n\nNegli ultimi anni si sono comunque moltiplicate queste assoluzioni...\n\nhttp://www.ottopagine.it/attualita/120310/coltiviamo-marijuana-per-scelta-di-vita-il-giudice-assolti.shtml\n\nComunque sia, dopo la sentenza di Milano, chi fuma erba per un fine filosofico ha buona possibilità di evitare il carcere. Ma dipende sempre dal giudice...",
			"added": 1491144540
		},
		{
			"topic_id": 5,
			"title": "NOFEST 2017: non è un pranzo di gala",
			"body": "UnzaLab, primo spazio milanese dedicato alle pratiche cine-fotografiche in forma condivisa e aperta alla città, in collaborazione con L’Emergere del Possibile,\nblog italiano tra i più seguiti nell’ambito del cinema sperimentale, collaborano all’edizione 2017 del NOFEST: giovedì 6, venerdì 7 e sabato 8 aprile, a partire\ndalle ore 20:30, in tre luoghi associativi del quartiere Niguarda viene lasciato spazio a quell'anomalia selvaggia che è il cinema dell'immanenza propriamente\ndetto.\nA cornice, la diffusione del testo di Saint-Pol-Roux, \"Cinema vivente\", distribuito gratuitamente all'ingresso fino ad esaurimento copie. Di seguito, il programma completo: \nhttp://unza-milano.us8.list-manage.com/track/click?u=917436560a4ffa48b956e2556&id=ec98828fd6&e=5e8ab3957f\n\n* Giovedì 6 aprile\nc/o UNZA!, via L. Bianchi d'Espinosa, Milano - h20:30\nJosé Miguel Biscaya, #47 (Paesi Bassi, 2014, 11’, HD)\nRiccardo Vaia & Cristina Pizzamiglio, Desert light (Italia, 2016, 24’, 2K)\nLaura Marie Wayne, Most of us don’t live there (Canada/Cuba, 2015, 26’, HD)\nVincent Grenier, Watercolor (Fall Creek) (Canada/USA, 2013, 13’, HD)\nWalter Ungerer, noCOM (USA, 2014, 9’, HD/animazione)\nRebecca Ruige Xu & Sean Hongsheng Zhai, When leaving becomes arriving (USA, 2015, 4’, HD/animazione)\nFabio Scacchioli & Vincenzo Core, Bang Utot (Italia, 2015, 27’, HD)\nIgnazio Fabio Mazzola, I II III IIII (Italia, 2016, 1', miniDV), *31 12 99 (Italia, 2016, 1', HD), O (Italia, 2016, 1', 4K), O O (Italia, 2016, 1', SD)\nSiegfried A. Fruhauf, Vintage print (Austria, 2015, 13’, 2K)\nRobert Todd, Daydreams (USA, 2016, 7’, 16mm/HD)\n\n* Venerdì 7 aprile\nc/o UNZALab, via G.B. Passerini 18, Milano - h20:30\nFlim Flam Crew, Ludione della lampada (Italia, 2016, 121’, 2K)\n\n* Sabato 8 aprile\nc/o D’ENTRO, via A. Cesari 17, Milano – a partire dalle h20:30\nTeo Ormond-Skeaping, Orbit æterna (Inghilterra, 2013, 16’, 16mm/HD)\nEnzo Cillo, Ippocampo (Italia, 2016, 9’, HD)\nRichard Ashrowan, Speculum (Scozia, 2014, 17’, HD)\nLaura Kraning, Irradiant field (USA, 2016, 10’, HD)\nFlavia de la Fuente, Diario de un corto (Argentina/Cile, 2015, 18’, HD)\nLuca Poma, American spirit (Italia, 2017, 18', HDV)\nDan Browne, Untitled (Canada, 2017, 2', HD)\nChris H Lynn, Liguria (USA/Italia, 2016, 7’, HD)\nAnna Kipervaser, To honor (Ucraina, 2014, 2’, HD)\nTakashi Makino, 2012 (Giappone, 2013, 30’, 35mm/16mm/8mm/HD)\nCalum Walter, Experiments in buoyancy (USA, 2013, 5’, HD)\n\n* INFO\nhttp://unza-milano.us8.list-manage1.com/track/click?u=917436560a4ffa48b956e2556&id=64652c2e99&e=5e8ab3957f\nhttp://unza-milano.us8.list-manage.com/track/click?u=917436560a4ffa48b956e2556&id=93274b1292&e=5e8ab3957f\n\n* PER RAGGIUNGERCI\nMM3 Maciachini + tram 4 (fermata Niguarda Centro)\nMM5 Ca’ Granda + autobus 42\nautobus 51, 83, 172\noppure in bici!",
			"added": 1491235988
		},
		{
			"topic_id": 6,
			"title": "“45MILA EURO PER RISARCIRE LE NOSTRE TORTURE”. PARLA L’AVVOCATO DEI “TORTURATI” DI BOLZANETO",
			"body": "16 anni dopo, 6 manifestanti al G8 di Genova “torturati” (de facto se non de iure) a Bolzaneto accettano un risarcimento. Ma non per ragioni economiche, e senza alcuna intenzione di chiudere la faccenda. % dei 6 sono stati difesi di fronte alla Corte di Strasburgo dall’avvocata Maria Luisa D’Addabbo.\n\nhttp://lacittadiradio3.blog.rai.it/2017/04/07/45mila-euro-per-risarcire-le-nostre-torture-parla-lavvocato-dei-torturati/",
			"added": 1491559381
		},
		{
			"topic_id": 7,
			"title": "4.20 HEMP FEST MILANO",
			"body": "... Negli Stati Uniti il 20 aprile è diventata la giornata nazionale della Cannabis con feste e raduni immersi nel verde...\n\nGiunto alla seconda edizione, [4.20 Hemp Fest](http://www.420hempfest.com/), è il primo, ufficiale e unico Cannabis Day italiano, e si svolgerà a Milano il 20 Aprile 2017 al Lambretto Studios di Lambrate , con il supporto di Sir Canapa, primo Hemp Shop italiano.\n\nUna manifestazione per approfondire il mondo della Cannabis nei molteplici suoi aspetti, una pianta conosciuta soprattutto sotto il punto di vista ludico, ricreativo e spirituale. Una giornata di Musica, Arte, Cultura, Hemp Food, Talk e Dibattiti con una ricca e variegata presentazione di brand e nuove linee di prodotti del mercato della Cannabis europea.\n\nE’ il festival delle pratiche artistiche, terapeutiche, meditative e spirituali associate alla psichedelia e alla Cannabis, nelle suedimensioni più importanti: Sativa, Indica e Ruderalis. L‘organizzazione 4.20 Hemp Fest\tgrida forte l’urgenza di una normalizzazione della Cannabis e vuole farlo con una festa libera, ma responsabile!",
			"added": 1492671916
		},
		{
			"topic_id": 8,
			"title": "25 aprile 2017 - Milano AntiFascista",
			"body": "**[Milano batte un colpo: vietata la parata fascista il 25 aprile](http://www.radiopopolare.it/2017/04/vietata-parata-fascista-musocco-programmi-radio-popolare-liberazione-25-aprile-porta-un-fiore-a-un-partigiano/)**\n\nDopo anni di tolleranza Milano finalmente vieta la parata nazifascista il 25 aprile. Era dal 2012 che il gruppo Lealtà Azione organizzava proprio nel giorno della Liberazione un omaggio ai caduti della Repubblica Sociale al Campo X del cimitero Maggiore. Con tanto di labari, bandiere con l’aquila di Salò e saluti romani, quanto bastava per ravvisare il reato di apologia di fascismo. Quest’anno i nuovi prefetto e questore Luciana Lamorgese e Marcello Cardona, con l’appoggio del sindaco Giuseppe Sala, hanno deciso di vietare la manifestazione, rispondendo positivamente all’esposto presentato dall’Anpi.\n\n**[Partigiani in ogni Quartiere 2017](https://poq.noblogs.org/post/2017/04/21/partigiani-in-ogni-quartiere-2017/)** - L'antifascismo in piazza",
			"added": 1493109333
		},
		{
			"topic_id": 9,
			"title": "Vaccinazioni Pediatriche: Lettera aperta al Presidente dell'Istituto Superiore di Sanità",
			"body": "di *Roberto Gava, Eugenio Serravalle*\n\nIll.mo Prof. Ricciardi,\n\nle Sue recenti prese di posizione pubbliche in merito alle vaccinazioni pediatriche ci inducono a scriverLe per chiarirLe alcuni aspetti che meritano un approfondimento e una riflessione serena.\n\nOggigiorno, un qualsiasi medico dotato di buon senso e di un minimo di conoscenza scientifica non può essere contro le vaccinazioni pediatriche e infatti conosciamo tutti l'utilità di questa pratica sanitaria.\n\nMolti anni di studio quotidiano della letteratura scientifica, con la quale abbiamo sempre documentato le nostre affermazioni e pubblicazioni sia scientifiche sia divulgative, ci hanno permesso di conoscere a fondo l'utilità ma anche i limiti delle vaccinazioni, che all'inizio noi sostenevamo e che molto frequentemente anche praticavamo...\n\nhttp://www.informasalus.it/it/articoli/vaccinazioni_lettera_presidente_sanita.php",
			"added": 1494225714
		},
		{
			"topic_id": 10,
			"title": "Dopo i fatti di Centrale, verso il 20 Maggio",
			"body": "**[Una rassegna stampa](http://www.milanoinmovimento.com/finestre/dopo-i-fatti-di-centrale-verso-il-20-maggio-una-rassegna-stampa-nooneisillegal)** – #NoOneIsIllegal\n  \nDopo i rastrellamenti su base etnica di martedì scorso in Stazione Centrale di #Milano che hanno messo in risalto le mille contraddizioni del PD “di lotta e di governo” e in vista della mobilitazione antirazzista 20 Maggio una rassegna stampa in continuo aggiornamento.\n\n**[Nessuna persona è illegale](https://www.facebook.com/notes/nessuna-persona-%C3%A8-illegale/nessuna-persona-%C3%A8-illegale/374723619589048/)**",
			"added": 1494396257
		},
		{
			"topic_id": 11,
			"title": "ZeroTNT - TNT Village su ZeroNet",
			"body": "su TNTforum è aperta la [discussione relativa ad una presenza di TNT Village su ZeroNet](http://forum.tntvillage.scambioetico.org/index.php?showtopic=560803)",
			"added": 1494396752
		}
	],
	"topic_vote": {
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1_19516ePRXeccspB678wv6XyDhMpoTXfpSa": [
			{
				"comment_id": 1,
				"body": "https://t.me/zeronetitalia",
				"added": 1490799294
			}
		],
		"1_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 2,
				"body": "Ieri, gli/le attivisti/e si sono ritrovati la campagna\ncompletamente militarizzata da camionette, polizia e carabinieri in\nassetto antisommossa con maschere antigas e lacrimogeni, per permettere l’espianto degli ulivi. La tensione è salita quando la polizia ha circondato la strada per permettere il passaggio dei camion: gli attivisti si sono schierati di fronte agli scudi dei poliziotti, con le mani alzate, e dopo pochi minuti sono stati caricati per essere dispersi. Gli stessi sindaci scesi a fianco della popolazione e dei comitati con la fascia tricolore, si sono messi di fronte ai blindati per bloccare i tratturi che portavano all’uliveta che dovrebbe diventare un ennesimo cantiere militarizzato; anch’essi sono stati colpiti e caricati.\n\nAncora una volta, le istituzioni rispondono con la repressione e manganelli contro chi si organizza e lotta per difendere il proprio territorio da opere nocive e dannose, utili solo al profitto di pochi e imposti con manganello e militarizzazione del territorio...\n\nhttps://pianacontronocivita.noblogs.org/2017/03/29/dalla-piana-al-salento-solidarieta-ai-no-tap/",
				"added": 1490859133
			},
			{
				"comment_id": 3,
				"body": "[Puglia / In Salento manganelli tra gli ulivi](http://www.zic.it/puglia-in-salento-manganelli-tra-gli-ulivi/) [Zic.it]\n\nAl presidio #NoTap di San Foca arriva la celere per permettere l'espianto di decine di ulivi secolari. Tensioni, malori e cariche contro i manifestanti.",
				"added": 1490859407
			},
			{
				"comment_id": 9,
				"body": "**[Tap, polizia abbatte barricate](http://www.ansa.it/sito/notizie/topnews/2017/04/27/tap-polizia-abbatte-barricate_8bdd70e9-b0f2-4b4a-8a98-1cc100e1ecb6.html)**\n\n*A dimora gli ultimi undici ulivi*\n\n(ANSA) - MELENDUGNO (LECCE), 27 APR - Un blitz della polizia è stato compiuto nella notte nell'area del cantiere Tap in località San Basilio, a San Foca, Marina di Melendugno: con le ruspe sono state abbattute le barricate erette nelle strade a ridosso della zona Tap dopo la sentenza del TAR Lazio e che ostruivano il transito veicolare. Le barricate erano state erette dagli attivisti che protestano contro la realizzazione del gasdotto e contro l'espianto degli ulivi...",
				"added": 1493274953
			},
			{
				"comment_id": 10,
				"body": "[Perché No Tap né qui né altrove](http://comune-info.net/2017/03/perche-no-tap-ne-ne-altrove/) (Comune-info)",
				"added": 1493275098
			}
		],
		"6_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 4,
				"body": "Bolzaneto, lo Stato apre il borsellino\n\nhttp://www.zic.it/bolzaneto-lo-stato-apre-il-borsellino/",
				"added": 1491559426
			},
			{
				"comment_id": 5,
				"body": "“Si approvi subito la legge che punisce la tortura”. A dirlo è Patrizio Gonnella, presidente di Antigone, a seguito del patteggiamento dell’Italia con sei delle vittime delle torture all’interno della Caserma di Bolzaneto durante il G8 del 2001 a Genova. \n\nhttp://www.associazioneantigone.it/news/antigone-news/3037-bolzaneto-antigone-gonnella-non-ci-sono-piu-scuse-si-approvi-subito-il-reato-di-tortura",
				"added": 1491559447
			},
			{
				"comment_id": 6,
				"body": "“Per uno stato che non tortura” (Mimesis, 2016), a cura di Caterina Peroni e Simone Santorso\n\n“Le parole per dirla – Nominare la violenza come processo politico”\n\nIl volume è il risultato di un percorso politico e di ricerca iniziato durante il convegno “Senza tortura. Per uno Stato che non uccide” organizzato nel 2014 presso l’Università di Padova dal Master in “Criminologia Critica e Sicurezza Sociale. Devianza, Città e Politiche di Prevenzione”, in collaborazione con l’Associazione Antigone e Ristretti Orizzonti.\n\nA partire dal clamore suscitato dai casi di “malapolizia” degli ultimi anni e dal dibattito scaturito dall’assenza del reato di tortura nel nostro codice penale, i contributi raccolti si propongono di analizzare e decostruire da diverse prospettive discorsi, giustificazioni e rappresentazioni istituzionali su tortura e gli abusi di polizia...\n\nhttps://beccodiferro.noblogs.org/per-uno-stato-che-non-tortura-mimesis-2016-a-cura-di-caterina-peroni-e-simone-santorso/",
				"added": 1491559547
			}
		],
		"1_17438DhdJ7LHQgQBVTfHmajp8dZXLH2Tiw": [
			{
				"comment_id": 7,
				"body": "boh,\na me solo il fatto di poter pubblicare tutto ciò che ti pare con qualsiasi strumento desideri senza bisogno di avere uno spazio se non il tuo in locale dovrebbe far coincidere il bacino d'utenza con tutta la rete :)",
				"added": 1493109706
			},
			{
				"comment_id": 13,
				"body": "> [livorno1](#comment_3_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF): E' un bel giocattolo, per ora....\n\ndici?\neccomemmai la sminuisci così?\nal minimo è come mettere insieme telnet gopher irc e http\ntutti in uno e senza server esterni ma con una connessione estremamente orizzontale,\nno?",
				"added": 1494599903
			},
			{
				"comment_id": 14,
				"body": "> [livorno1](#comment_3_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF): E' un bel giocattolo, per ora....\n\neffettivamente,\n\n- qui su ZeroTalk c'ho 20K di messaggi, che praticamente ho finito\n- in ZeroMail ci sono 48K... e poi?\n- ZeroMe poi dipende dall'hub sul quale si è registrati quindi... boh! io me ne son fatto uno per me sul quale tengo l'utente che aggrega tutti i feed, ma il mio utente usuale è su un hub che poi non so neppure quale\n- il Zito però è tutto sotto il mio controllo anche se immagino che se diventa troppo pesante magari smettono di condividerlo\n\nmi sfugge qualcosa?\nsto dicendo cazzate?",
				"added": 1494601109
			}
		],
		"8_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 8,
				"body": "In occasione dell'anniversario della liberazione d'Italia dal governo fascista e dall'occupazione nazista, [Radio3 rievoca alla memoria la Resistenza italiana](http://www.rai.it/dl/portali/site/articolo/ContentItem-73d9d3ac-aab0-40f9-b69a-a27b9f5277eb.html?refresh_ce)",
				"added": 1493110171
			}
		],
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 11,
				"body": "schiz0",
				"added": 1493812912
			}
		],
		"10_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 12,
				"body": "> [livorno1](#comment_2_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF): Cos'ha, ancora di sinistra, il partito democratico?Sono meravigliato dal fatto che in tanti lo pensino...\n\nè l'abitudine :)",
				"added": 1494591761
			}
		]
	},
	"comment_vote": {
		"1_1Y7bUwSNLFn6pLdzGyqWkMu2bieAdYsba": 1,
		"1_164g47hoiodZmCBFBxBU7t1xBUHSsFWtKf": 1
	}
}