{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "I'm not very tech-deep in how ZN stuff works, but... Assuming, that we have a Plugins at our disposal... Can the plugin solve this issue on a content-downloading stage?\n\nWhat I mean is:\n1) Assume someone created a new zite, signed&published it for everyone and now is the only seeder of his own website.\n2) Assume that this person used `jquery-3.1.0.min.js` lib as his JS assets.\n3) Each file has SHA512 checksum.\n4) New person now enters the newly created website of a person above. Files are being transferred.\n5) During this file-transfer, we can use the plugin. This plugin will perform a check in visitor's `data` folder:\n5.1) On exact filename match. If found, cast check shasum on it.\n5.2) If not found on exact filematch, run shahash search on `content.json` files and stop on first match.\n6) Procedure by plugin runs only once. If similar file with matching shasum is found, plugin will create a symlink to the local file from another data folder.\n\nThe problem is with the symlink: plugin will need to handle absolute path in owner's zite somehow, without modifying the sources. So, if owner's zite had this included in his <head> section:\n```\n<script src=\"js/jquery-3.1.0.min.js\"></script>\n```\nthe plugin's task will be to intercept this resource loading and instead load it from symlink. I.e., this library was found in folder `/1A83ijw3boqTtqdLz8me7AqeK1nEK8yxeu/jquery-3.1.0.min.js` (Kaffie.bit website, visited by client earlier). Then plugin will load this library and prevent original link from being loaded.\n\nOr it can be somehow (if it is possible) stored as a key:value in users.json file or any other file, that can be safely modified by plugins (or create something like `localcdn.db` to get things from there). It is all hazy and unclean, since I don't know a lot of details, but it should be enough to get the idea... :)",
			"post_id": 90,
			"date_added": 1601217322
		}
	],
	"comment_vote": {},
	"post_vote": {
		"81": 1,
		"90": 1
	},
	"zm_message": [
		{
			"body": "BinChan, are you still here?",
			"date_added": 1601214556194
		}
	]
}