{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1612124072,
			"title": "COVID",
			"body": "COVID and worldwide manipulation, what is your opinion?",
			"added": 1612124071
		},
		{
			"topic_id": 1612656181,
			"title": "Help",
			"body": "Help\nmy house was torn apart with typhoon, who can help with a donation\n3Qc8UZeCxjNvLGgRcRMe6DEHpx9z5e2rN3\nMinimum deposit: 0.00003 BTC",
			"added": 1612656179
		},
		{
			"topic_id": 1612723367,
			"title": "Califado",
			"body": "The lords of the flies are selling you illusions!\n\nTo those who live defending religions here in the group, it's time to look at the world without filters! Perceiving pastors who serve \"two masters\"; the Vatican as a bank, full of corrupt and corrupting people, a large bank, used for money laundering, owner of banks, arms and contraceptive industries; Followers of other religions, who are supposed to follow the creator, but who are terrorists! Others who say they are wronged, but are, in fact, great capitalists and invaders from foreign countries! It's just dirt! Selling illusion and enriching sellers! They are temples, and churches, full of doubtful symbols, or other infiltrated groups, common to obscure objectives, are secret and known to only a few! Make no mistake. Look at the world without blinders! You will see beautiful things, yes, but a lot of dirt on the corners. Lots of corruption and disrespect! Make no mistake waiting for eternal life, we are deceiving you, to live and create your own havens here on earth at your expense! The human right should be for everyone, do not give it privilege, because we all deserve it and we must have grace! Not just those who put themselves on pedestals! They are not saints, they are not divine, greater, superior, only more arrogant! Don't feed this arrogance!\nThere is a hidden government, manipulating everything for a long time! \"Who will this government be?\" It's time for us to know! To try to see behind the monuments!\nLook at the world without pretense, see without filters, and see good and evil and wanted to live in the light, the good and not in slavery, feeding \"the lords of the flies!\"\n--",
			"added": 1612723364
		},
		{
			"topic_id": 1613061986,
			"title": "Califado",
			"body": "Frightening revelations about the origin of the human being that may be in the Vatican's secret archives. \n\nThe history of human civilization and evolution is very complicated and has been distorted over time, often by theological concepts without a thorough scientific study. Today science refutes the Christian theory of Genesis, a legend without meaning and absurd. On the other hand, recent scientific studies are demystifying the creationist theory of evolution or natural selection, but even so the scientific community cannot explain the giant leap in the transformation of the monkey to man, the missing link of humanity's greatest enigma.Today there are exaggerating theories that are helping science explain the rapid evolution of human beings. The Ancient Astronalta theory takes us to the time tunnel of history, when in the Middle East, in Mesopotamia, the Sumerian civilization emerged, which with its cuneiform writing has helped us to clarify our true history. The decoding of these texts revealed ancient scriptures, the Book of Enoch, the Gospels of Nag Hamadi, the Book of Jubilees, which help us to broaden our knowledge base in relation to the writings of the Canonical Bible, shedding light on the veracity of their reports.Clay tablets, dated 2,000 years before the Canonical Bible, from Ancient Mesopotamia may contain the answer to the origin of mankind. Many would be shocked to discover that the great hero of the Noah Flood was actually a Sumerian king.In the Epic of Gilgamesh, one of the longest known stories involving the king of a Sumerian city called Uruk, Noah is visited by a king and tells about the approaching cataclysm, the great flood.Unfortunately, funding for the first archaeological investigations was closely controlled and channeled by the church's first authorities, in particular the Roman Catholic Church. A mandate was issued to finance only the archaeological explorations that perpetuated the story told in the canonical Bible, established by the same institution at the Council of Nicaea, 343 CE. Due to the majority who had no education in the past, the task of knowing the truth was often delegated to ecclesiastical authorities. Fortunately, the distribution of knowledge and information is rampant on the Internet today, and the power is now in our hands, as the efforts of previous decoders are finally being disseminated to the world. Is Noah's biblical story based on an older account told by the Sumerians? According to the Sumerians, Noah was a Sumerian king who was warned of a change in polarity that would wipe out most of humanity. When one realizes that the Old Testament God Yahweh was none other than the local deity of the Sumerian city of Ur, Enlil, the truth is revealed. Enlil and his various relatives were worshiped as gods in various temples, from Nineveh to Assur and the Sumerian city of Ur, to name but a few. Likewise, his brother Enki and his sons Nannar and Innana also had temples in important cultural and commercial portals in the region. Most importantly, Enlil was not acting alone, but in partnership with others called Anunnaki. Enlil and his brother, Enki, they are mentioned in Genesis and in the most historic Clay Tablets as participants in genetic tests to produce a primitive worker. A very detailed account is provided of a clinical trial that results in the birth of the archetype of the human race, \"Adam\". The test was conducted by Enlil's half sister, Ninmah, and her half brother Enki, in an African laboratory. Historical records attract even the most discerning scientist who readily recognized the threshold of knowledge needed to discuss a topic like genetic engineering in a nearly 5,000-year-old document that provides a more detailed account of man's creation, one that makes sense technically and historically against the precisive version provided by the Bible, although in many cases complementary. That might explain Noah's age, who was said to be 600 years old at the time of the great flood.Noah was the son of a \"deity\" according to the Bible. Could this “deity” father really be an extraterrestrial being that gave rise to Noah's long life? Several deities in the Sumerian and Egyptian records were also known as names (AKA), which seemed to span long periods and were found in several ancient texts. For example, the Akkadian god Sin was also known as the moon god Nanar, son of Enlil. His sister, Inanna, also sported the symbol of the crescent moon and had temples throughout Mesopotamia. She was known as Ishtar by the Akkadians. Interestingly, many deities from other cultures, such as the Greeks and Egyptians, were alternative versions of the original Sumerian \"gods\". The Egyptian goddess Ishtar was actually the Sumerian deity Inanna, who, according to the Sumerian text, was a high-ranking member of the Anunnaki. The Greek historian Herodotus lived in the 5th century BC and came from Ionia; he outlined Egyptian civilization in three dynasties and the model is still used by Egyptologists today. Mantheo, the Egyptian priest-historian, agrees with the three dynasties, except that he adds one more dynasty that was governed only by the \"gods\". He claims that the first dynastic rulers of Egyptian gods ruled for 12,300 years. It is interesting to note that in Sumerian texts, Enki was assigned to the regions of Egypt and Africa by his father Anu, in or before 3760 BCE. It turns out that the Jewish calendar, whose origins are in the Sumerian city of Nippur, also starts counting in 3760 BCE. The two royal brothers Anunnaki maintained animosity for each other,causing ancient wars often called “great wars in heaven” in Christian dogma. The Sumerians claimed that all aspects of civilization were taught to them by the deities who were worshiped in the temples of Mesopotamia.Detailed knowledge of the Earth's orbital plane, tilt axis, spherical shape and precession behavior of his equinox was known to the Sumerian deities, who were also credited with building the Zodiac. Compare this detailed level of knowledge in Sumer with that possessed in Europe during the Middle Ages.Scientists and church officials in Europe were at odds over whether the Earth was round or flat, while the people of Sumer and the surrounding region had advanced in mathematics, metallurgy, legal codes and produced many early civilization inventions and conquests. The Anunnaki family tree according to the Sumerian records gives us a sense of how far this people were. The correlation between the Old Testament God and the Sumerian god is apparent; the Sumerian storm god, Enlil, can be considered the God of wrath and vengeance in the Old Testament. In discussing religious truth, there is what the ruling party or superpower believes and what the subordinate cultures believe in, which receives a derogatory pagan or hidden label. An example of this is occurring and manifesting itself today in the Middle East, where religious factions representing Christianity, Judaism and Islam are waging war in the ancient land of Canaan, near Mount Megiddo, located south of Israel. Warrior factions, whose genealogy originates in Sumer, are still in conflict today. The devotees of Enlil, Also known as Yahweh, the God of the Old Testament, come face to face with the followers of Enki, still at odds with each other over the domain of the Earth. Could the conflicts involving the countries of Iran, Iraq, Syria and Israel be the result of previous wars that took place between the \"gods\" Enlil and Enki and their descendants, as written in Zecharia Sitchin's \"War of Gods and Men\"? According to the sumerologists, the term AN.UNNA.KI is literally interpreted as those who \"came from heaven to Earth\". The key point to note at the beginning is the affiliation of the term \"sky\" with the claimed planet of Anunnaki origin, that is, Nibiru as detailed in \"The 12th Planet\" by Sitchin. Furthermore, from the list of characters detailed as \"deities\" in Mesopotamian literature, we know that the head of the Anunnaki council of 12 was chaired by Anu, the father of the two main players and half brothers Enlil and Enki. NI.BI.RU is composed of the cuneiform script now digitized, listed in Unicode as 1224C, 12249 and 12292. Thus, a more accurate interpretation of the word Anunnaki are those that came from or were sent from Anu to Earth. The correlation between the Old Testament God and the Sumerian god is apparent; the Sumerian storm god, Enlil, can be considered the God of wrath and vengeance in the Old Testament. In discussing religious truth, there is what the ruling party or superpower believes and what the subordinate cultures believe in, which receives a derogatory pagan or hidden label. An example of this is occurring and manifesting itself today in the Middle East, where religious factions representing Christianity, Judaism and Islam are waging war in the ancient land of Canaan, near Mount Megiddo, located south of Israel. Warrior factions, whose genealogy originates in Sumer, are still in conflict today. Enlil's devotees, also known as Yahweh the God of the Old Testament, face Enki's followers, still in conflict with each other over the domain of the Earth. Could the conflicts involving the countries of Iran, Iraq, Syria and Israel be the result of previous wars that took place between the \"gods\" Enlil and Enki and their descendants, as written in Zecharia Sitchin's \"War of Gods and Men\"?According to the sumerologists, the term AN.UNNA. KI is literally interpreted as those who \"came from heaven to earth\". The key point to note at the beginning is the affiliation of the term \"sky\" with the alleged planet of Anunnaki origin, that is, Nibiru, as detailed in Sitchin's \"The 12th Planet\". Furthermore, from the list of characters detailed as \"deities\" in Mesopotamian literature, we know that the head of the Anunnaki council of 12 was chaired by Anu, the father of the two main players and half brothers Enlil and Enki. NI.BI. Equating the planet Nibiru with the word Heaven, as used in the Bible, is an important detail when reexamining prayers like \"Our Father in Heaven ...\", shedding a whole new light on who the Father in Heaven really was, that is , Anu (ruler of the Anunnaki and father of Enlil and Enki). Therefore, the prayers must have originated from Anu's extraterrestrial children on Earth. What was the reason why the Anunnaki left Nibiru to come to Earth?According to Sitchin and other authors on the subject, Nibiru, located beyond Pluto, is trapped in a 3600-year-old elliptical orbit around our sun. According to maps and Sumerian reports from the 1983 IRAS Naval Observatory by Dr. Harrington, it was reported that the discovery of a large planet in the Nibiru region resided near where the Sumerians indicated, in addition to Pluto. In short, the home planet Anunnaki is real and approaches perihelion around 1400 years from now.Brown dwarf planets, as we know, do not receive significant solar radiation to maintain the habitable surface temperature.The atmosphere in Nibiru was generated artificially or from gases and released steam from the heated geothermal planet.According to the timeline of the story published by Sitchin, approximately 450,000 years ago, life in Nibiru was threatened with extinction due to the deterioration of the atmosphere and subsequent exposure to radiation, especially in the next perihelion with the sun. One of Nibiru's leaders traveled inland and landed on Earth, discovering Earth's surplus gold. Because of their advances in technology, the Anunnaki could use gold to save Nibiru's decaying atmosphere by dispersing ionized particles in the planet's atmosphere. “Tree of Life”, observe the symbol at the top of the sign, an object that is very similar to the Egyptian solar disk. This ancient symbol has many theorized meanings,including the Sun and the illuminated knowledge maintained and transmitted by the royal lineage for millennia.Anu and his two sons Enlil and Enki eventually came to dig Earth for gold too, however, Enlil and Enki kept their distance due to a rivalry.According to Niburian inheritance rules, Enlil was the rightful heir due to his position as the son of Anu and the sister of Anu. Enki was Anu's only son, his mother had no royal blood. The female contribution to the genetic material includes mitochondrial DNA that the man does not have. Enki was assigned to operate in mining in Africa, Enlil in Mesopotamia and a granddaughter named Inanna received the Indus Valley region. The division took place and was completed in 3760 BC. To increase efficiency, the senior members of the Anunnaki brought in several subservient workers to assist in the gold mining work (known as Vigilantes or Igigi).The Igigi worked hard for some time, but inevitably got tired of their conditions of slavery and revolted against the Anunnaki.This forced the Anunnaki to establish a new plan, which developed a hybrid being, a primitive worker, to replace the Igigi miners. Could the missing link in human evolution be answered by the idea that extraterrestrials genetically created the DNA of Neanderthal man, combining it with their own DNA? The formation of our solar system according to the Sumerian text The following is a summary of the formation of our solar system according to the Sumerian era, Enuma Elish.According to the text, told in an allegory of celestial warriors, ten planets made up our solar system. The Earth was not yet formed, as it was then part of a larger planet called Tiamut, which ended up colliding with Nibiru during the initial formation of the planet's orbits, leaving behind a huge trail of debris from which the Earth formed, together with the asteroid belt. During this cataclysm, the forming Earth mass also captured Nibiru's moon. It is theorized that this initial disaster transferred the original seeds of life to Earth, an accidental form of Panspermia. The significance of the Sumerian Creation Epic specifies an additional planet in our solar system, the Anunnaki home planet, Nibiru, whose aphelion is positioned beyond Pluto in a 3600-year retrograde orbit around the sun. The Doctor. Robert S. Harrington, head of the United States Naval Observatory, used an infrared satellite, IRAS, to locate a large planetary body that was causing oscillations in the orbital paths of Uranus and Neptune. The IRAS produced results indicating that a large brown dwarf, four times the size of the Earth, had been located without question. Harrington and Van Flandern, of the Naval Observatory, published their findings and opinion that a tenth planet had been located in our solar system, even though it was called an intruder planet. [3] Harrington met with Sitchin to correlate IRAS 'findings with the Babylonian Creation Epic, Enuma Elish. Given the evidence reported by IRAS, other space probes such as Pioneer 10 and 11, Voyager and the corroborating orbital path, planet size, the passage of a tenth planet with the magnitude of Nibiru between Mars and Jupiter would certainly have a notable impact every 3600 years. With that in mind, it is highly likely that the Nibiru passage could be responsible for polar changes and reversals, changes in the Earth's precession around its axis and potentially dangerous meteors and space debris drugs along the asteroid belt towards the Perihelion. What were the Egyptians portraying in their hieroglyphics? Could they be telling the story of alien \"gods\" descending from the skies on UFOs? Unusual artifacts found around the world, those that seem to contradict the known skills of the civilization under analysis, are not difficult to find. Examples include hieroglyphs from the Egyptian temple of Abydos, representing rockets, airplanes, submarines and even an advanced helicopter. There is also a finding of Iraqi drums, precision stone masonry and architecture using megalithic stones. Of all the material accessible to a culture, why use the most difficult material possible? Massive blocks of 1000 tons. Discoveries around the world, including model aircraft, incredibly sophisticated solar and lunar temples aligned to the solstice and equinox, along with tens of thousands of advanced beings teaching civilizing technologies to indigenous peoples, point overwhelmingly to the fact that the Anunnaki were here on Earth. Sitchin was instrumental in getting the Sumerian details about Anunnaki records for the world to see. It took more than 100 years for the information to be accepted so far. Tablets are now scanned for translation speed and accuracy. An important point to mention is that the Sumerian flood account was clearly copied and modified to create the Genesis account, written by Hebrew priests held in captivity in Babylon, where they had access to the true story of the great flood, but chose to placate Enlil as your former chosen monotheistic astronaut god. After all, they were terrified of Enlil's wrath.Genesis 6 describes the background scene for the great flood, leaving out all references to the other members of the Anunnaki council in the Torah narrative. According to the Sumerian records, the wrath \"God\" in the Christian epic \"Genesis\" was actually an Anunnaki king named Enlil, who was tired of his brother Enki's genetic creation of humanity. Enlil feared that humanity would grow and eventually revolt against him, so Enlil ordered the destruction of humanity by disease and natural disasters. When human beings began to increase in number on earth and their daughters were born, the sons of God saw that the daughters of humans were beautiful and married any of them they chose.Then the Lord said: “My spirit will not deal with human beings forever, for they are mortal; his days will be a hundred and twenty years. ”The Nephilim were on Earth in those days - and also afterwards - when the sons of God went to the daughters of humans and had children with them. They were the heroes of the ancients, renowned men. The Lord saw how great the wickedness of the human race had become on Earth, and that every inclination of the thoughts of the human heart was just bad all the time.The Lord regretted having made human beings on earth and his heart was deeply troubled.Therefore, the Lord said: \"I will erase the human race that I created from the face of the earth - and with them the animals, birds and creatures that move on the ground - because I regret having created them\".But Noah found grace in the eyes of the Lord. Enlil (God in Hebrew Genesis) did not create man, but instead, his half brother Enki and his sister Ninmah were more involved in genetic manipulation, as evidenced in Atrahasis, prior to the Genesis account in 1700 years. Enlil apparently exterminated the man because of his incessant noise, although that reason seems bleak, and considering the animosity between Enlil and Enki, one must only consider that Enlil's motive behind exterminating humanity had something to do with the fact that the first humans were seeds of Enki and therefore had the potential to rebel against Enlil. Enlil was a ghost writer of the Bible and, consequently, the truth was distorted to benefit the latter. In addition, the “plant of the knowledge of good and evil”, the “forbidden fruit”, was present in Enki's first outpost city, Eridu. Enlil (also known as Jehovah / God) tells Adapa (Adam) in Eridu's Garden of Eden that if he eats the fruit, he will die. Enki counters this lie and tells Adapa that he will certainly not die, but will become \"like one of us, the gods\". Thus, there appears to be a transformational effect produced by this plant that changes human consciousness.In any case, Enki tells the truth and is demonized and symbolized as a snake, while Enlil lies and promotes himself as God. This lie, the fact that Adam did not die, but became aware of his nakedness, testifies that he did not want the plant of the knowledge of good and evil to be consumed. It was about controlling access to higher consciousness, disapproved of by Enlil. Humanity was the proud creation of Enki with the help of his relative Ninharsag, who successfully relieved the toil of the Anunnaki gold mines, just as he promised. Enlil said that he was tired of the noise of the men and wanted Enki to release some kind of disease to eliminate them. Of course, Enki challenged his brother and offered guidance and protection to the man. Enlil continued to order the death of the first humans. To end the man's death, Enlil orders Enki to conjure up a major flood. Enki refuses, and the tension continues to rise between the two brothers. Although the Anunnakitinha have the technological means to manipulate the climate, it is not clear whether the great flood that was to come was caused by the Anunnaki themselves or by the gravitational forces forged by Nibiru's passage from Earth, en route to a 3600-year-old solar perihelion. Regardless of the cause, Enlil took credit for establishing his perception of being able to punish. Hence the correlation between the Old Testament God of Wrath and Enlil's genocidal attributes.Before the pole shift, Enki warned one of his sons, Atrahasis, about the approaching disaster, helping him to create a boat on top of a mountain. The biblical story of Noah was taken from the Sumerian records. Before the pole shift, Enki warned one of his sons, Atrahasis, about the approaching disaster, helping him to create a boat on top of a mountain. The biblical story of Noah was taken from the Sumerian records. Enki decided to modify an oath made to hide knowledge of the impending aquatic disaster from the people and instructs his son Atrahasis to build a boat. Enki helps Atrahasis to relocate the boat to Mr. Ararat. It is also important to note that the idea that Noah harbored several species of animals on the boat is a mistake. It was the animal DNA that was collected and saved.Thus, Atrahasis is the biblical Noah. Also observed, Ninharsag would later be called \"Isis\" in ancient Egypt.According to the Sumerian records, one of Enki's sons, Thoth, was the creator and main proponent of humanity to become the \"Children of God\"through the awakening of energy bodies (chakras) and subsequent consciousness, which he designed to be sensitive to the various frequencies associated with radial distance and frequencies caused by a spherical resonator, that is, the Earth. You can read the Emerald Tablets to get a sense of the advanced knowledge of energy that Thoth possessed. In addition, as evidenced by his team, the Caduceus, he was an adept geneticist. Lawrence Gardner, in his preeminent book, Genesis of the Kings of the Grail, discusses the meaning of the ancient symbol associated with Thoth. Knowledge of energy, matter and the human pineal gland were at stake as a function of human consciousness connected to DNA. Enki designed primitive workers with highly scientific skills: Functional genetic mapping with a human energy body composed of 7 chakras.Chakras provide access to an evolutionary medium that allows humanity to continue on its path of conscious expansion.These seven quantized energy states were intentionally designed by Enki, providing humanity with an interface for the future evolution of consciousness. Enki did not seem comfortable with accepting the concept of slavery instead of creating a primitive worker who just took a genetic leap with the potential to become one of the gods. For the Anunnaki, the mechanism of evolution of consciousness was highly classified. Could the Sumerian narrative be the answer? Extensive, detailed and controversial, the Sumerian Creation Epic remains an opponent and an opponent of modern science theories, as well as today's most prominent religious doctrines, a subject of volatile discourse. These ancient writings help to broaden our knowledge of the origin of humanity, while challenging the well-established account told in the Bible. The Ancient Astronaut Theory can test the beliefs of the majority, since representations and dramatizations of extraterrestrial beings in the dominant culture stifled people's understanding of the latter, but the puzzle that surrounds the innovations and knowledge that the Sumerians possessed cannot be denied.The fact that numerous indigenous cultures around the world built monuments that looked to worship the sky and shared similar stories of \"gods\" rising from the \"heavens\" should raise the question of an extraterrestrial presence during those times. There is an incredible correlation between the stories and the knowledge base of ancient cultures and the timeline in which they acquired a deeper understanding of astrology, technology, biology and spirituality, subjects that have only gained adequate understanding in the past centuries. Sumerian records constitute one of the most important collections in human history to date. With proper analysis, these writings not only offer insight into our humble beginnings, but also offer answers about our final destiny as human beings. With these frightening revelations, I believe that I am taking a small step to reestablish the truth about the origin of man's evolution, which will still be a great leap in the knowledge of humanity's past. Surprised?Your opinion is very important.subjects that have only gained adequate understanding in the past centuries. Sumerian records constitute one of the most important collections in human history to date. With proper analysis, these writings not only offer insight into our humble beginnings, but also offer answers about our final destiny as human beings. With these frightening revelations, I believe that I am taking a small step to reestablish the truth about the origin of man's evolution, which will still be a great leap in the knowledge of humanity's past. Surprised?Your opinion is very important.subjects that have only gained adequate understanding in the past centuries. Sumerian records constitute one of the most important collections in human history to date. With proper analysis, these writings not only offer insight into our humble beginnings, but also offer answers about our final destiny as human beings. With these frightening revelations, I believe that I am taking a small step to reestablish the truth about the origin of man's evolution, which will still be a great leap in the knowledge of humanity's past. Surprised?Your opinion is very important.these writings not only offer insight into our humble beginnings, but also provide answers about our final destiny as human beings. With these frightening revelations, I believe that I am taking a small step to reestablish the truth about the origin of man's evolution, which will still be a great leap in the knowledge of humanity's past. Surprised?Your opinion is very important.these writings not only offer insight into our humble beginnings, but also provide answers about our final destiny as human beings. With these frightening revelations, I believe that I am taking a small step to reestablish the truth about the origin of man's evolution, which will still be a great leap in the knowledge of humanity's past. \n\n \n\nSurprised?\n\nYour opinion is very important.",
			"added": 1613061982
		},
		{
			"topic_id": 1613342125,
			"title": "Time machine",
			"body": "The Chinese would be building a time machine Creating a nicht time machine is trivial, but if we can rely on the reports (we can't), the Chinese would be starting a project like this. the time machine uses plutonium, probably haben, it is difficult to get, it does not sell in pharmacies, but the fact is that several websites are reporting the leak of documents detailing a project by the Chinese Academy of Sciences and a private company Shanxi Ruitai Tecnologia.",
			"added": 1613342120
		},
		{
			"topic_id": 1616368661,
			"title": "COVID 19",
			"body": "Russia did postmortem autopsy of the Covid-19 patient, big revelation happened. Russia became the first country in the world to perform an autopsy (post mortem) on a Covid-19 corpse and, after a comprehensive investigation, discovered that Covid-19 does not exist as a virus. It is a global scam. Doctors in Russia violated the World Health Organization (WHO) law, which does not authorize post-mortem autopsies on the bodies of people who died with the Covid-19 virus to find out after some time of scientific discovery, one cannot assume that it is a virus, but a death-causing bacterium that causes blood clots to form in the veins, and nerves, causing the patient to die from this bacteria. Russia defeated the virus, saying that \"there is nothing but phelia-intravascular coagulation (thrombosis) and the way to deal with it is to cure it\". With antibiotic pills (aspirin, which is also antibiotic) anti-inflammatory and taking anti-coagulants cure. It is indicating that a cure for the disease is possible, this sensational news for the world was prepared by doctors from Russia by post mortem autopsy (corpses) of the Covid-19 virus. according to some other scientists from Russia, ventilators and the Intensive Care Unit (ICU) were never needed. Protocols for this have already been issued in Russia.\nCHINA already knew this, but never released its report. Share this information with all your family, neighbors, acquaintances, friends, colleagues so that they can get out of fear of Covid-19 and understand that this is not a virus, but just a bacterium. Those who are victims of this should take Asprin-100mg, plus 500mg Cephalexin or equivalent. Because… ??? Por .because it has been shown that covid-19 causes blood to clot, which causes thrombosis in the person and due to which blood clots in the veins and because of this the brain, heart and lungs cannot obtain oxygen, due to the person's difficulty breathe and a person dies quickly due to lack of breathing energy. Doctors in Russia disobeyed the WHO protocol and performed autopsies on dead bodies that died of covid-19. doctors opened their arms, legs and other parts of the body and after examining them properly, they noticed that the blood vessels were dilated and the veins were full of thrombi, which usually prevented the flow of blood, and also reduced the flow of oxygen in the body, which causes the patient's death. After learning of this research, the Russian Ministry of Health immediately changed the treatment protocol for Covid-19 and gave aspirin to its positive patients. 100mg and started giving Empromax. as a result, patients began to recover and their health began to improve. The Russian Ministry of Health discharged more than 14,000 patients in a single day and sent them home. Source: Russian Ministry of Health\nis it true?",
			"added": 1616368655
		},
		{
			"topic_id": 1618865109,
			"title": "World",
			"body": "the world is dividing into counties, to be commanded by a single lord, and the world population is walking to fiefdom to complain.",
			"added": 1618865102
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1612126358_16HW9UmVm6tcYT4F7yQk2MK9AMKodiWjXy": [
			{
				"comment_id": 1,
				"body": "I'm sorry, I had 100 000 doge I exchanged for satoshis at the time, which didn't give many",
				"added": 1612130384
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 2,
				"body": "ivermectin has been the best drug for preventing COVID, I have been taking it every 6 months",
				"added": 1612175633
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "we are modern slaves, subjected to totalitarian governments",
				"added": 1612371909
			}
		],
		"1612656181_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 4,
				"body": "> [vinegarlover](#comment_5_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP): pics or it didnt happen\n\nhow do I put the photos here",
				"added": 1612661136
			}
		],
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 5,
				"body": "The lords of the flies are selling you illusions!\n\nTo those who live defending religions here in the group, it's time to look at the world without filters! Perceiving pastors who serve \"two masters\"; the Vatican as a bank, full of corrupt and corrupting people, a large bank, used for money laundering, owner of banks, arms and contraceptive industries; Followers of other religions, who are supposed to follow the creator, but who are terrorists! Others who say they are wronged, but are, in fact, great capitalists and invaders from foreign countries! It's just dirt! Selling illusion and enriching sellers! They are temples, and churches, full of doubtful symbols, or other infiltrated groups, common to obscure objectives, are secret and known to only a few! Make no mistake. Look at the world without blinders! You will see beautiful things, yes, but a lot of dirt on the corners. Lots of corruption and disrespect! Make no mistake waiting for eternal life, we are deceiving you, to live and create your own havens here on earth at your expense! The human right should be for everyone, do not give it privilege, because we all deserve it and we must have grace! Not just those who put themselves on pedestals! They are not saints, they are not divine, greater, superior, only more arrogant! Don't feed this arrogance!\nThere is a hidden government, manipulating everything for a long time! \"Who will this government be?\" It's time for us to know! To try to see behind the monuments!\n\nLook at the world without pretense, see without filters, and see good and evil and wanted to live in the light, the good and not in slavery, feeding \"the lords of the flies!\"",
				"added": 1612740374
			}
		],
		"1612664212_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 6,
				"body": "the lords of the world do not produce anything, but they want to reap the rewards of those who have hardened hands from working so hard",
				"added": 1612831288
			}
		],
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": [
			{
				"comment_id": 7,
				"body": "it has already started, and we are in the crossfire of this fight of giants, it will be very difficult to live in the stone jungle.",
				"added": 1613145600
			}
		],
		"1613152940_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 8,
				"body": "about the Great reset, there is an unknown, if the extraterrestrials appear everything changes on the planet.",
				"added": 1613164847
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 9,
				"body": "Scam",
				"added": 1613337230
			},
			{
				"comment_id": 11,
				"body": "in my income more\n3Qc8UZeCxjNvLGgRcRMe6DEHpx9z5e2rN3",
				"added": 1613604483
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 10,
				"body": "we know very little or almost nothing about the technologies that governments have, it may be that we live in a matrix",
				"added": 1613422367
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 12,
				"body": "> [ding249](#comment_1_1BeRW6Hg4F5qJ7ws3rR1UXmQM2cYNhUUPU): ding249\n\nI’m from Brazil here, it’s also forbidden to speak ill of the vaccine, the Supreme Court of Brazil has forbidden any contrary manifestation, we live in a dictatorship of the judiciary",
				"added": 1613815817
			}
		],
		"1613921466_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": [
			{
				"comment_id": 13,
				"body": "where low book",
				"added": 1613924238
			}
		],
		"1607832740_17KBErLZFLA8ktw9qqoCZvA4Xy8RNfPB5j": [
			{
				"comment_id": 14,
				"body": "> [sandroterra](#comment_1_1EKQn4wcm3q8gfDKRdxYgxEYraQ1LB62rA): Na minha opinião, não há como separar esses aspectos.A crise política gera a crise econômica que, por sua vez, gera a crise social.E a crise social, por sua vez, nunca deixou de existir. Partindo do princípio de que nunca houve verdadeiramente justiça social e a grande massa sempre sofreu e pagou pelas decisões dos seus governantes.O fato é que ainda não evoluímos como sociedade ao ponto de não precisarmos ser governados.A crise econômica afeta muito mais a camada mais desfavorecida. A distribuição de renda é desigual demais.E para piorar, nos deixamos manipular pelo mercado de bens e consumo. A grande farsa capitalista.Precisamos criar uma nova plataforma de pensamento, uma nova ideologia, com a evolução como alvo principal.Deixando de lado o egoísmo, nacionalidades e outros preconceitos que nos limitam e impedem que sejamos justos e humanos.\n\nComo evoluir se há uma manipulação dos meios de comunicação e mídias sociais, mostrando vencendores sem que haja batalhas de verdade",
				"added": 1614375178
			}
		],
		"1614725482_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 15,
				"body": "> [calmdownholden](#comment_23_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): That's how Keynesian Economics work.Contrary to what internet conservatives and libertarians will have you believe, the Austrian school of Economics ALSO supports equating spending to positive economic outcomes.Hoarding isn't Austrian economics, and an economy has to move to be working.Everyone shutting themselves up in their houses doesn't produce wealth.Wealth is a concept, as is value. Contrary to what many people have been lead to believe, most \"valuable\" materials aren't really that more precious than other common materials.Yes, this applies to gold and diamonds as well.No, your coin collection isn't going to make the history books, and you can't trade any of that if the economy crashes due to hoarding and a lack of spending.Think of the economy as a living thing. To be alive, it has to move.You're not promoting hibernation or nut-squirreling, you're promoting hoarding and suicide.Stop being stupid please.\n\nI agree, to build it is necessary to produce something that is commercialized and others have to buy, to revolve the economy.",
				"added": 1615026438
			}
		],
		"1615458168_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 16,
				"body": "Lula and Bolsonaro are both puppets in the hands of the owners of the world",
				"added": 1615500165
			}
		],
		"1616368661_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 17,
				"body": "> [5h1n1n9d4rkn355](#comment_16_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): 5h1n1n9d4rkn355\n\na friend sent by whatsapp",
				"added": 1616372900
			}
		]
	},
	"comment_vote": {}
}