{
	"title": "The Free Library",
	"description": "Free Ebooks hosted in ZeroNet",
	"links": "**The Free Library** is an ebook library hosted *entirely* in ZeroNet. All the books hosted here are made available to avid readers in a truly P2P fashion, with no need for torrenting software or off-site links.\n\nNew book every week or so!\n\n![](books/logo.png)\n\n### Links ###\n\n[About The Free Library](/1Hsv1b1ij5gAk5SGc23tmDmUQXwF31aXWb/?Post:2:Welcome+to+the+Free+Library!)",
	"next_post_id": 17,
	"demo": false,
	"modified": 1460945804,
	"post": [
		{
			"post_id": 16,
			"title": "George Orwell - Homage to Catalonia",
			"date_published": 1460944202.4,
			"body": "![Homage to Catalonia](books/Homage_to_Catalonia.png)\n\nFrom Wikipedia:\n\n> **Homage to Catalonia** is George Orwell's personal account of his experiences and observations in the Spanish Civil War. The first edition was published in the United Kingdom in 1938. The book was not published in the United States until February 1952, when it appeared with an influential preface by Lionel Trilling\n\nOne of Orwell's lesser-known books and a great read for those interested in modern history, and the rise and fight against Fascism during the 30s. On average, not much is taught about the Spanish Civil War, and this book, even with its biases helps fill in many of the gaps of that period of history. Enjoy!\n\n[DOWNLOAD](books/George_Orwell-Homage_to_Catalonia.epub)"
		},
		{
			"post_id": 15,
			"title": "The Hidden Wiki - Jolly Roger's Security Guide for Beginners",
			"date_published": 1460176283.6,
			"body": "![hidden wiki logo](books/hiddenwiki.jpg)\n\nGiven the extremely aggressive nature that tracking, surveillance and overall snooping have adopted in the recent years, it is natural to look for some cover or to learn how to defend yourself from them. During the beginning of darknets, that aggressiveness was originally much more apparent, but the truth is that even the clearnet isn't so safe anymore. So what do you do?\n\n---\n[The Hidden Wiki](http://gxamjbnu7uknahng.onion/wiki/index.php/Main_Page) is an extensive archive of documentation oriented to darknet surfers hosted in Tor, but it can be a little confusing to browse in. This book, authored by the pseudonymous *Jolly Roger* is a great starting point for any privacy-conscious surfer, darknet or clearnet.\n\nThe Jolly Roger explores past cases of anonymity breaches with extreme consequences, like the arrests of Sabu of lulzsec and Dread Pirate Roberts of the Silk Road, and teaches the basic secure communication methods like PGP, OTR, routing over Tor and tips on how to deal bitcoin securely.\n\nI recommend that **anyone** with a browser read this book as soon as they can. What I did here was to package it in a nicer format that people could read in a device; the original text can be found in this Tor [link](http://gxamjbnu7uknahng.onion/wiki/index.php/Jolly_Roger%E2%80%99s_Security_Guide_for_Beginners) for any further reference (and maybe even updates).\n\nEnjoy, and stay safe out there!\n\n[DOWNLOAD](books/Hidden_Wiki-Jolly_Rogers_Security_Guide.epub)"
		},
		{
			"post_id": 14,
			"title": "Harlan Coben - Hold Tight",
			"date_published": 1460174713.3,
			"body": "![Harlan Coben - Hold Tight](books/Harlan_Coben-Hold_Tight.jpg)\n\nFrom Wikipedia:\n\n> *Hold Tight* is a Harlan Coben 2008 stand-alone thriller dealing with problems of parental controls, teenage suicide, children independence and abuse of prescribed drugs. It features several characters that are equally important\n\n---\nGreat book. A coming-of-age thriller with a thick plot and vivid characters. There's a huge variety of subjects covered and, in fact, it's easy to get lost within its yarns at first. However, Coben is able to smartly weave them all together to intersect just at the right point, turning the story into a great novel that will keep your eyes in the screen. Enjoy!\n\n[DOWNLOAD](books/Harlan_Coben-Hold_Tight.epub)"
		},
		{
			"post_id": 13,
			"title": "Dan Brown - Digital Fortress",
			"date_published": 1459950540.9,
			"body": "![Dan Brown - Digital Fortress](books/digitalfortress.png)\n\nThe classic techno-thriller that springboarded Dan Brown into fame. From Wikipedia: \n\n> The book explores the theme of government surveillance of electronically stored information on the private lives of citizens, and the possible civil liberties and ethical implications using such technology.\n\n---\nI retroactively became interested in this book after I started learning about encryption a few years ago. Although at times it seems a little dated for today's standards (remailers, etc), it's a great novel nonetheless and gets you thinking about concepts such as privacy, security and whether the NSA really is the hero of the story. Enjoy!\n\n[DOWNLOAD](books/Dan_Brown-Digital_Fortress.epub)"
		},
		{
			"post_id": 12,
			"title": "Andy Greenberg - This Machine Kills Secrets",
			"date_published": 1459217083.391,
			"body": "![Cover of this machine kills secrets](books/thismachinekillsfascists.jpg)\n\nFrom the book's website:\n\n> WikiLeaks brought to light a new form of whistle-blowing, using powerful cryptographic code to hide leakers' identities while they spill the private data of government agencies and corporations. And the secret-killing machine continues to evolve beyond WikiLeaks, as a movement of hacktivists aims to obliterate the world’s institutional secrecy. This is the story of the code and characters–idealists, anarchists, extremists–who are transforming the next generation’s notion of what activism can be.\n\n---\nVery inspiring book. Greenberg tells us the story of the origins and future of Wikileaks, its theoretical workings and practical results, and how whistleblowing never has had so much potential as it does right now. \n\nEven if you never used Wikileaks yourself personally, after reading this book you will know that your daily web routine could have been a lot creepier but isn't- thank Wikileaks. Enjoy!\n\n[DOWNLOAD](books/This_Machine_Kills_Secrets-Andy_Greenberg.epub)"
		},
		{
			"post_id": 11,
			"title": "Bruce Sterling - The Hacker Crackdown",
			"date_published": 1459047363.404,
			"body": "![The Hacker Crackdown - 1993 Cover](books/hacker_crackdown.jpg)\n\nFrom Wikipedia:\n\n> Sterling's *The Hacker Crackdown* discusses watershed events in the hacker subculture in the early 1990s. The most notable topic covered is Operation Sundevil and the events surrounding the 1987-1990 war on the Legion of Doom network: the raid on Steve Jackson Games, the trial of \"Knight Lightning\" (one of the original journalists of Phrack), and the subsequent formation of the Electronic Frontier Foundation.\n\n---\nVery inspiring book that accurately recounts the early landscape of the internet and cyberspace for those who weren't around during that time. A must-read for the modern cyber activist: if you ever wondered how the Electronic Frontier Foundation came to be, and what were its goals, this is your go-to book. \n\nBruce Sterling actually managed to release it under a free license way before the concept of Creative Commons existed, which is pretty cool. Enjoy!\n\n[DOWNLOAD](books/Hacker_Crackdown-Bruce_Sterling.epub)"
		},
		{
			"post_id": 10,
			"title": "Chuck Palahniuk - Invisible Monsters",
			"date_published": 1458786420.217,
			"body": "![](books/Invisible_Monsters.jpg)\n\nFrom Wikipedia:\n\n> **Invisible Monsters** was originally supposed to be Chuck Palahniuk's first novel to be published, but it was rejected by the publisher for being too disturbing. After the success of his novel Fight Club, Invisible Monsters was given a second chance, and a revised version of it was published. The first edition was released in paperback in 1999, and revised on June 11, 2012.\n\n---\nMost people don't know this one partly due to the inflated success of Palahniuk's *Fight Club*. However, I've found that this one is a much better application of his sarcasm-loaded dark humor style of writing and won't be an easy book to put down once you reading it. Enjoy! \n\n[DOWNLOAD](books/Invisible_Monsters-Chuck_Palahniuk.epub)"
		},
		{
			"post_id": 9,
			"title": "Kim Heldman - PMP: Project Management Professional Exam Study Guide, 7th Edition",
			"date_published": 1458784592.446,
			"body": "![](books/PMP_7th_Edition.jpg)\n\nProject management is a paramount task these days, and Kim Heldman is ready to take the aspiring team leader, self-proclaimed project manager or member of the company's project management office into the next level by taking the much accreditted Project Management Institute's *Project Management Professional* certification exam.\n\n---\nLearn how to plan and deliver projects within the estimated cost, schedule and scope, identify possible risks and work your way to eliminating them, and fend off issues that come to happen in its lifecycle, while preparing for the world's most reliable Project Management certification.\n\n[DOWNLOAD](books/Project_Management_Professional_Study_Guide_7th_Edition-Kim_Heldman.epub)"
		},
		{
			"post_id": 8,
			"title": "Stieg Larsson - The Girl with the Dragon Tattoo",
			"date_published": 1458705360.891,
			"body": "![](books/the_girl_with_the_dragon_tattoo.jpg)\n\nFrom Wikipedia:\n\n---\n> **The Girl with the Dragon Tattoo** (original title in Swedish: *Män som hatar kvinnor*, \"Men Who Hate Women\") is a crime novel by the Swedish author and journalist Stieg Larsson (1954-2004) which, when published posthumously in 2005, became a best-seller in Europe and the United States. It is the first book of the Millennium series\n\nGreat detective/mystery novel from Stieg Larsson. Much better than the film adaptation, in my opinion. Enjoy!\n\n[DOWNLOAD](books/The_Girl_With_The_Dragon_Tattoo-Stieg_Larsson.epub)"
		},
		{
			"post_id": 7,
			"title": "George Orwell - 1984",
			"date_published": 1458704877.788,
			"body": "![](books/1984.jpg)\n\nGeorge Orwell's classic dystopian novel. \n\n---\nFrom Wikipedia:\n\n> **Nineteen Eighty-Four**, often published as *1984*, is a dystopian novel by English author George Orwell published in 1949. The novel is set in Airstrip One (formerly known as Great Britain), a province of the superstate Oceania in a world of perpetual war, omnipresent government surveillance and public manipulation, dictated by a political system euphemistically named English Socialism (or Ingsoc in the government's invented language, Newspeak) under the control of a privileged elite of the Inner Party, that persecutes individualism and independent thinking as \"thoughtcrime.\"\n>\n> As literary political fiction and dystopian science-fiction, Nineteen Eighty-Four is a classic novel in content, plot and style. Many of its terms and concepts, such as Big Brother, doublethink, thoughtcrime, Newspeak, Room 101, telescreen, 2 + 2 = 5, and memory hole, have entered into common use since its publication in 1949\n\nOf course I couldn't provide a free book library without including this classic. So here it is, DRM free just for you free thinkers of the net. Enjoy!\n\n[DOWNLOAD](books/1984-George_Orwell.epub)"
		},
		{
			"post_id": 6,
			"title": "Benny Lewis - Fluent in three months",
			"date_published": 1458704163.999,
			"body": "![](books/Fluent_in_Three_Months.jpg)\n\nCan you go from zero to fluent in any language in the world in just three months? Self-taught polyglot Benny Lewis says yes. \n\n---\nIn *Fluent in Three Months*, Lewis teaches a revolutionary methodology that focuses on the beginner's most dreaded aspect of language-learning: speaking. By speaking from day one, Lewis explains that the hardest skill of languages is stressed and forced to develop, therefore pulling along the other easier skills. Lewis also shows useful exercises and tricks on how to memorize foreign vocabulary, learn grammar and how to approximate the language to your own native one so as to make it \"feel\" less foreign.\n\nDoes it work? Take it from Lewis himself, who up until his twenties spoke solely English, and now has achieved confortable fluency in eight languages.\n\n**Disclaimer**: this reviewer only knows three languages so far :(\n\n[DOWNLOAD](books/Fluent_in_3_Months-Benny_Lewis.epub)"
		},
		{
			"post_id": 5,
			"title": "Cory Doctorow - Scroogled",
			"date_published": 1458702783.488,
			"body": "What happens when the a large data mining and search engine corporation takes over government tasks? The citizens get *scroogled*.\n\n---\nThis short story by Cory Doctorow explores the pitfalls of allowing data mining become the norm to background-check and police the population and how easy it could be to corrupt once enough \"interest\" is built into it.\n\nQuick, easy and very inspirational read from the master of sarcastic Science Fiction. Enjoy!\n\n[DOWNLOAD](books/Scroogled-Cory_Doctorow.epub)"
		},
		{
			"post_id": 4,
			"title": "Cory Doctorow - Content : selected essays on technology, creativity, copyright, and the future of the future",
			"date_published": 1458700776.709,
			"body": "If you thought Cory Doctorow was good at fiction, this essay collection will prove that he excels in both fields. \n\n---\nUsing the same irresistibly-worded prose, in *Content : selected essays on technology, creativity, copyright, and the future of the future*, Doctorow shows us why most copyright is a bad, backwards idea with respect to the future of computing, how can we really understand and profit from \"information economy\" and why \"Content\" is ultimately a meaningless term when dealing with computers and the information age.\n\nCould giving away ebooks for free actually help your print book sales as a writer in the age of the internet? Doctorow thinks it can. Enjoy!\n\n[DOWNLOAD](books/Content_Selected_Essays-Cory_Doctorow.epub)"
		},
		{
			"post_id": 3,
			"title": "Cory Doctorow - Little Brother",
			"date_published": 1458698150.327,
			"body": "![Little Brother - American Cover](books/Little_Brother.jpg)\n\nStarting off the list is the classic *Little Brother* by [Cory Doctorow](http://craphound.com). Description from Wikipedia;\n\n---\n> *Little Brother* is a novel by Cory Doctorow, published by Tor Books. It was released on April 29, 2008. The novel is about four teenagers in San Francisco who, in the aftermath of a terrorist attack on the San Francisco–Oakland Bay Bridge and BART system, defend themselves against the Department of Homeland Security's attacks on the Bill of Rights. \n> \n> The novel is available for free on the author's website under a Creative Commons license (CC BY-NC-SA), keeping it accessible and remixable to all.\n\nThis is one of the best cyberpunk novels I've ever seen, and is available for free. It is also the book that hooked me up into reading more of Doctorow's stuff. Enjoy!\n\n[DOWNLOAD](books/Little_Brother-Cory_Doctorow.epub)"
		},
		{
			"post_id": 2,
			"title": "Welcome to the Free Library!",
			"date_published": 1458698003.829,
			"body": "Unlike the other \"libraries\" and \"ebook sites\" you find around ZeroNet,  **The Free Library** contains ebooks hosted *within* ZeroNet, not as torrent magnet links or links to external sites. This means that you don't need any kind of torrenting software or to delve into the clearnet accidentally to enjoy the books: just click and get it!\n\n---\nBooks hosted here are either: \n\n - Free ebooks: available under Public Domain, Creative Commons or other similar permissive-style licenses, or...\n - Free**d** ebooks: ebooks previously licensed under dumb strict copyright, but made free by the marvels of technology :)\n\nI don't post books here because I'm a pirate, a communist or a criminal. I post them because I like them, and do even more the authors. Sharing is caring, and guess what? By putting their books here, I've essencially done the advertising for them *for free*. Which is OK by me - all these authors kick ass anyway, and deserve all the attention they can get.\n\nI strive to provide only epub ebooks, as I think this is the most flexible format around, but might fall back to PDF as a last resort, even though it doesn't play very well with smaller screens of phones or tablets.\n\nThe best way to stay up to date with this site and get the newer books I review is to follow it in your newsfeed (not the comments, only posts). I'll try to upload a new one every week or so, but my schedule may vary. Don't complain.\n\n## How to contribute to the Free Fibrary ##\n\nAlthough I harvest these books in my free time, I am open to contributions, be they new books, suggestions, money or even a note of thank you. You can contact me through [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=a4io5ziuf436y0df) so as to keep the convenience of using the ZeroNet infrastructure. Donations are good, and I might accept bitcoin donations later on, but frankly speaking my costs for maintaining this library are minimal thanks to P2P so it's probably not really necessary.\n\nI really would like to have a book submission system built someday here, but doubt that the standard ZeroBlog engine would ever allow that, so instead here's a quick hack that you can use to submit your books to me via ZeroNet if you use Linux and a shell similar to `bash`:\n\n - Convert your epub file to a base64-encoded text file: `base64 mybook.epub > mybook.epub.txt`\n - Compose a [ZeroMail to me](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=a4io5ziuf436y0df), and write the name of the book in the subject line.\n - Copy the contents of `mybook.epub.txt` into the message body and send me!\n\nI will decode the book, proofread it and if the quality is good, publish it here. Don't worry about whether you should encrypt it: ZeroMail does that automatically. \n\nFinally, a little note on the privacy of this submission process: ZeroMail requires you to actually sign in to it using some kind of ID (pseudonymous or not) so at system level, this submission is not anonymous. *However*, you can have my word as curator of this library that **I will not share the source** of any book I receive. You can decide whether to trust me or not at any given time, though.\n\nIn the meantime, enjoy your reading!"
		}
	]
}