{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 1,
				"body": "> [wejetheman](#comment_3_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U): Nothing. Hitler was a faggot. Most of the people on here are alt right and very few of them are Hitler fans. We don't fit into your contrived little boxes Kelly. We just love our people and our culture just like everyone else, even though they have made mistakes, just like everyone else. We want everyones cultures to survive, that means chinese and indians and, yes, white culture. Attacking whites will destroy our culture, so we oppose that naturally, but so will dissolving borders and homogenizing everyone into some global corporate monoculture and mono race.\n\nIf only things were that simple. Recently a comrade asked me how we could defend the Boers being killed in South Africa if we are supposed to respect the right of blacks to live on their continent. \n\nI felt the need to wake him up from his torpor by pointing out the obvious; the disappearance of whites in Africa shall never motivate blacks to leave the US or even Europe. It is a one-sided \"deal\" where only whites have to make concessions for other peoples. \n\nWitnessing history in the regard that whites tend to be annihilated in every country where they become minorities, it suddenly appear evident that there is no \"proportional equality of races\" to be had. In simple terms, it is a question of survival; if we don't cleanse them from wherever we live, we will be the ones to befall this tragic fate. Conquer or be conquered. \n\nPipe-dreams of living-space equality among the races is a manner of anesthetizing ourselves while they murder us. We are not morally superior because we let ourselves be replaced by other races. It's either us or them.",
				"added": 1603005988
			},
			{
				"comment_id": 2,
				"body": "> [tamamshud](#comment_9_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): And yet more denials, lies and deflections.The Poles weren't Bolsheviks; in fact they fought them (and won) from 1919-1921.The Czechs weren't Bolsheviks.The Danes and Norwegians weren't.Nor the Dutch, the Belgians, the Greeks, the Serbs, the French or even - after 1943 - the Italians. [...]\n\nIf I may permit myself, there are a few precision to be made. \n\nPoland and Germany could have been allies if the English didn't manipulate the simpleton Śmigły Ridz who pushed for war instead of a common agreement with Germany. German demands were very much acceptable, namely nothing more than a railway connecting the two pieces of Germany, railway supposed to be under international control, not even German. England (and consequently France) wanted war with Germany and they used the Polish head of state, promising him instant war support, mind you, that is not what happened. The English ultimately obtained what they wanted - the annihilation of Germany - and Poland lost everything. \n\nCzechia wanted independence from Slovakia and asked to become a protectorate of Germany, which Germany accepted. \n\nThe English publicly broadcasted their invasion plans of Germany, supposed to pass through Belgium, the Netherlands, Norway and Denmark. The Germans stated that if the English were naive enough to reveal their plans, then they would prefer to occupy these regions themselves instead of letting their enemies take a hold of them. All of this was radio-broadcasted and can be found in the archives. \n\nAs for the Greeks and the Yugoslavs, it was in no way planned by Germany. They bitterly had to help Mussolini in its failed conquest, spreading out precious German troops which they would direly had needed on the Eastern front. \n\nAs for France... well they declared war on Germany.",
				"added": 1603007318
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "You can provide the private key to the successor you chose for your website. That person will then be able to modify every single line of code of your website. The private key is not to be provided to anyone you don't trust obviously, as it is supposed to be only for yourself normally. \n\nAs for depression, I had it badly because of women-related issues. When I finally decided to give up on that, it relieved me from part of this weight. I forced myself to get out more and give myself simpler goals to attain in life. Ironically, as everything seems to be getting better in regards to my morale, all the rest solved itself quite well. \n\nI lost my job recently, and I'm actually enjoying it, so much free time and money, sleep in sufficient quantity, my smaller personal projects are moving forward and I even get to flirt with a very fine lady. One must live in the present, although it might be hard for people with higher intelligence. \n\nDon't expect much from life. After rain there is always sunshine.",
				"added": 1603200332
			}
		],
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 4,
				"body": "Well would you look at that!",
				"added": 1605546360
			},
			{
				"comment_id": 5,
				"body": "> [zeroseed2](#comment_34_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): Old news. But now 08chan is Active on zeronet?\n\nWhere is the link to the Zeronet website?",
				"added": 1605546386
			},
			{
				"comment_id": 6,
				"body": "> [edgelordofdecent](#comment_676_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/ [...]\n\nHm. There doesn't seem to be a /pol/ section on this website. The rest doesn't seem that interesting. \nIn any case, we need more of our people to come to zeronet websites, otherwise we'll never be able to fight back against censorship.",
				"added": 1605687964
			},
			{
				"comment_id": 7,
				"body": "> [edgelordofdecent](#comment_683_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx:pol:0 [...]\n\nThanks, it seemed like it was empty, but it was simply a question of giving more space for the website to download.",
				"added": 1605862188
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 8,
				"body": "Like everyone who has had suicidal thoughts before (like me), you must be aware of what weights your moral to such an extend. From my own experience, I was putting way too much pressure on myself, trying to solve matters which had no tangible solutions and it made me suffer through failure. \n\nI accepted the idea of having to abandon what made me suffer. When I accepted my fate, my mind gradually relieved itself from the depression. Since nothing mattered anymore, I stopped caring altogether, which made me feel better. \n\nSevere depression is usually a phenomenon of high intelligence when faced with daunting failure. Stop caring, become a Stoic, - almost dehumanize yourself by freeing yourself from emotions. Take a step back, be a little more selfish and enjoy the simple things of life. Relax yourself. \n\nDepression will not vanish instantly. This will be a very slow process with chronic depressive comebacks, however these comebacks will be weaker every time as you gradually get rid of your emotions.",
				"added": 1606605618
			},
			{
				"comment_id": 9,
				"body": "> [sj29msn5kz0ldmn](#comment_12_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): what if I have severe social anxiety, my job drains the fuck out of me, and my chances of finding a better one are next to zero...\n\nThen change your job. I've had a horrible job before. When I changed everything seemed so bright; decent sleeping hours, easy job, better pay, not intellectually exhausting. Restaurant every day. In other words, paradise.",
				"added": 1606606194
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 10,
				"body": "I think we can all agree that what we really need is to make ZeroNet more accessible to the general public by; \n\n1) Having a notification system which tells us when people respond to our messages. \n2) Make ZeroNet constantly run in background of computers and mobile devices, so that seeding remains constant. \n\nCensorship is never going to stop on any of these platforms. The decentralized net is the future, and the sooner these alternatives will be viable, the sooner we will be able to grow once more.",
				"added": 1606734334
			},
			{
				"comment_id": 11,
				"body": "> [sword000000](#comment_20_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): SSB network\n\nAre you talking about Scuttlebutt? I am testing this app and I don't know whether this is fully P2P or still reliant on some centralization. The download speeds are such that I would believe it to be at least partly centralized. \n\nThe interface is also somewhat weird. I am unable to understand how to leave a server or how to create one myself.",
				"added": 1606757271
			},
			{
				"comment_id": 12,
				"body": "> [sturmwaffle](#comment_11_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE): Are you talking about Scuttlebutt? I am testing this app and I don't know whether this is fully P2P or still reliant on some centralization. The download speeds are such that I would believe it to be at least partly centralized.  [...]\n\nIt also seems impossible to remove comments. Which can be most annoying.",
				"added": 1606761395
			},
			{
				"comment_id": 14,
				"body": "> [beenotung](#comment_56_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): That's due to the blockchain-like design.While we can implement soft-delete or best-effort hard-delete of we employ techniques like Chameleon Hash. [...]\n\nYes, it makes sense. One has to be particularly careful about what he or she posts. \n\nI also tried Patchbay but it doesn't seem to be working at all or even close to properly.",
				"added": 1606817368
			}
		],
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 13,
				"body": "> [dv1](#comment_34_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): well , you are not browsing the \"dark web\", gazillion adds are not .onion adds. You are surfing normal clearnet but hiding your IP through Tor (theoretically as everyone in the darkweb knows Tor is a CIA/NSA honeypot). Therefore, the adds you see are the adds triggered by the IP you are out to the internet. Darkweb sites are .i2p, .onion, zeronet, and freenet sites among others, I do not see money on adds coming from visiting those sites.\n\nI absolutely agree. A lot of people still believe Tor to be a viable anonymity solution when it is literally sponsored by the federal government of the United States... \n\nTo be totally honest, even VPNs aren't trustworthy. Who in his right mind, would believe that when the federal government comes around and threatens these companies with shutdown if they don't provide their data, - that they would somehow disobey the law in order to protect an obscure user on their network? How naive must one be to believe such a thing? Whether they are paid or not makes no difference in this regard.",
				"added": 1606816513
			}
		]
	},
	"comment_vote": {
		"2_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"1_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"3_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"676_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"683_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"8_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"9_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"1206_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	}
}