{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1610894921,
			"title": "Possible Problem on Zeronet To Register a New Account on Zeroid To can Speak. Junuary 2021",
			"body": "Hi .. I have installed Zeronet on whonix past less of 3 day ago due to a crash of my hard drive .. i try to write on zerotalk or any other site to share my new site .. nothing working .. is say i need to register .. fine i try to register on Zeroid Over tor ! is say Network full error in Red something like that to try again later i try and i try Nothing working .. Finally i have find that site on ZeroSites \n\nThat site the first when i have open this site is say Registered .. like the account have try and try on the second site .. wirds but working ! \nhttp://127.0.0.1:43110/zeroid.bit\n\n\nhttp://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/\n\n\nFor information i have click on the 3 Circle (settings) and click on Up to date the button to Check if my version of Zeronet is ok .. and i have lets Scan like and all same to working ! now with maybe less of 2 site With an error like Failled ! i have too fallow this : http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/  ...",
			"added": 1610894920
		},
		{
			"topic_id": 1611499319,
			"title": "Zeronet (can received Attack ) ?",
			"body": "https://github.com/HelloZeroNet/ZeroNet/issues/1016\n\nI see on my Main site index the update working well but on 4-6 of my Otter site on zeronet Update failed ... and is doing that approx each day .. I will continue to seed and Soon offer a Tor site where the file will be Shared ! ..\n\ni think a Botnet try to connect and disconnect approx each min .. to crash the site .\n\ni have see on zerotalk other user speak about that past 1 week ago .. i use Whonix and in Vanguard addon Log i see Possible attack on tor or Bug... is maybe du to the ''Bug'' Attack of tor the January 2021 ...\n\nMy index site is not Big file but for the other for the moment the 4-6 other site Who not working is only index page but will be File sharing soon ! ..",
			"added": 1611499317
		},
		{
			"topic_id": 1611899028,
			"title": "what is mean (zeronet discover lan clients ?",
			"body": "AnnounceLocal\nDiscover LAN clients using UDP broadcasting. (default: enabled)\n\nhi i see in the Setting of Zeronet that .. what is mean ? .. Does is mean in my Lan network (router over Lan is Try to see if any other device Computer use Zeronet or Try to share zeronet ? )",
			"added": 1611899025
		},
		{
			"topic_id": 1615401715,
			"title": "The Zona Community Under Build ! ( child lover - pedo )",
			"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/",
			"added": 1615401711
		},
		{
			"topic_id": 1618873749,
			"title": "The Zona Community [ Pedo Child lover]  Join Us",
			"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/\n\nhi This is Our Community of The Zona on Zeronet Is not Finish and We share Video in the Video Section (babies) .. Be patient when we have time we will continue and share more ! ... you can find us on Tor.. we Recommended Whonix to Access to the Zeronet ! .. zeronet over tor ! \n\nhttp://iqqa4ew73bsuxnapok3yqirp7xxvbfhzzjimci7vdg3km6r2pnd7lcqd.onion/topic-link-zona.html\nthis is our Tor Site !  username: zona  password: anoz",
			"added": 1618873744
		},
		{
			"topic_id": 1622398110,
			"title": "The Zona Database of child porn Under Build .. Find our Community Here ..",
			"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/",
			"added": 1622398104
		},
		{
			"topic_id": 1622430449,
			"title": "Zeronet how to Block the Cloning of our Zites\n",
			"body": "hey all , How to we can block the Cloning of our Zites .. any Tutorial ?",
			"added": 1622430442
		},
		{
			"topic_id": 1623112333,
			"title": "zona pedo community (Tor-Zeronet) Our Database Under build Already + 100 Video Shared !",
			"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/\n\nHi all We Recommend A Secure Os like Whonix to use zeronet inside To pass All Zeronet over tor !!! ..\n\nFor see our Video or Folder or page you need to Download that mean to Be Seeded .. that take time ! 1 day - 1 week ? .. .\n\nOur site in Tor !\nhttp://iqqa4ew73bsuxnapok3yqirp7xxvbfhzzjimci7vdg3km6r2pnd7lcqd.onion/topic-link-zona.html",
			"added": 1623112325
		}
	],
	"topic_vote": {
		"1610894921_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": 1,
		"1611356502_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": 1,
		"1611396015_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": 1,
		"1611017756_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": 1,
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy": 1,
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"1615401715_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": 1
	},
	"next_comment_id": 89,
	"comment": {
		"1610391633_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 2,
				"body": "Our Hard drive have crash.. Here is the Zona new Community you can verify on Our Tor Site in Junuary we will add our new Community of the Zona on Zeronet There .. ! for the moment 17 junuary we dont have take time to add the link ! .. we have loose the old Community of Zeronet End with fhEX/ .. we have made Now a backup External of our User.json (private key) of all of our site ! .. Stay safe be patient .. we close for less of 1 day 17 Junuary Our New Server (site).\n\nif you cannot access to the Zona Community today try again another day is maybe because we have close the server . when we go Outside too far a way of our server ! .. same for our tor site ! \n\nOur new Community of Zeronet and the Last ! \nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/",
				"added": 1610898125
			},
			{
				"comment_id": 3,
				"body": "if someone have a problem with Zeronet over tor See this : \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1610894921_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs",
				"added": 1610898208
			},
			{
				"comment_id": 5,
				"body": "> [mxh69420](#comment_60_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): yall still spamming zerotalk with your dumb links? bruh we didnt want to watch kids get raped the first time you shared.\n\n\nFuck you Mxh69420 .. you are a Hater and Anti pedo .. Just Shutup and ignore me ! .. is too complicated to do that if yess leave zeronet ?.. ! Stupid guy of you are .. Easy for you to insult me behind your computer ! .. .. i dont care about anti pedo first and for information + 150 Seeder with the other project .. !! ",
				"added": 1610976252
			},
			{
				"comment_id": 6,
				"body": "> [namvata55](#comment_20_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): Fucking poo in loo indian pedophile faggot, learn to speak fucking english\n\nGrammar Nazi Get out of here .. ! i dont care about you .. yess i dont speak English .. i try to is better than a fag like you who speak behind is computer to insult me .. on my Post..",
				"added": 1610976603
			}
		],
		"1610974197_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 4,
				"body": "Veracrypt you can create a Volume (conteneir) to put file inside and upload on internet. or you can compress with .7z with password .. but for security is Recommended a Veracrypt volume. ! \n\nif you make a little bit of search you will see \nhttps://www.veracrypt.fr/code/VeraCrypt/plain/doc/html/VeraCrypt%20Volume.html\n\nhttps://www.veracrypt.fr/code/VeraCrypt/plain/doc/html/Creating%20New%20Volumes.html",
				"added": 1610976081
			}
		],
		"1611017756_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": [
			{
				"comment_id": 7,
				"body": "same problem over tor i think Tor continue to Received ddos attack .. i am using whonix and Vanguard the addon i see possible bug or Attack on tor .. Each hours ..  https://www.technadu.com/attack-tor-causes-v3-onion-downtime-experimental-fix-land-soon/240121/\n\nif yo are not using tor maybe the persons who share (seed) the site use tor.. We need to be patient .. soon Tor will releash an Official Update of tor a new version when we will Update our tor version All supposed to be ok.. for whonix we need to start whonix check , make the update , disk upgrade .. if i have understand ! ..",
				"added": 1611021746
			},
			{
				"comment_id": 8,
				"body": "> [orien3242](#comment_46_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): its a bug check the tor twitter and update your version of tor.  [...]\n\na bug okais but for the whonix workstation i have Update the tor to the last if is patched already .. i dont speak well english but for the gateway .. i dont see how to upgrade tor .. in whonix check all same to be ok .. tor 0.4.4.6 recommended i think is whonix need to offer a new version of tor for whonix . ? is maybe the problem why i have update failled with all of my project on zeronet , and i see in vanguard log   possible tor bug or possible attack at Each hours .. is continue !",
				"added": 1611029677
			}
		],
		"1611199036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [],
		"1611356502_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 10,
				"body": "http://iqqa4ew73bsuxnapok3yqirp7xxvbfhzzjimci7vdg3km6r2pnd7lcqd.onion/topic-link-zona.html  \nusername: zona\npassword: anoz\n\nThere you can find the Reddit of the darknet , darfail , search engine and + Child porn <3",
				"added": 1611364894
			}
		],
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 11,
				"body": "its you the Retard Fagot .. Now mute me .. dog",
				"added": 1611438446
			},
			{
				"comment_id": 12,
				"body": "Retard its Faggot like you who judge the people with Different Sexual orientation .. i am Proud to be a Child lover !",
				"added": 1611438517
			}
		],
		"1611396015_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 13,
				"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/  The Zona we are Also On Tor ..\n\nhttp://iqqa4ew73bsuxnapok3yqirp7xxvbfhzzjimci7vdg3km6r2pnd7lcqd.onion/topic-link-zona.html\nusername: zona\npassword: anoz \n\n\nDont Feed the troll who try to scare you Away of The Deepweb or Zeronet.. ! if they are faggot is not our Fault  ! .. We Recommended Whonix The Secure Operating System to use zeronet inside. We recommended a computer with No mic , no cam, No Wlan card for having Wifi .. use Only a Cable network to a Router Vpn no log or router Tor ! ..",
				"added": 1611438654
			},
			{
				"comment_id": 14,
				"body": "Remember you can Ignore (mute) the Fag Anti pedo on Zeronet ..",
				"added": 1611438728
			},
			{
				"comment_id": 15,
				"body": "> [uwnz](#comment_5_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8): Go away FBI\n\nStop Trolling .. Everyone can be the Fbi .. Secure your Self ! ...",
				"added": 1611438765
			},
			{
				"comment_id": 16,
				"body": "> [lordfirefox](#comment_10_1Ec11mGe5joBoboUH2s2idKHp1YVbzaepq): Pedos need to be executed.\n\nIts the Oppressor like You .. the anti pedo Should be Executed .. Faggot !",
				"added": 1611438802
			},
			{
				"comment_id": 17,
				"body": "> [interpulsar](#comment_1_1ACGe8Zv9zqpWKPHhsqQzdL5Zu3ud71N8Y): You need help, actually just kys\n\nFaggot of Anti pedo you kill your Self .. we are Proud to be Child lover !",
				"added": 1611438839
			},
			{
				"comment_id": 18,
				"body": "> [happyrabbit](#comment_11_1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT): do us a favor and kys\n\nLittle dick of American .. you kill your self !",
				"added": 1611438861
			},
			{
				"comment_id": 19,
				"body": "> [biznizman](#comment_5_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): Hello Mr.FBI agent! Tell your ZOG handlers that we aren't as stupid as you think, even if we were kiddy fiddlers.\n\nSuch of Paranoid of you are .. Leave if you are a fag.. !  .. we are [our community in Tor too ! ]",
				"added": 1611492401
			},
			{
				"comment_id": 20,
				"body": "> [snahpanon](#comment_4_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v): thanks for bumping this you retards. just let it die.\n\nis the anti pedo the retard !",
				"added": 1611492427
			},
			{
				"comment_id": 21,
				"body": "> [transcoder](#comment_19_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): Definitely a fed poster, no one is actually dumb enough to ask a question like that openly\n\nZeronet is Supposed to be Securely. and in whonix is Better ! if you cannot secure your self because you use Windows and your True ip adress you are Not secured .. The anti pedo are Retard .. Fat ass .. powerless shit !\n\nhttps://www.whonix.org/wiki/ZeroNet",
				"added": 1611492488
			},
			{
				"comment_id": 23,
				"body": "> [thedarkmaster](#comment_1_18qRmb5CCTuAwYDYLRGC9cZrnRe4Bt3rjb): Actually kill yourself. Pedos deserve the death penalty\n\nUntil The zeronet dont make Update failed i will Share Each day Everywhere random place 1 picture or video child porn .. Pedo will like and anti pedo will mute me :) Fuck you all anti pedo ! and Enjoy.. After i will create New Zeroid Account to share with the new account ? call its Spam i dont care. !! i wait The Zeronet working to 100 % .. \n\nNeed tor to Open the gif ( No need JavaScript)\nhttp://pu6jmdcfuij5hntin52acnw6myjidvwn2xgdckxao5imwabw6ljdm6yd.onion/uploads/IvA6Wkec5doFDBiprt/0CFF2839x3670x4F98xAB84x1BA6E004D358.gif",
				"added": 1611522691
			},
			{
				"comment_id": 24,
				"body": "http://jyfilvmxy6ccfrwjzydl2fwpyk5alcsf7xlzl2a5mywkfh73c32mtrid.onion/MJScGw/032104XbbETzT.gif",
				"added": 1611523321
			},
			{
				"comment_id": 25,
				"body": "http://xemfspueps4f2j7mo7xgnixgq6uoepkp733f3jxnakxmvsl7x2ex7sqd.onion/CieQBm/153976835637.jpg",
				"added": 1611523501
			},
			{
				"comment_id": 26,
				"body": "http://jyfilvmxy6ccfrwjzydl2fwpyk5alcsf7xlzl2a5mywkfh73c32mtrid.onion/1IlCpD/124205KUUuf.gif",
				"added": 1611523559
			},
			{
				"comment_id": 27,
				"body": "http://jyfilvmxy6ccfrwjzydl2fwpyk5alcsf7xlzl2a5mywkfh73c32mtrid.onion/1IlCpD/124205KUUuf.gif",
				"added": 1611523597
			},
			{
				"comment_id": 28,
				"body": "http://cryptoupei2am6si.onion/index.php?file=9840cecc4e2549207bda6047e119f7ae.jpg",
				"added": 1611524834
			},
			{
				"comment_id": 29,
				"body": "http://3b6clio4syptsnvvtzyxifqvtizyazgyowpp3v5f7dj3mzmfhyoy4iyd.onion/images/4f10fa4e6f815dfc8db35f3f8dc52f0c.jpeg",
				"added": 1611524849
			},
			{
				"comment_id": 30,
				"body": "https://www.datafilehost.com/d/486f4167\n\nVideo Cp",
				"added": 1611525208
			},
			{
				"comment_id": 33,
				"body": "> [hyperpoopean](#comment_1_18UtHPzm93P1s5L5nLXfCi7TGLsRspLeR3): CIA glow in the dark NIGGER\n\nPowerless shit you are hyperpoopean .. !",
				"added": 1611703991
			},
			{
				"comment_id": 34,
				"body": "> [coke](#comment_1_1GSAHLoQsA2UUcszw2VTN7tCeyizFruqqC): fuck you\n\nohh is all of you can say ? haha. you fuck you piece of shi*",
				"added": 1611704011
			},
			{
				"comment_id": 36,
				"body": "http://3b6clio4syptsnvvtzyxifqvtizyazgyowpp3v5f7dj3mzmfhyoy4iyd.onion/images/8147494f96ebd1c960c8bf547f70f522.jpg Greta thunberg Nude picture (Fake) <3 You can copy the link and past it into the Url bar .. in tor Browser ! ",
				"added": 1611710263
			}
		],
		"1611507255_1PFNFDTCBgFcXV87E4oP5gBund9igbHB7Q": [
			{
				"comment_id": 22,
				"body": "zeronet as start same to be a good idea .. when you see of they can received an attack and all of your project 3/4 have Update Failed ... even on github zeronet they speak about that they cannot do anything about that .. only 1500 User same to use Zeronet approx ..",
				"added": 1611516289
			}
		],
		"1611499319_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 31,
				"body": "https://github.com/HelloZeroNet/ZeroNet/issues/2622  possible problem came from Zeronet limited to 20 mb Max File ??\n\n .. (How does is possible we can modify this limit in our Site Admin ) .. but is same of Make update failed Does is an Attack i am not the only who speak on zerotalk about that in the last week !",
				"added": 1611528659
			},
			{
				"comment_id": 32,
				"body": "> [baduser](#comment_17_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): what\n\ni dont speak well english but what i say is i think zeronet site can Received attack like ddos .. Botnet user who connect and disconect make Update failled on all site.. (Update failed on site targeten by the botnet) .. i host Illegal site on Zeronet over tor .. and now i see Update failed ! i will try to see if later the problem is solved !",
				"added": 1611561469
			},
			{
				"comment_id": 37,
				"body": "hi today i have see on 3/4 of my site on zeronet like Working to make the Update and the user seed .. now i go see if all working i see again Update failled an icon orange a side of the number of seeder .. when i see the Log in Whonix my operating system i have a Log in Vanguard i see possaible tor bug or attack if very frequent .. that do the same when tor Received a ''Bug'' attack on V3 tor link Consentus .. if i am not wrong is possible the problem or Past ++ hours ago i have more seeder True who seed and now is not the case maybe because they are close .. \n\ni want to precise on my Main page the First site on zeronet all working i have + 50 seeder .. the other is say like no peer or 1-8 Seeder Update failled ..  i have thinking is a Botnet or a Form of Attack who slowly my site and make update failled or something like that ..\n\ni use Whonix and all pass over tor .. ",
				"added": 1611746651
			}
		],
		"1611680008_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 35,
				"body": "hi , what you mean by A static Site ? .. example i build a Community like a youtube but for porn .. approx in less of 10 month probably i will have Almost finish.. i can edit the site and add the file Each day if i want when i public shared to all the new update.. you can do that if you want .... does a static site is like zerosites Where the user can add something and not just the Admin ? .. or Zeroupload ?",
				"added": 1611710087
			},
			{
				"comment_id": 39,
				"body": "> [weakish](#comment_15_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): Exactly the opposite. Only the admin/site owner can edit a static site. For example, ZeroTalk is not a static site. [...]\n\nohhhh okais thanks for the inform",
				"added": 1611755820
			}
		],
		"1611727013_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [],
		"1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy": [
			{
				"comment_id": 42,
				"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/  The Zona a New project Under Build Pedo we are in Tor network too !",
				"added": 1611758221
			}
		],
		"1576059419_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": [
			{
				"comment_id": 43,
				"body": "> [pexo](#comment_179_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Disclaimer: I am the owner of PedoHub.   [...]\n\ncan you share the link or explain how to access to pedohub thank",
				"added": 1611760250
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 44,
				"body": "> [biznizman](#comment_6_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): USE TOR! ALWAYS AND WITHOUT EXCEPTION! [...]\n\nYou are the Asshole .. maybe you dont know but A lot of people are opressed If is the good word in english ..The only way to Be Free is to find that kind of place Tor ,Zeronet .. If you are too scary to open any link Dont go on Zeronet .. because is sure you will find Child porn .. ! i will share Everywhere and I am not the only one who doing this in the next Month ! \n\nand for respond to the Thread Autor !\nAbout veracrypt Remember you can Be Forced to Reveal your password hard drive or rest in jail in case of arrest .. Key Disclosure laws !! .. Use Tails (the operating System) + an Hard drive encrypted with Luks (in tails you can doing that) and inside your hard drive you can Create a Hidden volume veracrypt inside the hidden volume you can install Hidden vm (virtual machine) and in the final import Whonix and use whonix to install Zeronet ! .. in the final in case of arrest you have Nothing ! .. just a Normal Volume to show with normal file ! all pass over tor and is Better secure in case of JAvascript Payload by ''hacker'' ! or File infected ..",
				"added": 1611793647
			},
			{
				"comment_id": 45,
				"body": "https://www.whonix.org/wiki/ZeroNet",
				"added": 1611795717
			},
			{
				"comment_id": 46,
				"body": "> [kixun](#comment_5_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq): Why stay away from 08chan and what is it?\n\nbecause they are scare to see child porn or illegal file because on zeronet when you visist a site you seed if you dont delete after the site you continue to seed and when you seed is mean you Download automaticaly the file .. if you use Whonix + zeronet .. and all is hide inside a Hidden volume veracrypt normaly you are ok but if you use only windows + zeronet with your True ip adress ..\n\nif you are a Child lover too Visist Us on Zeronet or tor here : http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/   Under build ! ",
				"added": 1611873942
			},
			{
				"comment_id": 48,
				"body": "> [477](#comment_11_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): zonateam, do you know all of the IP address connecting zeronet could see anybody? And if you're not using tor always mode, your raw IP address can leak easily?If you're using tor always mode, exploring your raw IP is possible for investigating because zeronet couldn't use with the VPN(but could use with proxy). Or, maybe leaked your private information by a JavaScript zeronet support.If your site has some brittleness? Leaked your info from other place?.... [...]\n\nthank for the inform i use Whonix , and outside Device like anonabox ,router tor ,router vpn i cannot give any information more of that but Whonix is a Secure Operating System and all pass over tor in the Gateway to the Workstation and yess in the Setting of Zeronet is for Tor Alway mod , + I dont have any Mic , camera ,or Wlan card for Wifi .. i use only Cable to the device who pass my Trafic again over secure network.. i am sure i dont have any Leak of Dns , ip adress etc\n\n\n\n\nand is what whonix say about zeronet:\n\nThis means users are not identified or reachable by an IP address, since they are identified by a public key - specifically a public Bitcoin address. The private key owner can sign and publish changes, which are propagated through the network. Sites are accessed through an ordinary browser in combination with the Zeronet application. [2] The BitTorrent technology refers to the use of trackers to negotiate peer connections. [3] ZeroNet can be optionally configured to use Tor for anonymity. [4]\n\nThe Zeronet wiki describes various features and benefits, including: [1]\n\n    Password-less authorization - the user account is protected by the same cryptography that applies to Bitcoin wallets.\n    Easy setup. [5]\n    Immediate updating of sites in real time.\n    Works with any browser.\n    Full Tor network support, including onion services.\n    Content cannot be censored (removed) after publication.\n    It is impossible to shut down content, since content is served by any user who wishes to.\n    ZeroNet is fast and works offline.",
				"added": 1611887132
			},
			{
				"comment_id": 50,
				"body": "> [477](#comment_13_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): Thanks. I don't know whonix wiki explained zeronet.But you know, zeronet peers are in public. Users are not found as manager/administrator, but maybe as peers.(if they uses raw IP) [...]\n\nI understand about to not Share my site on Any topic who don't ask about that or For that kind of content is ok for me . but when i received insult from X member is difficult to respect them after, \n\nand Yess On my Tor Site where i share the Zeronet site i Explain to use Whonix to hide their Ip adress in case of Zeronet Not hide their ip adress for Security  , and on The Zeronet site i Recommended Whonix too but , Who know Does is True Member who seed the site with their Real ip adress is stupid .. \n\nDoes is a Bot who Share my site , does is People over Vpn ? is wird because past less of 1 week ago i sed Update failed and before Share my Site past 1 month ago approx i dont have give the link to anyone and  have ++ seeder Already as start on Github Issue Someone have the same problem and speak about botnet attack etc is wird .. but thank for the information\n\ni Maybe dont have Fully understand about zeronet For the No user of Tor -zeronet but Zeronet is not supposed to Hide your ip adress to give a Identity like a Bitcoin wallet something like that ? i see on the panel of the site onion 116 [seeder] ",
				"added": 1611891488
			},
			{
				"comment_id": 51,
				"body": "good to know , but i think Again like explain Whonix is the Best way to Use Zeronet because The hacker even if they hack you with something on Zeronet they are inside the workstation .. the workstation are connected to the Gateway the whonix say No ip adress leak possible even if the hacker as the Root password(admin password).. i have already write this here but nothing is Bullet proof but if Everyone pass over Tor,vpn and multiple device or As minimal tor .. Is Very Difficult to close a Zite because is not 1 place who seed over tor , and they need to find who is the Admin over + 1000 Seeder example in the World , and I think if i have understand is not important but Zeronet when you seed you seed to 5 member and the 5 member seed to 5 other ? and 5 other to  5 other etc .. \n\nthe best Way to be secure is The Tails Operating System .. When you close tails All is Erased is in the ram .. You can like explained use Tails as Host System , in tails you can Encrypt 1 hard drive (in tails - Application  disk - you choose a disk Erased the disk , Encrypt with a long long password , in the final you have a disk encrypted .. After For Protected you in case of ARrest they force you to REveal your password Encrypted or not to open the disk .. you can use Veracrypt Hidden Volume .. you have 2 volume .. is 1 file to show .. when you want to open the Volume is Ask for a password .. you have 2 pssword 1 is for give to The Cop is show a Normal volume .. not possible to prove you have a Hidden volume is like a Blank part Erased .. if you enter the second password you enter in the hidden volume .. \n\nin the hidden volume you can install Hidden vm on github (is virtual machine for Tails) .. in the final you can have hidden vm and Import Whonix and use Whonix in tails and Hidden .. in case of arrest you take out the usb drive of the computer (usb of Tails ) or just Shutdown tails and is Erased the ram .. no trace in the ram .. Tails Close All and They see if they force you to reveal your password of Disk encrypted Only a Volume Normal of Veracrypt No Way to prove you use A hidden volume ! .. \n\nwith all of that you are probably Better safe on internet and can seed Whatever you want ! \n\ni re explain again in this topic Better of i Can and for the new user who reply <3 .. i am For The Freedom of everyone.. today we have Too Cencor too lie too People who oppress the other .. is not in that Kind of world i want to live !",
				"added": 1611893215
			},
			{
				"comment_id": 52,
				"body": "> [477](#comment_14_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): I apologize if you're hurt by my word. [...]\n\nthank i see , i am not hurt , i just dont speak well english, what i try to say is  i think 3/4 of my user use Tor because i see onion like explain onion 116 seeder on 125 approx , i have put an Advice on the Main page on Zeronet About that to be more clear ,\n\nthanks you",
				"added": 1611893538
			},
			{
				"comment_id": 55,
				"body": "> [startrek](#comment_7_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE): Already, this service is quite slow to load at my end. Is it because of low nos. of peers online? My main issue is won't routing it via Tor make it even slower, to the point of non usability?\n\ni fallow the pedo hidden whonix guide shared on Our site The Zona .. Is explain how to use Tails + A disk encrypted + create a hidden volume veracrypt inside + .. inside the hidden volume .. install the Hidden vm (on github) .. is Virtual machine .. and inside the Virtual machine import whonix .. in whonix the safest operating system you can fallow the whonix guide to install zeronet.. All pass over tor .. in less of 4 hours from start all is Done and working .. in my side Nothing is slow all working well .. ! \n\nmy sites:\n\nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/\n\nthe pedo hidden whonix guide are in the site (security Guide)",
				"added": 1612388115
			}
		],
		"1611872425_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": [
			{
				"comment_id": 47,
				"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/ Visit The Zona (Child lover community under build ) :D Welcome !",
				"added": 1611873983
			}
		],
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 49,
				"body": "good to know thanks .. The questions is Does exist a way fast to do that ? A cleanup ? or we need to go on Zerotalk click on Topic and see all of our Topic and 1 by 1 open see the 3 circle and Delete ,delete ,delete ,, and Dont fallow the Thread (unfalow etc etc ..) ?",
				"added": 1611890465
			}
		],
		"1612036757_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": [
			{
				"comment_id": 53,
				"body": "Hi , With your internet you think ? or you suppose is the cause of you cannot do something on zeronet ? ..",
				"added": 1612041998
			},
			{
				"comment_id": 54,
				"body": "> [sword00000](#comment_16_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): If you're hosting them all from the same internet IP location, then it won't make a big difference if you're running 1 or 100 devices, because the bottle neck is mostly going to be your internet speed. So hosting just 1 device/server is fine.\n\ntrue The problem is the Speed internet . but You need to Remember 1 thing .. A Desktop Computer Are more powerfull but you need to have ++ Sata hard drive or something Better because if you use a External hard drive usb .. For me my Hard drive usb as burn .. i have loose 4 tb .. with time and use the hard drive be Hot .. its possible that arrived to another one .. This is why maybe 1 desktop computer with 2 -4 hard drive to share file and (make Backup) .. is Recommended !",
				"added": 1612150809
			}
		],
		"1612390130_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 56,
				"body": "What is Kxo ? ..",
				"added": 1612397600
			},
			{
				"comment_id": 57,
				"body": "https://www.solvusoft.com/en/files/missing-not-found-error/dll/windows/electronic-arts-inc/origin-for-windows/libeay32-dll/",
				"added": 1612397633
			},
			{
				"comment_id": 58,
				"body": "Most libeay32.dll errors are related to missing or corrupt libeay32.dll files. Because libeay32.dll is an external file, it presents a great opportunity for something undesirable to occur.\n\nImproperly shutting down your PC or getting a virus infection could corrupt the libeay32.dll, which could lead to dll errors. When your libeay32.dll file becomes corrupt, it cannot be loaded properly and will present an error message.\n\nOther times, libeay32.dll file errors could be related to issues in the Windows registry. Broken DLL file references can prevent your dll file from registering properly, giving you a libeay32.dll error. These broken registry keys can be as a result of a missing DLL file, moved DLL file, or an leftover DLL file reference in your Windows registry from an unsuccessful software installation or uninstallation.\n\nMore specifically, these libeay32.dll errors can be caused by:\n\n    Invalid or corrupt libeay32.dll registry entry.\n    Virus or malware infection which has corrupted the libeay32.dll file.\n    Electronic Arts, Inc. hardware failure, such as a bad hard drive, which has corrupted the libeay32.dll file.\n    Another program overwrote the required version of libeay32.dll.\n    Another program maliciously or mistakenly deleted the libeay32.dll file.\n    Another program uninstalled the libeay32.dll file.",
				"added": 1612397666
			}
		],
		"1612476020_155qNQDTRMoDE3HgT4pKcKJEtKYyGyCT9y": [
			{
				"comment_id": 59,
				"body": "on github you can download zeroid and host it on zeronet\nhttps://github.com/HelloZeroNet/ZeroID\n\ngo in zeronet settings [create a new and empty site] you will have a url like  http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/\n\nexample 1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8\n\nyou find in your desktop the zeronet folder and inside data folder the folder named 1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8\n\nand you put inside the folder the file of zeroid  .. for information if any user register on zero id the default .. or any other one if they have an account after they can go in your site.. and post .. even if is a illegal site line mine .. you can Host Zeroup for allow user to upload file , or zerosite etc etc ..\n\nyou can find the defaulty project of zeronet there : https://github.com/HelloZeroNet?tab=repositories\n\n\nor create your own with html ,css \n\nfor information",
				"added": 1612476345
			},
			{
				"comment_id": 60,
				"body": "if your user cannot register see there i have give the link to Allow them to register and speak on zeronet (all site projecT) ..\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1610894921_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs",
				"added": 1612476664
			},
			{
				"comment_id": 62,
				"body": "http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/\n\nsettings page can be found on this site ( right Side of Stats the 3 Circle click on that you have a Menu is open and you see if you look correctly create a new and empty site",
				"added": 1612476795
			}
		],
		"1610894921_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 61,
				"body": "if anyone have a questions lets me know",
				"added": 1612476692
			}
		],
		"1612673874_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 63,
				"body": "in the Zeronet folder  / data   ... the users.json there inside you can find all private key after for Recorver in another computer all of your site if people seed you can download like a normal user and in the panel of the site click on this is my Site and is ask for a private key ..",
				"added": 1612691668
			}
		],
		"1612901550_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 64,
				"body": "yess",
				"added": 1612918712
			}
		],
		"1612926726_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": [
			{
				"comment_id": 65,
				"body": "hi . welcome on zeronet .. i dont know if on zeronet you can find that kind of place but you can visit zerosites where people share their project ?\n\nzerosites:\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n\ni will recommended For Security Reason if you want to share Something illegal like me ( Child porn) .. to use \n\nTails as host (you use tails) .. in tails you can Encrypt a Hard drive (luks encryption) .. inside the hard drive encrypted you can Install in Tails Veracrypt ( in the hard drive encrypted you can create a hidden Volume Veracrypt) .. inside the hidden volume veracrypt you can install (hidden vm) can be found on Github is Virtual box for Tails .. in the final you can Import in the virtual box Whonix .. and use Whonix ...  Each time you Boot a new sessions of tails you need to install veracrypt to open the hidden volume and you need to re install Hidden vm (Virtualbox) to  have your Virtual machine Already created Back like normal and can continue where you have stoped.. Inside whonix you can go in the website of Whonix and fallow their guide to install Zeronet in whonix .. \n\nin the final you have a Whonix (The most secure operating System) to seed and all is Hidden .. Not possible to proove you have a Hidden Operating System .. ) make your Search veracrypt Hidden volume , Tails, whonix , Hiddenvm ) ...\n\n\nThe pedo Hidden whonix guide can be Found There..  Warning if you go in this Site With your True ip adress Is not a good idea All of our User is Recommended to use Tor to Visist Zeronet site ..   In Whonix all pass over Tor by default Not possible to Leak your ip adress ! is what whonix say ! \n\nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/zona/guide/\n\n\nFor Create a Sites in Zeronet you can go in the Home page : http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/\n\nand a side (right Side of Stats you see 3 Circle white .. click on that and find in the menu Create new and Empty sites... you will be redirect to Your URl site like   H3uiaufgsaufgasug423ui54gh25u23 ....     In your Opearting system you have a Folder Zeronet in the Zeronet folder you have another folder named Data .. inside data you can find the Url of i speak to you  like H3uiaufgsaufgasug423ui54gh25u23  is your site.. insidr the folder of your site :H3uiaufgsaufgasug423ui54gh25u23\n\n you can put a Index html , and css  etc .. Wish i have Help you !",
				"added": 1612929690
			},
			{
				"comment_id": 66,
				"body": "> [aim64c](#comment_94_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): As a reminder, you can also mute people who you feel might be criminal or you otherwise do not wish to participate in the propagation of their content.  I'm not sure if the post prompting me to make this statement is someone seriously trying to advise on the distribution of illegal content, or is just glowing in the dark to try and scare civilized people away from the platform.A note on \"being anonymous\" - every file requested and submitted is part of a peer to peer torrent tracker.  People who regularly do things that should get them arrested are either a wealthy politician, an FBI agent with access to the library, or some asshole in a third world country. [...]\n\nstupid .. funny the shit of you write yess you can ignore me if you want haha ..you can try to scare away poeple of the zeronet by saying they are fbi agent .. i recommended whonix all pass over tor ! ..\n\ni am a pedo i am in tor too .. for + 7 years and Little Troll like you is not new .. I will continue my Fight .. and later All will see a huge database of Cp shared for the moment is take time to build !! .. Now mute me .. haha  you are the Asshole you are a Troll .. if i want i can create multiple account and Spam cp Everywhere.. You will do What for that on zeronet Mute 9999 account ? ",
				"added": 1612933315
			},
			{
				"comment_id": 67,
				"body": "i am a pedo child lover and i will share cp in tor on my site and on Any Network of i can .. zeronet they cannot close us like they do on tor Easly .. when we upload a file on a Site host is reported and removed ! .. in zeronet is Finish .. if all pass over tor ! .. Now if you see on my site i Recommended The Most Secured Operating System Whonix and all pass over Tor ! the Safest wayy i Think... You are Free to Think wathever you Want ! bye ..\n\n\ni dont care about what anti pedo think you are wrong .. Child lover Exist .. the love exist .. the kid Can concent and take pleasure ! i have + 500 Gb of Prove ! Downloaded in the past 6-7 years ! ",
				"added": 1612954337
			},
			{
				"comment_id": 68,
				"body": "http://pu6jmdcfuij5hntin52acnw6myjidvwn2xgdckxao5imwabw6ljdm6yd.onion/uploads/zvRI69soY5hQcbpjGSUn/Screenshot_2021-02-10_10-57-15.png Project Under Build !",
				"added": 1612954778
			},
			{
				"comment_id": 69,
				"body": "haha funny Honkedgoose!",
				"added": 1612967939
			}
		],
		"1613106625_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": [
			{
				"comment_id": 70,
				"body": "hi , i dont know but about security you can use Whonix and install zeronet inside .. whonix explain how to do on their website..",
				"added": 1613114262
			}
		],
		"1613332271_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 71,
				"body": "LOLLLL scam",
				"added": 1613332708
			}
		],
		"1613690812_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 72,
				"body": "keepass but remember A phone is Not Secure in case of illegal activity or secret to hide.. they can open any phone or force the owner to cooperate or rest in jail for X years ... this is Why in terms of security i recommended  Tails .. Start  tails From a usb of tails ..  Encrypt a entire new hard drive .. you can do it in tails Luks Encrypt.. open your disk encrypted with the password.. now you can Create with Veracrypt a Hidden volume  for that each time in tails you need to re install veracrypt .. Learn about Tails , veracrypt etc ...  now when you have installed Veracrypt in tails and create your Hidden veracrypt Volume .. You can open the hiddern volume and install  Hidden vm  is virtualbox for tails (you can find it on github Find hidden vm   .... install this in tails and you can import Whonix .. in the final you have a Hidden operating system in case of arrest from cops... \n\n\nyou can Fallow The pedo hidden whonix guide Is explain all of that + picture .. (Warning is Containt illegal Picture and is as start an pedo guide ) ..\n\nThis link Containt the Guide ..(illegal ) \nhttp://    127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/zona/guide/\n\nRecommended to Use Zeronet over Tor (tor and zeronet or better than that if you can ) to open illegal site on Zeronet.",
				"added": 1613820406
			}
		],
		"1613829794_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 73,
				"body": "hi , if i have understand on zerotalk here you have a limit to not reach when i write this i see : used 42.8 k / 5k \nif we reach the limit we need to erase each message old or like or follow .. to can continue , if is an user of Tor who seed a site and tor have a problem like Tor V3 network consentus attack .. its possible you have update failed ! be patient ..",
				"added": 1613855466
			}
		],
		"1614059150_16rxab891cbjircKRgX7FafERcSn8BPdkd": [
			{
				"comment_id": 74,
				"body": "hi , i dont know how to , but in the past i have think to replace all of my project (tor link ) http  to https is required a ssl certificate self created by me .. but i have made search in Tor is Not Required .. if you need help Like guide to How to Host A Hidden service tor (V3) in Whonix The Most Secure Operating System i can provide their Tutorial .. is The Safest way i think To where to Host a Hidden service .. !",
				"added": 1614088428
			}
		],
		"1614292386_1GGHF6VwGWmg17yLKWYNduAzYD2MZNCh7k": [
			{
				"comment_id": 75,
				"body": "i have try for fun but for me When i try to play 1 video is Say No video or Format type found.       For the Whonix os.. and and This Site Share a Teen porn site Fake on the Clearnet .. The Clearnet is not safe .. ! \n\nif you want a Streaming or Download Porn Site (for See Child porn) .. Find on Zeronet or Tor zona ! is Under Construction ! ... in Tor you can find Topic link ! its Recommended for Security reason to use whonix To access to Zeronet ! .. All pass over tor !",
				"added": 1614394499
			}
		],
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": [
			{
				"comment_id": 76,
				"body": "The best is to Use Whonix and in whonix install Zeronet ! all pass over tor and whonix is a Safest operating System ! i am a child lover and i use That Every Day ! if you find The zona on zerotalk you will find our Link on Zeronet and Guide to how to have a Hidden Whonix .. Even in case of arrest all is hide in a Hidden volume veracrypt No prove ! ..\n\n\nwhonix in their Doccumentation have zeronet Tutorial ! to how to install ",
				"added": 1614826737
			},
			{
				"comment_id": 77,
				"body": "when you have Whonix installed .. i have fallowed This guide : https://www.whonix.org/wiki/ZeroNet  is a little bit complex because on this guide is Explain how to do it with qubes os or non qubes os like just Whonix .. but if you Try you will can .. good luck  !",
				"added": 1614937007
			},
			{
				"comment_id": 78,
				"body": "> [bearnardo](#comment_1_16Cz6CgETEUcHH5AB5TWy6E7YrS4F7EPan): when you have Whonix installed .. i have fallowed This guide : https://www.whonix.org/wiki/ZeroNet is a little bit complex because on this guide is Explain how to do it with qubes os or non qubes os like just Whonix .. but if you Try you will can .. good luck !\n\ni have respond to you https://www.whonix.org/wiki/ZeroNet this is the guide but is explain if i remember for the Non qubes os whonix ..",
				"added": 1614937078
			}
		],
		"1616788955_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 79,
				"body": "Whonix you can install zeronet inside ( all pass by Tor they have a guide for Zeronet install Whonix ! .. I am a child lover and i have my Own website on zeronet oveR whonix ! \n\nOur Guide to How to have a Secure Hidden Whonix Operating System ,and After find on Whonix website how to install zeronet ( find zeronet) in the Docs section .\nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/zona/guide/",
				"added": 1616876236
			}
		],
		"1617356637_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2": [
			{
				"comment_id": 80,
				"body": "probably because the user is from Tor the most and Tor certain time REceived (ddos attack) the Concentus for the people who dont have Update their Tor version ! .. mabye ! take time Be patient back to zeronet each day for the next month ( restart zeronet) ?",
				"added": 1617361116
			}
		],
		"1618873749_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 81,
				"body": "> [mozez](#comment_1_13ui1ziWUVZb7giGNYpAzHzdfCirkobc8x): I HATE PEDOS\n\nand i hate Anti pedo .. !",
				"added": 1619304129
			}
		],
		"1622402090_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 82,
				"body": "Fuck You anti pedo !!!!!!!!",
				"added": 1622402808
			}
		],
		"1622398110_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 83,
				"body": "Anti pedo i now put you on mute bye bye ..",
				"added": 1622404897
			}
		],
		"1622430449_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 84,
				"body": "okais thank you because i see certain zite who we canot  click clone is not There the option on These zites ... \n\nbut i know is probably possible to thief file already in our disk or by the option download in zip .. but i would like to know how certain zite do that ..",
				"added": 1622482609
			}
		],
		"1622827973_17FpvmzYnpNwpzJ9BQDG2eymGCaTRhVasD": [
			{
				"comment_id": 85,
				"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/   The zona in Zeronet !! we are in Tor too .. For child lover .. Free child porn site and in zeronet we build a Database of Cp ! ..  You need to use like Whonix to fallowo their guide To install zeronet inside to Seed a site or Access ...  Protect Your Ip Over tor .. Zeronet over tor !! .. in Our Topic Link of The Zona .. we share Some guide ! ",
				"added": 1622857881
			}
		],
		"1623112333_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 86,
				"body": "> [cddd43hk](#comment_3_17tqEvyx1QiwVo6nbBe9F6UtWcPRzRUavU): stupid fagot\n\nTo all Anti pedo you Better to Mute me .. Powerless FAG",
				"added": 1623171497
			},
			{
				"comment_id": 88,
				"body": "> [1cool](#comment_5_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk): Pedos need to be publicly executed\n\npowerles fag",
				"added": 1623389776
			}
		],
		"1623149386_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 87,
				"body": "Never use a phone .. Use a computer Without hard drive and With a Live Ram os .. !",
				"added": 1623173165
			}
		]
	},
	"comment_vote": {
		"46_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"16_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"49_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"41_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"11_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": 1,
		"83_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"14_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": 1,
		"15_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": 1,
		"8_1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w": 1,
		"17_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1_1JMFHri3FtAMY2CFhiL9yH62igSh4Nzq3s": 1
	}
}