{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1516525820,
			"title": "Why this forum is needed",
			"body": "On the original ZeroTalk there is a rather strict limitation on the number of comments in 50kB, which practically puts a cross on the brisk big communication. ZeroNet makes it easy to clone sites, so I just make a clone of forums with hundredfold increased limits :) If the result turns out to be too big, you can always start a new clone.\n\nLater I will correct the design of this forum the way I like it more :)\n\nWelcome.\n\n**Update 2018-0422**: The engine of this forum is slightly more extended than the original one. For example, here you can use external images and videos:\n\n![](http://gateway.ipfs.io/ipfs/QmanuaLDNnuJPLeNyziSPkuesGnrzXps3w5ciZqcE21G6T/join_the_dark_side_darth_vader_flag_by_osflag-d9xe8up.jpg)",
			"added": 1516525819
		},
		{
			"topic_id": 1516525953,
			"title": "\"I will consider Russia as a low IQ nation as China\"",
			"body": "Continue of http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv",
			"added": 1516525951
		},
		{
			"topic_id": 1519459714,
			"title": "command line site-sorting?",
			"body": "> [Is there any way to sort directories of sites on the bash command line?](/Talk.ZeroNetwork.bit/?Topic:1519403325_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd)\n\n```\n$ ls --help | grep sort\nSort entries alphabetically if none of -cftuvSUX nor --sort is specified.\n  -c                         with -lt: sort by, and show, ctime (time of last\n                               with -l: show ctime and sort by name;\n                               otherwise: sort by ctime, newest first\n  -f                         do not sort, enable -aU, disable -ls --color\n                               can be augmented with a --sort option, but any\n                               use of --sort=none (-U) disables grouping\n  -r, --reverse              reverse order while sorting\n  -S                         sort by file size, largest first\n      --sort=WORD            sort by WORD instead of name: none (-U), size (-S),\n                               as sort key if --sort=time (newest first)\n  -t                         sort by modification time, newest first\n  -u                         with -lt: sort by, and show, access time;\n                               with -l: show access time and sort by name;\n                               otherwise: sort by access time, newest first\n  -U                         do not sort; list entries in directory order\n  -v                         natural sort of (version) numbers within text\n  -X                         sort alphabetically by entry extension\n```",
			"added": 1519459711
		},
		{
			"topic_id": 1519616295,
			"title": "Russia's own Internet",
			"body": "> [test20180221](/Talk.ZeroNetwork.bit/?Topic:1516279757_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp#comment_12_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): This is just an extended strategic action.\n> 'Unite a country behind an imagined external enemy to distract from domestic problems. As Russia’s economy reels under the impact of Western sanctions imposed after Putin’s 2014 annexation of Crimea, creating a myth of perpetual war has become a mainstay of the regime’s survival.' -- Newsweek Dec 22 2017\n> Putin is enjoying to call the needle a stick. (exaggerating)\n\n**It takes two to tango.**\n\nYou forget that this is the West that first started from Russia to create the image of the enemy. And today Russia in the media of the West is demonized by an order of magnitude more than the West in the Russian media.",
			"added": 1519616291
		},
		{
			"topic_id": 1526291696,
			"title": "Is it possible to port Sci-hub on Zeronet?",
			"body": "**Origin:** [Is it possible to port Sci-hub on Zeronet?](/Talk.ZeroNetwork.bit/?Topic:1526283454_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig/Is+it+possible+to+port+Sci+hub+on+Zeronet)@ZeroTalk\n\n> ** lifetrix**\n> Sci-Hub is a website with over 64.5 million academic papers and articles available for direct download. It bypasses publisher paywalls by allowing access through educational institution proxies.\n\n<https://github.com/greenelab/scihub>",
			"added": 1526291691
		},
		{
			"topic_id": 1526443011,
			"title": "Is the Universe a Simulation?",
			"body": "> **[quantumkitty](/Talk.ZeroNetwork.bit/?Topic:1526415723_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu/Is+the+Universe+a+Simulation)**\n> Is the Universe a Simulation?\n\n> Unlikely. Simulations are a waste of energy, for the most part.. compared to raw atoms. i.e. Virtual machines vs host machine.\n \n> If aliens went out of their way to simulate universes with life in it, there's no way that they would be evil enough to create a world so full of suffering .. unless it was just, a computer bug.",
			"added": 1526443005
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1516525953_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "> [caryoscelus](/Talk.ZeroNetwork.bit/?Topic:1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv#comment_17_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): So, can we expect a constructive reply from you\n\nI already wrote above in the thread that I spent on that ZeroTalk 20kB from the available 50kB. If I continue in the same spirit, then in 1-2 days I will not be able to answer at all. Why do I need it? :) Especially in the light of the fact that constructive communication has stopped - the opponents stopped listening to me. If you are interested in answers to specific questions, ask them. I will answer with pleasure. And the statement, such as \"this can not be, because it can not be never\" is impossible to refute and therefore it is senseless to answer them for a long time.\n\nI live in Russia and I see the level of government support among the common people with my own eyes. You operate with unsubstantiated slogans of Western propaganda, which can not be refuted. If you want to believe thoughtlessly indirect information - it's your right, I will not do anything with it. But I do not see the point of writing anything in `/dev/null`.\n\nIf you are interested in something specific, as I wrote above, let's discuss.\n\n> or are you only interested in monologues\n\nAnd this, just the example of not communication, but the archiving of such communication :D I am leading these topics in the American forum. On those forums there is a discussion of these issues. I just know how badly the information is stored in the usual Internet and therefore I used ZeroNet to save interesting information to me :) I wrote about it in detail in the introduction to the new blog.",
				"added": 1516526689
			},
			{
				"comment_id": 2,
				"body": "> [domitori](/Talk.ZeroNetwork.bit/?Topic:1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv#comment_1_13gvu4jRifzoGW2yspkjJ8D94t48cf2uac): Like they can really choose. If not enough votes for it they just resurrect some deadsouls to vote him\n\nThis statement is based on a false premise of Putin's unpopularity in Russia :) Therefore, regardless of its truth, according to formal logic, it is meaningless. The meaning of the general implication becomes a lie.",
				"added": 1516526830
			},
			{
				"comment_id": 3,
				"body": "> [caryoscelus](/Talk.ZeroNetwork.bit/?Topic:1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv#comment_16_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): 15 people is a good selection, yeah\n\nIt was just an example. Believe me, I do not see anywhere else in Russia anywhere else. I stand in line, I wait for the bus at the bus stop, I communicate on the Internet - except for narrow resources, where the dissatisfied, the general tone of the attitude towards the authorities is about the same.\n\nCan you refute this with concrete facts?\n\n>If you honestly think this, this, this and this (which are really just random examples\n\nYou accuse me of the non-representativeness of the example. But you are doing the same. These are isolated cases that do not reflect the overall picture. Moreover, such cases are not exceptional in general world practice. Do you recall the treatment of dissatisfied protesters in the US?",
				"added": 1516527204
			},
			{
				"comment_id": 4,
				"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): The limit can be increased.\n\nI can not increase this limit. So the remark is meaningless.\n\n> When you don't listen to your opponents, it's constructive; when opponents don't agree with you, it's non-constructive\n\nGood. Let's go back to the facts and assessments again. So, what is on my side:\n\n1. I see official statistics from an independent foreign agent.\n\n2. I see that everything happens with my own eyes.\n\n3. I see what scale protests cause specific levels of discontent. Later I will make a detailed layout with photos in the \"historical\" blog. But when Russia was dissatisfied with the majority (the period of the collapse of the MTSP), millions of people went to rallies. When Putin's rating dropped to 50%, tens of thousands went to rallies. Now rallies are gathering only hundreds of people. This is a complete fiasco.\n\nWhat constructive objections do you have?\n\n>I'm still waiting when you'll point out to me which western propaganda i read/watch/listen. I'm really curious.\n\nI do not know what specific sources you use. But I see how you write a typical Western propaganda lie that has nothing to do with Russian reality. Conclusion - You use the data of Western propaganda, without bothering to check this information yourself.\n\n>You have not answered on any of my statements that are unpleasant to you. I gave you specific links to russian news sites and russian opposition statements and you are ignoring the latter and dismissing the former.\n\nYou criticized me for bringing a non-representative example from my work. But you yourself are doing even worse. You have selected several individual facts that do not reflect the overall picture. But, ok, I will answer specifically for them.\n\n- https://newsland.com/user/4297807604/content/uchastnitsu-vstrechi-s-navalnym-zaderzhali-za-vozdushnyi-sharik/5993062\n\nDetaining a protester is a common thing in any country in the world. We do not know the details of this story. This could be the arbitrary behavior of the police. The detainee could actually provoke a mess. Supporters of Navalny, indeed, sometimes behave aggressively. Up to the attack on police officers. Then they try to show themselves as victims of the regime. In this case, the suspect was detained and released on the same day. On this occasion it is impossible to draw any conclusions.\n\n- https://meduza.io/news/2017/10/31/v-irkutske-biznesmenu-podbrosili-svinuyu-golovu-on-predostavil-ploschadku-dlya-mitinga-navalnogo\n\nWhy do you think that Putin threw the pig's head? :) Turn on the logic. If the majority in the country supports official power, then the opposition appears enemies and without any indication from above. And Navalny, in fact, there are many enemies. He will envy the Russian people and the people will reciprocate with him.\n\n- http://www.yabloko.ru/regnews/Mosobl/2017/12/19\n\nThis reference is generally irrelevant. This is some internal disassembly of officials. Here, for example, read here about Nikolai Dijur: http://www.compromat.ru/page_33300.htm\n\n- https://zona.media/article/2017/12/27/dmitriev\n\nI do not understand how this story relates to the Russian opposition and Putin's rating. The story is indeed muddled and ambiguous. This may be a case of local judicial arbitrariness. But this is another matter. And I never wrote that there is no judicial arbitrariness in Russia. This happens in any country in the world and in Russia as well.\n\nAs you can see, the examples given by you in no way can refute the thesis of Putin's high popularity in Russia.\n\nWhat else do you have from concrete facts?\n\n>Any single case is enough to refute your statement that \"in Russia no one actively suppresses the opposition\".\n\nI'm afraid this is an electronic translation problem. In the Russian language, the phrase \"no one supports\" means not only the absolute absence of supporters, but, more often, the negligible number. I wrote, of course, meaning ordinary conversational meaning. If to operate with exact figures, the opposition in Russia has support in several percent of the population. Speaking specifically about Navalny, in 2012-2013, at the peak of its popularity and in the period of Putin's minimal popularity, the rating of Navalny reached 5%. This allowed him to collect up to tens of thousands of people for protests. Now his rating has fallen dramatically and, most likely, has not even 1%. At the meetings Navalny now only come for 200-400 people.\n\nYour turn.",
				"added": 1516576456
			},
			{
				"comment_id": 5,
				"body": "> [caryoscelus](#comment_2_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): You can ask admin. [...]\n\nПока один вопрос — в каком году Вы уехали из России?",
				"added": 1516598238
			},
			{
				"comment_id": 6,
				"body": "В общем, конструктива с Вашей стороны так и не было. Одни уклонения. Ожидаемо. Всего хорошего.",
				"added": 1516707755
			}
		],
		"1517638428_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 7,
				"body": "## Ancient Chinese instructions\n\nFor those who want to be healthy and prolong their youth\n\n- Forget your age\n- Do not rate yourself by years\n- Treat yourself with exercise, in a word, grass and massage, warmth and cold\n- Inhale the aroma of trees and herbs\n- Eat rice, drink tea, hide meat in vegetables\n- Follow the warmth of the kidneys and cold head\n- More laugh\n- Forget the bad\n\nYou are protected if you is soft\nYou are gentle when you are calm\nYou are calm when you are healthy\n\n- Love People\n\nThose who can not love - do not notice",
				"added": 1518199747
			},
			{
				"comment_id": 8,
				"body": "> [coolplay](#comment_4_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): are you chinese?\n\nNo. Russian. But we always appreciate the so-called \"Chinese wisdom\" :)",
				"added": 1518337166
			}
		],
		"1519616295_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i do not know russian media, but from my western point of view i do not face any big demonizing.\n\nI just started yesterday (slowly in the background) to collect materials for an article on the topic of demonization. I do not know about you, but I often meet in the Western media like that :)\n\nhttp://127.0.0.1:43110/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/?Post:13\n\nThe draft there is in Russian, but the pictures, in general, everything will be clear :)\n\n...\n\nOn other of your statements, I will answer later, because the answer requires working with facts and a lot of translation work. If briefly and without evidence, then, of course, Russia is not a paradise and not an ideal state. We have our shortcomings with corruption, and with stupid officials. But Russia on these issues differs little from other countries. And the current government of Russia is much more humane than many allies of the West ;)",
				"added": 1521712715
			}
		],
		"1516525820_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 10,
				"body": "And video:\n\n```\n![](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Glockophone-music-youtube-LQ96jyfefCk.mp4)\n```\n\n![](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Glockophone-music-youtube-LQ96jyfefCk.mp4)\n\nFor  video work you must have downloaded the [ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) zite. Video is inserted as well as pictures, only the extension should be `.mp4`.",
				"added": 1524392184
			},
			{
				"comment_id": 18,
				"body": "> [thunder33345](#comment_1_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): cant using external images leaks user's IP?\n\nAny use of external images can always reveal your IP. But those users who beware this, use Tor :)",
				"added": 1528706882
			}
		],
		"1524391808_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "We can argue a lot about the dangers of pesticides. But the fact is that even if they kill someone, nevertheless, they have already saved hundreds of millions of lives. First of all, in Africa and Asia from hunger and disease. So they are a bad example of a tool that reduces the population size :)",
				"added": 1524392354
			}
		],
		"1524494451_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 12,
				"body": "_There is a good resource, [clipboard2markdown](https://euangoddard.github.io/clipboard2markdown/). You can copy the text from the site, paste it there by `Ctrl-V` and get almost ready Markdown:_\n\n---\n\n**KARACHI, Pakistan** - Orangi is a maze, a spider's web of narrow, winding lanes, broken roads and endless rows of small concrete houses. More than two million people are crammed into what is one of the world's largest unplanned settlements here in western Karachi, Pakistan's largest city.\n\nBut Orangi has a problem: it has run out of water.\n\n\"What water?\" asks Rabia Begum, 60, when told the reason for Al Jazeera's visit to her neighbourhood earlier this year. \"We don't get any water here.\"\n\n> \"We yearn for clean water to drink, that somehow Allah will give us clean water.\"\n\nIt is so rare for water to flow through the taps here that residents say they have given up expecting it. The last time it flowed through the main pipeline in Begum's neighbourhood, for example, was 33 days ago.\n\nInstead, they are forced to obtain most of their water through drilled motor-operated wells (known as 'bores'). Ground water in the coastal city, however, tends to be salty, and unfit for human consumption.\n\n\"When we shower, our hair [becomes] sticky [with the salt], our heads feel heavy,\" says Begum.\n\nThe only other option for residents is to buy unfiltered water from private water tanker operators, who fill up at a network of legal and illegal water hydrants across the city. A 1,000-gallon water tanker normally costs between $12 and $18. Begum says she has to order at least four tankers a month to meet the basic needs of her household of 10 people.\n\n![](https://interactive.aljazeera.com/aje/2017/parched-for-price/images/5.jpg)\n\nFarzana Bibi, 40, says she has to ration out when she showers and washes her family's clothes, because she can not afford to buy enough water every month\n\nBut not everyone in this working class neighbourhood can afford to buy water from the tankers or to pay the approximately $800 its costs to install a drilled well for non-drinking water.\n\n\"I'm piling up the dirty clothes, that's how I save money,\" says Farzana Bibi, 40, who manages a household of five people on an income of roughly $190 a month. \"We bathe two days in a week.\"\n\nAsked how she gets by, with so little water coming via the taps and no access to a saltwater source to clean dishes or laundry, she seems resigned.\n\n> \"I lessen my use. Sometimes I'll take my clothes to my cousin's house or my sister's house to wash them. Sometimes I'll get drinking water from them. One has to make do somehow.\"\n\nWhen she washes her clothes, she says, she makes sure not to leave the tap on. She'll fill a basin with water and wash her dishes in that, rather than under running water. She waits until there is at least a fortnight's worth of dirty clothes before beginning to wash them. Every drop of water, she says, needs to be accounted for.\n\nBut despite all this rationing, the water tank at her home is almost dry.\n\n\"There is a small amount of water,\" she says. \"I am saving it to drink. When I have money in my hands, I'll get a tanker.\"\n\nOrangi's problems, while acute, are not unique in Pakistan's largest city. Karachi's roughly 20 million residents regularly face water shortages, with working class neighbourhoods the worst hit by a failing distribution and supply system.\n\nAreas such as Orangi, Baldia and Gadap, some of the most densely populated in the city, receive less than 40 percent of the water allotted to them, according to data collected by the Orangi Pilot Project (OPP), an NGO that works on civic infrastructure and citizens' rights in the area.\n\nOn average, residents in these areas use about 67.76 litres of water per day, according to data collected by Al Jazeera. That includes the water they use for drinking, cooking, cleaning, washing clothes, bathing and sanitary uses.\n\nSo what is going on here? How is it possible that in one of the largest cities in the world, there simply isn't enough water being supplied? Is it because the reservoirs and water sources supplying Karachi just aren't large enough for this rapidly expanding megacity?\n\nThe answer to these questions is somewhat surprising.",
				"added": 1524502504
			}
		],
		"1526288062_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 13,
				"body": "While there are no topics for hot discussion, here no one writes anything :)",
				"added": 1526288473
			},
			{
				"comment_id": 19,
				"body": "> [htgozn](#comment_4_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): but I have no clue who that is.\n\nGreetings. I added a link to my ZeroMail in the forum header :)",
				"added": 1529530698
			}
		],
		"1526291696_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 14,
				"body": "_Sorry that I am responding to another forum, on ZeroTalk I almost ran out of message limits._\n\nZeroNet is bad for distributing a lot of large files. Yes, there is ZeroUp, but it is not suitable for any systematization yet. It's still better to use RetroShare with its collections, channels and mass file upload. There are examples of effective delays for hundreds of gigabytes and tens of thousands of systematized files.",
				"added": 1526291720
			}
		],
		"1526443011_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 15,
				"body": "_As always, I'm sorry that I'm responding to another forum, since on the main ZeroTalk I ran out of messages limit :) _\n\nOur universe is MMORPG. And we are in it - NPC :) The administrators and users of this MMORPG are the gods\n\n>  there's no way that they would be evil enough to create a world so full of suffering\n\nLook at how we scoff at computer game characters! Similarly, the developers of the Universal MMORPG can mock us :)\n\n[![](https://gateway.ipfs.io/ipfs/QmcCWmqS5553RLfTWBnZf5ko7xQsesE3hWezgjxtDFogcE/game-violence-800x.jpg)](https://gateway.ipfs.io/ipfs/QmNhbj1GwfLmceaixV1EnYPHVVqbzPVa93fNv9Ayx96J7N/game-violence.jpg)\n\nHave you seen the brilliant film \"[The Thirteenth Floor](https://www.imdb.com/title/tt0139809/)\"? His popularity was much lower than it could have been, because in the same year the Matrix came out. But the film is brilliant :)\n\n[![](https://gateway.ipfs.io/ipfs/QmPwLo3wHquu1wJvnhWxWpy6iXDkv86CG75CB3qD4dY7WX/the_thirteenth_floor-800x.jpg)](https://gateway.ipfs.io/ipfs/QmaYeCcxo4TJzvnUFkVhg4hJmJJR9TzLvNHg4ioANN9xs7/the_thirteenth_floor.jpg)",
				"added": 1526443711
			},
			{
				"comment_id": 16,
				"body": "> [ssdifnskdjfnsdjk](#comment_5_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @balancer73 hi, please how you add the image to your post?\n\nThis modification of the ZeroTalk engine supports the insertion of pictures in the Markdown format:\n\n```\n![](http://domain/image.jpg)\n```\n\nBut there is no apload of pictures. The easiest and most versatile option is to put a picture in IPFS and give a link.\n\nMost often for simplicity and speed, I uploaded the photo to https://ipfs.pics, and then changed the link from `https://ipfs.pics/` to `https://gateway.ipfs.io/ipfs/` - the main gate of IPFS. But now ipfs.pics does not work. In this case, you can switch off locally on your computer using the console utility `ipfs add filename.jpg`, but then you need to ensure the availability of this computer online :)",
				"added": 1527216279
			},
			{
				"comment_id": 17,
				"body": "> [ssdifnskdjfnsdjk](#comment_6_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Is it hard to modify the ZeroNet engine to support embeded image?\n\nTo make a normal upload images in ZeroTalk, I need to understand and experiment a lot. I have not looked this way yet. To just return Markdown's ability to display pictures (this is its regular feature), I need to edit one line in the original `/js/utils/Text.coffee`:\n\nhttps://github.com/Balancer/ZeroTalk/commit/382010f52bfe52591d94b67805390b556bb5c8e2#diff-2ac56aa9cf736216cb8eb11e16363dbf\n\n>  I guess if you need to upgrade site in future, you need to repeat all changes made as it is probably in .js that will be overwriten\n\nI use the original ZeroTalk sourceы, so it's easy to apply patches :)",
				"added": 1527229951
			}
		],
		"1535704655_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 20,
				"body": "> [ssdifnskdjfnsdjk](#comment_10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Maybe curl command would DL site, then i would have to extract links from that file and then maybe curl, wget or …\n\nZeroNet stores all data in JSON-files. So it's best to look for the latest updates via `find` or `inotifywatch` and `jq`.",
				"added": 1535730248
			}
		]
	},
	"comment_vote": {}
}