{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "#coronavirus Información filtrada que revela la realidad, ¿qué has encontrado?",
			"body": "Aportemos con enlaces, referencias, mensajes, pastes y demás acerca de la información que no nos muestran en los medios o por los gobiernos, acerca de la realidad relacionada al coronavirus.",
			"added": 1587533166
		}
	],
	"topic_vote": {
		"1_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": 1,
		"1_13JcBip2ep9ykxQCMkLhiK5csgnSc9szfn": 1,
		"3_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": 1,
		"1_15i8WB3wdpSqpuzVetqgsQLvNvhe3aeKtN": 1,
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 1,
				"body": "> [syd](#comment_1_1MSfDowTPJsfEtFsZzs3NxJto85PQP5n8P): torbrowser no me deja meterme en las páginas por el servidor proxy, cómo puedo arreglarlo?\n\nSigue los siguientes pasos:\n1. En la barra de direcciones escribe: about:config\n2. Dale clic al botón: Acepto el riesgo\n3. En la barra de búsqueda que aparece arriba al inicio, escribe: no_proxies_on\n4. En el único resultado que aparece, bajo la columna Value dale doble clic y escribe: 127.0.0.1\n5. Después de darle OK verás que el resultado queda en negrillas.\n6. A veces necesitarás reiniciar el explorador después del cambio.\nY, ¡listo!",
				"added": 1586581413
			},
			{
				"comment_id": 2,
				"body": "No es el más usado aún, pero si es favorito.",
				"added": 1586581452
			},
			{
				"comment_id": 4,
				"body": "> [jmprvr](#comment_3_1NaeptT7BDPzn6a15gxxx8SxnPatwoQ6LP): Yo acabo de encontrarme con esta investigando acerca del P2P. Se me hizo muy curiosa, es una pena que no tenga una cantidad de usuarios más grande\n\nSi es una pena, es quizás la más user-friendly con el plus de poder conectarla através de TOR, usando direcciones que pueden ser usadas para recibir bitcoin y con una base tecnológica de descentralizar la información para que a pesar de la censura, el contenido pueda continuar disponible.",
				"added": 1587532947
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 3,
				"body": "Se percatan que ni siquiera habla bien español, es obviamente una traducción mal hecha en Google Translator y pegada aquí. No justifica como evalúa los errores.",
				"added": 1586581944
			}
		],
		"1_15i8WB3wdpSqpuzVetqgsQLvNvhe3aeKtN": [
			{
				"comment_id": 5,
				"body": "> [borekon](#comment_1_1EMSVnv32UW6ePjn74xSDboA2VqfJHRvFM): Hay un leak por ahí del hackeo de la WHO y demás...\n\npodrías pegar aquí los enlaces y que todos nos enteremos e investiguemos\nquién sabe y descubrimos algo que otros no? ;)",
				"added": 1587680391
			}
		],
		"4_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 6,
				"body": "Cierto @upnet sobretodo lo que dices al final, copartir archivos, fotos, y demás es genial; pero debemos también usar estas redes para lo que son, dar libertad de opinión. ¿Qué propones que podríamos hacer aquí en Zeronet al respecto de lo que mencionas arriba?",
				"added": 1587680565
			}
		],
		"2_1PAQSnwf9cZr1qTjjVq2g35ZH2B6HijFbZ": [
			{
				"comment_id": 7,
				"body": "Investígalo y nos cuentas ;) http://127.0.0.1:43110/17FGkPsZcCXWgNNrjKYNf9C75onx2w2rB5/",
				"added": 1587680731
			},
			{
				"comment_id": 8,
				"body": "Justo acaban de abrir el primer hilo de discusión. Si tienes buen criterio te recomiendo que pases a opinar por ahí.",
				"added": 1587861596
			}
		],
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 9,
				"body": "> [selfsigned](#comment_20_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Para un resumen no está mal.Creo que te centras demasiado en el problema y poco en lo que puedes hacer tú por cambiarlo. \n> En lo que más razón te puedo dar, es que el sistema de votar a un partido que luego hace y deshace me parece el sistema más absurdo y de gilipollas jamás creado. Un sistema de votación mucho más granular sería mejor, por no hablar de sanciones o penas de cárcel a quien prometa el oro y el moro y luego sólo te cague en la cara.\n> El problema de este puto páis es que mentir no está mal, el alcohol no es una droga, y dejarte convencer por cualquier gilipollas que te hable es ser ciudadano y sociable. Si a todos estos que prometen mierda les escupieran sus propios votantes en la cara otro gallo cantaría. El problema auténtico es que españa está llena de subnormales y como supongo te figuras, hacen falta muy pocos lobos para controlar cientos de ovejas.\n> A la gente de este país le faltan huevos para pensar, porque eso cansa mucho, y oye, ya tienen bastante con trabajar como putos animales para no tener ni un euro en el banco a fin de mes. Si eso no les hace pensar, nada puede.\n> Por mí sinceramente que les jodan a todos los anormales de este país.\n> No es que me dé vergüenza ser Español, es que hay días que siento vergüenza de considerarme un ser Humano inteligente, así que te puedes imaginar lo que pienso del resto.\n> La felicidad tiene que venir de tí mismo, así como el cambio, si tanto lo necesitas.\n> PD: Entre todo estoy la crudeza de mi lenguaje, también siento admiración en el mismo grado de intensidad por gente que ha sacrificado su tiempo, su carrera e incluso su propia vida por defender cosas que vale la pena defender, porque quien ama, odia, y viceversa.\n> Suerte!\n\nMe gusta lo que mencionas al final, que en medio de todo lo que podríamos expresar, también podemos valorar a todas esas personas que han sacrificado mucho por defender las cosas que en realidad nos benefician a todos.",
				"added": 1587861855
			},
			{
				"comment_id": 10,
				"body": "> [rambo214](#comment_3_1FRzGqvVTChBnmwyHc9E7VsXB3vULbbMXY): Este video de youtube narra básicamente muchos de los problemas que describes. https://youtu.be/_CeJ24Hzbjg\n\ny qué opinas de los mencionas en este hilo de acá -> http://127.0.0.1:43110/1NFu76UjDGqg1rSn3FKA6w6wTRBoAU2cpz/?Topic:1587756571_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg/Medios+de+comunicaci+n+l+bres+Espa+oles+De+momento",
				"added": 1587861888
			},
			{
				"comment_id": 11,
				"body": "> [upnet](#comment_5_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV): El problema reside en el brutal control mental que la población española y también del mundo están siendo sometidos, solo observo gente en bares y terrazas bebiendo su cervesita o café, pensando en el futbol y en el próximo viaje de vacaciones, verdadera furia hispana.Te está pasando lo mismo que a mi, nos escapamos de la \"programación\" y vemos el mundo real y eso es muy doloroso. Solo podemos adaptarnos a esa situación y seguir luchando por ser mejores dia a dia.Pero ten en cuenta que ésto en cualquier momento va a dar un viraje alucinante y todo cambiará, tú estarás preparado, la mayoria de ellos.\n\nMencionas que esto algu momento cambiará y debemos estar listos, ¿qué implica estar listos para ti? y ¿qué crees que cambiará exactamente?",
				"added": 1587861968
			},
			{
				"comment_id": 12,
				"body": "> [2315b](#comment_3_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg): Como dije, vine amargado y solté eso. Hoy ya menos amargado... si que creo que hay maneras de solucionarlo. Y la primera es que la gente que consideramos inteligente (Que sea capaz de ver el problema en su totalidad) empecemos a unirnos y a formar sociedades para controlar a los borregos. Y tambien atacar a los medios de comunicación usando su propia medicina.\n> En ese ámbito hay bastantes youtubers que ahora se estan empezando a hacer famosos que luchan día a día contra el falserío de mucha gente de \"bien\" que intenta imponer sus ideas (social justice warriors y demás fauna).\n> Sin duda uno de los frentes es ese. Y podríamos decir que empezamos a plantar batalla.\n> En otro de los frentes, que es el tema económico y como bien explicas tu de gente que ni siquiera es capaz de pensar cuando no llega ni a fin de mes. Creo que la batalla se ha perdido. Es mas que evidente, y ahí compañero no soy capaz de vislumbrar ninguna salida a corto plazo. El individualismo fomentado por la sociedad y el desconocimiento de la gente en temas económicos son bestiales. ¿Te puedes creer que mucha gente no sabe ni qué es la inflación y como cada año pierden de media un 2% de su dinero ahorrado? Ni tampoco saben como pueden hacer para no perder esedinero usando el propio sistema... (Y todo esto sin entrar en temas de impuestos de un estado que lo único que hace es sangrar a la clase media).\n> Porque la clase baja está jodida y tienen ayudas, pero la clase media está totalmente desprotegida. Y los ricos cada vez se hacen mas ricos y las ventajas fiscales están para ellos, no para los pobres ni para la clase media (Tampoco es culpa de ellos, es que han comprendido bien el sistema y se aprovechan de el).\n> La verdad es que todo este asunto bien merecería una página en zeronet. Para empezar a luchar contra el mal que vemos todos los días, para iluminar a la gente y que salgan de las tinieblas.\n> Me pasaré por este post de vez en cuando. Si queréis seguir la conversación sin problema...\n\nbastante cierto lo que mencionas, y aunque es un poco decepcionante no encontrar soluciones a corto plazo, como mencionas si se trata de ponernos al frente del cambio y discutir posibles soluciones.. cuando dices que este asunto bien merecería una página en Zeronet, creo que es justo la intención de Artemis: http://127.0.0.1:43110/1NFu76UjDGqg1rSn3FKA6w6wTRBoAU2cpz/",
				"added": 1587862170
			}
		]
	},
	"comment_vote": {
		"1_15i8WB3wdpSqpuzVetqgsQLvNvhe3aeKtN": 1,
		"2_1G14BiACsgyPEa1n3FEyiwj19aCjeMXD8h": 1,
		"8_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": 1,
		"1_1EMSVnv32UW6ePjn74xSDboA2VqfJHRvFM": 1,
		"11_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": 1,
		"1_1LaZxaXRv4riKwQsxWNdTS7cpM9K2itK3J": 1,
		"20_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": 1,
		"3_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": 1
	}
}