{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1569840447_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1567636880_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 1,
				"body": "Also you can set ZN to use tor for tracker connections in settings assuming you are running the Tor Browser bundle, which is a good idea anyway.",
				"added": 1567689593
			}
		],
		"1567787270_1BumxHqxXBHScLoq1wAJqiFZXJ4c1DcewG": [
			{
				"comment_id": 2,
				"body": "I'd say acceptable but not bulletproof. Without the Tor it's pretty much like bittorrent from what I gather. So might be hard to tell who the originator is but fairly easy to see who is \"seeding\" certain content. So Tor adds a lot to the security.\n\nThe benefit of using the Tor browser is that if malicious content tries to redirect you to a clearnet site, for \"doxing\" purposes, that would run through Tor as well.",
				"added": 1567787760
			}
		],
		"1568112876_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 3,
				"body": "Smart people are giving tv a pass these days. I don't own a tv. I do some streaming and of course pirate the occasional movie if I'm interested.",
				"added": 1568115358
			}
		],
		"1568118783_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 4,
				"body": "Would be nice to have a more \"civilized\" forum that was less appealing to trolls for those that want that.\n\nScreeching, autistic shit-posting is coming up in the world. \"Chan culture\" is on the rise and with it their preferred mode of...discourse.",
				"added": 1568119807
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 5,
				"body": "aim64c: As far as \"happenings\" before events the only issue I see is that things are always -happening-. Bolton got fired and nothing happened before that. But what if it did? Then it would fit the narrative of \"Oh, X event happened to distract from the Bolton firing!\"",
				"added": 1568200053
			}
		],
		"1568652007_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 6,
				"body": "Occupational licensing\nZoning\n\"Fair and reciprocal\" laws that only large companies or the moneyed can use effectively\nFinancial reporting requirements that can be used by companies/individuals after assets\nFinancial hazards for men in marriage (hurts everyone, just just men interested or in a marriage)",
				"added": 1568652516
			}
		],
		"1568735040_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "In the data/filters folder of that site there is what appears to be user blocklists grouped into anti_jew.json, anti_lgbt.json and licence_offending.json. So, no being woke to the JQ or criticizing trannies if you use KxoID?\n\nHard pass. The hardest pass. Awww...heyll...naw!\n\nI'm not interested in any ID provider that is primed for censoring \"badthink.\"\n\nA semi-decentralized ID provider sounds good but if the \"semi\" part is run by an SJW that is a problem.",
				"added": 1568736274
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_1002_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): And those blocklists weren't even finished AFAIK.\n\nYeah, like the Death Star wasn't finished lol (they have entries in them). Is everything Kxo related suspect? If someone gets banned on KxoNet would they be banned from the entire Kxo \"family\" of sites?",
				"added": 1568736686
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_1004_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Once KxoID gave you a certificate, it can no longer be revoked, so the only way to get \"banned\" from KxoID is actually not receiving the certificate in the first place.\n\nI have reason to doubt this. Things can be removed/edited in ZN if one has the keys, that is how people can update their Zites.\n\nIn any event, even if an ID couldn't be revoked, it wouldn't matter because a central \"authority\" can just add IDs to a blocklist and push it out. My ID could be as valid as ever but it wouldn't mean anything because my content can be hidden per the blocklist.",
				"added": 1568738577
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_1005_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Looks like you don't understand how ZeroNet works. [...]\n\nI believe you are being deliberately disingenuous. The fact is that KxoNet stuff has left-leaning blocklists baked in. From the code:\n\n\"The purpose of this blocklist is that jewish people shouldn't have to see or deal with anti-jew hate speech or derogatory comments towards them.  If you have made derogatory comments or hate speech against jews, then you'll be added to this list.\"\n\nAww, someone is thinking about the poor little Jews lol. Opt in or opt out, that is a Real Bad Sign (TM). Whoever has the main keys can just say:\n\"Due to the recent shooting in Wherevertown, USA we are updating our code to use the blocklists by default. Diversity of opinion is good but when that crosses the line to violence against innocent humans no reasonable people should support this. I realize the Kxo family of sites is now the biggest group on ZeroNet and this may cause some people alarm. We respect this opinion and hope that they will respect ours. Signed, FriskyDisabledPuppyBoyLover69\"\n\n...and you know damn well that is exactly how it would go down. Sweet Jeebus, its like I'm psychic or something. The Boogaloo can't come soon enough.",
				"added": 1568740248
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 11,
				"body": "Big if true. Tor/Tor Browser is open source. How would they hide a deliberate back door?",
				"added": 1568895240
			},
			{
				"comment_id": 12,
				"body": "> [cactusdragon](#comment_13_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): They could just not fix a security flaw found out by some secret service. But this is unprobable and wouldn't work on all without being exposed. Such security flaws a kept to deanonymise VERY important persons.\n\nOk, but you said \"NEVER use it.\" I imagine some agencies have 0-day exploits for Tor but what is the alternative? What do you think is a better Tor setup to use?",
				"added": 1568897978
			},
			{
				"comment_id": 13,
				"body": "> [kidcourageous](#comment_253_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): The difference is I can get away with everything\n\nYeah, that's what you *think*...right before some three letter agency kicks in your door. :)",
				"added": 1568906304
			}
		],
		"1569419442_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 14,
				"body": "I like John Mark's take on leftists and \"fake status.\" I'm becoming a big fan of Propertarianism.\n\n[https://youtu.be/x3ZiLcIItsY](https://youtu.be/x3ZiLcIItsY)",
				"added": 1569419978
			}
		],
		"1569840447_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 15,
				"body": "Ehh, it's ok. Still waiting for my neural wetware. Aside from that I'm really settling into the \"high tech lowlife\" aesthetic. It's cozy.",
				"added": 1569846076
			},
			{
				"comment_id": 16,
				"body": "> [almostsoul](#comment_32_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): You can no longer use spaces of technology to critique culture; something like ZeroNet is as close as you'll ever get just because theoretically the object of critique cannot destroy it the way it destroyed sites like 8chan.\n\nReally? Not sure if I agree: Terrorism, big corporation, complicit government. A digital community crackdown forcing refugees (us) into further reaches of the digital expanse, using higher order software to avoid censorship and reprisals?\n\nThat sounds cyberpunk as fuuuuuck. Lots of room for social critique but not as titillating as the fantasy cyber bad guys of the 80's are in some ways real and those stories are playing out now.",
				"added": 1569859231
			},
			{
				"comment_id": 17,
				"body": "> [almostsoul](#comment_33_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): terrorism, \"big corporation\", and governments gain more from technology than\n\nTerrorism gains from technology? Well...here's hoping. ;)",
				"added": 1569861223
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 18,
				"body": "Oh heck yeah I use TOR. For ZN and anything particularly \"spicy.\"",
				"added": 1570027186
			},
			{
				"comment_id": 19,
				"body": "> [randomshits](#comment_189_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): With a bit of safe browsing habits, tor is not necessary on the clearnet nor zeronet.Don't want to stumble on questionable or criminal material with that instance, then don't pursue it.\n\nI don't agree with that. The onionshare guy was posting child porn on 08chan /b/ for a bit if I'm not mistaken, which would be the wrong place for content like that. Spammers are a thing and you can receive illegal content before you know to block somebody. Wasn't there some person who tried to \"out\" ZN users a bit back by exploiting the fact that not everyone was running Tor? ZN and Tor all on an encrypted container is base requirement for browsing in my opinion.",
				"added": 1570033675
			},
			{
				"comment_id": 20,
				"body": "> [pexo](#comment_158_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC):  [...]\n\nAgree. Also consider that depending on the context even *legal* information, sometimes that you can't even see, can be used against you in court. Say I decide to be \"clever\" and keep it legal but do some [FEDPOSTING]. Boom, this is now on your computer...and technically legal.\n\nNow say you are walking home and are attacked by a black guy, defend yourself and he dies. If they search your computer my [FEDPOSTING] along with whatever else is on ZN is admissible evidence in a hate crime trial. It doesn't matter that you didn't say it, or maybe don't even agree with it, it will get trotted out in front of a jury for \"context.\"\n\nThis normie idea of \"But I'm not doing anything illegal. FBI Agent Glowburg is a fellow patriot.\", is bullshit. The federal judicial system is full of straight...up...criminals... They are more than happy to railroad some poor schmuck into a fake hate crime conviction to pad their resume. Then maybe they can move up the ranks faster and might even get invited to Pedo Island v.2!\n\nEncrypt as much as possible.\nAnswer questions with  questions.\nKnow your rights.\n\n\"How are you today citizen?\"\n-> What is this about?\n\"Just looking for a Real Bad Guy. Mind if I check your stuff to prove how innocent you are?\"\n-> I don't want my stuff searched.\n\"But it will help us catch a bad guy.\"\n-> Am I under arrest?\n\"No you aren't under arrest. But I'd like to ask you some questions if that is ok?\"\n-> I would need a lawyer present for that. Since I'm not under arrest I'd like to leave now.\n\nWrite down name/badge number/time/etc.",
				"added": 1570035820
			},
			{
				"comment_id": 21,
				"body": "> [randomshits](#comment_190_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): You either die for something or live for nothing. [...]\n\n\"Now, I want you to remember that no son of a bitch ever won life by dying for his principles. He won it by making the other poor dumb son of a bitch die for his principles.\"\n \n- Adapted from General Mattis ;)",
				"added": 1570038533
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 22,
				"body": "> [emmet](#comment_1_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): It only works with Tor like 1 out of 5 times.\n\nIf it doesn't work, I'll just use Tor Browser's new identity/new circuit selections until it works. It has definitely been getting better as nofish's spam protection algorithm has been slowly backing off.",
				"added": 1570117284
			}
		]
	},
	"comment_vote": {
		"63_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"2_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX": 1,
		"256_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"167_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"191_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"163_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	}
}