{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1581644287,
			"title": "【暗流涌动，坡县药丸】：新加坡58例新冠肺炎案例的深度分析",
			"body": "【摘要】：36个本地传染的病患只是（8-15天）统计延迟造成的冰山一角，坡县药丸。\n  \n----------------------引言--------------------------\n  \n1、水木众青对于坡县高温是否能遏制病毒是否好奇，因此，本青虽然是IT专业青椒，但是本着水木地青严谨、负责的科学态度，深入研究了这58个公开案例，发现：【暗流涌动，坡县药丸】。\n2、本青的研究首次揭示了在高温高湿的热带地区，在佛性防御下（坡县把新冠当流感，佛性接受），疫情在传播初期暗藏的规律。\n3、相比坡县的有限防御，天朝采取的方针是全面封锁。坡县的佛性防御，与天朝的全面封锁，哪个效果更好？两种政策的对比，将对全球疫情防治工作，带来深刻的启发。\n  \n  \n---------------------58个案例的统计数据-----------\n  \n截止2月13日，新加坡卫生部公布了总共58例新冠肺炎案例。\n所有这些案例均发布在新加坡卫生部官网：\nhttps://www.moh.gov.sg/news-highlights/details/eight-more-confirmed-cases-of-covid-19-infection\nhttps://www.moh.gov.sg/covid-19/past-updates\n  \n1、第一例于1月23日发布；最近的8例是今天（2月13日）发布。\n（这些案例与全国其他城市的传播十分同步，只不过，坡县当流感处理。）\n  \n2、其中22例为输入性：大部分是1月18-23日从武汉过去的中国人；剩下的是1月30日撤侨过去的新加坡人。\n（1月23日武汉封城之后，输入戛然而止；撤侨的坡县人一下飞机就隔离，没机会传播。）\n  \n第一批22人开始发病的时间主要介于1月22-24日，少数月底发病；开始7例从发病到入院的时间都较快，于发病后1-3天（1月23-27日）入院隔离；后面的从发病到入院的时间为3-10天；武汉的22人基本都是1月底之前入院。\n（第一批武汉病人对自己的病情大部分都很警惕，少数拖延到月底入院。）\n  \n3、剩下的36例为本地传播：开始的发病的时间基本介于1月27-2月7日，大部分发病介于1月30-2月4日。\n（这些人是被第一批武汉病人传染的。1月18日武汉爆发之后，疫情迅速传遍全国，也同步传到了坡县。）\n  \n4、本地36例入院时间介于2月4日-12日，从发病到隔离的时间介于5-10天。这期间，他们通常会去1-5个小诊所/大诊所，以及0-2个小医院，最后在某大医院隔离（例如，国家传染病中心）。\n（本地病人相比武汉病人，警惕性差了很多：发病后入院时间更长，在发病后的5-10天内，都响应李显龙的号召，会去3-5次诊所与小医院，随后才在大医院隔离。）\n  \n5、发现了1161本地密切接触者,99%已居家隔离。\n  \n6、已排查出711例阴性，现在有82人在等待测试结果。\n  \n--------------分析与展望---------------\n  \n1、坡县的本地36例发病时间几乎都是1月底-2月初，发病后5-10天才会隔离，隔离后0-2天才会公布阳性结果。考虑钟院士论文所说，平均4天的潜伏期，本地36人绝大部分感染时间为1月下旬。这意味着，目前公布的就是坡县的第一批，从感染到公布，有8-15天的延迟。\n  \n2、英国毒王1月20-23日左右在坡县开会，被与会的武汉人感染，回欧洲后传染多人。因此，英国毒王和首批坡县人大约是同时感染的，但英国毒王回欧洲后传染了11人，让大家误以为坡县的疫情出现的更早，连英国人去了都感染了。实际上，坡县的首批36人也是1月23日后数日感染，只不过坡县人拖拖拉拉，入院前会先去诊所盘桓数日，造成统计延迟。而毒王在欧洲属于输入病例，大家更加重视，因此造成大家感官上的误差：坡县有肺炎病人很久了，但是管理的好，天气热，所以没有爆发。\n  \n3、在感染之后，隔离之前，坡县本地首批36个病人都有1-2周的时间成为移动传染源。最新的数据表明，新冠的R0被修正到了3.8-6，远大于SARS，这也与我们的直观感受一样：新冠比SARS传染性强！因此，虽然坡县很热，但是这36人恐怕已经感染了上百人。\n  \n4、坡县人响应总理号召，入院前会先去诊所盘桓数日，严重了才进医院隔离。而钟院士的论文告诉我们，新冠肺炎40%左右的病人在前期并不发热。按照坡县的策略，不发热的人不会急着去大医院隔离的。甚至是发热的人也会先去诊所，等几天发现不退烧，他们才去医院，这中间又耽误了很多时间，可以多传染很多人。也就意味着，36例确诊背后，会有起码上百例已传染但还没发热，或者发热了却在小诊所观望、等退烧的病人。\n  \n5、现在这36个本地病患只是统计延迟造成的冰山一角。星星之火可以燎原。\n  \n6、如果疫情在坡县继续扩大，无法遏制，坡县可能会采取更严的封锁政策，甚至不排除学习天朝，全面封锁，那这样，坡县的经济受到的打击将比天朝更大。无论坡县政府是佛性接受，还是全面封锁，坡县弹丸之地，都难以承受。\n  \n7、综上所述，本青较为严谨的得出了与本版地青们一致的猜想：【坡县药丸】。\n  \n8、最后一个问题，保经济，还是保命？两瓶毒药，你们猜，李家坡会选哪瓶？\n  \n  \n  \n  \n--",
			"added": 1581644286,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1581643866_1AXZceKJt4hPE6NXa1ghVPAtJnge7GFde1": 1,
		"1581642983_187PK2SheoUVx6K9AN1QwXrGB7U73CPiAk": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1581642983_187PK2SheoUVx6K9AN1QwXrGB7U73CPiAk": [
			{
				"comment_id": 1,
				"body": "伊朗的大元帅都可以大张旗鼓地杀，为何不投毒搞一下你这个死不服输的华夏国",
				"added": 1581644569
			}
		],
		"1580864324_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 2,
				"body": "啥",
				"added": 1581644906
			}
		]
	},
	"comment_vote": {}
}