{
    "article": [
        {
            "title": "Hebrew Roots",
            "text": "{{Over-quotation|date=May 2018}}\n:''This article refers to the modern religious movement. For the Hebrew language grammatical structure, see [[Semitic root]]''\n:\n\n'''Hebrew Roots''' is a religious movement that advocates the return and adherence to the first century walk of faith and obedience to the Torah <ref>{{cite web|url=http://www.ourfathersfestival.net/hebrew_roots_movement|title=Our Father's Festival! - What is the Hebrew Roots® Movement?The Hebrew Roots AwakeningREAD  THE FREE BOOKUpdated February 2, 2018|website=Ourfathersfestival.net}}</ref>  by seeking a better understanding of the culture, history, and religio-political backdrop of that era which led to the core differences with both the Jewish, and later, the Christian communities.<ref>{{cite web|url=http://houseofdavidfellowship.com/qanda.htm|title=Q & A for House of David Fellowship - Hebrew Roots|website=houseofdavidfellowship.com}}</ref>\n\nFor insiders, the term Hebrew Roots does not indicate a denomination, but a mindset of a non-denominational Christian seeking to \"emulate Christ as much as humanly possible\".<ref>{{Citation|title = What is Hebrew Roots? - Matthew Vander Els|url =https://www.youtube.com/watch?v=MNWOqOzqIB4|date = 2016-01-31|accessdate = 2016-02-01|last = Founded In Truth}}</ref>\n\n==History==\nSince the early 20th century, different religious organizations have been teaching a belief in Yeshua as mankind's redeemer and savior from man's own sinful nature and a lifestyle in keeping with the [[Torah]], the [[Sabbath]] and the annual Feasts (or ''moedim'', Holy Days). These include [[Messianic Judaism]] (to a very limited degree) in 1916, the [[Sacred Name Movement]] (SNM) in 1937, and the [[Worldwide Church of God]] (WCG) in the 1930s, and, later, the Hebrew Roots Movement. Thus far, the WCG has had the greatest impact on all organizations which teach these beliefs, including obedience to much of the [[Old Testament]] law, both nationally and internationally<ref>{{cite web|url=http://articles.latimes.com/1989-04-01/local/me-920_1_world|title=Top Ratings for Schuller, 'World Tomorrow' :  Two TV Ministries Rise Above Bible Belt|first=JOHN|last=DART|date=1 April 1989|website=Articles.latimes.com|accessdate=16 May 2018}}</ref> until about 1994-95. Within a few years after the death of its founder, [[Herbert W Armstrong]], in 1986, the succeeding church administration modified the denomination's doctrines and teachings in order to be compatible with mainstream [[evangelical Christianity]], while many members and ministers left and formed other churches that conformed to many, but, not all, of Armstrong's teachings. Consequently, the WCG spawned numerous splinter groups,<ref>{{cite web|url=http://www.religioustolerance.org/|title=Home page of the ReligiousTolerance.org web site|website=Religioustolerance.org|accessdate=16 May 2018}}</ref> with most of these new churches adopting names bearing the term \"Church of God\" (COG) and retaining the belief system developed by Armstrong.<ref name=\"ourfathersfestival.net\">{{cite web|url=http://www.ourfathersfestival.net/hebrew_roots_movement|title=Our Father's Festival! - What is the Hebrew Roots® Movement?The Hebrew Roots AwakeningREAD  THE FREE BOOKUpdated February 2, 2018|website=Ourfathersfestival.net|accessdate=16 May 2018}}</ref>\n\nIn contrast, Hebrew Roots (or sometimes, Hebraic Roots) is a grassroots movement without an ecclesiastical superstructure and it does not adhere to the COG belief system, nor does it adhere to Messianic Judaism, or to the SNM, although there are commonalities. A number of their founders began teaching about the need to keep the [[biblical sabbath|7th Day Sabbath]], to observe annual Feasts, and to obey Old Testament [[613 mitzvot|commandments]] years before these topics were taught and accepted by some in the Christian churches. These early teachers include William Dankenbring (1964) and Dean Wheelock (1981) (both of whom had prior associations with different Churches of God), Joe Good (1978), and Brad Scott (1983). Batya Wootten's curiosity about the Gentile majority in many Messianic-Jewish congregations resulted in her first book about the two houses of Israel in 1988. This was later followed by her 1998 book entitled ''Who is Israel'' (now renamed in its 4th edition as ''Redeemed Israel'').<ref name=\"ourfathersfestival.net\"/>\n\nIn 1994, Dean and Susan Wheelock received their Federal Trademark <ref>{{cite web|url=http://www.trademarkia.com/hebrew-roots-78207418.html|title=Apply for a Trademark. Search a Trademark|website=trademarkia.com}}</ref> for the term Hebrew Roots®, after which they began publishing the ''Hebrew Roots®'' magazine in April/May 1998, and later a website at Hebrewroots.net. The goal of this group is “Exploring the Hebrew Roots of the Faith Once Delivered,”-“roots” which go back to not only Yeshua and the Talmidim (Apostles), but to the [[Nazarene (sect)|Nazarenes]] <ref>William F. Dankenbring. ''The Mysterious Relationship of The Early Nazarene Christians and Rabbinic Judaism''</ref> of the first century and, ultimately, the original Hebrews (''Ivrit''), Abraham and his offspring, who were the first to \"cross over\" (which is what \"Hebrew\" means in the Hebrew language).  Those who continue in this Hebraic walk seek out the history, culture, and faith of the first century believers who, like [[Abraham]] and [[Moses]] obeyed God’s voice, charge, commandments, statutes, and laws (Gen 26:5). The 41,000,<ref>{{cite web|url=http://christianity.about.com/od/denominations/p/christiantoday.htm|title=Essential Stats and Facts About Christianity Today|website=Christianity.about.com}}</ref> denominations of Christianity commonly believe that such obedience (viz, to the 613 Torah Mitzvot) is no longer required.  This is largely due to a number of statements by the apostle Paul.<ref>{{Cite book|title=Paul and Palestinian Judaism|last=Sanders|first=E.P.|publisher=Fortress Press|year=1977|isbn=978-0800618995|location=|pages=1–11}}</ref>\n\nThe Hebrew Roots movement began emerging as a distinct phenomenon in the mid-1990s (1993–96).<ref name=\"ourfathersfestival.net\"/> In 1997, Dean Cozzens  of Open Church Ministries (Colorado Springs, CO) published a [[Neo-revelationism|prophecy]] titled \"The Hebrew Movement\", which revealed that God had foreordained four major moves for the 20th century, [[Pentecostalism]], [[Faith-healing]], the [[Charismatic Movement]] and finally the Hebrew Roots Movement. In this prophecy, the Hebrew Roots Movement is the \"final stage of empowerment\" before Christ returns. Several Hebrew Roots ministries are now preferring to use the term ''Awakening'' instead of the term \"movement\" which has been used widely since the 1960s to define politically oriented movements.<ref name=\"ourfathersfestival.net\"/>\n\nThe movement / ''Awakening'' has accelerated in the last few years,<ref>{{cite web|url=http://www.bridgesforpeace.com/letter/hebraic-roots-heritage-or-heresy/|title=Hebraic Roots—Heritage or Heresy?|website=Bridgesforpeace.com|accessdate=16 May 2018}}</ref> mainly because of a shift within the Messianic Jewish community.<ref name=\"ourfathersfestival.net\"/> The Hebrew Roots movement and a few Messianic Jewish groups diverge on the issue of One Law theology (one law for the native born and the sojourner, c.f. Numbers 15:16)<ref>[http://www.umjc.net/umjc/dmdocuments/onelaw_movements_abridged.pdf One Law Movements; a Challenge to the Messianic Jewish Community January 28, 2005] {{webarchive|url=https://web.archive.org/web/20070928060523/http://www.umjc.net/umjc/dmdocuments/onelaw_movements_abridged.pdf |date=September 28, 2007 }}</ref> which Hebrew Roots subscribes to, but which some Messianic Jewish groups deny. One Hebrew Roots teacher, Tim Hegg, responded to this issue by defending what he believes to be the biblical teaching of \"One Law\" theology and its implications concerning the obligations of Torah obedience for new Messianic believers from the nations.<ref>{{cite web|url=http://www.torahresource.com/EnglishArticles/OLMResponse.pdf|title=One Law Movements A Response to Russ Resnik & Daniel Juster|website=Torahresource.com}}</ref> The Two-House and One Law differences have affected musicians who are welcomed by Hebrew Roots fellowships notwithstanding their beliefs: \"...many Messianic Jewish artists who are heavily influenced by organizations like the [[MJAA]] and the [[UMJC]] have been told by their leadership that if they ever appear at an MIA event they will not be able to play with them again\".<ref>The Messianic Israel Alliance ''Herald''. Boot Camp 2. August 2011, p3</ref>\n\n==Theology==\nHebrew Roots theology includes at least seven distinct core differences from [[Protestantism]], [[Seventh-day Adventism]], [[Rabbinic Judaism]], and [[Messianic Judaism]].<ref name=\"ourfathersfestival.net\"/>\n* Both the Old and [[New Testament]]s are held as holy books. The Torah serves as the foundation to all subsequent understanding and interpretation of Scripture. A foundational distinction of the Hebrew Roots movement is the manner in which Scripture is translated and interpreted so that later testimony (particularly the New Testament, or \"Brit Chadashah\") does not conflict with Torah commandments. It is believed by those in the Hebrew Roots movement that Yeshua the Messiah did not come to establish a new religion or to “do away” with the Law of Moses, but to clarify that the Jewish Oral Law was not of divine origin. \n* Salvation derives from the belief in Yeshua the Messiah as personal savior, not from commandment/Torah keeping; however, believers are rewarded according to their fruits, works, and obedience. Hebrew Roots followers believe that sin is breaking the Torah (cf. 1 John 3:4), all of the purity laws such as dietary restrictions and sabbath keeping are in the Torah, thus it is sinful to not keep the sabbath and to eat forbidden animals, among other social and religious observance laws. It is also true, according to some Hebrew Roots followers{{citation needed|date=August 2015}}, that those who are truly born of God will not continue in sin (cf. 1John 3:9), therefore, if you are not moved to keep the sabbath or to keep dietary restrictions, you must not truly be born of God.{{citation needed|date=August 2015}}\n* The Jewish Oral Law (the [[Talmud]]) does not represent Scriptural requirements to be obeyed, but can provide deeper understanding as to how some have applied the Scriptures to practical life. Traditions considered to have [[Pagan religions|Pagan]] origins, such as Christmas, adopted by [[Judaism]] and/or [[Christianity]] are to be avoided.\n* Old Testament/Torah Laws and the teachings of the New Testament are to be obeyed by both [[Jews]] and [[Gentile]]s ([[proselyte]]s). (See Numbers 15:15-16 for the explanation). \n* The [[Hebrew language]] is generally studied because it amplifies an understanding of the Scriptural text.\n* Unlike traditional Americans,<ref>{{cite web|url=https://www.usatoday.com/news/religion/2010-09-28-pew28_ST_N.htm|title=Most Americans believe in God but don't know religious tenets |website=Usatoday.com|accessdate=16 May 2018}}</ref> followers of the Hebrew Roots movement actively study the Scriptures as well as the history, faith, and culture of the first and second century, to understand how traditional Christianity diverged from its Hebrew roots. \n* The ''moedim'' or appointed times listed in Leviticus 23, including the 7th day Sabbath and the Feast days, foreshadow the 1st and 2nd comings of the Messiah and the Creator's plan of salvation for the world.\n\n===The Feasts of the LORD (Lev 23:2)—“My Feasts”===\nHebrew Roots adherents teach that the seven [[Torah]] annual Sabbath Holy Days (sometimes called [[High Sabbaths]]) reveal the Messiah Jesus Christ and His plan of salvation. “In the festivals,  God explains, defines, demonstrates and reinforces Himself and His plan”.<ref name=\"Good_1998\">Good, Joseph, 1998. ''Rosh haShanah and the Messianic Kingdom to Come.'' Hatikva Ministries.</ref>{{rp|15}} They believe that the feasts were ordained at creation (Gen.1:14—seasons = ''moedim'' in Hebrew (mow-eh-deem'--which is the plural of the singular [''moed'']):  appointed times or rehearsals), and are YHVH’s (God’s) feasts—not Jewish or Israeli holidays or 'our' feasts (Lev 23).  They also abide by the instructions given in Lev. 18:1-3; and Lev. 20:23 prohibiting pagan customs (e.g. Christmas and Easter). \n \nThe feasts in Hebrew are termed ''chag'' “which comes from the Hebrew root word ''chagag'', which means \"to move in a circle, to march in a sacred procession, to celebrate or dance.\"<ref name=\"Chumney_9\">{{cite web|url=http://www.hebroots.com/sevenfestivals_chap9.htm|title=HHMI: The Seven Festivals of the Messiah Chapter 9|website=Hebroots.com|accessdate=16 May 2018}}</ref> Although it is commonly stated there are seven (7) feasts, it is perhaps more precise to state that there are seven appointed times which include the three (3) feasts (''chags''). The weekly 7th day Sabbath is also considered an appointment.\n\nScripture indicates that these ''chags'' are to be observed at the Temple in Jerusalem—which is not possible today. In a more profound fulfillment, however, believers have now become the spiritual temple in which the Holy Spirit (''Ruach Ha’Kodesh'') dwells and His name is now placed within the believer to determine the place of observance (e.g. Rev 22:4). Believers rejoice and rehearse the meaning of these days when they gather to meet.\n\nThe two seasons (spring and fall) of the appointments and their feasts form both a history and a prophetic picture of things to come (Col 2:16-17; Heb 10:1). They portray the two comings of Jesus Christ, in as much as the two daily Temple sacrifices are also types.  In the first century the Jewish people debated whether there would be two comings (the Suffering Servant or the Conquering King) of the Messiah which precipitated John the Baptist’s question (Matt 11:3).<ref name=\"Good_1998\"/>{{rp|2–5}}\n\n'''1 & 2. Feast of Unleavened Bread''' ([[Passover]]) '''|''' ''Chag haMatzot (Chag haPesach)\n''\n\nUnleavened Bread is a seven-day firstfruits of barley harvest festival where unleavened bread is to be eaten during this time. Believers dispose of all yeast laden bread products (it is not called the feast of unleavened beer). [[Yeast]] is a fungal spore which is present in the air and can infiltrate bread dough and make it rise through the process of fermentation—not by induced chemical reaction (e.g. baking soda). Symbolically, unleavened bread contains no yeast.  Leaven is a symbol of false doctrine (sin) that is spread through the air and of which believers must be aware (Matt 16:6-12).\n\nHistorically, this festival has been commonly called the Feast of Passover and the festival separated into two festivals by some Messianics: Passover and Unleavened Bread since there is a Sabbath ([[moed]]=appointment) on the first and last days of the Feast. Technically it is only one festival with only the first day of the Feast commonly termed Passover (named for the lamb (Ex 12:21) eaten that night and also refers to YHVH (i.e. the LORD in the KJV) passing over the Israelite homes (Ex 12:23).  Over the centuries the term Passover in the Gospel accounts has become somewhat clouded: e.g. Did the term begin the season on Nisan 10 when the lambs were chosen? Did it only refer to Nisan 14? Or did it refer to the entire seven day festival? One might see a similar situation with Christmas and the Christmas season.\n\nThere is no record of the Jewish people changing their observance of the Passover date.  Both John 4:6 and 19:14 are offered as evidence that the traditional observance of the “Lord’s Supper” (also called the \"Christian Passover\") was not held the night before the “Jewish” Passover.  John was a Jew and, therefore, used “Jewish” time of day in both verses.  Christ’s placement on the cross at 9 AM and death at 3 PM fulfills the dual typology of temple sacrifices, the slaying of the Passover lambs at 3 PM, and the setting of the sun (according to Jewish culture began at the noon hour— i.e. “between the evenings”). (See [[Quartodecimanism]] and [[Passover (Christian holiday)]].  Consequently, some Hebrew Roots adherents follow the Jewish time of observance—not the Roman time, and are aware that a Passover meal is not plausible where leavened bread is used in a meal as a “sop” (John 13:26-30) along with other timing inconsistencies with Roman time such as John 13:1 and 18:28.  Others in the movement may still observe the traditional Last Supper Passover the night before.<ref name=\"spring_festivals\">{{cite web|author=Wheelock, Dean & Susan|date=2009|title=''The Spring Festivals: Passover in Egypt and Jerusalem''|page=24|url=http://www.hebrewroots.net/resources/wordpropdfpej.pdf|format=PDF|website=Hebrewroots.net|accessdate=16 May 2018}}</ref> and offer the similar Gospel accounts of Mark 14:12-26; Matt 26:17-30; and Luke 22:70 as evidence to the contrary. Although the issue is more complex than this quite brief summary, the observing of either of the two different times, whichever one chooses, thus far, has not been a serious dividing issue in the movement. The Jewish Seder may or may not be followed as a general outline, but the inclusion of the Messiah’s life and events into the evening’s observance is always addressed.\n\n''Meaning:'' The festival is rich in many meanings as traditionally taught and for the [[Torah]] pursuant Hebrew Roots believer in Christ.\n\n'''3. Feast of Weeks ([[Pentecost]]) |''' ''Chag [[Shavuot]]''\n\n[[Pentecost]] is a Greek word meaning “fiftieth (day)”. ''[[Shavuot]]'' (Shah-voo-oat') is the Hebrew word. The day is also called by other names, such as the Feast of Harvest (Ex. 23:16), Feast of Weeks (Ex. 34:22), and Day of Firstfruits (Num. 28:26). The main Shavuot ritual involved the \"new meal-offering\" which was the main ritual of that day and consisted of two loaves of leavened bread. Scripture does not directly reveal the meaning of the two loaves and various conjectures have been made: e.g. the two Houses of Israel, Israelites and Gentiles, etc. Many begin the count to Pentecost on the first weekly [[Sabbath]] following the Passover day, while others begin the count on Nisan 15 following the Jewish tradition and interpretation of which constitutes a \"sabbath\". This difference in counting is not a dividing issue. People observe either the one day or the other according to their conscience and knowledge of Scripture and still gather to meet on the weekly [[Sabbath]] and other annual Sabbath days.\n\n''Meaning:'' The day pictures the firstfruits of the wheat harvest, the Holy Spirit given to the Apostles, and a type of [[Jubilee (biblical)]] since it occurs 50 days after the Wave Sheaf Offering during the Feast of Unleavened Bread. The meaning of the day has also been compared to the Bride of Christ: “It signifies the completion of the cleansing and preparation of the Bride of Messiah (that's us!) for her wedding day.”<ref name=\"spring_festivals\"/> Jewish tradition indicates that the [[Torah]] was given on Shavuot.  It was the acceptance of Torah which bound ancient Israel to God in a marriage contract. “All ancient Israelite marriages required a marriage contract, or covenant document, called a ''Ketuvah'' (Keh-too'-vah). The Torah constitutes the ''Ketuvah'' between God and the children of Israel. The bride was required to accept the terms of the ''Ketuvah'' (covenant) so they could be fully married. Israel, as the bride, did this when she said:\"... 'All that the LORD [YHVH] has spoken we will do.'\" (Ex. 19:8).<ref name=\"fall_festivals\"/> Shavuot has also been linked as a type of “Eighth Day” to the Feast of Unleavened Bread.\n\n'''4. Trumpets |''' ''Yom Teruah'' (''[[Rosh HaShanah]]'')\n\nJews call this day ''[[Rosh Hashanah]]''—but it is not termed so in Scripture where it is commanded to be kept. Instead it is found in Ezk. 29:17 and 45:18. The Hebrew word for trumpets is also not used where the command to be blown is found in Lev 23:24. An exact translation of the term would be 'Feast of Clamor' or 'Feast of Acclamation' or, the 'Day of Blowing'—as the Jews sometime name it.  Instead, the day is most commonly known as ''Yom Teruah''  (Yohm Teh-roo-ah') and is translated into English as 'Feast of Trumpets”.<ref name=\"fall_festivals\">{{cite web|author=Wheelock, Dean & Susan|date=2009|title=''The Fall Festivals: High Holy Days.''|url=http://www.hebrewroots.net/resources/wordpropdffallhighdays.pdf|format=PDF|website=Hebrewroots.net|accessdate=16 May 2018}}</ref>  It is not clear whether a trumpet or shofar is to be blown on this day.  The ancient Jewish tradition, however, was to blow a shofar.\n\n''Meaning:'' This day is also known as the 'Day of the Awakening Blast.' with at least four meanings. 1) Tradition holds that loud blasts are connected to this day when the Messiah will be crowned King over all the earth (Num 23:21); 2) when the people of the earth hear the sound of the shofar they are to repent of their sins, and 3) the resurrection of the dead at the return of the King, and 4) a battle cry of the King’s vengeance which that rehearses the coming of the \"Day of the Lord.\" The Jews also call Trumpets the “Day of Judgment”.<ref name=\"fall_festivals\"/>\n\n'''5. Atonement |''' ''[[Yom Kippur]]''\n\nIn Hebrew ''yom'' means \"day\" and ''kippur'' is from a root meaning \"to atone\". On this day the Great Shofar (the ''Shofar haGadol'') is blown to signify the “Day of Judgment”—another name for Yom Kippur.\n\n''Meaning:'' The general  meaning of this appointed day of [Yom Kippur] is a generally similar to those in both the Jewish and Christian faiths: it is a day of fasting, repentance, and acknowledgment of the covering sacrifice of Jesus the Christ (''Yahushua HaMashiach'') for sin. It is commonly understood that the Messiah is the first goat. It is not so commonly understood that He is the second goat that is set forth to go into the wilderness—into the world—to fulfill His purpose in two comings.  Some recognize this understanding in Hebrew Roots, some do not. The Feast Days are all about the Messiah and His Plan of Salvation for mankind.\n\n'''6. Booths (Tabernacles) |''' ''Chag haSukkot'' ''([[Sukkot]])''\n \n[[Sukkot]] is a seven-day autumn harvest festival where believers are instructed to dwell in temporary dwellings (Lev 23). Although no specific harvest crop is noted in Scripture, Jewish tradition associates wine and water with festivals at Temple rituals. The Hebrew word ''[[Sukkot]]'' is usually translated as \"tabernacles,\" or \"booths\" and is the plural form of ''sukka'' (sue’-kah)— a Hebrew word meaning tent or (temporary)booth that one lived in–not the Tabernacle (which was used for worship and was the portable sanctuary in the wilderness). The ''sukka'' symbolizes man's need to depend upon God for food, water, and shelter.  Other translations translate the word more closely to its intended meaning of a tent or booth; hence the name “Feast of Booths”. “This feast is also known by other names, such as, the Festival of Ingathering (Ex. 23:16), the Feast of the Nations, the Festival of Dedication, the Festival of Lights, and the Season of Our Joy.<ref name=\"Chumney_9\"/>\n\n''Meaning'': Anciently the feast represented the wandering in the wilderness and the physical harvest.  For the believer, today, Sukkot has additional manifold spiritual meanings: it is the church’s journey;  the harvest of souls at the end of the age (''Olam Hazeh''=”this world”) (Matt13:39; Rev.14:15; Joel 3:13),<ref name=\"Chumney_9\"/> while the 7 days and the Feast being the 7th appointment also foreshadow the millennial reign of Christ in the 7,000th year with His Bride. These seven days especially represent a time to place the cares of our life aside for a time, to fellowship, to learn, to recreate, and, perhaps have the opportunity to  travel to beautiful areas of the nation where more than 110 festival locations (including Church of God) are located and share in meaning of the festival.  It has a far deeper meaning and expression than Christmas. The last day of the feast is known as [[Hoshana Rabbah]].\n\n'''7. Eighth Day |''' ''[[Shemini Atzeret]]''\n\nThe Hebrew word means \"Eighth [day of] Assembly\" and immediately follows the Feast of [[Sukkot]]. Hebrew Roots adherents view this day in a different light than those in the Jewish faith in which the day is “characterized as a day when the Jewish people \"tarries\" to spend an additional day with God at the end of Sukkot”.\n\n''Meaning:'' There is no direct Scriptural indication for what the day means; however, clues may be determined in the use of the number 8 in Scripture. The number 8 is widely accepted as meaning “a new beginning”.  It is prophetic of the time after the 7000 year millennium when the White Throne Judgment is held.  A new beginning, termed the “World to Come” (''Olam Haba'' in Hebrew) will occur with the establishment of a new Heavens, new Earth, and a new Jerusalem as described in Revelation 22.\n\nMessianics and some in Hebrew Roots combine this appointment with the Feast of Sukkot and, therefore, do not recognize it as the special day that it is made to be.\n\n===Jewish Feasts===\nThe Feast of Dedication | [[Hanukkah]] and Feast of Lots | [[Purim]] can be recognized as being more of a national holiday (such as the American 4 July Independence Day) and are generally explained in-season.  They may or may not be observed since they are not commanded in the Torah.\n\n===Christology===\nThere is no unified Christology in the Hebrew Roots movement. It is not rare to find among Hebrew Roots believers people who reject the notion of Yeshua as God in the flesh. The \"''notion of a “Trinity” or any other “God in the flesh” Messiah teaching is a fundamental violation of that clear understanding of the ONE and ONLY true God'',\" according to some in the movement.<ref>{{Cite web| url =http://torahofmessiah.org/you-shall-have-no-other-gods-before-me/ | title = Teaching that Messiah is God is Promotion of \"Other Gods\"|accessdate=2017-04-19}}.</ref> To make Yeshua as God is \"''the equivalent of breaking the first of the Ten Words''\" (Ten Commandments) according to others.<ref>Yvinec-Dunlop, David and Jamie; \"Church of God Study Guide\"; Beth-El Publishing House (2016), p.45, {{ISBN|978-1-4834-5812-0}}</ref>\n\n===Other beliefs===\nHebrew Roots teachers emphasize the adoption of all Christians into the faith of Abraham,<ref>Wilson, Dr. Marvin R.; ''Our Father Abraham: Jewish Roots of the Christian Faith''; Wm. B. Eerdmans Publishing Company, 1989, {{ISBN|0-8028-0423-3}}.</ref> often referred to in the [[Bible]] as the unified \"House of Israel\" ({{bibleverse||Leviticus|10:6}}), ({{bibleverse||Jeremiah|37:11}}), ({{bibleverse||Ezekiel|39:25}}), ({{bibleverse||Romans|11:13-26}}), ({{bibleverse||Ephesians|2:10-14}}). This unified \"House of Israel\" consists of Jews and Non-Jews who maintain faith in the Messiah and a Spirit-led adherence to the Torah, God's teaching and instruction, as a lifestyle of faith and love.<ref>{{cite web|url=http://rabbiyeshua.com/articles-by-kehilat|title=Articles by Kehilat Sar Shalom authors|website=Rabbiyeshua.com}}</ref>\nHebrew Roots followers believe that Christians have the \"testimony of Jesus,\" but are often found innocently to be keeping fewer commandments than they are intended to ({{bibleverse||1John|1:9}}) according to the erroneous idea that Yeshua died to do away with the Torah, thus abolishing it and any requirements to \"guard\" or \"keep\" it, which is contrary to Scripture.<ref name=\"Rick\"/>\n\nThe Hebrew Roots movement emphasizes the completion of the unified \"House of Israel\" in Yeshua, which includes both Jews and non-Jews. Its followers believe that they are co-heirs and equal members of the [[chosen people]] of the God of Israel through the blood of Messiah, and that returning to a 1st-century mindset provides deeper and more authentic insights into the Hebrew idioms of the New Testament (which are often garbled after their translation to Greek),<ref>Bivin, David; Blizzard, Roy B.; ''Understanding the Difficult Words of Jesus''; Treasure House, 1994, {{ISBN|1-56043-550-X}}.</ref> which provides deeper cultural understanding of Scripture.<ref name=\"Rick\">Richardson, Rick; ''Origins of Our Faith: The Hebrew Roots of Christianity''; Trafford Publishing Company, 2003, {{ISBN|1-4120-0824-7}}.</ref> Also of importance is a greater understanding of the dispersion of tribes of Israel, and the future regathering of those tribes according to prophecies of Scripture.\n\nSome Hebraic Roots congregations encourage the use of Hebrew-based forms of the sacred names, but this is generally a minor emphasis.\n\n==Christian Hebrew Roots Movement==\nThe Hebrew Roots movement is related to a subgroup known as \"Christian Hebrew Roots.\" This subgroup follows the [[Ten Commandments]] (Ex 20:3-17) and the feasts of the Lord (Lev 23:1-44), but like mainstream Christianity it believes that all other Old Testament requirements have been \"done away with\".<ref>{{cite web|url=http://www.christianhebrewroots.org/02_Feasts_old_v_new_1p_snp.pdf|format=PDF|title=Feasts of Our Lord|website=Christianhebrewroots.org|accessdate=16 May 2018}}</ref>\n\nThe Christian Hebrew Roots movement rejects many of the same practices of many Protestant sects that the Hebrew Roots movement rejects. In particular, they reject the Roman Catholic Church's \"transubstantiation\" doctrine, and instead follow what it sees as the biblical teachings set forth in the New Testament regarding the \"nature of Communion\" as a ''symbol'' of Christ's body instead of the ''literal'' body and flesh of Jesus. This, they deduce from the words Jesus spoke to describe what they call an \"amendment\" to the Passover service being ''symbolic'' and '''not''' literal (in accordance with how they interpret the New Testament Greek).<ref>A Still Small Voice, pp. 160-161.</ref>\n\nThe Christian Hebrew Roots movement does '''not''' teach a return to the law as dispensed by the scribes who Jesus rebuked as hypocrites. They interpret the \"law\" as pertaining to the Torah, and not the Jewish Oral Law, as the Hebrew Roots movement interprets it.<ref>{{cite web|url=http://hodf.org/archives.htm|title=Archives House of David Fellowship - Hebrew Roots|website=hodf.org}}</ref>{{Failed verification|date=October 2013}} Instead, the Christian Hebrew Roots movement follows what it claims is the worship pattern of Jesus, whom they claim freed mankind from the yoke of the letter of the law; and, in fulfilling the law, Jesus taught Christians to practice only the Ten Commandments and feasts of the Lord which make up \"the acceptable year of the Lord\"<ref>{{cite web|url=http://www.christianhebrewroots.org/03_Acceptable%20Year%20of%20the%20Lord_5_snp.pdf|format=PDF|title=The Acceptable Year of Our Lord|website=Christianhebrewroots.org|accessdate=16 May 2018}}</ref> in his speech inaugurating his personal earthly ministry.\n\nThis main distinction between the two groups is that followers of the Hebrew Roots movement understand the word \"fulfill\" (playroo G4137), found in Matthew 5:17, to mean \"fill up\" specifically with meaning. This is in contradistinction to \"destroy\" (kataluo G2647) with which it is contrasted earlier in the same verse. Fulfill is also found to mean to place the commandments of God \"on a firmer footing by interpreting them correctly in terms of God's ultimate will as He originally intended for His commandments to be obeyed\",<ref>{{cite web|url=http://hodf.org/|title=Hebrew Roots Teaching - House of David Fellowship|first=Lee|last=Miller|website=hodf.org}}</ref> and not dispensing with them as something that has been \"done away\" by the atoning work of Jesus Christ, as Christian Hebrew Roots followers define it.\n\nBoth movements include adherents who are of Jewish heritage as well as Gentile heritage. The Christian Hebrew Roots movement is completely nondenominational, consisting of persons from many different religious backgrounds<ref>{{cite web|url=http://www.christianhebrewroots.org|title=Christian Hebrew Roots Universal Headquarters|website=Christian Hebrew Roots Universal Headquarters|accessdate=16 May 2018}}</ref> and teaches adherence to the health laws of the Torah but not the portions of the Torah which it believes were abandoned by Jesus. As such, they function as a sort of \"bridge\" between true Hebrew Roots theology and mainstream Christianity.\n\n==Criticism==\nThe Hebrew Roots movement has been called a group of heretical, non-Christian, and non-Jewish [[cult]]s.<ref>{{cite web|url=http://www.nowtheendbegins.com/writers/GG/the-hebrew-roots-cult.htm|title=The Hebrew Roots Cult Movement|accessdate=2013-11-12|author=Geoffrey Grider|quote=These are the true roots of Christianity and the Christian's relationship to the Jew. But there are those who seek to pervert that relationship, and add layers of law and works to it where none exists in the Scriptures. This new movement is called Hebrew Roots, and while it uses words and phrases from the bible and Jewish culture, there is nothing either Jewish or Christian about this group as you will see. […] The movement usually hides their beliefs and presents itself as simply seeking to educate Christians concerning their Jewish heritage. As they become acclimated to the Jewish orientation the more aberrant doctrines are slowly introduced.}}</ref><ref>{{cite web|url=http://www.raptureready.com/rap40f.html|title=Hebrew Roots Cults|accessdate=2013-11-12}}</ref><ref>{{cite web|url=http://www.blogos.org/gotquestions/hebrew-roots-movement.html|title=GotQuestions vs. the Hebrew Roots Movement|accessdate=2013-11-12|author=S. Michael Houdmann|quote=The Hebrew Roots Movement is a perfect illustration of Solomon’s statement that “there is nothing new under the sun” (Ecclesiastes 1:9). Essentially, the Hebrew Roots Movement are the Judaizers that the Apostle Paul thoroughly refuted in the Epistle to the Galatians}}</ref>\n\nHebrew Roots has been accused of repeating the heresy of the [[Judaizers]] (those in the New Testament who sought to force Gentile converts to Christianity to adhere to Mosaic Torah).<ref>https://www.gotquestions.org/Hebrew-roots.html</ref>\n\n==See also==\n* [[Christian Torah-submission]]\n* [[Christian views on the old covenant]]\n* [[Early Christianity]]\n* [[Ebionites]]\n* [[Judaizers]]\n* [[Nazarene (sect)]]\n* [[New Perspective on Paul]]\n* [[Paleo-orthodoxy]]\n* [[Restorationism]]\n\n==References==\n{{Reflist}}\n\n==External links==\n* Pam Dewey, [http://www.isitso.org/guide/hebroot.html Hebrew Roots Movement] (Field Guide to the Wild World of Religion)\n\n[[Category:Christianity and Judaism]]\n[[Category:Christianity in the United States]]\n[[Category:Sacred Name Movement]]",
            "slug": "hebrew-roots",
            "date_updated": 1537255919231,
            "imported": "https://en.wikipedia.org/wiki/Hebrew_Roots"
        }
    ]
}