{
    "article": [
        {
            "title": "Masoretic Text",
            "text": "{{Bible related}}\n[[File:2nd century Hebrew decalogue.jpg|thumb|right|The [[Nash Papyrus]] (2nd century BCE) contains a portion of a pre-Masoretic Text, specifically the [[Ten Commandments]] and the [[Shema Yisrael]] prayer.]] \n\nThe '''Masoretic<ref>Pronounced {{IPAc-en|ˌ|m|æ|s|ə|ˈ|r|ɛ|t|ɪ|k}}.</ref> Text''' ('''MT''' or '''𝕸''') is the authoritative [[Biblical Hebrew|Hebrew]] and [[Biblical Aramaic|Aramaic]] text of the [[Tanakh]] for [[Rabbinic Judaism]]. It is not the original text ([[Urtext (Biblical studies)|Urtext]]) of the [[Hebrew Bible]]. It was primarily copied, edited and distributed by a group of [[Jews]] known as the [[Masoretes]] between the 7th and 10th centuries [[Common Era|CE]]. The oldest extant manuscripts date from around the 9th century.<ref>A 7th century fragment containing the Song of the Sea (Exodus 13:19–16:1) is one of the few surviving texts from the \"silent era\" of Hebrew biblical texts between the Dead Sea Scrolls and the [[Aleppo Codex]]. See [http://www.jpost.com/Israel/Rare-scroll-fragment-to-be-unveiled \"Rare scroll fragment to be unveiled,\" Jerusalem Post, May 21, 2007].</ref>  The [[Aleppo Codex]] (once the oldest-known complete copy but now missing the [[Torah]]) dates from the 10th century. The Masoretic Text defines the [[Development of the Hebrew Bible canon|Jewish canon]] and its precise letter-text, with its [[niqqud|vocalization]] and [[cantillation|accentuation]] known as the Masorah.\n\nThe ancient Hebrew word ''{{lang|he-Latn|mesorah}}'' ({{lang|he|מסורה}}, alt. {{lang|he|מסורת}}) broadly refers to the whole chain of Jewish tradition (see [[Oral law#Oral law in Judaism|Oral law]]), which is claimed (by Orthodox Judaism) to be unchanged and infallible. Referring to the Masoretic Text, ''mesorah'' specifically means the diacritic markings of the text of the [[Hebrew Scriptures]] and the concise marginal notes in manuscripts (and later printings) of the Tanakh which note textual details, usually about the precise spelling of words.\n\nModern scholars seeking to understand the history of the Tanakh’s text use a range of sources other than the Masoretic Text.<ref>{{cite web |url=http://www.jta.org/2014/05/13/news-opinion/united-states/scholars-seek-hebrew-bibles-original-text-but-was-there-one. |title=Scholars seek Hebrew Bible’s original text – but was there one? |work=Jewish Telegraphic Agency |accessdate=25 September 2015}}</ref> These include early Greek ([[Septuagint]]) and Syriac ([[Peshitta]]) translations, the [[Samaritan Pentateuch]], the [[Dead Sea Scrolls]] and quotations from rabbinic manuscripts. Most of these are older than the oldest surviving Masoretic text and often contradict it.<ref>{{cite web |url=http://www.timesofisrael.com/controversy-lurks-as-scholars-suss-out-original-biblical-text/#ixzz31uFPqDC8 |title=Controversy lurks as scholars try to work out Bible's original text |work=The Times of Israel |accessdate=25 September 2015}}</ref> Which of the three commonly known versions (Septuagint, Masoretic Text, Samaritan Pentateuch) is closest to the original text (Urtext) is not fully determined.<ref>{{cite book|last1=Shanks|first1=Herschel|title=Understanding the Dead Sea Scrolls|date=August 4, 1992|publisher=Random House|isbn=978-0679414483|page=336|edition= 1st}}</ref>) The Dead Sea Scrolls have shown the Masoretic Text to be nearly identical in consonant text to some texts of the Tanakh dating from 200 [[Common Era|BCE]] but different from others.<ref>{{cite book | author = Emanuel Tov | title = Textual Criticism of the Hebrew Bible | publisher = Fortress Press | place = Minneapolis | year = 1992}}</ref> Though the consonants of the Masoretic Text differ little from the text generally accepted in the early 2nd century (and also differ little from some [[Qumran]] texts that are even older), it has many differences of both greater and lesser significance when compared to the manuscripts of the [[Septuagint]], a Greek translation (about 1000 years older than the MT made in the 3rd to 2nd centuries BCE) of the Hebrew Scriptures that was in popular use by Jews in Egypt and the Holy Land (and matches the quotations in the [[New Testament]], especially by [[Paul the Apostle]]).<ref name=\"Pentiuc2006\">Eugen J. Pentiuc, Jesus the Messiah in the Hebrew Bible, Paulist Press, Mahwah, NJ, USA. 2006. pxvi</ref> A recent finding of a short [[Leviticus]] fragment, recovered from the ancient [[En-Gedi Scroll]], carbon-dated to the 3rd or 4th century CE, is completely identical with the Masoretic Text.<ref>The text discovered in the charred Ein Gedi scroll is “100 percent identical” to the version of the Book of Leviticus that has been in use for centuries, said Dead Sea Scroll scholar Emmanuel Tov from the Hebrew University of Jerusalem, who participated in the study.[https://apnews.com/60785bb2031a478cb71ce9278782c320/scanning-software-deciphers-ancient-biblical-scroll \"Scanning software deciphers ancient biblical scroll\" Associated Press, Sept 21, 2016].</ref>\n\nThe Masoretic Text was used as the basis for translations of the [[Old Testament]] in [[Protestant Bible]]s such as the [[King James Version]] and [[American Standard Version]] and ([[Divino afflante Spiritu|after 1943]]) for some versions of [[Catholic Bible]]s, replacing the [[Vulgate]] translation.\n\n== Origin and transmission ==\n[[File:Texts of the OT.svg|thumb|right|350px|The inter-relationship between various significant ancient manuscripts of the Old Testament (some identified by their [[wikt:siglum|sigla]]). Mt here denotes the Masoretic Text; LXX, the original [[Septuagint]].]]\n\nThe [[Talmud]] and [[Karaite Judaism|Karaite]] manuscripts<ref name=\"Nahum\">[[Nahum M. Sarna]] and [[S. David Sperling]] (2006), [https://www.jewishvirtuallibrary.org/jsource/judaica/ejud_0002_0003_0_02930.html#TEXT Text], in Bible, ''[[Encyclopaedia Judaica]]'' 2nd ed.; via [[Jewish Virtual Library]]</ref> state that a standard copy of the Hebrew Bible was kept in the court of the [[Temple in Jerusalem]] for the benefit of copyists; there were paid correctors of Biblical books among the officers of the Temple (Talmud, tractate Ketubot 106a).<ref name=\"Jewish\">[http://www.jewishencyclopedia.com/articles/10465-masorah ''Jewish Encyclopedia'':] Masorah.</ref> This copy is mentioned in the ''[[Letter of Aristeas]]'' (§ 30; comp. Blau, ''Studien zum Althebr. Buchwesen'', p.&nbsp;100), in the statements of [[Philo]] (preamble to his \"Analysis of the Political Constitution of the Jews\"), and in [[Josephus]] (''Contra Ap.'' i. 8).<ref name=\"Nahum\"/><ref name=\"Jewish\"/>\n\nA Talmudic story, perhaps referring to an earlier time, relates that three Torah scrolls were found in the Temple court but were at variance with each other. The differences were then resolved by majority decision among the three.<ref>For a discussion see: Zeitlin, S. (April 1966), [https://www.jstor.org/stable/1453840 Were There Three Torah-Scrolls in the Azarah?], ''[[The Jewish Quarterly Review]]'' New Series, '''56'''(4), 269–272</ref>\n\n=== Second Temple period ===\n\nThe discovery of the [[Dead Sea Scrolls]] at [[Qumran]], dating from c. 150 BCE-75 CE, shows that in this period there was not the scrupulous uniformity of text that was so stressed in later centuries. According to [[Menachem Cohen (scholar)|Menachem Cohen]], the Dead Sea scrolls decided these issues 'by showing that there was indeed a Hebrew text-type on which the Septuagint-translation was based and which differed substantially from the received MT'.<ref name=\"Cohen1979\" /> The scrolls show numerous small variations in [[orthography]], both as against the later Masoretic text, and between each other. It is also evident from the notings of corrections and of variant alternatives that scribes felt free to choose according to their personal taste and discretion between different readings.<ref name=\"Cohen1979\">Menachem Cohen, [http://cs.anu.edu.au/~bdm/dilugim/CohenArt/ The Idea of the Sanctity of the Biblical Text and the Science of Textual Criticism] in ''HaMikrah V'anachnu'', ed. Uriel Simon, HaMachon L'Yahadut U'Machshava Bat-Z'mananu and Dvir, Tel-Aviv, 1979.</ref>\n\nHowever, despite these variations, most of the Qumran fragments can be classified as being closer to the Masoretic text than to any other text group that has survived. According to [[Lawrence Schiffman]], 60% can be classed as being of proto-Masoretic type, and a further 20% Qumran style with bases in proto-Masoretic texts, compared to 5% proto-[[Samaritan Pentateuch|Samaritan]] type, 5% [[Septuagint]]al type, and 10% non-aligned.<ref>L. Schiffman, ''Reclaiming the Dead Sea Scrolls'', Yale University Press; illustrated edition (2007), {{ISBN|978-0-300-14022-4}}</ref>{{Page needed|date=January 2015}} [[Joseph Fitzmyer]] noted the following regarding the findings at Qumran Cave 4 in particular: \"Such ancient recensional forms of Old Testament books bear witness to an unsuspected textual diversity that once existed; these texts merit far greater study and attention than they have been accorded till now. Thus, the differences in the Septuagint are no longer considered the result of a poor or tendentious attempt to translate the Hebrew into the Greek; rather they testify to a different pre-Christian form of the Hebrew text\".<ref>Joseph Fitzmyer. The Dead Sea Scrolls and the Bible: After Forty Years, page 302</ref> On the other hand, some of the fragments conforming most accurately to the Masoretic text were found in Cave 4.<ref>Ulrich, E., Cross, F. M., Davila, J. R., Jastram, N., Sanderson, J. E., Tov, E. and Strugnell, J. (1994). Qumran Cave 4, VII, Genesis to Numbers. Discoveries in the Judaean Desert 12. Clarendon Press, Oxford.</ref>\n\n=== Rabbinic period ===\n\nAn emphasis on minute details of words and spellings, already used among the [[Pharisees]] as bases for argumentation, reached its height with the example of [[Rabbi Akiva]] (died 135 CE). The idea of a perfect text sanctified in its consonantal base quickly spread throughout the Jewish communities via supportive statements in [[Halakha]], [[Aggadah]], and Jewish thought;<ref name=\"Cohen1979\" /> and with it increasingly forceful strictures that a deviation in even a single letter would make a Torah scroll invalid.<ref>[[Maimonides]], The Laws of Tefillin, Mezuzot, and Torah Scrolls, 1:2</ref>  Very few manuscripts are said to have survived the [[Siege of Jerusalem (70 CE)|destruction of Jerusalem in 70 CE]].<ref>[[Godfrey Rolles Driver]], [http://www.bible-researcher.com/driver1.html Introduction to the Old Testament of the New English Bible], 1970</ref> This both drastically reduced the number of variants in circulation, and gave a new urgency that the text must be preserved. New Greek translations were also made. Unlike the Septuagint, large-scale deviations in sense between the Greek of [[Aquila of Sinope]] and [[Theodotion]] and what we now know as the Masoretic text are minimal. Detailed variations between different Hebrew texts in use still clearly existed though, as witnessed by differences between the present-day Masoretic text and versions mentioned in the [[Gemara]], and often even [[Halakha|halachic]] [[midrash]]im based on spelling versions which do not exist in the current Masoretic text.<ref name=\"Cohen1979\" />\n\n=== The Age of the Masoretes ===\n\nThe current received text finally achieved predominance through the reputation of the [[Masoretes]], schools of scribes and Torah scholars working between the 7th and 11th centuries, based primarily in the [[Land of Israel]] in the cities of [[Tiberias]] and [[Jerusalem]], and in [[Babylonia]]. According to Menachem Cohen these schools developed such prestige for the accuracy and error-control of their copying techniques that their texts established an authority beyond all others.<ref name=\"Cohen1979\" />  Differences remained, sometimes bolstered by systematic local differences in pronunciation and [[cantillation]]. Every locality, following the tradition of its school, had a standard codex embodying its readings.  In Babylonia the school of [[Sura (city)|Sura]] differed from that of [[Nehardea]]; and similar differences existed in the schools of the Land of Israel as against that at Tiberias, which in later times increasingly became the chief seat of learning. In this period living tradition ceased, and the Masoretes in preparing their codices usually followed the one school or the other, examining, however, standard codices of other schools and noting their differences.<ref name=\"Jewish\"/>\n\n==== Ben Asher and ben Naphtali ====\nIn the first half of the 10th century [[Aaron ben Moses ben Asher]] and [[Ben Naphtali]] were the leading Masoretes in [[Tiberias]]. Their names have come to symbolise the variations among Masoretes, but the differences between ben Asher and ben Naphtali should not be exaggerated.  There are hardly any differences between them regarding the consonants, though they differ more on vocalization and accents. Also, there were other authorities such as Rabbi Pinchas and Moshe Moheh, and ben Asher and ben Naphtali often agree against these others. Further, it is possible that all variations found among manuscripts eventually came to be regarded as disagreements between these figureheads.  Ben Asher wrote a standard codex<ref name=\"Jewish\"/> (the [[Aleppo Codex]]) embodying his opinions. Probably ben Naphtali did too, but it has not survived.{{Citation needed|date=December 2014}}\n\nIt has been suggested that there never was an actual \"ben Naphtali\"; rather, the name was chosen (based on the Bible, where Asher and Naphtali are the younger sons of Zilpah and Bilhah) to designate any tradition different from ben Asher's.{{Citation needed|date=December 2014}}\n\nBen Asher was the last of a distinguished family of Masoretes extending back to the latter half of the 8th century. Despite the rivalry of ben Naphtali and the opposition of [[Saadia Gaon]], the most eminent representative of the Babylonian school of criticism, ben Asher's codex became recognized as the standard text of the Bible.<ref name=\"Jewish\"/> See ''[[Aleppo Codex]]'', ''[[Codex Cairensis]]''.\n\nMost of the secular scholars conclude that Aaron ben Asher was a Karaite, though there is evidence against this view.<ref>Ben-Hayyim, Zeev. \"Ben-Asher, Aaron ben Moses.\" Encyclopaedia Judaica. Ed. Michael Berenbaum and Fred Skolnik. 2nd ed. Vol. 3. Detroit: Macmillan Reference USA, 2007. 319–321. Gale Virtual Reference Library. Web. 2 Jan. 2013. Ben Zeev states: \"The assumption that he was a Karaite serves to explain his attitude to the Bible and its authoritativeness in matters of halakhah (for example, Dikdukei ha-Te'amim, ed. A. Dotan (1967), ch. 2: \"The prophets… complete the Torah, are as the Torah, and we decide Law from them as we do from the Torah\") and to vocalization, opinions rooted in Karaite thought. It appears from the parallel ideas and style used in the Maḥberet Ben-Asher (see below), from the \"Wine Song\" written by his father, and from the list which his father appended to the codex of the Prophets (kept in the Karaite synagogue, Cairo), which he wrote \"827 years after the destruction of the Second Temple\" (i.e., in 895), that his father, Moses Ben-Asher, was also a Karaite, and it is probable that Karaism was a family tradition. (Note, however, that Dotan (Sinai, 41 (1957), 280ff.) and M. Zucker (Tarbiz, 27 (1957/58), 61ff.) hold that Aaron Ben-Asher and his family were not Karaites.) It is noteworthy that the founder of the family, \"Asher the Great Sage,\" apparently lived in the first half of the eighth century and was a contemporary of Anan, a precursor of Karaism.</ref>\n\n=== The Middle Ages ===\nThe two rival authorities, ben Asher and ben Naphtali, practically brought the Masorah to a close. Very few additions were made by the later Masoretes, styled in the 13th and 14th centuries Naḳdanim, who revised the works of the copyists, added the vowels and accents (generally in fainter ink and with a finer pen) and frequently the Masorah.<ref name=\"Jewish\"/>\n\nConsiderable influence on the development and spread of Masoretic literature was exercised during the eleventh, twelfth, and 13th centuries by the Franco-German school of [[Tosafot|Tosafists]]. Rabbi [[Gershom ben Judah]], his brother [[Machir ben Judah]], [[Joseph ben Samuel Bonfils]] (Tob 'Elem) of [[Limoges]], [[Rabbeinu Tam]] (Jacob ben Meïr), [[Menahem ben Perez]] of [[Joigny]], [[Perez ben Elijah]] of [[Corbeil, Marne]], [[Judah ben Isaac Messer Leon]], [[Meïr Spira]], and Rabbi [[Meir of Rothenburg]] made Masoretic compilations, or additions to the subject, which are all more or less frequently referred to in the marginal glosses of Biblical codices and in the works of Hebrew grammarians.<ref name=\"Jewish\"/>\n\n== Masorah ==\n{{See also|Tiberian vocalization}}\n[[File:Aleppo Codex (Deut).jpg|thumb|A page from the [[Aleppo Codex]], showing the extensive marginal annotations.]]\nBy long tradition, a ritual [[Sefer Torah]] (Torah scroll) could contain only the Hebrew [[Abjad|consonantal]] text – nothing added, nothing taken away. The Masoretic [[codex|codices]] however, provide extensive additional material, called ''masorah'', to show correct pronunciation and [[cantillation]], protect against scribal errors, and annotate possible variants. The manuscripts thus include [[niqqud|vowel points]], [[dagesh|pronunciation marks]] and [[cantillation|stress accents]] in the text, short annotations in the side margins, and longer more extensive notes in the upper and lower margins and collected at the end of each book.\n\nThese notes were added because the Masoretes recognized the possibility of human error in copying the Hebrew Bible. The Masoretes were not working with the original Hebrew manuscripts of the Bible and corruptions had already crept into the versions they copied.<ref>{{cite web|url=http://www.biblicalarchaeology.org/daily/biblical-topics/bible-versions-and-translations/errors-in-the-masoretes-original-hebrew-manuscripts-of-the-bible//|title=Errors in the Masoretes’ \"Original\" Hebrew Manuscripts of the Bible?|work=Biblical Archaeology Society|accessdate=25 September 2015}}</ref>\n\n=== Etymology ===\nThe Hebrew word ''masorah'' is taken from the [[Book of Ezekiel]] 20:37 and means originally \"[[legcuffs]]\". The fixation of the text was considered to be in the nature of legcuffs upon its [[Exposition (literary technique)|exposition]]. When, in the course of time, the Masorah had become a traditional discipline, the term became connected with the verb {{lang|he|מסר}} \"to hand down\" and acquired the general meaning of \"tradition.\"<ref name=\"Jewish\"/>\n\n=== Language and form ===\nThe language of the Masoretic notes is primarily [[Aramaic language|Aramaic]] but partly Hebrew. The Masoretic annotations are found in various forms: (a) in separate works, e.g., the ''[[Sefer Oklah we-Oklah|Oklah we-Oklah]]''; (b) in the form of notes written in the margins and at the end of codices. In rare cases, the notes are written between the lines. The first word of each Biblical book is also as a rule surrounded by notes. The latter are called the Initial Masorah; the notes on the side margins or between the columns are called the Small (''Masora parva'' or Mp) or Inner Masorah (Masora marginalis); and those on the lower and upper margins, the Large or Outer Masorah (''Masora magna'' or Mm[Mas.M]). The name \"Large Masorah\" is applied sometimes to the lexically arranged notes at the end of the printed Bible, usually called the Final Masorah,<ref name=\"Jewish\"/> (''Masora finalis''), or the Masoretic Concordance.{{Citation needed|date=December 2014}}\n\nThe Small Masorah consists of brief notes with reference to marginal readings, to statistics showing the number of times a particular form is found in Scripture, to full and defective spelling, and to abnormally written letters. The Large Masorah is more copious in its notes. The Final Masorah comprises all the longer rubrics for which space could not be found in the margin of the text, and is arranged alphabetically in the form of a concordance. The quantity of notes the marginal Masorah contains is conditioned by the amount of vacant space on each page. In the manuscripts it varies also with the rate at which the [[copyist]] was paid and the fanciful shape he gave to his gloss.<ref name=\"Jewish\"/>\n\n{{quote|There was accordingly an independent Babylonian Masora which differed from the Palestinian in terminology and to some extent in order. The Masora is concise in style with a profusion of abbreviations, requiring a considerable amount of knowledge for their full understanding. It was quite natural that a later generation of scribes would no longer understand the notes of the Masoretes and consider them unimportant; by the late medieval period they were reduced to mere ornamentation of the manuscripts. It was Jacob ben Chayyim who restored clarity and order to them.<ref>Würthwein, Ernst. ''The Text of the Old Testament''. Grand Rapids: William B. Eerdmans. 1979</ref>}}\n\nIn most manuscripts, there are some discrepancies between the text and the masorah, suggesting that they were copied from different sources or that one of them has copying errors.  The lack of such discrepancies in the Aleppo Codex is one of the reasons for its importance; the scribe who copied the notes, presumably [[Aaron ben Moses ben Asher]], probably wrote them originally.{{Citation needed|date=December 2014}}\n\n=== Numerical Masorah ===\nIn classical antiquity, [[copyist]]s were paid for their work according to the number of [[Wiktionary:stich|stich]]s (lines of verse). As the prose books of the Bible were hardly ever written in stichs, the copyists, in order to estimate the amount of work, had to count the letters.<ref name=\"Jewish\"/> For the Masoretic Text, such statistical information more importantly also ensured accuracy in the transmission of the text with the production of subsequent copies that were done by hand.{{Citation needed|date=December 2014}}\n\nHence the Masoretes contributed the Numerical Masorah.<ref name=\"Jewish\"/> These notes are traditionally categorized into two main groups, the marginal Masorah and the final Masorah. The category of marginal Masorah is further divided into the ''Masorah parva'' (small Masorah) in the outer side margins and the ''Masorah magna'' (large Masorah), traditionally located at the top and bottom margins of the text.{{Citation needed|date=December 2014}}\n\nThe ''Masorah parva'' is a set of statistics in the outer side margins of the text. Beyond simply counting the letters, the Masorah parva consists of word-use statistics, similar documentation for expressions or certain phraseology, observations on full or defective writing, references to the Kethiv-Qere readings and more. These observations are also the result of a passionate zeal to safeguard the accurate transmission of the sacred text.{{Citation needed|date=December 2014}}\n\nEven though often cited as very exact, the Masoretic \"frequency notes\" in the margin of Codex Leningradiensis contain several errors.<ref>{{Cite web |url=http://subhanallah.se/bibeln/gamla-testamentet/osakerheter/osakerheter-over-masoretiska-ordsummor/den-masoretiska-ordraknesumman-i-1-mos-1-12/ |title=Den masoretiska ordräknesumman i 1 Mos 1:12 |access-date=2012-04-15 |archive-url=https://web.archive.org/web/20130528122957/http://subhanallah.se/bibeln/gamla-testamentet/osakerheter/osakerheter-over-masoretiska-ordsummor/den-masoretiska-ordraknesumman-i-1-mos-1-12/ |archive-date=2013-05-28 |dead-url=yes |df= }}</ref><ref>{{Cite web |url=http://subhanallah.se/bibeln/gamla-testamentet/osakerheter/osakerheter-over-masoretiska-ordsummor/den-masoretiska-ordraknesumman-i-1-mos-2-18/ |title=Den masoretiska ordräknesumman i 1 Mos 2:18 |access-date=2012-04-15 |archive-url=https://web.archive.org/web/20130528124645/http://subhanallah.se/bibeln/gamla-testamentet/osakerheter/osakerheter-over-masoretiska-ordsummor/den-masoretiska-ordraknesumman-i-1-mos-2-18/ |archive-date=2013-05-28 |dead-url=yes |df= }}</ref><ref>See also the whole book \"The Sub Loco notes in the Torah of Biblia Hebraica Stuttgartensia\" by Daniel S. Mynatt, which describes about 150 frequency errors found in the Torah alone.</ref>\n\nThe ''Masorah magna'', in measure, is an expanded ''Masorah parva''. It is not printed in the [[Biblia Hebraica Stuttgartensia]] (BHS).{{Citation needed|date=December 2014}}\n\nThe final Masorah is located at the end of biblical books or after certain sections of the text, such as at the end of the Torah. It contains information and statistics regarding the number of words in a book or section, etc. Thus, [[Book of Leviticus]] 8:23 is the middle verse in the Pentateuch. The collation of manuscripts and the noting of their differences furnished material for the Text-Critical Masorah. The close relation which existed in earlier times (from the [[Soferim (Talmud)|Soferim]] to the [[Amoraim]] inclusive) between the teacher of tradition and the Masorete, both frequently being united in one person, accounts for the Exegetical Masorah. Finally, the invention and introduction of a graphic system of vocalization and accentuation gave rise to the Grammatical Masorah.<ref name=\"Jewish\"/>\n\nThe most important of the Masoretic notes are those that detail the [[Qere and Ketiv]] that are located in the ''Masorah parva'' in the outside margins of BHS. Given that the Masoretes would not alter the sacred consonantal text, the Kethiv-Qere notes were a way of \"correcting\" or commenting on the text for any number of reasons (grammatical, theological, aesthetic, etc.) deemed important by the copyist.<ref>Pratico and Van Pelt, ''Basics of Biblical Hebrew'', Zondervan. 2001. p406ff</ref>\n\n== Fixing of the text ==\nThe earliest labors of the Masoretes included standardizing division of the text into books, sections, paragraphs, verses, and clauses (probably in the chronological order here enumerated); the fixing of the orthography, pronunciation, and cantillation; the introduction or final adoption of the square characters with the five [[final letters]]; some textual changes to guard against blasphemy and the like (though these changes may pre-date the Masoretes – see ''Tikkune Soferim'' below); the enumeration of letters, words, verses, etc., and the substitution of some words for others in public reading.<ref name=\"Jewish\"/>\n\nSince no additions were allowed to be made to the official text of the Bible, the early Masoretes adopted other expedients: e.g., they marked the various divisions by spacing, and gave indications of halakic and haggadic teachings by full or defective spelling, abnormal forms of letters, dots, and other signs. Marginal notes were permitted only in private copies, and the first mention of such notes is found in the case of R. Meïr (c. 100–150 CE).<ref name=\"Jewish\"/>\n\n===Scribal emendations – ''Tikkune Soferim''===\n{{main|Tiqqun soferim}}\nEarly rabbinic sources, from around 200 CE, mention several passages of Scripture in which the conclusion is inevitable that the ancient reading must have differed from that of the present text. The explanation of this phenomenon is given in the expression \"Scripture has used euphemistic language\" ({{lang|he|כנה הכתוב}}), i.e. to avoid [[anthropomorphism]] and [[anthropopathism]].<ref name=\"Jewish\"/>\n\nRabbi Simon ben Pazzi (3rd century) calls these readings \"emendations of the Scribes\" (''tikkune Soferim''; Midrash Genesis Rabbah xlix. 7), assuming that the Scribes actually made the changes. This view was adopted by the later Midrash and by the majority of Masoretes. In Masoretic works these changes are ascribed to [[Ezra]]; to Ezra and [[Nehemiah]]; to Ezra and the [[Soferim (Talmud)|Soferim]]; or to Ezra, Nehemiah, [[Zechariah (Hebrew prophet)|Zechariah]], [[Haggai]], and [[Book of Baruch|Baruch]]. All these ascriptions mean one and the same thing: that the changes were assumed to have been made by the Men of the [[Great Assembly|Great Synagogue]].<ref name=\"Jewish\"/>\n\nThe term ''tikkun Soferim'' ({{lang|he|תקון סופרים}}) has been understood by different scholars in various ways. Some regard it as a correction of Biblical language authorized by the Soferim for homiletical purposes. Others take it to mean a mental change made by the original writers or redactors of Scripture; i.e. the latter shrank from putting in writing a thought which some of the readers might expect them to express.<ref name=\"Jewish\"/>\n\nThe assumed emendations are of four general types:\n* Removal of unseemly expressions used in reference to God; e.g., the substitution of  (\"to bless\") for (\"to curse\") in certain passages.\n* Safeguarding of the [[Tetragrammaton]]; e.g. substitution of \"[[Elohim]]\" or \"[[Adonai]]\" for \"[[Yahweh|YHWH]]\" in some passages.\n* Removal of application of the names of pagan gods, e.g. the change of the name \"Ishbaal\" to \"[[Ish-bosheth]].\"\n* Safeguarding the unity of divine worship at [[Jerusalem]].<ref name=\"Jewish\"/>\n\n=== Mikra and ittur ===\nAmong the earliest technical terms used in connection with activities of the Scribes are the ''mikra Soferim'' and ''ittur Soferim''. In the geonic schools, the first term was taken to signify certain vowel-changes which were made in words in pause or after the article; the second, the cancellation in a few passages of the \"vav\" conjunctive, where it had by some been wrongly read. The objection to such an explanation is that the first changes would fall under the general head of fixation of pronunciation, and the second under the head of [[Qere and Ketiv|''Qere'' and ''Ketiv'']] (i.e. \"What is read\" and \"What is written\"). Various explanations have, therefore, been offered by ancient as well as modern scholars without, however, succeeding in furnishing a completely satisfactory solution.<ref name=\"Jewish\"/>\n\n=== Suspended letters and dotted words ===\nThere are four words having one of their letters suspended above the line. One of them, מ<big><sup>נ</sup></big>שה ({{bibleverse||Judges|18:30|HE}}), is due to an alteration of the original משה out of reverence for [[Moses]]; rather than say that Moses' grandson became an idolatrous priest, a suspended letter nun&nbsp;(&nbsp;נ&nbsp;) was inserted to turn Mosheh into Menasheh ([[Manasseh]]). The origin of the other three ({{bibleverse||Psalms|80:14|HE}}; {{bibleverse||Job|38:13|HE}}, {{bibleverse-nb||Job|38:15|HE}}) is doubtful. According to some, they are due to mistaken majuscular letters; according to others, they are later insertions of originally omitted weak consonants.<ref name=\"Jewish\"/>\n\nIn fifteen passages in the Bible, some words are stigmatized; i.e., dots appear above the letters. ({{bibleverse||Genesis|16:5|HE}}, {{bibleverse-nb||Genesis|18:9|HE}}, {{bibleverse-nb||Genesis|19:33|HE}}, {{bibleverse-nb||Genesis|33:4|HE}}, {{bibleverse-nb||Genesis|37:12|HE}}, {{bibleverse||Numbers|3:39|HE}}, {{bibleverse-nb||Numbers|9:10|HE}}, {{bibleverse-nb||Numbers|21:30|HE}}, {{bibleverse-nb||Numbers|29:15|HE}}, {{bibleverse||Deuteronomy|29:28|HE}}, {{bibleverse|2|Samuel|19:20|HE}}, {{bibleverse||Isaiah|44:9|HE}}, {{bibleverse||Ezekiel|41:20|HE}}, {{bibleverse-nb||Ezekiel|46:22|HE}}, {{bibleverse||Psalms|27:13|HE}}) The significance of the dots is disputed. Some hold them to be marks of erasure; others believe them to indicate that in some collated manuscripts the stigmatized words were missing, hence that the reading is doubtful; still others contend that they are merely a mnemonic device to indicate homiletic explanations which the ancients had connected with those words; finally, some maintain that the dots were designed to guard against the omission by copyists of text-elements which, at first glance or after comparison with parallel passages, seemed to be superfluous. Instead of dots some manuscripts exhibit strokes, vertical or else horizontal. The first two explanations are unacceptable for the reason that such faulty readings would belong to Qere and Ketiv, which, in case of doubt, the majority of manuscripts would decide. The last two theories have equal probability.<ref name=\"Jewish\"/>\n\n=== Inverted letters ===\nIn nine passages of the Masoretic Text are found signs usually called [[inverted nun]]s, because they resemble the Hebrew letter [[Nun (letter)|nun]]&nbsp;(&nbsp;נ&nbsp;)<ref name=\"Jewish\"/> written in some inverted fashion.  The exact shape varies between different manuscripts and printed editions.  In many manuscripts, a reversed nun is found—referred to as a ''nun hafucha'' by the masoretes. In some earlier printed editions, they are shown as the standard nun upside down or rotated, because the printer did not want to bother to design a character to be used only nine times.  The recent scholarly editions of the Masoretic Text show the reversed nun as described by the masoretes. In some manuscripts, however, other symbols are occasionally found instead. These are sometimes referred to in rabbinical literature as ''simaniyot'' (markers).<ref>{{cite book|last1=Michaels|first1=Marc|title=Sefer Binsoa|publisher=Kulmus Publishing|isbn=978-0-9810947-7-9|pages=24–25 referencing Masechet Sofrim 6:1, Shabbat 115b (also Avot d'Rabi Natan 34:4)|edition= 5th}}</ref>\n\nThe primary set of inverted nuns is found surrounding the text of Numbers 10:35–36. The Mishna notes that this text is 85 letters long and dotted. This demarcation of this text leads to the later use of the inverted nun markings. [[Saul Lieberman]] demonstrated that similar markings can be found in ancient Greek texts where they are also used to denote 'short texts'. During the Medieval period, the inverted nuns were actually inserted into the text of the early Rabbinic Bibles published by Bomberg in the early 16th century. The talmud records that the markings surrounding {{bibleverse||Numbers|10:35–36|HE}} were thought to denote that this 85 letter text was not in its proper place.<ref>{{cite book|last1=Michaels|first1=Marc|title=Sefer Binsoa|publisher=Kulmus Publishing|isbn=978-0-9810947-7-9|pages=28-33 including references to Shabbat 115b and 116a (also Ba'al Haturim and Chizkuni)|edition= 5th}}</ref>\n\n[[Bar Kappara]] considered the Torah known to us as composed of seven volumes in the Gemara \"The seven pillars with which Wisdom built her house (Prov. 9:1) are the seven Books of Moses\". Genesis, Exodus and Leviticus and Deuteronomy as we know them but Numbers was really three separate volumes {{bibleverse||Numbers|1:1–10:35|HE}} followed by {{bibleverse||Numbers|10:35–36|HE}} and the third text from there to the end of Numbers.<ref>{{cite book|last1=Michaels|first1=Marc|title=Sefer Binsoa|publisher=Kulmus Publishing|isbn=978-0-9810947-7-9|pages=33-35 including references to Shabbat 115b (also Sifre Bamidbar B'ha'alotcha Piska 26 and Midrash Mishley)|edition= 5th}}</ref>\n\nThe 85 letter text is also said to be denoted because it is the model for the least number of letters which constitute a 'text' which one would be required to save from fire due to its holiness.<ref>{{cite book|last1=Michaels|first1=Marc|title=Sefer Binsoa|publisher=Kulmus Publishing|isbn=978-0-9810947-7-9|page=34 referencing Yadayim 3:5 and Sifre Bamidbar B'ha'alotcha Piska 26 |edition= 5th}}</ref>\n\n==History of the Masorah==\nThe history of the Masorah may be divided into three periods: (1) creative period, from its beginning to the introduction of vowel-signs; (2) reproductive period, from the introduction of vowel-signs to the printing of the Masorah<ref name=\"Jewish\"/> (1525); (3) critical period, from 1525 to the present time.{{Citation needed|date=December 2014}}\n\nThe materials for the history of the first period are scattered remarks in Talmudic and Midrashic literature, in the post-Talmudical treatises ''Masseket Sefer Torah'' and ''Masseket Soferim'', and in a Masoretic chain of tradition found in ben Asher's ''Diḳduḳe ha-Ṭe'amim,'' § 69 and elsewhere.<ref name=\"Jewish\"/>\n\n== Critical study ==\n[[Jacob ben Hayyim ibn Adonijah]], having collated a vast number of manuscripts, systematized his material and arranged the Masorah in the second [[Daniel Bomberg|Bomberg]] edition of the Bible ([[Venice]], 1524–25). Besides introducing the Masorah into the margin, he compiled at the close of his Bible a concordance of the Masoretic glosses for which he could not find room in a marginal form, and added an elaborate introduction – the first treatise on the Masorah ever produced. In spite of its numerous errors, this work has been considered by some as the \"[[Textus Receptus]]\" of the Masorah<ref name=\"Jewish\"/> (Würthwein 1995:39), and was used for the English translation of the [[Old Testament]] for the [[King James Version]].{{Citation needed|date=December 2014}}\n\nNext to Ibn Adoniyah, the critical study of the Masorah has been most advanced by [[Elia Levita]], who published his famous \"Massoret ha-Massoret\" in 1538. The ''Tiberias'' of the elder [[Johannes Buxtorf]] (1620) made Levita's researches more accessible to a Christian audience. The eighth [[Introduction (writing)|introduction]] to Walton's [[Polyglot (book)|Polyglot]] Bible is largely a reworking of the ''Tiberias''. Levita compiled likewise a vast Masoretic concordance, ''Sefer ha-Zikronot'', which still lies in the National Library at Paris unpublished. The study is indebted also to R. Meïr b. Todros ha-Levi (RaMaH), who, as early as the 13th century, wrote his ''Sefer Massoret Seyag la-Torah'' (correct ed. Florence, 1750); to [[Menahem Lonzano]], who composed a treatise on the Masorah of the Pentateuch entitled \"Or Torah\"; and in particular to [[Jedidiah Norzi]], whose \"Minḥat Shai\" contains valuable Masoretic notes based on a careful study of manuscripts.<ref name=\"Jewish\"/>\n\nThe [[Dead Sea Scrolls]] have shed new light on the history of the Masoretic Text. Many texts found there, especially those from [[Masada]], are quite similar to the Masoretic Text, suggesting that an ancestor of the Masoretic Text was indeed extant as early as the 2nd century BCE. However, other texts, including many of those from [[Qumran]], differ substantially, indicating that the Masoretic Text was but one of a diverse set of Biblical writings (Lane Fox 1991:99–106; Tov 1992:115). Among the rejected books by both the Judaic and Catholic canons was found the [[Book of Enoch]], the [[Community Rule]] (1QS) and [[War of the Sons of Light Against the Sons of Darkness]] (1QM).<ref>Mansoor, Menahem. The Dead Sea Scrolls. Grand Rapids, Michigan and Driver, G. R, The Judaean Scrolls. Great Britain: Oxford, 1965.</ref>\n\nIn a recent finding, the Masoretic Text is discovered to be completely identical with text recovered from an ancient scroll. The approximately 1,700-year-old [[En-Gedi Scroll]] was found in 1970 but had not had its content reconstructed until 2016. Researchers were able to recover 35 complete and partial lines of text from the [[Book of Leviticus]] and the text deciphered is completely identical with the consonantal framework of the Masoretic Text.<ref>{{cite web|last=Brent |first=William |url=http://advances.sciencemag.org/content/2/9/e1601247.full |title=From damage to discovery via virtual unwrapping: Reading the scroll from En-Gedi &#124; Science Advances |publisher=Advances.sciencemag.org |date=2016-09-21 |accessdate=2018-02-28}}</ref> The En-Gedi scroll is the first time a biblical scroll has been discovered in an ancient synagogue's holy ark, where it would have been stored for prayers, and not in desert caves like the Dead Sea Scrolls.<ref>http://bigstory.ap.org/article/60785bb2031a478cb71ce9278782c320/scanning-software-deciphers-ancient-biblical-scroll</ref>\n\n==Some important editions==\nThere have been very many published editions of the Masoretic Text, some of the most important being:\n*[[Daniel Bomberg]], ed. [[Jacob ben Hayyim ibn Adonijah]], 1524–1525, [[Venice]]\n:The second [[Mikraot Gedolot|Rabbinic Bible]] served as the base for all future editions. This was the source text used by the translators of the [[King James Version]] in 1611, the [[New King James Version]] in 1982, and the [[New Cambridge Paragraph Bible]] in 2005.<ref name=price>{{cite web\n  | author = Price, James D.\n  | title = (DOC) This file is a letter I wrote to Mrs. Ripplinger in 1994 in response to her book, New Age Bible Versions. It deals primarily with her criticism of the New King James Version.\n  | publisher = ''James D. Price Publications''\n  | date = 1994-02-14\n  | url = http://www.jamesdprice.com/images/Ripplinger_February_15,_1994.doc\n  | page = 4\n  | format = MS Word\n  | accessdate = 2010-08-28\n  | quote = But regardless of these details, as former executive editor of the NKJV Old Testament, I can confidently assure you that the NKJV followed, as carefully as possible, the Bobmerg &#91;[[sic]] Bomberg]<!-- sic in original --> 1524–25 Ben Chayyim edition that the KJV 1611 translators used—I personally made sure. }} <!--Archived by WebCite at https://www.webcitation.org/5sJrik4vd --></ref>\n*[[Everard van der Hooght]], 1705, [[Amsterdam]] and [[Utrecht (city)|Utrecht]]\n:This was practically a reprint of the [[Joseph Athias|Athias]]-[[Jean de Leusden|Leusden]] edition of 1667; but at the end it has variants taken from a number of printed editions. It has been much prized because of its excellent and clear type; but no manuscripts were used in its preparation. Nearly all 18th and 19th century Hebrew Bibles were almost exact reprints of this edition.\n*[[Benjamin Kennicott]], 1776, [[Oxford]]\n:As well as the van der Hooght text, this included the [[Samaritan Pentateuch]] and a huge collection of variants from manuscripts and early printed editions; while this collection has many errors, it is still of some value.  The collection of variants was corrected and extended by [[Giovanni Bernardo De Rossi]] (1784–8), but his publications gave only the variants without a complete text.\n*[[Wolf Heidenheim]], 1818, [[Frankfurt-am-Main]]\n:This edition (called ''Me'or Enayim'') included the Five Books of Moses, Haftarot and Megillot.  It had many differences from earlier editions in vowels, notes and lay-out, based on a comparison with old manuscripts and a correction of misprints based on analysis of grammatical principles.  There were extensive textual notes justifying all these alterations.  Heidenheim also divided each weekly Sabbath reading into seven sections (seven people should be called up each Sabbath), as there had been considerable variation in practice about where to make the divisions, and his divisions are now accepted by nearly all Ashkenazi communities. [[Samson Raphael Hirsch]] used this text (omitting the textual notes) in his own commentary, and it became the standard text in Germany.  It was frequently reprinted there, again without the textual notes, up to [[World War II]], and the edition of [[Jack Mazin]] (London, 1950) is an exact copy.\n*[[Max Letteris]], 1852; 2nd edition, 1866 (published [[British and Foreign Bible Society]])\n:The 1852 edition was yet another copy of van der Hooght.  The 1866 edition, however, was carefully checked against old manuscripts and early printed editions, and has a very legible typeface.  It is probably the most widely reproduced text of the Hebrew Bible in history, with many dozens of authorised reprints and many more pirated and unacknowledged ones.<ref>Harry M. Orlinsky, Prolegomenon to the 1966 reprint of [[Christian Ginsburg]], \"Introduction to the Massoretico-Critical Edition of the Hebrew Bible\"</ref>\n*[[Seligman Baer]] and [[Franz Delitzsch]], 1869–1895 ([[Book of Exodus|Exodus]] to [[Deuteronomy]] never appeared)\n*[[Christian David Ginsburg]], 1894; 2nd edition, 1908–1926\n:The first edition was very close to the second Bomberg edition, but with variants added from a number of manuscripts and all of the earliest printed editions, collated with far more care than the work of Kennicott; he did all the work himself.  The second edition diverged slightly more from Bomberg, and collated more manuscripts; he did most of the work himself, but failing health forced him to rely partly on his wife and other assistants.<ref>\"Introduction to the Ginsburg Edition of the Hebrew Old Testament\", [[British and Foreign Bible Society]], 1928.</ref>\n*[[Biblia Hebraica (Kittel)|Biblia Hebraica]], first two editions, 1906, 1912; virtually identical to the second Bomberg edition, but with variants from Hebrew sources and early translations in the footnotes\n*[[Biblia Hebraica (Kittel)|Biblia Hebraica]], third edition based on the [[Leningrad Codex]], 1937; later reprints listed some variant readings from the [[Dead Sea Scrolls]].\n*[[Umberto Cassuto]], 1953 (based on Ginsburg 2nd edition, but revised based on the [[Aleppo Codex]], [[Leningrad Codex]] and other early manuscripts)\n*[[Norman Snaith]], 1958 (published [[British and Foreign Bible Society]])\n:Snaith based it on Sephardi manuscripts such as British Museum Or. 2626-28, and said that he had not relied on Letteris. However, it has been shown that he must have prepared his copy by amending a copy of Letteris, because while there are many differences, it has many of the same typographical errors as Letteris.  Snaith's printer even went so far as to break printed vowels to match some accidentally broken characters in Letteris.  Snaith combined the accent system of Letteris with the system found in Sephardi manuscripts, thereby creating accentuation patterns found nowhere else in any manuscript or printed edition.\n* [[Hebrew University Bible Project]], 1965–\n:Started by [[Moshe Goshen-Gottstein]], this follows the text of the [[Aleppo Codex]] where extant and otherwise the [[Leningrad Codex]]. It includes a wide variety of variants from the [[Dead Sea Scrolls]], [[Septuagint]], early Rabbinic literature and selected early mediaeval manuscripts. So far, only Isaiah, Jeremiah and Ezekiel have been published.\n*The Koren Bible by [[Koren Publishers Jerusalem]], 1962\n:The text was derived by comparing a number of printed Bibles, and following the majority when there were discrepancies.  It was criticised by [[Moshe Goshen-Gottstein]]: \"the publisher of the Koren Bible – who laid no claim to expertise in masoretic issues ... sought the help of three scholars, all of whom suffered from the same lack of masoretic expertise ... Basically, the Koren edition is hardly an edition like that of Dotan, but another rehash of the material prepared by ben Hayim.\"<ref>''Editions of the Hebrew Bible – Past and Future'', pages 239–240, in ''Sha'arei Talmon'', Eisenbrauns, 1992.</ref>\n*[[Aron Dotan]], based on the [[Leningrad Codex]] but correcting obvious errors, 1976\n*[[Biblia Hebraica Stuttgartensia]], revision of [[Biblia Hebraica (Kittel)|Biblia Hebraica]] (third edition), 1977.  The second edition of ''Stuttgartensia'' (published 1983) was the source text for the Old Testament portion of the [[English Standard Version]], published in 2001.\n*[[Mordechai Breuer]], based on the [[Aleppo Codex]], 1977–1982\n*The [[Jerusalem Crown]], 2001: this is a revised version of Breuer, and is the official version used in inaugurating the President of Israel\n*[[Biblia Hebraica Quinta]], revision of [[Biblia Hebraica Stuttgartensia]]; fascicles published as of 2016 are: Five Megilloth, Ezra and Nehemiah, Deuteronomy, Proverbs, Twelve Minor Prophets, Judges, Genesis.\n\n==See also==\n* [[Micrography]]\n* [[Parashah]]\n\n== References ==\n{{Reflist|30em}}\n\n==Works cited==\n\n*{{cite book\n | last = Lane Fox\n | first = Robin\n | authorlink = Robin Lane Fox\n | title = The Unauthorized Version\n | publisher = [[Alfred A. Knopf]]\n | year=  1991\n | pages = 99–106\n | isbn = 0-394-57398-6\n}}\n*{{cite book\n | last = Tov\n | first = Emanuel\n | authorlink = Emanuel Tov\n | title = Textual Criticism of the Hebrew Bible\n | publisher = Fortress press\n | year=  1992\n | isbn = 0-8006-3429-2\n}}\n*{{cite book\n | last = Würthwein\n | first = Ernst\n | authorlink = Ernst Würthwein\n | title = The Text of the Old Testament\n | publisher = Fortress press\n | year=  1995\n | isbn = 0-8028-0788-7\n}}\n\n==External links==\n*[http://www.jewishencyclopedia.com/view.jsp?artid=246&letter=M ''Jewish Encyclopedia'':] Masorah\n*[http://www.toseftaonline.org Dr. Christian David Ginsburg's 1880 edition of the Massorah] (PDF)\n*[http://www.originalbibles.com/masoretic-hebrew-bible-1894/ The Masoretic Critical Edition of 1894] &ndash; Ginsburg's full edition of over 1,800 pages (scanned PDF)\n*[[Nahum M. Sarna]] and S. David Sperling (2006), [https://www.jewishvirtuallibrary.org/jsource/judaica/ejud_0002_0003_0_02930.html#TEXT Text], in Bible, ''[[Encyclopaedia Judaica]]'' 2nd ed.; via [[Jewish Virtual Library]]\n*[https://web.archive.org/web/20120701052822/http://www.bib-arch.org/e-features/searching-for-better-text.asp Searching for the Better Text: How errors crept into the Bible and what can be done to correct them] Biblical Archaeology Review\n*[http://www.wdl.org/en/item/11363/ Hebrew Bible] and the Masora Magna from around 1300 CE\n*{{Cite NIE|wstitle=Masora|year=1905 |short=x}}\n*{{Cite journal|url=https://www.academia.edu/31747129/THE_VALIDITY_OF_THE_MASORETIC_TEXT_AS_A_BASIS_FOR_DIACHRONIC_LINGUISTIC_ANALYSIS_OF_BIBLICAL_TEXTS_EVIDENCE_FROM_MASORETIC_VOCALISATION |last=Samet|first=Nili|year=2016|title=The Validity of the Masoretic Text: Evidence from Masoretic Vocalisation|journal=Journal for Semitics|volume=25|number=2|pages=1064–1079}}\n\n{{Books of the Bible}}\n{{Authority control}}\n\n[[Category:Hebrew Bible versions and translations]]\n[[Category:Torah]]\n[[Category:Karaite Judaism]]",
            "slug": "masoretic-text",
            "date_updated": 1537256591080,
            "imported": "https://en.wikipedia.org/wiki/Masoretic Text"
        }
    ]
}