{
    "article": [
        {
            "title": "New Perspective on Paul",
            "text": "{{short description|Interpretation of good works in the Apostle Paul}}\n{{redirect|New Perspective|the song by Panic! at the Disco|New Perspective (song)}}\n{{multiple issues|\n{{cleanup rewrite|date=August 2012}}\n{{inadequate lead|date=February 2013}}\n}}\n[[File:PaulT.jpg|thumb|right|300px|[[Valentin de Boulogne]]: ''Saint Paul Writing His Epistles'', Seventeenth century (Blaffer Foundation Collection, Houston, Texas).]]\n\nThe \"'''New Perspective on Paul'''\" represents a significant shift since the 1960s in the way some scholars, especially [[Protestant]] scholars, interpret the writings of the [[Paul the Apostle|Apostle Paul]].\n\nPaul, especially in his [[Epistle to the Romans]], advocates justification through faith in [[Jesus Christ]] over justification through works of the Law. In the historic [[Lutheran]] and [[Calvinism|Reformed]] perspective, known as ''[[sola fide]]'', theologians understood Paul as arguing that Christians’ [[good works]] would not factor into their [[Salvation (Christianity)|salvation]] &ndash; only their [[Faith in Christianity|faith]] would count. But according to the “new perspective”, Paul was not addressing good works in general, but instead questioning only observances such as [[Circumcision controversy in early Christianity|circumcision]], [[Kashrut|dietary laws]], and Sabbath laws, which were the ‘boundary markers’<ref>{{Cite book|title = The New Perspective on Paul|last = Dunn|first = James D. G.|publisher = Eerdmans Publishing Co.|year = 2005|isbn = 978-0-8028-4562-7|location = Grand Rapids|pages = }}</ref> that set the Jews apart from the other nations. This grew from the work of [[E. P. Sanders]], ''Paul and Palestinian Judaism'', published in 1977.<ref>{{Cite book|title = Paul and Palestinian Judaism|last = Sanders|first = E. P.|publisher = Fortress Press|year = 1977 |isbn = 978-0-8006-1899-5|location = Minneapolis|pages = }}</ref> Sanders saw the Jews of Pauline times not as a “legalistic community”, nor as oriented to “salvation by works”. For Sanders, the Jews felt they were saved as they were God's chosen people. By being God's chosen people they were under his [[Covenant (biblical)|covenant]]. The Jews kept [[Torah|the Law]] to remain under the covenant &ndash; the Law was not a way of entering the covenant but of staying within the covenant.\n\n==Development==\nSince the [[Protestant Reformation]] (c. 1517), studies of [[Pauline epistles|Paul’s writings]] have been heavily influenced by [[Lutheran]] and [[Calvinism|Reformed]] views that are said to ascribe the negative attributes that they associated with [[Christianity in the 16th century|sixteenth-century Roman Catholicism]] to [[Second Temple Judaism]]. These Lutheran and Reformed views on Paul's writings are called “the old perspective” by adherents of the “new perspective on Paul”. The “new perspective” is an attempt to lift Paul's letters out of the Lutheran-Reformed framework and interpret them based on what is said to be an understanding of first-century Judaism, taken on its own terms.\n\nIn 1963 the Lutheran theologian [[Krister Stendahl]] published a paper arguing that the typical Lutheran view of the Apostle Paul’s theology did not fit with statements in [[Pauline Epistles|Paul’s writings]], and in fact was based more on mistaken [[Pauline Christianity|assumptions about Paul’s beliefs]] than careful interpretation of his writings.<ref>{{cite journal |doi=10.1017/S0017816000024779 |jstor = 1508631 |title = The Apostle Paul and the Introspective Conscience of the West |year=1963 |last =Stendahl |first =Krister |journal= [[Harvard Theological Review]] |volume=56 |issue=3 |pages=199–215}}</ref> Stendahl warned against imposing modern Western ideas on the Bible, and especially on the works of Paul.<ref>{{Cite journal |url= |title= The Apostle Paul and the Introspective Conscience of the West |last= Stendahl |first= Krister |date= 1963 |journal= [[Harvard Theological Review]] |volume=56 |access-date = }}</ref> In 1977 [[E. P. Sanders]] published ''Paul and Palestinian Judaism''.<ref name=\"P. Sanders, 1977\">{{Citation |first= EP |last= Sanders | author-link= E. P. Sanders |title= Paul and Palestinian Judaism: A Comparison of Patterns of Religion |publisher= Fortress Press |place= Philadelphia |year= 1977}}.</ref> In this work he studies Jewish literature and Paul’s writings arguing that the traditional Lutheran understanding of the theology of Judaism and Paul was fundamentally incorrect.\n\nSanders continued to publish books and articles in this field, and was soon joined by the scholar [[James D. G. Dunn]]. Dunn reports that Anglican theologian [[N.T. Wright]] was the first to use the term “new perspective on Paul” in his 1978 Tyndale Lecture.<ref>[[N.T. Wright]], {{Google books|id=6i2xvonpvMwC&redir_esc=y|page=11-2|title=Justification: God's Plan and Paul's Vision}}. SPCK, 2009. {{ISBN|978-0-281-06090-0}}</ref> The term became more widely known after being used by Dunn as the title of his 1982 Manson Memorial Lecture where he summarized and affirmed the movement,<ref>[[Richard N. Longenecker]], {{Google books|id=5Qs54KfN5dIC|page=327|title=Introducing Romans: Critical Issues in Paul's Most Famous Letter}}. Eerdmans, 2011. {{ISBN|978-0802866196}}</ref><ref>{{cite journal |first = James D. G. |last =Dunn |authorlink= James Dunn (theologian) |year = 1983 | title = The New Perspective on Paul |journal= Bulletin of the John Rylands University Library of Manchester |volume=65 | issue =2 |pages=95–122}}</ref> The work of these writers inspired a large number of scholars to study, discuss, and debate the relevant issues. Many books and articles dealing with the issues raised have since been published. [[N. T. Wright]] has written a large number of works aimed at popularising the “new perspective” outside of academia.<ref>For example, {{Citation | first = NT | last = Wright | author-link = N. T. Wright | title = What Saint Paul Really Said | publisher = Eerdmans | year = 1997}}{{Page needed|date= December 2011}}</ref>\n\nThe “new-perspective” movement is closely connected with a surge of recent scholarly interest in studying the Bible in the context of other ancient texts, and the use of social-scientific methods to understand ancient culture. Scholars affiliated with [[The Context Group]] as well as many others in the field have called for various reinterpretations of biblical texts based on their studies of the ancient world.{{Citation needed |date=August 2015}}\n\n== Main ideas ==\nIt is often noted that the singular title \"the new perspective\" gives an unjustified impression of unity. It is a field of study in which many scholars are actively pursuing research and continuously revising their own theories in light of new evidence, and who do not necessarily agree with each other on any given issue. It has been suggested by many that a plural title of \"new\" perspective''s'' may therefore be more accurate. In 2003, N. T. Wright, distancing himself from both Sanders and Dunn, commented that \"there are probably almost as many 'new' perspective positions as there are writers espousing it – and I disagree with most of them\".<ref name = \"NTW NP\">N. T. Wright, ''[http://www.ntwrightpage.com/Wright_New_Perspectives.htm New Perspectives].</ref> There are certain trends and commonalities within the movement, but what is held in common is the belief that the historic Lutheran and Reformed perspectives of [[Paul the Apostle and Judaism]] are fundamentally incorrect. The following are some of the issues being widely discussed.\n\n=== Works of the Law ===\nPaul's letters contain a substantial amount of criticism of \"[[Law and Gospel|works of the law]]\". The radical difference in these two interpretations of what Paul meant by \"works of the law\" is the most consistent distinguishing feature between the two perspectives. The historic Lutheran and Reformed perspectives interpret this phrase as referring to human effort to do good works in order to meet God's standards ([[Legalism (theology)|Works Righteousness]]). In this view, Paul is arguing against the idea that humans can merit salvation from God by their good works alone (note that the \"new\" perspective agrees that we cannot merit salvation; the issue is what exactly Paul is addressing).\n\nBy contrast, new-perspective scholars see Paul as talking about \"badges of covenant membership\" or criticizing Gentile believers who had begun to rely on the Torah to reckon Jewish kinship.<ref>For \"badges of covenant membership\", see N. T. Wright, ''Paul for Everyone: Romans part one'' (Louisville: Westminster John Knox, 2004), 35–41. 5. For reliance on the Torah to reckon Jewish kinship, see {{cite journal |last=Eisenbaum |first=Pamela |date=Winter 2004 |title=A Remedy for Having Been Born of Woman: Jesus, Gentiles, and Genealogy in Romans\n |journal=Journal of Biblical Literature |volume=123 |issue=4 |pages=671–702 |url=http://www.sbl-site.org/assets/pdfs/JBL1234.pdf |accessdate=2008-10-26 |doi=10.2307/3268465 |publisher=The Society of Biblical Literature |jstor=3268465 }}</ref> It is argued that in Paul's time, Israelites were being faced with a choice of whether to continue to follow their ancestral customs, the [[Torah]] (\"the ancestral customs\"), or to follow the Roman Empire's trend to adopt Greek customs ([[Hellenization]], see also [[Antinomianism]], [[Hellenistic Judaism]], and [[Circumcision controversy in early Christianity]]). This is comparable with [[Westernization]] and the decision faced by modern individuals such as [[Indigenous peoples of the Americas|American Indians]] to follow their native culture or to adopt Western customs and lifestyle, see also [[Cultural imperialism]]. The new-perspective view is that Paul's writings discuss the comparative merits of following [[Torah|ancient Israelite]] or [[Athenian Golden Age|ancient Greek customs]]. Paul is interpreted as being critical of a common Jewish view that following traditional Israelite customs makes a person better off before God, pointing out that Abraham was righteous before the Torah was given. Paul identifies customs he is concerned about as [[Circumcision controversy in early Christianity|circumcision]], [[Taboo food#Blood|dietary laws]], and [[Sabbath in Christianity|observance of special days]].<ref>Dunn, James D. 'The New Perspective on Paul', 104, 2005.</ref>\n\n=== Human effort and good works ===\nDue to their interpretation of the phrase \"works of the law\", theologians of the historic Lutheran and Reformed perspectives see Paul's rhetoric as being against human effort to earn righteousness. This is often cited by Lutheran and Reformed theologians as a central feature of the Christian religion, and the concepts of [[sola gratia|grace alone]] and [[sola fide|faith alone]] are of great importance within the creeds of these denominations.{{Citation needed|date=July 2010}}\n\n\"New-perspective\" interpretations of Paul tend to result in Paul having nothing negative to say about the idea of human effort or good works, and saying many positive things about both. New-perspective scholars point to the many statements in Paul's writings that specify the criteria of [[Last judgment|final judgment]] as being the works of the individual.\n\n{{Quote | Final Judgment According to Works... was quite clear for Paul (as indeed for Jesus). Paul, in company with mainstream second-Temple Judaism, affirms that God’s final judgment will be in accordance with the entirety of a life led – in accordance, in other words, with works. | N. T. Wright<ref>{{Citation | url = http://www.ntwrightpage.com/Wright_New_Perspectives.htm | title = New Perspectives on Paul | publisher = 10th Edinburgh Dogmatics Conference |date=August 2003 | first = N. T | last = Wright}}.</ref>}}\n\nWright however does not hold the view that good works contribute to one's salvation but rather that the final judgement is something we can look forward to as a future vindication of God's present declaration of our righteousness. In other words, our works are a result of our salvation and the future judgement will show that.<ref>{{Citation | url = http://www.ntwrightpage.com/Wright_New_Perspectives.pdf | title = New perspective | last = Wright | first = NT | format = PDF}}.</ref> Others tend to place a higher value on the importance of good works than the historic Lutheran and Reformed perspectives do, taking the view that they causally contribute to the salvation of the individual.{{Citation needed|date=July 2010}}\n\nAdvocates of the historic Lutheran and Reformed perspectives often see this as being \"salvation by works\", and as a bad thing, contradicting fundamental tenets of Christianity. New-perspective scholars often respond that their views are not so different. For in the perspective of Luther and Calvin, God graciously empowers the individual to the faith which leads to salvation and also to good works, while in the \"new\" perspective God graciously empowers individuals to the faith and good works, which lead to salvation.{{Citation needed|date=July 2010}}\n\nSee also [[Synergism (theology)|Synergism]] in [[Theosis (Eastern Orthodox theology)|theosis]] in the [[Eastern Orthodox Church]] and [[Orthopraxy#Christianity|Orthopraxy in Christianity]].\n\n=== Faith, or faithfulness ===\nAn ongoing debate related to the \"new\" perspective has been over Paul's use of the Greek word ''pistis'' (''πίστις'', meaning \"trust\", \"belief\", \"faith\", or \"faithfulness\"). Writers with a more historic Lutheran and Reformed perspective have typically interpreted this word as meaning a [[Faith in Christianity|belief in God and Christ]], and trust in Christ for salvation with faith that he will save you.{{citation needed|date=May 2014}} This interpretation is based on several passages from the Christian Bible, notably the [[Deutero-Pauline]] epistle to the Ephesians: \"For by grace you have been saved through faith. And this is not your own doing; it is the gift of God, not as a result of works, so that no one may boast\" (Eph. 2:9). [[E. P. Sanders]] has conceded that Ephesians 2:9 teaches the traditional perspective.<ref>Guy Prentiss Waters, Justification and the New Perspectives on Paul, p. 167, notes \"Sanders has conceded to me that Ephesians 2:9 teaches the traditional view.\"</ref>\n\nBy contrast, many recent studies of the Greek word ''pistis'' have concluded that its primary and most common meaning was ''faithfulness'', meaning firm commitment in an interpersonal relationship.<ref>Douglas A. Campbell, \"The Quest For Paul’s Gospel: A Suggested Strategy\", 2005, pp. 178–207</ref><ref>{{cite journal |jstor=3267114 |pages=461–476 |last1=Hay |first1=D. M. |title=Pistis as \"Ground for Faith\" in Hellenized Judaism and Paul |volume=108 |issue=3 |journal=Journal of Biblical Literature |year=1989 |doi=10.2307/3267114}}</ref><ref>{{cite journal |pages=212–5 |doi=10.1177/001452467408500710 |title=The 'Faith of Christ' |year=1974 |last1=Howard |first1=G. |journal=The Expository Times |volume=85 |issue=7}}</ref><ref>Pilch and Malina, \"Handbook of Biblical Social Values\", 1998, pg 72–75</ref> As such, the word could be almost synonymous with \"obedience\" when the people in the relationship held different status levels (e.g. a slave being faithful to his master). Far from being equivalent to \"lack of human effort\", the word seems to imply and require human effort. The interpretation of Paul's writings that we need \"faithfully\" to obey God's commands is quite different from one which sees him saying that we need to have \"faith\" that he will do everything for us. This is also argued to explain why James was adamant that \"faith without works is dead\" and that \"a man is justified by works, and not by faith alone\" (Js. 2:24), while also saying that merely to believe places one on the same level as the demons (see [[Epistle of James#Content|James 2]]). The \"new\" perspective argues that James was concerned with those who were trying to reduce faith to an intellectual subscription without any intent to follow God or Jesus, and that Paul always intended \"faith\" to mean a full submission to God.\n\nAnother related issue is the ''pistis Christou'' (\"faith of Christ\") debate. Paul several times uses this phrase at key points in his writings and it is linguistically ambiguous as to whether it refers to our faith in Christ (\"objective genitive\"), or Christ's own faithfulness to God (\"subjective genitive\"), or even our faith/faithfulness to God like that which Christ had (\"adjectival genitive\"). There is wide disagreement within the academic community over which of these is the best rendering.<ref>{{Synthesis inline|date=December 2011}}See, e.g.: '''for subjective genitive''':\n*{{cite journal |pages=212–5 |doi=10.1177/001452467408500710 |title=The 'Faith of Christ' |year=1974 |last1=Howard |first1=G. |journal=The Expository Times |volume=85 |issue=7}}\n*{{cite book |first1=Richard B. |last1=Hays |year=2002 |title=The faith of Jesus Christ: the narrative substructure of Galatians 3:1–4:11 |isbn=978-0-596-00281-7}}{{Page needed|date=December 2011}}\n*{{cite journal |first1=Morna D. |last1=Hooker |title=Πίστις Χριστοῦ |journal=[[New Testament Studies]] |volume=35 |year=1989 |pages=321–42}}\n<br/>{{Synthesis inline|date=December 2011}}'''For objective genitive''':\n*{{cite journal |jstor=1560601 |pages=248–263 |last1=Hultgren |first1=A. J. |title=The Pistis Christou Formulation in Paul |volume=22 |issue=3 |journal=Novum Testamentum |year=1980 |doi=10.1163/156853680x00143}}\n*{{cite journal |first1=J. D. G. |last1=Dunn |title=Once More, ΠΙΣΤΙΣ ΧΡΙΣΤΟΥ |journal=Society of Biblical Literature Seminar Papers |year=1991 |pages=730–44}}</ref> The [[NET Bible]] translation became the first mainstream English Bible translation to use a subjective genitive translation (\"the faithfulness of Jesus Christ\") of this phrase.<ref>E.g., [http://net.bible.org/#!l/bible%3ARomans%203__notes%3ARomans%203 Romans 3:21–22]: 'But now apart from the law the righteousness of God (which is attested by the law and the prophets) has been disclosed – namely, the righteousness of God through '''the faithfulness of Jesus Christ''' for all who believe. ...' (emphasis added. Also see [http://net.bible.org/#!bible/Galatians+2:21 Gal. 2:20]).{{Primary source inline|date=December 2011}}</ref>\n\n=== Grace, or favor ===\nWriters with a more historic Lutheran and Reformed perspective have generally translated the Greek word ''charis'' as \"grace\" and understood it to refer to the idea that there is a lack of human effort in salvation because God is the controlling factor. However those who study ancient Greek culture have pointed out that \"favor\" is a better translation, as the word refers normally to \"doing a favor\". In ancient societies there was the expectation that such favors be repaid, and this semi-formal system of favors acted like loans.<ref>David A.deSilva, Honor, Patronage, Kinship and Purity: Unlocking New Testament Culture, 2000, pg 117</ref> Gift giving corresponded with the expectation of reciprocity.<ref>B. J. Oropeza, \"The Expectation of Grace,\" ''Bulletin for Biblical Research'' 24.2 (2014) 207-226</ref> Therefore, it is argued that when Paul speaks of how God did us a \"favor\" by sending Jesus, he is saying that God took the initiative, but is not implying a lack of human effort in salvation, and is in fact implying that Christians have an obligation to repay the favor God has done for them. Some argue that this view then undermines the initial \"favor\"—of sending Jesus—by saying that, despite his life, death and resurrection, Christians still have, as before, to earn their way to heaven. However, others note this is the horns of a [[false dilemma]] (all grace versus all works). Many new-perspective proponents that see \"charis\" as \"favor\" do not teach that Christians ''earn'' their way to heaven outside of the death of Christ. Forgiveness of sins through the blood of Christ is still necessary to salvation. But, that forgiveness demands effort on the part of the individual (cf. Paul in Phil. 3:12–16).<ref>http://www.ntwrightpage.com/Wright_Romans_Theology_Paul.pdf</ref>\n\n=== The Atonement ===\n{{See also|Atonement in Christianity}}\nTo writers of the historic Lutheran and Reformed perspectives the [[penal substitution]] atonement theory and the belief in the \"finished work\" of Christ have been central. New-perspective writers have regularly questioned whether this view is really of such central importance in Paul's writings. Generally new-perspective writers have argued that other theories of the atonement are more central to Paul's thinking, but there has been minimal agreement among them as to what Paul's real view of the atonement might be.\n\nThe following is a broad sample of different views advocated by various scholars:\n* E. P. Sanders argued that Paul's central idea was that we mystically spiritually participate in the risen Christ and that all Paul's judicial language was subordinate to the participationary language.<ref name=\"P. Sanders, 1977\"/>\n* N. T. Wright has argued that Paul sees Israel as representative of humanity and taking onto itself the sinfulness of humanity through history. Jesus, in turn, as Messiah is representative of Israel and so focuses the sins of Israel on himself on the cross. Wright's view is thus a \"historicized\" form of Penal Substitution.<ref>N. T. Wright, \"Jesus and the Victory of God\"{{Page needed|date=December 2011}}</ref>\n* Chris VanLandingham has argued that Paul sees Christ as having defeated the Devil and as teaching humans how God wants them to live and setting them an example.<ref>Chris VanLandingham, \"Judgment and Justification in Early Judaism and the Apostle Paul\", Hendrickson 2006{{Page needed|date=December 2011}}</ref>\n* David Brondos has argued that Paul sees Jesus as just a part in a wider narrative in which the Church is working to transform lives of individuals and the world, and that Paul's participatory language should be understood in an ethical sense (humans living Christ-like lives) rather than mystically as Sanders thought.<ref>David Brondos, \"Paul on the Cross: Reconstructing the Apostle's Story of Redemption\", Fortress Press, 2006{{Page needed|date=December 2011}}</ref>\n* Pilch and Malina take the view that Paul holds to the [[Satisfaction theory of atonement|Satisfaction theory of atonement]].<ref>Bruce J. Malina and John J. Pilch, \"Social-Science Commentary on the Letters of Paul\" Augsburg Fortress 2006{{Page needed|date=December 2011}}</ref>\n* Stephen Finlan holds that Paul uses numerous different metaphors to describe the atonement; “justified by his blood” (Rom 5:9) means that a cultic substance has a judicial effect. Paul also taught the transformation of believers into the image of God through Christ ([[Divinization (Christian)|Theosis]]).<ref>Stephen Finlan, Problems with Atonement: The Origins of, and Controversy about, the Atonement Doctrine, Liturgical Press 2005, pp. 58–59, 120–23.</ref>\n\n== Criticism ==\nThe \"new\" perspective has been an extremely controversial subject and has drawn strong arguments and recriminations from both sides of the debate.<ref>{{cite web|url=http://www.christianitytoday.com/ct/2007/august/13.22.html|title=What Did Paul Really Mean? - Christianity Today|author=Simon Gathercole|work=ChristianityToday.com}}</ref>\n\nIn 2003 [[Steve Chalke]], after being influenced by new-perspective writers, published a book targeted at a popular audience which made comments highly critical of the [[penal substitution]] theory of the atonement.<ref>{{Citation | first1 = Steve | last1 = Chalke | first2 = Alan | last2 = Mann | title = The Lost Message of Jesus | publisher = Zondervan | year = 2003}}.{{Page needed|date=December 2011}}</ref> This caused an extensive and ongoing controversy among Evangelicals in Britain, with a strong backlash from laypeople and advocates of the [[Lutheran]] and [[Calvinism|Reformed]] traditions.<ref>Ashworth, Pat. \"Atonement row gets personal as Evangelical partnership splits\", 'Church Times', 27 April 2007.</ref> Chalke's views drew much support as well as criticism, with numerous articles, blogs and books being written on both sides of the debate.\n\nThe continuing controversy led to the [[Evangelical Alliance]] organising a symposium in July 2005 to discuss the issue. A record of this symposium includes a chapter by Chalke and his views are also contained in \"the atonement debate\".<ref>{{cite book | last = Derek Tidball, David Hilborn, | first = Justin Thacker | title = the atonement debate | page = 34 to 45 }}</ref><ref>{{cite web |url = http://www.eauk.org/media/joint-evangelical-alliance-london-school.cfm |title = Joint Evangelical Alliance&nbsp;– London School Of Theology Atonement Symposium |accessdate = 2007-08-26 |date = 2005-07-08 |publisher = [[Evangelical Alliance]] }}</ref><ref>{{cite news |last = Stephen |first = Jonathan |url = http://www.evangelical-times.org/archive/item/950/Biblical-theological/Chalkegate/ |title = Chalkegate |accessdate = 2011-11-25 |date = February 2005 |publisher = [[Evangelical Times]] }}</ref> A group of three [[Conservative Evangelicalism|conservative evangelical]] theologians responded to Chalke with their book, ''Pierced for our Transgressions'' (Crossway Publishing, 2007), which strongly criticised Chalke's position as inconsistent with some evangelical confessions of faith.<ref>{{cite book | last = Jeffery | first = Steve |author2=Mike Ovey |authorlink2=Mike Ovey |author3=Andrew Sach | isbn = 1-84474-178-8 | publisher = [[Inter-Varsity Press]] | title = Pierced for our Transgressions&nbsp;– Rediscovering the Glory of Penal Substitution }}</ref><ref>{{cite web | url = http://www.piercedforourtransgressions.com | title = Pierced for our Transgressions&nbsp;– Rediscovering the Glory of Penal Substitution | accessdate = 2007-08-26 }}</ref> However, [[N. T. Wright]] endorsed Chalke and spoke out against the latter book, commenting, for instance, that ‘despite the ringing endorsements of famous men, it [''Pierced For Our Transgressions''] is deeply, profoundly, and disturbingly unbiblical.’<ref>{{cite news |last = Wright |first = NT |authorlink = N. T. Wright |date = April 2007 |url = http://www.fulcrum-anglican.org.uk/articles/the-cross-and-the-caricatures/ |title = The Cross and the Caricatures&nbsp;– a response to Robert Jenson, Jeffrey John, and a new volume entitled Pierced for Our Transgressions | publisher = Fulcrum |accessdate = 2014-08-19 }}</ref>\n\nBoth sides of the debate have attempted to claim the higher, and more accurate, view of scripture. New-perspective advocates claim that supporters of the historic Lutheran and Reformed perspective are too committed to historic [[Protestant Reformation|Protestant]] tradition, and therefore fail to take a \"natural\" reading of the Bible; while those of the Lutheran and Reformed perspectives claim that new-perspective advocates are too intrigued by certain interpretations of context and history, which then lead to a biased hermeneutical approach to the text.{{Citation needed |date=August 2015}}\n\nThe \"new\" perspective has been heavily criticized by conservative scholars in the Reformed tradition, arguing that it undermines the classical, individualistic, Augustinian interpretation of election and does not faithfully reflect the teachings of the Scriptures. It has been the subject of fierce debate among Evangelicals in recent years, mainly due to N. T. Wright's increasing popularity in [[evangelicalism|evangelical]] circles. Its most outspoken critics include Calvinists [[John Piper (theologian)|John Piper]],<ref>John Piper, [http://www.desiringgod.org/resource-library/interviews/interview-with-john-piper-about-the-future-of-justification-a-response-to-n-t-wright Interview with Piper on Wright], October 11, 2007.</ref> [[Sinclair Ferguson]],<ref>Sinclair Ferguson, [http://www.ligonier.org/learn/articles/what-does-justification-have-do-gospel/ What Does Justification Have to do with the Gospel?]</ref><ref>Ligon Duncan and Sinclair Ferguson (video resource) [http://www.ligonier.org/learn/media/wright-teaching-another-gospel/ Is Wright Teaching Another Gospel?]</ref> C. W. Powell,<ref>C. W. Powell, ''[http://basketoffigs.org/NewPerspectives/Jewlegalism.htm Was There Legalism in First Century Judaism]''</ref> [[Mark A. Seifrid]], [[D. A. Carson]],<ref>D. A. Carson [http://www.theologian.org.uk/doctrine/carsonnewperspective.html Don Carson on the New Perspective], MP3 file of lecture</ref> [[Tom Holland (theologian)|Tom Holland]],<ref>Tom Holland [http://www.tomholland.org.uk/contours-of-pauline-theology/ Contours of Pauline Theology]</ref> [[Ligon Duncan]].<ref>J. Ligon Duncan, ''[http://www.alliancenet.org/partner/Article_Display_Page/0,,PTID307086%7CCHID560462%7CCIID1660662,00.html The Attractions of the New Perspective(s) on Paul].</ref> Barry D. Smith has claimed that the New Perspective's challenge to the traditional view of Jewish faith practice as [[legalism (theology)|legalistic]] is misplaced.<ref>Barry D. Smith, ''The Tension Between God as Righteous Judge and as Merciful in Early Judaism''; id., ''What Must I Do to Be Saved? Paul Parts Company with His Jewish Heritage''.</ref>\n\nIn 2015 [[John M.G. Barclay]] published ''Paul and the Gift'' which re-frames Paul's theology of grace and, in doing so, provides a nuanced critique of the New Perspective.<ref>{{Cite web|url=http://www.eerdmans.com/Products/6889/paul-and-the-gift.aspx|title=Paul and the Gift - John M. G. Barclay : Eerdmans|website=www.eerdmans.com|access-date=2016-08-31|deadurl=yes|archiveurl=https://web.archive.org/web/20160829034205/http://www.eerdmans.com/Products/6889/paul-and-the-gift.aspx|archivedate=2016-08-29|df=}}</ref> The book has been praised for keeping grace at the center of Paul's theology (''pace'' the New Perspective) while illuminating how grace, understood in light of ancient theories of gift, demands reciprocity and thus the formation of new communities based not on ethnicity but the unqualified Christ-gift (much like the New Perspective).<ref>{{Cite web|url=http://thinktheology.co.uk/blog/article/paul_and_the_gift_i|title=Paul and the Gift: Prologue|website=What You Think Matters|access-date=2016-08-31}}</ref><ref>{{Cite web|url=http://themelios.thegospelcoalition.org/article/john-barclays-paul-and-the-gift-and-the-new-perspective-on-paul|title=John Barclay’s Paul and the Gift and the New Perspective on Paul|website=Themelios from The Gospel Coalition|access-date=2016-08-31}}</ref>\n\n== Catholic and Orthodox reactions ==\nThe \"new\" perspective has, by and large, been an internal debate among Protestant scholars. [[Roman Catholic]] and [[Eastern Orthodox]] writers have generally responded favorably to new-perspective ideas,<ref>Despotis, A., Die „New Perspective on Paul“ und die griechisch-orthodoxe Paulusinterpretation, [VIOTh 11], St. Ottilien: EOS-Verlag 2014, {{ISBN|978-3-8306-7705-5}}</ref> seeing both a greater commonality with their own beliefs and strong similarities with the views of many of the early [[Church Fathers]]. From a Catholic point of view, the \"new\" perspective is seen as a step toward the progressive reality of human salvation in Christ. Moreover, passages in the works of many early Church Fathers show that new-perspective-style interpretations were widely held among them.<ref>Irenaeus, \"Against Heresy\" 4:13–16. Ambrosiaster, \"Commentary on Romans\". Pelagius, \"Commentary on Romans\". Origen \"Commentary on Romans\". Justin Martyr, \"Dialogue\" Ch 10–11. Clement of Alexandria, \"Stromata\" 6:6. Ignatius, \"Magnesians\" 8. Cyril of Jerusalem, \"Catechetical Lectures\" 4:33.{{Synthesis inline|date=December 2011}}</ref>\n\nOne of the many exceptions is the influential [[Augustine of Hippo]]. While most in the Roman Catholic and Eastern Orthodox schools would see him as espousing a view of grace and justification in keeping with this \"new\" perspective, Augustine is blamed by some for introducing incorrect ideas{{Citation needed|date=June 2011}}. Some Orthodox have long criticized Augustine's soteriology, claiming it introduced novelties into Christian tradition.<ref>Fr. John Romanides, The Ancestral Sin, Zephyr Publishing, Ridgewood, NJ, 1998, passim</ref>\n\nThe increased importance new-perspective writers have given to good works in salvation has created strong common ground with the Roman Catholic and Eastern Orthodox churches. Historic [[Protestantism]] has never denied that there is a place for good and faithful works, but has always excluded them from [[Justification (theology)|justification]] and salvation, which Protestants argue is through [[faith alone]], and in which good deeds are of no account, whether with or without God's grace.<ref>{{cite web|title=Augsburg Confession|url=http://bookofconcord.org/augsburgconfession.php#article20|work=Book of Concord|accessdate=8 September 2012|location=Article 20|quote=[..]Furthermore, it is taught on our part that it is necessary to do good works, not that we should trust to merit grace by them, but because it is the will of God. It is only by faith that forgiveness of sins is apprehended, and that, for nothing. And because through faith the Holy Ghost is received, hearts are renewed and endowed with new affections, so as to be able to bring forth good works. For Ambrose says: Faith is the mother of a good will and right doing. For man's powers without the Holy Ghost are full of ungodly affections, and are too weak to do works which are good in God's sight. Besides, they are in the power of the devil who impels men to divers sins, to ungodly opinions, to open crimes. This we may see in the philosophers, who, although they endeavored to live an honest life could not succeed, but were defiled with many open crimes. Such is the feebleness of man when he is without faith and without the Holy Ghost, and governs himself only by human strength. Hence it may be readily seen that this doctrine is not to be charged with prohibiting good works, but rather the more to be commended, because it shows how we are enabled to do good works.[..]}}</ref><ref>{{cite web|last=Calvin|first=John|title=Commentary on James|url=http://www.ccel.org/ccel/calvin/calcom45.vi.iii.vi.html|work=Commentary on the Catholic Epistles|accessdate=8 September 2012|authorlink=John Calvin|location=James 2:18-19|quote=[..]This only he means, that faith, without the evidence of good works, is vainly pretended, because fruit ever comes from the living root of a good tree.[..]}}</ref> This has, since the [[Protestant Reformation|Reformation]], been a line of distinction between Protestantism (both [[Reformed]]<ref>{{cite web|title=Canons of Dort|url=http://www.spurgeon.org/~phil/creeds/dort.htm|accessdate=9 September 2012|location=FIRST HEAD: PARAGRAPH 3.|quote=Rejections of errors[..][of those W]ho teach: That the good pleasure and purpose of God, of which Scripture makes mention in the doctrine of election, does not consist in this, that God chose certain persons rather than others, but in this, that He chose out of all possible conditions (among which are also the works of the law), or out of the whole order of things, that act of faith which from its very nature is undeserving, as well as it incomplete obedience, as a condition of salvation, and that He would graciously consider this in itself as a complete obedience and count it worthy of the reward of eternal life. For by this injurious error the pleasure of God and the merits of Christ are made of none effect, and men are drawn away by useless questions from the truth of gracious justification and from the simplicity of Scripture, and this declaration of the apostle is charged as untrue: \"who has saved us and called us to a holy life, not because of anything we have done but because of his own purpose and grace. This grace was given us in Christ Jesus before the beginning of time (2 Tim 1:9).\"|deadurl=yes|archiveurl=https://web.archive.org/web/20120919133747/http://www.spurgeon.org/~phil/creeds/dort.htm|archivedate=19 September 2012|df=}}</ref> and [[Lutheran]]<ref>{{cite web|title=Augsburg Confession|url=http://bookofconcord.org/augsburgconfession.php#article12|work=Book of Concord|accessdate=8 September 2012|location=Article XII|quote=They also are rejected who do not teach that remission of sins comes through faith but command us to merit grace through satisfactions of our own.}}</ref>) and other Christian communions.\n\n==See also==\n{{Portal|Christianity}}\n*[[Pauline Christianity]]\n*[[Martin Luther]]\n*[[John Calvin]]\n*[[Joint Declaration on the Doctrine of Justification]]\n\n==References==\n{{Reflist|2}}\n\n==Further reading==\n*Gosdeck, David, [http://www.wlsessays.net/files/GosdeckNTWright.pdf ''Nicholas Thomas Wright - New Perspective on St. Paul''], 2013\n*Badenas, Robert, ''Christ the End of the Law, Romans 10.4 in Pauline Perspective'', 1985. {{ISBN|0-905774-93-0}}\n*Despotis, Athanasios, Die „New Perspective on Paul“ und die griechisch-orthodoxe Paulusinterpretation, [VIOTh 11], St. Ottilien: EOS-Verlag 2014, {{ISBN|978-3-8306-7705-5}}\n*Despotis, Athanasios, Participation, Justification and Conversion: Eastern Orthodox Interpretation of Paul and the Debate between Old and New Perspectives on Paul (in collaboration), [WUNT II 442], Tübingen: Mohr Siebeck 2017\n*[[James D. G. Dunn|Dunn, James D. G.]], \"The New Perspective on Paul\", in: ''Jesus, Paul and the Law'', 1990. {{ISBN|0-664-25095-5}}\n*[[Simon J. Gathercole|Gathercole, Simon J.]], ''Where Is Boasting? Early Jewish Soteriology and Paul's Response in Romans 1–5'', 2002. {{ISBN|0-8028-3991-6}}\n*Irons, Lee, ''[http://www.upper-register.com/papers/kim_critique_npp.pdf Seyoon Kim’s Critique of the New Perspective on Paul]'', 2007.\n*[[Yung Suk Kim|Kim, Yung Suk.]] ''Christ's Body in Corinth: The Politics of a Metaphor'' 2008 {{ISBN|0-8006-6285-7}}\n*[[Yung Suk Kim|Kim, Yung Suk.]] ''A Theological Introduction to Paul's Letters: Exploring a Threefold Theology of Paul'' 2011 {{ISBN|978-1-60899-793-0}}\n*Marshall, Taylor R. ''[[The Catholic Perspective on Paul]]'', 2010.\n*Smith, Barry D., ''What Must I Do to Be Saved? Paul Parts Company with His Jewish Heritage'', 2007.\n*Thompson, Michael B., ''[http://www.grovebooks.co.uk/cart.php?target=product&product_id=16248&category_id= The New Perspective on Paul]'' (Grove Biblical Series), 2002. {{ISBN|1-85174-518-1}}.\n*Wright, N. T., ''What St Paul Really Said'', 1997.\n*Wright, N. T., ''[http://www.ntwrightpage.com/Wright_New_Perspectives.htm New Perspectives on Paul]'', 2003.\n*Wright, N. T., ''Paul: Fresh Perspectives'', 2005.\n*Yinger, Kent L., ''The New Perspective on Paul: An Introduction'', (Cascade Books), 2010 {{ISBN|978-1608994632}}\n*Young, Brad, ''Paul the Jewish Theologian'', 1998\n*Kok, Jacobus., ''The New Perspectives on Paul and its implication for ethics and mission'', Acta Patristica, vol 21, 2010, pp.&nbsp;3–17\n\n==External links==\n{{wiktionary|πίστις}}\n*[http://www.thepaulpage.com/ The Paul Page]—Extensive list of online articles relating to the New Perspective\n*[http://www.galatians-paul-the-torah-law-legalism.info/ Galatians, Paul, the Torah-Law and Legalism]\n*[http://www.theopedia.com/New_Perspective_on_Paul Theopedia: New Perspective on Paul]—Traditional Reformed perspective\n*[http://www.opc.org/GA/justification.pdf Report on Justification Presented to the 73rd General Assembly] ([[Orthodox Presbyterian Church]])\n*[http://webzoom.freewebs.com/msvp/msvpadhoc.pdf Mississippi Valley Presbytery Report] ([[Presbyterian Church in America]])\n*[http://pauliscatholic.com Catholic Perspective on Paul]—A Catholic analysis of topics pertaining to the New Perspective on Paul\n*[https://web.archive.org/web/20120405074630/http://arkiv.lbk.cc/faq/site.pl@1518cutopic_topicid40cuitem_itemid5335.htm WELS Topical Q&A: New Perspective on Paul]—A Confessional Lutheran evaluation of the New Perspective\n\n{{DEFAULTSORT:New Perspective On Paul}}\n[[Category:Paul the Apostle]]\n[[Category:Biblical studies]]\n[[Category:New Testament theology]]\n[[Category:Bible-related controversies]]\n[[Category:Christian terminology]]\n[[Category:Mosaic law in Christian theology]]",
            "slug": "new-perspective-on-paul",
            "date_updated": 1537255797389,
            "imported": "https://en.wikipedia.org/wiki/New_Perspective_on_Paul"
        }
    ]
}