{
    "article": [
        {
            "title": "Sabbath",
            "text": "{{About|rest or worship time}}\n[[File:Book_of_Exodus_Chapter_21-1_(Bible_Illustrations_by_Sweet_Media).jpg|thumbnail|[[Moses]] and the 10 Commandments, Jim Padgett]]\n'''Sabbath''' ({{IPAc-en|ˈ|s|æ|b|ə|θ}}) ({{Lang-he|שַׁבָּת}}) is a day set aside for rest and worship. According to the [[Book of Exodus]] the Sabbath is a day of rest on the seventh day, [[Ten Commandments|commanded]] by [[God]] to be kept as a [[Holiday|holy day]] of rest, as God rested from [[Genesis creation narrative|creation]].<ref>http://www.dictionary.com/browse/sabbath</ref> It is observed differently among the [[Abrahamic religions]] and informs a similar occasion in several other practices. Although many viewpoints and definitions have arisen over the millennia, most originate in the same textual tradition of: \"[[Remember the sabbath day, to keep it holy]]\".\n\nThe term has been used to describe a similar weekly observance in any of several other traditions; the first crescent or [[new moon]]; any of seven annual festivals in Judaism and some [[Christian]] traditions; any of eight annual [[pagan]] festivals (usually \"[[Wheel of the Year|sabbat]]\"); an annual secular holiday; and a year of rest in religious or secular usage, the [[sabbath year]], originally every seventh year.\n\n==Biblical Sabbath==\n{{details|Biblical Sabbath}}\n[[File:Tissot The Sabbath-Breaker Stoned.jpg|thumb|''The Sabbath-Breaker Stoned'' (watercolor circa 1896–1902 by [[James Tissot]])]]\n[[Biblical Sabbath|Sabbath]] (as the verb שָׁבַת֙ ''šāḇaṯ'') is first mentioned in the [[Genesis creation narrative]], where the seventh day is set aside as a day of rest (in Hebrew, ''shabbath''), and made holy by [[God]] ({{Bibleverse||Genesis|2:2–3|KJV}}). Observation and remembrance of Sabbath ({{Lang-he|שַׁבָּת}} ''šabbaṯ'') is one of the [[Ten Commandments]] (the fourth in the original [[Jewish]], the [[Eastern Orthodox]], and most [[Protestant]] traditions, the third in [[Roman Catholic]] and [[Lutheran]] traditions). Most people who observe the Sabbath regard it as having been instituted as a perpetual [[covenant (Biblical)|covenant]] for the [[Israelites]] ({{Bibleverse||Exodus|31:13–17|KJV}}), as a sign respecting two events: the day during which God rested after having completed [[Genesis creation narrative|Creation]] in six days ({{Bibleverse||Exodus|20:8–11|KJV}}), and the Israelites' [[The Exodus|deliverance from Egypt]] ({{Bibleverse||Deuteronomy|5:12–15|KJV}}). The different Sabbaths were to be revered as a shadow of the Christ who was to come (Colossians 2:16–17) who would give mankind rest from their labors in trying to make themselves acceptable before God. For if we rest in the work of Christ on the cross, then we can cease from our own works or self efforts in trying to make ourselves acceptable before God (Hebrews: 4:9–11), however the weekly Sabbath was still to be kept even after Jesus' ascension (Matthew 24:20). Originally, [[Sabbath breaking|Sabbath-breakers]] were officially to be [[List of capital crimes in the Torah#Religious practices|cut off from the assembly or potentially killed]] ({{Bibleverse||Exodus|31:15|KJV}}). Observance in the [[Hebrew Bible]] was universally from [[Day#Boundaries of the day|sixth-day sundown]] to seventh-day sundown ({{Bibleverse||Nehemiah|13:19|KJV}}, cf. {{Bibleverse||Leviticus|23:32|KJV}}),<ref>{{cite web|title=cev bible, search keyword 'like sabbath'|url=https://www.biblegateway.com/quicksearch/?quicksearch=like+sabbath&qs_version=CEV}}</ref> on a [[seven-day week]]. Consultations with prophets (II Kings iv. 23) were sought on the Sabbath.<ref>Emil G. Hirsch, Joseph Jacobs, Executive Committee of the Editorial Board., Julius H. Greenstone. (1905). \"Sabbath\". Jewish Encyclopaedia : a descr. record of the history, religion, literature, and customs of the Jewish people from the earliest times to the present day. New York : Funk & Wagnall, p. 587. Retrieved 13 May 2016. [http://d2b4hhdj1xs9hu.cloudfront.net/I1LL587Q.jpg JewishEncyclopedia.com]</ref> Sabbath corporate worship was not prescribed for the community at large and the Sabbath activities at the shrines were originally a convocation of priests for the purpose of offering divine sacrifices with family worship and rest being centered in homes.<ref>Fruchtenbaum, Arnold G. (2001). Israelology: the missing link in systematic theology. Tustin, Calif.: Ariel Ministries. pp. 595–601. {{ISBN|0914863053}}</ref><ref>Goldberg, Louis A. (1980). Leviticus: A Study Guide Commentary. Grand Rapids:Zondervan Publishing House. p. 116. {{ISBN|9780310418139}}</ref> \n\n===Seven-day week===\n{{Main article|Seven-day week}}\nBy [[synecdoche]] (naming the whole for a part), in Jewish sources by the time of the [[Septuagint]], the term \"Sabbath\" ([[Greek language|Greek]] ''Sabbaton'', Strong's ''4521'') also came to mean an entire \"[[se'nnight]]\" or seven-day week, the interval between two weekly Sabbaths. [[Jesus]]'s [[parable]] of the [[Pharisee and the Publican]] ({{Bibleverse||Luke|18:9–14|KJV}}) describes the [[Pharisee]] as fasting \"twice a week\" ([[Greek language|Greek]] ''dis tou sabbatou'', literally, \"Twice of the Sabbath\").\n\n===High Sabbaths===\n{{Main article|High Sabbaths}}\n\"High Sabbaths\" are observed by Jews and some Christians. Seven annual Biblical festivals, called ''miqra'' (\"called assembly\") in Hebrew and \"High Sabbath\" in English and serving as supplemental testimonies to Sabbath, are specified in the books of [[Book of Exodus|Exodus]] and [[Deuteronomy]]; they do not necessarily fall on weekly Sabbath. Three occur in spring: the first and seventh days of [[Pesach]] ([[Passover (Christian holiday)|Passover]]), and [[Shavuot]] ([[Pentecost]]). Four occur in fall, in the seventh month, and are also called ''Shabbaton'': [[Rosh Hashanah]] ([[Feast of Trumpets (Christian holiday)|Trumpets]]); [[Yom Kippur]], \"Sabbath of Sabbaths\" ([[Christian observances of Yom Kippur|Atonement]]); and the first and eighth days of [[Sukkoth]] ([[Christian observances of Jewish holidays#Feast of Tabernacles|Tabernacles]]). \"High Sabbaths\" is also often a synonym of \"[[High Holy Days]]\", viz., Rosh Hashanah and Yom Kippur.\n\n===Shmita (Sabbath)===\n{{details|Shmita}}\n''Shmita'' ({{lang-he|שמטה}}, Strong's 8059 as ''sh<sup>e</sup>mittah'', literally \"release\"), also called sabbatical year, is the seventh (שביעי, Strong's 7637 as ''sh<sup>e</sup>biy'iy'') year of the seven-year agricultural cycle mandated by [[Torah]] for the [[Land of Israel]], relatively little observed in Biblical tradition, but still observed in contemporary [[Judaism]]. During ''Shmita'', the land is left to lie [[fallow]] and all agricultural activity, including plowing, planting, pruning and harvesting, is forbidden by Torah and [[halakha|Jewish law]]. By tradition, other cultivation techniques (such as watering, fertilizing, weeding, spraying, trimming and mowing) may be performed as preventative measures only, not to improve the growth of trees or plants; additionally, whatever fruits grow of their own accord during that year are deemed ''hefker'' (ownerless), not for the landowner but for the poor, the stranger, and the beasts of the field; these fruits may be picked by anyone. A variety of laws also apply to the sale, consumption and disposal of ''Shmita'' produce. When the year ended, all debts, except those of foreigners, were to be remitted ({{Bibleverse||Deuteronomy|15:1–11|KJV}}); in similar fashion, Torah requires a slave who had worked for six years to go free in the seventh year. [[Leviticus]] 25 promises bountiful harvests to those who observe ''Shmita'', and describes its observance as a test of religious faith. The term ''Shmita'' is translated \"release\" five times in the [[Book of Deuteronomy]] (from the root שמט, ''shamat'', \"''desist'', ''remit''\", 8058).\n\n==Judaism==\n\n===Shabbat===\n{{Main article|Shabbat}}\n{{see also|Hebrew calendar}}\nJewish ''Shabbat'' (''Shabbath'', ''Shabbes'', ''Shobos'', etc.) is a weekly day of rest, observed from sundown on Friday until the appearance of three stars in the sky on Saturday night. It is also observed by a minority of Christians, such as adherents of [[Messianic Judaism]] and [[Seventh-day Adventist]]s. [[Activities prohibited on Shabbat|Thirty-nine activities prohibited on ''Shabbat'']] are listed in Tractate ''[[Shabbat (Talmud)|Shabbat]]'' ([[Talmud]]). Customarily, ''Shabbat'' is ushered in by lighting [[candle]]s shortly before sunset, at [[halakhic]]ally calculated times that change weekly and geographically. ''The Dead Sea Scrolls Uncovered'', a translation by [[Robert Eisenman]] and Michael Wise, reveals the [[Essenes|Essene]] calendar as celebrating the Sabbath commencing on the 4th day of Abib (Nisan) page 192 3 days after the new moon of the Passover month then celebrated on the 11th, 18th and 25th. The second Essene month reveals a Sabbath on the second day exactly 7 days from the 25th of Abib Sabbath witnessing a solar calendar continuation for the rest of the year. The Essenes did it this way to be in harmony with the book of Genesis where God created the moon and sun on the 4th day and rested 3 days later.\n\n[[Judah ha-Levi]] (12th century) proposed a nascent Jewish [[date line]] for dating of ''Shabbat'', later calculated to fall between [[China]] and [[Japan]] (other lines exist, and travelers are expected to note both personal and local ''Shabbat''); and [[Anarchism and Orthodox Judaism|Pinchas Elijah Horovitz]] (18th century) stated that polar regions should observe ''Shabbat'' based on calculating 24-hour days, although without establishing a date line.\n\n''Shabbat'' is a widely noted hallmark of Jewish peoples. [[Subbotniks]] (literally, Sabbatarians) are a Russian sect, categorized as either Jews or [[Judaizers|Judaizing]] Christians, that became particularly branded by strict ''Shabbat'' observance; (Hungarian-born radical [[Reform Judaism|Reform]] leader Ignaz Einhorn even shifted his congregation's ''Shabbat'' worship to Sundays.) Several weekly ''Shabbat''s per year are designated as [[Special Sabbaths]], such as ''Shabbat haGadol'', prior to [[Pesach]] (literally, \"the High Sabbath\", but not to be confused with other [[High Sabbaths]]); and ''Shabbat Teshuvah'', prior to [[Yom Kippur]] (\"Repentance Sabbath\").\n\n===Shabbaton===\n{{Main article|Shabbaton}}\nColloquially, in contemporary Israel, the term ''Shabbaton'' or ''Shaboson'' means an event or program of education and usually celebration held on ''[[Shabbat]]'', or over an entire [[weekend]] with main focus on ''Shabbat''. Such events are held by youth groups, singles groups, synagogues, schools, social groups, charitable groups or family reunions, can be either multi-generational and wide-open or limited-group, and can be held where a group usually meets or offsite. \"''Shabbaton''\", rather than just \"[[Retreat (spiritual)|retreat]]\", signifies recognition of the importance of ''Shabbat'' in the event or program.{{Citation Needed|date=June 2018}}\n\n==Christianity==\n{{Main article|Sabbath in Christianity}}\n{{See also|Gregorian calendar}}\nIn [[Eastern Christianity]], the Sabbath is considered still to be on [[Saturday]], the seventh day, in remembrance of the Hebrew Sabbath. In [[Catholic Church|Catholicism]] and most sects of Protestantism, the \"[[Lord's Day]]\" (Greek Κυριακή) is considered to be on Sunday, the first day (and \"eighth day\"). Communal worship, including the Holy Mysteries, may take place on any day, but a weekly observance of the resurrection is made consistently on Sunday. [[Western Christianity]] sometimes refers to the Lord's Day as a \"Christian Sabbath\", distinct from the Hebrew Sabbath, but related in varying manner.\n\n===First-day===\n{{details|Puritan Sabbath}}\nSince [[Puritan]] times, most English-speaking [[Protestant]]s identify the \"[[Lord's Day]]\" (viz., Sunday) with a \"[[Sunday Sabbath|Christian Sabbath]]\", a term [[Roman Catholic]]s in those areas may also celebrate with the [[Eucharist]].  It is considered both the first day and the \"eighth day\" of the seven-day week. Members of [[The Church of Jesus Christ of Latter-day Saints]] generally follow the stronger of first-day Christian Sabbatarian traditions, avoiding shopping, leisure activities, and work unless absolutely necessary. In [[Tonga]], all commerce and entertainment activities cease on Sunday, starting at midnight and ending the next day, at midnight, as Tonga's constitution declares the Sabbath sacred forever.<ref>{{cite web |title=Constitution of Tonga |url=https://www.parliament.gov.to/parliamentary-business/documents/constitution-of-tonga/file/115-constitution-of-tonga-revised-1988 |website=Parliament of Tonga |accessdate=20 August 2018}}</ref>  In [[Oriental Orthodoxy]], the [[Ethiopian Orthodox Tewahedo Church]] has observed both Sunday Resurrection Day and [[Saturday Sabbath]] in different ways for several centuries, as have other [[Eastern Orthodox]] traditions.\n\n[[Puritan]] Sabbatarianism or [[Reformed]] Sabbatarianism is strict observance of [[Sabbath in Christianity]] that is typically characterized by its avoidance of [[leisure|recreational]] activities. \"Puritan Sabbath\", expressed in the ''[[Westminster Confession of Faith]]'', is often contrasted with \"[[Continental Europe|Continental]] Sabbath\": the latter follows the Continental [[Reformed Christian confessions of faith|Reformed confessions]] such as the ''[[Heidelberg Catechism]]'', which emphasize rest and [[worship]] on [[Lord's Day]], but do not forbid recreational activities.\n\n===Seventh-day===\n{{Main article|Sabbath in seventh-day churches}}\nSeveral Christian denominations observe Sabbath in a similar manner to Judaism, though with observance ending at Saturday sunset instead of Saturday nightfall. Early church historians [[Sozomen]] and [[Socrates of Constantinople|Socrates]] cite the seventh day as the Christian day of worship except for the Christians in Rome and Alexandria. Many Sabbatarian Judeo-Christian groups were attested during the Middle Ages; the [[Szekler Sabbatarians]] were founded in 1588 from among the [[Unitarian Church of Transylvania]] and maintained a presence until the group converted to Judaism in the 1870s. [[Seventh Day Baptist]]s have observed Sabbath on Saturday since the mid-17th century (either from sundown or from midnight), and influenced the (now more numerous) [[Seventh-day Adventists]] in America to begin the practice in the mid-19th century. They believe that keeping [[seventh-day Sabbath]] is a moral responsibility equal to that of any of the other [[Ten Commandments]], based on the example of [[Jesus]]. They also use \"Lord's Day\" to mean the seventh day, based on Scriptures in which God calls the day \"my Sabbath\" ({{Bibleverse||Exodus|31:13|KJV}}) and \"to the {{LORD}}\" ({{Bibleverse||Exodus|16:23|KJV}}) and in which Jesus calls himself \"Lord of Sabbath\" ({{Bibleverse||Matthew|12:8|KJV}}). The question of defining Sabbath worldwide on a round earth was resolved by some [[seventh-day Sabbatarian]]s by making use of the [[International Date Line]] (i.e., permitting local rest-day adjustment, {{Bibleverse||Esther|9:16–19|KJV}}), while others (such as some [[Alaska]]n Sabbatarians) keep Sabbath according to [[Jerusalem]] time (i.e., rejecting manmade temporal customs, {{Bibleverse||Daniel|7:25|KJV}}). Many of the [[Lemba people|Lemba]] in [[southern Africa]], like some other African tribes, are Christians and claim [[African Jews|common descent]] from the Biblical [[Israelites]], keep one day a week holy like Sabbath, and maintain many beliefs and practices associated with Judaism.\n\n===Seventh-day versus First-day===\n{{Main article|Sabbath in Christianity|Sabbath in seventh-day churches}}\n\nIn 321 AD, Roman emperor [[Constantine the Great]] enacted the first civil law regarding Sunday observance. The law did not mention the Sabbath by name, but referred to a day of rest on \"the venerable day of the sun.\"\n{{quote|On the venerable day of the sun let the magistrate and people residing in cities rest, and let all workshops be closed. In the country however, persons engaged in agricultural work may freely and lawfully continue their pursuits; because it often happens that another day is not so suitable for grain growing or for vine planting; lest by neglecting the proper moment for such operations the bounty of heaven should be lost.<ref>Schaff’s History of the Christian Church, vol. III, chap. 75.</ref>}}\n\nAn Abridgment of the Christian Doctrine: \n:Q. How prove you that the church hath power to command feasts and holy days?\n:A. By the very act of changing the Sabbath into Sunday, which Protestants allow of; and therefore they fondly contradict themselves, by keeping Sunday strictly, and breaking most other feasts commanded by the same church.\n:Q. How prove you that?\n:A. Because by keeping Sunday, they acknowledge the church’s power to ordain feasts, and to command them under sin; and by not keeping the rest [of the feasts] by her commanded, they again deny, in fact, the same power.<ref>Rev. Henry Tuberville, D.D. (R.C.), (1833), An Abridgment of the Christian Doctrine. p. 58.</ref>\n\nThe Augsburg Confession:\n:They [the Catholics] allege the Sabbath changed into Sunday, the Lord’s day, contrary to the decalogue, as it appears; neither is there any example more boasted of than the changing of the Sabbath day. Great, they say, is the power and authority of the church, since it dispensed with one of the ten commandments.<ref>Art. 28. Augsburg Confession.</ref>\n\nA Doctrinal Catechism,\n:Q. Have you any other way of proving that the Church has power to institute festivals of precept?\n:A. Had she not such power, she could not have done that in which all modern religionists agree with her. She could not have substituted the observance of Sunday the first day of the week, for the observance of Saturday the seventh day, a change for which there is no Scriptural authority.<ref>Rev. Stephen Keenan, (1851), A Doctrinal Catechism. p. 174.</ref>\n\nCatholic Christian:\n:Q. Has the [Catholic] church power to make any alterations in the commandments of God?\n:A. ...Instead of the seventh day, and other festivals appointed by the old law, the church has prescribed the Sundays and holy days to be set apart for God’s worship; and these we are now obliged to keep in consequence of God’s commandment, instead of the ancient Sabbath.<ref>The Catholic Christian Instructed in the Sacraments, Sacrifices, Ceremonies, and Observances of the Church By Way of Question and Answer, RT Rev. Dr. Challoner, p. 204.</ref>\n\nThe Catechism of the Council of Trent:\n:The Church of God has thought it well to transfer the celebration and observance of the Sabbath to Sunday!<ref>Catechism of the Council of Trent. p. 402, second revised edition (English), 1937.  (First published in 1566)</ref>\n\n===New moon===\n{{See also|New moon}}\nThe new moon, occurring every 29 or 30 days, is an important separately sanctioned occasion in Judaism and some other faiths. It is not widely regarded as Sabbath, but some [[Hebrew Roots|messianic]] and [[Pentecostal]] churches,{{cn|date=September 2018}} such as the native New Israelites of Peru and the [[Creation Seventh Day Adventist Church]], do keep the day of the new moon as Sabbath or rest day, from evening to evening. New-moon services can last all day.\n\nSome modern sects who are Sabbath keepers have suggested a Sabbath based on the New Moon{{cn|date=September 2018}} citing [https://biblehub.com/psalms/104-19.htm Psalm 104:19] and [https://biblehub.com/genesis/1-14.htm Genesis 1:14] as a key [[prooftext]]s. Observers recognize the 1st, 8th, 15th, 22nd, and 29th days of the month of the Hebrew Calendar as Sabbath days which should be observed.<ref>{{Cite web|url=https://www.worldslastchance.com/wlc-challenge.html|title=The WLC Sabbath Challenge|website=Bible Prophecy {{!}} Online Bible Studies {{!}} Videos {{!}} WLC|access-date=2018-09-04}}</ref> They reject the 7 day week as non-biblical.{{cn|date=September 2018}} The Lunar Sabbath theory is rejected by most Sabbatarian groups and Judaism as false and misleading.\n\n===Day of the Vow===\n{{Main article|Day of the Vow}}\nDay of the Vow or [[Dingane]]'s Day ([[Afrikaans language|Afrikaans]] ''Geloftedag'' or ''Dingaansdag'', December 16) was the name of a religious public holiday in [[South Africa]] commemorating a famous [[Boer]] victory over the [[Zulu people|Zulu]]. Celebrated as annual Sabbath (a holy day of thanksgiving) since 1838, it was renamed [[Day of Reconciliation]] in 1994. The anniversary and its commemoration are intimately connected with various streams of [[Afrikaner]] and South African nationalism.\n\n===Millennial Sabbath===\n{{Main article|Millennial Day Theory}}\nSince [[Hippolytus of Rome]] in the early third century, Christians have often considered that some thousand-year Sabbath, expected to begin six thousand years after Creation, might be identical with the [[millennialism|millennium]] described in the [[Book of Revelation]]. This view was also popular among 19th- and 20th-century [[dispensationalism|dispensational]] [[premillennialist]]s. The term \"Sabbatism\" or \"Sabbatizing\" (Greek ''Sabbatismos''), which generically means any literal or spiritual Sabbath-keeping, has also been taken in {{Bibleverse||Hebrews|4:9|KJV}} to have special reference to this definition.\n\n===Spiritual Sabbath===\nAs another minority view, some modern Christians uphold Sabbath principles but do not limit observance to either Saturday or Sunday, instead advocating rest on any one chosen day of the week as following the spirit of Sabbath, or advocating Sabbath as instead a symbolic metaphor for rest in Christ. These look upon Sabbath as a principle to be observed in spirit rather than in letter, regarding the rest offered in [[Jesus]] as the only New Testament admonishment containing the root word of \"Sabbath\" ({{Bibleverse||Matthew|11:28|KJV}}) and sometimes as a more permanent rest than a day could fulfill ({{Bibleverse||Hebrews|4:9|KJV}}).\n\n===Latter Day Saint Movement===\nIn 1831, [[Joseph Smith]] published a revelation commanding his related movement, the formative [[Church of Christ (Latter Day Saints)|Church of Jesus Christ of Latter-day Saints]], to go to the house of prayer, offer up their sacraments, rest from their labors, and pay their devotions on the Lord's day (D&C 59:9–12).\nIn a revelation given to founder [[Joseph Smith]] in 1831, the Lord commanded: {{quote|That thou mayest more fully keep thyself unspotted from the world, thou shalt go to the house of prayer and offer up thy sacraments upon my holy day; for verily this is a day appointed unto you to rest from your labors, and to pay thy devotions unto the Most High.|D&C 59:9–10<ref>http://www.lds.org/scriptures/dc-testament/dc/59.9-11}}</ref>}}\n\nMormons believe this means performing no labor that would keep them from giving their full attention to spiritual matters (Ex. 20:10). LDS prophets have described this as meaning they should not shop, hunt, fish, attend sports events, or participate in similar activities on that day. Elder [[Spencer W. Kimball]] wrote in his ''[[The Miracle of Forgiveness]]'' that mere idle lounging on the Sabbath does not keep the day holy, and that it calls for constructive thoughts and acts.<ref>''[[The Miracle of Forgiveness]]'', pp.&nbsp;96–97</ref>\n\nMormons are encouraged to prepare their meals with \"singleness of heart\" on the Sabbath <ref>[https://www.lds.org/scriptures/dc-testament/dc/59?lang=eng LDS.org D&C 59:13]</ref>(D&C 59:13) and believe the day is only for righteous activities (Is. 58:13.) In most areas of the world, Mormons worship on Sunday.<ref>[http://lds.org/study/topics/sabbath?lang=eng LDS.org - Study by Topic - Sabbath]</ref>\n\nIn harmony with this revelation, members of the LDS church attend [[sacrament meeting]] each week. Other Sabbath-day activities may include: praying, meditating, studying the scriptures and the teachings of latter-day prophets, writing letters to family members and friends, reading wholesome material, visiting the sick and distressed, and attending other Church meetings.<ref>True to the Faith, p. 146 http://www.lds.org/bc/content/shared/content/english/pdf/language-materials/36863_eng.pdf{{full citation needed|date=February 2017}}</ref>\n\n==Islam==\n{{Main article|Jumu'ah}}\n{{See also|Islamic calendar}}\nThe [[Quran]] acknowledges a six-part Creation period (32:4, 50:38) and the [[Biblical Sabbath]] as the seventh-day (''yaum as-Sabt'': 2:65, 4:47, 154, 7:163, 16:124), but [[Allah]]'s mounting the throne after Creation is taken in contradistinction to [[Elohim]]'s concluding and resting from his labors, and so Muslims replace Sabbath rest with ''jumu'ah'' ([[Arabic]] جمعة ). Also known as \"Friday prayer\", ''jumu'ah'' is a congregational prayer (''[[salat]]'') held every Friday (the Day of Assembly), just after midday, in place of the otherwise daily ''[[dhuhr]]'' prayer; it commemorates the [[Islamic view of Adam|creation of Adam]] on the sixth day, as a loving gathering of Adam's sons. The Quran states: \"When the call is proclaimed to prayer on Friday, hasten earnestly to the Remembrance of Allah, and leave off business: That is best for you if ye but knew\" (62:9). The next verse (\"When the prayer is ended, then disperse in the land ...\") leads many Muslims not to consider Friday a rest day, as in [[Indonesia]], which regards the seventh-day Sabbath as unchanged; but many Muslim countries, such as [[Saudi Arabia]], the [[United Arab Emirates]] and [[Bangladesh]], do consider Friday a nonwork day, a holiday or a weekend; and other Muslim countries, like [[Pakistan]], count it as half a rest day (after the Friday prayer is over). ''Jumu'ah'' attendance is strictly incumbent upon all free adult males who are legal residents of the locality.\n\n==Other religious traditions==\n\n===Babylonian rest days===\n{{Main article|Babylonian calendar#Days|Shappatum}}\nCounting from the [[new moon]], the Babylonians celebrated the 7th, 14th, 21st, and 28th as \"holy-days\", also called \"evil days\" (meaning \"unsuitable\" for prohibited activities). On these days officials were prohibited from various activities and common men were forbidden to \"make a wish\", and at least the 28th was known as a \"rest-day\". On each of them, offerings were made to a different god and goddess. Tablets from the 6th-century BCE reigns of [[Cyrus the Great]] and [[Cambyses]] indicate these dates were sometimes approximate. The [[lunation]] of 29 or 30 days basically contained three [[seven-day week]]s, and a final week of nine or ten days inclusive, breaking the continuous seven-day cycle. The Babylonians additionally celebrated the 19th as a special \"evil day\", the \"day of anger\", because it was roughly the 49th day of the (preceding) month, completing a \"week of weeks\", also with sacrifices and prohibitions. Difficulties with [[Friedrich Delitzsch]]'s [[origin theory]] connecting Hebrew ''[[Shabbat]]'' with the Babylonian [[lunar cycle]] include reconciling the differences between an unbroken week and a lunar week, and explaining the absence of texts naming the lunar week as ''Shabbat'' in any language. Reconstruction of a broken tablet seems to define the rarely attested Babylonian [[Akkadian Empire|Akkadian]] word ''Sapattu<sup>m</sup>'' or ''Sabattu<sup>m</sup>'' as the [[full moon]]: this word is cognate or merged with Hebrew ''Shabbat'', but is monthly rather than weekly. It is regarded as a form of [[Sumer]]ian ''sa-bat'' (\"mid-rest\"), attested in [[Akkadian language|Akkadian]] as ''um nuh libbi'' (\"day of mid-repose\"). This conclusion is a contextual restoration of the damaged [[Enûma Eliš]] [[creation mythos]], which is read as: \"[Sa]pattu shalt thou then encounter, mid[month]ly.\"\n\nThe [[pentecontad calendar]], thought to be of [[Amorite]] origin, includes a period known to [[Babylonia]]ns as ''Shappatum''. The year is broken down into seven periods of fifty days (made up of seven weeks of seven days, containing seven weekly Sabbaths, and an extra fiftieth day, known as the ''atzeret''), plus an annual supplement of fifteen or sixteen days, called ''Shappatum'', the period of harvest time at the end of each year. Identified and reconstructed by Hildegaard and Julius Lewy in the 1940s, the calendar's use dates back to at least the 3rd millennium BCE in Western [[Mesopotamia]] and surrounding areas; it was used by the [[Canaan]]ite tribes, thought by some to have been used by the [[Israelite]]s prior to [[King Solomon]], and related to the [[liturgical]] calendar of the [[Essene]]s at [[Qumran]]. Used well into the modern age, forms of it have been found in [[Nestorianism]] and among the [[Palestinian people|Palestinian]] ''[[fellaheen]]''. Julius Morgenstern believed that the calendar of the [[Jubilees]] had ancient origins as a somewhat modified survival of the pentecontad calendar.\n\n===Zoroastrianism===\n{{See also|Zoroastrian festivals}}\nIn relating to the seventh and other days of the month, the [[Zoroastrian calendar]] contributed to the [[Jewish calendar]].<ref>{{cite book|last1=Haas|first1=W.S.|title=Iran|date=1946|publisher=Columbia University Press|location=New York}}</ref>  A number of writings by early Christians in the [[New Testament apocrypha]] ([[Zostrianos]], [[Marsenes]] and [[Allogenes]]) describe God's revelation received by a man named [[Zostrianos]].  Further evidence of Zoroastrian influence on Judaic tradition is demonstrated through [[Nehemiah]], the Priest in the [[Book of Nehemiah]], a book of the [[Neviim]] contained in the [[Tanakh]]. With the support and protection of [[Artaxerxes I of Persia]] (445/444 BCE), Nehemiah purified the Temple and the priests and Levites and enforced the observance of the law of Moses.<ref>{{cite book|last1=Allbright|first1=William|title=The Biblical Period from Abraham to Ezra: An Historical Survey|date=1963|publisher=Harpercollins College Div}}</ref>  \n{{See also|Second Temple}}\n\nFor exemplar, the observance of [[Passover]] coincides with [[Nowruz]], the Zoroastrian New Year which marks the first day of spring or vernal [[Equinox]].<ref>{{cite book|last1=Haas|first1=W.S.|title=Iran|date=1946|publisher=Columbia University Press|location=New York}}</ref>\n\n===Buddhist rest day===\n{{Main article|Uposatha}}\nThe ''Uposatha'' has been observed since [[Gautama Buddha]]'s time (500 BCE), and is still being kept today in [[Theravada Buddhist]] countries. It occurs every seven or eight days, in accordance with the four phases of the moon. Buddha taught that ''Uposatha'' is for \"the cleansing of the defiled mind\", resulting in inner calm and joy. On this day, [[Śrāvaka|disciples]] and [[monk]]s intensify their practice, deepen their knowledge, and express communal commitment through millennia-old acts of lay-monastic reciprocity.\n\n{{details|Wan Phra}}\n[[Thai Chinese]] likewise observe their Sabbaths and [[traditional Chinese holidays]] according to lunar phases, but not on exactly the same days as ''Uposatha''. These Sabbaths cycle through the month with respect to the [[Thai solar calendar]], so common Thai calendars incorporate Thai and [[Chinese calendar]] lunar dates, as well as ''Uposatha'' dates, for [[religion|religious]] purposes.\n\n===Cherokee rest days===\nThe first day of the [[new moon]], beginning at sunrise, is a [[holiday]] of [[leisure|quiet reflection]] and [[prayer]] among the [[Cherokee]]. Monthly [[fasting]] is encouraged, for up to four days. Work, cooking, sex and childbirth were also prohibited during the empty moon days, called \"un-time\" or \"non-days\"; childbirth during these days was considered unlucky. The Cherokee [[new year]], the \"great new moon\" or \"Hunting Moon\", is the first new moon in [[autumn]], after the setting of the [[Pleiades]] star cluster and around the time of the [[Leonids]] meteoric shower.\n\n===Sabbath as Saturday===\n{{details|Saturday}}\nOne [[folk tradition]] in English is the widespread use of \"Sabbath\" as a synonym of midnight-to-midnight \"Saturday\" (literally, [[Saturn]]'s day in at least a dozen languages): this is a simplification of the use of \"Sabbath\" in other religious contexts, where the two do not coincide. (Using midnight instead of sundown as delimiter dates back to the [[Roman Empire]].) In over thirty other languages, the [[week-day names|common name]] for this day in the [[seven-day week]] is a cognate of \"Sabbath\". \"[[Sabbatini]]\", originally \"Sabbadini\", often \"Sabatini\", etc., is a very frequent Italian name form (\"[[Christodoulos Sabbatos|Sabbatos]]\" is the Greek form), indicating a family whose ancestor was born on Saturday, Italian ''sabato''; \"Domenico\" indicated birth on Sunday. In [[vampire hunter]] lore, people born on Saturday were specially designated as ''sabbatianoí'' in [[Greek language|Greek]] and ''sâbotnichavi'' in [[Bulgarian language|Bulgarian]] (rendered in English as \"Sabbatarians\"). It was also believed in the [[Balkans]] that someone born on a Saturday could see a [[vampire]] when it was otherwise invisible.\n\n===Wicca===\n{{See also|Sabbat|Esbat|Witches' Sabbath}}\nThe annual cycle of the Earth's seasons is called the Wheel of the Year in [[Wicca]] and [[neopagan]]ism. Eight [[sabbat]]s (occasionally \"sabbaths\", or \"Sun sabbats\") are spaced at approximately even intervals throughout the year. [[Samhain]], which coincides with [[Halloween]], is considered the first sabbat of the year.\n\nAn esbat is a ritual observance of the [[full moon]] in Wicca and neopaganism. Some groups extend the esbat to include the dark moon and the first and last quarters. \"Esbat\" and \"sabbat\" are distinct and are probably not [[cognate]] terms, although an esbat is also called \"moon sabbat\".\n\nEuropean records from the [[Middle Ages]] to the 17th century or later also place Witches' Sabbaths on similar dates to sabbats in modern Wicca, but with some disagreement; medieval reports of sabbat activity are generally not firsthand and may be imaginative, but many persons were accused of, or tried for, taking part in sabbats.\n\n===Unification Church===\n{{See also|Ahn Shi Il}}\nThe [[Unification Church]] has a regular day of worship on Sunday, but every eight days Unificationists celebrate the day of Ahn Shi Il, considered as Sabbath but cycling among the weekdays of the Gregorian calendar. The [[Family Pledge]], formerly recited at 5:00&nbsp;a.m. on Sundays, was moved to Ahn Shi Il in 1994 and includes eight verses containing the phrase \"by centering on true love\".\n\n==Secular traditions==\n\n===Rest day in seven-day weeks===\n{{See also|Secular day of rest|Weekend}}\nSecular use of \"Sabbath\" for \"rest day\", while it usually refers to the same period of time (Sunday) as the majority Christian use of \"Sabbath\", is often stated in [[North America]] to refer to different purposes for the rest day than those of [[Christendom]]. In ''[[McGowan v. Maryland]]'' (1961), the [[Supreme Court of the United States]] held that contemporary [[Maryland]] [[blue law]]s (typically, Sunday rest laws) were intended to promote the secular values of \"health, safety, recreation, and general well-being\" through a common day of rest, and that this day coinciding with majority Christian Sabbath neither reduces its effectiveness for secular purposes nor prevents adherents of other religions from observing their own holy days. [[Massachusetts]], uncharacteristically, does not specify the weekday in its \"Day of Rest\" statute, providing only that one day off from work is required every week; an unspecified weekly day off is a very widespread business production cycle. The [[Supreme Court of Canada]], in ''[[R. v. Big M Drug Mart Ltd.]]'' (1985) and ''[[R. v. Edwards Books and Art Ltd.]]'' (1986), found some blue laws invalid for having no legitimate secular purpose, but others valid because they had no religious purpose.\n\nThe weekend is that period of the week set aside by custom or law for rest from labor. In many countries it is Saturday and Sunday and often includes Friday night. This five-day workweek arose in [[United States|America]] when [[labor union]]s attempted to accommodate Jewish Sabbath, beginning at a [[New England]] [[cotton mill]] and also instituted by [[Henry Ford]] in 1926; it became standard in America by about 1940 and spread among English-speaking and European countries to become the international workweek. [[China]] adopted it in 1995 and [[Hong Kong]] by 2006. [[India]] and some other countries follow both the international workweek and a more traditional Saturday half-workday and Sunday weekend. While [[Indonesia]] and [[Lebanon]] have the international workweek, most Muslim countries count Friday as the weekend, alone or with Thursday (all or half) or Saturday. Some universities permit a three-day weekend from Friday to Sunday. The weekend in [[Israel]], [[Nepal]], and parts of [[Malaysia]], is Friday (all or half) and Saturday. Only the one-day customary or legal weekends are usually called \"Sabbath\".\n\n===Rest day in other weeks===\n{{See also|Blank day|Chinese week|Décadi|Soviet week}}\nState-mandated rest days are widespread. Laws of the [[Han Dynasty]] (206 BCE – 220 CE) required imperial officials to rest on every ''mu'' (every fifth day), within a ten-day Chinese week. The rest day was changed to ''huan'' or ''xún'' (every tenth day) in the [[Tang Dynasty]] (618–907).\n\nThe [[calendar reform|reform calendar]] of the [[French Revolution]] was used from 1793 to 1805. It contained twelve months of three ten-day weeks; the five or six extra days needed to approximate the [[tropical year]] were placed after the months at the end of each year. The tenth day of each week, ''décadi'', replaced Sunday as the day of rest and festivity in France.\n\nFrom 1929 to 1931, the [[Soviet Union]] mandated a [[Soviet calendar|five-day week]], with each day designated by color as a state rest day for a different 20% of the workforce; families usually did not share rest days. Three weeks a year were six or seven days, because interrupted by holidays. From 1931 to 1940, the Soviets mandated a six-day week, with state rest days for all upon the 6th, 12th, 18th, 24th, and 30th of each [[Gregorian month]], as well as upon March 1. This also necessitated varying weeks of five to seven days over the year.\n\nAmong many calendar reform proposals that eliminate the constant [[seven-day week]] in exchange for simplified calculation of calendrical data like [[weekday names]] for given dates, some retain Sabbatical influences. The [[Hermetic Lunar Week Calendar]] uses [[moon phases]], resulting in weeks of six to nine days. The [[International Fixed Calendar]] and [[World Calendar]] both consist of 364-day years containing exactly 52 weeks (each starting on a day designated as Sunday), with an additional one or two [[intercalation (timekeeping)|intercalary]] \"blank\" days not designated as part of any week (Year Day and Leap Day in the International Fixed Calendar; Worldsday and Leapyear Day in the World Calendar). Reform supporters sought to accommodate Sabbatical observance by retaining the modified week and designating the intercalary days as additional Sabbaths or [[holidays]]; however, religious leaders held that such days disrupt the traditional seven-day weekly cycle. This unresolved issue contributed to the cessation of reform activities in the 1930s (International Fixed Calendar) and again in 1955 (World Calendar), though supporters of both proposals remain.\n\n===Subbotnik===\n{{Main article|Subbotnik}}\nThe subbotnik is a weekly day of volunteer work on Saturday in [[Russia]], other (former) [[Republics of the Soviet Union|Soviet republic]]s, the [[Eastern Bloc]], and the [[German Democratic Republic]], sporadically observed since 1919. The ''voskresnik'' is a related volunteer workday on Sunday. They focus on community service work; \"[[Lenin]]'s Subbotnik\" was also observed annually around his birthday.\n\n===Sabbatical===\n{{Main article|Sabbatical}}\nFrom the biblical sabbatical year came the modern concept of a 'sabbatical', a prolonged, often one-year, hiatus in the career of an individual (not usually tied to a seven-year period). Such a period is often taken in order to fulfill some goal such as writing a book or traveling extensively for research. Some universities and other institutional employers of scientists, physicians, or academics offer paid sabbatical as an employee benefit, called \"sabbatical leave\"; some companies offer unpaid sabbatical for people wanting to take career breaks.\n\n== References ==\n{{Portal|Judaism|Christianity|Islam}}\n{{reflist}}\n\n==External links==\n* {{Wiktionary-inline|Sabbath}}\n* {{wikiquote-inline}}\n* {{Cite NSRW|short=x|wstitle=Sabbath}}\n\n{{Set index article}}\n\n[[Category:Sabbath| ]]\n[[Category:Religious holidays]]\n[[Category:Working time]]",
            "slug": "sabbath",
            "date_updated": 1537256034915,
            "imported": "https://en.wikipedia.org/wiki/Sabbath"
        }
    ]
}