{
    "article": [
        {
            "title": "Scroll",
            "text": "{{Other uses}}\n{{Refimprove|date=March 2007}}\n[[Image:Joshua Roll.jpg|thumb|350px|''[[The Joshua Roll]]'', [[Vatican Library]]. An [[Illuminated manuscript|illuminated scroll]], probably of the 10th century, created in the Byzantine empire.]]\n[[Image:Scroll.jpg|right|thumb|Scroll of the [[Book of Esther]], [[Seville]], [[Spain]].]]\n[[File:Scroll ink materials.JPG|right|thumb|Ingredients used in making ink for Hebrew scrolls today.]]\nA '''scroll''' (from the Old French ''escroe'' or ''escroue''), also known as a '''roll''', is a roll of [[papyrus]], [[parchment]], or [[paper]] containing writing.<ref>Beal, Peter. (2008) \"scroll\" in ''A Dictionary of English Manuscript Terminology 1450–2000'' Online edition. [[Oxford University Press]], 2008. http://www.oxfordreference.com {{webarchive|url=https://www.webcitation.org/6H9SWMK4U?url=http://www.oxfordreference.com/ |date=5 June 2013 }} Retrieved 21 November 2013.</ref>\n\n==Structure==\nA scroll is usually divided up into pages, which are sometimes separate sheets of papyrus or parchment glued together at the edges, or may be marked divisions of a continuous roll of [[writing material]]. The scroll is usually unrolled so that one page is exposed at a time, for writing or reading, with the remaining pages rolled up to the left and right of the visible page. It is unrolled from side to side, and the text is written in lines from the top to the bottom of the page. Depending on the language, the letters may be written left to right, right to left, or alternating in direction ([[boustrophedon]]).\n\nSome scrolls are simply rolled up pages; others may have wooden rollers on each end: [[Torah]] scrolls have rather elaborate rollers befitting their ceremonial function.\n\n==History of scroll use==\n{{Main|History of scrolls}}\n{{double image|right|Giovane con rotolo.JPG|150|MANNapoli 120620 a Fresco young man with rolls from Pompeii Italy.jpg|150|[[Roman portraiture]] [[fresco]]s from [[Pompeii]], 1st century AD, depicting two different men wearing [[laurel wreath]]s, one holding the ''[[rotulus]]'', the other a ''[[History of scrolls|volumen]]''}}{{See also|Roman Empire#Literacy, books, and education}}Scrolls were the first form of editable record keeping texts, used in Eastern Mediterranean [[ancient Egyptian civilization]]s. Parchment scrolls were used by the [[Israelites]] among others before the [[codex]] or bound [[book]] with parchment pages was invented by the Romans, which became popular around the 1st century AD.<ref>{{cite web|url=https://www.history.com/news/history-lists/10-innovations-that-built-ancient-rome|title=10 Innovations That Built Ancient Rome|author=|date=|website=history.com}}</ref> Scrolls were more highly regarded than codices until well into [[Roman Empire|Roman]] times, where they were usually written in single latitudinal column.\n\nThe ink used in writing scrolls had to adhere to a surface that was rolled and unrolled, so special inks were developed. Even so, ink would slowly flake off of scrolls.\n\n==Rolls==\n[[File:Parliamentary archives.jpg|thumb|right|Rolls recording UK [[Acts of Parliament in the United Kingdom|Acts of Parliament]] held in the [[Parliamentary Archives]], [[Palace of Westminster]], London]]\nShorter pieces of [[parchment]] or [[paper]] are called ''rolls'' or ''[[Rotulus|rotuli]]'', although usage of the term by modern historians varies with periods. Historians of the classical period tend to use ''roll'' instead of ''scroll''. Rolls may still be many meters or feet long, and were used in the medieval and Early Modern period in Europe and various West Asian cultures for [[manuscript]] administrative documents intended for various uses, including accounting, rent-rolls, legal agreements, and inventories. A distinction that sometimes applies is that the lines of writing in rotuli run across the width of the roll (that is to say, are parallel with any unrolled portion) rather than along the length, divided into page-like sections. Rolls may be wider than most scrolls, up to perhaps 60&nbsp;cm or two feet wide.  Rolls were often stored together in a special cupboard on shelves.\n\nA special Chinese form of short book, called the \"whirlwind book,\" consists of several pieces of paper bound at the top with bamboo and then rolled up.<ref>{{cite web|url=http://idp.bl.uk/education/bookbinding/bookbinding.a4d|title=IDP Education - Bookbinding|author=|date=|website=idp.bl.uk}}</ref>\n\n==Scotland==\nIn [[Kingdom of Scotland|Scotland]], the term ''scrow'' was used from about the 13th to the 17th centuries for scroll, writing, or documents in list or schedule form. There existed an office of Clerk of the Scrow (''Rotulorum Clericus'') meaning the Clerk of the Rolls or Clerk of the Register.<ref>Beal, 2008, \"scrow\".</ref>\n\n==Replacement by the codex==\nThe Romans invented the ''codex'' form of the book, folding the scroll into pages which made reading and handling the document much easier. Legend has it that Julius Caesar was the first to fold scrolls, concertina-fashion, for dispatches to his forces campaigning in Gaul. Scrolls were awkward to read if a reader wished to consult material at opposite ends of the document. Further, scrolls were written only on one side, while both sides of the codex page were used. \n\nEventually, the folds were cut into sheets, or \"leaves,\" and bound together along one edge. The bound pages were protected by stiff covers, usually of wood enclosed with leather. ''Codex'' is Latin for a \"block of wood\": the Latin ''liber'', the root of \"library,\" and the German ''Buch'', the source of \"book,\" both refer to wood. The codex was not only easier to handle than the scroll, but it also fit conveniently on library shelves. The spine generally held the book's title, facing out, affording easier organization of the collection.\n\nThe term ''codex'' technically refers only to manuscript books-those that, at one time, were handwritten. More specifically, a codex is the term used primarily for a bound manuscript from Roman times up through the Middle Ages.\n\nFrom the fourth century on, the codex became the standard format for books, and scrolls were no longer generally used. After the contents of a parchment scroll were copied in codex format, the scroll was seldom preserved. The majority that did survive were found by archaeologists in burial pits and in the buried trash of forgotten communities.<ref>Murray, Stuart A.P. (2009) The Library: An Illustrated History. Chicago, IL. Skyhorse Publishing. (p.27)</ref>\n\n==Recent discovery==\nThe oldest complete Torah scroll was discovered stored in an academic library in Bolonia, Italy by Professor Mauro Perani in 2013. It had been mislabeled in 1889 as dating from the 17th century, but Perani suspected it was actually older as it was written in an earlier Babylonian script. Two tests conducted by laboratories at Italy’s University of Salento and at the University of Illinois confirmed that the scroll dates from the second half of the 12th century to the first quarter of the 13th century. Ancient Torah scrolls are rare because when they are damaged they stop being used for liturgies and are buried. \n\nThe scroll is made up of 58 sections of soft sheep leather. It is 36 meters long and 64 centimeters wide. <ref>[http://www.christiancentury.org/article/2013-06/oldest-complete-scroll-torah-found-italy Oldest complete scroll of Torah found in Italy] {{webarchive|url=https://web.archive.org/web/20140407075932/http://www.christiancentury.org/article/2013-06/oldest-complete-scroll-torah-found-italy |date=7 April 2014 }}. (2013). Christian Century, 130(13), 17</ref><ref>{{Cite news|url=https://news.nationalgeographic.com/news/2013/05/130530-worlds-oldest-torah-scroll-bible-bologna-carbon-dating/|title=Carbon Dating Confirms World's Oldest Torah Scroll|date=2013-05-31|access-date=2017-12-22|deadurl=no|archiveurl=https://web.archive.org/web/20171223042850/https://news.nationalgeographic.com/news/2013/05/130530-worlds-oldest-torah-scroll-bible-bologna-carbon-dating/|archivedate=23 December 2017|df=dmy-all}}</ref>\n\n==Modern technology ==\nModern technology may be able to assist in reading ancient scrolls. In January 2015, computer software may be making progress in reading 2,000-year-old Herculaneum scrolls, computer scientists report. After working for more than 10 years on unlocking the contents of damaged [[Herculaneum_papyri|Herculaneum scrolls]], researchers may be able to progress towards reading the scrolls, which cannot be physically opened.<ref>[https://www.sciencedaily.com/releases/2015/01/150122114405.htm Major breakthrough in reading ancient scrolls] {{webarchive|url=https://web.archive.org/web/20150123041620/https://www.sciencedaily.com/releases/2015/01/150122114405.htm |date=23 January 2015 }}, ''[[Science Daily]]'' </ref>\n\n==See also==\n*[[Codex]]\n*[[Hanging scroll]]\n*[[Handscroll]]\n*[[Herculaneum papyri]]\n*[[Paleography]]\n*[[Papyrus]]\n*[[Parchment]]\n*[[Sefer Torah]]\n*[[Vellum]]\n*[[Woodblock printing]]\n\n==References==\n<references/>\n\n==External links==\n{{Wiktionary}}\n{{Commons category|scrolls}}\n*[http://scrolls.uchicago.edu/ Digital Scrolling Paintings Project]\n*[http://penelope.uchicago.edu/~grout/encyclopaedia_romana/scroll/scrollcodex.html Encyclopaedia Romana: \"Scroll and codex\"]\n\n{{Use dmy dates|date=September 2011}}\n\n[[Category:Books by type]]\n[[Category:Scribes]]\n[[Category:Manuscripts by type]]\n[[Category:Textual scholarship]]",
            "slug": "scroll",
            "date_updated": 1537260743564,
            "imported": "https://en.wikipedia.org/wiki/Scroll"
        }
    ]
}