{
    "article": [
        {
            "title": "Torah",
            "text": {
                "title": "Torah",
                "content": "{{Other uses}}\n{{pp-move-indef|small=yes}}\n[[File:Köln-Tora-und-Innenansicht-Synagoge-Glockengasse-040.JPG|thumb|[[Sefer Torah]] at old [[Glockengasse Synagogue]] (reconstruction), [[Cologne]].]]\n[[File:Coffre et rouleau de Torah ayant appartenu à Abraham de Camondo chef de la communauté juive de Constantinople 1860 - Musée d'Art et d'Histoire du Judaïsme.jpg|thumb|Silver Torah Case, [[Ottoman Empire]] [[Musée d'Art et d'Histoire du Judaïsme|Museum of Jewish Art and History]].]]\n{{Bible sidebar|CB}}\n\n'''Torah''' ({{IPAc-en|ˈ|t|ɔːr|ə|,_|ˈ|t|oʊ|r|ə}}; {{lang-he-n|תּוֹרָה}}, \"Instruction\", \"Teaching\" or \"Law\") has a range of meanings. It can most specifically mean the first five books (''Pentateuch'') of the 24 books of the [[Tanakh]], and is usually printed with the [[rabbinic]] commentaries (''{{lang|he|[[rabbinic literature#Meforshim|perushim]]}}''). It can mean the continued narrative from the [[Book of Genesis]] to the end of the Tanakh, and it can even mean the totality of Jewish teaching, culture and practice, whether derived from biblical texts or later rabbinic writings.<ref>Neusner, Jacob (2004). ''The Emergence of Judaism''. Louisville: Westminster John Knox Press. p.&nbsp;57. \"The Hebrew word ''torah'' mean 'teaching'. We recall&nbsp;... the most familiar meaning of the word: 'Torah = the five books of Moses\", the Pentateuch&nbsp;.... The Torah may also refer to the entirety of the Hebrew Scriptures&nbsp;.... The Torah furthermore covers instruction in two media, writing and memory&nbsp;.... [The oral part] is contained, in part, in the Mishnah, Talmud, and midrash compilations. But there is more: what the world calls 'Judaism' the faithful know as 'the Torah.{{'\"}}</ref> Common to all these meanings, Torah consists of the origin of Jewish peoplehood: their call into being by [[God in Judaism|God]], their trials and tribulations, and [[Mosaic covenant|their covenant]] with their God, which involves following a way of life embodied in a set of moral and religious obligations and civil laws (''{{lang|he|[[halakha]]}}'').\n\nIn [[rabbinic literature]] the word ''Torah'' denotes both the five books ({{lang-he|תורה שבכתב}} \"Torah that is written\") and the [[Oral Torah]] ({{lang|he|תורה שבעל פה}}, \"Torah that is spoken\"). The Oral Torah consists of interpretations and amplifications which according to rabbinic tradition have been handed down from generation to generation and are now embodied in the [[Talmud]] and [[Midrash]].<ref name=\"Jewish Concepts 1964, page 630\">Birnbaum (1979), p. 630</ref> According to rabbinic tradition, all of the teachings found in the Torah, both written and oral, were given by God through the prophet [[Moses]], some at Mount Sinai and others at the [[Tabernacle]], and all the teachings were [[Mosaic authorship|written down by Moses]], which resulted in the Torah that exists today. According to the Midrash, the Torah was created prior to the [[Genesis creation narrative|creation of the world]], and was used as the blueprint for Creation.<ref>Vol. 11 Trumah Section 61</ref> The majority of [[Biblical studies|Biblical scholars]] believe that the written books were a product of the [[Babylonian captivity]] (c. 600&nbsp;BCE), based on earlier written and oral traditions, which could only have arisen from separate communities within ancient Israel,{{citation needed|date=July 2017}} and that it was completed by the period of [[Yehud Medinata|Achaemenid rule]] (c. 400&nbsp;BCE).<ref>page 1, {{cite book|last=Blenkinsopp |first=Joseph |title=The Pentateuch: An introduction to the first five books of the Bible |location=New York |publisher=Doubleday |year=1992 |isbn=0-385-41207-X |series=[[Anchor Bible Series|Anchor Bible]] Reference Library}}</ref><ref>Finkelstein, I., Silberman, NA., The Bible Unearthed: Archaeology's New Vision of Ancient Israel and the Origin of Its Sacred Texts, p.68</ref>\n\nTraditionally, the words of the Torah are written on a [[scroll]] by a scribe (''{{lang|he|[[sofer]]}}'') in Hebrew. A [[weekly Torah portion|Torah portion]] is read publicly at least once every three days in the presence of a [[minyan|congregation]].<ref>Babylonian Talmud Bava Kama 82a</ref> Reading the Torah publicly is one of the bases for Jewish communal life.\n\n==Meaning and names==\n[[File:ReadingOfTheTorah.jpg|thumb|Reading of the Torah]]\nThe word \"Torah\" in [[Biblical Hebrew|Hebrew]] is derived from the root ירה, which in the ''[[hif'il]]'' [[grammatical conjugation|conjugation]] means \"to guide/teach\" (cf. {{bibleref2|Lev|10:11}}). The meaning of the word is therefore \"teaching\", \"doctrine\", or \"instruction\"; the commonly accepted \"law\" gives a wrong impression.<ref name=\"EJ\">Rabinowitz, Louis Isaac and Harvey, Warren. \"Torah\". ''Encyclopaedia Judaica''. Ed. Michael Berenbaum and Fred Skolnik. Vol. 20. 2nd ed. Detroit: Macmillan Reference USA, 2007. pp. 39–46.</ref> The Alexandrian Jews who translated the Septuagint used the Greek word \"nomos\", meaning norm, standard, doctrine, and later \"law\". Greek and Latin Bibles then began the custom of calling the Pentateuch The Law. Other translational contexts in the English language include [[tradition|custom]], [[theory]], [[guide|guidance]],<ref>[[Philip Birnbaum]], ''Encyclopedia of Jewish Concepts'', Hebrew Publishing Company, 1964, p. 630</ref> or [[system]].<ref>p. 2767, Alcalay</ref>\n\nThe term \"Torah\" is used in the general sense to include both [[Rabbinic Judaism]]'s written law and Oral Law, serving to encompass the entire spectrum of authoritative [[Jew]]ish religious teachings throughout history, including the [[Mishnah]], the Talmud, the Midrash and more, and the inaccurate rendering of \"Torah\" as \"Law\"<ref>pp. 164–165, Scherman, Exodus 12:49</ref> may be an obstacle to understanding the ideal that is summed up in the term ''talmud torah'' (תלמוד תורה, \"study of Torah\").<ref name=\"Jewish Concepts 1964, page 630\"/>\n\nThe earliest name for the first part of the Bible seems to have been \"The Torah of Moses\". This title, however, is found neither in the Torah itself, nor in the works of the [[Babylonian Exile|pre-Exilic]] literary [[Nevi'im|prophets]]. It appears in [[Book of Joshua|Joshua]] (8:31–32; 23:6) and [[Books of Kings|Kings]] (I Kings 2:3; II Kings 14:6; 23:25), but it cannot be said to refer there to the entire corpus (according to academic Bible criticism). In contrast, there is every likelihood that its use in the post-Exilic works (Mal. 3:22; Dan. 9:11, 13; Ezra 3:2; 7:6; Neh. 8:1; II Chron. 23:18; 30:16) was intended to be comprehensive. Other early titles were \"The Book of Moses\" (Ezra 6:18; Neh. 13:1; II Chron. 35:12; 25:4; cf. II Kings 14:6) and \"The Book of the Torah\" (Neh. 8:3), which seems to be a contraction of a fuller name, \"The Book of the Torah of God\" (Neh. 8:8, 18; 10:29–30; cf. 9:3).<ref name=\"sarna\">Sarna, Nahum M. ''et al''. \"Bible\". ''Encyclopaedia Judaica''. Ed. Michael Berenbaum and Fred Skolnik. Vol. 3. 2nd ed. Detroit: Macmillan Reference USA, 2007. pp 576–577.</ref>\n\n==={{Anchor|Pentateuch}}Alternative names===\n{{redirect|Pentateuch}}\nChristian scholars usually refer to the first five books of the [[Hebrew Bible]] as the \"Pentateuch\" ({{lang-grc-gre|πεντάτευχος}}, ''pentáteuchos'', \"five scrolls\"), a term first used in the [[Hellenistic Judaism]] of [[Alexandria]].<ref>''The World and the Word: An Introduction to the Old Testament'', ed. Eugene H. Merrill, Mark Rooker, Michael A. Grisanti, 2011, p, 163: \"Part 4 The Pentateuch by Michael A. Grisanti: The Term \"Pentateuch\" derives from the Greek ''pentateuchos'', literally, ... The Greek term was apparently popularized by the Hellenized Jews of Alexandria, Egypt, in the first century AD...\"</ref>\n\n==Contents==\n{{Tanakh OT}}\n{{Infobox religious text\n|religion = Judaism\n|author = Multiple\n|language =[[Tiberian Hebrew]]\n|chapters =187\n|verses =5,852\n}}\nThe Torah starts from the beginning of God's creating the world, through the beginnings of the people of Israel, their descent into Egypt, and the giving of the Torah at [[biblical Mount Sinai]]. It ends with the death of [[Moses]], just before the people of Israel cross to the promised land of [[Canaan]]. Interspersed in the narrative are the specific teachings (religious obligations and civil laws) given explicitly (i.e. [[Ten Commandments]]) or implicitly embedded in the narrative (as in [[Book of Exodus|Exodus]] 12 and 13 laws of the celebration of [[Passover]]).\n\nIn Hebrew, the five books of the Torah are identified by the [[incipit]]s in each book;<ref>{{cite web|url=http://www.mid-day.com/articles/devdutt-pattanaik-the-fascinating-design-of-the-jewish-bible/18406175|title=Devdutt Pattanaik: The fascinating design of the Jewish Bible}}</ref> and the common English names for the books are derived from the [[Greek language|Greek]] [[Septuagint]] and reflect the essential theme of each book:\n\n*Bəreshit (בְּרֵאשִׁית, literally \"In the beginning\")—[[Book of Genesis|Genesis]], from Γένεσις (Génesis, \"Creation\")\n*Shəmot (שְׁמוֹת, literally \"Names\")—[[Book of Exodus|Exodus]], from Ἔξοδος (Éxodos, \"Exit\")\n*Vayikra (וַיִּקְרָא, literally \"And He called\")—[[Leviticus]], from Λευιτικόν (Leutikón, \"Relating to the Levites\") \n*Bəmidbar (בְּמִדְבַּר, literally \"In the desert [of]\")—[[Book of Numbers|Numbers]], from Ἀριθμοί (Arithmoí, \"Numbers\")\n*Dəvarim (דְּבָרִים, literally \"Things\" or \"Words\")—[[Deuteronomy]], from Δευτερονόμιον (Deuteronómion, \"Second-Law\")\n\n===Bəreshit/Genesis===\n''[[Book of Genesis|Genesis]]'' begins with the \"[[primeval history]]\" (Genesis 1–11<ref>https://www.themercava.com/app/books/source/18/1</ref>), the story of the world's beginnings and the descent from [[Adam]]. This is followed by the story of the three [[Patriarchs (Bible)|patriarchs]] ([[Abraham]], [[Isaac]], and [[Jacob]]), [[Joseph (patriarch)|Joseph]] (Genesis 12–50<ref>https://www.themercava.com/app/books/source/18/12</ref>) and the four matriarchs ([[Sarah]], [[Rebecca|Rebekah]], [[Leah]], and [[Rachel]]). God gives to the patriarchs a promise of the land of Canaan, but at the end of Genesis the sons of Jacob end up leaving Canaan for Egypt due to a regional famine. They had heard that there was a grain storage and distribution facility in Egypt.\n\n===Shəmot/Exodus===\n''[[Book of Exodus|Exodus]]'' begins the story of God's revelation to his people of Israel through Moses, who leads them out of Egypt (Exodus 1–18) to Mount Sinai. There the people accept the covenant with God, agreeing to be his people and abide by his holy Law, in return for his agreeing to be their God, and protect and defend them from their enemies, and provide for them and make them prosper. Moses receives the Torah from God, and teaches His laws and Covenant (Exodus 19–24) to the people of Israel. It also talks about the first violation of the covenant when the [[golden calf]] was constructed (Exodus 32–34). Exodus includes the instructions on building the Tabernacle and concludes with its actual construction (Exodus 25–31; 35–40).\n\n===Vayikra/Leviticus===\n''[[Leviticus]]'' begins with instructions to the Israelites on how to use the Tabernacle, which they had just built (Leviticus 1–10). This is followed by rules of [[tumah and taharah|clean and unclean]] (Leviticus 11–15), which includes the laws of slaughter and animals permissible to eat (see also: [[Kashrut]]), the [[Yom Kippur|Day of Atonement]] (Leviticus 16), and various moral and ritual laws sometimes called the [[Holiness Code]] (Leviticus 17–26). Leviticus 26 provides a detailed list of rewards for following God's commandments and a detailed list of punishments for not following them. Leviticus 17 establishes sacrifices at the Tabernacle as an everlasting ordinance, but this ordinance is altered in later books with the Temple being the only place in which sacrifices are allowed.\n\n===Bəmidbar/Numbers===\n''[[Book of Numbers|Numbers]]'' tells how Israel consolidated itself as a community at Sinai (Numbers 1–9), set out from Sinai to move towards Canaan and spied out the land (Numbers 10–13). Because of unbelief at various points, but especially at Kadesh Barnea (Numbers 14), the Israelites were condemned to wander for forty years in the desert in the vicinity of Kadesh instead of immediately entering the Promised Land. Even Moses sins and is told he would not live to enter the land (Numbers 20). At the end of Numbers (Numbers 26–35) Israel moves from Kadesh to the plains of Moab opposite [[Jericho]], ready to enter the Promised Land.\n\n===Dəvarim/Deuteronomy===\n''[[Deuteronomy]]'' is a series of speeches by [[Moses]] on the plains of [[Moab]] opposite [[Jericho]]. Also referred to as Mishneh Torah in Hebrew (a repeat of the Torah) the essential gist of the entire book is a rebuke to the Children of Israel to not worship idolatry, to not follow in the ways of Cana'an, and to cleave to God. Moses proclaims the Law (Deuteronomy 12–26), gives instruction concerning covenant renewal at Shechem (Deuteronomy 27–28) and gives Israel new laws (the \"[[Deuteronomic Code]]\").<ref>Coogan, Michael D. ''A Brief Introduction to the Old Testament: The Hebrew Bible in Its Context''. Oxford University Press, 2009. pp. 148–149</ref> At the end of the book (Deuteronomy 34) Moses is allowed to see the promised land from a mountain, and then dies. The text emphasises that no one knows where Moses was finally buried (34:6). Knowing that he was nearing the end of his life, Moses had appointed [[Joshua]] his successor, bequeathing to him the mantle of leadership. Soon afterwards Israel begins the conquest of Canaan.\n\n==Authorship==\n{{Main|Mosaic authorship|Documentary hypothesis}}\nThe Talmud holds that the Torah was written by Moses, with the exception of the last eight verses of [[Deuteronomy]], describing his death and burial, being written by [[Joshua]].<ref>Bava Basra 14b</ref> Alternatively, [[Rashi]] quotes from the Talmud that, \"God spoke them, and Moses wrote them with tears\".<ref name=\"Jacobs1995\">{{cite book|author=Louis Jacobs|title=The Jewish religion: a companion|url=https://books.google.com/books?id=l1u-_VMDM80C |accessdate=27 February 2012|year=1995 |publisher=Oxford University Press |isbn=978-0-19-826463-7 |page=375}}</ref><ref>Talmud, Bava Basra 14b</ref> The [[Mishnah]] includes the divine origin of the Torah as an essential tenet of Judaism.<ref>Mishnah, Sanhedrin 10:1</ref>\n\nThe modern scholarly consensus is that the Torah [[Documentary hypothesis|has multiple authors]] and that its composition took place over centuries.<ref>{{cite book|url=https://books.google.com/books/about/Reading_the_Pentateuch.html?id=Dkr7rVd3hAQC|last=McDermott |first=John J., |title=Reading the Pentateuch: a historical introduction |publisher=Pauline Press |year=2002 |page=21 |accessdate=2010-10-03 |isbn=978-0-8091-4082-4}}</ref> This contemporary common hypothesis among biblical scholars states that the first major comprehensive draft of the Pentateuch was composed in the late 7th or the 6th century BCE (the [[Jahwist]] source), and that this was later expanded by the addition of various narratives and laws (the [[Priestly source]]) into a work very like the one existing today.\n<blockquote>\n\"The consensus of scholarship is that the stories are taken from four different written sources and that these were brought together over the course of time to form the first five books of the Bible as a composite work. The sources are known as J, the Jahwist source (from the German transliteration of the Hebrew YHWH), E, the Elohist source, P, the priestly source, and D, the Deuteronomist source. ... Thus, the Pentateuch (or Torah, as it is known by Jews) comprises material taken from six centuries of human history, which has been put together to give a comprehensive picture of the creation of the world and of God's dealings with his peoples, specifically with the people of Israel.\" (Professor John Riches of the [[University of Glasgow]]).<ref>{{cite book|title= The Bible: A Very Short Introduction|edition= |last= Riches|first= John |year= 2000|publisher= Oxford University Press |location= Oxford|isbn= 978-0-19-285343-1|pages= 19–20}}</ref>\n</blockquote>\n\n==Torah and Judaism==\n[[File:Présentation de la Loi, Edouard Moyse (1860) - Musée d'art et d'histoire du Judaïsme.jpg|thumb|''Presentation of The Torah'' (1860) – [[Musée d'Art et d'Histoire du Judaïsme|Museum of Jewish Art and History]]]]\n{{Judaism |texts}}\nRabbinic writings indicate that the Oral Torah was given to Moses at [[Biblical Mount Sinai|Mount Sinai]], which, according to the tradition of [[Orthodox Judaism]], occurred in 1312&nbsp;BC. The Orthodox rabbinic tradition holds that the Written Torah was recorded during the following forty years,<ref name=Timeline>[http://www.aish.com/jl/h/48944541.html History Crash Course #36: Timeline: From Abraham to Destruction of the Temple], by Rabbi Ken Spiro, Aish.com. Retrieved 2010-08-19.</ref> though many non-Orthodox Jewish scholars affirm the modern scholarly consensus that the Written Torah has multiple authors and was written over centuries.<ref>{{cite book|title=The Jewish Study Bible |date=2004 |publisher=Oxford University Press |location=New York City |editor-last1=Berlin |editor-first1=Adele |editor-last2=Brettler |editor-first2=Marc Zvi |editor-last3=Fishbane |editor-first3=Michael |isbn=978-0195297515 |pages=3–7}}</ref>\n\nThe Talmud ([[Gittin]] 60a) presents two opinions as to how exactly the Torah was written down by Moses. One opinion holds that it was written by Moses gradually as it was dictated to him, and finished it close to his death, and the other opinion holds that Moses wrote the complete Torah in one writing close to his death, based on what was dictated to him over the years.\n\nThe Talmud ([[Menachot]] 30a) says that the last eight verses of the Torah that discuss the death and burial of Moses could not have been written by Moses, as writing it would have been a lie, and that they were written after his death by Joshua. [[Abraham ibn Ezra]]<ref>{{cite book|last1=Nadler|first1=Steven|last2=Saebo|first2=Magne|title=Hebrew Bible / Old Testament: The History of its Interpretation, II: From the Renaissance to the Enlightenment|date=2008|publisher=Vandenhoeck & Ruprecht|isbn=3525539827|page=829|url=https://books.google.com/?id=OMlT-FViF40C&pg=PA829&lpg=PA829&dq=death+of+moses+abraham+ibn+ezra#v=onepage&q=death%20of%20moses%20abraham%20ibn%20ezra&f=false|accessdate=18 September 2015}}</ref> and [[Joseph Bonfils]] observed{{Citation needed|date=March 2011}} that phrases in those verses present information that people should only have known after the time of Moses. Ibn Ezra hinted,<ref>Ibn Ezra, Deuteronomy 34:6</ref> and Bonfils explicitly stated, that Joshua wrote these verses many years after the death of Moses. Other commentators<ref>Ohr Ha'chayim Deuteronomy 34:6</ref> do not accept this position and maintain that although Moses did not write those eight verses it was nonetheless dictated to him and that Joshua wrote it based on instructions left by Moses, and that the Torah often describes future events, some of which have yet to occur.\n\nAll classical rabbinic views hold that the Torah was entirely Mosaic and of divine origin.<ref>For more information on these issues from an Orthodox Jewish perspective, see ''Modern Scholarship in the Study of Torah: Contributions and Limitations'', Ed. [[Shalom Carmy]], and ''Handbook of Jewish Thought'', Volume I, by [[Aryeh Kaplan]].</ref> Present-day [[Reform Judaism|Reform and Liberal]] Jewish movements all reject Mosaic authorship, as do most shades of [[Conservative Judaism]].<ref>Larry Siekawitch (2013), ''The Uniqueness of the Bible'', pp [https://books.google.com/books?id=EVSVAQAAQBAJ&pg=PA19 19]–30</ref>\n\nAccording to ''[[Legends of the Jews]]'', God gave Torah to the [[children of Israel]] after he approached every tribe and nation in the world, and offered them the Torah, but the latter refused it so they might have no excuse to be ignorant about it.<ref>Ginzberg, Louis (1909). ''[[Legends of the Jews]] [https://philologos.org/__eb-lotj/vol3/p02.htm Vol III: The Gentiles Refuse the Torah] '' (Translated by Henrietta Szold) Philadelphia: Jewish Publication Society.</ref> In this book, Torah is defined as one of the first things created, as remedy against the evil inclination,<ref>Ginzberg, Louis (1909). ''[[Legends of the Jews]] [https://philologos.org/__eb-lotj/vol2/three.htm#1 Vol II: Job and the Patriarchs]'' (Translated by Henrietta Szold) Philadelphia: Jewish Publication Society.</ref> and as the counselor who advised God to create human in the creation of world in order to make him the honored One.<ref>Ginzberg, Louis (1909). ''[[Legends of the Jews]] [https://philologos.org/__eb-lotj/vol1/one.htm#1 Vol I: The first things created]'' (Translated by Henrietta Szold) Philadelphia: Jewish Publication Society.</ref>\n\n===Ritual use===\n{{Main|Torah reading}}\n[[File:Toras in Istanbul Ashkenazi Sinagogue.JPG|upright=0.75|left|thumb|Torahs in [[Ashkenazi Synagogue]] ([[Istanbul]], [[Turkey]])]]\nTorah reading ({{Hebrew name 1|קריאת התורה|K'riat HaTorah|\"Reading [of] the Torah\"}}) is a Jewish religious [[ritual]] that involves the public reading of a set of passages from a [[Sefer Torah|Torah scroll]]. The term often refers to the entire ceremony of removing the Torah scroll (or scrolls) from the [[ark (synagogue)|ark]], chanting the appropriate excerpt with traditional [[cantillation]], and returning the scroll(s) to the ark. It is distinct from academic [[Torah study]].\n\nRegular public reading of the Torah was introduced by [[Ezra]] the Scribe after the return of the Jewish people from the [[Babylonian captivity]] (c. 537&nbsp;BCE), as described in the [[Book of Nehemiah]].<ref>Book of Nehemia, [http://mechon-mamre.org/p/pt/pt35b08.htm Chapter 8]</ref> In the modern era, adherents of Orthodox Judaism practice Torah-reading according to a set procedure they believe has remained unchanged in the two thousand years since the destruction of the [[Temple in Jerusalem]] (70&nbsp;CE). In the 19th and 20th centuries CE, new movements such as [[Reform Judaism]] and [[Conservative Judaism]] have made adaptations to the practice of Torah reading, but the basic pattern of Torah reading has usually remained the same:\n\nAs a part of the morning prayer services on certain days of the week, fast days, and holidays, as well as part of the afternoon prayer services of Shabbat, Yom Kippur, and fast days, a section of the Pentateuch is read from a Torah scroll. On [[Shabbat]] (Saturday) mornings, a weekly section (\"''[[parashah]]''\") is read, selected so that the entire Pentateuch is read consecutively each year. The division of ''parashot'' found in the modern-day Torah scrolls of all Jewish communities (Ashkenazic, Sephardic, and Yemenite) is based upon the systematic list provided by Maimonides in [[Mishneh Torah]], ''Laws of Tefillin, Mezuzah and Torah Scrolls'', chapter 8. Maimonides based his division of the ''parashot'' for the Torah on the [[Aleppo Codex]]. [[Conservative Judaism|Conservative]] and [[Reform Judaism|Reform]] synagogues may read ''parashot'' on a triennial rather than annual schedule,<ref>Source?</ref><ref>[http://www.uscj.org/The_Authentic_Trienn7085.html ''The Authentic Triennial Cycle: A Better Way to Read Torah?''] {{webarchive|url=https://web.archive.org/web/20120817031044/http://www.uscj.org/The_Authentic_Trienn7085.html |date=2012-08-17 }}</ref><ref>[http://urj.org/worship/letuslearn/s7bechol/] {{webarchive |url=https://web.archive.org/web/20120817031044/http://www.uscj.org/The_Authentic_Trienn7085.html |date=August 17, 2012}}</ref> On Saturday afternoons, Mondays, and Thursdays, the beginning of the following Saturday's portion is read. On [[Jewish holidays]], the beginnings of each month, and [[ta'anit|fast days]], special sections connected to the day are read.\n\nJews observe an annual holiday, [[Simchat Torah]], to celebrate the completion and new start of the year's cycle of readings.\n\nTorah scrolls are often dressed with a sash, a special Torah cover, various ornaments and a Keter (crown), although such customs vary among synagogues. Congregants traditionally stand in respect when the Torah is brought out of the ark to be read, while it is being carried, and lifted, and likewise while it is returned to the ark, although they may sit during the reading itself.\n\n===Biblical law===\n{{See also|Biblical law}}\nThe Torah contains narratives, statements of law, and statements of ethics. Collectively these laws, usually called [[biblical law]] or commandments, are sometimes referred to as the [[Law of Moses]] (''Torat Moshe'' {{hebrew|תּוֹרַת־מֹשֶׁה}}), [[Mosaic Law]], or [[Sinaitic covenant|Sinaitic Law]].\n\n==The Oral Torah==\nRabbinic tradition holds that Moses learned the whole Torah while he lived on Mount Sinai for 40 days and nights and both the oral and the written Torah were transmitted in parallel with each other. Where the Torah leaves words and concepts undefined, and mentions procedures without explanation or instructions, the reader is required to seek out the missing details from supplemental sources known as the oral law or oral Torah.<ref>[http://jewishinspiration.com/tape.php?tape_id=33 Rietti, Rabbi Jonathan. ''The Oral Law: The Heart of The Torah'']</ref> Some of the Torah's most prominent commandments needing further explanation are:\n*[[Tefillin]]: As indicated in Deuteronomy 6:8 among other places, tefillin are to be placed on the arm and on the head between the eyes. However, there are no details provided regarding what tefillin are or how they are to be constructed.\n*[[Kashrut]]: As indicated in Exodus 23:19 among other places, a young goat may not be boiled in its mother's milk. In addition to numerous other problems with understanding the ambiguous nature of this law, there are no vowelization characters in the Torah; they are provided by the oral tradition. This is particularly relevant to this law, as the Hebrew word for ''milk'' (חלב) is identical to the word for ''animal fat'' when vowels are absent. Without the oral tradition, it is not known whether the violation is in mixing meat with milk or with fat.\n*[[Shabbat]] laws: With the severity of Sabbath violation, namely the death penalty, one would assume that direction would be provided as to how exactly such a serious and core commandment should be upheld. However, most information regarding the rules and traditions of Shabbat are dictated in the Talmud and other books deriving from Jewish oral law.\n\nAccording to classical rabbinic texts this parallel set of material was originally transmitted to Moses at Sinai, and then from Moses to Israel. At that time it was forbidden to write and publish the oral law, as any writing would be incomplete and subject to misinterpretation and abuse.<ref>Talmud, Gittin 60b</ref>\n\nHowever, after exile, dispersion, and persecution, this tradition was lifted when it became apparent that in writing was the only way to ensure that the Oral Law could be preserved. After many years of effort by a great number of [[tannaim]], the oral tradition was written down around 200&nbsp;CE by Rabbi [[Judah haNasi]], who took up the compilation of a nominally written version of the Oral Law, the [[Mishnah]] ([[Hebrew]]: משנה). Other oral traditions from the same time period not entered into the Mishnah were recorded as \"Baraitot\" (external teaching), and the [[Tosefta]]. Other traditions were written down as [[Midrashim]].\n\nAfter continued persecution more of the oral law was committed to writing. A great many more lessons, lectures and traditions only alluded to in the few hundred pages of Mishnah, became the thousands of pages now called the ''[[Gemara]]''. Gemara is written in Aramaic, having been compiled in Babylon. The Mishnah and Gemara together are called the Talmud. The Rabbis in Israel also collected their traditions and compiled them into the [[Jerusalem Talmud]]. Since the greater number of Rabbis lived in Babylon, the Babylonian Talmud has precedence should the two be in conflict.\n\nOrthodox and Conservative branches of Judaism accept these texts as the basis for all subsequent halakha and codes of Jewish law, which are held to be normative. Reform and Reconstructionist Judaism deny that these texts, or the Torah itself for that matter, may be used for determining normative law (laws accepted as binding) but accept them as the authentic and only Jewish version for understanding the Torah and its development throughout history.{{citation needed|date=October 2012}} Humanistic Judaism holds that the Torah is a historical, political, and sociological text, but does not believe that every word of the Torah is true, or even morally correct. Humanistic Judaism is willing to question the Torah and to disagree with it, believing that the entire Jewish experience, not just the Torah, should be the source for Jewish behavior and ethics.<ref>{{cite web|url=http://oradam.org/OAC/FAQ |title=FAQ for Humanistic Judaism, Reform Judaism, Humanists, Humanistic Jews, Congregation, Arizona, AZ |publisher=Oradam.org |date= |accessdate=2012-11-07}}</ref>\n\n==Divine significance of letters, Jewish mysticism==\n{{Further|Kabbalah}}\nKabbalists hold that not only do the words of Torah give a divine message, but they also indicate a far greater message that extends beyond them. Thus they hold that even as small a mark as a ''kotso shel yod'' (קוצו של יוד), the [[serif]] of the Hebrew letter ''[[Yodh|yod]]'' (י), the smallest letter, or decorative markings, or repeated words, were put there by God to teach scores of lessons. This is regardless of whether that yod appears in the phrase \"I am the LORD thy God\" ({{hebrew|אָנֹכִי יְהוָה אֱלֹהֶיךָ}}, Exodus 20:2) or whether it appears in \"And God spoke unto Moses saying\" ({{hebrew|וַיְדַבֵּר אֱלֹהִים, אֶל-מֹשֶׁה; וַיֹּאמֶר אֵלָיו, אֲנִי יְהוָה.}} Exodus 6:2). In a similar vein, [[Rabbi Akiva]] (c. 50 – c. 135 CE), is said to have learned a new law from every ''et'' (את) in the Torah (Talmud, tractate Pesachim 22b); the [[grammatical particle|particle]] ''et'' is meaningless by itself, and serves only to mark the [[Object (grammar)|direct object]]. In other words, the [[Orthodox Judaism|Orthodox]] belief is that even apparently contextual text \"And God spoke unto Moses saying&nbsp;...\" is no less important than the actual statement.\n\n==Production and use of a Torah scroll==\n{{Main|Sefer Torah}}\n[[File:Page Pointers for reading of Torah.jpg|thumb|Page pointers, or [[yad]], for reading of the Torah]]\n[[Manuscript]] Torah [[scroll]]s are still scribed and used for ritual purposes (i.e., [[Jewish services|religious services]]); this is called a ''[[Sefer Torah]]'' (\"Book [of] Torah\"). They are written using a painstakingly careful methodology by highly qualified scribes. This has resulted in, according to B. Barry Levy, \"The popular assumption that no changes were ever introduced into copies of the Bible during rabbinic times.\" However, he writes that this \"simply does not accord with the facts\".<ref>B. Barry Levi, ''Fixing God's Torah: The Accuracy of the Hebrew Bible Text in Jewish Law'', Oxford University Press, 2001, p. 4.</ref> It is believed that every word, or marking, has divine meaning, and that not one part may be inadvertently changed lest it lead to error. The fidelity of the Hebrew text of the Tanakh, and the Torah in particular, is considered paramount, down to the last letter: translations or transcriptions are frowned upon for formal service use, and transcribing is done with painstaking care. An error of a single letter, ornamentation, or symbol of the 304,805 stylized letters that make up the Hebrew Torah text renders a Torah scroll unfit for use, hence a special skill is required and a scroll takes considerable time to write and check.\n\nAccording to Jewish law, a ''sefer Torah'' (plural: ''Sifrei Torah'') is a copy of the formal Hebrew text handwritten on ''[[gevil]]'' or ''[[klaf]]'' (forms of [[parchment]]) by using a [[quill]] (or other permitted writing utensil) dipped in ink. Written entirely in [[Hebrew language|Hebrew]], a ''sefer Torah'' contains 304,805 letters, all of which must be duplicated precisely by a trained ''[[sofer]]'' (\"scribe\"), an effort that may take as long as approximately one and a half years. Most modern Sifrei Torah are written with forty-two lines of text per column (Yemenite Jews use fifty), and very strict rules about the position and appearance of the [[Hebrew alphabet|Hebrew letters]] are observed. See for example the [[Mishnah Berurah]] on the subject.<ref>[http://www.geniza.net/ritual/mb/letterforms.shtml Mishnat Soferim The forms of the letters] {{webarchive|url=https://web.archive.org/web/20080523195538/http://www.geniza.net/ritual/mb/letterforms.shtml |date=2008-05-23 }} translated by Jen Taylor Friedman (geniza.net)</ref> Any of several Hebrew scripts may be used, most of which are fairly ornate and exacting.\n\nThe completion of the sefer Torah is a cause for great celebration, and it is a [[mitzvah]] for every Jew to either write or have written for him a Sefer Torah. Torah scrolls are stored in the [[holy|holiest]] part of the [[synagogue]] in the [[Torah ark|Ark]] known as the \"Holy Ark\" ({{hebrew|אֲרוֹן הקֹדשׁ}} ''aron hakodesh'' in Hebrew.) ''Aron'' in Hebrew means \"cupboard\" or \"closet\", and kodesh is derived from \"kadosh\", or \"holy\".\n\n==Torah translations==\n\n===Aramaic===\n{{Main|Targum}}\nThe [[Book of Ezra]] refers to translations and commentaries of the Hebrew text into [[Aramaic]], the more commonly understood language of the time. These translations would seem to date to the 6th century BCE. The Aramaic term for ''translation'' is ''Targum''.<ref>Chilton, BD. (ed), ''The Isaiah Targum: Introduction, Translation, Apparatus and Notes'', Michael Glazier, Inc., p. xiii</ref> The [[Encyclopedia Judaica]] has: <blockquote>At an early period, it was customary to translate the Hebrew text into the vernacular at the time of the reading (e.g., in Palestine and Babylon the translation was into Aramaic). The targum (\"translation\") was done by a special synagogue official, called the meturgeman ... Eventually, the practice of translating into the vernacular was discontinued.<ref>''Encyclopedia Judaica'', entry on ''Torah, Reading of''</ref>\n</blockquote> However, there is no suggestion that these translations had been written down as early as this. There are suggestions that the Targum was written down at an early date, although for private use only. <blockquote>The official recognition of a written Targum and the final redaction of its text, however, belong to the post-Talmudic period, thus not earlier than the fifth century C.E.<ref>''Encyclopedia Judaica'', entry on ''Bible: Translations''</ref></blockquote>\n\n===Greek===\n{{Main|Septuagint}}\nOne of the earliest known translations of the first five books of Moses from the Hebrew into Greek was the Septuagint. This is a [[Koine Greek]] version of the [[Hebrew Bible]] that was used by Greek speakers. The Greek version's name in Latin is the [[Septuagint]]: Latin ''septem'' meaning seven, plus ''-gintā'' meaning \"times ten\". It was named ''Septuagint'' from the traditional number of its translators. This Greek version of the Hebrew Scriptures dates from the 3rd century BCE, originally associated with [[Hellenistic Judaism]]. It contains both a translation of the Hebrew and additional and variant material.<ref>Greifenhagen, FV., ''Egypt on the Pentateuch's Ideological Map: Constructing Biblical Israel's Identity'', Continuum, 2002, p. 218.</ref>\n\nLater translations into Greek include seven or more other versions. These do not survive, except as fragments, and include those by [[Aquila of Sinope|Aquila]], [[Symmachus the Ebionite|Symmachus]], and [[Theodotion]].<ref>''Encyclopedia Judaica'', vol. 3, p. 597</ref>\n\n===Latin===\nEarly translations into Latin—the [[Vetus Latina]]—were ad hoc conversions of parts of the Septuagint. With Saint [[Jerome]] in the 4th century CE came the [[Vulgate]] Latin translation of the [[Hebrew Bible]].\n\n===Arabic===\nFrom the eighth century AD, the cultural language of Jews living under Islamic rule became [[Arabic]] rather than Aramaic. \"Around that time, both scholars and lay people started producing translations of the Bible into [[Judeo-Arabic]] using the Hebrew alphabet.\" Later, by the 10th century, it became essential for a standard version of the Bible in Judeo-Arabic. The best known was produced by [[Saadiah]], and continues to be in use today, \"in particular among Yemenite Jewry\".<ref>''Encyclopedia Judaica'', vol. III, p. 603</ref>\n\nRav Sa'adia produced an Arabic translation of the Torah known as ''Targum Tafsir'' and offered comments on Rasag's work.<ref>{{cite book|author=George Robinson|title=Essential Torah: A Complete Guide to the Five Books of Moses|url=https://books.google.com/books?id=X54NS-Lc-OcC&pg=PA167|date=17 December 2008|publisher=Knopf Doubleday Publishing Group|isbn=978-0-307-48437-6|pages=167–|quote=Sa'adia's own major contribution to the Torah is his Arabic translation, ''Targum Tafsir''.}}</ref> There is a debate in scholarship whether Rasag wrote the first Arabic translation of the Torah.<ref>{{cite book|author=Zion Zohar|title=Sephardic and Mizrahi Jewry: From the Golden Age of Spain to Modern Times|url=https://books.google.com/books?id=4vg0RdqjNV0C&pg=PA106|date=June 2005|publisher=NYU Press|isbn=978-0-8147-9705-1|pages=106–|quote=Controversy exists among scholars as to whether Rasag was the first to translate the Hebrew Bible into Arabic.}}</ref>\n\n===Modern languages===\n\n====Jewish translations====\nThe Torah has been translated by Jewish scholars into most of the major European languages, including English, German, Russian, French, Spanish and others. The most well-known German-language translation was produced by [[Samson Raphael Hirsch]]. A number of [[Jewish English Bible translations]] have been published.\n\n====Christian translations====\nAs a part of the [[Christian biblical canons]], the Torah has been translated into [[List of Bible translations by language|hundreds of languages]].\n\n==In other religions==\n===Christianity===\n{{See also|Biblical law in Christianity|Development of the Old Testament canon}}\n[[Jesus]] himself emphasized the Law of Moses,<ref>Stephenson, Lester L., ''[https://books.google.com/books?isbn=1620206676 A Biblicist View of Law and Gospel]''</ref> saying that whoever believed in Moses' writings would also believe Jesus' words:<ref>Cerullo, David, ''[https://books.google.com/books?isbn=1603748946 Pursuing His Presence: Intimacy with God Revealed in the Tabernacle]''</ref><ref>Bahnsen, Greg; Walter, Kaiser, ''[https://books.google.com/books?isbn=0310872278 Five Views on Law and Gospel]''</ref>\n\n{{quote|Do not think that I will accuse you to the Father: there is one that accuseth you, even Moses, in whom ye trust. For had ye believed Moses, ye would have believed me; for he wrote of me. But if ye believe not his writings (Torah), how shall ye believe my words?|{{bibleverse ||John|5:45-47|KJV}}}}\n\nAmong [[early centers of Christianity]] the Septuagint was used by Greek speakers, while [[Aramaic of Jesus|Aramaic]] [[Targum]]s were used by Aramaic speakers such as the [[Syriac Orthodox Church]]. It{{clarify|what is \"it\" here?|date=July 2018}} was regarded as the standard form of the \"Old Testament\" in the early Greek Christian Church and is still considered canonical in the Eastern Orthodox Church.<ref>p. 317, DeSilva</ref> Though different [[Christian denomination]]s have slightly [[development of the Old Testament canon|different versions]] of the \"Old Testament\" in their Bibles, the Torah as the \"Five Books of Moses\" (or \"the [[Mosaic Law]]\") is common among them all.\n\n===Islam===\n{{See also|Torah in Islam|Islamic–Jewish relations}}\nWhile [[Christianity]] includes the five books of Moses (the ''Pentateuch'') among their sacred texts in its \"[[Old Testament]]\", [[Islam]] states that only the original Torah was sent by God. In neither religion does the Torah retain the religious legal significance that it does in Orthodox Judaism.\n\nThe [[Quran]] refers heavily to Moses to outline the truth of his existence and the religious guidelines that God had revealed to the Children of Israel. According to the Quran, Allah says, \"It is He Who has sent down the Book (the Quran) to you with truth, confirming what came before it. And He sent down the Taurat (Torah) and the Injeel (Gospel).\" [3:3]\n\nMuslims call the Torah the ''[[Tawrat]]'' and consider it the word of God given to Moses. However, Muslims also believe that this original revelation was corrupted (''[[tahrif]]'') (or simply altered by the passage of time and human fallibility) over time by Jewish scribes<ref>[http://www.ahmed-deedat.co.za/bible/07.html Is the Bible God's Word] {{webarchive|url=https://web.archive.org/web/20080513034243/http://www.ahmed-deedat.co.za/bible/07.html |date=2008-05-13 }} by Sheikh Ahmed Deedat</ref> and hence do not revere the present \"Jewish version\" Torah as much ({{cite Quran|7|144|end=144|expand=no|style=ref}}). The Torah in the Quran is always mentioned with respect in Islam. The Muslims' belief in the Torah, as well as the prophethood of Moses, is one of the [[six articles of belief|fundamental tenets]] of Islam.\n\n===Bahá'í Faith===\nThe [[Bahá'í Faith|Bahá'í]] position on the Torah was composed in 1906 by its official interpreter on all matters religious, Sir 'Abdu'l-Bahá' Abbas K.B.E.<blockquote>\"The Torah, held to be the most ancient of histories, existeth today in three separate versions: the Hebrew, considered authentic by the Jews and the Protestant clergy; the Greek Septuagint, which was used as authoritative in the Greek and other eastern churches; and the Samaritan Torah, the standard authority for that people. These three versions differ greatly, one from another, even with regard to the lifetimes of the most celebrated figures. In the Hebrew Torah, it is recorded that from Noah's flood until the birth of Abraham there was an interval of two hundred and ninety-two years. In the Greek, that time span is given as one thousand and seventy-two years, while the Samaritan, the recorded span is nine hundred and forty-two years. Refer to the commentary by Henry Westcott for tables are supplied therein which show the discrepancies among the three Torahs as to the birth dates of a number of the descendants of Shem, and thou wilt see how greatly the versions differ from one another. Moreover, according to the text of the Hebrew Torah, from the creation of Adam until Noah's flood the elapsed time is recorded as one thousand six hundred and fifty-six years, while in the Greek Torah the interval is given as two thousand two hundred and sixty-two years, and in the Samaritan text, the same period is said to have lasted one thousand three hundred and seven years. Reflect now over the discrepancies among these three Torahs. The case is indeed surprising. The Jews and Protestants belittle the Greek Torah, while to the Greeks, the Hebrew version is spurious, and the Samaritans deny both the Hebrew and the Greek versions.\"</blockquote>'Abdu'l Bahá's elucidations above in 1906 are found in [http://bahai-library.com/abdulbaha_tablet_wisdom_questions his letter] to [[Ethel Jenner Rosenberg]] (1858–1930, without issue and no relation to the famous spies, Ethel and Julius Rosenberg).\n\n==See also==\n{{Div col|colwidth=30em}}\n*[[613 commandments]]\n*[[Book of Moses]] (LDS)\n*[[Christianity and Judaism]]\n*[[Heptateuch]]\n*[[Hexapla]]\n*[[Ketuvim]]\n*[[Nevi'im]]\n*[[Jewish Publication Society]] (JPS)\n*[[New Jewish Publication Society of America Tanakh]] (JPS Tanakh)\n*[[Judeo-Christian]]\n*[[Ketef Hinnom]]\n*[[Moses in rabbinic literature]]\n*[[Samaritan Pentateuch]]\n*[[Torah redactor]]\n*[[Torah scroll (Yemenite)]]\n{{Div col end}}\n\n==References==\n{{Reflist|30em}}\n\n==Bibliography==\n{{Refbegin|30em|indent=yes}}\n*{{cite book|last=Bandstra|first=Barry L|title=Reading the Old Testament: an introduction to the Hebrew Bible|publisher=Wadsworth|year=2004|url=https://books.google.com/books?id=vRY9mTUZKJcC&pg=PA489&lpg=PA489&dq=Bandstra,+Barry+L+%282004%29.+Reading+the+Old+Testament:+an+introduction+to+the+Hebrew+Bible#v=onepage&q&f=false|isbn=9780495391050}}\n*{{cite book|last=Birnbaum|first=Philip|title=Encyclopedia of Jewish Concepts|publisher=Wadsworth|year=1979}}\n*{{cite book|last=Blenkinsopp|first=Joseph|title=Treasures old and new: essays in the theology of the Pentateuch|publisher=Eerdmans|year=2004|url=https://books.google.com/books?id=wq0YsOpTjKIC&printsec=frontcover&dq=Treasures+old+and+new:+essays+in+the+theology+of+the+Pentateuch#v=onepage&q&f=false|isbn=9780802826794}}\n*{{cite book|last1=Campbell|first1=Antony F|last2=O'Brien|first2=Mark A|title=Sources of the Pentateuch: texts, introductions, annotations|publisher=Fortress Press|year=1993|url=https://books.google.com/?id=cwhICpcHBsQC&pg=PR3&dq=Sources+of+the+bible#v=onepage&q=Sources%20of%20the%20bible&f=false|isbn=9781451413670}}\n*{{cite book|last=Carr|first=David M|title=Reading the fractures of Genesis|publisher=Westminster John Knox Press|year=1996|url=https://books.google.com/books?id=8UJctZxFHikC&printsec=frontcover&dq=Reading+the+fractures+of+Genesis:+historical+and+literary+approaches#v=onepage&q&f=false|isbn=9780664220716}}\n*{{cite book|last=Clines|first=David A|title=The theme of the Pentateuch|publisher=Sheffield Academic Press|year=1997|url=https://books.google.com/books?id=Z45ullcFRG8C&printsec=frontcover&dq=Clines+Theme+of+the+Pentateuch#v=onepage&q&f=false|isbn=9780567431967}}\n*{{cite book|last=Davies|first=G.I|chapter=Introduction to the Pentateuch|url=https://books.google.com/books?id=3surkLVdw3UC&pg=PA12&dq=Oxford+Bible+Commentary+Introduction+to+the+Pentateuch#v=onepage&q=Oxford%20Bible%20Commentary%20Introduction%20to%20the%20Pentateuch&f=false|editor=John Barton|title=Oxford Bible Commentary|publisher=Oxford University Press|year=1998|isbn=9780198755005}}\n*{{cite book|last=Friedman|first=Richard Elliot|title=Commentary on the Torah With a New English Translation|publisher=Harper Collins Publishers|year=2001}}\n*{{cite book|last=Gooder|first=Paula|title=The Pentateuch: a story of beginnings|publisher=T&T Clark|year=2000|url=https://books.google.com/books?id=49XpvvO-Oq0C&printsec=frontcover&dq=The+Pentateuch+Paula+Gooder#v=onepage&q&f=false|isbn=9780567084187}}\n*{{cite book|last1=Kugler|first1=Robert|last2=Hartin|first2=Patrick|title=The Old Testament between theology and history: a critical survey|publisher=Eerdmans|year=2009|url=https://books.google.com/books?id=L8WbXbPjxpoC&printsec=frontcover&dq=Robert+Kugler,+Patrick+Hartin#v=onepage&q&f=false|isbn=9780802846365}}\n*{{cite book|last1=Levin|first1=Christoph L|title=The Old testament: a brief introduction|publisher=Princeton University Press|year=2005|url=https://books.google.com/books?id=7geSuBAQ1e0C&printsec=frontcover&dq=The+Old+testament:+a+brief+introduction+Christoph+Levin#v=onepage&q&f=true|isbn=9780691113944}}\n*{{cite book|last=McEntire|first=Mark|title=Struggling with God: An Introduction to the Pentateuch|publisher=Mercer University Press|year=2008|url=https://books.google.com/books?id=VwOs9f1FpmsC&pg=PA87&dq=william+propp+exodus+1-18#v=onepage&q=william%20propp%20exodus%201-18&f=false|isbn=9780881461015}}\n*{{cite book|last=Ska|first=Jean-Louis|title=Introduction to reading the Pentateuch|publisher=Eisenbrauns|year=2006|url=https://books.google.com/books?id=7cdy67ZvzdkC&printsec=frontcover&dq=Introduction+to+reading+the+Pentateuch+Jean+Louis+Ska#v=onepage&q&f=false|isbn=9781575061221}}\n*{{cite book|last=Van Seters|first=John|chapter=The Pentateuch|url=https://books.google.com/books?id=owwhpmIVgSAC&printsec=frontcover&dq=The+Hebrew+Bible+today:+an+introduction+to+critical+issues#v=onepage&q&f=false|editor=Steven L. McKenzie, Matt Patrick Graham|title=The Hebrew Bible today: an introduction to critical issues|publisher=Westminster John Knox Press|year=1998|isbn=9780664256524}}\n*{{cite book|last=Van Seters|first=John|title=The Pentateuch: a social-science commentary|publisher=Continuum International Publishing Group|year=2004|url=https://books.google.com/?id=T-Vi9eK_vS0C&pg=PA7&dq=Sources+of+the+bible#v=onepage&q=Sources%20of%20the%20bible&f=false|isbn=9780567080882}}\n*{{cite book|last=Walsh|first=Jerome T|title=Style and structure in Biblical Hebrew narrative|publisher=Liturgical Press|year=2001|url=https://books.google.com/books?id=hGeXrcQTZ2kC&printsec=frontcover&dq=style+and+structure+in+biblical+hebrew+narrative#v=onepage&q&f=false|isbn=9780814658970}}\n{{Refend}}\n\n==Further reading==\n{{Refbegin|30em|indent=yes}}\n*Rothenberg, Naftali, (ed.), ''Wisdom by the week – the Weekly Torah Portion as an Inspiration for Thought and Creativity'', Yeshiva University Press, New York 2012\n*Friedman, Richard Elliott, ''Who Wrote the Bible?'', HarperSanFrancisco, 1997\n*Welhausen, Julius, ''Prolegomena to the History of Israel'', Scholars Press, 1994 (reprint of 1885)\n*Kantor, Mattis, ''The Jewish time line encyclopedia: A year-by-year history from Creation to the present'', Jason Aronson Inc., London, 1992\n*Wheeler, Brannon M., ''Moses in the Quran and Islamic Exegesis'', Routledge, 2002\n*DeSilva, David Arthur, ''An Introduction to the New Testament: Contexts, Methods & Ministry'', InterVarsity Press, 2004\n*Alcalay, Reuben., ''The Complete Hebrew – English dictionary'', vol 2, Hemed Books, New York, 1996 {{ISBN|978-965-448-179-3}}\n*Scherman, Nosson, (ed.), Tanakh, Vol. I, The Torah, (Stone edition), Mesorah Publications, Ltd., New York, 2001\n*Heschel, Abraham Joshua, Tucker, Gordon & Levin, Leonard, ''Heavenly Torah: As Refracted Through the Generations'', London, Continuum International Publishing Group, 2005\n*Hubbard, David \"The Literary Sources of the Kebra Nagast\" ''Ph.D. dissertation St Andrews University, Scotland, 1956''\n{{Refend}}\n\n==External links==\n{{Commons category|Torah}}\n{{Wiktionary|Torah|Pentateuch}}\n*[http://www.jewishencyclopedia.com/view.jsp?artid=265&letter=T&search=Torah Jewish Encyclopedia: Torah]\n*[http://bible.ort.org/books/torahd5.asp Computer generated Sefer Torah for Study online with translation, transliteration and chanting (WorldORT)]\n*[http://www.jr.co.il/hotsites/j-torah.htm Online Torah Resources—weekly parsha pages, learning resources by topic]\n*[http://sites.google.com/site/interlinearpentateuch/ Interlinear Pentateuch (with Idiomatic Translation, Samaritan Pentateuch and Morphology)]\n*[http://www.iclnet.org/pub/resources/text/ipb-e/tanach/ipbe-tn.html The Tanach Page – הדף של התנ\"ך]\n*[http://www.wdl.org/en/item/11364/ Damascus Pentateuch] from around 1000 CE\n*{{cite NIE|wstitle=Pentateuch|last=Jastrow |first=Morris |authorlink=Morris Jastrow |year=1905 |short=x}}\n\n{{Jews and Judaism}}\n{{Weekly Torah Portions}}\n{{Characters and names in the Quran}}\n{{Religious books}}\n\n{{Authority control}}\n\n[[Category:Torah| ]]\n[[Category:Hebrew words and phrases]]\n[[Category:Texts attributed to Moses]]"
            },
            "slug": "torah",
            "date_updated": 1537255877640,
            "imported": "https://en.wikipedia.org/wiki/Torah"
        }
    ]
}