{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1562163868_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1562139016_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1546089919_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> [xcape2net](#comment_82_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):   What would be wrong with giving ZeroNet something like a browser preferences page with a pull-down menu of several existing ZeroNet zites, so the user can pick which zite to use as his home page on ZeroNet? Then, if any one of those zites goes down, he has others to choose from\n\nYes exactly, an easier and quicker way to configure things makes stuff like this less of a problem.\n\n> For new users that are using ZeroNet for the very first time, this could be the first page they see.\n\nLike with all application installers this would be nice to have.\n\nAlso this:\n\n*    Ask before updating ZeroNet and sites like ZeroHello (unless the user doesn't want to be bothered) and make it easy to review code changes\n*    Deprecate by first freezing ZeroName because @nofish has full control over it and Namecoin is pretty much dead and inaccessible\n*    Add PoW-based user registration as an alternative to giving out a certificate authority's private key as used on Millchan, ZeroVoat, this is necessary for truly decentralized user registration, things like ZeroID and whatever only lead to more centralization with little to no benefit.",
				"added": 1562159850
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_399_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You dream a world without pain, this world is painfull.Be a Man Stand up and stop Whining.\n\nWho doesn't dream of a world without pain, no one likes pain those who say they do do not feel pain in the same intensity but it does serve a purpose, getting you out of trouble. Anyway, I don't get where you get the idea from that @atomiserxenolith wants a world without pain, he never said anything like that and stop being so off-topic.",
				"added": 1562166582
			},
			{
				"comment_id": 9,
				"body": "> [toyata](#comment_64_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Exactly this. ZN needs to restructure and open up the possibility to truly clone a zite/application and fully allow continously access to a set of data, much like any music player or book reader can access independently the same songs or ebooks to play or read and add meta-data to it that is then only relevant in the apps own context. [...]\n\nIt's a good way moving forward. An example would be moving all ZeroTalk websites (which have the same database schema) to something like:\n\nhttp://127.0.0.1:43110/ZeroTalk/<address>\n\nAnd the client will have full control over the ZeroTalk application, how it looks and behaves. Much like ZeroMe works but without having to declare it as a merger site.\n\nEdit #1: Or simply http://127.0.0.1:43110/forum/<address> for all forum-like websites on ZeroNet, and http://127.0.0.1:43110/gallery/<address> for all gallery-like websites, http://127.0.0.1:43110/mail/<address> for all mail-like websites.\n\nEdit #2: Or of course, keep the current structure and change the user interface according to the site but still have http://127.0.0.1:43110/forum/ to access all downloaded ZeroNet forums for example.",
				"added": 1562168301
			},
			{
				"comment_id": 12,
				"body": "> [toyata](#comment_65_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Just curious: Can you demonstrate how you rebuild any of the important zites incl. content from a backup? Thats the whole purpose of a backup vs. starting with an empty zite or empty ZN from scratch, which anyone can do already from the code on github.\n\nDownload the .zip file (from the menu besides the site in ZeroHello), extract .zip file into your data/ directory and access it.",
				"added": 1562169614
			},
			{
				"comment_id": 14,
				"body": "> [filips](#comment_54_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Is Namecoin really dead?\n\nI've heard some time ago that there's a party which has control over more than 51% of the network which makes it not secure any more.\n\n>without ZeroName which is controlled by @nofish.\n\nThat will require ZeroNet users to run their own Namecoin nodes.\n\n>I don't think PoW is good solution.\n\nIt does have its drawbacks, but I think the option should be given to site developers.",
				"added": 1562170059
			}
		],
		"1562163868_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "+1 thanks man.",
				"added": 1562164232
			},
			{
				"comment_id": 3,
				"body": ">Should (what?) regular zeronet layman user do about this?\n\nWait for @nofish to approve these changes and be pulled into the main repository, then wait for a new update.",
				"added": 1562165185
			},
			{
				"comment_id": 17,
				"body": "From [@nofish on GitHub](https://github.com/HelloZeroNet/ZeroNet/pull/2068#issuecomment-508551809)\n>It's not just about cpu, but bw: torrent trackers requires separate request for every site, for zero trackers you can announce multiple sites in one request.\n>So if you have 100 site you need to send 100 request every 20 minute for every torrent tracker.\n\nI've run into trouble trying to download thousands of sites from ZeroNet and I've identified Torrent trackers as being the main bottle-neck, I didn't actually know zero:// where that much ~~different~~ better than Torrent trackers but knowing this I think the sharing of udp:// and http(s):// Torrent trackers is not necessary if zero:// trackers are already being shared among peers.\n\nMaybe the first point of the pull request (sharing of Torrent trackers) can be omitted and still be merged?\n\nThanks a lot by the way @nofish you're doing a wonderful job",
				"added": 1562337304
			},
			{
				"comment_id": 18,
				"body": "Hm, maybe Torrent trackers can still be shared among peers but not used unless zero:// trackers don't work? I think @nofish wants to phase out support for Torrent trackers and move to zero:// trackers.",
				"added": 1562339246
			},
			{
				"comment_id": 19,
				"body": "Agreed, it doesn't change stuff too much and might actually help the network. But I think zero:// trackers should be prioritized somehow, and only a limited amount of trackers should be used because it is true that Torrent trackers require much more bandwidth if you're seeding many sites.\n\nIs an announce every 20 minutes a requirement for Torrent trackers? Or can it be a few hours or something?",
				"added": 1562340529
			}
		],
		"1562139016_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Hope you'll become less dependent on medication and find freedom. My brother is in a similar boat, doctors are much too liberal in prescribing heavy medication.\n\nI dislike What3Words by the way, it is a proprietary service for converting words to coordinates which is completely unnecessary and if you only slightly alter one of the words by adding a \"s\" you'll end up somewhere completely elsewhere.",
				"added": 1562165990
			}
		],
		"1562167089_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 6,
				"body": "Alex Jones wasn't censored, after the massive announcement that he got removed from YouTube almost everyone has heard about the man. That's not how censorship works.\n\nIt is true that Google (+ YouTube) is censoring though",
				"added": 1562167244
			},
			{
				"comment_id": 8,
				"body": "> [xcape2net](#comment_83_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The article is not talking about Alex Jones being censored.  It's talking more generally about how Google censorship works across the entire internet.\n\nTrue. If you want to disable this yourself you can uncheck the \"Block dangerous and deceptive content\" option in Firefox.",
				"added": 1562168147
			},
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_84_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Thanks.  I didn't realize Firefox was doing it too.  Browsers don't give you enough information for you to know what boxes like that mean.\n\nFirefox has been getting worse and worse over the years while advertising that they're doing and caring more and more. Mozilla has been active in the fight against \"fake news\", whatever is deemed \"fake\" by them of course.",
				"added": 1562169118
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_733_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Since this is happening at the browser level, that means this is a threat to ZeroNet and IPFS. [...]\n\nThey'll have to block 127.0.0.1, ~~all jokes aside~~ I can see them blocking `zeronet.io` or other applications to circumvent censorship, Google has full control over these SafeBrowsing lists.",
				"added": 1562169323
			},
			{
				"comment_id": 13,
				"body": "> [styromaniac](#comment_734_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They might find a way to detect it. Fingerprinting ZeroHello and WebUI, perhaps. [...]\n\nTrue, there are more ways to block ZeroNet, even on 127.0.0.1",
				"added": 1562169748
			}
		],
		"1562167519_1G5aYYLCYtwKYfnnvLUTNVDC5kmy8RP7D7": [
			{
				"comment_id": 7,
				"body": ">I'm very upset about what they did.\n\nIt is only a small part of the protestors that did that but it won't help them I feel. [China Uncensored](https://invidio.us/channel/UCgFP46yVT-GG4o1TgXn-04Q) is doing a good job covering the protests, though they could go more in-depth.",
				"added": 1562167734
			}
		],
		"1546089919_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 15,
				"body": "You can check how this ZeroTalk does it here:\n\nhttp://127.0.0.1:43110/raw/Talk.ZeroNetwork.bit/data/users/content.json\n\nUnder `permissions` you can set the allowed size to `false` which will remove the users content\n\n>  \"permissions\": {\n>   \"1pgallery@zeroid.bit\": {\"max_size\": 100000},\n>   \"a7s7c7u6df77r4d6@zeroid.bit\": {\"max_size\": 200000},\n>   \"akito@zeroid.bit\": {\"max_size\": 400000},\n>   \"ancap@zeroid.bit\": {\"max_size\": 112500},\n>   \"anonymouslogin@zeroid.bit\": {\"max_size\": 400000},\n>   \"antyhrabia@zeroid.bit\": {\"max_size\": 100000},\n>   \"atomiserxenolith@zeroid.bit\": {\"max_size\": 100000},\n>   **\"authhh@zeroid.bit\": false,**\n>   **\"bad@zeroid.bit\": false,**\n\nEdit: see http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/content_json/#user_contents",
				"added": 1562243675
			}
		],
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "Google also makes their reCAPTCHA much slower in Firefox than in Chrome:\n\nhttps://grumpy.website/post/0RzW4elEN\n\nhttps://news.ycombinator.com/item?id=20147015\n\nEdit: though this is only one example, not really definitive.",
				"added": 1562246960
			}
		]
	},
	"comment_vote": {
		"82_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"64_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"1278_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1276_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"80_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}