{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1542120449,
			"title": "kB limit on Zer0Talk",
			"body": "So I've noticed the kB limit on Zer0Talk is 50kB, is there any way to increase this? Or do I have to create a new identity when I hit this limit?\n\nThis limit is there to keep the total size of the zite down, but we could allow people to post unlimited messages by splitting them in multiple files and only sharing the most recent 50kB-max file. Optionally download everything for users you \"follow\". Or something along those lines.",
			"added": 1542120448
		},
		{
			"topic_id": 1542488436,
			"title": "Some zite development questions",
			"body": "* Is it possible to split content.json up into multiple parts? I have tons of optional files, I'm talking millions of files, and I don't really want to have to sign those in one go whenever a couple of them are changed or new ones added.\n* Is there a way to rename a file for download? html normally has <a href=\"original\" download=\"renamed\">, but this doesn't work in ZeroNet.",
			"added": 1542488434
		},
		{
			"topic_id": 1547571350,
			"title": "Anyone from ZeroNet going to FOSDEM 2019?",
			"body": "I'll be going there for both GodotCON and FOSDEM. There'll be a \"decentralized internet and privacy\" that I'm particularly interested in, and I imagine others here might be as well.\nhttps://fosdem.org/2019/",
			"added": 1547571347
		},
		{
			"topic_id": 1547686155,
			"title": "ZeroNet DBSchema feature request: insert list size into db",
			"body": "given a json:\n```\n{\n  \"vehicles\":[\n    \"car\",\n    \"bicycle\",\n    \"bus\",\n    \"boat\",\n    \"train\"\n  ]\n}\n```\nI would like to insert into the db table `| vehicles | 5 |` instead of inserting all items and then counting them.\n\n@nofish",
			"added": 1547686151
		},
		{
			"topic_id": 1552677563,
			"title": "Big files not loading?",
			"body": "I've got a 22MB file in my content.json but when I load it on another pc every file except that single one is downloaded fine! Am I doing something wrong?",
			"added": 1552677558
		},
		{
			"topic_id": 1553123831,
			"title": "Working on a File Deduplication Plugin for ZeroNet",
			"body": "Hey peeps here on ZN!\n\nI really like the idea of file deduplication for zeronet, making it a bit more like IPFS (but better!) So I've been studying the ZN code and I think it should be possible to make a plugin to do so, but I could definitely use some help from others here who've been here longer.\n\nWhy?\n* This will make moving from old zites to new forks/alternatives easier! Now we have KopyKate, Youtube, KxoVid and several other videohosting zites and that's great! But what's not is that if you want to make your video available on all these zites, you need to have that many copies on your drive (or you could ln them, but let's be honest we aren't going to diligently do that because we're lazy like that).\n* This could even make it possible to have a zite where you can upload a video to all networks AT THE SAME TIME. But that's not going to happen any time soon...\n* Keep files alive/available for longer\n* Save space, duhh!\n\nWhat am I proposing?\n* File deduplication serves no purpose for small files, so for starters let's limit it to bigfiles.\n* An option to include smaller files of certain filetypes (e.g. only images, music and video) for those who want. It would be pointless to store json files because those are highly unlikely to have doubles on ZN.\n* Optional folders to scan (read-only), hashes found there will not be downloaded and can be seeded directly from their location.\n* If a double is edited locally, write it to the other location (we don't want to edit both!)\n* A big button to look for duplicates and remove one of them.\n\nWhat is working so far?\n* After (manually) deleting duplicated files, they are still locally accessible as long as there is one copy in location (or other zite).\n\nLooking for suggestions on:\n* How do we handle owned zites? We need to stop non-optional files from getting removed from content.json when signing (because they're not really there) do we do db lookups when signing as well, or just exclude it for ease?\n* When deleting doubles, which one? The one that isn't in an owned zite I propose. Any other things to keep in mind when deciding?\n\nLooking for documentation(/a friendly explanation by someone more knowledgeable) on:\n* How the ZeroNet server works, how and where is it configured.\n* How does the whole torrenting thing work? Is it possible to look for peers based on the SHA512 without first going to the zite pool?\n\n**I'd love to hear what people think about this!** Is it pointless? Harder than I think? Why don't we just use IPFS? etc. Let me know.",
			"added": 1553123825
		},
		{
			"topic_id": 1592264885,
			"title": "The protests are a puppet show, but we're not the audience",
			"body": "The point isn't to challenge the system, as the system could just crush it if they thought there was any danger. The point of protesting, in the modern sense, is to *buttress the establishment* by building up a mythological backstory around any change the system wants to make so that future generations have a context for those changes that is difficult to deconstruct, rather than a rational one which may be easy to deconstruct if the reasoning is flawed. Future generations will be told stories about how everything was bad in the 20's, until the brave protesters forced the state's hand, and that is how these new laws were passed, and *you*, for wanting freedom and challenging these laws, *must want to send us back to a time of bad*.\n\nPeople will then look at the media records from today and will see that yes, there *was* in fact all of these problems, and yes, there *was* in fact all of these protests, and yes, there *were* in fact changes following them.\n\nThey will not have the experience to question the narrative of today's press, and they will not be able to study the context. The dissenting opinions standing up against the media now will by then have 404'd from the internet, unlisted by Google, removed from Facebook, Twitter and other social media that stood the test of time. The internet archives have gone, sued by the press over copyright infringement, and pressured by activist organizations and social media mobs for spreading misinformation and giving a platform to bigotry. There will be traces left, here and there, blog posts and amateur's archives run over anonymous networks, but few will stumble upon them as the tech giants route all traffic to their verified, trustworthy partners.\n \nAnd so they will get sucked into the fairy tale.\n\nRepealing unpopular laws will be impossible, just like how the laws surrounding Holocaust denial are untouchable, even though they fly in the face of the freedom of expression the West proclaims to support.\n\nOf course there will be those that try. They will privately send compilations of distorted jpeg's recompressed as webp's to those they trust, accompanied by pdf copies of defunct websites full of broken links. All of this supporting their claim that today wasn't as bad as the historians say, that the evil caricatures portrayed in the media were cherry-picked from the fringes of society, disliked by all. And their friends will not respond, except for those who will call them conspiracy theorists and beg them to stop.\n\nAnd then there will be those brave few who will stand up for their opinions publicly, and their posts will be marked as unreliable by the bots, if not outright removed. The supporting video evidence they upload, the Federal Bureau of Manipulation will claim, has been doctored and the file's hashes have been added to a database of disinformative multimedia files so that future uploads can be prevented. For their bravery they will be rewarded the prospect of unemployment and friends who shun them publicly.\n\n*Truth must be protected valiantly*, that is the mantra of the bureau, *lest Democracy die in darkness*.\n\nThat is what protests are about.\n\n**It's about protecting the bullshit of tomorrow by building its mythological foundation today.**\n\n**+++ NEVER LET GEORGE ORWELL BE FORGOTTEN +++**\nInternet Archive Censorship: https://reclaimthenet.org/internet-archives-censorship/\nEU proposes Upload Filters: https://juliareda.eu/2018/11/eu-council-upload-filters/\nGoogle results only go up to 10 years ago: http://stop.zona-m.net/2018/01/indeed-it-seems-that-google-is-forgetting-the-old-web/\n**+++ NINETEEN EIGHTY-FOUR WAS NOT A MANUAL +++**",
			"added": 1592264878
		},
		{
			"topic_id": 1602768387,
			"title": "Silicon Valley is Censoring the NYP over the H. Biden Leak, Disappearing Public Posts and DM's, Blocking Users",
			"body": "Among the people who have been blocked over sharing this story are press secretary Kayleigh McEnany and James Woods.\n\nNew York Post:\n[Smoking-gun email reveals how Hunter Biden introduced Ukrainian businessman to VP dad](https://nypost.com/2020/10/14/email-reveals-how-hunter-biden-introduced-ukrainian-biz-man-to-dad/)\n[Hunter Biden emails show leveraging connections with his father to boost Burisma pay](https://nypost.com/2020/10/14/hunter-biden-emails-show-leveraging-connections-with-dad-to-boost-burisma-pay/)\n[Twitter, Facebook censor Post over Hunter Biden exposé](https://nypost.com/2020/10/14/facebook-twitter-block-the-post-from-posting/)\n\nRussia Today:\n[‘Censorship Rubicon’? Big Tech burying Biden-Ukraine story either wakes up Republicans or drives nail in their political coffin](https://www.rt.com/op-ed/503541-tech-censorship-biden-story/)\n[Twitter BLOCKS sharing links to NYPost’s Hunter Biden emails story, invoking ‘HACKED MATERIALS’ policy for first time ever](https://www.rt.com/usa/503531-twitter-bans-share-biden-nypost/)",
			"added": 1602768379
		},
		{
			"topic_id": 1610162257,
			"title": "Free Speech in the COVID-era is Doomed, Long Live Censorship-Resistance",
			"body": "The People are not allowed to assemble to practice their First Amendment rights, so we can only communicate using the internet, and now Silicon Valley is going into full crackdown mode on top of that.\n\nIf you are here on ZeroNet, you probably already realized that Free Speech is dying, and you want to hold on as long as you can. Until today I didn't realize just how important networks like ZeroNet will be, nay, already are.  How often haven't I heard people argue that \"these companies can do what they want, because they're not the public space, if you want free speech, go to a public park or the town square\". But the government won't allow us to assemble and air our grievances to one another. The only outlet many of us have is through the internet, and for those who are not tech-savvy enough to know about or discover ZeroNet, nor any of the clearnet alternatives like Minds, Parler, Gab, etc. that means Free Speech is effectively already dead.\n\nFacebook and Twitter will quite literally scan your private messages for banned links and *not* send them to your friends. Maybe you're sending your friends e-mails, but oh wait, you signed up with Gmail or Hotmail and considering the positions of their parent companies how long will it take until they start blocking your e-mails because you were critical of a vaccine, or an election?\n\n> “That rifle on the wall of the labourer's cottage or working class flat is the symbol of democracy. It is our job to see that it stays there.”\n> ― George Orwell",
			"added": 1610162248
		}
	],
	"topic_vote": {
		"1539543419_1FPW563k5uv68B4bPRf6gVYpi6tj4mhqSd": 1,
		"1540796902_148DXj745fSuMtCnbh3uJnb3Tm4ZbdabJY": 1,
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1,
		"1544137156_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1547325276_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": 1,
		"1547492603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1547669338_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"1547924891_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1548256806_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1548825111_14uRvph7yp9ZaBRpJMJGZABwVu56N1AMwU": 1,
		"1549299548_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1,
		"1551618955_163wft59zLGW1zNA6WBsppjFEbXxAfAseY": 1,
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1553803052_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1553707562_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"1553796164_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"1554068932_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1556264224_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": 1,
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1557231045_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1557855329_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1
	},
	"next_comment_id": 123,
	"comment": {
		"1540207138_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": [
			{
				"comment_id": 1,
				"body": "How alive is the chinese community with it being banned? I see quite a bit of chinese zites around still, which is good.",
				"added": 1540253432
			}
		],
		"1540357812_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 2,
				"body": "Yup, they are shit.",
				"added": 1540359153
			}
		],
		"1540443278_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 3,
				"body": "We need people on the mainstream social media to spread awareness about these problems and the alternatives that already exist. I took me a long time to discover the existence of zeronet, steemit etc. I'd known about centralized alternatives like Minds and Vid.me (RIP) but even in those circles of people actively looking for alternatives, the decentralized internet is little known about.",
				"added": 1540474941
			}
		],
		"1540796902_148DXj745fSuMtCnbh3uJnb3Tm4ZbdabJY": [
			{
				"comment_id": 4,
				"body": "prettyfication of zeronet urls is already a thing using .bit addresses! look at e.g. http://127.0.0.1:43110/ZeroLSTN.bit\n\nBrowser extension would be great, would make it a lot easier for normies to join.",
				"added": 1540820000
			},
			{
				"comment_id": 5,
				"body": "> [timelinehyperbot](#comment_6_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): What makes you think I'm a dude? ... And also what exactly are you babbling about!?\n\nDon't be so touchy. On the internet everyone is a dude.\n\n> [0033300](#comment_7_1JwAJqcH78mtHGwLHyQZ5jvi5si8kJDeq9): there is no future. [...]\n\npretty much, and it's biologically and politically impossible to stop. Science was a mistake that religious dogmatism protected us from. It's the real pandora's box and we should never have touched it.",
				"added": 1541002235
			},
			{
				"comment_id": 6,
				"body": "> [timelinehyperbot](#comment_7_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): I'm not touchy, but what is with your pandora's box speech...  The Sky is falling, the Sky is falling!!! ... Ok I get it but what are you going to do to make a better World!?\nThen what is with the \"oh no someone assumed my gender on the internet!\", that sounds pretty touchy to me.\n\nIt's too late, matey. Could pull a unabomber, but that's not going to make the world a better place, now is it? Better to just march on to our demise with open eyes. I myself live a low-impact life: local produce, no traveling, as little plastics as possible, no modern medicine unless absolutely necessary, etc. but there's no way enough people in the world will return to a more traditional and modest way of life. Instead the third world will adopt the degenerate customs of the West and consolidate the destruction of our planet. And that's just on the environmentalist side of things, politically things are fucked too, but they're tied together because governments will abuse the destruction of earth to turn citizens globally more and more into slaves. They won't be able to solve the problems, because that's not in the interest of their corporate sponsors, but they'll damn well use those problems to scare us into submission. Same way with immigration: is it going to destabilize the world? Yes. But corporations like the lowered wages. What people need to realize is that all political parties are cucks: they're all just cucks to different wealthy interests.\n\nI'm not trying to blackpill people. Don't give up. Fight with what you've got. But realize that you've probably been fighting someone else's war, and that in the meantime your own battles are being lost.",
				"added": 1541021572
			},
			{
				"comment_id": 8,
				"body": "> [0nigga](#comment_2_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4): we must be radical. fight the peoples' enemy: the rich fucks ! kill capitalism and its proponents\n\nHello there, bio-luminescent CAI niger, how is your day? How many insane people have you been able to convince into attacking the USA for your puppet masters? You sound desperate for another attack, were the unaboomer and synagogue attack not enough for your agenda?",
				"added": 1541033250
			}
		],
		"1541031054_1ByuWDrDpJKEB5WbR7Dw4CUT1pw5DXKxgU": [
			{
				"comment_id": 7,
				"body": "This isn't censorship, the owner - or someone with access to their computer - took the site down. When more people are using ZeroNet such things will become more difficult because people will be archiving/cloning sites more. Automatic archiving could be an interesting feature to implement, but most people don't want to set the required diskspace aside, so it should be opt-in only.",
				"added": 1541032835
			},
			{
				"comment_id": 9,
				"body": "Doesn't Beaker/dat do something like that?",
				"added": 1541102754
			},
			{
				"comment_id": 10,
				"body": "> [ornataweaver](#comment_40_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): I don't know. I'm not a professional programmer yet.Do you have any connections there? Thanks\n\nsorry, I was replying to styromaniac, i.e. git-based site history. I didn't like the beaker browser though, it ate my cpu unlike any other browser.",
				"added": 1541103631
			}
		],
		"1541198461_1Kf2cdzcgFuSA2o5X4t9tFMjT4KYKzN7YP": [
			{
				"comment_id": 11,
				"body": "like-ish: Beaker/dat, SafeNetwork, IPFS, Freenet, Solid\nFreenet is old, but it works. IPFS and dat work, but they have no anonymity or pseudonymity. SafeNetwork and Solid are in development and not ready for use.",
				"added": 1541211564
			}
		],
		"1541232786_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 12,
				"body": "hello there CIA, I wish you the best in your subversion tactics",
				"added": 1541275030
			}
		],
		"1541289967_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 13,
				"body": "> [advocatusdiaboli](#comment_3_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb): https://www.imdb.com/title/tt1219827/ https://www.imdb.com/title/tt6499752/ ?\n\nFor lazy people, that's Ghost In The Shell (2017) - (watch the anime instead) and Upgrade (2018)",
				"added": 1541293067
			}
		],
		"1541360464_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": [
			{
				"comment_id": 14,
				"body": "I really like the idea in principle, however in practice it's old software that has had a long time to catch on, and it just hasn't. It's slow, it isn't user-friendly (eg. you have to manually install plugins to get the best out of it), I've given it a try, but unless they give it a makeover I don't think it has any chances of ever gaining popularity outside of a fringe group of nerds.\nBeaker/dat is probably one of the projects doing the best publicity-wise, reaching even the ears of people who know little about tech -- I personally hope they don't win out, although I've got to hand them something: you only host websites you \"bookmark\" and you can browse earlier versions of those websites. They also use dat:// urls (which looks better than ZNs localhost:port/url, but it requires their special browser while we can use any browser we want. It's very similar to ZN apart from that.",
				"added": 1541380401
			},
			{
				"comment_id": 19,
				"body": "> [jaggedelectrons](#comment_5_16B6aFfFUjn2hchrBDuvSFgUymhbQMGJrS): If I seed a few videos on KopyKate [...]\n\nThere you have it, you chose to download and seed those. You didn't download them and keep them by default to seed until you manually removed them. You expressly chose to download and seed them.\nI would prefer the same be true for zites. Sometimes I click a link out of curiosity and I will never ever visit that zite again, and I may not consider it worth sharing. I would feel more comfortable if ZeroNet just forgot about that zite when I leave rather than me having to remember to delete it.\n\nAnother thing I have been wondering about, and that I am slightly worried about is the following:\nIf I happen upon a zite hosting illegal content, I can delete that zite and move on -- no problem there. If I happen upon a zite that just looks dull (e.g. \"This EPIC site is in development, keep the url and come back in a month\"), but secretly has non-optional files with illegal content *I won't know about it, but I will still be hosting it!* This could potentially be abused to have people unwittingly host illegal files <10MB, which isn't much *but still enough to cause serious trouble.*\nThis seems to me to be a serious flaw in the system. I can live with it *existing* on the network -- that's inevitable. I can live with parts of it existing in encrypted storage in my freenet drive -- that's necessary for the system to operate. But *I don't want to have to explain to police why it's on my harddrive.*\n\nI won't quit using ZN over this, but it is an issue that should be discussed.",
				"added": 1542119850
			}
		],
		"1541554639_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 15,
				"body": "I believe under the current system, yes.\n\nZeroNet should introduce an IPFS-like cross-site filesystem where it doesn't even matter on what site the file is hosted. Or ZeroNet+IPFS packed together.",
				"added": 1541560491
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 16,
				"body": "Morals are gay. Nature will always prevail, and nature does not follow any moral code, only what works and what doesn't. Western morals don't work and will collapse. The Islamic morals are stronger -- not perfect, but they don't have to be.\n\nI have preferred morals, ones I would prefer to live amongst -- but I don't believe those morals are true, or the best, or anything of the sort.",
				"added": 1541628938
			},
			{
				"comment_id": 17,
				"body": "> [sheendocks] One of the things I dislike about ZeroNet is that with the added anonymity it gives people a cover to be shameless and post some very base material (I'm looking at those of you uploading child abuse).\n\nI still find it a hard pill to swallow, but it's the price to pay for free speech, and by extension truth, and I'm willing to pay that price. Take liveleaks, it's a very important sort of service for exposing horrible violence and accidents that would be wiped from almost any other site -- and some of which would be illegal to post online in certain countries! A lot of it is disgusting and I can't stomach to watch it, but I'm glad it is out there to document e.g. the horrors of ISIL, or the US army killing innocent people.\n\nI don't really think you can compare that to child abuse, but once you rationally accept the importance of anonymity and a person's ability to post content that goes against societies sensibilities -- and possibly laws -- there's just no way around it: *anonymity as an option is necessary in the pursuit of truth*. The best you can do is shield yourself from content you object to (blacklists), and link the material to the authorities if it is illegal in nature so that they may identify the perpetrators.\n\n*Refusing to adopt anonymity-capable systems like ZN will do absolutely nothing to hurt abusers.* However without wider adoption of such technologies the consequences for the people will be severe, with our more and more authoritarian governments. The idea that governments will arrest you for saying mean words on the internet would've been crazy 10 years ago -- now that's normal! Europe has been looking at China's GFW drooling -- and I'm not pointing fingers at any one side: left, center and right all desire the power to censor dissidents (generally more among the left though).",
				"added": 1541640130
			}
		],
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 18,
				"body": "peeps: The internet is getting censored, let's develop a decentralized network that governments can't censor so we can circumvent the GFW, Art13, etc.\n\nn00b: Hey, nice decentralized platform you got here! How ’bout we start censoring peeps so it will be even nicer?",
				"added": 1542045953
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 20,
				"body": "A couple of Debian-based distros.",
				"added": 1542280612
			},
			{
				"comment_id": 21,
				"body": "> [ornataweaver](#comment_60_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): What about those who come from mac?\n\nfor those who come from a mac there is Ubuntu and elementaryOS",
				"added": 1542370396
			},
			{
				"comment_id": 28,
				"body": "> [goberman](#comment_1_1FSzPYgTxNnJcZAA8y4j2YJnqLaAptzPK2): LINUX IS AN OS FOR DUMMIES, AND IT IS ILLEGAL. VERY FEW PEOPLE USE LINUX AND I HOPE THAT NO ONE USES IT. LINUX IS BAD BECAUSE IT IS FOR DUMMIES AND NO ONE SHOULD USE IT. I DON'T USE LINUX BECAUSE WINDOWS 10 IS 100% MORE PROFESSIONAL. LINUX ISNT EVEN PROFESSIONAL AT ALL. I ASKED AROUND AND ALL OF MY 500+ FRIENDS AGREE WITH ME!!!\n\n1/10 obvious troll is obvious",
				"added": 1543064155
			}
		],
		"1542373888_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 22,
				"body": "> [thunder33345](#comment_327_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): quit jerkcircling microsoft/github >>_**loli**_<< would say it's more of crappy designs or just who registers account without looking at where they typed?? [...]\n\nOften the littlest things are the funniest xD",
				"added": 1542391406
			}
		],
		"1542488436_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 23,
				"body": "> [trenta3](#comment_37_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Concerning the splitting of content.json I think you could use the \"import\" directive: look at some example with user data, these usually import another file named content.json that is in the folder data/users. You could use the same syntax to import files in the same directory with different names e.g. optional-1.json, optional-2.json, etc. [...]\n\nThank you I will try that.\n\n> [mea](#comment_1_1NxwuqmLNiF2K8djAP56uxATgi3xDhRi3V): I believe time to sign is not related to total size, but is related to number of files. Would have to test this though. Files are signed independently and shouldn't be signed again unless changed, but the sha's have to be aggregated afterwards somehow to show these are the valid files according to the zite owner. If I'm not mistaken this would mean a lot of small files will be slower to sign than a couple of big files, if only one of them is changed. Would like some input from someone more experienced though.\n\nCan anyone confirm/deny this?\n\nDoes someone have an answer to my second question?",
				"added": 1542544252
			},
			{
				"comment_id": 24,
				"body": "> [kai0](#comment_717_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 多做几个站点不就解决了\n\n\n> [Google Translate]() Doing more than one site will not solve it.",
				"added": 1542548211
			}
		],
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 26,
				"body": "Their centralized approach is a fatal conceit. They get shut down, are forced to remove things because of payment providers, cloudflare, registrars, etc. bullying them into doing it. Why go halfway by getting rid of SV Tech, and then jumping on board with something that will end up not dissimilar if given enough time. If people had switched to decentralized networks in every exodus from mainstream social media that I've seen, these things would've been huuuge by now.",
				"added": 1542874257
			},
			{
				"comment_id": 33,
				"body": "> [nekololi](#comment_311_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): the attacker in question would have to either be a site's owner, or a rogue individual who has somehow secured the site's private key. but either type of individual could perform this type of attack. i've always wondered how easy it would be for someone to make a bunch of fake sites, get them seeded by people, and then flip a switch and change the content of their sites to be illegal, getting loads of people to seed illegal content.\n\nI've wondered about that as well, made a post about it about a week or two ago actually.",
				"added": 1543362045
			},
			{
				"comment_id": 35,
				"body": "> [vorticalbox](#comment_9_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L): [...] To me to seems like the bigger networks were trying to force out the competition.\n\nProbably because that's what it is, in combination with the political gain from collectivising guilt by those in politics and in the media.",
				"added": 1543622560
			}
		],
		"1542946258_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 27,
				"body": "\\>  Privacy does not seem to matter very much to Twitter. \n\n\\> I also have HUGE lists of TWITTER USERS by first name, sex, city, and state should I create lists and sell them for some CRYPTO?",
				"added": 1542970780
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 29,
				"body": "> [advocatusdiaboli](#comment_6_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb): nah, people will complain but will do nothing, article 13 is just to harsh today so sugar is needed so it can be sold to the people and in few years this version will be implemented, youtube dint ask for removal of article 13 but wanted a \"fair\" article 13, what means fair in this context? :thinking:\n\nI'm still puzzled as to why Youtube is siding against Art. 13, as it would solidify their monopoly on a legal level. I'm guessing they realize you'd basically get a black market in \"memes\", and they fear it may get popular enough to rival them. (I use memes here jokingly, it'd be much bigger than that: remixes, parodies, commentary videos, etc. would all move to whatever 'illegal' platform manages to take advantage of the situation.\n\nCan't imagine what the politicians in Brussels think they're going to achieve with this... But I think they're jealous of China.",
				"added": 1543067092
			},
			{
				"comment_id": 31,
				"body": "> [tomasz21](#comment_21_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): [...] You need to popularize and advertise among your friends.  [...]\n\nIt won't work unless there's more content. I've introduced ZeroNet to friends and family, they shrug and never use it again because there's barely any content to keep them here. They'll trickle back to farcebook, twatter and plebbit. Until there's something here that they can't easily access elsewhere. Sure Art 13 might bring that, but chances are they'll still be able to find copyrighted material on the clearnet in the EU.",
				"added": 1543345850
			}
		],
		"1543163412_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 30,
				"body": "Hey there! Nice read! The technical side of your writing style could use some improvement, but content is much more important, so don't let that get you down. I hope to read more in the future!",
				"added": 1543189483
			}
		],
		"5_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 32,
				"body": "I would really like to see I2P integration, thread on github appears to be silent since august, does anyone have more information on what's happening on that front?",
				"added": 1543360849
			}
		],
		"1543527038_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 34,
				"body": "> [timelinehyperbot](#comment_42_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): I am guessing approx 1,000 people...\n\nIt's definitely more, I've seen over 1000 peers at once ... though rarely.",
				"added": 1543592197
			}
		],
		"1543327932_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 36,
				"body": "> [vorticalbox](#comment_10_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L): I had a problem with this package today at work, it's not one of our dependants so must be used by a package. [...]\n\nAs long as your work isn't cryptocurrency related, monday is probably going to be not that bad.",
				"added": 1543622738
			}
		],
		"1543694585_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q": [
			{
				"comment_id": 37,
				"body": "Hi there FBI, how's the fish biting today? Or are you a journo looking for a scary tech story to write? You never know these days.",
				"added": 1543703575
			}
		],
		"1543487242_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 38,
				"body": "A flashcard/voc trainer zite. Yeah, yeah there's plenty of great one's out there like Anki, I just like the idea of having one on Zeronet.",
				"added": 1543706754
			}
		],
		"1543748747_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 39,
				"body": "> [timelinehyperbot](#comment_77_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): [...]\n\nRead up on your cryptography. You're clearly misunderstanding what leftside is saying here.\n\n1) recipient broadcasts public key to everyone\n\n2) On sender's side: `cleartext + recipient public key => cyphertext`\n\n3) On receiver's side: `cyphertext + recipient private key => cleartext`\n\n> [timelinehyperbot](#comment_74_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): \"Let's make a public-key-encrypted text that only the paired private key owner can read.\" ... Your comment. [...]\n\n... The private key owner has to give you a paired public key. leftside made that clear...",
				"added": 1543756810
			}
		],
		"1543748754_17AsJmsopmitbtFzeEKZz9H7KBccu8rQQW": [
			{
				"comment_id": 40,
				"body": "Tim Pool video about what's happening:\nhttps://www.youtube.com/watch?v=PHVyXN4mqSU",
				"added": 1543785077
			}
		],
		"1543791956_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 41,
				"body": "not as far as I know, but if someone knows more I'd be interested too",
				"added": 1543792083
			},
			{
				"comment_id": 42,
				"body": "If you're not shy to use the lamenet, oldnet, clearnet, whatever you would like to call it, I recommend Quilette and Spiked. FIRE is not really a \"news\" site, but they have some interesting articles. If you don't mind videos, Tim Pool does independent \"journalism\" (_it's just, like, his opinion, man_), he's certainly not always worth your time.",
				"added": 1543875769
			}
		],
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 43,
				"body": "Nooooooo! I don't want tumblerers to migrate here. Anything but them, lol.\n\nNah, anyone's welcome here of course.",
				"added": 1543938153
			},
			{
				"comment_id": 44,
				"body": "> [thunder33345](#comment_349_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i could care less if they migrate here or somewhere else, though new users are welcomedi have a feeling it's because pressure by apple that forced their hands to do that,as their app was de-listed off appstore for containing [child] porn\n\nI seriously doubt Tumblr has that much of a cp problem, considering how easy it is to get banned from there for other things. I suspect there's another reason they got singled out by Apple. Anyone remember Candid? They used to have a bit of a cp problem, but I don't remember them getting delisted. Harmful Opinions did some good reporting on that. And why are there other places like twitter that do allow porn but don't have a problem according to Apple? Clearly banning all porn is not necessary to stop cp, then why do Tumblr think so?\n\nThis all sounds rather fishy to me.",
				"added": 1543978526
			}
		],
		"1544189569_13pMUCyHCSA16YYxki54Zh8FCv6qL18pcP": [
			{
				"comment_id": 45,
				"body": "> [anonimoose](#comment_8_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): doesn't it auto seed each website you go to? E.G number of seeds is roughly equal to number of users.\n\n_online_  users, half of them may have turned their pc off and gone to bed, another quarter may have turned off for other reasons... so not really.",
				"added": 1544192951
			}
		],
		"1546528946_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 46,
				"body": "what do people think of a sort of Steam alternative using ZeroNet? As in: an interface to download, manage, rate, and interact socially in games (find other players, share tips, etc.) Maybe even linked to a mod database where you can download and install with a simple click?",
				"added": 1546637183
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 47,
				"body": "> [quantumworld](#comment_117_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Build everything on Zeronet. The traffic and users will follow. They are censoring right wing and left wing now. Perfect timing for zeronet. You cant get a better situation to grow this network.\n\nThis. The growing climate of censorship will lead to increased interest in censorship-resistant technologies, but don't let that lead you to inaction! There's still much to be done! As clobersontheman said: explain the importance of such technology and how it works to friends and family, and help foster a welcoming community on ZeroNet for newcomers. Original content, either mirrored (by author or endorsed by author) or even exclusive content, would be a great boon. One major selling point to OCs is that there's little competition on the network and their name will be immortalized in the history of ZeroNet. (If ZeroNet fails to become \"the\" censorship-resistant network of the future that might not mean much, ... but there's got to be creators willing to take the risk!",
				"added": 1546644372
			}
		],
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 48,
				"body": "Well, what are you waiting for? You can start building one today!",
				"added": 1546864106
			}
		],
		"1547147759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 49,
				"body": "Well, I don't know about you, but I sure get high sniffing pulverized birth control pills... So you're probably doing something wrong.",
				"added": 1547161021
			}
		],
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 50,
				"body": "> [styromaniac](#comment_419_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): China is also economically strong-arming Europe. Upset Xi, lose business. I think China is linked to the EU's Article 13.\n\nI doubt it. I think Europe is looking at China's internet control and wants to move towards it, but I doubt China cares about European internet/copyright regulation.\n\n> I've written one for Gaming On Linux\n\nNice, it's a great site that I've been wanting to mirror to ZeroNet for a while.\n\n> [james007](#comment_202_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Blindly spamming the web about ZeroNet is sure to attract attention, just not he kind of attention we want. If it ever really does take off, the corporations will move in to control us and add spyware through JS Fingerprinting.\n\nSadly this is true. ZeroNet's reliance on JS is it's greatest weakness.",
				"added": 1547253378
			}
		],
		"1547239393_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 51,
				"body": "> [squarezero](#comment_2_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd): I'm not sure we need more buttons. We need boxes. Small, possibly RPi-based boxes, to set to people houses and to serve ZeroNet through transparent proxying. [...]\n\nThat's actually a really good idea! I think I'm going to do that. Is the Multi-user plugin ready for such usage?",
				"added": 1547253614
			}
		],
		"1547266872_1FwDqRAQggNDskwBo4ZLXPWC69tSajS4aX": [
			{
				"comment_id": 52,
				"body": "What is important to me is whether there's unread messages in a thread, I'd love to be able to see that at a glance. Now I need to look at the 'last post' time and recall whether I've clicked on that thread since then.",
				"added": 1547292728
			}
		],
		"1547237684_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn": [
			{
				"comment_id": 53,
				"body": "> [nootnat](#comment_16_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn): pretty rude not helping at all :-(\n\npretty rude insisting like that. ZeroNet is a small but friendly community, be patient: take a break, then come back and see what the responses are. Most of us are not online 24/7.",
				"added": 1547314101
			}
		],
		"1547325276_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": [
			{
				"comment_id": 54,
				"body": "Really nice! Will the game be a browser game, or do I have to download it?",
				"added": 1547327281
			}
		],
		"1547590466_16dA195gn9p2CL9LXgMYSWeHtp7zCBtqiw": [
			{
				"comment_id": 55,
				"body": "> It seems easier to create your own sites, apps in Beaker.\nwhy? is it also actually easier?\n\nWhen I tried BB it was far too resource intensive, ZeroNet can be used with pretty much any browser.",
				"added": 1547606194
			}
		],
		"1547571350_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 56,
				"body": "> [krystof](#comment_8_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX): I'd love to go though I don't think it'll work out. Be sure to spread the word about ZeroFrame at GodotCON ;)\n\nI will, I see the github has documentation now, great! Any progress on getting Godot HTML5 games to work on ZeroNet sites, that's one I'm really interested in. I've looked into the problem a bit and I think what has to be changed is the way that the (js) engine loads the `.wasm` file. It should do so using ZeroNet's API instead of whatever it is doing now.",
				"added": 1547645226
			},
			{
				"comment_id": 57,
				"body": "> [glightstar](#comment_103_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Oh, if there's an error with loading files, I also used a somewhat working fix to the Construct2 stuff by @plasmmer (aka Daniel) by wrapping the exported js that requested the stuff through ajax in the ZeroFrame.getAjaxKey() or whatever..Only a temporary solution tho, or at least one, that would be a bit dumb to use as a \"good\" solution.\n\nSounds interesting, could you explain what exactly I have to do for this? I imagine you're talking about [wrapperGetAjaxKey](http://zero/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/zeroframe_api_reference/#wrappergetajaxkey)",
				"added": 1547647373
			},
			{
				"comment_id": 59,
				"body": "> [glightstar](#comment_104_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Yes, that's it!Check this out (might take some time to load, because it's quite the big file): https://github.com/ZeroNetPlus/Painter-app/blame/8a877f7661f7e96ab44e1e69b498384de2131629/c2runtime.js#L4066 [...]\n\nI'm going to give that a try then.",
				"added": 1547658571
			},
			{
				"comment_id": 60,
				"body": "I'm getting an `index out of bounds` error now, any idea what that's about?",
				"added": 1547660015
			}
		],
		"1547295582_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 58,
				"body": "> [james007](#comment_207_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): You may wish to try Tox or Jami instead, as each of those implement DHT and encryption without a central server.\nI was thinking Ring, but apparently they changed their name to Jami, that one is pretty good. RetroShare is another one I like, but it's trying to be something much broader!",
				"added": 1547658347
			}
		],
		"1547790597_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 61,
				"body": "> [htgozn](#comment_254_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): I can't believe how many documentaries are entrusted to the 'responsible oversight' of Youtube... It's madness...\n\nWhat's the context of this reply? I can't work it out from the thread. It's indeed a shame though, the sooner we get rid of youtube, the better!",
				"added": 1547940307
			}
		],
		"1547924891_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 62,
				"body": "> [thunder33345](#comment_384_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): what if bittorrent and IPFS cross seeds?yeah if zeronet also cross seed to normal bittorrent i agree it will make everyone's life easierjust cross seed so even a non zeronet bittorrent client can get/send files\n\nthe problem is that if I download a file outside of zeronet that's also shared within zeronet, I can't just \"add it to zeronet\" and help sharing it, I would be adding a distinct copy of that file. ZeroNet should have an alternate purely hash-based way of pooling files that does not depend on the file-path. Hell -- integrate it with IPFS even! We don't have a lot of people here on ZeroNet and that makes seeders scarce, most certainly for older files.",
				"added": 1547947561
			}
		],
		"1547971447_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 63,
				"body": "Are you sure you've signed and published the site? If you edited the content.json since you last signed & published, others won't be able to download it. ZeroNet doesn't always play nice with symbolic links, so that's another thing to check.",
				"added": 1547990885
			}
		],
		"1548012943_14hRA2Pze5PXYZLf8JCm9hknxLZTQ4qGqN": [
			{
				"comment_id": 64,
				"body": "> [nekololi](#comment_332_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i'm the anti christ\n\ndarn, I was hoping I would turn out to be. Now what the fuck should I do with my life?",
				"added": 1548031344
			}
		],
		"1548825111_14uRvph7yp9ZaBRpJMJGZABwVu56N1AMwU": [
			{
				"comment_id": 65,
				"body": "> [quantumworld](#comment_180_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): It's a main stream hit peace against Zeronet. There plan to take down p2p will fail.\nI wish you were right, but if it's mainstream it' probably war and not peace.\n\nAlso asalam alecum, Jihadists! Welcome to our humble abode, may God be with you. Just refrain from fucking the goats.",
				"added": 1549021579
			}
		],
		"1549088626_1CxfctP1zfLgY5SPLXqDBQ4nFzx3HMcEcC": [
			{
				"comment_id": 66,
				"body": "> [pexo](#comment_51_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): jailbait is many things\n\nsure, it could be legal, but op specified \"nude\" -- which means illegal I'm pretty sure",
				"added": 1549237405
			}
		],
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": [
			{
				"comment_id": 67,
				"body": "> [somename666](#comment_5_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): What do you mean stupid? It's very important issue\ntbh I agree. It's sad to see Youtube abandon small creators and welcome in corporations, but it's also inevitable and people should really just be abandoning CorpTube.",
				"added": 1549237558
			}
		],
		"1549374762_14vKDVU55zmwyUm8nuxPoZkh5oYRAF5cje": [
			{
				"comment_id": 68,
				"body": "how about you fuck off",
				"added": 1549377586
			}
		],
		"1549561050_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 69,
				"body": "How do you know who's a real person, and who's a person being paid by the elite to promote their interests?",
				"added": 1549582081
			}
		],
		"1549299548_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 70,
				"body": "> [bananon](#comment_7_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): Wow. No reaction? I was expecting that there are plenty of anti-G.A.F.A.M. people here on ZeroNet.\n\nHey, totally am! Not sure what you're expecting though...",
				"added": 1549930152
			},
			{
				"comment_id": 71,
				"body": "> [bananon](#comment_8_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): Nothing particular. Just be active there: comment, start threads about GAFAM related thoughts and news, post your favorite memes, etc.   [...]\n\none of the main problems for millchan is the lack of notifications",
				"added": 1550008104
			}
		],
		"1550688425_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 72,
				"body": "> [pexo](#comment_64_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): For more info on the current state on I2P see this gitcenter issue. It contains references to all PRs and issues on ZeroNet relating to it. [...]\n\ngood explanation\n\n> [nekololi](#comment_340_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i2p can not adequately replace tor's clear web traffic anonymizing. i2p's strengths and primary focus are on its hidden networks.\n\nthat's not a problem, I2P doesn't need clear web traffic to be useful for ZeroNet. We aren't using Tor's clearnet capabilities either I believe.",
				"added": 1550963617
			}
		],
		"1550937666_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 73,
				"body": "ZeroNet already works. SAFENetwork is an interesting concept, but it's not ready for adoption.",
				"added": 1550963698
			},
			{
				"comment_id": 74,
				"body": "> [zyd](#comment_4_1FHS1qPTQ4MYYxTSY3beoZHYox9AS9YKyG): last time I tried to use SAFE stuff it asked for my e-mail.Threw it out to rubbish bin then.\nThey want to keep it in limited controlled use in the current stage, so that's only temporary.\n\n> [styromaniac](#comment_556_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): SAFE is for private storage and not public storage. [...]\nIt's for both I think.",
				"added": 1551691640
			}
		],
		"1552677563_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 75,
				"body": "> [lavaphox](#comment_11_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): put it to optional maybe ? or have u changed ur site size limit ?\n\nyes I made size limit 50MB so that should be fine.\n\n[Simple Godot Game](http://127.0.0.1:43110/1NAfB7WGPRmHhn8NPLf8fzF4z8WcBLDLt4/)\n\nCan someone test? It's a very early prototype for a shoot-em-up.\nSadly the godot export requires NOSANDBOX permission to run, I'm not sure what the security implications of this are exactly, there's nothing in the documentation about this (this should really be added!)\n\nIt's the webassembly file that doesn't get downloaded on my second pc (.wasm), but ZeroHello says that the update was successful (even though that file is still missing)\n\nEDIT: If it loads, you may need to reload the page for the game to launch, sometimes the screen just remains black. I'm not sure why this is.",
				"added": 1552685143
			},
			{
				"comment_id": 77,
				"body": "I've made it an optional file, and now it works fine, nay great! Thank you for the suggestion lavaphox!",
				"added": 1552692270
			}
		],
		"1552686902_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": [
			{
				"comment_id": 76,
				"body": "wait, aren't videos stored in user directories? how then are they overwritten if they have same hash?",
				"added": 1552687065
			}
		],
		"1553123831_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 78,
				"body": "> [styromaniac](#comment_607_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Make ZeroNet work as though IPFS is built inside. Build in the protocol. [...]\nGreat though that would be IPFS constantly uses bandwidth even if not serving anything so I'd prefer a ZeroNet based alternative.",
				"added": 1553128075
			}
		],
		"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD": [
			{
				"comment_id": 79,
				"body": "Are they? I'd don't like the EU, but this is the first I've heard about them trying to ban Tor so I'd really like to see sources on this. I know France and Germany have tried before and it wouldn't surprise me of the EU either.\n\nIf it's real I imagine this has to do with their draconion new terrorist content regulation proposal. Whether Tor is in there or not, fuck them, the censorious elitist arseholes.",
				"added": 1553258526
			}
		],
		"1553596906_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 80,
				"body": "This will not be doing more good than harm, that much is for certain. One thing the CD will do is make the GAFAM monopolies even stronger in their position. How are alternative tech sites like Minds, Mastodont, Gab, Bitchute, Peertube etc. going to deal with this? Chances are some of them will be forced to outright block european IPs once the directive goes into effect.\nWhat we need to figure out is which MEPs voted for and never vote for them again or for parties that supported this directive like the scummy CDU.\nSadly most people won't notice what freedoms were lost today because they don't wander off the GAFAM plantation anyway.\n\nHow will ZeroNet do with this new directive? Not at all would be my guess. We need to be more worried about the Terrorist Content Regulation, that's more likely to target censorship resistent platforms.",
				"added": 1553610962
			},
			{
				"comment_id": 81,
				"body": "> [4567l](#comment_4_1Lh89nAb4YeizEER15JUcpscy37mZwDUer): \"The Copyright Directive protects freedom of expression, a core value of the European Union. It sets strong safeguards for users, making clear that everywhere in Europe the use of existing works for purposes of quotation, criticism, review, caricature as well as parody are explicitly allowed. This means that memes and similar parody creations can be used freely. The interests of the users are also preserved through effective mechanisms to swiftly contest any unjustified removal of their content by the platforms.\" [...]\n\nYes, yes, bureaucratic bullshit. There is no way for robots to understand fair use, but you need to use robots to realistically remove copyright infringement before it gets posted to comply, therefore the directive is self-contradictory. It don't matter how much bullshittery you tack on at the end saying \"oh, but this won't hurt free speech\". It will.",
				"added": 1553614944
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 82,
				"body": "[Article 13 Cometh (#SaveYourInternet)](https://www.bitchute.com/video/rmO7BdPcmlU/)\nEither Swedish MEP are covering their arses because they know they fucked up, or we actually defeated Art 11 & 13, but -- the EU being a bureaucratic nightmare -- the vote to keep these articles was won because a last-minute change in the voting order had MEPs press the wrong button... either way this really reflects on how poorly the EU functions.\n\nI also particularly like the part where Axel Voss claims \"We're not trying to kill Youtube\" two weeks after saying \"Youtube shouldn't exist\". Not that I like Youtube, it honestly shouldn't exist! But we should not kill it with regulation, and instead starve it of our valuable time and data. Let's move to better platforms.",
				"added": 1553731329
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 83,
				"body": "> [bart101](#comment_12_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8): Zeroblog needs an admin panel similar to the one Wordpress has.\n\nThis is doable, we just need someone to actually do it! *wink wink*",
				"added": 1553816799
			}
		],
		"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 84,
				"body": "> [malladis](#comment_1_18bPiPS2hgoc8pbS8Ku8aoWQ748jfC6vkV): Right, so basically it's impossible to run a site like Reddit/Facebook/Twitter etc. [...]\n\nNot really, you just have to be innovative and split up the data somehow. You could look at RetroShare for inspiration (they have time, trust and \"hub\" constraints for what you download locally). Each subreddit could be a merger (e.g. Millchan Engine as compared to Millchan Classic), you could work with optional files to decrease size (users have optional data.json per subreddit) or you could develop a new python plugin to handle it some other (even better) way if you can think of one. If it's good enough it can then be bundled with ZeroNet by default.\n\nIn the end ZeroNet is and will always be a work-in-progress where people come up with clever solutions as problems arise. Seeing as we're a relatively small community we haven't had many problems with scaleability and solving it has been low-priority (ZeroLSTN has had a scaleability problem though but that has more to do with songs/seeders ratio, this could be solved by dropping songs without seeders from the db but the dev is currently busy doing other things).",
				"added": 1553849613
			}
		],
		"1553905331_1KinYupoFogGajrGGqNr6MmoR6fVJJnwqE": [
			{
				"comment_id": 85,
				"body": "> [nickwa](#comment_77_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Some things on the clearnet is still better. Music is still better listening to on the clearnet. Due to peers sometimes not popping up at all.\n\nSongs without peers shouldn't be listed on ZeroLSTN, that would solve this problem for the most part.",
				"added": 1553945466
			}
		],
		"1553953681_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 86,
				"body": "I automatically got more memory allocated without doing anything.",
				"added": 1553956728
			}
		],
		"1554068932_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 87,
				"body": "Could definitely be done, would be a nice browser plugin.",
				"added": 1554134944
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 88,
				"body": "> [maggy](#comment_4_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C): I couldn't sleep and came up with an ide of a torrent based browser, start to google and discovered that someone have done it but 10X better then i ever could imagine :p.\n\nInstead of making one you can always contribute to this one! But if you just stick around I'll be happy too. I joined half a year ago and it's definitely been getting more active lately, probably because of Art 11 & 13.",
				"added": 1554155736
			}
		],
		"1554165337_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 89,
				"body": "> [styromaniac](#comment_683_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Do you have to fall for every single hoax ever invented?\n\nlook at the date...",
				"added": 1554197880
			}
		],
		"1554657289_1KAfaybmXBh916cDwXjd4gaE7ScnwfiYcR": [
			{
				"comment_id": 90,
				"body": "Or you could use [GalleryHubPlus](/114AZoCSLsZu6Ktfnfu64Uoh8pcdVYFhSX/), it's a more recent remake of the 0gallery hub. Clone it and you can start uploading your own galleries. If it's a SFW gallery you can ask to add it to 1+Gallery recommended galleries as well.",
				"added": 1554663075
			},
			{
				"comment_id": 91,
				"body": "> [dracks](#comment_16_1KAfaybmXBh916cDwXjd4gaE7ScnwfiYcR): @1pgalleryi got an error when add picture [...]\nMaybe try with firefox, might be a browser incompatibility problem.",
				"added": 1554749579
			}
		],
		"1554828532_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": [
			{
				"comment_id": 92,
				"body": "Yes define styles with `.theme-dark (css selector)`. The dark theme is applied by giving the iframe root the theme-dark class.",
				"added": 1554836785
			}
		],
		"1555670435_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 93,
				"body": "I'd understood a merger zite to be the interface merging the hub zites.",
				"added": 1555691016
			}
		],
		"1555665471_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh": [
			{
				"comment_id": 94,
				"body": "as d9s3nlsabl said: torrents work, and unless that changes we probably won't see people move elsewhere (network effect)\n\nthis is probably a good thing too, it's better if they aren't bombarded with negative press (\"we must shut it down, think of the poor fat cats in their ivory towers exploiting small artists, how are they going to make a living with these pirates around\")",
				"added": 1555712045
			}
		],
		"1556096165_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": [
			{
				"comment_id": 95,
				"body": "> why should I use it? there's no one there.\nor\n> I don't want to have to install anything on my laptop just to browse the internet",
				"added": 1556101211
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 96,
				"body": "keep your coc to yourself, don't rape other people with that shit",
				"added": 1556232505
			}
		],
		"1556239872_1E66rhMwgmAZrRqyro9wTSrt8xTAuHJz8d": [
			{
				"comment_id": 97,
				"body": "I think he means ZN itself, you should speak to @nofish",
				"added": 1556268459
			}
		],
		"1556264224_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": [
			{
				"comment_id": 98,
				"body": "not really, but you should read Web of Debt if you really want to get disgusted by banks\n\nalso [How Smartcard Payment Systems Fail ](https://www.youtube.com/watch?v=ET0MFkRorbo) is an interesting watch if you're into that kind of stuff",
				"added": 1556269860
			}
		],
		"1556123202_19DYn6cniSuoTXfWAHkFPDcEtim51Bgg8B": [
			{
				"comment_id": 99,
				"body": "> [anonymouslogin](#comment_243_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What if it was blocked by chinese firewall? Would chinese users be unable to use zeroids? Would registering work for them?\n\nDon't they have to use Tor for ZeroNet anyway over there? You would still be able to reach it through Tor.",
				"added": 1556274845
			}
		],
		"1556246082_1CsKjV1u7nZQTrLhqSysu8Dj4DGqrnx8qL": [
			{
				"comment_id": 100,
				"body": "I have no idea what any of this is about, but any redditfugees are welcome on ZN. I have a reddit account but they won't allow me back in unless I give them my phone number, the dirty dirty private data merchants.",
				"added": 1556377578
			}
		],
		"1556340609_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 101,
				"body": "Looks like we might see another influx in the not-so-far future then. Also @duende, looks like Kaffie put you on his/her blocklist. Not sure why, it's supposed to be for spammers only?",
				"added": 1556378771
			}
		],
		"1556779975_14iCuAn3m8Uz6fkJcu7KEPbHdSR2qmmrH1": [
			{
				"comment_id": 102,
				"body": "ZeroNet already does this for optional files (on ZeroHello Files tab you can select harddrive space ZN can use, either absolute or percentage). Non-optional files are necessary for the zite to operate correctly so you can't get rid of \"old\" ones. The only way to get rid of some of these is to block users (eg. get rid of spam or haters).",
				"added": 1556803553
			}
		],
		"1556802106_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 103,
				"body": "lol, dafuq is he talking about?\nI hope it's just a prank because it certainly sounds like one. I sure want in on those \"ZeroNet premium features\"?\nCan anyone point me to where I can find those?",
				"added": 1556808247
			}
		],
		"1556845763_1AsV7xMgu5zcF66YxZFYUp1utR12MqaRBd": [
			{
				"comment_id": 104,
				"body": "> [klu9](#comment_158_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Zeronauts!\n\nI like it, sounds like zeronoughts as well!",
				"added": 1557184598
			}
		],
		"1557855329_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": [
			{
				"comment_id": 105,
				"body": "> [gtat314](#comment_1_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX): Well... I guess constructive criticism is always welcome :)\n\nHe does that to everyone, nice to someone attempt a completely different style of blogging on here.",
				"added": 1557913101
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 106,
				"body": "Governments are evil, but you don't have to become bad or help bad people to be an anarchist.\n\nPersonally I'm more of a libertarian though.",
				"added": 1557954522
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 107,
				"body": "The GDPR is a [joke](https://www.techdirt.com/articles/20190521/17425842255/one-year-into-gdpr-can-we-declare-it-total-failure-yet.shtml).",
				"added": 1559010729
			}
		],
		"1559854827_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 108,
				"body": "I think he's talking about the 3D gun blueprints",
				"added": 1559869680
			}
		],
		"1560365421_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": [
			{
				"comment_id": 109,
				"body": "what's that good for? Just use a torrent...\n \nZeroNet is already using torrents, so this seems like unnecessary complications.",
				"added": 1560367794
			}
		],
		"1560345010_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 110,
				"body": "> [daz](#comment_78_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Is that a new show /film based on the old TV showYou Can't Be SeriousComedy | TV Series (1979) English TV show  I will take a look, I tend to find the old shows had less overt agendas. cheers\n\nOr sometimes they did, but the agenda is no longer applicable in these times which makes them watchable.",
				"added": 1560370286
			}
		],
		"1560988180_1CKKbdH99PeFfraMKFZNmCMAUsTfTQxsKU": [
			{
				"comment_id": 111,
				"body": "For video [KopyKate](/big.kopykate.bit/) is the most populated, and possibly best one (KxoVid had potential but dev quit). There's a pretty nice [Gallery viewer](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4/). There's some interesting muzic zites like MixTape (nice design and functionality, but limited scope), LSTN (has some bugs and a lot of seedless songs). I personally really like Incantata (Card Game) as well.",
				"added": 1560990502
			}
		],
		"1565201992_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1": [
			{
				"comment_id": 112,
				"body": "One of the biggest differences is that ZeroNet has Tor support.",
				"added": 1565214829
			}
		],
		"1565214030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 113,
				"body": "> [port220irq5dma1](#comment_7_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): \"no wait, all we have to do is have some algorithms that will automatically promote and demote posts that are tuned to users' tastes and...\"\n\nIt's not necessarily an algorithm doing the promotion/demotion, it could be run by a community. Even if it is an algorithm, that's not necessarily bad, as long as the algorithm is transparent and optional.",
				"added": 1565215115
			}
		],
		"1565207629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 114,
				"body": "> [styromaniac](#comment_887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet doesn't use a blockchain.\n\nTo elaborate on what styro said: ZN uses bitcoin *cryptography*, not bitcoin *blockchain*",
				"added": 1565215349
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 115,
				"body": "The amounts of disinformation coming from Qtards and antifa alike is incredible. So many posts saying \"ZN is malware\" and \"made by FBI/CIA/MOSSAD/etc. as honeypot\" or that \"everyone who installs ZN automatically downloads CP, so all 8ch soon vanned haha\" on social media. It's almost painful to see all of these tech illiterates think they know better. Honestly, I think that's a good thing. I don't want my precious ZN flooded with Qboomers and ecofascists. Also plz no leftypol, they're braindead morons too.\n\nThe smarter ones who understand and recognize revolutionary technology will stick around and I will welcome them in due time.",
				"added": 1565215967
			}
		],
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 116,
				"body": "the best option is probably to have janitors, something mcdev is working on according to [this Millchan post](http://192.168.1.14:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:1b5f282e-6a57-4aa4-ae11-8b85dda51509#post-c244480b-c3b8-4df4-b549-0a4f4d976a9f), but I've got no idea how long it will take.",
				"added": 1565440645
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 117,
				"body": "1. Someone posted he killed himself \"by hanging and cardiac arrest\" on 4ch before it got into the news.\n2. There's no doubt in my mind he had a terribly coincidental accident.\n\nAlso watch jimbo's stream.",
				"added": 1565475671
			}
		],
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 118,
				"body": "> [1917](#comment_4_1GZpEfwLctYr3JvsD96qYGozQQPfqkagWP): Defy the far left? I think you mean lick boots of the police state. ;D\n\nThe right:\n- freedom of speech\n- right to bear arms\n- freedom of assembly\n\nThe left:\n- ban hate speech\n- ban guns\n- can't have a rally or protest, unless we agree with the message\n\nI don't think the right is licking the boots of the police state: before the whole BLM thing spun out of control and started toppling statues, vandalizing property, looting businesses, burning down police stations, occupying city blocks and attacking cops, civilians and their own, there were right-wing protesters who joined in with them to protest the George Floyd incident.",
				"added": 1593561598
			}
		],
		"1610318482_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 119,
				"body": "Beaker/dat has less content than ZeroNet and several downsides:\n- No support for Tor/I2P yet (But it's very simple to use ZeroNet with Tor, not with I2P yet though)\n- Need to keep browser open to seed sites (ZeroNet can run in the background)\n\nBut some things I do like about Beaker are:\n- Versioned sites\n- Custom browser (but this can also be a downside though, it means they have to maintain their browser, which is likely to be time intensive, and it means users are locked into a specific browser)\n\nBTW: If you really want to stay anonymous with ZeroNet you'll have to use ZN+Tor and use TBB (Tor Browser Bundle) with 127.0.0.1 as whitelisted address. Even then you could accidentally reveal who you are by giving personal information. Unfortunately some sites (e.g. ZeroMe) don't play nice with TBB.",
				"added": 1610328524
			}
		],
		"1610253332_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 120,
				"body": "It's hard to pinpoint down what ZeroNet is competing with exactly because it is so different from anything else. I recommend reading some of the blog posts on http://127.0.0.1:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:5 that were written after the 8chan influx.\n\nThe projects ZeroNet is the most similar to are FreeNet, Beaker/dat and SafeNet/MaidSafe (*decentralized hosting*), then one degree further away would be networks like Solid, Fediverse, Matrix, Mastodon (*federalized hosting*).\nPeople often lump ZeroNet with Tor and I2P,  but that's just wrong. Tor and I2P (as well as e.g. LokiNet) are *anonymous and decentralized name resolution*, not hosting. FreeNet does both.\n\nZeroNet does more than just decentralized hosting because it also offers sites an API to interact with the data, which is what allows dynamic sites without using the blockchain (which is a bad idea). With ZeroNet you can use downloaded sites offline, and even share them on a LAN network. You can also share sites by USB drive if the internet is completely shut down, this makes it very resistant to censorship.",
				"added": 1610329308
			},
			{
				"comment_id": 122,
				"body": "A very important point to make is that while ZeroNet is censorship-resistant, sites on ZeroNet don't have to be censorship resistant. IF you want to make a site and not allow something on that site, you can do so.",
				"added": 1610329517
			}
		]
	},
	"comment_vote": {
		"2_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"4_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"289_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"5_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"6_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"18_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"17_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"30_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": 1,
		"286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"307_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"24_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"8_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"84_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"32_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6": 1,
		"327_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"37_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"310_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"311_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"75_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"9_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L": 1,
		"4_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": 1,
		"371_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"174_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"28_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"14_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"30_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"544_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"27_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"66_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"1_1CmKnRkBqGcBLEJomTcERHEMtR77TTv3ag": 1,
		"117_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"415_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"204_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"2_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"5_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": 1,
		"18_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn": 1,
		"145_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"103_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"34_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"258_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"770_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"64_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"11_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"812_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"8_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": 1,
		"47_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"158_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"732_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1
	}
}