{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": 1,
		"1_1PSCnSCea32rRVNNTxgKDyC64pnGp9AXSn": 1,
		"1_14qkCANgpwdN9rLmjeEWyyxEzAjmwFVkom": 1
	},
	"next_comment_id": 9,
	"comment": {
		"5_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": [
			{
				"comment_id": 1,
				"body": "mais ça rajoutes les liens magnet automatiquement ou manuellement ? dans le deuxième cas c'est pas génial. Et pourquoi mettre que des torrents en TrueFrench, le VOSTFR c'est la vie.",
				"added": 1497432846
			}
		],
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 2,
				"body": "> [poka](#comment_1_1FcfmaNZ4nhcpk9dh6pVnnpaix2txLjTKZ): Salut salut!Heureux de voir des contrib t411 ici =DNous en train de relancer t411 sur ZeroNet. Nous sommes plusieurs modos et gros contributeur de t411 à nous rassembler sur Wire pour en discuter. Je travail à commencer la base du site. Tout aide est la bien venu! Vous pouvez nous rejoindre sur Wire m'ajoutant: @pokapowJe vous ajouterais alors au groupe de discussion en question.Sinon nous somme aussi sur l'irc t411 qui est revenu: https://search.mibbit.com/channels/t411\n> reloading\n\nC'est pas trop tôt.\nUn conseil: passer au magnet et tracker public. Arrêter les tracker privés, c'est nul et ça se fait down comme on le voit ici. Et tant pis pour le système de ratio, de toute façon il est injuste pour les petites connexions et encouragent les gens à télécharger de la qualité de merde.\n",
				"added": 1498912277
			},
			{
				"comment_id": 3,
				"body": "> [poka](#comment_3_1FcfmaNZ4nhcpk9dh6pVnnpaix2txLjTKZ): On verra pour le système de ratio, le tracker sera bien sûre san pub et publique\n\nok cool.\nPar contre vous avez accès à la base de donnée de t411 incluant tout les fichiers torrents ? il a eu des backups faits en dehors de chez l'hébergeur raidé ?",
				"added": 1498942563
			},
			{
				"comment_id": 4,
				"body": "> [poka](#comment_7_1FcfmaNZ4nhcpk9dh6pVnnpaix2txLjTKZ): Si vous avez une solution VIABLE pour un tracker décentralisé, n'hésitez pas à nous le faire savoir :)En attendant, on taf sur yggtorrent\n\nUn tracker est par définition centralisé. La seule alternative décentralisé c'est d'utiliser le DHT.",
				"added": 1499594753
			}
		],
		"1_1KtGicZG6oM7qTvNE6nW4qbXkNjSo2vifT": [
			{
				"comment_id": 5,
				"body": "officiel (enfin je crois)\nhttp://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/",
				"added": 1499769647
			},
			{
				"comment_id": 7,
				"body": "> [stegner](#comment_4_1NoMqFbNPsjQB29vMzbFB2B9mLC5GRt4YL): Non elle est moins complète que http://127.0.0.1:43110/1HP65eGEEMPbyzH3mkaoQ7eCMKd9P8G61W/\n\noui tu as raison",
				"added": 1499791923
			}
		],
		"1_15JVk445AsQckYiYprp1PFqyu9c7DnAvwN": [
			{
				"comment_id": 6,
				"body": "tu veux pas le mettre en licence libre ton jeu ?",
				"added": 1499771090
			}
		],
		"1_1KvhtxCVN75qypa87L4K99Um5Bmgrrvxm5": [
			{
				"comment_id": 8,
				"body": "je te conseille de ne pas aller voir la partie \t\"Unpopular\" de 0chan Porn sur zeronet...\nC'est la technologie de ZeroNet qui permet ça, c'est le prix à payer pour ne pas avoir de censure.\n\nMaintenant on peut imaginer une sorte de filtre qui travaillerait en local, comme une extension à rajouter sur zeronet qui aurait une liste noire de zites connus et/ou de mots clés et même pourquoi pas un algorithme qui reconnaîtrai une image pédo/porno.\n\nBigre les développeurs de ZeroNet pourrait même inclure ça par défaut et on aurait juste un bouton à décocher pour désactiver ce filtre: de mon point de vue ça serait l'idéal.",
				"added": 1518129029
			}
		]
	},
	"comment_vote": {
		"8_1PSCnSCea32rRVNNTxgKDyC64pnGp9AXSn": 1
	}
}