{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Поморье не помойка!",
			"body": "На станции Шиес пытаются провести бензин (наверное многие из вас об этом знают, но всё же)... В общем там хотят свалку чужого мусора делать (из Москвы, кажется), но местные жители протестуют. На том месте, где хотят это сделать - болото, из которых берёт начало несколько крупных рек (да-да, некоторые реки не истекают из гор, а выходят из болот). Недовольство местных жителей вполне законно и обосновано. Если там будет свалка, то никакие материальные блага им уже не нужны будут - все просто перемрут. Поэтому они протестуют. Кажется, уже год. (Поражаюсь их стойкости и организованности.)\nЕсли думаете, что это локальная проблема, то огорчу вас. Во-первых, свалки строятся везде; во-вторых, почти все проблемы растут из одного места... ну, вы поняли.\nДо этого активисты (те, которые протестуют на станции против стройки и всеми законными способами пытаются добиться отмены этого *******) успешно сдерживали бензовозы. Но недавно их всё-таки силой пропихнули туда.\nДумаю, стоит поддержать оборону станции Шиес.",
			"added": 1571830398
		}
	],
	"topic_vote": {
		"1_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": [
			{
				"comment_id": 1,
				"body": "> [karr0t](#comment_4_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb): Точка Сбора на месте\n\nкласс",
				"added": 1571737893
			},
			{
				"comment_id": 3,
				"body": "> [trust420](#comment_1_1MMpsjj9iNC5JT9usW8tatHvcY8QAAhP6): Находками никто не поделился. Или тут все ньюфаги?\n\nв 0# или вообще?",
				"added": 1574108272
			},
			{
				"comment_id": 5,
				"body": "> [trust420](#comment_1_1MMpsjj9iNC5JT9usW8tatHvcY8QAAhP6): Находками никто не поделился. Или тут все ньюфаги?\n\nhttp://127.0.0.1:43110/1BsRBzGdcYMbv72bwRy6pMxPLNL9obYYau/ - типа вин-даа",
				"added": 1574110719
			}
		],
		"1_1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf": [
			{
				"comment_id": 2,
				"body": "> [vby](#comment_5_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm): снимайте на видео выклвдывайте куда только можно\n\nтак и делают\nНу, вк группа есть",
				"added": 1571845466
			}
		]
	},
	"comment_vote": {
		"1_1MMpsjj9iNC5JT9usW8tatHvcY8QAAhP6": 1
	}
}