{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1632903874,
			"title": "外面吃饭大多数都不卫生吗？",
			"body": "听朋友说在南方某一满大街都是的地方吃炒饭，无意间发现竟然把别人吃剩的倒进去再炒，可怕",
			"added": 1632903873,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1632905840,
			"title": "借力短视频：直播用户只是短视频用户的子集？",
			"body": "直播平台大量死亡，没死的都在借力短视频，直播用户只是短视频用户的子集？本文作者将来聊聊此问题。\n\n直播平台涉黄，又又又被曝光了。\n\n4月16日，火山、花椒、麻椒、陌秀等被央视新闻点名。第二天一早，火山、花椒位于北京的公司大门刚开，“扫黄打非办”的人就站到了门口——固定证据、立案调查！连苹果公司也因为对直播App审核不力，被约去喝了壶茶。\n\n当然，围观群众早就见怪不怪。过去这一年，网络直播平台的负面消息太多了。除了涉黄，还有假公益直播、炒作主播身价、刷流量……而这些乱象背后是整个行业的超速狂飙。\n\n某知名直播平台COO直言，正是靠打擦边球，直播平台才能肆意生长。造成的结果是，创业者用1年时间透支了此后3年的市场红利。\n\n换句话说，简单粗暴的玩法再难持久，残酷的淘汰赛将提前上演。\n\n一批批的直播平台正倒在路上：光圈直播、微播、网聚直播、猫耳直播、咖喱直播、爱闹直播、趣直播……\n\n数百个直播平台，满屏的网红脸，用户的新鲜感快速退却\n2016年12月底，两位光圈直播的员工在北京火车站发现了张轶，随即将他拦住，“拖欠的工资怎么办？”\n\n此时，作为光圈直播创始人，张轶已经在员工面前失踪多日。\n\n不久前，光圈直播的员工们去上班，突然发现办公室被搬得连一根网线都没有留下。几个月没有领到工资的员工，满世界地找张轶讨薪。\n\n“抢劫！”火车站里，张轶大喊一声，两名员工只好放手。曾经的清华大学历史学博士、大学教师，就这样不光彩地结束了自己的创业之旅。\n\n而就在一年多前，光圈直播还获得由合一资本等1250万元天使轮投资。合一资本的背后，是视频巨头优酷土豆。光圈直播最辉煌的时候，上线两个多月就获得40万用户，估值高达5亿元。\n\n然而在用户增长乏力甚至流失面前，光圈直播陷入一个怪圈：“刷量”、转型，直到打完最后一颗子弹！最终成为市场的弃儿。\n\n有技术人员透露，光圈最高时号称有一百万用户，其中六七十万都是机器刷出来的，“一个机器人花费六块钱。”\n\n直播行业曾经被认为将是个千亿级市场，但现在香港上市的天鸽互动创始人傅政军悲观地说：“市场规模可能可以去到200亿元，但是利润我个人认为不会超过10亿元。”\n\n在行业触及天花板之前，寻找出路、突破天花板迫在眉睫。\n\n线上富士康：主播职业化，是直播内容生产机制走向成熟的必然。\n\n95后最向往的新兴职业是什么？QQ浏览器发布的“95后”毕业生就业报告里，54%的受访者给出了下面这个答案——主播。\n\n作为一种职业，主播的社会存在感越来越强。以YY为例，目前在YY平台上有稳定收入、每天在线时长超过3小时的主播数量超过30万，堪称“线上富士康”。\n\n主播职业化，是直播内容生产机制走向成熟的必然。\n\n过去，直播平台有一大批尝鲜式的流量，现在是淘汰赛阶段，竞争来到了内容层面，做好PGC、OGC、PUGC才是王道。\n\n甚至快手这样不签约主播的平台，内容生产也越来越专业化。在东北，几乎所有二人转演员都有快手账号，他们拍出的段子最容易被平台推荐。所以有人戏称，快手已然成为东北经济第一支柱。\n\n然而，直播平台太多，东北人都快不够用了，而主播定职业化必然意味着门槛的提升，而这不仅会刷下来一大批直播平台，也会刷下来一大批主播。\n\n“+”与“被+”的竞合：直播只是一种工具，任何人都可以嫁接到自己生意中来？\n\n2016年的一天上午，重庆市秀山县桂坪村，农村淘宝合伙人黄泽翼正猫着腰钻入养鸡场，一位农户拿着手机开着直播。\n\n黄泽翼趁着抓鸡的空隙，对着镜头现场开始售卖：“网上下单，现场称重，马上发货。”画面通过淘宝直播平台向全国实时播出。相关农产品也在农村淘宝、手机淘宝、聚划算等平台同步发售。\n\n这是淘宝推出的“村红”直播首秀，共计吸引10万名网友在线观看。开播前5秒，仅土鸡蛋就卖出了4万枚。\n\n黄泽翼这位“村红”不仅颠覆了网络主播的画风，还揭示了一个现象：就在大量直播平台高开低走的时候，圈外企业却拥了进来，“+直播”的概念被提了出来。\n\n直播在形式上丰富了电商产品的展示、销售方式。现在，淘宝、苏宁、京东、聚美优品等电商都有了直播业务。\n\n去哪儿网曾经在绍兴镜湖乐园梦幻水世界推出网红直播节目，节目开播短短半小时内就有19万人次观看。\n\n阿里旅行也在上海迪士尼开业当天，邀请网红姜思达进行游园直播；同程打造了直播综艺节目《带着你的眼睛去旅行》。\n\n越来越多企业意识到，直播只是一种工具，任何人都可以嫁接到自己生意中来。\n\n这足以让所有的直播平台感到紧张，更戳中了他们的痛点——外部流量依赖症。\n\n直播平台，尤其是全民直播类的平台，掌控不了用户发起直播的时间，也难以对内容进行分类、打标签，需要用户自己描述、预告，然后对外分享链接，向平台导流。\n\n而中小平台因为用户量少、活跃度低，必须由平台出面向今日头条这样流量大户购买流量。\n\n一直播能够迅速崛起，后来居上，就是因为坐上了新浪微博的“直升机”。\n\n圈外巨头借流量优势，以及背后的场景优势、内容优势，可以轻松切入直播。这样一来，独立的直播平台还有存在价值吗？\n\n借力短视频：直播用户只是短视频用户的子集？\n其实，早在光圈直播停摆之前，业界就已经听见了警钟——移动直播鼻祖、美国公司Meerkat 2016年10月宣布下架。不过，人们更愿意将它归结为社交战略的失败。\n\n很多直播平台都定位于社交，但直播能沉淀社交关系吗？10个人的直播间里或许可以。但当1个人向1 000人直播的时，俨然就是一场“演唱会”。Meerkat 已死，直播平台还能将社交的故事讲下去吗？\n\n现在，直播与短视频的内容消费都站在风口上。但短视频这个风口正在上行，直播的风口正在回落。\n\n直播与短视频的用户某种程度上说是重合的，即都是用来打发时间的，而且都是倾向于看视频这一类的内容消费，所以很多直播平台开始借力短视频。\n\n用直播+短视频做社交，快手算一个先驱。截至2016年底，快手的用户已经超过4亿，日活量超过4 000万。成为除了QQ、微信和微博以外最大的社交应用平台。\n\n在创始人宿华看来，“直播用户只是短视频用户的子集”。直播用来获取用户时长和提高社交效率；没有场景局限的短视频，用来黏住用户。\n\n目前，采取短视频+直播双线布局的还有一下科技（一直播、秒拍、小咖秀的母公司）、美拍等平台。\n\n微视失败了，从它的失败中腾讯意识到，对于熟人社交来说，直播通讯已经有了，但没有商业价值；而短视频“太重了”，只能作为熟人社交的补充。\n\n腾讯投资快手，意在弥补自身在陌生人社交领域的短板。\n\n从当前直播行业的疲态与短板来看，直播占用大量带宽，出来的内容却是大量的“工业废水”，商业模式难以成型，从投资回报率来看，变现周期长而且产出投入不对等。\n\n从未来的趋势看，短视频与直播两种形式都会并存，但短视频的生命力会更长久，它是一个相对慢热的产品形态，并且基于垂直细分以及专业领域的内容挖掘达人的想象空间会更大，所以一定程度上，短视频比直播更像一个内容型产品，它会逐步蚕食直播的粉丝。短视频带来的是真正的粉丝，直播带来的是无聊观众，前者的忠诚度更高，后者从各个直播间不断跳转来满足自身的窥私欲。",
			"added": 1632905838,
			"parent_topic_uri": "1571187408_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1632906199,
			"title": "看直播的都是哪些人？直播平台的用户人群分析",
			"body": "２０１６年直播元年爆发了直播大战，那么直播为什么火起来，用户群体都是哪些？上次分析得是用户基础与粉丝数量的问题，今天来跟大家探讨一下，这些用户都有什么样的特点。\n\n\n　　游戏类直播的粉丝基础肯定是游戏玩家，游戏玩家看直播，主要是想学习一些高手的思路或者操作，当然这部分用户，会成为主播的铁粉，而且会在直播精彩之处刷些礼物，达到互惠互利。\n　　体育类、新闻类等这类的直播，用户主要是想了解赛事或者最新的资讯等。不特别针对某一个主播，甚至也对直播平台没什么粘性。\n　　重点来看看秀场娱乐类直播平台的用户需求分析：有这样一些人群，没事做了不想外出当然要找事情做啊，不能一直坐着吧，看电视发觉又不够丰富没有想看的，玩游戏又太腻了不想玩，电视剧又追完了不知道追什么，于是网络直播很好的满足了大多数年轻人的娱乐需求。\n\n\n\n直播的用户数量增长趋势图\n　　当然从直播用户群体也可以分类为\n　　围观群体：不会进行付费动作，也不会进行互动，但却是流量的主要贡献者。\n　　粉丝群体：会支付小额费用，会与主播互动，是人气的主要贡献者。\n　　付费群体：会为主播赠送大额礼品，是收益的主要贡献者。\n　　直播平台用户数据分析\n　　人群特点是：无聊、寂寞、孤独、打发时间的人\n　　从年龄段上：基本是在24岁以下及25-30岁之间的人群，占了73.1%，其他年龄段比较少。\n　　从性别上看：是以男性居多，占了62%。\n　　从职业需求角度来看，直播用户自由职业者居多，占了34.7%；其次是学生群体23.1%；工人/服务人员占比22.35%。白领、公务员、退休人员反而少很多。\n　　从收入来看：3000元以下的占比55%，\n　　从地域来看：一二线城市45%\n　　从学历来看：初中/高中50%\n　　有需求，就有市场，有用户就有需求！使用直播的用户平常下班有空闲时间，或者大学里宿舍无聊，或者平常呆在家的宅男宅女。\n\n\n各个直播平台活跃用户数量\n\n再从直播用户的心理来看：\n　　1、好奇（有那么好玩吗？）：看到一个直播的产品，一定会有一部分人好奇里面都是谁在直播，直播些什么，为什么有那么多人打赏。带着这些疑问，直播类app的新客增长率居高不下，是否能留存，要看里面付费节点和内容的设计，以及对用户心理的洞察和研究\n　　2、鼓励和动心（主动打赏）：看到一个长的好看的女主播、一个游戏打的精彩的玩家、一个生活有点艰辛的女孩，你会不会心理也荡漾那么一下？不管是不是刻意的，这种极其生动的画面展示，都让你的大脑神经觉得无比真实\n　　3、虚荣和攀比（被动打赏）：部分直播平台雇佣财团刷礼物已经是不成文的规矩，通过财团或者官方虚假的打赏行为，刺激真正的土豪们一掷千金，一点都不奇怪。就是抓准了他们的虚荣攀比和争强好胜，而坐在一旁偷笑的女主播，也会用嗲嗲的“XX哥哥，你被追上了哦”这种诱惑力十足的煽动，而变得一发不可收拾。YY明星女主播沈曼就获得多个“国王”级别粉丝的轮番攀比打赏，最多的时候单月从单个土豪粉丝身上就获得超过100多万的收入，令人咂舌！\n　　4、现实生活缺乏娱乐方式（无聊）：笔者参加过某秀场产品的内部分享会，从其中的用户画像来看，大R付费用户不乏二三线城市的中年群体，这部分城市的夜间娱乐生活缺乏，娱乐场所少、各种场所关门早，加上直播平台在某度网盟小广告的泛滥和推荐，在这部分用户中得到了很好的传播，让他们消遣晚上的无聊时光。\n　　5、性（诱惑和吸引）：无论怎么监管，性始终是一种原动力，牢牢黏住用户。直播的特性是隔着电脑屏幕，用一些若有若无的擦边球和语言，撩拨用户的欲望，就是让你心里痒痒又无法真正得到。\n　　6、兴趣相投：在一些细分平台出现了很多基于兴趣图谱和才艺开展的直播秀，观看直播的用户都和主播有着相同爱好，或者希望学到某种技艺。当你看到另外一个和你一样有梦想或者臭味相同的人在直观展现自己，你也会不经意间被吸引、开心和感动。\n　　另外，值得提醒的是直播行业，作为一种新型文化消费，现在呈现一种现象：直播平台普遍都在传播低俗文化，这在一定程度上反映的是网民对网络直播新媒体的这种文化的消费观念与传统文化价值伦理底线的冲突正在加剧。而与之伴随的是网络直播平台靠‘粉丝经济’支撑打造出的简单盈利模式，正在吸引大量资本进入，客观助推低俗文化泛滥。\n\n\n\n　　值得注意的是，网络直播平台，如果仅靠迎合低俗聚拢人气和制造流量，是无法走远的！所以必须有更多直播内容形式的出现，最近泛娱乐节目类直播类，在不少的平台也作为主打内容出现，同时也出现了不少直播+的内容。\n　　最后，在粉丝经济时代，虽然说拥有粉丝就拥有取款机，但是粉丝和网红之间并没有任何不离不弃的契约关系，有的只是情绪和感情的传递，而且最终这份热情必须安放到粉丝认可的产品之中，才会真正形成经济的落脚点，否则也只能随风消散。直播平台的用户人群中，虽然有一大部分粉丝经常过来看主播直播，在粘性不够，没有契约关系的情况下，粉丝终究还是会有可能会离开。直播平台要走得更远，发展得更好，必须要时时抓住现时用户的心理需求，并不断的满足用户的需求。",
			"added": 1632906196,
			"parent_topic_uri": "1571187408_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1632906434,
			"title": "知识复习",
			"body": "",
			"added": 1632906430,
			"parent_topic_uri": "1571187408_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9",
			"type": "group"
		},
		{
			"topic_id": 1632906568,
			"title": "充满了快活的空气",
			"body": "表‌​​‌‌​​‌​‌​​‌​​‌‌示对某事的讽刺与调侃。\n出自《孔乙己》，“孔乙己便涨红了脸，额上的青筋条条绽出，争辩道，“窃书不能算偷…窃书！…读书人的事，能算偷么？”接连便是难懂的话，什么“君子固穷”，什么“者乎”之类，引得众人都哄笑起来：店内外充满了快活的空气。”\n多用于恶搞某件事，一般会套用原文，再针对相应事件做出修改，也可以直接简化为“xx内外充满了快活的空气”，如“评论区内外充满了快活的空气。”",
			"added": 1632906563,
			"parent_topic_uri": "1632906434_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		},
		{
			"topic_id": 1632906649,
			"title": "吾与徐公孰美？",
			"body": "出自两汉刘向 撰的《邹忌讽齐王纳谏》\n\n　　邹忌修八尺有余，而形貌昳丽。朝服衣冠，窥镜，谓其妻曰：“我孰与城北徐公美？”其妻曰：“君美甚，徐公何能及君也？”城北徐公，齐国之美丽者也。忌不自信，而复问其妾曰：“吾孰与徐公美？”妾曰：“徐公何能及君也？”旦日，客从外来，与坐谈，问之客曰：“吾与徐公孰美？”客曰：“徐公不若君之美也。”明日徐公来，孰视之，自以为不如；窥镜而自视，又弗如远甚。暮寝而思之，曰：“吾妻之美我者，私我也；妾之美我者，畏我也；客之美我者，欲有求于我也。”\n\n　　于是入朝见威王，曰：“臣诚知不如徐公美。臣之妻私臣，臣之妾畏臣，臣之客欲有求于臣，皆以美于徐公。今齐地方千里，百二十城，宫妇左右莫不私王，朝廷之臣莫不畏王，四境之内莫不有求于王：由此观之，王之蔽甚矣。”\n\n　　王曰：“善。”乃下令：“群臣吏民能面刺寡人之过者，受上赏；上书谏寡人者，受中赏；能谤讥于市朝，闻寡人之耳者，受下赏。”令初下，群臣进谏，门庭若市；数月之后，时时而间进；期年之后，虽欲言，无可进者。燕、赵、韩、魏闻之，皆朝于齐。此所谓战胜于朝廷。",
			"added": 1632906643,
			"parent_topic_uri": "1632906434_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		},
		{
			"topic_id": 1632906742,
			"title": "「『茴香豆』的『茴』字中的『回』字有四种写法」让你想到了什么？",
			"body": "「孔乙己显出极高兴的样子，将两个指头的长指甲敲着柜台，点头说，“对呀对呀！……回字有四样写法⑿，你知道么？」\n\n「回字有四种写法」让你想到了什么？对你有什么启发？你有什么想法，感慨？对于这句话你想说什么？",
			"added": 1632906735,
			"parent_topic_uri": "1632906434_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		},
		{
			"topic_id": 1632907902,
			"title": "大势所趋",
			"body": "",
			"added": 1632907894,
			"parent_topic_uri": "1571108301_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9",
			"type": "group"
		},
		{
			"topic_id": 1632908108,
			"title": "阿里做了，腾讯做，社交软件到底应该怎么做？",
			"body": "因为之前工作涉及到过这方面的内容，加上最近也和许多人交流了关于陌生人社交的看法，在这里相当于简单做一下不完全的相关总结。\n\n一.为什么要做社交？\n\n2019年可以说是社交年，从年初的马桶，多闪，聊天宝开始，到最近包含轻聊，朋友，灯遇在内的腾讯社交矩阵，大大小小发布了将近几十款社交软件。\n\n几乎绝大多数的软件都是朝着陌生人社交领域发力。其实这也是现实所迫，不是大家不想做熟人社交，而是熟人社交实在是太难做。在没有通讯技术革命性变革的情况下，根本没有办法说服用户进行关系链的迁移，这也就很难能撼动QQ和微信这两座大山。\n\n说起陌生人社交软件，其实很多人的第一反应就是陌陌和探探这两个陌生人领域的头部软件。所以现实是，陌生人社交软件也不是那么好做的。不过和QQ微信加起来将近20亿Dau的那种绝望感相比，千万级别Dau的陌生人社交软件似乎又要好了很多。\n\n所以为什么大家削尖了脑袋也要做？\n\n道理也很简单，目前的市场容量还足够大。和熟人社交市场用户肉眼可见的天花板，以及用户使用时长开始下滑的情况不同，陌生人社交市场依旧是一个增量市场，根据艾媒咨询2019年Q1的数据，2019年年底陌生人社交市场用户规模会达到6.22亿。\n\n\n其次，Z世代的互联网原住民正在逐渐成熟。所谓Z世代就是指95后的互联网用户。根据QuestMobile的报告显示，Z世代人群已有3.69亿。而这部分人群在新社交软件上，要比其他年龄段用户的参与度更高，更喜欢尝新。\n\n\n最后，社会观念的逐渐开放，陌生人社交正在被越来越多的人认可。根据草莓派数据调查与计算系统的调查报告显示，目前以陌生人社交为主要社交方式的中国网民占比达到了24.4%。\n\n二.陌生人社交要解决什么样的问题？\n\n之前在《飞聊的显示与理想》中，我的观点是：社交软件是一座连接人与人之间的桥梁，本质上是能够提高人与人之间的沟通效率。\n\n现在针对这个观点有了进一步的补充。\n\n个人认为陌生人社交软件是要解决两个问题，一个是核心问题，一个是本质问题。\n\n首先，解决的核心问题是社交效率。\n\n社交软件的内核都是需要解决人与人之间的沟通效率。但是相对于熟人社交，陌生人社交对于效率会更为看重。\n\n和熟人社交维系关系链的功能不同的是，陌生人社交产品主要是拓展社交关系。在没有形成稳定的社交关系链前，长时间得不到反馈会极度影响用户体验。这种情况下，用户想要拓展关系链的诉求没有得到任何满足。\n\n简单来说就是通过尽可能高的效率匹配质量尽可能高的人，同时尽可能快的收到反馈。比如想要倾述的时候有一个倾述对象，以及情感诉求，想要快速匹配异性。\n\n其次，解决的本质问题是价值交换\n\n无论是联系建立前，建立中，还是建立后，都是一个价值交换的问题。\n\n比如建立前，男性用户看到了好看的女性用户，想要认识一下。这时，美丽的外在便是女性用户所呈现出的价值。\n\n建立中，可以理解为刚刚认识，正在处于聊天了解阶段。女性用户被男性用户的幽默风趣给打动。这时候，男性用户的幽默风趣便是聊天阶段中所呈现出的价值。\n\n建立后，可以理解为男女性用户发展为了恋人关系。男性用户温柔体贴，女性用户知书达理，这就是建立后所表达出来的不同价值。\n\n当然还有一种就是一直想要建立联系，但是一直没有成功的用户。这类型的用户就需要自我反思下是不是能够提供有效的价值了。\n\n所以，通过人与人之间的互动实现物质精神的价值交换，无论是情感价值还是物质价值，都需要给用户一个价值输出交换的落点。简单来说就是匹配到人之后要做什么。\n\n三.陌生人社交的形态？\n\n除了tinder类陌生人社交以外，大多数陌生人社交在表现形式上一定是内容+IM的形式。\n\n还是和熟人社交相比。熟人社交中，人与人之间已经沉淀了关系链，可以直接进行沟通。而陌生人社交中却没有。社交关系链的沉淀又是基于人与人之间相互加深了解的基础之上的，所以需要有一定的载体来促进人与人之间的了解。简单来说，新的软件里面可以没有人，但是一定要有吸引人的基础。\n\n当然也不是说不能够直接进行人与人的配对，只不过简单粗暴地配对给顺畅交流增加了一些困难。\n\n1.什么是社区，什么又是社交？\n\n陌生人社交软件中增加了内容模块，给人的感觉和社区没有区别。社区和社交的区别其实还是在于功能优先级和人与人之间的关系的强弱的问题。\n\n举个例子，贴吧之所以叫社区，是因为，无论是关注吧，还是对帖子的加精置顶回复分享等一系列操作，核心目的都是在于构建贴吧的内容生态。而人与人之间的关系的沉淀仅仅是核心目的以外带来的附加属性。这一点通过IM页面的设置就能感受到。\n\n而陌生人社交软件中的内容是为了沉淀人与人之间的关系而服务。通过内容能够让用户接触到另一个用户的兴趣心情等信息，帮助用户间在沟通时有更流畅的沟通效果。\n\n2.怎么鼓励内容生产？\n\n这里存在一定的矛盾点。即单纯让用户自发生产内容会没有动力，而通过大量奖励又会出现用户灌水的情况。\n\n所以在鼓励UGC内容生产的问题上需要掌握好一定的力度，既不能用力过猛，也不能一毛不拔。\n\n这个问题也涉及到，用户为什么要发内容，用户又要发什么内容。\n\n所以在前期的时候，需要通过内容抓取以及团队输出的形式做好内容覆盖。这一点上要保证内容的质量，同时要能够给社区内容形成一定的调性。这一点其实和社区是很相似的。\n\n开始推广之后，手段就会更加多样一些。\n\n人工引导\n\n可以通过运营手段进行定期的征文活动或者日常的话题挖掘，引导用户生产UGC。同时为了保证用户的生产兴趣，还需要一定量的马甲账户来进行“灌水”。\n\n“灌水”分两种。\n\n一种是引导真实用户生产UGC，并在UGC下方进行评论。\n\n另一种是，积极回复这条UGC下其他用户的留言，再引导这部分用户进行UGC生产。\n\n平台激励\n\n平台激励又分为显性激励和隐性激励。核心是围绕用户的成长奖励体系展开，用户通过获取积分，提升平台等级，然后还可以通过积分换取奖励。\n\n首先是显性激励。当用户有一定质量的UGC生产时，可以给予一定量的积分奖励。在用户提升平台等级获取等级特权的同时，也能够通过积分换取一定的物质奖励。\n\n其次是隐性激励。当用户有一定质量的UGC产出时，就对这部分内容进行加精置顶全站推送等形式对用户进行精神鼓励，从而满足用户的成就感。\n\n四.怎么看待熟识之后互加微信的现象？\n\n这个问题其实不必过多纠结。\n\n微信本身就是稳定关系链的象征，是用户关系发展到了一定阶段后的必然现象，同时互加微信也是一种仪式，象征着两个人之间正式成为朋友。而两个用户互加微信后不见得都会离开平台。\n\n所以陌生人社交软件需要关注的是怎么样高效率解决关系链的沉淀问题。\n\n`**迁移关系链很难**`",
			"added": 1632908099,
			"parent_topic_uri": "1632907902_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		},
		{
			"topic_id": 1632908222,
			"title": "认真上班是劳动换取报酬，上班摸鱼才是从老板那赚钱",
			"body": "吃得苦中苦，还是人下人",
			"added": 1632908294,
			"parent_topic_uri": "1632907902_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		},
		{
			"topic_id": 1632908466,
			"title": "移动互联网七大黄金法则：流量为王、用户至上",
			"body": "【亿邦动力讯】9月28日消息，在2021亿邦未来零售大会新流量峰会上，如涵首席内容官徐志杰发表了题为《新流量的“觉醒时代”》的演讲。徐志杰指出：新流量不可避免和新消费、新人群结合在一起，新消费要解决留存注意力的问题，而新人群的特征就是个体化和悦己化。\n\n\n徐志杰首先指出，提及新流量就不可避免提到另外两件事情——新消费、新人群。如果不清楚现在的新消费是什么，不清楚现在的新人群他们有怎样的特征，是截取不到新流量的。\n\n徐志杰进一步解释说，新消费要解决两件事情，如何让消费者知道我、如何让消费者买到我。过去的渠道已经难以获取到新流量，但存量依然有很大的想象空间。\n\n谈到新人群，徐志杰指出，其最突出的特点是个性化、悦己化。 新消费要解决留存注意力的问题，新流量就是从年轻人的两个特点截取出来，所以流量为王注定变成“留量为王”，流量之变就是私域成为新流量密码，私域一定是新流量必须要做的事情。\n\n徐志杰认为，如今内容不难做，难做的是“人”，在流量的背后是“人心”，而品牌对年轻人的影响力逐渐下降，年轻人更有印象的是人。因此如涵重视IP+内容，去年开始做了大量红人跨界合作。\n\n徐志杰还指出，新消费中存在着分层的情况。如涵对于网红KOL垂类进行着更细致的分层，而不是仅仅看网红的量级。\n\n最后，徐志杰总结道，动荡的时代最危险的其实不是动荡本身，而是我们依然使用固有的逻辑去做事。想要获取到更多的新流量、想要获取到新鲜的玩法，就多去了解年轻人吧。\n\n据悉，2021亿邦未来零售大会新流量峰会由亿邦动力与星查查联合主办，以“YYDS”为主题，探讨未来零售哪些元素有可能成为“永远的神”？并将为行业带来关于“新流量”的无限遐想，四十余位行业资深大咖到场进行分享，剖析行业现状，与行业一起“打破流量迷信，疏解流量焦虑，找到流量破局”。",
			"added": 1632908455,
			"parent_topic_uri": "1632907902_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M"
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1632906742_1P2j5UayjHRj9MYGFiiHBAvC22Rzu8zN4M": [
			{
				"comment_id": 1,
				"body": "有一位先生，名叫孔甲己，早些年留过洋，穿一身洋人的衣服，与人说话，总是满口的██████、████████，教人半懂不懂，也不好跟他搭话。\n\n孔甲己一到店，跟柜里说，“来一杯茶，要一碟茴香豆，████████。”便排出九文大钱。看没人理自己，便对记账的小童问道，这茴香豆的茴字有四种写法，你知道么？\n\n记账的小童不太耐烦，别过头去不再理他。他于是又问一遍。小童不服道：记这劳什子玩意有甚么用？它便有二十种写法，与我何干？\n\n孔甲己见小童毫不热心，极惋惜的叹一口气，说，多学知识总是有用的，保不齐哪天就用到了呢？\n\n小童还是不理，孔甲己沉默一会，拿起茶杯来，说，你们这茶里有毒，你可知道？\n\n小童还未说话，掌柜的却气红了脸：`**你怎能凭空污人清白**`？\n\n孔甲己却抬头挺胸，慢慢说道：你这茶里含有大量的一氧化二氢，还有零醇、氧酚，每一样大量饮用，都对人体有不小伤害。然后便是什么化学物质啊、什么心肺，什么西方那一套之类，让人不甚明白却有觉得很有道理。`**店内外充斥着紧张的空气**`，客人们心惊胆颤的听孔甲己解说，盼着他能说出来什么解救的法子。店长却只能横着一张脸，憋不出一句话来反驳。\n\n孔甲己又沉默一会，说，之前那些是我唬你们的，一氧化二氢、零醇、氧酚，不过是水的另外三种写法罢了。哪里有毒？你们既不知道这三种写法，倘若我又不在这里说明…\n\n酒馆店长惊出一身冷汗，客人们各自唏嘘，唯有小童不服：那个茴字又有哪什么用处？\n\n孔甲己胸有成竹：假如我说茴香豆和回香豆是两种不同的豆子，前者伤身后者养生，你若不知道回字的四种写法，又如何知道我所说真假？不知真假，我把回香豆加价卖给你，你岂不是上当受骗，好不难受？\n\n小童仍是不服：骗人岂还有理？倘若我这么骗人，早教我爹打断我腿了！\n\n孔甲己叹道：骗人……读书人的事不能叫骗，钓鱼！……`**读书人的事，能叫骗么**`？我今天拿水的四种写法钓了你，明天便可以拿茴的四种写法钓你。旁人只会道我精明你愚笨，会夸我诲人不倦，又会赞我收取智商税手法巧妙，哪里有人会责怪我骗你？责怪我骗你又哪里有什么好处了？\n\n酒馆内外众人皆觉得孔甲己说的甚是有理，喝彩声此起彼伏；从此小镇中一改往日反智的氛围，众人皆开始用功学习，争先恐后。\n\n如果说茴字有四种写法对我有什么启发的话，大概就是这样吧。",
				"added": 1632907068
			}
		]
	},
	"comment_vote": {}
}