{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [kostanew](#comment_76_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Смотрите на ZeroNet не как на сайты, а как на приложения для Android, iOS. Тут есть прямые аналогии:подпись приложения и публикация в маркете -> siteSign, sitePublish; обновление приложения -> F5 на сайте; получение контента из облака -> опциональные файлы; рутованый доступ -> плагины. Теперь становится очевидно, что ZeroNet предоставляет вам возможности по обновлению приложения, доставки и распространению контента. Причем реализована наиболее сложная логика, которая знимает у разработчиков максимум времени и очень платформозависима.... Очевидным преимуществом для пользователя является БЕСПЛАТНОЕ облако.\n> А теперь посмотрите для чего ZeroNet подходит идеально: музыкальный плеер, а-ля vk.com музыка; референс менеджер, типа Mendeley, Zotero; интернет бибилиотеки - типа http://booksee.org/; распространение приложений и пакетов, по аналогии с PPA и кеширующим репозиториями apt-get и yum....Почему же это всего этого тут нет? Вспомните как Apple платила разработчикам приложений напрямую и какие отчисления получали первые разрабы под iOS. Сразу поймете проблему - нет разработчиков! А это из-за дерьмовой документации... Стандартные примеры не работают. Я потратил 8 часов на первый пример, но он так и не поддался (хотя я никогда не писал под фронтенд). Для плагинов нет описания вообще (напишу сам, если демку сделаю). Нужно улучшать и писать документацию. Срочно, блин, и русскую и английскую...\n\n[заглядывайте ко мне в блог](/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw) как раз начал изучение ZeroNet API, кое-что для себя начал записывать, интересны любые новые идеи",
				"added": 1457770223
			},
			{
				"comment_id": 2,
				"body": "> [kostanew](#comment_79_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Блин, все перепроверил всеравно вываливается.Internal error: TypeError: 'bool' object does not support item assignmentUiWebsocket.py line 98 > UiWebsocket.py line 178 > UiWebsocket.py line 438\n\n\n[попробуй мой](/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/js/all.js)\n[инструкцию здесь взял?](/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this)\nпопробуй описать по шагам что ты делаешь",
				"added": 1457771124
			},
			{
				"comment_id": 4,
				"body": "> [kostanew](#comment_82_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): ОХРЕНИТЕЛЬНЫЙ, ОХРЕНИТЕЛЬНЫЙ пример. Как раз тот интерфейс, который мне нужен для тестирования плагинов. Я с фронтендом обломался, потому что не смог собрать. Как ты свой пример собираешь? Если опять не получится, возьму твой скрипт.\n> По поводу ошибки - эта ошибка в твоем блоге ((\n\nА я немного переписал оригинальный API, пишу на js, ничего не пересобираю. Пробовал, сначала, компилировать кофе, надоело. Ну блог поднял по стандартном алгоритму, а параллельно поднимаю еще адресок так на нем API уже мое будет",
				"added": 1457771423
			},
			{
				"comment_id": 5,
				"body": "> [kostanew](#comment_83_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): По шагам, я компилирую вот так: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0\n> Похоже что один класс становится определен до другого, тоесть кофескрипт не умеет в зависимости? И как собирать all.js силами siteSign из кофескриптов?\n\nThe paste you queried was not found, а не нашелся)\nв документации написано что достаточно запустить zeronet --debug и тогда кофе само приготовится и соберется вместе со стилями в all.js и all.css соответственно, но у меня почему-то не получилось вызвать этого эффекта, можно самому компилить на windows ZeroBundle\\ZeroNet\\tools\\coffee\\coffee.cmd, на linux npm install coffee",
				"added": 1457771472
			},
			{
				"comment_id": 6,
				"body": "> [kostanew](#comment_84_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0 - видимо это баг сайта.\n> http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/ - вот тут в самом верху, пока что еще\n\nпопробуй просто заменить свой all.js на [мой](/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/js/all.js) или [оригинальный](Blog.ZeroNetwork.bit/js/all.js) и снова опубликовать",
				"added": 1457771787
			},
			{
				"comment_id": 7,
				"body": "м> [kostanew](#comment_85_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): @eugenere - как в js сделать загрузку файла, что бы передать его в fileWrite?\n> http://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - тут моя очевидная демка.\n\nэто мне пока самому еще не ясно, еще не дошел, а музыка с твоего адреса играет)  работает audio.js",
				"added": 1457771828
			},
			{
				"comment_id": 8,
				"body": "моя попытка разобраться с тем что же происходит внутри ZeroFrame и его наследниках: [zn.js](/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/?Post:18:ZeroNet+API+на+чистом+javascript) с примером использования для разрешения дополнительной аутентификации чепез zeroverse.bit, а не только zeroid.bit\n",
				"added": 1457773403
			},
			{
				"comment_id": 9,
				"body": "> [kostanew](#comment_88_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Не понял что ты пытаешься выяснить, но смотри ядро ZeroNet/src/Ui/UiWebsocket.py функция actionCertSelect. Там идет обращение к инстансу класса: ZeroNet/src/User/User.py\n> Могу порыться в ядре и объяснить как и что работает. А вообще аутентификацией тут занимался кто то прямо серьезно.\n\nа зачем так глубоко копать, ~/UiWebsocket.py нормально отрабатывает на всех адресах кроме твоего, соответственно проблема не на сервере, а в javascript`e, в all.js\n\nили в подписях/разрешениях",
				"added": 1457774507
			},
			{
				"comment_id": 10,
				"body": "> [kostanew](#comment_89_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Это уже не про мои проблемы с фронтендом\n\n1. есть какой-то удобный инструмент для анализа python? charm?\n2. извини, не понимаю, проблема есть или нету?",
				"added": 1457774715
			}
		],
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 11,
				"body": "> [kostanew](#comment_87_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): https://vk.com/hellozeronet - это кажется мертво. Будем переделывать?\n\nможет, лучше, сюда его переделать?",
				"added": 1457774986
			},
			{
				"comment_id": 12,
				"body": "> [kostanew](#comment_91_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А как людей привлекать?\n\nнаверное как всегда, просто еще пока не особенно есть куда",
				"added": 1457775178
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 13,
				"body": "через [прокси](/ZeroProxies.bit) уже можно пользовать, без авторизации",
				"added": 1457798749
			},
			{
				"comment_id": 14,
				"body": "> [karguine](#comment_2_19PZnNkdsW4dBZdjaJYHAZk3151dkfmB6y): А зачем? Повесить клиент на компе не на 127.0.0.1, а на нормальный интерфейс и ходить на него с телефона. Все это дома, конечно, за рутером и файрволлом.\n\n++ `./zeronet.py --ui_ip \"*\" --ui_port 80` и можно будет ходить по адресу компа типа: http://192.168.1.18/<address>",
				"added": 1457798934
			},
			{
				"comment_id": 15,
				"body": "> [cypher](#comment_12_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Есть просто прокси в виде сайтов:http://bit.no.com:43110http://wrewolf.com:43110http://zero.pags.to:43110http://45.63.123.191:43110https://zeronet.classcoder.com\n\n [и еще списочек прокси](/ZeroProxies.bit)",
				"added": 1457799051
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 16,
				"body": "incremental?",
				"added": 1457951516
			},
			{
				"comment_id": 17,
				"body": "> [kostanew](#comment_117_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): https://github.com/kostaNew/zeronet-easymetrics - уже точно определился, чем я буду заниматься в ближайшее время в рамках ZeroNet. Это плагин, который пишет статистику по ноде каждую минуту. В общем, Stats с логированием. Он может быть полезен для оценки популярности сообществ и оценки суточных колебаний посещаемости. Пока что пишет только количество пиров по сайтам. Нарисую какой-нибудь график уже завтра утром;) Думаю попозже добавлю все остальное. \n> Жду ваших предложений, какая бы информация была вам интересна в первую очередь? Если не знаете что можно получить, посмотрите http://127.0.0.1:43110/Stats .\n> Если кто то заинтересован в аудиодемке, возмитесь за нее, потому что я к ней вернусь не раньше чем через месяц-другой.\n\nстандартные данные: сколько заходов на сайт/страницу/авторизованых...",
				"added": 1457951674
			}
		]
	},
	"comment_vote": {
		"94_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1
	}
}