{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1618659550,
			"title": "Cool web extensions",
			"body": "They are all at least compatible with chromium and certainly with firefox for most of all\nSponsorblock: skip sponsor segment in youtube app\nUblock: adblocker with great details\nDark reader: to create night version of bright site\nSearch by image: help to reverse search an image",
			"added": 1618659549
		}
	],
	"topic_vote": {
		"1613138369_1KihcBqcwgH1TKeZtKRnocUr22oUb5Av5A": 1,
		"1613128614_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1612726861_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1613222411_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 1,
				"body": "The debt of all major country and the centralization of money and ressource.",
				"added": 1613223057
			}
		],
		"1613106625_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": [
			{
				"comment_id": 2,
				"body": "U can check the github it s still active i think",
				"added": 1613223536
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Manjaro, not the the best for stability but the community forum and update release is great and arch is cool to learn",
				"added": 1613455363
			}
		],
		"1614571088_17uXQ7MMjiHb2YJR8DrWCZas6B5S1Hq8mX": [
			{
				"comment_id": 4,
				"body": "It s just u",
				"added": 1614579964
			}
		],
		"1616716381_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "Yeah waiting for this the sun make a ton of reflect on my screen. If people can seriously believe this .....",
				"added": 1616716361
			},
			{
				"comment_id": 7,
				"body": "> [papull](#comment_41_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): Whats all this hatred for an amazing guy who has helped billions in Africa and India through his philanthropic deeds?\n\nI have big doubt his help was philanthropy and just not tax evasion cause the money he give to africa etc... He give it to his own organisation who have operation in africa etc .... The men is certainly not the all mighty evil like some say but it s not a saint either",
				"added": 1617001609
			}
		],
		"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 6,
				"body": "Intel me and amd psp, it s sad to see if u want privacy u need old cpu from 2011. Or wait for arm linux or riscv but the only place they are produce and use in desktop is china so......",
				"added": 1616829151
			}
		],
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 8,
				"body": "Put a bounty or pray santa. If you aren't building it yourself i don't see it happening. And copy Kate works great depending on the video.",
				"added": 1617548168
			},
			{
				"comment_id": 12,
				"body": "> [rannulfr](#comment_92_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): How does Copy kate work? Is there a way I can help?  [...]\n\nFrom what I see they are several version of them cause cool dev let the code open. The last update I see come from 2018. Kopykate run fine in this state, the issue is they aren't content worse hosting and more people publish than host. U can seed video u find interesting, u can find a button for that before cooking on a video. \nFor me the official one is this one tell me if I'm wrong. \nhttp://127.0.0.1:43110/big.kopykate.bit/\nU can also find missing feature that s maybe why it doesn't have a big traffic. But the basics works great and it s quite impressive. Delete it all and try this video. It s quite popular so u should have good speed to dl it. For me the whole is launch in 10sec and doesn't stop until the end. Just put the limit size at 100mb\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1541884826_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1617666152
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 9,
				"body": "I would say except the one really into it, none and that s fine. We don't need to be tag like this or like that like 4chan for exemple. Personally I find it stupid to have the power to discuss with somebody across the world and talk about politics where most things that make sense make sense for one country and not another and people seems desperate to have an intellectual win on the subject communism/facism bad. I would rather have a picture from their dog or garden than their political opinion. I will add that with zeronet u don't have to see what u don't like just add to your block list people where u can't have dialogue and you r good to go. That s maybe why they're not an orientation more than another. 90% of people aren't into politics and will just block everything that extreme on a side or another ",
				"added": 1617548721
			},
			{
				"comment_id": 10,
				"body": "> [calmdownholden](#comment_40_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Most on here are the Schizophrenic variety of Libertarian.The type that believe freedom of information is \"under threat\", despite the only things not allowed on the basic internet are things associated with crime related to human rights violations.\n\nThey are kind of annoying. Still i understand why the migration.  day to day u can talk to less and less subject on those massive plateforme it doesn't has to be against human right violation to be ban. I mean just look at all the story of moderator for those plateforme.",
				"added": 1617575052
			},
			{
				"comment_id": 11,
				"body": "> [deuxzaron](#comment_129_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Race is fake, IQ is fake. Prove me wrong\n\niq is real but never can be test, and race i do think biologicaly they exist, it s just u have to remove the notion cause some low iq will use it for an argument about whatever. At least it can't be bad if everybody think like that about the subject",
				"added": 1617575351
			}
		],
		"1617562900_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 13,
				"body": "> [rajesh](#comment_3_187waCxNNNxx2iXNH7Nztn2gWmBhqbepSD): so where's the link?\n\n............ Magnet 🧲🧲🧲 no link must search use brain",
				"added": 1617888568
			}
		],
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 14,
				"body": "> [karhen](#comment_1_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): against free speechagainst privacy [...]\n\nGo back to fb karen",
				"added": 1618020632
			}
		],
		"1618161310_1AjYqBvptvn6szy3VytC28obDFqsBM27jp": [
			{
				"comment_id": 15,
				"body": "It s an \" look how stupid i am\"\n\"Look he s so much stupid\"\n\"Aha joke on you i do it on purpose\" \nAt least I don't see anybody hosting that craps for  several years",
				"added": 1618239668
			}
		],
		"1618207796_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2": [
			{
				"comment_id": 16,
				"body": "I judge this post 10iq",
				"added": 1618240038
			}
		],
		"1619497869_1KizAYXUiTwgJNNWhTNpnHagNbzop9dXFr": [
			{
				"comment_id": 17,
				"body": "In the old day before the internet was a comie stuff their shit was so badly coded u could do it with a bug of interface. Now those stuff have a lot of value for free u can't have lot of stuff ",
				"added": 1619647006
			}
		],
		"1619276832_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": [
			{
				"comment_id": 18,
				"body": "U lost the spammer update your block list but they are spammer.",
				"added": 1619647128
			}
		]
	},
	"comment_vote": {
		"1_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": 1,
		"12_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"90_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"2_1MPubcGr8qkduM8Bbx5NYvMXcpk4C7Dyup": 1,
		"1258_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"72_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"6_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9": 1,
		"2_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": 1,
		"106_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1
	}
}