{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1578316607_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578530635_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578850250_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1579101041_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1575616298_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 1,
				"body": "The Rise and Rise of Bitcoin 2014 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578220371_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\nThe Rise and Rise of Bitcoin (O surgimento e ascensão do Bitcoin) foi lançado no ano de 2014, dirigido e roteirizado pelos irmãos Mross, o documentário narra a história de Daniel, um programador que se apaixona no ano de 2011 pela criptomoeda bitcoin.",
				"added": 1578220955
			},
			{
				"comment_id": 5,
				"body": "Star Trek VI - The Undiscovered Country (Jornada nas Estrelas VI - A Terra Desconhecida) 1991 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578526748_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n",
				"added": 1578530045
			},
			{
				"comment_id": 16,
				"body": "Star Wars Episode VI Return of the Jedi (O Retorno de Jedi) 1983 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578719255_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578720180
			}
		],
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "there is no half freedom, this is the policy used in big kopy kate 2, I disagree with deleting ANY video from ANY content, for me this is a problem for every user, they block the channel, alias should soon have the option to block channel / user in big kopy kate 2.\n\nEveryone is welcome to post whatever they want on big kopy kate 2, of course after they post shit, and get arrested it's no use crying, the website owner said he won't move a straw to remove content, because according to him, he totally cherishes for individual freedom.\n\nBut at the same time, I think the owner of the site kopy kate big, is in her full right to remove ANYTHING she wanted, just think the site big kopy kate 2 is better for this, because as far as I've seen, the owner or whatever the guy who says owner said he would not delete anything, alias I hope he or they, I do not know if it is a person or several develops this fork of kopy kate big, I hope they really add the option of us block the user, this would help to improve this issue of individual freedom :)\n\n============================================================\n\nnão existe meia liberdade , está é a politica usada no big kopy kate 2, eu discordo de deletar QUALQUER video de QUALQUER conteudo, para mim este é um problema de cada usuário, eles que bloqueiem o canal, alias em breve deve ter a opção de bloquear o canal/usuário no big kopy kate 2.\n\nTodos são bem vindos a postar o que quiser no big kopy kate 2, claro depois se postarem merda, e forem presos não adianta chorar, o dono do site disse que não vai mover uma palha para remover conteudo , pois segundo ele, ele preza totalmente pela liberdade indivudual.\n\nMas ao mesmo tempo, EU acho que a dona do site kopy kate big, está em seu pleno direito de remover QUALQUER coisa que ela queria, só acho que o site big kopy kate 2, é melhor por isto, pois até onde vi, o dono ou sei lá o cara que se diz dono , disse, que não iria deletar nada, alias espero que ele ou eles, não sei se é uma pessoa ou vários desenvolve este fork do kopy kate big, espero que realmente adicionem a opção da gente bloquear o usuário, isto ajudaria a melhorar está questão da liberdade individual :)\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD",
				"added": 1578513012
			},
			{
				"comment_id": 3,
				"body": "> [quantumkitty](#comment_383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Freedom is a very useless word to use in this scenario. I don't have the freedom to walk up to my neighbour and shoot him in the face. Not everything in this world is black and white. Yeah if you want to see people getting murdered and child porn you can go to Kopykate 2. I just don't think that fighting for the right to distribute a murderer's footage and child pornography is a freedom worth fighting for.\n\nI don't fight for anything but FREEDOM.\n\nThere is no half freedom, I just think it's EACH problem to see something or not, whether the person likes it and IS NOT HURTING other people, their problem.\n\nNot mine, except if I do not like something in zeronet, just go there to block user and READY, never see what the guy put, do not think the solution is the site itself, block the content.\n\nBy the way big kopy kate 2, there is only THANKS to your work, I thank you in advance, even though it is not my site, I think your work and I think FUCK, you block on YOUR SITE, who you want.\n\nAnd I think the best option would be EVERY one to have a copy of the site and then whoever wants to access the copy of that individual that he allows or not X thing.\n\nThe good thing about zeronet is that you have TOTAL freedom, ON YOUR SITE.\n\nThe only real way for us at zeronet to exercise our freedom is to do as you did, create your site or clone if you wanted and then post on our own site.\n\nIn the case of Big Kopy Kate 2, I saw a crazy posting who would own it and would not block or delete anything, now IF he will do it, I HAVE NO IDEA.\n\nBut in advance thank you for returning to zeronet, thank you very much.\n\nIf you want, please add support for more decentralized logins, thanks\n\nThere is and my \"political\" view is libertarianism, anarcocapitalism.\n\n====================================================\ntradução pt-br\n\neu não luto por nada alem de LIBERDADE.\n\nNão existe meia liberdade, eu só acho que é problema de CADA um ver ou não algo, se a pessoa gosta disto e NÃO ESTÁ FERINDO outras pessoas, problema dela.\n\nNão meu, fora que se eu não gostar de algo na zeronet, só vou ali em bloquear usuário e PRONTO, nunca mais vejo o que o cara posta, não acho que a solução seja o site em si, bloquear o conteudo.\n\nAlias o big kopy kate 2, só existe GRAÇAS ao teu trabalho, já te agradeço de antemão, mesmo não sendo meu site , acho foda o teu trabalho e acho JUSTO, tu bloquear no TEU SITE, quem tu bem entender.\n\nE acho que a melhor opção seria CADA um ter uma cópia do site e dai quem quiser bastaria acessar a cópia daquele individuo que ele permite ou não X coisa.\n\nO bom da zeronet, é que tu tem TOTAL liberdade, NO TEU SITE.\n\nA unica forma real de a gente na zeronet, exercer nossa liberdade, é fazer como tu fez, criou o teu site ou clonar caso queriam e dai postar no nosso próprio site.\n\nNo caso do Big Kopy Kate 2, vi um doido postando, que seria o dono e não iria bloquear ou excluir nada, agora SE ele vai cumprir isto ,NÃO FAÇO IDÉIA.\n\nMas de antemão te agradeço por voltar a zeronet, muito obrigado.\n\nSe tu quiser, por favor adicione suporte a mais logins descentralizados, obrigado\n\nHá e minha visão \"politica\" é libertarianismo,  anarcocapitalismo.",
				"added": 1578525802
			},
			{
				"comment_id": 4,
				"body": "> [quantumkitty](#comment_388_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Child porn and terrorist propaganda hurts real people. Do you have any idea how many mass shooters the Christchurch attacker has inspired?\n\nI saw the terrorist video and in the case of the terrorist I think it's important that everyone can SEE what an armed psychopath can do and WHY IT IS IMPORTANT EVERYONE has a weapon to defend themselves.\n\nIn the case of pedophiles, I only block, as well as terrorists, I think zeronet website owners have to fight for more freedom and not follow youtube standards and the like, because it starts blocking X or Y content and when you see it like them.\n\nBut in the case of pedophiles in question I'm as simple as that, if the person wants to have sex, and is 10 years old, it's HIS and her parents' problem.\n\nBecause in my city when I was studying, I had a girl with this age, who had sex with older guy, and my policy in these cases is, it was agreed to both parties, ok, their problem.\n\nI think nowadays the 10 year old in 90% of the cases UNDERSTAND the reality, and I think this is up to the parents, they have to take care of their children.\n\nBecause it happened if something like this in my family and I was clear, so and so did something you DIDN'T WANT, the people involved in my family and friends who in this case would be \"victims\" said, no, no and no, nothing happened, It is a lie of the people.\n\nNothing happened, and like I said, if they had wanted to have sex with me I wouldn't do anything.\n\nNow if it wasn't consented I would kill the guy, I wouldn't wait for the state to judge someone who raped a family member of mine.\n\nBut you see, I would kill if it wasn't consensual sex.\n\nI ask who in the case would be the victim, IF she did not want, because for me a person with 10 years already knows very well what is doing and of course the adult, who has to control and etc.\n\nWell, I also saw girls in high school, here in my country Brazil, girls practically grabbing, chasing after older men 18 years, 22 years and even more, this 12 years, 15 years.\n\nHere in Brazil is normal this kind of thing, girls, IREM behind older sex partners, like girls 13 years old, is NORMAL 25-year-old guy here in the US, black goes arrested and fuck, not here.\n\nRemembering THEY WANTING, is not rape, but girls wanting to have sex with the person.\n\nFor apart from that, if he is rapist, here the population kills if they know or the bandits in jail kill him.\n\nHardly rapist here is unharmed.\n\n==================\ntradução pt-br\n\neu vi o video do terrorista e no caso do terrorista eu acho que é importante TODOS poderem VER o que um psicopata armado pode fazer e o PORQUE É IMPORTANTE TODOS terem uma arma para poder se defender.\n\nno caso de pedófilos, eu só dou block , assim como terroristas, acho que os donos de sites da zeronet, tem que lutar por mais liberdade  e não seguir os padrões de youtube e afins, pois começa bloqueando conteudo X ou Y e quando vê está que nem eles.\n\nMas no caso de pedofilios em questão eu sou simples assim, se a pessoa quiser transar, e tiver 10 anos, é problema DELA e dos pais dela.\n\nPois na minha cidade quando eu estudava ,  tinha guria com está idade, que transava com cara mais velhos, e a minha politica nestes casos é , foi consentido as DUAS partes quiseram ,ok , problema deles.\n\nEu acho que hoje em dia a criatura com 10 anos em 90% dos casos ENTENDE bem a realidade, e acho que está tarefa é dos pais, eles que tem que cuidar de seus filhos.\n\nPois já aconteceu caso parecido como este na minha familia e eu fui claro, fulano fez algo que tu NÃO QUIS, as pessoas envolvidas da minha familia e amigos que no caso seriam \"vitimas\" falaram , não, não e não , não aconteceu nada , é mentira do povo.\n\nNão aconteceu nada e como eu disse, SE eles tivessem querido transar com a pessoa EU NÃO FARIA NADA.\n\nAgora se não fosse consentido eu iria matar o cara, eu não iria esperar o estado julgar alguém que estuprou um familiar meu.\n\nMas veja bem, eu iria matar SE NÃO FOSSE SEXO CONSENSUAL.\n\nEu pergunto para quem no caso seria a vitima , SE ela não quis , pois para mim uma pessoa com 10 anos já sabe muito bem o que está fazendo e claro o adulto, que tem que se controlar  e etc.\n\nPois também via no colégio antigamente, meninas, aqui no meu pais brasil, as meninas praticamente agarrando, correndo atrás de homens mais velhos 18 anos, 22 anos e ou até mais, isto com 12 anos , 15 anos.\n\nAqui no brasil é normal este tipo de coisa, de meninas, IREM atrás de parceiros sexuais mais velhos, tipo meninas de 13 anos, é NORMAL transar com cara de 25 anos aqui, nos EUA, nego vai preso e se fode, aqui não.\n\nLembrando ELAS QUERENDO , não é estupro, e sim as meninas querendo transar com a pessoa.\n\nPois fora disto, se for estuprador, aqui ou a população mata se souber ou os bandidos na cadeia matam ele.\n\nDificilmente estuprador aqui fica ileso.",
				"added": 1578529441
			},
			{
				"comment_id": 6,
				"body": "> [draugrdeathlord](#comment_274_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): @quantumkitty thanks to the video been out there people like max Igan (the crowhouse channel on YT) where able to independently research the event and find huge problems with the official narrative.\n\nExactly, this is the point, thought, talk, videos have to be free, then deny runs after catching someone who did something bad to other people, like in the case of \"left and right\", which alias is VERY subjective, because to the left, which sees the devil as the right and everything she says and does and the right in general is a little less radical, but she also dislikes having humor with jesus christ for example that I don't care.\n\nBut I find it funny that in general atheists and communists don't make fun of maomé.\n\n====================================\n\nexatamente , este é o ponto, pensamento, falas, videos tem que serem livres, depois nego corre atrá de pegar  alguém que fez algo de ruim a outras pessoas, tipo no caso de \"esquerda e direita\", que alias é BASTANTE subjetivo, pois para a esquerda, que vê como sendo o demonio a direita e tudo que ela diz e faz e a direita em geral é um pouco menos radical, mas também não gosta que façam humor com jesus cristo por exemplo que EU NÃO LIGO.\n\nMas acho engraçado que em geral ateus e comunistas não fazem humor com maomé.",
				"added": 1578530404
			},
			{
				"comment_id": 7,
				"body": "But always remembering people, the SITE IS HER, she has TOTAL right to remove or leave any material that she finds right or wrong.\n\nThat's why I think it's important to clone zeronet sites, because it helps a lot of people to keep their own stuff and it's also interesting the hub system, because it could only remove the hub and so on.\n\nLike zeronet is very interesting, I prefer the style of big kopy kate 2, which is all in one place, without a hub, the same youtube style.\n\n==========================================================\ntradução pt-br\nmas sempre lembrando gente, o SITE É DELA, ela tem TOTAL direito de tirar ou deixar QUALQUER material que ELA ache certo ou errado.\n\nPor isto eu acho importante está opção de clonar sites do zeronet, pois isto ajuda e muito as pessoas a manterem seus próprios materias e também é interessante o sistema de hub, pois ela poderia só remover somente o hub e etc.\n\nTipo é bem interessante a zeronet, eu prefiro o estilo do big kopy kate 2, que é tudo em um lugar só , sem hub, estilo o youtube mesmo.",
				"added": 1578532489
			}
		],
		"1578530635_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "I disagree with that, the leftist, communist media was lying, using exactly what you want to do, which is denying access to information, or deleting and so on.\n\nI think everyone has to see everything, access everything and each one makes their decision, I have not changed in NOTHING to see the video in question.\n\nAnd I read the terrorist's manifesto and it didn't change anything either, I didn't sympathize with him, the only thing that helped me was that I CLEARLY saw the media. what the media said, who was a supporter of the extreme right wing blablabla.\n\nThe guy was more ecoterrorist, alias was more left as far as I remember.\n\nLike basically the media uses this same argument that you used to say, wow, if people get informed, they'll find it beautiful and that's what the terrorists want, fuck what they want, I prefer to know what this terrorist thought , for I CAN DEFEND from others, do not think hiding knowledge, will end with anything, no, just fuck, just that could defend against the fallacies of these useless tramps.\n\n===============================\ntraduação pt-br\ndiscordo, disto, a midia esquerdista, comunista, estava MENTINDO, usando exatamente isto que tu quer fazer, que é NEGAR ACESSO A INFORMAÇÃO, ou deletar e etc.\n\nEu acho que todos tem que ver tudo, acessar tudo e cada um tome sua decisão, a mim não mudou em NADA ver o video em questão.\n\nE li o manifesto do terrorista e também não mudou NADA, não simpatizei com ele, a unica coisa que me ajudou foi que VI CLARAMENTE a midia MENTINDO, a midia omitia claramente fatos que SE todos tivessem visto o manifesto do terrorista, veriam que não era o que a midia dizia, que era um apoiador da ala da direita extremista e blablabla.\n\nO cara estava mais para ecoterrorista, alias era mais para esquerda até onde eu lembre.\n\nTipo basicamente a midia usa este mesmo argumento que tu usou, de que nossa, se as pessoas se informarem, elas vão achar lindo e é isto que os terroristas querem, foda-se o que eles querem, EU PREFIRO saber o que este terrorista pensava, para EU PODER ME DEFENDER dos próximos, não pense ocultando conhecimento, vai acabar com qualquer coisa, não, só vai fuder , justamente que poderia se defender das falacias destes vagabundos inuteis.",
				"added": 1578537453
			},
			{
				"comment_id": 9,
				"body": "> [draugrdeathlord](#comment_284_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): I would prefer to address the reasons why people commit such atrocities rather than bury the atrocities. [...]\n\nexactly.\n\nKitty doesn't realize that this is exactly what the media does on youtube, tv and etc.\n\nThey want to shut up ANYONE saying what they think is wrong, and that's the problem, the communists think it's wrong for me to say that the free market is better and would probably kill me if I defended it, just as Iranians kill gays for simply being different. , for liking same-sex people.\n\nKind and the media for example cover it up, is this kitty right?\n\nUnderstood, you see now, the media defending the Iranian terrorist, of course the trump or rather the state, government is NOT GOOD, but the US government is BETTER than the Iranian government.\n\nI would prefer ZERO STATE, but if I had to choose between Russia, China, Iran, or the USA, I wouldn't think A Second.\n\nI would choose the US\n\n========================================\ntradução pt-br\n\nexatamente.\n\nA  kitty não percebe que é exatamente ISTO que a midia faz no youtube , na tv e etc\n\nEles querem calar QUALQUER pessoa de falar o que eles acham errado, e este é o problema, os comunistas acham errado eu falar que o livre mercado é melhor e provavelmente me matariam se eu defendesse isto, assim como os iranianos matam gays por simplesmente serem diferentes , por gostarem de pessoas do mesmo sexo.\n\nTipo e a midia por exemplo encobre isto , é certo isto kitty ?\n\nEntendeu, tu viu agora, a midia defendendo o terrorista iraniano, claro que o trump ou melhor o ESTADO, governo NÃO É BOM, mas o governo americano É MELHOR que o governo iraniano.\n\nEu preferiria ZERO ESTADO, mas se tivesse que escolher entre russia, china, irã ou EUA, não pensaria NEM UM SEGUNDO.\n\nEu escolheria os EUA",
				"added": 1578537807
			},
			{
				"comment_id": 10,
				"body": "quantumkitty to simplify my position, I think IF YOU think these videos are wrong, and material about attacks or porn videos and so on.\n\nTake your site, whoever you want, to clone your site or post in big kopy kate 2 and etc.\n\nIt doesn't even stress you, if taking these videos, you feel better, make the kopy kate site your home, let HOW YOU THINK better, be happy.\nBecause if you go after my opinion, I will think X, someone else will think Y, and the important thing is what makes you happy and feel better.\n\nIf YOU feel better removing these contents, DO.\n\nHere at zeronet, we have TOTAL freedom, everyone has to know that who runs the site is YOU, and will only have something if you wanted, because you can delete everything you have in it :)\n\nPeace and good.\n\n=================================================\ntradução pt-br\n\nquantumkitty para simplificar a minha posição , acho que SE TU ACHA errado estes videos, e material sobre ataques ou videos pornos e etc.\n\nTire do teu site, quem quiser , que clone o teu site ou post no big kopy kate 2 e etc.\n\nNem te estressa, se tirando estes videos, tu se sente melhor, faça do site kopy kate a tua casa , deixe COMO TU ACHAR  melhor, seja feliz.\nPois se for atrás da minha opinião , eu vou pensar X , outra pessoa vai pensar Y, e o importante é o que te faz feliz e se sentir melhor.\n\nSe TU se sente melhor removendo estes conteudos, FAÇA.\n\nAqui na zeronet, temos TOTAL liberdade, todos tem que saber que quem manda no site É TU, e só vão ter alguma coisa caso tu queria, pois tu pode deletar TUDO que tiver nele :)\n\nPaz e Bem.",
				"added": 1578540651
			},
			{
				"comment_id": 14,
				"body": "> [quantumkitty](#comment_413_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I'd also like to argue that this makes the mainstream media just as responsible for encouraging mass shootings, if not more than.. say.. the people on 8chan sharing a live GoPro FPV footage of a massacre. So yes, CNN, MSNBC, BBC are all responsible for encouraging mass shootings too. Because they give the mass shooters free Social Media Hits, which are practically the currency of the 21st century.\n\nI don't think anyone but the psychopath who killed people is guilty.\n\nHe and only he who pulled the trigger, he is to blame, if so, what will be the excuse for WW1 and WW2?\n\nTv / videos was not, few had access to this, will see was the books?\n\nNo, I think EVERYTHING has to be accessible so we can learn from the mistakes of others.\n\nThese massacres would be much smaller if they had armored people to defend themselves and others there.\n\nHe only killed so many people, because he's a COWARD, these killers are nothing but COWARDS, why don't they invade police stations and etc?\n\nThey are cowardly killers, for they only attack unarmed people, that's all they are, nothing but cowards.\n\nThey are fearful, they are afraid of what is different.\n\nThey are like any son of a bitch like Hitler, Stalin, Mussolini, Islamist terrorists, they are ALL cowards.\n\nWhen did they attack someone armed like them?\n\nNever seen, only attack PEACEFUL people, they are cowards and liars.\n\n===============================================================\ntradução pt-br\n\nnão acho que ninguém alem do psicopata que matou pessoas seja culpado.\n\nEle e somente ele que puxou o gatilho, ele é o culpado, se fosse assim, qual vai ser a desculpa para 1ª guerra mundial e 2ª guerra mundial ?\n\nTv/videos não foi, poucos tinham acesso a isto, vai ver foi os livros ?\n\nNão , eu acho que TUDO tem que ser acessivel, para podermos aprender com os erros dos outros.\n\nEstes massacres seriam bem menores, se tivessem gente ARMADA, para defender a si e os outros ali.\n\nEle só matou tanta gente , pois é um COVARDE, estes assassinos, nada mais são que COVARDES, por que eles não invadem delegacias de policias e etc ?\n\nEles são assassinos covardes, pois só atacam gente desarmada, só isto que são, nada mais são que COVARDES.\n\nSão medrosos, eles tem medo do que é diferente.\n\nSão como qualquer filho da puta como hitler, stalin , mussolini, terroristas islamicos, são TODOS covardes.\n\nQuando eles atacaram alguém armado como eles ?\n\nNunca vi , só atacam pessoas PACIFICAS, eles são covardes e mentirosos.",
				"added": 1578612657
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk\n\nfuck the fucking state.\n\nYou're worried about the trash of the state, in something that fights ANY censorship, you're funny auhehauhe.\n\nI do not care, the problem of seeing things is the parents of children and not mine, I have to worry about my children and not the children of others just leave only sites that TU allowed him to access on SIMPLE LIKE THIS.\n\n==========================================================\n\nfoda-se o estado porra.\n\nTu está preocupado com o lixo do estado, em algo que luta contra QUALQUER CENSURA, vocês são engraçados auhehauhe.\n\nEu não ligo, o problema de ver as coisas é dos pais das crianças e não meu, eu que tenho que me preocupar com meus filhos e não com os filhos dos outros é só deixar liberado somente sites que TU permitiu ele acessar na zeronet, SIMPLES ASSIM.",
				"added": 1578563638
			},
			{
				"comment_id": 12,
				"body": "and I support the DONO do whatever he wants, the site is HIS and he does what he wants, I wouldn't use such a site, because I value TOTAL freedom, and I think all censorship, dictatorship starts like this, banning X or Y, until they banish what you like, no matter how silly.\n\nThat's why I think it's the best choice, what the crazy thing about big kopy kate 2, seems to have done, which is to leave the site open to EVERYONE, people who should individually block what they think is bad.\n\nAt least today I agree with what seems to be the opinion of the crazy big kopy kate 2 there, because at least spam I saw there, still there auheahuehuae\n\nOr the guy lost the private keys of the site, I don't know aheahueha\n\n===============================================\ntradução pt-br\n\ne eu apoio O DONO fazer o que ELE QUISER, o site é DELE e ele faz o que ele quiser, eu não usaria tal site, pois prezo por TOTAL liberdade, e acho que toda censura, ditadura começa assim, banindo X ou Y , até  banirem o que tu gosta, por mais bobo que seja.\n\nPor isto acho a melhor escolha , o que o maluco lá do big kopy kate 2, PARECE ter feito, que é deixar o site aberto a TODOS, as pessoas que devem bloquear individualmente o que achar ruim.\n\nEu pelo menos hoje concordo com o que parece ser a opinião lá do doido do big kopy kate 2, pois pelo menos spam que vi lá, continua lá auheahuehuae\n\nOu o cara perdeu as private keys do site, sei lá aheahueha",
				"added": 1578594228
			},
			{
				"comment_id": 13,
				"body": "> [styromaniac](#comment_1669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They were getting angry over the precedent of taking the safest route to avoid CP.\n\nI do not care, just block the individual user who post this or ignore, because I do not think we will get anywhere ignoring that there are people who like to have sex with children or adolescents and at least girls from 10 years and up have seen at my school, when I studied with sexual desire outcropped.\n\nI don't care if the thing is VOLUNTARY, if both want it, it's for me and her problem, and especially her family, her father and mother, who have to educate her to focus on studying and not on sex I think I.\n\nBut I think the right thing is to let everything free and anyone who blocks who thinks he should and or create a site like quantumkitty and then moderate it to NOT ALLOW this kind of material.\n\nShe is RIGHT, because the site is HER, she does what She thinks best, I don't care, I just gave my opinion, because she asked and such.\n\nBut it's her site, she's the boss and that's it :)\n\nI will use big kopy kate 2, until something better appears, I also hope to block user function, playlist and support for subtitles and dual audio in the site player.\n\nI hope dev or dev's can add this :)\n\n=======================================================\ntradução pt-br\neu não me importo, é só bloquear o usuário individualmente que postar isto ou ignorar, pois não acho que vamos chegar a qualquer lugar ignorando que tem gente que gosta de fazer sexo com crianças ou adolescentes e no minimo meninas de 10 anos para cima já vi na minha escola, quando estudava com desejo sexuais aflorados.\n\nEu não ligo se a coisa for VOLUNTÁRIA, se os dois quiserem, é para mim um problema dela e do cara, e principalmente da familia dela, o pai e mãe dela, que tem que educar ela para focar em estudar e não em sexo acho eu.\n\nMas acho que o certo é deixar tudo livre e cada um que  bloqueie quem achar que deve e ou crie um site como a quantumkitty  e dai modere ele para NÃO PERMITIR este tipo de material.\n\nEla está CERTA , pois o site é DELA, ela que faça o que ELA ACHAR melhor, eu não ligo, só dei a minha opinião , porque ela perguntou e tal.\n\nMas o site é dela , ela que manda e pronto :)\n\nEu vou usar o big kopy kate 2, até aparecer algo melhor, espero ainda função de bloquear usuário , playlist e suporte a legendas e dual audio no player do site.\n\nEspero que o dev  ou dev's consigam adicionar isto :)",
				"added": 1578612240
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_1670_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Just just just just just stop thinking it will be easy when the CP floods in from many accounts.\n\nThat's why I don't care, because I don't want to take away the person's right to post ANYTHING, I don't care.\n\nAnd if it's any video of my son or daughter, I hope the guy has learned to disappear from the ground, because I'll find the guy and KILL the guy who does this to my son or daughter, without his consent.\n\nSo I don't worry, I know what I'll do if something bad happens to any son or daughter of mine.\n\nNow if the two wanted to have sex, I don't care, I always thought that, even when I was little and my father asked to take care of my sister, tell him to warn her, in front of her and speak clearly, I'll just get in or defend her, IF they try to attack, rape her.\n\nNow, if she wants to or keep giving ball to other boys, as is normal with girls and some brothers, they would want to fight.\n\nI've never been like this, I've always been supportive, everyone knows what's right and IF the guy rapes my sister, son, daughter, I just kill.\n\nI'm going to go to jail, but the bad guy will be killed first.\n\n=================================================\ntradução pt-br\n\npor isto mesmo, não me importo, pois não quero tirar o direito da pessoa postar QUALQUER coisa, eu não ligo.\n\nE se for algum video de algum filhoe ou filha meu, espero que o cara tenha aprendido a sumir da terra, pois vou achar o cara e MATAR o cara que fizer isto com um filho ou filha minha, SEM SEU CONSENTIMENTO.\n\nPor isto não me preocupo, eu sei o que vou fazer se acontecer algo de ruim a algum filho ou filha meu.\n\nAgora se os dois quiseram transar, não ligo, sempre pensei assim, até mesmo quando era pequeno e meu pai pedia para cuidar da minha irmã , avisa para ele avisar ela, na frente dela e falava claramente, só vou me meter ou defender ela , SE tentarem atacar, estuprar ela.\n\nAgora , se ela quiser ou ficar dando bola para outros meninos , como é normal das meninas e alguns irmãos, ficavam querendo brigar.\n\nEu nunca fui assim, sempre fui favoravel a cada um sabe o que é certo e SE o cara estuprar minha irmã, filho, filha , simplesmente mato.\n\nVou ir preso, mas o bandido , vai ser morto antes.",
				"added": 1578626420
			}
		],
		"1579101041_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 17,
				"body": "the owner of the site kopy kate big, said that will delete certain types of videos, such as shootings, porn and etc.\n\nI do not intend to use a site that will delete ANY type of video, because there is no half freedom of expression.\n\nBut I respect her opinion and I think it's right for her to do WHAT she wants on her website.\n\nI simply use another site, such as\n\nBig Kopy Kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\n======================================================================================\ntradução pt-br\n\na dona do site kopy kate big , falou que vai deletar certos tipos de videos, como de tiroteios , porno e etc .\n\nEu não prentendo usar um site que vai deletar QUALQUER tipo de video, pois para não existe meia liberdade de expressão.\n\nMas respeito a opinião dela e acho certo ela fazer O QUE ELA quiser no site dela.\n\nSimplesmente uso outro site, como o \n\nBig Kopy Kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home",
				"added": 1579112993
			}
		]
	},
	"comment_vote": {
		"271_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"62_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"63_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"274_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"284_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"30_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"1692_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}