{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Autojournal fin juin 2018",
			"body": "Sur ZeroUp: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u/Auto-Journal_-_21_Juin_au_...t_2018.pdf.zip\n\nPour le plaisir du partage ;)",
			"added": 1529608975
		},
		{
			"topic_id": 2,
			"title": "Découverte de Thinkerview",
			"body": "Je viens de découvrir, sur Mastodon, le site Thinkerview. Ca regroupe des interviews de plusieurs personnes qui viennent de tous les domaines (politique, journalistes ... etc..). Les questions sont franches et directes, c'est sans filtre. Et donc c'est du vrai journalisme, sans la volonté d'imposer la pensée gauchiste, ni d'aucun autre parti politique d'ailleurs. \nJe vous laisse découvrir: https://thinkerview.com/\n\nLes vidéos sont diffusées via bittorrent et donc on peut télécharger les docus via un fichier torrent ou un lien magnet, et ce en plusieurs qualités !!\nBon visionnage !",
			"added": 1534784097
		},
		{
			"topic_id": 3,
			"title": "Gilets Jaunes à Paris: Acte 5",
			"body": "Des milliers de contribuables Français (il n'ya pas d'étrangers... ni de cas soc) sont toujours en route vers Paris pour manifester contre les mesures (et inactions) de ce gouvernement de pantins... Ce dernier veut nous empêcher de manifester librement sans violence alors que des prières de rue musulmanes interdites se déroulent sous protection policière. Les politiques de tous bords ont peur des Gilets Jaunes parce que ce sont des Français qui travaillent et de tous partis politiques, sans le soutien d'un quelconque syndicat, qui se lèvent et en ont marre de payer pour les autres:\n- les cas soc: qui ne veulent pas travailler parce que ça rapporte plus de faire des mômes et de rester chez soi à percevoir toutes les allocs..\n- les etrangers: l'immigration est un problème, c'est une vérité... Comment peut-on privilégier une migration sans contrôle quelconque alors que nos SDF, eux, ne sont pas pris en compte par le gouvernement. Dans la venue de migrants se trouvent des terroristes et on ne peut plus voir ces connards tirer dans sur des Français... \n- les politiques: Tous les partis politiques sont corrompus, ont des privilèges incroyables, sont payés une fortunes tout ça pour dormir à l'assemblée Nationale... Ces gens sont complètement déconnectés de la réalité et de ce que vivent les Français au quotidien...\nIL FAUT QUE CA CHANGE!!!!!!!",
			"added": 1544867453
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_17pn7w5hkNTH8tUF4KPe3tNjrq6sQsnZDF": [
			{
				"comment_id": 1,
				"body": "Regarde sur ddlfr.pw , tu dois sûrement trouver ça ^^^\n",
				"added": 1532022302
			}
		],
		"8_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 2,
				"body": "sur kodi, il y a CatchUp TV dans les extensions officielles ;) il y a toutes les chaînes de la TNT pour la France :D\n",
				"added": 1536777270
			}
		],
		"2_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": [
			{
				"comment_id": 3,
				"body": "Merci à toi ;) Très bons logiciels !",
				"added": 1541341657
			}
		],
		"2_1PtPEqxGhSk1dmnuNrBursjeyG47yJxh8X": [
			{
				"comment_id": 4,
				"body": "recherche ZeroLSTN sur un moteur de recherche dans ZeroNet ;)",
				"added": 1546434712
			}
		]
	},
	"comment_vote": {}
}