{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1537152793,
			"title": "APEL- ODEZWA-do-WSZYSTKICH.",
			"body": "2018.09.16.01 .- APEL – ODEZWA  - do – WSZYSTKICH.\nWitam; Tym razem piszę do wszystkich, taka mini odezwa. A  konkretnie chodzi o naszą przyszłość w internecie; czyli nasze być albo nie być w przyszłości. Chodzi o wszechobecną cenzurę, która zapętla się wokół nas. Nie trzeba daleko szukać, podam przykład, swój własny. Na pewnym forum pisałem artykuły, napisałem ich 250-sztuk. \nCzy to dużo czy to mało, to nie ma większego znaczenia.  Ostatnio zostałem wykluczony; powód – źle rozmieszczone przecinki, oraz spacje. To był oficjalny powód aby mnie zawiesić na trzy miesiące. A tak mniej oficjalnie; to napisałem dwa zdania, w których było, że historyczna osoba jest złodziejem. Jeśli komuś coś zabiera \nbez pozwolenia, to dla mnie jest to złodziej. Kropka. A drugie zdanie, to że ta osoba utworzyła rodzaj mafii, która włada tym światem. No i poleciałem .Najgorsze w tym  jest to, że nie zrobiłem kopii zapasowych. W sumie,  może i dobrze się stało, bo to zmusiło  mnie do reakcji, czyli – znalezienia środka zastępczego, który by mógł zastąpić tamte forum, i cenzurę. Jest coś takiego jak [ IPFS ], czyli używając normalnego języka; Inter – Planetary – File – System. Jest to zdecentralizowany internet. Niema właściciela, nie ma serwerów, nie ma cenzury. Każdy może korzystać z niego za -DARMO- , to jest ważne w dzisiejszych czasach. Jednym z wielu jest, na przykład;  I nazywa się – Hello-Zero-Net.   Jego zalety:  Jest otwarty, wolny, nie ocenzurowany, i  komunikuje się.  Brak pojedynczego punktu awarii; witryna pozostaje w sieci, dopóki obsługuje ją co najmniej jeden użytkownik. Brak kosztów hostingu:  witryny są obsługiwane przez odwiedzających. Nie można go zamknąć; nie ma go nigdzie, bo jest wszędzie.  Szybki i działa w trybie offline: Możesz uzyskać dostęp do witryny,  nawet jeśli strony Internetowe są zablokowane. I są niedostępne; popularny „error” nie ma tej strony.\n. A teraz – NAJWAŻNIEJSZE -CECHY. Aktualizowane witryny w czasie rzeczywistym. Wsparcie dla domen -  Namecoin.bit – Łatwy  w konfiguracji: rozpakuj i uruchom.   Klonuj witryny za pomocą jednego kliknięcia.\nBezautetyczna  autoryzacja oparta na – BIP32 - : Twoje konto jest chronione przez tę samą kryptografię co portfel Bitcoina. Wbudowany serwer – SQL – z synchronizacją danych – P2P -: umożliwia łatwiejsze tworzenie stron i szybsze ładowanie. Anonimowość: Pełna obsługa sieci – TORA – z ukrytymi usługami; onion zamiast z \nadresami – IPV4 -. Szyfrowanie połączenia – TLS -. Automatyczne otwieranie portu \n- uPnP -.  Wtyczka do obsługi wielu użytkowników ( openproxy ).  Działa z każdą przeglądarką, i systemem operacyjnym. Jak to działa? Po uruchomieniu -zeronet.py -\nbędziesz mógł odwiedzać strony zeronet za pomocą ;  http://127.0.0.1:43110/{zeronet_adres}. TUTAJ POMIJAM dalsze instrukcje. JAK DOŁĄCZYĆ? -Pobierz \npakiet – ZeroBundle: Windows; Apple MacOS; Linux64-bitowy: Linux32-bitowy.\nRozpakuj w dowolnym miejscu;  Uruchom ZeroNet.exe (wgraj); ZeroNet(app)(osx);\nZeroNet.sh (linux). Możesz użyć terminala. I to jest wszystko co jest potrzebne aby \nuruchomić ten system. Na pierwszy rzut może to wyglądać troszkę skomplikowanie,\nale jest tutaj opis na wszystkie systemy; A ty potrzebujesz tylko jeden opis. Ja jestem po pierwszych próbach i testach. Mnie się podoba i jestem bardzo zadowolony, szczególnie po tym jak utraciłem moją pracę, w postaci moich artykułów. Gdybym używał – ZeroNeta- to  bym wszystko zachował...  Mądry polak po szkodzie.   Dlatego zapraszam wszystkich , aby się przyłączyli do zdecentralizowanego internetu. Żebyśmy  byli  mądrzy przed szkodą , a nie po niej.  Im więcej jest uczestników ,tym jest lepiej i szybciej to działa. -NAJWAŻNIEJSZE- to nic nie kosztuje. Twoim kosztem jest użyczenie – 10GB- na dysku twardym. To jest naprawdę nie wiele , w stosunku do zysku jaki otrzymacie potem;                              Ten okręt jest nie zatapialny.   Jest tutaj wszystko; Są strony:  jest poczta;  są blogi;   można umieszczać w sieci filmy; można przesyłać pliki;  Jest za darmo i nie jest możliwe go zniszczyć.  W tym uczestniczy społeczność całego świata;  tylko nas jest ciągle , troszkę mało;  my jesteśmy zawsze na szarym końcu. Czas by to zmienić. Więcej informacji w internecie, ja służę swoją osobą do  pomocy. Warto spróbować, zawsze można zrezygnować, i  wycofać się.  Dziękuję za uwagę, i pozdrawiam wszystkich. \n\nPS. Jeśli zainstalujesz Zero-Net; A chciałbyś się ze mną skontaktować, podaję mój adres pocztowy; [    tomasz21@zeroid.bit    ]. Czekam na was, na Zero-Necie   i Powiadomcie  swoich, bliskich,  znajomych, sąsiadów, przyjaciół; naprawdę warto. \n                     „KOLPORTUJCIE – TĄ – ODEZWĘ”.",
			"added": 1537152792
		},
		{
			"topic_id": 1537231730,
			"title": "Bezpieczeństwo-INTERNET - TOR.",
			"body": "2018.09.18.01.-Bezpieczeństwo – INTERNET - TOR.                                                                                  17 żelaznych zasad dla użytkowników sieci TOR\nautor:   Tomasz Klim \n \n Dzisiejszym artykułem zaczynamy zaś kolejny cykl porad, tym razem dla użytkowników i potencjalnych użytkowników sieci TOR.\nTak naprawdę jest to już drugi artykuł na ten temat na naszych łamach, już wcześniej  bowiem  opublikowaliśmy  zbiór  naszych  wewnętrznych procedur dotyczących szyfrowania dysków twardych                         artykuł :         Ochrona danych o krytycznym stopniu poufności .\nDzisiaj przedstawimy podstawowe zasady korzystania z sieci TOR. Zaś w kolejnych odcinkach napiszemy o: sprzęcie komputerowym i sieciowym, jakiego potrzebujesz, aby zapewnić sobie bezpieczeństwo, bezpiecznym szyfrowaniu dysków, bezpiecznej konfiguracji oprogramowania TOR, oraz stacji roboczych, obwodach zasilających i mechanizmach  kill  switch-ach. zabezpieczających Cię przed przechwyceniem Twoich komputerów włączonych, z rozszyfrowanymi dyskami \nsposobach pracy działów bezpieczeństwa w korporacjach i ich współpracy ze służbami \ntechnikach identyfikacji użytkowników TOR przez korporacje i służby państwowe, oraz metodach oszukiwania tych technik.Jeśli chcielibyście poczytać o innych aspektach TOR, niż te z powyższej listy, piszcie w komentarzach albo bezpośrednio do nas na adres    pomoc@fajne.it.\n\n\n            17 żelaznych zasad dla użytkowników sieci TOR\n1. Bezwzględnie szyfruj wszystkie dane i nośniki związane z TOR (dyski twarde, pen drive'y itp.). Każdy nośnik powinien być szyfrowany innym kluczem/hasłem. W kolejnych artykułach podpowiemy Ci szereg dobrych praktyk związanych z naprawdę bezpiecznym szyfrowaniem nośników. \n2. Używaj TOR tylko na wydzielonej infrastrukturze IT, fizycznie odseparowanej od Twojego normalnego komputera. Maszyna wirtualna nie wystarczy, idealna sytuacja to przynajmniej 3 osobne komputery i dodatkowy router (po co aż tyle, wyjaśnimy w kolejnych artykułach). \n3. Nie używaj TOR na laptopie, chyba że ma całkowicie wyjętą baterię i jest na stałe przypięty w jednym miejscu, jako komputer stacjonarny. Nie wynoś komputerów i nośników związanych z TOR poza zaufany lokal, w którym pracujesz. \n4. Nie daj się zaskoczyć z włączonymi komputerami i rozszyfrowanymi nośnikami danych. Zasilaj je za pośrednictwem tzw. kill-switchy, umożliwiających odcięcie zasilania i wyłączenie komputerów jednym ruchem ręki, oraz automatycznie w przypadku wyłamania drzwi wejściowych. W jednym z kolejnych artykułów podpowiemy Ci, jak skutecznie zabezpieczyć lokal za pomocą kill- switchy i innych niespodzianek dla nieautoryzowanych gości. \n5. Nigdy nie przenoś danych i nośników z komputerów związanych z TOR do Twojego normalnego komputera. Niech to, co robiłeś w TOR, pozostanie tylko w Twojej głowie, oraz na nośnikach schowanych w bezpiecznych miejscach - ale nadal podłączanych w razie czego tylko do komputerów przeznaczonych do użytku z TOR. \n6. Nie pracuj na komputerach związanych z TOR jako administrator. Pracuj na zwykłych kontach, a uprawnienia administratora uzyskuj za pomocą su/sudo tylko na potrzeby wykonania danej czynności administracyjnej. Co jakiś czas reinstaluj od zera całe oprogramowanie używane z TOR, twórz nowe konta, konfiguruj na nich od początku przeglądarkę itd. A jeśli chcesz używać systemu Windows, koniecznie wykonaj te kroki. \n7. Przyjrzyj się oprogramowaniu typu Tor Browser. Używaj na komputerach związanych z TOR albo takiego oprogramowania, albo standardowego, ale skonfigurowanego w analogiczny sposób, tj. wyłączone ciastka, wyłączone różne pluginy do przeglądarki itd. \n8. Zwracaj uwagę na to, czy łączysz się z poszczególnymi stronami przez połączenie http (nieszyfrowane), czy https ( szyfrowane ). Unikaj stron bez obsługi https, w szczególności nie pobieraj z nich dużych plików (większych niż kilka megabajtów) i nie wypełniaj na nich jakichkolwiek formularzy. \n9. Jeśli chcesz używać z TOR oprogramowania do obróbki grafiki, do składu tekstu itp., bądź niestandardowych czcionek, rób to wyłącznie na kolejnym, dedykowanym do tego komputerze. Upewnij się, że na głównej stacji roboczej do TOR nie ma zainstalowanych żadnych niestandardowych czcionek. \n10. Nie uruchamiaj żadnego oprogramowania ściągniętego przez TOR - nawet tego podpisanego cyfrowo (może ono wpływać na konfigurację komputera, np. modyfikując działanie przeglądarki, i posłużyć do identyfikacji Twojego komputera). Jeśli naprawdę musisz, rób to na kolejnym, dedykowanym do tego komputerze, uruchamianym z Live CD i wyłączanym po każdym użyciu. \n11. Nie ufaj i nie mów nikomu, co robisz w sieci TOR. Nawet żonie i dzieciom. Staraj się nie pić alkoholu (jeśli już, to tylko w niewielkich ilościach i w zaufanym towarzystwie), ani nie używać żadnych substancji wpływających na działanie umysłu. \n12. Nigdy nie podawaj za pośrednictwem TOR swoich prawdziwych danych osobowych, adresowych, ani żadnych innych związanych z Tobą lub innymi osobami, które znasz (w szczególności, których nie lubisz, lub które nie lubią Ciebie). \n13. Jeśli zarabiasz w sieci TOR, nie afiszuj się stanem majątkowym i nie kupuj nic dużego i/lub rzucającego się w oczy (samochód, mieszkanie itp.) za zarobione pieniądze. Nie wprowadzaj tych pieniędzy do obiegu bankowego. Fizycznie je ukryj i traktuj jako zabezpieczenie na czarną godzinę (tj. na wypadek, gdy nie będziesz się już musiał przejmować wytłumaczeniem komukolwiek ich pochodzenia, bo będziesz miał na głowie poważniejsze problemy), możesz także \"dosypywać\" sobie z nich (byle z umiarem!) do oficjalnych dochodów i kupować dzięki temu droższe, zdrowsze jedzenie, nieco lepsze ubrania, zacząć chodzić na siłownię, czy nawet od czasu do czasu kupić tańszy komputer stacjonarny albo inną rzecz potrzebną do pracy. Pamiętaj jednak, by za wszystkie te rzeczy płacić wyłącznie gotówką i nie brać faktur, a jedynie paragony. \n14. Jedna z podstawowych technik identyfikacji użytkowników w sieci TOR to korelacja czasowa zdarzeń - czymkolwiek zajmujesz się w sieci TOR, staraj się wypracować strategię łamania korelacji czasowej: Twoje maile powinny być wysyłane automatycznie, gdy Ty śpisz lub gdy jesteś poza zaufanym lokalem, najlepiej o losowych porach (w kolejnych artykułach podpowiemy Ci, jak to zrobić). Na Twoim łączu internetowym powinien przez cały czas (24/7) być ruch związany z siecią TOR, nawet niewielki (może to być pobieranie w kółko jakichś losowych plików lub cokolwiek innego). \n15. Jeśli Twoje komputery zostaną Ci odebrane przez funkcjonariuszy, a następnie oddane - pamiętaj: to już nie są Twoje komputery. Możesz z nimi zrobić dwie rzeczy: używać do całkowicie jawnych celów (np. dać dziecku do zabawy i pamiętać o legalności ewentualnych gier), lub sprzedać np. na Allegro. Absolutnie nie uruchamiaj na nich już nigdy TOR, nie używaj haseł związanych z TOR, nie odszyfrowuj dysków twardych, ani nie podpinaj żadnych nośników (poza płytami DVD z oryginalnym, legalnym oprogramowaniem). \n16. Jeśli prowadzisz ukrytą usługę TOR na dedykowanym serwerze w firmie hostingowej, traktuj zdarzenia takie jak podpięcie czegokolwiek do portu USB, czy nagłe wyłączenie/restart maszyny, jako jej kompromitację. Jeśli do tego doszło, absolutnie nie rozszyfrowuj już nigdy dysku na takiej maszynie (przygotuj się zawczasu - powinieneś mieć backupy danych, oraz zapasowe maszyny w innych serwerowniach). \n17. Jeśli dopiero chcesz prowadzić ukrytą usługę TOR - pamiętaj, że Twoja wolność i bezpieczeństwo są ważniejsze od stabilności łącza i wydajności łącza, serwera, czy dysków. Pojedyncze łącze i kilka megabitów przepustowości powinny w zupełności wystarczyć na początek, więc w miarę możliwości uruchom tą usługę bezpośrednio z lokalu, w którym pracujesz, zamiast z zewnętrznej serwerowni, nad którą nie masz żadnej kontroli. I koniecznie pamiętaj o kill-switchach. Ten artykuł jest częścią  misji wyrównania szans przeciętnego człowieka w starciu z korporacjami i służbami działającymi  z pozycji siły.   Na koniec. Cytat: Wiedza bywa groźna, a niewiedza jest dużo bardziej groźniejsza.  Pozdrawiam.",
			"added": 1537231728
		},
		{
			"topic_id": 1540669109,
			"title": "APEL – DO – WSZYSTKICH..  APEL - TO - ALL.   APEL - ALLEN.",
			"body": "Witam;Apel do wszystkich – Jeśli można nie wyłączajcie swoich Pc-tów.\nDotyczy szczególnie po wrzuceniu jakiegoś materiału. Dajcie trochę czasu aby można było z -SEDOWAĆ- Dzięki  temu można ten materiał powielić. Dzięki.\n\nAPEL - TO - ALL.\n\nHello, Appeal to everyone - If you can, do not turn off your PCs.\nThis applies especially after inserting some material. Give some time to be able to \"SEND\" - Thanks to this, you can duplicate this material. Thanks.\n \n\nAPEL - ALLEN.\n\nHallo, Appell an alle - Wenn Sie können, schalten Sie Ihre PCs nicht aus.\nDies gilt insbesondere nach dem Einlegen von Material. Geben Sie etwas Zeit, um \"SENDEN\" zu können - Dank diesem können Sie dieses Material duplizieren. Danke.",
			"added": 1540669106
		}
	],
	"topic_vote": {
		"1538409225_1CwAz9Szgavc6z8mW3QnrzX4XWLTiJZRqN": 1
	},
	"next_comment_id": 79,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Witam; czy ktoś mówi po polsku?Jak by co ,to proszę się odezwać.",
				"added": 1537095297
			},
			{
				"comment_id": 2,
				"body": "Witam; czy ktoś mówi po polsku?Jak by co ,to proszę się odezwać.",
				"added": 1537095314
			},
			{
				"comment_id": 3,
				"body": "Witam; Czy jest tu ktoś ,kto mówi po polsku? Proszę się odezwać.",
				"added": 1537095431
			},
			{
				"comment_id": 4,
				"body": "Hallo; Ich habe es auch versucht, aber nichts ist daraus entstanden. Sie brauchen einen Informatiker. Oder Bedienungsanleitung.\n\nWitam; Ja też próbowałem,ale nic z tego nie wyszło. Potrzebny jest informatyk. Albo instrukcja obsługi.",
				"added": 1537183135
			},
			{
				"comment_id": 42,
				"body": "Co za dureń wrzuca takie teksty? Czy on ma coś z głową?\nWhat kind of fool dumps such texts? Does he have anything with his head?",
				"added": 1549551734
			}
		],
		"1537152793_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 5,
				"body": "Witam; Dobrze by było trochę reklamy zrobić w tym temacie. Ten tekst przesłać do wszystkich znajomych i nieznajomych . Może ktoś dołączy? Liczy się każda głowa. Pozdrawiam.",
				"added": 1537209190
			},
			{
				"comment_id": 23,
				"body": "Witam; Polska strona istnieje i nie istnieje. To wszystko zależy tylko od nas. Czy będziemy wspierali ten pomysł. Jeśli zbierze się grupa ludzi,którzy używają polskiego na co dzień. To wtedy można zaszaleć. Próbowałem założyć stronę po polsku; ale wychodzi że za małe mam umiejętności w tej materii. Gdyby ktoś chciał pomóc zainstalować; to byłbym wdzięczny. Problemem jest że wszyscy po angielsku mówią. I instrukcje też są po EN. Ja znam niemiecki i rosyjski. Akurat w tym przypadku to jest troszkę mało. Ale jest za to pomocne w wyszukiwaniu ciekawych materiałów. Rosja niema cenzury; naprawdę i są tam kapitalne materiały, począwszy od historycznych, technicznych, leczniczych, humor, taniec, muzyka, przyroda, zwierzęta, geografia, chemia, wynalazki, No tutaj biją na głowę wszystkich. Można się dużo nauczyć od nich, naprawdę. U nas też było, ale się skończyło; coraz więcej ograniczeń, które pomału usuwają niezależną opinię na bok, jak i tych co mają inne zdanie. Dlatego te miejsce jest doskonałe dla wszystkich tych co mają coś do powiedzenia, jak i tych co szukają  prawdziwych relacji z otoczeniem. Tutaj można bezkarnie ( naprawdę )dyskutować o wszystkim, jak i o wszystkich. Nawet o tych nietykalnych i świętych. Wracając do strony, w naszym języku. Ja wrzuciłem parę filmów na- Zero-UP. Ale się zatkał, coś muli. Filmy, Są po polsku, problemem jest ograniczenie od minimum 10MG-a , do 200MG-a. Krótszych rzeczy nie da rady,jak i dłuższych ,które przekraczają ten limit. Prywatna strona, i właściciel może robić co chce. Drugie miejsce na którym wrzucam filmy wraz z opisem jest tutejszy; Jou-Tube. Tutaj można o wiele więcej, niema takich ograniczeń. A do tego można umieścić jakąś  wiadomość, do filmu i nie tylko. Ja wrzuciłem już jakieś 60 szt.Można je łatwo rozpoznać po wirującym sześcianie na niebieskim tle. Te filmy są w naszym języku,    ( przeważnie ). No czasami jest też coś po - EN -zazwyczaj w opisie jest zaznaczone. Tematyka jest różna, jej zakres zależy w dużym stopniu od oglądających. Mam spore archiwum. Wciąż jest pełne. Wiele z tych pozycji już niema po tamtej stronie, albo po tej. Jak kto woli.  Zostały po prostu wycięte i usunięte. Ja je wciąż mam i mogę udostępnić dla ludzi. Powiem tak , głupot nie zbieram; To co jest moje, to jest zazwyczaj sprawdzone i zweryfikowane. Nie dotyczy ciekawostek i humoru. ( taki żart ). Co do stron to musimy my sami to zorganizować. Ja jestem pierwszy na ochotnika, jak ktoś pomoże - to wspólnymi siłami tą stronę zrobimy. Obiecuję ciekawe artykuły i filmy . W tych sprawach pisać na pocztę - tomasz21@zeroid.bit - . Co do ilości ludzi to chyba ich trochę jest, tylko się ukrywają. A może się wstydzą? Odzywajcie się - jest wtedy dużo raźniej.Wiadomo że istniejecie, że jakby co to jest wsparcie. Naprawdę niema co się wstydzić naszego języka. Jest on dobry i trudny dla naszych przeciwników. Dlatego nawołują na -EN-. Piszcie do mnie na pewno odpowiem. - Strefę - naszą strefę, musimy sami stworzyć.\nPozdrawiam.",
				"added": 1544143351
			},
			{
				"comment_id": 24,
				"body": "> [misiek](#comment_2_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G): Ale tzw. Polska Strefa tu w 0necie chyba nie istnieje. Nie mogę nic namierzyć. Może słabo szukam? Dajcie jakieś namiary na polskie strony\n\nNiewiele tego; A szukać trzeba; ZeroSites     i tam u góry strony jest napis - Filter,- należy go   otworzyć  i wpisać PL   , Pokaże to co jest.",
				"added": 1544149895
			},
			{
				"comment_id": 25,
				"body": "To ci co próbowali,coś zrobić. Jest zapewne trochę ludzi co tylko zaglądają, pozostaje tylko starać się zwerbować nowe twarze. Jest szansa, bo wszędzie przykręcają śrubę. Ja reklamuję, gdzie tylko się da. Najgorsze jest lenistwo. Zobacz statystyki, wszystkie nacje świata; a my na końcu ( szarym ). Pisz na pocztę to można swobodniej rozmawiać, bo to o czym rozmawiamy to pewnie nikogo nie interesuje.",
				"added": 1544223909
			},
			{
				"comment_id": 26,
				"body": "Pocztę masz założoną?",
				"added": 1544224080
			},
			{
				"comment_id": 28,
				"body": "> [borys](#comment_1_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P): A nie wiecie co się stało z Polskim Zer0Talk, bo kiedyś były wpisy, a teraz jest pusto?\n\nWitam; Z przyczyn technicznych na razie utknął w martwym punkcie. Nie za bardzo mogę przeskoczyć temat samodzielnie. Potrzebna jest pomoc kogoś kto jest bardziej kumaty w tych sprawach. Ja mam braki techniczne. Na Zero-Upa wrzucam filmiki, oraz na Jou-Tube. Niebieski wirujący sześcian to jest moje logo. A reszta może być różna. Pytania i opinie na jedną z tych poczt kierować, wszystkie sprawdzam.Może ty podejmiesz się założenia strony? Wtedy nam mówiącym w tym języku będzie łatwiej, się kontaktować. Potrzeba się zorganizować, wtedy będzie można działać. Pozdrawiam.",
				"added": 1545013962
			},
			{
				"comment_id": 29,
				"body": "> [madrage](#comment_1_1JaNpeJpXXwNHUSaZmDwNSKyx45YPSFbK2): Wszystko fajnie i super. Idea jest mocna tylko mam jedno ale...Każdy z nas który tu dotarł wie co nieco o internetach (tak przynajmniej zakładam) i dotarł tutaj ponieważ czuje ze coś jest nie tak. Sądzę ze większość z ludzi którzy tu odwiedzają 0 zna jego zalety  i wady, sadze ze jeśli chcesz zrobić coś dla platformy zacznij ja promować pora nią :) Niech Minionki zostaną oświecone ! PS:Dysleksja wredną suką jest.\n\nWitam; Dzięki za odpowiedź. Z tą wiedzą o internecie to bywa różnie. Są tacy co coś niby wiedzą, ale nie do końca wiedzą co? Ja na ten przykład jestem samoukiem, uczę się tego co jest mnie akurat potrzebne. Czyli na pierwszym miejscu stawiam bezpieczeństwo. No i w związku z tym dosyć sporo wiem na ten temat. Ja trafiłem tutaj z premedytacją. Sytuacja zmusiła mnie do tego. Od pierwszego dnia reklamuję ten typ internetu. Powiem tak , ze skutkiem bardzo mizernym; Pytanie dlaczego? Odpowiedzią jest lenistwo ludzkie. Jeśli muszą coś tam zrobić, to zaczynają się schody. Czyli znajdują mnóstwo wymówek na nie. Po za tym większość używa windy, a tam wszystko jest prowadzone za rączkę; + ( inwigilacja ). Są tam starzy znajomi, stare problemy, i nic nie trzeba zmieniać w życiu. Startując w ZeroNecie, trzeba zacząć myśleć, i działać samodzielnie, i wtedy jest  ( następuje panika ). Ale to jest jedyną szansą na przetrwanie, samodzielnych ludzi. Ludzi którzy myślą i działają. Dobrze że napisałeś, dobrze że się odezwałeś, jest nas coraz więcej; To jest argument na plus. Masz pytania? - Pytaj? Jak nie ja , to ktoś inny zna odpowiedź. W dużej grupie jest raźniej. Ja obecnie wrzucam filmy po polsku na Zero-Upie, YouTubie, KOP-KAT-cie. Jeśli możesz seduj. Ja twoje filmy też będę sedował. Daj tylko znać, gdzie i kiedy. To jest nasze być, albo nie być. To jest nasze przetrwanie. A Minionki z czasem do nas dołączą. A jeśli nie, to ich strata. Odzywaj się, niech to nie będzie jednorazowe. Pozdrawiam.",
				"added": 1545266996
			},
			{
				"comment_id": 30,
				"body": "One - oni, się nie zmienią; niestety. Swoje robić, - dobre, ( właściwe rzeczy propagować ). W tej chwili pozostał nam tylko wolny internet, w którym możemy , mówić i pisać, to wszystko co chcemy. I wszystkim wara jest do piszących te teksty. Cenzura poszła do budy. ( buda dla psa ).",
				"added": 1545296007
			},
			{
				"comment_id": 31,
				"body": "\"Po prostu nie rozumieją.\" - Tak oczywiście masz rację.Kontrola była, jest i będzie, na to nic nie poradzimy. Ta kontrola się wciąż nasila. Chodzi o to żeby móc spokojnie porozmawiać na wszystkie tematy, żeby cenzor nie usunął tekstu, żeby ten tekst przetrwał. Jest to możliwe, pod jednym warunkiem, duża liczba czytelników. A dokładnie użytkowników, bo to oni po przez -SEDOWANIE- sprawiają że artykuły i filmy stają się nieśmiertelne. \nOne są teraz słabe, nie wiadomo na jaki temat pisać, nie wiadomo jakie filmy wrzucać?Trzeba jak najwięcej znajomych namówić  do używania tej dystrybucji. Ciężkie zadanie, ale trzeba cały czas próbować i namawiać, wiercić dziurę w brzuchu, aż do skutku. Kiedyś podziękują, na pewno. Hasło naczelne, wytrwać i przetrwać.",
				"added": 1545442745
			},
			{
				"comment_id": 32,
				"body": "Witamy na pokładzie, nie zatapialnego lotniskowca. Każda dodatkowa para rąk na klawiaturze, gwarantuje tej grupie nieśmiertelność. Oglądanie jest dobre, a jeszcze lepsza jest działalność. A najlepsze jest wsparcie , tym stronom i blogom, które są w naszym języku. Nie wymieniam kraju; bo go tak naprawdę to już niema, jest ułuda co dla niektórych, że on jeszcze istnieje. Najlepiej jest sprawdzić, kto nami zarządza? Wtedy jest wiadomo kto jest właścicielem tego burdelu. Będzie lepiej, jeśli potrafimy się rozmnożyć jak szarańcza. I jak szarańcza będziemy kąśliwi. Najważniejsze że tutaj jest niezakłócony przepływ informacji. Jest dobra i sprawna poczta, dzięki której można się komunikować prywatnie. Oraz może tu być wszystko; absolutnie wszystko, ' CO - STWORZYMY - SAMI' . To teraz my mamy głos. To są początki, i od nas zależy co będzie dalej.\nNo chyba wystarczy, agitacji i reklamy. Pozdrawiam.",
				"added": 1545798687
			},
			{
				"comment_id": 34,
				"body": "Witam; Jak dobrze zrozumiałem, zmieniłeś system, czyli masz innego Pc-ta. Wiec na pewno masz inny, kod i inny adres.Ja to rozumiem tak; Pierwszy Pc-et, dostał kod - adres, do tego dostał, nicka, dostał Json-a, To stanowi komplet rozpoznawczy. Jeśli wszystko sklonowałeś na drugi Pc-et, to powinno działać. Ale ty na pewno \nna tym drugim zainstalowałeś wszystko od nowa, więc masz drugi komplet, drugi zestaw, Ten pierwszy jest zajęty przez ciebie na tym pierwszym Pc-cie. Tylko klonowanie, daje ten sam duplikat, z wszystkimi danymi.\nA drugi jest, drugi inny. Jeśli oglądasz jakiś film? to mały kawałek masz u siebie na przechowaniu; służy on do poskładania przez trzecią osobę. Jak rozpoznać gdzie jest ta cząstka? Do tego służą te wszystkie adresy. Po tych adresach zbiera się wszystkie cząstki do kupy i masz cały film do dyspozycji. Czyli dwa Pc-ty = dwa różne adresy. Dwa różne adresy = dwa różne nicki. Jeden jest już zajęty, przez pierwszego Ciebie. Trochę to zawiłe, ale to tłumaczy jak działa ten system. Tutaj niema serwerów do przechowywania. Podzielone i rozrzucone po całym świecie. Zęby pozbierać do kupy , to każda cząstka ma inny adres. Ja mam trzy Pc-ty, i mam trzy nicki,\ntrzy poczty, wszystko razy trzy. Jak na razie to nie stanowi problemu.Pozdr.",
				"added": 1545916743
			},
			{
				"comment_id": 35,
				"body": "Celem doinformowania; ZeroNet, to nie jest  oaza bezpieczeństwa. On z tym niema nic wspólnego, To jest tylko niezatapialny lotniskowiec: Tutaj można uczynić nieśmiertelnym, każdy artykuł, każdy film. Który w innym miejscu zostałby ocenzurowany, albo wycięty, To daje nam - pozwala, aby nasza myśl przetrwała wieczność.\nTa wieczność zależy od Sederów, jak i oglądaczy. Temat bezpieczeństwa postaram się opisać wkrótce, w osobnym artykule. Jest to temat rzeka. I w zależności od wiedzy można go rozwijać w nieskończoność. Na bezpieczeństwo nałożono, pęta, i sznur wisielczy. Wszyscy zostali spętani. Pozdrawiam.",
				"added": 1545945306
			},
			{
				"comment_id": 37,
				"body": "Na temat bezpieczeństwa, przygotuję artykuł, to może chwilę potrwać. Jestem trochę chory. W każdym bądź razie nie mam żadnych złudzeń co do bezpieczeństwa. Ono nie istnieje, nigdzie, to tylko ułuda chwili. Postaram się to opisać, w przystępnym języku. Można tylko odwlec w czasie.Jednorazowo, można i to jest wszystko.\nSnowden, materiały przekazał na Pendriwie ; Dlaczego nie przesyłał? Bo on wiedział, że nie można tego bezkarnie zrobić. I go zaraz namierzą. Tak że jeśli oczekujecie bezpieczeństwa, - to go tutaj niema, za to jest bezkarna możliwość umieszczenia materiału, dla potomności, po wieczne czasy. Ktoś kto mówi inaczej to opowiada bajki na dobranoc dla grzecznych dzieci. Tak wygląda prawda. Freenet, jest też lotniskowcem, podobnej rangi jak ZeroNet. Tutaj walczymy tylko z cenzurą, i to skutecznie. To wszystko. Pzdr.",
				"added": 1546088819
			}
		],
		"1537239676_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 6,
				"body": "Hello, a lot of it has been gathered. Should it be all? Maybe slowly, I can do it somehow. I greet you.",
				"added": 1537244497
			}
		],
		"1538053887_14WGRwSbM55c5DuiSCME94BTj6GozZ48op": [
			{
				"comment_id": 7,
				"body": "I use; Mozilla Firefox.Debian-8. Everything works. 127.0.0.1:43110",
				"added": 1538054399
			},
			{
				"comment_id": 9,
				"body": "Instalacja w terminalu. Zakończona pomyślnie. Terminal dalej otwarty. Otwieram przeglądarkę. Wpisuję adres-http://127.0.0.1:43110  -  Enter - Otwiera się ZeroNet.  Installation in the terminal. Finished successfully. The terminal is still open. I'm opening the browser. I enter the address-http: //127.0.0.1: 43110 - Enter - ZeroNet opens.",
				"added": 1538070139
			}
		],
		"1538054944_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 8,
				"body": "TO jak można to używać?Mam dużo ciekawego materiału, którym chciałbym się podzielić.\nSo how can you use it? I have a lot of interesting material that I would like to share.",
				"added": 1538059974
			}
		],
		"1538367782_1G77baH5aGCXXRrUkyWQwmeCJppzC56wc2": [
			{
				"comment_id": 10,
				"body": "Bardzo dobra uwaga;  Very good attention;",
				"added": 1538396322
			}
		],
		"1539770700_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 11,
				"body": "Najlepiej,jak zaczną się martwić o swoje długi. Chiny są bardzo daleko, i to nie jest nasze zmartwienie.\nIt's best if they start worrying about their debts. China is very far away, and it is not our worry.",
				"added": 1539781914
			},
			{
				"comment_id": 12,
				"body": "> [leftside](#comment_304_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): You haven't heard of the theory that says flapping of a butterfly in Beijing causes Hurricane in America?And I live in Korea next to China.\n\nWitam;Szanuję Chiny i Koreę ,za to co robią dla swojego kraju.Pełny szacunek.Tu gdzie mieszkam jest inaczej.Nas dawno sprzedali,nie pytając się nikogo.Dlatego co trochę dostajemy zastępcze tematy.\nHello, I respect China and Korea, for what they do for their country. A full respect. Where I live is different. They sold a long time without asking anyone. That's why we get some substitute subjects.",
				"added": 1539798516
			}
		],
		"1540468101_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 13,
				"body": "Totalne bzdury;Nic dodać nic ująć.To się nazywa piąta kolumna.",
				"added": 1540503717
			}
		],
		"1540970777_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 14,
				"body": "Witam; Jest to też strategiczny punkt na ziemi. Chyba najlepszy. Kto go posiada,ten ma szanse przeżyć.To tak przy okazji. Bo szykuje się totalna rozpierducha. Pozdrawiam.\nHello; It is also a strategic point on earth. Probably the best. Whoever has it has the chance to survive. That's the way, by the way. Because a whole span is getting ready. Greetings.",
				"added": 1540975281
			}
		],
		"1541904191_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 15,
				"body": "Witam;Wszyscy pośrednicy są umoczeni.( spaleni ). Bezpiecznie jest tylko ,pomiędzy dwoma osobami. Bez żadnego pośrednika- czytaj ( gumowe ucho ). Kryptografia jest dobra ; jeśli spełnia pewne warunki. Jeśli jest tego brak. To wszystko można rozbić o kant dupy.A firma gogle,to jest spalona firma. Niema tam możliwości powrotu do normalności. Publikacje to jedno. A przesył ważnych ( poufnych-tajnych ) informacji to jest druga strona medalu.Pzdr.",
				"added": 1541934529
			}
		],
		"1542060084_12c3mbFn8EzBa5Tw3WnZ12azK99YsNHszA": [
			{
				"comment_id": 16,
				"body": "Witam; Widzę że  Polskę znasz tylko z telewizji? To dlatego chyba jesteś, mocno w błędzie. Dwie różne sprawy; Dwa różne kraje. Kraj dla turysty - Kraj dla mieszkańca. Nie myl propagandy dla obcokrajowców, ( telewizja ). Nie zapominaj , że u samej góry ( władzy ) - jest bardzo mało Polaków. Polską żądzą obce mocarstwa. I orkiestra gra tak ,jak dysponent zarządzi. Polacy mają gówno do powiedzenia ( dosłownie ). A to że życzliwie traktujemy wszystkich, bo tak mamy zakodowane w genach od tysięcy lat; To dlatego mamy zawsze przesrane, i pod górkę jesteśmy pod okupacją. NASTĘPNEGO TYRANA. Poczytaj niezależnej historii, o Polsce. Tutaj w ZeroNecie też masz filmy o Polsce na niezależnym - you-tubie.\nObejrzyj a szybko zmienisz zdanie, jak naprawdę jest. Co tobie można i co niemożna. Co Tobie wolno, a czego nie jest ci  wolno.  Spróbuj na normalnym You-Tubie w internecie coś wrzucić nie takiego co by się podobało?\nTwój film zostanie natychmiast wycięty. I nikt go nie zobaczy, taką mamy wolność i takiego wspaniałego prezydenta. Pozdrowienia. Dla wolno myślących.",
				"added": 1542110828
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 17,
				"body": "Debian-8-KDE.Cały sprzęt.W tym dwa Pc-ty. plus trzy laptopy.\nDebian-9- Próbowałem ,ale coś z nim jest nie tak. Intuicja mówi = Gówno.\nPozdr.",
				"added": 1542289484
			},
			{
				"comment_id": 19,
				"body": "Witam; Czytam i oczom nie wierzę. Hej -goberman- Gdzie ty byłeś,jak Bóg rozum rozdawał? Chyba poszedłeś na siku. Moja rada, poczytaj trochę o informatyce, a potem publicznie zabieraj głos. Bo tym wpisem,to ty się nie popisałeś.",
				"added": 1543072619
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 18,
				"body": "Witam; ZeroNet, jest po to ,aby cenzura nie mogła zlikwidować filmu czy wpisu, który może być nie wygodny dla góry. On jest i zarazem go nie ma.\nNiema serwerów, to i nie można go cenzurować. Pzdr.\n\nHello; ZeroNet is for censorship not to eliminate a movie or entry that may not be comfortable for the top. He is and he is not.\nThere are no servers, and you can not censor it. Pzdr.",
				"added": 1543003387
			},
			{
				"comment_id": 21,
				"body": "Witam; To się wszystko zmieni. Kiedy dokręcą nam mocniej śrubę. Wtedy ludzie zaczną szukać alternatywy wolności. To przykręcanie , się dzieje cały czas. Tylko bardzo powoli,i stopniowo. Cały czas blogi, są blokowane, ograniczane przez cenzurę. Niepokorni są wyrzucani – usuwani. Mnie tak załatwili. Poszukałem alternatywy. I znalazłem  ZeroNet. Trzeba popularyzować, i reklamować wśród znajomych. Pozdrawiam. \n\nHello; This will change everything. When they tighten the screw more tightly. Then people will start looking for an alternative to freedom. It's screwing, it's happening all the time. Only very slowly, and gradually. All the time blogs are blocked, limited by censorship. The indomitable are thrown out - removed. They did it to me. I've looked for an alternative. And I found ZeroNet. You need to popularize and advertise among your friends. Greetings.",
				"added": 1543340809
			},
			{
				"comment_id": 22,
				"body": "> [eightyfour](#comment_31_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): It won't work unless there's more content. I've introduced ZeroNet to friends and family, they shrug and never use it again because there's barely any content to keep them here. They'll trickle back to farcebook, twatter and plebbit. Until there's something here that they can't easily access elsewhere. Sure Art 13 might bring that, but chances are they'll still be able to find copyrighted material on the clearnet in the EU.\n\nTo zależy tylko od nas. Jaki materiał wrzucimy.Jeśli będzie ciekawy? To będzie widownia.Ja wrzucam na JouTube.Filmy dla PL-EN.\nIt depends only on us. What material will we throw in. If it's interesting? This will be the audience. I put on JouTube. The movies for PL-EN.",
				"added": 1543442217
			}
		],
		"1543163412_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 20,
				"body": "Witam; Ciekawe poruszasz tematy.I dobrze jest więcej wiedzieć.Czekam na pierwszy artykuł.Pozdrawiam. \nHello; Interesting topics you're talking about. And it's good to know. I'm looking forward to the first article. I'm happy.",
				"added": 1543173169
			}
		],
		"1544560849_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 27,
				"body": "Nie używam żadnych platform społecznościowych. Inwigilacja.\nI do not use any social media platforms. Surveillance.",
				"added": 1544564719
			}
		],
		"1545774097_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 33,
				"body": "Aktualna jest, ( 3742 ).   The current one is (3742).",
				"added": 1545799106
			}
		],
		"1546024584_1JFAYb8MxcPAMjUbMopSKA1gVKSWs6d2HZ": [
			{
				"comment_id": 36,
				"body": "Witam; Wystarczy że wyłączą prąd wszędzie. Jak zlikwidują internet,\nto oni też nie będą mogli korzystać.\nHello; It's enough to turn off the electricity everywhere. How to eliminate the Internet,\nthey will not be able to use them either.",
				"added": 1546025366
			}
		],
		"1548796017_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 38,
				"body": "A coś takiego jak \" exit\" , ja to stosuję i chyba działa dobrze.",
				"added": 1548814311
			},
			{
				"comment_id": 39,
				"body": "Przepraszam, zapomniałem dodać, że ZeroNeta, trzy kropki + zamknij + prawa strona zamknij. Dopiero terminal, exit.\nI'm sorry, I forgot to add that ZeroNeta, three dots + close + right side close. It was only the terminal, exit.",
				"added": 1548833427
			}
		],
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": [
			{
				"comment_id": 40,
				"body": "I use a translator; It is difficult to understand. Sorry.",
				"added": 1549202311
			}
		],
		"1549482207_18EuCdX79X4qbLEFBDLiaTSbkXU1ojM9A2": [
			{
				"comment_id": 41,
				"body": "Warum? Dlaczego? Why?",
				"added": 1549483134
			}
		],
		"1549624613_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 43,
				"body": "Witam; Czy Debian i Ubuntu, to nie są dwie różne dystrybucje? I potrzebują dwie różne instalacje?\nHello; Are Debian and Ubuntu, are not two different distributions? And they need two different installations?",
				"added": 1549632114
			}
		],
		"1550064181_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 44,
				"body": "Dobrze wiedzieć; dzięki.\nGood to know; thanks.",
				"added": 1550066096
			}
		],
		"1550599552_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 45,
				"body": "Witam; Linuxa trzeba wspierać, bo to jest nasz system. I informacje od niego są nam potrzebne.\nHello; You need to support Linux, because this is our system. And we need information from him.",
				"added": 1550604080
			}
		],
		"1550671109_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 46,
				"body": "Jak można temu zaradzić? w prosty sposób?\nHow can you remedy this? In a simple way?",
				"added": 1550684265
			},
			{
				"comment_id": 47,
				"body": "Wszystkie są przypięte; Filmy, reszta jest bez znaczenia.\nThey are all pinned; Movies, the rest is irrelevant.",
				"added": 1550712728
			}
		],
		"1550754018_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 48,
				"body": "Mają co chcieli.Barany stoją w kolejce do rzeźni.\nThey have what they want. The barons are lining up for the slaughterhouse.",
				"added": 1550775094
			}
		],
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 49,
				"body": "Witam; Ta Dyskusja, Prowadzi do tego, że użytkownicy chcieli by mieć google,\nSprawa jest prosta; Są  google w normalnym internecie. A ten internet jest trochę inny. Jest bez cenzury, i bez serwerów, i nie można go wyłączyć. To jest zaleta ZeroNetu. A braki  kiedyś zostaną naprawione.  To nie jest dla leniwych, i mało przedsiębiorczych. Jak to mówią, „nie dla psa kiełbasa”. Tutaj mają dołączyć aktywni ludzie, a nie śpiochy bez jaj. A co do braku programów, to musimy stworzyć sami. Czyli do roboty. Pozdr.\nHello; This Discussion, It leads to the users wanting to have google,\nThe matter is simple; They are google on the normal internet. And this internet is a bit different. It is uncensored, and without servers, and it can not be turned off. This is the advantage of ZeroNet. And the shortcomings will be repaired one day. This is not for lazy, and not very enterprising. As they say, \"not sausage for a dog\". Active people should join here, not sleepyheads without eggs. And as for the lack of programs, we have to create ourselves. So to work. Pozdr.",
				"added": 1551025755
			}
		],
		"1551108132_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 50,
				"body": "Witam; W przypadku Rosji, chodzi o bezpieczeństwo ( szpiegostwo ), na wypadek wojny jak zostaną za atakowani.To nie jest blokada, tylko urząd celny, pełna kontrola przepływu informacji w obie strony. Rosja przeszła na \"Linux Astra\" wszystkie urzędy. Zbudowali swój procesor, który niema tylnych wejść, dołożyli do tego płytę główną. Czyli mamy komplet. Dystrybucja Linux. Własny PC-et. A teraz dołożyli własny internet; Jest komplet.\nHello; In the case of Russia, it is about security (espionage), in the event of a war, how they will be attacked. This is not a blockade, only the customs office, full control of the flow of information in both directions. Russia has switched all offices to \"Linux Astra\". They built their processor, which has no rear inputs, they added a motherboard to it. So we have a set. Linux distribution. Own PC-et. And now they have made their own internet; It's a set.",
				"added": 1551108733
			}
		],
		"1551258681_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 51,
				"body": "Popieram.\nI support.",
				"added": 1551271867
			}
		],
		"1551567748_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 52,
				"body": "zgadzam się; Jak to zrobić? Jak dotrzeć do myślących?\nI agree; How to do it? How to reach the thinking people?",
				"added": 1551570673
			}
		],
		"1552109959_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 53,
				"body": "Chciałbym sprawdzić. Pod jaką nazwą szukać?\nI would like to check. Under what name to look?",
				"added": 1552121827
			},
			{
				"comment_id": 54,
				"body": "Witam; Nie chodzi o waluty, cryptowaluty. Chodzi o łączność że światem, tak jak zeronet. Sprawdzałem ale nic nie znalazłem dlatego pytam. Czy są jakieś podobne aplikacje do Zero Netu. Do kontaktu ze światem, bez cenzury i serwerów. \nHello; It's not about currencies, cryptovalutes. It's about connectivity with the world, just like zeronet. I checked but found nothing, that's why I'm asking. Are there any similar applications for Zero Net. For contact with the world, uncensored and servers.",
				"added": 1552143739
			},
			{
				"comment_id": 55,
				"body": "Czyli pozostaje - ZeroNet, i  - IPFS. Dla większości ludzi IPFS- jest nie do przeskoczenia, jest za trudny. Niema co liczyć na szybki rozwój. Chyba że powstanie coś nowego.\nSo it remains - ZeroNet, and - IPFS. For most people, IPFS is unbeatable, it is too difficult. It's not good to count on rapid development. Unless something new arises.",
				"added": 1552199420
			}
		],
		"1552480101_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 56,
				"body": "Zadam zasadnicze pytanie; Dla kogo pracuje Firefox?\nI will ask the main question; Who does Firefox work for?",
				"added": 1552483014
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 57,
				"body": "Mnie się podoba; brak serwerów, brak cenzora, mogę pisać , wszystko ( prawie ). Na co mam ochotę. Mogę przesłać film bez pośrednika, który może ocenzurować. Jest poczta, bez pośrednika. Wadą jest, dla innych -   skomplikowanie. Ale To można opanować, dla chcącego nic trudnego. Małe ciasne ale własne. ( mieszkanie ). Środek do komunikacji grupy ludzi, którzy chcą coś powiedzieć. Mają coś do powiedzenia.\nI like it; no servers, no censor, I can write, everything (almost). What I want. I can send a video without an intermediary who can censor. There is a post office, no intermediary. The disadvantage is complicated for others. But It can be mastered, for those who want nothing difficult. Small tight but own. (flat). A means of communication for a group of people who want to say something. They have something to say.",
				"added": 1552859505
			}
		],
		"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD": [
			{
				"comment_id": 58,
				"body": "Chyba w niezależnym internecie nie mogą zakazać? Ten internet jest i jednocześnie go niema. Jak czegoś niema, to jak można zakazać?\nI guess they can not ban on the independent internet? This internet is also silent at the same time. How is something dumb, how can you ban?",
				"added": 1553193294
			},
			{
				"comment_id": 59,
				"body": "Witam; dzięki za obszerne wyjaśnienie. Coś więcej już wiem. Czyli trzeba wymyślić jakieś obejście tego problemu. Na pewno coś tam da się wykombinować. A czasy zaczynaj ą się robić mało ciekawe. Pozdr.",
				"added": 1553286622
			}
		],
		"1553266759_1NSEdEkdgjDGRYMqLpL9BzrQ7YgYsFRZUy": [
			{
				"comment_id": 60,
				"body": "Nie powinno się nazywać-czysta sieć. ( clearnet ). A powinno się nazywać - cenzurowana-sieć.\nOne should not be called a pure -clearnet-. And it should be called - censored-network.",
				"added": 1553287648
			}
		],
		"1553958946_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 61,
				"body": "Po co zmieniać na nowe? Jak stare jest sprawdzone i dobre, i jest bez podsłuchu.\nWhy change to new ones? How old is checked and good, and is not eavesdropped.",
				"added": 1553960174
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 62,
				"body": "Kup z demobilu kompa; uruchom ZeroNeta, oglądaj co chcesz, a jak przyjdą i zabiorą. To sobie drugiego kupisz za parę euro.\nBuy from a computer demobil; start ZeroNeta, watch what you want, and how they will come and take. You buy the second one for a pair of euros.",
				"added": 1554128200
			},
			{
				"comment_id": 67,
				"body": "Co to jest Piractwo? A co to jest wolność słowa? Czy potrafisz odróżnić?\nWhat is Piracy? And what is freedom of speech? Can you distinguish?",
				"added": 1555451003
			},
			{
				"comment_id": 68,
				"body": "To jest mafia!\nThis is mafia!",
				"added": 1555536919
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 63,
				"body": "Pomału jest na +. Ludzie zaglądają, i oczekują fajerwerków. Zamiast samemu coś się dorzucić do tego programu. Byłby większy wzrost.\nIt's slowly on +. People are looking in and waiting for fireworks. Instead of something to add to this program yourself. There would be more growth.",
				"added": 1554147263
			}
		],
		"1554227095_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 64,
				"body": "Ja piszę na brudno; jak jest sprawdzone, poprawione, zatwierdzone. To robię kopiuj, i wklej, gotowy tekst.\nI write dirty; as it is checked, corrected, approved. I'm doing a copy and paste, ready text.",
				"added": 1554240684
			}
		],
		"1554989632_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 65,
				"body": "To było do przewidzenia, że go sprzedadzą. To była tylko kwestia czasu. On powinien o tym wiedzieć. Powinien się zabezpieczyć. Chodził do szkoły, i nie nauczył się czytać między wierszami.\nIt was predictable that they would sell it. It was only a matter of time. He should know that. He should be protected. He went to school and did not learn to read between the lines.",
				"added": 1555016013
			}
		],
		"1555441653_1KKyuMCpzQ3ZxrT8tpkrBaqodWLiyL8kZ7": [
			{
				"comment_id": 66,
				"body": "Są tutaj ludzie, którzy nie chcą  być ograniczeni przez cenzurę. Chcą mówić to co myślą. Choć może się to niektórym nie podobać.\nThere are people here who do not want to be restricted by censorship. They want to say what they think. Though it may not please some of them.",
				"added": 1555450784
			}
		],
		"1556113790_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 69,
				"body": "Działa.",
				"added": 1556132112
			}
		],
		"1558041340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 70,
				"body": "Chrześcijanin = pachołek żydowski.",
				"added": 1558085346
			}
		],
		"1558612556_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY": [
			{
				"comment_id": 71,
				"body": "Nagraj w .mp4  - na kompa. a następnie wrzuć na ZeroNeta. Linki służą do śledzenia, kto, z kim ma kontakt.\nRecord in .mp4 - on your computer. and then place it on ZeroNeta. The links are used to track who has contact with whom.",
				"added": 1558613997
			}
		],
		"1559682829_1CZMjjnu2qd6BuoeLC35vc4o7A9LRtQZrJ": [
			{
				"comment_id": 72,
				"body": "I quote:   Thinking is a solitary path.\n            There is nothing to expect from the group in terms of thinking, thinking is really the enemy of the group.\nThinking in the group is just an editorial line for lazy thinkers.\n        I no longer participate in pseudo centralized forums, which if you understand what a forum is, doesn't make any sense, because speech is public, which means uncensored.\n\nWitamy na pokładzie wolnego internetu; Tutaj nikt ciebie nie zbanuje. \nNapisałeś, mądre słowa. Pozdrawiam.\n  \n\nWelcome aboard the free internet; Nobody will ban you here.\nYou wrote, wise words. Greetings.",
				"added": 1559725967
			},
			{
				"comment_id": 73,
				"body": "The only solution is your own website.\nMy own site.\nYour own blog.\npozdr.",
				"added": 1559816388
			}
		],
		"1560042831_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 74,
				"body": "Jest to ciekawe co piszesz.It is interesting what you write.",
				"added": 1560069631
			}
		],
		"1566400778_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 75,
				"body": "I suggest a good psychiatrist.",
				"added": 1566409736
			},
			{
				"comment_id": 76,
				"body": "This is different.",
				"added": 1566412822
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 77,
				"body": "Ciekawy pomysł; wykup wszystkiego srebra. Nawet podoba się mnie. Ale o jednym zapomnieliście panowie? Te srebro trzeba od kogoś kupić. A może nie trzeba? Pierwszych paru może te srebro kupić, ale reszcie mogą zablokować. ( i na pewno to zrobią ). I co wtedy z tym zakupami? Które mają zablokować system? Druga wątpliwość; gdzie kupować to srebro? Pomysłodawca nie powiedział. Czyżby w kiosku \"RUCHU\". Pozdrawiam.",
				"added": 1566814621
			},
			{
				"comment_id": 78,
				"body": "Interesting idea; buy out all silver. I even like it. But you forgot about one gentlemen? You have to buy this silver from someone. Or maybe you don't have to? The first few can buy silver, but the rest can be blocked. (and they will definitely do it). And what about this shopping then? Which are to block the system? Second doubt; where to buy this silver? The originator did not say. Is it at the \"RUCHU\" kiosk. Greetings.",
				"added": 1566826358
			}
		]
	},
	"comment_vote": {
		"2_18yg7K6AsrgChMnnsA1JTthZV6FStzWaY4": 1
	}
}