{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1566010067,
			"title": "Dear black people",
			"body": "You guys are racist bigots and I cannot believe all of the far right national socialist extremism(like food stamps) I see on this board. Why do you guys not use proper pronouns for transgender people? I can not stand all of your microaggressions when you talk to people.(like saying nigga) Why won't you pay a reparations tax to minorities? Minorities have had a difficult struggle and black people are guilty and must pay for their guilt.\n\nSounds pretty retarded once you realize white people are a minority.",
			"added": 1566010066
		},
		{
			"topic_id": 1566010567,
			"title": "Will onenet be released?",
			"body": "I'd make it but I'm busy with fishing and pooping out that fish bc i'm not good at identifying the good ones.  Other things I do, collect vegetables and fruits from my land, shooting squirrels and eating them.  Using my obama phone to shitpost.  I'm also a quantum physicist.",
			"added": 1566010565
		},
		{
			"topic_id": 1566012765,
			"title": "Why did dudes marry 12 year olds up until the 19th century?",
			"body": "Seems odd since that's pedophilia.   Perhaps bc that's when they started to produce children?  Maybe bc that's when they start to ovulate??  Are we being lead wrong on this shit like epstien, a false flag to make people think they are sick when they should be wanting to fuck some 13 year olds?  Don't lie, you know you want the pure tight virgin pussy with small tits, it's the most requested and pornstars like angel smalls getting railed by a massive cock basically looks like a 13 year old and a massive nigger.  Any dude that says they don't get attracted  to 14+ are fucking liars imo.  Either that or don't believe in god, or evolution, so you have no escape.  Bc both fucked 9 year old.",
			"added": 1566012762
		},
		{
			"topic_id": 1566014028,
			"title": "Niggers suck bc we don't give them anything to do.",
			"body": "I know, bc I'm white, we sit around in these fag areas like suburbs, urban areas are even worse, all you can do is spend money for fun, no yards, no gardens, no friends bc it's all disorganized ages.  Need a car to go anywhere, buses cost 8 bucks round trip, evening for a single guy is 40 bucks, that's what I made during my min wage 30 hour wtf!   All jobs are min wage now, programming jobs suck nigger dick and still close to min wage wtf!! No wonder so many people shoot up others.  If you are enraged and going to shoot up people, consider shooting up the government people instead of random walmart people bc you will actually do something.  I would reccomend papartazzi videos to know where and when the faggot alite are going and then do your thing, not endorsing it, just saying the obvious.",
			"added": 1566014024
		},
		{
			"topic_id": 1566014817,
			"title": "WHy are jews so insecure using anti semitism when it's literally criticisms?",
			"body": "Sorry jews buttfucking 12 year old boys when your a dude is gay.  How is that antisemitism?  They will find a way, bc they are the niggers of society right now, blacks have been a blessing, jews are literally trash.  Blacks, I love you, jews will try to divide us.  It's prolly why the jews enslaved blacks and once they found out us white people wheren't on board and fought a literal war for them they gave up.  So many white people said fuck jews at the time, blacks where free.  Consideration, jews own sports, and they use blacks as slaves.",
			"added": 1566014812
		},
		{
			"topic_id": 1566015881,
			"title": "fbi thread",
			"body": "Thread for us fellow fbi agents that get paid shitty.  What makes you do it?  Hows that pay LMAO?",
			"added": 1566015875
		},
		{
			"topic_id": 1566352663,
			"title": "Lets murder spez and all redit employees, then concentrate on central banking employees until they are all dead.",
			"body": "This is how a revolution is done, only laarping here.  don't actually do this.  Quit murdering walmart people for no reason, if you do what I say you will take back america.  First you need to learn sniper stuff, take out people that matter like hillary clinton to stop childs trafficing.  Then concentrate on people like spez, you can prolly poison him easily bc he's a broke fag.  All of this needs to be done at the same time bc the governemnt will start protecting people.  \n\nNext you go to reddit and shoot them up, then facebook and twitter ect, all of them are jews so prepare for no resistance just media attention.  This is what real shooters do, just trying to prove a point, nobody is mad at random walmart people unless they false flag.",
			"added": 1566352656
		},
		{
			"topic_id": 1566354194,
			"title": "Jews are dumb idiots that think they are bacon burning ona grill",
			"body": "I wonder what greater religion tricked jews into thinking they are so good, and no whites of course.  Easy comeback on that but I'll save it for another post if this picks up.  \n\nJews are dumb guys, they don't have a higher iq.   Look at their race, basically useless.  Even mongrel children have scored better than jews.  Jews basically are post jesus also, no pre jesus as they believe.",
			"added": 1566354186
		}
	],
	"topic_vote": {
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": 1
	},
	"next_comment_id": 44,
	"comment": {
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "This is going to blow up soon, 8ch users just realized how normie they are.  You criticize SAFE people but do you have any zites?  You have over 50 replies in 24 hours, seems like this is a thing.",
				"added": 1566008063
			}
		],
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 2,
				"body": "> [223556](#comment_145_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Petty criminals all need the bullet.  [...]\n\nI pay people to take my grass.",
				"added": 1566008307
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 3,
				"body": "Yea that is what p2p is, has worked brilliantly.  The poor leech and contribute when they can bc they appreciate it, and the rich are using seedboxes that overcome the poors takes.  \n\nAlso take note in tribes, they use socialism bc they have more than enough resources and hunting is fun anyway, in capitalism the idea is to jew out the tribe and make them slaves to you on the idea that resources are scarce.  \n\nI'm not arguing for either side bc it's way more complex than that with 3x the amount of people and growing in a limited resource environment, once capitalists actually do get scarcity is when you get depression and deaths.  Tribes limit their numbers bc they aren't retarded.",
				"added": 1566008821
			},
			{
				"comment_id": 4,
				"body": "> [dkeyzjkeys](#comment_3_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): Yea that is what p2p is, has worked brilliantly.  The poor leech and contribute when they can bc they appreciate it, and the rich are using seedboxes that overcome the poors takes.   [...]\n\nMy example would be p2p again, when you get so many leechers and have to wait for a ufc fight for 6 hours bc nobody is sharing.  The growth + non sharing makes the torrent drag out.  In private trackers everybody is a boss and share bc they are being watched with ratio, so it always goes fast.",
				"added": 1566009185
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 5,
				"body": "imagine losing your dick in an accident and becoming a woman bc your whole gender is based on a penis.  op is a retard.",
				"added": 1566009373
			},
			{
				"comment_id": 6,
				"body": "btw i'm a dude and make cakes and wedding dresses for a living.  not once did i think i was a female bc of it.  Just be you, no body mods needed. Not even gay, just know how to make girls look super hot looking.",
				"added": 1566009689
			}
		],
		"1566010067_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 7,
				"body": "Post I'm referring to:  \n\nYou guys are racist bigots and I cannot believe all of the far right nazi extremism I see on this board. Why do you guys not use proper pronouns for transgender people? I can not stand all of your microaggressions when you talk to people. Why won't you pay a reparations tax to minorities? Minorities have had a difficult struggle and white people are guilty and must pay for their guilt.",
				"added": 1566010211
			},
			{
				"comment_id": 8,
				"body": "> [qspitzer](#comment_70_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): it might be helpful to put the original post in quote form. A full list of formatting options can be found here\n\nThanks boss",
				"added": 1566010679
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_774_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): took your pills tonight ?\n\nI don't take pills, try it, you might get what it means.",
				"added": 1566010843
			}
		],
		"1565922890_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 10,
				"body": "Um no, that's not what it means.  It means males and females can be more or less associated with masculine or feminine social constructs.",
				"added": 1566011347
			},
			{
				"comment_id": 11,
				"body": "> [rusnoob1](#comment_18_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Some evidence of this science?\n\nHe's referring to something people call, personality.  Then using it to fuck kids or chop his dick off by completely misinterpreting it.",
				"added": 1566011518
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 12,
				"body": "btw don't get at me on normalizing pedophilia, I'm trying to normalize animal culture and see the truth of it.  All mammals fuck within a year of ovulation.  So why don't we?  I'm presenting the argument, I personally love fucking grannies.  Jizzing in them is way better than condoms.",
				"added": 1566013031
			},
			{
				"comment_id": 14,
				"body": "> [l3v](#comment_5_15KqJWMF66JypCYG6hy4MnMJTVcpS29igp): Most animals are also retarded\n\nI think you forgot to make your point.  Why I prefer to jizz in a granny, less child support, a jew creation.",
				"added": 1566014405
			}
		],
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 13,
				"body": "> [taylovedyou](#comment_6_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo): Please uninstall Zeronet, thanks.\n\nThis is a faggot or nigger comment, please uninstall yourself for being a fag.  You have nothing to contribute.",
				"added": 1566013427
			}
		],
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 15,
				"body": "site not updated for 2 years.  Barking up a tree bc you didn't find more pedo content and got scared.  Nobody is coming for you bro, all models are of age on there bc it's illegal if not and therefor you'll never encounter it.",
				"added": 1566015052
			},
			{
				"comment_id": 16,
				"body": "> [iloveguac](#comment_4_1A2bJUxDcvDbsZ1ttC1fSgy6J74ghfmpxU): You can literally just clone the site and have a new site that you run.\n\nI agree though , i might be forced to program an image broad that is rule free, too easy. but i dont want to be the pedo guy.",
				"added": 1566015368
			},
			{
				"comment_id": 17,
				"body": "Fucking pedos, not that it's wrong, but it's illegal.  If you get a girl and stay with her for life I'm okay with with it, literally how we become us.",
				"added": 1566015569
			}
		],
		"1566015881_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 18,
				"body": "I do it bc it's easy and no real way to connect anyone on tor.  Pedophles meh, they are just looking at kids naked, no real threat ehre.  I only look for bombers.",
				"added": 1566015985
			},
			{
				"comment_id": 19,
				"body": "Guys if you wanna fuck 12 year old imo it's fine but we will pound you if you do it for real.  Look at all the pedo shit you want, not what we are going for.",
				"added": 1566016253
			}
		],
		"1566352663_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 20,
				"body": "LAARP alert: walk into any central abk and start shooting, then leave, change clothes, 90% chance you get away.  Snipe people, easy kills, make sure you do people like jizzlane max.",
				"added": 1566352846
			},
			{
				"comment_id": 21,
				"body": "Point is, stop shooting up schools and actually do something cool.  Why walk into a mosque and kill random people?  Better to kill a person like jfk, right?",
				"added": 1566352922
			},
			{
				"comment_id": 26,
				"body": "> [duck0](#comment_113_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): That's one way to get people talking about this place.\n\nI'm just laarping but it doesn;'t stop facebook fags so lets laarp",
				"added": 1566354269
			},
			{
				"comment_id": 27,
				"body": "Killing a huge target also gets you into history.  Think about it first, look at who influences people to do it they might be more powerful.  Spex is #4 on sites owned, and clearly helps people indoctrinate others as terrorists.   But killing spez is too weird for you, kill his family members.  It would be funny also, nobody cares about spez, and would laugh at him until he dies himself after breaking his bones on a jailbed.",
				"added": 1566354679
			},
			{
				"comment_id": 28,
				"body": "BTW if you need spez addres sand shit you probably arent qualified but I can provide you with it.",
				"added": 1566354937
			},
			{
				"comment_id": 29,
				"body": "Afterall, docs on everybody is legal now, dox everybody, collect data, we happened to collect data on spez.",
				"added": 1566354993
			},
			{
				"comment_id": 30,
				"body": "Want bill gates addy?  I gotchu.  Kill him also.  Easy kill bc he tried to get out of the way and now in a farmtown.  Could blast him with anything and leave.",
				"added": 1566355119
			},
			{
				"comment_id": 31,
				"body": "Good i have filled both with bitcoin lets see if they do it",
				"added": 1566355312
			},
			{
				"comment_id": 32,
				"body": "87000 bitcoins to go to mAKE THE WORLD BETTER",
				"added": 1566355370
			},
			{
				"comment_id": 33,
				"body": "20 bitcoins for spez, lets go faggots",
				"added": 1566355553
			},
			{
				"comment_id": 34,
				"body": "write you number on his face when you kill him and you get it.",
				"added": 1566355601
			},
			{
				"comment_id": 35,
				"body": "i love killing pieces of shit, so fun, so godlike.",
				"added": 1566355707
			},
			{
				"comment_id": 36,
				"body": "Just bought some more data on spez, might kill him myself.   #Lovedatabrokers  thanks android",
				"added": 1566355960
			},
			{
				"comment_id": 37,
				"body": "> [trotski](#comment_14_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): this is the saddest thread in ZeroNet history\n\nGet wrecked, I'm openly going to kill your leaders from data acquisition.  Nothing you can do LMAOOOOOOOOOOOO",
				"added": 1566356077
			},
			{
				"comment_id": 38,
				"body": "WOrks both ways homeboy, I'm sending updates to my assassin squad with nsa exploits just like you do.",
				"added": 1566356264
			},
			{
				"comment_id": 39,
				"body": "for all i know they are russian and going to kill the president.  Guess that twitter update will screw him LOL",
				"added": 1566356328
			},
			{
				"comment_id": 40,
				"body": "5 minutes",
				"added": 1566356531
			},
			{
				"comment_id": 41,
				"body": "i'd like to thank nsa for this kill, thanks backdoors.",
				"added": 1566356605
			},
			{
				"comment_id": 43,
				"body": "Done, watch news tomorrow for who we got.",
				"added": 1566357009
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 22,
				"body": "I agree child porn should be made legal bc it;'s fucking sick to watch, therefore people stop lusting over it.  You can tell easily what type of people are trying to do it.  Even irl, it's super easy to spot a pedo.",
				"added": 1566353279
			}
		],
		"1566256283_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 23,
				"body": "> [randomshits](#comment_52_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I know this is a bit excessive... but there's just so many to love!!!Lil Nas X, Cardi B - Rodeo (Not Your Dope Remix)MORTEN - HypnotizedMija - Secrets (Crankdat Remix)POKEMON GOLD/SILVER (CG5 Trap Remix)Fortnite Theme Song (SKY Remix)DRAGON BALL SUPER Ultimate Battle (Trap Remix) (Goku VS Jiren)Rick and Morty - Evil Morty Theme Song (Feewet Trap Remix)\n\nTry to link with indvio.us , so we don't see ads.",
				"added": 1566353443
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 24,
				"body": "Clearly not censorship lol.  Good with me, this shit happens, and way way worse across the globe, better to know about it than cower like a bitch.",
				"added": 1566353737
			},
			{
				"comment_id": 25,
				"body": "> [dkeyzjkeys](#comment_24_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): Clearly not censorship lol.  Good with me, this shit happens, and way way worse across the globe, better to know about it than cower like a bitch.\n\nEpstein did this, and he cut them up alive.  Nobody knows about it bc everything is censored.",
				"added": 1566353863
			}
		],
		"1566354194_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 42,
				"body": "They only own the banks that own your government, must be dumb.  You should kill jews tbh, they are terrorists under guise of banking.",
				"added": 1566356891
			}
		]
	},
	"comment_vote": {
		"12_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"25_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": 1,
		"52_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}