{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566424248,
			"title": "ZeroNet Decentralized Development Roadmap",
			"body": "Let's discuss how we can decentralize development and other contributions to the core ZeroNet to build a community owned project that \n\n- gives stakeholders a role in prioritization (e.g., site builders play a major role in the ecosystem, so should have a say in how ZN helps and impacts them)\n- decentralized funding of new features and other types of contributions\n- invites a diverse and broad team of contributors with a rewards based system\n- increases peer review of designs\n- increases peer review and testing of code before merging\n- increases community trust in ZeroNet, that their investments are healthy\n- has a standards process for protocols to support multiple client implementations, such as Bitcoin's [BIP](https://github.com/bitcoin/bips) (github.com).  \n\nIncreasing ownership and democratizing funding and code merging can Increase participation in discussions from ideation to implementation along with increased incentive to peer review proposals and implementations.  This helps to protect the network from vulnerabilities in the core code from both bad actors and innocently intentioned developers.\n\nThis can ultimately grow ZeroNet as it creates a highly incentivized system where all participants of the ecosystem can grow.  Anyone with the capability and interest in developing can contribute.  We can provide rewards for other types of contributors such as testers and documenters.  With site builders being able to represent their own interests in the process, the community can blossom, creating the functionality that will ultimately make ZeroNet a the place for people of all walks of life to use.\n\n### Use Cases\n\n[USE CASE: Improve default ZeroTalk](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_3_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n[USE CASE: Partially funded proposal refunded](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_4_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n[USE CASE: Team proposal Funding](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_7_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n[USE CASE: Infrastructure Funding](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_8_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n[USE CASE: Feature Request Bidding](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_9_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n\n### Related threads\n\n[ZT announcement of this thread](/Talk.ZeroNetwork.bit/?Topic:1566424575_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n)\n\n[What clearnet Git hosting would you use for ZeroNet?](/Talk.ZeroNetwork.bit/?Topic:1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/What+clearnet+Git+hosting+would+you+use+for+ZeroNet)\n\n[Bisq's DOA](https://bisq.network/faq/#about-dao) - one example how others have innovated a new solution to decentralizing development.\n",
			"added": 1566424247
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 1,
				"body": "@gitcenter I'm not in a hurry to produce this road map.  But, since you brought up decentralizing development as the primary reason to shift to GitLab, it is as good of a time as any to begin.  \n\nThe next step after we have a road map is to define technical requirements for each step.  That, I believe, will give us the best set of requirements for comparing GitHub, GitLab, improving Git Center and any other possible SCM solution.  This is why'd I'd prefer to discuss how to decentralize the development process before leaving GitHub.   \n\nOpening up development has the potential to increase the number of developers contributing, and with it the churn rate of features.  As @Kaffie mentioned in your post, that is a good thing for everyone, @nofish included.  \n\nOpening up the process doesn't change your or nofish's roles as leaders, because leadership is defined by expertise, experience and the trust of the community, and you two have a ton of all three.  It just means you can enjoy much needed help to improve ZeroNet to become great.  \n\nMarc Fluery created JBoss Application Server under LGPL while he was in college.  In 2002, he proudly boasted that over 1000 developers contributed to it.  Everyone communicated via a forum he had up.  A lot of people told him he'd never be able to make money with it being free open source under LGPL.  He ignored them.    \n\nYears later, companies began to use it, and he built a very profitable consulting business around it.  RedHat later bought that company from him for over $400 million.  JBoss  lives on today, still free open source, as [WildFly](https://www.wildfly.org/), though RedHat was recently purchased by IBM.  I interviewed a lot of developers for positions over the years; and by 2016, I'd say over 60% of the Java developers had JBoss/WildFly on their resume.  \n\nThe point is, JBoss was a success because he made it a priority to invite as many developers as he could to help him, while he was still in college, long before anyone was using it in production.  Decentralizing development can become one of the most pivotal decisions leading to the success of ZeroNet!",
				"added": 1566434920
			},
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_16_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Btw. Unlimit talk is outdated, for example dows not feature automatic subscribtion of the topic starter.\n\nYeah, I'd like to just clone another ZT for ZN Dev to solve that and work with kaffie, but would like to give @nofish an opportunity to do it first, or chime in, because he's our leader in core ZN Dev.",
				"added": 1566479354
			},
			{
				"comment_id": 3,
				"body": "### USE CASE: Improve default ZeroTalk\n\nJoe wants to create a better default ZeroTalk, the primary discussion site for the community.  In a decentralized development model, the process could look like this:\n\n- Joe creates a proposal and shares with community, with a desired funding requirement.  \n- The community funds his proposal.\n- Joe builds the new improved ZeroTalk, and provides it for testing. \n- The community provides feedback.  \n- Joe improves ZeroTalk based on feedback.\n- Joe submits the site as a pull request (PR) into to become the new default ZeroTalk.  \n- The community reviews the PR and votes to have it become the new default.\n- The new default ZeroTalk is merged into core ZeroNet. \n\nContrast to current state:\n\n- Joe has no standard process for funding. Can, at best, ask for donations.  \n- Joe needs to present his proposal to nofish.  \n- nofish has to approve, or Joe has to hope that nofish will merge it later.  \n- Upon completion, nofish, if not MIA, reviews and decides if it should be merged.\n\nThis is not to say that @nofish and @gitcenter cannot have heavily weighted votes in the future use case.  A merger voting system would need some sort of weighting.  That weight would need to be \"earned\" by each voter, at a minimum to deter gaming via account creation. Current core devs could certainly start out with a high weight as they've already earned it, and would have to accept the proposed weighting before the new system could go live.  \n\nThe good thing is if someone goes MIA, a voting based system will have continuity, one of the concerns @gitcenter wisely raised.  ",
				"added": 1566490723
			},
			{
				"comment_id": 4,
				"body": "### USE CASE: Partially funded proposal refunded\n\nSally wants to create a better default email site for ZeroNet.  \n\n- Sally presents her proposal to the community, with desired funding, and 30 days for the funding request to be met.  \n- The community funds 67% of her request within 30 days.  The funds are locked in a contract.  \n- Sally has 10 days to either accept the lesser funding, or refund by unlocking the funds.  \n- Sally decides 67% is not worth it, so presses the REFUND button.  \n- The original funds are now unlocked, as if no one ever made a donation.",
				"added": 1566491297
			},
			{
				"comment_id": 5,
				"body": "> [znnex](#comment_1_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Probably \"opportunity\"\n\nopp = opportunity\n\nlol sorry.  I trust Brain to type what I think, so I don't even know when I do this.",
				"added": 1566500877
			},
			{
				"comment_id": 6,
				"body": "> @gitcenter:\n> @znnex:\n> @ssdifnskdjfnsdjk: \n> @nofish:\n\n I also would love a clone of ZT Talk to ZN Dev for this because I think this is where groups can help give us good structure to the discussions, and UNLIMIT doesn't seem to have groups.",
				"added": 1566501158
			},
			{
				"comment_id": 7,
				"body": "### USE CASE: Team proposal Funding\n\nCindy has a proposed site she'd like funded that requires help from some other people.  So, she puts together a team and includes them in the proposal so that:\n\n- Joe gets 10% for a new ZeroNet Core command needed.  \n- Bob gets 10% for creating documentation.\n- Katy gets 10% for leading testing and a security audit.  \n- Cindy gets the remaining 70%\n\nThe development process looks like this:\n\n- Cindy submits proposal to community.  The community likes that her proposal includes documentation and a security audit, so funds 100% of it within 30 days.  \n- They complete the work and present the PR for the core part.\n- The community reviews the PR and votes to have it merged. \n- Cindy puts the rest on ZN for community review and requests payment to be released.  \n- While not everyone is happy (someone always wants more features), there are enough happy people so the quorum for releasing the funds is met.  \n- The four contributors each get their share of the funding, per the proposal.",
				"added": 1566502475
			},
			{
				"comment_id": 8,
				"body": "### USE CASE: Infrastructure Funding\n\nBob and Sally agree to build the new proposal tracking and funding solution for the equivalent 1.4 BTC.  When they build it, they include a liability calculation in proposal funding requests, so that each request has a 10% Fee added to each proposal.  \n\nWhen Tom proposes a project for 1 BTC, it will mark it to 1.1 BTC, or 9.1% (1 / 0.1) of an accepted partially funded proposal.  When the proposal funding is released, Bob and Sally will receive their share of the 10%, until the debt of 1.4 BTC is paid off, at which point, there will no longer be a fee added to proposals.",
				"added": 1566503284
			},
			{
				"comment_id": 9,
				"body": "### USE CASE: Feature Request Bidding\n\nTim wants a new feature added to ZeroNet, but is not able to develop it himself.  \n\n- Tim creates a proposal for the new feature.\n- Tim put it up for bidding, with a minimum contributor rating of 5 and a time limit of 30 days.  (Picking a rating too low risks someone bidding it up then never completing it, as only those who have a history of completing proposals have a high rating).  \n- Mary wins the bid with the lowest bid.  \n- Mary adds implementation details to the proposal, describing how she'll implement the feature, and any other information the community needs to review.\n- Mary submits the proposal for community funding, with a 30 day limit.",
				"added": 1566505698
			}
		]
	},
	"comment_vote": {}
}