{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "郭文贵要对污蔑“全民共振”彻底道歉：",
			"body": "越来越多网友们要求郭文贵对污蔑“全民共振”进行彻底的道歉，彻底道歉包括：\n1) 李一平、吴建民与郭文贵所宣称的其他所谓郭氏术语之民运“伪类”没有任何关系。\n2) 郭文贵全家遭受迫害，不敢支持“全民共振”，但为了维护郭文贵本人已经不敢继续当“支那太监”的公众形象，郭文贵需要明确地指出，郭文贵不敢污蔑“全民共振”为钓鱼之类的特务圈套陷阱。之前郭文贵的部分言论满嘴跑火车，信口胡诹什么“全民共振”为钓鱼； 所谓的民运“伪类”如果没进监狱，郭太监就要跳楼之类的说法，纯粹是一派胡言，某些言论言不由衷，是身不由己的特殊处境所造成，但是对于一派胡言的污蔑“全民共振”的不当言辞，郭文贵予以郑重而严肃地道歉，并特别指出：“全民共振”是一项不涉及暴力的理性公民运动，完全符合中国大陆的宪法规定！\n3) 是否参与“全民共振”完全由老百姓自己决定，郭文贵不敢再犯低级错误，去继续污蔑“全民共振”为国安的圈套陷阱之类的太监特务捣乱术！ \n\n+ 网友们另外指出：\n郭文贵全家遭受迫害，却还在满口胡言“千年圣君”之类的太监式吹捧，这种荒谬，对于智商正常的人是不可接受的！郭太监如果不想被他所痛斥的“伪共”“支那蛆”继续迫害，如有继续爆料，对于太监转型为公民的正当诉求努力，网友们自然会继续支持郭文贵爆料，因为大力支持太监转型为公民，本身就有利于进一步稀释支那丛林暴政所依赖的太监糟粕。随着维权意识不断增强， 沉沦千年的太监糟粕必然被历史抛弃！\n\n+ 坚决要求郭文贵彻底道歉！这不是蹭热度，而是维护正义事业！  \nhttps://twitter.com/liyiping1911/status/975048391242629121 \n \n坚决要求郭文贵彻底道歉！这不是蹭热度，而是因为“全民共振”是一项正义的事业，与前国安特务郭文贵的所谓“钓鱼”之说根本没有任何关系。为了更好地维护正义的事业，网友们提议，准备与郭文贵打官司也可以，或者到明镜辩论，也可以。\n\n为了尽量减少非暴力运动的潜在障碍，需要特别指出：民主法治的最大敌人不是“中共”，而是“伪共”；支那丛林专政国实际上连“中共”国也不是，而是一群连官僚财产都不敢公开的“伪共”“匿产帮”披着“共党”的外衣，实际上是靠“菜刀实名制”才能勉强维持他们的“高度自信”的“伪共”特色“东亚懦夫”专政国。或者，用文贵的话语，可以把“伪共”“匿产帮”简称为“支那蛆”。\n\n其他网友谈到独立、共和、联邦之类的问题。其实，独立、共和、联邦都不是问题，最重要的是，把独立、共和、联邦当成真理的人们，最起码需要有基本的勇气，敢于推行持枪权捍卫真理的原则，去捍卫各种独立、共和、联邦的概念。在持枪权捍卫真理的基础上，走出支那丛林，迎接人类文明，是有可能的。\n\n为了更好地维护正义事业，可能需要打官司。鉴于前国安特务拥有巨额财富，试图给“全民共振”添乱，以前从不搞募捐的正义人士可以把公开资金用途作为民主监督运作，打赢这场分清善恶、去除太监糟粕的诉讼战！\n\n+ 这场维护正义事业的论战（诉讼战），目标不是为了毁坏郭文贵的维权形象，而是帮助郭太监去除郭氏太监糟粕，更好地维护郭文贵爆料维权所应当具有的现代公民之基本形象，更好地促进维权意识全面传播，让沉沦千年的太监糟粕更早地丢进历史的垃圾堆！\n\n因此，这一场论战（或者诉讼站）不应该只是少数几个正义人士的事情，而是事关全体华夏人民文明转型的基本问题！\n以上为网友们的探讨剖析，如有遗漏之处，请更多觉醒起来的网友们跟进。网友们除了普通网民之外，可能还包括部分五毛党，因为普通人都清楚：\n红二代陈小鲁可以被消失，支那黑客和高级特工们可以像马航受难者那样莫名其妙地被人间蒸发掉，甚至江家的亲骨肉私生女都会遭到“伪共”“支那蛆”的迫害，良心未泯灭的党员和军人，自然不会为“伪共”“支那蛆”效力！\n\n 全民共振 \nhttps://twitter.com/2018qmgz\nhttps://twitter.com/sifan198964 \nhttps://twitter.com/liyiping1911",
			"added": 1521363403
		},
		{
			"topic_id": 2,
			"title": "砸烂郭文贵太监，才能砸出郭文贵的现代公民意识！",
			"body": "To Punish Miles Kwok and Eradicate the Spy Virus\n\t\t—  拯救郭文贵、清除太监病毒；营救董瑶琼！ \n\t\t—  挺郭必须砸郭，清除文贵太监、拯救文贵公民！\n\n\nA series of self-contradictory facts have shown that the former Beijing Intelligence Agent Guo Wengui (Miles Kwok) whose open identity is a real estate businessman is over-spreading eunuch spy virus that is dangerous to the USA civilization just like the notorious McCarthyism movement in American history. \n\nThough the former BAI(Beijing Intelligence Agent) Guo Wengui's influence is mainly limited in Chinese community, on the land of USA which worships freedom just as worship of God, based on a Rule-of-Law system with truth protected by Gun Rights, Guo Wengui's notorious slander of Chinese lady Dong Yao Qiong (董瑶琼) triggers up more and more people's flames of fury! \n\nDong Yao Qiong bravely splashed ink on a poster of Chinese president Xi Jin Ping who could nothing to keep justice on Rule of Law, but relied on boasting style of posting images everywhere to intimidate the Chinese people that a second Mao Tse Dong dictatorship is recovered in Beijing from the notorious crystal coffin which polluted Beijing for dozens of years! \n\nGuo Wengui's groundless slander that Dong Yao Qiong's behavior was plotted by some atheism officials is clearly ridiculous!  \n\nFor one simple logic, what's most feared by an atheism regime is that its people get awaked up and totally despise the absurdities of the regime! \n\nXi Jin Ping was so scared of the awaked Chinese people that Xi put down many images nationwide.  This overwhelming fact of result is produced by Dong Yao Qiong's brave action. This fact is itself a self-evident truth that Dong Yao Qiong's brave behavior is triggered by a Brave Soul endowed by God, which can't be plotted by any secular being in the secular world, including any crafty spy master in the notorious atheism gang in China who might be more crooked than Guo Wengui or even the notorious McCarthy in the USA history! \n\nSo the seemingly-small incident of Guo Wengui's slander of Dong Yao Qiong is NOT small at all! It triggers up more and more people's rage! It awakes up more and more people in both the East and the West, seeing that the USA civilization is now seriously polluted by the money-worship environment as well, which confuses good and evil, right and wrong. However, such dangerous situation can’t overthrow  the whole USA system, since the forefathers Washington and Jefferson protects Rule of Law based on constitutional Gun Rights System which respect the individual human rights just as effectively as the Holy Worship of God, and the Holy Search of Truth! \n\nSo this petition campaign is not only a call focused on global Chinese community to take action, cherish the forgotten ancient Chinese tradition that respects Truth, just as respect of Heaven and Earth as emphasized by the ancient Zhou Yi Philosophy. This petition campaign calls all people in both the West and the East, please light up your soul, sign the petition, distinguish right from wrong. \n\nFor God’s sake, for a new era of mankind, and for President Trump’s efforts to Make America Great Again, please join the campaign. Thanks! \n\n\nRemarks: \nThere're some additional points to be clarified.  The campaign is aimed to punish Guo Wengui for Mr Guo's inappropriate and McCarthy-style crazy behavior that not only insulted Chinese citizens' movement — National Rebellion (All People Act Together) launched by Li Yi Ping (李一平) and Wu Jian Min （吴建民）, but also harmed the essence of American culture which respects all individuals’human rights, respects God, respects Truth!  \n\n\nPeople needn’t resort to top-rank lawyers or top-rank jury system, for some reasonable judgment can be concluded based on simple common sense. \n\nFrom the two simple facts of truth — Dong Yao Qiong bravely splashed ink, then Xi Jin Ping hurried to take off all images nationwide, people can see that Dong Yao Qiong accidentally helped all Chinese uncover the crater of a volcano, which gives the direction for the huge flames of rage to burst out!  \n\nThe volcanic eruption may totally discard the atheism gang, so there’s no reason for any spy master to plot Dong Yao Qiong’s splash-ink incident! \n\nThis overwhelming fact of result produced by Dong Yao Qiong's brave action is itself a self-evident truth that Dong Yao Qiong's brave behavior is triggered by a Brave Soul endowed by God, which can't be plotted by any secular being in the secular world,\n\n  \nAs to how to punish Guo Wengui for his McCarthy-style crazy behavior, to return Guo Wengui to the atheism jungle of China may damage the international humanitarianism of USA; but to tolerate Mr Guo’s McCarthy-style crazy behavior clearly harms the essence of USA culture. It’s suggested at least a serious warning be given to Guo Wengui, warning him to stop being an obstacle against Chinese people’s pursuit of democracy; or if possible, with some economic punishment on Guo Wengui, who deviated from many of his promises on donations to funds for democracy course in the year of 2017, during which many Chinese people were persucted by Chinese government due to their voluntary spreading of Guo Wengui’s exposure of the unprecedented crimes by the atheism China!  \n\nSome volunteers with the Chinese-English version of this article also witnessed the 2017 event of Guo Wengui’s exposure of China. \n\nIt’s really difficult for normal people to imagine that a Mr Guo can shamelessly praise the emperor as a great Emperor in One Thousand Years when that dictator simply turned a blind eye to the cruel fact that many of his family members in China are suffering from brutal torture; furthermore, Mr Guo even helped the dictator to strengthen dictatorship by poisonous ruining of Chinese democracy course.  \n \nGuo Wengui is an extremely rare case of \"Split Personality\". To eradicate the Eunuch Virus of Guo Wengui, is in fact to save the civilian pursuit by Guo Wengui.\n\n备注: \n董瑶琼惊天一泼，吓得习近平头像全国撤下。这个最简单的事实说明，董瑶琼无意间为大家找到了火山口的爆发点。既然爆发点找到了，火山岩浆就会往火山口汇聚。郭文贵配合“伪共”“匿产帮”抹黑、掩盖事实，就是试图掩盖火山口，保护他们通过专政特权掠夺到的各种利益。\n\n假如特务头目们有能力故意地策划出火山爆发口，在老兵维权时，他们早就策划出兵变和民变了。因此董瑶琼惊天动地的壮举，绝对不会是特务们的策划。\n(另外，已有网友证实：董瑶琼 被“精神病”，但实际上是政治犯！https://twitter.com/Suyutong/status/1021311984686559232  )  \n\n上述这些信息没有否定郭文贵爆料的意图，因为郭文贵是伪共暴政之下极其罕见的怪人 — 是人格严重分裂的典型。正常人都是集合多重人格于一身，具有复杂情感交织的矛盾统一体，因此，轻微的人格分裂是常见的。但是把浓厚的太监特务糟粕和强烈的公民维权意识融合在一起的人，非郭文贵莫属！ \n\n因此，真正支持郭文贵爆料的人们，就必须砸郭。 砸烂郭文贵的太监糟粕，才能拯救郭文贵的现代公民意识。 但是郭文贵的太监糟粕过于深重，需要全民一起砸，长期砸，才能砸出现代公民文化。 鉴于太监病毒曾经随“孔子学院”一起输出，对美国也有一定的影响，因此砸烂郭太监，也符合川普总统“重振美国”(To Make America Great Again)的战略精髓，同时也有利于弘扬中华传统文化儒家经典“己所不欲，勿施于人”的自由理念！\n\n在当前，要营救董瑶琼，凝聚华人社区的正义力量，就应当共同努力，在关注郭文贵爆料的同时，还应该清除郭文贵的太监病毒。\n\n上述细节为网友探讨的结果，如有不完善的地方，将进一步更新。请其他网友们跟进。凝聚大众智慧，必能促进民主大业。 谢谢大家。 ）\n\n附加说明：鉴于美国的法治既提供宽松的言论自由环境，同时又有灵活而严谨的法治原则在规范着社会运作。可以考虑，在舆论和法律两个层面，同时向郭文贵太监特务发起反击。\n\n鉴于郭文贵跟“伪共”黄俄蛆虫一样，没有道德底线，而郭文贵目无法治，在网络平台上公开破坏美国法治、玷污自由女神的邪恶行径是赤裸裸的，所有真正支持民主自由的人士，应当携手起来，联合大众，与郭太监特务公开打官司。\n\n相关细节，见有关页面：\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:4_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/ ",
			"added": 1532444928
		},
		{
			"topic_id": 4,
			"title": "郭文贵犯下了多宗罪！民运联手，郭文贵特务奸商倾家荡产！",
			"body": "郭文贵犯下了多宗罪！民运联手，让郭文贵这个太监特务奸商倾家荡产！\n \n没有道德底线、政治智商为零的郭文贵已经在美国犯下了严重罪行！而且这整个犯罪过程是公开的，而不是像中国大陆的黄俄特务那样通过暗黑渠道破坏美国法治。\n\n在持枪权捍卫真理的美利坚国土，即使像川普那样有钱有势的总统商人，也不敢过于“任性”胡作非为；像郭文贵那样满嘴跑火车，目无法治、逻辑混乱、经常自相矛盾的黄俄太监特务之奸商，更是不可能在美国任意胡来！\n\n在污蔑董瑶琼、华涌为特务之前，郭文贵一直在污蔑“全民共振”，甚至造谣诽谤攻击李一平、吴建民等比较朴实的民运负责人。对于诽谤李一平、吴建民，郭文贵只是做过简单的道歉，但是道歉得很不够严肃，不够彻底。因为郭文贵之前还没有为他的自相矛盾的言行遭受美国法律严惩，因此郭文贵满嘴跑火车、任意污蔑他人为特务的“黄俄奸商”（或者用郭文贵自己说的，郭太监是在支那粪坑里与“伪共”“支那蛆”一起游泳的败类）之本性没有发生质变的飞跃。在这个特殊的历史阶段，越来越多人认识到，广大群众在当前非常迫切地需要通过美国法治对黄俄太监病毒泛滥、任意污蔑正义人士、破坏民主运动的奸商郭文贵予以严惩！ \n\n董瑶琼惊天一泼，吓得习近平头像全国撤下。这个最简单的事实说明，董瑶琼无意间为大家找到了火山口的爆发点。既然爆发点找到了，火山岩浆就会往火山口汇聚。郭文贵配合“伪共”“匿产帮”抹黑、掩盖事实，就是试图掩盖火山口，保护他们通过专政特权掠夺到的各种利益。\n\n假如特务头目们有能力故意地策划出火山爆发口，在老兵维权时，他们早就策划出兵变和民变了。因此董瑶琼惊天动地的壮举，绝对不会是特务们的策划。\n(另外，已有网友证实：董瑶琼 被“精神病”，但实际上是政治犯！https://twitter.com/Suyutong/status/1021311984686559232  )  \n\n对于名誉损失和精神损失方面的赔偿，是可大可小的争议诉讼；但是，当多数人共同维护的事业，其相关的人员和民主自由运动所遭受的名誉损失和具体人员的精神损失，就绝不是小事一桩！\n\n鉴于郭文贵这个太监特务奸商在某些方面已经变质，甚至成为民主事业的障碍，因此，通过大家的共同努力，争取让这个奸商遭受法律的严惩，对他的惩罚，只要相关的罚款能够公开透明地运用于推动“全民共振”的民主自由之伟大事业，惩罚越重越好，最好让这个太监特务倾家荡产！\n\n\n从名誉损失和精神损失方面的法律角度来看，因为郭文贵的造谣诽谤而受到名誉伤害和精神损失伤害的人员，不只是万众瞩目的董建彪、董瑶琼父女、华涌等正义人士，也包括很多被郭文贵欺骗的大陆普通民众！\n\n在郭文贵2017年非常有力地抨击“伪共”“匿产帮”为“支那蛆”之后，令人哭笑不得的是，郭文贵居然又很快向中南海的领袖习某人写信，表示服软，并且乞求“伪共”施舍给他公平谈判的机会，只要有机会谈判，什么交易他都会愿意谈。\n\n在八字还没一撇，全民抗争的风浪都没有掀起的时候，郭文贵居然把自己想象为梁山泊的宋江，想立刻跟天朝谈判、勾兑。这种软弱的心理，被“伪共”蛆王们完全看透，于是欺软怕硬的“伪共”匪徒自然是变本加厉，以加剧酷刑折磨郭文贵家人，试图进一步加剧郭文贵身上的支那太监病毒，让郭文贵在支那太监病毒和维权意识的剧烈冲突之中，不断地让深谙金融投机、没有政治原则、但有特工技能和抗争精神的支那太监异类郭文贵在自相矛盾中不断地出错。郭文贵出错越多，时间拖延越久，他被历史淘汰的可能性也就越大。\n\n郭文贵的最大败笔：一方面企图当太监，另一方面又想当维权公民。郭太监为了朦胧的公民意识而艰苦维权的奋斗值得鼓励，但是郭太监企图以援郭会名义捆绑海外华人，让所有华人都跟他一起当太监的邪恶企图必然失败。因此，挺郭必须砸郭，只有砸烂郭文贵的太监糟粕，才能砸出具有现代公民意识的郭文贵新公民！\n\n从这个角度来说，那些在2017年被郭文贵欺骗，因为大力传播郭文贵维权爆料而遭受“伪共”迫害的大陆公民，其中有不少人遭受肉体层面的残酷折磨，现在他们发现，他们所遭受的不只是肉体层面的折磨，还要遭受郭文贵在精神层面的欺骗愚弄，因为郭文贵公开污蔑追求自由的女神董瑶琼，这种恶劣的行径，不只是以黄俄太监病毒的方式在玷污美国的自由女神，破坏美国的民主自由之文化基石，郭太监也是在公开侮辱2017年为了声援郭文贵爆料而勇敢地传播正义声音的中国广大群众。 （这方面的人数，郭文贵自己说过有几十万之众！）\n\n本来郭文贵自己一个人想当太监，那也无可厚非，但前提必须是，太监郭文贵不得以黄俄特务的身份到处污蔑真正追求“民主自由”的正义人士。\n\n但可笑的是，郭文贵自己一个人想当太监，企图以太监的身份与“伪共”“匿产帮”勾兑， 但似乎又经常遭受挫折；郭文贵的政治觉悟和政治智商接近于零，郭文贵自己一个人当太监， 当不成，正确的做法应该是，彻底抛弃太监思维，坚决彻底地与广大民运人士携手努力，那才是正道。但郭文贵反其道而行之，不但威胁已经解体的挺郭后援会的部分民运精英，而且不断地污蔑“全民共振”，到2018年中，甚至公开污蔑追求民主自由的万众瞩目的董建彪、董瑶琼父女、华涌等正义人士。\n\n郭文贵这只因为没有权贵背景而遭受“伪共”迫害的黄俄蛆虫，政治觉悟和政治智商接近于零，目无法治，在美国试图以麦卡锡的手法颠倒是非、混淆黑白，藐视美国法治，玷污自由女神，如此邪恶的黄俄蛆虫郭文贵，必然要遭到美国法律的惩罚，遭受历史的惩罚，并最终遭到广大人民群众的唾弃！\n\n鉴于郭文贵跟“伪共”黄俄蛆虫一样，没有道德底线，而郭文贵目无法治，在网络平台上公开破坏美国法治、玷污自由女神的邪恶行径是赤裸裸的，所有真正支持民主自由的人士，应当携手起来，联合大众，与郭太监特务公开打官司。\n\n各种事实表明，可以公开地以破坏美国法治、玷污自由女神的罪行控诉郭文贵。对于民运阵线而言，这个诉讼基本上不会输，至于如何赢，只要相关的罚款能够公开透明地支持李一平、吴建民在公开发起的“全民共振”运动，针对郭文贵的惩罚，最好是越重越好，最好是让他倾家荡产，或者至少也要让郭太监特务的过于嚣张的太监气焰有所收敛！\n\n针对郭文贵太监特务的这个诉讼，如果郭文贵敢公开应对，他就必然失败。因为郭文贵的政治智商为零，又没有道德底线，即使郭文贵和大陆的特务仍有联系，也很难让他的老领导们公开地帮郭文贵证明“追求自由”的女神董瑶琼属于某个部门刻意策划出来的泼墨习近平的政治工具，\n\n在正常情况下，郭文贵那些有政治智商的老领导们都不可能为郭文贵背黑锅，更何况，已有\n网友证实：董瑶琼被“精神病”，实际上是政治犯！https://twitter.com/Suyutong/status/1021311984686559232  \n而且，董建彪、华涌等人士更不可能是“精神病”。\n\n针对郭文贵太监特务的这个诉讼，赢的概率是非常大的，因此，民运阵营非常有必要联合起来，在大众舆论和美国法治框架的两个层面，公开向郭太监发难，这不只是为了维护英雄们本该拥有的荣誉，也是为了维护“全民共振”的光荣事业，更是进一步推广“全民共振”，凝聚共识的客观需要！\n\n既然董瑶琼女神无意间为大家揭开了火山口，那么，请大家携手努力，集中所有力量，让所有的熔岩往火山口方向前进，促进火山大爆发吧！\n\n真正支持郭文贵爆料的人们，就必须砸郭。 砸烂郭文贵的太监糟粕，才能拯救郭文贵的现代公民意识。 但是郭文贵的太监糟粕过于深重，需要全民一起砸，长期砸，才能砸出现代公民文化。 鉴于太监病毒曾经随“孔子学院”一起输出，对美国也有一定的影响，因此砸烂郭太监，也符合川普总统“重振美国”(To Make America Great Again)的战略精髓，同时也有利于弘扬中华传统文化儒家经典“己所不欲，勿施于人”的自由理念！\n\n在当前，要营救董瑶琼，凝聚华人社区的正义力量，就应当共同努力，在关注郭文贵爆料的同时，还应该清除郭文贵的太监病毒。\n\n这个具有世纪意义的历史诉讼，不只是在物质层面，有利于激励遍布世界各地的民运阵营，而且在精神层面，也能够促进更加广泛的共识，让更多人们积极踊跃地投入“全民共振”的伟大运动！\n\n（上述细节为网友探讨的结果，如有不完善的地方，将进一步更新。请其他网友们跟进。凝聚大众智慧，必能促进民主大业。 谢谢大家。）\n\n网友探讨，在舆论和法律两个层面，同时向郭文贵太监特务发起反击。\n\n相关细节，见有关页面：\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/",
			"added": 1532445164
		},
		{
			"topic_id": 5,
			"title": "中国的基本问题不是“中共”，而是“伪共匿产帮”。",
			"body": "中国的基本问题\n\n关于中国的基本问题，有人认为是拥有数千万党员的“共产主义”政党造成的。这种看法夸大了矛盾的规模，恰好中了“伪共匿产帮”绑架数千万党员以及十几亿人民的阴谋诡计。\n\n**中国的基本问题不是“中共”，而是“伪共匿产帮”。**\n\n把目标从“中共”改为“伪共匿产帮”，部分年轻人可能觉得有点怪异。\n\n需要做一些说明：\n彻头彻尾的、绝对意义上的“无神论”信徒是不存在的，只要他不敢否认有“精神”存在，那么他就无法否认每个人的“精神”空间里都存在着或多或少的“神圣”的情感 — 这种“神圣”的情感，无论是在工作层面的，还是生活层面的，总是伴随着每个生命。 而只要有“神圣”的精神空间存在，就有“神灵”的属性存在于他的精神空间。 对于这一点，共产主义的鼻祖马克思非常雄辩，但也犯错误，即使他不信上帝，而是信仰撒旦魔鬼，撒旦魔鬼也仍然属于邪恶色彩的“神灵”，与“无神论”是自相矛盾的。\n\n所以，在中国大陆，至少在中南海，那些连官僚财产都不敢公开的所谓“共党”根本就不配习仲勋那样的“共产主义“信徒之类的称呼，更准确的叫法应该是“伪共匿产帮”。\n把目标对准一小撮“伪共匿产帮”，而不是囊括数千万基层党员的“共党”，既有应对时局险恶的现实考量，更是严谨的科学分析方法。这方面，请大家仔细思考，再付诸实行。\n如此区分，可以清晰地把囊括数千万基层党员的“共党”，与一小撮“伪共匿产帮”完全区分开来。\n采纳严谨的科学分析方法，可以让严峻而复杂的问题显得更简单一些，尽量减少大规模的冲突。\n\n随着港版国安法的进一步推动，会有更多“五毛党”涌入香港。那些偏激的“五毛党”们往往以特别的“爱国主义”腔调，非常狂热地宣传“热爱祖国”、“热爱领袖”之类的话题。对于那些“五毛党”们，尽量避免浪费口舌跟他们争论，相反，可以顺着他们的思维，既然他们的“祖国”、“领袖”是那么地伟大、光荣、正确，那就非常应该推行持枪权保护真理的原则，去维护伟大的领袖、伟大的祖国。\n\n类似的道理，台湾一些韩国瑜的粉丝（韩粉）们如果一直强调“统一祖国”的伟大和急迫，那么，为了保护伟大的“统一祖国”事业，大家都应该支持持枪权保护真理的原则，去保护伟大的“统一”真理。",
			"added": 1594353336
		},
		{
			"topic_id": 6,
			"title": "假如香港網路崩潰…",
			"body": "What will happen if Hong Kong’s internet is collapsed?\n假如香港網路崩潰… \n額外說明：新技術的操作細節見中文頁面連結\n\nIf Hong Kong’s cyberspace is totally poisoned by the GFW virus, then it means Hong Kong’s internet would collapse to the atheism jungle level just like the situation in mainland, China. Since the crazy Hong Kong security law is much more brutal than the mainland, Chinese version, this possibility has to be considered by Hong Kong people. \n\nIn such case, the decentralized website of Zeronet https://zeronet.io/ will serve as a good solution for people to transmit revolutionary messages. With Bitcoin cryptography, the safety is higher than Telegram.  As an innovation of web technology, there's not any censorship, even NO SMS verification process is required as incurred on Telegram.  The new Peer-to-Peer data transmission will be a new tide of cyberspace revolution. \n\nUsers can make quasi-administrator’s customization of ZeroNet … \nFull details are available at the below URL:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1596087920_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/+quasi+administrator+s+customization+of+ZeroNet \n零網用戶的准管理員操作 \n(Important note: The URL with the special beginning http://127.0.0.1:43110  should be opened by Zeronet App  https://zeronet.io/ ,  ) \n\nAnother ZeroNet webpage for reference:\nLiberate Hong Kong, Revolution of Our Time — New Approach to Hong Kong Peace Revolution\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1594275549_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/New+Approach+to+Hong+Kong+Peace+Revolution\n\nRemarks:\n1) More details about Zeronet:\n1.1) On ZeroNet, all webpages start with the special URL  \nhttp://127.0.0.1:43110/ \nThe code 43110 represents the port used for secure data transmission by Bitcoin-encrypted technology. \n1.2) All zeronet webpages can be easily accessed, only after Zeronet app is launched on user’s equipment. \nThere’re different versions of Zeronet, for different system environments such as Windows, macOS, Linux, Android, etc. \nFull details of which are available in the below URL\nhttps://github.com/HelloZeroNet/ZeroNet#user-content-how-to-join \n\nPlease choose the version of Zeronet suitable for the system environment of your equipment. \n\nBefore visiting ZeroNet webpage \nhttp://127.0.0.1:43110/ \nZeronet app should be launched in your equipment at first.",
			"added": 1596354686
		},
		{
			"topic_id": 7,
			"title": "Let Facts Speak the Truth",
			"body": "Currently there’re some Christian volunteers doing the promotion of new approach to Hong Kong Revolution. \n[New Approach to Revolution，Liberate Hong Kong 推翻黄俄暴政！ ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/) \nBased on the in-depth analysis of the difference between the West and the East, the major feature of America’s peculiarity, which makes the United States of America different from the rest part of the world, is ** the constitutional system that respects Gun Rights and Human Rights **. \n\nDue to the brutality of the GFW, many ordinary people don’t see the cruel facts in East Asia, \n** about 20 million mobile users disappeared by the end of March **\nhttps://www.epochtimes.com/gb/20/3/23/n11965551.htm  \n( the message is in Chinese, its general idea is that such kind of situation is very abnormal, mainly caused by the Coronavirus ) \n\nDonald Trump is often worried about the high number of infected cases, which reduce people’s rating on his presidential job. \nhttps://www.statista.com/chart/21377/trump-versus-biden/  \nApproval ratings for Trump have been falling since COVID-19 reached the U.S.  ... \n\nBut in East Asia, especially in mainland China, the high number of people who disappeared was even not treated as ** the digits of statistics ** ,   for one simple reason,  once the large masses of ordinary Chinese people see the truth of actual death polls, they may become crazily furious; it’d further result in a radical revolution that may end the dictatorship by the atheism gang earlier than many people can imagine. \n\nIn America, the situation is also severe. However, people who lost their lives are at least treated as normal statistics.  ** If there’s NOT a special constitutional system in America, the situation of America would have been worse …  **",
			"added": 1596891943
		},
		{
			"topic_id": 8,
			"title": "Some special information on Coronavirus",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg \nWuhan corona virus (2019-nCoV, covid-19), **a man made BIOWEAPON, a vicious virus spread out by the atheism gang of \"CCP\" ** \n\n[Why face mask is a must? ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:2)\n[What will happen if America’s internet is also collapsed? ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1596874418_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/What+will+happen+if+America+s+internet+is+also+collapsed)\n[More People Awakened ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w/Any+Americans+here)\n\n[Donald Trump is NOT the worst … ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597038290_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/Propaganda+for+Donald+Trump+and+Zeronet)\n[Coronavirus Challenges Freedom of Breath ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/Coronavirus+Challenges+Freedom+of+Breath)\n\n\n",
			"added": 1596893525
		},
		{
			"topic_id": 9,
			"title": "Very wonderful video against Coronavirus …",
			"body": "Very wonderful video against Coronavirus … \nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1597210204_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p\nPlease check if it can be played smoothly, or downloaded efficiently.",
			"added": 1597212372
		},
		{
			"topic_id": 10,
			"title": "Donald Trump’s brother died of coronavirus!  Besides  Putin's daughter ....",
			"body": "Donald Trump’s younger brother died of coronavirus last week (in the middle of August). .\nhttps://www.brusselstimes.com/news/126947/robert-trump-younger-brother-of-donald-trump-dies/  \nRobert Trump, younger brother of Donald Trump, dies \n\nMeanwhile, Russian President Vladimir Putin used one of his daughters for maneuver of power, by forcing her to inoculation of the \"sputnik 6” vaccine on Covid19 virus. \nhttps://www.dailymail.co.uk/news/article-8615179/Russia-registers-virus-vaccine-Putins-daughter-given-it.html  \nThen some strange things occurred.  Acute fever was incurred.  After a few days of struggle, another dictator’s family member died of Coronavirus. \n\nDue to worry about loss of power, Putin refused to disclose this fact. However, the situation of media freedom in Russia is a little better than East Asia, so the shocking event will be reported by other medias a little later.",
			"added": 1597659835
		},
		{
			"topic_id": 11,
			"title": "A legendary story …",
			"body": "Below is a legendary story of a scientist who has a peculiar experience of being converted to Christendom from an atheist. \n\n###Intelligent Design 1 (our amazing brain)\nI just celebrated my 90th birthday in 2020 and I lost my wife of 62 years two years ago. People ask me why I am still so joyful every day! I told them that is because I know where I am going, and I know that I will see her again.\nSome people may wonder why a scientist with a doctorate degree from MIT who worked so many years at the Aerospace industry and as also a professor in Engineering from the University of California believes in God. Don’t you believe in science?\nYes, I believe in science. The more I learn about science, however, the more I realized how much that I do not know! \nLooking at the wonders of nature, one must ask the question:  all these things **evolve from nothing or by “intelligent design”**?  \nFor example: Our brain is one of the most studied subjects in the world. In recent years, we have developed tools that allow us to measure all the activities of the brain and know which part is responsible for what function, yet, we still don’t know how it works. For example: The brain weights less than 4 pounds and yet it uses 20% of our blood. **It contains 100 billion neurons, one thousand trillion synapses, more than all the stars in our galaxy!**  How do they fit into a 4 pound brain and all worked together?  Tell me if you can.\nHere are a few simple examples:\n##1.\tOur amazing brain (mental integration)\nTry this experiment with me: Turn on your TV set and watch a program. Now, block your right eye with a book held a few inches from the right eye that completely blocks out the TV images. \nNow open both eyes, you can see right through the book! Amazing!! Now, with both eye open, you can also read the book! How? The brain can integrate and understand the information from both eyes and put the pictures together mentally. Incredible! \nNow, try another experiment, put your opened hand in front of your nose and separate your two eyes. You see different pictures with each eye. Yet if you open both eyes, you see the whole picture as if the hand were not there. Amazing! This is called “mental integration.” Your brain or mind can put the two different \n\npictures together as one! And you can judge distance (parallax) as well.\nThere is a movie called: “The Winning Team” starring Ronald Reagan, before he became our president. It is a story about the famous baseball pitcher Grover Cleveland Alexander, he was doing very well until he got hit on the head with a baseball and experienced “double vision”. He lost his “mental integration”. He saw two pictures with his eyes and could no longer pitch. Fortunately, he regained his “mental integration” after some rests and was able to finish his wonderful career! If you have not seen this picture, get the DVD or watch it on You-tube. (Co-star with Doris Day!) Well worth watching! \t\n## 2. Hunters and prey\nHave you ever noticed that animals that are hunters have their eyes in front (e.g.: humans, Lions, tigers, dogs, eagles and owls), while the prey animals (cows horses, deer, birds have their eyes on the side of their heads.)\nSide eye placement allows for greater peripheral or side vision. This enables the animal to see predators approaching from the side as well as from behind. That is why it is extremely hard to sneak up on a bird. \nIt is interesting to note that the birds can see everything (almost 360 degrees) via mental integration, but how do they judge distances? I saw a sparrow flying very fast toward a fence; I thought for sure it would hit it. Yet, when it got close, it flapped its wings backwards and stop and landed on the fence. How does a bird judge distance?  Do you know? \nAnswer: It does this task by moving its head constantly from side to side or up and down to get depth perception. Amazing!\nIt is even more amazing to know that all that beautiful flying and coordinated maneuvers are done and controlled by electrical impulses from a little brain no bigger than a bean. \nPlease take a little time and read why I chose “Intelligent Design “.\n### My MIT Years\nThroughout my first five years at MIT, (’51 to ‘56), I was a confirmed atheist. Many Christians have tried to witness to me, but none succeeded. I was very牙刷 (toothbrush – in Cantonese, it means one is a know-it-all, very proud of himself). I was also taught while I was in China, that a man should be 顶天立地 (standing on earth with head hitting the sky).\nI encountered many religious zealots before I became a believer. They had a lot of zeal but not much knowledge. They tried to tell me about the “Star of Bethlehem” in the Christmas story. They insisted an actual star shone on the city itself. I told them “That’s nonsense!”\nFirst of all, where did this star come from? What galaxy? What magnitude? Indeed, if a star came that close to earth, the gravitational pull and the heat would cause the earth to explode. Furthermore, the light from the star could not be focused into a beam (that was pre-laser days) and shine only on Bethlehem alone like a spotlight. This kind of scientific ignorance had a negative effect on me and stopped me from looking at Christianity for many years.\nIn graduate school, I discovered a shocking truth: the more I learned, the more I knew that I did not know!  Even today, each new discovery leads me to a deeper mystery. \nThough science has made tremendous strides, we are usually stuck when we ask a few basic questions such as:\nQ: Why is the grass green?                                                                                                           A: Because it contains chlorophyll.                                                                                             Q: Why chlorophyll?                                                                                                                   A: It is needed to convert carbon dioxide into oxygen. It is part of our ecosystem. Q: Why?                                                                                                                    A: It just is.\nMany people believed that we came from a “big bang”! \nThe world was filled with hydrogen, the first element. The gravity compressed the hydrogen and a “Big Bang” occurred. That’s how all the other elements and the universe was formed!\nWait a minute, where did the hydrogen and gravity came from? Tell me if you know.\nBefore my graduation, someone posed me two challenges: \n1.\tStudy the hummingbird, Bob. You know aerodynamics, mechanics, control, and navigation, but can you build a hummingbird? Do you believe that nothing built it? \n2.\tWhat is the most powerful thing on Earth?An idea! Look around. Nothing built by people is ever started without first having an idea. Can you weigh it, measure it, see it, or define it? However, ideas exist. Now, look at all the wonderful things, living or not, around the world. Someone made them, whether you can see it or not!\n\nAfter earning my master’s degree, I was offered an excellent job in the research division at Honeywell in the aeronautical division in Minneapolis, Minnesota. \nI did well in my work. Yet, my life felt empty. Some unknown things were missing. I was challenged by these questions: What is truth? What makes something right or wrong? What is the meaning and purpose of my life? Is tomorrow just more food and drink and work? I felt like a person all dressed up with no place to go. I hunted for the answer to four important questions:\n1.\tIs anybody up there?\n2.\tDoes anyone care?\n3.\tWhy am I here?\n4.\tWhere am I going?\n\nWhenI foundGodin 1956,I wasa bachelor. An older engineer tried to witness to me. I again out argued him. He threw a book at me and said: “If you are so smart, tell me how this is done! “\nIt wasa bookthatpresentedpicturesof a baby’sdevelopmentfromweektoweekpriortobirth. Unfortunately, that old book can no longer be found, however, we can get some up to date pictures from Google. \n\n### In the 9th week, the baby is fully formed, it weighs just one ounce!\nFrom the study of biology, I knew about sperm and egg cells. Once they unite, the fertilized egg cell starts dividing the way all cells do. However, how did some of those cells become the liver, kidneys, brain, skin, and bones? \nFurthermore, how does the baby know the correct areas to place these organs in the body and connected them, so they work together properly? Do you know that the baby’s heart starts beating at the fifth week after conception, and there’s no blood yet to pump? We did not know much about genes and DNA in 1956. Today we know much more about them, and yet the mystery deepens. (See “The Language of God” by Dr. Francis S. Collins. Director of NIH (National Institute of Health) - He turned from an atheist to a believer by studying the human genes and DNA).\nAs a scientist and aircraft mechanic, I knew how to build an airplane. One must carefully design it, build the parts, and fit them together carefully. One must connect all the wirings and test them to make sure that they work together. \nHow does a baby know to do that? Some well-meaning Christian friend told me the Bible says: “We’re wonderfully made.” And then he quoted me the scripture: “For you (God) created my inmost being, you knit me together in my mother’s womb” Psalm 139:13.\nHa! There had to be a good scientific explanation. I started my investigation. \nAfter much study, I finally have to say: “Lord, I surrender!\t\n\t\nI got off my high horse and opened my mind to studying the Bible. By chance, (now I call it Divine Providence), I was invited to a Chinese Christian Fellowship meeting by my friend Fred Shaw (Hsiao). CCF was started by an old widow, Mrs. Torjeson. Her husband, a missionary to China, was killed by the Japanese during World War II. Mrs. Torjeson single-handedly and successfully raised four small children while starting this organization. Though she was a slightly built, poor widow, she was a tower of strength. Largely through her efforts and love, and that of others in her organization, I was challenged with questions and found my answers in the Bible.\n** Someone once said that the Bible is an acronym for: **\n### Basic Information Before Leaving Earth. Interesting!\nOnce I opened my mind and heart, I made my peace with God and started my spiritual journey and adventure. Countless Chinese students from the university also discovered Christianity at the same place. Truly, what Mrs. Torjeson did will echo loudly in eternity!\n\nOne question lingered: If there was a God, why did he let bad things happen? Why are there cancers, diseases, and crimes that kill good people?\nThe Bible gave us the truth. God gave us a free will, and we make our own choices and suffer the consequences. We also suffer the consequences of other people’s poor decisions to commit crimes, pollute the environment, oppress others, or abuse power. For example, the best Christian will still be killed if he chooses to fire a pistol to his head. Similarly, the likelihood of diseases is increased if he keeps eating unhealthy food and drinking unhealthy liquids. (like soda)\nOnce I opened my mind and heart, I made my peace with God and started my spiritual journey and adventure. Countless Chinese students from the university.\nGod never promised that the sky will always be blue, and life will be smooth sailing after one becomes a Christian. He does promise to be with us throughout life’s storms if we remain faithful. Furthermore, everything physical in nature dies and has the formula for renewal built in. However, the human soul and spirit, like an idea, have no shape and form, cannot be destroyed, and will continue into eternity with Him by His Grace!\nI also learned that we live in two worlds: the visible (physical), three-dimensional world and the invisible (spiritual), multidimensional world. The physical world is composed of what we experience with our five senses. The invisible world is composed of our knowledge, wisdom, character, integrity, faith, hope, love, fear, worry, greed, frustration, anxiety, peace, spirit, and soul. If God is in it, it goes to infinity!\nWe design our successes in the (invisible) spiritual world,\nWe build them in the physical world.\nI was reminded by a verse in the following poem, A Psalm of Life by Longfellow.\nLife is real! Life is earnest!\nAnd the grave is not its goal.\n“Dust thou art, to dust returnest,”\nwas not spoken of the soul.\n\nWhen I studied the Bible, I was in awe of the life of Jesus. Despite being born in an obscure town and with no formal education, his teachings, in only three years, changed the world. \nThe life of Jesus is a miracle. No one in history has ever achieved so much with so little. When one studies the Bible, one is impressed with his life. One is faced with a choice. Either Jesus is the Son of God as he claimed, or he is a madman. His claim leaves no room for in between.\nGod may choose to save our bodies if he wishes, as evidenced by the stories in the Bible. He performed numerous miraculous healings. However, his main mission was and is to save souls.\nThe Bible says, “All of us have sinned and come short of the glory of God.” \nJesus said, “That which proceeds out of the heart (soul) of man defiles the man.” In other words, God examines the heart (soul) and sees if it is pure. If it is not, He alone can cleanse it.\nGod’s plan of salvation gives our souls a bath by cleaning it with the blood of Christ through faith. \nAt first, I had problems accepting it because I thought it was too simple.  I asked: “Why?”\nHowever, after much contemplations, my answer is: “Why not?” \nI realized that if God, with His infinite intelligence, wants to communicate with people, He must address us in the simplest terms, so all people can understand and benefit from it. It is like giving a portable radio to a small child for the first time. All he has to do is turn the knob to hear the sound. Understanding electricity and electromagnetic theory is not required. \nLikewise, by the simple exercise of faith in Christ, our spirits can be connected to His, and His spirit will live within us! It is incredible, but true.\n Some skeptics say, “Prove it.” \nMy answer is, “Come and see, and experience it yourself.” When I first came to America in 1950, it was just a spot in the world map, but when my plane landed in California, it became a reality! Similarly, I did not know where MIT was, and I couldn’t even spell Massachusetts. I was told that it is the best school for Aeronautical Engineering. If I had demanded to know everything about it before I agreed to go there, I would have missed a golden opportunity. \nNow, God has already given us a free ticket to the Kingdom of God while we are on this earth. All we do is accept the gift by faith. God gives us a free choice. You can take it or reject it.\nDon’t Gamble on your eternity!\n\n( Does faith really work? See “Intelligent design 2” “on my Christian walk” .)\n## Intelligent Design 2\nIf my first article did not bored you, here are some more examples of Intelligent Design : \n###1. “The miracle of an egg”\nI just had a hardboiled egg for breakfast. It reminds me of this story that happened to me long ago. While I was a little boy growing up in China. We lived on a farm. One morning, I had a hard-boiled egg for breakfast. I marveled how this egg became a chicken when the hen sat on it. When no one was looking, I stole an egg from under the hen and cracked it. It was too early, and the chick has not formed yet. An elder want to spank me for taking a life!! My mother knew that I have a curious mind and let me go. I just could not understand at the time how a hen sitting on the egg and gave it life!\nIt was not until I was in high school and took a course in biology that I found out that the rooster was involved. I asked my teacher: “Which part of the egg becomes the chicken and which part becomes the feathers? He just shook his head and walked away. (He didn’t know.)\nThere is an American saying that “curiosity kills the cat”! Good thing that it is not true. Otherwise, I won’t be here writing to you now.\n By the way, I just got educated again by going online into “google” and investigated “how do chicken develop from an egg”? It is utterly amazing! There are many videos showing the day to day development of the chick inside the egg. The process is unbelievable. \nDo you know that the chicken has almost every part that we have and then some! For example, it has a gizzard that we do not have, which enables it to digest seeds. Furthermore, I just learned from Google that neither the egg yolk nor the egg white becomes the chick, they were just built-in nutrition to feed the chick embryo inside. Amazing!!\nAnother miracle: Just before the egg is laid, a thin calcium shell is perfectly formed to protect the egg. It uses 2 grams of calcium and take the hen 20 hours to make it. It also has a build-in air pocket for the embryo. Crack a hardboiled egg and note that the bottom is flat. (Columbus knew this and it was this knowledge that enable him to win a bet by making a hardboiled egg standing on its end.) \nThe shell is just thick enough to protect the egg and yet thin enough to let the chick inside to break the shell and get air and get out!! How does the hen know how to do that? It is unbelievable that the simple egg is a perfect incubator. All the hens need is to provide some warm. See many videos on Google.\n###2. The miracle of an ant:\nAnatomy of an ant\nPhoto:\n http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:2_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/The+miracle+of+an+ant  \nWhile I was an atheist, I wondered why evolution chose such and impossible way for ants to reproduce. Why do they evolved to have to mate in flight???\nLook at the amazing ant’s anatomy! It has almost all the parts we have and then some (antenna). I often wondered why insects have compound eyes? Answer: to an insect, everything of larger or equal size is an enemy. It does not matter if it is a human being, a dog or anything else. Compound eyes can sense light almost 360 degrees. If many cells are activated, it is an enemy to be avoided. Note that the compound eyes cannot focus but acts more like an early warning radar than an eye. \nAnother amazing fact is that ants has no reproductive organs. Only the queen ants and special males (drones) have them. If every ant can reproduce, the earth will be filled with ants!!\nThe amazing fact is that the queen ant has wings, the male ants are called drones also have wings. They mated in flight!!! \nAfter the mating, the males die, and the queen ant loses its wing and start to lay up to 30,000 eggs and build a new colony. (If I am the queen ant, I will never want to lose my wings! What a blessing to be able to fly!)\nAnts have elbow-shaped antennae attached to the front of their heads. The shape allows the ants to move the antennae both in front of and from side to side. Ants use their antennae to smell, feel, and touch. They can also use the antennae to communicate with other ants.\nI used to wonder what the purpose of an ant is, until I saw them carrying the parts of dead insects into their nest! Ha! **They are nature’s clean-up crew. **\nDo you know that ants have a special clean-up crew of their own to remove their own wastes? Yes! Furthermore, this clean-up crew are allowed to eat from the common food storage, but they are not allowed to carry food into the nest. (sanitary reasons? How do ants know that?)\n \nAfter studying the ants, one cannot help but to wonder what evolves into ants! **This have to be an intelligent design! God made them!! **\n\n\nMy testimonies: (continue)\nDoes faith really work? Can it really move mountains? In what follows, I am going to share with you my own experiences. Please do not think that I am bragging, I am just being thankful for His leading and blessings.\n“Call on me in times of trouble, I will rescue you, and you will honor me.” Psalm 50:15 (GW)\n\n**My Christian Walk**\nAfter I became a Christian, in 1957 I married my wife, who is also a fine Christian woman. We started tithing. We thought life would be smooth sailing from then on. Unfortunately, our big test came just three months later. \n“Black Thanksgiving” came just before Christmas that same year. The large contract the company had won—the B-70 super bomber project—was abruptly cancelled. A massive layoff ensued. Every engineer who had worked with the company less than eighteen months was let go. \nWith only fourteen months of work in the company, I got a pink slip. I thought I did very well in my research, received a patent, and had excellent results. I could not understand how this could happen. It was so unfair! My hope of a promising career was dashed to bits. \nWe remembered the verse Philippians 4:6 in the Bible: \n**Be anxious for nothing, \nbut in everything by prayer and supplication,\n with thanksgiving, let your request be made known to God. **\n\n We decided to “let go and let God” and committed our problem to God through prayer. \n\nThen, a series of miracles happened that again gave me a “new tomorrow.”\n\nA couple of days after my layoff, the chief engineer in engineering asked if I would like to work for him in the “Advanced Development Department”. He told me that he wanted me in their department since my first interview with the company, but the research department had the first choice. I jumped at the chance. I was assigned to design the control system for the **MISS project, which stands for:  Man In Space Soonest (a terrible acronym)**. It was the forerunner of the Mercury Space Project. This eventually led to the company being awarded the Gemini and Apollo projects. I’m not claiming credit for all these developments. It took a team of engineers to accomplish that. However, having a chance to be a pioneer in this area was an honor and a real blessing.\n\n \n\nAfter the MISS project, I was put in charge of the flight-test program of the Adaptive Control System, which I had invented in the research department.  The company was awarded a US patent for it. This system was successfully flight-tested on a F94C fighter and eventually helped to win a multimillion-dollar contract for the X-15 experimental space plane.\n\n \n\nEven though I was a naturalized US citizen, I could not get security clearance because I had lived in China as a teenager, and my background couldn’t be checked as many papers were lost during wartime. As a result, I couldn’t work on important projects for the US Air Force. Fortunately, both Senator Humphrey and a Minnesota Congressional Representative recognized my contribution to the company and introduced special bills on my behalf. I was granted security clearance by an Act of Congress. Wow! What a country! This act would open up another “new tomorrow” for me, to work for the Aerospace Corporation many years later on top-secret aerospace projects.\nIn 1961, I wanted to return to MIT for my doctorate. I was offered a half-time job by the Raytheon Company near MIT, a strong competitor of Honeywell. The pay was much better than that of the research assistant from the school; furthermore, they would also pay for my tuition, books, and moving expenses. Wow! \nWhen I try to tender my resignation to Honeywell in order to accept Raytheon’s offer, my boss said, “Over my dead body!”  He said to wait for him to work something out. \nA week later, I was granted an education leave from Honeywell at full salary. All I had to do was (1) return during vacations and summer to consult on the ongoing projects and (2) work part-time for the Boston division on the Optimal Control Project. They also paid for my tuition and moving expenses. Wow!\n\nWe couldn’t believe this unexpected miracle would last. As soon as we found a place to stay, my wife found a job at the registrar’s office at the Harvard University. We lived on her salary and put my entire paycheck into savings, a truly unbelievable blessing!\nOn November 29, 1963, I was given the most precious Christmas gift. My one and only daughter, Doreen, was born. The timing couldn’t have been better. Working on a doctoral program at MIT was extremely demanding. She arrived when my thesis was finished, and we could devote our time to caring for her and enjoying her.\nIn early 1964, my doctoral thesis, “Optimal Estimation, Identification, and Control,” was accepted and surprisingly was selected to be published by the MIT Press as the twenty-eighth research monograph (MIT selects one or two outstanding doctoral dissertations to be published as a research monograph each year.) This was an unexpected honor.\nAs one drinks water, always think of the source.\n—Chinese Proverb\n\nIn that spirit, I want to thank Dr. Y. T. Li, my thesis advisor at MIT, for his direction and guidance. A special thank you and acknowledgement is made to Dr. Yu-Chi Ho, Gordon McKay Professor of engineering at Harvard University, a good friend and a wonderful teacher, for his patience in helping me through the threshold of modern control theory. \n\nIn the beginning of that book, I also wrote:\nPrayer of Thanksgiving\nBefore God, all men are equally foolish,\nfor we cannot comprehend all the infinite mysteries surrounding us.\nIf there is a grain of wisdom in this work,\nmay it be to His glory,\nFor He alone has provided me with this splendid opportunity for learning:\nWonderful parents, teachers, and friends, a harmonious home, excellent health,\nand strength ever sufficient from day to day.\n—Dr. Robert Lee\nMany people asked if this prayer was appropriate for a scientific book. \n “Why not?” I said. I was truly thankful for all the miracles in my life, and I’m very grateful for them.\nDr. Albert Einstein said, \n###“There are only two ways to live your life. \n**One is as though nothing is a miracle. The other is as though everything is a miracle.” **\nI choose the latter.\nA year after my graduation, I was offered a dream job at the Aerospace Corporation, the think-tank for the air force. I worked on large rockets such as the Titan II and Titan III space boosters, the Gemini space program, and top-secret satellite projects.\n \nIn 1968, I was offered a tenured professorship at the University of California in Irvine (UCI). We moved to Orange County and another “new tomorrow” dawned.\nMiracles continued in my life. A notable honor was being selected to serve as an elder in the church that became the Crystal Cathedral. I was privileged to participate in the building decisions of the Crystal Cathedral. I learned first-hand the strength of the founder, Dr. Robert H. Schuller, a great leader and man of faith who overcame many impossible odds. \nThat’s why, when given the opportunity to help translate Dr. Schuller’s book, Move Ahead with Possibility Thinking, into the new Mao script (modern simplified Chinese), I jumped at the chance. The book was published in Hong Kong and has sold several million copies in Hong Kong and China. As this was a nonprofit venture, the profits from the book sales were reinvested in translating other Christian books into Chinese. \nPlease do not think I am bragging. I am truly amazed and thankful that God allowed the six-year-old whose life the missionaries saved long ago to begin to bear fruit for His kingdom and to give something back.\n\tAs my pastor, Dr. Schuller often said, “Any fool can count the seeds in an apple; only God can count the apples from one seed.” \nLooking back, I can see now that my whole career really began with that “lay-off” in 1957. So, when you face life’s storms, keep your faith. Above the storm, the sun is always shinning.\nSurprisingly, after I became a Christian, I encountered the question of the “Star of Bethlehem” again. I explained it this way. Suppose God said to the three kings, “I’ll send a helicopter ahead. You follow its searchlight.” No problem. Do you think God, Maker of the universe, could make a searchlight without a helicopter? Imagine our ancestors who saw and recorded this event more than two thousand years ago. They saw a guiding light. It was not the sun. It was not the moon, and therefore, it must have been a star. There’s no error in the Bible, just our interpretation of it.\nDid God really do that? I don’t know, but it is very plausible. \nOne need not use a butcher's axe for an ox, to kill a chicken. \n—A Chinese Proverb\n\nI do not believe that God, with His infinite intelligence, needed to go through all the trouble of moving a physical star from some distant galaxy just to produce a little beam of light. \nThe point I make is that the Bible deals with the human spirit and the soul, the invisible world. Science is simply an organized way for us to use our God-given abilities to study the physical world and understand the mysteries of God.\n### Many famous men of science and respected philosophers also believe in God. \nAmong them are: Isaac Newton, Nicholas Copernicus, Johannes Kepler, Galileo Galilei, Michael Faraday, Louis Pasteur, Albert Einstein.\nAmong Albert Einstein’s quotes are:\n**“I want to know His thoughts; the rest are details”.**\n“Science without religion is lame, religion without science is blind.”\nThere are also more than fifty Nobel Prize winners in science who believe in God.  Google them. There is also a website, www.asa3.org, where you can find more information.\nRecently, another famous scientist, Dr. Francis Collins (MD and PhD) turned from atheism to Christianity. He is the current director of the National Institutes of Health (NIH). He recentlywrote a book, “The Language of God,” that document his study of the complexity and wonders of the human genome and his subsequent conversion from atheism to Christianity. \nFinally, I want to mention one of my heroes, a fellow rocket engineer and scientist and founder of astronautics, Dr. Werner Von Braun, (1912 to 1977). He was responsible for the design and realization of the V-2 rocket for Germany during World War II.  After the war, he helped the US launch its first satellite using its Jupiter C rocket. He was also the chief architect of the Saturn V launch vehicle, which propelled the Apollo spacecraft to the moon. He was also a firm believer in God.\nI believe that one of the reasons that all these outstanding people found faith in God is not only for the forgiveness of sin but for their inner peace with God. It frees us from anxiety, guilt, depression as well as a negative self-image! The stress flows out as salvation flows in. These scientists found their purpose, mission and passion for life. They knew that as our physical body ebbs away, our spiritual body continues to grow. We must learn about our Creator – the Light of the world.\n“I am the light of the world, whoever follows me will never walk in darkness but will have the light of Life!” John 8:12\n\t\nAt this point, if you would like to join this group of friends, just accept God’s invitation:\nBehold, I stand at the door and knock. \nIf anyone hears my voice and opens the door, \nI will come into him and dine with him and he with me.\n—Revelations 3:20\n\nAll you have to do is open your heart and invite him in as your personal Savior and friend. Join a Bible-believing church, study the Bible, and grow in your faith.\nOn the other hand, if you’re still skeptical, but not stubborn, take this advice from the Time Magazine’s Man of the Century - Albert Einstein:\nCondemnation (rejection) without investigation is the height of ignorance.\nPlease make your own investigation.I suggest you begin with the four gospels in the New Testament of the Bible. \nThen read the following books:\n\n1.\tThe Purpose-Driven Lifeby Rick Warren, a number one best-seller that examines the question, “What on earth am I here for?” \n2.\tThe Case for Christ  by Lee Strobel. Lee is a lawyer and journalist. He also was an atheist and a spiritual skeptic. His many books document his search for God and examines the evidence from an investigative lawyer’s viewpoint. \n3.\tMere Christianityand many other books by C. S. Lewis, a brilliant Oxford University professor, who made a similar journey. His book, Mere Christianity, remains one of the clearest elucidations of the basic truths of Christianity and has helped many people to find faith.\n4.\tThe Language of God by Dr. Francis S. Collins, (MD and PhD), Director of the National Human Genome Research Institute (NHGRI) and famous scientist who turned from an atheist to a Christian after studying the wonders of the human gene.\n5.\tMany books by Dr. Robert H. Schuller. \n\nWhat profit is there if you gain the whole world and lose eternal life?\nWhat can be compared with the values of eternal life?\n—Matthew 16:26, the Living Bible\n We’re spiritual beings on an earthly journey. God is reaching His hand to you now. Take it, and you’ll never walk alone into eternity.\nToday, if you hear my voice, do not harden your hearts.\n—Hebrews 4:7\n###Don’t gamble on your eternity!",
			"added": 1598504840
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD": [
			{
				"comment_id": 1,
				"body": "[New Approach to Revolution，Liberate Hong Kong 推翻黄俄暴政！ ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/)",
				"added": 1596909440
			}
		],
		"9_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 2,
				"body": "A serious issue to consider:\nLies are more dreadful than raging plague.\n**Who celebrates when the death polls continue to rise? ** \n… \n(To continue)",
				"added": 1597215246
			}
		],
		"8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 3,
				"body": "Now there’s a topic with increading urgency as time goes by — **the issue of the Coronavirus, which affects freedom of breath for everybody living on the planet … ** \n[The Biggest Enemy of the Free World … ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597588397_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/The+Biggest+Enemy+of+Donald+Trump)",
				"added": 1597816710
			},
			{
				"comment_id": 4,
				"body": "Discussion about new features on Zeronet deserve attention. \nThe new idea — [User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine),  \nwhen  implemented on Zeronet, the new function will surpass Youtube’s function …\n\nSuch feature is definitely NOT censorship against speech freedom. In fact it’d further promotes **Zeronet’s long term prosperity**, jut like other netizen’s proposal of \n[New Functions on ZeroNet …  — Pin comments to the top ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/New+Functions+on+ZeroNet) \nSince there’s no absolute freedom. Freedom is based on **the majority of people who deeply understands the importance of mutual respect, to keep the bottom line of justice and equality**.  Since justice may be often betrayed by some politicians, so America’s constitutional system puts special emphasis on **Respect of Gun Rights and Human Rights **.  Thanks to this special system, the McCarthyism and the Red Scare atmosphere did not go totally out of control, and America avoided a manmade disaster as the calamity produced by Stalin on **The Gulag Archipelago (1918-1956）**, the consequences of which were more serious than the Coronavirus hits today’s Russia. \n\n",
				"added": 1597904265
			}
		],
		"5_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 5,
				"body": "If porn content is flooded on Zeronet, then all the advanced technology will be wasted. \nThat is a good question.  \nSo another suggestion is that all those advertisements related to porn content be automatically pushed into another category, which can be named as \"Special Category”, under an independent folder, with an independent label just as the language marks on the toplinks of the webpage.  \nIn this way, porn content will not be banned, but it’d be regulated. \nHow about the idea?",
				"added": 1597945004
			}
		]
	},
	"comment_vote": {}
}