{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566004943_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 1,
				"body": "You are on the internet white people created.",
				"added": 1565934471
			}
		],
		"1565933359_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 2,
				"body": "EdgeLord of DickinAss, feel free to stop spamming your psychotic episodes.  Nobody gives a Fuck.",
				"added": 1565935515
			}
		],
		"1565985176_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 3,
				"body": "It's 1 Billion to 8 Million.  And none of them can defend themselves.  They are going to become another Communist mass grave statistic.",
				"added": 1565988451
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 4,
				"body": "It's more like the hot chick is chained to a wall and gets fucked by the CP elites, they throw you into a concentration camp, harvest your organs, and buy a Lamborghini with the proceeds.",
				"added": 1565988609
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 5,
				"body": "Strange times when CNN can post that shit, and porn sites can't.  Makes you wonder who the real whores are.",
				"added": 1566360224
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 6,
				"body": "Fun Fact:  No civilization was created with atheism, but civilizations did end because of it.  \n\nBy the way, your Richard Dawkins pal was on the Mossad child rape express to pedo island, along with all the other luciferian degenerates.  I'm sorry to tell you this, but there is no happy ending for the willfully ignorant.   You should really try harder.  Starting off with some common sense and current science would be a stepping stone to not being a completely unaware and  useless POS.",
				"added": 1566615336
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "I'd rather not repeat the mistakes of the past.  Especially if a ginger pedophile ends up being in charge.",
				"added": 1566705806
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 8,
				"body": "Look in the mirror, dipshit.  You think you belong here?  You'd die in 3 days without civilization keeping you alive.",
				"added": 1567422065
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 9,
				"body": "My problem with that drama is that there was only one reporter that took all the pictures and reported on his death.  Nobody else, from any publication, anywhere.  They all repeated what he posted.  I think he's dead, due to the inmate reports of his screaming for his life.  But there is no evidence.  The forensic path doing the autopsy is a FBI bitch that does shit work in the real world.  Dead or not isn't important.  What is important are that these pedo-vampires are controlling our governments, politicians, and businesses and they need to be treated just like Epstein was.  Two snapped vertebrae and a crushed hyoid.",
				"added": 1567906504
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 10,
				"body": "Killers go to places where they can kill people.  They call them Gun Free Zones.  You ever see a drug dealer selling crack in a police station?",
				"added": 1568179516
			}
		],
		"1568561319_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 11,
				"body": "Did that really make any sense in your head, or are you genuinely retarded?",
				"added": 1568615766
			}
		],
		"1568598141_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 12,
				"body": "I talk to them.  Read their book.  Ask them why they believe a literal snake oil salesmen.  And then they decide to leave.  Very friendly people.  No reason to be mean to them.  They are just book stupid.  No cross-referencing reality with their golden plates in a cave book.",
				"added": 1568616021
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 13,
				"body": "I don't like this Jewish conspiracy shit, but every sick fucker popping up lately seems to either be that or tied to directly to Mossad in some way.  I'm trying to separate out the religious Jews from the genetic golden calf humping sacks of shit, but it's getting harder to do so, when their goals end up being the same.",
				"added": 1568616218
			}
		],
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 14,
				"body": "That's called prison.  You don't seem to know how prepared food works.  Here's a life hack.  Take a whole food vitamin that mitigates the shit you eat all day.  Otherwise, you need to cook like a real human being.",
				"added": 1568616572
			}
		],
		"1568498469_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 15,
				"body": "What he's saying is foul.  But it's not any worse than what the media is cheering for now, which is cutting off their genitals while \"transitioning\" or doing post-birth abortions(VA Governor).  He's a piece of shit, but they are literally killing kids.",
				"added": 1568617085
			},
			{
				"comment_id": 17,
				"body": "> [dogo](#comment_8_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d): Kids die everyday, who cares. Fuck them, fuck everybody.\n\nBe sure to insert that black pill firmly up your ass before the tampon goes in.  Wouldn't want your manic depression and coagulated incel fistula juice to leak out.",
				"added": 1568619851
			}
		],
		"1568342293_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 16,
				"body": "You are charging so I can seed your movies?  What?",
				"added": 1568617478
			}
		]
	},
	"comment_vote": {
		"2_1Puhq4ufNiorzxfDa3CCJ2UxewNWjVRBi2": 1
	}
}