{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "Kiribati Podcast #13 - Current",
			"body": "Podcast #13 acerca de la película de animación Kiribati realizada con Software Libre (Blender)\n\nhttp://127.0.0.1:43110/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:8:Kiribati+Podcast+13+-+Current+%28Spanish%29",
			"added": 1464977665
		},
		{
			"topic_id": 2,
			"title": "Kiribati Podcast Ep. #18 - Comercialización",
			"body": "Kiribati es una película de animación que se está realizando utilizando diferentes tecnologías Libres.\nhttp://127.0.0.1:43110/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:19",
			"added": 1468429456
		},
		{
			"topic_id": 3,
			"title": "Kiribati Podcast Ep. #19 - Natalia",
			"body": "¡Entrevistamos a Natalia Rosminati, la directora de voces de la película!\nhttp://127.0.0.1:43110/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:20",
			"added": 1469628057
		},
		{
			"topic_id": 4,
			"title": "Introducción a IPFS en 2 minutos",
			"body": "IPFS nos permite agregar imágenes, video y audio a nuestros zitios sin sobrecargar ZeroNet.\n\n[http://127.0.0.1:43110/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:37:IPFS+en+2+minutos](/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:37:IPFS+en+2+minutos)",
			"added": 1477677836
		},
		{
			"topic_id": 5,
			"title": "Crear un sitio en ZeroNet desde 0 en 2 minutos",
			"body": "Una de las maneras mas comunes de crear un sitio en ZeroNet es clonando uno ya existente, pero a veces queremos simplemente crear un sitio desde cero, aquí te explico como.\n[http://127.0.0.1:43110/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:38:Crear+un+sitio+en+ZeroNet+desde+0+en+2+minutos](/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Post:38:Crear+un+sitio+en+ZeroNet+desde+0+en+2+minutos)",
			"added": 1477853107
		},
		{
			"topic_id": 6,
			"title": "Red Zeronet Privada",
			"body": "Buenas! Alguen sabe como armar una red privada? Es decir que no se mezcle con la red que estamos usando ahora miso.",
			"added": 1478330007
		},
		{
			"topic_id": 7,
			"title": "Chatbot - Version Beta",
			"body": "http://127.0.0.1:43110/1AeCt2VSk9NR1nGvegkunUpDvHtgsJ5dNj",
			"added": 1482123243
		},
		{
			"topic_id": 8,
			"title": "Escrache a varios profesores de Universidad Argentina por acoso",
			"body": "Escrache en Twitter a varios profesores de la Universidad Nacional de Tucumán por acoso\n\nhttps://twitter.com/Marumhy/status/992132803381940224\n\nIPFS: https://ipfs.io/ipfs/QmdvaTkLN8GDUwSPpjuCoBbN9nxjtZikmtCDSwmJjhtqQm/\n\n> Un docente de la fac de odontología le dijo a sus alumnas que no entendía que hacían ahí, que se vayan a su casa porque las mujeres tienen 4 neuronas, una para cada hornalla HASTA CUANDO VAN A SEGUIR ENSEÑANDO ESTOS VIEJOS NEFASTOS?!?!?!\n\na\n> También se pone una dentadura en el bolsillo del pantalón y hace que las chicas metan la mano para \"\"\"reconocer dientes\"\"\"\n\na\n>  No sólo eso no es nuevo sino que es generalizado. No hay ni un dinosaurio en esa cátedra que se salve. Hay uno que se ponía dientes en el bolsillo de SU delantal, tenías que meter la mano AHI y reconocer qué diente era sin mirar.",
			"added": 1525539632
		},
		{
			"topic_id": 9,
			"title": "Arqueología de zitios en Español",
			"body": "Lista de zitios aparentemente huérfanos, que aún pueden contener información interesante\n\nSoberanía alimentaria:\nhttp://127.0.0.1:43110/1JPEB48bP2mBnd9knKrBiLkoGZC6r7SjMZ/\nhttp://127.0.0.1:43110/1PUP93A7wK3EnJcnWdBGzUB2chnCTJToQq/\nhttp://127.0.0.1:43110/1WXrbTh9HiJoemqBWxfLc1h7zHF1mHjfb/\nhttp://127.0.0.1:43110/1EsymyEW97pFPJPQLqQairLdcDcVTxqKPR/\nhttp://127.0.0.1:43110/1Asy5bxDXSCS1aGDzdELfayZffneXiKjww/\n\nChat Argentina:\nhttp://127.0.0.1:43110/1ChatnMFZ1r488kRJg3BvQbMfu3p1fjbun/\n\nZeroWiki:\nhttp://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/\n\nNoticias:\nhttp://127.0.0.1:43110/1Lp4WByLuFW1ZyTSdxupgtrQSfjghPE8hp/\n\nDirectorio de sitios:\nhttp://127.0.0.1:43110/12gkmk2syYXbTLcHkoxbhejQNJArN33kZW/\n\nPrivacy Tools:\nhttp://127.0.0.1:43110/es.privacytools.bit/\n\nCursos libres: http://127.0.0.1:43110/1PCnxcCaTX6XJJ98NEhPkckiqzxJ4E1VRg/\n\nBlogs:\nhttp://127.0.0.1:43110/darkblog.bit/\nhttp://127.0.0.1:43110/1AxvGDHuuRnT4gvH9s78EMmihv5PTeDV4E/\nhttp://127.0.0.1:43110/1GK6eBSX6Ccsm7k1uKU3puvKwHj6fp5Dnk/\nhttp://127.0.0.1:43110/13QEhijknGXdBToa3M251RyjdaefidnBVi/\nhttp://127.0.0.1:43110/19rJZy4wQuKLyigUUzyuPz1dJtoBcBqoP2/\nhttp://127.0.0.1:43110/1EsymyEW97pFPJPQLqQairLdcDcVTxqKPR/\nhttp://127.0.0.1:43110/1FWBTvwSU9h7LeHzw3WzT4njov2eqNZqJE/\nhttp://127.0.0.1:43110/1CxmVewr5vzkxN4f5z1r7PwDHcsvTeJu4e/\nhttp://127.0.0.1:43110/1Q3N9ZRuRrbzzUQfxatTRqB6rFgEPN12CP/\nhttp://127.0.0.1:43110/1QKempYk7DEQZpJ1zT3rxJeNiYE4P2nyQo/\nhttp://127.0.0.1:43110/1376nxwSYNJPLHEdWDYWvkcJU86QU3zKxH/\nhttp://127.0.0.1:43110/1QCgD2C8GSXRpfZGQVHo9qeGQ2obUHauKD/",
			"added": 1525887352
		},
		{
			"topic_id": 10,
			"title": "Paradoja de la tolerancia",
			"body": "La paradoja de tolerancia fue descrita por el filósofo austríaco Karl Popper (1902-1994) en 1945. Es una paradoja enmarcada dentro de la teoría de la decisión. La paradoja declara que si una sociedad es ilimitadamente tolerante, su capacidad de ser tolerante finalmente será reducida o destruida por los intolerantes. Popper concluyó que, aunque parece paradójico, para mantener una sociedad tolerante, la sociedad tiene que ser intolerante con la intolerancia. \n\nEl filósofo Karl Popper definió la paradoja en 1945 en La sociedad abierta y sus enemigos (volumen 1).\n> Menos conocida es la paradoja de tolerancia: La tolerancia ilimitada debe conducir a la desaparición de la tolerancia. Si extendemos la tolerancia ilimitada aun a aquellos que son intolerantes; si no nos hallamos preparados para defender una sociedad tolerante contra las tropelías de los intolerantes, el resultado será la destrucción de los tolerantes y, junto como ellos, de la tolerancia. Con este planteamiento no queremos significar, por ejemplo, que siempre debamos impedir la expresión de concepciones filosóficas intolerantes; mientras podamos contrarrestarlas mediante argumentos racionales y mantenerlas en jaque ante la opinión pública, su prohibición sería, por cierto, poco prudente. Pero debemos reclamar el derecho de prohibirlas, si es necesario por la fuerza, pues bien puede suceder que no estén destinadas a imponérsenos en el plano de los argumentos racionales, sino que, por el contrario, comiencen por acusar a todo razonamiento; así, pueden prohibir a sus adeptos, por ejemplo, que prestan oídos a los razonamientos racionales, acusándolos de engañosos, y que les enseñan a responder a los argumentos mediante el uso de los puños o las armas. Deberemos reclamar entonces, en nombre de la tolerancia, el derecho a no tolerar a los intolerantes. Deberemos exigir que todo movimiento que predique la intolerancia quede al margen de la ley y que se considere criminal cualquier incitación a la intolerancia y a la persecución, de la misma manera que en el caso de la incitación al homicidio, al secuestro o al tráfico de esclavos. Tenemos por tanto que reclamar, en el nombre de tolerancia, el derecho a no tolerar la intolerancia. Karl Popper\n\nEn 1971, el filósofo John Rawls concluye en su Teoría de la justicia que una sociedad justa tiene que tolerar al intolerante, o si no, la sociedad podría volverse intolerante, y por ello injusta. Aun así, Rawls también insiste, como Popper, que la sociedad tiene un derecho razonable a la supervivencia, que supersede el principio de tolerancia: \n\n> Mientras una secta intolerante no sea señalada como intolerante, goza de libertad, la que debe ser restringida solo cuándo los tolerantes, sinceramente y con razón, crean que su propia seguridad y la de las instituciones que garantizan la libertad están en peligro. John Rawls\n\nEn un trabajo de 1997, Michael Walzer preguntó «¿Debemos tolerar al intolerante?». Resalta que la mayoría de los grupos religiosos minoritarios que se benefician con una sociedad tolerante son, ellos mismos, intolerantes, al menos respecto a algunos temas. En un estado de derecho, las personas pertenecientes a esos grupos pueden aprender a tolerar, o al menos a comportarse «como si poseyeran esa virtud».\n\nThomas Jefferson trató la idea de una sociedad tolerante en su primer discurso inaugural, preocupándose por quienes pueden desestabilizar el país y su unidad\n> Dejemos que sus opiniones sean monumentos a la seguridad de que dichas opiniones erróneas pueden ser toleradas, así la razón es libre de combatirlas.\n\n## Tolerancia y libertad de expresión\nLa paradoja de la tolerancia es importante en la discusión sobre si hay que establecer límites a la libertad de expresión. Popper afirmó que permitir libertad de expresión a aquellos que la utilizarían para eliminarla es una paradoja. Rosenfeld declara «parece contradictorio extender la libertad de expresión a extremistas que... si triunfan, suprimirían sin dudar las opiniones de aquellos con los que discrepan», y llama la atención a que las democracias europeas occidentales y Estados Unidos tienen aproximaciones opuestas a la cuestión de tolerancia del discurso de odio.\n\n## Homofilia e intolerancia\nLa relación entre homofilia (una preferencia para interaccionar con aquellos con opiniones similares) y la intolerancia se manifiesta cuando una persona tolerante se enfrenta al dilema de elegir entre establecer una relación positiva con un individuo tolerante perteneciente a un grupo diferente, o establecer una relación positiva con un miembro intolerante de su mismo grupo. En el primer caso, el intolerante perteneciente a su grupo desaprueba la relación establecida con el individuo del otro grupo, generando necesariamente una relación negativa con su par; mientras que en el segundo caso, la relación negativa hacia el individuo del otro grupo es aprobada por el intolerante, lo que promueve una relación positiva entre ambos individuos del mismo grupo.\n\nEste dilema ha sido considerado por Aguiar y Parravano en Tolerando al intolerante: Homofilia, intolerancia y segregación en redes sociales, modelando una comunidad de individuos cuyas relaciones están gobernadas por una forma modificada de la Teoría de equilibrio de Heider.\n\nFuente: Wikipedia",
			"added": 1526070748
		},
		{
			"topic_id": 11,
			"title": "Encuesta para Estudiantes Universitarios",
			"body": "Los invito a llenar esta encuesta acerca de la vida universitaria.\n\nMil gracias!! (se sortearán pequeñas recompensas en forma de agradecimiento)\n\nhttps://goo.gl/forms/S0XIPJK4kYiDf59h1",
			"added": 1539093860
		}
	],
	"topic_vote": {
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1,
		"2_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": 1,
		"1_13bJknLwBVJ4nmEHLqovNhzyD8wVA6ez6C": 1,
		"1_18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx": 1,
		"2_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": 1,
		"3_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": 1,
		"8_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": 1,
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": 1,
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"1_18782hkwUUVCC4QormwpLxyMuj9mhD52Fj": 1,
		"2_13bJknLwBVJ4nmEHLqovNhzyD8wVA6ez6C": 1,
		"5_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": 1,
		"1_1EPLXp3NkA2e8eiNUY4toZNkHmojgKriTj": 1,
		"2_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"1_1Q9jUKoBpVsFgd3sWwURapdFnJcWcei7MU": 1,
		"1_128jDCWZixae8vrVCFRf12e4MgwCiHp5Ra": 1
	},
	"next_comment_id": 17,
	"comment": {
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi/eibriel@zeroid.bit",
				"added": 1476986798
			}
		],
		"2_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 2,
				"body": "Exelente!",
				"added": 1477950498
			}
		],
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 3,
				"body": "Muy buena la info, gracias por agregar mi humilde Blog $D",
				"added": 1477950609
			}
		],
		"2_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 4,
				"body": "Ahora a publicar mucho contenido! Jeje",
				"added": 1477950701
			}
		],
		"2_13bJknLwBVJ4nmEHLqovNhzyD8wVA6ez6C": [
			{
				"comment_id": 5,
				"body": "Interesante!",
				"added": 1477951087
			}
		],
		"6_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 6,
				"body": "> [juansantiago](#comment_10_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Tal vez como en torrent, trackers con pasword\n\nInteresante, voy a investigar eso",
				"added": 1478355396
			}
		],
		"7_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 7,
				"body": "> [rapapobre](#comment_69_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): muy buen aporte; aunque se echa en falta, no solo en chatbox, sino en todas las opciones de chats en zeronet, la implicación con zerohello como bandeja de notificación donde el usuario pueda informarse y actuar\n\nSi, es una buena idea y voy a ver como podría ser implementada en el futuro",
				"added": 1482268657
			},
			{
				"comment_id": 8,
				"body": "> [juansantiago](#comment_14_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Explicación o tuto about?\n\nNo puse una descripción porque quise mantener el perfil bajo, hasta tener algo mas pulido jeje. Ya voy a ir poniendo mas info",
				"added": 1482268717
			}
		],
		"1_1BRYEKgJq8PNhsKJmdGpSvppfnCFpsLXR3": [
			{
				"comment_id": 9,
				"body": "Ah?",
				"added": 1525203621
			}
		],
		"1_1AExFujBF6s3Rz3rVLojQzjXb5e4RvLhZU": [
			{
				"comment_id": 10,
				"body": "¡Hola Susana!\n¿Qué me gané?",
				"added": 1525294930
			}
		],
		"8_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 11,
				"body": "> [doncipote](#comment_2_1GqCXXyUYQrKJF1zrtGH4yxapQUQAGWVLd): https://twitter.com/lilohr98/status/972124122951102469/photo/1\n\nTal cual",
				"added": 1525716650
			}
		],
		"1_1QCyQRZtSRyWmTbPnUHfa8i6ZMADipKbr1": [
			{
				"comment_id": 12,
				"body": "Si querés mantener tu IP privada si. Los zitios pueden cargar contenido de la clearnet o sin querer podés hacer click en un link externo que te dirija a la clearnet exponiendo tu IP.",
				"added": 1527093273
			}
		],
		"1_1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ": [
			{
				"comment_id": 13,
				"body": "Si, tenes que copiar un archivo, pero ahora no encuentro el nombre... cuanto lo encuentre te digo bien",
				"added": 1527819987
			}
		],
		"2_1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ": [
			{
				"comment_id": 14,
				"body": "Yo empesaría por quejarme con Iguanafix",
				"added": 1528567887
			},
			{
				"comment_id": 15,
				"body": "> [danniel](#comment_6_1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ): Si, olvide mencionar que lo contacte por ahí pero al final lo hicimos por nuestra cuenta porque el presupuesto de iguanafix es muy elevado. Calculo que igual lo puedo escrachar.\n\n¿Él te sugirió hacerlo por afuera? En este caso ya no le podés reclamar nada a IguanaFix supongo. La única que te queda es hacer una denuncia policial y con algo de suerte IguanaFix pueda brindar datos para encontrarlo. En teoría ellos tienen sus datos personales.\n\nA mi me estafaron de una forma similar por MercadoLibre, enviándome una boleta de pago \"por fuera\" de MercadoLibre sin que yo me de cuenta. Cuando pagué desapareció el vendedor, y MercadoLibre se puede lavar las manos porque no tuvo nada que ver.",
				"added": 1528569659
			}
		],
		"1_14j8h49SqGcHkidtc9SV2ffV9vdfimxKVF": [
			{
				"comment_id": 16,
				"body": "Intente entrar pero no pude, me dice que \"no se han encontrado pares\". Tenes el puerto abierto? Estas usando Tor?",
				"added": 1531266224
			}
		]
	},
	"comment_vote": {
		"10_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": 1
	}
}