{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1576643812,
			"title": "The true price of Bitcoins as of today 1,095,238 and why.",
			"body": "This calculation is based on public records searchable.\n\nTherefore, my calculations are estimates and may fluactuate on a daily basis ! \n\nGlobal wealth 273 trillions \nGlobal debt 250 trillions \nGlobal real (nominal\t)wealth 23 trillions \n(273t-250t=23t)\n\nThey are 21.000.000 (millions) to be mined by year 2140\n\n(23t÷21m=1,095,238)\n\nAfter the Reset, the Global wealth will be represented in Bitcoins available at the time. \n\n(U. S. DEBT as we speak 23 trillions, coincidence?) \n\n2nd scenario would be to represent 90% of the Global wealth in Bitcoins and the other 10% in Gold, Silver and other assets) that would still make 1 Bitcoin worth ~900,000 per coin. \n\nElites know and hide the plan. \n\n*all estimates \n\nFeel free to take part in the discussion.",
			"added": 1576643811
		},
		{
			"topic_id": 1576761563,
			"title": "Gold, Silver and Bitcoins are intentionally suppressed to distract you from it.",
			"body": "But they are the real money of intrinsic value...",
			"added": 1576761561
		},
		{
			"topic_id": 1578105095,
			"title": "Time to buy Gold, Silver, Bitcoin and hold liquid assets",
			"body": "The signs are here.",
			"added": 1578105092
		},
		{
			"topic_id": 1594974805,
			"title": "Twitter Hack is to discredit Bitcoins, an inside Job",
			"body": "by the one, who controls the narrative since dawn.",
			"added": 1594974801
		}
	],
	"topic_vote": {
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1578105095_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 1,
				"body": "> [quantumkitty](#comment_327_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Rather than worrying about money, worry about producing the things that money buys. Gold would be useless in an uninhabited island.\n\nOn an uninhabited island, you don't need anything but yourself and opposite sex to reproduce and living off mother nature.",
				"added": 1578197559
			},
			{
				"comment_id": 2,
				"body": "> [thetruth](#comment_52_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): MONEY is just a little tiny part of the EQUATION ...but you need something of value for the next move.\n\nAgreed to your equation analogy. \nMany people don't see the bigger picture, they are narrow minded to the core.",
				"added": 1578197903
			},
			{
				"comment_id": 3,
				"body": "> [totaldarkness](#comment_8_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer): Basically this.  You can't eat gold, silver or Bitcoin.  You'd better learn to be completely self sufficient, and / or have useful things to bring to the bartering table.\n\nAbsolutely, once there are two or more people involved in an exchange, a more standardised medium of exchange will be needed and will arise.",
				"added": 1578198719
			},
			{
				"comment_id": 4,
				"body": "> [zaron](#comment_57_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): eh, the signs have been there for thousands of years.. still skidding into the endzone\n\nWe are experiencing the PAST, PRESENT AND FUTURE at the same time :-)",
				"added": 1578202880
			}
		]
	},
	"comment_vote": {
		"52_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1
	}
}