{
	"next_comment_id": 7,
	"user_name": "Real Human Bean",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1532672882": 1532721632,
		"1Djcnx9yoTQp2w75zSCXKAjmTGXYDpUYhA_1556435717": 1556464766
	},
	"comment": [
		{
			"comment_id": 4,
			"body": "@P2P: \n@猫叉酱（小号）: \nhttps://www.bloomberg.com/news/articles/2018-10-04/the-big-hack-amazon-apple-supermicro-and-beijing-respond\n\nHere are the folowing responds,maybe there are some new clues\nMaybe it's a bit too rush to say that china can not make and install a chip like this.The amount of code is quite small and many supermirco chips are made in china.If military and intelligence personals are involved,they probably have the resources they need.",
			"post_uri": "1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1538736160",
			"date_added": 1538816246
		},
		{
			"comment_id": 5,
			"body": "https://decryptmedia.com/2018/09/21/the-great-blockchain-of-china/",
			"post_uri": "1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1538798780",
			"date_added": 1538817173
		},
		{
			"comment_id": 6,
			"body": "@猫叉酱（小号）:\n@P2P: \nI honestly i don't know.Also i didn't mean nor believe that bloomberg's article is necessarily the truth.Too many opinions and ambiguous 'sources' i'd say.What I meant is that china have lots of very smart persons who works for the regime.So they may have the techs that can surprise us.We can not under-estimate them.Also hardware based backdoors are very attractive to the powers worldwide.either to China or US.\n\nSurely I hope this is not true,For we already have many loopholes and 0days nowadays.A hardware attack like this mean that the war is now escalated into a new level,assuming that is true.\nIt's possible that the bloomberg made up this article just to endorse the trade war,or to encourage corporations moving their production factories out of china.Those are my opinions,of couse,may not be the fact.Although Those commercial medias post 'news' for their own purpose and agendas,i feel that faking a serious news like this is quite suicidal.Not only because they will face serious law issues,it will also literally kill whatever the poor credibility they have left.\n\nThe only sure way to find out the result is that someone have one of those 'compromised' chips and run test on them.Although i didn't find that bloomberg have given the infomation about which specific models were modified.I am saying that it's a little hasty to fully accept or deny what bloomberg have said without more detailed and independent investigations. \n\nI hope we keep this in a friendly discussion okay?I just believe that the possibility is there but still we need solid proof to see that wether this happened or not.",
			"post_uri": "1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1538736160",
			"date_added": 1538836020
		}
	]
}