{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1610231360,
			"title": "How to grow ZeroNet?",
			"body": "today was my first day using this system and I'm very impressed, especially with how easy it is to set up. however, the forums aren't active enough yet to be really engaging. what's a good strategy to attract more users to this place?",
			"added": 1610231359
		},
		{
			"topic_id": 1610253332,
			"title": "Is this the best decentralized internet going forward?",
			"body": "sorry if this post sounds opinionated, but my question is basically whether ZeroNet is \"the real deal\", i.e., is it something sturdy enough to become a real alternative to the \"normal internet\" for decades to come.\n\nwhat is ZeroNet competing with? Mastodon, I2P, Tor, etc.. all seem to have different goals or focuses. something I like about ZeroNet is that it just tries to solve the decentralization problem without doing any further privacy stuff. that way, you can use it with Tor and I2P (if I'm understanding correctly). that's sort of like the \"Unix Philosophy\" I guess.\n\ntl;dr is this the best alternative internet? (sorry again for this n00bish question. i'll just lurk moar if nobody wants to reply)",
			"added": 1610253330
		},
		{
			"topic_id": 1610350298,
			"title": "What is your OS?",
			"body": "what do you run? GNU/Linux? BSD? something else?\n\nwhat's the ideal operating system for someone interested in decentralized internet, privacy, encryption, etc?",
			"added": 1610350295
		},
		{
			"topic_id": 1610353747,
			"title": "Can zeronet be made into a browser extension?",
			"body": "Someone on 0chan asked this question, and I'd like to know as well.",
			"added": 1610353743
		},
		{
			"topic_id": 1610354895,
			"title": "Resources for understanding ZeroNet and related technologies",
			"body": "Hello. What are some books/[zs]ites/youtube playlists for understanding how p2p, blockchain, encryption etc work in Zeronet? And for Tor, Freenet, I2P and other decentralized internet projects as well?\n\nAssume the \"student\" has some basic programming and computer networking experience.",
			"added": 1610354890
		},
		{
			"topic_id": 1610356743,
			"title": "Better frontend/UI for ZeroTalk",
			"body": "I like the minimal design of this zite but it's lacking in features. I want some way to get notified when someone replies to me, and a way to search comments by keywords.\n\nWhat's the best way of doing that? I'd assume there's a way to use Violentmonkey or Stylus to implement these without needing to change the backend at all. Has anyone tried something like this before?\n\nAlso, I did find the zite's repo, but it doesn't have any documentation:\n\nhttps://github.com/HelloZeroNet/ZeroTalk",
			"added": 1610356737
		}
	],
	"topic_vote": {
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610071451_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610045007_1Dt486kkbdhZktV8JXcv7F9YqpSNBAsxYt": 1,
		"1610364210_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 47,
	"comment": {
		"1610221008_1oqB7832C1ZbyXfR9XLLbAMgwifdSVM6J": [
			{
				"comment_id": 1,
				"body": "recuperation and research/development",
				"added": 1610222560
			}
		],
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 2,
				"body": "> [bicklevov](#comment_1_18tBB7LRsGcCYkAU5fNDwTMADzVzHFa5rm): i like the decentralized networks, but the next threat to these are IPs. how do you get around that?\n\ncare to elaborate? what are \"IPs\", do you mean Internet Service Providers?",
				"added": 1610222746
			},
			{
				"comment_id": 5,
				"body": "> [soarin](#comment_1_1DVXHJ6CoM25Qdndp9puGZVUsHcymJtHV): Every device you have that is connected to the internet has a unique IP (Internet Protocol)\n\nAh, right. of course. Thanks for answering my silly question :)",
				"added": 1610226267
			},
			{
				"comment_id": 6,
				"body": "> [unsnapgreedless](#comment_2_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): But to read \"not tech-savvy enough to know about or discover ZeroNet...Minds, Parler, Gab, etc.\" that just makes my blood boil\n\nyeah, I did a double take there since I couldn't believe ZeroNet was considered \"tech-savvy\". I got it running in a few minutes. you just run the shell script and it does everything for you automatically.",
				"added": 1610226416
			}
		],
		"1610193120_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": [
			{
				"comment_id": 3,
				"body": ">fascism\n\nFuck off. People like you are the ones making anti-censorship projects look bad.",
				"added": 1610223510
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "How can I hide threads in ZeroTalk after I've read them?",
				"added": 1610226135
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_2854_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Unfollow the thread.\n\na thread still shows up whenever other people bump it to the top, even if I'm not following it. do you think I'm missing something there? thanks",
				"added": 1610253409
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 7,
				"body": "> [goodusername](#comment_10_112NAM5jhYWH4egafracJEF92oyeUY3F3T): who's gaining power from all this?\n\nmaybe groups like the World Economic Forum",
				"added": 1610226676
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": ">If you have to lockdown, then governments have an obligation to compensate people for lost wages through large enough stimulus checks.\ngiven how much bank Amazon is making off of all of this, it would be nice they were the ones who reimbursed people and smaller businesses instead of the taxpayers :P",
				"added": 1610229867
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 9,
				"body": "This place is cool and surprisingly active for what it is. Is ZeroTalk the most active discussion forum on ZeroNet?",
				"added": 1610230251
			},
			{
				"comment_id": 11,
				"body": "> [savuth](#comment_8_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E): an actual zite\n\nwdym? you want user created boards?",
				"added": 1610235650
			},
			{
				"comment_id": 27,
				"body": ">>>/pol/ retards\ndon't ruin another platform please",
				"added": 1610343130
			},
			{
				"comment_id": 28,
				"body": "\">\" \">\" \">\" /pol/\nthere",
				"added": 1610343175
			},
			{
				"comment_id": 31,
				"body": "Are you guys ever guilty that everything you touch dies? Seems like the real degenerates are you.",
				"added": 1610348923
			},
			{
				"comment_id": 32,
				"body": "> [sirlotaplot](#comment_37_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): >>> learn to tri-quote scrub\nwhat escape character do you use? backslash?\n\\>\\>\\>",
				"added": 1610350370
			},
			{
				"comment_id": 33,
				"body": "> [bimmyql](#comment_32_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): what escape character do you use? backslash?>>>\n\nalright. there we go.\n\nto repeat myself:\n\n\\>\\>\\>/pol/ retards",
				"added": 1610350435
			},
			{
				"comment_id": 34,
				"body": "> [sheqelstein](#comment_1_1BBH2zzYFaYBWqtCjFQ9nAtFsudzTX1eZY): Can we touch you?\n\nDo you not see how coming here to say NIGGER NIGGER NIGGER is helping your enemies? I'm just curious about how stupid you people actually are.",
				"added": 1610354232
			},
			{
				"comment_id": 35,
				"body": "> [namvata55](#comment_11_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): oh noes are they gonna send it to vice news and call us nazis?!?!?!?! what will we ever do?!?!?!?!??!?!?!!?!?\n\nThey'll associate the decentralized internet movement with your shitposting, and ruin it for the rest of us. Since you idiots aren't the ones who understand the technology or maintain it, eventually you'll get unplugged too when we give up on your lost cause. So, maybe shut the fuck up for once in your life? idk.\n\nYou can criticize the Left all day. That's good. Just don't come here just to say NIGGER NIGGER NIGGER like a fucking 12 year old",
				"added": 1610355578
			},
			{
				"comment_id": 36,
				"body": "> [namvata55](#comment_12_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): we gotta have good optics on a p2p platform where people share child porn\n\nWe literally do though, and especially because of that. Are you conscious of how backwards your argument is?\n\nIt seems almost as if you don't actually care whether a decentralized internet replaces the current shitshow the world is using. Is zeronet just a new toy that you can break? What do you see the point this technology as being?",
				"added": 1610368172
			},
			{
				"comment_id": 38,
				"body": "> [memesadler](#comment_2_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): We should be asking why no one talks about attacking Zeronet for child porn but are sounding the alarms over pro-White political dissidence.\n\nI guess you're saying that I ought to be equally concerned about CP and \"political dissidence\" (see my earlier posts, dissidence isn't what I'm criticizing). Sure? I'm not seeing how your post is more than a kind of rhetorical-effect answer.",
				"added": 1610370856
			},
			{
				"comment_id": 39,
				"body": "> [namvata55](#comment_17_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): like there are already threads on here of people linking to their CP sites, why don't you put your energy into complaining about them?\n\nOkay. I will next time I see one.",
				"added": 1610394018
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "extremists are never smart enough to realize that they're the ones doing the most to harm their own cause.",
				"added": 1610230765
			},
			{
				"comment_id": 13,
				"body": "> [unsnapgreedless](#comment_7_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): And yet, what we're literally seeing in the world right now are \"far right\" proponents fleeing to alternate social media platforms, because the FAR-LEFTISTS in control of Big Tech are... \"shit[ting] all over people's freedoms and free speech [since they're becoming] actual policy\" [...]\n\nbeing critical of the far left doesn't make you far right",
				"added": 1610251984
			},
			{
				"comment_id": 20,
				"body": "> [deuxzaron](#comment_34_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Is it free speech to tell the truth about Donald Trump's addiction to licking little boys feet?\n\nlmao",
				"added": 1610255904
			},
			{
				"comment_id": 22,
				"body": "> [georgelynntone](#comment_1_1KfAKDDddj9hpf8ANuVDWQk3rJJWB87zav): just like everyone else does.\n\nDon't fool yourself. Not everyone is this cynical.",
				"added": 1610259904
			}
		],
		"1610231360_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 12,
				"body": "> [quantumkitty](#comment_521_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): The only thing that can help ZeroNet is more proxies, to allow people to try the network without downloading anything.\n\nIs there a list of them? I never saw any.",
				"added": 1610235774
			},
			{
				"comment_id": 17,
				"body": "> [iiiiii](#comment_5_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN): KOLs\n\nsorry what does this stand for?",
				"added": 1610255773
			}
		],
		"1609283387_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "Cool. I'll try this the next time I'm forced to buy something off Amazon.",
				"added": 1610253599
			}
		],
		"1610045007_1Dt486kkbdhZktV8JXcv7F9YqpSNBAsxYt": [
			{
				"comment_id": 16,
				"body": "Bump. These are serious questions. I'm also curious about how video playback is supposed to work.",
				"added": 1610253656
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 18,
				"body": "> [deuxzaron](#comment_36_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): They control their own houses. Step out of their houses and you're out of their control\n\nwell said",
				"added": 1610255804
			},
			{
				"comment_id": 24,
				"body": "> [namvata55](#comment_7_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): the problem is if the platform gets too big websites will start taking up entire hard drives\n\nis there anyway around this? that seems like a fatal problem for long term growth.",
				"added": 1610315497
			},
			{
				"comment_id": 25,
				"body": "> [edgelordofdecent](#comment_760_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Creating your own zites.\n\nI don't really get it. How is that going to help?",
				"added": 1610341974
			},
			{
				"comment_id": 26,
				"body": "> [styromaniac](#comment_2858_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's when you make hubs for your state/territory and/or narrow criteria. Most people you know are physically near you.\n\nWhy would physical location matter? Because of ping times/latency and things like that? Sorry I'm a noob.",
				"added": 1610342030
			}
		],
		"1610255440_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 19,
				"body": "context?",
				"added": 1610255848
			},
			{
				"comment_id": 21,
				"body": "> [apely56](#comment_10_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG): perhaps read the content?\n\nI'm still afraid of clicking random links on this place w/o knowing what it's about :P",
				"added": 1610256339
			}
		],
		"1610253332_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 23,
				"body": "> [hadez](#comment_3_1GANYtYYvAszYKLRSLWBkYEjmdhQrbThNr): Hey, you mentioned alternatives. Can you list some? I'd like to try out more stuff like this. Thanks!\n\nme too.",
				"added": 1610315160
			},
			{
				"comment_id": 29,
				"body": "> [theborg](#comment_4_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): what about https://urbit.org/understanding-urbit/Never tried bud sounds nice..\n\nthis is a complete VM. I guess it wouldn't be compatible with ZeroNet?\n\nHas anyone used this before?",
				"added": 1610343595
			}
		],
		"1610318482_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 30,
				"body": "> [eightyfour](#comment_119_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Custom browser\n\nIs it mandatory? If so, that's a major downside imo.",
				"added": 1610343689
			}
		],
		"1610364210_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 37,
				"body": "Very cool. see the comment/question I left.",
				"added": 1610370539
			}
		],
		"1610354895_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 40,
				"body": "> [bats](#comment_57_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): Some documentation here: http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/No idea if it's current or not.\n\n> [anshorei](#comment_172_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): I have some introductory content on my blog:http://localhost:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Home [...]\n\nThanks! I'm really impressed how I can get answers here while being outside of the clearnet. I'll give these all a look.",
				"added": 1610394332
			}
		],
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 41,
				"body": "If it's possible to make cryptocurrencies that are resistant to manipulation, it should be possible to make an internet that works the same way, right? I'm really hoping this is one of the cases where there's a technological solution to a social problem.",
				"added": 1610398273
			},
			{
				"comment_id": 42,
				"body": "> [yeshat](#comment_2_1C4R9Vxrn6u6XGYTUWvuAtevUJUSBxjdgK): This is just kinda like 4chan net.\n\nmost smaller boards on 4chan have been fairly resilient to the influx of rightwing reddit users. It's just /pol/ in particular which is festering pile of shit. the native culture of the site is apolitical.",
				"added": 1610415339
			},
			{
				"comment_id": 43,
				"body": "> [p0rtal](#comment_41_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2): Global Fileshare with universal adblock-like filter-lists is whats needed to protect major abuse.\n\nYes, I think this is it. The \"secret sauce\" to make zeronet infinitely scaleable yet able to avoid the abuse that comes with popularity.\n\nI'm glad somebody else is able to feel optimistic as well :). so tired of people saying \"oh it's all doomed there's nothing we can do\". I think that's really silly considering how well bitcoin has proven these technologies can work even without needing to be advertised. After all, even stuff like Git is decentralized (in principle). And of course, also, torrenting has always been wildly successful. Hopefully in a few years the idea of having decentralized forums will seem commonplace. Right now it's still a weird idea to most people, so they say \"nah I don't like it!\" :P",
				"added": 1610415852
			},
			{
				"comment_id": 45,
				"body": "> [namvata55](#comment_30_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): the only problem is we have to hope that once the network gets popular certain (((BAD ACTORS))) don't try to taint everything with fucking kiddie porn and get people in trouble\n\nFor fresh installs, does it make sense to have a very strict, curated list of users and zites to allow content from by default? Perhaps then some sort of \"Web of Trust\" can be used to gradually expose new content to the most experienced users first, and if it doesn't get flagged by anyone, then raise its trust score to signal to newer users that its probably okay.\n\nNot a foolproof system, but neither is the normal internet :P\n\n(This is just me rambling of course. I'm more interested in what someone who actually understands the zeronet internals thinks about how to do \"hands off\" moderation.)",
				"added": 1610426281
			},
			{
				"comment_id": 46,
				"body": "> [edgelordofdecent](#comment_764_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): @bimmyql you can block content from certain ids. You do the moderation yourself.\n\nof course, and that's the best way. but isn't there a concern of \"bad actors\" (as namvata55 was saying) intentionally trying to conceal CP in downloaded content? seems like for that you'd need a prophylactic instead of just post-hoc blocking.\n\nBut is this (legal risks from accidental/malicious CP downloading) a real concern though, or just a bogeyman?",
				"added": 1610427658
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 44,
				"body": "Yeah, it's super weird. I guess Elon Musk is good at embracing the weirdness of what he's doing and seeming confident about it. On the other hand, Bill Gates is still trying to be mainstream acceptable.",
				"added": 1610421153
			}
		]
	},
	"comment_vote": {
		"4_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"4_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": 1,
		"4_18Ag7V81FS6MBiGvgzT3uxRoFJaEoFc9tr": 1,
		"1235_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"8_18rBTXj2fkSLcnaumaafaidHTFEA6eu5kV": 1,
		"2_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"1_13cVqEHKCFoJS44hKtUE7NJLrtLNWXcsPU": 1,
		"1_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": 1,
		"520_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"4_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"1_1GANYtYYvAszYKLRSLWBkYEjmdhQrbThNr": 1,
		"519_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"6_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": 1,
		"1_16JXVw3e2ubwoEP966mFnp3vt5PzyW5Pd4": 1,
		"2_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"11_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"4_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"12_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"521_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"76_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"4_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": 1,
		"36_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"33_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"5_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": 1,
		"4_1Dsw1CpgZiPYkVWLiqrgMJDTyXWEggCg2m": 1,
		"6_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": 1,
		"2_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN": 1,
		"8_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": 1,
		"7_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"122_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"120_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1_12eVhxNAYFPJi5rUnbHwbmKPnqAniJs7SA": 1,
		"32_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"33_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"171_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"11_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": 1,
		"170_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"172_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"57_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"526_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1_1JXjCUdKqR7B3c9f4SB2qBpWeawpGTwztW": 1,
		"529_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"528_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"41_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"10_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"1_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1
	}
}