{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1613519322_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	},
	"next_comment_id": 60,
	"comment": {
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 2,
				"body": "Czy to znaczy, że Zero ma problemy. Jak tego można uniknąć? Jestem nowy tutaj. Podoba mi się tutaj, a tu są znowu problemy. Co się dzieje z tym internetem?",
				"added": 1610872425
			}
		],
		"1610658422_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 3,
				"body": "Fajny temat, interesuje mnie. Gdzie można coś więcej dowiedzieć się. Chciałbym spróbować nauczyć się tej niewidzialności. Właśnie zamontowałem debiana, i poznaję go. Kumpel pomógł zamontować zeroneta.\nNa razie wszystko czytam i oglądam.",
				"added": 1611073194
			},
			{
				"comment_id": 7,
				"body": "Czy są jakieś instrukcje do ZeroNeta. Gdzie szukać.",
				"added": 1611207321
			}
		],
		"1611090757_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 4,
				"body": "Zainstalowałem Linuxa. I zainstalowałem zero net. Jestem początkującym użytkownikiem tego systemu.\nNie mogę otworzyć , żadnego linku? Czy ktoś wie dlaczego? Co mam zrobić? Chcą żebym się zalogował do google.\nA ja nie chcę tego zrobić, czy ktoś wie, Co można zrobić, żeby ominąć tą blokadę? Czy jest jakiś sposób na na ominięcie tego logowania. Zaczynam nowe życie, chciałbym pozostać anonimowy. Nie chcę być więcej niewolnikiem.\nProszę o jakąś poradę. Z góry dziękuję za pomoc.",
				"added": 1611121061
			},
			{
				"comment_id": 5,
				"body": "Radzenie sobie, to wielkie słowa. Ktoś życzliwy pomógł to zrobić. Poszukam tego \"dl\". Na razie wszystko czytam, co tutaj jest napisane. Dzięki za naprowadzenie. Zabieram się do roboty.",
				"added": 1611126058
			}
		],
		"1611049529_17tqEvyx1QiwVo6nbBe9F6UtWcPRzRUavU": [
			{
				"comment_id": 6,
				"body": "Obejrzałem, ale to już trochę stare nagranie; są nowsze. Chodzi o link.",
				"added": 1611207151
			}
		],
		"1611128756_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 8,
				"body": "Jednych skubnęli na kasę. A druga sierota wyrzuciła. Skąd on tyle tego nazbierał?",
				"added": 1611207553
			}
		],
		"1610847501_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 9,
				"body": "Nie myślałem, że to tak działa. Idzie się pogubić. Drukują jak papier toaletowy.",
				"added": 1611207763
			}
		],
		"1610822859_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 10,
				"body": "Nie zajmuję się polityką; Konkurencja zbanowała prezydenta USA. Tak jak oszukali w wyborach głosy.Co tutaj jest niejasnego. Oszukują, kradną głosy, żeby wywalić Trampa.",
				"added": 1611208109
			},
			{
				"comment_id": 18,
				"body": "Piszesz o rumble, czy warto to jest zainstalować? Chciałbym mieć to co jest dobre i korzystać z tego. Czy to może zastąpić yutube, jeśli tak? To popieram.",
				"added": 1611476631
			},
			{
				"comment_id": 19,
				"body": "jakoś tam zainstalowałem, to rumble. Wszystko po angielsku, tylko ona jedna po polsku nadaje. obejrzałem te materiały. W TV. mówią co innego na ten temat. Jest różnica.",
				"added": 1611561192
			}
		],
		"1610797003_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 11,
				"body": "Mnie polecił kolega tą wersję,  \"0.6.5.-zeronet\" i pomógł zainstalować. W sumie to była prosta sprawa. Ale i tak jeszcze sporo nie kumam. Patrzyłem do plików, i do tych ustawień. Można się pogubić, o co w tym wszystkim chodzi. I po co to jest. Nigdy czegoś takiego nie widziałem.",
				"added": 1611208543
			}
		],
		"1609762064_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 12,
				"body": "Ale dyskusja, nie wszystko mogę zrozumieć. Ale jest ciekawie. Ja do tej pory używałem pindowsa, jak ktoś wcześniej  napisał. Ale nazwa, Człowiek żyje i nic nie wie, co się dzieje. Coraz bardziej mi się podoba to zero, ważne że niema cenzury. Co napiszę to jest i nikt nie zbanuje.",
				"added": 1611209128
			},
			{
				"comment_id": 14,
				"body": "Panowie mam pytanie; Do czego służy \"users json\"   - content json,\ndata/users/content,json. \nCzy ktoś może mnie to wyjaśnić? z góry dzięki.",
				"added": 1611297778
			},
			{
				"comment_id": 25,
				"body": "Dzięki za obszerne wytłumaczenie problemu. Zrozumiałem, że to jest bardzo ważna czynność.\nMam pytanie dodatkowe? Gdzie jest lepiej zapisać sobie te dane.\nW komputerze , gdzieś w plikach? Czy wydrukować, i zapisać na papierze?\nCo byś doradził?\nPrzeglądam twoją stronę; dużo tam napisałeś porad na temat obsługi ZeroNeta. Niestety nie wszystko jest dla mnie zrozumiałe? Przesiadka z pindousa; systemu który wszystko robił za mnie, łącznie z kontrolą, powoduje taki skutek. Że niewiele wiem w tym temacie. Mam Pytanie?\nCo byś doradził poczytać, albo obejrzeć - dla początkującej osoby. Chodzi o to, żeby to było w kierunku podniesienia wiedzy o ZeroNecie...\nTen system bardzo mnie się podoba, i chciałbym tutaj na dłużej pozostać.",
				"added": 1613308900
			}
		],
		"1610376246_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 13,
				"body": "@arione :  Nie chodzi o synchronizacje. Przeczytaj odp; gafel2, Trzy pytania?\npozdr.\nJa odpowiadam; 3 x TAK.",
				"added": 1611240643
			},
			{
				"comment_id": 15,
				"body": "Laptopa też nie wyłączać, ale on sam się wyłącza po pewnym czasie. O dziwnych sprawach rozmawiacie? Gdzie można się dowiedzieć jak postępować ze sprzętem. Wszystko tutaj takie dziwne, wszystko jest inaczej, Mam wiele pytań. Ale nie chciałbym przynudzać. Gdzie można jakieś informacje przeczytać. Nakierujcie mnie.\nOd dziś nie wyłączam laptopa. Będzie cały czas włączony.",
				"added": 1611413347
			},
			{
				"comment_id": 17,
				"body": "Dzięki; Jeszcze nie ogarnąłem tej nowej instalacji, wciąż czegoś szukam. Przesiadka z pindowsa; ha,ha,ha. dobre okreslenie. na linuxa. to spore wyzwanie. czuje sie zagubiony. przegladam ustawienia i jego mozliwosci.strasznie duzo tego jest. mozna sie pogubic.",
				"added": 1611453948
			}
		],
		"1611351944_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 16,
				"body": "Ciekawe materiały; nie wszystko mogę zrozumieć ale czytam. To chyba nie są teorie spiskowe, dobrze powiedzieli że tutaj ciekawie się dzieje.",
				"added": 1611414350
			}
		],
		"1611829757_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 20,
				"body": "Tak, próbuję to rozgryźć. Ale mam problemy zrozumieć działanie tej platformy. Wszystko jest nowe i nie wiem gdzie pytać i kogo? Chyba już wszystko przeczytałem, co się dało przeczytać. Wszystko jest inne niż do tej pory mnie znane.",
				"added": 1611833196
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 21,
				"body": "Jak dobrze zrozumiałem, To zrezygnowałeś, bo nic ciekawego nie było? A nie przyszło tobie do głowy coś takiego, jak samemu coś napisać, albo wrzucić jakiś ciekawy Film. Ta forma działa na zasadzie dużo ludzi, i wszyscy mają włączone komputery. jestem tutaj nowy, ale już zdążyłem to skumać, o co tutaj biega. Mój komp, jest włączony cały czas; I będzie zawsze włączony. Pluję na okulary i tubę, pluję na windowsa, Pluję na wszystkie gnidy na utrzymaniu czarnych łbów. Jestem Wolnym człowiekiem. I takim pozostanę. Długo szukałem takiej formy internetu, znalazłem i tutaj pozostanę.\nTrzymajcie się.",
				"added": 1611937462
			},
			{
				"comment_id": 22,
				"body": "Trochę nowych wiadomości. Z dziedziny informatyki się dowiedziałem. Z tym Izraelem to pewna wiadomość? To by wiele tłumaczyło o ich najlepszym wywiadzie wojskowym. Skąd mają tak dobre informacje.\n Zapytanie, czym jest najlepiej zastąpić, - google i youtube,  I do tego jakiś komunikator, \"bezpieczny\". Co polecacie zainstalować. Proszę napiszcie. Te wiadomości pomogą się samo - naprawić.",
				"added": 1612119785
			}
		],
		"1612351541_1QEiA6MFKgrXHPFDNC3dDbqY7DhRHQMoCF": [
			{
				"comment_id": 23,
				"body": "Zgadza się, są jeszcze zagraniczne strony. Jeśli znasz jakieś języki obce. Możesz też założyć swoją stronę, i na niej publikować swoje pomysły. Ważne, to to żeby utrzymać przy życiu ten kawałek internetu.",
				"added": 1612355956
			}
		],
		"1613088792_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 24,
				"body": "Test ???, Tak to można chyba nazwać;  tylko na żywym organizmie. Brak Wiedzy, się mści w dwójnasób. Oni z tym się wcale nie kryją...",
				"added": 1613156423
			}
		],
		"1613519322_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 26,
				"body": "Raczej to bym nazwał, spostrzegawczość albo efekt setnej małpy; To o czym pisze @driud. wiedza która przyszła z zewnątrz. Zadziwia tylko jej wiek?",
				"added": 1613561786
			}
		],
		"1614911443_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": [
			{
				"comment_id": 27,
				"body": "Raczej nigdy nie było problemu z otwieraniem? Jeśli już coś było? To dotyczyło seedowania nowego filmu. To dotyczyło nowych użytkowników. Którzy wrzucili nowy film, i wyłączyli za chwilę laptopa. Może nic nie zauważyłem, bo używam Linuxa. To jest chyba usterka tylko w windzie.",
				"added": 1614953172
			}
		],
		"1614897242_181pxua95EmDYcDgDUZ7r7QGr2ti6VKtMa": [
			{
				"comment_id": 28,
				"body": "Jest jeszcze ktoś, kto tego świadomie używa? Chyba tylko małolaty? Ta lista kompletnie mnie zaskoczyła.",
				"added": 1614953640
			}
		],
		"1614797718_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 29,
				"body": "Panowie; pogodzę was, Kasiora jest twoja wtedy tylko,  jeśli ją \"TY\" trzymasz w garści. Jeśli jest ona u kogoś w garści? To nie jest to \"TWOJA\" - kasiora. Nieważne kto to jest? Czy to tak trudno jest zrozumieć?...",
				"added": 1614954051
			},
			{
				"comment_id": 31,
				"body": "Wystarczą ziemniaki, buraki, aby zrobić alkohol. Kiedyś się robiło bimber, ale to śmierdziało. Chcecie się zapić z rozpaczy?",
				"added": 1614982685
			},
			{
				"comment_id": 32,
				"body": "Dlatego ludzie odeszli od handlu wymiennego. I zastąpili go srebrem i złotem, metal rzadki i dlatego cenny. Właściwie jego cechy zdobnicze i brak  korodowania sprawiły jego popularność.\nStał się cenny i zamienny na na inne towary.",
				"added": 1615029409
			},
			{
				"comment_id": 33,
				"body": "Banksterzy, na tym mogą ucierpieć. Raczej ten pomysł im się nie spodoba. Powrót do korzeni. ha, ha, ha.",
				"added": 1615142533
			}
		],
		"1613835910_1GcPQswRskdfDPjH9jihgBWpJFGgLHLaC8": [
			{
				"comment_id": 30,
				"body": "Prowadzenie strony to odpowiedzialna praca, proszę nie zapominać o tym. Zaglądam tutaj od dawna, i nie jedno już widziałem. Założyć stronę jest stosunkowo łatwo, ale nią się opiekować, to już potrzeba chęci i czasu. Ja jestem z doskoku, często w drodze. Więc to nie jest sport dla mnie.",
				"added": 1614954607
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 34,
				"body": "Każdy jest dorosły, takie mam wrażenie. Każdy swój rozum ma; wniosek jest jeden, powinien go używać z rozsądkiem. Driud przedstawia pewne fakty, które są przez uczonych / wysokiej klasy światowej /, udokumentowane. To nie są ludzie z pejsbuka. Ani z przedszkola. Nikt nie musi wierzyć w to co ON pisze? Ale jego opisy mają sens, i się sprawdzają. Można przeczytać, można nie czytać. Najbliższy czas pokaże kto miał rację. Ostrzeżenie zostało przekazane? czy zostanie ono wykorzystane? To najbliższy czas pokaże.",
				"added": 1615656384
			}
		],
		"1616448209_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 35,
				"body": "Mordercy, z nikim się nie liczą. Mam cichą nadzieję, że zapłacą.",
				"added": 1616449846
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 36,
				"body": "*Osoba niepełnosprawna może liczyć na profity, na które nie może liczyć zdrowy.*\n.\nDziękuję za takie profity; Całe życie uzależniony od Big-Farmy. A czy ktoś pomyślał o rodzicach niepełno sprawnego dziecka? Znam osobiście taką rodzinę, dziecko ma już koło trzydziestki, i jest niepełno sprawne. Opiekują się nim rodzice. A co będzie, jak zabraknie rodziców? Dziecko, bo to jest cały czas dziecko, ma taki rozum. Rozum małego dziecka. Co z nim będzie, jak rodzice umrą? Kto wtedy nakarmi, wykąpie, pieluchę zmieni? \nCo było przyczyną takiej sytuacji???  SZCZEPIONKI; brzmi odpowiedź.\nTo nie jest Rząd;  To jest, NIE - RZĄD. Inaczej Prostytucja - Powszechna.",
				"added": 1616703128
			}
		],
		"1616836050_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 37,
				"body": "Ciekawe pytanie postawiłeś, Sam jestem ciekaw jak tam mają się sprawy? Dubaj to enklawa budowana specjalnie dla bogatych , więc pytanie jest jak najbardziej zasadne. Podobne pytanie można zadać dla państwa Szwajcaria? Jest to państwo kreowania \"NWO\". Czy też ich to samo prawo obowiązuje? A może mieszkańcy tych państw to jakaś specjalna odmiana społeczeństwa, ludzkości, inna rasa. Ja niestety nie potrafię odpowiedzieć na te pytanie, jak i na wiele podobnych pytań, które muszą pozostać bez odpowiedzi. Jak ktoś kiedyś powiedział, są równi i równiejsi. Albo inaczej; nie dla psa jest kiełbasa.",
				"added": 1616872351
			},
			{
				"comment_id": 38,
				"body": "To jest jedna mafia, Przedstawiciele byli w Szwajcarji na spotkaniu.Nwo.",
				"added": 1617707222
			}
		],
		"1618281489_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 39,
				"body": "W zasadzie to proste zalecenia, i łatwo je zrealizować. Trzeba spróbować? Potem będziemy dyskutować.",
				"added": 1618422641
			}
		],
		"1618368827_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 40,
				"body": "Ciekawe spostrzeżenia, fachowca? Bo był przecież pilotem. Podobno dobrym pilotem?",
				"added": 1618422784
			}
		],
		"1618366115_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 41,
				"body": "Ale żeś nazbierał materiału? Po tytułach widzę, że będzie ciekawie. Wszystkie języki świata.",
				"added": 1618422974
			}
		],
		"1618726346_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 42,
				"body": "To może zwalić z nóg. Wszyscy są kłamcami, i  okłamują nas.",
				"added": 1618729398
			}
		],
		"1619237581_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 43,
				"body": "Szczepionka która zabija, a nie leczy? Wszystkie państwa biorą w tym udział.",
				"added": 1619248579
			},
			{
				"comment_id": 44,
				"body": "To naprawdę dobra wiadomość dla wszystkich zainteresowanych. Pytanie? jaka będzie reakcja reszty świata?",
				"added": 1619261582
			}
		],
		"1619526269_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 45,
				"body": "Dobre, Służba medyczna przekupiona. A przysięga Hipokratesa???",
				"added": 1619549605
			}
		],
		"1619880888_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": [
			{
				"comment_id": 46,
				"body": "Czy postradali rozum? Żeby postradać rozum? To trzeba go najsampierw posiadać; a wynika z tego, że to jest dalej poza zasięgiem możliwości urzędników z Waszyngtonu. Małe sprostowanie, albo duże; Nikt nikogo nie ostrzelał, ale Rosjanie staranowali usmańską jednostkę, która dopiero co powróciła z kapitalnego remontu. To był prawdziwy powód rezygnacji dowódcy usmańskich. W świecie polityki inaczej wygląda zderzenie, od ostrzelania. Uszkodzona poważnie jednostka popłynęła s powrotem do stoczni remontowej. Problemem jest, że oni się pogubili w tych kłamstwach które sami stworzyli. Jeszcze jedno; Strzelanie oznacza Wojnę, a tego nikt nie chce wziąć na siebie. \nRosjanie, to są Słowianie i stosują stare sprawdzone metody.",
				"added": 1619881828
			}
		],
		"1620662392_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 47,
				"body": "Ciekawy tekst? Tylko trochę przedawniony, trzeba było go wtedy opublikować dla ludzi. \nPolityka zawsze śmierdziała zgnilizną i brudnymi skarpetami.",
				"added": 1620746693
			}
		],
		"1621774948_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 48,
				"body": "Ciekawe? ciekawe? ale to nic nieda. Psy szczekają a pejsate dalej w rogi walą.",
				"added": 1621777211
			}
		],
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": [
			{
				"comment_id": 49,
				"body": "Pomysł jest dobry? I to wszystko, jak to można sprawdzić? NIEMOŻNA.- Chcą złowić ryby?",
				"added": 1623697443
			}
		],
		"1624223308_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 50,
				"body": "Dobre, śmieszne i zarazem smutne. Czy to zrozumieją? Wątpię.",
				"added": 1624493011
			}
		],
		"1627522666_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 51,
				"body": "Co te H.je, Kombinują? Kiedy ludziska się wreszcie obudzą? Co się dzieje ze światem?",
				"added": 1627694945
			}
		],
		"1627505214_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 52,
				"body": "Humor? A co te słowo znaczy? Czy jeszcze ludzie potrafią się śmiać? \nSuper Tekst, jest nadzieja na spotkanie normalnego człowieka.",
				"added": 1627695166
			}
		],
		"1629908509_1XEUKPQw4XsNUf5m58LKvpAh6mqQuSHYT": [
			{
				"comment_id": 53,
				"body": "Przecież to trucizna. Nie szkoda tobie zdrowia?",
				"added": 1630604706
			}
		],
		"1633477933_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 54,
				"body": "Ciekawe, jak zwykle winda dała dupy? Przecież to normalne.",
				"added": 1633484066
			}
		],
		"1633983362_1D7WTU4atd2a5vMGCwZL7FkKFy176Ac5Sb": [
			{
				"comment_id": 55,
				"body": "Ciekawe, na ile prawdziwe? i Potrzebne? Śledzenia raczej chyba trudno się pozbyć.",
				"added": 1634070728
			}
		],
		"1634380149_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 56,
				"body": "Dobre te kawałki. Stary dobry humor.",
				"added": 1634398848
			}
		],
		"1634380633_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 57,
				"body": "Słyszałem, o tym strajku? ale myślałem, że to jest fejk. Wychodzi na to, że to jest prawda.",
				"added": 1634399402
			}
		],
		"1634884167_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 58,
				"body": "Jestem, dzięki za powiadomienie. Nic nie wiedziałem, że coś takiego tutaj mamy.",
				"added": 1634903715
			}
		],
		"1635374346_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"comment_id": 59,
				"body": "Opolczyk, zawsze ma dobre materiały.",
				"added": 1635405511
			}
		]
	},
	"comment_vote": {}
}