{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_14bw6fqidkkwyY7XX6uxPevGvNkEPk3ffk": [
			{
				"comment_id": 1,
				"body": "Что есть безопасное? По своей работе с зайтами, нет отличий от посещения сайтов с JS в интернете. Но в самом коде могут быть уязвимости.",
				"added": 1516892937
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 2,
				"body": "> [zeroida](#comment_1_1PfpLQwP7LePzj3W3dCw4a2HbmgGsv8YfT): Ты реально не понимаешь, или дурака как обычно включил? Китай раздувает любой зайт до которого дотянется, включая почту, хабы 0me, борды и пр. относительно полезные или не очень.\n\nЭтот зайт не раздувает. Ограничивать китайцев тоже можно и нужно.",
				"added": 1517260898
			}
		],
		"13_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_275_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А то 4.3 млрд лет эволюции в твоём случае коту под хвост.\n\nДа не, эволюция устойчива в условиях смерти отдельных особей, да и в общем-то особо не завязана на них.",
				"added": 1517513150
			},
			{
				"comment_id": 4,
				"body": "Вернувшись взад, я бы выбирал что-то из древних профессий, вроде врачей. Нет этих комплексов \"двигателя прогресса\".",
				"added": 1517513304
			}
		],
		"4_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 5,
				"body": "Вот не думаю, раньше верили паршивому фотошопу, ничего нового. Люди быстро схватывают такое.",
				"added": 1517513401
			}
		],
		"3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 6,
				"body": "1. Нельзя называть это прямо e2e, до хорошего e2e оно не дотягивает, но принцип схож. GPG не нужен, тут есть своя криптография, ECDSA вроде.\n4. Да, хранит.\n5. Да, работает.\n6. Равно скорости сихронизации сайта. Скорость доставки - не очень верно в этих условиях говорить.\n\nВообще, оно работает скорее как сервис публикации шифрованных заметок. А получатель сам ищет среди всех сообщений адресованные ему.",
				"added": 1517514097
			},
			{
				"comment_id": 7,
				"body": "> [promusik](#comment_10_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Да это жесть! Мне кажется в ZeroMail это прямо слабое звено. \n\nЭто скорее Proof-of-Concept, не более.",
				"added": 1517514762
			}
		]
	},
	"comment_vote": {}
}