{
	"next_topic_id": 3,
	"topic": [],
	"topic_vote": {
		"1565218244_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1565289153_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"1565734523_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1566354194_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": 1,
		"1567109265_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": 1,
		"1567289433_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1567665977_19qgLZzDDt99bJW6GwBSXMHfMBo9kkLzGr": 1,
		"1567917491_13PtWrCrmBfGsKwJRLHG712sxPm14zXP51": 1,
		"1567976103_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": 1,
		"1570194419_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570388808_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1570831985_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570851286_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1570906788_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1571110186_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1571260392_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1571275597_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": 1,
		"1571440312_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1571820482_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1572001289_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1571905302_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"1572051069_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1574799137_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1575059165_1KmgiKWNNV8ACroT3aQzf3JA2E3JtXaQRX": 1,
		"1575485461_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575688284_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": 1,
		"1575935042_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1576036634_1JxAgjsza2uoah9BWToPpA2tAUFbtbLxAb": 1,
		"1576862108_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"1577321500_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577824358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1577893728_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": 1,
		"1578131377_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1578135775_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1592089664_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": 1,
		"1599500033_1Atih4XYueM1nvrAemCaB5fnXqfRsUM65d": 1,
		"1601654430_1HtMCxNJ6vrZn5ckfLtbUYzTHgTKBDSvbx": 1,
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": 1,
		"1606242897_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1607429722_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1
	},
	"next_comment_id": 114,
	"comment": {
		"1566354194_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 1,
				"body": "Jews are mad that Jesus wanted people to worship god instead of worshiping Jews as a race. Oy Vey SHUT IT DOWN.",
				"added": 1566357504
			},
			{
				"comment_id": 2,
				"body": "> [dkeyzjkeys](#comment_42_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): They only own the banks that own your government, must be dumb.  You should kill jews tbh, they are terrorists under guise of banking.\n\nThey are terrorists in a lot more ways that just the banks but thats a good start.",
				"added": 1566357553
			}
		],
		"1567289433_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 3,
				"body": "Never let them take that smile.",
				"added": 1567294186
			}
		],
		"1567665977_19qgLZzDDt99bJW6GwBSXMHfMBo9kkLzGr": [
			{
				"comment_id": 4,
				"body": "bump",
				"added": 1567666336
			},
			{
				"comment_id": 5,
				"body": "baaaamp",
				"added": 1567716645
			}
		],
		"1567971140_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 6,
				"body": "I wonder which news outlet this goy works for?",
				"added": 1567972974
			},
			{
				"comment_id": 7,
				"body": "i guess we will find out when the screen cap gets published.",
				"added": 1567973219
			}
		],
		"1567976103_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 8,
				"body": "your link works for me.",
				"added": 1567992216
			}
		],
		"1568002955_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 9,
				"body": "Hi Im Joe Rogan and if you havent done DMT you should because MAN IM SO SMART CUZ IVE DONE DMT. DMT equals world peace everyone!  Do drugs it makes you smart like ME JOE ROGAN. CUZ IM SMART AND INTELLECTUAL because of all the DMT and PSYCHEDELICS.",
				"added": 1568059171
			},
			{
				"comment_id": 11,
				"body": "> [kidcourageous](#comment_143_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): why you so salty tho?\n\nBecause he sounds like a pompous douche. Just the way he talks bruh.",
				"added": 1568331140
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 12,
				"body": "Imagine my shock.",
				"added": 1568406817
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 13,
				"body": "Basically all black people can get SSDI for \"intellectual Disability\". With an average IQ of 75... https://www.webmd.com/parenting/baby/intellectual-disability-mental-retardation#1",
				"added": 1568407102
			},
			{
				"comment_id": 14,
				"body": "> [hardee](#comment_38_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H): Reminder that IQ is a meme way of discerning intelligence and it shouldn't be used as a metric for anything scientific\n Yet they use it to determine SSDI benefits and a lot of other programs.  So whats your fucking point?",
				"added": 1568416044
			},
			{
				"comment_id": 15,
				"body": "Is there a single first world county that was established and is maintained by blacks without any help from others?",
				"added": 1568491709
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 16,
				"body": "I mute people because I can, this is about freedom right? The only people I have muted so far are glowniggers, spammers, and obscene content I dont want to see or get arrested for.",
				"added": 1569983257
			},
			{
				"comment_id": 17,
				"body": "> [fartknocker](#comment_15_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E): LMFAO, WHAT THE FUCK IS A GLOWNIGGER?\n\nglownigger\nA governmental agent (FBI, NSA, CIA, ATF) making bait posts on forums and image boards to entrap individuals or gather intelligence. The purported goal of glowniggers is baiting potential criminals or gather intelligence about a particular online community to reveal their intentions or beliefs.\n\nThe practice of posting as a glownigger is called glowposting.\n\nThe term was coined by paranoid-schizophrenic internet personality and Temple OS programmer Terry Davis in his livestream. \"The CIA niggers glow in the dark, you can see them if you're driving. You just run them over \" - Terry Davis, 2017.\nThe term was popularized around 2018-2019 on 4chan.org (specifically the /pol/ board) and 8chan.",
				"added": 1569983485
			}
		],
		"1570070514_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 18,
				"body": "Glowposting smh.",
				"added": 1570078096
			},
			{
				"comment_id": 19,
				"body": "> [reichardnixon](#comment_18_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Glowposting smh.\n Anyways, how come we cant mute him from the OP?",
				"added": 1570078185
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 20,
				"body": "I havent looked into how easy it is to make website on zeronet but if there was a weebly type version of website creation that would be amazing. Also, making sites like FB and Youtube on here but without the censorship.",
				"added": 1570242117
			},
			{
				"comment_id": 21,
				"body": "> [noquat](#comment_13_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh): Sites like youtube exist already on ZN, they just aren't popular.\n\nWell we need to find one that has good features and without censorship and promote that on clearnet and on here. People wont leave their island unless they think the grass is greener on the other side. \n\nPersonally I am new to all this zeronet stuff, I didnt even know about it until 8chan went down. I have no idea how to find new sites on zero net unless some one posts a link. \n\nMainly I would like to see a decentralized no censorship FB on here. That would bring a lot of people.",
				"added": 1570247213
			},
			{
				"comment_id": 22,
				"body": "> [noquat](#comment_15_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh): Here is the official location for zites.http://127.0.0.10:43110/Sites.ZeroNetwork.bit/ [...]\n\nI had to change the IP in your links for them to work. I dont understand why. http://127.0.0.1 works for me if I put that in instead of the IP you provided. \n\nThanks for the links BTW.",
				"added": 1570300920
			},
			{
				"comment_id": 23,
				"body": "> [filips](#comment_239_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Because http://127.0.0.1:43110/ is correct URL. ZeroNet is serving website on localhost IP, so you have to use it. @noquat probably configured ZeroNet to use different IP or it was simply a typo.\n\nThanks.  I am really new to this. Appreciate the info.",
				"added": 1570304668
			},
			{
				"comment_id": 24,
				"body": "> [kusoneko](#comment_85_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): You'd need to have a massive amount of HDD space to run that and eventually you'd want other people to also host it so it doesn't end up dying if the person running it suddenly goes rip. That means all the other people serving it also need to have a massive amount of space, unless you're willing to rely on one centralized server to do all of it.\n\nI am not a fan of this idea. I think we need to focus more on a FB type site.  No censorship. People are always talking about going to \"VK\" or \"minds\" but we need a decentralized zn version.",
				"added": 1570315482
			},
			{
				"comment_id": 25,
				"body": "> [kusoneko](#comment_86_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): It's not a question of idea, it's kinda how ZeroNet works, either you have everything decentralized in the zite, meaning everyone ends up hosting however much hdd space needed to host every single zite ever, or you have a lightweight website that links to a specific or multiple specific servers that host those zites. That's why implementing a latest top zite content supplier thing wouldn't be very popular. Either it goes against ZeroNet's philosophy or it goes way over what people are willing to share in terms of hardware resources.\n\nI think you missed my point completely. the Social media site could work exactly like the image boards here. Add the content you want and mute the content you dont. Its not that complicated and you still only host the shit you want to see and the groups you want to host.",
				"added": 1570343108
			},
			{
				"comment_id": 26,
				"body": "> [kusoneko](#comment_88_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): True... Right now the only social network we have is ZeroMe tbh. It's a bit of a difficult task to make a social network with lots of features though.\n\nI agree, and I have no idea how to make it happen. Even just something with basic functionality in that direction would be fine. It doesnt have to be feature rich. Just good enough to abandon FB and other clearnet sites that are causing everyone headaches.",
				"added": 1570344470
			},
			{
				"comment_id": 27,
				"body": "At this point if I could get my friends just on zero talk and zero me I think I would be pretty happy.  Just getting normies onboard with it... they get scared...",
				"added": 1570354162
			},
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_435_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You could point out to them that if they don't go to any zites that have pictures, there is no chance that they will unknowingly get CP on their hard drive.  Other than that, what scares them?\n\nAll the darknet fear mongering by the media but mostly aversion to change.",
				"added": 1570386315
			},
			{
				"comment_id": 30,
				"body": "> [xcape2net](#comment_436_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If they don't value their privacy and the privacy of their friends, the only solution is to provide a service on ZeroNet that they can't get anywhere else.  That hasn't happened yet--except in countries that have their internets locked down.  The problem with that is that everything we do here can be copied in a centralized, non-private form and made more glitzy.  Perhaps it's OK that only people who care about freedom and privacy are strongly attracted to ZeroNet.  Besides, I don't mind having a place where I can talk to a \"small\" group of people that I \"know\".  On Reddit, I had no idea who anyone was, because I never talked to the same person twice.\n\nI agree, I think we are getting on the right track with this.",
				"added": 1570390721
			},
			{
				"comment_id": 36,
				"body": "> [kanade](#comment_25_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Zeronet has few users and it should stay that way. Don't bring normies here, they'll shit up the place just like how they did to 8chan/kun and the hacker 4chin. Only bring those who are like us.\n\nThat is why there is a mute button. Stop being a pussy.",
				"added": 1570585085
			},
			{
				"comment_id": 37,
				"body": "> [kanade](#comment_26_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Do you want to be constantly muting people instead of just keeping things the way they are? Thought not. Normies can go make their own decentralized network, if they can make a phone app for it too. There's no need to make this mainstream.\n\nActually I dont mind constantly muting people to have more people on the platform. So fuck you for assuming what I want. Normies by definition cant make their own decentralized network otherwise they wouldnt be normies. There is every reason to make this main stream because it holds more value than the clearnet. All of your points are shit and you need to get out of your fucking bubble and stop being a massive faggot about alt tech.\n\nPS. I think you are a massive faggot and I am muting you so have fun with that while I maintain the experience I prefer. ",
				"added": 1570603966
			},
			{
				"comment_id": 38,
				"body": "> [filips](#comment_249_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Muting each user individually isn't really a perfect solution. However, there are also blocklists for ZeroNet which automatically (if you decide to) block spammy users. [...]\n\nMuting each user individually isn't really a perfect solution, but its better than saying stupid shit like this:\n> [kanade](#comment_26_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Do you want to be constantly muting people instead of just keeping things the way they are? Thought not. Normies can go make their own decentralized network, if they can make a phone app for it too. There's no need to make this mainstream.",
				"added": 1570650372
			},
			{
				"comment_id": 40,
				"body": "your site has zero seeds?",
				"added": 1570908001
			},
			{
				"comment_id": 41,
				"body": "> [blahblah69](#comment_2_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): ya right now its not known, its literally a few days old, im sure over time it will gain a little momentum. plus i cant control the seeding practices of others. some will seed it some wont. that's just the nature of P2P. hopwfully over time users will find value in seeding it.\n\nbut it should have at least you seeding right? I like your idea so I was going to help but it just errors out.",
				"added": 1570908873
			},
			{
				"comment_id": 42,
				"body": "> [blahblah69](#comment_3_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): really thats odd,  i am seeding it myself too, and i can see it on my phone and laptop so at min there should be 3 seeds. what kind of errors if you dont mind me asking??\n\nNo Peers Found\nCONTENT.JSON DOWNLOAD FAILED\nCONTENT.JSON DOWNLOAD FAILED",
				"added": 1570910592
			},
			{
				"comment_id": 43,
				"body": "Its working for me now as well.",
				"added": 1570914822
			},
			{
				"comment_id": 44,
				"body": "> [blahblah69](#comment_6_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): ok great i did fiddle with the port settings on my router maybe that had an effect. hope you find it useful. any sugestions are welcome from everyone\n\nThis might be a good addition to your list\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/",
				"added": 1570916904
			},
			{
				"comment_id": 45,
				"body": "> [onlinemovies](#comment_16_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): OFFLINE OR NOT AVAIBLE DEAD CONTENTS: Users are crying that the clearnet everything is available but censored. And in 0Net too much thing are offline or not available. [...]\n\n HI I AM HERE TO COMPLAIN AND OFFER NO SOLUTIONS. THANKS. #Muted",
				"added": 1570989636
			}
		],
		"1570388808_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": [
			{
				"comment_id": 29,
				"body": "Apparently there is another folder \"src\" that has some of the full size images but I am not sure if that is because i click the seed button or what.",
				"added": 1570390145
			},
			{
				"comment_id": 31,
				"body": "> [duende](#comment_117_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, maggot.\n\nI figured it out on my own, thanks for the friendly advice nigger.",
				"added": 1570423272
			}
		],
		"1570424918_1E8arVz12goVNFdsniWbQGnGBA4KT2aYZG": [
			{
				"comment_id": 32,
				"body": "Too few seeders?",
				"added": 1570426438
			}
		],
		"1570456755_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 33,
				"body": "comparing them to nazi camps being bad LOLOLOL. Faggot. L2history.",
				"added": 1570477771
			},
			{
				"comment_id": 34,
				"body": "> [k0hlr4bi](#comment_5_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): We do need to control the population. >7 billion is way too much to sustain while keeping Earth in good condition. Earth can support at most 3 billion people. Question is, how to do it\n\nStart at the bottom and work your way up. Africa and South America both have a lot of resources and shit tier civilizations.",
				"added": 1570569259
			},
			{
				"comment_id": 35,
				"body": "> [elinor2](#comment_9_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf): you're right  we need more killing globally\n\nThats why we need to fight gun control globally.",
				"added": 1570569340
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 39,
				"body": "( . Y . ) ??\n((o)) ??",
				"added": 1570781897
			},
			{
				"comment_id": 46,
				"body": "> [przvl](#comment_3_12X6g1LP25pT2XEMNR239xgrUnEktRVb9o): This is what we need ZeroNet for\n\nAtleast none of us will get zucced for our opinions.",
				"added": 1571089448
			}
		],
		"1571160843_1JzkAAtaVNqg2E1NRSbwL8tJ6egxnoxyDM": [
			{
				"comment_id": 47,
				"body": "What?",
				"added": 1571161353
			},
			{
				"comment_id": 48,
				"body": "Seems like he dindu nuffin. Low score at least.",
				"added": 1571169005
			},
			{
				"comment_id": 49,
				"body": "> [whyamihere](#comment_6_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): Not exactly funny.  You are dealing with people's lives and freedom.  We are on the cusp of complete 1984 Communist/Bolshevik takeover.\n\nYeah we are. Its not funny, its pretty sad that his life will be thrown away for this and he did almost nothing compared to St.Tarrant or Dylann. Those carried a lot more meaning than this will.",
				"added": 1571169617
			},
			{
				"comment_id": 50,
				"body": "> [whyamihere](#comment_7_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): What do you mean in your second sentence, \"Those carried a lot more meaning than this will?\"\n\nThe weight of his actions will be less relevant due to the low score. Less impact, less publicity.  I didnt even know about this event until i clicked the link in the thread. Still have not seen links to the manifesto or video. Normally there is a .zip of all the relevant content by now...\n\nThe other attacks were much more successful  in terms of targeting and score. ",
				"added": 1571171123
			},
			{
				"comment_id": 51,
				"body": "Read more here. \nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
				"added": 1571172078
			},
			{
				"comment_id": 52,
				"body": "No, the only thing on zeronet is the reposts of the content that is being purged from the clearnet. TBH its not that cool anyways... nothing your average nigger couldnt find online with a few minutes of time. ",
				"added": 1571183556
			},
			{
				"comment_id": 53,
				"body": "> [whyamihere](#comment_10_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): That makes sense about the manifesto information.\n\nThe only 'cool' part about the manifesto are the included bonus content. The crap he spews is low energy at best. For something so 'planned out' it sure reads rushed and not planned at all. Very disappointing considering what he had \"made himself\" for this attack. Its total crap, if some one took the time to make all that gear they should be able carry out his own plan without looking sounding like a tard. Ill probably be even more disappointed after I see the video.",
				"added": 1571187268
			}
		],
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 54,
				"body": "> [tnode](#comment_1_1BzjyXdmfFoTuAcb7VkRwxAR1vNah5fWt3): Agreed, Israel2020. Take care of your own people before all others.\n\nFixed that for you buddy. Hows that Zionism working out for you so far? You like those new high gas prices because your kike buddies keep trying to start a war with Iran by attacking the Saudis? MAGA MAGA  lmao fuck off with  that glownigger shit. \n\n> [atlantian](#comment_2_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn): America, is going back to its roots. And those roots destroyed many countries years ago. America has a leader with a spine and big dick under him. Putin and Trump by far best leaders in the 21st century - Nationalist. They understand each other. Liberals and left wing democrats fail to realize - Republicans are willing to go to war and kill others for their political views and to protect their ways of life. The ways of life established by forefathers.\n\nLOLOLOLOLOLOL KOSHER COCK =/= NATIONALISM Putin and Trump are both Zionists. and yes the commies in both parties are willing to murder anyone anyway to get what they want not \"The ways of life established by forefathers\" fuck off with your BIG BRAIN ANALYSIS. \n\n> [zaron](#comment_21_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): America hasn't won a war in a long time.. do you think it could win a war against itself???\n\nLmao. America has only ever been in one legitimate war and we won. After that Its all shilling for Israel. We all know we would win in a war against the kikes which is why they are scared and amping up the censorship and propaganda.",
				"added": 1571206795
			},
			{
				"comment_id": 55,
				"body": "> [546daf54gdsf56g4](#comment_1_1PGmSveoNhGqd42DQt9emDzpnR4zdjKbnv): reichardnixon Lmao. America has only ever been in one legitimate war and we won.  [...]\n\n lmao. 1776 faggot.  Because you know I support all that degenerate shit you spouted off. You sound like one of those angry skin head faggots. How from my previous post do you assume I am happy about any of the shit you just said? Are you so fucking dense that you cant see we agree on most of the shit you just posted? So why are you attacking me like some fucking kike? Why the fuck are you here you self righteous prick? Are you just here to cry and  troll like a massive faggot? Im not even going to bother responding to the rest of your accusations. Fucking moron starting infighting why? I dont normally mute people but keep acting like a faggot and it wont be my loss. I thought anti kike people would be on the same team but you are over there being such an emotional mess. Keep your shit together bruh remember who you are fighting. This is just pathetic. ",
				"added": 1571214784
			},
			{
				"comment_id": 56,
				"body": "Fuck the boomers!",
				"added": 1571253094
			}
		],
		"1571260392_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 57,
				"body": "> [moor](#comment_286_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): check out this video, you may find it interesting (somehow related).https://www.youtube.com/watch?v=Nvor7hhDKTshttps://invidio.us/watch?v=Nvor7hhDKTs\n\nThanks for the link.\n\nI think the point is to build pressure until some revolution but they want it premature so we cant win. If they give us enough time to get organized they will lose. BLITZ.",
				"added": 1571263160
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 58,
				"body": "Seems relevant https://www.bitchute.com/video/ODY9tf5OSQg9/",
				"added": 1571287909
			},
			{
				"comment_id": 60,
				"body": "> [whitepower](#comment_6_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW): Not enough.\n\nTrue story bruh.",
				"added": 1571299514
			},
			{
				"comment_id": 61,
				"body": "> [wertup](#comment_10_126rNR8K25HUiECkWc11qtLyWNFEbG4sV9): i don't. i hate when whites put niggers where they don't belong. i hate when nigger are employed by whites. i hate when whites fuck niggers. in fact i hate whites!\n\nWelcome to the block list faggot.",
				"added": 1571331511
			},
			{
				"comment_id": 63,
				"body": "> [wizardking](#comment_14_1A2qMS9kj8yHsZzuS621ttaMp8PJqT5YyU): you must really like niggers then, hmm...\n\nAnti white faggots can burn.",
				"added": 1571433536
			},
			{
				"comment_id": 67,
				"body": "> [esoter101](#comment_1_1AgZWGTVyEyp3FYduWpZ5dhB5GhXw9FUaP): DNA is improved. African DNA is superior and dominant to recessive White genetics.  All that colorful shit like blonde hair, blue eyes, red hair, etc etc..are just varying degrees of recessive inferior genetic traits.  A lack of melanin, not a gain of anything.  The only reason whites are losing power is because their aryan alien gods are as inferior as they are.  Even white women know this, hence the reason why they all want them beautiful mixed babies.   [...]\n\nNIce try kike nigger.",
				"added": 1571599006
			},
			{
				"comment_id": 68,
				"body": "> [redlibertyreal](#comment_20_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Ugh yet another garbage, hateful, disgusting post. On ZeroTalk there are 3 little dots to the right of the name of OP on the post. Click them, a menu opens with the option \"Mute This User\". And there you go, ZeroNet got a whole lot better. Don't feed the trolls, mute them! This doesn't censor THEM, it just makes it so their trash doesn't appear on your ZeroNet instance.\n\nNo problem muting faggots like you thanks for the pro tip!",
				"added": 1571599055
			}
		],
		"1571275597_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 59,
				"body": "LOL VPN from GOOGLE LOLOLOLOLOL",
				"added": 1571288032
			},
			{
				"comment_id": 62,
				"body": "> [edgelordofdecent](#comment_171_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): A vpn from google would be worst than no vpn at all.\n\nI know right?  LOL",
				"added": 1571337401
			}
		],
		"1571110186_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 64,
				"body": "> [chergriog](#comment_20_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): what's wrong with the nazi? they were the good guys.\n\nYeah. What he said.",
				"added": 1571435431
			}
		],
		"1571440312_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 66,
				"body": "> [hidoih](#comment_1_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z): $1000 is absolutely nothing. I'd rather have the cheeto troll, because hurts the fee fees of people who hate me.\n\nAt least with the orange zionist we know exactly what we are voting for.  Altho, I must admit it is fun to Yell \"YANG GANG\" at people in red hats LOL.",
				"added": 1571598756
			}
		],
		"1571549623_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 69,
				"body": "Im so proud of you guys, all these sexual fetishes and not one bizarre pronoun preference being forced on anyone else!",
				"added": 1571599201
			}
		],
		"1571879273_173u2WzfNziqEAAY9WqPzAZSqxfHQqs1FC": [
			{
				"comment_id": 70,
				"body": "lol?",
				"added": 1571882477
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 71,
				"body": "I miss the lack of censorship. Its made everyone pissy and salty. The whole clearnet is just so prone to abusive censorship I feel disengaged. The internet used to be the Wild West, now its just Kiketown, USA.",
				"added": 1572745270
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 72,
				"body": "I was under the impression it was \"Nut-in\" November, so my wife and I have been trying for baby number 2 everyday.",
				"added": 1572914959
			}
		],
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": [
			{
				"comment_id": 73,
				"body": "How many shekels ?",
				"added": 1573631149
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 74,
				"body": "So people like you can ask stupid questions like that without being censored. Also, fuck niggers. See im not banned either. Isnt this great?",
				"added": 1574358285
			},
			{
				"comment_id": 75,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1205_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you are not at the level nor of this thread, nor of this community but you already know that\n\nGo Fuck Yourself. Is that on the level enough? Still not banned. But IM NOT BIG BRAINED ENOUGH. Well you are blocked have a great day. Mr.CantEvenHaveaCoolScreenName",
				"added": 1574383589
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 76,
				"body": "If ItS lEGaL tHEn ItS oK.",
				"added": 1574446485
			},
			{
				"comment_id": 77,
				"body": "decriminalize not legalize.",
				"added": 1574480083
			}
		],
		"1574799137_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 78,
				"body": "Would  start a community. No merchants.",
				"added": 1574817781
			}
		],
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 79,
				"body": "The amount of people screaming NIGGER. Seems to have gone back down. I mean just because you can spam obscene shit at people because of a lack of censorship doesnt mean you should. Its just common courtesy.",
				"added": 1575660140
			}
		],
		"1575691820_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 80,
				"body": "ITS PROBABLY RACISM",
				"added": 1575697126
			}
		],
		"1575837926_1QB4xaPWPG3auDPmgCcPHbJeXYdC2K8EX": [
			{
				"comment_id": 81,
				"body": "You are doing it wrong.",
				"added": 1575839535
			}
		],
		"1575935042_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 82,
				"body": "is their onion site down? i havent been able to get on it for a few days. uj3wazyk5u4hnvtk.onion",
				"added": 1575944362
			},
			{
				"comment_id": 83,
				"body": "> [fractalzoomer](#comment_36_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj):  http://piratebayztemzmv.onion\n\nThanks.",
				"added": 1575948928
			}
		],
		"1575993432_1M4LT62QBucjbhFSk1hEcoY5gWp2WF7P6M": [
			{
				"comment_id": 84,
				"body": "Martyr?",
				"added": 1576007261
			}
		],
		"1576036634_1JxAgjsza2uoah9BWToPpA2tAUFbtbLxAb": [
			{
				"comment_id": 85,
				"body": "> [aureolos][klinik]: hello!",
				"added": 1576039870
			}
		],
		"1576012034_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 86,
				"body": "It hasnt been that exciting so far... and its a serious resource hog. I wouldnt recommend wasting time on this.",
				"added": 1576051090
			}
		],
		"1576287725_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 87,
				"body": "This is not the place for your spam. While I appreciate and admire your efforts... I think you will annoy people carrying on like this. Consider just one thought out post next time instead of a series of headlines.",
				"added": 1576291347
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 88,
				"body": "well this was an easy mute. Bye!",
				"added": 1576705439
			}
		],
		"1576862108_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 89,
				"body": "Tell us more...",
				"added": 1576922058
			}
		],
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 90,
				"body": "Your link does not work for me.",
				"added": 1577914413
			}
		],
		"1578044704_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 91,
				"body": "lmfao. G8 B8",
				"added": 1578047437
			}
		],
		"1585314197_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 92,
				"body": "Porn is propaganda to keep you distracted and demoralize you. Porn is poison to the nuclear family. This is all part of the agenda. Free porn right now is literally the same thing the Jews did when they invaded Palestine and flooded all of their TV stations with porn. Google it.",
				"added": 1585335700
			}
		],
		"1585842700_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 94,
				"body": "> [kaaza](#comment_6_15cApprVFcr1skAkWssq5aAXKa7pDwJJve): The main victims of #COVID-19 are patients of schizophrenia that can't have access to their medication.Press F to send prayers and thoughts.\n\nF",
				"added": 1586052724
			}
		],
		"1587415105_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT": [
			{
				"comment_id": 95,
				"body": "> [commandantecero](#comment_2_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Yeah if it was so bad why did she publicize it?  She probably enjoyed it and was just mad she didn't think of it first. She should be dealt with.\n\n100% That nigger deserves something. How is it right that she can sit there and laugh after trying to ruin some one elses life? These kids did some satire boo fucking who cares!! What ever happened to \"sticks and stones may break my bones but words will never hurt me\"??",
				"added": 1587545126
			}
		],
		"1587567790_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 96,
				"body": "nice",
				"added": 1587631359
			}
		],
		"1592140848_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 97,
				"body": "Well its not a race issue like they are pushing thats for certain. The only reform we need is no dual citizen  ship for politicians or anyone in public office or their immediate families. No more sending our cops to Israel for training. No more outsourcing security digital or otherwise to Israel.",
				"added": 1592161736
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 98,
				"body": "Why is anyone helping this glow nigger?",
				"added": 1592427451
			}
		],
		"1598242145_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 99,
				"body": "You are a fucking moron. Q didnt do anything. Q is a jew hoax. Now fuck off with the rest of your stupid opinions.",
				"added": 1598294361
			}
		],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 100,
				"body": "All you have to do is tell the Jews \"No.\" Then encourage everyone else to do the same.",
				"added": 1602305156
			}
		],
		"1603633320_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [],
		"1603637541_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 102,
				"body": "fuck off kike",
				"added": 1603649426
			},
			{
				"comment_id": 103,
				"body": "> [bigbadbob](#comment_1171_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Why not just post it?  You trying to sell it or somehow scam people?\n\nits either a troll, a kike, or a glownigger. Probably a combination of some sort.",
				"added": 1603650045
			}
		],
		"1604952415_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 104,
				"body": "veracrypt",
				"added": 1604964853
			}
		],
		"1606242897_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 105,
				"body": "lol @ infowars \nlol @ infowars not being gatekeepers.\n\nKeep going you are all most there!",
				"added": 1606244659
			},
			{
				"comment_id": 106,
				"body": "> [freemankind](#comment_53_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): lol @ you for providing no information and just shit posting\n\nlol@Alex Jones is Not a Shill. www.knowmorejews.com",
				"added": 1606266451
			}
		],
		"1607500928_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 107,
				"body": "Stop projecting.",
				"added": 1607536004
			},
			{
				"comment_id": 108,
				"body": "At least on zeronet its real people looking rather than bots.",
				"added": 1607537726
			}
		],
		"1607768344_1GGTrtSNfhkDqJzFw4CaQKDRNSg73QSkGB": [
			{
				"comment_id": 109,
				"body": "Q is fake and gay",
				"added": 1607927853
			}
		],
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 110,
				"body": "HONK HONK",
				"added": 1613511336
			},
			{
				"comment_id": 111,
				"body": "> [aim64c](#comment_96_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): The question is \"what do we organize to?\"  Most people are thinking, not completely incorrectly, of war in terms of armed conflict.  However, armed conflict is what occurs as a consequence of the achievement of objectives by other groups.  While you may be able to get some radicals together to attack a government building or something - this in and of itself has little overall purpose or motion behind it.  A civil war starts when economies begin to delaminate from each other.For example, I am currently paid in dollars at my place of employ.  While I have some ideas of self-employment and business on the side - none of it can completely replace my income - and even if it could - I would generally be trying to take alternate forms of payment, such as silver or some form of crypto... which isn't necessarily easy to translate into bill payments or grocery shopping, just yet.This is the challenge that needs to get organized and orchestrated - business and business investment outside of the current progressive mafia in HR and board rooms.  The reason people comply is because they are unable to use alternate means to resist/oppose - their existence is tied to the mechanisms of the system and 'unplugging' them is not as simple as getting them to be aware of the fact there is a system and it is ruling them.  They get it.  What are they supposed to do about it when wrongthink gets fired or otherwise harassed? [...]\n\nBitpay, Cashapp, coinbase? And a bunch of other companies allow you to transfer crypto to these services and sell it to load $$ onto your essentially pre-paid debit card that also has a routing and account numbers for ACH payments. So accepting crypto and spending it is very easy to do already. You can even spread it out among different services to stay under certain limits.",
				"added": 1613527797
			}
		],
		"1613690812_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 112,
				"body": "lastpass works great for me, i like its features.",
				"added": 1613729652
			},
			{
				"comment_id": 113,
				"body": "> [papull](#comment_33_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): Lastpass has now made their free plan extremely restrictive. I'd suggest using Bitwarden.\n\nI agree lastpast has lost my respect with their new changes and limits on free accounts. I just finished migrating to bitwarden and it was easy and I already love its UI better than lastpass.  Thanks for the excellent recommendation.",
				"added": 1613760409
			}
		]
	},
	"comment_vote": {
		"16_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"88_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"87_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"818_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"42_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": 1,
		"15_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ": 1,
		"295_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"4_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": 1,
		"5_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"624_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"9_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"119_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"5_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"7_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"6_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"134_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"6_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE": 1,
		"120_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"13_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"2_16QCqj5gquHrmpQqAfMRPt7BxqGDELvZ7g": 1,
		"64_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"12_12fWKDf6FpQhpQua3g1UkA1z6AxHSF1d2p": 1,
		"184_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"15_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"225_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"15_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1_1MKHBc72uGEBSuHxagbgTWGmverPtzD1tH": 1,
		"19_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"15_1Hywym67BRyWThexTcfYNEPVMCkXFP4CwN": 1,
		"42_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"35_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"1090_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1066_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"17_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"15_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"16_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"16_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"10_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"264_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"132_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"87_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"83_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"13_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"21_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"38_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"15_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"266_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"23_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"27_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"436_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"31_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"3_126rNR8K25HUiECkWc11qtLyWNFEbG4sV9": 1,
		"5_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"37_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"249_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"39_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"4_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1162_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"3_12X6g1LP25pT2XEMNR239xgrUnEktRVb9o": 1,
		"17_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": 1,
		"2_1JzkAAtaVNqg2E1NRSbwL8tJ6egxnoxyDM": 1,
		"168_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"169_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"5_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY": 1,
		"7_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY": 1,
		"1113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"54_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"286_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1124_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": 1,
		"4_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": 1,
		"171_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"20_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": 1,
		"64_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"16_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": 1,
		"19_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"43_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"175_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"176_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"221_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"69_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"96_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"36_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"940_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"71_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"794_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1PUCGkKu8TnLxyJuwKGwQXJYmiS5z2mk5o": 1,
		"531_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"81_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"72_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1119_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1204_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"83_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"76_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"2_1PJ2wj4wqyyssFUciArR1sHXp2nfPfscFL": 1,
		"5_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"185_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"14_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1_1D6Uyi9qWnuoTByrjLFGqMCsk48XK41S6L": 1,
		"77_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"4_1D6Uyi9qWnuoTByrjLFGqMCsk48XK41S6L": 1,
		"9_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"51_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"117_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"36_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"7_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F": 1,
		"85_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"120_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"60_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"7_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": 1,
		"71_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"21_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"24_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"167_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1536_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"70_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"365_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"56_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"18_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": 1,
		"99_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"1_14iinnXycxzcTZ8rFfP45cvZp9d7AkLdUx": 1,
		"31_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"20_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"2_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"24_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT": 1,
		"28_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"58_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"57_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"74_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"17_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"37_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": 1,
		"3_1HjJqWY2ECyyUE1F2sJSuXMRmU39uMNt6s": 1,
		"70_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"30_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"39_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": 1,
		"112_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"5_1Mk11Va4hvFzWgfAhvyRJR4m6buvWENcBZ": 1,
		"32_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"5_1abBjBW8axFAtcZN11jv527Wi2noBZurv": 1,
		"1_1abBjBW8axFAtcZN11jv527Wi2noBZurv": 1,
		"1_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"140_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"3_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"38_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"28_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"1171_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"5_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"1_1KnGxS2ij8nfG2qxbrQ6Xz91nBU7XGCYri": 1,
		"43_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"546_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1200_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"19_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"6_1N2VV3mbu9KLbSxTpedj9JvaQ51v9vNEN3": 1,
		"32_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"48_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"55_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"51_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"498_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"52_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"80_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"61_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"110_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"33_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1
	}
}