{
	"posts": [
		{
			"id": "38b7a047-5fdb-4217-8a3f-3d7e4a0f2103",
			"directory": "users/1AfyMS7NiW3iUdXHCzCFW5Eq5USqGPC2jQ",
			"uri": "CP",
			"subject": "A CP story",
			"body": "Patty took a deep breath and, finally, met the counselor's eyes. \"That's about right,\" she said. \"You know, maybe it's not really so awful to let Walter keep fucking you,\" Margaret suggested. \"After all, you're both horny, and he's old enough to --\" \"No!\" Patty stopped her with a brisk wave of her hand. \"Please, don't even suggest that. It's disgusting. It has to end right now. I simply can't allow Walter access to my body any longer.\" \"Then why do you let him fuck you at all, Patty?\" Margaret paused, letting the question sink in. \"Is it because you're so horny?\" \"I...I guess.\" \"Have you always been so horny, or has it only been since your divorce?\" \"Always, I guess.\" \"I see.\" Margaret hesitated again. \"Patty I'm going to ask you some very personal questions now. How often do you think about fucking and sucking in the course of a given day?\" \"A great deal.\" \"Does your cunt usually respond to these thoughts by becoming moist and swollen?\" \"Yes.\" \"Was you cunt moist and swollen when you first allowed your son to fuck you?\" \"Yes.\" \"The questions I'm asking now, are they making your pussy feel wet and hot?\" Patty flushed with embarrassment. \"I guess.\" \"I think it would be good if I took a close look at your cunt, Patty.\" Margaret held up her hand, as if to stem off a possible objection. \"Don't worry. I have a degree in physical therapy,\" she lied. \"I'm just going to inspect it, Patty. All you have to do is pull down your pants and let me have a look.\" Patty thought about this for a moment, but by then Margaret's stream of sex-oriented questions had made her pussy so itchy and horny that she was too distracted to object. She rose to her feet, kicking off her shoes and pulling her jeans off. Now all she had on were her panties. Patty sat back down on the couch, pulling the cotton bikini panties off of her rounded little ass, exposing her hairy pussy mound to the therapist. \"You have a great deal of pussy hair,\" Margaret observed.\nporno mofos anne ve oglu porno mom sex 3gp video download lolita porno kid fotos porno festival video porno v online smotret besplatno camera hidden porn video\npure mature porn vk\nmy retro porno tube french latin pussy sex teen porno film online russkoe\nnew porno pic\nfetish xxx porn\nfree porn sites best porno sybian bloodrayne 2 porno black school girl porn movies free simpsons comic porn wtf porno videos seventeen porno video online\nporno casting fake\nporno new mat i sin porno mother and daughter porn rate homemade porn woods porn james porn by mens to mens 3d porn hentai sonic porno rouge free porn passwords that work college porn hotel\nstrip porno video russkoe porno mami i sin porno rashen mom older men in porn\nporno in aeroport\nporno brater\nfree porn videos uniforms melisa a porno video porno films lesbians online videos porno teens porno filmy smotret\nevi porno\ndog teen porn\nlittle girls loli porn foto porno jeans mfx piss porno porn 3d pics vids zoo scat porn unusual sex video porno anal for iphone\nkaban porno\nreal porn films\n5up porno\nporno film the ultimate fantasy\nporno onlain doma\nreal children porno comic porn gay\nanatomy porn american porn cam sexy heavy porn animals farm porno asian children porno\nporno italiya disney porn pics\nporn foto in hd\nmults porno online free mobile shemale porn porno online benz nighty america porn porno gratis en video polnometrajnie porno filmi so smislom\neating pussy real porn\nfunny porn cartoon pictures sex video na kuxne socks porno pictures spantaneeus xtasty porno amateur italian porn free dp porn clips porno foto zrelyh\nsex video salma hayek\nincest ruski porno mama\ngot pregnant porn polniy porno film big girl sex school free porno mom mobile russian porno skritaya kamera 720 hd porn tv blowjob porn forums arab teen porn pics porn crazy moms big women of porn ddf porn torrent teen porn sex movie\nporno final\nporno bisexual russian vk dr porn porno po italyanski\nvictoria blaze hd porn\ndorm girl porno porno sait hd 720 animal porno zoofil free sex porn videos free porn video drunk julia kova porno nude porn movies free teens porn show\nhd porn student\n\n`She does, which means if we do start fucking our Kids it'll be an absolute Fuck Fest.' `HEE, HEE! Yea, it will, and I can't wait. So what else happened with Rob when you were talking to him?' `Well after he'd told me he was Bi, and obviously because of the Dope and booze, and with me being a horny cunt anyway, plus he was only wearing a pair of shorts and is tanned and hairless like me, and he looked so sexy, I started looking at him as a potential Lover instead of my Son, and then realised I was getting a boner on the strength of fucking him.' `Oh Wow! And how did it make you feel? Guilt wise, I mean? You see that's the best thing about it for me, Mike, the fact I don't feel at all guilty about fantasising about fucking my Kids, even if it is against the Law.' `And who gives a fuck about that? I mean come on, Rach this is a society that only legalised Homosexuality fifty years ago.",
			"time": 1576666994206,
			"files": "[{\"name\":\"11118.jpg\",\"thumb\":\"207c4d966b0cd9920ec03f5986bc79e19226a932-thumb.jpg\",\"size\":13045,\"type\":\"image/jpeg\",\"original\":\"207c4d966b0cd9920ec03f5986bc79e19226a932.jpg\",\"directory\":\"13KYifCo93L2rptejRHcT7oM4qXpqL5u5G\",\"spoiler\":false}]"
		},
		{
			"id": "44477563-56c0-4082-bfcd-84ac5fe790db",
			"directory": "users/1AfyMS7NiW3iUdXHCzCFW5Eq5USqGPC2jQ",
			"uri": "CP",
			"thread": "38b7a047-5fdb-4217-8a3f-3d7e4a0f2103",
			"subject": "next",
			"body": "which is pretty disgusting when you think about it, so who the fuck are they to judge if Incest is right or wrong? As long as it's between consenting Adults what's the big fucking deal? And no, Rach, I don't feel at all guilty either, and you're definitely the Woman of my dreams.' `HEE, HEE! Thanks, Lover, you're not so bad yourself. So what about Kirsty? When did you first start thinking about sticking your massive fucking cock inside your own Daughter?' `As soon as I started thinking about fucking Rob, but it was only when she got home from Uni when I really began lusting after her, because not only did I know, mainly from listening to one or two phone calls to her Friends when she'd left her bedroom door open, that she was having as much sex as her Brother, but that was also when the flirting and teasing started and when she decided to start walking around the House in fuck all, the combination of which drove me fucking nuts. And then there'd be the dildos left on her bed or in the bathroom, with me trying to tell her to be more discreet while she's giggling and saying she can't help it if she's horny all the time, and teasing me I should understand because I must have been the same at that age. And that was on top of the Lads she'd bring home to fuck, which I was fine with, but obviously because I knew she was getting fucked senseless, and I'd sometimes hear her cumming, it drove me fucking crazy, so much so whenever I knew she was bringing someone home to fuck for the night, before I met you, I started visiting this high class Brothel a work colleague told me about, just so I wouldn't go insane.' `Oh, Mike! So you've obviously never thought of doing anything about it until now, then?' `No, Rach, I haven't, even though I knew she might be into it, but as soon as I met you, and as I said earlier, realised you were as fucked up as I am, I knew you'd be into fucking your Kids, and I'm so fucking happy you are, I can't tell you.' `Oh, don't worry, Mike, your big Monster is telling me all I need to know, Lover, trust me. And just going back to Kirsty, and how long you've been fantasising about fucking her for, and her maybe even wanting to fuck you, weren't you ever tempted to make a move?' `God yea, especially when it's just us two in the House and she's been in her room wanking, and we're sitting in the kitchen drinking coffee and smoking ciggies, (another fetish), and she's wearing this really short, black silk robe, which is untied a bit too much, and every time she moves I'm getting more than a glimpse of her tits, and my cock's getting harder by the second. Then when I can't take anymore I'll tell her I'm going upstairs for a shower, which means a kiss on the cheek and a big hug from Kirsty, and me spending the next half an hour having two power wanks and thinking of fucking my Daughter in every way you can imagine.' 'What the fuck is a Power Wank?' 'The same as when I fuck you again straight after I've cum when I'm really horny. They're fucking great, but not as good as talking about fucking our Kids. So what do you think we should do? Only from what I've read it's best to let things develop naturally, so I think we should wait until just before you move in, then I'll tell Kirsty and Rob that as long as they're discreet we don't have a problem with them fucking Jodi or Paul, and you'll tell your two the same, then we'll just see what happens. And I also think we should wait until they're off for half term before you move in, because again, from what I've been told about it, if it all goes how we hope and we do start fucking them, we won't get out of bed.' 'MMMMMMMMMM, sounds good to me, Mike, and I've just cum again. So what else have you been reading about Incest, you fucking Dark Horse.' 'Ha, Ha, Ha! Me? Never! As for what I've read, Rach, fucking loads to be fair, and the first thing I noticed was how rife it is, and I've also been talking to this couple I met Online for the past few weeks, Jenny and Dale, who like us are both Bisexual, divorced with Teenage Kids, five in total, three Girls, two Lads, all as fit as ours, and they were fucking their Kids before they even met. And, they live less than an hour's drive from here, and when I told them I'd met you and thought you might be into Incest, they said if you were we could go and visit them for the weekend to get an idea what kind of lifestyle we've got to look forward to once we start fucking our Kids.' 'Really? Wow! OK! Why the fuck not? Fucking Hell, Mike, you really are into this, aren't you?' 'I am, Rach, more than you know. Right, that's enough talking for now, Slut, so why don't you get on your hands and knees, stick your fantastic arse in the air and let me fuck you properly, and we'll talk more about fucking our Kids in the morning? Now get fucking to it.' So I did, and that was it, in just under an hour the Incestuous Ice had been well and truly broken, and now it had, well, it was obvious what was going to happen, it was going to turn",
			"time": 1576667039406,
			"files": "[]"
		},
		{
			"id": "861ea383-73fd-49b1-bead-1020d8102a0b",
			"directory": "users/1AfyMS7NiW3iUdXHCzCFW5Eq5USqGPC2jQ",
			"uri": "CP",
			"thread": "38b7a047-5fdb-4217-8a3f-3d7e4a0f2103",
			"time": 1576667079110,
			"files": "[{\"name\":\"2_547a33bf7efe380612403b53062a2049.jpg\",\"thumb\":\"09311cfbc1ef6a265a3f950d1ea976e2a80059e2-thumb.jpg\",\"size\":52180,\"type\":\"image/jpeg\",\"original\":\"09311cfbc1ef6a265a3f950d1ea976e2a80059e2.jpg\",\"directory\":\"13KYifCo93L2rptejRHcT7oM4qXpqL5u5G\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}