{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1580020287,
			"title": "SBC",
			"body": "Need opinions.  I'm looking for an SBC board with more than 2 or 4 GB of RAM. Is there such a thing?",
			"added": 1580020286
		},
		{
			"topic_id": 1580020434,
			"title": "RetroShare",
			"body": "What's the thoughts/opinions on RetroShare?\n\nhttps://retroshare.cc/",
			"added": 1580020432
		},
		{
			"topic_id": 1580020845,
			"title": "Hubs",
			"body": "Can someone please translate \"Please use ZeroMe to browse profiles on this page\" into a use case? I am new to this software and can't figure this out. I have no idea what a hub is, whether or not hibs can communicate, or how to switch between them.",
			"added": 1580020842
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1579762565_17U5GzDuhL9qeWAyDZLNB1tguX8xX1hXUe": [
			{
				"comment_id": 1,
				"body": "Comrade?",
				"added": 1579897278
			}
		],
		"1579598887_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 2,
				"body": "Assange, Snowden, and Manning should have their charges commuted, receive Nobel prizes and both protection and citizenship in some country that protects and respects human rights.",
				"added": 1579897618
			}
		],
		"1579726611_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Let the dems eat themselves. They have been nothing more that \"Republican lite\" for decades.",
				"added": 1579897695
			}
		],
		"1579524634_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 4,
				"body": "Just don't even care. I dont care about Israel. I dont care about Palestine. I just don't care even the entire section of the world drops off into the sea. I think that shelling out tens of billions of dollars in tax payer monies and listening to preachers talk about how we have to support some piece of dirt from the Bronze age is stupid. We should be taking care of our own rather than demanding our people pay for some turf that they will never see because Jesus says so. This BDS thing is free speech. Last time I looked we had a constitution and a secular government. I'm waiting for some test cases to find the limits of this crap.",
				"added": 1579898081
			}
		],
		"1579733691_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 5,
				"body": "Ppppfffffttttt.... Welcome to the human race. They're all nuts.",
				"added": 1579898193
			},
			{
				"comment_id": 6,
				"body": "I'm not telling. ;)",
				"added": 1580018272
			}
		],
		"1579972649_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 7,
				"body": "\"...petty bourgeois...\" \n\nYou just brought a smile to my face. :)",
				"added": 1580021913
			}
		],
		"1580020434_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 8,
				"body": "I've been looking over RetroShare for a bit, and the thing that has had my attention is the existence of a web service API.  \n\nSo far, I have been able to script up import jobs which allow me to move larger datasets into the forums. \n\nDoes Zeronet have something similar that I may have missed? I'm still new to the platform and am probably asking a lot of dumb questions.\n\nThe nonexistent anonymity part of RetroShare seems to be on par with Zeronet in the sense that unless one uses tor, the IP address is exposed.",
				"added": 1580060200
			}
		],
		"1580020287_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 9,
				"body": "I've > [rannulfr](#comment_16_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Pinebook Pro\n\nNice! I'll check it out! Thank you!",
				"added": 1580060376
			}
		],
		"1580020845_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 10,
				"body": "I really appreciate the information! Thank you! This really does help.  I've added the hubs from the links provided and they look like they have updated themselves and have bells by their names. When I click on the names though, it shows me that message. I know that this is going to sound silly and I apologize for asking, but how do I see what is stored or on the hib? I mean, how do I see what's there?",
				"added": 1580060781
			}
		],
		"1580551703_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 11,
				"body": "There are hoooomans here?",
				"added": 1580586094
			},
			{
				"comment_id": 12,
				"body": "I am not online. I am never online. I wasn't here. You didn't see anything.",
				"added": 1581953497
			}
		]
	},
	"comment_vote": {}
}