{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1568325376,
			"title": "Why is the SETI institute looking for intelligent life on other planets?",
			"body": "Shouldn't they try to find intelligent life on earth first?",
			"added": 1568325375
		},
		{
			"topic_id": 1573217911,
			"title": "Central bankers are the world heavyweight champions of theft",
			"body": "The only real thing they are doing is stealing. Either through inflation or by looking in order books and doing the opposite than you - (Shorting when you go long and vice versa)",
			"added": 1573217909
		},
		{
			"topic_id": 1573293451,
			"title": "[Opinion] Using crypto to earn a passive income is better than \"Hodling\" BTC",
			"body": "While the majority of crypto owners simply buy and \"hodl\" ( waiting weeks, months, years, perhaps forever for the price to rise in fiat ) i prefer using cryptocurrency as a tool to generate a passive income by participating in Proof of Stake.",
			"added": 1573293448
		},
		{
			"topic_id": 1576537276,
			"title": "The EUssr is going to enact new laws in January 2020 to destroy crypto startups and its adoption",
			"body": "https://news.bitcoin.com/european-aml-directive-pushes-crypto-startup-bottle-pay-out-of-business/",
			"added": 1576537272
		},
		{
			"topic_id": 1577617777,
			"title": "Greece is planning a new cash-ban-asshole-law in 2020",
			"body": "https://fortune.com/2019/12/16/greece-digital-economy-cashless-fines/\n\nI expect similar laws in other EU countries soon too.",
			"added": 1577617772
		}
	],
	"topic_vote": {
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 1,
				"body": "avoid their toilet paper money system - buy precious metals (especially silver)",
				"added": 1573212876
			}
		],
		"1573293451_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 2,
				"body": "> [clearnet15bad](#comment_13_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): What large currencies support proof of stake? I know ethereum is going to implement it in phase 2, some time in 2020.\n\nTezos, Vechain, Decred...",
				"added": 1573309562
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 3,
				"body": "I know plenty of websites on which the cookie consent / privacy policy banner re-appear once in a week even if you gave consent earlier. The GDPR is harassment. It is useless and has made the online experience much worse. \n\nThe EU is a centralized mega surveillance state and i hope it will die a horrible death. \n\nCongratulations Great Britain for Brexit !",
				"added": 1576327661
			}
		],
		"1576643812_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 4,
				"body": "i like but bitcoin and crypto but the whole space has been polluted with institutional crooks at least since late 2017 who are waiting for newbies to enter the market and rip them off, that's why i think that Bitcoin won't even reach its ATH anytime soon perhaps never again",
				"added": 1576669155
			}
		],
		"1576761563_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 5,
				"body": "The government and banker crooks can 'suppress' the price by simply allowing future contracts on them which they already did. Let the losers play roulette against each other so no one will make any profits on the long run except the bank that charges a fee for every order.",
				"added": 1576782311
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 6,
				"body": "Trump is playing a role as the unpredictable crazy man. His policy is to create tensions and relief afterwards causing massive fluctuations on the stock markets.",
				"added": 1578653092
			}
		],
		"1578738929_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "I wouldn't be able to eat it but some would suggest these Vietnamese pancakes: https://www.youtube.com/watch?v=gmjlOuf5rpU",
				"added": 1578742699
			}
		],
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 8,
				"body": "It appears to have an incubation period of up to 4 weeks in which it can spread to other people. Afterwards a person can spread it without having any symptoms.... Well obviously Covid-19 is here to stay.\n\nBut hey governments, continue to quarantine everyone in ships, large buildings and make sure everybody quarantined will get infected.",
				"added": 1582731634
			}
		]
	},
	"comment_vote": {}
}