{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1557610674_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 1,
				"body": "I don't know what BTC will do. I just know it's not even in the ballpark of its actual value. \n\nWhat has fascinated me lately is the so-called Binance hack. That seems to be a ruse for an attempted 51% collusion attack, or probe..ðŸ˜‚\n\nOf course it's not really possible. But it does demonstrate how desperate some are to try and find a viable Bitcoin attack vector.\n\nI wonder what the effect of millions of occasional low hashrate single miners using Bitcoin as a lotto would do to the viability of a 51% collusion attack..ðŸ˜",
				"added": 1557616177
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 2,
				"body": "> [gerula](#comment_1_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1): That's exactly what I'm going to do, I'm going to build a small machine that runs 24/7. I'm thinking about something with passive cooling because I don't want to hear it all night :D\n\nI have a node running on my Android phone, pretty much 24/7. With few problems. You can also run Zeronet through Termux, Userland, Linux Deploy Etc..ðŸ˜€",
				"added": 1565409140
			},
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_24_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): The fear levels in the general population are at unseen heights.  Weaponized social media has people scared of their own shadows.  4chan had many threads saying this place is bad.   Mainstream media is like a psychological assault.What a time to be alive.  Ive never seen so many people scared who have done no wrong.\n\nThe walls are on the verge of coming down. The only thing holding them up is the heavy censorship of free speech on the internet. All to keep you divided. To keep you from coming together. To keep you from forming consensus for the your greater good. To keep you from taking power. Instead of the small special interest, that hold the power today..ðŸ˜€",
				"added": 1565409717
			},
			{
				"comment_id": 4,
				"body": "> [tonkatuff](#comment_1_1FwMNUe7JTWC62TwvSU4cn8T3uc45gokai): Decentralization will collapse a lot of power structures, and not just those attached to the government. They'll resist, they might even hit the kill switch.\nIf you truly understand zeronet, then you'll know that there is no kill switch",
				"added": 1565410099
			},
			{
				"comment_id": 5,
				"body": "> [bustooni](#comment_6_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY): Should have added - love the idea and principle though.  Need to find ways to get this out to a wider audience and lessen the leap to get up and running for most.\n\nRun a proxy..ðŸ˜€",
				"added": 1565410288
			}
		]
	},
	"comment_vote": {
		"2_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"2_1PfGPyKkesp2sF6tmwj19A9Uk9aSgeBnLu": 1,
		"11_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1": 1,
		"24_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"2_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"5_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY": 1,
		"6_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY": 1
	}
}