{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1569840447,
			"title": "Dear Cyberpunk enthusiasts",
			"body": "Is this what you wanted? A world of cancel culture, gender accelerationism, gender xenomorphing, prostitution, underground places on the internet to talk freely, degeneracy and a job market full of programmers? \nWell you have it. Are you happy with it?",
			"added": 1569840446
		},
		{
			"topic_id": 1570059860,
			"title": "The consciousness of humanity is merging",
			"body": "Have you ever felt more connected to people like you than before? Maybe noticed that people gather themselves in collectives, groups etc far more than before?\nThe collective consciousness is merging, and this needs to stop. Because it will create a further divide within people on a social level as [we] grow closer together.",
			"added": 1570059858
		},
		{
			"topic_id": 1570416195,
			"title": "Fuck SystemD",
			"body": "((Non-autistic rant edition))\nWe're so fucking sick of systemd shills and defenders who think that systemd is perfectly fine when in reality it takes up so much space on the system and is the shittiest init system ever to be written; systemd is literally hitler. \n\nNo software should be 1.8 millions lines of code, have its own libraries, then core utilities, targets, its own services, and create so many dependancies that it becomes way too hard to remove. The argument that \"you can just change distros, you have choice!\" doesn't really hold up when you realise they're just becoming complacent and not realizing that choice is being able to install any linux distro, and run any init system you want; choice isn't giving up because you've toiled so long to try and remove it and just switch to another distribution. That's not what Linux should be. But systemd violates this.\n\nSo let's say you finally bite the bullet and try to use systemd. Well good luck because they changed the grammar of the arguments, your old systems no longer exist and everything is now a systemd utility. System Event Log? Nope, that's journalctl now. Mounting filesystems? Nope that's another systemd utility. Want to mess with your services? Well it's no longer sudo service (((service))) start it's now `sudo systemctl start (((service)))\n\nPortability is also another issue; it's impossible to port any kind of config you create, and you'll just have to set it all up again on your next system. OpenRC; a largely hackable and flexible init system handles portability and configuration excellently. And if you configure it correctly you can have you system boot in 10 seconds, which is impressive. No other init system is as bad with this as sysd, and this is a major oversight that should have been seen to during its inception.\nAnd Lennart does deserve a LOT of criticism for his behavior, I don't care what anyone else says. The origin of sysd, which has close ties with Red Hat (That one company which works closely with the US Govt and is a big part of Linux) is equally suspicious, and does make for the perfect conspiracy; a way for Nation states and private companies to control Linux and its users. \n\nAnd on top of all this, while trying to remove your cucked piece of software you end up rebooting, hopefully following all the steps, you removed the bloated piece of shit that is BASH, replace it with ZSH, then reboot and, everything's broken! So. You try to rebuild your broken system, typing in commands for hours on end to try and regain what you once had and then you reboot and then your bootloader got fucked, you can't take out your hardrive to fix your xorg/Wayland files because it won't eve be recognized. And so you finally give up and switch to a systemd-less fork of what you were running before but you realise all the software you wanted to use before is changed and everything feels so different and foreign so you give up on that entire line of distributions altogether and go to Void. \nAND DON'T GET ME STARTED ON VOID.\n\nFuck systemd.",
			"added": 1570416192
		},
		{
			"topic_id": 1580148381,
			"title": "Screen tearing within tor browser",
			"body": "Is it just me or is there a lot more screen tearing within the tor browser? I think it might be an AppArmour related issue for Debian 10, but I have it on windows too..\nIt's by no means debilitating but it fucking annoys me to see.",
			"added": 1580148377
		},
		{
			"topic_id": 1582356450,
			"title": "Dissapearances in Virginia",
			"body": "I was talking to a guy recently who ended up telling me of his research into multiple disappearances from around the US, and after compiling his research (which I need to figure out how to show the image for) he found that Virginia has a 5 sigma difference in the number of cases of dissapearances in Virginia compared to any other state. \nMy initial thought was that it has something to do with the disappearances on Route 29, and after that it was to do with local gangs due to the proximity to Washington, which is a shithole full of drugs, so it might've been foul play. Aside from this, I'm completely stunted, and any information anyone might have is appreciated.",
			"added": 1582356445
		},
		{
			"topic_id": 1583203227,
			"title": "There is nothing to fear in the future.",
			"body": "Observation and mass surveillance will be the future, and it'll be a good thing - finally the next step in governance will arise. \nBefore we worshipped Gods; metaphysical beings that were created by humans to control and manipulate the populace, and overall, it's hard to argue that it was not for the better. \nIn recent years we worshipped fame and memes, because eventually we killed God. These systems united us with a strong social fabric that helped alleviate suffering, and further improved our lives through convenience, a bloom in technology and medicine to solve the problems of old. \nThe new problems we face now are a sense of existential dread, exponential cost of living, a decentralisation of society and the social fabric has torn at the seams.\nOur new God will reside in our computers, watching us, providing us with our answers, medicine to our suffering, stiches to our psyche and the collective consciousness, and end future conflict perpetuated by man.\nWe are not living in the best nor the worst time in human history, but instead, we reside in the uncanny valley between utter destruction, and total cohesion. And we will not tip into destruction.",
			"added": 1583203221
		},
		{
			"topic_id": 1587573122,
			"title": "Oil Prices are at -35$",
			"body": "What happens now? Do I take all the oil I can store & sell it when the economy gets back to scratch?",
			"added": 1587573115
		},
		{
			"topic_id": 1588879288,
			"title": "Apple & Google coalition to achieve contact tracing",
			"body": "What is contact tracing?\nSimply put, it's a method of tracking people & relatives who may be at risk/have an infection (in this case, COVID-19). If you want to travel, you'll need to download an app to verified that you're not infected, and that app is used to track your movements, who you talk to, your contact circle, etc etc. \nIn other words, we're fucked.\nhttps://www.youtube.com/watch?v=WRalTWAFBY4",
			"added": 1588879280
		},
		{
			"topic_id": 1600071135,
			"title": "Lulzmouse's side of the story",
			"body": "Though this topic may be obscure to a lot of you, I can't stress enough the importance that their side of the story is.\ntl;dr they're currently on the run & being hunted right now, from gangsters and organised street trash wanting them dead over long history. I'll keep this thread updated after i've gotten adeqate sleep",
			"added": 1600071126
		}
	],
	"topic_vote": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1581744611_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"1581971707_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1583880411_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": 1,
		"1585526551_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"1587651983_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1
	},
	"next_comment_id": 109,
	"comment": {
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "We only think that we're living in a simulation because the people around us seem so mindless; living their lives so mundanely, walking without direction, occasionally there's weird phenomena or 'glitches in the matrix,' but to say we live in a simulation is a painful, and almost insulting simplification.\nThe true answer lies within dimensional layers, as well as layers of awareness, but for the purposes of this not turning into something we should put into a pdf, we'll stick with awareness.\n\nSo, in simplified terms, life forms exist on planes of awareness; this ranges from the bottom layer which is those of flies, ants etc who carry menial tasks for years on end without question, and do not question as they do not possess the understanding of another life.\n Going further up you're led to being able to question life, your existence etc. Most people exist on this level but do not bother to attempt to answer such questions; while they have the ability for some creative thought they choose not to and therefore cannot ascend to higher awareness planes. \nThen there are people like us, who can question our existence and see the world through a different perspective; seeing the bigger picture, so to speak. (Or at least we'll make that assumption since you're here and in this thread). \n\nAh fuck it we'll continue writing later we're tired. gnite",
				"added": 1569497923
			}
		],
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "These problems are unlikely to be fixed sadly, the US will continue to act as a parasite upon the rest of the world and spreading its negative influences; culturally, economically and politically. US should've been nuked after the 80s. They're the cause for the world's problems, no matter which way you look at it. Some may argue that it's the corporation's fault since they pollute and create the culture, but this wouldn't have happened if the US didn't allow it. All new forms of marketing and capitalism stemmed from 70s consumerist America and it's only gotten worse. Advertising has killed us, and the US let it, in the name of profit.",
				"added": 1569541400
			}
		],
		"1569600536_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "What the fuck is this glownigger shit",
				"added": 1569678696
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 4,
				"body": "> [sinisterkid3250](#comment_1_1C2bvWvxQ5nCmpCQn5Cs9pX9hVVgRwY4Gp): I do not know. I guess that religion is needed in some measure because society needs control. acts like a reminder that tells them that freedom has limits, and i don't know, maybe humanity sometimes needs that limits. just saying ...\n\nPeople can control themselves without needing religion.",
				"added": 1569686930
			}
		],
		"1569779844_1PGmSveoNhGqd42DQt9emDzpnR4zdjKbnv": [
			{
				"comment_id": 5,
				"body": "Oh good, one less jewnigger in the world at last",
				"added": 1569800118
			}
		],
		"1568373932_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 6,
				"body": "I don't speak chicken scratch",
				"added": 1569840197
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 7,
				"body": "That's why cock.li exists and just use your own PGP to talk with others. Hell put it through thunderbird as well if you want.",
				"added": 1569943537
			}
		],
		"1569846397_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 8,
				"body": "Dat is a meme protocol, why even bother",
				"added": 1569945136
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 9,
				"body": "Anyone who doesn't is dumber than a box of rocks",
				"added": 1570026226
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 10,
				"body": "Ignore muters\nDo not interact with them\nAnd kindly redirect them back to reddit",
				"added": 1570046312
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 11,
				"body": "This faggot glows",
				"added": 1570046375
			}
		],
		"1570017594_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 12,
				"body": "What's the need? Would be nice and all but don't think there's ever been a need for someone to post images during most discussions here.",
				"added": 1570059990
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 13,
				"body": "Here's some random idea we just thought of in 10 seconds as is probably shit;\n1) SSH into a device running a wireguard tunnel\n2) route all traffic through that device + TOR\n3) connect to zeronet and create an ID over kxtoid or whatever it's called\n4) proxy to clearnet \n5) Fail cause something went wrong?",
				"added": 1570312371
			}
		],
		"1570313405_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 14,
				"body": "But brazillian chicks and traps are hot.",
				"added": 1570315885
			},
			{
				"comment_id": 15,
				"body": "> [xcape2net](#comment_433_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Maybe they would be hotter if they were radioactive?\n\nNo thx I prefer those who come in my bed to not look like they came out of Chernobyl.",
				"added": 1570317070
			}
		],
		"1570379712_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 16,
				"body": "go read a chan or wiki you lazy nigger.",
				"added": 1570380124
			},
			{
				"comment_id": 21,
				"body": "> [sheendocks](#comment_62_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): Stop with the dumb language, just because ZeroNet provides a little more privacy, you still ought to speak like your nan was listening to you.\n\nGo back to reddit you insufferable maggot, stop picking fights just because you're bored. I'll speak how I want, and if you're going to ask people to hand basic research to you then purposefully bump your shit thread by posting every link as an individual reply you deserve to be ridiculed. \nFuck you.",
				"added": 1570469729
			}
		],
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 17,
				"body": "btw i use arch",
				"added": 1570416530
			},
			{
				"comment_id": 18,
				"body": "Wrote this tirade after being done talking with some arch user about it, was triggered as fuck. It's also been my experience with systemd as of late, as you can tell it's been a shitty one. Tried Devuan but it felt so shit compared to default Debian for whatever reason, think it was mainly to do with the repos and not knowing how they work, was probably my fault but will probably try again another time. Deb10 is comfy as it is, despite having systemdicked in it.\n\n> [whitewolf](#comment_63_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): literally hitler? so systemd killed about 12 million less than Stalin. good to know.\n\nIt was a joke you autist. Now dismantle all the other points.\n\n> [k0hlr4bi](#comment_4_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): I think it's a matter of time when they switch to systemd full-time because sysvinit will probably stop being supported in the way they require. Read their news, it seems they have issues supporting sysvinit and are already hesitant keeping to use it.And besides, MX has a lot of binary firmware by default, so no freedom. They include eveyrthing in their repos, even Chrome, Steam and Spotify. Just install and run the \"vrms\" command - you can see a shitload of garbage preinstalled.\n\nWas thinking of trying it, but if it's got proprietary garbage in the repos, forget it. Chrome should never be in *any* default repo. Thanks for making this post and saving me the hassle.\n\n> [robione](#comment_318_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): surprising the \"build your own\" mantra of arch is locked into systemd. [...]\n\nDon't think there are any arch-based distros without systmed, or at least that I know of. Only viable alternatives I can think of are Alpine and Void, and I'm probably going to install Alpine soon.",
				"added": 1570468576
			},
			{
				"comment_id": 22,
				"body": "Luckily no one's forcing you to read it. Will probably rewrite it in a way that isn't autistic when not lazy",
				"added": 1570471741
			},
			{
				"comment_id": 24,
				"body": "> [satoxyn1](#comment_114_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Systemd is the best what has happened with Linux in last 10 years. I'm absolutely serious. [...]\n\nDon't get me wrong, we do need something *like* systemd for linux and especially BSD, but SystemDicked itself is garbage. Something like journalctl can be implemented much better than it is with SysD and definitely should be made and implemented, but having a monolithic system that you can't remove in your computer that only saves you a few seconds of typing in a command isn't worth it. (zsh is much better for finding files by the way, but either way POSIX is pretty shit). \n\nCan kind of agree with you on the scripting part, but at the same time, SysD accomplishes writing scripts for every other sysd system which is great until you realise that it's essentially creating its own sort of ecosystem. And having linux being polarised between sysd and non-sysd distros isn't great for anyone. That combined with how quickly it was introduced, and who's behind it only leads to suspicion. And because of sysd's size it's also hard to audit; lest we never forget that god awful bug where jornalctl would allocate memory on the stack back in 2016.\n\nAs for its init system, in Lennart's post 'Rethinking PID1' he noted that in respect to MacOS' launchd system, he wanted to minimise the number of services started on powering on the machine to reduce boot time, but sysd barely accomplishes this, if at all. Most it does is restart services if they crash and has a command to reload the service, which is again, barely an inconvenience in spite of just disabling and re-enabling it.\nMy gentoo installation with OpenRC on a HDD was faster than my current Debian installation, which takes ~40s to bring me to lightdm.\nNot to mention the god awful security risk of running NTP over PID1. \nSysD's service management is.. okay at most. (Not going to bring up the fact that it was ripped off of launchd because it's kind of irrelevant in the discussion). \nOpenRC works much better mainly cause of its portability and has a decent service model. I don't want to sound like I'm shilling it, but it's the best example I can use since I have experience with it. Sysvint is equally good respectively.\n\nAgain, we need something *like* SysD, but this implementation of it can respectfully go fuck itself. And fuck LP.",
				"added": 1570574101
			},
			{
				"comment_id": 28,
				"body": "Update; I removed systemd from my Debian install. Will probably post a guide and make a zerosite that fully illustrates how to do it. Internet is a bit fucky though.\n> [ferazi](#comment_1_14k9NA8euwdzvQFVP2u7mVWPXzdoiAo8dy): Gentoo doesn't use systemd by default but instead uses openrc its own init system. You would need to manually install systemd if you need it. Only problem with Gentoo is install/large updates is close to installing/updating Windows since you need to compile everything yourself.\n\nFuntoo is much better for a variety of reasons, forgot what those reasons were. Mainly because it's funtoo install though.\n> [k0hlr4bi](#comment_6_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): Linux itself is largely controlled by Google (https://www.kernel.org/) so maybe we should look into BSD. And Firefox can be replaced with Tor Browser or PaleMoon\n\n> Pale moon\nNot trusting that buggy shit maintained by a furry. Firefox is bloated, but you need a bloated browser to browse the bloated internet. Or if you're feeling extra autistic, use Surf.",
				"added": 1570771353
			}
		],
		"1570456755_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 19,
				"body": "NK is a great producer of meth that gets tunneled through China and South Korea, and the US govt and its beneficiaries profit off of this. NK will exist as long as they don't grow too big, and have no power over anyone. \nThere's more to the talks with Kim Jong-un that wasn't shown and that we won't hear of until much later. \n\nFurthermore, there's additional conspiracies that revolve around NK and its regieme such as manufacturing a gathered consciousness via human experimentation; it's a playground for world govenrments and the people are the test subjects. Kim and the family stay will stay fat as long as they play the puppet.",
				"added": 1570469160
			}
		],
		"1570455782_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 20,
				"body": "In the future when the curtain is pulled to show the ugly beast, your system will be monitored, censored and even shut down by these companies if you do not comply with their shitty TOS, or if any government wants to control you.\nAt least run ME cleaner on your BIOS, or something that gets rid of the binary blobs. And use a librebooted, encrypted machine as your daily driver.",
				"added": 1570469435
			}
		],
		"1570193822_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": [
			{
				"comment_id": 23,
				"body": "I see glowniggers are still using the old movie gag. This nigger must be fresh on the job or be into it an really hate it.",
				"added": 1570500194
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 25,
				"body": "Zeronet has few users and it should stay that way. Don't bring normies here, they'll shit up the place just like how they did to 8chan/kun and the hacker 4chin. Only bring those who are like us.",
				"added": 1570578155
			},
			{
				"comment_id": 26,
				"body": "> [reichardnixon](#comment_36_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): That is why there is a mute button. Stop being a pussy.\n\nDo you want to be constantly muting people instead of just keeping things the way they are? Thought not. Normies can go make their own decentralized network, if they can make a phone app for it too. There's no need to make this mainstream.",
				"added": 1570598700
			}
		],
		"1569591354_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": ">China is stalking us\ntell them to get in line",
				"added": 1570771022
			}
		],
		"1570819630_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6": [
			{
				"comment_id": 29,
				"body": "Seeding. You did good.",
				"added": 1570825770
			}
		],
		"1570851286_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 30,
				"body": "Why don't you do it for us and let us know the results",
				"added": 1570939773
			}
		],
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 31,
				"body": "So many people just take the media's definition of incels and believe whatever they see on shit like r/incels or whatever without knowing how they came to be, and what their actual mentality is.\nIt's not 'hurr I want to kill women for not having sex with me,' the reasons stem into the loneliness of young men in the western world today. \n\nFirstly, let's look into what media portrayed life to be in movies, tv shows etc. We all know what happens, the dumb, nerdy loner wins over the heart of the Stacy, beat the Chad and live happily ever after. There was also the promise of a long, loving, stable relationship by being caring and understanding relationship and that the girl will love them for being soft but caring. So these men became soft, caring, loving etc from early on, and working honestly and hard. Then in whatever recent year, women turned around and said 'God why are men so soft? We prefer stronger men who can protect us...' yada yada. So all these young men who wanted be the perfect man for this, now fictional woman are left by the wayside by the Chads.\n\nYou don't have to imagine how this makes them feel, it's the same reason why doomers exist; young men who've been left behind the world and can't adapt.\nAnd so the awkward young man goes up to any normie, or anyone in conventional society in general and asks 'how do I get a girlfriend?' And this is where the 'just be yourself bro' meme comes from. Because their current self is not wanted, and god knows if they even know who they even are. So they try to do everything and just end up failing of course, and when they do fail, they're just left by the wayside by the rest of the people in society. And when he gets mad and frustrated at everything that's happened to him, he of course, gets mad. And then of course, that only generates a negative response towards them; it's society out-casting them for not being able to fit in. They're rejects. 'Losers.' And of course there's a ton of meme advice they get too that I'm not even going to start to get into. 'Just lift bro' and all that shit.\n\nAnd so they go to obscure places on the internet to talk with other young men who face the same problem until it just becomes a circlejerk of hating the world, themselves, others, pretty much anyone. And all that hatred just feeds into itself, and going to these places on the internet it not only their relief, but also negatively impacts their psyche. \nThis equally isn't good because- fuck it I'll just let Contrapoints talk about the rest cause I'm too tired for this shit;\nhttps://www.youtube.com/watch?v=fD2briZ6fB0\n23:44 - 30:25 are the only parts really relevant, and you can skip the bit in between. She doesn't really get a lot of the rest right in my opinion.\n\nFinally, the reason as to why they're hated so much is for the simple reason that the masses (society) is bored, and have no clear goal. So they give themselves one; to fight off a common enemy. That new target, is the incel community. In other words, normies are demonising the people they indirectly created and treating them like literal terrorists in the name of self righteousness and wanting to be good people. It's all a sick ego boost.\n\nSo yea, incels in a nutshell. Hope you enjoyed my little blogpost. Also fuck normies.",
				"added": 1570943917
			},
			{
				"comment_id": 32,
				"body": "Also OP, you're a total faggot. Stop strawmanning all incels.\n\n>As a certified autist, you might be surprised that I find it strange. Women find me attractive, but I'm no Chad. It's a combo of looking my best (your best look is crucial) and sounding intelligent (I am). Humor and deep conversation help.\n\nMost women these days just want someone who wants to instantly ask them out, look Chad etc. Evidence? Just look at any woman on twitter, and how they behave on Tinder- actually tinder's a horrible example, women just go on there to fuck anyway. Still backs up the point though.\nI don't care about whatever 'well my friend's cousin managed to do it and he's an aspie'- tier \"\"\"argument\"\"\". \n\n>Take some online advice and be smooth instead of creepy.\nAre you fucking serious? \nhttps://www.news.com.au/lifestyle/real-life/news-life/shy-and-awkward-student-19-who-googled-how-to-make-a-friend-assaults-schoolgirl-17/news-story/79331a2ca766b2b234717e59f0128bdd\nThis is what your shit advice gets people into. \n\n>That Elliot Rodger dude was a dumb fuck. \nIf you've ever read his manifesto or whatever, or even listened to a psychological report on him you'd know he was a depressed narcissist etc, and realistically no woman wants that. Plus his autism.\n\n>Saying all women are the same is the reason you'll miss the ones that aren't the same.\nLiterally muh 'not all women' tier. Not even going to bother.\n\n>Don't be an incompetent fuck by giving up and spreading blame. Your Chad, Stacey, Tyrone and roastie lore is fiction.\nYou're either ignorant or baiting.",
				"added": 1570944857
			},
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_1131_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I apologise for my ignorance. It seemed like a common thing rather than a straw man. [...]\n\nNo worries. Think my reaction was a bit too overboard too.\n\n> [styromaniac](#comment_1132_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I was depressed, even cried some in high school and that didn't prevent them wanting to go out with me. Do you mean softie like doing things for them, acting effeminate, or what? Obviously Hollywood is unrealistic. You have to navigate most of interaction yourself instead of rely on a fictional process.\n\nI'm really not the authority on this since I realise my vision on the world is partially twisted and I also have very limited experience in this field. My best guess is that women just want a sociopath to put them in their place - you have to look good, have a personality / interests and be impulsive. Almost nothing else matters.",
				"added": 1573324822
			}
		],
		"1570935984_149NKX715zpvjyRaoR7ZdVKMDQ9BQ7kj5s": [
			{
				"comment_id": 33,
				"body": "They're the enforcers of the 1%'s wishes, nothing else. And they're short staffed so firing them isn't a great option. Shit like this happens all the time and will keep happening.",
				"added": 1570945066
			}
		],
		"1571185468_15io4gegLAkgg9jNErcMyY6bpD64HULMCw": [
			{
				"comment_id": 34,
				"body": "Install gentoo",
				"added": 1571337663
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 35,
				"body": "I said ages ago that trying to make ZeroNet more mainstream was a horrible idea, and this is why. You don't invite someone into your house and 'be nice' when they shit on your floor. They either start being of quality or get bullied out. It's really the only way to maintain any sort of quality",
				"added": 1572699808
			},
			{
				"comment_id": 37,
				"body": "> [randomshits](#comment_233_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): She needs to learn to adapt to the network that she is using. It is ridiculous to expect the network to adapt to her. If such a place of conversation is desired, someone could create their own ZeroTalk and attempt to moderate it against pessimistic users. [...]\n\nAh maybe you're right, some extra people won't hurt. Only question is how to get them here; invite only sounds good on paper. There's also not much incentive to come as of yet - why did any of us join?",
				"added": 1572836233
			}
		],
		"1572672000_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 36,
				"body": "This is just going to have Kony2012 level of turnouts, nothing to ring home about",
				"added": 1572732165
			}
		],
		"1572829588_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 38,
				"body": "Don't worry, the next generation who have quantum computers will be saying the same",
				"added": 1572838073
			}
		],
		"1572987956_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 39,
				"body": "Can I haz cheeseburger? :DDDD",
				"added": 1573058877
			}
		],
		"1573036387_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 40,
				"body": "Trying to make an obscure network only leads to vulrnabilities like aspidochelone said; there's already existing exploits for the Bitorrent protocol and opening up zeronet for more just seems like an exercise in futility and self sabotage.",
				"added": 1573061907
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 41,
				"body": "I have to force myself to fap majority of the time, so nofap is really easy.",
				"added": 1573063657
			}
		],
		"1573291463_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 42,
				"body": "Lutris also works quite well whenever Wine decides to have an aneurism. It's easier to set up if you're on a distro like *buntu or Manjaro, which sets it up for you by default with minimal effort.",
				"added": 1573317654
			}
		],
		"1573243995_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 43,
				"body": "The 'sjw's found that the Linux Foundation can be corrupted by private companies and become even more corporatised that it already is when Linus left the project. Ever since then, it's just the usual schtick of corrupting everything and letting whoever pays them have their hand in the pockets of their victim. \nShit like this is why I'm moving to BSD or Open Solaris. Not to mention that they're putting Microcuck's Edge browser in Linux. Won't be long before Microsoft essentially has Linux as its own product. Open Source? Maybe. Telemetry? Almost guaranteed.",
				"added": 1573318204
			}
		],
		"1573319686_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 44,
				"body": "There's already LFS, if that's what you're referring to. Making a distro from scratch is a challenge within itself, and there's already endless distros that exist already. Pop!_OS is one I've recently switched to, and fulfills all my needs. I still otherwise run Debian Bullseye with OpenRC.",
				"added": 1573321581
			},
			{
				"comment_id": 48,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1006_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You do not need to start from scratch, take a distribution that you like. Then adapt it to your needs.\n\nIsn't that just what everyone does? Or are you talking about changing the source code/init system manually",
				"added": 1573325028
			}
		],
		"1573148419_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 45,
				"body": "What even is this program",
				"added": 1573322337
			}
		],
		"1573322972_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 47,
				"body": "Why did they make such a stupid change? Hopefully they revert it back.",
				"added": 1573324969
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 49,
				"body": "waiting for OP to deliver",
				"added": 1573335404
			}
		],
		"1573493903_15J9WqJ7U9o76YwpchQ97fLYjyCAqGj7um": [
			{
				"comment_id": 50,
				"body": "this doesn't look sketchy at all",
				"added": 1573513836
			}
		],
		"1573477450_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 51,
				"body": "We need an alternative to TOR, but a browser would make no sense. The dev team isn't that big and it's just another security hole.",
				"added": 1573514121
			}
		],
		"1573768564_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 52,
				"body": "Just because it's on the internet, doesn't mean it's true. God didn't they teach us that in school? This entire document is bullshit and deep state is a lot more secretive than that.",
				"added": 1574160543
			}
		],
		"1573772721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 53,
				"body": "> [z3n5if](#comment_45_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): No you weren't. You just said that to sound edgy and interesting.\n\ntake a joke you auist",
				"added": 1574160797
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 54,
				"body": "> [somuchfood](#comment_8_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): wouldn't it be easier to print a 3D gun with 3D printer?\n\nWell yes, but also no.",
				"added": 1574359389
			}
		],
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": [
			{
				"comment_id": 55,
				"body": ">reddit clone\nanother? Why. \n>single purpose\nehhh.\n>removing old content\nhorrible.\n>no official linux support. \nYou lost me. \nZeronet isn't the best and honestly quite flawed, but it's better than nothing and serves most of its purpose.",
				"added": 1575154587
			}
		],
		"1576592495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 56,
				"body": "That's probably the most valid critisism I've heard on Linux for a while, and yes, thanks for channeling my frustrations with it. I'm still in love with Debian regardless, despite its flaws on 32 bit and its Nvidia driver support being awful. \nhttps://wiki.debian.org/NvidiaGraphicsDrivers#Installation\nStill no update for Deb10 kek. \nI recommend taking a look at this;\nhttps://www.youtube.com/watch?v=L9v4Mg8wi4U",
				"added": 1576832855
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 57,
				"body": "*windows registry*\n~~WHATHEFYUVK~~\n[code] int main()[/code]\n\n// Still figuring out syntax\n\n``please?``",
				"added": 1576833131
			},
			{
				"comment_id": 69,
				"body": ">3 errors from zn",
				"added": 1581655106
			},
			{
				"comment_id": 107,
				"body": "yes im still alive, sadly",
				"added": 1598064007
			}
		],
		"1578079566_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 58,
				"body": "WW3 *will* happen, the US has been attempting to provoke a hostile response from Iran for months now. \nWhat concerns me is that no other country has made a statement on the US' actions as of yet. Why is everyone staying silent? Does Russia not care about its ally anymore? What are they planning worries me more than whether a world war will be survivable.",
				"added": 1578080151
			}
		],
		"1578343451_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 59,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1560_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Get offStay on Youtube. [...]\n\ndamn man why so aggressive so much these days? is everything okay?",
				"added": 1578369823
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1565_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): why do think you can control people?\n\nI'm not saying that I can, I'm in agreement with you but I'm just asking if everything is okay cause you've been p hostile the last few weeks",
				"added": 1578790955
			}
		],
		"1578801836_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 61,
				"body": "Just your average day in 2020, dunno what you'd expect.",
				"added": 1578813146
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 62,
				"body": "Honestly, if you ask me I think the US is behind it, China's right\nhttps://money.cnn.com/data/world_markets/asia/\nI highly doubt it's a coincidence that Trinity Biotech's stocks rose significantly (around 35%) after nCov was announced, and TB has worked on stuff very similar to Corona, the most similar being Adenovirus\nhttps://www.trinitybiotech.com/area/respiratory-infectious-diseases/\nhttps://www.cdc.gov/adenovirus/about/symptoms.html\n\nIt would make sense as well - push China into isolation and let the US corner the asian market and win the trade war against their largest competitor.\nManufactured fear against the Chinese is probably the greatest ways for stocks and cultral relations to fall, which is *exactly* what the US wants.\n\n>'b-but maybe their stocks rose because they got funding to counter it!'\nYea, to counter the very virus they made. Most likely they already have an antidote, but they won't release it until the US achieves their political goal - crippling China.\nAnd hell, if they were making a cure, then why have they remained completely silent? Surely it would be a great thing to inspire hope in others by updating the world on the progress of their antidote.",
				"added": 1581385561
			}
		],
		"1580594957_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5": [
			{
				"comment_id": 63,
				"body": "Revolt for Riot.im, Kitty, Thunar Sublime Text (honestly I never use it, I just love stealing), Thunderbird/Geary, Nextcloud, & Kubernetes (QEMU VM) which i all run on PopOS with a modified gnome desktop, to make it more contemporary. Still using apache webserver too, since it's the only web server I know, and I've come to love it.\nAnd I'm using Centaur Emacs now, I've never laughed and smiled so much when using a piece of software...",
				"added": 1581386273
			},
			{
				"comment_id": 67,
				"body": "> [stellarflare](#comment_1_18s54f3Y8q2cBkqfs4813FLGogKyJJibQp): There are a few pieces of software on linux that I've found to be quite useful. [...]\n\nIf you're running systemd you can also run Lutris in an nspawn container which may/may not be useful to you, if you haven't already\nWine's a huge security hole to have, at least imo. Has it gotten better over the last few years? And have they changed that god awful interface yet?",
				"added": 1581645336
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 64,
				"body": "Biological weapons are meant to act and kill fast, then die off quickly. What we're seeing doesn't match that at all.",
				"added": 1581387587
			},
			{
				"comment_id": 83,
				"body": "> [trent92](#comment_1_1B9g2Zxfh9LYsCUKCBaozwzUUTmcNPov1N): Not logical at allï¼Œthatâ€˜s more harmful to CCP. China's economy needs demographic dividend instead of reducing the population.\n\nJust ignore him, he's been going on about this meaningless trife for ages.",
				"added": 1582458210
			}
		],
		"1580612515_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 65,
				"body": ">reddit like\n>without censorship\npick one",
				"added": 1581387662
			}
		],
		"1581447935_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 66,
				"body": "It's better if you take down this proxy altogether, it's an awful idea that's been discussed on many other threads before. It's not even that hard to connect to zeronet in the first place so what's the point?",
				"added": 1581473822
			},
			{
				"comment_id": 72,
				"body": "> [zeroseed](#comment_12_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): people are lazy...\n\nThat doesn't constitute making a gaping security hole run by someone who clearly has very little experience with hosting.",
				"added": 1581822303
			}
		],
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 68,
				"body": "Hell take me I fucking hate the people of this country. \nEverytime the government fucks us over we all just lie down and take it, instead of actually doing *anything* at all about it. It's like the people are just as braindead as the bobbins who run this shitshow.\n>What are the penalties for failure?\n>We do not know, but the government says they will be â€œfair, proportionate and transparentâ€. \nAh yes just as transparent as their laws on hate speech I reckon.\nFucking hell I'm planning on moving to Denmark ASAP.",
				"added": 1581646067
			},
			{
				"comment_id": 85,
				"body": "> [moor](#comment_404_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): just because you are dumb and can't understand more than one thought at once doesn't mean its crap, learn to read and think and respond appropriately (if you care), faggot ðŸ’–\n\nStop derailing this thread, we're talking about the UK not your failure of a political system.",
				"added": 1582763137
			}
		],
		"1581744611_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": [
			{
				"comment_id": 70,
				"body": "It's not the police at fault but rather the boomers who run them, mainly the idiots in Scotland Yard and the like. Their intent isn't necessarily bad, but it's like they're completely oblivious to what the wired actually is, and how they're viewed by the general public as a whole that leads to them facing ridicule. \nThen again I wouldn't be surprised if they're just this plain retarded, this country's already had its fair share of retardation from those that run it.\n\n> [aspidochelone](#comment_351_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): b) profiles are supposed to be used to help FIND an actual criminal, not to DEFINE a criminal. For example, as Michael Bloomberg likes to say, American cops are often looking for black teenagers [...]\nMost the cops here will do their damn hardest to find any kind of dirt on you; they're always bucking for promotion and desperately needing to fulfil their quota. I still remember back in HS some black guy I knew was stopped by the cops because they were *apparently* looking for \"potential criminals who matched his profile.\"\nBearing in mind that we all had to wear suits and ties when we went to the school, so, highly unlikely that they were just 'doing their job.'\n\n>c) By far the creepiest part of the campaign is that parents are actually encouraged to RAT OUT their kids[...]\nWelcome to the UK.",
				"added": 1581821101
			},
			{
				"comment_id": 77,
				"body": "Lol. We need to protect our kids from Virtual Machines, oh god the horror",
				"added": 1582331988
			}
		],
		"1580551703_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 71,
				"body": "I fucked my hand while making my ID. See ya later virgins.",
				"added": 1581821991
			}
		],
		"1581696052_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 73,
				"body": "A better question to ask is whether we can reverse the decisions of these developers, not just become complacent and say \"just move to x distro lol\"\nBecause Linux is only going to get worse from here and just moving from distro to distro doesn't solve anything.",
				"added": 1581827038
			}
		],
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 74,
				"body": "It's quickly becoming my only avenue for free speech in this shithole of a country, hell if not the internet entirely. Fucking glowniggers are onto me already and I can't stand that.",
				"added": 1581994479
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 75,
				"body": "Why are you doing this...",
				"added": 1581994537
			}
		],
		"1582170690_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 76,
				"body": "This exactly, it's retarded to assume that they'd wage war for no reason, they neither have the manpower nor resources currently to even begin one. Especially since the virus is affecting them more than any other country. Stop spreading this bullshit",
				"added": 1582331702
			},
			{
				"comment_id": 88,
				"body": "> [testuser3](#comment_92_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): The Chinese gov CCP's original goal was to use the virus to infect selective people in Hong Kong, so that the CCP could use it as an excuse to impose martial law there and ultimately crush the HK pro-democracy movement. But it backfired terribly.In China, political safe is most important and civilian's life is too cheap just like their labor price, look at this: Front line Doctor: â€œwe are required to put political correctness firstâ€https://gnews.org/120158/\n\nThen why isn't HK in the least bit affected compared to any other country? Unless the leader of the HK riots are a bunch of seniors (which is mainly the demographic Covid-19 kills) then your theory falls flat completely. Putting PC first isn't any indication of ANY of this. It seems like you're stringing random \"\"\"facts\"\"\" together to create some bullshit narrative. I don't even believe gnews is too reputable of a source for any of your claims. Give me something with substance to go on.",
				"added": 1583921565
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 78,
				"body": "I played games all through middle school and got nothing to show for it, except worse grades than I probably would've got if I didn't sink 1400 hours into Battlefield 4. They're just that - a time sink. Absolutely nothing to be gained from them. \nOf course though, you can always use them to form friendships and connections with others you wouldn't normally have found which is one of the main intents behind online gaming, but other than that, they're useless. I'd argue we got worse because of videogames.",
				"added": 1582332290
			},
			{
				"comment_id": 79,
				"body": "Admittedly though, there are games which have very good messages behind them, and can tell a unique narrative that movies and other forms of media just can't. Whether you want to make the case for if it's better to be experienced or just watch a youtube video on it is up to your own preference, but personally I'd like to play through the game myself and come to my own conclusions and form my own opinions after fully experiencing the game. \nIt really depends on what games you play.",
				"added": 1582356573
			}
		],
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 80,
				"body": ">expecting a gaming channel to talk about privacy\nThen people will just hate privacyfags even more cause they're just constantly getting interrupted every 5 seconds about how they're being spied on. Normies don't want to hear about how bad the world is, they actively try to ignore it. Your solution would solve and do nothing but garner resentment for those who take privacy seriously.",
				"added": 1582357061
			}
		],
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 81,
				"body": "In the case of the people on R29, it was mainly young women. Other than that, the most flimsy link is that a LOT of were homeless &/or needed medication/had some kind of disability.\nSchizophrenics, cripples, etc etc. \nThis was released by the Virginia Police;\nhttps://docs.google.com/document/d/1AO6ts-ILTyO2pyBAqoqOSJuXpvMA2KWB8bJnFy2SJug/pub",
				"added": 1582357473
			},
			{
				"comment_id": 82,
				"body": "> [undisclosed](#comment_84_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Kanade, pictures can upload to imgur, with a link in your post.\n\nSorry I took so long, technical issues. Here it is;\nhttps://imgur.com/a/81PmoHf",
				"added": 1582457238
			},
			{
				"comment_id": 84,
				"body": "> [zeronetuser3541](#comment_9_1ATpyKRza3N49rrjJFPznrUG9BN1i6e6Uq): Homeless people get their organs harvested, its really sick stuff. Government-run, too. And young women are kidnapped and sold into human trafficking, sex slaves for the elite and morally bankrupt. Virginia is close to D.C, lion's den for the pedo elites. Not surprising a lot of people go missing there.\n\nIf you have/could point me in the direction of evidence for that it'd be greatly appreciated. That would also explain R29 and solve that mystery. We'll need better than word of mouth though, which is where I'm hoping > [fabcdefgwagon] will come in; \n\n> [fabcdefgwagon](#comment_11_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5): I was a resident of dale city VA so im interested in helping any way i can. I haven't heard of any route 29 disappearance although twitter always has a missing picture posted about every month now. If you could share some of your research with me I'd love to help!\n\nIf you still know anyone in the area, ask them about anything suspicious pertaining in the Newport News area; the US Navy has a port there which is a likely suspect for the transport of the abducted people.  If anyone's been contacted via phone calls or text messages by someone they don't know tell them to stay away from it, and ignore them. \nThe research we have is fairly limited, and most of it has been posted here already, which is why the information we're looking for is of such high importance cause at the end of the day, word of mouth doesn't account for much.\n\nI'm currently looking into previously owned properties by gangs near the area too, and one particular group which may have some affilitation with all of this. ",
				"added": 1582549811
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 86,
				"body": "Who the fuck even speaks this dead language",
				"added": 1583835646
			}
		],
		"1583563665_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 87,
				"body": "Do you have a single fact to back that up",
				"added": 1583836306
			}
		],
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 89,
				"body": "Everyone loves to make up their own baseless conspiracy theories that have no substance to them. Provide proof & evidence or kindly shut the fuck up, you're just adding to the sea of garbage on the internet",
				"added": 1584377652
			}
		],
		"1584797417_16yxmFzgPzF4SGiAQi9qY3ev6aSQzv3tb": [
			{
				"comment_id": 90,
				"body": "Build your own system/ Customize the hell out of a network install -\n  rEFInd bootloader\n  wpa_supplicant for networking (NM as a backup if you really need it)\n  busybox/musl init\n  wayland + weston for compositing\n  awesomewm for your window manager\n100x better than anything puppy linux can give you imo.",
				"added": 1584902863
			}
		],
		"1585861490_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 91,
				"body": "Some parts internet seems to be fucking up right now, my internet speed is apparently 6mbs up&down on all my devices. A friend in argentina also seems to be experiencing worse internet than before, which is an achievement..",
				"added": 1585908972
			}
		],
		"1584053180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 92,
				"body": "It always bewildered me how people can shove preprocessed garbage down their throats ad infinitum, giving no regards to its contents and just what they're putting in themselves. Do people really enjoy fast food? Or is it just artificial stimulation that makes them think they're enjoying it. \nWhat do you normally eat, styro?",
				"added": 1585924191
			}
		],
		"1587276631_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 93,
				"body": "It won't load nojs-tracker or whatever it's called for me. I even had to enable most of them to run. Do I pass the test?",
				"added": 1587455913
			},
			{
				"comment_id": 101,
				"body": "> [cexy](#comment_17_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): That's a great question. I find this confusing that what might be your protection in some circumstances might be your unique give away. Or I am not advanced enough to understand it properly.\n\nIf you use GNU Icecat's settings (even when enabling js) it just completely breaks the test, so most likely it's the most secure browser out there",
				"added": 1587947659
			}
		],
		"1587103405_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 94,
				"body": ">low quality content is a flaw of the centralised web\n>taking everything to decentralysed networks is better\nNo, you just moved the problem back a step - a majority of low quality content & half of the internet's traffic is automated/bots. Bots visiting eachothers automated sites, querying them, spidering other sites\nI can see your point about a sort of 'natural selection' of web content, but when more than half of the centralized web is also going to those shitty sites & promoting low quality content then again, it's just bringing all those problems here.\n\nA better question is \"how can we control the flow of information without censorship\" and in today's world, you can't. So which would you prefer - a web filled with the ideas of one party, or a shitty web with scant few traces of truth",
				"added": 1587456288
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 95,
				"body": "Send them to Minds, or something - it's similar enough to facebook but without the bullshit.",
				"added": 1587457966
			}
		],
		"1587573122_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 96,
				"body": "Huh, I thought they were still in the negatives. My mistake. Does that mean we can see a bigger push for renewables in the future to spite oil?",
				"added": 1587576457
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 97,
				"body": "For me it's hard to decide what I believe - While I believe that people are too naive to make political decisions & have much power at all, it leaves the rest of us who do think critically grouped in the same herd as them. That, and any governmental organisation or corporate entity has all the room they want to allow for corruption, which as we've seen in Brazil, doesn't end well at all. Yet allowing for freedom in the people equally gives way to what we have now. \nEventually I just gave up on politics because there is no right answer, only wrong ones.",
				"added": 1587810422
			}
		],
		"1587761800_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": [
			{
				"comment_id": 98,
				"body": "Run an IRC server, email & wireguard",
				"added": 1587811973
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 99,
				"body": "> [edgelordofdecent](#comment_503_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I'll upload a zite with the pastebins when I get the time.\n\nAlready did it\nhttp://127.0.0.1:43110/1Ef4RYRCPjdVhC6Z8iFhdUysqiUEVfucdT",
				"added": 1587817182
			},
			{
				"comment_id": 100,
				"body": "> [anshorei](#comment_91_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Far more important than a canary is that your zite's private key is not stored unencrypted. Stick it in a password manager and make sure it's no longer in users.json. If you don't have access to your private key you can't remove the canary and if they have access to your private key they can do what they want with you zite.\n\nThanks for the advice, I'll get to work on that when I boot up my PC.\n// Done",
				"added": 1587945724
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 102,
				"body": "> [rsdio](#comment_2_1A4jEET1E4aBruQ8uosdZXhC6bMoZ5jHjC): I would be open to the closure of every account on the internet that's campaigning for censorship\n\nwouldn't that also be censorship",
				"added": 1591799105
			}
		],
		"1592067672_1QBa3qVPi84otXt5PzBgRu9VyqXZ3Hz68Y": [
			{
				"comment_id": 103,
				"body": "this looks pretty interesting and in-depth, but who's behind this project, and has the code been audited?",
				"added": 1592072320
			},
			{
				"comment_id": 104,
				"body": "> [kanade](#comment_103_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): this looks pretty interesting and in-depth, but who's behind this project, and has the code been audited?\n\nlol nvm. i read their github readme. they sound so fucking pretentious holy shit - \n\n>our mission is to progress humanity\n\nwtf",
				"added": 1592072723
			},
			{
				"comment_id": 105,
				"body": "> [vgk88](#comment_1_1QBa3qVPi84otXt5PzBgRu9VyqXZ3Hz68Y): This project is also being developed with the help of the community. I am one  community member. If you are interested in this project, you can join. I think it would be interesting to integrate Cyber â€‹â€‹into Zeronet as well.\n\ni wouldn't mind joining but the way they come across when they talk about the project just sounds so stupid - \"become a hero\" on the website, next there'll be some shit like \"join the revolution\"\nnaturally i'd be a bit skeptical when there's shit like that on any project",
				"added": 1592073675
			}
		],
		"1592435169_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 106,
				"body": "why would you want to?",
				"added": 1592955792
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 108,
				"body": "> [kapec](#comment_23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Just a crazy idea of mine but.Have you tried donating?\n\nah yes, the solution to all the problems in the world, throw more money at it until it works",
				"added": 1598064242
			}
		]
	},
	"comment_vote": {
		"391_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"164_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"3_1GwUu3reULwvP9T962A7LWwXLNV39vhNPg": 1,
		"69_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"98_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"357_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"504_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1853_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"368_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1878_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1DN3VWX7wRD71B6i3GYvVkBXzJWWUGFb1Q": 1,
		"1022_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2034_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"487_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"78_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"2117_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}