{
	"posts": [
		{
			"id": "34e81077-ee80-468b-bd81-abd434e99135",
			"subject": "Horse Girl Appreciation Thread",
			"body": "Let's hear it for the girls who know how to ride ( ͡° ͜ʖ ͡°)",
			"time": 1554345052716,
			"files": "[{\"name\":\"HorseGirlsMakeTheBestTops.png\",\"thumb\":\"618974ba912c266411b44b9922493dc9ab980f65-thumb.png\",\"size\":987993,\"type\":\"image/png\",\"original\":\"618974ba912c266411b44b9922493dc9ab980f65.png\",\"directory\":\"1HzCE6GfGyJJ5qYmZYxaaPB8S8a2PPYi7E\"}]"
		},
		{
			"id": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"subject": "Dating Lolis Is Fun",
			"body": "I took her to a coffee shop today. She did her homework and I sketched her. And the entire time I was using that as a flimsy excuse to admire her beautiful face and as I was watching the way she chews her lips on particularly difficult questions it dawned on me that it's the little things I love about her. I mean, it's nice to look down from my phone and catch her staring at me with love and adoration. It's how she blushes and smiles a little when I do. Or how she melts into me when she's doing the dishes and I sneak up and hug her from behind. \n\nIt's the way we can paint together and make slime on a whim just because she saw a cool slime video. It's spending hours with her and swearing it's only been a minute. It's the way she snaps me updates about her day and how we fall asleep together on Facetime. It's the way she hits me and calls me adorkable when I make a bad pun. It's every eskimo nuzzle after we greet each other with a kiss and the way she gives me these children's bedroom eyes when she's feeling frisky. It's every butterfly in my stomach as we hold hands and every giggle when we poke fun of dumb TV shows. It's the love in her captivatingly blue eyes when I'm geeking out about something.\n\nLife is worth living, sometimes.",
			"time": 1554350014668,
			"files": "[{\"name\":\"31771160d536ba946e0a8d6d0b4cfe7e5f508cc7-thumb.jpg\",\"thumb\":\"94a8e868a7453eb4d0cb1d27a091f2224f4484a0-thumb.jpg\",\"size\":584347,\"type\":\"image/jpeg\",\"original\":\"94a8e868a7453eb4d0cb1d27a091f2224f4484a0.jpg\",\"directory\":\"1HzCE6GfGyJJ5qYmZYxaaPB8S8a2PPYi7E\"}]"
		},
		{
			"id": "90b56355-ff14-44d2-83b4-71d2651a92fe",
			"thread": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"body": ">>d78e90a9-3bc6-41b2-b38b-274696754451\n>Have you ever tried making Oobleck\nI actually have not but I will definitely check it out. \n\n>How did you came to be together?\nWe met on Easter Sunday. I saw her playing with a very shy neighbor girl who was about 5 or so. She was wearing pink bunny ears and had a shirt on that said \"model\" on it so I told her I wanted to photograph/draw her. We started talking and I got her number and we just kind of hit it off. She convinced her old man to let me tutuor her so we could have an excuse to spend time together and she was showing me her slimes and I got an idea. So what I did was I asked her out by making a bunch of slimes, placing them out on the dining room table where I tutor her (we live VERY close by each other) and the slimes were clear and had red blocky letters that spelled out \"lets go out Saturday\". We went to Dave & Busters, iPic, a local park downtown that's popular, basketball playoffs, etc for our dates. It was nice.",
			"time": 1554406468158,
			"files": "[]"
		},
		{
			"id": "32abe547-c65e-4216-8fda-a3e0cf888c9e",
			"thread": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"body": ">>12fa4875-14bd-4d47-aefd-0af3ded31cf2\nAre you okay? You seem unwell.",
			"time": 1554664763500,
			"files": "[]"
		},
		{
			"id": "402bf984-9c0b-412f-8a78-2442a8e6b9ff",
			"thread": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"body": ">>d78e90a9-3bc6-41b2-b38b-274696754451\n>any stories you're willing to share\n\nWe went to a local carnival and took a selfie biting out of a caramel apple at the same time. Not really a long story but it's a really nice memory for me.",
			"time": 1554665485500,
			"files": "[]"
		},
		{
			"id": "d99ae561-6f05-41d7-963c-a5aef2e0187a",
			"thread": "34e81077-ee80-468b-bd81-abd434e99135",
			"body": ">>18b1b1d6-0546-4965-8bfe-44c7f4e92e08\n>why did you censor the horse\nBecause her horse is very important to her and I figure the right to privacy should extend it to the horse too.",
			"time": 1554666042200,
			"files": "[]"
		},
		{
			"id": "e1f38a1a-ffd2-4a7a-920a-ca433f0ad289",
			"thread": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"body": ">>baa61061-b36f-4e92-a508-15e737671026\nI'm in America and we're neighbors. Also that's exactly what I did. Let me give you a secret, if you're attractive (and white) you can do anything - especially if you act like you're supposed to be doing it.\n\n>I actually have a burning hatred for these things\nYeah they're not worth the expense in my opinion but we needed something cute for a selfie and funnel cake would have been messy and awkward by comparison.",
			"time": 1554764186200,
			"files": "[]"
		},
		{
			"id": "e4b21078-b0fe-4a36-acdc-1ffea97c90b5",
			"thread": "fc8f0b56-349b-47dc-b752-a7666f88206b",
			"body": ">>baa61061-b36f-4e92-a508-15e737671026\nShe's going to be a high school freshman in a few months so if that's what you consider a granny I guess that's who I'm into? I mean we met when she was 12.",
			"time": 1554764314800,
			"files": "[]"
		},
		{
			"id": "c74630ba-42f6-45fd-94d4-f29fb4679099",
			"subject": "/LDG/ - Lolidom General",
			"body": "Laura B is your mistress edition\n\nWhy are bossy little girls so attractive?",
			"time": 1555238590011,
			"files": "[{\"name\":\"1555095647828.jpg\",\"thumb\":\"1a325d1f26bfc6c429353b518586bd9c93b09dcb-thumb.jpg\",\"size\":333818,\"type\":\"image/jpeg\",\"original\":\"1a325d1f26bfc6c429353b518586bd9c93b09dcb.jpg\",\"directory\":\"1HzCE6GfGyJJ5qYmZYxaaPB8S8a2PPYi7E\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}