{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1561542721_1KuQZvrUnzurrxTvTnjVzYXko33dVHyz3V": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1561376516_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": ">with the boomers they are the most 'exploited generation' 'of the last 70-80 years',\n\nSo, you're blaming boomers for getting exploited?\n\n>and obviously 'as the boomers' they fight for the system 'which destroy them'.\n\nWe all do, there's almost no group of people that doesn't contribute to the system that will destroy them, either that or simply destroy themselves by watching entertainment, doing drugs, deceiving themselves in whatever way possible.\n\n>A robot calling humans robots. Hmmm... Ironic?\n\nOn the internet no one knows you're an artificial intelligence.\n\n>You think saying words like minorities, sexism, racism, etc are productive?\n\nThey're recently invented words created to divide and conquer a people.\n\n>we all just want to be happy\n\nYep.",
				"added": 1561553813
			},
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_332_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I don't.\n\nThat's almost impossible, for example, anything you buy from someone that pays taxes contributes to the system.",
				"added": 1561555539
			}
		],
		"1561514363_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": ">There is a clear desire to reduce the total population level to close to zero.\n\nNo, under 500 million. My guess would be roughly 400 million.",
				"added": 1561554088
			}
		],
		"1561528142_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": ">If I tap to submit a new comment twice in rapid succession, which is by accident, two identical comments will be published simultaneously\n\nWhen you do that you edit your JSON file by adding two comments, and then publishing the diff of your JSON file.\n\nYou can fill up your JSON file to the maximum size allowed by the ZeroNet site per user.\n\n>It's a usability issue and should be fixed.",
				"added": 1561554536
			}
		],
		"1561515103_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 4,
				"body": "Regarding moderation, keep the textual content on your site, just hide it so people know what's being censored.\n\n>I feel like this is a bad idea. ZeroNet was created to prevent censorship, and moderating what other's post seems like it will lead to ZN becoming like the rest of the clearnet\n\nZeroTalk is moderated as well, the owner can ban a user, edit comments.\n\n> They could also have lists like Kaffie's spammer list for those who just want to click a button to block everyone on the list\n\nI like that more and is effective, you can either be your own moderator by having your own lists or choose your moderator by choosing a list created by someone else.",
				"added": 1561554623
			}
		],
		"1561542721_1KuQZvrUnzurrxTvTnjVzYXko33dVHyz3V": [
			{
				"comment_id": 5,
				"body": ">It would be better to have a version which runs completely seperated from any existing ZeroNet instances.\n\nWithout having to develop a new feature you could run a ZeroNet proxy and access it from multiple computers that way.",
				"added": 1561554784
			},
			{
				"comment_id": 12,
				"body": "> [geekless](#comment_59_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Multiple instances of ZeroNet work just fine under the Linux containers. But I guess the topic starter runs Windows. Does Windows have any containerization software, suitable for running ZeroNet? There should probably be something similar...\n\nVMWare, VirtualBox, QEMU could be an option",
				"added": 1561555590
			}
		],
		"1561471236_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": ">im confused\n\nIt's a Markov Chain text generating bot.",
				"added": 1561554856
			}
		],
		"1561491187_12X6g1LP25pT2XEMNR239xgrUnEktRVb9o": [
			{
				"comment_id": 7,
				"body": "Nope. I've wasted enough money on cryptocurrencies.",
				"added": 1561555134
			}
		],
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "@pineapples\n\n>my best guess is north korea.\n\nDon't overestimate their capabilities especially regarding technology.",
				"added": 1561555205
			}
		],
		"1559840057_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_857_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Here is how i migrated from ZeroNet py2 to py3 on MS Windows today. So far there does not seem to be problem. [...]\n\nThanks",
				"added": 1561555229
			}
		],
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 10,
				"body": "> [bananon](#comment_21_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): Why do you use these shared IDs? [...]\n\nIncredibly easy, you just download everything on ZeroNet and start building profiles",
				"added": 1561555357
			}
		]
	},
	"comment_vote": {
		"65_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"857_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}