{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1632902694,
			"title": "为什么科技在不断进步，人类却没有因此从工作中解放出来，反而工作时间增加了？",
			"body": "经济学家凯恩斯在上个世纪就预言，自动化极大地提高生产率，人类就能从繁重的工作里解放出来，每周只需要工作 15 小时。很显然，如今不止 996 盛行，数字技术时代催生出“一直在线”工作文化。钉钉、微信、邮件，工作不断蚕食私人空间。以往追求的工作生活平衡似乎变成一项不可能任务，绝大多数人已经不再能将工作和生活分割开来。疫情期间增加的大量远距离办公，也让许多人的全部生命时间都变成了工作时间。如何看待技术的进步没能给我们带来工作上的高休闲，反而让工作挤占生活，成为生命时间的主导？我们还有可能停下来吗？",
			"added": 1632902693,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1632902795,
			"title": "中国的财富集中到了什么程度？",
			"body": "《三体》作者刘慈欣曾写过一篇短篇小说叫《赡养人类》，文中曾描述过第一地球的历史：\n\n在我曾祖父的时代，世界财富的60％掌握在一千万人手中；\n在我爷爷的时代，世界财富的80％掌握在一万人手中；\n在我爸爸的时代，世界财富的90％掌握在四十二个人手中；\n在我出生时，第一地球的资本主义达到了极致顶峰，创造了令人难以置信的资本奇迹！\n99％的世界财富掌握在一个人的手中！这个人被称做终产者！\n虽然是科幻小说，有些情节是为科幻所作。但终产者的逻辑，却与现实世界相通：资本的运作使得绝大部分的财富持续向一小部分人汇集，越来越少的人4？开始掌握越来越多的财富，直到有一天，财富汇集停滞。\n\n这就是帕累托的二八定律，但显然，帕累托的二八定律还是太乐观了！\n\n\n\n\n\n高净值人群，金字塔尖的支配者\n\n很多人都好奇，中国的财富集中度现在到了什么程度？\n\n或问句大白话：富人到底有多富？\n\n根据前几日招行和贝恩公司联合发布的《2017中国私人财富报告》显示：\n\n2016年中国个人可投资资产在1千万人民币以上的高净值人群已达到158万人，人均持有可投资资产约3100万人民币。\n\n即这158万人共持有49万亿人民币的个人可投资资产。\n\n而全国个人可投资资产总体规模为165万亿人民币。\n\n好，就这短短两段话，笔者来个简单分析，为什么网上一公布有关资产和收入的新闻，大把的人都嚷嚷着被平均了。\n\n1、中国总人口已超过14亿人，这158万高净值人群只占国内总人口是0.1128%，千里挑一啊！\n\n2、但这158万人持有的49万亿可投资资产却占了全国个人可投资资产总规模165万亿的30%！\n\n换句话说：0.1%的人掌握了全国30%的个人可投资资产！\n\n如图：\n\n\n\n\n\n但是，这个报告我们还要更客观的来看待。\n\n因为个人可投资资产有个主要特征：它剔除掉了自住房产、非通过私募投资持有的非上市公司股权和及耐用消费品等资产的。\n\n也就是说，个人可投资资产是不包含自住房产。所以，这158万人持有的总资产还要再往上增加。\n\n大概多少呢？\n\n根据高净值人群来源地来看，基本都在京沪浙苏粤的区域。\n\n\n\n\n\n这些区域的房价有些地方高，有些地方低点，当然高净值人群主要自住还是在京沪深广，具体不好统计，平均一下，笔者就按每套自住房450万元计算，158万人*450万元=7万亿。\n\n所以，这158万人拥有的存量财富起码要在49+7=56万亿以上。\n\n而中国目前全国存量资产笔者估算大约在450万亿左右，这里面房产大约在300万亿左右。\n\n所以，在中国，有个真理：\n\n财富=房产！\n\n所以，我们得到一个推论：\n\n如果按存量资产计算，这0.1%人掌握了全国总存量资产的12.5%！\n\n但按可投资资产计算，这 0.1%的人掌握了全国30%的个人可投资资产！\n\n那问题来了，这0.1%的有钱人能不能左右房产价格？\n\n\n\n\n\n谁来决定房产价格？\n\n笔者这里只分析一线城市和强二线，这些城市市值占了全国的大头。\n\n我们来想一个问题，一线城市的一个小区二手房房价由什么来决定？\n\n答案是：由最近已成交的房屋成交价所决定。\n\n所以，一个小区，如果80%的住房都是刚需自住房，那么这些房子就类似股市里的非流动股份，并不进行交易。\n\n而剩下的20%的房源交易情况则决定了整个小区的价格。\n\n所以，我们经常说房价由有钱人决定，其实就是他们手里的投资性住房的交易极大程度决定了房屋的价格！\n\n或者说，大部分资产比如房子价格，就由这持有49万亿可投资资产的158万人来决定！\n\n他们如果大量抛售房产，房价就跌，如果他们继续大量购入房产，房价就会涨！因为不管房价涨跌，刚需自住基本都不会卖。\n\n那如何引导他们买房还是卖房的预期？\n\n这是当局要干的事儿！笔者做不了决断，但这篇文章要讲给大家一个更加令人深入思考的事。\n\n那就是一线城市的房屋终产者！\n\n\n\n\n\n房产如何出现终产者？\n\n什么是房屋终产者，就是一个城市的房屋开始越来越流入少部分人群手中。\n\n有人说，怎么可能呢？一个城市那么大，买房子的人那么多，房产持有人应该越来越分散才对！\n\n大错特错！\n\n我们先来看看最近炒的火热的一个新闻：\n\n前几天，上海市规划与国土资源局网站发布最新出让公告，出让分别位于浦东新区张江和嘉定新城的两处地块。\n\n两幅幅地块的土地用途都显示是“租赁住房”。本地块土地用途为租赁住房，所建物业严格按照“只租不售”模式管理仅用于出租，不得出售。\n\n这个炸弹新闻刚出来没两天，上海又扔出来一个小型核弹：\n\n7月7日上海公布了《上海市住房发展“十三五”规划》，内容讲了一件事：就是要加大住房的供给、发展租房市场。\n\n《规划》是这么说的：\n\n“十三五”时期新增住房供应总套数要比“十二五”期间增加60%左右，预计新增供应各类住房12750万平方米、约170万套。其中，商品住房约45万套，以中小套型普通商品住房为主；租赁住房约70万套；各类保障性住房约55万套。此外，以市场为主，新增代理经租房源30万套（间）左右。\n\n什么信号呢？就是国家在引导一线城市的住房市场往租赁市场转向。\n\n如果我们把当局这一年对于房地产的一系列政策串起来看：\n\n为什么限购限贷限卖限离？\n\n为什么现在国家要把房地产市场往租赁市场来导向？\n\n很明显，当局就是要把类似新加披的模式做个试点放在上海。\n\nWHY？\n\n很简单：\n\n因为如果再像2016年这么继续交易下去，那么未来，一二线城市必定会出现房产终产者！\n\n看不明白是吧？\n\n没关系，两个案例，我们慢慢分析：\n\n案例一\n\n两年，网上有些人自作聪明，写了一个00后没必要买房子的段子：\n\n一个00后的独生子女，爷爷奶奶那儿一套房子，姥姥姥爷那儿一套房子，再加上父母那儿的一套房子，未来一共可以继承3套房子；\n\n如果他/她结婚后，对方也是独生子女，继承情况一样，那么这个新家庭就会有6套房子。\n\n这仅仅是继承，如果他们自己再买一套，那么总计就有了7套房子。如果家里有多套房子的，那么还会继承更多，所以很多人认为，将来独生子女小夫妻拥有十多套房产的不在少数。那么这些人抛售房产，将使得房价下跌。\n\n现在大家看了这个故事，会觉得非常荒谬，一笑而过。但是，对于北上广来说，这故事背后隐藏逻辑并不简单。\n\n我们再来看这个假设的模型：\n\n以祖辈65岁，父辈40岁，孙辈15岁为例：\n\n目前：6个家庭14人，共计拥有6套住房\n\n假设15-20年期间，祖辈老去，孙辈结婚，\n\n则：3个家庭6个人，共计拥有6套装\n\n如果孙辈再次购房，则：\n\n3个家庭6个人，共计拥有7套住房。这还是这十几年不再多购入房产的情况下。\n\n我们会发现，通过继承，少数人群拥有越来越多的房产。\n\n随着老人老去，房屋被子孙集中化。\n\n而京沪这种以存量住房为主的城市，新进城的人绝大部分要使用大量现金和从银行拿到的房贷从这些人手中购买。\n\n中国，越是大城市，越是讲究门当户对。\n\n这就导致了一个现象，本地找本地，有房者找有房者，或者有房者找有钱者，而有房者找到有钱者后，财富更多，为了固化资产，还会买房。\n\n这是长期趋势。\n\n没有几十年根本停不下来。\n\n案例二\n\n我们再来看第一个案例留的尾巴问题：新进城人群的购房问题。\n\n当房价短期加速上涨的时候，比如去年，一线翻番，二线普涨40%-80%，有经济实力买房子的人出现了几何级数的下降。\n\n因为居民收入和存款短期根本无法跟的上这么快的房价涨幅。\n\n一线城市动辄一套要大几百万、上千万。\n\n二线城市一套房也动辄需要小几百万。\n\n有能力购买的人群数量被动越来越少。\n\n不借用银行的信贷力量，总价这么高的房子根本撬不动。\n\n当银行信贷紧缩，首付和利率越来越高，这时候，只有有房者才能买的起房子。只有房产才能撬动房产！\n\n比如这些一二线城市的土著和早些年在一二线打拼购买房产新住民，名下基本都有房。\n\n对于这些人来讲，买房子基本可以0首付：\n\n比如某核心城市，房子单价4万，100平米房子需要400万，首付需要120万，二套则需要240万。\n\n对很多想移居这个城市的外地一般家庭和大学刚毕业要在这里工作的大学生来讲，有没有资格先另当别论，单这个首付就能刷掉绝大多数人。\n\n但是，对于在这个城市有房者来讲，购买这套房子就非常轻松。\n\n把自住的房子做抵押，贷出钱做第二套首付，又或者夫妻离婚，把第一套房子卖给对方，从银行拿到钱后，去做第二套的首付，想想办法，都能操作。\n\n于是，当市场的持有者通过这两个案例不断流转的时候，房产会向越来越少的群体聚集。特别是京沪深这些城市边界已到极限，人口被控制，存量房既定，二十年后，地产终结者们时代就会到来！\n\n现在理解上海的一系列政策了吧，一个城市维持繁荣毕竟需要毕业大学生、年轻劳动力来支撑，如果一线城市不转变为租房市场，那么高昂的房价和地产寡头会使得没有新鲜的血液进入这个城市，未来就是死水一潭！不如早些做准备，避免地产终产者的寡头时代带来的负面效应。\n\n而租赁市场的转向，则是房产终产者的终结者，虽然难以平抑房价，但确是制衡房产终产者寡头崛起的强大力量！\n\n\n\n\n\n后记：\n\n财富不断融入金字塔尖这个趋势是人类社会使然，纵观人类历史，难以避免。相对于房产来讲，现金、股权这些流动性强的资产更容易不断向金字塔尖汇聚。\n\n这一年多来，老百姓手里的积蓄都花的大半了，存款减少，负债变多，反馈给市场的预期就是短期涨不动了。\n\n特别是这一年多投资炒房的，赚的盆满钵满，所以，各种限售政策，就是让这帮投机炒房的死掉一批。所以，房地产市场也要消停一段时间。\n\n但是，别忘了，如果你看好一个城市，房子就是这个城市的股份，一个城市有500万套房子，一套房子就是这个城市总股本的1/5000000。\n\n只要这个城市持续发展，经济向上，资金就在这儿，财富就在这儿，产业、就业都在这，人就会不断流入……\n\n这个城市值钱了，股份就贵了。\n\n所以，这两年该怎么办？相信你心里已经有数了，不要等房产终产者时代到来！",
			"added": 1632902793,
			"parent_topic_uri": "1571186422_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1632902694_13L3aCt2BtPysrcet1yh2wRfW3U7yZLqqz": [
			{
				"comment_id": 1,
				"body": "第一，我们今天的科技并非如我们自己所吹嘘的那样那样发达；第二，因为资本发展科技从来就不是为了把人从工作中解放出来，而是为了资本更加快速地积累。\n\n所以，醒醒，别做梦了！",
				"added": 1632903092
			}
		]
	},
	"comment_vote": {}
}