{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1631347456,
			"title": "Warriors",
			"body": "It’s good to see more \n[Warriors with Epic Passions  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1631347069_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/Epic+Passions) Emerge! \n\nAwakened-up technicians should work on promotion of decentralized web willingly, because to promote freedom of speech is in fact to protect freedom of breath that concerns everybody's living environment! \n...  \nThose brave gentlemen, such as [Balancer](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1631153521_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Brave+Writers),\n[Victor Thorn ](https://www.amazon.com/Hillary-Bill-Murder-Clinton-2008-05-03/dp/B01FIXXNHA),\n[Mr Xu Zhang Run ](https://www.amazon.com/gp/product/1715096819/)\n and \n[the Legendary Warrior Alexei Navalny ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Who+s+the+Most+Respectable+Warrior+in+Russia)\n have similar pursuit of justice. \n**Their souls spark with Epic Passions for a new era of civilization on the planet!**",
			"added": 1631347455
		},
		{
			"topic_id": 1631584950,
			"title": "Zeronet To thrive like Bitcoin ...",
			"body": "To let Zeronet thrive like Bitcoin, some other efforts are needed, such as \n[User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine)\nAs NoFish is not available to do it, it’s suggested that other enthusiasts create new forums, and realize the decentralized features step by step, break \n[50 K limit ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)\n\nand accommodate more flexible ID creation mechanism such as Kaffle ID or KxoID.",
			"added": 1631584948
		},
		{
			"topic_id": 1631959530,
			"title": "Lee Wen Liang Act",
			"body": "Lee Wen Liang Act \n— International Whistleblower or Crime Exposure Act \n\nWhen you surround an army, leave an outlet free. Do not press a desperate foe too hard. Such is the art of warfare.\n围师遗阙，穷寇勿迫，此用兵之法也。\nThe Art of War — Sun Tzu\n\nSince Trump Administration of 2016, America has made tremendous efforts to awaken up more and more allies on the imminent danger imposed by the CCP against the civilized world. \n\nAfter the controversial 2020 Election, some policies by Trump Administration were changed, with some measures further strengthened, while many tactics adjusted. \n\nAfter a peculiar withdrawal of military from Afghanistan, more disputes occurred. Despite a big chaos of rights and wrongs in the cyberspace, there're still some honorable military leaders who haven't lost their minds yet. \n\nhttps://video.foxnews.com/v/6272827874001/ \nRetired general calls for Milley's resignation, says military has lost confidence in Joint Chiefs chair. \n\nFrom the phenomena, it can be seen that the Biden Administration indeed made some efforts on rallying up a big team of allies to support America's fighting against the CCP's expansion and invasion by coronavirus. \n\nIf those efforts are indeed meant to revitalize America's fine culture, then further efforts can be made to accelerate the collapse of the CCP, such as establishing a system of International Whistleblower or Crime Exposure Act, to encourage more people who know the inside stories of the true situation to imitate the brave example set by Chinese Doctor Lee Wen Liang who simply exposed the crimes of the dangerous virus by a good doctor’s conscience. , without the intention on obtaining either the secular fame as a \"Hero\" or other physical interest in this over-entertaining age with over-flooding IT games polluting the mental world of many people all over the world!  \n\nIt's easy to see the necessity of a special legislation on International Whistleblower or Crime Exposure Act.  The details should be decided by law experts. \n\nBased on analysis of many events, some Christian associates like to suggest a few points as below. \n\nAccording to some netizens' feedback, in 2020, China's former vice minister of public security, Sun Lijun indeed had some strong ideas to expose the crimes of the CCP on the Bio-weapon production, but due to many crime activities participated by Sun Lijun himself, he hesitated for too long until it’s too late to take action.  Much of his hesitance was caused by the event of Wang Lijun’s failure in 2012, as the former Chongqing police chief was eventually rejected by America’s consulate in Chengdu, which was on the territory of the CCP and could be easily besieged by them. \nhttps://www.secretchina.com/news/gb/2021/09/14/983734.html \n\nSimilarly, in 2018, another hooligan leader in the CCP regime, named Meng Hong Wei, who was former Intepol President, once worked and lived in France, which made it more convenient for him to escape from CCP’s persecution. \nhttps://www.citizenpowerforchina.org/statement-on-the-meng-hongwei-%E5%AD%9F%E5%AE%8F%E4%BC%9F-incident-from-citizen-power-initiatives-for-china/ \nBut hooligan Meng also hesitated too much, mainly because there’re too many crime activities committed by himself, partially due to other complicated factors such as Wang Lijun's failure in 2012, and Donald Trump’s over pride on his personal friendship with Dictator Xi, since at that time Coronavirus didn’t invade America yet and President Trump indeed never cared much about a tough fighting against the CCP until the Covid19 broke out in 2020, and seriously hit America just as it hit the Chinese people! \n\nSo the major goal of the International Whistleblower or Crime Exposure Act is to encourage people to bravely rebel against the brutal CCP jungle system. \nSome provisions may go as follows. \na) Strong support will be provided by international community to those people who bravely fight back against the jungle dictatorship. \nFor whistleblowers who are able to escape CCP’s territory (like Meng Hong Wei’s case in France), they needn't worry about death-threatening danger, as strong measures will be provided by America and its allies. \nb) For some people who might have committed crimes against humanity in the past, they will be exempted from death penalty if they can provide significant evidence of those terrorist gang's crimes. \nc) For people who didn't join in the crimes and are brave enough to take the whistleblower action like Chinese Doctor Lee Wen Liang, besides strong support on security measures, there'll be awards to encourage their brave deeds.  \nd) When necessary and mutually agreed upon by the parties concerned, those whistleblowers' brave deeds can be reported by medias, to promote the heroic spirit, and to encourage more people to fight back against the jungle dictatorship system! \n\nIn short, \n###this is an unusual period of history. So unconventional methods should be adopted, \nto accelerate the collapse of the atheism jungle dictatorship of the fake CCP in East Asia.\n\nYou and I have a rendezvous with destiny. We'll preserve for our children this, the last best hope of man on earth, or we'll sentence them to take the last step into a thousand years of darkness! \n\nWhen more and more people join in the bright course, it's possible to see a new tide of Puritanism Resurrection emerge in America, accompanied with the glorious tide of freedom that government of the people, by the people and for the people, shines eternally on the planet! \n",
			"added": 1631959527
		},
		{
			"topic_id": 1631984082,
			"title": "Are P4 Laboratories of Coronavirus a joke?",
			"body": "Certainly not!  \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn/I+WAS+WRONG+ABOUT+COVID+WAS+THE+FLU \nSome queer topics may be intended to produce chaos only, either to distract people’s attention, or simply waste the tiny data space of 50KB set by NoFish. \nThe strange topics are either produced by fifty-cent party members of CCP, or mentally distorted Americans who are seriously brainwashed by CCP polluted medias. \n\n### Any Russian guys available? \nPlease help check a simple question.\nPutin's palace. History of world's largest bribe \nhttps://www.youtube.com/watch?v=ipAnwilMncI \n\nAs there's NO crazy GFW data blockade in Russia, the highly popular video made by Aelxei Navalny will become one of the most overwhelming videos in 2021, likely to achieve billions of views when the GFW system collapses in Asia! \nA small question here. \n### How many people in Russia has got the idea of Navalny’s exposure of Putin’s betrayal against Russian nation? \nSince there’s no GFW, maybe more than 60% or 70% of Russian people already see the situation clearly? \n\nThe information will be helpful for some analysis work to be done by other associates.  \n[When Rage Conquers Fear, Revolution Will Go like Volcano!  ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1631802582_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/When+Rage+Conquers+Fear)",
			"added": 1631984078
		},
		{
			"topic_id": 1632475029,
			"title": "Special Tactics",
			"body": "The more compromise is made, the more dangerous it can be!\n\nSome policy adjustments can embolden the expansion of terrorism.  The description of China as the most dangerous rival of America is now adjusted to be a strategic competitor. \n\nTherefore, terrorism activities increase rapidly on the planet. Taliban regime rose again in Afghanistan, while millions of illegal immigrants pour into America, which \n##further accelerates the spread of coronavirus mutations. \n\nIn order to curb own over-crazy conflicts, mutual deterrence strategy has to be strengthened, with the emergence of Australia as a nuclear power after the Aukus deal was done. \nhttps://www.cnn.com/2021/09/17/australia/nuclear-submarines-aukus-explainer-intl-hnk-ml/index.html \n\nSmaller nations have to unite up and act in concert.   \nThe China-Lithuania Rift Is a Wake-Up Call for Europe \nhttps://foreignpolicy.com/2021/09/22/china-lithuania-taiwan-eu-nato/   \n\nMore and more people see the necessity to enhance relationships with Taiwan. At the same time, it’s also clear that no one would like to see a crazy nuclear war occur between a few nuclear powers. \n\nSo some flexible tactics should be adopted. \n\nDuring the cold war time, in order to better fight against the former Soviet Union, an **ambiguous strategy** was adopted by the USA on the definition of China — it's not an important matter whether it'd be represented by Republic of China (中华民国) that respects the modern civilization based on Three Principles Of The People as advocated by Dr. Sun Yat-sen, or by Communism Dictatorship China which boasted itself to be a \"People's Republic of China\", but in fact tramped upon human rights like ants, and should better be defined as an atheism dictatorship jungle, or at least **NOT a republic**, as could be seen by more and more people.\n\nAt this unusual stage of history, all nations who seek to enhance relationships with Taiwan may adopt a flexible policy to promote the good.  During the process to resume the diplomatic relationships, a clear statement can be made as follows: \n**(The statement is a draft, the bilingual edition will be more powerful.)**\n\n##Statement on Taiwan Relations and One China Policy \n\nTaiwan represents the Republic of China. All the civilized nations on the planet **respect One China Policy** as much as they cherish the reality of **only One Planet suitable for human civilization in the Milky Way**, and therefore all the people over the world encourage a peaceful **reunification of China** based on the Three Principles Of The People as represented by Republic of China. The Constitutional Democracy inherited by ROC was also firmly pursued by many Red Noblemen. One prominent example is Xi Zhong Xun, who was the father of Emperor Xi Ji Pin. \n\nIn the past, many people in the West attached importance to trade and economic cooperation with the CCP regime.  Those activities were mainly triggered by Westerners’ respect of Emperor Xi's father Mr Xi Zhong Xun who fought bravely against the brutal persecution by the Cultural Revolution in China and made great contribution to the Reform and Opening revolution in the 1980's. \n\nTo keep the Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. \n####It complies with the glorious history of Xi's family legacy.  \nIt deserves nationwide support by the whole Chinese nation, by all Chinese netizens and soldiers.  \n\nThe Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, when necessary, the civilized nations may resume efforts on promotion of the special relationships with mainland, China. \n\nSimplified Chinese Version:\n##关于台湾关系和一个中国的政策声明\n\n台湾是中华民国的表率。地球上的文明国度都高度尊重一个中国的原则，就如同他们知道：银河系里只有一个星球适合人类生存一样。\n因此，地球上的所有人民都鼓励在“三民主义”的基础上促进中国两岸统一。\n众所周知，中华民国的“三民主义”精神与习近平的父亲习仲勋先生以及很多其他“红军”先辈所追求的宪政民主是相符合的。\n过去，西方有很多人重视和中共政权的贸易经济合作。那些活动的开展，主要也是因为人们尊重习近平的父亲习仲勋先生的光辉历史。\n习仲勋先生曾因为反对文化大革命的压迫而英勇奋斗，并为1980年代的改革开放做出了巨大贡献 。\n保持改革开放政策，有助于保持更好的透明度，并更好地对抗新冠病毒所造成的全球性瘟疫。 这种努力也有利于保护习氏家族的光辉历史， 应该得到整个中华民族的全面支持。\n应对全球性的冠状病毒瘟疫，需要地球上所有国家的共同努力。 为了促进新文明的实现，在必要的时候，文明国度会再次努力促进和中国大陆之间的各种合作。\n\nTraditional Chinese Version:\n## 關於臺灣關係和一個中國的政策聲明\n\n臺灣是中華民國的表率。地球上的文明國度都高度尊重一個中國的原則，就如同他們知道：銀河系裡只有一個星球適合人類生存一樣。\n因此，地球上的所有人民都鼓勵在“三民主義”的基礎上促進中國兩岸統一。\n眾所周知，中華民國的“三民主義”精神與習近平的父親習仲勳先生以及很多其他“紅軍”先輩所追求的憲政民主是相符合的。\n過去，西方有很多人重視和中共政權的貿易經濟合作。那些活動的開展，主要也是因為人們尊重習近平的父親習仲勳先生的光輝歷史。\n習仲勳先生曾因為反對文化大革命的壓迫而英勇奮鬥，並為1980年代的改革開放做出了巨大貢獻 。\n保持改革開放政策，有助於保持更好的透明度，並更好地對抗新冠病毒所造成的全球性瘟疫。 這種努力也有利於保護習氏家族的光輝歷史， 應該得到整個中華民族的全面支援。\n應對全球性的冠狀病毒瘟疫，需要地球上所有國家的共同努力。 為了促進新文明的實現，在必要的時候，文明國度會再次努力促進和中國大陸之間的各種合作。\n\n##Remarks: \nThe spread of Coronavirus all over the world has proven that \nif there's no freedom of speech in East Asia, there's no freedom of breath for people in Europe or America either! \n\nTo secure free expansion of Christendom in East Asia has become a mission for our generation. It concerns the living environment of the global civilization, as the Covid19 affects the freedom of breath by all people on the planet, whether they are senior tycoons or young children!  \n\nAs the atheism regime doesn’t allow any physical organization by civilians in mainland China, Pearl Peace sees some special ways to launch a Peaceful Revolution in China. \n\nThere's a huge number of population on the vast land of China, among whom quite some people are still brainwashed by the atheism regime. The Peace Revolution in China will be a little different from other countries. \n\nTraditional Confucius culture often emphasizes loyalty to the country (to the emperor in the past).  Many people made mistakes to support CCP leader Xi Jin Ping, due to their respect of Xi Jin Ping’s father Xi Zhong Xun who did fight bravely against the Oppression by the Atheism Regime itself, and for the Reform and Opening revolution in the 1980's.  \n\nMany people’s mindset is still limited by the Confucius medieval theory of loyalty. In order to reduce the scale of potential conflicts to the minimum level, the best way to launch Peace Revolution is to appeal to all Chinese people to protect the glorious history of Xi's family legacy left by Xi Zhong Xun, as Xi Zhong Xun himself supports Constitutional Democracy with freedom of speech, freedom to worship God.  \n\nIn short, Peace Revolution in the name of protection of Emperor Xi’s glorious family legacy can avoid large scale bloody massacre in the potential conflicts, since many military people’s mindset is still limited by the medieval Confucius loyalty. \n\n\n\n## Additional information: \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, Civilized Nations appeal righteous people all over the world, including Chinese people, Chinese army, and those grassroot CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, to stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\nThe above will be enough to launch a special Propaganda War, which will accelerate the collapse of the Atheism Gang of the FAKE CCP. \n\nWith the acceleration of the CCP’s collapse, sustainable development of human civilization can be kept for many generations!  \n\nSome details are discussed by cyberspace activists on ZeroNet (https://zeronet.io/), a highly-encrypted platform based on Bitcoin technology.",
			"added": 1632475024
		},
		{
			"topic_id": 1632475929,
			"title": "War, Virus, Revolution …",
			"body": "Below information is moved from \n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598453797_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY \n\n###The Humiliated Situation to be Changed … \n\nThe Coronavirus is just one of the pandemic weapons spread by \"the CCP” in mainland, China, which is in fact **\"an Atheism Gang of the Fake CCP”** that completely destroys traditional Communism, as represented by the pursuit by Emperor Xi Jin Ping’s father Xi Zhong Xun, who was himself brutally persecuted by the atheism regime. \nIt was spread purposefully,  with the vicious aim to destroy the free world and the modern civilization.  It’s part of the Unrestricted War.   \n(Note: the term **”CCP”** hereafter always refers to the **\"the Atheism Gang of the Fake CCP”, the details of which are available in separate topic** —  [Liberate Hong Kong, A New Approach …  ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/)\n\n \nAs a new type of warfare, the Unrestricted War means fighting in both tangible traditional way, and the intangible way, mainly in the **information battlefield** that includes cyberspace war, espionage infiltration, **culture pollution, propaganda war,**  financial war, besides biochemical weapons like the special pandemic virus of Covid19… \n\n###1) The Unrestricted War \n####1.1) Traditional Hot War Not Feasible \nIn August 2020, there’s a well-calculated action by “the CCP” to intensify their threaten against Taiwan, during the time when Alex Azar, the U.S. health secretary visited Taiwan. \nhttps://www.forbes.com/sites/davidaxe/2020/08/10/chinas-jets-are-pushing-closer-and-closer-to-taiwan/#7094886343f3  \n\nThe \"CCP’s\" action was foreseen by the US-Japan-Taiwan Alliance force.  Several F16 fighters took off, and the \"CCP”’s J10 fighters had to retreat after short time invasion of Taiwan’s Sovereignty of Air-Defense Identification Zone. \n\nDonald Trump apparently made mistakes by underestimating the toxicity of the coronavirus and the GFW’s poison. After the Covid19 pandemics going out of control, the Trump Administration was anxious to see a certain scale of hot war break out at Taiwan Straights or South China Sea, so as to enhance people’s ratings on his presidential job. \n\nHowever, **the fake \"CCP”, as the most vicious Atheism Gang on the planet, are very crafty.**  Due to brutal dictatorship that resulted in backward technology innovation, they could see that there’s no advantage in conventional weapons. So they dared not fire the first shot. \n\nOn the US side, due to strict Rule of Law enforced in the military, the US army could not fire the first shot either. \n\n**So solution by means of hot war seems not workable. **\n\n####1.2) The Intangible War Never Stops \nDue to failures of innovation on conventional weapons, \"the CCP's” major threaten against the free world relies on their nuclear weapons. \nWith hundreds of warheads, plus intercontinental missiles,  \"the CCP's” threaten is certainly hundreds of times worse than the North Korea nuclear issue. \n\nSo a few hooligan leaders of the Atheism Gang of the Fake CCP could behavior much more barbarically than North Korean dictator Kim Jong-un.  The crazy Hong Kong security law is just one of the examples. \n\n**To confront such an abnormally vicious atheism gang, some special means should be adopted, so as to accelerate the collapse of the “CCP”. **\n\n###2) Special Means to Fight against the \"CCP” \n\"Know the enemy and know yourself; one hundred battles, not defeated\"  — Sun Tsu’s Art of War \n\nAs to the special means, some netizens have discovered a new approach to accelerate the collapse of the atheism gang of the FAKE CCP. \nDetails are presented in other topics, such as \"Liberate Hong Kong\", and  **\"A Special Tactic by the White House\". **\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House\n\nBefore specific means are adopted, some analysis of **the special features of the Atheism Gang of the Fake CCP should be made.** \n####2.1) The functions of the GFW \nThe notorious GFW is known by almost everybody in the free world. However, on the land of China dominated by the atheism gang, at least more than 60% of ordinary people don’t know what is GFW, though they often use internet on WeChat, TikTok, etc. \n\nWhy are there so strange phenomena? \nIt’s because **the Most Scary Thing** for the atheism gang is not confrontation against the West Civilization, but failures to brainwash the large scale of population that dwells on the continent in East Asia. \n\nFor the atheism gang of the fake \"CCP”, they’re always worried about the trend that the percentage of people awakened up will be higher and higher, which will automatically end their dictatorship. \n\nGFW certainly can’t be used as weapons to fight against American troops.  But there’s high spending on constant upgrading of the GFW system. Together with other huge expenditures on suppressing down domestic Chinese people’s fighting for freedom, the total spending on Stability Maintenance (called as Wei Wen in Chinese Ping Yin) has surpassed **the \"CCP’s” expenditures on military!! **\n \n \n###2.2) The Necessity to Take Special Means\n####2.2.1) Simple Facts of the Atheism Gang’s Danger\nFacts have proven that not only many ordinary citizens disappeared totally on this planet, due to the Covid19 pandemic weapon, some top-rank leader’s family members are also knocked down by the coronavirus. \n\nThere’re wide-spread rumors that Donald Trump’s brother Robert Trump died of diseases triggered by infection of the coronavirus, while Vladimir Putin’s daughter was also seriously affected due to the special demand for power maneuver by Putin, who required his daughter Katerina Tikhonova be used in an experiment on Covid19 vaccines, by forcing her to inoculation of the \"sputnik 6” vaccine on the virus, and then acute fever occurred on Katerina Tikhonova. \n\nWhether Katerina is still alive or not, needs further verification.  \nHowever, all the facts can simply prove that the Covid19 virus can attack any person, whether they’re of Royal aristocracy descent, or grassroot family background. \n\n### 2.2.2) The Humiliated Situation of Trump to be Changed … \nBefore the Covid19 outbreak, Donald Trump often emphasized his personal relationship with \"CCP’s\" President Emperor Xi.  Due to low rating on his presidential job, now Trump even refused to do communication with Xi. \n\n**The Special Tactic by the White House in fact belongs to the scope of Propaganda War in the new type of Unrestricted Warware. **\n\nBesides Donald Trump, many people in China, including **Second-generation Red Aristocrats** made mistakes by underestimating the style and the craziness level of Emperor Xi’s dictatorship, since Emperor Xi’s father **Mr. Xi Zhong Xun was indeed a great hero**. ** Mr Xi Zhong Xun insisted on fighting against the oppression by the Cultural Revolution, despite being brutally tortured by the regime …   Mr Xi Zhong Xun is not only a hero among many ordinary Chinese people, but also among many grassroot CCP members ** (many of whom are not much different from ordinary American citizens, except a little over-emphasis on atheism mentality due to the long time brainwashing by the \"CCP\" regime). \n\nA lady named Chai Xia exiled to the USA, so as to seek better ways of fighting.  In the past, Chai Xia also supported Emperor Xi’s anti-corruption movement, which only intensified more corruptive dictatorship. \n\nSo there’s no wonder that Donald Trump could bring more humiliation to himself, \n###if he’s NOT prudent enough about his personal relationship with Dictator Xi.  \n\nWith the Special Tactic by the White House ,  the Propaganda War will be waged by the USA in a very graceful and polite way. \n \nWith the bona fide clarification that \n**Donald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely against the oppression in the Cultural Revolution, and made great contribution to the Reform and Opening revolution in the 1980's. **\nTo keep the **Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. It complies with the glorious history of Xi's family legacy. It deserves nationwide support by the whole Chinese nation. **\n**The Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, Donald Trump may resume communication with President Xi when necessary. ** \n\n(The bilingual version will be more powerful, details of which are in below URL: \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House ) \n\nIt’d help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his **personal friendship with a vicious dictator.**  \nIf there’s anything for Donald Trump to apologize, then the White House can make further apologies by stating that \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, the White House appeals righteous people all over the world, including \n###Chinese people, Chinese army, and those grassroot CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, \nto stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\n\nThe above will be enough to launch a special **Propaganda War**, which will accelerate the collapse of the Atheism Gang of the FAKE CCP. \n\n###2.2.3) The Reality of Sensitive Election Season \nThe special part of  2.2.2) The Humiliated Situation of Trump to be Changed …  is based on hypotheses of an ideal operation by a good team with wise people who seriously respect America’s constitution and the universal value of gun rights and human rights. \n\nIn reality, quite many people keep speculative mind, including the merchant-minded President Donald Trump.  \n\nThere’s very harsh criticism against Donald Trump.\nhttps://www.brookings.edu/blog/order-from-chaos/2020/07/27/pompeos-surreal-speech-on-china/ \n**All the criticism goes to the points well! **\n\n**The only pity is that the author doesn’t indicate another simple fact — despite all the serious problems, Donald Trump doesn’t have complicated business relationship with East Asia, so compared with other people who may be charged with treason against America, \n####Donald Trump is NOT the worst candidate. **\n\n**There’s also powerful exposure by Donald Trump’s niece Mary Trump \nhttps://www.youtube.com/watch?v=guoiy0bZbT8 \nThe \"Most Dangerous\" Man. ** \n\nHowever, before the trouble of coronavirus is settled, no one can be more dangerous than Covid19!  \n\nFurthermore, mutations of coronavirus have emerged. \nFirst Documented Coronavirus Reinfection Reported in Hong Kong \nhttps://www.nytimes.com/2020/08/24/health/coronavirus-reinfection.html  \n\nIt means that without thorough discovery of the earliest origin of the virus in Wuhan, China, people’s knowledge of the virus may be limited.  The vaccines developed in the past may not work effectively on the sophisticated mutations of Covid19. \n\n####To settle the coronavirus also requires a total collapse of the Atheism Gang of the FAKE CCP. \n\n**To fight against the coronavirus, and to eradicate the atheism gang who specifically spread the virus on purpose,  the \"Most Dangerous\" Man Donald Trump is in fact not dangerous enough.  ** \n\nNo leaders are perfect.\nhttps://www.masterclass.com/classes/doris-kearns-goodwin-teaches-us-presidential-history-and-leadership  \nAll people learn to grow on the journey of life.\n\nThe Trump’s family can also be victims of the virus, or victims by the ShaodowGate … (details available in additional remarks) \n\nBut he has the unusual capability to fight back, so people will stand up with Donald Trump. \n\n###Additional Information:\nAs can be seen by some people, there’s a project Pearl Peace, focused on Christendom expansion in East Asia, especially on the atheism land of China, where churches emerge up one after another, despite various tough obstacles. \n\nAs to the Propaganda War, besides the Special Tactic by the White House, there’re some other tactics such as changing the Chinese style of VoiceOfAmerica, with more powerful elements added into the Propaganda War, as discussed by a famous team **APAT \"(All People Act Together)\", who focus on a National Uprising in China**.  \n\n\n**The Special Tactic of Propaganda War**,  appeals all people to support a peaceful revolution coming on the way (in fact mainly targeted on military people as a special effort), but avoid the deterioration of Trump's personal relationship with Emperor Xi.  In fact, all the efforts are focused on the positive trend — to protect the glory of Xi's glorious family legacy left by his father Xi Zhong Xun. \n\nEmperor Xi might be not educated well enough to understand the special efforts.  However, many descendents of other Princelings will response positively, since all of them are extremely anxious just like Ren Zhi Qiang and Wu Xiao Hui (Deng Xiao Ping's grand son-in-law) who were jailed without justice. \n\n**More importantly, the Special Statement will help Donald Trump** \n## continually benefit from his relationship with Emperor Xi, \n** making it as an advantage, instead of as a shame now due to the Coronavirus going out of control!! \n\nSome of the special ideas are inspired by Miles Yu’s peculiar approach. \nMiles Yu, a key player in new approach to Beijing\nhttps://www.washingtontimes.com/news/2020/jun/15/miles-yu-mike-pompeo-adviser-helps-form-china-poli/ \n\nMiles Yu’s methodology to differentiate the CCP from Chinese people is a very clever strategy!  On the aspect of protecting America’s homeland, such strategy is enough. Prohibiting all CCP members from entering the USA is a good way to reduce the flooding virus deeply permeated in American society. \n\nIn order to fight back in the Unrestricted Warfare, such methodology can be further fine-tuned, such as **differentiating ordinary grassroot-level CCP members from a small group of top-rank hooligan leaders**.  \n###The number of grassroot CCP members is above 90 million, \nand by extension of their family relationships, it’s indirectly related to hundreds of millions of grassroot Chinese people. \n\nSo in order to fight back more effectively, further fine-tuning of tactics will produce special results once the policy makers in the USA recognize **the big potential of flexible tactics in this Unrestricted Warfare**.  \n\n###Special Remarks: \nAt a special stage of history with Unrestricted Warfare that includes Covid19 pandemics concerning the basic freedom of breath for all people living on the planet, implementation of good tactics needs some fundamental consensus — that  \n**there are no absolute atheists, for one simple reason — if they can’t deny the fact that each individual has a certain sense of \"holy space\" in their soul, which may be related either to the \"sacred\" love of their loved ones, or the \"holy” passion of their occupation, then they can't deny the fact that there’s a certain sense of \"holy” God image in their soul. This can be taken as a simple \"scientific” logic, a common sense, without the need of large scale of geometry formulas to prove the logic.**\n\nBased on this consensus, some wise people will see that most of the  CCP members are in fact victims by the brainwashing machine of the atheism gang. **So long as they haven’t committed serious crimes in the past, most of them can be pardoned for their mistaken choice of the atheism ideology. **  \n\nTo fight back by a special Propaganda War requires serious mentality. \nDonald Trump’s biggest enemy is the capricious mind of his own. \n\nThanks to the special constitutional system, no one can distort America at their personal will.  Though it took several months for Trump to see that his attitude on refusing to wear face masks was wrong, once he changed his mind, he does look to be more serious on some seemingly-trivial issues, which in fact have significant influence for leaders at a turbulent time.   \n\nThe Trump’s family can also be victims of the virus, or victims by \n###the ShadowGate … \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate \n\nThe manmade pandemics may make some of the top-rank US elite fight back more aggressively?  If so, the probability may be above 50% for special tactics on the [Propaganda War  …  ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House)\n to be adopted?",
			"added": 1632475923
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1631096713_1SBoneRDYzA3WAjaanYkhQKWtfkY2ZxCZ": [
			{
				"comment_id": 1,
				"body": "There can be nationwide movements on Trumpism Revolution. Gradually, the situation will become more favourable for Trump supporters.",
				"added": 1631238944
			}
		],
		"1597601940_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 2,
				"body": "It’s good to see more [Warriors with Epic Passions  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1631347069_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/Epic+Passions) Emerge!",
				"added": 1631347864
			}
		],
		"1631959530_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 3,
				"body": "The above is just ideas by some associates.\nAs there’re many details involved, if there’re different ideas, please share your comments.",
				"added": 1631961284
			}
		],
		"1631802582_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 4,
				"body": "[Whistleblower or Crime Exposure Act ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1631959530_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/Lee+Wen+Liang+Act)\n###**to accelerate the process of revolution in both America and Asia, including Russia! **",
				"added": 1631969474
			}
		],
		"1631984082_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 5,
				"body": "Alexei Navalny \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue \nPUTIN PROTEST Anti-Putin protesters clash with cops across Russia as 1,300 arrested in -15C temperatures over poisoned Alexei Navalny\n;;\n[Are P4 Laboratories of Coronavirus a joke? ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1631984082_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/Are+P4+Laboratories+of+Coronavirus+a+joke)\n## Please give a reply on Unlimit Talk, to reduce the obstacles of [The 50 K limit ](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Some+Self+Contradictory+Problems)\n.",
				"added": 1631984384
			}
		],
		"1631979939_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 6,
				"body": "For the operation of a large society, one or two candles can be easily extinguished by greedy politicians with crazy pursuit of power. \nThat’s why the fathers of the United States such as Washington, Jefferson, etc. insist on the Gun Rights system to protect the constitution. \nSome elites may betray their motherland, or even military leaders can defect the great nation. But the American nation, as a whole, will not totally collapse at turbulent time of history. \nThen through the awakening up of more and more people, law and order will be restored step by step.",
				"added": 1632022438
			}
		],
		"1632475929_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 7,
				"body": "The above is an old topic in 2020 (moved from ZeroTalk forum run by NoFish). \n[The Humiliated Situation to be Changed …](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598453797_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/The+Humiliated+Situation+to+be+Changed)\nThe above is part of a project focused on expansion of Christendom in East Asia, partially related to a tough question — **how to accelerate the collapse of the Atheism Gang of the Fake CCP in East Asia**. \n\nSeveral team members are from Asia. Though some senior Christians live in the USA, as they mainly cared about religion activities instead of politics in the past, so Pearl Peace team are not sure about the feasibility of the above tactics. \nIs there any one who is familiar with the administration team under Trump government? \nIf there’re better ideas, please share your comments. Thanks. \nGod Bless America!",
				"added": 1632476192
			},
			{
				"comment_id": 8,
				"body": "Another old topic is save here.\nA Special Tactic for Donald Trump to Win … \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598449828_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY  \nThe below content is a draft of statement that may serve as reference, if some leaders decide to fight back more aggressively with **a special Propaganda War, at the special stage of history with Unrestricted Warfare already launched by the Atheism Gang against the whole civilized world with the flooding of coronavirus. **  \n\nThe bilingual edition will be more powerful. \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House \n\nEven if it’s not used at all, some of the discussion may still serve as reference for leaders who like more flexible tactics. For example,\nbased on Miles Yu’s strategy that differentiates Chinese people from the CCP, further fine—tuning of tactics can be applied on the counterattack in this Unrestricted War, by further differentiation of the 90 million grassroots CCP members from a small group of top-rank hooligan leaders.  \nWhen such flexibility is adopted, America will win the war at an early date. \n\n\n##Special Statement \nThis is to clarify that \nDonald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely against the oppression in the Cultural Revolution, and made great contribution to the Reform and Opening revolution in the 1980's. \nTo keep the Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. It complies with the glorious history of Xi's family legacy. It deserves nationwide support by the whole Chinese nation. \nThe Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, Donald Trump may resume communication with President Xi when necessary.\n\n###Chinese version ... \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House \n... \n\n###Remarks:\nDonald Trump made mistakes by underestimating the destroying power of the coronavirus and the GFW system that distorts many facts.\n\nHowever, compared with other people who may be charged with treason against America, Donald Trump doesn’t have complicated business relationship with East Asia, so Donald Trump is NOT the worst candidate for 2020 president election. \n\nNo leaders are perfect.\nhttps://www.masterclass.com/classes/doris-kearns-goodwin-teaches-us-presidential-history-and-leadership \nAll people learn to grow on the journey of life. \n\nBased on logical reasoning, similar tactic may help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his personal friendship with a vicious dictator.  \n\n## As it’s based on hypothesis,  \nif there’s anything for Donald Trump to apologize for his mistake, then the White House can make further apologies by stating that \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, the White House appeals righteous people all over the world, including Chinese people, Chinese army, and those grassroots CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, to stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\n\nThe above will be enough to launch a special **Propaganda War, which will accelerate the collapse of the Atheism Gang of the FAKE CCP.** \n\nWith the acceleration of the CCP’s collapse, Donald Trump will naturally get higher ratings on his presidential job, so as to win the 2020 election campaign!",
				"added": 1632477020
			}
		],
		"1632475029_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 9,
				"body": "The new topic is based on some information in the past.\nIt’s found that 50KB can hold about 7,000 words.  ",
				"added": 1632477119
			}
		]
	},
	"comment_vote": {}
}