{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_12U1Hmmg3QABcs245rgVZoRPPvj6jcgfr5": 1,
		"16_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1
	},
	"next_comment_id": 48,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#Scrum - A Arte De Fazer o Dobro do Trabalho na Metade do Tempo\nSe você já foi surpreendido por quão rápido o mundo está mudando, Scrum é uma das razões. Para aqueles que acreditam que deve haver uma maneira mais eficiente de se fazer as coisas, este é um livro instigante sobre o processo de gestão que está mudando a maneira como vivemos. Desde o advento do método, já foram registrados ganhos de produtividade de até 1.200%. Jeff Sutherland, empreendedor que desenvolveu a primeira equipe Scrum há mais de vinte anos, apresenta a iniciativa de maneira brilhante e lúcida. Tecida com insights de artes marciais, tomadas de decisão judicial, combate aéreo avançado, robótica e muitas outras disciplinas, Scrum é sempre fascinante. Seja para inventar uma tecnologia pioneira ou para estabelecer os alicerces de prosperidade de uma família, a razão mais importante para ler este livro é que ele pode ajudá-lo a alcançar o que outros consideram inatingível.\n- https://mega.nz/#!zrAX1SxJ!L1ua28l5Qm7yL2Vzm3vlbLbCY9t8NYn5zUcnnGj02tU",
				"added": 1547848767
			},
			{
				"comment_id": 2,
				"body": "#Manual de Persuasão do FBI\nComo um agente especial para o Programa de Análise Comportamental da Divisão de Segurança Nacional do FBI, Dr. Jack Schafer desenvolveu estratégias dinâmicas e inovadoras para entrevistar terroristas e detectar mentiras. Agora, Dr. Schafer evoluiu suas táticas e nos ensina como aplicá-las no cotidiano para obter sucesso nas relações interpessoais. Você quer pensar e reagir como os investigadores de TV do Criminal Minds, CSI ou Lie to Me? Quer influenciar pessoas recém-conhecidas e planejar a imagem pessoal que transmitirá no dia a dia? Quer entender através da linguagem corporal o que passa pela cabeça das pessoas ao seu redor? Quer descobrir se alguém está mentindo?\n- https://mega.nz/#!ajRhHQQT!UJnf_xk61KLMWv4MTiXMHY6L435zLwjTMqdreQt7JiE",
				"added": 1547848823
			},
			{
				"comment_id": 3,
				"body": "#O Capital\nNa lista dos grandes pensadores modernos do Ocidente, fatalmente se encontra o nome de Karl Marx. “O Capital” é o seu trabalho mais ambicioso, o que custou a ele mais de 20 anos de estudo e preparação. O resultado é que “O Capital”, hoje, mais de um século após sua conclusão, está presente nos mais diferentes espaços do estudo social e econômico. Seus ensinamentos constam em grande parte das grades curriculares das universidades em todo o mundo – não só das ciências humanas e econômicas – e até mesmo no Ensino Médio. Ao esmiuçar o capitalismo, com o estudo de seus múltiplos componentes (social, jurídico, econômico, filosófico etc.), Marx fez da sua obra uma ferramenta de análise crítica, teórica e prática do capitalismo. “O Capital” – Extratos por Paul Lafargue (autor do clássico Direito à Preguiça) é a compilação essencial da elaboração de Karl Marx sobre o funcionamento do capitalismo, destrinchando seu interior num rigoroso estudo que revolucionou o pensamento social e econômico. Uma edição elogiada pelo próprio Marx.\n\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:9_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV/O+Capital+Carl+Marx",
				"added": 1547849300
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 4,
				"body": "#Gerador local de carteiras Bitcoin usando Javascript de código aberto\n- http://127.0.0.1:43110/18ibPW8xhREGjVJqWPzHpC1wkRQFctRrW5/?culture=pt-br",
				"added": 1547849488
			},
			{
				"comment_id": 41,
				"body": "#O que todos devem saber sobre guerra cibernética\nA guerra cibernética consiste, basicamente, no uso de ataques digitais às estruturas estratégicas ou táticas de um alvo, para fins de espionagem ou sabotagem. Vamos entender isso mais a fundo.\n\n#O básico\n- Planejamento estratégico e tático\n\n“Estratégico” e “tático” são termos bastante usados entre militares que significam, basicamente, “coisas que ajudam os países a expressar suas vontades políticas e/ou declarar guerra”. Aí estão inclusas várias coisas: armas, munição e combustível para jatos e aviões. Há também coisas menos óbvias no meio: a moral das tropas, a visão política do público civil, e o bem-estar econômico do país.\n\nDeve-se destacar a diferença entre o nível estratégico e o nível tático. Em termos militares, o nível tático se refere ao que está sendo utilizado diretamente no combate.\n\nO nível estratégico está acima do tático; em outras palavras, ele consiste no que é necessário para vencer uma guerra, e não apenas batalhas e confrontos específicos. Isso inclui os recursos necessários para manter uma guerra: suprimentos, armas, munição, fábricas, homens e mulheres saudáveis para a linha de frente das batalhas, e uma população interessada em manter a guerra.\n\nSe a guerra fosse um jogo de xadrez, o nível tático se resumiria ao movimento de cada peça para capturar os inimigos. O nível estratégico refere-se ao modo como você ganha o jogo e destrói o seu oponente.\n\nLembre-se da diferença entre o nível tático e estratégico. Essa diferença será muito importante no final desse artigo, quando responderemos uma importante pergunta: por que a guerra cibernética é uma ameaça para a sociedade?\n\n- Espionagem\n\nA espionagem consiste basicamente em capturar informações destinadas a outras pessoas. No caso de uma ciberguerra, os espiões roubam informações táticas e estratégicas — dados sobre a movimentação de tropas, os pontos fortes e fracos do sistema bélico do país e qualquer outra informação valiosa sobre recursos necessários para a guerra.\n\n- Sabotagem\n\nTambém conhecida como “ação direta”; isto é, quando alguém resolve ser proativo e fazer algo com as próprias mãos. Na ciberguerra, a sabotagem pode ir de uma ação simples – derrubar os servidores de um site governamental – a algo extremamente nocivo, como causar o derramamento nuclear de uma ogiva.\n\nÉ um termo muito amplo, mas tudo o que você precisa lembrar é que ele se resume a “fazer algo” – ao contrário da espionagem, que se resume a “descobrir algo”.\n\n#Como funciona\nHackers com apoio do Estado – sejam membros das forças militares de um país, ou financiados por tal país – atacam computadores e redes do oponente que afetem recursos necessários para a guerra.\n\nEles fazem isso da mesma forma que em qualquer outro computador ou sistema: eles estudam o sistema profundamente, descobrem suas falhas e usam essa falhas para controlar esse sistema ou destruí-lo.\n\nNo primeiro caso, podemos usar informações confidenciais destinadas a outrem (espionagem) para ganhar a dianteira na batalha contra seu adversário. Podemos descobrir a velocidade de um míssil e construir um avião que possa ultrapassá-lo. Podemos descobrir para onde um alvo está movendo suas tropas, e planejar uma emboscada. Podemos descobrir quais cientistas são importantes na criação dessas armas, ou qual político foi imprenscidível na arrecadação de fundos para o tal sistema bélico — e atacá-los diretamente.\n\nQuando se tem o controle desses sistemas, sabotar pessoas também é possível. E se eu colocasse um programa secreto no código-fonte de um míssil que me permita explodi-lo enquanto ele está na terra? E se eu pudesse descobrir como as tropas estão se comunicando, e assim ganhar acesso à rede para que eu possa confundi-los e invadir a base deles?\n\nOu pior: e se eu atacasse funcionários civis e políticos de um país envolvido em uma ação militar? Eu poderia invadir seus sistemas/contas e fraudá-los, me passando por um deles. Eu também poderia usar essas informações para controlá-los e forçá-los a trabalhar para mim: por exemplo, chantageá-los por causa de algo que achei no computador, ou sequestrar suas famílias usando informações privadas.\n\nDestruir esses sistemas tem um resultado óbvio: você destrói o que controla esse sistema, e, consequentemente, impede-o de funcionar. Um exemplo comum de ciberguerrilha é o uso de ataques DDoS (ataque distribuído de negação de serviço) para desativar sites governamentais e redes sociais. Essa tática foi usada efetivamente pelos russos durante a Guerra da Ossétia do Sul em 2008, causando caos e espalhando informações falsas para a população antes e durante a invasão russa.\n\n#Quem são os alvos\nA guerra cibernética tem como alvo qualquer setor importante para a infraestrutura do inimigo. Isso significa setores óbvios como o exército, a defesa nacional e a indústria bélica. No entanto, esses alvos também podem ser fábricas civis de armas, minas e outras manufaturas que auxiliem no funcionamento dessas fábricas — e o sistema elétrico, que fornece energia para todos esses setores.\n\nNa sua versão mais assustadora, a ciberguerra pode ter como alvo o recurso estratégico mais importante de um país: sua população. Um hacker poderia fazer um ataque terrorista para desestabilizar ou desmotivar uma população a lutar. Isso implica em coisas assustadoras como ataques aos setores financeiros, que causariam danos econômicos; ou ataques a sistemas de comunicação – imagine o que aconteceria se a rede de telefonia fosse desativada e a internet caísse.\n\n#Por que isso ameaça a sociedade\nNa minha opinião, a guerra cibernética é assustadora por dois motivos. Primeiramente, a ciberguerra estratégica não faz nenhum distinção entre alvos civis e militares.\n\nAssim como as armas nucleares da Guerra Fria, as armas digitais podem atingir, indiscriminadamente, alvos civis e militares. Apesar de um míssil causar um dano muito maior do que um vírus, um ciberataque pode, sim, resultar em perdas e mortes de civis.\n\nUm bom exemplo seria um ataque ao sistema energético. Nos EUA, este é um recurso estratégico importantíssimo. Se o sistema fosse destruído por um ciberataque (uma possibilidade que assusta o país), não seriam só as fábricas de armas que parariam de funcionar. Um ataque desses resultaria também em acidentes de trânsito, cirurgias interrompidas, falhas em máquinas de suporte à vida — basicamente, uma quantidade absurda de pessoas morreriam.\n\nEm segundo lugar, é muito difícil descobrir o autor de um ciberataque; dessa forma, os governos que financiam esses ataques não tem que lidar com as consequências de suas ações.\n\nUm aspecto que faz as armas digitais piores do que as armas nucleares é a atribuição — descobrir quem fez o ataque. É muito fácil esconder a origem de um ataque desses, graças a proxies que mascaram a identificação do autor dos ataques. Mesmo que o governo descubra de qual computador o ataque foi efetivado, ainda existe a dificuldade de descobrir quem era a pessoa atrás da tela — e é ainda mais difícil saber se ele era, ou não, um agente do governo.\n\nSem atribuição, não há responsabilidade. E sem responsabilidade, não existem coisas como intimidação e cessar-fogo. Se um governo não pode ser culpado por ciberataques, existe sempre a possibilidade de este país ir além e partir para ataques semi-terroristas, como a interrupção do serviço elétrico de um país, ou ataques físicos (e perigosos) a fábricas e cidades.\n\nEm ambos os casos, cidadãos inocentes podem correr riscos.\n\n#Quantos desses ataques são financiados por governos\nPara ser honesto, ninguém sabe.\n\nNão existem estatísticas sobre a divisão entre ciberataques financiados por países e ataques financiados por estados dissidentes ou movimentos como a Al-Qaeda. Esse é um dos maiores problemas da ciberguerra: ela é assimétrica por natureza. Um país pequeno com um forte grupo de hackers pode facilmente atingir um país enorme com uma infraestrutura fraca e um exército incrível.\n\nÉ razoável assumir que hackers financiados por países ricos são mais perigosos. A maioria dos países de primeiro mundo sabe se defender de ciberataques básicos. Hackers financiados por países poderosos são, em sua maioria, mais bem-preparados, e podem organizar ataques que ultrapassam essas defesas, causando danos catastróficos.\n\n- Fonte: https://gizmodo.uol.com.br/",
				"added": 1547856581
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 5,
				"body": "1 Levantarei os meus olhos para os montes, de onde vem o meu socorro.\n\n2 O meu socorro vem do Senhor que fez o céu e a terra.\n\n3 Não deixará vacilar o teu pé; aquele que te guarda não tosquenejará.\n\n4 Eis que não tosquenejará nem dormirá o guarda de Israel.\n\n5 O Senhor é quem te guarda; o Senhor é a tua sombra à tua direita.\n\n6 O sol não te molestará de dia nem a lua de noite.\n\n7 O Senhor te guardará de todo o mal; guardará a tua alma.\n\n8 O Senhor guardará a tua entrada e a tua saída, desde agora e para sempre.\n\n- Salmos 121",
				"added": 1547849614
			},
			{
				"comment_id": 6,
				"body": "Nesse meio tempo, tendo-se juntado uma multidão de milhares de pessoas, a ponto de se atropelarem umas às outras, Jesus começou a falar primeiramente aos seus discípulos, dizendo: \"Tenham cuidado com o fermento dos fariseus, que é a hipocrisia.\nNão há nada escondido que não venha a ser descoberto, ou oculto que não venha a ser conhecido.\nO que vocês disseram nas trevas será ouvido à luz do dia, e o que vocês sussurraram aos ouvidos dentro de casa, será proclamado dos telhados.\n\"Eu lhes digo, meus amigos: não tenham medo dos que matam o corpo e depois nada mais podem fazer.\nMas eu lhes mostrarei a quem vocês devem temer: temam aquele que, depois de matar o corpo, tem poder para lançar no inferno. Sim, eu lhes digo, esse vocês devem temer.\nNão se vendem cinco pardais por duas moedinhas? Contudo, nenhum deles é esquecido por Deus.\nAté os cabelos da cabeça de vocês estão todos contados. Não tenham medo; vocês valem mais do que muitos pardais!\n\"Eu lhes digo: quem me confessar diante dos homens, também o Filho do homem o confessará diante dos anjos de Deus.\nMas aquele que me negar diante dos homens será negado diante dos anjos de Deus.\nTodo aquele que disser uma palavra contra o Filho do homem será perdoado, mas quem blasfemar contra o Espírito Santo não será perdoado.\n\"Quando vocês forem levados às sinagogas e diante dos governantes e das autoridades, não se preocupem com a forma pela qual se defenderão, ou com o que dirão,\npois naquela hora o Espírito Santo lhes ensinará o que devem dizer\".\nAlguém da multidão lhe disse: \"Mestre, dize a meu irmão que divida a herança comigo\".\nRespondeu Jesus: \"Homem, quem me designou juiz ou árbitro entre vocês? \"\nEntão lhes disse: \"Cuidado! Fiquem de sobreaviso contra todo tipo de ganância; a vida de um homem não consiste na quantidade dos seus bens\".\nEntão lhes contou esta parábola: \"A terra de certo homem rico produziu muito bem.\nEle pensou consigo mesmo: ‘O que vou fazer? Não tenho onde armazenar minha colheita’.\n\"Então disse: ‘Já sei o que vou fazer. Vou derrubar os meus celeiros e construir outros maiores, e ali guardarei toda a minha safra e todos os meus bens.\nE direi a mim mesmo: Você tem grande quantidade de bens, armazenados para muitos anos. Descanse, coma, beba e alegre-se’.\n\"Contudo, Deus lhe disse: ‘Insensato! Esta mesma noite a sua vida lhe será exigida. Então, quem ficará com o que você preparou? ’\n\"Assim acontece com quem guarda para si riquezas, mas não é rico para com Deus\".\nDirigindo-se aos seus discípulos, Jesus acrescentou: \"Portanto eu lhes digo: não se preocupem com suas próprias vidas, quanto ao que comer; nem com seus próprios corpos, quanto ao que vestir.\nA vida é mais importante do que a comida, e o corpo, mais do que as roupas.\nObservem os corvos: não semeiam nem colhem, não têm armazéns nem celeiros; contudo, Deus os alimenta. E vocês têm muito mais valor do que as aves!\nQuem de vocês, por mais que se preocupe, pode acrescentar uma hora que seja à sua vida?\nVisto que vocês não podem sequer fazer uma coisa tão pequena, por que se preocupar com o restante?\n\"Observem como crescem os lírios. Eles não trabalham nem tecem. Contudo, eu lhes digo que nem Salomão, em todo o seu esplendor, vestiu-se como um deles.\nSe Deus veste assim a erva do campo, que hoje existe e amanhã é lançada ao fogo, quanto mais vestirá vocês, homens de pequena fé!\nNão busquem ansiosamente o que hão de comer ou beber; não se preocupem com isso.\nPois o mundo pagão é que corre atrás dessas coisas; mas o Pai sabe que vocês precisam delas.\nBusquem, pois, o Reino de Deus, e essas coisas lhes serão acrescentadas.\n\"Não tenham medo, pequeno rebanho, pois foi do agrado do Pai dar-lhes o Reino.\nVendam o que têm e dêem esmolas. Façam para vocês bolsas que não se gastem com o tempo, um tesouro nos céus que não se acabe, onde ladrão algum chega perto e nenhuma traça destrói.\nPois onde estiver o seu tesouro, ali também estará o seu coração\".\n\"Estejam prontos para servir, e conservem acesas as suas candeias,\ncomo aqueles que esperam seu senhor voltar de um banquete de casamento; para que, quando ele chegar e bater, possam abrir-lhe a porta imediatamente.\nFelizes os servos cujo senhor os encontrar vigiando, quando voltar. Eu lhes afirmo que ele se vestirá para servir, fará que se reclinem à mesa, e virá servi-los.\nMesmo que ele chegue de noite ou de madrugada, felizes os servos que o senhor encontrar preparados.\nEntendam, porém, isto: se o dono da casa soubesse a que hora viria o ladrão, não permitiria que a sua casa fosse arrombada.\nEstejam também vocês preparados, porque o Filho do homem virá numa hora em que não o esperam\".\nPedro perguntou: \"Senhor, estás contando esta parábola para nós ou para todos? \"\nO Senhor respondeu: \"Quem é, pois, o administrador fiel e sensato, a quem seu senhor encarrega dos seus servos, para lhes dar sua porção de alimento no tempo devido?\nFeliz o servo a quem o seu senhor encontrar fazendo assim quando voltar.\nGaranto-lhes que ele o encarregará de todos os seus bens.\nMas suponham que esse servo diga a si mesmo: ‘Meu senhor se demora a voltar’, e então comece a bater nos servos e nas servas, a comer, a beber e a embriagar-se.\nO senhor daquele servo virá num dia em que ele não o espera e numa hora que não sabe, e o punirá severamente e lhe dará um lugar com os infiéis.\n\"Aquele servo que conhece a vontade de seu senhor e não prepara o que ele deseja, nem o realiza, receberá muitos açoites.\nMas aquele que não a conhece e pratica coisas merecedoras de castigo, receberá poucos açoites. A quem muito foi dado, muito será exigido; e a quem muito foi confiado, muito mais será pedido\".\n\"Vim trazer fogo à terra, e como gostaria que já estivesse aceso!\nMas tenho que passar por um batismo, e como estou angustiado até que ele se realize!\nVocês pensam que vim trazer paz à terra? Não, eu lhes digo. Pelo contrário, vim trazer divisão!\nDe agora em diante haverá cinco numa família divididos uns contra os outros: três contra dois e dois contra três.\nEstarão divididos pai contra filho e filho contra pai, mãe contra filha e filha contra mãe, sogra contra nora e nora contra sogra\".\nDizia ele à multidão: \"Quando vocês vêem uma nuvem se levantando no ocidente, logo dizem: ‘Vai chover’, e assim acontece.\nE quando sopra o vento sul, vocês dizem: ‘Vai fazer calor’, e assim ocorre.\nHipócritas! Vocês sabem interpretar o aspecto da terra e do céu. Como não sabem interpretar o tempo presente?\n\"Por que vocês não julgam por si mesmos o que é justo?\nQuando algum de vocês estiver indo com seu adversário para o magistrado, faça tudo para se reconciliar com ele no caminho; para que ele não o arraste ao juiz, o juiz o entregue ao oficial de justiça, e o oficial de justiça o jogue na prisão.\nEu lhe digo que você não sairá de lá enquanto não pagar o último centavo\".\n\n- Lucas 12:1-59",
				"added": 1547850357
			},
			{
				"comment_id": 7,
				"body": "Meu filho, não se esqueça da minha lei, mas guarde no coração os meus mandamentos,\npois eles prolongarão a sua vida por muitos anos e lhe darão prosperidade e paz.\nQue o amor e a fidelidade jamais o abandonem; prenda-os ao redor do seu pescoço, escreva-os na tábua do seu coração.\nEntão você terá o favor de Deus e dos homens, e boa reputação.\nConfie no Senhor de todo o seu coração e não se apóie em seu próprio entendimento;\nreconheça o Senhor em todos os seus caminhos, e ele endireitará as suas veredas.\nNão seja sábio aos seus próprios olhos; tema ao Senhor e evite o mal.\nIsso lhe dará saúde ao corpo e vigor aos ossos.\nHonre o Senhor com todos os seus recursos e com os primeiros frutos de todas as suas plantações;\nos seus celeiros ficarão plenamente cheios, e os seus barris transbordarão de vinho.\nMeu filho, não despreze a disciplina do Senhor nem se magoe com a sua repreensão,\npois o Senhor disciplina a quem ama, assim como o pai faz ao filho de quem deseja o bem.\nComo é feliz o homem que acha a sabedoria, o homem que obtém entendimento,\npois a sabedoria é mais proveitosa do que a prata e rende mais do que o ouro.\nÉ mais preciosa do que rubis; nada do que você possa desejar se compara a ela.\nNa mão direita, a sabedoria lhe garante vida longa; na mão esquerda, riquezas e honra.\nOs caminhos da sabedoria são caminhos agradáveis, e todas as suas veredas são paz.\nA sabedoria é árvore que dá vida a quem a abraça; quem a ela se apega será abençoado.\nPor sua sabedoria o Senhor lançou os alicerces da terra, por seu entendimento fixou no lugar os céus;\npor seu conhecimento as fontes profundas se rompem, e as nuvens gotejam o orvalho.\nMeu filho, guarde consigo a sensatez e o equilíbrio, nunca os perca de vista;\ntrarão vida a você e serão um enfeite para o seu pescoço.\nEntão você seguirá o seu caminho em segurança, e não tropeçará;\nquando se deitar, não terá medo, e o seu sono será tranqüilo.\nNão terá medo da calamidade repentina nem da ruína que atinge os ímpios,\npois o Senhor será a sua segurança e o impedirá de cair em armadilha.\nQuanto lhe for possível, não deixe de fazer o bem a quem dele precisa,\nNão diga ao seu próximo: \"Volte amanhã, e eu lhe darei algo\", se pode ajudá-lo hoje.\nNão planeje o mal contra o seu próximo, que confiantemente mora perto de você.\nNão acuse alguém sem motivo, se ele não lhe fez nenhum mal.\nNão tenha inveja de quem é violento nem adote nenhum dos seus procedimentos,\npois o Senhor detesta o perverso, mas o justo é seu grande amigo.\nA maldição do Senhor está sobre a casa dos ímpios, mas ele abençoa o lar dos justos.\nEle zomba dos zombadores, mas concede graça aos humildes.\nA honra é herança dos sábios, mas o Senhor expõe os tolos ao ridículo.\n\n- Provérbios 3:1-35",
				"added": 1547850475
			},
			{
				"comment_id": 8,
				"body": "Não se gabe do dia de amanhã, pois você não sabe o que este ou aquele dia poderá trazer.\nQue outros façam elogios a você, não a sua própria boca; outras pessoas, não os seus próprios lábios.\nA pedra é pesada e a areia é um fardo, mas a irritação causada pelo insensato é mais pesada do que as duas juntas.\nO rancor é cruel e a fúria é destrutiva, mas quem consegue suportar a inveja?\nMelhor é a repreensão feita abertamente do que o amor oculto.\nQuem fere por amor mostra lealdade, mas o inimigo multiplica beijos.\nQuem está satisfeito despreza o mel, mas para quem tem fome até o amargo é doce.\nComo a ave que vagueia longe do ninho, assim é o homem que vagueia longe do lar.\nPerfume e incenso trazem alegria ao coração; do conselho sincero do homem nasce uma bela amizade.\nNão abandone o seu amigo nem o amigo de seu pai; quando for atingido pela adversidade não vá para a casa de seu irmão; melhor é o vizinho próximo do que o irmão distante.\nSeja sábio, meu filho, e traga alegria ao meu coração; poderei então responder a quem me desprezar.\nO prudente percebe o perigo e busca refúgio; o inexperiente segue adiante e sofre as conseqüências.\nTome-se a veste de quem serve de fiador ao estranho; sirva ela de penhor de quem dá garantia a uma mulher leviana.\nA bênção dada aos gritos cedo de manhã, como maldição é recebida.\nA esposa briguenta é como o gotejar constante num dia chuvoso;\ndetê-la é como deter o vento, como apanhar óleo com a mão.\nAssim como o ferro afia o ferro, o homem afia o seu companheiro.\nQuem cuida de uma figueira comerá de seu fruto, e quem trata bem o seu senhor receberá tratamento de honra.\nAssim como a água reflete o rosto, o coração reflete quem somos nós.\nO Sheol e a Destruição são insaciáveis, como insaciáveis são os olhos do homem.\nO crisol é para a prata e o forno é para o ouro, mas o que prova o homem são os elogios que recebe.\nAinda que você moa o insensato, como trigo no pilão, a insensatez não se afastará dele.\nEsforce-se para saber bem como suas ovelhas estão, dê cuidadosa atenção aos seus rebanhos,\npois as riquezas não duram para sempre, e nada garante que a coroa passe de uma geração a outra.\nQuando o feno for retirado, surgirem novos brotos e o capim das colinas for colhido,\nos cordeiros lhe fornecerão roupa, e os bodes lhe renderão o preço de um campo.\nHaverá fartura de leite de cabra para alimentar você e sua família, e para sustentar as suas servas.\n\n- Provérbios 27:1-27",
				"added": 1547850594
			},
			{
				"comment_id": 9,
				"body": "O Senhor repudia balanças desonestas, mas os pesos exatos lhe dão prazer.\nQuando vem o orgulho, chega a desgraça, mas a sabedoria está com os humildes.\nA integridade dos justos os guia, mas a falsidade dos infiéis os destrói.\nDe nada vale a riqueza no dia da ira divina, mas a retidão livra da morte.\nA retidão dos irrepreensíveis lhes abre um caminho reto, mas os ímpios são abatidos por sua própria impiedade.\nA justiça dos justos os livra, mas o desejo dos infiéis os aprisiona.\nQuando morre o ímpio, sua esperança perece; tudo o que ele esperava do seu poder dá em nada.\nO justo é salvo das tribulações, e estas são transferidas para o ímpio.\nCom a boca o ímpio pretende destruir o próximo, mas pelo seu conhecimento o justo se livra.\nQuando os justos prosperam, a cidade exulta; quando os ímpios perecem, há cantos de alegria.\nPela bênção dos justos a cidade é exaltada, mas pela boca dos ímpios é destruída.\nO homem que não tem juízo ridiculariza o seu próximo, mas o que tem entendimento refreia a língua.\nQuem muito fala trai a confidência, mas quem merece confiança guarda o segredo.\nSem diretrizes a nação cai; o que a salva é ter muitos conselheiros.\nQuem serve de fiador certamente sofrerá, mas quem se nega a fazê-lo está seguro.\nA mulher bondosa conquista o respeito, mas os homens cruéis só conquistam riquezas.\nQuem faz o bem aos outros, a si mesmo o faz; o homem cruel causa o seu próprio mal.\nO ímpio recebe salários enganosos, mas quem semeia a retidão colhe segura recompensa.\nQuem permanece na justiça viverá, mas quem sai em busca do mal corre para a morte.\nO Senhor detesta os perversos de coração, mas os de conduta irrepreensível dão-lhe prazer.\nEsteja certo de que os ímpios não ficarão sem castigo, mas os justos serão poupados.\nComo anel de ouro em focinho de porco, assim é a mulher bonita, mas indiscreta.\nO desejo dos justos resulta em bem; a esperança dos ímpios, em ira.\nHá quem dê generosamente, e vê aumentar suas riquezas; outros retêm o que deveriam dar, e caem na pobreza.\nO generoso prosperará; quem dá alívio aos outros, alívio receberá.\nO povo amaldiçoa aquele que esconde o trigo, mas a bênção coroa aquele que logo se dispõe a vendê-lo.\nQuem procura o bem será respeitado; já o mal vai de encontro a quem o busca.\nQuem confia em suas riquezas certamente cairá, mas os justos florescerão como a folhagem verdejante.\nQuem causa problemas à sua família herdará somente vento; o insensato será servo do sábio.\nO fruto da retidão é árvore de vida, e aquele que conquista almas é sábio.\nSe os justos recebem a punição que merecem na terra, quanto mais o ímpio e o pecador!\n\n- Provérbios 11:1-31",
				"added": 1547850856
			},
			{
				"comment_id": 10,
				"body": "Quem guarda a sua boca guarda a sua vida, mas quem fala demais acaba se arruinando.\n\n- Provérbios 13:3",
				"added": 1547850904
			},
			{
				"comment_id": 11,
				"body": "Quem zomba da instrução pagará por ela, mas aquele que respeita o mandamento será recompensado.\n\n- Provérbios 13:13",
				"added": 1547851038
			},
			{
				"comment_id": 12,
				"body": "Há caminho que parece certo ao homem, mas no final conduz à morte.\nMesmo no riso o coração pode sofrer, e a alegria pode terminar em tristeza.\nOs infiéis receberão a retribuição de sua conduta, mas o homem bom será recompensado.\nO inexperiente acredita em qualquer coisa, mas o homem prudente vê bem onde pisa.\nO sábio é cauteloso e evita o mal, mas o tolo é impetuoso e irresponsável.\nQuem é irritadiço faz tolices, e o homem cheio de astúcias é odiado.\nOs inexperientes herdam a insensatez, mas o conhecimento é a coroa dos prudentes.\nOs maus se inclinarão diante dos homens de bem, e os ímpios, às portas da justiça.\n\n- Provérbios 14:12-19",
				"added": 1547851050
			},
			{
				"comment_id": 13,
				"body": "Melhor é o homem paciente do que o guerreiro, mais vale controlar o seu espírito do que conquistar uma cidade.\nA sorte é lançada no colo, mas a decisão vem do Senhor.\n\n- Provérbios 16:32,33",
				"added": 1547851109
			},
			{
				"comment_id": 14,
				"body": "Melhor é um pedaço de pão seco com paz e tranqüilidade do que uma casa onde há banquetes, e muitas brigas.\n\n- Provérbios 17:1",
				"added": 1547851449
			},
			{
				"comment_id": 15,
				"body": "Quem zomba dos pobres mostra desprezo pelo Criador deles; quem se alegra com a desgraça não ficará sem castigo.\n\n- Provérbios 17:5",
				"added": 1547851491
			},
			{
				"comment_id": 16,
				"body": "Quem retribui o bem com o mal, jamais deixará de ter mal no seu lar.\nComeçar uma discussão é como abrir brecha num dique; por isso resolva a questão antes que surja a contenda.\nAbsolver o ímpio e condenar o justo, são coisas que o Senhor odeia.\nDe que serve o dinheiro na mão do tolo, já que ele não quer obter sabedoria?\nO amigo ama em todos os momentos; é um irmão na adversidade.\n\n- Provérbios 17:13-17",
				"added": 1547851639
			},
			{
				"comment_id": 17,
				"body": "Não ame o sono, ou você acabará ficando pobre; fique desperto, e terá alimento de sobra.\n\n- Provérbios 20:13",
				"added": 1547851721
			},
			{
				"comment_id": 18,
				"body": "Saborosa é a comida que se obtém com mentiras, mas depois dá areia na boca.\nOs conselhos são importantes para quem quiser fazer planos, e quem sai à guerra precisa de orientação.\nQuem vive contando casos não guarda segredo; por isso, evite quem fala demais.\nSe alguém amaldiçoar seu pai ou sua mãe, a luz de sua vida se extinguirá na mais profunda escuridão.\nA herança que se obtém com ganância no princípio, no final não será abençoada.\nNão diga: \"Eu o farei pagar pelo mal que me fez! \" Espere pelo Senhor, e ele dará a vitória a você.\nO Senhor detesta pesos adulterados, e balanças falsificadas não o agradam.\n\n- Provérbios 20:17-23",
				"added": 1547851760
			},
			{
				"comment_id": 19,
				"body": "É uma armadilha consagrar algo precipitadamente, e só pensar nas conseqüências depois que se fez o voto.\n\n- Provérbios 20:25",
				"added": 1547851842
			},
			{
				"comment_id": 20,
				"body": "A língua tem poder sobre a vida e sobre a morte; os que gostam de usá-la comerão do seu fruto.\n\n- Provérbios 18:21",
				"added": 1547851975
			},
			{
				"comment_id": 21,
				"body": "#PROVÉRBIOS BÍBLICOS\nEncontre paz para o seu dia com os melhores e mais inspiradores provérbios bíblicos!\n\n- https://www.mensagenscomamor.com/proverbios-biblicos",
				"added": 1547852027
			},
			{
				"comment_id": 42,
				"body": "Jesus entrou em Jericó, e atravessava a cidade.\nHavia ali um homem rico chamado Zaqueu, chefe dos publicanos.\nEle queria ver quem era Jesus, mas, sendo de pequena estatura, não o conseguia, por causa da multidão.\nAssim, correu adiante e subiu numa figueira brava para vê-lo, pois Jesus ia passar por ali.\nQuando Jesus chegou àquele lugar, olhou para cima e lhe disse: \"Zaqueu, desça depressa. Quero ficar em sua casa hoje\".\nEntão ele desceu rapidamente e o recebeu com alegria.\nTodo o povo viu isso e começou a se queixar: \"Ele se hospedou na casa de um ‘pecador’ \".\nMas Zaqueu levantou-se e disse ao Senhor: \"Olha, Senhor! Estou dando a metade dos meus bens aos pobres; e se de alguém extorqui alguma coisa, devolverei quatro vezes mais\".\nJesus lhe disse: \"Hoje houve salvação nesta casa! Porque este homem também é filho de Abraão.\nPois o Filho do homem veio buscar e salvar o que estava perdido\".\n\n- Lucas 19:1-10",
				"added": 1547857597
			},
			{
				"comment_id": 43,
				"body": "O vinho é zombadore a bebida fermentada provoca brigas; não é sábio deixar-se dominar por eles.\n\n- Provérbios 20:1",
				"added": 1547857747
			},
			{
				"comment_id": 44,
				"body": "Jesus lhes falou novamente por parábolas, dizendo:\n\"O Reino dos céus é como um rei que preparou um banquete de casamento para seu filho.\nEnviou seus servos aos que tinham sido convidados para o banquete, dizendo-lhes que viessem; mas eles não quiseram vir.\n\"De novo enviou outros servos e disse: ‘Digam aos que foram convidados que preparei meu banquete: meus bois e meus novilhos gordos foram abatidos, e tudo está preparado. Venham para o banquete de casamento! ’\n\"Mas eles não lhes deram atenção e saíram, um para o seu campo, outro para os seus negócios.\nOs restantes, agarrando os servos, maltrataram-nos e os mataram.\nO rei ficou irado e, enviando o seu exército, destruiu aqueles assassinos e queimou a cidade deles.\n\"Então disse a seus servos: ‘O banquete de casamento está pronto, mas os meus convidados não eram dignos.\nVão às esquinas e convidem para o banquete todos os que vocês encontrarem’.\nEntão os servos saíram para as ruas e reuniram todas as pessoas que puderam encontrar, gente boa e gente má, e a sala do banquete de casamento ficou cheia de convidados.\n\"Mas quando o rei entrou para ver os convidados, notou ali um homem que não estava usando veste nupcial.\nE lhe perguntou: ‘Amigo, como você entrou aqui sem veste nupcial? ’ O homem emudeceu.\n\"Então o rei disse aos que serviam: ‘Amarrem-lhe as mãos e os pés, e lancem-no para fora, nas trevas; ali haverá choro e ranger de dentes’.\n\"Pois muitos são chamados, mas poucos são escolhidos\".\n\n- Mateus 22:1-14",
				"added": 1547858508
			},
			{
				"comment_id": 45,
				"body": "Falando novamente ao povo, Jesus disse: \"Eu sou a luz do mundo. Quem me segue, nunca andará em trevas, mas terá a luz da vida\".\nOs fariseus lhe disseram: \"Você está testemunhando a respeito de si próprio. O seu testemunho não é válido! \"\nRespondeu Jesus: \"Ainda que eu mesmo testemunhe em meu favor, o meu testemunho é válido, pois sei de onde vim e para onde vou. Mas vocês não sabem de onde vim nem para onde vou.\nVocês julgam por padrões humanos; eu não julgo ninguém.\nMesmo que eu julgue, as minhas decisões são verdadeiras, porque não estou sozinho. Eu estou com o Pai, que me enviou.\nNa Lei de vocês está escrito que o testemunho de dois homens é válido.\nEu testemunho acerca de mim mesmo; a minha outra testemunha é o Pai, que me enviou\".\nEntão lhe perguntaram: \"Onde está o seu pai? \" Respondeu Jesus: \"Vocês não conhecem nem a mim nem a meu Pai. Se me conhecessem, também conheceriam a meu Pai\".\nEle proferiu essas palavras enquanto ensinava no templo, perto do lugar onde se colocavam as ofertas. No entanto, ninguém o prendeu, porque a sua hora ainda não havia chegado.\nMais uma vez, Jesus lhes disse: \"Eu vou embora, e vocês procurarão por mim, e morrerão em seus pecados. Para onde vou, vocês não podem ir\".\nIsso levou os judeus a perguntarem: \"Será que ele irá matar-se? Será por isso que ele diz: ‘Para onde vou, vocês não podem ir’? \"\nMas ele continuou: \"Vocês são daqui de baixo; eu sou lá de cima. Vocês são deste mundo; eu não sou deste mundo.\nEu lhes disse que vocês morrerão em seus pecados. Se vocês não crerem que Eu Sou, de fato morrerão em seus pecados\".\n\"Quem é você? \", perguntaram eles. \"Exatamente o que tenho dito o tempo todo\", respondeu Jesus.\n#\"Tenho muitas coisas para dizer e julgar a respeito de vocês. Pois aquele que me enviou merece confiança, e digo ao mundo aquilo que dele ouvi\".\nEles não entenderam que lhes estava falando a respeito do Pai.\nEntão Jesus disse: \"Quando vocês levantarem o Filho do homem, saberão que Eu Sou, e que nada faço de mim mesmo, mas falo exatamente o que o Pai me ensinou.\n#Aquele que me enviou está comigo; ele não me deixou sozinho, pois sempre faço o que lhe agrada\".\nTendo dito essas coisas, muitos creram nele.\n#Disse Jesus aos judeus que haviam crido nele: \"Se vocês permanecerem firmes na minha palavra, verdadeiramente serão meus discípulos.\n#E conhecerão a verdade, e a verdade os libertará\".\nEles lhe responderam: \"Somos descendentes de Abraão e nunca fomos escravos de ninguém. Como você pode dizer que seremos livres? \"\n#Jesus respondeu: \"Digo-lhes a verdade: Todo aquele que vive pecando é escravo do pecado.\nO escravo não tem lugar permanente na família, mas o filho pertence a ela para sempre.\n#Portanto, se o Filho os libertar, vocês de fato serão livres.\nEu sei que vocês são descendentes de Abraão. Contudo, estão procurando matar-me, porque em vocês não há lugar para a minha palavra.\nEu lhes estou dizendo o que vi na presença do Pai, e vocês fazem o que ouviram do pai de vocês\".\n\"Abraão é o nosso pai\", responderam eles. Disse Jesus: \"Se vocês fossem filhos de Abraão, fariam as obras que Abraão fez.\nMas vocês estão procurando matar-me, sendo que eu lhes falei a verdade que ouvi de Deus; Abraão não agiu assim.\nVocês estão fazendo as obras do pai de vocês\". Protestaram eles: \"Nós não somos filhos ilegítimos. O único Pai que temos é Deus\".\nDisse-lhes Jesus: \"Se Deus fosse o Pai de vocês, vocês me amariam, pois eu vim de Deus e agora estou aqui. Eu não vim por mim mesmo, mas ele me enviou.\nPor que a minha linguagem não é clara para vocês? Porque são incapazes de ouvir o que eu digo.\n\"Vocês pertencem ao pai de vocês, o diabo, e querem realizar o desejo dele. Ele foi homicida desde o princípio e não se apegou à verdade, pois não há verdade nele. Quando mente, fala a sua própria língua, pois é mentiroso e pai da mentira.\nNo entanto, vocês não crêem em mim, porque lhes digo a verdade!\nQual de vocês pode me acusar de algum pecado? Se estou falando a verdade, porque vocês não crêem em mim?\nAquele que pertence a Deus ouve o que Deus diz. Vocês não ouvem porque não pertencem a Deus\".\nOs judeus lhe responderam: \"Não estamos certos em dizer que você é samaritano e está endemoninhado? \"\nDisse Jesus: \"Não estou endemoninhado! Pelo contrário, honro o meu Pai, e vocês me desonram.\nNão estou buscando glória para mim mesmo; mas, há quem a busque e julgue.\nAsseguro-lhes que, se alguém guardar a minha palavra, jamais verá a morte\".\nDiante disso, os judeus exclamaram: \"Agora sabemos que você está endemoninhado! Abraão morreu, bem como os profetas, mas você diz que se alguém guardar a sua palavra, nunca experimentará a morte.\nVocê é maior do que o nosso pai Abraão? Ele morreu, bem como os profetas. Quem você pensa que é? \"\nRespondeu Jesus: \"Se glorifico a mim mesmo, a minha glória nada significa. Meu Pai, que vocês dizem ser o Deus de vocês, é quem me glorifica.\nVocês não o conhecem, mas eu o conheço. Se eu dissesse que não o conheço, seria mentiroso como vocês, mas eu de fato o conheço e guardo a sua palavra.\nAbraão, pai de vocês, regozijou-se porque veria o meu dia; ele o viu e alegrou-se\".\nDisseram-lhe os judeus: \"Você ainda não tem cinqüenta anos, e viu Abraão? \"\n#Respondeu Jesus: \"Eu lhes afirmo que antes de Abraão nascer, Eu Sou! \"\nEntão eles apanharam pedras para apedrejá-lo, mas Jesus escondeu-se e saiu do templo.\n\n- João 8:12-59",
				"added": 1547859856
			},
			{
				"comment_id": 46,
				"body": "Jesus, porém, foi para o monte das Oliveiras.\nAo amanhecer ele apareceu novamente no templo, onde todo o povo se reuniu ao seu redor, e ele se assentou para ensiná-lo.\nOs mestres da lei e os fariseus trouxeram-lhe uma mulher surpreendida em adultério. Fizeram-na ficar em pé diante de todos\ne disseram a Jesus: \"Mestre, esta mulher foi surpreendida em ato de adultério.\nNa Lei, Moisés nos ordena apedrejar tais mulheres. E o senhor, que diz? \"\nEles estavam usando essa pergunta como armadilha, a fim de terem uma base para acusá-lo. Mas Jesus inclinou-se e começou a escrever no chão com o dedo.\n#Visto que continuavam a interrogá-lo, ele se levantou e lhes disse: \"Se algum de vocês estiver sem pecado, seja o primeiro a atirar pedra nela\".\nInclinou-se novamente e continuou escrevendo no chão.\nOs que o ouviram foram saindo, um de cada vez, começando com os mais velhos. Jesus ficou só, com a mulher em pé diante dele.\nEntão Jesus pôs-se de pé e perguntou-lhe: \"Mulher, onde estão eles? Ninguém a condenou? \"\n\"Ninguém, Senhor\", disse ela. Declarou Jesus: \"Eu também não a condeno. Agora vá e abandone sua vida de pecado\".\n\n- João 8:1-11",
				"added": 1547859880
			}
		],
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": [
			{
				"comment_id": 22,
				"body": "Um grama de exemplos vale mais que uma tonelada de conselhos.",
				"added": 1547852141
			},
			{
				"comment_id": 23,
				"body": "Nunca foi um bom amigo quem por pouco quebrou a amizade.",
				"added": 1547852162
			},
			{
				"comment_id": 24,
				"body": "Os ignorantes, que acham que sabem tudo, privam-se de um dos maiores prazeres da vida: aprender.",
				"added": 1547852169
			},
			{
				"comment_id": 25,
				"body": "Só percebemos o valor da água depois que a fonte seca.",
				"added": 1547852180
			},
			{
				"comment_id": 26,
				"body": "Quem não sabe se controlar é tão sem defesa como uma cidade sem muralhas.",
				"added": 1547852259
			},
			{
				"comment_id": 27,
				"body": "A oposição do homem instruído é melhor que o apoio do tolo.",
				"added": 1547852286
			},
			{
				"comment_id": 28,
				"body": "A ignorância é uma forma de morrer antes do tempo",
				"added": 1547852297
			},
			{
				"comment_id": 29,
				"body": "A pressa é a inimiga da perfeição.",
				"added": 1547852349
			},
			{
				"comment_id": 30,
				"body": "Cavalo que muito corre, treina as pernas.",
				"added": 1547852359
			},
			{
				"comment_id": 31,
				"body": "Mais vale um pássaro na mão do que dois voando.",
				"added": 1547852406
			},
			{
				"comment_id": 32,
				"body": "O barato sai caro.",
				"added": 1547852416
			},
			{
				"comment_id": 33,
				"body": "#O seguro morreu de velho.",
				"added": 1547852427
			},
			{
				"comment_id": 34,
				"body": "Saco vazio não para em pé.",
				"added": 1547852456
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 35,
				"body": "#AO MESTRE, COM CARINHO\nMark Thackeray (Sidney Poitier) é engenheiro, mas ficou desempregado e resolveu dar aulas em Londres. Ele começa a ensinar alunos majoritariamente brancos em uma escola no bairro operário de East End. Thackeray se depara então com adolescentes indisciplinados e desordeiros, e que estão determinados a destruir suas aulas. Só que o engenheiro, acostumado com hostilidades, não se amendronta e enfrenta o desafio de ensinar uma turma de baderneiros. Ao receber um convite para voltar a atuar como engenheiro, ele tem que decidir se pretende seguir como mestre ou voltar ao antigo cargo.\n\n- https://ok.ru/video/32576768626",
				"added": 1547852628
			},
			{
				"comment_id": 36,
				"body": "> [carancho](#comment_35_14ixKDLhbV4cd57M52FX5iVDvpwKB4ufuS): AO MESTRE, COM CARINHO\n> Mark Thackeray (Sidney Poitier) é engenheiro, mas ficou desempregado e resolveu dar aulas em Londres. Ele começa a ensinar alunos majoritariamente brancos em uma escola no bairro operário de East End. Thackeray se depara então com adolescentes indisciplinados e desordeiros, e que estão determinados a destruir suas aulas. Só que o engenheiro, acostumado com hostilidades, não se amendronta e enfrenta o desafio de ensinar uma turma de baderneiros. Ao receber um convite para voltar a atuar como engenheiro, ele tem que decidir se pretende seguir como mestre ou voltar ao antigo cargo.\n> \n> https://ok.ru/video/32576768626\n\n#Ao Mestre, Com Carinho 2\nDepois de lecionar durante 30 anos em Londres, Mark Thackeray (Sidney Poitier) se aposenta e volta para Chicago. Lá, o desafio de ensinar garotos em uma escola pequena mostra que ele não deve abrir mão de sua profissão.\n\n- https://ok.ru/video/335960148638",
				"added": 1547853158
			},
			{
				"comment_id": 38,
				"body": "#Close\nQuando a herdeira de uma empresa multimilionária (Sophie Nélisse) vira o alvo de assassinos de aluguel, a guarda-costas Sam (Noomi Rapace) fará de tudo para salvá-la – e ensiná-la a dar o troco na mesma moeda.\n\n\n- https://www.rapidvideo.com/e/FZB870UG9F",
				"added": 1547853588
			},
			{
				"comment_id": 39,
				"body": "#IO: O ÚLTIMO NA TERRA\nQuando um jovem cientista procura uma maneira de salvar uma Terra agonizante, ela encontra uma conexão com um homem que está correndo para pegar o último ônibus espacial do planeta.\n\n\n- https://vcstream.to/embed/5c4205b61ebaa/IO.O.ltimo.na.Terra.1080p.WEB-DL.DDP5.1.H264-hd71.mkv",
				"added": 1547853855
			},
			{
				"comment_id": 40,
				"body": "#LUA DE JÚPITER\nAryan, um jovem migrante, é baleado ao tentar ilegalmente cruzar a fronteira da Hungria. Depois do choque provocado pelo acidente, descobre que adquiriu o poder de levitar e agora, preso em um campo refugiados, precisa contar com a ajuda do Dr. Stern, que tem interesses muito específicos na habilidade sobrenatural.\n\n- https://www.rapidvideo.com/e/FZ9048BSWI",
				"added": 1547853980
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 37,
				"body": "#Gerador local de carteiras Bitcoin usando Javascript de código aberto\n- http://127.0.0.1:43110/18ibPW8xhREGjVJqWPzHpC1wkRQFctRrW5/?culture=pt-br",
				"added": 1547853359
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 47,
				"body": "#APOCALIPSE\n\nNova Iorque, 1980. Alan (Maurício Pitanga), Adriano (Felipe Cunha), Débora (Manoela do Monte) e Susana (Carolina Oliveira) são quatro universitários de diferentes nacionalidades. Enquanto Alan e Susana vivem uma linda história de amor, Adriano e Débora acabam se casando, mas vivem infelizes. Vinte anos depois, Benjamin (Guilherme Winter), o filho de Susana (Mônica Torres) e Alan (Eduardo Galvão), tornou-se um cientista renomado e casado com a bela Zoe (Juliana Knust). Ele tem como amigo de longas datas Ricardo (Sérgio Marone), filho de Débora (Bia Seidl) e Adriano (Eduardo Lago), que, ao contrário do amigo, tem em mente um plano maligno de não apenas acabar com a carreira e o casamento de Ricardo como também de dominar o mundo, o que revela sua verdadeira identidade: o anticristo.\n\n- https://www.g1novelas.org/ver/novelas-online/apocalipse/",
				"added": 1547862230
			}
		]
	},
	"comment_vote": {
		"4_14ixKDLhbV4cd57M52FX5iVDvpwKB4ufuS": 1,
		"41_14ixKDLhbV4cd57M52FX5iVDvpwKB4ufuS": 1,
		"47_14ixKDLhbV4cd57M52FX5iVDvpwKB4ufuS": 1
	}
}