{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 1,
				"body": "#Vai Protestar? Proteja-se!\n- https://protestos.org/pt.1.html\n- Arquivado em: https://web.archive.org/web/20191204105444/https://protestos.org/pt.1.html\n\nA plataforma digital Protestos.org tem como objetivo resguardar os direitos de privacidade e liberdade de expressão dos cidadãos nas ruas e na rede, sensibilizando e capacitando ativistas contra o aumento da vigilância e das violações de direitos.\n\n- Baixa Guia Protestos.org Português: https://swarm-gateways.net/bzz:/05b3148270ad2df63e887b95ba312656db4d82b94830b9e39f7c1e0bb207423b/Protestos.org-Guide-portugues.pdf\n\n#Manual Completo de como se portar em manifestações\n- https://web.archive.org/web/20180320134225/https://www.almanaquesos.com/manual-completo-de-como-se-portar-em-manifestacoes/\n\n#Faça Você Mesmo: Máscara Anti Gás para manifestações\n- https://web.archive.org/web/20180321063859/https://www.almanaquesos.com/aprenda-fazer-uma-mascara-antigas-para-ser-usada-em-protestos/\n\n#7 Passos para fazer uma máscara de gás\n- https://web.archive.org/web/20200509152441/https://www.almanaquesos.com/7-passos-para-fazer-uma-mascara-de-gas/",
				"added": 1589060445
			},
			{
				"comment_id": 2,
				"body": "#BALAKLAVA: Um Chamado à Guerra Nômade \n\nA publicação “Balaklava: Um Chamado à Guerra Nômade” foi lançada no outono de 2014 e teve algumas centenas de cópias distribuídas gratuitamente por nossas células em várias das cidades onde ocorreram os atos contra contra a Copa do Mundo de Futebol. Com esse texto, que inaugura as atividades do coletivo Fac.Fic, nos levantamos para continuar compartilhando experiências e conhecimento crítico, além de fazer novos chamados e buscar melhores encontros.\n\n- https://web.archive.org/web/20190116190216/https://faccaoficticia.noblogs.org/files/2015/08/zBK_P_editores_2016.cleaned.pdf\n\n#Cultura de Segurança e autodefesa na era digital\n\nNos últimos anos houve uma escalada de ações radicais. Isto inclui: confronto com a polícia, destruir a propriedade de corporações e do Estado, saquear lojas, resgatar animais, hackear sites e portais do governo, de empresas, da mídia e das corporações por trás dos mega eventos.\n\nPorém, tudo isso foi feito com a presença massiva de pessoas que provavelmente nunca pensaram que um dia se engajariam em ações ilegais e que elas surtiriam tanto efeito. Muitas dessas pessoas realizaram tais atividades sem qualquer noção de como preservar sua identidade e a das pessoas com quem mantêm conexões. Há um desconhecimento generalizado de conhecimentos básicos sobre cultura de segurança, que é imprescindível a qualquer luta radical. Por isso, julgamos necessário divulgar e debater sobre cultura de segurança.\n\n- https://web.archive.org/web/20171207031415/https://faccaoficticia.noblogs.org/files/2015/07/DigitalCulSeg.pdf\n\n#LUTANDO NO BRASIL – Sobre grandes mobilizações e o que fazer quando a fumaça se dissipa.\n\nO texto LUTANDO NO BRASIL é o primeiro de 3 volumes de um projeto escrito em diferentes cidades e regiões do país que analisam os momentos de pico e de retração das mobilziaçõe sociais, o que fazer para tirar o máximo em seu momento alto e como manter laços quando movimentos perdem fôlego.\n\nA primeira parte do texto pretende ser uma contribuição que analisa o todo e convida outros grupos a romper os limites das perspectivas locais e compartilhar diferentes formas de ver e agir em cada região. Assim, pessoas e coletivos de diferentes estados foram convidadas para escrever outros capítulos pensando e compartilhando experiências, questões e soluções para lutas anticapitalistas de agora e que virão.\n\n- https://web.archive.org/web/20190116201613/https://faccaoficticia.noblogs.org/files/2015/08/DIAGRAM_FINAL.cleaned.pdf\n- PDF in English: https://web.archive.org/web/20190717173742/https://cloudfront.crimethinc.com/assets/articles/2017/06/12/fighting%20in%20brazil.pdf\n\n#LUTANDO NO BRASIL – Parte II: RECIFE, SÃO ROQUE E RIO DE JANEIRO\n\nEstá é a segunda parte do projeto, LUTANDO NO BRASIL – Sobre grandes mobilizações e o que fazer quando a fumaça de dissipa. Camaradas de Recife e do Rio de Janeiro compartilham reflxões e experiências sobre os últimos anos de luta e resistência no sudesde e no nordesde do Brasil. Além disso, dois relatos de pessoas que estiveram nas linhas de frente do resgate de animais e do confronto com forças policiais em São Roque, interior de São Paulo, nos convidam a refletir sobre uma das mais emblemáticas ações radicais da história recente do país.\n\n- https://web.archive.org/web/20190116200220/https://faccaoficticia.noblogs.org/files/2015/07/Lutando_2_web.cleaned.pdf\n\n#CRISE, GOLPE DE ESTADO E RESISTÊNCIA – uma perspectiva anarquista\n\nO golpe parlamentar de 2016 marcou o fim da hegemonia petista na política brasileira e a consolidação de uma nova época, onde ventos autoritários e fascistas rondam por todo o continente. Nesse momento é importante pensar qual o terreno em que estamos entrando, quais são os novos atores entrando em cena e quais formas de resistência ainda são úteis. O que é golpe de Estado? Por que chamamos de golpe o Impeachment contra o PT? Como ele se relaciona com outras medidas de exceção cada vez mais comuns a todos os governos modernos? Não seria o golpe e a exceção a regra do jogo desde o surgimento da República no Brasil? Como ambos se relacionam com a nova direita e os novos movimentos autoritários que ganham força no país desde 2013? Qual o nosso lugar, enquanto anarquistas, em meio ao espetáculo da polarização política entre direita e esquerda partidária? Buscamos abordar essas e outras questões para refletir sobre a resistência e a luta social pelo fim do Estado e do Capitalismo num país e num mundo onde a Democracia esconde um estado policial tão assassino e autoritário quanto qualquer ditadura ou império que tenha existido.\n\n- https://web.archive.org/web/20200420022640/https://faccaoficticia.noblogs.org/files/2018/03/Crise_Golpe_Resistencia.pdf\n\n#La Crisis política, Golpe de Estado y Resistencia – Una análisis anarquista de la coyuntura política en Brasil\n\nDespués de una oleada de protestas anarquistas y autónomas en 2013, Brasil experimentó una reacción de derechas que culminó con la destitución de la Presidenta Dilma Rousseff del Partido de los Trabajadores (PT). Los eventos en Brasil ofrecen un caso de un fenómeno instructivo que prevalecen en otros lugares en el mundo – en efecto, EEUU podría tener experimentado algo similar si Hillary Clinton fuera electa. Mirando hacia Brasil, podemos identificar el peligro de las premisas de movimientos sociales en presentar demandas a las autoridades; podemos ver como los discursos de “combatir la corrupción” sirven a las fuerzas de derechas para competir con los partidos de izquierdas por el poder, mientras legitiman la función del propio gobierno; podemos estudiar como los grupos de derechas se apropiaran de las tácticas innovadoras de los movimientos anarquistas, y explotan medios de defender nosotrxs contra esas amenazas. Sobre todo, en un tiempo en que partidos de izquierdas y derechas están involucrados en luchas cada vez más agudas por el control del estado, nosotrxs tenemos que esculpir un espacio para movimientos sociales que rechazan el estado en sí, resistiendo a los atentados de manipulación y subordinación de todos los partidos. El ejemplo brasileño ofrece un importante punto de referencia para desafíos y oportunidades que enfrentamos hoy en día.\n\n- https://web.archive.org/web/20180801235424/https://faccaoficticia.noblogs.org/files/2018/03/Crise_Golpe_ESPANOL.pdf\n\n#Nenhuma Paz Vai nos Proteger\n\nTexto extraído do livro Balaklava e transformado em zine para maior difusão:\n\n“O problema fundamental da não-violência vem quando ela atinge o status de um valor inegociável que, em tese, deve ser aplicado em qualquer lugar ou situação, por qualquer grupo, em qualquer contexto, simplesmente por ser a única forma correta de ação. No entanto, sabemos que defender a não-violência como princípio para todas as ações políticas de resistência simplesmente mascara e tenta preservar privilégios de classe, gênero e cor. É uma forma de agir ineficiente, mas também classista, racista e patriarcal. O pior preço pago pelo pacifismo talvez seja jogar a violência cada vez mais sobre as minorias e desempoderá-las quando mais precisam reagir para defender sua própria existência.”\n\n- https://web.archive.org/web/20190116202257/https://faccaoficticia.noblogs.org/files/2015/07/Nenhuma-paz-diag.cleaned.pdf",
				"added": 1589061334
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 3,
				"body": "#Como funciona o liberalismo e o neoliberalismo? | O Gabinete, com Rita Von Hunty\n- https://swarm-gateways.net/bzz:/9565654dc952d0821b5692cb8c1927a979401bc846c5c2337964bf5e2df15d5e/Como+funciona+o+liberalismo+e+o+neoliberalismo_+_+O+Gabinete,+com+Rita+Von+Hunty-DVxELIxHN7Y.mp4",
				"added": 1589064295
			},
			{
				"comment_id": 4,
				"body": "#Para que serve um bilionário? | O Gabinete, com Rita Von Hunty\n- https://swarm-gateways.net/bzz:/e3cee8473e6e11dcbc5ac56f2d967b650bc264f98924867ceb5fe18173b0d32d/Para+que+serve+um+bilionário_+_+O+Gabinete,+com+Rita+Von+Hunty-f50GsBvU_bY.mp4\n\nO acumulo da fortuna dos 10 homens mais ricos do Brasil é de R$ 408 bilhões, valor que equivale ao PIB do Equador. Por um equivoco no momento da gravação, é informado que o PIB do Equador é de US$ 8 bilhões.",
				"added": 1589066571
			},
			{
				"comment_id": 5,
				"body": "#ANTI-CAP\n- https://swarm-gateways.net/bzz:/32cbabdd498f2194448580c1ebddbbe6475ba873164bf113ec885e33ee090cf5/ANTI-CAP+feat.+Sabrina+Fernandes+(Tese+Onze)-IHnDiiLqCMo.mp4",
				"added": 1589066866
			},
			{
				"comment_id": 6,
				"body": "#O FUTURO DO TRABALHO\n- https://swarm-gateways.net/bzz:/9557a36266f4c87af6e4008b636db2ed68831a94a8ef5df90c880de2dca20d2b/O+FUTURO+DO+TRABALHO-g8w1wACGX_U.mp4\n\n#Referências:\n\nRevolução 4.0 e a lição de Marx: https://web.archive.org/web/20200413075257/http://www.ihu.unisinos.br/78-noticias/571238-revolucao-4-0-e-a-licao-de-marx\n\n47% dos empregos vão desaparecer nos próximos 25 anos: https://web.archive.org/web/20191102032642/http://www.ihu.unisinos.br/565544-quarenta-e-sete-dos-empregos-vao-desaparecer-nos-proximos-25-anos-segundo-a-universidade-de-oxford\n\n60% dos jovens estão aprendendo profissões que a AI vai ocupar em menos de 20 anos: https://web.archive.org/web/20200131000621/http://www.ihu.unisinos.br/maisnoticias/noticias/563770-60-dos-jovens-estao-aprendendo-profissoes-que-a-ai-vai-ocupar-em-menos-de-20-anos\n\nUm guia para compreender a quarta revolução industrial: https://web.archive.org/web/20200413094959/http://www.ihu.unisinos.br/78-noticias/568153-um-guia-para-compreender-a-quarta-revolucao-industrial",
				"added": 1589067879
			}
		],
		"1_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": [
			{
				"comment_id": 7,
				"body": "#[Ameaça Vermelha - Aliança Operário-Camponesa](https://invidio.us/oN-tz96FzqM)\n- https://swarm-gateways.net/bzz:/b3b4e801b47d75172da3a280e729654e625aece24b530f1c1e064d4604a63ee4/Ameaça+Vermelha+-+Aliança+Operário-Camponesa-oN-tz96FzqM.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?17W24wecUi2WBJgCvdz5nv89Sy2GQyHHt3_0",
				"added": 1589069402
			}
		]
	},
	"comment_vote": {}
}