{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1,
			"title": "Anarchia Vita Mia cambia nome in \"Consumismo e Decrescita\"!!!",
			"body": "Il mio blog , \"Anarchia Vita Mia\" cambia nome in \"Consumismo e Decrescita\", in modo da essere più coerente con i temi trattati.\n-\nCONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia. \nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
			"added": 1573148874
		},
		{
			"topic_id": 2,
			"title": "Nuovo blog di contro-informazione \"Consumismo e Decrescita\"!!!",
			"body": "Buonasera a tutti. Sono tornato su ZeroNet dopo alcuni mesi di assenza e noto che gli utenti italiani sono calati molto... a luglio eravamo in più di 100......\nHo deciso di aprire in blog qui, visto la censura sempre più pesante sul Web e anche la nuova norma (infame) europea sul copyright......\nIl blog si chiama \"CONSUMISMO E DECRESCITA\" e riflette le mie opinioni e il mio pensiero: sono anarchico e ambientalista, odio il capitalismo e il consumismo che stanno uccidendo (relativamente) lentamente le persone e velocemente il pianeta, l'unico che (per adesso) abbiamo......\nVi chiedo di condividere il blog con tutti i vostri contatti su ZeroNet\n-\nCONSUMISMO E DECRESCITA -  http://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
			"added": 1573412009
		},
		{
			"topic_id": 3,
			"title": "Sto per pubblicare i libri di Snowden, Assange, Mitnick e altri sul blog \"Anarchia Unica Via\"!!!",
			"body": "Sto organizzando i testi per pubblicare tutti i libri di Edward Snowden, Julian Assange, Kevin Mitnick, Steven Levy e tanti altri sul mio blog \"Anarchia Unica Via\". I libri saranno pubblicati in vari post, e saranno disponibili solo qui, su ZeroNet. Su richiesta (commenti) posso fornire anche gli epub. Inoltre pubblicherò moltissimo materiale anarchico e testi contro il consumismo e il capitalismo impossibili da trovare (gratuitamente) sul web \"normale\".\nVi aspetto su \"ANARCHIA UNICA VIA --- Anarchia - Anti-Consumismo - Anti-Capitalismo - Contro-Informazione.\"\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/\n\nInizierò con il pubblicare \"No place to hide. Sotto controllo. Edward Snowden e la sorveglianza di massa\" di Glenn Greenwald, premio Pulitzer 2014.\nPoi \"Errore di sistema\" di Edward Snowden (2019). ",
			"added": 1575645418
		},
		{
			"topic_id": 4,
			"title": "La lotta contro la videosorveglianza come atto contro la civilizzazione.",
			"body": "Nuovo e interessante articolo pubblicato sul blog \"Anarchia Unica Via\".\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Post:9",
			"added": 1577524866
		},
		{
			"topic_id": 5,
			"title": "Consumo, dunque sono!",
			"body": "Viviamo nella “società dei consumatori”, il cui valore supremo è il diritto/obbligo alla “ricerca della felicità” - una felicità istantanea e perpetua che non deriva tanto dalla soddisfazione dei desideri quanto dalla loro quantità e intensità.\nEppure, dice Bauman, rispetto ai nostri antenati noi non siamo più felici: più alienati semmai, isolati, spesso vessati, prosciugati da vite frenetiche e vuote, costretti a prendere parte a una competizione grottesca per la visibilità e lo status, in una società che vive per il consumo e trasforma tutto in merce. Ciononostante stiamo al gioco e non ci ribelliamo, né sentiamo alcun impulso a farlo.\nAcuto, lucido, profetico, Zygmunt Bauman chiama ognuno di noi a ripensare al senso di impotenza che ci attanaglia.\n.\nLIBRO COMPLETO IN PUBBLICAZIONE (SUDDIVISO IN PARTI) SUL MIO BLOG \"Anarchia e Scienza\":\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
			"added": 1581922401
		},
		{
			"topic_id": 6,
			"title": "Il vizio oscuro dell’Occidente. Manifesto dell’Antimodernità",
			"body": "L’11 settembre ha inaugurato una nuova era, quella del «terrorismo globale», conseguenza logica, e prevedibile, della pretesa dell’Occidente di ridurre a sè l’intero esistente. Ma il «migliore dei mondi possibili» si rivela un modello paranoico, basato sull’ossessiva proiezione nel futuro, dove l’individuo non può mai trovare un punto di equilibrio e di pace. Nella ricerca inesausta del Bene, anzi del Meglio, l’uomo occidentale si è creato il meccanismo perfetto e infallibile dell’infelicità. E lo sta esportando ovunque. Il «terrorismo globale» non farà che confermare e rafforzare il delirio occidentale dell’unico modello mondiale, il suo. E lo scontro del futuro non sarà più fra destra e sinistra, fra un liberalismo trionfante e un marxismo morente — due facce in realtà della stessa medaglia — ma fra le leadership, politiche, economiche, intellettuali, schierate a favore della Modernità e le folle, deluse, frustrate, esasperate e violente, di ogni mondo, che avranno smesso di crederci.\n.\nIL LIBRO (COMPLETO) STA PER ESSERE PUBBLICATO (SUDDIVISO IN PARTI) SUL BLOG \"Anarchia e Scienza\":\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
			"added": 1582393577
		},
		{
			"topic_id": 7,
			"title": "WTO. Tutto quello che non vi hanno mai detto sul commercio globale",
			"body": "La denuncia delle strategie politiche ed economiche intraprese dall’Organizzazione mondiale per il commercio, in un testo che è già diventato un manifesto per i movimenti di base americani.\n-\nLo scopo dichiarato dei meeting del Wto, l’Organizzazione mondiale per il commercio, è trovare regole certe di liberalizzazione. Ma il vero tema al centro dell’attenzione è l’estensione del dominio del commercio a tutta la sfera delle attività umane, sempre più spesso a discapito delle popolazioni più povere e delle loro istanze ecologiche, etiche e di sviluppo. Il Wto è infatti già intervenuto in molte parti del mondo per impedire l’adozione di metodi produttivi e di scambio compatibili con la salvaguardia delle risorse naturali.\nIl libro offre un’analisi documentatissima e solleva un tema inquietante: se il Wto dovesse riuscire a stabilire la sua dittatura, potrebbe mettere in serio pericolo la democrazia e l’autonomia degli stati nazionali privandoli della loro capacità di decidere.\n-\nIl libro completo sarà copiato (suddiviso in parti) su \"Anarchia e Scienza\":\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
			"added": 1585246130
		},
		{
			"topic_id": 8,
			"title": "\"Anarchia e Scienza\" cambia nome e diventa \"Anarchia 2020\"",
			"body": "Contro il capitalismo, il consumismo e questo massacro chiamato \"economia\". Saranno pubblicati inoltre moltissimi testi anarchici e ambientalisti.... Thoreau, Bookchin e tanti altri.... \nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
			"added": 1594657878
		},
		{
			"topic_id": 9,
			"title": "Nuovo materiale in fase di preparazione per Anarchia 2020!!!",
			"body": "Stiamo preparando una notevole quantità di materiali inediti da pubblicare sul blog, in particolare documenti e testi incentrati sulla forte alleanza tra Chiesa cattolica e dittature nel corso della storia: la Chiesa ha collaborato attivamente (una vera e propria alleanza) con fascisti, nazisti, la dittatura argentina di Videla e molte altre..... Oltre a questi notevoli testi, sarà pubblicato altro materiale contro la chiesa cattolica, specialmente negli scandali \"moderni\".\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home\n-\nCondividete e fate girare questo blog.\nGrazie.",
			"added": 1595601935
		},
		{
			"topic_id": 10,
			"title": "LIBERI DALLA CIVILTÀ. Spunti per una critica radicale ai fondamenti della civilizzazione: Dominio, Cultura, Paura, Economia, Tecnologia",
			"body": "È possibile vivere in un mondo senza dominio, senza sfruttamento, senza inquinamento e mercificazione? Per almeno due milioni di anni i nostri antenati primitivi hanno vissuto così, ed è solo con la comparsa dell’agricoltura che l’esistenza ha preso la via di una distruttività sempre più accelerata e dilagante. Infranta l’originaria unione con la Natura abbiamo sottomesso le terre (coltivazione), e poi gli animali (allevamento), e poi le donne (società patriarcale), e poi chiunque altro (schiavitù, lavoro dipendente, massificazione).\nOggi siamo diventati gli anonimi ingranaggi della Megamacchina, funzionali unicamente alla sua espansione in ogni angolo del pianeta. Non contano più le persone, le relazioni, la vita genuina e autentica: contano solo i congegni elettronici, l’efficienza produttiva, la competizione, l’addestramento, la manipolazione. È la crisi del nostro mondo: un mondo sempre più artificiale e tossico nel quale uomini e donne repressi negli impulsi vitali, distanziati dalla capacità di fare da soli e resi dipendenti dai rimedi della tecno-industria, sopravvivono drogati dai diversivi senza più alcuna gioia di vivere. Non sorridiamo più, non ci illuminiamo più, siamo ogni giorno più tristi, delusi, spaventati, avvelenati, stressati, oberati.\nCon uno stile semplice che appassiona il lettore, il libro di Manicardi analizza i mali del ostro tempo fin dalla loro genesi.\n-\nQuesto voluminoso libro verrà pubblicato per intero, in varie parti, solo su Anarchia 2020.\n-\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
			"added": 1597327669
		}
	],
	"topic_vote": {
		"1_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"5_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1,
		"6_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 1,
				"body": "",
				"added": 1573148905
			}
		],
		"11_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 2,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Consumismo - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226051
			}
		],
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 3,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226104
			}
		],
		"1_1BkQbcXSmkVRaNgY77upSTfWLjFDFccAZv": [
			{
				"comment_id": 4,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226151
			}
		],
		"1_1EidJhfDKh2xojwKUdjGRTpQ7osWjt66G2": [
			{
				"comment_id": 5,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226205
			}
		],
		"1_19cF2jauCgNoSaFGxMhHMMYm33wyTVZojC": [
			{
				"comment_id": 6,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226224
			}
		],
		"2_1NstaJyYgXr8JTfXg6c5QRU9dZfWpmDC2E": [
			{
				"comment_id": 7,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226242
			}
		],
		"1_1JQaQ21DhL5q3HiCCX5DJ5xV4wFysqwJzb": [
			{
				"comment_id": 8,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226264
			}
		],
		"1_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 9,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226321
			}
		],
		"1_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS": [
			{
				"comment_id": 10,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226469
			}
		],
		"1_1NS9qMabhcMJpQqeqeFy14j3z9DkqNCWzS": [
			{
				"comment_id": 11,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226490
			}
		],
		"1_1JswAAVtEfcM2tDgAc2rEyqMacMfimWUeq": [
			{
				"comment_id": 12,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226498
			}
		],
		"1_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF": [
			{
				"comment_id": 13,
				"body": "ANARCHIA UNICA VIA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226514
			},
			{
				"comment_id": 22,
				"body": "Uso solo Linux da oltre 15 anni.... Ho cambiato varie distro.... Da Debian a Ubuntu, poi Fedora e Arch.... Adesso uso sulla macchina principale OpenSuse e sull'altra Arch, tutti con KDE.....\nComunque ho un blog dove parlo, tra le altre cose, anche di Linux, sicurezza informatica e hacking....\n-\nANARCHIA UNICA VIA\nAnarchia - Anti-Consumismo - Anti-Capitalismo - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1577525188
			}
		],
		"1_17Zks611RR4oN8USC3RxJzaw94GyPufioG": [
			{
				"comment_id": 14,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226601
			},
			{
				"comment_id": 21,
				"body": "Non uso Chrome perchè è risaputo e provato che è solo una spia di Google (ogni installazione di Chrome ha un codice ID univoco, che viene poi inviato ai server di Google  insieme od ogni dato sui siti che visitate, quanto ci state, addirittura anche quello che scrivete, la vostra posizione, ecc). \nChromium è decisamente meglio di Chrome, e non è una spia di Google.....\nComunque io uso Firefox con alcune estensioni per la sicurezza....",
				"added": 1577524774
			}
		],
		"2_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF": [
			{
				"comment_id": 15,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226675
			}
		],
		"1_17438DhdJ7LHQgQBVTfHmajp8dZXLH2Tiw": [
			{
				"comment_id": 16,
				"body": "CONSUMISMO E DECRESCITA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226709
			}
		],
		"1_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": [
			{
				"comment_id": 17,
				"body": "ANARCHIA E SCIENZA\nAnarchia - Decrescita - Contro-Informazione.\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia.\nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/?Home",
				"added": 1573226718
			}
		],
		"2_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 18,
				"body": "Il nome del blog è tornato quello originale, \"Anarchia Vita Mia\".... Gli argomenti trattati sono sempre gli stessi.... Anarchia, decrescita, anti-consumismo, anti-capitalismo e anti-fascismo... Contro la Chiesa cattolica, le religioni, questa schifosa economia e questa società ipocrita e falsa......",
				"added": 1573929008
			}
		],
		"1_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 19,
				"body": "Io ci sono... e sono uno dei pochissimi.... :-(\nHo un blog in fase di costruzione...... \n\"ANARCHIA UNICA VIA. Anarchia - Consumismo - Decrescita - Contro-Informazione.\"\nContro il consumismo e il capitalismo, contro la \"crescita\" e questo schifo di economia. \nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
				"added": 1575127885
			}
		],
		"1_142nJGYDMdmmcS3ZkikFTzG3E1sXbyRCE4": [
			{
				"comment_id": 20,
				"body": "Le reti p2p sono formate da singoli computer, ben più economici ed ecologici dei giganteschi datacenter delle grandi compagnie. Inoltre sono anche molto più veloci. Oltre a ZeroNet, trovo un ottimo Beaker Browser un ottimo progetto per una rete decentrata \"pura\", ovvero senza tracker. Il funzionamento è molto simile alle reti Torrent, senza blockchain e senza tracker. Ogni nodo funziona contemporaneamente sia da server che da client su una rete che usa il protocollo Dat per trasmettere dati ad altissime velocità.\nhttps://beakerbrowser.com/",
				"added": 1575649347
			}
		],
		"3_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 23,
				"body": "Il blog ha cambiato nome in \"Anarchia e Scienza ----- Ambiente - Salute - Evoluzione - Spazio-Tempo - Anti Consumismo - Anti Capitalismo\". \nhttp://127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
				"added": 1582466474
			}
		],
		"1_1AhDEnpQtGq4GowFBnTyFMuNusLfKajz1h": [
			{
				"comment_id": 24,
				"body": "Scarica Tor Browser e poi cerca (sul web \"in chiaro\") il link per la famosa Hidden Wiki, un indice con una piccola parte di siti del Dark Web….. Si trova di tutto, ma molti siti sono stati chiusi….. Prima di passare su ZeroNet io avevo un blog con WordPress sul Dark web, ma poi il gestore del servizio è rimasto down per 6 mesi senza alcun apparente motivo, e perciò ho portato il mio blog su questa rete.\nIl blog è ANARCHIA E SCIENZA:\n127.0.0.1:43110/1JvmWVVMxSoRQ59ZQkwWSkADw67H5e9o7M/",
				"added": 1587836735
			}
		]
	},
	"comment_vote": {}
}