{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1516705262,
			"title": "Adele",
			"body": "Just started listening to her. She has a crazy good voice. Who are some of your favorite singers?",
			"added": 1516705261
		},
		{
			"topic_id": 1516705414,
			"title": "Release: v1.0.8",
			"body": "[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.0.8 released!\n\n* Remove 'Songs' tab from the main page due to heavy processing.\n* Small UI fixes.\n\nWith the recent influx of new songs, it's become apparent that the homepage is in desperate need of some pagination/lazy-loading abilities. The biggest resource hog was definitely the songs tab, especially if you have many genres downloaded. I've removed that for now for performance reasons.\n\nFret not, adding searching capabilities is next up on the TODO list. I plan to have the default be a global artist/album/song search, while also being able to select what you're searching for (artist/album/...) as well.\n\nPlease report any bugs on the [issue tracker](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj) or in the comments below!",
			"added": 1516705412
		},
		{
			"topic_id": 1516705443,
			"title": "Add Your Genre to the Recommended List!",
			"body": "Please use this topic to propose your genre to be added to the Recommended List.\n\nThe requirements for addition are:\n\n* Proper name. Start each word with a capital letter, i.e. \"Hip Hop\".\n* Is seeded. If I can't download your genre, chances are most other users can't either.\n\nJust paste your genre address in the comment and I'll check it out. Feel free to leave any other comments or notes.\n\nIf you can't get your genre to download on other ZeroNet instances, consider adding it to a public proxy. (Currently I do not know of any, please feel free to suggest them in the comments!)\n\nAny private questions can be sent via ZeroMail to zerolstn.",
			"added": 1516705440
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1516705414_1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW": [
			{
				"comment_id": 1,
				"body": "> [mnemonic](#comment_2_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): It would also be nice if I could see how many songs does an album have (most I see have one) so that I don't have to go hunting for good albums.\n\nThanks for these reports, I've added them to the issue tracker so you can see progress on any being completed :)",
				"added": 1516732808
			}
		],
		"1516760270_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Fixed now.\n\nYeah I did, since I had a ZeroLSTN repo created before but it wasn't publishing (likely due to a signing issue), then when I realized one couldn't delete a repo, I edited my data.json to point to a new directory. Thankfully re-publushing that to the index simply updated the existing entry which didn't load, with the one that did.",
				"added": 1516871245
			}
		],
		"1517906635_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": [
			{
				"comment_id": 3,
				"body": "Yes, I plan to implement this via local storage, which I've noticed a few zites make use of already. Shouldn't be too difficult and might actually clean up some code that is used to pass these states around the website.",
				"added": 1517998809
			}
		]
	},
	"comment_vote": {
		"1_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1,
		"2_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1
	}
}