{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1607429722,
			"title": "i think i can safely say something is very broken with this pandemic",
			"body": "https://eu.tallahassee.com/story/news/2020/12/07/agents-raid-home-fired-florida-data-scientist-who-built-covid-19-dashboard-rebekah-jones/6482817002/",
			"added": 1607429721
		},
		{
			"topic_id": 1610343260,
			"title": "germany wants us and eu to forge marshall plan for democracy",
			"body": "https://m.dw.com/en/germany-wants-us-eu-to-forge-marshall-plan-for-democracy/a-56181438",
			"added": 1610343258
		},
		{
			"topic_id": 1611215074,
			"title": "they're now cracking down on dissent of many kinds including libertarianism",
			"body": "https://www.zerohedge.com/political/even-libertarians-john-brennan-issues-list-biden-intel-community-should-go-after",
			"added": 1611215071
		},
		{
			"topic_id": 1611288998,
			"title": "state sponsored financial deplatforming over wrongthink could be in the near future",
			"body": "https://reclaimthenet.org/rule-banks-finance-discrimination-repeal-potential-biden/",
			"added": 1611288994
		},
		{
			"topic_id": 1611289983,
			"title": "the real president may be Kamala Harris",
			"body": "https://breaking911.com/breaking-articles-of-impeachment-filed-against-president-joe-biden/",
			"added": 1611289978
		},
		{
			"topic_id": 1637100321,
			"title": "FBI Using Counterterrorism Tools To Track Parents, Whistleblower Says",
			"body": "https://breaking911.com/breaking-fbi-reportedly-using-counterterrorism-tools-to-track-parents/\n\nscary times",
			"added": 1637100315
		}
	],
	"topic_vote": {
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": 1,
		"1612726861_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1
	},
	"next_comment_id": 48,
	"comment": {
		"1605144642_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 1,
				"body": "i saw this and apparently according to down detector, reddit and a bunch of other major sites were having issues. i have no idea why however i suspect the sheer centralization of the clearnet makes it so the second something goes down, it takes much of the ship with it.",
				"added": 1605420591
			},
			{
				"comment_id": 2,
				"body": "https://horizon.netscout.com/ could always just be issues with the internet as a result of ddos attacks. these are rather common nowadays. hundreds of them going on rn",
				"added": 1605476059
			}
		],
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 3,
				"body": "it takes people knowing how it affects them. if they think they're in the clear from the tyrannical will of the government or that what they say won't be used against them by others, they won't care.",
				"added": 1606391453
			}
		],
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 4,
				"body": "searx is nice, personally i use it as well as duck duck go. haven't touched google search in a long time. yacy and presearch are others which look promising",
				"added": 1606391577
			}
		],
		"1606533306_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 5,
				"body": "imagine thinking that one can regulate self hosted blockchains. i mean sure it can happen to a degree but so many will slip through the cracks. i know they'll eventually try to ban crypto altogether along with E2EE however that's only going to make the foundations move to other countries and also force crypto underground\n",
				"added": 1606570146
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 6,
				"body": "there's various lists on github called under names like awesome decentralized or awesome privacy which are great starting points and will give a massive selection of results. best however are element as a discord replacement, XMPP, Retroshare for replacements to other messengers, LBRY and peertube are amazing youtube alternatives, tox, briar, signal, and session can replace texting, mumble and jitsi are godly for voice chat, so on and so forth, in 2020 there's not many reasons to not branch out into the decentralized world",
				"added": 1606570785
			}
		],
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 7,
				"body": "they rushed this out in 8 months, i doubt it could have ever been really safe when one is pushing that hard. the thing is, vaccines are often tested for many years before they make it into the mainstream because it is so easy to screw it up.",
				"added": 1608944045
			}
		],
		"1608002109_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "> [edgelordofdecent](#comment_727_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Some of us may feel like we are in a very bad position right now. But this is what they want us to think. We must share knowledge with each other and possibly set up some networks and connections outside of their control. Having an archive of you own is also going to be very important. Have pdfs, git repositories, linux and *bsd isos, proper tools, and plans.\n\ni run my own at home archives because of exactly this reason. at literally any point something can be rendered unavailable. the only media which is safe is what is stored directly on your PC",
				"added": 1608944835
			}
		],
		"1607610507_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "beautiful. i tried putting the snap on my build and it didn't want to work. perhaps someone can add aether to the AUR for arch based distros as well now that a tar.gz exists as well",
				"added": 1608945059
			}
		],
		"1609874864_1KCXLUdxYKm5ukuc8s6kWaAdz6A7Hi8GQE": [
			{
				"comment_id": 10,
				"body": "XMR FTW. BTC is not a good coin to use for the time being",
				"added": 1609983170
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "parler was so stupid that they didn't even scrub metadata from posts people made. so anyone who used it is directly identifiable",
				"added": 1610399950
			},
			{
				"comment_id": 13,
				"body": "> [edgelordofdecent](#comment_766_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Something tells me that this was by intention and not them being stupid.\n\nprobably",
				"added": 1610483373
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 12,
				"body": "i use arch based distros like manjaro and endeavor OS with KDE as a primary since it is the fastest distro while still being very user friendly. windows i only use for gaming and other very specific workloads. anything linux related is going to be far better than windows for applications regarding privacy since windows telemetry likely is able to intercept encryption keys among other things. not your software not your bitcoin. qubes is easily the best however it doesn't play nicely with some hardware",
				"added": 1610400500
			}
		],
		"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx": [
			{
				"comment_id": 14,
				"body": "oil is so far down in price because of covid that futures were literally negative at one point because there was such a huge oversupply",
				"added": 1610586674
			}
		],
		"1610876302_14xmVmzUMAx4egBicMbRNkqkrrgRgLFgYg": [
			{
				"comment_id": 15,
				"body": "works for me",
				"added": 1610919028
			}
		],
		"1610894921_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 16,
				"body": "i've been having the same issue with my phone which is running zeronet on it",
				"added": 1611028456
			}
		],
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 17,
				"body": "i got my fingers in many places online, far too many to easily list, used to more or less be on every single platform i could get into. however as of late I've been focused on integrating privacy into my workflow online while ditching many of the ones which are boarderline spyware. as for the platform i most like, it would have to be matrix as it is easily one of the best in the privacy to convenience factor.",
				"added": 1611289754
			}
		],
		"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 18,
				"body": "> [bangdingow](#comment_2_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6): I am gonna take some pleasure in seeing the leftest that were pretending to be libertarians flee and back pedal. \"Oh it's not me it's those other libertarians over there\" lol\n\nindeed. so many LARPers are gonna flee that movement leaving only the consistent ones behind",
				"added": 1611289827
			}
		],
		"1611396015_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 19,
				"body": "Definitely a fed poster, no one is actually dumb enough to ask a question like that openly",
				"added": 1611446543
			}
		],
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 20,
				"body": "yeah tor only is about the only mode i'd feel comfortable hosting sites on in general, even for things outside of zeronet. imo tor only should be a default mode. as for millchan, i don't know much about it however as there's nothing i can derive about it that would pique my interest. however what i am hearing is that it is a very risky site to host. i personally wouldn't poke around on it as there's nothing of value to me, let alone enough value to justify the risk, but tor only is a bare minimum if there's something there you know about that you wish to see.",
				"added": 1612075933
			}
		],
		"1613128614_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 21,
				"body": "i2p was also at least for me not working correctly. my guess is this was some secret test or worse trying to profile users of encrypted services to expand their watch list",
				"added": 1613324375
			}
		],
		"1613332271_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 22,
				"body": "muted. it should be clear this is a scam",
				"added": 1613574102
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 23,
				"body": "the vaccine like any medical proceedure is a risk assessment. there's various pieces of news saying that it isn't exactly safe. there are plenty of side effects, some severe or even fatal have been reported. https://odysee.com/139-Could-the-Covid-19-Jabs-Kill-More-than-Covid-19-#4 https://www.thehealthsite.com/news/36-covid-19-vaccine-recipients-develop-rare-blood-disorder-after-getting-moderna-pfizer-shots-795552/ the rabbit hole goes rather deep but this should get you started. anyway i will say that as far as I'm aware the risk of severe side effects isn't super high but likely higher than normal vaccines. most people should apparently have none to mild side effects first dose then second does often have mild to moderate side effects. can end up needing to take a day off in some cases. but safety and efficacy have come into question as of late and obviously given this is so new long term side effects are unknown.",
				"added": 1613919332
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 24,
				"body": "i like librewolf because it gives all the features of firefox, most importantly the addon support, while being insanely hardened right out of the box.",
				"added": 1614568624
			}
		],
		"1615844314_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": [
			{
				"comment_id": 25,
				"body": "the AUR git package currently doesn't work",
				"added": 1615924194
			}
		],
		"1615243619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 26,
				"body": "it's a term not just by people on the far right, It's also used by anarchists, and basically any other targeted group. and the idea of feds infiltrating groups is by no means irrational. Even well before the riots this was an insanely common fear among many groups, so much so that people in those crowds have been screaming from the rooftops for decentralization and better security. the idea that it will lead to lower amounts of what the state deems to be wrongthink from what i can gather is rather wishful on the government's end given these are terms that have been thrown around for many years and it didn't in any way stop them, the more intelligent ones just got off the surface before the crackdowns got too serious, the rest just end up getting feded at some point. it just makes it so the people remaining aren't as centralized or vulnerable. and truth be told, that's probably a good thing for anyone nowadays given how the window of acceptable opinion has been closing ever faster",
				"added": 1616092467
			}
		],
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 27,
				"body": "it seems the reason likely comes down to a mix of probably censorship from eastern countries but also just the fact it's not been maintained in months. until development really kickstarts again i don't forsee there being an uptick of users occuring any time soon. though we shouldn't give up on it. i do hold out hope that we will see devs breathe life into it. it's got major potential due to it's offline nature to be a great competitor to other services.",
				"added": 1625364128
			}
		],
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 28,
				"body": "> [swashbuckler](#comment_67_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Okay, I now see the problems: [...]\n\nby any chance do you mind linking to the geekless fork? gitlab is rather hard to navigate and i can't seem to find it",
				"added": 1630907359
			},
			{
				"comment_id": 29,
				"body": "i've been trying to archive zites as well for similar reasons though i am hopeful we can get development back on track soon. we did get a v3 onion patch recently https://git.disroot.org/anonymoose/ZeroNet_OnionV3 so that's solved but a lot of the python vulns and bugs really do need to be fixed. also if someone is willing to maintain a fork, try to pull in the PRs and good commits already on hello zeronet's repo and any other forks as well which have Pull requests if at all possible",
				"added": 1630907617
			},
			{
				"comment_id": 30,
				"body": "> [gitcenter](#comment_1549_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): PM me on ZeroMail. I'd like to listen to your vulnerability reports, and I have something to share too.\n\ni haven't found any personally, just was checking the issues on the github page such as SafeRe being vulnerable to Denial of service attacks.",
				"added": 1630947901
			},
			{
				"comment_id": 31,
				"body": "> [smashbuckler](#comment_92_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Pardon, I ment github: http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616664124_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet+development+We+need+new+heroes+We+need+you\n\nah ok",
				"added": 1630947930
			},
			{
				"comment_id": 32,
				"body": "just been testing out geekless's fork. seems to be giving less errors and weirdness in general.",
				"added": 1630982248
			}
		],
		"1627161257_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 33,
				"body": "this plugin would work a lot better i think if it supported adding proxies to it so for instance you could anonymize it over i2p or something of that nature.",
				"added": 1631052029
			}
		],
		"1631520906_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5": [
			{
				"comment_id": 34,
				"body": "i have tried it before, the webbrowser is definetely very minimal however. maybe something like galacteek may work in the future howevever",
				"added": 1631566241
			}
		],
		"1632343427_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda": [
			{
				"comment_id": 35,
				"body": "geekless already made a fork a while ago. may be better off contributing to their fork assuming it isn't defunct",
				"added": 1632350325
			}
		],
		"1633740636_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 36,
				"body": "i2p has it's uses. mainly for things like torrenting and also things like eepsites, anonymous forums, irc etc.",
				"added": 1633799548
			}
		],
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 37,
				"body": "truth social, bitchute, and other places are far from underground places. the problem those places have is it isn't underground enough. any random person can easily use it without any technical knowhow and even without possessing much in the way of common sense. the mix of both the almost nonexistent barrier to entry plus the false notion of safety making it a haven for people with less of a concept of OPSEC than brain cells but simultaniously more smart gadgets than brain cells, as such it's flooded with the worse variety of normies rather than those who genuinely need cover and have both the technical knowhow and the OPSEC to do it proper. the ban refugee camps on the surface often face significant problems from governments because those people who are banned from the surface are banned because their content violates the laws of a large jurisidiction particularly european countries, bitchute for instance banned hate speech not long ago and from what i could gather, it wasn't by a change of heart but rather because they had to. these ban evasion camps are a response usually to companies complying with hate speech laws or otherwise due to government censorship that are present in many authoritarian countries around the world, to a smaller extent in the US but far worse in some other areas of the world such as the UK, some mainland european countries, australia, etc, since although people in america don't much in the way such laws to deal with, at least not yet anyway, those companies still have to comply with international laws. so they ban certain speech/content flat out. the answer isn't stricter moderation, rather to make the internet so decentralized that it is physically impossible to regulate or control and let people choose their experience for themselves with locally running algorithms and client side filters. that's the only way this mad max clown world will end as far as i'm concerned. it would effectively require a complete redesign of the internet all the way down to the hardware level. such a future sadly, is a long long ways away i feel. ",
				"added": 1634964838
			},
			{
				"comment_id": 38,
				"body": "> [shadowelf37](#comment_2_15pcVCGkzEyxPGPPNC5H7RzTBZ9RsHtWFC): Your idea of a viable alternative solution is good, but it doesn't address the issue of how to get everyone onto the same social media site. Either it's been smeared into oblivion like Gab, succumbed to the establishment like Parler, or is explicitly a \"conservative\" social media platform. Obviously the ideal is that everyone uses one neutral and benevolent platform - but how would you get people off the other ones, and how would you avoid what happened to Gab? [...]\n\nit would take a lot of time and also would require that people are willing to start hosting stuff themselves in many cases. takes a certain tech knowhow to be able to properly escape the disaster that is the mainstream web",
				"added": 1634965012
			},
			{
				"comment_id": 39,
				"body": "> [shadowelf37](#comment_1_15pcVCGkzEyxPGPPNC5H7RzTBZ9RsHtWFC): Another solution: government prevents large social media platforms from banning users or removing content unless it breaks the law. Pipe dream that congress would ever do that, but then again, where are the alternative platforms??\n\nthey'd at that point simply come out and make a national ToS which bans those same things anyway. The US government via biden has been instructing platforms to ban so called hate speech for a while now. there was a press conference with Psaki where she stated that outright",
				"added": 1634965330
			},
			{
				"comment_id": 40,
				"body": "> [shadowelf37](#comment_3_15pcVCGkzEyxPGPPNC5H7RzTBZ9RsHtWFC): In principle that's unconstitutional, and would be easy to strike down if they tried building it into a ToS.\n\nyeah in principle that's the main saving grace at least for Americans however in practice they've been skirting the 1a if not violating it through their control of big tech and also dictating what can and can't be said for a long time already. there's a reason most of those websites have near identical ToS's at least in terms of the main points they cover and seem to almost act in unison when it comes to adding new things to said ToS's.",
				"added": 1634966125
			}
		],
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": [
			{
				"comment_id": 41,
				"body": "people who do that are obviously just some journalist, troll, or fed trying to fish data. best to ignore and block such types.",
				"added": 1635852580
			}
		],
		"1636753641_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 42,
				"body": "been having very low tracker counts as well. barely able to sync at times. sometimes have to restart tor to get it working. using the latest zeronet enhanced build",
				"added": 1636782348
			},
			{
				"comment_id": 43,
				"body": "> [xanadu](#comment_50_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Had that same issues. Probably not many people moved to v3 yet or do not know about it.\n\nthat's my thinking. will probably take a while for people to switch over to v3. i think if geekless pushed out a clone to zeronet's py3 updater it would make the process of switching a lot faster",
				"added": 1636841494
			}
		],
		"1636946579_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 44,
				"body": "if i were you, i'd try this instead https://github.com/zeronet-enhanced/ZeroNet/tree/massive-rework. it's got some additional improvements along with the v3 patch and is being actively developed. just need to copy over the data directory and your zeronet.conf to the new zeronet folder created and you should be off to the races. no patch needed",
				"added": 1637033401
			},
			{
				"comment_id": 47,
				"body": "> [nyzdoctn7g4obdcz](#comment_17_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): Tried it. Gave up. The copy I was wget downloading appeared same as the Nofish version (though I didn't compare hashes because I had no reference). Is this just a docker container? tried that route for awhile (don't have that capability installed) - until I discovered that dockers can only access the home directory in the system drive. I can't do it that way since I use a separate drive to host Zeronet. [...]\n\nyou're meant to clone it from the git repo. the readme page hasn't been modified yet from the original ZN",
				"added": 1637254451
			}
		],
		"1636974716_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 45,
				"body": "my guess is the trackers are getting overloaded all at once since now the v2 servers aren't working anymore and there isn't many v3's yet or possibly it's a bug with zeronet",
				"added": 1637033525
			},
			{
				"comment_id": 46,
				"body": "> [xanadu](#comment_77_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): I noticed that pressing Update all pages makes trackers go to 0.\n\nyeah that sometimes happens to me, i use ZNE",
				"added": 1637090797
			}
		]
	},
	"comment_vote": {
		"1197_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}