{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1610627966,
			"title": "This made me chuckle so I thought I'd post it here",
			"body": "Now that censorship is here,\nIt's time to take a stand.\nGet off of Twitter,\nGet off of Facebook.\nEveryone should join in,\nResist Silicon Valley censorship.\nShit, this could get me banned...",
			"added": 1610627965
		}
	],
	"topic_vote": {
		"1573243995_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1576135007_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "why should I believe you? this sounds like conspiracy nutters",
				"added": 1571765363
			}
		],
		"1571697285_1koSUG26DkPTFK23zE8JNnpeVQsCuPJhr": [
			{
				"comment_id": 2,
				"body": "> result of colonazation from the west\n\nthe fuck you talking about. only country colonizing in the middle east is Israel\nwon't defend the military interventions the west has done for israel and the internationals",
				"added": 1571814005
			}
		],
		"1589742530_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt": [
			{
				"comment_id": 3,
				"body": "That's ridiculous!\n\nAuschwitz had a pub.",
				"added": 1589760963
			}
		],
		"1591403223_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Antifa are rich white extremists.",
				"added": 1591568744
			}
		],
		"1595746827_192xAupujZXB6jpoWqpwobPnEdQovAKiXc": [
			{
				"comment_id": 5,
				"body": "> This may change your mind.\n\nUnironically \"look at everything the Dorito Emperor has done for Israel and the Chosen People\". Good goy. Just like every other president he's Zogged, don't let the good he's done for the U.S. economy and world peace blind you to his betrayal of the American People and his trampling over Palestinian sovereignty. He may not be fueling conflict in the M-E like Bush and Obama but he's still supporting Jewish Supremacy.\n\n> neuter all of you so that next generation's IQ jumps 20 points\n\nThere's one simple way to make that happen, just deport illegal immigrants and send the niggers back to Africa.",
				"added": 1595858523
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 6,
				"body": "I don't trust parler, minds lets you create an anonymous account so giving that a go\n\naside from ZeroNet of course",
				"added": 1610167074
			},
			{
				"comment_id": 8,
				"body": "so Parler site is still fine, just getting DOSed by the influx I take\n\nthey'll be going after their ISP, CDN, DNS and payment processors next though",
				"added": 1610167615
			}
		],
		"1610164924_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 7,
				"body": "only been able to get people to stop using big tech for private messaging, we're using signal and matrix instead\nnone of them want to give up on facebook and instagram\n\nluckily none of them use tiktok",
				"added": 1610167423
			}
		],
		"1610169002_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "I don't use Parler, and probably won't use it.\n\n> Its privacy policy says it \"may collect ... information such as your name, email address, username, and profile photo.\"\nwhat doesn't, lol, they also ask phone number now, but so do all silicon valley social sites so who cares\n\n> For people who choose to join the app's \"influencer network,\" the company may ask for information \"such as your Social Security number (SSN) or your tax identification number.\"",
				"added": 1610169544
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 10,
				"body": "You should realize that white people in general have as little power in the U.S. as black people. You should probably address Israel and the  j u d e n  instead. The only whites with power are traitors who sold us out to the multinationals. Biden or Trump, it's always the  j u d e n  who win.",
				"added": 1611452999
			}
		],
		"1612664212_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 11,
				"body": "> massive public debt is one of those criteria, and Trump helped contribute to it\n\nThat's mostly due to the pandemic, but even before that he wasn't doing anything to solve the debt issue.\nIn the end the only solution will be to get rid of the bankers.",
				"added": 1612713533
			}
		],
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": [
			{
				"comment_id": 12,
				"body": "As long as you verify the file with PGP from the official website after downloading there is no problem.",
				"added": 1612713784
			}
		]
	},
	"comment_vote": {
		"43_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1
	}
}