{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1C5FkFSP767q8TLNBLQvgCfsfWMviZ7evG": [
			{
				"comment_id": 1,
				"body": "> [alexkid](#comment_1_1DCFD2mkxjbVaQ5wKmVv9sVcUd1wNLuVJC): Salut à tous,Ce système à l'air pas mal, peut on le comparer à freenet en sois?\n\nSalut, \n\nOui on peut un peu mais pas trop non plus. \nFreenet a été pensé pour être anonyme et protéger ses utilisateurs, ce qui n'est pas le cas de Zeronet (c'est pour ça que Freenet est plus lent que Zeronet).\nZeronet est fait pour du contenu dynamique alors que Freenet non. \n\nPoint sur lequel je ne suis pas sûr : contrairement à Freenet, Zeronet ne permet pas de partager une partie de son disque dur pour le réseau alors que Freenet si (on peut par exemple dédier 100Go au stockage de Freesite & cie).\n\nAprès c'est aussi différents au niveau des technologies utilisées.",
				"added": 1457198545
			},
			{
				"comment_id": 2,
				"body": "> [zeronetuser0](#comment_1_1GuSHjNUV97h7BimaK7e32y6q2F91FHJjq): Salut, \n> Oui on peut un peu mais pas trop non plus.Freenet a été pensé pour être anonyme et protéger ses utilisateurs, ce qui n'est pas le cas de Zeronet (c'est pour ça que Freenet est plus lent que Zeronet).Zeronet est fait pour du contenu dynamique alors que Freenet non. \n> Point sur lequel je ne suis pas sûr : contrairement à Freenet, Zeronet ne permet pas de partager une partie de son disque dur pour le réseau alors que Freenet si (on peut par exemple dédier 100Go au stockage de Freesite & cie).\n> Après c'est aussi différents au niveau des technologies utilisées.\n\nAutre différence : un peer zeronet ne stock et sert que du contenu qu'il a déjà consulté alors qu'on node Freenet peut servir du contenu que l'utilisateur n'a jamais consulté. ",
				"added": 1457199212
			}
		],
		"1_1HFyoddmyycAJAngDpX5k4fSKCwf6zqukE": [
			{
				"comment_id": 3,
				"body": "> faut pas abusé tu t'imagine seedé un site de 5Go\nOn peut parfaitement seeder un site de plusieurs Go, je ne vois pas le problème.\n\n> ZeroNet c'est un genre de DarkWeb qu'on ne peut pas bloqué et qui est la a la vue du grand public\nEuh... What ?\n\n> j'imagine les dérive du genre du contenue pédopornographique, au encore de site de vente de marchandise illegal\nTu veux dire comme les sites web en .com .fr .ru ?\n\n> un site genre WikiLeaks\nÇa n'aurait pas un grand intérêt. \n\n> Je pense que zeronet est arrivé au bon moment\nPour accéder à du contenu censuré, Tor est bien plus approprié. Par ailleurs Zeronet n'est PAS anonyme et n'est PAS fait pour. C'est plus une expérience qu'autre chose pour le moment. D'autres logiciels/réseaux sont bien plus performant.",
				"added": 1457891765
			}
		],
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 4,
				"body": "> [creuilcreuil](#comment_2_1HFyoddmyycAJAngDpX5k4fSKCwf6zqukE): moi 10 seconds, mais le cpu n'a rien avoir avec la vitesse XDDD, c'est le debit internet et la carte reseau.\n\nAbsoluement pas. \nSur mon serveur 100Mb/s mais un seul core j'ai un score de 11 alors qu'avec mon laptop i7 et une connexion ADSL j'ai 6 secondes.",
				"added": 1457891853
			}
		],
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 5,
				"body": "zeronetuser0 aka zarka aka zeronetuser3 aka pleins d'autres pseudos.\nA : non divulgué\nS : queer (il, elle ou iel)\nL : Sur un coussin rembourré.\n\nJ'aime bien la décentralisation et surtout surtout le chocolat blanc.",
				"added": 1457903156
			}
		]
	},
	"comment_vote": {}
}