{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "Hi! Thank you for your post! I've translated it in Russian: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:5",
			"post_id": 3,
			"date_added": 1509278462
		},
		{
			"comment_id": 2,
			"body": "> [polar](#comment_1_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6): And more important wrong is: if you have multi profile at multi hub (such as create profile twice), your profiles will disordered.\n\nThis is what happened to me today. I followed some link and got to ZeroMeReloaded. The site said I had no profile (although I actually have), so I created it in the Orange Hub. The usual \"Hello ZeroMe!\" post appeared. I tried to delete that post and noticed that my older posts were deleted instead. I decided to check out what would happen if I press \"Delete\" several more times, so I got all my posts removed, LOL. Ironically, \"Hello ZeroMe!\" is stiil there and I have no way to delete it.\n",
			"post_id": 5,
			"date_added": 1509349939
		},
		{
			"comment_id": 3,
			"body": "I doubt if we need a social networking site at all. User's activity is signed with his/her certificate on any site, so we can just collect the data and represent \"Activity stream\" for each user. That stream potentially is much more effective than a profile in a partucular social network. Zeronet is a global social network by itself, so do we actually need one more \"facebook\" inside of it?\n\nIf you follow a stream, you can see that a person wrote a post in a blog, liked or commented a post, edited a wiki page and so on. So you can go to that specific site (blog, wiki etc) and see the details.\n\nNo overflowing hubs are needed with this approach. Every site manages its data by itself. And if you consider some site is too big, you can just refuse visiting that site.\n\nThe only thing that should be centralized is a \"global zeronet crawler\", that indexes pages and tells you on which sites which users can be found. But it is just an indexer, and it has no unique data. So if don't trust some indexer, you can use another one or run your own instance.\n",
			"post_id": 5,
			"date_added": 1509352517
		},
		{
			"comment_id": 4,
			"body": "> [binchan2](#comment_3_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): and not everyone want to be indexed, Google is good, Google is evil...)\n\nAll the data is open for everyone in ZeroNet, so a global index is just a matter of time and money. If you have enough of them, you are Google and Facebook of ZeroNet. For that reason, I think every person should stay abreast and have access to the Index-Made-By-Good-Guys. There can be private Index-Made-By-Bad-Guys as well, and they could know many things about you, which you do not expect anyone knows. Maybe, for example, you post some deannonization info about yourself a couple of years ago, and today you eventually wrote a post against the government from the same ID. So they already are going after you. It is better to know exactly, what kind of digital fingerprints you left somewhere.\n\n",
			"post_id": 5,
			"date_added": 1509355303
		}
	],
	"comment_vote": {},
	"post_vote": {
		"2": 1,
		"3": 1,
		"5": 1
	}
}