{
	"next_comment_id": 11,
	"user_name": "Crazylime",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566457728": 1566477339
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Kidcourageous: hahaha",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1565806611",
			"date_added": 1565815301
		},
		{
			"comment_id": 2,
			"body": "@kaffie: haha, I was wondering through the whole thing how this impacted your views on privacy...  \"Thank you for respecting people's privacy.\"",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566046254
		},
		{
			"comment_id": 3,
			"body": "@Kaffie: This is why I developed a love for history.  The reason it repeats itself is that human nature never changes. Cultures can get better at containing its impact.  Yet, I doubt there can ever be a utopia in a world with human nature.  You are right, privacy is a defense.  You have to defend yourself from human nature.  \n\n\nEven if you align everyone's intentions for good, there are still facets of human nature that are independent of intent.  Our propensity for self-deception through false assumption is the reason we can drive a car.  It's a gift and a curse at the same time.  Thus, no cure. \n\n\nAnother one is power.  Power corrupts.  How do you create a culture where no one has power or can ever attain it?  \n\n\nThis is why I love decentralization... it reduces power centers. ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566047297
		},
		{
			"comment_id": 4,
			"body": "@Kaffie: I like how you think through conflict, and try to understand different perspectives, like the different views of women on porn.   ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566049208
		},
		{
			"comment_id": 5,
			"body": "> @Znnex: \"you're happy to counter every fake with...real nude photos to prove the fakes wrong\"\nROFL!",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566090228
		},
		{
			"comment_id": 6,
			"body": "> @Kaffie: \"Why do men seemingly fail to understand why sexual harassment is bad?\"\n\nwhen women say \"sexual harassment\" men hear \"failed pickup line\".",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566090426
		},
		{
			"comment_id": 7,
			"body": "> @Kaffie: \"The problem with that line...\"\nlol it was a joke.  I hear ya.  \"hey, girl, checkout this fake nude I made of ya\" is not a pickup line.  :)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566103107
		},
		{
			"comment_id": 8,
			"body": "> @Kaffie: \"They don't and can't know what it feels like.\"\n\nHow do you know?  Maybe men totally understand what it feels like, but were trained to \"man up\" and not let those feelings get the best of them.  \n",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566103499
		},
		{
			"comment_id": 9,
			"body": "ran out of space and too lazy to learn how to create a new id?",
			"post_uri": "1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo_1566268191",
			"date_added": 1566276310
		},
		{
			"comment_id": 10,
			"body": "hahaha",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566457728",
			"date_added": 1566477330
		}
	],
	"flags": {},
	"comment_like": {}
}