{
	"title": "NebelHorn",
	"description": "Dezentrale Sammlung interessanter Inhalte aus der Dampfdruck-Presse",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1477753346,
	"post": [
		{
			"post_id": 6,
			"title": "Lasst Euch nicht täuschen!",
			"date_published": 1477752088.34,
			"body": "![täuschen_titel](img/täuschen.jpg)\n\n**_„Ach jaaa… schaut mal den Artikel an… da wird zwar noch Scheiße übers Dampfen drin geschrieben, aber auch ganz tolle Sachen…“_**\n\n**_„Na also, sie können die Wahrheit nicht ewig unterdrücken… es wird ja…“_**\n\n**_„Schau mal einer an, jetzt werden die alle wach und sehen das Gute in der E-Dampfe…“_**\n\n**_„Ja klar, können die nicht von heute auf morgen um 180° drehen… aber es sieht gut aus…“_**\n\nSolche und ähnliche Aussagen lese ich in letzter Zeit immer wieder, wenn ich Kommentare zu Presse-“News“ (eigentlich Olds… immer dieselbe alte Leier) zu Gesicht bekomme.\n\nJa Kacke is‘! Da wird nicht umgeschwenkt, da wird nicht umgedacht. Da wird zur Zeit wieder ordentlich Propaganda gegen das E-Dampfen gemacht. Das geschieht nur inzwischen einfach etwas subtiler… je weniger merken, dass sie eigentlich gegen das E-Dampfen schießen, desto weniger Gegenwind erwarten sie. So sieht das aus.\n\nKlar… etliche Artikel aus den Medien (die derzeit wieder wie an einer Perlenkette in die Landschaft gepumpt werden) klingen beim ersten Überfliegen oder Querlesen gar nicht mehr sooo übel. Aber bitte… nicht nur die Zeilen selbst lesen, sondern auch mal dazwischen schauen… oder „dahinter“… also hinter die Aussagen, die da getroffen werden. Tut man das, dann sieht man sie wieder, die hässliche Fratze des E-Dampf-Bashings.\n\nUnd insgesamt ist die Verbreitung von Dreck derzeit wieder ausgesprochen massiv. Ich bekomme meinen Kamm gar nicht mehr geglättet, weil er jeden Tag aufs Neue schwillt.\n\nBeispiele, warum ich ne Bürste habe? Kein Problem… ich greife mal mit verbundenen Augen in die wohlgefüllte Artikeltrommel (viele Artikel unterscheiden sich übrigens ausschließlich durch den Namen des „Blattes“, in dem sie erschienen sind… und durch zwei, drei Füllwörter)…\n\n**Zack!**\n**aponet.de**\n\n[E-Zigarette hilft nicht beim Rauchstopp (archive.org)](https://web.archive.org/web/20161021204127/https://www.aponet.de/aktuelles/ihr-apotheker-informiert/20161021-e-zigarette-hilft-nicht-beim-rauchstopp.html)\n\nUnd da steht dann gleich im ersten Satz: **_„E-Zigaretten sollen dabei helfen, mit dem Rauchen aufzuhören.“_**\n\n**Sollen sie? Wer sagt das?** Sind E-Dampfgeräte als Raucherentwöhnungshilfsmittel erfunden worden? Sind sie als solche im Handel? Will sich jeder ums Verrecken das Rauchen abgewöhnen, der zur Dampfe greift? Wer behauptet denn so einen Schwachsinn? Wo steht das geschrieben? Mal abgesehen davon, dass die Dampfe, sollte sie wirklich zu diesem Zweck entwickelt und auf den Markt gebracht worden sein, dann in die Apotheke gehören würde (was sie nicht tut, wie unsere Richter meinen), halte ich die Einordnung als Therapiegerät für sehr weit hergeholt. Und das Problem, was die Damen und Herren Apotheker haben (abgesehen davon, dass sie jetzt ihre horrenden Preise überdenken müssen, weil der Versandhandel Medikamente zu den reellen Preisen ohne Mond-Gewinnmargen verkaufen darf) ist, dass die E-Dampfe eben NICHT als Arzneimittel eingestuft wurde und sich der Handel deshalb ihrem Monopol entzieht.\n„Du sollst keine anderen Götter haben neben mir!“\n\nDeshalb sind E-Dampfen halt auch Kacke als Raucherentwöhnungstherapiemittelgerätekombinationen. Sagen sie! Und ich will ihnen zumindest nicht dahingehend widersprechen, als dass ich sage, dass sie ja sowas auch gar nicht sind. Wer durch das Dampfen mit dem Tabakrauchen aufhören kann… na für den ist das ein (übrigens NICHT seltener) positiver Nebeneffekt. Aber die Dinger sind Genussmittel. Genussmittel, die den Konsum anderer Genussmittel (Tabak) häufig überflüssig machen.\n\nWenn ich ein Entwöhnungspräparat will, dann gehe ich in die Apotheke und hole mir Champix® … da ist Vareniclin drin und soll sooo toll helfen, das Rauchen aufzugeben. Ja… ok… Nebenwirkungen gibt es auch… Moooooment… ja…\n\n**Übelkeit, Kopfschmerz, Erbrechen, Blähungen, Schlafstörungen, Benommenheit, Schwindel, abnormes Träumen, Geschmacksstörungen, Depression, Selbstmordgedanken, Selbstmord, Aggressivität, auffälliges Verhalten, Herzinfarkte und Herzrhythmusstörungen…**\n\nUnd das Zeug ist eigentlich völlig harmlos, was sowohl die Gefahrgutkennzeichnung\n\n![kennzeichnung 01](img/vareniclin_01.png)\n![kennzeichnung 02](img/vareniclin_2.png)\n\nals auch die H- und P-Sätze sowie die R- und S-Sätze anbelangt…\n\nH- und P-Sätze: H400 (**Sehr giftig für Wasserorganismen.**) P273 (**Freisetzung in die Umwelt vermeiden.**)\n\nR- und S-Sätze: R22‐50 (**Gesundheitsschädlich beim Verschlucken. / Sehr giftig für Wasserorganismen.**) S22‐57 (**Staub nicht einatmen. / Zur Vermeidung einer Kontamination der Umwelt geeigneten Behälter verwenden.**)\n\nMuss man sich mal auf der Zuge zergehen lassen… so ein Zeug wird EMPFOHLEN, um sich das Rauchen abzugewöhnen… und vor dem Dampfen wird GEWARNT, weil man angeblich nicht weiß, wie sich Aromen auf menschliche Zellen auswirken, wenn sie sich nicht im Hals, Magen und Darm befinden… und weil PG zu Atemwegsreizungen (Husten, Kratzen im Hals) führen KANN…\nSolche Symbole wie auf den Pillen finden sich nicht auf Liquid-Flaschen (auch wenn einige Hersteller oder Händler mal vor längerer Zeit ohne Not Totenköpfe auf die Labels gedruckt haben… was völliger Quatsch war).\n\nPropylenglycol (PG), das einer der Hauptbestandteile sehr vieler Liquids ist, wird zwar immer wieder als Hochrisikosubstanz dargestellt… was definitiv nicht erwiesen ist. Gerade aktuell wird versucht, PG durch geschickte Formulierungen ins Zwielicht zu rücken. Im aktuellen [Positionspapier](http://www.dhs.de/fileadmin/user_upload/pdf/dhs_stellungnahmen/DHS_Positionspapier_Harm_Reduction.pdf) der DHS wird bei der Besprechung von PG von der MAK-Kommission gefaselt und sogar eine fiktive MAK (Maximale Arbeitsplatz-Konzentration) erdacht… OBWOHL für PG eben KEINE MAK festgelegt ist. Könnt Ihr mir glauben. Kann man hier nachlesen:\n\n[http://onlinelibrary.wiley.com/doi/10.1002/3527600418.mb5755kskd0042/pdf](http://onlinelibrary.wiley.com/doi/10.1002/3527600418.mb5755kskd0042/pdf)\n\nKlasse ist, dass die Verfasser des Positionspapiers eben DIESE Quelle auch gleich mitliefern. Aber das merkt ja keiner, der sich nicht durch solche Pamphlete und die Quellenangaben wühlt. Hauptsache es wirkt so, als wäre PG gaaaanz gefährlich und es gäbe ja doch eine MAK.\n\nPrima übrigens, dass man durch das Betrachten der Unterzeichner (die den Inhalt EINSTIMMIG verabschiedet haben) auch auf den einen oder anderen… also zumindest einen „Judas“ aufmerksam wird. Der hatte vor gar nicht so langer Zeit durch seine Aussagen und Kritik am Regulierungswahn im [Alternativen Drogen- und Suchtbericht 2015](http://alternativer-drogenbericht.de/wp-content/uploads/2015/05/Alternativer-Drogen-und-Suchtbericht-2015.pdf) wie ein „Heilsbringer“ für die Dampferei gewirkt… und nun hat er diesen Dreck befürwortet und mit unterzeichnet. Bah!\n\nNa ja… wie auch immer… wer sich unbedingt das Rauchen abgewöhnen will, der soll halt in die Apotheke gehen und sich diesen wirksamen, hochriskanten Chemiecocktail besorgen… und nicht wundern, wenn er dann zum Amokläufer wird, sich hinter einem einfahrenden Zug aufhängt oder durch Schwindel und Benommenheit mit dem Fahrzeug ins Stauende kracht, nachdem er die Karre vorher vollgekotzt und -geschissen hat.\n\nSOLCHE Risiken sind von der E-Dampferei bislang noch nicht bekannt… und ich halte 12 Jahre ohne Dampfer-Krüppel und Dampfer-Tote für eine schon recht LANGE Zeit. Soviel zu fehlenden Langzeiterfahrungen.\n\nEigentlich wollte ich noch etliche andere Artikel aus der Trommel ziehen, aber irgendwie klingen sie alle ähnlich. Es wird so getan, als sei man ja gar nicht so ablehnend, doch dann wird es entweder direkt mit dem Arsch wieder eingerissen (durch solchen Schwachsinn, wie die Ungeeignetheit zur Raucherentwöhnung, den immer wieder angeführten Gateway-Effekt oder die Verführung von Kindern und Jugendlichen durch Erdbeergeschmack, den Erwachsene ja verabscheuen etc. pp.) oder es wird zwischen den Zeilen doch ein negatives Gesamtgefühl erzeugt.\n\nZu dem teilweise als Indiz für einen Richtungswechsel gefeierte Artikel aus dem Stern Kampf um Raucher: [Dampfst du schon – oder rauchst du noch? (archive.org)](https://web.archive.org/web/20161020213113/http://www.stern.de/wirtschaft/news/e-zigaretten--dampfst-du-schon---oder-rauchst-du-noch--7109804.html) spare ich mir hier die Analyse, denn das hat Sebastian in seinem Blog Vapoon hervorragend gemacht: [Ein Stern des Dampfens?](http://vapoon.de/ein-stern-des-dampfens/)\n\nAuch da mag man überrascht sein, dass anfangs teilweise seriöser und neutraler geschrieben wird, aber trotzdem – gerade am Schluss des Artikels… also der Teil, der beim Leser so richtig im Kopf hängen bleibt – werden wieder die ganzen alten Märchen und Konjunktive herausgeholt. Das hat nichts mit „vorsichtigem“ Umdenken zu tun, denn es gibt KEINEN Grund manipulative Aussagen oder Unwahrheiten in einem Artikel unterzubringen, um die Leserschaft „sanft und vorsichtig“ auf eine neue Spur zu bringen… das hat entweder etwas damit zu tun, dass der Verfasser nicht richtig recherchiert hat (und DAS sollte er eigentlich tun, denn er ist von Beruf Journalist… man erwartet ja auch von einem Bäcker, dass er anständig Brot backen kann… ist schließlich sein Beruf) oder von ihm erwartet wird (unausgesprochen, unter Druck oder gezwungen mit Geld), die negativen Aspekte so einzubauen, dass die Gesamtaussage doch negativ für das Dampfen ausfällt.\n\nNichts gegen das Nennen solcher falscher oder unbelegter Aussagen, kommen sie doch meist aus berufenem Munde… aber DANN bitte auch recherchieren, hinterfragen und andere Sichtweisen zumindest darstellen, wenn man schon „neutral“ sein möchte.\n\nNa egal… zum Stern-Artikel kann ich nix ergänzen… und den [Aponet-Artikel hat Sebastian](http://vapoon.de/wenn-die-welt-so-einfach-waere-aponet-mal-wieder/) übrigens auch beleuchtet… das allerdings aus einem anderen Blickwinkel (mir ging vor allem dieser beschissene erste Kernsatz auf die Nüsse).\n\nNein… die Medien (als Sprachrohre der ANTZ [1]) sind mitnichten geläutert oder „auf dem richtigen Weg“… sie haben nur die Strategie geändert, um möglichst viele zu täuschen.\n\n**Drum appelliere ich nochmal: „Lasst Euch nicht täuschen! Achtet darauf, ob derjenige, der Euch „umarmt“ nicht ein Messer in der Hand hält, um Euch damit von hinten zu durchbohren!“**"
		},
		{
			"post_id": 5,
			"title": "﻿AFAIK 002 – Wattepads auch erst ab 18?",
			"date_published": 1475480084.299,
			"body": "![image alt](img/AFAIK.jpg)\n\nDiverse E-Dampf-Shops (auch einige „Große“) haben wohl ein wenig überreagiert, was die Einhaltung des JuSchG anbelangt. Es gibt Shops, da muss man eine Altersverifikation (wie auch immer… sogar teilweise Schufa) durchlaufen, um ein Akku-Ladegerät, Edelstahldraht, Edelstahlsieb oder gar Muji-Wattepads bestellen zu können. Manchmal prangt auch noch ein 18+ Logo darunter.\n\nKrank, oder? Habe das JuSchG jetzt die Nacht noch zweiundrölfzig Mal ganz durchgelesen, aber nichts über Wattepads gefunden. Scheint also erlaubt zu sein, das auch an Minderjährige zu verkaufen, soweit sie zumindest beschränkt geschäftsfähig sind (§ 106 BGB).\n\nNun aber mal ein wenig zur Rechtssystematik in Deutschland. In Gesetzen kommen viele Wörter vor, darunter auch Begriffe, die allgemeingültige Definitionen haben, ohne dass diese explizit aufgeführt werden müssten. Sieht der Gesetzgeber jedoch für einen Begriff eine bestimmte Definition vor (die sich vielleicht sogar von der des allgemeinen Sprachgebrauchs und Verständnisses unterscheidet), so wird dieser Begriff häufig im Gesetz definiert (Legaldefinition). Weil viele Gesetze viele gleiche Begriffe enthalten, genügt es, wenn ein bestimmter Begriff in EINEM Gesetz entsprechend definiert wird. Findet der gleiche Begriff in einem anderen Gesetz dann ebenfalls Anwendung und der Gesetzgeber meint dies auch im Sinne der bereits im anderen Gesetz bestehenden Definition, so erfolgt im neuen Gesetz keine erneute Definition (wobei das aber auch vorkommen kann). Hat den Vorteil, dass die Gesetze nicht noch zusätzlich aufgebläht werden. Soll der Begriff abweichend definiert werden, dann muss natürlich auch die neue Definition ins Gesetz oder es wird sich auf die andere Definition bezogen und diese ggf. ergänzt.\n\nIm **§ 10 Abs. 3 u. 4 JuSchG** steht nun\n\n>(3) Tabakwaren und andere nikotinhaltige Erzeugnisse und deren Behältnisse >dürfen Kindern und Jugendlichen weder im Versandhandel angeboten noch an >Kinder und Jugendliche im Wege des Versandhandels abgegeben werden.\n\n>(4) Die Absätze 1 bis 3 gelten auch für nikotinfreie Erzeugnisse, wie >elektronische Zigaretten oder elektronische Shishas, in denen Flüssigkeit durch >ein elektronisches Heizelement verdampft und die entstehenden Aerosole mit >dem Mund eingeatmet werden, sowie für deren Behältnisse.\n \nAbsatz 3 alleine würde quasi nur bedeuten, dass nur Nikotin-Liquid und bereits vorgefüllte Dampfgeräte dem Verbot unterliegen würden. Durch Absatz 4 kommen aber leider die Begriffe „elektronische Zigarette“, „elektronische Shisha“ und „Behältnisse“ hinzu und das Verbot wird auch auf nikotinfreie Produkte ausgedehnt. Damit ist auch eine unbefüllte E-Dampfe betroffen und unterliegt dem Verkaufsverbot an Minderjährige.\nIm JuSchG sucht man nun aber vergeblich nach einer Legaldefinition der „elektronischen Zigarette“. Die findet man jedoch in **§ 1 Abs. 1 TabakerzeugnisG, der auf Artikel 2 Nummer 16 Richtlinie 2014/40/EU verweist.**\n\nDort steht:\n\n>„elektronische Zigarette“ ein Erzeugnis, das zum Konsum nikotinhaltigen >Dampfes mittels eines Mundstücks ver­wendet werden kann, oder jeden >Bestandteil dieses Produkts, einschließlich einer Kartusche, eines Tanks, und >des Gerätes ohne Kartusche oder Tank. Elektronische Zigaretten können >Einwegprodukte oder mittels eines Nachfüll­behälters oder eines Tanks >nachfüllbar sein oder mit Einwegkartuschen nachgeladen werden;\n\nHier kommt nun die „Ersatzteil-ist-gleich-Gesamtheits-Definition“ ins Spiel („jeden Bestandteil dieses Produkts“), die Tricks, wie das Verkaufen von „E-Dampfer-Bausätzen“ verhindern soll.. Allerdings ist man auf dem Holzweg, wenn man nun meint, auch eine Schraube, ein O-Ring, Watte etc. seien nun auch „elektronische Zigaretten“ im Sinne der Definition und damit des Gesetzes. **Das gilt selbstverständlich nicht für handelsübliche Teile, die auch (und meist ursprünglich) andere Anwendungszwecke haben.** So ist die Logik des Rechtssystems… aber auch der gesunde Menschenverstand sagt einem das. Sonst müsste ja jeder Klempner-Online-Shop eine Altersverifikation für den Verkauf von Dichtungsringen einführen und die Hersteller von Wattepads müssten ihr Produkt die Prüfung durch das BMEL durchlaufen lassen. Quark, oder?\nEinzelteile, die also auch andere Anwendungsgebiete haben, sind keine „elektronischen Zigaretten“ im Sinne des Gesetzes und unterliegen auch nicht den Verkaufseinschränkungen des JuSchG. **Sie werden auch nicht zu „elektronischen Zigaretten“ alleine dadurch, dass sie von einem Online-Shop verhökert werden, der sich ansonsten auf E-Dampfgeräte und Liquids spezialisiert hat.**\n\nAlso was hat denn die Shopbetreiber geritten, mir „Muschiwatte“ nur noch gegen Altersnachweis zu verkaufen? Manchmal habe ich den Eindruck, so mancher Shopbetreiber lebt in einer Subraumspalte."
		},
		{
			"post_id": 4,
			"title": "„Vapour to go“ - Koffein-Experiment 1",
			"date_published": 1475239603.609,
			"body": "Vor einem Monat (Juni 2013) wurde ich durch einen Thread im ERF auf die Möglichkeit aufmerksam, das Nikotin in Liquids durch Koffein zu ersetzen. Koffein soll dabei einen Throat Hit ähnlich dem des Nikotins erzeugen, was für viele Dampfer ein entscheidender „Genussfaktor“ ist. Es gibt auch schon mindestens zwei Liquid-Hersteller, die Koffein-Liquids anbieten. Dies wurde im Dampfertalk auch schon besprochen bzw. diskutiert.\nDa meine bisherigen Erfahrungen mit sogenannten „Flash-Zutaten“ nicht wirklich zufriedenstellend verlaufen sind (sie erzeugen nicht den gewünschten Druck auf den Bronchien sondern sind eher scharfe Zutaten, die ein Kratzen in den Atemwegen bewirken), dachte ich als eingefleischter Selbstmischer, dass man das doch mal ausprobieren müsste.\nBevor ich da an den Selbstversuch gegangen bin, habe ich mich natürlich erst einmal über Koffein schlau gemacht (reichlich spät für einen Hardcore-Kaffee-Junkie…).\n\nDie Wirkung auf den Körper ist zum Teil ja bekannt, die Recherchen haben dahingehend auch nichts beunruhigendes ergeben. Mein Arzt hat auf Befragen auch keine Bedenken geäußert.\n\nDann habe ich mich umgesehen, woher man Koffein (ein weißes,kristallines Pulver) beziehen kann und bin im Internet an unzähligen Stellen fündig geworden. So hab ich mir 100 Gramm Koffeinpulver für knappe 8,- € geordert.\nDie käuflichen Liquids sind mit 10 bzw. 15 mg Koffein pro ml Liquid zu haben und die Infos aus dem Dampfertalk lauteten, dass man für den gleichen Throat Hit in etwas „eine Stufe“ mehr Koffein als Nikotin benötigt. Da ich zur Zeit 9 mg Nikotin dampfe, wäre also ein Anteil von 15 mg Koffein passend. Also musste ich 1,5 Gramm Koffeinpulver in 100 ml neutraler Basis (trad. 55/35/10) unterbringen. Bei meinen Nachforschungen habe ich bereits erfahren, dass die Löslichkeit von Koffein nicht so berauschend ist. Allerdings ist sie in siedendem Wasser wohl recht gut. Nur für meine angestrebte Mischung war das Verfahren, das Koffein zunächst in Wasser zu lösen nicht gerade ideal, weil der Wasseranteil doch recht gering ist (das VG, welches ich verwende hat allein schon einen Anteil von 15% Wasser, was die Zumischung von „reinem“ Wasser für meine Basis nochmals verringert).\n\nNach einigen Experimenten bezüglich des Auflösens hat sich für mich das einfachste Verfahren als das praxistauglichste herausgestellt: Ich mische einfach die neutrale Basis an und löse das Koffein direkt darin auf. Ich habe dazu die Basis auf ca 75° erhitzt, was dazu führte, dass sich das Koffein sehr leicht sofort auflöste. Zu besseren Durchmengung habe ich die Flasche in einem einfachen, mit 75° heißem Wasser gefüllten Ultraschall-Bad insgesamt 3 x 8 Minuten „durchrütteln“ lassen. Das Ergebnis ist eine absolut klare Basis ohne Klümpchenbildung. Bei normaler Zimmertemperatur konnte ich bisher keinerlei Auskristallisieren feststellen. Ein Fläschchen, das ich für 12 Stunden auf ca. 4° C herunter gekühlt habe, zeigte eine sichtbare Trübung, die aber nach Erwärmen auf Raumtemperatur wieder verschwand.\n\n![image alt](img/cliq.png)\n\nNach erfolgreichem Ansetzen der Basis habe ich zunächst einen Geschmackstest ohne Aromatisierung in verschiedenen frisch gereinigten und gewickelten Verdampfern unternommen (Taifun GT, Kayfun 3.1 und Mini 2.1, Patriot Mega, Euforia sowie BT-LV). Meine inzwischen nach 1 1/2 Jahren rauchfreiem Lebens recht gut regenerierten Geschmacksnerven habe mir signalisiert, dass das Koffein in der Basis keinen wahrnehmbaren Beigeschmack erzeugt. Das anschließend angemischte Liquid mit meiner „Standard-Lieblings-Rezeptur“ ließ auch keinerlei geschmacklichen Unterschied zu der nikotinhaltigen Variante erkennen.\n\nAlso ging ich nun in den intensiven Selbstversuch, wobei ich einen guten Freund an Bord geholt habe, für den ich auch sein „Leib-und-Magen-Liquid“ mit Koffein angemischt habe.\n\n**Mein bisheriges Fazit (nach zwei Wochen Test):**\n\nDer Throat Hit durch Koffein ist dem durch Nikotin absolut vergleichbar. Er setzt (subjektiv betrachtet) vielleicht ein wenig „sanfter“ ein, befriedigt aber absolut. Im Gegensatz zu den von mir bisher getesteten „Flash-Zutaten“ bewirkt er kein Kratzen in den Atemwegen sondern übt den gewünschten Druck auf die Bronchien aus. Allerdings musste ich feststellen, dass die Angabe „eine Stufe höher als Nikotin“ zumindest für mich nicht voll zutrifft. Für mich, als 9 mg Nikotin gewohnter Dampfer, ist eine Mischung mit 15 mg Koffein pro ml Liquid noch zu gering. Es hat sich für mich herausgestellt, dass ich den Anteil im Vergleich zu Nikotin ziemlich genau verdoppeln muss, um den gewünschten Effekt zu erreichen. Dementsprechend läuft mein Selbstversuch nun mit 18 mg Koffein pro ml Liquid weiter. Damit bin ich sehr zufrieden.\nNun noch ein paar Worte zu der Koffein-Menge…\n\nEine Tasse Kaffee (zwischen 100 und 125 ml) enthält ungefähr 30 bis 150 mg Koffein. Um die selbe Menge Koffein wie bei der „dünnsten Plärre“ zu mir zu nehmen, muss ich bei meinem Koffein-Anteil im Liquid knapp 1.7 ml Liquid verdampfen. Im Vergleich zum stärksten Kaffee brauche ich schon fast 8.4 ml Liquid. Das halte ich für eine recht geringe Menge an Koffein, die ich mir durch das Dampfen zuführe.\nBei Menschen liegt die letale Dosis bei ungefähr 10 Gramm Koffein (5–30 g).\n\nNach derzeitigem Stand meines Selbstversuchs muss ich sagen, dass Koffein als Nikotin-Ersatz durchaus gut funktioniert. Selbstverständlich fehlt ohne Nikotin auch die Wirkung dieses Stoffes, aber wer gerne auf nikotinfreies Liquid umsteigen wollte, dies aber wegen des fehlenden Throat Hits bisher nicht getan oder geschafft hat, kann mit Koffein Erfolg haben. Überdies gibt einem die Möglichkeit, bei vergleichbarem Genuss auf Nikotin verzichten zu können ein gutes Gefühl, weil nun die politischen Machtspielchen bezüglich der „eZigarette“ an Bedrohlichkeit verlieren. Und was auch nicht zu verachten ist, ist die finanzielle Seite dieser Alternative. Ein Liter Liquid in der Stärke 18 mg Koffein pro ml kostet mich nicht einmal 20,- €. Nicht schlecht, oder?\n\nDer Versuch geht jedenfalls weiter und ich werde hier auch weiter berichten. Ich bin schon gespannt, was mein Versuchs-Partner zu berichten hat…"
		},
		{
			"post_id": 3,
			"title": "AFAIK 001 – Fette Öle / ätherische Öle = zwei Paar Schuhe",
			"date_published": 1475163285.161,
			"body": "![AFAIK](img/AFAIK.jpg)\n\n**Um Gottes Willen, das enthält ätherische Öle… willst Du Dich umbringen? Das darfst Du auf keinen Fall dampfen, sonst bekommst Du eine Lipidpneumonie!**\n\nSo, oder so ähnlich liest man immer wieder, wenn z. B. von Forscherdrang getriebene DIYS-Dampfer davon schreiben, gewisse Aromen selbst herzustellen… vielleicht durch Extraktion oder Mazeration… oder wenn jemand ein angenehmes ätherisches Öl als Aromazusatz verwenden möchte.\nNun, Lipidpneumonie wird ausgelöst durch die Aspiration **fetter Öle** oder **mineralischer Öle**. Diese lagern sich in der Lunge ab und verursachen Entzündungsreaktionen. Hauptursache dieser ohnehin äußerst seltenen Erkrankung ist das Eindringen von fetten Ölen oder Fetten aus Cremes, Nasenölen, Nasensalben, Lippenbalsam und Abführmitteln. Letztere können bei Reflux z. B. gerne auch im Schlaf in den Atmungstrakt und damit in die Lunge gelangen. Ach ja… Feuerschlucker gehören ebenfalls zu einer Risikogruppe, weil die brennbare Flüssigkeit teilweise Terpene oder Paraffine enthält und auch aspiriert werden kann. Also… **fette Öle** oder **mineralische Öle**. Das sind schon zwei Paar verschiedene Schuhe, die sich aber in Hinblick auf das Gesundheitsrisiko ähneln.\n\n**Ätherische Öle** hingegen sind ein völlig anderes Paar Schuhe. Das sind eben **KEINE fetten Öle**. Es handelt sich um duftende und leicht flüchtige Stoffgemische, die (im Gegensatz zu Fetten und Ölen) auf Papier auch _keinen Fettfleck_ (wohl jedoch Flecken… aber halt nicht transparent) hinterlassen. Solche ätherischen Öle verursachen keine Lipidpneumonie. Hat man einen grippalen Infekt (Husten, Schnuppen, Heiserkeit) empfiehlt der Arzt (weil es an sich keine wirkliche Therapie dagegen gibt… kommt sieben Tage, bleibt sieben Tage, geht sieben Tage) Inhalation z. B. durch Dampfbäder, denen gerne auch ätherische Öle zugesetzt wurden. Wick Vaporub auf die Brust führt ebenfalls zur Inhalation ätherischer Öle und in der Aromatherapie finden sie Anwendung. Wer solche Methoden empfiehlt, ist aber kein Mörder, der dem Anderen eine Lipidpneumonie unterschieben will. Sie entsteht dadurch halt nicht. Abgesehen davon ist auch die zu erwartende Menge an ätherischen Ölen, die beim Dampfen solcher Liquids aufgenommen würde, so gering, dass kaum eine Gefahr bestünde. Das Zeug ist sehr intensiv und ergiebig… da braucht‘s extreeem wenig, um einen Geschmack zu erzeugen.\n\nAlso bitte nicht die Leute ausschimpfen, die auf solche Ideen kommen. Sofern man sich im Klaren darüber ist, WAS man da ggf. extrahiert oder was das Aroma enthält (eben **bitte keine fetten Öle**… wobei die meist auch nicht aromatisch sind und deshalb kaum in Betracht kämen), handelt man sich damit auch keine Lungenentzündung ein.\n\nDas könnt Ihr nun glauben… oder es lassen… ;)"
		},
		{
			"post_id": 2,
			"title": "Willkommen beim NebelHorn…",
			"date_published": 1475075612.141,
			"body": "![NebelHorn](img/nhorn.jpg)\n\n…der dezentralen Sammelstelle für ausgewählte Inhalte aus der Dampfdruck-Presse. Im Prinzip ist das hier nur ein Experiment, wie sich ZeroNet sinnvoll nutzen lässt. Aber zusätzlich hat dieses \"Labor\" natürlich auch den Vorteil, dass wichtige Inhalte aus der DDP schlicht nicht mehr verloren gehen sollten.\n\nHier werdet Ihr die Reihe zum \"Koffein-Experiment\" finden, ebenso die \"Faser-Serie\" und das \"Tabakextrakt-Experiment\". Außerdem werde ich nach und nach die politischen und vor allem die rechtlichen Betrachtungen einpflegen… und mal schauen, was noch so kommt."
		},
		{
			"post_id": 1,
			"title": "Hier ist das NebelHorn",
			"date_published": 1433033779.604,
			"body": "Der Teil-Mirror der Dampfdruck-Presse… mit ausgewählten interessanten Inhalten aus der DDP."
		}
	],
	"tag": [
		{
			"value": "AFAIK",
			"post_id": 3
		},
		{
			"value": "Allgemein",
			"post_id": 2
		},
		{
			"value": "Allgemein",
			"post_id": 1
		},
		{
			"value": "Koffein",
			"post_id": 4
		},
		{
			"value": "AFAIK",
			"post_id": 5
		},
		{
			"value": "Kommentar",
			"post_id": 6
		},
		{
			"value": "Presse",
			"post_id": 6
		}
	]
}