{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1515489402,
			"title": "ZeroLSTN - Music Streaming For All!",
			"body": "http://127.0.0.1:43110/ZeroLSTN.bit\n\nHello all, I am excited to announce to you [ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit)! A new music streaming zite for ZeroNet using BigFile and MergerSite technologies!\n\nZeroLSTN is a front-end for listening to music files stored in what are called *Merger Zites*. Each one is organized by Genre, so you'd have one for Rock, Jazz, LoFi etc. Songs are then \"uploaded\" to these merger zites, where their BigFile metadata is stored. **This means you won't actually see songs of a particular genre until you add its corresponding Merger Zite in the 'Genres' tab**.\n\nDon't see your desired genre? No worries! Genres can easily be created with the Add Genre button. It'll redirect you to the new Genre Merger Zite where you'll set up its name, then back to ZeroLSTN where you can publish your new genre to the masses!\n\n*Note: Your genre won't publish until someone decides to add your genre on their end, but it's still available to download. In the meantime, consider adding it to a public ZeroNet proxy!*\n\n## Goal\n\nZeroLSTN is structured in such a way so that the users have complete control over their music. I've left the 'Genres' tab relatively empty for now so that the users are the ones to create them and fill them with content. I'm well aware that copyrighted music may get loaded onto the zite because of this, but also **please be aware that I will have no control over that data!** I won't have the key to the genre or the songs you upload, so they'll be entirely your responsibility!\n\nI'm also aware that some people may object to having copyrighted music stored on their computer, especially if they are in a country where that is illegal. For proxies and for regular users, I will be adding tools to prevent certain content being download, either through matching regex strings on song content or other methods. For proxies in particular, I plan to have a separate file that only proxy operators can modify that ZeroLSTN will read and adhere to when asked to download new songs. Remember that ZeroLSTN is just a front-end for Merger Zite data, so while we can hide content on the main zite, the content is still freely available for others to display on their own music streaming zites.\n\nYes, that's right! I *encourage* you to copy ZeroLSTN and make your own music streaming zites, then into the ZeroLSTN database to *get all user music instantaneously* and vice versa! Once you hook in (if you set it up correctly, and I'll help you do so), any songs uploaded to your zite or ZeroLSTN will appear on both!\n\nOf course, if you want to submit small changes, submitting them to ZeroLSTN instead of making a copy is probably the best idea, but if I reject your idea, then just make your copy! Nobody's stopping you!\n\n## Future Plans\n\nI am currently in the process of writing a dev blog which will feature a how-to on how to create a Merger/BigFile/Indexed Zite from the ground up, as well as lots of other tips and tricks for zite development. I hope it will help others start making zites as the current documentation is, as we know, quite barren :)\n\nOf course I plan to update the zite and add new features in the coming days. I am just about to head on vacation, but will certainly be around most of each day to answer questions and take feedback.\n\n## Conclusion and Thanks\n\nI just want to say I couldn't have done most of this without the wonderful imachug/GitCenter and Krixano for their [GitCenter](http://127.0.0.1:43110/GitCenter.bit) and [ZeroExchange](http://127.0.0.1:43110/ZeroExchange.bit) zites! Reading through their source code proved **invaluable** to figuring out how all this stuff works. GitCenter especially with its awesome concept of creating Merger Zites on the fly, and listing them in an index which *is in itself another Merger Zite.* Nuts!\n\nAdditional props to missesrobot with [KopyKate](http://127.0.0.1:43110/big.kopykate.bit). Your first - actually useful - implementation of BigFiles inspired the whole zite!\n\nI plan to list the source code on GitCenter post-haste, but for now it's sitting on GitHub at https://github.com/anoadragon453/ZeroLSTN\n\nAlso while you're here, be sure to check out my ZeroNet Starter Zite Template at https://github.com/anoadragon453/ZeroNetTemplate I'll be adding a tutorial on the dev blog in the next few days on how to get set up with using it and making stuff.\n\nCheers!",
			"added": 1515489401
		},
		{
			"topic_id": 1516961495,
			"title": "Introducing ZeroLSTN Dev Notes!",
			"body": "[ZeroLSTN Dev Notes](http://127.0.0.1:43110/Notes.ZeroLSTN.bit) is a new blog for various developer posts related to ZeroLSTN development, as well as general tips and guides for new ZeroNet site developers to start creating their own Zites.\n\nI plan to add more posts about general zite development, in order to make things more accessible to the masses. There will also be tips and tricks for the experienced zite developers, as well as detailed guides for developing with more complex features such as Merger zites.\n\nThe first post is a general overview of how ZeroLSTN works under the hood. I hope it will be useful to others to explain ZeroLSTN's architecture, and I plan to update it as the zite grows and changes fundamentally over time.\n\nI'm excited for any feedback. Let me know what you think!",
			"added": 1516961493
		},
		{
			"topic_id": 1522109475,
			"title": "Need help with a JavaScript Library",
			"body": "I'm looking to add deduplication support in the next iteration of ZeroLSTN. I plan to do so using the following library:\n\nhttps://www.npmjs.com/package/chromaprint.js\nhttps://github.com/bjjb/chromaprint.js\n\nI can't for the life of me figure out how to get this library imported and start using it. It has detailed documentation, but I don't seem to be able to get it working in the browser.\n\nAnyone with NodeJS experience able to lend a hand?",
			"added": 1522109472
		},
		{
			"topic_id": 1528064284,
			"title": "ZeroLSTN v2.0 RELEASE!",
			"body": "Ladies and gentlemen, I present to you the vastly new and improved ZeroLSTN v2!\n\nhttp://127.0.0.1:43110/zerolstn.bit\n\nChanges since the last release:\n\n* Ability to edit any song, and merge songs together!\n* Upload more than one song file at once! (see note below)\n* DARK THEME\n* Playlists\n* Support for Compilation Albums\n* Songs now organized by decade instead of by genre\n* Multiple genre support per song\n* Song deduplication\n* Helpful tooltips\n\nYes, the metadata of any song can now be edited by anyone. This is a Wikipedia-style approach, and allows anybody to help curate broken or misspelled titles, albums, artists etc. Songs can also be merged into one another, so if something got past the deduplication checker, such that there exists two copies of the same song, one can simply be merged back into the other.\n\nMulti-song upload NOTE: Multiple songs or an entire folder can now be selected in the filepicker. This works recursively, so simply selecting your entire 'Music' folder and hitting upload will upload all the song files contained within.\n\nHowever, as a sidenote, do be aware that music purchased from some services such as iTunes etc. can include personally identifiable information in it. For this it is recommended to wipe any music metadata other than what's strictly necessary (like Artist/Album/Title/Year/Genre etc), so that you can be sure your name is not attached to the files (if you care). Also be aware that not all filetypes (.wma for example) can be played natively in the browser.\n\nTo solve both these problems there is a python script in the site files at [scripts/cleantags](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/scripts/cleantags@master) that will convert all songs its given to MP3 and wipe any identifying metadata. The script is still a work in progress, so a backup to your music beforehand is strongly recommended.\n\nThat's it, enjoy ZeroLSTN v2!\n\nSource code available here: http:127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1Code5125iycoEFCMi9a4XVejFwauoyGqj\n\nZeroLSTN-based ZeroTalk: http://127.0.0.1:43110/Talk.ZeroLSTN.bit/\n\nReport any bugs [here](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj) <3",
			"added": 1528064280
		},
		{
			"topic_id": 1539808632,
			"title": "KxoVid: New Streaming Site on the KxoNetwork",
			"body": "Krixano has created a new video streaming site! Give it some love with you?\n\nhttp://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/\n\nZeroMedium post with more details: http://127.0.0.1:43110/ZeroMedium.bit/?/12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu/kxovid-official-release",
			"added": 1539808627
		},
		{
			"topic_id": 1557305635,
			"title": "FYI Krixano is deleting their older zites",
			"body": "krixano@{zeroid.bit,kxoid.bit} is in the process of deleting his older zites.\n\nFor the purposes of learning, source code for them is still available on their [github](https://github.com/krixano).\n\nYou can continue to check out his current projects: [KxoBlock](http://127.0.0.1:43110/161W1XFqy3dFyeaGuw34eH4GKvCnbbCLPR/?/), a zite to share and manage ZeroNet blocklists, and [KxoID](http://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/kxoid), a federated Identity Provider with unique username checks.",
			"added": 1557305629
		}
	],
	"topic_vote": {
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1516230999_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1518231194_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1519162899_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"1518616574_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1519172995_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1528064284_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": 1,
		"1538339081_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1539808632_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1539742216_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": 1,
		"1540051200_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1557305222_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1
	},
	"next_comment_id": 77,
	"comment": {
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 1,
				"body": "As this is an initial release, expect some rough edges as the kinks are worked out and new features are added. Please report any bugs or glitches you encounter in the comments (or the issue tracker, or ZeroMe, etc). And I'll be sure to fix them!",
				"added": 1515489503
			},
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_28_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): This is nice, there is a new project.Your links in your first post are missing .bit extension i assume. Currently site do not load, says: content.json download failed.\n\nOops, too excited to post. Corrected, thanks!",
				"added": 1515490165
			},
			{
				"comment_id": 3,
				"body": "> [krixano](#comment_302_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I see you added mpeg from the GitHub commits page. Are you planning on updating the zite again with that or waiting until the next version?\n\nOh, very odd. Yes I ran into the same issue while testing proxy uploading (which works, would like to know people's thoughts on allowing this) and signed/published in order to allow to proxy to function and it worked.\n\nI've signed/published again, let me know if the change still doesn't reach you!",
				"added": 1515511199
			},
			{
				"comment_id": 4,
				"body": "> [bitwolf](#comment_9_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): This looks interesting... might be just the thing to point out to a cousin of mine who I was discussing some fun ZeroNet ideas to try out with him.On a sidenote, your link to the ZeroNet Starter Zite template results in a \"404 page not found\"\n\nYep, just realized I had written anoadragon453/ZeroNet/ZeroNetTemplate, which is not a real repo :P Thanks for catching that!",
				"added": 1515530152
			},
			{
				"comment_id": 5,
				"body": "Update: Songs/Albums/Artists now sorted alphabetically. Looking into having Chinese Characters display correctly now...",
				"added": 1515530187
			},
			{
				"comment_id": 6,
				"body": "So it seems if you add a genre and it isn't well-seeded, it won't actually add the genre. I'm getting this issue with ProgRock where even navigating to it directly isn't downloading. Hopefully this will become less a problem as the main genres are created and seeded healthily.\n\nIn the meantime, if you are having an issue with adding a genre and it doesn't add on a refresh (after waiting a few seconds), let me know and what genre you tried it on and I'll try to figure out a solution in the meantime. First and foremost is likely pulling in the new music without refreshing the page :)",
				"added": 1515565473
			},
			{
				"comment_id": 7,
				"body": "Update: Chinese Symbols, Forward slashes, Spaces, what-have-you now all work in genre names, and I have removed the regex check when registering one on new genre sites. Found out I could just HTML-encode the name when sending it via a URL back to ZeroLSTN.\n\nThis means that people creating *new* genres with special characters or spaces won't have to worry. If you want to change/fix your *existing* genre, you'll have to do so in the site index (or until I add genre editing/deletion support which is high on my TODO). If you need specific instructions on how to do the former until the tools are in place just ask and I'll do a step by step guide.\n\nChinese:\n更新：中文，符号，正斜杠，空格，你现在都在类型名称工作，我已经删除了在新的流派网站注册一个正则表达式检查。 发现我可以只是通过一个URL发送到ZeroLSTN HTML编码名称。\n\n这意味着创造具有特殊字符或空格的新流派的人们不必担心。 如果你想改变/修复你的*现有的*类型，你必须在网站索引中（或者直到我添加了我的TODO上的流派编辑/删除支持）。 如果您需要具体说明如何做到这一点，直到工具到位，只需要问一下，我会一步一步地指导。",
				"added": 1515567655
			},
			{
				"comment_id": 8,
				"body": "> [krixano](#comment_308_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Okay, so on my own client, when I click a song it starts downloading. However, when I do the same thing on ZeroCat proxy, it doesn't start downloading and there's this error in the console: [...]\n\nSeems that ZeroCat is disallowing something in its merger settings, seeing that my proxy has no problem with that address, while ZeroCat gives [an error](https://zerocat.eu/ZeroLSTN.bit/merged-ZeroLSTN/1Cf2PPFkvCTPFA7xyE21cA1houAM5Soy3F/data/users/12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu/01_-_Rolling_In_The_Deep-1515514118542.mp3) with it. Any idea @missesrobot?",
				"added": 1515621744
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_38_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I tried to play numerous songs and this one too now and it does not play.\n\nAre you able to play the song if you [navigate to it directly](http://127.0.0.1:43110/ZeroLSTN.bit/merged-ZeroLSTN/1Cf2PPFkvCTPFA7xyE21cA1houAM5Soy3F/data/users/164x9q7LJPLX4SMbhqLPraKAGZRPa2gTFe/Katy_Perry_-_Roar-1515492202155.mp3)? If so, then it may be related to what [this guy was getting](https://stackoverflow.com/questions/44200990/html5-audio-player-in-firefox-is-not-working), and in that case I can try the workaround (though embedded iframes won't work within ZeroNet).",
				"added": 1515622734
			},
			{
				"comment_id": 10,
				"body": "> [ssdifnskdjfnsdjk](#comment_39_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zerolstn when i open that link directly, it loads the player a few tens of seconds and then shows player with text \"Video format or MIME is not supported.\"\n\nYeah that's strange, I'll keep looking into it though, perhaps try Chrome as well. I saw a similar error from someone not having the codecs installed in their OS, which was Linux. Can you normally play mp3s? Was the file you uploaded an mp3?\n\nTry the deadmau5 - snowcone song, looks like it's an m4a.",
				"added": 1515627396
			},
			{
				"comment_id": 11,
				"body": "Update: Seeds are now shown for each song! Should give people some more info on why songs are or aren't downloading/playing.",
				"added": 1515627417
			},
			{
				"comment_id": 12,
				"body": "> [ssdifnskdjfnsdjk](#comment_40_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zerolstn thank you, playback started working now. \n\n1-3 are on the TODO, 4 is one I didn't think of, thanks!",
				"added": 1515655952
			},
			{
				"comment_id": 13,
				"body": "Update: You can now edit genre names and delete them from the index. No more worrying about your mistakes!\n\n@nofish: It seems that the `mergerSiteDelete` ZeroFrame command doesn't work at least for myself and my proxy. I'll make a formal GitHub issue in a bit.\n\nEdit: [Issue](https://github.com/HelloZeroNet/ZeroNet/issues/1238)",
				"added": 1515656018
			},
			{
				"comment_id": 14,
				"body": "> [missesrobot](#comment_86_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): Playback works fine now. :)\n\nGreat!\n\nEdit: Playback on Zerocat still gives me the `HTTP load failed with status 500.` error, is that what you were referring to?",
				"added": 1515656797
			},
			{
				"comment_id": 15,
				"body": "> [valimero](#comment_2_1NpBDnpSGkXGKLtq9x75Lb846dfgLCWNtn): I'm Adding some Gorillaz in \"Alternative\"\n\nAwesome, love that band!",
				"added": 1515715365
			},
			{
				"comment_id": 16,
				"body": "Update: Song views have been redesigned. They will tell you whether the song has been downloaded (green background), and what genre they're from!",
				"added": 1515715403
			},
			{
				"comment_id": 21,
				"body": "Update: v1.0.2!\n\n* Queue an entire album/artist at once\n* Download an entire album/artist at once\n* Download individual songs without playing them\n* Artists/albums now have a set URL, which you can link to\n* New icons\n\nDownloading of full albums/artists currently shows no progress other than the ZeroNet progress bar and thus is kind of misleading, but I am working on showing live download progress per-song, which should make the downloading experience better :)",
				"added": 1515790713
			},
			{
				"comment_id": 22,
				"body": "> [ssdifnskdjfnsdjk](#comment_43_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zerolstnmobileHi, regarding feature that allows >>>editing of song names/artists.. to anyone<<< Here is another idea on requirements that may be required from user to edit someone elses song name/details. [...]\n\nThanks for the ideas, they're a good starting point for thinking about how to cut down on spam and trolls.\n\nUnfortunately, I think we'll be able to enforce many of them as the user can simply insert the data and manually sign/publish it in the files, which effectively bypasses all of those mitigations.\n\nInstead, we need to think of how users can determine whether an edit is allowed or not, and don't apply/process it if it's not for whatever reason.",
				"added": 1516239286
			},
			{
				"comment_id": 23,
				"body": "**Release v1.0.7!**\n\n## Album Art\n\nThere is now album art! Upload it by editing existing songs and saving.\n\nAlbum art is currently stored per song, so only the uploader may edit it. I plan to perhaps make everything world-editable at once, however album art is, for right now, uploader controlled.\n\nAlbum art is stored as actual files, no uncompressed base64 anywhere. There is de-duplication via sha512 hashing, so if an album has 100 songs and a user uploads the same album art for each, there will only ever be 1 image file uploaded. This extends across all users, so any album art shared between users is also de-duplicated.\n\n## Now Playing\n\nThere is now a Now Playing page, which will show the play queue as well as the current song's details and its album art!\n\nIt should be pretty mobile-compatible. Do test it with all sorts of weird and wonderful screen sizes and let me know how you get on.\n\n## Recommended Genres\n\nGenres are now sorted into 'Recommended' and 'Community'. This is done for two reasons. The first is to help new users in choosing their first genres. The second is that there is some messily-named genres or genres that don't have any seeders. It is confusing to new users downloading these genres when they never download. Thus, the Recommended list is personally curated, mostly based on genres that actually have seeds, but also won't include 'Test' genres or ones with strange names.\n\nOf course feel free to browse and add from the Community list as well. There will soon be a ZeroTalk clone where people can suggest and discuss new genres to be added to the Recommended list :)\n\nOn another note, genres are also no longer downloaded in the background, as this caused some confusion for those that had no seeders. Instead, a popup explaining genres will appear when adding one, with a button that will lead you to the actual genre page, where you can view the download progress. You also cannot remove genres from the site anymore due to another [ZeroNet bug](https://github.com/HelloZeroNet/ZeroNet/issues/1238). For now please remove them manually from ZeroHello.\n\nAdditionally, just wanted to give props to Quickbrownfox with the \"Synthwave\" genre and its [awesome landing page](http://127.0.0.1:43110/1MyRisi77oMj1qkHkGyAwSRGXKCiZ4PGxB/). Such wow, many musics. (P.S. User music is a separate file for every user. Let me know if you're still having sync problems and we'll try to resolve it).\n\n## Keyboard Shortcuts\n\nI've implemented some basic keyboard shortcuts for controlling playback. The current shortcuts are:\n\n* 'Space' for pause/play\n* 'b' for previous song\n* 'n' for next song\n\nLet me know what else would be good to add, or if the shortcuts don't work for you.\n\n## Better Play Queue Management\n\nYou can now remove individual songs from the play queue, as well as clear the entire thing in one go. Re-organizing the play queue still isn't possible. I wanted to have a drag-n-drop interface for this but it seems like it's not possible with the UI toolset I'm using. \n\nI'll look into another way of doing so, but for now it might just have to be 'up'/'down' on each song. Let me know if you have any better suggestions for moving around play queue content.\n\n## Song Management\n\nIndividual songs can now be downloaded without playing them. You can also play an entire album/artist immediately without having to first Queue and *then* play. Quite handy.\n\nThere was also an issue I noticed with users over a proxy being unable to delete songs due to (what I presume) is a ZeroNet bug. [Issue here](https://github.com/HelloZeroNet/ZeroNet/issues/1140).\n\n## Etc\n\nAnd of course lots of bugfixes and general cleanup. I've just recently learned that you can do conditional JOIN's in sqlite3, which will allow for a few speedups in places.\n\nThe codebase is getting quite large but it still feels fairly organized and I've got comments explaining everything all over the place. If you're ever interested in how ZeroLSTN works do feel free to [pop into the codebase](https://github.com/anoadragon453/ZeroLSTN) and have a look around!\n\nOtherwise, next update will be coming when it comes. The winter holidays have finally concluded and work is now beginning to eat up some time. I plan to implement playlists soon, as well as restoring the play queue after a refresh. I also plan to try and cut down on the number of refreshes necessary, and load content from genres dynamically as they're added.\n\nI also plan to remove the 'Songs' tab from the main page since it takes quite a lot of processing to load every single song now. From my own experience I typically go Artist>Album>Song or Album>Song instead of going to the song tabs and searching through there. Let me know what you think.\n\nAlso Search, definitely going to be needing that soon ;)\n\nThank you and enjoy!",
				"added": 1516254552
			},
			{
				"comment_id": 25,
				"body": "> [dude](#comment_3_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): when you attach cover art, it is displayed full size and you can get to save button only if zoom out entire page, even on fhd screen [...]\n\nThanks for reporting this. It seems the view sometimes does not allow scrolling after navigating from the uploads to the edit page, and thus when the album art is inserted, being unable to scroll becomes a problem. I'll look into this and see what can be done. It may be a ZeroFrame Router issue, but not sure yet.\n\n> after that, [i can't see the image anywhere] edit: found it, on now playing page ;)\n\nYeah I'll probably end up sticking it on the songs as well, just to give things a bit more visual difference.\n\n> missing features:\n\nGreat list! Being able to choose how lists are sorted would be nice indeed. Uploading many files at once shouldn't be *too* hard, perhaps bulk editing could be implemented as well. I know it'd be very useful for uploading an entire album.\n\n> pop-up tooltips for ui elements, like wtf is cloud icon, or triple minus on the queue\n\nDidn't even think of this, great suggestion. Will add.\n\n> [ssdifnskdjfnsdjk](#comment_44_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zerolstn Hi, when i try to add new Genre (in my case \"Synthwave\"), i click + button, the popup box appear, in it i click \"+ download genre\", popup box disappear and Tor browser says that it prevented this site opening window, and it is this one: http://127.0.0.1:43110/ZeroLSTN.bit/null\n\nNah I wasn't aware of this, thanks! I could see the Tor browser blocking the new tab, but the fact that the genreAddress is null is strange. Will look into it.\n\n> I go to: ARTISTS, artist name, some album, some song which i already listen/have downloaded and next to the song is a cloud icon with a ticker inside it, i click it and it refresh the page..\n\nIt's even funnier that all three cloud_done icons on artist/album/song do three different unimplemented things. Yeah I forgot to implement deleting songs, will correct that bug post-haste, thanks for reporting!",
				"added": 1516318831
			},
			{
				"comment_id": 26,
				"body": "[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.0.8 released!\n\n* Remove 'Songs' tab from the main page due to heavy processing.\n* Small UI fixes.\n\nWith the recent influx of new songs, it's become apparent that the homepage is in desperate need of some pagination/lazy-loading abilities. The biggest resource hog was definitely the songs tab, especially if you have many genres downloaded. I've removed that for now for performance reasons.\n\nFret not, adding searching capabilities is next up on the TODO list. I plan to have the default be a global artist/album/song search, while also being able to select what you're searching for (artist/album/...) as well.\n\nThere is also now an official ZeroLSTN Forum: [ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit)! Huge thanks to balancer73 for the initial idea. I had to clone the site as I plan to change up the styling a bit, but if you want to be a moderator (if that's possible), just ask :)\n\n[ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit)will be *the* place for ZeroLSTN updates, news and discussion. It's also the place to propose your genres for addition to the Recommended Genres list, as well as just discussion on songs, albums, the site in general, etc.\n\nSo come on in and join in the fun!",
				"added": 1516702388
			},
			{
				"comment_id": 31,
				"body": "## Here comes the Search!\n\n* Search has been added. Access it through \"Search\" at the top of the page, or in the sidebar on mobile.\n* Fixed the tab lengths on Homepage. Didn't notice that til now, whoopsie!\n* Clean up up code indentation. It was horrible, my IDE was lying to me.\n* Added Christian genre to recommended list.\n\n## Why a new minor version?\n\nThe reason I'm bumping the version to v1.1.0 is because I feel Search was the last missing feature to make the site *usable*. Sure there's still a lot of things to add and fix up, but I'm starting to get the feeling I could use ZeroLSTN as my main music player (and just let ZeroNet deal with the hosting ;)\n\n## Future\n\nI'm still buried in work and school, but hopefully I'll be getting more time soon. Implementing Search today took 1hr30m, if you want to get an insight into how much time I really don't have.\n\nThe next major features will be batch uploading (I'm holding back on uploading my own personal library until this is implemented) and wiki-style metadata editing. There will be edit history, and no diffing. While history diffing would be a major space advancement (and implementation headache) for sites like Kiwipedia, song metadata is comparatively light compared to entire Wikipedia pages, therefore I don't think the extra overhead of processing diffs will provide that much benefit over any minor space savings.\n\nAnyways, hope you guys enjoy [ZeroLSTN v1.1.0](http://127.0.0.1:43110/ZeroLSTN.bit/) and let me know of any comments/concerns!\n\nAnd don't forget to join us over at [ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit/?Home) for music discussions and meta-talk!",
				"added": 1517875838
			},
			{
				"comment_id": 33,
				"body": "> [helium](#comment_140_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I think that You should make a very strict restriction that only music in the WebM format is allowed. WebM's are supported by all browsers and they can be scrolled without downloading the whole video/sound. [...]\n\nAre mp3/aac/flac not also streaming-compatible?",
				"added": 1518043456
			},
			{
				"comment_id": 34,
				"body": "> [nekololi](#comment_167_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): \"webm\" audio is just ogg vorbis or opus i think. i don't think people should be transcoding their already crappy mp3's they ripped from youtube into other lossy codecs\n\nOnce loading indicators for tracks are implemented things will be a lot clearer, though that's a bit far down on the priority list at the moment.",
				"added": 1518053816
			},
			{
				"comment_id": 38,
				"body": "ZeroLSTN is getting a database redesign. Read about it and give feedback here: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/1518423898",
				"added": 1518424270
			}
		],
		"1515709199_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 17,
				"body": "Check out [KopyKate.bit](http://127.0.0.1:43110/big.kopykate.bit/).",
				"added": 1515715447
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_87_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't know of any live streaming ones. There's IFS and KopyKate BIG for non-live videos.\n\nI think he meant video platforms that actually worked and had content (live), but a livestreaming platform *would* be awesome.",
				"added": 1515716467
			}
		],
		"1511856741_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 18,
				"body": "Just checked out the update. Icons look nice, and related videos is very handy.\n\nHow does it determine which videos are related and which aren't? I'd be interested to know.\n\nAlso should probably be titled 'Related' rather than 'Up next' unless there's autoplay available, but that's just a personal thing :)",
				"added": 1515715646
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_88_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Also, background play will be nice for music.\n\nWhat do you mean by background play? Keeping a tab open or being able to browse other videos while a video is still playing in the same tab (like YouTube mobile does?).\n\nOr are videos stopping when you exit your browser on mobile?",
				"added": 1515719252
			}
		],
		"1516230999_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 24,
				"body": "This was the ZeroUP clone I believe: [UnlimiUP](http://127.0.0.1:43110/12fgcJtfBFHh7escCwtNwdjWRY6qPCFBG7/).\n\n+1 for a hacker-teacher zite!",
				"added": 1516254999
			}
		],
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 27,
				"body": "> [belly](#comment_15_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ): I'm afraid that if the distributed auto-download is an opt-in feature, the 0net wikipedia will never reach an acceptable size.  Maybe the opt-in feature could be strongly recommended on the front page?  Or just an opt-out.... [...]\n\nYes, it auto-downloads and seeds *ZeroNet content*, which you would expect from running ZeroNet. When you visit KopyKate do you know that half the video thumbnails are coming from random websites that thus have the ability to see whenever your IP is viewing KopyKate?\n\nIf this is to be opt-out, it needs to be clearly visible to the user that this is occurring. I'd recommend a visible 'Auto-Download Missing Articles from Wikipedia' toggle available in the navigation bar (or somewhere else on the page) at all times, as well as a clear indication that the article you are about to view came from Wikipedia instead of ZeroNet.\n\nIt would also give people an indication on how the ZeroNet cache of Wikipedia is doing in respect to Wikipedia itself as they start to see less and less loading pages over time.",
				"added": 1516781879
			},
			{
				"comment_id": 28,
				"body": "> [kaffie](#comment_561_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I think something like how ZeroMe works for user profiles who you haven't downloaded: show a \"this page isn't on zeronet! Click here to upload it and contribute!\" button.\n\nYep, possibly with a \"Do this automatically in the future\" checkbox down below would be nice as well, of course with a way to disable it later.",
				"added": 1516787566
			}
		],
		"1517193644_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 29,
				"body": "> [styromaniac](#comment_138_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm thinking I want a Purism phone. ZeroNet might run better than an Android phone running the same hardware, because it's true Linux, meaning less Java and other high level program language use. It has hard switches for the camera and the microphone. I like GNOME-Shell and I'm glad to see it in a phone layout.\n\nI pre-ordered one. I'll let you know how it is when I get it :P",
				"added": 1517196625
			}
		],
		"1517149777_15u6EAgfa3mnQBcDgyx1LWVCVdhyJ7v1MZ": [
			{
				"comment_id": 30,
				"body": "Anyone interested in ZeroNet in a browser extension should check out this repo: https://github.com/ZeroNetJS/zeronet-js\n\nAnd contribute if you have JS skillz :)",
				"added": 1517533959
			}
		],
		"1517996302_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": [
			{
				"comment_id": 32,
				"body": "Also don't forget about Tor's Open Observatory of Network Interference: https://ooni.torproject.org/\n\nFor instance, here's an example of Wikipedia on 2017-04-07 from Turkey looking normal: https://explorer.ooni.torproject.org/measurement/20170407T051849Z_AS22363_lNgTdMXWpcjDrOzpwjlQIN6kCeAMlNWJay71YG1tl1p0CtzUIh?input=https:%2F%2Fen.wikipedia.org%2Fwiki%2Fthe_holocaust\n\nAnd here's an example from the same URL on 2017-08-23 being tampered with:\nhttps://explorer.ooni.torproject.org/measurement/20170823T112726Z_AS34984_QbsN4uyJilPLirUTBZmOjjo57WJW0ZXDvzl2gvGx6uZgQ72F36?input=https:%2F%2Fen.wikipedia.org%2Fwiki%2Fthe_holocaust",
				"added": 1518043009
			}
		],
		"1518200694_1A7U9thV94RkQHh3jvfceMMkBS1FeCeQHt": [
			{
				"comment_id": 35,
				"body": "You need to have an 'index.html' in your site files or else it won't load. Create a new index.html file with the following:\n\n```\n<!DOCTYPE html>\n<html>\n\t<head>\n\t\t<title>Genre</title>\n\t\t<meta charset=\"utf-8\">\n\t\t<meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\" />\n\t\t<base href=\"\" target=\"_top\" id=\"base\">\n\t\t<script>base.href = document.location.href.replace(\"/media\", \"\").replace(\"index.html\", \"\").replace(/[&?]wrapper=False/, \"\").replace(/[&?]wrapper_nonce=[A-Za-z0-9]+/, \"\")</script>\n\t</head>\n\t<body>\n        <p>Hello!</p>\n    </body>\n</html>\n```\n\nSave and try to load your site again. It should appear.\n\nTo make it available for others to see, you'll need to draw the sidebar over, toggle on 'This is my site' and click 'Sign/Publish'. Others should then be able to access your content :)",
				"added": 1518223398
			}
		],
		"1518267638_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 36,
				"body": "Reading the title I was about to call you a loony, but I see your point after reading through the text. I've never really thought of those who commit mass homicide as smart, but I also can't really think of any examples where the perpetrator was a complete idiot.. Mentally unstable, dealing with crippling depression sure, but not an idiot.\n\n> Have you ever had fantasies about killing innocent people?\n\nYep, but only as a child, as a way of dealing with anger without actually acting it out. Not exactly the healthiest thing to do, but thankfully most people don't ever go on to carry those out.\n\nI think it's good to make the distinction between terrorist attacks and the lashing outs of a single person following their own reasons. If you start calling every small headline 'an act of terror by a foreign organization' you can very quickly get spooked, leading to irrational decisions in the effort to combat it.\n\nI wonder if any studies have been done showing that more publicly-available mental rehabilitation facilities (non-corrupt ones anyways) leads to less occurrences of 'lone-wolf crimes'. One would hope so.",
				"added": 1518299295
			}
		],
		"1518273484_1J5uFzQBpLpoyTZfH28Fv8KrThShewrF2d": [
			{
				"comment_id": 37,
				"body": "> [akito](#comment_433_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Riot is an end-user client for Matrix. The anonymity is very good, but too often misunderstood. Matrix is currently mainly used to host public chatrooms. Therefore, having full encryption for a public chatroom is kind of senseless. However, if you choose to have a private conversation with, let's say, only 1-3 people you actually know then you can encrypt the chatroom voluntarily in an end-to-end style.That said, Matrix is at least as secure as most other secure communication protocols and networks. In my opinion it is even more secure to use Riot with Matrix than using Signal or other wannabe secure clients that are based on very questionable protocols, to say it mildly. [...]\n\n+1 to matrix. I'm on there as @anoa.\n\nWe should try to get an instance of Riot hosted on ZeroNet...",
				"added": 1518308067
			}
		],
		"1518467842_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": [
			{
				"comment_id": 39,
				"body": "The upcoming snapshot feature should solve this. I'm not sure if only the site owner will be able to make a snapshot, or any user, but either way backups should be seamless.",
				"added": 1518472563
			}
		],
		"1518637483_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 40,
				"body": "[ZeroLSTN](http://127.0.0.1:43110) should be good to show. Play some popular artists like Adele. Add whatever genres you like, though I'd recommend avoiding the \"imported from ZeroMusic\" genre for now as it has quite an offensive artist title right at the top.\n\nSite's getting rebuilt soon, but still should be good to show off right now :)",
				"added": 1518649459
			}
		],
		"1518637294_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 41,
				"body": "> [frosticnotion](#comment_30_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ): I appreciate the guide but can anyone tell me if this link works? [...]\n\nI get a long loading time until it tells me the URL is not found.\n\n[UnlimiUP](http://127.0.0.1:43110/12fgcJtfBFHh7escCwtNwdjWRY6qPCFBG7/) can handle file uploads up to 20GB.",
				"added": 1518652901
			}
		],
		"1519162899_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_183_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Would you be able to make a full screen web browser that gives notifications from ZeroHello and has the option to never access the clearnet?\n\n+1 this",
				"added": 1519258044
			}
		],
		"1519318362_1Li4bx4bNqgu4u5rgRJskD3je2itsd8mVg": [
			{
				"comment_id": 43,
				"body": "IIRC Library Genesis has Sci-Hub's papers and more papers, so if we're going to rehost an archive like that on ZeroNet, we should use LibGen's DB since it's very easy to download/access and has more content.",
				"added": 1519349247
			},
			{
				"comment_id": 47,
				"body": "> [helium](#comment_259_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I have never heard of the \"Library Genesis\" before reading this thread here, but after a quick glance it seems to me that if the \"Library Genesis\" is thehttp://93.174.95.27/as described at thehttps://en.wikipedia.org/wiki/Library_Genesis(archival copy: https://archive.is/k5qBN )then it does not look promising at all, because the referenced site at the 93...27 seems to give mostly broken links or links to some advertisement-ridden pages.  [...]\n\nhttp://libgen.io and http://gen.lib.rus.ec are the proper domains. Usually all the links work for me, for instance [searching for \"computer\" under scientific articles](http://gen.lib.rus.ec/scimag/index.php?s=computer) leads me to a page with many articles. If I click on 'libgen' as the download source, I get [this page](http://libgen.io/scimag/ads.php?doi=10.1002%2F%28sici%291096-8628%2819960216%2967%3A1%3C1%3A%3Aaid-ajmg1%3E3.0.co%3B2-w&downloadname=) with a working download link.\n\nScientific papers can be currently downloaded as an 8.0GB dump on their [downloads page](http://gen.lib.rus.ec/dbdumps/).",
				"added": 1519378387
			}
		],
		"1519107162_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa": [
			{
				"comment_id": 44,
				"body": "> [diediecolor](#comment_2_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa): It wasn't FireChat but very similar. This is a pretty cool app though! Thanks for telling me about it!\n\nBriar?",
				"added": 1519349307
			}
		],
		"1518756137_1EqVDfje26qerF6bkquwrSiAuWU1jYxJLR": [
			{
				"comment_id": 45,
				"body": "> [helium](#comment_250_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): Thank You for the advice, but for some reason neither ZeroLSTN, nor the IFS function at my web browser. That's why I have also deleted and blocked them from my server.\n\nWhat issue are you having with ZeroLSTN? I'm happy to take a look.",
				"added": 1519349373
			}
		],
		"1519377810_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA": [
			{
				"comment_id": 46,
				"body": "Yep, that's the new version. \"Airing Now\" are the most recently uploaded videos. \"VideoBox\" are video that you yourself have uploaded.",
				"added": 1519378067
			}
		],
		"1519821923_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 48,
				"body": "@missesrobot, @sylvaine.\n\nYou're using more space than one account is allowed on KopyKate. Generate another account in the meantime, and ask @sylvaine for more space on yours.",
				"added": 1519872198
			},
			{
				"comment_id": 49,
				"body": "> [kai0](#comment_477_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): thank you and needn't hurry,  I can use another account for now.\n\nIf it's the case of images, you'll need to reduce the size of your thumbnails, or @sylvaine can just raise the size since we're storing massive video files anyways :)",
				"added": 1519891685
			}
		],
		"1519869360_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 50,
				"body": "> [frosticnotion](#comment_36_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ): That does supply every privatekey that i'd probably need but it seems that the problem lies elseware. I'm running into a hard error \"Content signing failed. Private key invalid! Valid signers\". ZeroNet within GitHub has an issue open for this from Oct2017 with no solution, could find no other details on how to properly set the private key for this test site.\n\nHow did you create this site?",
				"added": 1519891739
			}
		],
		"1520325313_12vGfqvgLrpTgBheReey8aa3KVCGsv38XS": [
			{
				"comment_id": 51,
				"body": "wut could it meeeeeean",
				"added": 1520329529
			}
		],
		"1520299122_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 52,
				"body": "Well this is awesome.",
				"added": 1520406621
			}
		],
		"1522198178_1CLQdyjUXGdhWumfS4c7vMA8TkjUhNHQkc": [
			{
				"comment_id": 53,
				"body": "ok",
				"added": 1522202388
			}
		],
		"1523985689_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": [
			{
				"comment_id": 54,
				"body": "Essentially you can put the following in the user's `content.json`:\n\n```\noptional: \".+\\\\.(png|jpeg|jpg|gif)\"\n```\n\nand any `*.png` or `*.jpeg` or whatever files will be marked as optional files, and ZeroNet will not automatically download it when a user loads the site until a [fileGet](http://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/) command is run on that filepath.",
				"added": 1524002706
			}
		],
		"1528064284_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 55,
				"body": "> [htgozn](#comment_170_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): For those who would like to create a private ZeroLSTN box, follow these steps [...]\n\nDon't forget some songs may be slightly larger than 1MB (2-3MB), so setting the limit to 5MB may be the best way to ensure you have the most amount of music seeded locally.",
				"added": 1528202985
			},
			{
				"comment_id": 60,
				"body": "# v2.0.1 Release!\n\nSome minor fixes after the big [v2.0.0 release](http://127.0.0.1:43110/Talk.ZeroLSTN.bit/?Topic:1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/Release+v2+0+0). Mostly bug fixes, but a new feature:\n\n**Features:**\n\n* Song timeouts. if a song is taking too long to load (or has zero peers), we now just skip to the next song in the queue and pop up a toast informing the user what happened.\n\n**Bug Fixes:**\n\n* Numerous fixes with song filenames. We now replace any special or accented characters that didn't play to well with ZeroNet. If you uploaded a song and had '? seeds' on it, this was probably why. Upload a new version and merge the old song into the new one to get things working again.\n* Don't show song edits on the uploads page.\n* Fixed song/album download. Artist download still in the works.\n* Fixed a bug where adding songs to a playlist would add many copies on those songs (turns out it was just in the display code, the proper amount got added in the DB).\n* Fixed a bug where the \"+ Upload more songs button\" would actually replace all the songs you were about to upload instead of adding to them. Whoops :)\n\nAs always, thanks to everyone for suggesting new features and reporting bugs on the [Issues page](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj).",
				"added": 1528500800
			},
			{
				"comment_id": 61,
				"body": "# v2.0.2 Release!\n\nAka the \"I had free time today\" release!\n\n**Features:**\n\n* 你好! Hola! Здравствуйте! Translations are here! If you're able to translate ZeroLSTN into any language other than English, than please do so using [the instructions](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/docs/translations.md@master).\n* Your volume setting now remains even after closing and reopening ZeroLSTN.\n* Artist/Album names in song cells are now links to their respective Artist/Album pages.\n* The song title and artist name are now shown in ZeroLSTN's tab when they're playing. \n\n**Changes:**\n\n* Only show a song's year if it actually has one\n* Move the logo.png file into the img/ directory\n* Make the search field auto-focus when you visit the Search page\n\n**Bug Fixes:**\n\n* Trim song tags before uploading. This was causing some duplicate artists and such even though they looked the same. Turns out one had spaces and the other did not.\n* Fixed a bug with the progress slider breaking if you changed the song time before playing your first song.\n* Fixed songs sometimes not looping correctly.\n* Fixed being able to view songs by Blank artists.\n\nAs always, thanks to everyone for suggesting new features and reporting bugs on the [Issues page](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj).",
				"added": 1528574422
			},
			{
				"comment_id": 62,
				"body": "It seems some people are uploading flac that are >10MB. If people set their max optional file limit to somewhere between 20-30MB, those songs should becomes pretty reliable as well.",
				"added": 1528969585
			}
		],
		"1528301912_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 56,
				"body": "> The only problem right now is that it thinks you haven't installed app updates no matter how recently nor how many times you have, it keeps bugging the shit out of you to update apps ad infinitum.\n\nDo you have the F-droid Privileged Extension installed? If so, clear F-droid's data and cache after updating and it'll stop bugging you.",
				"added": 1528307808
			},
			{
				"comment_id": 57,
				"body": "> [styromaniac](#comment_76_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Does that require root privileges? I've never used the Privileged Extension.\n\nEither that or your ROM has integrated it. Only ROM that I know of that does that though is CopperheadOS.",
				"added": 1528377366
			},
			{
				"comment_id": 58,
				"body": "> [styromaniac](#comment_80_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My phone's ROM is vanilla, first party, no modifications. I don't play with ROMs anymore.\n\nHuh, well I've only seen the bug you describe with F-droid's privileged extension, otherwise F-droid has been rock solid for me :/",
				"added": 1528445007
			}
		],
		"1528455776_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 59,
				"body": "@quantumkitty if you're still alive",
				"added": 1528469274
			}
		],
		"1538256010_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": [
			{
				"comment_id": 63,
				"body": "Just so people are aware, this code can't execute. It's just put in a text/json file. Your antivirus is just flagging it because it's just searching for the code.",
				"added": 1538256508
			}
		],
		"1538259707_1JAnUGRgomRpQZNvhGF6VwmLLmgqJf7azj": [
			{
				"comment_id": 64,
				"body": "Are you talking about http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp ? If so, you need a torrent client to access them.",
				"added": 1538261042
			}
		],
		"1539623497_1DJpEyYH4DmNfXABQVcKqGXpgyWEtAp4sA": [
			{
				"comment_id": 65,
				"body": "The best I know of is Horizon: http://127.0.0.1:43110/1HoRiznsHbJAqs2bmrVcSd79NTGVFp4Ju2/",
				"added": 1539808678
			}
		],
		"1539808632_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 66,
				"body": "Registration has to be done at [KxoNetwork](http://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/) for just now. It works though!",
				"added": 1539812690
			},
			{
				"comment_id": 68,
				"body": "> [moor](#comment_19_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): the KxoNetwork registration should work, maybe you are having a similar problem that i have, because my internet speed is shit i have to reload the page or check files and restart zeronet to work. even after sending the request it can take several seconds.\n\nIt takes anywhere from 5 to 20 seconds for me sometimes, but does eventually work if you have the plugin installed correctly, which should just be extracting that folder to plugins/PeerMessage.",
				"added": 1539870466
			}
		],
		"1539742216_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": [
			{
				"comment_id": 67,
				"body": "I can confirm it was indeed down for ~40m.\n\nTry [KxoVid](http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/) for an alternative.",
				"added": 1539812886
			}
		],
		"1540055841_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 69,
				"body": "Produce good content and then ask for donations?",
				"added": 1540057189
			}
		],
		"1540067038_19SBkpjU51KHuK4br2GkqUnh6BwBRJDeLH": [
			{
				"comment_id": 70,
				"body": "Echobot has been removed from the Welcome message.",
				"added": 1540082851
			}
		],
		"1542317704_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 71,
				"body": "As a zite developer, I had a lot of trouble getting started with ZeroNet site development. Now that I have some knowledge, I'm trying to make things easier for future developers by improving ZeroNet's [developer documentation](https://zeronet.io/docs). ZeroNet has potential, but it needs more content, more useful sites to draw people in.\n\nNot only that, but ZeroNet can be used for more than just sites. The other, we had a game developer wanting to use ZeroNet to store his high scores. While an awesome usecase, we don't currently have many effective tools to read/write to ZeroNet sites without using a JavaScript framework. Developing more tools in this area will also help increase adoption.",
				"added": 1542363658
			}
		],
		"1534860890_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 72,
				"body": "Yeah that would be pretty cool. One thing that I've always wanted to see and been sorta disappointed about was the fact that there haven't really been any ZeroHello competitors about.\n\nZeroHello can do so much fun stuff as it has the `ADMIN` permission. Any site can ask for this with the [wrapperPermissionAdd](http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/zeroframe_api_reference/#wrapperpermissionadd) command.\n\nDefinitely would like to see someone make something like this. More competition for ZeroHello for features the better :)",
				"added": 1553440967
			}
		],
		"1553364134_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 73,
				"body": "You essentially need to:\n\n* Install a [coffeescript compiler](https://coffeescript.org/) (clearnet link) on your computer\n* Run zeronet in debug mode (add `--debug` to the command you use to run ZeroNet. If you use ZeroBundle let me know and we can figure it out).\n* Make sure \"This is my site\" is checked your site's sidebar\n* Refresh the page\n\nThen ZeroNet should recompile the coffeescript code into `all.js`.\n\nBe aware that if you hit \"Upgrade code\" from ZeroHello it'll overwrite your code modifications (but not userdata or anything).",
				"added": 1553465866
			}
		],
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 74,
				"body": "I believe it's up to someone else to take the code, make their own edition and run it for others. Let the code continue to be useful :)",
				"added": 1557306151
			},
			{
				"comment_id": 75,
				"body": "I've made a backup of the code here: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/user/?16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
				"added": 1557427862
			}
		],
		"1565689652_1NpBKuyaBfogcHY7Whe1YM59brNqLHmGBn": [
			{
				"comment_id": 76,
				"body": "I assume it's due to the recent migration of lots of 8chan individuals. Trolls and racists (but a few good people... a few).",
				"added": 1565697961
			}
		]
	},
	"comment_vote": {
		"1_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"28_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"28_1J2cXfbx97JL1iQihCMateocuHzRnA4jDu": 1,
		"23_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"231_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"262_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"74_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"88_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"433_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"183_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"170_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa": 1,
		"55_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"171_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"9_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": 1,
		"40_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"13_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"265_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"146_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}