{
	"title": "Theta Finance",
	"description": "[**ABOUT THIS BLOG**](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:9:What+is+This+and+Why+)\nI will be writing about finance and economics, which I also have a professional background in. I will try to be as transparent as possible, so you will not only read about me bragging about all the successful investments, you will also read about the bad ones.\n\n However, you can also expect a little bit of politics, psychology  and maybe some video clips related to the subjects.\n\nFeel free to comment or (zero)mail me if you have any questions or topic suggestions.\n\n---\n\nUpdated:21 May! [My Portfolios](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:7:My+Portfolios)\n\n[Archive](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:11:New+blog+post)\n\n---\n\n_All investment recommendations and comments are presented as ideas, and the readers should conduct their **own** research or check with their investment adviser before acting on any idea presented here. Please note that value investing still carries customary investment **risks**, and a long-term and disciplined outlook is required._",
	"links": "**A BEGINNERS GUIDE TO INVESTING AND FINANCE:**\n---\n[Part 1: Traders and Investors](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:10:Part+1:+Traders+and+Investors)\n[Part 2: Stock Picking](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:12:New+blog+post)\n[Part 3: Cognitive Biases](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:15:Part+3:+Cognitive+Biases)",
	"next_post_id": 19,
	"demo": false,
	"modified": 1461193628,
	"post": [
		{
			"post_id": 18,
			"title": "Update: Short-Term Portfolio",
			"date_published": 1461190695.954,
			"body": "Hi!\nI am just stopping by to make a short post about my latest investments I did today. It is two technology companies that I think will have bright futures ahead of them. Even though I have put them in my short-term portfolio, it should maybe have been in my medium-term portfolio, but as they are very risky, I thought it was better for me to have them where I most often check. \n\n##Tobii\n![Tobii1](img/st_portf/20160521/tobii1.png)\nFounded in 2001, Tobii has consistently expanded its offering and established a presence around the world. The Tobii Group today consists of three business units. Tobii Dynavox and Tobii Pro are both solid, market-leading businesses within their respective markets. Together they form a strong foundation for the Group’s business, organization and technology development. The third business unit, Tobii Tech, is investing in establishing Tobii’s eye-tracking technology within consumer electronics and other high volume markets.\n![Tobii2](img/st_portf/20160521/tobii2.png)\n1. **Tobii Dynavox** is the world’s leading supplier of assistive technology for communication. Its products help people with communication disabilities—caused by, for example, cerebral palsy, ALS, spinal cord injury, aphasia, or autism—to speak and communicate. Tobii Dynavox offers specially developed computers and software that are controlled by eye movements or touchscreen, products that widely revolutionize the lives of people who need these tools.\n2. **Tobii Pro** leads the market of eye-tracking solutions used to gain insights into human behavior. Scientists and market researchers are using these products to obtain vital information across a wide range of fields, spanning from consumer behavior and advertising optimization to science studies in psychology and neurology. Tobii Pro’s customers include 2,000 commercial enterprises and 1,500 academic institutions, including the world’s largest advertisers and market research companies, namely Procter & Gamble, Microsoft, Ipsos and GfK, and all of the world’s 50 top-rated universities.\n3. **Tobii Tech** offers eye-tracking components and platforms for original equipment manufacturers to integrate into their own products. The business is in an early commercial phase and Tobii Tech is investing heavily in technology and market development to reach volume markets such as computer games, regular computers, virtual reality and cars. An important aspect involves collaborating with game and software developers to create exciting new user experiences.\n4. **EyeX** is the brand under which Tobii EyeX Controller is marketed and where you can learn about how eye tracking works in regular computers, PC games. Available games and features are showcased, and game developers can also get dev kits and support here.\n\nI recommend you to check out their 3-minute [Youtube-clip!](https://www.youtube.com/watch?v=ZMoJ5T76AtE)\n\n##Clavister\n![Clavister](img/st_portf/20160521/clav2.jpg)\nClavister is a network security vendor delivering a full range of network security solutions for both physical and virtualized environments. Their network security solutions are used by a wide range of organizations throughout the world, including mobile and network security solutions for large enterprises, cloud service providers and telecom operators. \n![Clavister](img/st_portf/20160521/clav.png)\nClavister's product line is available both as hardware appliances and virtual appliances. Clavister has a proven track record of providing innovative solutions and leading edge security design.\n\nThis is a 2-minute company [presentation](https://www.youtube.com/watch?v=hikYSoeijhs)\n"
		},
		{
			"post_id": 17,
			"title": "Update: Short-Term Portfolio",
			"date_published": 1461022276.609,
			"body": "\nAs I wrote in an earlier post, I have had a load of work the last couple of week with barely any sleep at all. However, do not misinterpret this, I love what I do and because of that, I am quite good at it and last week, I landed a new analyst job for a medium-sized firm. With that said (written), I also had time to purchase some stocks today for my short-term portfolio that I have been looking at for a while. I am very tired, so I will try to be as short as possible, and please ask me if there is anything you want to discuss further. \n\n##Invisio Communication\n![Invisio](img/st_portf/20160519/invis.png)\nThe first one is **Invisio** who specializes in voice communications in difficult conditions. The company develops, manufactures, marketing and sells communication solutions such as advanced headsets, control units, and accessories for use with two-way radio, primarily for professional users who often operate in harsh environments. Customers include the military and military special forces, police and SWAT teams, emergency services, security industry and industries worldwide.\n\nThis is not the first time I am buying the share. I actually bought it the first time for 1,5 years ago and one year later, it had gone up to 600%, and I thought that was a good place to sell. I actually, with a bit of luck, manage to sell the share right before a bigger drop. The drop was not because the sales had declined or anything, it was due to the stock market that had been at an all-time high, so when the stock market drops, well... smaller companies usually follows it. \n\nI started researching the company and its products, and I have to admit, I fell in love with the product. I have a few years experience in the military, first as a reconnaissance soldier in the Army, and later in the Marines (as a TACP). So when I started to read about their communication system, I realized that it offered everything I ever wished for during the time I was active. Moreover, if we take the product aside and look at the company, it amazing. I went through their number, their management, laws (patents) and regulations (that will be implemented in armed forces around the world, e.g., US army's [TCAPS](http://www.invisio.com/markets/tcaps.aspx) ), other market participants and risks, and I was completely hooked. \n\nYou will find more info (also a short video clip) on their website [Invisio](http://www.invisio.com) \n\n##Kallebäck Property Invest\n![KPI](img/st_portf/20160519/kalle.png)\nWell, to be honest, this is a \"boring\" company that actually just have one single asset, and that is a big business property that they lease out to other companies, and for the moment they lease it to SAAB (which I also own shares in). I bought them for a few reasons, but the most important were that I wanted to diversify to the property and apartment sector, they had a attractive price-tag and they had a very pleasant yield of 8.50% yield per year, and paying out dividends four times a year. \n\n##Recipharm\n![Drugs](img/st_portf/20160519/reci.png)\nRecipharm is one of the leading Contract Development and Manufacturing Organisation (CDMO). They are focussed on supporting pharmaceutical companies in taking their products from early development through to commercial manufacturing.  Basically,  Recipharm operates in two areas:\n1. Manufacturing delivers broad-scale contract manufacturing of pharmaceuticals with 14 manufacturing facilities across Europe.\n2. Development and Technology provides pharmaceutical development and engages in own intellectual property development and commercialization.\n \n##RenoNorden\n![unsexy](img/st_portf/20160519/reno.png)\nWell, this may be the least sexy stock you can buy... they handle your trash (or \"waste management\" as they put it). However, they are the market leader in waste management and transportation in the Nordic countries: Norway, Sweden, Denmark and Finland. What makes them interesting is their aggressive procurement approach. However, this investment is very risky and I see my investment in this company as a small bet. "
		},
		{
			"post_id": 15,
			"title": "Part 3: Cognitive Biases",
			"date_published": 1460640048,
			"body": "![Biases](img/beginners_guide/part3_biases/biases.png)\n\nI think it is critical that we shed light on different types of risks that we are exposed to as investors. However, risk comes in many forms and sometimes we are the risk ourselves, and that is what I will be writing about in this blog post.\n\nImagine that you have found an attractive investment. You have done your due diligence and scrutinize every part of the company. You have read all the fine print about the company; what it is up to in the future; read about the Board of Directors and the management; gone through every item in the financial statements; done cash flow analysis, and screened the key ratios with other companies in the sector and so on. The only thing you have left is the invest. Well, that is a great start (!) but (there is always a but) there is something I want you to think about during, and after, your due diligence, and that is to assess your bias for your investing decision. \n\n## Introduction to Cognitive Biases  \n####_(Hull, 2015, pp. 572-574)_\nOur ability to identify risks effectively is affected by what are termed cognitive biases. These describe the tendencies for human beings to think in certain ways and be less than perfectly rational. One common cognitive bias is wishful thinking. It is sometimes difficult to distinguish between what we want to happen (e.g., a project to be a success) and what we think will happen. (Try asking a Manchester United supporter to estimate the chance of Manchester United winning the FA Cup next year!) When we want something to happen, we are liable to think only of reasons why it will happen.\n\nOver 100 cognitive biases have been listed by psychologists. Much of the pioneering work was done by Daniel Kahneman and Amos Tversky.8 Kahneman won the Nobel prize for economics in 2002 for his work with Tversky on prospect theory, which is concerned with the way people choose between risky alternatives. (Tversky had died a few years earlier.) One important bias is **anchoring**. \n\n![Anchor](img/beginners_guide/part3_biases/anchoring.png)\nWhen evaluating a potential outcome (e.g., the revenue resulting from a major new venture), we are liable to anchor onto the first estimate that is made. We tend to make relatively small adjustments to that estimate (this is referred to as “anchoring and adjustment”) and often never consider the full range of possible outcomes. In particular, important adverse outcomes may implicitly be considered to have no chance of occurring. To illustrate anchoring, one could ask a group of people to make a best-guess of something that is unknown to them such as the population of Iceland. They can then be asked to provide a range consisting of the 5th percentile to 95th percentile of their subjective probability distribution. If their estimates are good, the true population of Iceland should lie outside the range only 10% of the time. In practice, it is found that this happens much more frequently. Anchoring causes people to behave as though they know more than they do.\n\nAnother cognitive bias is **availability**. This is where recent information is given undue weight. Sadly, risk management can suffer from availability. Prior to the credit crisis, risk managers in some financial institutions were often not listened to because recent experience had been good. After the crisis, risk managers have had more influence, but as memories of the crisis fade, the “good times will last forever” attitude may return.\n\nAnother cognitive bias is known as **representativeness**. This is where individual categories a situation based on a pattern of previous experiences or beliefs about the underlying scenario. It can be useful when trying to make a quick decision, but it can also be limiting because it leads to close-mindedness and stereotyping. Based on previous experience, a senior manager at a  financial institution might consider it almost impossible for any other financial institution to compete successfully with it in a particular market. However, if the manager’s past experience is limited, the previous situations might not be representative of future scenarios. \n\nA mistake sometimes made in estimating probabilities is inverting the conditionality. Suppose that 1 in 10,000 people have a particular disease. A test that is 99% accurate gives you a positive result (suggesting that you have the disease). What is the chance that you have the disease? Your immediate response is likely to be 99%. However, the true answer is actually about 1%! \nOut of 10,000 people there will be about 100 positive results on average but only one person with the disease. Hence, the probability we are interested in is about 0.01. This is an application of the result in probability theory known as Bayes’ theorem.\n\nYet another bias is the **sunk costs bias**. Suppose that a  financial institution has already spent $1 billion trying to enter a new market. Things are not going well, and there seems very little prospect of success. Should the $1 billion influence the financial institution’s decision making? The answer is the $1 billion is what accountants refer to as a sunk cost. Regardless of the decisions taken now, it cannot be recovered. \n![Sunk Cost](img/beginners_guide/part3_biases/sunk.png)\nThe key issue is whether future profits will be sufficiently high to justify future expenditures. In practice, many people are reluctant to admit mistakes, and they continue with projects that are clearly failures for too long. Irrationally, they want to try to get back money already spent, even when the chance of this is very small.\n\nUnderstanding these biases may assist decision making and the identification of key risks. It should be noted, however, that experiments have shown that it is extremely difficult to eliminate biases. Even when biases such as anchoring are carefully explained and subjects are given financial incentives to make good estimates, the biases persist.\n\nThe challenge with investments is identifying tail risks and trying to estimate the probabilities associated with the adverse scenarios giving rise to the tail risks as well as possible. The cognitive biases we have discussed (and many others have been documented) suggest that the risks will be underestimated. Nassim Taleb is particularly critical of the use of normal distributions for calculating risk measures and argues that extreme events such as the crash of 1987 or the credit crisis of 2007 to 2009 are more likely than many people think.\n\n\n## Other Important Cognitive Biases \n\n####Confirmation Bias _(Investopedia, 20161)_\nConfirmation bias can create problems for investors. When researching an investment, someone might inadvertently look for information that supports his or her beliefs about an investment and fail to see information that presents different ideas. The result is a one-sided view of the situation. Confirmation bias can thus cause investors to make poor decisions, whether it’s in their choice of investments or their buy-and-sell timing.\n \nFor example, suppose an investor hears a rumor that a company is on the verge of declaring bankruptcy. Based on that information, the investor is considering selling the stock. When he goes online to read the latest news about the company, he tends to read only the stories that confirm the likely bankruptcy scenario and he misses a story about the new product the company just launched that is expected to perform extremely well. Instead of holding the stock, he sells it at a substantial loss just before it turns around and climbs to an all-time high.\n \nConfirmation bias is a source of investor overconfidence and helps explain why bulls tend to remain bullish and bears tend to remain bearish regardless of what is actually happening in the market. Confirmation bias helps explain why markets do not always behave rationally. However, an investor who is aware of confirmation bias may be able to overcome the tendency to seek out information that supports his existing opinions and intentionally seek out contradictory advice.\n\n####Survivor Bias _(Freakonomics, 2009)_\nThe concept of survivor bias, if you don’t know it, is well worth being aware of. It’s most often used in finance, where it refers to a “tendency for failed companies to be excluded from performance studies”. Think of the Dow Jones Industrial Average, which indexes the stock prices of 30 of the largest and most important U.S. companies — until, that is, one of said companies does so poorly that it is booted from the index and is replaced by a company that’s doing better.\n\nOver time, therefore, the DJIA reflects a different reality than many people presume. It is biased toward survivors — or, if you want to think of the concept more broadly, toward winners.\n\nThis winner’s bias, if you will, shows up in pretty much every realm imaginable: academics, medicine, politics, etc. I don’t mean to sprinkle skepticism all over your inherently positive thoughts about the world, but I do think it’s worth keeping winner’s bias in mind whenever you read (or write) something about the performance of a given group or institution or coalition.\nWinner’s bias is perhaps especially pronounced in sport. The behaviors of winners are remembered and dissected far more thoroughly than those of losers, and given greater weight, even if the outcome was decided by a tiny margin.\n\n####Endowment Effect _(Investopedia, 2016b)_\nStudies have shown repeatedly that people will value something that they already own more than a similar item they do not own. According to the old saw: a bird in the hand is worth two in the bush. It doesn't matter if the object in question was purchased or received as a gift, the effect still holds. People who inherit shares of stock from deceased relatives exhibit the endowment effect by refusing to divest those shares even if they do not fit with that individual's risk tolerance or investment goals, and may negatively impact a portfolio's diversification. Determining whether or not the addition of these shares negatively impacts the overall asset allocation is appropriate to reduce poor outcomes.\n\nThis bias applies outside of finance too. A well-known study which exemplifies the endowment effect, and has been replicated over and over, starts with a college professor who teaches a class with two sections: one which meets Mondays and Wednesdays and the second which meets Tuesdays and Thursdays. The professor hands out a brand new coffee mug with the university's logo emblazoned on it to the Monday/Wednesday section for free as a gift, not making much of a big deal out of it. The Tuesday/Thursday section receives nothing. A week or two later, the professor asks her students to value the mug. The students who received the mug, on average, put a greater price tag on the mug than those who did not. When asked what would be the lowest selling price of the mug, it consistently averaged significantly higher than where the students who did not receive a mug would pay for it.\n\n####Home Bias _(Investopedia, 2016c)_\nInvesting in foreign equities tends to lower the amount of systematic risk in a portfolio because foreign investments are less likely to be affected by domestic market changes.\n\nHowever, investors from all over the world tend to be biased toward investing in domestic equities. For example, an academic study from the late 1980s showed that although Sweden possessed a capitalization that only represented about 1% of the world's market value of equities, Swedish investors put their money almost exclusively into domestic investments.\n\n## References:\nFreakonomics. (2009). Survivor Bias on the Gridiron, _Freakonomics_, Available Online: http://freakonomics.com/2009/09/17/survivor-bias-on-the-gridiron/.\nHull, J. C. (2015). Risk Management and Financial Institutions, 4 edition., Hoboken: Wiley.\nInvestopedia. (2016a). Confirmation Bias Definition, _Investopedia_, Available Online: http://www.investopedia.com/terms/c/confirmation-bias.asp.\nInvestopedia. (2016b). Endowment Effect Definition, _Investopedia_, Available Online: http://www.investopedia.com/terms/e/endowment-effect.asp.\nInvestopedia. (2016c). Home Bias Definition, _Investopedia_, Available Online: http://www.investopedia.com/terms/h/homebias.asp.\n\n"
		},
		{
			"post_id": 13,
			"title": "Quick update!",
			"date_published": 1459015592.347,
			"body": "Hey!\n\nI just wanted to stop by and say that I have not forgotten about this blog. I am in a crazy work period right now,  working an average of 14 hours per day in the last couple of weeks (including weekends). Thank god for Armodafinil and Modafinil!. \n\nI will be back as soon as possible, I promise!\n\nSincerely,\nTheta"
		},
		{
			"post_id": 12,
			"title": "Part 2: Stock Picking",
			"date_published": 1457983639,
			"body": "![Stock picking](img/beginners_guide/Part2_stock_picking/stockpick.png)\n\nOkay, in Part 1, we went through what the differences are between traders and investors, so you now know what I mean when I write that this post may appeal more to investors than the traders since we will cover the very basics in fundamental analysis (FA). \n\nI will briefly go through **my** stock picking process. It is very important that you understand that every investor has its process and with time, you will have your own. I will not get into too much detail for each and every step of the process (e.g., how you do Discounted Cash Flow analysis) because, a) this is a beginners guide, 2) it would be a (very) long blog post. However, I will go deeper into some of those details in future posts. Also, one should know that studies clearly shows that it is extremely difficult to be a successful stock picker for an extended period, and that most people should invest in the market index instead of trying to pick stocks by themselves. However, what is the fun in that? So let us get started!\n\n## Why should you have a process?\nThat is a good question but I have two main reasons: 1) to mitigate the risk that I buy stocks in bad companies, 2) mitigate my cognitive biases, e.g., so I do not buy the share on false grounds (I will write an article about that later this week).  Moreover, the smaller the company is that you are interested in, and the longer you plan to hold the stock, the more important there is to do a thorough analysis. Also, during the entire process, I am looking for reasons **not to buy** the stock and not the other way around.\n\n## What I do?\nThere are two common scenarios: **1)** I start off as a blank sheet with no particular company in mind. I then look at the macros and ask myself: What happens in the world and why? Which geographical regions or business sectors are affected? Who, in those regions or sectors, will gain and who will lose?  This first scenario can be very difficult in the beginning, and you may need some knowledge of the mechanics in economics. I do not say that you have to study economics to understand it, I know plenty of people that have not taken a single class, or read any book about it, but instead read much news throughout the years and still understands the mechanism better than many others that have e.g., an MBA. Moreover, to be really honest, I sometimes get scared of how little some advisers banks understands. However, when we have found a business sector, or if we already have a company on our mind, we are ready to go to the second scenario. **2)** I have found a company that I am interested in (or someone has recommended me one) and I want to know more about it to make an investment decision. I then take the following steps.\n\n# The Process\n\n## 1. Assess the company and its market, Do I understand it? \n![Understand the business](img/beginners_guide/Part2_stock_picking/underst.png)\n\nFirst of, I always Google the company I am interested in and its market to see what has been written about it in the last 2-3 years. Of course, I do not read every single article but I scan for statements about its future and eventual scandals. If there is a scandal that has occurred close in time, it is a risk that it will be a costly legal process (especially if it has occurred in the US). Also, I may find that the company I am interested in maybe have more impressive competitors. If so, I would change and instead analyse the best competitor in that market.\n\n Second, I ask myself “do I really understand the company and its product or services it offers?” A tip here is to take your time and read about their business model and strategy, which should be public on their website. If the answer is “No”, then I would read as much about it as possible and ask the question again. If the answer is still ”No”, I will reject the stock. If I say, “Yes”, I ask myself “do I think the product or service is needed, is there a demand for it on the market, and in the future?” If “Yes”, I proceed to the next step.\n\n## 2. Board of Directors and Senior Management\n![BoD](img/beginners_guide/Part2_stock_picking/board.png)\n\nI think it is very important to look at the company’s Board of Directors and its management. What are their experiences and do they complement each other? Have they been involved in other successful companies before (good track record)? Are they giving the managers (e.g., CEO) right incentives (e.g., bonuses or restricted stocks) to work in the company's best interest in the long-term? I recommend you to read the company’s Corporate Governance report.  \n\n## 3. Annual Report and Financial statements\n![Annual reports](img/beginners_guide/Part2_stock_picking/finst.png)\n\nYes, I know that this part is the hardest in the beginning but the more financial statements you read, the easier it will get. Also, you will after a few reports see that they all looks more or less the same, and you will be able to compare them to one another. I actually have 22 things/items I check for in this step, but just to give you some idea what I look at:\n- Revenues\n- Profits and Profit margin\n- Operating incomes and Operating margin\n- Cash Flows \n- Reinvestment (capital expenditures hopefully result in company growth)\n- Liabilities (e.g., If you think the interest will rise in the future, companies with low debt can be preferred) \n- Overall costs (e.g., cost of staff)\n- Goodwill (it can be risky for a company to have high amount of goodwill) \n\nIt is in this step many analysts do different types of calculations to get some understanding what the company, and its stock, should be worth. You have maybe heard of Discounted Cash Flow analysis (DCF), which is a very popular method. I use similar methods as well, but this is something you have to learn to do by yourself. There are some great tutorials out there, (check out Youtube). Of course, there is some drawback to the different methods since they are very sensitive and usually based on assumptions that can be hard, or even impossible, to get right (e.g., future growth).  \n\n## 4. Screening \n![Screening](img/beginners_guide/Part2_stock_picking/screening.png)\n\nI take out key indicators from the financial statements but you can use, e.g., [finviz.com](http://finviz.com/screener.ashx) to get the key figures you need, and then “screen” (same as compare, see image above) those against competitors . However, take the key figures with a pinch of salt since everything can be manipulated to look better than it actually is with some creative accounting (believe me, it is very easy!). \n\nIf you don not know what key figures/indicators/ratios are, I recommend you to take a quick look at [this site](http://www.investinganswers.com/education/ratio-analysis/15-financial-ratios-every-investor-should-use-3011) (InvestingAnswers) that have listed and explained the 15 most important ones.\n\n## 5. Make a decision.\n![TA](img/beginners_guide/Part2_stock_picking/dax.png)\n\nOkay, so now I have gone through all available information that I can legally get my hands on, and to which I have to base my decision on. If I think that  the company, and its share, have a greater potential (reward) than risk, I will buy the stock. When I have decided to purchase the share, I will use technical analysis (TA) to find a good time to execute the order(s). If I cannot find a good timing at that moment, I will put the stock on a “watch list” and regularly check the charts for a good point to execute the order.\n\n# Feedback\nI am trying to suit my content to you, the readers. Therefore, I would appreciate your thoughts. Is it too basic, too complicated, or maybe too general (or something else)? So, please leave a comment if you have any question or if you want to give me feedback!\n\n"
		},
		{
			"post_id": 11,
			"title": "Archive",
			"date_published": 1457791407.59,
			"body": "[2016-04-21 | Update: Short-Term Portfolio](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:18:Update:+Short-Term+Portfolio)\n[2016-04-18 | Update: Short-Term Portfolio](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:17:Update:+Short-Term+Portfolio)\n[2016-04-14 | Part 3: Cognitive Biases](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:15:Part+3:+Cognitive+Biases)\n[2016-03-28 | Quick update!](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:13:Quick+update!)\n[2016-03-14 | Part 2: Stock Picking](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:12:New+blog+post)\n[2016-03-10 | Part 1: Traders and Investors](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:10:Part+1:+Traders+and+Investors)\n[2016-03-09 | What is This and Why](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:9:What+is+This+and+Why+)\n[2016-03-06 | My Portfolios](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:7:My+Portfolios)"
		},
		{
			"post_id": 10,
			"title": "Part 1: Traders and Investors",
			"date_published": 1457640488.787,
			"body": "This will be the first of many parts in my attempt to write some sort of “ a beginners guide to finance”. As I mention in my previous post, I have already started sketching on a couple of topics, but while I was working on those, I realise that I needed to unpack some of the terminologies that will be used later. Of course, this is basics, and you might already know and understand most of this. However, I prefer to start with the basics in the purpose to include as many readers as possible. Just to be transparent, this post is inspired by a couple of [Investopedia.com](http://www.investopedia.com) articles (32 smaller articles) and will contain formulations and quotes taken directly from those articles, but it does not make the information less important. I do not want to take any credit that I do not disserve, so see this post as a “compiled and summarized tribute” to those 32 articles and my personal thoughts and comments as a bonus.\n\n# Traders vs. Investors\n\n![funny trader](img/beginners_guide/part1_the_basics/funnytrader.png)\n\nMany people use the words \"trading\" and \"investing\" interchangeably when, in reality, they are two very different activities. While traders and investors participate in the same marketplace, they perform two very different tasks using very different strategies.\n\n**Traders**\nStock traders are market participants, either an individual or firm, who purchase shares in a company with a focus on the market itself rather than the company's fundamentals. A stock trader usually tries to profit from short-term price volatility with trades lasting anywhere from several seconds to several weeks. The stock trader is usually a professional. Persons can call themselves full- or part-time stock traders/investors while maintaining other professions.\n\nMarkets involved in the trade of commodities are beneficial to a stock trader’s strategy. After all, very few people purchase wheat because of its fundamental quality - they do so to take advantage of small price movements that occur as a result of supply and demand. Stock traders typically concern themselves with:\n- **Price patterns:** Stock traders will look at past price history in an attempt to predict future price movements. This is known as technical analysis.\n- **Supply and demand:** Traders keep close watch on their trades intra-day to see where money is moving and why.\n- **Market emotion:** Traders play on the fears of investors through techniques like fading, where they will bet against the crowd after a large move takes place.\n- **Trader support:** Market makers (one of the largest types of traders) are actually hired to provide liquidity through rapid trading.\n\n**Investors**\nStock investors are the market participants whom the general public most often associates with the stock market. They rely primarily on fundamental analysis for their investment decisions and fully recognize stock shares as part ownership in the company. Many investors believe in the buy and hold strategy, which, as the name suggests, implies that investors will buy stock ownership in a corporation and hold onto those stocks for the very long term, generally measured in years.\n\nThese investors, who purchase shares of a company for the long term with the belief that the company has strong future prospects, typically concern themselves with two things:\n- **Value:**  Investors must consider whether a company's shares represent a good value. For example, if two similar companies are trading at different earnings multiples, the lower one might be the better value because it suggests that the investor will need to pay less for $1 of earnings when investing in Company A, relative to what would be needed to gain exposure to $1 of earnings in Company B.\n- **Success:** Investors must measure the company's future success by looking at its financial strength and evaluating its future cash flows.\n\nBoth of these factors can be determined through the analysis of the company's financial statements along with a look at industry trends.\n\nClearly, both traders and investors are necessary in order for a market to function properly. Without traders, investors would have no liquidity through which to buy and sell shares. Without investors, traders would have no basis from which to buy and sell. Combined, the two groups form the financial markets as we know them today.\n\n**Do you have to choose?**\nNope. You can do as me and have e.g. different [portfolios](http://127.0.0.1:43110/1KVkSrfNoCRjjQEFDK3xKXeL71Byi2yLpF/?Post:7:My+Portfolios). I have one short-term portfolio where I often trade for just for a day or a week, and only look at trends or specific market reaction (overreactions) to certain news and reports. Then I have both medium and long-term portfolios that I use when I want to buy and hold a investment for a longer period of time.\n\n---\n# Technical Traders vs. Fundamental Traders\n\n![](img/beginners_guide/part1_the_basics/TAvsFA.png) \n\n**Fundamental traders**\nFundamental traders believe that the markets will react to events in certain ways and that they can predict future market prices based on these events. For example, if a company receives regulatory approval for a new product, a fundamental trader might expect the company's stock price to rise. Conversely, if a company has a financial scandal, a fundamental trader might expect its stock price to fall. Fundamental traders need access to all of the obtainable information as soon as it is available, and are therefore institutional traders often have large support teams. Fundamental analysis is as old as trading itself, and has traditionally been done manually, but as computing power increases it has become possible for some fundamental information to be processed automatically.\n\nExamples of data useful for fundamental trading:\n- **Economic reports:** This involves the use of figures which can be generally split into either growth or inflationary. It is important to understand the current economic cycle: Six years ago, investors were looking for “price stability;” therefore inflation was a major issue, and **CPI** (consumer price index) and **PPI** (producer price index) figures were the focus. Now investors are focused much more on growth, so **GDP** (gross domestic product) and sentiment figures are key. Other figures to consider are weekly and monthly economic data such as Non-Farm Payrolls and the Philadelphia Fed.\n- **Political factors:** Recent factors affecting fundamental trading decisions include the Euro Zone debt and the global slowdown. Also, key politicians and market commentators can affect the markets.\n\n**Technical traders**\nTechnical traders use stock charts; in other words, trading information - such as previous prices and trading volume - along with mathematical indicators to make their trading decisions. This type of stock trader relies on factors such as momentum, patterns, moving averages, etc. The basic premise is that all assets move based on offer and demand more than anything else.\n\nCertain formations and price relationships happen regularly when viewed from a technical perspective. Such formations as head and shoulders, tops and bottoms, double and triple tops and bottoms, price channels and triangles occur quite frequently. Along with price breakouts and failures, higher lows and lower highs, price is consistent in testing itself. Support and resistance price points act as magnets. Stock prices are always testing previous price action. The outcome determines further price action, which develops over time into some kind of measurable trend.\n\nThis information is usually displayed on a graphical chart and is updated in real time throughout the trading day. Technical traders believe that all of the information about a market is already included in the price movement, so they do not need any other fundamental information (such as earnings reports). In many instances, individual traders tend to be technical traders.\n\nNow modern technical analysis is usually performed by the trader interpreting their charts, but can just as easily be automated because it is mathematical. Some traders prefer automatic analysis because it removes the emotional component from their trading, and allows them to make trades based purely on the trading signals.\n\n**Do you have to choose?**\nNot really, it depends on your portfolio strategy.  Generally it is more common to use fundamental analysis for long-term investing an technical analysis for short-term trading (e.g. day and swing trading), and even the fundamental investors use technical analysis as a tool for timing their investments.  You will see me doing just that in future posts. \n\n# Unsuccessful Types of Stock Traders\n\n![sad trader](img/beginners_guide/part1_the_basics/sadtraders.png)\n\nFinancial failure and unsuccessful trader stories related with stock trading are quite common. Trading stocks with consistent profitability is a most difficult occupation, with an estimated failure rate of at least 90% where short-term investing is involved, such as day trading.\n\nIt is obvious that speculation in stocks is a risky and complex occupation because the directions of the markets are generally unpredictable and at times, lack transparency. This does not invalidate the well-documented true stories of large successes and consistent profitability of many individual stock investors and stock investing organizations within the history of the stock market.\n\nBut in any situation the opposite exists, and this is true in regard to traders. Opposite the successful traders who trade with the necessary moderation, there are those who trade excessively without realizing that they are signing up for sure losses….their money disappearing into the dark, blue yonder.\n\n**Over-traders**\nMany traders recognize it easily in others, but not in themselves. Over-trading is a psychological problem that consumes profits and destroys trading capital. For many traders, the two main roots of over-trading lie in a need to chase the market to recover losses, and in a desire to look busy. The first leads down a road to gambling. The second, the impulse to look busy, usually costs the trader a great deal.\n\n- _Type I: Technical over-traders_\nNovices in trading justify their actions by the technicalities of this field. Many of them find some technicalities working to their advantage. They then make pre-determined positions and look for some indicators to confirm their choices.\n\n- _Type II: Impulsive over-traders_\nTraders who make use of non-statistical or non-mathematical data often rely on other people's opinions, on the news, on their personal observations and hunches and advice by so-called experts or gurus. The problem with these is that they cannot compensate for quantifiable data and that the discretional over-trader finds it hard to stay put because of them. They cannot stand inactivity thus they have to satisfy their compulsion to trade. The lack of assessment of sufficient indicators and enough technical knowledge is often the downfall of a trader.\n\nOver-trading is avoided when traders accept that significant rewards do flow from work that does not involve long hours, stress or sweat. They must appropriately value their intellectual and analytical contribution to the process of trading and accept their rewards as commensurate with this. They must understand no additional work is required to justify their income.\n\n**Pseudo-informed traders**\nThey act late and then lose because they tend to buy when prices are already high and sell when prices are already low.\n\n# Conclusion\n\nThere are a great many different types of traders, many more than I mention above. I did not mention e.g.,: trend traders, KISS traders, momentum traders, option traders or contrarian traders etc., and within each category there are sub-categories, and sub-sub-categories, etc. Traders will adopt their own style of strategy. It is not a \"one size fits all\" market. Anyone looking to join the list of stock market traders and make money in the short or long term should decide which strategy or strategies work best for them. No matter the style of a stock trader, and the category it falls into, or which best matches their stock buying interests, all types carry risks and potential to the trader’s financial well-being.\n\n# So what can you expect in the future?\nI am currently working on the following topics:\n- Portfolio strategy for beginners\n- How to stay updated and also find prospects\n- Risk willingness and risk/rewards\n- Investing for the future\n- Investing psychology and cognitive biases\n- How not to get fooled by advisers and other traders\n- High-frequency trading\n- Reading (and media) recommendations.\n- How I pick stocks."
		},
		{
			"post_id": 9,
			"title": "What is This and Why?",
			"date_published": 1457482067.028,
			"body": "I want to welcome you to my blog!\n\nAs you already guessed by the name, it will cover finance and all aspect of it. I know it may not sound like fun, and you are maybe expecting it to be very dull, grey or stiff. If you are still reading this, you are probably thinking: \"if I wanted to learn about finance, I would read the f*cking news or take a class!\". Yes, do that too! However, what I will offer you, or at least try to, is another way to look at the topic. \n\nMy goal with this blog is to make finance interesting and easily accessible for **EVERYONE**! \n\nI will not follow textbooks to the letter. I actually think that much of the content in them are useless and not real-world applicable (and believe me, I have read alot of them). Okay, I will maybe briefly mention some theories along the way, if I think it is necessary (or if you request it). As this is a blog and not a dissertation, and because of me having my days full with other duties, I may save time and not reference every little thing I write. However, I promise you that it will be just a Google (or DuckDuckGo or whatever you prefer) search away from you.\n\nI also promise you to share not only my successful investment stories but also the bad ones, as I strive to be as honest and transparent as possible. As you can see on the left side, I have posted \"My Portfolios.\" These will be regularly updated, often the same day the changes take place.\n\nI have already started to get some great requests; one is to write a \"beginners guide\". However, the more I was trying to work out the content for it, the more it started to take the shape of a regular textbook, which is not what I want. Instead, my solution is that I start off with som posts about my own investing philosophy and investing approach. I will also shed light on some important topics that I think everyone should read and later have in mind. Additionally, I am open to any questions you may have; no question is too \"stupid\"! It will probably be the opposite, that I am too stupid to answer your question.\n\nTo end on something serious, I want you to remember that:\n_\"All investment recommendations and comments are presented as ideas, and the readers should conduct their own research or check with their investment adviser before acting on any idea presented here. Please note that value investing still carries customary investment risks, and a long-term and disciplined outlook is required.\"_  blablabla.. (I feel like had to)."
		},
		{
			"post_id": 7,
			"title": "My Portfolios",
			"date_published": 1457294840.485,
			"body": "## My Short-Term Portfolio\nThis is my \"trading\" portfolio at the moment. As you will notice, most of my portfolio's holdings are in cash, and that is due to the volatile and bearish market right now. Therefore, you can expect just a few different holdings at the time for now until the market settles down.\n\n####**Stocks:**\n\nStocks       |  | Type |  | P/E |  |  | Yield\n------------| - | ------------- | - | ------------- | - | - | ------------\nClavister Holding |  | Security |  | - |  |  | 0.00%\nInvisio Communications |  | Military |  | 45.5 |  |  | 0.00% \nKallebäck Property Invest |  | Finance & Property |  | 20 |  |  | 8.50%  \nRecipharm |  | Health Care |  | 31.5 |  |  | 1.00% \nRenoNorden |  | Service |  | 12 |  |  | 5.00%\nTobii |  | Tech |  | - |  |  | 0.00%\n.\n####**Warrants:**\nnone\n\nTotal holdings |  |\n------------ | - | -------------\nStocks |  | 52.5%\nCash: |  | 47.5%\nWarrants: |  | 0%\n\n---\n## My Medium-Term Portfolio\nThis is my medium-term portfolio. I usually hold positions for at least 6 months in this portfolio and take small hedges when I think it is necessary. My medium-term portfolio yielded approximated +60% last year, but as the markets are right now, I do not expect that return for 2016.\n\n####**Stocks:**\nAcando B\nClas Ohlson B\nHandelsbanken A\nHennes & Mauritz B\nModern Times Group B \nSAAB B\nÅF B\n\n####**Warrants:**\nnone\n\nTotal holdings |  |\n------------ |  | -------------\nStocks:  |  | 73%\nCash:  |  | 27%\nWarrants:  |  | 0%\n\n## My Long-Term Fund Portfolio\nEvery month I set of a certain amount of money that goes directly to my long-term fund portfolio. Long-term can be interpreted differently depending who the investor is but I am investing in a 8 to 13-years perspective.  Below you will find the funds I save/invest in every month and how they are weighted. \n\n\nFund       |  | Type |  | Weight |  |  | Yearly Fee\n------------| - | ------------- | - | ------------- | - | - | ------------- \nEurope  |  | Equity |  | 30% |  |  | 0.44 % \nDenmark |  | Index |  | 11% |  |  | 0.00%  \nSweden |  | Index |  | 23% |  |  | 0.00% \nUSA |  | Index/Equity |  | 18% |  |  | 0.20% \nNew Tech |  | Equity |  | 18% |  |  | 1.25%  "
		}
	]
}