{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1,
		"4_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1,
		"5_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1CmKnRkBqGcBLEJomTcERHEMtR77TTv3ag": [
			{
				"comment_id": 1,
				"body": "Da mesma forma que acontece nos EUA, a grande mídia vai explodir de notícias irrelevantes e em sua grande maioria, falsas sobre o governo. Isso é para esconder o que realmente está acontecendo, pois falar a verdade é reconhecer que estavam errados.",
				"added": 1551797110
			},
			{
				"comment_id": 3,
				"body": "> [marionunes](#comment_2_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Eu ate o momento tenho gostado muito, o que mais tenho gostado mesmo é o choro da esquerda!\n> Mas os pacotes econômicos e leis trabalhistas sendo revistas, a peneira comendo solto, esta excelente até o momento.\n> Só o ato da despetização do governo já foi louvável.\n\nA despetizacão é mesmo essencial. Ainda falta muito tempo. Foi mais de uma década de roubos, até limpar tudo vai tempo.",
				"added": 1552352033
			}
		],
		"4_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": [
			{
				"comment_id": 2,
				"body": "Uma pena que não apenas por falta de informação, mas por comodismo mesmo, as pessoas ficam presas em redes sociais, que são comandadas por esquerdistas.",
				"added": 1551797388
			},
			{
				"comment_id": 4,
				"body": "> [marionunes](#comment_1_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Eu tenho tentado cada vez mais trazer as pessoas para cá!Mantenho inclusive 2 servidores dedicados um no Brasil e outro fora para agilizar o acesso as informações!\n\nOlha, por incrível que pareça, tem gente que fica com medo quando falo de uma rede assim, aberta. Qualquer coisa que está fora de Facebook e Whatsapp, até mesmo Twitter já me disseram que é \"underground\" demais e nem uso nada disso. É um trabalho lento levar as pessoas a acreditarem em idéias como essa. Além disso, precisamos de conteúdo! (não pirataria)",
				"added": 1552352359
			}
		]
	},
	"comment_vote": {
		"1_1DMajtLfV697xWnKX1kn4eLjHC2eU18x2D": 1,
		"1_12VPhhiPN2kxnusK7xnU4ES9TNi6kBAmrC": 1,
		"2_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1,
		"1_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1
	}
}