{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 1,
				"body": "> [balancer73](#comment_231_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): mp4 браузеры итак хорошо показывают, а всё остальное после выпиливания Flash уже простыми средствами уже всё равно не посмотришь. И уже точно не через JS, в лучшем случае — через плагины.\n\nВо-первых, плагины закапывают только во всяких мейнстримных недобраузерах. Как минимум в Webkit поддержка сохраняется, тут больше другая проблема актуальна — будут ли разработчики плагинов продолжать поддерживать то, что не под чем толком пускать. Да и без плагинов убогая поддержка форматов — в основном на совести разработчиков браузеров, которые для поддержки мультимедиа тащат всякие недофреймворки и искусственно ограничивают набор поддерживаемых форматов. Вон Safari для macOS воспроизводит всё, что поддерживает QuickTime.\n\nА реализация кодеков на JS/WA — вопрос времени, если закон Мура продолжит работать. Например, на modarchive.org уже год-два взамен Java-апплета используется libopenmpt, перекомпилированный в JS. Эта дрянь за милую душу сжирает 2 ГБ рамы на рендеринг файла, но работает вполне сносно. Полагаю, уже и видео низкого качества уровня всяких пережатых 96-строчных 3GP-шек можно в реалтайме декодировать на JS, но такой наркомании я не встречал :D",
				"added": 1515236396
			},
			{
				"comment_id": 2,
				"body": "> [gomzik](#comment_101_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Любой, ибо его категарически мало в принципе\n\nЭто работает лишь в условиях отсутствия альтернатив. Чем пока не пахнет. Пока что правило таково: нет ничего интересного в этих ваших зеронетах ⇒ эти ваши зеронеты не нужны.",
				"added": 1515236544
			}
		],
		"2_1PQSdkCfwKLKT4pWEpf33BkjvYX78wj1kJ": [
			{
				"comment_id": 3,
				"body": "> [promusik](#comment_3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Некультурно, сэр! Вы портите облик культурного зеронетика.\n\nУ Вас моноколь выпал-с, извольте подобрать-с.",
				"added": 1515236640
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 4,
				"body": "> [hackyou](#comment_1_172vQn2GExQjzDCZZpWfr1Z8sJMBmx4yU5): python, vim , kivy мне хватает )\n\nО-о-о, спасибо. А то у меня идея кроссплатформенной приложухи есть, думал на QML делать, но Kivy выглядит повкуснее.",
				"added": 1515237704
			},
			{
				"comment_id": 5,
				"body": "> [pozya](#comment_17_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): А, пых забыл, чтоб он побыстрее сдох. Тоже умею в него.\n\nПых — он как кобол и 1С, многих переживёт ещё ;-)",
				"added": 1515237798
			},
			{
				"comment_id": 6,
				"body": "> [parallax](#comment_4_1MCsuaWbHen3B6XtssFMPn2aD7rB8iT6bp): PHP, SQL, JavaScript (не много).\n> оффтоп: Кому интересно, команду кодеров собираем у нас на ресурсе.\n> Coders From Odessa\n\nПиров нету :C",
				"added": 1515237960
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 7,
				"body": "Здраститя.",
				"added": 1521053036
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 8,
				"body": "Debian, а так никсов больше не имею.",
				"added": 1521053083
			}
		],
		"1_1WjsP529JEqRG1hNeCzGUEdPB83BVbRxB": [
			{
				"comment_id": 9,
				"body": "Поровну.",
				"added": 1521053242
			}
		]
	},
	"comment_vote": {}
}