{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1592336884,
			"title": "Griffin: OK, we can turn off the projector... that’s very interesting.",
			"body": "Well you spoke several times before about ideological subversion. That is a phrase that I’m afraid some Americans don’t fully understand. When the Soviets use the phrase ‘ideological subversion,’ what do they mean by it?\n\nBezmenov: Ideological subversion is the process, which is legitimate, overt, and open; you can see it with your own eyes. All you have to do, all American mass media has to do, is to unplug their bananas from their ears, open up their eyes, and they can see it. There is no mystery. [It has] nothing to do with espionage. I know that espionage intelligence-gathering looks more romantic. It sells more deodorants through the advertising, probably. That’s why your Hollywood producers are so crazy about James Bond-type of thrillers.\n\nBut in reality, the main emphasis of the KGB is not in the area of intelligence at all. According to my opinion and [the] opinion of many defectors of my caliber, only about 15% of time, money, and manpower [are] spent on espionage as such. The other 85% is a slow process, which we call either ‘ideological subversion,’ or ‘active measures’—‘[?]’ in the language of the KGB—or ‘psychological warfare.’ What it basically means is, to change the perception of reality, of every American, to such an extent that despite of the abundance of information, no one is able to come to sensible conclusions in the interests of defending themselves, their families, their community and their country.\n\nIt’s a great brainwashing process, which goes very slow[ly] and is divided [into] four basic stages. The first one [is] demoralization; it takes from 15-20 years to demoralize a nation. Why that many years? Because this is the minimum number of years which [is required] to educate one generation of students in the country of your enemy, exposed to the ideology of the enemy. In other words, Marxist-Leninist ideology is being pumped into the soft heads of at least three generations of American students, without being challenged, or counter-balanced by the basic values of Americanism (American patriotism).\n\nThe result? The result you can see. Most of the people who graduated in the sixties (drop-outs or half-baked intellectuals) are now occupying the positions of power in the government, civil service, business, mass media, [and the] educational system. You are stuck with them. You cannot get rid of them. They are contaminated; they are programmed to think and react to certain stimuli in a certain pattern. You cannot change their mind[s], even if you expose them to authentic information, even if you prove that white is white and black is black, you still cannot change the basic perception and the logic of behavior. In other words, these people... the process of demoralization is complete and irreversible. To [rid] society of these people, you need another twenty or fifteen years to educate a new generation of patriotically-minded and common sense people, who would be acting in favor and in the interests of United States society.\n\nGriffin: And yet these people who have been ‘programmed,’ and as you say [are] in place and who are favorable to an opening with the Soviet concept... these are the very people who would be marked for extermination in this country?\n\nBezmenov: Most of them, yes. Simply because the psychological shock when they will see in [the] future what the beautiful society of ‘equality’ and ‘social justice’ means in practice, obviously they will revolt. They will be very unhappy, frustrated people, and the Marxist-Leninist regime does not tolerate these people. Obviously they will join the leagues of dissenters (dissidents).\n\nUnlike in [the] present United States there will be no place for dissent in future Marxist-Leninist America. Here you can get popular like Daniel Ellsberg and filthy-rich like Jane Fonda for being ‘dissident,’ for criticizing your Pentagon. In [the] future these people will be simply [squashing sound] squashed like cockroaches. Nobody is going to pay them nothing for their beautiful, noble ideas of equality. This they don't understand and it will be [the] greatest shock for them, of course.\n\nThe demoralization process in [the] United States is basically completed already. For the last 25 years... actually, it's over-fulfilled because demoralization now reaches such areas where previously not even Comrade Andropov and all his experts would even dream of such a tremendous success. Most of it is done by Americans to Americans, thanks to [a] lack of moral standards.\n\nAs I mentioned before, exposure to true information does not matter anymore. A person who was demoralized is unable to assess true information. The facts tell nothing to him. Even if I shower him with information, with authentic proof, with documents, with pictures; even if I take him by force to the Soviet Union and show him [a] concentration camp, he will refuse to believe it, until he [receives] a kick in his fan-bottom. When a military boot crashes his... then he will understand. But not before that. That's the [tragedy] of the situation of demoralization.\n\nSo basically America is stuck with demoralization and unless... even if you start right now, here, this minute, you start educating [a] new generation of American[s], it will still take you fifteen to twenty years to turn the tide of ideological perception of reality back to normalcy and patriotism.\n\nThe next stage is destabilization. This time [the] subverter does not care about your ideas and the patterns of your consumption; whether you eat junk food and get fat and flabby doesn’t matter any more. This time—and it takes only from two to five years to destabilize a nation—what matters [are] essentials: economy, foreign relations, [and] defense systems. And you can see it quite clearly that in some areas, in such sensitive areas as defense and [the] economy, the influence of Marxist-Leninist ideas in [the] United States is absolutely fantastic. I could never believe it fourteen years ago when I landed in this part of the world that the process [would have gone] that fast.\n\nThe next stage, of course, is crisis. It may take only up to six weeks to bring a country to the verge of crisis. You can see it in Central America now.\n\nAnd, after crisis, with a violent change of power, structure, and economy, you have [the so-called] period of normalization. It may last indefinitely. Normalization is a cynical expression borrowed from Soviet propaganda. When the Soviet tanks moved into Czechoslovakia in ‘68, Comrade Brezhnev said, ‘Now the situation in brotherly Czechoslovakia is normalized.’\n\nThis is what will happen in [the] United States if you allow all these schmucks to bring the country to crisis, to promise people all kind[s] of goodies and the paradise on earth, to destabilize your economy, to eliminate the principle of free market competition, and to put [a] Big Brother government in Washington, D.C. with benevolent dictators like Walter Mondale, who will promise lots of thing[s], never mind whether the promises are fulfillable or not. He will go to Moscow to kiss the bottoms of [a] new generation of Soviet assassins, never mind... he will create false illusions that the situation is under control. [The] situation is not under control. [The] situation is disgustingly out of control.\n\nMost of the American politicians, media, and educational system trains another generation of people who think they are living at the peacetime. False. [The] United States is in a state of war: undeclared, total war against the basic principles and foundations of this system. And the initiator of this war is not Comrade Andropov, of course. It's the system. However ridiculous it may sound, [it is] the world Communist system (or the world Communist conspiracy). Whether I scare some people or not, I don't give a hoot. If you are not scared by now, nothing can scare you.\n\nBut you don’t have to be paranoid about it. What actually happens now [is] that unlike [me], you have literally several years to live on unless [the] United States [wakes] up. The time bomb is ticking: with every second [he snaps his fingers], the disaster is coming closer and closer. Unlike [me], you will have nowhere to defect to. Unless you want to live in Antarctica with penguins. This is it. This is the last country of freedom and possibility.\n\nGriffin: Okay, so what do we do? What is your recommendation to the American people?\n\nBezmenov: Well, the immediate thing that comes to my mind is of course, there must be a very strong national effort to educate people in the spirit of real patriotism, number one. Number two, to explain [to] them the real danger of socialist, communist, whatever, welfare state, Big Brother government. If people will fail to grasp the impending danger of that development, nothing ever can help [the] United States. You may kiss good bye to your freedom, including freedoms [for] homosexuals, [for] prison inmate[s]; all this freedom will vanish, evaporate in five seconds... including your precious lives.\n\nThe second thing: [at] the moment at least part of [the] United States population is convinced that the danger is real. They have to force their government, and I'm not talking about sending letters, signing petitions, and all this beautiful, noble activity. I'm talking about forcing [the] United States government to stop aiding Communism. Because there is no other problem more burning and urgent than to stop the Soviet military-industrial complex from destroying whatever is left of the free world. And it is very easy to do: no credits, no technology, no money, no political or diplomatic recognition, and of course no such idiocy as grain deals to [the] USSR.\n\nThe Soviet people, 270 [million] Soviets, will be eternally thankful to you if you stop aiding [the] bunch of murderers who sit now in [the] Kremlin, and whom President Reagan respectfully calls ‘government.’ They do not govern anything, least of all such [a] complexity as the Soviet economy.\n\nSo basic[ally], two very simple... maybe two simplistic answers or solutions, but nevertheless they are the only solutions: educate yourself, [and] understand what’s going on around you. You are not living at [a] time of peace. You are in a state of war and you have precious little time to save yourself. You don’t have much time, especially if you are talking about [the] young generation. There’s not much time left for convulsions to the beautiful disco music. Very soon it will go [he snaps his fingers] just overnight.\n\nIf we are talking about capitalists or wealthy businessmen, I think they are selling the rope from which they will hang very soon. If they don’t stop, if they cannot curb their unsettled desire for profit, and if they keep on trading with the monster of the Soviet Communism, they are going to hang very soon. And they will pray to be killed, but unfortunately they will be sent to Alaska, probably, to manage [the] industry of slaves.\n\nIt’s simplistic. I know it sounds unpleasant; I know Americans don’t like to listen to things which are unpleasant, but I have defected not to tell you the stories about such idiocy as microfilm, James Bond-type espionage. This is garbage. You don’t need any espionage anymore. I have come to talk about survival. It’s a question of [the] survival of this system. You may ask me what is [in it] for me. Survival, obviously. Because I like... as I said, I am now in your boat. If we sink together, we will sink beautifully together. There is no other place on this planet to defect to.",
			"added": 1592336883
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1592336884_15BUFmc7TAvBcv9ay1y8uaorEwXGrteSVT": [
			{
				"comment_id": 1,
				"body": "Griffin: And yet these people who have been ‘programmed,’ and as you say [are] in place and who are favorable to an opening with the Soviet concept... these are the very people who would be marked for extermination in this country?\n\nBezmenov: Most of them, yes. Simply because the psychological shock when they will see in [the] future what the beautiful society of ‘equality’ and ‘social justice’ means in practice, obviously they will revolt. They will be very unhappy, frustrated people, and the Marxist-Leninist regime does not tolerate these people. Obviously they will join the leagues of dissenters (dissidents).\n\nUnlike in [the] present United States there will be no place for dissent in future Marxist-Leninist America.",
				"added": 1592337065
			},
			{
				"comment_id": 2,
				"body": "As I mentioned before, exposure to true information does not matter anymore. A person who was demoralized is unable to assess true information. The facts tell nothing to him.",
				"added": 1592337125
			},
			{
				"comment_id": 3,
				"body": "The next stage, of course, is crisis. It may take only up to six weeks to bring a country to the verge of crisis.",
				"added": 1592337181
			},
			{
				"comment_id": 4,
				"body": "And, after crisis, with a violent change of power, structure, and economy, you have [the so-called] period of normalization. It may last indefinitely. Normalization is a cynical expression borrowed from Soviet propaganda. When the Soviet tanks moved into Czechoslovakia in ‘68, Comrade Brezhnev said, ‘Now the situation in brotherly Czechoslovakia is normalized.’",
				"added": 1592337202
			},
			{
				"comment_id": 5,
				"body": "This is what will happen in [the] United States if you allow all these schmucks to bring the country to crisis, to promise people all kind[s] of goodies and the paradise on earth, to destabilize your economy, to eliminate the principle of free market competition, and to put [a] Big Brother government in Washington",
				"added": 1592337239
			},
			{
				"comment_id": 6,
				"body": "Most of the American politicians, media, and educational system trains another generation of people who think they are living at the peacetime. False. [The] United States is in a state of war: undeclared, total war against the basic principles and foundations of this system. And the initiator of this war is not Comrade Andropov, of course. It's the system. However ridiculous it may sound, [it is] the world Communist system (or the world Communist conspiracy). Whether I scare some people or not, I don't give a hoot. If you are not scared by now, nothing can scare you.",
				"added": 1592337307
			},
			{
				"comment_id": 7,
				"body": "The time bomb is ticking: with every second [he snaps his fingers], the disaster is coming closer and closer. Unlike [me], you will have nowhere to defect to. Unless you want to live in Antarctica with penguins. This is it. This is the last country of freedom and possibility.",
				"added": 1592337337
			},
			{
				"comment_id": 8,
				"body": "If we sink together, we will sink beautifully together. There is no other place on this planet to defect to.",
				"added": 1592337379
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 9,
				"body": "To my horror I discovered that in the files were people who were doomed to execution. There were names of pro-Soviet journalists with whom I was personally friendly.\n\nGriffin: Pro-Soviet?\n\nBezmenov: Yes! They were idealistically-minded leftists who made several visits to [the] USSR. And yet, the KGB decided that ‘con-revolution,’ or drastic changes in [the] political structure of India, they will have to go.\n\nGriffin: Why is that?\n\nBezmenov: Because [laughs] they know too much. Simply, because you see, the useful idiots, the leftists who are idealistically believing in the beauty of [the] Soviet socialist or Communist or whatever system, when they get disillusioned, they become the worst enemies. \n\nGriffin: But to eliminate the others, to execute the others? Don’t they serve some purpose; wouldn’t they be the ones you rely on?\n\nBezmenov: No. They serve [a] purpose only at the stage of destabilization of a nation. For example, your leftists in [the] United States: all these professors and all these beautiful civil rights defenders. They are instrumental in the process of the subversion only to destabilize a nation. When their job is completed, they are not needed any more. They know too much. Some of them, when they get disillusioned, when they see that Marxist-Leninists come to power—obviously they get offended—they think that they will come to power. That will never happen, of course. They will be lined up against the wall and shot.",
				"added": 1592338482
			}
		]
	},
	"comment_vote": {}
}