{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"5_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 1,
				"body": "[The Snowden Files ](http://127.0.0.1:43110/1DaXkbpBN7d9h78T5mjB2gTV9Ui46Bjwcv/)\n[Sites for Learning … ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1623818490_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Sites+for+Learning)\n[Truth and God ... ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA/Truth+and+God)\n[Special Topics …  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624002662_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Topics)\n[50 K limit to be avoided! ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624003018_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/50+K+limit+to+be+avoided)\n[Final Fantasy Special Songs … ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1624005163_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Songs)\n\n[Gate of Heaven … ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:4_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Gate+of+Heaven)\n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)\n[Data Block or 50 KB Data Limitation issues ](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Some+Self+Contradictory+Problems)\n;;\n[To Remember It More Easily…  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1625559291_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/To+Remember+It+More+Easily)\n;;\n",
				"added": 1630989056
			}
		],
		"3_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX": [
			{
				"comment_id": 2,
				"body": "The Gettysburg Address by Abraham Lincoln\nFour score and seven years ago our fathers brought forth ,on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\nNow we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that nation might live. It is altogether fitting and proper that we should do this.\n**But, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. ** \nThe world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth.\nAbraham Lincoln\nNovember 19, 1863 \n译本\n亚伯拉罕·林肯发表演说\n亚伯拉罕·林肯发表演说(3张)\n八十七年前，我们的祖先在这个大陆上建立了一个新的国家，它受孕于自由的理念，并献身于一切人生来平等的理想。\n如今我们正在从事一场伟大的内战，以考验我们或任何一个受孕于自由和献身于上述理想的国家是否能够长久生存下去。我们聚集在那场战争中的一个伟大的战场上，我们来到这里，是要把这个战场土地的一部分作为最终安息之所奉献给那些献出了自己的生命的烈士们，他们牺牲了自己以使这个国家可能生存下去。奉献这块土地作为他们的安息之所是完全恰当的和合适的，我们应该这么做。\n但是，从更广泛的意义上来说，我们无从奉献——我们无从圣化——我们无从神化，这块土地。那些在这里战斗过的勇士，活着的和死去的，已经圣化了这里，它的神圣远非我们的微弱之力可以使其增减丝毫。世人不大会注意，更不会长久记得我们在这里所说的话，然而他们将永远无法忘记那些英雄们在这里所做的事。这更要求我们这些活着的人去献身于那些英雄们为之战斗的未尽事业。我们应该在此献身于仍然留在我们面前的伟大任务——要从这些光荣的死者身上汲取更多的奉献精神来完成他们已经完全彻底为之献身的事业——我们要在此下定最大的决心决不让这些死者白白牺牲——要让这个国家在上帝庇佑下获得自由的新生——要让那个民有、民治、民享的政府不从地球上消失。",
				"added": 1631011651
			},
			{
				"comment_id": 3,
				"body": "https://t.me/trump/16348 \n45th President Donald J. Trump to Hold a Rally in Iowa\n\nPresident Donald J. Trump, 45th President of the United States of America, will hold a rally in Des Moines, Iowa, on Saturday, October 9, 2021, at 7:00PM CDT.\n\nSaturday, October 9, 2021, at 7:00PM CDT\nPresident Donald J. Trump, 45th President of the United States of America, Delivers Remarks\n\nVenue:\nIowa State Fairgrounds\n3000 E Grand Ave\nDes Moines, IA 50317\n \nTimeline of Events:\n2:00PM – Doors open and Live Entertainment Begins\n5:00PM – Pre-program Speakers Deliver Remarks\n7:00PM – 45th President Donald J. Trump Delivers Remarks \n",
				"added": 1631178597
			}
		]
	},
	"comment_vote": {}
}