{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_16PCi4wBadBEgVZS29EayEEPhQTfGA5QMM": 1,
		"1_12r4aMRZLpvVZhhY7SQJxprTzqpocp8rYo": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 1,
				"body": "The Big Bang Theory S06E22 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585773839_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1585773928
			},
			{
				"comment_id": 7,
				"body": "Chernobyl S01E01 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585935147_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1585935235
			},
			{
				"comment_id": 8,
				"body": "Chernobyl S01E02 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585953240_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1585953483
			},
			{
				"comment_id": 9,
				"body": "Chernobyl S01E03 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585955427_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1585955489
			},
			{
				"comment_id": 11,
				"body": "Chernobyl S01E05 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586022985_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586023058
			},
			{
				"comment_id": 24,
				"body": "The Big Bang Theory S06E23 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586406564_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586406652
			},
			{
				"comment_id": 29,
				"body": "The Big Bang Theory S06E24 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586799842_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586799995
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "Falcão - O Campeão dos Campeões 1987 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585812164_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Depois que descobre que sua ex-mulher está com uma doença grave, Lincoln Hawk (Sylvester Stallone) tenta se aproximar de seu filho Michael (David Mendenhall). Porém, por ter sido um pai ausente, ele encontra resistência por parte do jovem e de seu avô.",
				"added": 1585812660
			},
			{
				"comment_id": 3,
				"body": "Pirates of Silicon Valley (Piratas do Vale do Silício) 1999 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585816109_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse:A ascensão da Apple e da Microsoft, as duas maiores empresas de informática do planeta. Em busca da liderança do mercado Steve Jobs (Noah Wyle) e Bill Gates (Anthony Michael Hall), fundadores das empresas, enfrentam-se em uma guerra de bastidores.",
				"added": 1585816212
			},
			{
				"comment_id": 5,
				"body": "Todo Mundo em Pânico 2 2001 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585853924_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Megan Voorhess é uma jovem garota que está possuída pelo demônio. Os padres McFeely e Harris partem em seu socorro, a fim de exorcizá-la, mas falham miseravelmente em sua missão, quando as línguas de Megan e do padre McFeely ficam presas e todos acabam vomitando sopa de ervilha uns nos outros. Um ano depois, Cindy Campbell, Ray Maker, Shorty Meeks e Brenda estão tentando esquecer os incidentes que ocorreram com o grupo no último Halloween. Neste contexto Cindy está apaixonada por Buddy e Ray continua indeciso sobre sua sexualidade, até que o Professor Oldman e seu assistente deficiente Dwight encomendam aos alunos um estudo sobre a Casa do Inferno, um lugar onde uma sessão frustrada de exorcismo ocorreu no passado. Mas o caos tem início quando Cindy encontra Hanson, o vigia louco da Casa do Inferno que possui uma mão deformada, fazendo com que o grupo desvende os vários mistérios que cercam o local.",
				"added": 1585854420
			},
			{
				"comment_id": 12,
				"body": "Simpson O Filme 2007 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586040169_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Homer Simpson (Dan Castellaneta) tem um novo bicho de estimação: um porco. Devido a um silo perfurado e cheio de fezes, um desastre de grandes proporções acontece em Springfield. Isto faz com que uma multidão sedenta por vingança se reúna diante da casa dos Simpsons, querendo Homer e sua família de qualquer jeito. Eles conseguem escapar, mas a partir de então os Simpsons passam a discutir e se dividir sobre o ocorrido. Paralelamente o ocorrido chama a atenção do presidente dos Estados Unidos, Arnold Schwazenegger (Harry Shearer), e do chefe da Agência de Proteção Ambiental, Russ Cargill (Albert Brooks), que planeja realizar um plano diabólico para conter o desastre ocorrido.",
				"added": 1586040519
			},
			{
				"comment_id": 15,
				"body": "Liga Da Justiça A Nova Fronteira 2008 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586077232_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Nos anos 1950, Super-Homem se une a Batman, Mulher-Maravilha, Lanterna Verde, Flash e outros incríveis heróis para fundar a Liga da Justiça e livrar o mundo de uma terrível ameaça.",
				"added": 1586079680
			},
			{
				"comment_id": 16,
				"body": "Defiance (Um Ato de Liberdade) 2009 Leg\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586114734_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Tuvia (Daniel Craig), Zus (Liev Schreiber) e Asael Bielski (Jamie Bell) são três irmãos judeus que vivem na Polônia ocupada pelos nazistas na Segunda Guerra Mundial. Eles decidem enfrentar o inimigo e partem em direção a uma floresta na Bielo-Rússia. Lá, os irmãos Bielski unem-se à resistência soviética e fundam uma vila para proteger 1.200 judeus.",
				"added": 1586114982
			},
			{
				"comment_id": 22,
				"body": "Nascido Para Matar 1987 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586375310_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Um sargento (R. Lee Ermey) treina de forma fanática e sádica os recrutas em uma base de treinamentos, na intenção de transformá-los em máquinas de guerra para combater na Guerra do Vietnã. Após serem transformados em fuzileiros navais, eles são enviados para a guerra e quando lá chegam se deparam com seus horrores.",
				"added": 1586375633
			},
			{
				"comment_id": 26,
				"body": "Lifeforce (Força Sinistra) 1985 Leg\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586485287_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Tudo começa quando a tripulação de um ônibus espacial descobre, na cauda do cometa, uma espaçonave contendo alienígenas fossilizados, a maior parte semelhantes a grandes morcegos. Três dos alienígenas, em forma humana, são trazidos à Terra, revivem e, ao se alimentarem da força vital de suas vítimas, transformam as pessoas em um tipo de vampiro. As vítimas continuam o ciclo, e em breve todo o planeta está em perigo. O único sobrevivente do ônibus espacial segue em busca da líder dos vampiros do espaço.",
				"added": 1586485798
			},
			{
				"comment_id": 27,
				"body": "Loverboy - O Garoto de Programa 1989 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586579834_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse:\nUm universitário, Randy Bodek (Patrick Dempsey), não assume para seus pais, Diane (Kate Jackson) e Joe Bodek (Robert Gintry), que está tendo um relacionamento sério com uma colega de faculdade, Jenny Gordon (Nancy Valen). Isto a deixa muito irritada, o que faz com que rompa com Randy. Paralelamente as notas dele na faculdade estão bem baixas, o que deixa seu pai tão aborrecido que deixa de pagar sua faculdade. Randy descobre que ama Jenny, mas para isto precisa voltar para a universidade. Como precisa de dinheiro, ele arruma um emprego como entregador de pizzas mas muda de \"profissão\" ao conhecer uma empresária, Alexandra 'Alex' Barnett (Barbara Carrera), com quem se envolve rapidamente. Ela o ajuda financeiramente e, além disto, fornece para amigas o telefone de seu trabalho. Quando pedem uma pizza \"com muitas anchovas\" isto significa que as clientes querem outro tipo de \"serviço\". Assim se envolve com mulheres mais velhas, que se sentem sexualmente frustradas. Por ironia, Joe acha que o filho é gay.",
				"added": 1586580324
			},
			{
				"comment_id": 31,
				"body": "Goodfellas (Os Bons Companheiros) 1990 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586830729_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Henry Hill conta a sua história de garoto do Brooklyn, Nova York, que sempre sonhou ser gângster, começando sua “carreira” aos 11 anos e se tornando protegido de James “Jimmy” Conway, um mafioso em ascensão. Tratado como filho por mais de vinte anos, ele se envolve em golpes cada vez maiores e acaba se casando com Karen Hill, sua amante. Impossibilitado de ser totalmente “adotado” pela “família”, o jovem ambicioso conquista prestígio, se envolve com o tráfico de drogas, prática grandes roubos e ganha muito dinheiro, mas os agentes federais estão na sua cola e o seu destino pode mudar a qualquer momento.",
				"added": 1586831572
			},
			{
				"comment_id": 32,
				"body": "Jurassic Park ll - O Mundo Perdido 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586904338_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Uma equipe de pesquisadores é enviada para uma ilha a quilômetros de distância da casa anterior do Jurassic Park, para documentar e fotografar os dinossauros agora liberados. No entanto, a InGen, empresa de bioengenharia, enviou outra equipe maior para a mesma ilha para capturar, sedar e transportar alguns dinossauros até San Diego, onde serão utilizados em um novo local do Jurassic Park. Mas a vida sempre encontra um caminho. As duas equipes retornarão ao continente com descobertas bem-sucedidas? Ou será que outra tragédia ocorrerá?",
				"added": 1586904581
			},
			{
				"comment_id": 33,
				"body": "Predador 2 - A Caçada Continua 1990 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586917967_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Los Angeles, 1997. Em meio a um imenso tiroteio nas ruas entre traficantes colombianos e a polícia, Mike Harrigan, um destemido policial que quer impor a ordem nas ruas, planeja formar um grupo com tiras de diferentes etnias, para combater o crime. Apesar da burocracia dos seus superiores, seus problemas pioram ainda mais quando os integrantes das quadrilhas passam a ser brutalmente assassinados por um ser de outro planeta, que tem o poder de ficar invisível. Mas as coisas realmente pioram quando a criatura escolhe Harrigan como seu principal alvo.",
				"added": 1586918073
			},
			{
				"comment_id": 34,
				"body": "Indiana Jones e Os Caçadores da Arca Perdida 1981 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586936228_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Em 1936, o arqueólogo Indiana Jones (Harrison Ford) é contratado para encontrar a Arca da Aliança, que segundo as escrituras bíblicas conteria “Os Dez Mandamentos” que Deus revelou a Moisés no Monte Horeb. Mas como a lenda diz que o exército que a possuir será invencível, Indiana Jones terá um adversário de peso na busca pela arca perdida: o próprio Adolf Hitler.",
				"added": 1586936441
			},
			{
				"comment_id": 35,
				"body": "Perdidos no Espaço - O Filme 1998 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587053468_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Na segunda metade do século XXI, as fontes de energia de origem fóssil estão para serem esgotadas. Na tentativa de salvar a raça humana os cientistas construíram um portal que permite que a viagem na velocidade da luz possa ser possível, mas só se existir um outro portal para receber os viajantes. Com isso, um cientista e sua família são escolhidos para viajar em velocidade normal até o local onde o segundo portal deve ser construído, numa viagem que durará dez anos e onde os tripulantes ficarão criogenicamente congelados até chegarem em Alpha Prime, o único planeta habitável conhecido. Totalmente perdidos, eles se defrontam com uma infinidade de perigos que os ameaçam constantemente e tentam encontrar Alpha Prime para construírem o segundo portal, que é a única esperança da população da Terra.",
				"added": 1587053690
			},
			{
				"comment_id": 36,
				"body": "The Avengers (Os Vingadores) 2012 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587085178_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs\n\nSinopse: Loki, o irmão de Thor, ganha acesso ao poder ilimitado do cubo cósmico ao roubá-lo de dentro das instalações da S.H.I.E.L.D. Nick Fury, o diretor desta agência internacional que mantém a paz, logo reúne os únicos super-heróis que serão capazes de defender a Terra de ameaças sem precedentes. Homem de Ferro, Capitão América, Hulk, Thor, Viúva Negra e Gavião Arqueiro formam o time dos sonhos de Fury, mas eles precisam aprender a colocar os egos de lado e agir como um grupo em prol da humanidade.",
				"added": 1587085529
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 4,
				"body": "Dragon Ball Z - Episodio 053 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1585853765_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1585853808
			},
			{
				"comment_id": 10,
				"body": "Dragon Ball Z - Episodio 054 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586022507_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586022895
			},
			{
				"comment_id": 13,
				"body": "Dragon Ball Z - Episodio 055 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586046145_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586046412
			},
			{
				"comment_id": 17,
				"body": "Dragon Ball Z - Episodio 056 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586197868_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586197932
			},
			{
				"comment_id": 18,
				"body": "> [pineapplehead](#comment_2_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes): BNA - Brand New Animals\n> BNA se passa no século 21, no qual a existência de animais humanoides foi revelada ao mundo após viverem na escuridão por séculos. Um dia, uma estudante do ensino médio chamada Michiru de repente se transforma em uma tanuki humanoide. Depois de morar na cidade de Anima, onde conhece o lobo Ogami Shiro, ela investiga por que se tornou um animal e se envolve em eventos ainda mais estranhos no processo.\n> Ep 1 - http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586233796_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHesEp 2 - http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586234501_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHesEp 3 - http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586234614_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHesEp 4 - http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586234825_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHesEp 5 - http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586234945_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes\n> Sei que o Ep 6 já saiu no Japão, mas estou com dificuldades de encontrar. Assim que sair eu posto.Qualquer coisa já segue o canal pra acompanhar as novidades:\n> http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Channel=pineapplehead@zeroid.bit\n\nque show, parabéns por trazer mais videos a zeronet, e lembre-se, tem que mandar o aplicativo da zeronet aberto para poderem baixar de ti ou alguma outra pessoa tem que ter baixado de ti e manter também .\n\nParabéns e show de bola, vamo que vamos :D",
				"added": 1586275056
			},
			{
				"comment_id": 19,
				"body": "Dragon Ball Z - Episodio 057 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586275085_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586275174
			},
			{
				"comment_id": 20,
				"body": "Naruto Classico 57 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586290527_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586290642
			},
			{
				"comment_id": 23,
				"body": "Dragon Ball Z - Episodio 058 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586406327_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586406382
			},
			{
				"comment_id": 25,
				"body": "Os Simpsons S02E17 Dinheiro de Velho Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586414228_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586414287
			},
			{
				"comment_id": 28,
				"body": "Dragon Ball Z - Episodio 059 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586755209_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586755282
			},
			{
				"comment_id": 30,
				"body": "Os Simpsons S02E18 Capricha no Retrato Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1586803279_17uiQfC8JM7Q3heczaWHZWPgekvzi4BdQs",
				"added": 1586803616
			}
		],
		"1_16PCi4wBadBEgVZS29EayEEPhQTfGA5QMM": [
			{
				"comment_id": 6,
				"body": "aqui tem vários filmes seriados, animes , desenhos e etc\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest\n\nestou convertendo o seriado Chernobyl  para disponibilizar ai também :)",
				"added": 1585935093
			},
			{
				"comment_id": 14,
				"body": "> [alistair](#comment_2_16PCi4wBadBEgVZS29EayEEPhQTfGA5QMM): Muito obrigado!\n\n:) vamo que vamos :), estou tentando ajudar a zeronet , a descentralização e as pessoas, disponibilizando e mantendo TUDO que posto neste site.",
				"added": 1586079665
			}
		],
		"1_12r4aMRZLpvVZhhY7SQJxprTzqpocp8rYo": [
			{
				"comment_id": 21,
				"body": "tem este site que eu posto video nele e mantenho \nBig Kopy kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest\n\nA diferença dele é ter suporte ao sistema de login descentralizado  http://127.0.0.1:43110/cryptoid.bit/ , alem do zeroid normal do outro kopykate.\n\nFora que o limite de tamanho por arquivos unicos é de uns 15GB.\n\nFora suporte a mp4, m4v ,mp3 ,mkv ,ogv ,ogg e webm.\n\nEste site tem mais suporte a formatos que o kopykate pelo que vi, não sei se mudaram o outro, espero que sim, este big kopy kate 2, os desenvolvedores mudaram e parece que era coisa simples :)",
				"added": 1586375263
			}
		]
	},
	"comment_vote": {
		"2_16PCi4wBadBEgVZS29EayEEPhQTfGA5QMM": 1,
		"2_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes": 1
	}
}