{
	"next_post_id": 5,
	"next_comment_id": 3,
	"next_follow_id": 3,
	"avatar": "jpg",
	"user_name": "Futuretoast",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "I don't know what to put here so Imma leave it like this.",
	"post": [
		{
			"post_id": 1,
			"date_added": 1536856928,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1536859889,
			"body": "Right now there are a bunch of unclaimed domains on ZeroNet. Everything's been claimed on the clear-net. This is kinda cool. Now I need to choose an awesome domain name to use as my personal one.",
			"date_added": 1536859887
		},
		{
			"post_id": 1543737160,
			"body": "Tfw you forget to set a pfp for like 6 months so your account just has the default icon for aaaages.",
			"date_added": 1543737157
		},
		{
			"post_id": 1543737884,
			"body": "Got to thinking and realized something. If we ignore the aspects of decentralization and censorship resistance for a minute here ZeroNet is still supior to the regular net due to features like offline browsing and the extra speed afforded by the bittorent-based nature of it. Therefore if we want to get people onto zeronet that's what we need to be talking about. Too much of the population doesn't care about online censorship. They do however care about fast loading times and offline browsing would be a plus to a lot of people. So advertise the loading times and offline browsing to get people on.",
			"date_added": 1543737880
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Quantumworld: Can't be banned from twiter if you never used it :)\n\nStill though I'm just saying the whole network is gonna fall through if we can't get people on it. Most of the people on here (myself included) do care about privacy but the unfortunate reality is that we're a minority in that regards. That's why we need to make an appeal to something that the majority values in order to get them on. It also just so happens that zeronet might be marketable off of loading speed which the majority does care about. Not to mention the netowrk needs people talking about something other than politics because while political events are important, they also get stressful and thusly shitposting exists. I'm just looking at this pragmatically. Ideas are useless if they never leave the realm of the mind.",
			"post_uri": "1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1_1543737884",
			"date_added": 1543740088
		},
		{
			"comment_id": 2,
			"body": "@Quantumworld: I've yet to find one person irl who even know what zeronet is let alone uses it. While it is growing at a rate that gives me a good amount of hope that it will eventually surpass the clearnet it's also tiny compaed to it. I'm hopeful about it's fate but I also try to keep in mind that it's fate isn't certain and that works both ways. It could fail horendously or more ideally it could replace the clearnet. I hope for the latter and just think it's gonna take a while of being persistent with getting people to switch. To repeat a common quote, \"It's not a sprint, it's a marathon\"",
			"post_uri": "1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1_1543737884",
			"date_added": 1543741265
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd",
			"user_name": "Styromaniac",
			"date_added": 1536860219
		},
		{
			"follow_id": 2,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC",
			"user_name": "Eightyfour",
			"date_added": 1543737301
		}
	]
}