{
	"message": [
		{
			"body": "@flyman@zid: English steals a lot of common words from French to mean \"smart\" things. Not that I can think of any off the top of my head.",
			"date_added": 1460496014538
		},
		{
			"body": "Hello @yilmazerkan@zv",
			"date_added": 1460496315608
		},
		{
			"body": "Which is cooler to have after your name, @zv or @zid?",
			"date_added": 1460496339190
		},
		{
			"body": "I get the feeling this chat system is doing something very expensive every time someone sends a message.",
			"date_added": 1460496548707
		},
		{
			"body": "@zarka@zid: I feel sorry for the Québécois having to come up with their own words for such things.",
			"date_added": 1460503074828
		},
		{
			"body": "@yilmazerkan@zv: Because I get throttled if I try talking too fast, and I'm guessing it's implemented by updating a torrent.",
			"date_added": 1460503312232
		},
		{
			"body": "/me responds in LIFO order because the scrollback is upside down.",
			"date_added": 1460503347793
		},
		{
			"body": "/me waves",
			"date_added": 1460610362824
		},
		{
			"body": "Is there some way to publish changes to a 0site without shutting down zeronet to do it?",
			"date_added": 1460610401503
		},
		{
			"body": "Oh never mind it looks like I can just do that from the left hand nav",
			"date_added": 1460611767648
		},
		{
			"body": "Though it always says \"1 file update failed\"",
			"date_added": 1460611807639
		},
		{
			"body": "night @musickiller@zid",
			"date_added": 1460671401535
		},
		{
			"body": "hi @yilmazerkan@zv",
			"date_added": 1460672126760
		},
		{
			"body": "all is grand, thanks. How about with you?",
			"date_added": 1460672260693
		},
		{
			"body": "maybe good if it is the appropriate time of day for that, maybe not so good",
			"date_added": 1460672827666
		},
		{
			"body": "That case kinda takes the wind out of the sails of anyone claiming Germany is a free country.",
			"date_added": 1460728151977
		},
		{
			"body": "Daesh make for strange bedfellows.",
			"date_added": 1460728425979
		},
		{
			"body": "@0penworld@zv: you guys need a .bit domain",
			"date_added": 1460751175332
		},
		{
			"body": "Speaking of which, is there any point to mining namecoin with a CPU, or should I give up now and ask someone else to register a domain for me?",
			"date_added": 1460751219328
		},
		{
			"body": "@yilmazerkan@zv: thanks. If I give you a receiver key I don't have to trust you past initial registration, right?",
			"date_added": 1460751749484
		},
		{
			"body": "Or at least, I imagine it would be obvious if you continued to have access to muck with the domain.",
			"date_added": 1460751762765
		},
		{
			"body": "@yilmazerkan@zv: an address that is the one that's allowed to make future modifications, renew, etc",
			"date_added": 1460752484692
		},
		{
			"body": "versus your own",
			"date_added": 1460752494197
		},
		{
			"body": "I can't remember where I saw that terminology",
			"date_added": 1460752543524
		},
		{
			"body": "I think that's what I mean",
			"date_added": 1460752556019
		},
		{
			"body": "New to this namecoin thing",
			"date_added": 1460752561026
		},
		{
			"body": "I have namecoind running and trying to generate blocks but I'm guessing that will take (literally) forever.",
			"date_added": 1460752574003
		},
		{
			"body": "how did you get nmc if I may ask?",
			"date_added": 1460752662466
		},
		{
			"body": "trying to avoid having this identity connected to my meatspace identity in any way",
			"date_added": 1460753012655
		},
		{
			"body": "because I want to avoid the \"chilling effect\" of worrying that the police will show up at my door because of what I say",
			"date_added": 1460753057487
		},
		{
			"body": "I'd like to share my real views rather than my \"sanitized for social media\" views",
			"date_added": 1460753070799
		},
		{
			"body": "no payment yet for renewal, right?",
			"date_added": 1460753147869
		},
		{
			"body": "I have namecoind running behind tor",
			"date_added": 1460753162236
		},
		{
			"body": "ah, so I should probably spend my time trying to figure out how to get nmc that aren't linked to my meatspace identity in any way",
			"date_added": 1460753193181
		},
		{
			"body": "why not?",
			"date_added": 1460753204397
		},
		{
			"body": "is this \"not a protection\" in the sense of \"namecoin has known ways it leaks your identity\" or in the sense of \"namecoin hasn't been audited to make sure it doesn't leak your identity\"?",
			"date_added": 1460753334492
		},
		{
			"body": "I'm OK with the latter, since I am not trying to protect myself for purposes of doing anything more illegal than piracy and saying inflammatory things",
			"date_added": 1460753382058
		},
		{
			"body": "I am familiar with I2P. I'm more inclined to trust Tor because it's gotten a lot more attention. I2P doesn't improve on Tor's design in any fundamental way; it's still low-latency, and there are probably a lot of vulnerabilites that haven't been discovered/exploited because it's never been used by a Silk Road.",
			"date_added": 1460753511514
		},
		{
			"body": "I don't require perfection.",
			"date_added": 1460753561208
		},
		{
			"body": "My approach is \"make spying more expensive\" combined with \"don't provide a high-value target\"",
			"date_added": 1460753616633
		},
		{
			"body": "Hidden services are not good enough to protect a target as valuable as a Silk Road, nor do I expect they will ever be made good enough to",
			"date_added": 1460753727447
		},
		{
			"body": "The site itself needs to be decentralized, which makes it much easier to protect the person/people injecting content into it",
			"date_added": 1460753762502
		},
		{
			"body": "Because then even whoever your DPR is will be \"just a user\"",
			"date_added": 1460753794968
		},
		{
			"body": "gnunet seems to be the best designed high-latency network, but it seems to have no users",
			"date_added": 1460753857319
		},
		{
			"body": "freenet seems dangerous, but I'm not aware of anyone having been arrested for using it yet",
			"date_added": 1460753893014
		},
		{
			"body": "unless this recent CP bust included freenet users",
			"date_added": 1460753907813
		},
		{
			"body": "actually another fatal flaw is Tor's design is that it involves letting \"raw\" web browsers talk to shady web servers",
			"date_added": 1460753988325
		},
		{
			"body": "which makes it very easy for the child pornographers at the FBI to run CP sites that inject malware",
			"date_added": 1460754016660
		},
		{
			"body": "@yilmazerkan@zv: police seized hardware because it had pirated music on it?",
			"date_added": 1460759294430
		},
		{
			"body": "what country?",
			"date_added": 1460759299085
		},
		{
			"body": "@yilmazerkan@zv: I'm interested in namecoin because it seems like an interesting concept and I want to learn more about it by using it",
			"date_added": 1460759324605
		},
		{
			"body": "particularly I like this notion that it \"squares zooko's triangle\"",
			"date_added": 1460759337870
		},
		{
			"body": "though that's also sort of proven by twister",
			"date_added": 1460759357211
		}
	]
}