{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1622958146,
			"title": "How to fight and win against Morale Erosion (demoralization) and Learned Helpness?",
			"body": "“If the mind is to emerge unscathed from this relentless struggle with the unforeseen, two qualities are indispensable: first, an intellect that, even in the darkest hour, retains some glimmerings of the inner light which leads to truth; and second, the courage to follow this faint light wherever it may lead.”\n― Carl Von Clausewitz\n\n\"Carl Philipp Gottfried von Clausewitz was a Prussian general and military theorist who stressed the \"moral\" and political aspects of war. \"\n\nfrom : https://www.zerohedge.com/geopolitical/covid-learned-helplessness-and-control\n\n\"Learned helplessness has three main features: a passive response to trauma, not believing that trauma can be controlled, and stress.\"\n\n\" Learned helplessness is well-documented. It takes place when an individual believes he continuously faces a negative, uncontrollable situation and stops trying to improve his circumstances, even when he has the ability to do so. Discovering the loss of control elicits a passive reaction to a harmful situation. Psychologists call this a maladaptive response, characterized by avoidance of challenges and the collapse of problem-solving when obstacles arise. You give up trying to fight back.\"\n\n\"American psychologists Martin Seligman and Steven Maier created the term “learned helplessness” in 1967. They were studying animal behavior by delivering electric shocks to dogs (it was a simpler time.) Dogs who learned they couldn’t escape the shock simply stopped trying, even after the scientists removed a barrier and the dog could have jumped away.\"\n\n\"Truth is useless to propagandists, actually a threat\"\n\n\"The government denied you the chance to say one final goodbye to the person who raised you and you didn’t fight back? Now that’s control.\"\n\n\"One Harvard professor explains our brains evolved to encode fear so well, it’s hard to turn off.\"\n\n\"Kin to learned helplessness are enforcers. Suddenly your waitress transitions from someone serving you into someone ordering you to wear a mask, sit alone, eat outside, etc. Flight attendants morph from delivering drinks to holding the power to have security haul you to jail for unmasking when not actively eating.\"\n\n\"The way out is to allow people to make decisions and choices on their own. This therapy is used with victims of learned helplessness such as hostages [...].  Upon release, many hostages fear things as simple as a meal choice and need to be coaxed out of helplessness one micro-choice at a time.\"\n\n\"The [MSN] were aided in manufacturing learned helplessness by the most sophisticated propaganda operation ever created. Already engorged with the coin of three years of fake news, the legacy media saw the value of a new crisis toward their two real goals: make as much money as possible garnering clicks, and defeating Donald Trump.\"\n\n\n\n\n\n\n\n\n\n\n",
			"added": 1622958145
		},
		{
			"topic_id": 1622960125,
			"title": "Should the Mossad Murder Jack Dorsey as a little good bye to Byby?",
			"body": "Yea !  To murder jack dorsey is fun, but would of course prefer to wait for him to be killed after his offspring, to hurt him even more and have the opportunity to feed them to him, yes like you tucker carlson, you the weak the coward, those who didn't served, like sean hannity, mike adams or alex jones, you the weak the hopless, the helpess. fearing war, while war will seek you out and root you of your land, land who doesn't belong to you, only once defeated will you understand, how weak, coward, pathetic and in your pretense of morale you just hidden your cowardness... vanquished, your god emperor defeated like a child rapist.\n\nyou don't deserve to live... unless you start to appreciate this quote :\n\n\"Remember, gentlemen, what a Roman emperor said: The corpse of an enemy always smells sweet.\"\nNapoleon Bonaparte \n\nthat's why they will eat their kids...\n\nnow the argument about killing jack dorsey... is about  the my sworn enemy : laura loomer...\n\nhe censored her, he dies. that's it.\n\nand it would make me lulz the funeral of jacky on his platform... ahahah...",
			"added": 1622960123
		},
		{
			"topic_id": 1622962347,
			"title": "The real challenge for the Talibans, drug lords and war lords is to prevent natural opioid illegal trade with the PRC",
			"body": "So in everything, if both move toward the others, it's easier... meaning :\n\n1. the talibans prevent illegal opioids trading toward china.\n2. china open's a natural opoid medical sourcing from afghanistan (because fentanyl and all, there are some who in pain and under medical supervision may certainly need real non synthetics opioids)\n3. TCM publish pricing updated seek lists (of non treatened things, otherwise it's healing men to destroy earth, which isn't TCM  but TGM aka traditional greed medicine).\n\nthis is really one key issue... but frankly few spice trading organization have the corrones to take on ccp... \n\nFYI ccp is gearing to defeat  america aka \"el norte\", necessary step in the peaceful liberation of taiwan, to achieve a great step in the reunification...\n\nresaid, CCP is a big cartel...  The Cartel of all Cartels... the people cartel of china :).\n\nthe thing I meant to say, is that of course, the talibans are very small compared to the mighty eternal china, specially in the context of ease of transport... however rest assured, the talibans will fight, why?\n\nbecause fear everything of men, but God. meaning, there is no other fear than the fear of God... \n\nbtw what does this takbyr means? do the talibans are takbyrists or only refere in the purest form as exclusive snakbarists?\n\nfor me a positive (win-win, non extractive or mutually really beneficial), peaceful, harmonious and respecting of both ways of both side relation between afghanistan and PRC is just traditional... to be maintain and preserved, as always. your side, our side, yes yes it's very different, have a nice day if you wish to conform in the other land and may death be your only outcome if you seek to trespass, brutal.",
			"added": 1622962344
		},
		{
			"topic_id": 1622964493,
			"title": "Expand on my hate for tucker calron and sean hannity, and the failling of alex jones and on lesser measure mike adams...",
			"body": "the two first work for the msn... murdoch, at least surrendered temporarily his war against the 2ndA... but his hate for china is total... the problem he is one of the most responsible of the fall of the usa and australia... remember australia is a military dwarf to pla, on a barren land... compared to usa, even the talibans are stronger :). so tucker and hannity are both low iq trolls, one tucker in the demoralization camp while hannity just a hateful shit bags, whose feeding on his children will be fun to watch... \n\nnow jones... the problem is that this guy, I guess, didn't really believe his shit... or he is really a digital noob... never accepted btc for decades, never supported real uncensored speech, like retroshare, zn, or bitmessage... no, emails... what a sucker... I mean the guy is dumber than a rock, or pretend to be, to hide his real allegiance... furthermore his global conquest \" his 1776 worldwide\" is such hegemonic that it's doomed to fail... not even an .onion for any of his flag ship website... jones always seek to take money from his listeners, while never ever considering that if his listeners got richer, they could finance more... as illustrated by his will to not offer shares of his various LLC... stupid.\n\nmike adams problems is still a shared mindset with I start to believe with a lot of american entrepreneurs... rather than be freeing, he still seek to build corrals... again nice progression .onion... but please... email is so passe... RS, ZN, BM... I mean it was made for the liberation... but at least mike adams understand that the richer his listeners will be the higher is turnover on his various entreprises will be... \n\nthe key word for both is symbiosis... but covert... aka that the \"feds\" are even blinded to it... \n\nyou asked why the email of fauci? I would say how will they enforce their global tax, pillar2 that the 7million dollars doll spoke about? finding guests who can answer that... will be harder... old pro international accountants... currents will be way too greedy and unable to think collective to expose themselves to the exclusion of the industry... unless they understand and explain how to defeat them currently...",
			"added": 1622964489
		},
		{
			"topic_id": 1622967007,
			"title": "my message to all the people against the 2ndA in the usa...",
			"body": "opposing the secondA isn't a political opinion, it's a declaration of war.\n\nit would be a pleasure to force you by the fear of arms into the new c5  mega galaxy with a rear door, to drop you in the ocean alive... but the c17 will do...\n\nyeah, you are domestic enemies, and should be hunted down and killed, and the good news, with a little worldwide invitation new immigrants will fill your spots...\n\nyou are waste and the faster you are killed, the better it is with me...\n\ni don't even hate you, I want you dead, by the 2nd A...\n\nyou the cnners, you the unoers, you the neomarixists, you all the filths against the USC and BoR... specially the BoR... atf, fbi, cia, etc... to the oceans.... \n\na2 is unconditionnal.",
			"added": 1622967002
		},
		{
			"topic_id": 1622979864,
			"title": "The little blonde girl of foxnews fucking her collegues...",
			"body": "ahahahahahahah.... you seriously think you are serious trash whore with your 10 trillions? at least the ortegas pompeo \"b....\". let's be polite, understood...\n\nthere is no fucking way\n\nyou suck\n\nyour country sucks\n\nyour people sucks\n\nyou are weak\n\nstupid\n\nand guilible..\n\nbut that's not important...\n\ncome on...\n\ncome on... take them...\n\ntry\n\nyeah... your boy, the other foxbitchboy, he will be drafted\n\nyou count by the millions the dead waves?\n\nfor 10 10 10 10 ... ahhh finally scaling 100 100 100\n\nall\n\nvictory !\n\nagain\n\nyou fucking suckers at 100k body bags filled you will shit your pants...\n\nthat's what I say\n\nyou had the edge\n\nyou fucked it on pedo island\n\non autism\n\non depopulation\n\non outsourcing\n\non debt\n\nsplurging\n\ndebasement\n\n\nand yeah\n\nan other wannabe empire dies\n\nwhile china remains...\n\nclassic... as always\n\nnothing new under the heavens...",
			"added": 1622979858
		},
		{
			"topic_id": 1622981436,
			"title": "What can be learned from the downfall of the usa?",
			"body": "1. the potus institution is a failed concept, anti democratic, inefficient, prone to foreign penetrations, corruption, unsafe, unreliable, not representative.\n2. over extension always end up depleting the core, while the american troops were trying to catch stealth goat (I don't speak to you about the ghost goats) in afghanistan or sand camels in irak... the american ruling class was raping kids, fostering autism, dumbing down the population, playing CRT and other marxist trick, uno game play and co... \n3. debasement is for suckers... (it foster the suckers game, rather than restructuring, even ken rogoff can't admit it, but he knows)...\n4. the conquest of the world, or pretending all space of the world are american interests is madness... arrogance pure... refer to 2. \n\n\nalready there is a big list of critical mistake...\n\nyou fucked it... don't double again... you have done it enough",
			"added": 1622981429
		},
		{
			"topic_id": 1622984567,
			"title": "Nail furguson will have to admit that the us \"losership\" has surrendered the us sovereignty...",
			"body": "they prefer the uno charter and it's agenda rather than a sovereignist approach, and to foster those agendas have decided in a uniparty... afterall they are just executionners of the orders of the uno...\n\nyou want a country or your don't want one?\n\nyou want to be trapped in alliance game or go your own way?\n\nthe usc and bor or the uno charter (no speech, small are treaty etc etc etc etc etc, forced vaccination, covid pass linked to digital wallet and geofencing...) \n\na whole package...\n\nor you fucking fight this IW2 or lose for real america and it's gone and we defeat you in the ruins you will create to rebirth it in america2.0 with no more civilian potus... \n\nit's possible...\n\nyou can't have the uno charter worldwide ambitions and a free usa... \n\none must die.\n\nat least trump got this part...\n\n\"let's make the world great again\"... pure shit... most are ruined and corrupt shit holes... \n\nmake the war on plants... \n\nwake up !",
			"added": 1622984559
		}
	],
	"topic_vote": {
		"1622878208_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1622958146_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 1,
				"body": "\"The world is progressing, the future is bright and no one can change this general trend of history. We should carry on constant propaganda among the people on the facts of world progress and the bright future ahead so that they will build their confidence in victory.\"\n\n\"Weapons are an important factor in war, but not the decisive one; it is man and not materials that counts.\"\n\n\"Reading is learning, but applying is also learning and the more important kind of learning at that. Our chief method is to learn warfare through warfare. A person who has had no opportunity to go to school can also learn warfare - he can learn through fighting in war. A revolutionary war is a mass undertaking; it is often not a matter of first learning and then doing, but of doing and then learning, for doing is itself learning.\"\n\n\"A strategic plan based on the over-all situation of both belligerents is... more stable, but it too is applicable only in a given strategic stage and has to be changed when the war moves towards a new stage.... [Conversely, tactical plans may]... have to be changed several times a day.\"\n\n-- Mao Zedong",
				"added": 1622959295
			},
			{
				"comment_id": 2,
				"body": "\"We will destroy you from within.\"\n-- Khrushchev\n\n\"The first goal of propaganda is to demoralize. It’s to depress you and make you believe your civilization is lost.\"\nhttps://spectator.org/four-stages-of-marxist-takeover-the-accuracy-of-yuri-bezmenov/\n\n\"1. Demoralization - this is a process which can take about 15-30 years to perform (a generation). During this stage, the moral fibre and integrity of the country is put into question, thereby creating doubt in the minds of the people. To do so, manipulation of the media and academia is required to influence young people. As the younger generation embraces new values, such as Marxism and Leninism, the older generation slowly loses control simply through attrition. Again, true facts no longer matter during this stage, but rather creating perceptions are of paramount importance.\"\nhttps://patch.com/florida/dunedin/bp--the-four-steps-for-american-subversion-5985fc5a",
				"added": 1622959569
			},
			{
				"comment_id": 3,
				"body": "Now the big League : \n\n\"Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth.\"\nMarcus Aurelius \n\n\"Remember, gentlemen, what a Roman emperor said: The corpse of an enemy always smells sweet.\"\nNapoleon Bonaparte \n\n\"How pleasing to the wise and intelligent portion of mankind is the concord which exists among you\"\nConstantine\n\n\"I have often wondered how it is that every man loves himself more than all the rest of men, but yet sets less value on his own opinions of himself that on the opinions of others\"\nMarcus Aurelius Antonius Augustus\n\n\"Say not always what you know, but always know what you say\"\nTiberius Claudius Caesar Augustus Germanicus\n\n\"To have command is to have all the power you will ever need. To have all the power you will ever need, is to have the world in the palm of your hand.\"\nTiberius \n\n\"Young men, hear an old man to whom old men hearkened when he was young\"\nOctavius",
				"added": 1622959866
			},
			{
				"comment_id": 5,
				"body": "I am curious what stalin said on the subject... he won, from a dire situation... \"build the wall\". Da.",
				"added": 1622961095
			},
			{
				"comment_id": 6,
				"body": "myself, I would add that humility, acceptance and modesty is part of the spring back action, aka counter strike... if the enemies can't breed, there is no way to feed them their children... I know it's hardcore... but or you want to win, or your don't. you have to chose. both are exclusive of the other...",
				"added": 1622961198
			},
			{
				"comment_id": 9,
				"body": "The question is how to demoralize the enemies? as always killing the children, drone strikes on the yachts, sniping their board rooms.... that's the fun phaze ! and then not let ourselves be demoralized by their constant actions and streams of propaganda... what the american founders attempted is good, and rather than illustrate how depraved the \"leftists\" are, showing them success and transendence in the malfeasance is a way forward... :).",
				"added": 1622963622
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 4,
				"body": "regime changed or not? pedos handlers killed? vaxx nazis to the mass graves? uno take over? who knows what the future holds, but I see no temple on this hill... but a Mosk :).\n\nI just wanted to say to byby from all the censors in this world, he is the only one who had legitimate reason to do so... concerning the southern previously unwalled border... it's fine with me, as evidently it was such a critical mistake, and as it was resolved, it wasn't at least lost... \n\nIs understanding necessary to forgive? I do both, only on this issue... let's be clear.\n\nbut this event has started a chain reaction... \n\nto me finally finding peace and comfort in the will to fight of PLA... I don't care how, but this flag |(/\\⨪*) won't fall. strong or weak, many or few, demoralized or not, forward (or backward as retreat, meaning always forward... already you are lost little round eyes... isn't it?).\n\nfinally question : jail or not? \n\nand more generally  : will there be a second independence war in the usa, to wipe the uno/marxist/globalists to then attack the pedos handlers in israel? I would love it... but afterall dod isn't PLA... they are weak and lost in korea :). When a nation isn't ready for a thousand year war warm up, why even wish for the real hostilities to begins with?",
				"added": 1622960677
			}
		],
		"1622534131_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 7,
				"body": "",
				"added": 1622961537
			},
			{
				"comment_id": 8,
				"body": "I saw a documentary on the CJNG on aljazeera... \n\na few humble remarks...\n\none never trust non arabic aljazeerans... they lie, they deceit, they betray... if arabic aljazeerans says he won't betray his words, you know you can kill it and his families like a rabbit dog.\n\nthe second point and more important is imho uninformed uneducated etc... most successful real cartels relied but not depend on popular support... meaning that if a part of the cartel profits is reinvested \"in learning to fish for the locals\", meaning beyond social safety net, it makes the cartel stronger... \n\nthis is really the fine balance to find...\n\nthe problem I have with this strategy is illustrated with the fucking american native woman in oklahoma bitching about some plants in the desert... I mean she should be hunged and stomach opened. who the fuck this trash who bitch about plant and dare to say : \" i know the difference between hemp and marijuna\"? I guess the pedo bbc paid her... and should be murdered with her.\n\nmeaning that some natives have had their mind wrapped and conditionned to accept the lie that plants are evil...\n\nand finally \"spice traders\"... vertically integrated or not depending on the scale of the operations :).",
				"added": 1622961673
			}
		],
		"1622817482_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 10,
				"body": "maximalists are really dangerous I agree !!! they seek to trap us in one private currency system... I liked how $JP and $GS went full on ETH, how some are more on privacy oriented chains, how some develop other model (don't support centralized shit, just harvest)... what's cool is crypto currency speculation ! more chainz, more projects, there isn't only one moon in the universe... \n\nhow big is bch? 1 tera already? 2 ? 10?",
				"added": 1622963764
			},
			{
				"comment_id": 11,
				"body": "(elon only sells mobile cremation units :D, with only autocrash as special feature).",
				"added": 1622963781
			},
			{
				"comment_id": 14,
				"body": "ps with all his flaws (cheating on his wife, his mobile cremation units, his emf warfare space based projects, etc), he never censored anyone ! let's not forget it !!! so go elon, to the mars, make the prophecy come true, aka don't interfer :)...\n\nwhat happen with solar city? that's my real biggest question...",
				"added": 1622965621
			},
			{
				"comment_id": 15,
				"body": "and for the bimbo I had a book... something... I don't remember the author, but it's early century on why free market (regulated) rule the world... she could try to read it... it's easy... something like horowitz... along the line...  https://en.wikipedia.org/wiki/Economics_in_One_Lesson\n\n Economics in One Lesson is an introduction to free market economics written by Henry Hazlitt and first published in 1946. It is based on Frédéric Bastiat's essay Ce qu'on voit et ce qu'on ne voit pas.\n\nwhat I find funny is all the gig about the hidden hand and the arrogance of the \"massons\"... lol... they didn't get it, they aren't the hidden hand, even if they hide theirs... pretty lamely btw :)",
				"added": 1622965848
			}
		],
		"1622878208_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 12,
				"body": "that's a good project ! for the usual suspects, you missed nothing... I guess it's when obama regime went into overdrive propaganda that you left? wise choice...\n\nwhat can I say to you about the current state of the msn? they will eat their children once defeated, that's how I see their future... aka they will all be killed, from janitors, to editors, to those controlling them at the cia, state departement, fbi, and included wh... the second Independence war is necessary !",
				"added": 1622963901
			},
			{
				"comment_id": 13,
				"body": "a question : do you still read news? do you still inform yourself of local regulations?",
				"added": 1622964548
			},
			{
				"comment_id": 27,
				"body": "finally I think I join too... I may report progress... they are so dumb on those tvs... so dangerous... so perfid... I hope they all get slaughtered.",
				"added": 1622980419
			}
		],
		"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 16,
				"body": "so smile and enjoy your last moment on earth, we will come to kill you : we the people...",
				"added": 1622967022
			},
			{
				"comment_id": 18,
				"body": "accepted :) as said, PLA won't disarm, small or mad ones...",
				"added": 1622967084
			},
			{
				"comment_id": 19,
				"body": "china's sovereignty is a NLEE... no limit eternal endeavor... govs and dynasties come and go, the goal remain, you, foreigners, won't rule china for long... even if you succeeded in the first place (which I always doubt, remember gaining a few mus isn't enough to defeat we the people :D).",
				"added": 1622967181
			}
		],
		"1622979864_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 20,
				"body": "what do they put in the air (maybe) to make them so dumb? oxytocin? that's the name right? in vape ? hehehe...\n\nthey are so low iq, 0 will, little parrots trying to make mean look\n\npffff...\n\na nigga in the street and they already change sidewalk...\n\nlame lame lame lame",
				"added": 1622979939
			},
			{
				"comment_id": 21,
				"body": "and I can't imagine the dumb fuck in before tv believing this crap... like maga, america powa... pfffff....\n\nthe rentier class of the pentagram... they want their pension, not suicide mission...\n\nmurdoch still doesn't get it...\n\nhis sons... to the draft my boy\n\nwhat do you think?\n\nwe cannon feeder... go go go...\n\nshow the murdoch line\n\npfff...\n\nthe house of murdoch\n\nbunch of sucker\n\nyou lost\n\nyou played\n\nyou got fucked\n\nnot the bills come due...\n\nbring in...",
				"added": 1622980043
			},
			{
				"comment_id": 22,
				"body": "restructure, back to basis, and replay again in 200 300 maybe more years... you fucked up... that's it...\n\nlook at SU... collapsed back !\n\nwhy?\n\nbecause the first to restructure have the edge... they knew it.... \n\nbooffooons.",
				"added": 1622980159
			},
			{
				"comment_id": 23,
				"body": "go watch supremacist nfl... ahh they wear helmet for rugby... the super warrior class... ayayay... good luck catching an afghan goat with an helmet, body chest, knee pad and all your stuff... good luck... take water :).",
				"added": 1622980211
			},
			{
				"comment_id": 24,
				"body": "and it comes from the lie... SU won WW2.",
				"added": 1622980236
			},
			{
				"comment_id": 25,
				"body": "not you...",
				"added": 1622980241
			},
			{
				"comment_id": 26,
				"body": "ps we ain't interessted in another ww in europe, at least we the people... we did ww1, ww2... cold war... that's enough we have given our fair share to war... let's make your continent a giant battleground... have fun enjoy... make movies... do you want... but I don't think even heavy skilled propaganda can convince europeons to die again the front line of rich men wars... china did nothing to us. we sucked. moving on.",
				"added": 1622980348
			}
		],
		"1622981436_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 28,
				"body": "if china doesn't move, aka wait for your internal destruction it wins doing nothing, if you move since korea, you lose... that's win win or prefect positionning... what do you expect from the country of kung fu? a lack of patience? they have eternity... that's what you don't get...",
				"added": 1622981543
			},
			{
				"comment_id": 29,
				"body": "even the elephants are touring new china... what can I say?",
				"added": 1622981603
			}
		],
		"1622962347_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 30,
				"body": "> [ped0filehunter](#comment_1_1BThAqtg4aJUQzCGGqVKzM4mi4yQwK3KyH): Stuff Off u BrOther\n\nI could mute you, but prefer to smash the little piano player from kabul... this batcha boy better care of the goat he will be less gay...\n\nthe thing is that if all afghan boys became gay like him, afghanistan would have fallen at the phone call...",
				"added": 1622981708
			},
			{
				"comment_id": 31,
				"body": "when will the phone call of pedobush with the talibans be released regarding UBL surrender? epic...",
				"added": 1622981756
			},
			{
				"comment_id": 32,
				"body": "or was it a lie too? wtc7...",
				"added": 1622981767
			},
			{
				"comment_id": 33,
				"body": "pedocic : give us ubl\ntalibans : no\nwh : !?!\n\nlol... \n\nbut I guess it was a lie too part of the narrative to get monoes to the war against people that had done nothing to them, what so ever.",
				"added": 1622981856
			}
		],
		"1622996253_1PYse2fs94EphqFApJnUCBPa4wMNTvTddn": [
			{
				"comment_id": 34,
				"body": "okay... involuntary self nuking... how tragic... at least it wasn't a CME...",
				"added": 1623006176
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 35,
				"body": "they test before injecting if people had it or not (duhh) and it's not mandatory, on the side, it's a individual decision... more risk from it or not... (vaxx or natural infection) etc... and who knows how the russian vaxx works...\n\nnow it's not the point...\n\nGlory to Yeltsin... Hero of Mankind, in all his failing, the SU MAD progams restructuring went flawlessly... speechless, but worthy comment never heard... So SU felt, and no MAD problems. Yuri level... (gargarin)... even way bigger... the non event achievement... most don't see... nor can even imagine. he saved and those in the end of SU saved the world.",
				"added": 1623007014
			},
			{
				"comment_id": 36,
				"body": "> [fox20012](#comment_5_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8): ... and yet they are in the vaccine business too....\n\nbtw cheap change... you don't understand the \"green suit\"... no idea isn't it? ask the saudis...",
				"added": 1623007056
			},
			{
				"comment_id": 37,
				"body": "historical question, how did the soviet leadership reacted when they learned the american losership had started a demographic reduction campaign against the world?",
				"added": 1623007163
			},
			{
				"comment_id": 38,
				"body": "btw for the \"westerners\" reading this question, it's why your kids are doomed... sorry. it's just warfare, and you started it...",
				"added": 1623007282
			}
		]
	},
	"comment_vote": {}
}