{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1516748111_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "Gif / short mp4 support !",
				"added": 1516778405
			}
		],
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 2,
				"body": "A proper _working_ lean reddit clone",
				"added": 1516779785
			},
			{
				"comment_id": 3,
				"body": "> subreddits (this is optional as you can have as many zerotalks as you want, if you just clone it)\n\nThe problem is that if they are all scattered around in different clones, the various communities will be scattered as well, where reddit wins is that there's a subreddit pretty much for everything/everyone on the same location and browsing between subreddits is dead easy and that's I think the recipe we might want to clone in this case, not scatter stuff around for the sake of it.\n\n> I think forking zerotalk would be a good starting place. (its pretty and consistent design wise with other apps)\n\nWhats missing the most (in my view):\n\n    replies under each message\n    sorting replies by upvotes\n    sorting in the main window by upvotes + time decay\n\nGood starting point(s) indeed !\n\n> If someone wants to clone the github repo I can work on that as well\n\nI'm really not a WebDev although I know a bit of HTML/CSS but I will be happy to test/debug :)\n\n> If someone wants to clone the github repo I can work on that as well, as soon as I figure out how not to doxx myself immediately by commiting code.\n\nIsolate your identities fully if possible (GitHub acc, SSH keys, ...), perhaps work from a Virtual Machine ?",
				"added": 1516781517
			}
		],
		"1517087760_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 7,
				"body": "Something bizarre, when I visit ZeroHive through the link in the thread, all fine but going back to ZeroHello, the ZeroHive connected site becomes a link to ZeroTalk",
				"added": 1517092384
			},
			{
				"comment_id": 8,
				"body": "> [mnemonic](#comment_22_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): Thanks for testing it, I'll be playing with it tomorrow.If you can spot my mistake in the code, let me know: https://github.com/DataCourier/ZeroTalk/tree/feat-reddit-like\n\nIt was cool, one step at a time and it may evolve nicely !",
				"added": 1517093091
			}
		],
		"1517072402_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 5,
				"body": "I've (personally) not much real use for it but I find the idea of having a web browser helper really cool, kudos to you for developing it ! I took a look at the code and it looks very sane.\n\nNow if it could notify me of any news In my feed in ZeroHello using notifications bubbles, I would install it in a heartbeat :)",
				"added": 1517091862
			}
		]
	},
	"comment_vote": {
		"5_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1,
		"1_16GUvkoVwUVDDUsbPWkkSxpq2ikmK9bd6E": 1,
		"4_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"22_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1
	}
}