{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Гид по сайтам",
			"body": "Yet another каталог сайтов. Скидывайте полезную ссылкоту в комментарии, буду добавлять в шапку. \n---\n\n####Видео\n1. Zeroplay (кино и немного сериалы/ENG)\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n2. Play Anime (то же самое, но для аниме/ENG)\nhttp://127.0.0.1:43110/1AnimePihDhcbVdK1nvnbSEtH4oKU8RAYG/\n3. Zero TV (сериалы, достаточно много/ENG)\nhttp://127.0.0.1:43110/1HwH4hfRhohJGVtZMBYprYKyHcuJNwL4sZ/\n4. Kopy Kate (что-то вроде ютуба, умеет в стриминг)\nhttp://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN\n\n####Софт\n1. Официальные образы MSDN (не обращайте внимание на красный текст)\nhttp://127.0.0.1:43110/1AJB5rtjfB9imjDGVk5vtRtZp3zgYizbpG/index.html\n\n####Изображения\n1. Picrandom. Название говорит за себя\nhttp://127.0.0.1:43110/picrandom.bit/\n2. GIF Time. Аналогично\nhttp://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h\n\n####Торрент-трекеры\n1. Зеркало торрент-трекера Kickass\nhttp://127.0.0.1:43110/1LBr1dHoXvJAMjDgW8Wcg5kbCoKyJnzo6p/\n2. ZeroTorrent. Местный торрент-трекер, что-то да можно найти\nhttp://127.0.0.1:43110/ZeroTorrent.bit\n\n####Другое\n1. Zirch. Автоматически заполняемый поисковик, ищет не только в названии, но и в содержании.\nhttp://127.0.0.1:43110/zirch.bit\n2. Kaffiene. Поисковик, вроде как самая большая база сайтов. Ищет по заголовкам\nhttp://127.0.0.1:43110/kaffiene.bit/",
			"added": 1504835530
		}
	],
	"topic_vote": {
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1
	},
	"next_comment_id": 31,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+",
				"added": 1504833945
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 2,
				"body": "Ребят, я нубье тут, с чего начинать? По идее нужен поисковик какой, но я его не нахожу",
				"added": 1504834005
			},
			{
				"comment_id": 29,
				"body": "> [mewmewpower](#comment_37_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Нах тебе поисковик? На стартовой странице есть ссылка на каталог и на форум, там все лекго ищеться\n\nДык епта, чтоб искать по содержимому сайтов",
				"added": 1505542974
			},
			{
				"comment_id": 30,
				"body": "> [mewmewpower](#comment_37_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Нах тебе поисковик? На стартовой странице есть ссылка на каталог и на форум, там все лекго ищеться\n\nДык епта, чтоб искать по содержимому сайтов",
				"added": 1505543870
			}
		],
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": [
			{
				"comment_id": 3,
				"body": "> [bcash](#comment_1_15NgmXm8eGd5fH54S4JJnPsBaKHXusjjqG): http://127.0.0.1:43110/1AnimePihDhcbVdK1nvnbSEtH4oKU8RAYG/\n\nДобавлено",
				"added": 1504871392
			},
			{
				"comment_id": 4,
				"body": "> [gomzik](#comment_88_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): http://localhost:43110/1JMNrd9FD19AhWVukYJ2gdxAiK2ohczwk5/\n> Я в процессе разработки что-то похожего Google Play Music для зеронета. Это еще совсем совсем начало, но я планирую допилить\n\nОно доступно? У меня выдает Not Found",
				"added": 1504872843
			},
			{
				"comment_id": 5,
				"body": "> [gomzik](#comment_89_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Моя статистика показывает 26 пиров. Попробую переподписать и опубликовать\n\nУже работает. Ну, то бишь, открывается. Как только будет более-менее юзабельно -- дай знать, поместим в шапку",
				"added": 1504873361
			},
			{
				"comment_id": 6,
				"body": "> [gomzik](#comment_90_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ну я в свободное время этим занимаюсь, поэтому медленно это все пока\n> Должно проигрывать вшитый трек, а так же переходить между вкладками\n\nВшитый трек не играет, ругается на неподдерживаемый формат. А вкладки переходит, да",
				"added": 1504873461
			},
			{
				"comment_id": 7,
				"body": "> [gomzik](#comment_91_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): браузер и ось?\n\nFirefox 55, Win7 64x",
				"added": 1504873618
			},
			{
				"comment_id": 8,
				"body": "> [gomzik](#comment_92_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): хм. На линухах мне нужно было доставить дополнительные кодеки для фаерфокса. Однако все работало в хроме из коробки. Сейчас пересел на мак и в сафари тоже не работает из коробки. Возможно дело именно в формате дорожки, я так понимаю придется конвертировать музыку так, чтобы она работала в разных браузерах. Так как в зеронет у нас нет бекенда, я пока не представляю, как это сделать.\n\nА что за формат такой?",
				"added": 1504875307
			},
			{
				"comment_id": 9,
				"body": "> [gomzik](#comment_93_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Сейчас там два формата, обычный mp3 и какой-то ogg (не успел хорошенько познать этот формат, есть различия и видимо не каждый браузер поддерживает тот, который у меня вышел), пробует воспроизводить первый из тех, какой подходит\n\nПо идее ogg открытый формат и должен спокойно везде проигрываться. MP3 закрытый, но распространенный, тоже должен проигрываться. Хм.",
				"added": 1504877323
			},
			{
				"comment_id": 10,
				"body": "> [gomzik](#comment_94_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): тем не менее, не так\n\nГм. А как ты проигрываешь аудио? Может дело в этом?",
				"added": 1504907140
			},
			{
				"comment_id": 11,
				"body": "> [bplohish](#comment_13_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Этот топик надо закрепить в шапке форума , как  гида для вновь прибывших. ;-)\n\nКому стучать для этого?",
				"added": 1504957099
			},
			{
				"comment_id": 13,
				"body": "> [bplohish](#comment_14_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Наверное сюда:http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/;-)\n\nНаписал. Посмотрим.",
				"added": 1504958760
			},
			{
				"comment_id": 14,
				"body": "> [bplohish](#comment_15_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): http://127.0.0.1:43110/kaffiene.bit/   ->  ZeroMe Users  -> shift\n\nЕму писать?",
				"added": 1504960887
			},
			{
				"comment_id": 16,
				"body": "> [gomzik](#comment_95_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): HTML5 Audio API\n\nЯ тут кое-что нашел. И там аудио проигрывается. Может поможет\nhttp://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q/",
				"added": 1504990289
			},
			{
				"comment_id": 20,
				"body": "> [bplohish](#comment_17_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Здесь можно подсмотреть как Wiki сделатьhttp://127.0.0.1:43110/13MRyYzXdjCpz7b1WgSdvvPfyGx66z3RJY\n\nА стандартный медиавики тут не заводится?",
				"added": 1505012807
			},
			{
				"comment_id": 22,
				"body": "> [bplohish](#comment_18_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): \"ZeroNet позволяет создавать как статичные, так и сайты с динамическим контентом.\n> Тем не менее технология ZeroNet исключает возможность использования языков сценариев таких как PHP или Ruby. Вы можете реализовывать динамичность за счет API, встроенного ZeroNet и называемого ZeroFrame, скпритов JavaScript (или CoffeeScript) и встроенной базы данных SQL.\"\n\nГмм, печально, печально. А я так хотел питонокодить.",
				"added": 1505081191
			},
			{
				"comment_id": 23,
				"body": "> [bplohish](#comment_20_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): А что мешает \"питонокодить\"? Для питонщика в ZeroNet есть куда руки приложить. В данный момент отсутствуют: DHT,  Ipv6,  поисковик, web конструктор, графический парсер для агрегации новостных ресурсов .\n\nЭм, разве поддеживается создание сайтов на питоне? Один жс же можно было",
				"added": 1505145127
			},
			{
				"comment_id": 24,
				"body": "> [gomzik](#comment_97_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): сам ZeroNet написан на питоне и там есть еще много того, что можно было бы доделать. Это и имеется ввиду\n\nОно и ясно, но я не настолько крут в программировании, чтобы переделывать ядро. Да и всегда найдется кому это переделать — лично мне гораздо важнее наполнить всё это дело контентом, а то смысл?",
				"added": 1505148602
			},
			{
				"comment_id": 25,
				"body": "> [balancer73](#comment_169_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ну, в принципе, наверное, можно что-то типа:\n> \n> http://www.transcrypt.org/\n> http://www.skulpt.org/\n> \n> (наверняка и ещё варианты есть :) )\n\nКостыль, канеш, но надо попробовать на досуге. Жаль, что нативной реализации нет. А предвидится хоть?",
				"added": 1505149524
			},
			{
				"comment_id": 26,
				"body": "> [gomzik](#comment_98_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Тут система такая, весь бекенд который есть - апи самого зеронета, запускать код вне браузерной песочницы никто не даст по соображениям безопасности. Разве что остается делать какие-нибудь скрипты, которые генерят статический html и публикуют в зеронет, что такое себе конечно, но если очень хочется, то можно :) Ну и очевидно, скрипты запускать будете вы сами\n\nГм, печально, печально.",
				"added": 1505150228
			}
		],
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 12,
				"body": "Тут мне говорят, что эту(http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky) тему следует закрепить в шапку. Как вы к этому относитесь?",
				"added": 1504958710
			},
			{
				"comment_id": 15,
				"body": "А вообще, сделайте форматирование текста не только в шапке, но и в комментариях. Еще приделайте возможность видеть, кто последним отписался в тред, а то на том месте сейчас находится название автор треда и это несколько контринтуитивно. Плюс лучше бы ответам к комментарию располагаться не через цитирование, а в форме ветки. И еще ночную тему, плез, слепит сильно.",
				"added": 1504968047
			},
			{
				"comment_id": 21,
				"body": "> [bplohish](#comment_19_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): С лопаты пользоваться будет неудобно >:-[\n> https://play.google.com/store/apps/details?id=net.mkg20001.zeronet&hl=ru\n\nНу для лопаты можно оставить как есть.",
				"added": 1505048935
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 17,
				"body": "Эх, ребят. Контента тут нет, а вам бы технические подробности ресурса пообсуждать.",
				"added": 1504997553
			},
			{
				"comment_id": 18,
				"body": "> [balancer73](#comment_164_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В ZeroNet? Контент есть. Хотя эта оценка релативна, конечно :D И, очевидно, что тут народ пасётся технически ориентированный. Поэтому и темы соответствующие. Ну, вот, начну я тут обсуждать авиацию, астрофото, свои дела семейные — кто диалог поддержит? Да никто. Это никому не интересно. Если уж даже обсуждение фантастики или кино тут никак не стартует... Так что — только технические подробности :)\n\nКонтента тут своего нет. Есть пизженное кино, есть пизженные сериалы, есть пизженное аниме. Из собственного контента только пара бложиков и зеровики. Вы ж народ технически ориентированный, об этом можно писать сколько влезет, весь Хабр этим занимается, так почему бы не тут? Я вот тоже бложег завел, иногда буду переводить и писать тексты собственного сочинения. \n\nА тем для обсуждения более чем достаточно, думаю. В тех же линуксоконфах спокойно обсуждают железо, аниме, смартфоны и софт на них, музыку, иногда игры и кино, студенческие будни и психические заболевания, в конце-концов. Народ-то технически ориентированный. \n\nДа только людей мало, особенно в русском сегменте. Поэтому и говорится только о техническом, чтоб по делу и всем интересно. И это печально.",
				"added": 1505007140
			},
			{
				"comment_id": 19,
				"body": "> [bplohish](#comment_16_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Посто проект еще очень молодой и очень спицефический. Большенство сюда пришло попробоваф силы в создании  mеsh сетей и поняв что привычные инструменты там работают плохо.Вот тебе еще в ссылка в копилку:http://127.0.0.1:43110/1DwJMuuV8rzbktXrN1j8oimJWHN6kDywZLhttp://heeg.ru/heeg4.1.ziphttps://youtu.be/ZG4RqI12Ym0\n\nНу, лично я технологически подкован на уровне продвинутого юзера, а сюда пришел за органичным компромиссом между приватностью и удобством. Думаю, это многим не помешает. Нельзя же держать сеть вечно технически ориентированной, надо зазывать людей.\n\ninb4: я уже сказал об этом парочке знакомых, возможно скоро запилю пост.",
				"added": 1505011041
			}
		],
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 27,
				"body": "Сап",
				"added": 1505402643
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 28,
				"body": "Уже третий год как. Защищен он так себе в обычной перепиське (а на пеку еще скрытночаты не завезли), но удобен даже слишком. \n\nА за tox этот поясните, в чём плюсы, минусы, подводные?",
				"added": 1505402714
			}
		]
	},
	"comment_vote": {
		"1_15NgmXm8eGd5fH54S4JJnPsBaKHXusjjqG": 1
	}
}