{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "MAI 68 = révolution JUIVE, pourquoi personne n'ose le dire ?",
			"body": "Devoir de mémoire (le vrai), 50 ans après.\nCeci n'est pas une liste détaillée des intellectuels et activistes ayant mené à ce mouvement, cela serait fastidieux et aurait un air de mauvais remake de la liste de Schindler. Je vais simplement citer quelques propos, pour en venir au mondialisme actuel.\n\nDans un monde normal, réellement libre, et émancipé de la domination oligarchique, tout un chacun pourrait dire sans aucune crainte et sans être contredit que Mai 68 a été une révolution judaïque, sur la forme et le fond. Il suffit d'un minimum de culture sur le sujet.\nDes historiens et intellectuels juifs le revendiquent, l'écrivent par-ci par-là, et le fait historique est là, mais une chape de plomb de terreur et/ou d'inculture règne sur cette question. Il faut que cela reste assez \"secret\" pour le grand public. Comme si des gens avaient quelque chose à cacher.\n\nExemple photographique. Mai 68 c'était ça :  http://www.noelshack.com/2018-18-7-1525601980-mai-68.jpg De gauche à droite : Ernest Mandel, Daniel Cohn-Bendit, Henri Weber, Daniel Bensaïd - deux qui semblent être Alain Geismar et Benny Lévy, sans certitude - et Alain Krivine. Tous issu du même peuple dispersé ...\n\nL'historien et universitaire israélien Yaïr Auron  http://www.noelshack.com/2018-18-7-1525602953-arton2666-690x480.jpg https://en.wikipedia.org/wiki/Yair_Auron a écrit un livre intitulé Les Juifs d’extrême gauche en mai 1968, publié pour le trentième anniversaire des “événements”, on y lit : \"Sur les “quatre grands” de mai 68, Daniel Cohn-Bendit, Alain Krivine, Alain Geismar, Jacques Sauvageot, les trois premiers sont juifs.\" http://herveryssen.hautetfort.com/mai-68-le-messianisme-juif-dans-la-rue.html\n\nCitons Benoît Rayski http://www.noelshack.com/2018-18-7-1525601652-6d4cb58238cbfb17455e5d0f859905ad.jpg d'abord communiste, puis de gauche libérale chez Globe (le temple de l'immigrationnisme et l'antiracisme des années 1980), et enfin néoconservateur sioniste chez Causeur (trajectoire communautaire typique : de la révolution au choc des civilisations ...), dans la revue juive Passages :\n\n\"Il y eut, en mai 68, des cohortes compactes de juifs, tous engagés, au sommet ou à la base, dans les partis, mouvements et groupuscules qui constituèrent le fer de lance de cet événement insurrectionnel… Ils y occupaient une place majeure, parfaitement hors de proportion avec le nombre de juifs en France… Tous, ou presque venaient d’un milieu géographiquement très défini : l’Europe centrale ou l’Europe de l’Est. Tous ou presque sortaient de familles qui avaient sacrifié aux idéologies révolutionnaires du XXe siècle : bolchevisme, communisme, trotskisme, bundisme, anarchisme… On y trouvait pêle-mêle les martyrs de l’Affiche rouge, les juifs du Komintern, inlassables commis voyageurs de la révolution mondiale, les dirigeants juifs et communistes des Brigades internationales, les jeunes insurgés du ghetto de Varsovie, etc.\"\n\nDaniel Cohn-Bendit, le célèbre meneur qu'on ne présente plus. http://www.noelshack.com/2017-42-4-1508399795-cohnbendit.jpg http://www.noelshack.com/2017-42-4-1508401971-cohnmacron.jpeg http://www.noelshack.com/2017-42-4-1508399780-cohnbenditmacro.jpg  http://www.noelshack.com/2017-42-4-1508399817-macroncohn.jpeg\n\"Les Juifs représentaient une majorité non négligeable, si ce n’est la grande majorité des militants.\" - Le Grand Bazar\n\"Je ne veux pas être réduit à une identité nationale, quelle qu'elle soit. En même temps, je suis issu de la diaspora juive. Mon combat pour une Europe transnationale a peut-être un rapport avec cela. Je veux clarifier ce lien. Pendant longtemps, je me suis contenté, quand on m'interrogeait, de dire que j'étais un juif sartrien, c'est-à-dire que j'étais juif du fait du regard conféré par d'autres. C'était un tour de passe-passe trop facile. \" (L'Express)\n\"J’aimerais bien écrire un bouquin sur l’identité juive – pas l’identité juive en général, mais la mienne.\"\n\"Longtemps, je me suis considéré comme un « juif sartrien » : « Ce sont les autres qui me font juif ». Mais en fait, c’est faux… Je suis un Juif de la diaspora. Donc une citoyenneté universelle, sans frontière, ce qui explique mon positionnement européen.\" (Le Soir)\n\nRaphaël Glucksmann  http://www.noelshack.com/2018-18-7-1525616548-68649.jpg fils de feu André Glucksmann  http://www.noelshack.com/2018-18-7-1525601454-glucksmann-levy-1.jpg le célèbre 68ard devenu ensuite atlantiste (logique) :\n\"Les communautés nationales, ethniques ou religieuses allaient se dissoudre dans une acculturation planétaire émancipatrice, les individus se débarrasseraient des contraintes et des carcans, des églises et des partis, du temps et de l’espace, pour former une société globale libre et pacifiée.\" (Manuel de lutte contre les réacs, Allary Éditions, 2015)\nSur Mai 68 : \"sans son slogan le plus fou, “nous sommes tous des juifs allemands !”, jamais [Nicolas Sarközy] n’aurait pu être président de la République. 68 est une assomption du déracinement qui a donné la société “black-blanc beur”, multiculturelle et ouverte dans laquelle nous vivons. Qu’est-ce qui symbolise mieux l’abolition des frontières et la perte des repères que le juif errant ?\" (Le Point, 7 février 2008)\n\nTout cela renvoie à leur messianisme.\n\nDaniel Bensaïd  http://www.noelshack.com/2018-18-7-1525600275-31776182-394019354446922-5993308076210388992-n.jpg (à droite), alors un des meneurs de Mai 68 en tant que chef de la Ligue Communiste Révolutionnaire aux côtés d'Alain Krivine, écrivait :\n\n\"Le messianisme est une ferveur de l'attente. Il s'affirme contre l'attente des catastrophes historiques que les prophètes exhortent à conjurer, selon la profonde dialectique du désastre et de l'espérance. A la différence du pessimisme apocalyptique, qui se repaît du châtiment, il stimule un optimisme de la volonté. Avide d'un âge nouveau, l'attente messianique ébauche ainsi un projet politique qui se laisse aller à rêver d'une conquête sans bataille. Prélude pacifique à la guerre messianique proprement dite, l'aspiration révolutionnaire secrète reste alors inextricablement lié à une conception traditionnelle de la vie juive.\" ... \"tout Juif est tenu de devenir marrane.\" - Essai de taupologie générale\n\n(Le marranes étaient ces juifs d'Espagne faussement convertis au catholicisme. Plus généralement cela signifie un juif qui masque son espérance juive, qui la rend secrète.)\n\nLe \"secret\" est très présent chez ces gens.\nBernard-Henri Lévy http://www.noelshack.com/2018-18-7-1525602431-bhl-b-nai-b-rith-mpi.jpg  http://www.noelshack.com/2018-18-7-1525602748-59708ea409fac254378b4567.jpg\n\"Et j’ai l’impression que ce que j’ai à faire en Europe n’a pas été fait encore. Et vous savez que je défend l’idée d’un judaïsme qui participe certes de la rédemption du peuple juif mais aussi de celle des nations, qui y œuvre en secret le plus souvent, je crois beaucoup à ça.\" (Fréquence Tel Aviv)\n\"Je suis juif, je le suis par toutes mes fibres. Je le suis par mes lapsus. Je le suis par les règles alimentaires que je me suis moi-même imposées... Je le suis par ma façon d'écrire... Je suis juif par ce pacte invisible qui me relie aux Juifs du monde entier... Je suis juif par ma patience messianique.\" (Récidives)\n\nEn dernière instance, le projet est très clair.\n\nHenri Delassus http://www.noelshack.com/2016-52-1483187017-mgr-delassus-1836-1921.jpg annonçait tout dans son livre de 1910 La Conjuration Antichrétienne, ou le Temple Maçonnique voulant s'élever sur les ruines de l'Eglise Catholique (1300 pages pour l'édition originale, 800 pages serrées pour la réédition), salué par le pape Saint Pie X.\n\"Il n'a eu de cesse de dénoncer les prémisses du mondialisme et l'ébauche d'un gouvernement mondial.\" https://fr.wikipedia.org/wiki/Henri_Delassus\n\n\"Sous nos yeux, d'un bout à l'autre de la Terre, le monde politique, le monde économique et commercial, conduit ou entraîné par les sociétés du monde occulte dont les juifs sont les princes, se sont mis à brasser à la fois de toutes parts et avec une inlassable ardeur, la grande unité cosmopolite. Ainsi, se nomme, dans le langage du jour, le système d'où sortirait l'abolition de toutes frontières, de toutes patries, ou, si l'on veut, le remplacement de la patrie particulière de chaque peuple par une grande et universelle patrie qui serait celle de tous les hommes.\"\n\n\"Il détruit pour détruire, par haine de ce qui existe, mais aussi dans l'espoir d'édifier sur ces ruines le Temple que nous avons dit : la Jérusalem de nouvel ordre, assise entre l'Orient et l'Occident, c'est à dire la République universelle et la religion humanitaire dont il veut être le pontife et le souverain.\"\n\"La Jérusalem, qui doit se substituer à la cité des Césars, c'est, nous l'avons vu dans les chapitres précédents, la République Universelle. La Jérusalem de nouvel ordre qui doit se substituer à la cité des Papes, c'est le messianisme des nouveaux jours que nous avons maintenant à étudier. Telles sont des deux nefs du Temple que le Pouvoir occulte construit par l'action combinée des Juifs et des maçons ...\"\n\n\"Devons-nous redouter de voir leur rêve se réaliser ? La tradition chrétienne nous parle de l'Antéchrist et lui donne les mêmes caractères que les juifs donnent à leur Messie ... \"\n\nRien n'a changé ...\nhttp://www.noelshack.com/2017-42-4-1508401891-attali-et-5-presidents-francais-etat-profond.jpg  http://www.noelshack.com/2017-03-1484921188-4988463-6-8f6c-2016-08-24-8208f94-2016082745-0-1793732164attali-497629e5a46f7dc25c2b48fd70e35934.jpg http://www.noelshack.com/2017-03-1484921361-macron-attali-2007-rea.jpg  http://www.noelshack.com/2017-18-1493820896-attali-macron-d08334-0-1x.jpeg\n\"Après bien des désordres, voire d'épouvantables désastres, la planète deviendra une entité unique, sans frontières, les hommes y seront à la fois sédentaires et nomades, jouissant de droits et assumant des devoirs d'un genre nouveau : une démocratie universelle au service du bien commun de l'humanité.\" (L'Homme nomade)\n\"Donc cela renvoie à la responsabilité de la condition humaine, et en avant garde de la condition humaine la responsabilité juive. Nous sommes seuls. Et Auschwitz nous l'a répété, pour tous ceux qui ne voulaient pas entendre. Nous sommes seuls. La réparation du monde c'est nous, et personne d'autre ... Je pense que cette mission renvoie fondamentalement à l'attente juive, nous sommes là pour réparer le monde.\"\n\nSPOILhttps://youtu.be/an8E0W5iqXA \n\"c'est une ville qui soit en quelque sorte la capitale planétaire d'un univers, on peut imaginer un gouvernement mondial à Jérusalem... Dans la tradition juive on dit beaucoup que la paix à Jérusalem est la condition de la venue du Messie, le Messie arrivera par une certaine porte de la vieille ville, pour que la paix soit faite ... Donc véritablement il y a une dimension en quelque sorte utopiste, messianique ou utopiste, de Jérusalem comme lieu de la paix... On peut imaginer, rêver, d'un Jérusalem devenant capitale de la planète, qui sera un jour unifié autour d'un gouvernement mondial. C'est un joli lieu pour un gouvernement mondial.\" https://youtu.be/wr_yHoUTMEo\nPour avoir une vision globale et structurée de l'épopée judéo-maçonnique sous laquelle nous vivons, il faut lire.",
			"added": 1525704627
		},
		{
			"topic_id": 2,
			"title": "Adobe CC 2019 + Office 2019",
			"body": "Je vous partage les dernières versions de ces deux logiciels.\nAdobe CC 2019:\nhttps://anonymz.com/?https://drive.google.com/drive/folders/1nG5E7KgHpw_BLLjNj84pCQd0TPKmrb1g?usp=sharing\nMicrosoft Office 2019: \nhttps://anonymz.com/?https://drive.google.com/file/d/12HUrCv_HHtscxFh1n4YEWO33NBfYW9qJ/view?usp=sharing\n",
			"added": 1540556844
		}
	],
	"topic_vote": {
		"1_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": 1,
		"2_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": [
			{
				"comment_id": 1,
				"body": "N’hésiter pas à faire un tour sur mon zite:\nhttp://127.0.0.1:43110/1JzyzUMVWzdAXM3W4oG2XgDU4A7fGcZLic/\nPleins de nouveau logiciels sont ajouté tout les jours",
				"added": 1540556936
			},
			{
				"comment_id": 2,
				"body": "Adobe Character Animator CC 2019 ajouté !",
				"added": 1540835100
			},
			{
				"comment_id": 3,
				"body": "Adobe After Effects CC 2019 et Adobe Bridge CC 2019 tout juste uploadé !\n+Lien web classique:\n    https://telegra.ph/Adobe-CC-2019--Microsoft-Office-2019-11-05\n\n",
				"added": 1541447515
			}
		]
	},
	"comment_vote": {
		"1_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": 1,
		"3_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": 1
	}
}