{
	"next_comment_id": 15,
	"comment": [
		{
			"comment_id": 1,
			"body": "на самом деле, хотя бы браузерный вариант был бы не лишним, в виде push уведомлений. Естественно с возможностью отключения оного.",
			"post_id": 26,
			"date_added": 1484829633
		},
		{
			"comment_id": 2,
			"body": "А его как-то юстировать надо?\n",
			"post_id": 29,
			"date_added": 1484921230
		},
		{
			"comment_id": 3,
			"body": "Хм, если под CloudAtCos понимается http://www.cloudatcost.com/ то таких цен у них нет\n",
			"post_id": 30,
			"date_added": 1485359943
		},
		{
			"comment_id": 4,
			"body": "Нда, emoji тут не работают... \n\nгут",
			"post_id": 32,
			"date_added": 1485630447
		},
		{
			"comment_id": 5,
			"body": "> [dmi](#comment_5_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7):\n\n> DRBD.  Синхронная репликация. Любая БД ее нормально переносит и не разваливается. Плюс бит-карта для нагона. Работает как часы - мы на этой штуке https://sci.skycover.ru/projects/sci-cd/ не только MySQL, но и Оракл гоняем :) Но в пределах ДЦ или серверной.\n\nа эта штуковина может PostgreSQL?\n",
			"post_id": 31,
			"date_added": 1487147563
		},
		{
			"comment_id": 6,
			"body": "> [dmi](#comment_2_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Ну, по идее, если на каждый топик, например, автоматом создавать зайт, а на \"центральном\" зайте это все только мержить, то по объему и по продвижению наиболее интересного контента будет достаточно оптимально.Только надо еще присобачить механизм типа лайка, что если флажок выставил, то сайт/сегмент не удалится. А остальное чистить время от времени по плохому настроению.\n> Таблицы трекера будут адового размера кстати. Но тут не деться никуда.\n> Второй момент - это апдейты. Вообще говоря, сидам, которые уже имеют копию, надо не полное обновление гнать, а git diff. По быдляцки это решается гитом. Достаточно запросить у приемника текущую версию и выдать ему дифф до последнего состояния.За одно и версионность из коробки - даже если ты все потрешь, у меня останется гит.\n> Третий момент - это бинарники большого объема надо форсить в опциональные.Это, кстати, и сейчас можно делать, только не по размеру, а по маске. Где-то в config.json задается, если я правильно понял... у них английский какой-то сложный :)\n\nинтересная мысль. \n\n",
			"post_id": 25,
			"date_added": 1487147723
		},
		{
			"comment_id": 7,
			"body": "Ну так это ж хорошо. Если б на головы все это рухнуло?\n",
			"post_id": 38,
			"date_added": 1487668022
		},
		{
			"comment_id": 8,
			"body": "> [mist](#comment_2_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): В перспективе IPFS лучше для хранения файлов.\n\nчем?",
			"post_id": 35,
			"date_added": 1487848033
		},
		{
			"comment_id": 9,
			"body": "> [mist](#comment_3_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Чем опциональные файлы. Отсутствием лишнего дублирования, универсальностью, модульностью и большей популярностью.\n\nи если автор ушел в долгий офф, сервис ipfs издох, картинки накрылись медным тазом... Дублирование однако не всегда зло\n",
			"post_id": 35,
			"date_added": 1487853995
		},
		{
			"comment_id": 10,
			"body": "> [zalex](#comment_3_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Ну и локальным сервисом KeePass(X), собственно, тоже не является:\n> alex@compik:~> service keepassx start\n> service: no such service keepassx\n> :D\n\n:)\n\nа вот https://keepassxc.org/ вроде как и сервис предлагает. На самом деле лучше все-таки хранить в шифрованнном контейнере и делать резервную копию. При этом сама база kbx поддерживается различными программами keepass(x, xc, Android) и прочие.\n ",
			"post_id": 49,
			"date_added": 1494698258
		},
		{
			"comment_id": 11,
			"body": "> [zalex](#comment_4_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Разве? Не нашёл упоминания онлайн-синхронизации и тому подобного.Кстати, спасибо за наводку, будем посмотреть эту программу.\n\n>KeePassHTTP support for use with PassIFox in Mozilla Firefox and chromeIPass in Google Chrome and Chromium. passafari in Safari.\n\nне оно?\n\n\n> Шифровать шифрованный контейнер - это мощно!\n\nПроблема в том что сам контейнер keepass не такой надежный, были статьи по восстановлению оттуда данных. \n\nНу и плюс сам файл с расширением kbx как-то красноречиво говорит что там что-то очень интересное. \n\n> Само собой.\n\n",
			"post_id": 49,
			"date_added": 1494772138
		},
		{
			"comment_id": 12,
			"body": "Хотя да, это похоже только на будущее, видимо попутал с https://github.com/pfn/keepasshttp",
			"post_id": 49,
			"date_added": 1494772386
		},
		{
			"comment_id": 13,
			"body": "> [balancer73](#comment_37_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тебе хорошо. А мне — часто приходится :) Это не говоря о том, что только компов, с которых более-менее постоянно работаю сейчас штук 7-8 насчитал. Windows+Linux. А ещё к ним пара-тройка гаджетов под Android, откуда тоже логиниться приходится.\n\nнда, тут точно какой-то LastPass нужен, хотя бы личный... ",
			"post_id": 49,
			"date_added": 1494845546
		},
		{
			"comment_id": 14,
			"body": "Вот так наверное и остается только ZeroBlog или блокнот... ",
			"post_id": 90,
			"date_added": 1528461479
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"10": 1,
		"30": 1,
		"31": 1,
		"32": 1,
		"39": 1
	}
}