{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1BUgbWwi2bDxHZHzNARECCe5D7Ep18C6Yz": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1EijgoCXBywY6m8qcT9NRzThbRkq7ai5ii": [
			{
				"comment_id": 1,
				"body": "Primeiro tem fazer backup do seu zeroid (ou quaquer outro id)\n(Video)[https://www.youtube.com/watch?v=TqRJQugAcAw]\n\nDepois jogar na pasta do app zeronet em seu aparelho android.\nA estrutura de pastas é similar ao do computador logo fica fácil de entender.",
				"added": 1612854517
			}
		],
		"1_1BUgbWwi2bDxHZHzNARECCe5D7Ep18C6Yz": [
			{
				"comment_id": 2,
				"body": "Não sei se já é rentavel mas há tentativas tipo [esse](http://127.0.0.1:43110/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/#!index)",
				"added": 1613702386
			},
			{
				"comment_id": 3,
				"body": "maetrusm@zeroid.bit concordo mas essa problema é comum até em site na rede comum mas pelo menos é uma tentativa e é o que o rapaz estava querendo saber, se mas zites assim aparecerem quem sabe não comece a ser viável fazer comercio de maneira decentralizada.",
				"added": 1613746803
			},
			{
				"comment_id": 4,
				"body": "> [mateusrm](#comment_1_15qVru57g2Gpumhby7UkDWuS3qKnmGSqG8): nao tem botao denunciar anuncio, nao vai longe isso aqui nao...\n\nconcordo mas essa problema é comum até em site na rede comum mas pelo menos é uma tentativa e é o que o rapaz estava querendo saber, se mas zites assim aparecerem quem sabe não comece a ser viável fazer comercio de maneira decentralizada.",
				"added": 1613746837
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 5,
				"body": "Mano, acho que hoje em dia não há lugar que vc se enturme a não ser em um manicômio, do mesmo jeito que imposto é roubo ancap preconceituoso é no minimo hipócrita ou não intende o básico da filosofia ancap que começa com a não agressão. Espero que melhore seus pensamentos e que a zeronet te ajude nisso.",
				"added": 1614308840
			}
		]
	},
	"comment_vote": {
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": 1,
		"6_1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL": 1,
		"19_1MDyXZ8EMhcUoiBMC53DFxFYYsLPT61phy": 1,
		"1_17h3tar21Hh68CTzcmPvnq6aiyeRn8UC9u": 1,
		"9_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": 1,
		"8_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": 1
	}
}