{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "More AMF links",
			"body": "http://www.mutantfest.info\nhttp://www.mutantfestival.org\nhttps://hub.spaz.org/channel/mutantfest",
			"added": 1465549106
		},
		{
			"topic_id": 2,
			"title": "Photo Gallery",
			"body": "https://hub.spaz.org/photos/mutantfest",
			"added": 1465556712
		},
		{
			"topic_id": 3,
			"title": "What is the Autonomous Mutant Festival?",
			"body": "The Autonomous Mutant Festival is a free, week long gathering in the Pacific Northwest region of North America. It is organized in an open-source, decentralized manner by a federation of independent collectives. The festival, now in its' 20th year, is characterized by all night dancing at booming sound systems, art installations using scavenged and found objects, acoustic and experimental music, collaborative kitchens and shared meals, and a free exchange of ideas and knowledge in a liberated social environment. The location of the event is traditionally not disclosed until just before the start date, and could be anywhere in the Cascadia region (northern California,Oregon or Washington), so attendees are advised to prepare for a days travel at short notice, and keep posted to these info sources:\n\nhttp://www.mutantfest.info\nhttp://www.mutantfestival.org\nhttp://127.0.0.1:43110/mutantfest.bit",
			"added": 1467623014
		},
		{
			"topic_id": 4,
			"title": "Fire Safety Manual",
			"body": "AMF Fire Safety Manual\n\nEvery vehicle coming to the festival should have a fire extinguisher, a 5 gallon bucket of water, and a shovel. this is for fire safety and it's a very good idea.\n\nIf the fire risk in the area where the festival takes place is high there should be no camp fires and limited open flames etc.\n\nIf you are thinking about dealing with fire, look around to see if the grass and trees have turned into possible combustibles. if you have even the slightest doubt don't have a fire. learning how to acclimate yourself to nature is much more rewarding than learning how to manipulate nature. is a fire really necessary?\nBuilding and Putting Out a Campfire\n\nBuild campfires away from overhanging branches, steep slopes, rotten stumps, logs, dry grass, and leaves. Pile any extra wood away from the fires.\nKeep plenty of water handy and have a shovel for throwing dirt on the fire if it gets out of control.\nScrape away litter, duff, and any burnable material within a 10-foot-diameter circle. This will keep a small campfire from spreading.\nStart with dry twigs and small sticks. Add larger sticks as the fire builds up.\nPut the largest pieces of wood on last, pointing them toward the center of the fire, and gradually push them into the flames.\nKeep the campfire small. A good bed of coals or a small fire surrounded by rocks gives plenty of heat.\nBe sure your match is out. Hold it until it is cold. Break it so that you can feel the charred portion before discarding it. Make sure it is cold out.\nConserve matches---carry a candle as a fire starter.\nNever leave a campfire unattended. Even a small breeze could quickly cause the fire to spread.\nDrown the fire with water. Make sure all embers, coals, and sticks are wet.\nMove rocks---there may be burning embers underneath.\nStir the remains, add more water, and stir again. Be sure all burned material has been extinguished and cooled. If you do not have water, use dirt. Mix enough soil or sand with the embers. Continue adding and stirring until all material is cooled.\nFeel all materials with your bare hand. Make sure that no roots are burning.\nDo not bury your coals---they can smolder and break out.\nCharcoal Briquettes:\n\nAfter using the burning charcoal brackets, \"dunk 'em!\" Don't sprinkle. Soak the coals with lots of water; stir them and soak again. Be sure they are out--cold! Carefully feel the coals with your bare hands to be sure.\n\nSmoking:\n\nWhen smoking is permitted outdoors, safe practices require at least a 3-foot clearing around the smoker. Grind out your cigarette, cigar, or pipe tobacco in the dirt. Never grind it on a stump or log. It is unsafe to smoke while walking or riding a horse or trail bike. Use your ashtray while in your car.\n\nLanterns, Stoves, and Heaters:\n\nCool all lanterns, stoves, and heaters before refueling. Place them on the ground in a cleared area and fill them. If fuel spills, move the appliance to a new clearing before lighting it. Recap and store flammable liquid containers in a safe place. Never light lanterns and stoves inside a tent, trailer, or camper. If you use a lantern or stove inside a tent or trailer, be sure to have adequate ventilation. Always read and follow instructions provided by the manufacturer.\n\nHousehold Trash:\n\nIf you must burn trash, don't pile it on the ground. It will not burn completely and will be easily blown around. Local fire officials can recommend a safe receptacle for burning trash. It should be placed in a cleared area, away from overhead branches and wires.\n\nNever attempt to burn aerosol cans; heated cans will explode. Flying metal from an exploding can might cause an injury. Burning trash scattered by such an explosion has caused the spread of many fires.\n\nSpark Arresters:\n\nAll types of equipment and vehicles are required to have spark arresters. Chain saws, portable generators, cross-country vehicles, and trail bikes--to name a few--require spark arresters if used in or near grass, brush, or a wooded area. To make sure that the spark arrester is functioning properly, check with the dealer or contact your local Forest Service or State forestry office.\n\nVehicles can and will ignite grass. Always park on gravel roads or parking lots.\n\nIf you must park on the grass because you have heavy equipment like soundsystem or tent, it's a good idea to let the engine and exhaust cool down a little on some gravel before moving to the grass. While your vehicle is cooling go to the spot where you will be parking and dig a firline about 5' larger diameter than the vehicle on all sides. A fireline should be 2 feet wide and 1 foot deep. Deep enough to get past most of the grass roots. Buckets of sand or water should be placed near every vehicle, generator, and larger tent. Bigger vehicles should have more buckets.\n\nLarge quantities of buckets can be acquired at delis of most larger markets. Get as many as you possible can. The majority should be placed in a place where everyone knows where they are, like the medtent, and they are to be used ONLY FOR FIRE FIGHTING and should be marked as such to avoid confusion. Also with your buckets you should have shovels, hatchets, flashlights, and escape maps routes in case a fire gets out of hand and everyone has to escape.\n\nsummary:\n\nFire prevention is everyone's job and the guidelines of fire safety sometimes have to be driven into the heads of people who think they know better. Smoking isn't that necessary that you can't go somewhere safe to do it. And if fire danger is extremely high, don't feel bad for telling someone once, and five minutes later pouring buckets of water on their fire. We all pay for the damage done by fire that are created by our gathering.",
			"added": 1467650667
		}
	],
	"topic_vote": {
		"1_1Hk3VC1SpvpXdhSYFPsQRowJC1mDnWESoX": 1,
		"1_1FtUiy2KtVRiLTjs2QrvDJUSx2wMzeeavX": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_1FtUiy2KtVRiLTjs2QrvDJUSx2wMzeeavX": [
			{
				"comment_id": 1,
				"body": "unfortunately this gallery is not working at the moment....",
				"added": 1467623679
			},
			{
				"comment_id": 2,
				"body": "unfortunately this gallery is not working at the moment....",
				"added": 1467623746
			}
		],
		"1_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 3,
				"body": "sounds like you need a friend big fella.",
				"added": 1470983921
			}
		]
	},
	"comment_vote": {}
}