{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"3_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 1,
				"body": "Біткойн — перша реалізація криптовалют, демонстративна і нежиттєздатна, бо має купу родових травм. Я ще років п'ять тому украй скептично ставився до цієї проби пера, і наразі мої прогнози в цілому виправдалися:\n\n1) майнінґ майже централізовано, ситуацією керують лише декілька пулів, причому входять до них лише майнінґ-ферми, майнити на звичайному споживацькому обладнанні годі й намагатись, зріс і обсяг блокчейну, через що мало хто зберігає його повністю. Таким чином, одну з головних ідеологічно покладених на нього задач Біткоїн НЕ виконує, і вже програє банківському середовищу, яке є більш конкурентним;\n\n2) майнити заради отримання винагороди стає невигідно, тож майнерам доводиться задирати комісії, для дрібних побутових транзакцій Біткоїн вже давно не придатен --- тільки для біржових торгів і великих капіталовкладень. Мало того, сама суть майнинґу є жахливою --- це пустопорожній брутфорс ні для чого не придатних більше хешів. Зрештою це призведе до того, що бульбашка лусне — майнинґ перестане окупатися навіть за рахунок колосальних комісій, бо їх ніхто не ладен буде сплачувати, і Біткоїн різко помре. Не можна буде провести жодної транзакції, змайнити жодного блоку, бо на це потрібні будуть колосальні обчислювальні ресурси. Таким чином, ефект для економіки буде, як від типової фінансової піраміди: хто встиг вивести грошенята в щось інше — молодець, решта лишиться з ні до чого не придатним активом у вигляді певної суми у блокчейні.\n\nНе беруся спрогнозувати, коли воно лусне, бо зараз Біткоїн зазнав значного гайпу і важко сказати, збрежеться цей гайп надовго чи курс скоро обвалиться до догайпового рівня — кілька сотень доларів — і продовжить повільно зростати. В будь-якому випадку, навряд чи найближчими роками.\n\nЯкщо вже братися до криптовалют, то рекомендую звертати увагу на валюти, у яких використовується хеш-функція, що довго забезпечуватиме вигідність майнінґу на звичайних CPU/GPU, у яких забезпечується анонімність та які мають ще якусь цінність, окрім власне грошової — приміром, корисні математичні обчислення або популярні нині смарт-контракти. Сукупність цих факторів дає справжню, а не роздуту, децентралізованість і життєздатність.",
				"added": 1515240423
			}
		],
		"5_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 2,
				"body": "Го!",
				"added": 1515240834
			}
		],
		"2_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b": [
			{
				"comment_id": 3,
				"body": "Та вже на 10-му давно.",
				"added": 1515240867
			}
		],
		"1_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b": [
			{
				"comment_id": 4,
				"body": "> [nickbublik](#comment_2_1DFZig8o8PG1anKBgVd5qw6zHjoWVjS3B5): Тобто, є ідея створити розподілений український ЛОР в зіронеті?\n\nНезрозуміло тілько, нащо то потрібно. Он є LOU з півтора реєстрантами. Є DOU, на якому активність гідна, але нікси там майже не обговорюються і взагалі воно більше колективний блоґ, аніж форум. Ліпше вже єднатися до всесвітніх братиків поза СНД, аніж посилювати інтернет-сепаратизм і сидіти малими ком'юніті, у котрих обмін досвідом украй малий.",
				"added": 1515241829
			}
		],
		"1513599200_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": [
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Можливо. Але як тільки перестанеш платити за хостинг, твій блог пропаде. Я так втратив кілька сайтів соих друзів після їх смерті.\n\nТому безкоштовні хостинги на кшталт hostinger, narod.ru та chat.ru рулять!",
				"added": 1515242953
			}
		],
		"1522449376_1K5NGYFmV21ZoPe1MqX9mbWDJQ7McKBUxC": [
			{
				"comment_id": 6,
				"body": "Якесь непонятне ТЗ. Кого куди треба перетворювати? Береш будь-яку хеш-функцію, проганяєш нею усі комбінації з трьох цифр і підбираєш такі значення, щоб вихідна цифра у хеші була, скажімо, третьою (приблизно так PoW у криптовалютах працює, хе-хе). Можна навіть по декілька комбінацій на цифру зібрати. І щоб не так легко ламалося, трохи міняєш алгоритм хеш-функції. Але це все одно нісенітниця вийде з криптографічної точки зору. Чи нема тут XY-проблеми?",
				"added": 1522593356
			}
		],
		"2_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 7,
				"body": "> [tomoki](#comment_1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX): Панове серед нас шпигун tigerru777\n\nРапортує безпосередньо до ФСБ? Чи одразу на Нібіру?",
				"added": 1555277741
			},
			{
				"comment_id": 8,
				"body": "> [tomoki](#comment_4_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX): Звістно на Нібіру, а ти як гадаєш звідки з'явилися ФСБшники?\n\nА протоукри з Марсу прилетіли чи з Венери?",
				"added": 1556262759
			},
			{
				"comment_id": 9,
				"body": "@tratata концепція соцмереж сама по собі зло, бо стимулює людей забагато публікувати, класти яйця до одного кошика й ізолюватися в інформаційному пухирі — тож я не вбачаю права на існування і у вільних федеративних соцмереж.",
				"added": 1558976757
			}
		],
		"1564673111_1LmGWhPuBAMVqUo6wSsnkxFSE1dZkERN2G": [
			{
				"comment_id": 10,
				"body": "> [anotherneko](#comment_18_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): ZN гарно працюе через tor, якщо у цому є пореба.\n\nTOR тут передусім для пробиття NAT використовується. Анонімність це саме по собі ніяк не забезпечує, максимум — можливість приховання від провайдера факту підключення до вузлів ZeroNet, замінюючи його на факт підключення до вузлів більш популярного, а відтак більш підозрілого, TOR.",
				"added": 1565629263
			}
		],
		"1564594845_1LmGWhPuBAMVqUo6wSsnkxFSE1dZkERN2G": [
			{
				"comment_id": 11,
				"body": "Обговорення заради обговорення не потрібне.",
				"added": 1565629349
			}
		],
		"1520190095_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 12,
				"body": "> [jk7](#comment_4_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): \"гіперанонимному-сєкюрному\" телеграмі\n\nЦе в якому місці? Там же навіть шихрованих групових чатів немає.",
				"added": 1576763410
			},
			{
				"comment_id": 13,
				"body": "> [dmio](#comment_2_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN): обычного сайта на LAMP\n\nНіяк; фатальний недолік зайтів у тому, що на них концептуально не кладуться сайти з динамічними серверними скриптами. Нема де їх гостити. От у TOR/I2P, приміром, без проблем перетягують клірнетівські сайти на тих же технологіях, просто шлях з'єднання инший. Причому в I2P деякою мірою присутня зеронетівська реплікація, бо контент розповсюджується й кешується на чужих вузлах, тож сайт без складних скриптів на фронтенді (себто такий, з якого можна зберегти сторінку в HTML-файл і теку з ресурсами — не MHTML і подібне — і вона повноцінно відкриватиметься з диску) може, якщо пощастить, відкриватися навіть за смерти сервера.",
				"added": 1576763831
			},
			{
				"comment_id": 14,
				"body": "> [dmio](#comment_1_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN): А есть хоть один пост об обходе блокировок сайтов в Украине?\n\nА що там обходити? «Блокування» чудово обходяться для пересічних користувачів встановленням Яндекс.Бравзера, у якому тунелювання вже вбудоване. І рекламується він самотужки чудово.",
				"added": 1576763946
			}
		],
		"1567548735_16iGKuwiVs9no6N8gTnn8y12TGMzvxDxEL": [
			{
				"comment_id": 15,
				"body": "> [jk7](#comment_3_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): видалимо\n\nХуй тебе :P",
				"added": 1576765084
			},
			{
				"comment_id": 16,
				"body": "> [jk7](#comment_7_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): и тебе хуй в сметане! тут ниче не удаляется - товмайору усё по папкам расскладируют и занесут.\n\nА сюди крім товмайорів хіба хтось ходить?",
				"added": 1577023555
			}
		],
		"1580422265_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 17,
				"body": "Щоб піднімати власні сайти? Безкоштовні клірнетівські гостинги поступово вимирають, бо їх засирають зловмисники й школологакери.",
				"added": 1580446559
			},
			{
				"comment_id": 18,
				"body": "> [jk7](#comment_40_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Тупорила кацапська свинота - геть нахуй!\n\nТримайте медальку за підрохкування ☺",
				"added": 1616451273
			},
			{
				"comment_id": 22,
				"body": "> [jk7](#comment_41_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Мову не вивчив та спалився, московит.\n\n> скривати\n> нахуй\n> фтопку\n> брешіти це не я московит це ви всі московити",
				"added": 1617313029
			}
		],
		"1612041169_114MKwrui5xM1udQ6oe82GF9YEuX8KhdNV": [
			{
				"comment_id": 19,
				"body": "Слово «вакцинація» асоціюється в мене з заставкою УТ-2. Там, де бульканина, схожа на це слово.",
				"added": 1616452003
			}
		],
		"1607078813_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": [
			{
				"comment_id": 20,
				"body": "А що, банальне шихрування не допомага? Мені років зо 8 тому на Інтертелекомі допомагаше. Мінус — відпадають піри, у яких воно вимкнене.",
				"added": 1616452356
			}
		],
		"1608551511_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": [
			{
				"comment_id": 21,
				"body": ">та платежів\n\nТам же донатити можна через палицю й LiberaPay.",
				"added": 1616452533
			}
		],
		"1612042485_114MKwrui5xM1udQ6oe82GF9YEuX8KhdNV": [
			{
				"comment_id": 23,
				"body": "Замість легалізувати канабіс, ліпше заборонити алкоголь, тютюн, відеоігри, соцмережі, секс, мастурбацію, кофеїн та инші легальні наркотики. Бо напівміри якісь: одне заборонене, инше ні, хоча суть одна й та ж: вироблення аддикції там, де її природньо нема.\n\nА реальна причина цього суто в розподілі сфер контролю між:\n\n· державою: легальні наркотики, з яких держава дере акцизи;\n· тіньовим бізнесом: заборонені наркотики, з яких держава ніц не має;\n· легальним бізнесом: легальні наркотики, з яких держава має максимум звичайні податки, і які за волінням лівої пʼятки чергової влади можуть перейти до однієї з двох попередніх категорій;\n· простим населенням і його традиціями, на які поки що через відсутність монетизації вищепереліченим категоріям начхати: згадаймо ситуацію з дикорослими тютюном та коноплями ще в середині минулого століття. Теж, вочевидь, із часом переходять до вищенаведених категорій.\n\nПоза політично-законодавчою площиною ж ніякої різниці між сортами лайна нема.",
				"added": 1617486255
			}
		],
		"1612041037_114MKwrui5xM1udQ6oe82GF9YEuX8KhdNV": [
			{
				"comment_id": 24,
				"body": "> [kmglnk4](#comment_3_16rWGP2BN5FKr2q9iibMoxEySmeME1NAHR): Окраина Российской Империи.\n\nАбо ж Польщі ;) В ООН зареєстрованої.",
				"added": 1618570967
			}
		]
	},
	"comment_vote": {}
}