{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): What style are these pictures in? Some sort of abstractionism?\n\nThis example was a combination of a lot of effects in a graphics software. I think it began with a photo, which I saved in very low-quality jpg format. This resulted in this blocky structure. Subsequently a combination of blur and color-reduce was added a few times. The color reduce was rather drasticly - only admitting like 3 to 10 different colors. The color reduce was done with Floyd-Steinberg Dithering on to get these pixel-effects. The colors were done in the last round. \n\nMost of this image was done randomly, but again and again until something interesting came out. (untitled___3 has the same image but with different colors).",
			"post_id": 16,
			"date_added": 1455844397
		},
		{
			"comment_id": 2,
			"body": "> [muja](#comment_1_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): The image is not showing up. Is it just me?\n\nI experimented with webp to reduce image file size.\nWhat browser did you use that wasn't showing the images?",
			"post_id": 20,
			"date_added": 1455899738
		},
		{
			"comment_id": 3,
			"body": "> [muja](#comment_3_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): Firefox and Tor.\n\nHm. Yes Firefox isn't working :(",
			"post_id": 20,
			"date_added": 1455917403
		},
		{
			"comment_id": 4,
			"body": "> [danny](#comment_1_1gxnMbioXRbkebgK9JSmqkPhXRH97a6Jn): Reminds me of the Gameboy Camera\n\nyes, maybe. I like this kind of 'aesthetic' \nThere is also a very high-res (4096x4096 px) full color-version of this. I will propably post it sooner or later. maybe even the giant picture for people who want to print it).",
			"post_id": 43,
			"date_added": 1457033968
		},
		{
			"comment_id": 5,
			"body": "> [grandchild](#comment_8_14dXYTMY7gArErE6jLYHBzb6c9uFDym8yZ): very \"beyond the black rainbow\"\n\nOh ja :)\n\n",
			"post_id": 80,
			"date_added": 1461506446
		},
		{
			"comment_id": 6,
			"body": "> [redacted](#comment_1_19qsuxKBkNZWYft3epWgn6u3gG82sQHs6n): Did you make this in ready as well or is there some other procedural art package you're using?\n\nThis was done in blender only :-)\n",
			"post_id": 86,
			"date_added": 1462229650
		}
	],
	"comment_vote": {},
	"post_vote": {}
}