{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1597659956_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 1,
				"body": "Sounds like crap to me.",
				"added": 1597796028
			}
		],
		"1597591330_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 2,
				"body": "Antifa is bent on destroying America. The BLM founders are witches, practicing Odu Ifa, and their movement is being funded by a woman with terrorist ties. A peaceful movement has basically been hijacked for evil means.",
				"added": 1597796519
			},
			{
				"comment_id": 3,
				"body": "https://www.newswars.com/is-black-lives-matter-run-by-witches/",
				"added": 1597796537
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 4,
				"body": "America is being weakened from within. China and Russia will invade eventually. Social media is censoring the truth because they are in league with the crap that's going on.",
				"added": 1597796957
			},
			{
				"comment_id": 5,
				"body": "Parler is a good alternative for twitter. Twitter will censor you.",
				"added": 1597796999
			},
			{
				"comment_id": 6,
				"body": "DTube or bitchute is better than youtube if censorship bothers you. LBRY ain't bad either. Mewe.com is a greater alternative to facebook. The popular platforms are working together to destroy America by suppressing truth and fueling hate and other agendas.",
				"added": 1597797113
			},
			{
				"comment_id": 8,
				"body": "> [wwg1wga](#comment_12_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Also check out PeerTube as it is also federated so by nature it cannot be turned into a bullshit service like YT. Its like Diaspora where you choose what server you data is on and where. Also you can run your own instance even better yet! :)\n\nSounds good.",
				"added": 1597883221
			}
		],
		"1597484759_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 7,
				"body": "tubitv.com offers free movies as well.",
				"added": 1597797527
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 9,
				"body": "> [zeronetbackups](#comment_9_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): The so called \"Native Americans\" are of the mongoloid race. Mongoloids are native to Asia. They invaded America long after White people migrated there and before jews invaded and established \"America\". People who can look at these mongoloids and not see an obvious asian should be sterilized.\n\nThe Jews never invaded and established America. The settlers were outcastss from Britain. You are forgetting American History. They introduced smallpox to Indians in blankets and it wiped out many of them. Some land does belong to them. They came here and saw the Indians living here already. Texas and New Mexico and possibly part of California was Mexican land that was seized by America. One just has to look at the names of many cities in these states to know. It's no coincidence. America is a melting pot, part of what makes it great. Before I forget, even the French owneded land in Louisiana and America bought it for 15 million dollars. It's the Louisiana Purchase.",
				"added": 1597884327
			},
			{
				"comment_id": 10,
				"body": "Alot of stuff going on right now is geared towards dividing America. Divide and conquer.",
				"added": 1597884407
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 11,
				"body": "https://www.brighteon.com/d6412bff-0421-4190-a7bf-3e5e1f52559d",
				"added": 1597884620
			},
			{
				"comment_id": 12,
				"body": "Plandemic II is what you guys should be watching. It gives insight into what is going on now. Fake news can be used to discredit people who are \"woke\" or to confuse the masses so that they no longer care and just do their own thing.",
				"added": 1597884763
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 13,
				"body": "Most ppl will gravitate towards other platforms instead of Zeronet because they aren't tech savvy. Eventually there will be a shift when the popular platform become more draconian.",
				"added": 1597885038
			},
			{
				"comment_id": 16,
				"body": "I hear crickets. I guess folks transitioned to mewe.com",
				"added": 1628123237
			}
		],
		"1597857981_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 14,
				"body": "The media is trying to start a race war. Don't let them fool you.",
				"added": 1597933625
			}
		],
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 15,
				"body": "They want to go cashless so they can control our money.",
				"added": 1597935370
			}
		]
	},
	"comment_vote": {}
}