{
	"next_comment_id": 12,
	"user_name": "D14na",
	"hub": "1N9sU8qh3S4ei9PHE1qQyYPbcckJomvwMd",
	"post_like": {
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535855116": 1535920301,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535778046": 1536107213,
		"12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162": 1536217471,
		"12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1536132611": 1536403506
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Kaffie I'm really sorry about what happened with your namecoin names. I'm also on Mac and I'd really recommend using VirtualBox to run the Linux client for Namecoin (in my experience, Cupertino loves to break compatibility for reasons unknown to me). I'm also working on a service Zitetags (http://127.0.0.1:43110/zitetags.bit) specifically to manage/handle the problem you suffered from.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535603427",
			"date_added": 1535673301
		},
		{
			"comment_id": 2,
			"body": "@Kaffie: sometimes its easier said that done. all I'm saying is don't be so quick to blame the developers, as they may not currently have the resources to support an updated mac client (idk, just mentioning it as a possibility). imo when it comes to mac, the burden is on the developers to keep up, but not everyone can.\n\nzitetags is currently just a stub (for an idea). i only mentioned it, as I see your situation as a flaw in the \"namecoin\" system, which could be greatly improved. still, its very unfortunate what happened to you",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535603427",
			"date_added": 1535702906
		},
		{
			"comment_id": 3,
			"body": "@Kaffie just read thru the rest of this thread and you mention namecoin \"still supports capitalism\". i was just wondering why you felt that way. personally, I'm a big fan of blockchain technology and see potential in integrating it more with Zeronet. but perhaps that's not a popular view?\n\n@ssdifnskdjfnsdjk@zeroid.bit i also like the idea of vanity addresses. http://127.0.0.1:43110/1VANiTYgLALx39gftHSF4qFgGAxzbmYAC is another stub I setup as an idea for a shared service to pool computing power for the \"faster\" creation of longer names (as i'm sure you're aware it can quickly jump into the days, months and years range). there are challenges with this as well (protecting private keys), but perhaps it could serve as an alternative to namecoin's .bit.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535603427",
			"date_added": 1535706306
		},
		{
			"comment_id": 4,
			"body": "@Kaffie well being a capitalist myself, I really can't argue with you there. I do hope you can see some of the positive features of these systems. and I mean that in a \"relative\" sense. personally, I'm \"mostly\" encouraged by the new levels of transparency that are now possible solely due to the introduction of these blockchains and their use in previously proprietary systems. \n\nI've long since distanced myself from Bitcoin (for personal reasons), but I'm very active in the Ethereum community. There are tremendous things that can be done today with smart contracts, with more \"meaningful\" use-cases arriving almost daily.\n\nAnyway, these systems are far from what I would consider perfect (if there is such a thing), but I welcome the improvements that they do bring to a mostly broken system that just frustrates me. I also welcome your perspective as it helps balance my own.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535603427",
			"date_added": 1535737511
		},
		{
			"comment_id": 5,
			"body": "Would it be possible to use both ZeroID AND KxoId? Would that mean using 2 different hubs? What happens to the data that I've already posted with my ZeroID?",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1535920273
		},
		{
			"comment_id": 6,
			"body": "+1",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535855116",
			"date_added": 1535920309
		},
		{
			"comment_id": 7,
			"body": "@Eibriel: +FF lmao",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1535855116",
			"date_added": 1536107791
		},
		{
			"comment_id": 8,
			"body": "@Krixano I'd be interested in moving over to KxoHub, even just for the exercise in doing so to bring greater understanding of Merger Sites and such. I think I remember seeing a post about it too, but that was well before I had started using ZeroMe.\n\nAnyway, I'll keep working through the code and I'm sure I'll figure it out.",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1536119697
		},
		{
			"comment_id": 9,
			"body": "> Here's Kaffie's tutorial on moving an existing profile over to new hub\n\n@Krixano fantastic! that's exactly what I was looking for",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1536217532
		},
		{
			"comment_id": 10,
			"body": "@krixano does 0Play Chat support \"@\" mentions that will show up in the Newsfeed? There is a \"Following\" button, but I don't know what it does. \n\nI'm expecting to offer app notifications with 0Explorer, but I'm still looking for something better on desktop (specifically Mac); **I'd be happy with even just a COUNTER BADGE in the browser title to display how many mentions are unread.** Anything I can do to help facilitate this will be my pleasure to support.\n\n**EDIT:** ok, I see the chat in the Newsfeed; probably should have checked that first lol. But does it support mentions as well? I'm not 100% on how mentions are queried by the database (must you prefix with the \"@\" symbol, or will it match any txt containing your user_id?) thanks!",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1536132611",
			"date_added": 1536403504
		},
		{
			"comment_id": 11,
			"body": "@Krixano: got it. still working to get my first db zite running. hopefully, it will all make perfect sense afterwards.",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1536132611",
			"date_added": 1536700855
		}
	]
}