{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1607592294,
			"title": "Zoom lied to users about end-to-end encryption for years, FTC says",
			"body": "https://arstechnica.com/tech-policy/2020/11/zoom-lied-to-users-about-end-to-end-encryption-for-years-ftc-says/\n\nThis is why security conscious people only trust Open Source Software.",
			"added": 1607592292
		},
		{
			"topic_id": 1608912569,
			"title": "The Future of Vaccines - Documentary",
			"body": "The Future of Vaccines - Documentary\nhttps://odysee.com/@corbettreport/futurevaccines",
			"added": 1608912566
		},
		{
			"topic_id": 1609321197,
			"title": "video: The Morphing Morality of Hedonists (VidarReturns)",
			"body": "A video by VidarReturns on censorship.\n\nhttps://odysee.com/@vidarreturns/the-morphing-morality-of-hedonists-what",
			"added": 1609321193
		},
		{
			"topic_id": 1609355588,
			"title": "Yacy Search Websites",
			"body": "If you have them, please provide public facing websites where we can go to search using Yacy (portals). Using Google to find this information doesn't reveal much of anything. (Possibly on purpose?)",
			"added": 1609355583
		},
		{
			"topic_id": 1609608959,
			"title": "Mandatory Vaccine - Sci-Fi Short Film",
			"body": "Mandatory Vaccine - Sci-Fi Short Film\n\nhttps://odysee.com/@WakeUpMirror/Zackery-Denman-Dystopian-Sci-Fi-Short-Film-02-Mandatory-Vaccine",
			"added": 1609608953
		}
	],
	"topic_vote": {
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": 1,
		"1605755443_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1605762939_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": 1,
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1605473599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1600200644_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": 1,
		"1605824826_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"1598385884_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa": 1,
		"1602987903_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1603906058_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1604515576_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": 1,
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1606980382_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1607119283_14TyEpikmsMtpR9pRfqzVGvoWHN3YDdPY6": 1,
		"1607087579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1607096892_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1607556822_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607613860_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"1607699045_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"1607592294_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1607776599_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"1607775553_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": 1,
		"1607610507_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1607888052_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1607957446_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"1608035201_185GTTshXdJKtwsb8pWjobkFwufjR2Z6jb": 1,
		"1608117446_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": 1,
		"1608542019_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1,
		"1608417688_1HrVG2Jz8897agGqyS3oYyFeaocypxp8Mg": 1,
		"1608593713_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1608908993_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1608952482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1609608959_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": 1,
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": 1,
		"1610348128_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ": 1,
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": 1,
		"1610475632_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr": 1,
		"1610524611_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": 1,
		"1610491800_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": 1,
		"1610353747_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"1610318482_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"1610637299_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": 1,
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1,
		"1610676192_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP": 1,
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1591924953_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": 1,
		"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1561864676_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1611103567_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": 1
	},
	"next_comment_id": 99,
	"comment": {
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 1,
				"body": "Gab.com social network is a clean platform, not controlled by advertisers, and Open Source (GPL). Odysee.com (formerly LBRY videos), is also Open Source and decentralized.",
				"added": 1606022040
			},
			{
				"comment_id": 13,
				"body": "Blog = steemit.com , hive.blog",
				"added": 1606157156
			},
			{
				"comment_id": 20,
				"body": "> [scotcyguy2](#comment_49_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): we have to move away from centralised all together or we will end up in the same problem again\n\n100% Correct\n\nMany tech illiterate lemmings out there. Right now people are flocking to Parler and MeWe to escape Facebook. Both are Centralized.\n\nFor 100% P2P social media, there is the SSB network (Manyverse + Patchwork), but it needs a lot more work.",
				"added": 1606745335
			},
			{
				"comment_id": 24,
				"body": "@sturmwaffle\n\nYes, secure scuttlebutt is completely P2P, but you can add \"hubs\"(servers) or host your own \"hub\", which allows people to upload/share data, so that others can download it when they are offline. But adding a hub is your choice, and not mandatory. (You and a friend could create a private network of only 2 people)",
				"added": 1607005019
			}
		],
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 2,
				"body": "Not great design. Like browser cache, this information should be stored in the home directory by default.",
				"added": 1606022575
			}
		],
		"1605755443_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 3,
				"body": "There is a burner app in the Google Play Store called Hush or Hushed. About a year ago I contacted them by email and they let me purchase a burner phone number through Bitcoin.",
				"added": 1606022966
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 4,
				"body": "Like previous posters have noted, the decentralized video network Odysee.com (formerly LBRY). It's the most technologically superior video solution out there right now, and growing fast.",
				"added": 1606023743
			},
			{
				"comment_id": 8,
				"body": "Note: bitchute is not decentralized. If (when) they are shutdown, they are game over",
				"added": 1606026678
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 5,
				"body": "I think the Zero\\* zites are positive for the network, because they help bring everybody to the same place, instead of connecting and immediately having to hunt for other people. Also, I don't think we have to worry about the deletion of Zero\\* zites, because 1) Nofish isn't making money (yet) from them, so there doesn't seem to be a motive and 2) If they are deleted, then someone else can just clone the site.\n\nI do agree with your concerns with using GitHub, though I read somewhere that Google has stake in Gitlab",
				"added": 1606024792
			}
		],
		"1595502249_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 6,
				"body": "Some serious mental gymnastics going on here. Muslim women can refuse waxing service, but not cake making service...",
				"added": 1606025568
			}
		],
		"1605635582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "All I see is blah blah blah. Get off of Github. Decentralize everything!",
				"added": 1606026011
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 9,
				"body": "The difference between Google and Apple store, is developers never even make it to the Apple store before being deleted",
				"added": 1606027011
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1606040168_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 11,
				"body": "Anyone that cared about their freedoms shouldn't be stupid enough to buy an Apple product",
				"added": 1606147267
			},
			{
				"comment_id": 28,
				"body": "Anyone that buys from Apple is an idiot. Apple has you by the balls. At least Android allows people to install downloaded apps",
				"added": 1607187270
			}
		],
		"1605762939_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "> [sarkozizi](#comment_1_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9): There is also Peertube, a full-decentralized video platform. You can download videos by torrent or direct download ;)\n\nI've tried using Peertube before. Is it any better than it ever used to be? 500Mb total video limit for users?",
				"added": 1606147976
			},
			{
				"comment_id": 14,
				"body": "VidarReturns -\nA philosophical channel devoted to the development of humans toward greater excellence, intelligence, and society as an evolutionary species.\nhttps://odysee.com/@vidarreturns",
				"added": 1606159526
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 15,
				"body": "So people spread crazy conspiracy theories. So who gives a shit? If you're for censoring people who don't think like yourself, then you're what's wrong with this world.\n\nWanting everybody else to think like me is precisely \"sheep\" thinking. Sheep",
				"added": 1606160287
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 16,
				"body": "Can someone please tell me what IFS is? I tried a few different searches, but no answer results.",
				"added": 1606160998
			}
		],
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 17,
				"body": "You can add Searx to Firefox search with this string\n\n    https://searx.be/search?q=%s&language=en-US\n\nThis thread has recently motivated me to test Searx as my default search engine. Considering that it copies from Google and others, I expected the results may be better than Duck.com (my normal engine). Turns out that wasn't quite accurate. Sometimes Duck gives better results. I suspect the quality of results varies based on the subject being searched. Lesson to me: Always keep my options open",
				"added": 1606736559
			},
			{
				"comment_id": 34,
				"body": "2 Points\n\n1. The thing I don't like about Searx (other than poor search results), is that the results are still censored. Censored and manipulated results from the tech Giants. No I don't want to see Wikipedia (Ministry of Truth) for every search.\n\n2. Also, in regards to the poor search results, do you think Google may be identifying searx servers and intentionally sending them garbage search results?",
				"added": 1607622874
			},
			{
				"comment_id": 35,
				"body": "> [bats](#comment_54_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): I do find wikipedia rather useful...\n\nI also find Wikipedia useful, Sometimes. But keep an eye on any page that is \"Locked\" from editing. There are a lot of pages dedicated to simply being a biased hit piece. Just look up Gab, or almost any right-wing video creator that has been ban from YouTube. (Stefan Molyneux, Alex Jones, Jared Taylor)\n\nWikipedia is a part of the control to manipulate people.",
				"added": 1607745559
			},
			{
				"comment_id": 38,
				"body": "Is there any Video search engine that includes (and prioritizes) alternative platforms, like Odysee.com, Bitchute, and Rumble?",
				"added": 1607862995
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 18,
				"body": "If you're going to kill yourself, then doing it in a densely populated city with a big bang is definitely one way to do it... ðŸ‘",
				"added": 1606737468
			}
		],
		"1605258725_1EQvG7tmmrK7rvVPaXm9zFeHckdhPEXvWR": [
			{
				"comment_id": 19,
				"body": "> [tvpede](#comment_13_14JRtW3jByzZEQeEkG9QMXNi2jTKudcotJ): Indeed Raspberry Pi zero won't cut it performance wise. I replaced my Raspi 2 with the Pi 3 to make it work.\n\nPerhaps, or not. It really depends on what you're trying to serve. If you want to also use it to serve pages on Clearnet, then yes, you may want more horsepower. For serving content on Zeronet, there is almost Zero backend processing. But what if a lot of people visit the site? Then the content is shared between those visitors, and the impact is minimal.\n\nSo whether you need something more powerful really depends on if you're serving Clearnet. For Zeronet alone, it needs almost no processing. You could tuck a Pi Zero into very tiny space, running 24/7, and practically forget about it existing.\n\nThough if you have the money and available space, then I would recommend a Rpi 4 (or an Orange board), because you can always use it for multiple other tasks at the same time. I have one running as my private personal file server using Syncthing (backs up all the photos from my phone). I also have torrents running on it 24/7. I also have a Youtube-dl script running on it, so it can download youtube videos as mp4 or mp3 and feed them directly to my phone (by dropping them in Syncthing)",
				"added": 1606739387
			}
		],
		"1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 21,
				"body": "IQ Compared by Country\nhttps://www.worlddata.info/iq-by-country.php\n\nGreen is Higher\nRed is Lower",
				"added": 1606831419
			}
		],
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": [
			{
				"comment_id": 22,
				"body": "Excellent points made here. If we aren't evolving stronger as a species, then we are becoming weaker.",
				"added": 1606902981
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 23,
				"body": "I'm not a fan of enabling JS either, and that is probably the biggest downside of Zeronet. Does anyone know if Zeronet supports GET/POST?\n\nAside from that, Anonymity isn't an issue, as Zeronet is easily used in combination with Tor (and soon to be I2P also).\n\nAs an advantage of Zeronet over others is scalability. Like BitTorrent, those who download also upload. So if a million new users jumped into Zeronet, rather than slow down, it would likely speed up!\n\nThe reason I'm on Zeronet is primarily because it's easier. I clicked in, and it took me to good stuff like ZeroTalk. Registration was click-click easy. With I2P, I have to waste a lot of time searching around. I have yet to find a website on I2P like ZeroTalk.",
				"added": 1607003238
			}
		],
		"1606980382_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 25,
				"body": "Which operating system?",
				"added": 1607008964
			},
			{
				"comment_id": 26,
				"body": "> [sj29msn5kz0ldmn](#comment_16_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): Mac and Windows are proprietary malware\nI agree, and I run Linux myself, but a lot of people use malware with Zeronet on their computer. Haha",
				"added": 1607016762
			}
		],
		"1607087579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "Great video! The channel below (VidarReturns) makes philosophical videos on how future generations can escape such Tyranny. Definitely worth following if you have, or plan to have children\nhttps://odysee.com/@vidarreturns",
				"added": 1607186956
			}
		],
		"1607365168_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 29,
				"body": "> [mxh69420](#comment_29_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): this is toxic politics. both sides do this to reasonable people like you and me.\n\nI largely agree. But like radical Muslims, the common Muslim has guilt by not condemning it. Not once in Biden's campaign did he or any Democrat condemn the looting, theft, and violence of BLM or Antifa.",
				"added": 1607431128
			}
		],
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 30,
				"body": "> [jlxip](#comment_9_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): Well, just lost the domain thing. I have absolutely no idea why it still works, pure wizardry. Haven't had the time to rewrite the site, it will happen... At some point.\n\nThanks for the update",
				"added": 1607497937
			}
		],
		"1607556822_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "From every FB post talking about the election:\n\"The AP has projected Joe Biden the Presidential Winner of the 2020 election\"\n\nI just want to ask, when did the Associated Press become part of the USA Government?\n\nGiant tech companies are projecting their own opinions as facts, and censoring those who disagree.",
				"added": 1607593538
			}
		],
		"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 32,
				"body": "Make a meta site. I like to use Torrentz, because it combines torrents from multiple sites into one place. Saves me time of having to go to each of them individually. People like things that make their life easier. At the same time, it gives the chance for a smaller site to be equalized with a larger site. Imagine if people could search Thingiverse and every other model site at once. Those smaller sites could then have a better fighting chance.",
				"added": 1607594780
			}
		],
		"1607613860_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 33,
				"body": "I've been supplementing with 0list http://127.0.0.1:43110/0list.bit/\n\n0list has active zites posted regularly, but not necessarily popular zites.\n\nI agree, it would be good to have a better way to recognize popular sites.",
				"added": 1607615423
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 36,
				"body": "> [quantumkitty](#comment_492_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I can't see why it would be a hoax. Wall Street prefers stability, not lockdowns and inflation.\n\nWho are you to know what Wall Street prefers? Wall Street has been up almost every month since March 2020. While small businesses die around you everyday, you increase your shopping with Mega Corps like Amazon. Small businesses have no public stock, but Amazon does, so the economy looks to be doing good. Yet the economy is becoming more corrupt. We are seeing a mass transfer of wealth from small businesses to Mega Corporations. (Amazon, Apple, Google, Facebook, etc.)\n\n@zerohope\nYou're absolutely correct, and VidarReturns has been creating content on how the Virus is blown out of proportion, and we are going the wrong way. Humans are DeEvolving. Vaccines are not a cure. They are a curse. A curse that we pass on generation to generation. Last generation 10 vaccines, this generation 100 vaccines, next generation 1000 vaccines...\n\nIf we want to survive more than the next few hundred years, then we must evolve as a species. Become more fit, and develop natural immunity to viruses.\n\nhttps://odysee.com/@vidarreturns",
				"added": 1607767092
			}
		],
		"1607768344_1GGTrtSNfhkDqJzFw4CaQKDRNSg73QSkGB": [
			{
				"comment_id": 37,
				"body": "I wish I could support QAnon, but it is an umbrella term for some good ideas, and unfortunately some junk conspiracy theories.",
				"added": 1607769336
			}
		],
		"1607816193_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 39,
				"body": "Someone needs to fix the zite code. Auto limit uploads if needed.",
				"added": 1607863858
			},
			{
				"comment_id": 41,
				"body": "> [musicz5](#comment_5_12YYWsdkATyXJa4epQ8VJibJAh3gRZD24m): In my opinion an upload limit isn't the way.\n\nPerhaps we misunderstand. I didn't mean \"limit the total amount someone can upload\".\n\nI meant, \"limit the number of uploads an individual can make per day\"\n\nHopefully that makes sense.",
				"added": 1607883512
			}
		],
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 40,
				"body": "> [nxm9c2wjbjlhjsrc](#comment_14_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt): If I knew how, I would. I'm not certain it's possible but I may be wrong!\n\nAt the least, it would seem possible to have a Read-Only version of the site that is updated occasionally on Zeronet via script.",
				"added": 1607866486
			}
		],
		"1607610507_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 42,
				"body": "While I support the idea, things that have deterred me from Aether after reading about it.\n\n 1. The idea that all data exists on every device\n 2. POW to post. Which means, it will likely never be available for mobile.",
				"added": 1607943279
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 43,
				"body": "It's real, and it's over exaggerated.",
				"added": 1607944113
			}
		],
		"1607888011_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 44,
				"body": "> [jeff](#comment_74_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Canada should have had their own American Revolution when they had the chance.\n\nBut then where would the American cowards have escaped to?",
				"added": 1607944440
			}
		],
		"1607912664_187kymsyr2UokvTuJMuSvFhhkL8v8AcX7A": [
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_2802_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet has mySQL if I remember correctly. [...]\n\nDoubtful. If was 1337 enough to trash Zeronet, then I suspect he wouldn't be asking such a noob question.",
				"added": 1607944794
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 46,
				"body": "Zeronet isn't fully anonymous by default. This could lead to many people being easily trapped. Also, Zeronet isn't specifically designed for \"private communications\" between individuals. These are elements needed for a trading market.\n\nThese could likely be overcome, and a market created, but it is perhaps less effort to set up a market on I2P or Tor.",
				"added": 1607945977
			},
			{
				"comment_id": 53,
				"body": "> [znu2](#comment_4_15cQMmBd5VDA4Ye4Aq2xcmXhuPd8w8vrJ6): It uses javascript and runs through the browser which I think is a terrible design flaw (how hard is it really to use traditional GUI interface?) so it probably has tons of exploits...\n\nYou must be new, haha, thanks for the laughs! Genuinely the most nonsense comment I've seen on the internet this month. Get a load of this idiot. JavaScript exploits, haha. A ton of exploits compared to what? What does Open Source mean? This from a guy that has never written Hello World! If you want a perfect system, then I think the internet just isn't your thing, man. Lol",
				"added": 1608054792
			}
		],
		"1607948770_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm": [
			{
				"comment_id": 47,
				"body": "According to \"intelligence agencies\" and unnamed sources. So Completely Trustworthy and Reliable Information.  \\*sarcasm\\*",
				"added": 1607955827
			}
		],
		"1607950277_1Fy7oAopkpgGaDeLZ3UbCJCJ3MzXAgPKB3": [
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_2804_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): A: Globalists are happening.\n\nI used to think Globalist was just an Alex Jones buzzword. Now I realize Globalists are actually all around us. Kind of like the Matrix. You walk past them on the street. They don't even know they're supporting a Global agenda. The same people that say \"Believe Science\". They have no clue what science is, or how science is being manipulated toward a specific direction. These people don't believe science; they believe Authority. It's all about believing what Authorities say, and without question. They don't question anything. They don't research anything. Discovering truth for themselves isn't in the capacity of their brain. They live in a gullible world where they are fed the narrative they are meant to have, and they digest it happily, and proudly. And think they are smart, and you are stupid.",
				"added": 1607958134
			}
		],
		"1607957446_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": [
			{
				"comment_id": 49,
				"body": "Does anyone have a copy? I tried to download it so I could reupload to IFS*, but I wasn't able to download it.",
				"added": 1607958693
			},
			{
				"comment_id": 50,
				"body": "> [binary1173](#comment_41_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): There is a 200Mb limit on zero up, I have gzipped it down to 106Mb\n\nSend us the Zeronet link if you upload it",
				"added": 1607962591
			},
			{
				"comment_id": 51,
				"body": "File list uploaded to ZeroUp as zip\n\nshanghai-ccp-member-ch-en.csv.zip\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie/shanghai-ccp-member-ch-en.csv.zip",
				"added": 1607974582
			}
		],
		"1608052496_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 52,
				"body": "From what I've read, Odysee.com is just a frontend to the decentralized video network. Though yes, IPFS or SAFE is probably technically superior. Something like Odysee is a site that normies can use.\n\nIt seems like it's back up again now. Cheers",
				"added": 1608053407
			},
			{
				"comment_id": 54,
				"body": "> [styromaniac](#comment_2809_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yep, it's back, but I'm demoralized over it now.\n\nEven Google was down a couple days ago, and they are in the business of 100% up time. They aren't running on Zeronet. :)",
				"added": 1608060908
			},
			{
				"comment_id": 61,
				"body": "@joeandblow\nHe was using the app, and that's what went down. The website is still running fine.",
				"added": 1608788584
			}
		],
		"1608206269_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 55,
				"body": "Isn't there a bridge somewhere missing it's troll? It's difficult for trolls to spell accurately given their small frontal lobe and stubby fat fingers.",
				"added": 1608297093
			}
		],
		"1608149924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 56,
				"body": "Guess what? It still pays well to be an electrician, plumber, carpenter, land scaping, and engineer. Jobs that can be outsourced over seas to the lowest bidder will always end up paying extremely low in the end.",
				"added": 1608298430
			}
		],
		"1608100813_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 57,
				"body": "Zeronet for Android comes with Tor built-in",
				"added": 1608307527
			},
			{
				"comment_id": 58,
				"body": "Open ZeroHello > Open Left Side Menu (Little white arrow/button near the page bottom) > Open the menu (3 dots at top right) > Configuration > Tor",
				"added": 1608307786
			}
		],
		"1608542019_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 59,
				"body": "This guy has started using his Satire videos to spread truth about Big Patent Tech media.\nhttps://odysee.com/@AtlantisMirrors:9/vVhlcCyF7e8_gZHypfWuYqDfJSf\n\n\"By continuing to be on our platform, you'll still think you have a voice. But in reality, you'll have given up your voice to stay on our platform\"\n\n.\nDisconnect",
				"added": 1608568998
			}
		],
		"1608655431_14EvrR9QiEpqhQyZDFiftdgAXzNQ1x8XH1": [
			{
				"comment_id": 60,
				"body": "Ever since Germany lost WW2, they have been a weak and censored people. It's unfortunate",
				"added": 1608661769
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 62,
				"body": "The climate changing is real. Climate Change(TM), formerly Global Warming (aka AGW), is an over exaggerated scare story for Authorities to gain greater manipulation of the population. Exactly the same as the Covid.\n\nWe have a crisis in our country, and it isn't Carbon or Viruses. The Crisis is believing Authorities without question, and lack of logical thinking skills.\n\nAuthorities aren't always wrong, but they also aren't always right either. Just because someone has an MD or PH after their name, that doesn't make them an infallible God. These people too can be influenced by coercion, bribes, and politics.\n\nWhen we go along with their claims without first being skeptical, then we are complicit in promoting further control and manipulation of ourselves and society.",
				"added": 1608790196
			}
		],
		"1608593713_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 63,
				"body": "In China they quarantined entire villages and sent people home. Yes, at least those few that died were able to live their last moments with family.",
				"added": 1608790969
			}
		],
		"1608912569_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [],
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 65,
				"body": "Honestly I don't have enough experience on I2P. It's difficult to find any sites that are worth going to. Have any decent link lists I can check out?",
				"added": 1608937600
			},
			{
				"comment_id": 69,
				"body": "@nxm9c2wjbjlhjsrc\n\nReally great, and thanks for all the sites and tips. Unfortunately, now I understand all the complaints. Even after modifying my settings, and using your \"tested and confirmed\" site list, only about half of them load. Even ramble.i2p would not load after several attempts.\n\nConstantly getting \"Website Unreachable\"\n\nVery disheartening, because I'd like to see I2P do well. It needs some serious fixing at the foundational level",
				"added": 1609341740
			}
		],
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 66,
				"body": "08chan\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/",
				"added": 1608937733
			}
		],
		"1608952482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 67,
				"body": "Regardless on the BS of 'Great Reset', this video was a decent interview of some important reporters.",
				"added": 1608986145
			}
		],
		"1609290557_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 68,
				"body": "The enemy of my enemy is my friend. What I want to know is how can I send them money?",
				"added": 1609338285
			}
		],
		"1609405437_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 70,
				"body": "There is no evidence that can convince a reasonable skeptic. The greatest proof you could give would just to be a trustworthy individual among the deep web community. If people generally trust you, then they are more likely to take your word that you deleted the privatekey.",
				"added": 1609420627
			}
		],
		"1609355588_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 71,
				"body": "> [xcape2net](#comment_826_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): NO.  I don't want the entire contents of my website downloaded by hundreds of thousands...\n\nI appreciate your concern, but 1. You can set your site to block Yacy indexing 2. Having public portals to Yacy doesn't make the network index sites any more or less than it already does 3. Every major centralized search engine will give us censored and manipulated search results. We need a decentralized P2P search engine for the internet. Maybe Yacy isn't as optimized as it could be, but it will become more optimized as it becomes more commonly used",
				"added": 1609439481
			}
		],
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": [
			{
				"comment_id": 72,
				"body": "Holy hell! I just went to wehatefreespeech.com and it redirects to Facebook!!! WTFK!@",
				"added": 1610471138
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 74,
				"body": "What a shit show is right. Lol\n\nParler was a bait setup from the start. Like it or not, most on the right-wing are technologically retarded. Idiots giving their phone number and ID to sign up? Dumb",
				"added": 1610473433
			}
		],
		"1610348128_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ": [
			{
				"comment_id": 75,
				"body": "How stupid are you to doubt the Hunter Biden story? Seriously, where do you think they got pictures of him naked and smoking a crack pipe from? Facebook? Don't be a dumbass.\n\nTheir scheme is to make you question everything so that you can't see the obvious. The original story is the truth.",
				"added": 1610474422
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 76,
				"body": "@scotcyguy2 Exactly. Musk is Pro-Freedom, Pro-Voluntary. Gates is about Force, and Mandates. These 2 are diametrically opposed.",
				"added": 1610475225
			}
		],
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 77,
				"body": "Ignore trolls",
				"added": 1610598493
			}
		],
		"1610475632_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr": [
			{
				"comment_id": 78,
				"body": "@pornzero I see the page load, but no images.",
				"added": 1610599196
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 82,
				"body": "=What do I run? Or what's the ideal OS?=\n\nThese are 2 very different questions. To be honest, I'm running the Android client most of the time. The ideal system is probably QubesOS.",
				"added": 1610602526
			}
		],
		"1610491800_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": [
			{
				"comment_id": 80,
				"body": "This guy was fired/resigned after this video came out, but it's safe to too assume that this only happened because he was caught. He will be replaced with someone else with the same views. \"Take their children away\"",
				"added": 1610601095
			}
		],
		"1610353747_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 81,
				"body": "Mozilla has become censorship-nazis and won't allow just anyone to publish an extension anymore. It doesn't matter though, you don't need an extension. Just start Zeronet in the background, and use your normal browser (in private mode, of course)",
				"added": 1610601536
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 83,
				"body": "Supporting UBI? The mouse never understands why the cheese is free. They say:\n\n\"Take the vaccine\" You take it\n\n\"Install this app so we can track you\" You install it\n\n\"Get in the box\" You get in\n\nYou will become an obedient slave of the State. The State will become your God",
				"added": 1610604788
			}
		],
		"1610611550_1ASwoyvUC5DBAECJFQ7WqZVazYdo1HKiDp": [
			{
				"comment_id": 84,
				"body": "If someone wanted to provide a serious Zeronet search engine (like Google), then it would need to be compiled and exist outside of Zeronet. I can't see of a way that it could exist entirely in Zeronet given it's decentralized nature (it would be a giant database).",
				"added": 1610622807
			},
			{
				"comment_id": 85,
				"body": "So without a network-wide search engine, there are 2 ways to find content. 1. Get recommended different zites by friends or other people, or 2. Go to listings and simply explore popular sites",
				"added": 1610623002
			}
		],
		"1610637299_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 86,
				"body": "Unfortunately, the Android client doesn't yet seem to be able to add by link",
				"added": 1610709923
			}
		],
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": [
			{
				"comment_id": 87,
				"body": "http://duck.com Search Alternative\nhttp://odysee.com Decentralized Video\nTox or Matrix for Decentralized Chat\nhttp://getaether.net Decentralized Social Network\nhttps://scuttlebutt.nz Decentralized Social Network\nhttp://openbazaar.org Decentralized Buy/Sell Market",
				"added": 1610710553
			}
		],
		"1610676192_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP": [
			{
				"comment_id": 88,
				"body": "Monero and Zcash are more preferable. If you have Bitcoin already, then you can send it through an exchange which will convert it for you.",
				"added": 1610714612
			}
		],
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 89,
				"body": "If a Trump supporter can figure out Zeronet, then they are likely a higher than average caliber individual.\n\nNot all Trump supporters are illiterate Joe's.\n\nJust like Not all Liberals are degenerate homosexuals that want to suck off Obama.",
				"added": 1611316345
			}
		],
		"1611308558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 90,
				"body": "While you're being a good little girl playing candy crush and growing flowers in the absence of law, the mafia will break down your door, kidnap you, and make you into a slave prostitute. Law enforcement is very similar to the mafia. Except that law enforcement is considered the least reprehensible of mafia's.. usually",
				"added": 1611327745
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 91,
				"body": "1.Briar is currently the highest standard of secure communications\n\nPros: P2P, E2EE, Group Chat, LAN only Chat, All Internet Connections Routed Through Tor, Internal Support for Blogs\nCons: Requires Password Login Every Restart, Can't Backup User Data, Doesn't Support Calling, Doesn't Support Pictures or Any File Transfers\n\n2.Jami is the most secure chat app for general users\n\nPros: P2P, E2EE, Supports Calling, Supports File Transfers, Supports Backups, Supports Multiple Accounts\nCons: Only 1 to 1 chat on mobile. Group Chat is still in early development and not fully supported yet\n\n3.Matrix (aka Element) is very secure, but unfortunately not P2P \n\nPros: Decentralized, E2EE, Supports Calling, Supports File Transfers, Supports Backups, Group Chat, Has Public Groups to Join\nCons: Not P2P (which means there are traces of metadata), User Interface Isn't So Friendly To Non-Tech people\n\nI am recently in communications with one of the developers of Jami in an effort to expedite the ability for Group Chat. Any help of Bitcoin donations welcome here:\n3EmsvoqaeEQvoGjoPQzLsLMRjA3A13NAL8\n\nAll of these solutions have superior security to Signal. Choose the solution that works best for your needs. (Telegram is not a secure platform for multiple reasons)",
				"added": 1611332705
			},
			{
				"comment_id": 94,
				"body": "> [simonbellamy](#comment_35_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): Matrix is not decentralized, it is federetad. Your data goes through one and only one server. If it goes down, you're entire system is down. No failover. No backup.-> https://ubinodes.org/portfolio/review-end-to-end-encrypted-chat-server-using-matrix-and-riot/\n\nIt appears you are confusing \"Decentralized\" with P2P. Even in the link you posted, Matrix is listed as a decentralized network. Yes, Matrix is Federated. P2P and Federated are Both types of decentralized networks. I'm sorry to hear about your group server being attacked and taken offline. While your server was compromised, the rest of the Matrix network continued to function. Matrix uses Federated decentralization.",
				"added": 1611504865
			}
		],
		"1599651874_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 92,
				"body": "@nekololi 100%",
				"added": 1611343188
			}
		],
		"1610974197_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 93,
				"body": "@zenanom\nYes. Just regular Zip with a password. No need to over complicate it. Antivirus software doesn't try to crack encryption. Regular Zip encryption is just as strong as any other, they all use AES.",
				"added": 1611428171
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 95,
				"body": "Let's be honest, blacks are the most racist demographic in the USA. Find me a video of a group (3+) of Whites brutally attacking 1 lone Black person. If you can find it, I can give you 1000 videos of the race inverse. Of course, not all Blacks, but compared to other races, they are bred with hate like no other.\n\nIf your parents haven't had \"the talk\" with you about violent blacks, then you have my sympathies.",
				"added": 1611505948
			}
		],
		"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 96,
				"body": "Ironic how he describes being against Authoritarianism and Fascism, while he helps install Authoritarianism and Fascism",
				"added": 1611506463
			}
		],
		"1610656430_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 97,
				"body": "They are stupid. Everybody knows that you're only supposed to buy GoDaddy for the first year of $1.99, and then switch after that, duh!",
				"added": 1611506625
			}
		],
		"1610913965_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": [
			{
				"comment_id": 98,
				"body": "> [zenanon](#comment_97_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): My only issue with Tox is that it uses direct ip connections between peers (or did last time I've used it), so it basically leaks a person's identity.\n\nThis is only the case if you are already connected with that other person. If you are not connected, your IP is cloaked by the Tor network.",
				"added": 1611506837
			}
		]
	},
	"comment_vote": {
		"2_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib": 1,
		"14_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"49_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"36_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1139_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"7_1KMBnDqDvwP1ydqV8Y95r1TXAFePSY2sXw": 1,
		"53_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"5_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"1189_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1G33PWVD6qXmFVSBbJ77HUeoR2DbtdMBpZ": 1,
		"90_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"21_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"4_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": 1,
		"197_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"486_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"43_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"69_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"35_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"3_1LJkuyQtRzD9AJkUE1tAhCVFoLiHTb6AdZ": 1,
		"44_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"12_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"2_1EsY6PtroZ2DyaVt6mTFPtZQqxaJ1hwJG1": 1,
		"498_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1200_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"43_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"546_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"11_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"47_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"49_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"50_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"30_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"1_1JRReFAonxccQRM3AbrGFEEc2VqckGzo56": 1,
		"414_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"10_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE": 1,
		"13_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"4_138JhGhg571ZWe4pA6JecsiDQmR4QvzGLK": 1,
		"86_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"8_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"51_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"15_14JRtW3jByzZEQeEkG9QMXNi2jTKudcotJ": 1,
		"45_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"9_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"489_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"50_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"4_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"57_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"1_1E2fasMYikiiHvrdDfGoFGDonYvLXDKh1a": 1,
		"263_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1420_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"275_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"48_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"1_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"49_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"15_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"5_12YYWsdkATyXJa4epQ8VJibJAh3gRZD24m": 1,
		"449_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"9_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH": 1,
		"2798_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"75_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"74_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"109_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"2602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1162_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"42_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"2803_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2804_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2805_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"41_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"40_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"5_19a2pUJoCuyjWucc83VoUXjNLHoYNZf2Ey": 1,
		"9_12TkoeBiJMGSPoetH8DhErZExjPvVE4x8B": 1,
		"55_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"732_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"17_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"424_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"2_1EnYmaGWU5qxZi23fcPQtzJgcd7gxMCU5C": 1,
		"2820_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"630_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"736_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"734_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"3_1E2fasMYikiiHvrdDfGoFGDonYvLXDKh1a": 1,
		"5_1JT342LZCKfgp8r2FYMruVc2jvFXk3gL24": 1,
		"2830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"23_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"25_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"2816_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"743_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"738_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"2647_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"22_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"27_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"190_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"19_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1_1LqGNexResiFRowJMZ5pd1VvKDBgJA1r3b": 1,
		"45_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"2824_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1Jbcve9XwKT2Ah9TjZ59WFTCHujJENJQPv": 1,
		"11_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"1_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"7_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"13_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_135rBgRJsz349UMDrZ8xbfoZSB44ic7Wt2": 1,
		"30_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"9_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"29_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"1_187BqpUVoQp4ah65wmm4Msk4hL6tqhChLP": 1,
		"7_1E2fasMYikiiHvrdDfGoFGDonYvLXDKh1a": 1,
		"57_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"7_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"83_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"9_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E": 1,
		"2863_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"8_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"9_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"23_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_1CdzLMNaLBVTJtGLj3wFbNZqPP7RPgayDS": 1,
		"1_1PzrPjeEMF1a8onqRp2RPzVvSvDd86LLdH": 1,
		"58_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"2_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": 1,
		"1_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1,
		"39_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"38_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"46_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"15_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": 1,
		"7_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"7_1PzrPjeEMF1a8onqRp2RPzVvSvDd86LLdH": 1,
		"1_1BBUSbTR4dCZJU7dfmZ7d8yynKdmiGoqza": 1,
		"5_12eVhxNAYFPJi5rUnbHwbmKPnqAniJs7SA": 1,
		"5_1Dsw1CpgZiPYkVWLiqrgMJDTyXWEggCg2m": 1,
		"14_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"2878_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"31_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"20_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"13_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": 1,
		"80_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"14_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": 1,
		"764_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"4_1CDMo8F3AQjnZcsXLyf7p4xnNhGDQSUT5E": 1,
		"11_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"41_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"18_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1,
		"28_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"49_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"4_1Ec11mGe5joBoboUH2s2idKHp1YVbzaepq": 1,
		"553_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"4_13fsoiid6fkGt5ANKJWud9UYz2p2nCg4Sr": 1,
		"47_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"32_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"38_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"51_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"23_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"1_1GhJcGjryaQ8s6CL5vraeUd15TiXCvY9m2": 1,
		"5_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": 1,
		"98_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"41_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"14_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6": 1,
		"15_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"10_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1,
		"13_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6": 1,
		"2_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": 1,
		"64_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"54_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"36_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"24_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1
	}
}