{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1597601766,
			"title": "balancer73's zites (Unlimit Talk etc)",
			"body": "Hi!\n\nBalancer73, the owner of several ZeroNet forums, died 1.5 years ago. Here in ZeroNet, his forums keep running without any support, hosting and maintenance, as intended according to the network design. But some maintenance is desirable sometimes.\n\nI have access to the private keys of some sites of him, so I'm able to manage those. So if you have any problems, bugs or suggestions for improving the sites, feel free to contact me.\n\nCurrently, I raised the limits on the following sites:\n\n* [Unlimit Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/): 2000k -> 3000k\n* [DIY Talk](http://127.0.0.1:43110/1diyHbGrjKR65DLVpaLoMYsiwqiQYskKD/): 200k -> 500k\n* [Music Talk](http://127.0.0.1:43110/1HidBY8MhvfnGJNPcuh47TCfbK25VvdzzY/): 200k -> 500k\n* [ZeroNet Ideas Talk](http://127.0.0.1:43110/1ideasVz3NzYp24L2tzkt6Prp81xqmTJv/): 200k -> 500k\n\nI'll also update the forum engine later and add some more cross-forum navigation. Not sure if it is the near future, since I have not much free time.\n\nPlease also report any troubles related to incompatibilities between the forum engine and the current or upcoming ZeroNet releases. I'll try to fix those first.",
			"added": 1597601765
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1597601766_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 1,
				"body": "> [topnet](#comment_23_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): where did you get the keys of the Russian user ?\n\nI contacted the admins of www.airbase.ru. And they contacted his family, I guess.",
				"added": 1597603564
			},
			{
				"comment_id": 2,
				"body": "> [anshorei](#comment_150_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Weird story. Did they have a reason to trust you or were they just unaware of what one could do with those keys?\n\nThey did.\n\nJust go further and ask yourself if you have a reason to trust balancer73 in the first place. Maybe he was like just an officer of a Russian intelligence service. And I am an officer on the same position now.\n\nCome on, guys, you (we) all here are visiting hundreds of random zites owned by random people, so those run some random JS shit in your browser without any protection. And now you ask such stupid questions. Are you fucking serious?",
				"added": 1597638439
			},
			{
				"comment_id": 3,
				"body": "> [anshorei](#comment_151_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): [...]\n\nFor balancer73, the main idea of ZeroNet was not cryptography, but sharing of the information and keeping the data forever without need of any central server. He worked on designing a decentralized network that would be more FidoNet-like, compared to ZeroNet. He tried to find a way to integrate ZeroNet with his own clearnet forums as well as with some federative networks such as Mastodon etc.\n\nI'm pretty sure he wouldn't mind that I do some support for his forums here in the same way as volunteers support his forums in the clearnet.",
				"added": 1597643646
			}
		]
	},
	"comment_vote": {}
}