{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> why I must use the selected ID providers in order to appear on everyone's list? (Note: this limitation is set by ZeroMe's user registry) Where is the decentralization promised by ZeroNet the thing itself?\n\nLimiting ID is to avoid spamming, there are already more than 10,000 users (and files...) in the site, if accepts KaffieID, it can be disaster.\n\n> For me myself, I used up 30k out of the 48k limit set by SunHub and this is the only hub shown on first registration.\n\nEven setting hub limit to 48k, one hub is still very quick to reach 10M limit, which then makes the hub slow to load and sync. ZeroMe has been pulished for about one year, and there are already 6 hubs. Nofish said he would [write a plan for it](/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/1500719674).\nHe also plans to implement archive function, so when a site is too big, old files will be automatically archived as optional file and can be loaded to view old posts.\n\n> Besides the limitation described above, since anyone can join these hubs, malicious users can just replicate themselves a lot and start bombing these unlimited hubs to quickly grow the size to make it completely impossible to synchronize and download these sites.\n\nQuite some designs is for avoiding spamming, that's unfortunate in reality, though there may be some better solution. Also I agree that ZeroMe is not quite federated, Therefore it's not the destination for making a perfect decentralized social network :)",
			"post_id": 5,
			"date_added": 1509350646
		},
		{
			"comment_id": 2,
			"body": "And in my experience there are really not many active users on ZeroMe that reach 48k. I never ask Nofish to extend my limit and it's auto-extended... I can just say: senpai is looking at me XD\nMaybe Nofish or some moderators (but there is no moderator in the content.json...) have created a script to detect who is reaching limit and manually (or with an algorithm to distinguish spammer and normal user and automatically) add limit for the user.",
			"post_id": 5,
			"date_added": 1509351689
		},
		{
			"comment_id": 3,
			"body": "> [geekless](#comment_3_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): I doubt if we need a social networking site at all.\n> ... The only thing that should be centralized is a \"global zeronet crawler\"\n\nAgree. ZeroHello is somehow a very nice social network homepage. A global zeronet crawler will be awesome.\nStill not all people use crawler and search engine to discover things (and not everyone want to be indexed, Google is good, Google is evil...), we need various solutions to improve discoverability and keep the community active and sustainable. But maybe a very successful (and not decentralized) zite can also make ZeroNet die, e.g. because of Facebook the Internet is dying.\n",
			"post_id": 5,
			"date_added": 1509353492
		}
	],
	"comment_vote": {},
	"post_vote": {
		"5": 1
	}
}