{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Методы мышления Шерлока Холмса: дедукция и индукция",
			"body": "Все мы люди разумные, следовательно, мы можем мыслить и делать логические выводы, совсем не давно мы обсуждали важность    [грамотного предоставления информации о себе в сети](http://127.0.0.1:43110/16cJcFKPEw9hUr8orBLnvKc5RboDgzMu3Q/?Post:2:%C2%AB%D0%93%D0%BE%D0%BB%D0%BE%D1%81%D0%BE%D0%B2%D1%8B%D0%B5+%D0%BE%D1%82%D0%BF%D0%B5%D1%87%D0%B0%D1%82%D0%BA%D0%B8%C2%BB+%D0%BD%D0%BE%D0%B2%D1%8B%D0%B9+%D0%B2%D0%B8%D0%B4+%D0%BF%D0%B0%D1%80%D0%B0%D0%BD%D0%BE%D0%B9%D0%B8), и задели темы дедукции, ноне которые наши читатели не совсем осведомлены с этим видом мышления, по этому сегодня мы поговорим о дедукции. Как всем известно, популяризовал метод дедуктивного мышления сэр Артур Конан-Дойль, а точнее его выдуманный персонаж — Шерлок Холмс. Парадокс в том, что великий сыщик использовал не один, а сразу два вида мышления, дедуктивный метод мышления и индуктивный.\n\nЧто же это такое?\n\nДедукция — это метод мышления, основным условием которого является положение, сделанное на основании логического вывода из общего, возможно не связанных между собой. Например, у Ивана остановилось сердце, сердце главный орган человек, без него он не может жить, следовательно, если сердце не работает, то Иван мёртв.\n\nС дедукцией мы разобрались, переходим к индукции.\n\nИндукция — метод мышления, основным условием, которого является общее, вывод сделан на основании логического пути от частного положения. Например, каждую зиму Вася пьёт, Вася сейчас пьёт? Да, пьёт, Значит сейчас зима :)\n\nВидите, элементарно, Ватсон!\n\nВажно ли это и можно ли это применять в жизни подобные методы мышления?\n\nКонечно не надо быть сыщиком или детективом, а того хуже следователем, чтобы научиться мыслить данными «невероятными» способами мышления, они могут пригодиться нам в любое время. С помощью своей головы Вы сможете получать очень большое количество информации и использовать её, так как выгодно Вам.\n\nДля осуществления данного виды умозаключений необходимы всего две вещи — сосредоточенность и наблюдательность.\n\nСкорее всего Вы будете просто наблюдать за людьми, или следить за обстоятельствами какого-либо дела, самое трудное в этом, понять, что в реальности нет места догадкам и предположениям, только факты. Большинство новичков совершают одни и те же ошибки, не верно интерпретируют факты, либо выдают предположения, которые абсолютно никак не относятся к логике.\n\nУ Вас появились определённые факты какого-либо происшествия, Вы должны не строить догадки и гадать на лютиках, а совершить строгий анализ, все Ваши версии должны быть построены только на фундаменте логичных умозаключений, с исключением всех неподходящих вариаций, затем Вы выберете один — самый подходящий под факты.\n\nПомимо этого Вам необходимо быть довольно разностороннем человеком, если Вы пытаетесь сделать какие-либо выводы о человеке, то Вам придётся сделать выводы о его материальном достатке, это можно сделать по его одежде, автомобилю, гаджетам, но ведь он может вводить Вас в заблуждение ?  Придётся научиться отличать сказку от истины.\n\nДопустим, Вы идёте домой, в любое время дня и ночи, Вам на встречу выходит мужчина, на голове кепка, спортивные штаны, кроссовки, спортивная куртка, всё это фирмы Adidas, в зубах сигарета, в руке бутылка пива, парень не брит, физической формой хорошей не обладает, ещё до разговора с ним Вы в своей голове сделали вывод, что он гопник?\n\nА почему?",
			"added": 1492069816
		}
	],
	"topic_vote": {
		"1_1HvraQzSVUU6TKffYzvCzEXYYjXPAZ3nkW": 1,
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "[ТЫКЬ](http://127.0.0.1:43110/16cJcFKPEw9hUr8orBLnvKc5RboDgzMu3Q/)",
				"added": 1492073171
			}
		]
	},
	"comment_vote": {
		"1_1HvraQzSVUU6TKffYzvCzEXYYjXPAZ3nkW": 1
	}
}