{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 1,
				"body": "Właśnie o to im chodziło, zabić niezależną komunikację. To użytkownicy są sami sobie winni. Bo nie potrafili uszanować tego co mają. Teraz jest właśnie egzamin dla pozostałych, klientów ZeroNeta? Tak długo jak jeszcze są włączone komputery, To Zero żyje. Może jeszcze powstać jak Feniks z popiołów, i wzlecieć w powietrze. To od reszty użytkowników zależy, czy Gady znowu odtrąbią sukces. Pozdrawiam. \n............................................................................\nThat's what they wanted, to kill independent communication. The users are to blame. Because they couldn't respect what they had. Now there's an exam for the other ZeroNet clients? As long as the computers are still on, zero lives. He may yet rise like a phoenix from the ashes, and fly into the air. It's up to the rest of the users if the reptiles are going to succeed again. Greetings.",
				"added": 1624842295
			},
			{
				"comment_id": 2,
				"body": "Everyone wants change at ZeroNet. Do I get the feeling that none of you are learning history? Anything new is worse than the first. In fact, all the improvements are going in the wrong direction, or are we being controlled? And remote-controlled? Who's controlling us, trying to get us into the field? Is this really a coincidence???Blaming China for this is ridiculous, and grossly exaggerated. There's an evil spirit in our midst, doing the devil's work. I wish I was wrong. I have a question for you poles? What do you think? Greetings.\n..................................................................\nWszyscy chcą zmian w ZeroNecie. Mam wrażenie że nikt z was się nie uczy historii? Wszystko co jest nowe, Jest gorsze od tego co Było pierwsze. W zasadzie wszystkie ulepszania idą w złym kierunku, Czy my jesteśmy kontrolowani? I sterowani zdalnie? Kto nami steruje, i stara się nas wyprowadzić w pole? Czy to jest na pewno przypadek???Obwinianie o to Chiny jest śmieszne, i mocno przesadzone. Wśród nas jest zły duch, Który robi krecią robotę. / chciałbym się mylić /. Mam pytanie do was Polacy? A co wy na ten temat myślicie? Pozdrawiam.",
				"added": 1624886951
			},
			{
				"comment_id": 3,
				"body": "A mistake in the art of independent thinking? There is a great limitation of independence in thinking independently.There's only one conclusion. who do you work for? And who pays you? ZeroNet fell just for the likes of you.\n...................................................\nBłąd w sztuce samodzielnego myślenia? Widoczne jest duże ograniczenie samodzielnosci w myśleniu samodzielnym.Wniosek jest tylko jeden, Dla kogo pracujesz? I kto tobie płaci? ZeroNet upadł właśnie prez takich jak Ty.",
				"added": 1624996747
			},
			{
				"comment_id": 6,
				"body": "Fantasy knows no bounds???\n.............\nFantazja nie zna granic???",
				"added": 1625088862
			}
		],
		"1625081391_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 4,
				"body": "Is that a good idea? Just how do you get someone to write? Like he already has trouble reading. most of the visitors are secondary illiterate. This effect contaminates the mind with compounds of aluminum and mercury, these are living corpses. Bio-robots, why don't he watch the video? But write something? This is beyond his manual capabilities.Greetings.\n.........................................................\nPomysł jest dobry? Tylko jak kogoś przekonać do pisania? Jak on już ma problemy z czytaniem. większość odwiedzających to analfabeci wtórni. To skutek skażenia umysłu związkami aluminium i rtęci, To są żywe trupy. Bio -roboty, Filmik to może i obejrzy? Ale coś napisać? To przekracza już jego zdolności manualne.Pozdrawiam.",
				"added": 1625086844
			},
			{
				"comment_id": 5,
				"body": "Those who are will stay, I hope? You mean the ones who don't have them anymore?They should be here. It's also about attracting new people, in the whole sense of the word. Why is it so hard to reach normal people??? Greetings.\n..................\nCi co są to zostaną, taką mam nadzieję? Chodzi o tych co już ich niema?A powinni tutaj być. Chodzi też o przyciągnięcie nowych ludzi, w całym tego słowa znaczeniu. Dlaczego tak trudno dotrzeć do normalnych ludzi??? Pozdrawiam.",
				"added": 1625088709
			},
			{
				"comment_id": 7,
				"body": "I support all statements. Simplifying ZeroNet will take control of it. Greetings.\n...........................\nPopieram wszystkie wypowiedzi. Uproszczenie ZeroNeta, spowoduje przejęcie kontroli nad nim. Pozdrawiam.",
				"added": 1625142054
			}
		],
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "That's the explanation; it's chemitrals and poisoned food. This causes mental retardation, and as a result, there is a lack of the concept of independent thinking. ZeroNet is becoming too high a threshold to jump, what for some? greetings.\n........................................\nTak jest wytłumaczenie; To są chemitralsy i zatrute jedzenie. To powoduje ociężałość umysłową, i na skutek tego następuje brak koncepcji myślenia samodzielnego. ZeroNet staje się za wysokim progiem do przeskoczenia, co dla niektórych? pozdrawiam.",
				"added": 1625330071
			},
			{
				"comment_id": 10,
				"body": "Prepare for major maneuvers on the cut. it's happening; not yet this month.\n.................................................\nPrzygotowania do wielkich manewrów na ukrojonej. to się dzieje; Jeszcze w tym miesiacu",
				"added": 1625619208
			},
			{
				"comment_id": 11,
				"body": "A few thousand soldiers will practice???Ukraine.\n........................................\nParę tysięcy żołnierzy będzie ćwiczyło???Ukraina.",
				"added": 1625630314
			}
		],
		"1625602818_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "Look at this address you wrote down? Where does he direct a potential client??? What do you associate with, play and Google? You want to buy something neutral?\nAre you going to a drug dealer??? Are you being logical? How much is your advice worth? And your invention.\n://play.google.com/store/apps/details?\n...............................................\nPopatrz sobie na ten adres, który wypisałeś?  Gdzie on kieruje potencjalnego klienta??? Z czym tobie się kojarzy, Play i Google? Chcesz coś neutralnego kupić? \nA  idziesz do dilera narkotyków??? Czy ty się logicznie zachowujesz? Ile jest warta twoja porada? I twój wynalazek.\n ://play.google.com/store/apps/details?",
				"added": 1625610849
			}
		],
		"1628411219_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 12,
				"body": "They've all been put to sleep, and they're unconscious. Is that a first? And secondly, the censorship that has taken place on other sites, forums, is an insurmountable topic. They don't allow us to talk freely anymore. everything is under control. Now all we have to do is keep this platform as long as we can. How do the vaccinated die? then maybe normal people will come back.\n...........................................................................\nWszyscy zostali uśpieni, i są nieprzytomni. To po pierwsze? A po drugie; Cenzura jaka zapanowała na innych stronach, forach, jest tematem nie do przeskoczenia. Nie pozwalają swobodnie już rozmawiać. wszystko jest kontrolowane. Teraz pozostaje tylko, utrzymać tą platformę, tak długo, jak tylko się da. Jak umrą zaszczepieni? to być może powrócą normalni ludzie.",
				"added": 1628416370
			},
			{
				"comment_id": 13,
				"body": "ZeroNet is good, so why not use it? Of course, this is the old version, which is the most convenient and friendly to the environment. But someone has already changed it, and improved it to the detriment of the environment. I quote;\" wedding, Wyspianski \" did you Hama golden horn? end quote.greetings.",
				"added": 1628438648
			},
			{
				"comment_id": 14,
				"body": "Clear net, does not block; because it is a different system. This internet has nothing to do with that internet.It can't be blocked. He's working on another level. That's why he has the advantage.",
				"added": 1628448629
			},
			{
				"comment_id": 15,
				"body": "The thing is simple; one internet is controlled by the system, and the other internet is out of control; / not quite true/. But here you can just say something already without censorship, and fears about the removal of this material. That's all you can get right now. All apps that guarantee anonymity? This is a total fool's errand. Greetings.",
				"added": 1628489061
			}
		],
		"1628678940_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "If you know the construction of the track, and who manages it? Does he have a hand in this invention? How is it built? Who's funding it? Then you wouldn't be so enthusiastic about this invention. He's controlled.",
				"added": 1628682048
			},
			{
				"comment_id": 17,
				"body": "Gentlemen, I explain what follows; in this world everything is under control, it is not my invention.There are no security patents. Third parties who want to serve your securityen, it's pure literary fiction. I've checked it many times. Safe communication is when you two sit on a park bench and talk face-to-face without phones. Can you make tracking difficult? But you can't create a public communicator that's safe. Theoretically, this can be done, but practically \"no\", it is possible. Greetings.",
				"added": 1628757930
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 18,
				"body": "There is no equivalent; it is a CIA construct, on China. It's made well, that was the purpose of the invention.Everything else is done under the control of the services. Zero was not designed to serve Europe. It's a project against Asia. For some reason, it was withdrawn. The attempt to discourage users, too, did not quite succeed? So zero, he's still alive.Greetings.",
				"added": 1628858129
			},
			{
				"comment_id": 19,
				"body": "How do they scan 60% of windows? Then they'll take Linux. The problem is that Linux-siars are a little smarter. this does not apply to everyone on Linux.",
				"added": 1629028131
			}
		]
	},
	"comment_vote": {}
}