{
	"next_topic_id": 4,
	"topics": [
		{
			"topic_id": 1,
			"title": "How to build my own Zero Site?",
			"body": "Like the topic says, Is there any tutorials to show how to build an interactive website on the ZeroNet?\n\nThis is pretty cool.",
			"added": 1435252365
		},
		{
			"topic_id": 2,
			"title": "ZeroNet Anonymity",
			"body": "How can you access ZeoNet anonymously?",
			"added": 1435271819
		},
		{
			"topic_id": 3,
			"title": "This is not decentralized.",
			"body": "You say this is a decentralized site, but you make a post to a central server: \"http://demo.zeronet.io/ZeroTalk/signup.php\"\n\nAre there plans to really make this truly decentralized? This site can be taken down just by removing that server.",
			"added": 1435273866
		}
	],
	"next_message_id": 10,
	"comments": {
		"1@230": [
			{
				"comment_id": 1,
				"body": "Awesome, thanks for the link nofish.",
				"added": 1435263518
			}
		],
		"3@230": [
			{
				"comment_id": 2,
				"body": "nofish, I was thinking that you could build an admin section that would require a private key to verify a string that changed  like they do on ELIGIUS BitCoin pool (eligius.st) to validate your account to access the DB to make modifications to the DB, and moderate users. Would that work?\n\nDude, Congratulations on this website, it is very smooth. Zeronet is very interesting, and I'm very excited to see where this can go.\n\nI found Zeroid (http://127.0.0.1:43110/zeroid.bit) and looks pretty good. I have my ID created and ready for you to make the change. hehe",
				"added": 1435275305
			}
		],
		"3@2": [
			{
				"comment_id": 3,
				"body": "SCALE, SCALE, SCALE... We need torrent-like, file splitting for big file support, I think this is critical for splitting databases and updating the part that changed and not the whole thing.. We seriously need this to be able to scale...",
				"added": 1435285531
			},
			{
				"comment_id": 4,
				"body": "Tipping, and easy bitcoin spending functions.",
				"added": 1435285575
			},
			{
				"comment_id": 7,
				"body": "> [ezekiel](#comment_3_219): @QuickSilver - I'm under the impression file transfers are directly via peer, file by file. Torrents work by file pieces which current do not respect the boundary of files (file piece is a fixed size except for last file piece in the torrent). I think the same issue has been a struggle for Project Maelstrom as well. Their streaming or downloads of large files are not being sent efficiently. Maybe updated content could utilize rsync so only the deltas are sent rather than entire new files. I'm not sure how ZeroNet works in this respect, so they may already be doing this... I know large files and large sites are not well supported in ZeroNet. I have impossible time trying to stream MP4 nor trying to download 3GB Mozilla Dev Network.\n\nezekiel, Thanks for the quality reply. That makes sense....",
				"added": 1435294747
			},
			{
				"comment_id": 8,
				"body": "ZeroNet email system... The first P2P emailing would be amazing.",
				"added": 1435294915
			}
		],
		"1@38": [
			{
				"comment_id": 5,
				"body": "nofish just started a [tutorial on ZeroBlogand](http://127.0.0.1:43110/blog.zeronetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1) all site's source code avalible on github.",
				"added": 1435292739
			}
		],
		"1@242": [
			{
				"comment_id": 9,
				"body": "This is the closest thing to a Wiki as I could find: http://zeronet.readthedocs.org/en/latest/\n\nIt would be cool to have a Wiki page hosted on ZeroNet..",
				"added": 1435794307
			}
		]
	},
	"topic_votes": {
		"3@230": 1,
		"2@230": 1,
		"3@2": 1
	},
	"comment_votes": {
		"141@2": 1,
		"140@2": 1
	}
}