{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1569779844,
			"title": "Zionist leader dies.",
			"body": "David Wolfsohn was once chairman of International Commitee. \n\nLondon, Sept 16 - Word has been received in London from Hamburg of death of David Wofsonh, the well-know Zionist, who was at one time Chairman of the International Zionist Committee.\n\nDr. Wolfsohn made the opening and closing speeches at the international Zionist Congress held at The Hague in 1907. In his closing address he pleaded for greater unity among the Jews and said that eventually they must conquer the world. \n\n[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]\n\nRobert Wilton, Russia's Agony (1918)\n\nIt's in the Central Committee of the Bolshevik Party the rests the power; now here is its composition in 1918:\n\nBronstein (Trotski), Apfelbaum (Zinoviev), Lourie (Larine), Ouritski, Volodarski, Rosenfeldt (Kamenev), Smidovitch, Sverdlof (Yankel), Nakhamkes (Steklof). JEWS .............. 9\n\nOulianov (Lenin), Krylenko, Lounatcharski. RUSSIAN ...........................................3\n\nThe other socialist \"Russian\" parties are in the same situation. Here are their central committees: S.D. mensheviks: 11 members, all Jews; Communists of the People: 6 members, of which 5 are Jews, 1 Russian; S.R. (right), 15 members of which 13 Jews, 2 Russians (Kerenski - unless he has a Jewish origin - and Tchaikovski); S.R. (left) 12 members, of which 10 are Jews, 2 Russians; Committee of Anarchists of Moscow, 5 members of which 4 Jews, 1 Russian; Party of the Polish District, 12 members all Jews including Sbelson (Radek), Krakhmal Zagorski and Schwartz (Goltz).\n\nThese parties, so-called of opposition, work more or less openly with the Bolsheviks, blocking the Russians. Of 61 individuals heading these parties, there were 6 Russians and 55 Jews. Whatever the label, a revolutionary government will Jewish.\n\nHere the Revolutionary Council of the People: Oulianof, (Lenin), president, Russian; Tchitcherine, Foreign Affairs, Russian; Lounatcharski Public Education, Russian; Djougachvili, Nationalities, Georgian; Protian, Agriculture, Armenian; Lourie (Larine), Economic Council, Jew; Schlichter, Food Supplies, Jew; Bronstein (Trotski), War and Navy, Jew; Lander, State Control, Jew; Kauffman, Public Land, Jew; Schmidt, Labor, Jew; E. Lilina (Knigissen), Public assistance, Jew; Spitzberg, Religion (Cults), Jew; Apfelbaum (Zinovief), Interior, Jew; Avelt, Hygiene, Jew; Isidore Goukovski, Finances, Jew; Volodarski, Press, Jew; Ouritski, elections, Jew; I. Steinberg, Justice, Jew; Fenigstein, Refugees, Jew; Savitch and Zaslavski, his assistants, Jews. Of 22 Members, 3 Russians, 1 Georgian, 1 Armenian, 17 Jews.\n\nHere is the Central Executive Committee:\n\nY. Sverdklof, president, Jew; Avanessof, secretary, Armenian; Bruno, Letton; Breslau, Letton; Babtchinski, Jew; Boukharine, Russian; Weinberg, Jew; Gailiss, Jew; Ganzburg, Jew; Danichevski, Jew; Starek, German; Sachs, Jew; Scheinmnn, Jew; Erdling, Jew; Landauer, Jew; Linder, Jew; Wolach, Czech; Dimanstein, Jew: Encukidze, Georgian; Ermenn, Jew; Ioffe,Jew; Karkhline, Jew; Knigissen, Jew; Rosenfeldt (Kamenef), Jew; Apfelbaum (Zinovief), Jew; Krylenko, Russian; Krassikof, Jew; Kapnik, Jew; Kaoul, Letton; Oulianof (Lenin), Russian; Latsis, Jew; Lander, Jew; Lounatcharski, Russian; Oeterson, Letton; Peters, Letton; Roudzoutas, Jew; Rosine, Jew; Smidovitch, Jew; Stoutchka, Letton; Smiltch, Jew; Nakhamkes (Steklof), Jew; Sosnovski, Jew; Skrytnik, Jew; Bronstein (Trotski), Jew; Teodorovitch, Jew; Terian, Armenian; Ouritski, Jew; Telechkine, Russian; Feldmann, Jew; Froumkine, Jew; Souriupa, Ukrainian; Tchavtchevadze, Georgian; Scheikmann, Jew; Rosental, Jew; Achkinazi, Imeretrian; Karakhane, Karaim; Rose, Jew; Sobelson (Radek) Jew; Schlichter, Jew: Schikolini, Jew; Chklianski, Jew; Levine (Pravdine), Jew;.\n\n62 Members, 5 Russian, 6 Lettons, 2 Germans, 1 Czech, 2 Armenians, 2 Georgians, 1 Imeretian, 1 Karaim, 1 Ukrainian, 41 Jews.\n\nHere now are the members of the Extraordinary Commission of Moscow:\n\nDzerjinski, president, Pole; Peters, vice-president, Letton; Chklovski, Jew; Zeistine, Jew; Razmirovitch, Jew; Kronberg, Jew; Khaikina, Jewess; Karlson, Letton; Schaumann, Letton; Leontovitch, Jew; Rivkine, Jew; Antonof, Russian; Delafabre, Jew; Tsitkine, Jew; Roskirovitch, Jew: G. Sverdlof (brother of the president), Jew; Biesenski, Jew; Blioumkine (murderer of Count Mirbach), Jew; Alexandrovitch (accomplice of the preceding) Russian; I. Model, Jew; Routenberg, Jew; Pines, Jew; Sachs, Jew; Jacob Goldine, Jew; Galperstein, Jew; Kniggisen, Jew; Latzis, Letton, Daybol, Letton; Suissoune, Armenian; Devlkenen, Letton; Liebert, Jew; Vogel, German; Zakiss, Letton; Schillenkuss, Jew; Janson, Letton; Kheifiss, Jew;\n\nIn all, 36 with 1 Pole, 1 German, 1 Armenian, 2 Russians, 8 Lettons, 23 Jews.\n\nNo need then to be surprised of the Jewish complicity in the murder of the Romanof family. The absence of such a complicity would have been astonishing.",
			"added": 1569779843
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 1,
				"body": "reichardnixon Lmao. America has only ever been in one legitimate war and we won. \n_____________________________________________________________________\nYou mean when kike roosvelt and international JUDEA need destroy Germany, Italy and Japan, countries which stand and fight commies kikes? That's great victory, cock. \n\nEnjoy niggers, pedos, kikes communism in jewmerica. You already lost, first free speech agreement and you can't say nigger in tv.  You have to hide your fucking ass here, because some kike cop would jail you if you say something on jewnet what kikes don't like, you free speech dick in free speech nation. \n\nMore like free kikes and free niggers nation and goy cattle subhuman whites, only for working and sending white bitches to fuck niggers and kikes in kikes porn. And die for kikes Great Israel shithole. \n\nSecond agreement yet you can't have full auto AR-15. You will loose your AR, pistols and shootguns too in next years. \n\nYou already lost you american idiot and you helped destroy white race for kikes. Dicks. \n\nEnjoy communism. \n\nAnd niggers.",
				"added": 1571210931
			}
		]
	},
	"comment_vote": {}
}