{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 1,
				"body": "I'd rather be on a platform where the crazies are in plain view, than one where they're algorithmically (is that even a word?) throttled, shadowbanned, censored or outright banned. That behavior leads to people going dark, like truly dark and we won't know what kind of crap they're up to.\n\nI'm completely new on ZN, but it seems that here I can tell some of the freaks to their face (so to speak), that they're disgusting and move on with my day.\n\nYou want people to be monitored? OK, fine. If someone is showing behavior that warrants a watchful eye, go for it. Hopefully you'll be content with that and not start advocating for arresting people for pre-crimes as well. I hear legislators in a few places want Minority Report to be real life.\n\nI'll be fine though. I know how to use the sea shells.",
				"added": 1606270337
			}
		],
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 2,
				"body": "15 years ago Alexa wouldn't sell, anywhere. Now that people are used to sharing their most personal issues with others on social media and having been spoonfed conveniences like sharing contacts with other services, etc. they've been desensitized to the notion of where privacy begins and ends. Even the Equifax catastrophe wasn't enough to rile people up.\n\nI think you're right about the immediate pain response. If enough people get burned - or the right people, things will change, but as long as there's billions to be made, you're probably going to need a lot of candles.",
				"added": 1606271020
			}
		]
	},
	"comment_vote": {
		"498_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"55_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1_1KnGxS2ij8nfG2qxbrQ6Xz91nBU7XGCYri": 1,
		"15_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"19_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1
	}
}