{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1_1arLQ9zeg1KzAQMJn8YVwtAX6LhXJkG2d": [
			{
				"comment_id": 1,
				"body": "Pozdrawiam;\nPrzyszłość internetu tutaj jak i tam.\nPozwoli nam normalnie rozmawiać.\nPozdrawiam.\n\nС уважением;\nБудущее Интернета здесь и там.\nЭто позволит нам нормально разговаривать.\nС наилучшими пожеланиями.",
				"added": 1579636038
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 2,
				"body": "Собаки лают задницами. Для тех же детей и детских проблем.\n.\nPsy dupami szczekają. Do tego same dzieci, i problemy dziecinne.",
				"added": 1601146126
			},
			{
				"comment_id": 4,
				"body": "Илон Маск, это смерть и рабство для вас. Он хуже Гитлера. Он станет гибелью всего человечества. Он убьет хороших парней и убьет троллей в Интернете.\n.\nElon Musk, to śmierć i niewola dla was. On gorszy od hitlera. On przyniesie zgubę całej ludzkości. Zabije tych dobrych, zabije też trolli, w internecie.",
				"added": 1602371588
			}
		],
		"1_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 3,
				"body": "Навальный - это замещающий предмет, который отвлекает внимание от реального предмета. А это газопровод «Северный поток». Похитители лошадей стараются изо всех сил. Они не хотят, чтобы строительство закончилось. Потому что Германия станет независимой.\n.\nNawalny, to temat zastępczy, służy dla odwrócenia uwagi od właściwego tematu. A jest nim rurociąg z gazem.Nord,Stream. Koniokrady przeszkadzają jak mogą. Nie chcą dopuścić do ukończenia budowy. Bo Niemcy staną się niezależne.",
				"added": 1602352327
			}
		],
		"2_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 5,
				"body": "Это все западные СМИ.\nМожет что-то с востока?\nЛюбое предложение.\nЧто-то русское.\n.\nTo wszystko to zachodnie media. \nMoże coś ze wschodu?\nJakaś propozycja. \nCoś Rosyjskiego.",
				"added": 1606224903
			},
			{
				"comment_id": 10,
				"body": "jk7, - Мудрые слова, которые я поддерживаю.\nПора сделать это.",
				"added": 1610763446
			},
			{
				"comment_id": 11,
				"body": "123548, - \n. Здравствуйте;\n.\n*И куда подевались украинские гении теперь?*\n.\nВ черной заднице.",
				"added": 1610763701
			}
		],
		"1_12dAnS5wgcFCUEijJ69oibEABDtbHi2SEM": [
			{
				"comment_id": 6,
				"body": "Я согласен только с тем, что мой собственный патент может обеспечить некоторую безопасность.",
				"added": 1606529973
			},
			{
				"comment_id": 9,
				"body": "Видимо кому-то нужно сильное шифрование? не слабый. Например, -PGP или GPG. Собственный ключ и открытый ключ. 2048, - и более.",
				"added": 1610535297
			}
		],
		"2_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 7,
				"body": "Я могу согласиться с этим тезисом, в этом есть смысл.\nАнархия просто не имеет смысла для правителей.",
				"added": 1607580165
			}
		],
		"1_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 8,
				"body": "Этот адрес не работает?",
				"added": 1607580560
			}
		],
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": [
			{
				"comment_id": 12,
				"body": "Хороший вопрос? И ответ довольно прост; Эта система в меру своих возможностей независима.\nЭто затрудняет управление людьми. Недостаточное понимание информатики. Здесь тоже действуют враги свободы слова. Ex; Улучшения, опустошающие ZeroNet.\nВода, которая заливает нашу квартиру. В результате мы отказываемся от этой квартиры и переезжаем в другое место.\nМы выезжаем туда, где есть навороты. Там проще управлять системой, которая находится под контролем.\nХотите интересного? Киньте себе что-нибудь интересное.\nВсе ждут звезду с небес.\n.\nПриветствия.\n.\n/ был использован переводчик /.",
				"added": 1610865038
			},
			{
				"comment_id": 13,
				"body": "Мы должны организовать это сами; я начал с смены переводчика. Вместо google я с сегодняшнего дня использую Яндекс. Лучшее понимание. Это всего лишь переводчик, но мое самочувствие стало комфортным. Теперь я смогу больше писать с пониманием.С уважением.",
				"added": 1612123963
			},
			{
				"comment_id": 15,
				"body": "Много людей; ZeroNet хорошо работает.У многих людей могут возникнуть новые хорошие знакомства. Много людей, это разные интересы, которые не ограничены.Много людей, это более высокий уровень интеллектуального обслуживания свободного интернета.\n..............................................\nDużo ludzi; ZeroNet dobrze działa.Dużo ludzi to mogą powstać nowe dobre znajomości. Dużo ludzi, to różne zainteresowania, które nie są ograniczone.Dużo ludzi, To wyższy poziom intelektualny obsługi wolnego internetu.",
				"added": 1613295959
			}
		],
		"1_1JgRY7hLgQja96zGEjnbcTRT8MTT35B4Gf": [
			{
				"comment_id": 14,
				"body": "Темная сеть, плохо ассоциируется. Люди думают, что там не знают, что происходит? Это был ответ на цензуру и шпионаж за людьми.",
				"added": 1612124210
			}
		],
		"1_15UbkF42UTPuFGbvHgeGMm2mFfnoYEqCZ3": [
			{
				"comment_id": 16,
				"body": "Потому что он хочет остаться анонимным в интернете. Я хочу сказать, что я думаю? Но я не хочу, чтобы за мной следили и следили. Все порталы отслеживаются и находятся под наблюдением. Контролируется.",
				"added": 1618609152
			},
			{
				"comment_id": 17,
				"body": "> [geobor](#comment_19_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz): \n\nТак работает Зеронет, такова была идея создания этой структуры. Как выглядит эта ситуация сегодня? Это мы сами видим. Не желая этой забавы, люди стали очень ленивы. Никто не хочет, чтобы дать что-то от себя для других. Полное маразме.",
				"added": 1618609523
			}
		]
	},
	"comment_vote": {}
}