{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1549953207,
			"title": "Jami p2p messenger",
			"body": "The application uses distributed hash tables (DHT) to establish communications. This technology eliminates the use of centralized registers and the retention of personal data. Jami is based on a distributed network technology, allowing it to not use servers that require dependency and that facilitate mass surveillance.\n\nJami stores your secrets (private keys for encryption and identity) only on the machine that executes it, which belongs to you. Your device is therefore the sole holder of your information.\n\nJami offers a digital identity with accounts that do not require anyone exposing their personal identity. All of the communications are encrypted with no exception with the most advanced current techniques. As a free software, Jami is underpinned by an essential objective: to be a distributed communication system that respects the privacy of its users, thanks to its design without infrastructures or centralized servers.\n\n\n\nJami is proud to be and use only free software. Jami is under GPLv3+ license. This founding principle makes it possible to attract as many people as possible from all horizons, to make all the executed code verifiable and therefore provide a healthy community development model.\n\nJami is also officially a GNU package and a high priority project as a result of its integration as a GNU project of the Free Software Foundation.\n\nhttps://jami.net/",
			"added": 1549953206
		}
	],
	"topic_vote": {
		"1548112623_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1549953207_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1548112623_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 1,
				"body": "the most stable version is 1.1.1",
				"added": 1549823751
			}
		],
		"1548968793_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": [
			{
				"comment_id": 2,
				"body": "My blog http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/",
				"added": 1550375595
			}
		]
	},
	"comment_vote": {
		"2_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": 1
	}
}