{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1563139677_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578899506_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1591733013_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1592264885_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1597034762_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	},
	"next_comment_id": 65,
	"comment": {
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 1,
				"body": "A rapist is breaking the law, a voter is fulfilling their civic duty. I honestly don't even see how one would compare the two.",
				"added": 1561899374
			},
			{
				"comment_id": 4,
				"body": "> [atomiserxenolith](#comment_101_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Is it ever right to break the law?\n\nYes, obviously it is right the break the law at times. Are you suggesting that we should legalize rape, and get more people to be rapists?\nIf it weren't for people breaking the law none of us would be here, as our ancestors would have never revolted against evil empires.",
				"added": 1561947713
			}
		],
		"1561935650_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 2,
				"body": "I doubt that the server would DDOS but fake death threats would obviously mess with any data that they might be collecting.",
				"added": 1561936645
			},
			{
				"comment_id": 3,
				"body": "Yourself, you forgot the row of U's, but good try.",
				"added": 1561937484
			}
		],
		"1562025321_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "ZeroNet is opensource so anybody can fork it, making your argument null and void. Also just because one man makes the shots about development that has zero influence on what people are able to host on their zites.",
				"added": 1562031919
			}
		],
		"1562027213_1MgV93D7T7YuQXnPc2to99dFBjJzKEGsgY": [
			{
				"comment_id": 6,
				"body": "There are some funny gifs here:\nhttp://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/",
				"added": 1562035458
			}
		],
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Brave browser, and I think GAB is making or has a dissenter browser.",
				"added": 1562202264
			},
			{
				"comment_id": 8,
				"body": "> [filips](#comment_56_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Brave is based on Chromium. So if Google decide to censor something, Brave will have to follow it, unless they fork Chromium.\n\nThey've already done that, as Google is going to remove the ability for ad-blockers to work. So Brave decided to ship their browser with an ad-blocker built right in.",
				"added": 1562242145
			},
			{
				"comment_id": 9,
				"body": "> [filips](#comment_57_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): They didn't fork Chromium. And Google removed ability for ad blocking only for extensions, and Brave's ad blocker is built in. [...]\n\nI stand corrected. I must have mis-heard somebody talking about it, or they were misinformed and passed on mis-information.  Chromium is open-source however so somebody could fork it if that ever became necessary.",
				"added": 1562248139
			},
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_86_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This is depressing.  So, other than Lynx, what can we use?  I couldn't even get Brave to download to Linux Mint today.  I tried it about a year ago on Linux, and it immediately crashed.   I guess everyone knows the TOR browser is based on Firefox.\n\nI'm using Brave on Linux Mint 19.1 without any issues, just followed the instructions here: https://brave-browser.readthedocs.io/en/latest/installing-brave.html#linux",
				"added": 1562277659
			}
		],
		"1562443357_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 11,
				"body": "Simply put they are all attention whores, and it's easier to take a picture of yourself that actually go out and do something with your life.",
				"added": 1562457713
			}
		],
		"1562661334_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 12,
				"body": "Immigrants should learn English, so I see no reason why this should be in any foreign languages.\n\nAs far as illegal aliens, they should just get a bullet to the head, that would send a strong message to more people trying to illegally enter our country.",
				"added": 1562675778
			}
		],
		"1562568127_1Cu9qgK9V7hFEBueV1SiB46L8AoUHF6mpo": [
			{
				"comment_id": 13,
				"body": "http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1562759705
			}
		],
		"1563092690_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 14,
				"body": "Why don't you all kill yourselves?\nOh look at me, I guess I'm a murdered now... \nYou've got to be a weak individual to actually kill yourself just because somebody says you should. Maybe you should ignore the toxic person, or block them, get a restraining order against them if it take that much. Kids these days just have absolutely no clue.",
				"added": 1563106335
			}
		],
		"1563335551_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 15,
				"body": "Umm, okay.\n\nPro-tip if you want to get help from random people on the internet you should provide more information that just X didn't work.\nWhat version of ZeroNet are you using, were there any error messages, any debug logs. etc.",
				"added": 1563371045
			}
		],
		"1563638106_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "Time to don my tinfoil hat I guess.",
				"added": 1563645487
			},
			{
				"comment_id": 17,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_459_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Time to shut up, above. If you have nothing to say, I wonder what the hell you're doing on something as sophisticated as zeronet, or you went through an back door via facebook or twitter?but anyway just close your 'Fucking Mouth'.\n\nYou can't make me shutup. :P\nFacebook or Twitter having a backdoor into zeronet? I think not, that would be most harmful to either of those sites as they wouldn't be able to control what we see or say.\nBy the way my tinfoil hat comment was about you calling systemd and gnome trojan horses. I mean you may not like them, but just because you don't like something doesn't make it a trojan horse, also you can fairly easily not use Gnome, and I don't think systemd is a hard requirement for Linux, though I could be wrong on that.",
				"added": 1563649072
			},
			{
				"comment_id": 18,
				"body": "> [toyata](#comment_73_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Gnome = Chrome and Android, each one the worst kind of \"opensource\" done by US corporates disguised under community effort. Now with shit like ednlessos you get a complete locked down system with flatcrap on top. Even cloning or forking doesnt remove the fact that Gnome, Chrom, Android cannot be trusted to have many deliberate put in backdoors and their corporates (Redhat and Google) 100% sure signed NDA deals that allows easy access. Keep using that crap, but dont recommend them to anyone but yourself for running anything secure on them. [...]\n\nBeing as paranoid as you are I'm wondering why you are even on the Internet, unless you wrote all the code for every bit of software you are using, and the code for the hardware too, somebody probably can see something about what you are doing. Just get off the grid already, it's the only way to be safe.",
				"added": 1563758731
			}
		],
		"1563985981_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 19,
				"body": "I mean, I prefer to edit my video and photos with a GUI application rather than via the command line, so I'll have to disagree that the CLI is always better than the GUI.",
				"added": 1564023728
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 20,
				"body": "Looks like the code was minified, I don't understand why people do that, as the few kb it might save don't really make it worth while.",
				"added": 1565146608
			}
		],
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 21,
				"body": "Maybe you just have junk internet. I have zero issues with any sites on Zeronet and I'm constantly seeding other files on other networks, absolutely no issues here.",
				"added": 1565149168
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 22,
				"body": "If you read a Bible you'd know that we live in a sin cursed world, and one day God will come back and make all things new.\nAdditionally rain falls on the just and the unjust, which is just another way of saying that God doesn't show favorites.",
				"added": 1565207285
			}
		],
		"1565207629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 23,
				"body": "What kind of dummy is trying to be annon online and then going around and letting people know about the annon stuff they do. If you don't let people know you use ZeroNet they can't associate you with anything.",
				"added": 1565207703
			},
			{
				"comment_id": 24,
				"body": "> [nickwa](#comment_232_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): It won't matter if they force you to use a ID online. This is the future they want. Don't be fooled. The EU is also trying the same. They will try in their power to track you.\n\nWell if you were forced to use an ID that they gave you I could see that being a problem, but I was able to use your dad's name, and nobody is the wiser. Of course if you were forced to use a certain ID you could just not use the service, and then there would be nothing to track. It's always possible to avoid tracking, sometimes you just need to do a little extra work.",
				"added": 1565208040
			}
		],
		"1565270134_1JnDU6WVZyxxf8f6xevFAsXfEbw1NM3xXe": [
			{
				"comment_id": 25,
				"body": "https://mega.nz\nThat's the only link I know of, I guess they might have other URLs that point to the same site, but I am unaware of them.",
				"added": 1565270892
			}
		],
		"1565252472_1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u": [
			{
				"comment_id": 26,
				"body": "You must not have looked hard enough.\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/1DvcvrrEUyHsJ62SxwQcgTB81DvKGtreiB:the_donald:0",
				"added": 1565271065
			}
		],
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": "We don't care that you have a broken keyboard that is stuck on caps.\nOh and BTW some people probably do care about getting the latest music, movies, and TV shows. Have you happened upon the Play site, lots of movies there. Probably similar sites for music and TV.",
				"added": 1565314716
			},
			{
				"comment_id": 28,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_659_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Thanks 'for taking care' of my 'old ps2 keyboard'. [...]\n\nIt would be a lot easier to just write a little script to convert the case, heck I bet a decent text editor would let you do that. I'm not your mom though, so no I won't clean up after your mess. Grow up and do it yourself.",
				"added": 1565315506
			},
			{
				"comment_id": 29,
				"body": "> [xcape2net](#comment_181_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Maybe you weren't here two months ago when we decided that he's an artificial intelligence.  That explains why he types the way he does.\n\nThat may have been shortly before I joined. I like your theory though.",
				"added": 1565315617
			},
			{
				"comment_id": 30,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_662_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i bet you do, you kids live 'in a artificial reality' beautifully dressed like a whore 'by your masters':remember that one, in twenty years 'we will get it'.\n\nWho are you calling a kid? I'm old enough to be your dad, though I'm really thankful I'm not.",
				"added": 1565316432
			}
		],
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 31,
				"body": "YES!!! We finally have the minecraft nine year olds coming to zeronet.\n\nI am curious why dolphins would suffocate, seeing as how they are aquatic animals. I know they do need to breathe IRL, but in a video game, really M$ what are you guys thinking.",
				"added": 1565463822
			},
			{
				"comment_id": 35,
				"body": "> [r3naam3r](#comment_20_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): Is that a bad thing though? Don't we want to spread awareness and make all different kinds of people use ZeroNet?\n\nI meant that as a joke. I don't care who joins, or what they post.",
				"added": 1565564754
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 32,
				"body": "(#)ClintonBodyCount.\nSeriously though, the fact that all these 'malfunctions' happen at the same time for the elite to sweep dirt under the rug is pretty telling.",
				"added": 1565463933
			}
		],
		"1565523603_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 33,
				"body": "When you work job, you get prize.",
				"added": 1565529567
			}
		],
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 34,
				"body": "Are there people that seriously think the color of smoke is going to change on the ethnicity of a person being burnt? To those people I say find a place that cremates dead bodies and check out the smoke there, I bet smoke doesn't care about skin color.",
				"added": 1565540327
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 36,
				"body": "You're joking right? Ain't nobody verified here, you want people to respect you, give them a reason to. If you want a blue check go back to cuckbook and twatter.",
				"added": 1565577687
			}
		],
		"1565616025_1NGt8D4sXPBMF7nYD4wDE9Zsj9gtKiqGgH": [
			{
				"comment_id": 37,
				"body": "Well it looks like it worked. :)",
				"added": 1565617930
			}
		],
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 38,
				"body": "If this is such a great idea I wonder why you haven't already done it and kept all their wealth for yourself.",
				"added": 1565618875
			}
		],
		"1568493746_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 40,
				"body": "Firstly we use English measurements because it's what we grew up using, and were taught in school, and secondly because it's simple. No need to remember if you need to capitalize the first letter of a prefix, or have your measurement be off by a factor of ten(s).",
				"added": 1568670240
			}
		],
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 41,
				"body": "It takes like two minutes to throw canned veggies in a pot, or to start water boiling for pasta, set a timer, and let it cook, no need to babysit the food while it's cooking. Also, don't waste time making meals look pretty, everything gets mixed together once you eat it anyways.",
				"added": 1568671871
			},
			{
				"comment_id": 42,
				"body": "> [ratsmack](#comment_70_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Frozen veggies are much better for you and are usually less expensive. Certain things like canned tomato's make sense though.\n\nTrue, fresh is even better, but then you need to clean and prep them. All I meant was that there are plenty of food products that take very little effort to throw in a pot. :)",
				"added": 1568682385
			}
		],
		"1570194419_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 43,
				"body": "None that I know of, but nothing stopping you from starting one.",
				"added": 1570239967
			}
		],
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 44,
				"body": "Nothing new there. Just don't connect your TV to the network, then it can't send anything anywhere. Get yourself a Raspberry PI, install KODI and then hook that up to your TV. A better experience, and no worries about some company harvesting your data. If you're still worried don't let the PI connect to the outside net.",
				"added": 1571193266
			},
			{
				"comment_id": 45,
				"body": "> [xianc78](#comment_63_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): If you're going that route you might as well just use a dumb TV, projector, or computer monitor. Smart TVs (or smart-anything) are worthless\n\nwell yes, that would be better, but assuming you already have the smart TV it's dumb to junk it and buy other older equipment.",
				"added": 1571405611
			}
		],
		"1573864603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 46,
				"body": "> [anonymouslogin](#comment_134_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Eventually the population will turn against gun owners. Then the government will have you by the testicles...and the labia.\n\nYou know what's funny though? The people with the guns will win, it happens every time. An unarmed person is no match for a person with a gun, and thems the facts.",
				"added": 1573963488
			},
			{
				"comment_id": 47,
				"body": "> [zaron](#comment_35_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Idk. Indiana Jones did a good job of it.\n\nAh yes, because the movies 100% accurately represent real life. Keep thinking that way, it will be easier for the government to control you.",
				"added": 1574022298
			}
		],
		"1578685610_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 48,
				"body": "Your link to http://127.0.0.1:43110/zerotorrent.bit is broken, because you have it in uppercase.",
				"added": 1578774824
			}
		],
		"1579602906_1JH7GXsReuXYWoJKuREooRvjbWP15sMN2N": [
			{
				"comment_id": 49,
				"body": "This is why all your smart home devices should only require local access. If it's connected to the outside web, and controls something that effects security you should think twice about using it.",
				"added": 1579711798
			}
		],
		"1584769181_13W2cW8ZhgjC9KJXzvPXyCkafHsiegKvyu": [
			{
				"comment_id": 50,
				"body": "Yep, I'm sure it has NOTHING to do with the level 4 bioresearch facilities that are right next to the market.\nPlease break this news to CNN, they'll be all over it.",
				"added": 1584829664
			}
		],
		"1585895340_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 51,
				"body": "Ah, as an intellectual I've been calling it the pooh bear pandemic.",
				"added": 1586103818
			}
		],
		"1586719947_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 52,
				"body": "imgur really? Couldn't be arsed to link to images on Zeronet....",
				"added": 1586723748
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 53,
				"body": "what about https://joinmastodon.org/",
				"added": 1587248665
			},
			{
				"comment_id": 54,
				"body": "> [styromaniac](#comment_2050_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's infected with anti-male SJWs and is too much like Twitter.\n\nAdmittedly I don't use it for anything other than cross posting content on, so I don't really know anything about what sort of content is posted by other people.",
				"added": 1587250617
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 55,
				"body": "Start a car in your garage with the door closed. CO2 will do the trick after a while. I had a neighbor that did that.",
				"added": 1591234882
			},
			{
				"comment_id": 61,
				"body": "> [marcellusfagoti](#comment_9_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q): weak. a real man has the guts to stab himself\n\nI'm pretty sure somebody that wants to kill themselves isn't too worried about what people are going to think about them after they are dead.",
				"added": 1592005314
			}
		],
		"1591633616_17kfQsU2wofPg9sM1smPiny9K1yzLc7Pux": [
			{
				"comment_id": 56,
				"body": "> [ransbits](#comment_70_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Strange... I thought Google required at least alphanumerical passwords.\n\nPlus an uppercase letter and special character.",
				"added": 1591791516
			}
		],
		"1591822356_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 57,
				"body": "An armed society is a polite society.\nGo out and buy yourself some guns and ammo.",
				"added": 1591833271
			}
		],
		"1591828065_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 58,
				"body": "They only control society if you let them. You can always vote people out of office, and ignore what famous people say.",
				"added": 1591833339
			}
		],
		"1591900169_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL": [
			{
				"comment_id": 59,
				"body": "> [savugez](#comment_1_1NMBe5SUr5hbYNTzBMuvdBCAxQ81ivWzeL): Guys i didnt search it. I literally just click the zero porn thing and that's it.\n\nWhat did you expect to find on a censorship free site, when you went looking for porn.... There is doubtless lots more, and lots better porn on the clearnet, and it will almost certainly load faster for you. If you're just looking for 'vanilla' porn, you're in the wrong place buddy.",
				"added": 1591928016
			}
		],
		"1591900871_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk": [
			{
				"comment_id": 60,
				"body": "Maybe you need to stop watching TV and get out and talk to your neighbors. Turns out that the real world is actually mostly a pretty great place.",
				"added": 1591928152
			}
		],
		"1592432175_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 62,
				"body": "> [zaron](#comment_143_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Yeah, cause only jews would want to block child porn\n\nI don't think they would. You know what the rabbi do to baby boys after they are circumcised right???",
				"added": 1592686111
			}
		],
		"1594824211_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 63,
				"body": "Gotta say, I don't understand why people are so worried about this tech, the results are junk. Unless I'm missing something there doesn't seem to be any way to get anything even close to a decent resolution. Every photo I've run through ends up looking like it was taken back in 2005.",
				"added": 1595074310
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 64,
				"body": "dude, if farts get through your pants, why the heck would a virus be stopped from a scrap of fabric thinner than denim? This whole thing is a scam. Face masks do more harm then good.",
				"added": 1597114076
			}
		]
	},
	"comment_vote": {
		"22_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"7_176w2WC17nRS1oHt7HouaKQjfFx2eLuiZy": 1,
		"442_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"395_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"20_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"821_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"18_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"3_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"12_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_13v75z66xMg9xXt6aJ25gahjDpCNgUooNL": 1,
		"181_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"972_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"8_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"19_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"45_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"70_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"1_1BzjyXdmfFoTuAcb7VkRwxAR1vNah5fWt3": 1,
		"63_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"3_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7": 1,
		"28_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"384_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"72_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"73_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"2017_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2051_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"54_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"38_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"81_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"70_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"12_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"80_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"11_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"85_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"86_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"73_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"11_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q": 1,
		"41_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"597_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_19ZHTs6h2KhwL1X5vrRkUmoyDRk9Muwsap": 1,
		"8_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1
	}
}