{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1616209212,
			"title": "Dumpster fire",
			"body": "I know this is probably specifically zerotalk but wow, Zeronet is a complete dumpster fire now",
			"added": 1616209211
		}
	],
	"topic_vote": {},
	"next_comment_id": 182,
	"comment": {
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 1,
				"body": "Alex Jones already has everyone wearing tinfoil hats. And anyone that thinks that 1/1/2021 will magically reset the world needs to put one on as well",
				"added": 1608358678
			},
			{
				"comment_id": 3,
				"body": "> [freemankind](#comment_57_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): a dude that hates on alex jones cant be trusted\n\nAlex Jones is one of the funniest comedians",
				"added": 1608617182
			}
		],
		"1608604929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "On Stadia it's not bad. It's not great either. Considering it was delayed to iron out the glitches there shouldn't be glitches. I've seen Jackie walk through lockers and ride his bike straight into a pole. Hopefully like No Man's Sky they get shit fixed",
				"added": 1608616448
			},
			{
				"comment_id": 12,
				"body": "> [sj29msn5kz0ldmn](#comment_37_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): Stadia is a cancer that has its own cancer on top of it though. When we thought lack of ownership can't go any worse that buying a rented game tied to your Steam account that they can remove without having to explain anything, Stadia went even further in that you don't even have a downloaded copy on your device, you only see single stillshots sent over the internet.\n\nEven if you have a game on a physical disc, in theory they could block you from running it. You don't technically own anything. You have a license. It's not much different. I don't buy much for Stadia. Mostly whatever free games from Stadia Plus. It works and works pretty well.",
				"added": 1609128860
			},
			{
				"comment_id": 13,
				"body": "> [calmdownholden](#comment_15_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): \"Upper echelon gamers\" - is the dumbest phrase I've ever heard in my life.\n\nIt's a nice way of saying top tier neckbeards",
				"added": 1609217491
			},
			{
				"comment_id": 14,
				"body": "> [mentos](#comment_22_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK): I'm thinking about moving to Stadia. Thanks for the information.\n\nIt's pretty decent and getting better. You're going to need a decent internet connection tho. You can check it here:\nhttps://projectstream.google.com/speedtest",
				"added": 1609217625
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 4,
				"body": "> [tomer](#comment_41_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): Reply\n\n\nThat's where copy and paste comes in handy. you don't have to remember shit",
				"added": 1608790502
			},
			{
				"comment_id": 23,
				"body": "I was dippy enuf to get No Mans Sky day one without even having paid attention to the hype. The game was ok but eventually they did right and added a lot for free. I got Cyberpunk on Stadia because they were throwing in a controller and Chromecast Ultra for free ($99). I've seen some silly bugs but nothing game breaking. If CDR can get everything fixed and better for free that would be a plus. If they try to fix with paid DLC they can fuck off.",
				"added": 1609389587
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 5,
				"body": "> [sj29msn5kz0ldmn](#comment_36_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): however there should probably be littler people in the world. niggers breed dozens of kids without question and make them suffer under regimes and hunger, while even in white world we live on top of each other in building blocks like some ants in a slave quarters. i wanna have my own hut, work for myself and not some fucking corporate billionaire, and dont rely on corrupted govs for most things\n\nDo you know why most blacks in the world have so many kids? The same reason whites used to. They expect most of them to die before they reach adulthood. So they have extra to hopefully get a few to survive.",
				"added": 1608956010
			},
			{
				"comment_id": 6,
				"body": "> [edgelordofdecent](#comment_738_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): @radiatorThe people who the media were telling to take care of the Earth who were taking it really seriously are now the people who throw, masks, latex gloves, and disinfectant wipes everywhere and litter all the time.\n\nNo, the people who are throwing masks, etc on the ground just don't give a fuck either way.",
				"added": 1608956061
			},
			{
				"comment_id": 17,
				"body": "> [radiator](#comment_23_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): all \"the data elsewhere\" is fake. but please - continue worshipping with your cult. I hear they meet occasionally at beachside resorts on martha's vineyard island and montecito California... [...]\n\nTell that to all the melted glaciers. Now is it an Armageddon event? probably not. But that doesn't mean some shit isn't happening",
				"added": 1609218328
			},
			{
				"comment_id": 20,
				"body": "> [quantumkitty](#comment_500_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It's not fake, but it's also a lost cause. People should always come before the environment\n\nPeople have to live in the environment. If the environment fails the people will die",
				"added": 1609303205
			},
			{
				"comment_id": 21,
				"body": "https://www.nationalgeographic.com/environment/2019/03/one-part-of-greenland-ice-growing/\nThis one little piece is growing while the rest is melting.\nWhy did they have to use MS Paint for that??",
				"added": 1609303335
			}
		],
		"1608952482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "The Great Reset is to push capitalism to serving the consumer/customer and not just the elites and investors. Stakeholder Capitalism. Look it up.",
				"added": 1608956131
			},
			{
				"comment_id": 11,
				"body": "> [edgelordofdecent](#comment_743_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): No, making it so the average person owns nothing and is under heavy surveillance doesn't make it that way.\n\nYou do realize the \"You own nothing\" part was a fear of the possible future right? Not what they wanted but what they fear the current direction is going? Photoshop Creative Cloud, you rent, Microsoft Office, you rent, Next Microsoft Windows you rent. Car subscription services. The Great Reset takes all of that away from the elites",
				"added": 1609044996
			}
		],
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "i2p could be a lot better but currently it just doesn't really work",
				"added": 1608956181
			}
		],
		"1608830447_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 9,
				"body": "Mostly just to be something to take off. It becomes part of the whole experience. It's a visual thing",
				"added": 1608956316
			}
		],
		"1608830774_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 10,
				"body": "Yep sure launch some nukes. Mutually assured destruction won't end the world at all",
				"added": 1609044841
			},
			{
				"comment_id": 24,
				"body": "I was convinced when seeds came from China that someone in China heard that Americans weren't allowed to buy seeds so they sent us some.",
				"added": 1609558856
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 15,
				"body": "> [radiator](#comment_19_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): I heard an interview while flipping through channels this morning - it was on the despised fox news - it was HHS secretary Alex Azar - and the fox hosts actually had the nerve to ask him about therapeutics like Regeneron and \"others\" (they chickened out on saying HCQ, but whatevs...) - they said, why is this information - that these therapeutics work  and can reduce hospital stays - why is this information not getting to doctors?  [...]\n\nUhmm... The CDC is a federal agency....",
				"added": 1609218207
			},
			{
				"comment_id": 18,
				"body": "> [radiator](#comment_27_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): ok, I mis-spoke.  [...]\n\nThe CDC wouldn't profit off of vaccines, but Pfizer, AstraZeneca might. I don't know that the Pentagon technically profits from war. They would likely be given a bigger government budget but they already have an insane size budget. Independent government contractors might profit from war.",
				"added": 1609302512
			}
		],
		"1608117446_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 16,
				"body": "It becomes a problem when this comedy.. Just like Alex Jones, is believed as real. Someone eating The Onion. lol",
				"added": 1609218275
			}
		],
		"1609283387_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 19,
				"body": "No, you use an Amazon wishlist. The sender doesn't get your address.",
				"added": 1609302665
			}
		],
		"1609275892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 22,
				"body": "Why would anyone support trickle down economics?? Nothing ever actually trickles down",
				"added": 1609303506
			}
		],
		"1609464689_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 25,
				"body": "Modern Satanists rarely have anything to do with the biblical Satan.",
				"added": 1609650849
			}
		],
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 26,
				"body": "I think it would be better for you to be able to choose yourself what you want to see. Being done automatically causes problems.",
				"added": 1609996291
			},
			{
				"comment_id": 32,
				"body": "> [mamanga](#comment_1_1DkzVVJF3jXJvbwmcJrobxgym5ZD5Azy2S): hi\n\nBonjour",
				"added": 1610168872
			}
		],
		"1609976542_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 27,
				"body": "The Capitol Police are not the Metro Police. The Capitol Police are a federal enforcement agency that answers directly to Congress",
				"added": 1610079466
			}
		],
		"1603637541_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 28,
				"body": "Fake",
				"added": 1610080034
			}
		],
		"1610042649_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n": [
			{
				"comment_id": 29,
				"body": "In 2016 there was 155 million registered voters. In 2020 there was somehow less? 81+74 = 155.\nDonald Trump is a reality star who is fake af. Fake hair color, fake skin color, fake af.",
				"added": 1610080880
			}
		],
		"1610164924_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 30,
				"body": "> [kekistancitizen](#comment_13_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp): I think the best thing for wide adoption would be to create a dedicated zeronet browser, just like there is a zeronet browser. This browser could come with all of the optimal configurations and use tor by default. It would also ban any clearnet links and only recognize .bit addresses.\n\nIf it's using tor anyways why would clearnet links be a problem?",
				"added": 1610167884
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "One of his handlers would have to be informed about Zeronet. And even then he's more likely to find his way to Parler",
				"added": 1610168419
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 33,
				"body": "> [jeff](#comment_81_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): I'm relegating you to the litter box, kitty, as your posts are nothing more than thoughtlessly regurgitated leftist put-downs and mindless talking points.Welcome to Block City, Kitty. Population: You.\n\nAhh, that feeling when you need some censorship",
				"added": 1610255235
			},
			{
				"comment_id": 34,
				"body": "> [unsnapgreedless](#comment_7_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): And yet, what we're literally seeing in the world right now are \"far right\" proponents fleeing to alternate social media platforms, because the FAR-LEFTISTS in control of Big Tech are... \"shit[ting] all over people's freedoms and free speech [since they're becoming] actual policy\" [...]\n\nIs it free speech to tell the truth about Donald Trump's addiction to licking little boys feet?",
				"added": 1610255282
			},
			{
				"comment_id": 44,
				"body": "> [whotoldyouthat](#comment_3_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN): He chose to \"censor\" it. Different than someone else deciding \"for him\".\n\nFairly good point",
				"added": 1610596981
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 35,
				"body": "I know the answer to this so it's mostly rhetorical but. \nWhy do they need AWS anyways? Where is the competition to AWS?",
				"added": 1610255413
			},
			{
				"comment_id": 37,
				"body": "Did Trump actually even join Parler? I see a bunch of Trump related pages. but not a This is Donald Trump page",
				"added": 1610255849
			},
			{
				"comment_id": 40,
				"body": "minds.com",
				"added": 1610428613
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 36,
				"body": "They control their own houses. Step out of their houses and you're out of their control",
				"added": 1610255696
			},
			{
				"comment_id": 39,
				"body": "minds.com\nCheck it out",
				"added": 1610428098
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 38,
				"body": "We're going to sell hats to raise money to sell flamethrowers to raise money to dig tunnels. There's very few people that could say that with a straight face.",
				"added": 1610427325
			}
		],
		"1610348128_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ": [
			{
				"comment_id": 41,
				"body": "When you have access to government IT departments why would drop a laptop off at some repair shop in Delaware?",
				"added": 1610428771
			}
		],
		"1610369492_1uRiXAhYBVhxWPxZuFH8zDssbSapKHVcW": [
			{
				"comment_id": 42,
				"body": "The beast was allowed to brag and claim to be God, and for 42 months it was allowed to rule.",
				"added": 1610428988
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 43,
				"body": "A dictatorship is what he wants you to believe in",
				"added": 1610429134
			},
			{
				"comment_id": 59,
				"body": "> [mxh69420](#comment_61_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): i cant trust either side anymore. kanye west 2024 i guess\n\nAt least with Kanye you know he's crazy",
				"added": 1610942710
			}
		],
		"1610573261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 45,
				"body": "Did he do any work? He worked on his swing, he worked on his putt. He took a vacation to North Korea with his daughter. So there's that I guess..",
				"added": 1610597250
			}
		],
		"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx": [
			{
				"comment_id": 46,
				"body": "Polio was just a distraction too",
				"added": 1610597593
			},
			{
				"comment_id": 61,
				"body": "Big oil has been in a death spiral for a long time. They've just been paying people off to make sure everyone was looking the other way. If they didn't fight nuclear so hard we would all have clean energy and plenty to go around to power everything.",
				"added": 1611032993
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 47,
				"body": "Parler was a honeypot. Anyone who was dumb enough to use it gets what they deserve",
				"added": 1610597859
			},
			{
				"comment_id": 48,
				"body": "> [namvata55](#comment_23_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): Troons try to infiltrate women's spaces \n\nI feel like you're talking to yourself...",
				"added": 1610597943
			},
			{
				"comment_id": 49,
				"body": "> [jager](#comment_12_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Antifa had a network? Where are researchers \nIt's called  Facebook",
				"added": 1610598108
			}
		],
		"1610509513_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 50,
				"body": "> [apely56](#comment_17_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG): cool. proof?\n\nWe don't need proof. Whatever we say is proof enough",
				"added": 1610598209
			},
			{
				"comment_id": 51,
				"body": "75+ m people can't communicate with each other because parler got shut? Give me a break..",
				"added": 1610598267
			}
		],
		"1610525949_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 52,
				"body": "I'm not as convinced that it matters. What was wrong with Republic policy that it chased everyone into the cities?",
				"added": 1610598325
			}
		],
		"1610527542_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 53,
				"body": "> [quantumkitty](#comment_534_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It should go without saying.. we don't live in the 20th century anymore.\n\nI would think. If we did then time had become broken..",
				"added": 1610598423
			}
		],
		"1610678665_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 54,
				"body": "People outside of the Capitol aren't being searched for or arrested. People inside or having done stupid things are.\nThat said you might not want to go in case some shit pops off anyways, unless you're prepared for that",
				"added": 1610684358
			}
		],
		"1610668941_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 55,
				"body": "What did Gog and Magog ever do wrong?",
				"added": 1610684617
			}
		],
		"1610676192_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP": [
			{
				"comment_id": 56,
				"body": "Wouldn't it make more sense to use unknown wallet addresses for someshit like that?",
				"added": 1610685799
			}
		],
		"1610760100_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": [
			{
				"comment_id": 57,
				"body": "They couldn't compete with GOA",
				"added": 1610771862
			}
		],
		"1610729754_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 58,
				"body": "This same guy is called an antifa leader, a BLM leader. but the website for his supposed group is fake. the Facebook for the same group is fake and doesn't have any activity since September. so does the guy even exist?",
				"added": 1610773421
			}
		],
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": [
			{
				"comment_id": 60,
				"body": "> [steeljacket](#comment_31_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): +1 for this.I am looking right now to move all my shit from Godaddy to servers in Russia. If my servers are in russia, they can't do shit. Anyone tells me to take anything down, I can send them a nice letter explaining where to go to fuck themselves.\n\nRussia? Really? Do you really believe Russia is into free speech?",
				"added": 1611032626
			}
		],
		"1610998661_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "Anarchists from both sides. Some do have a quite noble cause of limiting federal government powers. but they use anarchy to achieve it. Minarchists they call themselves",
				"added": 1611033087
			},
			{
				"comment_id": 64,
				"body": "> [aim64c](#comment_64_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Fascism is essentially based Socialism.If \nYou do realize you have a 50k limit right?",
				"added": 1611203421
			}
		],
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 63,
				"body": "> [vambrace](#comment_16_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY): https://twitter.com/simonydiamond1\nI was very disappointed.. there's no porn there",
				"added": 1611203317
			}
		],
		"1611277411_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 65,
				"body": "Anyone who pays attention knows the Great Reset has to do with stakeholder capitalism. Returning capitalism to the customer, the employee. For decades it's become shareholder capitalism and favored the investor. This has caused planned obsolescence, loot boxes, and releases of AAA games unfinished like Cyberpunk. Take back capitalism for the people. Reset that shit",
				"added": 1611467726
			}
		],
		"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 66,
				"body": "Anyone paying attention to Tyler Durden doesn't seem to realize that he's just a figment of Jack's imagination.\nHis name was Robert Paulson.",
				"added": 1611467920
			}
		],
		"1610987594_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 67,
				"body": "Is it still Wuhan Flu or has it become London Flu??",
				"added": 1611468022
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 68,
				"body": "As always it's the end of the world as we know it. And has been since REM says it was",
				"added": 1611468141
			},
			{
				"comment_id": 70,
				"body": "> [zeronova](#comment_3_1GhJcGjryaQ8s6CL5vraeUd15TiXCvY9m2): Blacks make up 13.4%[0] of the USA [...]\n\nThat's only single victim/single offender, find better data and come back",
				"added": 1611634894
			}
		],
		"1611623437_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 69,
				"body": "you're glowing",
				"added": 1611634215
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 71,
				"body": "The second either is used by ISIS or Al'Queda for an attack is when everyone will call for them to be shutdown",
				"added": 1611810399
			}
		],
		"1611802829_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 72,
				"body": "It's all just a game, and you're the pawn",
				"added": 1611810488
			}
		],
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 73,
				"body": "> [styromaniac](#comment_2934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Or message Nofish on ZeroMail.\n\nIs that fish still swimming? He never answers..",
				"added": 1611893631
			}
		],
		"1610847074_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 74,
				"body": "Uhm, aren't you chatting with people about stuff right here??",
				"added": 1612069413
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 75,
				"body": "> [werevoltyou](#comment_3_1L7D8xxSxRBVnBLvFTnCG2oVMyv8pefACN): The CEO of Pfitzer said 'It's not for me, I am not taking it'. Who is it for then?\n\nHe never said he wasn't taking it. He's waiting his turn.",
				"added": 1612069603
			},
			{
				"comment_id": 76,
				"body": "> [grouch0](#comment_35_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): As of who's 'current knowledge'? There's \nThat's all well and good but I officially know more people that have died from Covid than from flu. Now to be fair that's because I've known no one who had died from flu. and only one who had it.",
				"added": 1612069745
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 77,
				"body": "Reality doesn't exist. There is only perspective.",
				"added": 1612070181
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 78,
				"body": "That would probably depend on how much ubi they give. $1000 a month is at least double most easy jobs",
				"added": 1612154036
			},
			{
				"comment_id": 79,
				"body": "I doubt I've read into the Great Reset shit as much as I could but from what I have it seems to do with stakeholder capitalism. Capitalism for the stakeholder (employee and customer) instead of the stockholder. The way it used to be",
				"added": 1612154115
			},
			{
				"comment_id": 80,
				"body": "> [theborg](#comment_17_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): Absolutely not. Thats just a BS package to \n\nI need you to post absolute proof",
				"added": 1612241776
			},
			{
				"comment_id": 83,
				"body": "> [theborg](#comment_18_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): Its everywhere.You just need to look.\n\nI don't feel like looking. I want you to show it to me",
				"added": 1612677322
			},
			{
				"comment_id": 94,
				"body": "The view outside the window hasn't changed. Have you seen something that you. YOU. can say has changed for your reality?",
				"added": 1613886529
			},
			{
				"comment_id": 97,
				"body": "> [anon45672997](#comment_1_1H5Hj9Q9RXFAWXaFvAAMLuQurxUmExxgci): Uh, yeah - quarantines, false \nDo you think quarantines haven't happened before? Not in most of our lifetimes so their annoying. but like the ones of the past. they will end",
				"added": 1614051808
			},
			{
				"comment_id": 100,
				"body": "Asking for a raise will cause inflation. Being more successful will cause inflation. Don't bother to do either.",
				"added": 1614401628
			},
			{
				"comment_id": 107,
				"body": "The \"you will own nothing and be happy\" is a fear of a dystopian future. Not a hope.",
				"added": 1614829505
			}
		],
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 81,
				"body": "Mike Lindell is as sane as Mark Zuckerburg",
				"added": 1612677202
			}
		],
		"1612644621_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 82,
				"body": "Shadowrun is 2050..",
				"added": 1612677231
			}
		],
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 84,
				"body": "A bunch of people fought to make sure the election was fair and someones mad about it??",
				"added": 1612845511
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 85,
				"body": "With our current population these numbers look small.. 100 years ago this number of deaths would've been devastating",
				"added": 1612929842
			}
		],
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": [
			{
				"comment_id": 86,
				"body": "What is the eo?",
				"added": 1613192067
			},
			{
				"comment_id": 91,
				"body": "> [colonelracoon](#comment_1_184prYiYhMhZdg3VY5rUws3v1FzMKySoFM): Or just imprisoned for the rest of his \n\nIf someone wanted him dead that bad he would've been dead by now",
				"added": 1613623925
			}
		],
		"1613152940_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 87,
				"body": "The Great Reset is about stakeholder Capitalism.. look it up",
				"added": 1613192386
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 88,
				"body": "> [styromaniac](#comment_2963_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Paradoxes are impossible in time \nThe scientists that are saying this are theorists. There's no proof that either time travel or parallel universes exist.",
				"added": 1613366693
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 89,
				"body": "How did I wake up in the Jita system?",
				"added": 1613367119
			}
		],
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 90,
				"body": "Both parties are fascist",
				"added": 1613367181
			}
		],
		"1613587814_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 92,
				"body": "ask styromaniac, his seems to be unlimited",
				"added": 1613624273
			}
		],
		"1613642362_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 93,
				"body": "Stakeholder Capitalism. There, explained in 2 words",
				"added": 1613793542
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 95,
				"body": "Invest in whatever Elon tells you to",
				"added": 1613886562
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 96,
				"body": "how do some of these people have endless quotas? I've only been back about a month and I'm almost half way thru the 50k",
				"added": 1613886670
			}
		],
		"1613979442_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 98,
				"body": "They should investigate Trump's habit with little boys",
				"added": 1614401390
			}
		],
		"1614298638_1M77v8LSvJyW7ThTD1Z46CVBYfi8y1SpaW": [
			{
				"comment_id": 99,
				"body": "Bonjour",
				"added": 1614401429
			}
		],
		"1614062736_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 101,
				"body": "Monsanto still exists. Why would Bill Gates have to continue Monstano's work if it still exists?",
				"added": 1614401704
			}
		],
		"1614206367_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 102,
				"body": "Trump is mentally unstable",
				"added": 1614401730
			}
		],
		"1614725482_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 103,
				"body": "It seems giving people their tax money back allows them to spend it themselves..",
				"added": 1614738903
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 104,
				"body": "> [trueerin](#comment_6_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz): Yes of coursehttps://www.welivesecurity.com\n\nOut of beta too early",
				"added": 1614739037
			},
			{
				"comment_id": 106,
				"body": "Tor browser would be great, if they didn't break being able to choose ips to not send traffic thru tor",
				"added": 1614739887
			}
		],
		"1614693108_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 105,
				"body": "When you have the money to help save lives, and you do just that. And then people hate you for it",
				"added": 1614739123
			}
		],
		"1614861650_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 108,
				"body": "They couldn't kill enough with the snow so they'll try again for more.",
				"added": 1614918018
			}
		],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 109,
				"body": "They're not banned, just no longer published. Existing copies are still out there.",
				"added": 1615347486
			},
			{
				"comment_id": 110,
				"body": "> [vmtpdsauqc6xryh2](#comment_2_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG): For a time being bid up to \nIf you want to pass them around for free by all means go ahead. but realize they're not banned. Just no longer published.",
				"added": 1615437428
			},
			{
				"comment_id": 111,
				"body": "> [anonymouslogin](#comment_252_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Shouldn't publishing continue \\\nThe publisher made that decision so that's on them. Sometimes we need to move passed the past and into the future",
				"added": 1615437478
			},
			{
				"comment_id": 115,
				"body": "> [ar15user1](#comment_16_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC): what the fuck publish the original, like \nThey only publish Mein Kampf to donate the procedes. But can't find anyone to take them...",
				"added": 1615521339
			}
		],
		"1615515631_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc": [
			{
				"comment_id": 112,
				"body": "Do you realize that we know you are not American?",
				"added": 1615520666
			}
		],
		"1615442560_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 113,
				"body": "Damn bro you glowing",
				"added": 1615520696
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 114,
				"body": "Zeronet has been invaded",
				"added": 1615520735
			}
		],
		"1615458168_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 116,
				"body": "ar15user1 and akmluser1 are the same person",
				"added": 1615521562
			}
		],
		"1615593042_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 117,
				"body": "This guy just keeps talking to himself...",
				"added": 1615608024
			}
		],
		"1615580474_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk": [
			{
				"comment_id": 118,
				"body": "You just did",
				"added": 1615608231
			}
		],
		"1615534190_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 119,
				"body": "cvs seems to have no problems with hosting child porn",
				"added": 1615778427
			}
		],
		"1616091369_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 120,
				"body": "You do know you only have 50k characters right?",
				"added": 1616116120
			}
		],
		"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 121,
				"body": "Isn't it on github? couldn't it just be forked?",
				"added": 1616726157
			}
		],
		"1616706424_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 122,
				"body": "People who are  stupid enuf to post themselves on social media breaking the law get what they deserve",
				"added": 1616726238
			}
		],
		"1616716381_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 123,
				"body": "He's very likely to use his giant cock to do it",
				"added": 1616726314
			}
		],
		"1616864409_1ASw9nbUv8QsYxWggwsMsNZ37STaEo26Di": [
			{
				"comment_id": 124,
				"body": "minds is actually a free speech social media site. If your connected thru tor https links wouldn't matter now would they?",
				"added": 1616904843
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 125,
				"body": "We don't lean, we stand.",
				"added": 1617418835
			},
			{
				"comment_id": 129,
				"body": "Race is fake, IQ is fake. Prove me wrong",
				"added": 1617508949
			}
		],
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 126,
				"body": "Why do people post fake news that can be very easily verified? Just look on Youtube. Dislike is still there. Even on Biden videos. Announced on Twitter? Nothing there. You sure this isn't an April Fools joke?",
				"added": 1617419423
			}
		],
		"1617373305_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 127,
				"body": "People who were preparing for the \"Capitol Hill Assault\" planned way before Trumps speech that day. His rhetoric gave them reason to believe that they had sent him there on a mission. Now is that Trumps fault? Maybe not. But if you light a match a throw it, who is to blame for the resulting fire?",
				"added": 1617420287
			}
		],
		"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX": [
			{
				"comment_id": 128,
				"body": "It's been going to shit for thousands of years. where the hell have you been? In reality it's prolly better than it's ever been. At least you don't have to worry about being crucified.",
				"added": 1617508805
			},
			{
				"comment_id": 157,
				"body": "Why would Santa Claus give naughty kids coal? In that time coal was a VERY expensive commodity. A kid receiving coal would be better rewarded than a kid receiving a crappy wooden toy",
				"added": 1621999773
			}
		],
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [
			{
				"comment_id": 130,
				"body": "> [mxh69420](#comment_90_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): all we need is for zeronets codebase to Is the dev even still around? Does this need to be forked?",
				"added": 1617853257
			},
			{
				"comment_id": 131,
				"body": "> [bats](#comment_96_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): People with unorthodox views are not really a \nYeah, conspiracy theorists are less of the problem. People (bots?) spamming nonsense is",
				"added": 1617853308
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 132,
				"body": "Alex Jones entire game is just to sell his merchandise.",
				"added": 1618454749
			},
			{
				"comment_id": 134,
				"body": "> [karhen](#comment_33_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): absolutely not ! It's because he refuse to \nAre you Alex Jones?",
				"added": 1618715531
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 133,
				"body": "why are so many of these posts one person talking to themselves?",
				"added": 1618715453
			},
			{
				"comment_id": 146,
				"body": "> [planespherev4](#comment_40_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg): Israel got outdated by China in \nCapitalism has nothing to do with people. It has to do with Capital. Hence it's name",
				"added": 1620705271
			},
			{
				"comment_id": 147,
				"body": "> [stoke](#comment_3_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG): Today I found out the highest law of the \nWould you rather Talmudic Law or Sharia Law?",
				"added": 1620705299
			}
		],
		"1618696253_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 135,
				"body": "The Vatican already said it's OK to take it",
				"added": 1618715604
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 136,
				"body": "Congress already passed laws absolving them from insider trading so good luck with that",
				"added": 1618715772
			}
		],
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 137,
				"body": "All technological progress must be stopped. Humanity needs to be bombed back to the stone age immediately",
				"added": 1618975155
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 138,
				"body": "Why are so many bots posting?",
				"added": 1618975206
			}
		],
		"1618945192_12vij5EwmiAG1R9wqX5VVkuqopsBKrBhTa": [
			{
				"comment_id": 139,
				"body": "Use the Delorian to go back in time and buy Bitcoin at $1",
				"added": 1618975269
			},
			{
				"comment_id": 140,
				"body": "Apparently freedom of speech involves roaring turtles",
				"added": 1618975294
			}
		],
		"1619906359_1HGKXBnrJs6kTo2QqTUMYEicDsSwrYqwKN": [
			{
				"comment_id": 141,
				"body": "Take to laundromat. Drop in washer. Hit delicate cycle. profit.",
				"added": 1620011419
			}
		],
		"1620517463_14zfKTGjNZghaPkrUSobubLZTx6XoVXjJK": [
			{
				"comment_id": 142,
				"body": "centuries of book burning? centuries ago most people didn't know how to read so book burning would've been useless",
				"added": 1620533423
			}
		],
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 143,
				"body": "I've only ever used bitcoin to buy dunkin gift cards on fold.app",
				"added": 1620616534
			}
		],
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 144,
				"body": "> [goodafternoon](#comment_111_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): Baconboi, there are files for a \nBut do they have a file to print his dog?",
				"added": 1620616641
			},
			{
				"comment_id": 145,
				"body": "> [stoke](#comment_2_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG): <p align=justify>Today I learned how to \nBut can you justify posting it?",
				"added": 1620705205
			},
			{
				"comment_id": 160,
				"body": "> [tamilan](#comment_5_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): Today, I learned about ZeroNet alternatives: \nI can't find anything about this but would Freenet run on OpenJDK?",
				"added": 1623639154
			}
		],
		"1620701303_12b1RtuykTkdjFZmq5PcDRki6dza6DJ9SP": [
			{
				"comment_id": 148,
				"body": "What about Home Depot?",
				"added": 1620705330
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 149,
				"body": "The same place undocumented peoples get documents",
				"added": 1620788037
			},
			{
				"comment_id": 152,
				"body": "> [anonymouslogin](#comment_288_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): The mRNA vaccines are not \nNope sorry, your body isn't yours. You are renting it. One day you will have to return it.",
				"added": 1620873167
			},
			{
				"comment_id": 154,
				"body": "> [atheistamerican](#comment_13_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH): Wrong! Jesus and god aren't real \nIt doesn't matter if either exist. When you die it returns to the Earth. whether you like that or not.",
				"added": 1620963390
			},
			{
				"comment_id": 164,
				"body": "You can find a covid vaccine cert in the same place illegal immigrants can get papers",
				"added": 1627961381
			},
			{
				"comment_id": 165,
				"body": "There is a time traveler that gave us the cure to Covid in the lyrics of a hit song.\nSmoke Weed Everyday",
				"added": 1628390734
			}
		],
		"1620756113_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 150,
				"body": "Cremate your cares",
				"added": 1620788369
			},
			{
				"comment_id": 153,
				"body": "> [markinformer](#comment_31_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): Sounds like California, but could \nA financial dustbowl with all those billionaires in Cally?",
				"added": 1620873929
			}
		],
		"1620715720_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 151,
				"body": "Is it possible for someone to take over development of Zeronet? Is anyone in contact with the Fish that is not?",
				"added": 1620788422
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 155,
				"body": "I've become more interested in the idea that viruses don't intend to kill us. It's our own immune systems that do.\nViruses like all life intend to reproduce and survive. If we die, they can't do that. So why do we die because of viruses?",
				"added": 1621999577
			}
		],
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 156,
				"body": "Learn that Marx was right. Stop working for someone else and seize the means of production. If you work for someone else you're making money for them. Work for you and make money for you. The wealthy are ALL socialist. They want you to work so they can make money from YOU",
				"added": 1621999686
			}
		],
		"1623537761_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 158,
				"body": "Food shortage or worker shortage? There seriously might've been just her there.",
				"added": 1623638620
			},
			{
				"comment_id": 159,
				"body": "> [anonymouslogin](#comment_315_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Is McDonalds food?! Sadly it is \nYou say this like it is something new",
				"added": 1623638647
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 161,
				"body": "Why not just fork Zeronet?",
				"added": 1624847866
			},
			{
				"comment_id": 163,
				"body": "Is it possible that nofish is no more? Can some one  take over?",
				"added": 1627099756
			}
		],
		"1626197636_16fWAVWJXTGFYYr7u7aqN8k5CHoGoaUaks": [
			{
				"comment_id": 162,
				"body": "If people stopped eating 8 chickens a day things might get better. But since you need to maintain your 300 pounds it will not",
				"added": 1627099428
			}
		],
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 166,
				"body": "Does anyone have a contact for nofish? Forking will prolly be the only option to move forward",
				"added": 1628391285
			},
			{
				"comment_id": 167,
				"body": "> [styromaniac](#comment_3193_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): His email.\nMore specifically has anyone been in contact with nofish?",
				"added": 1628997118
			}
		],
		"1629298299_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 168,
				"body": "I feel like this is a statement and not a question. If someone figured out who nofish is I guess it is possible",
				"added": 1629346836
			},
			{
				"comment_id": 169,
				"body": "> [progi](#comment_23_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): The project are not profitable, exiguous \nA project like this is not likely to be profitable. For legality, anything with absolute zero censorship is likely to have questionable legality. Freenet has very questionable legality but it's still supported.",
				"added": 1629689065
			}
		],
		"1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 170,
				"body": "Those over there are extremist conservative Muslims. I've never known a Muslim that meant any harm to anyone. And their family values were better than most Americans I know",
				"added": 1630640188
			}
		],
		"1630314029_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 171,
				"body": "Pretty sure this guy is using Google Translate lol",
				"added": 1630640258
			}
		],
		"1630497564_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 172,
				"body": "Or they could just be anonymous?",
				"added": 1630640295
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 173,
				"body": "I hate you",
				"added": 1632281989
			},
			{
				"comment_id": 179,
				"body": "Prolly cause they trust the government less than anyone else",
				"added": 1634182686
			}
		],
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 174,
				"body": "We should just let this run it's course. the population needs to be about 50% less anyways",
				"added": 1632282113
			}
		],
		"1632343427_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda": [
			{
				"comment_id": 175,
				"body": "Is there a dev group that's willing to do it and stick to it?",
				"added": 1633148972
			}
		],
		"1633268142_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": [
			{
				"comment_id": 176,
				"body": "pretty sure he's just a troll lol",
				"added": 1634182375
			}
		],
		"1633971358_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 177,
				"body": "This is because people in the United States don't believe in psychic viewing. In China they can do anything because they believe",
				"added": 1634182478
			}
		],
		"1633989409_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 178,
				"body": "If you're going to buy something from Amazon make sure it's FROM Amazon and not from someone selling on Amazon",
				"added": 1634182612
			}
		],
		"1633740636_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 180,
				"body": "i2p is useful for staring at blank pages",
				"added": 1634182713
			}
		],
		"1633965085_1G43ZEBZNxHBg7YdpwRXjuGPsJbfxXtpoR": [
			{
				"comment_id": 181,
				"body": "I mean, you're on Zeronet why not start a Zerosite to share such things?",
				"added": 1634182769
			}
		]
	},
	"comment_vote": {
		"2827_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}