{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1563588405,
			"title": "IPFS youtube uploader using python",
			"body": "After seeing 99fk's thread about a tool for downloading youtube videos and uploading them to IPFS (found here http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1563400508_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr/YouTube+to+IPFS ) I felt inspired to make my own tool that does the exact same thing. \nIt uses python 3 and can be found here https://github.com/qspitzer/Python-Youtube-to-IPFS",
			"added": 1563588404
		},
		{
			"topic_id": 1565292753,
			"title": "Could the shutdown of 8chan be helping zeronet grow?",
			"body": "Now I know that the 8chan shutdown has caused ZN to grow, but do you think that it will also get non-8chan users to join as well? My thought process is that:\n\n1) With 8chan shutdown, users have started to use ZN\n2) The increased usage of ZN by former 8chan users has caused MSM to start reporting. \n3) More people will hear about ZN and try it out to see if it is as bad as MSM is reporting.",
			"added": 1565292751
		},
		{
			"topic_id": 1565645860,
			"title": "Resetting Lenovo Thinkpad L450 BIOS supervisor password?",
			"body": "I am having trouble resetting the supervisor password on my lenovo l450. I got the laptop used, and I need to set the date which can only be done after the supervisor password has been entered. I am trying to reset it with the short-circuit method, but I cannot get my changes to stick. I am following this guide (https://www.reddit.com/r/thinkpad/comments/4z9czz/resetting_the_eepromlost_supervisor_password_on/) and I am able to get into the bios, but my changes do not stick after rebooting. Does anyone have any experience with this sort of thing and willing to point me in the right direction?",
			"added": 1565645857
		},
		{
			"topic_id": 1565724346,
			"title": "Did youtube block tor?",
			"body": "Is anyone able to use youtube with Tor? The site loads for me, but all of the videos and titles are grayed out. I remember that youtube [temporarily went down](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1557922831_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm) for Tor users at one point, but is it now down permanently?",
			"added": 1565724342
		},
		{
			"topic_id": 1565931919,
			"title": "KaffieID permissions in content.json?",
			"body": "I am following [nofish's tutorial](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial) for creating a simple chat site, and at one point he has the \"permissions\" part of the content.json file read\n```\n\"permissions\": {\n      \"bad@zeroid.bit\": false,\n      \"nofish@zeroid.bit\": { \"max_size\": 100000 }\n}\n```\nThis makes sense to me because all zeroid's are unique. But how would this be done for kaffieid? The usernames are not unique, so `\"nofish@kaffie.bit\": { \"max_size\": 100000 }` would not work because anyone named 'nofish' would then have that permission. Would `nofish@kaffie.bit` just be replaced with the public key instead? If so, how would one find the public key for a kaffieid?",
			"added": 1565931913
		}
	],
	"topic_vote": {
		"1554087330_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1554128617_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": 1,
		"1559258606_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1559835007_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"1561471236_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1562671898_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1562599452_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": 1,
		"1563459417_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1563482740_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1563904309_164cJJtm3Q2Xd7NZbFxJYngmW8MSqUMMxi": 1,
		"1563945520_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1564217207_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": 1,
		"1564381634_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565230737_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": 1,
		"1565298754_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565308255_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565358483_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565527640_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"1565529446_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1565768730_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": 1,
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": 1,
		"1565907846_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": 1,
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"1565985021_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566780087_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1568042910_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1570458113_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81": 1
	},
	"next_comment_id": 78,
	"comment": {
		"1553803052_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": "the end is near",
				"added": 1553810402
			}
		],
		"1555991880_1MUH8uNwBWFW8wzVZdnBWqNGCg9H1BCURH": [
			{
				"comment_id": 2,
				"body": "why?",
				"added": 1556027691
			}
		],
		"1557922831_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 3,
				"body": "I just tried this, and I can confirm that this is true",
				"added": 1557924473
			}
		],
		"1558529155_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 4,
				"body": "This is a consequence of free speech. People will have views that you do not agree with",
				"added": 1558540678
			},
			{
				"comment_id": 5,
				"body": "> [cunny](#comment_1_1FSDJqLBYJ9Ej8SQGgPCuMadPBpi45cXKW): A good start is to stop being a nigger.\n\nWhile I do not agree with what you have said, I am glad that you have the ability to say it",
				"added": 1558800753
			}
		],
		"1558811392_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 6,
				"body": "This seems to be every episode\nhttps://www.thepiratebay.org/torrent/17997516/The_Lone_Gunmen____Extras",
				"added": 1558816051
			}
		],
		"1558542225_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": [
			{
				"comment_id": 7,
				"body": "I just installed I2P+, but I cannot seem to load any i2p sites. I keep getting an error about \"The proxy server is refusing connections\" Is anyone else getting errors like this?",
				"added": 1558819181
			}
		],
		"1558996582_1Hx7GLooN8HF8bKYWYuq5P8G7HJ8Eo8cD8": [
			{
				"comment_id": 8,
				"body": "stuff",
				"added": 1559078054
			}
		],
		"1559218949_1EYRb6gKXJwpKXXqpb8JDtdRCAuQvAmnX": [
			{
				"comment_id": 9,
				"body": "> [duende](#comment_76_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, scum.\n\nWhy do you seem to have a problem with everyone on this site?",
				"added": 1559231997
			}
		],
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": [
			{
				"comment_id": 10,
				"body": "I like it. It is probably as close to English as a programming language can get. I personally prefer it over ruby because there is usually only one way to do things in python",
				"added": 1559908497
			}
		],
		"1560035677_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 11,
				"body": "https://winworldpc.com/library/operating-systems currently has archives of old operating systems (along with games and other abandonware). It's probably missing some, but it is a good start if you are planning on downloading any",
				"added": 1560036929
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 12,
				"body": "> [fantoski](#comment_55_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): I've created ZeroDox already ( Maintained by uvpda@zeroid.bit ), a DoxBin. \n\nI read this and thought that you created a website to reveal personal information on others",
				"added": 1561059667
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 13,
				"body": "If you are unable to get the VeraCrypt hidden OS to work, you could create an encrypted VM instead. It won't be as fast, and it won't be hidden (but it won't be as obvious it is there), but it should work with most computers",
				"added": 1561068185
			},
			{
				"comment_id": 14,
				"body": "> [insurgo](#comment_30_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): https://tails.boum.org/ [...]\n\nhttps://www.digi77.com/linux-kodachi/\nKodachi seems like it has more security and anonymizing features than TAILS, so it might be a better choice",
				"added": 1561076477
			},
			{
				"comment_id": 15,
				"body": "https://www.supremecourt.ohio.gov/rod/docs/pdf/0/2009/2009-Ohio-6426.pdf\n\nAssuming that your school is in the US, the school should not be able to search your laptop without your permission. In State v. Smith,124 Ohio St. 3d 163, 2009-Ohio-6426, the court ruled that, because of the 4th amendment, cellphones may not be searched without a warrant (unless there is probable cause). The court deemed that cellphones were similar to laptops, which require a warrant to search (unless there is probable cause). So if your boarding school is based in the US, then the school should not be allowed to search your laptop without permission.",
				"added": 1561165891
			},
			{
				"comment_id": 16,
				"body": "> [slamon](#comment_7_1PNJZzvokVc1fVcA3U6hXfRPSZLcEfYJAc): It's still worth hiding stuff.\n\nI agree, but if it is not possible using encryption and a hidden OS like the OP wants to do, then then not showing your data could be a solution, at least partially",
				"added": 1561229191
			},
			{
				"comment_id": 17,
				"body": "> [sunflowerr](#comment_4_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ): Actually it's in the UK. Does that change something?\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/674416/Searching_screening_and_confiscation.pdf\n\nIt seems like the same sort of thing applies to the UK. The school should not be able to search electronic devices without your permission, unless there is reason to believe that it is being used to break the law. You might want to do some further research to confirm my claim, but it seems like you don't need to show your data to the school if you don't want to (assuming you aren't breaking the law)",
				"added": 1561229843
			},
			{
				"comment_id": 18,
				"body": "> [pineapples](#comment_36_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): a private boarding school has every right to search their student's possessions, even electronic files, because they are not part of the government.  The school can have a policy that states that every student that attends must let the teachers or whoever search their belongings upon request.  If the student does not comply then the school will kick them out.\n\nNot entirely. In the US, if the school receives any federal funding, it must follow federal law. So while some private schools can search without violating the 4th amendment, not all of them can",
				"added": 1561342364
			},
			{
				"comment_id": 19,
				"body": "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/463220/Guide_to_Children_s_Home_Standards_inc_quality_standards_Version__1.17_FINAL.pdf\n\nYou could argue that the searching of your computer with no probable cause removes your reasonable privacy, which would violate part 3.36: \"Observation, monitoring or surveillance of children must not remove reasonable privacy, and should allow as much privacy as is possible, including in dressing, washing and using the toilet. A record must be kept of all observations in bedrooms to ensure that children are not subject to unnecessary invasions of their privacy.\"\n\nUK boarding schools are legally children's homes because they house children for 295+ days, which is why they must follow children's home's laws",
				"added": 1561343773
			}
		],
		"1561515103_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 20,
				"body": "I feel like this is a bad idea. ZeroNet was created to prevent censorship, and moderating what other's post seems like it will lead to ZN becoming like the rest of the clearnet",
				"added": 1561516555
			}
		],
		"1561690274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_357_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I don't understand this primal fear of life.If we take A.I. as something that learns from itself, isn't that what every organism does. [...]\n\nIt might be because if A.I. becomes too advanced, it could replace humans as the dominant species",
				"added": 1561740167
			}
		],
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 22,
				"body": "rapist has a 'p', voter does not",
				"added": 1561908648
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 23,
				"body": "Thanos had a pretty good solution...",
				"added": 1562430727
			}
		],
		"1562599452_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 24,
				"body": "The PDF and Download links do not seem to work",
				"added": 1562608626
			},
			{
				"comment_id": 26,
				"body": "> [technol0g](#comment_6_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK): fixed\n\nI just tried it again, and it still does not seem to work. I have tried forcing an update, and I tried deleting and redownloading the page, but neither solution worked.",
				"added": 1562696556
			}
		],
		"1562568127_1Cu9qgK9V7hFEBueV1SiB46L8AoUHF6mpo": [
			{
				"comment_id": 25,
				"body": "pirates bay",
				"added": 1562608667
			}
		],
		"1562698903_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC": [
			{
				"comment_id": 27,
				"body": "The python3 version can be updated to version 0.7.0, but it seems that the python2.7 version cannot, at least not yet.",
				"added": 1562699033
			},
			{
				"comment_id": 28,
				"body": "> [sergery](#comment_7_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC): Downloaded the fresh py3 exe from zeronet,but I keep getting errors with this dll(and probably 165 more after this one would work):The program can't start because api-ms-win-crt-runtime-l1-1-0.dll is missing from your computer. Try reinstalling the program to fix this problem.Tried 3 different ones,none of them worked.What else should be installed?Or maybe someone has a zip with all the additional .net dll's that are needed to run zeronet?\n\nDid you try restarting the computer? If I am remembering correctly, if windows has an update that it wants to install, some of the DLL's will vanish until the computer is updated. If that doesn't work, then you could try to reinstall the .NET framework",
				"added": 1562771917
			}
		],
		"1562840055_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": [
			{
				"comment_id": 29,
				"body": "On the GitHub page,  it says that you need to recompile the program for each new source. I know nothing about PureBasic, so this might not be possible, but wouldn't asking the user for input for each of the fields or having the user change a JSON file with the required fields be better instead of the user manually changing and recompiling the program for each new file?",
				"added": 1562865416
			}
		],
		"1563400508_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": [
			{
				"comment_id": 30,
				"body": "will there be a mac/linux version of this program?",
				"added": 1563461053
			}
		],
		"1563542681_189CZFM3FgMFXz6XvoFLNyPW6v5EBsp7M1": [
			{
				"comment_id": 31,
				"body": "As others have mentioned, it will likely be abused. But it will likely be abused by not only the government, but also by the citizens. The problem with \"hate speech\" is that everyone is different. If you were to say the dreaded \"n-word\" to a large group of people, some people will consider it hateful, while others don't. Now, lets say that you live in the UK, and you don't like someone. You could just say that that person is saying hateful things to you, and then they will go to jail.",
				"added": 1563565161
			}
		],
		"1563588405_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 32,
				"body": "> [kai0](#comment_1052_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): make a tool for zeronet, most chinese don't know to use IPFS because it can't run by click mouse. or you can make a app  for runing IPFS by click mouse.\n\nI'm a bit confused by your question. Are you asking about a tool that uploads videos to zeronet, or one that uploads to IPFS from videos on zeronet?\n\nAlso, IPFS is about as difficult (and possibly easier) to use as zeronet, so I don't see why Chinese people would have a hard time using it.",
				"added": 1563595642
			},
			{
				"comment_id": 33,
				"body": "> [kai0](#comment_1053_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): running IPFS need command not like zeronet just click mouse, that's why most chinese don't know how to use. if you can make a app for running IPFS just click mouse then most people know how to use it.you also can make a tool for copy video to zeronet site, running zeronet is much easy than running IPFS.\n\nIPFS can be used without installing anything. The site ipfs.io is on IPFS, but you can access it without running anything. ipfs.io also allows access to all of the files on IPFS. Installing IPFS allows the user to upload files and helps speed up the network, but files can be downloaded without installing",
				"added": 1563630457
			},
			{
				"comment_id": 34,
				"body": "> [kai0](#comment_1054_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): how to use IPFS without installing anything?\n\nYou can search for files on IPFS with ipfs-search.com and then download them through the cloudflare-ipfs links it provides",
				"added": 1563637451
			}
		],
		"1563904309_164cJJtm3Q2Xd7NZbFxJYngmW8MSqUMMxi": [
			{
				"comment_id": 35,
				"body": "> [kidcourageous](#comment_48_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Does Ross have access to bombmaking materials or someone who can order chem equipment on his behalf? If so I have a way to help him make life a little more fun :D\n\nNot saying how to make it, but the \"Mother of Satan\" is quite easy to make",
				"added": 1563908097
			}
		],
		"1563945520_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 36,
				"body": "> [duende](#comment_93_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): I just need you to die. Kill yourself, stupid.\n\nGod dammit, I thought you had finally left",
				"added": 1564018805
			}
		],
		"1564202615_15CpwjhYCsGTxsPjJTkyqRvdmDBTFZegbg": [
			{
				"comment_id": 37,
				"body": "> [quantumkitty](#comment_217_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): sharing copyrighted/censored content [...]\n\nI don't think that zeronet is the best choice for sharing copyrighted/censored content. Zeronet makes it easier to do so, but afaik it comes with no real anonymization features",
				"added": 1564282809
			}
		],
		"1564864827_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 38,
				"body": "I don't know your setup, but why don't you just use a USB hub mounted under your desk?",
				"added": 1564974242
			}
		],
		"1565142911_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 39,
				"body": "I saw a bunch of new posts and thought \"great! this app is becoming more popular!\" but I now realize it was all from the same person",
				"added": 1565143619
			}
		],
		"1565184146_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 40,
				"body": "> [bober](#comment_12_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): imagine a p2p wikipedia. suddenly the wikipedia mods/admins couldn't stroke their enormous epeens anymore\n\nIPFS has already started doing this when Turkey blocked access to Wikipedia",
				"added": 1565187750
			}
		],
		"1565208747_1L9UUSNK1aDxpsWShHAifBmnMXLSg18Rkn": [
			{
				"comment_id": 41,
				"body": "A nice grilled cheese with tomato soup on the side",
				"added": 1565212091
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_902_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're breathtaking!\n\nyou're all breathtaking!",
				"added": 1565295980
			}
		],
		"1565230737_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": [
			{
				"comment_id": 43,
				"body": "I'm a bit confused with what this plugin does. Does it route all i2p traffic through Tor?",
				"added": 1565297253
			}
		],
		"1565358483_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 44,
				"body": "Well the directors are wrong. Putting a backdoor into encryption will make it pretty much useless. It won't affect most people for a bit, but once one person manages to break the backdoor, they will have broken all of the encryption that uses it. And if that person releases the backdoor key, then everyone will be able to decrypt anything that uses that same backdoor.\n\nAs for how it affects ZeroNet, I am not certain. The ZeroNet app will likely not implement the any backdoors (if anyone tries, it can easily be removed by someone else). Online shopping will likely become unsafe because anyone who can decrypt the traffic could then steal credit card details",
				"added": 1565362542
			}
		],
		"1565527640_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 45,
				"body": "would it be a good idea to invest in large amount of helium, similar to the \"It's Always Sunny in Philadelphia\" gasoline scheme?",
				"added": 1565550429
			}
		],
		"1565562243_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM": [
			{
				"comment_id": 46,
				"body": "Hit me up on AOL instant messenger and as long as you have 17+ dial-up hours (assuming you have the latest 56.6kb/s modem) I can send you a Windows ME upgrade disc",
				"added": 1565574302
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 47,
				"body": "AFAIK nothing like that exists on ZeroTalk",
				"added": 1565577585
			},
			{
				"comment_id": 48,
				"body": "> [nickwa](#comment_337_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I think you missed the troll bait.\n\nyep",
				"added": 1565577669
			},
			{
				"comment_id": 49,
				"body": "> [tumbleweed](#comment_1_1HSJXS26WAFxab3etLidavpj5zki3bC1Pm): Every time you post a message on the Zeronet it has to be signed with your private key. So every message you post provides cryptographic proof of your identity. [...]\n\nThis seems like a good solution for the time, but IMO implementing a little dot next to the name or something would be better. Posting your public key to verify it is you not only runs the risk of the user accidentally posting their private key, but it also uses storage. Users only have 50K of posting storage by default, and including your public key in every post will cause you to use more storage than necessary",
				"added": 1565580642
			},
			{
				"comment_id": 50,
				"body": "> [tumbleweed](#comment_2_1HSJXS26WAFxab3etLidavpj5zki3bC1Pm): Every time you post a message on Zeronet you post your public key. It's part of your url for that message..😀\n\nah, I see. I don't know the all in's and out's of how ZeroNet works, but I guess I should have at least guessed that based on the fact that private keys are used",
				"added": 1565583642
			}
		],
		"1565645860_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 51,
				"body": "yes",
				"added": 1565646264
			},
			{
				"comment_id": 52,
				"body": "> [mg0](#comment_90_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): have you tried with bios-pw.org ?\n\nit doesn't seem to have support for lenovo/thinkpad laptops",
				"added": 1565646873
			},
			{
				"comment_id": 53,
				"body": "So after about a day of trying, it finally worked. Not really sure what I did differently, but now the time is set",
				"added": 1565648418
			}
		],
		"1565724346_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 54,
				"body": "> [bigbadbob](#comment_262_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): works for me\n\nStrange. I did prevent Tor from using 14 eyes countries in its circuits, so maybe that's the problem?",
				"added": 1565725177
			},
			{
				"comment_id": 55,
				"body": "I found the problem. I had set my security level to \"Safest\", and that caused youtube to break",
				"added": 1565729222
			}
		],
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 56,
				"body": "> [theecollector](#comment_31_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): when was this article posted??\n\n5 days ago",
				"added": 1565885662
			},
			{
				"comment_id": 57,
				"body": "@piracyisacrime Since when is it a crime to actually own what you pay for?",
				"added": 1565889403
			},
			{
				"comment_id": 58,
				"body": "> [styromaniac@kxoid.bit](#comment_101_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Anyone who thinks Trump was a triumph in democracy doesn't understand how rigged presidential elections are.\n\nexactly. a majority of the us had voted for hillary, but trump still won in the end",
				"added": 1565903662
			},
			{
				"comment_id": 59,
				"body": "> [styromaniac@kxoid.bit](#comment_102_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): You're not smart. Emphasis on \"rigged.\" Both national conventions only select what the donor class wants. You don't get a different president except by name and team color. The policies remain the same.\n\nI never said I was smart (also, I was agreeing with you, but whatever.) What I was trying to do (but I guess I failed to do) was to highlight the fact that despite a majority of the US population voting for one candidate, the other one won. If that doesn't scream \"rigged\" (at least on some level) then I don't know what will.",
				"added": 1565907122
			},
			{
				"comment_id": 68,
				"body": "> [nickwa](#comment_365_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Boohoo, you did not get the result you want from a select small big cities. Cry me a river.\n\nI mean, I didn't really want either of them. But my point I was trying to make is that even though a majority of the population voted for one candidate, the other one won. The same thing happened with George W Bush, Benjamin Harrison, Rutherford B Hayes, and John Quincy Adams. I just used the Clinton-Trump example because it was the most recent one",
				"added": 1565963929
			}
		],
		"1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 60,
				"body": "it appears to be used to allow users to create posts for specific topics (i probably explained that really poorly)",
				"added": 1565913413
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 61,
				"body": "\\> test\n> test\n&gt; test",
				"added": 1565925006
			},
			{
				"comment_id": 66,
				"body": "> If you want to meme text, Your going to have to use something called a hair space character before the > so the forum engine does not recognize it as a quote.\n\nyou could also use a '\\' instead. they both accomplish the same thing (although the hair space character looks better when viewing from the ZeroTalk list)",
				"added": 1565928768
			}
		],
		"1565925621_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 62,
				"body": "There is a good chance that I am wrong (at least in some part), but I do not think that the file is actually uploaded to other computers (again, there is a good chance that I am wrong). What I believe happens is that when you upload a file, X number of announcers are told that you are now seeding your file, which allows others to actually find it. Then, when another user wants to view your file, they download it and then become a seeder as well. (Once again, this is my understanding of what happens. In the very likely case that I have made a mistake, please feel free to correct me)",
				"added": 1565925983
			}
		],
		"1565925178_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 63,
				"body": "> [iloveguac](#comment_2_1A2bJUxDcvDbsZ1ttC1fSgy6J74ghfmpxU): http://127.0.0.1:43110/1MusicXkuN2pk5hRdmroeyaCLDJtzTicpB/Not sure if I'd say it's good, but it's the only thing I know of.\n\nIs there any music currently on it? I can't seem to find any",
				"added": 1565926187
			},
			{
				"comment_id": 64,
				"body": "> [memesadler](#comment_85_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I tried uploading something and then refreshed, and then there was a bunch of music available. Maybe need to give it a moment.\n\nYep, I just needed to refresh the page. Strange that you need to do that though. \nAlso, no, I cannot see \"Morraiku\" anywhere",
				"added": 1565926998
			},
			{
				"comment_id": 65,
				"body": "> [memesadler](#comment_86_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Alright. I dunno what's wrong then. Can't find a FAQ or anything.\n\nI can't upload anything either. My guess is that either the creator of the site uploaded everything, or (s)he selects which users can upload",
				"added": 1565927440
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 67,
				"body": "\\> Claims white people racist\n\\> Also claims that black people are practically monkey people and have non-functional brains\n\nI'm starting to suspect trolling...",
				"added": 1565934739
			}
		],
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 69,
				"body": "> [trevorlaneray](#comment_69_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): many if not most Ring users' surveillance extends only as far as the front walkway, and doesn't extend to capturing the public walkways/streets\n\nThey don't extend there yet, but sooner or later police will try to convince users to position the cameras to see public walkways/streets in order to \"help homeowners see threats from further away\"",
				"added": 1565969620
			}
		],
		"1566010067_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 70,
				"body": "> [dkeyzjkeys](#comment_7_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): Post I'm referring to:   [...]\n\nit might be helpful to put the original post in quote form. A full list of formatting options can be found [here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM)",
				"added": 1566010534
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 71,
				"body": "```>++++++++++[<+++++++>-]<+++.>>++++++++++++[<++++++++++>-]<----.>>++++[<++++++++>-]<.>>++++++++++[<+++++++++++>-]<-.>>++++++++++++[<++++++++++>-]<---.>>++++++++++++[<++++++++++>-]<-----.>>++++++++++++[<++++++++++>-]<----.>>++++[<++++++++>-]<.>>++++++++++[<++++++++++>-]<--.>>++++++++++[<++++++++++>-]<+.>>++++[<++++++++>-]<.>>++++++++++[<++++++++++>-]<.>>+++++++++++[<++++++++++>-]<+.>>++++++++++[<+++++++++++>-]<.>>++++++++++[<++++++++++>-]<+.```",
				"added": 1566050221
			},
			{
				"comment_id": 74,
				"body": "> [crazylime](#comment_119_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): you need to debug your shit\n\nYour right. Boy am I bad at programming",
				"added": 1566051949
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 72,
				"body": "I sense many more Brexits coming in the future",
				"added": 1566051260
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 73,
				"body": "> [n00dle](#comment_14_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB): I have no idea why you'd want to use Nano.\n\nI think the main reason is because there is a limited amount of it.",
				"added": 1566051793
			}
		],
		"1566749586_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 75,
				"body": "> [edgelordofdecent](#comment_71_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): NVM. Forum is dead\n\nShame. I was really interested in how the Chinese citizens felt about the system.",
				"added": 1566768667
			}
		],
		"1566970108_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 76,
				"body": "It might be better to create a \"Group\" instead of a \"Topic\" so that people can have different conversations that all fall under the umbrella of \"geekery\"",
				"added": 1566998056
			}
		],
		"1567558797_1K5YHnyAFQxWB6x7bnX2yF7D82f34aeVzp": [
			{
				"comment_id": 77,
				"body": "I believe that it is currently being worked on (but I may be wrong). The benefits are similar to Tor in the sense that both services would provide the user will anonymity. The difference though is that while Tor is slowed down by torrenting (which ZeroNet uses), I2P encourages (and i believe is built for) torrenting because it helps with the everyone's overall anonymity.\n\nOne drawback is that ZeroNet might be slower if it switches to I2P. In my experience, I2P has been much slower than Tor, and has also been a bit less reliable (although the websites are all coming from centralized sources, so these might not be issues for ZeroNet)",
				"added": 1567560444
			}
		]
	},
	"comment_vote": {
		"1_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"11_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"5_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": 1,
		"1_1GDPysbDrdZ6uPCik1b1VZPDwoVM59kcti": 1,
		"5_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": 1,
		"7_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"65_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"10_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"124_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"7_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"826_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1L9UUSNK1aDxpsWShHAifBmnMXLSg18Rkn": 1,
		"5_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"17_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"266_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"2_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"2_15Pwu5qSwuLDbQeJPixgirchJGHcHw4ioT": 1,
		"15_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i": 1,
		"72_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"47_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"24_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1035_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"149_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"121_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"122_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"156_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	}
}