{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1608376973_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 1,
				"body": "well If you want the majority to know something there needs to be a massive coordinated effort to inform them (i.e. memetic warfare) because Government intelligence agencies have been and continue spreading propaganda, waging psychological warfare on peoples minds about the virus and the vaccine. The human mind can easily be subverted on its own into thinking something not real is real, it happens with small things everyday. The rulers know this very well and use it as a weapon to control the population. All of the campaigns by groups i know trying to say its not real and a hoax with facts have been silenced and shutdown very quickly with even police raids happening. The fact that the majority of people use msm, and sites like twitter or facebook as their main source of information doesn't help either, the maintainers have total control over the narrative and what is being posted. All they have to do is delete what they don't want the public to know.\nAs you mentioned about those who think its still real. They might just be letting them who are against the measures but still think the virus exists to talk because they know their solutions don't really amount to anything, but still help create an illusion of a real virus spreading. Meanwhile they will come down hard on those who say it doesn't exist since that would be like a silver bullet to destroy their hoax if it ever catches on. I mean  admitting it doesn't exist explains 100% of all the \"mysteries\" that surrounds this\"virus\", the puzzle pieces all just fall into place and the house of cards come tumbling down once you know that its not real. It would be devastating to the scammers for this to be found out so thats why they must suppress the idea at all costs.",
				"added": 1608490990
			}
		],
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": [
			{
				"comment_id": 2,
				"body": "no one seems to mention there is somethign called an 'ecological limit'. Once an organism or species reaches a maximum capacity that the earth can handle it needs to be partially wiped out to make room. Organisms will either commit suicide or something happens that causes it to die rapidly. So if covid-19 was really deadly, even if we were to prevent it from spreading and save lives nature will find another way to wipe us out and it will probably be a lot more painful than what nature intended since now we humans have put it into our hands. Im guessing mass starvation, war or genocide due to lockdowns and unrest created from it.",
				"added": 1608491837
			}
		]
	},
	"comment_vote": {}
}