{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "La Démocratie Participative censurée - z'en pensez quoi ?",
			"body": "Bonjour,\nVous pensez quoi de la censure de Démocratie Participative sur les DNS français ?\n\nhttp://democratieparticipative.biz/\nhttp://democratieparticipative.online/\nhttp://democratieparticipative.site/\nhttp://democratieparticipative.website/\nhttp://democratieparticipative.host/\n... _to be continued_\n\nPS: https://dailystormer.name/ a eu le même problème aux USA de la part des acteurs privés sans demande expresse de l'état",
			"added": 1550494984
		}
	],
	"topic_vote": {
		"1_14cNvEtRCWjLHb91ezEZRyvAwU12xWgHfu": 1,
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 1,
				"body": "C'est un peu antisémite tout ça non ?\n\n__\"TELLING THE TRUTH IS NOT ANTISEMITIC. AM I RIGHT?\"__\n-- Joe Wood, (African-American author),\nin Berman, Paul. Blacks and Jews: Alliance and Arguments,\nDelacorte Press, NY, 1994, p. 112\n\n__\"THE HUNT FOR ANTI-SEMITES IS A HUNT FOR POCKETS OF RESISTANCE TO THE NEW WORLD ORDER, LIKE NAZIS GOING HOUSE TO HOUSE.__\n-- Israel Shamir\n\nL'influence juive est-elle bienfaisante ? \nhttps://en.metapedia.org/wiki/Jewish_supremacism\n\nLivre à feuilleter :\n\n_When Victims Rule. A Critique of Jewish Pre-eminence_\n \nhttps://archive.org/details/WhenVictimsRuleInteractive\n",
				"added": 1550495781
			},
			{
				"comment_id": 2,
				"body": "> [pingz](#comment_2_1JxTVTQpiC4PhPqKDk2y6sZB4ApX2nPAJ8): pauvre malade mental, toi tu est gilet jaunes j'en suis sur :)\n\nTu es ignorant. La plupart des génies de ce monde avait une opinion acérée sur ce sujet. \n\n(Kant, Wagner, Shakespeare, Goethe, Ronsard, d'Holbach, Rousseau, Dickens, John Lennon, Gandhi, Freud, Simenon, Marlon Brandon, et des centaines d'autres)  \n\nQuelques citations : https://fr.wikiquote.org/wiki/Antis%C3%A9mitisme \n\n\n__On peut s'opposer à l'influence catholique__, mais on ne peut pas s'opposer à l'influence juive ; pourquoi ? \n\nCette influence semble pourtant bien davantage prégnante que l'église (ex. CRIF et DILCRAH), à comparer la réaction du pouvoir médiatique face aux dégradations d'églises par rapport à celles d'une synagogue.\n\nRegarde ce documentaire par un juif : https://www.youtube.com/watch?v=OPp3wVkYMes (https://invidio.us/watch?v=OPp3wVkYMes)\n\nBref celui qui ne s'aveugle pas le voit. \n\n\"__From Buenos Aires to Baghdad, from the days of Rome to the present, the world talks about Jews and their special relationship to wealth__ ... The really peculiar part of these slogans about Jews and money ... is the equivocation with which Jews react to the charges ... Proud of their financial achievements, American Jews often congratulate themselves and their success, but when a non-Jew points to the same Jewish affluence, American Jews become extremely nervous and suspect lurking anti-Semitism.\"\nJoshua Halberstam, _Schmoozing: The Private Conversations of American Jews_, 1997, p. 10]\n\n",
				"added": 1550502895
			},
			{
				"comment_id": 3,
				"body": "_La patrie du juif, ce sont les autres juifs ; aussi combat-il pour eux, comme_ pro ara et focis, _et nulle communauté sur la terre n’a autant de ferme cohésion que celle-ci. Il ressort de la combien il est absurde de vouloir leur attribuer une part dans le gouvernement ou dans l’administration de n’importe quel État._\n\n__Arthur SCHOPENHAUER__ – “A propos de la doctrine du droit et de la politique”, Parega et Paralipomena, 1851.",
				"added": 1550506079
			}
		]
	},
	"comment_vote": {
		"18_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": 1,
		"1_14cNvEtRCWjLHb91ezEZRyvAwU12xWgHfu": 1,
		"2_14cNvEtRCWjLHb91ezEZRyvAwU12xWgHfu": 1
	}
}