{
	"title": "ItadakiAnime",
	"description": "¡Anime y más!",
	"links": "- [Visita el Facebook Oficial de este blog](http://fb.com/itadakianime)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1458255600,
	"post": [
		{
			"post_id": 4,
			"title": "Kanokon",
			"date_published": 1458253901.844,
			"body": "<center><img src=\"http://covers.cbrd.info/90aee99a773278ec33fe86c46ded8745_xl.jpg\" width=\"300\" height=\"300\"/></center>\nKanokon es de esas series que no te puedes perder tiene buena comedia y bastantes esenas ecchi haciendolo un Anime que recomendaria a todo aquel que me pregunte sobre una serie Anime, consta con 12 capitulos y 10 especiales (OVA). Esta serie nos cuenta sobre Kōta y Chizuru,  Kōta es un estudiante que se traslada a la academia Kunpō.  En su primer día de clases, una simpática estudiante de segundo año llamada Chizuru Minamoto le pide que vaya en su encuentro, solo, en la sala de música para conocerse. Cuando él llega, ella le confiesa que está enamorada de él y accidentalmente le revela que ella es en realidad una kitsune(zorro o espiritu de zorro no dire zorr@ porque en parte suena vulgar). Desde ese día los dos van juntos a la academia, y Chizuru se cuelga constantemente en Kōta algo que lo desconcierta grandemente debido a que otros lo miran despectivamente. Poco después de que la historia comience, una deidad lobo llamada Nozomu Ezomori se transfiere a la escuela y clase de Kōta. A partir de ese día, su vida se verá interrumpida por estas dos deidades, quienes competirán para decidir quien le corresponde a Kōta.\nFicha Tecnica:\nDirector: \tAtsushi Ōtsuki\nEstudio: XEBEC\nCadena televisiva: AT-X\nPrimera emisión: 5 de abril de 2008\nÚltima emisión: 21 de junio de 2008\nEpisodios: 12 + 10 especiales\nTe interesó la serie? Puedes verla online inmediantamente a travez de: [Animeflv.me](http://animeflv.me/Anime/4834/kanokon2008-subbed/)"
		},
		{
			"post_id": 3,
			"title": "[Youtube] Date a Live Mayuri Judgement",
			"date_published": 1458252454.05,
			"body": "La nueva pelicula de Date A Live en sub español se puede ver online a travéz de https://www.youtube.com/watch?v=7JcaCgf34L0    subido por su servidor ItadakiAnime, recuerden compartir y difundir la pelicula con amigos o gente que quieran verla esta subtitulada en Multi Idioma incluyendo el Español de latinoAmerica. Si pueden y sería de mucha ayuda ayudarme con un Like en Facebook para seguir en este proyecto."
		},
		{
			"post_id": 1,
			"title": "Bienvenido a ITADAKIANIME",
			"date_published": 1458262579,
			"body": "Sean bienvenidos a este BLOG. ITADAKIANIME es un proyecto de Anime\ny cultura Japonesa en general. <style type=\"text/css\">html {background-color: black; }\n.divbottom {position:  fixed; z-index: 100; right: 00.00px; bottom: 00.00px;}\n</style>\n<div class=\"divbottom\">Hola</div>"
		}
	]
}