{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1612173389,
			"title": "Prevention, treatment, and sequelae treatment for COVID-19",
			"body": "For Western medicine, COVID-19 is a life-threatening disease; while for Chinese medicine, COVID-19 is just a cold.\nAfter the Wuhan epidemic is over, you basically can't hear anyone in China dying because of COVID-19. That's because Chinese medicine works silently.\n\nTCM prescriptions applicable to COVID-19:\n多成中醫疫症救援\nDuoSuccess TCM Prevent and Cure Epidemic\nhttp://127.0.0.1:43110/DuoSuccess.bit/data/sos004.html\n\nHope u healthy!",
			"added": 1612173388
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "The United States accuses China of producing the virus, and China accuses the United States of producing the virus.\nChina has invited the World Health Organization to the Wuhan Institute of Virology to conduct an investigation, while the United States refuses to open Fort Detrick.\nYou tell me, whose suspicion is greater?",
				"added": 1611894531
			},
			{
				"comment_id": 2,
				"body": "> [aim64c](#comment_84_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): The people who drummed up the idea of a medical emergency over a virus where the testing methods have an 80% false-positive rate and locked down the world's economy over blatantly financial and political purposes.One of the first things I thought about when I saw the videos coming out of China was: \"Hmm... strange that these get around the proverbial great firewall.\"  Their method of injection into the internet and the claims surrounding them was designed to create panic and confusion.It is my belief that the virus does not need to exist to account for the record of scientific data and behavioral reactions.  Governments quickly began giving out additional money to 'pandemic affected' areas, as determined by doctor diagnosis.  Doctors were encouraged and hospitals financially motivated to inflate their covid reporting numbers and to conflate common cold symptoms with a novel pandemic virus where possible to do so (and room to do so was ample).The methods used to test for the virus do not require the virus to be isolated and are known to be prone to false positives.  The false positive ratio is so high as to allow for the appearance and persistence of completely phantom outbreaks which appear to have an epidemiological link, but are just false positives linked to false positives.  Screening has been rolled out on a level never before seen in human history, and applied very irregularly around the world, as well - with some nations opting to test the same individuals multiple times over several months while others only testing individuals in response to hospitalizations or symptoms.  With districts having reason to over-report infections and deaths, the accuracy of data is fundamentally compromised and cleaning the data to get an accurate picture of what, if anything, is going on is difficult.There are always strains of the cold which run around, and some years it is worse than others for some people - for whatever reason.  At this point, the narrative and research surrounding influenza should honestly be brought into question about whether or not the people who think they know what they are talking about actually know their ass from applesauce.  But I digress...What is also suspicious is that the flu is nearly absent from our society.  Not only are fewer people returning positive tests for it, the ratio of positive tests is also far smaller than it has been in the past.  Given that SarsCov 2 is supposed to have a virtually identical lifecycle to influenza, it makes little sense that the measures against covid would be any more or less effective against it than the flu.  This is particularly true given the existing medical research which indicated that masks and distance were not effective at containing the spread of influenza in the past.One must wonder if influenza was similarly amplified for political purposes as there are large contracts for vaccine drives and distribution each year. [...]\n\nI doubt that we are discussing the same thing.\nThe main post accuses that COVID-19 is a biological weapon made in China. I disagree. I accuse that COVID-19 is a biological weapon made in the United States. And you told me that this virus is no big deal at all, let alone being used as a weapon.\nIn fact, as China is the engine of the world economy, locking in the world economy will not do any good to China.\nFor those who believe that the COVID-19 virus is a biological weapon, I recommend two videos to you:\nhttps://www.youtube.com/watch?v=3J6zm6zgah0&t=413s\nhttps://www.youtube.com/watch?v=cdKI5qOF_a8&t=200s",
				"added": 1612000180
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 3,
				"body": "Goodwill has never been let down like it is today.\nConsidering that some people like conspiracy theories so much, let me give you some interpretation of conspiracy theories:\nhttps://www.quora.com/How-about-the-Chinese-CG-artist-Wuhe-Qilins-new-drawing-Command-and-Conquer/answer/Karl-Fredrick",
				"added": 1612235722
			},
			{
				"comment_id": 5,
				"body": "> [anonysan]......\n\nPlease delete this. Your words have nothing to do with this subject. \n\nDon't be an annoying person.\n\nI've muted you on the ZeroBit. So I will not see your words any more. Please stop polluting this topic.",
				"added": 1612239789
			},
			{
				"comment_id": 6,
				"body": "ZeroNet is a great software, it gives people the most precious freedom. But some people don't deserve it.",
				"added": 1612260476
			},
			{
				"comment_id": 7,
				"body": "> [goldsmith](#comment_7_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu): Throw out your TV, wipe your ass with the diaper and realize that a disease with a survival rate of 99.9% is a fucking joke.\n\nCovid: New lockdowns for England and Scotland ahead of 'hardest weeks'\nhttps://www.bbc.com/news/uk-55538937\n\nJapan, the host country of the 2020 Olympic Games, although it has been postponed for one year, a new ban was announced on January 14, 2021, prohibiting all foreigners from entering the country.\nhttps://edition.cnn.com/2021/01/13/asia/japan-coronavirus-emergency-olympics-intl-hnk/index.html\n\nCOVID-19 is not a scam. You believe it is, simply because you have not been infected.\n\nCherish your life!",
				"added": 1612313634
			},
			{
				"comment_id": 8,
				"body": "> [theborg](#comment_20_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): its a scam\n\nWell, you do have the right to think it is a scam. But please remember this post, in case one day you find that it is not a scam, you need it.",
				"added": 1612355736
			},
			{
				"comment_id": 9,
				"body": "> [theborg](#comment_22_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): ...... But in the sense that it's a created, manufactured crisis. \n\nYou see, you also admitted that it is a crisis. As doctors, we don't care how the crisis came, we just solve it. So, in case you need treatment, please remember us.",
				"added": 1612425244
			}
		]
	},
	"comment_vote": {
		"16_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1
	}
}