{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Немного о политике СССР и современной России",
			"body": "САТАНИНСКИЙ МЕТОД ЗОМБИРОВАНИЯ - способ зомбирования, при котором власть имущие исподволь подталкивают население к совершению каких-либо осуждаемых действий (и/или к фантазированию о совершении таких действий), и сами же осуждают/наказывают граждан за совершение данных действий (за фантазии о данных действиях). В результате люди испытывают страх, чувство вины, становятся закомплексованными и стараются \"не высовываться\" - т.е. не критиковать власть, не требовать от политиков слишком многого и пр. Данный метод практикуют в основном управляющие государствами радикальные иудеи - собственно, поэтому он и назван сатанинским (дело в том, что в соответствии с представлениями иудаистов сатана, Сатан - это в целом положительный персонаж, который сначала подстрекает людей к греху, а после того, как те поддаются соблазнам, обвиняет их на \"высшем суде\" и забирает души приговорённых к смерти грешников - такие его действия считаются \"весьма хорошими\", см. http://toldot.ru/urava/ask/urava_6209.html).\nЗачастую сатанинский метод применяют пропагандисты СЕКСОФОБИИ: они сначала подталкивают граждан к совершению сексуальных \"прегрешений\", а через некоторое время (либо одновременно) осуждают их за \"грехи\". Притом некоторые из этих \"прегрешений\" не являются грехами в соответствии с писаниями - пропагандисты пекутся не о соблюдении религиозных канонов, а в основном о своих личных интересах. К примеру, в РФ светско-лжерелигиозные власти пропагандируют ПЕДОФИЛИЮ и ЭФЕБОФИЛИЮ: по телевидению уже много лет транслируется детское порно, проправительственные махинаторы смакуют подробности отношений с несовершеннолетними в телепередачах и интернете - и при этом осуждают \"извращенцев-педофилов\". Для усиления эффекта сексофобствующие агитаторы делают упор на рекламирование гомосексуальной педофилии - чтобы граждане не только комплексовали по поводу своих педофилических фантазий, но и испытывали гомофобские комплексы. Также власти рекламируют и порицают обычные однополые связи, инцест, т.н. \"разврат\" и т.д. - в результате чего большинство россиян уже превратились в запутавшихся закомплексованных \"грешников\", которые осознанно либо бессознательно боятся осуждения и поэтому раболепствуют перед властью.\nКак уже было сказано, сексофобствующие махинаторы могут рекламировать и осуждать \"грехи\" как одновременно, так и не одновременно. Зомбирование по схеме \"сначала реклама, а потом осуждение\" проводилось, к примеру, после революции в СССР: грубо говоря, при Ленине людей сексуально раскрепощали, а при Сталине закрепощали. В РФ начиная с 1990-х гг. происходило (происходит) примерно то же самое: при Ельцине началось в целом позитивное глобальное раскрепощение, а при Путине оно на первых порах продолжилось, но потом началась пропаганда мракобесия - вопли насчёт \"разврата\", гомофобная истерия, запреты на кружевное бельё/высокие каблуки и пр. Причём \"одновременный\" и \"неодновременный\" способы сатанинского зомбирования могут применяться параллельно, что ещё больше запутывает и подавляет граждан.\nЧитайте также НОВАЯ СЕКСОФОБНАЯ ПОЛИТИКА, ПЕДОФИЛОФОБИЯ, ШИЗОФРЕНИЗАЦИЯ СЕКСОФОБНАЯ в Мини-сексопедии, \"НЕКРОиудаизм - РЕЛИГИЯ СМЕРТИ\", \"СЕКС и БИБЛИЯ: как псевдосвященники ОБМАНУЛИ человечество.\", \"Заметки об ИУДАИЗМЕ\" и др. по ссылкам выше.",
			"added": 1482661698
		},
		{
			"topic_id": 2,
			"title": "Лингвистический тред",
			"body": "",
			"added": 1482866276
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 1,
				"body": "Я думаю, что либо также \"стабильно\" станет на пост президента Медведев (Мендель) или  его преемник с фашистским курсом (что более вероятно), либо победит Навальный ибо веяние \"Крымнаш\" 2014-ого года уже спадает на нет, да и сионистские пропагандисты сбавили темпы нацистской пропаганды (им удалось отвлечь народ от преступлений власти так, что уже обложили гоев туевой хучей налогов которые тратят в жертву бесполезной роскоши, жестко зацензурили рунет). Хотя я думаю, что наша страна вряд ли в ближайшее время насытится материальными благами и свободами как в развитых странах ЕС, пока большинство людей не избавится от жидовско-пуританских моральных ориентиров",
				"added": 1482660987
			},
			{
				"comment_id": 2,
				"body": "Сам я не пойду на выборы, ибо пока большая часть людей не избавится от человеконенавистнических, пуританских идей, в нашей стране ничего по-большому счету к лучшему не изменится как показывает история. А что касается большевистской революции, распада СССР, то радикальные иудеи просто применили сатанинский (от имени Сатан, который у иудеев считается нормальным ангелом смерти который сначала провоцирует, соблазняет жертву, а потом ее же обвиняет на суде за то, к чему он ее подстрекал) метод зомбирования (также такой метод зомбирования называется созданием шизофренических ситуаций) который заключается в следующем: сначала рекламируют обычные, общечеловеческие ценности, а потом их же запрещают. Пока народ не поймет, что СССР развалили не \"проклятые пиндосы со своей дерьмократией\", а те же самые КПСС-ные жиды (которые и закрепощали народ) чтобы внушить населению что свобода и материальные блага - это \"плохо\", то жизнь страны не станет ни на капельку райской...",
				"added": 1482661608
			},
			{
				"comment_id": 7,
				"body": "> [shift](#comment_326_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Где покупаете и осталось ли там еще?\n\nЧто покупаю?",
				"added": 1482839876
			},
			{
				"comment_id": 9,
				"body": "> [shift](#comment_329_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): От куда я знаю что конкретно, но поток сознаний какой-то /странный/\n\nСм.: http://127.0.0.1:43110/1kFLTtbWKEyo4hpYMQjXCArQfa7VGpk8E/?Post:55:New+blog+post",
				"added": 1483136485
			}
		],
		"1_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": [
			{
				"comment_id": 3,
				"body": "ШИЗОФРЕНИЗАЦИЯ СЕКСОФОБНАЯ - сексофобное зомбирование населения путём создания т.н. шизофренических ситуаций с целью эксплуатации граждан. Шизофреническими называют ситуации, в которых люди должны выполнять взаимоисключающие требования, причём в результате исполнения/неисполнения этих требований они в любом случае могут быть осуждены/наказаны, например:\n1. Родители требуют от ребёнка всё и всегда им рассказывать, но одновременно внушают ему, что ябедничать нехорошо (вследствие чего ребёнок не может рассказать, и одновременно не может не рассказать о плохом поведении своей сестры, т.к. он в любом случае поступит \"неправильно\").\n2. От мужчины на свидании требуется вести себя настойчиво (потому что это \"по-мужски\", женщину \"надо добиваться\"), но и одновременно сдержанно (т.к. решительное поведение может быть расценено как попытка изнасилования).\nРегулярное попадание в шизофренические ситуации вызывает у людей растерянность и заторможенность, а по некоторым данным иногда даже приводит к развитию у них шизофрении.\nЗомбирование народа с помощью шизофренизации проводится с давних времён. Ещё до н. э. древние евреи воспевали в иудаистском писании (Торе) половую любовь, но в то же время вносили в это же самое писание массу половых запретов. В Торе содержатся в т.ч. и прямые противоречия - к примеру, в разных местах данной книги не осуждается, а затем запрещается инцест, запрещаются, а затем воспеваются однополые связи и т.д. Т.о. евреям по сути внушали, что любить и заниматься любовью отчасти хорошо, но скорее всё-таки плохо, что совокупляться можно и даже нужно, но одновременно и нельзя - т.е. осуждение/наказание предполагалось в любом случае, как за секс, так и за отказ от секса. Позже иудейское шизофренизированное писание было навязано под видом \"христианского Ветхого завета\" христианам, а затем, в сильно изменённом виде - мусульманам (см. статьи \"НЕКРОиудаизм - РЕЛИГИЯ СМЕРТИ\", \"ГЛАВНЫЕ СЕКСОФОБЫ - праведники или фашисты?\" по ссылкам выше). Адепты неавраамических конфессий тоже попали под влияние иудаистов. В результате нееврейские народы также стали подвергаться половой шизофренизации.\nВ т.н. \"христианских\" странах это веками проявлялось в основном в воспевании \"законной\" любви, и в одновременном осуждении \"незаконных\" (внебрачных, однополых и др.) связей. Православным частично запрещалось и до сих пор запрещается вступать в т.ч. и в супружеские сексуальные отношения - по определённым дням, во время поста и пр. То есть с одной стороны супружеский секс - это как бы неплохо, и поэтому надо \"плодиться и размножаться\", а с другой стороны - \"грех\", поэтому лучше заниматься им пореже, только тогда, когда разрешает церковь. Получается, православные прямо либо косвенно осуждают друг друга как за секс, так и за \"неразмножение\", в результате чего они всегда подсознательно чувствуют себя грешниками.\nУ мусульман шизофренизация проводится по большей части путём запрещения добрачного разнополого секса (считается, что супружеский, даже полигамный секс - это допустимо, а добрачные отношения \"греховны\"), а также при помощи разделения однополых отношений на допустимые и недопустимые (в исламских странах традиционно запрещаются гомосексуальные связи между взрослыми мужчинами, но разрешается сексуальное использование мальчиков; т.о. проявления гомосексуальности считаются одновременно и греховными и нормальными, иногда даже желательными, хотя некоторые исламские лидеры осуждают также и ПЕДОФИЛИЮ).\nВ современных \"цивилизованных светских\" обществах население шизофренизируют в основном с помощью относительно \"свежих\" половых предрассудков - см. НОВАЯ СЕКСОФОБНАЯ ПОЛИТИКА. В частности, людей зомбируют путём нагнетания т.н. педоистерии (когда с одной стороны педофилия категорически запрещается, но с другой - фактически рекламируется: гражданам как бы запрещают даже думать о педофилических отношениях, но в то же время не дают возможности о них не думать - думать \"надо\", потому что это серьёзная проблема и т.д. - см. ПЕДОФИЛОФОБИЯ).\nВ РФ в последние годы нагнетается всё та же педоистерия, а также пропагандируется ГОМОФОБИЯ. Причём травля представителей секс-меньшинств фактически поощряется, но юридически запрещается - людей осуждают как за толерантное отношение к ЛГБТ, так и за гомоненавистничество. К тому же, проправительственные СМИ косвенно рекламируют однополые отношения, см. ПРОПАГАНДА ГОМОФОБИИ. Усиленное пропагандирование в последние десятилетия преступного образа жизни, и в частности уголовных \"понятий\" привело к тому, что активных гомосексуальных насильников зачастую считают \"крутыми авторитетными мужиками\", а их жертв или просто пассивных гомосексуалов - недостойными уважения. Т.о. жители России как бы должны уважать одних гомосексуалистов, но при этом осуждать и презирать других - притом нарваться на неприятности можно в любом случае (см. \"ОПУСКАНИЕ\" в Мини-сексопедии, \"ГОМОФОБИЯ: причины и ПОСЛЕДСТВИЯ\" по ссылкам).\nВласти шизофренизируют население не только путём одновременного пропагандирования и осуждения сексуальных связей - иногда граждан сначала годами сексуально раскрепощают, а потом долго закрепощают. Так было, например, после революции в СССР: грубо говоря, Ленин раскрепощал людей, а Сталин закрепощал. И сейчас мы наблюдаем в РФ примерно то же самое: при Ельцине началось в целом позитивное глобальное раскрепощение, а при Путине оно поначалу вроде бы продолжилось, но потом началась пропаганда мракобесия - вопли насчёт \"разврата\", гомофобная истерия, запреты на кружевное бельё/высокие каблуки и т.п. Естественно, многие россияне пребывают в полном замешательстве по поводу допустимости тех или иных проявлений сексуальности, со всеми вытекающими отсюда последствиями.\nОднако даже в тех случаях, когда сексофобные ограничения вроде бы являются абсолютно понятными и однозначными (например: \"после свадьбы можно, а до брака - ни в коем случае\"), люди всё равно невольно путаются, и в результате начинают страдать от вышеописанных последствий шизофренизации - становятся растерянными, заторможенными, шизофрениками... Что как раз и позволяет властям их контролировать и активно эксплуатировать, т.к. запутавшихся тугодумов можно легко подчинить своей воле.\nЧитайте также САТАНИНСКИЙ МЕТОД ЗОМБИРОВАНИЯ в сексопедии, статьи о лжерелигиях по ссылкам выше.",
				"added": 1482661746
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 4,
				"body": "Есть ли в ZeroNet утилиты для блокировки трафика от определенных пиров (чтобы, например, спам не сохранялся на моем жестком диске)?",
				"added": 1482661969
			}
		],
		"4_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 5,
				"body": "Тут даже пара юзьверов с КНДР есть. О каком Китае вы говорите? Чтобы заблокировать ресурс в P2P сети надо у каждого пользователя этого ресурса отобрать  подключение к интернету, а это и слишком расточительно (даже для таких коррумпированных стран, как Россия, КНДР, латиноамериканские республики и т.д.) для 3.5 небыдла, и им самим будет жопа даже от ватников (если ZeroNet начнут использовать массово) из-за таких блокировок",
				"added": 1482662556
			},
			{
				"comment_id": 6,
				"body": "Единственная проблема многих P2P ресурсов - отсутствие возможности фильтровать спам-трафик (что можно  было бы сделать любому пиру путем блокировки трафика от определенных ID), так что децентрализованная сеть уязвима к атакам/вайпу еще сильнее, чем обычный интернет",
				"added": 1482662688
			}
		],
		"2_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR": [
			{
				"comment_id": 8,
				"body": "1) Как во французском начали произносить вместо альвеолярного дрожащего/тапа увулярный дрожащий/фрикатив? Наиболее распространенная версия гласит о том, что такое дефектное произношение распространилось сначала среди высших слоев общества, а потом уже среди широких масс (посему во Франции сейчас альвеолярная артикуляция дрожащего/тапа считается признаком деревенщины, как в русском гхэканье). Но это опять не дает ответа на вопрос о том, как вообще альвеолярный дрожащий/тап мог перейти в увулярный дрожащий, ведь невозможно представить никаких промежуточных вариантов произношения между [r] и [ʀ] (а вот между [r] и [ɹ] можно такую цепочку проделать: [r] -> [ɾ] -> [ɾɹ] -> [ɹ] или [r] -> [̝r] -> [ɹ]). А в распространение дефекта речи среди влиятельных слоев общества тоже вряд ли можно представить: за всю историю России, например, были и картавые политики, и картавые актеры и т.д., но почему-то увулярное произношение /r/ не получило распространение среди верхушки. Хотя переход [r] в [ʀ~ʁ] мог возникнуть из-за того что /r/ перед заднеязычными согласными произносилось как увулярный трилл сначала только перед заднеязычными согласными (такая же аллофония наблюдается у /n/ во многих германских языках), а потом удобства ради заменили увулярным триллом/аппроксимантом звук [r] во всех позициях\n\nИ все таки увулярное произношение /r/ возникло первее во французском языке чем в германских, ибо почти во всех германских языках, где распространена увулярная артикуляция /r/, в отличие от французского, увулярный трилл/аппроксимант считается лишь одним из независимых вариантов произношения /r/ (в отличие от французского где [ʀ~ʁ] считается стандартным произношением звука обозначаемого буквой \"r\")\n\n2) Есть ли языки с переднеязычным дрожащим, в которых нет фонематического противопоставления одноударного и дрожащего, но в которых одноударная артикуляция дрожащего считается дефектом речи? Я слышал, что финны пипец как раскатисто \"r\" произносят во всех позициях",
				"added": 1482866359
			}
		]
	},
	"comment_vote": {}
}