{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> privacy\n> It was only ever fears of current society (flawed)\n\nI pretty much agree with this. Privacy is only required in flawed society. But then the question is whether ideal society is even possible. As far as my opinion goes, i think it is, but it is possible to arrive there for humanity. But many would disagree it is even at all possible.\n\nThen there's debate on whether we can improve current society by destructing privacy (i.e. \"open surveillance\"). Argument can be made for both views and if you're interested, i'll elaborate.\n\n> life is precious and something we should pursue and keep alive\n\nHow far would your definition of life extend? What to do in case of interest conflict?\n\n> My understanding of neuroscience, philosophy, metaphysics, quantum mechanics, economics, etc. are all spot on.\n\nIt is commonly argued that no one actually *understands* quantum mechanics and you're likely not even quantum physicist (correct me if i'm wrong).\n\n> What is the exact nature of qualia?\n\nI don't think it's possible to fully learn the system from inside. Since we perceive qualia with qualia (if i understand what you mean by it correctly), we can't get to its nature.\n\nI can criticize your reincarnation & time ideas later, if you're interested.\n\nFor now, i'll leave [this](https://www.youtube.com/watch?v=3C2tkQ3743E) here.",
			"post_id": 47,
			"date_added": 1516729331
		},
		{
			"comment_id": 2,
			"body": ">If everyone has perfect knowledge, that can do a lot of good in the world\n\nMaybe. But that's end point and there's no way to get there immediately. More realistic would be to start an open p2p surveillance system which anyone can join. In theory, if enough people join it, we'll have better surveillance than any agency. However i have my doubts about it being overally a good thing. If it doesn't work as catalyst toward better society, information from it can be abused by bad people.\n\n>I'm clearly referring to the collection of systems, laws, and 'stuff' that continually strives to reproduce, survive, increase it's longevity.\n\nWhat about religion, language, math or maybe even ascii?\n\nIf a single entity can be called alive, then clearly reproduction should not be necessary criteria if we want to keep general intuition about alive things (e.g. most ants are sterile). If you would prefer to apply term alive only for species, then hypothetical cyborg might cease to be alive (as soon as they are no longer human).\n\nSo, if you agree with that and want to keep intuition (so ants and cyborgs are considered alive), what about any dynamic equilibrium systems? Can they be thought as \"striving to survive\"?\n\n>Why does it appear that the past is changing. Is the past changing?\n\nNot sure how it is supposed to appear that the past is changing (in my worldview the past does not materially exist). But more importantly, the concept of any change assumes time already. So for the past to change, you'll first need it to exist in a somewhat material form and then you'll need a second time dimension, in which it could change.\n\nAnd then there's the question \"how would you even notice a modified past?\" \n\n>The many worlds interpretation is true\n\n>Maybe we're just sliding between multiple worldlines and my views are right after all. But if so, why is that happening?\n\nFirst of all, if you're deriving worldline concept from multi-world interpretation of quantum physics, you should realize that amount of those lines should increase almost infinitely at every moment (unless we imagine that the world's wave function has very few valid states for some odd reason, but then that situation isn't substantially better in explaining the world than single line universe with some form of wave funcs collapse: the \"low-count\" multiverse would still involve *some* collapse).\n\nThen the first question is: how it is determined that \"we\" go into one branch and not another? If we assume some kind of metaphysical agency (free will, basically) and attach it to all quantum \"decisions\" (which is a big stretch, but still), what about other worlds? Does stuff there gain some new free will or is only our world unique and all others are 'dead'?\n\nAnd finally, to the sliding concept. Frankly, it doesn't make much sense to me. Even if we accept world lines and uniqueness of our world and then imagine \"jumping\" to another line.. the most easy thing to imagine would be jumping of \"uniqueness\" label itself. But even that is only easy when you view it from the side. But when you try to actually imagine it, you'll have a sharp disconnected jump: a moment ago there was one world, a moment later it is completely another (unless you imagine a non-discrete worldlines, on which i'll elaborate below). Since it's a 'new' world with its own past, all the memories of its inhabitants would contain references to its past and the old world would thus have no traces. So in this scheme apparently there's no way to know what world was considered unique before the current moment.\n\nNow lets consider a bit more complex scenario (but still with discrete world lines), which is btw quite usual in sci-fi. For us to be able to say that the change *actually occurred*, we'll need some observer which would retain memory from the old world. So, part of the world remains as it were in the old world, but the rest is again completely new. This has numerous issues, but the most important is of course how the world resolves the conflicts. Even if there's a way to \"specify a mask\" (using computer graphics analogy), how can it be applied to a world where on quantum level many particles have not only flew away, but even morphed into other particles?\n\nHonestly, i find the latter concept of partial jumping between the lines completely broken. So now i'll explore the \"non-discrete timelines\" concept. Actually, i just arrived at it, so haven't been thinking as much about it, so it may end up being pretty useless, but anyway.\n\nThe basic concept is that our position on the world tree is not fully localized.. so metaphorically we exist on a very thin, but still non-atomic layer of time. If we draw the timeline tree, in this picture our position would be a bit fuzzy if we zoom enough. So in a way it ends up being no better than single world interpretation, since we still have to live with some level of quantum uncertainty (which is otherwise resolved by multi-world). But, on the other hand it allows true \"sliding\", not jumping between lines: if our position on tree is probabilistic, the probability cloud can be imagined to morph and go over to remote lines over the time.\n\nThough even then it must be noted that since there's *so much* of new world spawning every moment, it is still quite hard to imagine switching to any line that diverged more than a tiny fraction of a second ago.\n\nOn the positive side, this concept can make partial survival of an old world more plausible. Since we're saying our position in a world tree is fuzzy, the probabilistic cloud can be imagined to change differently for different particles/areas of the world, even to the point where some particles retain their old past.\n\nOf course, the practical possibility of such world drifting and mixing between noticeably diverged worlds is still another matter. And i haven't even touched the quantum-affected timespace distortions, which would make it even harder to imagine the whole process (though luckily quantum effects don't normally affect gravitation and thus continuum distortions in everyday life).\n\nAnd, of course, all these constructs imply materialism. If we get rid of it, many things become possible, but i don't see the point of so strictly sticking to science if materialism is not true.\n\nI should also note that since the multi-world interpretation is generally alien to me (i don't see how it explains anything; drifting between timelines is not something that i've heard to have any evidence or theoretical basis and if the timeline tree branches are fully isolated, those alternate worlds become too virtual to consider them real in usual sense of word), my analysis might miss some important direction of thought.\n\nHopefully it makes some sense. I'm afraid i might be writing too condensed, assuming too much common thinking and understanding. Anyway, gotta get some sleep now, will write on reincarnation thing later.\n",
			"post_id": 47,
			"date_added": 1516867294
		},
		{
			"comment_id": 3,
			"body": "> [kaffie](#comment_51_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): AFAIK, those wouldn't be considered life, as they don't 'act' and do things.\n\nI think most viruses can't be said to 'act' either.\n\n>we don't know the exact nature of life\n\nWell, it's up to us to give it a definition, though i realize it's still hard.\n\n>The past necessarily exists unless you reject materialism and/or modern physics.\n\nIt depends on how you define \"exist\". I haven't seen any scientific claims that \"past exists\", so i can't comment whether i would reject that notion or simply have different definition of existence (it's quite unlikely i would be convinced that science *can even claim* existence of past in the same meaning of the word that i use).\n\nExistence is a whole big topic, but when i said \"past does not materially exist\", it is mostly just another way of saying that we can't (even theoretically) interact with it. For me the most important notion of existence necessarily implies time and ability to influence (being observed counts, of course).\n\nIf we take \"existence\" in another sense of the word, i might agree that past exists under that definition.\n\n>By the past changing I mean that events in history have changed from what they used to be.\n\n>Because I see it with my eyes? I don't know the why/how. I'm very curious. It's just odd.\n\n>The problem with this, is that it'd argue that you can't observe the past changing. Major events have indeed changed. Things like the JFK assassination, or the moon landings. I've seen landmasses move as well (entire continents). These are not small by any stretch.\n\nHmm, how do you distinguish between \"past changes\" and \"our opinion about past changes\"? I've no idea what happened to those events in your world, but how can you be sure that both \"first past\" and \"second past\" were/are actually correct depiction of reality?\n\n>Honestly? Because it's my best explanation when assuming materialism. How the fuck else do you explain this stuff? It's horribly confusing.\n\nSince i ~~didn't experience~~ can't remember experiencing past changes which couldn't be explained by cognition failures, i don't have a theory that admits them and explains better than what you have. If i would, i would probably try to find an explanation that wouldn't involve timeline shifts and instead blame society and/or myself first.\n\n\nOn materialism vs idealism\n--------------------------\n\nMost of my worldview building \"career\" is critique of materialism in its variations ^_^ Well, at first i was trying to reconcile materialism (and determinism that at the time i considered to necessarily follow from materialism) with consciousness, free will and time perception. But even when i gave up materialism, i'm still mostly criticizing it since idealism (or potential neutral monoism, whatever that means; i rejected dualism long time ago) doesn't give much instruments to explore the world.\n\nAnother thing i used to explore is world simulation concept, though it has the same problem as idealism: it can explain (almost) anything, but it's non-falsifiable, so the only instrument in judging it is minimalism (Occam's razor).\n\nSo while rejecting materialism is quite simple and there's arguably enough evidence to do that, you end up in an unpredictable world, where science can show consistent results and yet be fundamentally wrong and so basing world view on it no longer seems as imperative.\n\nWell, maybe i'm just ignorant of good idealist concepts which would give proper instruments of exploring such world, but i kinda doubt they're possible. So in the end, i'm skeptical towards both materialism and idealism ;)\n\nFor a long time i've been starting my worldview thinking with \"i exist\" axiom, trying to derive the rest from it (which is why i can't agree that \"there's no present\"; i'm much likely to say that it's *the only thing that does exist* because it can be observed more directly than anything else), but at some point i started wondering what does that even mean and still haven't arrived at satisfactory answer. Paradoxical statements like \"we don't exist\" are interesting to ponder, but i don't see a point in building world view around them.\n",
			"post_id": 47,
			"date_added": 1516910700
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"47": 1,
		"51": 1
	}
}