{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1524873299_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
		"1525007774_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1525030360_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": 1,
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": 1,
		"1526239496_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": 1,
		"1526319410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1524935803_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": [
			{
				"comment_id": 1,
				"body": "I understand that problem you are thinking about.\n\nThe main issue with ZeroNet is its decentralized form. Popular content will be multiplied and not popular will get marginalized and possibly lost (this creates natural mechanism that prevents running out-of-space for new content). \nHowever, a project similar to ZeroNet (but now it seem that it is dead), FreeNet introduced option to enable your \"Freenode\" to act as a Seednode. It would download random* data from freened and store it to help new users connect and download freesites faster and preserve a bit better those less popular content.\n\n* If I recall correctly it would be random, but not sure. \n\nSimilar setting should be introduced to ZeroNet in my opinion. It would make it a bit centralized (however in personal hand, not corporate servers). I have over a dozen HDDs lying around useless. I could create some raid5 and run a seednode for zeronet but currently there is non such option.",
				"added": 1524937209
			},
			{
				"comment_id": 2,
				"body": "> [eibriel](#comment_39_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): ZeroNet is not decentralized, it is distributed. That means that every user should (ideally) share their computer power and bandwidth to maintain the network. Is the price to pay, but is optional. [...]\n\nIn its current form it is decentralized. Just type zeronet in google. First result, even its official zeronet site says:\n\nZeroNet: Decentralized websites using Bitcoin crypto and the (...)",
				"added": 1524940422
			}
		]
	},
	"comment_vote": {
		"1_13A49qGkX6Sp1tQM8nN86gEPGSM1V1MMZS": 1,
		"25_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": 1,
		"1_1BpWqMrcVcqAYpzkutTbh9QYSGv3SkaPCx": 1
	}
}