{
	"posts": [
		{
			"id": "08342cf4-4546-4e5b-bc39-32602cbf31d2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "299cc944-80fb-4342-82d7-1835600c61bd",
			"body": ">>95717c48-83b6-4e86-8f72-10b60cd35888\nPost quality even in this dire situation has increased if you take into the account 80% of replies on 8chan were literally \"shill\" \"faggot\" \"kike \"no you\". As for quantity it's a bit slower but I don't really give a fuck right now. All I see is potential, and it's growing fast.",
			"time": 1565291672999,
			"files": "[]"
		},
		{
			"id": "0bbba398-89e2-4502-b290-417a0cfaedaf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Yellow vests in france",
			"body": "Any frogfags around here in 08? Most threads on the yellow vests' activities got nuked, dismissed or memoryholed back in cripplechan. Meanwhile, over at cuckchan there were some threads about them and got shilled to death all claiming that \"yellow vests' are lefties\"/\"the movement is dead/got coopted/subverted\" \"they're in it for the gibs\". Silence in msm is appalling: there are no news to be found on international media, only a few frog media sites and all of them painting the YV as neonazis or violent rioters. What's the state of things right now in france? At least a few months ago, it looked like a genuine anti-ZOG movement. If there are any frogs around, please enlighten us on the current events. Also, wtf happened to /dempart/",
			"time": 1565339692400,
			"files": "[{\"name\":\"885b27f2411468e888935ca69b7356a153977af2c8c35885f8d8c9fb25f5b968.mp4\",\"thumb\":\"e33fa21adc73694b044e6c812ed736a60ef4bd92-thumb.jpg\",\"size\":16661818,\"type\":\"video/mp4\",\"original\":\"196c703cc6b607592d6c7f6f5d3f8464074311bc.mp4\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "242b6548-5902-41d7-8776-6ffe9a819834",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "aa8ff392-866d-4d81-b3eb-697f3e3ceabb",
			"body": "it's all bullshit. Back on 8ch, the feds already tracked our IPs and directly monitored the board, including moderation. So they already had \"our ips\" before, the only difference is anyone can see it now. Also, I've always been careful about opsec even during pre 2nd exodus days, so why the fuck would I not be even more careful now? I'm behind seven boxxies, tbh.\n",
			"time": 1565387058400,
			"files": "[]"
		},
		{
			"id": "e286b720-b53d-4850-b216-6bd85a9a5418",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7913a6b5-c6f3-45b4-b824-91eeca03107a",
			"body": ">>2c23b0c2-6513-4b01-8c5e-1f57c76af63d\nI downloaded it and it worked. Took ages to download but it did.",
			"time": 1565393297300,
			"files": "[]"
		},
		{
			"id": "67eea6ad-b800-4f32-a4b5-24c77a05f609",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>2576140b-f9a0-43f2-a672-7d2504c79bda\ncan confirm, I started using zeronet on another computer yesterday, I definitely could not see what I see on my main one. This definitely explains the lack of recent new posts.",
			"time": 1565425799000,
			"files": "[]"
		},
		{
			"id": "104236ba-776b-482e-91a5-31df1fcafab1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": ">>7f4e83bc-2bf0-4946-98ec-cc44e5328df9\ncame here to post this. Very little info on context. The kike was even on suicide watch. what the fuck",
			"time": 1565448462872,
			"files": "[]"
		},
		{
			"id": "21bb0eef-1491-4664-a8de-8397d6b1edd2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": ">>bceb6243-ebbd-44ad-b259-0140ebe10296\nindeed.\n\n>more damning documents released mere hours before\n>connections to (((important people))) are undeniable\n>theoretically on 24/ suicide watch\n>\"was found unresponsive\"\n\nif this doesn't shatter the eternal normie's delusions on the ruling class, nothing will. People on twatter starting to sound a bit like /pol/, same goes for msm's comment section. Major damage control too, saying things like \"russian bots are trying to incriminate the clintons\"\n\n",
			"time": 1565451353380,
			"files": "[{\"name\":\"EBnjRbXXsAEJAG5.jpg\",\"thumb\":\"4cca0798b43bf917fc51f78e22e59aae71817896-thumb.jpg\",\"size\":150306,\"type\":\"image/jpeg\",\"original\":\"df24b235447f34e6127d9e19368ab44732569bb8.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "4d1c84af-64ac-4268-ab7e-460a5df2e61f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6ba26aba-01e0-4749-8106-60df7f2e3b0b",
			"body": "",
			"time": 1565455728992,
			"files": "[{\"name\":\"nypepstinephotofake.jpg\",\"thumb\":\"5e1269bb2dfb6f26d4219c5d646f07f10466dda2-thumb.jpg\",\"size\":207340,\"type\":\"image/jpeg\",\"original\":\"5f4bacebb907e422cbe2c05f6683146b5f06619f.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]",
			"last_edited": 1565468818890
		},
		{
			"id": "95775f4e-c551-41d3-bac2-3add3e069f92",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3981ecf7-0d62-40f8-b315-61d20ff29f69",
			"body": ">>205ed252-bff4-4edf-a471-45e63d03cefe\n argentina is the last country on SA that has a middle-class. That middle class is \"mostly\" white, even if laden with goblinos here and there. That very same middle class has been fucked in the ass in the last 20 or more years, being eroded consistently. The (((usual suspects'))) plan is to exterminate said middle class and reduce argentina to yet another goblino shithole that's even easier to control. There's mainly three problems with argentina:\n\n>Enormous jewish influence. Argentina is the 6th country with the most jews on earth.\n>very brainwashed population that is often encouraged to vote against their own interests. The middle class tends to believe they belong to the elites since they're not racially niggers and happily vote for the most zionist governments. \n>after a few decades of puppet military dictatorships (thank the CIA), the very notion of nationalism is automatically associated with them, so there's no hope of a real nationalistic government.\n",
			"time": 1565689905349,
			"files": "[]"
		},
		{
			"id": "0a07b8ab-7567-4a13-89b0-418b950c6c75",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": ">>688dde47-fdf1-419e-9fa2-eec284d63d02\n>>d14f9e67-9f85-43b5-822f-c97b9b01fb7b\n\nEpstein may very well have had a kill insurance. Something that gave him enough leverage to bargain with. Him being alive is a real possibility.  Even if no one believes the media, they have pulled much heavier bullshit in the past (see 9/11, bin laden's \"\"\"death\"\"\"\") and nothing happened.\n\nOr he might be dead. In either case we won't be hearing from them anymore. The only good thing that came out of this is normies' faith in the system falling deeper down the hole.\n",
			"time": 1565690266154,
			"files": "[]"
		},
		{
			"id": "461852f7-6e95-45ba-9169-b051c13ecf37",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0bbba398-89e2-4502-b290-417a0cfaedaf",
			"body": ">>5804894f-33e6-4787-bfc7-647655881698\n>>a9e5aab2-390f-4c66-82c6-43556cdf113e\n>>e84a5f0d-2e68-431f-97ea-cdf3a45e3269\n>>56cd2a4d-cdbc-46e0-b473-0d2c522f2d06\n\nthanks, it's really difficult to find english-written-non-pozzed info on this subject. It might be mostly over now but I suppose it forced the ZOG to show its true colors to a huge number of normies. Hope people ram directly into macron's (or the currect zog puppet) office the next time something happens.\n\n",
			"time": 1565724773279,
			"files": "[]"
		},
		{
			"id": "55947e01-fc0f-40cd-aa00-609d64b39f06",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3981ecf7-0d62-40f8-b315-61d20ff29f69",
			"body": ">>0fe427b4-b32b-4d56-bd71-932de8e4df9d\nthat's not the way it works. even while collapsing, argentina is still the \"\"\"best\"\"\" place to be in SA. That's why even in these horrible conditions, argentina is flooded with people from venezuela, brazil, chile, peru, paraguay and ecuador. Argentineans have historically fled back to europe or the USA. With each crisis (on average, argentina collapses once every 15 years) you get a huge number of migrants looking for a better place to live in. This has happened for the last half of the 20th century and the first 20 years of the 21st. With each cycle, the quality of migrants decreases, leaving only the worse behind, which in turn makes each crisis worse, since the country goes through progressive mongrelization. You only have to look at pictures of argentina from the 70s and compare them to present day photos. The amount of white people has decreased dramatically, I dare to say it might be around 40% white at this point, while it was 90+% a few decades ago. ",
			"time": 1565803202140,
			"files": "[]"
		},
		{
			"id": "d0aad2f5-19d5-4e56-81c8-54fee8e288be",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b7269fe1-98e6-4c6d-a536-0b12a9bbca88",
			"body": "do you really have to ask?",
			"time": 1566120541555,
			"files": "[{\"name\":\"aee8168ec2c71a8cd20f49ca69038694324a8d51e868d053b9b7e79bca0cfa85.gif\",\"thumb\":\"0a30e0521e7336f347838e43229fd3697cb12849-thumb.gif\",\"size\":102630,\"type\":\"image/gif\",\"original\":\"7ef5b36d585cc8b26c72e57c592bf4fd84bb8546.gif\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "384a6bc9-60be-4b3d-835d-fcb4078458f4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b7269fe1-98e6-4c6d-a536-0b12a9bbca88",
			"body": ">>7c663fcf-8b7b-4b1e-ae89-fccbff6c407d\n>you guys\n\nget out.\n\n",
			"time": 1566122174190,
			"files": "[]"
		},
		{
			"id": "4b32269c-0d59-4c96-bcd4-8213f838f55e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b7269fe1-98e6-4c6d-a536-0b12a9bbca88",
			"body": ">>3b16919d-3465-4923-9361-26d174f8de17\nassuming you're not just spamming: Once you study history and the jews' history in particular, you will come to the unavoidable conclusion that they are inherently evil. Modern western people tend to think religion is simply some kind of superficial habit that groups of people follow by going to a church/temple once a week and, for most other things, we're all the same with pretty much similar beliefs/moral values. This can't be further from the truth. Western society has been brainwashed to believe this. In reality, all religions are strict political, moral and behaviour laws that shape societies and their followers. Judaism in particular is founded on the principle that fucking people over is absolutely OK as long as they're non-jews. \n\nAll throughout history, however, there have been an immense number of traitors and jew-enablers that made the current state of affairs possible, of course. The only power against jews, who hold an enormous economic power and are able to bribe leaders left and right, is high moral standards and love for ones' people. You can easily observe that these are the things that jews (media, intelligence agencies, corporations, politicians) try to undermine and destroy as much as possible. \n\nUnder the current situation, yes, other groups of people could theoretically take their place if they are removed. However, only the jews have this level of criminal cohesion. You will absolutely find psychopaths and perverts anywhere else, but they are definitely not as tribe-minded, they would probably collapse under their own weight.",
			"time": 1566129077914,
			"files": "[]"
		},
		{
			"id": "03efcecc-51ee-4c2c-af9d-94a2bdbf8534",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3981ecf7-0d62-40f8-b315-61d20ff29f69",
			"body": ">>f1946639-c026-4a2f-ac94-3c99c8792864\nit wouldn't be the first time, you know. \nJew fuckery in south america hits the currency without limits. There's no point hopping up the value since most foreign transactions are petrodollar-friendly. Historically, SA has had two choices: let currency value go to hell or adopt the US dollar as currency (like ecuador), thus renouncing to the last little bit of autonomy. \nEverytime the currency resets, things go back to normal for a while, only a bit lower than before. Repeat ad nauseam till the goyim is 100% enslaved.",
			"time": 1566292577900,
			"files": "[]"
		},
		{
			"id": "efeac1c2-009b-4ead-92d0-2f3545b24a67",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"body": ">>6c353f03-60ba-47a4-9cfe-b2eb2780f644\n>>6eaabcb7-7ea5-44dc-a1e2-0452ce76c541\ntbh honest, you can get muscle imbalances even doing classic lifts. I base my workouts around deadlifts, benchpress, ohp and squats, adding weighted pull ups, dips and a couple accesories here and there. After a couple of years lifting I noticed my right delts and lats were lagging behind my left ones (weird since I'm right handed). When you notice this kind of things, move to dumbbells and focus on perfect form for a while, leave the barbell alone for a while. Tbh, dumbbells are far superior to barbell in everyway, it forces you to have a better balanced muscle profile since it engages stabilizer muscle groups a lot more. However, they are a pain in the ass to put into position and is also very hard to gradually increase in weight in most commercial gyms.\n\n>>149c9054-eba0-4562-9ba5-a3e2417fdc7d\nthis pic is pretty much correct, however one should think about nutrition in the proper context. If you're not lifting/doing regular excercise, you definitely don't need much carbs. And when you do need them ,take them from decent sources. avoid pasta, rice, bread as much as possible. Legumes and potatoes are all you need as far as carbs go, are much more filling and have a better glycemic index.\n\nAlso, avoid alcohol as much as possible. While it has been engrained in western culture for centuries, it was definitely not abused as much as it is today. The modern electric jew suggests we should all be drinking daily to socialize, to relax, to forget our troubles, to celebrate, to go to sleep... I very much suspect this has not always been the case. Alcohol is very harmful to both mind and body, keep it to a couple of times a month.\n\nedit: reading 200 years together and the sumerian swindle completely changed my view on acohol. It has been used as a weapon against western civilization and is pushed 24/7 by the usual suspects.",
			"time": 1566558273496,
			"files": "[]",
			"last_edited": 1566558526696,
			"subject": null,
			"capcode": null
		},
		{
			"id": "45935a09-1adc-4093-8d5b-83371aac0f88",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6c2b5c63-8899-4733-9dfa-f399882dbae8",
			"body": ">>eb0af0d4-8614-415e-8677-546b35674663\n>>9f7dc90b-bbe3-4906-9dd8-4799a610bf36\n\nthe sumerian swindle is a great book if you can overlook said kooky beliefs, reading ancient history from that perspective is amazing. The second book (the monsters of babylon) is good too, but it delves way too much on the old testaments' analysis. Does anyone have the 3rd and last volume? I think it's called \"the bloodsuckers from juda\" or something, can't find it anywhere.\n\nAdding a couple of books:\n\nEvola's \"Ride the tiger\". A nice analysis on the concept of enduring a long period of decadence.\n\nThe turner diaries: needs no introduction\n\nconfessions of an economic hitman: An ex globohomo player for a major corporation with supposedly guilty conscience delivers a detailed description on how the CIA, mossad and the US deep state topple foreign governments. Doesn't name the jew, but he clearly avoids doing it on purpose. A great read anyway.\n\nLibido dominandi by M. Jones: a must read, all about how jews' have been using sex, pornography and vices to enslave people.",
			"time": 1566723921685,
			"files": "[{\"name\":\"The Turner Diaries - Andrew MacDonald.pdf\",\"size\":1410990,\"type\":\"application/pdf\",\"original\":\"a9c4166c7daec8f1fbb99ea21d6ee0a0344efd81.pdf\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"},{\"name\":\"Libido Dominandi_ Sexual Liberation & Poli - E. Michael Jones.epub\",\"size\":813553,\"type\":\"application/epub+zip\",\"original\":\"58c26c92cc1a4991e66bab93658ba057ce959509.epub\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "2196ea8c-9b89-47d9-82c7-81e718acb6c6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6c2b5c63-8899-4733-9dfa-f399882dbae8",
			"body": ">>45935a09-1adc-4093-8d5b-83371aac0f88\ncan't seem to upload .mobi files, re-uploading missing books after converting them to PDFs",
			"time": 1566725600571,
			"files": "[{\"name\":\"Ride the Tiger_ Survival Manual for the Ar - Julius Evola.pdf\",\"size\":1607060,\"type\":\"application/pdf\",\"original\":\"f519f401ea89a6586918e4417df3c3f972a6f4e8.pdf\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"},{\"name\":\"Confessions of an Economic Hitman - John Perkins.pdf\",\"size\":1733544,\"type\":\"application/pdf\",\"original\":\"7e96731496605ae6e2accfe26fce4db398198463.pdf\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "c54b08e9-f9f8-4de1-9136-305c870e0919",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "843af125-8c1f-4517-8384-e6d14c97942f",
			"body": ">>71bda32d-51d0-427e-80f0-e315381ffa4e\nthat's great tip anon, haven't seen it on the web before, thx.",
			"time": 1566730098890,
			"files": "[]"
		},
		{
			"id": "6b20e6f5-958c-4f62-98d6-339185107526",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>d05790bd-2d6c-4c92-a5ca-c29b0d56eae4\nthere's neinchan and endchan, when they're up. However, they pose the same problems as any clearnet website: Lack of anonimity and easy to topple with DOSSes, a couple of falseflag or blatant shilling. As the other anon said, 8chan's quality dropped 100% around 2015-2016 and never went back up. 08 shows a lot of promise, we just more users. I definitely like the idea even if it's CPU heavy.",
			"time": 1566734855868,
			"files": "[]"
		},
		{
			"id": "d9afffc2-b568-4ef7-a55c-faf9d7bf80c1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9323ebee-fe89-4b37-a5d1-0bb93db27b98",
			"body": ">>ffe22c5a-7233-419a-b5cc-61428a71a511\nI think you misspelled \"jews\", anon. Anyway: \n\n>Discord shares many of the same features that attracted users to 8chan, including anonymity \n\nNo it doesn't. You need a fucking account for discord. Also, 8ch was not anonymous by default, you still had to mind opsec from your side.\n\n>and the ability to tuck toxic conversations into private channels. \n\nNow this is retarded. Who gives a fuck about having (((toxic))) conversations privately? The idea is to push truth on normiesphere, not to keep it contained.  The private part might be interesting when discussing current and past events, but still...\n\n>Why are these people on fucking discord but not here?\n\nThey're very well aware of this site, but it still doesn't pose a threat to them. It's hard to reach... wait, let me rephrase, you have to work a bit to get here so it's not as inviting, that's why we haven't had a flood of refugees other than right after 8chan's shoah. When the numbers do go up (I think we may need to shill zero a bit on the other bunkers if we want that to happen, even intelligent users won't find it if it's not talked about) shills will most certainly be here, but I believe they could be managed easier than back at infinity.",
			"time": 1567157983895,
			"files": "[]"
		},
		{
			"id": "cd4e952a-e9ff-4962-9809-4f6691de5177",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": "Just wanted to add that it's important for these thing to come out and have people pointing them out. Anons crying out \"glownigger\" is completely understandable, though: I had the same knee-jerk reaction because of how the OP was presented. However it's important to keep in mind that back on 8chan or any clearnet site IPs were 100% compromised and accessible for real glowniggers probably since day 1 or at least since watkins took over infinity. As flawed as it might be (albeit probably fixable and workaroundable if enough autism is applied) zeronet is a vast improvement. Glows would have to take down large sections of the interweb to make this site unreachable, that alone makes it so much better.",
			"time": 1567330298604,
			"files": "[{\"name\":\"1566809263994.jpg\",\"thumb\":\"e9ec5e1a43dbcfb08ba69421d15e3a9e2d433919-thumb.jpg\",\"size\":108835,\"type\":\"image/jpeg\",\"original\":\"e9ec5e1a43dbcfb08ba69421d15e3a9e2d433919.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\",\"spoiler\":true}]"
		},
		{
			"id": "8757e436-8b28-4781-870d-d388208ac63e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "516c8312-9c2d-4f0f-9755-7b62503dd0a1",
			"body": ">>f046f5cb-2acf-4448-9682-5bb140a6d9ad\n>>0c3ec91e-3fc1-4c15-8ee3-6ec8c71d7967\nIndeed. We have to shill this on 8chan when it's back up.\n\n>>36f37f16-bf22-4d8a-9c2c-e4262ab979f7\n>As long as you don't invite the glowniggers and soccer mom Q-larpers.\n\nIt's inevitable, but they're much more easily managed here than on the clearnet.",
			"time": 1567757370309,
			"files": "[]"
		},
		{
			"id": "92c10dff-a90a-4022-96f7-f2922480f7b4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>a566a0e7-2761-41e5-966e-3d40ae56d581\n>>fe7d8bc4-e316-47c3-ac98-ceca9d4a744a\n>>73ff3073-efd2-4b4a-91b3-bef09e8df202\n\nOne has to admit this site has not enough traffic to be passable. I like zeronet a million times better than clearnet, but it gets old really fast when nothing gets posted, not even when there are happenings a happening. I will definitely stay here, but I sure as hell I'm going to shill the fuck out of 08 in the new infinity. This place with decent traffic would be perfect.",
			"time": 1570381580803,
			"files": "[]"
		},
		{
			"id": "753afaa1-fa98-496b-8854-b13b4bdb91af",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5dfa8ea9-aead-4412-8f9e-77120e1d216d",
			"body": ">>6e988aed-4d56-4b9d-a87e-0a846b33deeb\nspot on. You're absolutely right.\nThey have pulled this kind of thing in the past already, there are centuries old letters, exchanged between world leaders at the time on how limiting the access to meat and yerba matè (popular herb infusion native to SA with high caffeine content) for the workforce was of utmost importance to keep it pacified and not capable of rebelling. This was used against peruvian miners and other menial workers. There is no reason to believe they see us in a different light, even today.",
			"time": 1570382673853,
			"files": "[]"
		},
		{
			"id": "82653a52-b48b-43fd-b10a-5451340661e4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>3a827fdf-a50c-4c10-acad-087723c96ba1\nand I'm looking forward to seeing how they're going to try to ban lead pipes and sugar.\n\n>implying\n\nhow naive can you be? It's not about guns, obviously not in yurop. It's about internet control. I haven't looked into it in detail, since it's really all so tiresome, but this has false flag written all over. The manifesto is clearly intentionally dumb and his profile hits all the points that conveniently fit the narrative\n\n>as if on request, he named the jew albeit in a very dumb way on his manifesto. It's almost as glowniggers were reading 8ch after tarrant's false flag.\n>still doing low-profile highly detectable targets\n>easily connected to imageboards\n>low kill count\n>gives them exactly what they need to push for further internet thought control\n\nI'm sorry but unless I see someone going after goldman sachs' employees I'm calling false flag. The homemade weapons are a joke and simply send the message \"you can't be safe from le ebul neonatzee goy!\"\n\n>>a1675752-1e82-4b9e-ac30-42b4ccc906bb\n>>7d14a076-275a-4c71-aae4-1dfc086faf1d\n\nretards or shills. I'm surprised either way.\n\n>>90cbdd26-57a8-44e4-be30-8ca67b533116\nIt's a psyop because it's SO OBVIOUS it hurts. Fucking think for yourself, you said it yourself. If this fucker had all the mental resources to build those weapons and was decided to throw his life away, he would have definitely gone for a high level target, not this shit that gives them further arguments for internet control.",
			"time": 1570699037188,
			"files": "[]"
		},
		{
			"id": "1a1c5abe-3f5a-4962-8ed7-bd552c834ba8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>c5327f37-9e1a-40dd-bf98-5cba09ef9d50\n>They have the Internet tightly under control already\n\nit can get a LOT worse and make it legal to persecute you on literal posts with ease. It's already going on in many countries. 4chan for example is 100% glownigger controlled, yet it can get even worse by adding wordfilters and literally gagging any bad goy comments. You can be required to present a biometric ID each time you connect to the internet \"For your protection\". Tor can be banned. Internet Service providers can be legally bound to tighten their controls. Background checks can be enabled if you're allowed access to the internet (they already do this shit on communist hellholes) and thus help them filter through mountains of bullshit data with ease. The internet is pretty controlled right now, but it can get a lot worse. Just think about how it was 20 years ago and how it is now. If you don't see a change for the worse (not speed-wise of course) then you're blind. They just need better excuses, and this kind of events are giving it to them. \n\n>If you were going to shoot jews, wouldn't you post it on your imageboard of choice?\n\nNo. That would be retarded. Such an event would be picked up by the msm and frown over for ages since it's messing with the chosenites. Why the fuck would anyone need an imageboard to amplify that? The second it gets picked up by the media, it will be all over the chans and everywhere else automatically.\n\n>I'm sure that has nothing to do with the fact that he was using home made slamfire shotguns, open bolt submachineguns running on homemade blackpowder ammo and blackpowder pipe bombs.\n\nso you're saying there is a bigger probability to this guy being a suspiciously resourceful retard than this being an obvious false flag to further promote their narrative. I'm sorry, I do not find that very believable.",
			"time": 1570704872200,
			"files": "[]"
		},
		{
			"id": "caaafe61-571f-40a5-8631-96ee72b318d7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "68b4b175-076c-4458-8107-e06d88b82c5c",
			"body": ">>68b4b175-076c-4458-8107-e06d88b82c5c\nthis sounds pretty bad. All of trump administration has done before is saber rattling and a bombing here and there that did not escalate further. This one seems different, it really could go south pretty quickly. Why now, tho?",
			"time": 1578034538978,
			"files": "[]"
		},
		{
			"id": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "the coronavirus hoax",
			"body": "Reposting from /pnd/. The post got drowned in bullshit and shilling, I believe, even if this site is mostly dead, It's worth to have it posted here too, here goes:\n\nHere are a couple of facts:\n\n-josh hopkins university, along with the IMF and bill&melinda gates foundation held a staged event called “event 201” http://www.centerforhealthsecurity.org/event201/ that described how this would pan out months before the first cases of the virus were reported. \n\n-There are many people at the WHO that are on bil gates’ payroll. Bill gates is heavily involved in vaccine production and investigation. Bill gates has stepped down from microsoft yesterday, saying he would be primarily involved in “philantropy”. Just like our guy soros.\n\n-we definitely do not know what went down in china exactly. There is a strong iron curtain of information between the western world and china, and it works both way. What we have seen is lots of disinformation passed out as truth and a lot of vids with no context that could perfectly be fake going around on social media, whatsapp, etc. about chinese being cremated in masses (oy vey!) or dropping down dead out of the blue. There’s the bioweapon narrative too, that’s so much in the open that it looks like it was left out there on purpose so suspicios people would pick that up and think that’s what they’re covering up, not the other shit that I will point out now.\n\n-China is now being praised by the western MSM about how it handled the situation, suggesting that such draconian measures should be implemented in the west if the virus is to be contained.\n\n-The markets have had the sharpest and fastest drop in history during the last few weeks. If there is something to cover up with such a tremendous psyop, this is it. the repo crisis and liquidity injection, leading to an incredible amount of inflation and increasing national debt (in europe too) was not only approved but begged for by politicians like trump. This money printing will come out of your pocket, your children’s pocket and their children’s pocket. All of this to keep the markets from crashing, which failed miserably as it did last week. \n\n-We are (were?) sitting on the biggest debt bubble in history. The 2008 crisis was never corrected, we only printed our way out of it into the future. Banks were bailed out just like they’re being bailed out right now, along with many companies that are (((too big to fail))). Of course, this will come out of your pocket, your children’s pocket, etc.\n\n-at the present time, both the fed in america and the ECB in europe have actively started buying assets, both private and public. What does this mean? This mean they’re aritifically propping up the stock market while buying a huge chunk of the private sector at discounted prices. Who’s paying for that? You are. Through inflation, you’ll pay for the banks to buy up shares of private companies.\n\n-Back in the 2008 crisis, there was another “killer virus” in the brewing: H1N1. They somehow fucked up the timing and it came out a bit later, during 2009, so the cover up of the whole lehman brothers and subprime scandals was not very succesful. They had to really time it perfectly now, and they did.\n\n-Just like any other false flag, there is no counter-narrative on the media. “the markets are crashing DUE to the coronavirus”, “this is because of the coronavirus”, “due to coronavirus…” There is absolutely NO DOUBT about this in the media. However, ALL stocks in the market were affected in a way that is completely irrational if not for a bubble bursting situation. A controlled demolition if you like.\n\n-The state of shock the measures that are being taken in europe have caused are priming people to accept ANY measures as “for our own good” and most people are willing to accept them, such is the leve of brainwashing that they have achieved. Spain declared the “state of emergency” yesterday which essentially allows the government to override any civil rights you have, including private property. This is literally communism being activated with the total compliance of the population. I believe this is, first and foremost, a huge social experiment on a global scale. “let’s see how the cattle reacts to this”. There is no going backwards after this, they will get bolder each time they try something. \n\n-At the time of this writing, Trump has signed the “Defense production act” which literally gives the state the power to use or confiscate private assets and put them to use in any way they want. This also extends to your personal sphere. They can use your business, your house and even your work itself to whatever ends they deem necessary and it will be perfectly legal to do so. \n\n-The economic crater that will comeout of this global standstill in production will be enormous. This is what some people take as proof about the virus seriousness. “why would they lose such an enormous amount of money if the virus wasn’t as deadly as the plague?”. (cont)",
			"time": 1584701797745,
			"files": "[{\"name\":\"3456356345.png\",\"thumb\":\"172fee136f7a5f7450fd110ae183f82ea57d0d8e-thumb.png\",\"size\":74106,\"type\":\"image/png\",\"original\":\"172fee136f7a5f7450fd110ae183f82ea57d0d8e.png\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "22f2ff6a-e0d5-41c9-9bea-a8b9fe570613",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": "-The economic crater that will comeout of this global standstill in production will be enormous. This is what some people take as proof about the virus seriousness. “why would they lose such an enormous amount of money if the virus wasn’t as deadly as the plague?”. Well, they won’t lose shit. This is an investment. If this is what it takes to shift the current paradigm to a complete zionist takeover of the last civil rights we have, they will go with it.\n\n Also, all losses to private sectors will be socialized just like they’re doing right now (bailing airlines for example) and you will pay for it. They won’t lose money over this.\n\nI firmly believe the gravity of the virus situation is completely staged. This is a new 9/11 without one shot being fired, just pure psychological warfare. Just like back then, laws are being approved right now that will erase our last liberties. Now the us government (or any ZOG) can (and will) lock you down “for your own good” and it’s completely legal to do so. There’s another thing, too. When markets collapse so suddenly, there is a crisis of liquidity and bank runs are at a high chance of happening. Everyone will be moving to cash. Banks can not provide this liquidity in cash because it’s simply not there. What better way to enforce a credit freeze with the virus as an excuse? The IMF has already isssued (((loans))) “due to the coronavirus” to make you buy even more debt, that you will have to pay out of your pocket to bail out banks and other institutions. (cont)",
			"time": 1584701932745,
			"files": "[]"
		},
		{
			"id": "ea6d04cf-895d-4a47-aff6-0d04e25acbfb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": ">>22f2ff6a-e0d5-41c9-9bea-a8b9fe570613\nI foresee two different scenarios on how this will play out\n\n1) This is it, the shift from (((democracy))) to full on communism under a clever disguise of “public health crisis”.\n\n2) It’s another 2008 and they will kick the can down the road AGAIN at the expense of YOU. Purchasing power will be smashed to bits, jobs will be lost and inflation will skyrocket. This is one of the biggest wealth transfers in history, from the middle class to the usual suspects. This is yet another huge blow to the very existance of a middle class, but this time they will blame it ALL on the virus, not the biggest scam in the history of the world, namely fiat currency and its creation by the central banks.\n\nI sadly wish it’s 2), it should give us a chance to recover and regroup. Sadly, I’m not seeing a reaction on this. People is too scared of “the virus”, so the chance of this happening again is very high. There are some people that are actually happy that they can stay at home and not go to work, oblivious to what’s going behind this enormous wall of lies.\n\nLast but not least: there is a huge amount of power shifting going on. Oil prices dropping dramatically (30%) last week is an enormous blow to the petrodollar. It has recovered a bit, but this is alarming nonetheless. Governments (mainly china and russia) are definitely moving away from the dollar as the de-facto exchange currency for international transactions. We know what happens when people try to shy away from the petrodollar (hi geddafi!). (cont)",
			"time": 1584701971345,
			"files": "[]"
		},
		{
			"id": "eee2d8d8-6b45-4007-a0f7-6214c5428c15",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": ">>ea6d04cf-895d-4a47-aff6-0d04e25acbfb\nSadly, we have very little space to discuss this freely. /pnd/, the current 8chan's heir is shilled to death, but it's still somewhat anonymous. you have to plow through endless bullshit to get something worthwhile.  However, I have found that interacting irl with people and calling this hoax out to be much more effective than say, calling out the holohoax. Spreading info as far and wide as possible is no longer an option, go on and do it.",
			"time": 1584702163345,
			"files": "[]"
		},
		{
			"id": "25d6d31a-eeb3-4636-a27b-bfaa1c85c353",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": ">>6f5bd408-15bd-4669-b30d-6ee0f19b1470\n>In your opinion, are \"they\" good enough to pull this off?\n\nyes. or powerful enough, at least. They don't even have to have complete surveillance on people, common people are currently ratting out whomever breaks the \"self isolation\". Brainwashing is very much complete.\n\n>But governments never give back the liberties they take willingly.\n\nthey never do. The Us still has emergency acts since 9/11. France is in a \"state of emergency\" since charlie hebdo. Or even before if I'm not mistaken.\n\n>>162c200c-d08f-4135-8756-aa9c75606ac8\nthat link is 404 now. what was in it?",
			"time": 1584745398824,
			"files": "[{\"name\":\"1577745369945.jpg\",\"thumb\":\"c71670a3088607a58adb2c1e849a26b699c5508a-thumb.jpg\",\"size\":62484,\"type\":\"image/jpeg\",\"original\":\"c71670a3088607a58adb2c1e849a26b699c5508a.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "3ad39a09-9d5b-4d77-9875-9758aff472e6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": ">>f7034490-e3da-416e-b7d4-8523df89d823\nThe've been doing this since time immemorial. I Believe it's a way of how jews in the know communicate with each other using the press with no need of direct communication. I believe the message is \"this is our work, be aware\". Yes, the number thing is way too odd and always all over the msm. \n\n>>c0bfd371-7f56-4a0d-b08e-22298d36eafb\nYes, I'm aware. The internet is very very far from what it was just 10 years ago. Why isn't the current state of the internet frightening people? Anon remember many people started having full access to the internet with the introduction of the first smartphones, and google, facebook and such portals were very solidly grounded. A lot of normalfags believe the internet to be facebook, instagram, whatsapp and google. Or any other portal that you have to be logged in (to google or facebook) to use. So, a page going down or even taken down is of no concern to them. even imageboard users were too lazy to start using zeronet and prefer to stay in centralized bullshit sites like 8kun or 4chan.",
			"time": 1585221240679,
			"files": "[{\"name\":\"39e9ae42e3035b5f4682232a316e45e30daae56c77e15b51b8e31588f9b70cf0 (1).jpg\",\"thumb\":\"5bf15c29aa3e180d63a81de655978cf2d405b9ea-thumb.jpg\",\"size\":646148,\"type\":\"image/jpeg\",\"original\":\"5bf15c29aa3e180d63a81de655978cf2d405b9ea.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "a0edd97b-67d2-42ca-88fe-8a50c276bdca",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": "Also, it's amazing how zeronet has picked up traffic since the start of coronachan bullshit. And 99% is shitposting or shills with 0 arguments.",
			"time": 1585221395679,
			"files": "[]"
		},
		{
			"id": "ca514c76-689b-4413-a2b7-ca4c785f990a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e0618b4-1ad3-415f-a00a-dc45ff412983",
			"body": ">>b281534e-6ff5-424b-a1c5-88b60f6b0026\n>Don't know what Jews you refer to....The ones I know are plenty weak and ineffectual. Hardly a master race. Inbred too - worse than cousin fuckers.\n\nzionism is not composed 100% of jews. However, most zionists are jews. If you don't see a powerful movement, then you don't see the surnames and origins of the people in the true positions of power like banks, media, governments (not the head puppets), social media corps, google, etc.\n\n>Why do Chinamen get a free pass for this plague in favor of kicking Jews?\n\nwhat? I don't get what you were trying to say.\n\n>Now if you (or your minions) wish to put forth a coherent argument/plan for the complete destruction of foreign influence and national traitors within the United States - many would be all ears. I'm thinking Brits, Chinese, and Israelis. But there likely are others. Every country needs a cleaning once in awhile.\n\nI don't think I follow. The problem is definitely from within and supranational. The very concept of \"X country interferring with Y country\" at this stage of world events is irrelevant. Nations as sovereign entities are long gone, they're all vassal states of central banking. There may be factions that find themselves in opposition, but it definitely is not as simple as \"it's the brits\" or \"it's the chinese\".\nAt most, I might be seen some kind of shapeshifting of the worlds' power from 100% globohomo to huge feud-like areas. As a matter of fact I find myself thinking if this huge power shifting hasn´t been caused by china having a huge increase in internal consumers and having the possibility to tell the US to fuck off, no longer being only the factory of the world. That's what probably kicked off the (((trade war))) that escalated to what we're seeing today. \n\n>>6e5fea91-bdf6-4c21-93c1-584d341baa55\n>There is no way kikes will want anything supplanting the holohoax.\n\nthere's more than one holohoax anon. That's a fundational myth of post-WWII era, but there are many more. The french revolution being praised as something that was essentially good and not just a powergrabbing move from jews into the monarchies. 9/11 is another one. Coronachan will probably be the next one. You can already see glimpses of it in the msm, attacking \"coronavirus deniers\".",
			"time": 1585297667729,
			"files": "[{\"name\":\"1573084278124.png\",\"thumb\":\"34544baf18ace9d511aa49ba21baef7b2b1be27b-thumb.png\",\"size\":744155,\"type\":\"image/png\",\"original\":\"34544baf18ace9d511aa49ba21baef7b2b1be27b.png\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		},
		{
			"id": "63c2119d-8a1f-4c6c-9300-c87ebcf55265",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "298e2c12-5a21-4c67-8959-6e0f9fd72253",
			"body": ">>298e2c12-5a21-4c67-8959-6e0f9fd72253\nI've read it, it's good. It's also great to be able to read about subjective people's experiences. We are flooded constantly through the msm with bullshit reports to the point that I find any other source much more believable. I don't believe for a second the reality the msm portrayed of the china lockdown. I can only speak about what I see and from where I am and that's what I can attest to. It'd be nice to hear from different places' experiences, without turning it into a datamining honeypot of course. only giving out vague locations. I'll type mine up if I can later today.",
			"time": 1585913086458,
			"files": "[]"
		},
		{
			"id": "a961c3d4-5c45-4b64-a8a3-3f81fb7643c7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"body": "Something decently huge has happened a couple of days ago in Italy.\nSara Cunial, an ex MP from the M5 (movimento 5 stelle, a party that started out being somehow anti-system but ended up being coopted by the eternal jewish left). Considering what happened, it might be only natural to think she left because she felt they weren't being authentic enough.\n\nShe went on a 7 minute speech denouncing all the things that are absolutely wrong with the measures taken during the coronahoax and how damaging they were, bringing bill gates into the table, mentioning his ties with the WHO, his long career of killing people with vaccines, how he intends to use ID2020, the whole bilderberg club and more. Also taking a big shit on actual Italian politics (corrupt to the bone), the MSM and more.\n\nThe (((msm))) picked out phrases out of context and tried to discredit her. But the video went viral. I thought it might be deleted, but here's the fun part: since this was part of a parliament session, youtube can't delete it without being too obvious, so it's still up.\n\nHere's a version with english subs:\n\nhttps://www.youtube.com/watch?v=mkDYtAYMRhw\n\noriginal version for what it's worth\n\nhttps://www.youtube.com/watch?v=NL9FrYTM-qg\n\nThe positive comments this is getting are pretty unbelievable and pastaniggers are mentioning \"revolution\" over and over. Thought you might give it a watch.",
			"time": 1589739587475,
			"files": "[{\"name\":\"1586677823079.jpg\",\"thumb\":\"c04d70be3f581bb6f8ed2f01e347cd91c217850a-thumb.jpg\",\"size\":247405,\"type\":\"image/jpeg\",\"original\":\"c04d70be3f581bb6f8ed2f01e347cd91c217850a.jpg\",\"directory\":\"1HbxqnZvaFKQQ4JAH6qGz1CbL2JAiwRrVb\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}