{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1,
			"title": "Trump Lied at CPAC",
			"body": "Trump said companies like Intel were making business investments in the United States because of his election. The company planned their new investments before the election. (Feb. 24, 2017)\n\n***\n\nTrump said that Obamacare covers “very few people.” Nearly 20 million people have gotten health insurance under the law. (Feb. 24, 2017)\n\n***\n\nhttp://www.huffingtonpost.com/entry/donald-trump-administration-lies-100_us_58ac7a0fe4b02a1e7dac3ca6",
			"added": 1488306861
		},
		{
			"topic_id": 2,
			"title": "Trump lied about Electoral College votes",
			"body": "Trump said his 306 Electoral College votes was the biggest electoral votes victory since Ronald Reagan. He actually received 304 electoral votes. Moreover, Obama got 332 votes in 2012. (Feb. 16, 2017)\nhttp://www.huffingtonpost.com/entry/donald-trump-administration-lies-100_us_58ac7a0fe4b02a1e7dac3ca6",
			"added": 1488307370
		},
		{
			"topic_id": 3,
			"title": "Trump Lied about Sweden",
			"body": "Trump falsely suggested at a Florida rally that Sweden had suffered a terror attack the night before his speech. It had not, and Trump was likely referring to a Fox News segment on crime in Sweden. (Feb. 18, 2017)\nhttp://www.huffingtonpost.com/entry/donald-trump-administration-lies-100_us_58ac7a0fe4b02a1e7dac3ca6",
			"added": 1488307436
		},
		{
			"topic_id": 4,
			"title": "House Republicans Are Helping Donald Trump Keep His Tax Returns Secret",
			"body": "House Republicans shot down an effort to finally make President Donald Trump’s tax returns public. Rep. Bill Pascrell (D-N.J.) on Monday proposed a resolution to invoke an obscure law allowing the Internal Revenue Service to turn over the president’s tax returns to the House Ways and Means Committee for review. But the House voted 229-185, almost exclusively on party lines, to reject the effort.\nhttp://www.huffingtonpost.com/entry/trump-tax-returns-release_us_58b54393e4b0a8a9b785cf56",
			"added": 1488307851
		},
		{
			"topic_id": 5,
			"title": "Trump signs executive order to roll back clean water rule",
			"body": "President Donald Trump just signed an executive order to roll back President Barack Obama’s clean water rule. That environmental regulation was issued in 2015 to give the federal government authority to limit pollution in major bodies of water, rivers, streams, and wetlands.\nhttp://www.theverge.com/2017/2/28/14766462/trump-executive-order-clean-water-rule-epa-environment",
			"added": 1488322295
		},
		{
			"topic_id": 6,
			"title": "Donald Trump postpones state visit to Britain in attempt to avoid controversy after protests and MPs’ objections",
			"body": "DONALD Trump’s state visit to Britain has been delayed until October in a bid to avoid protests and MPs’ snubs. The US President told Theresa May of his fears over the trip originally plotted for June during a phone call two weeks ago.\nhttps://www.thesun.co.uk/news/2979030/donald-trump-postpones-state-visit-to-britain-in-attempt-to-avoid-controversy-after-protests-and-mps-objections/",
			"added": 1488322354
		},
		{
			"topic_id": 7,
			"title": "FBI once planned to pay former British spy who authored controversial Trump dossier",
			"body": "The former British spy who authored a controversial dossier on behalf of Donald Trump’s political opponents alleging ties between Trump and Russia reached an agreement with the FBI a few weeks before the election for the bureau to pay him to continue his work, according to several people familiar with the arrangement.\n\nThe agreement to compensate former MI6 agent Christopher Steele came as U.S. intelligence agencies reached a consensus that the Russians had interfered in the presidential election by orchestrating hacks of Democratic Party email accounts.\n\nWhile Trump has derided the dossier as “fake news” compiled by his political opponents, the FBI’s arrangement with Steele shows that bureau investigators considered him credible and found his line of inquiry to be worthy of pursuit.\nhttps://www.washingtonpost.com/politics/fbi-once-planned-to-pay-former-british-spy-who-authored-controversial-trump-dossier/2017/02/28/896ab470-facc-11e6-9845-576c69081518_story.html",
			"added": 1488322416
		},
		{
			"topic_id": 8,
			"title": "Democrats Are Close To A Huge Win As The GOP Plan To Repeal Obamacare Is Collapsing",
			"body": "With Republican opposition from the conservative wing of the party growing to the leadership’s plan for Obamacare repeal, united Congressional Democrats are getting closer to a huge win if they can save the health care law.\n\nThe 32 member House Freedom Caucus is opposed to the repeal and replace bill because it contains a tax increase and refundable tax credits to purchase health insurance. They are also opposed to the idea of millionaires being eligible for the tax credits. The leader of the 172 member Republican Study Committee, Rep. Mark Walker, also came out in opposition to the legislation.\n\nThe Republican opposition in the House would be enough to kill the bill, but there is also a conservative rebellion in the Senate as Republican Senators Rand Paul (KY), Mike Lee (UT), and Ted Cruz (TX) all oppose the legislation.\n\nhttp://www.politicususa.com/2017/02/28/democrats-close-huge-win-gop-plan-repeal-obamacare-collapsing.html",
			"added": 1488322489
		},
		{
			"topic_id": 9,
			"title": "Donald Trump’s assertion about terrorism had a major falsehood",
			"body": "President Donald Trump’s address to a joint session of Congress was filled with exaggerations and falsehoods, one of which warrants particular attention — namely, his claims about foreign terrorists.\n\n“According to data provided by the Department of Justice, the vast majority of individuals convicted for terrorism-related offenses since 9/11 came here from outside of our country,” Trump claimed.\n\nIn fact, most of America’s recent terrorist attacks were committed by either native-born American citizens or immigrants who had received American citizenship.\n\nhttps://www.salon.com/2017/03/01/donald-trumps-assertion-about-terrorism-had-a-major-falsehood/",
			"added": 1488389690
		},
		{
			"topic_id": 10,
			"title": "Donald Trump, pseudo-president: Media embraces his latest “pivot” like the proverbial drunks under a streetlight",
			"body": "Only because the bar has been set so low for Trump's presidency did that litany of lies qualify as \"presidential\".\nhttps://www.salon.com/2017/03/01/donald-trump-pseudo-president-media-embraces-his-latest-pivot-like-the-proverbial-drunks-under-a-streetlight/",
			"added": 1488391743
		},
		{
			"topic_id": 11,
			"title": "US immigration officials force Nigerian software engineer to complete written test to prove his computer knowledge",
			"body": "It looked to him like someone with no technical background Googled something like: 'Questions to ask a software engineer'.\nUS immigration officials forced a Nigerian software engineer to complete a written test on binary search trees to prove his computer knowledge.\nhttp://www.independent.co.uk/news/world/americas/us-immigration-nigerian-software-engineer-celestine-omin-written-test-new-york-s-jfk-airport-a7606306.html",
			"added": 1488391780
		},
		{
			"topic_id": 12,
			"title": "Stephen Colbert annotated Trump’s speech — and destroyed Kellyanne Conway in the process",
			"body": "After President Trump's first big speech to Congress, Stephen Colbert hosted a live broadcast of “The Late Show” — annotating the address and taking digs at the administration.\nColbert aired a clip showing Trump being announced Tuesday night as “the president of the United States!”\n“Any chance there’s a mistake and ‘Moonlight’ is the president?” Colbert quipped, crossing his fingers.\nHe also took a jab at Trump counselor Kellyanne Conway, who was back in the news earlier in the day over a photo showing her kneeling on an Oval Office couch. Although Conway has been a favorite mark among late-night comics, Colbert did not reference any specific incident. But he showed a clip from Trump's address in which the president said he had placed a hiring freeze on “nonmilitary and nonessential federal workers.”\n“Nonessential federal workers,” Colbert repeated. “So Kellyanne Conway is out? … You will be missed.”\nhttps://www.washingtonpost.com/news/the-fix/wp/2017/03/01/stephen-colbert-annotated-trumps-speech-taking-him-apart-point-by-point/",
			"added": 1488391831
		},
		{
			"topic_id": 13,
			"title": "Obama’s press secretary on Trump: “we tried a different strategy. We tried to tell the truth.”",
			"body": "Josh Earnest, who fielded questions about Obama's birthplace for years, isn’t surprised by the administration’s “fake news” accusations.\nhttp://www.vox.com/policy-and-politics/2017/3/1/14776910/obama-press-secretary-colbert-trump-spicer-fake-news",
			"added": 1488391914
		},
		{
			"topic_id": 14,
			"title": "Donald Trump's Inaugural Pastor Creates 'Safe Haven' for Immigrants",
			"body": "The Sacramento church of an evangelical pastor who led a prayer at Donald Trump’s inauguration is offering beds for congregants who need a safe haven from immigration raids or domestic violence.\nPastors at New Season Christian Worship Center set up thirty cots in two large rooms just days after the President issued his January executive order that expanded federal deportation policy. Congregants spread the word that they were available for anyone who was afraid of the immigration policies’ potential effect. Half a dozen families showed up in the past month. Most stayed just a couple of days. About half came with fears over immigration and half with fears of domestic abuse, according to church officials.\nhttp://time.com/4686592/donald-trump-immigration-sam-rodriguez-church/",
			"added": 1488391960
		},
		{
			"topic_id": 15,
			"title": "Refugees are fleeing Trump's America and crossing the border into Canada. This is what Trudeau needs to do",
			"body": "For so many refugees, the promise of America must feel like a mirage; to finally arrive at a destination that from afar seemed synonymous with democracy, liberty and opportunity, and now, up close, has revealed itself to be just as prone to the darker properties of despotism as the countries from which they have fled. Now that the lamp beside the golden door seems to have been snuffed out, the huddled masses have little choice but to pin their hopes on the US’s northern neighbour, Canada. Trudging through waist-deep snow and braving the bitter cold, hundreds of refugees in the US have been risking their lives this winter trying to make it into the northern country.\nhttp://www.independent.co.uk/voices/us-donald-trump-refugees-fleeing-america-canada-border-crossing-justin-trudeau-a7604781.html",
			"added": 1488392010
		},
		{
			"topic_id": 16,
			"title": "US police chiefs denounce Donald Trump illegal immigration crackdown in open letter",
			"body": "An alliance of 61 police chiefs have criticised the enforcement of Donald Trump’s immigration policies and are pleading for a change of tact.\nIn an open letter, the senior figures explain that if local police perform the “federal government’s” job by enforcing deportations, it will create \"harm\" in their communities.\nMr Trump has pledged to bring in local police forces to help with deporting millions of undocumented immigrants.\nhttp://www.independent.co.uk/news/world/americas/us-politics/us-police-chiefs-donald-trump-illegal-immigration-crackdown-open-letter-undocumented-workers-a7606191.html",
			"added": 1488392060
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}