{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I think it's important to mention tor in such instructions.\n> ...\n> Also, the one thing i still couldn't find answer to is how hard is it to configure public proxies to seed over tor.\n\nYep. Unfortunately I have little experience with tor, it's pretty slow in my network, VPS is enough for me.\n\n> Specifically, it seems that to spread the content over both \"0net-clear\" and \"0net-tor\" you need at least one \"bridging\" node that will serve your content to both networks \n\nI guess that is not necessary, I don't use tor  but from the \"0\" config panel and `/path/to/zeronet/data/content.db` I still have a lot connection with tor and onion addresses.",
			"post_id": 70,
			"date_added": 1519472687
		},
		{
			"comment_id": 2,
			"body": "> [caryoscelus](#comment_2_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Hmm, maybe if you have port open tor users can connect to you?..\n\nNope, in one machine the port is closed, but it still has quite some tor peers. Using tor can surf http websites, maybe using similar technique it can connect to peer without tor available. \n\n> I wonder if there's a way to force a connection from tor user to open-port user. That might help.\n\nAs mentioned in my article, using ssh works in this way. For tor it may be a different question: If I'm using tor and my port is closed, can I still easily publish zite to other tor peer, just like my port is still opened in the tor network?",
			"post_id": 70,
			"date_added": 1519483285
		},
		{
			"comment_id": 3,
			"body": "> [caryoscelus](#comment_13_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Hmm, i'm not sure a licence line on firefox addons page counts as proper licence statement.. but it still makes them petty liars.\n\nYeah, from the addon page the license is still GPL and source code links to Github, the new version release is active but the source code hasn't been updated for more than 1 year. Maybe the new authors just don't care or forget to change the license.. ",
			"post_id": 3,
			"date_added": 1524575298
		},
		{
			"comment_id": 5,
			"body": "> [chandelier](#comment_4_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8): I just copy & paste the content of your link to firefox's profile Dir. It looks like that it works...\n\nYep, I tried that before, adding more \"!important\" to every line may help, but iirc the profile affects all websites and slows down browser performance, also my code includes regexp but Firefox profile doesn't support it, so part of the code doesn't work",
			"post_id": 3,
			"date_added": 1524745054
		},
		{
			"comment_id": 6,
			"body": "> [chandelier](#comment_5_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8): Is it possible for Firefox 59 to use your dark theme? ...\n\nIt doesn't work, probably because of this bug: https://github.com/openstyles/stylus/issues/215",
			"post_id": 3,
			"date_added": 1524754033
		},
		{
			"comment_id": 7,
			"body": "> [gitcenter](#comment_16_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Great! The second idea should really be implemented, [..] so we have to make a browser extension, and now we have to support lots of browsers...\n\nMainly Firefox and Chromium I guess, here it's one for ssb: https://github.com/soapdog/patchfox Secure Scuttlebutt packaged as a Web Extension for Firefox. Also thx for providing the free domains ðŸ˜",
			"post_id": 100,
			"date_added": 1584842086
		},
		{
			"comment_id": 8,
			"body": "Add a short video: [Replicator - High Life - Conway's Game of Life  4.80 MB\n](/1Dphm8Mth9WYN9fPm1yxj8Y4WhcKRhYXJJ/data/users/16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN/VID_20200816_100649.mp4) on my 0-share",
			"post_id": 104,
			"date_added": 1597545342
		},
		{
			"comment_id": 9,
			"body": "> [smashbuckler](#comment_1_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): [..]\n\nThanks for the long reply and sharing your idea. You may also like to check the previous discussions in this article, too. It's better to create a feature to reduce downloading/storing duplicate files. ",
			"post_id": 90,
			"date_added": 1602321308
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}