{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "关于去中心化，密码学无政府主义的一些简单思考……",
			"body": "既然来到了零网，有些人自然就会想到一些去中心化的议题。我们大部分人生来就有国籍，有自己的母语，接受学校的教育，认同某种文化……\n1 语言是天然“洗脑”的工具，比如我现在使用的现代汉语，表述方式无时无刻不在影响我的认知，那么如何减少这种影响，我的方法是建议看看我们的常用表述方式和词汇在英语或其他语言中是如何表述的。\n2 不要预设立场，比如你是个中国人，这代表什么呢？我的理解就是中华人民共和国法律的中国国籍的人，它只是一个定义，由此你应该想到国家是如何产生的，国家的本质是什么？而单纯的比你认为自己是一个“中国人”更有意义。同样的，你可能属于某个党派，宗教，既得利益组织……但这些预设的立场会影响你的思考，阻碍你去探究“真相”。\n3 我认为一个人的独立人格非常重要，人生在世，我们在交换利益之中生存，但是对一些问题的思考，以及本质的探求，可以降低你成为某个组织（包括但不限于国家，公司，团体，甚至是家庭……）的炮灰（韭菜……）的概率。\n4 我们的肉体生活在现实社会，每个人都无法完全免“俗”。但这种建立在去中心化之上的信息流动方式，能让我们更好的去思考，能让更多的人有机会去思考，而避免某些人或组织的信息垄断。",
			"added": 1563096664,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1B4HAuapkMBUARLKGgApRuMuf88WiJahVP": [
			{
				"comment_id": 1,
				"body": "这个世界是阶级的，而非国家的。",
				"added": 1563093586
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 2,
				"body": "1 台湾目前的民主状态给大陆做了一个很坏的榜样。\n2 民主的含义是什么？那么专制呢？\n以下是我的一些理解：专制国家通过宣传部宣传意识形态，而资本主义国家更多地是通过资本来控制信息流动。审查是普遍存在的，专制和民主国家的审查等有一个度的区别。但同是国家机器，其本质是一样的，表现形式不一样。\n3 一个思想实验，假设让你和一群猴子去投票，你愿意吗？\n国家分为有效统治国家和无效统治国家，有效和无效国家都存在民主和专制国家。民主其实引入了一种博弈的方式，而博弈的核心精髓就是假定大家都是理性的。如果人们的认知差异太大，显然精英政治更能使国家的相对“正常”一些。\n4 显而易见，以地球资源承载量而言，中国13亿人口显然是无法全部达到美国的生活水平。",
				"added": 1563094876
			},
			{
				"comment_id": 3,
				"body": "> [xyoax](#comment_17_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm): 因:中国13亿人口显然是无法全部达到美国的生活水平果:中国不需要民主?你讲的好有道理但我不赞同...把人分阶级,设置壁垒稳固地位,这是肉食者的残忍,被压迫反抗是必然的!就拿中国来说,看看底层反感共产党作为的已经很多了.拿老毛的话说星星之火正在点亮.就百姓而言,共党本身需要变革,让权与民,但共党本身是不肯放弃一点点权利的,这中间必然要斗争.就目前情况说,反抗的人一盘散沙,共党一家独大一言堂政策再荒唐也能执行下来!人民如果想进入民大会堂参与国策必然要经过一系列斗争.如果真有志民主革命首先的成立个秘密组织,团结志同道合之人.再而如果可能尽量和平革命政策,经济和政治参透,避免武装斗争,不能让外国捡便宜.当然这是一点小小的想法,不妥之处还望海涵.\n\n感谢您的回复。\n1 我的原文并没有表述“中国不需要民主”这样的论述。\n2 民主在我看来只是一种统治形式，与专制相比并无“好坏”之分。我在原文中有提到的国家之有效统治，就目前的人类的生产力发展水平而言，显然有效统治国家更符合大多数人的生存利益。请注意，我使用的“生存”这个词，生活是生存的更高级形式，当然让全部中国人像美国人那样生活是不可能的，有兴趣的读者可以查询美国人的资源消耗量。\n3 人类社会的阶级那是客观存在，是由生产力决定的。\n4 中华人民共和国替代之前的朝代，和历史上的那些朝代更替并无本质不同，只是一种利益重新分配，星星之火可以燎原的农民被利用完之后，重新被户籍制度禁锢在农村。因为生产力发展水平就在那里，我这里指的生产力发展水平特指粮食生产（具体可以查询中国粮食进口量，进口粮食要使用外汇，拥有外汇需要出口，而出口由于中国没有什么高新科技，在过去的几十年只能采用低人权模式【有些人称之为人口红利】增加国际竞争力，但就是这种低人权模式也有不少农村工人认为工作比种地有利可图。）那么中国历史朝代的更替为什么陷入这种循环？个人觉得本质就是生产力/人口数总是维持在一个很低的值上。想要使这个值变大，实现西式那样的民主，要么增大生产力分子，在人类现有科技下，那个分子短时间内大幅增加有限，要么减少那个分母，我想几乎没有人想做那个被减掉的分母吧。\n5  当然政党腐败，缺乏监督机制，那是另一个层面的问题，这个层面的改观不会明显解决生产力/人口数比值低的问题。",
				"added": 1563369103
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 4,
				"body": "香港加油!",
				"added": 1578971574
			}
		]
	},
	"comment_vote": {
		"2_1GBTKJQVacvfDDfcVreu4QZQTKXpmgTmhh": 1
	}
}