{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Alias en ZeroNet:  Cómo recuperar mi identificador",
			"body": "Para los que preguntan \"cómo puedo recuperar mi ID de ZeroNet si cambio de terminal\" únicamente tenéis que copiar el fichero *data/users.json* en el mismo directorio del nuevo terminal y listo.",
			"added": 1534422515
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1DiV63jkL4C9uqTAJ7kfuk465ifcrvBbeR": [
			{
				"comment_id": 1,
				"body": "> [f5inet](#comment_2_1GT5Ut7xQ8CeAHiUjZTGByBYnG4FTp8Pub): Shur, si quieres algo 100% inimputable, habria que irse a TOR con un Hidden Service. Es algo que se puede hacer, pero cuesta pasta.\n\nHay servicios de hosting gratuitos en Tor en los que puedes establecer una key RSA personalizada sin ningún coste. De todos modos la red Tor está muy lejos de lo que pretende ser ya que la NSA y otras entidades gubernamentales tienen todos sus nodos en escucha. Si lo que quieres es privacidad ve a i2p.",
				"added": 1534421788
			},
			{
				"comment_id": 3,
				"body": "> [zaratustra2](#comment_4_16p7LDZWCZfFfjcxpNiqJecNN62neM6K7L): Tengo una duda, se me podría colar cp en el ordenador por usar ZeroNet sin tener yo conocimiento? Saludos y buen forro\n\nPues como en todos los sitios de ZeroNet, el contenido se te descarga de manera automática. Si entras a un sitio con CP simplemente elimínalo desde la home de ZeroNet y todo su contenido se eliminará de tu terminal.",
				"added": 1534422654
			}
		],
		"2_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": [
			{
				"comment_id": 2,
				"body": "Brutal spoiler",
				"added": 1534422223
			}
		],
		"3_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 4,
				"body": "+1",
				"added": 1534422774
			}
		],
		"1_13VaS2XUc4paeNGrGQcjFuq6oaHMTnjT79": [
			{
				"comment_id": 5,
				"body": "> [electrik](#comment_2_1JrmrM8rYUPphHfLiq6c42G3cpZMike7r4): Tranquilo shur, tranquilo, quieres una invi de la amistad? Esta noche en mi Instagram pondré un código con 2.000 usos para que entre más mierda al foro!\n\nNo lo sé rick",
				"added": 1534423492
			}
		],
		"1_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 6,
				"body": "> [1r43l](#comment_2_1BtvTmkd3psSAD1Fyaz13nP5Rdfuj3peBf): Por el momento estamos demasiado en bragas. Tiene que aumentar aún más el tráfico y tenemos que realizar alguna hazaña que justifique la existencia de un foro incensurable.\n> Cuando lleguemos a este punto ZeroCoches será más que un simple rebote tonto y los zhurs nos pondremos manos a la obra.\n\n+1",
				"added": 1534423762
			}
		]
	},
	"comment_vote": {}
}