{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1582401868,
			"title": "Antilibrary is not loading properly",
			"body": "The following error message is appearing in the right upper corner of the web page:\n\"Internal error: Exception: No merger (147nKEb9bBJgBDgQytEQhmiGjF8e6HkEua) permission to load:\nmerged-Antilibrary/19sZZmJPz1hADwitEs2XT6U46uHLGbHqKi/data/users/1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6/data.json (Antilibrary not in [])\nUiWebsocket.py line 187 > MergerSite/MergerSitePlugin.py line 156 > MergerSite/MergerSitePlugin.py line 133 > MergerSite/MergerSitePlugin.py line 49\"\n\nI am not a programmer. Can I do something about it?",
			"added": 1582401867
		},
		{
			"topic_id": 1583495069,
			"title": "My favorite place on the internet :D",
			"body": "My favorite place on the internet is https://e621.net.\nWhy? Because as I know, this is the only place on the internet, where you can watch a video (https://e621.net/post/show/1835956) about a Pokémon starting to literally fuck a girl, then bites her head off, then fuck her faster. It is so sick! But I love it! :D\nWhat about you? What is your favorite place on the internet?",
			"added": 1583495067
		},
		{
			"topic_id": 1583777872,
			"title": "Isn't it funny?",
			"body": "You hear a phone ring, and it could be anybody. But a ringing phone has to be answered, doesn't it?\n\nWhat would you say to this?",
			"added": 1583777869
		},
		{
			"topic_id": 1584044740,
			"title": "What else is there to do, when life turns on you, and you have retreated into some small room?",
			"body": "Let us say that you do not have a computer, laptop, internet, nor smartphones or other electronic devices. First you watch. You look out your window. You see people coming in and out of the phone booth on the street. The same ones every day. You make up names for them. You imagine their stories. But is it okay, if eventually, you get tired of imagining, and one day you follow one of them? And you hear all of his lies? And you decide that his sins should be punished? What would you do in this situation? This situation is completely imaginary, I am not in it, nor anyone else I know.",
			"added": 1584044736
		},
		{
			"topic_id": 1584198532,
			"title": "Top countries on ZeroNet",
			"body": "Today (2020.03.14) is the first day, when the United States went to the first place in my statistics.\nChina was the first so far. Now it is second.\n\nTop country\nUnited States 344 peers\nChina 301 peers\nHungary 84 peers\nUnited Kingdom 43 peers\nRussia 41 peers\nAustralia 39 peers\nCanada 38 peers\nJapan 36 peers\nNetherlands 26 peers\nFrance 25 peers\nRomania 23 peers\nSpain 18 peers\nSweden 16 peers\nPoland 13 peers\nOther 170 peers\n\nWhat about you? What are the first countries in your statistics?",
			"added": 1584198527
		},
		{
			"topic_id": 1584215413,
			"title": "Running out of alloted space on ZeroTalk",
			"body": "Hello!\nThe website (ZeroTalk) says \"used: 45.0k/50k\" and \"You are running out of your allowed space, please contact the site's admin at nofish to raise your limit.\"\nI tried to send a message to her/him (twice), but instead of sending them to \"nofish\", ZeroMail sent the messages to \"nofishes\" both of the times. What should I do? How can I contact the site's admin to raise my alloted space limit?\nThank you.",
			"added": 1584215407
		},
		{
			"topic_id": 1584244208,
			"title": "Our ZeroNet traffic statistics",
			"body": "2020.03.08: Download: 269 MB. Upload: 4.50 MB. Ratio: 0. Sent 10889 requests. Received 611 requests.\n2020.03.09: Download: 166 MB. Upload: 4.63 MB. Ratio: 0. Sent 13986 requests. Received 727 requests.\n2020.03.10: Download: 426 MB. Upload: 21.59 MB. Ratio: 0.1. Sent 81777 requests. Received 2551 requests.\n2020.03.11: Download: 281 MB. Upload: 14.16 MB. Ratio: 0.1. Sent 25243 requests. Received 2400 requests.\n2020.03.12: Download: 490 MB. Upload: 54.90 MB. Ratio: 0.1. Sent 40613 requests. Received 2685 requests.\n2020.03.13: Download: 512 MB. Upload: 52.20 MB. Ratio: 0.1. Sent 47493 requests. Received 4935 requests.\n2020.03.14: Download: 677 MB. Upload: 60.55 MB. Ratio: 0.1. Sent 84897 requests. Received 5692 requests.\n\nIs this the average ZeroNet traffic statistics nowadays? What is your ZeroNet traffic statistics nowadays?",
			"added": 1584244201
		},
		{
			"topic_id": 1584291401,
			"title": "ZeroTalking To Be Murdered By",
			"body": "How do you do, ladies and gentlemen?\nMy name is Xplosive\nAnd this is ZeroTalking to Be Murdered By\nIt is mood text in a jugular vein\nAnd I hope you like it\nOur talking requires only the simplest of equipment\nAn internet-capable device\nA keyboard\nAnd a 38 caliber revolver\nNaturally, the conversation is long-lasting\nEven though you may not be\nSo why don't you relax?\nLean back and enjoy yourself\nUntil the coroner comes\n\nI write this, because I am getting close to the alloted space limit. Currently used: 48.3k/50k.\nOnce I publish this post (if I can), the current complete alloted space will pretty much be used.",
			"added": 1584291393
		}
	],
	"topic_vote": {
		"1583931502_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN": 1,
		"1584075893_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": 1,
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1584190267_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1584209078_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1584212301_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1,
		"1584246912_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1584263708_1BbSjXHZXjp9gtTvn3FQLkTx2kzwJPkf9C": 1,
		"1576021217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1597403512_19phQegWSEy9ohnqRCLtSfKqXuwjofe62t": 1
	},
	"next_comment_id": 88,
	"comment": {
		"1581696052_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "Hello. I am one from the masses. I mean that I am not a programmer or anything similar. I am only a regular user. Nowadays I use Ubuntu 18.04.3 LTS. This is my first comment on ZeroTalk.",
				"added": 1581894525
			},
			{
				"comment_id": 24,
				"body": "> [z0net](#comment_11_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): linux is for everybody guy, that's why its free, easy to use and install.  If you want to do linuxfromscratch or something different you are free to. If you don't want to take it that far, install Gentoo and use a different init system. Devuan is systemd free as well and based on the fan favorite, Debian.\n\nYes, exactly. I would like to suggest Ubuntu and Linux Mint. These Linux distributions are created for the masses, good for beginners, and have a good community support. Nowadays I am using Ubuntu 18.04.4 LTS, and when I have some problem with it, I usually ask on the local forum, and people always help me to solve the problem. Sometimes I also help others to solve their problems, if I can.",
				"added": 1583688875
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 2,
				"body": "I would not say that the gaming is a waste of time in general, because it is not. You can earn money by playing certain (mostly blockchain based) games. For example Steem Monsters/Splinterlands, NextColony, Holy Bread, Prospectors, etc. You can also gain other values by playing various games. For example language knowledge, memory and other skills.",
				"added": 1581948367
			}
		],
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 3,
				"body": "I currently do not have any specific goals with ZeroNet. I am just/only trying out the platform since yesterday (2020.02.16) evening.",
				"added": 1581960892
			},
			{
				"comment_id": 5,
				"body": "I do not know yet. I am just/only trying it out. I am a relatively new ZeroNet user.\nNowadays I mostly watch funny GIF animations on GIF Time. Nowadays most of my ZeroNet traffic goes to/comes from GIF Time. 201 MB transferred in the last 7 days.",
				"added": 1582140674
			}
		],
		"1582025950_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 4,
				"body": "You ask this question as if the world wide web would be a non-functional thing. Or a thing, which is not good for anything. But you can accomplish many set of goals with the world wide web. And I would not say that it is unreliable.",
				"added": 1582039110
			}
		],
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 6,
				"body": "Probably they (the disappeared people) became the victims of drug dealers. Or even the victims of human trafficking. Maybe the drug dealers (or drug addicts) (or other people) will sell them (or their organs) to get money. If the disappeared people are women (or there are women amongst the disappeared people), the people, who took them may even make them prostitutes. Or the disappeared people saw, heard, read or know something by any other means (for example they figured out something) that they should not, and this is why they disappeared. There could be many (or even multiple) reasons.",
				"added": 1582378062
			},
			{
				"comment_id": 8,
				"body": "xcape2net: How do you know that the researcher calculated with only 50 samples? Kanade have not wrote in the post how much cases did the researcher person used in his calculations. He wrote only that \"multiple disappearances from around the US\". The number of cases is not specified in the post. The researcher could have used more than one case from a single US state.",
				"added": 1582394996
			}
		],
		"1582366551_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 7,
				"body": "I think that important news and important informations should be put on decentralized networks. Such as the Steem blockchain. Or even the ZeroNet, which we are using now. According to the Wikipedia, \"As of 2016 there was no way to take down a ZeroNet page which still had seeders, thus making such pages immune to third-party methods of taking them down, including DMCA takedown notices\".\nThis is probably still true. But the more decentralized networks the people are using, the more harder for the third-parties to take down something.",
				"added": 1582390998
			}
		],
		"1581744611_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": [
			{
				"comment_id": 9,
				"body": "Then I am definitely a hacker (no, I am not), because nowadays I use both Linux and Discord.\nMostly Linux. Currently Ubuntu 18.04.4 LTS.",
				"added": 1582398550
			}
		],
		"1582292798_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "I do not know, but Android is actually Linux based, so the thing, which preventing it is probably not technical.",
				"added": 1582398788
			}
		],
		"1582060549_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 11,
				"body": "I have not seen this so far. I clicked on the link to check what kind of content is available on the platform at the moment, but the website does not even load. It says \"Loading...\", but nothing is happening. I waited for long minutes.",
				"added": 1582399566
			}
		],
		"1581957882_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "Then the EOS (and probably many other) blockchain is also a pyramid scheme.\nBy the way, some people are confusing Steemit with the Steem blockchain. Steemit is not a blockchain. Steemit is a dApp (decentralized application) on the Steem blockchain.",
				"added": 1582400770
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 13,
				"body": "Cryptocurrency. Create a Steem account, and be active on the Steem blockchain. You can start it for free. You will earn Steem and Steem Dollars (SBD). You can exchange them to fiat currencies,  such as USD and EUR.",
				"added": 1583495218
			},
			{
				"comment_id": 15,
				"body": "> [buzel](#comment_5_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid): What's the requirements for it\n\nThere are no specific requirements. You can do it in your web browser from steemit.com, busy.org, steempeak.com, etc. There are many Steem blockchain interfaces and dApps (decentralized applications). Once you have a Steem account, you can use all of them with it. For example DTube and DSound. DTube is similar to YouTube, DSound is similar to Soundcloud. So you can post blog posts, comments, photos, videos, sounds/music, anything you like.",
				"added": 1583498462
			},
			{
				"comment_id": 25,
				"body": "> [randname666](#comment_8_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): Lmao, quite a lot. From crypto mining, human OCR (aka. type in captchas), DDoS/SEO (yeah there are people paying to do this) to decentralized money laundering, cryptocurrency exchanging, online phishing etc. Depends on what device you are using, what skill you got, what you already have, and what risk you would like to take.\n\nYes, but watch out for scams, because there are many. If you are planning to do a job on a website, then try to search for the name of the website + scam or review, before you would actually invest time, work/money or any effort into it to avoid scams. This could be useful/helpful in almost any case, because even some of the crypto exchanges are scams. So be careful.",
				"added": 1583689785
			}
		],
		"1583479244_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 14,
				"body": "If you find a way, then please tell me too.",
				"added": 1583495379
			}
		],
		"1583495069_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 16,
				"body": "> [edgelordofdecent](#comment_437_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): You have a mental problem.\n\nYes, I have. :D\nNormal people would not watch this kind of shit gladly and happily. :D",
				"added": 1583522580
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_1842_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): As long as fantasies remain fantasies, all is well. [...]\n\nDo not worry, I am not going to bite your head off. But I can fuck you. :D\nHahaha! :D\nI am just/only joking. Do not take this seriously.",
				"added": 1583685164
			}
		],
		"1583512099_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 17,
				"body": "\"Check out the thousands of videos we have available.\"\nYes, I checked the website. Many of those videos are full movies. I like that. I wish the mobile internet have the bandwith and the data frame to properly seed them.",
				"added": 1583524833
			},
			{
				"comment_id": 56,
				"body": "> [zeroseed](#comment_24_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): i created a seedbox for IFS on a dedicated server with 100 Mb/s bandwidth. Try this movie! [...]\n\nYou wrote \"If anyone want to publish some legal files call me and stay online\". What about some illegal files? For example cracked expensive computer software (including video games), full movies, full music albums, complete concert recordings, eBooks and other things.",
				"added": 1584100103
			}
		],
		"1583587826_154DLn4k3ckpT1v151SLaFh7mmy4TnccmT": [
			{
				"comment_id": 18,
				"body": "Rather the hidden tax on the stupid. At least we used to say that. Even one of my friends say that, who plays it. I do not play it. Lottery is worse than gambling. The chance you actually win something big is less than 1 to 10 000 million. Or even worse. 99% of the people only lose money with it. Especially in the long term. Knowing this, it would be foolish to \"play\" lottery. Many people played it for decades, and did not win anything on the long run. They only lost money. Just like you said: \"dying in an accident or getting hit by a lightning are many many times higher.\" People should save their money, and invest it. There are some relatively safe investments with relatively small risks. They would increase their money in the long term in that case. Even if it would be a small increase, at least it would still be an increase. Some government securities in my country (Hungary) have a yearly interest rate of around 6% in the long term (in the fifth year). For example the Magyar Állampapír Plusz (MÁP Plusz).",
				"added": 1583684964
			},
			{
				"comment_id": 28,
				"body": "> [steelmemes](#comment_32_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): Spending one or tow dollars a week on a Powerball ticket isn't a tax, and it's not going to break the bank. Most people spend far more than that on coffee every day.\n\nI like coffee, but nowadays I do not spend $1 USD on it daily. Sometimes not even the half of it.\nOkay, I am not from the USA, but from Hungary.\nNowadays I usually spend 100-250 HUF per day on coffee, which is $0.33 USD-$0.84 USD.\n$1 USD is currently (on 2020.03.08, 19:46 CET) 298.92 HUF.",
				"added": 1583693287
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_1857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There are $1 energy drinks.\n\nOther than tea and coffee, I have not tried any energy drinks so far, and I am not planning to try any energy drinks in the future either. I know, many people do drink them. Some regularly.",
				"added": 1583801722
			}
		],
		"1583563665_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 20,
				"body": "Thousands of people already died in this \"HOAX\". Take a look:\nhttps://steemit.com/joe/@jomeszaros/covid-19-today\nhttps://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6",
				"added": 1583686434
			}
		],
		"1580612515_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 21,
				"body": "\"Reddit like community without censorship.\"\nIs not what ZeroTalk supposed to be?",
				"added": 1583687060
			}
		],
		"1583559326_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 22,
				"body": "There are many Near-Death Experiences (NDEs) with various experiences. Many of them are claiming that they met (seen or felt) God and others. Some of the people forcefully sent back to their bodies, while others got a chance to choose to stay or go. If you are interested in NDEs, then I would like to suggest the website of the NDERF (Near-Death Experience Research Foundation). You can find the current (recently shared) NDEs on the following link: https://www.nderf.org/Archives/NDERF_NDEs.html",
				"added": 1583688154
			},
			{
				"comment_id": 30,
				"body": "> [fkljioe](#comment_3_1ECDDfizbAbA5MgiVVyZqRZrjZAdkkpoQA): It's the matrix\n\nMaybe you are right in the sense that we are currently living in an immerse-like illusion.",
				"added": 1583701534
			},
			{
				"comment_id": 33,
				"body": "> [cecil](#comment_1_13T5MCht5aHSYqLBVDsgN3bsVKjQNVVpnM): The master of the universe\n\nReally? What kind of master? Which universe? Certainly not this. This world is full of suffering and pain. Both humans and animals are suffering. This whole world is built upon suffering. Some of the animals are literally eating each other alive. Many are a little bit \"mercier\", and kill first. What kind of master would create a world like this? Probably a sadistic one. If this so called master really loves ALL of his creations, then why do he let them suffer? Why do he let them have ANY amount of pain?",
				"added": 1583760485
			},
			{
				"comment_id": 35,
				"body": "> [ssdifnskdjfnsdjk](#comment_963_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): There are so many opinions. https://en.wikipedia.org/wiki/GodI suggest you to start with Christianity, because that is what i did and found it to make sense. Also thanks to prayers i feel it is the right way to act based on what the Jesus Christ did. It is known that people pray to God. It was said that prayer should not be underestimated. The person who is humble and willing to hear and change for the better is valuable.\n\nI am not just/only willing, but I am trying to change for the better. It is used to say that God has a big plan. I hope that we (both the humanity as a whole, and every other creature) will all have love, peace, happiness and everything we need in the end.",
				"added": 1583780131
			},
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1898_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol\n\nWhat do you believe in?",
				"added": 1583800417
			},
			{
				"comment_id": 40,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1900_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): what for\n\nWhat will happen to us after our earthly lives ends? Do you believe in God? Jesus? Angels? Fallen angels? Hell? Satan? Demons? Other creatures? Other realms/dimensions/places? Anything. Nothing? What do you think about Creation? Life? How the universe/galaxy/world was created?",
				"added": 1583891127
			},
			{
				"comment_id": 48,
				"body": "> [ssdifnskdjfnsdjk](#comment_971_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): /Christ boards on Millchan and 8chan\n\nThank you. I will take a look into them. I have not even heard about 8chan so far, but I heard about Millchan and 0chan (0chan.bit).",
				"added": 1584019805
			},
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1903_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): 'i have a life': don't need any mascott\n\nYes, for now. But the earthly life are not eternal for your current physical human body. What do you think/believe will happen after the end of it?",
				"added": 1584108352
			},
			{
				"comment_id": 62,
				"body": "*is not eternal. Sorry for the typo. I edited the life/lives, body/bodies words, but forgot to change the \"are\" to \"is\", before I sent the comment.",
				"added": 1584108582
			}
		],
		"1583371743_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 23,
				"body": "Why do you feel like that?",
				"added": 1583688497
			}
		],
		"1583690170_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw": [
			{
				"comment_id": 26,
				"body": "Hungary is trying to stop all the \"refugees\" since the beginning.",
				"added": 1583690536
			},
			{
				"comment_id": 31,
				"body": "> [z0net](#comment_14_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): Fuck islam, fuck migrants, fuck the koran, fuck mohammad the child raper, wake up Europe!How long are they going to be raping your daughters, destroying your culture, and killing the innocent before you realize the time for action was almost a decade ago. [...]\n\nFuck Islam, fuck Koran? Killing the innocent? What are you talking about? Islam is just/only a religion, and some people in Europe change their religion to Islam without any force. They are free to do so, because there is freedom of religion. And many people has been killed by Christians too (the majority during the Crusades between 1095-1495), so Christianity is not better in this aspect. Religions are not bad. Certain people are.",
				"added": 1583708106
			}
		],
		"1583469946_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX": [
			{
				"comment_id": 27,
				"body": "There are many Near-Death Experiences (NDEs) with various experiences. Many of them are claiming that they met (seen or felt) God and others. Some of the people forcefully sent back to their bodies, while others got a chance to choose to stay or go. If you are interested in NDEs, then I would like to suggest the website of the NDERF (Near-Death Experience Research Foundation). You can find the current (recently shared) NDEs on the following link: https://www.nderf.org/Archives/NDERF_NDEs.html",
				"added": 1583691031
			}
		],
		"1583690992_1LzhWqcrjmmkQjaKuse2XQWuQiKSpFZ7Kv": [
			{
				"comment_id": 29,
				"body": "Just a random English comment passing by. I do not understand a single word.",
				"added": 1583699655
			},
			{
				"comment_id": 32,
				"body": "> [sfs9](#comment_61_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): Neither do I, but it seems to be NOT Russian. My Russian is really poor, but I usually recognize at least some Russian words. It is some Slavic language other than Russian.\n\n\"Да\" (Russian and Ukranian \"Da\") is \"Yes\" in English, so I do understand one word. This is probably Ukranian, but I am not sure about it. I searched for some of the text on the internet, and this looks Ukrainian.",
				"added": 1583708654
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 34,
				"body": "> [bigbadbob](#comment_856_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): 1-Set up a chain of illegal lemonade stands2-???3-Profit ;)\n\n4. Get shut down by the police, and probably lose your profits. Possibly go to jail.\n5. If your child operated it/them/some, then go to jail for that too.\n\nhttps://www.dailysignal.com/2018/07/27/how-your-childs-lemonade-stand-could-land-you-in-jail/",
				"added": 1583779698
			}
		],
		"1583768669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 37,
				"body": "Video is not everything. ZeroNet may gain popularity with other things. ZeroTalk is a good Reddit-like forum without censorship. I am a relatively new ZeroNet user, so if I am interested in ZeroNet, other people may also be interested in it. I am still using the limited space provided to new users to store comments, topics and votes. Currently used: 19.3k/50k. I know that the site admin can increase it if I am about to run out of it. But I am currently far from that.",
				"added": 1583801108
			}
		],
		"1583777872_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 38,
				"body": "> [blkdissident](#comment_1_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): Don't answer the phone unless you know who is calling [...]\n\nThat is not always possible. There were some occasions, when I received important calls from hidden numbers. Or from numbers, which I have not seen until that time.",
				"added": 1583801441
			},
			{
				"comment_id": 41,
				"body": "> [consus](#comment_21_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3): On a control panel you see a big red button labeled \"Don't Push\". What do you do? You answer the phone only if you know who's calling.\n\nI would probably not push it. But some people would probably do. Out of curiosity. To see what happens. Or simply to joke, to troll, etc.",
				"added": 1583930702
			},
			{
				"comment_id": 45,
				"body": "Let us say that you have only a wired phone. How do you know/determine who is calling you on that kind of phone?",
				"added": 1584013073
			}
		],
		"1583188389_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 42,
				"body": "> [fabcdefgwagon](#comment_14_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5): I believe people are simply taking advantage of \"penny stocks\" for when the markets rebound.... as an investor myself, that's best case scenario anyways =]\n\nYes. Many altcoins can be interpreted/considered as \"penny stocks\", and if see it that way, then I will also be amongst them. I currently have some Steem, Uptrennd (1UP), LBRY Credits (LBC). I am waiting for the prices to go up. Especially the price of Steem. Its current all time high is $8.57 USD. That was on 2018.01.03. Nowadays its price is around only $0.20 USD.",
				"added": 1583931843
			},
			{
				"comment_id": 43,
				"body": "> [xplosive](#comment_42_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Yes. Many altcoins can be interpreted/considered as \"penny stocks\", and if see it that way, then I will also be amongst them. I currently have some Steem, Uptrennd (1UP), LBRY Credits (LBC). I am waiting for the prices to go up. Especially the price of Steem. Its current all time high is $8.57 USD. That was on 2018.01.03. Nowadays its price is around only $0.20 USD.\n\nIf we see it that way. I missed typing the \"we\".",
				"added": 1583931958
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 44,
				"body": "I fell in love with a woman in middle school (between 2007 and 2012) very deeply. She knew it, because she was the one, who asked, who (which woman) I like in the class. I told her the truth that I like (love) her, and I knew that she felt the same. Or so I thought. It was a true love at first sight. At least from my side. Then one day a new guy arrived in the class, and she started kissing and being with him from one day to another. Once I literally cried because of her. Some may think that it is not a man-like behavior, but I say that it is not a shame to express your feelings. We are all humans. After the school ended (in 2012), she switched to another guy, so she is changing her man as others change their socks. I saw that on Facebook. I have not seen her since the banquet. \n\nMy love towards her was/is so deep that I think that I will keep thinking about her for the rest of my earthly life.\nSo a woman once broke my heart. No other woman will do that again.\nI am happy that now I am single. And I am independent.\n\nNo woman, no problem. Or as Bob Marley said/singed: \"No woman, no cry\".",
				"added": 1583993522
			},
			{
				"comment_id": 46,
				"body": "> [sfs9](#comment_65_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): Nah, the first love will be remembered indeed, but no worries, Your heart can be broken many times :-D  [...]\n\nTheoretically and technically yes, but practically no, if you do not let yourself fall in another love, your heart cannot be broken again. Love is letting a girl \"kill\" you, but trusting her not to. And my first (and last) love \"killed\" me. I will not give this chance/choice to a woman again. I will not love another woman. I was weak, but this experience made me stronger. I think that if you are strong enough to control your emotions, then your heart cannot be broken multiple times. Not even once, if you are strong enough not to fall in love from the start.",
				"added": 1584014111
			},
			{
				"comment_id": 52,
				"body": "> [1bfqutudhtexlka](#comment_167_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): because i have autism\n\nI also have autism. And I really/seriously do have an autism spectrum disorder.\nHaving autism spectrum disorder does not necessarily have anything to do with being single.",
				"added": 1584032728
			},
			{
				"comment_id": 59,
				"body": "> [happyhippo](#comment_7_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): You know, this actually made me self-reflect, much more than I expected.I spent a good 20 mins thinking about this.Honestly, I have no idea.\n\nIs being single feels good or bad? Have you had a girlfriend/wife? Or have you ever been in a relationship? I am just/only curious. Being single nowadays feels good for me.",
				"added": 1584106473
			},
			{
				"comment_id": 64,
				"body": "> [happyhippo](#comment_8_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): Man, whatever you ever do in your life, you decide how you want to feel about it. [...]\n\n\"Man, whatever you ever do in your life, you decide how you want to feel about it.\"\nHow you want, yes. How you actually feel, often no. You often cannot even decide. The feelings are just/only coming, and you feel them without being able to do anything about it/them.",
				"added": 1584109734
			}
		],
		"1583969906_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 47,
				"body": "\"If you have \"nothing to hide\", as so many people say, think of your responsibility to your contacts and friends.\"\n\nWhy would that be my responsibility? That is their responsibility. If they have \"something to hide\", then that is not my problem/responsibility, but their own. Everyone should take care their own privacy/data protection.",
				"added": 1584014621
			}
		],
		"1583921401_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": [
			{
				"comment_id": 49,
				"body": "> [monstoor](#comment_5_1HMaKiFfNuGYkiCk1mRMnBUcNNsECgxxzh): Have bookmarked it :-)\n\nI currently do not have TOR installed. Have you tried this SMS service? Is it works? Is it free?\nI used some free online SMS sender services over the years, but I currently do not know any.",
				"added": 1584020386
			},
			{
				"comment_id": 51,
				"body": "> [kleio](#comment_40_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): https://crypton.sh for clearnet. If you have Android you can use Tor + DNSCrypt using https://invizible.net\n\nThank you, but this is something different to what I am looking for. I already have a physical phone number, and I used free online SMS sender services in the past to send SMS messages to it (and to other phone numbers).",
				"added": 1584025098
			}
		],
		"1583931502_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN": [
			{
				"comment_id": 50,
				"body": "> [kec](#comment_11_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): I'll take both. An exchange would be wonderful. The only thing that I have managed to locate thus far - after the Cryptopia disaster - is Kucoin, but I am not sure how that plays out with international law and sanctions. If you have any advice on particular coins, I am definitely listening as well. Thank you in advance.\n\nI currently know the following well constructed, secure, reputable altcoins and exchanges:\n\nCoins: Steem/Steem Power, Steem Dollars (SBD), LBRY Credits (LBC), Uptrennd (1UP).\nExchanges, which I used so far: Coinbase, Blocktrades, Bittrex, Poloniex.\nExchanges, which I have not used so far, but may be used to exchange at least two of the above mentioned cryptocurrencies: BitShares, GOPAX, HitBTC, UpBit, Yensesa.\n\nExchanges, which can be used to exchange Uptrennd (1UP): P2PB2B, Idex, Altilly. I have not tried these.\nThere will be probably more.\nBy the way, Uptrennd (1UP) is my newest experience in my cryptocurrency journey, and Uptrennd (1UP) sounds very promising. Nowadays Uptrennd (1UP) is quickly gaining popularity. Uptrennd (1UP) is probably one of the best social networks and one of the best altcoins in 2020.\n\nThere are many other cryptocurrencies and exchanges.\n\nDo you know what is good/best in the above mention coins? \nYou can get/earn all of these coins without investing a single cent.\nThe transactions with Steem and with Steem Dollars (SBD) are free and fast (around 3 seconds) on the Steem blockchain. You can buy and sell Steem with/for Steem Dollars (SBD) on the Steem blockchain on an internal (built-in) currency market without any external exchange. Probably this is the best way to get involved/started in the cryptocurrency world.\nSteem Dollars (SBD) is supposed to be a stable coin, which should be around $1 USD all the time, but it is not. Sometimes it is less, sometimes it is much more than $1 USD.\n\nI hope that you find this comment useful/helpful.\n\nPlease let me know, if you know any other similar cryptocurrencies/exchanges.\nThank you for reading! Have a nice day!",
				"added": 1584023706
			}
		],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 53,
				"body": "> [styromaniac](#comment_1885_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I said rate the app. I didn't say it's my app. It's not mine.\n\nYou said \"Please give high ratings for ZeroNet Mobile\", but why anyone should/would give high ratings, if the program does not deserve that. People say that it is not mobile friendly, no 100% dark mode support. I have not tried ZeroNet Mobile so far, so I cannot rate it at the moment. I am using it on a desktop PC with Ubuntu 18.04.4 LTS.",
				"added": 1584041401
			},
			{
				"comment_id": 57,
				"body": "> [zeroseed](#comment_26_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): For my upvote the source code must be available. There is a link to download it?\n\nThis is an open source program. Developed by the community for the community. So the source code must be available somewhere, but I have not found it so far.\nBut I have found the source code for the ZeroNet Android app (https://play.google.com/store/apps/details?id=net.mkg20001.zeronet): https://github.com/HelloZeroNet/ZeroNet-kivy",
				"added": 1584100815
			},
			{
				"comment_id": 86,
				"body": "They probably run out of their allowed space limit.",
				"added": 1584424330
			}
		],
		"1584075893_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 54,
				"body": "I quote my own comment from the the \"Altcoin\" topic (http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1583931502_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN):\n\n\"I currently know the following well constructed, secure, reputable altcoins and exchanges:\n\nCoins: Steem/Steem Power, Steem Dollars (SBD), LBRY Credits (LBC), Uptrennd (1UP).\nExchanges, which I used so far: Coinbase, Blocktrades, Bittrex, Poloniex.\nExchanges, which I have not used so far, but may be used to exchange at least two of the above mentioned cryptocurrencies: BitShares, GOPAX, HitBTC, UpBit, Yensesa.\n\nExchanges, which can be used to exchange Uptrennd (1UP): P2PB2B, Idex, Altilly. I have not tried these.\nThere will be probably more.\nBy the way, Uptrennd (1UP) is my newest experience in my cryptocurrency journey, and Uptrennd (1UP) sounds very promising. Nowadays Uptrennd (1UP) is quickly gaining popularity. Uptrennd (1UP) is probably one of the best social networks and one of the best altcoins in 2020.\n\nThere are many other cryptocurrencies and exchanges.\n\nDo you know what is good/best in the above mention coins?\nYou can get/earn all of these coins without investing a single cent.\nThe transactions with Steem and with Steem Dollars (SBD) are free and fast (around 3 seconds) on the Steem blockchain. You can buy and sell Steem with/for Steem Dollars (SBD) on the Steem blockchain on an internal (built-in) currency market without any external exchange. Probably this is the best way to get involved/started in the cryptocurrency world.\nSteem Dollars (SBD) is supposed to be a stable coin, which should be around $1 USD all the time, but it is not. Sometimes it is less, sometimes it is much more than $1 USD.\n\nI hope that you find this comment useful/helpful.\n\nPlease let me know, if you know any other similar cryptocurrencies/exchanges.\nThank you for reading! Have a nice day!\"",
				"added": 1584077831
			}
		],
		"1584044740_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 55,
				"body": "> [bigbadbob](#comment_1000_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I don't think it's wise to decide who should be punished for their sins and take action, unless its some sort of self defense scenario.  Not much good could come from it that would benefit your life...  unless you did something so shitty that it killed ones own ego and you were forced into humility...  probably find  better ways to be humble.\n\nI agree with you in the sense that it should not be done. By the way, I took the whole situation out of the American \"Phone Booth\" (2002) neo-noir thriller film.",
				"added": 1584079812
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1902_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"You imagine their stories\"that's your problem Freak.\n\nNot mine. That statement is a part of a dialogue from the previously mentioned \"Phone Booth\" (2002) movie.",
				"added": 1584108168
			}
		],
		"1584077470_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 58,
				"body": "I am using Ubuntu 18.04.4 LTS. No program updates itself without my explicit agreement, because to install/update/remove a program, a user must use administrator rights/privileges (sudo), which is not used by default. When you use that, the system asks for your administrator password. Microsoft Windows operating systems should also work like this. They would be much safer.\n\nBy the way, updating a program without the explicit agreement of the user may backfire because of hackers exploiting it by using (putting) viruses and other malicious programs (into the update).",
				"added": 1584103738
			},
			{
				"comment_id": 63,
				"body": "> [schiz0](#comment_107_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): Absolutely not, but I think that every update should be a choice; anyway we also consider that software evolution is not an end user choice so we can  consider \"Unattended updates\" as this kind of undecision\n\nSoftware evolution on each individual's computers is really an end user choice. You may use whatever software you like to use. Nowadays I still use MS-DOS 6.22, Windows 3.11, Windows 95, Windows 98, Windows 2000, Windows XP, and a lot of old games. Many other people also do this.",
				"added": 1584109242
			},
			{
				"comment_id": 65,
				"body": "> [schiz0](#comment_108_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): Yes, but what I mean is that, for example, windows is windows, you (if you're not a coder) can't determine the software as is, you, obiouvusly, can choose what kind of software to install [...]\n\nThat is a fair point. And Windows is not even open source. Most of the Windows programs are also not open source, so you cannot really see what it is on your computer, if you use such softwares, even, if you are a coder. Nowadays my main desktop computer runs Ubuntu 18.04.4 LTS, which is an open source Linux distribution.",
				"added": 1584112237
			},
			{
				"comment_id": 66,
				"body": "> [gitcenter](#comment_1259_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I can't read schiz0's comment for some reason, could you please copy it for me?\n\nHis comment:\n\"Yes, but what I mean is that, for example, windows is windows, you (if you're not a coder) can't determine the software as is, you, obiouvusly, can choose what kind of software to install\n\nAnd we can consider \"Unattended updates\" as a coder ,not an end user, choice of software evolution\"",
				"added": 1584117013
			},
			{
				"comment_id": 67,
				"body": "> [gitcenter](#comment_1257_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): How would the hackers make an update though?\n\nI do not know, but a well prepared hacker can (are able to) do many things. It is better to be safe. To use safety measures. Such as manual updates. But even those are not enough in many cases. Many/most (?) of the operating systems contains (national) (USA) backdoors. Even open source ones, such as OpenBSD. And that system is inteneded to be secure by default. So there could be vulnerabilities, even in an open source code, and people (not even coders) would not even notice it. Or even if they would notice it, they could not do many things about it/them.",
				"added": 1584117610
			}
		],
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 68,
				"body": "Escaped? Maybe. It may even be intentional. Who knows...",
				"added": 1584143158
			},
			{
				"comment_id": 69,
				"body": "> [bigbadbob](#comment_1006_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Hard to say and I'm not big on speculation.  Doesn't even matters at this point.   Shit is hitting the fan.\n\nThen someone will have to clean it (the shit from the fan) someday. :D",
				"added": 1584197135
			}
		],
		"1584190267_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 70,
				"body": "\"Wondering how you run it and how I can make my instance more secure.\"\n\nYou probably already know it, but there are some security tips on ZeroSecurity. You (and others) will probably find it useful.\nhttp://127.0.0.1:43110/zerosecurity.bit",
				"added": 1584197954
			}
		],
		"1584198532_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 71,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_83_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): 2/3 of users use tor. You see country with exit node not users.\n\nWell, this is good to know, and this makes sense. Especially in China with the Great Firewall.",
				"added": 1584199337
			}
		],
		"1584209078_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 72,
				"body": "I already live most of my life alone. I am not forced. I choose to be alone. I like this lifestyle. I simply do not like being amongst people. I read books, watch videos/movies, and I like/love animals. Living with animals is much better. So I am not literally alone all the time. Animals do not judge you. Animals love you unconditionally.",
				"added": 1584211816
			},
			{
				"comment_id": 73,
				"body": "> [bigbadbob](#comment_1011_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I have spent much time in isolation (work/choice),  It's easy to see the worst part of anything, especially people. Preconceived notions, presumptions, and judgements are super annoying, yet we all do it. I have been trying to get out more and be more social, I can only take so much. If I focus more on my own preconceived notions, presumptions, and judgements than others... I enjoy it more.\n\nI would not say that we all do it. I do not do it. I try to accept everyone \"as is\". The only obstacle is when they do not accept me only because of my differences to the masses/average/others.",
				"added": 1584214526
			},
			{
				"comment_id": 75,
				"body": "> [xplosive](#comment_73_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): I would not say that we all do it. I do not do it. I try to accept everyone \"as is\". The only obstacle is when they do not accept me only because of my differences to the masses/average/others.\n\nExcuse me, if my English is wrong in the quote comment. I am not a native English speaker. Maybe I should have used \"just\" instead of \"only\". Or I should have wrote \"just/only\".",
				"added": 1584214981
			}
		],
		"1584212301_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": [
			{
				"comment_id": 74,
				"body": "The ZeroID background for me is animated, but it is very slowly moving. Is that how it is supposed to work?",
				"added": 1584214803
			}
		],
		"1584215413_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 76,
				"body": "> [geekless](#comment_140_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Just tested, ZeroMail works okay, message is sent. [...]\n\n1. I do not know why ZeroMail have sent my messages to another account (nofishes).\n2. Thank you. This is good to know. I hope that the script will run soon. I currently have 3.9 KB left (used: 46.1k/50k) on ZeroTalk to store comments, topics and votes.",
				"added": 1584216230
			}
		],
		"1584246912_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 77,
				"body": "Thank you, but I do not understand why it is necessary to put space limits in the first place. And why some admins put very low space amounts? For example 50 KB per user in the case of ZeroTalk. I almost reached it (used: 47.6k/50k).",
				"added": 1584248669
			}
		],
		"1584244208_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 78,
				"body": "> [toppfungg](#comment_21_16j1WtLKAKpemCzA2suD1aaWfie2854o5T): how to check my zeronet traffic statistics?\n\nYou can see a \"Stats\" link on the top left side of the \"ZeroHello\" website. http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Stats",
				"added": 1584276505
			}
		],
		"1584291401_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 79,
				"body": "> [bigbadbob](#comment_1016_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Did you zeromail nofish for a data increase?   I've had to do it a few times.\n\nI tried two times, but ZeroMail sent the messages to \"nofishes\" instead of \"nofish\". When I type the username of the recipient of the message, usernames are appearing, but no \"nofish\", as if the \"nofish\" account would not even exists.",
				"added": 1584297771
			},
			{
				"comment_id": 80,
				"body": "> [progi](#comment_17_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): Users are seed this zites, that's why there is a limit on every social site in 0Net. If there was no limit a lot of data would be downloaded for everyone in the current zite. Who make useful comments the zite administrator raise the limit. [...]\n\nAnyone may create a new account anytime. Limits are useless.",
				"added": 1584305533
			},
			{
				"comment_id": 81,
				"body": "> [progi](#comment_17_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): Users are seed this zites, that's why there is a limit on every social site in 0Net. If there was no limit a lot of data would be downloaded for everyone in the current zite. Who make useful comments the zite administrator raise the limit. [...]\n\nAnyone may create a new account anytime. Limits are useless.",
				"added": 1584305597
			},
			{
				"comment_id": 82,
				"body": "Anyone may create and use a new account anytime. Because of this the limits are useless/pointless.",
				"added": 1584305708
			},
			{
				"comment_id": 83,
				"body": "Anyone may create and use a new account anytime. The limits are useless/pointless.",
				"added": 1584305723
			},
			{
				"comment_id": 84,
				"body": "Anyone may create and use new accounts anytime. The limits are useless/pointless.",
				"added": 1584305778
			},
			{
				"comment_id": 85,
				"body": "Sorry. The website showed an error. I did not meant to send the same message multiple (five) times.",
				"added": 1584305878
			}
		],
		"1584402406_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 87,
				"body": "They probably run out of their allowed space limit.",
				"added": 1584424417
			}
		]
	},
	"comment_vote": {
		"11_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"61_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"27_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"28_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"65_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"971_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"5_1HMaKiFfNuGYkiCk1mRMnBUcNNsECgxxzh": 1,
		"7_1ECDDfizbAbA5MgiVVyZqRZrjZAdkkpoQA": 1,
		"11_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN": 1,
		"1888_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"35_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1_1PP4Upn97Ah4VxNvWFnzb3QQSoSvqar8T9": 1,
		"1884_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1,
		"494_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1000_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"998_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"24_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"10_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX": 1,
		"26_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"995_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"6_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"7_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"1252_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"116_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"8_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"108_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"1259_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1257_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"121_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1006_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"83_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"85_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"134_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"86_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"127_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"87_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"56_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"2_17vG5C1mYW8hhP9Lotauao1tAWpbMbPQiw": 1,
		"58_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1012_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"140_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"362_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"142_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"21_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"143_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"29_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"107_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"30_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1018_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	}
}