{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1602257402,
			"title": "Where to escape the New World Order...",
			"body": "Do you have any ideas where to escape from Agenda2030. It seems so perfectly designed to me that I cannot imagine where to escape to... Makes me really sad and helpless...",
			"added": 1602257401
		}
	],
	"topic_vote": {
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 1,
				"body": "> [edgelordofdecent](#comment_662_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Go off grid in a remote location.\n\nThank you very much for your reply! That's what I also already thought off. But going off grid in a remote location also requires money... And it's not easy to do when having family...",
				"added": 1602275296
			},
			{
				"comment_id": 4,
				"body": "> [smashbuckler](#comment_23_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): I'm sorry, escape from what exactly?\n\nAgenda 2030 is a hidden plan from the United Nations (in the name of the elites on this planet) to establish a so called \"New World Order\". It is a socialist government without any middle class. There is only the elites and their serving lower class. The implementation of this plan is in its last phase. The people (those that will not have to die) will life under bad circumstances - and will have to obey the ruling class strictly and serve them in order to survive. Sounds like a phantasy of some ill minded people or conspiracy theorists. But there are a lot of hints that show that this plan of the elite is for real. Youtube has a lot of infos about this. Once you start researching in that direction it's like the rabbit whole in Alice in Wonderland. If you are keen to find out youtube for \"New World Order compilation polititians\".",
				"added": 1602276272
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_2577_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No Way Out\n\nThat's what I think too :-(",
				"added": 1602277760
			},
			{
				"comment_id": 6,
				"body": "> [xart1902](#comment_1_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY): You gotta go within--when you understand you are a spiritual being having a human experience escaping becomes easier. Escaping becomes something of within the mind.  [...]\n\nThank you, \nxart1902!",
				"added": 1602360440
			}
		],
		"1602195932_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 7,
				"body": "perfect - thanks!\n\nCan we have a place here in zeronet where we can collect such videos?",
				"added": 1602361256
			}
		]
	},
	"comment_vote": {
		"1_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1
	}
}