{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 1,
				"body": "I think a zite that was dedicated to categorizing and labeling other zites based on community input could be a very handy tool.\n\nNot here for porn?  Great!  Check out the SFW community created content that has been voted as safe by the community, etc.\n\nIt would have zero negative impact on existing zites since people who don't want to know what type of content they're accessing will be able to just avoid going to the zite that curates content.",
				"added": 1528487271
			},
			{
				"comment_id": 3,
				"body": "> [realjohndoe](#comment_12_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): Nothing stopping you.. 😊 [...]\n\nI assume there would be a net benefit to the community to have a flood of \"average joes\" using zeronet.  We won't be able to get there without some type of normie-friendly content.",
				"added": 1528495081
			},
			{
				"comment_id": 6,
				"body": "ZeroNet could really benefit from a web of trust service.",
				"added": 1528555651
			}
		],
		"1528170453_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 2,
				"body": "verify the permissions of the file by executing this command:\n\nls -l /var/lib/tor/control_auth_cookie\nIt might say something like this:\n\n-rw-r----- 1 tor tor 32 Jun  8 08:28 /var/lib/tor/control_auth_cookie\n\nThis means that the file in question is readable and writable by user \"tor\", readable by group \"tor\" and not readable or writable by anyone else.\n\nYou'll want the user zeronet is running as to be able to read the file.  There are a few ways to do that.  One is to add the zeronet user to the group \"tor\".\n\nCheck which user zeronet is running as by executing this command:\n\nps aux | grep zeronet\nIt might say something like this:\nzeronet   7835  [extra stuff removed] zeronet.py --config_file /etc/zeronet.conf\n\nThis means that zeronet.py is running as the user \"zeronet\".\n\nCheck which groups zeronet user belongs to by running this command:\n\ngroups zeronet\n\nIf it doesn't return \"tor\" (or whatever your cookie file group is) then you want to add zeronet to that group.\n\nYou can use a command to add zeronet user to the group tor, but I always just edit the group file.  You can google for how to do that stuff.\n\nOr a quick and dirty and insecure fix would be chmod 644  /var/lib/tor/control_auth_cookie",
				"added": 1528489045
			}
		],
		"1528468903_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": [
			{
				"comment_id": 4,
				"body": "> [thunder33345](#comment_128_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): site failed to load\n\nMaybe that is the joke? :D  The user disappeared!",
				"added": 1528495202
			}
		],
		"1528523924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "I agree that ZeroNet needs a marketplace, but I don't quite agree that this style would be novel enough to attract users.\n\nI want ZeroNet to have a marketplace, but I'm having difficulty finding specific usage cases that make ZeroNet better than a tor hidden service.\n\nWhat kind of marketplace would benefit specifically from what ZeroNet offers?\n\nThe things I see that ZeroNet offers above and beyond tor are: Decentralization and DDOS resistance.  Taxes and fees are an additional issue that are secondary to crafting a market that benefits from what ZeroNet can offer.\n\nZeroNet seems to thrive in a situation where powerful entities are actively trying to take the content offline.  If the marketplace is ethical and legal, why would a powerful entity try to take it offline?  Competition?  I doubt it would get big enough to warrant that threat without first justifying its existence on ZeroNet instead of on the regular web.\n\nI'd love to see an ethical and legal marketplace here, but I think the market should focus more on at least the grey market if not the black market.  That would cause it to need the resilience of decentralization. \n\nAm I missing something?",
				"added": 1528554943
			},
			{
				"comment_id": 8,
				"body": "OpenBazaar seems to benefit from non-distributed single points of failure for search.  Someone should at the very least, make a ZeroNet search index for OpenBazaar.  If it were hosted initially through a single point of failure like a tor hidden service it could plug in seamlessly to the existing OpenBazarr framework.\n\nThen eventually OB could be hopefully rewritten to allow ZeroNet search indexes to remove the single-point of failure for that distributed marketplace.\n\nLater, these ZeroNet marketplace indexes might be able to be used to create a wholly zeronet marketplace.",
				"added": 1528736402
			}
		],
		"1528558109_1JqrogiDCFGRVVrCdxwP93wurKDSgUCk4E": [
			{
				"comment_id": 7,
				"body": "Running your own mail server is a good learning experience and is somewhat rewarding.\n\nIt is a good step towards running a number of personal services.\n\nIt will likely cost you some additional monthly expense.  Either from turning your home internet connection into a \"business\" class one by getting a static IP or a subnet, or by leasing someone else's machine on \"the cloud\".\n\nOther services that might be less hassle and more rewarding initially, might be a personal website, a jabber (XMPP) server, or some type of game server (look into linuxgsm).",
				"added": 1528735617
			}
		],
		"1528729710_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": [
			{
				"comment_id": 9,
				"body": "USB device?  I assume you mean USB external hard drive or USB flash drive if you're talking about the finder?  If it is a new device w/o any data on it, maybe try reformatting it with a Mac-friendly FS?  Like HFS+ or whatever?  I'm not a mac person.",
				"added": 1528746739
			}
		],
		"1528582989_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "I haven't read any of the documents involved, so if I'm asking uninformed questions and generally being a tool, that is why ;)\n\nBut, what is to prevent someone from saying \"send the parcel to me in this remote area\" and then just stealing the drone?",
				"added": 1528748958
			}
		],
		"1528806828_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "There are some things that I've found work well for anxiety.  Unfortunately, they take effort and maintenance, which makes them difficult to initiate and continue when in a bad place mentally/emotionally.\n\nI'd definitely suggest some type of professional help, but approach it from a place of actively searching for a mood solution.  Meds can be avoided, but depending on where you are at they may be very helpful in the short term.\n\nRegardless of the professional help situation, try getting 30 minutes (or more) of exercise every morning.  Get that heart rate up and keep it up for about half an hour.  It doesn't matter which types of activities you're doing, just get the exercise.  Your mood will improve, your brain will be able to see more angles about your current situation.  More information can be very helpful.\n\nExercise every morning for 30 minutes.\n\nOr, take a listen to what this guy has to say:\n\nhttps://www.youtube.com/watch?v=o73pqQ9Gzt4",
				"added": 1528818641
			}
		],
		"1537239676_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 12,
				"body": "A web of trust system.  It could be leveraged for all sorts of things.  A user could list zites as \"trusted\" for certain categories on a scale of 0 to 10.  A user could trust another user's trust ratings on the same scale.  It could then be used for an ecommerce site like openbazaar on ZeroNet.",
				"added": 1537456374
			}
		]
	},
	"comment_vote": {}
}