{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1579246090,
			"title": "How do you think about the Hong Kong protests?",
			"body": "",
			"added": 1579246089
		},
		{
			"topic_id": 1579836220,
			"title": "Is it possible to mute the one who create post?",
			"body": "Just too many conspiracy theories here. I'm gonna reduce the number of invalid information and improve my reading experience.",
			"added": 1579836218
		},
		{
			"topic_id": 1580047559,
			"title": "Is there a zite to trade bitcoins or laptops?",
			"body": "",
			"added": 1580047556
		},
		{
			"topic_id": 1580063953,
			"title": "What will happen if my ISP blocked most of Zeronet trackers?",
			"body": "I recently found out that most of trackers are not working. Only a few newly announced trackers are working.",
			"added": 1580063949
		}
	],
	"topic_vote": {
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1579208009_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1578316607_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "How to deal with someone who creates unlimited accounts and spams everywhere.",
				"added": 1578338852
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1556_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you can'twe call that life: [...]\n\nThe Chinese Government was doing spamming to \"protect\" the citizens from viewing anti-government websites, and the glorious Government was doing it for profit as they can exploit more from it citizens.",
				"added": 1578342778
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Nuclear weapons on the way.",
				"added": 1578479380
			},
			{
				"comment_id": 4,
				"body": "https://www.businessinsider.com/trump-iran-attack-tactical-nuclear-weapons-war-consequences-2020-1\nTensions between Iran and the US have escalated dramatically in recent weeks, most notably with President Donald Trump ordering the assassination of Iranian Maj. Gen. Qassem Soleimani.\nTrump has vowed potentially disproportionate attacks against Iran if the country retaliates against Americans.\nNuclear-weapons experts aren't immediately concerned about a \"tactical\" (or limited) nuclear strike against Iranian targets, but they said Trump as president made it a much likelier possibility.\nIf the US or its allies used even one nuclear weapon in combat, it would end a 75-year streak of nonuse, with global and lasting consequences.\n\"It's possible people around the world will get together to ban these things. But I think the reality is that we'd see nuclear weapons used not on a frequent basis, but on a more regular basis,\" one researcher said.",
				"added": 1578480016
			},
			{
				"comment_id": 5,
				"body": "> [gadfly](#comment_17_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8): Not likely. The strike on the bases is being considered a small retaliatory incident. Once the details of the 737 manifest are known, however, the shit may hit the fan. If you hear about an AC-130 in use by the US, start buying bottled water.\n\nThings are getting better if we can solve the nuclear problems of the North Korea by buying bottled water, and Iran is becoming the second North Korea.",
				"added": 1578509196
			}
		],
		"1578899506_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 6,
				"body": "Global cooling? Yet another student from Trump University",
				"added": 1578914579
			}
		],
		"1579246090_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 7,
				"body": "> [1bfqutudhtexlka](#comment_159_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): nothing will happen , unless the use of weapons or true independence from shitty china , look at egypt and what happened after their revolution , nothing changed , we all hoped that it will become a true democracy but it went to hellno change comes from civil protest , real change comes from war\n\nThey already used bows and bricks in December, but they lost the war.",
				"added": 1579301675
			}
		],
		"1579308930_15ejULqV1hgf1dpn9sXkpXAMzEBexrSBCx": [
			{
				"comment_id": 8,
				"body": "IPFS is also fancy.",
				"added": 1579309291
			}
		],
		"1579598887_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 9,
				"body": "#AssangeSayHellotoDonaldTrumpInTheSameRoom",
				"added": 1579600555
			}
		],
		"1579833952_1PJqSeaog4kXbkvrjmjG7bxJBCVFD9FU4r": [
			{
				"comment_id": 10,
				"body": "The Global Cooling.",
				"added": 1579835569
			}
		],
		"1579836220_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 11,
				"body": "> [alfr](#comment_1_1LrW8M76omSeDjzbscCJUPndJuoYgQd626): you might mute us, but the information will still be here. get yourself a pair of horse blinkers for real life too so you can only see the tunnel ahead of you.\n\nThat's different. Racists and porn are damaging one's mental healthy. I would never install any horse blinkers on my horse because the blinkers does not block the threatens, however the mute function in zeronet is really blocking some good damage.",
				"added": 1580098450
			}
		],
		"1580070228_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 12,
				"body": "My father believed that alcohol cures coronavirus and drinks more often. There's even some scientific evidence that alcohol can be used to kill virus.",
				"added": 1580100542
			}
		]
	},
	"comment_vote": {
		"30_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"10_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"70_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"77_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": 1
	}
}