{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "console.log(\"Hello world\");",
				"added": 1565615846
			},
			{
				"comment_id": 3,
				"body": "hello, hows everyone today? :3",
				"added": 1565616478
			},
			{
				"comment_id": 4,
				"body": "> [dreams](#comment_6_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): awesome\n\nhehe~ i see what chu did~ >:D",
				"added": 1565616650
			},
			{
				"comment_id": 7,
				"body": "> [dreams](#comment_11_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): alt text\n\nany ideas where can i get the guide for the style text? ;3",
				"added": 1565617258
			},
			{
				"comment_id": 10,
				"body": "> [dreams](#comment_12_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): here ya go:ZeroWiki MarkDown Cheatsheet [...]\n\nthanks~~ ;)",
				"added": 1565623501
			}
		],
		"1565614209_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "> [223556](#comment_74_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Suicide =/= mental illness.Being a pussy bitch =/= mental illnessYour local cutting depressed quirky teenage girl is spoiled. She has comfort and complacency, which I agree is not directly the cause but is the prerequisite. Without those prerequisites she would not be depressed. [...]\n\n\nI disagree on this because being a pussy bitch =/= depression.\nIts like gaming disorder, people who play 20h/weekend and still go to work normally in weekdays =/= game addicts. Game addicts are classified when they disregard sleep, eat, sit for so long that their leg's tissue starts to die. This also goes depression, people who have them also have extreme behaviour that we can base on and diagnose like chronic sadness,.. etc, its not the same stereotype pussyness is the ones who have depression. \n\nhmm weird, how do you know monkeys in the trees don't have  depression *insert thinking emote*",
				"added": 1565616431
			},
			{
				"comment_id": 5,
				"body": "> [223556](#comment_76_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): We're arguing semantics. Agree to disagree on that tbh [...]\n\ni believe that having your legs slowly dies by sitting for so long is quite the incentives to stand up for a walk...so then why they didnt, dont they feel hungry, pain, fatique from all that gaming?",
				"added": 1565616858
			},
			{
				"comment_id": 6,
				"body": "> [techtheawesome](#comment_5_15X6BqzUSyF6s3JionhVFccAf52FAJ7Xpd): i believe that having your legs slowly dies by sitting for so long is quite the incentives to stand up for a walk...so then why they didnt, dont they feel hungry, pain, fatique from all that gaming?\n\nthe fact that they didnt, despite awareness of it is what define the illness people have depression cant just magically will themselves out of it even if they wanted to",
				"added": 1565616928
			},
			{
				"comment_id": 8,
				"body": "> [223556](#comment_78_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Exceptions do not trump the rule.The guy you describe is an exception. Game addiction in general is not a mental illness.The guy that masturbated for 48 hours is an exception. Masturbation addiction in general is not a mental illness.Same goes depression.All is sourced from too much comfort, too much spoils. [...]\n\nI think theres a misunderstand here, those people you called exception are the group that classified to have the illness. The others who also have some extreme behaviour but and i say but able to exercise their will against the compulsion to live effectively when they *wanted* to is what get misunderstand as addicts but they are not. Those pussy bitch that you called are just under compulsion not addiction. Addiction is still an illness, a physical symptom that the patient (who has it) cant control with their will alone hense cant will themselves out of depression.",
				"added": 1565623270
			},
			{
				"comment_id": 9,
				"body": "> [223556](#comment_79_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): re too comforted, it makes them weak. Both mentally and physical. They get prescribed medications that only numb them to \n\nAnd about the medication yes, its an epidemic, and yes you're right about it because the line between under compulsion and addition is quite hard to differentiate an many get misdiagnosed. Here we have yet taken into account the environment such teenagers are in. They might as well be *taught/conditioned* to feel helpless and lazy to the point that it became chronic during their development rather than somethings wrong physically with them.",
				"added": 1565623461
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_955_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We weren't supposed to advance beyond the native Americans, who only had animals that couldn't be domesticated. Plagues came from animals that were domesticated, which is in the Eurasian region. [...]\n\n\nThe problem is even in the face of starvation (or any of those stimulation that trigger survival instinct) those who has mental illness doesn't respond to it properly... The line is blurry and only become clear in such extremity, that's why diagnostics have to be taken carefully in consideration.\n\nIts a beautiful and complex topic, heart breaking to see that media makes it really confusing and hard to approach for normal people like you and me.",
				"added": 1565624206
			},
			{
				"comment_id": 12,
				"body": "> [megatonjim](#comment_4_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT): You are a fucking idiot! Were your mother and father related, by any chance?!?\n\nwhat does this have to do with any of the other stuff? xD *insert uncontrolable laughing meme*",
				"added": 1565629692
			},
			{
				"comment_id": 13,
				"body": "the time line is messed up xD is it just me or everyone too? :o",
				"added": 1565630334
			},
			{
				"comment_id": 14,
				"body": "> [bigbadbob](#comment_229_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): free speech bitch.   staying mad is your choice\n\nmeh, stuff like this happens all the time xD",
				"added": 1565630522
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_231_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): or perhalps big typing fingers\n\ncould be, hehe~ well gtg, check you later. anyway of keeping contact? zerome? :3",
				"added": 1565631185
			},
			{
				"comment_id": 16,
				"body": "> [bigbadbob](#comment_232_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): if that was directed at me... I've got two words.   Cognitive dissonance\n\nwell gotta give it to ya, those are useful words :D have to use them more often\n",
				"added": 1565631293
			}
		]
	},
	"comment_vote": {
		"1_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i": 1,
		"2_15X6BqzUSyF6s3JionhVFccAf52FAJ7Xpd": 1
	}
}