{
	"posts": [
		{
			"id": "adad6b54-35dd-4720-88c7-b12b3ea7ffe1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "2905bbec-6fe0-40a8-85fa-74f9cf16d663",
			"body": ">>7222ef5a-f2a6-43e5-acd1-fa394b88d86e\nExactly. What have imageboard posters ever accomplished other than get less than a hundred muslims killed, if it wasn't a CIA OP anyway?\nIt's time to accept a few thousand anons spread across all imageboards aren't enough to defeat trillions of dollars. And I'm not even blackpillnigger.\nWe might have a bright future or not, but in either case there's very little we can do.\nPersonally the loss of 08chan doesn't bother me too much. Where we're supposed to be going we won't have imageboards, or Internet at all for that matter. So better get used to it.",
			"time": 1567147275700,
			"files": "[]"
		},
		{
			"id": "0f7b98b2-c57c-4787-9961-8ef49b076290",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c7efbd2c-9a13-4386-b72d-73436fbefd25",
			"body": ">>05edeafc-7a93-4882-aab1-6c9a3cf96c91\nYou sound like a low IQ moron.\n>Shills get muted and worthwhile contributors get recognised.\nThe dumb ones might get muted, the smart ones will get a new ID every couple posts like I do.\n>Your anonymity comes from your opsec.\nDo you even know what OPSEC is? OPSEC means operational security, keeping your operations secure, which translated to civilian language means \"keep others unaware of your operations\". The whole point of an imageboard is to talk to others about things you've done or learned, so pretty much by definition using an imageboard means breaking operational security. \nAnd if I'm wrong, please tell me what \"operations\" you and others keep talking about, and '''how''' you propose to keep those \"operations\" \"secure\".\nBecause no matter how good your \"OPSEC\" is, if you keep talking about stuff that interests you at some point you'll give out enough bits of identifying information to single you out among everybody on planet Earth, about 33 bits of identyfing information are needed since log_2(8 billion)~33.",
			"time": 1567149100619,
			"files": "[]"
		},
		{
			"id": "a6c12004-d2f7-419e-abe6-c7d6f339bdbc",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "86ad9bb6-fb1a-4d1e-b3ba-b9928ee0e8ae",
			"body": ">>e0a83f44-8134-49a5-92c5-4e7e7b6c95b1\nThis is not accurate. Tor Browser includes source level patches to enhance the chances of maintaining anonymity.",
			"time": 1567149215181,
			"files": "[]"
		},
		{
			"id": "c5b5c3ec-76bf-4284-827f-a97904d41b58",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f33de9f6-1f04-4782-93ca-07421b145b28",
			"body": ">>aab41c1d-0c6d-4bab-ad2d-86d7503e6106\nBecause most people aren't into that, and this place has 5 posters to begin with.",
			"time": 1567149478271,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}