{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Socialism is the only way to get out of Capitalism",
			"body": "And fail miserably because it ignores human limitations, how much they can know about the world around them and how much they will care for the ones they know better than most. Individuals will also work harder if they are rewarded properly for labor, even if other people really need it. The individual that can't control what happens to the rewards that they contribute with will lose some of his motivation and produce less, because he has other goals to spend his time with. Read [Choice: Cooperation, Enterprise, and Human Action.](magnet:?xt=urn:btih:9a43f9ce7b677960240d69c16934d3c2fd2ba0a3&dn=Choice%20by%20Robert%20Murphy.epub&tr=udp%3A%2F%2Fexplodie.org%3A6969%2Fannounce&tr=http%3A%2F%2Ftracker.aletorrenty.pl%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969)",
			"added": 1471247880
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_18GHRRFQYHNstG54GhC8cEgiPptdNkBr3c": [
			{
				"comment_id": 1,
				"body": "> [biguser](#comment_1_1BKxbbov3d8NaYpuFB4HTftAHKz9VVXi8Y): You forget USSR growing was 15-20% and there was no unemployment. So, **Soviet socialism and Bolshevik communism** are the best for all people.\n\nFTFY",
				"added": 1472611990
			},
			{
				"comment_id": 2,
				"body": "It is easy to put everyone to work when you nationalize all companies, control all wages and arrest everyone that doesn't toe the party line. Hitler was imitating the USSR and turned the German workers, companies and the economy into prey for the Vampiric Nazi Reich. Read the accounts by actual economists and business people, here is an [excellent source for free.](https://mises.org/library/vampire-economy)\n\nHitler is utter subhuman trash for sending 5,318,000 of the best Germans to die for nothing, killing other Europeans and Americans. Why do something so stupid, wasteful and shameful? He even lost the war. He was a ridiculous failed politician that people were dumb enough to believe in. There were also 3 million civilian deaths of Germans. I am assuming you are a raging racist, that is why you can only focus on Germans. Think about killing 8 million Germans. How weak is Germany right now because of it? That is what Hitler accomplished for Germany.\n\nBut he and the war in Europe also got killed 500,000 Italians, 450,000 British, 600,000 French, 1,700,000 Yugoslavs and 6,000,000 Poles. And other hundreds of thousands in Hungary, Greece, Romania and Lithuania.\n\nThe blame is on the utter failure of modernist, secular philosophies that enshrine the state and race war (and class war) as the ultimate human goal. Religion is always losing its superstitious tendencies as people become educated and engaged with life, but creating anti-religious political schemes to control people bring utter destruction.\n\nIf Italy had became traditional catholic and Germany had become radically Lutheran, by some twisted change of history, instead of having fascism and nazism, the world would have tens of millions more of the finest German and Italians and French and British. Our technology would be advanced much beyond mobile phones and the Internet. They would have space industry, settlements in Antarctica, South America and Africa. Instead, European populations are dwindling under forceful multiculturalism and shame dumping leftism.",
				"added": 1472613655
			}
		]
	},
	"comment_vote": {}
}