{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1535697411,
			"title": "土地阴谋",
			"body": "据官方文件，土改从1950年冬开始到1953年结束，将近3亿的无地农民获得了7亿亩土地、近300万头耕畜、近4000万件农具、3800万间房屋和105亿斤粮食。\n\n1950年土改时，中共本已控制政权，完全可以通过政府颁布法令，把土地分配给农民，实现和平土改。但是毛泽东们坚决反对这种方式，主张通过组织农民与地主进行面对面斗争，夺回土地，搞流血土改。他们先为农民设定了阶级敌人的比例，1948年规定“将土改中的打击面规定在新解放区农民总户数的8%，农民总人口的10%”，然后要各地按这个比例制造敌人。以当时3亿农民参加土改计，制造出的阶级敌人有900万人。\n\n土改工作队普遍鼓励农民打地主，甚至亲自上阵打人。苏南2742个乡，有200多个乡发生乱斗乱打，218人被打、被吊、被迫下跪或被剥光衣服。新华社记者穆青写于1950年6月2日的《内部参考》中记载，河南土改，一个多月发生逼死人命案40余起，兰封县瓜营区20天里逼死7人。1953年春，广东西部地区的土改中有1156人自杀。当时广东流行一个口号：“村村流血，户户斗争。”据保守估计，当年土改杀死了200万地主分子，另有估计可能多达450万人在土改中死亡。\n\n毛泽东通过发动群众夺回土地的办法把农民吸引过来，武装起来，让农民手上也沾血，也跟地主对立，这样农民就只能跟共产党走。这种分土地的方式，让农民有一种感恩思想，觉得共产党打土豪分田地，是为穷人说话、为农民办事。毛泽东曾总结他的成功经验：“每到一处，先必制造恐惧，以巩固基层政权。”通过杀地主、富农，基层老百姓都处在恐惧和紧张之中，就不得不跟共产党站在一起。任何人站在它的对立面，就可能会成为镇压和专政的对象。如此一来，它的基层政权就巩固了。杀人立威，你杀了人，大家就怕了，就服了，这个政权就稳固了。\n\n除了杀人，还有重组阶级队伍。他要制造一种天翻地覆的感觉，使原来处于下层的一些人翻到上层，把原来处于上层的人压到下层。这也是它巩固政权的一个重要的手段。\n\n土改之后为什么又搞合作化，将土地收归政府？为什么一定要走一个把土地分给农民的过场呢？有分析认为，这也是出于政治权谋。当初毛泽东说，将来我们建立政权后，要把土地无偿分给农民。这个承诺，对农民，特别是对贫苦农民，非常有号召力。如果他当初说，将来他建立政权后要把土地收归国有，恐怕农民谁也不跟他闹革命了。\n\n土改运动的一项重要内容是在农村划分阶级，将农村人口划分为雇农、贫农、中农、富农和地主。贫雇农是中共依靠的对象，中农是团结的对象，地主和富农被定为剥削阶级，是打击的对象。从此，中国农村阶级阵线分明，出现了永远的下等阶级——地主和富农。当代文化批评人叶匡政说：“细究起来，土改的头等大事倒不是‘土地还家’，因为‘还家’的土地没过几年就被‘合作化’了。土改真正的大事是‘划阶级成分’，这划定的阶级成分不仅改变了很多人的下半辈子，甚至影响了几代人的命运。”\n\n土改时，中国农民欢天喜地瓜分了地主、富农的土地。不旋踵，中共又将土地从农民手中收走，中国贫穷农民的土地梦做了还不到两年。直到今天，各级官员对土地都有极大的支配权。他们可以随便征地、拆迁，随便制定土地价格和补偿标准，继续让农民或者土地使用者蒙受损失。农民也就形成了一个观念：土地是国家的。政府予取予与，农民无话可讲，无可奈何。\n\n（选自《黑五类忆旧》第二期，2010-08-16）\n\n来源：黑五类忆旧\n作者：李肃",
			"added": 1535697410
		},
		{
			"topic_id": 1535705844,
			"title": "潘汉年案与胡风案的巧合之处",
			"body": "六十年前的春天，在一个多月的时间里，天子脚下的北京先后发生了两件令人疑窦丛生的重大案件：一个是长期从事情报工作的潘汉年被秘密逮捕，另一个是著名诗人、文艺理论家胡风被以反革命集团罪逮捕，而逮捕他们的命令竟然都是直接来自党和国家的主席毛泽东。\n\n1956年4月25日，毛泽东在中共中央政治局扩大会议上做《论十大关系》的报告，谈到“顶级反革命份子”时说：“甚么样的人不杀呢？胡风、潘汉年、饶漱石这样的人不杀，连被俘的战犯宣统皇帝、康泽这样的人也不杀。不杀他们，不是没有可杀之罪，而是杀了不利。”胡风、潘汉年这样两个远离权力中心的人物到底犯有什么“可杀之罪”，居然有幸排列在“反党集团”头目饶漱石之前？\n\n潘汉年的核心罪行据说是因为他隐瞒当年私自会见汪精卫一事，可这只是一件已经过去十多年的陈年旧事，当时毛泽东对此事并非毫不知情，而这个历史事件对现时的政局更不会产生任何影响。即便需要惩罚潘汉年，也应当淡化处理，尽量减少影响，将其弃之不用、软禁起来也就够了。如此大张旗鼓地处理这件事，尤其显得反常。而胡风的被捕也非常奇怪，五十年代国人知道胡风，恰恰是通过那首歌颂毛泽东的长诗《时间开始了》。在诗中，作者将他心中的毛泽东几乎比作了踏破洪荒、开创宇宙的上帝，崇拜敬仰之情溢于言表。固然毛泽东对意识形态极端敏感，对胡风的文艺理论不满，有意用延安文艺精神统一思想，但是，身为最高领袖也大可不必亲自操刀，尤其不必给其一个反革命的桂冠。潘汉年被逮捕，事先毫无征兆，连为潘汉年传书的陈毅也倍感惊讶，而胡风被捕更是出乎所有人的意料之外，两位钦犯的所谓罪证几乎都是在他们身陷囹圄之后才发现的，那不过是为领袖决策背书而已。胡风事件的重要当事人舒芜事后也多次讲到：“真没想到会搞得那么厉害！周扬他们也没想到”。\n\n尽管潘汉年和胡风罪名相异、缘由不同，冤案平反后有关部门给出他们落难的原因却基本相同：“主要是当时（毛泽东）对阶级斗争形势的错误估计”（罗青长），“当时，毛泽东在思想上存在着对国内阶级斗争形势，对敌情，估计过于严重的‘左’的情绪。”。\n\n让我们先回到那个时代，据此来把握当时的政治脉搏。1953年3月5日斯大林死亡，不仅引发了毛泽东继承其衣钵的雄心，也带来了调整内部权力格局的契机，由此开始了中国政治的多事之秋。就在周恩来率团在莫斯科参加斯大林葬礼的时侯，3月10日中共中央作出决定，撤销以周恩来为书记的中央人民政府党组干事会，对中央政府的领导工作重新作了分工，周恩来除名义上负总责外，具体工作只分管外交。负责确定国家计划工作的高岗大有后来居上的趋势，俨然和刘少奇、周恩来成鼎足之势。然而，阴错阳差，却由此导致了中共建国后的第一次党内重大冲突，以高、饶落马暂告结束，这便是历史上的高饶事件。高岗自杀后，毛泽东深感惋惜和懊悔。高饶事件于1955年3月落幕后不久，同年的4月初到5月中旬这一个多月时间内，就接连发生了潘汉年案和胡风案。\n\n潘汉年案件事发突然，落在1955年4月这个时间点或许有偶然因素，而已经持续了数年之久的胡风问题，也在这个时间点陡然发生了本质性的突变，恐怕就不是偶然事件了。除了敏感的时间点巧合之外，两个案子的无厘头也极为相似。潘汉年作为一个为中共事业成功起到过重大作用的情报首脑，突然变成内奸，其突兀之处令人生疑；而胡风案，在逆境中的“一批明火执仗的革命党”居然在革命成功后成了反革命，即便是罗瑞卿、胡乔木等人也不会相信。但是，天底下没有无缘无故的事情，在这两个案件看似不合逻辑的外表下，其中一定有它隐而不显的逻辑存在。\n\n在潘汉年和胡风的问题上，周恩来和毛泽东是明显不一致的。周恩来和潘汉年、胡风两位钦犯恰巧都有着极深的渊源，胡风自1937年至1949年前后，就一直在周恩来的直接领导下开展左翼文学活动，深得周恩来的赞许。用某些人的话说，胡风也算得上是周恩来的“身边人”。而胡风对周恩来的知遇之恩也极为感戴，以至于在书信中把仅仅年长他四岁的周恩来尊称为“父周”。后来，胡风在给中央的上书（30万言书）中，还极力表白了他和周恩来的关系，以示他对中共的忠诚。做为政治家的周恩来，当然是从政治的角度和胡风交往的，可能不像胡风那样看重双方的私谊。但是，胡风和周恩来关系密切在高层和文化人当中应该是众所周知的事情。潘汉年和周恩来的关系就更加不一般，早在1931年潘汉年就在周恩来的直接领导下从事秘密工作，并在顾顺章叛变后，和陈云、康生一起共同掌管特科，成为中共情报工作的首脑之一、上海滩上的神秘“小开”。到达江西苏区后，潘汉年又在周恩来的领导下，先后参与和十九路军、粤军的谈判，由此成为红军的“外交部长”，后来又协同周恩来参与第二次国共合作的谈判。正如周恩来在潘汉年被捕后对情报系统官员所言：“我同潘汉年交往的历史最长，关系最深，我都不紧张，你们紧张什么？”周恩来内心在想什么，他人无法断定，但是，在中共高层中周恩来和潘汉年交往的历史最长，关系最深却是确凿无疑的。\n\n潘汉年从地方大员变为国家敌人只用了一天时间，其中的演变过程过于隐秘和突然，相关档案至今还处于秘密状态。通过潘汉年平反后公布资料可知，周恩来显然是对此案有怀疑的。潘汉年被捕后，根据周恩来的指示，李克农责成专人审查了解放前潘汉年的全部档案材料，于1955年4月29日，向中共中央政治局和书记处写了正式报告，提出了有力的反证材料：\n\n一、中央屡有打入敌伪组织，利用汉奸、叛徒、特务进行情报工作的指示；\n\n二、潘汉年利用李士群、胡均鹤等的情况都有正式报告；\n\n三、潘汉年为中央提供了大量决策性的情报；\n\n四、潘汉年所参与、了解的组织机密，一直未被泄露，直到上海解放；\n\n五、潘汉年所属的重要关系，当时还在起着绝密的现实作用，这是毛泽东、周恩来同志所知道的。\n\n这五大反证对潘汉年没有起到任何作用，尽管其中的每一条都足以推翻这个明显有悖常识的、所谓“内奸”的荒唐定性。而这些也足以质疑对潘汉年的处理，从一开始便像是醉翁之意不在酒。\n\n由持续多年的胡风案件的演变更可以看出毛泽东和周恩来的不同。胡风案件最初是由胡风和周扬等人的冲突引发的，他们之间的矛盾源自三十年代的“左联”时期，其中既有文艺理论上的因素，也有人事上的因素，胡风和周扬等人可谓同志加宿敌。自建国之初，周扬等人就一直在部署和开展对胡风等人的整肃，当时主管文化工作的周恩来对此也有过批示，但基本上是以局外人的身份来对待胡风和周扬之间的争论。周恩来清楚周扬与胡风在历史上结怨很深，由周扬等人主导这次批判并不恰当。不过，周恩来基本上默认了周扬等人的所做所为。\n\n毛泽东对这场批判也早就掌握，在胡风上书中央《30万言书》之后，1954年12月10日《人民日报》发表了周扬的文章“我们必须战斗”，对胡风提出的建议和批评进行了反驳，该文就经过了毛泽东的修改。尽管文章言辞激烈，在定性上也仅仅把胡风从“同志”改为了“先生”，并没有否认“胡风先生”在文艺事业上的劳绩，其批判依然限于思想方面，或者说还是按照人民内部矛盾来处理的。\n\n1955年5月13日《人民日报》发表了关于胡风反革命集团的材料，问题的定性陡然发生变化。《人民日报》发表的胡风反革命集团的材料和按语都经毛泽东亲自过手，其中的编者按和许多按语为毛泽东亲笔所写，其篇幅之长在毛泽东抗战后的文章中少见。在毛泽东亲笔将原稿中的胡风反党小集团改定为反革命集团的时候，胡风的命运实际上便已经决定了，这一天是1955年5月11日。\n\n为了制造一个胡风两面派的形象，5月13日的《人民日报》同时也发表了胡风的“我的自我批判”一文，然而，却选用了未完善的中间稿，对胡风尤其不利。当天，周恩来接到胡风的电话，说《人民日报》发表的“我的自我批判”，是第二稿而不是定稿的第三稿，“这里面肯定有鬼！”惊恐不安的胡风请求周恩来出面过问此事。周恩来随即打电话给周扬和《人民日报》负责人邓拓，核实清楚后，指示《人民日报》既然搞错了，要发篇检讨。奇怪的是，作为政务院总理直接下属的文化部长周扬却绕过总理，直接去请示毛泽东主席如何处置。毛泽东告诉周扬：甚么二稿三稿，胡风都成反革命了，……胡风是要逮捕的。\n\n从毛泽东5月11日批示到5月13日人民日报公开发表，周恩来对胡风即将被逮捕的“机密”似乎不知情。否则，他下那个要《人民日报》检讨的指示有什么必要呢？不过，历来以机敏著称的周恩来，对胡风问题彻底逆转一无所知似乎也不太可能。退一步讲，即便周恩来过去不知情，那么在给周扬打电话的时候，他也应该询问一下人民日报为何如此定性。周恩来在胡风已经被宣布为敌人的情况下，还要求人民日报澄清事实公开做检查，实在非同寻常。后来，在“胡风分子”二号人物阿垄的问题上，周恩来再次提出反证——此人是中共地下情报人员，而不是反共分子。当然，周恩来的话对阿垄没有起到任何作用，他还是庾死狱中。\n\n众所周知，毛泽东一贯重视思想宣传、重视意识形态的作用，立国后不久，毛泽东就先后亲自发动了对电影《武训传》的批判、对《红楼梦研究》的批判，以及对胡适思想的批判，但基本上限定在思想斗争的范围内，没有对具体当事人做政治处理，更没有当作罪犯看待。此后，还有过梁漱溟当众让毛泽东难堪的事情，而这个一向否认阶级斗争、货真价实的反革命，也不过仅仅遭到一顿痛骂而已，依然享受着很高的待遇。毛泽东为什么偏偏苛求胡风这样一个把他当作上帝一般尊崇的书生？想想看，日理万机的毛泽东为了这几个不足挂齿的书生耗费了多少心血，针对胡风问题写下的各类文章，仅收入《建国以来毛泽东文稿》的就有23篇之多。\n\n潘汉年除了掌握许多核心机密外，更熟知中共秘密通讯的规律和方法，如果他是内奸，对中共的破坏作用可想而知。仅仅凭这一点，把潘汉年说成是内奸就无法想象。同样，对于胡风的反革命集团的定性，在事实和逻辑上更是有太多违背常识的地方。两个案件罪证之薄弱与罪名之大甚不相符，明显有小题大作、借题发挥之嫌。\n\n1962年9月24日，中共八届十中全会召开，毛泽东出人意料地提出“千万不要忘记阶级斗争”的号召，中国的政治形势从此日趋严峻，直至最终文革爆发。然而，七年前被捕的潘汉年却在1963年1月经最高法院开庭正式判刑，仅仅一个月后，就被假释出狱，与妻子在农场团圆。同样七年前被捕的胡风，于1965年11月经北京市高院宣判、一个月后，也被假释出狱，全家团聚过了一个春节。其实，如果胡风积极和法院配合，也应该在1963年假释出狱。\n\n潘汉年案件和胡风案件看似是两个风马牛不相及的案件，然而，仔细对比，却可以发现他们有着许多的巧合与相似之处。首先，这两个案件都是毛泽东亲自操刀的钦案，两人被捕时间相近，长期关押不做审判的经历相似，实质性处理的结果也相近。此外，潘汉年、胡风还恰巧都和周恩来关系密切，周恩来对两个案子也恰巧都表示了怀疑并提供了反证。\n\n来源：共识网\n作者：余不洁\n#潘汉年 #胡风 #周恩来 #毛泽东",
			"added": 1535705842
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}