{
	"title": "TimmoZeroBlog",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1541262229,
	"post": [
		{
			"post_id": 3,
			"title": "The Forging of New Hope",
			"date_published": 1541257858.932,
			"body": "![](https://resizing.flixster.com/ZWyOHsvn3q86YSXtthrNN7g9m7w=/300x300/v1.bjsxNjcwODA2O2o7MTc4ODQ7MTIwMDs2NDI7ODU2)\"The time has come\" the Walrus said. To speak of many things. Of Sailing ships, Candle wax, Cabbages and Kings....\n\nSo just as I suspected the Silencing of the Lambs has begun. First through removal / blocking of accounts on Twitter, Facebook, YouTube etc.. and quickly the attacks began on the wider internet based services, such as GAB. The assault on GAB was unprecedented and executed so quickly. Domain registrar, hosting providers, ISP's all coordinated together to hit the KILL switch on GAB.\n\nA lesson to us all, and perhaps a catalyst for ZeroNet. Anyone of the services that closed GAB out from the internet would have been enough to bring any site down, and yet none, and indeed not even all of those efforts could have effected ZeroNet in the slightest. No DNS, Hosting, Fixed ISP connection.\n\nThat what is so exciting about ZeroNet it's everywhere and nowhere all at the same time, protected by redundancy, anonymous, like an apparition, ghostly and intangible and yet still visible to those with eyes to see.\n\n## The Third Reich\n\nWestern governments are in a quandary, their short sighted policies have already sown the seeds of their demise. Now history repeats itself. Many EU member states are enacting policies not seen since the days of the Third Reich in Germany. The division across communities is entrenched and the tension is mounting. The resentment and hatred building on both sides. The left liberal agenda, is nothing but the new face of Facism. How interesting that Winston Churchill said just after World War II that the new face of Facism would come in the disguise of Liberalism.\n\nSilencing has begun with the views of the right, but quickly it will extend to reach even those with centre right conservative points of view. All the while the the chasm between left and right in society widens.\n\n## Jihad and the Black Banners\n\nWhilst left and right divide and broach formation in preparedness for battle, silently the hidden warriors of Islam continue to prepare. You see; for many Muslims they believe that they are already at War with the west. They know it as the prophecy of the Black Banners. Muslims believe that the flags of ISIS marching throughout the middle east is a clear sign that they are in the \"End Times\" and that what stands before them is the final \"Jihad\".\n\nOur insensitivity, and ignorance in the west, only seeks to make the situation worse, because throughout our media we liberally sprinkle the terms \"Jihad\", \"Jihadi\", \"Jihadist\". Confirming to the Muslim community that yes you are in a \"Holy War\" with the West.\n\n## The War on Terror\n\nThe War on Terror has failed, in fact it would of been better named \"Bring the Reign of Terror\". Soon those on the right will let their frustrations get the better of them. With no voice and no outlet, and the un-appointed internet police ( Twitter, Facebook, et al ) silencing their voices, removing their channels and breaking their connections. The Right will gather, and sadly, they will act independently, bringing attacks and terror, and these will be met by attacks and terror from the left, and of course from the Islamic community too.\n\n## ZeroNet a new hope\n\nMy hope is that instead, the groups being censored, closed down and closed out will find ZeroNet, and gather again into a larger community. They will communicate, blog, vlog, chat, status update and will unite to become one again.\n\nThrough ZeroNet they will collaborate, coordinate and together they will forge the political will, and political strength to re-take their nations, and bring back our true democracy.\n\nPerhaps better still they will bring about a true meritocracy. A community of the people, who act in good faith and honour for the people. That are judged on their deeds and words combined. A community of political leaders that are lifted by their communities, rather than corporations. A new breed of leader, who understands the value of contribution, and charity. Leaders who understand that all people across the world are equal. Leaders with enough intelligence to realise that communities need a \"Hand Up\" and not a \"Hand Out\". Who understand that immigration destroys the migrating communities, to provide exploitable resources for the receiving community. A methodology which brings tragedy to both sides, and only benefits the elite few.\n\nWe are in such desperate need of a new, uncensored, truly free and open platform, upon which we can forge a new world, and a better future.\n\nJust like the story of King Arthur and Sword in the Stone. ZeroNet is an Anvil, upon which the people might forge the mightiest of swords...\n\nLet us hope, and pray they find it."
		},
		{
			"post_id": 2,
			"title": "Exploring Anonymity",
			"date_published": 1535488306.825,
			"body": "<img src=\"./img/knights-templar-praying.jpg\" style=\"float: left; margin-right: 10px;\">This is the beginning of a new chapter in my life. One in which I must don mask and cloak to become another member of the many, known only by the few. Anonymous they call it, I am unsure whether I feel good or bad about this new persona of deceit. But, I know one thing for certain....\n\nBritain has changed! A wave a social tension has taken hold, and within it the pressure is building rapidly. Our government is complicit in its deception and treason.\n\nImmigration is out of control, multiculturalism has failed, diversity and tolerance is being used as placebo, to placate the masses. Our government tells us that immigration is good, that we need workers to pay taxes and that they bring value to our communities, but is that really true ?\n\nWhen one asks the question why would parliament sanction years of explosive growth in immigration ? I come up with some interesting answers....\n\n**1 - We need workers taxes:**\n\nWell if that is true, who is paying for the domestic population who can work, but don't. Lets say a conservative welfare cost for an individual is £250 per week. An immigrants weekly salary taxed at 20% would need to £1,250.00 or £65,000 per year. Thus we would need at least 4 migrant workers to provide the taxation to support the one person that could have done the job in the first place.\n\n**2 - They bring value to our community:**\n\nI don't buy it; By allowing the existing population to not work, and replacing them with immigrants, it devalues our social and community values. Further more the current crop of migrants are predominately Asian, or African with enormous cultural and religious differences. They come to improve their lot, but they have no intention of integration. In every city across our lands we see Islamic migrant communities terraforming areas to their cultural and religious way of life.\n\nThere is rapid growth in the development of \"Gated Communities\" in our cities. Many already built and operating in London, and the trend is set to continue. The wealthy and privileged living within secured and guarded enclaves.\n\nGovernment will have already been briefed about the direction our society is headed over a decade ago. GCHQ in Cheltenham has more than enough data analysts and social scientists to alert that government that we are on course for huge civil unrest in our major population centres. A situation that could easily escalate into a full blown civil war, and yet they do nothing, they say nothing.\n\nOur the leaders of our country so foolish, and disconnected from society that they know nothing of what is lurking, awaiting to explode into chaos. Are they so weak and cowardly that not one of them will speak to these issues in our society ?\n\nI do not believe so, something else is at work, some creeping deception. A wider more insidious agenda. I believe money, coercion is at work within the echelons of power.\n\nAll this means that a new resistance must be created, and built in secret, in the darkness. It must be anonymous, everywhere and yet nowhere primed, planned, ready, waiting and working in the background.\n\nWe are _Anonymous_. We are Legion. We do not forgive. We do not forget. Expect us."
		}
	]
}