{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "Dragon Ball Z - Episodio 082 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591721642_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591721721
			},
			{
				"comment_id": 2,
				"body": "Dragon Ball Z - Episodio 083 Dub mkv\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591722031_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591722143
			},
			{
				"comment_id": 3,
				"body": "Dragon Ball Z - Episodio 084 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591754182_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591754283
			},
			{
				"comment_id": 4,
				"body": "Naruto Classico 62 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591761708_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591761759
			},
			{
				"comment_id": 5,
				"body": "Dragon Ball Z - Episodio 085 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591844786_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591844878
			},
			{
				"comment_id": 6,
				"body": "Dragon Ball Z - Episodio 086 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591845125_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591845195
			},
			{
				"comment_id": 7,
				"body": "Dragon Ball Z - Episodio 087 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591853866_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591853932
			},
			{
				"comment_id": 11,
				"body": "Dragon Ball Z - Episodio 088 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591942885_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1591945844
			},
			{
				"comment_id": 13,
				"body": "Dragon Ball Z - Episodio 090 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592000024_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF",
				"added": 1592000116
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 8,
				"body": "17 - 007 - Permissão para Matar 1989 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591827931_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: James Bond desobedece ordens e parte em uma missão para vingar a morte da mulher de seu melhor amigo, assassinada por um chefão das drogas. Ele chega à base sul-americana do narcotraficante e, disfarçado de pistoleiro, é contratado pelo criminoso.",
				"added": 1591857289
			},
			{
				"comment_id": 9,
				"body": "MIB Homens De Preto 3 2012 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591857309_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\n\nSinopse: O terrível Boris, o Animal (Jemaine Clement) foi capturado no passado pelo agente K (Tommy Lee Jones) e na época perdeu o seu braço. Vivendo na prisão lunar de segurança máxima, o alienígena consegue bolar um plano de fuga para dar andamento ao seu objetivo de recuperar o membro de seu corpo e ainda acabar com K de uma vez por todas. Para isso, ele pretende viajar no tempo e mudar o rumo da história. Para evitar que ele triunfe em seu plano maligno, o agente J (Will Smith) também volta ao passado e lá encontrará os jovens agentes K (Josh Brolin) e O (Alice Eve), descobrindo segredos que mudarão sua vida e a amizade de ambos.",
				"added": 1591857557
			},
			{
				"comment_id": 10,
				"body": "A Lista de Schindler 1993 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591872533_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: A inusitada história de Oskar Schindler, um sujeito oportunista, sedutor, armador, simpático, comerciante no mercado negro, mas, acima de tudo, um homem que se relacionava muito bem com o regime nazista, tanto que era membro do próprio Partido Nazista (o que não o impediu de ser preso algumas vezes, mas sempre o libertavam rapidamente, em razão dos seus contatos). No entanto, apesar dos seus defeitos, ele amava o ser humano e assim fez o impossível, a ponto de perder a sua fortuna, mas conseguir salvar mais de mil judeus dos campos de concentração.",
				"added": 1591872762
			},
			{
				"comment_id": 12,
				"body": "Batman - O Retorno 1992 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1591965658_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: Com o objetivo de manipular Gotham City, um milionário tenta transformar o Pinguim, um ser deformado que tinha sido abandonado ainda bebê nos esgotos, em prefeito da cidade. Como se isto não bastasse, surge a Mulher-Gato que, apesar de ser linda e sedutora, também tem dupla personalidade, em razão de problemas no passado. Ambos se tornam verdadeiros pesadelos para Batman no presente.",
				"added": 1591965927
			},
			{
				"comment_id": 14,
				"body": "Coração Valente 1995 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1562678072_17t9TDGPax5zh4H5DPnnLUJq6BmkUYU7oe\n\nSinopse: No século XIII, soldados ingleses matam a mulher do escocês William Wallace (Mel Gibson), bem na sua noite de núpcias. Para vingar a amada, ele resolve liderar seu povo em uma luta contra o cruel Rei inglês Edward I (Patrick McGoohan). Com a ajuda de Robert e Bruce, ele vai deflagrar uma violenta batalha com o objetivo de libertar a Escócia de uma vez por todas.",
				"added": 1592095815
			},
			{
				"comment_id": 15,
				"body": "Garota Veneno 2002 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592134438_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: Jessica (Rachel McAdams) é uma garota extremamente popular, bonita e também cruel, que se acha superior a todas as pessoas com as quais convive. Sua vida muda drasticamente quando, repentinamente, acorda no corpo de Clive (Rob Schneider), um frentista que tem em torno de 30 anos e é considerado por todos como sendo um grande perdedor. Desesperada para retornar à antiga forma, agora ocupada por Clive, ambos passam por estranhas situações no novo visual que agora possuem.",
				"added": 1592134770
			},
			{
				"comment_id": 16,
				"body": "Once Upon A Time In The West (Era uma Vez no Oeste) 1968 Leg\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592188179_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: Em virtude das terras que possuía serem futuramente a rota da estrada de ferro, um pai e todos os filhos são brutalmente assassinados por um matador profissional. Entretanto, ninguém sabia que ele, viúvo há seis anos, tinha se casado com um prostituta de Nova Orleans, que passa ser a dona do local e recebe a proteção de um hábil atirador, que tem contas a ajustar com o frio matador.",
				"added": 1592188729
			},
			{
				"comment_id": 17,
				"body": "Vingadores - Era de Ultron (Avengers Age of Ultron) 2015 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592196242_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: Ao tentar proteger o planeta de ameaças, Tony Stark constrói um sistema de inteligência artificial que cuidaria da paz mundial. O projeto acaba dando errado e gera o nascimento do Ultron. Com o destino da Terra em jogo, os Vingadores terão que se unir para mais uma vez salvar a raça humana da extinção.",
				"added": 1592196569
			},
			{
				"comment_id": 18,
				"body": "Timecop O Guardião do Tempo 1994 Dublagem Clássica Álamo\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592289345_15wPpwW2SczE2GzwMfw36b93VZsB15jLUF\n\nSinopse: Quando a viagem no tempo é aperfeiçoada e pode ser utilizada com segurança, os criminosos se aproveitam dessa tecnologia para cometerem novos delitos. Um novo tipo de policiamento é criado para garantir que a invenção não seja usada de maneira abusiva. O policial Max Walker (Jean-Claude Van Damme), que trabalha nessa divisão, descobre que o político corrupto McComb (Ron Silver) quer usar a viagem no tempo para se tornar presidente. A perseguição começa quando o senador descobre que o policial esta em seu encalço para desmascara-lo. Depois que sua esposa morre em mais uma tentativa de aniquilar Max, este tenta reverter toda a situação, voltando no tempo antes do ocorrido.",
				"added": 1592290170
			}
		]
	},
	"comment_vote": {}
}