{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "I do not know what purpose to write this article, I do not know why I would have such a wonderful idea. I hope that human civilization can be further peaceful reunification. I do not want the world's civilization to be separated by the invisible flag of the nation.\nIn the ancient mythology of human civilization should come from an ancestor. Perhaps from the biological point of view the answer has clearly pointed out that human beings are derived from the same branch. People who divide each plate on the Earth's continent should be united together. That moment is very important, that moment will go beyond the history of the entire human civilization past.\nI have been depicted in the brain when China's Shanghai goods are blocked in the absence of borders to Paris, France, when the Chinese Beijing goods in the absence of national lines to block the transport to Africa's farthest Cape of Good Hope. I have also painted in the brain, scientists in the human capital efforts to create a more brilliant future. Human civilization is waiting for a revival, human civilization is waiting for a new beginning.\nPerhaps to create a unified human civilization is so Jiaoren feel powerless. But I believe that there will always be a leader in the future will lead the unity of human civilization. Maybe at that time some people will ask the community in the end is the name of the community? Or surname? Maybe I will give the answer is a hundred schools of thought contend. A completely unified earth civilization, and not because of its ability to destroy the world of hundreds of contending thoughts. The world can not because of the gap between rich and poor caused by the separation of the class between mankind, I have thought that great companies are always listed, and I also think of how to make a person can not be completely arbitrary. I admire Bill Gates led the rich naked donation action, I hope the future of more outstanding entrepreneurs and scientists to make such an example.\nThe reason why human civilization is contradictory from the right and benefit of the problem. Power should be checked and balanced, and interests should be shared. The separation of the three powers, the people impeachment, the property is transparent to the future of the public servants of the people do. Listed dividends, power constraints, appropriate donation This is my entrepreneur on human wealth executives given the answer. Great leaders and great entrepreneurs can not avoid the dark side of the human heart, we give institutional constraints to make them more successful.\nI believe that there will be a national leader in the future that the idea of ​​reunification, as the Chinese government must be from the rule of the rule of law, to the process of relative democracy. This is the only way for the Chinese government. Socialism has been slowly no longer in line with the Chinese people, but the socialist aspirations will be firmly rooted in some of the human mind. The future of mankind will be more brilliant, I believe that time the human society will liberate human hands. So that human transition from physical labor to mental work. The pain that man has experienced in the past is paving the way for the future glory.\nWe will die, but the future of human civilization will be big step forward. The great leader will go beyond countless times, and all the strong in his own age will be bleak because of his presence. Like the history of East Asian civilization I am afraid you I remember most of the first emperor. Other historical process among the emperor we will have much attention? This is my warning to this era leader. In history you are probably a pass. New world gate will come! But also need the cooperation of the existing government, we will eventually become history, but history is also created by us. The word \"enlightenment\" is the beginning of the new world",
			"post_id": 21,
			"date_added": 1489055814
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}