{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Что делает mute?",
			"body": "Народ, а когда я делаю mute на всяческих извращенцев, перестаю ли я участвовать в раздаче их сообщений или это только хайдит у меня в локальной базе? Кто знает?\n\nP.S.\nЕсли кто-то не знает, mute можно сделать на ресурсе, его поддерживающем, либо прямо на zeroid (поиск -> mute user).",
			"added": 1512486172
		}
	],
	"topic_vote": {
		"1_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX": 1
	},
	"next_comment_id": 10,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Зашел посмотреть на зеронет. Прикольная штука!",
				"added": 1512142192
			}
		],
		"1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S": [
			{
				"comment_id": 2,
				"body": "@difrex, знакомые все лица =) Может и правда, сделать гейт? Но все руки не доходят.",
				"added": 1512486025
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "Кто здесь?\nВообще, после большого перерыва заглянул и рад, что жизнь таки теплится. ZeroNet очень интересная штука, но только проблема отсутствия тут людей не техническая, проблема в головах. Людям нравится зависимость от коммерческих соц-сетей. С этим ничего не поделаешь... Но надежды на оазис в виде зеронаета у меня еще не рухнули. =)",
				"added": 1534255022
			},
			{
				"comment_id": 4,
				"body": "> [ztmscr](#comment_1_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): Он мне так понравился, что сижу тут почти целыми днями иногда)\n\nРесурсы надо создавать. Хотя сам этого не делаю. :)",
				"added": 1534256075
			},
			{
				"comment_id": 5,
				"body": "> [ztmscr](#comment_2_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): Были идеи что то создать?\n\nНу в том то и дело, что то что у меня создано -- нормально существует и в обычном интернете. Думал создать зайт со своими игрушками и, может быть, блог... Но... :) В общем, не знаю...\n\nА так, вот чем занимаюсь:\nhttps://dtf.ru/indie/24627-moy-indi-proekt-dlinoy-v-10-let\nhttps://dtf.ru/indie/24598-parsernaya-igra-drugoy-mars\nhttps://instead-hub.github.io/\n\nФиг знает, какому проценту от процента тут это было бы интересно. Наверное, почти никому. :) Хотя это пример полностью некоммерческого творчества, за которое я болею.",
				"added": 1534256545
			},
			{
				"comment_id": 6,
				"body": "> [ztmscr](#comment_3_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): интересные ссылки) сегодня почитаю, заинтересовало) Попробовал бы ради експеримента зайт со своими играми) думаю тут зайдет..\n\nА я думал про инстед уже все линуксоиды знают. Вообще, может быть даже просто копирование материлов \"извне\" -- уже хоть что то. Но все-же кажется, что эксклюзив -- это более верный путь. Надо подумать...",
				"added": 1534257196
			},
			{
				"comment_id": 7,
				"body": "P.S. еще я думаю наличие мобильного клиента было бы плюсом. Но, учитывая специфику архитектуры, наверное мобильный клиент это утопично :)",
				"added": 1534257247
			},
			{
				"comment_id": 8,
				"body": "> [ztmscr](#comment_4_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): ну я пробовал на андроиде клиент, вроде пашет) а по какому принципу работает он, я не узнавал)\n\nНу трафик же =)",
				"added": 1534257413
			},
			{
				"comment_id": 9,
				"body": "> [ztmscr](#comment_5_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): стремно на телефоне просто, флеш память полетит наверное быстро)\n\nНе придумал ничего лучше, чем создать ещё один блог. :)\n\nhttp://127.0.0.1:43110/1HVhvrompfwLstJExofKAQ5mMss7YivVDj/",
				"added": 1534275502
			}
		]
	},
	"comment_vote": {}
}