{
	"next_topic_id": 80,
	"topic": [
		{
			"topic_id": 1547274290,
			"title": "网管办《网评员内部资料(严禁外泄)》",
			"body": "网管办《网评员内部资料(严禁外泄)》\n网络舆论战争关系到中华人民共和国国家政权的生死存亡。为了祖国母亲的繁荣富强，为了中华民族的复兴，每一个网络评论员必须时刻准备着用自己的智慧和艰苦劳动保卫共和国网络防线。 基本工作方法∶ 1、在工作时间内必须每小时至少查看一次工作邮箱，时刻注意领会上级指示的最新精神。 2、网络评论员根据上级指示进行合作，根据工作需要，将由跨地区、跨专业的网络评论员组成工作小组，执行特定的任务。在有必要增加人员时，上级将从其他小组抽调人员加以充实。 3、基本工作方法：日常工作按照网站分小组，每个重要网站的有关论坛由一个小组负责。日常工作是按照总体方针，维护正确的网络舆论导向。遇到突发事件，则按照上级部门的专门工作组的指令行事，暂时停止日常工作，把有关人员资源投入到突发事件的舆论导向工作。 4、网络评论员要善于隐瞒自己的真实身份，必需有多个不同的网名，而且不同的网名要发表不同风格的文章。必要的时候，可以由不同小组成员制造网友辩论的假象，然后由第三方推出强有力的证据， 把公众舆论引导到第三方。 5、某些网络谣言出来的时候，必须尽快搜索到谣言的首发地点和首发人，然后勒令网站管理员删除原贴，网络评论员则拷贝内容，以不同的IP地址发表自己就是事发所在地的当地人的申明，然后由版主或以其他网友身份指出：他的IP地址不在事发所在地，该消息纯属谣传。 6、必要时可以制造更加耸人听闻的假新闻，吸引网民视线，然后很快澄清该消息纯属谣言。 7、某些论坛人气不错，网友信用度比较高，这时首先要做的是制造一种混乱，通过似是而非的文章进行干涉，跟贴作非理性的故意曲解、制造误会和争辩，转移网民注意力。 8、海外网站较难控制，当不能主导论坛舆论的时候，可以采用大量短贴、无实质内容贴、非理性贴进行刷屏，令版面充斥无意义的混乱，使读者失去兴趣，这样达到避免反动思想流通传播的目的。 9、不断学习，提高文字水平，学会使用不同的文笔风格写作，善于模仿他人文笔，这是网络评论员的基本功。 10、学会与网友交流的技巧，与网友私下打成一片，获取网友的信任，尤其是那些文章有影响力的网友。如果有可能，争取一些重要论坛的版主位置。 11、培养高超的判断力，能够在诸多贴子中迅速找到真正有影响力的帖子和写手，作为重点工作对象。 12、注意培养政策法规意识，不可误解当前的工作精神。注意吃透上级指示的近期发贴类型实例，融会贯通，举一反三。 13、灵活性与原则性相结合。一定要制造真假难辨的形象，成为一个不容易被鉴别身份的人。不仅要熟悉我们的观点，更要熟悉对方的思路，知己知彼。 14、网络评论员要时刻牢记自己的光荣任务，不被困难和误解阻挡，不在乎表面上的面子，做到任何情况下不会真正被对方激怒，永远保持理性、冷静的心理。 15、网络评论员要立场坚定，头脑清醒，在各种富有迷惑力的思潮面前保持清醒的头脑，珍惜自己的政治前途。 16、网络评论员实行小组监督和纠察监督相结合的原则。其工作成绩由上级有关部门评定。\n\n中国共产党网络评论员舆论引导工作技巧:\n第一，兵来将挡水来土掩。示例:A：这鸡蛋真难吃。 B：隔壁家的鸡蛋更难吃，你咋不说呢？ A：这鸡蛋真难吃。 B：请拿出建设性的意见来，有本事你下个好吃的。 A：这鸡蛋真难吃。 B：下蛋的是一只勤劳勇敢善良正直的鸡，你还有没有良心？！ A：这鸡蛋真难吃。 B：比以前已经进步很多了。 A：这鸡蛋真难吃。 B：你这么说是什么居心什么目的？ A：这鸡蛋真难吃。 B：隔壁的鸡给了你多少钱让你在这里满嘴乱喷? A：这鸡蛋真难吃。 B：再难吃也是自己家的鸡下的蛋，凭这个就不能说难吃。 A：这鸡蛋真难吃。 B：隔壁家的鸡蛋是伪蛋。 A：这鸡蛋真难吃。 B：没有毛场长，你连这鸡蛋都吃不上 A：这鸡蛋真难吃。 B：要对咱们家的鸡有耐心，它一定会下出更好吃的蛋。 A：这鸡蛋真难吃。 B：隔壁家也吃过这样的鸡蛋，现在是初级阶段。 A：这鸡蛋真难吃。 B：很多家都是因为吃了隔壁的鸡蛋而导致家庭成员冲突、生活水平下降而最终解体的。 A：这鸡蛋真难吃。 B：其实，隔壁家的鸡蛋也一样，天下乌鸦一般黑，世上根本没有好吃的鸡蛋 A：这鸡蛋真难吃。 B：我怀疑你是轮子。 A：这鸡蛋真难吃 B：鸡蛋好不好吃，全体蛋鸡最有发言权 A：这鸡蛋真难吃 B：你丫是脑残",
			"added": 1547274289,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1560257686,
			"title": "如果香港起義有部隊、坦克介入，香港民衆不妨請雇傭軍",
			"body": "如果香港起義有部隊、坦克介入，香港民衆不妨請雇傭軍，同時借助國際力量（經濟，軍事，輿論等）反抗獨裁，以人民的軍隊的名義勸説解放軍倒戈，相信在大勢所趨下軍隊的官兵會不堪一擊，倒戈相嚮，由此革命火種點亮，星星之火可以燎原！",
			"added": 1560257684,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1560335664,
			"title": "转至香港：刚刚江苏地区军用直升机有异动！",
			"body": "敢对香港动武必将死无葬身之地！",
			"added": 1560335661,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1564748526,
			"title": "!!!An emergency declaration of martial law in Hong Kong is expected on August 4th 2019 !",
			"body": "https://www.youtube.com/watch?v=OjrOGbsFPlE\n\n8月4號 即將對香港戒嚴的緊急通告\nAn emergency declaration of martial law in Hong Kong is expected on August 4th\n\n一．共產黨：將在8月4號宣佈根據解放軍駐港法．國家安全法．由香港政府申請·駐港部隊對香港戒嚴。\n1. The communist party: will announce on August 4th that based upon the PLA Garrison Law and National security laws, the Hong Kong government has requested martial law be enforced by the PLA army stationed in Hong Kong.\n \n二．戒嚴條例將規定．對香港．社會治安．人員進出由戒嚴指揮部統一指揮。\n2.  The safety of Hong Kong, public order. and the entry and exit of personnel shall all be under the unified direction of the martial law command.\n \n三．戒嚴指揮部將對香港的人員進出大規模限制，基本上是只許出不許進，並將定向清理美國和歐洲國家在香港的駐港機構及持有美英護照的外籍人士。\n3. The martial law command will impose massive restrictions on the movement of people in and out of Hong Kong, essentially barring them from entering but allowing them to leave the territory freely. They will also clean up U.S. and European institutions based in Hong Kong and foreigners with U.S. and British passports.\n \n四．駐港部隊實施戒嚴的同時，香港警察將對6月九日以來的和平抗議的人士進行大抓捕……\n4. The Hong Kong police will make many arrests associated with the peaceful protests which have occurred since June 9, as troops stationed in HongKong impose martial law.",
			"added": 1564748522
		},
		{
			"topic_id": 1565446418,
			"title": "red liberty",
			"body": "/1CoVgJCDb588bVtxU9VAwGLGuybzdr3mfg/",
			"added": 1565446413
		},
		{
			"topic_id": 1565601555,
			"title": "Beijing’s new weapon to muffle Hong Kong protests: fake news China’s media used to ignore the turmoil. Now the state is waging a campaign that could pave the way for intervention",
			"body": "https://www.theguardian.com/world/2019/aug/11/hong-kong-china-unrest-beijing-media-response\n\nBeijing’s new weapon to muffle Hong Kong protests: fake news\nChina’s media used to ignore the turmoil. Now the state is waging a campaign that could pave the way for intervention\n\nLily Kuo\n\nSun 11 Aug 2019 10.00 BST\nLast modified on Mon 12 Aug 2019 03.40 BST\n\nA protester at Hong Kong airport on Friday. Beijing-controlled media portray the campaigners as ‘thugs’ and ‘radicals’.\nA protester at Hong Kong airport on Friday. Beijing-controlled media portrays the campaigners as ‘thugs’ and ‘radicals’. \nAs Hong Kong enters its third month of mass anti-government protests, across the border in China, people are seeing a very different version of events.\n\nOn Saturday, as protests entered their tenth weekend and demonstrators and police clashed in Hong Kong, the People’s Daily posted an article on the Chinese WeChat webchat service saying members from “all parts of Hong Kong society” were calling for the “violence to stop”. As peaceful rallies at the Hong Kong airport continued over the weekend, Chinese state media posted videos on Weibo of a tussle between demonstrators and an angry resident yelling: “We just want Hong Kong to be safe”.\n\nOther special reports include letters between the Chinese and Hong Kong police applauding “the great bravery” of the Hong Kong police – a main target of the protests. Last week, a journalist with state news agency Xinhua travelled to Hong Kong and described the city as “shrouded in black terror”.\n\nOver the past two months, Chinese state media outlets have gone from near silence on the protests and blanket censorship of footage of the demonstrations to actively pushing news, editorials, videos and online discussions.\n\n“On the topic of Hong Kong, the mainland media can’t be seen as journalism. It’s purely propaganda… It is intercepting a small part of the information, distorting it and magnifying it,” said Fang Kecheng, a professor at Chinese University of Hong Kong, specialising in communications.\n\nIn Chinese state media the demonstrations, most of which have been peaceful, are routinely described as “riots”. Daily coverage show footage of protesters hurling bricks, jeering at police, and surrounding police stations. The protesters are described as “radicals” and “thugs” seeking to topple the entire system through independence for the city, a former British colony now under Chinese sovereignty.\nChinese riot police\nFacebook\nTwitter\nPinterest\n\nFew protesters have been pushing for independence – their demands have included the permanent withdrawal of a controversial extradition bill and an independent investigation into police behaviour.\n\nTaking a page from the protesters’ book, the People’s Daily published a range of posters, one featuring muscular riot police facing off against brick-throwing rioters. “It’s hard to say whether it is right or not to hit them,” the posters declare. “I only hate that they are also Chinese people.”\n\nProtesters are also portrayed as “lured by the evil winds” of foreign agents. Chinese officials have accused the US and other western countries of being the “black hand” behind the protests – a narrative that pro-government figures and media in Hong Kong have also seized on.\n\nObservers see the shift as a way to prepare the public for more drastic action Beijing or the Hong Kong government may take toward the protesters as well as a chance to push China’s view of events.\n\n“The propaganda authorities perhaps realised this could be an opportunity,” said Fang. “There is not much to say when the marches are peaceful. But now with these violent incidents, the authorities can exaggerate them and stir Chinese people’s emotions. They can play into nationalist sentiment.”\n\nThat appears to be working. A discussion topic on Weibo hosted by the People’s Daily – titled “Protect Hong Kong, firmly say no to violence” – has more than 1 million comments, most in support and some calling for more extreme measures. A “protect the national flag” campaign on Weibo has been trending, after protesters in Hong Kong twice threw the Chinese flag into the sea.\n\nMany mainland Chinese believe foreign agents are indeed behind the protests, a claim protesters and observers see as laughable.\n\n“At the end of the day, Hong Kong is still part of China. What they are doing is pointless. The foreign countries pushed and they just followed,” said a student studying overseas in Seoul who asked not to be named.\n\n“I don’t know their motivation is,” he admitted. “The news we receive is biased and only from one perspective.”\n\nFew Chinese residents are clear on why the protests began in the first place. “I don’t know the details,” said Guo, 20, who lives in Beijing. “But I think we should be united and together and we should be patriotic. Only a united country can continue to develop stronger.”\n\nOthers also pointed to a lack of patriotism as the problem. “Maybe it’s the education system. If they were educated to be patriotic from an early age, it wouldn’t be the way it is now,” said Liu, 18, a recent high school graduate from Shandong province.\n\nObservers say Chinese state media have purposefully obscured why the protesters have been demonstrating for the last two months, focusing instead on violent clashes between the protesters and police. Chinese state media have described armed men who have attacked commuters and protesters as “patriots”.\n\n“Left out is reporting on and images of police violence, of which there has been a good deal and the attacks on unarmed protesters by armed thugs,” said Jeffrey Wasserstrom, a historian of modern China at the University of California, Irvine.\n\n“The implication is that what protesters have been doing is creating ‘chaos’ or luan, a very freighted word in the People’s Republic of China,” he said, referring to the term’s usage to describe the upheavals of the Cultural Revolution in the 1960s and 1970s as well as to criticise protests in Tiananmen Square that were violently put down on 4 June 1989.\n\n“This echo is worrying, even if it is always too simplistic to look for history repeating itself step by step in a different context,” he said.\n\nNot everyone subscribes to the official media’s version of events. Images have circulated online of ID cards posted by Chinese netizens in support of the protesters.\n\nA blogger on Weibo, who asked to identify herself only as Z, has been trying to share articles she believes show the real nature of what is happening in Hong Kong. Her posts are often deleted or blocked on Wechat or Weibo. An article she and her friends tried to circulate, with a timeline of events in Hong Kong and answers to questions about the protests, was blocked after receiving more than 100,000 views.\n\n“The main reason why Hong Kong people are against the extradition bill is distrust of the mainland judicial system, so how could they let the 1.4 billion people of China see that?”\n\n“I think all the actions that Hong Kong people took are reasonable and understandable. I feel sad and heartbroken,” she said.\n\nShe added: “As a citizen, it is common to protest against what you think is unreasonable. It’s just that this is not common here on the mainland.”",
			"added": 1565601549
		},
		{
			"topic_id": 1566704216,
			"title": "Call for Official Recognition of the Chinese Communist Party as a Terrorist Organization",
			"body": "In the over 70 years of ruling over China, the Chinese Communist Party has done many horrible things humans can think of. These malicious and evil deeds include but are not limited to: falsifying national history, suppression of freedom of speech and press, money laundering in the scale of trillions, live organ harvesting, sexual harassment and assault to underaged females, slaughtering innocent citizens with counter-revolutionary excuses, etc.\nIn light of the recent violent actions to Hong Kongers by the People's Liberation Army (PLA) disguised as Hong Kong Police Force, we the people petition to officially recognize the Chinese Communist Party as a terrorist organization.\n\nvisit: https://petitions.whitehouse.gov/petition/call-official-recognition-chinese-communist-party-terrorist-organization\nThe White House may send you a email to confirm,please confirm it again!",
			"added": 1566704209
		},
		{
			"topic_id": 1569215330,
			"title": "Sanction Hong Kong Police, August 31, 2019",
			"body": "goal：100,000 Signatures in 30 Days\nThey make use of dirty disguises, gangster, illegal police brutality, sexual assaults and harmful chemical weapon to create social terror and destroy Hong Kong.\nThey are not protect citizen, they are dangerous to citizen.\nhttps://petitions.whitehouse.gov/petition/sanction-hong-kong-police\nAfter you finished the signature,the white house may send you an email to confirmination,please confirm it.",
			"added": 1569215322
		},
		{
			"topic_id": 1569297597,
			"title": "The communist party of China has put forward a new policy called \" three major battles \" that will transform the world order",
			"body": "timeline : 48:28  https://www.youtube.com/watch?v=giO0Ve3ZlLo\n",
			"added": 1569297588
		},
		{
			"topic_id": 1569934923,
			"title": "1/10，2019 p.m. Hongkong police shot at the demonstrators,a minor were shot dead during the shootings!",
			"body": "They used  M10HB 3.8mm pistol shot at a minor,the bullets got him in the heart and head!\nvideos:\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_8ac05a5b88dd7c43edb678220230567f.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_f9af921f62ec4787271e82af3efec79c.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_63d64ecbc71b0682312a54e018f8a643.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_021b78d52c383abe37e27c0c85ba58d3.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_b5c7945e73ee647582d9559fd185af6c.mp4\n\nChinese government CCP has kidnapped its people for 70 years. Many imprisoned. It fears the most is truth-being-spread.\nAll the dictators wantonly engaging in military aggression get bad ends. The confident leaders and countries focus on their people. The PRC70 parade is nothing comparing to Hong Kong protesters. ",
			"added": 1569934913
		},
		{
			"topic_id": 1571110186,
			"title": "Chinese Fund Backed by Hunter Biden Invested in Technology Used to Surveil Muslims",
			"body": "On Wednesday, Human Rights Watch released a troubling report about a phone application made by the Chinese government. The app provides law enforcement with easy, daily access to data detailing the religious activity, blood type, and even the amount of electricity used by ethnic minority Muslims living in the western province of Xinjiang,China.\n\nThe app relies heavily on facial recognition software supplied by Face++, a division of the Chinese startup Megvii, a relationship that sparked questions in the press for Megvii investors. One of the most prominent of these investors is Alibaba Group Holding, which was co-founded by Jack Ma, the wealthiest Chinese billionaire and an icon for the country’s image of entrepreneurship.\n\n    The flurry of media reports about private investment in China’s increasingly sprawling surveillance state left out a prominent investor: Hunter Biden.\n\nThe flurry of media reports this week about Face++, Ma, and the role of the private sector in building China’s increasingly sprawling surveillance state, however, left out another prominent investor in the company: Hunter Biden.\n\nThe son of the former Vice President Joe Biden has spent much of the last decade building overseas investments and business deals, arrangements that could complicate his father’s bid for the presidency by posing an array of potential conflicts of interest.\n\nHunter Biden’s investment company in China, known as Bohai Harvest RST, has pooled money, largely from state-owned venture capital, to buy or invest in a range of industries in the U.S. and China. Bohai Harvest has put money into an automotive firm, mining companies, and technology ventures, such as Didi Chuxing Technology, one of the largest ride-hailing companies in the world after Uber. (Hunter Biden, Bohai Harvest, and Joe Biden’s presidential campaign did not respond to a request for comment.)\n\nIn 2017, Bohai Harvest bought into Face++, part of a $460 million haul in the company’s Series C investment round. Bohai Harvest’s website features Face++ in its portfolio of investments.\n\nBohai Harvest operates and works with a number of funds to make its various investments, a tangled business structure that has brought Hunter Biden into close proximity to influential Chinese government and business figures, according to a review of Chinese business filings by The Intercept.\n\n    Bohai Harvest relies heavily on an international subsidiary of the state-owned Bank of China to finance its investments.\n\nBohai Harvest relies heavily on an international subsidiary of the state-owned Bank of China to finance its investments, referring to itself as an “investment platform under BOC” on its website. The investment fund has also partnered with a subsidiary of HNA Group, a controversial conglomerate that has snapped up investments in a wide range of businesses across the world.\n\nAs The Intercept has previously reported, the HNA Group has made unusually extensive efforts to cultivate U.S. officials. The company floated an offer to buy out the hedge fund owned by former White House official Anthony Scaramucci; retained the legal services of Gary Locke, the former U.S. ambassador to China, shortly before his confirmation; and provided financing to a private-equity firm backed by Jeb Bush. HNA Group, notably, also courted Bill Clinton, touting meetings with the former president at philanthropy events hosted by the company.\n\nThe Bank of China, one of the largest banks in the country, has also made overtures to U.S. political elites. Shortly after the 2016 presidential election, the company added Angela Chao, the sister of Transportation Secretary Elaine Chao and sister-in-law of Senate Majority Leader Mitch McConnell, R-Ky., to its board of directors.\n\nAlong with a number of politically connected Americans, Hunter Biden’s investment vehicle in China came as a result of a series of deals struck over the last 10 years. In 2008, in the closing days of that year’s presidential campaign, Hunter Biden deregistered as a lobbyist from Oldaker, Biden and Belair, a Washington, D.C., firm he co-founded alongside William Oldaker, a longtime fundraiser and legal adviser to Joe Biden.\n\nThe following year, Hunter Biden — along with former Secretary of State John Kerry’s stepson Christopher Heinz; Kerry-Heinz family friend Devon Archer; and former Oldaker partner Eric Schwerin — founded several companies using the name Rosemont Seneca.\n\nIn 2014, the partners began setting up operations in China. The “RS” in Bohai Harvest RST stands for Rosemont Seneca, and the “T” stands for Thornton Group. The latter group is an international consulting firm based in Massachusetts that was founded by James Bulger, the son of the longtime Kerry ally and former Massachusetts state Senate President William Bulger.\n\nThe company, according to the Wall Street Journal, planned to raise $1.5 billion, taking advantage of Shanghai’s free enterprise zone to convert yuan to dollars to be invested in foreign companies. Business registration filings in China list Hunter Biden, Schwerin, and James Bulger as key officials at Bohai Harvest.\n\nLast year, author Peter Schweizer criticized the timing of Bohai Harvest’s launch, claiming that the exclusive deal coincided with negotiations between then-Vice President Joe Biden and the Chinese government.\n\n    Joe Biden has long served as friendly voice for U.S.-China relations, even before his son’s investment ventures.\n\nOn Wednesday, the New York Times raised similar concerns with the involvement of Hunter Biden in Ukrainian energy company, Burisma Holdings, which added the vice president’s son to the company board in 2014. Rosemont Seneca Bohai financial filings, made public through a separate fraud investigation into Archer, revealed that the energy company paid Hunter Biden as much as $50,000 per month at a time when the U.S. was closely involved in Ukraine’s response to Russian aggression in the region.\n\nFor his part, Joe Biden has long served as a friendly voice for U.S.-China relations, even before his son’s investment ventures. The elder Biden helped lead Democratic support to passing permanent national trade relations with China.\n\nIn 2000 remarks in support of the vote, Biden argued that he did not “see the collapse of the American manufacturing economy” as a danger from opening up further trade with China, claiming that an economy “about the size of the Netherlands” could not become “our major economic competitor.” Opening China to further trade, Biden predicted, would create “a path toward ever greater political and economic freedom” for the country’s citizens.\nWait! Before you go on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?\n\nConsider what the world of media would look like without The Intercept. Who would hold party elites accountable to the values they proclaim to have? How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?\n\nThe kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable. The Intercept is an independent nonprofit news outlet. We don’t have ads, so we depend on our members — 35,000 and counting — to help us hold the powerful to account. Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month. That’s all it takes to support the journalism you rely on.\n\nFrom: https://theintercept.com/2019/05/03/biden-son-china-business/",
			"added": 1571110175
		},
		{
			"topic_id": 1571722926,
			"title": "The locations where the CCP to hide the corpses in Hong Kong!",
			"body": "Recently,more than 20K Hong Kong people had been raped and killed by the Communist Party of China .\nThe locations where the CCP to hide the corpses, destroyed the corpses, and transport the dead bodies of these Hong Kong people are in here. (from www.guo.media)\npictures(Chinese only)\nhttps://www.guo.media/photos/91030\nhttps://www.guo.media/photos/91031\ndetail:\nvideo(Chinese and English)\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_a8133858bc045fbfb7b0e30b142cf881.mp4",
			"added": 1571722914
		},
		{
			"topic_id": 1572672000,
			"title": "StandWithHK. HongKongSOS",
			"body": "On 2 November (Sat), global rallies will be held in over 45 cities in 17\ncountries (details below) in support of autonomy for Hong Kong, as promised in the Sino-British Joint Declaration and stated in our Basic Law. On “112” (also an emergency telephone number in parts of the world), we are calling on the world to take action to preserve Hong Kong’s status as an international metropolis, and to make a principled stand against oppression backed by financial might.\nMain page https://www.facebook.com/standwithhk/videos/745073119292216/",
			"added": 1572671986
		},
		{
			"topic_id": 1573186132,
			"title": "More than 100 million people who have died as a result of communist oppression",
			"body": "from https://www.whitehouse.gov/briefings-statements/presidential-message-national-day-victims-communism-2019/\n\nPresidential Message on the National Day for the Victims of Communism, 2019\n\nOn this National Day for the Victims of Communism, we remember the more than 100 million people who have died as a result of communist oppression.  Today, we renew our commitment to helping secure for all people a future of peace and prosperity founded on the core tenets of democracy—liberty, justice, and a deep respect for the value of every human life.\n\nThis year’s National Day for the Victims of Communism coincides with the 30th anniversary of the fall of the Berlin Wall.  On November 9, 1989, determined men and women put President Ronald Reagan’s powerful words into momentous action, tearing down that symbol of totalitarianism and sending a message to the entire world that democracy and the rule of law will always triumph over oppression and tyranny.  As we commemorate this milestone for human rights, we resolve to continue working with our allies and partners to ensure that the flames of freedom keep burning as a beacon of hope and opportunity around the globe.\n\nAs we pause on this day of remembrance to honor victims of communism everywhere, we must resolve always to safeguard the cherished liberties that foster peace and unleash unparalleled prosperity.  Together, we can build a future free from the evils of communism.",
			"added": 1573186117
		},
		{
			"topic_id": 1573356577,
			"title": "South China Sea: Top secret underwater drone tested in disputed waters by Beijing",
			"body": "By Simon Osborne\nPUBLISHED: 12:55, Sat, Nov 9, 2019 | UPDATED: 13:23, Sat, Nov 9, 2019 \n\nBEIJING is stepping up its presence in the South China Sea with he deployment of a long-range underwater drone designed to extend range of its activities in the disputed waters.\nThe Chinese Academy of Sciences said the autonomous underwater vehicle (AUV) - dubbed Sea-Whale 2000 - has completed a non-stop 37-day sea trial covering a distance of 1,250 miles. Its mission path remains top-secret but defence analysts said the drone’s range means it could easily cover the Paracel and Spratly islands – claimed by China but also neighbouring Vietnam, Malaysia, Indonesia, Brunei and the Philippines – and return to base in Sanya, Hainan.",
			"added": 1573356561
		},
		{
			"topic_id": 1573724060,
			"title": "11月12日中大孤岛危机，看中共如何露出狰狞嘴脸！",
			"body": "https://news.guo.media/cn/12398/\n",
			"added": 1573724043,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1573876294,
			"title": "Hong Kong people must evacuate quickly to ensure safety",
			"body": "Hong Kong people must evacuate quickly to ensure safety,The CCP's cyber army begin to work in Hong Kong and China mainland.It is time to keep anonymous and hidden in true world and cyber space!\nWe cannot fight together with Hong Kong people, but we can spread the truth about what happened in Hong Kong to every corner of the world!\nHK Posters https://spark.adobe.com/page/OR31PqMrQP6U8/",
			"added": 1573876276
		},
		{
			"topic_id": 1573908669,
			"title": "Fight for freedom. Stand with Hong Kong",
			"body": "Hong Kong: Police are getting more and more brutal with protesters\n2019.11.16\n\nNovember 16, police shot a sponge grenade at a reporter at a short distance.\n\nAt around 01:21 in Mongkok, an off-air reporter from Commercial Radio Hong Kong (CRHK) saw a police officer having a dispute with a reporter from another broadcast station. The police accused the reporter of assault.\n\nThe Commercial Radio reporter tried to film the scene but was then shot by the police with a sponge grenade. The grenade hit his backpack and he was unharmed.\n\nAccording to another reporter, the police officer shot the Commercial Radio reporter within 5 meters.\n\nAt around 02:46 in Nathan Road, Mongkok, police demand the press to step back by citing the risk of Molotov cocktails. Reporters indicate that there are only police at the scene.\n\nPolice even shout, “Reporters are rioters!” and order the press not to “cause any trouble”.\n\nIn the end, police arrest at least two people and suddenly toss a hand-throw tear gas grenade.\n\nSource: https://www.facebook.com/pg/standnewshk/posts/?ref=page_internal&msite_tab_async=1#!/story.php?story_fbid=2622458227839781&id=710476795704610",
			"added": 1573908650
		},
		{
			"topic_id": 1573917795,
			"title": "This bookstore may help Hong Kong people",
			"body": "http://b2fxrnttdue72ntq.onion/\nWHEN TYRANNY BECOMES LAW, RESISTANCE BECOMES DUTY\nCCP insidiously causing chaos in Hong Kong to justify military intervention.\nThe CCP's special army was in Hong Kong!\n\nIf you love freedom, please spread these ebooks to Hong Kong and other people who need it!\nIf you have useful resources, please paste them, you can use \"OnionShare\" to share it!\nThx !",
			"added": 1573917775
		},
		{
			"topic_id": 1573960157,
			"title": "Hong Kong: Contextual Changes and Guerrilla Tactics (15 Nov, 2019)",
			"body": "Within the past 20 hours, the context for Hong Kong has undergone fundamental changes. Such changes exemplify in the following three aspects：\n\n1. China’s top leader Xi Jinping addressed Hong Kong issue in tough tone at BRICS summit in Brazil. It signifies that the CCP officially load weapons to wage war against the Hong Kong people, in the name of cracking down on independence advocates. Aiming to arrest 30,000 citizens, Beijing is deploying additional technical, informational and detective squads as well as spies and assassins to Hong Kong. High-grade, precision and advanced weapons are also transferred from the mainland. In the streets of HK, undercover and doped PAP, PLA and thugs will arson buildings, cars and humans; cause explosions; and self slaughter, in order to smear protestors.\n\nMeanwhile the CCP is preparing warfare against Taiwan, also in the name of crushing independence advocates. It will be a blitz and on a much larger scale, aiming to smash the island in a short time.\n\n2. The US and the EU have shifted their tones about Hong Kong. The statements made by the U.S., Canada, Australia and Europe are clear about officially supporting the protestors. Behind the scenes, in Washington, the fierceness of political struggles was beyond imagination. Fortunately and unprecedentedly, after certain trade-offs, the Hong Kong Human Rights and Democracy Act was put into an expedited path at the Senate and is likely to be passed imminently. In South Carolina, Los Angeles and San Francisco, pro- and anti-CCP think tanks and politicians have been wrestling via forums, finance and media. In the U.K., visiting justice secretary Teresa Cheng fell from grace for her arrogance and contempt of the protestors.\n\n3. In Hong Kong, people are turning into fighters. Tycoons, professionals, financiers and the entertainment circle are shifting stances. They donate money and lend support to protestors, though some stay unopened. Lee Ka-shing’s PARKnSHOP has delivered at least ten lorries of free provisions to the students of the Chinese University.\n\nWith such contextual changes, Mr. Guo begs that in Hong Kong：\n\n1. All youngsters, after their heroic activities, should pause, retreat swiftly and, most importantly, hide safely. Avoid confronting armed mad PLA, PAP and thugs. Campus and home are not safe, given the youngsters’ identities are well known by the CCP.\n\n2. Professionals, financiers, tycoons and entertainment circle must help to hide youngsters safely from being arrested and killed. Lantau Island, remote countries and villages are desirable options.\n\n3. To leave Hong Kong is also a desirable option for youngsters. In case of needing any help, please contact Rule of Law Foundation, Mr. Guo himself or his fellow warriors.\n\nTo hide and retreat is a tactic for fighting back, guerrilla style, drag it out and thus let the CCP lose politically, economically, financially and diplomatically.\n\nChina will witness a big incident. Taiwan will face a big conflict. Hong Kong will have humanitarian catastrophe. The US and the EU will take big actions. The CCP is rushing to its death.",
			"added": 1573960136
		},
		{
			"topic_id": 1574141799,
			"title": "At local time in USA, New York 8:00 am 20/11/2019, the live will show you how wicked and how dangerous the CCP is",
			"body": "live add / replay:\nhttps://www.youtube.com/watch?v=RAQvqtpT0EA\nIF you want to do business in China or business with CCP, even travel to China, you should watch this live.",
			"added": 1574141777
		},
		{
			"topic_id": 1574266227,
			"title": "French President Emmanuel Macron will be end!",
			"body": "It was so great news you ever seen, Emmanuel Macron will be end, even in prison!\nThis living shows how France gov purchased by Chinese gov CCP with evidence.\nJust a murder values of 1.5 billion dollars, payed by the UBS ! Once 1.5 billion dollars for a murder!\nA great political storm and revolution will be break in France and UBS !\nliving/replay:\nhttps://www.youtube.com/watch?v=RAQvqtpT0EA\nNew:\nThe leaked doc in this video\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/11/guomedia_f42e86196ca29a3c3fdfd0abcbcad3a5.pdf",
			"added": 1574266204
		},
		{
			"topic_id": 1574346417,
			"title": "Homemade Firearms web site, share with Iran, Hong kong and all dictatorship countries people",
			"body": "Homemade Firearms web site\nhttp://makegunq4r36mego.onion/index.shtml\n\nSearch tor for more resources:\nhttp://hss3uro2hsxfogfq.onion/",
			"added": 1574346393
		},
		{
			"topic_id": 1575523101,
			"title": "Warning: WhatsApp not safe in Hong Kong",
			"body": "December 3 — What’s App is a widely-used communication application in Hong Kong; however, chat records are currently unprotected under the Interception of Communications and Surveillance Ordinance. In other words, law enforcement authorities such as the Police Force can obtain conversation histories with effective warrants obtained from the court.\n\nCommissioner on Interception of Communications and Surveillance A.R. Suffiad stated that interception took place only at the moment when messages were transmitted. How law- enforcement bureaus obtain the chat records through warrants is beyond the scope of the Interception of Communications and Surveillance Ordinance and his responsibilities as the Commissioner, and thus, should be handled by the government and legislative authority.\nSource: https://news.guo.media/20023/",
			"added": 1575523076
		},
		{
			"topic_id": 1575688284,
			"title": "China resurrects Great Cannon for DDoS attacks on Hong Kong forum",
			"body": "Two years after the last attacks, the Great Cannon is up and running again.\n\nSource: https://www.zdnet.com/article/china-resurrects-great-cannon-for-ddos-attacks-on-hong-kong-forum/?fbclid=IwAR2Frg_bZEIfxxWXu4C0h8Kf3wduNj_X3cQ-drC2ZWkiCbl1Jq5OERtUegM\n\nAfter more than two years since it's been used the last time, the Chinese government deployed an infamous DDoS tool named the \"Great Cannon\" to launch attacks against LIHKG, an online forum where Hong Kong residents are organizing anti-Beijing protests.\n\nThe last time the Great Cannon was used was in 2017 when Chinese authorities used it for DDoS attacks against Mingjingnews.com, a New York-based Chinese news site.\n\nPrior to that, the Great Cannon rose to infamy after the Chinese government used it to launch DDoS attacks against GitHub (for hosting tools to aid Chinese users bypass China's national firewall) and GreatFire.org (a portal that exposes internet censorship across the globe).\n\nA 2015 report from Citizen Lab at the University of Toronto's Munk School pointed out that the Great Cannon and China's Great Firewall shared code and were co-located on the same servers, suggesting the tool was developed and operated under the direct supervision of the Chinese government.\n\nAccording to the report, the Great Cannon worked by intercepting traffic meant for websites hosted inside China and injecting JavaScript code in the responses users received in their browsers.\n\nDDoS attacks with the Great Cannon have been rare, mainly because they tend to generate a lot of bad press for the Chinese government.\n\nBut in a report published today, AT&T Cybersecurity says the tool has been deployed once again.\n\nThis time, the Great Cannon's victim was LIHKG.com, an online platform where the organizers of the Hong Kong 2019 protests have been sharing information about the locations of daily demonstrations. The site is also a place where Hong Kong residents congregate to recant stories of Chinese police abuse and upload video evidence.\n\nAT&T Cybersecurity says the first Great Cannon DDoS attacks targeted LIHKG on August 31, while the last one being recorded on November 27.\n\nAT&T Cybersecurity researcher Chris Doman said the August attacks used JavaScript code that was very similar to the one spotted in the 2017 attacks on Mingjingnews.com.\n\nAccording to LIHKG, the site received more than 1.5 billion requests per hour during the August attack, compared to the site's previous traffic record that was only a meager 6.5 million requests per hour.\n\nDetail:\nChina’s Great Cannon\nhttps://citizenlab.ca/2015/04/chinas-great-cannon/\n\nThe “Great Cannon” has been deployed again\nhttps://cybersecurity.att.com/blogs/labs-research/the-great-cannon-has-been-deployed-again",
			"added": 1575688258
		},
		{
			"topic_id": 1575882016,
			"title": "Over 800,000 Hong Kong Citizens Participated in the Human Rights Day Match",
			"body": "2019-12-08 09:39\n\nSource https://news.guo.media/48681/\n\nDecember 8 — Over 800,000 Hong Kong citizens Participated in the Human Rights Day Match\nCivil Human Rights Front organized this activity but because obtained the letter of no objection from the police not early enough, they didn’t expect that number.\nBut according to the Hong Kong police, they believe that only more than 180,000 people participated at the peak.\nHowever, many Westerners believed it was just another 1 million people march. And they now understand why Hong Kong people keep going.\nAlthough they just win elections, although millions voted, although millions have marched, but nothing has changed. This is the obstinate nature of the threat they face and it’s why Hong Kong people have to keep going.",
			"added": 1575881989
		},
		{
			"topic_id": 1576156136,
			"title": "共产党正炮制猛药去毒死香港人，王健死亡真相引发国内巨大震荡",
			"body": "2019-12-12 \n\n战友之家听写组\nhttps://livestream.com/accounts/27235681/events/8197481/videos/199785518\n\n...\n然后，对港的一系列政策，估计今天这边本来要公布的，可能也要有点儿时间的推迟。所以呢，我们要看事情的进展进度，我的两个听证会，到下午四点到五点都能结束。结束完之后，如果事情的变化在我们了解和情报的范围之内，我就马上给大家直播；如果没啥，我就给大家说一声，今天不直播了。\n\n亲爱的兄弟姐妹们，千万别忘记传播香港危机真相，香港此时此刻正在水深火热之中，共产党正在炮制着一剂又一剂猛药，想毒死香港人。哈哈！一剂又一剂的猛药，大家明白我的意思吧？陷害、构陷、栽赃，在国际上蓝金黄，在香港内部搞分化。\n\n然后，把那些抓起来的人再次虐待、做假证；对有良知的法官进行威胁；对四大不要脸家族持续进行威胁和诱惑。香港是最敏感、最关键的时刻。\n\n战友们，这几天，除了大家对王健的事情之外，大家一定别忘了香港的事儿！拜托了！香港永远是我们现在的重中之重。但是，我可以告诉大家，所有它们这些折腾都是垂死挣扎，都是垂死挣扎。包括它们最近派出了一系列的，海外所谓的它们沉默的力量。一波又一波，在吴征的领导下，又想玩儿点大的，再来一波的攻击。\n...",
			"added": 1576156108,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1576242758,
			"title": "Miles Guo: Wang Qishan has prepared four principles against Hong Kong",
			"body": "Short video\nhttps://news.guo.media/52240/",
			"added": 1576242727
		},
		{
			"topic_id": 1576243302,
			"title": "'Social credit score': China set to roll out 'Orwellian' mass surveillance tool",
			"body": "source:\nhttps://www.washingtontimes.com/news/2019/dec/9/social-credit-system-china-mass-surveillance-tool-/",
			"added": 1576243270
		},
		{
			"topic_id": 1576327639,
			"title": "MilesGuo: Details of HNA chairman, Wang Jian‘s death. He was packed alive into a corpse bag！",
			"body": "Miles Guo: What does it mean that Wang Jian is the fourth way to die?\nHalf the earth is controlled by Wang Qishan !!!\nShout video:\nhttps://news.guo.media/53278/\n\nFrom the video(https://gnews.org/53731/) footage of the forensic autopsy, you can see that Wang Jian’s internal organs had all turned into green; even the color of his brain was abnormal.  It was obvious that the side of this leg was rotten, which is so obvious even seeing with our bare eyes.  And yet the autopsy reports’ findings were all normal. Wang Jian’s family members and all the people at the site all said everything’s normal.\nhttps://pic.twitter.com/KuqN7C1kjq\n\nMiles Guo: Why did Wang Jian’s internal organs turn green? But the autopsy reports said everything was normal\nhttps://gnews.org/53720/\n\nMiles Guo: Former Interpol Meng Hongwei’s role in Wang Jian’s death\nhttps://gnews.org/54068/\n\nMiles Guo Exposed Chinese Vice President’s Role As “Invisible Lord” Of “Dual Cultivation”\nhttps://gnews.org/54585/\nIn his live broadcast on December 15th, Mr. Guo has once again shocked audiences by exposing Wang Qishan and his gang’s involvement in controlling underage females (3 years old to 20 years old)and making them the sex slaves by creating the cult of ” Dual Cultivation” within the communist party. ” \n\n",
			"added": 1576327606
		},
		{
			"topic_id": 1576500361,
			"title": "HK Protest: Notes from the reporters on the scene from Dec. 15 to 16",
			"body": "HK Protest: Notes from the reporters on the scene from Dec. 15 to 16\nhttps://gnews.org/55472/\n\nThere is More to Justice than its Shattered Visage\nhttps://gnews.org/55249/",
			"added": 1576500327
		},
		{
			"topic_id": 1576592250,
			"title": "Chinese don’t own their land and they are not all communists",
			"body": "source\nhttps://gnews.org/56098/",
			"added": 1576592214
		},
		{
			"topic_id": 1576672826,
			"title": "Hong Kongers Poisoned by Cyanide - findings from a concerned group",
			"body": "The acrid smell and taste of tear gas is no longer something new for the Hong Kongers. HKGETC, formed by a group of concerned citizens from various professions, detected the presence of cyanide at confrontation sites more than five times the upper concentration limit by international standards using an industrial cyanide detection machine. One of the readings was as high as 28.6ppm. A reading of 4.7ppm would warrant evacuation from the area by European and American standards. \n\nCyanide can remain in closed space for a long time and it does not disperse easily in a city with a high concentration of tall buildings, like Hong Kong. Tear gas canisters were shot not only in busy streets, but also into civilian homes. HKGETC points out that tear gas can be lethal if used inappropriately. They criticise the police for using tear gas without adhering to its safety guidelines. The situation was made worse by the lack of information on the composition of Chinese-made tear gas canisters. The Hong Kong government irresponsibly admitted they had limited information. HKGETC could have appointed a testing laboratory to determine the ingredient composition. However, under the threat of white terror, these labs fear that they may lose government contracts. This has prevented many laboratory from performing the testing. \n\nSource https://hk.appledaily.com/local/20191127/QLOCR7CUTXCY43NEEY2TNKC5IA/\n\nDecember 17, Posters on HK protest https://gnews.org/56602/\n\nHong Kong “Social Welfare Sector: Humanitarian Crisis Assembly” Artwork Show  https://gnews.org/57031/\n\n183 Days of Nebulous Clouds of Tear Gas in Hong Kong  https://gnews.org/57085/\n\nOur Destination – Salute to Hong Kong Heroes\nhttps://gnews.org/56715/\nOur options are few, death or resurrection.\nThe path is treacherous, yield not can we achieve glory.\nWill I bow to the unbearable humiliation and pain?\nCan the horrific torture break my back?\n\nNothing stops my love of freedom.\nNothing destroys what I believe.\n\nThe devil’s wrath cannot hide his fear.\nThe victory belongs to the righteous and the just.\nI will embrace the sun tomorrow.\n\nFundraising Platform for Protestors Spark Alliance Releases Statement on Arrest of its Members\nDecember 19 — The Hong Kong Police arrested several members of the Spark Alliance. The Spark Alliance released a statement on the arrest of its Members.\nRegarding follow-up actions subsequent to the arrest of members of the Spark Alliance today, since the case is currently undergoing legal procedures, it is inappropriate for the Alliance to release further information on this matter. Lawyers are following up with each of the arrested member. \nhttps://facebook.com/sparkalliancehk/#!/story.php?story_fbid=2634390273514755&id=1965117443775378\n\nDecember 21, Posters on HK Protest\nhttps://gnews.org/59862/",
			"added": 1576672789
		},
		{
			"topic_id": 1576765890,
			"title": "Twisted evil in kindergarten, an underground industry for CCP cult members  that paid sex slave training with kids in kindergarten.",
			"body": "According to the post from DTinLosAngeles from twitter, a transcript between an unidentified man with surname Zhao and Miss Chen who works in windmill kindergarten via Wechat(popular social app in China)has been leaked out. It unveiled an underground industry of paid sex slave training with kids in kindergarten.\nDetail and pics https://gnews.org/57500/\n\nMacau: CCP’s lethal weapon for ultimate spy rings and infiltrations\nhttps://gnews.org/57446/",
			"added": 1576765852
		},
		{
			"topic_id": 1577019778,
			"title": "Uighur: China slammed over program that ‘appoints’ men to sleep with Uighur women",
			"body": "Mass rape:\nhttps://www.news.com.au/world/asia/this-is-mass-rape-china-slammed-over-program-that-appoints-men-to-sleep-with-uighur-women/news-story/ed45cd065e39690354b6402d02904557",
			"added": 1577019739
		},
		{
			"topic_id": 1577276871,
			"title": "Some news in HongKong: Police: We can judge citizens who “Cause Trouble” on Xmas’ Eve",
			"body": "Hong Kong(Dec. 23) – While Christmas’ Eve is usually a festive occasion in Hong Kong where citizens fill the street, the police was asked whether they would charge citizens who go out with unlawful assembly.\nPolice responded by claiming that they know how to judge citizens who celebrate Christmas and those who “cause trouble”. \nhttps://gnews.org/62237/\n\nHK Police Cause Terror Among Shoppers in Mongkok on Xmas Eve\nhttps://gnews.org/63221/\n\nhttps://www.vice.com/en_in/article/7kzpa4/hong-kong-protesters-declaring-not-suicide\nHong Kong Protesters Are Declaring ‘I Won’t Kill Myself’ Just in Case They Disappear\n\nLung Mun Cafe organized a “New Year Dinner for the Children of Hong Kong” event, providing free dinner to protestors to welcome the New Year of the Rat. \nhttps://gnews.org/61490/\n\nDenial, Rebuttal and Attacks Became Routine at Chinese Foreign Ministry Spokesperson’s Press Conference\nhttps://gnews.org/61505/\n\nHow Hong Kong police deliberately attack ordinary citizens？\nhttps://gnews.org/61149/\n\nhttps://gnews.org/62174/\nFour principles, use Macao to disintegrate Hong Kong’s different parties\n\nXmas eve \nHK Police Mocked Citizens at Shopping Centre: “You Should Jump Off and Speak to Me!”\nhttps://gnews.org/64937/\n\nhttps://gnews.org/64511/  Police harassed RTHK off-duty reporter and called him “thug reporter” in Kwun Tong\n\nhttps://gnews.org/64892/  Police Confirms Use of “Coloured Pepper Spray” in Tai Po\n\nhttps://gnews.org/64822/  China’s solution to local governments’ debt crisis: issue more bonds\n\nhttps://gnews.org/67899/  Brother Rain interprets CCP’s front-page news, Dec 28th\n\n\nhttps://gnews.org/67929/  White Terror: Dismiss Principals for Supporting Teachers’ Behaviour\n\nRally Shows the World That Hong Kongers Are Not Willing to Give Up Their Fight\nhttps://gnews.org/67752/",
			"added": 1577276831
		},
		{
			"topic_id": 1577717645,
			"title": "BRONZE PRESIDENT Targets NGOs",
			"body": "details:\nhttps://www.secureworks.com/research/bronze-president-targets-ngos",
			"added": 1577717604
		},
		{
			"topic_id": 1577801669,
			"title": "God bless HK and HAPPY NEW YEAR",
			"body": "HAPPY NEW YEAR \nProtect freedom and stand with HK is protect all of us and children, Just now China, Iran and Russia have been team up for terrifying military alliance.\n\n60% of the protesters arrested in Hong Kong were underage children\nhttps://gnews.org/69336/\nhttps://www.facebook.com/GodblessHK1/videos/1168011666737702/?v=1168011666737702\n\nWarning!!! Miles Guo Exhibiting Graphic Photos of Murdered HNA CEO’s Body\nhttps://gnews.org/69030/\nChinese version https://gnews.org/zh-hans/68999/\n\nMiles Guo:Photos of Wang Jian’s tragic death and details of his murder\nhttps://gnews.org/69554/",
			"added": 1577801627
		},
		{
			"topic_id": 1577969522,
			"title": "US Senators Raise Alarm About China’s New Encryption Law",
			"body": "Attention: Chinese gov CCP is controlling the paypal ! (Exposed Confidential Document Reveals How CCP Block Donations to Steve Bannon’s Rule of Law Foundation\nhttps://gnews.org/72637/)\n All the companies who trade with China have been kidnapped by ccp.\n\nhttps://gnews.org/70096/\nHongkongers Claim their New Year, Unafraid of the Authorities’ Intimidation\n\nUS Senators Raise Alarm About China’s New Encryption Law\nhttps://www.theepochtimes.com/u-s-senators-raise-alarms-about-chinas-new-encryption-law_3189713.html\n\nThe Manners of HK Riot Police: Attacking Reporters and Littering\nhttps://gnews.org/71121/\n\nhttps://gnews.org/71763/\nMiles Guo: CCP might use SARS to control Hong Kong\nwarns the public that the Chinese Communist Party is suspected of spreading Severe Acute Respiratory Syndrome (SARS) from Wuhan to Hong Kong as an excuse for imposing martial law in Hong Kong.\n",
			"added": 1577969479
		},
		{
			"topic_id": 1578114536,
			"title": "Qassem Soleimani as the Young Former General Secretary of CCP",
			"body": "https://gnews.org/72399/",
			"added": 1578114492
		},
		{
			"topic_id": 1578201607,
			"title": "The Chinese Communist Party unstabilizes the Middle East",
			"body": "The CCP is doing these to achieve one goal: 3F the U.S., and then enslave all over the world!\nWeaken the U.S.\nTrouble the U.S.\nKill the U.S. \nIncluding Chemical war: fentanyl\n\n(The Chinese people have not own their land, human rights, guns... The air, food, soil, crops, groundwater and rivers has been polluted. \nThe CCP brainwashing from education(kindergarten to college) to all assert platform , repeating the things that first love the CCP and then present with all respect even to die! )\n\nhttps://gnews.org/69659/\n",
			"added": 1578201562
		},
		{
			"topic_id": 1578289189,
			"title": "HK police ordered HSBC to freeze Spark Alliance asset without a court order",
			"body": "HK police ordered HSBC to freeze Spark Alliance asset without a court order\nhttps://gnews.org/73652/\n\nThe CCP is fooling Chinese private enterprises again!\nhttps://youtu.be/HWwBuvjdFTU\n\nOpinion: CCP’s viral warfare in Hong Kong?\nhttps://gnews.org/76887/\n\nMiles Guo: CCP might use SARS to control Hong Kong\nhttps://gnews.org/71763/\n\nJanuary 8, Posters on HK Protest\nhttps://gnews.org/76506/\n\nRecant or die: Alleged threat to self-confessed Chinese spy Wang Liqiang\nhttps://www.theage.com.au/national/recant-or-die-alleged-threat-to-self-confessed-chinese-spy-wang-liqiang-20200107-p53pkl.html\n\nTaylor Swift to Perform in China at Alibaba Gala amid Hong Kong Protests\nhttps://www.breitbart.com/entertainment/2019/10/29/taylor-swift-to-perform-in-china-at-alibaba-gala-amid-hong-kong-protests/\n\nBrother Rain interprets CCP front page news—January 8th 2020\nhttps://gnews.org/77214/\n\nSenior Inspector Unable to give a Credible Account of Attack\nhttps://gnews.org/76884/\n\nA Demosisto member was arrested at the airport while flying to observe the Taiwan presidential election\nhttps://gnews.org/77522/\n",
			"added": 1578289143
		},
		{
			"topic_id": 1578583385,
			"title": "Opinion: The Outrageous Chinese Sex Education System",
			"body": "The Outrageous Chinese Sex Education System\nhttps://gnews.org/76719/\n\nThe Farm: Wang Qishan and the Pedophile Rings of the CCP\nhttps://gnews.org/54567/\n\nChina’s Twisted Education System Produce Slaves\nhttps://gnews.org/80914/\n\nThe Red Communist’s Crimes of Sexual Abuses\nhttps://www.youtube.com/watch?v=5KTvdE_xEkQ\n\n\n",
			"added": 1578583338
		},
		{
			"topic_id": 1578801701,
			"title": "Full text of President Tsai Ing-wen’s victory speech",
			"body": "Congratulations!\nhttps://gnews.org/78351/\n\nTaiwan 2020 election: Excerpts from President Tsai Ing-wen’s remarks\nhttps://gnews.org/78371/\n\nMiles Guo:invasion & sanction will follow Han Kuo-yu’s election\nhttps://gnews.org/77679/\n\n",
			"added": 1578801652
		},
		{
			"topic_id": 1578801836,
			"title": "Jan. 13, Posters on HK Protest",
			"body": "Jan.11\nPics\nhttps://gnews.org/78561/\n\nCCP finished its first S. Sudan peacekeeping patrol and escort mission in 2020\nhttps://gnews.org/77722/\n\n[China] Man Arrested for Talking About The Police On WeChat\nhttps://gnews.org/78270/\n\nTextbooks Must Reflect the Will of the CCP and State\nhttps://gnews.org/77548/\n\nJan. 13\nHong Kong judiciary plans to accelerate protest trials\nhttps://gnews.org/79764/\n\nBeijing’s reasons for denying “trouble stirrer” entry to Hong Kong\nhttps://gnews.org/79819/\n\nCCP carried out its first 2020 peacekeeping defense drill in Mali\nhttps://gnews.org/80109/\n\nHong Kong judiciary plans to accelerate protest trials\nhttps://gnews.org/79764/\n\nJan.15\n21-year-old student being kicked in the lower body and beaten to bone fracture by police after arrest\nhttps://gnews.org/81266/\n\nJan.16\nHK Police Force Considers Arming Officers with Tasers and Net Guns\nhttps://gnews.org/81302/",
			"added": 1578801786
		},
		{
			"topic_id": 1578983882,
			"title": "The Inside story behind Taiwan's election, Taiwan opened the second door to the destruction of the CCP",
			"body": "2 short videos\nhttps://youtu.be/8bs0jb9HY48\nhttps://youtu.be/PUYnWQS7als",
			"added": 1578983831
		},
		{
			"topic_id": 1579150474,
			"title": "Economic and Trade Agreement Between the Government of the China-US",
			"body": "Text:\nhttps://ustr.gov/about-us/policy-offices/press-office/press-releases/2020/january/economic-and-trade-agreement-between-government-united-states-and-government-peoples-republic-china\n\nhttps://ustr.gov/sites/default/files/files/agreements/phase%20one%20agreement/Economic_And_Trade_Agreement_Between_The_United_States_And_China_Text.pdf\n\nSecretary Pompeo Delivers Remarks to Stanford University: Rethinking China-US Commercial Relationship\nhttps://gnews.org/81195/ key point https://gnews.org/81665/\n\nWhat is the real meaning behind the China-US trade agreement? What kind of China is in America’s interest?\nhttps://youtu.be/l0sjKPdU3dw\nhttps://gnews.org/81636/\n\nChina’s bid to challenge Boeing and Airbus falters\nhttps://japantoday.com/category/business/insight-china%E2%80%99s-bid-to-challenge-boeing-and-airbus-falters",
			"added": 1579150422
		},
		{
			"topic_id": 1579328602,
			"title": "Differences between the Chinese version of the trade agreement and the English version",
			"body": "https://www.youtube.com/watch?v=3LC-TODKe04 （CN language）\nAs early as 2018, Miles told his America friends firmly that the CCP has to sign the trade deal  around end of 2019 to May 2020. But the CCP will not deliver it.\n\nThere are many differences between the Chinese version of the agreement and the English version. We will compare them. The US side is furious about it. The 4 core differences are as follows:\n\n1. The scope and jurisdiction of the law \n2 .Effective time, enforcement time\n3.The definition of state-owned enterprises, private enterprises, and law enforcement\n4 .176 times of requests to China and 6 times to the US \n\nThe CCP’s propaganda of the deal is to avoid decoupling and save China. This statement aims to the Party, showing the intense fighting inside the Party.\n\nPrior to the signing, the US had threatened to cancel the Hong Kong’s Free Trade Zone , establish diplomatic ties with Taiwan and seize CCP officials’ overseas assets.\n\nXi had planned to record a video of the signing at Zhongnanhai, but he changed his mind at the last minute and let Liu He to sign the agreement.\n\nThis agreement has completely shattered the CCP’s credibility, which giving a huge opportunities to the foreign financial institutions.\nWaiting for details ...\n\nCCP’s mouthpiece comments on phase one US-China trade deal\nhttps://gnews.org/82003/\n\nChinese Premier: cut taxes and expenditure\nhttps://gnews.org/81996/",
			"added": 1579328549
		},
		{
			"topic_id": 1579329774,
			"title": "Chemistry&Pyrotechnics Forum",
			"body": "13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/",
			"added": 1579329720
		},
		{
			"topic_id": 1579340309,
			"title": "Steve Bannon and Kyle Bass on 'phase one' trade deal",
			"body": "https://www.youtube.com/watch?v=cFpS4zpLcgo\n\nSome of the deal’s core pieces:\nIt calls for China to submit an “Action Plan to strengthen intellectual property protection” within 30 days of the agreement taking effect, according to the trade pact. The proposal would include “measures that China will take to implement its obligations” and “the date by which each measure will go into effect.”\n\nThe deal says companies should be able to operate “without any force or pressure from the other Party to transfer their technology to persons of the other Party.” Technology transfers “must be based on market terms that are voluntary and reflect mutual agreement,” it reads.\n\nThe agreement says China will increase purchases of U.S. manufacturing, energy and agricultural goods and services by at least $200 billion over two years.\n\nIt makes commitments to try to root out the sale of counterfeit goods.\n\nThe deal includes provisions to boost Chinese market access to financial services firms.\n\nAhead of the signing, the Trump administration also revoked its decision to label China a currency manipulator.\n\nAnd the HUAWEI's backdoor access compare with the APPLE. DO NOT USE HUAWEI and any Chinese IT product, they are full with spy ware. Many Chinese people who use them to propagate the CCP's evil include abuse cops were busted! \nHUAWEI helped the IRAN to build their internet (intranet).",
			"added": 1579340254
		},
		{
			"topic_id": 1579428954,
			"title": "Corruption in Iran is the same as CCP",
			"body": "Esmail Ghanni murdered three Iranian-Canadians because they knew too many secrets. Amnesty for Chinese officials\nhttps://youtu.be/el8PKuiE7ac\n\nBiden and Bloomberg are CCP’s “double-gun” against Trump\nhttps://gnews.org/83375/",
			"added": 1579428898
		},
		{
			"topic_id": 1579429929,
			"title": "Research how the CCP tracking Chinese people with facial recognition and monitoring their speech",
			"body": "And some hack research\nVictor Gevers\nhttps://twitter.com/0xDUDE/status/1095702540463820800",
			"added": 1579429872
		},
		{
			"topic_id": 1579685719,
			"title": "WHO: New cases of “Wuhan pneumonia” virus suggest human transmission",
			"body": "https://gnews.org/85683/\n\nOpinion: CCP is suspected of making Wuhan coronavirus to butcher the Chinese people in order to stay in power!\nhttps://gnews.org/85693/\n\nThe CCP is most afraid of seizing their overseas assets and RICO Act. What is happening with SARS in China?\nhttps://youtu.be/YVo-W3IlR2k\n\nCCP to curb spread of new coronavirus-related pneumonia\nhttps://gnews.org/84980/",
			"added": 1579685661
		},
		{
			"topic_id": 1579685919,
			"title": "Hundreds of students and supporters rally against White Terror in HK, The CCP WILL TAKE BIG ACTION",
			"body": "https://gnews.org/83756/\nWhen tear gas, rubber bullets and even live rounds cannot keep pro-democracy protesters off the street, the government turned to instil fear in the city to deter citizens from speaking up.\n\nA rally against growing censorship and White Terror in schools was held in the evening of January 17 at Tai Po Waterfront Park.\n\nThe participants, of which many are students in uniform, stood up for a minute of silence to commemorate the deceased of the pro-democracy movement.\n\nThe CCP WILL TAKE BIG ACTION IN HK!\nhttps://gnews.org/83944/\n\nPolice end rally, enter Chater Garden and shoot at unarmed crowd\nhttps://gnews.org/84738/\nOn January 19, riot police and raptor squads entered Chater Garden and dispersed those attending the “Rally for Global Sanctions Against Communist China,” after the rally was ended prematurely.\n\nHowever, because of the large size of the crowd attending the rally, many were trapped inside Chater Garden.\n\nSome members of raptor squads fired pepper-spray pellets at those trapped inside the park, even though the attendees at the rally had not taken any actions against police.\n\nPolice also used pepper spray on reporters who were filming at the scene.",
			"added": 1579685860
		},
		{
			"topic_id": 1579685974,
			"title": "Word censorship under CCP’s dictatorship",
			"body": "Word censorship under CCP’s dictatorship\nhttps://gnews.org/84476/\n\nMitsubishi Electric data likely compromised in massive cyberattack blamed on Chinese group\nhttps://www.japantimes.co.jp/news/2020/01/20/business/corporate-business/mitsubishi-electric-cyberattack-china/\n\nAshamed, embarrassed': Burnaby woman says she was paid $150 to support Meng Wanzhou(HUAWEI CFO) outside court\nhttps://www.citynews1130.com/2020/01/21/burnaby-woman-paid-support-meng-wanzhou/\n",
			"added": 1579685914
		},
		{
			"topic_id": 1579767145,
			"title": "CCP used Sino-US trade agreement as an excuse for another plunder of national wealth!",
			"body": "America’s pension funds, retirement funds in the United States, the education fund in the US, are no longer allowed to invest in the CCP. But get the US government to agree that the money can be invested in certain Wall Street funds, and these funds went to invest in these assets, and these assets will invest in the US. After a period of management, management fees were collected. And then, it transferred to the United States with blond hair of Wang Qishan, Meng Jianzhu, Sun Lijun, Jiang Zemin, and other illegitimate children of these kleptocrats, using their image to control the Chinese communist party’s stock market.\nhttps://www.youtube.com/watch?v=-ZizhGqQe98FILL\n\nFull text version\nhttps://gnews.org/86201/",
			"added": 1579767084
		},
		{
			"topic_id": 1579767328,
			"title": "Wuhan, a more than 10 million people city in China, was in “wartime” state: army seals off city to battle coronavirus outbreak",
			"body": "https://gnews.org/86468/\nThe new coronavirus's envelope Protein is nearly exact like with the virus's from Zhoushan bat(Zhoushan is a the eastern Chinese province of Zhejiang), that means the virus is MAN MADE not evolution in natural!\n It is sure that the CCP own this biology tech, and motivation like kill HK people and reduce the number of Chinese people...\n\nAt Jan. 24, 8 cities have been lockdown in China. The next cities will be Shanghai, Guangdong, Beijing...\nUntil all over the China\n\nFollow twitter @sneweyy ",
			"added": 1579767266
		},
		{
			"topic_id": 1579853774,
			"title": "Wuhan corona virus (2019-nCoV, covid-19), what was man made BIOWEAPON and intentionally spread out by CCP",
			"body": "(These days the gnews.org was DDos attacked by PLA cyber attacks, if you can not open this site, please wait, maybe 1-2 days.\nA info about PLA cyber attacks is PLA unit 61398, the U.S. gov was published a report about this unit,you can google it).\n\nEverything is out of control——Wuhan video collection\nPart 1 https://gnews.org/87312/\nPart 2 https://gnews.org/87341/\npart 3 https://gnews.org/88477/\npart 4  \t\t\t\t/90861/\npart 5  \t\t\t\t/92421/ \npart 6 \t\t\t\t/94065/\n\nBan Doctors From Talking about the Coronavirus\nhttps://gnews.org/87599/\n\nAuthorities conceal illness leading to patients’ death\nhttps://gnews.org/87656/\n\nIn Wuhan, a family member of a patient who was waiting for treatment showed his furious on the incapable and corrupted Chinese Government: ‘Fuck CCP!’\nhttps://gnews.org/87625/\n\nCompulsory to Wear a Mask in Wuhan, China; Violators Will Be Fined by Public Security\nhttps://gnews.org/86938/\n\nVideo: Wuhan pneumonia timeline from Dec 8 – Jan 23Dec 8, 2019, the first case of a new type of pneumonia was reported in Wuhan China.\n\nSource https://gnews.org/87713/\nVideo: https://youtu.be/-vjCZUMU29o\n\nDec 31, 2019, the Wuhan Municipal Health and Health Commission issued a public notice for the first time that some medical institutions recently found that many of the pneumonia cases received were related to the South China Seafood Market. After receiving the report, the Wuhan Municipal Health and Health Commission immediately launched the South China Seafood Market related case searches and retrospective investigations which have found 27 cases, of which 7 are in serious condition, and the remaining cases are stable and controllable, and 2 patients are expected to be discharged in the near future. Based on the situation, treatment outcomes, epidemiological investigations, preliminary laboratory tests and other aspects of the situation analysis, experts believed that the above cases are viral pneumonia. The investigation found no obvious human-to-human transmission and no medical staff infection.\n\nOn Jan 1, 2020, eight people were arrested in China for spreading rumors about this disease.\n\nThe Seafood market linked to the pneumonia was finally closed.\n\nOn Jan 3, Wuhan Health and Health Commission announced 44 infections including 11 severe cases.\n\nOn Jan 9,  there was a preliminary identification of the viral pneumonia outbreak as novel coronavirus.\n\n01/11, Wuhan Health and Health Commission announced a death case\n\n01/14, Thailand found one patient from China.\n\n01/15, Wuhan sent notification of unknown pneumonia cases without ruling out human to human transmission.\n\n01/16, Japan’s first case was confirmed, the patient had been to Wuhan, and two Wuhan tourists entered Vietnam were quarantined.\n\n01/17,  a new death in Wuhan,  and a second case was found in Thailand.\n\n 01/19, 17 new cases were found in Wuhan. NHC (National Health Commission) announced that the outbreak was preventable and controllable without finding the source of the virus.\n\n01/20\nOne new death case and 136 confirmed cases in Wuhan in the last two days.\nTwo confirmed cases in Beijing.\nOne confirmed case in Guangdong.\nEight confirmed cases in Shenzhen.\nFive confirmed cases in Zhejiang.\nOne case in South Korea.\nOne case in Shanghai.\nOne case in Chengdu\n\nZhong Nanshan, head of a high-level expert organized by the National Health Commission, said that the new virus causing the pneumonia outbreak in Wuhan could spread from human-to-human.\n\nJan 21, Wuhan-pneumonia caused one death, a second confirmed case in  Shanghai, 4 cases are being tested, 15 medical personals were infected including one suspected case.\n\nJan 23,  Central Military Commission has ordered the central theater to assist Wuhan in closing the city to prevent the instability of the people caused by the panic sentiment.\n\nSome context for the Wuhan transportation shutdown at Jan. 23 : \n600-800 flights a day through Wuhan airport  \nDirect flights to New York, San Francisco, London, Paris, Rome, Moscow and Tokyo.\nUp to 920,000 passengers a day through its train stations \n\nJan. 24, China has locked down 10 cities, affecting more than 30 million people.\n\nBREAKING: Insider warned”Beijing and Shanghai will be next” after Wuhan’s lockdown\nhttps://gnews.org/88820/\n\nChinese under threat of plague\nhttps://gnews.org/88757/\n\nSome videos from Wuhan (Chinese version) \nhttps://www.youtube.com/watch?v=c46qrSQlUCM\n\nTransmission of #coronoavirus estimated at 2.6 by another research group (lower than the 3.8 initial reports). But 2.6 is still extremely bad —each infected person will infect 2.6 others. Even the authors admit #CoronaOutbreak containment will be very difficult. \nFOLLOW https://twitter.com/DrEricDing\n\nWhat does Wang Qishan have to do with Wuhan coronavirus? The West has three things to figure out about this coronavirus\nhttps://gnews.org/90230/\n\nBRIEF SUMMARY OF EVIDENCE OF LAB-MADE 2019 nCoV -- WUHAN CORONA VIRUS!\nhttps://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/01/25133703/Brief-summary-of-evidence-of-lab-finish.pdf\n\nHK Police brutality never stopped during the Spring Festival\nhttps://gnews.org/93142/\n\nThe Chinese gov banning international rescue! And shutdown the internet in epidemic area, hiding the truth !\n\nSteve Bannon’s “War Room” starts “Pandemic” episodes focusing on CCP’s own “Chernobyl”–Coronavirus epidemics\nTime 54min https://www.youtube.com/watch?v=9Cfib5a9kq8\n\nWhy is the CCP so determined to control these two departments of the UN? The CCP refused to accept UN aid and medical supplies\n5min https://www.youtube.com/watch?v=q8ZpHJiCWEk\n\nhttps://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus\n\nDaily updates on Wuhan coronavirus outbreak 01, Jan. 26\nhttps://www.youtube.com/watch?v=3K61AF-g3kY\n\nCORONAVIRUS BIOWEAPON – HOW CCP STOLE CORONAVIRUS FROM CANADA AND WEAPONIZED IT!\nhttps://greatgameindia.com/coronavirus-bioweapon\n\nShort of oxygen in the hospital, Jan 27, a video showed that oxygen was running out in one Wuhan hospital\nhttps://gnews.org/93447/\n\nJan. 27, China has locked down 16 cities, affecting more than 46 million people.\n\nCoronavirus: WHO, CCP, the world, the epidemic zone\nhttps://gnews.org/94289/\n\nBannon’s ‘war room’ disscussion and videos collection from China \n50 min. https://www.youtube.com/watch?v=mh0Mo_UFI_A\n48 min. https://www.youtube.com/watch?v=KPok5Y0iSbc\nWar Room: Pandemic, China’s Chernobyl\n53min https://youtu.be/j1IsaAuzujw\n\nJan 29\nMargaret Chan Director-General of the WHO is a Chinese spy!\nhttps://youtu.be/zC1uFqpX83g\n\nCCP’s propaganda: “good” news from China amidst Wuhan epidemic\nhttps://gnews.org/96165/\n\nWUHAN CORONAVIRUS SPREADING: Is China telling the truth on death toll, infected numbers?\n10 min. https://www.youtube.com/watch?v=A_WI3Hsh1vg\n\nThe Farm: “P4” Biological Superweapons Development    https://gnews.org/89509/\nScientific Research Shows 2019-nCov is Man made     https://gnews.org/97392/\n\nThe voice of a pneumonia patient in Wuhan. Jan 31, this video was taken in Wuhan City, right in front of Chang Lun Neighbourhood Committee of Wuhan City. He argued that his family members were dead because of coronavirus, now, he was suspicious of this virus but couldn’t find anyone for help.\nhttps://gnews.org/97769/ \n\nInternal notice leaked: CCP blocks journalists from covering on epidemic situation. According to WeChat group messages provided by some brothers-in-arms, the CCP issued such internal notice to prevent journalists from covering on the epidemic situation.\n(When every village and community discovers overseas media to interview, they have to report to the leaders in charge of townships and offices at the first time, who will communicate with the Propaganda Department of Municipal Party Committee in a unified way.It is illegal to interview without the consent of the interviewee. Do not accept any interview questions about the epidemic situation without the relevant verification ID and press credentials of journalists)\nhttps://gnews.org/97624/\n\nJan 31 \nThe coronavirus could lead to an uprising in Hubei China,The United Nations has become a communist-controlled underworld!\nhttps://youtu.be/WezvZfMI2Zs\n\nPro-government Critics Criticize Medical Staff’s Call For Strike, Requesting Punishments and Dismissal for Participants\nhttps://gnews.org/97622/\nSee the evil trick of Devil Wang Qishan from the event of closing the city!\nhttps://gnews.org/94991/\n\nFeb 1\n11 deaths in five minutes filming in a single hospital  https://gnews.org/99951/\nMilitary deployed to Hebei to battle coronavirus https://gnews.org/99820/\n\nCCP Uses Red Cross to Achieve Full Control Over All Rescue Supplies (1) and will have the antidote to coronavirus when there is widespread death in Hong Kong(2)\n1 https://gnews.org/100432/\n2 https://youtu.be/7IkbC44M1Ts\n\nSina Weibo (Chinese twitter) post: coronavirus patient being “murdered” in the hospital\nhttps://gnews.org/99872/ https://gnews.org/99872/\n\nFeb 2, Updates on Wuhan Outbreak\nThe disease spreading around the world, evacuees have been found infected\nMany countries are closing their borders for emergency response\nAs the government treatment capacity is insufficient, the internet is flooded with the information from patients asking for help \nA Chinese folk singer writes a song to satirize the epidemic\nhttps://youtu.be/ZC05uVcMaT8\nMedicine can only last two weeks: Hong Kongers stranded in Hubei province long for help from the HK Government https://gnews.org/100494/\nA brave man named Fang Bin risked his life to walk around filming in Wuhan yesterday. In the video, you will see scenes from on the streets as well as inside the hospitals on the frontlines of this outbreak. Some of the footage has been seen before on Twitter (7:25 — the scene around the van with corpses still inside) — but this is a more complete video and it is quite graphic. Viewer discretion is advised.\nhttps://youtu.be/1uBlAOTdLN0\nCCP forcefully arresting potential patients from their homes.   https://gnews.org/101337/\nCCP says Wuhan coronavirus was created by the U.S. to attack China  https://gnews.org/101180/\n\nFeb 3\nCCP ordered Guo Deyin to create Wuhan coronavirus and implements curfew in the name of Virus Outbreak\nhttps://gnews.org/101782/\nhttps://gnews.org/101755/\nhttps://youtu.be/M_81KTYZ4YM   \nHK Riot Police Violently Assault Young Civilian in Mei Foo https://gnews.org/100720/\n\nFROM CHINA MESSAGE, THE INFECTED PEOPLE IS UP TO 1.3 MILLIONS \n\nFeb 4\nhttps://youtu.be/i9C9rxYvYHI\nStadium hospitals in Wuhan are a cross-infection time bomb https://gnews.org/102994/\nChinese military website: Wuhan Coronavirus is manmade by the U.S. https://gnews.org/102795/\nWar Room: Pandemic, Wuhan Coronavirus\nhttps://youtu.be/QSq4HBI0-eM\nhttps://youtu.be/6MscqrrA4xg\n\nFeb 5\nUpdates on Wuhan Outbreak, Posters on HK Protest\nhttps://gnews.org/104221/  https://gnews.org/104050/\nCCP Robs People of Masks, Making Masks Scarce in China https://gnews.org/103596/\nMinistry of Public Security: political safety is top priority in virus control https://gnews.org/104037/\nMother-to-fetus novel coronavirus transmission found https://gnews.org/103818/\nTruth Wins: Wuhan Hero Fang Bin’s latest broadcast https://gnews.org/104168/\n\nFeb 6\nCCP bans people from sending Wuhan coronavirus related messages in social media. Outside of China, taking this virus seriously by expressing concerns on social media can bring trouble as well.\nIn the west, Twitter or YouTube accounts accessing the risks of novel coronavirus are facing risks of “media ban”https://gnews.org/104139/\nDeath Rate 15% https://gnews.org/104419/\nMiles Guo: Rule of Law Foundation has prepared 100 million face masks for the Chinese\nhttps://gnews.org/104272/\nExpert predicts 50K infections per day in China. The numbers of cases published by China still follow a “model”, so they must be fake. https://gnews.org/105639/\nCCP delayed Dr. Li Wenliang’s death to placate public who was one of the first eight people disciplined by the police for spreading “rumors” about Wuhan coronavirus. \nhttps://gnews.org/105240/\nCCP’s “fake” bomb scares in Hong Kong: resemble acts of terrorism https://gnews.org/105507/\n\nFeb 7\nCoronavirus Crisis in China: Tussle for Masks\nhttps://gnews.org/105882/\nhttps://gnews.org/106759/\n\nAuthorities Deny the Entry of War Correspondent Michael Yon to Hong Kong\nhttps://www.facebook.com/207730000664/posts/10156964188090665/\nFarewell Li Wenliang! https://gnews.org/106212/\nMajor General biochemical weapon expert takes over Wuhan P4 Lab https://gnews.org/106576/\nThe US sends $100M to support China in combating novel coronavirus https://gnews.org/106823/\n\nFeb 8\nAwaking Chinese Netizens https://gnews.org/107315/\nFrank Plummer – Canadian Scientist Key To Coronavirus Investigation Assassinated In Africa?\nhttps://greatgameindia.com/frank-plummer-canadian-lab-scientist-key-to-coronavirus-investigation-assassinated/\n100% Coronavirus is not from the animals and is from the Wuhan laboratory\nhttps://gnews.org/107657/\nMiles Guo explains why CCP unleashed Wuhan coronavirus, the original goal was to use the virus to infect selective people in Hong Kong, so that the Chinese Communist Party could use it as an excuse to impose martial law there and ultimately crush the Hong Kong pro-democracy movement. But it backfired terribly.\nhttps://gnews.org/107513/\nWuhan Coronavirus Pandemic Season 14 https://youtu.be/T3j1KxNJ81c\nPosters on HK Protest https://gnews.org/108093/\nUpgrade Social Credit System Amid Coronavirus Outbreak\nhttps://gnews.org/108046/\nProfessor Says Coronavirus is Infecting 50,000 a Day, and He May be Right\nhttps://www.ccn.com/professor-says-coronavirus-infecting-50000-day-he-may-be-right/\nhttps://www.foxnews.com/opinion/to-beat-coronavirus-china-must-change-sen-tom-cotton\n\"Tip Of The Iceberg\" - WHO Director Warns Of More Widespread Transmission As Virus Death Toll Tops 900 And 40,000 Confirmed Cases\nhttps://www.zerohedge.com/geopolitical/were-totally-dark-japan-not-doing-enough-contain-outbreak-diamond-princess-passengers\n\nFeb 10\nTNT Daily: What’s happening in China Feb 9\nhttps://gnews.org/109146/\nCORONAVIRUS IN CHINA: 112K DEAD, 2.8M INFECTED, 23M QUARANTINED\nhttps://halturnerradioshow.com/index.php/en/news-page/news-nation/coronavirus-in-china-20-million-quarantined-2-8-million-infected-112-000-dead\nhttps://www.breitbart.com/europe/2020/02/09/britain-facing-major-outbreak-of-coronavirus/\n\nFeb 12\nhttps://youtu.be/LY15iXlFJ44\n\nShielded From Coronavirus: The Status of Police in HK\nhttps://gnews.org/111643/\nhttps://gnews.org/109525/\nHK Protest Against Isolation Site Proposal: Civilians Were Hit On Head, A Pool Of Blood Appeared On The Ground During The Arrest\n\nUpdates on COVID-19 Outbreak https://youtu.be/C_yheMKGaH8\nWas it because the CCP locked people at home, leading to the tragedy of three kids’ deaths?\nhttps://gnews.org/110871/\n\nFeb 13\nHK PPRB Officers Takes Video of Journalists, Hinders Press’ Reporting\nhttps://gnews.org/109519/\nWuhan Coronavirus Pandemic S18 https://gnews.org/112768/\nHK Riot police conducted stop and search operation while blocking the only way for residents to return home  https://gnews.org/112128/\nNo home, no feed due to lockdown in China: “homeless” renters & ducks https://gnews.org/113124/\nCoronaVirus Breakout: Waiting for Death or Upholding Justice https://gnews.org/113221/\nScreenshots from China go viral: Covid-19 β type (mutant II) emerged https://gnews.org/113195/\nImpact of Cultural Revolution still continues https://gnews.org/109511/\n\nFeb 15\nAn internal document from the counter-epidemic team of the Wuhan government was leaked to the internet. The information is very disturbing that Wuhan needs more 100,000 beds for potential and confirmed coronavirus patients. https://gnews.org/114389/\nMiles Guo: Another outbreak is brewing in China https://gnews.org/114596/\nSudden Militarization Of Wuhan's P4 Lab Raises New Questions About The Origin Of The Deadly Covid-19 Virus\nhttps://www.zerohedge.com/geopolitical/sudden-militarization-wuhans-p4-lab-raises-new-questions-about-origin-deadly-covid-19\nhttps://www.zerohedge.com/economics/china-suddenly-has-another-major-virus-problem-soaring-food-prices-put-lid-central-bank\nA leaked WeChat audio from Shanghai says that there were 3000 new infections in just one day, which prompted the government to force-close most of the businesses.\nhttps://gnews.org/114052/\n\nFeb 17\nResearchers warn “the outbreak almost certainly cannot be contained and we must prepare for a pandemic\" \nhttps://www.zerohedge.com/technology/los-alamos-experts-warn-covid-19-almost-certainly-cannot-be-contained-project-44-million\nhttps://www.zerohedge.com/geopolitical/mysterious-origin-wuhan-coronavirus\nCCP’s National Health Commission Cover-up Coronavirus Outbreak On Purpose? https://gnews.org/115693\nP4 Lab Has A Strong Connection To PLA https://gnews.org/116609/\nCCP Forces Student to Donate Money to the Corrupted Red Cross, which is run by Vice President Wang Qishan, who is a Chinese top kleptocrat, has stolen more than 1000 billion USD from China.\nhttps://gnews.org/116377/\nMassive Animal-Corpse Incinerators Arrived in Wuhan https://gnews.org/116362/\n\nFeb 20. \nFrontline Doctor: “we are required to put political correctness first”\nA text alleged coming from a front line doctor showed that hospitals are ordered to make COVID19 patients discharged before they are fully cured. The purpose of doing this is to fabricate a well-looking ‘cure rate.’https://gnews.org/120158/\n\nFeb 21\nWUHAN P4 LABORATORY – A PART OF PANDORA’S BOX\nhttps://gnews.org/119075/\nHighlights of Novel Coronavirus Epidemic\nhttps://youtu.be/h1vxb6aRIPQ  https://youtu.be/5EvICR_u99o\nJapan fell victim to WHO; Prime Minister Abe’s reporter in quarantine\nhttps://gnews.org/119719/\nMunicipal Information Collection Platform for Epidemic Prevention\nhttps://gnews.org/119562/\nLocal Government’s Anti-CoronaVirus Discipline Leaked\nhttps://gnews.org/119311/\nLest We Forget: HK Civilians Mourned the Death of 15-year-old Student Chan Yin Lam\nhttps://gnews.org/119293/\n\nFeb 22\nBehind the Chinese government’s “Citizen Heros” propaganda, the inescapable reality\nhttps://gnews.org/119269/\nFace masks can not solve the problem. Elimination of the ccp is the cure\nhttps://gnews.org/121328/\nhttps://www.zerohedge.com/health/hubei-doctors-warn-even-deadlier-coronavirus-reinfection-causing-sudden-heart-attacks\nThere could be a biochemical weapon in HK, Miles revealed in June 2019\nhttps://youtu.be/sYwWELkXSqE\nDon't let China start dominating UN agencies \nhttps://asia.nikkei.com/Spotlight/Comment/Don-t-let-China-start-dominating-UN-agencies\n\nFeb 24\nWar Room Pandemic https://gnews.org/122446/\nMiles Guo: CCP is spreading the virus around the world https://gnews.org/122331/\nhttps://news.yahoo.com/with-information-from-china-scarce-us-spies-enlisted-to-track-coronavirus-173612656.html\nThe Devil’s Thug, Sun Lijun https://gnews.org/122772/\nCOVID-19 lockdown: desperation and starvation  https://gnews.org/122563/\nThe patients who were discharged from Wuhan Pneumonia shivered: Body was wrapped in four layers of bags before they were out of breath and they were directly cremated alive!\nhttps://gnews.org/123371/\nCOVID-19 autopsy report: a new case report study in Lancet Respir Med\nhttps://gnews.org/123201/\n\nFeb 27\nWuhan Coronavirus Pandemic Episode 32\nhttps://youtu.be/GDZyzp9fLXc\nSix-year-old spent three days with his dead grandpa\nhttps://gnews.org/124072/\nLate night of Wuhan  https://gnews.org/124098/\nThe Farm: The CCP is preparing to attack Taiwan\nhttps://gnews.org/124010/\nA vegetable garden infected by virus sewage\nhttps://gnews.org/124834/\nWuhan Coronavirus Pandemic Episode 33\nhttps://gnews.org/125213/\nHK Police Use Professional Cameras to Capture the Faces of Protesting Civilians\nhttps://gnews.org/124122/\nHong Kong arrests pro-democracy activists Jimmy Lai & Lee Cheuk-yan\nhttps://gnews.org/126189/\nCCP’s Nine-Level Media Control https://gnews.org/124675/\nForce Healthy People to Buy Traditional Chinese Medicine https://gnews.org/126344/\n\nFeb 29\nHK AFCD: Detection of low level of COVID-19 virus in pet dog  https://gnews.org/126819/\nWuhan Coronavirus Pandemic Episode 35  https://youtu.be/EaFzafh_b_c\nSpecial Ep 28- War Room: Pandemic  https://youtu.be/4pogUZEQiRo\nWhere are N95 masks? CCP wears it under another mask\nhttps://gnews.org/127188/\nFrance will be break out!\nTHE INFECTED IN HONG KONG ARE UP TO 20K!  \n\nMar 3\nThe secret behind “zero new novel coronavirus confirmed case” in China  https://gnews.org/130428/\nDanger Behind CCP’s COVID19 Data  https://gnews.org/130528/\n\nMar 5\nA document demanding that subordinates destroy data and information has been exposed\nhttps://gnews.org/131080/\nPepper Spray at Close-Range; HK Riot Police Ignores Fallen Woman https://gnews.org/130478/\nDanger Behind CCP’s COVID19 Data https://gnews.org/130528/\nRiot police accused of destroying Chow Tsz-lok’s altar https://gnews.org/129676/\nhttps://www.tagesspiegel.de/wissen/epidemie-experte-zur-bekaempfung-von-covid-19-das-coronavirus-ist-eine-beispiellose-globale-bedrohung/25604494.html\nFinal Battle of the CCP: the Biological Weapon for Unrestricted Warfare https://gnews.org/131657/\nCCP Order: GOV-Employees No Upload Coronavirus Related Videos https://gnews.org/131593/\n\nMar 6\nCCP Order: GOV-Employees No Upload Coronavirus Related Videos https://gnews.org/131593/ \nLung Transplantation to Treat COVID19! https://gnews.org/132575/\nCoronavirus Pandemic Episode https://gnews.org/132548/ https://gnews.org/132404/\n\nLest We Forget: Young protester calling Hongkongers to keep the rage and continue fighting\nIt has been six months since the 8.31 incident took place in 2019 where Hong Kong Police indiscriminately attacked civilians on MTR train in Prince Edward.\nA young girl was sighted on February 29 on a flyover near Tsuen Wan MTR station, wearing a gas mask, and showing photos of the 831 incident.\nShe called on the support from the public to join the memorial ceremony that would take place that evening. \nhttps://gnews.org/131490/\n\nMar 8\nCoronavirus Quarantine Hotel Collapsed Mysteriously in China https://gnews.org/132966/\nWuhan Coronavirus Pandemic Episode 43 https://gnews.org/133487/ https://gnews.org/133353/\nAsymptomatic patients not being marked ‘confirmed’ cases\nAccording to epidemic related regulations, only suspected and confirmed cases will be announced to the public. Asymptomatic patients should not be included, only if these patients experience symptoms during quarantine, they will be counted as confirmed cases.  https://gnews.org/134236/\n4 Months Since The Death of Chow Tsz-lok, A Suspected Victim Of Police Brutality: Stop And Search Everywhere  https://gnews.org/134408/\nMarch 8 Updates on CCP Coronavirus (COVID-19) Pandemic  https://gnews.org/134406/\nWuhan Coronavirus Pandemic Episode 44,  https://gnews.org/134316/\nThe secret behind “zero new novel coronavirus confirmed case” in China\nhttps://gnews.org/130428/\n\nMar 10\nThe CCP Ruling Hong Kong Like Mafia https://gnews.org/131647  https://gnews.org/135516\nHong Kong Microbiologist and SARS expert: Hospitals I visited in China planned for propaganda\nhttps://gnews.org/137669\nPandemic Episode 45,46\nhttps://gnews.org/137960  https://gnews.org/138097 https://gnews.org/137380/\n\nUS will be break out in 1-2 weeks!\n\nMar 13\nConflicting instructions from local government on work resumption https://gnews.org/138635/\nUpdates on CCP Coronavirus Pandemic https://gnews.org/138814/  https://gnews.org/139225/  https://gnews.org/139055/\n\nMar 16\nWuhan’s P4 Biosafety (Virus) Laboratory – Addendum https://gnews.org/140683/\nGuo’s Remark in 90 Seconds: Crises, World war 3 and CCP Demise https://gnews.org/141262/\nMiles Guo: Stop saying Coronavirus is flu and will go away in summer \nhttps://youtu.be/e4hXSzlOy_w  Current Situations and Future Effects https://gnews.org/142748/\nTO ALL HONGKONG-LOVING FIGHTERS https://gnews.org/142558/\nUpdates on CCP Coronavirus Pandemic  https://gnews.org/142761/ https://gnews.org/142559/\n\nMar 17\nhttps://www.zerohedge.com/political/more-coronavirus-censorship-social-media-companies-partner-who-censor-info\nhttps://www.worldtribune.com/mnuchin-says-imf-and-world-bank-funds-wont-repay-debts-to-china/\n\nMar 23\nHK Police Arrest District Councilor Lam Kin-Cheung and his assistant https://gnews.org/148786/\nMiles Guo: Five major organizations declare war against CCP (Part I) https://gnews.org/149862/\nwar on CCP starts today https://gnews.org/149747/\nThe CCP’s Biowarfare and The US’s Counterattack https://gnews.org/149873/\n\nMar 29\nWuhan Citizens: Whether the official figure is accurate or not, this is a political treatment, not medical treatment https://gnews.org/153834/\nPandemic Episode 63, Mar 27 https://gnews.org/155010/\n\nApr 2\nCCP’s obsession with gene editing as a weapon of mass destruction  https://gnews.org/158577/\nPeople Rush for Rice Storage in Hubei Province  https://gnews.org/158151/\nIs WHO Under CCP’s Control?  https://gnews.org/157407/\nApril 1 Updated on CCP Virus Pandemic https://gnews.org/159674/\nCCP Coronavirus Pandemic Episode 68 https://gnews.org/159616/\nMiles Guo: CCP keeps the US crippled; Hantavirus is next attack https://gnews.org/159315/\n\nApr 6\nMiles Guo: CCP keeps the US crippled; Hantavirus is next attack https://gnews.org/159315/\nFurther Erosion of Rights: Hong Kong Police Obtain Power of Search of Mobile Phones without Warrant\nhttps://gnews.org/160859/\nCoronavirus could survive on masks for 7 days; Ambient temperature affects the virus\nhttps://gnews.org/162258/\nThe World is in a War with CCP https://gnews.org/165474/\nThe first documentary movie on the origin of CCP virus(Coronavirus) https://gnews.org/165772/\n\nMay 11\nMiles: CCP virus is to kill Americans & white people by Communist International.\nA P3 lab in Hong Kong, which is a leading virology lab in the world for coronavirus related research. Collaborating with some Chinese researchers, the top three scientists in Hong Kong’s P3 lab are all from Sri Lanka. They are communist extremists affiliated with Communist International with the goal of killing Americans and white people... WHO is a criminal organization for its collusion with the CCP.  https://gnews.org/192190/\n\nScientific evidence and logic behind the claim that the Wuhan coronavirus is man-made\nhttps://nerdhaspower.weebly.com/ RaTG13-https://gnews.org/192144/\nIs CCP Really Showing Off Its Nuclear Weapon? https://gnews.org/198016/\nResist tyranny together: HK lawmakers and citizens are connected https://gnews.org/199092/\nPolice brutality in Hong Kong on Mother’s Day https://gnews.org/199613/\n\nJuly 10\nFox news: Chinese virologist accuses Beijing of hiding details on coronavirus https://www.youtube.com/watch?v=NUbrE1v4kuQ\nHong Kong scientist Dr. Li-Meng Yan believes the Chinese government knew about the novel coronavirus well before it claimed it did; reaction from Gordon Chang, author of 'The Coming Collapse of China.\n\nSep.15\nUnusual Features of the SARS-CoV-2 Genome Suggesting Sophisticated Laboratory Modification Rather Than Natural Evolution and Delineation of Its Probable Synthetic Route\nPublication date: Sep. 14, 2020  DOI:10.5281/zenodo.4028830 \npreview https://zenodo.org/record/4028830  \ndownload https://zenodo.org/record/4028830/files/The_Yan_Report.pdf\nAnd see also \"Fox news\"\n\nSep. 23  https://gop-foreignaffairs.house.gov/wp-content/uploads/2020/09/Final-Minority-Report-on-the-Origins-of-the-COVID-19-Global-Pandemic-Including-the-Roles-of-the-CCP-and-WHO-9.20.20-Coverpage.pdf\n\nOct. 8\nSARS-CoV-2 Is an UNRESTRICTED BIOWEAPON: A Truth Revealed through Uncovering a Large-Scale, Organized Scientific Fraud\nPublication date:Oct.8, 2020, DOI:10.5281/zenodo.4073131 \nPreview: https://zenodo.org/record/4073131 \nDownload: https://zenodo.org/record/4073131/files/The%202nd%20Yan%20Report.pdf\nThe scale and the coordinated nature of this scientific fraud signifies the degree of corruption in the fields of academic research and public health. As a result of such corruption, damages have been made both to the reputationof the scientific community and to the well-being of the global community. \nRecords indicate that the unleashing of this weaponized pathogen should have been intentional rather than accidental. We therefore define SARS-CoV-2 as an UNRESTRICTED BIOWEAPON and the current pandemic a result of UNRESTRICTED BIOWARFARE.\nSee also Steve Bannon’s \"War Room\"\n\nOct. 30\nCOVID Pandemic Began at PLA Hospital in Wuhan\nPublication date:Oct. 28, 2020, DOI:10.5281/zenodo.4119263\nPreview and download https://zenodo.org/record/4119263 \nA short presentation by the author explaining his research:\nFirst COVID-19 Genomic Patient Cluster was at PLA Hospital in Wuhan, China\nA video, 48M\nhttps://zenodo.org/record/4139432\n\n\nJan.15, 2021\nhttps://www.state.gov/fact-sheet-activity-at-the-wuhan-institute-of-virology/\n\nFeb.12 2021\nA Bayesian analysis concludes beyond a reasonable doubt that SARS-CoV-2 is not a natural zoonosis but instead is laboratory derived\nPreview and downoad https://zenodo.org/record/4477081\nA Chinese military university textbook, the Un-natural Origin of SARS-CoV and the Man-made Human Novel Virus as a Genetic Bioweapon published by the Chinese Military Medical Science Press (CMMSP) in 2015\nhttps://gnews.org/901853/\nDownload 1 https://drive.google.com/file/d/1ADB2jDpZ1okiXNFCnOxLIh3jVj_-4GKQ\n2 https://mega.nz/file/Ie5GCKYJ#qWO3kVFtc1SBc5Z952O2UhGvgzBiq0K86R44aNsyhaU\n\nJune 15, 2021\nThe Wuhan Laboratory Origin of SARS-CoV-2 and the Validity of the Yan Reports Are Further Proved by the Failure of Two Uninvited \"Peer Reviews\", 3rd Yan Report (Dr. Yan's twitter:  twitter.com/DrLiMengYAN1)\nDOI:10.5281/zenodo.4650821 \nhttps://zenodo.org/record/4650821/files/Combined_responses_1.pdf\nCNN Used Lies and Misinformation to Muddle the Water on the Origin of SARS-CoV-2\nhttps://zenodo.org/record/4283480/files/The_Yan_response_to_CNN.pdf\n\nReports on the origin of Coronavirus: ‘Smoking Gun’ proof of the Chinese biological weapon，\nhttps://timesofindia.indiatimes.com/blogs/ChanakyaCode/reports-on-the-origin-of-coronavirus-smoking-gun-proof-of-the-chinese-biological-weapon/\nhttps://www.zerohedge.com/covid-19/fauci-emails-reveal-damage-control-scramble-after-zerohedge-spotlights-man-made-covid-19\nDownload: https://assets.documentcloud.org/documents/20793561/leopold-nih-foia-anthony-fauci-emails.pdf\nDon't use any vaccine, they are UNSAFE ! Take hydroxychloroquine sulfate instead of it, cheap and safe! \n\nReferences, Discussion and Reports:\nEarly estimation of epidemiological parameters and epidemic predictions\nhttps://www.medrxiv.org/content/10.1101/2020.01.23.20018549v1\nhttps://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports/\nSteve Bannon’s \"War Room\"   https://warroom.org/   youtube channel https://www.youtube.com/channel/UCWVvSbEw0imVIT8hiDcNgcQ (banned)\nThe lancet, this hub page will house all articles, comments, and editorials that they receive in relation to 2019-nCoV, as and when CCP are published  https://www.thelancet.com/\nCDC: About 2019 Novel Coronavirus (2019-nCoV)\nhttps://www.cdc.gov/coronavirus/2019-ncov/about/index.html\nThe One Number That Could Reveal A Chinese Coronavirus Cover-Up \nhttps://www.zerohedge.com/geopolitical/one-number-could-reveal-chinese-coronavirus-cover\nCCP with BGY plan to control the world(BGY stands for  Blue, Gold and Yellow. Blue represents Internet and Media Control, Gold represents money and bribery is used to buy influence. Yellow represents the use of honey traps to compromise espionage targets.   CCP planned to control the world by choking the throats of the world leaders, politicians, media, academics and financial operators; and it had deeply invaded the US from within via this BGY in the past decades) 3 min. https://www.youtube.com/watch?v=qDfbyEj68QM\nCCP High-level Conspiracy – South Putuo Plan https://gnews.org/154565/\nIn 2017，Miles Guo first exposed the CCP’s deadly “3F plan”(Foment weakness, foment chaos and  foment the destruction of America.) against the US https://gnews.org/154724/\nSome videos\n1 https://livestream.com/accounts/27235681/events/8531480 \n2 Resilio sync key  BXHT3HMKBWBXEU4V7V7ORHAO5I2NFNEJ4\n3 youtube \"HK apple daily channel\"\nWUHAN P4 Biosafety LAB – A PART OF PANDORA’S BOX https://gnews.org/119075/\nWuhan’s P4 Lab – Addendum https://gnews.org/140683/\nChina Task Force Report - Committee on Foreign Affairs  https://gop-foreignaffairs.house.gov/blog/china-task-force-report/\n\n\nATTENTION: IF YOU HAVE ANY PROOF THAT THE VIRUS IS MAN MADE BY CCP OR PLA, PLEASE CONTACT U.S. GOV , ICIJ (INTERNATIONAL CONSORTIUM OF INVESTIGATIVE JOURNALISTS) OR GNEWS.ORG\n\nDon't use any vaccine, they are UNSAFE ! Take hydroxychloroquine sulfate instead of it, cheap and safe! ",
			"added": 1579853710
		},
		{
			"topic_id": 1580047031,
			"title": "Brief Summary of Evidence of Lab-Made 2019 nCoV",
			"body": "https://gnews.org/89737/\nThere are a lot of official news and poor-quality academic articles from end of last Dec show that no evidence about wild animals in Huanan seafood market as intermediate host for 2019 nCoV (which can be explained in a detail way later). Hence, one hypothesis of lab-made 2019 nCoV is recombined with SARS RBD of S protein (to human ACE2 gene), based on ZS bat-CoV (esp. MG772933.1), going through in vitro and in vivo adaptation and amplification in a limited range in the lab, generated an ideal strain (2019 nCoV) with effective RBD, while the other comparable conserved sequence did not change much, or even without any change (E protein). Since stock virus kept in culture media at -80 ℃, slowly thaw it on ice could help the virus released in the environment better.\nDownload\nhttps://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/01/25133703/Brief-summary-of-evidence-of-lab-finish.pdf",
			"added": 1580046966
		},
		{
			"topic_id": 1580186317,
			"title": "CORONAVIRUS BIOWEAPON – HOW CCP STOLE CORONAVIRUS FROM CANADA AND WEAPONIZED IT!",
			"body": "https://greatgameindia.com/coronavirus-bioweapon\n\nRace to develop coronavirus vaccine\nhttps://www.uq.edu.au/news/article/2020/01/race-develop-coronavirus-vaccine\n\nA SARS-like cluster of circulating bat coronaviruses shows potential for human emergence,published Nov.9, 2015 by Chinese researcher  \nhttps://www.nature.com/articles/nm.3985\n\n",
			"added": 1580186251
		},
		{
			"topic_id": 1580221750,
			"title": "It is time to use information hiding tech for against police censor in China, for Chinese people ",
			"body": "For example use Steghide\nSteghide is a steganography program that is able to hide data in various kinds of image- and audio-files. The color- respectivly sample-frequencies are not changed thus making the embedding resistant against first-order statistical tests. \ncompression of embedded data\nencryption of embedded data\nembedding of a checksum to verify the integrity of the extraced data\nsupport for JPEG, BMP, WAV and AU files\nhttps://sourceforge.net/projects/steghide/files/steghide/0.5.1/steghide-0.5.1-win32.zip\nmore tools please google it, keep robust safe",
			"added": 1580221683
		},
		{
			"topic_id": 1580270036,
			"title": "Steve Bannon’s “War Room”",
			"body": "Economic Nationalism is the belief that every policy enacted by the federal government should be for the betterment of the citizens of our country. We call it Maximizing Citizenship Value.\n\"We’re going to maximize the value of citizenship. We’re going to maximize citizenship value. If you’re an American citizen, you get a special deal. I don’t care if you’re Jewish, Christian, Muslim, Hindu, or nothing.  It doesn’t matter if you’re black, white, red, pink, green. I do not care. If you’re an American citizen, you get a better deal.” – STEPHEN K. BANNON\nhttps://warroom.org/ youtube channel https://www.youtube.com/channel/UCWVvSbEw0imVIT8hiDcNgcQ",
			"added": 1580269968
		},
		{
			"topic_id": 1580289800,
			"title": "Now it is confirm that this cornovavirus was weaponized by CCP, vaccine had been developed a long time",
			"body": "Chinese gov's army PLA made this virus and spread several times from Oct to Dec in 2019, and they were already developed vaccine in several months ago. The Chinese gov CCP's original goal was to use the virus to infect selective people in Hong Kong, so that the CCP could use it as an excuse to impose martial law there and ultimately crush the HK pro-democracy movement. But it backfired terribly. And they vainly hope to great reduce their population so that can resolve the Chinese social contradiction and save political power! And then full controlling all of their people even the world for ever! But they didn't dare!\n\nThese truth from the internal of CCP!\nsome proof\n1 Jan 29.2020. Is the coronavirus developed by the CCP’s P4 lab used for biological warfare? The CCP wants to use climate war, biological war, and geographical war to recover Taiwan. When it kills half of the Taiwanese,it will belong to Beijing!\nhttps://youtu.be/kOyMej5Nv7M\n2 Steve Bannon’s 'War Room' https://www.youtube.com/channel/UCWVvSbEw0imVIT8hiDcNgcQ\n3 CORONAVIRUS BIOWEAPON – HOW CCP STOLE CORONAVIRUS FROM CANADA AND WEAPONIZED IT!\nhttps://greatgameindia.com/coronavirus-bioweapon\n4 A SARS-like cluster of circulating bat coronaviruses shows potential for human emergence,published Nov.9, 2015 by Chinese researcher  https://www.nature.com/articles/nm.3985\n5 Coronavirus – The biological weapons developed by China’s P4 lab!  https://youtu.be/kOyMej5Nv7M\n6 Coronavirus envelope protein: current knowledge (The new coronavirus's envelope Protein is nearly exact like with the virus's from Zhoushan bat, and ORF8 gene 94.21% be similar with each other. This is not envelop ) https://virologyj.biomedcentral.com/articles/10.1186/s12985-019-1182-0\n7 DNA sleuths read the coronavirus genome, tracing its origins and looking for dangerous mutations\nhttps://www.statnews.com/2020/01/24/dna-sleuths-read-coronavirus-genome-tracing-origins-and-mutations/ \n8 Uncanny similarity of unique inserts in the 2019-nCoV spike protein to HIV-1 gp120 and Gag https://www.biorxiv.org/content/10.1101/2020.01.30.927871v1.full.pdf \n9 CCP ordered Guo Deyin to create Wuhan coronavirus  https://gnews.org/101782/  \nphoto  https://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/02/03204107/IMG_6644-2-1.jpg\n10 Creator Of US BioWeapons Act Says Coronavirus Is Biological Warfare Weapon\nDr. Francis Boyle believes the virus is potentially lethal and an offensive biological warfare weapon or dual-use biowarfare weapons agent genetically modified with gain of function properties, which is why the Chinese government originally tried to cover it up and is now taking drastic measures to contain it.\nhttps://www.zerohedge.com/health/creator-bioweapons-act-says-coronavirus-biological-warfare-weapon\n11 (Apr 4 2018)Fatal swine acute diarrhoea syndrome caused by an HKU2-related coronavirus of bat origin\nhttps://www.nature.com/articles/s41586-018-0010-9\n12 Frank Plummer – Canadian Scientist Key To Coronavirus Investigation Assassinated In Africa?\nhttps://greatgameindia.com/frank-plummer-canadian-lab-scientist-key-to-coronavirus-investigation-assassinated/\n13 Cryo-EM Structure of the 2019-nCoV Spike in the Prefusion Conformation\nhttps://www.biorxiv.org/content/10.1101/2020.02.11.944462v1\n14 Russian Ministry of Heath proves COVID-19 to be “man-made”\nhttps://gnews.org/121400/ https://gnews.org/121480/  https://rosminzdrav.ru\n\n\nThe Enveloped proteins of a natural mutation die off, nearly impossible for them not to, this virus is showing signs not only are the proteins staying intact, but getting stronger. The method of how quick it spreads is also a sign of how man made this virus really is.\n\nJuly 14th 2019: Chinese spy kicked out of Canada for sbeing caught smuggling Virus samples and trying to send them to Wuhan Facilities. The facility in Canada that was breached was also a BSL-4 lab. National Microbiology Laboratory in Winnipeg, CA. one of only a few in North America equipped to handle the world’s deadliest diseases, including Ebola, SARS, Coronavirus, etc.\nOct 2019: Gates Foundation speaks on combating Corona Viruses.\nJan 2020: Corona Virus Outbreak in Wuhan Area, 8-20 miles from the only 2 BSL-4 labs in China.  \nCCP in China arresting people trying to warn of this potential outbreak that will occur. \nThe 2 BSL-4 labs have connections to Bio-weapons Research programs/Warfare agencies in Bejing. \n\nUPDATED: Scientific Research Shows 2019-nCov is Man made\nhttps://gnews.org/97392/  Author:  twitter @halliburton50\n\nJuly 10,2020\nFoxox news: Chinese virologist accuses Beijing of hiding details on coronavirus\nhttps://www.youtube.com/watch?v=NUbrE1v4kuQ\nHong Kong scientist Dr. Li-Meng Yan believes the Chinese government knew about the novel coronavirus well before it claimed it did; reaction from Gordon Chang, author of 'The Coming Collapse of China.\n\nSep.15\nUnusual Features of the SARS-CoV-2 Genome Suggesting Sophisticated Laboratory Modification Rather Than Natural Evolution and Delineation of Its Probable Synthetic Route\nPublication date: Sep. 14, 2020 DOI:10.5281/zenodo.4028830\npreview https://zenodo.org/record/4028830\ndownload https://zenodo.org/record/4028830/files/The_Yan_Report.pdf\nAnd see also \"Fox news\"\n\nOct.8 \nThe 2nd Yan report:\nSARS-CoV-2 Is an UNRESTRICTED BIOWEAPON: A Truth Revealed through Uncovering a Large-Scale, Organized Scientific Fraud\nPublication date:Oct.8, 2020, DOI:10.5281/zenodo.4073131 \nPreview: https://zenodo.org/record/4073131 \nDownload: https://zenodo.org/record/4073131/files/The%202nd%20Yan%20Report.pdf\n\nJun.15, 2021\nThe Wuhan Laboratory Origin of SARS-CoV-2 and the Validity of the Yan Reports Are Further Proved by the Failure of Two Uninvited \"Peer Reviews\", 3rd Yan Report (Dr. Yan's twitter: twitter.com/DrLiMengYAN1)\nDOI:10.5281/zenodo.4650821\nhttps://zenodo.org/record/4650821/files/Combined_responses_1.pdf\nCNN Used Lies and Misinformation to Muddle the Water on the Origin of SARS-CoV-2\nhttps://zenodo.org/record/4283480/files/The_Yan_response_to_CNN.pdf\n\nReports on the origin of Coronavirus: ‘Smoking Gun’ proof of the Chinese biological weapon，\nhttps://timesofindia.indiatimes.com/blogs/ChanakyaCode/reports-on-the-origin-of-coronavirus-smoking-gun-proof-of-the-chinese-biological-weapon/\nhttps://www.zerohedge.com/covid-19/fauci-emails-reveal-damage-control-scramble-after-zerohedge-spotlights-man-made-covid-19\nDownload: https://assets.documentcloud.org/documents/20793561/leopold-nih-foia-anthony-fauci-emails.pdf\n\nEvidence proving:\n1.the RaTG13 virus is fraudulent and does not exist in nature,SARS-CoV-2 and RaTG13 could not relate to each other through natural evolution and at least one must be artificial.\n2.recently published pangolin coronaviruses are fraudulent and do not exist in nature\n3.the fraudulent nature of the novel bat coronavirus RmYN02\n4.All fabricated coronaviruses share a 100% amino acid sequence identity on the E protein with ZC45 and ZXC21,so that the novel coronaviruses recently published by the CCP-controlled laboratories are all fraudulent and do not exist in nature!\nThe scale and the coordinated nature of this scientific fraud signifies the degree of corruption in the fields of academic research and public health. As a result of such corruption, damages have been made both to the reputation of the scientific community and to the well-being of the global community. \nRecords indicate that the unleashing of this weaponized pathogen should have been intentional rather than accidental. We therefore define SARS-CoV-2 as an UNRESTRICTED BIOWEAPON and the current pandemic a result of UNRESTRICTED BIOWARFARE. \n\nTHE TIME HAS COME THAT THE WORLD FACES THE TRUTH OF COVID-19 AND TAKES ACTIONS TO SAVE THE FUTURE OF HUMANITY. \n\nThe remaining question is whether the CCP leaked the virus on purpose as a desperate attempt to stay in power. There is no final conclusion yet, but the CCP acted suspiciously before, during and after the first case of Wuhan pneumonia:\nWang Qishan visited Wuhan secretly during the time of the first “sign” of the deadly virus.\nThe Chinese top kleptocrats like Han Zheng did not respond to any early reports of the mysterious Wuhan pneumonia sent by the government of Hubei province.\nCCP deliberately covered up and delayed the reporting and containment of the mysterious pneumonia.\nThe Chinese kleptocrat Wang Qishan, the Vice President of China, told his friend confidently that the outbreak would end in February while the epidemic is spreading out of control.\nCCP deliberately abandon the residents, patients and medical staff at the epicenter without providing food, medical supplies or protective gear.\nThe Chinese top kleptocrats handle the outbreak with a nonchalant attitude. Instead of talking or acting in ways to show concerns, they were celebrating Chinese New Year as if nothing has happened.\nCCP has not done a lot to reduce the spread of the disease except for sending military forces to prevent people from escaping their cities or villages on lockdown.\nAllows the fear to spread nationally and internationally to create an almost doomsday-like scene.\nRejected aid, monitoring, donation or assistance from the WHO to keep the epidemic in a black box.\n\nPlease spread this truth to the internet !  \nThank you!",
			"added": 1580289731
		},
		{
			"topic_id": 1580538058,
			"title": "Uncanny similarity of unique inserts in the 2019-nCoV spike protein to HIV-1 gp120 and Gag",
			"body": "They found 4 insertions in the spike glycoprotein (S) which are unique to the 2019-nCoV and are not present in other coronaviruses. Importantly, amino acid residues in all the 4 inserts have identity or similarity to those in the HIV-1 gp120 or HIV-1 Gag.\nThis another proof that the virus is man made in lab!\nfuck!\nhttps://www.biorxiv.org/content/10.1101/2020.01.30.927871v1.full.pdf",
			"added": 1580537988
		},
		{
			"topic_id": 1581391651,
			"title": "WANTED CHINESE PLA HACKER MEMBERS, 54th RESEARCH INSTITUTE",
			"body": "https://www.fbi.gov/wanted/cyber/chinese-pla-members-54th-research-institute\nThe PLA hackers obtained names, birth dates, and social security numbers for approximately 145 million American citizens, in addition to driver’s license numbers for at least 10 million Americans stored in Equifax’s databases. The hackers also collected credit card numbers and other personally identifiable information belonging to approximately 200,000 American consumers.\nChinese Military Personnel Charged with Computer Fraud, Economic Espionage and Wire Fraud for Hacking into Credit Reporting Agency Equifax \nhttps://www.justice.gov/opa/pr/chinese-military-personnel-charged-computer-fraud-economic-espionage-and-wire-fraud-hacking\n\nHUAWEI HACKING CISCO’S SOURCE CODE\nhttps://spark.adobe.com/page/xzZOL108nDJYW/\nSTEALING MOTOROLA'S WIRELESS TECHNOLOGY \nhttps://spark.adobe.com/page/8mw0cJy5rKxLP/\nFBI: 1000 investigations open into CCP technology theft\nhttps://youtu.be/Z6taJX2TyYo",
			"added": 1581391580
		},
		{
			"topic_id": 1581391858,
			"title": "请记下你身边的反人类犯罪信息，这必须作为审判施虐者的证据",
			"body": "记下自己所经历的武汉肺炎疫情中所有的反人类罪的受害者信息和施虐者信息，他们必须接受审判！我相信最先接受审判的就是对包括李文亮医生在内的八名医生进行训诫的警察，他们必须接受审判！\n在香港新疆西藏全国范围内对同胞施虐的警察和政府官员及他们的爪牙，他们必须接受审判！",
			"added": 1581391786,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1581392126,
			"title": "传播疫情真相 ，保留企业尤其国企要求复工的证据，时刻准备革命，推翻暴政！",
			"body": "传播疫情真相，积蓄力量，拉拢官员公安军官加入，上街革命！打开GFW, 实时公开疫情真相！2月29号疫情分水岭！",
			"added": 1581392053,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1581571268,
			"title": "公检法人员请悬崖勒马，站在正义一边，站在群众一边，为子女家人前途考虑",
			"body": "莫助纣为虐",
			"added": 1581571194,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1582170690,
			"title": "Chinese gov will force people to return to work, and coronavirus will spread to the world",
			"body": "CCP has been waged biological warfare to the world!\nhttps://gnews.org/117831/ \nhttps://youtu.be/sQlEpu_HsWE\nWuhan Covid19 SOS: “The CCP wants to kill us all!”\nhttps://gnews.org/118600/",
			"added": 1582170615
		},
		{
			"topic_id": 1582170971,
			"title": "2月29日是武汉疫情的分水岭，别上班，躲深山",
			"body": "2月18日郭文贵先生直播\nhttps://youtu.be/Jj_SSnsRwIc",
			"added": 1582170895,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1584764363,
			"title": "COVID-19 is short for Communist Outputs Virus In December 2019",
			"body": "Miles Guo: It is CCP(Chinese gov) coronavirus, not Chinese coronavirus!\nhttps://gnews.org/146158/\nChinese people not equal to CCP,  Chinese people has been slaved and brainwashed by CCP for more than 70 years ! \n\n/Talk.ZeroNetwork.bit/?Topic:1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg/Now+it+is+confirm+that+this+cornovavirus+was+weaponized+by+CCP+vaccine+had+been+developed+a+long+time\n/Talk.ZeroNetwork.bit/?Topic:1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg/Wuhan+corona+virus+2019+nCoV",
			"added": 1584764286
		},
		{
			"topic_id": 1585107976,
			"title": "The Secrets of Inty who is a traitor to Xinjiang China",
			"body": "This guy became famous because of Miles Guo. He claims that he was repressed by the CCP and fled from China. He came to America and has been an anti-CCP activist in the US. Here comes the question, is he really anti-CCP?\nhttps://gnews.org/150246/",
			"added": 1585107898
		},
		{
			"topic_id": 1624870994,
			"title": "BIOCHEMICAL WARFARE WARNING: the chinese gov (CCP) will probably release a new virus and chemical weapon in the west , and then invade Taiwan",
			"body": "The CCP is attempting soon, probably around the end of this summer and the beginning of this fall to release a coronavirus in the US and the West once again, and they will have to invade and annex Taiwan to divert the world’s attention from the virus to Taiwan so that no one would talk about the virus anymore!\nhttps://gnews.org/1350988/",
			"added": 1624870915
		}
	],
	"topic_vote": {
		"1574289293_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 119,
	"comment": {
		"1549466563_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 1,
				"body": "right",
				"added": 1549872452
			}
		],
		"1555597236_17wLdSCG2t81bg2Xn6ucimm4s1B82ytghG": [
			{
				"comment_id": 2,
				"body": "求助他主子，看看主人会不会帮他",
				"added": 1555665785
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 3,
				"body": "The CCP is craying!\nOn August 11: The CCP’s madness responds to the new tricks of Hong Kong’s peaceful march, which is to create a large number of fake news in China ,peoples in China have deceived day by day !\nOn August 12, Hong Kong police violently cleared the scene!\nLast night, the situation in Hong Kong was seriously upgraded. The Hong Kong Communist Party’s police officers fought against the people to carry out a strong clearance within the plan. Most people were injured and arrested.",
				"added": 1565600473
			}
		],
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 4,
				"body": "In china it is a prison and always teaching how great the CCP is,you must love your country and government! These prison school from kindergarten to college,repeat these teaching again and again!",
				"added": 1566294007
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "The Chinese users use distributed communications I2p or mixture tec shandowsocksR  ,v2ray and so on to escape  the detected by GFW",
				"added": 1569217098
			},
			{
				"comment_id": 8,
				"body": "> [xcape2net](#comment_411_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Is all that independent of ZeroNet, or are they using ZeroNet plugins for that?\n\nindependent ,used for network proxy",
				"added": 1569302985
			}
		],
		"1569215330_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "> [randomshits](#comment_161_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Petitions have never been beneficial even when it has concerned American citizens, I highly doubt one will be effective as it related to the citizens of Hong Kong.\n\nit is honey pot for CCP,they must be hack the number of signatures ,and then the US government will clearly known how the CCP made war on net and social media.",
				"added": 1569217837
			}
		],
		"1569297597_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 7,
				"body": "> [ratsmack](#comment_79_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Your link is bogus.\n\nor you can visit youtube and searching wenguiguo channel to view it",
				"added": 1569302745
			},
			{
				"comment_id": 9,
				"body": "> [aspidochelone](#comment_212_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The link isn't bogus if you know to take \"</span>\" out of your links when you see it.  But the video is something like 2 hours long and I don't have the patience for 2 minutes of video usually.  If something's legit they put it in text.\n\nnow it can be accessed",
				"added": 1569390426
			}
		],
		"1560257686_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 10,
				"body": "想要正义、自由、民主、幸福、安全的未来就必须团结一切可团结的力量，何况当年中共也是建立民主自由统一战线团结一致，借助苏联支持才夺取的政权。国际社会的力量包括但不限于美国的支持和国内外的团结一致是决胜中共集权统治的关键！！！任何破坏民主自由的个人或集团都必须被消灭，任何封建专制独裁人的都必须被打倒，权力必须被约束起来。这是中共当年的目标，如今拿来灭掉灭掉独裁中共最合适不过了。公平法治开放的社会，民主自由的思想可以防止政权走向独裁，\n任何镇压学生的人都没有好下场，任何独裁政权都必须被人民消灭，毛腊肉的语录是灭掉中共独裁的有力武器",
				"added": 1569735795
			}
		],
		"1569934923_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 11,
				"body": "> [niggajones](#comment_3_1HHdE1Y1sreeMDp9zmUdVDtGMJhNVn8c3e): 38mm pistol? You sure the gooks regularly carry pistols that shoot bullets the size of grenades?\n\n3.8 sorry :b",
				"added": 1570594664
			},
			{
				"comment_id": 12,
				"body": "> [insmniak0](#comment_4_17kJatnNVnxmsCXBCjPP7n52m7dGiBLbKC): Fuck the PRC.\n\nYes!they make wars on traditional media ,cyber space, economy ,and other area ,the people no matter from which country who supported to Hong Kong  will be resist! like NBA APPLE and so on...\nThe Chinese  who supported to Hong Kong will be arrested even to be killed!",
				"added": 1570595463
			}
		],
		"1571103378_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu": [
			{
				"comment_id": 13,
				"body": "Please make sure your network does not forbidden  trackers,and add some trackers",
				"added": 1571118298
			}
		],
		"1571092087_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu": [
			{
				"comment_id": 14,
				"body": "Lantern vpn ? It is probable a spy ware by Chinese gov",
				"added": 1571118736
			},
			{
				"comment_id": 16,
				"body": "> [zly707](#comment_3_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu): Is there a suitable VPN software?\n\nv2ray, ShandowSocksR, I2P, Tor",
				"added": 1571385624
			}
		],
		"1571110186_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 15,
				"body": "The CCP is Nazi party(Chinazi),they do everything what ever German Nazi  did.\nhttps://qz.com/1715719/hong-kong-protesters-defend-their-use-of-nazi-imagery/\n“Making this term ‘Chinazi’ is to send a warning to the world: if we do not stop the CCP (Chinese Communist Party), the deaths and the tragedies will probably keep happening,” he said. “The victims may not only be the Chinese people, the Hongkongers, the Taiwanese, but may be you. The history of German Nazi surely repeat itself.”",
				"added": 1571380234
			}
		],
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 17,
				"body": "Many people do not know how nuts and how evil the CCP is，they want to control all over the world,and then human will be in slavery, just like Chinese and most African,or even wicked.",
				"added": 1572416327
			}
		],
		"1572469463_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 18,
				"body": "Brazil is controlled by Chinese gov. CCP spend huge money bought Brazil gov",
				"added": 1572586149
			},
			{
				"comment_id": 19,
				"body": "Notepad++ 7.7.1 : https://notepad-plus-plus.org/news/v781-free-uyghur-edition/\nPeople will tell me again to not mix politics with software/business. Doing so surely impacts the popularity of Notepad++: talking about politics is exactly what software and commercial companies generally try to avoid. The problem is, if we don’t deal with politics, politics will deal with us. We can choose to not act when people are being oppressed, but when it’s our turn to be oppressed, it will be too late and there will be no one for us. You don’t need to be Uyghur or a Muslim to act, you need only to be a human and have empathy for our fellow humans.\nSome actions you can take to help them: https://concernedscholars.home.blog/",
				"added": 1572587675
			},
			{
				"comment_id": 20,
				"body": "> [lesterpolsfuss](#comment_1_1ggpqHhQgV9udHiHNjbmbhEyvm7i5PfnY): How do I know he's not taken the actions he find necessary and scans my open documents for anti-Uyghur text? [...]\n\nYou can use Process Monitor(Sysinternals Procmon) to find out which files was read and wrote.",
				"added": 1572671682
			}
		],
		"1572672000_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 21,
				"body": "1. HONG KONG 🇭🇰 (112)\nTime: 15:00\nLocation: Victoria Park\n=============\n2. London, UK 🇬🇧 (112)\nTime: 14:00\nLocation: Marble Arch to Trafalgar Square\nhttps://www.facebook.com/events/489366855127231/\n=============\n3. Nottingham, UK 🇬🇧 (112)\nTime: 11:00\nLocation: Brian Clough Statue\nhttps://www.facebook.com/events/668580250332653/\n=============\n4. Sheffield, UK 🇬🇧 (112)\nTime: 13:00\nLocation: Sheffield Train Station\nhttps://www.facebook.com/events/703634186794315/\n=============\n5. Edinburgh, UK 🇬🇧 (112)\nTime: 13:00\nLocation: Iron Duke\nhttps://www.facebook.com/events/823782488041561/\n=============\n6. Exeter, UK 🇬🇧 (112)\nTime: 14:00\nLocation: Outside H&M, Bradford Street near High Street\nhttps://www.facebook.com/events/1189735231235698/\n=============\n7. Tokyo, JAPAN 🇯🇵 (112)\nTime: 12:00\nLocation: Yoyogi Park 代々木公園, Shibuya\nhttps://www.facebook.com/events/2461875570528594/\n=============\n8. Calgary, CANADA 🇨🇦 (112)\nTime: 13:00\nLocation: Calgary City Hall Front Plaza (800 Macleod Trail SE)\nhttps://www.facebook.com/…/pb.248795358826…/950690541970132/\n=============\n9. Vancouver, CANADA 🇨🇦 (112)\nTime: 14:00\nLocation: North Plaza, Library Square\nhttps://www.facebook.com/events/945125945885883/\n=============\n10. Toronto, CANADA 🇨🇦 (112)\nTime: 15:00\nLocation: Nathan Phillips Square\nhttps://www.facebook.com/events/2768817569804707/\n=============\n11. Winnipeg, CANADA 🇨🇦 (112)\nTime: 14:00\nLocation: Manitoba Legislative Building\nhttps://www.facebook.com/events/493252234595553/\n=============\n12. Montreal, CANADA 🇨🇦 (3 Nov)\nTime: 14:00 (3 Nov)\nLocation: 2140 Rue Grand Trunk\nhttps://www.facebook.com/events/479496422664318/\n=============\n13. Victoria, CANADA 🇨🇦 (112)\nTBA\n=============\n14. Edmonton, CANADA 🇨🇦 (112)\nTBA\n=============\n15. St. John’s, CANADA 🇨🇦 (112)\nTBA\n=============\n16. Regina, CANADA 🇨🇦 (112)\nTBA\n=============\n17. Ottawa, CANADA 🇨🇦 (112)\nTBA\n=============\n18. Washington DC, USA 🇺🇸 (112)\nTime: 14:00\nLocation: Lafayette Square\nhttps://www.facebook.com/events/388038415482178/\n=============\n19. Los Angeles, USA 🇺🇸 (112)\nTime: 10:00\nLocation: Orange Grove Park\nhttps://www.facebook.com/events/514120499427186/\n=============\n20. San Francisco, USA 🇺🇸 (112)\nTime: 14:00\nLocation: Embarcadero Plaza-West\nhttps://www.facebook.com/events/1000683840323897/\n=============\n21. Boston, USA 🇺🇸 (112)\nTime: 14:00\nLocation: City Hall Plaza\nhttps://www.facebook.com/events/933574173667696/\n=============\n22. New York, USA 🇺🇸 (112)\nTime: 13:00\nLocation: Barclay’s Center\nhttps://www.facebook.com/events/559807738121750\n=============\n23. San Diego, USA 🇺🇸 (112)\nTime: 14:00\nLocation: Bea Evenson Fountain\nhttps://www.facebook.com/events/488074615113264/\n=============\n24. Seattle, USA 🇺🇸 (112)\nTime: 16:00\nLocation: Pike Place Market\nhttps://www.facebook.com/events/553956068510290/\n=============\n25. Chicago, USA 🇺🇸 (1 Nov)\nTime: 17:00 (1 Nov)\nLocation: 401 N Michigan Ave\nhttps://www.facebook.com/events/420774742152659/\n=============\n26. Sydney, AUSTRALIA 🇦🇺 (112)\nTime: 13:30\nLocation: State Library of New South Wales\nhttps://www.facebook.com/events/1433828236777026/\n=============\n27. Brisbane, AUSTRALIA 🇦🇺 (112)\nTime: 15:00\nLocation: Brisbane Speaker's Corner\nhttps://www.facebook.com/events/2346225659025229/\n=============\n28. Perth, AUSTRALIA 🇦🇺 (112)\nTime: 14:00\nLocation: Elizabeth Quay\nhttps://www.facebook.com/events/2634281746617999/\n=============\n29. Melbourne, AUSTRALIA 🇦🇺 (112)\nTime: 12:00\nLocation: State Library of Victoria\nhttps://www.facebook.com/events/2611075385646698/\n=============\n30. Adelaide, AUSTRALIA 🇦🇺 (3 Nov)\nTime: 14:30 (3 Nov)\nLocation: Rundle Mall\nhttps://www.facebook.com/events/2421379454804467/\n=============\n31. Paris, FRANCE 🇫🇷 (112)\nTime: 18:00\nLocation: Place du Châtelet\nhttps://www.facebook.com/events/1325289267631740\n=============\n32. Frankfurt, GERMANY 🇩🇪 (112)\nTime: 14:00\nLocation: Paulsplatz\nhttps://www.facebook.com/events/403505340589368/\n=============\n33. Hamburg, GERMANY 🇩🇪 (112)\nTBC\n=============\n34. Cologne, GERMANY 🇩🇪 (112)\nTBC\n=============\n35. Berlin, GERMANY 🇩🇪 (112)\nTime: 13:00\nLocation: Alexanderplatz Berlin\nhttps://www.facebook.com/events/2269390139982649/\n=============\n36. Auckland, NEW ZEALAND 🇳🇿 (112)\nTime: 14:00\nLocation: Aotea Square\nhttps://www.facebook.com/events/2363716303864341/\n=============\n37. Christchurch, NEW ZEALAND 🇳🇿 (112)\nTime: 11:00\nLocation: Bridge of Remembrance\nhttps://www.facebook.com/events/455638551964059/\n=============\n38. Taipei, TAIWAN 🇹🇼 (112)\nTime: 15:00\nLocation: Taipei Main Station Plaza 臺北車站 站前廣場\nhttps://www.facebook.com/events/546361469270644/\n=============\n39. Brussels, BELGIUM 🇧🇪 (112)\nTime: 14:00\nLocation: in front of Hilton Brussels Grand Place\nhttps://www.facebook.com/events/1227680067415741/\n=============\n40. Pretoria, SOUTH AFRICA 🇿🇦 (112)\nTBC\n=============\n41. Oslo, NORWAY 🇳🇴 (112)\nTime: 14:00\nLocation: Vettakollen Viewpoint, Gulleråsveien\nhttps://www.facebook.com/events/1081552285570737/\n=============\n42. Seoul, SOUTH KOREA 🇰🇷 (112)\nTime: 18:00\nLocation: Hongik University Station EXIT 9\nhttps://www.facebook.com/events/976654246017737\n=============\n43. Copenhagen, DENMARK 🇩🇰 (112)\nTime: 14:00\nLocation: Kongens Nytorv\nhttps://www.facebook.com/events/2341672679476812/\n=============\n44. Barcelona, SPAIN 🇪🇸 (112)\nTBC\n=============\n45. Rio de Janeiro, BRAZIL 🇧🇷 (112)\nTime: 10:00\nLocation: Posto 5 - Copacabana - Av. Atlantica\nhttps://www.facebook.com/events/2841743882553147/",
				"added": 1572672998
			}
		],
		"1573186132_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 22,
				"body": "> [nukebrazil](#comment_1_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5): Pretty words, but if you want to show some serious commitment to that end: NUKE BRAZIL.\n\nThx, the Brazil gov, CCP and so on is the most wicked evils in the world,they want to control of and enslave all humans!",
				"added": 1573190464
			},
			{
				"comment_id": 23,
				"body": "Hong Kong news:(Hong Kong is an example to show how wicked the CCP is ! If we do not beat the communist, all humans will be in poor and slaved ! )\n8th Nov- Hong Kong police claims to pop champagne to celebrate the death of the recently passed away student Hong Kong University of Science and Technology (HKUST）22-year-old Chow Tsz Lok died in hospital on Friday morning after four days in hospital. Netizens initiated a 8 PM memorial service at nearly 30 locations in Hong Kong, Police were held responsible for the delay in treatment after Chow was found to have suffered a severe head injury after falling from a building.",
				"added": 1573268480
			}
		],
		"1573734530_17Tr1vdXC29zwecUt2pyPNMcHsqpJt8Xfj": [],
		"1573917795_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 25,
				"body": "Keep alive for this topic",
				"added": 1573959438
			}
		],
		"1573908669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 26,
				"body": "This bookstore may help Hong Kong people\n\nhttp://b2fxrnttdue72ntq.onion/\nWHEN TYRANNY BECOMES LAW, RESISTANCE BECOMES DUTY\nCCP insidiously causing chaos in Hong Kong to justify military intervention.\nThe CCP's special army was in Hong Kong!\n\nIf you love freedom, please spread these ebooks to Hong Kong and other people who need it!\nIf you have useful resources, please paste them, you can use \"OnionShare\" to share it!\nThx !",
				"added": 1574049794
			}
		],
		"1574141799_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 28,
				"body": "> [mfs](#comment_64_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Did I mess it? It's 8:30 EST.\n\nNew York time ,you can watch replay.",
				"added": 1574255009
			},
			{
				"comment_id": 29,
				"body": "It is living:\nhttps://www.youtube.com/watch?v=RAQvqtpT0EA",
				"added": 1574255464
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 30,
				"body": "> [edgelordofdecent](#comment_264_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Could I download the source code somewhere?\n\nI don't know, maybe you can ask the administrator of these sites.",
				"added": 1574402137
			},
			{
				"comment_id": 32,
				"body": "> [edgelordofdecent](#comment_266_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I just wanted to know for mi rroring purposes.\n\nFor mirroring ? These html source code can be viewed in \"web developer\"--\"page source\" , is that yours?",
				"added": 1574604295
			}
		],
		"1574529308_1MFJwynRwEkS2vHr8BH21DjDBEXcbiVZko": [
			{
				"comment_id": 31,
				"body": "Homemade firearms\nhttp://makegunq4r36mego.onion/index.shtml\nhttp://b2fxrnttdue72ntq.onion/",
				"added": 1574602800
			}
		],
		"1574266227_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 33,
				"body": "source: https://news.guo.media/16762/\n\nMiles Guo Disclosed Confidential Text Messages Related to HNA CEO’s Mysterious Death\n2019.11.26\n\nOne year ago, Wang Jian former HNA’s CEO, died in his vacation at Provence, southern France. The cause of his death remains suspicious to Mr. Guo Wengui, even though the media reported Wang fell to his death when he attempted to take a selfie on the top of the wall. Mr. Guo claimed that Wang’s mystery death was NO accident.\n\nIn the past year, Guo has sent the investigation team to France multiple times to break the case himself. He has mentioned his intentions for the investigation in live broadcasts. He believes unraveling Wang’s death can lead to the take-down of Chinese Vice President Wang Qishan, who is his number one enemy among the CCP kleptocrats Mr. Guo Wengui pledged to eliminate in his expose revolution.\n\nLast Wednesday was marked as the one year anniversary of Wang’s death. On that day Mr. Guo told audiences in his live broadcast that Wang Jian’s $1.5 billion money has ended up in Wang Qishan’s daughter’s UBS account since his mysterious demise at Provence.\n\nMr. Guo proved that Wang Jian is the U.S permanent resident, the green cardholder. Wang’s other identity is being one of the most senior spies of the Ministry of State Security of China.\n\nHe also revealed the critical image evidences on those who are very likely the murderers of Wang Jian. These suspects include Wang’s bodyguards, his interpreter, tourist guide as well as his close friend in France, who helped arrange Wang’s vacation.\n\nGuo has disclosed the significant findings of the investigating: the case of HNA Chairman Wang Jian showed the shocking corruption and fraud in both diplomatic and judicial institutions of China and France.\n\nSome of the explosive text messages (shown below) are believed to relate to the death of Wang Jian, that Guo obtained in the investigation, have also been presented in the live broadcast.\n\nDon’t forget picking up things later in Wang’s room. Don’t let “T” reach his destination today, Hua will keep an eye on the surroundings at the foot of the hill.\n\nThe morgue place has been arranged for tomorrow. Don’t go there. Don’t contact your family after tomorrow. Please give me the contents of that safe. You must follow Beijing’s plan. You will be the hero of our country. The house “157” in New York house will be yours.\n\nArrangements have been made for bosses from both Beijing and Lyon, and Wang Jian has learned that he will meet the people send by Big Boss Wang at the church.The local police and others who will arrive at the scene have been arranged, so don’t be nervous. After the plan is completed, you must accompany Huang, and do not go home. Pei will arrange the rest for you. Hua has already arranged everything for Tomorrow. Please follow the plan and do not ruin it. After completing the task, hand your mobile phone to me immediately. Give me a color copy of Wang Jian’s green card later, remember to have Wang Jian sign the documents.\n\nHello secretary Sun! Sorry to bother you! Today, the HNA headquarter failed to pay the 150 million Chinese RMB loans. We have to make the overdue announcements in accordance with regulations. Our clients have lawyers. They strongly demand that we should go through the legal procedures. We have applied to the court for pre-litigation preservation. Some clients threatened to expose it to the media, and we also worry about the reputation of HNA. Previously, HNA has proposed a debt restructure plan. Although we were not satisfied with that plan, we reluctantly agreed by considering that we had to work through the difficulties together. Therefore we have quickly gone through the approval process internally and are waiting for a reply from HNA. It is up to you to protect HNA’s reputation. We can only help as much as possible. If HNA can’t repay sooner, we can’t help it. Would you please report to Chairman Wang? Thank you!",
				"added": 1574761843
			}
		],
		"1575523101_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 34,
				"body": "Thx all!",
				"added": 1575688112
			}
		],
		"1575661928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 35,
				"body": "Tencent, BAIDU, Alibaba, Sina, sogou, 360 and soon...All of these Chinese internet company are evil spy company.",
				"added": 1575688885
			}
		],
		"1576243302_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 36,
				"body": "Reddit has already sold to CCP",
				"added": 1576328185
			}
		],
		"1576327639_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 37,
				"body": "Half the world is controlled by Wang Qishan !!! Ex: Russian USA Japan Europe China and so on...\nWaiting details to be continued !\nvisit guo.media  gnews.org",
				"added": 1576416434
			},
			{
				"comment_id": 38,
				"body": "> [muhwaycism](#comment_42_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): I'm guessing the based Yamato never should have stopped removing chink.\n\nRight",
				"added": 1576500824
			}
		],
		"1576765890_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [],
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 40,
				"body": "End CCP is protect all human! Because the leaders of the CCP is planning to slave all over the world, they will take off your money , child, woman, house, land which all of they interested things and brainwash from education to conduct propaganda...",
				"added": 1576848760
			},
			{
				"comment_id": 41,
				"body": "> [randomshits](#comment_325_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Wait... are we talking about the US government?\n\nChinese gov, It's the most wicked and biggest devil in the world than ever before",
				"added": 1576986557
			},
			{
				"comment_id": 42,
				"body": "> [anonymouslogin](#comment_169_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I wonder what the policy on citizen-owned firearms has been over the last 20 years?\n\nChinese gov forbidden citizen owned firearms even cutting tools more than 20 years. HK is an example to shown this.",
				"added": 1577020170
			}
		],
		"1577141870_1C3TWkttX6aKrtboutxzVktZzncWyyfyUQ": [
			{
				"comment_id": 43,
				"body": "Unite together Iran HK and all of the people who love freedom and in slaved",
				"added": 1577277527
			}
		],
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 44,
				"body": "Merry Xmas god bless HK",
				"added": 1577277841
			}
		],
		"1577276871_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 45,
				"body": "> [re4tsf9e](#comment_21_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): There are many commendable qualities to Chinese culture and civilization, but they usually aren't realized because Chinese always stifle one another. Perhaps why Chinese expats always seem to do so well (shaking head).\n\nRight",
				"added": 1577437700
			},
			{
				"comment_id": 47,
				"body": "Updated to Dec 29",
				"added": 1577718210
			}
		],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 46,
				"body": "Chinese gov CCP is slaving and controlling all over the world , HK is an example to show this.\nThe CCP always mixed the gov, nation, country, and state, most Chinese people have been kidnapped, purchased, brainwashed by Chinese gov, but they always hate the CCP's corruption.",
				"added": 1577717730
			}
		],
		"1577969522_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 48,
				"body": "The ccp is slaved all of the Chinese , If you are not the top leader's families you must be slave. The law in China is controlling the people who are not the CCP partner and gov official. HK is an example, attention HK will show you the ccp's evil.\n\nThe Farm: Wang Qishan and the Pedophile Rings of the CCP\nhttps://gnews.org/54567/\n",
				"added": 1578115635
			}
		],
		"1578289189_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 49,
				"body": "> [secretcr](#comment_13_15Jmu7DkbxqtQ6mFhu6gLT1pbiMM55oywF): Do you have any informations for Hong Kong movement?\n\nvisit gnews.org, youtube hk apple daily channel or search hongkong, HK in this board",
				"added": 1578581532
			},
			{
				"comment_id": 50,
				"body": "Updated to Jan 9",
				"added": 1578666392
			}
		],
		"1578772651_1AYQoBUEJFzYADJZWaZpJJzrFnGMip92oJ": [
			{
				"comment_id": 51,
				"body": "Learn network engineering to build your own internet",
				"added": 1578837087
			},
			{
				"comment_id": 52,
				"body": "The Farm: Flight PS752  https://gnews.org/79399/\n\nMiles Guo: Iran’s Khomeini is like today’s overseas fake pro-democracy activists\nhttps://gnews.org/79979/",
				"added": 1578983916
			}
		],
		"1578583385_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 53,
				"body": "Updated to 15 Jan.",
				"added": 1579150556
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 54,
				"body": "The Wall Street and the ccp always act in collusion with each other...",
				"added": 1579328310
			}
		],
		"1579246090_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 55,
				"body": "In next several months, the Chinese gov CCP plan to end the war use SARS virus, money control and all evil ways, but the HK protests will have to win the war and get their freedom, because the CCP will be end!  This is irresistible.",
				"added": 1579338454
			}
		],
		"1579685919_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 56,
				"body": "Would they really be willing to kill their own citizens on this scale?\nYes, they(PLA and cops from China) have been arrested more than 30k peoples, many of busted from Chinese mainland, and the CCP is using new SARS virus that man made by biology tech to killing people and controlling their money, goods and materials! ",
				"added": 1579769890
			}
		],
		"1579767328_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 57,
				"body": "> [anonymous1287721](#comment_4_1EyUrUV7UnDzr36fJefTvkARKSNdcJdi14): I was hoping that there was more discussion in here regarding this outbreak of the Wuhan Corona Virus.Most people are ignorant to it, it seems, as far as right now goes, but there are some of us who are aware of what is going on, even if it doesn't spread any further. Good luck china.\n\nYes ! Thx!",
				"added": 1579853364
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 59,
				"body": "> [draugrdeathlord](#comment_497_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Thankyou testuser3 I really appreciate this.\n\nNo thanks , the CCP is a big dangerous devil for all humans!",
				"added": 1579926187
			},
			{
				"comment_id": 60,
				"body": "> [mariage](#comment_1_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): Where does it come from, this virus? Nobody knows.. It's a scandal..\n\nThe PLA made this virus, not evolve natural! The new coronavirus's envelope Protein is nearly exact like with the virus's from Zhoushan bat(Zhoushan is a the eastern Chinese province of Zhejiang),and ORF8 gene 94.21% be similar with each other.\nIt is sure that the CCP own this biology tech, they build a bio-safety level 4 (BSL-4) laboratory of the Chinese Academy of Sciences (CAS) in Wuhan or the Wuhan P4 lab, and motivation like kill HK people and reduce the number of Chinese people...",
				"added": 1580009942
			},
			{
				"comment_id": 61,
				"body": "> [zeromed](#comment_6_1Fct94e4PRpnXyWzFi679369yUL6aKrsej): following the newspapers i read that the virus make some dozen death at now...very few compared to SARS and Swine flu... but why the Chinese Governament is blocking millions of people this time? These data are real or the numbers are far more bigger?  there are other things hidden?\n\nThey hiding too many truth. And banning international rescue! Real data numbers are far more bigger! the Chinese gov CCP want to let people struggle and fight each other so that to reduce population for save the CCP's power! THEY ARE DEVIL FOR ALL HUMANS !",
				"added": 1580010020
			},
			{
				"comment_id": 70,
				"body": "> [mariage](#comment_4_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): China made a hospital in 5 days ! Is this true?\n\nA simple house, Chinese gov love to building every where for make a show, brainwash their people and take bribes In fact they can reform guest house to temp ward but they did not.",
				"added": 1580355675
			},
			{
				"comment_id": 83,
				"body": "> [speedbroken](#comment_25_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): Trying to pinpoint CCP's goal is futile; I doubt if they are even efficient or organized in any fully centralized way, and they would probably simple-mindedly deny all theories anyway. A simple strategy for us is to assume the worst and prepare for that...\n\nyeah, but CCP always can organize and full centralize efficiently, you can search their history",
				"added": 1580805653
			},
			{
				"comment_id": 84,
				"body": "> [speedbroken](#comment_26_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): My take is that most people in CCP find their position valuable for their personal gains, and will take whatever measure to maintain the status quo. Thus the efficiency we have observed should mostly come from the fear of losing their positions. This may explain their cover-up of truths about coronavirus and their ridiculous transition to being apparently very committed to contain the epidemic once awareness rises. [...]\n\nright",
				"added": 1580809289
			},
			{
				"comment_id": 85,
				"body": "> [krak3n](#comment_9_15iDa4DKRDbUJY12ZoJSfZczbAtMSmNrn2): Thank you so much for sharing!!\n\n:)",
				"added": 1580898939
			},
			{
				"comment_id": 86,
				"body": "> [mariage](#comment_6_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): Thank you for updates! Eastern europe medias don't tell the truth to people, it's not better than in China....Have a nice day\n\nWestern medias don not dare to tell the truth, they were threatened, sold them self to CCP",
				"added": 1581046808
			},
			{
				"comment_id": 87,
				"body": "The Chinese gov CCP not equal China can not delegate Chinese people, on the contrary CCP killed too many people in history",
				"added": 1581047341
			},
			{
				"comment_id": 94,
				"body": "The Wall Street and the CCP are partner and always act in collusion with each other",
				"added": 1582603971
			},
			{
				"comment_id": 95,
				"body": "> [mariage](#comment_7_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): Hi ! I would like to know what is CCP..is it China ?Gnews should have a tor site and a Zeronet zite ;)\n\nCCP is short for Chinese communist Party that is Chinese gov. Gnews is within the U.S law...",
				"added": 1582869736
			},
			{
				"comment_id": 96,
				"body": "> [32767](#comment_5_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR): You should archive the links either on Zeronet or IPFS because the truth is not likely to stay online for long.https://github.com/ipfs-shipyard/ipfs-companion\n\nThank you, we need volunteers to do this",
				"added": 1582870922
			},
			{
				"comment_id": 104,
				"body": "The World is in the War with the CCP!",
				"added": 1586337148
			},
			{
				"comment_id": 105,
				"body": "May 11 Add: CCP's Nuclear Weapon, Police brutality in HK on Mother’s Day",
				"added": 1589203209
			},
			{
				"comment_id": 111,
				"body": "Oct 8, addressed \"The 2nd Yan report\",and \"China Task Force Report\".\nTHE TIME HAS COME THAT THE WORLD FACES THE TRUTH OF COVID-19 AND TAKES ACTIONS TO SAVE THE FUTURE OF HUMANITY.",
				"added": 1602234913
			},
			{
				"comment_id": 112,
				"body": "https://www.nbcnews.com/politics/justice-department/doj-says-five-chinese-nationals-hacked-100-u-s-companies-n1240215\n张浩然（Zhang Haoran），谭代林（Tan Dailin），钱川（Qian Chuan），傅强（Fu Qiang）和姜立志（Jiang Lizhi）（音译）",
				"added": 1602235450
			},
			{
				"comment_id": 113,
				"body": "Oct. 30, updated a paper: COVID Pandemic Began at PLA Hospital in Wuhan!",
				"added": 1604045443
			},
			{
				"comment_id": 115,
				"body": "> [ksnde](#comment_25_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Friend, link please :3\nhttps://zenodo.org/record/4119263",
				"added": 1610777428
			},
			{
				"comment_id": 116,
				"body": "Feb.12\n Addressed a paper \"A Bayesian analysis concludes beyond a reasonable doubt that SARS-CoV-2 is not a natural zoonosis but instead is laboratory derived\" and a PLA's textbook \"A Chinese military university textbook, the Un-natural Origin of SARS-CoV and the Man-made Human Novel Virus as a Genetic Bioweapon\"",
				"added": 1613124150
			},
			{
				"comment_id": 117,
				"body": "Jun. 15, updated new evidences , now you can see more and more evidences came out.",
				"added": 1623830219
			}
		],
		"1579929059_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 62,
				"body": "感染的 未感染的如果安全受到威胁，口水吐向恶警 作恶官员 党卫军，保护医生！关注军人是否有被感染，好判断他们是否打了疫苗",
				"added": 1580010991
			},
			{
				"comment_id": 64,
				"body": "wake up\nhttps://www.youtube.com/watch?v=aZ_PoTKN36Q",
				"added": 1580191854
			}
		],
		"1580047031_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 63,
				"body": "The Chinese gov CCP hidden too many truth, so the summary is only a initial version.\nMaybe CCP has been developed the vaccine but they not public and only used to PLA (CCP'S army) sothat they can lock  down cities and control the infected man. They also banning people discuss the truth in Chinese intranet like wechat(instant messenger) and so on, all the infected numbers only can published by CCP ! Even they banning the international rescue !\nCCP want to let people struggle and fight each other so that to reduce population and coltrol HK, US, EUR, AND ALL OVER THE WORLD for save the CCP's power! ",
				"added": 1580097504
			}
		],
		"1580186317_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 65,
				"body": "> [somuchfood](#comment_79_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): TBH I kinda can believe that govs want to depopulate the world (which is needed, no matter if you like it or not, 8 billion fucktards is at least 5 billion too much)  and may have spread the virus on purpose to do so\n\nright",
				"added": 1580220094
			}
		],
		"1580201314_14eUd5go4Khv6h8RzQaX7ofB2iXWPQwrg2": [
			{
				"comment_id": 66,
				"body": "Estimate nearly 200k people infected, and at Jan. 27, China has been locked down 16cities, affecting more than 45 million people. ",
				"added": 1580220212
			},
			{
				"comment_id": 67,
				"body": "> [moor](#comment_383_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): it looks like they are working their butts off to help people, with some international solidarity:First cured novel coronavirus-infected patient in Jiangxi discharged from hospital Frontline doctor bride postpones wedding in Wuhan A Japanese medical team arrived Wuhan.Thank you, Japanese people!Coronavirus vaccine research, development, is imminent: Lab officialChina Sends Military Aid to Help Fight Coronavirus Outbreak [...]\n\nthese fake news are lies for brainwash Chinese people and for save CCP‘s power!\nReddit has been sold to CCP's company and sino, Lan Yang, Bruno Wu(Lan Yang's husband) and so on is a proxy for CCP(Chinese gov).\nvisit https://gnews.org for more info",
				"added": 1580222103
			}
		],
		"1580221750_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 71,
				"body": "keep alive",
				"added": 1580356497
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 72,
				"body": "> [qqstejgk77rtkats](#comment_10_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi): Here's the problem with this theory. All of us have contact with government. Governments are parasitic organisms which rigorously select for the least capable. [...]\n\nThey own these tech, refer to Wuhan corona virus topic",
				"added": 1580444361
			},
			{
				"comment_id": 82,
				"body": "Feb 3 added:  Coronavirus Is Biological Warfare Weapon",
				"added": 1580805269
			},
			{
				"comment_id": 93,
				"body": "Russian Ministry of Heath proves COVID-19 to be “man-made”",
				"added": 1582453228
			},
			{
				"comment_id": 101,
				"body": "Time is the best proof",
				"added": 1585025235
			},
			{
				"comment_id": 110,
				"body": "Oct.8, addressed \"The 2nd Yan's report\",This is very important , and THE TIME HAS COME THAT THE WORLD FACES THE TRUTH OF COVID-19 AND TAKES ACTIONS TO SAVE THE FUTURE OF HUMANITY.",
				"added": 1602234552
			},
			{
				"comment_id": 118,
				"body": "Jun.15, 2021  addressed \"The 3nd Yan's report\" and other evidences!\nDon't use any vaccine, they are UNSAFE ! Take hydroxychloroquine sulfate instead of it, cheap and safe! ",
				"added": 1623831908
			}
		],
		"1580487512_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 75,
				"body": "exist , CCP developed this",
				"added": 1580537704
			},
			{
				"comment_id": 77,
				"body": "> [pgkjk](#comment_5_19TSBC2cLuuaveC1TyLnR5mB8QK26RzRbQ): Oops, It's you again. I don't believe that CCP is going to develop such a hardware-based backdoor, in reason that as far as I know, China do not have such an advanced tech to build chips, so made-in-China ones aren't so widely used around the world. Then what's the point of adding a hard backdoor? Just spying on civilians?\n\nhttps://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies",
				"added": 1580615749
			},
			{
				"comment_id": 79,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_53_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): Just spying on civilians? [...]\n\nRight! Look at their Big Data, GFW, Green Dam, HuaWei",
				"added": 1580647327
			}
		],
		"1580538058_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 78,
				"body": "It is clearly designed, the possibility of acquired is too tiny.  Twitter @halliburton50",
				"added": 1580616948
			},
			{
				"comment_id": 80,
				"body": "Some other proofs in here:    /Talk.ZeroNetwork.bit/?Topic:1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg",
				"added": 1580734146
			}
		],
		"1581099116_12L2KV35E7avq6p7nRzHXDQ43Yg6dEbAdH": [
			{
				"comment_id": 88,
				"body": "> [csm1](#comment_2_1LUD39UkGbtTG9umEusGcghcnjSfwe61j9): what is this ? how can I open it ?\n\nsome videos from WuHan , use resilio sync to download",
				"added": 1581391730
			}
		],
		"1581391651_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 89,
				"body": "> [aassddff](#comment_43_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Do you mean Citizens of the USA?\n\nYeah, visit FBI site",
				"added": 1581392208
			}
		],
		"1582170690_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 92,
				"body": "> [kanade](#comment_76_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): This exactly, it's retarded to assume that they'd wage war for no reason, they neither have the manpower nor resources currently to even begin one. Especially since the virus is affecting them more than any other country. Stop spreading this bullshit\n\nThe Chinese gov CCP's original goal was to use the virus to infect selective people in Hong Kong, so that the CCP could use it as an excuse to impose martial law there and ultimately crush the HK pro-democracy movement. But it backfired terribly.\nIn China, political safe is most important and civilian's life is too cheap just like their labor price, look at this: Front line Doctor: “we are required to put political correctness first”\nhttps://gnews.org/120158/",
				"added": 1582353255
			},
			{
				"comment_id": 98,
				"body": "> [kanade](#comment_88_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Then why isn't HK in the least bit affected compared to any other country? Unless the leader of the HK riots are a bunch of seniors (which is mainly the demographic Covid-19 kills) then your theory falls flat completely. Putting PC first isn't any indication of ANY of this. It seems like you're stringing random \"\"\"facts\"\"\" together to create some bullshit narrative. I don't even believe gnews is too reputable of a source for any of your claims. Give me something with substance to go on.\n\nLook at their old news you will find the proof or look at \"war room\", the truth will be proofed by times!",
				"added": 1584422621
			}
		],
		"1584308899_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 97,
				"body": "They forbidding to discuss this in China until the Chinese gov CCP break.",
				"added": 1584421607
			}
		],
		"1585101196_1Ahyyr1tEzvP9hZC2iocNTZfEp7zfJwbCJ": [
			{
				"comment_id": 102,
				"body": "Onionshare , a part of tor project",
				"added": 1585107391
			}
		],
		"1585616782_1BpmfrtYDwDy6ERRr8jLb5mavzRuTrVcKv": [
			{
				"comment_id": 103,
				"body": "fight the CCP man made virus",
				"added": 1585888524
			}
		]
	},
	"comment_vote": {
		"76_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1408_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"118_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"69_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"159_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"359_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"4_1DN3VWX7wRD71B6i3GYvVkBXzJWWUGFb1Q": 1
	}
}