{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Fuxico - Rede livre feminista",
			"body": "#A FUXICO...\nÉ um dispositivo móvel autônomo de troca e colaboração, feita para conectar pessoas presentes em um mesmo espaço físico. A Fuxico cria uma rede sem fio fora da internet para troca de conteúdos digitais como imagens, vídeos, áudios,documentos, sala de bate-papo e Rodas de conversa. Totalmente anônima!\n\nSeu sistema operacional é um 'Remix' da [Piratebox](https://github.com/PirateBox-Dev) (caixa-pirata), um famoso projeto de Software Livre criado em 2011 por David Darts e Matthias Strubel https://piratebox.cc. Esse nome foi inspirado nas 'rádios piratas' e nos movimentos de cultura livre ao redor do mundo.\n\n- https://fuxico.org/index.html\n\n#Faça sua própria Fuxico\n- https://fuxico.org/suafuxico.html",
			"added": 1577583807
		},
		{
			"topic_id": 2,
			"title": "Não é Graças ao Capitalismo que Estamos Vivendo Mais, mas Graças a Políticas Progressistas",
			"body": "#Ignore o conto de fadas habitual. Democracia, Sindicatos, Saúde e Educação: Essas são as forças que realmente importam.\n\nNos últimos anos, comentaristas de renome, como Steven Pinker, Jordan Peterson e Bill Gates, têm invocado o progresso nas expectativas de vida em nível global para defender o capitalismo contra uma onda crescente de críticos.\n\nCertamente há muito o que comemorar nesta frente – afinal, a média da expectativa de vida humana melhorou bastante. “Os intelectuais tendem a engasgar quando lêem uma defesa do capitalismo”, escreve Pinker em seu recente livro, “Enlightenment Now” (“Iluminismo Agora”). Mas, ele afirma, é “óbvio que o PIB per capita tem correlação com a longevidade, a saúde e a nutrição”.\n\nÉ uma história familiar. A narrativa predominante diz que o capitalismo foi uma força progressista que pôs fim à servidão medieval e que provocou um aumento dramático nos padrões de vida. No entanto, esse conto de fadas não se sustenta contra as evidências.\n\nA servidão de fato foi um sistema brutal que gerava uma extraordinária miséria humana, sim; mas não foi o capitalismo que acabou com ela. Como demonstra a historiadora Silvia Federici em seu livro “Calibã e A Bruxa“, uma série de rebeliões camponesas bem-sucedidas por toda a Europa nos séculos XIV e XV derrubou senhores feudais e deu aos camponeses mais controle sobre suas próprias terras e recursos. Os frutos desta revolução foram surpreendentes em termos de bem-estar. Os salários dobraram e a nutrição melhorou. Foi um período de dramático progresso social para os padrões da época.\n\nE então a reação aconteceu. Revoltada com o crescente poder dos camponeses e dos trabalhadores, e furiosa com o aumento dos salários, uma classe capitalista nascente organizou uma contra-revolução. Eles começaram a cercar os bens comuns e forçar os camponeses a sair da terra, com a intenção explícita de reduzir o custo dos salários. Com a destruição das economias de subsistência, as pessoas não tinham escolha a não ser trabalhar em troca de centavos simplesmente para sobreviver. De acordo com os economistas de Oxford, Henry Phelps Brown e Sheila Hopkins, os salários reais caíram em até 70% entre o final do século XV e o século XVII. Crises de fome generalizada tornaram-se comuns e o nível de nutrição se deteriorou. Na Inglaterra, a expectativa média de vida caiu de 43 anos, nos anos 1500, para 30 e poucos, nos anos 1700.\n\nEm suma, a ascensão do capitalismo gerou um período prolongado de pauperização. Foi um dos momentos mais sangrentos e tumultuados da história mundial. Ainda assim, Pinker se comporta como se nada disso tivesse acontecido e, em vez disso, pula direto para o período industrial moderno. Segundo ele, teria sido o capitalismo industrial o que realmente proporcionou o progresso na expectativa de vida.\n\nMas aqui também os historiadores têm uma história mais complexa para contar. Simon Szreter, um dos principais especialistas do mundo em dados históricos de saúde pública, demonstra que o crescimento industrial ao longo do século 19 provocou não uma melhoria na expectativa de vida, mas uma deterioração impressionante. “Em quase todos os casos históricos”, escreve Szreter, “o primeiro e mais direto efeito do rápido crescimento econômico tem sido um impacto negativo na saúde da população”.\n\n“A evidência desse trauma”, continua ele, “permanece claramente visível na forma de uma descontinuidade negativa, que se estende por gerações, nas tendências históricas de expectativa de vida, mortalidade infantil ou na altura médias”. Com base em uma ampla gama de estudos, Szreter mostra que as populações diretamente afetadas pelo crescimento industrial na Grã-Bretanha experimentaram um declínio constante na expectativa de vida, entre as décadas de 1780 e 1870, em níveis nunca vistos desde a Peste Negra no século XIV.\n\nDe fato, foi exatamente onde o capitalismo estava mais desenvolvido que esse desastre foi mais pronunciado. Em Manchester e Liverpool, os dois gigantes da industrialização, a expectativa de vida entrou em colapso em comparação com as partes não industrializadas do país. Em Manchester, ela despencou para meros 25,3 anos. Enquanto isso, na zona rural de Surrey, as pessoas podiam esperar viver 20 anos a mais.\n\nE não é só na Grã-Bretanha que vemos esse padrão se desenrolando. Segundo Szreter, o mesmo aconteceu em “todos os países onde isso foi pesquisado”, incluindo Alemanha, Austrália e Japão. Catástrofes semelhantes ocorreram durante o mesmo período em colônias como Irlanda, Índia e Congo, à medida que foram amarradas à força ao sistema industrial europeu.\n\nSeria difícil exagerar o sofrimento que esses números representam. Eles contam a história de populações inteiras que foram desapropriadas pela classe capitalista e reduzidas à servidão nas fábricas insalubres e nas plantações da revolução industrial. E, no entanto, nada disso aparece na narrativa rósea de Pinker.\n\nApenas na década de 1880 as expectativas de vida urbana finalmente começaram a aumentar – pelo menos na Europa. Mas o que levou a esses ganhos repentinos? Szreter descobriu que tudo se resume a uma intervenção simples: o saneamento.\n\nAtivistas da saúde pública haviam descoberto que os resultados da saúde poderiam ser melhorados com a separação do esgoto da água potável. E, no entanto, ao invés de ser e viabilizado por ela, o progresso em direção a esse objetivo enfrentou a oposição da classe capitalista – os senhores de terra e proprietários de fábricas “libertários” se recusaram a permitir que os funcionários públicos construíssem sistemas de saneamento em suas propriedades e se recusaram a pagar os impostos necessários para realizar esse trabalho.\n\nSua resistência foi quebrada apenas quando os plebeus conquistaram o direito de voto e os trabalhadores se organizaram em sindicatos. Nas décadas seguintes, esses movimentos alavancaram o Estado para intervir contra os senhores da terra e proprietários de fábricas, gerando não apenas sistemas de saneamento, mas também sistemas de saúde, educação e habitação pública universais. Segundo Szreter, foi o acesso a esses bens públicos o que aumentou a expectativa de vida ao longo do século XX.\n\nPinker não faz menção a esse movimento. Seu argumento se baseia em um gráfico de dispersão conhecido como curva de Preston, que mostra que países com maior PIB per capita tendem a ter maiores expectativas de vida. Mas ele afirma uma relação de causalidade onde não há evidências para isso. Na verdade, uma nova pesquisa descobriu que o fator causal por trás da curva de Preston não é o PIB, mas a educação.\n\nObviamente, os serviços sociais exigem recursos, e é importante reconhecer que o crescimento pode ajudar nesse sentido. Porém, as intervenções que importam quando se trata de expectativa de vida não exigem altos níveis de PIB per capita. A União Europeia apresenta uma expectativa de vida mais alta que os Estados Unidos, mesmo com uma renda 40% menor. Costa Rica e Cuba vencem os EUA com apenas uma fração da sua renda e ambos alcançaram seus maiores ganhos na expectativa de vida em períodos em que o PIB não estava crescendo. Como? Implementando cuidados de saúde e educação universais.\n\n“O registro histórico é claro sobre como o crescimento econômico em si não tem implicações positivas diretas e necessárias para a saúde da população”, escreve Szreter. “O máximo que se pode dizer é que ele cria o potencial de longo prazo para melhorias na saúde da população”.\n\nA realização ou não desse potencial depende das forças políticas que determinam como a renda é distribuída. Então, vamos dar crédito onde o crédito é devido: o progresso na expectativa de vida tem sido impulsionado por movimentos políticos progressistas que aproveitam os recursos econômicos para oferecer bens públicos robustos. A História mostra que, na ausência dessas forças progressistas, o crescimento muitas vezes trabalhou contra o progresso social, não ao seu favor.\n\n- Fonte: https://ominhocario.wordpress.com/2019/12/23/nao-e-gracas-ao-capitalismo-que-estamos-vivendo-mais-mas-gracas-a-politicas-progressistas/",
			"added": 1577590384
		},
		{
			"topic_id": 3,
			"title": "O que é criogenia humana?",
			"body": "https://gateway.pinata.cloud/ipfs/QmUG4cpp4yCJVU8mJMmuAcTQtuH3S2gV884AAnGUShEQyz",
			"added": 1577593009
		},
		{
			"topic_id": 4,
			"title": "E se você fizesse UPLOAD da sua mente em um COMPUTADOR?",
			"body": "https://gateway.pinata.cloud/ipfs/QmVZ26kfQtG2Bt3qYw7DxA3MJjaxau96g4E4nEGKiCW5BC",
			"added": 1577593301
		}
	],
	"topic_vote": {
		"1_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": 1,
		"2_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": 1,
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"3_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": [
			{
				"comment_id": 1,
				"body": "#COMO FAZER A SUA PROPRIA CAIXA-PIRATA (PIRATEBOX)\nA _“caixa pirata”_ é um dispositivo móvel autônomo de troca e colaboração. Seu nome foi inspirado pelas ‘rádios piratas’ e pelos movimentos de cultura livre ao redor do mundo. Ela foi feita para conectar pessoas presentes em um mesmo espaço físico, criando uma rede sem fio de troca de arquivos, como imagens, vídeo, áudio, documentos e outros conteúdos digitais fora da internet. Em uma época em que o acesso a informação digital está cada vez mais presa em jardins murados, a caixa-pirata representa uma semente de resistência e anonimato.\n\n- https://fuxico.org/piratebox.html",
				"added": 1577583852
			},
			{
				"comment_id": 2,
				"body": "> [distaboa](#comment_1_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV): COMO FAZER A SUA PROPRIA CAIXA-PIRATA (PIRATEBOX)\n> A “caixa pirata” é um dispositivo móvel autônomo de troca e colaboração. Seu nome foi inspirado pelas ‘rádios piratas’ e pelos movimentos de cultura livre ao redor do mundo. Ela foi feita para conectar pessoas presentes em um mesmo espaço físico, criando uma rede sem fio de troca de arquivos, como imagens, vídeo, áudio, documentos e outros conteúdos digitais fora da internet. Em uma época em que o acesso a informação digital está cada vez mais presa em jardins murados, a caixa-pirata representa uma semente de resistência e anonimato.\n> \n> https://fuxico.org/piratebox.html\n\n#Repositórios oficiais do projeto PirateBox\n- https://github.com/PirateBox-Dev",
				"added": 1577583891
			},
			{
				"comment_id": 3,
				"body": "#LibraryBox\n\nLibraryBox é projetado para permitir a distribuição de informações digitais para áreas com pouco ou nenhum acesso à Internet, mesmo fora da grade. Ele faz isso usando software de código aberto e hardware muito barato, permitindo a distribuição de hardware LibraryBox a um custo muito menor do que outras soluções.\n\n- http://librarybox.us/index.php\n- https://github.com/LibraryBox-Dev",
				"added": 1577584730
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 4,
				"body": "#Não é Graças ao Capitalismo que Estamos Vivendo Mais, mas Graças a Políticas Progressistas\n\nIgnore o conto de fadas habitual. Democracia, Sindicatos, Saúde e Educação: Essas são as forças que realmente importam.\n\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV/N+o+Gra+as+ao+Capitalismo+que+Estamos+Vivendo+Mais+mas+Gra+as+a+Pol+ticas+Progressistas",
				"added": 1577590427
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 5,
				"body": "#Superinteligência - Caminhos, Perigos, Estratégias\n\n\"O cérebro humano possui algumas aptidões ausentes nos cérebros dos demais seres vivos. Nossa posição dominante no planeta se deve a estas particulares habilidades. Outros animais possuem músculos mais robustos ou mandíbulas mais afiadas, mas nós temos cérebros mais sofisticados. Se algum dia os cérebros artificiais superarem a inteligência dos cérebros humanos, então esta nova superinteligência pode se tornar muito poderosa. Assim com o destino dos gorilas hoje depende mais dos humanos do que dos próprios símios, o destino da nossa espécie também se tornaria dependente das ações destas máquinas superinteligentes. Mas nós temos uma vantagem: começamos a dar o primeiro passo. Será possível construir uma inteligência artificial ou projetar condições iniciais para que possamos gerar uma explosão de inteligência sustentável, que não implique no fim da nossa espécie? Como poderíamos alcançar uma expansão controlada desta inteligência? Profundamente ambicioso e original, Superinteligência: Caminhos, Perigos, Estratégias avança cuidadosamente por um amplo e árduo terreno intelectual, porém, com uma escrita tão perspicaz e clara que faz com que tudo pareça simples. Através de uma jornada completamente envolvente que nos conduz às fronteiras do pensamento sobre a condição humana e o futuro da vida inteligente, a obra do filósofo Nick Bostrom redefine o desafio essencial de nosso tempo.Superinteligência, de Nick Bostrom - professor na faculdade de Filosofia na Universidade de Oxford -, tem sido aclamado e recomendado por nomes como Bill Gates e Elon Musk. Traduzido em mais de uma dezena de países, o livro alcançou a lista de mais vendidos do New York Times e o autor foi incluído pela revista Foreign Policy entre os “Top 100 Global Thinkers” de 2015. A obra integra a linha editorial Crânio, da DarkSide® Books, que tem o compromisso de publicar material minuciosamente selecionado. Obras assinadas por especialistas, acadêmicos e pensadores em diversas áreas, dispostos a dividir experiências e pontos de vista transformadores que nos ajudem a entender melhor esse estranho e admirável mundo novo.\"\n\n- https://gateway.pinata.cloud/ipfs/QmPVK4r79B8QJeCA7ZrQWgGiJLrypdhXaitce6VhyE4N5m",
				"added": 1577592982
			}
		],
		"4_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": [
			{
				"comment_id": 6,
				"body": "#Transferência mental\nMind Upload e Sublimation são termos utilizados para se referir a uma teoria pela qual a mente humana pode ser transferida para um computador e por este ser lida.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Mind_uploading.html",
				"added": 1577593323
			}
		]
	},
	"comment_vote": {}
}