{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [klu9](#comment_1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Interesting post.\n> I have a Huawei E5377 as my LTE modem, and am planning to migrate to Linux in a couple of months. Will that combination work?\n\nE5377 is based on Balong V7R2, which is a bit problematic on Linux. Most probably, it won't be visible in NetworkManager as a network device and may require manual configuration using distributive's native network configuration means.",
			"post_id": 4,
			"date_added": 1553117462
		},
		{
			"comment_id": 2,
			"body": "> [klu9](#comment_2_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Thanks for the info. And sorry for the late reply, I never noticed your response in my feed.\n\nIf you want to use E5377 only over Wi-Fi, it will be absolutely fine.\nI'd recommend you to choose E5770. Buy it on ebay.co.uk (British eBay), search for \"huawei mobile wifi pro\". You can easily unlock and flash it.",
			"post_id": 4,
			"date_added": 1557589046
		},
		{
			"comment_id": 3,
			"body": "> [klu9](#comment_4_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Ah, finally found something in English here. So I can access the internet through USB connection to the modem, and there's an optional accessory for ethernet.\n\nYes. You'll have some problems connecting it via USB, but it's possible.",
			"post_id": 4,
			"date_added": 1557743261
		},
		{
			"comment_id": 4,
			"body": "> [klu9](#comment_3_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): \n> Also I don't think I can use a different modem: the data-only plan I have from my telco has restrictions. I only get unlimited data if I use the SIM in the device they provided, the E5377, and only at my home address. I tried putting the SIM in another device, a phone, and using it elsewhere, but the connection was soon throttled & capped.\n\nMost probably, the operator detects devices by IMEI. Huawei modems allow to clone IMEI after installing custom firmware, that way you can use device you want.",
			"post_id": 4,
			"date_added": 1557743346
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}