{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1586961694,
			"title": "Incredibly sunny and no chemtrails",
			"body": "This is no accident and must have agood reason.",
			"added": 1586961693
		}
	],
	"topic_vote": {
		"1586949592_1GGSNB12PSSTBU2AoYyQaEU4jXqjXctVxZ": 1,
		"1586928602_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": 1,
		"1586824584_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1586334718_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1586537374_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"1586463960_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"1586770219_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": 1,
		"1586627571_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1586728821_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": 1,
		"1586627246_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1586655304_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1586631495_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": 1,
		"1568749254_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1587467560_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"1587547948_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"1588077237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1587842259_17Y99cco6a5zgT4jbUXbh1ghnc9SP28kua": 1,
		"1588068851_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": 1,
		"1588179678_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1588017450_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1586956972_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 1,
				"body": "They will desperately try to wipe us all out we will fight them to the last drop of bytes.",
				"added": 1586961617
			}
		],
		"1586928602_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 2,
				"body": "> [ranshit](#comment_130_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Unlike ZeroID, ID providers that don't provide a means of their created ID to be blocked per user instance are a cancer on the Zeronet network and should be avoided.\n\nGot it, but does it mean we are stuck with ZeroID central nature or just need a properly coded alternative?",
				"added": 1586967947
			},
			{
				"comment_id": 6,
				"body": "> [fractalzoomer@kxoid.bit](#comment_21_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): I got one, but I had to get the admins to bring a kxoid signing server online.\n\ndecentralized? no way!!!!!!!!!!!!!",
				"added": 1586969720
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_1364_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There were several people hosting KxoID but it looks like almost everyone is offline now. I'll try to bring up a persistent node but I'm not sure if I manage to do that.\n\nWhat do you require from your co-hosters to help you keep your system online 24/7/366?",
				"added": 1586986377
			}
		],
		"1586627571_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 3,
				"body": "> [edgelordofdecent](#comment_466_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Not ionizing, not harmful.\n\nthat simple? have you heard of EM bio-fields around humans and plants?",
				"added": 1586969385
			}
		],
		"1586728821_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 4,
				"body": "this is why google is not working out for the free people you cant be 'antisemitic' and get massive following no matter how factual you are",
				"added": 1586969554
			}
		],
		"1586655304_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 5,
				"body": "well done man! thnx!",
				"added": 1586969644
			}
		],
		"1586631495_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 7,
				"body": "Spent last few days getting to know his work better. An ex-oil-employee, incredible record in anti-fracking in UK, very engaged in Noakes GC-Maf legal actually moral defense campaign against this evil british law making healing cancer illegal. Man he's got to recover and keep it up. And people should wise up. It's not a job for a couple guys. They need support!",
				"added": 1586970322
			}
		],
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": [
			{
				"comment_id": 8,
				"body": "> [illuminatus](#comment_3_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3): Killing Joke - I'm the Virus : http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3/Killing%20Joke%20-%20I%20Am%20The%20Virus%20-Lyric%20Video-.mp4\n\nThis song is badass given the time isn't it? Do you know their song from 19080's 'Love Like Blood'? KUDOS!",
				"added": 1586970483
			}
		],
		"1587283149_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": [
			{
				"comment_id": 10,
				"body": "dark is good",
				"added": 1587491041
			}
		],
		"1587547948_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": [
			{
				"comment_id": 11,
				"body": "Impressive",
				"added": 1587548265
			}
		],
		"1588077237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "great work!",
				"added": 1588079392
			}
		],
		"1587842259_17Y99cco6a5zgT4jbUXbh1ghnc9SP28kua": [
			{
				"comment_id": 13,
				"body": "> [blurhy](#comment_443_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): 99% probability scam, as long as it involves blockchain\n\nI think I know what you're getting at but please elaborate.",
				"added": 1588079886
			}
		],
		"1588068851_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 14,
				"body": "tell me how did you get those from your ISP?",
				"added": 1588175796
			},
			{
				"comment_id": 17,
				"body": "> [joczo](#comment_77_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8): @xenovich as far as I know,it's pretty standard for ISPs to give 64bit blocks for users(which is dynamic tho,so after every router restart you get a new block).If you have IPV6,check the IP at least 2 devices on your network.If the first half is the same,then you got a 64bit block as well,with which you can do whatever you want.\n\nI see. thanks!",
				"added": 1588180738
			}
		],
		"1588179678_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 15,
				"body": "Desperately trying to download and play ep 14...... come on!!!!!! come one!!!!! It's like 1991 moment 'move the aerial'.....",
				"added": 1588180451
			},
			{
				"comment_id": 16,
				"body": "If we had 3 seeders already it would start fast. How many seeders you have yourself?",
				"added": 1588180621
			},
			{
				"comment_id": 19,
				"body": "> [blahblah69](#comment_61_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): My apologizes, We are experiencing crappy weather right now and our internet gets shitty with storms in our area.\n\nNo worries, it's understandable. It's the fucking Musk attacking ZeroNet from low earth orbit with his satellite. Hope chinese will crash theirs into his.",
				"added": 1588180988
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2099_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Bro, take your meds.\n\nIf you take stuff like this seriously what can I say.",
				"added": 1588193832
			},
			{
				"comment_id": 21,
				"body": "In my 'pirate radio' site it says 70 files left to be updated. Is that correct?",
				"added": 1588194065
			},
			{
				"comment_id": 22,
				"body": "> [styromaniac](#comment_2101_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're going overboard. ZeroNet isn't under attack.\n\nI was joking. But my next statement is dead serious. I have no reason to believe zn is under direct attack. But Whoever assumes it will never be is a naive child! My advice to us all is backup everything, archive key things on DVD and alike discs, if you run ZN on windows do your best to switch to linux asap, and as a warning NWO are not stupid, they already installed backdoors in most popular latest linux distros. Examples are RedHat and this UK company making Ubuntu., name esc me. \n\nAlso a special reminder: IBM since 2009 is putting a MINIX spy system in a parallel chip in all Intell CPUs. It has access to your memory, steals your passwords, spies your encryption and sends stuff over the net. Eventually all those who are serious will have all those kinds of cyber infestations removed from their computers.",
				"added": 1588234548
			},
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_2102_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm aware of the backdoors and the EMP proofed storage is a good idea, but you did come off as a bit chastising or cuckoo.\n\nLaughing boosts immune system. That's all.",
				"added": 1588247017
			}
		],
		"1588519592_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 24,
				"body": "@nesselon He is right in that there is no considerable increase in deaths, governments and media terrorized populations. Where are the death tolls? Where are the overcrowded hospitals? \n\nHas the covid-19 virus been extracted and analyzed? 'excess mortality and case mortality' I usually find those kind of semantic games mere mental trickery. Are people dying from covid-19 and in what numbers?\n\nA patent on a vaccine is much different from a patent on a virus? Is it?",
				"added": 1588767749
			},
			{
				"comment_id": 25,
				"body": "[Bill Gates Funded The PIRBRIGHT Institute, Which Owns The Patent On Coronavirus](https://americantruthtoday.com/politics/2020/01/29/bill-gates-funded-the-pirbright-institute-which-owns-the-patent-on-coronavirus/)\n\nBy Jim Hayek January 29, 2020\nBelieve it or not, the coronavirus strain that’s currently spreading throughout China and abroad is a patented virus that’s owned by an entity called The Pirbright Institute, which is partially funded by the Bill and Melinda Gates Foundation.\n\nThe patent page for coronavirus explains that it “may be used as a vaccine for treating and/or preventing a disease, such as infectious bronchitis, in a subject,” suggesting that this is just another weaponized viral strain designed to sell more useless, deadly vaccines, while at the same time killing off a few thousand, or perhaps a few million, people.\n\nA close look at the patent page also shows that the Pirbright Institute owns all sorts of other virus patents, including one for African swine fever virus, which is listed as a “vaccine.” It is thus no surprise that Bill Gates is a Pirbright Institute financial backer, seeing as how he’s one of the most aggressive, vaccine-pushing “philanthropists” on the planet.\n\nThe way this whole coronavirus situation is taking shape would seem to be exactly what Gates once proposed as a “solution” to the alleged problem of “overpopulation.” At an infamous TED Talk, Gates explained that vaccines are one of the keys to reducing global population levels, and what better way to do that than to unleash patented coronavirus on the masses in order to later introduce a patented vaccine for it?\n\nBill and Melinda Gates hosted “Event 201” back in October, described as a “high-level pandemic exercise” What’s further interesting is that the Bill and Melinda Gates Foundation co-hosted a “high-level pandemic exercise” back in October that involved discussions about how “public / private partnerships will be necessary during the response to a severe pandemic in order to diminish large-scale economic and societal consequences.”\n\nHeld in partnership with the Johns Hopkins Center for Health Security and the World Economic Forum, this latest endeavor by Bill Gates is highly suspicious, to say the least, especially when considering that it was held just in time for the coronavirus outbreak.\n\n\nAs is usually the case with suspicious disease outbreaks that get the media and academia talking about new vaccines and public-private partnerships, Bill Gates’ fingerprints are almost always hiding in the background. And this is exactly the case with coronaviruses, which could accomplish many of Gates’ expectations for the future, including mass depopulation, mass vaccination and mass consolidation of government power.\n\n“These events are increasing, and they are disruptive to health, economies, and society,” reads an announcement about “Event 201,” as they called it, or the meeting with Gates and his cronies from back in October.\n\n“Managing these events already strains global capacity, even absent a pandemic threat. Experts agree that it is only a matter of time before one of these pandemics becomes global – a pandemic with potentially catastrophic consequences. A severe pandemic, which becomes ‘Event 201,’ would require reliable cooperation among several industries, national governments, and key international institutions.”\n\nThis reads like a predictive script for what we’re now seeing with coronavirus, as governments around the world scramble to “manage” this deadly outbreak with martial law, vaccine fast-tracking, quarantines and plenty of fear-mongering.\n\n“If we do a really great job on vaccines, health care, reproductive health services, we could lower [the global population] by perhaps about 10 to 15 percent,” Gates is infamously quoted as saying about the true intent of his “humanitarian” efforts.\n\nBe sure to stay tuned for more breaking news about the developing coronavirus crisis.",
				"added": 1588767804
			}
		],
		"1588757239_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 26,
				"body": "> [nesselon](#comment_3_15wHfknPYGm91ZDyofsrYnhHzW4zH6xpXU): Man you need to either check your medication or rethink/readjust your substance abuse.\n\nYou need to check your privilege.",
				"added": 1588770458
			}
		],
		"1588376339_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 27,
				"body": "> [tnytuqsgqnywmecj](#comment_15_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): I have read your posts making statements that are simply wrong! ...  You make claims without any proof and when you do actually speak to a Canadian on the subject you call them / me an idiot. [...]\n\nI am not a canadian. I am calling you an idiot and a troll. Prove where and how exactly blahblah69 deceives readers.",
				"added": 1588770749
			}
		],
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 28,
				"body": "\"Migrating site to surface web as relying on P2P is not stable enough.\nWebsite: http://revolutionpirateradio.net/\nDirect Podcast Feed: https://anchor.fm/s/1ba28364/podcast/rss\nLbry Video Feed: https://lbry.tv/@RevolutionPirateRadio:a \"\n\nP2P is not stable enough? What does it even mean?",
				"added": 1593455331
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 29,
				"body": "You promote the divide and conquer done on USA. It will end the USA soon.",
				"added": 1611573887
			}
		]
	},
	"comment_vote": {
		"3_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": 1
	}
}