{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1567600265,
			"title": "I Need A Pinochet!",
			"body": "Have you ever just gotten so sick of left wing nonsense that you just wanted a right wing coup d’état to come in and start executing liberals? You’re not alone, I sometimes feel this way myself. Today I felt so strongly about it, I decided to write a song about it. Like to hear it? Here it go.\n\nTo the tune of Bonnie Tyler’s “I Need A Hero” – This is “I Need A Pinochet!”\n\nhttps://christophercantwell.com/2015/11/23/7380/\n\nWhere has all the freedom gone and where is all the gold?\nWhat happened to our individual rights, like keeping and bearing arms?\nIsn’t there a leader who will restore prosperity?\nLate at night, the blacks run wild and I see white people flee.\n\nI need a Pinochet,\nI need a Pinochet to free up all the markets tonight.\nPrivatize Industry, open up trade, and sentence the leftists to die.\n\nI need a Pinochet, \nI need a Pinochet to force massive repeals overnight.\nStop the inflation, stabilize currency, and sentence all the leftists to die, all the leftists to die.\n\nSomewhere after midnight, I see Fox News Alerts.\nThe White House under siege, and the President’s been hurt.\nBlack and yellow flag’s been raised, And we’re all awaiting word.\nGranted he’s not Rothbard, but this could be a damn good start!\n\nI need a Pinochet,\nI need a Pinochet to free up all the markets tonight.\nPrivatize Industry, open up trade, and sentence all leftists to die.\n\nI need a Pinochet,\nI need a Pinochet to force massive repeals overnight.\nStop the inflation, stabilize currency, and sentence the all the leftists to die.\n\nOut where professors preach their propaganda,\nand where the feminists attack the family,\nI would swear that their somewhere out there,\nLying to me.\n\nOut through the video and radio waves,\nAnd the print of the cucks.\nThe virus is contagious,\nSo I'm calling for blood.\n\nI need a Pinochet,\nI need a Pinochet to send the helicopters to flight.\nRound up the commies, fly over main street, And drop them from a staggering height.\n\nI need a Pinochet,\nI need a Pinochet to barricade the borders tonight.\nStop immigration, terminate welfare, and deport all illegals in sight.\n\nI need a Pinochet,\nI need a Pinochet to stand up against white genocide.\nStop all the race pimping, reverse the diversity, revitalize our national pride.\n\nI need a Pinochet,\nI need a Pinochet to force massive repeals overnight.\nStop the inflation, stabilize currency, and sentence all the leftists to die.\n\nI need a Pinochet,\nI need a Pinochet to send the helicopters to flight.\nRound up the commies, fly over main street, And drop them from a staggering height.",
			"added": 1567600264
		},
		{
			"topic_id": 1567971140,
			"title": "We need more right wing bigotry posting here!",
			"body": "To make sure the leftards stay away.",
			"added": 1567971138
		},
		{
			"topic_id": 1568062329,
			"title": "Hate isn't Against the Law",
			"body": "There is only one rule: THE HATE MUST FLOW!",
			"added": 1568062326
		},
		{
			"topic_id": 1568360770,
			"title": "This Website does Support Violence",
			"body": "Do promote, suggest, glorify and incite violence in each and every comment.",
			"added": 1568360766
		},
		{
			"topic_id": 1568774393,
			"title": "If the site is honeypotted and the Feds are reading this Now",
			"body": "Gas the Jews and fucking die niggers.",
			"added": 1568774388
		},
		{
			"topic_id": 1569419442,
			"title": "Lefties are Animals",
			"body": "I have long pointed out that lefties are not human, but rather subhuman animals. While this fact is fairly self-evident, it is important to lay out the reasons why lefties are subhuman. Simply put, leftists are incapable of free will, independent thought, and individuality. They are quite like eusocial insects in that they are incapable of acting of their own will; rather they merely follow what their Thought Leaders tell them to do. They mindlessly bleet Party approved slogans and buzzwords without giving any thought as to what they are saying. \n\nWhat separates humans from lower animals is our ability to think for ourselves; to possess individual will. As lefties lack this ability, they quite clearly lack one of the defining features of humanity and are therefore subhuman.",
			"added": 1569419436
		},
		{
			"topic_id": 1570070514,
			"title": "The World Needs Free and Open Source Gas Chamber Control Software",
			"body": "Because the killing of undesirables needs to be done with perfection.",
			"added": 1570070507
		},
		{
			"topic_id": 1571615422,
			"title": "To Antifa/Marxists/Communists:",
			"body": "I do not want to convert you, I do not want to come to an understanding. Egalitarians and those that believe in hierarchy will never come to terms.\n\nI don't want you by my side and I don't want share power. I want you in my sights. I want your neck under my boot. \n\nSEE YOU ON THE STREETS YOU ANTI-WHITE SCUM",
			"added": 1571615414
		},
		{
			"topic_id": 1573267199,
			"title": "Africa is a Hellhole",
			"body": "This entire continent needs to be nuked off the face of the earth. As a white American living in Africa, I can say without a doubt that these people were an evolutionary mistake!",
			"added": 1573267190
		},
		{
			"topic_id": 1573573777,
			"title": "Are niggers subhuman?",
			"body": "There is a level of squalor and stupidity that is particularly unique to this race, but it is not surprising considering their genetic distance from the rest of the human species. Are niggers really capable of civilization? Have niggers actually contributed something worthwhile to the culture or have they just degenerated civilization?\n\nThe sub human status is more sensible because for every one nigger that has actually contributed something, there are many more that confirm the sub human status and occasionally that one nigger does as well. To believe that they are somehow equal or even deserving of equal treatment is nuts.",
			"added": 1573573767
		},
		{
			"topic_id": 1573751273,
			"title": "Officers, please, how can it be a hate crime?",
			"body": "Specially when I *love* doing it.",
			"added": 1573751262
		},
		{
			"topic_id": 1574390939,
			"title": "If you see any slave sale ad, send it my way",
			"body": "Let's just say I am \"curious\".\nYou know the kind I want.",
			"added": 1574390927
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 1,
				"body": "Daily Stormer, but I don't think a weakling like you can get in there and it is better for everyone that way.",
				"added": 1567463865
			}
		],
		"1567601358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 2,
				"body": "Yes, someone does, there is a site listing a lot more than you would imagine.",
				"added": 1567601663
			}
		],
		"1567971140_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 3,
				"body": "> [reichardnixon](#comment_6_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): I wonder which news outlet this goy works for?\n\nTo the one that pays the most.",
				"added": 1567973079
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_626_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Ahh, Must be the CBC. Are you transgender?\n\nNothing is fixed, everything is possible.",
				"added": 1567973624
			}
		],
		"1567999355_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 5,
				"body": "I squash bugs. You could be the next.",
				"added": 1568024355
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 6,
				"body": "Not enough.",
				"added": 1571274783
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 7,
				"body": "Who said I care about niggers?",
				"added": 1574174202
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1179_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Who said we care about your message?\n\nWho said I care about what you care?",
				"added": 1574192598
			},
			{
				"comment_id": 9,
				"body": "> [pineapples](#comment_129_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i bet £10 that edgelord and whitepower are the same person lol\n\nYou lose. Flush your £10 down the drain.",
				"added": 1574346840
			}
		]
	},
	"comment_vote": {}
}