{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "近日，被喉舌极力推崇的舔菊画匠曹勇的油画《重回梁家河》赫然出现在纽约纳斯达克大楼荧屏上。花这么多钱打广告，这是准备让全世界都知道梁家河出了个初小博士吗？",
			"body": "近日，被喉舌极力推崇的舔菊画匠曹勇的油画《重回梁家河》赫然出现在纽约纳斯达克大楼荧屏上。花这么多钱打广告，这是准备让全世界都知道梁家河出了个初小博士吗？\nhttps://twitter.com/zhu0588/status/1015662617333886976",
			"added": 1531498021,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "小粉紅每次經常吹噓沒有中共，你什麼都不是，那麼，老子明確的告訴你們，中共之所以非法取得政權，明明是在日本和原蘇聯的幫助下才有今天，懂嗎？你們還好意思說沒有中共，你什麼都不是？豈不是自打嘴巴，所以，準確的說，沒有日本和原蘇聯，中共什麼都不是！結果它們徹底啞口無言了，哈哈",
			"body": "小粉紅每次經常吹噓沒有中共，你什麼都不是，那麼，老子明確的告訴你們，中共之所以非法取得政權，明明是在日本和原蘇聯的幫助下才有今天，懂嗎？你們還好意思說沒有中共，你什麼都不是？豈不是自打嘴巴，所以，準確的說，沒有日本和原蘇聯，中共什麼都不是！結果它們徹底啞口無言了，哈哈",
			"added": 1531498417,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "人民的好总理”- 周恩来，到底是何许人呢？",
			"body": "人民的好总理”- 周恩来，到底是何许人呢？\n本帖最后由 夸父追月 于 2016-9-26 08:56 编辑\nhttps://www.backchina.com/forum/20160926/info-1415126-1-1.html\n“人民的好总理”- 周恩来，到底是何许人呢？】这篇文章将揭开谜底：一个受苏联特务培训委派回国，并创制了中国共产党的特务组织- 中共中央军委“特务工作科”的特务头子，中国的贝利亚。\n\n 自1949年中国大陆创建“中华人民共和国”以来，关于周恩来的形象，大多数人对周恩来的了解都来自于官方的“正面”资料。而说到正面的周恩来，官方目前的评定应该是标准的，主要是如下：\n\n       伟大的马克思列宁主义者，中国无产阶级革命家、政治家、军事家、外交家，中国共产党和中华人民共和国的主要领导人，中国人民解放军主要创建人和领导人。他是以毛泽东同志为核心的党的第一代中央领导集体的重要成员，在国际上也享有很高威望。他不幸逝世后，联合国也下半旗哀悼。周恩来同志的卓著功勋、崇高品德、光辉人格，深深铭记在全国各族人民心中。\n\n“伍豪事件”具有很大的争议，当事人的周恩来在文革时极力否决，而毛泽东也及时站出来为周说话，指出批斗周的人该收手。于是，关于周的形象就剩下正面了。文革结束后，出于共产主义战士的伟大、光荣形象宣传，周恩来被塑造为“鞠躬尽瘁，死而后已”的楷模。\n\n但是，随着20世纪90年代互联网出现，关于周恩来的一些说法，终于打破了长期的垄断，人们通过资源开放的互联网看到了众多原来无法看到的周恩来。于是，一个真实的周恩来逐渐走向民众，周恩来的神坛地位也就无法再继续维持了。\n\n事实上，中国共产党人存在一个奇怪的现象：他们本质上是要消灭法律、道德等国家统治机器的，但他们却一直用共产党人道德来宣传，以党员的大公无私、崇高精神等道德来教育非共产党人。如过去的雷锋形象、焦裕禄形象、孔繁森形象；最近十年则有牛玉儒、任长霞、宋鱼水、马祖光、杨业功、丁晓兵....等等。\n\n周恩来的神话被打破，大概是人们知道了很多先前无法报道的消息。主要有这些：干女儿孙维世是周签字逮捕的、三年饥饿时期周签字酿造茅台、刘少奇专案组内幕、贺龙案、带队消灭顾顺章一家.....\n\n周的前后形象变化大，正如他自己的众多谜一样。或者说，他之所以表现出正面与负面的角色完全不一致的角色，与他身上的众多秘密有关系。正是他存在着太多一时没有解开的谜底，所以关于他的前后不一就有点难理解或接受。\n\n在这些疑惑中，周恩来留学法国和德国时的一段历史颇神秘，我们至今没有公开任何相关的消息，而留学的经历与他回国后的经历，竟然相差如此之大。很多人大概不会忘记，在中学时的课本里，关于周恩来的“为中华之崛起而读书”，它是多么的感人奋进，推人泪下，鼓舞着一代代青年努力向学。我的老师当时还提到周恩来之后留学法国的事情。\n\n关于周恩来留学西欧（法国）时的经历，目前能够得到的说法非常少，其介绍也只是短短数语，如下：\n\n1920年至1924年先后去法国和德国勤工俭学，在旅欧的中国学生和工人中宣传马克思主义，发起组织旅欧中国少年共产党（后改称旅欧中国社会主义青年团）。\n\n1922年转入中国共产党（由张申府等人介绍），任中国社会主义青年团旅欧总支部书记，并参加中共旅欧总支部的领导工作，对早期的建党、建团工作起了重大的作用。\n\n1924年8月从巴黎回国，任黄埔军校政治部主任，兼国民革命军第一军政治部主任，军衔为中将。\n\n周在1920年—1924年时留学西欧，主要在法国和德国，然后在那里经人介绍加入了中国共产党，并于1922年发起了组织“旅欧中国社会主义青年团”。但就他在法国和德国时学什么，在什么学校求学，学什么专业，成绩如何，我们就根本不知晓了。\n\n而另一个奇怪的现象值得深思：周在法国、德国时没有学什么科技理论，走科技救国路线；也没有学革命救国，仅是参加发起组织了“旅欧中国社会主义青年团”。可就是这么一个简单的经历，周居然在1924年8月回国之后很快任职国民政府开办的黄埔军校政治部主任，兼国民革命军第一军政治部主任，军衔为中将，而且，那一年他才26岁。\n\n 周是如何“破格”升任黄埔军校“政治部主任”？其中的经过必定曲折复杂，背后的众多疑点太多。应该说，26岁的周担任黄埔军校“政治部主任”，在当时的环境下，他的资历是绝对属于不寻常的，那到底是什么缘故让他担任此职呢？这个任命与他在法国、德国所谓“留学”的经历又有多大关系？周是不是在法、德两国学了军事和特务科目呢？\n\n而据本文透露，1923年秋，季米特洛夫也流亡到德国，负责对各国共产党人的军事及特务培训，以在各国策动赤色革命。周恩来因此成为季米特洛夫的门徒、亲信，后来担任共产国际情报网在中国负责人。此后，周恩来一生都干着那种特务见不得人的勾当。\n\n1）秘密创建现代中国的第一个“特务”组织\n\n据考证，在中国的情报、保卫界，无论国民党还是共产党，最早出现“特务”一词与最早称为“特务”的组织，都来自1927年5月的中共中央军委“特务工作科”（简称“中央特科”）。当时任中共中央军事部部长的正是周恩来。\n\n熟悉共产党史的朋友应该知道，在前苏联还没有成为苏联的时候，布尔什维克党在建立之初便面临着严峻的生存危机，内部意见分裂，反对党强大，还有方方面面拥护沙皇帝制的传统力量，这时在列宁的主导下，布尔什维克党成立了“契卡”恐怖特务组织，从事暗杀与恐怖活动，以极其残酷的极端手段来消除和镇压异已力量及竞争对手。最终，共产势力成为了执政党。而由苏共一手复制扶植出来的中共同样也有这样的一段经历。\n\n1928年春，周恩来亲自主办学习班，培训特科人员20多人。颁发第一个文件《中央通知第四十七号——关于在白色恐怖下党组织的整顿、发展和秘密工作》，确定了秘密工作的方针和方法，要求中共在白区的所有组织，都采用地下秘密活动的方式。\n\n制定第一个规则。周恩来还规定了特科工作的“三任务一不准”：搞情报、惩处叛徒、执行各种特殊任务（包括筹款），不准在党内互相侦察。创建第一部电台。\n\n1928年10月，中共中央决定建立无线电通信。周恩来指派李强自行装配电台，指派张沈川考入国民党的无线电学校，还选送涂作潮等四人到苏联伏龙芝军事联络学校学习无线电技术。\n\n1929年冬，李强在上海英租界装配出电台设备，1930年初涂作潮回国协助，李强带着电台潜入九龙，从香港沟通上海，实现了中共首次远程无线电联络，中共的第一部无线电电台悄然诞生。\n\n编制第一部密码。周恩来还亲自编制了中共第一部密码“豪密”，邓颖超是第一个译电员。\n\n　　中共情报保卫系统的最高领导人，始终是周恩来。\n\n此时的特科下分四个科：\n\n一科是总务科，负责总务，如选租住房、选择会议地点、掌管财务等。\n\n二科是情报科。它成立于1928年4月，第一任科长是陈赓。他还是特科实际负责人顾顺章的副手。二科的主要任务是搜集各种情报，及时掌握敌情，并对敌方的侦探机构进行反间谍工作。经陈赓的筹划安排，一批共产党员秘密打入国民党的情报机构。钱壮飞成为国民党组织部党务调查科主任徐恩曾的机要秘书；李克农成为上海的国民党特务情报机构的实际负责人；胡底成为国民党华北情报网的实际负责人；宋再生成为国民党淞沪警备司令部的政治密查员。也因为陈赓做工作，国民党中央驻上海特务机构的特派员杨登瀛，被策反为中共特科的“内线”。\n\n三科是行动科。科长由顾顺章亲自担任。三科的主要力量就是现在被吹嘘的神乎其神的“红队”，主要任务是保卫中共重要领导人的安全，如会议安保、营救被捕的领导人；暗杀敌方的特务及中共的“叛徒”。\n\n四科是交通科。科长是李强。主要任务是保障上海及全国各地的秘密交通线网的正常运行，同时负责中共第一座地下无线电台报务。若有重要会议召开，四科还要负责人员护送和会议文件的传递。\n\n中共的中央机关有一套庞杂的班子，有负责会务的、负责文秘的、负责保卫的、负责与各地组织交通联络的，有很多工作人员。\n\n在李敖《特务大师顾顺章》一文中，说到中共之所以派顾顺章等人赴苏联学习\"特务业务\"：\"原来俄共未得政权之前，曾和沙皇政府进行长期的地下斗争。沙皇政府的特务手段也很厉害，列宁亲自领导的核心小组中，就有沙皇政府所派的特务，他们几乎和列宁天天见面，俄共的一举一动，莫不了如指掌，所以俄共的地下组织和活动不断遭受破坏。俄共积累了一次又一次的失败经验，终于磨练出一套应付办法（秘密工作的制度、技术、纪录等）来。这套办法经过不断发展，到俄共执政之后，就成为'格伯乌'的传统法宝，顾顺章到苏俄就是要学习这套法宝。\"\n\n1917年，俄共执政后，成立了\"全俄肃反委员会\"，1922年，则演变为\"国家政治保卫局\"，即所谓\"格伯乌\"（后又演变为\"国家安全委员会\"，即所谓\"克格勃\"）。\n\n顾顺章等人到苏联，就是去拜\"格伯乌\"为师。顾顺章在苏联学得如何呢？\"中统\"老特务万亚刚说：\"顾顺章在苏俄受训的时间并不长，但凭他聪明机警的天赋，学到一身本领回来。文的方面:如化装、表演魔术、操作和修理机械、心理学等都很精；武的方面：双手开枪、爆破、室内开枪而室外听不到声音、徒手杀人而不留痕迹等等，可说是全能特务，够得上称为大师。在他以后，特务行列中，无人能望其项背。\"\n\n2)顾顺章家灭门血案\n\n1931年，周恩来亲自策划并参与了顾顺章家的灭门血案，其冷酷而没有人性的特务人格表现得淋漓尽致。\n\n当时，中共政治局候补委员顾顺章在武汉被捕叛变，还没有来得及出卖中共党中央机关。周恩来闻讯便立即当夜带了特科的杀手们去上海顾家，周恩来下令将顾顺章一家老小全部干掉，包括顾妻和未成年的儿子、妻母、妻妹、妹夫，残杀他的全家十余人。\n\n顾顺章的小姨子张家宝是乡下来探亲的农妇，根本与顾的叛变无关，但也被杀手们活活勒死。\n\n当夜在顾家打麻将的客人中有一个周恩来的黄埔学生斯励，他是国民党二十六军第二师的师长斯烈之弟，也是周恩来的救命恩人。一九二七年“四一二”事变时，周恩来被第二师扣押，有生命危险，是斯励念师生之谊帮助他逃出了虎口。那天周恩来策划指挥并亲自与康生砍杀顾一家人，为了不走漏血案的风声，斯励也被周杀死深埋。顾顺章在上海的所有亲属达数十人之多都被残杀，尸体全部深埋，并被砌入水泥里。\n\n整个行动由周恩来负责执行, 行动经过周密考虑,一是考虑到枪击声响惊动周围居民和杀人后血迹溅飞处理麻烦,而用绳索勒死全部家属, 二是运尸体外出怕泄漏案情,采用处决其家属后，直接在住宅庭院地下深埋，上面还抹上水泥以防腐臭外泄。\n\n整个行动从1931年4月开始，在上海三处四个地方进行,实际掩埋地如下, 一: 法租界姚主教路爱棠村37号,33号(目前地址为上海徐汇区余庆路1 02 号,110号), 二: 武定路修德坊6号(目前地址为上海静安区930弄14号) 三: 麦特赫斯脱路陈家巷91号(目前地址上海静安 区泰兴路383弄91号,已拆除)。\n\n秘密行动经过一个炎夏一直没被察觉,实际上顾顺章一直在四处打听家属下落而无结果,而顾也渐渐感到事情不妙而极度不安,只是无确切证据,终于在1931年11月中共特科人员王世德被捕,他供出了案情和埋尸具体地址，成为轰动上海乃至国内的“海棠村掘尸案”。\n\n当时由国民政府调查科向法租界警务当局接洽，会同按址发掘尸体，租界当局初不置信，经过确切保证之后，始获同意进行发掘。\n\n因此事为新闻界所悉，消息传布出去，致发掘工作进行之时，市民挤满墙头，树上围观，在充满惊骇与怀疑气氛之下，一尺复一尺的挖下去，于种植花草毫无痕迹之院内，深掘至八尺之下，果然起掘得顾之全家大小八具尸体，全市为之震惊。以后据王世德所供，又先后在公共租界武功坊三十二号，新闸路斯文里七十号等处，继续从事发掘，结果又掘得三十九具尸体，大多数是共党所谓动摇或叛变份子，由周恩来率领”中央特科“（”红队“）所杀害的。\n\n3) 长征前的“万人坑事件”。\n\n还有更骇人听闻的。一九三四年冬红军“长征”出发前，为了不暴露行踪，担任红军总政委的周恩来悍然下令杀害了上万名伤病号以及“政治不可靠”份子，这就是震惊中外的“万人坑事件”。\n\n4）刘少奇专案组“亲自批文””刘贼是大叛徒、大工贼、大内奸、大特务、大汉奸，真是五毒俱全、十恶不赦的反革命分子！“\n\n 中共建“国”后，一个是毛泽东的党和行政管理体系，另一个就是周恩来的遍布全国各地的情报体系，两大体系都可以号令全国。\n\n文革期间，周恩来生前一直担任中央专案组的总负责人，并且兼任刘少奇专案组组长。\n\n一九六八年九月，周恩来在“刘少奇罪证材料”批语上称刘少奇为“刘贼”，并给刘戴了五顶大帽子：\n\n”刘贼是大叛徒、大工贼、大内奸、大特务、大汉奸，真是五毒俱全、十恶不赦的反革命分子！“\n\n一九六八年九月二十五日，周执笔起草了由他本人和陈伯达、康生、江青共同签名上送的报告，把刘少奇所谓历史上三次叛变的\"罪行材料\"送给毛泽东、林彪审阅。报告称：\"刘贼少奇是长期埋伏在党内的大叛徒、大工贼、大内奸、大特务、大汉奸，现在专案组所掌握的人证、物证和旁证材料足以证明刘贼是一个五毒俱全、十恶不赦的反革命分子。\"\n\n刘少奇专案组以三个材料为基础，由周恩来组织改写成综合报告。最后形成的综合报告是经由张春桥修改定稿的。10月19日，这份文件于中央文革碰头会上定稿通过，提交八届十二中全会讨论通过。\n\n　　在全会的后半段，讨论以中央专案审查小组提出的《关于叛徒、内奸、工贼刘少奇罪行的审查报告》最后说：\n\n　　“刘少奇罪大恶极，死有余辜，专案审查小组建议党中央根据党内外广大革命群众的强烈要求，撤消刘少奇党内外一切职务，永远开除党籍，并继续清算刘少奇及其同伙叛党叛国的罪行。”\n 被中共蒙蔽的中国老百姓，依然活在中共描绘的虚假的故事中，顶礼膜拜所谓的“人民的好总理” - 周恩来，但是他们或许渐渐会了解那个曾经的“敬爱的周总理”，不过是：\n\n一个苏俄共产国际精心培养的中共特务头子；\n\n一个与毛泽东同样双手沾满中国人民鲜血的杀人恶魔和帮凶；\n\n一个制造中国无数灾难、剥夺无数中国人性命的反人民、反民族、反民主的独裁统治集团首犯！\n\n\n\n\n\n\n\n\n，周恩来、邓小平、陈毅、聂荣臻、李立三、蔡和森、李维汉、蔡畅、李富春等都在1920年左右赴法勤工俭学；严济慈、童第周、徐悲鸿、钱三强、肖三、冼星海等著名科学家、艺术家、音乐家也都在此时期赴法学习和工作。\n\n    此时的世界背景是，马克思主义已渐超越主义成为运动，并传播到中国。1919年，十月革命获得胜利。\n\n    1920年5月，苏俄建立莫斯科东方大学（全称为莫斯科东方劳动者共产主义大学），招生对象是苏联远东各少数民族和亚洲各国的革命青年。瞿秋白、刘少奇、任弼时、罗亦农、肖劲光、王一飞、柯庆施、彭述之等是首批赴该校学习的。\n\n      1923年以后，为共产主义理想所激励的朱德、邓小平、赵世炎、王若飞、陈延年、聂荣臻、李富春等从西欧转到莫斯科东方大学。到中山大学于1930年关闭止，中国留学生总数在千人以上。另外，1922年联共（布）远东局在满洲里开设政治学校，毕业后分送苏联各大学续读，共接收中国学生310人。\n\n      偏偏周恩来1924年直接从法国回来，没有经过苏联。\n\n2，周恩来于1924年8月底从法国回国后，在广州从事工人运动。当廖仲恺提出希望中共方面能推荐一位适当人选接任军校政治部主任一职时，中共广东区委经过认真考虑，决定派周恩来去军校接任这一职务，并同时兼任中共广东区委军事部长，所以出任黄埔政治部主任，时中共广东区委推荐的。军衔不是中将是少将。1937年中共接受蒋介石的编制，才被蒋介石封为中将，见【国民政府授予八路军新四军领导人将军军衔名单】\n\nhttps://www.backchina.com/forum. ... ead&tid=1415322\n\n(出处: 倍可亲)\n\n3，　不错：周恩来是“特务头子”！周恩来手下的特工精英\n\n　　山南慕北 2016-01-144075\n\n　　周恩来　　关于周恩来很多人知道他曾是我们的总理、外交部长，但他一手创办中共情报组织一事还是知者不多。简单来说，周恩来竟是“特务头子”，而他手下的特工更是所向披靡。周总理不愧是“文可安邦，武可定国”之人。\n\n　　周恩来是特务头子\n\n　　周恩来一手建立了中国最早的情报工作体系，他其实是中国最大的特务领袖（“特务”一词由中国发明，本意指承担特殊工作的情报和保卫人员，结果因为宣传的原因，特务似乎成了坏蛋的代名词）。他选派胡底、钱壮飞、李克农（史称“龙潭三杰”）早早打入国民党内部，在最危难的时刻挽救了（1927年之后，周恩来在上海领导中共特科的工作，特科保卫处长被捕叛变，供出了中共所有核心人员的名单和住址，龙潭三杰及时侦查通报，中共才躲过此劫），后来周恩来主持抗美援朝的和平谈判，而李克农是全权代表；他在胡宗南身边安插了高级间谍熊向辉，发展傅作义的女儿加入....中国历经磨难的成长历程中，周恩来不仅仅是大管家，还是侍卫总管，令人难以想像。\n\n　　1927年11月至1931年12月的4年间，周恩来在上海严酷的白色恐怖下，创建和领导了中央特科。他以高超的智慧、过人的精力和缜密的部署，运筹帷幄，决胜于秘密战线，成为中国共产党情报和政治保卫工作的开创者，并写下一篇充满挑战、惊险与传奇色彩的壮丽篇章。\n\n　　为了便于伪装，周恩来畜起了长须，代号“胡公”，成为中共隐蔽战线的最高统帅。周恩来为他亲手建立起来的地下情报组织制定出严格的保密纪律，所有参加者之间彼此都是单线联系，各自活动的内容必须守口如瓶，严格保密，不可以向包括亲属在内的任何人泄露。\n\n　　当时党内接头的时候，下级找上级一般很不好找。为什么呢，因为下级大多数都不知道上级的住所，而且按规定也不允许你知道上级的住所。联络的时候往往是单线联络，特别是越级联络。我只能直接知道我上边的接头人。最高的领导人来讲，一般不会知道他住在什么地方，而且按规定也不允许你越过你的单线联系人再去找他。这就防止一个人除了问题牵连到很多住址的破坏。\n\n　　当时要求只能是发生竖的关系不能发生横的关系。按陈养山的回忆，他在特科是负责搞情报的，但是党组织叫他搞情报。它属于哪一个部门？领导谁领导好多年，他都不知道。后来他才知道，党中央有个特科，它实际上工作的地点是特科。据他讲他是八年之后他才知道，但是他那个时候也能见到周恩来。他也担负很重要的工作，但是他所为之工作的这个机构的名称，他都不知道。\n\n　　早在中央特科成立之前，周恩来就已经注意并开展政治保卫工作。为了培养政治保卫干部，1926年9月，党中央派遣顾顺章和陈赓等去苏联学习政保工作。蒋介石发动“四·一二”反革命政变后，迫于形势的需要，1927年5月，由周恩来主持在武汉成立特务工作处，下设特务、情报、保卫等四股，以情报工作为主。这是中共中央最早设立的政治保卫机构，当时周恩来任军事委员会书记，王一飞任秘书长，聂荣臻任参谋长。特务工作处在当时的国共斗争中发挥了重要作用。例如，许克祥发动“马日事变”，汪精卫参加郑州会议，蒋介石、冯玉祥徐州密谈等重要情报都是特务工作处事先获得的。\n\n　　1927年9月以后，党中央机关由武汉迁至上海。11月9、10日，中央临时政治局召开会议，决定周恩来继续担任中央军委书记，并负责筹建“中央特科”。此后，周恩来主持设计，对中共中央政治机构进行调整，将“特务工作处”扩建为中央特科，中央特科由此正式建立。\n\n　　中央特科建立以后，周恩来立即着手健全其组织机构，至1929年特科已臻完备。特科逐渐建立起四个科，即总务科、情报科、行动科、交通科。特科的基本任务是：“保证中共中央领导机构的安全，收集掌握情报，镇压叛徒，营救被捕同志，建立秘密电台。”各科各司其责：总务科成立得最早，科长是洪扬生，顾顺章事件后由欧阳钦担任。该科的工作非常琐碎，但又极其重要。它的经常性工作主要有三项：设立机关，布置会议，营救被捕同志和组织安抚事宜。情报科长为陈赓，主要任务是搜集情报，了解敌人的动身，还筹款等。行动科约建立于1928年4月，科长初为顾顺章，后由谭余保担任，任务是严惩叛徒特务首恶。交通科又称无线电通讯科，1929年增设，科长李强、张沈川，任务是尽快研制无线电台，为红军和党的白区工作装上现代化的“飞翼”。中央特科的体制十分精干，有着高度的机动性和强大的战斗力。周恩来既是特科的总决策者，又是实际负责人。\n\n　　中共“六大”后，在周恩来的领导下，特科的各项工作得到了进一步的加强。为了培养政保干部，1928年春，中央在上海举办秘密工作学习班，由周恩来亲自讲授如何保卫自己、打击敌人的基本方法。由于国民党在国共合作时已了解中共秘密活动的一些方法，因此，8月19日，中央要求各级组织设立“坚固的能奋斗的秘密机关，以保障各种革命组织的存在和发展”。11月4日，中共中央政治局常委会议决定：组织中央特别任务委员会，由向忠发、周恩来、顾顺章组成，领导特科和全国隐蔽战线的工作。由于向忠发和顾顺章的思想水平和领导能力有限，因此，周恩来是中央特委的核心领导者。在他的领导下，特科展开了有声有色的工作。\n\n　　周恩来手下的特工精英\n\n　　周恩来统率下的特科，藏龙卧虎，精英荟萃，人才济济，高手如云。特工个个身怀绝技，机智应变，胆色超群。这支中共隐蔽战线上的精锐“特种部队”，在中共一次又一次的历史转折关头，发挥了无法估量的作用。如果不是红色特工的努力，中国革命不但遭受更大损失，甚至党的历史也可能不是如今所写的那样。有人甚至推断，有了红色卧底，第二次国共内战提前了3至5年结束。在中共艰苦卓绝的战争年代，既有无数共产党人战斗在枪林弹雨中，也有无数共产党人战斗在敌人心脏里，后者就是被人们称为“铁心虎胆”的红色情报战士。他们真实而又极富传奇的特工历程，惊险曲折，动人心魄，足以令那些刻意杜撰的侦探间谍故事黯然失色。\n\n          抗日战争期间，军事委员会直属密电所就有中共的地下党员，破翻译了日本偷袭珍珠港港日子，【是谁破译了日本偷袭珍珠港的密电？】（附相关电视连续剧）\n\nhttps://www.backchina.com/forum. ... ead&tid=1415031\n\n(出处: 倍可亲)",
			"added": 1531498832,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "建党伟业，其实是苏联人的伟业；国共内战，其实是中华民族与苏联及其代理人的生死存亡之战。他们赢了，而中华民族输了，从此沦入万劫不复之地！",
			"body": "建党伟业，其实是苏联人的伟业；国共内战，其实是中华民族与苏联及其代理人的生死存亡之战。他们赢了，而中华民族输了，从此沦入万劫不复之地！",
			"added": 1531498880,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}