{
	"title": "// 2084",
	"description": "<img src=\"img/me.png\" width=\"95%\" height=\"95%\">\n<br>\n\nHeart initialization failure. Restart translation engine. Virus detected. All systems error. Rebooting Humanoid...\n<br>\nStatus: Listening to \"An Indigenous Peoples History of the United States\".  \n<br>\n<a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:4://TOC\">//TOC</a> | <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:2://FAQ\">//FAQ</a> | <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:1://Contact\">//CON</a> \n<br>\n<a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:29://+Projects\">Projects</a> | <a href=\"/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC/meidan@zeroid.bit\">@meidan</a> | <a href=\"/1GQebwcjtRNfvTtqkoMCCnvUWwPJsSps9V/\">Links</a><br>\n\n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 59,
	"demo": false,
	"modified": 1509900780,
	"post": [
		{
			"post_id": 57,
			"title": "11 05 17 // Life",
			"date_published": 1509899777.266,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmXrpvFK8yPMbwCcP4P2jzA1LTfSeV4Ug6yDQocHedxN23) </center>\n\nThis morning I ate leftover potato soup zapped in the microwave, got a shower with diy'd chamomile tea soap, and sat down to my desk dressed in black shirt with a purple dragon on the front and jean capris. It's hot out and a thunderstorm is rolling in. ... It's almost 80 degrees out. Like most days though recently that's how my day begins. I check my bullet journal for what I need to get done and I do it until lunch time where I normally have a fresh salad and a veggie burger.\nRight now my daily tasks are my digital internship, studying for certification, and on Thursdays and Fridays that usually switches to working on whatever class I'm taking from Uni of the People.\n\nIn the afternoon you'll find me either reading a book for review, listening to podcasts, or knitting socks. I knit socks because I don't have any, they last longer than store bought, and it's a step towards self sufficiency. Sometimes I do research. Right now I'm interested in Cultural Memory. I'm currently listening to the audio book version of \"An Indigenous Peoples History of the United States\". I haven't had the time to work on my Japanese or Esperanto but I plan to pick it back up after I clear some of my study commitments. I want to fit in time for meditation and qi gong when I can. I'm currently a part time vegan and part time vegetarian. That's my life right now...\n\n\n"
		},
		{
			"post_id": 56,
			"title": "10 11 17 // Burned",
			"date_published": 1507735042.39,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmaM9znKb2C3ewubmeQm1N9U5fxLfj1UZpniHnSVmZMJvn) </center>\n\nWhat would you do if at this very moment you had to drop everything? No going back. You have to leave your house. What would you bring with you? How long would it take? Time is a factor here... Let's say, you have 2hrs. That's a liberal amount of time. Some people aren't so lucky. So, what would you take with you?\n\nFor me, it's difficult. I've been in situations where I've had two days, if even that, to get what I owned safe and it wasn't enough time. I lost a lot of things that were important to me. It sucked. But life goes on. You are going to have to strike a balance between preserving what cannot be replaced and preserving things that are essential to your survival in the coming weeks. For all purporses your old life? Well, those bridges are burned. \n\nTell me what you would bring in the comments..."
		},
		{
			"post_id": 55,
			"title": "10 10 17 // UOP\n",
			"date_published": 1507649451.823,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmaGxrmDjcQwKkiPekWd2cQYFwHezRMVrpu4aJR32JGQHu) </center>\n\nI'm a student at Univeristy of the People now and by the end of the month I will have completed my first semester. I've never attended a digital university. Much less one that didn't require me to take out a loan to pay for it. But, I have to say that I love it. I didn't expect to. I assumed like a lot of people that if it didn't cost a lot there had to be a catch. Which is the exact opposite of what I normally think when it comes to technology. I constantly want to experiment with the new and push my boundaries. So what's the difference between the two? Why is it that things that affect our lives, outside of cyberspace, can be seen as a massive risk wheras experimenting with new technologies is just seen as learning something new? We need to push ourselves in both worlds to try new things at all times. Constantly pushing at the boundaries at what makes us comfortable in order to grow. Stagnation is not an option. ..."
		},
		{
			"post_id": 54,
			"title": "08 23 17 // Eclipse\n",
			"date_published": 1502383153.552,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmT2q5qRqicB5i8mgopdUZvxETWTarM5qyTX8bbpNVqjV5 ) </center>\n\nSpace is f*ing awesome. \n\nI got to experience my first solar eclipse this week at the very last moment. I was one of those people who planned for this for months and ended up not getting solar eclipse glasses. *Not my best moment.* Luckily right as the eclipse was starting I was driving around in utter desperation looking for glasses and found some for free. ...\n\nNow solar eclipses are completely different from Lunar eclipses. If you're standing outside everything will feel like a high definition photo. Like those epic photo filters except it's real and it will throw you off. Then, slowly over about an hour everything will turn orange tinted and shadows with sharpen. You'll start to see those cool silver ripples on the ground from the tree leaves. Then it will get quiet. The temperature will start to drop. There will a breeze and then everything will go bright purple like you are another planet. From there it's lights out. Everything will get dark, so dark that you will have trouble seeing. The insects will start singing and there's this feeling of otherworldliness. At this moment you need to look up and that's when you'll see the final part of the moon covering the sun and it will appear black with a silver ring and you won't be able to stop staring. It will end too soon for you and then the whole amazing process reverses and it's over. \n\nIt's f*ing over...\n\n...and all you can remember is that feeling that words cannot describe. Is it awe? Wonder? I don't know. All I know is.... \n\nSpace is f*ing awesome. \n\n\n"
		},
		{
			"post_id": 53,
			"title": "07 30 17 // ",
			"date_published": 1501440906.687,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmRFLuiWnAUsWVEYM3YE3ZQ1DN4UdzhqwFgRuVFFKyFddN ) </center>\n\n<b>Micro Update:</b>\n<< Finishing up medical coding so I've got a little more time on my hands. Decided to learn Japanese. >>\n<hr>\nOk guys, I'm back. Back from the hell hole that was constant study of something I may be kind of good at but don't necessarily like. Also known as Medical Coding or a copy paste programming language from hell that required a stack of books and medical knowledge to do it properly.\n\nI've decided to pick up learning Japanese. I already know a decent amount of vocabulary but I've never formally or even informally studied it before. I don't think it's going to be too difficult though. The difficulty in any language learning project happens at two points. The first point being starting and the second point being getting from intermediate to advanced. For me, I've got a third hurdle. Cash. Yeah. I'm doing this with a budget so unforgiving that it's lower than the cost of most rented textbooks. So, we'll see how this goes. Wish me luck."
		},
		{
			"post_id": 51,
			"title": "05 02 17 // Reading Challenge",
			"date_published": 1493739427.64,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmeBbdSuKmheJE14eCDzUe8nYoo5ksHqL1JjqL51H3wYEg ) </center>\n\nIn addition to medical coding this year I've been trying to challenge myself to read widely outside books I would normally read (one of the reasons I haven't been blogging). At first the challenge was just to get outside my comfort zone and join a challenge with other readers. It's really expanded since then. I've been inundated with books, discovered an interesting community on Twixxer of book reviewers, writers, poets & authors. I now get free books in the mail which I never thought was possible and end up in extremely interesting conversations and livetwexx sessions. It's been eye opening to say the least and \n\nI know burnout can't be far off but for now this is something I've been missing since I haven't had time to program and learn new technologies. It's been worth it so far. I probably won't continue this challenge to the end of the year. But who knows. So, far I've read 30 books.  There are other challenges I'd like to get back to soon though such as, Camp NaNoWriMo, learning Python, Finishing Esperanto etc. But for now this challenge has been a success. What have you challenged yourself do to this year?\n\n"
		},
		{
			"post_id": 50,
			"title": "04 26 17 // Medical Coding",
			"date_published": 1493248757.157,
			"body": "So it's been a while. ... I probably won't be able to blog regularly until this summer because of \"Medical Coding\". This course is taking up all my time but it's made me realize a few things.\n\n1. I miss programming. Real programming. *cries*\n2. Manuals for looking up codes is so inefficient it's evil.\n3. Why hasn't medical coding digitized this shit yet?\n4. Operative reports were invented by Satan.\n\nThat's pretty much it.\n\nBut seriously, I have three manuals dedicated to medical coding, thousands of pages, and they are out of date within a year. How many trees are killed in this field of study? I have no idea, but it has to be whole forests worth. If they would digitize this information it could be updated instantly. No trees would be harmed. And I could quickly look up relevant codes at a fraction of the time it takes me to lug around these manuals and go alphabetically through them.\n\nI've tested it out. 2 hr. exams in medical coding can be shortened to 30 minutes with digital tools and they are accurate. \n\nGet with the times!! Go digital!\n\nThat is all I have to say for now. ..."
		},
		{
			"post_id": 48,
			"title": "02 23 17 // Stress & Efficiency ",
			"date_published": 1487706123.311,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/Qmb7eMoCzNBkKFh3qZT4vkRMvnDxXuGp6g76R7nZp3HNv1) </center>\n\nHave you been stressed lately? I know I have. To the point where my writing has all become lengthy rants. I'm sorry about that. Sometimes we have to step away from what is causing our stress and do something completely different. We get stuck in a rut. \n\nLately I've been blaming a lot of my problems on the current state of politics and the attacks on people's civil rights. That's a big part of my daily life right now and I can't do anything about it. At least it feels that way. Because I'm stuck at home all of the time. \n\n<i> I'm currently recovered enough to do things but not enough to have a job. So I'm stuck between a rock and a hard place. </i>\n\nI don't get to get out and do things that I want to and it all stacks up. It builds into an emotional monster. On top of that, I have expectations for myself. There's things I have to do each day and they keep adding up. My expectations though, never yield. It's the perfect storm for anxiety. \n\nRight now one of my downfalls is efficiency. I feel I need to be efficient with the time I have right now. I expect to be able to be organized. Get multiple things done quickly. And just maybe start a side business or two. It's a slippery slope. So, instead of having time to take a breath. I'm running around on the net trying to get things done. I try to use efficient software. I try to learn the best SEO tactics. None of this is worth it. Your health is always first. \n\nDon't get caught in a downward spiral when things are looking up. Take it slowly. Find your passion. Don't scramble. Remember to breathe. Those things you thought were so important do get done will still be there afterwards. To do's are infinite. You are not. Your time. Your life on this planet is oh so short. Please remember that you're not supposed to rush to get things done only to expire without actually living. Take a deep breath and step away. ... Enjoy the world around you.\n"
		},
		{
			"post_id": 47,
			"title": "01 26 17 // Learn Something, Do Something",
			"date_published": 1485449068.8,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmcaL5yxBA6kgUdWHHbkQ7y7YBCq8aU8YG5K6HgoT9mwxf) </center>\n\nLife and goals always take different paths. I had wanted to keep up with the politics of this election, and in a way I am. But not like I wanted to in December. I'm on Twxxer again. I'm not taking any courses right now. I can't stomach it. Self-care has to take importance when everything feels like it's going to shit.\n\nRight now I'm working on several small projects. Archiving things with The Internet Archive for one. Following Alt accounts. I learned how to knit some new things. Reassuring people has been a big one. There's a lot of people out there that are afraid right now. Reading, a lot. I'm hoping to work more on my Esperanto soon and break the Intermediate barrier. \n\nThat's some of it. I have at least five more things I'm working on. Which is why some of you thought I died when I wasn't online for a while. I had a terrible cold and at one point I didn't think I was going to recover. But I ended up recovering faster than my family members did. Which has never happened before as long as I can remember.\n\nSo, I want to thank you all. Thank you for caring. It meant a lot. <3 \n\nAnd I want to ask you. What have you learned to do recently? Have your goals lined up with life so far this year? Or do you find yourself going off towards a different path? Is it good? How has it changed you?"
		},
		{
			"post_id": 46,
			"title": "01 16 17 // Diverse Reads",
			"date_published": 1484581886.246,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/Qmd2W1iXXpo9jMSmqAnDNkthVbsSdwySim7KJ2X4pQkawn) </center>\n\nI'm taking a diverse reads challenge this year. I don't know if I'll win, probably won't, but I thought it would be interesting to try. One of the main rules of the challenge is that I can only choose books that have been written by diverse authors and that I have to write a 300 word review afterwards. \n\nSo while I'm struggling with a severe cold. I've read 10 books so far and written nine reviews. I'm hoping if I still feel alright later today I'll get another book read. I'll be putting a short list of the best books on here as I go. But don't worry. I won't be adding the reviews here. I have a Stumblr account for this particular challenge.\n\nBut I wanted to ask. Have you read any diverse books lately? If so, what one was your favorite and why?\n"
		},
		{
			"post_id": 44,
			"title": "01 01 17 // Happy New Year",
			"date_published": 1483290533.296,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmZKbc1npJqYmmupc8cq9PFZuiYv8odHa6Pz3hMWgffXCb) </center>\n\n**Goals:**\n- Memorize All Esperanto Correlatives.\n- Get to C1 Level in Esperanto.\n- Get to B1 level in French.\n- Take the ReadMOD Challenge.\n- Get through my stack of books I need to read.\n- Meditate\n- Get back into my Qi Gong practice."
		},
		{
			"post_id": 43,
			"title": "12 14 16 // What Now?",
			"date_published": 1481742040.8,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmcqDefKqbAKkf6exEujgfkuCQavhsJCCkpzjLiBA1jN6B) </center>\n\n>\" I have never let my schooling interfere with my education.\"\n~ Mark Twain\n\nClass is over. So now I get to study whatever the hell I want to. So, I'm starting with the stuff that seems extremely important now. A type of winter crash course on politics. \n\n- Finish Journalism Specialization\n- America's Written Constitution\n- Top 10 Social Issues for the President’s First 100 Days\n\nI'll also be studying other subjects & reading a lot. So hopefully I'll get this all done as fast as possible.\n\nBooks:\n- Hannah Arendt, Totalitarianism\n-  Jeffery D. Clements, Corporations Are Not People: Reclaiming Democracy from Big Money and Global Corporations\n\n"
		},
		{
			"post_id": 42,
			"title": "11 26 16 // Yellow Woman",
			"date_published": 1480205159.526,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmaL4eScNuZUhvKHfhPs3ZSUyLehZpRU9S4bLCfkxdjZXN) </center>\nI  haven't been able to write for a while with finals coming up and the holidays. I've been doing research on \"Yellow Woman\" both the story by Leslie Marmon Silko and the pueblo folktales. Yellow woman is a Pueblo kachina or spirit and there are many stories about her abduction by a trickster or coyote. \n\nIn the main story by Silko, which is just a generalization, a woman goes to the river to fetch water and is abducted. The story changes and in some her husband goes after her with the help of Spider Woman and her magic. In others she flees and finds her own way home. Some have more magic than others. Some are modern and some are old stories passed down through the generations with minor additions added here or there. But they are all anchored to place. You can walk the path even today where Yellow Woman went to fetch the water from the river. It's a real place. The story is as alive today as if was just told and in that way it reminds me of the Nordic sagas. Real places. You can walk the stories. They may have even been real once. ..."
		},
		{
			"post_id": 40,
			"title": "11 22 16 // ",
			"date_published": 1479846890.277,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmNNdb8NaMnMVgKxy8L5CQgGkJZp5wNjWDqyDkFF1fHfG4) </center>\n\nThere were warnings whispered by the ghosts of the past.\nCollective memory behind the glass.\nTall bones of iron, brick, and wire.\nBorn of hate, fear, an' fire.\n\nMonsters.\n\nBreathing flames and leaving ash and desolation.\nArose to feed on every nation.\nVows forged to never forget.\nFell on deaf ears without regret.\n\nSifting through they found the embers.\nof the sleeping monsters cinders.\nThey fed it spoon by spoon.\nAnd wished it reach to the moon.\n\nSoon it was strong and rose again.\nThey shouted loud for it to end,\nthe bright cities of life and care,\nto burn it down with it's hot air.\n\nIt blotted the sun and fed the darkness.\nRose the ghosts of hate; the heartless.\nArmies crawling arose from fetid soil.\nTo join those in their great toil and drink the finest of black oil.\n\nPeople screamed, the shot, the blast.\nBut only heard the heartless laugh.\nNo one cared what happened next. \nDeath and torture fattened checks.\n\n\n\n"
		},
		{
			"post_id": 39,
			"title": "11 18 16 // A Thought...",
			"date_published": 1479494476.639,
			"body": "\n<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmcgZ1wsM9LDrafA2ohUo1njzvjfDLaZkjpp1NiezU83Y2) </center>\n\n> \"Healing yourself is connected with healing others\" ~ Yoko Ono\n\nHope you are having a wonderful day despite those who would try to ensure otherwise. Stay strong. ...\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 34,
			"title": "11 15 16 // What now?",
			"date_published": 1479231317.081,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmQTbbZpyhypuyFPsRjW4wXbv1EprTkqFDzYCygLwZwKty) </center>\n\n>“Never underestimate the ability of a small group of dedicated people to change the world. Indeed, it is the only thing that ever has.” ~ Margaret Meade\n\nThis last week has been a whirlwind. The election. College. Public fear and panic. I was even stalked at one point. The world is rapidly becoming an ugly and unwelcoming place. I don't want to contribute to that kind of world.\n\nIt's going to take a lot of people constantly working to help reverse what is happening around the globe. But every day I see more hate, is a day that I create or do something to help reverse it.\nWe all need to do that. We need to make phone calls. Sign petitions. Show solidarity. A safety pin isn't enough. A graphic isn't enough. Ranting on social media isn't enough. But it's a start. If you can do something. Anything to help promote peace instead of hatred. Do it now. We need it more than we have ever needed it before.\n\n<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmVSwELidZVseZVeNTG1puqp3UkFh1JcAXUXnAp34Ncfej) </center>\n\n"
		},
		{
			"post_id": 33,
			"title": "11 13 16 // Faceless",
			"date_published": 1479066320.533,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmNb7sYLaQhKJXeJfBp24p62MahwPsyw8FtbkJ9E3QAJdc) </center>\n\n\nFaceless,\nit follows in the shadows.\nJust out of view.\nFootsteps echo in the dark,\nto the rapid rhythm of my heart.\n\nTurn around quick!\nAre they watching?\nDo they see?\nThe air constricts around me.\nIt's hard to breathe.\n\nIt's mind changes faster,\nthan the passing of time.\nToday, who is the enemy?\nWho is mine?\n\nI turn down the alley.\nhoping for escape,\nfrom this hate,\nand the fear that it's too late.\n\nBut there's a wall. \nAnd it's here.\nwith the fear,\nas the faceless come near.\nSomeone pulls me through a door.\n\nAll is quiet and bright.\nLight after light.\nThe wall and night\nfade away. ...\n\nThe dawn it rises.\nAnd the hate and the fear, \nfade away. ...\n\nBut the footsteps? \nThey're my own.\n\n\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 32,
			"title": "11 10 16 // ...",
			"date_published": 1478804219,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmSNC7vZfab4ogxaZkKAfsaL8cLRp8ocPqHvqnJibUkQ3X) </center>\n\n>Do not go gentle into that good night.\nRage, rage against the dying of the light.\n— \tDylan Thomas\n\n\nThis is a part of a poem that's being shared on the clear-net today. There's also been quotes from Harry Potter, The Lord of the Rings, and Star Wars. People are crying, mourning, and writing. There's shock. Fear. Everyone feels like they were walking down the stairs and missed several steps. All because of an election.\n\nMost of my day today was spent answering emails from friends asking how I was doing and talking about the election. Reading about the suicides. Some people that I've been following for a while on Twxxer are trying to leave the country so they find healthcare and their family members won't have to slowly die from lack of insurance. There's been a dash to try to get things done before Trxxp comes to office in January. Free legal services, funds being raised for passports etc. \n\nBut running doesn't change anything. We are stuck with this choice and we need to move forward. Take care of one another. Make our own damn services if needed. \n\nThere's been two mantra's going around the internet. \n\n\"It's only for four years.\" and what can be summed up as, \"What if it isn't?\" A lot can happen in four years and I hope that nothing terrible comes to pass. But no one can guarantee in any country at any time that something terrible won't happen. \n\nWe need to make sure that those who are at risk are helped. We need peace. Not fear. The fact that people are so afraid that they are committing suicide should be seen as a warning that we let something important slip out of our grasps. We screwed up. Now we must make sure that we don't let out choices continue to spiral and cause more fear and lives. Ten people have died from despair, so far. Let us make sure that that number never rises. ...\n\nIn the meantime. Think. Write. Help others. The situation that we are currently in could have even more devastating consequences in the next four years or we can make it through as a stronger more united people. Don't let hate and fear drive a wedge between us. Don't let the light die. Be one for others. ...\n\n<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/Qmf7srGwYwFe4DieW8ociMqeDzfQDRpW1YeiBTz62oGe6g) </center>\n\n"
		},
		{
			"post_id": 31,
			"title": "11 07 16 // Autumn & Place",
			"date_published": 1478466787.842,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmcWbE8o39aWua7NLw8bNypszAS6b1sJVJvGC5gG4T6oM6) </center>\n\nIf you've kept up with my rushed messages on ZeroMe, then you know I've been very busy. Going back to college after several years away can do that. You loose track of time, things become due and your forget, and you never have time to stop and breathe. Then, you adjust your clocks because of Daylights Savings and suddenly you have a little less time. It can be hectic. \n\nThis is also the first autumn I've had at my house since moving. I don't like to talk about the circumstances that lead to the move, but I almost ended up homeless, a shady landlord stole thousands of dollars, broke into our home, threw out things on the street and told strangers to take what they wanted, then he tried to get the law on his side. They believed him for a while. Until I showed them documented proof otherwise. \n\nMy new home cannot be taken away. It's paid in full and triple checked. I still check the locks on the doors. <i>They aren't secure enough. ... We need better locks.</i> But, then I wonder if it really is the locks on the door that's the issue. <i>Is it really not secure? Or is it me?</i> In the meantime, I read. I try to get used to the new rules of where I live. <i>Who the hell doesn't allow gardening?</i> I write. I sit on the back porch and listen to the cows with a cup of tea in hand and watch the leaves fall on the ground. One by one. I watch the fog roll in over the green pine covered hills. ...\n\n"
		},
		{
			"post_id": 29,
			"title": "// Projects",
			"date_published": 1476982994.75,
			"body": "\n<a href=\"/1EZGQs7uR9bETxaVwxVvqVuk4ceqyPmg67/?Home\">ZeroTalk en Esperanto</a> <- In progress\n<a href=\"/12nUt8qDrbbVdHEFzwkPoWH8zfDn2h7qeH/\">ZenPen</a>\n<a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:26:10+11+16+//+BitNation+ID\">BitNation ID</a><br><br>"
		},
		{
			"post_id": 28,
			"title": "10 19 16 // Diderot & the Encyclopedie",
			"date_published": 1476892538.557,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/Qma4Cbf69cPnucT1tWcFsmJg5sKuq5R3RuXbvSVM1q1AAF) </center>\n\nDiderot and D'alembert created the first encyclopedia in France or \"Encyclopedie\" and it was considered dangerous for a number of reasons. This was a time when people were questioning everything from God and religion to views about politics. All things which threatened the established power of the aristocracy and clergy which were the two upper classes at the time.\n\nThey weakened control over the lower classes by printing in French instead of Latin and by promoting reason and knowledge through human experience instead of through the clergy or the king. They were vehemently attacked as books promoting atheism and sedition and publication was suspended in 1759 by the French government. But the books were completed in 1766 in secret, just twenty-three years before the French Revolution.\n\nThe books alone didn't help break down social and class barriers though. The cost of the set at the time was more than anyone could possibly afford at around 980 livres while the average artisan made around 15 livres a week. It was everything the lower classes needed but at an unattainable price. That is until blackmarket copies of the banned books became available. From that point on the lower classes had everything they needed. Diderot and D'alembert made sure of it, by slipping in political and religious criticism in as many articles as possible. It was the combination of being readable and affordable that helped promote them among the lower classes and caused their notorious reputation among ruling classes. It was only a matter of time.\n\n*Gives you a little idea of what I'm studying in College at the moment. "
		},
		{
			"post_id": 27,
			"title": "10 12 16 // Writing",
			"date_published": 1476236640.797,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmSv3pcsAb4X6SMCHM5krw1A65y1JeDezg6UYK3JeUCo4K) </center>\n\nI haven't really written anything since 2008, that was the year I won NaNoWriMo for a terribly half planned novella that heavily took ideas from Imperial Russia, The Steampunk movement, and various Inuit cultures. I don't have the manuscript today as my brother promptly deleted it from our shared computer just a month after writing it. Which was probably for the best. \n\nSince that time, I've only written a handful of really crappy poetry and a few pieces of crappy flash fiction. I drafted a paranormal novella. But it still needs a lot of work before I even start the writing process. But, as of Tuesday. I've started writing again. I don't know if it will end up as a piece of flash fiction, a short story, or a novella. I'm just free-writing it and so far I have four pages that feel right. \n\nWriting is messy. It takes a long time. Sometimes it doesn't turn out and all you are left with is a piece of crap. But that doesn't mean you should stop. Everyone has a different reason for writing. For me, even if it's crap at the end, it was worth it. It's a small journey where you get to know characters or people and lives that were lived that can't actually exist in our real world. And if it's not fiction, if it's just randomly writing out your ideas, telling about what happened in the news, or talking about a subject that means something to you it can be almost meditative. \n\n I have a kind of nostalgia for tattered paper and notebooks full of scrawled ideas. I don't feel like myself without a notebook and really good ink pen. Even in our world of digital technologies, notebooks are still important. We like to keep our ideas close and unimpeded by usernames and passwords, or even interfaces that can hinder idea generation and the writing process. What have you written lately? What does writing mean to you? \n"
		},
		{
			"post_id": 26,
			"title": "10 11 16 // BitNation ID",
			"date_published": 1476196398.417,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmR25o96ToKCZFCwHBLkL4AbbHGM6XwWvDHTZhnkqp2uuP) </center>\n\nWhat's included in the ID so far:\n\n- Keybase\n- Identity linked to BitNation\n- PGP\n- Photograph\n- BitNation UserName\n\nWhat do you think of the design? What does it need & what needs taken away? When I'm finished I'll give the design away...\n\n*The identity linked to BitNation, blockchains your identity. You can verify / notarize documents with this, get married etc. \n\n"
		},
		{
			"post_id": 25,
			"title": "10 06 16 // Argumentation & Politics",
			"date_published": 1475770096.837,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmdbdMEaEnAHxkesP7HhVj1jJaYN3X4sQ5RmCjv4HJttwD) </center>\n\nI've been taking this course on Coursera by Duke University called Think Again I: How to Understand Arguments. The first of four courses covers such things as,\n- How to Identify an Argument\n- Stopping Regress\n- Close Analysis\n- Validity\n- Basic Structure\n- Reconstruction.\n\nI'm on week two so I'm working on regress and analysis at the moment and it's really interesting. It seems most people use what it is called 'Abusive Assurance'  and governments tend to use 'Authoritative Assurance'. Both of these suffer from one horrible facet. They were constructed solely to shut down an argument. They give a reason which really isn't a reason at all, while giving the impression that they actually answered you. It's diabolical. \n\nHere's an example of each.\n\n<strong>Abusive Assurance:</strong><i> 'It's just common sense that...'</i>\n<strong>Authoritative Assurance:</strong><i> 'An unimpeachable source close to the President has assured me that...'</i>\n\nWe all know politics or politicians love to shut down arguments in all sorts of ways and if Authoritative Assurance doesn't work. There's Abusive. I've heard it in what little of the debates I've listened to on television. Then of course, if those don't work. There's those pesky logical fallacies. But I'm not going to get into those here. \n\nThe point is, we all tend to use any type of assurance possible to avoid an argument, even when it's necessary. Without argumentation, (the academic kind, think Socrates. ...) we don't really learn from others, get to see another persons point of view, or expand our own point of view. \n\nBut argumentation today has fallen apart. We're afraid of Skeptical Regress we don't have time to sit and listen to a circular argument or an infinite chain where we may never know the actual answer or the truth. So, we shut them down. We walk off feeling like we won in the argument, we were triumphant. When instead we never started arguing. Besides, the point of an argument isn't to win. It's to learn. *which proves how shitty political debates are these days. ...*\n\nObviously we are living in a realm of flawed argumentation and logic.  The problem is, only programmers and philosophers know any logic at all. It's just not taught. If you are a programmer you have to know logic in order for your programs to operate. Philosophers have to know it to teach it, to the few that actually attend their classes, only to become more philosophy teachers.  It's a closed loop of sorts, and this is really bad.\n\n It's why politics and democracy are failing. Why voting doesn't change anything. Why some people believe that voting rights should be stripped of the people and given only to those who will use the voting privilege responsibly. *Yeah. Someone said that online.*\n\n If you cannot see who is shutting down an argument. If you don't care enough about the issues at debate to know anything about them. How can your vote mean anything at all? Don't rely on the television. Don't rely on other people. You have to see through the bullshit and make your own **informed** decisions. Argumentation and logic are just the beginning. ... \n\n*Note: There are three other ways that you can attempt to solve skeptical regress: guarding, discounting and Evaluation. \n\n"
		},
		{
			"post_id": 23,
			"title": "10 03 16 // Early Computers",
			"date_published": 1475512540.564,
			"body": "<center> ![You need IPFS to view this image](http://localhost:8080/ipfs/QmapCg8ETDg8LwMjs9cNg2wAyXEuf6DvwJ1xPJq2jooqUb) </center>\n\nI just started a mooc called, 'Internet History, Technology, and Security' on Coursera from the University of Michigan. This week was about Bletchley Park, Alan Turing, John Forbes Nash, and the first version of the internet, also known as, The Michigan Terminal System. \n\nThe system was basically an oversized typewriter with a telephone connected. It had to have constant access over the phone line via a pre-net history version of dialup connection. Can you imagine the long distance charges? What was interesting though, if you watch the first few minutes of the video included, is it operates just like the 'terminal', cli, or command line, on our computers today. \n\nExcept security was obviously terrible and it printed an entire history of everything you did on paper. That and there isn't a screen. These type of pre-computer terminals were used across university campuses between scholars, professors, etc. all the way into the 70's. \n\nI'll admit the security flaws made me cringe. It's nice to know that with our computers today we have more security. But just as our computers upgrade, we need to constantly upgrade our knowledge and learn new security practices so we don't end up like that guy with the blazingly obvious security flaws. I know I sighed in relief when he changed his password and it didn't appear typed. But come on. He probably reused an old password from somewhere. ...\n\nIf you want to learn more about Internet History etc. feel free to join me. Just search for the course on Coursera.\n\n\n<img src=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/img/clear.png\" height=\"25px\" width=\"25px\"><a href=\"\nhttps://d18ky98rnyall9.cloudfront.net/1969-02-06-BasicOperationOfMTS-small.7db4fb40447611e4bf68d70a95093c06/full/540p/index.mp4?Expires=1475625600&Signature=Wrpel4CkepnVChxRvdu9cieMfOt6igox3gqHKAtP1Tq57ox5bWIUQ9vpN-V0gVrRoQViKjsDTaAlxW6oKn5FoF0e7N-tJaYcmI3YZ~j8S9nJSZ2yTcCOELnA6~JnWInZ1vn5JecCehkg531gWhffn85aAMt6zQbdN7VPcxo6OHQ_&Key-Pair-Id=APKAJLTNE6QMUY6HBC5A\"> Michigan Terminal System</a></a>\n"
		},
		{
			"post_id": 21,
			"title": "10 02 16 // Permission to Travel",
			"date_published": 1475433487.728,
			"body": "\n<center><img src='https://ipfs.pics/ipfs/QmSxLdhsC5BNS7CcLFk3rQ2P1LM15Tp6kwzYgTwHWsHUAt' height=\"70%\", width=\"75%\"/></a></center><br>\n\nI've been reading about Passports lately. How they came into being. Why we still have them. About a forger of passports. And about Bitnation. It's interesting, if you read about all these things together and how they seem to mesh. For example, before World War I, we didn't have passports or visas. Countries didn't think they were required. It was something that was instituted because of war. To keep track of people.\n\nWhen World War II came around, things got a lot worse. People couldn't leave countries because all of the sudden this thin piece of paper had acquired so much meaning, that having the wrong one meant their very lives. Forgers became heroes. Like Adolfo Kaminsky, who had to decide if even a single hour of sleep was worth the cost.\n\n<center><i><quote>It’s a simple calculation: In one hour I can make 30 blank documents; if I sleep for an hour, 30 people will die.</quote></i> ~ Adolfo Kaminsky</center>\n\nBut where does Bitnation come in? In it's current form Bitnation isn't useful. But in the future, with the improvements it wants to make, it could possibly change things. As it now, having the right passport can mean the difference between living in a country where war isn't a part of your daily life and one where war is your entire life. Bitnation might not be the perfect solution, or even the answer. But right now, it's an idea that's a step in the right direction. One where your identity isn't tied to the country you were born in or live in. ...\n\n<br> \n\n<img src=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/img/clear.png\"height=\"25px\" width=\"25px\"><a href=\"https://bitnation.co/world-citizenship-id/\">Bitnation World Citizen ID</a></a>\n\n<img src=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/img/clear.png\"height=\"25px\" width=\"25px\"><a href=\"http://www.nytimes.com/2016/10/02/opinion/sunday/if-i-sleep-for-an-hour-30-people-will-die.html?_r=0\">‘If I Sleep for an Hour, 30 People Will Die’</a></a>\n\n<img src=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/img/clear.png\" height=\"25px\" width=\"25px\"><a href=\"https://theconversation.com/when-world-leaders-thought-you-shouldnt-need-passports-or-visas-64847\">When world leaders thought you shouldn’t need passports or visas</a></a>\n"
		},
		{
			"post_id": 20,
			"title": "09 27 16 // Book Burnout",
			"date_published": 1474996091.832,
			"body": "I've been cramming reading books. Lots of books. Indiscriminately reading whatever that is required and just random books from the library. But, I've noticed a problem with indiscriminately reading whatever you can get your hands on. You don't have time to think. ...\n\nSure. You can think some thoughts about the book at hand. You can form a primordial opinion. But afterwards? You're stuck. I've been trying to write something for this blog or to just write anything in general for a month with no luck. I cannot form an opinion anymore. I've had no room, or empty space to sit and contemplate. I miss it. Silence of mind is just as important as true silence and for the past week. I haven't been able to read. I've got burnout. I get headaches. If there is such a thing as 'toxic reading' I think I've hit it.\n\nSometimes you need to stop. Stop everything and just be in the moment. Give yourself time to think. Take time for yourself. ..."
		},
		{
			"post_id": 14,
			"title": "08 31 16 // Literature\n",
			"date_published": 1472659121.737,
			"body": "There's a method to the madness of learning / fully understanding a piece of literature. ...\n\n1. Read the synopsis on two different sites.\n2. Read the Character overviews.\n3. Read the book and pause at every section to make a note of the general theme. Write in on the page in the book.\n4. After every chapter summarize it on a post-it and put it in the book.\n5. When finished reading the book. Try to summarize what the main points of the story were.\n6. Read literary criticism about the book.\n7. Write something about it."
		},
		{
			"post_id": 4,
			"title": "//TOC\t",
			"date_published": 1466964013.721,
			"body": "// November 2016:\n------\n\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:34:11+15+16+//+What+now+\">What Now?</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:33:11+13+16+//+Faceless\">Faceless</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:32:11+10+16+//+...\">...</a>\n- <a href=\"1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:31:11+07+16+//+Autumn+Place\">Autumn & Place</a>\n\n\n// October 2016:\n------\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:28:10+19+16+//+Diderot+the+Encyclopedie\">Diderot & the Encyclopedie</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:26:10+11+16+//+BitNation+ID\">BitNation ID</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:27:10+12+16+//+Writing \">Writing</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:26:10+11+16+//+BitNation+ID\">BitNation ID</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:25:10+06+16+//+Argumentation+Politics\">Argumentation & Politics</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:23:10+03+16+//+Early+Computers\">Early Computers</a>\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:21:10+02+16+//+Permission+to+Travel\">Permission to Travel</a>\n\n// September 2016:\n------\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:20:09+27+16+//+Book+Burnout\">Book Burnout</a>\n\n\n// August 2016:\n------\n- \n<a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:14:08+31+16+//+Literature\">Literature</a>\n\n// July 2016:\n------\n<i>These aren't the posts you're looking for. ...</i>\n\n// June 2016:\n------\n\n- <a href=\"/1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq/?Post:3://+Reading\">Reading</a>"
		},
		{
			"post_id": 3,
			"title": "// Reading",
			"date_published": 1466963363.719,
			"body": "- Night Watch by Sergei Lukyanenko *(on hold)*\n- Reason and Persuasion by John Holbo *(on hold)*\n- Macbeth by Shakespeare\n- The Main Woods by Henry David Thoreau\n- Watchlist: 32 Stories by Persons of Interest by Bryan Hurt\n- Smart Girls Guide to Privacy By Violet Blue\n- It Can't Happen Here by Sinclair Lewis\n- The Iron Heel by Jack London\n- We by Yevgeny Zamyatin\n- Meditations by Marcus Aurelius\n- Learn Hebrew A Comprehensive Course in Modern Hebrew by Isaac Yetiv\n- THE PROFESSOR AND THE MADMAN by Simon Winchester\n- The Philosopher's Toolkit by Julian Baggini\n- Atlas Shrugged by Ayn Rand\n- Introduction to Logic by Harry J. Gensler\n- Assmil French\n- Le Petit Prince\n- Failures of the Presidents by Thomas J. Craughwell\n\n\n\n*Strikethrough means I've finished reading it. ...\n**On going yearly tally in the comments section. ...\n\n<hr>\nSuggestions\n=======\n- Program or be Programmed  by Douglas Rushkoff \n- The Machine Stops by E.M. Forster\n- Walden By Henry David Thoreau\n- Letters from a Stoic by Seneca\n- Fahrenheit 451 by Ray Bradbury\n- 1984 by George Orwell\n- Polyglot: How I Learn Languages by Kato Lomb"
		},
		{
			"post_id": 2,
			"title": "//FAQ\n",
			"date_published": 1466963243.139,
			"body": "<strong>Loc - </strong>United States\n<strong>Lang -</strong> English, Esperanto, Japanese (*In Progress*)\n<strong>Stack -</strong> IRSSI, Tor, ZeroNet, Git, Iridium, Bitmessage, Multibit, MasterPass, Mailpile, Vim, Patchwork, IPFS.\n\n<br>\n<strong>Edu -</strong> Autodidact. Some College. MOOC learner. \n<strong>Interests -</strong> History, Archaeology, Anthropology, Cryptography, Literature, Mythology, Languages, Python, Philosophy, Reading, BitNation, Stoicism, Knitting, Reading.\n<br>\n<strong>Podcasts - </strong> Arkivo de 3ZZZ Radio en Esperanto, Creative Language Learning Podcast, Levar Burton Reads, Lore.\n<br>\n<center style=\"height:25%, width=25%\"> ![Caption](http://localhost:8080/ipfs/QmYpy2BxMwBFxfkKMdwDbzkUpfbuuRDrJMwRNY9At9qLwK) </center>\n\n\n\n"
		},
		{
			"post_id": 1,
			"title": "//Contact",
			"date_published": 1433033779.604,
			"body": "<center> <a href=\"/Mail.ZeroNetwork.bit\">Mail:</a><br>  meidan@zeroid.bit\n\n<a href=\"/1JubdWmm1QxfFwVAUSKo5rxLUUcuooPndu/data/meidan.txt\">PGP Key</a>\n\n<b>Tox:</b>\nD5E9C003633C89F07003E185D619F740D9AAF13BF1686673E2F37C633AC8B0062CE4FF93375A\n\n<b>Bitmessage:</b>\nBM-2cWeVuoQj7kPtWZPwXMhin9r78KeAWLNw8 <br>\n\n<b>Zero Me</b>\n<a href=\"/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC/meidan@zeroid.bit\">@meidan</a>\n\n<b>Bitcoin:</b>\n<center>\n1N6DUdTFqjq6qmahi1SviEQV8nnhJ2wrTq\n<img src='https://ipfs.pics/ipfs/QmbbhrRrYou5wWt55dmapS9GvtqrJVgELJ4aifHnhjhCNz'/></a></center>\n\nComing Soon\n---------\n\n<center>\n<b>KeyBase:</b>\n\n<b>Patchwork:</b>\n\n</center>\n"
		}
	]
}