{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566037008,
			"title": "Did 08chan admin actually fix his site yet?",
			"body": "Couldn't update new posts for a few days after the ID's became forced. I checked today, and I was able to update some new posts but I was still seeing posts from yesterday at the top. \n\nDid this thing wind up being a honeypot to disperse the 8ch userbase to a broken website during the most critical days of retaining the 8ch userbase, or does it actually work now?",
			"added": 1566037007
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 1,
				"body": "> [saythenword](#comment_4_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg): saythe\n\nthis fix worked for me:\n\n1. Start with a fresh install of zeronet\n2. Go to zeroid page and create new zeroid\n3. Instantly open your O menu, and change file size limit to be higher. \nYOU MUST COMPLETE STEP 3 BEFORE YOU HAVE DOWNLOADED A FEW MB OF DATA FROM THE ZERONET PAGE, GO FAST.\n4. Select zeroid\n\nyou should now be able to post. \nthe problem is that the sidebar takes some space to load the globe thing, and this counts against the site's limit. so you have to increase the limit BEFORE it hits the cap, the first time you open the menu.",
				"added": 1565409126
			},
			{
				"comment_id": 2,
				"body": "I'm stuck at 250 posts and most of my trackers say error",
				"added": 1565415044
			},
			{
				"comment_id": 3,
				"body": "> [undisclosed](#comment_9_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Have you tried your own advice?  I did this yesterday, and have two different directories on a removable drive.  One loads 08chan after BO implemented ZeroIDs but won't let me post.  The other is the fresh ZeroNet and that's the one currently stuck.  Not that I can post in either one, atm.\n\nexact same situation here",
				"added": 1565415262
			},
			{
				"comment_id": 4,
				"body": "> [undisclosed](#comment_12_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): I have two zeroid.bit to work with.  Either one is selectable for ZeroTalk, but I'll stick with \"undisclosed\" for this discussion.  Either one partially works with 08chan, no perceivable difference.  Both get stuck updating files, although slightly different file counts.  Deleting the board from the left side bar and reloading from 127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/ had no effect on the files refusing to update.  It also makes no difference if I modify users.json manually or through the gui.  Creating a new thread or replying get stuck \"Processing post... Please wait.\"  File attachments do get processed, however I only tried images.  It was going a bit further yesterday, before hitting an endless while loop \"Content published to 0/5 peers\".  Since 0chan works for me with anonymous certs, I'll just have to be patient and wait for the next board update.\n\n0chan has a bunch of cp on it be careful",
				"added": 1565422191
			},
			{
				"comment_id": 5,
				"body": "I'm at 4500 posts now, same thing happened but it looks like I didnt get as many before it stopped again.",
				"added": 1565429219
			},
			{
				"comment_id": 6,
				"body": "> [aim64c](#comment_27_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): So, I left the whole thing open overnight to see what would happen, and things largely appeared 'fixed' after I let it update (though I didn't try posting).  I did notice a rather large loss of content - entire boards being gone from the list that I'd never muted.I went ahead and cleared everything out to reset the zite to see what would happen, and I'm back to exactly the same problem I was at the beginning. [...]\n\nhaving pretty much the same experience as this comment",
				"added": 1565468607
			}
		],
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 7,
				"body": "100% have the same vibe that I can't prove, that 08chan is a honeypot set up in anticipation of the closure of 8ch. Obviously with the goal of distracting us from creating or migrating to a new site during the immediate aftermath of 8ch's closure when retention of the userbase would be highest. \n\nThe other zeronet chans are obvious honeypot fed operations, and this I can prove. 0chan for example, has an entire board for child porn, and this site does not use the same \"anyone can create a board\" mechanic as 8ch did, so it was set up by the admin. Quite obviously, 0ch is an entrapment scheme.",
				"added": 1566037787
			}
		]
	},
	"comment_vote": {}
}