<!DOCTYPE HTML>
<!-- Xenith of http://hightechlowlife.eu -->
<!-- Security through obscurity. -->
<html lang="en">
<head>
<meta charset="UTF-8"/>
<meta name="description" content="" />
<meta name="keywords" content="" />
<meta name="robots" content="index,follow,archive" />

<script src="">
</script>

<base href=""/>
<link rel="stylesheet" href="style.css" />
<link rel="icon" href="favicon.ico" />

<title>d&#x131;g&#x131;verse development blog</title>

</head>

<body><form><center><div id="main">

<!-- begin header bar -->
<div id="head">d&#x131;g&#x131;verse dev

<span class="user">d&#x131;g&#x131;verse a game concept for the future of soc&#x131;al &#x131;nteract&#x131;on</span>

</div>
<!-- end header bar -->

<!-- begin content -->
<div id="content">
<center><h1><a href="#" class="orange">about</a>
<a href="blog.html" class="black">blog</a>
<a href="faq.html" class="black">faq</a>
<a href="contact.html" class="black">contact</a>
<a href="donate.html" class="black">donate</a></h1></center>

<h1>what &#x131;s d&#x131;g&#x131;verse</h1> 
<p>d&#x131;g&#x131;verse is, as the name implies, a digital universe. This universe is made of people, like you, who operate inside of it. These people are players at the center of the d&#x131;g&#x131;verse. The goal of the game is to create complexity within the d&#x131;g&#x131;verse. This can be done through helping others, forming organizations, killing monsters, and creating new objects. All modifications to the d&#x131;g&#x131;verse are democratically implemented by the players within the d&#x131;g&#x131;verse. No player can unilaterally decide what the d&#x131;g&#x131;verse can contain.</p>

<h1>how &#x131;s d&#x131;g&#x131;verse played</h1> 
<p>In d&#x131;g&#x131;verse each player will take the role of a person within the ''digital universe''. Each action you perform within the d&#x131;g&#x131;verse will contribute to a role you can maintain. As a player, you are fit to choose any role you like within the d&#x131;g&#x131;verse. You are not restricted to just one of these roles. All players are encouraged to specialize as a player, but also to fill roles as they are needed.</p>

<h1>what roles are there</h1> 
<p><span class="label">fighter</span> The role of a fighter is a simple one. Monsters, created by the players have been unleashed upon the d&#x131;g&#x131;verse. Fighters need to work with leaders to coordinate attacks on monsters and player organizations. Fighters are set to hunt down monster and player alike, achieving glory for every kill.</p>
<p><span class="label">protector</span> A protector is different from a fighter, in the sense that they protect areas, and solve player disputes. Often, if one player is attacked unjustly by another, the protector is sent by an organization to combat the offender. Additionally, protectors patrol cities to prevent invasion from outsiders and monsters.</p>
<p><span class="label">leader</span> A leader is a respected player of the d&#x131;g&#x131;verse community, who founds and maintains an organization. Founding an organization is difficult, 9 members in addition to the leader must coordinate and agree to its creation. Collective organizations are capable of managing the permissions players within their organization to restrict negative actions. The threat of being caught without the protection of an organization is a serious one.</p></br>

<p><span class="label">collector</span> All items in the d&#x131;g&#x131;verse need to be crafted using components found within the digital universe. Some of these components are very rare and can only be found by experienced gatherers. Some of these components can only be obtained from monsters. Collectors will need to work closely with fighters in order to gather valuable materials.</p>
<p><span class="label">seller</span> Collecting materials can often be quite dangerous. Sellers specialize in manipulation of the markets in order to best profit from collectors. Collectors working for an organization split their revenue with sellers. Sellers working independently have to gather their own materials.</p>
<p><span class="label">creator</span> The consumers of all of these gathered materials are the creators. Creators make all sorts of items to be used by players and to be sold by sellers. Creators have more liberty in creating items for the players of d&#x131;g&#x131;verse.</p></br>

<p><span class="label">teller</span> In d&#x131;g&#x131;verse, players will need to get their information from somewhere. Not everyone has permission to broadcast a message. That privilege has to be earned. Players can vote to remove another player's ability to communicate. Restricting them only to conversation within their organization or team.</p>
<p><span class="label">teacher</span> Players do not know many skills to start off, they have to be shared. Teachers are the players that do this most. They can do so more quickly then with other players. Teachers can also submit skills, restrictions, and prerequisites to the d&#x131;g&#x131;verse community to be judged democratically.</p>
<p><span class="label">helper</span> Finally, there is the helper. Sometimes players will be injured or lost, cannot find materials, or just do not know how to play d&#x131;g&#x131;verse. Helpers can be messaged privately in order to help other players. They act as lesions between the rest of the classes in order to deliver information to those who have been restricted.</p>

<h1>how are players ranked</h1> 
<p>As a player of d&#x131;g&#x131;verse, you will have a level associated with each class. This level is determined by your total rank compared to all other players in d&#x131;g&#x131;verse. The top 90.00-100.00% will be Rank 10. The top 80.00-89.99% will be Rank 9... etc. Your rank will determine what permissions you have within the d&#x131;g&#x131;verse. The permissions you have access to will be voted on by the community almost continuously, with the exception of some concrete rules that are put in place by the game's framework.</p>
<p>This 1 through 10 Ranking is given on your player page for each of the 9 classes. However, when interacting with other players, your class icon will be that of the rank in which you are highest. The position on the leaderboard is determined by how many points you have earned in each class.</p>

<h1>po&#x131;nt breakdown</h1>
<p><span class="label">fighter</span> killing a monster: #pt equal to difficulty, killing a player: #pt equal to target player's ranks, being killed by a monster: -#pt equal to difficulty*difficulty, being killed by a player: -#pt equal to your ranks*your ranks, being killed by a protector of Rank 5 or higher: -#pt equal to your ranks*your ranks*5.</p>
<p><span class="label">protector</span> killing a monster within an owned territory: #pt equal to difficulty, killing a player within an owned territory: #pt equal to target player's ranks, being killed by a monster: -#pt equal to difficulty*difficulty, being killed by a player: -#pt equal to your ranks*your ranks.</p>
<p><span class="label">leader</span> gaining a member: 1pt, losing a member: -1pt; claiming a territory: 1px, losing a territory: -1px, organizing a team: 1pt, killing a player as the leader of a team: 1pt.</p></br>

<p><span class="label">collector</span> collecting an item: #pt equal to rarity*rarity, collecting an item in a team: #pt equal to rarity*rarity*2, donating item to organization: #pt equal to rarity, donating item to non-organization creator: #pt equal to rarity*2.</p>
<p><span class="label">seller</span> selling an item: #pt equal to currency value, buying an item: -#pt equal to currency value.</p>
<p><span class="label">creator</span> crafting an item: #pt equal to rarity, having a submitted item excepted: #pt equal to (upvotes-50)*(upvotes-50), having a submitted item denied: -#pt equal to (downvotes-50)*(downvotes-50).</p></br>

<p><span class="label">teller</span> positive post vote: 1pt, negative post vote: -1pt, positive organization post vote: 3pt, negative organization post vote: -4pt, positive world post vote: 7pt, negative world post vote: -10pt, positive digiverse post vote: 25pt, negative digiverse post vote: -35pt.</p>
<p><span class="label">teacher</span> teach a skill or recipe: #pt equal to skill rank, having a submitted skill or recipe excepted: #pt equal to (upvotes-50)*(upvotes-50), having a submitted skill or recipe denied: -#pt equal to (downvotes-50)*(downvotes-50).</p>
<p><span class="label">helper</span> positive private message vote: 1pt, negative private message vote: -2pt, heal a player: 1pt</p>

</div>
<!-- end content -->

</div></center></form></body>

</html>