{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1587477797,
			"title": "Fanpage - Zero Net Polska",
			"body": "Hej, szukam osób chętnych do pomocy w promocji zero net w naszym kraju. Potrzebne opisy, poradniki, odpowiedzi na pytania.. ja mogę zająć się dalej formą graficzną materiałów. \nDołączajcie: https://www.facebook.com/ZeronNet-Polska-107687717579412",
			"added": 1587477796
		},
		{
			"topic_id": 1588668345,
			"title": "Szurlandia",
			"body": "Hej, zakładam ten post aby Szuraki znaleźli w razie czego!",
			"added": 1588668343
		},
		{
			"topic_id": 1588850107,
			"title": "Q-anon Polska",
			"body": "Hej, zakładam to miejsce jako bakap..",
			"added": 1588850104
		}
	],
	"topic_vote": {
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1,
		"1588850107_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 1,
				"body": "..Chej, ja myślę, że trzeba zacząć od lokalnych sieci. Można w mieście, na osiedlach montować duże przekaźniki i robić lana..",
				"added": 1586559183
			},
			{
				"comment_id": 5,
				"body": "Hej, zero net działa w momencie kiedy nie masz neta. Jeśli twój komputer coś seeduje to inny z sieci też ma do tego dostęp. Najlepszym rozwiązaniem jest postawić jakiś punkt dostępowy. znalazłem takie urządzenie za niecałe 200 zł z zasięgiem 5km na allegro. Zamierzam robić testy. Jeśli znajdziesz rozwiązanie jak wykorzystać domowe karty wifi i routery to daj znać.",
				"added": 1587464898
			},
			{
				"comment_id": 6,
				"body": "> [xenovich](#comment_3_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): Pytanie: Jezeli Laptop moze polaczyc sie karta sieciowa z routerem wifi to dlaczego nie moglby z drugim laptopem bezposrednio? A bluetooth? To specjalna technologia podobno, ale... no wlasnie.\n\nDobrze kombinujesz :) Podoba mi się Twoje podejście..",
				"added": 1587477701
			},
			{
				"comment_id": 8,
				"body": "> [xenovich](#comment_9_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): Jest jeszcze jedna rzecz, ktora pewnie na tym etapie w ogole was nie obchodzi, ale juz o niej wspomne. Jest potwierdzone naukowo ze fale elektromagnetyczne moga byc bardzo szkodliwe dal ludzi. Wydawaloby sie ze mamy w takim razie jedynie dwa wybory: albo dopuszczamy wysylanie fal WiFi i tolerujemy jakis poziom toksycznosci albo ograniczamy komunikacje tylko przez kabel. [...]\n\nSłuszna uwaga, może w takim wypadku sieci oparte na gniazdkach z prądem?",
				"added": 1587552431
			},
			{
				"comment_id": 9,
				"body": "> [xenovich](#comment_10_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): Oczywiscie ze tak! Na moment wylecialo mi z glowy ze one sa. Adaptery sieciowe do sieci elektrycznej nie sa najtansze ale nie bardzo drogie. Tych rozwiazan technicznych na zakladanie sieci jest tak wiele ze brak pozorny mozliwosci tworzenia niezaleznego internetu wydaje sie paralizujaco absurdalny. Jak kolega wykazal swoimi znaleziskami programowymi do routerow rozwiazania istnieja. Ale ze 99% ludzi ma to w dupie i zajmuje sie glupotami na facebooku i youtube to pozornie jakby sprawa byla niemozliwa. To jest klasyczny przyklad jak zjebanym systemem politycznym jest demokracja. Jest po prostu totalnie niemozliwe osiagnac cokolwiek zaawansowanego na wieksza skale w takim systemie spoleczno politycznym.  [...]\n\nMasz bardzo dużo racji w tym co mówisz. Odsuńmy ideologie itp na inne działy na forum. Pomyślmy jak możemy się połączyć razem. Ja jestem z mazur. Obliczmy co nam potrzeba i działajmy. Dawajmy przykład a nie obrażajmy się na ludzi :)",
				"added": 1587554621
			}
		],
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": [
			{
				"comment_id": 2,
				"body": "Hej, konkretne pytanie do Ciebie drogi userze. Czy zależy ci na rozwoju sieci zeronet? Chętnie uruchomię jakąś propagandową w środowiskach..",
				"added": 1586566940
			},
			{
				"comment_id": 3,
				"body": "Założyłem fanpage https://www.facebook.com/ZeronNet-Polska-107687717579412",
				"added": 1587120787
			},
			{
				"comment_id": 4,
				"body": "> [tajny2z](#comment_21_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): Swietnie. Lata temu mialem... [...]\nDawaj linki, ja jestem mega zadowolony z technologii. Mając pliki zeronet można robić małe sieci i wtedy połączyć to w wielkiego mesha. Dla mnie bomba!",
				"added": 1587209939
			}
		],
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": [
			{
				"comment_id": 7,
				"body": "> [driud](#comment_41_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Mamy dołączyć do faceboka? Chyba ciebie pogięło. Nie po to z stamtąd dałem dyla, wyzwoliłem się . żeby do tego gówna powrócić, s powrotem.Interesuje mnie tylko niezależność i brak cenzury.  Bez żadnych pośredników i osób trzecich zainstalowanych w telawiwie. i dolinie krzemowej. Czy to jest tak trudno zrozumieć? Jak nie czujesz bata na swojej dupie? To Tobie czegoś brakuje, na co dzień?Przemyśl jeszcze raz swoją propozycję.pozdr.\n\nNikt do niczego cię nie zmusza.. pozdro",
				"added": 1587481354
			},
			{
				"comment_id": 10,
				"body": "> [xenovich](#comment_13_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): Koledzy inni nasi zamieszczali linki do serwerow proxy na duzych portalach spolecznosciowychj i odkryli ze wszystko co jest zwiazane z zeronet itp wszystkie linki sa filtrowane. Oni sa na to wrazliwi. Moze nalezy linki dawac w grafikach zeby boty mialy problem z indentyfikacja?\n\nTo ciekawe, ja nie wierzę w takie teorie. Mam spore doświadczenie. Jeśli wyciągnę te same wnioski to cię poinformuję. Trzeba umieć mówić do kowalskiego w sposób zgodny z wytycznymi facebooka.",
				"added": 1588377413
			},
			{
				"comment_id": 11,
				"body": "> [driud]\nJa umiem właśnie, pomóżcie potłumaczyć jakieś materiały. Przerobię je graficznie i jedziemy.",
				"added": 1588669898
			},
			{
				"comment_id": 12,
				"body": "> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Cześć! Mam zupełnie przypadkiem bordo na wykopie, chyba mi dali za wklejki z telefonami do prokuratorów. Dzisiaj dałem na mikro linka do forum, może ktoś z nich tu zajrzy.\n\nWłaśnie o takie akcje chodzi!",
				"added": 1588808514
			},
			{
				"comment_id": 15,
				"body": "> [borys](#comment_13_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P): Ale brak hasła do Wifi chyba nie jest najlepszą poradą ze względu na bezpieczeństwo. I co to ma wspólnego z ZeroNetem?\n\nWiem, że nie najlepsza rada. Jednak można wszystko fajnie ustawić aby dzieciaki z sąsiedztwa miały jak odrobić lekcje. Co do otwartego wifi, to uważam, że należy budować sieci na naszych urządzeniach a nie liczyć na wielkich dostawców. Mam wrażenie, że 60 % mojego neta to okolica (znajomi, filmiki, wiadomości lokalne)",
				"added": 1589188106
			},
			{
				"comment_id": 16,
				"body": "> [kapec](#comment_11_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Ejkej można się z tobą skomunikować w jakiś prywatny sposób po zeronecie? Masz zeromaila?\n\nTak mam, można też przez fanpage, jestem jedynym adminem.",
				"added": 1589964126
			},
			{
				"comment_id": 17,
				"body": "> [borys](#comment_14_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P): Może by zrobić jakąś reklame w formie mema, grafiki. Grafikę trudniej cenzurować niż tekst.\n\nFajny motyw, jestem grafikiem chętnie coś sklecę - masz jakiś pomysł na mema?",
				"added": 1591832916
			}
		],
		"1588691602_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 13,
				"body": "O są i mirki!",
				"added": 1588808541
			},
			{
				"comment_id": 14,
				"body": "> [arione](#comment_2_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Na wszelki wypadek gdybys szukal stron i forow ktore juz sa; http://127.0.0.1:43110/Sites.ZeroNetwork.bit/ wlaczasz filtr 'Polski' i eksplorujesz. Mozesz tez stworzyc klon istniejacego blogu zeronet i prowadzic swoj wlasny. Mozesz zakladac zupelnie nowe strony tutaj ale do tego potrzeba wiekszych umiejetnosci. Tu masz przyklad nowej strony radia zrobionej oldschool'owo w html ktora bedzie pewnie przerabiana na bierzaco http://127.0.0.1:43110/13b33nBwzxVzW2tFaDYSZ686ZEcN5DQBaJ/. Zakladam tez ze odbierasz maile na http://127.0.0.1:43110/Mail.ZeroNetwork.bit/ ?\n\nWow, mogę wrzucić na mirko? Tak serio mogę wrzucić opis na fanpage?",
				"added": 1588808600
			}
		]
	},
	"comment_vote": {
		"3_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1,
		"11_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}