{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1621856434,
			"title": "Cloning the 'Play' zite: how-to?",
			"body": "Anyone know how I can clone this and 'roll my own'?",
			"added": 1621856433
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 1,
				"body": "> [warfare2](#comment_17_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1): and now the HRW... I don't give a shit about what they say... however I understand the strategy, as I guess you are still uncomfortable with \"appartheid\", don't give a shit about their words, you know they are waste, and the guy could be jewish who lead this effort, I don't know their hebraic qualification, but calf holder anti israel is fine with me.  [...]\n\nIsrael is an Apartheid state - has been for many years. Not 'news' by any stretch, glad that the rest of world is now catching up....",
				"added": 1621869853
			},
			{
				"comment_id": 2,
				"body": "> [localdir](#comment_2_1EeXZPsGxTqkKF5usvcLhY3h54StRn5N3s): Israel are terrorists killers and thiefs\n\n100%",
				"added": 1621869870
			},
			{
				"comment_id": 4,
				"body": "> [dennic](#comment_4_1C9uMp36YAt8RV6cf9jPoarY7LPnnzSZ4h): The problem is quite inextricable, in my humble opinion. The Jews know that the 1st, 2nd, and 3rd temples stood on the hill of Jerusalem, which they called the temple mount. And the last edition was destroyed in 77 AD by famous roman legions under the wise and prudent and successful leadership of a certain Titus (he has a little victory arch before the Coliseum, by the way) and some say that to really annoy the jews, the Romans stole some stones of their principal temple to build the said Coliseum :). [...]\n\nWith respect, I've no idea what any of that pseudo-religious semi-historical rant was supposed to be - it provided little insight and just appears inflammatory and not remotely to engage with the material reality and root cause of Israel’s settler colonial occupation of Palestine: LAND. You'd do far better read this before offering nonsense opinions without any basis:\nhttp://libgen.rs/book/index.php?md5=B5A055FBF9240A83472C4B523AFD85A3",
				"added": 1622536603
			}
		],
		"1621856434_1H7zNGEgo9AgbdKHhwoWzfeNqrav5RJZk": [
			{
				"comment_id": 3,
				"body": "> [robione](#comment_649_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Use the clone feature?\n\nIt isn't available as an option. any ideas?",
				"added": 1622536104
			},
			{
				"comment_id": 5,
				"body": "> [robione](#comment_650_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Like @styromaniac said, look at the URL of the zite, find it's directory in your ZN installation folder and manually copy its contents to a new zite you just created. You'll have to manually adjust the config files too.\n\nthanks for this. I assumed that the 'clone' option in the right-click menu on the Zite entry on the main page was missing because it wasn't, in some way, copyable. I'll try your suggestion +1",
				"added": 1622800012
			}
		]
	},
	"comment_vote": {}
}