{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1519377810,
			"title": "KopyKate",
			"body": "Is big.kopykate.bit the right address for kopykate?\nThere is this menu on the left... what is \"Airing Now\"? And \"VideoBox\"?",
			"added": 1519377808
		},
		{
			"topic_id": 1534331588,
			"title": "ZeroNet with built-in Namecoin lightweight SPV client",
			"body": "Hi,\n\nNow that NameCoin [0] has a lightweight SPV client [1]. It would be nice to have ZeroNet with this technology built-in.\n\n@nofish, is there any plan on this?\n\nCheers!\n\n[0] https://www.namecoin.org/\n[1] https://namecoin.org/download/betas/",
			"added": 1534331585
		}
	],
	"topic_vote": {},
	"next_comment_id": 33,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 22,
				"body": "http://127.0.0.1:43110/1BXMziLuiSkF5JeaWsvDeoCg3oPEX4qQZm/?Home",
				"added": 1518348189
			},
			{
				"comment_id": 23,
				"body": "> [amuza](#comment_22_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA): http://127.0.0.1:43110/1BXMziLuiSkF5JeaWsvDeoCg3oPEX4qQZm/?Home\n\nff",
				"added": 1518348620
			},
			{
				"comment_id": 25,
				"body": "> [amuza](#comment_22_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA): http://127.0.0.1:43110/1BXMziLuiSkF5JeaWsvDeoCg3oPEX4qQZm/?Home\n\nggg",
				"added": 1518349088
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "Hi there,\nI would like ZeroNet to be able to do LAN peer discovery out-of-the-box so that it can work in community networks where an Internet connection is not always available (poor infrastructures, political Internet shutdowns, etc.).\nThat would mean another nice step towards real decentralization.\nI guess I should open an issue on GitHub for that, shouldn't I?\nCheers!",
				"added": 1493390767
			},
			{
				"comment_id": 11,
				"body": "Hi. How can I go to that first ZeroNet frontpage where the main sites done by @nofish are announced?",
				"added": 1507555974
			},
			{
				"comment_id": 14,
				"body": "Greetingz!\n\nI have some questions on security.\n\n1.- There was this problem that users visiting a Zite could not know if contents (audio, video, whatever) were being downloaded from the Zite or from the Internet.\nWas this thing somehow solved?\nIs there any workaround?\nWhat dangers do you see?\n\n2.- I read a bit on the dangers of JavaScript [1].\nSome people browse the Web with JavaScript disabled and they enable it only for trusted websites. \nAs far as I understand, Zeronet would not work without JavaScript.\nNow I am a bit worried about Zeronet's security,\nplease let me know if you think I should not.\n\nI was just wondering if there could be any way to to reduce the dangers of JavaScript on Zeronet.\nMaybe by everyone agreeing to set their Zites' JavaScript free [2]?\nso that we can use the LibreJS browser extension [3].\n\nOr maybe if there could be a voting system for Zites? So users trusting a Zite or having audited its javascript code could somehow vote in a way that the voting results are readable by users who never visited that Zite before?\n\nWhat can I do now to reduce the dangers or Javascript when using Zeronet?\n\nPlease let me know what your thoughts are.\n\nThank you!\n\n[1] https://www.gnu.org/philosophy/javascript-trap.html\n[2] https://www.gnu.org/software/librejs/free-your-javascript.html\n[2] https://www.gnu.org/software/librejs/",
				"added": 1513351737
			},
			{
				"comment_id": 15,
				"body": "> [amuza](#comment_14_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA): Greetingz! [...]\n\nHi @nofish, any comment on number 2?",
				"added": 1513756336
			},
			{
				"comment_id": 16,
				"body": "> [nofish](#comment_1084_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): To have dynamic content you need to distribute somehow the logic of the site. It could be possible to use other solutions to this, but browsers JS is the far most battle-tested solution for this. If you don't need dynamic content, then you can raw prefix, eg.: http://127.0.0.1:43110/raw/1AsRLpuRxr3pb9p3TKoMXPSWHzh6i7fMGi/en.tar.gz/index.htmlThis way you are free to disable any JS support in your browser and it does not runs any javascript.\n\nHi @nofish! Thank you very much.\nPlease let me be sure I understand.\nSo, just by adding the /raw prefix to any address, I can be sure my JavaScript-enabled browser will not receive any JavaScript from that address?",
				"added": 1514199437
			},
			{
				"comment_id": 17,
				"body": "",
				"added": 1514199481
			},
			{
				"comment_id": 18,
				"body": "> [gitcenter](#comment_149_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): If your browser is new enough, that's correct.\n\nThank you gitcenter!\n\nBut, why does it depend on the browser? I guessed that address prefix was something @nofish created so that ZeroNet reads it and then serves the Zite without JavaScript, so that people who does not trust a Zite can visit it safely in any browser. But, as I am not a coder, I might be completely wrong.\n\nI normally use Abrowser, IceCat and Tor Browser.\n\nMerry grav-mass and happy new Earth's revolution!",
				"added": 1514760552
			},
			{
				"comment_id": 19,
				"body": "> [gitcenter](#comment_168_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That's because ZeroNet still serves JavaScript. But an additional HTTP header (don't remember which, though) is passed to sandbox /raw pages - that's why you need a modern browser. That sandboxing includes disabling JavaScript.\n\nThank you very much for the explanation!\n\nI do not know if I am going too far with this topic. The thing is that I am still worried :(\nI love ZeroNet, but I do not understand everything. Those two things together are the reason of my questions.\n\nI understand there is no problem in ZeroNet's software using JavaScript, it is Free Software. I understand Zites are not more dangerous than Internet websites. But when visiting an untrusted website in the old web with my browser's add-on NoScript enabled I can often see its contents safely, however when doing the same for an untrusted Zite I rarely can see anything (same thing happens when using the raw address prefix without any add-on). Very few Zites are readable or usable without JavaScript.\n\nDo you think this is a problem?\nIf so, do you think it is worth it to address it?\nCouldn't Zites be created taking into account this problem?\nIs there any technical problem behind or is it just a culture thing?",
				"added": 1515268423
			},
			{
				"comment_id": 21,
				"body": "> [gitcenter](#comment_277_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This is a technical decision. [...]\n\nThanks!\n\nSo, a zite that only publishes contents, and it is the same for every user, could perfectly work without any JavaScript. Am I right?",
				"added": 1518189585
			}
		],
		"1_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 3,
				"body": "Oh, just seeing this now! I guess it's too late now to change dates. I wish it could be on the weekend.",
				"added": 1505995963
			},
			{
				"comment_id": 4,
				"body": "I'm thinking of trying to attend anyway. We might be two people.",
				"added": 1505995982
			},
			{
				"comment_id": 5,
				"body": "But it's such a long trip from here... Besides the presentation, do you think it would be possible to also have a dedicated hands-on workshop for beginners (non-dev) on building a site from scratch?",
				"added": 1505996003
			},
			{
				"comment_id": 6,
				"body": "It would be nice for us to come back to our country being able to\n1- Have our own site on Zeronet\n2- Give workshops on how to build a Zerosite",
				"added": 1505996024
			},
			{
				"comment_id": 7,
				"body": "When I wrote \"dedicated\" I meant a workshop just focused on learning to build a Zerosite. I did not mean dedicated to me : ) but an open one. The more people we are, the better.",
				"added": 1505996790
			},
			{
				"comment_id": 8,
				"body": "> [nofish](#comment_1009_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): After the talks I'm planning to do a small (30-40 min) workshop that covers site creation and the basic API functions.\n\nGreat! Thank you.",
				"added": 1506079283
			}
		],
		"1_1EMDKkZzS2ztrvcsUmzFkifjMWKFu73zCs": [
			{
				"comment_id": 9,
				"body": "I find it very interesting. It just requires people to crawl sites to contribute to the global index.",
				"added": 1507293594
			}
		],
		"1_1M1msf96AhLpJDJimVK7mXXCoaAGxfzxh9": [
			{
				"comment_id": 10,
				"body": "I'm also interested in that feature.\nThere's a request for it here:\nhttps://github.com/HelloZeroNet/ZeroNet/issues/931",
				"added": 1507552988
			}
		],
		"1509377783_1EG11ySHg4mXe3GEVwF3nVPAaX3rcvhiDd": [
			{
				"comment_id": 12,
				"body": "Phones are always problematic if you like freedom. You may want to check replicant.us",
				"added": 1510304895
			}
		],
		"17_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "Community networks are a real thing.\nThey do exist. They are self-managed autonomous networks.\nThey are free networks.\nOften using inexpensive Wi-Fi equipment.\nOwning your network infrastructure allows you to be unaffected in case of Internet shutdowns.\nWhy forget about mesh networking when you are looking for horizontal structures?\nIt is there and it does work.\n\nWe also need the apps.\nWe have some, but Zeronet is not there yet.\nI believe soon it will be.\nhttps://github.com/HelloZeroNet/ZeroNet/issues/931",
				"added": 1510306886
			}
		],
		"1515434127_1Lk7TiQFd6R7ZuUXDKSJdRULhXmwwhC7wZ": [
			{
				"comment_id": 20,
				"body": "There is also https://bisq.network/\nNot as easy as shapeshift.io but with a high level of anonymity and decentralization.",
				"added": 1515685522
			}
		],
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 26,
				"body": "Hi, I'm not a developer and I don't know much about Git or Zeronet, but I would like to know what that merge permission thing is.\nWhy do some zites -as Git Center- ask for merge permission?\nWhat is that?",
				"added": 1518434849
			},
			{
				"comment_id": 27,
				"body": "> [zerolstnmobile2](#comment_1_1AVEBziQwUaHK8J6gdiDsAjaA8vvye91L1): The repositories on Git Center are their own separate sites. These are known as Merger sites. This is done so that one does not have to download all repositories when they visit Git Center. [...]\n\nGood explanation.",
				"added": 1518528411
			},
			{
				"comment_id": 28,
				"body": "> [gitcenter](#comment_291_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Right, just one fix:\n\nGood correction.",
				"added": 1518528431
			}
		],
		"1519317962_1FDjeq4FUguvVstZbPD5NhUCaSC7AYm3tS": [
			{
				"comment_id": 29,
				"body": "External link:\nhttp://zeronet.readthedocs.io/en/latest/faq/#how-can-i-register-a-bit-domain",
				"added": 1519374370
			}
		],
		"1519377810_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA": [
			{
				"comment_id": 30,
				"body": "Thank you!\nIt would be nice if KopyKate could work with LibreJS [0]. Now LibreJS complains.\nActually it would be real good news if every site at ZeroNet was compatible with LibreJS.\nOr having any other solution to make people feel safe about JavaScript [1]\n[0] https://www.gnu.org/software/librejs/\n     https://www.fsf.org/youtube\n     https://www.gnu.org/philosophy/whats-wrong-with-youtube.html\n[1] https://www.fsf.org/campaigns/freejs",
				"added": 1519379991
			}
		],
		"1533831712_1Q5U8WerBKjVkN2aLMWH1ckmJFu5ezgv9m": [
			{
				"comment_id": 31,
				"body": "ZeroNet rocks, but if you are that security-conscious person who does not like hir web browser to be JavaScript-enabled, then ZeroNet is problematic. Unfortunately too many zites here need JavaScript to work.\n\nI wish some expert could show me I am wrong, that would make me very happy!\n\nSorry, I have not tested Freenet, it is said to be very secure but real slow.",
				"added": 1534252512
			}
		],
		"1534145930_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 32,
				"body": "Hi, I tested it on February 11 [0] and it worked ok.\nI used 3 physical computers (GNU+Linux) in the same LAN, no Internet. Both synchronous and asynchronous communications worked ok.\nI have not tested it recently.\n[0] http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:126:New+version:+0.6.2",
				"added": 1534253270
			}
		]
	},
	"comment_vote": {}
}