{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nothing](#comment_1_1GnKQZXGc51J9spdsMMXxJizM41LXeKEBz): yeah.. forgive germans right.. you know the germans or russians around now had nothing to do with the shitty part of history.. \n\nIn Russia, in general, there are almost no claims to modern Germans. There are, of course, claims to those who support Merkel in terms of anti-Russian sanctions, but this is another story :) With the Second World War, this has nothing to do. The text above refers to a sensational event when a Russian schoolboy speaking in Germany called ordinary German soldiers innocent victims of the war.\n\nRussians and Germans, in general, are two different, but very close in spirit people. It is a great tragedy that we fought so much with each other instead of building a common world.",
			"post_id": 6,
			"date_added": 1513440759
		},
		{
			"comment_id": 2,
			"body": ">**Political Interest** wrote:\n>As a result Syria will not become a hell state like that of Libya or Iraq. The Christian minorities and others will be able to live.\n\nYou can be any kind of negative attitude to Assad (although I, knowing his sociotype well, I doubt that he has at least 1% of what is attributed to him), but under his authority, Syrian Christians are not threatened. While under the rule of opposition Islamists, however they are called, FSA / NSA / etc., Christians and other gentiles in Syria are doomed.",
			"post_id": 2,
			"date_added": 1513449204
		},
		{
			"comment_id": 3,
			"body": "> [nothing](#comment_3_1GnKQZXGc51J9spdsMMXxJizM41LXeKEBz): also you seem to know wayyy fucking more about politics and things than i ever have :)\n\nI just started to be interested in politics even during the USSR :) On the one hand, I was an active schoolboy who participated in a lot of official political events. On the other hand, I listened to a lot of Western radio stations that were waging an information war with the USSR - Voice of America, Deutsche Welle, Radio Sweden. And I could not help asking questions comparing different information :) Later I came across very many points of view on the most different events in the world. This leaves its imprint on the perception of the world. In addition, in Russia, since the Perestroika period in the late 1980s, it is very difficult to avoid politics.\n",
			"post_id": 6,
			"date_added": 1513456282
		},
		{
			"comment_id": 4,
			"body": "> [helium](#comment_3_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): On of my counterargument to Your current blog post is that The West is actually not only America and UK.\n\nEverything is simpler. This project was born as a backup of my communication in American forums. On which mostly Americans communicate. Therefore, in the context of that communication, the \"West\" is more often referred to as the \"US + UK\" :) Or, more broadly, \"US Allies in the confrontation with Russia.\" I understand that Western civilization is much broader than the US. But while the political direction of the West is mainly set by America.",
			"post_id": 43,
			"date_added": 1518606866
		},
		{
			"comment_id": 5,
			"body": "> [helium](#comment_4_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): You may want to look at that joke\n\nYes, in Russia many people call Xenia Sobchak a horse. And this video is also linked in the comments to her :)",
			"post_id": 51,
			"date_added": 1518746954
		},
		{
			"comment_id": 6,
			"body": "> [alci](#comment_1_1Jb9DbvpDn7xsoKLpYvRCD3MtnJRgSoMif): pleez text me in zeromail ----alci\n\nSent. I'm **balancer73**",
			"post_id": 65,
			"date_added": 1539539587
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}