{
	"title": "大国师王威博客",
	"description": "My ZeroBlog.",
	"links": "*   [微信公众号](http://mp.weixin.qq.com/s?__biz=MzIxNTE3MjM1Mw==&mid=504544888&idx=1&sn=e6bd68a204e4be05747ea6a04c036330&chksm=0c7a4a163b0dc3007d1a9e5e1197ae47b640441759c3c75a1544ee6de36e2291461c420d642e#rd)\n\n[zero中文导航](http://127.0.0.1:43110/0cnguide.bit/)\n\n[zerome](http://127.0.0.1:43110/Me.ZeroNetwork.bit)\n\n本站文章目录\n\n[1、一则历史笔记——论商鞅](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/?Home)\n[2、为什么我一直用理智思考，还是会被宗教的上帝神灵的概念所迷惑？](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/?Post:2:%E4%B8%BA%E4%BB%80%E4%B9%88%E6%88%91%E4%B8%80%E7%9B%B4%E7%94%A8%E7%90%86%E6%99%BA%E6%80%9D%E8%80%83%EF%BC%8C%E8%BF%98%E6%98%AF%E4%BC%9A%E8%A2%AB%E5%AE%97%E6%95%99%E7%9A%84%E4%B8%8A%E5%B8%9D%E7%A5%9E%E7%81%B5%E7%9A%84%E6%A6%82%E5%BF%B5%E6%89%80%E8%BF%B7%E6%83%91%EF%BC%9F)\n\n[3、为什么只有红楼梦才配称红学](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/?Post:4:New+blog+post)\n\n[4、为什么中国是美国第一大储备国？](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX)\n\n[5、真实的岳飞形象是怎么样的？](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/)\n\n[6、生命是一场丰富的盛宴](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/)\n\n[7、四川保路运动真的是爱国运动？]\n\n[5、认识你自己](http://127.0.0.1:43110/16dpBzhLDKThzQPmtrZP1FQ3z7wBN8XiPX/?Post:10:New+blog+post/)\n\n[6]\n[7]",
	"next_post_id": 12,
	"demo": false,
	"modified": 1520764255,
	"post": [
		{
			"post_id": 11,
			"title": "如何为你的对手辩护——写作训练营第二堂课草稿",
			"date_published": 1520763932.306,
			"body": "如何为你的对手辩护——写作训练营第二堂课草稿\n\n加入这个写作训练营的同学，女生有21位，男生有19位.\n貌似男女比例不大协调。\n在自由结对结束之后，请根据管理员黄圈圈、琳琳的制定安排，强制结对，进入第二课时。\n\n写作课第一课时是——认识你自己。\n\n今天，则是要求你们认识他人。\n在我们这个时代，是一个宽容多元的时代，每天我们在接触大量的道德立场完全相左的消息。\n我们很容易被自媒体的10万+调动情绪。\n\n在我们看过的每一篇文章中，我们往往看到很多人很娴熟的站在自己的视角，站在大众的视角，站在真善美的视角去看文章。\n那些文章看起来很爽，力气万钧。\n然而，那些文章真的无懈可击吗？\n\n现在，我要你们手握起一把锤子，将你们的世界看成一枚钉子，钉下去。\n\n现在，我们你们根据你们的性别，做出一个尝试——\n\n男同学的题目是——做一个成功的女人，就应该出轨？\n女同学的题目是——做一个成功的男人，就应该出轨？\n\n记住了，这是个游戏。\n我这里，只是要求你们尝试换位思维，思考异性的逻辑出发点。\n\n你们在写这篇文章的时候，男人应该想象自己就是一个女人，假设描写出一个女人的所有生活场景，真实困境，假设自己已经出轨了，该如何为自己的出轨行为辩护。\n如果你们实在想象不出这个女人的形象，那就明确具体目标为《水浒传》的潘金莲。\n\n同样的，女人应该想象自己就是一个男人，一个事业无比成功男人，妻子贤惠，但你还是出轨了，你该如何为自己的出轨行为辩护。\n如果你们实在想象不出这个男人的形象，那就明确具体目标为《天龙八部》的段正淳。\n\n同时，还记住一点，这里要求的不是你们写一篇理性的思辨文章。\n而是让你们完成一个小小说，建构起场景，人物，事件，借由人物之口来表达他的真实想法。\n\n人有千般万种，理解从来不易。\n小说是一门艺术，让你可以轻易化身千万，以他人之言为己言，以他人之思为己思。\n\n这一门课。\n欢迎所有结对的同学可以展示彼此的聊天记录。如果你们私底下争论比较有趣的话。可以截图上传到知识星球。\n\n![_______1.jpg (92x900)](data/img/post_11________1.jpg)"
		},
		{
			"post_id": 10,
			"title": "认识你自己",
			"date_published": 1520573333.174,
			"body": "王威写作训练营第一课大纲\n（点赞，即表示你看到本期作业了）\n写作第一件事情，要明白的只有五个字——\n认识你自己。\n当你拿起笔，第一件要娴熟的推销你自己，无论是你的人，你的观点，都是从你的肉身出发的。\n你的肉身承载一切知识，离开了你的肉身，一切知识无意义。\n所以，一即一切，一切即一。\n\n第一课，对你的要求，就是你们找出你们一张个人的生活照。\n这张生活照必须有背景，可以是校园，可以是室内，也可是是大街。\n这时候，学会通过五种基本手段审视自己——\n一、视觉。描写你眼中的自己。\n二、听觉。从这张照片中，有哪些你想象起来的声音。\n三、嗅觉。你鼻子闻到了什么，嗅觉是多少写作者会忽略的感觉。\n四、味觉。如果照片上你没有动用到你的舌头，可忽略。\n五、触觉。我们和世界最基本的互动方式，你触动了什么，无论是人和物，都会因为你的触动而改变。 描述自己从来不容易。\n写作，首先基于对于自己的官能的延伸。\n我们对世界的认识，从不客观，从来为我们的五官感受所左右。\n哪怕是面对自己的照片。 好了。这就是各位同学第一天的任务了。 本文字数不限，但五感至少写出四感。\n\n![_______.jpg (494x900)](data/img/post_10________.jpg)​​​​​​​"
		},
		{
			"post_id": 9,
			"title": "四川保路运动真的是爱国运动？",
			"date_published": 1520417315.547,
			"body": "一旦你要是读了国内撰写的盛宣怀的生平事迹。\n那盛宣怀的资本家嘴脸、买办阶层的定性是肯定没跑了。\n\n可是，你要是真的一页页去爬梳盛宣怀的生平事迹，一件件写出来，就会知道，到底是谁在污染历史了。\n\n现在一大堆人写了这么多又臭又难看的斗争文章，都是二手货。\n\n真正回到历史情境之下，回到清末，就会知道，盛宣怀固然不无辜，可是，那些宣称爱国口号，满怀保路激情的四川乡绅，真算什么好玩意吗？\n\n楼下的一大堆愤青的答案，严格来说不是读书少，而是他们剪裁了历史，以当代人的史观强奸昔日之历史。\n\n先说保路运动之缘起——\n\n1904年，川汉铁路总公司（以下简称川路公司）在成都成立。\n\n当地政府给予其诸多优惠政策，最大的红包算是准许川汉铁路向四川农民摊派征收所谓的“租股”。\n\n到了1909年，已经成立5年的川路公司只筹集到700万两资金，离5000万两的目标还相差甚远。\n\n看懂了吗？\n\n大清政府对于四川地方政府，没有任何亏欠的地方。\n\n可是四川政府自身财政困难啊。\n\n在资本不够的情况下，强行上马，这条铁路本来就没有成功的可能性。\n\n所以，保什么路啊。\n\n这路在哪里啊？？？？？记住，这是一条永不可能建成的路啊。\n\n可是，就700万这点钱，四川当地的政府还随意上下其手，四川总督锡良就把川路公司当成了自己的小金库，前后几年共挪用路款300万两。\n\n1909年，清廷任命四川泸州人施典章为川路公司总收支，这家伙也是奇葩，调拨了川路公司350万两资金，等于当时公司已筹股本的一半，前往上海进行投资股市去了。\n\n当时上海股市也曾火爆了三年，可到了1910年，上海股市股灾，全面崩盘。\n\n好了，大家算算这两笔账，700万两的本金，现在剩下多少了。\n\n这时候，四川地方政府要求大清政府接手了。\n\n大清政府能当冤大头吗？当然是拒绝的。\n\n所以，铁路国有。国有个屁啊。说不客气，全是四川政府四川乡绅四川人搞出来的烂账亏空。\n\n这就是所谓的商办铁路的弊端。\n\n大清政府此前建设的国有铁路，资金充足，建一条成一条，赚大钱了。\n\n可是川汉铁路总公司是一个什么玩意，是商办铁路。\n\n商办铁路亏空了，即将倒闭了，大清王朝被勒索了，害怕引爆更大的危机，不得不制定铁路国有的方案。\n\n这个方案，不管怎么执行，大清王朝都是亏的。\n\n大清也没钱啊，怎么办，只能去向西方列强借款准备从民众手中赎回铁路路权了。\n\n可是，这会儿，四川人在四川乡绅的煽动下，起来“爱国”了，非得“保路”了。\n\n这太逗逼了啊。\n\n就因为清廷仍拒绝为川路公司炒股亏空买单，于是在1911年6月17日，四川的保路运动开始由经济纠纷向政治斗争发展乃至酿成武装暴动。\n\n其实，大家只要一桩桩一件件去分析，就知道，这些事情根本就不是大清王朝中央政府去掠夺四川地方政府。\n\n而是四川地方政府主持的民营铁路公司，因内部腐败，实际上无法继续，在消耗了大量的社会资源无能为力之后，强迫大清中央政府当接盘侠。\n\n大清中央政府当了接盘侠，只能推行国有了，还能怎么办？只有这样才能转化为国家债务。\n\n而大清中央政府自身没钱啊，只能去找洋人银行借钱了，这怎么就成了卖国了啊。\n\n谁来给我说，这事情怎么性质一下子就变成了卖国了。\n\n给我站出来啊。\n\n保路运动看似围绕“姓公”（国有）还是“姓私”（商办）。\n\n川路公司高层试图利用铁路国有的机会，“拿”政府一下，让政府为自己的炒股亏损买单。\n\n如果这类事情发生在今天试试，也就是晚清政府自从东南互保之后，失去了对南方地方政府的财政掌控权，为了国家不至于分裂，才含泪决定了“铁路国有”。\n\n一个不得不为四川人的投资失败埋单的中央政府，是多么的可怜啊。\n\n到了你们嘴上，资本家丑恶的嘴脸、官僚资本的腐败、卖国腐朽的大清王朝，一顶顶帽子全扔出来，这是在搞笑吗？\n\n在这一事件上，盛宣怀个人的作用是微不足道的，他所秉承的意见，乃是大清王朝中央政府的意见——\n\n为了维持国家的稳定，可以吃亏，但是不能吃太多的亏。\n\n真相就这么简单。\n\n至于其他的答案，完全是瞎鸡巴扯蛋。\n\n扯蛋的人扯的自己还都信了呢？\n\n可笑。\n\n要是这种事情发生在今天，发生在我们这个强而有力的中央政府的统治下的国家，地方政府的商办企业去勒索中央政府试试，去喊爱国口号试试，去搞保路运动试试。\n\n得了吧。\n\n你们个个都得说中央政府太良心了。\n\n你们个个都得说，四川乡绅四川人纯属刁民啊。\n\n怎么换了个时空，你们就开始胡说八道呢？\n\n这是欺负大清王朝亡了灭了，没法为自己说话是吧。\n\n![_________.png (600x787)](data/img/post_9__________.png)​​​​​​​"
		},
		{
			"post_id": 7,
			"title": "生命是一场丰富的盛宴",
			"date_published": 1520068207.935,
			"body": "生命是一场丰富的盛宴\n\n王威斗鱼直播精选，2018年春节特辑\n（每期大约时长45分钟）\n\n第二十七期\n\n唯有探讨邪恶，方能抵达真实？\n真正的感受力，基于对细节的观察？\n国师，你春节为什么不会回家？\n聊聊电影《心灵捕手》？\n哲学是什么？怎么才算是具备了哲学思维？\nsam的到访。\n\n链接：[https://pan.baidu.com/s/1bqrc3Ll](https://pan.baidu.com/s/1bqrc3Ll) 密码：m8lt\n\n第二十六期\n\n怎么看待匈奴冒顿给吕后写的侮辱信？\n音乐为什么能够使人愉悦？\n中国发展半导体产业有可能成功吗？\n如何看待流行的pua学？（女嘉宾王烨）\n\n链接：[https://pan.baidu.com/s/1dG89w57](https://pan.baidu.com/s/1dG89w57) 密码：isd4\n\n第二十五期\n\n女人太强势，男人很笨，难以维持婚姻，怎么办？\n恋爱两年，因为和别的妹子单纯聊天被分手，该怎么办？\n很讨厌拍领导马屁，该怎么办？\n国师支持全职太太？\n人类最爽的做爱体验是什么？\n小时候朋友成了精神病，总是来我家骚扰我，怎么办？\n\n链接：[https://pan.baidu.com/s/1mjTtPsk](https://pan.baidu.com/s/1mjTtPsk) 密码：dp8x\n\n第二十四期\n\n活得简单一点会不会更轻松？\n如何评价周星驰的电影？\n如何控制自己的贪欲？\n为什么女生一失恋，就剪短头发？\n谈恋爱，一定要先过肉体这一关\n秦国变法成功，韩国变法失败，为什么？\n高智商的人是怎么样处事的？\n\n链接：[https://pan.baidu.com/s/1dFYH86t](https://pan.baidu.com/s/1dFYH86t) 密码：xcxm\n\n第二十三期\n\n如何理解自由意志？\n完美主义者该如何活得幸福？\n如何看待中国目前离婚率的上升？\n如何写出一篇完美的高考作文？\n传统家族的瓦解，和西方教育有关吗？\n陈安之的成功学课程，四天三夜收费3800元怎么看？\n城市规划应该考虑哪些部分？\n\n链接：[https://pan.baidu.com/s/1ggmQBqN](https://pan.baidu.com/s/1ggmQBqN) 密码：dcfo\n\n第二十二期\n\n如何看待新中式建筑？\n如何评价费孝通的《乡土中国》？\n如何评价梁思成的北京城改造方案？\n为什么很多文学家认为李白的诗歌成就不高？\n如何评价贾樟柯的电影？\n国师，你迷恋女人身体的那一部分？\n挑选伴侣的标准是什么？\n我所理解的佛法？\n领导人不读书，对治国有影响吗？\n佛学提倡不执着，我却总是放不下，很矛盾？\n\n链接：[https://pan.baidu.com/s/1pMVpA0F](https://pan.baidu.com/s/1pMVpA0F) 密码：ate0\n\n第二十一期\n\n圣经的《新约》《旧约》分别？\n中国上古史没有出土文物，怎么确定真实性？\n\n链接：[https://pan.baidu.com/s/1bqrI1A3](https://pan.baidu.com/s/1bqrI1A3) 密码：rky6\n\n第二十期\n\n国师，你信命吗？\n你是历史虚无主义者吗？\n想追女生，又害怕没法和她做朋友了？\n真诚是最难的，唯有圣人，才能受天下诟，不惜成为过街老鼠？\n烽火戏诸侯是真的吗？\n知识星球的语音提问功能很棒？\n婚姻本质是什么？\n《论语》为何而作，孔子的目的是什么？\n\n链接：[https://pan.baidu.com/s/1kWNWmoR](https://pan.baidu.com/s/1kWNWmoR) 密码：2z3s\n\n第十九期\n\n如何维持一段长期的稳定的情感关系？\n说脏话难道不能体现出聪明智慧？\n如何看待游戏人生一事无成的人？\n如何看待追逐名利的人？\n如何成为一个内心无比强大的人？\n我所理解的孤独是充满美感的！\n我不理解为什么那么多人抵触鸡汤？\n国师有过什么遗憾？新的一年有什么打算？为什么不找团队包装一下？\n\n链接：[https://pan.baidu.com/s/1o9RTPUy](https://pan.baidu.com/s/1o9RTPUy) 密码：1j0i\n\n第十八期\n\n知乎大v是如何对18岁小姑娘骗财骗色的？（上中下三集）\n\n链接：[https://pan.baidu.com/s/1mjOAhvE](https://pan.baidu.com/s/1mjOAhvE) 密码：2n9a\n\n第十七期\n\n在一段恋爱关系中，女生为什么总是那么保护自己？\n暗恋是追不到女生的\n大学就应该谈恋爱\n现在都是独生子女，应该如何培养孩子？\n渣女为什么总是遇见渣男？\n忙碌有什么意义？\n\n链接：[https://pan.baidu.com/s/1pMO3Z3l](https://pan.baidu.com/s/1pMO3Z3l) 密码：f8xo\n\n第十六期\n\n聊聊真实三国里的董卓董太师？\n聊聊王阳明的军事才能？\n\n链接：[https://pan.baidu.com/s/1kWr2j23](https://pan.baidu.com/s/1kWr2j23) 密码：ikod\n\n第十五期\n\n勤劳未必有用，真正赚钱的方式是掌握人心。\n买手机需要多了解手机知识吗？\n博览群书破万卷是什么样的体验？\n国师和犬儒挺接近的，你是怎么看待自己的同类人的？\n为何天才总是英年早逝？\n西方嬉皮士象征的美帝资本主义的腐朽，这个说法对吗？\n图书馆在未来会消失吗？\n女人真的是不讲理的感性动物吗？\n如何理解《论语》中的“邦无道，君子富且贵，耻也”这句话？\n网络文学是文学的未来吗？小说、电影、动漫各自的优势在哪里？\n\n链接：[https://pan.baidu.com/s/1rasUh8C](https://pan.baidu.com/s/1rasUh8C) 密码：hy4b\n\n第十四期\n\n一直面试失败，失业很迷茫，该怎么调整心态？\n修佛该怎么入门？\n韩国人天天赚中国钱，还批准美国萨德，该怎么看？\n直面孤独\n百度百科为什么比不过维基百科？\n国师对目前人类的知识体系怎么看？\n中国目前的语文教育存在哪些问题？\n美国枪支泛滥怎么看？\n真的有必要花时间提高自己的社交能力吗？\n怎么评价最强大脑？\n低温下的深海生物还能存活，这是奇迹吗？\n辩论可以获得智慧吗？\n\n链接：[https://pan.baidu.com/s/1kWujYnl](https://pan.baidu.com/s/1kWujYnl) 密码：42ph\n\n第十三期\n\n怎么评价最新流行的作家木心？\n知乎这个网站会不会衰落？\n李光耀是不是一个有远见的政治家？\n怎么评价美国的五月花号？\n怎么欣赏纪录片？\n怎么评价美国杂志《花花公子》？\n孔子为什么要诛杀少正卯？\n十字军东征对世界史有哪一些巨大的影响力？\n如何理解《圣经》一书的民族观念？\n为什么全世界只有美国盛行脱口秀文化？\n为什么会有出轨？精神出轨和肉体出轨哪一个更可怕？\n文化战争从来是少年人和老年人的战争？\n作家描写的作品中的国民性靠谱吗？\n枪炮钢炮病菌一书认为粮食作物、家畜驯养对美洲进化的影响合理吗？\n\n链接：[https://pan.baidu.com/s/1jKnaJaA](https://pan.baidu.com/s/1jKnaJaA) 密码：9uso\n\n第十二期\n中西医之争怎么看？\n人活着到底有什么意义？\n过年不想回家，又怕村里长辈抱怨我不懂事，怎么办？\n中国股票有投资价值吗？\n女朋友问，到底是我重要还是游戏重要，请解答？\n夜店坐台小姐们的黑暗人生观？\n中国中产阶级为何都很焦虑？\n\n链接：[https://pan.baidu.com/s/1mj9bd1I](https://pan.baidu.com/s/1mj9bd1I) 密码：2br2\n\n第十一期\n袁世凯称帝是不是因为集权不成功？\n文艺复兴真的是因为阿拉伯人保存了古希腊文化？\n怎么看待目前中医的现状？\n小粉红壮大会不会妨碍中国与世界接轨？\n一个抑郁症的处女该如何和外界交往？\n爱思考的处男该如何和女人交往？\n老婆出轨了，好想去死啊，怎么办？\n美洲人在大航海时代为什么进化的那么慢？\n春晚一年比一年难看，为了吐槽，还不得不看。\n\n链接：[https://pan.baidu.com/s/1i69hjzZ](https://pan.baidu.com/s/1i69hjzZ) 密码：62l1\n\n第十期目录\n\n比特币有投资价值吗？\n目前的热点问题，随口回答，大家不必较真。\n\n链接：[https://pan.baidu.com/s/1i6mgn57](https://pan.baidu.com/s/1i6mgn57) 密码：8mvu\n\n第九期目录\n\n和女友恋爱六年了，异地了\n又不想结婚，该怎么办？\n\n链接：[https://pan.baidu.com/s/1o9O5GSE](https://pan.baidu.com/s/1o9O5GSE) 密码：2ez1\n\n第八期目录\n\n大学生该如何和偏执暴躁的父亲讲理？\n推荐给任何和父母亲有沟通交流问题的同学们，认真思考，你必能受益。\n\n链接：[https://pan.baidu.com/s/1o9yhrVO](https://pan.baidu.com/s/1o9yhrVO) 密码：hebi\n\n第七期目录\n\n知乎大v是如何对18岁小姑娘骗财骗色的？\n（此期不完整，后续在第十八期补充，会写一篇专门的文章，这个算是我目前最气愤的事情了。\n如果要是我还在知乎，肯定为这个小姑娘伸张正义了）\n\n链接：[https://pan.baidu.com/s/1kWTv7hH](https://pan.baidu.com/s/1kWTv7hH) 密码：643r\n\n第六期目录（重磅）\n\n道德或者善为什么值得追求？\n说谎是不道德的吗？\n道德是大多数人的道德，还是少数人的道德？\n为什么多数人把道德理解为利益？\n一个无所作为的人道德吗？\n\n链接：[https://pan.baidu.com/s/1dFTr7iT](https://pan.baidu.com/s/1dFTr7iT) 密码：p1iz\n\n第五期目录\n\n女嘉宾桃姑娘，女人为什么不在乎男人的长相？\n喜欢一个人，如何做正确的事情？\n谈恋爱，你真的知道你喜欢的是什么类型？\n男主播邓公子，想要一段稳定感情的人，一定要排除很多的类型？\n女人该如何和男人交流？\n知识只能通过性传播，克隆人会遇到什么问题？\n这个社会女人为什么越来越滥交了？\n领导劝酒难以拒绝，该怎么办？\n国师，你一口胡建普通话，也配直播？\n国师学过心理学吗，为什么这么了解人性？为什么说心理学是玄学而不是一门科学？\n八卦科学吗？这是一门什么样的学问？\n\n链接：[https://pan.baidu.com/s/1i5TPwsl](https://pan.baidu.com/s/1i5TPwsl) 密码：39n1\n\n第四期目录\n\n人年纪一大最害怕是什么？\n爱是什么，该如何定义？\n女人诡异而又不成立的爱情标准？\n人为什么需要爱？\n我非常自卑，不敢追求女性，有什么办法？\n三十岁了，还是感觉自己不成熟，如何变得更强大？\n欢迎来到我的知识星球\n\n链接：[https://pan.baidu.com/s/1mjYJlqg](https://pan.baidu.com/s/1mjYJlqg) 密码：d710\n\n第三期目录\n\n女嘉宾王烨自我介绍、如何处理好暧昧关系？\n身边有个特别讨厌的人，偏偏过的比我好，该如何调整心态？\n男朋友老是玩游戏，越来越没有安全感了，怎么办？\n女孩子总是和我暧昧之后，找了别的男生，心态无法平衡，该怎么办？\n杨玉环和李隆基是真爱吗？\n什么才是世界上最残酷的爱情？\n如何理解道德，人类的善与恶？\n\n链接：[https://pan.baidu.com/s/1eSVrozg](https://pan.baidu.com/s/1eSVrozg) 密码：07ra\n\n第二期目录\n\n一个人一直内向好不好？\n只想性，不想爱，有什么问题？\n为什么多数母亲焦躁暴戾？ 女人不开心为什么就花钱购物？\n很多老人被骗，很担心父母，该做什么？\n各地丧葬风俗越来越雷同，是不是代表文化的消失？\n如何理解道德，人类的善与恶？\n如何治好抑郁症？ 如何理解历史大事件的意义，把握历史真相？\n除了赚钱之外，人生似乎没有其他意义，很苦恼，怎么办？\n你为什么写小说，怎么写好小说？\n\n链接：[https://pan.baidu.com/s/1kWZ0ZPl](https://pan.baidu.com/s/1kWZ0ZPl) 密码：ynzf\n\n第一期目录\n\n袁世凯为什么不挟持天子？\n相亲三个男生，选谁合适？\n谈恋爱为什么不能走到结婚这一步？\n农村的婚外恋也多了，真的是道德沦丧了吗？\n暗黑系的爱情故事，一个女生的择偶标准？\n如何算计别人？\n为什么人类反反复复于战争与和平之中？\n\n链接：[https://pan.baidu.com/s/1jJfsyW2](https://pan.baidu.com/s/1jJfsyW2) 密码：g0fj\n\n整理斗鱼直播视频可比写字痛苦多了。\n春节期间在斗鱼连续讲了一百多小时。\n剪辑下来的精华，也不过10小时。\n便宜你们了。哈哈哈。\n觉得有趣的同学，可以转发给推荐别的同学。\n\n这里也道个歉，让大家一个个的下载。\n不打包的原因，是一个文件有问题了，往往一个文件夹就取消分享了。\n大家累一点就是了。\n——————————————\n\n知识星球过往回答专辑\n\n链接：[https://pan.baidu.com/s/1mjykE9a](https://pan.baidu.com/s/1mjykE9a) 密码：wnf0\n\n![____1.jpg (925x500)](data/img/post_7_____1.jpg)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "真实的岳飞是怎么样的形象？——颠覆你的三观。",
			"date_published": 1519978315.315,
			"body": "真实的岳飞是怎么样的形象？相信足以颠覆你的三观。\n\n讨论真实的岳飞意义不大。\n\n当年岳飞如果仅仅是被赵构软禁了，然后，再像韩世忠养在杭州。现代的人，根本不怎么会去讨论他。\n\n岳飞在中国历史上之所以暴得大名，完全赵构的成全。\n\n只有赵构杀了岳飞，岳飞才名垂千古了，他的生平的每一个细节才被大家拿出来一一讨论的。\n\n于是岳飞每一场战争细节，每一份捷报，他的军纪，他的为臣之道，他的师友关系，乃至于他的妻子儿女，公德私德，都被历史学家拿着放大镜去一一深究了。\n\n这种运气，可不是每个名将都有的。\n\n如果要是岳飞得善终，顶到天了，也就是入武庙，成为十哲七十二将的一员罢了。\n\n不客气的说，能入武庙的，哪一个军事天才逊色于岳飞了。\n\n随便拎出来一个韩信，那可是灭了楚霸王项羽的人物，帮刘邦统一了天下的人物。\n\n至于岳飞，最好的战果，也就挺进到了河南，离扫平天下还有很长的路走呢？\n\n可是中国人，无论是历史学家还是普通人之所以热衷讨论岳飞，和热衷讨论韩信、诸葛亮是一样的。并不是韩信、诸葛亮本身军事有多么的天才，而是他们和君主之间至为特殊关系。\n\n中国二十四史之所以黑暗，说白了，就是君臣关系之间，无比的紧张的，特别是这个臣下手握军权的话。\n\n韩信被杀，是因为他的军事天才太卓越，吕后担心万一刘邦死了，控制不住，也就杀了。\n\n诸葛亮被崇拜，是因为他手握军权，秉政多年，威权在手，居然没有篡位，君臣两安，在乱世中，简直是奇迹了。\n\n所以，岳飞之所以被我们无比热衷讨论关注，要点并不在于他的军事天才。\n\n领军的武将对皇权的威胁，构成了死结，才是真正的主因。\n\n赵构很倒霉，在乱世中成为南宋的开国君主，从他在史书上正式登场，就是以皇子的身份开始不断逃难。\n\n而且所有的大臣还对他寄予了众望。因为没有别的人选了。\n\n他只是汴梁城中养尊处优的佳公子，虽然也习武，也射箭，可从来没想过会遇上家国大难，会登上皇帝宝座，会承担宋王朝存亡继绝的责任。\n\n而且这还是他不可推卸的责任，因为其他皇子全被金人一窝端了。\n\n这个责任大不大，咱们普通人想一想，你老爸的公司被烧光了，老爸老妈被强盗掳掠的不知去向。而剩下的大火灾后的全体员工，还指望你继续继承公司，让他们可以养家糊口。\n\n不客气的说，多数人要是遇到这一刻，心理不崩溃也扭曲，不神经病也变态。\n\n人没那么坚强啊。\n\n赵构继承了这家实际上已经是半破产的公司之后，好日子也没过一天。\n\n我们就不讨论所谓的外患了，金人的野蛮大家都知道。\n\n我们就讨论赵构的内忧，只有理解的赵构的内忧，才知道为什么岳飞被冤杀了。\n\n实际上，赵构原本想搞死的，也不是岳飞，而是韩世忠。\n\n要是被冤杀的是韩世忠，今天大家热衷讨论的话题就是——\n\n赵构为什么杀韩世忠？\n\n真实的韩世忠是怎么样的？\n\n太平盛世，君臣名分早定，即便是手握军权的武将正常也很难造反。\n\n可是一旦到了乱世，就中国人的小脑袋，从来想的是天下兵强马壮者得之。\n\n大家可能理所当然的想象，北宋灭亡了，所有宋人就应该同仇敌忾，一起赶走金人。\n\n可实际上，现实场景恰恰相反，中国这样的国家，一旦大一统王朝崩溃，马上就群雄并起。\n\n岳飞有个弟弟叫做岳翻，不是死在金人的手里，而是死在宋人一股地方军阀曹成的手上。\n\n不说北方民变纷起，就是南方，也是随时都有人拉起十几万人一股农民军。\n\n这情形，说细了，大家也不理解。\n\n大家想象一下民国就行了，日本都入侵了，吞并了整个东三省了，名义上统一中国的蒋介石最伤脑筋的灭了红军。这叫攘外必先安内。\n\n任何中国的统治者，在外患当头，想得从来是先解决内部纷争，而不是去抗击外敌。\n\n因为谁去卖力抗击外敌了，把自己的本钱消耗了，那连维持原有地盘的能力都没有了。\n\n再举个例子，满清入关，灭了南明，其后建立了永历政权和隆武政权。大家是不是觉得都是朱元璋的子孙，就应该一致对外啊。\n\n恰恰相反，此一时合格的统治者，优先考虑的就是先灭掉内部的竞争对手。所以，双方火拼是出动的全部实力，结果大家都知道，最终是满清渔翁得利，得了天下。\n\n所以，理解了以下的中国王朝更易之时，力图中兴的统治者，无论是赵构、永历帝还是蒋介石，他们优先考虑的消灭自己的地盘上割据一方的竞争对手，无论是你是一脉同根生的皇子，还是农民起义军。\n\n岳飞就为赵构平定过杨幺，在平定之前，南宋朝廷肯定也是想过要招安杨幺的，可是有用吗？\n\n所以，现代人理所当然的以为的逻辑——南宋人民上下一心，共同抵御外侮的局面是不存在的。\n\n一旦乱世开启了，什么民族大义，夷夏之防这类的号召，虽然不能说是空话，可是多数拥有军事力量的割据武装想的从来都是，我先灭了你，再去赶走金人，统一天下。而不是相反。\n\n咱们这里先不论收复中原，赶走金人了。因为那不可能是赵构脑子里头重点，除非他脑袋进水了。\n\n赵构所能做的，就是金人来打，他防御的住，就是偶尔进攻，也是属于防御性的进攻。\n\n即便以后来岳飞的朱仙镇大捷，那根本是赵构意料之外的战果捷报，他想的不过是向金人展示一下自己的军事实力，这从他给岳飞下达的一系列前后矛盾的诏书是可以看出来的。\n\n应该说，赵构在处理农民军起义上干的还不错。\n\n处理完了农民军之后，赵构该干啥呢，去发动全民抗击金人吗？\n\n这依旧同样不是他考虑的重点。\n\n所以，岳飞很不幸啊，他倒霉啊，并不是岳飞自己什么不会做人，什么想迎立二帝，而是这时候，赵构唯一想干的事情是收回兵权，恢复祖制，让文官骑在武将头上。\n\n大家可能会想，赵构神经病吧，都平定内乱了，而且岳飞等中兴四将也在战场上刷满了经验值了，为啥不去赶走金人收复中原，而非得在这个时候收回四镇军权。\n\n赵构神经病啊，太神经病吧。\n\n可是大家要是看看他自登基之后，发生的这些来自于南宋王朝手握重兵的武将叛乱就明白了。\n\n第一次，苗傅之变。1129年初。赵构最初是像小白兔一样相信苗傅是忠臣的。所以苗傅才有可能被任命为护卫亲军统制。\n\n第二次，杜充兵变。1129年底。这杜充可是宰相啊，赵构最初是像小白兔一样相信杜充是忠臣的。赵构闻讯后整天不吃不喝，唠叨说：我对杜充这么好，从普通官员一直提拔他当了宰相，他怎么可以这样做？\n\n第三次，淮西兵变，1137年。这场兵变具体细节大家百度吧。\n\n你们说赵构多疑，不相信忠臣。\n\n对不起，你们的人生没有被自己无比信任的忠臣背叛过三次的特殊体验哦。\n\n就是华为老板任正非被手下背叛了一次，以后防部下都像是在防贼啊。\n\n所以啊，你们天天强调岳飞是忠臣的，找各种历史书上关于岳飞的品德细节来证明岳飞绝对不会谋反，对赵构是毫无意义的。\n\n赵构当年也是天真的相信过苗傅，相信过杜充的。结果呢？\n\n所以，这时候，无论是不是和金人和议，对南宋王朝还是对赵构最急迫的任务，就是收回兵权。\n\n这种事情，是理解也得执行，不理解也得执行。\n\n而且还执行的特别顺利，顺利到岳飞必须死。\n\n这是赵构人生第一次对手握重兵武将们的逆袭。\n\n先不讨论和金人和议的问题，赵构此一次收回兵权的重点，是打算杀人立威的啊。\n\n而且他也选好了人选和执行人。\n\n1141年（绍兴十一年）五月。岳飞接到高宗诏令，命他张俊一起出使原韩家军驻地楚州。目的就是张俊和岳飞去楚州之机，借张俊和岳飞之刀杀韩世忠之头。\n\n岳飞拒绝了，还给韩世忠通报消息了。于是韩世忠赶紧跑到赵构哪里号哭，赵构一看，太打脸了，算了。\n\n然而，杀人立威这种事情，既然定下了，你岳飞不听话，杀不了韩世忠，那就杀你岳飞立威好了。\n\n所以，岳飞是不是忠臣，不重要了，莫须有就可以杀了你。\n\n赵构的目的，就是杀个武官集团的领袖，让自己收回兵权的改革得到顺利的贯彻。\n\n所以，也同样是在这一年十月，岳飞就被抓到了大理寺，十二月被冤杀。\n\n所以，说到了这里。\n\n岳飞的真实功劳如何，不重要了。\n\n说真的，岳飞功劳再大，对赵构来说，比不过韩世忠，因为在苗傅兵变中，韩世忠是救过赵构的命的啊。\n\n你看，赵构对韩世忠都下得去手，岳飞军事上再怎么大的赫赫战功，能和韩世忠比吗？\n\n如果不能？既然岳飞救了韩世忠，就等于是把自己的命搭进去了。\n\n天时地利人和，就是这么凑合，让岳飞不得不被冤杀，让韩世忠逃了性命。\n\n否则，今天我们这里连篇累牍，讨论的就不是岳飞，而是韩世忠了。\n\n说到底啊，杀岳飞的，乃是乱世之中，赵构九死一生之后，涨出来的经验值。\n\n至于岳飞有没有能力赶走金人，杀了岳飞是不是有助于宋金谈判，岳飞是不是毫无二心的忠臣，根本就不是赵构考虑的重点。\n\n为了杀一个手拥重兵的武将领袖（无论是岳飞还是韩世忠），赵构早就谋划好几年了。\n\n而且执行的时候，各种因素都早考虑到了。\n\n现代人觉得岳飞是大忠臣，现代人以为公道自在人心，太天真了啊。\n\n赵构杀了岳飞之后，朝局稳定的很，朝中大臣固然也有上书的，可是也轻轻松松的被压了下去了。\n\n岳飞就这么死了，你们想象的举国上下群情激奋的场面不存在。\n\n是的，南宋王朝的都城临安，一切都很平静。\n\n在当时多数久经乱世考验的文官集团看来，杀岳飞，能震慑骄兵悍将，是可以接受的。\n\n所以，他们也就哼哼唧唧几声，大家也就继续该上班的上班，该工作的工作。\n\n是的，南宋王朝的都城临安，一切都很平静。\n\n这种平静，发生在历史上每一次君主杀功臣忠臣的时候。\n\n只要君主想杀了，布置好了，在任何时代都是一样，君主都是算准了料定了自己的权威足够承担所有的风险的。\n\n当然，发展到现代，就更牛逼了，斯大林干脆以肃反的名义，将整个政治局高层、红军高层全杀光了一遍，也是很平静的。\n\n君主杀忠臣，从来不是去菜市场买卖，不可能像现代人在这里议论的口沫横飞，情绪激昂的。\n\n整个朝堂，在冤杀岳飞这件事上，所有人都是共犯，都是同谋。\n\n杀死岳飞的，是南宋王朝的政治制度，是南宋朝堂上的每个大臣。\n\n所有的大臣们几乎都在配合赵构，他们保持着朝局稳定，他们目送着岳飞去死。\n\n所以，现代人以为是赵构杀了岳飞，那就是太可笑了。\n\n南宋王朝整个上层统治者需要岳飞的这一颗人头，来恢复以文制武的传统，来维持国家机器的稳定运转而已。\n\n至于这个人头，到底是来自于韩世忠，还是来自于岳飞，没区别啊。\n\n中国人读中国史，最大的毛病，就是分不清事情的重点，而喜欢探寻的是人事的斗争。\n\n中国人有一种低级幼稚，认为一切的政治斗争，都取决于私人之间的恩怨情仇。\n\n于是，你看到这个问答的下的各种神奇回答，都在回答什么呢？\n\n看了都得笑半天。\n\n要么是一拨人拼命证明岳飞的伟光正，要么是一拨人拼命证明的赵构的丧心病。\n\n有什么意义啊？\n\n杀岳飞，难道是赵构的个人私仇，那是南宋王朝这一台武装到牙齿国家机器，整个政治制度的固有缺陷，导致了岳飞必须死。\n\n在整个南宋王朝好不容易恢复起来的文官软件系统，需要杀一个程序员祭天。\n\n杀岳飞的真正凶手，是整个南宋王朝的政治制度，是全体文武百官的全力配合。\n\n甚至不客气的说，也是彼时南宋老百姓的内心期望，让他们在赵构岳飞两个人中选择一个必须死，多数人选的也是岳飞。\n\n你们今天叫嚣着宁可支持岳飞造反，也不支持赵构和议。\n\n那是因为你们生活在今天，而不是生活在一千年前。\n\n要是今天发生类似的情况，你们只会支持当权者赵构把岳飞杀了，只会考虑整个国家别再陷入下一波频繁的动荡中。\n\n比如那中东独裁者萨达姆，也是反美抗美一把好手啊，这个独裁者上台，清洗的忠臣还少了啊。\n\n可是，萨达姆不仅仅在国内得到支持，就是在中国，在今天，也有大量的粉丝。\n\n至于被萨达姆冤杀的成批的岳飞们，你们那里在意啊。你们歌颂的独裁者的铁腕，而独裁者的铁腕是需要忠臣岳飞们的血去浇灌的。\n\n你们宁可要的当权者赵构的独裁草，也不要造反者岳飞的革命苗。\n\n多数老百姓，即便看到几百万人饿死在自己身边，也不愿意现在好不容易已经稳定下来的现政权颠覆。\n\n因为一旦自己造反而或革命，得用自己的妻儿老小、整个家族去埋单。\n\n所以中国历史，多数饥荒搞到了饿死几百万几千万，道路上尸体相枕，人世间人人相食，可是只要有一个稳定的现政权，既不敢也不会造反。\n\n甚至在死之前，还要高喊皇帝万万岁，安慰自己在红太阳的照耀下，做鬼也幸福。\n\n我们的邻居北朝鲜的人民的生活，不就是最好的写照吗？\n\n这是中国人的儒家文化传统，宁愿屈臣，而不能辱君。无论这个君主品德多么不堪，无论这个臣下功劳多么巨大。\n\n即便到今天也是如此。\n\n大家扪心自问，我们讨论近现代史的时候，有没有类似铁腕之君逼死已经解除兵权的忠臣呢？\n\n我想例子就不用举了。\n\n可是我在网上，看到从来是每一个平平常常的老百姓正常维护的依旧是最高独裁者——君。\n\n至于对于臣的屈死，给予的不过是怜悯罢了，难道还为了一个臣而去辱君，反复吊打这个君主，将这个君主吊在历史的耻辱柱上吗？不可能啊。\n\n中国人啊，只有时间足够远了，没有国家意识形态给你洗脑，内心的朴素正义才会发作，才会支持岳飞，辱骂赵构。\n\n可是，要是今天你生活在南宋王朝治下，多数普通老百姓干的就是天天为赵构洗地，歌颂赵构是中兴王朝的明君，没有赵构这个太阳，人民就不可能有幸福生活。\n\n不客气说的，赵构算是有点良心君主，没有在杀岳飞之前，刻意羞辱岳飞。\n\n否则，以他的君主之威，在临安城随便找一个公开的菜市场，告诉老百姓——岳飞谋反，是个大奸臣——保证老百姓一拥而上，分岳飞之肉而食。\n\n比如当代的前苏联统治者斯大林就是这么干的，让人民去批斗忠臣，自己都不用出手。\n\n忠臣如果受辱，无比悲愤自杀了，还要被整个国家安上畏罪自杀之名。\n\n对于忠臣真正的羞辱，就是让忠臣死于他一生保护的老百姓的之手，崇祯帝就这么干过，袁崇焕就这么死了。\n\n总之，在儒家的君君臣臣的意识形态里头，必须要保证最高统治者获得说一不二、赏罚由心、杀戮在己的超级管理员的最高权限。\n\n任何一个儒家王朝如果不能随时随意随地的让岳飞这样曾经手握重兵的武官领袖解除兵权，不能随时随意随地诛杀这样一个具备高度威望的岳飞，这样的国家是不稳定的。\n\n在乱世之秋，南宋王朝更需要的是一个铁腕的君主，以恢复整个政治社会制度秩序。\n\n所以，南宋王朝整个政治制度改革的方向，必然是加强中央集权，而不是去让岳飞这些名将调配国家资源更加顺畅，而不是让这些将领的军权更大。\n\n只有这个南宋王朝存在的一天，岳飞的忠，岳飞的死，才有意义。\n\n岳飞一生的价值，说白了，就是维持赵家的江山社稷，儒家忠的要求，就是岳飞不能反抗，乖乖受死。\n\n哪怕岳飞在临死之前，稍微做点反抗，都会被后世儒家士大夫们羞辱。\n\n你没看错，你看韩信被解除兵权之后，经常说怪话，不给刘邦脸，结果被吕后杀了之后，可没有多少儒家士大夫支持韩信，而是写各种文章证明韩信心怀怨望，就该杀。\n\n所以，你们越觉得岳飞忠，其实岳飞就越可怜。至少比韩信可怜太多了。\n\n韩信作为一代名将，临死之前，在未央宫，依旧保持了他的骄傲。\n\n岳飞呢？死的软绵绵，据说只留下四个字——天日昭昭。\n\n所以，说，岳飞也是被这一整套儒家君臣纲常名分所道德绑架了。然而，用自己的鲜血，去成全了维护了这一套儒家君臣纲常。\n\n话说回头。大家都挺痛恨赵构。\n\n然后把赵构所有的缺陷翻出来反复说，比如被惊吓的不能生育，比如性虐待狂啊，诸如此类的。\n\n但是，赵构也有一个优点。那就是不爱惜自己的名声。\n\n所以，他退位为太上皇之后，继任的养子宋孝宗打算伐金，请示批准给岳飞平反。\n\n赵构立刻准了。\n\n这点是真的挺难得的。\n\n不客气说，就是现在一个小县城搞出一个冤杀案，要翻案都难于上青天啊，因为再小的官老爷也要脸啊。\n\n唯独赵构不要脸，收兵权冤杀岳飞，消费了岳飞一次。\n\n然后儿子伐金，需要鼓舞人心，又给岳飞平反，再消费一次。\n\n中国历史上，这样的君主还挺少的，岳飞的家人也一一得保平安了。岳飞的子孙后代也就繁衍至于今了。\n\n要是朱元璋杀忠臣，别说平反了，那就是斩草除根了，一个不留了。动辄牵连了几万人。\n\n赵构相比较而言，真不算变态了。\n\n其实，以赵构的智商，真要把岳飞之死弄成历史学家永不可翻的铁案，在古代还真挺容易的。\n\n识字的写书的，其实就那么一大批士大夫。\n\n只要赵构愿意，他可以干两件事，一是禁书，这件事情赵构干了，干的不够彻底。毕竟搞文字狱也挺累的。\n\n第二是让史官文人捏造一大堆岳飞的黑材料，从皇家起居注开始，再到各个部门的档案，全部涂改一边，这到今天还是管用，拿下政坛大佬，然后消除其著作，这叫清洗政治余毒。\n\n可是，我们今天，还是能读到关于岳飞被冤杀事件的各种真实细节。\n\n这就证明，赵构根本不大在乎自己会落得个千古骂名，没有把这些黑岳飞的活儿做的特别细致。\n\n一旦细致了，岳飞还真的是我们现在历史学家挖掘出来的伟光正形象就不好说了。\n\n就是岳飞生平的任何小事，都是可以抹黑的，而且还要在史官文人的加工构陷之下，黑的发亮。\n\n最后，随手点评一下赵构吧。\n\n说赵构对岳飞没感情，那也是不可能的，岳飞这个年轻将领，可是他发现的，一手提拔上来，而且岳飞的升迁速度简直是闪电一般。\n\n就论赵构最初选的祭天对象，可是韩世忠，而不是岳飞。赵构还是对岳飞有点基情的。\n\n他最大的遗憾的是，岳飞并不配合，消耗了这最后的基情，赵构发现使唤不动岳飞，岳飞不愿意脏了自己的手，做他手中的刀，那他就只能毁掉岳飞这把刀了。\n\n你们固然可以说，岳飞战功赫赫，所以给他加官进爵理所当然。\n\n可是赵构一个皇帝，是能决定臣下的升迁速度的，整个南宋王朝，什么都缺，就不缺想当官的啊。\n\n所谓的中兴四将，大家去仔细翻翻书，这些抗金的中流砥柱，那一个不是赵构培养出来的。南宋王朝一百多年的天下，真不是充话费送的。\n\n你们把抗金战场的一切功劳，都归功于中兴四将，归功于岳飞不合适。\n\n要是没有赵构在后方，天天拉着一群文臣拼命干活，各种横征暴敛，保障了岳飞所有前线将领的粮草供应，你们以为岳飞在襄樊能支持几天啊。\n\n抗金，不是岳飞一个人在抗金，岳飞一个人能干啥啊，没有皇帝的鼎力支持，没有文官系统的全力配合，岳飞就是一个普通人。\n\n看看，赵构只要解除了岳飞的兵权，岳飞能干啥？难道他一个人没有整个系统的支持，也能抗金了。\n\n就是今天，任何一个打工仔之所以成功，取决于他入职的公司平台，而不是他自身的能力。再牛逼的人，让你去经营一个小卖部，你还能变了天，挑战马云的淘宝了吗？\n\n别忘记了，岳飞今天之所以得到我们歌颂，是因为赵构这个老板给他提供了一个非常好的平台。\n\n让岳飞加入当时宋人其他任何一股抗金势力，岳飞就能逆天了，得了吧。\n\n顶到了天，岳飞也就是混成了诸如曹成、杨幺这样的军事割据势力，然后不是被金人金兀术、就是韩世忠这样的国家军队给平定了。\n\n投奔赵构，扶持赵宋江山社稷，固然是岳飞的满腔爱国抗金的热血，可是他这满腔爱国忠心要是洒在农民军组织里头，洒在其他抗金的地方军阀之中，那可真算不上什么好选择啊。\n\n赵构这样的君主，已经岳飞所能得到的最好选择。\n\n就像刘禅这样的君主，也已经是诸葛亮所能得到的最好选择。\n\n所以，这南宋半壁江山，赵构还真的有点资格说一句——自我得之，自我失之。\n\n赵构虽然有种种的不是，但是在发现军事天才上，在团结南渡的文武百官上，在建立汉人最后一个政权，保存了汉文化，也是有大功。\n\n没有岳飞，最坏，也不过是北伐不成功。\n\n没有赵构，得，整个天下就真的野蛮落后的女真人说了算了。\n\n赵构这个君主，其实完全算不是刷新了中国古代君主的道德下限。\n\n真正刷下限的南北朝的后赵政权北齐政权，什么石虎、高洋，才真的叫禽兽啊。\n\n至于赵构，是因为大家作为汉人对他期望值太高，希望他能够北伐中原，还我山河、复我衣冠。\n\n其实，中国历史，自秦而后，能够在国亡之后，维持半壁江山的，也只有东晋司马睿，南宋赵构。\n\n近人蒋介石也算抗日成功，英明神武了吧，一旦三大战役失败，也就只能去台湾当岛主了。\n\n其他一旦国都沦陷，那简直是江河日下，就说那所谓天子守国门的大明王朝，一旦崇祯帝死了，剩下的子孙一个比一个没出息呢？\n\n就是今天，挽救一个半破产的公司，都不容易啊。\n\n更不用说，还能绝地反击，偏安一百多年，直到横扫世界的蒙古骑兵出现了，南宋王朝才灭亡了。\n\n所以，你们只看到赵构的屈膝投降议和，可是不客气的说，南明弘光政权，连和满清议和的资格都没有。\n\n因为南明弘光政权在朱由崧的主政之下，连谈判的筹码都没有，拉起来的军队，被满人一击即溃了。\n\n议和，想给女真人称臣，也是要能打战才行啊，要守得住，要让金人打不过来才行。\n\n不然，女真人还真的吃素了，留着南宋王朝过年了啊。\n\n朱由崧这种君主，才真是误国，才真正是让社稷臣民彻底绝望的君主。\n\n你们会那么恶毒的辱骂朱由崧吗？我可没看到。\n\n你们还充满了对朱由崧可笑的同情之理解呢！！！\n\n还要讴歌朱由崧坚持到最后一刻！！！\n\n可是朱由崧那种坚持，有一毛钱意义啊。\n\n就不说现代人，就是让朱元璋去选，他希望自己的子孙是坚持到最后一刻亡国的朱由崧，还是议和称臣成功的赵构啊。\n\n从情感上，辱骂一下赵构，没问题。\n\n但是理性去阅读历史，评断功过是非，就别投入太多感性情绪了。\n\n要是赵构是你们那种充满感性、绝不辜负忠臣的君主，满怀基情不杀岳飞，最终南宋各路军镇做大了，再出现一个刘裕取而代之了，如果是这样的下场，难道赵构这个君主就当得合格了。\n\n你们翻到这样的历史记载，还能给赵构点赞了。\n\n只怕多数心里都会马后炮说一句——\n\n赵构真是脑残啊，当初要应该收回兵权，杀一两个武将领袖，震慑骄兵悍将，防患于未然。\n\n读历史，开上帝视角，发射这种马后炮，没劲啊。\n\n所以，别总是随时在网上，发表这些无厘头的观点了，我看着答案区，都快成了系列了——\n\n我比赵构更聪明。\n\n![_________.png (600x787)](data/img/post_6__________.png)​​​​​​​"
		},
		{
			"post_id": 5,
			"title": "如何看待中国是第一大美元储备国？",
			"date_published": 1519912976.714,
			"body": "如何看待中国是第一大美元储备国？\n\n如果中国不储备美元，人民币就会大大降低自身的价值。\n\n很多人总是宣称中国政府只要抛售了美元储备，美国经济就会垮台。\n\n真这么做了，美国经济会不会垮台，我不知道，但是中国人民币肯定大大贬值，中国经济立马崩溃。\n\n我们的人民币信用，很大程度是靠世界上最强大的国家美国在透支他们的国家信用为我们的中国经济背书。\n\n事实上，如果有一天中美成为敌人的话，中国想储备美元，对不起，没门。\n\n记住了，不是每个国家都有资格大笔大笔每个月一百多个亿的买进美元美债。\n\n真以为有钱了，你想买什么就买什么啊。\n\n多数被美国视为死敌的国家，比如古巴、委内瑞纳，美国政府可不会用他们的国家货币去为这些国家的经济背书。\n\n所以，自求多福。\n\n太自恋了，真以为自己不可或缺了，往往会死的很难看。\n\n这世界，多数国家如果没有足够的美元储备，其国家机器都会垮台的危险。\n\n这些国家的国家机器之所以处于随时被颠覆的状态，从来不是美国造成的，而是这些国家的国家机器从根本上而言就是无比的腐朽反动，早该从尘世上消失了。\n\n截止今天，美国并不打算弄垮中国。\n\n如果美国政府真心想这么干的话，我们国家流通的美元慢慢会消失。\n\n太长久的历史，我不预测。\n\n但是如果是最近十年，如果你有一天发现，你很难买到美元，那么正常中国经济必然开始走下坡了。中国经济必然无可挽回的全面崩溃了。\n\n欢迎来到没有美元的新世界，在这个世界，中国人会发现自己原来一无所有。\n\n![______.jpg (1080x1268)](data/img/post_5_______.jpg)​​​​​​​"
		},
		{
			"post_id": 4,
			"title": "为什么只有红楼梦才配称红学？",
			"date_published": 1519890001.907,
			"body": "为什么只有红楼梦才配称为“红学”\n\n读书不多，但是红楼梦不能不看。如果不看，我就不是中国人了。\n这是一条基本论断。\n\n一本民族有一个民族的个性，看看他们自己认为的文学经典，就知道了。《好兵帅克》讲出的是捷克民族在周边各大强权生活下的一种无奈、尴尬，只有不断的自我调侃。而看《源氏物语》，就知道日本人的审美是微型化、阴柔有力的。至于中国人拿出来的，就一本《红楼梦》。\n《红楼梦》里面的中国人的面孔是怎么样的，充满人间的欲望，有各种各样的感情。但是，这些感情，最后，都要服从贾府当权人物的“政治”需要，他们的一句话，可以毁掉木石前盟，可是让元春入宫，可以让探春远嫁，一切的一切，都服从政治需要。\n这就是《红楼梦》描绘出来的中国人的形象，也是为什么毛泽东对《红楼梦》情有独钟的最深层隐秘。\n——中国人，太喜欢政治。\n——中国人没有个人生活。\n——中国人的日常生活就是政治生活。\n以上三条，就是红学之所以成为红学的原因。\n\n所以，我一直不喜欢红楼梦，虽然我也写小说，知道红楼梦是好小说，却对红楼梦没有什么好感。\n《红楼梦》完全极端政治化的人物群像，说白了，就是中国人的民族性——非常丑陋的嘴脸。没有家庭，没有个人隐私，任何一句闺房秘语都可以高度政治化。就连袭人这样呆蠢的笨姑娘都知道不是“东风压倒西风”就是“西风压倒东风”，而去探听“风要往那方面吹”。\n（不要以为民主到了中国就好了，去看看台湾人搞的民主，中国人的政治嘴脸就是这样的，人的品质在那里摆着呢，没治）\n中国到目前位置，因为作品也成为“学”的，大约只有两本，一本是《论语》的“孔学”，一本是《红楼梦》的“红学”。\n也就是说，１８４０之前，一个真正中国人最起码要接收的文化教育是“孔学”（《论语》也是很操蛋的一本书，作者是个老师，教的本该是知识，一翻开，一半的篇幅在谈政治，基本上缺乏操作性，纯属高度意淫，这样的书居然被钦定为官方教科书，号称是“半部论语治天下”，靠），２００５之前，是“红学”。毛泽东也算是呼风唤雨，可是他的文字顶多称之为毛泽东思想”而不配称之为“毛学”\n那么，如果按照我以上标准，大家就明白了，为什么金庸的小说地位在这几年冉冉上升了，对，就是呼之欲出的两个字“金学”。\n金庸的小说在中国的流行，在低幼的学生里头流行，在教授学者里头流行。哦，你是不是一直不明白，为什么古龙、温瑞安、黄易都写武侠，只有金庸被称之为“金学”。难道是金庸的文学水平高。当然不是了，就象四大名著里头只有“红楼梦”配称“红学”，你听说过“水学”“三学”“西学”没有。\n为什么呢，金庸小说里面的人物，每一个都是高度政治化的，郭靖这种呆瓜什么都笨，但是为了“民族大义”，什么都可以牺牲。岳不群为了当武林盟主，连自己的鸟蛋都不要，江湖江湖，什么是江湖，说白了，政治政治政治啊。\n你可以试着把上文描述红楼梦的三条原因放到金庸的小说里头，就明白，金庸的小说，为什么金庸的小说那么受欢迎，受各个年龄各个阶层中国人的欢迎。\n是的。　　\n——中国人，太喜欢政治。\n——中国人没有个人生活。\n——中国人的日常生活就是政治生活。\n金学”开始进入课本了。　\n如果不出意外的话，再过个一百年，继“孔学”“红学”之后，代表我们中国人文化的典籍里头，还要加上金庸的“金学”。\n然后，走出国门，发扬光大。\n有什么办法呢，我们就是喜欢自暴其丑，就是想着求着要洋鬼子们从这些书里头看到我们这样的嘴脸。"
		},
		{
			"post_id": 3,
			"title": "链接标准使用方式",
			"date_published": 1519876395.787,
			"body": "[Markdown 语法说明](http://wowubuntu.com/markdown/)"
		},
		{
			"post_id": 2,
			"title": "为什么我一直用理智思考，还是会被宗教的上帝神灵的概念所迷惑？",
			"date_published": 1519832322.609,
			"body": "\n\n\n\n \n你想不通就对了。\n\n只要是人类，肯定想不通上帝这个问题的。\n上帝之所以被制造出来，就是为了终结人类所有的疑问的。\n\n上帝准确的定义就是人类所有未知领域的总和。\n这也是为什么基督教徒可以轻松把你打趴下的真正原因？\n\n想想看人类即便发展了几千年了文明，可是已知的领域仅仅就地球而言勉强算个专家了。\n而地球在整个宇宙是什么位置啊。\n仅仅一个太阳的体积是地球的130万倍。\n而宇宙有几万亿颗恒星。\n人类目前所能观测到最远的星系是130万年前。\n\n如此庞大的未知领域，以地球人类有限的智商，以地球文明注定有限的寿命（大约100亿年），是无法解决的。\n\n所以，基督徒并不是真正意义上胜了你，事实上他们再怎么相信上帝，对于以上未知领域也和你一样。\n只不过他们站队了，站在未知领域的那一边。\n而可悲的你，选择了已知领域罢了。\n\n不过，安慰一下题主吧。\n人类文明发展肯定不靠基督徒的，靠的是不断鼓起勇气，向注定无法战胜的未知领域一二再发起冲锋号角的我们。\n\n基督徒所创造出来的那个包涵一切覆盖一切的上帝从来不是解决未知领域之道，而是懦夫的行为罢了。\n\n所以，别把时间浪费在和基督教徒辩驳上。\n努力学习，尽可能减少人类的未知领域。\n如果你的聪明才智达不到这个高度，也不用自卑。\n娶个妹子，生个娃，让你的子子孙孙继续努力吧。\n\n最后，其实这个答案适用和佛教徒、伊斯兰教教徒的争辩之上。\n任何站队到未知领域的各种稀奇古怪的教派之上，其教义之设计必不出于此范畴。\n"
		},
		{
			"post_id": 1,
			"title": "一则历史笔记——论商鞅",
			"date_published": 1433033779.604,
			"body": "所谓的改革，所谓的变法。\n历史上最成功的莫过于商鞅。\n可是他改革变法成功的同时，取消其他贵族特权的同时，自身也变成了秦国最大的地主，拥有一个无比巨大的商邑。\n一旦政治家推行的改革变法，自身成为最大的受益者，那么，只会加剧上层内斗，其悲惨的命运是可以预见。\n商鞅至今为历史教科书所歌颂，当然也是正确的。\n在家国一体的宏大叙事中，一切过往的细节被忽略了。\n普通人记不住，历史学家却留心。\n今天，我并不是来做这个翻案文章，也不需要做。\n商鞅之为人，倒是在《商君书》一书上直言无隐了。\n在他身前，他也明了他必将死无葬身之地。\n所以，留下这本奇书，交代了未来两千年。\n这两千年中国史，说是外儒内法，明摆着孔孟当挡箭牌，行的到底是商鞅之法术。\n中国历代权谋之书，在《商君书》面前，皆不过小巫而已。\n岁月如流，百代易过。\n此树非新树，日下无新事。\n所以，鉴往知来，相忘江湖，各自惜福，罢了罢了。"
		}
	]
}