{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "The world is falling, we need to burning the world!",
			"body": "http://127.0.0.1:43110/1Mg82NHKBLzgnzp199NT1Mh8rUdXw2ij1h/?Topic:2_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L/",
			"added": 1517380206
		},
		{
			"topic_id": 2,
			"title": "Zerotalk will delete your topic and forbiden your post",
			"body": "so, they are afraid of something, they are feared, too.\n\nA person named\" Conred\" post a comment, after that I could not post on Zerotalk!\n\nconred ━ 26 minutes ago ^2\n^3 \n\nReply ⋮ \n\ncoolplay: Because world is falling... why we lost our spirits of conquer the world, why we could not believe with each other. Because some people are disturbing/faking us in the shadow. [...]\n\nYou're an insane person. Please stop commenting here\n\nIt's great! the censor is everywhere. People are forbidened to talk the truth.\n\nThey Delete a Topic named\" why I want to live out of Grid\".\n",
			"added": 1518541361
		},
		{
			"topic_id": 3,
			"title": "Big Size Clone of this Site",
			"body": "http://127.0.0.1:43110/1NLFg344SMHsMMNZayCYcTvY4RStC7ELWX/",
			"added": 1519834787
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/1f2kyCYnn8MiY7GBjPS5sGZ8NcRreqNST/",
				"added": 1517571836
			},
			{
				"comment_id": 2,
				"body": "The Sure\n\nTo My Surer:\n\nThe world is falling, we need to burning the world, to be sure.\n\n不要相信电视上的东西，都是假的。加入然教，只要身体力行下面六条就能保你健康！加入然教，清除这世上所有的病痛！加入然教，焚烧这世上所有的罪恶！\n\n然教弟子： To My Surer:\n\n1.燃尽天下一切罪恶。 1. Burning the world, To Be Sure.\n\n2.不吃药，不去医院看病治疗。 2. Do not eat medicine, Do not go to hospital, Do not take any test.\n\n3.与同袍见面时不带任何电子设备。 3. When you meet your brother of Sure, Do not take any electronic set.\n\n4.不吃少数人才吃得到的东西。 4. Do not eat any things only few people could get.\n\n5.不要相信教外人士，相信你的导师。5. Do not trust any body not of Sure, Trust Your Master.\n\n6.不得陷害同袍，否则千刀万剐。 6. Do not fake your brother of Sure, otherwise Cut you into parts.",
				"added": 1517869904
			},
			{
				"comment_id": 3,
				"body": "The Chinese government is persecuting his people, in order to transform the domestic economic contradictions, they do not hesitate to poison their people, man-made avian influenza, pneumonia, pulmonary fibrosis, depression all kinds of diseases, in order to let the people into the hospital spend money, do a variety of checks and false treatment, thereby artificially manufacturing consumption, reduce the government economic pressure. The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines. At the same time monitor and monitor their own people, to combat all kinds of people with different ideas. Not waging war, torturing their own people, persecuted their own people, can no longer deceive, unarmed civilians, this approach is more brutal than the Kuomintang 1938.\n\nThis government will be overthrown by foreign governments, China will perish, the people will win.",
				"added": 1517869919
			}
		],
		"2_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 4,
				"body": "the deepfake",
				"added": 1518542612
			},
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_15_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): You can run your own copy of ZeroTalk, at least. And no one can stop you from talking to people there.\n\nI only know how to create a clone of Zeroblog, creating a forum, it is hard to me.",
				"added": 1518543278
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 6,
				"body": "http://127.0.0.1:43110/1NLFg344SMHsMMNZayCYcTvY4RStC7ELWX/",
				"added": 1519834377
			}
		],
		"3_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 7,
				"body": "increase the size of font.",
				"added": 1519834831
			},
			{
				"comment_id": 8,
				"body": "> [jzt](#comment_22_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): Зачем?\n\nпривлечь больше людей Для обсуждения",
				"added": 1520059798
			}
		]
	},
	"comment_vote": {}
}