{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Como a Amazon, a Apple, o Facebook e a Google manipulam nossas emoções",
			"body": "A capitalização de mercado da Amazon, Apple, Facebook e Google juntas agora é equivalente ao PIB da Índia. Como essas quatro empresas se infiltraram completamente em nossas vidas? Em um discurso espetacular, Scott Galloway compartilha informações e estatísticas surpreendentes sobre os domínios e motivações dessas empresas; e o que acontece quando uma sociedade preza o valor do acionista acima de tudo. Seguido de perguntas e respostas com o curador do TED, Chris Anderson. (Nota: Esta palestra contém linguagem adulta.)\n\n- https://download.ted.com/talks/ScottGalloway_2017S-480p-pt-br.mp4",
			"added": 1527194172
		},
		{
			"topic_id": 2,
			"title": "Física",
			"body": "Física é a ciência que estuda a natureza e seus fenômenos em seus aspectos mais gerais. Analisa suas relações e propriedades, além de descrever e explicar a maior parte de suas consequências. Busca a compreensão científica dos comportamentos naturais e gerais do mundo em nosso torno, desde as partículas elementares até o universo como um todo.",
			"added": 1527197350
		},
		{
			"topic_id": 3,
			"title": "Ferramentas Digitais para o Ativismo",
			"body": "#Ferramentas Digitais para o Ativismo\n\n- https://github.com/drewrwilson/toolsforactivism",
			"added": 1527198964
		},
		{
			"topic_id": 4,
			"title": "Inteligência artificial",
			"body": "Inteligência artificial é a inteligência similar à humana exibida por mecanismos ou software. Também é um campo de estudo acadêmico. Os principais pesquisadores e livros didáticos definem o campo como \"o estudo e projeto de agentes inteligentes\", onde um agente inteligente é um sistema que percebe seu ambiente e toma atitudes que maximizam suas chances de sucesso.",
			"added": 1527199070
		},
		{
			"topic_id": 5,
			"title": "ACERVO FILMES",
			"body": "#POSTE AQUI VÁRIOS FILMES!!!",
			"added": 1527200471
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1,
		"3_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"10_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"11_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1
	},
	"next_comment_id": 10,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "Um curso de pós-graduação em criptografia aplicada\n\n- https://web.archive.org/web/20180203150346/https://crypto.stanford.edu/~dabo/cryptobook/BonehShoup_0_4.pdf",
				"added": 1527193688
			},
			{
				"comment_id": 7,
				"body": "#MATERIAL CRIPTOGRAFIA\n\n- https://github.com/sobolevn/awesome-cryptography",
				"added": 1527198474
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 2,
				"body": "Surgimento e Breve Perspectiva Histórica do Anarquismo\n- https://web.archive.org/web/20180524202148/https://ithanarquista.files.wordpress.com/2013/01/felipe-corrc3aaa-surgimento-e-breve-perspectiva-histc3b3rica-do-anarquismo.pdf",
				"added": 1527193774
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#Entrelaçamento quântico\n\nO entrelaçamento quântico é um fenômeno da mecânica quântica que permite que dois ou mais objetos estejam de alguma forma tão ligados que um objeto não possa ser corretamente descrito sem que a sua contra-parte seja mencionada - mesmo que os objetos possam estar espacialmente separados por milhões de anos-luz. Isso leva a correlações muito fortes entre as propriedades físicas observáveis das diversas partículas subatômicas.\n\n- https://en.wikipedia.org/wiki/Quantum_entanglement\n- https://arxiv.org/abs/0811.2803\n- https://arxiv.org/abs/quant-ph/0702225\n- https://arxiv.org/abs/quant-ph/0504163\n- https://arxiv.org/abs/1108.3309\n- https://arxiv.org/abs/quant-ph/0102094",
				"added": 1527197471
			},
			{
				"comment_id": 4,
				"body": "#Mais rápido que a luz\n\nMais rápido que a luz, também chamado superlumínica (em inglês: faster-than-light, FTL), refere-se à propagação de informação ou matéria mais rapidamente do que a velocidade da luz, seja em comunicações ou viagens. Este conceito é fundamental para a ficção científica, e é também assunto de estudos científicos ora em andamento. Todavia, com base no conhecimento presente, não se sabe ainda se será possível ir-se mais rápido do que a velocidade da luz, posto que isto violaria os princípios da relatividade restrita.\n\n- https://en.wikipedia.org/wiki/Faster-than-light",
				"added": 1527197816
			},
			{
				"comment_id": 5,
				"body": "#Táquion\n\nTáquion é uma partícula hipotética cuja velocidade excede a velocidade da luz (v > c).\n\n- https://en.wikipedia.org/wiki/Tachyon",
				"added": 1527197964
			},
			{
				"comment_id": 6,
				"body": "#Gato de Schrödinger\n\nO Gato de Schrödinger é uma experiência mental, frequentemente descrita como um paradoxo, desenvolvida pelo físico austríaco Erwin Schrödinger, em 1935. A experiência procura ilustrar quão estranha é a interpretação de Copenhague da mecânica quântica, imaginando-a aplicada a objetos do dia-a-dia. No exemplo, há um gato encerrado em uma caixa, de forma a não estar apenas vivo ou apenas morto, mas sim \"morto-vivo\".\n\n- https://en.wikipedia.org/wiki/Schr%C3%B6dinger%27s_cat\n- https://web.archive.org/web/20180524214314/https://jrfriedman.people.amherst.edu/Leggett%20Physics%20World%20article/PW%20article.pdf",
				"added": 1527198291
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 8,
				"body": "#Inteligência Artificial\n- https://www.youtube.com/playlist?list=PL4OAe-tL47sY1OgDs7__GJW8xBpPEeNfC",
				"added": 1527199094
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#O Preço do Amanhã\n\nEm um futuro próximo, o envelhecimento passou a ser controlado para evitar a superpopulação, tornando o tempo a principal moeda de troca para sobreviver e também obter luxos. Assim, os ricos vivem mais que os pobres, que precisam negociar sua existência, normalmente limitada aos 25 anos de vida. Quando Will Salas (Justin Timberlake) recebe uma misteriosa doação, passa a ser perseguido pelos guardiões do tempo por um crime que não cometeu, mas ele sequestra Sylvia (Amanda Seyfried), filha de um magnata, e do novo relacionamento entre vítima e algoz surge uma poderosa arma com o sistema e organização que comanda o futuro das pessoas.\n\n- http://thevid.net/v/znz1a3k2mca3p3b2a/",
				"added": 1527200594
			}
		]
	},
	"comment_vote": {
		"3_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"6_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"7_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"8_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"9_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	}
}