{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"4_152kdpXWPevMLNm7755GKuzQPsu71bs13t": [
			{
				"comment_id": 1,
				"body": "Lol tu sais faire des test par toit même ou tu te contente de ce qui est dit ?\nOUI on peut tout à fait télécharger de la musique via clipconverter (que j'utilises entre autre). Ce qu'il ne peut pas télécharger c'est le contenu VEVO ou officiel, ou celui qui est explicitement marqué comme contenu sous licence.\nPourquoi ce blocage ? Car sinon clipconverter devient illégale et ferme.\nD'ailleurs aucun site qui télécharge des contenus web outrepasse cette règle pour la même raison...\nAprès ya des programmes qui le font comme l'a dit d67 et pas seulement sous votre windaube moisit. Et tu as même des extensions pour navigateur !\nInternet est ton amis à présent pour tes recherches :)\nEnjoy et no rage avant testage ;)",
				"added": 1483624066
			}
		],
		"1_1MsusYgQEGRNQvae378thswXF28AWLFF7Y": [
			{
				"comment_id": 2,
				"body": "Sachez une chose : on ne peut RIEN supprimer d'internet. Ah il bloque un site pour le censurer ? Go changer tes DNS... Ils font tomber le site via l'hébergeur de ce dernier ? Go trouver un nouvel hébergeur... Et au pire go TOR :)\n\nEt oui @greatsick des sites djiadistes yen a (peut) sur le DW et plus encore sur Freenet ;)\n\nMais osef de toute façon : si on les matte pas ils existent pas :D",
				"added": 1483624414
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 3,
				"body": "MDR c'est ouf ici aussi le troll attrape en gros :D Miam miam miam ça m'a donner fin tout ça go me manger un juif (cuit au four of course) :p",
				"added": 1483624478
			}
		],
		"1_1F2yDqB1hQTXx9jxPu6s39qvcN7aJecEQk": [
			{
				"comment_id": 4,
				"body": "Euh... j'arrive pas à distinguer si c'est du troll ou de la connerie profonde....",
				"added": 1483624536
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 5,
				"body": "http://pleer.net/\n\nÇa (re)fonctionne et stop le drama chaque fois qu'un site se fait donne SVP c'est pathétique ! On ne peut RIEN supprimer d'internet.",
				"added": 1483624604
			},
			{
				"comment_id": 12,
				"body": "> [zerofreedom](#comment_7_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv): Qu'est-ce qu'il faut pas entendre....Bien sur que si on peut supprimer des choses d'internet.D'ailleurs chaque seconde plein de contenu est supprimé,censuré,perdu...\n\nMDR genre ? Parce que la mode est plus au \"tout sauvegarder\" que tout supprimer... Censurer ne veut pas dire supprimer ni même inaccessible, changes tes DNS ou passe par tor et ose me dire qu'on peut te censurer un site... De toute façon même si un site est down => on change l'hébergeur et c'est repartis (regarde zone-telechargement, wawa & co !)",
				"added": 1484046579
			},
			{
				"comment_id": 17,
				"body": "> [zerofreedom](#comment_9_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv): La mode de sauvegarder c'est  peut-être 0,1% des utilisateurs, et peut-être 5% des hébergeurs de sites.Par exemple quand tu regardes une vidéo youtube qui peut sensiblement être censuré/retiré/supprimé pour x raisons, très peu vont penser à la sauvegarder chez soi au cas où. Les uploaders sur youtube ne pense  pas toujours (et ce sont des imbéciles, mais il y en a beaucoup) à garder une copie chez eux après avoir mis leur vidéo sur youtube.Mais youtube n'est qu'un exemple: tout les forums qui ont des modérateurs ont des millions de posts supprimés.Par rapport à la censure avec les DNS je ne parlais pas de cette technique, mais plutôt de la police qui débarque chez l'hébergeur du contenu. Dans ce cas là tes backups t'a intérêt à pas les avoir chez toi mais dans une grotte inconnue de tous et même d'avoir oublié où tu les as planqué en espérant qu'un gars cool les trouvent par hasard parce qu'ils te feront cracher le morceau d'une façon ou d'une autre si l'affaire est sérieuse.\n\n\nCertes mais la plus part des hébergeur (pas 5% mais plus 95%) sauvegarde de manière journalière leur site (via cron) donc si down ya juste à re-upload ailleurs ;)\nAprès le contenu vraiment douteux faut pas le foutre sur le CW aussi :p\nConcernant les forum oui là ya de la \"censure\" possible mais si le message en vaut vraiment la chandelle tu le publies pas que sur un forum...\nEnfin pour youtube, bien souvent la vidéo est soit démonétisées et/ou rendu privée, que très rarement supprimmé. Et puis ya pas que les uploaders, ya aussi tout les mecs qui télécharge et re-upload ailleurs !\nEn vrai oui on peut supprimer certains contenu spécifiques et useless, mais un truc qui DOIT rester en ligne le reste ;)",
				"added": 1484129911
			}
		],
		"3_1F2yDqB1hQTXx9jxPu6s39qvcN7aJecEQk": [
			{
				"comment_id": 6,
				"body": "Lol mais le ZeroNet français est fourré aux cons c'est pas possible OMG !",
				"added": 1483624722
			}
		],
		"5_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 7,
				"body": "MDR mais vous êtes vraiment teuber à se point ?\nLa plus part des migrans viennent pour fuir leur pays en guerre à cause (entre autre) de la france. De plus je te signales que la majorité veulent même pas rester en France dans ce pays de con mais cherchent à rejoindre l'angleterre mais sont stoppés aux frontières vers callais et donc s'entasse en attendant de pouvoir passé...\n\nAvant d'ouvrir vos gueules vous voulez pas vous renseigner ? J'ai dit renseigné pas vidé le cerveau par ces FDP de TF1/BFM qui vendent du migrants parasite pour se payer une belle montée d’audience histoire de caler plus de pub de fils de pute d'entreprise qui à grand coup de lobbying derrière iront murmurer à l'oreille d'un gouvernement que la guerre c'est bien pour relancer une économie...",
				"added": 1483625265
			},
			{
				"comment_id": 10,
				"body": "> [planespherev3](#comment_3_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Je savais pas que l'Erythrée, le Soudan, la Somalie, l'Afghanistant étaient en guerre.\n\n\nNon en revanche il est certain que c'est le bonheur de vivre là-bas n'est-ce pas petit blanc privilégier qui a toujours connu son petit confort ???\nViens me dire qu'à leur place tu ferais pas la même ! Très facile de juger quant on a aucun risque à connaître cet enfer...\n\n\n> De plus concernant la Syrie, la guerre est terminée, mais devine quoi: il y aura toujours autant de migrants en 2017.\n\n\nOui bien-sure la guerre est finit... Et la marmotte elle met le chocolat dans le papier d'allu ;) C'est bien continue de mater BFM pour être au courant...\n\n\n> Concernant Calais c'est faux: il y avait au plus haut environ 10000 migrants à Calais. En revanche il y a en France chaque année environ 340000 migrants.\n\n\nEt ? Parceque les 34000 peuvent pas aller à calais les 24000 restant sont là pour profiter ? Et quand bien même, encore une fois qui ne ferait pas pareil ? Qui resterait dans son pays cahotique (merci à la colonisation et au pillage qui en découle mais le mal est fait) au lieu de tenter sa chance ailleurs qui ? Et tu penses que c'est une partie de plaisir de quitter sa terre natale, ses amis, une partie de sa famille tout ça pour pas crever comme les autres ?\n\n\n\n> Ne pas regarder la télé c'est bien, être un minimum précis c'est encore mieux.\n\n\nEt en faisant des amalgames en quoi tu est précis ? C'est pas donner des chiffres pseudo-exacte qui font de toi un mec qui comprend comment le monde fonctionne, on peut faire dire ce qu'on veut à des chiffres...\n\n> Aussi tu ne peux pas considérer éternellement que c'est de la faute des français caucasiens (j'ai cru comprendre que t'était maghrébin), s'il y a la guerre dans ces pays. Vous êtes plusieurs millions de maghrébins en françe  non? Qu'est ce que vous attendez pour foutre le gouvernement français en l'air et le changer par un gouvernement qui ne ferait pas de guerre?\n\n\nMDR alors laisses-moi te dire que tu te trompe mais complètement. Je suis tout ce qu'il y a de plus français, fils de français petit fils de français et alors ? Contrairement à toi en revanche je coutoies sûrement plus la population magrhébine et pour d'autre raison que vivre en IDF... Moi je discute avec eux, migrants ou pas, intégré ou non, et je vois les discours qu'ils tiennent et leur quotidien... Toi à par ce que BFM te montre d'eux et ce que tu entrevois à travers tes volets clos que sais-tu d'eux ? Rien du tout, tu juges car c'est si facile de juger sans savoir : on se sent moins con ;)\n\nAlors pense ce que tu veux, perso osef moi je sais penser par moi même et constater une réalité que tu crois percevoir via tes filtres que tu t'es imposés ;)\n\n> [marc](#comment_2_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): Fuir la guerre en laissant femmes et enfants au pays ? (75% des clandestins sont des hommes), quand on fuis la guerre on amène femme et enfants !Rien quand recevant l'allocation d'asile 11 euros/jour, certains clandestins gagnent plus en 1 jour, qu'en travaillant 1 mois en Afrique. Et la pas besoin de travailler, des assos vous fournissent tout, nourriture vêtements...Y'en a marre des gauchos-communiste.\n\n\nOu alors... On a pas la tune d'envoyer tout le monde (car les passeurs ça coûte chère) et dans ce cas seule la personne la plus apte a travailler (souvent le père ou le fils aîné) part pour gagner de l'argent et l'envoyer à leur famille. Vous voyez ? Vous connaissez queudale à leur vie, juste vous pensez savoir via la télé ou les \"on dit\".\n\nEt sur les 11e gagner, il en enverra 8 à sa famille au passage mais ça on oubli de le dire aussi, ça les rendrait presque humain...\n\n\nC'est d'ailleurs ça le paradoxe de gens comme vous : juger sans connaître ni savoir (et je parle même pas de tenter de se mettre à leur place).\n",
				"added": 1484046272
			},
			{
				"comment_id": 11,
				"body": "Et désolé pour la syntaxe je suis pas encore très familier à ces forums ;)",
				"added": 1484046341
			},
			{
				"comment_id": 15,
				"body": "> [marc](#comment_4_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): N'importe quoi, on envois le plus apte a travailler, 95% ne travaillent pas, surtout quand on a aucunes qualifications, dans le classement PISA, tout ces pays sont en bas de classement, niveau QI c'est du CM2.S'ils veulent fuir, ils peuvent aller dans des pays riches et de même civilisation, Arabie saoudite Qatar, Barein ...., \n\nMDR et donc parce qu'ils ne trouvent pas de travail par manque de qualification ils viennent pas en france pour travailler mais profiter ? Mais le fais-tu exprès ou es-tu clairement stupide ? Là j'ai de gros doute sur ta faculté à produire un raisonnement logique je t'avouerai...\n\n\n> Cherchez sur google, la France est le 1er pays européen suivis de l’Allemagne qui envoie de l'argent a Maghreb (ces pays ne sont pas en guerre), si l'argent gagner en France est envoyé au Maghreb, c'est qu'il est pas dépensé en France, et donc ne profite pas a l’économie française. L’état ne gagnera pas les 20% de TVA sur tout ce que vous achetez. Donc ZÉRO argent pour construire des routes,des hôpitaux, des écoles....\n\nAlors :\n1) On dit \"au\" maghreb mais visiblement tu le connait si mal que tu sais pas qu'il y a plusieurs pays :p\n2) Si on finance tant le magrheb c'est qu'on est en partenariat avec depuis des années (peut-être ignores-tu ce que signifie partenariat, je te laisse aller voir ;) )\n3) Lorsqu'on fait des dons c'est que oui on touche rien en retour\n4) Un don n'est jamais gratuit (si tu avait fait de la philo, ce dont je doute, tu le saurais) et si on donne autant c'est pour des raisons géopolitiques :\n      - Barrière naturelle entre l'affrique du sud et l'europe\n      - Tourisme en masse\n      - Pétrole en vu pas loin\n      - ... bref je ne suis pas expert géopolitique juste pas stupide et naif pour croire qu'un gouv qui passe son temps à faire des amalgames choisit envers une population irait donner gratos de l'argent pour faire jolie sur le CV....\n\n\n> Si vous aller dans un foyer sonacotra, c'est très simple vous verrez combien les gens payent pour manger a la cantine commune, moins d'un euro.\n\nIncroyable, scoop !!! Les pauvres mangent pas chère, OYEZ OYEZ BRAVE GENS NOUS AVONS LE SCOOP DE L'ANNÉE !!!\n\n\n> Moi je suis expatrie, j'en avais marre de payer pour tous ces bougnoules, (j'ai habite 6 ans dans le neuf-trois, je connais les bougnoules) dans mon nouveau pays, j'y suis légalement, j'ai un VISA légal payant a renouveler tous les 2 ans, je respecte les lois et les coutumes des habitants, je n'impose rien du tout, et surtout je ne prends pas le travail d'un local.Pour obtenir ce visa, je dois passer un check-up médical a mes frais pour montrer que je suis en bonne sante et ne viens pas pour me faire soigner gratuitement.\n\n#COOLTAVIE #OSEF #untémoignagenestpasunepreuveconnard\nEt alors ? Qu'est-ce qu'on est cencé en tiré comme conclusion ? Que toi t'es le plus intelligent du monde car tu réussit à ne pas dépendre des autres ? Berces-toi d'illusion si tu le souhaites mais tu as eut de la chance que d'autre n'ont pas eut.\n\n\n> J'ai fuis le communisme français, et l'islamisation de la France.\n\nGrand bien te fasse... Je vois pas où la france s'islamise mais bon... Ah oui tu parles des 10 quartiers d'IDF où ya beaucoup de gens issu de l'immigration... Moins de 10% de la France, wouha on est quasi foutu la ololo !",
				"added": 1484127532
			},
			{
				"comment_id": 16,
				"body": "> [marc](#comment_7_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): c'EST TOI LE CONNARD, BOUGOULE COMMUNISTE\n\nLol si ça peut te consoler :p",
				"added": 1484129535
			},
			{
				"comment_id": 18,
				"body": "> [marc](#comment_8_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): Les agressions de bougnoles muzz en France: https://faitdiversfrance.wordpress.com/et dans toutes l'europe, aux USA partout, c'est les mêmes. Vous êtes un cancer de l’humanité.\n\nJe sais pas pourquoi tu persiste à m’inclure dedans mais bon...\nLe fait qu'un grand nombre suivent la même idée ne signifie pas qu'elle est meilleurs... Sinon go windows, google et facebook :p",
				"added": 1484138622
			}
		],
		"7_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 8,
				"body": "Oui soutenons les pauvres petits flics qui ont choisit leur putain de métier de chien de garde et qui tape plus facilement sur du manifestant pré-pubère ou vieux désarmés quant eux sont armés de la tête au pied et protégé par une armure complète !\nPlainions ces assassins couverts par la loi de leur bavures incessante et étonnons nous de la mort de l'un d'entre eux tous les mois alors qu'ils savent que leur taf est risqué en y entrant... C'est moins normal qu'un FDP dans un métier à risque qui passe son temps à humilier des jeunes en banlieue se fasse tuer qu'un jean-benoit le rebelle, 16ans,  mort en manif parce qu'il a pas put fuir à temps... BAH VOYONS !!!\n\nJ'aurais du respect pour ces salles merdes de flics le jour où ils feront leur travail : nous protéger au lieu de nous casser les couilles !",
				"added": 1483625525
			},
			{
				"comment_id": 9,
				"body": "> [planespherev3](#comment_2_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): La flicaille est consubstantielle du mode de production qui consiste en la séparation entre propriétaires des moyens de production et travailleurs.\n> En effet, il faut constamment protéger les propriétaires des moyens de production de la rébéllion des prolétaires.\n> Voilà leur vrai rôle, faire rempart à la classe capitaliste.\n> Médite là dessus.\n\n100% d'accord :)\n\n> [marc](#comment_3_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): Oui, bien sur, un jeune de banlieue qui manifeste ? Mais que font les parents ? un jeune c'est a l’école qu'il doit aller, jusqu’à ses 16 ans ou plus, il est sous la responsabilité de ses parents jusqu’à ses 18 ans.Me fait marrer ces jeunes, ils n'ont jamais travailles, aucunes expérience du travail de la vie, mais manifestent.\n> Si vous êtes pas content, un passeport coûte 100 euros, vous pouvez partir a l’étranger. Attention a l’étranger, il n'y a pas de RTT, il n'y a pas 5 semaines de congés, il n'y a pas 35 heures, il faut travailler le samedi et le dimanche ..... bref c'est pas pour les fainéants gaucho-communiste qui vivent sur le dos des autres, rien ne vous empêche de créer votre propre boite et d'embaucher, ha oui quand on créer sa boite il faut travailler dur, 70h -80h /semaine sinon elle coule.\n\nMDR ce HS complet xD\nMon chère petit marc: perso j'ai beau travailler et payer mes impôts comme tout le monde, je continue de manifesté. Je manifestait avant et je continue, c'est une question de conviction et de réflexion ce dont tu as l'air de manquer.\nEt ce n'est pas parce qu'il y a pire ailleurs qu'on doit se contenter de notre merde ! C'est quoi cette mentalité de victime là ! \"ah bah moi je me contente de ce que j'ai parce que je vois pire ailleurs alors je fermes ma gueule de soumis par peur qu'on m'enlève encore plus\" pauvre con les droits que tu cites tu crois qu'on les a acquis comment ? En manifestant pour en avoir plus pas en se étant auto-complaisant doublé de procrastination sans nom ! Alors tes discours de victimes vaincu tu te les gardes ici on parle entre gens qui essayent de faire changer les choses ;)",
				"added": 1484045310
			},
			{
				"comment_id": 14,
				"body": "> [marc](#comment_6_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): Quand tu signe un contrat de travail, tu sais quoi tu signe, si tu n'est pas content, ne signe pas et cherche un autre boulot.Les lois changent, c'est normal, on est en démocratie, si la loi ne te plais pas, tu n'a qu'a partir, c'est la démocratie mec.Moi j'en avais marre du communisme français et de voir plein de bougnoules autour de moi, je suis partis.\n\nNon la démocratie chère décérébré, c'est que lorsqu’on est pas content on a le droit de le dire haut et fort et même de voter pour changer les choses... Or non seulement on vote pour des gignols qui votent à nos places mais en plus de cela ces guignols sont achetés par des putain de lobbyistes... Où est la démocratie dont tu parle ? T'es aveugle ou juste stupide pour croire à ça ???\n\nEt encore une fois très beau HS (c'est ta marc de fabrique :p) car je te disais être content de mon travail mais pas de ce système... Tu mélanges tout en essayant de pas perdre la face mais il vaudrait mieux te taire pour arrêter cette humiliation même pas jouissive pour moi vu que je ne te connaît pas.",
				"added": 1484126933
			}
		],
		"2_1oMXqv6LN67F2aFKqm6hyBY3G2kt1SnEu": [
			{
				"comment_id": 13,
				"body": "Et en plus savoir qui est l'auteur ne fait pas de sens puisque le site peut être cloné et héberger par tout le monde.\nEt si t'as peur passe par Tor ;)",
				"added": 1484046755
			}
		]
	},
	"comment_vote": {
		"1_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY": 1
	}
}