{
	"title": "Blog of Indeep\n",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1535991285,
	"post": [
		{
			"post_id": 9,
			"title": "BBC news online abuse warning",
			"date_published": 1535989273.2,
			"body": "Let's hope this campaign is extended to include investigation of the paedophilic UK government & UK deep state.\n\nWatch [BBC news online abuse warning](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535988654_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 8,
			"title": "Champion Sound - Documentary on the history of Reggae sound systems in Coventry, UK ",
			"date_published": 1535452678.8,
			"body": "The documentary is a historical overview of the beginnings and growth of Jamaican Sound System culture in Coventry, UK.\n\nFrom the 1950s to the 1990s, the story is told by the pioneers who brought the Sound Systems to the UK and the generations of Sound System family since.\n\nSome ground-breaking interviews with local sound systems, DJs and Reggae pioneers - including: Count Spinner, El Paso, Principal, King Baggy HI FI, Jah Baddis, Mackabee Studio, Black Crusader, JB International, Marshall, DJ MJikey D etc\n\nAlongside Coventry people, the film features interviews with Freddie MacGregor, Pete Waterman, Dr Robert Beckford and Lynval Golding.\n\nThe soundtrack features some of the all time greatest Sound System tunes.\n\nThe production was funded by The Heritage Lottery Fund\n\nWatch [Champion Sound](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535452477_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 7,
			"title": "Tracking the Lincolnshire Poacher",
			"date_published": 1535351567.3,
			"body": "The BBC Radio 4 Broadcast of \"Tracking The Lincolnshire Poacher,\" first aired in 2005.\n\n\"BBC Radio's Simon Fanshawe embarks on a detective journey into the clandestine world of radio cryptography and attempts to solve one of the most unusual broadcast mysteries of all time.\"\n\nThe phenomenon of so-called \"number stations,\" mysterious shortwave radio broadcasts that seem to exist only to transmit spoken-word numbers, snippets of weird songs and enigmatic codes, is a genuine mystery.\n\nExactly who is broadcasting these transmissions and why is unknown. One theory holds that the transmissions are part of espionage efforts by the intelligence agencies of different countries, another, that they are the work of organized drug smugglers, while still another claims that they are actually communications between extraterrestrial space aliens! (One commentator on an Internet message board even referred to them as \"the aural equivalent of crop circles\").\n\nThe espionage theory seems to be the most plausible.  Akin Fernandez, creator of The Conet Project CD, states that, \"Shortwave numbers stations are a perfect method of anonymous, one way communication. Spies located anywhere in the world can be communicated to by their masters via small, locally available, and unmodified shortwave receivers. The encryption system used by numbers stations, known as a \"one time pad\" is unbreakable. Combine this with the fact that it is almost impossible to track down the message recipients once they are inserted into the enemy country, it becomes clear just how powerful the numbers station system is.\"While shortwave radio buffs have been aware of them for years, the number station phenomenon remains largely unheard of by the general public.\n\nListen: [Tracking the Lincolnshire Poacher](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535351365_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 6,
			"title": "Stealing Van Gogh - Documentary",
			"date_published": 1535282474.7,
			"body": "Andrew Graham-Dixon confronts the worlds of high art and seriously organised crime to uncover the true story behind the greatest art heist of the 21st century. In December 2002, two priceless and historically important paintings were stolen from the Van Gogh Museum in Amsterdam, in a brutal and audacious robbery by experienced, professional thieves.\n\nWatch [Stealing Van Gogh](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535280698_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)\n\nWatch the companion documentary [Look Inside The World of Chinese Copy-Culture](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535281773_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 5,
			"title": "The World According to Philip K. Dick",
			"date_published": 1535193760.4,
			"body": "Largely overlooked in his own lifetime, he's now considered a visionary. His novels foresaw the tech mania of the digital age.\n\nPhilip Kindred Dick published a wealth of novels and short stories that would provide the inspiration for classic science fiction films such as Total Recall, Blade Runner and Minority Report.\n\nDick's work has been compared to the likes of Franz Kafka, George Orwell and Isaac Asimov. His stories questioned what it is to be human, and what distinguishes man from machine. Dick suffered from agoraphobia and rarely left his suburban California home - but traveled through the countless worlds in his mind, often with the help of amphetamines.\n\nIn his 45 novels and 120 short stories he explored issues of relevance today: virtual worlds, totalitarian societies, environmental disasters and technologies that could enslave us. Delve into Philip K. Dick's life and work, drawing upon a rare interview in which the author spoke frankly about his life.\n\nAlso featured are conversations with the author's psychotherapist, his widow and his biographer, which combine to offer a compelling portrait of a man who spent his life writing about the \"creeping sensation that all certainties stand upon sand.\" Go beyond the headlines and watch a report that explores the individual behind one of the greatest science fiction writers of all time.\n\nThis documentary was originally broadcast in the French language in 2015 & now broadcast in English in 2018.\n\nIn addition to this documentary, I'm also uploading a companion documentary to ZeroNet from the BBC's 'Arena' series entitled, 'A Day in the Afterlife.'\n\nWatch ['The World According to Philip K. Dick'](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535193010_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)\n\nWatch ['A Day in the Afterlife'](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535193400_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 4,
			"title": "Interpol - Who Controls The World Police?",
			"date_published": 1535113985,
			"body": "From Deutsche Welle dw.com/en/top-stories/documentary-report/s-32861\n\n\"Is Interpol, the international criminal police organization, losing it's integrity? The media rarely gets to look behind the scenes of Interpol.\n\nNearly 200 countries belong to the international super police agency - but its funding does not cover its ambitious projects. This is why Interpol has entered collaborating with corporations, study groups and controversial states, something hitherto unthinkable.\n\nThe forerunner of the present organization was founded nearly a century ago to strengthen cooperation between national police authorities. With increasing globalization and the associated rise in international organized crime the challenges for the agency, which now has 192 member states, have also grown.\n\nWhen Ronald Noble, an American, became Secretary General of Interpol in 2000, the worlds largest police organization underwent a dramatic turnaround. Noble's dream was to create an 'international super police'. To achieve that goal, Interpol entered into previously unimaginable cooperation agreements with large corporations such as Philip Morris International and Sanofi, as well as organizations suspected of corruption such as FIFA.\n\nInterpol has been criticized for disregarding serious conflicts of interest arising from the potential influence of private donors on investigations. At the same time, some controversial countries began to fund the world police. In march 2017, for example, the United Arab Emirates gave Interpol 50 million euros - as much as contributions from all the member states put together. But surely such a grant from a single country raises questions about the independence of the recipient. What alliances is Interpol prepared to enter into in order to expand?\n\nIs it possible to finance policing through private donations without compromising integrity and accountability? Is this the first step toward a new world order in which collaboration between police authorities and large international companies is seen as normal?\"\n\n[Watch it here Interpol - Who Controls The World Police?](http://127.0.0.1:43110/big.kopykate.bit/?Video=1535111773_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 3,
			"title": "Punishment Park (1971)\n",
			"date_published": 1534877841.58,
			"body": "Punishment Park (1971)\n\nPunishment Park is a 1971 American mockumentary drama film written and directed by Peter Watkins. It is a pseudo documentary of a British and West German film crew following National Guard soldiers and police as they pursue members of a counterculture group across a desert.\n\nReleased in 1971, many viewers & film critics have commented that the themes conveyed in Punishment Park are also relevant in the current age & perhaps even more so.\n\n[Punishment Park (1971)](http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1535030785_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)\n\n[Punishment Park (1971) Trailer](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1535619358_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX)"
		},
		{
			"post_id": 2,
			"title": "Hello Zer0net",
			"date_published": 1534877322.32,
			"body": "I'm planning to blog when time permits.\n\nAbout me: I'm a dude who lives in Europe. I think the technical concept for Zer0net is absolutely brilliant, especially when utilized with Tor.\n\nIn my opinion, the need for networks like Zer0net is an imperative, especially for anyone who wants to have an uncensored voice.\n\nIt would seem many people have been socially conditioned to routinely give up their freedom of speech, choosing instead to opt for the perceived convenience & enjoyment of using social networks to have 'easy' access to those people they know or wish to know.\n\nHowever, in more recent times many governments in Europe & around the world are making it very clear that true freedom of speech will not be tolerated.\n\nThankfully, there are a number of excellent alternatives being developed. Moving forward, it seems reasonable to expect decentralized, uncensored & anonymous social networks to flourish not only for those who have opinions they fear will be punished but also for the everyday folk who want to find a place on the Internet to make their home & where they can just feel free, without the fear of draconian punishments for refusing to accept the boot of censorship in their faces, day after day."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}