{
	"title": "Zozon's \nZeroBlog",
	"description": "zozon's gargles daily or whenever\n",
	"links": "- [another try on blog - hugo](/126fBtopb2n7Pc42KhZyZyHhZKrecAdMdR)\n- [cloned chat](/1GDPySCaCCWFyFFyWCfcWhum4XHara26V4#Publish) from [ZeroChat](/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1458475193,
	"post": [
		{
			"post_id": 9,
			"title": "Zero wiki\t",
			"date_published": 1458474125.631,
			"body": "Trying to clone it: http://127.0.0.1:43110/1NTwqW1vkwCHpGf8eS7XKKp5yDhjExY1eF/?Page:home\n\nZero wiki is on: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/\n\nin particular: [zozon's wiki page](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zozon)"
		},
		{
			"post_id": 8,
			"title": "Nothing New",
			"date_published": 1456003869.437,
			"body": "Nothing new for 0net that is. I was playing around with other things.\nWent exploring gnu social....\nWhat to say, seen this before in Diaspora (and IMHO) Diaspora works better & you have more space to write. Ok the difference is that as far as I understand gnu social allows you to run your own server and 'federate' content peer 2 peer to other servers (although I did not get really a mechanism how you can do it with some content).\nOk it can get large in this fashion, and ok it gives some method of content exchange but it is very limited. And it kind of resemble tweeter from one side and facebook from other, whereby neither concept is really embraced.\n\nThen I got really annoyed by friend of mine that is developing something with google hangouts. He uses me as guinea pig for his experiments in the time that he chooses. I understand his enthusiasm but some people do not know basic netiquette. (Netiquette - who knows that today?) I have bunch of google accounts and he uses one I have on mobile. At least he could have asked. Perhaps he needed someone who is always online...\n\nWhen I send him a message on hangout he replies immediately and I got that he has a bot on this side (he was explaining to me what he want to achieve). His bot is somewhat stupid and whatever I say he says 'OK'. Eventually he'd reply here and there on my messages.\n\nThen I have received a number of calls while I was in the office @ work and they were repeating calls so that I had to mute him.\n\nThat was not enough. He also calls at any f\\* time. Couple of nights before he called several times in the middle of the f\\* night. Guess he was on developers spree. Luckily, that I have mobile on 'do not disturb' during the night otherwise I would travel overseas to launch him with satellites.\n\nToday, I have set on a mission, eye for eye, tooth for tooth, bot for bot. So I have found a script to 'botize' hangout, and it is good one... And I made number of auto-replies when I receive OK or TESTING. Then I thought, gosh, if I reply immediately to the OK with something else bots will go into the loop - chatting endlessly. So I made the modification - answer in 15% of cases otherwise ignore posting. So my bot will answer only on repeated spams of OK's. (perhaps it would be better a loop huh? :) ) I just did not have time to extend script that much for  bot war loop.\n\nAh yes, calls...\n\nSo, I also included plug-in that detects calls... and when caller hangs up sends a message. So message was: 'Shhh, do not call at this time, send message.'. If you repeat calls it will tell you 'You called xxx min/hours.. ago, I kindly ask you not to call.'\n\nTested whole thing from another google account hangout and left it waiting for him to call.\n\nGuess what? He did! :) \n(while I was writing 0email to fellow 0netian)\n\nI think he got scared. I do not even get OK in response from him any more. He left message: 'I will not bother you, will call other people...'\n\nYes!!!!!!! Thank you!\n\nHave fun.\nz0z0n\n\np.s. I do not mind him really, I know him for looooong time, he is genius guy, has some crazy and neat solutions for very tough problems, and I have done a ton of work with him, but sometimes, social skills... I guess I do not have a nerve any more, as I used to. To tolerate some things. And technology is really getting annoying with all this ability and connectivity and lack of humanity even in the f* the bed or toilet... too much. Not too much - three much!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 7,
			"title": "Hyde on Zero",
			"date_published": 1455409332.689,
			"body": "Gosh. This was a difficult journey and I am still not 100% sure that I made it. It looks nice though and 'works' but...\n\nCheck it out.\n[Hyde on Zero](/1GEiRYXfvydwWWAvh6vfyCdek2cZ82Eea5)\n\n###So what was challenge here, or rather, the idea?\n\nFirst I have examined what nofish suggested in one of posts - a collection of static web site generators. There are plenty of them and I have said, right, lets try most popular one to see what we are talking about.\n\nQuick overview brings Jekyll. This is by far most popular. I had some time to play on Windows and have said, lets give it a shot and kill some time. Jekyll is written in Ruby, and I have installed Ruby because I was writing something before. Its a bad choice really Ruby and Windows are not liking each other for some reason, it was struggle to make it work on Windows, but I have that done.\n\nOK ruby is installed what can go wrong with installing a one gem onto existing installation. What a misleading thought... Several hours later, after reinstalling half of Ruby, installing additional modules in Python (you ask why is that...?) and several other rain-dance with feathers, I basically gave up. If I cannot make it working (and I do have experience convincing many software things to work) I wander how someone who has less experience or no experience would do it? Why it is so popular anyway? And yes if I cannot make it working on Windows I will not make it at all on Linux and OSX (later two are my primary place for fun).\n\nSo... I have said, ok let's see. 0net is python program. I run 0net because I have Python installed, so lets find something Pythonic and yet to be similar to Jekyll. So I have chosen Hyde.\n\nInstallation was a breeze, one pip. Worked out of the box with what they say on the initial pages. I was almost in frenzy. Nice!\n\nBut, cold shower. Wait! How do I add new post? With HUGO its easy there is a command to create a new post. Here in Hyde just a couple of commands, create, publish.\n\nWent to documentation. Half of documentation is missing. Other half talk about everything but not about how to create a new post.\n\nHacking time....\n\nEventually I have end up with what you can see on the link above but it costed me a half of a day with almost never being sure that I am going to overcome next hurdle.\n\nHyde is OK, not very friendly but nevertheless looks very powerful (if you are into learning how complex templates work). It could be used by someone with no knowledge of HTML - to create articles and link them - but you cannot be careless like in wordpress - nothing is helping you. However if you have moderate understanding of HTML and want to learn templates, perhaps, it is good exercise. I am not too happy with it, but it is usable. And it is more 'site like' more than 'blog' like but with blogging part which is good for many small sites.\n\nAhh yes, forgot, Ruby/Jekyll/Python ... you shall read documentation how to run Jekyll on Windows and you'll learn about version nightmares (between gems). On top of it Jekyll being written in Ruby has some extra functionality written in NodeJS and Python, so it is not pure Ruby and it infects other installations. Again... why the heck it is so popular????\n\nHave fun.\nZozon\n\n\n\n\n\n\n"
		},
		{
			"post_id": 4,
			"title": "IMHO cool sites",
			"date_published": 1454865854.541,
			"body": "- http://127.0.0.1:43110/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLT - nice idea & execution\n- http://127.0.0.1:43110/1MagneTSMMkNmJTMsTGJtfuNsqGjzzXgQv - useful when kat goes cookoo, keep making it\n- http://127.0.0.1:43110/karsten.bit - inspirational cooking, recipe, made a variant of it ... yummy \n\n\n"
		},
		{
			"post_id": 3,
			"title": "Trying to clone chat",
			"date_published": 1454850212.98,
			"body": "subject: http://127.0.0.1:43110/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg\nDoes not go easy but will see. Thank you for help nofish!\n\nfailing clone: http://127.0.0.1:43110/1GDPySCaCCWFyFFyWCfcWhum4XHara26V4\n\nI was hacking around for example removed original data folder (logic: recreate fresh data)\n\n-------\n\nlater... nofish provided recipe and now chat clone is functional ... yeeee!"
		},
		{
			"post_id": 2,
			"title": "Cloning",
			"date_published": 1454843235.679,
			"body": "At first I did not have an idea that a site can be cloned, until I have seen video tutorial on Twitter:\nhttps://twitter.com/Wolverineks/status/656280370426478592\nit was a revelation that clicked into the concept of incremental changes in same way mercurial works, just with web site code.\n\nOf course I could not resist to try it out. Gone for zero blog and cloned it.\n\nOk site was cloned, now customization... Turns out almost everything is customizable!\n\nGreat! So, let's blog! ;) \n"
		}
	]
}