{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1549168166_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1549168166_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): While the site itself doesn't, people still can switch to another engine while keeping old hubs intact more easily (technically it should be possible to migrate contents of a site to a new one with newer engine, but i don't think there's any convenient mechanism for that; and the sync will still be an issue)\n\nThat was the point I was making. Say nofish abandons everything. ZeroTalk is entirely fucked. No more raising limits. No more updates. Etc. But ZeroMe is absolutely fine. The hubs are all still there. Lots of users might have issues due to difficult/impossible hub migration. But for the front end we can just clone and continue developing while keeping on the same network.\n\nThough ZeroMe's hub design isn't ideal because it locks in users into a hub. Whereas something like ZeroLSTN or IFS doesn't. But the point remains. Hubs help decentralize and remove this \"sole owner dying\" issue. So when a community or user contribution is expected, there's no reason *not* to use hubs.\n\nSo while central developers are great, we need to start thinking of the web in a fundamentally new way. A good example is with the 0chan/nullchan/millchan fiasco. On the centralized sites, if the moderator dies, then it's doomed. Site's done, time to move on. But with the new hub-based one that's no longer a concern. Hubs can be created and posted to without worry. If one hub dies, that's just one hub. And the rest move on.",
				"added": 1549252741
			},
			{
				"comment_id": 2,
				"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @kaffie: [...]\n\nof course. perfectly chill. Here's my original response, reposted:\n\n---\n\nI don't mind providing input, but I don't like the idea. The two big problems outlined appeared to be spam and death of solely managed zites.\n\nThe second problem has already been solved. As there's ways to easily clone a site and move on, and also merger sites which should become the norm. Merger sites allow the backend posting to be decentralized, so there's no single point of failure (just post to a different hub, or have your own). While the front end can be easily cloned and managed if the original developer stops for whatever reason. See: ZeroMe. ZeroMe won't die, even if Nofish goes away. As the hubs are decentralized (no reliance on him adjusting permissions), and the front end can be cloned and managed.\n\nThe first problem, with the spam, is indeed an issue. Having hub providers ban, and users be able to block (and prevent the downloading of a user's posts) are more than enough to stop spam. If need be, switch to a proof of work/stake/identity cert provider. For instance, have a cert provider that requires people to show they are an authentic user and are manually approved. From there we have \"trusted certs\" which can be allowed, and in the case of a raid, just ban posting from non-trusted cert providers. A variety of solutions could be done here.\n\nI'd rather not put major zites in the hands of a few. But rather focus on turning them into mergers so that moderation is decentralized. We saw the death of zites like ZeroTV and ZeroTorrent. The dev leaves, and they either don't update, or users eventually run out of space. Merger sites solve this entirely.\n\nThough I do like the idea of developing a set of core zites that have these decentralization and protection principles in mind.\n\nWhat we really need is focus. We have like 3 wikis with split users, and that lead to apathy. There's a ton of forums, but it's hard to find the ones people are talking on. Something like ZeroVoat but with merger sites would probably be ideal for a forum. KopyKate is great, but appears to be suffering from the centralized owner issue. No hubs = not much incentive to post as the next video site will pop up and end up starting from scratch.\n\nI think a good idea of the council would be to design proper/good merger site standards. So that the same sets of data can be accessed by a variety of sites. Proper post metadata, design structures, etc. That way we don't end up with duplicated work. Why have 3 wikis all dying with different standards, when we could have a single merger db accessed by 3 different wiki frontends?",
				"added": 1549253440
			},
			{
				"comment_id": 3,
				"body": "> [quirrel](#comment_2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Kaffie is now in charge for ZeroNet instead of nofish?\n\nhaha no, as amusing as that'd be. nofish is still the primary developer of zeronet, and runs pretty much all of the major sites for it (zeroid, zerotalk, zeroboard, zeromail, parts of zerome, etc.). I'm just a particularly well known person, as I was here early on and caught some popularity due to my search engine. I'm not anyone special haha. I just like ZeroNet and wish to see it grow.\n\n> [quantumworld](#comment_1_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have yet to see any spam related problems on Zeronet. I think that starting up something like this before there is allot of users on this system is a total complete waste of time. \n\nThis was basically my thoughts as well. The current block/mute systems work well enough, and will only be improved with time.\n\n>I already see the socialist group think philosophy of power and ego control happening over others happening. \n\nFortunately, due to the nature of the tech, there's no real worries about that on a larger scale. The only issue I really see is an over-reliance on nofish's network of sites.\n\n>This kind of mindset will detract any possible users who would want to be involved in the development of Zeronet as a viable alternative to clear-net. I have seen this very exact same thing happen on two other open source projects. They all failed miserably into a he said she said oh I am so offended by __ , everyone eventually blocked those users from there Victim back stabbing rants of power and control over others. \n\nAnd here's where the issues begin. If you want to be close to the core development you can't be a dick to people. It's honestly as simple as that. nofish is largely apolitical and just desires to focus on privacy and decentralization. So there's not much worry about pushing politics on either side.\n\nBut most users who come to zeronet, and most who are involved in the radical decentralization scene in general tend to be *very* left-wing and anarchist. If you aren't cool with that then..... make your own group or go to bitcoin stuff where the right-wing folks are? I find right-wing libertarian type people don't tend to stick around long because there's no profit to be made here, and most people in anarchist spaces aren't going to put up with their shit.\n\nAs for what your intended complaint was, SJWs, I don't really think we have any at the moment. There's a few names around who are kind of the oversensitive type (geekless not being one of them), but ultimately it's not a large issue. The SJWs don't like it here because we *are* anarchist by nature, and naturally that communist/socialist hierarchy fails to apply. Part of why I'm a bit opposed to the idea of a core central authority here. IMO the more decentralized the better.\n\nI'm just gonna be blunt here though, quantumworld, you don't really seem like the type who's going to stay with zeronet long-term. Literally every time you pop up on my screen it's you bitching about left-wing politics. And you certainly won't find an audience here for that. And mocking/hating people who are trying to promote zeronet is just going to end up putting you in a bad light, and possibly banned/muted by many people. I wouldn't be surprised if you already ended up on a few lists tbh.\n\nThat's not to say political diversity shouldn't be a thing. But why do you have to be a dick? There's a mutual view here that we're opposed to hierarchical power structures. So why so antagonistic?\n\n>Anyway I am not interested in creating a though control group that shames others users into a socialist mindset of offensive behavior. Good luck with your centralized structure..  IM OUT!!!!\n\nLmao. You're gonna have a rough time in decentralization projects. Since legit most of the scene are far-left anarchists. Perhaps the cryptocurrency stuff and things like bitchute are more up your alley? And of course, no one's stopping you from making your own forums, your own zerome hubs, etc. and posting your stuff there. That's why I run my own zerome hub, because I know I'm the type of person that often gets censored haha. I like to ramble on a lot as well, which usually results in me hitting post caps.\n\nTL;DR: if you want to participate in a communal space, you have to think and participate in a communal way. Capitalist thinking isn't going to to get you far in these kinds of spaces.",
				"added": 1549444211
			}
		],
		"1624387612_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 4,
				"body": "I'm not a fan of this. I like that it seeds by default and it's easy enough to delete if you don't want the site. Having it not seed by default will just result in the same situation as other p2p web hosting projects, where it's impossible to access any sites because the one host went down and all of the visitors didn't seed because it took too much effort. With seeding as default, lazy users contribute to hosting zeronet sites, rather than leeching.",
				"added": 1631057969
			}
		]
	},
	"comment_vote": {}
}