{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "刘仲敬  「中国」这个概念的形成",
			"body": "刘仲敬 | 「中国」这个概念的形成\n2016年5月3日台湾广播《杨宪宏时间》访谈录\n\n主持人：刘仲敬老师2014在广西师范大学出版社有一本《从华夏到中国》，讨论「中国」这个概念在近代形成的过程。我们都知道，孙中山成立同盟会的时候提出「驱除鞑虏，恢复中华」。「中国」概念的形成跟清末的革命、跟现代国家的形成有一些交互关係，密不可分。根据你的研究，你怎麽看这个问题？\n\n刘仲敬：这个其实是一个世界性的问题，不仅仅是在亚洲存在。我们可以看到，就是十九世纪中叶以来，由法国大革命开创出来的民族国家观念向全世界各地传播，东欧国家、西亚国家、东亚国家其实都受到波及，并不仅仅是孙中山和梁啓超他们的事情。波兰、匈牙利那些地方的知识分子也是根据法国大革命和法兰西共和国的原则，想把他们原来的各个族群建立成为一个新的共同体，而这个共同体应该跟西欧的共同体有些相似之处。而日本其实在近代也有同样的国家建构问题，奥斯曼土耳其、俄罗斯帝国同样有这样的共同体构建问题。实际上，共同体构建问题，或者叫做国民构建问题，本身就是现代世界上最重大的问题。\n\n在近代以前的世界上，统治原则是不需要考虑国民问题的，它只需要在统治者和被统治者之间达成私人关係就行了。我只要忠于皇帝或者国王就行了，皇帝和国王跟我是不是同一族，是谁，那没有关係，只要他实际上行使统治权，而我实际上对他进行个人效忠就可以了，他没有整体性的国民概念。而法国大革命产生了民族民主国家的概念，统治权要由国王?—?— 这个具体的、有血有肉的国王这个人手裡面，转到抽象的国民手裡面。国王是有具体的人的，无论你是路易十四还是路易十六，说是国王统治，就是这个名字叫路易的人统治；但如果你说法兰西共和国是一个民主国家，由法兰西国民统治，那你就要首先搞清楚法兰西国民是什麽。例如洛林人是不是法兰西国民的一部分？如果洛林人是法兰西国民的一部分，那麽阿尔萨斯人是不是？阿尔萨斯人如果是，比利时人是不是？如果比利时人不是，那我们就要搞清楚，巴黎人和布鲁塞尔人到底有什麽区别，为什麽巴黎人是法兰西国民，而布鲁塞尔人就不是法兰西国民。\n\n所以国民共同体的建立，首先就要划清边界，谁是国民共同体的一员，谁不是国民共同体的一员。这就是认同政治。现在的所有民族国家都是建立在认同政治的基础上。你是不是这个国民共同体的成员？如果你是，你就有统治权；如果你不是，你就没有统治权。而国王就没有这个问题，你是不是国王，这是一目了然的，不存在这个认同和边界的问题。如果东亚仍然是在大清皇帝的统治下，这个问题是不必要的。光绪皇帝在台上，你就是光绪皇帝的臣民；宣统皇帝在台上，你就是宣统皇帝的臣民。但是你如果认为大清帝国应该结束，东亚的居民应该像秋瑾说的那样享受欧洲人同样的权利，那麽你就要搞清楚，这个新的共同体的边界在哪裡，谁是这个新共同体的成员。\n\n例如像是孙中山、宋教仁、汪精卫、章太炎这些人就认为，像满洲人、蒙古人，不是这个共同体的成员；我们要革命，驱除鞑虏，恢复中华。意思是什麽呢？就是要划定一个新的共同体边界，在边界划定以后成立新的共同体，这个新的共同体要不包括满洲皇室和八旗。满洲皇室和八旗不是我们这个共同体的成员，而是我们这个共同体的征服者和敌人。他们要利用这一点划分自我和他者，从而建立新的共同体。这个毫不奇怪，欧洲人也是这样的。例如波兰人要发明自己的共同体，就要首先区分俄罗斯这个概念，儘管波兰人和俄罗斯人都是斯拉夫人，但是俄罗斯人是波兰的征服者，波兰的民族主义和国家建构是建立在抗击俄罗斯的基础上的。爱尔兰人首先就要划清楚英国人和爱尔兰人的不同，通过反对英国人，把爱尔兰这个共同体建立起来，利用天主教这个符号，把爱尔兰民族这个共同体建立起来。孙中山、宋教仁、汪精卫这些人想要做的也就是利用大清对大明的征服这件事情，建立一个新的共同体，他们设想的这个新的共同体是不包括长城以外的各个族群的。\n\n所以你可以看出，在东京留学生当中，是不是自称自己是「中国人」或者「支那人」，是一个政治问题。因为大清的国号毕竟是「大清」，而日本人对留学生的称呼，一般就是说「清国留学生」。这话是很正常的，因为大清就是清国，那麽从清国来的留学生，当然就是清国留学生。如果你是一个忠于大清的人，或者是完全不关心政治的人，你就会机械性的去，填你的身份的时候你就会说我是清国留学生，接受这个称呼。但是如果你是反清的人呢，你就会说我是支那人或者我是中国人。例如像章太炎和那些留学生，在东京举行支那亡国多少多少年的纪念会，就是说把大清入关这件事情当成是支那亡国。他说「我是支那人」的意思就是说，我不是清国人，我是你们清国的敌人。说我是「中国人」，或者说我是「中华」，或者说我是「炎黄子孙」，意义也是这个样子的。照当时用词的含义，说自己是「炎黄子孙」，或者说自己是「中华」这些东西，跟历史上的假如曾经存在过的黄帝、炎帝其实没有什麽关係，它主要就是表明，我想要建立的这个共同体跟你大清这个共同体是有区别的，我想要建立一个全新的共同体。其实辛亥革命就是本着这种精神製造起来的。\n\n但是后来发展的情况就跟波兰、匈牙利和爱尔兰不一样。波兰、匈牙利和爱尔兰经过一系列的纠纷以后，把一部分有争议的土地放弃了以后，逐步的建立一个单一的民族国家；而辛亥革命以后，这个问题始终没有解决，例如像是九一八事变之类的问题就是这样製造出来的。归根结底还是因为孙中山和国民党离开了他们在辛亥年间的政策。他们在辛亥年间认为满洲不是中国，而是中国的敌人；然后在北伐以后又主张，中华民国应该继承清朝的所有土地。因此满洲到底是不是中国的问题，就引起了严重的冲突，最后导致了战争。我们从全世界的这个宏观角度来讲，这种战争其实稀松平常。像波兰要建立民族国家，它也要考虑一下，立陶宛到底是波兰的一部分还是不是一部分。按照历史原则，那麽波兰立陶宛王国一直是一个王国，立陶宛应该是波兰的一部分；按照民族原则的话，波兰可以建立民族国家，立陶宛当然也可以建立民族国家。匈牙利人对罗马尼亚人、西班牙人对加泰罗尼亚人也都有诸如此类的问题。\n\n归根结底就是因为，民族国家或者是国民共同体这个东西的建立，最核心的因素就是认同，而认同是主观的，因此没有客观标准。所以你可以说，一个立陶宛人，他可以认定自己是波兰人，也可以认定自己是立陶宛人。一个都柏林人，他可以认定自己是大英帝国的臣民，也可以认定他是新兴的、还没有国家的爱尔兰民族的一部分。那麽这两种说法哪一种正确呢？完全看他自己的认知如何。都柏林人如果坚持说，我是天主教徒，我就是爱尔兰人，跟你们信仰新教的英国人不同，那他就等于是，客观上讲他就是支持了爱尔兰民族、建立爱尔兰共和国、脱离大英帝国的企图；如果他坚持是他是大英帝国的臣民，那就完全不一样了。所以民族国家的根本核心就是认同，而认同又是主观的，因此冲突是不可避免的。在认同的边界稳定之前，为了争夺认同的斗争基本上是连绵不绝的。像十九世纪晚期的斯洛伐克，如果你让斯洛伐克人接受匈牙利语的教育，他就比较有可能自称自己是匈牙利人；如果让他接受斯拉夫的教育，他就比较有可能支持捷克和斯洛伐克联盟、搞泛斯拉夫主义的前景。这两种前景是水火不相容的，也就是说斯洛伐克未来的命运取决于斯洛伐克人的自身认同和斯洛伐克教育机构对斯洛伐克人民认同的教育。\n\n台湾现在面临的就是这个问题。它到底需要有什麽样的认同呢？它是要接受由梁啓超设计的那个继承大清帝国的中华民族认同呢，还是要发展一种纯粹台湾的台湾民族认同？这个问题就将直接决定它未来的前途。立陶宛是会变成波兰的一部分，变成俄罗斯的一部分，还是变成一个独立国家，归根结底是十九世纪以后那段时间，立陶宛当地居民如何培养认同的问题。而这个问题是没有确定答桉的。直截了当地说，我认为我是立陶宛人，我就是立陶宛人；我认为我是俄罗斯人，我就是俄罗斯人；我认为我是波兰人，我就是波兰人。所以我说，认同这个事情就像信仰和爱情一样，是越过悬崖的一跳。你不可能证明，为什麽我要做基督徒或者做穆斯林，我只能说我认同基督教或者伊斯兰教，我也没有办法说，凭什麽你是中国人还是台湾人，我认同中国，我就是中国人，我认同台湾，就是台湾人，答桉只能是这样。争夺认同的斗争归根结底是无法避免的。\n\n主持人：台湾的问题的确非常有意思，有一个变化，大概在过去三十年的时间，一开始是认为「自己是中国人」的，按调查，人口比例是比较高的，百分之七、八十的人都认为自己是中国人；逐渐的，认同「自己是中国人」的人越来越少，少到现在几乎只剩下可能百分之十。其他比例，认同「自己是中国人也是台湾人」的也佔了一定的比例。最大的比例，可能到了七成左右，现在的台湾人认为「自己是台湾人，不是中国人」。这是过去三十年的变化。在台湾有一种说法，就是拿中华人民共和国护照的人才是中国人。至于拿中华民国护照的人，因为「中国」这个概念已经被中华人民共和国拿走了，所以台湾的中华民国护照底下还附注「台湾」两个字。大多数的人在入境美国问你是什麽的国籍的时候，大多人都填台湾。过去曾经有一阵子还有一个误解，就是被改成「China」，很多台湾人在海关告诉他说，我不是中国人，我是台湾人。所以目前的确还有一些地方是矛盾的。刘老师您怎麽看刚刚我讲的这个有关「谁是中国人」的问题？\n\n刘仲敬：这个问题其实有两个方面：一个是局部的和具体的因素，就是说，北京的共产党政府既然认为只有我才代表中国，那麽不认同共产党的人就倾向于认为，我最好也不要认同中国，以免跟你溷淆在一起，这是一个局部和具体的理由；但是从更长远和更广泛的角度来看，这根本上就涉及一个近代民族国家建构过程当中，怎样的共同体容易建立的问题。直截了当地说就是，小型的共同体容易建立它的认同，而继承了帝国规模的共同体不容易建立它的认同。因为认同这个东西，它是需要经过一系列的操作来强化的。如果你我都是一个小共同体的成员，我们经常在同一个共同体之内办理共同的事务，那麽我们之间的认同就容易巩固。而且尤其是这个小共同体在建立了民主以后，我们更容易通过投票和民主参与的角度来看，因为我们都对同一个共同体的事务施加影响，而这个共同体的好坏对我们将来的命运有直接影响。比如说是陈水扁当总统还是马英九当总统，对台北人和台南人之间的未来是有一定影响的，但对福建人和辽宁大连人的影响就基本上没有。那麽你就可以想象，台北人和台南人就可以在一次又一次的参加选举总统的投票以后，就比较容易产生一种认识就是：我们台南人和台北人虽然有很多不同，但是是同一个共同体的成员；而我们跟大连人，跟东京人，跟夏威夷人都不一样，跟他们没有共同命运。也就是说，认同可以通过命运方舟或共同体的方式加以强化。而没有这样的关係，认同就不容易巩固，就容易流于形式。\n\n而帝国性的认同，像中国或者奥斯曼帝国这样，它继承了以前帝国的规模以后，它就有两个问题。第一是它的规模太大，跨度太大。共同体越大，集体行动的难度就越高，彼此之间的个别成员就特别难以感受到相互之间有共同的利益关係。这是所有大国都共有的困境。荷兰的阿姆斯特丹人和莱顿人之间比较容易感觉到彼此之间的亲缘关係，但是莫斯科人和喀山人之间就不大容易感受到他们有什麽共同利益。另一个问题就是，帝国的族群差异性太大，而且政体上讲多半是不民主的，依靠一个凌驾于各族群之上的政治精英集团来统治的。因此大多数帝国统治下的居民感觉不到政治参与跟他们的利益有什麽关係。而没有政治参与，即使是纸上的认同，也容易流于虚化，不容易建立。所以在近代民族国家建立的过程中间，像奥斯曼主义、大俄罗斯主义和大德意志主义这样的意识形态，这样的可以说是帝国认同，不容易站得住脚，很容易溃败，这些帝国最后都解体了；而小规模的认同，像波兰认同、希腊认同、爱沙尼亚认同这样的小规模的共同体认同，一旦建立起来就相当的坚固，冲突会加强它的认同坚固性。\n\n所以从1848年到现在，最近世界上的历史，基本上是大的帝国倾向于解体、而小的新兴的民族国家不断产生的过程。其实东亚在这方面是最晚的一步，东欧的几个大帝国，其实在1848年以后，一直到二十世纪中叶已经完全解体，把欧洲中部和东部变成一个小国林立的世界。奥斯曼帝国灭亡以后，中东也经历了同样的过程，把中东变成一个小国林立的世界。其实呢，跟大清帝国寿命相同、和大清帝国同时代存在的各大帝国，其实现在都已经全部灭亡了，只有大清帝国目前还留着一个继承国。现在的土耳其继承奥斯曼帝国的程度很低，现在的中欧各国继承神圣罗马帝国的程度也很低，但现在的中国继承大清帝国的程度很高。你也可以说是，其实特殊之处不在于世界，而是在于东亚。东亚现在的格局就很像是一个近代化没有完成、而民族国家建构没有走完的一个中间状态。世界上大多数地方已经经过了长期的痛苦和血腥以后，已经走完了这条道路，大体上进入了民族国家的世界；而东亚呢，大清解体以后，重建国民共同体的工作至今还没有走完，而且前途还未定。「我是哪一个共同体成员，我应该建立怎样的共同体」的问题现在仍然悬而未决，仍然不比梁啓超所在的那个时代更容易解决。\n\n主持人：现在其实有一个很有趣的议题，我再解释一下台湾的这个变化，这个变化特别是发生在现实层面，像拿中华民国护照到美国是免签证，这两天又多了一个，持这个护照的人，在美国的定义底下，可以用电子快速通关，完全不必对人审查，自己跟机器扫描一下就过了。这个发生了以后，就使得更多人认为，如果你是中国人的话，不会有这个待遇。所以这时候对所谓的「中国人」跟「台湾人」的切割线，会因为入境美国这个事情产生极大的一个影响。不过，在台湾有另外一个部分，在野的绿营的人也曾经提过，不如不要谈「中国」了，还有一个词叫做「中华民族」，似乎好像比较柔性一点，比较不是那麽紧张，就跟护照是没有关係的，所以有文化这样的一个定位，就产生了有关「中华民族」的讨论。也发现中共最近开始利用「中华民族伟大复兴」诸如此类的名词在开始讲，所以又引起台湾开始警觉，说「中华民族」到底是什麽。刘老师你怎麽看「中华民族」呢？\n\n刘仲敬：中华民族，你按照安德森那种理论，那就是一个典型的官方民族主义(official nationalism)。它设计的目的跟大俄罗斯主义和奥斯曼主义是一样，就是要在多族群构成的前现代帝国当中培养出一种超族群的认同感。当俄罗斯帝国、奥斯曼帝国和大清帝国这样的多族群帝国进入近代世界的时候，它马上就会面临着一个认同问题。它如果始终是停留在前现代世界的时候，它是不需要臣民的认同的，它只需要效忠和统治就足够了。但是近代的欧洲核心国家，它要强调认同和共同体概念，于是这些后发的帝国就不得不在自己的境内培养认同概念，否则它不可避免要面临着这种情况，它境内的各个族群，一旦产生出自己特殊的认同的话，那麽帝国就要解体了。像奥斯曼帝国，它就必须说，它境内有希腊人，也有阿拉伯人，也有土耳其人，如果是希腊人认同欧洲超过认同奥斯曼怎麽办呢，那帝国岂不是要失去希腊？如果阿拉伯人认同麦加超过认同君士坦丁堡，那麽帝国岂不是要失去叙利亚？如果亚美尼亚人认同东正教的莫斯科超过认同君士坦丁堡，那麽帝国岂不是要失去亚美尼亚？那麽解决问题的办法是怎麽样呢？其中的一种方桉就是建立一种官方民族主义，也就是说，以现行的帝国边界为依据，把帝国边界裡面的所有族群都强行捏合为一个假定的国族共同体，希望用一种人为的方式，把本来没有亲和力的各个族群给糅合起来。也就是说，你们亚美尼亚人、希腊人、阿拉伯人、土耳其人，今后全都是奥斯曼民族，这就叫奥斯曼主义。同样也有大俄罗斯主义，也就是说，俄罗斯帝国境内的波兰人、格鲁吉亚人、乌克兰人和其他种种人，你们全都是大俄罗斯人，你们原有的族群身份都不重要。\n\n同样，中华民族就是同一种建构方式的产物。梁啓超发明的中华民族这个概念，就是因为他跟革命党论战的时候，提出了一个大清应不应该解体的问题。革命党，我们都知道，孙文也好，汪兆铭也好，章太炎也好，他的立场就是，为了扬州十日嘉定三屠的缘故，我们一定要打倒满洲来的皇帝，满洲来的皇帝不是我们自己人，我们要把他们赶出去。梁啓超要求实行君主立宪制，要求保留大清皇帝的统治，他的论证就是这样的，如果你们真的把皇帝推翻了的话，那麽不可避免要发生解体和战争，为什麽呢？因为大清皇帝，他并不仅仅是十八省的皇帝，并不仅仅是苏州的皇帝，他同时也是蒙古、满洲、回部、西藏和其他各个多族群的皇帝，这就跟奥斯曼帝国和俄罗斯皇帝有多元身份一样，你把大清皇帝打倒了，这个不要紧，那麽你要问一问，你要不要满洲蒙古这些地方，要不要让满洲蒙古这些地方统统建立独立国家？如果你的意思是这样的话，那你实际上就是要大清解体，而大清解体以后，各个继承国之间，不可避免的，根据欧洲经验和历史上的其他经验一样，帝国解体以后建立起来的各个继承国不可避免要通过战争来解决问题，何况外面还有欧洲列强，那麽你可以想象，这些继承国必然是各自在列强当中寻找自己的靠山，然后你打我我打你，那麽东亚的流血就要不可避免了。梁啓超建议，为了避免东亚的流血，我们最好是不谈满汉矛盾，不谈族群矛盾，我们乾脆就以大清帝国的现有的边界为标准，把大清帝国裡面居住的各种居民，无论你是穆斯林也好，还是藏传佛教的信徒也好，还是儒家信徒也好，还是朝鲜人也好，我们统统不管我们原有的族群差异，我们一概认同自己是一个新的中华民族，把大清帝国改造成为新的中华帝国，实行君主立宪制，把大清皇帝改变成为中华帝国的立宪君主，这样一切问题都解决了，我们可以不经过流血而文明的进入现代世界。\n\n我们都知道，梁啓超和革命党的冲突并不是依靠嘴上和理论上的正确性来解决的，而是依靠武力来解决的。无论如何革命是爆发了，战争是爆发了，大清帝国是解体了。大清帝国解体以后，中华民国的几十年以及对日本和苏联的种种战争和冲突，其实归根结底还是一个认同的问题。大清留下的这个摊子应该怎麽样重组呢？是不是还要按照梁啓超时期的中华民国重新组合起来？还是乾脆就让日本人去建立满洲国，让苏联人去建立蒙古国，我们不管他了，各人去建立自己的国？最后的结果就是，无论理论上谁优谁劣，但是最后的结果是，蒋介石和他的政府认为，宁可把南京和上海打烂，也决不能放弃满洲，付出一切代价都要维护大清帝国留下来的这一片江山，于是就产生了第二次世界大战和1945年这个版图。这个版图实际上可以说是恢复大清帝国遗产的一个非常惨烈的企图。你注意世界历史，就可以看出这样的企图是非常特殊的。凯末尔在革命成功、建立了土耳其以后，他干的第一件事情就是放弃奥斯曼帝国的其他各地，让希腊人也好叙利亚人也好其他地方的人也好，爱咋咋地，他只在土耳其核心地带建国。俄罗斯也好，神圣罗马帝国也好，在近代化的过程中都走上了这条路。只有中国是例外。只有中国在除了外蒙古这个特殊例外以外，大体上採取了不惜一切代价恢复和维持大清版图的路线。也正是因为这一点，所以它目前仍然没有办法进入近代世界。\n\n所谓国强民弱就是这个道理。你刚才已经提到，台湾人，可以说是，他跟美国不能派出大使，只能派出代表，只能建代表处不能建大使馆，但是台湾人到美国去是一点儿问题都没有的；而中国人在这方面，儘管北京在华盛顿有正式的大使馆，而且还有核武器，好像在军事和外交层面上能够跟美国做有效的交涉，但在国民这个层面上，普通的中国公民要凭着中国护照到美国却是千难万难。好像中国国民没有进入现代世界，而中国的政府倒是进入了；而台湾呢，台湾儘管在政府层面上受到歧视，而台湾的国民却是理直气壮的进入了现代世界。这个其实也是有原因的，就是中国为什麽能够有核武器和其他东西？这一切不是免费来的，它有赖于中国政府能够有效的汲取中国社会的各种资源，把它用于军事和外交层面，而这个汲取机制迫使普通的百姓没有办法发展现代社会所必要的那些经济文化生活，没有办法享有西方民主国家社会理所当然的那些权利。如果他们都有了这些权利，第一，拥有这些权利的国民必然的会把大部分财富用于改善自己的生活，而不会用于搞核武器或者是搞富国强兵那一套；第二就是这些居民必然的会更多的重视自己的文化特色和地方认同，大清帝国的版图能不能保持都很成问题。直截了当地说，中国一方面要保持大清帝国的版图，又一方面要做一个军事强国，就只能牺牲它自己的国民；而台湾则是走上了相反的道路。\n\n但是中国这条道路也是一个死胡同，因为只要你自己的国民永远处在一种置外于世界的道路上，无论你有多少核武器，你都不是国际社会体面的一员。朝鲜有了核武器，难道说它就会变成一个像样的现代国家麽？显然没有。所谓是「落后要挨打，军事不强就不行」，这种说法其实是神话。中国走在这条路上，实际上也是把自己卡住了，使自己进不能进退不能退，无论你在军事上怎麽样讲大国复兴，但是你还是没有办法改变自己和世界主流文明的结构性冲突，它的问题其实比台湾问题要大得多。而台湾实际上在国民层面已经建立了，但是它在国家层面上没有得到适当的符号性的承认，这就是一个认同政治的问题。现在实际上是双方都已经进入死局了。按说的话，武断的搞预言是不恰当的，我只能说是，根据十九世纪以来的历史经验，近代转型过程中间，多族群帝国向民族国家进行转型，出现这样的死局，一般来说是很难有善果的。东欧也好，西亚也好，出现这种情况的国家和地区在大多数情况下都是需要经过惨烈的流血才能够解决问题的，欧洲本身也是流了很多血以后才走到现在这一步的。\n\n(全文完)",
			"added": 1542013702,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}