{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1568464993,
			"title": "having trouble with cors",
			"body": "hi, im trying to add a flutter for web app to zeronet, but im having trouble with cors.\nthe app tries to import fonts using xmlhttprequest, but it throws a cors error.\nAccess to XMLHttpRequest at 'http://127.0.0.1:43110/1KPSCaLCzggWWuuYpHv1Lb3dVkeStvUnJr/assets/FontManifest.json' from origin 'null' has been blocked by CORS policy: No 'Access-Control-Allow-Origin' header is present on the requested resource.\nand this ends up crashing the entire thing.\nim not really sure what to do (can i just enable cors somewhere???), but any help would be appreciated!",
			"added": 1568464992
		},
		{
			"topic_id": 1573489058,
			"title": "list of id zites?",
			"body": "im working on a zite of my own, and i want to allow any sort of zeronet id to work there.\nis there a list of id-zites anywhere, so i could add all of them to my zite? would be really helpful, thanks!",
			"added": 1573489056
		},
		{
			"topic_id": 1574635546,
			"title": "is it just me or is zeronet domain registration broken rn",
			"body": "i've been waiting like. 5 days to get my domain registered but im pretty sure the blockchain zeronet uses for namecoin is broken\nis it just me or did i actually screw up registering my domain (not sending the actual domain name in case i did and someone can joink it from me)",
			"added": 1574635543
		}
	],
	"topic_vote": {
		"1568464993_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": 1,
		"1573489058_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": 1,
		"1573477450_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1574635546_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1568464993_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": [
			{
				"comment_id": 1,
				"body": "> [filips](#comment_193_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): ZeroFrame API also provides method monkeyPatchAjax which automatically patches fetch and XMLHttpRequest to add ajax key.\n\n> [glightstar](#comment_154_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You can either use the wrapperGetAjaxKey-cmd or the fileGet-cmd.Both methods require you to change the code of your exported app (or at least inject / overwrite the necessary things (e.g. fetch or XMLHttpRequest) (which could also be done outside of the exported code if that does not have any polyfills)). [...]\n\nhmm, i tried getajaxkey... which just gave me undefined, not very useful. or if i wrapped it as a function... it just never ran.\ni also tried monkeypatchajax... which also just gave me undefined :x\nfileset would be hard to implement as this is all minified js im working with, but why i just get undefined is a better question. am i just being stupid?",
				"added": 1568479847
			},
			{
				"comment_id": 2,
				"body": "> [glightstar](#comment_156_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Those cmds are from ZeroFrame.If you create a new zite, it will have js/ZeroFrame.js. Check the default index.html on how to set-up the basic stuff (or the docs, I guess). [...]\n\nyeah, i did do a page = new ZeroFrame() in the function and used that.\n...well, it doesnt seem to help, doing page.cmd(etcetcetc\nwhen i actually do the command... it just stops responding, or gives me undefined.\n:x\ndo i blame the weird flutter web stuff here, or am i being retarded?\n\nheres the code.\nnot very readable, sorry. :x\n\nTW:function(a,b){var u=W.fb,t=new P.T($.K,[u]),s=new P.bq(t,[u]),r=new XMLHttpRequest()\npage = new ZeroFrame()\npage.cmd('wrapperGetAjaxKey', {}, (ajax_key) => {\nconsole.log(ajax_key);\nC.op.LH(r,\"GET\",a+\"?ajax_key=\"+ajax_key,!0)\nr.responseType=b\nu=W.fu\nW.ij(r,\"load\",new W.yI(r,s),!1,u)\nW.ij(r,\"error\",s.gIO(),!1,u)\nr.send()\n});\nreturn t},",
				"added": 1568483048
			},
			{
				"comment_id": 3,
				"body": "> [glightstar](#comment_157_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You can use ``` in markdown around pieces of code to format. [...]\n\nyeah, i would if i had it. blame dart2js. (im assuming code that isnt javascript in the first place isnt very helpful, either..?)\nthanks for the formatting tip, though! (didnt even know we had markdown here... but then again i started using this. today. so excuse me >.<)\n\n> [gitcenter](#comment_990_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This is the correct key. Run this code before all scripts: [...]\n\nwell, i tried this before (slightly diffrent code-wise though.)\n... and this still gives me a 403  \n```GET http://127.0.0.1:43110/1KPSCaLCzggWWuuYpHv1Lb3dVkeStvUnJr/assets/FontManifest.json?ajax_key=undefined 403 (Forbidden)```  \nyeah.... same thing. :x",
				"added": 1568484255
			},
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_997_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @mininin: Ping.\n\n(i was asleep >.<)\nwell, that did seem to do the trick though!\n\nthank you very much, being new to this is kinda confusing, but i bet ill figure the rest out in the future c:\n(also, go check out one of the first flutter apps on zeronet, i guess? :)",
				"added": 1568537200
			}
		],
		"1573477450_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 5,
				"body": "honestly, i wouldent mind even if it was just an electron app that runs the zeronet python for you (maybe proxied so it only works in the electron app?) and blocks clearnet connectivity (with a toggle for that since some zites rely on it)\nim gonna stick with just using chrom* myself, but i wouldent be suprised if new useres would enjoy this",
				"added": 1573489442
			},
			{
				"comment_id": 7,
				"body": "> [filips](#comment_299_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): No. Creating any decentralized project using browser engine from the biggest world corporation makes no sense! [...]\n\nwell, what else are you gonna use, firefox? :^)\nand unlike... you know, just using chrome. this doesnt come with all the botnet, thankfully. (at least i'd assume so, as its just using the engine from chrome)\nso its not the end of the world?\nbut hey, nobodys stopping anyone from making the same app using firefoxes engine instead, i've heard its pretty decent as of recently.",
				"added": 1573491729
			}
		],
		"1573489058_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": [
			{
				"comment_id": 6,
				"body": "> [filips](#comment_297_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): \"peak.id\": [ \"1PEAKf9wJLTEEFAsQpLeLioWfY1f8pvFhD\" ], \"polar.id\": [ \"1PoLARzautbsqCix1aia8jYN55JmPqGeFt\" ]\n\nthank you!\ni had this one that wasnt included:\n\n```\n   \"zeroverse.bit\": [\"1HPgDoReCFtE9qy71hnp55ksBVvV1gHJLQ\"],\n\n```\n\nmaybe i should make a site to collect these..?",
				"added": 1573491286
			},
			{
				"comment_id": 8,
				"body": "> [glightstar](#comment_172_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Quite sure that ZeroVerse is not being maintained anymore (I believe it was run by erkan, who hasn't been active on ZeroNet for two years or so now)\n\nhmm. question is if it still works, i suppose (and well, i would find out, but im too lazy to use bitmessage :^))\ncause unmaintained != working",
				"added": 1573502116
			},
			{
				"comment_id": 9,
				"body": "> [filips](#comment_306_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I think that registration also doesn't work anymore.\n\ndarn. guess ill remove that one then, thanks!",
				"added": 1573507658
			}
		],
		"1574635546_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": [
			{
				"comment_id": 10,
				"body": "> [mg0](#comment_176_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I don't know about namecoin .bit based domains, but gitcenter keeps Name.YO domain name service too, it's still less used than .bit addresses but it works.\n\noo, well got that registered then! thanks!\n(can i use that as a domain in the zeronet contents.json?)\n\nedit: actually, i realized it'd just be easier to find out.. and yes, it does work!",
				"added": 1574637818
			}
		]
	},
	"comment_vote": {
		"154_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"193_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"297_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1
	}
}