{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1516127143,
			"title": "Have you heard about Scuttlebot?",
			"body": "I just bumped into it and it seems incredible. It is also focused on decentralized web, basically a decentralized social network, but can also run git on top and who knows what more. It seems to have larger and more varied community than ZeroNet. But the most impressive thing I noticed during these couple of days of studying it is the synchronization algorithm (gossip). I think ZeroNet could take some inspiration from that, it might be useful for handling larger amounts of people.\n\nWhat do you think? Is there an overlap of ZeroNet and Scuttlebot?",
			"added": 1516127142
		},
		{
			"topic_id": 1517172421,
			"title": "The movie The Man From Earth: Holocene is on piratebay uploaded by the director",
			"body": "quote:\n\nMessage from the director.....:\n\n Thanks for taking the time to watch our new movie, \"The Man from Earth: Holocene\".\n\n In order to make sure that every single person in the world who wants to see the \n movie has access to stream or download it, we are uploading it ourselves to the \n filesharing community.\n\n But just because the movie may be free to watch, it wasn't free to make.\n\n That's why we're so grateful to all of you who visit http://www.ManFromEarth.com \n and make a donation -of any size- if you've watched the movie without paying for \n it up front.\n\n It's a revolutionary global experiment in the honor system. We're asking people: \n \"If you watch our movie, and you like it, will you pay something directly to the \n people who made it?\"\n\n Please share *ONLY THIS FILE* and don't make any edits or changes. Also please \n don't post the movie to YouTube, or to any other for-profit sites where a third \n party could charge people to see the movie. That would not be fair, or in keeping \n with the spirit of what we are trying to do by sharing the movie with everyone.\n\n Once again, we thank you for your support, and I hope you enjoy: \n \"The Man from Earth: Holocene\".\n\n..... Hell yeah, finally. So with no shame, torrent away: magnet:?xt=urn:btih:43ea40f3233c786f834d0c0477a3c79a98eebe62&dn=The.Man.from.Earth.Holocene.2017.1080p.BDRip.x264-UNiVEARTH&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969\n\nWhere you can donate Bitcoin: http://www.manfromearth.com/index.php",
			"added": 1517172419
		},
		{
			"topic_id": 1523809606,
			"title": "ZeroNet + SSB + sneakernet = ...",
			"body": "Who wants to go with me to Africa to build a zeronet and ssb over a DIY low tech internet? http://www.lowtechmagazine.com/2015/10/how-to-build-a-low-tech-internet.html",
			"added": 1523809603
		},
		{
			"topic_id": 1525516596,
			"title": "Data Mining and AI for growing plants",
			"body": "I think, that if the same amount of effort, that went into Cambridge Analytica Facebook data mining, went also into the research of how to grow food efficiently, there would be no hunger anywhere in the world. It's just that people want to share kitten photos more than eat.\n\nIt's surprising that after thousands of years of humans trying to control nature to grow food, and now in a time when we finally have the technology to capture and make sense of all the necessary data, the knowledge about growing food is still mostly based on \"I'm growing this because my father did that\", or \"The sales person told me that this fertilizer works best\" or \"Everybody else is doing it\". Yes, there is probably some real research in large corporations like Monsanto, but that is mostly focused on making more money.\n\nWhy don't we have the knowledge about growing your own carrots on your own backyard widely accessible? And I mean only the knowledge that is verifiable, proven to work, exact, not like \"water it enough, but not too much\". I mean \"it grows best in pH 6 soil, watered with 60ml of water every one hour at temperature 23degrees for the first two weeks of the growth, then ....\" - basically everyone who is growing anything has to discover these data again and again for themselves, and nobody actually compares them. They take it as business secret and it mostly works only for their specific scenario. If we knew as much about growing our own food as we know about facebook users, nobody would be hungry, or even dependent on big companies or governments. With such data it would be easy to automate gardening with a couple of arduinos.",
			"added": 1525516592
		},
		{
			"topic_id": 1525521049,
			"title": "WiFi hotspot with Lightning Network payments",
			"body": "more people need to know about this: https://github.com/araspitzu/btc-hotspot",
			"added": 1525521044
		}
	],
	"topic_vote": {
		"1513318374_19XFf6TuhmvRZdo5JaiG5uDNH72SUx3Dm": 1,
		"1518177009_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1
	},
	"next_comment_id": 29,
	"comment": {
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "how does gitcenter handle conflicts? if one person makes a commit and push to his local git repo, and another user makes the same, git will not see it as a conflict.. and zeronet would take the last change and just overwrite the first one.. am i missing something?",
				"added": 1513698352
			}
		],
		"1513708677_1MAW8GkYe2d3xDVC3XkRTmmLQjWbQMDDms": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_326_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Avoid the RSA algorithm.\n\nWhat is wrong with RSA?",
				"added": 1513763576
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_328_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I mean the algorithm. Search \"RSA insecure,\" \"RSA weakness,\" or \"RSA backdoor\" under News. [...]\n\nAfter some reading I couldn't find any discovered weaknesses against RSA. The textbook raw implementation has some well known attacks, but the actual implementations protect from those by padding. The length of the key is still crucial because of large number factorization and Moore's law. And quantum computers would totally destroy RSA using Shor's algorithm. So I guess unless you are worried your enemies have a usable quantum computer, you should be safe with RSA.\n\nBtw the paper about second private key seems to be a non-issue, according to more knowledgable people than me discussing it on reddit and google plus..",
				"added": 1513956482
			}
		],
		"1514037933_1AWmDPJBYVGXKfNwKvkSFZmbqRu1eeVQTi": [
			{
				"comment_id": 4,
				"body": "Isn't ZeroTorrent kinda dead? All I can see there is the Add new torrent form, but no way to close it, no way to see the lost of existing torrents.. or is it just some problem on my side?",
				"added": 1514293390
			},
			{
				"comment_id": 5,
				"body": "> [solved](#comment_4_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu): All I can see there is the Add new torrent form\n\nok, so that problem only appears on mobile. Still a stupid problem though. Oh well..",
				"added": 1515149048
			}
		],
		"1516127143_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_98_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): *Scuttlebutt\n\nyeah, it's a Secure Scuttlebutt protocol, but the website is scuttlebot.io so.. go figure ;-)\n\n> [jetten](#comment_1_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e): It appears Scuttlebot is more of a Friend-to-Friend network, ie you have to exchange keys with the people you want to communicate with, am I right? You can't just open the application and start participating in conversations immediayely like you can do here.\n\nthey have a thing called Pubs which is a bot user on a public IP. Some of them are open for public invitations, so you can start by adding them and you will find all of the other content through them. I found hundreds of topics just from a single pub. And here is also an interesting comparison with ZeroNet - in scuttlebutt you have a limit of the depth of \"friends of friends\" that you automatically download.. so if I'm connected to a pub, and Bob is also connected to the same pub, I will see his messages, and also his friends, but not his friends of friends because that's too far for me.. this saves space on my disk, but still retains enough copies to propagate reasonably through the whole network. I think ZeroNet might have a problem in the future if there are much more people and much more data.",
				"added": 1516149912
			}
		],
		"1517054791_1EuT1xTvpQwafm2SPcHktaac73ufKsZ3Sm": [
			{
				"comment_id": 7,
				"body": "rockets to mars don't actually burn that much fuel.. not nearly as much as planes or cars.. also, rockets don't really have any other choice until we invent some kind of powerful electric vacuum propulsion. Yet, we do have electric cars, and electric planes are just around the corner. But then again, we have Trump.. increasing the price of solar, promoting coal companies, allowing offshore drilling of oil.. Musk is doing the biggest amount of work towards solving climate change one man can ever do. His rockets would eventually make their own fuel out of atmospheric carbon dioxide, so effectively zero emission\n\nBtw have you seen the youtube video \"Rules for rulers\"? Talks about dictatorship vs democracy and how both can be equally good or bad..",
				"added": 1517172024
			}
		],
		"1517172421_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 8,
				"body": "the director himself even reads an extended version of this text in the first minutes of this video file, so it is 100% legit",
				"added": 1517173168
			},
			{
				"comment_id": 9,
				"body": "i mean.. i fully expect this second movie to be a pile of shit.. but the first one was legendary and i might even send them something just for that",
				"added": 1517173736
			}
		],
		"1517558605_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 10,
				"body": "> [samp](#comment_11_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5): crypto tokens can be easily given to a content author or provider..\n\nsounds like Steemit",
				"added": 1517671528
			}
		],
		"1520606515_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 11,
				"body": "I think the general public will never accept an AI bot, unless it has some of the \"treacherous, backstabbing\" nature. People actually want to be hurt in the familiar ways. They don't want pure perfection. That's what people are.. stupid.",
				"added": 1520834612
			}
		],
		"1523475161_1QKa66eEpXh6bTGPA1HAFGmNBnC53oCxZZ": [
			{
				"comment_id": 12,
				"body": "a message like this is a reminder that even ZeroNet might become a tool for the russian troll army. We have to be careful, learn critical thinking. Try starting with the \"CRAP test\" - currency, reliability, authority and purpose.",
				"added": 1523804537
			},
			{
				"comment_id": 13,
				"body": "ha.. called it: https://www.axios.com/russian-bots-increase-2195bf68-567c-4466-a705-17e69d4b6cad.html",
				"added": 1523847705
			}
		],
		"1524280296_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 14,
				"body": "Scuttlebutt",
				"added": 1524395888
			}
		],
		"1523809606_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 15,
				"body": "SSB - Secure Scuttlebutt - decentralized app (similar form to zeronet) - built for offgrid communities, sailors etc. It basically syncs your posts with other people posts (and other peoples' friends) when you are close to them (or using the same \"hub\"). This way the posts propagate like a gossip. No central location necessary. It has some interesting properties, which would be perfect for the low-tech internet - imagine a motorbike taxi driver carying a raspberry pi with a small wifi access point on his bike, and SSB installed on the pi. Wherever he goes, people can connect to the wifi, automatically their own SSB clients would download new posts from the pi and upload their own cached posts. The guy would move from village to village, making facebook-like messaging kinda like a digital postman.",
				"added": 1524396224
			}
		],
		"1525516596_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 16,
				"body": "theanswerer0 - say hello to my mute list, you racist idiot",
				"added": 1525729276
			},
			{
				"comment_id": 17,
				"body": "> [ssdifnskdjfnsdjk](#comment_247_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): maybe it is hard to give exact recipe because of the different types of the soil ...\n\ni hope there are more \"types\" of people, than soil.. yet cambridge analytica was able to find a way to control those types, learn details about them, use them.. i just think we could start doing that with soil now, for a change",
				"added": 1525729840
			}
		],
		"1526399646_13eAqDw564Ut7PKZnmrCHeMUKc8PQk4Xaj": [
			{
				"comment_id": 18,
				"body": "increasing number of russian trolls here on zeronet.. bashing jews is in fashion there again?",
				"added": 1527096432
			}
		],
		"1524948467_1Epxa7SJuXtrTQgTZsgxSyudBQyvs33wh8": [
			{
				"comment_id": 19,
				"body": "can i somehow display the list of people who upvoted this post? i want to mute them more effectively",
				"added": 1527096744
			}
		],
		"1529178927_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 20,
				"body": "it seems it should work normally. Tails already has TOR, so you don't need to run another TOR within zeronet. The github issue says they made it work in the end",
				"added": 1529243807
			}
		],
		"1529456113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "> [doiasedfnasnedcp](#comment_3_1EijxsAumeeuw6ojPjHc9KKwUfH6ryhbJc)\n\nwell.. that's a nice reason to NOT separate them in the first place, don't you think? Wonder whose idea was that..",
				"added": 1529742095
			}
		],
		"1530873258_1B6sqsG3NZefF44y9TREmf3UqjBDD3KWFW": [
			{
				"comment_id": 22,
				"body": "the identity is saved in user.json file inside the data directory. Just back this file up somewhere else, then visit the zeroid site with user.json deleted and you will generate a new identity, new user.json. Switch them as needed. Just don't lose them, there is no way to recover them.",
				"added": 1530964013
			}
		],
		"1535633348_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": [
			{
				"comment_id": 23,
				"body": "\"freedom of speech\" has also become a very misused term, associated with excusing hatespeech or being racist or troll.. I think we should start providing other arguments too, like for example the need for a baseline privacy. I don't want other people or companies to see which websites I visited just like I don't want them to see me sitting on a toilet. And because current internet is poisoned with trackers I have to use TOR. Hell, I'd even use TOR for buying plane tickets, that way they couldn't match my searches with what I searched for yesterday and raise my prices. It's not only about free speech. Plenty of stupid people don't care about free speech, but they would understand the toilet argument...",
				"added": 1535790120
			},
			{
				"comment_id": 24,
				"body": "> [d14na](#comment_13_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): +1 [...]\n\nyeah, that's how they are trying to give you a feeling of urgency so that you rather buy now than wait and search more elsewhere. Also people often believe, that prices of plane tickets stay at some level for a while and then start rising before being ridiculously high day before take off. So when they see an increase, they think the rising has already started and expect only higher prices to come. Funny thing is I've been able to buy tickets one week before take off for the same price as one year before take off.. and sometimes they even drop on the last day if the plane is not sufficiently sold out yet",
				"added": 1536162878
			}
		],
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 25,
				"body": "> [sheendocks](#comment_25_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): I support him but wish he'd though about the optics a bit more and walked out calmly than the struggle we saw.\n\nIf optics mattered, he wouldn't be arrested in the first place. Bitcoin donations to wikileaks skyrocketed, public has the optics clearly figured out. But these big boys don't care how obvious they make it. 3 billion euro can cover a lot.",
				"added": 1555003705
			},
			{
				"comment_id": 26,
				"body": "> [deadfwd2018](#comment_11_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr): Spend a trillion dollars on intelligence work then have some tranny leak the shit to some dick on the internet... yes, lets protect the dick? wtf? I, in no way like ANYTHING in the leaks, but we paid for that shit in the USA. F* him.\n\nmaybe you shouldn't have paid for THAT shit. Because what he leaked were war crimes of the US army, not some trillion dollar intelligence work. Trillion dollar operation to cover their fuck-ups maybe. Do you enjoy paying for that?",
				"added": 1555513257
			}
		],
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": "> [quantumworld](#comment_477_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): The U.S. Is a Republic B.T.W.  Just a reminder.\n\nthe US is an aristocracy, open your eyes",
				"added": 1559201394
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 28,
				"body": "> There's no excuse for violations of the law\n\nIn fact in the real world there are very many reasons to violate the law. Such as when the law is corrupt, created by corrupt talking heads, paid by corrupt lobbyists. And so called copyrights are just one of the examples.",
				"added": 1567776951
			}
		]
	},
	"comment_vote": {
		"5_1gJPRbL7puiekYd32rYVuCkELC43bCsY9": 1,
		"119_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1,
		"77_1LUy9iAxeWsj1DP5L8V17Yb2vo87FucjgD": 1,
		"120_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"2_1H72g5YeBn4DyLQT9bKeFkt4LnZHzyonvn": 1
	}
}