{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Новости мира криптовалют и финтеха",
			"body": "А так же все связанное с технологиями блокчейн и децентрализованными автономными организациями.",
			"added": 1458029007
		}
	],
	"topic_vote": {},
	"next_comment_id": 95,
	"comment": {
		"2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 1,
				"body": "Как минимум, тут нет рекламы и назойливых всплывающих окон с предложением зарегистрироваться чтобы читать.",
				"added": 1457056106
			},
			{
				"comment_id": 2,
				"body": "> [dude](#comment_4_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): ну это пока нет\n> по сабжу: твиттер - микро-блоги. т.е. когда все твои мысли односложные и вмещаются в 140 букв. а в остальном один хрен. И кстати у твиттера давно есть свой распределенный аналог - twister.\n\nКогда я пробовал твистер, оно мне показалось не очень удобным. Во всяком случае мне ZeroNet кажется намного более приятным и удобным в использовании. С авторизацией сделано очень удобно, традиционный web начисто сливает.",
				"added": 1457105239
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "> [shift](#comment_86_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): пора думать о модерации/блокировках на примере @request\n\nУ меня такое предложение, если конечно это не сложно реализовать. Можно ввести target(сложность) для открытых адресов новых пользователей. Чтобы создание адреса/id занимало время. Тогда банить будет быстрее, чем создавать новые аккаунты. A target же менять в зависимости от условий. Поднимать во время наплыва. \n\nНасчет самой модерации у меня есть тоже идеи, как сделать все более правильно. Но это уже более сложно будет. Хотя в перспективе это дает лучший принцип модерации, чем сейчас популярен в интернете.",
				"added": 1457105705
			},
			{
				"comment_id": 7,
				"body": "> [splitfire](#comment_1_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): Кто знает, русские торренты в зеронет завезли?\n\nА так ли надо. Торрентов в интернете хватает. Если всё подряд сюда нести, то, к примеру, база рутрекера более 4 Гб. Другое дело - небольшое и хорошо оформленное, вроде Play. Но это всё равно не интересно. \n\nМожешь зайти на zerotorrents и добавить русский торрент туда. Будут тебе в зеронете русские торренты.",
				"added": 1457166692
			},
			{
				"comment_id": 8,
				"body": "> [shift](#comment_97_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Поиск как такового тут нет, как некий список есть http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F  \n> Ну и вообще сайтов тут не так много в данный момент, из популярных форума, имиджборда ну и play\n\nNamecoin-домены - это хорошо, но не нужно ограничиваться ими. Я в общем не разделяю подхода имен. Вот есть место где публикуют ссылки http://127.0.0.1:43110/0list.bit, вот подобие поиска http://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF, и ещё http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba, и ещё http://127.0.0.1:43110/163ZAwi5BcGBm6UEwdJF1pkcejDMCT1kAj.",
				"added": 1457174972
			},
			{
				"comment_id": 10,
				"body": "> [shift](#comment_94_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Логично было бы такие сайты как рутрекер при переносе сюда дробить на подразделы.\n\nДа, это самый правильный подход. Вообще, в ближайшее время, как мне кажется, нужно делать такие форумы, но только более узкой тематики. Это удобно, потому-что и объем меньше, и модератор на каждый свой. А так как тут ZeroID везде принимается, то проблем никаких. А блоги больше для персональных страничек. И новостные сайты если и переносить, то лучше в виде блога.\n\nВообще, я бы назвал ZeroNet ещё и как Zero cost network (почти). Пока твой сайт интересен другим пользователям, тебе это ничего не стоит. Не нужно оплачивать содержание сервера, покупать домен. А потом думать как же отбивать траты и монетизировать ресурс через рекламу. Потому, надеюсь, что здесь реклама никогда в том виде, в каком она существует в интернете не появится.",
				"added": 1457177475
			},
			{
				"comment_id": 13,
				"body": "> [shift](#comment_106_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Если будут новостны издания - в любом случае будет реклама, зарплату чем-то платить надо. \n\nВот отсюда все проблемы. Таких новостных изданий не надо. Если человек пишет за зарплату, то лучше бы вообще он ничего не писал. Централизация не на сайтах, она в головах. Вот прямо сейчас здесь вам предлагается возможность держать сайты по принципу, пиши что тебе интересно и читай что тебе интересно. Но нет, надо же сразу стремиться притащить централизованные ресурсы по принципу: хочу общее место через где меня будут кормить информацией.",
				"added": 1457178595
			},
			{
				"comment_id": 14,
				"body": "> [splitfire](#comment_3_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): esteban: надо отдельный ник мутить и потихоньку магнеты, например, с рутора перетаскивать :)\n\nСкорее нужно удобное приложение для публикации торрентов. Чтобы было в виде небольших легких страничек тематической направленности. Анолог здешних блогов и форумов, только для торрентов.",
				"added": 1457178831
			},
			{
				"comment_id": 15,
				"body": "> [shift](#comment_110_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Потому, что не реализовали это разработчики и проще везде использовать единый ID, но можно и уникальный для каждого сайта.\n> \n> Не согласен, есть медуза которая торт, грани те же\n\nДля меня она не торт, в самом начале была разве что. Но я не понимаю с чем ты не согласен. Медуза и грани существуют в традиционном интернете, который диктует условия развития таких ресурсов. Аналог медузы здесь мог бы быть совсем другим.",
				"added": 1457178994
			},
			{
				"comment_id": 16,
				"body": "meduza.io и grani.ru",
				"added": 1457179206
			},
			{
				"comment_id": 17,
				"body": "> [splitfire](#comment_8_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): грани заблочен, а медуза - выглядит как простой новостной сайт или нужно копать глубже?\n\nДа нет, новостные сайты это и есть.",
				"added": 1457179341
			},
			{
				"comment_id": 18,
				"body": "Медуза так вообще просто агрегатор новостей.\n\n> [splitfire](#comment_9_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): а почему грани блочат?\nЧто-то отказались удалять. Обычное проявление цензуры.",
				"added": 1457179432
			},
			{
				"comment_id": 19,
				"body": "Рутрекер централизованный ресурс с большим доходом с рекламы. Он никуда уже неперебазируется.\n\n>начал двигаться в сторону i2p?\nНе знаю куда они там движутся. Они там не onion hidden service не осилили, ни даже .lib .bit домены.",
				"added": 1457179823
			},
			{
				"comment_id": 20,
				"body": ".bit регается через namecoin, .lib через emercoin, а не выдается и отбирается по желанию регистраторов.",
				"added": 1457180035
			},
			{
				"comment_id": 21,
				"body": "Вот и лор подтянулся.",
				"added": 1457182028
			},
			{
				"comment_id": 22,
				"body": "> [zeroatom](#comment_1_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Всем привет :) Как тут с анонимностью?\n\nАнонимность достигается с помощью тора. А так  нужно менять свой профиль /data/users.json, тем более не пользоваться одним из под тора и с реального IP. По оффициальному FAQ - не более анонимен чем биткоин. То есть по умолчанию анонимности нет, но при правильном использовании можно достичь.",
				"added": 1457189117
			},
			{
				"comment_id": 25,
				"body": "> [82456783](#comment_1_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): а теперь вы мне поясняете:зачем это нужно когда есть фринет\\и2п для анонимности и обычный интернет для кинца\\сайтов???\n\nКто тебе сказал что нужно?",
				"added": 1457200112
			},
			{
				"comment_id": 26,
				"body": "> [82456783](#comment_2_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): очевидно что проект создавался для чего-то. никто не будет тратить месяцы работы ради тупого клона обычного интернета, который умрёт когда всем станет скучно\n\nА зачем тогда спрашиваешь? В том же i2p не научились в распределенные сайты, ни в торе. фринетом не пользовался.",
				"added": 1457200384
			},
			{
				"comment_id": 27,
				"body": "> [82456783](#comment_3_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): так объясни мне зачем нужны распределённые сайты?\n\nНу вот ты держишь сайтик на телефоне, батарея разрядилась, и всё.",
				"added": 1457200556
			},
			{
				"comment_id": 28,
				"body": "> [shift](#comment_120_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Для опозиций пожалуй лучше i2p\n\nЭто очень ценный совет, с тем условием, что браузеры сейчас очень легко вычислить по их уникальности. В том же торбраузере даже изменение размеров окна уже легче тебя вычислить.",
				"added": 1457202482
			},
			{
				"comment_id": 29,
				"body": "> [shift](#comment_121_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Tails в помощь. \nВ нём есть защита от дурака? Видел попытки запустить на нём скайп.",
				"added": 1457203250
			},
			{
				"comment_id": 31,
				"body": "> [shift](#comment_127_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Срач то какой получился, я прям удивился, интересно от куда ты 82456783  к нам пришел? хабр? лор? просто интересно\n\nСкорее всего с сосача, там в это время форсили. Хотя на лоре и опеннете можно встретить похожих. И новость была на опеннете. Вообще он явно за этим и приходил, и может ему ещё тут понравится. С очередным баном по айпи, на своем ресурсе он будет здесь.",
				"added": 1457218454
			},
			{
				"comment_id": 32,
				"body": "Сслыка на EN-ZER0TALK ведет на FAQ",
				"added": 1457218525
			},
			{
				"comment_id": 33,
				"body": "У меня есть идея насчет этого, но просто так её не применить на текущемо форуме: это модераторские подписки. Как адблок, только на уровне модерации. То есть пользователи сами включают, если хотят.",
				"added": 1457218842
			},
			{
				"comment_id": 34,
				"body": "Сколько сейчас .bit домен стоит. У меня 2NMC завалялось, но не уверен, можно ли на это что-то зарегать и насколько.",
				"added": 1457218918
			},
			{
				"comment_id": 35,
				"body": "но против утяжеление же тут ограничение есть",
				"added": 1457218984
			},
			{
				"comment_id": 36,
				"body": "Можно по формату открытого ключа ограничить. Пусь Vanitygen'ом генерят себе, до посинения. Разумеется только в необходимых случаях.",
				"added": 1457219159
			},
			{
				"comment_id": 37,
				"body": "> [nippletwister](#comment_247_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Остается только моя ненавистная всеми тема - платные сообщения и рейтинги)\n\nПочему ненавистная. Я воспринимаю деньги в современном обществе не как средство обмена, а как защиту от недобросовестного использования. Не зря же кругом БОД пытаются пропихнуть. Так вот и тут. Да это плохо получается, но всё же.",
				"added": 1457219286
			},
			{
				"comment_id": 38,
				"body": "> [vlad20012](#comment_1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): как там cjroute\n\nНеплохо было бы поднять инфраструктуру узлов, чтобы прокинуть ZeroNet в гиперборею, хотя это может быть и не так просто.",
				"added": 1457219445
			},
			{
				"comment_id": 39,
				"body": "А как будет доступ к узлам, которые вне зеронета, нужны же промежуточные узлы.",
				"added": 1457219627
			},
			{
				"comment_id": 40,
				"body": "вне гипербории, хотел сказать.",
				"added": 1457219746
			},
			{
				"comment_id": 41,
				"body": "Какая же тут пафосная почта. Мало того, что на кнопке написано  Encrypt and send. Так оно ещё потом и в код Брайля анимированно переходит.",
				"added": 1457220947
			},
			{
				"comment_id": 44,
				"body": "Его сегодня толи в 0list толи ещё где-то опубликовали. Там ещё на один чат ссылка. http://127.0.0.1:43110/1CjR14fofbRJ54oj8A7rAfWpzpLawdP5uc",
				"added": 1457222501
			},
			{
				"comment_id": 45,
				"body": "Все, конец вашему зеронету http://127.0.0.1:43110/1FqhRosMouo37Z8iDpLTEPvfznBq1b4N4w",
				"added": 1457257865
			},
			{
				"comment_id": 46,
				"body": "> [zeroatom](#comment_45_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): поясните :)\n\nКогда megaupload закрыли, была такая табличка.",
				"added": 1457259000
			},
			{
				"comment_id": 50,
				"body": "> [shift](#comment_154_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7):  Ну табличку может любой и любую сделать\nВ рунионе мне доставляет. \"За вами выехали, и значек ФСБ\"",
				"added": 1457263349
			},
			{
				"comment_id": 51,
				"body": "> [splitfire](#comment_26_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): \n> тут уже сложнее, так как все русские трекеры жлобят свои базы\nРутрекер же не жлобит.",
				"added": 1457275373
			},
			{
				"comment_id": 53,
				"body": "> [splitfire](#comment_28_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): жлобит, либо ссылку на архив в студию \n\nhttp://rutracker.org/forum/viewtopic.php?t=4824458\n\nна самом видном месте, в разделе обхода блокировок.",
				"added": 1457275712
			},
			{
				"comment_id": 57,
				"body": "БОИНК РАБОТАЕТ, ВСЁ ТОРМОЗИТ НЕ МОГУ НИЧЕГО ПИСАТЬ В ЗЕРОНЕТ, ЧТО ДЕЛАТЬ?",
				"added": 1457283723
			},
			{
				"comment_id": 58,
				"body": "Вот тут биткоин-криптография, а мультисигнатуры возможны в дальнейшем?",
				"added": 1457390034
			},
			{
				"comment_id": 60,
				"body": "> [vlad20012](#comment_88_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Там какие-то заглушки в исходниках стоят на это счет, т.е. да, возможно. Но что-то моей моей фантазии не хватает понять, зачем это может быть нужно\n\nЧтобы можно было держать сайт сообща. Так допустим если одного прижмут, и потребуют удалить контент, то он один, без согласия других не сможет этого сделать. \n\nДругой вариант,  это в дальнейшем, в некоторых приложениях может потребоваться гарант, тогда это тоже могло бы быть на мультисигнатурах реализовано.",
				"added": 1457390897
			},
			{
				"comment_id": 61,
				"body": "Вот, уже есть демонстрация загрузки контента через ipfs. Нужен запущенный демон, чтобы работало. \n\nhttp://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:9:Streaming+with+IFPS",
				"added": 1457451754
			},
			{
				"comment_id": 65,
				"body": "> [netchaser](#comment_10_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): И всё таки... я считаю что главная цель сетей подобного рода (зеронет и остальные), это распространение контента который по некоторым причинам в государстве N распространять запрещено.\n\nНа самом деле нет. Вон взгляни на скрытые сервисы тор, что за уныние так творится. Потому что если сеть используется только для распространения запрещенного контента, она никогда не порадует разнообразием информации. Наоборот отсутствие цензуры нужно вовсе не для того чтобы распространять только цензурируемое, а чтобы сделать все пространство богаче и разнообразнее. То есть от отсутствия цензуры выигрывают все, а не только какая-то определенная категория людей.\n\nТут мне можно возразить, что 95% в этом не заинтересованы, и их вполне устраивает цензурируемый интернет. Устраивает, но только потому-что они привыкли. Цензура не обрушивается внезапно, но проникает в сеть медленно но неотвратимо. Достаточно медленно, чтобы большинство успевали с ней примириться и принять её. Но когда ещё через несколько лет каждый будет задавать вопрос: \"Когда все это произошло?\", \"Когда всё стало настолько плохо?\" то не увидит единой точки в прошлом.",
				"added": 1457757617
			},
			{
				"comment_id": 66,
				"body": "Что самое интересное во всём этом, что когда люди приходят в более свободное простанство, будь то анонимный имиджборд, даркнет или вот зеронет, то говорить то особо и не о чем. Потому что все настолько свыклись с теми правилами, которые диктуют мейнстримовые сайты, что не могут вот так просто придти и пользоваться предоставленной свободой, и максимум в чём она выражается -- это в более агрессивных высказываниях и разговорах на самые очевидно противозаконные темы. Потому-что это первое что приходит на ум. И чтобы восстановить способность к свободному общению, нужно тут провести немало времени, восстанавливая его по крупицам.\n\nВот есть например зеронет, где прямо сейчас это возможно, но все что тут есть, что в русскоязычном, что в англоязычном сегменте, ограничивается преимущественно разговорами про зеронет сам по себе.",
				"added": 1457758178
			},
			{
				"comment_id": 67,
				"body": "> [kostanew](#comment_77_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Сообщество Linux 10 лет говорило только о себе....\n\nТот же лор был популярен толксами и СПВ. А тут даже флудилка про зеронет.",
				"added": 1457764980
			},
			{
				"comment_id": 68,
				"body": "> [esteban](#comment_67_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Тот же лор был популярен толксами и СПВ. А тут даже флудилка про зеронет.\n\n>Нужны приложения полезные пользователям\nБудто для свободного общения могут быть приложения лучше чем форумы. Хотя вон ZeroPoll подает признаки.",
				"added": 1457765277
			},
			{
				"comment_id": 76,
				"body": "> [kostanew](#comment_138_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Проголосовало 12 человек из 500-600... Хз, хз.\n> Еще не факт что норма для английского станет русской нормой. Неологизмы в английском поощряются, у нас - нет.\nСогласен, но всё же зайт слишком странно. Сам проголозовал за 0site зеросайт, но если приживется зайт, то буду всячески употреблять.",
				"added": 1457989801
			},
			{
				"comment_id": 84,
				"body": "> [zeroidbitzeroid](#comment_1_16zAQhRp3bzVmU3kYs8WUAjXb6o9SmfeCN): Всем привет. Мы хотим оставить подробную информацию о мироустрйстве\n\n[Вот, не благодари](magnet:?xt=urn:btih:A9E66BC752F6DB840D7796256F74939D71227AF9&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet)",
				"added": 1458292992
			},
			{
				"comment_id": 89,
				"body": "> [vlad20012](#comment_188_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Знаете, я, пожалуй, поставлю себе телеграм https://geektimes.ru/post/273142/Если это такая PR-компания, то она определенная удалась\n\nТелеграм хороший файлообменник. Всё хороший файлообменник.",
				"added": 1458721905
			},
			{
				"comment_id": 94,
				"body": "тест",
				"added": 1459189409
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 4,
				"body": "Вот такая идея, не совсем про конкретный ресурс, но может быть полезно. Нужно подружить ZeroNet с IPFS. То есть создать сайт, который бы реализовывал интерфейс в ZeroNet, был бы достаточно легким, а весь тяжеловесный контент загружался по ссылкам из IPFS. \n\nТак как  IPFS пока сырой и не очень хорош для больших файлов, было бы неплохо реализовать, например, сайт для с музыкой. Аналог soundcloud.com или pleer.com, но больше на манер сдешнего Play. Только с размещением музыки в  IPFS и возможности слушать её в браузере.",
				"added": 1457107094
			},
			{
				"comment_id": 5,
				"body": "И еще одна. Тут много форумов, на манер этого. Но так как у них нет возможности подразделы, то это не очень удобно создавать все темы в одном. Предполагается клонировать форум и поднимать отдельный, для отдельной задачи. Но в этом случае сложно уследить за всеми. Можно подписываться, но это тоже не очень удобно что все обновления сыпятся в ленту. \n\nБыло бы не плохо иметь приложение, в котором можно создать иерархию каталогов форумов на свой вкус, и иметь удобные возможности для отслеживания активности: сортировку по времени последнего комментария, по созданию новых тем и т.д.",
				"added": 1457107582
			},
			{
				"comment_id": 6,
				"body": "> [shift](#comment_88_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Зачем IPFS? имхо мертвая идея и на мобиле никак работать не сможет. Подразделы можно делать, а съехали мы на свой форум с основного для удобной модерации и поднятия лимитов для участников\n\nСам же просил без обсуждения тут. Говори куда идти. Я новичок, менее дня в ZeroNet. \n\nIPFS на мобиле можно через гейты. А вот в ZeroNet приложения хранятся целиком, поднимать отдельное для каждого файла не очень хорошо, как мне видится. А подразделы: даже если можно сделать, по мне очень интерсно иметь возможность имень внешнюю структуру каталогов на свой вкус, этакие умные закладки. Как http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D, только более продвинутое. \n\nИ раз уж очередное офтоп сообщение, то скажу, что было бы хорошо здесь поднять gitlab или аналоги. Github очень популярный, но всё же централизованный. Пока это не вызывает проблем, но никто не гарантирует таких проблем в будущем. Уже сейчас им нельзя пользоваться без привязки к email,  то есть практически нельзя размещать проекты анонимно.",
				"added": 1457108496
			},
			{
				"comment_id": 59,
				"body": "Так как тут подписи нативным образом есть у всех, сдесь должны взлететь игры, и не только азартные, можно турниры проводить, например сделать приложения для го.",
				"added": 1457390333
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 9,
				"body": "Да можно и без всякого ID, по открытым ключам. Ники - не обязательное. Их можно и локально давать.",
				"added": 1457175756
			},
			{
				"comment_id": 11,
				"body": "> [dude](#comment_7_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Ну вот, беда как с токсом - пока он сам по себе, с нечитаемыми идишниками - все пучком.\n\nЕсли id  делать через Namecoin. То будет лучше. Но я за сырые адреса, с ними всегда меньше проблем. И они дают сразу хороший уровень надежности. Даже с Namecoin адресами, без держания полного узла Namecoin  приходится доверять. C именами кругом проблемы.",
				"added": 1457177839
			},
			{
				"comment_id": 12,
				"body": "> [shift](#comment_107_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Раскрой тему о сырых адресах - я не понимаю тебя. Namecoin имхо плохой вариант, слишком большой обьем вычеслений/данных\n\n>1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE\nвот так.\n\nВообще, возможно сделать более эффективный аналог Namecoin. По вычислениям уже есть, но и по объему можно сократить, если сделать имена действующими только в течении ограниченного времени, а блоки маленькими, чтобы естественная величина комиссии была достаточно высокой, чтобы не было желания и возможности засирать. Можно получить достаточно хорошую DNS,  но проблемы всё равно будут.",
				"added": 1457178170
			},
			{
				"comment_id": 69,
				"body": "Буду тут http://127.0.0.1:43110/1JW3b7yeFG9Y8sXNBh651utgYuwFME1Ahp/ вести бложик про свои попытки создания распределенного мессенджера на блокчейне. Множество \"ключевых инноваций\" и мой взгляд на блокчейн.  Может будет интересно. Может кому-то позволит избавится от мифа: блокчейн -- это гигабайты информации.",
				"added": 1457910460
			},
			{
				"comment_id": 70,
				"body": "> [vlad20012](#comment_173_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Неужели распределенный блокчейн?\n\nНе, у меня есть мысли про распределенный блокчейн, но это что-то да уровне интуиции. Я сейчас даже не возьмусь даже сформулировать такое. Но можно будет уже на рабочем мессенджере поменять основы.",
				"added": 1457933025
			},
			{
				"comment_id": 71,
				"body": "В интерфейс чего? Я не планирую его как-то связывать с ZeroNet. Сам BitMessage построен на правильных принципах, но заброшен. Если не считать Twister то альтернатив и нет.  Tox меня тоже не устраивает в качестве мессенджера.",
				"added": 1457933703
			},
			{
				"comment_id": 72,
				"body": "> [nippletwister](#comment_297_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А ethereum не хотите попробовать?\n\nЕго тоже поковыряю, но туда чуть позже. Вот мне сейчас интересен Parity. Но сходу бросилась там ассемблерная вставка в реализации bigint. Это так, мелочи, но на малинке уже надо будет заставлять работать. Хотя они там дальше планируют более тонкий клиент. У есть претензии к эфиру в плане ETH. Понятно, что они так сделали чтобы привлечь инвесторов (а что, все так делают), но со временем это наоборот станет тормозом. Как собственно это произошло с Bitcoin и с многими форками. Та же история с NXT. По смарт-контрактам продолжают появляться проекты, может и годнота среди них будет. Здесь я предпочту подождать. А блокчейну уже восьмой год.",
				"added": 1457944940
			},
			{
				"comment_id": 73,
				"body": "> [dude](#comment_16_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): https://github.com/mailchuck/PyBitmessage\n\nКакие-то коммиты вносятся, но вот с ходу посмотрев на клиент и не скажу что там изменилось с 2012. Разве что интеграция с Namecoin бросилась в глаза. Мобильного клиента нет.",
				"added": 1457945334
			},
			{
				"comment_id": 74,
				"body": "Да я зря паникую, оно с условием по x86_64 будет собираться. \n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi_0",
				"added": 1457977343
			},
			{
				"comment_id": 75,
				"body": "А кто знает, с какой целью в зеронете была взята биткоин-криптография в чистом виде? Что прям хоть бери адреса и отправляй на них биткоины? Мне вот раньше все больше попадались модифицированные, хотя-бы букву изменять , но всё же. А с другой стороны, теперь думаю, а ведь оно так удобнее, но больше возможности скомпрометировать ключ, в то же время.",
				"added": 1457978452
			}
		],
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 23,
				"body": "> [snegowiki](#comment_4_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r): Ну и чем тогда это лучше тора? Скоростью и всё?\n\nZeronet  - это как торренты, только для сайтиков. Вот и делай выводы, для чего оно лучше.",
				"added": 1457191386
			},
			{
				"comment_id": 24,
				"body": "> [nippletwister](#comment_200_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Для сайтиков? )))\n\nДа. Чистые торренты для сайтиков плохо подходят, хотя можно статические раздавать, хоть и неудобно. Да оно же вплоть до количества пиров похоже. Пока, как я понял, главное отличи от торрентов, что автор может обновить, а пользователям не нужно перекачивать торрент файл или обновлять magnet-ссылку.",
				"added": 1457193651
			},
			{
				"comment_id": 49,
				"body": "> [dude](#comment_11_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): на том сайте внешние данные подгружаются. с включенным noscript не определяет.\n\nА, вот почему у меня не определил. Я настроил файрфокс чисто под ZeroNet. Он больше никуда не пускает. А так вместо NoScript я бы рекомендовал RequestPolicy Continued или аналоги.",
				"added": 1457263068
			}
		],
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 42,
				"body": "> [shift](#comment_142_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): хм, странно, в safari нормально, ок буду править. \n> а еще я выяснил что кто-то ?? купил домен rutalk.bit\n\nМожно обсудить выбор домена. А вообще, я года три назат смотрел, уже было выкуплено множесто человекочитаемых доменов. Так что это недостаток Namecoin'a.",
				"added": 1457221611
			},
			{
				"comment_id": 47,
				"body": "> [kostanew](#comment_2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Нужны разделы как минимум.\n\nЛучше вместо разделов ты бы поднял отдельный форум.",
				"added": 1457260568
			},
			{
				"comment_id": 48,
				"body": "Чтобы не было централизации излишней, чтобы не было единой модерации на все разделы. В старом интернете такой подход обычен, только потому-что там свое поднять сложнее и плохо с диной системой логинов.",
				"added": 1457261439
			}
		],
		"1_1DjxkUHNWyzVrESngih4CZy9D844FvrKwM": [
			{
				"comment_id": 43,
				"body": "> [nippletwister](#comment_253_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): У Эфира будущее прекрасно только с точки зрения технологий, по деньгам же я думаю, что их скупят (или уже скупили) большие дяди, а, следовательно, на выходе будет красиво упакованное, но никому не нужное УГ.\n\nНасколько я понимаю, там цена публикации смарт-контрактов - это цена коммиссии транзакции. А значит в любом случае цена в перспективе будет зависеть от востребованности места в блокчейне. А значит и большим дядям придется уступить. Или я не прав? Но его нужность будет определяться только тем,  что на нем сделают.",
				"added": 1457222020
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 55,
				"body": "Отфлудил своё уже.",
				"added": 1457275763
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 62,
				"body": "> [cypher](#comment_2_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Надеюсь это будет не велосипед, а именно сам торрент-протокол.\nВот то есть ты предлагаешь webtorrent. Но закрываю я страницу и что, кто раздавать будет.",
				"added": 1457464559
			}
		],
		"1_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq": [
			{
				"comment_id": 63,
				"body": "Это имеет смысл только в том случае, когда тебе не должно быть известно, что ты хранишь -- во всяких децентрализованных хранилищах например. Когда не знаешь что ты хранишь, но тот кто хранит твой контент не знает что там. А в ZN ты хранишь те сайты, которые сам посешаешь, так что смысл такого шифрования не очень понятен. Ведь у тебя тут же будет ключ для расшифровки. А так правильнее будет шифровать ФС. И в tor и i2p так же, там проблемы в необходимости доверии к серверу.",
				"added": 1457547931
			}
		],
		"4_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 64,
				"body": ">ГЛАВНЫЙ ВОПРОС: Могу ли я доверять скаченному контенту и быть уверенным что он не подменен?\n\nПакеты подписываются, так что главное не добавлять бездумно ключи из недоверенных источников. Только вот zeronet пока не подходит для такого. \n\nНо, по сути ты хочешь хорошие описания для пакетов, а это нужно наполнять долгое время. Всякие gnome-software и пытаются решить эту задачу.",
				"added": 1457562268
			}
		],
		"1_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": [
			{
				"comment_id": 77,
				"body": "Эфириум приносит плоды http://coinspot.io/company/u-uber-poyavilsya-decentralizovannyj-konkurent-arcade-city/\n\nУ популярных сервисов такси Uber и Lyft появился конкурент, чья инфраструктура взаимоотношений с сотрудниками построена на децентрализованной платформе от Ethereum. Стартап Arcade City запустил приложение по предоставлению услуг такси для iOS и Android в США и Австралии в этом месяце. За это время сервисом уже успели воспользоваться более 1000 раз.",
				"added": 1458029049
			},
			{
				"comment_id": 78,
				"body": "Вот ещё по эфириуму проект, который меня сильно радует http://etheria.world/ подобные проекты в будущем могут вообще заставить людей пересмотреть место виртуальной реальности в мир. Это ещё вопрос, что более виртуально.",
				"added": 1458029619
			},
			{
				"comment_id": 79,
				"body": "[shift](#comment_260_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А где можно вообще по эфир почитать и почему такой хайп пошел в сети?\nНа bitcointalks пожалуй что.\n\nЯ эфиром интересуюсь по стольку поскольку, он меня интересует только как платформа для распределенных приложений. А на спекуляции мне пофиг, даже если перспективы роста хорошие. Поэтому, мне интересно что на нем вообще выходит. Потому-что очень долгое время не то что не было приложений на нем, да и самого эфириума тоже. А рост может быть просто из за роста. Как и было в биткоине, том же.",
				"added": 1458038262
			},
			{
				"comment_id": 80,
				"body": "Просто вот как я на это смотрю. делаю я допустим приложение под эфириум. Но тут я понимаю, что цена эфира неоправдано высокая а блокчейн перегружен. Что я сделаю? Запущу на одном из форков того же эфира, а если нужно, то сам же его и форкну для этого.",
				"added": 1458038660
			},
			{
				"comment_id": 81,
				"body": "> [nippletwister](#comment_311_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): @esteban, а что насчет Tau Chain скажете?\n\nДаже не знаю, либо первый раз слышу, либо не обращал внимания. Насколько предлагаемый там язык интересен не знаю, не знаком с такими языками. Вот что мне уже не нравится это по распределению токенов. Ну везде одно из двух зол, либо премайн, либо затухающая эмиссия биткоина.",
				"added": 1458047382
			},
			{
				"comment_id": 82,
				"body": "> [nippletwister](#comment_313_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ранних инвесторов надо как-то награждать. Я считаю это правильным.\n\nДа, это удобно так начинать. Но нужно же и продолжать потом.",
				"added": 1458048243
			},
			{
				"comment_id": 83,
				"body": "У эфира там релиз Homestead. В котором оно обещали повернуться к пользователю лицом. Гуевый кошелек сделали, майнер и IDE.",
				"added": 1458288917
			},
			{
				"comment_id": 91,
				"body": "Хорошая подборка литературы, по технологии блокчейн. Учебник (черновик) от Принстонского университета там отметил бы, на основе лекций с Coursera. Для тех кто хочет понять с нуля -- самое оно.\n\nhttp://coinspot.io/news/breaking-news/ischerpyvayushhij-obzor-samyh-avtoritetnyh-issledovanij-vozmozhnostej-i-potenciala-blokchejna/",
				"added": 1459056632
			}
		],
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": [
			{
				"comment_id": 85,
				"body": "Выложи свою фотку, будет.",
				"added": 1458455890
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 86,
				"body": "Putin, kill him, please.",
				"added": 1458583683
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 87,
				"body": "Плеер есть, нет музыки.",
				"added": 1458684309
			},
			{
				"comment_id": 88,
				"body": "Тут главное правильно организовать. Хотябы что-то вроде одного альбома на страницу. Или аналог MediaGoblin под ZN.",
				"added": 1458704377
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 90,
				"body": "вирусы, они теперь и в зеронет",
				"added": 1459017021
			},
			{
				"comment_id": 92,
				"body": "Сбрось куки для 127.0.0.1",
				"added": 1459085991
			}
		],
		"1_1Pz1GZrhBdXYPGLv3pgJHnBSKuJqqybY2R": [
			{
				"comment_id": 93,
				"body": "не работает.",
				"added": 1459159225
			}
		]
	},
	"comment_vote": {
		"1_195q5MTNhdC1Bu38ANoaASrzH42KvcHree": 1,
		"11_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"253_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_13DsxjpDtXXVCEusA6s3kU4tpxvn9ekC4f": 1,
		"12_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"1_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1": 1
	}
}