{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1565141784_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 1,
				"body": "You're a nigger, chinkalinka. You're talking about a nation that was double-JEWED both by Khazars and Burgers. Of course only rampant degeneracy and debauchery can come out of that.",
				"added": 1565142844
			},
			{
				"comment_id": 2,
				"body": "> [chinkalinka](#comment_17_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): Doesn't explain the tentacle porn and shit fetishes they depicted in their art prior to being cucked and jewed.\n\nTame shit compared to everything Catholicucks did in Europe.",
				"added": 1565142937
			},
			{
				"comment_id": 3,
				"body": "> [chinkalinka](#comment_18_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): That's the Jews bro, they inflicted Jewry to Europe before getting kicked out... 109 times.\n\nSo it's all good then? \"Jews jewed me, I can now rape kids and suck baby dicks.\"\n\nJaps are no saints but at least they resisted jewery untilk 1945. That's miles better than Eurocucks and Amerifats did.",
				"added": 1565143109
			},
			{
				"comment_id": 4,
				"body": "> [chinkalinka](#comment_20_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): Japs are Jewminded in their own right, they're like a genetic mutation that by chance somehow ended up like Jews in the ME, except they have an autistic obsession with tentacle porn, lolis, and cutting themselves up when faces with the superior white man\n\nThat's what losing a war to Jews does to your nation, baby. Have you looked at the mirror lately? What else is there in Western culture lately other than degeneracy, communism and Semitic mind-infesting shit? Everything good about the West is now underground or about to be smashed. Not even fucking 8chan is allowed in the mainstream now.",
				"added": 1565143351
			},
			{
				"comment_id": 5,
				"body": "> [chinkalinka](#comment_23_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP): You an accelerationist brah?\n\nStill thinking about it. Accelerationism is good only if you have the upper hand and we don't seem to have it now. My generation is afraid of killing communists. How low we've fallen.",
				"added": 1565143537
			},
			{
				"comment_id": 7,
				"body": "> [shy](#comment_5_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq): Koreans on the other hand ...\n\nLMAO. Now I wanna know.",
				"added": 1565144574
			}
		],
		"1565143575_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 6,
				"body": ">Christianity however is an update to the old law and traditions, the continuation of it where as the kikes specifically make up shit to not follow it but claim to do so anyway and came later down the line.\n\nI don't think I need to read more. I don't want an update to the \"old law and traditions\" because those referenced laws and traditions are not EUROPEAN. Everything in that rotten shit called Christianity is designed to subvert the European nations with a Semitic mind-virus created to destroy us. All of Europe's successes have been despite Christianity, not because of it.\n\nBring back Mithraism or the old pagan rites. Or create a new spirituality altogether. But Christianity is made to destroy our unity. \"One under God\" my ass. It's my people first.",
				"added": 1565144218
			}
		],
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "> [needhelp](#comment_18_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p): everyone keeps talking about zeronet 8chan but no one has a fucking link?\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/",
				"added": 1565145932
			}
		],
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "Jew media silent!",
				"added": 1565149931
			}
		],
		"1565250613_1H12MuvP4JeeK74scutN2fbNbUbdSgZ1Lz": [
			{
				"comment_id": 10,
				"body": "Once a week? Sure.\nTwice a week? Acceptable if the rest of your diet is healthy.\nThree times or more a week? You're overdoing it, fatty boozer. Stop!",
				"added": 1565266673
			}
		],
		"1565404728_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 11,
				"body": "Copypasta:\n\nDuring World War One the British Government had agreed with leading jews that they would support a jewish homeland in Palestine in exchange for the powerful jewish lobby in America getting the USA to join the Allies. This led to the Balfour Declaration being made by the British Government promising the jews a homeland in Palestine. After discussions in the British Cabinet, and consultation with Zionist leaders, the decision was made known in the form of a letter by Arthur James Lord Balfour to Lord Rothschild. The letter represents the first political recognition of Zionist aims by a Great Power. http://imgur.com/7okmKSz",
				"added": 1565415976
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "It's about working hard and smart. You could work hard in stuffing glasses up your asshole but the market might not have demand for such strenuous efforts.\n\nBut the game is rigged so even if you work hard and smart you'll probably not get rewarded.",
				"added": 1565657093
			}
		],
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 13,
				"body": "https://endchan.org",
				"added": 1567560506
			}
		],
		"1569339653_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 14,
				"body": "> [zenanon](#comment_21_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): I didn't know Brazil was bad. Redpill me on the Brazilian Question.\n\nVery diverse country. You got the niggest of nigs and on the other hand really white places like Novo Hamburgo then everything in between that.\n\nIt's the only South American country capable of standing against the greatest world powers.\n\nDegeneracy is rampant and miscegenation abounds. Very socialist which might change or not with Bolsonaro.",
				"added": 1569695775
			}
		],
		"1571325375_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 15,
				"body": "Why don't you invade yourself, you fucking nigger.",
				"added": 1571457762
			}
		],
		"1571440231_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 16,
				"body": "Bashar Al-Assad is a hero. What you need to do is stick a cactus up your ass.",
				"added": 1571457826
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 17,
				"body": "Who doesn't. They're trash. Mention one, just one single country, culture or region that has been improved by the introduction of a substantial amount of niggers.",
				"added": 1571457935
			},
			{
				"comment_id": 18,
				"body": "> [esoter101](#comment_1_1AgZWGTVyEyp3FYduWpZ5dhB5GhXw9FUaP): DNA is improved. African DNA is superior and dominant to recessive White genetics.  All that colorful shit like blonde hair, blue eyes, red hair, etc etc..are just varying degrees of recessive inferior genetic traits.  A lack of melanin, not a gain of anything.  The only reason whites are losing power is because their aryan alien gods are as inferior as they are.  Even white women know this, hence the reason why they all want them beautiful mixed babies.   [...]\n\nWhite women, like all women, don't know anything. They have been brainwashed by the Jew media into believing fucking a negro is somehow more desirable than fucking White people.\n\nYou're talking about recessive traits as if that somehow makes niggers more desirable. Hint: it's not. And why would you need melanin in Norway or Finland? There's a reason they don't have as much.\n\nThe reason Whites are losing power is because they have been successfully brainwashed by Jews into believing they shouldn't be racist or they shouldn't be violent.",
				"added": 1571576054
			}
		],
		"1594178844_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 19,
				"body": "IANAL but I remember seeing somewhere it's still piracy. You would have to read the licensing agreement to be sure. If it uses DRM it's very likely that's illegal.",
				"added": 1594181837
			}
		]
	},
	"comment_vote": {
		"5_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"6_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"5_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq": 1,
		"6_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"18_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"2_17eNACixJyYwm14SuyN39diSNqQiXqqrsb": 1,
		"13_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"615_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"244_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"26_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"34_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"972_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"90_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"41_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i": 1,
		"41_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"109_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"12_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"36_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"16_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT": 1,
		"121_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"2_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1,
		"171_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"28_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"178_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"174_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"221_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": 1,
		"2_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5": 1,
		"69_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"9_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": 1
	}
}