{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1574102813,
			"title": "Priest, 86, on trial for alleged indecent assault on boy 50 years ago",
			"body": "ahahaha!!! what a faggot, the question is would you forgive a holy man that touched your pooper",
			"added": 1574102812
		},
		{
			"topic_id": 1574171891,
			"title": "la-tee-dum... i... i... love... ve... love! no... hmmm... i... lo... ve... love... hmmm... love! you! hmmm! i... love... you... no... you! i... love... you! i love you!",
			"body": "I love you",
			"added": 1574171888
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1574103971_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 1,
				"body": "dvd is $20 bucks, mail order form, is a known chemist, so yeah share the love",
				"added": 1574104242
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 2,
				"body": "WHITE MAN IS SICK FUCKING ANIMAL.\n\nWHITE MAN ELECTROCUTE 14 YEAR OLD BOY FOR Murder he did not commit.\nWHITE MAN Slaughter Native Americans and our beloved animal friends, \n\n300 million pigs now living in USA. \nUS has goods of the highest standard for human nature, LIBERTY BITCH (guns,drugs,abortion,piracy,open source programs).\n\nI love niggers and niggers love you too. \n\nGeorge Stinney Jr, who was 14 when he died in 1944, is the youngest person executed in the US during the 20th century.\nFUCK MANKIND.\nGET A GUN, GET LOCKED AND PRAY TO BUDDAH",
				"added": 1574104883
			},
			{
				"comment_id": 3,
				"body": "> [kaar4bears](#comment_78_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): you don't pray to Buddha, he is not a god, and buddhism is godless. It's obvious you're a cheat\n\nTrue, Buddah shared great wisdom having all ape-holes meditate all day. They brew beer and live in monasteries.\n\nBuddah's teachings with Karma is handy-capt and buddah-man can suck my cock. Go to the youtube comments section and you will see all 'instant-karma' sense there, what a load of fucking idiot faggots.",
				"added": 1574170714
			}
		]
	},
	"comment_vote": {}
}