{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 1,
				"body": "https://www.blockchain.com/btc/address/37NX8NLVsEhv6ZyseND5J99XUfgDc4ez22\nNice to see nobody is stupid enough to give coins to this faggot.",
				"added": 1565108640
			}
		],
		"1571488787_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 2,
				"body": "Its quite normal for everything connected to the internet with an open ssh port to get brute forced on a regular basis.\nThis is how many of the botnets spread...",
				"added": 1571514742
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 3,
				"body": "Sir, this is a Wendy's.",
				"added": 1603475822
			}
		],
		"1604952415_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 4,
				"body": "> [reichardnixon](#comment_104_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): veracrypt\n\nI'll give another vote for veracrypt, assuming that you're looking for an encrypted disk files system.",
				"added": 1605074549
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 5,
				"body": "This is EXCELLENT bait.  Well done.",
				"added": 1606436099
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 6,
				"body": "You're doing it wrong if you think life is more suffering than pleasure.   Take a hard look at what makes you miserable and change it (or at least escape it).   You've got more control of your own life than you think.",
				"added": 1606518336
			}
		],
		"1606531643_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 7,
				"body": "I prefer them scrambled.",
				"added": 1606719911
			}
		],
		"1606864324_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": [
			{
				"comment_id": 8,
				"body": "It will let you go over the limit, but it will start deleting optional storage content until the total consumed space is less than the configured limit.  I had a really hard time figuring out why the system would work so hard to download new content, only to turn around a bit later and delete a bunch of the content. \nI had to increase the optional_limit to make that number larger so that I could hold more content.  It defaults to only allowing 10% of space on the drive for optional files. (an absurdly low limit if you're trying to build a full copy of large zites.)  The config option (measured in gigabytes):     optional_limit = 768",
				"added": 1606879360
			}
		],
		"1607610507_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "This was actually a worthwhile tangent.  I've spent a some time checking out Aether over the last couple of days and I'm pretty impressed with the technology.  The guy who designed it is a goddamn genius.  https://www.youtube.com/watch?v=A9zL2csO7t8  Worth your time to watch and learn, this guy has some really different creative solutions to distributed networking problems and has created some very cool shit. \n\nI was a bit disheartened to see that Aether, much like most p2p networks, is a ghost town and the guy who designed it seems to be growing tired.    I'm still going to hang around, though.\n\nThanks for the link, @styromaniac",
				"added": 1607852232
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 10,
				"body": "I ain't clicking that shit, nigga",
				"added": 1608763655
			}
		],
		"1612580386_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 11,
				"body": "Thanks for sharing, fren.  This is incredible.   Passing this around to give it some visibility.",
				"added": 1612639866
			}
		],
		"1617665358_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 12,
				"body": "NO\nThanks for the magnet.  I've checked half a dozen friends and none of them are listed in here either.  These records seem wildly incomplete.  I'm starting to wonder if this is actually Cambridge Analytica data.",
				"added": 1617696119
			},
			{
				"comment_id": 13,
				"body": "> [darkoo](#comment_25_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG): cool thanks ! safe file? how big is it?\n16.1 gigs, seems safe so far, just zips of text files.   I haven't looked inside the rars or 7zips yet though, still unpacking the full world here.",
				"added": 1617697405
			}
		]
	},
	"comment_vote": {
		"104_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1_1JRReFAonxccQRM3AbrGFEEc2VqckGzo56": 1
	}
}