{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Я сейчас вижу слабость Зеронета в том, что сайт ZeroID кому-то принадлежит...\n\nС одной сторона - да, если надавить на автора ZeroNet, то он (используя свой приватный ключ) может много чего натворить. Но! Что мешает замутить свой ZeroID? Или даже так - свой ZeroID, но уничтожить приватный ключ. И всё. Этот сайт уже хостится участниками сети, а без приватного ключа не получится сделать таких “самодержавных” действий. А вообще было-бы очень интересно сделать что-то наподобие Namecoin’a для ID. Но это уже на крайний случай.\n\nТут есть что-то схожее с зависимостью Tor'a от тех, кто содержит узлы. Но в отличии от последнего, ZeroNet не зависит от конкретных людей. ",
			"post_id": 4,
			"date_added": 1456103078
		},
		{
			"comment_id": 2,
			"body": "@kostanew, когда приобретаю игру в Steam, то у меня нет чувства, что я купил игру. Я лишь приобрёл право поиграть, \"взял в аренду\". Когда я покупаю на GOG, то игра в моём распоряжении - мне позволяют загрузить игру напрямую (клиент ставить необязательно), мне дают возможность отката обновлений, мне полностью доверяют и не обвешивают игры DRM, + то что упомянул @esteban.",
			"post_id": 7,
			"date_added": 1457411243
		},
		{
			"comment_id": 3,
			"body": "> [igix](#comment_1_1Fwxj6dVq8BHxSL6EfEFmLEFRXARw9f97Z): Это же свободный ресурс?\n\nСвобода ZeroNet'a в том, что каждый может создать свою \"площадку\", где будет именно то, что он хочет - его мнения, сообщества, и т.д. И я считаю нормальным, что хозяин ресурса может модерировать свой же ресурс, чтобы соответствовать именно своим идеалам. Определённо будут несогласные, но те спокойно могут выражать своё мнение на своём ресурсе. А именно цензура - есть невозможность (ограничение) выражения своих мыслей где-либо в сети (хоть на чужом, хоть на своём сайте). И если я в целях защиты репутации ресурса удалю данный комментарий, то тут же набегут крикуны - \"это двойные стандарты\", \"это есть ЦЕНЗУРА!!1\" и т.д.",
			"post_id": 8,
			"date_added": 1460865615
		},
		{
			"comment_id": 4,
			"body": "> [prospero78su](#comment_4_1LEQraA91NSeYbQi3sWXDUM8GJzFMEM6gE): Правда блог поднять, я так и не смог.\n\nПроще простого:\nВ ZeroHello находим сайт ZeroBlog (blog.zeronetwork.bit/), справа в этом пункте всплывёт три точки, нажать на них, откроется меню, выбрать \"Clone\". Готово. Можешь написать мне в ZeroMail (zalex@zeroid.bit), помогу.",
			"post_id": 8,
			"date_added": 1474372506
		},
		{
			"comment_id": 5,
			"body": "> [prospero78su](#comment_2_1LEQraA91NSeYbQi3sWXDUM8GJzFMEM6gE): Ммм... Ни хрена не понял про технологию ЗероНет. А он разве не поверх тора дышит?\n\nTor используется по необходимости, если надо IP скрыть. А так, и без него прекрасно всё работает.\n",
			"post_id": 4,
			"date_added": 1474372654
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}