{
	"posts": [
		{
			"id": "90a78336-6a7e-4728-a0cc-b0c00ad67c57",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "443b51c0-4cb9-4311-bef4-c4d38e6e9655",
			"body": ">>928763e8-7d5f-4a84-b757-1fdf5133fad9\n>Honestly you should be more concerned with the guys who have seedboxes setup to download everything at once, \nWhy?\n>then the groups of anons you'll end up being permanently attached to from use of the Mute function.\nThat's not my concern at all. Files are downloaded depending on various factors, including what content the user views. Not just mutes.\nIn any case mutes are fucking placebo because there have been multiple reports content is shared regardless of mutes, something the devs of the software the board is running on have confirmed as a bug for the old ass  versions the board is running on.",
			"time": 1565128516900,
			"files": "[]"
		},
		{
			"id": "4b0829f0-7e4d-4983-9f8a-e75eb955165e",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "C vs Forth vs Fortran",
			"body": "Which one is faster? I've heard Fortran is faster than C because it doesn't allow pointer aliasing.\nBut how about Forth? Is it faster or slower than both of them? There isn't much data on the Internet about this.",
			"time": 1565171316234,
			"files": "[{\"name\":\"1546352980745.jpg\",\"thumb\":\"40f52bf1809b1a063aeefba4a3b472f9712bfc77-thumb.jpg\",\"size\":156323,\"type\":\"image/jpeg\",\"original\":\"17fed17c9d64be824c5cb4c0a78036bdb2ca7267.jpg\",\"directory\":\"1J9yFN69wyYzbJffEvMQUQ72nKSXbHAvJT\"}]"
		},
		{
			"id": "1b86b576-9969-4527-bfdc-690e13a8b3c8",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "f730026d-a61c-48ba-9ce3-cb4fac6f4900",
			"body": ">>5d9f4d8c-3c64-4ecc-83b3-ec1e71cac56e\n>The canvas element is a freedraw area element used for arbitrary graphics, such as embedding potential profile pictures for in-page resizing pre-upload, see discord, facebook, twitter, etc. It's so convenient that most js-heavy toolkits use it for all image uploading since you get previews without any backend work and without farting megs of b64 into the DOM.\n>Because of its low level nature, it has access to many identifying bits of information about the computer related to graphics hardware peculiarities. Thus, TBB disables that shit by default, returning a white square.\nWhich is what I said.\nNow explain to me, how does disabling that feature break file upload. You don't need to freedraw anything to upload a file..\nThere is the generation of the thumbnail, but that's not required to either upload the file, OR generate the thumbnail, OR upload the thumbnail, just maybe for displaying it. So no reason for image uploads to break due to Canvas not working.\n>How about you learn not to be a fucking retard and lurk more before presuming you're welcome here, nigger?\nWere you appointed as a representative by everyone on /tech/? Oh, you weren't? Are you the BO? No? Then fuck off.\nBesides, imagine thinking being welcome means anything on a board with weak pseudonimity.\nHow about you learn to stop being a sperg who likes to argue for the sake of argument? It's retards like you who ruined /tech/.",
			"time": 1565172033295,
			"files": "[]"
		},
		{
			"id": "150bccc4-93f5-4e07-bbde-7838006e805f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c822108f-139c-4189-a7f5-e6834126d67e",
			"body": ">>c822108f-139c-4189-a7f5-e6834126d67e\nSecond link is dead.",
			"time": 1565173460575,
			"files": "[]"
		},
		{
			"id": "82c60884-4a88-441d-ae7e-e6e914d643ba",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>29d5565a-87fb-4389-b588-13c283d16795\n>he doesn't know\nFiles from the mosre hardcore imageboards are handed down to more normalfaggy sites as time goes on. We should be fine.",
			"time": 1565173656605,
			"files": "[]"
		},
		{
			"id": "2523cfdc-4d1a-4904-bfde-9ebb0fd6423b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>d8eb8229-463a-4695-b498-3d73771a1c99\nWell, to be fair they had an experiment where they posted on 4chan (or was it 8chan?) and studied how memes propagate.\nIt's just general research to understand imageboard better and how to effectively shut them down.",
			"time": 1565173726243,
			"files": "[]",
			"last_edited": 1565174100861
		}
	],
	"boards": [],
	"modlogs": []
}