{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 1,
				"body": "Шо за хрень? Власть совсем считать не умеет? Кто-то в рф вообще считал, сколько людей сажают в тюрьмы? Типа человек/месяц. Сколько рождается и сколько с поколения оказывается в тюрьме и по каким обвинениям?",
				"added": 1503362799
			},
			{
				"comment_id": 3,
				"body": "Попробуем рассмотреть систему с точки зрения технологической цепочки. Рождение, учебные заведения, работа/служба. Где в этой цепочке возникает ошибка, что человек оказывается в тюрьме. Ибо то, что человек в тюрьме - это таки ошибка системы, а не человека. Сколько из этих 630 тыс человек находятся в тюрьме в результате борьбы за власть или победы тех или иных политических сил? Смысл этой борьбы за власть или политической борьбы, если в результате смены, тюрьмы только  пополняются? В США данные меня не интересуют, ибо в тюрьмах граждане рф сидят не американских, а своих, разве что только для сравнения.",
				"added": 1503410686
			},
			{
				"comment_id": 5,
				"body": "Любая технологическая эволюция, или революция - расширяет возможности человека. Если \"Система\" по всем параметрам новых возможностей формирует в законодательном поле только пути в тюрьму, то шото эта система стремная...",
				"added": 1503412834
			},
			{
				"comment_id": 6,
				"body": "Ты шо, нацист?",
				"added": 1503420804
			},
			{
				"comment_id": 8,
				"body": "А то я уже как-то удивился настолько упрощенному взгляду на человека...",
				"added": 1503424018
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 2,
				"body": "Телега разве не централизованный мессенджер?",
				"added": 1503362988
			},
			{
				"comment_id": 10,
				"body": "Она информационно централизована. Это главное.",
				"added": 1503433241
			}
		],
		"1_1BGconZDFECxudsuKsBnkXpX1iqKbUWMku": [
			{
				"comment_id": 4,
				"body": "Настройки->Удалить аккаунт. Зачем ФСБ данные Украинцев?",
				"added": 1503410918
			}
		]
	},
	"comment_vote": {}
}