{
    "pull_requests": [
        {
            "title": "Hugo Universal Theme for ZeroNet",
            "body": "There are quite some images in hugo universal theme and the repo pack file is larger than 10 MB, it can't be signed and I have to mark it as optional file, you need to trigger downloading that file by opening [this link](https://127.0.0.1:43110/1DTJ1xqRBDkLfVFyxaUQKzdajXK32qCpSo/paraeasy.git/objects/pack/pack-ba49f887d1eb2a3f78d54baad4660e14d0337103.pack). So you may prefer to copy necessary files instead of merging my patch. Sorry for the inconvenience.\n\nMy patch is inside the branch `patch-1`. If you have any issue, you can submit it in this repo or mine and we can discuss and solve it.\n\n[[Demo site]](http://127.0.0.1:43110/187mXDkAwSwggM7DaxX1e5TU47oeQ6YV3x/)\n\n### Note:\nFor marking a too large file as optional, add `\"optional\": \"paraeasy\\\\.git/objects/pack/.*\\\\.pack$\",`  to `content.json`.\n",
            "date_added": 1517028632200,
            "merged": true,
            "fork_address": "/1DTJ1xqRBDkLfVFyxaUQKzdajXK32qCpSo/",
            "fork_branch": "master",
            "tags": "ZeroNet,hugo",
            "id": 0
        },
        {
            "title": "Hugo universal theme for ZeroNet (2)",
            "body": "Second try, this time I forked hugo universal theme on github and added commits directly to my fork repo, so after you check and merge my patch (under branch master), you can clone my mod version instead. For other detail, please check `README.md`.",
            "date_added": 1517573997000,
            "merged": 0,
            "fork_address": "1HtDomp4V8v63VsmYSaS9ns3e3ak2vXZej",
            "fork_branch": "master",
            "tags": "hugo,zeronet",
            "id": 1
        }
    ],
    "next_pull_request_id": 2,
    "issues": [
        {
            "title": "Implement contact form",
            "body": "For clearnet, if I understand correctly, after a visitor finished the contact form, related data will be sent from a virtual email address to an email address configured by the owner. So it probably needs some backend. I prefer to focus on development related to ZeroNet, so sorry that you need to do it by yourself or ask someone else.\n\nFor ZeroNet, here is my idea:\n* Add anonymous cert generator like [IFS](zero://12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/), [ZeroVoat](zero://1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/), so if a user want to contact you, s/he can create an id directly in your zite.\n* Add encryption feature like ZeroMail and [ThunderWave Private Chat](zero://thunderwave.bit), the contact form data will be encrypted when a user hit the send button and only you have the `encrypt_private_key` to decrypt it. Then either implementing the decryption feature in the UI, or just use a python bot to decrypt it, e.g. [ZeroMail to Email Client Transport](zero://1LnrtiTmBqYKrhorBxHsuiQLw8bKqjz5k7/), [ZeroMailBot in my repo](zero://13zzNGxEXDeLxHEGZdG3mE7G8dChf45LrV/)\n* Add follow button so you can receive notification on ZeroHello when new contact comes (encrypted, or decrypted by a local python bot).\n\nI probably can't finish such a feature right now, so I hope someone who knows these functions better can pick it up.\n\nA much easier way is simply asking your potential customer to contact you by your email and ZeroMail.\n\nWhat's your opinion?",
            "date_added": 1517031132600,
            "open": 1,
            "reopened": 0,
            "tags": "proposal,contact",
            "id": 0
        }
    ],
    "next_issue_id": 1,
    "pull_request_comments": [
        {
            "pull_request_id": 0,
            "pull_request_json": "data/users/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
            "body": "Sorry for the late reply. I serve the demo site with my clearnet proxy and local pi 24h/7d, so could you try one more time to download it?\n\n> As to the theme: I prefer to not have the theme in the repo. I wanted to add theme downloading to the publish_zeronet.sh script. But just didn't have the time yet. Did you have to change anything in the theme files?\n\nI will seperate hugo universial theme and create another repo for it. So I close this pull request and will create another when I finish it.",
            "date_added": 1517563434500,
            "id": 0
        }
    ],
    "next_pull_request_comment_id": 1,
    "pull_request_actions": [
        {
            "pull_request_id": 0,
            "pull_request_json": "data/users/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
            "action": "changeStatus",
            "param": "close",
            "date_added": 1517563436700,
            "id": 0
        }
    ],
    "next_pull_request_action_id": 1,
    "issue_comments": [
        {
            "issue_id": 0,
            "issue_json": "data/users/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
            "body": "So, are you ok with formspree? I think it belongs to third party dependencies. Also I find that formspree is opensource and you can host it on your own server: https://github.com/formspree/formspree. But again.. from the instruction: you'll need a SendGrid account.",
            "date_added": 1517564003200,
            "id": 0
        }
    ],
    "next_issue_comment_id": 1
}