{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "for zeroexef",
			"body": "Sorry but I have a question what are you trying to do is a page that contains critical software for privacy",
			"added": 1469807694
		},
		{
			"topic_id": 2,
			"title": "[Multi-Platform Software] Syncthing 0.14.3",
			"body": "Syncthing replaces proprietary sync and cloud services with something open, trustworthy and decentralized. Your data is your data alone and you deserve to choose where it is stored, if it is shared with some third party and how it's transmitted over the Internet.\nSyncthing is secure because it uses TLS for communication within computers so you dont have to worry for your files to be stolen while syncing.\nSyncthing is Open-Source and Free to use, is an easy app to use and it has a third-party app for Android and F-Droid.\nThanks to testset for passing me this app, I give him the credit for sharing this awesome cloud app.\nPage: https://syncthing.net/\nSource-Code Page: https://github.com/syncthing/syncthing",
			"added": 1470526761
		},
		{
			"topic_id": 3,
			"title": "IZR Vision\n",
			"body": "The primary aim of ISR is that everyone everywhere will always be able to access important software for their day to day life. This means that if the videolan website dies forever, or for some reason is compromised (think hackers or censorship), there will always be at least one verified genuine installer for VLC on ISR.\nThe secondary reason is more due to the hacker/censorship/NSA sort of thing. We hope (yes, just hope) that the software we all know and love is not compromised at the moment. We can support this hope by the fact the many people across the world are using the same file as us. The reason this makes us feel better is that if, say, the NSA built a backdoor into bitmessage, they likely wouldn't do that for servers outside the US. Instead, they would more likely just redirect US website visitors to their own page, complete with compromised download.\nThis is why the file hashing is important. It tells us that we aren't being sent a fake file (or at least everyone is, but we hope that's less likely). For all intents and purposes, going to the official site to download might still be a good idea if you are able. Then take that link and cross check the hash against our table.\n\nAs for the target audience, I'd say most people on zeronet. That is to say that people who have tech-backgrounds or maybe some concept of cybersecurity? Of course by no means do you need that to use our service, but much of our software centers around that.\n\nSo to summarize, ISR is here to make sure everybody is able to get their hands on untampered important software.",
			"added": 1471361442
		},
		{
			"topic_id": 4,
			"title": "About the image of ZeroISR",
			"body": "Ok first, I formatted my laptop (where I draw) so I need a recommendation for an stylus-support for Ubuntu, oh wait I have an idea.\naggie.io is kind of an online drawing app but you can see and help drawing it",
			"added": 1471647992,
			"parent_topic_uri": "15_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf"
		},
		{
			"topic_id": 5,
			"title": "Is this project dead?",
			"body": "So, no one is talking in this forum for almost a MONTH! So I was thinking if this really cool project is really, but REALLY dead.",
			"added": 1475108454
		}
	],
	"topic_vote": {
		"10_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"1_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1
	},
	"next_comment_id": 31,
	"comment": {
		"10_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 1,
				"body": "mmm interesting",
				"added": 1469807524
			}
		],
		"1_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": [
			{
				"comment_id": 2,
				"body": "huh can I recommend WinSCP is a SFTP protocol you dont need FTP installed and it uses SSH for connecting so its encrypted",
				"added": 1469808136
			},
			{
				"comment_id": 3,
				"body": "And a Password Manager wont hurt",
				"added": 1469808300
			},
			{
				"comment_id": 4,
				"body": "Oh and tell me later if you have ZeroMail so I can PM you or talk you in this forum, I have some recomendations and things I can help with ^^",
				"added": 1469808412
			}
		],
		"8_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 5,
				"body": "KeePass! It has support for Linux dist and OS X, it supports too cellphones.\nwww.keepass.info/download.html\nAnd I think that HashTab is OK",
				"added": 1469819839
			}
		],
		"3_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 6,
				"body": "I was going to say if you were going to put tails, yay",
				"added": 1470264239
			}
		],
		"14_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 7,
				"body": "My tox ID: 2055B735B25DB14492163ABABBE2A37C44980C8ABBEDEF28A8F4F7C51BA47D1BDD1F968C4A81",
				"added": 1470442222
			},
			{
				"comment_id": 9,
				"body": "> [imurx](#comment_7_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo): My tox ID: 2055B735B25DB14492163ABABBE2A37C44980C8ABBEDEF28A8F4F7C51BA47D1BDD1F968C4A81\n\nEverybody who adds me I will add you to a tox group so we can all talk together",
				"added": 1470527201
			}
		],
		"4_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 8,
				"body": "> [zeroexef](#comment_28_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): Alright guys so Tox is a great software. I think it'd be good for everybody to hop in there. I made a thread for sharing Tox IDs, so hop in here and do the thing:http://127.0.0.1:43110/15CmNF5L1murN3UMb4fZMuWJtpq689JRhx/?Topic:14_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf/Tox+Chat+info+Post+your+tox+ID+in+here+so+that+we+can+all+connect+and+so+forth\n> \n> \n> That's over my head. Maybe? We might want to ask nofish about this directly.\n\nI think we all agree in using tox is a great idea.",
				"added": 1470442453
			},
			{
				"comment_id": 10,
				"body": "Did something happened with the site that no one is talking now?",
				"added": 1470951916
			},
			{
				"comment_id": 11,
				"body": "> [testingzeronet12](#comment_22_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN): I think we are busy with the ZeroMe at the moment. I am still trying to get a .bit domain for this place. I think zeroexef has been away for a few days too?\n\nI was thinking about the .bit domain too, I went to mine bitcoin with what i can, but Im not getting any good thing",
				"added": 1471097933
			},
			{
				"comment_id": 12,
				"body": "> [testingzeronet12](#comment_23_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN): Yeah I find that mining Satoshi points in order to get a Bitcoin payout every Sunday is too laborious. So I tried going to a Bitcoin ATM machine today to buy some Bitcoin anonymously. But turns out my phone just had a picture of the QR code and the code was not linked to a Bitcoin wallet on my phone. So the ATM machine did not recognise my bitcoin address and let me buy bitcoins. So i'll try again tomorrow lol\n> The ATM type I encountered was a Lamassu Bitcoin ATM. But the camera was not recognising my Bitcoint public key QR code. Probably because I just right-clicked and saved the image of the QR code from Warpwallet but did not link it to a Bitcoin wallet(?). I dont know.\n\ni dont know lol, if you need a qr code tell me and i make you easily a wallet :P",
				"added": 1471144038
			}
		],
		"1_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": [
			{
				"comment_id": 13,
				"body": "+1",
				"added": 1471223781
			}
		],
		"3_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": [
			{
				"comment_id": 14,
				"body": "This is just a copy + paste from what zeroexef said in here: http://127.0.0.1:43110/15CmNF5L1murN3UMb4fZMuWJtpq689JRhx/?Topic:2_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp/Request+for+an+ISR+ISRTalk+vision+revision but it would be good if you put it in ZeroISR in like another menu page About Us",
				"added": 1471361489
			}
		],
		"17_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 15,
				"body": "Like the idea, let's do it! I know I dont give too many recommendations but if you need any help in artist design or programming, tell me!\n\nImUrX ─ The Brony\nI'm someone who likes coding, cartoons, designing, composing music and socializing with random people in internet.\nI just give simple recommendations about a bunch of apps that you can use for multiple things.\nI love this page and is awesome to be part of it, you can just know it because I try to participate in almost every topic but I'm sure that this site will be used for good.\n~Uriel\nMy icon: http://i.imgur.com/kaAUrPG.png (with lossless compression)",
				"added": 1471479306
			},
			{
				"comment_id": 17,
				"body": "> [zeroexef](#comment_39_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): Haha I meant a title relating to what you've done with the site.  \n> \n> Well atm we've just stolen the penguin from zerolinux, so it'd be nice to have a proper logo. Want to give that a shot?\n\nYou got my attention, I just putted brony because I like it :P",
				"added": 1471605526
			},
			{
				"comment_id": 18,
				"body": "> [zeroexef](#comment_39_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): Well atm we've just stolen the penguin from zerolinux, so it'd be nice to have a proper logo. Want to give that a shot?\nWhat do you think about an opened box with a bunch of apps (maybe put the apps we already put)",
				"added": 1471605742
			},
			{
				"comment_id": 19,
				"body": "ImUrX ─ The One with a Really Bad Title *its perfect*\nI just give simple recommendations about a bunch of apps that you can use for multiple things.\nI love this page and is awesome to be part of it, you can just know it because I try to participate in almost every topic but I'm sure that this site will be used for good.",
				"added": 1471646459
			},
			{
				"comment_id": 20,
				"body": "And I dont know if you would like to use this ─ that is equal of a --",
				"added": 1471646490
			}
		],
		"2_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 16,
				"body": "> [zeroexef](#comment_32_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): The primary aim of ISR is that everyone everywhere will always be able to access important software for their day to day life. \n> [testset](#comment_26_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): I like this part. How about stating it on the Zite in a separate first paragraph formulated as:\"Our primary aim is to make important software accessible to everyone everywhere.\"?\n> [zeroexef](#comment_35_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): Agreed.\nI think this is called \"essay\" you could put it below \"Zero ISR Zeronet - Important Software Repository\"",
				"added": 1471479653
			}
		],
		"6_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 21,
				"body": "The only thing that a repository doesnt need is a Not-User-Friendly interface, I could *\"try\"* doing a User-Friendly Interface for an IPFS website.",
				"added": 1471646743
			}
		],
		"4_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 22,
				"body": "I could do a json compatible program with Java that detects differences when you click the button Update in ZeroHello. Edit: This ^ is about the alert system about someone is sending bad data\nAbout a database, I have a site (www.minesys.tk(you cant search for my name because it has whois protection haha)) but I tried making 000webhost compatible with cloudflare and I CANT DO IT! but 000webhost gives me a MySQL database for my website ^^.\nThen the next thing it would be cool to see if they want to install an App with some github api that detects hashes, each time they download some of the apps, they execute the app and the app itself detects all the hashes, compares it to an MySQL database (the database I have in my site) and if they are all correct it says \"All the apps were verified and they have the same hash\" or if its not \"All the apps were verified and some of the hashes are different.\nName of the apps:\nname\nname\n\"\nAll the verified information goes to this page or somewhere else and says that its trusted or no.\nWe can make the app before sending the data to the page to submit a form, if they dont do it you can do whatever you want with the information you got.\nI know a hash app that is used in Hiren's Mini Windows XP\n\n\nTOO MUCH THINGS!!!",
				"added": 1471647581
			},
			{
				"comment_id": 23,
				"body": "> [imurx](#comment_22_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo): I could do a json compatible program with Java that detects differences when you click the button Update in ZeroHello.About a database, I have a site (www.minesys.tk(you cant search for my name because it has whois protection haha)) but I tried making 000webhost compatible with cloudflare and I CANT DO IT! but 000webhost gives me a MySQL database for my website ^^.Then the next thing it would be cool to see if they want to install an App with some github api that detects hashes, each time they download some of the apps, they execute the app and the app itself detects all the hashes, compares it to an MySQL database (the database I have in my site) and if they are all correct it says \"All the apps were verified and they have the same hash\" or if its not \"All the apps were verified and some of the hashes are different.Name of the apps:namename\"All the verified information goes to this page or somewhere else and says that its trusted or no.We can make the app before sending the data to the page to submit a form, if they dont do it you can do whatever you want with the information you got.I know a hash app that is used in Hiren's Mini Windows XP\n> TOO MUCH THINGS!!!\n\n10/10 -Anonymous",
				"added": 1471647598
			},
			{
				"comment_id": 24,
				"body": "> [zeroexef](#comment_38_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): This is an awesome idea. I'm totally on board with this. This'll probably end up being completely separate from ZeroISR in every way, so we need a name for it. We also need a name for us, since we'd be discussing two separate platforms. Name ideas?\nZeroHCP (Zero Hash Collection Project)\nor ZeroHCDP (Zero Hash Collection Data Project)",
				"added": 1471647845
			}
		],
		"1_1FEikAyxCNPJcW996B69r5UFg29yfq579m": [
			{
				"comment_id": 25,
				"body": "> [nutomic](#comment_1_1FEikAyxCNPJcW996B69r5UFg29yfq579m): Should I file an issue on the Zeronet Github then? Do you have any additional info I should add? (other than a link to the site)\n\nOK lets deduce what technology uses chrome and chromium but not firefox now :/",
				"added": 1472310358
			},
			{
				"comment_id": 26,
				"body": "Ok found error\nIf you grab the link and put it as a new tab the download starts\nBut if you just click it makes a new window of firefox where it doesnt download, thanks to Remote XUL I think.\nzeroexef just needs to update the page html code where the download links open in a new tab.\nedit: this repair just works for zip files. the ones that say windows, etc cant find the fix for it. Tried adding 127.0.0.1:43110 in Remote XUL Manager but still cant find the error.",
				"added": 1472310666
			},
			{
				"comment_id": 27,
				"body": "quote from Remote Xul Manager in Firefox Addons\nAbout this Add-on\nSupport for Remote XUL was removed on Firefox 4 (see bug 546857 for more information). But there's still a whitelist that enables Remote XUL, which can be edited using this add-on.",
				"added": 1472310772
			},
			{
				"comment_id": 28,
				"body": "new thing, the one i can just download is gpg4usb zip but the others no, cant see diference between the others but I think it can help in the fix",
				"added": 1472311170
			},
			{
				"comment_id": 29,
				"body": "I will just go to github and upload the error myself but Im sure this is an error in our html code.",
				"added": 1472311588
			}
		],
		"2_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": [
			{
				"comment_id": 30,
				"body": "syncthing-windows-amd64-v0.14.3 (Downloaded on Aug 06, 2016, 20:30 -03:00 GMT)\nSource: https://github.com/syncthing/syncthing/releases/download/v0.14.3/syncthing-windows-amd64-v0.14.3.zip\nSHA-256: 4FA638658B995F4560D04369715E01B7B4A406706503A517CBE7D29580BEC33B\nMD5: EB57F1C23C77395508AF5FA98C5E54B4",
				"added": 1472330935
			}
		]
	},
	"comment_vote": {
		"3_1ELrvskr1xGbmZpbTWS9mC9U8fBouk1Em2": 1,
		"25_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"16_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"24_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"7_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1
	}
}