{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"1565308255_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565287005_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 1,
				"body": "Unfortunately, forums like zeronet, that are anti-censorship, are often enriched for such groups because they get banned from censored/moderated forums and seek outplaces like this.  Mundanes, people who never get banned because they have only approved opinions, don't even know places like this exist.",
				"added": 1565185182
			}
		],
		"1565141784_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 2,
				"body": "Don't worry, you stumbled across the solution to this in your own comment: Their birth rate is insanely low.  Now consider what the result of that isgoing to be over the next little while… say 3 generations, 60 years:\n\nThe population of working age adults will plummet.  This will force young working age people into lucrative jobs, and an underclass of foreign migrant workers into lesser jobs.  That will be augmented some by automation, but not enough to prevent some foreign workers from settling in Japan.\n\nNext, as the elderly Japanese leaders age, there will be no choice but to replace them with leaders of relatively demographics.  \n\nThe first-order result?  Japan will, for a time, hold on to its traditional culture literally like a dying man holds on to his life-support oxygen line.  But that grasp will fail, and almost certainly fail suddenly and catastrophically.  When it does fail, new younger leaders will be incharge of the country… and who will they be? \n\nThis brings us to the second order effects: The new leaders will be the children or grand-children of that fraction of todays Japanese who are still breeding.  THOSE Japanese fall into two demographics: (1)The super-wealthy whose women don't have to work and who can stay home despite being highly educated. (2)Those Japanese who are less bound by the traditional parameters of Japanese culture that don't work in the modern world.  \n\nThe children of the first group will be important and disproportionately represented in the leadership of the Japan of the future… but not disproportionately ENOUGH to counter the fact that they are a tiny tiny minority… literally the 1%. The young people from the senond segment who become leaders will be people who have risen from the ranks so-to-speak… and who will they have been rubbing sholders with?  Why those migrant foreigners we talked about in the 1st order effects of Japan's demographics (a ready-made under-represented power-base).  These already relatively open-minded children of already culturally non-conformist Japanese families of today will incorporate all sorts of cultural ideas from outside of Japan as a result of such association.\n\nSo, not only will Japan radically re-invent itself in the future, but it will be done by young people from the least traditional segment of Japan's culture and be informed by all sorts of globally derived non-japanese cultural adaptations.\n\nIn short, the problem you yalk about will solve itself.",
				"added": 1565186816
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 3,
				"body": "The protesters are doomed… The little guy is trying to stand up against the largest and most sophisticated totalitarian regime in history.  Just what you would expect to happen is what will happen because there is no 3rd party anywhere in the world that cares enough to intervene.",
				"added": 1565201119
			}
		],
		"1565219322_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 4,
				"body": "> [everybody](#comment_16_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): you should be more worried about quantum computers, they are right in the corner.\n\nThere are quantum resistant encryption algorithms and crytographic hash functions now.  They don't support public-private key encryption yet, but are sufficient for a crypto currency.",
				"added": 1565229389
			}
		],
		"1565140432_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 5,
				"body": "That's about as meaningful a question as: 'Do people with outie-belly-buttons have too much influence on fashion?'",
				"added": 1565229608
			}
		],
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": [
			{
				"comment_id": 6,
				"body": "All kidding aside, in order for it to be a reddit clone it needs threaded comments and a down vote button.",
				"added": 1565313966
			}
		]
	},
	"comment_vote": {
		"3_1AARpJL8Wxtq6J3iwc5bHinsPxQFc1Z2z1": 1,
		"8_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"2_1BnrT37VaWnaNq4db7oBMygsaGZr7JSeb4": 1,
		"565_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}