{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Vincular este foro a ZeroTalk.bit como Habla.ZeroTalk.bit ?",
			"body": "So tengo la idea de pedirle a @nofish que pueda agregar el subdominio habla a este foro. Seria una buena oportuniadad para que este sitio tenga mayor adopcion, al mismo tiempo que ZeroTalk.bit gana mas usuarios desde el principio. opiniones?",
			"added": 1457762320
		},
		{
			"topic_id": 2,
			"title": "Saben si Namecoin d/* es sensible a mayusculas?",
			"body": "Soy nuevo  en namecoin y he visto que hay mucho squatter de dominios. Saben si los dominios son sensibles a mayusculas/minusculas? Encontre que todos los dominios que queria estaban ocupados pero sus variantes con mayusculas no. asi que quiero ver si es posible registrarlos asi.\n\ngracias.",
			"added": 1457947873
		},
		{
			"topic_id": 3,
			"title": "Script de hashes de vanidad?",
			"body": "Alguien sabe si hay algun script para generar sitios de vanidad? Algo como 1MyProyecto2sfa9aAFasdfF1fs9afbVSl",
			"added": 1458518361
		},
		{
			"topic_id": 4,
			"title": "Dominio .bit para este foro?",
			"body": "So, parecer aun tenemos un sitio sin dominio, yo pude levantar un wallet de namecoin y puedo registrar el dominio d/zerotalkespanol o d/zer0talk",
			"added": 1458664586
		},
		{
			"topic_id": 5,
			"title": "Wiki para Bitnation",
			"body": "Si conoces Bitnation entonces puedes ir al sitio holonswiki.bit donde podras contribuir a esta creciente comunidad y ayudar a los demas habitantes del cryptoweb a recibir informacion sobre Bitnation.\n\nSi no conoces Bitnation, es una comunidad que usa las critpo-tecnologias para simular las funciones de un gobierno o nacion, desde fe de identidad, hasta contratos, licencias, etc. Unete y descubrela. Puedes encontrar su pagina en claronet en bitnation.co",
			"added": 1459062124
		},
		{
			"topic_id": 6,
			"title": "Es posible conectarse al blockchain desde ZN",
			"body": "Saludos he estado preguntandome si es posible que pueda tener servicios web en ZN dado que es una red separada de la www. Yambien si es posible leer y acceder a API como la de las blockchains y extraer informacion y hacer transacciones.",
			"added": 1474313277
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "Saludos raito, hable con las personas del ZeroTalk de ZeroNetwork.bit y estan interesados en tener foros multi-idioma, les dije de tu foro y pues crearan un subdominio para ligarlo a tu foro si estas de acuerdo.",
				"added": 1457785971
			}
		],
		"6_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 2,
				"body": "seria buena una guia de como configurarlo e instalarlo. Busque en youtube y solo vi unos demos, y si, la pagina de github tiene instrucciones tmb. Pero siempre hay uno que otro gotcha que quizas no este en la doc.",
				"added": 1457869650
			}
		],
		"1_1FGs1Gjnx5nQnfR8X1jXdS1fUyy46iWht4": [
			{
				"comment_id": 3,
				"body": "Asi es aunque como dicen en IPFS, ZeroNet no esta hecho para cargar muchos archivos y WebRTC es una especie de stream de un archvio de medios algo que no suena a algo amigable a ZN",
				"added": 1458009108
			}
		],
		"3_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq": [
			{
				"comment_id": 4,
				"body": "He usado el vanitygen aun no se como incorporarlo de vuelta a zeronet.",
				"added": 1458664728
			}
		],
		"4_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq": [
			{
				"comment_id": 5,
				"body": "Apunte el zer0talk aqui espero que este activo http://127.0.0.1:43110/zer0talk.bit en las proximos minutos.",
				"added": 1458673387
			}
		],
		"28_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 6,
				"body": "quisiste decir asegurar bitcoins?",
				"added": 1459056272
			}
		],
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 7,
				"body": "Archlinux con KDE Plasma 5",
				"added": 1474313309
			}
		]
	},
	"comment_vote": {}
}