{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1544703954,
			"title": "How is ZeroNet different from FreeNet? Im not totally sure I see any substantial differences",
			"body": "",
			"added": 1544703953
		},
		{
			"topic_id": 1544706846,
			"title": "question about legal breach of third party files",
			"body": "in my country (Brazil) it is illegal to have content of child pornographic on disk, with zeronet someone can hide something inside a website and this type of content will be on my disk without i know? \n\nsorry for my English",
			"added": 1544706844
		}
	],
	"topic_vote": {
		"1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": 1,
		"1553712837_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1544661120_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 1,
				"body": "there is more or less a project, but it still does not work yet so well http://gitchain.org/ but an alternative is gittorrent https://github.com/cjb/GitTorrent",
				"added": 1544703608
			}
		],
		"1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 2,
				"body": "I think the network should break the files in blocks and never save a complete file and natively support encryption, even for the sake of not writing malware to our systens. I'll make a suggestion on github.",
				"added": 1544727993
			},
			{
				"comment_id": 3,
				"body": "> [hypercode](#comment_2_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f): I think the network should break the files in blocks and never save a complete file and natively support encryption, even for the sake of not writing malware to our systens. I'll make a suggestion on github.\n\nbecause I think this is very serious, every disk seized here, regardless of the reason, goes through a search algorithm for this type of content.",
				"added": 1544728280
			},
			{
				"comment_id": 4,
				"body": "> [pexo](#comment_35_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Yes, zite owners hide CP(child porn) is something that can happen. Although I'm fairly certain it didn't happen, yet, but someone could definitely do that. Keep in mind when browsing ZeroNet, that zite owners are basically gods on their zite. I would strongly advise to use Tor always mode whenever possible, just to be on the safe side.\n\nthis is a big problem, because there are countries that have piracy on disk is a crime: /",
				"added": 1544730049
			},
			{
				"comment_id": 5,
				"body": "> [tusiko](#comment_22_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): For me this is a good way. In any web one has a responsibility not to visit sites without care. If I visit useless sites or ones with illegal content, I immediately delete them in ZeroHello. In case of sites with illegal content I put them into my blocklist. This is easy done in ZeroHello by one self.\n\nthe problem, is that with js the owner of the site can download what he want. and he can use this to increase the speed of his disgusting website",
				"added": 1544730921
			},
			{
				"comment_id": 6,
				"body": "> [trenta3](#comment_80_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): In some countries (even if very few) also encrypting content is a crime. In many more encrypting content and not providing the encryption keys when asked to by a public officer also is a crime. In this last case you can have all the site content encrypted and then when your disk will be seized, you will be asked to provide the keys to decrypt all the content, so the effect is (legally) the same as not having any kind of encryption, with the added trouble that, should something require a password that you don't have, you incur in more legal penalties.\n\nI say to break the files into blocks too, you would not encrypted files but rather some bytes. and those same countries have execution for data that are not yours as https.",
				"added": 1544742610
			},
			{
				"comment_id": 7,
				"body": "> [trenta3](#comment_80_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @hypercode In some countries (even if very few) also encrypting content is a crime. In many more encrypting content and not providing the encryption keys when asked to by a public officer also is a crime. In this last case you can have all the site content encrypted and then when your disk will be seized, you will be asked to provide the keys to decrypt all the content, so the effect is (legally) the same as not having any kind of encryption, with the added trouble that, should something require a password that you don't have, you incur in more legal penalties.\n\nwithout mentioning that having a handful of data that you do not have access to (and because zeronet is opensource it's easy to prove that the person does not have access) it's much less serious that having child pornography or piracy recorded on your disk",
				"added": 1544742838
			},
			{
				"comment_id": 8,
				"body": "> [trenta3](#comment_81_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): The problem with this is that if you would still like to access a single site without entering any password (like you do today on ZeroTalk), then no matter how securely the content is encrypted on disk, there has to be on disk also the key to decrypt it, and with that key you can also decrypt the CP content stored in it, so I don't see this as solving the question: maybe it will make it harder to find for the police, but when they see that the content is stored in a folder called ZeroNet, it is a very simple job (after searching a bit online) to see where the key is stored to decrypt the content and then to see the files.\n\nI think you have to have a password to start the service, I see it as an optional native option.",
				"added": 1544787039
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_551_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @hypercode yes, you can not prevent it thus you have to:1) encrypt your zeronet data folder as suggested (Veracrypt works on Windows and Linux)2) use proxy to connect internet to hide your real IPA) VPN server from reliable \"no logging\" VPN provider or setup own VPN serverB) in zeronet.conf or in /Config enable tor Always mode and run Zeronet in Tor Browser (it is also on ZeroUp) [...]\n\nthanks but i'm already using that way and I'll make a pull request to project adding an optional flag to add the encryption option natively.",
				"added": 1544787288
			},
			{
				"comment_id": 10,
				"body": "> [trenta3](#comment_82_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Ok, now it makes sense to me: each one of us has a password with which all the content on his disk is encrypted, and he enters such a password at the start of ZeroNet. That makes sense, but having a global password per site is not, since this could allow everyone to decrypt that content.\n\nfor me this password could be associated with zeroid",
				"added": 1544884847
			},
			{
				"comment_id": 11,
				"body": "https://github.com/HelloZeroNet/ZeroNet/issues/1821 issue in github",
				"added": 1544884973
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "make browsers embrace the cause and improve security http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f",
				"added": 1545160084
			}
		],
		"1553712837_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": [
			{
				"comment_id": 13,
				"body": "Claro, redes p2p em geral. no caso deles eu acho mais seguro focar mais na ipfs até.",
				"added": 1553713643
			},
			{
				"comment_id": 14,
				"body": "> [spiderjerusalen](#comment_1_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY): ipfs\n\nRecomendo dá uma olhada pois a ideia dos caras é subistituir o http https://ipfs.io e tem empresas grandes colocando dinheiro no projeto.",
				"added": 1553716382
			}
		]
	},
	"comment_vote": {
		"78_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1
	}
}