{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1576059419,
			"title": "How the fuck did I managed to have the fcking pedoHub on my downloadings",
			"body": "I've installed this today. The only \"rare\" thing i did was enter to zerome to just \"watch\". I leaved, and when i comed back i saw that someHUB was downloading shit. I didn't even checked what is inside pedoHUB, just deleted; but i could argue that something nasty. Aside of that my question is: \"HOW THE FUCK DID MANAGED THIS WEBSITE OR ANY OF IT'S COMPONENTS TO ENABLE SUCH DOWNLOAD????\". It's because i granted MERGE from/to zerome???\n\nI really want to avoid this ***** behavior, avoiding to download anything i don't know in prior, for etical reasons, for bandwith reasons, and because of power reasons. I don't admit that anything gets downloaded for no reason.\n\nAnyone faced this problem too? I would really understand if i should NOT GRANT anything ever to avoid this kind of shit.",
			"added": 1576059418
		}
	],
	"topic_vote": {},
	"next_comment_id": 23,
	"comment": {
		"1576026161_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 1,
				"body": "I think that physical barrier is always the last chance, ie, using open wifi networks. Tracing people in his house at 100m of distance is a HARD work, plus go inside your house wich in fist place would be \"mega hard\" to choose the right house, than issue a order to get in. Case you want to make the thing even harder, you could mix up all your options, TOR -> VPN -> Zeronet, ie.",
				"added": 1576028665
			},
			{
				"comment_id": 2,
				"body": "Is this question purely theoretical? Did you face the problem?",
				"added": 1576028741
			},
			{
				"comment_id": 3,
				"body": "> [falconixx](#comment_6_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): it is not theoretical, this is a problem that i am trying to help Persian people with.\n\nUnderstood. I don't know anything about Persians, nor their network infraestructure, wifi saturation or the level of risk you're trying to get in. I don't know wich kind of connections are trully censored at all.\n\nAlso, i am not getting if this is about to use networks as a regular use, or just to being able to send little but secret messages over Persian networks.\n\nIm a bit blurried about your real needs.\n\nI think that the most censored country is china, so you could try to investigate how did those chinesses bypassed the censor methods.",
				"added": 1576032542
			},
			{
				"comment_id": 4,
				"body": "so, your question is more related on how to access from one country (uknown? ) to a host on other country (this case Iran).\n\n**The first attemp should be to use a proxy/vpn that is neutral or accesible from both countries.**\nAccesing a VPN is less \"ugly\" than try to access TOR, so if VPN is not prohibited or truly censores, you should be able to find some working.\n\nI mean, that if you have serious troubles with TOR, then you won't flag yourself as a TOR user, the beset way is to find a \"lets say legal\" way that is not yet closed. It's virtually impossible to block all VPN providers. Just keep digging.\n\nIf you waste so much time and resources, then you have a bigger problem.\n\nTor let's you connect in many ways, concerning to your case, using bridges, that are people sharing their personal network as bridge for you, so you're not connecting to TOR via direct TOR nodes, you're using a middle network which is a NORMAL network, that connects you to the TOR network.\n\nIf you can't use a bridge, then your network is HIGHLY censored. If you really need to access a website, you could try using hostpots or whatever you can use.\n\nAs i mentioned, i don't know what's the content of such website, or the need of access such data.\n\nAs a final comment, i would comment you the existence of proxychains, which is a piece of software that just chains proxy over proxy over proxy over proxy, etc, up to \"lot of them\". You could make a connection to Iran jumping the whole world using those free proxies. You should check wich one to put it first (so connection gets out if your country, and which one last, that should be able to connect to iran). It's fking hard to trace back 300 proxies against the whole world. \n\nDepending the nature of the data, and if this data identifies you directly, it should be a viable bypass to obtain data keeping anonimity. The better if you use a good SSl cert on the webpage, and even better if you serve data ciphered and offer a key for those special users.",
				"added": 1576032871
			},
			{
				"comment_id": 5,
				"body": "> [mmtech](#comment_7_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): correction:how to access from one country (this case Iran ) to a host on other country (unknown?).+privacy about IP revealing and stuff is matter because the consequences of using bypass tools exist.\n\nThen you're talking about extremely dangerous data access.\n\nIs this connection used to be regular (lika a chat) or it is just about sending private data in an anonym way (ie, little data, once a day)?",
				"added": 1576035631
			},
			{
				"comment_id": 8,
				"body": "As i pointed, used in China. China is a big censor.\n\nIm seeying that the difference between shadowsocks and any other socks5 proxy, is the fact that everything (including headers, that reveals URL/IP of the site contacted) is fully encrypted by a local proxy (the shadowsocks-client) to the remove server (shadowsocks-server).\n\nThis should work, but has a 1 single point of failure. They know nothing about a \"suspecting\" connection to somewhere, and just needs to block you this IP and you'll be forced to set up new server.\n\nI have to admit that seems the most secure option to a secure proxy. I would put a tor proxy in the \"server\" side to mix up the outgoing connection instead of use the shadow-server to connect directly to the end point.",
				"added": 1576040493
			}
		],
		"1576059419_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": [
			{
				"comment_id": 9,
				"body": "Well, as i didn't read the full zeronet code at all i could not say. Usually I install 0 shit on this computer, and it's likely to not be a virus. I am more fearing merge thing, which says to merge SOMETHING but doesn't tell you in advanced what will it download or not.\n\nJust asking if someone really know. For know i will stay away from anything that asks for righs.\nIn example i granted IPFS for CDN, which created 2 clusters for it, without tell me their names in advance.\n\nSeems that zerome did something nasty. I only entered 1 profile with info (cuz i tried many others who where empty) and just leaved.\n\nI could not figure any other entry point.\n\nThank you anyway for suggesting viruses :-)",
				"added": 1576060415
			},
			{
				"comment_id": 10,
				"body": "> [nickwa](#comment_471_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Merge isn't the issue here. The merge is to gather user account information. Those \"hubs\" are user info to use on ZeroMe. I don't entirely know how it works, but I know some people on ZeroMe I needed to merge with their hub to be able to see their stuff. Maybe that person's hub had something bad. For example: http://127.0.0.1:43110/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/ RedHub here says you need ZeroMe to access the user profiles. It's there to access people's profile's, and not to overwhelm your storage with too much junk it looks like. This is so you aren't seeding every profile I assume.\n\nSo, the only point of view here is that I entered just 1 person with data, and this fcking person hosts data in such pedoHUB and I just granted access to a HUB that  i may not really need at all to enter \"just the profile\"? \n\nI didn't see anything pedo*related thing on his profile, just dummy entries, but 8 followers.",
				"added": 1576060889
			},
			{
				"comment_id": 11,
				"body": "> [nickwa](#comment_471_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Merge isn't the issue here. The merge is to gather user account information. Those \"hubs\" are user info to use on ZeroMe. I don't entirely know how it works, but I know some people on ZeroMe I needed to merge with their hub to be able to see their stuff. Maybe that person's hub had something bad. For example: http://127.0.0.1:43110/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/ RedHub here says you need ZeroMe to access the user profiles. It's there to access people's profile's, and not to overwhelm your storage with too much junk it looks like. This is so you aren't seeding every profile I assume.\n\nAs i pointed, i didn't even ensured what is inside that HUB; but name is not that much friendly to want to look at all.\n\nWell, i think that the reason was effectively the MERGE grant.\nAs i tried to point out, when you MERGE you have 0 control of what the fuck you are doing at all, just accept or ignore.\n\nAbout the junk data inside, as i didn't look i could not confirm which kind of data where downloaded.",
				"added": 1576061013
			},
			{
				"comment_id": 12,
				"body": "Thank you so much.",
				"added": 1576061024
			},
			{
				"comment_id": 13,
				"body": "> [nickwa](#comment_473_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Thats ZeroNet in general, whatever you click can be a risk.\n\nNice to know. Im not here to find illegal shit nor other. Lucky me i used TOR from the start. I hope no one want's to fuck me because a fcking missclick.\n\nI really feel the merge feature a BIG NO to use zeronet. Risk is not allowed.\nThank you for clarifying to me.",
				"added": 1576061118
			}
		],
		"1577218342_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 14,
				"body": "> It seems publishing a zite currently require you connecting to at least one peer with public IP.\nWill solve anything using Tor?\n\nDid you see http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g/ZeroSeed+a+24h+7d+ALWAYS+ONLINE+node+for+ZeroNet?",
				"added": 1577270802
			}
		],
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 15,
				"body": "> I never talk about God on a daily basis.\nI say \"fuck good\" so many times, but just because historical reasons, bad habits :-) and to make an impront on those who I am talking to. They care about, and I do use that against them.",
				"added": 1577271227
			}
		],
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "From my point of view, you have some good points here, but the overall idea and motivations seems more like if you where just so dumb, and learning Linux was somelike tragic. Let me explain, against your rules of educate anyone. And feel free to think that I am not against you, I don't care about you, but I am in my coffe time and I really like some points you throw.\n\n> Linux is not for the Masses.\n1) That's your opinion. Think that you may be right for today, and you may end soo wrong in few days. Linux evolves with people who create and mantain it.\n\n> \"STOP HELPING THEM\".\n2) Sorry but you're a fucking idiot. You have no right to tell anyone what to do with his live unless the act is against any other rights. Don't forget that, or anyone thinking like you could punch your face for no logic reason.\n\n> Linux and most projects of this importance 'were not for the masses'.\n3) Same than 1)\n\n> The only reason the masses get into it is that a few companies have infiltrated a couple of distributions ('the biggest ones') of linux, and made \"click button\" products of them.\n4) The solely tone of your words are so wrong. But you're soo right about the click button apps. There should be more click buttons app's around to help Linux to be even better. I can't remember the plethora of commands I do use and sometimes I say \"thank you fucking developer!\" when i found a ready to use click button app, instead to have to code it myself. Cuz time is soo important.\n\n> That's why originally all these distributions had a specific footprint, and now they all have more or less the \"components in them\".\n5) Im sorry, but I don't get that. Feels like you don't like that most distros have the good things from each distros. You can always build your own distro, or pick something no one uses if you feel bad having \"the good things\" from others. Repeat, I don't really get this question.\n\n> The masses have not been endowed with intelligence, giving them tools like these 'IS TOTALLY RIDICULOUS'.\n6) Everyone is intelligent. The only missing thing is a proper education. I teached Python's for loops to a person totally outside from computers, using as analogy common life things and that persone was able to \"spoke to me\" what the program will do before launch it, in just 17 minutes. To clarify, is an aged person that never saw a fucking piece of code before my \"test\". People just only fears to appear stupids when learning, that's why people don't ask so much stupid things that they really need to understand. \nAlso, I think that educating and creating facilities will help people to adopt and learn to use them. People drive a car without have a fucking idea about anything more far than pedals, gearing and wheel. There's no difference about a person using a Computer than driving a car. Using Windows without fucking idea is not so much distant to use Linux without fucking idea. FYI, Mac (widely used) is based on the Linux kernel, and it's used by a lot people. Just because those companies you mention used to add usage facilities to it, branded it, and selled it to thouse customers. Enough poema for now.\n\n> And what is even more ridiculous is trying to 'EDUCATE THEM'.\nYou think I am ridiculous teaching you? The ridiculous part is to think that when you leave a bit of knowledge you're educating anyone. Educating people to be smarter is not ridiculous, is the only way to grow and let you feel less alone in few decades. Do you really want to be alone into a stupid people's jail? Think about it.",
				"added": 1577272532
			},
			{
				"comment_id": 17,
				"body": "> [speedbroken](#comment_1_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): There are so many distributions of Linux. Some of these are quite user-friendly, possibly usable by even the most green-handed amateurs.\n\nI love manjaro just because of that facility. I could mount my own Linux from scratch, but I feel that my time is soo much worth that my ego, that's why end up with Manjaro even if Archlinux or other's look at me feeling superior. Fuck them. I don't care, as I don't care so much about anything is not TIME. I've tried almost every \"big\" and \"known\" distro. Loving the concept of \"rolling release\".",
				"added": 1577272903
			}
		],
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 18,
				"body": "I touched bot sides, gaming 24h a day, and not gaming for almost a year. No side was good enough. As @goodafternoon pointed, moderation makes the key. Moderation makes the key on EVERY life aspect. Altough read \"moderation\" seems easy, manage your mind is not that much easy. I don't regret for being abusing my life playing day-by-day, and I don't regret from leave them totally, making me to enter into stress. Usually, stupid people hit the counter-part when trying to avoid something. From playing a lot to don't play. I'm trying to say that i was that (and soo) stupid, but I did just to know both sides, and after that find a comfortable position. Now, I only play when i have nothing more to do, and this happens in a daily basis. I may enter a game, play around 1h-2h and ALWAYS something more important comes to my mind again. I just quit, and I just come back to read, saw movies, or play again when I have nothing more important.\n\nI learned things and concepts that where only possible gaming, and did things that where only possible while not gaming. Find the balance and you may end with something better than just being on an extreme side. \n\nAgain, my experience should not tell you what to do. If you wan't to leave games by yourself, it's your solely decision.\n\nI know I ommited some parts of your message, sorry, I only think important to show my experience and help you with \"another\" point of view.",
				"added": 1577273584
			}
		],
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 19,
				"body": "Wow, you're super. But, actually I don't know if you are super intelligent or super stupid.\n> and fundamentally Lazy\nThat's the only reason I had to learn to program, and surely i suck at. I just did to free me time as much as I can.\n\nThere's a lot of wrong things around Linux, around the people who use it, and around skilled people who think that creating your own linux from the scratch makes you better.\n\nGiving Linux to dumb users will not hurt them much more than letting them using Windows or other.\nIm beginning to think that you're only a hater that coulnd't find some balance between hate and love.\n\nIMHO, you're looking only inside your ego, thinking from your skilled position, and thinking that everyone should master Linux to use it. Ur extremelly wrong, I hope you pay a bit of attention and understand that not everything is perfect, and nothing has made having the knowledge of the future.\n\nIf you see something wrong find a constructive way to help others instead to come \"zerowhere\" to just cry about.\nRegards.",
				"added": 1577274362
			}
		],
		"1577287962_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 20,
				"body": "Not using Zeronet along TOR?\nZeroNet is a decentralized network, is not about safe or not safe, it's totally unrelated, and that's why comes with TOR to help caring people by zero-config usage, which means you can opt to use Zeronet from TOR without technical knowledge. That's one of the things that I love from ZeroNet.",
				"added": 1577290778
			}
		],
		"1576322123_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 21,
				"body": "> [fke13](#comment_44_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz):  the users have to pay/earn crypto-coins\n\nThank you for providing detailed info. Seems more like lokiwaste. Paying to access such network feature becomes an insult to my mind. Seems ridiculous. Also hating bussines \"appearing\" open-source trusty \"anything\" fucking everywhere.",
				"added": 1577291676
			},
			{
				"comment_id": 22,
				"body": "> [styromaniac](#comment_1482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nobody will pay into it anyway. Where money is required to initiate, people insta-nope.\n\nAnd I am glad about it.",
				"added": 1577311118
			}
		]
	},
	"comment_vote": {
		"474_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1400_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"99_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1
	}
}