{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1622532770,
			"title": "Lloyd Austin hobbies?",
			"body": "Curious question isn't it? from Mobile, Alabama, so he is from the Confederacy... but my question is simple : bounty (learning violin, reading poetry) or nigga (bar hand cat fishing, basketball, porch warfare...)? Who knows what they do in Mobile... \n\nI hope it doesn't shock the fainted heart... go beyond the words, seek the meaning... gay or not? patriot or multinational corp stooge? UNO charter or USC and BoR? \n\nAhsley Babit...",
			"added": 1622532769
		},
		{
			"topic_id": 1622533087,
			"title": "The Withdrawal of US forces from Talibanstan shouldn't open Afghanistan to foreign troops, ala Lybia",
			"body": "I was making myself this reflection, that the situation resolve in Lybia has been interfered with by many foreign groups, from the uno to the various wannabe players, leading to an hyper cluster fuck ! Which shouldn't have been, as it was more intended to be a national even if broke in 3 resolution. Aka the foreigners added to the mess.\n\nIt seems less realistic for foreigners to dare to intervene in Taliban affairs... However there is no reason to make the task of the Taliban in defending their sovereignty, liberty, independence and way of life harder than it should be. As such, I regret the lift of taliban air force ! However I hope that the foreigners seeking to mess in taliban country will be used as live realistic  target practices and be shredded.\n\nthis reflection comes from the premise that as the talibans are undefeated since ever, they are a worthy legion to any empire... even if they may seem not interested, at least it makes a front less... where only defeat for the invaders, the outcome is...",
			"added": 1622533085
		},
		{
			"topic_id": 1622534131,
			"title": "CJNG - Jalisco cartel /// how to buy shares?",
			"body": "\"Jalisco cartel responded by kidnapping several members of an elite police force in the state of Guanajuato, torturing them to obtain the names and addresses of other cops, and is now hunting them down and killing them at their own homes, \"on their days off, in front of their families,\" \n\n\"They (police) have been forced to quickly leave their homes and move, so that organized crimes groups cannot find them,\" the decree continues.\n\n\"If you want war, you’ll get a war. We have already shown that we know where you are. We are coming for all of you,\" reads a banner signed by the cartel and hung on a Guanajuato building in May.\n\n\"For each member of our firm (CJNG) that you arrest, we are going to kill two of your Tacticals, wherever they are, at their homes, in their patrol vehicles,\" the banner continues.\n\n\"The cartels, meanwhile, have already declared war on the government - focusing their efforts on eradicating every member of an elite state force known as the Tactical Group, which the cartel accuses of treating its members unfairly.\"\n\nhttps://www.zerohedge.com/geopolitical/mexican-cartels-respond-amlos-hugs-not-bullets-hunting-down-torturing-and-executing\n\n\n..................................\n\nIt's worst than that, those cops are terrorists and even demons, they fight against plants of the creation that God saw as Good, serving the UNO agenda. meanwhile protect gmo toxic plants, furthermore, they interfer in the conduct of free trade, aka when a buyer wants something from a seller... (product not infringing on the will of any one, aka generally plant extracts, once the war on growing area recede to reduce chemical based). \n\nIf the Unesco (from the terrorists/demons in france) was serious, Coca growing, consumption, recipe would be a cultural heritage. But apparently mr rockfeller was successful in criminalizing all natural based medicine to impose his interests, using by corrupting even public state forces...\n\n\nWhat a shame, of \"democracy\".",
			"added": 1622534128
		},
		{
			"topic_id": 1622537604,
			"title": "What should kids learn in school?",
			"body": "Learning to learn (so they can learn anything they wish then) and critical thinking (as it's part of knowing and understanding what they wish to learn, aka not fall for lies and untruth. \n\nFurthermore, I would say that for the that the basics are necessary : learning to read, to write, to count, even the basic laws and how the political system of the land works and it's history with local geography.\n\nFor me thinking, is more important than learning. Being able to understand is way more valuable than to be able to repeat.\n\nCuriously, most people remember what they are interested in.\n\nI don't like collaborative learning, I prefer competitive learning. As for me collaborative learning is in reality dumbing down, as the slowest are overwhelmed and feel angry from the fastest performance, which generate anti social behavior.  \n\nHowever, I believe that rather than use terms like sociability, which are deceitful, contrary to kindness, gentleness and patience which are way more important for a conducive learning environment than social behavior enforcement. \n\nFinally I think that foreign language skills are really mind opener as they a foreign language carries a lot of the foreign culture, way of life and thinking, unless it's newspeak or novalingua that the nwo loves to impose (like parent 1 and parent 2).",
			"added": 1622537600
		},
		{
			"topic_id": 1622549196,
			"title": "[MEGA POST] Who are the greatest allies of the usa in the middle east?",
			"body": "So traitors like lindsey graham have been neuroprogrammed to only repeat one sentence, like cheap bots : \"israel is our greatest ally in the middle east\".\n\nI kindly totally disagree, I understand furthermore than on any centralized, censorable fascist platform, this post would be instantly censored, rather than discussed to establish and improve our collective understanding of the question.\n\nWe can cite the enemies of the first amendement of the bill of rights, like laura loomer or her brethen. the despicable inhuman filth called :.... ben shapiro... whose uglyness equates only his arrogance (and no, he speaks slowly, never been in chirak or what?).\n\n.............\n\nIsreal is by far not the greatest ally of the usa.\n\nQuite the contrary, it's a pain in the ass, a constant sources of worries, a tax leeches, an entity fomenting demonical activities against the american people and american interests and a constant source of treason and duplicious activities.\n\nTo cite a few :\n\n1) Laura loomer and shapiro who uninamously support the censorship of americans, under the mighty race theory, of the jews above all, with special laws (antisemitism)... aka kill a white child,  no worry, a black one, a little gig whose goal is only to support and reinforce the mighty nohaid law of the tribal supremacy.\n\n2) let's get serious, all fed chairman are from the tribe, all white men, asians, black of latino or natives are all of an inferior breed and knowledge to hold this critical and fundational role. We saw ben bernanke advise fools to get on variable mortgage rate before raising interests rate a few 10x... or janet yellen and her speaking fees. Or the inaction of the fed / treasury regarding the banking participants in epstein take down of the republic.\n\n3) pedotrump who released the johanthan pollack (or what ever is name) who betrayed the usa in the nuclear wmd domain and who should have been executed. like in any sensible country (betray china wmds, get found dead, sooner or later, we have millenials to get back at you...).\n\n4) esptein conduct of a miltitary intelligence operations against american children, sheldon adeslon, whose attempt to take down the CCP with corruption in macao may only reflect it's previous successful attempt on american soil. For me this is the RED LINE which has been crossed in regards to esptein (with his french buddy polanski, exposing the russian connection to this infernal and diabolical plot).\n\nIn regards to a pain in the ass and source of worry, it's important to understand the american history in israel. So following the success of worldwar 2 (destruction of the pre fed/irs way of life) and the shoa it was finally decide to reallocate those jews to their home land (see discussion on israel as the homeland of the jews here : http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31). However it has massive cost.\n\n1) a legitimate hate from the muslims colonial settlers, who are losing their loot, adding the compounded effect of al-ksa, said place of the raise of PBUH to heaven (even if the text is clear attachemetn to the material of this life is sin). Which has yuge commercial implication, as well as security ones. And so rather than being able to free conduct commercial activities in a wide region, american business men are crawling like bugs, and or have to come as invading forces.\n\n2) as this resettlement project has been approved, it comes to the credibility of the usa to execute it, sadly, it cost more and more, and has really no realistic peaceful co-existence end. The jews want their temple, the others keep their mosk, the land wars, and political / grifters war. Intra semith wars are less though than interislamic divide, but none the less dating from the time of PBUH.\n\n3) all those neozealots infecting specially the south, who pretending to be christians only know the old testament... at the point to believe that \"christianism\" is an appellation, like communism, I hope they at least understand the origin of marxism...\n\nIMHO the greatest allies in the middle of east of america are :\n\n1) the talibans ! those valorous, never defeated (and against real players) have never done anything against the usa. They respect strongly borders, and know very well where their country is. Not in americas. so you want to fight with guys who can beyond drones pray on open skies? withstand the soviet army? defeat the usa dod? that's what I call allies... I hope they will not redoo their nazi war against one of the most beautiful plant of the creation, whose medicinal values is beyond all for those who experienced pain.\n\n2) KSA (would have say the GCC, but to the Kingdom). Of course there are bandits, theives and even terrorists in KSA, it's a yuge country, which among others host the two holliest site of Islam (makah... and maybe medina but my islamic understanding is limited). In short the holly sand. don't mess with them, they don't mess with you. their land, their way of life, your land, yours. ahh you wanna energy? or be part of the story of Islam, there it is... over the holliest sand (not the mightest)\n\n3) the GCC, has KSA, they have different form of governement, don't forget they are NATIVES... it's not called the arabian peninsula for no reasons, or \"arabic even\"... from tribal leaders, sheiks and kings, Sultan and monarchical parlementary regime, they express vast way, ways they see fit for themselves. Their countries, their laws. Again, I am not aware of an invasion plan by the Gulfies of the usa, do your stuff miscreants kuffars and don't mess with us, you will see, it's profitable. They all understand the bylaws of business. And what? a problem with towel heads? jealous... or maybe it's the pieousness and respectablity of most the natives females that angers the real leader of the feminicracies, reflecting constantly their own debauchery and perversion.\n\n4) Egypt, you want a cultural rich in history country having seen Rome? welcome to the nile... anything else to say about the builders? the octagon design seems interesting.\n\n5)....  the list goes on as the story repeats so passing to the end of the list\n\n6) pakistan... (don't invade afghanistan), who knew ben was there... there are a lot of people in pakistan, but beyond the religion it's india...\n\n7) Lebanon... what is / has lebanon done against the usa ? again nothing, however it's complicated in this country, lot of forces in motion.\n\n8) Syria... even bashar, the blood bather of the peaceful revolution, beyond wanting to keep his palace and privileges, exactly like nancy pelosi, but bigger, didn't wanted to be wiped by a specific group following a very particular interpretation of the texts, as the talibans would say, more study may seem appropriate... \n\n9) Iran... the nefarious entity defending it's side of the divide... since millenials this group of mountainers have display a strong sense of stuborness. They won't let shiism fall... but again what has the usa to do with the greatest longest hardest continuous war in the recorded history of the world? \n\nthe conclusion is that it illustrate the problem of alliances... as said :\n\nby the first American supreme commander :\n\n\" It is our true policy to steer clear of permanent alliance with any portion of the foreign world”\n\nfrom his Proclamation \n\n> Observe good faith and justice toward all nations. Cultivate peace and harmony with all. ... In the execution of such a plan nothing is more essential than that permanent, inveterate antipathies against particular nations and passionate attachments for others should be excluded, and that in place of them just and amicable feelings toward all should be cultivated. The nation which indulges toward another an habitual hatred or an habitual fondness is in some degree a slave. It is a slave to its animosity or to its affection, either of which is sufficient to lead it astray from its duty and its interest. Antipathy in one nation against another disposes each more readily to offer insult and injury, to lay hold of slight causes of umbrage, and to be haughty and intractable when accidental or trifling occasions of dispute occur.\n\n>So, likewise, a passionate attachment of one nation for another produces a variety of evils. Sympathy for the favorite nation, facilitating the illusion of an imaginary common interest in cases where no real common interest exists, and infusing into one the enmities of the other, betrays the former into a participation in the quarrels and wars of the latter without adequate inducement or justification. It leads also to concessions to the favorite nation of privileges denied to others, which is apt doubly to injure the nation making the concessions by unnecessarily parting with what ought to have been retained, and by exciting jealousy, ill will, and a disposition to retaliate in the parties from whom equal privileges are withheld; and it gives to ambitious, corrupted, or deluded citizens (who devote themselves to the favorite nation) facility to betray or sacrifice the interests of their own country without odium, sometimes even with popularity, gilding with the appearances of a virtuous sense of obligation, a commendable deference for public opinion, or a laudable zeal for public good the base or foolish compliances of ambition, corruption, or infatuation.\n\n>Against the insidious wiles of foreign influence (I conjure you to believe me, fellow citizens) the jealousy of a free people ought to be constantly awake, since history and experience prove that foreign influence is one of the most baneful foes of republican government. But that jealousy, to be useful, must be impartial, else it becomes the instrument of the very influence to be avoided, instead of a defense against it. Excessive partiality for one foreign nation and excessive dislike of another cause those whom they actuate to see danger only on one side, and serve to veil and even second the arts of influence on the other. Real patriots who may resist the intrigues of the favorite are liable to become suspected and odious, while its tools and dupes usurp the applause and confidence of the people to surrender their interests.\n\n>The great rule of conduct for us in regard to foreign nations is, in extending our commercial relations to have with them as little political connection as possible. So far as we have already formed engagements let them be fulfilled with perfect good faith. Here let us stop. ...\n\n>Harmony, liberal intercourse with all nations are recommended by policy, humanity, and interest. But even our commercial policy should hold an equal and impartial hand, neither seeking nor granting exclusive favors or preferences; consulting the natural course of things; diffusing and diversifying by gentle means the streams of commerce, but forcing nothing; establishing with powers so disposed, in order to give trade a stable course, to define the rights of our merchants, and to enable the Government to support them, conventional rules of intercourse, the best that present circumstances and mutual opinion will permit, but temporary and liable to be from time to time abandoned or varied as experience and circumstances shall dictate; constantly keeping in view that it is folly in one nation to look for disinterested favors from another; that it must pay with a portion of its independence for whatever it may accept under that character; that by such acceptance it may place itself in the condition of having given equivalents for nominal favors, and yet being reproached with ingratitude for not giving more. There can be no greater error than to expect or calculate upon real favors from nation to nation. It is an illusion which experience must cure, which a just pride ought to discard.\n\nand for good measure : \n\n Peace, commerce and honest friendship with all nations; entangling alliances with none.\nThomas Jefferson \n\n I have been happy . . . in believing that . . . whatever follies we may be led into as to foreign nations, we shall never give up our Union, the last anchor of our hope, and that alone which is to prevent this heavenly country from becoming an arena of gladiators.\nThomas Jefferson \n\n We wish the happiness and prosperity of every nation.\nThomas Jefferson \n\n An injured friend is the bitterest of foes.\nThomas Jefferson ",
			"added": 1622549191
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1622402090_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 1,
				"body": "Even the term pedophilia is already a lie by the childrapists. they don't love children, they hate them, they breach their will, and assault them, leaving them scared for life, having an impact on their loved ones. childrape is an act of war.\n\nI prefer the war on the child rapists, long straineous, impossible to win as there are always (probably) new fallen, than a war on God and his creation, specifically his plants... \"he saw that it was good\".\n\nFurthermore, I have a strong beliefs that the war fighting units against child rape in China, deserve to be well \"over staffed\", in the sense that it's really one of the hardest domestic battle, and that a lot of rest is necessary for all the valiant officers in those ranks... ( I would go as far as only 1/3 of the working year on the front line). \n\nI said that because I saw a while back some glimpse of a show about pedopornography fighting units and really those men were strained... \n\nFurther than the neglecting attitude of justice in most western countries regarding those they arrest (which is already hyper depressing), there is the suffering of those children...\n\nthe frontline of the spiritual war, are the hardest, and there is really no gears, but the mind, the heart and the soul... \n\nand don't forget you fight on the side of God, so sometimes even from the back will the enemy corner, like a corrupt judge or academics or what ever human right narrative applied to benefit child rapists.\n\n> [mozez](#comment_6_13ui1ziWUVZb7giGNYpAzHzdfCirkobc8x): What's your reason to touch kids? Is it a mental issue?\n\nI think it's a biological defect... maybe, or and it could be, it's the real full spectral domain, aka \"the dimension front line\", and I guess it's breached at the individual level, aka the \"fallen\".\n\n\"demonic creep\" or biological defect, further studies will necessitate live experimental units... or not, simply executed.\n\n> [anon46344](#comment_1_1KhfhSvSnonDqSgVk8B6Cg5WE2u2ZGLqCr): Fuck the anti pedo\n\nthank you very much for your voluntary contribution to the munition shuffling and development programs, much appreciated. \n\n> [anonysan](#comment_44_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): fuck your mother, faggot\n\nno... find, use, kill, use bio mass. win-win ! for the children !\n\n> [1cool](#comment_4_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk): pedos should be publicly executed\n\nI don't know... it can always be faked, like JE... btw where is his corpses burried? Why not some digging / necro to see if it's really the dead body we are looking for in the grave... hehehehe... it could be a nice bet...\n\nWhat I like is that the victim, can, watch live or later, the terminal solution of their assaulter. They can know it's over with this one. One less. definitive. My only fear, is that an execution requires a extremely high level of certainty, meaning the cia can always frame someone... I mean they can even frame russian hacker, but there are certain clear case, like roman polanski.\n\n\n\n> [z3r](#comment_14_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): as far as i know, it's a mental sicness...  [...]\n\nwrong that's part of their narrative. an illness means that it's curable. don't fall in this trap, then they will present themselves as victims. Humans have free will, some are fallen, they all chose to commit their acts of war on children, as such having use their wills to destroy the will of others they shall perish as assaulter, not as victims.\n\nnaive, naive... it's a long work, but necessary to keep the march forward safe, specially for the children.\n\nthe op is right.",
				"added": 1622535149
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": "> [freepalestine](#comment_4_1H7zNGEgo9AgbdKHhwoWzfeNqrav5RJZk): With respect, I've no idea what any of that pseudo-religious semi-historical rant was supposed to be - it provided little insight and just appears inflammatory and not remotely to engage with the material reality and root cause of Israel’s settler colonial occupation of Palestine: LAND. You'd do far better read this before offering nonsense opinions without any basis:http://libgen.rs/book/index.php?md5=B5A055FBF9240A83472C4B523AFD85A3\n\nbecause you don't want to understand that for the jews, what you call palestine is in reality muslim's settlers colonial occupation of what the roman called judea (as judea... get the idea?), ever read the old testament, the new one, seen Rome? yeah yeah... you can deny. \n\nSo in your mind the settler colonial occupation of the muslims is legit, while the jewish return not. it's your point of view.\n\nCo-existence would be nice... there are a lot of muslims in jewland (israel) not many anymore in muslimland (are the two last jews of afghanistan still alive, and if so still angry at each other), tolerance, co existence? no sane jew wish to rule medina... (forget it, you will be destroyed, again).\n\nedit at least you can only mute your intellectual opponent here... isn't it too hard to cope with?",
				"added": 1622537788
			},
			{
				"comment_id": 3,
				"body": "So we can safely conclude that you lost the argument from a teologic, historic and cultural, and geographic stand point, as a military one dear freepalestine...\n\nHowever if you really want an angle of attack against isreal you should come and join to participate in this new post :\n\nWho are the greatest allies of the usa in the middle east?\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1622549196_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk/+MEGA+POST+Who+are+the+greatest+allies+of+the+usa+in+the+middle+east",
				"added": 1622549173
			}
		],
		"1622549196_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 4,
				"body": "finished.\n\nBut to take mine the words of a very sophisticated englishman, why the fuck should I care about this israel? and reformulated in a more comprehensive way : IDGAF ! go away.\n\nfor more specific discusion on israel itself : http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31",
				"added": 1622551607
			}
		],
		"1621843317_1C9uMp36YAt8RV6cf9jPoarY7LPnnzSZ4h": [
			{
				"comment_id": 5,
				"body": "> [thefather](#comment_5_1QF6hFgijw5BqUeyY9hRPmH7qxcaRvgCyM): The best way to make an economy flourish is to ensure a high degree of order/low degree of crime. Why bother working hard when you can just steal? Why start a shop when it will be robbed? Why provide insurance to a business at a fair price if you know that business will be vandalized? [...]\n\nwrong, it's to have high productivity. high efficiency in the use of inputs to produce a maximal output. Nothing else. think as farm. you could have 200 displined and obedient workers doing shit, or 1 smart ass inventing vertical farming in open ag fields, increasing the yield per acre 2x.\n\nthe more you criminalize shit, the more criminal you will find. keep things fucking simple : my body, my choice (abortion plants etc) reduce crimes, while fight real crime thefts, rapes, etc. insurance pricing is a very complex business... more crimes in the book, more criminals you will find, criminals arrested more problems later... specially when guy just wanted to be a weed/coca/poppy farmer following current market rates...\n\nagain be smarter, if infrastructure is to build germania 2.0 it's useless... infrastructure backing producitivity efficiency (see chinese infra?) and QoL (quality of life) see mass migration. grandeur is desillusion, ideal society is one man or comitee dream. beauty can be expanded once produtivity/efficiency/ out put necessary is achieved, if only preoccupation is food on the table, nothing good will come of it.\n\nps I didn't realized that you were into the uniformity of behavior and thought of the 3rd reich... follow the leader and stfu, behave, etc... reminds me of current time, ahh it's for your own good blah blah...\n\n\n> [anonysan](#comment_48_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): ngl if Bolsonaro became a full on integralist that would be extremely based. At least he relaxed gun laws and has made it easier for the Brazilian people to defend themselves from criminals, it's been a long time coming. Self defense is a basic human right and the only way for you to protect yourself from the anarcho tyranny of the modern world\n\nwhat do you mean by integralist? A2 god given right, aka the 2ndA. fuck the uno small arm treaty seeking a hunger game world. the 2ndA is ideal to defend marijuana/coca/poppy farm from demons fighting god creation... it's decentralized defense. an arm is just a tool... (claymore mining is more efficient against large scale assault on farms :D), it adds the surprise effect :).",
				"added": 1622567624
			}
		]
	},
	"comment_vote": {}
}