{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1588691349,
			"title": "How US non profits achieve 'representation without taxation'",
			"body": "first let's look at a few interconnected foundations:\n\n\"democracy is good for business\n\nThe Civic Responsibility Project is a nonpartisan 501(c)(3) nonprofit organization that works with businesses, nonprofit experts, and local government leaders to increase voter participation. Our most recent project with Harvard Kennedy School’s Ash Center for Democratic Governance and Innovation examines the ways in which companies can play a role to engage their employees and consumers in elections.\"\n\nhttps://www.civicresponsibility.org/\n\n\"We are the Civic Alliance, a non-partisan group of businesses working together to build a future where everyone participates in shaping our country. \n\nAs America’s leading companies, we’re putting our influence to work to increase civic involvement, giving our employees and audiences the support they need to take action, whether they’re voting or attending a town hall.\"\n\nhttps://www.civicalliance.com/\n\nLook at how many large companies work with these groups. Look how many other non profits they work with. \n\nGroups like these help companies improve their employees 'civic engagement'. first it's important to understand the differences in power dynamic between an 'employee' and a 'citizen.' its also important to understand the difference between 'civic duty' and 'civic engagement.' the founding fathers laid out the rights and responsibilities of all us citizens; USCIShas a decent list and explanation of these rights and responsibilities. Keep in mind that at the time of the founding of the constitution there was a higher proportion of self reliant citizens (pre industrial, agriculture) versus 'employees' as found today.  \n\nhttps://www.uscis.gov/citizenship/learners/citizenship-rights-and-responsibilities\n\ncompare the USCIS description to Wikipedia's definition of 'civic engagement' which is which quite different from the definition of 'civic duty', as it has nothing to do with supporting and defending the constitution. \n\ninterestingly Wikipedia has no specific definition for 'civic duty' and instead redirects to 'civic engagement (at the time of this writing).'\n\ncompanies have no incentive to support and defend the constitution. instead their focus is on voting and civic engagement.\n\nthese types of non profits are working with companies to circumnavigate the US constitution which purposely divided the federal government in order to limit it's power.\n\ncombine this activity with Citizens United and non profit status and you have the inverse of taxation without representation- representation without taxation.\n\nthis activity is especially impactful during a crisis. the policies that are to be borne from the ongoing Covid19 crisis will be largely influenced by groups like these. \n\nhere's a real world example of one of the initiatives taken from CAAs website:\n\"Addressing Global Health\nWhen Bill Gates shared that the eradication of polio was his primary mission, the CAA Foundation connected the Bill and Melinda Gates Foundation with our client FC Barcelona, knowing that the powerful reach of this global team could supercharge Gates' goal to end polio. The result was a three-year initiative, beginning in 2011, called \"More Than a Goal,\" which created an opportunity for millions of fans worldwide to play a role in helping people obtain vaccinations and education.\"\n\nhttps://www.caa.com/foundation\n\nThis is original content, thanks for reading. If you think this info is useful could you please recommend where else I could post it?",
			"added": 1588691348
		},
		{
			"topic_id": 1610813974,
			"title": "Are you on Gab, Twetch, Minds?",
			"body": "Are you on these platforms? What other ones? The clout one?",
			"added": 1610813972
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 1,
				"body": "> [oldone](#comment_8_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp): none. It's not good to put your personal data online as we are seeing with the crusade against the people who went into the capitol building\n\nThese platforms are just email to sign up. No personal data. Of course good to practice healthy internet hygiene.",
				"added": 1610814910
			},
			{
				"comment_id": 2,
				"body": "anyone who posts their gab name, ill give you a follow! Cheers.",
				"added": 1610837288
			},
			{
				"comment_id": 3,
				"body": "> [mfs](#comment_89_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Which is why I'm a paying member.\n\nI wish premium could be purchased with bitcoin. But you have to KYC which is a bummer... If gab stays strong and popular maybe Id donate bitcoin anyway.",
				"added": 1610837362
			}
		],
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": [
			{
				"comment_id": 4,
				"body": "Next stop a marketplace for doing work privately! No more W2s, no more 9-5, no more drug tests, no more \"colleagues,\" and company policies. Simply trading valuable skills and services for capital in a free and open market!",
				"added": 1610837522
			}
		]
	},
	"comment_vote": {
		"40_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1
	}
}