{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1533120187,
			"title": "pomfpomf.moe 0gallery hub",
			"body": "I made a 0gallery hub, that contains everything tagged with lolicon from pomfpomf.moe, that was uploaded there before 08.11.16. The hub contains 475 doujins(all in english), that include drawn children(lolis) in some shape way or form, so don't say I didn't warn you.\n[Here](http://127.0.0.1:43110/1PomfMoeTPxQ5gLJBeD1sBvaizxbHxf8Zv/) is the link to it. Pressing the `Download and help distribute all files`-button in the 0-menu would help a lot and is appreciated.",
			"added": 1533120186
		},
		{
			"topic_id": 1535650443,
			"title": "How to install Zeronet on QubesOS",
			"body": "I made a tutorial on how to install Zeronet on QubesOS. I originally planned just to post it here, but seeing as my space here is limited and the tutorial being fairly big, I decided to make an blog, and post it there. If you are interested [this](http://127.0.0.1:43110/1PexoLogqCsGAwYEUNqKnmzccg1r5tzCZ3/?Home) is my blog and you can read the tutorial [here](http://127.0.0.1:43110/1PexoLogqCsGAwYEUNqKnmzccg1r5tzCZ3/?Post:5:How+to+install+Zeronet+on+QubesOS).",
			"added": 1535650441
		},
		{
			"topic_id": 1540133695,
			"title": "Tox",
			"body": "Since some people here are using tox, I thought I'll join the fun and make one myself.\n#What is Tox?\nTox is a decentralized encrypted instant messenger capable of voice and audio calls as well as group chats and file transfer.\n#Is it safe?\nYes, each message is encrypted and the authenticity of any message is guaranteed. \nHowever **your IP will be visible by to the people, that you accepted as friends!**\nYou can get around this however, by installing tor and setting the proxy to 127.0.0.1:9050. More infos on that are available [here](https://wiki.tox.chat/users/tox_over_tor_tot).\n#Where do I get Tox?\nYou can get Tox [here](https://tox.chat/clients.html)(clearnet), the technical specification can be seen [here](https://toktok.ltd/spec.html)(clearnet) and the source code can be seen [here](https://github.com/TokTok/c-toxcore)(clearnet)(this is the link to the toxcore source).\n\nYou can post your IDs here to find new friends or add those who already did.",
			"added": 1540133692
		},
		{
			"topic_id": 1547322502,
			"title": "UFTS - A (hopefully) global tagging system for ZeroNet",
			"body": "I'm currently working on a tagging system, which I call the **U**nified **F**ixed **T**agging **S**ystem(working title, I'm open for other names).\nThe idea here is to make a merger hub system, that stores tags and their description. The main advantage would be, that everyone can agree on which tags mean what, on a global level and more importantly computers can do, too. Searching and finding content from all of zeronet or from a few specific zites could be done, by context(with some limitations, of course) rather than looking for phrases.\n\nImplementation wise, so far I have this:\nThere are 4 data types: `tags`, `descriptions`, `description ratings` and `equality claims`:\n\n_**tags** _ \nThese are the tags, nothing much to say here, really. Tags are stored inside a tags.json. They have:\n- `tag content`, which is the plain text of the tag('female:smiling', for example)\n- `tag-id`, which is the sha256-hash of the *tag content*, this eliminates duplicates across all hubs.\n-  `date added`, which is the date when the tag was added(because we are is a decentralized system, this date should be taken with a grain of salt, as everyone can fake it without much effort).\n\nThe hub, they are on and the user that posted them are inferred by the json table, that zeronet generates from the content.json, this way no user can, intentionally or not, just change the origin of a tag this is also true for all other data types, so I won't mention it again.\n\n_**descriptions**_\nThey describe a tag. Every user can write descriptions for any tag in any hub. A description can only ever be for one tag, but a single tag can have multiple descriptions. Each description has:\n- `description content`, which is the plain text of the description('Someone female, that is seen smiling.', for example).\n- `description-id`, which is an uuidv4. It uniquely identifies each description.\n- `tag reference id`, which is the id of the tag, that that description belongs to.\n-  `date added`, which is the date when the description was added(because we are is a decentralized system, this date should be taken with a grain of salt, as everyone can fake it without much effort).\n\n_**description ratings**_\nSince everyone can post descriptions, we need some kind of way to tell which descriptions are good and which aren't. This is exactly that. Each rating is stored as an integer, that can either be positive or negative. The actual interpretation is open for the zite developer to choose. By default these rules will apply: 0=won't be counted, everything positive=+1 Vote and everything negative=-1Vote the sum of all votes makes the rating of a description. A description rating has:\n- `reference description id`, which is the id of the description that is being rated.\n- `rating`, which is an integer that can range from negative infinity to positive infinity.\n-  `date added`, which is the date when the rating was added(because we are is a decentralized system, this date should be taken with a grain of salt, as everyone can fake it without much effort).\n\n_**equality claims**_\nThis addresses the issue that some tags can mean the same thing. Any user can issue a equality claim, that means he picks two tags and claims, that both are equal. An equality claim has:\n- `reference tag id 1`, which is one of the two tags that the user claimed were equal.\n- `reference tag id 2`, which is the other tag.\n-  `date added`, which is the date when the equality claim was added(because we are is a decentralized system, this date should be taken with a grain of salt, as everyone can fake it without much effort).\n\nThe UFTS is separated in a merger zite, private and public hubs:\n- merger zite: Here you can browse all tags, that you currently have access to, (think of it like [ZeroName](/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/)). It doesn't store anything.\n- private hubs: Here only the owner of the hub can create new tags, but everyone can add descriptions, rate and make equality claims.\n- public hubs: Here everyone can add tags, descriptions, ratings and make equality claims.\n\nInteracting with the UFTS will be done through an js library or the database directly(accessing the merger zite over CORS), if the zite developer want's more fine grained control.\n  \n  \nThis is what I have so far. What do you think? If you have improvements or other ideas? Please, do not hesitate to tell me. I'm still experimenting with things and POC-ing stuff, so there is not any code public, yet. But if anyone want's to contribute I'll make a gitcenter repo and put, what I have so far there.",
			"added": 1547322498
		},
		{
			"topic_id": 1550434247,
			"title": "[Dev]Recursive objects in dbschema.json?",
			"body": "Assuming you have this data.json:\n```\n{\n\t\"posts\": {\n\t\t\"1e19e8c7280013b866e6069eb83b26e6f0845dcc8b8536574d9ae3babf73a119\": {\n\t\t\t\"tags\": {\n\t\t\t\t\"2bb2646c8a50439899316a4cf1a815d369ecced35b1c13ede82d6c4075426d7f\": 1550400752,\n\t\t\t\t\"6cdca0e6e412fdd73901106cf7105180953f552231609a5bb551485952c6aaac\": 1550400752\n\t\t\t},\n\t\t\t\"original_image_file_name\": \"watashi_ni_tenshi_ga_maiorita!2\",\n\t\t\t\"original_image_file_extension\": \"png\",\n\t\t\t\"date_added\": 1550400752\n\t\t},\n\t\t\"2d92436499ca99376b0f7ee33c1345ce3cbf9351ce9bc8f20802a9a3119e4a6b\": {\n\t\t\t\"tags\": {\n\t\t\t\t\"2bb2646c8a50439899316a4cf1a815d369ecced35b1c13ede82d6c4075426d7f\": 1550400775,\n\t\t\t\t\"6cdca0e6e412fdd73901106cf7105180953f552231609a5bb551485952c6aaac\": 1550400775\n\t\t\t},\n\t\t\t\"original_image_file_name\": \"watashi_ni_tenshi_ga_maiorita!\",\n\t\t\t\"original_image_file_extension\": \"jpg\",\n\t\t\t\"date_added\": 1550400775\n\t\t},\n\t\t\"fb939c4d87ec38a6db610ae40f66f313dbf89868cb64810623038b57f910bbfb\": {\n\t\t\t\"tags\": {\n\t\t\t\t\"2bb2646c8a50439899316a4cf1a815d369ecced35b1c13ede82d6c4075426d7f\": 1550400788,\n\t\t\t\t\"6cdca0e6e412fdd73901106cf7105180953f552231609a5bb551485952c6aaac\": 1550400788\n\t\t\t},\n\t\t\t\"original_image_file_name\": \"moeta_kaoruko\",\n\t\t\t\"original_image_file_extension\": \"png\",\n\t\t\t\"date_added\": 1550400788\n\t\t}\n\t},\n\t\"comments\": [],\n\t\"ratings\": [],\n\t\"categoryClaims\": []\n}\n```\nIs there a way I would be able to add the `tags`-field into a table with columns `image_id`(the hash in the namespace), `tag_id` and `date_added` **without** altering the structure of that data.json?\nIs there maybe some 'hidden' keyword(like `\"file_name\"`) that would be able to do that?\n\nAnd somewhat related: Is there somewhere a complete list of all dbschema keywords, since [ZeroDocs](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1) doesn't cover them all(like `\"file_name\"` for examle).",
			"added": 1550434242
		},
		{
			"topic_id": 1558983538,
			"title": "Using a BitTorrent client to download ZeroNet files?",
			"body": "As stated above it it possible to construct a magnet link/`.torrent` file from a file hosted on ZeroNet?\nThat file/link could then be given to people that don't have ZeroNet, but a regular BitTorrent client instead, such that they would be able to also seed/get that one file hosted on ZeroNet. This should vastly improve seeders for various files and would make for an effortless way to get a taste of ZeroNet without having to install anything.",
			"added": 1558983532
		},
		{
			"topic_id": 1569007083,
			"title": "The zite SQLite Database Dump tool",
			"body": "I made a single HTML page tool, that will display all contents of the sqlite database of the zite.  \n  \nThe source is available on [Git Center](../1us6a7ZNRRwJsq3Dwaho1TijtjSAVbNYg) and consists of only a single html file, that can be copy/pasted anywhere within your zite. To see the database simply navigate to where you pasted the file in your zite with your browser.  \n  \nThis is meant as a debug tool for zite developers and not for the average user.  \n  \n  \nImprovements/bug reports/contributions and so on are welcomed and greatly appreciated.\nIf you have any questions feel free to ask me.",
			"added": 1569007076
		}
	],
	"topic_vote": {
		"1531822752_1DmuqxmEjz9fYuHqsS5Jte9GE29J7t2xSN": 1,
		"1533396989_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1537270608_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": 1,
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": 1,
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1547060088_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1550689032_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1563752505_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1567159417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": 1,
		"1573631586_1MoBy8Huy34vMKVjRHe6oy8nuMkeR9fVAe": 1
	},
	"next_comment_id": 195,
	"comment": {
		"1533120187_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 1,
				"body": "Thanks, took me around 8 hours of computation to get it(I got lucky though, it was one of the first keypairs I got)",
				"added": 1533150728
			},
			{
				"comment_id": 2,
				"body": "> [nicwow](#comment_16_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): I think I might be confused. Is this another file sharing service?\nDo you know e-hentai or exhentai(more commonly: sadpanda)? 0gallery is sort of like that. It is a zite to view galleries of images. Like ZeroMe, it is divided into hubs, from which it pulls the content that gets displayed on the zite. Here a link to [0gallery](http://127.0.0.1:43110/0gallery.bit/) and it's [source](http://127.0.0.1:43110/1GdpMUiHj52rNburTfYwHP5qxBz6HPyvYy/), if you're interested.",
				"added": 1533152667
			},
			{
				"comment_id": 3,
				"body": "> [nicwow](#comment_17_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): \n>I'm against porn but for freedom of speech.\nThen, you're really not going to like this.\n>I guess my question is what is \"loli doujins\".\nIn general loli means drawn child. Doujins are non-professionally produced mangas by definition, but are more commonly used in describing porn parody comics of a game, anime(cartoon) or book series drawn in a Japanese style(big eyes, funny proportions). Put both together and you have (bluntly speaking) drawn/fictional child porn.",
				"added": 1533162428
			},
			{
				"comment_id": 5,
				"body": "> [dgozltbn](#comment_20_1GtwWtJ66M2wm3raW2ZvUByneLefcsscBf): [...]\nWould you please stop spamming this?\n><ICQ ID...728095560>\nICQ still exists!?\nThere are still people that use ICQ!!?",
				"added": 1533721381
			},
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_616_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Any chance there's gonna be a non-loli doujin hub?\nI don't think I have anything, that isn't loli, so not from me, I guess. If you need help in setting your own hub, feel free to ask me.\n>Also... can anyone contribute to the hubs? or only the person who owns it?\nNo. By default, only the hub owner can contribute to his hub. One would have to alter the js of the hubs to do that, which I have thought about doing. Is there demand for it? It doesn't look too difficult of a modification to pull off.\n>0gallery deserves a lot more attention than it's getting tbh.\nI agree, although development for it seems to be dead.",
				"added": 1533911287
			},
			{
				"comment_id": 8,
				"body": "> [kaffie](#comment_617_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm probably not going to. I don't exactly have the storage space to share a bunch of images.\nBut if you were to upload them, they would also be in your data directory. So storage space would be the same.\n>I feel like it'd help casual users contribute, without having to have a new hub for just, say, one or two albums.\nYeah, pretty much what I thought as well, especially for less techy people that will be a hurdle.\n\nI have started to make an modified hub, where anyone can upload galleries, let's see if (and when)I actually finish that.\nOn that note: Does anyone know where the source code of these hubs is(of if it's even out there in the first place)? I only found the source for 0-gallery itself(on gitcenter). Right now I'm re-writing the hub from the ground up with bare js and css only.",
				"added": 1534068369
			}
		],
		"1533396989_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 4,
				"body": "You are the first guy I met that also uses Briar.\nAs for your question: My best guess would be to build the bramble core and try doing something with that.",
				"added": 1533414505
			}
		],
		"1533831712_1Q5U8WerBKjVkN2aLMWH1ckmJFu5ezgv9m": [
			{
				"comment_id": 6,
				"body": "> [arcana](#comment_3_1KBAjH3997VWYR8T215JrzfPit9MRcbWf1): [...]\n\nI second this.",
				"added": 1533835050
			}
		],
		"1534891163_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": [
			{
				"comment_id": 9,
				"body": "The PomfPomfMoe 0gallery hub can always use more peers, could you add it to the proxy?\nZite address: [1PomfMoeTPxQ5gLJBeD1sBvaizxbHxf8Zv](http://127.0.0.1:43110/1PomfMoeTPxQ5gLJBeD1sBvaizxbHxf8Zv/)\nAlthough I don't think that this is an issue since you already host lolicon stuff and seem to be fine with that, but just to be clear here: The zite contains 475 lolicon doujins(everything tagged lolicon from before 08.11.16).\n\nThe zite needs 200MB in size to be added, I would add it myself, but adding zites above 10MB(or 20 not sure right now) is not permitted for users. Fully sharing the zite would also be really appreciated, but it is around 6.3GB in size, so I understand if that's a bit too much.",
				"added": 1534957795
			},
			{
				"comment_id": 10,
				"body": "> [d14na2](#comment_4_1EoqbSwvxRuRKj7vpeK79wuGXdpq2wbqfM): @pexo added a size limit of 200MB for PomfPomfMoe, but its still not loading. not sure exactly what the issue is, but I'll give it a few more goes. if that doesn't work, then I'll dig into the logs and sort it out.\nThere was a similar problem some time ago, do you have tor enabled? If it doesn't work I'll resign the zite and publish it again(I've made some modifications today, so maybe my content.json is broken, somehow), that seemed to solve problems last time. What kind of error are you getting?",
				"added": 1534974768
			},
			{
				"comment_id": 11,
				"body": "> [d14na2](#comment_7_1EoqbSwvxRuRKj7vpeK79wuGXdpq2wbqfM): @pexo seems to be working now.. \nGreat, although it seems, that zeronet has some issues handling big zites.\n>how do I configure the site to seed the FULL 7GB?\nBasically everything [ssdifnskdjfnsdjk](#comment_468_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS) said. If you don't want to reenable the (0)-button, you can try to call the (0)-menu in the js browser-console and continue from there.(depending on how you removed the button)",
				"added": 1535051362
			}
		],
		"1535470352_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "Maybe have the date_added be filled in by another node/user, who signs his timestamp and leaves his public key in the message. This would allow for bad behaving nodes to be banned and makes it really difficult for an attacker to set a fake time. Not sure about how well this would scale, though.",
				"added": 1535566925
			}
		],
		"1535650443_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 13,
				"body": "> [ssdifnskdjfnsdjk](#comment_479_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): That is a nice tutorial! Make me want to try this OS.\nThanks, it is a bit rough around the edges(it looks like windows 98 and has some visual bugs), but it's definitively one of the most secure operating systems that currently exist. I'll encourage anyone, that has the necessary hardware to install it to use it.\n>When i tried to upvote/comment the article: File write error: [object Object]\nUps... I forgot to change the zite address inside the user content.json. It should be fixed now, could you try it and tell me whether or not it works now?",
				"added": 1535914999
			}
		],
		"1536334713_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 14,
				"body": "> [thunder33345](#comment_197_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): maybe a game or something utility based maybe the ip service thing would help with it?\nHow about a live streaming platform?",
				"added": 1536350505
			}
		],
		"1537270608_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": [
			{
				"comment_id": 15,
				"body": "That sounds interesting, do you have something specific in mind? I wouldn't mind lending some spare time, if you have a good idea. However, I have no experience as a game dev whatsoever, so I'm not sure how much I could help.",
				"added": 1537288752
			},
			{
				"comment_id": 16,
				"body": "> [krystof](#comment_1_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX): How will we keep in touch? Is there a messenger of sorts here on ZeroNet? Looking forward to this.\nIn addition to ZeroMail and 0Play Game Center, that gitcenter mentioned, there is also [ThunderWave](http://127.0.0.1:43110/thunderwave.bit/), [millchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/) and [gitcenter](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/) that one can use to communicate. Other options could be ZeroMe, a custom fork of ZeroTalk or one of the numerous Zeronet dev zites that are out there.",
				"added": 1537385461
			}
		],
		"1537649547_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 17,
				"body": ">on-topic posts\nIn what way? \nBut that aside: If you used up the 50K storage every user has to post here, it will sometimes delete your older posts to make room. Zite owners are basically gods, so nofish would be able to delete your posts, if he were to disagree with them and didn't want them being here. However he hasn't involved himself with that kind of stuff(as far as I know) and I don't seem to be the kind who would abuse the god powers he has here.",
				"added": 1537651725
			}
		],
		"1538246886_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 18,
				"body": "In a nutshell, zeronet restricts zites inside iframes, that have only limited permissions. In theory any js(=javascript) on any zite should not be able to do anything shady. \n**However**: js is packed with vulnerabilities, which could and have(in the past) broken through the iframe sandbox and through the browser itself. Also one has to keep in mind even if the js were to be perfectly safe, there are plugins you might have installed(such as flash for example), that can communicate freely using your ip and to whatever server they desire. Js is definitively the most insecure part of zeronet at the moment and the fact that you are required to have js enabled at all times is scary, especially since zite owners are basically gods(in the sense, that they can do anything they want on their zite, including banning and deleting users). At the moment it is impossible to have communication in zeronet without js, since communication with the zeronet client is not possible as soon as you use the /raw/-prefix(/raw/ is the only way you can have access to a zite without js, which, at the current point in time, breaks all zites, that have some sort of communication feature and most other zites, that don't since they rely on js for building the html for the webpage).",
				"added": 1538248185
			},
			{
				"comment_id": 19,
				"body": "> [zeropyro](#comment_21_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): This is a bitcoin miner and not a virus!\nI don't agree with that. A cryptominer is basically stealing your electricity and converting it into digital currency. This is where cryptocurrencies get their intrinsic value from, you trade electric bills(and time) into the currency you're mining. Which is why anti virus software defends you from that.\nEdit: In addition to (depending on implementation) a cryptominer will make connections to normal websites outside of zeronet, to query it's blockchain, pool or pending transactions for data to include in the mined block.",
				"added": 1538252578
			},
			{
				"comment_id": 20,
				"body": "> [zeropyro](#comment_22_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): It is not mandatory to use the page.You are paying with this for the content.\nThis is true, but one does not have to inform the user, that a cryptominer is used, furthermore most users won't even know what it means to have a cryptominer running in the background in the first place. Without the user being aware of the fact, that they are paying with their electricity. Much like a C&C virus, in theory there is nothing wrong with having your computer part of a botnet and the user would probably don't mind either, but without the user knowing(or having control over it in a certain way), still makes it a virus. This is what differentiates having zeronet installed from being part of a botnet. \nThe issue of clearnet connections still remains.",
				"added": 1538254491
			},
			{
				"comment_id": 21,
				"body": "> [nekololi](#comment_269_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): such wisdom! do you have any other predictions to give us?\n*In my infinite omnipotence I shall predict that in no more than 12 full moons there will be the next one to be unveiled.*\n\nBut jokes aside, js is a huge security issue. There are so many ways you can do one thing and so many things that you, as a developer, just didn't think about. I mean look at google, twitter or facebook. All of them are multi billion dollar companies, that have thousands of highly capable(and paid) developers and on all of them had at some point security breaking js vulnerabilities.\nPersonally, js is almost as bad as C. The only way, I js could be even worse, than it already is, would be to have pointers and custom memory allocation in there.\nIn my opinion, that it is impossible to have any non-static zites without js, is the single most biggest issue zeronet has right now. I don't have a ~~microsoft~~ github account to open an issue there, but I made [this](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:137:Changelog:+September+21,+2018#comment_1_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) post on ZeroBlog, I would be grateful if someone could open an issue for me.",
				"added": 1538422488
			}
		],
		"1540133695_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 22,
				"body": "Here is my ID:\n`38B45630BEF5B3F1148AF7FBA19ED4CC29ECBB50756DF6CBC0B0B302D0DB19471A6F08E04C18`",
				"added": 1540133729
			},
			{
				"comment_id": 23,
				"body": "> [60](#comment_1_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): maybe you mean \"Is it safe?\"\nCan we agree that nobody saw that? I swear I'm good at the grammars.\n\n> [dude](#comment_9_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): FYI, there are some groupchats, the bots are: [...]\nThanks.",
				"added": 1540224592
			}
		],
		"1529178927_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 24,
				"body": "> [0033300](#comment_3_1JwAJqcH78mtHGwLHyQZ5jvi5si8kJDeq9): can be gotten to work though.\n\nDoes this mean you succeeded?",
				"added": 1541015709
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 25,
				"body": "QubesOS. Can't get anymore reasonably secure than that.",
				"added": 1542387956
			},
			{
				"comment_id": 26,
				"body": "> [zeroforze](#comment_5_1MH6Mx8cxRRWFZEckKc8tztJGDyEBzri8H): Now that is a quite cool approach. How is the graphics performance, if for example one want to run 3d applications or games?\nYou'll need a good computer to run it. I'd say it eats RAM for breakfast, but saying that it eats chromes for breakfast would be more accurate. A fast SSD is also a necessity, a HDD will work, but be prepared to wait minutes for an program to start. A fast processor and/or crypto module is also really beneficial.\nIf you have an nvidia graphics card be ready to be in a world of hurt, since their drivers refuse to work in the cubes themselves and on some of the newer ones it might not work for Qubes at all.\nRunning 3d will be a challenge, since hardware acceleration is disabled(for good reasons, security wise).\n\nQubes is really not the OS you should be facing toward, if you want to play games(at least not yet). It will however make your computer an nearly unpenetrable fortress to any virus, hackers and even state level actors.",
				"added": 1542400237
			}
		],
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 27,
				"body": "Sweet, this looks really good so far!\n+1 from me.",
				"added": 1542736054
			},
			{
				"comment_id": 28,
				"body": "> [1pgallery](#comment_8_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): Does anyone know if the sourcecode for the ZeroGallery hubs is available online somewhere?\nI've also searched for that, but haven't really found anything. Let me know If you come across it.\nI also done some research on how the gallery hub content collection works, so if you need help with that, feel free to ask me.\n>I'll be adding a list of ~SFW hubs to a new zite tab to help new users find content.\nDo you also have an index for NSFW hubs? I might have a hub with around 6GB for that.\n\nI had a list with things, that I noticed were broken with 0gallery somewhere, I'll see, if I can find it.\nHave you released the source code, yet?",
				"added": 1542828149
			},
			{
				"comment_id": 29,
				"body": "> [1pgallery](#comment_10_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): Also: we on Git Center now! \nNice!\nSome ideas I had for 0gallery some time ago:\n- There should be a set of predefined(default) tags available and it should be possible to add custom tags, that are separate from the default ones. Think of it like having tag hubs, one that can only be altered by the owner of 1+gallery(this will contain the default ones) and one that anyone can submit new tags.\n- The tagging of galleries should be separated into user tags and creator tags and than have an option in the config to either merge both, only use the user tags or only use the creator tags, when searching. This will prevent possible tagging scams(overtagging or falsetagging).\n- Tag descriptions, that are build the same way as the tags. The tag creator can provide his own description, but users can still submit their own descriptions and vote them. The highest voted one will be displayed, when the mouse is hovered above the tag, with an option to see other definitions. Users can also choose to only respect tag-creator descriptions, only respect user descriptions or both(in this case maybe have the creator description have a vote of '10' and as soon as an user description surpasses that it will be the displayed one(maybe then also make the 'creator vote threshold' changeable in the config))\n- Maybe add a category system, like sadpanda, where a gallery can either be manga, comic, images or images with captions (the fact, that there is no clear distinction on sadpanda is beyond annoying)\n- Make a tag-voting system, where users can vote whether or not a tag is fit for that gallery. Like sadpanda does it\n- Make two separate kinds of hubs one that is private, where only the owner can add galleries and one public, where everyone can upload galleries. This is probably a point for the [1+Hub](../Talk.ZeroNetwork.bit/?Topic:1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE/GalleryHub+Demo) thread, but I'll also put it here since it kind of fits.\n- Make it possible to vote/rate galleries.\n- Make a button to download(I mean a .zip download in the browser) any given gallery.\n- Add the ability to download and save(as in browser download) any image in the gallery by the click of an button(maybe middle mouse click?). This will be really helpful for browsing imageset dumps.",
				"added": 1543077302
			},
			{
				"comment_id": 32,
				"body": "A feature to keep track of what you have started watching and where you stopped watching would be really nice. No site (that I know) has this feature and it is **really** handy, if you don't want to have around 1000 tabs open to remind you what you havn't finished watching, yet.",
				"added": 1543778425
			}
		],
		"1543748747_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 30,
				"body": "> [leftside](#comment_375_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That's amazing! Thanks, ssdifnskdjfnsdjk! :)I'll look inside the site script!\n\nUnless I misunderstood what you wanted to do, what you describe is pretty much exactly done by the [CryptMessage plugin](https://zeronet.io/docs/site_development/zeroframe_api_reference/#plugin-cryptmessage)(Clearnet) api.",
				"added": 1543766712
			}
		],
		"1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 31,
				"body": "> [1pgallery](#comment_27_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): I'm thinking of making a public hub that anyone can upload to using their zeroid/kxoid/etc. but that will take a while.\n\nWhen you are doing this, please consider what I wrote [in the other thread](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE/Announcing+1+Gallery+an+updated+ZeroGallery+Merger#comment_29_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC), as most of these features are easiest to add in the early stages of development.  \nMost of the features I described there, are (in my opinion) crucial to ensure that a hub can run in a (somewhat) moderated manner, without requiring anyone to actually do the moderating(or in other words a self correcting system). This is necessary to keep the hub decentralized, which will grantee that a (theoretical) moderator cannot destroy the hub, if he feels like it(or has a bad day) and keep the hub running long after the (theoretical) moderator left ZeroNet for whatever reason(avoid abandoned/unmaintained hubs).",
				"added": 1543768214
			}
		],
		"1544210236_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 33,
				"body": "I tried to get one about 2 months ago and still have no answer. Pretty sure the Zeroverse guy left and because it was an centralized id system it is now dead until he comes back.",
				"added": 1544210365
			},
			{
				"comment_id": 34,
				"body": "> [glightstar](#comment_101_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): ZeroVerse was one of the earlier ID providers on ZeroNet I believe. The dev left ZeroNet over a year ago, and I think new IDs can not be created without action from him.\n\nYou think correct.",
				"added": 1544467209
			}
		],
		"1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 35,
				"body": "Yes, zite owners hide CP(child porn) is something that can happen. Although I'm fairly certain it didn't happen, yet, but someone could definitely do that. Keep in mind when browsing ZeroNet, that zite owners are basically gods on their zite. I would strongly advise to use Tor always mode whenever possible, just to be on the safe side.\n\n> [styromaniac](#comment_334_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You can still verify.\n> [anonimoose](#comment_21_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): also, not providing the link to verify it should be blocked is also not ok.\nWell the link is provided, but it's not trivial to get to see it. Hint: Open the blocklist zite source code and go searching.\nSecurity through obscurity is never a good idea, but I get why one wouldn't want to help spread those links.",
				"added": 1544728999
			},
			{
				"comment_id": 36,
				"body": "> [anonimoose](#comment_24_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): but couldn't a person create a tractor and then use that to monitor a network and that this IP asked for this site? could be used to prove you were looking at illegal content?\nYes. Which is why you should set it to use tor.\n\n> [trenta3](#comment_81_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): The problem with this is that if you would still like to access a single site without entering any password (like you do today on ZeroTalk), then no matter how securely the content is encrypted on disk, there has to be on disk also the key to decrypt it, and with that key you can also decrypt the CP content stored in it, so I don't see this as solving the question: maybe it will make it harder to find for the police, but when they see that the content is stored in a folder called ZeroNet, it is a very simple job (after searching a bit online) to see where the key is stored to decrypt the content and then to see the files.\n> [anonimoose](#comment_23_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): thanks for the config, if you use tor always why does it not set the trackers proxy to also use tor?\nI think a freenet-ish solution would be best: Have any file in ZeroNet encrypted with, let's say, the hash of it's content and some local secret(maybe a hash of the private key of the uploader?) as the key. If a zite needs to display the file, it has to get the key, which is associated with the hash of the encrypted file, first and can only then access the file. This way, it is possible(again, like in freenet) for the user to allocate some amount of space to a zite he wants to support, that ZeroNet will use to download and seed files(probably those with few seeders) for some time(preferably random) before overwriting it with another poorly seeded file, so you never share the same file for a long amount of time.\nNote: this does make the assumption, that most of the files are not of legally difficult content, which will be fine for ZeroNet and similar, but can get difficult, if you get to more let's say explicit zites.\n\nSince you can't know what the file contains, you should be fine in most jurisdictions.\nThe decryption keys you have could be tossed after each time you close ZeroNet and be redownloaded once you start ZeroNet. The whole time, you'll be sharing all decryption keys you discover while you're browsing ZeroNet to as many peers as you can(key are small, so the overhead will be neglegeable), which will legally fine, too since the key to a probably illegal(remember, you only know that this key will decrypt a file with some hash, you cannot know what that file was before encryption) file is not the illegal file an thus not an issue.",
				"added": 1544819119
			}
		],
		"1546106783_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 37,
				"body": "I guess ZeroNet is confused where it's data should be located. Since it doesn't take the dir it's installed in and searches in a config file for a supplied data directory and doesn't find one.\nTry putting a file with the name `` in the same directory as `zeronet.py` is. Inside it put:\n```\n[global]\ndata_dir = [Path to where you want your data to be stored]\n```\nand see if that does something. If that also fails, try using\n`timeout 7200 python $ZERO_DIR/zeronet.py siteDownload \"$SITE\" --data_dir [Path to where you want your data to be stored]`\ninstead of\n`timeout 7200 python $ZERO_DIR/zeronet.py SiteDownload \"$SITE\"`\n`zeronet.py --help` says that the command is `siteDownload` and not `SiteDownload` so that could have been an issue. Other than that explicitly telling zeronet where and what `data_dir` should be may get around your problem",
				"added": 1546109386
			},
			{
				"comment_id": 38,
				"body": "> [nofish](#comment_1228_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Thanks for reporting, fixed in Rev3744, it should say:zeronet.py: error: argument action: invalid choice: 'SiteDownload' (choose from 'peerCmd', 'cryptGetPrivatekey', 'dbQuery', 'dbRebuild', 'siteNeedFile', 'cryptVerify', 'siteDownload', 'siteCmd', 'cryptSign', 'testAnnounce', 'testConnection', 'siteCreate', 'sitePublish', 'getConfig', 'siteVerify', 'peerGetFile', 'siteSign', 'main', 'peerPing')\nNice.\nOn an unrelated note: How often do you check your ZeroMail?",
				"added": 1546198003
			},
			{
				"comment_id": 40,
				"body": "> [nofish](#comment_1229_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Usually do every day, but I wasnt around in past few days. Just did, increased your limit!\n\nNo worries, thanks!",
				"added": 1546448146
			}
		],
		"1546142431_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 39,
				"body": ">Now It kept saying signing failed, file too large when posting even 1 character text post\nThat is what I talked about in [this](/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo/1546003439) post. You need to ask @nofish give your account more space. (I also need more space)\n> [ssdifnskdjfnsdjk](#comment_578_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS):\n>In your profile folder on that hub site you have large file (30KB) 1545559958.jpg if database rebuilding not fix the problem, you may try to move that file away to your computer desktop for example and try to upvote some post or do the db rebuild, maybe signing will start working.\nThis does not count towards the max_size limit, it counts towards the max_size_optional limit.",
				"added": 1546198503
			},
			{
				"comment_id": 41,
				"body": "> [publicality](#comment_9_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): I guess I'll also ask for more space, that sucks, other people seems to post just fine T_T\n\nThey probably either had their limit already raised or didn't post enough to run into space issues, yet ¯\\\\\\_(ツ)\\_/¯.",
				"added": 1546448609
			}
		],
		"1546405790_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 42,
				"body": "> [loligod](#comment_2_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): styromaniac:If you do have some time (though this would be NSFW) I've been wondering if the new configuration for the gallery has been pushing successfully. On your end would you be able to tell me how many galleries are shown? There is a count right under the galleries link. [...]\n> [styromaniac](#comment_370_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I won't be clicking the gallery link, BTW. Wait for Nekololi, Pexo or Astringent to come along.\n\nIt shows 27 galleries. Are you getting some errors on your end?",
				"added": 1546448820
			},
			{
				"comment_id": 43,
				"body": "> [loligod](#comment_6_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): No errors but it seems it isn't propagating correctly. There are 37 galleries that should show. This is what it should look like on your end: https://0net.io/1Dy2bs4GygFrBPxvZAvysuYQG7P8g3qSYj/ [...]\n\nHuh, weird. Anyway, clicking on `Check Files` in ZeroHello on the three dot menu for your gallery does the trick. It's currently loading 844 files.",
				"added": 1546450365
			}
		],
		"1546797562_1En5vgohdFfruuqXmaJ1UJNjonWcGaBH4Z": [
			{
				"comment_id": 44,
				"body": "Hi!\nAre you new here?\nIf so, how's the zeronet feeling so far?",
				"added": 1546798403
			}
		],
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 45,
				"body": "> [ssdifnskdjfnsdjk](#comment_633_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): So the UFTS sites can be something like an encyclopedia of various terms (tags) along with descriptions that will be supplied by the community while highest voted descriptions will be treated as \"primary\"?\nYes, exactly.\n>What would be practical/example uses of such system?\nFor example things like 1+Gallery, booru-type image boards, (to some extend) fiction zites, blogging and kopykate or 'youtube'. Specifically the first 3 where the use cases I had in mind, along with 'it must be able to work without anyone needing to be around to maintain it'.\n>I am a bit skeptical about the voting system because i bet it may be influenced by the bots. zeroid maybe has some rate limiting of number of user IDs per IP per time interval, but still, unsure if that is enough so one can prevent botnet to vote description which will be for example: Buy service abc at http://abc.com !\nYeah, I thought about that, too. Possible solutions could be to(in order of probable effectiveness):\n- Only accept the descriptions from the tag author, by default. Each user maintains their own whitelist of other description authors they trust.\n- Same as above, but with blacklist instead of a whitelist.\n- making it possible to rate ratings\n- use the POW certificates\n- private and public hubs are still owned by someone, so moderated hubs are a last line of defense.\n\n> [robione](#comment_157_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Tags could change that to an experience with more depth before returning to the Hello page.\n\nThis very much depends on the zite developers, but yes.\n\n> [anonlogin](#comment_8_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU): I'm sorry, what will be tagged here? Every single post, file, etc? Or just sites\n>Anyway, you should prioritize a matching tag occuring in the least amount of other (unrelated) tags to avoid spammers simply using every tag they can think of to be more visible[...]\n\nThat is something that, for example, search engines will have to deal with. UFTS is intended to be thought of as a collection of tags that a zite developer can let their users choose from, to tag their content(or if it's a moderated zite the zite owner/moderators tag the user content and so on). To mitigate fraud, a zite developer could implement a voting system for tags, so that any user can up and down vote the 'strength' of tags, which determines how it will be made visible.\n\n> [quantumworld](#comment_145_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Then beat the hell out of it to see if it will break.\n\nExactly! Break it, until you know it works.",
				"added": 1547412151
			},
			{
				"comment_id": 46,
				"body": "> [klu9](#comment_31_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Not an expert here, just wondering about how this system would deal with languages: e.g. if an image of a cat is tagged with the English word \"cat\", would it be found by a Spanish speaker searching for \"gato\" or a Chinese speaker for \"猫\"?\n\nYes. The 'equality claims' I described above are made specifically to catch those kind of redundancy issues. Any user can publicly claim that two tags are equal to one another(that's why I called them 'equality claims').\n\nHow that could look like in action is:\nOur english user A trusts user B. Because user B speaks both spanish and chinese as well as english, he makes the equality claims, that \"gato\"=\"cat\" and \"cat\"=\"猫\". If user A now searches for anything tagged with \"cat\" he will fist look if any of his trusted friends made an equality claim, that involves \"cat\". With that he will make a list of tags, that are considered equal and find all posts that have (at least one) tag, that is also present in that list.\n\nHaving each user maintain a 'trusted users' list is not the most practical solution, but sybil attacks are unfortunately really good attacks. If you have a good idea on how to defend this equality claim system against bad actors/spammers feel free to tell me. I've been thinking for quite some time about this and what I outlined in [this](#comment_45_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) comment is the best I came up with.",
				"added": 1547492472
			},
			{
				"comment_id": 111,
				"body": "> [petrina](#comment_3_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): Seems interesting, but when it comes to tagging I would prefer to see a way to use perceptual comparison/match of images and videos for automatic tagging.\n\nThat would need to be done by the developer of the zite that makes use of UFTS(in your case a booru or youtube-clone).\nUFTS sole purpose is to give a common ground, so to speak. Such that everyone can agree what a tag means how to search for what tag in what way. Think of it like a dictionary of tags and their definitions, maintained by the crowd, with the ability to fine tune who you trust in that crowd.\n  \n  \n  \nAlso, update on that project, I guess: I'm moving slowly forward, basic db-backend is now done and working, main tag viewer is also now graphical(although I'm considering to replace vue.js with react.js because vue really dosn't handle big lists well, at least on Tor Browser). Currently in the process of scraping all tags and their definitions from e-hentai-gallery(better known as sadpanda/exhentai) as a stress test. But things seem to work rather nicely. More details at some point, I guess.\nI can post a screenshot on ZeroMe, if someone wants to see what I have already. If you want to help, feel free to tell me!",
				"added": 1561921210
			},
			{
				"comment_id": 116,
				"body": "> [thunder33345](#comment_391_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): UFTS seems good, if everyone were to assume to be good actorsbut how about dealing with bad actors, the only way would be whitelisting system of sorts\n\n> [blurhy](#comment_238_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Agreed\n\nOh, I forgot to update the main post(will do that at some point in the future). I think I already wrote this somewhere, but the way it is set up right now is that you have:\n- namespaces\n- namespace definitions\n- namespace equality claims\n- tags\n- tag definitions\n- tag equality claims\n\nSo what you would see on a zite would be `namespace:tag_name` for example `language:english` or `female:smile`.\nWhere tag and namespace definitions as well as the equality claims for both can be rated (voted `+1`,`0`,`-1`) by other users. The highest number of positive votes indicating the 'official' definition and in the case of equality claims must surpass a (configurable) threshold in order to be valid.\n\nA whitelisting system is also an intended way to further restrict bad actors, but that will have to be implemented by the zite dev since he needs to manage the list of bad users for his zite. There is also the distinction between private and public hubs, where on private hubs users can only make equality claims, definitions and vote on those but not add new tags or namespaces(only the owner that some people the owner chooses can do that)",
				"added": 1562527406
			}
		],
		"1548089175_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 47,
				"body": "What happened?",
				"added": 1548089726
			},
			{
				"comment_id": 48,
				"body": "> [deliriumgoddesss](#comment_48_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): you can go prizon in several ways:  [...]\n\nSo nothing in particular happened, but things are just bad in general?",
				"added": 1548177465
			},
			{
				"comment_id": 49,
				"body": "> [deliriumgoddesss](#comment_50_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): well, one woman already in prison, cause she told bad about Educational system in her home region. Several guys are in prison because of reposting pics... And its just beginning. If you want to be free, you must keep calm about politic, national, regional and religion system. Politics are gods, and you must keep your mouth shut about them.\n\nAll the more reason to start using or better hand out flash drives containing tor, i2p, zeronet, freenet… to people, before Russia decides to go full Australia on cryptography and secure communication services.",
				"added": 1548178396
			}
		],
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 50,
				"body": "Nice work!(again)\nDo you want to add it to ZeroSites now or wait a little fist?\n\n> [thunder33345](#comment_386_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): now will the main milchan code base be merged with the milchan merger code base?or they will remain separate as just proof of concepts\n  \nIn his own words:\n>For now both. There are advantages of using the merger site but I think this place could still be useful for people who are interested in creating a board but don't want to bother creating their own hubs.",
				"added": 1549038396
			},
			{
				"comment_id": 62,
				"body": "> [7heaven](#comment_1_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): So, it's sounds great but what about moderation in hubs? Do it has a simple GUI like in original (a.k.a. vanilla) Millchan? Or you can change/delete posts and ban users only by editing in /data/users/content.json?\n\nAs things are right now, you can only moderate by editing the `content.json`. GUI moderation is probably coming at some point in the future.",
				"added": 1550431011
			}
		],
		"1549088626_1CxfctP1zfLgY5SPLXqDBQ4nFzx3HMcEcC": [
			{
				"comment_id": 51,
				"body": "> [nickwa](#comment_24_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): The title \"jailbait\" already makes it seem like a troll.\n\nWhy a troll? I mean jailbait is many things, but troll would be the last thing that comes to my mind.",
				"added": 1549126629
			},
			{
				"comment_id": 52,
				"body": "> [eightyfour](#comment_66_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): sure, it could be legal, but op specified \"nude\" -- which means illegal I'm pretty sure\n\nDepends on your country, really. If your age of consent(AoC) is below or at 15(not as uncommon as you'd think) and there aren't any special restrictions for media, then it isn't.\nStill, I agree with you, I would call it illegal before I'd call it troll\n\n> [htgozn](#comment_258_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): If the original poster is naive enough to go to the most public landing forum page, and post a request asking for incriminating information as the title suggests: \"Take the bait, go to jail\", then the user deserves a mute / global block for reasons of being a provocateur.\n\nWon't argue with that, this is what the mute feature was made to be.\nNevertheless, I don't think that it was a troll. After all ZeroNet is a darknet, so this is what you'd expect to happen at some point.",
				"added": 1549303404
			}
		],
		"1549641944_17Dvd3j3RtTZ8z5xqUDVuc9LqNFVHvdQQC": [
			{
				"comment_id": 53,
				"body": "Actually, yes. Now did you know that ZeroBoard also gets your ip every time you post on there?\n> [t0ny](#comment_9_1DQ97EiEM8nSZ34beMaBepz7cM8zDAFLX3): Is ZeroNet anonymous?\nNot by default, choosing TOR as transport wasn't the best idea. Setting TOR to `always`, setting the tracker proxy to `tor` and **using zeronet in the Tor Browser Bundle _only_** will make you reasonably anonymous, however not as anonymous as tor alone would make you. It's still way better as nothing at all, but p2p weakens it's anonymity and hurts the network.\nOverall I2P would have been the better choice, but lack of a good(updated) library and other factors caused TOR to be chosen instead. But since nofish has recently jumped around in the 'netcode'(for ipv6), is currently rewriting large portions of the source code to upgrade to python3 and a I2P library in python has recently been published(and promoted by the I2P guys) chances are looking good for I2P in the (near) future.",
				"added": 1549650618
			}
		],
		"1549642211_17Dvd3j3RtTZ8z5xqUDVuc9LqNFVHvdQQC": [
			{
				"comment_id": 54,
				"body": "> [t0ny](#comment_10_1DQ97EiEM8nSZ34beMaBepz7cM8zDAFLX3): Zeronet is a project in development.\n+1  \n+1  \n+1  \n+1  \n1-UP  \n  \n  \nI feel like many just really overlook this. ZeroNet is not a finished product, yet. It is still in alpha(may be unstable features will be added and removed)",
				"added": 1549651040
			}
		],
		"1549642501_17Dvd3j3RtTZ8z5xqUDVuc9LqNFVHvdQQC": [
			{
				"comment_id": 55,
				"body": "> [nofish](#comment_1258_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): 0.6.5 is still under testing, it will be officially tagged/released in the next few days.\n\nWouldn't it be a good idea, to wait until python3 is done before you tag 0.6.5 or will that be something on it's own?",
				"added": 1549651188
			},
			{
				"comment_id": 57,
				"body": "> [nofish](#comment_1259_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I'm planning to tag py3 version as 0.7.0\n\n\\\\\\_(^o^)\\_/ Exciting!\nWill python3 be the only change until 7.0.0?\nWhat is the roadmap for 2019? Do you have any plans for ZeroNet, yet?",
				"added": 1549657350
			}
		],
		"1549631999_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 56,
				"body": "I don't think putting the burden of work on the victims rather than the attacker is the wrong direction.\nShot in the dark, but a PoW system could be a good idea, here.\n  \nAs an example: Make a post only valid if a hash of the post has a certain number of 0s in front(like bitcoin blocks) and make that number depend on the time spend on zeronet, since the certificate registration(maybe with a timestamp from a random peer already possessing a certificate and using the zeronet time consensus) and the entropy of the message that should be sent(and maybe post frequency).\n  \nThis will make it more and more expensive for an attacker to attack, but leaves the users and the attacked zite(-owner) at peace(ignoring possible computation DDoS issues in this example).",
				"added": 1549652772
			}
		],
		"1549791989_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 58,
				"body": "You try to look up `json_id` in the `user` table, this won't work.\n`json_id` is an automatically generated row by zeronet and links users and their content on each table together.\n`json_id` can be understood as a reference to the content.json of the user, that something else belongs to.\nZeroNet generates the `json` table which contains all the corresponding values to the `json_id` reference, such as `site`(=hub), `directory`, `file_name`, `cert_auth_type` and so on.\nDoing:\n```\nselect * from json where json_id is '4439'\n```\nshould work as expected.\nFor some deeper understanding, I would suggest to install something that allows you to see into `.db` files or take a look at the [dbschema.json](/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/dbschema.json) of ZeroMe",
				"added": 1549827439
			},
			{
				"comment_id": 59,
				"body": "> [leftside](#comment_570_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): But Why some IDs still work with from user table??\n\nBecause ZeroNet also generates these references for the `user` table(in fact ZeroNet generates them for every table in every database). Since the `json_id`s are counted up, you'll find that especially the lower(so `json_id`=1 or 44 or 853 for example) ones will be on there by chance. They most likely won't point to the same user, though. The reason for that is how exactly ZeroNet generates these references.",
				"added": 1549908763
			}
		],
		"1549977746_1E8jBAziTnrJcoWWSG2D15t7JdxhTdT7gH": [
			{
				"comment_id": 60,
				"body": ">Why is Millchan the most popular website among many Zerosites?\n\nWell, imageboards(chans) have a deep rooted history in the internet and are still beloved by many to this day. So this probably helps. But that aside it is visually pleasing has little bugs, active developer who **quickly** fixes them and the (in the past) most popular imageboard ([0chan/nullchan](/1FiSxj2yDPeGuuf6iBwRAXvEMQJATAZNt6)) now redirects to millchan as the original dev left some time ago. \n\n> [leftside](#comment_590_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Regarding the density of its recent posts, I don't think it's something successful...\n\nFiles on millchan are actually pretty well seeded, so there are probably just a lot of lurkers on there, not that that would change much anyways.",
				"added": 1549994018
			}
		],
		"1550128123_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": [
			{
				"comment_id": 61,
				"body": "> [ssdifnskdjfnsdjk](#comment_672_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @squarezero onion addresses of the peers are discovered by Zeronet in background. If you want your tor browser to open it instead of http:// then i think it is not vig benefit, because your connection to the http:// site already go thru Tor network and it is not likely Bad exit node would supply you wrong site instead of proxy? [...]\n\nPretty sure he meant having `raolmpedjrggms6t.onion`(Dead) instead of `0net.io` (an onion domain).\nAs for the question: No, not that I'm aware of there have been some in the past, but they are all offline at this point in time.",
				"added": 1550174675
			}
		],
		"1550689032_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 63,
				"body": "Well and suddenly all of my fear based paranoia about security and anonymity for all these years will pay of. Neat!\n\nBut jokes(?) aside, this would be devastating. \n\nJust plain non-pedo lolicons aside, many pedos use loli and erotica as a way to cope. For those, it often acts as a barrier separating illegality and something everybody does and desires every single day, a sense of normality, if you will. Something they can do to create distance from the real and the not-real. If you ban loli for the same reason, as you do CP, you are merging these two and one is essentially no longer able to distance himself from reality. Once you are a criminal and the world calls you that, your brain will, at some point, adapt (subconsciously as well) and make you act as though you are a criminal. In other words: The jump from legal to illegal is way harder to make, then the jump from illegal to just as illegal and other illegal things.\n\nBut anyways, I think my opinion on this is pretty much known already, so I won't bother to contine making a huge wall of text here, that essentially repeats what I stated in the past, as well as all points of nekololis post.(unless someone wants me to)\n\nI personally hope this just does not get though, but seeing that this is (as always) a pretty much entirely emotional debate rather than anything else, chances don't look all too great.",
				"added": 1550772875
			}
		],
		"1550688425_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 64,
				"body": "For more info on the current state on I2P see [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/3@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) gitcenter issue. It contains references to all PRs and issues on ZeroNet relating to it.\n\n> [kaffie](#comment_793_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \n\nI haven't really had a good look at cjdns/yggdrasil, so I cant really tell you where the differences are in those and i2p, but I can tell you about the difference of TOR and I2P.\nIn a nutshell: Tor makes TCP connections anonymous; I2p makes UDP connections anonymous.\nAs a reminder: \n- TCP: Think of it like tunnels your computer and the computer you want to connect to. Building the tunnel is difficult and requires a lot of work on both sides, but once the tunnel is done sending messages through that tunnel is a bliss. There is no traffic that interferes with your message(it's fast), you message is guaranteed to reach the other side and you know what path you message took.\n- UDP: Think of it like the public mail. If you want to send a message from A to B you write a letter and give it to the mailman, who delivers your letter to B. However he takes his time, takes takes a different path to B for every message you send and might just loose your message altogether.\n\nSo TCP is optimal if you need to send a lot of messages to **one** other computer\nand UDP is optimal if you need to send a lot of messages to **many different** computers.\n \nSince torrent makes lots of small messages to lots of computers UDP is the better protocol for that, and thus I2P would be the better choice as an anonymity layer.\nDue to the way TOR and I2P work:\n- Lots of TOR connections weaken your anonymity (in some cases immensely)\n- Lots of TOR connections will slow down the entire TOR network, effectively DDOSing it.\n- Few TOR connections strengthen your anonymity (in most cases immensely)\n- Few TOR connections will make the entire TOR network faster.\n\nIn contrast:\n- Lots of I2P connections strengthen your anonymity\n- Lots of I2P connections will speed up and benefit the entire I2P network.\n- Few I2P connections weaken your anonymity (in most cases immensely)\n- Few I2P will make the entire I2P network slower.\n\nRelated to this, to access the I2P network, one needs to have the I2P router running. Your speed on I2P and anonymity increases with the amount of time that you router is online, this lines up pretty nicely with ZeroNet, which is also best for everyone if left online for 24/7.\n\n\nThe ~~long~~ technical, but still simplified version:\n##TOR\nTOR stands for **T**he **O**nion **R**outer and builds on the idea that you messages are send, tucked in layers of encryption and then send through some chosen computers, that can each only read one layer of encryption. The computer the message was intended to will recognize this because it is the first computer in the chain that can actually read the message, instead of just seeing a 'send here next' and random encrypted data.\nassume you want to send message \"Hi bob\" to bob through TOR, you first need to choose the computers you want your message to go through let's say you chose computers `A`,`B` and `C`. What you now do is you message each of them and get their public key. You then choose the order in which the chosen computers should be messaging each other in this case we want `You->A->B->C->bob` and begin the construction of you TOR message. You first leave instructions on what `C` should do with the message and then encrypt your message with the public key of `C`, so only C can read that message, `C(\"send this to 123.231.132.213;\" + \"Hi bob\")`, which would (for example) be equal to: ` \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"`. Now, since you want `B` to be before `C`, you take that scrambled(encrypted) text, include instructions what `B` should do with it and encrypt those, such that only `B` can read it, `B(\"send this to C;\" + \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\")`, which would (for example) be equal to: `1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8`. Now, since you want `A` to come before `B`, you do that same as before: leave instructions for `A` and encrypt the message, `A(\"send this to B;\" + \"1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"`, which would (for example) be equal to: `1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz`. And just like that you are done. You now only need to send `1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz` to `A` and bob will receive your message.\nHere is how you, `A`, `B`, `C` and bob will see your communication.\n1. [you] send `\"1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\"` to `A`\n2. [A] receive `\"1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\"`\n3. [A] can I decrypt this with my private key?\n4. [A] I have `\"send this to B;\" + \"1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"` now\n5. [A] no idea what `\"1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"` means, but I know what to do with `send this to B`.\n6. [A] send `1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8` to `B`\n7. [B] I only know that you gave me something I don't understand and that I should send that to `B`\n8. [B] receive `\"1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"`\n9. [B] can I decrypt this with my private key?\n10. [B] I have `\"send this to C;\" + \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"` now\n11. [B] no idea what `\"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"` means, but I know what to do with `send this to C`.\n12. [B] send `1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG` to `C`\n13. [B] I only know that `A` gave me something I don't understand and that I should send that to `C`\n14. [C] receive `\"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"`\n15. [C] can I decrypt this with my private key?\n16. [C] I have `\"send this to 123.231.132.213;\" + \"Hi bob\"` now\n17. [C] know and can log what `\"Hi bob\"` means, but there is also this instruction I understand `send this to 123.231.132.213`.\n18. [C] send `\"Hi bob\"` to `123.231.132.213`\n19. [C] I know the content of the message and where it should go to.\n20. [bob] receive `\"Hi bob\"`\n21. [bob] neat, but I only know that `C` send me this.\n\nAs you can see, no one knows who the message originated from since no one can know, if you made the message or if you just did what `A` and `B` did.\nHowever you might also be able to see that `C` is able to read your message, the reason for that is that bob and you didn't encrypt your message. If you send a message over the TOR network and that message leaves the TOR network, that it must leave the TOR network in a way that 'outsiders' can understand, if you and bob chose not to encrypt your message then it must be delivered in decrypted form to him, with makes the last computer within the TOR network(one could call it an `exit node`) able to read your message and because `C` is the one that sends it to bob he also knows who bob is.\nHow do you solve this? Well one way is to tell bob to use the TOR network as well, so that the message never leaves the TOR network. In this case, this is how you, `A`, `B`, `C` and bob will see your communication.\n1. [you] send `\"K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\"` to `A`\n2. [A] receive `\"K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\"`\n3. [A] can I decrypt this with my private key?\n4. [A] I have `\"send this to B;\" + \"N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"` now\n5. [A] no idea what `\"N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"` means, but I know what to do with `send this to B`.\n6. [A] send `1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8` to `B`\n7. [B] I only know that you gave me something I don't understand and that I should send that to `B`\n8. [B] receive `\"N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8\"`\n9. [B] can I decrypt this with my private key?\n10. [B] I have `\"send this to C;\" + \"CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"` now\n11. [B] no idea what `\"CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"` means, but I know what to do with `send this to C`.\n12. [B] send `CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG` to `C`\n13. [B] I only know that `A` gave me something I don't understand and that I should send that to `C`\n14. [C] receive `\"CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"`\n15. [C] can I decrypt this with my private key?\n16. [C] I have `\"send this to bob;\" + \"Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\"` now\n17. [C] no idea what `\"Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\"` means, but I know what to do with `send this to bob`.\n18. [C] send `\"Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\"` to `bob`\n19. [C] I know the content of the message and where it should go to.\n20. [C] I only know that `B` gave me something I don't understand and that I should send that to bob\n21. [bob] receive `\"Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\"`\n22. [bob] can I decrypt this with my private key?\n23. [bob] I have `\"Hi bob\"` now\n24. [bob] neat, but I only know that `C` send me this.\n\nNow `C` doesn't know that bob was the destination and has no idea what the contents of the message were. \nWe have just (in a simplified form) invented `.onion` addresses.\n\n##I2P\nI2P is based not on onion routing, but on garlic routing, a modified version of onion routing. Basic communication structure is the similar, but each new computer that receives your message can append another message to it, before it sends it to the next one, such that a single I2P message contains multiple messages from different people to different people (like a garlic, wrapped in layers and containing many 'things' on the inside). I2P messages are also not send from one computer to another, but from one computer to possibly many.\n\nFor more details I can only highly encourage you to check out the wikipedia page for [TOR](https://en.wikipedia.org/wiki/Tor_%28anonymity_network%29)(Clearnet) and [I2P](https://en.wikipedia.org/wiki/I2P)(Clearnet)",
				"added": 1550870136
			}
		],
		"1551618955_163wft59zLGW1zNA6WBsppjFEbXxAfAseY": [
			{
				"comment_id": 65,
				"body": "\\>new\nAlmost.\n\nBut jokes on the eternal development for GNU projects aside, I'm actually really exited for gnunet.",
				"added": 1551646936
			}
		],
		"1552060063_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 66,
				"body": "Tails does a lot of things to protect you, one of these things is to block access to the Tor control cookie which I think is the reason why most attempts on making ZeroNet on Tails happened have failed.\nSee [this](/Talk.ZeroNetwork.bit/?Topic:1529178927_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL) ZeroTalk thread or [this](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1DJEfWgdJ3rGnqCrKwLrBdQGodRaEBkAry:zeronet:861def6c-ea45-40cd-ad49-833692db99be) Millchan thread for more more on that.\nOn a related note, [this](https://github.com/HelloZeroNet/ZeroNet/pull/484)(Clearnet) Github PR could solve it.\n\n> [deliriumgoddess6](#comment_1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): what it gives?\n\nIt's required for ZeroNet to run(=a dependency).",
				"added": 1552068261
			}
		],
		"1552916412_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 67,
				"body": "> [deliriumgoddess6](#comment_8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): i`ve seen that video. so its really safer than tor even?\n\nDepends on what you are using it for. I explained that in more detail in [this](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1550688425_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6) thread\nIn a very broad stroke: Yes, since Tor relies on central hardcoded trusted servers, while I2P does not. However Tor has a (comparatively) massive budget, state level interest in staying anonymous and (in contrast to many opensource projects) a large number of random people who actually check and audit the source code regularly. The Tor network is also more used and (mainstream)popular then I2P, which improves plausible deniability if you get v&.",
				"added": 1552931976
			},
			{
				"comment_id": 68,
				"body": "> [satoxyn1](#comment_18_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): This is hoax. When Tor developers say that Tor should not be used with Bittorrent, they refer to usual Bittorrent clients which will connect only to clearnet nodes, hurting Exit Node bandwidth.\n\nWith tor you are not using one circuit for all connections. The usual circuit has 3 nodes, all in series. This means all data you send and receive will go through all these nodes for all circuits you use to torrent. Since the download is split among many circuits that are all likely to be performed with the max bandwidth per connection of the weakest node blocking these off from other nodes. Also, because tcp the connection creation is computationally expensive and takes time, it will (to some extend) block the node you're currently using from making other circuits. Circuits being frequently created and destroyed(say if you have many frequently changing connections), effectively DDOSes the network. Both hurt(and slow down) the network.  \n\nAlso the more connections(circuits) you make, the easier and stronger correlation and sybil attacks become, this hurts your anonymity.  \n\nIt is not a hoax, there are good reasons not to torrent over Tor.",
				"added": 1552935494
			}
		],
		"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 69,
				"body": "Good to have you back!\nCan you make KxoVid usable in Tor Browser?\nIssues: Icons are not rendered, the routes (clicking on things does nothing until a page reload) and the hubs are either all empty or don't fetch content.",
				"added": 1552937872
			},
			{
				"comment_id": 73,
				"body": "> [krixano](#comment_634_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): pexo, the icon stuff is a ZeroNet Bug, and @zerolstn has reported this to the ZeroNet GitHub page today, here: https://github.com/HelloZeroNet/ZeroNet/issues/1931 [...]\n\nLongshot, but how much dies KxoVid rely on `fileQuery`? Because I'm seeing a lot of empty arrays pop up in the js console.  \nFor some reason `fileQuery` always returns empty arrays for me, regardless of input(on the zites that I'm working on, at least). Any idea why that could cause, btw?",
				"added": 1553274941
			},
			{
				"comment_id": 74,
				"body": "> [krixano](#comment_643_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It doesn't. It uses dbQuery. [...]\n\nWell back to square one. Clicking on anything on the main page will only change what's in the url bar, nothing more.\nThese are the errors in my js console:\n```\nReferenceError: chrome is not defined\nStack trace:\nbeforeMount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2465:3133\nyt@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:14734\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63575\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:86058\n[403]</</</pn.prototype._init@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:29451\npn@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:26346\n[412]</<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2465:977\n[412]<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2464:2\no@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:1:257\nr@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:1:431\n@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:1:2\n all.js:2411:10809\n\n_____________________________________________________________\n\nSource map error: request failed with status 404\nResource URL: http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js\nSource Map URL: all.js.map[Learn More] \n\n_____________________________________________________________\n\nTypeError: e.style is undefined\nStack trace:\nJr@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:46328\nGr@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:47092\ny@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:53235\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52576\nh@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:53002\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52561\nh@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:53002\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52561\n[403]</</</wi</<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:56490\n@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:30918\n[403]</</</pn.prototype.$mount/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63615\n[403]</</</At.prototype.get@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:15945\nAt@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:15870\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63595\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:86058\ninit@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:21059\np/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52180\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52069\nh@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:53002\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52561\nh@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:53002\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52561\n[403]</</</wi</<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:56490\n@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:30918\n[403]</</</pn.prototype.$mount/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63615\n[403]</</</At.prototype.get@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:15945\nAt@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:15870\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63595\n[403]</</</pn.prototype.$mount@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:86058\ninit@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:21059\np/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52180\np@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:52069\nx/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:55216\nx@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:54799\nx/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:54949\nx@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:54799\nx/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:54949\nx@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:54799\n[403]</</</wi</<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:56541\n@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:30894\n[403]</</</pn.prototype.$mount/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:63615\n[403]</</</At.prototype.get@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:15945\n[403]</</</At.prototype.run@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:16836\nxt@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:14977\nWe/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:11461\nVe@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:2411:10919\ns@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:1251:1561\nnotify/<@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:1251:1723\na@http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/js/all.js:411:343\n all.js:2411:10809\n\n_____________________________________________________________\n\nTypeError: t.userInfo.keyvalue.subscriptions is undefined[Learn More] all.js:2465:5762\n\n_____________________________________________________________\n\nTypeError: t.userInfo.keyvalue.subscriptions is undefined[Learn More] all.js:2465:5762\n\n_____________________________________________________________\n\nTypeError: t.userInfo.keyvalue.subscriptions is undefined[Learn More] all.js:2465:5762\n```\n And some `Cross-Origin Request` errors.\nMaybe those are somehow related.",
				"added": 1553275791
			},
			{
				"comment_id": 75,
				"body": "> [krixano](#comment_644_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Ok. I'll look into this as best I can. [...]\n\nIt is and cache is clean.",
				"added": 1553283099
			}
		],
		"1553103471_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 70,
				"body": "ZeroBoard was(is) an really old proof of concept zite to showcase how dynamic content could work on ZeroNet. It heavily relied on a backend server, that would receive the posts and sign and publish them. Nofish said a few months(I think) back, that he was planning to pull the plug at some point.  \nSo I think that's just what happened.",
				"added": 1553104174
			},
			{
				"comment_id": 71,
				"body": "> [satoxyn1](#comment_22_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): NoFish could at least leave a message that the board is now longer works.\n\nIt could also be that the signing server died/messed up and nofish just doesn't know about it or has better things to do.",
				"added": 1553104660
			}
		],
		"1553166302_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 72,
				"body": "> [nekololi](#comment_349_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): why merely threaten the user with giving their ip and info over to authorities, rather than just fucking doing it?\n\nProbably because they wouldn't have anything on him. Europol or not(and since there is that \"depending on your network\"(no mention of DC++) this probably isn't even an Europol thing), international stuff is always complicated, since your evidence needs to be approved by the country where it was found(to some extend) and the country where you are in, in order to have any legal strength and even then it can be difficult since court rulings of both countries would need to back this transfer of evidence(since the country you live would have to blindly trust, that the police agency from the other country isn't lying about/crafting the logs they have against you) in order for that to happen. \n  \nAnd all that is assuming that there even is real evidence. Different countries have different thresholds as to when you are guilty or not. Additionally whether or not  you actually had the intention or not(provocative file names are enough to indicate intention for some countries but all) to actually download CP doesn't even matter, because in many countries you need to actually have possessed CP in order to be guilty of anything. Since they(that is at least what I have to assume) didn't actually give you CP, but only these perfectly legal images of the police guy you would be perfectly fine.\n  \nAnd even all that is made under the assumption, that they even have your IP, since more and more people(thankfully) use something like a VPN, public/private proxy or actually TOR, I2P and so on. The police would need to spend a considerable amount of time, resources and money even finding out which of these if the case not to mention all that across possibly multiple boarders. That can take months, if not weeks depending on the effort you made to keep you safe. And all that is needed to find just one single offender, that may still go completely free for one or more of the other reasons I mentioned above. The question here is really, whether or not that single guy is worth the amount of effort put into finding and arresting him. And in all odds it really isn't.\n\nThis is part of the reason why networks like TOR would still be fairly safe **even __if__** they where compromised, because it is already hard for TLAs to do anything to you if you are on clearnet. Added to that is, that you are only one insignificant guy, who most likely would've never even been guilty of anything 'real' anyway and the fact that you are under thousands if not tens of thousands that are just as guilty as you.\n  \nIn all actuality there are still many pedos who use the clearweb for that sort of stuff and a combination of all of the above are the reason as to why they you're not seeing them drop by the hundreds. It is physically impossible. That is why they rely on scare tactics(try to make you scared enough, that, in hopes of a better sentence, you turn yourself in) and never really go after individuals that aren't actively running forums and the such.",
				"added": 1553190476
			}
		],
		"1553710396_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 76,
				"body": "You can look at the peer numbers of ZeroHello, since that is a zite that almost everyone will have.\nBut you have to look at it over a long period of time(not really accurate) and if you are currently downloading it will show you more peers then there really are. Also you need to have Tor enabled(so your node makes clearnet and tor only connections).\n\nAs far as I can tell for the Tor only network: There have been (pretty much constant) around 1000 peers over the last month or so.",
				"added": 1553711069
			}
		],
		"1553888479_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 77,
				"body": "I'd say make the HDD a LUKS ext4 filesystem and mount it on boot using a keyfile, that only root can access.\n- LUKS = encryption (search for `cryptsetup` or `LUKS` for more info on that)\n- NTFS has a limit on the max length of any directory path which could be an issue for some sites, since an bitcoin address is around 50 chars already, ext4 has no limitations for the length of any directory path. (see [Comparison of file systems](https://en.wikipedia.org/wiki/Comparison_of_file_systems)(Clearnet))",
				"added": 1553890476
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 78,
				"body": ">Im wondering if this thing is dying or growing?\n\nCurrently somewhere in between. The number of people leaving and joining are roughly equal.  \nThe main dev is still around and doing developer things.\n\n>How was the traffic before and how do you think it will be in the future?\n\nSlowly getting more, hopefully further increasing as people get fed up being censored often for no reason whatsoever. Also the ability to host websites without any money needed(no need to rent servers) and a really good scaleability(at least on protocol level) is a pretty nice property that could attract more people.",
				"added": 1554144640
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 79,
				"body": ">how long does it take until here it will be all only about revenge porn and pedofilia. \n\nIt doesn't need to be this way. Zites that work with hubs(like ZeroMe or MillchanEngine), for example are a great way of showing this: You block the hubs you don't want to see/seed and not have to worry about them. You can't ban them anyway, they still exist whether you are choosing to look at them or not.(This applies whether you are on clearnet or not, by the way) \nOn a site note: There is an argument to be made here, that pedophiles are pretty much always among the early adopters for 'things that are impossible to censor'.\n>I think the git maintainers should made a COC or something like that.\n\nWhy? How would a CoC prevent people from using the network?\n>\"what horrible place the depp web is and all is only drug and weapons\"\n\nWell at least until your government is murdering civilians on the streets for demanding such ridicules things as human rights. Please don't forget that networks like TOR save thousands of lives daily.\n>What do you think, how can we improve it, should we open a issue on github?\n\nHonestly, I think it works as intended. Protecting those censored on the clearweb and being fast and resistant.",
				"added": 1556214396
			}
		],
		"1556966006_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 80,
				"body": "> [fantoski](#comment_9_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): I'd rather avoid using these kind of tools to have a code I can understand and use anywhere, I guess I'll use that if there isn't a single possible solution which I guess there is considering other zite creators managed to create thumbnails ( Even though the only examples I've found created several thousands of lines of framework for their zite which don't result in functions usable outside of their code ).\n\nAs far as I know all of them make use of the canvas element(you can google where to go from here), but keep in mind that some people will use the Tor Browser Bundle to access zeronet, where canvas access is heavily restricted. In order to support the TBB you likely need to use JIMP (or similar) (if you find a way around this, without the user having to configure anything, please let me know). If you want to look at how that could be implemented look no further then millchan(specifically (all are clearnet links) [writeThumbnails()](https://gitgud.io/millchan/Millchan/blob/master/js/millchan/millchan.js#L909), [class Thumbnails ](https://gitgud.io/millchan/Millchan/blob/master/js/millchan/thumbs.js) and [the thumbnail worker](https://gitgud.io/millchan/Millchan/blob/master/js/millchan/thumbs.worker.js) )",
				"added": 1556989768
			},
			{
				"comment_id": 81,
				"body": "> [glightstar](#comment_132_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Oh, right, canvas support for the Tor Browser Bundle is a good point..As a question then, does it e.g. work for uploading an image on ZeroMe, if you happen to know?\n\nNot at all. It also uses the canvas element. Avatar images are white, posted images are white and the otherwise neat blurry preview is - you guessed it - also white. \nSomewhat related: I started to write a anonymous ZeroMe client some time ago, where I also wrote quite a bit of code to fix this issue, but sometime down the line realized that you currently cannot make anonymous posts on zeronet. Unfortunately it's impossible by design right now, so no way to code my way around this in JS. See [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/8@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) issue for more info on that. I decided to pause that project until the issue gets resolved. Still have the code around somewhere, I think.",
				"added": 1556991296
			},
			{
				"comment_id": 82,
				"body": "> [glightstar](#comment_133_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Does JIMP actually work for Tor users then, opposed to the Canvas method?\n\nYes, it's a bit slower(but not as bad as you might think), but works like a charm, you even get a lot more control over the image if you are okay with taking the performance hit. For most cases however, you should detect whether or not a user is a TBB user or not and then use canvas whenever possible. Hardware acceleration and native code sure is nice. But (for good reason**s**) this can't be done on TBB. I have tried webGL, 'webCL', and webassembly, if you find a efficient way to do this: Millchan is always open for PRs or at least (please) tell me or mcdev(or on millchan /dev/).\n  \nBut download the TBB and see for yourself, you never know when it might come in handy to have tor just sitting around on your HDD ; )",
				"added": 1556996358
			},
			{
				"comment_id": 84,
				"body": "> [fantoski](#comment_11_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Obviously, like ZeroMe, Millchan has a fucking fat framework... I can't get Jimp to work. It always throws an error, doesn't tell me what the error is, just that there is an error and it ceases to work. How the fuck am I supposed to debug something if there's no error message... I'm stuck. I tried everything and that's precisely what doesn't work. I guess the solution IS to write a multiple thousand of lines framework to resize a fucking image.\n\nWhat did you do? Do you have a repo somewhere? I have a fairly good knowledge of it now any maybe can help you.\n\n\n> [glightstar](#comment_134_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Well or first implement canvas and then come back to implement JIMP :)\n\nDepends on how you are, I guess. I always implement from general to specific, whenever possible.(JIMP will always work everywhere that runs JS)",
				"added": 1556997656
			}
		],
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 83,
				"body": "I haven't really gotten around to test Py3 which is supposed to be a lot faster, but zeronet currently doesn't handle a lot of activity very well, since all `content.json`s must automatically be downloaded and retrieved(and checked). Your client effectively DDOSes itself if you have somewhere around 20 posts per second on any zite at any one time. You could see that if you were on millchan about haft a year ago, when a fairly large site of, let's say, politically minded individuals linked to it and zeronet became unusable for about two to three days or so for those that had millchan and didn't pause it because the client couldn't keep up updating the `content.json`s.",
				"added": 1556997235
			}
		],
		"1557421253_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 85,
				"body": ">is using Tor Browser with Tor enabled really important on ZeroNet / good enough to feel safe ?\n\nYes, not only do you feel more safe, you actually are. The TBB forces website/zite traffic through the Tor network. Zites on zeronet can make requests to clearnet servers(due to the way js is build) and as soon as a zite makes connection to any clearnet site, that site knows your ip address and (depending on implementation) also maybe that you came from zeronet, if the referrer was set(for example to 127.0.0.1:43110). ZeroID, for example, sends the data that needs to be signed to a server that knows the zeroID signing key. That server is a clearnet server and if you didn't use the TBB that server now knows your ip. ZeroBoard was made like this as well.\nAlso the TBB does a lot of stuff behind the scenes to make tracking you as hard as possible.  \n  \nTL;DR, yes it is important.",
				"added": 1557423057
			},
			{
				"comment_id": 86,
				"body": "> [fantoski](#comment_25_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Thanks for all the information. I suppose using the Tor Browser and hoping ZeroNet devs work on fixing some stuff about it is the way to go then.\n\nYeah, that's the way to go for now.",
				"added": 1557424951
			},
			{
				"comment_id": 87,
				"body": "> [insurgo](#comment_4_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): [...]tor alone is better. [...]\n\nI disagree. Even if you have a VPN-provider that does nothing but to spy on you the only thing he can learn is that you connected to the tor network and what your first hop was. But what that also does is hiding the fact that you used TOR from your ISP. If you use a VPN in a country that your TLA isn't partnered with, they'd need to go through the drooling process of getting the logs from another country just to find out you were using tor. This is the lower bound of the additional security you can get when using VPN before TOR(remember kids, VPN after TOR will negate **any** anonymization the TOR network does to your traffic)that you shouldn't just dismiss.\n\n> [caryoscelus](#comment_151_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Can't say how reliable that is, though.\n\nThat's the thing: Me neither.\n>But personally i would advise doing that even if you route all (including clearnet) traffic through tor, because besides IP leaks, there can be other ways to identify you using JS\n\nYes, the TBB does a lot to protect you from those, but it isn't ultimate. So until we get html only zites (that can actually be dynamic) this is the way to go.",
				"added": 1557687141
			},
			{
				"comment_id": 88,
				"body": "> [anonymouslogin](#comment_299_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): VPN before TOR makes the traffic unintelligible to the TOR network\n\nThat's not how a VPN works: [YourHome] -> `YourData` -> Encryption ->`43fAOy36` => [Provider] -> decrypt -> `YourData` => [Internet]\nAlso please keep in mind money **always** leaves traces. If someone targets you, you need crazy good OPsec to remain anonymous if you paid money(cash) to anyone **once**. Even things like Bitcoin that don't belong to you identity are hard to get hold of (and spend) in an anonymous way.\n\n> [anonymouslogin](#comment_298_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm curious about Qubes. What do people think about that OS?\n\nI'd rather see them base Qubes of seL4 rather then Xen, but it's really secure. There are things to consider, but for all intends and purposes, for the average Joe it makes you basically invincible.\n> [insurgo](#comment_6_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Users of VPN have to be aware of that and do their choices accordingly.\n\n+1\n> [chinchin](#comment_3_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): true but that means that you would need to get a second graphics card\n\nYou don't need a good graphics card. Qubes really doesn't need much GPU power. An SSD and fast CPU are a much bigger factor.",
				"added": 1557769157
			},
			{
				"comment_id": 90,
				"body": "> [anonymouslogin](#comment_300_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): But if your home is accessing the TOR network, then your data coming out of the VPN gateway is bound for the three hop encrypted journey to the final destination. No?\n\nYes. Over TOR it there are these possibilities:\n1 VPN before TOR:\n[YourHome] -> `YourData` -> Encryption -> `43fAOy36` => [VPN_Provider] -> decrypt -> `YourData` => [TOR_Relay#1] => [TOR_Relay#2] => [TOR_Relay#3] => [Internet]\n2 VPN after TOR:\n[YourHome] -> `YourData` -> Encryption -> `43fAOy36` => [TOR_Relay#1] => [TOR_Relay#2] => [TOR_Relay#3] => [VPN_Provider] -> decrypt -> `YourData` => [Internet]  \n  \nYour VPN provider can basically be considered to be a '''TOR_Relay''' that knows who you are and what you want to access at what time, that you pay them to keep your identity safe. A TLA would need to work from `[Internet]` backwards to find you. That means that if you have VPN before TOR, the VPN becomes your last line of defense and one more hurdle to finding you. If you have VPN after TOR, however then the first thing they see is a VPN which you have paid money to this will be used to find you nearly instantly. You basically reduce the anonymity to the anonymity of your VPN(barely nothing at all). Also in option 2 your VPN provider can see the cleartext of what you sent and received, whereas in the first option they can only see random TOR traffic..",
				"added": 1557944891
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 89,
				"body": ">I will help bad people. I will help criminals, murderers, pedophiles, thieves.\n\nI don't feel like a bad person…\n>You created a monster. I was a really good person.\n\nIf you don't mind: What happened?",
				"added": 1557944003
			}
		],
		"1557991095_12kqbnJ3QpaT6extMyBhPzaWvbi8xkPVbt": [
			{
				"comment_id": 91,
				"body": "> [deliriumgoddess6](#comment_36_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): i dont think so.\n\nYou think wrong.\n@d00d: Yes there is. I, for obvious reasons, will not post them here, but if you want to I can send them to you via [ZeroMail](/1MaiL5gfBM1cyb4a8e3iiL8L5gXmoAJu27). Otherwise go to millchan and continue from there, you will get to it sooner or later. Remember to use TOR always mode, set trackers to tor and browse zeronet with the Tor Browser Bundle. If you have any questions feel free to ask me!\nAlso try not to be an asshole and keep legally difficult on topic stuff on on topic zites.",
				"added": 1558029520
			},
			{
				"comment_id": 92,
				"body": "> [kidcourageous](#comment_11_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Moreover, you should ideally use Qubes/Whonix to browse Zeronet if your intention is to download/host these sorts of sites.\n\n+1\n>I take it a step further by routing through i2p, Freenet, and a VPN though ymmv on this depending on your level of technical prowess.\n\n???",
				"added": 1558030458
			}
		],
		"1558282143_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 93,
				"body": "You mean download or loading it to your zite?\nFor Download you could use `FileNeed(...)`.\nLoading is difficult since there is technically only `FileGet(...)`, which you said didn't work. You can try to use AJAX, since it should be able to handle these kinds of loads `wrapperGetAjaxKey(...)` or `ZeroFrame.monkeyPatchAjax()`.",
				"added": 1558285005
			},
			{
				"comment_id": 95,
				"body": "> [filips](#comment_27_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I tried this with wrapperGetAjaxKey, but it didn't work. Also see linked issue for details. I will try to debug this next week.\n\nGood luck with debugging. Please tell me if you managed to resolve it.",
				"added": 1558376725
			},
			{
				"comment_id": 96,
				"body": "> [filips](#comment_32_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Could this be ZeroNet bug?\n\nSure does sound like it. I would definitely open an issue on that either on [gitcenter](/1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/) or [github](https://github.com/HelloZeroNet/ZeroNet/issues).",
				"added": 1558895978
			}
		],
		"1558277346_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 94,
				"body": "> [fantoski](#comment_35_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): If HTTPS is on, it's not really a problem is it ?\n\nMan in the Middle attacks are still a thing(also fishing). There are many reasons why this is potentially bad. Not everyone has a VPN, on an open WiFi network your device basically screams everything you receive/send over the internet(including system updates and similar) into your surroundings. If anyone is louder then the router you are connected to your device can be made to think that they are the router.",
				"added": 1558285380
			}
		],
		"1558983538_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 97,
				"body": "> [daz](#comment_40_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Could you just down load the app put it in a folder start the app up roam around the sites so installing them inside the folder you could not sure how safe it would be but you could get a name and get it all working then remove the jason file from the folder turn it into a torrent and share the torrent /magnet. But I am sure some zeroworld  boffin will tell you a super cool way to do it.  maybe we could get free seeders for our uploads friends of Zeronet\n\nThe Idea would be that people from outside of ZeroNet would be able to seed and download files from zites if they are given the magnet/torrent file, in such a way that ZeroNet peers can find them and they can find those ZeroNet peers that seed the zite that has the file they want. So basically support from the outside.",
				"added": 1559067369
			},
			{
				"comment_id": 98,
				"body": "> [caropc1](#comment_10_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE): I think ANY way to improve decentralization, the power of the network, to me this is good YES. [...]\n\nI don't know how much of the BitTorrent base is still left in ZeroNet and I don't really have the time right now to investigate.\n\n @nofish: If it's possible how about a plugin/zite that lets generates a torrent file/magnet link for a file(or list of files) that anyone with a BitTorrent client can open/download, if given the file/link?",
				"added": 1559674799
			},
			{
				"comment_id": 102,
				"body": "> [nofish](#comment_1273_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The download protocol is different from bittorrent to allow to change the content later\n\nShame.\n>so to add this feature it would need to include a bittorrent client in zeronet.\n\nHow much effort would it be to do that? Could it be something worth adding to the roadmap?\n(Come to think of it: What even is the roadmap right now?)",
				"added": 1560277718
			}
		],
		"1559711646_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 99,
				"body": "All links are to clearnet.\nZeroNet is depends on the bitcoin crypto be remain intact(usable), that means [ECDSA](https://en.wikipedia.org/wiki/Elliptic_Curve_DSA) crypto and the [Secp256k1](https://en.bitcoin.it/wiki/Secp256k1) curve need to be safe, since that is what's being used to sign and publish files on here. Unfortunately, like most things, it is absolutely destroyed by Quantum computers. Specifically a modification of [shor's algorithm](https://en.wikipedia.org/wiki/Shor%27s_algorithm)(the one that breaks the prime factorization based RSA encryption) has [already been made](https://en.wikipedia.org/wiki/Elliptic_curve_cryptography#Quantum_computing_attacks) that can [efficiently solve](https://security.stackexchange.com/questions/33069/why-is-ecc-more-vulnerable-than-rsa-in-a-post-quantum-world) the [discrete logarithm problem](https://en.wikipedia.org/wiki/Discrete_logarithm#Cryptography), which is the bases for elliptic curve cryptography(that's what the EC stands for in ECDSA). So yeah, really bad news for ZeroNet, since whoever has the private key of a zite, which a quantum computer can compute from only a signature and a public key, can decide what content the zite shows or in other words censor it or take it down. What makes this even worse is, that while there are many [cryptography proposals](https://en.wikipedia.org/wiki/Post-quantum_cryptography), that are believed to be 'quantum secure', they all are either not proven(formally analyzed) to actually work or **way** to slow/big to be viable in use. AFAIK a good post-quantum cryptography algorithm is still subject of heavy academic research. TOR will also be [hit by this](https://tor.stackexchange.com/questions/4649/does-tor-team-have-plans-to-implement-post-quantum-asymmetrical-encryption-schem) **really hard** basically granting one the ability to(with reasonable effort) break TOR circuits and deanonymize you([Tor design](https://svn.torproject.org/svn/projects/design-paper/tor-design.html), [Tor specs](https://gitweb.torproject.org/torspec.git/tree/tor-spec.txt)). To the best of my knowledge I2P will also take a hit from this but still provide you with reasonable plausible deniability.\n\nOn the subject of crypto/blockchains: It really depends on the design of the protocol, but in case of Bitcoin the damage done is not too high, since the BTC blockchain relies on a game of chance based on computational strength only, that in turn relies on the unpredictableness of a sha-hash, which is not currently known to be predictable(forgeable) by Quantium computing. So past transactions and blockchain integrity are safe. Satoshi thankfully had the foresight to have the public key to your private walled address hashed before it becomes your regular bitcoin address so your bitcoins you have received and send are also save(in theory). But if you ever signed anything with your bitcoin address and someone were to get hold of that signature and the public key(or possibly just multiple signatures) ever at some point in time will be able to just take all your bitcoins.\n\nTL;DR: Everything will be hit really hard once big quantum computers come around, as a **rule of thumb** the security of your crypto will be cut in half, if it's not broken entirely, by specific quantum algorithms. So a 256-bit AES key will have the strength of an 128-bit AES key against a quantum computer",
				"added": 1559763697
			}
		],
		"1560020808_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 100,
				"body": "There is difficulty implementing it. The only viable DHTs are udp based and as such can't work with tor clients(since to is tcp only).\nSee [this](https://github.com/HelloZeroNet/ZeroNet/issues/57)(Clearnet) github issue for more info.",
				"added": 1560021388
			},
			{
				"comment_id": 101,
				"body": "> [snax](#comment_5_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk): Conversely, you wouldn't need to run any traffic through TOR if IP was anonymized properly inside of ZN anyways.\n\nI agree but keep in mind that proper anonymization is *really* hard to do and needs to be under regular attack to guarantee that it still (or rather to what degree it) can protect you. There is a reason why there seem to be only the big anonymization projects (pretty much) I2P, Tor and freenet( + gnunet at some point). All of them have existed for at least a decade and have proven to effectively protect you.\n\n>DHT would be a massive improvement to ZN, making it truly decentralized; OP brings up an important point.\n\nI'm not disagreeing with that, just stating that things are difficult.\n\n> [redlibertyreal](#comment_12_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): DHT is slower than trackers, though I could see it as being a valid backup for if a zite isn't being seeded at the moment you intend to access it.\n\n+1",
				"added": 1560277272
			}
		],
		"1560340344_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 103,
				"body": "There is some more (somewhat) official documentation on that called '[The Truth about ZeroNet](https://github.com/imachug/The-Truth-about-ZeroNet)'(clearnet), which is really helpful.\nI feel like I know quite a lot about it and how to safely handle zeronet content now, so if you have any more questions feel free to ask me.\nYou could also read through zeronets DB code to find answers, if you can read python.",
				"added": 1560363725
			},
			{
				"comment_id": 104,
				"body": "> [fantoski](#comment_51_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Hey bro, if you don't mind do you know why the done DB won't fill ( While as you can see in the dbjson there should be an entry with \"1\" as hist_id ) ?  [...]\n\nI can't see the pastes. Have you made them public?",
				"added": 1560710262
			},
			{
				"comment_id": 105,
				"body": "> [fantoski](#comment_52_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Holy fuck I'm next-level retarded.  [...]\n\nThis:\n\\>[\"hist_id\", \"INTEGER PRIMARY KEY AUTOINCREMENT\"],\n\ndoesn't work(at least I was never able to get it to work). I think you should be able to see an error if you are in debug mode. If you look at the `data/temp.db`-file with something like `sqlitebrowser` it should be empty, because it failed to create the hist_id column.\n\nYou can force unique IDs by using `key_col` in json objects, further described [here](https://github.com/imachug/The-Truth-about-ZeroNet/blob/master/8.%20dbschema.md)(clearnet).",
				"added": 1560711536
			},
			{
				"comment_id": 106,
				"body": "> [pexo](#comment_105_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): This:>[\"hist_id\", \"INTEGER PRIMARY KEY AUTOINCREMENT\"], [...]\n> [fantoski](#comment_52_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Holy fuck I'm next-level retarded.  [...]\nYou can also use `CHECK` in the `tables`-section for really fine grained control over what is accepted into the db as id.\nFor example this: `text NOT NULL UNIQUE CHECK(tag_ID NOT GLOB '*[^a-z^A-Z^0-9]*' AND length(tag_ID) BETWEEN 1 AND 43 )` is what I use in UFTS to check tagIDs(which are base62 encoded 256-bit blake hashes) before they are added to the db. Any tag_ID that doesn't fit this criteria will not be added to anyone's database.",
				"added": 1560712134
			},
			{
				"comment_id": 107,
				"body": "> [fantoski](#comment_53_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Even that way it won't work :/  [...]\n\nNevermind, I'm blind. Your `history` table doesn't have a `[\"json_id\", \"INTEGER REFERENCES json (json_id)\"]`-row. That's the reason why it doesn't work. The `INTEGER PRIMARY KEY AUTOINCREMENT` thing I mentioned was related to an strange [issue](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/4@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) I had in the past.",
				"added": 1560795696
			},
			{
				"comment_id": 108,
				"body": "> [fantoski](#comment_54_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): That was an old version I mistakenly shared instead of the most recent one that I had already fixed. The problem ended up being that what I wanted to do, while it made sense, wasn't supported yet. The idea was to have this in my data.json:  [...]\n\nOh, okay. Glad it worked out anyway.\nBy the way, aside from `json_id`, keep away from the `references`-keyword in dbschema.json.\n\n>Thanks for the help you gave me so far.\n\nI'm happy to help.",
				"added": 1560883896
			},
			{
				"comment_id": 109,
				"body": "> [fantoski](#comment_56_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Why should I avoid references ?\n\nI have some ideas, but I'm not sure why exactly, but on the py3 version the database bricks in some cases and you need to delete it, and then restart the whole client in order for your zite to work again. Also since you can't really control the order tables get generated(it's alphabetic only most of the time) certain entries will fail to be added and zeronet(probably not expecting the sqlite error) will get into the bricked state I've written above. The same happens, if you add a column that depends on two different users. Over all a bad time, if you ask me.",
				"added": 1560971635
			}
		],
		"1561215507_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6": [
			{
				"comment_id": 110,
				"body": "> [guessmynick](#comment_3_1PUvPqTQge5nQ4u1JtmuSKoz1FwcjfRbnn): it has been with us since the dawn of ZeroNet\n\nDo you mean nofish?",
				"added": 1561306910
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 112,
				"body": ">as collaborators to the GitHub repository\n\nHow much to rely a on the (very) centralized (and not to mention owned by © Microsoft®™ now) GitHub is also a consideration to be made.\n\n---\n\nThere is also the issue that giving the private keys to the most critical zites on ZeroNet to the multiple owners will cause problems, since owners will have to join and leave that state and once they know the private keys we cannot ensure that that person will just dispose of it. This makes changing any member a huge security risk. \n\n---\n\nAlso as was noted before: OPsec is actually really not that easy(there is a lot of subtlety) and adding more owners(while leaving the current infrastructure as is) will in the best case scenario have all members have better OPsec then Nofish(so everything stays how it is now) or have at least one member with worse OPsec then him in which case it just got easier to compromise everything. Rotating the address for ZeroHello(for example) frequently or implement a feature that requires 4 of of 5 signatures in a content.json to update a critical zite might be a good idea to somewhat combat that, but seem a bit hacky to me.\n\n---\n\n>what group of people should actually have the rights to rule the network\n\nThere is also a consideration to be made as to what group of people should get into that position.\nPeople that have the best intentions for ZeroNet vs 'good' or even fair people.\nMaking that based on vote size could result in a ZeroNet staff you might really not like(and that also really don't like each other), for ethical/personal reasons.\nTwo examples would be:\n- ZeroNet gets popular and nazis come flooding in. Since they tend to be more active then everyone else the voting activity(or just brute numbers) will crush all competition when it comes to voting.\n- ZeroNet has already made some waves in the pedo community, so it's not unreasonable that a (or multiple) pedos will become 'heads of ZeroNet', which isn't a problem in on itself but having the group with the worst possible reputation to be the face of the project would be a challenge, to say the least. Also pedos tend to be raided fairly often for little to no applicable reason, so unless there is good OPsec the risk of the private key falling into the hands of a state is definitely high.\n\n---\n\n> [gitcenter](#comment_485_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Does it make sense if your votes are divided by the count of people you vote for? E.g., if you vote for one user, he gets +1. If you vote for two users, they get +0.5 each.\n\nI thoroughly suggest each user makes a list of most favored to least favored and go on from there. CGP grey has made a really good series([onion](http://axqzx4s6s54s32yentfqojs3x5i7faxza6xo3ehd4bzzsg2ii4fv2iid.onion/playlist?list=PL7679C7ACE93A5638), [clearnet](https://www.invidio.us/playlist?list=PL7679C7ACE93A5638)) on voting systems and a ranked voting system was the best choice(, if I remember correctly).\n\n> [zeroid3](#comment_1_142kvsY3QEwbXPDPjWWEZHptFHH36JwNo4): Now sites like Millchan, ZeroVoat, CryptoID have to give a private key to its users so they can generate a certificate for themselves, this is just silly.\n\nThere also other oddities with the current certificate system. See [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/8@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) and [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/7@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) gitcenter issue.(I feel like no one actually looks at these)\n\n> [zeroid3](#comment_2_142kvsY3QEwbXPDPjWWEZHptFHH36JwNo4): I'm not sure if having multiple people will fix the problem, it could also result in easier compromise because if one of them is corrupt he can still create a lot of trouble. And then there's the problem of how to conduct the vote and who is considered a real person.\n\n+1; We need a way to collect votes, without collecting any private data, while somehow protect against sybil attacks.",
				"added": 1562008327
			},
			{
				"comment_id": 113,
				"body": "> [gitcenter](#comment_492_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): To make a conclusion: [...]\n\nSounds reasonable to me, but relies a lot on human factor.\n\n> [geekless](#comment_63_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): If you see a bitcoin address, someone have a private key of it. Are you going to change the addressing model? That will be an incompatible network.\n\nI second that.\n\n> [mg0](#comment_61_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I really dislike it being in Github\n\nThis.\n\n> [gitcenter](#comment_495_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): However, we've found a solution. We would use the exploit itself to change the source code to fix the nodes (yup, it was The \"Vacation\" RCE vulnerability).\n\nlol",
				"added": 1562008851
			},
			{
				"comment_id": 115,
				"body": "\\>123 comments\nI couldn't even keep up reading up on this thread.\nNice to see all the discussion on here, though.",
				"added": 1562178684
			}
		],
		"1562170966_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 114,
				"body": "> [duende](#comment_92_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): I agree with that, yes.\n\nlol. I see what you did there.\nBut not gonna lie, that's pretty nice.",
				"added": 1562178416
			}
		],
		"1564043724_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 117,
				"body": "dictatorship => The wealth(and it's production) of a country does not depend on the citizens. The dictator is whoever controls the wealth machine. He doesn't need to care for the well being of his citizens.  \ndemocracy => The wealth(and it's production) of a country depends solely on the citizens. Therefore the ruler (president, parliament ... ) must ensure the well being of his citizens to keep the 'wealth machine'(the people) producing wealth.",
				"added": 1564081146
			}
		],
		"1565542990_1CmgfFAZ5VHekkpKkKAfTX3EcjQjsaKmXR": [
			{
				"comment_id": 118,
				"body": "That has been resolved. Their provider chose to kick them of their service. They are now hosted in moldavia.\n\nThings are still a bit shaky, but exhentai will continue to live for a good while longer.\nThe admin is currently working with the devs on a 'Plan B', which is supposedly a decentralized version exhentai that will (probably) be similar to the H@H system. But as far as I know there isn't any official statement on what that 'Plan B' actually is, so consider everything that is said about that pure speculation.",
				"added": 1565545265
			}
		],
		"1565490001_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 119,
				"body": "> [chinchin](#comment_17_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): UPDATE:Found this topic [...] Apparantly the dev decided to keep both for now and Millchan is the \"original\" version with Millchan Merger using the new merging concept.\n\nThis is correct, but the the millchan merger is still under development and changes that will break backwards compatibility to the current hubs are likely to happen!",
				"added": 1565629091
			}
		],
		"1565457997_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 120,
				"body": "> [toyata](#comment_86_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Someone should clone Millchan Merger master site and add all known boards default, so they are clickable from the main site and then populated.\n\nThere currently are 16 hubs that are publically known. Innocentchild made a list of all of them over at [innocentchild's room](/1J1epG5eMc4bsmh69UctBg4PHEe5B3kYHY/hubs.html)\n> [moleman](#comment_2_1NxzhgT8Nm2xiA3HeT8UmWCezM2N3fyds4): Great guide, but the system is still too complex imo.\n\nMillchan merger is still in development and in no way complete. A full moderation system, gui board creation/management, banners and many more things are planned. \nIf you want to follow more closely or are considering to contribute: https://gitgud.io/millchan/merger\nSee also the dedicated thread on millchan [/dev/](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:1b5f282e-6a57-4aa4-ae11-8b85dda51509)",
				"added": 1565629735
			}
		],
		"1565627986_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 121,
				"body": "@gitcenter beat me to it. A few additions:\n>This is the only file you have to backup.\n\nKeep in mind that, depending on zite design, images and media/data that you uploaded somewhere that currently only you are seeding will be gone if you only keep the `users.json` file.\n>It's released.\n\nTechnically it's still alpha(**0.**7.0 and many more features are  to be added), but in terms of stability it's 'released'.\n>The data is not encrypted.\n\nTo clarify: Data is not stored in a encrypted format(this also includes your `users.json`) communication is (by default) encrypted most of the time, except for when you're talking to clients that don't support encryption or you disabled encryption in your config file.\n>ZeroNet doesn't use any \"enhanced JavaScript\" \n\nBecause that can cause confusion: Some examples in the documentation use CoffeeScript and zeronet has a builtin CoffeeScript compiler, but that is completely optional to use.\n>nofish is the administrator of this forum. However, AFAIK, he has never deleted a post here.\n\nNofish ownes all of the default zites. He will only delete content is absolutely necessary. Instances in the past include:\n- Deletion of child porn on the public ZeroMe hubs he owns.\n- Deletion of a link to a child porn zite in ZeroSites.",
				"added": 1565632262
			},
			{
				"comment_id": 123,
				"body": "> [styromaniac](#comment_960_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): He also deletes CP from ZeroUp.\n\nGood to know, I don't use ZeroUp so I never noticed anything on there.\n> [bvcfbfbcbcvd](#comment_13_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Yeah, but why is it shocking that somebody is \"looking for security\"?\n\nNot sure if I understand you correctly, but it isn't. I myself am heavily invested into security.\n>Why is that like an \"optional add-on\"?\n\nNot really optional, tor is, as far as I know, bundled with zeronet for windows and set to enabled(not set to always) by default and has fairly easy instructions for linux.\n>Why is it an \"if\"?\n\nSome people just don't really need or care for security.",
				"added": 1565633360
			}
		],
		"1565629267_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 122,
				"body": "> [bvcfbfbcbcvd](#comment_11_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): gitcenter: Possibly the fact that the point of a network like this is lost if you can just track everyone like that?\n\nZeroNet was made with the idea in mind to be as censorship resilient as possible. Anonymity was not the top priority and isn't required to be resilient to censorship.\n>And even with a VPN/proxy/Tor, we all know how secure those are...\n\nThose three are drastically different security levels in terms of anonymity. Keep in mind that of those **only** Tor will give you any anonymity guarantees.",
				"added": 1565632804
			}
		],
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 124,
				"body": "> [08admin](#comment_7_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): We're working on it now.  The Millchan developer actually has a Git repository with code for fixing this exact issue and we're trying to figure out how to implement it. [...]\n\nIt would be a good idea to look at the repo (at a state before the switch to typescript happened, if you're unfamiliar with typescript) and see how the image upload has been done. Don't focus on specific commits, since there were things in that regard that got fixed and added later on, in a nutshell:\n- You need to resize the image in JS (in the case of millchan `jimp` is used)\n- The resizing should be done in a separate thread(worker) or it will bring your webrowser to a crashing halt, if you try to upload an image > 400KB\n- The problem with workers: All zites live in iframes, that due to zeronets design, must not give the 'allow-same-origin' permission in the iframe sandbox. Because of that workers cannot load any js files, since the browser makes special urls for those files before loading them from this generated url.\n- As a workaround all workers must load their js files from a blob and a blob url. This means all used libraries as well as the js itself must be gathered in string form, appended to each other in the correct order, converted to a blob and then converted to an blob url.\n- If you have the base64 data you need to upload it to the zeronet client. Look at `files.js` and `millchan.js#uploadBigFiles(...)` as well as the [ZeroNet Docs](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/zeroframe_api_reference/#bigfileuploadinit) on that.\n\nIs there a specific reason why you don't want to upgrade 08chan to the latest version?",
				"added": 1565715583
			},
			{
				"comment_id": 128,
				"body": "> [08admin](#comment_8_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): Some of our users did a test update of their local clients, and many of them developed errors and massive slowdown. \n\nThe errors are probably due to the hacky way they updated 08chan. There is a massive slowdown on Tor Browser(TBB) due to the lexical parser(does the markup) and a runtime performance penalty for vue(the display library used in millchan and 08chan). The runtime penalty should be the same on 08chan and millchan, with TBB getting worse performance compared to FF(because TBB throttles js and hardware acceleration to obfuscate the kind of hardware your computer has). I dumped a few of my test results on [this](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1#post-22063759-44aa-403e-83c5-719bb8887a22) millchan/dev/ thread if you're interested on more metrics.\n\nI'm actually currently writing a fix for the performance issue with the lexical parser. Looking at a 4-times speedup of loading threads/posts on TBB. \n\n>There's also mistrust of the merger system giving board owners moderation powers. \n\nmillchan merger(technically called `millchan engine`) and millchan are completely separate zites.\n- http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA - Millchan\n- http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC - Millchan Engine\n\nAs a side note: I would for the time being refrain from using millchan engine, because the are things that need to be done that might require to break backwards compatibility with older hubs. Consider millchan engine a PoC and nothing more.\n>Our circumstances are rather different than Millchan's proper.\n\nI can't really judge that, but keep in mid that zite owners are basically gods. That turns them into massive centralized points of failure. Security implications aside, it makes have 08chan a bus factor of 1; If you are or get compromised, everyone is. The hub/merger system distributes that power over the content of a zite.",
				"added": 1565804930
			},
			{
				"comment_id": 129,
				"body": "> [08admin](#comment_9_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): This is useful information, thank you!\n\nNo worries!\nI have contributed some code to millchan and thus have a pretty good understanding of how millchan and ZeroNet development in general works. If you have more questions, you can always ask me here or on millchan /dev/ where you can also find mcdev.\n\nAlso in response to what I red on 08chan/tech/:\n>Millchan's developer is also working on not blocking the browser's main thread, which should make the board even faster in the future.\n\nBefore this causes confusion, I am not Millchan's developer. mcdev is the developer of millchan. From what I know he isn't around ZeroTalk too often and doesn't really interact with people outside of millchan much. So if you or people on 08chan discover bugs please report them to millchan /dev/. (or to me and I'll relay them forward)",
				"added": 1565889864
			},
			{
				"comment_id": 130,
				"body": "> [aiseof](#comment_3_1PdL5a2fRqGoQZi4NNh1EzLpcZbMV7HX3y): yes this happens to me after update usually after clicking from list\n> [08admin](#comment_10_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): Some users are reporting pages freezing when loading with the new client.  Any thoughts on this?\n\nThat is the Vue issue I was talking about. Millchan currently uses Vue2, Vue3 is currently being developed and said to be released sometime this year. It promises numerous performance improvements across the board, but unfortunately doesn't fix the issue we are dealing with.\nThis is primarily an issue with the library we use to display the posts and render the zite. (In fact a well known unsolved issue in the Vue ecosystem/community).\nI have a few ideas(lazy loading posts, ditching vue in favor of svelte(unlikely: A LOT of refactor necessary, it doesn't seem to be supporting typescript(yet), the actual performance benefit is unclear, many parts of the Vue ecosystem we currently use would need to be replaced), usage of dynamic scrollers(which don't really seem to work as intended), finding a way to run the calculating part of Vue in a WebWorker), that would help a bit with that, but I (we) are still weighing options.\n\n> [512](#comment_17_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3): Also test thumbnail image generation when posting mp4/webm, or anything else which generates thumbnails. Even updated Millchan will output empty canvas for mp4 thumbnails when using TBB, unless you disable resistFingerprinting stuff.\n\nThis is a longstanding known bug. There isn't really a fast js library that we can use to extract images(we need to use js for that because we can't extract data from the canvas-element).\nPut in simple words(slightly inaccurate): Javascript is slow, posing images on TBB(Tor Browser Bundle) is already really slow, imagine the abysmal speeds something that would be ~20 images per second for multiple seconds.\n\nSee [this](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1) millchan /dev/ thread for more info.",
				"added": 1565982469
			},
			{
				"comment_id": 131,
				"body": "> [512](#comment_18_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3): Perhaps for smaller video files it could still be fast enough.\n\nPerhaps, we are still evaluating stuff. I'm playing with the idea to make a ZeroNet plugin to do these conversions in python to offload the performance penalty to a faster language. This will be optional, of course, with fallback to the javascript processing if the plugin is not installed. I'm still looking into it, though.\n\n>Some did report not all 3 are needed -\n\nYou only need `privacy.resistFingerprinting`. `privacy.resistFingerprinting.autoDeclineNoUserInputCanvasPrompts` will only hide the canvas fingerprint warning popup that is(since TBB 8.0) not triggered anyways for JS that runs in an iframe(which all zites do). and `services.sync.prefs.sync.privacy.resistFingerprinting` is (as far as I know) just a flag that tells TBB to sync the `resistFingerprinting` behavior to other browsers you connected through Mozillas sync service.\n\n >Side question, you mentioned TBB is throttling JS, and a fix for lexical parser. Is there any setting in TBB to turn the throttling off?\n\nAs far as I know that is one of the changes made in the codebase of TBB and not a configuration thing. So no, that is impossible. With the most recent updates of millchan source code this shouldn't be an issue anymore. Lazy loading and other techneques have reduced the **apparent** thread loading times from 45 seconds on TBB to about 2 at worst in the testset of posts I was using.",
				"added": 1566319060
			},
			{
				"comment_id": 133,
				"body": "> [512](#comment_24_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3): 1.) I am seeding over 40 GB and some files are incomplete. Is there any script which would check SHA-512 of those files, and possibly delete those which fail the check? It would be great for archival purposes, or to get only complete images/videos, without checking them with other tools.\n\nNot that I know of, but doing this in python should be pretty straight forward.\nAlso I'm fairly certain that, unless you enabled a experimental feature in zeronet, all files you can find in the zite directory should be complete already.\n\n >2.) Is there any easy way to save Millchan threads with CSS into a single mhtml/html file? 'Save Frame As' is OK, but it won't save CSS from Millchan.\n\nNot yet. But you could copy and paste all files from `[YourZeroNetDataDir]/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/css/`.",
				"added": 1566499042
			}
		],
		"1565708858_1BP1yj9evars2xjLc1Hw6icEg3BKJaLUyk": [
			{
				"comment_id": 125,
				"body": ">so my understanding is that text/links are automatically seeded, but images/webs etc are not. Is this correct?\n\nBasically what @arhipo said. On millchan the thumbnail and the original image are two separate things. The thumbnail is downloaded and seeded by you as soon as you see it, while the original is only downloaded(and seeded) if you click on the thumbnail to 'maximize' it. The `seed`-button refers to the original image not to the thumbnail.\nIn shot: Everything text is downloaded without you doing anything, the thumbnails as soon as you see them and the original images as soon as you click on either `seed` or the thumbnail.\n\n> [ssdifnskdjfnsdjk](#comment_909_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): [...]Use different site (modified not to use thumnails or use placeholder instead).\n\nMillchan already has that feature. Its disabled by default and can be enabled in the options under `always spoiler`.\n\n> (PS: is possible to use this modified site and supply the foreign site database?)\n\nYes. You can take a look at the [CORS documentation](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/zeroframe_api_reference/#plugin-cors) for more info on that.\n\n> [arhipo](#comment_3_1GyzQuxTLxM4VZHrscHm5iY5W4B8b6f6QL): \n\nI don't believe any bunch of 0s & 1s ~~could~~ **should** be illegal. Unfortunately the rules most of us here have to play by clearly disagree…",
				"added": 1565717052
			}
		],
		"1565721504_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 126,
				"body": "```\n  \"cert_signers\": {\n   \"0ch.anonymous\": [\"1LP86ye2hyMGP1UvGxnk7F8Qg9vN1HpVLy\"],\n   \"cryptoid.bit\": [\"18143WPue3rQykNaopx5KJKzYmaYhCjqhv\"],\n   \"ifs.anonymous\": [\"1AudNexptNDTGAwxFf2jnE8CX8UUks8NGD\"],\n   \"kaffie.bit\": [\"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\"],\n   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\"],\n   \"millchan\": [\"1NwwLdiFBcVAA4jXQ712ZtQfDHEMvk8BiD\"],\n   \"nobody\": [\"1HfcDUpAgixShco52qfkVGyUjq7aybWHdG\"],\n   \"peak.id\": [\"1PEAKf9wJLTEEFAsQpLeLioWfY1f8pvFhD\"],\n   \"polar.id\": [\"1PoLARzautbsqCix1aia8jYN55JmPqGeFt\"],\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"],\n   \"zeropolska.bit\": [\"1GzEG1Hz82KMUp925PntbrhR7FoDZ4fRCF\"],\n   \"zeroverse.bit\": [\"1HPgDoReCFtE9qy71hnp55ksBVvV1gHJLQ\"],\n   \"zv.anonymous\": [\"1LtYcRchH5f5wKeW5jdFXGdnqnKNXBb7m6\"]\n  },\n```",
				"added": 1565723307
			}
		],
		"1565801544_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": [
			{
				"comment_id": 127,
				"body": "> [russianspy](#comment_1_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): Server errorErr: DatabaseError: database disk image is malformed in UiServer.py line 103 > UiRequest.py line 152 > UiConfigPlugin.py line 21 > ContentFilterPlugin.py line 216 > UiRequest.py line 358 > SiteManagerPlugin.py line 65 > SiteManager.py line 150 > Site.py line 54 > OptionalManagerPlugin.py line 61 > ContentManager.py line 34 > ContentDbDict.py line 18 > ContentDb.py line 112 > Db.py line 75 > DbCursor.py line 82\n\nDo you get an white screen with just that error or is it some popup error?\nThe popup thing should be fixed with the rebuild that @ayra mentioned. If not, you likely need to backup your `users.json`, take note of what zites you currently have, shutdown ZeroNet, delete your ZeroNet-data folder, restart ZeroNet, shut it down again, swap the new `users.json` with your old one and finally start ZeroNet again. This, in general, will solve most of the issues you may run into. Alternatively you can add `db_mode = security` in your `zeronet.conf` file to lower the chances of that happening again.",
				"added": 1565803068
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 132,
				"body": ">corner and select \"rebuild database\" and then \"reload database\" when finished.\n\n`reload database` looks for and finds any changes in the `dbschema.json` file which is used to build the database from the files of the zite. `rebuild database` uses the currently known version of `dbschema.json` to rebuild the database. Doing `rebuild database` first and then `reload database` is pointless.\n\n\n> [08admin](#comment_11_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): improves posting (...) speeds\n\nI just want to clear that up: It doesn't, posting is actually significantly slower at the millchan version 08chan is now running(which would be version: 30f239c).  \nThe current version of millchan(0ed5f601) has drastically increased the speed of posting and page load. For example: the **apparent** load time for a large thread on Tor Browser could be reduced from ~45 seconds to ~2 seconds. Also the loading of a large thread will no longer block the entire browser(or main JS thread to be exact). Things are still a bit iffy and the current code stands on shaky feet, but you should probably consider updating the source again soon.\n>but input from users is critical. \n\n+1\n\n> [rt7yd6gh](#comment_3_1BHW9TDfbFkuPJaSZyoUTyHosRnUsFZHca): Will checking/updating overwrite it all to the latest? Maybe these are obvious questions.\n\nOnly if you disable the read only attributes of the file/folder and uncheck the `This is my site` button on the 0menu.\n\n> [uypchoz2t0chmax9](#comment_3_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): Okay, it looks like somewhy it didn't update index.html. I manually deleted it (zeronet/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/index.html), and now zeronet downloaded it instantly...\n\nThe instructions I found on 08chan/tech/ mentioned setting the files to read only, I assume that was the issue.\n> [styromaniac@kxoid.bit](#comment_131_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): \"viewport\": \"width=device-width, initial-scale=1.0\"\nIn case this confuses people, it is something that you can add to the zites content.json that will improve the zite for mobile users.\n\n> [duck0](#comment_92_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): /ZeroMe, see a blurred, click and load.\n\nTake a look at the options page, the option you are looking for is `always spoiler`.\n> [transdude](#comment_1_1G8gsfYACpCg2eXfNb34ZeKMGzvnwSRom8): Both the beta and the update overload my browsers for any thread that's longer than 100 posts. What am I suppose to do?\n> [08admin](#comment_15_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): What exactly does it do?  Big threads will take more time to load, but will eventually get there.  With a 3.7ghz processor and 4gbs of RAM I can load that huge thread on /pol/ in about fifteen seconds in Firefox.\n\nPlease keep in mind that the performance on Tor Browser is considerably worse(up to 6 times as bad).\n>You may wish to Pin the board to download all its content and then you're only loading the files locally after the first time.  That will make it easier/faster.\n\nThat is not what's causing the overloading. It's an issue with the GUI.\nThe most recent version of millchan sets out to fix that. See what I've written above for more info. You can see (and test) it for your self on millchan. Feedback highly appreciated.\n\n> [numismatist](#comment_45_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): OK I found the right combination of settings, spoiler thumbnails and always spoiler seems to just give me an icon depicting the file type, and no thumbnail. I’m hoping this means that I’m not downloading the actual thumbnails or images too. \n\nIt really shouldn't. Please report it **immediately** on millchan/dev/ or to me, if it does download new images after you enabled the `always spoiler` option.\n> [somerando](#comment_3_1BRQUkyDA6VNhSC3KDLfmuyVKMP3LkwpkG): Am I fine as long as I just don't click on the board? I just don't want this shit on my drive.\n\nYes, you only download what you've seen at least once(except if you enable any 'download all' features, of course).\nHowever, keep in mind that images/thumbnails that you have started to download/are incomplete will continue to download until they're done.",
				"added": 1566325697
			},
			{
				"comment_id": 136,
				"body": "> [duck0](#comment_112_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Enable an option to delete it from page or when you click it again it deletes from cache.\n> [ssdifnskdjfnsdjk](#comment_919_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Near each thumbnail is > icon with the menu.\n\nYou can delete images by clicking the triangle icon next to the filename.\n\n> [uypchoz2t0chmax9](#comment_5_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): Ok, this is garbage under palemoon.\n\nWhere there any warnings/errors in the web console? Did you have bad files? From what you said, it seems to be an compatibility issue with vue or any vue components that millchan uses. Have you tried the Tor Browser does it work there?\n\n> [12345679](#comment_23_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): Hey I cannot get a new cert to generate. I get prompted to generate a millchan ID, but it never generates, even after waiting for an extended period.\n\nThe guy that made the clone(08chan) forgot to change some lines in the `config.ts` which caused millchan certificates to be chosen on the zite despite not being allowed in the zites `content.json`, you currently can only use ZeroID certificates to post on 08chan.\n\n> [uypchoz2t0chmax9](#comment_6_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): this lazy page loading available in recent millchan versions is a major performance hog.\n\nThey should be the opposite of that. Is millchan just as fast as 08chan? There are notably performance boosts on both Firefox and Tor Browser in testing.\n\n> [duck0](#comment_136_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Right on, IIRC 8chan cloned old Millchan code before they upgraded.\n\nI'm not sure I follow, upgraded to what?\n\n> [ssdifnskdjfnsdjk](#comment_920_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Anyone knows which file (possibly some .js) i need to edit to make the Follow function working? \n\nYou can try to build the most recent version of millchan. If you want to tinker yourself take a look at `ModTools.vue` and more specifically [this](https://gitgud.io/millchan/Millchan/commit/fe8a8a4ed2cd1f81adde4b768715a98a4d2b17ce)(clearnet) commit.\n\n>Or @08admin try to re-run the upgrade to apply new millchan functions to 08chan?\n\nThere are still some things wonky with the new lazy load system if you scroll around in large threads, but the current release has seen numerous performance improvements since the last 08chan upgrade.\n@08admin if you want I can help you do another upgrade. Feel free to ask me.\n\n> [uypchoz2t0chmax9](#comment_7_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): If you run npm install, it will download a bunch of files from npm, I think that is the command that's supposed to download vue.js (but I'm not a web developer, so I'm not sure).It won't be in the normal zeronet site, webpack packs every js file into a single gigantic one.\n\nCorrect `npm install` will download and install all npm dependencies for millchan `npm run prod` will build a fully usable version of millchan for you. After you done `npm run prod` copy all of the `dist`, `css`, `languages`, `static`, `index.html` and `dbschema.json` and paste them into your (empty) zite folder. Now you only need to make your own `content.json` and `data/users/content.json` and just like that you have your very own millchan instance.",
				"added": 1567012836
			},
			{
				"comment_id": 137,
				"body": "> [uypchoz2t0chmax9](#comment_9_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): AFAIK PaleMoon is pretty much still running on a single thread, blocking a single thread blocks the whole browser.\n\nWait so it schedules webworker ticks into mainthread ticks or how are these handled?\n> Maybe I'll try to update millchan again to see the current git master.\nA valuable learning experience\nmillchan already runs on the latest version.\n\n>About image loading: but something clearly changed, click on expand images, and you get 100% CPU usage and a browser rendering at 2FPS for something like 30 seconds.\n\nAnd this wasn't the case on old 08chan? Is it the same for 0chan? Can you try downgrading to the `anon-posts` branch and tell us if it had the same issues?\n\n> [duck0](#comment_141_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): They cloned an old Millchan source, instead of when Millchan did a redesign.\n\nI'm not sure I follow.",
				"added": 1567105515
			},
			{
				"comment_id": 146,
				"body": "> [uypchoz2t0chmax9](#comment_10_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): I have no idea, maybe they're running on different threads, but pretty much everything else runs in a single thread. Layouting, rendering, js of the website, javascript of the browser chrome, network, etc. A single unresponsible page can slow down the whole thing. The classic mozilla feeling. [...]\n\nMaybe you should talk to the palemoon devs to backport some of the quantum updates of regular firefox\n>Can I somehow mass purge thumbnails for a thread?\n\nNo.\n>I've updated millchan to c90d9f3 and now it looks a bit snappier, but I don't know whether it's because something changed with millchan, or I just have most of the images cached. It slowed down horribly when I clicked on expand on 3-4 post with 50+ images, even with the old version after a reload it was much better while zerochan had the thumbnails cached.\n> [uypchoz2t0chmax9](#comment_11_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): I just checked this: [...]\n\nCome to think of it, the Image loading issues could be a connection limit thing on the browser side. Otherwise I'm beat on that.\n\n> [duck0](#comment_142_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): 8chan is a clone of old Millchan code. Like when you clone a site on ZeroNet. They cloned it from an earlier iteration before Millchan added the ability to delete stored images, thus it is not a feature on 8chan.\n\nI didn't mean that, the current version of millchan that 08chan currently runs already has that feature. That's what has me confused.\nI'm a millchan contributor, by the way.",
				"added": 1567616860
			}
		],
		"1566667015_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": [
			{
				"comment_id": 134,
				"body": ">With --debug I can see that when it happens it's logging this kind of lines, incrementing the number by 100 each time:\n It looks like it's trying to rebuild the database. Do you know if the process ever successfully finished?\nMaybe related: I came across a bug where ZeroNet just doesn't rebuild the ContentDB(after a crash that corrupted the database or a deleted `users.json` is what I experienced personally). I investigated this a bit and fund(probably unrelated to my issue) that ZeroNet doesn't really register if and what files are in the data directory, if you added(copy and pasted) them manually. Maybe this could be something worth looking into.",
				"added": 1566669175
			},
			{
				"comment_id": 135,
				"body": "> [gitcenter](#comment_757_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It should be a one-time process. What site is causing that? (i.e. what's 1ChBy...?)\n\nIts a 0(1+)Gallery, most likely the Anthology.jp thing, sirlotaplot has been teasing for some time now.",
				"added": 1566669379
			}
		],
		"1567159417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 138,
				"body": "Great to hear you made it open source!",
				"added": 1567184451
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 139,
				"body": "I agree with much of what you said. Things need to change.\n\nHowever I strongly disagree with saying Nofish is childish and calling it a day. People have reason they act the way they do.\nI think you should think about and consider more of why he is and acts this way. Whether or not he 'means' it or actually is that way is difficult to tell, but I personally don't think he is.\n\nThe issue with this whole situation seems to be mostly a lack of communication on nofishs part.\nNofish doesn't have a big presence on here or anywhere else and doesn't really get personal, so it's difficult to judge why he acts this way. But he seems rather to himself and to prefer being 'silent neutral' over engaging in discussions.\n\nThe times I seen him interact, seem to me like he wants to distances himself from the ZeroNet community and maybe from the project itself. Which is kind of understandable since he, his personality and face is bound to this project; ZeroNet. This comes with a pretty hefty burden that many projects like this face: Among the many good things you'll intend to do with your project, you'll also enable all of the bad things.\nMany things he, as a person, may dislike or hate(I'm guessing here):\n- Providing a platform for Political extremists.\n- Providing a platform for the extremists of Religion.\n- Providing a platform for either of the above to plan and execute attacks(be it lethal or not).\n- Providing a platform for pedophiles(be it pro or anti contact ones).\n- Providing a platform to share and plan the abuse of children.\n- Allow murderers/killers to share intel and sell their services.\n- Allow rapists to upload and share their acts with anyone that asks, possibly encouraging them to do it more/again.\n\nThese are a subset of things he might find resentful and yet he will permit all of these and many more gruesome things.\nThis is a **really hard** ethical/moral situation he's in, regardless of what he believes in or are his politically ideals are, he has to permit the opposite of those and will be associated with it.\nI have to stress that Nofish, like everyone else, is human: He has loved ones, a house, a family, relationships to other humans, a private life all of which he could either fall in bad faith with or outright loose.\nQuestions like: `Why are you supporting pedophiles?`, `Why didn't you stop [insert terrorist attack here]?` and similar are things that are likely to pop up among is inner circle of friends/family. These aren't even unreasonable things to ask, since: 'had he not made ZeroNet, none of that would've happened'. Regardless of whether or not he or this project is just, the attempt to explain or reason could very well cause those he cares about to turn away from him.\n\nDistancing himself from ZeroNet is a way for him to minimize the harm, ~if~ when something horrible happens.\n\nThe other thing is that pride exists. ZeroNet has gotten fairly big and wide known. Your brain might work differently(or you think it would under these circumstances) and so you would ask for help and get others involved, but the fear of your first big thing and accomplishments; something you are proud of, being alienated, isolated and taken away from you bit by bit is very reasonable.\n\nIn short, I think Nofishs childish behavior is probably be explained by a mix of pride and fear for his future. Calling him childish and unreasonable/dismissive without (publicly) trying to understand/acknowledge  his motives and why he acts this way will do nothing at best.",
				"added": 1567271648
			}
		],
		"1567353817_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 140,
				"body": "Basically yes, I made a detailed step by step guide on my [blog](/1PexoLogqCsGAwYEUNqKnmzccg1r5tzCZ3/?Post:5:How+to+install+Zeronet+on+QubesOS), but it's a bit outdated now and in fact will not work for the py3 version of ZeroNet. I didn't have the time to write a detailed explanation for it yet but you can use [this](/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC_3) bash script to turn a fedora30 templateVM into an ZeroNet templateVM. Please remember to set your netVM to `sys-whonix`.\nIf feel free to ask me if you have any questions.",
				"added": 1567356926
			}
		],
		"1567166183_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 141,
				"body": "> [nofish](#comment_1287_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): There was increased amount of automated registrations recently that triggered some limitations that made the \"Network full, please try again later\" message appear. [...]\n\nThe source of the automated registrations is that someone on 08chan made a script to generate ZeroIDs, because he wanted to be anonymous rather then pseudonymous. As far as I can tell, that person did not have evil intent. \n\nSee [this](/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX:tech:17f22a9d-8c86-440d-a727-262dcc4af749) 08chan thread for more info/details.\nA prototype of the script that was used is here: https://pastebin.com/KHr0SSAZ\nRelated GitCenter [issue](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/8@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) mentioned and discussed in the 08chan thread.",
				"added": 1567359447
			},
			{
				"comment_id": 142,
				"body": "> [gitcenter](#comment_914_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Less often, but not impossible. [...]\n\nI didn't know that. Well apparently you both did :P",
				"added": 1567363383
			}
		],
		"1567443013_1GXk4TA4QQHcusYZYYVsEASvirkhnYa8Vh": [
			{
				"comment_id": 143,
				"body": "Well there is [Get Games Clone](/1274oSwRow2BrTsZPhemy9zHX56vArHxqg/). I haven't used it before, so I don't know how safe the files on there are.",
				"added": 1567443161
			},
			{
				"comment_id": 145,
				"body": "> [gitcenter](#comment_930_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm, most stuff is on ZeroUp, so you'd better search your luck there. I'm not sure whether you can search ZeroUp though...\n\nAlternatively you can try your luck on [ZeroTorrents](/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3)",
				"added": 1567444558
			}
		],
		"1567370497_17qQYX5qjxUoLZd1WmQVZFVqNFtZLXFLV3": [
			{
				"comment_id": 144,
				"body": ">\"They do not endorse child sexual abuse, and forced sex. They defend mutually beneficial, consensual sexual acts between children and adults.\"\n\nFor what it's forth, I second that. Although I should mention that 'child sexual abuse' means 'any sexual act that goes against the will of the child' for me, it might not for you, but that's what I second.\n\n> [12345679](#comment_25_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): All acts of sex with minors are abuse as minors cannot consent. Retard.\n\nBy definition of law, that is. It's important to keep in mind that the law calls it that. What you commonly think of abuse may vary strongly from what the law says.\nWould you say sex between two minors of the same age is abuse? Neither can consent.",
				"added": 1567444198
			}
		],
		"1567569304_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 147,
				"body": "> [phitafil](#comment_1_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK): You want to mislead Tor users into thinking that using an extension helps with anonymity? Every extension presents the opportunity for fingerprinting. This is bad advice.\n\nWell the question was for a way to check, not for permanent usage. uMatrix is really good for checking, but if you are on the Tor Brwoser, then it is better too stick with only the addons/extensions that come by default.\nAlternatively you could set the port in the proxy config on TBB to 0, which will cause all connections that are not made to 127.0.0.1(localhost) to fail.",
				"added": 1567620137
			}
		],
		"1567558797_1K5YHnyAFQxWB6x7bnX2yF7D82f34aeVzp": [
			{
				"comment_id": 148,
				"body": "The question of adding I2P support in ZeroNet is quite old. Here a list with further information:\n- [GitCenter issue](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/3@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC)\n- https://github.com/HelloZeroNet/ZeroNet/pull/602\n- https://github.com/HelloZeroNet/ZeroNet/issues/45",
				"added": 1567621352
			},
			{
				"comment_id": 149,
				"body": "> [crusadwe01a](#comment_1_1K5YHnyAFQxWB6x7bnX2yF7D82f34aeVzp): Thanks for the info. Any link I can get more in dfo on it at?\n\nNot that I know of.",
				"added": 1567788535
			}
		],
		"1568221970_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 150,
				"body": "> [kidcourageous](#comment_168_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): You aren't officially a 0Net user until Duende tells you to kys XD\n\nI don't think he told me to kill myself, yet :. (",
				"added": 1568224645
			},
			{
				"comment_id": 151,
				"body": "> [bigbadbob](#comment_670_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): If you have kaffies spam list enabled it can't happen cause he is blocked.  I disabled the whole list just to uncensor him. [...]\n\nI have no blocklists enabled. I basically only mute users when their spam is taking up too much space otherwise I only temporarily mute them to see other posts, if they are flooding a zite.",
				"added": 1568227067
			}
		],
		"1568481715_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 152,
				"body": "ZeroNet version 7.x.x runs on python3. ZeroNet version 6.x.x runs on python2. These two are incompatible with one another and you cannot upgrade from 6.x.x to 7.x.x, so you'll have to redownload ZeroNet. Be sure to backup your data directory so you can use it in the 7.x.x version.",
				"added": 1568482148
			}
		],
		"1569007083_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 153,
				"body": "> [gitcenter](#comment_1074_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): GitCenter -> Git Center. [...]\n\nDone.\n\n> [petrina](#comment_22_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): What are the login and password of your bank account?\n\nA combination of letters and/or numbers without spaces.",
				"added": 1569083295
			}
		],
		"1569149074_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 154,
				"body": "I don't have time right now to formulate something worthwhile(I haven't even completely red the OP yet), but if anyone has some questions about pedophilia, feel free to put them here. I'll try to answer them, when I have more time.",
				"added": 1569178367
			}
		],
		"1569600536_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 155,
				"body": "I'm pretty sure Kaffie is from the US.\nI'm always happy to help (if I can), but I cannot disclose my country.",
				"added": 1569601051
			}
		],
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 156,
				"body": "Not that I know of.\nAlthough [NeuralGirls](/18tQ1TPHxgMwCmDrC8RzdPEiJiwuqogfxf/?Home) said that they sold some art, but I think they are also advertising outside of ZeroNet.",
				"added": 1569609253
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 157,
				"body": ">Do you browse without Tor?\n\nNever.  \nI'd much prefer that not being the case, but this really is not by choice anymore...",
				"added": 1570032959
			},
			{
				"comment_id": 158,
				"body": "> [randomshits](#comment_189_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): [...]\n> [sperg](#comment_19_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ): [...]\n\nPretty much what sperg said. You don't even need to go to 'shady places' to be subjected to that stuff, furthermore you don't even necessarily need to stumble across it. Take ZeroMe for example Due to the way it is structured it is possible to have everyone, on a ZeroMe hub of your choosing, download and seed any image you want.\n\nChild porn for better or for worse has horrible, possibly permanent, consequences for your private, public and professional life. In a lot of cases __regardless of context__.",
				"added": 1570034283
			},
			{
				"comment_id": 159,
				"body": "> [randomshits](#comment_192_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): @gitcenter can you confirm this?\n\n@gitcenter Also please don't mention how one would go about this. I trust that users that are tech savvy enough to find it on their own, are also wise enough to not abuse this.\nFor the record, I reported this issue months ago.",
				"added": 1570040567
			},
			{
				"comment_id": 160,
				"body": "> [randomshits](#comment_193_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Even KopyKate has a potential exploit where someone can upload a bunch small videos and then plant child porn as the thumbnail  jpeg;base64 text string causing everyone who seeds the site to also seed the cp thumbnails  but like you said.\n\nTo be fair you could do that anywhere. There's even an effort to insert CP into the bitcoin blockchain on [millchan/b/](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1H5YxVHvcfKM4STjJwyjYaBe8qbPyR6EZr:b:9ea42cb5-fb15-4de0-a8c3-b7f25fb1af0a).\nAt some point it just turns into a game of semantics over what even is child porn. For example:\nImagine I have child porn and encrypt(say AES) it with a 20 characters long key. I now have ~3MB of random 1s and 0s(the encrypted file) and 20 chars of key. Which of these is the child porn now? The key? The 1s and 0s? Both? Neither?  \nWhat if I use the best encryption that currently exists: XORing it with a string of 1s and 0s as big as the CP file itself. Now I have ~3MB of key and ~3MB of encrypted file. Now close your eyes and open them again. I just shuffled the key and the encrypted file. Which one is which? You can prove mathematically that you will not be able to tell them apart. So what now, which of these is the child porn now? The 'key'? The 'encrypted file'? Both? Neither?  \n  \nThe question here is: At what point is the representation of CP no longer CP?  \n  \nThe ZeroMe thing is a bit different in that it will store the actual `.jpg` file on everyones computer not some other representation(base64 inside of a json file in this case) of it (I'm not saying that makes it less valid of an issue, just that kopykates issue is a bit less 'real').",
				"added": 1570043218
			},
			{
				"comment_id": 161,
				"body": "> [gitcenter](#comment_1124_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Nope, I guess he meant e.g. renaming picture.jpg to picture.json.\n\nI didn't, please check your ZeroMail.",
				"added": 1570120305
			}
		],
		"1570282298_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 162,
				"body": "> [emmet](#comment_6_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): It's just an xfce Debian install with two xfce virtual machines running at all times.\n\nThis is not true. QubesOS is running a Xen hypervisor with an (in some sense) custom made and maintained fedora25 dom0 controller.  \nI terms of recourse consumption it's really demanding. Especially hard disk writes(often random ones, so a SLC(=fast) SSD will do you a lot of favors here) and CPU usage. Depending on how you want to set it up RAM is also a big deal, I'd say to aim for 8GB or above for an acceptable experience. But there's basically zero GPU usage, so you can probably get away with the integrated GPUs some CPUs have.",
				"added": 1570293095
			}
		],
		"1570213999_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 163,
				"body": "> [shareduser](#comment_2_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R): isn't it a fork of tox?\n> [sprite1ww](#comment_5_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp): Is there a desktop client? 🤔 [...]\n\nIt's a fork of antox and abandoned tox client for android. From the [GitHub repo](https://github.com/InsightIM/Tok-Android)(clearnet) it doesn't seen like it has actually altered the tox protocol in any way or made a custom closed 'tok network'.\nAny client for tox should work.   \n  \nI **strongly** urge anyone to **stay away** from Tok or at the very least be very weary of the security of tok, in particular the github hasn't been updated in 5 months(but new versions of Tok have been released, so Tok has to be considered closed source for now ([relevant issue](https://github.com/InsightIM/Tok-Android/issues/14)(clearnet)) and major concerns about it have been voiced by the c-toxcore devs([issue on c-toxcore](https://github.com/TokTok/c-toxcore/issues/1319)(clearnet), [issue on Tok-Android](https://github.com/InsightIM/Tok-Android/issues/7)(clearnet)). I have not been able to find any attempts to fix any of the concerns mentioned and responses to these concerns from the Tok community are emotional at best and do little to address anything that was brought up.",
				"added": 1570380611
			},
			{
				"comment_id": 164,
				"body": "> [vcxt](#comment_10_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): [...] study github carefully\n\nCould you please post the link to the github repo?\nAs [this](https://github.com/InsightIM/Tok-Android)(clearnet) one clearly is out of date and was abandoned some time ago.",
				"added": 1570640902
			}
		],
		"1571500913_1KoioT6zYAXhg2NvChNtZvSU7fx5FhRW1w": [
			{
				"comment_id": 165,
				"body": "I might not be always online, but feel free to message me if you need/want to talk about stuff like that.\nTox: `38B45630BEF5B3F1148AF7FBA19ED4CC29ECBB50756DF6CBC0B0B302D0DB19471A6F08E04C18`\n[ZeroMail](/Mail.ZeroNetwork.bit/?to=pexo): `pexo@zeroid.bit`",
				"added": 1571508253
			},
			{
				"comment_id": 166,
				"body": "> [nekololi](#comment_400_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): those are illegal in most countries. he could face a lot of jail time. in some cases, the penalty is MORE severe than if he were to actually sexually abuse a child.\n\nDo you mean because they collected more 2D loli or actually more severe by law?",
				"added": 1571589116
			},
			{
				"comment_id": 167,
				"body": "> [nekololi](#comment_401_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): well, for example, in the united states, the average prison sentence for CP possession is significantly greater than the average sentence handed out for sexual abuse of a child.\n\nOh, I thought you meant for 2D loli possession specifically. That is true.",
				"added": 1571597119
			}
		],
		"1571752607_1E8JhJj7ukAx8ukr1iwV4Qvgn3UZkai6vP": [
			{
				"comment_id": 168,
				"body": "Has it worked before? If so when did it stop working?\nWhat browser are you on? There have been reported issues with the old Firefox forks (icecat/iceweasel and similar).\nCan you post a thread/board that doesn't work?",
				"added": 1571767630
			}
		],
		"1571820482_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 169,
				"body": "I'm happy to see that this finally gets some public acknowledgement.\n\n>From this article it sounds like MOST of the child porn is being made exactly this way.\n\nThe article states:\n>\"Sometimes the kids are being directed by another subject to self-produce child pornography. A lot of times these kids are tricked because they think they’re talking to a 14-year-old boy or girl [...]\"\n\nThe `A lot` refers to the `Sometimes`. So of the cases where a kid is being directed by another subject, a lot of them are being tricked. So it isn't __a lot__ of kids who are being sextorted, but __some__ kids(indicating it's the minority of cases) being sextorted at worst, because in the worst case `a lot` becomes `all` of the some, that have been directed by others.  Which aligns pretty well with the things I know and the experiences I had on that topic.",
				"added": 1571853589
			}
		],
		"1572101168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 170,
				"body": "Here is the digital signature:\n```\n-----BEGIN PGP SIGNATURE-----\n\niQIcBAABCgAGBQJdrhQkAAoJEOt3RJHZ/wbiXdoP/2MnBf2yN0wqznQn3wu4n4Yg\nIIo4qtsow7idGFUzqKhAF+on/ifOm92oUgFImHOJRjk+DmUZqXY/MJF5N2UdOHuA\n6q/5lfkbcbGKhOEhP4ysIPkC+z5h0gcbXu3/nwBKgMuqwAKjqSrVdOdA8W0TBCqG\npl+masMQ4wEkn+cTEMJ9Yiw0Z+PwaqAXjpXHHxw4lkyTaeIG1B4r6F/p2Rr2og91\nr5bhfQKGyPaF+8k5zvR8Zr5vcceW6KovptTFPjOAYUYmdEsiTgeKOjVhcmZ5CVjA\nJ/RTwUNXXIivlqIHZg9Y04BhbCmcm7MSc6h3pq2hV8Cft7TTNONfAEn72nx8cqn6\nV31DvVoFl8+O44u5/eXdOJHlJ6tTVDsgZGoxNTJ++dlcgvCFhRDjblkSb7fHaD0f\n53FvgB/n07+CcZjFDqHamPM2P3IQo+4waBxsrz5EOEPKerqkwbScUeAjjNVSOo23\nn4dgazgk+bMeOfEkk42HRR9L1PAUY0TecPwMHJoMOmU9+9raJqZAznnsbzEMM/6M\n+4cRDQ5EfYJoRy8JUi/E1/+ficwi1vL2Oe4vBadh5iGXOdEGQulJ6s8r+0h3R83j\n4IA4R3eGSpvpmdZikIh0Z1c9ojE/VEO6ojIFBpUYVV2d0lLT6bLvZQa8a4taH9ib\nXIMpdlY4EIqZHj3xOygL\n=vfHg\n-----END PGP SIGNATURE-----\n```\nThe current Tor Browser signing key is: `EF6E 286D DA85 EA2A 4BA7  DE68 4E2C 6E87 9329 8290`\nGenerally these are the keys you want to have: `0x4E2C6E8793298290` `0xEB774491D9FF06E2` `0xD1483FA6C3C07136`  \n   \n**Never use anonymity software binaries, without knowing who made it!**",
				"added": 1572108056
			}
		],
		"1572281710_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 171,
				"body": "I'm working on something on that, but progress is slow.",
				"added": 1572283176
			}
		],
		"1572891014_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 172,
				"body": "How about GNUnets GNS? The full specifications got released recently and is currently pending standardization. They also have been invited to speak at ICANN66 tomorrow.",
				"added": 1572891555
			}
		],
		"1573376609_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 173,
				"body": "If you want to do a moderation system for a merger zite, you can take a look at [this](https://gitgud.io/millchan/merger/issues/5)(Clearnet) issue on the millchan merger repo, where I outlined a working moderation system that supports 'hierarchical permissions' (so admin(can do anything), moderators(can edit user data), volunteers(can overwrite what is displayed by the js of the zite)) and takes the current limitations of ZeroNet into account, while still being able to be as abstracted away from the user(be it mod or regular user) as one would expect.\n\nI can elaborate this here, if you want.",
				"added": 1573408414
			},
			{
				"comment_id": 175,
				"body": "The original proposal on the millchan repo should still work, but an extended and generalized version of it, I've been working on might be what you want.\nI did a more detailed write up on it on [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/12@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) ZeroNet issue where I reported that ZeroNet does not currently consider nested includes when checking for valid signer addresses for files.",
				"added": 1574272799
			}
		],
		"1573631586_1MoBy8Huy34vMKVjRHe6oy8nuMkeR9fVAe": [
			{
				"comment_id": 174,
				"body": "That's actually a pretty neat idea.",
				"added": 1573663774
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 176,
				"body": "It looks like the purism laptops are pretty much what you look for.\nSo the [librem13](https://puri.sm/products/librem-13/)(clearnet) and the [librem15](https://puri.sm/products/librem-15/)(clearnet). They are also currently in the process of making a phone.",
				"added": 1575217845
			},
			{
				"comment_id": 177,
				"body": "> [edgelordofdecent](#comment_298_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Uses intel. Intel ME included. Problem\n\nAs far as I know they removed it from all their devices about a year ago(or half of one). They even got a notice from intel telling them to stop publishing the reverse engineered code, but they couldn't stop them from removing/neutralizing it without making their efforts public.",
				"added": 1575222144
			}
		],
		"1575989245_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": [
			{
				"comment_id": 178,
				"body": "It is possible.\nYou should take a look at [Running ZeroNet on Tails v1.1](/1NDp4MzD5U52SjCnPAHgxo7qYJsa7ozmrT/) and [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/0@1GUMZzfTCuoZzPbSoreeL2Cu8LYPSMzZrg) issue on GitCenter about that.",
				"added": 1575995230
			}
		],
		"1576059419_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": [
			{
				"comment_id": 179,
				"body": "Disclaimer: I am the owner of PedoHub.  \n  \n> [nickwa](#comment_474_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj):  Like I said, I don't know entirely why the hub's are a thing(waiting till somebody here schools me on that).\n\nBecause of the way they are implemented, zite(=ZeroNet site) owners are basically gods. They can add, remove, delete and alter any content on their zite(this includes user content). They have absolute power on their zite. The idea of Hubs(merger zites) is to separate the zite from the actual data/content of that zite, so their purpose is to take the control away from the developer of the zite you're on and give it to whoever you trust the most. Take ZeroMe for example, the interface/gui(the page that you can see) is under the address `1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH`. But your data is not there, it's stored on another zite(the hub you choose to join when registering).\nThis has multiple benefits, since the ZeroMe dev, who has control over the html/js that your computer runs, cannot modify your data and the hub owner, who has no control over the html/js that your computer runs, could modify your data.\nSo if you like ZeroMe, but notice that your hub is currently censoring you, you can just choose one of the many others out there and move to that and continue to speak freely.\n\nOn a side note: Another benefit of hubs is that data is not all in one place, so you can actually choose what required data(that is data that is downloaded automatically) to download instead of having to download everything. This is part of the reason why PedoHub even exists, to keep people from posting child porn on the regular hubs.\n\n> [selfsigned](#comment_11_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): As i pointed, i didn't even ensured what is inside that HUB; but name is not that much friendly to want to look at all. [...] About the junk data inside, as i didn't look i could not confirm which kind of data where downloaded.\n\nThere is nothing illegal on the index page of PedoHub, if you still have the link you maybe want to give it a read.\nFrom the `I just got here by accident. Am I in legal trouble` section:\n```\nNo, you are not.\nWhile this hub is likely to contain images that are illegal in many countries, files are only downloaded to your computer if they are needed.\nThis means, that images will get onto your machine, only if you click on them within ZeroMe(or any other zite, that supports the ZeroMe merger hubs).\nJust viewing this page is not illegal. Using this hub or just seeding it to read the posts made by users of this hub is also not illegal as long, as you are careful with the images in those posts. \n```\nNote that for reasons outside my control(because I only control the hub, not ZeroMe) avatar images are also considered required by ZeroMe and will be downloaded automatically, but at the time of this writing, nobody has an avatar image that is illegal.\n\n>As i tried to point out, when you MERGE you have 0 control of what the fuck you are doing at all, just accept or ignore.\n\nThat's not true, if a zite wants to add a merger zite(=hub) a prompt will be displayed to you asking you to add the new zite. What can happen though, is that your browser opens the link to a file in a new tab and because link to a file on a hub that you don't have is the same as a link to a file on a zite you don't have ZeroNet will start to download the zite like it would with any other ZeroNet link you put into your browser.\n\n> [nickwa](#comment_472_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): To access that person's profile, you need to usually merge with a hub.\n\nI'm not sure if you mean the right thing. You only need to visit a hub once. ZeroNet will recognize automatically that it is a ZeroMe Merger and allow every zite you gave the `merger:ZeroMe` permission to read it.\n>I am just guessing, might of been a trap. I don't know entirely how some people made their own \"hubs\", but I know it can be done to make their own.\n\nOn ZeroHello you can press the hamburger menu next to any ZeroMe hub and press clone to make your own hub.\n\n> [selfsigned](#comment_10_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): So, the only point of view here is that I entered just 1 person with data, and this fcking person hosts data in such pedoHUB and I just granted access to a HUB that  i may not really need at all to enter \"just the profile\"?\n\nThe profile of each user is only stored in their hub, so you need to download the hub to see it, however not all data of a user is stored on the hub they're on. When you make a comment under a ZeroMe post, that comment is stored twice, once on the hub your on and once on the hub where the post you commented under was stored. In the last case a reference to the address of your hub is also stored. This way a user who stumbles across your comment but doesn't have your hub can still read your comment and is able to get to your profile(by downloading the referenced hub)",
				"added": 1576086045
			}
		],
		"1576345092_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 180,
				"body": "Some are. You can see your current connections on the [Stats page](/Stats).",
				"added": 1576346847
			},
			{
				"comment_id": 181,
				"body": "You can start ZeroNet with the `--force_encryption` flag or add `force_encryption` into your `zeronet.conf` file(it's in your ZeroNet folder). If it doesn't exist you can create a new one and put the following in it:\n```\n[global]\nforce_encryption\n```\nAlthough you should consider that encryption only hides the content of your internet connections. Everyone can see that you are using ZeroNet, if you have to conceal this as well use the Tor only mode, by either adding `tor = always` and `trackers_proxy = tor` to the config file or starting ZeroNet with the `--tor always` **and** `--trackers_proxy tor` flag.",
				"added": 1576347825
			},
			{
				"comment_id": 183,
				"body": "> [haxxer](#comment_59_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): thank you so much\n\nNo worries!\nIf there are any questions you might have or things you might not understand feel free to ask me!",
				"added": 1576348240
			},
			{
				"comment_id": 184,
				"body": "> [haxxer](#comment_60_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): ok.i have done what you said (just for p2p not trackers) by adding force_encryption to zeronet.conf but after i checked the stats (http://127.0.0.1:43110/Stats) there are some connections without encryption (none).so i tried \" python zeronet.py  --force_encryption \" but still the result are the same.\n\nHave you also enabled tor? Because `.onion` connections are encrypted (several times) by default so ZeroNet doesn't have to encrypt them.\nHave you restarted your ZeroNet client?",
				"added": 1576348863
			},
			{
				"comment_id": 185,
				"body": "> [haxxer](#comment_61_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): 😁 im sorry i didnt notice that.\n\nNo worries! It's better to be safe than sorry.",
				"added": 1576348990
			}
		],
		"1576347710_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 182,
				"body": "See my response in the other [ZeroTalk thread](/Talk.ZeroNetwork.bit/?Topic:1576345092_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/are+zeronet+p2p+connections+encrypted).",
				"added": 1576348030
			}
		],
		"1578854998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 186,
				"body": "> [ranshit](#comment_34_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): The FBI owns & distributes 90% of the worlds child nudity while crime rings trade young girls for the sale of millionaire clients.[...]\n\nActually, some interesting numbers on that:  \n  \n\\>EL PASO, Texas (Border Report) — Eighty percent of all sexually inappropriate images of minors in the U.S. today are being produced by the children themselves, according to the FBI.\n  \n\nFor more see [this](/Talk.ZeroNetwork.bit/?Topic:1571820482_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z) ZeroTalk thread.",
				"added": 1578856188
			}
		],
		"1578899506_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 187,
				"body": "> [fractalzoomer@kxoid.bit](#comment_7_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): This graph ends in 1854, and doesn't show anything of the modern industrial age. Some good reads: [...]\n\nI second that.",
				"added": 1578942704
			}
		],
		"1579387320_1Ho88wZ1zroWjxVTXFNsQg256LJ2CK16Bd": [
			{
				"comment_id": 188,
				"body": "For anyone watching/reading this, please do not pay for those kinds of content or child porn in general.\nPaying for it will push the incentive and focus for creating it towards making money. This creates a sustainable business model, in which the safety and well being of the child needs not be considered...",
				"added": 1579547498
			}
		],
		"1579592713_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": [
			{
				"comment_id": 189,
				"body": "> [kleio](#comment_3_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): Content will be pulled from ZeroNet only. No UGC on this site and idea is mass appeal, hence curation.\n\nYou should set the video files as optional. Your zite has about 5GB of required(=auto downloaded) files right now.",
				"added": 1579623535
			},
			{
				"comment_id": 190,
				"body": "> [kleio](#comment_4_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): Reworked content for efficiency.\n\nDid you sign and publish it? It's still about 5GB in size.",
				"added": 1579715556
			}
		],
		"1579803165_13HeCqSo3hr5Ady7E3fv17FQ8Pyi1VeeY7": [
			{
				"comment_id": 191,
				"body": "> [zenanon](#comment_60_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): It is run by nofish I believe.\n\nThis is correct.",
				"added": 1579804862
			}
		],
		"1582500655_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 192,
				"body": "> [nekololi](#comment_433_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i wish blocklists stayed pure to their purpose. a blocklist for cp/illegal content, a blocklist for \"hate speech\", a blocklist for spammers, etc. instead they all try to do everything at once, as well as blocking users that piss off the blocklist maintainer. [...]\n\nActually because it's somewhat related: I'm still waiting on file based blacklisting to arrive before I release the cp blocklist I already talked about on multiple occasions.",
				"added": 1582564100
			}
		],
		"1583503902_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 193,
				"body": "There is a fairly complete list at [innocentchilds room](/1J1epG5eMc4bsmh69UctBg4PHEe5B3kYHY/hubs.html)",
				"added": 1583515157
			}
		],
		"1584169815_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 194,
				"body": "> [zenanon](#comment_73_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Just FYI, using Tox is \"self doxing\" practically. The connections are encrypted but it uses direct IP connection between friends. So if I was on Tox (I'm not) and we connect then we reveal our IP addresses to each other.\n\nWell yeah, that's what p2p means, the same is true for BitTorrent or  ZeroNet. And like ZeroNet you can make tox anonymous by using it through tor.",
				"added": 1584203409
			}
		]
	},
	"comment_vote": {
		"14_1PfpsxK9HpYgyPkBtdr7C7UJNfhMwFACue": 1,
		"331_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"10_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"318_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"326_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"40_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"211_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"389_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"350_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1228_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"9_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"609_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"52_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"357_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"2_12kqbnJ3QpaT6extMyBhPzaWvbi8xkPVbt": 1,
		"17_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"76_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"4_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"1273_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"18_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"2_1GyzQuxTLxM4VZHrscHm5iY5W4B8b6f6QL": 1,
		"667_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"42_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"410_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"413_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"416_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"4_1MoBy8Huy34vMKVjRHe6oy8nuMkeR9fVAe": 1,
		"7_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"323_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"60_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"11_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"10_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"16_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1,
		"22_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"1316_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}