{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1600134285,
			"title": "kxoid.bit is not working anymore?",
			"body": "As I understand it right, ZeroTalk allows to use two `cert_signers`: [zeroid.bit](/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/) and [kxoid.bit](/12F5SvxoPR128aiudte78h8pY7mobroG6V/)\nI wanted to try out KxoID, so I followed the instructions and installed _PeerMessage_ plugin. After client restart, \"Create ID\" button became active, but instead successful register I always get `Was not able to register an id at the moment.` message. Is this network/ID provider even working?\n\nAlso, as far as I remember, the maintainer is Krixano, and he deleted his \"Important Zites\" zite and (probably?) left ZN? Side-question is: why?",
			"added": 1600134284
		},
		{
			"topic_id": 1600223577,
			"title": "ZeroWiki: Edited by null",
			"body": "[/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerotemplate&History](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerotemplate&History)\nDo you see this 'edited by null' entry too?",
			"added": 1600223575
		},
		{
			"topic_id": 1602120041,
			"title": "Iframe insertion? How does TorrentFreak zite does that?",
			"body": "So... I was surfing around and watching variety of zites at [Sites.ZeroNetwork.bit](/Sites.ZeroNetwork.bit/).\n\nThen, I've stumbled upon this zite: http://127.0.0.1:43110/1JNqdTGVATFWRLzzYwVu19CuWYus5VmoUS/\n\nThis is TorrentFreak's direct iframe. I mean, this is the fully operational website inside the ZeroNet frame, inserted there by another iframe. In user's data folder it simply looks like this:\n\n```\n<iframe src=\"https://torrentfreak.com/\" style=\"position:fixed; top:0px; left:0px; bottom:0px; right:0px; width:100%; height:100%; border:none; margin:0; padding:0; overflow:hidden; z-index:999999;\"></iframe>\n```\n\nNow, if you can allow any website to be rendered from the inside of zeronet iframe, it can possibly lead to some point of anonimity breach, no? I thought, that if you're inside the zeronet iframe, you should not be able to include any other iframes? It's just you can include anything as an iframe in your zite (and hide it), and the end-user won't even know it is there. The hidden iframe can do some malicious things (like monero mining, i.e.), and the page shown could be usual zite to held end-user's attention long enough.\n\nWhy iframing external http/https resources is allowed?",
			"added": 1602120038
		},
		{
			"topic_id": 1602309517,
			"title": "From ZeroHello you can increase size limit of any zite. Can you do that from your own zite?",
			"body": "Basically what I see is ZeroHello has that yellow buttons in left sidebar, allowing to raise the limits for each zite. It is also possible to do same operation when you're visiting that particular zite.\n\nIf I created my own zite, I can measure if any other zite is reaching the limits, by doing `Cors` + `as`:\n```\n// Cors request allowed first, then...\n    page.cmdp(\"as\", [ziteAddress, \"siteInfo\"]).then((response) => {\n      let currentZiteSizeInBytes = response.settings.size;\n      let sizeLimitForZiteInBytes = response.size_limit * 1000000;\n      if (currentZiteSizeInBytes >= sizeLimitForZiteInBytes) {\n        // Do something\n      }\n    });\n```\n\nBut I can't figure out if I can actually set the size limit to a remote zite from my own zite? Or only ZeroHello is able to do that?..",
			"added": 1602309513
		},
		{
			"topic_id": 1602677892,
			"title": "2.1 Million of the Oldest Internet Posts Are Now Online for Anyone to Read",
			"body": "Decades before Twitter threads, Reddit forums, or Facebook groups, there was Usenet: an early-internet, pre-Web discussion system where one could start and join conversations much like today's message boards. Launched in 1980, Usenet is the creation of two Duke University students who wanted to communicate between decentralized, local servers—and it's still active today.\n\nOn Usenet, people talk about everything, from nanotech science to soap operas, wine, and UFOs. Jozef Jarosciak, a systems architect based in Ontario, had his first encounter with Usenet in 2000, when he found a full-time job in Canada thanks to a job posting there. \n\nThis week, Jarosciak uploaded some of the oldest Usenet posts available to the internet. Around 2.1 million posts from  between February 1981 and June 1991 from Henry Spencer's UTZOO NetNews Archive are archived at the Usenet Archive for anyone to browse. \n\n[See Reddit thread at /r/DataHoarder](https://www.reddit.com/r/DataHoarder/comments/in7rd8/the_usenet_text_archive_goes_online_300_gigs/)\nDirect clearnet link: [usenetarchives.com](https://www.usenetarchives.com/)",
			"added": 1602677887
		}
	],
	"topic_vote": {
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1602786830_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1603487223_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1610231360_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"1627161257_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"1634612688_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	},
	"next_comment_id": 108,
	"comment": {
		"1600032770_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 1,
				"body": "Okay, it also works in Ubuntu, but I had to disable uBlock and Ghostery extensions (FF) to let ZeroID register my identity. Until that, I was getting an error: \n```Error while during request: Forbidden\nPlease try again later.```\nAdded the trackers from Syncronite website link, good to go :)",
				"added": 1600133440
			}
		],
		"1600134285_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 2,
				"body": "Also I see I'm not the only one having an issue: [Topic:1599538182](/Talk.ZeroNetwork.bit/?Topic:1599538182_1K58h2FWDHY6khgbecX1UqFXh2vgGkMKXq)",
				"added": 1600137059
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "Bumping this topic to check is there any progress going on and what is the current status.",
				"added": 1600140035
			},
			{
				"comment_id": 31,
				"body": "> [gitcenter](#comment_1378_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I have half-working code but not a finished product.\n\nNeed any help with code?",
				"added": 1602964714
			}
		],
		"1600200644_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 4,
				"body": "That's called local network - quite possible in computer clubs xD",
				"added": 1600201988
			},
			{
				"comment_id": 49,
				"body": "> [stefzero](#comment_4_1JV9baqEPCwXcpw8YUJGNDvLJWhi2JTVMV): The problem of these sites to play on ZeroNet, and that of the peers, because if it is not very well known, the site will take you a lot of time to: load, save, select etc .... So I do not recommend playing the sites of ZeroNet with games (unless they have many peers). Anyway I know this site: http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/?/play\n\nI keep getting an error:\n```\nContent signing failed\nPrivate key not found in sites.json\n```",
				"added": 1603721597
			},
			{
				"comment_id": 50,
				"body": "> [stefzero](#comment_5_1JV9baqEPCwXcpw8YUJGNDvLJWhi2JTVMV): Test this: : http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg\n\nYeah, it works, but from time to time. Now it was `Content published to 1/5 peers` and took some time for my comment to appear in the chat, I think.",
				"added": 1603724639
			}
		],
		"1600266690_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 5,
				"body": "First link is playing for me (Reverend Gary Davis), but last two links are not available for me to see.\nIn console I have the error message:\n```\nUncaught TypeError: itemInfo.channel_address is null @ all.js:7620:42\n```\nAnd all I see is a loader image with \"loading item\" text...\n\nP.S. Using Syncronite with 156 trackers list. Additionally in my sidebar of ZeroHello page I can see a lot of 'update failed' files, that never happened before. Tried to restart ZN client, manually update or rebuild DB's - stays the same.",
				"added": 1600313037
			},
			{
				"comment_id": 7,
				"body": "> [zeroseed2](#comment_6_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): I created a new tracker that maybe could fix this. Can you try to download the missed file?\n\nNope, still the same error with loading spinner and console error. I even tried from my other machine with other identity and access point - still the same.",
				"added": 1600792194
			},
			{
				"comment_id": 10,
				"body": "> [schiz0@kxoid.bit](#comment_53_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): have you tried to update/check IFS Cluster 0 & 1?\n\nI have those in my sidebar of ZeroHello. They're called `IFS Cluster 0` and `IFS Cluster 1`. On each of them, after clicking \"Update\", I got green message \"Updated!\". But still no changes regarding the problem.",
				"added": 1600944983
			},
			{
				"comment_id": 11,
				"body": "> [zeroseed2](#comment_7_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): My vps sync when i enabled the tracker plugin. Maybe this can work also in Your machine. Could you try this?\n\nDo I need to additionally download this plugin from somewhere? If so, where? I go to \"Plugins\" section, where I can see the togglers of all the plugins available to me. I can see \"AnnounceBitTorrent\", \"AnnounceShare\", \"AnnounceZero\" and so on, but nothing with the title \"*tracker*\".\n\nIf for problem solution it is required to add some additional stuff, then it is not the right solution, imo... If one link works just fine, but not the others, I highly doubt this will be fixed with a plugin installation. What about other random visitors who do not have the plugin? It must just work \"out of the box\", without any additional plugins - or there must be an alert window on the website, saying about necessity of using that plugin...",
				"added": 1600945100
			},
			{
				"comment_id": 12,
				"body": "> [zeroseed2](#comment_9_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): Enable announce bittorrent. This should fix... For me worked is not an \"official\" fix. I think you can disabile it after correct sync\n\nIt is enabled by default. Re-enabling it does nothing regarding the problem.",
				"added": 1601039958
			}
		],
		"1600223577_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 6,
				"body": "> [ransbits](#comment_95_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): I went ahead and restored the page since 'castaway' decided to graffiti it.\n\nYes, but I did the same, because of this exact reason. And while restoring, the next 'edited by' entry appeared to be 'null' - probably because the page restoring by other user is not handled properly, when logging the user actions?..",
				"added": 1600687323
			}
		],
		"1600897212_1PwWwS85gsGDcbKXYUqgD1HchDXiNC4DM9": [
			{
				"comment_id": 8,
				"body": "Theoretically, you can try how this tool will work out in ZN: https://github.com/seanmorris/php-wasm",
				"added": 1600944580
			},
			{
				"comment_id": 9,
				"body": "> [kai0](#comment_1114_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): you can manage at website then make a copy again to put in your zeronet site sign and publish it.  httrack only  copy where the website is changed.\n\nCan you make a more indepth instruction/explanation of how to do so, step by step? Even better to describe it [here in ZeroWiki dev section](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP)",
				"added": 1600944800
			}
		],
		"1601128933_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 13,
				"body": "You can use [ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) or [BinChan's 0-SHARE](/1Dphm8Mth9WYN9fPm1yxj8Y4WhcKRhYXJJ/) (a ZeroUp clone with more space). If you want to create one (not upload, like you've said), then you can dig into the manuals [here](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zite)",
				"added": 1601129386
			},
			{
				"comment_id": 14,
				"body": "> [tomer](#comment_1_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): where i can find this webcopy tool?\n\nhttps://www.httrack.com/",
				"added": 1601132236
			},
			{
				"comment_id": 15,
				"body": "> [tomer](#comment_3_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): im trying to run its command but its not working: python3 zeronet.py siteCreate\n\nYou should really read through the ZeroNet Documentation & manuals. It will require some of your time and dedication, but you'll work it out eventually",
				"added": 1601134942
			}
		],
		"1601469915_17t6ryDjaBqen9EhuAHDhMuAJAmzn95zj1": [
			{
				"comment_id": 16,
				"body": "Yes, there is:\n```\n[global]\nsize_limit = 100000\n```\n100000 MB will be enough for your needs? You can also try 0 and see what will happen (I think 0 removes the limits).\n\nIf you want to know more about params, you should run your `ZeroNet.py` with `--help` arg.",
				"added": 1601480136
			}
		],
		"1601497571_1Pi4fHTeRyrCWpzsTYW2fknPvYydfB11hQ": [
			{
				"comment_id": 17,
				"body": "https://zero.acelewis.com/ it can be accessed through a proxy",
				"added": 1601499797
			}
		],
		"1601999146_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 18,
				"body": "You have two times script inclusion in your `<head>` section:\n```\n    <script type=\"text/javascript\" src=\"js/ZeroFrame.js\"></script>\n    <script type=\"text/javascript\" src=\"js/ZeroFrame.js\"></script>\n```\nRemove one of those. And also, try to describe your problem with more details: it is not clear what it is you're trying to fix and what kind of error the user should encounter (and what steps one needs to do to reproduce it).",
				"added": 1602002164
			},
			{
				"comment_id": 19,
				"body": "> [tomer](#comment_11_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): im getting 'Content signing failed' after logging into my account and trying to post something\n\nI think that's because you're the only one (for now) who is seeding this zite. If everything else works fine, just ignore that message - I got that one too, when signing and publishing the content, while doing some local tests.",
				"added": 1602008849
			},
			{
				"comment_id": 20,
				"body": "> [tomer](#comment_12_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): so you saying that i just need to wait and i will see my messages?\n\nI can't say, because I'm not into your code context and how the stuff works under your hood. For me I can see the messages, authored by `null` (probably you):\n```\n    null: e\n    null: a\n    null: e\n    null: ea\n    null: ammm\n    null: soemthing testing\n    null: test\n    null: e\n    null: e\n    null: ea\n```\nIf you're storing your messages in plaintext or DB, I think you should see them instantly - and others, who enter your zite, will just download and seed them for other users.",
				"added": 1602010086
			},
			{
				"comment_id": 21,
				"body": "> [tomer](#comment_13_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): im using a database but idk why its showing null..., you have discord or something like that so i can send you the code?\n\nI think I can already see the code, as it is all client-side... That means all I need to do in order to see your source-code is to clone/download your zite. Or you can use [CodeR](\n/1CodEr7T9xNXSPcwbsvf5fHTqsixDMwDzL/) to send some code, and I'll look into it.\nDescribe your current problem and steps of what you're doing in the code (and what is the result you want to achieve).",
				"added": 1602082474
			}
		],
		"1601407298_1LGjkJTGUREur9dJyVvPqVRDJPVHqbgWdZ": [
			{
				"comment_id": 22,
				"body": "> [teamsdk1](#comment_3_1LGjkJTGUREur9dJyVvPqVRDJPVHqbgWdZ): Anyone? There used to be a file I think and you had to change the link url to change the database location but I'm unsure now.\n\nProbably this? https://github.com/HelloZeroNet/ZeroID - you can easily find it by yourself.\nAlso check out the sources of [KaffieID](/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz) or [CryptoID](\n/cryptoid.bit/)",
				"added": 1602082899
			}
		],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 23,
				"body": "I'm sorry, escape from what exactly?",
				"added": 1602263362
			},
			{
				"comment_id": 24,
				"body": "What are you people talking about?... What is agenda2030? Where do you want to escape and from who?\nWhat is it in your heads and imagination, that is making you \"helpless, sad\" and \"won't let you do that\"-thinking style of thoughts? Wtf)\n\nIs it some kind of trolling with the aim to create noise in places such as ZeroNet? There is a lot of stuff to do, just look around :D Make influence instead escapism and explore stuff instead being helpless.",
				"added": 1602270076
			}
		],
		"1602309517_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 25,
				"body": "> [notime](#comment_1_1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w): Is it the maximum size of the zite that you're trying to set? The options in the sidebar are controlled by a plugin, Sidebar. From the source there's a SiteSetLimit command you can send with an argument of the size. You could try sending that - it doesn't take a zite address so you'll probably need to use as like you're doing with siteInfo. Here's the relevant code from UiWebSocket.py: [...]\n\nWon't let me do it, as it says that I have no permission to do that action within `as` command: `\"No permission for site <address>\"` returned as response. So I wonder is it only `ZeroHello` frontend and `self` (when you're on the zite itself) that are allowed to raise limits...\n\n`siteInfo` works because I'm only requesting (read permission) the info from the remote (CORSed) zite. But with `setSiteLimit` I'm trying to write some new value, and that's where the problem is, probably... I'm curious how ZeroHello is allowed to change this, so I could implement that functionality on my zite too.",
				"added": 1602327672
			}
		],
		"1602417833_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 26,
				"body": "You can also refer to an issue for those, who are out of the context, to get more info about \"the fix\":\nhttps://github.com/HelloZeroNet/ZeroMe/issues/147",
				"added": 1602420355
			}
		],
		"1602120041_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 27,
				"body": "> [notime](#comment_2_1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w): A number of sites use external resources. It's common for those that are mirrors or otherwise copied to zeronet. It's one of the reasons using tor browser is good for browsing zeronet sites, so that information like ip address is not leaked to clearnet.\n\nI understand that you can use external resources, CDN's and so on. But what could be improved regarding that is to notify the end-user about possible external resources inclusion (if it is possible to do such check). I want to support and seed zites, that are fully in ZN network, but not those who simply use iframes or remote stuff from elsewhere...",
				"added": 1602503624
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 28,
				"body": "\"My belief is\" - that's a very strong argument. You can take it to the bank :D",
				"added": 1602624684
			}
		],
		"1602793600_1KBkXs64bRMnZoTXzq5gdrsd1ZupSfMrwE": [
			{
				"comment_id": 29,
				"body": "Depends on your game mechanics. Should be relatively easy with non-realtime games.",
				"added": 1602793828
			},
			{
				"comment_id": 30,
				"body": "[Flappy Bird](http://127.0.0.1:43110/1LMG9b3mhvnfAiMpRccSNzvTbq6bYCQWLf) as an example of another simple game =)",
				"added": 1602807198
			}
		],
		"1603117313_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 32,
				"body": "Says \"content.json not found\" for this link",
				"added": 1603122179
			},
			{
				"comment_id": 35,
				"body": "Oh, I think the problem might be in implementation:\n```\n   Connecting...\nTrackers announcing: 5, error: 3, done: 38\nPeers found: 8\nSite size: 721MB is larger than default allowed 10MB\n```\n\nLots of people are simply closing the window when they see such monstrous size of your website. Maybe you should try an optional files instead? It is possible to wrap up all the frontend and pictures into 10MB of default limit, and then you could simply offer to optionally download some large content.\n\nAfter full download I get:\n```\nNot Found\nindex.html\n```",
				"added": 1603123542
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 33,
				"body": "Сейчас у многих людей депрессия.\nНа вот, ознакомься: https://www.youtube.com/watch?v=_UtA0dwGoUQ\n\n\"Sometimes I feel like I should blame the people nearby\" - у меня сейчас такая же ситуация. Кажется, что мир на грани какой-то задницы, и что человечество в целом выбрало какой-то деструктивный и эгоистичный вектор движения в будущее... Это угнетает и демотивирует.\n\n\"but it has become increasingly difficult to stop procrastination\" - тоже самое... И хуже всего, что не понятно, как с этим быть. Хотя я всегда считал себя способным \"справиться со своими состояниями\" оптимистом. Думаю, большую роль также играет и информационное поле, которое для нас выстроили масс-медиа и контент, которым завалены посещаемые соц. сети.\n\nДай угадаю: ты живёшь в России?",
				"added": 1603122453
			},
			{
				"comment_id": 34,
				"body": "Касательно \"There are a few projects that I haven't finished and that are raw and unusable\" - я вот сейчас пилю поиск по зайтам (где задействован CORS-плагин) и думаю сразу раздать доступы людям, которые активны тут уже не первый год. Например, Kaffie (она есть в группе в дискорде), Стироманьяку и тем, кто указан в FZNC.\n\nВообще, депрессивное состояние - это штука сложная и индивидуальная. Если хочешь, можем пообщаться в дискорде, например, на патреон-канале у Kaffie (если я правильно понял, то твой ник там ivanq).",
				"added": 1603122826
			},
			{
				"comment_id": 36,
				"body": "> [gitcenter](#comment_1383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Выдаёт Soviet English? :)\n\nНет, просто я тут уже пару лет и наблюдаю за тем, что и как тут пишут (а ты также пишешь и в Ru ZeroTalk'e). Активность тут, как мне показалось, держится на небольшом количестве энтузиастов, поэтому постоянно мелькают одни и те же ники. Волей-неволей начинаешь анализировать, что и как пишут наиболее активные пользователи, потому что именно активное меньшинство определяет пространство и его направление.\n\nКасательно догадки и места проживания... Я общаюсь с несколькими людьми из РФ и сам там жил около двух лет. У большинства людей, живущих в этой стране, очень высокий __постоянный__ уровень стресса. И это со временем многих из них приводит к границе отчаяния, меланхолии, депрессии. Некоторых - и к суицидальным мыслям. Всех их объединяет то, что они умудрились воспитать себя достаточно разумными для того, чтобы понимать, какая жопа их окружает (критическим мышлением обзавелись, короче). Ну и создаётся парадокс, когда понимание того, в какой ты жопе, и что ты \"один и повлиять качественно\" не можешь, загоняет тебя сначала в интроверсию, потом в изоляцию \"от внешнего мира\", а потом пропадает возможность радоваться мелочам (потому что их в окружающей реальности не появляется).\n\nИ да - в постсоветских странах не признают депрессию как болезнь. Это большая проблема.",
				"added": 1603133830
			},
			{
				"comment_id": 37,
				"body": "> [reichama](#comment_38_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Something to do against depression is exercise to the point of exhaustion. That's when the body releases all kinds of chemicals that help with depression. Big pharma wants to sell everyone pills against everything, but most ailments can be fixed by changing what you eat and exercising. As stupid as it sounds, it works.  [...]\n\nI second that ^\n\nNow to gitcenter: вот этот чел говорит дельные вещи. Это конечно очень индивидуально, потому что не каждый человек может мотивировать себя заняться спортом. Но это реально помогает. Мне вот помогает воркаут и хождение по канату. Это сторонние увлечения, которые не имеют ничего общего с виртуальным миром программирования. Воркаут проверяет твои лимиты, и пока ты этим занят, тело реагирует, выбрасывая в мозг нейромедиаторы, которые и регулируют твоё настроение впоследствии. Иными словами, ты в тонусе и соблюдаешь баланс, когда напрягаешь тело. Могу сказать, что лёгкие нагрузки работают в моём случае, и я успешно не сваливаюсь в тотальную пучину отчаяния типа \"да пошло оно всё нахрен\". Это же работает и с многими другими, может и у тебя получится.\n\nТочно знаю, что в Питере есть много дворов с турниками - там можно найти себе постоянных воркаутеров, которые также будут выступать и мотиватором. Но для этого нужно туда пойти и продержать эту привычку хотя бы пару недель. Это самый трудный момент :D",
				"added": 1603134338
			},
			{
				"comment_id": 38,
				"body": "> [zeroseed2](#comment_12_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): You tried to search for a specialist to help you? Maybe this could help. Other helps are walking between the nature ot thinking that Your work here is useful (maybe the big internet Will not thank you... But Im serching for a Developer to improve some zites here). If you want you can also talk with us! :)\n\nThere is a small problem: in post-soviet countries, there are no really involved specialists who could aid at least with the conversation (not talking about substances - that's another difficult story). And someone in depression would not count as a sick person. In this society, the conventional response is \"You're just Q.Q'ing, just work more and work harder - and everything will be OK!\". There is a _really_ big field of problems to work upon...\n\nAnd - thumbs up for dev's searching proposal :) This can distract for some time, indeed.",
				"added": 1603135134
			},
			{
				"comment_id": 41,
				"body": "> [gitcenter](#comment_1392_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You know, I've always believed the grass is always greener but I had some hope that not the entire Earth is a pile of morons. Yet seeing it's the same in America is disgusting.\n\nLookie here: https://www.youtube.com/watch?v=H6dvrtWrKzw\nI can say that Finland is a strong example of \"greener\" side :D We can take that example and do more of that type of libraries in our countries. It will take some effort, for sure. It will take some time, yep. But it needs to be shared and talked about - the 'good examples' are all there.",
				"added": 1603205461
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 42,
				"body": "\"All The Goo Stuff\"? :)\nNope, it's not on ZN. I think you can manage with all that you've described, using clearnet and some real-life connections.",
				"added": 1603468932
			}
		],
		"1603313852_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 43,
				"body": "For dev, he can query for `dbschema.json` file and check with the structure there, if it matches some already-known structure. The structure is already there, in the db file.\n\nThe implementation would be: to CORS all the zites with similar structure from your zite, check every `dbschema.json` for the same structure - if they are the same, that means they are compatible in terms of data.",
				"added": 1603469247
			},
			{
				"comment_id": 44,
				"body": "> [gitcenter](#comment_1411_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): How would you know what zites to CORS? Definitely not all of them, right?\n\nYup - I will need to discover them manually or I can use 0list or ZeroSites, parse each entry and discover the structure match. But this will require some work and thirdparty scripting, which is a lot of unnecessary work, I think.\n\nBut you can't CORS _all_ of the zites, because the net itself is decentralized, so any particular user discovers some pieces of this web that are very unique to that person. We can't discover ALL of ZN - we can discover something that is well-known already and has lots of peers.\n\nIs it something I don't understand right?..",
				"added": 1603478688
			}
		],
		"1603487223_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 45,
				"body": "Clearnet latest mirror: https://gitea.eponym.info/Mirrors/youtube-dl\nDirect links: https://yt-dl.org/download.html",
				"added": 1603539665
			},
			{
				"comment_id": 46,
				"body": "When trying to go on git center, it asks non-stop:\n\"Add 1 new site?\" (pushing Ok)\nAdded 1 new site. \n\nThen everything repeats... What does it mean?",
				"added": 1603636247
			},
			{
				"comment_id": 47,
				"body": "> [youtubedl](#comment_14_1FbRrp2tcr9ksaNJRRT1Q2Jzw8PBXaFXPg): If you refresh the page, does the popup still appear repeatly?\n\nYup, it appears repeatedly.",
				"added": 1603643863
			}
		],
		"1603720448_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 48,
				"body": "In your `content.json` file add:\n```\n\"background-color\": \"#FFFFFF\"\n```\nIt is possible if you will clone the zite and publish it by yourself. See more here: https://zeronet.io/docs/site_development/content_json/#optional-settings",
				"added": 1603720695
			}
		],
		"1604109014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 51,
				"body": "Why there are only 2 candidates on video? Where are the people? xD Where is the choice? XD",
				"added": 1604114677
			},
			{
				"comment_id": 52,
				"body": "Trump has lost, the topic is over.",
				"added": 1605023345
			}
		],
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 53,
				"body": "To the topic starter: this is a common bias that is called https://en.wikipedia.org/wiki/Hindsight_bias",
				"added": 1606152370
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 54,
				"body": "I'm here because I like the idea of sites being seeded just like torrent files. It is also enjoyable to be able to clone any site you see and fit it up for your own needs.",
				"added": 1607128617
			}
		],
		"1609017796_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 55,
				"body": "I think it will depend on how you will implement the interaction. What will happen after like or vote up is pressed? How it will be stored? If there will be a DB, nothing exceptional will happen, I guess. Still this moment needs to be tested live to see the actual outcome.",
				"added": 1609800364
			}
		],
		"1609856915_1EgNFQT4TxGEw7UpWfaRhEButB3vYqqXQk": [
			{
				"comment_id": 56,
				"body": "You really don't need any, because there are plenty of them in clearnet. If you arrived here for porn, I think you'll be somewhat disappointed. Just go use pornhub or youporn.",
				"added": 1609861336
			}
		],
		"1610475632_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr": [
			{
				"comment_id": 57,
				"body": "I was able to nest directories as deep as I want to, so it seems there is no limit on that.\nExample with FilePak: [PrismBreak GnuNet](/1AsRLpuRxr3pb9p3TKoMXPSWHzh6i7fMGi/en.tar.gz/projects/gnunet/index.html)",
				"added": 1610486389
			}
		],
		"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx": [
			{
				"comment_id": 58,
				"body": "And you came here to tell \"the revelations\"? What use is there of your opinion?",
				"added": 1610487509
			}
		],
		"1610638258_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 59,
				"body": "This shortener is weirdly handling the URL string. I.e. if the url starts with `/<zite_id>`, it interprets it as outside link. There should be strict checking in the input form itself, I think...\n\nAlso would be nice to redact your links if something is entered quite not right...",
				"added": 1610642403
			}
		],
		"1610656430_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 60,
				"body": "What is AR-15? What is the full story behind this?\nDo you really think any other people except you are in the context of what is going on?\nPlease give more details, give more links about the situation, but don't just link some random clearnet stuff for users to visit it. It is a very crude way to deliver info.",
				"added": 1610656911
			},
			{
				"comment_id": 62,
				"body": "GoDaddy is just a hoster. You can backup your database and hold it fully on other service, that is not related to GoDaddy as a hoster. You can also have your files hosted at GitLab or Gitea or etc. Don't, please don't fully rely on your hoster to be \"forever available\" - this is not an option. Imagine that your host's datacenter disappeared in fire. Who to blame then? \n\nThe point is: if you have quite popular project with some community formed over years, don't hesitate to make some backups and have multiple hosters to balance your requests - just in case if one hoster will disappear, you can always rely to second one and so on.\n\nIdeally, let them move to ZeroNet and try to grow here.",
				"added": 1610658243
			}
		],
		"1610655097_13M48m7JiB46SYQ2HHe6E4MHELZ5YUN7hr": [
			{
				"comment_id": 61,
				"body": "Same goes for me on my other machine.\nTry visit [Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o) and follow the instructions i guess...",
				"added": 1610657108
			}
		],
		"1610661458_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 63,
				"body": "It is unclear what are you trying to ask... Please make some examples. Do you mean FilePak archives? And what is \"ZeroNet exclusive\"?",
				"added": 1610661585
			}
		],
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 64,
				"body": "Please, no \"realtrumps\" in ZeroNet. Go elsewhere.",
				"added": 1610728797
			},
			{
				"comment_id": 65,
				"body": "> [quantumkitty](#comment_553_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Trumpers have the right to be here. Non-trumpers have the right to debunk them :)\n\nYes, yes, the right to be here and all this stuff - I understand this. But that's the kind of things that usually kill the atmosphere, pouring all this \"conspiracies/shocking facts\" stuff... And eventually the atmosphere turns to spitting and debunking, tonns of weak opinions, short phrases... And that creates noise, that leads to \"signal\" being lost (no useful, interesting or educational info). \n\nThere already was a thread here: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV/90+of+people+on+ZeroNet+are+crazy+racists+conspiracy+theorists+that+should+be+monitored\n\nWhy not to try to make this net a better place (in terms of quality of information)? Do we really need all this \"shocking and noisy\" stuff, that already can be found in clearnet, here?.. =\\",
				"added": 1610991371
			}
		],
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 67,
				"body": "> [vambrace](#comment_13_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY): I've restarted Zeronet and can now see and reply to \\TestOne\\\n\nThis one was created by me, but I wasn't been able to see it. Will report after upgrade what's changed",
				"added": 1611005111
			}
		],
		"1611507255_1PFNFDTCBgFcXV87E4oP5gBund9igbHB7Q": [
			{
				"comment_id": 68,
				"body": "Indeed, the content is not updated anymore.\nThe question is: how it was updated all this time? It seems that it was done with some automatic script and then uploaded to ZN as magnets and torrent links.\nDoes anyone know how it was handled? Probably we could clone and run that script independently. If not, the only thing to do is to clone Play and dig into the code to make your own autoupdater. But that requires some work.\n\nAlso it seems that stuff was done by RARBG team. Does anyone know about latest news regarding that team?",
				"added": 1611591613
			}
		],
		"1611623437_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 69,
				"body": "What?... >.>",
				"added": 1611624482
			}
		],
		"1611693126_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 70,
				"body": "Hello. What tools you've already used and found most suitable for your needs?\nAnswering this question will help to determine whether ZeroNet's environment and privacy protection mechanisms could be applied to you or not.\n\nAll in all, you can already use the network itself, with all the available services, to securely fetch the data. But keep in mind that this data potentially will be stored across lots of peers (and this can be benefit or the negative point, depending on the needs).",
				"added": 1611706036
			}
		],
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 72,
				"body": "> [styromaniac](#comment_2934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Or message Nofish on ZeroMail.\n\nWaiting over a year on my another account - no response.",
				"added": 1611899258
			}
		],
		"1611929920_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 73,
				"body": "Another one to add to mute list",
				"added": 1611995397
			}
		],
		"1613181782_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 74,
				"body": "Wired already had a nice article about the issue:\nhttps://www.wired.com/story/the-world-might-actually-run-out-of-people/",
				"added": 1613238383
			}
		],
		"1613587814_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 75,
				"body": "> [orien3242](#comment_70_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): go into your zeronet folder to see your comments and delete your old comments.\n\nWhat if I do not want to delete my older comments?",
				"added": 1613606139
			}
		],
		"1614146498_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 76,
				"body": "@merithtk [MOAB](/1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1/)",
				"added": 1614596535
			}
		],
		"1614952464_15PBP7E1m1G82N5r5AoXUFMinSuqD3KnBT": [
			{
				"comment_id": 77,
				"body": "It is not dying. It lacks content and developers, who will make whole thing to appear 'alive'.\nIt's not about the number change in version, it's about overall activity and content creation. ZN is stable enough as it is - some years passed, and everything is still here.",
				"added": 1614979009
			}
		],
		"1614925727_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 78,
				"body": "For usual zites - nope, no problems. But I don't use any seedboxes/uploadin type of zites, so...",
				"added": 1614979095
			}
		],
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": [
			{
				"comment_id": 79,
				"body": "As Anshorei said, easiest way to see all the stuff is to navigate to [/Stats](/Stats) page. It is the equivalent you're looking for.",
				"added": 1614979277
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 80,
				"body": "> [zilviod](#comment_1_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr): i just need it for my family to stop wanting me to vaccine, specially my wife, she won't quit...\n\nWhy don't you vaccinate then? Will be better for your family. Don't be a liar to them, trying to cheat with certificate...",
				"added": 1620770997
			}
		],
		"1621239876_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 81,
				"body": "Join here: [ZeroNet development? We need new heroes! We need you!](/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616664124_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet+development+We+need+new+heroes+We+need+you)",
				"added": 1621254087
			},
			{
				"comment_id": 83,
				"body": "[Carnival Classifieds](/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/) it was I think",
				"added": 1621798230
			}
		],
		"1621394876_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 82,
				"body": "I have this issue on win. Linux shows almost all active trackers, but Windows shows 0 all the time, rarely going up to 1 or 2 trackers being active.",
				"added": 1621404445
			}
		],
		"1621568781_1PSeiYvqdseW3aoqEV5gddDRr7gCHSJPHB": [
			{
				"comment_id": 84,
				"body": "Working just fine. Thanks, zeroseed!",
				"added": 1622775573
			},
			{
				"comment_id": 85,
				"body": "```\nzero://boot3rdez4rzn36x.onion\nzero://zero.booth.moe\nhttp://tracker01.loveapp.com\nhttp://open.trackerlist.xyz\n```\n\nThese seem dead in my list for a long time now",
				"added": 1622775685
			}
		],
		"1622847784_1HKsVQMZ4JucuBTtzpErwhLKMnScUMGvko": [
			{
				"comment_id": 86,
				"body": "What do you mean \"it does not work\"? What exactly is the error?",
				"added": 1622848069
			}
		],
		"1622817482_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [],
		"1625766106_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": [
			{
				"comment_id": 89,
				"body": "It is loaded. Neat ASCII logo :)",
				"added": 1626734633
			}
		],
		"1628479388_14RgUjbLrwrnCSz1tbWorM5dtsY6eSAjLa": [
			{
				"comment_id": 90,
				"body": "That file is a database file where all the data is stored. What zite address does this data refers to?\nHighly possible that some zite uses some malicious piece of code, that is used somehow.\nTo give a precise answer on threat, more details needed.",
				"added": 1628517391
			}
		],
		"1628622129_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 91,
				"body": "`Latest version: 99.7.2 (rev994555)` - looks like some kind of joke? What are the key differences?\nIt seems like you've just cloned [ZeroNet Update](/1uPDaT3uSyWAPdCv1WkMb5hBQjWSNNACf) zite and changed the version number. What is the point?",
				"added": 1628680363
			}
		],
		"1630703227_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 92,
				"body": "> [transcoder](#comment_28_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): by any chance do you mind linking to the geekless fork? gitlab is rather hard to navigate and i can't seem to find it\n\nPardon, I ment github: http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1616664124_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet+development+We+need+new+heroes+We+need+you",
				"added": 1630920385
			}
		],
		"1631366411_13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1": [
			{
				"comment_id": 93,
				"body": "Fork: https://github.com/zeronet-enhanced/ZeroNet/tree/massive-rework\nPlease join and contribute!",
				"added": 1631371779
			},
			{
				"comment_id": 94,
				"body": "> [robione](#comment_671_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Impressive number of contributors - https://github.com/zeronet-enhanced/ZeroNet/graphs/contributors\n\nThat's because most of users just want a verbal participation, but there are almost none of developers who actually silently write the code. Please join and raise the graphs if you do have skill...",
				"added": 1631522897
			}
		],
		"1631675163_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 95,
				"body": "It is not open-source. As it says in the \"Terms of use\", everything is \"their intellectual property\" and is copyrighted under US laws - and this is a big no-no for me.",
				"added": 1631716536
			}
		],
		"1632517987_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 96,
				"body": "At this time, can not reach the site as it has no peers. Waiting it to sync&appear to be available",
				"added": 1632527675
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 97,
				"body": "Hey, wb. Can you check and apply [this patch to ZT++](/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1598713020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd/Dark+theme+Shouldn+t+have+white+buttons)?",
				"added": 1634862732
			}
		],
		"1635503415_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 98,
				"body": "~300 dirs in `data` folder / ~400MB from two devices. I don't host heavy/optional files, i.e. those from ZeroUp",
				"added": 1635504237
			}
		],
		"1636047405_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 99,
				"body": "```\nNot Found\n/list/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/\n```",
				"added": 1636079594
			},
			{
				"comment_id": 100,
				"body": "@styromaniac\nOkay, I've came up with something like this: [syncronite.sh](/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt_4)\n\nSay, do you see the same message from my other account below this one? From `kaffie.bit` domain?",
				"added": 1636152973
			},
			{
				"comment_id": 102,
				"body": "> [styromaniac@kxoid.bit](#comment_209_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Your script doesn't create Syncronite.html and doesn't sign and publish.\n\nAh yes, corrected a bit: [syncronite.sh](/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt_5) - tested, should work",
				"added": 1636486567
			},
			{
				"comment_id": 104,
				"body": "I see you've changed Syncronite sh to old version. Weird enough, I'm now getting messages about trackers unavailable on my Win10 machine >.< And it seems I can not post messages from there... (I also needed to delete my old comment since i have limit reached...)",
				"added": 1636664672
			}
		],
		"1636480186_17um7PR1kBcpsubiDZi7Be7uP6HYDFjyyV": [
			{
				"comment_id": 103,
				"body": "Attempt to connect, connection error 10/10",
				"added": 1636500613
			}
		],
		"1636753641_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 105,
				"body": "I'm still under my old setup on ubuntu, and while trackers count is kinda low (7 active atm), I'm still able to sync.",
				"added": 1636754527
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 106,
				"body": "There is a changelog https://github.com/zeronet-enhanced/ZeroNet/blob/massive-rework/ZNE-ChangeLog/ChangeLog-0.8.0.md",
				"added": 1636754929
			},
			{
				"comment_id": 107,
				"body": "@ssdifnskdjfnsdjk\nNavigate to https://github.com/zeronet-enhanced/ZeroNet, click green \"Code\" button, choose \"Download .ZIP\"",
				"added": 1636926929
			}
		]
	},
	"comment_vote": {
		"1145_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"789_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1125_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"179_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1276_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"6_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"22_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"38_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"354_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"32_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1_12YYWsdkATyXJa4epQ8VJibJAh3gRZD24m": 1,
		"12_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"1_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib": 1,
		"26_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"12_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"12_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1,
		"67_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"15_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY": 1,
		"174_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"128_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"2_1PSeiYvqdseW3aoqEV5gddDRr7gCHSJPHB": 1,
		"1_14W1Bv1r2jPSPuRLGFhfG2PDm5JEitLkC7": 1,
		"1096_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"50_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"1559_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"212_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"232_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1140_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}