{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "FSF в России",
			"body": "Европейцы давно запилили своё ответвление Free Software Foundation. Есть ли такое в России / Азии? Или только хипстерская Роскомсвобода да полумёртвая Пиратская партия? \nКак считает сообщество, имеет ли смысл организовать хотя бы команду Libreplanet (а то  здесь - https://libreplanet.org/wiki/LibrePlanet:Teams - в разделе Russia пусто)?\nЕсть ли вообще в этом чятике живые сторонники СПО?",
			"added": 1520251584
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 1,
				"body": "Разумеется есть. Fedora, Trisquel.",
				"added": 1520251211
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 2,
				"body": "> либо непродуктивно, либо опасно.\n\nНу что непродуктивно (особенно на первых порах) — это ладно, но вода камень точит. А почему опасно?",
				"added": 1520252587
			},
			{
				"comment_id": 3,
				"body": "> Если это станет продуктивно, на это могут обратить внимание соответствующие органы\n\nА чего конкретно стоит опасаться со стороны \"соотвествующих органов\"? Да и какой, собсвтенно их интерес?  Пускай обращают своё внимание.  Миссия организации очевидна, финансироваться будет только на пожертвования. Речь же о более оактивном продвижении СПО, а не о криптоанархизме.",
				"added": 1520253782
			},
			{
				"comment_id": 4,
				"body": "> [caryoscelus](#comment_12_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n\nС таким подходом остаётся только в даркнете отсиживаться и ждать приезда мальчиков в форме.  Не думаю, что такую организацию станут давить сильнее, чем ту же Роскомсвободу или, тем более, профсоюзы.\n\nНужно, просто начать с чисто сетевого представительства и создания сети доверия. А после (обзаведясь хоть каким-то человеческим капиталом  виде пучка активистов и пары юристов) уже выходить в правовое поле с официально засвеченными людьми.  Главное начать. А чтоб начать, нужны люди, готовые шевелиться на эту тему. И самым первым пунктом - просто набрать желающих хотя бы периодически собираться (для начала число в сети, но создание сети доверия для GPG-шифрования крайне желательно, и требует пресечения IRL хотя бы нескольких людей) и обсуждать дйствия и агитацию.",
				"added": 1520257534
			},
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_13_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n> А на них как раз таки давят и иногда очень жёстко.\n\nИменно к тому я их и упомянул. Может быть тяжко, но не смертельно.\n\n \n> Но зачем? Агитацией можно и так заниматься. Опять же трепаться на тему можно и без формальных рамок \"организации\".\n\nБез организованного процесса полезный выхлоп несравнимо ниже. Потому, если скучковаться группой озабоченных, и просто выделить определёную часть своего времени на орагнизованное воздействие, а не когда потный вал вдохновения накатит, то эффективность выше будет.",
				"added": 1520260212
			},
			{
				"comment_id": 8,
				"body": "> Но заниматься только СПО и пытаться поставить себя как бы вне политики мне кажется бесперспективным, потому что если что — вам всегда могут приписать политику.\n\nВот никак не могу уловить тут связи...",
				"added": 1520260272
			},
			{
				"comment_id": 10,
				"body": "> [caryoscelus](#comment_16_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да, вероятно моя реакция могла показаться через чур резкой. \n\nНет, всё отлично, и критика понятна. Смущает, что больше никто не высказался пока. :-)\nУ меня тоже есть негативный опыт запуска объединения (профсоюзной ячейки — запустить запустили, но через некоторое время всё просрали). \nСобственно я почему и предлагаю начать с малого — сборища единомышленников в сети (желательно — тёмной сети). В процессе обсуждений/сходок две трети отвалятся, плюс немножко приползёт со стороны, и дальше монжо будет неспешно двигаться.\nНо нужны люди. А их пока не набирается.",
				"added": 1520334214
			}
		],
		"3_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": [
			{
				"comment_id": 5,
				"body": "Возле надписи Hello ZeroNet_   - нажми на три точки и выбери нужную сортировку",
				"added": 1520259373
			},
			{
				"comment_id": 6,
				"body": "ZeroUp не позволяет мелкие файлы грузить, скотина эдакая...   \n Вот в ZeroMe скриншотик:  http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8/1520259269",
				"added": 1520259469
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_305_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Сделай клон с уменьшенными ограничениями :)\n> Можешь моим воспользоваться: http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/\n\nСпасибочки. :-)",
				"added": 1520319847
			}
		]
	},
	"comment_vote": {}
}