{
	"title": "周易微学堂",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1503802273,
	"post": [
		{
			"post_id": 13,
			"title": "通过日柱来看婚姻",
			"date_published": 1503802227.195,
			"body": "导语：出生日的天干地支是可以看出婚姻状态，这个统计量是很高的，值得介绍。日干就是日主，也是自己，日支就是配偶宫（先生或妻子），日柱干支就是自己和配偶关系的组合。\n\n* * *\n\n**一、日支为财星的男命通常婚姻美满（妻宫妻星）**\n\n乙丑，乙未，丙申，丁酉，戊子，己亥，庚寅，壬午这八日。男以财为妻，日支逢财星称为“宫星同位”，通常是婚姻美满。如果财是喜用神，不但夫妻情深，还能得妻财。\n\n**二、日支为官、杀星的女命通常夫缘好（夫宫夫星）**\n\n甲申，乙酉，丁亥，己卯，庚午，辛巳，癸丑，癸未这八日。女以官杀为夫，日支逢夫财星称为“宫星同位”，也是婚姻美满。如果官、杀是喜用神，不但夫妻情深，也是夫荣妻贵。\n\n**三、日主坐印星的男女命通常婚姻幸福**\n\n日主坐印星就是你被配偶宫所生的组合：甲子，乙亥，丙寅，丁卯，戊午，己巳，庚辰，庚戌，辛丑，辛未，壬申，癸酉这十二日。男女命都以印星为母、为长辈，日主坐印星，你被配偶宫所生，那么你的妻子或丈夫会像母亲一样照顾着你，正如俗云：“娶妻像娘，嫁夫如父”。得配偶照料，当然幸福。而如果印星为喜用神，那就更为完美。\n\n**四、日主坐食、伤，男女命之配偶情缘就各不相同了**\n\n日主坐食神、伤官，就是配偶宫被你所生的组合：甲午，乙巳，丙辰，丙戌，己酉，庚子，辛亥，壬寅，癸卯这九日。男女命，配偶宫坐食、伤，有如父母对子女的情节，会对配偶关怀备至，尤其在物质上，能满足他（她）的要求。\n\n但配偶宫坐食、伤，男女命所显现的配偶关系却大大不相同：\n\n男命配偶宫坐食、伤，虽然财星（妻星）不入宫，但食伤可以生财，能生旺妻星，如果男命日主旺，喜财星的话，则与配偶情缘必深，婚姻幸福；反之日弱忌食伤，婚姻关系就差。\n\n女命配偶宫坐食、伤星，官、杀（夫星）不但不到位，而且被克星占据宫位而受冲克，婚姻不美可想而知。\n\n**五、日主坐比、劫，离婚率较高**\n\n日主坐比肩、劫财就是与配偶宫干支同气的组合：甲寅，乙卯，丙午，丁巳，戊戌，戊辰，己未，己丑，庚申，辛酉，壬子，癸亥这十二日。配偶宫坐比、劫，比、劫为兄弟星，都是克财和争夺之星。\n\n男命以财星为妻，妻星不但不入配偶宫，而且配偶宫被克星强占，有妻星被克被争夺之象，婚姻不顺在所难免；\n\n女命以官、杀为夫星，夫星不入配偶宫，而且配偶宫坐比、劫与夫星相克，比、劫克财，财不生官、杀当然不旺夫，比、劫又主争夺，比、劫入配偶宫主有夫星易被争夺而离异的可能，婚姻幸福也差了。\n\n难怪古人把上述日柱的一些组合称之为“孤鸾煞”、“八专淫欲煞”，指明为婚姻不顺，离婚率较高。（民间习俗将此十二年当做孤鸾年，不宜结婚，实在可笑。）\n\n**六、阴阳差错日，不利婚姻，男女逢之必再婚**\n\n丙子、丁丑、戊寅、辛卯、壬辰、癸巳、丙午、丁未、戊申、辛酉、壬戌、癸亥。\n\n**七、甲辰、甲戌两日，男子逢之必克妻，女人遇之定克夫**"
		},
		{
			"post_id": 12,
			"title": "从八字看出婚后家庭暴力男的特征",
			"date_published": 1503801258.272,
			"body": "认真的选择一个性格脾气好的丈夫，对于女人的未来，是十分关键的。很多女性朋友太感性，不现实，单纯讲究所谓的“爱情”，被男人的表面现象迷惑，轻率做出终身大事的决定，无异于拿人生幸福做赌博。当然，许多女性朋友由于人生经验不足，也会被追求者的伪装迷惑的。\n\n* * *\n\n其实，最好的办法就是用对方八字分析其性格和婚姻星、宫的情况，鉴别对方的本来面目，看他将来是否会对自己配偶很好，是否会对自己配偶使用暴力。所谓婚姻暴力，是指对方心态不良、对妻子粗暴、好发脾气、好打老婆、不顾及妻子感受的行为。\n\n八字中带七杀（偏官）的人，对妻子不会温和容忍。七杀代表喜欢赌凶斗狠、粗暴、心眼小、疑心重等等，具有一定破坏欲望，尤其是日支婚姻宫坐杀的人和八字中七杀为忌又旺、起坏作用大的男人，更是凶狠毒辣，动不动就会暴打老婆。这样的人由于疑心重，是永远也不会相信老婆的，女人一旦和这样的男人结婚，将来的婚姻生活多半会如履薄冰，稍不留神，就会受到丈夫的暴力威胁。\n\n八字中比劫重重的男人，尤其是劫财多的，喜欢对妻子实施暴力。劫财代表冲动，如果这些比劫又多是忌神，或者婚姻宫坐劫财为忌，说明这个人没什么头脑，冲动粗鲁，遇事不加思索就会做出反应，所以这样的男人对妻子粗暴。但是这类男人容易对付，因为没多少头脑，聪明的女人反易驾驭他。\n\n八字中带偏印、伤官、七杀三者的男人，女人最难对付。偏印代表心机多、自私冷漠，伤官代表脾气大，七杀代表粗暴和破坏欲，三者结合，一定是一个自私、敏感、心胸狭隘、心计多、喜欢暴力和破坏的男人，和这样的男人相处，无法摆脱他又时刻受到其打击，将感到疲累不堪。"
		},
		{
			"post_id": 11,
			"title": "由日柱看婚姻的问题——阴差阳错日",
			"date_published": 1503580849.257,
			"body": "导语：从古至今，不少论命人士，大都认为婚姻不顺，与出生的日子关系特别大。因为日柱是自己与配偶的家，两者组合不好，婚姻中就会发生矛盾。\n\n阴差阳错日主要有十二个：丙子、丁丑、戊寅、辛卯、壬辰、癸巳、丙午、丁未、戊申、辛酉、壬戌、癸亥。\n\n* * *\n\n所谓阴差阳错，是指这些日子天地阴阳之气，或有不足，或者力道不够，有差错和失去的风险。\n\n所以古人论命往往非常重视这个日子。认为出生在这个日子的男命，主退妻家，给妻子的娘家带来退气的运气，也与妻家多是非，关系冷淡，互动性差，少言语。\n\n女命逢此日出生的人，则容易受到丈夫控制，自己对婚姻的满意度差，或者不能违逆父母之命，嫁到寒门，或者因为孝顺嫁到残疾、智障人家；或者与公婆、公公不合，关系冷淡，妯娌有损，夫家退气，退财等。\n\n**〖阴错阳差煞〗原文：**\n\n阴错阳差是如何；辛卯壬辰癸巳多；丙午丁未戊申位；辛酉壬戌癸亥过；丙子丁丑戊寅日；十二宫中子细歌；好风流处不风流；花烛迎郎不自由；不是寒房因孝娶；残房入舍俩家仇；女人逢者亦依然；真假公姑或续弦。否则有刑多寡合；外家零落是前缘。\n\n**〖老师注释〗：**\n\n阴错阳差煞对女子的生辰八字是很不好的煞星，看法是由生辰八字日的干支或时辰上的干支：辛见卯、壬见辰、癸见巳、丙见午、丁见未、戊见申、辛见酉、壬见戌、癸见亥、丙见子、丁见丑、戊见寅。女子逢此煞，喜欢风流的人不一定能够风流，而是身不由己的随人做主胡乱嫁个丈夫，结果男方可能是家庭贫寒，以至夫妻两家反目成仇，甚至还会嫁给别人作续弦，如果不是这样，便会遭到许多刑克，自身固然寡居，外家也变的零落。"
		},
		{
			"post_id": 10,
			"title": "由日柱看婚姻的问题——日刃日出生的人",
			"date_published": 1503580541.245,
			"body": "导语：日刃日出生的人，日支为羊刃，属于凶恶之物，像一把利剑，自己与凶器紧贴，当然需要小心侍候。不是自己容易伤到自己，也容易伤到配偶，所以大多婚姻不顺。\n\n日刃日是指：丙午、戊午、壬子、丁巳、己巳、癸亥六日，是指日主坐在羊刃之上。统计上，日刃日出生的人，婚姻不顺居多，占有很大的比例。因为日支为羊刃，属于凶恶之物，像一把利剑，自己与凶器紧贴，当然需要小心侍候。不是自己容易伤到自己，也容易伤到配偶，所以大多婚姻不顺。同时日支坐刃，也主配偶性情凶暴，脾气不好，多遭凶祸。\n\n* * *\n\n此六日出现在日柱的就叫作“日刃”，出现在月柱的，就叫“月刃”，在看八字时，只要日柱出现日刃干支，多半婚姻不美，早婚易离，晚婚就可减其凶了。\n\n日刃格的人，婚姻不顺，女命尤甚。因为女命要求符合坤道，安静、顺应最好。\n\n因为日刃干支，全都是日主坐下为劫财帝旺，夫妻宫坐劫财，那表示另外一半个性强悍，可能会花掉我的钱而已，如果这样就会离婚，那这理由也未免太牵强了。\n\n事实上真正的原因在于“暗克”，也就是在八字中看不到的现象，却往往会产生不利的影响，也就是光从八字的表面上去看，看不出夫妻宫有什么冲克，这就是“暗克”。\n\n戊坐午为帝旺，戊之妻为壬水或癸水，壬坐子为帝旺，所以戊午与壬子为夫妻，戊为夫、壬为妻，而地支子午相冲，代表妻之禄旺去冲夫妻宫，这叫“妻禄冲（夫）妻宫”，暗示着可能生离或死别。所以戊午日主的男命克妻，但戊午日主的女命则不克，因为戊土的丈夫是甲木，甲之禄在寅，寅与午没有相冲，所以不克夫。\n\n然而，壬子日主的人，就不论男女都会克另一半，因为壬之妻为丙火，而壬之夫为戊土，不论是丙或戊都是帝旺在午，所以子午冲，也都是“夫（妻）禄冲夫（妻）宫”，所以都是暗克，故而壬子，癸亥日生的人，不论男女都很容易离婚。\n\n丙午女也是如此，但丙午男则否。\n\n丁巳女，己巳男，也需多注意。\n\n另外不是日刃的戊申女，克夫情况也是非常严重，多注意。\n\n如坤命：辛酉、庚寅、戊午、癸亥\n\n初春寒土喜火，戊午女不但不克夫，反帮夫旺盛（此夫亦指有关系之男友）。以寅为男友，酉克庚金盖头，男友条件差，但跟此女在一起之后，运势渐旺，发达了，寅午合，男友有了小三。这也是帮夫旺盛之悲哀。"
		},
		{
			"post_id": 9,
			"title": "由日柱看婚姻的问题——孤鸾日出生的人",
			"date_published": 1503579339.769,
			"body": "导语：孤鸾日是指乙巳日、丁巳日、辛亥日、戊申日、甲寅日、壬子日、丙午日，亦称孤鸾煞。也主婚姻不顺，男主克妻，女主克夫。\n\n所谓命值孤鸾，独枕孤眠；有的人还认为孤鸾出生的女命，还有克子的倾向。\n\n* * *\n\n其实“孤鸾”（孤鸾寡鹄煞），源自于《明朝》《万育吾》所著的【三命通会】一书，卷九：总论诸神煞之【孤鸾寡鹄杀】。\n\n全文如下，古歌曰：\n\n木火逢蛇大不祥（指乙巳、丁巳日生之人）；\n\n金猪何必强猖狂（指辛亥日生之人）；\n\n土猴木虎夫何在（指戊申、甲寅日生之人）；\n\n火马水鼠独枕眠（指丙午、壬子日生之人）。\n\n【三命通会】上述这段话，乃指个人生日之天干地支六十甲子组合中为：乙巳、丁巳、辛亥、戊申、甲寅、丙午、壬子等日生的人，先天上有犯男克妻，女克夫之现象。总共有七组的【孤鸾日】。\n\n【孤鸾日】的理论基础：\n\n命理上，女命的夫星为官杀（正官、七杀），男命的妻星为财星（正财、偏财），而依十二长生诀，配偶星遁至该五行的【死绝】之位，【三命通会】就论为先天上，就带克夫、克妻之现象。\n\n例如；女命丁巳日生之人，其夫星官杀为“水”，水之十二长生遁至“巳”为“绝灭”之地。故女命为丁巳日生之人，其在先天上就有克夫之现象。但是如果论男命丁巳日生之人，在论妻星则五行变为“金”而不是“水”，金之十二长生遁至“巳”为“长生”之地。那么就无克妻的现象，故男命不论克妻。\n\n又如“男命辛亥日生之人”，其妻星论财星，而辛金之财星为“木”，木之十二长生遁至“亥”为临“长生”之地。故男命辛亥日生之人，在先天上就没有克妻之现象。但是女命辛亥日生之人论夫星则为“火”不是“木”，就有此现象，火之十二长生遁至“亥”为临“绝灭”之地。故女命辛亥日须论克夫。\n\n其他五日亦同。"
		},
		{
			"post_id": 8,
			"title": "由日柱看婚姻的问题——九丑八专日",
			"date_published": 1503578980.027,
			"body": "九丑日有戊子、丁酉、丁卯、戊午、己酉、己卯、壬子、壬午、辛卯等日柱。\n\n这九天出生的人，日干自坐桃花，是自己和配偶均是情欲较重的表现。所以常常会有影响自己声誉的丑事发生；或者难以启齿的事情，故婚姻难以顺利。而女命又逢空亡的人，也不利子女。\n\n* * *\n\n九丑日，不是指容貌不好看，相反的，生于此日者多半是容貌美丽或是多有魅力！其名为丑，是指名声方面，容易引发不好的风评。尤其因为情感是非而撕破脸，被张扬放大而公开，甚至是对薄公堂，声名狼藉，以致身败名裂者。\n\n八专日有甲寅、乙卯、戊戌、己未、丁未、庚申、辛酉、癸丑等日柱。\n\n因为气势较专，所以称为八专日，志在夺妻争夫，占有欲望强烈，也主淫欲，整天注重享乐。论此日柱，天干坐禄或冠带，通常是身体比较好的，或许性能力也比较好且又强，因此比较容易，招惹酒色困扰与失败。\n\n八专号称“淫欲之刃煞”，九丑为“妨害之辰”，故八专九丑，被合称为“淫欲妨害煞”，犯之主不利姻缘。日柱见八专，有不正之妻，时柱见八专，有不正之子。\n\n婚姻不顺的日柱，经过整理，这些日子为：甲辰、甲戌、乙巳、丙子、丙午、丁酉、丁卯、丁巳、丁丑、丁未、戊寅、戊申、戊午、戊子、己酉、己卯、辛酉、辛卯、辛亥、壬子、壬辰、壬戌、壬子、壬午、壬寅、癸巳、癸亥等，多达26个。在六十花甲子中就几乎占了一半。如果再考虑八字中配偶星和夫妻宫受到刑、冲、克、合的情况，以及桃花、孤寡等等可能婚姻不顺的人就更为普遍，或许也正因为如此，所以有人说，各人有各自的不幸，家家有本难念的经，各人的经更难念。\n\n事实上，每人的婚姻都可能面临一些麻烦，这也不奇怪。但千万不可以为这些凶日出生，就一定认为婚姻不好，神煞论，只是参考，不是绝对。\n\n假若命带八专、日刃，又为八字中忌神的人，婚姻最难幸福，男命尤甚。命带九丑的人，又为八字中忌神的人大多有伤风败俗，破坏门风，影响名声的事情发生，必须要善加注意。至于孤鸾、阴差阳错，九鬼妨害，只要不犯其他凶忌，大多是关系冷淡，阴人作崇，小小的妨害而已，不必过分在意。\n\n但必须了解，既然犯了婚姻中的凶日，必然是婚姻不顺的一个潜在因素，需要加以合理的注意。也有人虽然犯了这些凶日，甚至比较严重，但是结婚后，婚姻并没有出现问题。这也许婚姻不顺之潜在因素，可能表现在恋爱路途上，或许是在别人恋爱中已经汲取了婚姻不顺的教训，体悟出了婚姻成功的真谛。当然也有可能，所找之对像，正足以弥补这不顺之潜在因素，而更有可能是，老师常讲之“真爱”。"
		},
		{
			"post_id": 7,
			"title": "通过八字看一个人的性格",
			"date_published": 1503578574.137,
			"body": "**各干支对日干作用的大小依次是：**\n\n1、日干自身；\n\n2、月支；\n\n3、月干；\n\n* * *\n\n4、日支；\n\n5、时干；\n\n6、年干；\n\n7、时支；\n\n8、年支。\n\n相对而言，要分析一个人的心理特征，以及一个人最容易受到那一方面的命运事象所影响，除日干自身外，还是要配合月支、月干、日支、时干的作用力。\n\n在论地支时，要以地支本气为重（如寅支的本气是甲，辰支的本气是戊），当八字中某一种五行的力量特别强时，左右人性情的作用也就越强。\n\n所以只要认识十天干之特性，其人之特征也差不多掌握了多半。\n\n甲木：重视具体的物质世界，但对物质比较不执着（除非甲己合），善于操作，一般的知觉力较强。可代表父亲。\n\n乙木：比较重视现实、实用之物，对人温和，对肉身的感觉极灵敏，可代表人的身体，妻子、钱财。\n\n丙火：凡事讲义气，颇富权威，为事有魄力、有冲劲，不屈不挠，处事光明正大，也代表好串门子。\n\n丁火：奉公守法，富有理性，凡事易顺从、挂念，对团体、公众的事物比较感兴趣，也会燃烧自己，照亮别人。可代表丈夫、官位。\n\n戊土：对物质淡薄，有孤独僻，不喜欢管人闲事，也不想让人管，表面看起来很憨厚，但自己也希望有一些小作为。\n\n己土：卑弱、厚实、相信传说或谣言，与宗教较有关系，有修养、仁慈，凡事易被同类化。可代表母亲。\n\n庚金：强健但不会鲁莽，自主性但不会侵犯他人，独立而无惧，刚硬却不凶猛。可代表兄弟、朋友。\n\n辛金：鲁莽、激烈、急切，有操作欲望，侵犯性较强，不怕流血，颇富攻击性，自由自在。也代表兄弟、朋友。\n\n壬水：富有欣赏、游历性，比较细腻，对文艺有兴趣，文思流畅，文笔好。可代表女性的女儿。\n\n癸水：敏感、多幻想，重视他人对自己的肯定，但也喜新厌旧，不喜欢既成之规定习俗，心念多转动，喜好文艺。可代表女性的男孩。"
		},
		{
			"post_id": 6,
			"title": "丁火命的特质",
			"date_published": 1503576918.963,
			"body": "丁火人可以说是十天干当中最幸运的“种族”，极易出好命人。与甲木常出“人中龙凤”不同的是：甲木的成功源于他们“不甘人后”的个性使然，而他们的个人财富与社会地位得来十分之不易，总是要经过一番打拼才能走向成功，毕竟属于“有为法”。而丁火人不是这样，他们不见得十分的有钱，官也不见得做的十分的大，但是他们的生活品质通常都不会差，佛家讲“境随心转”，丁火人“心”的力量十分强大，但很有可能，他们自己都不会意识到上天恩赐给他们的这个厚礼，基本上，丁火属于“无为而无不为”的境界。\n\n* * *\n\n和丙火一样，丁火人也是狐朋闺蜜一大票，但不同于丙火的是，他们不会是发号施令者。去哪儿吃饭，去哪里玩儿，去玩儿什么，他们从来都不关心，小丁火们总是美滋滋屁颠儿屁颠儿等跟随着大部队，他们不是不爱发表意见，而是通常不会和大多数提议形成对立面。一般别人说什么，那就是什么。\n\n当华灯初上，姹紫嫣红的霓虹灯竞相闪耀的时刻，是丁火人最为兴奋的，丁火人认为高品质的都市生活才是真正属于他们的人生。所以，就算一个丁火人出生在穷乡僻壤，也很容易的走将出来，进入都市生活，因为在他们心中，不会有清寒二字。明白丁火人为什么容易出好命了吗？但以上说的不是他们成功真正的秘诀。让我来揭露真相给你吧：在丁火的规则里，没有强求二字。是的，丁火人欲望蛮强的，但是真正当理想和现实出现偏差的时候，哪怕这个偏差很大，丁火人也不会据理力争，反而很能知足。举个例子：一个丁火人年初定下一个本年度要挣100万的目标，可是到年终发现只挣到了10万。这时候的他不会痛心疾首懊恼不已，而是会告诉自己说，“恩，不错，挣的不少了，离预期只差90万。”\n\n母亲对于丁火来说，至关重要。通常他们和母亲的关系都会出奇的好，在职场中，长辈式的领导或者同事也莫名的喜欢关心和照顾丁火。丁火是非常容易情绪化的一群人，很飘忽不定，1分2秒的时候还在笑的他们，很有可能在1分2.001秒开始哭，让人会觉得他们很神经质，不过好在他们的情绪来的快去的也快，而且多半也不会变本加厉的声嘶力竭没完没了，于是1分3秒的时候，好像并没有什么事发生似的，他们又恢复如初了。\n\n告诉你追求丁火人的三字秘诀——对他好。是的，他们是极容易受感动的一群人，而且会比较容易知足。看过《蜗居》吗？小贝的冰激凌就可以作为打动丁火人最终极的武器了，可惜海藻不是丁火，否则，她就会一直傻傻的守候着小贝的冰激凌，而不是去投奔宋思明头上的那轮光环。\n\n丁男是高度具有恋母情结的一种男人。老天真的很偏心，他老人家往往还真的容易恩赐比他们大的女子为妻。嫁给丁男真的很实惠——他们超级爱下厨房做饭。注意，做饭对于丁男来说不是迫不得已，而是天生的就是喜欢。这可真是太难得的一件事。“为心爱的人做一份早餐，让她在奶油香里醒来。”这就是丁男最喜欢用的一种示爱方式。而女人回馈丁男最好的方式，就是允许他们时不时的在自己的怀抱中撒一撒娇，就足够了。\n\n丁女相对于丁男而言，就不那么幸运了。通常丁女会对智能高度发达的男选手天生没有抗力。他们喜欢聪明型的男人。未来的那个他可以没财，但是千万不能没才。可是她们一生都难以领悟到的是，聪明的男人往往恃才傲物，往往冷漠。所以，她们对婚姻的体验通常是“寒心”。而且，丁女的那个他还有一个比较大的特征：奔波会很多。基本上他们不会是天天守在丁女身边的，相信“青灯自守，小姑独处”是比较贴近丁女婚姻状态的写照。\n\n丁火是烛火、炉火、万家灯火、人间烟火，是在天上绽放的礼花，是在地上燎原的星星之火。丙火普照万物，丁火照亮一方。因而，丁火人没有丙火人大方，如果你问一个丙火人借钱，借到的可能性极大。如果向丁火人借就很难说喽。丁火人擅长精打细算，喜欢做生意。丁火人有一种骄傲的伤怀情结，会在不经意间油生莫名的感叹，譬如易在乘公车或捷运时伤春等，暗自感伤自己的孤独与寂寞，但实际上很享受孤独与寂寞，如若有人破坏了感伤的气氛，反而会使丁火人恼怒。"
		},
		{
			"post_id": 5,
			"title": "丙火命的特质",
			"date_published": 1503576543.739,
			"body": "丙火人的人缘儿真是可以好的飞到天上去。也只有丙火配得上孔圣的“四海之内皆兄弟”这句话。如果说甲木是属于不甘寂寞的话，丙火是想寂寞都寂寞不了的那类人，不给阳光，他们仍然能灿烂的一塌糊涂，炫人眼目。他们好人缘的原因在于，他们很慷慨无私，爱帮助人，且不求回报。比如说，你一时手紧想找朋友借1万块钱江湖救急，那么就找丙火吧，他们绝对是闪电般的出现在你的面前，把钱送到你的手上，并对你说，“1万够不够，不够说话，我卡上还有”。而且临走前还会宽慰的告诉你，“尽管用，甭急着还。”\n\n* * *\n\n丙火人通常都多才多艺，特别是在表演，艺术领域，以至于在生活当中，他们也行为比较夸张，相对而言，人生也比其他人更加戏剧化。铺张浪费可是丙火人的拿手好戏，不是他们生性浪费，而是他们实在是太爱讲排场，《满城尽带黄金甲》相信大部分人都看过，听说光片中菊花的那些镜头，就花了100多万人民币，此类就是丙火人爱干的事情。\n\n在丙火人的字典里，没有“懒觉”这个词，他们通常是那种起的比鸡还早的人，不是他们乐意这么做，而是他们的宿命如此。丙火人通常一生都不会闲下来，匆匆忙忙的追赶着生命。所以，对丙火人来说，闲下来，或者天天窝到家里，办公室里，实在是天大的灾难。在职场中，丙火一般是“无冕CEO”。为什么这样说？领导的责任之一，就是鼓励下属，使下属充满做好本职工作的动力，而丙火人即便不是领导，他无形中，也很能给周围人带来能量，有如“永动机”般，为众人加油打气。人们也很容易能够感受到丙火人带给他们的生机与力量。\n\n如果在你不开心的时候，身边能有一个丙火做哥们儿，姐妹儿，那么你实在是太幸运了。他们绝对是你极佳的苦水回收站。因为在丙火人的人生哲学里，人生不应该有忧郁和阴霾，没有过不去的坎儿。所以，把自己的这份理念带给身边的人就是他们的人生使命。相信我吧，丙火人会很容易的让你的伤心与不快彻底烟消云散。\n\n不过，在情爱的世界里，丙火可不是明智的选择。丙火无论男女，都是极其难追求的。不不不，连追他们的念头都不要产生，不然的话，你比夸父“死”的要惨。通常，你越追，他们跑的越快。如果你身边的他（她）是丙火的话，需要习惯一种饮品的味道——醋。因为他们身边总是会有其他很多的异性围绕着他们，让你觉得你不是他们世界的最中心。如果让我说出当谁的老公最痛苦，那么丙女绝对可以排的上前三甲，因为在她们的世界里，根本不存在男主角，老公吗，充其量是男配角一号。基本上，她们很难出现在你的朋友圈子里，而你反而会常常被她带入自己的圈子，于是你会经常性的，被“这是xxx的老公”冠名。最后我需要说明的是，丙火人的婚姻生活状态还是不错的，即便经济条件不是太高，他们往往也会把小日子过的风风火火，至少，会让人感觉很温暖，窝心。\n\n丙火是太阳之火，光亮、通透、温暖。丙火命人对朋友热情有礼，性格开朗但在众人面前会荣耀自己，往往给人轻浮的感觉。事业起步有势头无尾声，人生路上起落大。"
		},
		{
			"post_id": 4,
			"title": "乙木命的特质",
			"date_published": 1503575805.014,
			"body": "乙木情绪转变之快，往往令人咂舌。索性的是，他们是不会让你看到他们情绪上微妙的变化的。我举个例子，白天的时候，乙木和一帮朋友疯玩儿了一整天，在这期间，乙木就是众人当中的开心果，会时不时的逗人开心，周围朋友越开心，乙木也就越来劲儿，他们是相当人来疯的一群人。取悦他人之功力，乙木完全可以在十干当中排首位。可是到了晚上回家以后，白天玩乐的余兴会立刻消失殆尽，彷佛刚才的事情与他无关，莫名的，一股悲伤的情绪开始翻涌上来，然后躺在床上，开始黯然神伤，感慨起自己的人生来。似乎，自怨自艾是乙木人入睡前的镇定剂，必修课。\n\n* * *\n\n乙木人一生都极度渴望得到别人的欣赏。乙木往往为周围所有的人而活，在他们的生命里唯独没有的，就是自己。令人矛盾的是，他们骨子里又是彻彻底底的自恋狂人，只是这种特质往往被他们深深隐藏起来，当他们独处的时候，孤芳自赏彷佛就是他们的海洛因，一生都戒之不去。\n\n乙木人也非常重视事业，但是和甲木不同的是，他们不会在乎周围的人知道与否，只是默默的，攀爬在他们理想的阶梯之上。更多的，他们喜欢闻钱的味道，和钱拿在手里时那种扎实的感觉。钱越多，乙木人的安全感就越强。因为，他们是较缺乏安全感的一群人。\n\n一桩生意，或者一个项目，让乙木人去当领头羊，总指挥是非常不明智的决定。乙木不是不能，而是相当不能的来胜任此事。让他们当军师参谋，躲在暗处出谋划策才是王道。如果上帝实在一不留神让乙木当了CEO，那么商业谈判的时候也最好前五后六的多派些人簇拥着他一起去，千万不要让他一个人独闯龙潭。\n\n家人，朋友是两大乙木人生活的重心。也是他们心中捍卫的禁地。所以，不要在乙木人面前说他们家人以及朋友的不是，这样做的结果很可能会使乙木人与你渐行渐远。反过来，乙木人也会比较容易从家人以及朋友那儿得到相当的好处，特别是在事业上，乙木人周围的朋友往往很愿意帮助他们。\n\n做乙木男人是相当幸福的一件事，通常他们的女人缘儿会特别好，他们不会生的高大威猛，也不具备那种男人应具有的野性气质，实际上，他们基本属于“男性气质”的绝缘体，甚至于，会显得比较“娘”。但是奇怪的是，就算雄性特征全无，他们也很能受到女人们的喜爱，喜爱到想去“怜惜”他们的境地。与实际年龄无关的是，就算乙木身边的那个女人没他们大，女人们通常也会把乙木们当成自己的弟弟，甚至是孩子来对待。乙木的妻子通常都会很能干，而且内外兼修，上得厅堂，入得厨房。把乙木老爷们照顾的无微不至。所以说，乙木男人也是出“甩手掌柜”的高发人群。\n\n乙木女人和乙木男人的反差会特别大。乙女是很容易给人产生错觉的一类人。你可能会认为她们很好追求，因为你约她们出来吃饭，她们不会拒绝你，你约她们一起看电影，她们也会欣然接受。过招数月后，当你面目狰狞的坦露出你想和她交往的目的时，她才会亮出茎部的那根刺从而扎到你手。意外了吗？让我为你揭晓答案吧：乙女心中的爱情，往往存在于她们的梦想里，你们第一次吃饭的时候，可能在她的幻想里，你们已经开始交往甚至都步入婚姻殿堂了，可是1个月后在你们一起看《阿凡达》的时候，很可能因为她幻想到数十年后她成黄脸婆，你成大肚腩的样子，从而把你pass掉了。真的是这样，乙女很不擅长拒绝人，但是骨子里，她们又是那么的执着。如果把她们对爱情的幻想比作一个气泡的话，那么现实生活就是一根刺，当这根刺来挑战乙女的信仰时，她们会誓死捍卫，甚至于，付出一生都不会结婚的代价。所以乙女的婚姻和爱情，往往是以悲剧收场。\n\n乙木人一生都热爱丙癸，生于冬天的乙木，多喜太阳浴，奇怪的对鲜艳的色彩产生浓烈兴趣，穿衣必穿红，开车必开红车，喜欢吃辣，饮酒及抽很多很多的烟。养狗及吃羊肉，竟占冬天乙木人的大多数！"
		},
		{
			"post_id": 2,
			"title": "甲木命的特质",
			"date_published": 1497789940.035,
			"body": "甲木生来就是要做栋梁的，是要做国家脊梁的，是要做社会中坚的，是天降大任于一身，可以缔造传奇的人物。李嘉诚就是典型的甲木人，他的人生传奇就是所有甲木人的励志书，你会再看出甲木的人生愿景，那就是，甲木人一生是最容易出头的，是最容易获得认可的，是最容易成功的。社会上那些有所成就的人，在各行各业都是领军人物的人，很多都是甲木人。\n\n* * *\n\n出人头地”是甲木人一生的信仰。西方有谚：“不是你得不到，而是你不够想。”由于甲木人对人生成功的极度渴望，造就了他们身上必须具备那种叫坚忍不拔的气质，而这种气质，往往是一个人成功的重要条件之一。\n\n甲木需要尽可能快的找到适合自己的人生定位，做什么行业不重要，重要的是那个行业的坏境甲木是否喜欢和适应。一旦找到适合自己发展的土壤，甲木会立刻变得极度贪婪，只要是有利于他们成长，发展的养分，他们很擅长迅速的吸收到自己身上并且加以利用，比如人际关系，本领域专业知识等，甲木建立自己的人际关系网，学习的速度非常之快。\n\n甲木人都要感谢中国的一个大圣人，他就是孟子。“故天将降大任于斯人也，必先苦其心志，劳其筋骨，饿其体肤…………”孟子他老人家的这段励志名言简直就是为你们量身定做的。实际上，太顺风顺水对甲木而言并不是一件好事，反而会让甲木无所适从。相反，人生的波折，困苦，甚至是灾难，才是甲木人能够成为人上人最好的推动力。如果这些真的发生在甲木的生活中，你们就没事偷着乐吧，当灾难性的波折出现的时候，也就意味着老天是在给你们飞黄腾达的机会。\n\n甲木日主是比较难追求的，他们骨子里是高傲的，就算很穷，那也是没落的贵族与王者，很难有人被他们看在眼里。但是有一点，一旦你成功突破，在们心里扎下根来。他们就是这个世界最忠贞不二（说难听点儿的，其实就是一根筋）的一群人，甚至你去劈腿都不一定会跟你分手。\n\n甲木，森木之木。甲木又称为“东方青龙”，内含有宽容的胸怀，凛然的正气。甲木命人有仁慈之心，处事公正，不会起歪心杂念，是值得深交的知心好友。"
		}
	]
}