{
	"next_post_id": 7,
	"next_comment_id": 1,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Cassandzero",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1539375760,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1539523748,
			"body": "Сегодня несколько важных событий: крупный православный праздник Покрова Святой Богородицы, в Киеве марш неонацистов (марш УПА), который всегда проходит в этот день - 14 октября ежегодно, сегодня украинские националисты вожможно попытаются захватить важнейшую святыню Киево-Печерскую Лавру в Киеве.\nИз Киева идет одновременно несколько транляций, поэтому вы сможете сами наблюдать все онлайн.\n\nВеб-камера: площадь перед Успенским собором Киево Печерской Лавры в Киеве \n\nhttps://youtu.be/OARVzURHXBQ  народ собирается защищать Лавру от неонацистов\n\nМарш украинских неонацистов (марш УПА) \nТрансляция от украинской \"Свободы\" в Киеве: \nhttps://youtu.be/rmxFx77No7U \n\nКак развернутся события и произойдет ли что нибудь еще, посмотрим. ",
			"date_added": 1539523746
		},
		{
			"post_id": 1539523937,
			"body": "Today there are several important events: the major Orthodox holiday of the Intercession of the Holy Virgin, in Kiev, the march of neo-Nazis (the UPA march), which always takes place on this day - October 14th annually, today Ukrainian nationalists will try to capture the most important shrine of the Kiev-Pechersk Lavra in Kiev.\nSeveral broadcasts come simultaneously from Kiev, so you can watch everything online.\n\nWebcam: square in front of the Assumption Cathedral of Kiev Pechersk Lavra in Kiev\n\nhttps://youtu.be/OARVzURHXBQ people are going to protect the Lavra from neo-Nazis\n\nMarch of Ukrainian neo-Nazis (UPA march)\nBroadcast from the Ukrainian \"Freedom\" in Kiev:\nhttps://youtu.be/rmxFx77No7U\n\nHow the events unfold and if something else happens, we'll see.",
			"date_added": 1539523934
		},
		{
			"post_id": 1539526919,
			"body": "Entrance to the Kiev-Pechersk Lavra\nMany police provocations of Ukrainian neo-Nazis and nationalists are expected. Perhaps the capture of laurels by Ukrainian neo-Nazis. Broadcast\n\nhttps://www.youtube.com/watch?v=7EHzhuPYooQ",
			"date_added": 1539526915
		},
		{
			"post_id": 1539528117,
			"body": "Free media in Ukraine are practically absent. It is expected that in the near future they are going to close partially free media, such as channel 112 Ukraine and Newsone. Neo-Nazis intend to participate in the next presidential election and actively promote laws in the Ukrainian parliament. Poroshenko - new pinochet of modernity. Prisons and basements of the special services are filled with dissidents",
			"date_added": 1539528112
		},
		{
			"post_id": 1539530870,
			"body": "So the neo-Nazi march passed today in Kharkov, Ukraine. Notice the black flags with Nazi symbols. https://www.youtube.com/watch?v=Ba_-eZFjuq4  Nazi slogans actively sounded",
			"date_added": 1539530864
		}
	],
	"post_like": {
		"1NdSMyxNLvRCZ7b7LwUpkXJhLchWwCpj8q_1540455340": 1540662451,
		"18HsR7hftiZVvSQqTE3KBHuKitKHspfQoU_1540646464": 1540662553
	},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1S6HYgixbMAbyjpK1pq71UHa9vemyKowo",
			"user_name": "el3ctron",
			"date_added": 1540662989
		}
	]
}