{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1552060063,
			"title": "Tails and zeronet",
			"body": "Today i try Tails, and i can`t run zeronet here on Tor browser, but i can run zero on Tor on my Manjaro... whats can be wrong?",
			"added": 1552060062
		},
		{
			"topic_id": 1552109959,
			"title": "OpenWEB",
			"body": "Yesterday i found topic on Reddit about OpenNetwork, based on Ethereum, analog to Zeronet. Anyone use it? Or can anyone tell me smth about it? I know, that it working under Chrome, use *.ow domain...",
			"added": 1552109957
		},
		{
			"topic_id": 1552218815,
			"title": "Gif Time/ZeroMe",
			"body": "how to upload gifs to GifTime or ZeroMe",
			"added": 1552218812
		},
		{
			"topic_id": 1552675316,
			"title": "Suicide club",
			"body": "Just have watched that movie. So interesting, is it really there any website similar to it?)",
			"added": 1552675312
		},
		{
			"topic_id": 1552916412,
			"title": "Is i2p so secured, how ppl told about it?",
			"body": "Have watched video abut i2p encryption system. One guy explains, that all traffic is decentralized, encrypted, mixed with other trash and transferred partially through other users of network. it doesnt use ip. Who can explain, if it so secured?",
			"added": 1552916407
		},
		{
			"topic_id": 1552929231,
			"title": "Ninja beats",
			"body": "Ninja beats is still supporting?\n127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/",
			"added": 1552929225
		},
		{
			"topic_id": 1553407395,
			"title": "Transferring of ZeroNet ID",
			"body": "How to transfer ZeroID to another PC/Android without copying all data folder? which file is responsible for Zero ID account?",
			"added": 1553407388
		},
		{
			"topic_id": 1553888479,
			"title": "0net and server drive",
			"body": "Guys, how do you think, is it safe and has any sense to use server HDD with NTFS filesystem (2TB) to use it for Zeronet as basic folder? I use Linux and dont want to keep all data in ./home folder.\n\nPS: I mean, is my server HDD will not been destroyed or partitions will not dead while using it for zeronet? (hdd from USA, 2010)",
			"added": 1553888471
		},
		{
			"topic_id": 1553958946,
			"title": "New linux Kernel.",
			"body": "New Linux Kernel 5.1 was released 1 weak ago. Does anyone test it already?",
			"added": 1553958937
		},
		{
			"topic_id": 1554050133,
			"title": "Yggdrasil",
			"body": "I run yggdrasil, but it doesnt create yggdrasil.conf file. what to do?",
			"added": 1554050123
		},
		{
			"topic_id": 1557247834,
			"title": "DCRS",
			"body": "i have found such zite.\nDoes anyone test it? How it works?\nhttp://127.0.0.1:43110/dcrs.bit/index.html",
			"added": 1557247823
		},
		{
			"topic_id": 1559412214,
			"title": "how to create and run link with terminal in ubuntu",
			"body": "Long time ago I read on ZeroMe post about \"How to make link on ubuntu on Desktop\". Can anyone help? i use Ubuntu 19.04",
			"added": 1559412202
		}
	],
	"topic_vote": {},
	"next_comment_id": 38,
	"comment": {
		"1552060063_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 1,
				"body": "> [60](#comment_23_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): maybe gevent not installed on tails\n\nwhat it gives?",
				"added": 1552067637
			}
		],
		"1552109959_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 2,
				"body": "> [tomasz21](#comment_53_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): ChciaÅ‚bym sprawdziÄ‡. Pod jakÄ… nazwÄ… szukaÄ‡?I would like to check. Under what name to look?\n\nhttps://openweb.network \nIts official website. I checked today a little bit, but too low info.",
				"added": 1552123726
			},
			{
				"comment_id": 3,
				"body": "> [tomasz21](#comment_53_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): ChciaÅ‚bym sprawdziÄ‡. Pod jakÄ… nazwÄ… szukaÄ‡?I would like to check. Under what name to look?\n\nwhat i found:\n- its ethereum based network\n- it has *.ow virtual domains\n- it suppose to be decentralised, but i`m not sure\n- i found 4 websites only\n- It requires to set up extension in Chrome\n- it requires OWT (OpenWeb Tokens, so its not free Oo)\n\nSo i think its just new project to make money (scam). or its real new network.... So i need more info.",
				"added": 1552123988
			}
		],
		"1552203058_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 4,
				"body": "doesnt work",
				"added": 1552204111
			}
		],
		"1552218815_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 5,
				"body": "guys, i just asked how to upload GIF to Gif time\noptionally to zero me\n http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/",
				"added": 1552233655
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 6,
				"body": "that there is real RED ROOMS",
				"added": 1552675919
			}
		],
		"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 7,
				"body": "i`m unlucky to get that site. still unavailable to register",
				"added": 1552896540
			},
			{
				"comment_id": 9,
				"body": "> [krixano](#comment_601_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The Kxoid.bit namecoin address was registered by someone else who used the wrong link (and didn't consult me on the correct link prior to their having registered it). They have given me the name, but I have no namecoin to fix this. Therefore, you must use this link instead: http://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/create-id [...]\n\ni press \"create ID\" button and nothing has happened. only circle instead of button))",
				"added": 1552927605
			}
		],
		"1552916412_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 8,
				"body": "> [nekololi](#comment_348_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): read the thrilling adventure of alice and bob communicating over the network: A Gentle Introduction to How I2P Works\n\ni`ve seen that video. so its really safer than tor even?",
				"added": 1552927174
			},
			{
				"comment_id": 10,
				"body": "> [pexo](#comment_67_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Depends on what you are using it for. I explained that in more detail in this threadIn a very broad stroke: Yes, since Tor relies on central hardcoded trusted servers, while I2P does not. However Tor has a (comparatively) massive budget, state level interest in staying anonymous and (in contrast to many opensource projects) a large number of random people who actually check and audit the source code regularly. The Tor network is also more used and (mainstream)popular then I2P, which improves plausible deniability if you get v&.\n\nthanx:)",
				"added": 1552932311
			},
			{
				"comment_id": 12,
				"body": "> [redlibertyreal](#comment_11_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Of course it uses IP to connect to the network, but inside the network router lease-sets (if memory serves me) are used (essentially just a pair of public keys) so you don't really know the IP of a person you are connecting to 2 hops out (average connection to an \"eepsite\" is 13 hops I believe), and 13 separate hops back. Their official website at https://geti2p.net/ has AMAZING documentation, I can read it for hours. I love I2P, I host my own hidden services with them, but I wouldn't say it's perfect. It doesn't have the same academic research, funding, and pen testing as the Tor project does to back up its claims (certainly not I2P's fault) so I wouldn't rely on it for STRONG anonymity. Theoretically it's better than Tor for darknets, but in practice who is to say? I2P though is by far my favorite \"darknet\". I steer clear of far too many things on ZeroNet because it is so decentralized, using pretty much only the main services (like ZeroTalk, ZeroMe, etc.). The pornography blacklist is a good start, but I don't think it goes far enough. I2P is decentralized, yes, but its services are centralized where they need to be, and every centralized service can be mirrored and replaced if you needed to go to the effort in a worst-case scenario. You have B32 addresses (the hostname, essentially super long public keys) and you can get a domain name free of charge to associate with the \"real\" address from people who distribute them (identiguy, meeh, zzz, etc.) Most of the domain name providers won't give you an address if you are doing bad things, and you yourself specify what DNS services your router will use. Bad people who reflect badly on the network and give it a bad rep are actively discouraged from participating. You can still do what you like, no one will stop you, but I2P is what I would consider an \"ethical darknet\", inspired by the same principles and ideas of the developers of other darknets. It's run by good people, the overwhelming majority of its users are good people. They are basically striving to avoid the mistakes made by the architectures by which information flows, to avoid the mistakes of Freenet, ZeroNet, and the culture of criminality that enveloped around Tor. It's unique in that regard. If you want to do bad stuff on I2P (other than piracy lol) I say \"fuck off\". But if you genuinely like the technology, are interested in the ideas and philosophy behind it, or want a safe place to host a decent anonymous website you'd feel comfortable showing your Grandma, I say to you, welcome!\n\nthanks for so large and clear explanation!",
				"added": 1553096657
			}
		],
		"1553006405_1Gn3VCPeEdJaKUhFQKaJzS8DmdqnC4F7uB": [
			{
				"comment_id": 11,
				"body": "https://adorabilis.wordpress.com/rs-quick-entering/\nhttps://retroshare.ch/",
				"added": 1553011662
			},
			{
				"comment_id": 13,
				"body": "> [ssdifnskdjfnsdjk](#comment_753_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @dude thx for the answers, it helped. Regarding acquiring signed ID it is on People tab, click + button, new identity, \"Linked to your profile\". Then after like 30 minutes i seen the network \"confirmed\"/aknowledged the identity and i can post in the forums i was unable before. ðŸ‘\n\nyou are lucky",
				"added": 1553445054
			}
		],
		"1553958946_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 14,
				"body": "> [satoxyn1](#comment_36_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Yes, it works.What reply did you expect?\n\ni`m just thinking how much stable is it, how much troubles it has (its still beta)",
				"added": 1553966522
			},
			{
				"comment_id": 17,
				"body": "> [jimbored](#comment_1_1KGatpkCpq3etGYp5jfKFa1pZM64ki1cEh): how do you get it on debian?\n\nI dont remember)) i`m using manjaro, its available through core update.",
				"added": 1554134061
			},
			{
				"comment_id": 18,
				"body": "> [quantumworld](#comment_359_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): It works fine. As usual system seems to run just a little faster than before. Try it you can always go back to the older kernel on your boot loader if there are any problems.\n\nyeah agree. around 15% faster",
				"added": 1554309217
			}
		],
		"1554040243_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 15,
				"body": "this datacenter must be outside of countries, who work against freedom or in neutral territory",
				"added": 1554041161
			}
		],
		"1549953207_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 16,
				"body": "i install jami, but it crashes, when trying to add contact",
				"added": 1554049638
			}
		],
		"1554492696_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 19,
				"body": "i dont see here any markets",
				"added": 1554494098
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 20,
				"body": "its sad, cause you can be watched by government. But it doesnt kill us.",
				"added": 1554909666
			},
			{
				"comment_id": 21,
				"body": "> [infinyte](#comment_19_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5): I dont think that furries are our problem either. Actually some of em are the nicest people I ever met.  [...]\n\nagree with u",
				"added": 1554998990
			},
			{
				"comment_id": 22,
				"body": "> [deadfwd2018](#comment_12_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr): Yup, get a dumb phone. Had mine for the last 3 years after I looked up. Hell, I even have a newspaper ROFL. Its great. No distraction. I can read, set it down, nothing flashing in my face\n\n...and being lost in past...",
				"added": 1555038156
			}
		],
		"1555148481_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 23,
				"body": "by my own experience, i lost access via several VPN (but many still working) and a lot of proxies.",
				"added": 1555158877
			},
			{
				"comment_id": 24,
				"body": "> [skrimix](#comment_6_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU): And about circumventing state blocklist. Personally, I don't even notice any blocks most of the time, because I always use vpn and in case it stops working i have GoodbyeDPI from ValdikSS installed on my PC. Currently Roskomnadzor blocks mostly Telegram proxies and TgVPN.\n\nwhere can i get GoodByeDPI?",
				"added": 1555215034
			},
			{
				"comment_id": 25,
				"body": "> [skrimix](#comment_7_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU): ValdikSS's repo on GitHub is unavailable right now, here's latest version I have:http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU/1555221788-goodbyedpi-0.1.4.zip [...]\n\n i need linux one( or source code... i`ll try through wine",
				"added": 1555226358
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 26,
				"body": "how to update zeronet python to version 3 without touching content.json?",
				"added": 1555771173
			}
		],
		"1555844108_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": [
			{
				"comment_id": 27,
				"body": "it depends on taken security measures. But yes, usual transactions is easier to control, steal and fabricate, than bitcoin-like transaction.",
				"added": 1555847383
			},
			{
				"comment_id": 28,
				"body": "> [ztz](#comment_8_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): the #blockchain meme is not for actual use cases [...]\n\nwhy?",
				"added": 1555864933
			}
		],
		"1556366714_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 29,
				"body": "it use DAT protocol instead of HTTP/HTPPS. So link will be look like \"dat://somesite.dt\" (extension can be any you like) ",
				"added": 1556381483
			},
			{
				"comment_id": 30,
				"body": "anyway there is a little amount of sites. If smone create any, a can help to seed it.",
				"added": 1556381777
			},
			{
				"comment_id": 31,
				"body": "if anyone has its own websites on dat platform, i can help seed it!",
				"added": 1556442410
			}
		],
		"1556607688_1H5wGKGegeLwa9YFW2u9o63SonLabbPLyr": [
			{
				"comment_id": 32,
				"body": "it doesnt have bin. I use command ./zeronet.sh in terminal to run",
				"added": 1556644421
			}
		],
		"1557351187_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 33,
				"body": "as i thought... government and rich ppl want bitcoin to die. they are afraid of bitcoin!",
				"added": 1557371375
			}
		],
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": [
			{
				"comment_id": 34,
				"body": "more trackers - better help",
				"added": 1557647744
			},
			{
				"comment_id": 35,
				"body": "i`m trying to stay online maximum time",
				"added": 1557674912
			}
		],
		"1557991095_12kqbnJ3QpaT6extMyBhPzaWvbi8xkPVbt": [
			{
				"comment_id": 36,
				"body": "i dont think so.",
				"added": 1558023243
			}
		],
		"1559412214_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 37,
				"body": "> [sypperpit](#comment_12_1KcivDv72kAwXmY2Pqm3NbyzHWUgG835C8): ln -s <from> <to>\n\nusual link i`ve made, but i cant modify link to run in terminal by double click (on Manjaro XFCE its easy to make)",
				"added": 1559455255
			}
		]
	},
	"comment_vote": {
		"4_1PQQRjVa9rQXnDrWxPPqwroBRroz5F6DFh": 1,
		"11_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"5_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU": 1,
		"175_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}