{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 2,
			"title": "MORPHiS",
			"body": "O [MORPHiS](https://morph.is/v0.8/#home) é um armazenamento de dados distribuído criptografado global destinado a substituir a nuvem para armazenamento e muito mais. Esta primeira versão também inclui mensagens distribuídas gratuitas [DMAIL](https://ipfs.infura.io/ipfs/QmQeVyVUfCLv8ANzRC964Tk32PBqmKYDECcWuoKDMAceEn) (correio distribuído), inerentemente resistente a spam, criptografado inerentemente e sem censura.\n\n#DOWNLOAD\n\n- LINUX: https://ipfs.infura.io/ipfs/QmWy4kGfpKdzfano2EN4rbUQiGoGgHyVNC8itxRVzHxTjo\n- LINUX x64: https://ipfs.infura.io/ipfs/QmXRjLqJQRLxMwG2BPz38ri6eJQJ7vWyiFXsfYbp3jxhwz\n- WINDOWS x64: https://ipfs.infura.io/ipfs/QmZk9u5kyifPtmJADtHrLocAejiiZfJxTgRvNd9LALwZyv\n- PLUGIN FIREFOX (opcional): https://ipfs.infura.io/ipfs/QmSZmqeCb4TnnqFuE82L8MjorkxHHmVCHMruhuDmNFjggA\n- SOURCE: https://github.com/tailsjoin/morphis.git OU https://ipfs.infura.io/ipfs/QmNZW6AiAYzRegAvtw37dQ2N1FWhJ5cCcrYnf8jThNRUpZ\n\n#Tutorial: https://ipfs.infura.io/ipfs/QmfCTwNmknhCNPri4UUiSeCqwSDFW8yCYGNZPHK645C3Be",
			"added": 1576882730
		},
		{
			"topic_id": 3,
			"title": "twister - uma plataforma de microblogging P2P",
			"body": "[twister](https://ipfs.infura.io/ipfs/QmQ23Jjw3dq2hGCJsMmups6DUKfATcpP7SYAJfWBMmL4gC) é a plataforma de microblogging P2P totalmente descentralizada aproveitando as implementações de software livre dos protocolos Bitcoin e BitTorrent.\n\n- http://twister.net.co/\n- https://github.com/miguelfreitas/twister-core.git\n- https://github.com/miguelfreitas/twister-html.git",
			"added": 1576884753
		},
		{
			"topic_id": 4,
			"title": "Retroshare",
			"body": "A Retroshare é uma rede anônima P2P que pretende formar diversos tipos de ambientes privados (entre amigos) e públicos, ambos anônimos e descentralizados. Esses ambientes incluem salas de chat público, servidores de e-mail, fóruns e canais para compartilhamento de arquivos. Todo esse processo tem garantia de anonimato entre desconhecidos e opcionalidade de, ao configurar o encaminhamento de pacotes pela rede Tor, também garantir o anonimato entre amigos.\n\n- https://retroshare.cc/index.html\n- https://github.com/RetroShare\n- Tutorial: https://ipfs.infura.io/ipfs/QmVJEqRHk8Sx3kXxpK1g7592SN1YxG7dDSmYghe1viehWv\n\n#Servidor de Conversação RetroShare\nEsta ferramenta ajuda-lo-à a trocar a sua chave RetroShare. Dar-lhe-à acesso a grupos de conversação para que possa fazer amigos.\n- http://retrochat.piratenpartei.at/",
			"added": 1576887177
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 1,
				"body": "#InterPlanetary ZeroNet\n\nO IPZN é uma plataforma que visa aumentar a web descentralizada através de um mecanismo de pesquisa descentralizado incentivado, pois uma estrutura fornece funcionalidades unificadas estendidas por plugins para sites, com base em protocolos de IPFS e consenso, e também um cliente pronto para uso, semelhante ao ZeroNet para usuários.\n\n- https://gitlab.com/ipzn/ipzn.git\n- https://github.com/ipzn/ipzn.git\n- https://ipfs.infura.io/ipfs/QmQXrdpntLMEKKyWCCPzbShZGs8herS2aNXy5WavhmLL6c",
				"added": 1576874818
			},
			{
				"comment_id": 2,
				"body": "#Como acabar com as senhas? Blockchain é a resposta\n\nImagine uma empresa que possa verificar o histórico de um novo funcionário e integrá-lo com o clique de um único botão virtual ou com um cliente bancário que possa verificar a identidade para um empréstimo sem expor informações pessoalmente identificáveis ​​- novamente com um clique de botão.\n\nEsse é o potencial que o blockchain detém para gerenciamento de identidade descentralizada. Isso é feito criando uma carteira digital que serve como um repositório para todos os tipos de dados pessoais e financeiros, informações que só podem ser compartilhadas após uma solicitação específica e somente com a permissão do proprietário.\n\nA tecnologia blockchain de contabilidade distribuída (DLT) - em combinação com verificação de identidade digital - tem o potencial de resolver problemas de privacidade on-line que afetam desde as vendas ao consumidor e os regulamentos bancários a credenciais de funcionários que permitem acesso a sistemas comerciais confidenciais.\n\n\"Há vários fornecedores nesse espaço que estão no estágio inicial de P&D ou testam seus produtos em projetos-piloto. É muito cedo para declarar qualquer vencedor, por qualquer meio, porque apenas ter um produto em funcionamento não é suficiente. A identidade descentralizada requer um ecossistema vibrante, uma estrutura de confiança de identidade robusta construída em um ledger distribuído ou blockchain, ferramentas para suportar user-friendly funcionalidade e boa experiência de desenvolvedor para dar suporte à ampla adoção\", explica Homan Farahmand, diretor sênior de Pesquisa do Gartner.\n\nUm considerável atributo de segurança de armazenar identidades digitais em um livro-caixa distribuído e criptografado é eliminar repositórios centrais para informações de contas de clientes, de acordo com Julie Esser, diretora de engajamento da CULedger. Esses repositórios são os principais alvos dos hackers.\n\n#Testando gerenciamento de identidades\n\nComo outros CUSOs, CULedger é uma cooperativa de propriedade de várias associações de crédito com o objetivo de fornecer serviços de back-office. Ela foi criada há um ano para desenvolver uma plataforma de gerenciamento de identidade baseada em blockchain chamada My CUID. A plataforma deverá ser lançada no segundo semestre de 2019 e entregará as chaves para proteção de dados aos clientes que se inscreverem em um aplicativo.\n\nEm outubro, o CULedger começou a testar o My CUID com cinco outras cooperativas de crédito. Eliminou a necessidade de nomes de usuário e senhas e liberou os call centers das cooperativas de crédito da obrigação de redefini-los quando um cliente os perde.\n\n#Como funciona \n\nUm cliente novo ou atual, membro de uma cooperativa de crédito entra em contato com uma central de atendimento ao cliente, que envia uma mensagem de texto ao dispositivo móvel do cliente com um link para baixar o aplicativo My CUID.\n\nEm seguida, o representante da cooperativa de crédito entrega ao cliente suas credenciais - uma carteira digital, que contém informações pessoalmente identificáveis ​​obtidas durante o contato inicial com o cliente. Essas informações são criptografadas e só podem ser acessadas com a autorização do membro, que é solicitada quando elas realizam uma transação.\n\nCada vez que um cliente usando o My CUID entra em contato com a cooperativa de crédito - ou vice-versa - o smartphone ou tablet recebe um diálogo pop-up solicitando que ele confirme sua associação antes que qualquer transação seja concluída.\n\n\"Você clica em OK ou Não OK. Não parece muito diferente do que acontece com outros aplicativos em um telefone. Tudo é baseado em canais criptografados que criamos, o que é muito legal. Você está criando um canal de comunicação seguro bidirecional. Então, não apenas sua cooperativa de crédito sabe que é com quem eles estão conversando, mas você também sabe que é a sua união de crédito chamando você”, explica Julie.\n\nA CULedger estabeleceu uma meta de emissão de um milhão de identidades digitais para membros de cooperativas de crédito em 2019. Como as cooperativas de crédito devem cumprir as regulamentações federais do Know-Your-Customer, o serviço de ID digital baseado em blockchain também cumpriria a conformidade regulatória.\n\nAlém de dar ao cliente controle sobre sua identidade, entregando-lhes as chaves de criptografia blockchain, o aplicativo elimina a necessidade de nomes de usuário e senhas e reduz drasticamente o tempo que leva para um representante do call center de uma associação de crédito autenticar um membro.\n\nUm representante pode levar de 60 a 90 segundos para autenticar um membro antes que uma transação seja iniciada. Isso pode ser reduzido para 5 segundos ou menos com My CUID, de acordo com a executiva. \"Não é uma experiência agradável telefonar para um call center porque o cliente é recebido com 20 perguntas para identificar quem você é, então é um processo complicado que precisa ser corrigido”.\n\nTradicionalmente, as cooperativas de crédito e outras empresas de serviços financeiros contam com prestadores de serviços terceirizados para serviços de autenticação de call center e clientes, muitos dos quais localizados fora dos EUA. O CULedger colocaria o controle nas mãos das cooperativas de crédito membros.\n\nEm 2019, a CULedger planeja começar a construir sua rede de permissão de produção. Atualmente, está considerando várias plataformas blockchain, incluindo o serviço Hyperledger Fabric, da IBM, e o Corda , da R3 , o maior consórcio comercial entre bancos, seguradoras e outras empresas de serviços financeiros. A CULedger também está pensando em trabalhar com a Hedera Foundation , criadora do Swirlds , uma plataforma de software para criação de aplicativos distribuídos (dApps).\n\nO Swirlds é baseado no protocolo Hashgraph , um DLT adequado para o setor de serviços financeiros porque pode processar mais de 100.000 transações por segundo, ao contrário do bitcoin, que processa de três a quatro transações por segundo.\n\n\"Precisamos da capacidade de conduzir transações instantaneamente - em tempo real. Planejamos criar nossa própria plataforma, mas com o foco em uma peça de identificação descentralizada, isso nos permite não recriar a roda. Pode haver alguns aplicativos que exigem diferentes plataformas [blockchain]”, diz Julie.\n\n#Como funciona a identidade\n\nPara os consumidores que estão conscientes de suas informações online - números de cartão de crédito, data de nascimento, renda anual etc - blockchain tem o potencial de identidades \"autossoberanas\" como CULedger está criando, ou seja, o usuário controla quem pode ver seus dados ou obter aprovação de compra sem liberar seus detalhes de renda.\n\nAs identidades autônomas funcionam assim: o usuário tem um banco que confirma um limite de crédito ou um empregador confirma o rendimento anual. Essa confirmação é então criptografada, mas disponível, em um ledger blockchain público no qual o consumidor mantém as chaves criptográficas privadas e públicas.\n\nSe um comprador quer um empréstimo de carro de uma concessionária de automóveis, por exemplo, o consumidor pode dar a ele permissão por meio de uma chave pública para confirmar que tem crédito suficiente ou renda anual sem revelar um valor exato em dólar.\n\nAssim, se o vendedor de automóveis quiser garantir que um consumidor ganhe mais de US$ 50 mil por ano, isso é tudo que o livro-razão blockchain confirmará (não que eles realmente ganhem US$ 72.587).\n\nA técnica de confidencialidade é conhecida como prova de conhecimento zero (ZKP), uma tecnologia de criptografia que permite ao usuário provar que fundos, ativos ou informações de identificação existem sem revelar as informações por trás dele. A Ernst & Young criou um protótipo blockchain público que planeja lançar em 2019, para que as empresas usem ZKPs para concluir transações comerciais de forma confidencial. \n\n#Em expansão\n\nFarahmand, do Gartner, disse que identidades autônomas baseadas em registros distribuídos de blockchain estão sendo usadas para todos os tipos de usos das empresas, incluindo novos contratados.\n\nCada vez que um novo funcionário é contratado, um novo identificador descentralizado é gerado pelo empregado e passado para a empresa. Esse identificador pode então ser propagado dentro dos sistemas internos de autenticação de usuários para a rede corporativa e aplicativos.\n\n\"Isso pode ser uma proposta poderosa, pois acelera o processo de integração e as atividades subsequentes de gerenciamento do ciclo de vida da identidade, além de permitir autenticação sem senha. Também ajuda na convergência de várias pessoas relevantes para a organização\", disse Farahmand, explicando que os IDs digitais podem ser usados ​​para acessar vários sistemas dentro de uma empresa com base em permissões baseadas na organização.\n\nUm padrão de design popular para identidade descentralizada é composto por um identificador central e um conjunto de identificadores \"emparelhados\", cada um para um relacionamento que o usuário tenha com uma organização. Identificadores emparelhados são derivados criptograficamente do identificador central.\n\nO identificador de pares permite que um sistema corporativo monitore exclusivamente a identidade de um usuário para cada relacionamento e potencialmente evite a correlação da atividade do usuário entre diferentes relacionamentos, permitindo princípios de privacidade por design no nível do protocolo.\n\nPor exemplo, um funcionário do banco pode ser um cliente do banco ao mesmo tempo usando o mesmo ID de autossoberania. As duas personas são tipicamente representadas por duas identidades digitais em dois sistemas em silos - um como funcionário e outro como cliente do banco.\n\n\"No caso de um modelo de identidade descentralizado, a mesma pessoa pode ter dois conjuntos de identificadores mapeados para a mesma identidade digital central, o que pode potencialmente simplificar a reconciliação das atividades do usuário\", frisa Farahmand.\n\nOutro benefício é a capacidade de simplificar cenários B2B em que um funcionário de uma organização pode ter acesso a sistemas em outro. Se a organização anfitriã confiar na identidade descentralizada que é atestada pela organização convidada, então um novo identificador descentralizado por pares pode ser gerado para autenticar o usuário, simplificando a governança de acesso para clientes corporativos ou outros parceiros.\n\n- Fonte: https://computerworld.com.br/2019/01/04/como-acabar-com-senhas-blockchain-resposta/",
				"added": 1576875832
			}
		],
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": [
			{
				"comment_id": 3,
				"body": "> [caropc1v5](#comment_5_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv): descentralizados, sei, acredito.\n> Velho se o conteudo NÃO FOR tu mesmo mantendo, e depois OS OUTROS que gostarem ajudando a manter no ar, NÃO É DESCENTRALIZADO.\n> Chamar de descentralizado NÃO TORNA algo descentralizado.\n> Vou dar uma lida sobre este treco, mas DUVIDO, que seja descentralizado.\n> Pois se for, vai ser como é a zeronet, basicamente :) , como já uso ela, fico nela :)\n\nNa RetroShare, assim como na ZeroNet, tu pode hospedar o conteúdo localmente. \nOBS.: RetroShare tem suporte para a rede [I2P](https://geti2p.net/pt-br/).\n\n#I2P COMPARADA COM A REDE TOR\n- https://geti2p.net/en/comparison/tor",
				"added": 1576894150
			},
			{
				"comment_id": 4,
				"body": "> [chintroy](#comment_3_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1): Na RetroShare, assim como na ZeroNet, tu pode hospedar o conteúdo localmente.OBS.: RetroShare tem suporte para a rede I2P.\n> I2P COMPARADA COM A REDE TOR\n> \n> https://geti2p.net/en/comparison/tor\n\n#Bittorrent sobre Tor não é uma boa ideia\n\n- https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea",
				"added": 1576895795
			},
			{
				"comment_id": 6,
				"body": "> [chintroy](#comment_4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1): Bittorrent sobre Tor não é uma boa ideia\n> \n> https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea\n\n\"ZeroNet - Sites descentralizados usando criptografia Bitcoin e a rede BitTorrent\"\n- Fonte: https://github.com/HelloZeroNet/ZeroNet/blob/py3/README.md",
				"added": 1576895972
			},
			{
				"comment_id": 7,
				"body": "#RetroShare - Topologia\n- https://retroshare.readthedocs.io/en/latest/concept/topology/",
				"added": 1576896051
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 8,
				"body": "#A Arte da Guerra – Maquiavel\nA Arte da Guerra – Na guerra medieval, convenções aparentemente elementares como a organização do exército, a hierarquia de comando, o Estado-Maior e os códigos de leis militares eram inexistentes. Nicolau Maquiavel alterou tudo isso. Entre outros aprimoramentos, ele instituiu o conceito sistemático de formação de soldados e proclamou a suprema importância da disciplina. Guerra era guerra, achava ele, e a vitória era o principal objetivo ao qual se deviam subordinar todos os outros interesses. Embora republicano de coração, percebia que a necessidade gritante de sua época era um forte líder militar e político que conseguisse criar um Estado unificado no norte da Itália para eliminar as forças estrangeiras do solo italiano.\n- https://gateway.pinata.cloud/ipfs/QmVeJGX7Wjt1hPPuD5j8aLwEXvBPk5HzNcxNZtVLReZif3",
				"added": 1576900715
			},
			{
				"comment_id": 9,
				"body": "#O Príncipe – Nicolau Maquiavel\nO príncipe é um livro que não sai de moda. Mais do que um best-seller, ele é um clássico. Surgem novas edições e grandes estadistas encontram nesta obra suas virtudes literárias e estratégicas. Silvio Berlusconi, presidente do Conselho de Ministros da República italiana, apresentava assim esta obra, ao dá-la como presente de Natal para amigos e colaboradores em 1992: “O Príncipe é o primeiro clássico do pensamento político moderno, referência durante gerações para estadistas e diplomatas. A obra foi concebida como um conjunto de reflexões do autor sobre a arte de conquistar e conservar o poder em um principado.”\n- https://gateway.pinata.cloud/ipfs/QmSbEPLXSW3eV3NEs8p2c4Qar6sUqBrbX35LDnCVBURJRH",
				"added": 1576900771
			}
		]
	},
	"comment_vote": {}
}