{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet apuntes. Manual básico",
			"body": "Zeronet\nSitios web descentralizados utilizando criptografía Bitcoin y la red BitTorrent - https://zeronet.io\n\n¿Por qué?\n\nCreemos en una red abierta, libre y sin censura y en la comunicación.\nNo existe ningún único punto de fallo: el sitio permanece en línea, siempre y cuando al menos 1 par esté sirviendo.\nNo hay costos de alojamiento: Los sitios son servidos por los visitantes.\nImposible de apagar: Es la nada porque está en todo.\nRápido y trabaja fuera de línea: Puede acceder al sitio de Internet, incluso si no está disponible.\n\nCaracteristicas:\n\nsitios actualizados en tiempo real\nNamecoin apoyo dominios .bit\nFácil de instalar: descomprimir y ejecutar\nClone sitios web con un solo clic\nSin contraseña de autorización basado en BIP32: Su cuenta está protegida por la misma criptografía que su billetera, Bitcoin.\nIncorporada en el servidor SQL con la sincronización de datos P2P: Permite un desarrollo del sitio más fácil y tiempos de carga más rápidos\nEl anonimato: soporte de la red Tor completa con .onion servicios ocultos en lugar de direcciones IPv4\nTLS conexiones cifradas\nApertura automática de puertos UPnP\nPlugin para soporte multiusuario (openproxy)\nFunciona con cualquier navegador / OS\n\nQué es ZeroNet : El nuevo Internet P2P\n\nCuando hablamos del “otro internet” automáticamente nos viene a la mente la Deep Web, esa otra Red de redes más clandestina y opaca de lo que podemos imaginar y que escapa a la indexación de los navegadores convencionales. Pero ahora no sólo la Deep Web puede ser denominada “la otra internet” porque está surgiendo un nuevo modelo de Red que cubre no pocas de las carencias y necesidades relativas a seguridad, anonimato y encriptación que nada tiene que ver con la internet profunda.\n\nSe llama ZeroNet y su modelo de desarrollo, implementación y crecimiento es, desde mi punto de vista, más que interesante. ZeroNet es un nuevo modelo de Internet basado en el protocolo P2P y cuya característica más destacable es el cifrado de los datos.\n\nCaracterísticas de ZeroNet\n\nLa principal característica de la ZeroNet es su su estabilidad y seguridad general. Podemos decir al respecto que está estructurada a prueba de caídas. Sencillamente no puede ser tumbada, ni de manera global ni de forma particular sus páginas web. Los ataques por fuerza bruta contra ella no sirven, porque está basada en P2P, de manera que su modelo de expansión y alojamiento no sólo está completamente descentralizado, sino desubicado al 100%, lo que garantiza su estabilidad.\n\nEs una internet paralela, completamente abierta y (lo que aún la hace más interesante), desarrollada al completo por la comunidad de desarrolladores voluntarios empleándose y basándola en software libre.\n\nHasta aquí los criterios básicos de estabilidad, pero analicemos la seguridad y la escalabilidad de esta otra forma de concebir Internet que está empezando a desarrollarse.\n\nEn materia de encriptación sus desarrolladores se han decantado por los mismos sistemas que se emplean para el Bitcoin y para BitTorrent, dotando a la Zero Net de un grado de anonimato y seguridad en las comunicaciones, navegación e interactuación entre sus usuarios, muchísimo mayor que la internet convencional que usamos a diario. Esta capa de abstracción, encriptación y algoritmos de confidencialidad cubren todas las interacciones de esta otra Red de redes.\n\nEl sistema está concebido para que los usuarios sean creadores de páginas web y alojadores de las mismas a través del software correspondiente, lo que descentraliza y blinda el crecimiento de esta otra ciberrealidad.\n\nNo podemos acceder a ZeroNet del modo convencional al que nos conectamos a la Internet que conocemos y que ahora mismo estás utilizando. Pero, tranquilos los usuarios noveles, tampoco presenta las ortopédicas metodologías de Tor y la Deep Web.\n\nDesde la propia web del proyecto podemos descargar el software necesario para conectarnos a esta otra Internet. Una vez instalado el software podemos utilizar cualquier navegador común que tengamos en nuestro PC. Es importante avisar que cada vez que deseemos acceder a ZeroNet deberemos ejecutar este software antes de comenzar con nuestro navegador, de lo contrario, éste nos volverá a conectar a la Internet convencional de los Yahoo, los Google y los Microsoft services…\n\nUna vez conectados, el navegador nos presentará un menú de servicios posibles que no paran de crecer, al ritmo de las nuevas webs que se incorporan. Tenemos sistemas de email encriptados de punto a punto; Sistemas de blogging; Plataformas de foros y tablones al más puro estilo de los noventa; Buscadores propios del sistema ZeroNet (dado que las direcciones URL de esta otra Red paralela no son accesibles por los navegadores si previamente no se ha activado el software de encriptación y navegación P2P anteriormente descrito)\n\nZeroNet es un desarrollo de código abierto disponible en Github para la creación de páginas web bajo una red descentralizada (un entorno P2P torrent) y encriptada con protocolos Bitcoin. Es decir, creas contenido con ZeroNet y este no se aloja en ningún servidor en concreto, lo hospedan todos los usuarios conectados a esta red. Esto es revolucionario y creo que es el principio del fin de los servidores de Internet tal como los conocemos hasta la fecha. Tiempo al tiempo.\nUsar ZeroNet es gratuito, confiable y muy sencillo. Descargas un pequeño zip de 10MB y ejecutas el archivo zeronet.cmd resultante. Desde ese momento se te abre en cualquier navegador el acceso a la red ZeroNet. Con un diseño muy sencillo e intuitivo, puedes activar sus diferentes opciones (Hello, List, Blog, Name, etc) y empezar a jugar con este nuevo invento. No estás navegando por páginas alojadas en ningún servidor, los contenidos los tienes Tú mismo y otros miles de usuarios (filosofia P2P).\n\nPlay, la web de descargas basada en Zeronet\n\nY después de ver de forma muy rápida el funcionamiento de Zeronet, es el momento de hablar de Play. A este nuevo portal se puede acceder directamente con una Zeronet URL que sólo funciona si tenemos la herramienta instalada. Nos ofrece enlaces magnet con los que podremos descargar películas, series y demás contenido disponible.\n\n¡! Sin embargo, no todo es de color de rosa. En TorrentFreak nos explican que Zeronet no es anónimo ya que la dirección IP de los usuarios es pública al menos que utilicen la red anónima Tor o bien una VPN. El resto del funcionamiento es idéntico al de cualquier otra web de descargas P2P, por lo que podríamos tener problemas legales por violación de los derechos de autor.\n\nZeroNet es una subred descentralizada de sitios web que usa el cifrado de Bitcoin y la red BitTorrent. Escrita en Python, tiene una licencia GNU GPL 2.\n\nUsar esta red no es más seguro ni más anónimo que usar la red BitTorrent (Transmission): Descargas y compartes el contenido de los sitios que visitas, que puede ser adecuado o no, igual que cuando descargas y compartes un torrent éste puede ser adecuado o no. En todo caso, se recomienda “proxificar” la conexión a través de Tor.\n\nPoner un sitio en ZeroNet es fácil, se puede clonar uno de los ejemplos que vienen en la página de inicio, activando el sitio y dando clic en la esquina superior derecha del recuadro para desplegar un menú, luego escoger la opción clonar. También es posible crearlo manualmente, desde el directorio de ZeroNet con el siguiente comando:\n\npython zeronet.py site Create\n\nAl finalizar les dará una clave privada, que deben guardarla en un lugar seguro, pues es necesaria para modificar el sitio posteriormente y la dirección del sitio que pueden ingresar en su navegador como http://127.0.0.1:43110/ (tu dirección)\n\nPara modificar un sitio basta con firmar los archivos (te preguntará por la clave privada si creaste el sitio a mano) y publicarlo a los peers:\n\npython zeronet.py siteSign (tu dirección)\npython zeronet.py sitePublish (tu dirección)\n\nArriba a la derecha de la pantalla del Pc hay un circulo violeta con tres franjas blancas. Usos:\n\n-Si lo presionas vas a NewHello\n\n-Si lo mantienes pulsado y lo arrastras bastante hacia la izquierda, te aparece un menú (a veces hay que dar a recargar la web) con un mapa del mundo y opciones personalizadas para esa web en concreto o servicio. Son independientes, puedes poner SIZE LIMIT 150 Mb en http://127.0.0.1:43110/ZeroTorrent.bit/?Home (ZeroTorrent, para que te cargue todos) o sólo 10 Mb en otras webs/servicios que no necesitan tanto.\nAquí también viene: PEERS, DATA TRANSFER, FILES, DATABASE, IDENTITY ADDRESS, SITE CONTROL, SITE ADDRESS, ...",
			"added": 1474415454
		},
		{
			"topic_id": 2,
			"title": "Pruebas, saludos, etc...",
			"body": "Bienvenidos a ZeroTalk en español, en este hilo pueden dejar sus mensajes de prueba, presentaciones, saludos y cualquier cosa que se les ocurra.",
			"added": 1474415586
		},
		{
			"topic_id": 3,
			"title": "¿ Cómo has conocido Zer0Net?",
			"body": "Como has conocido Zer0Net y qué te ha incitado a probarlo?",
			"added": 1474415668
		},
		{
			"topic_id": 4,
			"title": "Publiquen sus perfiles de ZeroMe para hacer una comunidad en español :P",
			"body": "Perfiles de la red social Zer0me",
			"added": 1474415855
		},
		{
			"topic_id": 5,
			"title": "Tablón público anti-pedófilos",
			"body": "Haz público a estos malos usuarios y mantén limpio de basura Zeronet. Manifiesta en sus perfiles de Zerome que no son bienvenidos aquí.",
			"added": 1474988165
		},
		{
			"topic_id": 6,
			"title": "Seedboxes",
			"body": "Con la persecución a los usuarios de las distintas industrias audiovisuales y leyes como la Ley Sinde o la Ley Hadopi, muchos usuarios han decidido pasarse a los SeedBox y a los servidores dedicados para poder intercambiar archivos mediante P2P como Bittorrent.\n\n                                                                     ¿Qué es un SeedBox?\n\nUn SeedBox es un servidor para la descarga y subida de archivos mediante P2P, normalmente casi todos ellos usan el protocolo Bittorrent. Los archivos se bajan al disco duro del SeedBox, y nos los descargamos a nuestro hogar mediante conexiones SSL o SFTP (Filezilla), conexiones cifradas para proteger nuestra privacidad.\n\nLos SeedBox pueden ejecutarse en sistemas operativos Windows o Linux, tienen altas velocidades de descarga y de subida (perfecto para los trackers privados de Bittorrent donde el ratio es importante). Si queremos tener Windows deberemos pagar la licencia, por eso lo más usado son los Linux Ubuntu Desktop.\n\n*Seedbox no dedicado (compartes el uso de la máquina con otros usuarios)\n\nEn estos SeedBox únicamente podremos usar cliente Torrent (normalmente se instala Rutorrent (también Deluge o Transmission) al que se tiene acceso remoto vía web con el navegador) y pocas funciones más (acceso por SFTP y en algunos casos VNC).\n\nDependiendo de qué servidor contratemos, tendremos unas características u otras.\n\n*Sin embargo también podemos contratar servidores dedicados donde tenemos un completo sistema Ubuntu-Linux (o cualquier otra distribución) como si estuviéramos en nuestro hogar.\n\nLos pagos se realizan por Paypal u otros sistemas de pago electrónico ( también con transferencias bancarias o tarjeta de crédito) y pueden ser mensuales, trimestrales etc. Desde que se realizan los pagos hasta que el servidor está activo pasan unas horas ( no siempre), y cuando esté todo listo te mandan un email con todos los datos para entrar al servidor.\n\nAntes de contratar un Seedbox hay que pensar el uso que se le va a dar y el dinero que estamos dispuestos a gastarnos (desde unos 8€ los más sencillos en adelante).\nTodos aceptan trackers privados sin problemas pero muchos no permiten los trackers públicos.\n\nComparación entre empresas (actualizado):\n\nPublic trackers (actualización):\n\n-lbseed.es\nSí (pero sin pasarse). Descarga ilimitada. Precios económicos\n-kaosbox.net\nWe do allow public trackers on our Seedbox, but the torrent is automatically stop when completed 100%.\n-alphaseedbox.com\nPermitido\n-seedblaze.com\nPermitido\n-seedbox.fr\nPermitido?\n-superseedbox.co.uk\nProhibidos\n-swizards.net\nProhibidos\n-vpsdime.com\nProhibidos\n-theworldservers.com\nProhibidos\n-blackwidowhosting.com\nSí se puede descargar desde rastreadores públicos, pero hasta completar.\n-idfnv.com\nPermitidos.(Precios muy económicos pero cobran de tres en tres meses. Cobran unos 5 € por instalación. Servicio técnico desaparecido. Servicio de facturación sospechoso)\n-Pulsedmedia.com\nPermitidos\n-meggafast.com\nPermitidos\n-evoseedbox.com\nPuede descargar torrents públicos y detener el torrent, no se permite la carga.\n-cheapseedboxes.com\nDescargas no tienen límite, pero las subidas de los registradores públicos está suspendida.\n-rapidseedbox.com\nNosotros apoyamos rastreadores públicos en nuestra Seedbox, siempre y cuando no se abuse de ancho de banda.\n-seedstuff.ca\nMuy limitado\n-seedboxbay.com\npublic and private trackers are allowed.\n-seedbox.me\npermitidos\n-seedhost.eu\nPermitido (Muy rápidos y con un montón de extras SABNZBD, Rapidleech, Bittorrent Sync, Transmission, Deluge, Sickrage , Couchpotato, Madsonic, Subsonic...). Pero tienes, según el plan contratado, un límite de subida de un determinado número de TB. Sobrepasado se reduce bastante la velocidad de subida hasta el próximo mes o puedes comprar un bono extra . Si subes mucho te lo comes en cinco días, eso sí, el servicio técnico es muy bueno)\n\n* Truco: Normalmente con Transmission se notan menos las limitacíones de los proveedores\n-tal0ne.co.uk\nUnmetered download\n1MB/s upload and 2.0 ratio\n-leechdrive.com\nUnmetered download\n1MB/s upload and 2.0 ratio\n-seedbox.io\nThe use of public trackers is allowed but on a limited basis. All public torrents will automatically be stopped once one of the following conditions has been met:\n\nThe sharing ratio has exceed 2\nThe torrent has been seeding for more than 2 hours (not including download time)\nThe torrent has been active for more than 24 hours (included download time)\n\n-ultraseedbox.com\nSe permite la descarga, la carga (siembra) en trackers públicos se detiene una vez que es completado.\n-tuvixhosting.com\nPermitido.\n-whatbox.ca\nsi?\n-seedboxes.cc\nPermitidos\n-seedboxco.net\nPermitidos (Recomendable)\n-yourseedbox.com\n?\n-flameboxes.com\nPermitido (A veces falla)\n-feralhosting.com\nPermitido (El mejor. Instalación instantanea. Super rápidos 10 Gbps, estables. Con extras gratuitos: Deluge, Transmission,...(aunque menos que seedhost.eu), sin limites y servicio técnico excelente (aunque no te permite resetearlo). No es el más barato pero si se valora en conjunto tiene una excelente relación calidad-precio) Con VPN\n-box4seed.com\nPermitidos ( Tiene unos precios super-competitivos. Por el precio de un Seedbox simple, aquí puedes contratar un Dedicated Seedbox. Pero claro no es el más rápido y estable del mercado) ¡CERRADO!\n-hostdzire.com\nLimitado\n-superseeder.eu\nLimitado\n-dediseedbox.com\nLimitado",
			"added": 1474989351
		},
		{
			"topic_id": 7,
			"title": "¿Cúal es la mejor distribución gratuita de Linux?",
			"body": "Debian, Red Hat, Fedora, Ubuntu,  CentOS, ...",
			"added": 1475604524
		},
		{
			"topic_id": 8,
			"title": "¿Qué serie de TV recomendarías?",
			"body": "Mr. Robot, Breaking Bag, Blindspot, Graceland, Grantchester, American Gothic, Fear the walking dead....",
			"added": 1475604777
		},
		{
			"topic_id": 9,
			"title": "Como bloquear a una persona en Zerome",
			"body": "Encontrar la clave pública de la persona que usted desea bloquear.\nEncuentre la carpeta con el nombre de esa clave pública (public key) en la carpeta del cubo (hub).\nVaya a la carpeta de esa persona y mire data.json. Asegúrese de que es la persona adecuada que desea bloquear.\nElimine todos sus archivos, incluyendo content.json. Entonces inmediatamente cree una carpeta content.json en el mismo lugar para evitar que el archivo aparezca de nuevo.\nUsted ya no se podrá ver nunca más  las fotografías y comentarios de esa persona.",
			"added": 1475772546
		},
		{
			"topic_id": 10,
			"title": "Tablón público anti-spammers o trolls",
			"body": "Haz público a estos malos usuarios y mantén limpio de basura Zeronet. Manifiesta en sus perfiles de Zerome que no son bienvenidos aquí.",
			"added": 1476359819
		}
	],
	"topic_vote": {
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 1,
				"body": "Privacidad en Zeronet - IP oculta (realmente)\nOpciones:\n\n  1.Activar un programa vpn antes de conectar a ZeroNet\n\n   2.Arrancar zeronet.cmd (tirará de tu navegador estandar Firefox, Slimjet, Microsoft Explorer, Microsoft Edge,...)\n Copiar y pegar New ZeroHello ( http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D) en tu navegador Tor, previamente ya instalado y configurado (Herramientas> Opciones> Avanzado >Red>Configuración> Configuración manual del proxy\n\nY en \"No usar proxy para\" ponemos: 127.0.0.1 (sin comillas)\nPuedes comprobar DESDE DENTRO DE ZERONET con TOR tu ip:\nhttp://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe/\n¡Aviso! En las páginas NO de ZeroNet tu Ip será la real\n\n(o directamente poner en Avanzado>Red>Conexión- Configurar como navegador Tor se conecta a internet>Configuración> marcar Sin proxy. Ahora SÓLO podras ver páginas de ZeroNet)\n\nProgramas como FoxyProxy nos pueden ayudar en estas tareas de cambiar de Zeronet a internet \"normal\".",
				"added": 1474416035
			},
			{
				"comment_id": 2,
				"body": "zeroide ━ el 20 de Agosto 2016 \n\n\ncuando uno ya lleva instalado zeronet , solo necesita ejecutar = python zeronet.py\n\ndatatemp ━ el 21 de Agosto 2016 \n\n\nEs recomendable abrir el navegador firefox en una Sandbox, o este debe estar en un sistema operativo linux (live cd), si usas una vpn, (una no logs), o usa tor proxy. Puedes usar tor browser también.\nModificar el agente de usuarios en el navegador, desablitar WebRTC y demas pueden ayudarse a sí mismos aquí http://127.0.0.1:43110/1J625kWnshbcBk9gE9BdPr4peTeXusRzU8/",
				"added": 1474416224
			},
			{
				"comment_id": 4,
				"body": "Actualizar Zeronet \n¿Cómo actualizar?\nVas a https://github.com/HelloZeroNet/ZeroNet\nPulsas en el botón verde: Clone or download > Download Zip\n\nLo extraes. Copias todo el contenido de ZeroNet-master y lo pegas en la carpeta Zeronet (del viejo).\nTe pregunta Windows ¿Desea reemplazar el archivo en el destino?. Reemplazar todos\nArrancar como siempre desde zeronet.cmd\n\nO simplemente de modo también manual desde Zer0Hello. \nVersión XX Up to date!\nZeronet no se actualiza automáticamente, ni tras un reinicio, sino manualmente por uno de los métodos ya comentados.",
				"added": 1474462545
			},
			{
				"comment_id": 5,
				"body": "https://es.wikipedia.org/wiki/ZeroNet",
				"added": 1474462593
			},
			{
				"comment_id": 6,
				"body": "Configurar Zeronet con Tor en GNU/Linux\nhttp://www.retzner.net/configurar-zeronet-tor-gnu-linux/",
				"added": 1474462610
			},
			{
				"comment_id": 7,
				"body": "Tutorial por icf20 para personalizar tu web clonada\nhttp://127.0.0.1:43110/1JfpEppAtZJZo3rVZQGjYDpkn2gcwGTJn/?Post:3:Modificar+el+clon+de+zerotorrents.bit",
				"added": 1474462640
			},
			{
				"comment_id": 8,
				"body": "Esta pequeña aplicación nos resolverá algunos problemas en la carga de Zeronet y sus webs (navegador Chrome)\n\nhttps://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop\n\nZeroNet Protocol\nZeroNet Protocol helps you to browse ZeroNet websites without http://127.0.0.1:43110\nFor example, after installing this extension you can access ZeroNet websites like:\n\nhttp://zero/1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr\nhttp://zero/1GamESVFyJfkmbxtcrLR2VX4m4VFmwyeRY\n\nSounds cool?\n\nAlso code is open source: https://github.com/goldenratio/zeronet-protocol-crx",
				"added": 1474462669
			},
			{
				"comment_id": 9,
				"body": "ZeroMods\nhttp://127.0.0.1:43110/1JjHyLeEDidHyyN33Y8f8cQKVEzWCEPnW7/",
				"added": 1474462685
			},
			{
				"comment_id": 10,
				"body": "LIMITACIONES en Zeronet\nNofish me ha confirmado el tema de cómo quitar las limitaciones : you can change the limits in data/users/content.json file. (you have to sign and publish this file after every changes)\n\nFácil de cambiar utilizando el programa Atom.\nAnímense a clonar webs y personalizarlas, este es el auténtico punto fuerte de Zeronet ¡Pero no olviden quitar las limitaciones \"de fábrica\" antes de publicar.",
				"added": 1474462725
			},
			{
				"comment_id": 11,
				"body": "FIJAR UN HILO. (Stickied)\nEjemplo queremos fijar este hilo:\nhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Topic:37_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/+Requests+Peticiones+Post+your+request+here+and+mind+to+give+as+much+info+as+will+be+helpful+to+find+it+title+edition+isbn+author+etc\n\nEn settings del content.json ponemos:\n\n\"topic_sticky_uris\": [\n\"37_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk\"\n]",
				"added": 1474462775
			},
			{
				"comment_id": 12,
				"body": "AÑADIR ENLACES en tu recuadro de Zerome. (Pinchas en el nombre y te lleva a una web)\nEjemplo:\n+(dejas un espacio)Nombre de la web entre corchetes(enlace link de web entre paréntesis)",
				"added": 1474462903
			},
			{
				"comment_id": 13,
				"body": "rapapobre ━ \n\nrecomiendo pasar por aqui, es una guia completa para lenguaje markdown\nhttps://exo.do/topic/10994/tutorial-editor-del-foro-markdown-para-dummies\npor ejemplo quieres meter una imagen? usa esto:\n![entre ambos corchetes no poner nada](direccion de la imagen estatica/animada url)\nseria asi: ![](url imagen) (entre el signo \"!\" y el primer corchete no hay espacios)\n\nañado que la dirección, al final debe contener la extension de la imagen, como .jpg,.gif, en tal caso no funciona; tampoco se puede garantizar su uso en todos los ambitos, puedo garantizar que si en 0blogs. suerte\nejemplo ![](http://torrentinvitez.com/customavatars/avatar393_13.gif)",
				"added": 1474462938
			},
			{
				"comment_id": 14,
				"body": "icf20 ━ el 7 de Septiembre 2016\nREPARAR FALLO CON kaffie.bit\n\nhay un fallo en la configuración del content-default.json\nhttp://127.0.0.1:43110/1HB8TWjS8dUzeKinv8UP5aN1ZyHd2KgP63/data-default/users/content-default.json\n\n{\n\"address\": \"1HB8TWjS8dUzeKinv8UP5aN1ZyHd2KgP63\",\n\"files\": {},\n\"ignore\": \".\",\n\"inner_path\": \"data/users/content.json\",\n\"modified\": 1473100953.826745,\n\"signs\": {\n\"1HB8TWjS8dUzeKinv8UP5aN1ZyHd2KgP63\": \"HNTPEsL8Rt6ci4Qu/7LauPYkd4ANvti6TnkSIOmv5af41AfAvuhydJJ/Bl/RFwwEz2X1AiCL8S2objZMlqj5IYM=\"\n},\n\"user_contents\": {\n\"cert_signers\": {\n\"kaffie.bit\": [ \"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\" ],\n\"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]\n},\n\"permission_rules\": {\n\".\": {\n\"files_allowed\": \".\",\n\"max_size\": 20000000\n},\n\"bitmsg/.@zeroid.bit\": { \"max_size\": 150000 }\n},\n\"permissions\": {\n\"bad@zeroid.bit\": false,\n\"nofish@zeroid.bit\": { \"max_size\": 20000000 }\n}\n}\n}\n\naqui el problema\n\n\"kaffie.bit\": [ \"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\" ], \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]\nesto permite a los usuarios registrarse con kaffie.bit pero\n}, \"bitmsg/.*@zeroid.bit\": { \"max_size\": 150000 } }, no pueden enviar ningún mensaje\nfix\n\nen data/users/content.json hay que añadir \"bitmsg/.*@kaffie.bit\": { \"max_size\": 150000 },",
				"added": 1474463059
			},
			{
				"comment_id": 15,
				"body": "Poner imágenes en tu web: \n Subir una imagen a http://imgur.com/  o https://ipfs.pics y copiar el Embed code \nEjemplo:\n<a target='_BLANK' href='https://ipfs.pics/QmeZCKurFZ8wBW88PpfTzSLdSZjob3dARh7ww5yiNY6Ccm'><img src='https://ipfs.pics/ipfs/QmeZCKurFZ8wBW88PpfTzSLdSZjob3dARh7ww5yiNY6Ccm'/></a>\n\nRecomiendo ipfs, imgur da un tamaño predefinido a las imágenes que no se puede cambiar.",
				"added": 1474468487
			},
			{
				"comment_id": 16,
				"body": "Zeronet and WebRTC - Browser support scorecard - Información streaming\n\nZeronet parece estar dirigiendo su rumbo hacia el streaming WebRTC, muchas de los nuevas webs o proyectos utilizan este sistema. En este link hay información sobre navegadores comparibles con WebRTC. Por último recordad que es una tecnología novedosa pero tiene el inconveniente de facilitar nuestra localización o IP.\nhttp://iswebrtcreadyyet.com/\n\nSuelen recomendar Firefox y a evitar Safari, pero yo de momento no he conseguido ver videos en Zerotube o similares probando incluso con varios navegadores, siempre aparece el mismo mensaje:\n\nThis browser is unsupported. Please use a browser with WebRTC support.\nConfig file is being used from user. (Ignore this)\n\n¿Alguien ha conseguido ver películas en streaming en Zeronet? y no me refiero ha descargarlas mediante un enlace magnet tradicional.",
				"added": 1474469124
			},
			{
				"comment_id": 17,
				"body": "Test de filtrado de IP mediante WebRTC - ¿Está tu dirección IP filtrándose?\nWebRTC es un nuevo protocolo de comunicación que se basa en JavaScript que puede filtrar tu dirección IP actual desde detrás de tu VPN.\n\nMientras que software como NoScript previene esto, es probablemente una buena idea bloquear este protocolo directamente, simplemente para estar a salvo.\n\n¿Cómo deshabilitar WebRTC en Firefox?\n\nDe manera resumida: pon \"media.peerconnection.enabled\" a \"false\" en \"about:config\".\n\nExplicado:\n\n    Escribe \"about:config\" en la barra de direcciones de Firefox y presiona Enter.\n    Presiona el botón \"¡Tendré cuidado, lo prometo!\"\n    Busca \"media.peerconnection.enabled\"   ¡Sin comillas!\n    Haz doble clic en la entrada, la columna \"Valor\" debería ser ahora \"false\"\n    Hecho. Vuelve a hacer de nuevo el test de WebRTC.\n\nSi quieres asegurarte de que cada ajuste relacionado con WebRTC está realmente deshabilitado cambia estos ajustes:\n\n    media.peerconnection.turn.disable = true\n    media.peerconnection.use_document_iceservers = false\n    media.peerconnection.video.enabled = false\n    media.peerconnection.identity.timeout = 1\n\nAhora puedes estar 100% seguro de que WebRTC está deshabilitado.\n\n¿Cómo solucionar el filtrado mediante WebRTC en Google Chrome?\n\nNo hay una solución conocida que funcione, sólo una extensión que puede ser facilmente burlada. Por favor en vez de eso utiliza Firefox.\n¿Qué hay de otros navegadores?\n\nChrome en iOS, Internet Explorer y Safari no implementan WebRTC aún. Pero recomendamos utilizar Firefox en todos los dispositivos.",
				"added": 1474469179
			},
			{
				"comment_id": 18,
				"body": "Kopy Kate - A decentralized YouTube alternative\n\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/",
				"added": 1474469233
			},
			{
				"comment_id": 19,
				"body": "CAMBIAR EL NOMBRE o diseño de tu web con Atom\nEjemplo:\n1. tienes que reemplazar C<br/>L<br/>O<br/>N<br/>E<br/>- <br/>M<br/>E  en index.html de tu web.\n\n<!-- Head -->\n\n<div class=\"head\">\n\n<a class='logo nolink' href=\"?Home\">C<br/>L<br/>O<br/>N<br/>E<br/>- <br/>M<br/>E</a>\n\n</div>APRENDE IDIOMAS CON LOS MEJORES CURSOS\n\n<!-- EOF Head -->\n\n    <br/>= nueva linea de texto en html\n\nControl+f te da la opción de buscar y reemplazar \nhttps://ipfs.pics/ipfs/QmYsxSLAxmgCykbQhRYb9gTyvMaZ3vm1x8YHqizcJKWXFC",
				"added": 1474469618
			},
			{
				"comment_id": 20,
				"body": "Mejor así:\n\n<!-- Head -->\n\n<div class=\"head\">\n\n<a class='logo nolink' href=\"?Home\">Z<br/>E<br/>R<br/>O<br/>- <br/>L<br/>A<br/>N<br/>G<br/>U<br/>A<br/>G<br/>E<br/>S</a>\n\n</div>\n\n<!-- EOF Head -->",
				"added": 1474469666
			},
			{
				"comment_id": 21,
				"body": "icf20 ━ el 6 de Septiembre 2016 \n\nNo he podido resistirme al web tu clone y he escrito un tutorial http://127.0.0.1:43110/1JfpEppAtZJZo3rVZQGjYDpkn2gcwGTJn/?Post:3:Modificar+el+clon+de+zerotorrents.bit",
				"added": 1474469940
			}
		],
		"2_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 3,
				"body": "Saludos a todos los hispanohablantes !  : )",
				"added": 1474416634
			}
		],
		"4_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 22,
				"body": "http://127.0.0.1:43110/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/?Profile/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/userzero@zeroid.bit",
				"added": 1474978534
			}
		],
		"5_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 23,
				"body": "Usuario: bitbit2\nPruebas: http://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y/ALguem+tiene+la+pedofilia+video+ou+link+de+zites\nPerfil de Zerome: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y/bitbit2@zeroid.bit",
				"added": 1474988398
			},
			{
				"comment_id": 24,
				"body": "Usuario:  gabriel1\nPruebas: http://127.0.0.1:43110/0list.bit/?Topic:1_1GUpiFeZrzjMZPwzAUWsVvF6vwiSZXeE2h/pornografia+infantil\nPerfil de Zerome:",
				"added": 1474997843
			}
		],
		"3_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 25,
				"body": "Por una web y comentarios en la extinta Kickass",
				"added": 1475604251
			}
		],
		"7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 26,
				"body": "Trisquel GNU/Linux no se actualiza desde 2014",
				"added": 1475612204
			},
			{
				"comment_id": 29,
				"body": "openSUSE Leap, elementary OS, Solus, Ubuntu MATE, Lubuntu, Snappy Ubuntu Core, Steam OS, Tails, Ubuntu Studio, Red Hat, Debian/CentOS, Arch Linux ARM,",
				"added": 1478477897
			},
			{
				"comment_id": 31,
				"body": "Linux Mint Mate es para iniciarse y en pcs de bajos recursos, Mint Cinnamon es para pcs más potentes y sencilla de utilizar pero yo prefiero Manjaro KDE (aunque tuve problemas con algún programa sus características más avanzadas compensan).\nUbuntu es de las más estandar pero no me acaba de gustar el escritorio Unity",
				"added": 1484563028
			}
		],
		"8_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 27,
				"body": "Mr. Robot, Better call saul, Game of thrones, Breaking Bag, The Wire, Prison Break,...",
				"added": 1475612377
			}
		],
		"10_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [],
		"13_17pnj2wEu5qFeRtQErmLVtCBvYuocGum82": [
			{
				"comment_id": 30,
				"body": "> [rapapobre](#comment_5_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): {\"Authorized for <b>...</b>\": \"Autorizado para <b>...</b>\",\n> \"Now you can directly interact with every site,<br> that accepts zeroid.bit users!\": \"Ahora se puede interactuar directamente con cada sitio, que acepta usuarios zeroid.bit!\",\n> \"This is a sample trusted authorization provider, that\": \"Este es un ejemplo de un proveedor autentificado fiable,\",\" allows you to interact sites without contacting the owner.\": \"Le permite interactuar con sitios sin contactar con el propietario\",\"Get auth cert »\": \"Obtener certificación\",\"Request auth cert\": \"Solicitud de certificación\",\"Username:\": \"Nombre de usuario\",\"zeronetuser\": \"Usuario ZeroNet\",\"To address:\": \"A la dirección:\",\"Send message:\": \"Enviar un mensaje:\",\"Enter username you want to register\": \"Introduzca el nombre de usuario que quiera para registrarse\",\"« use direct messaging\": \"« Utilice mensaje directo\",\"Send request\": \"Enviar solicitud\",\"or use BitMessage »\": \"o utiliza BitMessage »\"}\n\nMuchas gracias",
				"added": 1481990353
			}
		]
	},
	"comment_vote": {
		"10_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"9_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"8_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"3_1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs": 1
	}
}