{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1522433056,
			"title": "Some simple functions what can give much more bandwith and uptime in the ZeroNet system",
			"body": "1.Seed server option.\nA seed server (automatic download) function in low seeded files less than 5 seeder for more bandwidth and guarantee (files, sites) uptime would be useful in the cilent. Its would be useful if a file have less than 5 seeder.\n\nThe function looks like this:\n-ZeroNet users can operate a seed server with limited disk space.\n-The publishers can upload files and zites to this disk space.\n-The publisher or user can use the file or zite link to start it upload to the seed server.\n-Its look like this Publisher+seed servers->user\n-if the file copletly downloaded the leechers, or have more than 5 seeder are automatically deleted from the seed server,servers.\n-1 file can uploaded to 5 active seed server all user who have the current file,zite.\n\nIts would be useful zites like decentralised youtube,intergalactic file server,Zero Up,. Its just need use the file or zite link to start the upload to the seed server. With a similar function in the zeronet can grow more bigger services. Smaller users, with low resources can create and operate major pages.\n\nEspecially for larger files would be a guaranteed uptime and bandwith. The operation of the servers would be more efficient and cheaper.The TOR technology can protect the seed servers.\n\nAll the technologies in the zero system available to make such a function like this.No external technology integration is required in the software.\n\n2.option\n\nSome sites have only one seeder.When i try open a zite i think its will be ideal if i close the browser tab try contiune to download later the zite.Yet its only try to download when the browser was open and someone was online.\n\n3.option\n\nDefault download the whole file even if you close the browser tab.You can download the whole file in KopyKate,ZeroUp, with seed button.But defaultly its not download the whole file only just parts of them.If you test IFS (Intergalactic File Server) if you close the browser tab the download will contiune.Its have much more seeders than KopyKate or ZeroUp.\n\nWhat do you think?",
			"added": 1522433055
		},
		{
			"topic_id": 1545156874,
			"title": "Tracking back ZeroNet users with test downloads",
			"body": "Hi i fond a way which government can track back users behind a proxy or VPN,or Tor Always mode.The attack are simple.The attacker monitor the traffic in the user internet provider.Make test downloads.With low seeded files the attacker slowly get who seed large files.I made tests from 2 networks.Its clearly can track back with test downloads who share the files.If the attacker can monitor the user from the internet provider,its slowly get the real server who share the file.\n\nMaybe a extra protocoll where users can upload files to another users will be more secure? Without waiting for downloaders.Like Freenet,Safe network do it.With periodic uploads what can give a minimal guaranteed seed to the files.Keeping the same setup but adding to 0Net a extra shared hosting protocoll.\n\nThis can give more uptime the files.More protection for uploaders and website operators.",
			"added": 1545156872
		}
	],
	"topic_vote": {
		"1543487465_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": 1,
		"1564409306_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": 1,
		"1582191364_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1521473689_1CLQdyjUXGdhWumfS4c7vMA8TkjUhNHQkc": [
			{
				"comment_id": 1,
				"body": "The ZeroNet  system crashes itself.The problem was not in KopyKate!\n\nThe problem was in the ZeroNet system.Have the same problem with all large files.The problem was its only download the current file when the current page was open in the browser.When you close the browser the download will stop.The current time when you open you start the download no guarantee there was a seeder who have the file 100%.Users this way in larger files download only the part of the files.The resoult bigger files transmission are dead in the system.And smaller files goes fast unavaible.",
				"added": 1521499207
			}
		],
		"1521647700_1CLQdyjUXGdhWumfS4c7vMA8TkjUhNHQkc": [
			{
				"comment_id": 2,
				"body": "Zero net users are find each other.ZeroNet will  connect to others who are using TOR and who are not using TOR too.\nAdd this two lines to zeronet.conf if you use TOR.Just open with notepad.\n\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\n\nNow you can seed files tourgh TOR.\n\nSee more on: https://zeronet.readthedocs.io/en/latest/faq/\n\nThe problem is not that what you think.\n\nWhen the users close the current page the file download and peers searching are all stop.The ZeroNet large file transmission system are buggy and wrong.You can upload part of the large file.The Downloaders never finish the file if the file are too large.They only download parts of them.If the file are small you will lost loot of seeder and later its goes fast unavailable.Its not matter you use TOR or not.We must wait to the ZeroNet developpers to improve the file transfer protocoll.I use TOR Always mode but i can seed and share all files to al ZeroNet users.Have the same problem  all video streeming sites in ZeroNet.The system expects when you start streem a video or download a file someone must be online and have the file 100% the current time.And later when you close the page the program not contiune try to download the current file.This is causing the problems.",
				"added": 1521735597
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 3,
				"body": "First its need more programmers than users who fix the ZeroNet program isues.If you see zites like decentralised YouTube,ZeroTube,are appear but gone fast.Large file sharing are dead yet in the system.And then we did not talk about any other improvements.If a site developper want  a larger site.And its see its can not seed not working the Up/Download its will give up the project.If people are see its cheaper to use ZeroNet than buy a shared hosting service then people will come.If they see that important things do not work they will leve.Ideally all files and zites must be 24 non stop avaible to get a competitive clearnet alternative (without buying servers or run the compjuter non stop).The cost of smaller servers will not come back from advertising in clearnet.And here it comes the ZeroNet project what can fix this promlem too.People are need it,but the progress is too slow.There is not enough developer behind the program.",
				"added": 1521968567
			},
			{
				"comment_id": 5,
				"body": "> [korfa](#comment_3_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr): onlinemovies, nothing can be totally universal and ZeroNet is not an exclusion. Why are you so sure that large sites will be on ZeroNet or need to be? Clear-net is not going to disappear, it has his own purpose. ZeroNet may never be handy tool to be used for large size sites. I mean never, even after it is finished. Everything has its purpose. ZeroNet has its technical specifics, that determines its usage area. Does anybody think that ZeroNet's mission is to replace a clearnet? Doubtfully. There's no need for that. Its mission could be small size anonymous, decentralized, unregulated, uncensored site service. This is not bad fate for ZeroNet anyway. I deeply respect developers for their job, off course.\n\nI think lot of web services in ZeroNet will much better than clearnet.\n\nThe zeronet future in sites like KopyKate,Zero Up,quality modern forums (with video galery,picture upload,etc like in modern forums),modern sites with videos and files,.If people have a better alternative for payed shared hosting service.ZeroNet will grow fast.If you does not have a bigger website with lot of visitor it not possible to cover your server costs.Advertising companies are paying less and less and its not enough for a shared hosting service for most people.Easily cloned websites to protect people the next facebook,youtube dictatorship.Its easy to setup more bigger sites than youtube or facebook,see KopyKate.\n\nThe point was there when ZeroNet can say:come to us,No server cost,No dumy rules,Anonymity,You does not need 24h/day run a server,You can operate full fatured sites like in clearnet,working with home copjuter with low bandwidth.If a ZeroNet service make too much censor.Make another easy.And forget the costly shared hosting services.Operate your sites easy from your home compjuter.\n\nAnother thing the file storage.ZeroNet use blockchain technology.Its possible setup later a more badwith and coins for file storage system.To keep the system all sites 24h non stop avaible.If you give disk space you can store you can seed you sites freealy in another compjuters system.The next bicon was  in the bandwith and disc space.The money make more ZeroNet users and more bandwith and lower server costs,resources for site publishers.\n\nMuch of this things has already been accomplished.",
				"added": 1521990625
			}
		],
		"1521629532_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ": [
			{
				"comment_id": 4,
				"body": "Its a great idea to help file storage with seed servers.But these servers must run all ZeroNet users.But not that way to impossible to delete or edit the author their own files from the system like steemit or Dtube doo this.Wee need this in the future but not the send us loot of money and where store you files system.If you give us a storage you will get a storage system are better.Where you can store your site frealy if you store another people sites too.And you can get extra bandwith if you store another people zites and the zite larger files.",
				"added": 1521970483
			}
		],
		"1522423626_1EEHMnfx6WywteJWp3NqVXrJCm2GEBTkAt": [
			{
				"comment_id": 6,
				"body": "Its very nice, but we need a seed function for all users like this: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1522433056_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp",
				"added": 1522433505
			}
		],
		"1522433056_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": [
			{
				"comment_id": 7,
				"body": "If a zite  less popular,few people seldom download the page the page get easy inaccessible.Just like torrents.The difference torrent clients not stop try to download the data.I use lot of the torrent,the current file transfer system in ZeroNet works badly.Some torrent,you must wait for hours to find a seeder.In ZeroNet It's harder.The somebody must seed the zite in the current time setup are does not work long term.",
				"added": 1522628637
			}
		],
		"1532224996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "> [zeropyro](#comment_14_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): If nobody seed the video or a zite the download are not resume.Its failed IFS too.Does not help the +seed button in KopyKate or ZeroUp, if not have seeder the current time.Lot of files are dead in this zites.If you run a low visited zite the content.json download always faild because the zite download are not resume too.Low seeded zites are not correctly updated.If you not seed 24/7 your files or zite.And its not popular in the 0Net network,in this case becomes fast unavailable.The protocol is incomplete and have critical bugs.\n\nHave the same problem.:( I made a movie zite.All files are dead.I seed the files.If i not online when the user try download the video file, the download are not resume if my copjuter are  online.All file have 1 seeder,ME!!!...And users get only parts of the file.\n\nI have give up developing my site,the whole thing was waste of energy and time.\n\nSee:\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1531922152_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd\n\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:130#Comments\n",
				"added": 1532704309
			}
		],
		"1543487465_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 9,
				"body": "Half finished downloads make problems,for the seeders and downloaders too.We need a easy and user friendly download interface in the client. The biggest problem be with the streamable videos.There the data should be placed in the correct rows.Or the HTML5 player is unable to play while downloading. The users will start, but they do not finish downloading with the large files.",
				"added": 1543623608
			},
			{
				"comment_id": 10,
				"body": "Later in the future maybe we must integrate a good working extra safe distributed file share protocoll.Like MaidSafe,Freenet, that one what will works in the future the best.And a safe distributed censor resistence search egnie, like YaCy. Which can serch key words in html and .json files.Keeping online large files in 0Net are not easy. A good working integrated extra distributed file share system with the current protocoll will give in the future: more bandwidth,anonymity,censor+ trackback resistance files,zites,users,uptime,.Which is more difficult to shutdown. And the large files not so easy get offline.I mean a extra distributed file storage where the users can upload the files and another data.The important thing, we must integrate it from a good-functioning system.But keep the existing protocoll too.",
				"added": 1543624392
			},
			{
				"comment_id": 12,
				"body": "We have a platform which we can stream big more than 1GB full HD videos and movies with the browser HTML5 player.Unlike another video sharing services what convert the video to less good quality.I downloaded from TPB 1.6 GB movie torrent. Completing downloads not problem there.But until a download is completed,the video are can not be played.Except if you use special torrent client like UTorrent Web.We have the advantage:We use HTML 5 player,there is no need special program.We need a easy interface.Video and another files need to be completely downloaded.Because we need more seeder.And the users want get fast the files.If the files do not load,the users will going other working platforms.The problem with all video sharing services are the poor quality video files.They're convert too small all video files to be played in the browser.We have  solved this problem,and have this advantage opposite over similar softwares and platforms.",
				"added": 1544513810
			}
		],
		"1543914606_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": [
			{
				"comment_id": 11,
				"body": "Maybe integrating a extra existing forced shared content hosting technology like freenet or safe network maybe IPFS It would be better.Where users can upload each other without waiting for a downloader. This can protect the site owners identity from DPI.And reduce the costs.With larger files but in particular video files would be very useful.",
				"added": 1544329278
			}
		],
		"1545156874_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": [
			{
				"comment_id": 13,
				"body": "Integrating a existing but good working extra shared hosting protocoll It would be useful.This protocols are young in P2P but they are very useful. SAFE Network,I2P,Freenet they use similar protocols.I think IPFS use too a similar thing.We shold find the best developed method and integrate in ZeroNet It would be fixed many problems.ZeroNet have the best web platform with working forums and another social media platforms. With SAFE Network,I2P,Freenet, IPFS its not possible to setup a platform like ZeroTalk and etc social media platforms.We need a easy interface with easy settings.With low seeded zites,files periodic auto uploads to a shared system are solve many problems.Like censorship, back tracking,less server costs,more bandwidth,more shut down resitence zites and files,more uptime. A protocoll like this we can make 24/7 working zites and files,without 24/7 to you need run your node.Long therm this can give more health larger files and low seeded zites cheap and easy way.And much more protection for the users.",
				"added": 1545162984
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 14,
				"body": "We need a extra shared hosting protocoll like the safe Freenet.Where users can upload files to another users without waiting for downloaders.Automatically weekly or another individual period in the network.To a more popular hosting service we need this.\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1545156874_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp",
				"added": 1546508117
			}
		],
		"1564409306_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 15,
				"body": "For the next 5 years I see no chance.\n\nMaidSafe It's in the alpha stage. In Freenet large file sharing does not work correctly. A stable non-stop free full feature service, where the users can dowload everything with high download speed. Which hosting for everything frealy forewer. With a free anonymous decentralized DNS. Big masses would use it to host own services in the clearnet if it worked. But MaidSafe, IPFS, 0Net, Freenet, it is very far from it. And such a service does not currently exist.",
				"added": 1564544390
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 16,
				"body": "- OFFLINE OR NOT AVAIBLE DEAD CONTENTS: Users are crying that the clearnet everything is available but censored. And in 0Net too much thing are offline or not available.\n\n- SEARCH EGNIES CAN NOT FIND US: For a average website owner why interest to setup a site on a hidden network where few people find the content . Anyway z sites what index tourgh bridges the clearnet they look bad TIITLE, DSCRIPTION, SITE LINK in the serch resoults. If they find us they are not encouraging the users do download the software.\n\n-  OPTIONAL FILES ARE POORLY SEEDED: Who want to upload files to a network where the files are almost inaccessible.\n\n- PUBLISHERS MUST RUN THEIR MASHINE TO KEEP THEIR CONTENT 24/7 ONLINE: This is extra cost. Only popular contents are 24/7 online. If the user delete the 0net program example zites like ZeroUp the content goes offline forever. But the file link forever stays online. And the users get loot of dead links.\n\n-  USERS CRYING FROM ILLEGAL CONTENT AND DISK SPACE: To store the files this need disk space. To keep the content online without non-stop seed need more disk space. Mobile devides have limited disk pace. And if we want keep online the contents wee need more seeder than the users who download this contents. To solve this in a decentralized free way would be needed that the users store another users files what they are not visited.\n\n- INTERRUPTED DEVELOPMENTS: The bigger zites KopyKate, YouTube, ZeroUp, etc…, are not progressing. The are no business to progress them the developers. The other pages are very primitives. From web developers there is an initial enthusiasm, which disappears when they see the limitations and bugs of 0net.\n\n- THE SOFTWARE PROGRESS ARE TOO SLOW AND CENTRALIZED: If you search the clearnet the are FIrefox, Opera, Internet Explorer etc… what search the same independent network. If you download a torrent the are U Torrent, Vuze, Tribler etc… what doo the same thing. If one user does not like the current program, the user goes to the other what do the same thing in a better way. If you use TOR darknet services, IPFS, 0NET, Freenet they are different networks, protocolls that come together in all one hand. That's drastically reduct that other developers fix some this networks issues. So if an idea does not like the current developer that lands in the trash. So there is no fast independent development. The user get limited different programs which is not worth dealing with it.",
				"added": 1570952433
			},
			{
				"comment_id": 17,
				"body": "> [randomshits](#comment_208_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): This is something I never understood about some users of p2p technology who complain about the lack of seeded content... If the uploader is not willing to seed what they deem as valuable, why would they expect others to seed the equivalent of digital garbage? [...]\n\nTorrent clients downloading the full file and resume the download. 0Net download only file pieces default way, and not resume the download. And it doesn't work with optional files. On torrent files have seeders, ZeroNet optional files have not. If i upload 1GB file and the user download 50MB, so it will never be seeded. Keeping contents non-stop online are money and time. Visitors are few, and everyone wants everything right away. Without website and file owners the are does not have quality content. And without this no users. It's working with non optional files, but with optional files are not. This works for perfectly with torrent programs, in 0Net i’ts does not working because it is badly solved. As a website administrator i can say that it's not worth it. This way the system waste the owners resources. Add to that the content are not available on clearnet appropriately way. Lot of content doesn't appear the right way tourgh 0Net tourgh the browser like in clearnet servers, which is also extra work. And many average people can not solve it. If the 0Net program are not publisher and seeder friendly there will be no long term developed quality content either. It's one thing if visitors don't like something, but if the publishers have problems then there will be no quality content. I've been using this system for a long time as website owner. Success of torrent clients are the clearnet magnet links, similarly it should encourage users tourgh bridges from clearnet to download the program. And we should break it to the clearnet with this z sites. Because most users want something like this to run clearnet sites from his own machine free and easy way. Torrent programs are a great success, and many users download them. 0Net can follow this working as mentioned above (clearnet) method too.",
				"added": 1571072134
			}
		],
		"1571214527_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 18,
				"body": "I’ts can be changed if only those links listed what are currently seeded by the users. If have seeder i’ts showing. If not days later are gone the link, If have again seed i’ts goes back to the list automatic way. So users can download the file if later will be seeded. But files what are loong time are dead are not indexed or stored the link. Some P2P applications do this, and the are no dead links. Without collecting or hidding deleting some extra files! Something Like (Tribler, Emule) do it. Z sites like KopyKate or ZeroUp, 0list, ZeroSites List it would be useful to work like this. But this would require big changes in the program. ",
				"added": 1571242870
			}
		],
		"1573781265_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 19,
				"body": "Your files must be exit in the IFS/your user folder. I don't think it's possible to another user to delete your own files from your PC. The administrator can delete your files from his zite. But not your PC. If you are working a thing about 4 month, you does not make backups?\n\nIf the file are not available on your PC, then it is lost. IFS and ZeroNet are does not storing your files. Users store your files who download it. IFS only store your files links.\n\nMake backup from your user folder in the current zite where you upload something. They contain all files. And your data.json file in the users folder.",
				"added": 1573786563
			}
		],
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": [
			{
				"comment_id": 20,
				"body": "Make it:\n\n-Free\n-Decentralized\n-Easy To use\n-Censor resistence\n\nAnd make it possible to seed a file from a multiuser zite too, like from KopyKate a single video file. A site, using web interface  +plugin service would make sense. If the user seed some files (Example about 1GB). Another users seed his files too (About 1GB). Using a simple paste URL interface. And a delete button if the user does not want to seed the file any more. After the user checked what his seeding! Allow one button click to download the file. And make possible periodic auto uploads when the files goes offline. Using a auto keep alive system. And compatible with large files. Because large files are have much more less seed, than small non optional files.",
				"added": 1573788184
			},
			{
				"comment_id": 21,
				"body": "I'm seeding lot of large files. Very few people download large files. And not because the content is crappy. Users who download this files, does not keep them online.  A centralized 24/7  seed server in the meantime, it will help when i’ts running. But as it becomes inaccessible,  the downloaders who seed the file will be gone fast. Too much  the Hit And Run people. Those who do not seed back that they downloaded. And another downloaders are does not come in time to keep this files online. By the time the next downloader comes, with a good chance again he will be the umpteenth first downloader, from whom no one will download in the future anything.\n\n If the user not seed this point his own content, the files are goes offline forewer.\n\nWe are in ZeroNet, for paid services many  people do not want to tell you who they are. So not everyone can pay you with PayPal. Many people only can pay anonymous way with cryptocurrencies. And if you even ask for personal information, then you will have very few customers. Can be for someone enough for 1 week seeding. Small non optional files are seeded, these are the users keep online without the site owner. Just the file owner need to seed it non stop for a few days, until enough people are downloaded the zite. Then they are 24/7 online for unlimited time.\n\nIf we talk about a paid service, then there would be an opportunity to access these files tourgh clearnet. Minimum using a subdomain. Like: mysite.webhostingservice.com\n\nBecause if I pay for it, i'm expecting users in return. And on this closed network compared to the clearnet the users are few. And there it is to make money from it, which at least covers the costs. Which is difficult even on the clearnet. That's why it's simpler people does not run there popular services. And use  third party free services: Youtube, Ebay, Facebook, 3rd party blogging services, Thepiratebay, etc…\n\nFor someone here to pay for it, in the long run, he needs to profit from it. That i'm seeding a file, the are electricity bill, outside of the work what the user put in. If the 3rd party does not matter in clearnet, there are free lot of services for smaller things. Where there is no electricity bill and the content is accessible to everyone.\n\nIf someone pays for such a service currently here, they will be very few. You may not have currently any costumers on a monthly basis. Because who run sites here, they want a shared hosting service for free, easier way. They are enthusiastic amateur web developers. And they don't make any money on it.\n\t\n\n\n",
				"added": 1573874979
			}
		],
		"1582191364_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 22,
				"body": "Currently we have 2 option to resume the download. I use 0Net with TOR always mode without problems. I haven't had such a problem before. Except some buggy versions. The 0Net version what you use may be buggy now.\n\n1.\tIf the zite have +SEED button like ZeroUp you can use it. And if the current file have seed the file will be downloaded.\n\n2.\tUse „Help distribute added optional files” option in the Right menu. Setup how much big/file you want to download. And all files from the current zite will be downloaded.\n\nFrom browser request the file download are not resume. If you close the browser optional files download are not resumed. If the 1. or 2. option does not working, then there may be a bug in the current version of the program. Download managers does not work.",
				"added": 1582212890
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 23,
				"body": "Downloads are interrupted or files are completely inaccessible on IFS. Inconvenient for watching movies and series. The page does not even contain a +SEED button which would make downloads easier.",
				"added": 1591619486
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 24,
				"body": "Not a simulation, more of an artificial prison, with brainwashed slaves.\n\n[1947 Roswell ALIEN INTERVIEW](http://127.0.0.1:43110/1QHWVivimuFwWYFfhDXCm5r9oSfzTwx4eE)\n\nThe most realistic option. There is a lot of evidence to support what has been described. The best document that describes this theme. And more than Sci-Fi, or theory without evidence.\n\nSee: [The Boy Who Lived Before Documentary](https://www.youtube.com/watch?v=nhGX1YCsvAM), [Humanoides de Nazca/Episodio 1 - Momias de Nazca](https://www.youtube.com/watch?v=9bK3JHexjqQ), National Geographic Gospel of Judas (2006),  reports on aliens, reports of people who cloase to death, the anunnaki ancient writings and the elongated skulls as they are depicted, plus the [DNS tests the inca elongated  skulls](https://dailyoddsandends.wordpress.com/2015/05/09/initial-dna-analysis-of-paracas-elongated-skull-released-with-incredible-results/) / [whom people in different parts of the world regarded as gods](https://www.google.com/search?q=elongated+skull+mummy&tbm=isch&ved=2ahUKEwiRrY7Y1_TpAhUOrKQKHdzmB6IQ2-cCegQIABAA&oq=elongated+skull+mummy&gs_lcp=CgNpbWcQAzoCCAA6BAgAEB46BAgAEBM6CAgAEAgQHhATUN6hDFiMuwxglb4MaABwAHgAgAGMAYgBsAWSAQM2LjGYAQCgAQGqAQtnd3Mtd2l6LWltZw&sclient=img&ei=-nnfXpHIMo7YkgXczZ-QCg&bih=938&biw=1920&hl=en), the Van Allen belt which is suitable for holding souls on the planet. The way the brainwashing religions have spread and what their collectively say throughout history.\n\nI think malicious aliens are incarnated in the ranks of the richer strata. And since humanity has existed, they have controlled humanity. There is much evidence for this, however surprising it may sound. And people’s souls are being recycled continuous memory erasure, and in the cycle of rebirth, into an artificially manipulated human body.",
				"added": 1591620307
			}
		]
	},
	"comment_vote": {}
}