{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1576697039,
			"title": "Prgegnancy Festish Porn Communties?",
			"body": "Does anyone have links ethier on 0Net or TORNET?",
			"added": 1576697038
		}
	],
	"topic_vote": {
		"1581116791_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1576243302_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "This is not terrifying at all this is [REDACTED]",
				"added": 1576372275
			}
		],
		"1576294690_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 2,
				"body": "Someone who I can simply FEEL is right for me. I tend to be able to \"feel\" people. Not trying to say any of that \"magic\" stuff or anything but I can just tell when someone is right for me. I just have to happen to click with that person and then he rest goes from there.\n\nIn terms of physical features I tend to like girls with a bit of weight on them, large breasts, etc.",
				"added": 1576530566
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 3,
				"body": "I learned along time ago to drop materialistic thinking and everything. We are all human beings living on a strange rock hurtling through space. Money is a MEANS to an END and not the END itself. Money to me is just \"more options/convenience\" rather than a status.\n\nWe are all heading towards death with the grim reaper standing on our porch waiting to knock. We are all at the end of the day, stripped of everything the modern world had given us, the same species that needs to learn to work together more. The majority have lost their sense of morals and values.",
				"added": 1576696111
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 6,
				"body": "> [xane](#comment_7_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): No, but I have multiple links to the bible.\n\nWish I could find my way back to all of that, but I'm still depressed and suffering so...",
				"added": 1576706060
			},
			{
				"comment_id": 7,
				"body": "> [gggff](#comment_1_15D1u4mnaevkiMaJkf8YUXzCPP9pu9J9au): Kill yourself\nWell that really helps, thanks. I've given enough thought about this throughout this life. I am just along for the ride.",
				"added": 1576714322
			},
			{
				"comment_id": 9,
				"body": "> [reichardnixon](#comment_88_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): well this was an easy mute. Bye!\n\nI am really sorry...I did not intend to offend anyone or get myself muted. I am really new to Zeronet and truly sorry if I offended you...",
				"added": 1576806057
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1456_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Ignore them. They don't realize why the fetish exists. It's because pregnancy = fertility and fertility = attractive. [...]\n\nThanks for saying that. I really appreciate it. I never intend to bother anyone or to offend people. I am new to this Zeronet thing and I have some pretty serious shit going down in my life that has me in a major depression. I only recently lost my wife and I miss her more than I could ever say. Of course now I am extremely lonely without her companionship and I am not ready/am not sure I will ever be ready to move on with someone else in the bedroom....",
				"added": 1576806209
			},
			{
				"comment_id": 11,
				"body": "> [thetruth](#comment_20_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): Learn to write first, then bury yourself alive,...you are disgusting to humanity. No respect to the Mom who carried you.\n\nI didn't mean to offend anyone, honestly. I thought this Zeronet place would maybe be less judgmental and than the clearnet and maybe treat people with respect even if someone happens to not share the same views...I am sorry.",
				"added": 1576806307
			},
			{
				"comment_id": 12,
				"body": "> [fureimu](#comment_2_19arcncqV2m4KB7gxLqjDaHDiZ1TqnyAaj): i love pregnant women, so beautiful\n\nYes for sure! I miss my wife who I have recently lost and we had a child together and I wish she wasn't gone but I know she is why I developed this fetish. She was such a beautiful women and even more beautiful while pregnant...and just an amazing person overall.",
				"added": 1576806432
			},
			{
				"comment_id": 13,
				"body": "> [randomshits](#comment_323_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Thewhispering should start his own KopyKate clone that is centered around prego porn.Sometimes I think WTF, there is so much porn on the clearnet, but then I remember that in India and Iran, porn sites are blocked / censored.\n\nWhat is a KopyKate clone? I am new to Zeronet and don't know everything about it yet....",
				"added": 1576806470
			},
			{
				"comment_id": 14,
				"body": "> [randomshits](#comment_324_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): A clone of the KopyKate video sharing website that is found on Zeronet [...]\n\nWhen I tried to clone KopyKate I got an error of some kind:\n\n\"Internal error: FileNotFoundError: [Errno 2] No such file or directory:\"\n\nUPDATE: Nevermind it seemed to have cloned it now. I do not really know how to modify any of the website's source/html/css/etc. Must I just edit the files in my 0net directory?",
				"added": 1576807326
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_1464_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): A personal, static site without JavaScript.\n\nIs this something which I can clone and than modify for what I want? If so, thank you. Zeronet is a bit confusing and is alot to take in at first but I am really enjoying learning about all of this :)",
				"added": 1576808005
			},
			{
				"comment_id": 16,
				"body": "> [zaron](#comment_53_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): http://192.168.2.85:43110/1FCtRjQtyE4Es9XbS2WCzweyvnaehKfLG6/?tag:56\n\nHow would I go about setting up a forum software? Let's say that I wanted to install a Simple Machines Forum(SMF Platform) or any other forum package(Vbulletin,Zenforo,etd.) I am confused on how to create my own Zites using the software I am familiar with. I know where site files are locatred in the Zeronet file directories but no idea how to just drop those files in.\n\nI tried pasting wordpress files into the site directory after \"Create New Blank Page\" but idont understand haha..",
				"added": 1576812874
			},
			{
				"comment_id": 17,
				"body": "> [lianna](#comment_86_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): You can't use traditional server-client website software on ZeroNet. It simply won't work since zites don't use a single server. [...]\n\nOkay. I understand now that server-sided things such as PHP simply will not work. How can I edit the ZeroTalk or other cloned content? Do I have to go into the file directory and modify code by hand or is there a different way to do so without doing it all from scratch/by hand coding.",
				"added": 1576860233
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 8,
				"body": "Thank you for sharing this. It is very useful and appreciated. Have a good day. :)",
				"added": 1576805943
			}
		],
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 18,
				"body": "Merry Christmas to you. I wish that my holidays were going to be positive, but I am honestly going through a bunch of custody legal shit for my child who'll be born in 3 months. Hope the rest of you aren't struggling with such sad things.",
				"added": 1577216031
			}
		],
		"1577283326_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 19,
				"body": "Why is your Internet in Iran going to be shutting down again? Excuse me for not being well informed on international news.",
				"added": 1577285048
			}
		],
		"1611330261_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Why aren't you using F-Droid?\n\nI second the comment from this user. F-Droid is a wonderful FOSS app store! You should look into the Aurora Store App which can provide Play Store access by using an anonymous(or your own) account. I had to use that alternative when my old phone was no longer communicating with Google's Play Store servers...",
				"added": 1611338489
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 21,
				"body": "> [vambrace](#comment_2_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY): <quote>Please don't take more names. Backup your users.json.</quote> [...]\n\nI completly forgot about ZeroNet for the last few years. I was concerned that my user account had been lost...until I remembered that a backup of the entire directory was present on the external drive I use for backups. I am super happy to be back on ZeroNet!!!",
				"added": 1611338812
			},
			{
				"comment_id": 22,
				"body": "> [hardway](#comment_2_1EF86pXfsBpDKRBLfNWSLKTUofq6N8hyf5): Is there a way to remove your own content from ZeroMusic?I made a mistake in the name of the Album I uploaded and then I uploaded to the correct name.Now there are 2 copies of the music 1 with incorrect Album name.this could get messy if there is no way to control your own content and also take more space than necessary.Is there a Solution or is this system still too beta?\n\nDo you have a link to this ZeroMusic? I have just returned to this platform and cannot remember how to find Zites like I would on the regular internet.",
				"added": 1611338946
			}
		]
	},
	"comment_vote": {}
}