{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "#FREXIT",
			"body": "Qui est favorable à un Frexit ?\n\nPersonnellement, je le suis.\n\nFaites-moi part de vos réponses.\n\n##**Les raisons:**\n\n- [Qui gouverne la France et l'Europe ? - François ASSELINEAU](https://www.youtube.com/watch?list=PLKVgrNogVYWK41wLTn8MUD_UO6n1V64RC&v=bZZf703Ck3o)\n- [François Asselineau L'histoire de France CONFÉRENCE UPR](https://www.youtube.com/watch?v=ktuubyVVE_M)\n- [Les 12 impasses de la construction européenne](https://www.dailymotion.com/video/xgbp2b_les-12-impasses-de-la-construction-europeenne_news)\n- [10 raisons pour quitter l'Union européenne - François ASSELINEAU](https://www.youtube.com/watch?list=PLKVgrNogVYWKmDNwvuC6pq9AMyRYqZjZQ&v=Ch5Bfe5j29A)\n- [Faut-il avoir peur de sortir de l'euro ? Conférence de François Asselineau](https://www.youtube.com/watch?list=PLKVgrNogVYWLgit_zf_g4zkIt4qhufk5o&v=t6oQqHeYvvg)\n- [Pourquoi l'Europe est-elle comme elle est ?](https://www.dailymotion.com/video/xlyfvq_pourquoi-l-europe-est-elle-comme-elle-est_news)\n- [L'Europe, c'est la paie. Une conférence de François ASSELINEAU](https://www.youtube.com/watch?v=zP6_h5Y42ak)\n- [L'Europe sécuritaire - Une conférence de François ASSELINEAU](https://www.youtube.com/watch?v=r3Yh6ZpM_HY)\n- [La Tragédie de l'euro - Une conférence de François ASSELINEAU](https://www.youtube.com/watch?v=2Op3yVHH6dM)\n- [L'Europe, la mise en place d'une dictature - François Asselineau](https://www.youtube.com/watch?v=AJD8k-FPeRc)\n- [\"Mais où est passée la République Française\" - François ASSELINEAU](https://www.youtube.com/watch?list=UU7OMeUFuZMacpPk2fc9UlOA&v=-_DrMa7ZlIY)\n- [La tromperie universelle comme mode de gouvernement - François Asselineau](https://www.youtube.com/watch?list=PLKVgrNogVYWKhgMGayaIVxykNekppr_JX&v=1lNQ48e0FVc)\n- [François ASSELINEAU - LES ''EURO-RÉGIONS'': ALLONS-NOUS LAISSER DÉTRUIRE LES NATIONS ?](https://www.youtube.com/watch?list=PLKVgrNogVYWIAOTPmQjs2IKTeadJ3C8uT&v=bYZ-hsF3CSs)\n- [François ASSELINEAU: La construction européenne est-elle encore démocratique ?](https://www.youtube.com/watch?list=PLKVgrNogVYWIjmvmK0pkaqmgPSXBiG5GD&v=36y3dEfgvmo)\n- [Les partis politiques respectent-ils l'intelligence des français?](https://www.youtube.com/watch?list=PLKVgrNogVYWJo7MLyPOj5O3aJrRSG8c4C&v=0mdDFJS-gdE)\n- [L'EUROPE, C'EST LA GUERRE ! - Conférence de François ASSELINEAU](https://www.youtube.com/watch?v=zti4aV2WL5w)\n- [Sortir de l'euro : pourquoi et comment ? de Vincent Brousseau](https://www.youtube.com/watch?v=x5FCiHqwF6U)\n- [François Asselineau à Londres - Où va L'Europe?](https://www.youtube.com/watch?v=zJdhaf1Acyo)\n- [Le jour d'après : la sortie de l'Union européenne : fin du monde ou libération ?](https://www.youtube.com/watch?v=X4-MRtitpVE)\n- [François Asselineau: L'influence américaine dans les organisations internationales](https://www.youtube.com/watch?list=PLKVgrNogVYWKF0nx1UZ-ppO8qCDjCNr_Z&v=jQP9atCmpXs)\n- [Les illusions économiques de l'Union européenne - Conférence de Charles-Henri Gallois UPR](https://www.youtube.com/watch?v=W1GR1QWplUM)\n- [UPR - Vincent Brousseau - L'euro avant, pendant, après](https://www.youtube.com/watch?v=rSYuTiaia1s)\n- [L'euro est-il irrévocable ? - conférence de Vincent Brousseau](https://www.youtube.com/watch?v=KD95JLgqd64)\n- [Les euro-régions et l'objectif des redécoupages territoriaux en France](https://www.youtube.com/watch?v=3OzGE5Kjalk)\n- [Les origines cachées de la \"construction européenne\" par François Asselineau](https://www.youtube.com/watch?v=Qj5utZJm1dA)\n\n#**+**\n- [Le général de Gaulle sur l'intégration européenne](https://www.youtube.com/watch?v=WRXsQ96H144) **[BONUS]**",
			"added": 1486210165
		}
	],
	"topic_vote": {
		"1_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": 1,
		"1_17RJyBwfCuCAHTLwpirMuzvzN1zCe9845K": 1
	},
	"next_comment_id": 15,
	"comment": {
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 1,
				"body": "> [planespherev2](#comment_9_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Je savais pas que les français qui émigrent au Quebec étaient logés.\n> Au fait si tu es Québecois en principe tu as des origines françaises non? \n> En revanche l'Erythréen, le Soudanais, le Somalien ou l'Afghan qui débarque en france n'a pas forcément de racine ethnique, ni même culturelle ou religieuse, en commun avec le peuple français.\n\nEn revanche, l'Anglais, le Néerlandais, l'Allemand et le Français qui débarquent en Afrique du Sud n'a pas forcément de racine ethnique, ni même culturelle ou religieuse, en commun avec le peuple autochtone sud-Africain.\nÇa ne vous choque pas non plus ?!\nOn peut aussi parler des États-Unis, de l'Australie, de la Nouvelle-Zélande et de tout autre État né de la de l'invasion... je veux dire... de la colonisation  européenne, si vous voulez.\nEn ce qui concerne les SDF, j'ai bien conscience que certains d'entre eux \"dorment toujours dans la rue\" mais ayez aussi conscience que ce n'est absolument pas la faute des \"migrants\" qui, plus est, sont des réfugiés. Comprenez donc qu'ils ont besoin d'un endroit où ils peuvent au moins se sentir en sécurité en attendant que la situation de chacun de leurs pays d'origine revienne à la normale. Je reconnais encore que vos \"Français SDF dorment toujours dans la rue\" mais ils ne sont pas les seuls à vivre cette situation; il y a aussi les réfugiés parmi eux. Si vous vous plaignez de leurs sorts, ce n'est pas aux pauvres réfugiés que vous devez rendre des comptes mais à votre État et l’État, c'est vous et c'est moi. Bougez-vous le cul tout de même, si vous vous souciez tant d'eux. Franchement, ça ne sert vraiment à rien de vous plaindre si, au final, vous ne participez pas vous-même à des actions charitables d'associations collectives qui  leur sont dédiés. Des SDF, il en existe dans tous les pays du monde, même dans les soi-disants pays les plus pauvres de la planète, et, ce, depuis l'apparition de l'Homme. En soit, l'existence de SDF en France n'est pas un cas extra-ordinaire et particulier.\nBref; si je vous parles de cela, c'est tout simplement pour vous montrer à quel point votre raisonnement xénophobe ci-dessus est absurde et ne sert uniquement qu'à diviser pour mieux régner sur la conscience de vos lecteurs.\nPour autant, sachez que, selon moi, les \"vrais\" Français, les \"authentiques\", sont ceux qui sont fidèles aux valeurs universelles de la République française (\"Liberté, Égalité, Fraternité\") et des Droits de l'Homme et du Citoyen de 1789.\n\nCordialement, Alexandre.\n",
				"added": 1483286941
			},
			{
				"comment_id": 2,
				"body": "> [cochon](#comment_2_1N1vTWvdWB3wtZqBYMk24txHZYeJSz1bjm): Qu'ils crèvent tous ces enculés de migrants\n\nTa mère aussi !",
				"added": 1483367217
			}
		],
		"1_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 3,
				"body": "> [marc](#comment_10_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc): 100% pour un FREXIT.\n\nEt avec une sortie de l'OTAN ?",
				"added": 1486213075
			},
			{
				"comment_id": 4,
				"body": "> [dieu](#comment_1_1N9tAvwFBRBWBpYMtek2XzdW8JvyJdMRHu): Je suis favorable à un \"Frexit\" de l'UE et de l'OTAN.\n\nMoi de même.",
				"added": 1486213719
			},
			{
				"comment_id": 6,
				"body": "> [yvesrogne](#comment_16_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1): Barack Obama a été Prix Nobel de la Paix... Son Pays était engagé dans 7 guerres durant son mandat, pourtant...Alors oui il y'a urgence de sortir de toutes ces alliances qui nous empêche de faire ce que l'on veut...\n\nSans vouloir prendre sa défense, peux-tu me dire précisément dans quelles guerres Barack Obama a-t-il engagé son pays ? Je veux que tu m'en fasses une liste.",
				"added": 1486571700
			},
			{
				"comment_id": 11,
				"body": "Je vous suggère de commencer par la dernière vidéo qui vous est proposée dans la liste ci-dessus, c'est-à-dire celle sur les origines cachées de la \"construction européenne\".",
				"added": 1486921713
			},
			{
				"comment_id": 12,
				"body": "Sachez aussi que je mets à jour ce post régulièrement à partir de maintenant.",
				"added": 1486972151
			},
			{
				"comment_id": 13,
				"body": "Sachez également que je prends en compte vos messages avec des œuvres - quelqu'en soient leur nature - qu'ils - vos messages - proposent sur le sujet, mais aussi des faits lui concernant.",
				"added": 1486972793
			}
		],
		"1_1N9tAvwFBRBWBpYMtek2XzdW8JvyJdMRHu": [
			{
				"comment_id": 5,
				"body": "Selon moi, il est un peu fiable. Si je pense qu'il l'est un peu, c'est parce qu'il contient certains articles, dont ceux à propos des extra-terrestres, qui me paraissent parfois dérisoires.",
				"added": 1486216460
			},
			{
				"comment_id": 8,
				"body": "> [lolman2323](#comment_1_1ANMqHnEZHwPmbSUj4yKWMpLaDxcY5JhZS): http://www.alexa.com/siteinfo/egaliteetreconciliation.fr\n\nJe connais ce site web.",
				"added": 1486573235
			}
		],
		"9_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 7,
				"body": "Merci pour le lien ! C'est vraiment sympa de ta part !",
				"added": 1486572492
			},
			{
				"comment_id": 10,
				"body": "\n\n> [rambotito](#comment_3_1KrJgpJqJij8zdhJ4gFZg7gscskgtCgNmX): Dans un style différent: nirsoft.net\n\nMerci pour ce lien ! Son site web à l'air vraiment intéressant et il propose des logiciels exclusifs à télécharger. C'est une pépite !",
				"added": 1486666613
			}
		],
		"3_1oMXqv6LN67F2aFKqm6hyBY3G2kt1SnEu": [
			{
				"comment_id": 9,
				"body": "0git - git repositories hosted on ZeroNet: http://127.0.0.1:43110/0git.bit/",
				"added": 1486663529
			},
			{
				"comment_id": 14,
				"body": "> [sickgamer2](#comment_1_1LExHAGduhvTgxYjDCJT6rMYi2zAuuWDju): merci 4lexandredejav git clone ne marche pas sur zeronet :/\n\nEn réalité, il marche. Pour le faire marcher, télécharge [Git](https://git-scm.com/) et installe-le.",
				"added": 1487694582
			}
		]
	},
	"comment_vote": {
		"10_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc": 1,
		"1_1N9tAvwFBRBWBpYMtek2XzdW8JvyJdMRHu": 1,
		"3_1KrJgpJqJij8zdhJ4gFZg7gscskgtCgNmX": 1,
		"1_1LExHAGduhvTgxYjDCJT6rMYi2zAuuWDju": 1,
		"1_1ELqWR9VHttv1e5es9e5H5gRnpiqUZ6h5k": 1,
		"6_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"1_1Jz8s58P2G7aJ2vKVxn8r9JkakQz6ayXwo": 1,
		"10_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"11_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"12_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"1_1HcPSuDPs7L5wAAkBpzjt5QTvZfBxMKSoe": 1
	}
}