{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1629612098,
			"title": "[UPDATED TEXT] Two law changes that protect you from an evil sibling",
			"body": "See text: http://127.0.0.1:43110/1AQYTzBE3u1gzRXhMx2N2jCSPUNYoBucYd/?Post:12:Two+law+changes+that+protect+you+from+an+evil+sibling\n",
			"added": 1629612097
		},
		{
			"topic_id": 1630872750,
			"title": "A messenger that doesn't reveal user IP address",
			"body": "\nI was thinking of a decentralized messenger which every message is either broadcast to:\n1. whole network\nor\n2. if it consumes lots of traffic, only region or group of peers the recipient of message declare located there. \n\nThis way, IP address of two party of conversation is not revealed to each other\nFor reducing meta-data usability for surveillance, message's sender's username can be encrypted inside message\nI live in a country that I know for activists hiding IP address is more important from other things and unfortunately, Tor and VPN doesn't provide enough assurance.\nMessengers like Tox are great for communication by persons you trust, but not strangers.\n",
			"added": 1630872748
		},
		{
			"topic_id": 1632250393,
			"title": "Decentralized Bootstrapping [updated review]",
			"body": "###  1- Using blockchain\nNot mentioned in below article, but I think PoS blockchain can not fight split-view attack, but in PoW blockchain, the client can put a time limit on miners hashing answers to find out if it is connected to a powerful international-scale blockchain \nor \nIf the number of victims are high, their participation in mining pool make attack expensive, because the pool server also should participate in the attack and send fake block headers to these pool miners, but still have to reward them for their useless calculations\nbut I'm not an expert\nhttps://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/blc2.12001\n###  2- Using Certificate transparency method\nThis method is not decentralized but to some degree detects split-view attacks \nNote: Chromium already implemented version 1 of it. But I think Version 2 is only effective which the browser request \"consistency proof\" (although not as effective as blockchain)\n#### Space usage reduction in method 2:\nI don't think ZeroNet trackers would need to keep old versions of IP list. Probably only root of Merkle tree of old data would be enough (but again I'm not expert)\n\n\n.\n.\n.\n\n\n**-----------------------------------------signature----------------------------------------------**\n[law change that protect you from an evil sibling](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/14nAB5NywyhuWp8J2HUy83gLwUFqd9rbZh/1632247261)",
			"added": 1632250390
		}
	],
	"topic_vote": {
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"1630441344_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1592067672_1QBa3qVPi84otXt5PzBgRu9VyqXZ3Hz68Y": 1,
		"1634477265_15PEof54VQE7mki8G8hYa5FgkCgpYgetSg": 1,
		"1634478504_15PEof54VQE7mki8G8hYa5FgkCgpYgetSg": 1,
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> [xcape2net](#comment_961_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I guess most of you know this, but for other peoples' benefit, if you own a zite, in order to accept comments from users who have registered using alternate ID systems, you have to add something like this into the data/users/content.json file for your site: [...]\n\nDidn't have any effect. You can check yourself:\nhttp://127.0.0.1:43110/1AQYTzBE3u1gzRXhMx2N2jCSPUNYoBucYd",
				"added": 1630877226
			},
			{
				"comment_id": 3,
				"body": "When I try to comment using kaffie id or cryptoid on my blog, \"Content publish failed\" happens. \nblog:\nhttp://127.0.0.1:43110/1AQYTzBE3u1gzRXhMx2N2jCSPUNYoBucYd/",
				"added": 1631193938
			}
		],
		"1630872750_14nAB5NywyhuWp8J2HUy83gLwUFqd9rbZh": [
			{
				"comment_id": 2,
				"body": "The advantage of above system maybe is that peers consume half traffic to participate in anonymity. comparing to acting as proxy node\nThe problem with Tor is that ordinary users doesn't participate as relay, automatically",
				"added": 1630924648
			}
		],
		"1632250393_14nAB5NywyhuWp8J2HUy83gLwUFqd9rbZh": [
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_1557_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di)\nSorry, by international-scale network I meant international-scale blockchain (with strong (fast) hashing power e.g. Ethereum)\n\n> Using Certificate transparency method. I would appreciate it if you elaborated on how it helps bootstrapping at all.\nbootloader would have to keep an append-only log of peers info (to implement log transparency similar to google certificate transparency). But as I mentioned above for disk space usage optimization probably only keeping root of Merkle tree of old versions of log would be enough\n\nBut probably blockchain method is best and without problem. These methods  can stop bootloader to redirect some users to specific network of peers so it can reduce chance of \"content split-world attack\"\n\n**content split-world attack:**\nFor example, China government make a deal with the trackers to route Chinese users to peers it controls and show them a version of ZeroTalk that is approved by government ~~(with help of ZeroTalk key owner of course. He would sign an internation version of Zerotalk and another version acceptable by other regions).~~",
				"added": 1632306669
			}
		],
		"1628958951_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 7,
				"body": "> [zeroseed6e](#comment_24_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj): I created the proxy in that way to dont allow illegal content. This Is a preview of you want the full network use the client and contribute\n\nCan you tell me how can I do what you did",
				"added": 1633993544
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 8,
				"body": "> [smashbuckler](#comment_106_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): There is a changelog https://github.com/zeronet-enhanced/ZeroNet/blob/massive-rework/ZNE-ChangeLog/ChangeLog-0.8.0.md\n\nI'm using up to date ZME too but version that it shows is 0.7.2\nhttps://imgur.com/s8o7EV3.png\n\n```\n$ git status\nOn branch massive-rework\nYour branch is up to date with 'origin/massive-rework'\n```\n```\n$ git show\ncommit 545fe9442c9354fa2604bdfaf38f5182205955cc (HEAD -> massive-rework, origin/massive-rework, origin/HEAD)\nMerge: 5c8bbe58 454c0b2e\nAuthor: Vadim Ushakov <igeekless@gmail.com>\nDate:   Sat Nov 6 22:39:47 2021 +0700\n...\n\n```",
				"added": 1636768316
			}
		]
	},
	"comment_vote": {
		"19_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"27_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1,
		"1099_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1188_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"28_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"2_18h6k82NxKncT7LcbeLwdazStJBufWe4om": 1,
		"3_18h6k82NxKncT7LcbeLwdazStJBufWe4om": 1
	}
}