{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1599727900,
			"title": "Lottery Winning Approach, Powerball, Lotto America, Lucky for Life, Lotto Max …",
			"body": "[Lottery Winning Approach, Powerball, Lotto America, Lucky for Life, Lotto Max … ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:1_1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ/Lottery+Winning+Approach+Powerball+Lotto+America+Lucky+for+Life+Lotto+Max)\n\n... \n\nWith the flooding of Coronavirus, many industries encounter extreme difficulties.  The lottery industry still seems to keep some vitality at unusual stage of history.  \n**Those data may be helpful for some people who are sensitive to digits and numbers. **",
			"added": 1599727899
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1599727900_1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ": [
			{
				"comment_id": 1,
				"body": "https://www.youtube.com/watch?v=NHM85AFXz1w \nhttps://www.youtube.com/watch?v=EcnmFYonZx4 \nSome Youtube videos have no content, just using the keywords Lottery Winning, and it attracts large volume of visitors. \nSo by posting some substantial in-depth analysis on Lottery Digits composition, it’d help attract more people to use Zeronet. \n\nThose data are processed by an associate David, who often uses Regular Expression on EditPlus software, plus Excel Visual Basic programming to process large volume of social events data.  One day, he suddenly found that the huge volume of Lottery Digits combinations can be processed by similar approaches.  \nThese approaches though don’t guarantee Jackpot prediction, they can indeed help reduce the errors.  \n\nBy computer-aided analysis of data, sensitivity to digits will be enhanced, then many digit combinations with disharmony against the rhythm of digit composition can be filtered, thus reduce the errors.",
				"added": 1599727990
			},
			{
				"comment_id": 2,
				"body": "The file can be downloaded via Zero Up Unlimited \nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/ \nSee if it can be downloaded smoothly ?",
				"added": 1599728080
			},
			{
				"comment_id": 3,
				"body": "The peers may increase a little later. \nAnother file is launched, with the latest Sep. 09th draw included. \nLottery Winning Approach Powerball 200909.pdf \nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ/Lottery%20Winning%20Approach%20Powerball%20200909.pdf \nThis one can be used more conveniently, either for analysis by yourself, or promotion of the decentralized web of Zeronet.",
				"added": 1599730583
			},
			{
				"comment_id": 4,
				"body": "> [morocco](#comment_2_1K58h2FWDHY6khgbecX1UqFXh2vgGkMKXq): Zeroup showing 0 peer\n\nSome errors are modified with the column \"Sum of One's Digit\". \nAnother version, update 2 will be better ... \nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ/Lottery%20Winning%20Approach%20Powerball%20200909%20Update%202.pdf",
				"added": 1599737842
			},
			{
				"comment_id": 5,
				"body": "Certainly, that is a right mentality. Not to play, means no errors, no risks, and no losses. \nNo error, no risk or no loss is itself a good way of life for some people. \nYet there’re always quite many people who like to take the risks. \nThat’s why a simple Youtube video without significant content can attract millions of visitors. \nSo those data-analysis approaches may be helpful for some people, at least for them to reduce errors.  \n\nIn fact, some netizens use those unconventional approaches to enhance their sensitivity on numbers.  They may win some small prizes occasionally.  To win the jackpot seems to be of very minuscule odds of chance. If bigger prizes such as second prize are won by someone using the special approaches, the event will itself be a good thing to spread the influence of the decentralized network of Zeronet. \n\nIf one wants to play, the best philosophy is to play as little as possible, and learn to observe the unlimited infinity of changing combinations as much as possible.  \n\nThe data-handling work is also taken as an exercise of the Regular Expression formulas and other computer skills.",
				"added": 1599797168
			},
			{
				"comment_id": 6,
				"body": "See if the file can be downloaded smoothly? \nhttp://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1599830393_1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ/One+Digit+Analysis+of+Powerball+20200909",
				"added": 1599830788
			},
			{
				"comment_id": 7,
				"body": "The other site (File Upload site 1), maybe just due to a peculiar post related to some tools against GFW, then suddenly some unexpected problems were encountered …   \n\nhttp://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1599885321_1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ/One+digit+Analysis+of+Powerball+20200909+site+2",
				"added": 1599885623
			}
		],
		"1601040429_19nTQKAAjFsrxYPBUEN1ykkAfh2KbRG8PJ": [
			{
				"comment_id": 8,
				"body": "Do you mean that you need someone to help you do the communication in Chinese?  \nIt's related to serious topics like religion freedom, or just funny topics?",
				"added": 1601197474
			}
		]
	},
	"comment_vote": {}
}