{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 33,
	"comment": {
		"4_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 1,
				"body": "Manipulating America - The Chinese Communist Playbook (Manipulando a América O Manual Comunista Chinês) (LEGENDADO pt-BR)\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593499107_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1593501791
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "The Silence Of The Lambs (O Silêncio dos Inocentes) 1991 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593556832_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: A agente do FBI, Clarice Starling (Jodie Foster) é ordenada a encontrar um assassino que arranca a pele de suas vítimas. Para entender como ele pensa, ela procura o perigoso psicopata, Hannibal Lecter (Anthony Hopkins), encarcerado sob a acusação de canibalismo.",
				"added": 1593557429
			},
			{
				"comment_id": 3,
				"body": "20 - 007 - O Mundo Não E o Bastante 1999 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593762831_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: James Bond deve proteger Elektra King, filha de um magnata do petróleo que foi brutalmente assassinado. O agente secreto é encarregado de manter Elektra longe do lunático terrorista Renard, que deseja assumir o controle do petróleo de todo o mundo.",
				"added": 1593763144
			},
			{
				"comment_id": 4,
				"body": "Um Crime de Mestre 2007 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593802331_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Willy Beachum é um promotor que nunca perdeu um caso e está prestes a deixar seu emprego por um melhor, até que seu chefe lhe entrega um caso de assassinato. Ted Crawford tentou matar sua esposa com um tiro na cabeça e está sendo seu próprio defensor no julgamento. Agora Beachum precisa provar que Ted é um assassino frio e calculista.",
				"added": 1593802721
			},
			{
				"comment_id": 5,
				"body": "Dirty Harry 1971 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1561882599_17t9TDGPax5zh4H5DPnnLUJq6BmkUYU7oe\n\nSinopse: O policial Harry Callahan tenta rastrear um assassino psicopata num terraço antes que uma garota sequestrada morra. Quando o encontra, Harry abusa do direito civil do assassino, o que o coloca de volta nas ruas. Um ônibus escolar é sequestrado e Harry sai à busca do assassino novamente e a única maneira de pará-lo é a sangue frio.",
				"added": 1593847240
			},
			{
				"comment_id": 6,
				"body": "Star Trek 2009 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1562582427_17t9TDGPax5zh4H5DPnnLUJq6BmkUYU7oe\n\nSinopse: James Tiberious Kirk (Chris Pine) é um jovem rebelde inconformado com a morte de seu pai. Certo dia, recebe convite para fazer parte da formação de novos cadetes para a Frota Estelar. Uma vez lá conhece Spock (Zachary Quinto), um vulcano que optou por deixar seu planeta porque é metade humano e discordava do preconceito. Durante o treinamento, e também na primeira missão, os dois vivenciam novas experiências provocadas por seus estilos diametralmente opostos. Assim, Spock, o cerebral, e Kirk, o passional, viverão uma grande aventura ao lado de outros tradicionais integrantes da tripulação da U.S.S. Enterprise, a mais avançada nave espacial da época.",
				"added": 1593852844
			},
			{
				"comment_id": 8,
				"body": "Um Principe em Nova York 1988 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593950061_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Akeem (Eddie Murphy), príncipe herdeiro de Zamunda, África, se rebela contra o casamento arranjando por seu pai, o rei Jaffe Joffer (James Earl Jones), que concorda que o filho viaje por 40 dias. Assim Akeem vai para Nova York, se passando por um pobre estudante para encontrar uma noiva que não o ame por sua posição. Vai trabalhar em uma lanchonete e sente-se atraído por Lisa (Shari Hadley), a filha do seu patrão, Cleo McDowell (John Amos), que é interesseiro e atrapalha o romance, pois quer um bom partido para a filha, sem imaginar quem é na verdade seu funcionário. Akeem viajou com Semmi (Arsenio Hall), seu melhor amigo, que não gosta de se passar por pobre e faz gastos e toma atitudes que podem revelar a identidade de Akeem.",
				"added": 1593950213
			},
			{
				"comment_id": 12,
				"body": "Sherlock Holmes 2009 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594024689_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: O excêntrico detetive consultor Sherlock Holmes e o doutor John Watson lutam para derrubar um novo inimigo e desvendar um plano mortal que poderia destruir a Inglaterra.",
				"added": 1594025041
			},
			{
				"comment_id": 14,
				"body": "21 - 007 - Um Novo Dia Para Morrer 2002 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594107779_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Após se libertar de uma prisão na Coreia do Norte, James Bond entra em ação para perseguir o maligno Gustav Graves, que está desenvolvendo uma arma de alta tecnologia capaz de colocar o mundo em risco.",
				"added": 1594108028
			},
			{
				"comment_id": 15,
				"body": "Duro de Matar 3 A Vingança 1995 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594121347_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: O policial John McClane (Bruce Willis) está separado há um ano de sua mulher, anda bebendo demais e também está afastado da polícia. Mas, como desgraça pouca é bobagem, o irmão (Jeremy Irons) de um antigo inimigo começa a colocar bombas em lugares movimentados de Nova York e dá ao policial uma série de enigmas, que podem evitar as explosões. Na tentativa de resolvê-los, ele começa acidentalmente a ser ajudado por um negro (Samuel L. Jackson) do Harlem, que o ajuda a desvendar toda a trama.",
				"added": 1594121760
			},
			{
				"comment_id": 16,
				"body": "Duro de Matar 4 2007 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594177304_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Os Estados Unidos sofrem um novo ataque terrorista, desta vez através da informática. Um hacker consegue invadir a infra-estrutura computadorizada que controla as comunicações, transporte e energia do país, ameaçando causar um gigantesco blecaute. O autor do ataque planejou todos os passos envolvidos, mas não contava que John McClane (Bruce Willis), um policial da velha guarda, fosse chamado para confrontá-lo.",
				"added": 1594177430
			},
			{
				"comment_id": 20,
				"body": "O Vingador do Futuro (Total Recall) 1990 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594202771_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Douglas Quaid (Arnold Schwarzenegger) é um construtor e tem pesadelos recorrentes envolvendo uma viagem a Marte. Ele vai até a Rekall Inc., uma empresa que realiza implantes de memória que dão a sensação aos clientes de terem um final de semana dos sonhos. A intenção de Douglas é que seja implantada a memória de uma viagem a Marte, mas durante o processo algo sai errado. Ele perde a memória e passa a ser perseguido por assassinos, entre eles sua esposa Lori (Sharon Stone). Desorientado, Douglas descobre que, na verdade, chama-se Hauser e que é um agente da inteligência marciana. Em busca de respostas, ele viaja para Marte.",
				"added": 1594202871
			},
			{
				"comment_id": 21,
				"body": "Spaceballs - SOS Tem Um Louco Solto No Espaço 1987 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594306308_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Os diabólicos líderes do planeta Spaceball, tendo desperdiçado infantilmente sua preciosa atmosfera, arquitetaram um plano secreto para tomar cada sopro de ar do seu vizinho, o pacífico planeta Druidia. Assim o ditador de Spaceball, o presidente Skroob (Mel Brooks), manda o cruel Dark Helmet (Rick Moranis) sequestrar Vespa (Daphne Zuniga), a princesa de Druidia, e exigir do Rei Roland (Dick Van Patten), o pai dela, que libere todo o ar. Lone Starr (Bill Pullman) e Barfolemew (John Candy) recebem de Roland o pedido de resgatá-la, sendo que Star exige um milhão de dólares espaciais pelo resgate, pois é quanto deve para um agiota intergaláctico.",
				"added": 1594306485
			},
			{
				"comment_id": 22,
				"body": "The Thing (A Coisa) 2011 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594489981_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: A paleontóloga Kate Lloyd (Mary Elizabeth Winstead) viaja para uma região remota e gelada para ajudar na investigação de uma possível nova forma de vida após cientistas noruegueses encontrarem uma nave espacial e um ser misterioso dentro de uma pedra de gelo. Mas o que parecia estar morto há muito tempo está, na verdade, prestes a acordar e agora todos os envolvidos na descoberta correm risco de morrer, dando início a uma verdadeira corrida pela vida, já que o alienígena ganha a forma de suas vítimas com extrema facilidade.",
				"added": 1594490132
			},
			{
				"comment_id": 23,
				"body": "Um Dia a Casa Cai 1986 Redublagem - DoubleSound\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594510651_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Após ser despejado de seu apartamento em Manhattan, um jovem casal compra a casa dos sonhos, apenas para descobrir que seu sonho transformou-se no pior dos pesadelos. Richard Benjamin dirige este divertido filme em que o desafortunado casal luta para manter-se unido enquanto a casa cai e a conta do banco afunda.",
				"added": 1594511038
			},
			{
				"comment_id": 24,
				"body": "Rocky 2 II A Revanche 1979 Dublagem Clássica - Herbert Richers\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594615246_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Após o término do confronto contra Apollo Creed (Carl Weathers), Rocky (Sylvester Stallone) promete à Adrian (Talia Shire), sua esposa grávida, que irá largar os ringues de boxe. Porém, Apollo quer provar que Rocky não foi nocauteado por acaso e, como este está sem dinheiro, promovem outra luta entre os dois pugilistas.",
				"added": 1594615576
			},
			{
				"comment_id": 26,
				"body": "Edward Mãos de Tesoura 1990 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594687293_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Peg Boggs (Dianne Wiest) é uma vendedora da Avon que acidentalmente descobre Edward (Johnny Depp), jovem que mora sozinho em um castelo no topo de uma montanha, criado por um inventor (Vincent Price) que morreu antes de dar mãos ao estranho ser, que possui apenas enormes lâminas no lugar delas. Isto o impede de poder se aproximar dos humanos, a não ser para criar revolucionários cortes de cabelos, mas ele dá vazão à sua solidão interior ao podar a vegetação em forma de figuras ou esculpir lindas imagens no gelo. No entanto, Edward é vítima da sua inocência e, se é amado por uns, é perseguido e usado por outros.",
				"added": 1594688683
			},
			{
				"comment_id": 29,
				"body": "Mulher Nota 1000 1985 Dublagem Clássica - BKS\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594916442_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Gary Wallace e Wyatt Donnelly são dois adolescentes nada populares com o sexo oposto. Eles resolvem criar no computador de Wyatt a mulher que eles acreditam ser a ideal. Uma tempestade dá vida a ela, que é “batizada” como Lisa, que é sexy, bonita, determinada, desejada por todos, fiel aos seus criadores, mas com um modo de ser que deixa todos que cruzam o seu caminho desconcertados. Entretanto, problemas começam a ocorrer quando o implicante Chet, o irmão mais velho de Wyatt, sente que algo está estranho.",
				"added": 1594916759
			},
			{
				"comment_id": 30,
				"body": "Piratas Do Caribe 1 - A Maldição do Pérola Negra 2003 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594993794_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Em pleno século XVII, o pirata Jack Sparrow (Johnny Depp) tem seu navio saqueado e roubado pelo capitão Barbossa (Geoffrey Rush) e sua tripulação. Com o navio de Sparrow, Barbossa invade e saqueia a cidade de Port Royal, levando consigo Elizabeth Swann (Keira Knightley), a filha do governador (Jonathan Pryce). Decidido a recuperar sua embarcação, Sparrow recebe a ajuda de Will Turner (Orlando Bloom), um grande amigo de Elizabeth que parte em seu encalço. Porém, o que ambos não sabem é que o Pérola Negra, navio de Barbossa, foi atingido por uma terrível maldição que faz com que eles naveguem eternamente pelos oceanos e se transformem em esqueletos à noite.",
				"added": 1594994130
			},
			{
				"comment_id": 31,
				"body": "Piratas do Caribe 2 - O Baú da Morte 2006 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1595130006_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\nSinopse: Elizabeth Swann (Keira Knightley), a filha do governador Weatherby (Jonathan Pryce), está prestes a se casar com o ferreiro Will Turner (Orlando Bloom). Porém o evento é atrapalhado pela ameaça de Davy Jones (Bill Nighy), o capitão do assombrado navio Flying Dutchman, que tem uma dívida de sangue com o capitão Jack Sparrow (Johnny Depp), amigo do casal. Temendo ser amaldiçoado a uma vida após a morte como escravo de Jones, Sparrow precisa encontrar o misterioso baú da morte para escapar da ameaça.",
				"added": 1595130285
			},
			{
				"comment_id": 32,
				"body": "Piratas Do Caribe 3 - No Fim Do Mundo 2007 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1595213980_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr\n\n\nSinopse: O lorde Cuttler Beckett (Tom Hollander), da Companhia das Índias Orientais, detém o comando do navio-fantasma Flying Dutchman. O navio, agora sob o comando do almirante James Norrington (Jack Davenport), tem por missão vagar pelos sete mares em busca de piratas e matá-los sem piedade. Na intenção de deter Beckett, Will Turner (Orlando Bloom), Elizabeth Swann (Keira Knightley) e o capitão Barbossa (Geoffrey Rush) precisam reunir os Nove Lordes da Corte da Irmandade. Porém falta um dos Lordes, o capitão Jack Sparrow (Johnny Depp). O trio parte para Cingapura, na intenção de conseguir o mapa que os conduzirá ao fim do mundo, o que possibilitará que Jack seja resgatado. Porém para conseguir o mapa eles precisarão enfrentar um pirata chinês, o capitão Sao Feng (Chow Yun-Fat).",
				"added": 1595214403
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 7,
				"body": "Naruto Classico 64 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593938960_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1593939043
			},
			{
				"comment_id": 9,
				"body": "Naruto Classico 65 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594003166_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594003223
			},
			{
				"comment_id": 10,
				"body": "Dragon Ball Z - Episodio 104 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594005503_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594006247
			},
			{
				"comment_id": 11,
				"body": "Futurama S01E08 - O Mal do Século XX Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594012786_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594012856
			},
			{
				"comment_id": 13,
				"body": "Dragon Ball Z - Episodio 105 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594104792_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594104846
			},
			{
				"comment_id": 17,
				"body": "Dragon Ball Z - Episodio 107 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594192356_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594192417
			},
			{
				"comment_id": 18,
				"body": "Dragon Ball Z - Episodio 108 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594193035_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594193252
			},
			{
				"comment_id": 19,
				"body": "Futurama S01E09 - O Inferno dos Robôs Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594198554_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594198666
			},
			{
				"comment_id": 25,
				"body": "Futurama S02E01 - O Titanic do Espaço Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594639463_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594639522
			},
			{
				"comment_id": 27,
				"body": "Dragon Ball Z - Episodio 109 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594745554_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594745625
			},
			{
				"comment_id": 28,
				"body": "Futurama S02E02 - O Macaco Gênio Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1594872361_1Ag8t2iQx8Na1htctcfG8JTQeJznGEaPqr",
				"added": 1594872648
			}
		]
	},
	"comment_vote": {}
}