{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "hey bigler, la merde honaire de je ne sais quoi",
			"body": "toi et tes potes, on va tous vous buter...\n\nenfin moi pas\n\nje pense que c est foutu la france\n\ntrashed...\n\nouais... \n\net donc tu vas te faire buter et tous tes sales descandants\n\npour moi\n\nvous etes vraiment des sous merdes\n\nde la racaille.\n\net ce sera au lance flame :).",
			"added": 1618386376
		}
	],
	"topic_vote": {},
	"next_comment_id": 44,
	"comment": {
		"3_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 1,
				"body": "personnellement, et par un grand act de clemence, je tuerais seulement le juge (et pas sa famille cette fois)...\n\nJe pense que c'est tres important dans la liberation mentale, de tuer du juge.\n\noui\n\ntres\n\ntres\n\nimportant\n\ncette petite elite, doit mourrir, doit payer, pour leur crimes contre nous...\n\net seulement la mort pourra les calmer ces chiens (d'infidels, for the lulz)\n\nd aileurs tout les connards qui ont prononcé un jugement contre l utiliation d'une plante\n\n20 de gulag... ou la mort... suivant le rendement du goolag system (faut que cela soit rentable)....\n\nla pitié c'est de la merde pour les faibles, les esclaves, les soumis, comme d'ornellas...\n\nelle aussi elle va faire du gulag...\n\n30 ans.\n\nca lui fera du bien... pour reflechir a sa guerre contre les plantes...\n\nmais bon je m en fous :)\n\nca me fait plus rire que m enerver tellement c'est pathetique...\n\ntellement minable\n\nfaible\n\nfemininzé\n\na chier quoi.",
				"added": 1618391640
			},
			{
				"comment_id": 2,
				"body": "une petite perso : qui va payer pour toutes ces conneries (je veux dire la dette) et bien deja les juges, les hommes politiques tout ce qu'ils ont...\n\npar contre arnaud and co, ceux qui produisent des choses que les gens veulent... cai mes potos... ahahha\n\nalors le pd celui qui comprend rien, il meurt,... oui betrand rouselle...\n\ntu crois quoi?\n\nt'es ou?\n\non sera plus violent\n\nc'est tout\n\nc'est comme ca que ca marche\n\net le moindre mot , de toi ou de ton clan, c'est la mort\n\ntu veux me censurer\n\nmoi je veux te buter (si j'avais le pvr, donc totalement legalement, je te rassure, j'adore le formalisme des executions des enemies internes... je trouve trop cool, de savoir qu'une merde, va etre recycler...).\n\nehehhehe.",
				"added": 1618391788
			},
			{
				"comment_id": 7,
				"body": "ehu, quand/si une centrale nucleaire pete, c'est quoi le plan? c'est bien joli de dire co2 co2, pour promouvoir cette industrie de destruction, mais le plan le dedans?\n\nahh et les souris chimere humaine... si c'est pas le bon vecteur pour un joli cross over (ou saut d'espece)... mais bon ca de la monnaie a une petite start down... ",
				"added": 1618431449
			},
			{
				"comment_id": 8,
				"body": "\"L'humanitarianisme c'est du protestantisme devenu fou\" je crois que c'est zemmour qui disait ca en opposition a fukuyamha.\n\nje pense plutot que c'est le chemin neuroplastique qui apres etude scientifique a été choisi pour leurer les americains et ensuite cammoufler les ambition planetaires d'une minorité feodaliste aristocratique cleptocratique violeuses d'enfants qui controlent actuellement le gouverement federal americain.\n\nc'est un bon plan, mais comme tout plan, il se confronte a la realité... ",
				"added": 1618483703
			},
			{
				"comment_id": 9,
				"body": "si les gens avaient mangés plus d'ail, de combien le nombre de mort serait plus bas? ahh oui c'est une reference a la petite merde de euronews... ",
				"added": 1618484339
			},
			{
				"comment_id": 10,
				"body": "typiquement le genre de metro sexuel idiotic eduqué petite merde qui me fait chier.",
				"added": 1618484365
			},
			{
				"comment_id": 11,
				"body": "saraha halimi...\n\ndonc le plan :\n\nc'est de dire que la drogue ca rend inconsient (faux)\n\nensuite de renvoyer le tout devant l'EU...\n\ndonc le petit plan est superbement simple...\n\net pathetique...\n\nfaut vraiement etre con\n\nmais j ai regardé que 30 sec...",
				"added": 1618485221
			},
			{
				"comment_id": 12,
				"body": "mais je pense que c'est la logique :\n\ndrogue  = bad\n\neu = good\n\ndonc pour casser le move, faut buter... moi j'en suis convaincu.",
				"added": 1618485254
			},
			{
				"comment_id": 13,
				"body": "mais cette sahara halimi c'est seule au bord de la riviere?",
				"added": 1618485270
			},
			{
				"comment_id": 14,
				"body": "ah... alors pas du tout c'est une mémé...",
				"added": 1618485325
			},
			{
				"comment_id": 15,
				"body": "\"En décembre 2019, la cour d'appel de Paris conclut à l'irresponsabilité pénale de Kobili Traoré, auteur des faits, décision confirmée par la Cour de Cassation le 14 avril 2021. \"\n\ntellement du bullshit...\n\nfaut meme pas se faire chier avec ces gens, on bute le juge, ces enfants, sa femme et sa mere, et on bouge sur kobili, ensuite on fait une petite manif de soutient a kobili, et la on trouve les meneurs qu'on executent... facile :).",
				"added": 1618485399
			},
			{
				"comment_id": 16,
				"body": "vous nous prenez tellement pour des cons, je vous rassure vos executions seront milimetrés... un travail comme vous n'aurez jamais vus :).",
				"added": 1618485912
			},
			{
				"comment_id": 17,
				"body": "decimé la justice francaise, le mieux c'est les bulletins d'executions avec des fote d'ortograf ! ca va etre drole... (t en fait pas y aura des qr code et une petite photo, pas d' erreur...) au milimetre :).",
				"added": 1618486033
			},
			{
				"comment_id": 18,
				"body": "syr, j'ai pas ni plume ni encre pour ecrire le nom du roy... pas de souci mon bon, on le fera avec son sang et ...\nbon avoncons votre majeté, il l'hore...",
				"added": 1618486220
			},
			{
				"comment_id": 19,
				"body": "ce ki est cool avec la justice francaise c'est qu il y a pas besoin de leur laisser du temps pour leur dernieres prières, bande de kuffars (humanistes).",
				"added": 1618486293
			},
			{
				"comment_id": 20,
				"body": "la question n'est pas de savoir si la justice francaise est trop clemente...\n\nca revient encore a zemour avec du booster :)\n\ndans le sens que c'est un conflit entre une approche humaniste...\nvs une approche dite conservatitrice\n\ndans le sens que pour les humanistes, il n y a pas d'humain. c'est les circonstances, le cadre, l'experience etc qui font l individu, c'est a dire qu'il est formatable et n'a pas de volonté propre... tjrs une excuses (afin de soutenir, la reinsertion, ne pas exposer les rapefugees et autre terrosregufees etc). genre le grand n'importe quoi du vivre ensemble, multi kulti, on divise sur le woke pour fister dans l'economie\n\ncontre une justice dite conservative :\n\nla meme = morte\nle tueur = vivant\nle tueur est PROUVE d'avoir tué la meme\nune raison? la meme pouvait etre la pote a ghislaine maxwell = non, c'est juste un meutre d'opportunité.\nokay cool\n\nle mec est libre, il a CHOISIT de buter la meme, la meme est morte, le tueur doit MOURRIR\n\nc'est pas un accident (apparement, j'ai pas lu)\n\ndonc on bute le tueur de la mémé\nles mémés sont en securité\nles tueurs ont peurs\ntout va bien...\n\nou alors on rentre dans le petit jeu, mais y a de la weed (l'alcohol o moins il s'en souvient pas), etc etc... les excuses, pour la \"finesse\", resultat : c'est la merde pour tout le monde, sauf ceux qui vivent en gated communities jusqu'au moment ou leurs murs aussi tombent...\n\ndonc voila faut choisir\n\nsoit l'homme est libre et doté d'une volonté\nsoit c'est un biopiped programmable et programmé sans volonté, une sorte de caillou biologique\ndans l'ideal humaniste on est tous des caillous sur pate, qui n'aspirent a rien, qui ne sont rien, mais ce qu'en font nos maitres feodaux... et donc idealement des gentils serviable serfs batissant la grande europe pour un future radieux (après avoir combatu la russie, la chine, l'islam et le reste du monde pour finalement imposer le monde humaniste universelle)...\n\na un moment faut revenir sur terre, et arreter de defendre sa corporation... \n\nqui est mort : la meme\nqui a tué : le mec\nle mec est vivant et doit payer = mort.\nfin de l'histoire, suivant.\n\n",
				"added": 1618490098
			},
			{
				"comment_id": 21,
				"body": "comme on en est la , faut aussi buter ceux qui font chier dnas le sens que le meurtre de la meme c'est antisemite, mais rien a foutre.\n\nla meme elle pouvait etre polonaise, juive (israelienne) ou francaise ca change rien\n\non a une mémé morte\net un tueur pas mort\nca va pas !\n\nen plus je parie que la mémé elle le connaissait meme pas... jamais vus ce gars...",
				"added": 1618490386
			},
			{
				"comment_id": 22,
				"body": "cette complexification ca donne quoi? polanski pas mort ! encore une fois... tjrs les meme histoires... relou.",
				"added": 1618490426
			},
			{
				"comment_id": 23,
				"body": "vous connaissez pas mon grand concept de l'upkeep penitenciaire? c'est a dire le cout de maintenance de ceux qui devraient etre mort plutot que couter?\n\nfo apprendre a lire l'anglisky.",
				"added": 1618490484
			},
			{
				"comment_id": 24,
				"body": "Kobili Traoré c'est pas le gars victime de maltraitrance policièere? faut que j'arrete de zapper si vite, j y comprend plus rien :)\n\nje voulais dire, y a rien de mal a buter en meme temps polanski et Kobili Traoré... d'une balle 2 tete... ca me rappelle un certain jesus cette histoire :).",
				"added": 1618490586
			},
			{
				"comment_id": 25,
				"body": "ce qui me fait marrer c'est qu o fond zemour il explique des concept clairs en terme francisé :) c'est rigolo :).",
				"added": 1618490675
			},
			{
				"comment_id": 26,
				"body": "apres faut pas etre devin pour imagine la surpopulation carcerale... mais bon un moment les 15 gars qui violent la fille de 16 ans devans chez elle, qui ensuite se suicide, bin faut aussi les buter... et si papa mamans sont pas content, suivant... \n\nau debut y a beaucoup puis ca se calme naturellement... le darwinism...\n\noui oui oui, le supremacism du marché, ca brasse :) ahahah.\n\ncirculez braves gens...",
				"added": 1618490800
			},
			{
				"comment_id": 27,
				"body": "faut vraiment etre con pour faire des lois pareilles, ou habillement mal intentionés... \"habillement\" c'est pour etre poli, a quel point c'est biden... lol...\n\nvous avez pas le niveau intellectuellement, vous avez certainement trop de morale a la place :D. ahahahah.",
				"added": 1618490894
			},
			{
				"comment_id": 28,
				"body": "plutot vous comprenez bien, vous essayer de nous niker avec votre fausse morale, mais comme je defens :\n\nshoot first, ask question later, I DON'T CARE ! you are dead.",
				"added": 1618490930
			},
			{
				"comment_id": 29,
				"body": "oouuuuhhh le mauvais bisounours ! la brebis galeuse... t as geule futile serf, hmmm.. ca ne va pas confusion possible, manant ! c'est trop marrant un bisounours en colere... \n\necoutes coco, ici c'est le pays des raptors... (velociraptors) on essaye de chopper un bout du diplodocus avec le trex l'ait tout bouffé... alors on se tait et son prepare... ca va etre intense...\n\nmais pourquoi demande le bisounours vegan?\n\nouais ouais, silence. avec un mouvement de griffe clair... on t'egorge si tu tais pas.\n\nahhh, et le bisounours enleve son masque...\n\nbon...\n\ncomme tjrs ca fait pas peur o velocirator, ca se mange aussi ce qu'il y avait dessous, mais c'est trop petit, et la le trex il va finir par faire une erreur... focus\n\napres t as le bisounours demasqué qui essaye d'encule un des velocirators, bah le trex il va capté qu'il y de l 'action dans le sous bois :Dhahhahaha...\n\net ensuite tout les bisounours ils vont se faire chasser... et pas que par les velociraptors, il y aussi des petites lezards affamés... ils sont peut etre plus petit, ca n emepeche pas que ce repas de trex nous ait passé sous le né... \n\nil est temps de se trouver des moutons, il y aura peut etre un bon chien de berger bien juteux a se mettre sous la dent pas loin...\n\nbonjour devant les montons... bonjours repondirent les moutons... vous venez nous manger? non, on cherche le chien, il est la bas... tout content d'aider :D\n\n",
				"added": 1618491301
			},
			{
				"comment_id": 30,
				"body": "le plus triste en france c'est qu'il y ameme pas la nasa pour sauver les meubles, au moins y a de la victuaille,,, avant que ca pete la cenrale nuclaire... brillant avenir...mais bon quand on decide de se battre contre le co2... ca fait penser a don quichote...",
				"added": 1618491557
			},
			{
				"comment_id": 31,
				"body": "au fond tout est dit avec meme la cathedrale qui a brulée... \n\nle constat est clair ,mais ca pourrait etre pire bien pire...\n\nje me demande quand vous rendrez vous?",
				"added": 1618491644
			}
		],
		"1_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2": [
			{
				"comment_id": 3,
				"body": "impressionnant, j'en apprends tout le temps : la ligne maginot n'est jamais tombé !!! gloire !",
				"added": 1618420695
			}
		],
		"1_1BHthkG1YWrmDVQgT5Gn1v6ifSpZTT1Rxh": [
			{
				"comment_id": 4,
				"body": "lol, le gars il a gerer un mega deficit pour transferer a ces potes... un... c'est donc ca la gauche caviar... bravo laurent... tu pars sur l'echaffaud ! eheheheh.",
				"added": 1618421416
			},
			{
				"comment_id": 5,
				"body": "et apres on jouera au polo avec ta tete.",
				"added": 1618421437
			},
			{
				"comment_id": 6,
				"body": "quoi c'est vachement social le polo ! ",
				"added": 1618421469
			}
		],
		"1_1GJNLqVkyGjMCFmX7gWFauG7YLn6KdHQ9S": [
			{
				"comment_id": 32,
				"body": "je pense que franchement en tant que policiers (volailes, bleues, racailles en uniformes, comme vous voulez) faut vraiement que vous arretiez de faire les cons avec ces extrais de plantes... ca vaut pas la peine,.. un jour on va legalizer le tout et vous comme des cons vous serez au cimtiere ou pire, pas mort, mais devant la tombe de vos enfants...\n\narretez... le circe... on va rien lacher... c'est le market fundamentalisme... un client , un vendeur, deux volonté. un prix. trade matched... next... on avance... \n\non a pas vaux mode de penser... on est libre... frachement reflechissez... j'ai fait un gros effort d essayer de m'exprimer dans votre langue... mais a quoi bon?\n\nsi vous devez mourir pour comprendre ou apprendre, qu'il en soit ainsi.\n\nc'est la vie.",
				"added": 1618495534
			},
			{
				"comment_id": 33,
				"body": "une fois la tete, avant l'obeissance... svp... c'est pour vous... ",
				"added": 1618495555
			},
			{
				"comment_id": 34,
				"body": "pour les plus matheux : \n\nvos vies < le marché.\n\naccept or die.",
				"added": 1618495656
			},
			{
				"comment_id": 35,
				"body": "et pour nous la source de revenus dans vos morts, sont les nouvelles formations , equippement des bleues, les contrats d'assurance vie etc... rien de nouveau... movin on... \n\nc'est brutal,,, on est pas la pour casser des oeufs.",
				"added": 1618495710
			},
			{
				"comment_id": 36,
				"body": "et oubliez pas vous bosser pas pour la justice, mais pour bouffer... nous on sait, vous faites semblant...\n\nlis la quote du dessus c'est pas de moi\n\net pour les cons, si tu le veux en arabe bah va demander au saoudiens, eux au moins, ils pourront te le dire dans quasiement la langue originelle...\n\nvoila...\n\nalors tu te plies, tu fais ce qu'il faut qu'on avance, pour qu'un jour les non pedos americains et autres puissent dire qu'ils ont passé de super en vacance en france, et pas que c'est un pays de merde, justement.",
				"added": 1618495828
			},
			{
				"comment_id": 37,
				"body": "finis les jeux politiques. fini. game over wp gg.",
				"added": 1618495842
			},
			{
				"comment_id": 38,
				"body": "et la encore c'est tout doux, juste des petites photos. apres t'as des tetes, celle des enfants du commissaire, dans un sac poubelle devant la porte de la gendarmerie... ",
				"added": 1618495985
			},
			{
				"comment_id": 39,
				"body": "alors comment tu vas etre plus dur que ca? ensuite, tu vas essayer, tu vas rentrer chez toi, et y aura ta femme et tes enfants, clouer aux murs, ventre ouvert... je te dis pas l'odeur... on va vous detruire, comme vous le faite pour nous... c'est genre une guerre... la guerre des plantes de la creation.",
				"added": 1618496052
			},
			{
				"comment_id": 40,
				"body": "tu donnes tu recois\ntu prends tu perds.",
				"added": 1618496097
			},
			{
				"comment_id": 41,
				"body": "joue?",
				"added": 1618496104
			},
			{
				"comment_id": 42,
				"body": "on a la genese avec nous... tu veux quoi de plus? ton uniforme? ta casquette? gonfles le torse, il se vidra, comme les intestins de ta femme et de tes enfants... tu plies... tu capitules... surender. fin. on avance...",
				"added": 1618496175
			},
			{
				"comment_id": 43,
				"body": "ou tu joues... c'est ouvert\non croit en la liberté :).",
				"added": 1618496190
			}
		]
	},
	"comment_vote": {}
}