{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1
	},
	"next_comment_id": 8,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "#Criptografia perfeita de sigilo através da mistura de ondas caóticas em chips de silício irreversíveis com variação de tempo\n\n\"Proteger dados confidenciais é um grande desafio mundial. A criptografia clássica é rápida e escalável, mas é quebrada por algoritmos quânticos. A criptografia quântica é inclonável, mas requer instalações quânticas que são mais caras, mais lentas e menos escaláveis do que as redes ópticas clássicas. Aqui mostramos uma criptografia de sigilo perfeito em canais ópticos clássicos. O sistema explora pacotes de ondas caóticos correlacionados, que são misturados em chips de silício compatíveis com CMOS baratos e CMOS. Os chips podem gerar 0,1 Tbit de chaves diferentes para cada mm de comprimento do canal de entrada, e exigem a transmissão de uma quantidade de dados que podem ser tão pequenos quanto 1/1000 do comprimento da mensagem. Discutimos a segurança deste protocolo para um invasor com poder tecnológico ilimitado, e quem pode acessar o sistema que copia qualquer parte, incluindo os chips. A segunda lei da termodinâmica e a sensibilidade exponencial do caos protegem incondicionalmente este esquema contra qualquer possível ataque.\"\n\n- https://ipfs.infura.io/ipfs/QmP82nz3PZEGsRouZZQCEsdGfvySttPVtPQthXT1LQrYaL",
				"added": 1577132198
			},
			{
				"comment_id": 2,
				"body": "#[A lei de Kerckhoffs](https://web.archive.org/web/20190630013602/https://cic.unb.br/~rezende/trabs/kerckhoffs.html)\n\nO que tem sido chamado de [lei ou principio de Kerckhoffs](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Kerckhoffs'_principle.html) tem origem num conjunto de condições que [August Kerckhoffs](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Auguste_Kerckhoffs.html), engenheiro holandes radicado na França, formulou como desejáveis à criptografia militar, no século XIX. Ou, mais especificamente, em critérios que duas dessas condições fazem presumir como desejáveis para criptografia no domínio militar. Essas duas condições foram apresentadas como parte de uma lista de seis (que Kerckhoffs chama de \"princípios\"), formulada em um [artigo publicado em duas partes](https://gateway.pinata.cloud/ipfs/QmfDxqbqYtnvJPkqq6L5TwyAPVQWNgKWtfe88xuzofbUrg), nas edições de janeiro e fevereiro de 1883 da revista Journal des Sciences Militaires.",
				"added": 1577133418
			},
			{
				"comment_id": 3,
				"body": "#One-time pad\nOne-time pad, em português cifra de uso único ou chave de uso único, é uma técnica de criptografia que não pode ser quebrada se utilizada corretamente. Consiste num algoritmo em que o purotexto é combinado, caractere por caractere, a uma chave secreta aleatória que para isso deve ter, no mínimo, o mesmo número de caracteres do purotexto. Para garantir que a criptografia seja imperscrutável, a chave só deve ser usada uma única vez, sendo imediatamente destruída após o uso.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/One-time_pad.html",
				"added": 1577134459
			},
			{
				"comment_id": 6,
				"body": "#browserPGP\nUm site que torna o uso do PGP simples e seguro. Todo o trabalho é feito do lado do cliente, por isso nenhum dado privado deixa o seu computador.\n\nSe você quiser ser extra seguro, desativar internet e ir incógnito ao usar este site.\n\n- https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa\n- https://github.com/browserPGP/browserPGP.github.io.git",
				"added": 1577149818
			},
			{
				"comment_id": 7,
				"body": "> [sourtans](#comment_6_1FVqToSsoE3a78RXNEqiyFy2Rbq9va2GVC): browserPGP\n> Um site que torna o uso do PGP simples e seguro. Todo o trabalho é feito do lado do cliente, por isso nenhum dado privado deixa o seu computador.\n> Se você quiser ser extra seguro, desativar internet e ir incógnito ao usar este site.\n> \n> https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa\n> https://github.com/browserPGP/browserPGP.github.io.git\n\n#Há alguns problemas na programação do site. Pretendo consertá-los depois.\n\n- About: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa\n- Key Generator: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/gen.html\n- Encrypt: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/encrypt.html\n- Decrypt: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/decrypt.html\n- Sign: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/sign.html\n- Verify: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/verify.html\n- Compatibility: https://gateway.pinata.cloud/ipfs/QmRe4tTgUjZuvFAum54zMaE9gizqQJBjBpWGB7KqSGQhTa/compatibility.html",
				"added": 1577151025
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 4,
				"body": "#Realidade simulada\n\nRealidade simulada é a proposição de que a realidade poderia ser simulada – talvez por modelagem computacional – a uma qualidade indistinguível da realidade \"verdadeira\". Ela poderia conter mentes conscientes que poderiam ou não saber que estão vivendo dentro de uma simulação. Na sua forma mais intensa, a \"hipótese da simulação\" ou \"simulismo\" alega que é provável que estejamos vivendo tal simulação.\n\n- https://gateway.pinata.cloud/ipfs/QmNY1tQNAWDKawBMVyFgPVCk7bHZSWNCP3Fq5jwxdLeMow",
				"added": 1577143324
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#TRANSCENDENCE - A REVOLUÇÃO\n\nO dr. Will Caster (Johnny Depp) é o mais famoso pesquisador sobre inteligência artificial da atualidade. No momento ele está trabalhando na construção de uma máquina consciente que conjuga informações sobre todo tipo de conteúdo com a grande variedade de emoções humanas. O fato de se envolver sempre em projetos controversos fez com que Caster ganhasse notoriedade, mas ao mesmo tempo o tornou o inimigo número 1 dos extermistas que são contra o avanço da tecnologia - e por isso mesmo tentam detê-lo a todo custo. Só que um dia, após uma tentativa de assassinato, Caster convence sua esposa Evelyn (Rebecca Hall) e seu melhor amigo Max Waters (Paul Bettany) a testar seu novo invento nele mesmo. Só que a grande questão não é se eles podem fazer isto, mas se eles devem dar este passo.\n\n- https://view.axel.org/item/2d711a8d7e21d802",
				"added": 1577143642
			}
		]
	},
	"comment_vote": {
		"5_1FVqToSsoE3a78RXNEqiyFy2Rbq9va2GVC": 1,
		"6_1FVqToSsoE3a78RXNEqiyFy2Rbq9va2GVC": 1,
		"7_1FVqToSsoE3a78RXNEqiyFy2Rbq9va2GVC": 1
	}
}