{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1534680944,
			"title": "Tiananmen square",
			"body": "I'd like to find some more info about Tiananmen massacre, where can I find more material than wikipedia has? Let's say we're some hunters from europe, and we \"do justice\".",
			"added": 1534680943
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1527279034_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp": [
			{
				"comment_id": 1,
				"body": "Fuck GDPR. Only more control over us. Nothing more. Most of this \"private data\" is known to the authorities, so there's no point in protecting it. The real private data has to be stored with client-side encryption, so there is no need to \"protect\" it. How to see if some company REALLY protects your data? They use end-to-end encryption, or encrypt the data directly on your side, and only you have the key. If someone gives you i.e. chat possibility without end-to-end encryption - you can be sure they will give this data to someone else. I don't care if they hand it over to police, fuck even interpol, or some lunatic adware company. Your data is yours alone and we protect it as as whole or there is no point in \"protection\". Also the GDPR with this \"be forgotten\", is trying to make you like.. \"unsee\" things. Fucked up and wicked AF. When police will send request to google, will google protect my data? FUCK NO! Thats why GDPR is just scam.",
				"added": 1527283686
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 2,
				"body": "Remember, when someone is suffering, we will pursue. No matter WHO is responsible for the suffering. Police beats you? We go for the police (we target exact people). You hurt someone? We go for you. It's as simple as that. Don't hurt people, don't damage their goods (don't take their money). It is THAT simple. And no, we don't ask, we don't threaten, we just do what has to be done.",
				"added": 1527364701
			}
		],
		"1530089348_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 3,
				"body": "In the official law children have no rights, because they have owners. Why? Because owners are responsible for actions of the children. In realty You can be responsible ONLY for other person actions IF you tell him to do something (give an order or even ask them to do something for you). In any other case You can't be responsible for actions of any other being (like another human, dog, bird or whatever). In our country we just kill family members of people who think someone can be responsible for someones other actions \"just like that\" (in worst case scenario of course). So You have to choose between \"the owner method\" (the owner can do ANYTHING with people/animals he owns), or \"the proper\" method (where the responsible is the person giving the order). You Can of course \"go by the law\", but I don't recommend it. The police won't help You and we will find Your family anyway.",
				"added": 1530563764
			},
			{
				"comment_id": 4,
				"body": "In the official law children have no rights, because they have owners. Why? Because owners are responsible for actions of the children. In realty You can be responsible ONLY for other person actions IF you tell him to do something (give an order or even ask them to do something for you). In any other case You can't be responsible for actions of any other being (like another human, dog, bird or whatever). In our country we just kill family members of people who think someone can be responsible for someones other actions \"just like that\" (in worst case scenario of course). So You have to choose between \"the owner method\" (the owner can do ANYTHING with people/animals he owns), or \"the proper\" method (where the responsible is the person giving the order). You Can of course \"go by the law\", but I don't recommend it. The police won't help You and we will find Your family anyway.",
				"added": 1530563812
			}
		],
		"1533076540_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "Why china government hates their people so much, that they block their internet?",
				"added": 1533146536
			}
		],
		"1537152793_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 6,
				"body": "Bardzo dobrze napisane! Super że są ludzie którym zależy na otwartym internecie.",
				"added": 1537206515
			}
		],
		"1537816041_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 7,
				"body": "EU is really fucked up. I think Poland needs the same \"repair\" as some other countries. The police and now ITD has too much free time and they constantly poke daily drivers. Ofcourse to a less extent than a few years ago but still. I hoped it can be avoided, and it's a tough choice to discourage them in such a hard way :/ We don't see any other less damaging options for now. The french group which contacted us is in almost the same position. Really tough choices need to be made. Country instability because of fucked up \"safe car driving\". How the fuck do we explain this to the next generation? \"Someone fucked up your country because someone wanted to drive slower\"? This is just getting better and better. What's next? Fucking civil war because someone didn't want to cancel a ticket?",
				"added": 1537892666
			}
		]
	},
	"comment_vote": {
		"9_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp": 1,
		"1_1ZhXpghGRhcPhb4kebuHhj1EUdLHkdPFG": 1
	}
}