{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": 1,
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 1,
				"body": "wow. interesting ideas. \n\nforgive the \"ugly american\" ignorance - and from a complete noob to zero- - with the coronavirus scare going around - I'm curious- I see a lot of Chinese language looking characters- does that mean is there a lot of folks from China on here getting around their gov filters? If I'm \"not supposed to ask\", that's ok. I can take criticism. :)",
				"added": 1582140420
			}
		],
		"1581821389_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 2,
				"body": "I have a blog with a real web address - how do I share it here? Do I just copy and paste the text of it, or is there a better way?",
				"added": 1582143411
			}
		],
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 3,
				"body": "The fact that you are thinking about it puts you at least 1 step ahead of folks stuck on Fb. \n\nYou got about 6 months. go.",
				"added": 1582773655
			}
		],
		"1583331189_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 4,
				"body": "lachesism is the term for this. \n\nI agree. \n\nbut I'm not ready yet - well, not as ready as I'd like to be.",
				"added": 1583350146
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 5,
				"body": "Bernie the commie got kicked out of a commune for being all talk, no work. Fast forward 40 years and nothing has changed- he's the ultimate pied-piper loser - all talk, no walk in 2016, and now in 2020. His supporters are a bunch of greedy takers, who've got no drive, other than to get while the getting is good. They've never produced anything of value in their lives, and never will. \n\nAnd it's not Capitalism that's failed- we haven't had capitalism in the USA for at least a hundred years. What's failing right now in 2020 is Corporatism. Corporatism is when the corporations run the government. Look at all the support Hillary got in 2016 from Wall Street, Big Banks, Big Pharma, Facebook, Google, Twitter, MSM, Silcone Valley, Hollywood, Russia, etc. They are all in on communism because they want to end up at the top of the heap when this dumpster fire (that they've lit) finally dies. \n\nWhat the commies call 'Capitalism' is really a free market economy, and unlike the artificially supported, resource hungry, forced, and unsustainable communism/socialism, free market economies exist naturally everywhere on the planet - in all of nature - deserts, rain forests, savannas, plains, mountains, oceans- it's in evolutionary theory, and it's worked out great for at least 4 billion years. All a free market is, is natural interactions between two organisms. An organism can be as simple as a single bacterial cell, or as complex as two tribes in Africa. One has something the other one needs, and an exchange is made. It's living things taking natural advantage of available resources, and bettering themselves, improving upon existing elements, and then trading up. That's it. It's not resource hungry, doesn't enslave billions, or kill hundreds of millions of people in the name of authority, power, or control, or turn rivers into heavy metal sludge canals.  \n\nCommunism, on the other hand, is an unnatural, forced state upon all life. It takes takes massive amounts of energy inputs, is unsustainable, and ultimately fails, but only after killing its adherents, polluting its rivers and streams, denuding its forests, and toxifying its lakes. Rich Hollywood types, big Tech, big Ag, Big Pharma, and Big Gov all love communism because they love to control everyone. Power and control is what communism is all about: Pigeon-holing populations, ignoring the individual in favor of the collective, etc.",
				"added": 1583932131
			},
			{
				"comment_id": 6,
				"body": "> [sfs9](#comment_62_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): sfs9 \n\nperfect. \n\nto the commie wannabees- go find some other country to screw up. This one does not need you.",
				"added": 1584019537
			}
		]
	},
	"comment_vote": {
		"1_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"4_1vRYduBUYkEwGmGQjpv8S9nJmz6XEdXAs": 1,
		"58_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"5_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX": 1,
		"63_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"62_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"63_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"62_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1
	}
}