{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1517087760_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1516750041_1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW": [
			{
				"comment_id": 1,
				"body": ">like to improve on ZeroMe\n\nI'll assume you meant zerowiki here :P. As for suggestions, I'd really just like to see improvements in general. The site hasn't changed much at all lately. Changing it to a merger site would be good (so that you can keep the data and swap clients, or keep the client and swap data). A proper comparison between old articles and newer ones would be good (I think one of the forks did this?). Only changes being stored, to cut down on duplicate data. Or alternatively being able to remove older versions of the articles from the UI. So that user's may cut down on their used space (so that they can contribute more in the face of inactive moderators).\n\nLarger user storage limits in general. ZeroWiki tends to suck up your space quick when you're an active contributor on the larger articles. Have optional image uploads, rather than relying on hotlinking to clearnet sites.\n\nHaving a search option would be great.",
				"added": 1516786048
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I didn't understand if ZeroWiki or ZeroMe was meant, but here goes. [...]\n\nAre you working on both ZeroWiki *and* ZeroWikipedia? ZeroWikipedia, as I understood it, is supposed to be an attempt to mirror wikipedia onto zeronet. Whereas ZeroWiki is meant to be a native approach towards building a wiki on zeronet, that isn't an exact clone of wikipedia.",
				"added": 1516880209
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_5_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I am developing only ZeroWikipedia, but ZeroWikipedia will have all the features ZeroWiki has, including creating articles in ZeroNet.\n\nSo how do you plan to differentiate the wikipedia pages from the ones created/edited on zeronet?",
				"added": 1516885968
			}
		],
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 2,
				"body": "* Sci-hub clone - Open science is good, and people should work to protect it. Right now it's just sci-hub and libgen doing the bulk of the work for basically every scientific study. If they go down, byebye open/free science.\n\n* Image uploading service - Straight forward, fairly simple, needs to be done. I'm surprised it's not a thing yet.\n\n* News sites! - How can one spend all their time on ZeroNet if they're constantly heading back to the clearnet for news? Even just a bot that mirrors (not links) popular news articles would be great.\n\n* A port of [fakku.dating](https://github.com/FAKKU/Dating). Sorry not sorry. This site was great. We need it. It's all nodejs and open source, so there shouldn't be too much trouble.\n\n* ZeroMail supporting more ID providers, and having a merger site to allow for different 'hosts'. Helps avoid centralization but avoids the issue of having people on different services.",
				"added": 1516786656
			}
		],
		"1516818749_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This isn't even beta, it is alpha. I've started developing it two days ago. But creating hubs is finished, adding articles (no editing yet, though) and viewing them is done. So in a week or so I will release.\n\nDamn that's fast. Definitely hyped for this.",
				"added": 1516880531
			}
		],
		"1565033981_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 6,
				"body": "ZeroVerse is long dead. Can't sign up anymore because the person running it abandoned it.",
				"added": 1565044978
			}
		]
	},
	"comment_vote": {
		"1_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1,
		"2_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8": 1,
		"10_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}