{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 3,
			"body": "> [spawn](#comment_3_1rVzPYdY5NJLM5vzA93mQNjuWoMVd9gDu): When I tried edit spawn@kaffieid: https://ipfs.pics/QmYQG9YgtUmHRSuv48x8xkAJ53XXNbf4FiY9pF7N4X1o4m\n\nAs mentioned on the KaffieID page, please don't use it until I get things figured out. There's a lot of publishing errors at the moment, and continuing to try and use it just makes things worse. If you really want to try and use it, go and re-register your KaffieID using the 'indexb.html' page on the KaffieID site. That's my testing page while I work on it. I changed the gen-key, so it's guaranteed that old-kaffieIDs won't work.\n\nKaffieIDs (new ones) seem to work fine on this blog, and posting on KaffieHub in ZeroMe. But they fail to work on other hubs, presumably due to permissions.",
			"post_id": 28,
			"date_added": 1471988844
		},
		{
			"comment_id": 4,
			"body": "> [bashrc](#comment_1_1P7F9po18mshkbRG5zEVV47vHtLEX19QJa): KaffieID sounds like it could be useful for the mesh network I'm currently developing. Is there a repo for the source?\n\nNope. It's a pretty simple site. Just clone it and look in the site folder. As I mentioned, there seems to be issues with signing, but I think I've got most of them figured out. I was having an issue because I mistakenly took the ID site's public key for the permissions, when it needed to be the public key that was paired with the signing. Either way, the problems should be resolved.\n\nJust take a look at genid.js and the index-default.html. Should be clear enough to show what's going on.",
			"post_id": 28,
			"date_added": 1472085587
		},
		{
			"comment_id": 5,
			"body": "> [antyhrabia](#comment_1_1L5rGDgTs4W2V7gekSvJNhKa7XaHkVwotD): Hi, I have a question about this section:\n> \n> I dont understand how to use this to generate own key.\n\nJust uncomment the lines of code and view the page in your browser. The code will display a generated 'genkey' (a WIF that contains a public and private key) along with the corresponding public key (listed under 'permission address'). You take those two values, and plug them into the listed spots at the top of the file.\n\nThe genkey (pub/priv key wif) is what's used to authenticate certificates. In cases like ZeroID, where you want only the admin to sign stuff, you need to keep it private. But KaffieID is designed to not rely on a central authority, so there needs to be a static key that's included in the ID site. That's the genkey.\n\nThe permission address is just that. IDs on ZeroNet refer to a pubic key in order to determine whether something is signed properly. The permission address is the public key for the generated pair, so that you may correctly allow the new IDs to sign/publish content.\n\nBasically:\n\n1. Uncomment those lines.\n\n2. Go to your ID site. There'll be two lines. You can refresh the page a few times to show that they are indeed generated upon refresh.\n\n3. Copy+paste the two values into the correct spots in the index.html file, to provide the relevant information to begin signing certificates.",
			"post_id": 29,
			"date_added": 1472172444
		},
		{
			"comment_id": 6,
			"body": "> [p2p](#comment_5_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): girl, I conform there is still sth wrong with your ZeroMe profile in your hub.not only in my new client, but also in latest proxy, all your new posts are rejected. \n\nFixed. I apparently had a typo in my content.json, causing newer clients to reject it. I had `auth_type` instead of `cert_auth_type`. Should be fixed now for the KaffieID test and my ZeroID. If my other IDs are having problems, it's likely I just haven't got around to fixing them.\n",
			"post_id": 29,
			"date_added": 1472425569
		},
		{
			"comment_id": 7,
			"body": "> [jmsebastian](#comment_1_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): I have been trying to get tags to work, but I'm running into a brick wall (a lot of this stuff is new to me). \n\nI don't see any modifications to your blog. If all the javascript/html is working, and the content is being put into the data.json file, then the issue is likely that you didn't update your dbschema.\n\nBe sure to refresh your javascript page so that your browser gets the update to the js file. And make sure all the files have been changed: dbschema, data.json, index.html, and all.js.",
			"post_id": 27,
			"date_added": 1472593823
		},
		{
			"comment_id": 8,
			"body": "> [jmsebastian](#comment_2_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): Hmm, I thought I had done so correctly. I modified each of the files you listed, so I probably left something out of one of them that I didn't notice. Thanks for your help. I'll give it another go when I get a bit more time.\n\nBe sure to hit 'reload schema' and 'rebuild database' in the sidebar so that you can be sure the database is being regenerated properly.",
			"post_id": 27,
			"date_added": 1472597407
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"28": 1
	}
}