{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1548147462,
			"title": "StarCraft - Brood War REMASTERED",
			"body": "EffOrt (Z) v Flash (T) on Fighting Spirit - StarCraft - Brood War REMASTERED\nhttps://www.youtube.com/watch?v=gS0Pb4_uwoo",
			"added": 1548147461
		},
		{
			"topic_id": 1548149439,
			"title": "FUD: Banco da Inglaterra diz que criptos são lentas\t- escrito pela equipe Radar BTC em 2019-01-21 19:19:04 BRT Bloomberg  --",
			"body": "Van Steenis do Banco da Inglaterra diz que criptos NÃO são uma preocupação no momento: \"elas falham nos testes básicos de serviços financeiros. Não são uma boa unidade de troca, não mantem valor e são lentas\"\nNOSSA LEITURA:  Tá \"certo\". A libra esterlina que teve inflação acumulada de 62% nos últimos 20 anos é que segurou bem o valor (risos) \n\nhttps://www.bloomberg.com/news/articles/2019-01-21/cryptocurrencies-fail-fundamental-tests-boe-s-van-steenis-says\nhttps://radarbtc.com.br/index.php?blog-id=fud-banco-da-inglaterra-diz-que-criptos-sao-lentas",
			"added": 1548149437
		},
		{
			"topic_id": 1548150337,
			"title": "vainglory (game) Ylva Hero Spolight",
			"body": "https://www.youtube.com/watch?v=K6kHZW3Vq2g",
			"added": 1548150334
		},
		{
			"topic_id": 1548154584,
			"title": "Bitcoin e eu Hal Finney 19 de março de 2013",
			"body": "https://cypherpunks.com.br/bitcoin-e-eu/\n\n\nOriginalmente publicado em Bitcointalk\n\nEu achei que deveria escrever sobre os últimos 4 anos, uma época agitada para o Bitcoin e para mim.\n\nPara aqueles que não me conhecem, eu sou Hal Finney. Eu comecei a trabalhar com criptografia em uma versão inicial do PGP, trabalhando diretamente com Phil Zimmermann. Quando Phil decidiu começar a PGP Corporation, eu fui um dos primeiros contratados. Eu trabalharia na PGP até a minha aposentadoria. Ao mesmo tempo, fiquei envolvido com os Cypherpunks. Eu rodei o primeiro remailer anônimo baseado em criptografia, entre outras atividades.\n\nPulando ao final de 2008 e ao anúncio do Bitcoin. Eu percebi que os velhotes da criptografia (eu estava nos meus 50) tendem a ficar cínicos. Eu era mais idealista: sempre amei criptografia, o mistério e o paradoxo que a envolvem.\n\nQuando Satoshi anunciou o Bitcoin na lista de e-mails de criptografia, ele conseguiu, no máximo, uma recepção cética. Criptógrafos já viram muitos esquemas feitos por iniciantes sem noção. Eles tendem a ter uma reação impulsiva.\n\nEu estava mais positivo. Eu já estava interessado em esquemas de pagamentos criptográficos. Além disso, eu fui sortudo o suficiente para conhecer e corresponder Wei Dai e Nick Szabo, conhecidos por terem criado as ideias que se realizariam com o Bitcoin. Eu tinha feito uma tentativa de criar minha própria moeda baseada em prova de trabalho, chamada RPOW. Então eu achei o Bitcoin fascinante.\n\nQuando Satoshi anunciou a primeira versão do software, eu o testei logo. Eu acho que fui a primeira pessoa, além de Satoshi, a rodar o bitcoin. Eu minerei o bloco setenta e alguma coisa, e fui o destinatário da primeira transação de bitcoin, quando Satoshi me enviou dez moedas como teste. Eu levei uma conversa por e-mail com Satoshi pelos dias seguintes, apontando falhas enquanto ele as corrigia.\n\nHoje, a verdadeira identidade de Satoshi se tornou um mistério. Mas na época, eu achei que estava lidando com um jovem de ancestralidade japonesa que era muito inteligente e sincero. Eu tive a boa sorte de conhecer muitas pessoas brilhantes ao longo da minha vida, então eu reconhecia os sinais.\n\nApós alguns dias, o bitcoin estava rodando bastante estável, então eu parei de rodá-lo. Eram dias em que a dificuldade era 1, e você poderia encontrar blocos com uma CPU, nem precisava de uma GPU. Eu minerei alguns blocos durante os dias seguintes. Mas eu o desliguei porque fazia meu computador esquentar, e o barulho do resfriador me incomodava. Em retrospecto, eu gostaria de tê-lo mantido por mais tempo, mas por outro lado, eu fui extremamente sortudo de estar lá no começo. Essa é uma daquelas situações de copo meio cheio e meio vazio.\n\nA outra vez que ouvi falar sobre Bitcoin foi ao final de 2010, quando eu me surpreendi ao descobrir que não apenas ainda estava funcionando, mas bitcoins tinham valor monetário real. Eu abri minha antiga carteira, e fiquei aliviado ao descobrir que meus bitcoins ainda estavam lá. Como o preço ficou alto, eu os transferi para uma carteira offline, onde espero que valham algo para os meus herdeiros.\n\nFalando em herdeiros, fui pego de surpresa em 2009, quando de repente fui diagnosticado com uma doença fatal. Eu estava na melhor forma da minha vida no início daquele ano, tinha perdido muito peso e começado a correr longas distâncias. Eu corri algumas meia maratonas, e estava começando a treinar para uma maratona. Eu estava começando a correr mais de 3 km, e pensei que estava tudo bem. Foi quando tudo começou a dar errado.\n\nMeu corpo começou a falhar. Minha fala arrastou, eu perdi força nas mãos, e minhas pernas estavam lentas. Em agosto de 2009 eu fui diagnosticado com ELA, também chamada de doença de Lou Gehrig, o famoso jogador de baseball.\n\nELA é uma doença que mata neurônios motores, que levam sinais do cérebro aos músculos. Seu primeiro sintoma é fraqueza, então, gradualmente, te paralisa. Geralmente é fatal em 2 a 5 anos. Meus sintomas estavam moderados e eu continuei a trabalhar, mas a fadiga e problemas de voz me forçaram a aposentar no início de 2011. Desde então, a doença continuou sua inexorável progressão.\n\nHoje estou essencialmente paralítico. Sou alimentado através de um tubo, e minha respiração é assistida por outro tubo. Eu mexo no computador usando um sistema comercial de rastreamento de olhos. Ele também tem um sintetizador de voz, então essa é a minha voz agora. Eu passo o dia todo em minha cadeira de rodas elétrica. Eu fiz uma interface usando Arduino para ajustar a posição da minha cadeira de rodas usando os meus olhos.\n\nPassei por uma adaptação, mas minha vida não é das piores. Eu ainda posso ler, ouvir música e assistir a TV e filmes. Recentemente descobri que ainda posso escrever códigos. É muito lento, provavelmente 50 vezes mais lento que antes. Mas eu ainda amo programar e isso me dá objetivos. Atualmente estou trabalhando em algo que Mike Hearn sugeriu, usando as funcionalidades de segurança dos processadores modernos, projetados para dar suporte a “computação confiável”, para melhorar as carteiras de Bitcoin. Está quase pronto para ser lançado. Eu apenas tenho de fazer a documentação.\n\nE, é claro, os movimentos no preço dos bitcoins me divertem. Eu tenho muito em jogo. Mas eu consegui meus bitcoins por sorte, com pouco crédito a mim. Eu vivi o crash de 2011. Então eu já vi isso antes. Vem fácil, vai fácil.\n\nEssa é a minha história. Eu sou muito sortudo no geral. Mesmo com ELA, minha vida foi muito satisfatória. Mas minha expectativa de vida é limitada. Essas discussões sobre herdar seus bitcoins são mais de interesse acadêmico. Meus bitcoins estão guardados em nosso depósito, e meus filhos entendem de tecnologia. Eu acho que estão seguros o suficiente. Estou confortável com o meu legado.\n[levemente editado]\n\nFonte: https://nakamotoinstitute.org/bitcoin-and-me/",
			"added": 1548154580
		},
		{
			"topic_id": 1548199073,
			"title": "John Carvalho chama Roger Ver “pro pau” pelo domínio Bitcoin.com",
			"body": "EN\n(in my opinion roger seeing is a scammer) remark: my opinion, whoever pasted here is stuff and not john, he does not know what he thinks of the roger bum see\n\n\nJohn Carvalho, better known as Bitcoin Error Log, called Roger See \"pro pau\" literally and challenged the defender of Bitcoin Cash (BCH) for a physical fight, in which the winner will get the domain Bitcoin.com, which today belongs to Ver But Peter McCormack, who transmitted Carvalho's proposal to the Bitcoin.com site owner in another episode of the \"What Bitcoin Did\" podcast, was not interested in the match.\n\n\"@BITCOINERRORLOG IS OFFERED TO FIGHT AGAINST @ROGERKVER BY THE DOMAIN OF BITCOIN.COM. ROGER IS INTERESTED, TERMS, FORMAT AND RULES TO BE AGREED \", DECLARED ON THE TWITTER.\n\nHTTPS://TWITTER.COM/PETERMCCORMACK/STATUS/1085597928482369537\n\nIn the challenge, Carvalho says that if he wins, Ver will direct the entire flow of Bitcoin.com views to the official BTC website, Bitcoin.org. However, his task may not be as simple as while he has no experience as a fighter, Roger Ver is brown belt jiu-jitsu. But @BitcoinErrorLog has stated on Twitter that he promises to train even with the Romanian bears to win the fight and win to see.\n\nThe site Bitcoin.com has long been the subject of dispute and controversy in the crypto-coins community, after all, it has far more views than Bitcoin's official website, Bitcoin.org. However Roger Ver, owner of the domain, tends to confuse users as he identifies the BCH as being the original Bitcoin (BTC), deceiving and deceiving those who have little experience in the market and are often reading about Bitcoin for the first time turn.\n\n\"THE BEST WAY TO END ROGER SEE IS TO TAKE THE BITCOIN.COM OF HIM,\" DECLARED CARVALHO.\n\n=======================================================\npt-br\n (na minha opinião roger ver é um golpista) observação: opinião minha, quem colou aqui está materia e nãodo john, ele não sei o que pensa do vagabundo do roger ver\n\n\nJohn Carvalho, mais conhecido como Bitcoin Error Log, chamou Roger Ver “pro pau” literalmente e desafiou o defensor do Bitcoin Cash (BCH) para uma luta física, na qual o vencedor ficará com o domínio Bitcoin.com, que hoje pertence à Ver. Ver não se pronunciou oficialmente sobre o desafio, mas segundo Peter McCormack, que transmitiu a proposta de Carvalho ao dono do site Bitcoin.com em outro episódio do podcast “What Bitcoin Did”, Ver estaria interessado no combate.\n\n“@BITCOINERRORLOG SE OFERECEU PARA LUTAR CONTRA O @ROGERKVER PELO DOMÍNIO DO BITCOIN.COM. ROGER ESTÁ INTERESSADO, TERMOS, FORMATO E REGRAS A SEREM ACORDADOS”, DECLAROU NO TWITTER.\n\nHTTPS://TWITTER.COM/PETERMCCORMACK/STATUS/1085597928482369537\n\nNo desafio, Carvalho afirma que, se vencer, Ver irá direcionar todo o fluxo de visualizações do Bitcoin.com para o site oficial do BTC, o Bitcoin.org. No entanto, sua tarefa pode não ser tão simples, pois enquanto ele não tem nenhuma experiência como lutador, Roger Ver é faixa-marrom de jiu-jitsu. Mas @BitcoinErrorLog declarou no Twitter que promete treinar até com os ursos da Romênia para vencer a luta e ganhar de Ver.\n\nO site Bitcoin.com é, há muito tempo, objeto de disputa e controvérsia na comunidade de criptomoedas, afinal, ele possui muito mais visualizações do que o site oficial do Bitcoin, o Bitcoin.org. No entanto Roger Ver, dono do domínio, tende a confundir os usuários, à medida em que identifica o BCH como sendo o Bitcoin original (BTC), iludindo e enganando aqueles que têm pouca experiência no mercado e muitas vezes estão lendo sobre Bitcoin pela primeira vez.\n\n“A MELHOR MANEIRA DE ACABAR COM ROGER VER É TIRAR O BITCOIN.COM DELE”, DECLAROU CARVALHO.\n\nhttps://www.criptomoedasfacil.com/john-carvalho-chama-roger-ver-pro-pau-pelo-dominio-bitcoin-com/?utm_source=dlvr.it&utm_medium=twitter",
			"added": 1548199068
		},
		{
			"topic_id": 1548296132,
			"title": "Flash (T) v Zero (Z) Best of 5 - StarCraft - Brood War REMASTERED",
			"body": "https://www.youtube.com/watch?v=vBjgww8jDgw",
			"added": 1548296126
		},
		{
			"topic_id": 1548296366,
			"title": "Entrevista de Olavo de Carvalho para Leandro Ruschel",
			"body": "https://www.youtube.com/watch?v=YoApKNuOQ1A",
			"added": 1548296359
		},
		{
			"topic_id": 1548351496,
			"title": "DeepMind StarCraft II Demonstration IA",
			"body": "https://www.youtube.com/watch?v=cUTMhmVh1qs\nJoin Artosis, RottterdaM and a cast of special guests for a unique StarCraft II showcase live from DeepMind in London, in partnership with Blizzard.\n\nApoie o canal! Bitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85 doando 0.00004 BTC = R$1,00(1 real) você já ajuda muito :) ===================================================================== Support the channel! Bitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85 donating 0.00004 BTC = 0,14 USD You already help a lot :)",
			"added": 1548351488
		},
		{
			"topic_id": 1548611979,
			"title": "Cello Wars (Star Wars Parody) Lightsaber Duel - ThePianoGuys",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1548611541_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE\n\nApoie o canal!\nBitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85 \ndoando 0.00004 BTC = R$1,00(1 real) você já ajuda muito :)\n\n=====================================================================\n\nSupport the channel!\nBitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85 \n\ndonating 0.00004 BTC = 0,14 USD You already help a lot :)",
			"added": 1548611970
		},
		{
			"topic_id": 1548614122,
			"title": "ASEREJÉ EN OPERA GENIAL",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1548614031_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE",
			"added": 1548614112
		}
	],
	"topic_vote": {
		"1548229579_1Gp9qUsVBhUfSpCtmXn4MdqbErzAr4qn4o": 1,
		"1548241961_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"1548887246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1549510248_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1552761944_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1553680589_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": 1,
		"1553712837_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1,
		"1553949845_1MQC9sqLrvcma2vnQZSUJ5WN4N6TY15myR": 1,
		"1558983538_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1548887246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "use bitcoin, son, is very secure",
				"added": 1548891143
			}
		],
		"1549087628_15qxwNQ94ep9jtmxa933ZqemC9QyQg4xUJ": [
			{
				"comment_id": 2,
				"body": "no",
				"added": 1549088699
			}
		],
		"1553213813_1FJrRrqodaWfW7TGGKbnT5mmdB7DnGMbt8": [
			{
				"comment_id": 3,
				"body": "bitcoin of course :)",
				"added": 1553241489
			}
		],
		"1553407395_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 4,
				"body": "zeroid is ZeroNet-win-dist\\data\\users.json\n\nsave \"users.json\"",
				"added": 1553426700
			}
		],
		"1553712837_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": [
			{
				"comment_id": 5,
				"body": "eu acredito que sim, alias mesmo sem MAIS censura já acho que seria uma boa, pois só o fato de tu poder deixar o material que TU GOSTA e outros poderem ajudar a manter vivo na internet, exemplo eu estou deixando algumas das coisas que gosto de ver, filmes, desenhos e etc, compartilhados :)\nE também sempre que acho um filme que gosto tento virar seed para NÃO PRECISAR enviar eu mesmo e ajudar a descentralizar mais a rede\nExemplo estou tentando ser seed dos de volta para o futuro :)\n\n\nfilmes , seriados e etc\nhttp://127.0.0.1:43110/big.kopykate.bit/?Channel=caropc2@zeroid.bit\n\ndesenhos e animes\nhttp://127.0.0.1:43110/big.kopykate.bit/?Channel=2urws3xr7gk7pjuw@zeroid.bit\n\nlibertarianismo , politica e etc\nhttp://127.0.0.1:43110/big.kopykate.bit/?Channel=6mqj1vz56h27km0b@zeroid.bit\n\ndocumentários , seriados e etc\nhttp://127.0.0.1:43110/big.kopykate.bit/?Channel=caropc1@zeroid.bit\n\nsite com vários livros, videos, musicas, jogos de nitendinho e etc\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er",
				"added": 1553736378
			},
			{
				"comment_id": 6,
				"body": "kiloromeu  deixa ligado o pc para eu poder fazer seed dos filmes do de volta para o futuro, estou querendo ver os filmes mas tu não deixa online para eu fazer o seed uahehauheua",
				"added": 1553738586
			},
			{
				"comment_id": 7,
				"body": "Artigo 13 - Explicação Definitiva\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1553747314_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE",
				"added": 1553747457
			}
		],
		"1553949845_1MQC9sqLrvcma2vnQZSUJ5WN4N6TY15myR": [
			{
				"comment_id": 8,
				"body": "The IT Crowd S01E01 Leg\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1548313153_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE",
				"added": 1553960100
			}
		],
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 9,
				"body": "The Last Man on Earth O Último homem da Terra 1964 Leg\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1557701312_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS\n\nI use this :)",
				"added": 1557718711
			}
		],
		"1558983538_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 10,
				"body": "I think ANY way to improve decentralization, the power of the network, to me this is good YES.\n\nIf you can do, THANK YOU",
				"added": 1559327272
			}
		]
	},
	"comment_vote": {
		"254_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_188woswaganmWmEP1hzi4GsRHgLPkCDkEA": 1,
		"8_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1,
		"433_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"35_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1
	}
}