{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1
	},
	"next_comment_id": 2,
	"comment": {
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 1,
				"body": "Sono troppo vecchio per dire la mia? :D\n\nParlando da laureato in medicina + specializzazione + anni passati a fare ricerca, le osservazioni che faccio sono le seguenti e valgono per tutti i livelli di istruzione:\n\n*manca quasi ovunque un'approccio pratico alle conoscenze teoriche che vengono insegnate (io dopo la laurea in medicina quasi non sapevo fare un'iniezione endovena...ho dovuto imparare in specialità dopo essere stato buttato \"allo sbaraglio\" ad assistere i pazienti...)\n*oggigiorno si va a scuola/università/master ecc... per avere il \"pezzo di carta che serve per lavorare\" e non per imparare. questo porta ad un sacco di conseguenze negative:\n\n1)nessuno si impegna nei corsi dove basta la \"sufficienza\" per raggiungere questo obiettivo (specie nelle scuole superiori e questo porta ad una formazione in media mediocre, con problemi anche da parte del mercato del lavoro nel ricercare personale qualificato)\n2)nei corsi dove \"i voti contano\" la competizione invece è spietata (e fatta anche di sgambetti e scappatoie più o meno lecite..) ma a nessuno interessa davvero imparare. L'importante è prendere o un 10 o un 30 anche a costo di imparare tutto a memoria e di non essere critici con ciò che viene insegnato (mai criticare chi ti valuta... :D ). \n3)CHI IMPARA A MEMORIA NON IMPARA AD IMPARARE! Quindi alla minima difficoltà il neolavoratore va in crisi! (e nelle difficoltà che spesso è necessario tirare fuori le palle ed apprendere nuove nozioni AUTONOMAMENTE, ma non c'è più il professore che ti spiega tutto...)\n4)\"se non fai quello che c'è scritto sul tuo titolo di studio sei un fallito!\" GRANDISSIMA CAZZATA!!! A parte forse i medici e gli ingegneri quasi nessun altro laureato fa quello per cui ha studiato! Saper fare tante cose diverse (ANCHE E SOPRATTUTTO FUORI DAL PROPRIO AMBITO) è invece la carta vincente per riuscire nella vita, che tutto è tranne che predeterminata! (oltre che per evitare di farsi sfruttare...ma di questo possiamo parlare in un altro topic dedicato al mondo del lavoro) Fare questo però richiede un metodo, un carattere ed abilità pratiche che la scuola  non insegna (volutamente? chi insegna potrebbe in futuro essere in competizione con i suoi studenti..), puntando invece all'iperspecializzazione. Inoltre saper collegare fra loro competenze in ambiti molto diversi può anche aprire opportunità lavorative precluse a chi è troppo settoriale.\n5)come già detto l'eccessivo nozionismo, come anche il fancazzismo che da un lato imperversa in molti corsi e la competizione spietata che c'è in altri, comportano che lo studente non solo apprende solo nozioni, ma non sviluppa altre abilità poi importanti nel mondo del lavoro come quelle relazionali, caratteriali e manageriali! (questo ha come conseguenza anche una politica nazionale disastrosa,...potremmo parlare anche di questo in un altro topic! :) )\n\nSe volete potrei aprire anche altri topic simili pe quanto riguarda il mondo del lavoro e la ricerca scientifica. fatemi sapere! :)",
				"added": 1580401856
			}
		]
	},
	"comment_vote": {}
}