{
	"posts": [
		{
			"id": "04fb3051-9d74-49a8-8d22-700bafc0642b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b5847cda-8236-47d8-ab92-dee692a96c4f",
			"body": ">>da420515-022e-4356-85eb-e72c09ab8a90\n>the solution to phoneposting was staring us in the face this whole time",
			"time": 1565079788800,
			"files": "[]"
		},
		{
			"id": "5258fc85-2390-4850-ae0f-3299a2514221",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b5847cda-8236-47d8-ab92-dee692a96c4f",
			"body": ">>d5fe0e03-0f01-4315-a90b-03789a5bbc13\nAgreed. But make sure to leak all over the normie sphere.",
			"time": 1565079824700,
			"files": "[]"
		},
		{
			"id": "4d837f97-3dd3-414e-a4a5-2f07211a27fe",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "05ff81c4-c907-45ee-86d2-660acf0d93ae",
			"body": ">>2e23dab3-4ce6-428b-b520-a3b0c5dc21fd\nThe T60 does really feel solid, I wish they still made laptops like that.",
			"time": 1565107218500,
			"files": "[]"
		},
		{
			"id": "0d10cace-5826-4083-9ec2-630feef23070",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "FULL BOTNET STARTED LONG BEFORE INTEL ME",
			"body": "Full remote backdoor available in all Intel and AMD computers since 2003\n\nAll your keystrokes, screens, files can be remotely read or modified on demand at any time by MOSSAD, even if your PC is turned off. That includes your encryption password.\n\nPre-PSP and pre-ME cpu's are not safe. ASF and DASH are previous versions of PSP/ME botnet. ASF --> DASH --> ME/PSP\n\nhttps://en.wikipedia.org/wiki/Alert_Standard_Format\n\nAlert Standard Format (ASF) (also sometimes referred to as Alert Standard Forum, Alerting Specifications Forum, Alert Specification Function, etc.) is a DMTF standard for remote monitoring, management and control of computer systems in both OS-present and OS-absent environments.\n\nhttps://www.dmtf.org/standards/dash\n\n>DASH provides support for the redirection of KVM (Keyboard, Video and Mouse) and text consoles, as well as USB and media, and supports the management of software updates, BIOS (Basic Input Output System), batteries, NIC (Network Interface Card), MAC and IP addresses, as well as DNS and DHCP configuration. DASH specifications also address operating system status, opaque data management, and more.\n\nthey can access your keyboard, video, mouse over the internet\n\nhttps://en.wikipedia.org/wiki/Desktop_and_mobile_Architecture_for_System_Hardware\n\nDesktop and mobile Architecture for System Hardware (DASH) is a Distributed Management Task Force (DMTF) standard.\n\n>Intel Active Management Technology is a compliant implementation of DASH.\n\nhttps://en.wikipedia.org/wiki/Intel_Active_Management_Technology\n\n>Intel Active Management Technology (AMT) is hardware and firmware technology for remote out-of-band management of personal computers,[1][2][3][4][5] running on the Intel Management Engine, a separate microprocessor not exposed to the user, in order to monitor, maintain, update, upgrade, and repair them.\n\n>Intel confirmed a Remote Elevation of Privilege bug (CVE-2017-5689, SA-00075) in its Management Technology on May 1, 2017.[12] Every Intel platform with either Intel Standard Manageability, Active Management Technology, or Small Business Technology, from Nehalem in 2008 to Kaby Lake in 2017 has a remotely exploitable security hole in the ME. [13][14] Some manufacturers, like Purism[15] and System76[16] are already selling hardware with Intel Management Engine disabled to prevent the remote exploit. Additional major security flaws in the ME affecting a very large number of computers incorporating Management Engine, Trusted Execution Engine, and Server Platform Services firmware, from Skylake in 2015 to Coffee Lake in 2017, were confirmed by Intel on November 20, 2017 (SA-00086).\n\nhttp://archivecaslytosk.onion/GN3h4\n\nhttps://www.amd.com/en/technologies/security-manageability\n\n>AMD PRO A-Series platforms utilizing DASH manageability enable manageability features you need and want. These affordable, easy-to-use management tools and features enable remote management of client systems, whether they are powered on (in-band) with a responsive operating system (in-service), or when the clients are powered off (out-of-band) or have a non-responsive operating system (out-of-service). Our powerful management tools also offer remote diagnostics and troubleshooting, asset management, automated system startup and shut down.\n\nhttp://archivecaslytosk.onion/XNmxw\n\nhttps://developer.amd.com/tools-for-dmtf-dash/\n\n>Client systems that support out-of-band management help IT administrators perform tasks independent of the power state of the machine or the state of the operating system. Examples of out-of-band management tasks include: 1) Securely starting up a system remotely, even if it is currently powered off; 2) Viewing asset inventory information for a system that is powered off; 3) Retrieving health information about system components even if the OS is unavailable.\n\n(body too long)\n\nAnonymous  05/19/19 (Sun) 23:53:12 No.1064556\n\nhttp://archivecaslytosk.onion/N6GmV\n\nhttp://xml.coverpages.org/ni2007-03-23-a.html\n\n>Since the DMTF's Desktop and Mobile Working Group (DMWG) was announced, the group has attracted more than 180 members from over different companies, demonstrating a strong commitment by vendors and users across the industry to collaborate on this effort. Statements of support for the new DASH Initiative have been provided by (((AMD))), (((Avocent))), (((Broadcom))), (((Dell))), (((HP))), (((IBM))), (((Intel))), (((Microsoft))), (((Novell))), (((NVIDIA))), (((Symantec))), and (((WBEM Solutions))).\n\n",
			"time": 1565112082000,
			"files": "[{\"name\":\"What-is-Botnet.jpg\",\"thumb\":\"0be9c0e94c3db1a69125c458acab99b5edddff03-thumb.jpg\",\"size\":25281,\"type\":\"image/jpeg\",\"original\":\"ed3586fd31bb45cfe0ee6e8cca99a77cf3cd08c3.jpg\",\"directory\":\"19gh2DbXk8xxtCmfJNxDPZwbbxkHZVJXQv\"}]"
		},
		{
			"id": "494023ca-e697-44ee-941b-2f49db9e53af",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": ">Extra emphasis has been placed in the development of DASH to enable lightweight implementations which are architecturally consistent. This has been done to enable a full spectrum of implementations without sacrificing the richness of the CIM heritage. This includes software-only solutions and small footprint firmware solutions. Emphasis has been placed on ensuring that these implementations will be interoperable, independent of implementation, CPU architecture, chipset solutions, vendor or operating environment.\n\n>Through the DASH Initiative, the DMTF will provide the next generation of standards for secure out-of-band and remote management of desktop and mobile systems.\n\n>Intel\n\n>\"As a leader in industry standards for PC manageability for over two decades and as a founding member of the DMTF, Intel supports DASH as another advancement for IT as we move into the WS-Management era,\" said Gregory Bryant, vice president and general manager of Intel's Digital Office Platform Division. \"Intel vPro technology was originally designed to support a seamless transition to this new standard, and our 2007 product roadmap enables one of the industry's first DASH and WS-Management supported enterprise PCs through our next-generation Intel vPro technology.\"\n\n>Microsoft\n\n>\"We have been a strong advocate of standards, such as WS-Management, as part of our Dynamic Systems Initiative (DSI) and have accelerated the adoption of these technologies in Windows Vista and our System Center family of management solutions.\"\n\n>AMD\n\n>\"As a founding member of the DASH working group and key contributor to the specification, AMD is pleased to see the broad adoption of DASH in the industry,\" said Terri Hall, vice president, Software Alliances and Solutions, AMD.\n\n>About Distributed Management Task Force (DMTF)\n\n>With more than 3,500 active participants representing 39 countries and nearly 200 organizations, the Distributed Management Task Force, Inc. (DMTF) is the industry organization leading the development, adoption and promotion of interoperable management initiatives and standards.\n\n>DMTF was founded in 1992. Board member companies included [2007-03] Cisco Systems; Dell Computer Corp.; EMC; HP; Hitachi, Ltd; IBM; Intel; Microsoft; Novell; Oracle; Sun Microsystems; Symantec; and WBEM Solutions.\n\n>The DMTF works closely with its Alliance Partners, including (...) Federation Against Software Theft (FAST)\n\nhttp://archivecaslytosk.onion/tnVWG\n\nhttp://computerworld.com/action/article.do?command=viewArticleBasic&articleId=9014180\n\n>DASH will use another better-known DMTF specification, Web Services for Management (WS-Management), to enable management software to pull status information from PC hardware components and peripherals stored in flash memory, Bumpus said. That would allow machines that are \"out-of-band,\" or not running normally, to be diagnosed and even fixed remotely. Most existing management software and monitoring technology rely on software agents running on the machines to send back status information, said Lars Ewe, a division marketing manager at AMD Inc., which is a supporter of DASH. But software agents don't work if the machine's operating system can't boot because the latter is hung, corrupted by a virus, or not yet deployed. \"If you have a savvy administrator, DASH will let him diagnose whether an operating system is fried and let him remote boot it with a gold standard image of the OS,\" Ewe said. Or \"if the hard drive is dead, you can see that. Or you can wake up a PC and read the POST BIOS test data, as long as the power isn't totally switched off.\" [...] Bumpus predicted that PCs with DASH capabilities will start shipping within the next six to 12 months. He declined to predict how long it would take for DASH to become mainstream, but noted that DASH's predecessor, Alert Standard Format (ASF), was introduced in mid-2003 and is now used in \"tens of millions\" of PCs, mostly within businesses.\n\nhttp://archivecaslytosk.onion/5xcum\n\nhttp://www.networkcomputing.com/showArticle.jhtml?articleID=198500136\n\n>DMTF says Web services-based specifications will facilitate mobile and desktop management and cut administration costs... It isn't often that competitors like Intel and AMD, Microsoft and Symantec or Dell, HP and IBM can all agree on something. When they do, it either represents the future of the PC industry or is so meaningless that it can be largely ignored in practice.\n\nhttp://archivecaslytosk.onion/yVdyO\n\nhttps://www.tomshardware.com/reviews/vpro-amt-management-kvm,3003-13.html\n\n>An error (403 Forbidden) has occurred in response to this request.\n\nhttps://web.archive.org/web/2/https://www.tomshardware.com/reviews/vpro-amt-management-kvm,3003-13.html\n\n>This URL has been excluded from the Wayback Machine.\n\nWhat are they hiding from us? Did this article leak too much information to us, goys?\n\n>Can you still trust your network card?\n\nhttps://www.ssi.gouv.fr/uploads/IMG/pdf/csw-trustnetworkcard.pdf\n",
			"time": 1565112162400,
			"files": "[]"
		},
		{
			"id": "ada3497c-9ea4-4e1d-8608-ab15553b0eab",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": "the PC industry or is so meaningless that it can be largely ignored in practice.\n\nhttp://archivecaslytosk.onion/yVdyO\n\nhttps://www.tomshardware.com/reviews/vpro-amt-management-kvm,3003-13.html\n\n>An error (403 Forbidden) has occurred in response to this request.\n\nhttps://web.archive.org/web/2/https://www.tomshardware.com/reviews/vpro-amt-management-kvm,3003-13.html\n\n>This URL has been excluded from the Wayback Machine.\n\nWhat are they hiding from us? Did this article leak too much information to us, goys?\n\n>Can you still trust your network card?\n\nhttps://www.ssi.gouv.fr/uploads/IMG/pdf/csw-trustnetworkcard.pdf\n\nAlert Standard Format exploits\n\n>Alert Standard Format / Remote Management and Control Protocol Detection\n\nhttp://archivecaslytosk.onion/K7a8t\n\nhttps://www.tenable.com/plugins/nessus/45555\n\n>Disable this service if you do not use it, or filter incoming traffic to this port.\n\nhttp://archivecaslytosk.onion/BquXS\n\nhttps://www.dmtf.org/sites/default/files/standards/documents/DSP2014_1.1.0.pdf\n\n>PCs that have Wake On LAN configured will awake on receipt of the Magic Packet. DASH provides a similar capability through the Out Of Band DASH Service.\n\n>10.4 PC needs to be woken up remotely on a wireless network\n\n>Wake On LAN is not commonly implemented on wireless NICs because of the power requirements of keeping the radio on, but some systems can be configured to periodically wake up and listen for traffic on the wireless connections. While the wireless NIC is powered, the DASH Service can act as described in use case 10.3.\n\ncan remotely start your PC even if you use wireless NIC\n\nhttp://archivecaslytosk.onion/Uu8eI\n\nhttp://h10032.www1.hp.com/ctg/Manual/c01944865\n\n>Key Features\n\n>Service availability without the requirement of an installed operating system\n\nso it doesn't matter if you install GNU/Linux, because DASH botnet works independent of OS, it doesn't even require any OS\n\nhttps://en.wikipedia.org/wiki/AMD_700_chipset_series\n\n>Several members were launched in the end of 2007 and the first half of 2008, others launched throughout the rest of 2008.\n\n>SB700\n\n>DASH 1.0 support\n\neven old AMD chipsets had this botnet. even 10+ year old laptops contain DASH or it's predecessor, ASF.\n\nhttps://en.wikipedia.org/wiki/AMD_800_chipset_series\n\n>Two embedded 8051 controllers, and one dedicated for DASH compliance\n\nspecial chip in your old motherboard dedicated for DASH botnet\n\nhttps://en.wikipedia.org/wiki/Intel_Management_Engine\n\n>Intel motherboards. It is a part of Intel Active Management Technology, which allows system administrators to perform tasks on the machine remotely[5]. System administrators can use it to turn the computer on and off, and they can login remotely into the computer regardless of whether or not an operating system is installed.[6]\n\n>The Intel Management Engine always runs as long as the motherboard is receiving power, even when the computer is turned off.\n\n>The IME is an attractive target for hackers, since it has top level access to all devices and completely bypasses the operating system. Intel has not released much information on the Intel Management Engine, prompting speculation that it may include a backdoor. The Electronic Frontier Foundation has voiced concern about IME.\n\n>Starting with ME 11, it is based on the Intel Quark x86-based 32-bit CPU and runs the MINIX 3 operating system.\n\n> Starting with ME 7.1, the ARC processor could also execute signed Java applets.\n\n>The ME has its own MAC and IP address for the out-of-band interface, with direct access to the Ethernet controller; one portion of the Ethernet traffic is diverted to the ME even before reaching the host's operating system, for what support exists in various Ethernet controllers, exported and made configurable via Management Component Transport Protocol (MCTP).[16][17] The ME also communicates with the host via PCI interface.[15] Under Linux, communication between the host and the ME is done via /dev/mei.[18]\n\n>In August 2017, Russian company Positive Technologies (Dmitry Sklyarov) published a method to disable the ME via an undocumented built-in mode. As Intel has confirmed[44] the ME contains a switch to enable government authorities such as the NSA to make the ME go into High-Assurance Platform (HAP) mode after boot. This mode disables most of ME's functions.[45][46] It is authorized for use by government authorities only and is supposed to be available only in machines produced for them.\n\n>Dell, in December 2017,[54] began showing certain laptops on its website that offered the \"Systems Management\" option \"Intel vPro - ME Inoperable, Custom Order\" for an additional fee. Dell has not announced or publicly explained the methods used. In response to press requests, Dell stated that those systems had been offered for quite a while, but not for the general public, and had found their way to the website only inadvertently.[55]",
			"time": 1565112339700,
			"files": "[]"
		},
		{
			"id": "1945ff92-1c8f-42a5-97f6-b0aade4bd2a9",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": ">In August 2017, Russian company Positive Technologies (Dmitry Sklyarov) published a method to disable the ME via an undocumented built-in mode. As Intel has confirmed[44] the ME contains a switch to enable government authorities such as the NSA to make the ME go into High-Assurance Platform (HAP) mode after boot. This mode disables most of ME's functions.[45][46] It is authorized for use by government authorities only and is supposed to be available only in machines produced for them.\n\n>Dell, in December 2017,[54] began showing certain laptops on its website that offered the \"Systems Management\" option \"Intel vPro - ME Inoperable, Custom Order\" for an additional fee. Dell has not announced or publicly explained the methods used. In response to press requests, Dell stated that those systems had been offered for quite a while, but not for the general public, and had found their way to the website only inadvertently.[55] The laptops are available only by custom order and only to military, government and intelligence agencies.[56] They are specifically designed for covert operations, such as providing a very robust case and a \"stealth\" operating mode kill switch that disables display, LED lights, speaker, fan and any wireless technology.[57]\n\n(((they))) can disable ME for themselves. it has to be enabled only for goys.\n\nhttp://archivecaslytosk.onion/8uWfI\n\nhttps://support.symantec.com/en_US/article.HOWTO47637.html\n\n>Comparison of Intel AMT, ASF, and DASH\n\nASF = DASH = AMT = PSP\n\nsame botnet, it started decades ago with ASF. 15 year old laptops contain ASF. They kept improving it and adding more features.\n\nWe need to discuss, investigate, decide which is last desktop and mobile system that we can safely use. It turns out pre-PSP AMD like AMD FX are not safe.",
			"time": 1565112435700,
			"files": "[]"
		},
		{
			"id": "61ce3564-3fe0-44ba-a7e9-8ee6dc7315c5",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": ">>73299395-036e-4e65-8949-3b91c299872f\nThere are quite a few CPUs from the pre-botnet era still being manufactured, some in enhanced versions. People home-brew their own computers even today. Getting them online is another thing though.",
			"time": 1565123881000,
			"files": "[]"
		},
		{
			"id": "6916ee10-04a8-4b9d-9764-5a3bb3491d9b",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "Dishonesty in tech journalism?",
			"body": "We all know about the dishonesty in gaming journalism but what about the broader field of tech journalism? The CTS Labs debacle proved that a planted story can cause massive movement on the stock market.\n\nWhat are some stories that sounded fishy to you anons?",
			"time": 1565128696600,
			"files": "[{\"name\":\"47376478-15212221229229217_origin.png\",\"thumb\":\"8d152b90582be880a4a81c7f40d0780c9f766427-thumb.png\",\"size\":1281476,\"type\":\"image/png\",\"original\":\"e04db010d9eb6dd605be3ae7278cb8c457554ab2.png\",\"directory\":\"19gh2DbXk8xxtCmfJNxDPZwbbxkHZVJXQv\"}]"
		},
		{
			"id": "96253ee7-32e6-4637-819e-7c1a322f3f9b",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": ">>88033902-9cb7-490b-83bc-a7d983581747\nWhy not? 68k was good enough for top flight Unix workstations into the 1990s.",
			"time": 1565133136100,
			"files": "[]"
		},
		{
			"id": "b029c74f-0b25-423c-aec0-36d0d5eda2ae",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "803e6759-b0a1-4db2-a5ff-930272ce7bc5",
			"body": "The second you check your gmail or log into facebook or twitter or whatever they will know your IP address.",
			"time": 1565584816800,
			"files": "[]"
		},
		{
			"id": "9f44a5d5-68e4-4dab-9bf0-bac63e4359c7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "cf2479bf-0bdd-4a64-9a27-65e48d947b95",
			"body": "I like it her, this site is comfy.",
			"time": 1565586717906,
			"files": "[]"
		},
		{
			"id": "878eaa3e-5a8c-4862-b477-06524652964d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "293636cf-5d49-4d2d-88e4-3f5bf481dde3",
			"body": "Great catch.",
			"time": 1565586952350,
			"files": "[]"
		},
		{
			"id": "ce110604-1356-4c3a-b6e9-95ead3ace35a",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "0d10cace-5826-4083-9ec2-630feef23070",
			"body": "Bump.",
			"time": 1565587620302,
			"files": "[]"
		},
		{
			"id": "a80f3eb5-e862-4776-974d-f96e4063bce2",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "e89f8927-4880-4cff-a254-b9110551b72e",
			"body": "Everything works fine, no need to start mucking about with this zite.",
			"time": 1565589038976,
			"files": "[]"
		},
		{
			"id": "5459d2dc-a05a-4305-b2f9-85c34388ba08",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": "Just ponder the list of possible suspects for one moment. I mean, uh, if fowl play is involved that is.",
			"time": 1565593146119,
			"files": "[]"
		},
		{
			"id": "452737b5-60b3-4723-bb85-a51197e3461e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2970c43e-de3c-45ee-a389-439d01e7086e",
			"body": ">>a31505ca-3b94-44d7-8567-136a058d14b2\nNo, don’t be an idiot. Just relax and keep shitposting as more and more decentralized distributed means become available.\n\n>>863ea4f5-05c5-4675-abe2-3cdce341e3df\nYou know why.",
			"time": 1565594113099,
			"files": "[]"
		},
		{
			"id": "1d0a0e0d-2b4e-4f2b-8542-7b907b19dcdf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2a5277c0-7988-4d49-91ea-5fb830dfdd35",
			"subject": "sage",
			"body": ">literally snitched to the FBI on his whole organization on a regular basis",
			"time": 1565595491875,
			"files": "[]"
		},
		{
			"id": "4049f9a2-5727-40f6-a712-46752828ed0d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": ">>794b8cc2-d647-44c4-ae93-7ad867b0b02b\nYou mean Satan, right?",
			"time": 1565640276300,
			"files": "[]"
		},
		{
			"id": "27ce0865-85b0-43dc-9736-bb0a44a7ebbe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ab5b9974-e84e-4103-a828-6caa276cae54",
			"body": "[M]",
			"time": 1565677780119,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}