{
	"next_comment_id": 15,
	"comment": [
		{
			"comment_id": 1,
			"body": "@nofish that's a problem with the plugin, not the links. /siteaddress/... is the correct format.",
			"post_id": 71,
			"date_added": 1461950947
		},
		{
			"comment_id": 2,
			"body": "Not everyone runs 0net on localhost:43110. Assuming that breaks people not using the plugin.",
			"post_id": 71,
			"date_added": 1461951277
		},
		{
			"comment_id": 3,
			"body": "I find it hard to believe the plugin cannot figure out absolute URLs. If it's not possible to write an extension in Chrome that can do that, then you need to find a better browser.",
			"post_id": 71,
			"date_added": 1461951329
		},
		{
			"comment_id": 4,
			"body": "@nofish Only if you use the plugin.",
			"post_id": 71,
			"date_added": 1461951357
		},
		{
			"comment_id": 5,
			"body": "Use Firefox?",
			"post_id": 71,
			"date_added": 1461951372
		},
		{
			"comment_id": 6,
			"body": "@nofish Oh, you're right. Is it the ZeroNet frame doing the conversion or ZeroBlog? Either way, kind of hacky.",
			"post_id": 71,
			"date_added": 1461951605
		},
		{
			"comment_id": 7,
			"body": "I'm finding Twister a lot less useful since I started using ZN as well. Not going to trust ZeroMail or mail.zeroverse.net though because of how they work. And Tox is probably better for chat. ZN is definitely better for (micro-)blogging than Twister.",
			"post_id": 2,
			"date_added": 1461951854
		},
		{
			"comment_id": 8,
			"body": "For (2) what's wrong with ZeroTalk?",
			"post_id": 2,
			"date_added": 1461951946
		},
		{
			"comment_id": 9,
			"body": "> [redacted](#comment_8_1QQggeZo72jptq7AvVQbrQKXZetKzF5kj): For (2) what's wrong with ZeroTalk?\n\nOr rather (3).",
			"post_id": 2,
			"date_added": 1461952009
		},
		{
			"comment_id": 10,
			"body": "Being \"official\" doesn't make it correct. I can't think of a better hack off the top of my head, though. I still see no reason relative URLs shouldn't work, since the site is \"officially\" always the first path segment, and the root is \"officially\" always http://127.0.0.1:43110/.  At least it gives you a unique string to match in URLs, though.",
			"post_id": 71,
			"date_added": 1461952454
		},
		{
			"comment_id": 11,
			"body": "@anoni2p Twister has tons of JS, what do you mean? You mean JS from other users, not just the app?",
			"post_id": 2,
			"date_added": 1461965155
		},
		{
			"comment_id": 12,
			"body": "There is no secure way to allow JavaScript without the frame. XSS galore. Maybe if ZeroNet were implemented using a proxy so different sites show up as different origins.\n\nAs for Python, that is simply a nonsense criticism. If you aren't willing to contribute because it's Python, you're probably not someone who should be contributing anyway.",
			"post_id": 71,
			"date_added": 1462061531
		},
		{
			"comment_id": 13,
			"body": "What we need is some kind of transpiler that can take JS written for the regular web and make it call the right ZeroNet APIs.",
			"post_id": 71,
			"date_added": 1462062506
		},
		{
			"comment_id": 14,
			"body": "@petercxy Obviously you can't do it for any backend processing that's going on, but I don't think that's what @kaffie and @up4 were complaining about. The problem is that all the JS is running in a sandbox and has no access to the outside world at all except (potentially) through calls to code running in the ZeroFrame. A transpiler could, say, rewrite XHR calls to call a compatible API in the ZeroFrame that would make the call on the sandboxed code's behalf and apply any necessary security checks.",
			"post_id": 71,
			"date_added": 1462128115
		}
	],
	"comment_vote": {},
	"post_vote": {
		"69": 1
	}
}