{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1605473599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 1,
				"body": "> [1snwargdtitor](#comment_3_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh): I definitely don't disprove or approve of any theories. They all intrigue me equally. I just found it odd that me and my friends went through some strange almost psychic shit right before this all broke loose. I do think this virus/pandemic was created or influenced by manmade technology though.\n\nCould have to so with the fact that we are also entering a new baktun cycle per the Myan Calendar. You are not alone in your report of such; many others also felt that psychic shift in some capacity, but everyone is tuned to a different frequency so to speak. It all has to do with vibrational energies of the universe. Hope that helps you understand what is going on a little better with regard to the spiritual and metaphysical aspect of things. I suggest doing some research also on how it all ties back to quantum mechanics if you have time.\n\nInteresting stuff; hidden knowledge; ancient wisdom; whatever you want to call it! ;-)",
				"added": 1605722643
			},
			{
				"comment_id": 6,
				"body": "> [jeff](#comment_67_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Well, that certainly explains it. [/sarc] [...]\n\nI take it you don't believe in God either right?",
				"added": 1606684420
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 2,
				"body": "\"Give a man a mask and he will tell you the truth.\" --Anonymous",
				"added": 1606152271
			}
		],
		"1605755443_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 3,
				"body": "Buy them on DeepWeb. Many DarkNet markets will be more than happy to supply. Use of Google Voice type services for verification may no longer work on some platforms though, and so then just find a vendor selling burner phones and topups.\n\nhttps://dark.fail/ is a good starting place.\n\nHave fun being free now.",
				"added": 1606152494
			}
		],
		"1606533306_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 4,
				"body": "> [transcoder](#comment_5_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): imagine thinking that one can regulate self hosted blockchains. i mean sure it can happen to a degree but so many will slip through the cracks. i know they'll eventually try to ban crypto altogether along with E2EE however that's only going to make the foundations move to other countries and also force crypto underground\n\nI have been saying this for a while, and I doubt anything actually comes of it to be honest. \n\nNot overly concerned for the reasons you mentioned. All regulations do to goods is drive up their price and create a black market. Learned that one in a college ECON Class lol. Its simple.",
				"added": 1606683984
			}
		],
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 5,
				"body": "> [sj29msn5kz0ldmn](#comment_8_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): i was sometimes wondering this, if I use tor, why not use google? probable reasons: [...]\n\nYes, even StartPage has begun limiting me when I use Tor now. Google was first to do that. Can't even get around it with a Captcha. I have yet to find a Sear instance that does this and the results are better than any other provider too.\n\nI just explored all other options I had not that were proposed here and they are pretty lame imo.\n\nSearX is the clearcut winner to me.",
				"added": 1606684255
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 7,
				"body": "> [freemankind](#comment_50_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): i know its not social mediabut selling and buying on a ebay alternative is just as important [...]\n\nYes! OpenBazaar is very useful to keep prices on goods low, but lacks widespread user adoption.\n\nSo, please do join!",
				"added": 1606684531
			},
			{
				"comment_id": 8,
				"body": "Diaspora, Mastodon, PeerTube, BitTube",
				"added": 1606684625
			}
		],
		"1605473599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "> [mxh69420](#comment_13_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): i aint worried about him. if the dems in office were able to slow donald trump down, the reps can slow joe biden down.\n\nCorrect, but unfortunately Republicans will have to try twice as hard to get back in power. \n\nThen fix any fuckups Biden is sure to make which is plenty more work than even Obama could create I am sure. Not fun for them, so avoid if possible especially since they obviously cheated.",
				"added": 1606684756
			}
		],
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 10,
				"body": "Probably not. At least not in the traditional sense. I mean government trolls lurk here. Israel has entire sections of their government dedicated to trolling people ALL over the internet. So, at best the mainstream people may do similar to try to get people to join their Hidden Service at best. But, the market share is kinda small and the legal challenges would be great. So, I doubt it really.",
				"added": 1606684953
			}
		]
	},
	"comment_vote": {
		"2_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"19_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": 1,
		"47_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"11_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU": 1,
		"2708_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"14_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"1_1KnGxS2ij8nfG2qxbrQ6Xz91nBU7XGCYri": 1,
		"43_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"546_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1202_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1200_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"19_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"6_1N2VV3mbu9KLbSxTpedj9JvaQ51v9vNEN3": 1,
		"174_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"32_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"48_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"55_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"51_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"498_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"15_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"23_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": 1,
		"5_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"5_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"8_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"53_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1211_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"57_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"50_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"42_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"3_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq": 1,
		"29_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1209_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"13_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"2_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib": 1,
		"32_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1
	}
}