{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1612074323,
			"title": "Cyberpunk (Not the game)",
			"body": "Anyone working on cool projects lately? I am building an environment sensor suite, that measures CO2, VOCs, and micro-particulate. I'd like to have that info show up on an armband computer, but that's for a different time. Tried to base it off a Pipboy, but that was a bulky hot mess of a project.",
			"added": 1612074322
		}
	],
	"topic_vote": {
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": 1,
		"1612124072_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": 1,
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 1,
				"body": "Highly suggest staying in \"Tor-only\" mode. I've also taken to muting seriously offensive people (I'm super anti-CP), which hopefully means that their content isn't hosted on my computer. If I'm wrong, someone please correct me. It's my first day on ZeroNet.",
				"added": 1612070420
			}
		],
		"1612074323_18MUc7bD3LDUQobuKHzmVeDeS4qE7wtoDe": [
			{
				"comment_id": 2,
				"body": "The area I live in doesn't have great air quality for large portions of the year. Many cars and MANY shipping vessels. When I enter the valley from the hills, the brown air that hovers above the city is appalling. That's what inspired the micro-particulate sensor. The CO2 and VOC sensor was inspired by my long history of jobs that have probably been shaving extra time off of my life with the chemicals that I have been exposed to. Plus, I just find micro controllers (Arduino) to be a lot of fun to tinker with, and I just love building useful things.",
				"added": 1612109252
			},
			{
				"comment_id": 3,
				"body": "> [kixun](#comment_8_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq): That's amazing, I would at least couple it with a mask tho with filtering.\n\nI have already built a PAPR (Powered Air-Purifying Respirator) device. It's a full-faced snorkel mask with the snorkel replaced with an CPAP hose that goes to a mattress inflating turbine belted around my waist. The intake of the turbine has a class 1 respirator cartridge sealed on.\n\nBecause those cartridges are now unfind-able, I'll be replacing that with a car HEPA filter and an in-line 3D printed activated charcoal filter.",
				"added": 1612136874
			},
			{
				"comment_id": 4,
				"body": "> [edgelordofdecent](#comment_789_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Trying to become Gordan Freeman as a Vault Dweller?\n\nI actually never played Half Life. Wasn't aware of a survivalist element to those games. Mostly I've just been exposed to a lot of bad stuff in my life, and I've grown paranoid of what it could eventually do to my brain and nervous system. And I love making things.",
				"added": 1612136961
			},
			{
				"comment_id": 5,
				"body": "> [millipool](#comment_1_14LbDZad7aREV6EPNph7RFFDyKeVGoN6dE): Whenever I'm in the mood for a dystopic future where mega corporations control humanity with electronic devices, I just take a walk around the house.\n\nThat's why we gotta build them ourselves! PiHole, OpenWRT, VPN, Tor, and build your own computer then run Linux on it! One project I have in the works is a GSM module I wanna tie into an RPi. That way I'll have a phone still, but I'll only be on the grid when I want to be. Get some IR emitters on a pair of glasses, headphones, or a hat and all of a sudden it's a little harder to track you. Especially if they're just using facial recognition algorithms. Depends on how smart the algorithms are written, and how often they get flashed so their \"weirdness tolerance\" gets set to a higher bar.",
				"added": 1612156884
			},
			{
				"comment_id": 6,
				"body": "> [kixun](#comment_10_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq): Then you may be interested in this ;) [...]\n\nI'm loving this podcast. Thanks!",
				"added": 1612240353
			}
		],
		"1612350176_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 7,
				"body": "Endorsed. Can't stand pedos. Cheers.",
				"added": 1612444318
			}
		],
		"1612926726_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": [
			{
				"comment_id": 8,
				"body": "I promise that (now muted, It's like whack-a-mole with these guys) weirdo isn't the norm here. Just copy their username, go to ZeroId and block them. Makes ZeroNet much nicer.\n\nWhat kind of coding do you do? I mostly do C, for Arduino microcontrollers, with a little Python, which I don't like. At least, I didn't like it for trying to interface with the Raspberry Pi's GPIO pins.",
				"added": 1612963650
			}
		],
		"1612901550_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 9,
				"body": "I am responding. It worked.",
				"added": 1612963700
			}
		]
	},
	"comment_vote": {
		"115_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"8_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": 1,
		"791_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"3_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"6_1LS3ur69MC9WP8UMjAHCWYdfopv39kEfaJ": 1,
		"1_16HW9UmVm6tcYT4F7yQk2MK9AMKodiWjXy": 1,
		"1_1EgsvDVQDh5zMqrtMUahG89FPxuVFiFEsu": 1,
		"1_14LbDZad7aREV6EPNph7RFFDyKeVGoN6dE": 1,
		"10_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": 1,
		"6_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1,
		"11_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": 1,
		"68_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"10_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"94_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1
	}
}