{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"1_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1,
		"23_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": 1,
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1,
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": 1,
		"2_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"3_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"4_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 1,
				"body": "> [halex](#comment_2_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): Bueno pues parece que por aquí ya no pasa ni el Tato : (\n\nTranquilo, yo te hago compañía. (Y seguro que otros curiosos también están por aquí merodeando...).",
				"added": 1518458867
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 2,
				"body": "Llegué hasta ZeroNet buscando información sobre el fallido proyecto de BitTorrent, Maelstrom.",
				"added": 1518459722
			}
		],
		"1_17g8CD8R8uWkumpgvXC9eLRr25LcGfUtnf": [
			{
				"comment_id": 3,
				"body": "Jamás.",
				"added": 1518983709
			}
		],
		"2_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 4,
				"body": "Todo lo que sea compartir me parece magnífico. Me gustaría ver más películas consideradas clásicas; ¡tengo muchas pendientes! ¡Ah!, y la posibilidad de escoger la pista de audio y subtítulos ya sería el no va más. Aunque quizás pida demasiado (no te lo tomes como una exigencia).",
				"added": 1518984077
			},
			{
				"comment_id": 6,
				"body": "> [halex](#comment_9_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): Hola. He puesto una peli nueva: \"Your Name\" (http://127.0.0.1:43110/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4/data/Your%20Name/index.html). Esta vez la he puesto a través del IFS (http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/). A ver si alguien la prueba y me dice qué tal va.\n\nFunciona perfecto. Normalmente prefiero el doblaje en versión original, aunque he de decir que el doblaje español suele estar más que bien, así que ningún problema. Con películas clásicas me refería a las de Studio Ghibli, por ejemplo. Creo que solo he visto El viaje de Chihiro, imagínate.\n\nBuen trabajo.\n\nP. S. Tengo filmes asiáticos difíciles de encontrar, sin apenas «seeders» en «trackers» de la clearnet. No estaría mal subirlos en algún sitio. ¿Cuál me recomiendas?",
				"added": 1519144262
			},
			{
				"comment_id": 7,
				"body": "> [halex](#comment_11_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): ¿Con asiáticos te refieres a anime? en cualquier caso subirlos al IFS que te he enlazado puede ser buena opción.\n\nNo, la verdad es que no veo demasiado anime, ¡aunque me gusta! Por ejemplo, 'Happy-Go-Lucky', de Tetsuya Nakashima me costó una barbaridad encontrarla; o 'So Much Rice', de Li Hongqi. Las subiré allí, entonces.\n\n'Your Name' me ha encantado, por cierto.",
				"added": 1519146499
			}
		],
		"5_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh": [
			{
				"comment_id": 5,
				"body": "¿No existe ninguna forma de reportar usuarios o contenido en este foro?",
				"added": 1519138787
			}
		],
		"3_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 8,
				"body": "> [halex](#comment_13_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): Si nos unimos podemos tener la mayor biblioteca de contenidos audiovisuales en español que nunca haya existido, a prueba de cierres y libre de publicidad.\n\nLa descentralización es la única vía transitable si queremos un Internet incensurable y verdaderamente nuestro. John Perry Barlow, en su breve manifiesto 'A Declaration of the Independence of Cyberspace' (1996), decía lo siguiente: «Governments of the Industrial World, you weary giants of flesh and steel, I come from Cyberspace, the new home of Mind. On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather». \n\nEstá en nuestras manos.",
				"added": 1519210960
			}
		],
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 9,
				"body": "> [jocantaro](#comment_1_1LtbtkTwmJCSWcVqcUvB38iRHT6D5vq1go): Saludos a los moradores de este arcano lugar. Uno más que se une.\n\n¡Bienvenido! Ponte cómodo.",
				"added": 1519644927
			}
		]
	},
	"comment_vote": {
		"2_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"4_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"3_1EqzMve3ZFTvmF8H2v2iebeLvcZJPnSbig": 1,
		"2_14oRN9CXoZQaS7Z59FDrDofnq9rCSz9SYv": 1,
		"10_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"5_1FCq5e9tk1Ttv3zo3cBApUDYsS9HyDorW6": 1,
		"5_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"7_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"9_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"1_18arkBiTNCaEEu3gcyw7CuZFEJdjBoqJh9": 1,
		"10_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"12_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"13_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"14_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"1_1LtbtkTwmJCSWcVqcUvB38iRHT6D5vq1go": 1,
		"17_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	}
}