{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1606679881_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1606679881_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "> [driud](#comment_121_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): @sj29msn5kz0ldmnInteligentni to oni byli, / czas przeszły /. Jest takie powiedzenie; \"każdy kij ma dwa końce\", Czyli jeden pomaga a drugi szkodzi, zachowanie równowagi jest ważne. Wracając do tematu; To co piszesz, masz całkowitą rację. Co można zrobić??? Trzeba za wszelką cenę uświadamiać swoich znajomych, muszą się nauczyć wprowadzać zmiany w swoim życiu. To jest pierwszy etap. Drugim etapem jest otwarcie swoich umysłów; Czyli zdjęcie założonej blokady, Te dwa etapy doprowadza do powstania trzeciego etapu; Samodzielne myślenie .Stworzenie tego etapu powoduje utratę kontroli nad Ludźmi. Człowiek staje się samodzielny, nieobliczalny, w dobrym tego słowa znaczeniu. Takiego człowieka nie można już kontrolować; Taki człowiek -ROBI TO CO CHCE-Można go tylko zabić,;  Jasna sprawa, nikt nie chce być zabity? Powstaje pytanie, jak żyć? Trzeba się zamaskować, ukryć, zakamuflować, stać się niewidzialnym; Trzeba zacząć nauczać innych ludzi, trzeba to robić dyskretnie, w tym momencie komunikacja, staje się ważnym elementem. Tak naprawdę niema bezpiecznej komunikacjiA może jednak coś jest??? Tego uczy nas Historia; Prywatne spotkania przy herbatce?-WAŻNE- bez telefonuTa wiedza wystarczy aby postawić pierwsze fundamenty, na których powstaną nowe struktury Wiedzy,  czytaj                             / władzy /. Taka komórka kilku osobowa, może zrobić bardzo wiele. Może stawić świadomy opór, i świadome wsparcie. Powstanie mała , niezależna struktura, odporna na wszystkie zakusy przeciwnika. To jest początek tej długiej drogi.Pozdr.\n\nBardzo dobrze mówione!\n\nMoi przyjaciele i ja robimy wszystko, co w naszej mocy, aby uświadomić ludziom prawdę, ale to wszystko, co każdy może zrobić. Mamy też prywatne spotkania, o których pan wspomniał. Nie są one prawie tak technologicznie skłonne, więc przekazuję im informacje o tym, co naprawdę dzieje się na świecie, który jest cenzurowany. Czuję się jednak źle, ponieważ jak powiedziałem, gdyby nie ja, to skąd oni naprawdę wiedzieliby dokładnie, co się dzieje?\n\nStaram się uczyć ludzi korzystać z komputerów, tak jak ja to robię, a bardzo nieliczni są w stanie dogłębnie zrozumieć to, co od razu wyjaśniam. Informacje, których uczę, zajmują mi miesiące, aby omówić je z większością ludzi poza tymi, którzy znają już podstawowe pojęcia tego, co wyjaśniam. Nauczenie kogoś nawet pierwszej rzeczy czasami jest obowiązkiem, ponieważ większość ludzi nie słyszała o Linuksie aż do ostatnich czasów, które znam osobiście. Dostają go, ale często są zniechęceni złożonością wszystkiego co robię aby zdobyć informacje i zachować swoją tożsamość przed byciem znanym. Więc jeszcze raz, gdyby nie ja, to czym stałaby się nasza grupa? Ich źródła informacji stałyby się tak ograniczone i choć być może nie uzyskaliby ich z głównego nurtu mediów, informacje, które by otrzymali, byłyby niepełne.\n\nW międzyczasie jest wielu innych, którzy nazywają grupy takimi jak nasi szaleni ludzie i tym podobne. Mówią, że nie jesteśmy wiarygodni, ponieważ ich telewizja nie powiedziała im o tym, ani o żadnej wymówce, która mogłaby im się przydać. Tak więc, rozumiem, co oboje z was tutaj naprawdę mówicie. To kwestia tego, ilu ludzi możemy zjednoczyć w naszej sprawie, aby przywrócić ludzkość do rozsądnego stylu życia. Jest zbyt wielu ludzi, którzy patrzą na złych przywódców i chcą widzieć tylko dobro, a nie prawdę. Jest to zniechęcające, ale proszę zawsze robić, co w naszej mocy!",
				"added": 1607294285
			}
		]
	},
	"comment_vote": {
		"8_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"9_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"121_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	}
}