{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Donald Trump is almost Destroyed …  金融海啸、美国崩溃，川普拼命了……",
			"body": "**Donald Trump is completely Destroyed …  \n金融海啸、美国崩溃，川普拼命了…… ** \n\n首先说明，这不是恶毒的诅咒，而是新冠病毒瘟疫造成的严酷现实太残酷，而特朗普对这个严酷现实一直视而不见，一心只想靠政治手段和商业手法欺骗社会， 让老百姓不要因为恐慌而造成金融市场崩溃，进而导致特朗普四年来开创的“经济奇迹”神话彻底毁灭！ \n\n当然，这也不是说，如果换成拜登，就会更好，相反，只会更糟糕，所以，美国面临的问题不是在两个恶劣的顶级政客之间挑选哪一个不是最坏，而是面临一场变革，甚至可能是革命 — 攸关政体运作，是能否维持联邦、如何维持联邦的问题，到底是美利坚合众国继续维持，还是美利坚独立州、分裂国各自为政，摆脱漠视人权、漠视生命的顶级政客对美国各个州的老百姓不断摧残的生存困境！\n\n## 川普这次既不是装病、也不是装死，而是真得要走向毁灭了。\n川普向外界传达信息，十月初就立刻会回到白宫，其实是在巧妙伪装，希望金融市场保持信心，不要因为恐慌而崩溃，但问题是，市场信心不会因为虚假的伪装而提振，去迎合曾经让川普得意忘形的“屡创历史新高”、 神仙般的“经济奇迹”！\n\n川普最大的优点是善于利用各种手段在商业竞争中击败对手；但最大的优点也必然伴随着最大的缺点。川普最致命的缺点是只关心经济、贸易层面的利益，漠视人权；假如没有瘟疫病毒，在一片娱乐至死的狂欢中，川普完全有能力通过各种手段，让美国股市不断创新高，并因此成为美国人心目中神一般的“英雄”。\n\n遗憾的是，新冠病毒可不是开玩笑。在2020年初，病毒席卷亚洲，然后蔓延欧洲，最终奔向美国。川普曾经采取铁腕措施，与中国断航之后，也与欧洲断航， 这些措施显得非常果断、英明，但是川普竟然因为担心病毒太危险，造成市场恐慌，破坏了他开创的“股市屡创新高”的历史奇迹，而采取荒唐的策略，不断跟美国人说新冠病毒只是普通流感，甚至连戴口罩都没必要。这种做法，无形中造成了与习近平联合破坏美国的结果，而这正是中南海最希望看到的结果。\n\n如今，\n##不只是股市“神话”破灭，甚至连川普的老命都因此而毁掉……  \n\n对于在美国生存的普通老百姓而言，在这个历史关头，有比较多闲置资金的人们，在新冠病毒瘟疫结束之前，尽量避免把过多资金投入股市，同时，在闲暇的时候，尽量多学习枪械使用、练习射击、提高射击技能，在即将来临的星球大变局，包括美国大变革的时代潮流中，生存下去，见证一个重视生命、推行普世原则的新文明重新诞生于美利坚国土！\n\n顺便说明，习明泽目前不便直接公开发言，处于非常尴尬的困境，既不希望看到美国彻底崩溃，也不希望看到习近平像伊朗的恐怖分子苏莱曼尼那样被斩首。\n以上见解是习明泽的哈佛校友代为整理、发布。\n\n至于\n##香港的时代革命\n既然香港人万众一心，有非常多的灵活策略，长期坚持抗争，为何不稍微调整一下，把“光复香港、时代革命”的战略口号稍微调整为“维护仲勋光辉、反对文革暴政；时代革命、光复中华” ??! \n维护仲勋光辉，反对文革暴政；就是以维护 习近平的 父亲 习仲勋的光辉历史形象为名义，公开反对文革暴政复辟，就变成了 维护习氏祖宗光辉 的爱国爱党运动，习氏的邪恶党徒爪牙们即使再无法无天，也很难公然破坏、污蔑维护习氏祖宗光辉 的爱国爱党运动！\n\n只要这么稍微调整一下, 就非常有利于促进大陆和香港的大规模良好运动。因为如此一来，大陆网民传播香港的抗争运动，也变成了 维护习氏祖宗光辉 的爱国爱党运动，将让 习氏的邪恶党徒爪牙们 进退两难，非常难以下手！",
			"added": 1601954978
		},
		{
			"topic_id": 2,
			"title": "An Open Letter by Awakened American to All Elected Officials in the United States Government",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt/An+Open+Letter+to+All+Elected+Officials+in+the+United+States+Government \n\nDear friends,\n\nThe following is an open letter I've written to our elected officials in the United States. If you are a citizen and feel as I do, feel free to forward and/or read this to your own elected officials as well as anyone else you think would be interested. By my reckoning, the more voices we have coming together on this, the faster they'll realize that the United States Constitution and the Rule of Law it establishes aren't going anywhere.\n\nAN OPEN LETTER TO ALL ELECTED OFFICIALS IN THE UNITED STATES GOVERNMENT\n\n\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed...\"\n\nTo those squatting unjustly in the elected offices of the United States of America (both local and federal) who refuse to duly represent your constituents and fulfill your oaths of office: I hold you in contempt of the United States Constitution and your oaths to uphold and defend it. Given that you have betrayed those oaths and the trust of the American people, defrauded the taxpayers of their just and honest earnings, and made tax slaves of those you fraudulently claim to represent, I hereby withdraw my Consent to be governed by the lot of you.\n\nWhen you can come together and reinstate the rule of law as established by the United States Constitution, I shall reinstate my Consent to be governed. Until then, do not expect my consent or complicity with any of your schemes.\n\n—  American Citizen Awakened Up \n\nRemarks:\n“The only thing necessary for the triumph of evil is for good men to do nothing.”\n- Edmund Burke \n邪惡盛行的唯一條件，是善良者的袖手旁觀。 — 埃德蒙·伯克 \n\nIt's good to see that more and more American people are awakened up, and take voluntary actions to demand fairness and justice on 2020 Election.",
			"added": 1605320399
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}