{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Blockstack: uma nova internet descentralizada",
			"body": "Blockstack é uma plataforma de computação descentralizada de código aberto. As bibliotecas de software Blockstack permitem que os desenvolvedores criem aplicativos descentralizados. O Blockstack fornece protocolos descentralizados para autenticação, armazenamento de dados e distribuição de software.\n\n- https://blockstack.org/\n- https://github.com/blockstack",
			"added": 1578233846
		},
		{
			"topic_id": 2,
			"title": "Chineses criam papel à prova de água e de fogo",
			"body": "Mais de dois milênios depois de terem inventado o papel, os chineses aperfeiçoaram sua criação, tornando-a resistente à água e ao fogo.\n\nPesquisadores do Instituto de Cerâmica de Xangai desenvolveram um papel que pode ser lavado sem ter o texto escrito nele danificado, além de suportar um calor de mais de 200°C sem se queimar.\n\nYing-Jie Zhu, um dos responsáveis pelo projeto, disse que, embora já existam papéis que possam resistir a esses elementos, nenhum deles agrupa as duas características simultaneamente.\n\nO novo papel superresistente é capaz de repelir não apenas a água, mas também outros líquidos como café, suco, chá e até mostarda e ketchup.\n\n\n\n- https://open.lbry.com/Papel-que-no-molha-e-que-no-queima:6\n- https://sci-hub.tw/10.1021/acsami.6b12838",
			"added": 1578267165
		}
	],
	"topic_vote": {
		"1_14fjqt4UgRXk2nfhPzj6Gd7k64VjpemjWM": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"2_14fjqt4UgRXk2nfhPzj6Gd7k64VjpemjWM": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 1,
				"body": "#Blockstack: uma nova internet descentralizada\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_14fjqt4UgRXk2nfhPzj6Gd7k64VjpemjWM/Blockstack+uma+nova+internet+descentralizada",
				"added": 1578248807
			},
			{
				"comment_id": 2,
				"body": "#Spee.ch\nO spee.ch fornece um site de hospedagem de imagem e vídeo fácil de usar e personalizado, apoiado por uma rede e blockchain descentralizada [(LBRY)](https://lbry.com/). Por meio de apenas um pequeno conjunto de arquivos de configuração, você pode fazer o backup de todo o site spee.ch, incluindo ativos.\n- https://spee.ch/\n- https://github.com/lbryio/spee.ch.git",
				"added": 1578249027
			},
			{
				"comment_id": 3,
				"body": "Uma visão geral dos aplicativos e plataformas descentralizadas de código aberto existentes para redes sociais, engajamento e colaboração\n- https://github.com/2gatherproject/decentralized-social-apps-guide.git",
				"added": 1578249209
			},
			{
				"comment_id": 4,
				"body": "#Seus velhos HDs e a descentralização da internet\n\nRecentemente quando falei sobre a [tentativa do governo russo de censurar o Telegram](https://www.hashinvest.com.br/single-post/2019/08/22/o-que-o-telegram-tem-para-ensinar-as-moedas-digitais) (aplicativo de mensagem), comentei que alguns pontos centralizadores da internet facilitaram a retirada do serviço do ar, mesmo que temporariamente. Bem a verdade, a centralização da internet hoje é gigantesca: áreas como computação em nuvem possuem três ou quatro provedores que dão as cartas.\n\nUm dos principais serviços prestados pelas grandes deste setor, como Microsoft, Google e Amazon, é o armazenamento de dados. Como companhias e pessoas geram hoje quantidades absurdas de registros digitais, a demanda por este tipo de serviço é gigantesca.\n\nEsta tercerização da guarda de informações apesar de conveniente, vem também acompanhada de riscos. Um caso que ganhou fama foi a influência da empresa de consultoria política Cambridge Analytica nas últimas eleições americanas. Supostamente foram utilizados os dados privados do Facebook de milhões de pessoas sem consentimento para ajudar na eleição de Donald Trump. Apesar das palavras “Facebook” e “privado” ficarem estranhas numa mesma frase, esse exemplo mostra como uma grande quantidade de dados concentradas nas mãos de alguns players pode ser extremamente perigosa.\n\nO blockchain, tecnologia por trás das criptomoedas, é naturalmente descentralizada e existem sim algumas aplicações que focam no armazenamento de dados. Há, contudo, algumas diferenças relevantes na forma como o blockchain é usado em cada uma destas duas situações.\n\nPor exemplo, no caso das criptomoedas, os registros são armazenados no próprio blockchain. Isto quer dizer que todas as informações sobre cada umas transações ficam guardadas nos próprios blocos que formam o blockchain. No entanto, isto não seria viável em uma aplicação para o armazenamento de arquivos maiores. O impedimento neste caso está relacionado à estrutra da tecnologia: no blockchain os nós sincronizados a uma rede devem possuir uma cópia dos registros. Assim, no caso de armazenamento de arquivos cada nó teria que guardar localmente cada um dos registros e, consequentemente, precisaria de uma capacidade gigantesca de arquivamento para tanto.\n\nPara evitar este problema que encareceria a utilização do serviço, a alternativa encontrada foi não guardar filmes, músicas, fotos etc em blockchain, e sim, conservar somente uma prova de autenticidade. Como esta prova de autenticidade é pequena em relação ao tamanho dos arquivos, muito espaço é economizado.\n\nMas então, onde ficariam guardados os arquivos se o blockchain só teria essa prova de autenticidade? A solução encontrada por serviços de armazenamento descentralizado, como [Sia](https://sia.tech/) ou [Storj](https://storj.io/), foi permitir que pessoas comuns aluguem seus HDs com esse fim. Isso mesmo. Se você tiver um HD que não usa, pode ser remunerado por guardar os registros de outras pessoas. A grande sacada destes serviços foi perceber que não poderiam competir com as gigantes do setor se tivessem que fornecer os meios físicos para o armazenamento, o que também comprometeria à descentralização da rede.\n\nEntão, vamos supor que você tenha gostado desta ideia de usar blockchain para guardar seus dados. Como funcionaria o fluxo de trabalho?\n\nPrimeiramente, você contrataria a disponibilidade de um certo espaço (50 GB por exemplo) no mercado digital em que estes serviços são ofertados. Depois, quando você fizesse o upload de seus arquivos, estes seriam particionados, criptografados, duplicados e espalhados por diversas máquinas de pessoas que resolveram alugar seus HDs. Em seguida, uma prova de autenticidade seria salva em blockchain.\n\nAlguns pontos aqui são importantes de se explicar. A duplicação dos pedaços dos arquivos, por exemplo, garante que mesmo que alguns provedores fiquem offline, você ainda tenha acesso a suas coisas. A criptografia, por sua vez, impede que quem recebeu seus arquivos acesse o conteúdo e possa, por exemplo, influenciar eleições. Por fim, o blockchain garante que ninguém alterou/corrompeu o que é seu. Com isso, simples HDs de uso pessoal podem ajudar na descentralização da internet e diminuir a influência das grandes corporações, graças é claro a tecnologia do blockchain.\n\n- Fonte: https://www.hashinvest.com.br/single-post/2019/09/27/seus-velhos-hds-e-a-descentralizacao-da-internet",
				"added": 1578265940
			}
		]
	},
	"comment_vote": {}
}