{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_16k9pNCerEdsZvWU82HMesThKFo9fofRfz": [
			{
				"comment_id": 1,
				"body": "> [hotdog](#comment_1_18eNH913qX7e9vBExuMiv7qAMSRkJYNa21): watch your back nazi. my grandpa killed your kind in wwii, i hope i do the same soon\n\nWhy did he do that? So he could have niggers in his country raping his granddaughter? Doesnt make any sense unless you are a jew.",
				"added": 1467467760
			},
			{
				"comment_id": 2,
				"body": "Sieg Heil.\nWell, id like to see two sites on zeronet:  1. Stormtube 2. Zerofront. The first is a Video hosting platform, the second a discussion board.",
				"added": 1467467851
			},
			{
				"comment_id": 3,
				"body": "gas the kikes. racewar now!",
				"added": 1467468054
			}
		],
		"5_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 4,
				"body": "GNU Icecat. It comes loaded with all kinds of \"muh free software\" bloatware though. blocking unfree javascript and so on. But once you get rid of that is like firefox without the mozilla-bloat.",
				"added": 1467468215
			},
			{
				"comment_id": 10,
				"body": "Chrome/Chromium, for Desktop.\nBecaus it has a nice clean interface and you can easily switch profiles. Also the bookmarkbar that disappears once you load a page is nice. I tried to make Firefox behave and look more like Chrome, but it didnt really work.\n\nFirefox/Icecat for Android.\nBecause Chrome for Android is just too minimalistic, i want to be able to have extensions and i want to edit my search engine to allways-google-dot-com so i dont get censored search results. Also the reading view in Firefox is nice and i like the firefox interface on android better than the chrome one.",
				"added": 1474123003
			}
		],
		"4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 5,
				"body": "Death now costs me [expected-lifetime] minus [age] amount of life years. \nWith [expected-lifetime] going up, the price of death goes up, so i would be more careful and try to avoid danger.",
				"added": 1467554488
			}
		],
		"2_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 6,
				"body": "1. law enforcement and bad guys are not mutually exclusive. \n2. the somewhat intelligent bad guys use some kind of secrecy wether its a standard or not, so encryption by default doesnt affect the bad guys. \n\n\nUnless of course \"Bad guys\" are really stupid and/or a socket puppet of some intelligence agency. \nFor example you have \"ISIS\" using telegram. Even if the \"secret chat\" does its job, the app still copies your phonebook with all names included (not even whatsapp does that) and still offers you the tempting \"Normal chat\" which is stored in plain text in the cloud on some US/UK Servers. But then again \"ISIS\" is obviously a bunch of low-iq ragheads under Israeli/US guidance. So they dont count.",
				"added": 1467555228
			}
		],
		"1_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 7,
				"body": "In Germany they now put about 2-4 \"securities\" on each train. You can ramp that number up as high as you want. The Government will have people wear shirts with \"Security\" written on it and let them walk in circles before worktime gets reduced. If necessary, import more \"refugees\" so you need more \"securites\" to keep them from raping.",
				"added": 1467555705
			}
		],
		"1_1B7ef4NZMcDZm74M6CjkoztZAGKeCdaQfS": [
			{
				"comment_id": 8,
				"body": "> [cudam](#comment_1_1MBZrgSwMQMRnMFjQkw2JpwdWRaKo7Eb55): Whats the problem with jews,? I dont think all of them are all \"human shit\"\n> And dishonest with the holohoax? Can someone explain me? I dont think the did tons of money of it, also all people who die? Not only jews. As example, spanish people who ranaway of a dictatorship was forced to work until they die...\n> Not only jews have money and  live because who is suffering...\n\nIf they arent shit they cant be jews. Being shit is what their god commands them to be.\nBeing a jew that isnt shit is like being a vegetarian that eats meat.",
				"added": 1474122390
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 9,
				"body": "> [nippletwister](#comment_13_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Does anyone know a software to delete spying tools from Windows 7?I did not plan to use Win 10 anyway, but need Win 7 for work.\n\nBest thing you can do is isolate it in a virtual machine and only use it for what you need to use it for.\nYou can also just use it offline and then access your work results from the host machine in a shared folder.",
				"added": 1474122546
			}
		]
	},
	"comment_vote": {}
}