{
	"title": "反思一切",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1482141838,
	"post": [
		{
			"post_id": 5,
			"title": "喝再毒的水，我也不会拿国家开玩笑",
			"date_published": 1481820017.216,
			"body": "“中国”这个词，让很多人愿意赴汤蹈火也在所不惜，甚至搭上所有所爱之人的命也不退缩，为了心中的那份无以言明的满足感，自豪感，荣誉感.....各种感吧（也许有其他收获，我无从知道。）比如面对：喝再毒的水，吃再毒的食品，再严重的雾霭，更严重的污染，我都不会拿国家开玩笑。这个国家也许在他的心目中是无比圣洁的，盲目圣洁到可以为此抛弃一切，一切随缘。但就是不能讽刺，侮辱我心中的“中国”。\n\n此类人是很可怕的存在，他们活在自己扭曲的幻想里，为了满足幻想可以视而不见，可以无所谓，可以如此冷漠，可以如此残忍。他们不知道爱为何物，不知责任是什么东西，不知道公正是什么玩意儿。这类人适合被宗教吸收，很容易操控，只要你能满足他的幻想。\n\n人活着的意义是什么？是这篇文章里，我不得不说的一个话题，当然很多人有很多解读，每个人的意义也许各不相同，甚至也有无意义存在。那些活在当下的人，不必探讨人生的意义，因此这与他/她无关;那些思考过去，展望未来的人，人生的意义是不可逃避的思考。我对此谈谈自己的感受和认知，因为我无法判断别人的想法。\n\n传统文化里，我们大都是带着使命出生的，因为父母一般都为了养儿防老，传宗接代等目的才要的你。顾在我们的生活里缺乏爱的引导，大都套在实用主义的逻辑陷阱里。但在青少年时期，我们也会有一种状态，就是轻生的念头，当初我用自己的逻辑解决了这个问题：我不能活的太自私，因为我还有爱的人，我不是在为我而活，也是在为他们而活，这样的念头，让我顺利的度过这段时期。若用实用主义来引导，恐怕就是那句：天生我才必有用了。\n\n因为有了这份爱，我们需要关心我们所爱，并且爱自己才能去爱别人，因此我们关心生活，关心政治，关心经济，关心环境，关心食物，关心空气，关心土地，关心水，关心气候。。。。。我们有很多很多要关心的，因为这是我们的责任。爱是付出而不是索取，但爱是为了索取，不过我建议不要在这个环节上太过纠结，否则可能面临不太好的心里体验，甚至会有不好的后果。\n\n那么我也要“爱国”么？对我来讲，我为什么要爱？它是否值得我爱？爱它我要付出什么？爱它我能获得什么？这是需要我搞清楚的地方，再说了，对有些人来讲，国是可以变的，移民就是了。爱或不爱，移民还是留下，都是可以选择的，至少可以在心里做选择。否则你又进陷阱了。\n\n为什么爱：假如我爱上一个姑娘，那么她一定有吸引我的地方。那么国呢？中国哪里吸引了你？这是你心里要回答的问题。\n值得爱么：看上一个姑娘，也许只是外表你喜欢，但内在才是回答值得爱不的部分？国呢，内在是什么？文化，价值观，法律，政治，经济，食品，空气，土地，人道等等，每个人标准不同，好好想想吧。\n爱它我要付出什么：你能付出的有思想，精神，方法，体力，亲朋，金钱，生命等等，当你爱它需要生命的时候，你如何选择呢？当你爱它需要你的亲人的生命的时候呢？需要你和亲朋付出健康的代价呢？\n爱它你能获得什么：你能得到安全感么？你能得到健康么？你能得到土地么？你能得到公正么？。。。。。你能的到什么？\n\n你说，我啥都无所谓，我就是爱，可以，你可以如此选择。我们不是不缺乏愚忠的文化嘛。我只是希望有些人能够想明白这些，然后作出你的选择。\n\n下面还有一个视角要说的，什么是爱国？愚忠们觉得讽刺，侮辱就不是爱了，你就狼子野心了。事实上，不是那不是爱，而是你们的内心太脆弱了，看不到那也是爱。正面，正能量，夸赞，表扬，并没有让你的生活好到哪里去吧？至少你也没少吸雾霭吧？没少被歧视吧？若想带来正面的改善，唯有充分的盯住负能量才有可能获得，到了我们该走出思维陷阱的时候了。\n\n国家是什么？很多常说：国家的钱。那么国家的钱是谁的钱？难道你是中国人，所以钱就是你的么？别做中国梦了，这个问题留给你自己思考。\n\n不想多说了，写太多会有人看不下去，简短为王。下次见！"
		},
		{
			"post_id": 4,
			"title": "成都雾霭之卑鄙",
			"date_published": 1481543255.787,
			"body": "四川盆地这个坑持续了多日的严重雾霭，让感觉到“疼”了的人们开始用自己的方式表达抗议和不满。从流出的信息来看，我们完全有理由相信，D国政府不是来解决问题的，他们的应对策略就是：封，堵，控，压。也充分地说明共产党是一个邪教组织。\n\n印刷，药店等要登记身份证;各企事业单位要求员工不上街;学校不可带口罩，不可拍照，不可安装空气净化机,即使装了的也要拆除;医院不允许说疾病是雾霭引起;带口罩不能坐路边;烧烤摊被要求停止营业; 有人去拍彭州石化的视频，作为证据，结果被警察抓了。所有的一切，说明了什么？难道还能证明伟光正么？我可以伤害你，但你不能保护自己，再说了你拿什么保护自己？"
		},
		{
			"post_id": 3,
			"title": "裸贷门事件之我胡思乱想",
			"date_published": 1481427524.263,
			"body": "首先，对参与裸贷的女性们，我没任何道德上的评判，也不觉得你们是做了一件多么不堪的事情。只是在做这件事之前，你是否做好了付出什么样代价的心理准备，若有准备，it's ok，your choice ，若没有，那么就可能要为自己的单纯与“我以为”买单了，这就是人生的风险之一。\n\n我知道裸贷之后数日，在新浪和朋友圈真是风平浪静，没有看到任何有关此事的消息和文章。不知道是突然国人的境界高了，还是我们的信息封锁太给力了。今年某时听朋友们讨论过，贷款行业恶化到也给大学生提供短期小额贷款了（朋友公司的贷款是否也参与了裸贷，我无从知道，这也不是我要说的内容），说只要学生的父母能联系到任何一个，都可以贷款，且不说此种放款的风险之大，单单考虑学生的收入就不可能放贷了。不过目前暴露出来的黑幕，不禁让我脑洞大开。\n\n对贷款公司的贷款脉络我来胡思乱想一下：贷款大都是抵押贷款，但当你没有抵押物也想贷款，这些公司找到了一条可操作的路径——裸贷抵押，用“无形资产”也能贷款。下面我们先简单分析一下流出的裸贷信息（我没有全部看完），从职业看，有学生，也有社会工作者，甚至也有不错的职业，从年龄看80后，90后，甚至是00前后出生的女性，从贷款金额看，1000-8000不等，也有少部分贷款10W的，从还款周期看2周到6个月不等，从逾期条款来看，逾期一天加收本金的20%，预期两天加收本金的30%，尽管本金不多，但对于这些女性来讲，也未必少了。\n\n其中，逾期条款是如何计算的，你们是否真的清楚贷款公司的盘算，你们的合约里我想是模糊的，同时解释权又是贷款公司的。你们就这样糊里糊涂地跳进了陷阱。无法还，怎么办？借钱？已经几千块都要贷款了，还能如何借？肉偿是大部分的被迫选择吧。那么你要肉偿多久才能还清？！只有你和贷款公司之间才清楚了。就算这次还清了，还会有下次么？我不知道。\n\n所以，我们来胡思乱想一下。未来，天朝将是贷款公司经营下的性工作产业的天下。给银行打工，也要给贷款公司打工。再进一步设想，性病增多，妇科病增多，生育能力下降……及其他社会问题。\n\n经济下滑，资金总要找投资出口的。这样的贷款行为的出现，也是畸形经济下的产物。我唯有希望妹纸们能保护好自己，这不是你们的屈辱，而是社会的屈辱。我救不了你们，唯一能救你们的本是政府的职责，而对现在的政府来讲，他们在忙于自救，顾不到你们啊，别幻想了。前路漫漫，并非坦途，望珍重！\n"
		},
		{
			"post_id": 2,
			"title": "马恩主义不会告诉你的那些事儿",
			"date_published": 1481426889.18,
			"body": "\n回忆从学经历，一直陪伴的就是政治课。并且众所周知的原因，我们的学习都是灌输式的，不需要思考，死记硬背就够了。以致后来大约从高中起，考试前看一下要点，考试的时候就知道如何瞎编了，庆幸的是十有八九还能顺利完成考试，甚至还能拿高分。\n因此作为学生，政治这东西我们思考的很少很少，对它的关注也不会上心，更多的时候，我们都是活在自己的幻想里：我们的社会，国家多么的牛逼和美好啊（只说好的，对阴暗莫不关心）。然而在牛逼、美好的表象下，我们的生活越来越糟(对这点有些人会有不同的感受，不抬杠)，日益感受到随处可见的不公正，不作为，耍流氓，充斥着各种不安全感。下面我来胡思乱想一下马恩思想是如何带给我们这些的：\n马恩思想的陷阱，是被执政党鼓吹了几十年的东西，也是它让我们走到了今天的地步（当然还有文化等因素，但不在本文的讨论范畴，以后有心情再继续胡思乱想）。当初在我们的课本里，黑资本主义的那些条款，其实在大陆都实现了，并且比条款本身的描述黑多了（不信的可以去找到学校课本去比对）。一个生活在仅从大陆媒体获取的信息的人，对海外的认知是很官方的，也总是能得出我们的生活多美好的幻觉。\n一、共产主义：实现的时候物质极大丰富，人人都可以得到，你要飞机么？你要坦克么？你要轮船么？你要美女么？你有土地么？地球资源够你要的么？这是个骗局啊，亲！\n二、唯物与唯心，用唯物否定唯心：我那时从没有想过这有什么问题。直到大学毕业后与一个女同学一聊天的时候，我的唯物观让对方产生了反感，对方送给我一句很唯心的话，我才开始重新认识这个世界。并最终通过自己的思考，还原了世界的真相。唯物和唯心都是客观的存在，在一定的范围内都有其作用，谁都不能否定谁。当然，马恩如此解读是为了后面的教程——辩证法。\n三、辩证法：对于这个问题，有人做过很详细透彻的分析，我就不多说了，总之它是一个不能解决任何问题，最终能把人弄成傻逼的东西，远离思维陷阱保平安。\n四、马恩的经济学：片面的告诉你，剥削你的是资本家，剥削你的剩余价值，以此来让你对资本家充满憎恨。貌似世界是由无产阶级和资本家组成的似的，支那人信了，也悲剧了。TMD，突然发现，除了资本家会剥削你，ZF剥削比资本家狠多了，至少资本家没有权力，有权力的流氓才是最大的王八蛋，并造成巨大破坏和不公正。世界是由人们+资本家+政府组成的，事实上所谓的剥削，也不是资本家导致的，而是政府不作为才会造成的结果（有异议不抬杠哈）。经济在于分配的公正，而政府的存在就是为了这样的目的，但不受约束的权力，就会想一切办法去搞权利寻租，并且因为权力的存在，可以压迫人们和资本家，甚至以法律的名义。以大陆地区的房地产为例，税收在50～90%之间（郎咸平），可想，资本家在10～50%的空间里一样可以挣的盆满瓶满的，而一般的工作人员呢？分配的不公正，导致的一系列众多的问题。那么政府的税收又是如何分配的呢？有兴趣的自己想吧，不想说了。记住：你消费的每一分钱，都有50%以上的官方的腐败+税收。\n本人第一次写这样的文章，警醒者可以略过。而那些似醒非醒，有独立思考能力并愿意醒来的人，希望我的几段胡思乱想能给你带来抛砖引玉的作用。\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}