{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 24,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "Dragon Ball Z - Episodio 061 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588242229_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1588242315
			},
			{
				"comment_id": 2,
				"body": "Dragon Ball Z - Episodio 062 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588469112_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1588469679
			},
			{
				"comment_id": 3,
				"body": "Dragon Ball Z - Episodio 063 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588578015_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1588578055
			},
			{
				"comment_id": 4,
				"body": "Dragon Ball Z - Episodio 064 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588657254_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1588657372
			},
			{
				"comment_id": 6,
				"body": "Dragon Ball Z - Episodio 065 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588832824_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1588832871
			},
			{
				"comment_id": 7,
				"body": "Dragon Ball Z - Episodio 066 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589029230_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589029296
			},
			{
				"comment_id": 8,
				"body": "Dragon Ball Z - Episodio 067 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589051027_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589051103
			},
			{
				"comment_id": 11,
				"body": "Justice League Dark Apokolips War (Liga da Justiça Sombria Guerra de Apokolips) 2020 Leg\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589319322_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ|\n\nSinopse: O filme-animado é uma sequência de Liga da Justiça Sombria, animação de 2017 com classificação para maiores. Na trama, Batman reunia um grupo de heróis mágicos para lidar com ameaças sobrenaturais. Entre a galeria de heróis da Liga da Justiça Sombria, temos Constantine, Monstro do Pântano, Zatanna, Etrigan, entre outros. É aguardado a aparição de alguns personagens como Darkseid, as Fúrias e até mesmo o Pai Celestial.",
				"added": 1589319736
			},
			{
				"comment_id": 13,
				"body": "Dragon Ball Z - Episodio 068 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589616852_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589617014
			},
			{
				"comment_id": 14,
				"body": "Dragon Ball Z - Episodio 069 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589771956_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589772014
			},
			{
				"comment_id": 16,
				"body": "Dragon Ball Z - Episodio 070 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589874942_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589875002
			},
			{
				"comment_id": 17,
				"body": "Dragon Ball Z - Episodio 071 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589883562_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1589883616
			},
			{
				"comment_id": 21,
				"body": "Dragon Ball Z - Episodio 073 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1590842816_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1590842938
			},
			{
				"comment_id": 22,
				"body": "Os Simpsons S02E21 Três Homens e um Gibi Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1590854121_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1590854245
			},
			{
				"comment_id": 23,
				"body": "Naruto Classico 61 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1590950700_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ",
				"added": 1590950786
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "Stallone - Cobra 1986 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588722766_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: Policial (Sylvester Stallone) se empenha ao máximo para proteger uma bela modelo (Brigitte Nielsen), que se tornou alvo de uma seita que mata as pessoas sem nenhum motivo aparente.",
				"added": 1588722908
			},
			{
				"comment_id": 9,
				"body": "Equilibrium 2002 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589165052_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: Na nação Líbria há sempre paz entre os homens. O sistema é simples: neste mundo futurista um regime severo e rigoroso eliminou a guerra suprimindo todas as emoções. Ler livros, ouvir música e ver quadros é um crime punível inclusive com a pena de morte. Quem é feliz é preso, e quem chora, perseguido. E quem não tomar a dose diária de Prozium, uma droga distribuída pelo Estado que altera a mente e restringe as emoções, assina imediatamente a sua sentença de morte. Clerick John Preston é um alto dignatário governamental responsável por destruir quem não cumpre as regras. Mas no dia em que se esquece de tomar a sua dose, descobre que ele é afinal a única pessoa capaz de destruir o regime que o treinou para fazer cumprir as suas rígidas leis.",
				"added": 1589165404
			},
			{
				"comment_id": 10,
				"body": "Young Guns II Jovens Demais Para Morrer 1990 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589178696_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: O Jovem Billy the Kid (Emilio Estevez) e seu bando partem em direção à fronteira com o México para fugir da mira da justiça. Eles são perseguidos por homens-da-lei que querem capturá-los a qualquer custo, mas contam com a esperteza e a habilidade no gatilho para escapar de forma espetacular a cada vez que se encontram ameaçados. Seqüência de “Os Jovens Pistoleiros”.",
				"added": 1589178966
			},
			{
				"comment_id": 12,
				"body": "Independence Day 1996 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589524996_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: No dia 2 de julho os sistemas de comunicação do mundo inteiro se transformam em um caos, devido à uma estranha interferência atmosférica. Logo se descobre que enormes objetos estão em curso de colisão com a Terra. Inicialmente imagina-se que se tratam de meteoros, mas logo revela-se ser na verdade uma imensa nave espacial pilotada por alienígenas. Após frustradas tentativas de se comunicar com os extra-terrestres, um técnico em comunicação descobre que os seres do espaços estão usando os satélites terrestres para se comunicarem e iniciarem em menos de um dia um ataque conjunto nas principais cidades do planeta. No dia 3 de julho o ataque alienígena começa de forma esmagadora e nem armas nucleares conseguem destruir a blindagem protetora. Mas no dia 4 de julho surge uma possibilidade de vencer o invasor e nesta hora todas as nações precisam se unir, pois está em jogo a existência da raça humana.",
				"added": 1589526672
			},
			{
				"comment_id": 15,
				"body": "Jurassic Park lll 2001 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589772669_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: Apesar de ter ficado abalado com seu último encontro com dinossauros vivos, o Dr. Alan Grant (Sam Neill) continua dedicando sua vida a estudá-los e desenvolve uma teoria sobre o desenvolvimento da inteligência dos velociraptors. Desesperado em busca de fundos para dar prosseguimento à sua pesquisa, ele aceita a oferta de Paul (William H. Macy) e Amanda Kirby (Téa Leoni), dois milionários que desejam fazer uma excursão aérea na Ilha Sorna e que querem contratá-lo para acompanhá-los. Porém, durante a viagem o Dr. Alan Grant descobre a verdadeira intenção dos Kirby, que é descer até a Ilha Sorna para procurar seu filho, que desapareceu no local em uma expedição ocorrida 8 semanas antes. Apesar da oposição de Grant, eles pousam na ilha e acabam sendo atacados por uma nova espécie de dinossauro, maior e mais feroz que o tiranossauro rex.",
				"added": 1589772949
			},
			{
				"comment_id": 18,
				"body": "Os Fantasmas se Divertem 1988 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589884935_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: O casarão de uma dupla de fantasmas super atrapalhados foi invadido por novaiorquinos sofisticados. Para espantá-los, eles contratam um profissional: um fantasma especialista em assustar humanos (Michael Keaton), que vai tentar de tudo – adotar formas estranhas, armar ciladas e engraçadíssimas armadilhas. Dirigido por Tim Burton, Os Fantasmas se Divertem é uma comédia hilariante, vencedora do OSCAR de melhor maquiagem em 1988 que ainda conta com um elenco de estrelas: Alec Baldwin, Geena Davis e Winona Ryder. Crie coragem e invoque os espíritos. Você terá uma experiência inesquecível!",
				"added": 1589885062
			},
			{
				"comment_id": 19,
				"body": "Constantine 2005 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1590285464_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: John Constantine (Keanu Reeves) é um experiente ocultista e exorcista, que literalmente chegou ao inferno. Juntamente com Angela Dodson (Rachel Weisz), uma policial cética, ele investiga o misterioso assassinato da irmã gêmea dela, Isabel. As investigações levam a dupla a um mundo sombrio, em que precisam lidar com demônios e anjos malvados.",
				"added": 1590286477
			},
			{
				"comment_id": 20,
				"body": "X-Men Origins - Wolverine 2009 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1590401717_19Lg6xuosDQGuNxysZcY5z9vqUAF2WP9JZ\n\nSinopse: A Equipe X é formada apenas por mutantes, tendo fins militares. Entre seus integrantes estão Logan (Hugh Jackman), o selvagem Victor Creed (Liev Schreiber), o especialista em esgrima Wade Wilson (Ryan Reynolds), o teleportador John Wraith (Will i Am), o atirador David North (Daniel Henney), o extremamente forte Fred J. Dunes (Kevin Durand) e ainda Bradley (Dominic Monaghan), que manipula eletricidade. No comando está William Stryker (Danny Huston), que envolve alguns componentes do grupo no projeto Arma X, um experimento ultra-secreto. Entre eles está Logan, que precisa ainda lidar com o desfecho de seu romance com Raposa Prateada (Lynn Collins).",
				"added": 1590401843
			}
		]
	},
	"comment_vote": {}
}