{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": [
			{
				"comment_id": 1,
				"body": "> [flappyearz](#comment_16_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): Zeronetes linkek kellenenek, nem? ;-)\n\nIdővel talán majd olyanok is lesznek :-)",
				"added": 1495529877
			},
			{
				"comment_id": 5,
				"body": "A baj hogy ezen a zárt rendszeren senki nem találja meg az oldalakat. Így meg nem éri meg komolyabb weboldalakba befektetni. Van egy torrent alapú elosztás. Ez tehermentesíti a fő szervert  nagy forgalom esetén. Kis látogatottságú tartalomnál semmi nem tartja online a tartalmat. Ott vagyunk hogy ugyan úgy kell egy non-stop központi szerver. Aminek a fenntartása pénz. Maga a rendszer nem oldja meg a tárolás kérdését. A médiatulajdonos rendszeres  „jelenléte” nélkül a tartalom meghal. A kijelentés miszerint az oldalak leállíthatatlanok nem igaz! A koncepció a fizetős szerver szolgáltatásának igénybevételét, vagy a tulajdonos folyamatos visszatöltésének problémáját saját szerverről nem oldja meg. Egy komolyabb szolgáltatás indításához meg nevetségesen kevés a felhasználó.",
				"added": 1568576309
			}
		],
		"1_1N8Lt8mUks1ntSQwWUWRrdapfstVHuEXeo": [
			{
				"comment_id": 2,
				"body": "Álljunk át mi is BitCoint használatra!",
				"added": 1495570701
			}
		],
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": [
			{
				"comment_id": 4,
				"body": "Ctrl-right. ;-)",
				"added": 1536436276
			}
		],
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 6,
				"body": "A pesti elit negyedet kell felgyújtani. Elkapni pár senkiházi politikust és egy konyhakéssel lefejezni! Lábánál fogva felhúzni a villanyoszlopra és kibelezni! Videón ezt a neten közzétenni hogy a haverjai is értsék hogy mi vár rájuk! Rárobbantani a rendőrökre a rendőrőrőrsöt. Elkapni az utcán a politikust és brutálisan kinyírni. Nem a parlament elé menni hanem a politikusok háza elé menni hogy érezzék ők is meg a családjaik is a nyomást hogy tetteiknek következménye van. Rajuk rontani a parlamentben majd meglincselni őket, élve elégetni. És szó nélkül felgyújtani ezeket a luxusapartmanokat, családtagjaikat meglincselni. A gerinctelen féreg elit és a hasonlóan féreg őket szolgáló végrehajtó réteg ebből ért! Szabad oldalak kellenek ahol bárki engedélye nélkül nagy csoportosulásokat lehet szervezni. Közzétenni nyíltan bármelyik politikusról minden féle információt. Mert Facebook és a korrupt társai erre alkalmatlanok! A népet meg felfegyverezni hogy megtudja magát védeni!\n\nPár ismert politikus feje konyhakéssel a nyakánál fogva le lenne vágva majd közzétéve így abból értenének a haverok is!\n\nhttps://horriblevideos.com/video/rival-cartel-leader-s-wife-beheaded-31.html",
				"added": 1632647388
			}
		]
	},
	"comment_vote": {
		"4_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": 1,
		"6_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": 1,
		"16_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1
	}
}