{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Do assembly para o Java ou .NET",
			"body": "Um Pouco sobre a Criação e História das Linguagens de Programação\nComeça assim. \nVocê tem o processador e este só \"intende\" números. \nNós seres humanos não nos damos bem só com números, então para cada instrução numérica associamos um mnemônico, a partir daí temos a nossa primeira linguagem a Assembly.\n\nMuitas instruções começam a ficar repetitivas então surgem as macros.\n\nOs programas começam a ficar imensos.\nÉ preciso criar um programa para juntar tudo isso.\nSurge os montadores, ou seja, assembler's.\n\nMesmo assim tudo está muito grande e difícil de entender.\nÉ preciso escrever em inglês e traduzir automaticamente para Assembly.\nSurge então os compiladores.\nEstes primeiros amarrados fortemente a alguma linguagem.\n\nÉ impossível não falar da mais famosa e poderosa linguagem já criada a linguagem C.\nEla é tão indispensável que a partir dela já não se cria um compilador a partir do Assembly.\nMuitos compiladores agora são criados a partir da linguagem C.\nE com esses compiladores surgem novas linguagens como PHP etc.\n\nAs bibliotecas de funções já não dão conta, novamente são muitas funções.\nÉ preciso agrupar funções e dados de uma forma melhor.\nSurge um novo paradigma, a programação orientada a objetos.\n\nE junto com a programação orientada a objetos surge a linguagem C++.\nSeu sucesso é tanto que programas em C são reescritos para C++.\nMuitos compiladores agora são criados a partir da linguagem C++.\n\nMuitos e muitos sistemas operacionais começam a surgir.\nReescrever seus programas para eles começa a ficar inviável.\nSurge então as máquinas virtuais a mais popular é a linguagem Java trazendo a JVM (Java Virtual Machine).\nÉ preciso escrever uma JVM para cada sistema operacional, porém isso é problema da Oracle.\nNós programadores apenas escrevemos na linguagem Java e a JVM \"se vira\" para rodar este programa da mesma forma independente do sistema operacional.",
			"added": 1588494720
		}
	],
	"topic_vote": {
		"3_136d658NYQsvMuyFwvc2sbrwe56nZ9F4TM": 1,
		"3_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"2_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"1_136d658NYQsvMuyFwvc2sbrwe56nZ9F4TM": 1,
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": 1,
		"5_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": 1,
		"2_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_1FWvwLsD6jLUmYYhjsrLAhKrgGF1dR3yDR": 1,
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1,
		"1_1CcSAqVEXCdPyYKP4d7JHeCFxBB4bt7jtM": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	},
	"next_comment_id": 18,
	"comment": {
		"2_14fjqt4UgRXk2nfhPzj6Gd7k64VjpemjWM": [
			{
				"comment_id": 1,
				"body": "Cara, mais que bosta, esse conteúdo está na web surface, se for para ter conteúdo idêntico desinstala essa bosta.",
				"added": 1588487454
			}
		],
		"10_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 2,
				"body": "Baboseira, você e eu. Comemos por 10 africanos, gastamos mais energia que 10 africanos... deixa de ser hipócrita.\nSe qualquer um aqui tivesse um jato faria igual ou pior.",
				"added": 1588487824
			}
		],
		"3_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": [
			{
				"comment_id": 3,
				"body": "> [caropc1v5](#comment_17_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv): uhé, é só tu mesmo  manter as coisas que TU ACHA importantes, ou tu quer OBRIGAR os outros a manter o que TU acha importante.\n> Eu estou fazendo isto :)\n> Bem vindo a zeronet e ao mundo descentralizado :D\n\nO problema é o seguinte, é impossível fazer download da internet, só haverá fragmentos copiados. Quando alguém no futuro quiser checar a história, ou precisar de algo útil, só vai achar seriados, pornografia, games, novelas, ou seja, todo o tipo de inutilidade que essa geração acha \"importante\". E as coisas realmente importantes irão se perder.",
				"added": 1588490037
			},
			{
				"comment_id": 4,
				"body": "Ideia para mitigar o sumiço de sites na web\nhttps://wgomessantos.blogspot.com/2020/05/ideia-para-mitigar-o-sumico-de-sites-na.html",
				"added": 1588491846
			}
		],
		"1_12rxQAQ1ME8vP56oHQTXmnp4XRJgmwv4Vd": [
			{
				"comment_id": 5,
				"body": "Se a gente conseguisse entrar na cabeça das pessoas, evitaria muitos enganos e talvez tivéssemos mais compaixão.",
				"added": 1588492259
			}
		],
		"2_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": [
			{
				"comment_id": 6,
				"body": "Ideia para mitigar o sumiço de sites na web\n\nVocê encontra um ótimo site na internet, a informação é muita e claro você não irá consumi-la toda de uma vez só, irá colocá-lo na sua lista de sites favoritos e visitar o site de tempos em tempos.\nDo nada o site some.\nE isso pode ter acontecido por \"n\" motivos.\n\nA minha ideia é somente para tratar um único motivo, ou seja, a morte do autor do blog, site, etc.\nClaro que se o autor morreu ele não irá mais pagar a hospedagem, então minha ideia é que os sites de hospedagem permitam que quando o site não for mais pago e o autor estiver incomunicável, ele dê a opção dos visitantes pagarem a hospedagem ou parte dela e assim o site voltar ao ar.\n\nPor exemplo, o autor permite que em caso de morte os visitantes paguem pela hospedagem e reativem o site.\nEntão vamos supor que a hospedagem mensal custe $10, se um visitante doar $4, outro $6, pronto o site será reativado por mais um mês.\nCaso o valor se exceda então é guardado para o próximo mês.\n\nQuem garante que haverá doações? E se a hospedagem ficar no prejuízo?\nBom, seria interessante a hospedagem permitir deixar um valor de reserva, ou seja, o autor paga 1 ano de hospedagem, então se ele morrer, o site ainda sim funcionará por 1 ano.\n\nEssa ideia também ajudaria nos seguintes casos, você sofreu um grave acidente e ficou 1 mês e 15 dias em coma, quando você acordar seu site ainda estará lá, não perderá tudo só porque ficou sem pagar 1 mês.\n\nfonte: https://wgomessantos.blogspot.com/2020/05/ideia-para-mitigar-o-sumico-de-sites-na.html",
				"added": 1588496366
			}
		],
		"2_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 7,
				"body": "Você tem interesse sobre quais assuntos?",
				"added": 1588497138
			}
		],
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": [
			{
				"comment_id": 8,
				"body": "Você está em um ambiente mais avançado e também descentralizado. Não entendi porque você está fazendo propaganda de algo mais arcaico. Nesse nosso ambiente você também pode compartilhar arquivos, vídeos e tudo mais.",
				"added": 1588497539
			}
		],
		"2_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy": [
			{
				"comment_id": 9,
				"body": "BBC dribla censura? Cara, BBC não precisa driblar nada, BBC, NBC, CBS é tudo mídia main streaming globalista. Eles tem o mundo na mão.",
				"added": 1588498032
			}
		],
		"2_1FWvwLsD6jLUmYYhjsrLAhKrgGF1dR3yDR": [
			{
				"comment_id": 10,
				"body": "Como faz para ripar livros do Amazon Kindle?",
				"added": 1588498303
			}
		],
		"5_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": [
			{
				"comment_id": 11,
				"body": "Eles são super brutos. A coisa lá é resolvida na paulada.",
				"added": 1588498542
			}
		],
		"3_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 12,
				"body": "Eu trampo com um negro e não tem nada de errado com ele. Já conheci um monte de viado, maioria gente boa, são competentes no trabalho, ficam na deles e vivem do jeito deles. Comunismo e socialismo não é de todo ruim, só não pode ser implementado de forma 100%, eu mesmo fui beneficiado por vários programas sociais e consegui me tornar um programador, pois nasci na periferia e infelizmente a vida da maioria é beber, cheira, ouvir funk, se matar pelo futebol, etc.",
				"added": 1588498978
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 13,
				"body": "Nem dá mais para ter preconceito contra negro, pois a quantidade de lixo branco está tão alta que seria hipocrisia falar deles.\nLixo branco - pessoa que só quer beber, torcer para time de futebol, cata muié, etc.",
				"added": 1588499301
			}
		],
		"7_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 14,
				"body": "Objetivo: mimimi extremo ou ódio extremo.\nNegro  100% convertido em mimizento.\nBranco 100% convertido ao ódio extremo.\n- Lord, informamos que a programação mental, enviada através da TV aberta e grande portais é um sucesso, o gado continua distraído brigando entre si.\n- Ok, ok... Depois não esqueça de passar os demais relatórios: Homem vs Mulher, Católico vs Crente, etc.",
				"added": 1588499860
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 15,
				"body": "Ensina aí os cara a programar, faz melhor então.",
				"added": 1588500231
			}
		],
		"3_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 16,
				"body": "Se fodeu.",
				"added": 1588535957
			}
		],
		"2_16rweQ3kpW62uqTDffBcUBLhg7GHvA6Agx": [
			{
				"comment_id": 17,
				"body": "Lixo esquerdopata.",
				"added": 1588813615
			}
		]
	},
	"comment_vote": {
		"11_19cLwgKw9JF5WSgo647cfBdM44rsNNuLWK": 1,
		"5_1MwwTJRv96yifi4KwRtDRjFHQjtxz7kPcr": 1,
		"4_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv": 1,
		"2_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F": 1,
		"11_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": 1
	}
}