{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1574560433,
			"title": "Opinions on the Holocaust",
			"body": "I've had severe doubts over the years as to the accuracy of this \"historical event\". A large part of me feels that those photos of starved Jews were only able to be created because of shitty supply lines. There is so much that doesn't add up. What do you think?",
			"added": 1574560432
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1574292051_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 1,
				"body": "Fucking kill yourself. If you think pussy pony is hot then god made his greatest mistake with you.",
				"added": 1574560572
			},
			{
				"comment_id": 5,
				"body": "> [peppermintswirl](#comment_15_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx): youre the no hooves fgt\n\nThe radical escapism it would have to require to be so out of touch with reality that you are not only sexually attracted to cartoon animals but also see no issue with that is astronomical. I am surprised our world hasen't yet ended due to your brain collapsing into a black hole and killing us all. Please fucking hang yourself before your mental retardation gets to those devastating levels.",
				"added": 1574641280
			},
			{
				"comment_id": 6,
				"body": "> [peppermintswirl](#comment_17_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx): OK boomer\n\nOh I see, you're a reddit connesour. It's useless to argue with you then. Retards can't be reasoned with.",
				"added": 1574988088
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "> [between2worlds](#comment_1_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV): Small is good. Way better than trying to import the unnecessary.\n\nI agree to a point. We can still have our \"safe spaces\" but I feel it is also our duty to grow this because it provides such a benefit for those who may not even have considered it an option.",
				"added": 1574560877
			},
			{
				"comment_id": 4,
				"body": "> [between2worlds](#comment_2_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV): You can feel that. You can also derive an ought from an is. I'm not Jewish, so I don't ever feel its my duty to grow societies by claiming some benefit by dutifully injecting it with the inconsiderate.\n\n>I'm not Jewish\n\nahahahahaha based",
				"added": 1574641129
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 3,
				"body": "> [spukkinfaceship](#comment_29_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): it's disappointing that given this opportunity for un-censorable free speech there are those who still choose to squander it with this idiotic nonsense.\n\nIt's sad that given the access to information that we have that some people still choose to believe everything they learn in Highschool history class.",
				"added": 1574641050
			}
		]
	},
	"comment_vote": {
		"342_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"3_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV": 1,
		"74_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"85_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"51_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1_1EyUrUV7UnDzr36fJefTvkARKSNdcJdi14": 1,
		"2_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV": 1,
		"8_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1
	}
}