{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#Ele que o abismo viu: Epopeia de Gilgámesh\n- https://swarm-gateways.net/bzz:/250cc81610afb42336f8dc4df897809fb7349d2a6b5f6ccee9adb442e11fdf3f/Epopeia_de_Gilgamesh-Sin-leqi-unninni.pdf\n\nEle que o abismo viu é uma das versões do [mito de Gilgámesh](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Epic_of_Gilgamesh.html), a que é atribuída a [Sin-léqi-unnínni](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Sin-liqe-unninni.html) (séc. XIII a.C.), considerada a mais completa e importante dessa tradição acádia, preservada em tabuinhas de argila que foram descobertas entre 1872 e 2014. O texto, traduzido do acádio e anotado por Jacyntho Lins Brandão, traz para o leitor brasileiro a mais ampla reconstrução do poema, que é o mais antigo registro literário que conhecemos. Na tradição que remonta a mais de quatro mil anos, ele é anterior a [Homero](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Homer.html), a [Hesíodo](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Hesiod.html) e aos [textos bíblicos](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Bible.html). Nesse longo (e ainda fragmentário) poema encontramos, já elaborados de forma sofisticada, ideias, valores e leituras do mundo – além de vários mitos que aparecerão na tradição literária posterior, como a criação do homem a partir da argila, o dilúvio e a construção de uma arca para salvar as criaturas, humanos e animais.",
				"added": 1589241790
			},
			{
				"comment_id": 2,
				"body": "#17 contradições e o fim do capitalismo - [David Harvey](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/David_Harvey.html)\n- https://gateway.pinata.cloud/ipfs/QmWoaar8AETk4UC5LaJQfpspfU93LDzG3dm5hPctknrkRA\n\n\nPara a sociedade ocidental moderna, o capital parece tão natural como o ar que se respira, e quase ninguém pensa em questioná-lo. Mas saber o que faz o capital funcionar - e o que, por outro lado, pode abalar suas bases - é crucial para compreender sua saúde em longo prazo, bem como as vastas implicações de qualquer mudança para a economia global. É o que faz o geógrafo britânico David Harvey nesta obra incisiva, ao revelar a vanguarda de suas análises das dinâmicas do capital e destrinchar as contradições internas desse motor econômico.Escrito em linguagem acessível, 17 contradições e o fim do capital coroa o 'Projeto Marx', que orienta a obra de Harvey há vinte anos, repensando Karl Marx em época de mutação e crise do capitalismo. A decisão de focar a análise nas contradições se deve em parte ao escritos do filósofo alemão, que enfatizou diversas vezes que crises do tipo que o mundo viveu em 2007-2008 são manifestações superficiais de contradições internas do capital. O objetivo de Harvey é inverter o uso da ideia de contradição como ponto final da reflexão e torná-la o início da conversa, em particular sobre o que seria uma política anticapitalista e como poderíamos entender as crises.Ao longo dessa análise sistemática, Harvey constata que, embora a forma de manifestação de algumas contradições tenha se desenvolvido desde a época de Marx, a estrutura das contradições do capital é surpreendentemente constante. Além disso, tais contradições são interligadas e interagem (às vezes se apoiam) mutuamente; e revelam um retrato muito mais descentralizado do capital do que se costuma pintar.'A exposição ganha complexidade à medida que parte para as contradições mutáveis, abrindo as contradições do capital para a interação com as do capitalismo e avaliando suas formas no tempo e no espaço. Como geógrafo, dá justo destaque ao desenvolvimento desigual das regiões e aborda como o Estado legitima e apoia a acumulação por espoliação', diz o economista e professor da Unicamp, Pedro Paulo Zahluth Bastos. Harvey aborda por último as contradições perigosas, que podem provocar uma degradação progressiva da terra e um empobrecimento em massa, aumentando radicalmente a desigualdade social e a desumanização de grande parte da humanidade.Ao final do livro, vemos um dos mais influentes marxistas da atualidade sintetizar sua experiência de compreensão das dinâmicas do capital em '17 ideias para uma práxis política', um explosivo manifesto humanista revolucionário com orientações práticas para quem busca desafiar o regime capitalista de uma vez por todas. Para cada contradição do capital revelada e destrinchada, Harvey rebate com uma proposta formulada de maneira clara e direta ao ponto. Não é à toa que considere este o 'livro mais perigoso' que já escreveu.",
				"added": 1589242013
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 3,
				"body": "#O Socialismo deu errado? Não funciona?\n- https://swarm-gateways.net/bzz:/52b0e9441e436bc2a6e61c37da8a8748bec17aaa30db95f5d3b497368e236e9e/O+Socialismo+deu+errado?+Não+funciona?++EP+#43-LYRRdijZutU.mp4\n\n\"Nesse vídeo, discutimos brevemente a tese de que o socialismo deu errado em função do colapso da União Soviética em 1991 e a queda do muro de Berlin em 1989. Ao final do vídeo, ilustramos o que foi indicado com vídeo em que os trabalhadores gregos foram obrigados a entregar as armas ao fim da Segunda Guerra Mundial e entregar o poder a Winston Churchill e aliados.\"\n\n#Socialismo em um só país e Internacionalismo: qual é a polêmica?\n- https://swarm-gateways.net/bzz:/dab67e3af5a943c625a4bc9de42787dfefb6cc6fb5e6aa94ac858901e283cd55/Socialismo+em+um+só+país+e+Internacionalismo:+qual+é+a+polêmica?+EP+#30-O5SE-5VjXF0.mp4\n\n\"Nesse vídeo abordamos a diferença, enorme, que existe entre a teoria do socialismo em um só país desenvolvida por Stálin e Nikolai Bukharin em 1924 e o internacionalismo que desde Marx e Engels caracterizavam o marxismo. Discute-se, entre outras coisas, a teoria da Revolução Permanente de Trotsky como algo mais específico que o internacionalismo propriamente dito, não precisando ser adepto dessa última teoria para se opor a ideia do socialismo em um só país. Menciona-se, ainda, os comentários de György Lukács a este respeito.\"\n\n#István Mészáros e a teoria do socialismo em um só país\n- https://web.archive.org/web/20191020114532/https://teoriaerevolucao.pstu.org.br/istvan-meszaros-e-o-socialismo-em-um-so-pais/",
				"added": 1589243234
			},
			{
				"comment_id": 4,
				"body": "#Ludwig von Mises e a (im)possibilidade do socialismo\n- https://swarm-gateways.net/bzz:/cbfaa3cbb5e0afb88bd6e47a181e7be545e102b2853645f76ebe4485584cd3a0/Ludwig+von+Mises+e+a+(im)possibilidade+do+socialismo+EP+#14-QbqET52IvL4.mp4\n\n\"Nesse vídeo discutimos a controversa tese de Ludwig von Mises da impossibilidade do socialismo. Segundo ele, esse seria o caso porque não há possibilidade de realizar o cálculo econômico que permita distribuir a riqueza produzida entre participes do processo de produção. O problema central de sua tese é a ausência de preços que seriam a dimensão quantitativa que possibilitaria o cálculo econômico.\"\n\n- Bibliografia mencionada: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?14c8t1qfaHAeustAJLZ8Jfm1Jfdxv2Weoc_0",
				"added": 1589243552
			},
			{
				"comment_id": 5,
				"body": "#Universidades NUNCA foram marxistas!\n- https://swarm-gateways.net/bzz:/92d2bd24c78789a88b2214e7b47421ef6e250d2194d4cf576a77474280bf612d/Universidades+NUNCA+foram+marxistas!+EP+#8-FxG5p5EN6Iw.mp4\n\nVídeo citado sobre os \"conceitos\" de esquerda e direita: https://swarm-gateways.net/bzz:/46784802b3f71ed84475f21f80afec0d922fab04b69165e2d0fc23d18746df28/Esquerda+e+Direita+não+significam+nada+EP+#5-4ftlCgyJv8U.mp4\n\nLivro citado:\nPINTO, Paulo Roberto Margutti. História da filosofia do Brasil (1500-hoje): 1ª parte: o período colonial (1500-1822). São Paulo: Edições Loyola, 2013. 377 p.",
				"added": 1589245851
			}
		]
	},
	"comment_vote": {}
}