{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1583986918,
			"title": "Tired of fake thumbnails on youtube? Replace them with this extension!",
			"body": "This extension will replace custom thumbnails with an actual screenshot of the video. Never again will you see bullshit thumbnails that promise tits and fail to deliver.\nhttps://addons.mozilla.org/en-US/firefox/addon/clickbait-remover-for-youtube/\nhttps://chrome.google.com/webstore/detail/clickbait-remover-for-you/omoinegiohhgbikclijaniebjpkeopip",
			"added": 1583986917
		}
	],
	"topic_vote": {
		"1566439997_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1565142251_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1568944930_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1572129251_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1573531510_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1574206496_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": 1,
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"1586632143_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1603974362_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 38,
	"comment": {
		"1566210141_1NUGWke945sjoqdkcbFn9HVswWBAF5hfMF": [
			{
				"comment_id": 1,
				"body": "saw this error when i made my first post after i signed in with zeroid. i just tried again and it worked.",
				"added": 1566267800
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 2,
				"body": "The real problem with mobile is that these devices run on battery so they can't participate in decentralized networks properly. Mobile, as we know it, requires centralized servers/infrastructure. Mobile is what's ruining the internet.",
				"added": 1566437051
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_1055_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Battery isn't a problem. It's easy to just be able to plug in somewhere or carry battery chargers and whatnot. My phone personally lasts all day, so no issue there. The issue I run into is connectivity. No data whenever I go out is a constant problem. [...]\n\nYour phone lasts all day because most of the time it stays in a low power sleep state. Client devices don't have to be constantly listening for incoming communications because there's a server/base station that does that and the client only has to check with the server/base station once in a while to see if there's any incoming message, but if your phone becomes a server/base station, it can no longer sleep all the time, so the battery life will be worse. Yes, you can carry as many power banks and battery chargers as you want, but IMO that's moving the goal post.\n\n> [crazylime](#comment_159_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): Yes and no.  Check out the servalproject.org.   [...]\n\nInteresting. I will check it out.\n\nEdit: In this video about Serval, it was mentioned that the battery life is \"fairly dreadful\" but it's manageable for them. https://youtu.be/FN4tSkLLYhk?t=21m\n\n\nI will install ZeroNet on my phone and see how much impact it has on battery life. I know ZeroNet is probably not optimized for power, but the first decentralized mobile app may not be either.",
				"added": 1566443929
			},
			{
				"comment_id": 4,
				"body": "> [kaffie](#comment_1056_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Well yeah. Mobile nodes would be clients. Seems obvious? [...]\n\nKind of like bitcoin with full nodes and lite nodes. Got it.\n\nEdit: Actually, thinking about it more, lite nites are not a good thing for the network. If you can get all the same functionality without running a full node, then full nodes will be the exception and not the norm. There's 2 problems I can think of. First is centralization. If a few full node operators get enough users, they can use their clout to censor and dictate their rules to others. It will be like Mastodon. Second problem is bad economics. One of the things I like about a flat p2p network like ZeroNet is that people sort of bear the cost of their own content. If I want to make sure my posts or things I like (especially the optional content) are seen by everyone else, I stay online to seed it, paying the cost in bandwidth and storage. If users don't see the marginal cost of their activities (I assume the full node operators will not do fine-grained usage based billing because it's difficult to measure the cost and difficult for users to understand), they will over-consume and post unworthy garbage that they wouldn't have viewed/posted otherwise.",
				"added": 1566446736
			}
		],
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 5,
				"body": "> [hugin](#comment_1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA): I think they're just more aware of the malevolence of rulers. Most westerners are completely oblivious or too nihilistic to care about loosing their freedoms.\n\nYep. Some of the most libertarian people I've met are people who have lived in Tiananmen-era China.",
				"added": 1566542729
			}
		],
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 6,
				"body": "MS OneDrive already does this.",
				"added": 1566620067
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "I don't get the obsession with making reddit clones. I think the reddit format sucks for having meaningful conversations.\n\nThe fundamental problem is the way the conversation is organized. Reddit organizes posts in a tree structure. This lets conversations branch out easily, but try bringing those branches back together and you'll find it's difficult. The problem is that you can only reply to one post at a time. On a traditional forum or a chan, the posts form a DAG, and you can reply to multiple posts at the same time to summarize what has been happening or bring the conversation to a conclusion. I've seen discussions on reddit where different people propose the same ideas in different branches of the conversation and the discussion just sort of fizzled out after a while with no consensus being built in the end. Hell, if we have this very discussion in a reddit format, the same thing will probably happen.\n\nAnother consequence of the tree structure is that long back and forth conversations are penalized because the posts become deeply nested and the system hides them by default, but hiding deeply nested posts is not a fundamental problem that can't be fixes.\n\nAs for the voting system (and sorting posts by their popularity), for topics where there is a single correct answer, it tends to surface that correct answer. But try it on anything controversial or political (which is where ZeroNet shines compared to the client-server web), and you get an echo chamber.",
				"added": 1566690330
			},
			{
				"comment_id": 8,
				"body": "> [znnex](#comment_47_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): What's the difference between a post with 10 points vs. a post with 5 points, and a post with 5 points (10 minus the 5 from the opposing view) vs. a post with -5? It's pure popularity producing your \"correct answer\" either way. The first way pretends every post has merit (which isn't true) while the latter lets you know immediately what kind of place you've encountered.\n\nI meant topics with correct answer as in things like elementary school math. If there are valid opposing viewpoints, then there isn't a single correct answer.",
				"added": 1566695230
			},
			{
				"comment_id": 9,
				"body": "> [kaffie](#comment_1088_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Reddit-style comment trees are great for breadth rather than depth. Whereas forum-style comment trees are good for depth but not breadth. So the forum style stuff works best when there's a few people talking a lot about particular complex ideas. Whereas reddit is more tuned towards having a lot of people say their piece and maybe have a little back/forth on it.\n\nI agree that each format has its strengths. The tree format is better than the linear format for brainstorming, but it is difficult to transition out of the brainstorming stage and start merging ideas. \n\nOne idea that's been on the back of my mind is displaying reddit threads linearly like a forum thread. Theoretically it's possible, but it can put a lot more load on the reddit servers because I'd have to retrieve every post in a thread. On zeronet, we have all the post data already downloaded so it doesn't cost as much. \n\nI wonder if we can start threads in the tree format, then transition to a linear format to resolve the remaining back and forth discussions. Deciding when to switch format is a problem that don't have an answer for, and I feel that longer discussions may benefit from being able to alternate between tree and linear formats. Maybe all we need is good integration to allow ZeroReddit posts to refer to ZeroTalk posts and vice versa.\n\nI feel that sometimes reddit is used just because everyone has an account there, and not necessarily because the format makes sense for the topic. Since our ID providers in ZN are separate from the discussion sites, the network effect is less of an issue here.",
				"added": 1566777118
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 10,
				"body": "I knew this kind of thing (spam) would happen. Temporary IPs are very cheap from cloud provider.",
				"added": 1567318965
			},
			{
				"comment_id": 11,
				"body": "One way to reduce automated mass registration is to ban IPs from known VPN/proxy providers, Tor exit nodes and server hosts. I know such block lists or IP lookup services exist.",
				"added": 1567361752
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 12,
				"body": "It's a technical solution to a social problem. The police probably won't waste their resources acting on minor offences. I just hope they won't use it to build a dossier of minor offences that they can use to arbitrarily prosecute people they don't like, because this app certainly creates an infrastructure that can be used for evil purposes.",
				"added": 1567452162
			},
			{
				"comment_id": 13,
				"body": "> [bigbadbob](#comment_524_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Do the police need resources when the people do their investigations for them with technology?  The abuse seems limitless\n\nI mean actually going out and catching people for things that hardly matter when they have more important or cost effective things to do.",
				"added": 1567454558
			}
		],
		"1568861643_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 14,
				"body": "We gotta vote this clown out of the office.",
				"added": 1568862161
			}
		],
		"1569215330_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 15,
				"body": "> [kusoneko@kxoid.bit](#comment_5_1FmQCziBtaj5CevDW7cfBRJ7k6rRYQ1AKK): And the US government has jurisdiction over a Chinese Police Force why?\n\nThe US doesn't have jurisdiction over other countries, but that hasn't stopped them from imposing sanctions on other countries has it?",
				"added": 1569289617
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 16,
				"body": "The issue is not democracy, but the cultural and ethnic composition of the country. When you force disparate peoples  to live in the same country, they will have conflicts that cannot be resolved by talking, and the majority will be tempted to use the government (democratic or otherwise) to impose their will on the minority. \n\nMulticulturalism is the worst. It's an ideology that discourages groups from integrating and becoming one. When people don't have a shared cultural foundation, the social fabric breaks down, and a society that cannot govern itself through its culture can only be governed by force of the government.",
				"added": 1569559601
			},
			{
				"comment_id": 17,
				"body": "> [k0hlr4bi](#comment_25_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): If muslims and blacks (for example) are left alone, they will (and do right now) create bloody dictatorships, rule of the strongest and religious fanaticism for their own people, sentencing countless new generations into living in a hellhole. I think Europe had good intentions at first by letting \"refugees\" in, but made a grave mistake of letting them dictate the rules instead of showing them that they are a MINORITY and must abide to OUR rules. [...]\n\nIf the country's population do not have a culture that values democracy and rule of law, the only thing we can do is to spread those values. Trying to liberate others by instituting democracy or civilized rule from the outside won't work because the people will see it as a foreign thing and not something they made and can be proud of. It has to come from within. Win the hearts and minds of the people and let them build their own civilized government.",
				"added": 1569646527
			},
			{
				"comment_id": 18,
				"body": "> [communism](#comment_4_1H2vbwfU8uNoJycKemBDgyPdrzE3A36Fkc): Democracy sucks because the right are allowed to have their voices heard. We must prevent the right from ever having their way.\n\ngr8 b8 m8",
				"added": 1570070511
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "> [noquat](#comment_16_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh): Why should vapes not be banned for the sake of public safety, when they appear to pose a clear and present danger to young people?\n\nWhy do you think the default should be to ban and a reason is needed to justify not banning? The default should be to allow.\n\n> [noquat](#comment_16_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh): What is the utility of vaping, such that it should be protected and allowed to occur?\n\nYou can say the same thing for much of the capitalist economic activities.",
				"added": 1570321839
			}
		],
		"1570383030_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": [
			{
				"comment_id": 20,
				"body": "I guess it's to prevent people from taking your posts on one zite and copying it to another zite, and claim you posted on the other zite. Just a guess.",
				"added": 1570390581
			}
		],
		"1571178755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "> [moor](#comment_276_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): the cry over the freedom of speech repression of China (concerning commercial relations) is simply silly for that only happens within China and not elsewhere, China isn't exporting its ways to the world, in fact that is what made a second axis so attractive, to ask for financial help and trade without political interference or \"shock doctrine\".  [...]\n\nExcept it is. Tik Tok (an app run by a Chinese company) censors anything the CCP doesn't like on its platform. Also, the recent NBA and Blizzard drama.",
				"added": 1571192236
			},
			{
				"comment_id": 22,
				"body": "> [moor](#comment_280_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Yes, on China.\n\nwut?",
				"added": 1571195693
			},
			{
				"comment_id": 23,
				"body": "> [moor](#comment_281_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): my point was that trade-wise censorship is kept on China and not elsewhere.\n\nWhat do you mean by trade-wise?",
				"added": 1571196419
			},
			{
				"comment_id": 24,
				"body": "> [moor](#comment_282_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): that the CCP can only censor inside China when trade is concerned.\n\nI still don't see how censorship can be categorized into trade-related and non-trade-related. Yes, the CCP can only do hard censorship (you can't say this or you go to jail) in China. Outside of China, they can still do soft censorship (you can't say this or allow this to be said or we ban your company from China).",
				"added": 1571197667
			},
			{
				"comment_id": 25,
				"body": "> [moor](#comment_283_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what is worse? having to comply to an entire political doctrine or simply to not bad mouth a foreign government?\n\nThat's political interference. Calling it censorship is what confused me. China is not in the position to do it just yet, but they are sponsoring infrastructure projects in 3rd world countries. Who knows what will happen when those countries become dependent on China.\n\n> [moor](#comment_284_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): you know what else is funny? those same companies never seem to get politically involved concerning other countries similar issues, why is that? its almost as if this whole thing was planned, but i digress.\n\nCorporations never want to get into controversial issues, but other countries don't have enough clout to impose their will on what foreign corporations do outside of their territories so it wasn't a problem. China is big enough to do that, so the corporations are dragged into this.",
				"added": 1571281154
			}
		],
		"1572129251_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 26,
				"body": "The left has become a joke. It's becoming clearer by the day that they are not interested in improving the lives of either women or men. They just want to fuck shit up.",
				"added": 1572227327
			}
		],
		"1572837213_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 27,
				"body": "8kun onion: http://jthnx5wyvjvzsxtu.onion/",
				"added": 1572845971
			}
		],
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 28,
				"body": "What is the goal here? Is it to create an alternative p2p mesh internet or to share connections to the ISP? If the goal is to create an alternative mesh-based network, leechers who refuse to route traffic for others can easily identified and punished by their neighbors. If the goal is to share ISP connections, you will quickly run into legal issues when someone on the network views unsavory material.",
				"added": 1573458180
			}
		],
		"1573710597_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 29,
				"body": "The site owner (nofish in this case) can raise your limit.",
				"added": 1573713021
			}
		],
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 30,
				"body": "Let me break this down for you\n\nDATE:\nIf the manifesto is published, the shooting is likely to happen within the next 30 days - 5 bits of entropy\n\nNAME:\nThe US population is about 330k - 26 bits of entropy\n\nCITY/REGION:\nThere are about 39k local governments in the US - 16 bits of entropy\n\nYou have a total of 47 bits of entropy.\n\nHashcat with a  RTX 2080 Ti GPU can crack 7.7 billion (33 bits) SHA256 hashes per second. (https://www.onlinehashcrack.com/tools-benchmark-hashcat-gtx-1080-ti-1070-ti.php) It can crack your hash in 2^14 seconds, which is less than 5 hours.\n\nYou should generate a long random string and put it in the document, and also print it out in big letters on a sheet of paper. Stream the shooting and show the random string on stream right before you an hero.",
				"added": 1574406577
			}
		],
		"1576241652_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 31,
				"body": "Sadly, all other browsers suck more",
				"added": 1576294303
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 32,
				"body": "I blame mobile for lowering the intellectual barrier of entry so much that even the dumbest people can go on the internet. The floodgates are open. The internet is overrun by idiots using gimped devices.",
				"added": 1576310631
			}
		],
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 34,
				"body": "I wonder where they got the data to train the AI.\n\nIt doesn't work well on photos of men. It generates a vag instead of a dick.",
				"added": 1582695878
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 35,
				"body": "There is some truth in this. As long as blacks remain a minority in the US, they will never get the policy that's best for them, and they will always blame their problems on the whites. If we carve out a piece of the US and move all the blacks there, the blacks will have far more control of their destiny, and they can actually start taking responsibility instead of blaming the whites.",
				"added": 1591043844
			}
		],
		"1591301277_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 36,
				"body": "Here's the problem: The AP side can accept multiple connections but the client side can only connect to one AP at a time",
				"added": 1591306483
			}
		],
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 37,
				"body": "> [zenanon](#comment_85_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): https://mod.haxor.fi/   -  web based mod player and collection of mods (click \"load song'])https://modarchive.org/   -  large mod music archive\n\nhaxor.fi doesn't work for me",
				"added": 1592157687
			}
		]
	},
	"comment_vote": {
		"142_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"395_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"159_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"174_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"12_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"4_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA": 1,
		"32_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"40_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"916_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"762_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"71_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"755_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"32_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"148_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"392_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"210_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"413_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1_1MrLyY93aje7NYUxBoxsA9dxMHtePMmVBh": 1,
		"72_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"21_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"491_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"392_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"30_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"393_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"11_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q": 1,
		"1154_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}