{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1562507956_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Here's another article worth reading titled \"Mozilla - Devil Incarnate\": https://digdeeper.neocities.org/ghost/mozilla.html\n\nEven though Mozilla asks for donations from its users, this is what the \"Executive Chairwoman\" of Mozilla Mitchell Baker received in monetary compensation:\n\n>In 2017 she received a total of $2,346,026 in compensation from Mozilla.[14] \n\nThanks @h3bhkj5gqz4n3pjm that's a nice list of wrong-doings by Mozilla, what browser do you use or recommend?",
				"added": 1562675575
			},
			{
				"comment_id": 2,
				"body": "> [xcape2net](#comment_104_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I noticed Cloudflare is now hosting a large percentage of the Interplanetary File System. I don't know what to think about that.\n\nHow did you notice that? By accessing stuff through their gateway I guess, or checking the IPs against Cloudflare's IP ranges.",
				"added": 1562676646
			},
			{
				"comment_id": 3,
				"body": "Thanks, the problem with browsers is that it needs to be compatible with ever changing specifications like HTML, CSS, SVG, Javascript and it requires so many individual components to let a modern site function.\n\n> [geekless](#comment_86_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Yeah, Cloudflare supports IPFS. The next \"Don't be evil\" corporation?\n\nThey try, like Google, to have a finger in every pie. They offer a free MitM service, a free DNS service, a free VPN service, a free CDN service, a free IPFS service, what could possibly go wrong lol.\n\nOh they have a feel-good motto as well:\n\n> Helping Build a Better Internet ",
				"added": 1562679429
			},
			{
				"comment_id": 4,
				"body": ">I'm really liking Icecat. No listed antifeatures, plus it can actually seek 4K MP4 videos without flaking out. This is a good Web dev target.\n\nI've never understood why people want >720p quality, 360p is enough for most of my use cases. I'll try out IceCat\n\nThe first thing that pops up is a \"Privacy settings\" configuration menu :)",
				"added": 1562679842
			}
		],
		"1562507956_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 5,
				"body": "> [klu9](#comment_191_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): \"Trackers: Waiting...\" again... :(\n\nWhere are you located?",
				"added": 1562680822
			}
		]
	},
	"comment_vote": {}
}