{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1570455782_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": 1,
		"1570755525_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1570456755_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 1,
				"body": "North Korean people have a ruthless regime because they don't deserve better. Also, if you believe you deserve to die (and you probably really do), why don't you just kill yourself? At least, sterilize yourself so you don't pass on your wicked genes. to the future generations.",
				"added": 1570463671
			},
			{
				"comment_id": 3,
				"body": "> [k0hlr4bi](#comment_5_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): We do need to control the population. >7 billion is way too much to sustain while keeping Earth in good condition. Earth can support at most 3 billion people. Question is, how to do it\n\nA 'simple' eugenic program. Forced sterilization for people with uncurable mental disorders, like schizophrenia.",
				"added": 1570554721
			}
		],
		"1570455782_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 2,
				"body": "we are all watched at all time. for marketing purpose and industrial espionage. if you do have a big company, you need to worry about those backdoors. otherwise, you have nothing to worry about.",
				"added": 1570466812
			}
		],
		"1569934923_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 4,
				"body": "should we mind our own business? the china government is made of chinese people. that's what they want for themselves.",
				"added": 1570730563
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 5,
				"body": "> [emmet](#comment_4_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): Cue picture of Alex Jones making crazy face wearing a Kippa and shouting \"IT'S THE SAUDIS!!!11\"\n\nAlex Jones will never tell the truth.",
				"added": 1570730656
			},
			{
				"comment_id": 6,
				"body": "> [whyamihere](#comment_1_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY): AHAHAHAHAHAHAHAHA.  https://www.reddit.com/r/conspiracy/comments/46vc3q/alex_jones_wants_us_to_believe_hollywood_is_run/ [...]\n\ni would never visit a site called biblebelievers looking for news or in the attempt to make myself an opinion about today reality...",
				"added": 1571221576
			},
			{
				"comment_id": 7,
				"body": "> [xcape2net](#comment_453_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I thought Satan owned the democratic party?\n\na fictional character own nothing. people who believe in the existence of such fictional character own a reservation for a mental institution or a 50% discount for a shrink.",
				"added": 1571221735
			},
			{
				"comment_id": 8,
				"body": "> [megatonjim](#comment_19_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT): Jews are behind communism, socialism, LGBT, feminism, political correctness, etc... Jews always work to destroy the societies they infest. Their Satanic \"How To\" book known as the Talmud tells them what to do!\n\nWe're talking about arab muslims here. Unless they too are jews...",
				"added": 1571240789
			},
			{
				"comment_id": 9,
				"body": "> [zaron](#comment_22_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Did you miss the Saudi connection to Trump?? He's selling arms to SA\n\nTrump sells arms?",
				"added": 1571324038
			},
			{
				"comment_id": 11,
				"body": "Military drama “The Brave,” NBC. “The Brave” has one element that stands out as a television rarity: a heroic MUSLIM main character. \n\nYes, muslims, are heroic, no doubt...\n\nhttps://www.telegraph.co.uk/news/2019/10/06/france-probes-security-agency-threats-police-killer-high-level/\n\nFrance is to probe “internal threats” to all its intelligence services after prosecutors confirmed an IT worker with high-security clearance who killed four at Paris police headquarters had a “radical vision of Islam”.\n\nThe inquiries came amid calls for Christophe Castaner, the interior minister, to resign over the security failure. He had initially said the murderer had displayed “no behavioural problems” or prompted any “alerts” [except he was a MUSLIM!]\n\nOn Thursday lunchtime, Mickael Harpon, 45, a [MUSLIM] computer expert who had worked for 20 years in the Paris police’s intelligence directorate, stabbed to death four colleagues - three officers and an administrative worker - before being shot dead by a police trainee.\n\nParis prosecutor Jean-François Ricard said Harpon had been in contact with members of Salafism, an ultra-conservative branch of Sunni Islam, and defended \"atrocities committed in the name of that religion”.[What a suprise! HE was A MUSLIM! Not a JEW! A MUSLIM!]\n\nYet he worked in a section of the police service dedicated to collecting information on jihadist radicalisation.",
				"added": 1571326889
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 10,
				"body": "i don't. i hate when whites put niggers where they don't belong. i hate when nigger are employed by whites. i hate when whites fuck niggers. in fact i hate whites!",
				"added": 1571325591
			}
		],
		"1571325375_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 12,
				"body": "Brazilian is a codeword for Muslim",
				"added": 1571336968
			}
		]
	},
	"comment_vote": {
		"18_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1,
		"29_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"136_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"5_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1116_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}