{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Definitely the intentionality of using the Internet. It wasn't constantly on, bombarding you with ads and notifications of nothing important. You wanted something, so you sat down in front of an actual computer with a keyboard. Connected to the Internet, did what you wanted and then disconnected.\n\nNow it's a constant barrage of absolute crap all day everyday, minimising the importance and significance of being online. Everyone is. Everyone always is. I miss being able to unplug and have being online mean something.",
				"added": 1572798308
			}
		],
		"1572626535_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "The throughput may be adequate for ZeroNet, but one of the disadvantage of SD cards (and common thumb drives) is that they have a relatively low IOPS capacity. They may be good at writing and reading sequential data, which is what happens when you dump some nice 4k ALL-I 400mbps GH5 footage on one, for instance, but it may be struggling heavily with small files. I tried running Zeronet with the data directory on a NAS attached via a 1GBPS connection, which is some 100-120MB/s throughput, and it was a chore just browsing zero. The latency and iops of the magnetic disks killed the experience. SD cards have a similar problem, and even if they were quick enough and didn't wear out rather quickly, having the site there would be a bit of a choppy experience due to the slow access of numerous small files. I've got more than 100k files in my data folder, and it's not even a huge amount of stuff.",
				"added": 1572798760
			}
		],
		"1573407833_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 3,
				"body": "Things are going well, there's virtually nothing I could complain about. Improvements are always to be had, but today is a pretty good day.",
				"added": 1573409581
			}
		],
		"1578171577_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 4,
				"body": "Sounds like a rather hard target. I'd guess if they were to strike they would go after US interests overseas that make soft targets. Hotels predominantly visited by americans, bars full of expats watching NFL, baseball etcetera. A head on conflict with the states isn't in their interest, but swatting soft targets here and there definitely is in the cards.\n\nThis is not a good look for the US, best of luck fellas.",
				"added": 1578178571
			}
		]
	},
	"comment_vote": {}
}