{
	"next_topic_id": 27,
	"topic": [
		{
			"topic_id": 1,
			"title": "法西斯和共产主义的区别是什么？",
			"body": "纳粹德国和前苏联的一些做法看起来很相似啊，极权统治，领袖崇拜，严格控制人民思想，没收资本家的资产，给人民勾画一个貌似无限美好的前景等等。那么，问题来了，法西斯和共产主义本质性的区别是什么？\n\n---\n\n去掠夺其它人。法西斯利用唯出生地论（民族主义）拉拢人，共产主义利用唯阶级论（无产阶级）拉拢人。\n\n他们都利用人多力量大在短期内专注于某些经济建设取得一些成就，但缺乏延续性。因为他们的本质是对外掠夺，而不是对外合作。所以要么发动战争来形成消费循环（成就就是军工），要么就因结构失衡而失去民心。\n\n想像一下，希特勒靠军工和可用于军事的基建来提供就业，如果不发动战争，做出大量坦克军舰摆在仓库里生锈，而工人工资只能是靠增发货币来解决，必然通货膨胀而亡。发动战争后，从国外掠夺到真金白银，再来发工资才能形成循环，因为帝国的信誉只能是一时，最终还是靠真金白银才能支撑信誉。\n而斯大林之流同样是靠投入领导所喜好的行业，如军工，来拉动经济增长，但同样因为集权，不会均衡发展其它行业如有关民生的轻工。\n\n因为最高独裁者的需求才被当作是国家的需求，民众的需求放一边，只会满足一时，不会满足很久，所以就算和平也不会持久。就算他们拿下世界，天性就要划小圈子的会不断划小圈子，所以会是不断地对内战争，不断找出新敌人来消灭，原因就是他们天然不爱合作，只爱掠夺。\n\n> https://www.zhihu.com/question/30629229/answer/89293211",
			"added": 1520104143,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "网站更新：恢復帖子正文段落間距",
			"body": "@p2p 用這個文件替換 `all.css`\nhttps://gist.github.com/anonymous/741ccd9a2e5c648c18a673821ce8792d\n\n這使得看長文更方便 (https://github.com/HelloZeroNet/ZeroTalk/pull/55)",
			"added": 1520104738,
			"parent_topic_uri": "14_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "赵囯基本政治概念",
			"body": "- 共产主义\n无政府，自洽，各尽所能，各取所需\n例子：天堂\n\n- 社会主义\n大政府，共有，一切由政府管理\n共产主义的半成品\n例子：高税收高福利、大锅饭\n\n- 马克思主义\n要达成共产主义，首先要达成社会主义\n劳动者产生阶级意识，通过无产阶级革命推翻资本主义专政，以无产阶级专政取而代之\n\n- 列宁/斯大林/毛泽东主义\n暴力革命，建立集权政府，掠夺有产者\n极端化的马克思主义\n\n- 中国特色社会主义\n[权贵资本主义](?Topic:8_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6)",
			"added": 1520104872,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "劉仲敬：「親穆」與「反穆」",
			"body": "共產主義搞解構的目的是，每一次被它分化以後，你就會淪落到比原來更差的地步。而諸夏和解體論的目的恰好相反，是為了通過脫亞入歐，使每一個主體在解體以後都能夠處在比原先更高的位置，正像明治維新以後的日本從東亞變成歐洲的一部分一樣，是讓你在歧視鏈上面升一級。\n\n穆斯林問題按這種原則是可以很簡單地判斷的：在西方，穆斯林化是一種解構，是使西方文明從它原有的高度上下降了一格，但是在東亞就並非如此。所以你如果在歐洲的話，支持穆斯林是不對的，是降低了它的文明水準，但是在共產主義國家內部的話，支持穆斯林則是對的，因為這等於是提高了核平區原有的文明水準。\n\n共產黨會在深圳修清真寺，因為深圳不是傳統的穆斯林地區，如果插幾個穆斯林社團進來，那麼粵東原有的社會組織就要像法國原有的社會組織一樣受到損失。同樣的道理也適用於杭州，如果在杭州大修清真寺的話，那麼吳越的社會組織就要因為伊斯蘭化而受到損失。這種事情匪是在不斷地幹的。另一方面，在傳統的穆斯林地區，無論是西安斯坦、寧夏斯坦還是東火雞斯坦諸如此類的地區，因為這些地方的土豪都是穆斯林商人、穆斯林資本家，他們原有的社會組織和土豪都是伊斯蘭的，所以在這些地方，匪恰好不但不會搞伊斯蘭化，反而會盡可能地破壞他們，去鎮壓他們。\n\n如果你是個粗心的觀察者，用親穆和反穆這樣的方式來判斷的話，那你是永遠也搞不清楚的。其實穆斯林本身並不重要，關鍵是在於，穆斯林是土豪還是無產者。在法國，穆斯林發揮了無產者和解構者的作用，所以共產黨會希望把溫州人也變成跟法國穆斯林一樣的解構者；但是在喀什和寧夏，穆斯林是土豪，而駐馬店移民才是解構者，於是在這種情況下，它就會表現出反穆的一面了。\n\n其實「反穆」、「親穆」根本不重要，重要的是，你是解構還是建構：你是想要使組織變得更簡單，還是要使組織變得更複雜。用這個根本原則來判斷，你就能夠看出誰是站在正典一邊的，誰是站在破壞者一邊的。共產黨永遠是站在破壞者一邊的。\n\n> https://medium.com/@LiuZhongjing/親穆-與-反穆-c94384ce236a",
			"added": 1520160166,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "劉仲敬：從列寧主義到納粹主義",
			"body": "問：為什麼列寧主義國家喜歡在体育上搞舉國体制？\n\n答：這個跟計劃經濟的方式是一樣的，把所有資源都集中起來，按照顛倒輕重的順序，把最符合國防和戰略需要那一小部分裝點起來，代價是犧牲農業和輕工業大部分利益。其實列寧主義整体都是這樣的，集中力量辦大事、組織化和格式化的目的都是把所有資源集中起來，培養極少數人，然後這極少數人在大量資源的援助之下，自然而然的顯得有突飛猛進的成績。自然發展起來的東西不可能那麼快，就好像你不可能在一個生態系統中間，把地衣、苔蘚、微生物的資源全集中到極少數寵物身上。如果你能夠做到這一點，那你的寵物一定能以神速的速度長得非常之肥壯。但是正因為是這樣，在底層被擠空了以後，雙方之間的差別會顯得非常之刺目，像是波江金新農村和特供食品那樣，基層小學的破敗体育場和奧運村，就是体制的寫照。\n\n問：托勒密 + 桑弘羊 + 列寧 + 發財慾望最強降虜 + 偉大敘事… 這種至賤模式應該沒有先例吧？如此模式會有什麼樣的特殊路徑和結局？\n\n答：列寧黨取代秦始皇或者是取代商君李斯的法家模式，其主要意義就是，它統治下的社會的秩序進一步流失。相對於儒家，更不要說是相對於西方其他体制而言，法家面對的是一個秩序更少的社會，所以它需要把更多的事情集中到吏治國家手裡面。但是即使它在社會最基層，家族、家庭這個層面，還保留了一定的自主權；而列寧黨把這個最後的堡壘也摧毀了，所以它面臨著一個更加散沙無序的社會，因此它必須把更多的資源集中到上層，把更多的事情交給吏治國家。而它統治下的人民，連秦政之下所能保持的那些家庭內部的習慣法也都根本消失了。這是一個更加缺乏秩序輸出能力的社會，反過來說，它就需要有更強的起搏器。因此它所造成的大洪水，會比秦政崩潰的大洪水要來得更厲害。\n\n問：您提到的秦政下殘留家庭習慣法包括哪些內容？\n\n答：家庭教育、嫁妝、為兒童保留的特殊財產，諸如此類的東西。這些東西是秦政所達不到的，而且也是秦政所需要的，不留下這個保留地的話，耕戰良民的体系本身是無法維持的。秦政之下所有人，儘管公家可能有什麼特殊的繇役，各種各樣的東西，本身是以武斷的方式下達到小共同体，但是家庭內部始終可以在那些即使是繇役体系存在的情況下，他也可以在繇役承包或者支付的過程中間，為家庭保留足夠的空間。政權的最核心機構頂多是到像百夫長、里長那一級，這些人是只負責跟家長打交道的，他不能夠越過家長跟家庭成員內部打交道。家長仍然對家庭成員享有一定的權威，而家庭內部的約定俗成的規範仍然是不受干擾的。\n\n問：目前社科院重新恢復計劃經濟研究所、越來越加強黨管國企以及國企對經濟的作用等等，請您評價一下桂枝退回計劃經濟的可能性及對未來的可能影響。\n\n答：市場本質上是分散決策，分散決策的好處是可以保留地方性知識 — — 隱秘的知識，這些隱秘的知識佔了人類知識的絕大部分；而能夠成文的知識只是其中一小部分，能夠成文的知識中，也就只有一小部分中的一小部分能夠整合起來形成統一的計劃，也就是說在計劃過程中，你不可避免的要把信息量的絕大部分損失掉。而信息就是財富的對應物，信息損失就是財富損失，因此計劃經濟創造的財富一定比市場經濟要小。但是決策一旦分散了，對列寧黨是不利的。列寧黨的優勢在哪裡呢？就是它是一個刪除者，它能夠把別的信息大量的刪除，把信息集中到自己的手裡面。所謂知識就是權力，列寧黨能夠集中權力，就是因為它能夠封鎖和集中信息。所以這兩者之間是極端矛盾的，發展到一定程度以後，那你就是不進則退了，要麼列寧黨重新把信息和權力分開，就會引起他巨大的不安全感。列寧主義的本質不是階級鬥爭，而是先鋒隊組織。先鋒隊組織和市場經濟結合，最簡單的描繪就是納粹模式。黨委進駐企業，不損害資本家的分紅和日常管理，但對政策性問題實施引導，比斯大林主義更加仁慈高效。斯大林主義和法西斯主義是列寧主義的兩個分支，納粹主義是法西斯主義和斯大林主義的組合拳。\n\n問：納粹的意識形態屬於左翼還是右翼？\n\n答：當然是屬於左翼的，國家社會主義德國工人黨嘛，名叫「社會主義」和「工人黨」的怎麼可能是右翼。從技術上講，納粹是兩個主義的綜合，一個是法西斯主義，一個是斯大林主義，而這兩個主義都是列寧主義的直接後裔。墨索里尼原來是社會黨人，他改變社會黨的議會道路，轉而搞群眾暴力，就是從布爾什維克奪權獲得的啓示。布爾什維克原先是少數派，但是少數派的流氓戰鬥力很強，別人都在文質彬彬開會的時候，他找一些逃兵集團和打手進來把你的會議衝散了，把代表都趕走了，他的少數派佔領了會場，於是第一屆蘇維埃就變成第二屆蘇維埃了。墨索里尼就是學了這一套，他先在自己的秘密基地訓練一些身強力壯、頭腦簡單的打手，然後去衝別人的集會，用這種方式奪取了政權。然後納粹又是學了他。\n\n問：為什麼您認為沒有蘇聯，納粹就不會上台？\n\n劉仲敬：沒有蘇聯就不會有墨索里尼，沒有墨索里尼就不會有希特勒。蘇聯創造的，準確的說是列寧創造的這一套統治技術，在當時的世界上是全新的，沒有人真正能想到它居然能夠存在。一旦存在以後，就像是你發明瞭一個工具一樣，就會有很多人出於羨慕它的效能而學習這種工具。如果沒有這第一個發明的話，後來的模仿者可能就沒有什麼東西可以模仿了。發明創造是困難的，模仿其實很容易的。一旦有了這樣的工具的話，你就很難防止其他的野心家去模仿，何況本來就是思想系統相近的人。如果沒有蘇聯和列寧主義体系的成功的話，墨索里尼恐怕還是社會黨一個分裂派別的首領，沿著第一次世界大戰以前老社會黨的作風，就走不出什麼大麻煩來。而希特勒呢，連墨索里尼這個榜樣都沒有，他那個社會主義工人黨就無異於一戰後眾多只有口號沒有機構的泡沫黨。\n\n*2016 年 8 月微信答問*\n> https://medium.com/@LiuZhongjing/從列寧主義到納粹主義-e100f5a5db36",
			"added": 1520160242,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "劉仲敬：陽光燦爛的貴國",
			"body": "越南在經濟上相當於僅有吳越、南粵兩個三角洲的貴國，廢戶籍 對應 廉價年輕勞動力交換國際資本，特別是日本資本的交易，配合日語第二語言和弧形包圍圈【國際資本轉入東南亞】。列寧黨打土豪消滅了本土資本，導致 國際資本輸入 和 勞動力降價 必不可少【打破舊世界 與 建設新世界，是兩種不同的能力】。\n\n貴國在其勞動力年輕時，不能實行類似政策，是因為奧斯曼主義【帝國超民族主義】包袱。戶籍制度是諸夏諸亞分離【地方自治】的替代品，廢除戶籍的效果相當於十幾個蠻族入侵，超過了奧斯曼主義的承受能力，因此只能聽任大量主要出口資源白白浪費。目前貴國勞動力已經老化，廢除戶籍只有壞處沒有好處。因此**再列寧化【文革 2.0】**非常必要，至少可以解決老年農民工的計劃死亡問題。\n\n再列寧化要解決組織覆蓋不及的社會漏洞，必須恢復兩棲人口【東林黨，買辦階級】的有效管理，如果附帶還能實現重要資源的實質國有化，當然是最好的。第一步，通過土地確權固化農地關係。第二步，通過以土地換工作和以土地換福利，實現土地資源再國有化和農業勞動力臨時工化【土改 2.0，回收房子，順便解決房價問題】。通過城鄉積分制【社會信用系統】對接實現黨委領導淡馬錫公司的新社會主義【政府想管什麼事，就把什麼事包給幾個大公司，美其名曰市場化】。\n\n格式化總會產生多餘人，多餘人就是清理對象。大部分私人企業是直接間接為外企或國企打工的，在黨委【黨支部】進駐指導以後，就可以將其實一直存在的分層管理正規化。為國企或有關部門服務的私人企業，正式納入掛靠單位的管理體系【混改】。為欽定技術輸入型外企服務的私人企業，正式納入匪諜機構的管理體系【雲上貴州】。極少數缺乏大局觀的私人企業，自己希望的定位總是不符合組織安排的，經耐心批評教育仍然不接受合理安排，那就只有按敵對勢力處理了【谷歌】。\n\n社會重組以後，人人都有組織關係，不留任何死角，到處陽光燦爛。貴匪江山永固不成問題，前提是要首先解決兩個小小的麻煩。社會重組必須依靠基層組織的戰鬥力，而基層組織的渙散，歸根結底仍是上層的派系鬥爭造成的，不可能僅僅依靠整頓基層幹部【反腐】解決。鑒於派系已經乏到以保證不再追究責任為交易條件的窩囊境界【不反習】，勝利者宜將剩勇追窮寇大概是不成問題的。百分之五的比例【屠殺率】很科學，經過布爾什維克長期革命工作的考驗，不是哪個偉大領袖拍腦袋的產物，事實上在當年的東歐和諸夏，凡是沒有完成指標的地方，最後都出了問題，凡是後來沒有出問題的地方，當時都是超額完成任務的。總之屋子打掃乾淨以後，再不會有郭文貴之流膽敢跟組織討價還價的角色。\n\n第二個小問題就是早在陽光燦爛以前，就會發生大規模人道主義災難【新疆模式】，然而貴匪存在的價值，不就是替世界解決資產階級無法解決的問題嗎？\n\n偉大領袖在故宮還是在瀛台接見川普，對川普和美國沒有任何意義，除了受刺激過多的野知識份子，沒人會以為你對川普好一點或壞一點，就能把他從既定軌道【涼戰】上拉出來。埃及豔后能左右的凱撒和安東尼即使有可能出現，時間也必定在目前所有活人棺木已拱之後，意義在於保證偉大領袖生活在自己的特殊世界內【美帝不是救世主，贏國的人口淨化是贏國的內政，美帝對一個閉關國家的影響力很小】，不能進入這個特殊世界的神經病【正常人】，今後將會主動或被動地推出中國人和土豆饅頭配給證【糧票】領取者的行列。陽光燦爛的貴國對應一條正態曲線，左面最低處是崇禎，右面最低處是金三，薩達姆和阿薩德在最高峰招手⋯⋯\n\n窩老人家真是宅心仁厚，自己都把自己感動了，考慮乃們這些神經病早晚是做不成中國人的，大多數又沒有跑路的能力，與其將來讓人家開除中國人，還不如自己主動開除貴國，撿起窩老人家大慈大悲發明的諸夏旗幟，將來搶土豆分黨妹的時候，一方面師出有名，一方面也可以加強凝聚力，自己練熟了台詞，在自己人內部的階級地位也可以高一點，分土豆可以多幾個，分黨妹可以挑挑撿撿，對國家集體個人，都是有百利而無一害⋯⋯\n\n麥卡錫以後，貴國高校理科生就要去夾邊溝【立新農場】了。他們存在的價值跟 開明仕紳 和 愛國資本家 一樣，前者是騙國民黨錢和武器的，後者是騙帝國主義錢和技術的，騙不到了，就要土改和公私合營，但他們自己還以為就憑量子通信，已經把貴匪和帝國主義兩頭都騙住了⋯⋯【真正的身份實際上是一個已經被用完了的統戰對象，即將恢復作為階級敵人的本色】\n\n世界上的傻瓜，比傻瓜想像的數量少得多，傻瓜心目中的傻瓜，大多數都是別有用心，不過最後關係不大，別有用心的傻瓜 和 以為全世界都是傻瓜的傻瓜，都會驚喜地發現，原來大家還真的都是傻瓜⋯⋯\n\n貴國理科生以為山東老幹部【黨員】很好騙，連水變油和量子通信都信，其實貴匪留著他們只是當白手套，方便把偷來的東西說成自主研發的，正如太平天國所說，汝輩書生做得甚事。貴匪以為帝國主義很好騙，不知道自己是在地面上收了黃金降落傘的定金，不肯打開降落傘，就要直接跳下去，想下飛機，可是已經在天上了。\n\n2017年11月6日\n\n> https://medium.com/@LiuZhongjing/陽光燦爛的貴國-3ca3ba2f1b73\n\n---\n\n相關：\n- [2018 中国政治【最傻的傻逼都眼見為實】](https://www.pin-cong.com/p/85554)\n- [假國家](https://www.pin-cong.com/p/71287)",
			"added": 1520160452,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "反对安倍修改宪法",
			"body": "看到个笑话，说日本人敢上街反对安倍修改宪法，中国人也敢上街反对安倍修改宪法。\n琢磨了一下，现在说反对安倍修改宪法怕是不行，怕是要被当指桑骂愧。\n再琢磨琢磨，有影响力的人可以号召大家在网上反对安倍修宪，这样不久安倍修宪也会变成敏感词。\n\n> https://twitter.com/io_over/status/969898032287248384",
			"added": 1520507355,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "被美国忽视的间谍活动威胁：中国",
			"body": "当所有注意力都集中在俄罗斯干预 2016 年美国大选一事上时，中国对美国进行的活跃而持续的间谍活动受到了忽视。\n\n事实上，对俄罗斯的关注已经掩盖了中国情报和网络间谍造成的重大损害。在一些案件中，中国已经展示出它能比俄罗斯更熟练地渗透美国的情报机构。\n\n涉及前任中央情报局 (CIA) 官员李振成 (Jerry Chun Shing Lee) 的案件就是一个很好的例子。从 2010 年开始，CIA 在中国的线人开始失踪；据报道有十多人被处决，还有几人被监禁。在中国内部建立 CIA 间谍网的行动原本看起来是成功的，结果却变成了一场毁灭性的情报失败。怀疑有内奸的 CIA 和联邦调查局 (FBI) 进行了一次秘密搜捕。\n\n曾在北京执行任务的李振成成为头号嫌疑人。他在 1 月 15 日飞抵纽约，随即被 FBI 逮捕，被指控非法保留涉国防信息的文件。但目前仍然无法确定特工的损失是否是他造成的。\n\n中国政府从事间谍活动的方法与俄罗斯和美国不同。它通常更为耐心。中国可能会花数年时间培养一名线人，并安插到美国的情报机构中。但他们成功地在 FBI、CIA、五角大楼和国务院内部做到了这一点。\n\n一些分析人士把北京的成功归于美国对中国的方式缺乏了解。前任 FBI 中国分析师保罗 · 摩尔 (Paul Moore) 这样解释了它们的不同之处：\n\n「如果目标是一片海滩，俄罗斯人会派出一艘潜艇，潜水员会在黑夜里偷偷上岸，收集几桶沙子，然后带回莫斯科。美国会派出卫星并产生大量数据。中国人则会派出一千名游客，每人被派去收集一粒沙子。当他们回来时，他们会被要求甩动他们的毛巾。他们最终会比别人更了解那些沙子。」\n\n换句话说，中国人有无限的耐心。一个真实的例子就是，中国试图把一个名叫格伦 · 施赖弗 (Glenn Shriver) 的男子作为内奸送到 CIA。施赖弗在一个密歇根州的郊区长大，大学时学了中文，2004 年在上海学习时，他应征了一则要求写一篇关于中美关系的文章的启事。一个自称阿曼达 (Amanda) 的女人付给了他一小笔报酬，然后把他介绍给了一位「吴先生」和一位「唐先生」。这三人都是中国国家安全部的特工。\n\n他们怂恿施赖弗申请美国国务院的工作。他参加了两次外交人员的考试，未能成功，但得到了 3 万美元（约合 19 万人民币）。接着，他又得到了 4 万美元，用于申请加入 CIA 的国家秘密行动处。此时美国人已经注意到了他。2010 年，他被诱导回到美国，以为那是最后一轮的筛选，被捕后，他接受了一项认罪交易，被判处四年徒刑。\n\n中国在渗透美国情报机构方面最惊人、最可怕的行动，出现在 FBI 招募洛杉矶知名华裔美国人陈文英 (Katrina Leung) 之后，招募她是因为，她被认为与中国政府内部许多人有联系。但后来事实证明，她在加州与两名 FBI 高级反情报特工——詹姆斯 ·J· 史密斯 (James J. Smith) 和小威廉 · 克里夫兰(William Cleveland Jr.)——保持着婚外情，并从 1984 年开始从事双重间谍活动长达 18 年。\n\n陈文英被控向中国国家安全部高层直接提供她从史密斯的公文包中窃取的 FBI 机密。她被监禁或软禁了 21 个月，而后接受了一项认罪交易，接受了假释、社区服务和罚款的处罚。\n\n中国还设法获得了三叉戟 (Trident) 潜艇导弹顶端的 W-88 热核弹头的设计细节。尽管 FBI 调用了 11 个机构的 300 名员工，进行了为期四年的调查，但一直没有弄清中国是如何获得图纸的。\n\n在李振成的案件中，他一直被怀疑帮助中国破坏 CIA 在中国的网络。但是，出于至今未作说明的原因，2012 年他和家人一起返回弗吉尼亚州北部定居时，尽管在他的酒店房间和行李中发现了两本小册子，但他没有被捕。法庭文件显示，这两本小册子上手写记录着与 CIA 在华线人会面的信息、他们的真实姓名和电话号码。\n\n先不理会他的案件结果会如何，为什么过了五年才逮捕他？2012 年，在发现可能的犯罪材料时，内奸调查者在是否采取行动上出现了分歧。反间谍机构更喜欢在间谍嫌疑人向外国势力传送机密的过程中实施抓捕。他们往往也更喜欢观望一段时间，看看一名嫌疑人是否能引出其他嫌疑人。在李振成的案件中，有些调查人员还怀疑抓错了人。\n\n此外，调查人员认为，除了内奸，网络被破坏可能另有原因，比如 CIA 在华官员的谍报技术太差，或者是通讯泄露。\n\n过去也出现过情报机构被危险的内奸渗透的情况，比较著名的有 CIA 的奥尔德里奇 · 艾姆斯 (Aldrich Ames)，他的背叛导致 10 名线人被俄罗斯处决。还有 FBI 的罗伯特 · 汉森 (Robert Hanssen)，他曾为苏联以及后来的俄罗斯做了 18 年间谍，导致 3 名美国线人死亡。两人都在终身监禁中。\n\n在 FBI，针对中国的反情报工作并不是最好的职业发展道路。数十年来，该局抓捕间谍的资源几乎都用在了俄罗斯身上。现在，俄罗斯情报机构对 2016 年大选的干预暴露出它对美国民主制度的明显威胁，盖过了中国的间谍活动以及其他许多事情。\n\n然而相比俄罗斯，在超级大国地位的竞争中，中国无疑才是更大的对手。被粉碎的 CIA 在华网络将需要数年时间才能重建。尽管逮捕了李振成，反间谍机构至今仍未解释到底发生了什么。\n\n> https://cn.nytimes.com/opinion/20180306/china-espionage",
			"added": 1520525271,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "Apple ID 被盗，iPhone 和 iPad 被恶意设为丢失模式怎么办？",
			"body": "说来惭愧，我这个 IT 人也遇到了这个问题，只好悻悻的说被骗的不光是非从业人员，还有专业人士。\n我的一部 iPad 丢失了，当我启用了丢失模式之后，在丢失信息上上面留下了我的电话 (我当时天真的想如果他也是被骗所以才买了一个偷的 iPad，可能也是受害者，现在想想还是应该留 QQ 比较好)。然后不到 1 小时，我收到了一条短信 (香港的号码)，看上去很正式，内容大概是你的某台 iPad 设备, ID 是多少多少，现在正在维修站准备重置，如果是您自己的操作请忽略，如果不是请登陆 http://apple.findmyphone.com 进行登记，我们将尽可能配合留下设备。当时对苹果的崇敬无限放大，真牛逼既然给我留下了，呵呵，喜悦冲掉了我的谨慎，点击链接后是一个 iCloud 登陆的页面，我尝试登陆，提示密码错误，这时我马上意识到可能被骗了。\n\n我就赶紧想要改我的 Apple ID 密码，已经来不及了，对方马上修改了我的 Apple ID 密码，而且在 3 分钟内修改了 Apple ID（我惊呆了，Apple 竟然这么奇葩 ID 也可以被修改），我马上尝试找回密码，尽管我有登记邮箱、有 Apple ID，有密码回答问题，但是这一切竟然都没有任何保障，因为按照苹果的所谓账户保护措施，只要有了 Apple ID 的账号和密码，都可以修改，也就是说我的 Apple ID 被改了，所以我压根不知道新的 ID，而且密码找回回答问题也可以修改，所以我守着我的两台 iPhone 和一个 iPad 看着对方发过来的 QQ 号码 (骗子扣扣 12346195) 锁屏，我竟然毫无办法。\n\n对方开价 600 给恢复，作为苹果的粉和这家公司的信任我是不屑的，我马上联系了苹果客服 400-666-8800，寻求解决方案，客服还是尝试帮我找回密码，但是骗子已经修改了 Apple ID 的账号名和密码重置问题，所以他们也毫无办法，给我升级到账号和账单部门，来回转了三次，通话时间大概 50 分钟，最后的他们向我证实了以下问题\n1、这种情况他们见了很多，我不是个案，希望我别着急；\n2、**如果一旦知道了某个 Apple ID 账号和密码，不管是账号、密码、密码重置问题、邮箱等所有的信息都可以马上修改，也就是说其实你的密码丢了之后，只要对方修改了其他信息，你不可能找回来你的 Apple ID，因为你连用户名都没了，你所有设的所谓密码找回问题都是然并卵的作用；**\n3、账号我们没办法帮你找回来了，但是你的设备我们可以尝试帮你去掉丢失模式重新激活，需要你上传包装盒、三包卡、购机发票 (发票上要求要有手机的 IMEM 号，否则无效，但是我多个朋友协助我一起证合约机发票上根本就没有 IMEM 号)，而且缺一不可，而且如果没有他们也不处理。\n\n我和这个账号和账单部门的人讨论起来为什么我的账号连用户名都可以修改，什么都可以只要有一个密码就所有的安全措施都失效，那要密码找回又有什么用，对方绕来绕去拒绝回答，我以忠实用户的名义告诉他如果你们不处理，我要投诉，并且要电话录音，对方直接挂断电话，并且再未联系我，到这个时候我的心已经凉透了。当然我打了第二通电话，也了解到**苹果公司对客服人员要求，客户只要说我在电话录音就直接挂断**，而且我要投诉刚才客服的时候，对方也直接挂断说，我们只会随机发放调查问卷，不接受投诉，还是以我可能在电话录音为由直接挂断，留下傻在一边的果粉，最恶心的是**当你拨通 Apple 的 400 电话时，对方明确在说，我们正在对电话进行录音和监控，而如果换回客户如果这么做，等到的永远就是电话直接挂断且不会有任何理由**…… 当我尝试脑残的想解释通这个问题时，我无法欺骗自己说这是一个多么负责的公司，我的失望和沮丧冲淡了我对苹果这家公司所有好感，那种感觉就像一个被其他人欺负的小学生找到老师申诉，老师高傲的挥挥手跟我说，一边玩去~~\n\n接下来我能做的只有准备资料，发现我的 iPad 的资料已经好几年了不太可能找齐这三个证明文件，另外一台买了快两年的 iPhone 的发票也很难找到了，只有一个 iPhone 的资料是齐全的，准备开始上传。\n\n在跟骗子的聊天中，骗子通过 IT837384#163.com 的支付宝账号索要 600 块，一边是付钱就可以给解锁，一边是无法提供只能当砖用的 iPhone，还有我那找不回来的通讯录和照片和等等等。\n\n我想之所以出现这样的问题，客观总结一下，主要有两个原因\n1、自己的疏忽大意让骗子得手；\n2、苹果的账号管理机制存在重大的逻辑缺陷，只能避免自己遗忘密码找回，无法避免被盗用后找回，我们都知道密码找回应该是和修改密码不同的认证方式和逻辑，否则就失去了双重验证的意义，但苹果恰恰就是在使用这样的逻辑在处理问题，就好比你的银行卡密码丢了，你去重置，发现你不光密码丢失了，银行卡号也被重置了，身份信息也被重置了，而且即便是你提供了所有的证明文件也只能是说可以让你当一台新的 iPhone 重新激活，你的所有资料也没了。\n\n> https://www.zhihu.com/question/35156106/answer/62298626",
			"added": 1522737868,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "劉仲敬：假國家",
			"body": "还是要搬运，毕竟雅俗共赏正本清源。来自阿姨蛇口演讲。\n\n1，无产阶级专政建立的政权，它不叫国家，它叫 semi-state，它不叫 nation。state 跟 nation 不一样的。state 是邦国，只要能够实施有效统治的邦国都叫 state。列宁他不承认有 nation 和民族国家，因为 nation 和民族国家是什么概念呢？它就等于承认有一个真实的国民共同体，国民共同体有权通过选举或其他方式来决定自己的命运。而列宁是坚决否定这种概念的，认为这纯粹就是资产阶级的欺骗。（推友说这其实是托洛斯基原创。）但是即使如此，列宁仍然不愿意把苏联或者无产阶级国家叫做 state，他把它叫做 semi-state，半邦国。\n\n**什么叫做半邦国？说得干脆点，它是一个统战的白手套。**真正的统治者是布尔什维克和共产党，但是在世界革命得以最后成功以前，我们还不得不跟资产阶级国家这些虚伪的国家一起混，我们如果没有一个国家作为白手套，我们没法跟它打交道，我们是要吃亏的。这样子怎么办呢？**尽管我们否定国家，但是我们为了统战和利用资产阶级，我们必须制造一个 semi-state，一个假国家。**\n\n这个道理跟政协会议的道理是一样的。虽然我们实际上是要把一切权力归中国共产党的，但是为了欺骗和利用资产阶级，团结最广大范围的人民，我们要召集政协会议，政协会议里面必须包括众多的傻瓜，这些傻瓜以为共产党既然讲过新民主主义，那是不是可以给他们制定一部宪法，实施宪政呢。我们先把这些傻瓜骗起来，骗进来成立一个中华人民共和国，等他们进了以后，我们自有收拾他们的办法。\n\nsemi-state 是列宁主义的精化所在，semi-state 产生了统一战线的概念，统一战线则产生了社会主义国家的概念，社会主义国家本质上则是统一战线最核心的一部分。\n\n社会主义国家都是双重的，它的核心是建立在共产党的基础上的，不用说；它的外围，也就是它的表面或者白手套，是建立在爱国统一战线支持的国家上面。爱国统一战线，就是实际上由共产党控制，但是表面上由资产阶级头面人物出头。是共产党的那种统战式的国家概念。**这种国家概念的实质是欺骗。我们希望，你们跟我们打交道的时候把我们看成是国家，但是我们自己绝对不把自己看成国家。**\n\n这不是开玩笑。就是说是，我们制定的法律不像是所有国家的法律那样是能够行使的。你们自己以为你们是中国的公民，根据中国宪法实施某种权利；但在我们看来，中国本身就是一个白手套，中国宪法这个东西就是欺骗你们这些资产阶级的一种东西。我们需要利用你们去对付香港资产阶级或者美国资产阶级的时候，我们暂时容许你根据中国宪法，想象你有中国的公民权利如何如何；但是在我们没有敌人或者敌人变得不再可怕的时候，我们就要让你们明白，中国宪法像废纸一样的不值钱，你自己真正的身份实际上是一个已经被用完了的统战对象，即将恢复你作为阶级敌人的本色。\n\n这个问题才是中国一切宪法问题的根本。所以现在的中国，因为大家用「国家」或者「中国」这个词，都包含了各种互相矛盾的概念，所以本质上讲就是自说自话，各自都在运用自己一厢情愿的逻辑，去想要迫使别人按照自己希望的方式去理解中国。这样的讨论当然是不会有结果的。\n\n（搬运结束，全文太长太精彩）\n\n> https://twitter.com/Jamescrtu/status/874625273827794944",
			"added": 1523986824,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "將最寶貴的信息裝進漂流瓶：評劉仲敬《近代史的墮落》",
			"body": "我在臉書上看到一位台灣歷史老師感嘆說：「每次學生學到民國歷史的部分，都會鬼打牆似的陷入跟民初政治一樣的混亂狀態，猜想許多老師教到這裡即使有心，也因為歷史的複雜性導致自己也變得腦袋複雜起來了，最後師生皆敗在此段歷史情境裡，一屆過一屆，記憶力佳者硬背死背，管他死活，生吞活剝，求個保險。\n\n然而，這幾年大考的趨勢又不大考這個區塊的政治紛擾，考試引導教學加上人人都無法放心的結果，使得學生練題目求心安時寫到僵化死記的題目一旦寫錯了，就感到心底難踏實，積極點的甚至反過來以為是哪裡沒背到？又去背一些瑣碎肢離的知識，形成知識嚇人，人又被知識嚇到的折磨循環，於是乎，從中華民國建立到中華人民共和國建立這一段歷史，永遠都是師生的煎熬以及灰暗的教學區塊。」\n\n學生時代，我在彼岸的中國也有過類似的經歷。這個困局是否無解？我的建議是，拋開歷史教科書，讀一讀劉仲敬。\n\n## 歷史存在的意義是什麼？\n\n作為一門學科的歷史，其存在意義在哪裡？歷史學家陳寅恪有一句詩：「讀史早知今日事。」這是歷史學家特有的睿智，聖經早就說過：「日光之下無新事。」多年前，我寫關於陳寅恪的一篇文章就用這句詩為題目，無獨有偶，劉仲敬也用這句詩表達其歷史觀。「讓歷史告訴未來」是歷史學家的本分，做不到的人不配稱為歷史學家。在此維度上，王國維、陳寅恪、錢穆、余英時顯然比顧頡剛、吳晗、翦伯贊、范文瀾聰明得多（編按：後四者皆在文化大革命受害）。歷史觀念必將影響政治立場，而政治立場必然決定人身安危。\n\n在尚未受到中共當局嚴重的政治迫害之時，劉仲敬主動選擇自我流放、移居美國，也是出於此種史家的智慧。他對中國的未來持悲觀看法，他在一篇訪問中說：「在可以預計的未來，將經濟資源和組織資源留在國內發展，對個人而言不是最佳選擇。同樣的資源和時間，足以使他在海外取得更大的成績。如果有人一定要這樣做，就必須有利害關係以外的其他動機。對於根本沒有資源可以利用的人，其實本來就沒有選擇的餘地。他們必須自己發展這些資源，自己保護自己，面對其間無法預計的風險。」如果不願當殉道者或陪葬者，就要主動、提前規避中國崩壞之後加諸於個體生命的巨大風險。在過去一百多年的近代史上，類似的危機多次出現，彙集成了一條「近代史的墮落」的下垂曲線。\n\n我在《一九二七：民國之死》中，劉仲敬在《近代史的墮落》中，不約而同選擇「史傳」傳統（編按：史傳為一種歷史文學，除了刻畫人物，也寓含作者評論）呈現更為真實的歷史。我們對人物選擇和評價，迥異於國共兩黨的歷史教科書。\n\n## 國學大師王國維為何自殺？\n\n比如，我們都向被國共兩黨史家貶斥爲「保皇派」的國學大師王國維高度致敬。在北伐軍節節勝利之際，王國維為何會投湖自殺？他的自殺，不單單是受好友葉德輝被湖南暴民殺害（毛澤東在湖南掀起的「痞子運動」的後果之一）的刺激，更是因為他發現了中國近代歷史的可怕軌跡－－「以共和始者，必以共產終」，用劉仲敬的話來說就是：「黨軍是否打算害誰並不重要，因為黨軍出現的事實本身就如同老鼠跳上甲板、不再怕人的徵兆。」\n\n王國維是那個大時代最清醒的觀察家，他誓不受辱，質本潔來還潔去。果然，他棄世之後，國民黨征服半個中國，共產黨又席捲幾乎整個中國，並迎來「人相食」的「美麗新世界」。\n\n> 王國維，融合中西學術，在文學、考古學、美學、哲學均有相當大的成就，1927 年 6 月自沉頤和園。\n\n若放寬歷史的視界就會發現，二零一七跟一九二七有什麽差別呢？那麽，此時此刻，知識分子該如何自處？以六四大屠殺倖存者自居的劉曉波，決心與天安門母親站在一起，不畏將牢底坐穿的使命。如果沒有劉曉波「我不入地獄，誰入地獄」的犧牲精神和道德勇氣，誰能像劉仲敬那樣，忠實地記錄並傳遞真相：「如果你首先看到老鼠跳上餐桌，然後看到智者教育兒童不用害怕，最後看到救生艇莫名其妙地少了許多；你會不會急於研究老鼠的生物學特徵，或是急於聯絡愛貓人士捉老鼠？實際上，你最應該做一件事：將最寶貴的資訊裝進漂流瓶，投入大海。接下來的事情，不再與你有關。『孫盛陽秋海外傳，所南心史井中藏。』、『種子也許落入石田，也許落入沃土。』如是而已。」這樣做的人，仍然「多乎哉，不多也」。悲觀而不絕望、低調而不自卑，背後乃是「知其不可為而為之」的信念。\n\n劉仲敬的一系列歷史學著作，就是他奮力扔出的「漂流瓶」。他放入「漂流瓶」的那張紙條上，寫著哪些秘密呢？我從他的書中讀出了「三重解構」：**解構中華民國、解構中國、解構中華民族**。即便在國內的「公共知識分子」和海外所謂的「反共陣營」當中，這樣的解構也是不被待見的——誰願意傾聽耶利米（編按：猶太先知，苦勸猶太人悔改，卻親眼見證亡國）的哀歌呢？\n\n## 解構中華民國\n\n現今共產黨盡失民心之際，一群策士打起了「中華民國牌」。「民國熱」熱到高燒地步，孫文和蔣介石重新炙手可熱。在台灣已成為過街老鼠的國民黨，在中國卻是人見人愛的「香餑餑」（編按：比喻受歡迎或熱門）。這種思維方式就是：不要共產黨，就要國民黨。人們偏偏忘記了，國民黨和共產黨不都是蘇共培育出來的孿生怪胎嗎？沒有史達林和孫文，哪有毛澤東和蔣介石？中華民國（尤其是一九二七年後的南京國民政府）與中華人民共和國分享同樣的革命傳統和獨裁模式。\n\n我在《一九二七：民國之死》中指出，正宗的中華民國亡於一九二七年的黨軍北伐，形式上的北京政府在一九二八年灰飛煙滅。而在實質性的意義上，此前孫文和段祺瑞就已聯手終結了中華民國的法統。孫文不是中華民國的國父，乃是中華民國的催命鬼。\n\n劉仲敬《近代史的墮落》中關於孫文的一節論述不甚出彩，他在另一次的訪談中卻有一番石破天驚的論述：「廣州商團若能盡殲黨軍及蘇俄顧問，送孫、蔣二公回上海租界，則江東本部絕不至糜爛。」換言之，孫文屠殺商團，乃是南方「赤化」之開端，並敲響了中華民國之喪鐘。（編按：廣州商團向來有自衛傳統，因購買槍枝遭受蔣介石扣留而發動抗爭，反對以孫文為首的廣州軍政府。）\n\n孫文向商團開戰，使用的是對待敵國的屠城術。黨軍高層唆使理髮工人使用三百箱煤油引發大火，焚毀西關商鋪及燒死商團支持者。目擊者報告稱，軍隊佔據屋頂，向逃往街道上的商團和難民射擊，大群難民逃往太平馬路，被軍隊迫退回火區，直至焚斃，平民死傷約兩千人，是為「西關屠城血案」。\n\n> 廣州商團團長陳廉伯，兵敗後逃回香港，廣州西關商業區遭到黃埔軍屠城。\n\n武師黃飛鴻的「寶芝林」就在此次事件中焚毀，黃飛鴻絕不會向香港電影中那樣擔任孫文的衛士。此後，孫文在家鄉父老心目中聲名狼藉。一九二四年十一月，孫文離粵前夕，由廣東各界人民組織的「各界救粵聯合會」在香港發出通電，指控其「禍國禍粵」十一大罪狀：搖動國體，妄行共產主義，縱兵殃民，摧殘民治，破壞金融，抽剝民產，大開煙賭，摧殘教育，蹂躪實業，破壞司法，鏟滅商民團。\n\n站在孫文對立面的，是在國共兩黨官方歷史敘事中被妖魔化的廣州商團（編按：認為商團是受英美或直系軍閥操控，但沒有直接證據可證明）。劉仲敬爲商團平反說：「廣州商團本來是最接近歐洲式自治的，跟倫敦商會很像，只是不如它強大。」孫文鎮壓商團，扼殺了地方自治和資本主義的萌芽：「孫文以廣東為根據地，國民黨才能夠佔據江南，在東南五省建立自己的權力機構；然後蔣介石又把上海當成奶牛來擠，依靠上海來武裝自己，實現全國的中央集權；再然後蔣撕毀條約，結果就是爆發中日戰爭，中日戰爭就是以上海和東南部為主要戰場，戰爭的結果是把共產黨送上中國政治的中心舞臺。這一系列結果草蛇灰線（編按：意味留下隱約可循的線索），蘇聯始終是幕後的操盤手，而國民黨、共產黨始終是在起破壞性的作用。」\n\n商團被消滅，英美資本主義經濟和民主政治也被消滅，中國隨後走向蘇俄式的共產極權。神州何其不幸，真的中華民國如同短命的威瑪共和，假的中華民國則爲孫文修築超過帝王陵墓的中山陵。中國不是沒有走向自由的機會，劉仲敬有一番浮想聯翩：「孫文在廣州搞的軍政府，力量是很薄弱的，商團憑那點雇傭兵本可以平起平坐打一下，當時英國如果給力一點，或者商團的領導更強勢一點，說不定就把孫滅掉了，滅掉之後中國就會長期處在各路軍閥的統治之下，只要條約體系不破壞，那種前途肯定比國民黨和共產黨統治中國要好得多，後來一系列最壞的事情就不會發生。」\n\n民國並非國民黨獨霸的民國，還有其他被遮蔽的面向：廣州商團的民國，北洋的民國，章太炎的民國，黃興的民國，宋教仁的民國，個個都比國民黨的民國好（編按：因為他們心中的民國皆非列寧式的黨國一體）。\n\n劉仲敬指出：「什麼是民國？她不是一些事件，甚至不是一條道路，只是一個模模糊糊的方向。在這個方向上，也許有許多條路，也許一條路也沒有，也許有高速列車接送，也許必須自己開路。地圖是重要的，但不會比方向更為重要。道路決定命運，但方向決定了道路的命運。方向是價值決斷的產物，超乎實證知識的層面。價值源于產生你的傳統和你選擇的傳統，是一切論證的起點而非結論。如果你決定去更加溫暖的地方，你就要選擇去廣州的馬車、拒絕去北京的飛機。」然而，人們沒有拒絕而是擁抱「十月革命的一聲炮響」，民國成了沒有公民的「動物農莊」。\n\n## 解構中國\n\n在近代人物當中，我關注沒有掌權的梁啓超和章太炎，超過在政治前臺的袁世凱和孫文。所謂「觀念改變世界」，沒有愛因斯坦的相對論，就沒有原子彈；沒有尼采的「上帝死了」，就沒有希特勒修建焚屍爐；同樣的道理，清末民初沒有梁啓超和章太炎的論戰，也不會有以後「華夏」轉型爲「中國」，用劉仲敬的話來說就是：「一九四九年以後種種災難的根源在於，『中國』這個概念的建構。」\n\n> 章太炎為清末民初的思想家與史學家，也是漢族民族主義者。\n\n孫文不是中華民國的國父，章太炎才是，中華民國這個名字是章太炎起的。當孫文的徒子徒孫在蘇俄的金錢和武力的支持下顛覆中華民國法統之後，章太炎終身以「中華民國遺民」自居。幸虧他死於共產黨中國建立之前，否則「雙重遺民」的悲哀如何能承受。\n\n章太炎的中華民國與梁啓超的中國是相互對立衝突的概念，章太炎秉持筆政的《民報》與梁啓超秉持筆政的《新民叢報》在滿清顛覆之前論戰了十年。從表面上看，章太炎打贏了這場筆戰，因為此後近代史的車輪沿著革命的軌道而非改良的軌道前行；但從實質上而言，真正的勝利者是梁啓超。章太炎心目中的中華民國，是以「黃帝子孫」，也就是漢族為主體建構的近代歐洲式的民族國家，既然要「驅除韃虜，恢復中華」，在章太炎和革命派最初設想的中華民國當中，當然沒有滿族等韃虜的位置，起版圖也不再包括邊疆的「藩屬國」。\n\n而對於梁啓超來說，劉仲敬認為：「梁啓超沒有多少理由熱愛大清，但不能忘情於大清的版圖，看清了章太炎的『黃帝子孫』的理論早晚會導致帝國的解體，決定發明『中華帝國』、『中華民族』的同生態位概念，與『中華民國』、『黃帝子孫』展開競爭。」最後，梁啓超像孫悟空一樣鑽進了章太炎的肚子裡，革命派的口號從「驅除韃虜、恢復中華」變成了「五族共和」。也就是說要全面繼承清朝的帝國疆域與人口。\n\n正如劉仲敬所說「梁啓超和『中國』幾乎就是一回事，因為中國這個概念就是他創造的，創造者和創造物的命運始終難捨難分」，「中國」這個超級帝國主義的概念的發明，使得滿清雖然覆亡了，卻並未像奧斯曼土耳其和奧匈帝國那樣解體。從中華民國到中華人民共和國，雖然失去了外蒙等原有的疆域，但大清的遺產基本得以保留。而從另一個層面來看，大清的帝國遺產又成為「生命中不可承受之重」，使得中國至今無法完成現代民族國家之建構，在寬敞的龍袍與緊縮的西裝革履之間無所適從。\n\n中國雖然暫時逃避了鄂圖曼土耳其、奧匈帝國和蘇俄那樣的崩潰，但比那更嚴重的崩潰遲早會來。崩潰或許是新生的契機，劉仲敬作出的最好的設想是：「由於中國並不存在哪怕是廣州商團這樣脆弱的自治組織。博弈的結果很可能不是規則的建立，而是社會秩序的崩潰。在這場假設的崩潰以後，沿海地區將會面臨一個可以重新選擇命運的視窗期。如果這些地區能夠放棄太大的野心，滿足於切實可行的小目標，就能為自己爭取比民國時代更好的前途。…… 假定從上海到重慶、從大連到北海，存在一系列漢薩同盟式的自治市鎮，能夠爭取海上強國的政治保護，擁有五六十年的和平發展時間，政治自由是可能的。」但是，他其實深深地知道，這種美好的未來只是水月鏡花，現實中「只存在完全相反的格局」。\n\n## 解構中華民族\n\n梁啓超不僅創造了「中國」這個概念，還創造了「中華民族」這個概念。\n\n自古以來，儒家傳統中就有「華夷」之辯，清末革命派繼承了這個傳統，用「華夷之辯」來否定滿清統治的合法性。章太炎直接辱罵大清的皇帝是「賤種」，這種粗暴的語言在任何現代文明國家都會被判為種族歧視。而「蘇報案」反倒讓入獄的章太炎獲得了全國性的名聲。（編按：1903 年「蘇報」因發表激烈反清言論而被逮補查封，但引起言論自由與革命思想的風潮）\n\n與章太炎相反，梁啓超故意模糊大清和中國的邊界，用「中華民族」這一子虛烏有的概念取代本來就已經夠模糊的「漢族」，從而達成民族認同和疆域的雙重統一。儘管經過「五胡亂華」之類的大動亂以及意外達成的「種族融合」，究竟什麽是純正的「漢族」早已沒有人能說得清楚了，但「漢族」的概念仍然在華夷之間設定了一條清晰的「楚河漢界」——「漢族」這個概念當然是排斥滿、蒙、回、藏、壯等「蠻夷」的。梁啓超清楚地意識到如果堅持使用「漢族」的概念，必然導致清帝國的解體，所以他從日本化的近代西方社會科學種拿來一些四不像的素材，塑造成所謂的「中華民族」，以此彌合帝國的裂縫。\n\n可惜，滿清皇族不能理解梁啓超的一番苦心，他們對康梁的仇恨定格在戊戌年間，他們將梁啓超這個苦口婆心的救命醫生當作比章太炎更危險的顛覆者。他們以為百姓像綿羊一樣乖乖聽話，殊不知，百姓早已不相信朝廷說的一切，百姓甚至沒有耐心聽梁啓超講道理，而直接爲章太炎的謾罵鼓掌。\n\n> 梁啟超，「中華民族」的發明者，曾任中華民國司法總長、財政總長。\n\n就好像今天無論新華社說什麽，人們都認為是謊言；無論郭文貴說什麽，人們都認為是真相。清廷搞不清自己的狀況，改革是找死，不改革是等死，正如劉仲敬所指出的那樣：「朝廷尤其沒有意識到，在陌生的新媒體世界上，自己是極少數中的極少數。他們生活在聖旨和邸報的世界裡，總覺得讀者都是戰戰兢兢的奴才。」\n\n大清覆亡了，但中國並未浴火重生。革命派用章太炎的理論成功地妖魔化了大清，點燃了革命的烽火；但革命之後，革命派還是要將梁啓超的中國和中華民族的概念拿來爲我所用。梁啓超大概從未料到，特別是中華民族這個概念會成為蔣介石和毛澤東的意識形態利器，甚至比三民主義和共產主義更有吸引力，就如同盜火者沒有料到「星星之火，可以燎原」的結局。梁啓超晚年勸導被左派迷了心竅的子女居然效果不佳，奮筆與共產思想周旋，卻無法阻止歷史的巨石轟然墮落。或許，梁啓超並未意識到，他自己才是打開潘朵拉的盒子的第一人。\n\n梁啓超的「中華民族」與丘吉爾的「英語民族」這兩個概念，表面上看很相似，實際上南轅北轍。丘吉爾的「英語民族」背後是一整套文化傳統和宗教信仰，是大憲章和普通法，是喀爾文神學、清教徒精神催生的光榮革命，是今日在英美及說英語的國家內部生生不息的保守主義或古典自由主義的價值認同。\n\n而梁啓超的「中華民族」的背後則空空如也——這怪不得梁啓超，巧婦難為無米之炊，梁啓超固然可以無中生有地創造出「中華民族」這個概念來，卻無法在兩千年中國皇權專制的傳統中剝離出支援自由的部分來，那個部分太過稀薄，根本無法成為建構「中華民族」的基石。\n\n「中華民族」這個無所不包的概念充滿自相矛盾之處，宛如金庸武俠小說中的老頑童周伯通一樣，左右手互相搏鬥。自焚的藏人，反抗的維吾爾人，對「中華民族」毫無認同感，「中華民族」這個偽概念如同吸血鬼一般，吸飽了藏人的血、維吾爾人的血、蒙古人的血，變得面目猙獰、張牙舞爪，弱勢的東亞病夫仿佛變成了強勢的東方納粹。然而，習近平絞盡腦汁也趕不上希特勒：希特勒在《我的奮鬥》中形成了「日爾曼民族在種族上最為優越」之認同論述，並以此征服德語國家的民心；而習近平高唱「實現中華民族偉大復興」的「中國夢」，卻無法掩飾「一地雞毛」的無奈現實。\n\n沒有解構，就沒有建構。對中華民國、中國和中華民族的解構，是生成自由人的前提。劉仲敬的漂流瓶已經在沙灘上擱淺，人們有沒有勇氣打開它，閱讀他放入的那張紙條呢？\n\n> https://ladopost.com/newsDetail3.php?ntId=23&nId=302",
			"added": 1524089358,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "刘仲敬：帝国、邦国与民族国家的想象",
			"body": "阿姨的话其实很好理解，标准的国家就是西欧的民族国家，神州自古以来就是家天下的产物，按照西欧的标准神州算不上国家，而是后封建政权统治下的文化共同体，后封建指的是封建以后大一统的中央集权，未能演变成为民族国家；文化共同体指的成员以文化认感同为纽带，而不一定具备血缘上的关系；按照古人逐鹿天下的说法，**神州的背影更像是一大块殖民地，而不是一个有血有肉的民族，统治集团历来并不把臣民当作自己的同胞看待，而是当作剥削和榨取的对象（农奴）**\n\n支那人总是嘲笑港台是殖民地文化，殊不知神州自古以来也是异族的殖民地；神州的历史是靠蛮族入主中原来不断刷新的，蛮族贪恋中原的金银财宝和女人，入主中原以后不可避免的汉化，汉化就是费拉化，费拉化的老蛮族不堪一击，被新的蛮族入侵击溃，消失在历史的长河中，这个过程周而复始，沉淀一层又一层，原动力就是狼图腾，结果就是酱缸文化；**满蒙统治者并不认为自己是支那人，只是被统治的支那人幻想蛮族酋长也是支那人**，这个心理活动其实就是阿 Q 思想，阿 Q 姓赵，就幻想和赵太爷是本家，自己也是赵家人\n\n> https://www.tuo8.red/thread-49270-1-1.html\n\n---\n\n全文閱讀：https://commondatastorage.googleapis.com/letscorp_archive/archives/96383",
			"added": 1524094168,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "刘仲敬：从刘和珍到林昭——一个旧世界的沉沦",
			"body": "段祺瑞作为民国要人和北洋元老，几度出将入相，但每一次执政时所处的实力地位和法律地位却相去甚远。北京政变或首都革命后，府院合署组成的「中华民国执政府」无疑是历届段政府中实力地位和法律地位最为脆弱的一届。事实上，这是正规军军人和民国元老段祺瑞第一次以革命政府首脑的尴尬身份进入历史。段祺瑞的「中华民国临时执政府」只是「首都革命」后的看守政府，推翻曹锟和旧国会的各派系除了「废弃法统、重新创造」以外，对任何问题都不能达成一致。因此，最后一次段祺瑞政府变成一届不知道革命目标的革命政府。他唯一的政治遗产是民国十三年 (1924) 十二月十三日的临时执政府令：取消 1923 年宪法，宣布 1912 年约法失效，消灭国会机构。仅从字面上看，执政府对宪政的破坏已经超过了袁世凯、张勋或民初任何政治势力。后者不过要求新国会和新宪法，即使复辟也不过是要求以立宪君主制取代立宪共和国。中华民国十四年 (1925) 四月二十四日，段祺瑞下「取消法统令」; 四月十九日，由抵制曹锟政府的旧国会少数派议员「中华民国国会非常会议」抗议取消法统，为执政府警察驱散。从 1910 年 9 月资政院召开，到 1925 年 4 月旧国会灭亡，宪政、或者不如说行宪的尝试，维持了不到十五年。这十五年无疑是东亚大陆有史以来流血最少、政治、经济和思想最接近自由的时代，尽管如此——或者正因为如此——很少受人怀念。行宪失败，意味着武力仲裁将是有效统治的唯一途径。权力由君主的武断之治转为革命的武断之治，意味着对赤裸暴力的更大崇拜，因为前者还需要依赖先于它而存在的历史资源。两种武断之治的现实后果充分证明了这种差别。执政府毁灭民国的法源，也就确保了自身的毁灭，为更知道革命目标的革命政府扫清道路。\n\n「革命政府」的「革命」字样并不是一句空话，虽然段祺瑞这样的旧军人没有、或不愿意理解其全部涵义。苏联赋予「革命」全新的意义，颠覆了十九世纪对「革命」一词的大部分想象。五四新人物标榜「国民革命」和「国民外交」，贬低十九世纪风格的政治革命和绅士外交。新式的革命意味着废除法统和条约义务，重启战争状态。民国初年的法统 (legally constituted authority) 概念包括国内的宪政合法性和国际社会承认这两层涵义，前者系于国会、后者系于公使团。任何觊觎主权的实力派都必须以此二者为基础，才能获得正统性。我们后面就会看到：国民革命和 (继承并推翻它的) 列宁主义革命的根本目的就在于摧毁这两层合法性，段政府从正统政府走向革命政府的变迁就是法统垂绝、革命方兴的缩影。三一八事件是这场国本之争中的一次遭遇战，其重要性也在于此。「打倒列强，废除不平等条约」意味着以单边主义的革命外交推翻国际俱乐部的协商一致原则，同时取消公使团对中国政治的「合法性仲裁人」资格。「打倒帝国主义」意味着推翻以西欧为中心、由各政治实体 (actor) 自发演进生成 (Spontaneous evolution) 的国际俱乐部及其习惯法，取消国际事务与国内事务的界限，允许自己不受条约体系的约束，同时 (至少在消灭旧世界以前) 自居为不受法律和习惯保护的现行犯罪分子。「打倒阶级统治」意味着推翻各政治实体 (actor) 通过成文契约和不成文习惯建立的有限政府，实现不存在契约 (或习惯) 权利主体的全能国家 (omnipotent nation-state)。由于权利只能依托(政治而非生物学意义上的) 权利主体而存在，废除权利主体使赤裸暴力 (专政 dictatorship) 成为唯一可能的统治。因此，全能国家 (omnipotent nation-state) 是一种预设的社会性内战状态，它的「法律」不具备法律定义的基本要件，只是一种单方面的政治意图宣示，在赤裸暴力所及之处不受自身约束，在赤裸暴力不及之处不能维持自身。冯玉祥部封锁大沽口水道的军事行动和国共两党组织的学生运动指向同一目的。如果执政府与列强发生冲突，苏联打破协约国外交封锁、广州政府削弱北京政府的目的就已经实现。如果执政府拒绝与列强发生冲突，促使中国国民感情敌视西方、倾向革命的宣传效果可以确保。在最坏情况下，学生也会单独承担一切代价，苏联和广州国民政府几乎没有任何风险。\n\n我们用廉价的后见之明回顾当时的危险决断，不可能看不出做出这种决断的人是不能指望善终的。然而，盲目与骄妄终究是人的本性。**何况，华夏末裔浸淫权谋文化 (就是李泽厚所谓的实用理性) 已深。世界上很少有这样的人类，完全不相信任何基本法则的存在。用希伯莱文化的术语说，华夏的苗裔没有敬畏之心。养育他们的文化更愿意相信：一切失败都是权谋不够高明的结果，可以通过更加高明的权谋逆转。**他们愿意遵奉国际秩序，只是因为庚子的惨败仍然记忆犹新，但他们愿意服从的对象，不是西方的基本法则或所谓公理，而是西方的强大势力。一旦西方势力在第一次世界大战后表现出动摇的迹象，他们就很难抗拒背叛的诱惑。这种机会主义的克林德碑事件 [编者注：克莱门斯 • 冯 • 克林德男爵(Clemens Freiherr von Ketteler，1853 年 11 月 22 日 - 1900 年 6 月 20 日)，是 1900 年义和团事变期间在北京街头被清军杀死的德国驻华公使，这一轰动事件成为八国联军的导火线之一。——Wikipedia] 中，已经表现的淋漓尽致。依据任何文明的规范或习惯，戕杀使节都是不可饶恕的罪行。这种罪行不能以东西方文化差异为借口，因为养育义和拳的通俗文化都知道「两国交兵不斩来使」的台词。印第安人和贝都因人部落都知道：杀害屋里的客人是武士奇耻大辱，即使客人很快就会变成战场上的敌人。然而，北京政府的要人和北京大学的名士都不是这样看问题的。他们的做法等于是：如果德国是战胜国，杀害她的公使就是罪恶，必须立碑; 如果德国是战败国，杀害他的公使就不是罪恶，必须拆碑。这种逻辑的自然后果，很快就会落在始作俑者身上。\n\n撕毁《辛丑条约》，只有在执政府废除法统之后才有可能。破坏京津非军事区，意味着重启践踏国际准则的义和拳战争。以十九世纪通行的价值底线衡量，这种行径相当于德国政府公开为希特勒平反。当然，执政府 (或者不如说劫持执政府的冯玉祥) 没有资格跟德国相比。他们的地位更接近可怜的黎巴嫩政府，在真主党的威胁下进攻以色列的非军事区，为伊朗充当人肉盾牌，却独挡以色列的报复。三一八事件前夜，苏联、冯玉祥和日本分别扮演了伊朗、真主党和以色列的角色。直到抗战前夜，除了蒋介石取代段祺瑞，共产党取代冯玉祥以外，基本格局没有多少变化。日本军队不出所料地报复，执政府不出所料地无法抵抗。这时，李大钊和徐谦 (也就是著名的北方局) 领导的学生运动及时逼宫。任何稍有历史常识的读者都会明白，段祺瑞在这种情况下根本不是强者。他与其说像滥杀妇女儿童的波斯皇帝，不如说像报复蒙古使节的南宋皇帝。国共两党的地下组织不派冯玉祥和鹿钟麟逼宫，却派来了刘和珍和她的小伙伴们，其实是一种践踏江湖道义的手段，跟利比里亚前总统泰勒派儿童团残杀俘虏的伎俩颇有异曲同工之妙。曹丕和忽必烈逼宫的时候，至少允许蒙尘天子保持受害者的形象和喊冤叫屈的资格。儿童团代替大臣和军官，目的就是要剥夺失败者的最后一点安慰。儿童团的主人却可以得到双重的利益：不需要为政治代理人的错误和罪行负责，还可以诬告对方残杀平民，仿佛他们的代理人可以在执行政治任务的同时享受平民的权利。在这种不区别政治与日常生活、国际与国内、军人与平民、间谍与外交家的新型战争中，列宁主义政党自身就是一支军队和秘密情报机构，有能力也有准备将整个社会当作战场来处理，将会发挥越来越重要的作用。这样坚强的秘密组织面对一盘散沙的传统社会、组织松懈的传统政党、资源薄弱的传统政权，可以像快刀切牛油一样所向披靡。这种组织唯一的弱点在于：它的汲取能力和动员能力会耗竭一切社会资源，同时毁灭社会和自身。但在这以前，它仍然能够创造自己特殊的真理和特殊的历史。\n\n当然，这种无赖手段肯定会导致西欧政治伦理的瓦解。后者的实质就是严格区分文武官员和普通民众的权利义务，从而为平民换取了免遭政治军事行动伤害的特权。如果有人能够同时享有文武官员的权力和普通民众的权利，实际上就是在世界舞台上用张献忠淘汰宋襄公。这种人经常活得足够长，亲身领教自己创造的世界; 甚至经常活得太长，足以恬不知耻地冒充无辜受害者。李大钊、鲁迅和刘和珍如果能够活到王明、周作人和丁玲的寿数，恐怕没有任何高妙的手段能够屏蔽他们暮年的耻辱和痛苦。林昭如果像刘胡兰一样死于土改工作组时代，大概也会从自由女神幻想小说的主角沦为女烈 SM 幻想小说的主角。张国焘在这种人当中，就算是下场最好的，主要因为他以免费搭便车的方式，享受了西方文明施舍给弱势团体的恩惠。在西方文明主宰的世界上，民众谴责偶然的暴行。在非西方文明主宰的世界上，民众感激偶然的仁慈。刘和珍的世界仍然属于前者，丁玲的世界已经属于后者。在这场每况愈下的游戏中，真正无辜的人没有后人和外人想象的那么多。刘和珍这种人占据的政治生态位，非常接近布斯塔尼时代的阿拉伯民族主义者。林昭这种人占据的政治生态位，非常接近塔利班时代的学生军。他们从启蒙者开始，以带路党结束，背叛了英法殖民者带来的自由主义，拥抱了苏联颠覆者带来的列宁主义，用自己的实际行动诠释了什么叫「锯断自己坐在上面的树枝」。这种人本身死不足惜，但他们的自我毁灭并没有终结「短暂的二十世纪」。即使在苏联解体以后，颠覆者的危险价值观仍然在每一个溃败社会露出头来。联共党史、中国革命史、国耻教育都是这种思想病毒的重要载体，像奥马尔大毛拉一样批量培养文明的破坏者。如果地球上存在什么历史虚无主义，那也无非是 cult 价值观要求逆向诠释历史的自然需要而已。如果有人告诉你：国民党狙击手冒充平民袭击日本人是合法的，然后遭到人海战术的打击则是不合法的; 老革命打土豪是伟大的解放，然后遭到红卫兵抄家则是史无前例的暴行; 你就会明白，历史虚无主义已经完成了任务。历史虚无主义最重要的部分不是裁割和歪曲历史，而是要制造错误的因果关系，从而干扰人人皆有的健全常识发挥保护作用。刘和珍和林昭如果真正理解「始作俑者其无后乎」、「其父杀人报仇其子必且行劫」的老生常谈，就会为自己选择更好的人生道路。历史虚无主义的目标就是美化神风队员和塔利班学生军，从而保障人肉盾牌的可持续供给。\n\n段祺瑞没有在大沽口事件以前及时引退，已经错过了最佳的下台时间。冯玉祥私刑处死他唯一能干的亲信徐树铮以后，他仍然恋饯不去，只能视为不可救药的愚庸。然而他在三一八事件以后继续坚持，却不失马基雅维利主义的好学生，因为他自己已经横竖做不成正面人物，让冯玉祥落到同样下场就是他能够指望的唯一成功。刘和珍逼宫胜利，等于冯玉祥不战而胜。鹿钟麟带兵杀进执政府，等于剥夺了冯玉祥又占便宜又卖乖的机会，其实就是段祺瑞最后一次悲惨的胜利。政治家的成败有许多不同的评判标准，想尽可能保护自己，还是想尽可能伤害敌人，各有不同的玩法。此后，北洋各派军人无力组织任何文官政府，也难以彼此协调合作。这时，广州革命政府既是国内唯一的文官政府，也是自身组织力量最强、外援最积极的一方。民国十五年 (1926) 四月三日，美使马慕瑞建议国务院解除对华军售禁令，因为苏俄违约军售，置守约各国及中国守约各派于不公正的不利处境。这项建议没有得到任何一方的响应，从侧面反映了远东体系在一战后的崩坏。随着国际环境的持续恶化，民国模仿西方宪制的最佳时机一去不复返。「识时务者」相继抛弃了追随华盛顿和林肯的旧梦，竞相投入降低底线的恶性竞争。费厄泼赖时代的老人无法适应新时代残酷的超限战，恋饯越久下场就越惨。段祺瑞最后的玩法表明，他已经根本不想东山再起了。他的晚年是节制和体面的，因为他的缺陷主要不在道德方面。他这种人如果生在比较正常的社会，很容易成为优秀的军官，足以发挥技术能力，却不会暴露判断力的弱点。他客串政治家，主要是时势所逼和资历所致，实际上害了他，也害了他的国家。他犯下的罪行比大多数同时代人更少，犯下的错误却比大多数同时代人更多。然而正如塔列朗亲王所说，有些错误比罪行更严重。历史对他极其慷慨，对他的前人和后人却非常吝啬。他用普普通通的愚庸葬送的机会窗口，无数大智大勇之士用无限的牺牲都无法赎回。\n\n> http://www.aisixiang.com/data/86391.html",
			"added": 1524305935,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "有哪些事件全世界都知道，只有中国人不知道？",
			"body": "呃... 謹以跟五毛交手的經驗來回答，也許很多事在品蔥上的各位是已經知道了，可以來核對核對。\n\n文章很長，但真的很希望你們可以看一看，不一定要認為我說的是真的，但至少心存懷疑，不要全盤接受中共的。\n\n## 1、西藏 vs. 圖博特\n\n五毛：\n(1) 中國解放了西藏，使百萬農奴脫離達賴啦嘛的暴政，(他們會拿出刑具來佐證)。\n(2) 自焚都是達賴集團的煽動，我們的政府給他們加分的優惠，還讓他們免費上學，文化古蹟維護保養，花了這麼多錢，少數藏獨份子還不知感恩。\n\n我：\n(1) 農奴的確是存在，但在西藏的定義和漢人是不同的。奴在漢人來說是有階級意義，但在藏人來說他就是一個勞務關係的稱呼。(類似窮人到富有人家幫傭)，西藏社會並不會歧視農奴，他們擁有一定的自由度。\n至於喇嘛虐待農奴的刑具，其實是針對犯人而且是前幾世的達賴啦嘛在使用，無可諱言是鞏固權力的手段，但那只有針對少數人，而不像你們說的，是普遍現象。\n(2) 請先看看中共是怎樣對待藏人的\n參見紀錄片：雪山下的謀殺\n瑞士登山客在爬山時，意外拍到解放軍射殺手無寸鐵，但想翻越喜馬拉雅山見法王的藏民。\n是的，有影像為證，國際嘩然，但中國似乎沒人知道？\n還有，從中共手中死裡逃生的啦嘛跟比丘尼出來作證：\n中共為了讓他們唾棄法王，唾棄佛教，竟用酷刑，例如：電擊棒塞嘴巴跟下體。\n不知你們信不信，可我是信了，或許只因為我是佛教徒，我相信佛教徒不會撒謊。\n另外在古蹟維護上，遊客們上那些寺廟的門票錢幾乎大半落入漢人手中，啦嘛們即使反對營利也沒用。而上學時，教授的史地觀都以漢族為主，藏人的文化漸漸式微。\n\n綜上所述，藏人們看不到希望，只能用自焚表達抗議。自焚者有很多是年輕人，他們根本就沒有受過達賴的統治，佛教徒不能殺生，只能傷害自己。\n台灣有兩個自焚者為台灣爭取到言論自由，藏人自焚 150 幾個，卻仍換不來宗教自由。\n最後，西藏流亡政府目前有兩派，一派支持統一自治，一派武裝獨立，前者是達賴啦嘛是支持的，也因為他的威望暫時鎮住獨立派的，如果未來他老人家不在，情況就難說了。\n\n參見書籍：\n王力雄的天葬和唯色一系列的書。\n維基百科對西藏農奴的解釋：https://zh.m.wikipedia.org/zh-tw/西藏農奴制度\n\n## 2、河南愛滋村\n\n農民賣血得愛滋，官員們竟要農民自承是自己的關係混亂才得病，不然就不給補助。\n這件事發生時，也是震撼國際，但是五毛竟對此事一無所知。\n\n參見資料：\n紀錄片：好死不如賴活著 https://theinitium.com/article/20161219-mainland-gaoyaojie\n仁醫高耀潔的採訪。\n\n## 3、64\n\n五毛：(1) 天安門沒死人，(2) 64 是暴民攻擊軍人才被反擊，死的多是軍人\n\n我：\n(1) 天安門的確沒死人，大屠殺是在旁邊的木樨地。(靠北，五毛真的很愛玩文字遊戲)\n(2) 參見資料：\nhttps://hk.news.appledaily.com/local/daily/article/20171221/20251222\n英解密檔案：六四至少 10000 平民死亡\n\n## 4、文革的 detail\n\n五毛：文革就是共產黨在執政時犯了點錯，這個中共都沒有迴避，我們歷史都有上，但是已經過去了，人要向前走。\n(寫到這，忍不住拳頭硬硬的。台灣當年的歷史教學：我們有發生過二二八跟白色恐怖。(句點)，馬的過程細節都不敢講啦)\n\n我：\n請參見楊海清教授寫的：沒有墓碑的草原。\n裡面對於文革的細節描述，我看到手都在抖，真的非常可怕。\n我舉裡面幾個酷刑的例子：\n(1) 桿面皮，用粗棍在肚皮上來回滾動，滾到肚破腸爛。\n(2) 烤乳豬，把人四肢綁在樹上，底下用鐵鍋烤，人的腸胃器官受熱膨脹最後爆開。\n(3) 用粗繩在女性的陰道來回摩擦到整個子宮爛掉。\n還有一堆，想看恐怖片的，直接去藉這本書來看阿，真他媽的會嚇死。\n這就是文革時針對蒙古族的內人黨事件，請注意死的好幾萬人很多都是平民，到死都不知道自己犯了什麼錯。\n而中共是怎麼反省這件事：唉呀！在揪錯叛黨的過程中，不小心擴大化了。\n(凸，一句擴大化就死上萬人啦！)\n\n暫時寫到這邊，想到別的再補充，內有髒字不刪不改，幹，林北就是氣。\n\n> https://www.pin-cong.com/p/61285",
			"added": 1525301615,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 15,
			"title": "小米小店",
			"body": "我也是醉了，玛德，打了 130 万货款，就给 50 台货，剩下的 10 月到货，艹，64g 版本进价 2300 多，让我们渠道卖 2499。。。之前老子还下了 80 元 / 台的销售奖，这是要整死老子！！！130 万货款不要利息啊！！！\n看错了，64g 版本进价 2429, 呵呵，刚刚还看少了。。。\n\n这利润率也太低了\n\n利润率低这个没关系，我们可以转推 128g 版本的，50 台货，30 台 64g 的，20 台 128g 的，我们可以 64g 的市场抛货，128g 自己卖，但是货款是没开发布会就要求打款的，但是不告诉我们提货价，也不告诉我们多少利润率，就是要求打款，打款后才发货，我们打了 130 万，应该可以有五六百台货，但是只给 50 台，这个生意做起来太没良心，苹果也很霸道，我们也是提前打款的，一般都是 500 万 1000 万的打款，但是他给货足啊，不会脱这么久。我们做实体渠道的，现金流就是生命线\n\n不做呗，利润这么低，何必折腾自己呢。有这个钱还不如愉愉快快卖 ov。\n\n夫妻老婆店，卖卖 ov 可以养活自己一家就可以了，但是我们做连锁的如果也和小渠道一样就是等死，ov 线下这么多年，同样的套路使了十几年了，一个 r11 提货价多少卖多少，我相信很多人都知道，小渠道可以贴着成本卖，拿拿运营商的酬金就可以养活自己了，我们稍微有点规模的渠道就不可以，运营成本高，人力成本也高，还有乱七八糟的税费！如果我们和小渠道卖一样的东西，有什么优势可言，所以我们要找新的资源，之前是华为，现在华为基本稳定下来，在我们自己小区域内也做到了一定规模，现在要找新的资源，恰恰小米要走线下，我们当然要积极主动，谁想还没上手就被坑一把\n\n我嘞个去，小米生在搞毛啊，这样谁还和它玩啊！不是说重视线下嘛\n\n毛利低我们也是认的，有过预测，荣耀 v9 高配版 2999，尊享版 3499，都只有 200 多点的利润，荣耀 9 稍微高点，但是荣耀 9 标配 2299，这个版本是不走线下的，只有网上才有。我们当时也是估计的小米 note3，6+64g 不走线下的，所以现在小米给 70 块钱毛利我们有心理准备，大不了标配抛市场上去，我们主推高配的就好了，而且高配的利润也是高于我们预期的，主要还是货的问题，130 万货款只给 50 台货，剩下的到下个月，我也只能呵呵了\n\n> https://www.zhihu.com/question/65032892/answer/228890665\n\n---\n\n这个我必须要答下。\n我不是米粉，更不是米黑。\n我是个小米的路人，大概 2014 年的时候因为华为手机返厂修理临时买过一台当时我们市手机店里最便宜的手机，一台大约是 600 多（时间太久记不清）的小米手机，使用后效果可想而知，真的是很噪音，不过好在起临时的，所以也就没怎么在意了，只是感觉小米手机好坑。\n\n在之后的几年，一直没在关注过小米，直到。。。。。某天在头条上看到小米小店的广告，被告知可以卖小米产品，当时很兴奋，因为知道小米的用户挺多，而且东西难买，如果能卖个小米应该能赚点钱。于是 7 月份的时候加入了小米小店。\n\n刚加入的时候还挺兴奋，小米提出的口号是小米小店服务周围人群以及让米粉成为小米的伙伴（大概是这样，记不清了），当时加入的时候是 7 月中期，那时候小米有个路演政策，一个月路演达到多少补贴多少钱，最多的一个月路演达 20 场以上（每场持续时间达 4 小时）可以补贴大约 3000 元。于是兴奋的花了 2000 多备齐路演设备，准备 8 月大概一场。7 月下旬正是小米小店加入的店主最多的时候，90% 的人都和我一样花了几千块买路演设备（也就是摆地摊）。当时。小米小店的 qq 群管理员（小米官方）鼓励所有人赶快买设备做路演，说路演政策多好，都是为了小米小店经营者考虑的。\n\n结果，到了 8 月份，小米小店看加入的店主差不多了，立即更改路演政策，要求每天必须路演达 6 个小时（如果路演 3 小时就算半场路演）；在此基础上，路演不在补贴，分销售额 5 千 1 万 2 万加路演场次要求。按照中间一个档，路演 10 场交易额 1 万奖励 3%，算一算，10 天路演奖励 300，平均一天 30，哈哈，6 不 6? 结果招来小店店主的强烈抗议，原因很简单，一天 30 比要饭的还惨，然后一天又要 6 小时，要知道小米小店的店主更多的是兼职，晚上 6 点下班，要摆摊到晚上 12 点，哈哈，6 不 6？但是抗议有什么用呢？一点卵用都没有！路演的话补助政策很悲哀，不路演的话购买的路演设备又废了！于是政策就这么强硬的执行下来了。现在回头想想小米公司真牛逼，先忽悠大家投入几千块把路演设备买好，然后在修改政策，让身为米粉的小米店主无路可退！\n\n如果只是这一件事那就还好，最重要的是，小米小店的东西利润极为低下。你见过卖一台 2499 的手机只给 50 的利润么？你见过卖一台 5999 的电脑只给 150 的利润么？哈哈。继续苦笑中。\n\n如果只是这两件事那就还好，还不至于让我对小米公司失望，毕竟都是兼职做小米，也就备了七八千块钱货，路演钱钱就不路演呗，利润低就多买几个呗。但接下来我就要让你们见识下小米公司不要脸的程度。\n\n1. 大规模墙面广告。小米推出了农村墙体广告政策，刷一面墙广告补 100 元，一个店主最多刷 100 面，也就是说刷 100 面墙补贴 1 万元。这本身没什么，问题在于：小米公司要求小店店主先付钱，然后要保留墙面广告达 1 个月，保留了一个月之后再能官方验收补钱。\n小米小店的店主很多都是政治小白，好多人兴冲冲的去刷几十一百面墙，钱付的刷刷的，还想着反正都有小米公司出，但是他们哪知道小米公司的叵测居心，因为他们根本不知道现在全国都在搞农村环境建设，根本没几个农村的墙面广告能保留 1 个月，没几天政府就给你重新图白了，到时候这些墙面的钱全都由小米店主自己承担，我是农村人我很清楚。唉，看着那么多人兴冲冲还乐呵呵的刷墙，我想提醒又不能说出口，别人都刷我又不能不刷（只能少刷几个），同时心里流泪。\n\n2. 分期贷款。小米公司通过几个月的时间把小米店主的存款都吸干了（小米店主购买大量产品充门脸），小米小店总销量不能大福增长了（因为大部分进的存货卖不出去），于是又推出个小米店主可分期付款购买还是分期贷款啥的，让小米小店的店主把未来的钱和自己的信用用到小米公司，通过分期形式，既刺激了销量又提高了小米钱包贷款的用户量，一举两得，未来苦的只是小米店主自己的一身债务和烂在手头的货物（小米产品更新快淘汰快）。\n\n至于其他的小米店主全额支付货款下月返还利润、不停出活动让小米店主购买停产或滞销产品库存（其实也就是多个几十块钱的利润）、让个别经营较好的店长做直播这些个常规的也就不再细说了。\n总之，以前感觉小米公司应该还是良心公司，真的追求的是振兴国产品牌、降低商品价格。但随着小米公司的发展，感觉小米公司越来越不要脸了，不要脸到将最后的支持者米粉的热情转换为一张一张的钞票，哈哈，意味深长的苦笑。以前小米商品推出时都是再说为什么产品比其他的产品便宜，现在的小米净水器广告已经变成解释为什么比其他普通净水器贵了！不是做物美价廉的产品么？哈哈。最后一次苦笑。\n\n有两点疑问：\n1, 小米店主作为本地人都不知道当地政府会每隔几天就把所有墙涂白一次，小米公司远在北京是怎么知道的。\n2, 答主明知道别人刷墙面广告会亏钱，为什么不提醒他们反而装模作样也刷广告，还偷偷少刷几面减少损失，良心会不会痛。\n\n1. 你不懂。最简单的方式就是一个月后拍照片，拍照时用时间水印。每天的路演考核要求满 6 小时就是靠着照片考核。\n2. 怎么说？？？在官方群里说？？？那不是找死！！小米小店是上月利润下月给，一个不好被开除了那就真血本无归。私下说？群设置了不能私聊。\n你可以加入小点试试就知道了\n\n1, 你还是没解答我「小米怎么知道当地政府每隔几天刷一次墙」这个问题。\n2, 我不知道你和其他店主只有微信群这一个渠道交流，向你道歉。\n\n这个又要说到另一件事了！！小米公司把刷墙的公司自己谈好了，公司刷，店主只要负责签合同付钱就好。当然，这个不能恶意猜测小米是坏心，因为大部分店主都不认识刷墙公司。但是，另一件事不厚道，就是把做某个宣传单页的淘宝网店都谈好了，不停的在群里宣传说价格便宜机会难得，说参与还有神秘资格礼品相送，一看价格，淘宝一搜，好吧，不说高但绝不是最低，店主又不傻，所以绝大部分店主都不响应\n\n不好意思，刚没看明白。不需要知道，要知道干嘛？？？如果维持不了一个月，刷墙成本小米和店主各一半不行么？利益能共享，风险就不能共担？\n\n路演这个能看出来确实坑，小米这点做的恶心人。但是小米产品利润低你做小店之前不知道么？难道你做卖一个东西之前不看利润直接就卖么？都这时候了，再拿这事出来说就没意思了吧？再就是刷墙这事，你觉得你们村一面墙一个月的广告能转化成多少收益？给 100 一面墙保留一个月要求很过分么？你的意思是只要刷了就给？当天刷当天被涂了也给钱？你是小米你能认可？挣不了这 100 可以不挣，都是成年人了，稳赚利益高的事情人家就自己做了，那还轮得到别人什么事？\n\n本不想再回复评论的，就是发发牢骚而已，到你这个必须回复。\n\n1. 利润低没关系，但如果路演政策有重大变更，是不是应该提前通知下？至少要透个风出来吧！等到一帮子人花了几千买了路演设备，然后就来个每天 6 小时，每天补个二三十块钱，让小米店主进退两难，你觉得厚道么？？？你摸摸良心说这么对米粉厚道么？？？\n\n2. 你没看透小米的本意，刷墙面广告的方式是小米提出来的，让大家垫钱事小，要求广告必须保存 1 个月是何居心？说小米要求广告留存时间是可理解的，问题是这个政策是小米自己主动提出来的！怎么？怕刷完广告后被涂抹了就将风险转嫁给小米店主是么？就让小米店主背风险是么？？别忘了，就算留存 5 天，那也是对小米产品开展了 5 天的宣传啊！小米公司不该承担一些么？？都让店主承担么？？小米店主都是猪狗不如都是畜牲是么？参与小米小店的米粉都是黑锅侠风投商是么？？如果说，小米店主这段时间真的多卖出去了产品，获得了更多利益，别忘了小米公司才是最大受益者啊！！利益共享，风险就不共担？只能同福不能共难？？还号称良心企业！还有良心么？你就告诉我还有没有良心！！！！\n\n忽悠一帮没有经商经验的热血青年去当炮灰而已。。。。成年人不信任小米，信任华为，信任 OV，因为他们确实是商人，小米是什么？慈善家？也就学生信吧。。。。\n\n> https://www.zhihu.com/question/65078124/answer/227785667\n\n---\n\n2017 年 5 月我们山东米粉带着对小米的向往，对小米的情怀，本着跟小米一起发展的想法，毅然加入到小米小店这个队伍中，至今已经有一年的时间！这一年时间我们经历了太多的不公平事情，但我们依然站在小米的战线上，不管是抵制黄牛还是维护小米我们都是冲杀在第一线，甚至数次我们都被黄牛报复、辱骂，但是因为这份情怀我们没有退缩，最终我们见证了小米小店遍地开花的发展，也正式迎来了小米直供，\n\n但是我们没想到的是小米直供负责的区域经理、市场 BD 只想着开拓市场，提高销量，完全不顾虑我们的感受，他们将小米直供开的每个镇都好几家，而且大部分黄牛都给开通了直供，导致了市场价格越来越混乱，产品进货价比市场进价普遍高出很多，新品资格也被他们拿来作为进货谈判的筹码，甚至成为某个人私人的东西，\n\n针对越来越乱的山东市场我们一批老店主在 4 月 19 日一起对直供负责人提出我们的诉求，我们只想解决问题的，提出意见，于是我们与小米山东的负责人 (实际为山东负责人委托人，王某某) 在 4 月 20 日于济南进行了面对面会谈，该负责人承诺 21 号下午六点给与答复并组建了微信群，但 21 号下午该负责人不但没有给出答复，还自行退出群聊，至此了无音讯！\n\n我们是米粉，我们通过讨论觉得应该在 25 号发布会之后再找所谓的领导要个说法，但是让人寒心的事在发布后就来了，会谈的王某某不但没有解决问题的，还指使临沂区域暂时代理的负责人薛某某在我们参与会谈的小伙伴店面不足 50 米的地方开通直供点，开始了他们的示威和报复！\n\n我想请问一下咱们所谓的小米领导是怎么样的人？你们这样的做法小米知道吗？此处姓王的领导是据他自己说三个月就从 BD 升到四个区域的经理(会谈时多次强调自己升职快)，还多次说自己也是有脾气的，我想知道这些跟我们的会谈有关系吗？我真的不懂了！\n\n此处姓薛的领导更是闻名山东，他的前身也是一个小店店主因为一个活动获得小米 3000 元奖金，从那时候开始就开始了在当时的山东大群指手画脚，最终引起众怒，被山东的小伙伴集体赶出了当时的山东大群，但是不知道为啥后台这么硬，摇身一变成为了临沂市的代理负责人，小米用人就靠关系，不审查人品吗？他负责临沂地区在资源分配上导致小伙伴一肚子意见，资源被乱分配！\n\n下面我反馈几个问题，这些问题在济南已经给某个领导反馈过，结果没有任何答复，我们走正常途径解决问题的路已经被所谓的领导堵死了，我们被逼只能公开要个说法，让真正的小米领导知道这事！\n\n1、关于最初承诺的一镇一店或一公里范围内不在开店，领导们现在几十米就开一个店，难道为了销量就走人海战术吗？这样真的能做好市场吗？\n\n2、关于资源分配，现在完全成为了与店主谈判的筹码和市场经理们人情筹码，根本不存在公平分配 (在我们多次反应后终于有了改善)\n\n3、市场业务 BD 同时是直供点店主，试问小米公司的领导们，这样是允许的吗？这样对其他店主公平吗？资源会不会直接倾斜或者拦截呢？\n\n4、关于折扣券问题，每月直供点都会收到大量折扣券，通过这些折扣券下单，全款金额下单，次月返还折扣券金额，而且只要订到一多，根本不知道到底返还没有，而且还每个月大量占用店主资金，这是为什么？为什么不能直接抵扣商品价格？\n\n5、关于收益问题，从干小店至今收益在不断的收缩，店面在不断地增加！试问领导让米粉朋友加入小店跟小米一起发展的初衷还在吗？\n\n6、关于收益到账时间和收益明细查询，收益到账时间从最初的每月 10 号再到 18 号，再到月末，再到次次月初，一直在不断的后推，小米公司的效率就这样吗？而且收益明细根本无法导出查询，怎么明明白白赚钱？我们只想努力做事，简单赚钱，我们想小米给我们个说法！\n\n以上所说的问题我们都已经跟山东省的负责人已经与济南进行了会谈 (我们进行了全程录像，但是我们没有公开，只是保存了，领导如果有需要可以找我们索取) 但是没有结果而且不进行任何解释，还展开了让人心寒的报复，小米领导怎么看？就这样放任不管吗？这就是答复吗？\n\n我们已经走了正常的反馈之路，但是小米区域的领导不作为，尤其是王某某和薛某某等领导还开始了报复！希望小米领导能给山东的小店店主一个说法！还我们一个公道！\n\n山东小米小店店主\n\n2018-04-26\n\n> https://www.zhihu.com/question/66108437/answer/238351490",
			"added": 1525509748,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "洪水论（整理版）——刘仲敬对中国未来几年的推演",
			"body": "### **中国不久将有大乱，类似于苏联或南斯拉夫解体过程∶经济危机然后财政破产导致货币崩溃，最后就是中央权威崩溃，流民四起，分崩离析**\n\n> 作者：刘仲敬。出生于新疆昌吉，祖籍四川资中，政治评论人士、作家，网名「数卷残编」，以独特的历史观著称，专注发明诸夏民族。\n\n以下是刘仲敬 2016 年跑路美国前对中国未来的推演。\n\n### **时间节点——为什么是 2017**\n\n根据趋势，17 年应该是大洪水元年。原因如下：2016 年的美国大选无论是谁上台，都会对贵国进行进一步封锁，贵国在国际上搭顺风车的好日子将一去不返。北京政权会制定相（zuo）应（si）的政策，17 年是政策落实开始出现结果的时间窗口，大洪水应该从这里决口。\n\n**问：所谓 2017 大洪水，是一个粗略的时间判断，还是一个相对具体时间的预测？您的判断主要依据是桂枝经济方面还是政治方面，还是综合因素？**\n\n刘仲敬：这是个外交预测。时间其实很简单，就是 2016 年的美国大选。要判断这一点，其实用不着等到现在，五、六年前就可以判断出来了。一个权力结构的扩张必然会引起原有体系的反弹，反弹在什么时候，你可以通过双方逐渐升级的比例一步一步计算过来。奥巴马政府本来就是绥靖政策的最高峰。希拉里在她的国务卿任上就把亚太的印日澳军事联盟给搞起来了，奥巴马把她的国务卿给罢了（2012 年 12 月），自己乱七八糟的主管了外交，把这场游戏推迟了四年。但是也顶多推迟四年。任何人都能看出，16 年的大选是非常像卡特和里根争夺总统那一次（1980）。卡特尽管在执政后期有点改变，但是新上台的政府无论是谁，在阿富汗事件（1979 年 12 月）以后都会对苏联采取更强硬的手段。\n\n**问：请您估计一下大洪水具体的时间？能不能拖到 2020 年？**\n\n刘仲敬：这个要越过了节点你才能看得出。下一步会发生什么事情，就是要取决于你在节点的时候做了些什么。大洪水是由越过节点当时所有各个当事人用脚投票做出的选择构成的一个整体的路径积分。在决断时刻来临以前，你不能够清楚的判断社会上的各个角色当中，哪些人会往哪个方向走，哪些人会做出什么样的决断；但是越过节点以后，所有人都不再有决断的机会，只能够被时势所推着走。节点之前和节点之后，就像是你越过悬崖之前和越过悬崖之后：越过悬崖之前的话，你往哪个方向走是不好说的；越过悬崖之后，你就只能够往下，落下去了。所以 17 年以后具体会发生什么事情，这要看所有各方在 17 年以后面临危机的时候做出的选择，而这个选择多半是取决于他事先就已经形成的价值观。\n\n### **中国的国际环境——西方对华关闭市场，中美关系进入冷战模式**\n\n**问：您对 2017 年这个节点指的是会发生什么？**\n\n刘仲敬：暧昧空间的消失，就像封锁柏林以后的欧洲、朝鲜战争以后的东亚。在这以前，二战刚刚结束的时候，名义上的盟友关系还能够象征性的维持，以后就完全撕破脸。撕破脸以后，比较小的玩家，像希腊、土耳其、伊朗这些，就必须选择了，要么在西方一边，要么在苏联一边。像捷克、匈牙利这样的小国，在暧昧空间被消灭以前，还想加入马歇尔计划的同时不正式得罪苏联境内的苏军，然后以后就不可能了，苏联会直接采用正面手段推翻它的政权。暧昧空间还存在的时候，你可以在不同……【1 分钟时间到】\n\n**问：请刘仲敬展望下美国年底大选落定后对华政策展望，和对东亚趋势的判断。**\n\n刘仲敬：如果希拉里上台的话，那么在 10 年 ~ 14 年之间已经反复提到过的几个组织就要开始整合。这几个组织，第一个是 97 年以后不断扩大的美日安保体系；第二个则是美印战略伙伴关系；第三个呢，则是近年来不断加强的美国和东南亚的单边合作。奥巴马政府为了把美日韩三国整合起来，已经费了很多心血。民主党政府应该是会继续这个趋势。随着北京压力的不断增强，可以顺理成章的把日本甚至欧洲各国引入南海共同巡防、共同安全保证的机制。这个安全保证的机制甚至可以超出东亚的范围，印度、欧洲各家都有可能参加进来。如果川普上台了，他比较有可能采取……【1 分钟时间到】\n\n**问：按照您的判断，如果特朗普上台，加上 18 大后派系共治被破坏，桂枝还有几年活路？能撑到 2020 吗？**\n\n刘仲敬：我不知道川普会把他在竞选当中的承诺实现多少，如果他真的百分之百不打折扣的实现的话，那么就是全球化结束了。这样会引起连锁反应，因为各国都有它自己各自保家乡的特殊利益。美国如果要为了美国自己内部的工人阶级的就业，把美国的公司留在国内，不惜牺牲已经达成的各个自由贸易协定的话，那么其他各主要经济区也会如法炮制，然后世界很快就会割裂成为不同的经济区，国际贸易一落千丈。在这种情况下，受害最大的就是像桂枝这样，没有什么特长、只凭着对生活成本的要求比较低、专门干那些不需要专业技术的脏活累活这样的角色，这种人在世界分工产业链中是最容易被牺牲的。大家搞全球化的时候，可以把脏活累活都承包给你；各自保家乡的时候，这些东西就会留在本地。然后只要……【1 分钟时间到】\n\n**问：假如年底特朗普大选胜出，展望一下对华政策和中美关系演变。**\n\n刘仲敬：特朗普一上台，经济危机很快就会席卷而来。在这种情况下，北京面临着非常难堪的选择。在钱花光以前，必须发动战争。稍微迟三五年，就不可能再有足以支持哪怕一场短暂战争的钱了。特朗普上台会导致一场外交洗牌，在这个洗牌当中的混乱期，是一个巨大的诱惑，如果不利用这样的混乱期，以后也就不再有这样的机会了。但另一方面，北京其实是做两手准备的，从他的「2049 论」就可以看出来，一方面他知道机会越来越少，另一方面又希望继续忽悠一下国内人，让国内人相信，我在国际上还是混得下去的，而且还是很有面子的，这样可以多混两年。这两条路，就像是蒋介石在 1937 年前准备的两种不同选择一样，不到最后决断关头……【1 分钟时间到】\n\n### **中国的内部形势——中国的内部形势有多严峻**\n\n**问：桂枝现在的经济状况算不算经济萧条？如果算，您预计下一步局势会如何发展？**\n\n刘仲敬：现在的政策是，要钱没有，要政策有一条，这一条政策就是，准许各地方自行借债。实际上各地方早已经在自行借债了，如果他们能够借得到债的话，恐怕也就不会对央行和经济沙皇施加太多的压力了。像现在这种情况就说明，一定是有很多财政上破产的地方向他们有政治关系的政治保护人提出要求，要求他们进一步放水进行支持，但是经济计划当局对此已经感到很不感冒，无法忍受进一步的通货膨胀危险，所以就允许他们各自行事。这样做肯定会加大地方分化：能够借债的地方不需要你搞现在这种政策，早已经自己做起来了；借不到债的地方，就是因为借不到债，才向中央提出进一步要求，然而现在得到这个答复，中央很明显是在接近年底以前不可能给他们任何帮助了。\n\n**问：您觉得经济还可以撑多久？**\n\n阿姨：很快了。照现在这个速度的话，能不能撑到今年年底都很成问题。撑到十月，顶多到十月，外汇就空了。你没看到现在猪肉价格在飞涨么？这是大动乱的前兆。房地产上涨是没有什么影响的，它是一个笼子，超发的货币像老虎一样被关进了房地产这个笼子。正因为如此，超发的货币才没有使大米、小麦的价格上涨。现在笼子已经关不住了，所以日常用品的价格正在飞涨。随着食物价格的飞涨，大规模的民变肯定会上升，大规模的民变一旦开始的话，维稳费用就要急剧上升。这实际上是一条通向对内战争的道路。现在整个北方大多数二、三线以下的城市，资金链已经断裂。还不起房贷，鬼城，然后银行死账这些情况，基本上是整个华北内地现在都是这个样子的。zheng 州肯定已经是这个样子，到 wu 汉只是时间问题。你顶多能够指望它也许不会冲到 Peking、shang 海和 guang 州深 zhen，但是除此之外肯定会，整个资金链肯定会塌下来。这个塌下来的速度是非常快的，传导速度是非常快的，像火一样。\n\n**问：最近桂枝央行又大放水了，您认为还能撑多久？如果一直重复使用这一策略，会产生什么后果？**\n\n刘仲敬：放一次可以管上几个月，但是效果越来越差。这种方式就好像是在你渴得要死的时候，有人拿着一个浇花的管子，刷刷刷刷刷在你面前不断的喷水，他喷水的目的是喷向花园的，不是喷向你的，但是由于你躺在他面前，飞溅出来的水滴多多少少会有几滴溅到你自己的嘴里面，然后那几滴水会解你的渴，让你暂时好受一点，但是喷出的大部分水都在你头上飞了过去，落到园地里面去了，并没有进入你的体内。放水的结果也就是这样的。放水最大的受益者和最积极要求放水的，一定是内地的地方政府，他们已经干渴得要死，一点水对他们都非常珍贵。但是放出来的水大部分只是从他们嘴边流过，有几滴进了他们的嘴，绝大多数都通过深圳和上海这两个口岸飞速的变成了外币，变成各种……【1 分钟时间到】\n\n**问：现在有一种分析说，桂枝因为地盘大，红龙随便出让一点资产或者权力，就能换十几年不愁钱花，比如放开教育和医疗，放开土地私有化，允许私人直接买地盖房等等，只要扛住国防和维稳的开支，桂枝就不可能出问题，内部的老百姓和中下层官僚掀不出浪花，外部世界发达国家只要和桂枝做生意有利可图，哪怕桂枝的某些行为影响到世界秩序，也不会发生大洪水，毕竟在有钱赚的情况下，没人会舍弃利益，因此说桂枝至少撑个三五十年不成问题。对此您怎么看？**\n\n刘仲敬：这件事情不是早已经发生过了么？而且这不是秘密，这是九十年代大家争论得最激烈的问题之一。我觉得大家的忘性都实在是太大了。当时实际上采取的办法跟俄罗斯是一样的，只不过俄罗斯有形式上的民主，所以卖掉了东西，给老百姓一人分了一瓶伏特加，然后就被大家骂得一塌糊涂；桂枝呢，则是跟俄罗斯一样，把可以卖的东西都卖光了，只不过连一瓶伏特加也没分给大家，都让赵家人给私分了。就是这样它才能够多支撑十几年，否则九十年代的时候，公务员不是都在打白条吗？这一点大家不应该忘得这么快吧。卖掉的东西支撑了十几年，然后空对空的抵押又支持了十几年，所以我们才能够维持到现在。现在的问题是，卖掉的东西、抵押的东西不但把有的东西都卖掉了，把没有的东西和根本不能卖的东西都拿来卖掉了，很像是丁宝桢去当铺的那个故事一样，送去当铺里的东西只是一个空箱子，但是还是把它给抵押了。丁宝桢的典当箱是不能打开的，因为里面一无所有，会把交易双方都变成诈骗犯的。城市融资公司过去十年用这种方法欠下的债务，即使把整个日本卖掉都还不清，这就是为什么 PPP (Public Private Partnerships) 非做不可的原因。PPP 填补不了，接下来的最后一步就是关门打狗。\n\n**问：西朝鲜 30 年新经济政策带来无比光鲜的局面，类似的「成就」历史上有先例吗？如果没有，为什么？**\n\n刘仲敬：当然有，托勒密王朝统治下的埃及就是一个典型。它一方面能够比古典的法老的埃及开发出更高的产量，因为它拥有从希腊输入的，就相当于是现在从西方输入的先进技术。希腊人在物理、灌溉和行政管理方面都比古老的埃及人要发达得多，开发海军和贸易尤其是古老埃及所不能懂的。古埃及基本上依靠尼罗河，不依靠贸易收入；而托勒密王朝和亚历山大则把埃及变成了地中海世界最大的贸易国。同时他们得到了埃及大量的顺民，这些人擅长劳动，不擅长战斗。如果地中海世界永久保持和平的话，那么希腊罗马的自由公民是不可能像埃及的农民顺民那样，一天工作十六个小时，宁愿饿死也不反抗，国家把尼罗河水和空气都卖给他们了，他们也不敢放屁。就是依靠这样，托勒密埃及才能积攒比罗马和希腊大得多的……【1 分钟时间到】\n\n**问：桂枝有没有可能出现类似 90 年代日本地产泡沫破灭的情况？**\n\n刘仲敬：这个可能性不大。桂枝比较有可能选择的道路是一种类似俄罗斯的道路，用循环上升的通货膨胀来冲抵房地产泡沫。走这条路的好处就是政治上的抵抗力要低得多，通货膨胀掠夺的对象是最分散的小民，保全的对象是已经拥有房产的中上层阶级，这条路线在政治上的阻力会要小得多。同时，桂枝也没有像日本那样的制造业基础需要保护。房地产价格上升的话，鼓励了投机，而不利于正常的投资，对实体企业构成极大的伤害，而实体企业是日本的国本所在，是全世界最先进的制造业之一，是值得维护的；但是桂枝的制造业本来就是很垃圾的东西，在政治上非常边缘化，实际上的产出也非常垃圾，即使按照纯粹理客中的方式去看的话也不怎么值得保全，何况他们在政治精英……【1 分钟时间到】\n\n**问：桂枝目前仍然是世界上最大的制造业生产基地。您是否低估了桂枝崩溃对全球经济的灾难性后果？**\n\n刘仲敬：无论在什么时代，最低端的产业都是最容易替代的，也就是说苦力总是最容易替代的。但是随着生态链的变化，有的时候，在比较早的时期算是高端产业的，过了一段时间就变成低端产业了，这个就不能一概而论了，要根据当时的生态位来判断。纺织产业在清教革命的时代曾经是高端产业，但是现在就是很低端的产业了。钢铁产业在二战的时候算是高端产业，但是现在就变成很低端的产业了。无论在什么时候，产业都是分高端和低端、中心和边缘的，而桂枝这些产业呢，很不幸，始终是站在边缘的地位上。边缘产业无论是从数值上看多么庞大，都是非常容易替代的。美国南北战争以前，凭国民生产总值和经济利润，南方并不落后，单纯的纯利润反而更高一些，但是埃及的棉花替代南方的棉花只不过用了三五年。\n\n**问：东南亚在人口规模上不如中国，那么东南亚能否完全承接世界工厂的地位？**\n\n刘仲敬：这个问题是不存在的。菲律宾就有一亿人口，印尼有两亿人，印度支那半岛也有一亿多人口，缅甸、泰国加起来也有一亿多人口。这个人口，算总数的话，已经超过了从大连到广州湾的沿海地带的人口。而且他们的人口结构，比起大连到广州湾这个地带的人口结构要年轻得多。如果是只算四十岁以下的年轻人口的话，实际上中国的可用劳动人口已经不如东南亚整体。这些人口绝大部分是来自于水稻种植区的农民，他们的性格跟珠三角地区到东莞地区搞代工加工业的人是非常相似的：驯服，能够耐受长时间的工作，守纪律。所以凡是在广东能够搞起来的加工工业，在越南的两个三角洲搞起来也都没有什么问题。印尼呢，可能劳动技术暂时还不能跟越南相比，但是论……【1 分钟时间到】\n\n**问：您如何看所谓桂枝对东南亚等地的产业链优势，以及工程师红利的说法？**\n\n刘仲敬：产业链优势是不存在的，但是物流优势是存在的。产业链，因为大部分都是在国外，所以真正约束产业链移动的因素，一方面就是金融、物流方面的配套设施，另一方面就是真正的技术输出国内部的生产要素配伍，这些因素大多数都是既不在中国也不在东南亚，双方都左右不了这里面的局势。中国真正比东南亚占便宜的地方，就是它的道路交通网和基础设施比人家修建的早了二十年到三十年。对于沿海来说，这个优势是存在的；但是对于内地来说的话，由于通向沿海的交通费用较高，这个优势基本上就被抵消了。从现在起，到未来的十几年时间，沿海地区的优势相对于越南和印度地区沿海的优势仍然存在，但是还是会继续减少。\n\n**问：请您预测一下桂枝三亿农民工，尤其是年轻的进城打工仔将何去何从？**\n\n刘仲敬：他们已经丧失了原有的农业生活方式，也无法再耐受他们的先辈视为理所当然的生活环境，所以他们会在几个月时间，顶多一年时间内，花光他们原先打工挣来的钱，然后就会加入各种的黑帮或者诸如此类的团体，接下来就要开始在各个不同的地方之间流动，寻找无论是合法还是非法的新的致富机会。由于未来存在的致富机会大半是走私、黑帮或者诸如此类的盗匪行为，大多数地区，至少是大多数内地地区的治安都会急剧恶化。他们当中有一部分人会被警察收编，来缓解警察的工作压力；另外更多的人呢，则会变成跟他们的阶级兄弟斗智斗勇的黑帮团体。其实底层阶级从来都是……【1 分钟时间到】\n\n### **北京目前的策略——亚投行与一带一路**\n\n**亚投行与一带一路是个作打死的赌博，不仅无法填补西方对华关闭市场的损失，而且是一个无底洞，更可能导致中国西部门户洞开，各种极端组织将大规模入侵**\n\n亚投行是一个异常冒险的东西。冒险的意思是——它比较像法国在印度的经营（1642 年法国成立东印度公司，并于 1668 起在印度的苏拉特、默苏利珀德姆、圣多马、金德讷格尔建立多个贸易点，但始终与英国、荷兰及印度本土势力争斗不断，后逐渐失去），而且还要不如一些。因为它投资的那些地方，从传统上讲是过去的金融家忽略的地方。而过去的金融家之所以忽略它绝对不是无意的，他们没有理由跟自己的业务过不去。他们经过审核以后，觉得这些地方还债的把握是基本没有。\n\n亚投行就是这个问题，它为什么要投到巴基斯或者阿富汗去呢，直截了当说就是：因为以前的资本家在这些地方不大肯投资，因为这些地方的投资是没有保障的。阿富汗这些矿山，论铜矿的品质来说是非常好的。如果只看铜矿的品质，它应该卖得很贵。中国那些可能是几个百分点的矿山都在拼命开采，人家那有百分之二十的矿好像还没有开采。但为什么那些地方没有开采？因为阿富汗政局不稳定，你也不知道新政府会不会承认你的产权。\n\n一带一路将来要面临两种选择，要么你再当一次冤大头，这笔投资我不要了；要么你像日本或者德国一战以前的商人一样，游说本国政府，派一支关东军到当地去，把塔里班给我赶出去，把那个地方给我夺回来。九一八事变根本的动机就是这样，你袭击了我们日本公司投资的关东铁路（柳条湖事件），妨碍了我们正常经营，我们关东军是去维持秩序，把你赶出去，把地方夺回来。如果你不想做冤大头，你就要准备一支军队，必要的时候去维护你的产权和利益，如果没有这方面的准备的话，当冤大头的可能性是非常之大的。 巴基斯坦这些地方搞投资，将来你早晚，不是早晚，而是在很近的未来，就会面临着这样的情况。\n\n一带一路肯定会在未来的一、二十年，为中国树立无数的敌人，这些敌人很容易渗入中国的西部边境，那不是你的银行团能够收拾的事情。所以如果你的投资范围，包括从巴基斯坦、吉尔吉斯，通向亚丁湾和叙利亚这条危险道路的话，那么收回成本的可能性是接近于零的，而制造出严重武装冲突的可能性则是极大的。\n\n这些地方，能不能够维持住，要取决于你在东线，是不是采取冒险性的政策。如果你像土耳其人一样，背靠着欧盟，镇压库尔德人的独立运动（库尔德人聚居区占土耳其领土的约四分之一，库尔德分离运动长期困扰着土耳其），那么你还有长期抵抗的资本。如果你两线作战，想要背靠西部作为靠山，在太平洋上发起新的冲突，你的完蛋会非常迅速。你会像蒋介石一样迅速完蛋。蒋介石抗日的时候，他的基本目的就是，拿苏联做中国的大后方，去抵抗日本。日本垮了以后，中国很快就通过 TG 落到苏联手里面。如果中国以伊斯兰教势力为大后方、以巴基斯坦为大后方，向美日开战的话，那么可以断言，必定会失败。\n\n在失败以后，也许沿海地带会落到亲美势力的手里面，但是贫瘠的、无利可图的内地，恐怕会被伊斯兰世界瓜分，正如它在 1948 年被亲苏的 TG 瓜分一样。这是一个简单的利益上的算法，因为对于美国和亲美的势力来说的话，内陆是无利可图的，是没有占领价值的，这就是它在 1948 年没有维护国民党的一个根本性原因。但是对于穷困的苏联来说，即使是内陆也是值得占领的，对于更加穷困的伊斯兰国来说，它渗透中国西部是有利可图的，但是美国和日本却绝对不会对除了沿海经济发达的地区以外的任何地方有任何兴趣。\n\n西安斯坦什么时候建成的问题，我想，国际武装分子大规模地入侵我朝西部，应该就是最近五年之内的事情，不大可能拖得更久了。因为伊斯兰国和塔利班，已经开始在阿富汗彼此宣布圣战了。面对着喷赤河和瓦罕走廊的那个边境，已经是门户洞开。他们不来是不大可能的。而我朝自我安慰的理论是，它已经收买了塔利班，塔利班的立场倾向于中国。但这是根本没用的事情。在巴基斯坦、阿富汗、吉尔吉斯那种部族和宗教政治派别极其复杂的地方，如果你收买了某一个派系，得到的结果就是，那个派系的所有敌人就会自动变成你的敌人，你不可能把所有人都收买的。这就是中国在那些地方进行经营的所面临的必然下场。\n\n### **无解的台湾问题——打 or 不打**\n\n**台湾问题是 TG 合法性的问题**\n\n打 or 不打是个机会窗口的问题，正因为以后机会不如现在，所以现在是当务之急。所以你看有一些事情表面上是进攻性的，实际上是防御性的。防御性的主要原因就是现在做不好，然后又下不了决心说不做。蒋介石为什么在 1937 年非打不可，就是因为再过十年满洲国就站稳了，所以尽管我现在没有准备好，但是我宁可拖你下水，跟你一起死…… 这个是不理性的，但是在情理之中。但是蒋介石这人就是不理性的，最开始东北抗争，最后要东北打内战，理由都是这样的，宁为玉碎不为瓦全，与其没有东北，我在南方当小朝廷大王，不如没有东北我们大家一起死，这个逻辑是很有可能发生作用的。因为现在跟蒋介石不一样，你要拖下去的话情况可能会更不妙。而且 TG 看 Tai 湾的感觉就国民党看东北的感觉差不多。\n\n这个不仅仅是地方问题，还是一个合法性的问题。我刚才说的漏了一点，对蒋介石来说，如果我们审时度势不打了，那北洋政府当时不是这么做的吗。一天到晚说他们卖国，结果我上来还用它的逻辑继续卖，那我还不如北洋政府，根据这个逻辑就非打不可了。因为他上台的逻辑就是别人都是不如它维护民族国家的，只有它维护，他把自己弄上台就退不下来了。现在 Tai 湾问题也是这样，现在不打以后机会越来越糟，但是这样一来，革命叙事、大国崛起中华复兴的逻辑整个破产，为了不让这个逻辑破产，那这就是个机会窗口，就是说其他国家还没有武装好，而你的武装还没有衰退下去这个窗户打开了。\n\n这跟德国之前一样的，一个德国海军上将跟希特勒算过账，德国的相对实力在 1943 年达到顶峰，以后就会走下坡路，为什么呢？因为德国比其他国家提前 20 年重整军队，所以你的军队达到高峰的时候别人才刚刚起步，但是你再等 20 年别人就赶上了，尽管从目前绝对值讲还是有进步，但是从相对值来讲，你和其他邻国的差距是不断缩小的，桂枝加大军费从 90 年代中期开始，当时其他周边国家，除了美国之外，其他国家都在削减军费，所以目前桂枝就处于相对实力的最高峰。但是现在其他国家正在开始赶上来，再过 20 年的时间那时候你就必须放弃了。所以这种情况就要看你有没有底气了，你现在放弃，你心里很清楚机会再也没有了，能赌的就是现在。在这种情况下有很多人是经不住诱惑的。\n\n### **內溃 or 外战——中国未来的道路**\n\n**內溃是很难持续的，当超过社会承受极限，统治者有可能发动对外战争，一了百了**\n\n**问：桂枝一直持续像这样不死不活的烂下去、维持现状十年以上可能性有多大？**\n\n刘仲敬：维持现状是最难的事情。要想不死不活的搞下去的话，那么首先就要开始考虑配给粮食。这种做法已经在某些局部开始了，像是供销社之类的组织已经，至少在西北、华北某些省份复活。然后就开始给，比如说公务员或者说国有企事业单位职工配给各种物资，没有这种身份的人就得不到配给物资。开始的时候大家还瞧不起这种东西，但是后来物资越来越少，平价米、平价粮、平价土豆变得越来越可贵。最开始的时候还可以吃干饭，到最后的时候连稀饭都吃不上了。十年的开始，好像还跟过去差别不太大；到十年，恐怕还等不到十年，到结尾的时候，已经跟朝鲜差不多了。没有身份、得不到配给、又不擅长于搞黑市的那种人，在这种情况下会首先遭到淘汰，到结束的时候估计就会死得一个也不剩了。\n\n**问：请您分析一下外战和内溃两种不同的国家崩溃方式会造成什么样不同的结果？**\n\n刘仲敬：从长远看来没有什么区别，短期看有区别。但是对于许多人来说，长远和短期意味着十分重大的投机机会，所以还是有必要区别处理。外战肯定会引起内溃；不外战，也只是缓慢的憋死。但是外战引起的内溃有一个良好的机会，就是你可以耍赖，你可以把你的责任推到征服者头上，可以指望征服者对你输入秩序。在这样的情况下，你能够得到一定的重新起步的资本，能够比彻底的内溃的情况下获得比较好的再生机会。如果是彻底的内溃的话，在已经是一个高度费拉化、遍布了小张献忠的环境之内，你能够得到的下场一定是非常悲惨的。在这种情况下，多少年来文明世界认为绝对不可能的恐怖片场景……【1 分钟时间到】\n\n**问：这两条路径中，哪条路径您觉得最有可能？**\n\n刘仲敬：这就要取决于非常细节的偶然事件了。例如卢沟桥事件就不是必然的，蒋和他周围的重要决策者在面临着路径选择的时候，心里就像是你在面临着，比如说考两个都想去的大学的时候，心里是很犹豫的。这时候只要有很小的因素，就能够把天平拨向另一方面。当然这不大会改变整体趋势。在卢沟桥事变前夜，可以说是，国民党联合苏联打击日本的基本战略已经确定，战争早晚会爆发，但是会不会在卢沟桥事变那个节点爆发，不一定的，蒋也有可能再搞一个塘沽协定，再过两三年再爆发，而这两三年对他来说其实就影响很大了。现在的情况就是这个样子。在南海、台湾和钓鱼岛，任何一个细微的刺激性事件都可能把摊牌的危机提前两三年或者是拖后两三年。而照我看来，……【1 分钟时间到】\n\n**问：阿姨，我是一个您的新粉丝，对您的大洪水理论很感兴趣，您好几次说到了 2017 大洪水，但是现在经济互相依存度很高、战争的规模越来越小、人们对和平生活的依赖度越来越高的当下，真的还会出现这种残酷的过程吗？我觉得很难以想象啊！**\n\n刘仲敬：依赖性大，所以危险性大。局部的扰动容易扩散，十九世纪的地方性战争才会升级为第一次世界大战。从长远看，复杂多样的小生态环境才是安全的保障。不过这种保障要以频繁多发的局部灭绝和替代为代价，或者反过来说就是避免连续性小风险的机制实际上增加了间断性大风险。\n\n**问：有核国家之间存在爆发战争的可能性吗？美国真的会为了亚洲盟国和中国打核大战吗？「西安以东全部核平也不怕」的这种同归于尽的流氓心态能否恐吓美国？**\n\n刘仲敬：中国没有打核战争的资格，自从苏联瓦解以后，地球上已经没有人有资格打核战争了。现在的核战争也无非是一种单方面的屠杀而已，也就是说你挑衅一下，然后被彻底核平，根本就没有资格跟对方打一场势均力敌的核战争。所以你等于说是，我假定对方为了人道主义或者其他资产阶级软弱性诸如此类的理由，是不会在越过红线以后直截了当的采取报复的。这个是个很危险的假定。核威慑是什么意思？核威慑就是使用核武器的决心。我觉得这种现象根本上的来源就是一种自欺欺人。自从日本人发动太平洋战争的时候，假定美国人都是少爷兵；到伊拉克认为，海湾战争的时候，假定说是美国人不会到沙漠地带来吃苦；现在又假定美国人都是地地道道的人道主义者，所以才干得出广岛和长崎这种事情来。\n\n**问：最近一段时间军改动作频频，您认为如果中美开战，解放军会像甲午战争时那样一触即溃吗？**\n\n刘仲敬：就我对退伍军人的了解和对军队采购业务的了解，现在的军队拉出去能不能够跟朝鲜打一仗都还很成问题，就不要说跟美国打了。跟日本打，是肯定会全军覆没的，这个一点问题也没有。他们虽然花了很多钱，买了很多军事物资，做了很多建设，但是这些东西的实质，跟包工头和市政府合作搞建设一样，主要是为了大家分成，中间偷工减料是不可避免的。而且真正对军事有点内行的人都知道，战斗力这个东西是主要不靠个别拿出来炫耀的先进武器，而是靠各种武器系统和专业人员之间的协调。协调不好，那么你的战斗力就取决于最差那一部分，而不是最好那一部分。打比方，你一个足球队，它的能力有多强，首先不是看它有没有一个马拉多纳，而是要看它所有的球员之间能不能够协调好。\n\n### **北京目前的选择窗口**\n\n**时间窗口也就是一年左右了。**\n\n道路只有三条。A，星辰大海一了百了，必须提前准备. B，八个大大再创辉煌，有不只一条通道. C，东南互保文明解体，也有不只一条通道。\n\nA 需要提前准备，迹象不可能掩饰。从现在开始，时间拖延越久，财政支持能力就越差，突然袭击的优势就越小，东亚军备竞赛相对优势就越小。北京的最好希望无非是美国退缩，核平得以避免，重演朝鲜战争，以台湾代替北韩，强迫人民忍受以后二拾年的苦日子，在封锁线内宣传胜利。然而即使在苏联支援下，毛泽东也只能坚持不到拾年。莫斯科和伊斯兰世界可能提供的大陆体系，支持能力不可能超过斯大林，而且莫斯科为了半欧洲身份，很容易出卖亚洲人。这条道路的结果是朝鲜化，而且没有一个三十倍于中国的保护人输血，内亚和东南亚边界又比三八线无人区和鸭绿江图们江复杂得多，胡志明小道是无法阻止的. A 通道由此通向 B 或八个大大。\n\n北京如果可耻地退缩，选择时间也差不多只有一年。韬光养晦等待更好机会的逻辑无法继续使用，因为以后的财政人口军备竞赛国际关系条件只能每况愈下。退缩以后的出路只有两条要么。退回讨好西方的路线，听任再列宁化运动虎头蛇尾，变成寻常的谄媚训练。于是，胡温时代雄藩抬头的趋势重演，打开 Ç 通道或东南互保。\n\n退缩的另一种选择是，虽然对外完全放弃，对内仍然坚持有实质的再列宁化，非如此不足以预防雄藩抬头。这意味着不可能像邓小平八拾年代一样大大降低安全支出负担，在川普时代的区域主义和美元回流之下，只有大陆体系才能弥补美国市场的损失。因此一带一路必须推动，北京的资本结合伊斯兰的人力。在这样一个反西方联盟当中，八个大大和七个大大的关系，精确相当于抗日战争时期，共产国际和蒋介石的关系。这条道路发展到下一个节点，就只有 B 和 C 两个出口新蒋介石的再列宁化比较成功，就能把整个东亚送进八个大大手中; 如果不太成功，就会在瓦解过程中被东南互保和八个大大瓜分。\n\n### **洪水来临时的惨状**\n\n**问：如果桂枝陷入无政府状态，会有什么可怕的事情发生？请您描述下那种危险的境况。**\n\n刘仲敬：这种事情在历史上已经发生过 N 多次了。首先是配给制，配合黑市的大发展，然后配给越来越少，最后管制机器整个瓦解，社会落入还保存着战斗力的流氓团体或者盗匪团体手中，只有他们能用抢劫的方式囤积到物资。跟他们没有关系的人或者坐着等待配给的人开始逃难，逃难的人大部分都没办法到达目的地，或者是根本没有合适的目的地可以到达，他们想要去的地方跟他们想要离开的地方其实一样糟，甚至更糟。绝大多数人背井离乡以后就永远在历史上消失了，无法悬测到他们到底是怎样死去的，有较大的可能性就是，他们在死之前经历了自相残杀，像富兰克林探险队或者孔融曾经见到过的汉朝末年那种情况。\n\n**大洪水的惨状及保命学**\n\n阿姨轻描淡写地说，贵国每次朝代更迭帝都人口都会被清空，只有满清例外，很多傻逼豚还来质疑，我只能说他们阅读能力太捉急。阿姨说的是一个很简单而确凿的事实。帝国的运作方式是征调各地的资源供养帝都，帝都基本没有任何自给能力。帝国秩序崩坏，帝都马上会陷入巨大的物资缺乏状态，第一个冬天就会有一大半人冻饿而死。阿西莫夫笔下的川陀陷落就是这个景象。然后出现劫掠者，最后才是农民起义军屠城。总之，朝代更迭之后，新朝得到的一定是一个空无一人的前朝旧都。事实上若是没有清兵入关，北京人很快会被闯王屠杀殆尽。\n\n大洪水期间，贵国会变成遍地哀鸿的食人乐园，可参考任何朝代更迭的记载，「某某末年，盗匪横行，民不聊生，易子而食」，大抵如此。阿姨说，我们可以去关注俄罗斯未来两三年的新闻，惨状乘以十倍就是贵国的大洪水景象。\n\n人们能否熬过大洪水，一看地理禀赋，二看民间组织能力。地理禀赋很好说，土地越富饶，越能养活更多的人，抵御能力就越强。从这个意义上讲，满洲（满洲有极大的可能被解体后的西伯利亚远东共和国侵略）、天府之国、长江三角洲、珠江三角洲都比内陆地区要好。\n\n组织能力简单讲就是费拉化程度的反面。\n\n传统（人类社会的组织形态）的多样性是抵抗大洪水的良药。不同的组织形态，其效率是不同的。有的组织形态适合在恶劣的环境生存，但换一个相对富饶的环境就好显得效率低下；有的组织形态没法在恶劣条件下生存，但在富饶地区能发挥很大的优势。\n\n但在经过真正的考验之前，没人知道哪种传统更优，而传统一旦被破坏就是永久消失了，就算是「重拾传统」，那也是照着原来的样子重新建立的传统。换句话说，有很多民间传统看起来非常粗鄙，但因为是自发生长在这片土地上的，它往往具备很强生命力，在危急时刻，这些粗鄙的传统可能会挽救很多生命。\n\n农业帝国的扩张实际上就是帝国用自己的传统消灭排挤其他传统的过程。而农业帝国的传统就是费拉化。但帝国控制力有限，对疆域内不同地区的控制力也是不同的。简单讲，越靠近帝国中心地区，民众费拉化越严重，越是天高皇帝远的地区，越容易保存自己的传统。\n\n阿姨举了个例子来让我们理解传统多样性的重要：帝国治下的社会形态相当于高度同质性的麦田，虽然高产，但一旦来点外来物种入侵，那很容易就一个都不剩了。而恪守自己传统的多国体系地区就像是热带雨林，各种生态位都蓬勃生长，你很难有一种生物能消灭掉所有其他生物一家独大。\n\n总体上讲，大洪水来临，离帝国中心越近越危险，那些民风淳朴而剽悍的帝国边陲地区，存活可能性更高。另外，你和你身处的人群的德行也很重要，如果你发现自己生活的地方到处都是鸡贼费拉豚的索多玛，就算是流着牛奶和蜜的富饶土地也会被大洪水一并冲走。\n\n### **一切都是被锁死的路径**\n\n简单说，红龙的意识形态决定了大洪水注定到来。\n\n打个比方来说，绿教是病菌，有寄生体可以活得很有生命力，但没了宿主自己也能活，就是活得憋屈点。但红教是病毒。根据红教的理论，如果红教的目的真正实现了，那么一定会杀死宿主，而宿主一旦死亡，病毒也会跟着死亡。于是红教国家就处于一种无限精分的境地：一面要宣扬自己在意识形态上走自己的路，一面又要小心地不杀死宿主。所以，所有红教国家都必然一路高歌「从一个伟大胜利到另一个伟大胜利」地走钢丝，最后迎来大崩盘。\n\n大洪水来临时，国有经济利用各种方式借尸还魂，攫取其他成员的养分以自肥，最后导致为经济体效率急剧下降，突出表现为经济危机面前毫应对能力，只能祈求印钞机，最后就是恶性通胀与财政危机。\n\n红龙的这种意识形态决定了红龙就是一群蝗虫，在成熟的麦田中大吃大喝，麦田吃干净没飞到新麦田上就会被饿死。\n\n45 年的满洲，78 年的人口红利，就是红龙面临原有麦田吃完困境时新找到的麦田。而现在，贵国的人口红利基本吃完，红龙急需一块新麦田，而最近最可能被贵国收入囊中的麦田就是港台。\n\n红龙要想存活，那么势必要吞下港台，用港台的麦田养活自己，但时间不等人，2030 年前不完成吞下港台的动作，就永远不可能有机会了。因为根据贵国的人口结构，2030 年是老龄化问题彻底爆发的时代，人口红利完全变成人口负债。所以说，当今万岁对外作死的手腕看似愚蠢（其实也是真愚蠢），但这其实都是被锁定的路径。\n\n======================================================================\n\n### **后记**\n\n**问：给您一分钟时间和今上对话，您会对他说什么？**\n\n刘仲敬：我会说，你现在的智库全都是傻瓜，给你提建议的顾问都是傻瓜，你身边给你说这说那的人都是不怀好意的，然后 blabla 证明一下，然后说，现在的世界局势是如此复杂多变，过去的老规矩如何如何不能继续管用了，所以现在当务之急，你需要有新的智库，需要替你刷新世界的真正认识，需要有人替你瞭解夷情，了解西方世界和全世界的一切，总之是要更新整个认知结构，所以这一切中间最重要的就是钱，所以你应该赶紧尽快、尽可能好、尽可能多的发挥体制的优越性，把尽可能多的钱交给我，让我来给你主办一个智库，让我到爱丁堡或者是柏林或者是莫斯科或者是其他地方去旅游一下，给你了解真正的世界形势，提出真正靠谱的报告，你的优越性就在于你用钱是可以无限制的，而西方国家或者任何其他人用钱都是有限制的……【1 分钟时间到】\n\n**问：倘若今上卑辞厚礼，请您来组建智库，您要如何挽狂澜于既倒，扶大厦之将倾？**\n\n刘仲敬：\n\nPart 1 首先你要把现在所谓中国的性质分清楚。中国现在是三个体系的混合物，它不应该存在于同一个国家就是因为这个原因。这三个体系分别是：第一，内亚体系，传统上是中国的征服者，或者说是东亚的征服者；第二，就是所谓中国的核心，东亚的费拉地区，在没有计划生育的年代，它能够产生大量的苦力和盗匪，和平时期是苦力，战争时期是盗匪，但是随着生育率的衰退，这个地区已经注定要完蛋；第三个地区实际上就是吴越和南粤两个血汗工厂制造业地区，这个地区在经济上讲是从属于西方，在政治上讲却并非如此，所以这两者之间存在着尖锐的矛盾，它们的性质很像是 1860 年代左右的美国南方和 1880 年左右的埃及尼罗河地区棉花生产区的经济和政治的矛盾。\n\nPart 2 任何有效的政策都要有基本出发点，出发点就是，你必须事先确定，你这个政策的目的是要谁好，同时是要整死谁。如果你没有搞清楚你要整死的对象和你要搞好的对象是谁，搞出来了混合政策，结果就会是政策的各个部分相互破坏，哪个方面都讨不了好。因为现在所谓的中国包含着我刚才说的三种不同体系，所以你第一件事情就是要确定，你是要为哪一个体系服务，要整死哪一个体系。所以你只有三种极端政策、纯粹政策才能生效，而混合政策肯定会相互破坏，搞得大家都彼此破坏，结果是所有政策都会遭到失败。假定你的政策是以吴越和南粤两个外挂的初级殖民地生产基地为核心的话，那么维护它的政策核心就是要甩包袱。三个大包袱：紫禁城、梁山泊和内亚游牧地带。\n\nPart 3 李鸿章当年是想甩掉内亚游牧地带，他愿意抛掉内亚，但是不肯抛掉紫禁城和梁山泊。因为第一，他自己就是从白完费拉地区过来的，第二，他自己是紫禁城大臣，所以既得利益使他不能够真正为吴越着想。真正为吴越着想，那你需要有三个步骤。第一个步骤，迁都上海。北京作为首都，是内亚征服东亚的产物，近代我匪把首都从南京迁到北京，实际上就是共产国际顶替了内亚征服东亚的结果。只要这个基本格局不变，那么基本战略也仍然只能是背靠内亚敌视太平洋的。所以迁都上海是第一步。一旦迁都上海以后，北京依靠公务员消费维持的整个产业链就崩溃了。结果就会像是国民政府南京时期一样，随便一个小公务员都可以租一个大杂院。这一步是最关键最必要的，北京人不死绝，上海人没有救，整个吴越都没有救。\n\nPart 4 然后政府一旦撤出了北京，迁到上海，上海集团取代北京集团，那么效果就相当于：第一，在太平洋方面搞军备竞赛的第一大开支完全砍掉；第二，用来给东北提供大量贷款，维持华北平原上大批纯消耗性的军公教人员、维持社会治安的开销，在整个内亚地区一年数千亿的维稳开支，全都一刀被砍掉了。这两方面的好处会迅速改善上海政权的财政状况。但是与此同时，地缘上和财政上的因素使上海政权不可能控制内亚和北方，立刻就会出现蒋介石迁都南京以后的局面，满蒙藏内亚会陷入独立势力和割据势力当中，同时整个华北、华东的费拉地区会陷入红枪会、大刀会、伊斯兰国、全能神教之类的武装组织的控制和斗争中。\n\nPart 5 然后上海的中央政权必然会面临着选择，因为这时候它是名义上的中央政权，虽然支持力量已经发生了变化，肯定会出现类似蒋介石的人物或者派系，要求你重新恢复对满洲、华北和内亚的实质控制，要不然你就不配做大中国的领袖。这个时候你就必须抵制蒋介石式的诱惑，否则吴越和南粤的资源一旦投进这个无底洞，一切就前功尽弃了。这时候需要一场政变，你比必须政变成功，打掉所有可能出现的蒋介石，然后才能进行第三步和最后一步。打掉蒋介石以后，然后你就处在八一九事件以后叶利钦那种地位上，没有政变你还不好意思解散苏联，有了政变以后，你就可以一不做二不休的解散大中华，然后实现吴越和南粤以及其他几个附属邦国的联邦国家。然后这个联邦国家建立起来以后，你可以把美国海军请来护卫上海，这时候联邦存在不存在也就无所谓了。\n\n> https://www.pin-cong.com/p/51667",
			"added": 1526024635,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "蛮族勇士：最后的印钱——2014 年宏观经济综述",
			"body": "## 序章 诸神的黄昏\n\n这一章的主要内容，是讲历史。对于经济学，我一直以来的观点是：唯有了解历史，才能理解经济。经济的本质，是人。人心所向，浩浩荡荡，不可阻挡，顺之者昌逆之者亡。人心，就是历史的潮流，就是经济的规律。从清末到现在的百年历史之中酝酿着的潮流，隐藏着的规律，将决定中国这艘巨轮的航向。\n\n满清失国的理由，在于由几百万少数民族控制四亿汉人，它完全没有社会动员的力量。终清一朝，满清皇室对汉人都持压制态度。1840 年代鸦片战争期间，清廷从未进行过真正的战争动员，几万清兵疲于奔命，进行全国范围的轮防，靠两条腿追着英国人的战舰跑。最主要的原因在于不敢：一旦汉人全面动员和组织起来，形成军事力量，那推翻满清朝廷只不过是举手之劳。1851 年到 1864 年的太平天国起义，满清束手无策，总动员令根本就不敢下。只有曾国藩组织湘军，他的学生李鸿章组织淮军，将汉人武装起来，最后纯粹依靠民间武装力量，就将祸乱中国的长毛贼剿个干净。整个过程中，满清朝廷除了添乱之外，没有一兵一饷的助益。\n\n这么看起来，汉人只要动员起来，那绝对有翻天覆地的力量。但是这种动员力量吓坏了朝廷，传统儒生曾国藩又不敢造反，最后逼得曾国藩解散湘军，郁郁而终。此后满清统治的主基调就是打压已经动员起来的汉人，慈禧的主要日常工作，就是和李鸿章怄气。1894 年中日甲午海战失败的主因，就在于慈禧坚定的制止李鸿章的北洋系的任何社会动员，甚至朝廷还要把军费抽走去修皇家园林。满清对汉人动员起来的结果，惊惧到了骨子里，即便是 1900 年八国联军攻入北京城，慈禧西逃，满清朝廷也没有任何全国总动员的打算。于是 4 亿中国人，就此自废武功，被西方列国反复的蹂躏，毫无还手之力。\n\n整个清末的对外战争，都是不对等的战争。中国从未真正进入过应战状态，从未真正的征发士兵，集中资源，来打一场国战。最多就是几万缺乏训练的八旗兵疲于奔命地到处救火罢了，国人基本上就置身事外，抱着看热闹的心态。要是有哪个国人脑子一热，动员社会力量掺和一把国战，最大的可能就是被满清朝廷当成造反分子给砍了脑袋。于是就这么几十年如一日地看热闹看下来，在国人的脑子里留下的印象就是：这国家大事，和我就没啥关系嘛。这大概算是国人缺乏社会责任感的起源。\n\n满清压制汉人，是一把双刃剑，一方面四亿汉人缺乏社会动员力量，难以动摇几百万满族的统治根基，另一方面，满清朝廷也没啥值得一提的武装力量，应付社会动乱的能力很弱。就这么拖到 1911 年，盛宣怀打算把湖北通往四川的铁路工程收归国有。老实说这个铁路工程原本由民间主办，基本上就是在瞎搞，各路主持的人马全都在贪污，在民间募集了上千万的银子，铁路的影子都看不到，连路基都不知道在哪里。盛宣怀的手段算是强硬，整条铁路收归国有之后，交给外国人主持修建，至少花了钱还能看到路。但是另一方面，他要这么一整，原本的贪污行为就要大白于天下，贪污犯们必须把吞下的银子都吐出来，这下大家都受不了，于是彪悍的四川贪污犯们就开始闹事，把过来查账的官员统统都砍了头，史称「四川保路运动」，这基本上是贪污犯的拒捕行动了，跟什么民族大义根本扯不上关系。结果满清朝廷也没力量镇压，想来想去，好歹从武汉调了点兵过去，没想到武汉又开始闹。然后全国都开始闹，最后的结果，就是统治中国 267 年的满清朝廷，因为几个贪污犯闹事，就此失国。整个过程看起来，就跟开玩笑似的，基本上就没打仗。然而我们仔细一回顾，这个朝廷根本就没有社会动员能力，当然也没有发起战争的能力。只要乱起来，不管是怎么乱的，哪怕是几个贪污犯公然拒捕，这个朝廷就算是完了。\n\n接下来就是纷纷扰扰的民国时期，一开始当然是北洋系唱主角。这个派系缘起于李鸿章的淮军，算是拥有一些社会动员力量。北洋系自个有工厂，有遍布全国的码头，有轮船，算是建立起了自己的工业体系和物流体系，跟洋鬼子比说不上强大，至少比国内其它力量要强。遵守工作纪律的产业工人随便组织和动员一下，摇身一变就是高素质的职业军人。这都是北洋系的底蕴。所以满清的江山，只能交给北洋的人马，也就是当时北洋系的代表，袁世凯。然而袁世凯的悲剧，在于他也只不过是北洋系的一个代表而已，他无法全面控制北洋系的资源，他旗下的各大军头，各有各的地盘和势力，老袁要下令轮船招商局运一船大麦到陕西救灾，伍廷芳可以毫无理由的拒绝，袁世凯还真拿他没办法。\n\n袁氏当国，就在干一件事：整合资源，提升中国人的社会动员力。可惜这事情不容易。北洋系自己就山头林立，根本整合不动; 至于被满清压制了 200 多年的中国平民，就更加难整合了。曾国藩当时还有大义作为社会动员的名头：保家卫国杀长毛。袁世凯啥办法都想不出来，面对内忧外患一筹莫展，活人都能被尿给憋死。当然他最后确实也是因为肾病被尿给憋死了，算是当时中国人对于自己孱弱的社会动员力的最佳注脚。\n\n就那会，人人都知道问题出在哪里了：中国人已经 200 多年没被动员过了，都疲了，个个都是老油条。敌人杀到面前了，还能动员一把，比如被太平天国的长毛们蹂躏的湖南江西。其它时候，那真是自私自利成性，等闲绝不掺和国家大事，哪怕八国联军打到家门了，照样搬把椅子坐在门口看热闹，顺便还要跟洋鬼子做做生意，卖个茶叶蛋啥的，袁世凯想要在这种僵化的社会氛围之下，完成社会总动员的任务，就像只手想遮天似的，纯属自不量力。他自己的北洋系都整合不来，更别说其它地方的实力派了。所以袁世凯最后打算称帝，以皇帝的名义，获得大义的名头，试试看能不能作为整合社会资源的最终手段，结果各地的实力派根本不给面子，一团散沙惯了，下意识就抵抗整合，看到你老袁摆出一副要吃干抹净的模样，立刻就起兵反抗。所以袁世凯称帝这个事，也谈不上倒行逆施; 至于蔡锷起兵反袁，更谈不上英雄。无非就是乱世儿女，寻找救世的手段，各有不同罢了。\n\n袁世凯死后，中国彻底进入一团散沙的状态。那时候的知识分子往国外一看，社会动员模式，有两种：一种是欧美模式，简单说起来就是拥有社会资源的资本家们搞选举，得到最多选票的资本家代表，当然就拥有最大的社会资源，这家伙一声令下，至少投他票的资本家们，愿意出人出力。其它资本家抵抗不了大势，也只能跟着贡献资源。这算是一种精英模式，有文化的有教养的资本家们，靠社交沙龙里的合纵连横，用选票来完成社会动员。另外一种模式，是苏联模式。大名「国家社会主义」，讲究的是充分发动最底层劳动人民的力量，从基层群众开始整合，动员最广泛的民众资源。这家伙要是整合起来，排山倒海势不可当。精英模式之下的社会动员能力，根本无法与之相提并论。\n\n想想就能明白：最广泛的社会动员意味着什么? 意味着每个人都是国家机器的一部分，除了用以糊口的那点资源之外，其它所有资源都能贡献给国家! 所以苏联能以一国之力，和整个欧美分庭抗礼。你资本家们的精英模式，能集中多少力量? 你能把整个企业都献给国家? 你自己不吃香喝辣了? 今时今日「国家社会主义」这个词臭不可闻，简称就是「纳粹」，在当时那可是治世救国的良方之一，在全球的知识分子心目中，那真是有震撼性的启蒙意义的。\n\n接下来的中国，基本上就是这两种模式的较量：以国家社会主义为指导的中共，与以精英资本家为基础的国民党，以中华大地为棋盘，以四亿人的命运为棋子，竞夺民心，逐鹿中原。在当时的知识分子看来，中共搞的最基层的社会动员，广泛发动农民，并没有什么不好啊。斗个地主老财啥的，斗完了，大家把他的田地分了，这还没完事呢，接下来就是极其酷烈的税负。在中共占领区，税不是按比例抽取的，而是实施配给制。斗完地主分了田的农民，种出来的粮食，只能按规定的分量留取一小部分用于糊口，其它部分都要上缴。\n\n这社会动员力大得惊人，国民党的老蒋根本上就是望尘莫及。想想老蒋的苦处吧：中国作为一个传统的农业社会，资本家群体根本就不成型，能贡献的资源有限。而广袤的农村的地主们极难动员，资本家政权之下，政府的触角根本吸取不到农村的养分。长年苦于社会动员力太弱的知识分子，面对内忧外患一筹莫展。现在中共如此有效率的动员办法出来，并且成功地搞了好多个根据地，没事还秀一把肌肉，两千五百里长征都死不了，走到哪里活到哪里，国家社会主义几乎就没有适用地域上的限制，有个十天半个月，一通大字报加几次批斗大会，就能最广泛地动员民众集中资源，这赫赫威名，那真是让人叹为观止。\n\n所以我们这么回头一看，在社会动员能力上，中共天生就比国民党要强，就更适应我们这个传统的农业社会，适应这个被满清抑制了 200 多年的中华民族。没敌人就制造敌人，没大义就制造大义。地主老财欺压良民，这就是最好的社会动员理由。这个理由一打出来，自私自利的国人自动就会跟上，上了船之后，才知道接下来的船票，是要用全副身家来买，这时候想下船都来不及了。这个玩法，中共玩得炉火纯青，比纳粹党那套拿犹太人当敌人的玩法要高明得多。犹太人的遭遇现在是人人同情，但是一直到今时今日，中国当年被冤死的地主老财，那可都没能获得一个正确的评价的，那可都还是遭受千人指万人骂的。\n\n然而，国家社会主义的致命之处，在于民众力量的不可控。星星之火可以燎原，但是最后的结果，往往是玉石俱焚。最广泛的社会动员，固然可以拥有最强大的社会力量，但是这种力量一旦成型，就无法自动消散，最终的结果，往往是一场巨大的社会灾难。纳粹动员了整个德国的社会力量，最终的结果只能是向全世界宣战，以宣泄力量。而老毛动员了整个中国的社会力量，最终的结果只能是发起一次又一次的群众运动，让人民自己斗自己，最后在一次惨烈的文革之中，将中国积蓄了三十年的群众力量，消耗得干干净净。\n\n目前来说，全世界最普遍的治理模式，仍然是精英模式，资本家动员模式。精英们在沙龙里彬彬有礼的博弈，能整合的资源固然有限，但好歹能实现自律，整体可控，破坏力非常有限。而国家社会主义的草根模式，动员能力固然非常强大，然而破坏力也惊人，草根也没有自律能力，一团散沙一旦聚合为沙球，只能是顺势翻滚，将挡在前面的生灵，消灭得一干二净，直到碰到最坚硬的钉子，被撞得粉碎，才会停止破坏。\n\n改革开放之后，中国政府搞经济的方式，仍然是最为传统的草根动员模式。作为全球第一的制造业大国，产业工人是中国制造业兴起的决定性力量。而产业工人中最为庞大的群体，就是中国现在总数高达 2.6 亿的农民工。这些人怎么来的? 这是我们的基层政府，运用最传统的人盯人策略，一个个的动员出来的。改革开放后，东部城市的市长和中西部城市的市长见面，基本上都是谈农民工问题。前二十年是中西部想主动往东部送人; 后十年是东部想从西部要人; 最近这几年，是西部想把人从东部挖回去。这个国家用群众运动的方式，完成了工业化。搞制造业没钱? 用农业补贴工业，农民补贴工人。修桥修路没钱? 集中资源! 举全国之力完善东部沿海地区的基础设施。哪怕西部穷到一家人穿一条裤子，也要把东部的高速公路网修起来。\n\n中国人也认这一套，几乎是毫无怨言。90 年代很多西部的学生第一次走出家门，到了北京上海读大学，出火车站广场一看，当场就能被那繁华给震到呆傻掉。中共的这种社会动员能力，真是让世人震惊。中国因此在第一次产业大转移的浪潮中，迅速抢夺到了最大的蛋糕，欧美要往外转移基础制造业，那真没其它国家可以和如此有效率的中国政府竞争。\n\n然而，我们的问题恰恰在于，用群众运动的形式搞经济，将整个中华民族充分动员起来的结果，就是整个国家都被经济绑架。此前我们动员群众的方式是创造假想敌，改革开放之后，我们的方式则直指人心深处最深处的欲望：共同富裕。我们编造了一个人人都富足的未来，我们用无所不入的宣传机器让每个人都相信未来会丰衣足食。我们使用了最强大的动员力量，将 2.6 亿的强壮的农民驱离了农田，让他们进入了制造业领域，将他们培养成了有组织的制造业工人，给了他们在城市定居的希望。我们强制无数的国企员工下岗，让他们下海搏浪，经受商业文化的冲击。我们将生老病死统统市场化，让资本的腥臭蔓延整个大陆。我们搞起经济来不遗余力，我们动员起来的力量，远远超越了此前三十年的想象。那么，我们在经济下行的这一刻，会有什么样的命运? 将付出什么样的代价? 这一次，我们能控制住从未有人控制得住的草根的爆发力量吗? 那早已焚烧起来的燎原大火，会烧到我们自己身上吗?\n\n这个已经没有了伟人的时代，这个草根当道的时代，这个最渺小的人也能发出最强硬声音的时代，这个诸神的黄昏，将会看到一次什么样的落日?\n\n## 第一章 纸币时代的终结\n\n自从人类从原始时代进入文明时代之后，商品交易就开始了。早期的商品交易无非是以物易物，尤其是国际贸易，一般都是以物易物形式。中国古代流行的铜币，跨过丝绸之路，进入中东地区，就变成垃圾，阿拉伯的弯刀战士们热爱的可是光灿灿的金币。真正的国际货币的出现，还得等到大英帝国一统江湖，在全球到处建立殖民地，将英国的金本位体系移植给全世界。英格兰发行的金币，是大英帝国征服全球的利器，其地位比今天的美国发行美元还牢靠的多。\n\n拥有全球唯一的世界货币发行权的英国佬，可以躺着挣钱，也就是「钱息」。钱息这个词，实在是能让这世界上稍微有点势力的国家都红了眼睛。发行一枚价值一英磅的金币，金含量可以只有 0.7 英镑，大家照样信任它的信用，相信可以拿着这枚金币去大英帝国央行换取到足额的金子。这差额部分，就是「钱息」。政府的 7 毛钱能当 1 块钱用，这种好事去哪里找? 所以英国的全球霸权地位，自从建立起来，就遭遇到疯狂的挑战。法国德国意大利这些欧洲强国至今和英国的关系不好，就是在那个混战时期留下的宿怨。\n\n英国的世界货币发行国的地位，一直维持到了二战之后，美国强势崛起，雄霸天下，成为世界黄金储备第一的国家，取英国而代之。英国就此沉沦下去，现在也是一天不如一天。要注意的是：拥有国际铸币权的国家，挣钱挣得太容易，后果就是产业空心化。躺着铸币挣钱，谁还愿意干实业啊? 铸点钱出来做贸易就得了，工厂这种又苦又累的活，还是让德国人去干吧。英国的铸币权维持了足足两百年，其后果就是这个第一次工业革命的起源国，竟然就此变成了一个买空卖空的贸易国，制造业几乎就归零。这种产业空心化文化又影响了它的殖民地香港，使得香港逐渐抛弃了赖以起家的制造业，建立起一种畸形的金融买办型经济体，富了少数人，而大多数港人却陷入无业可就的窘境，对未来充满绝望。\n\n美国从 1940 年代抢下国际铸币权，维持着金本位的体系，一直维持到 1970 年代初期，终于支撑不住了。金本位结束的理由只有一个：黄金产量太小，不足以支持全球日益强大的制造业交易需求。1970 年代初期，全球的黄金总量也就是 10 万吨不到，扣掉各种首饰、家庭储藏以及工业需要，能作为货币发行储备的黄金撑死了也就是 5 万吨不到，其中美国政府的黄金储备只有 1 万吨出头，按当时的金价计算，也就是价值 100 亿美元多一点。而当时各国的制造业都在突飞猛进的发展，打完了仗，全世界都在专心致志的发展经济，国与国的交易需求旺盛。对比当时美国过万亿的 GDP，英国德国法国各自 2000 亿左右的 GDP，这点子黄金塞牙缝都不够，拿来作为国际货币的信用担保，真是让人笑掉了大牙。勉强维持金本位制度，根本就纯属痴人说梦。所以尼克松总统毫不犹疑地废掉了布雷顿森林体系，宣布黄金与美元脱钩。美元从此作出纯粹的纸币，获得世界货币地位。它的信用纯粹由美国强大的经济和军事实力作为担保，而不再由贵金属储备作为担保。全世界也都欣然接受。美元时代，或者纸币时代，就此降临。\n\n然而，这一次美国人印纸币，与上一次英国人铸金币，有着本质上的不同。整个游戏规则都被颠覆了。铸币权不需要强大的实业基础，贵金属本身就有信用，英国人只要维持住军事力量就够了。印纸币就很麻烦。纸币本身没有信用，它的信用完全依赖于发行国的实力。拿着美元的外国人，要能在美国买到他想买的商品，最好是能买到本国买不到的商品，商品类型越高档越好，商品质量越精细越好。所以拥有国家纸币发行权的美国，骨子里就有往高精尖上发展的冲动，创新是人家的本能。虽然基础制造业被转移到了中国，但是老美从没放弃技术研发这一块，高端制造业始终牢牢的掌握在手中。制造业的最高水准，还是得看美国。1970 年代之后，历次工业技术的重大突破，都发生在美国，这不是偶然的。信息技术革命完全是由美国人带领，其它国家基本上是在打酱油，这其实也是一种历史的必然。\n\n这么一看，美国人的霸主地位，还真没法撼动。要实业有实业，要航母有航母，没事就技术革新一把，全世界拍马都赶不上。勉强能在几十里外踉踉跄跄跟着的，就成了二流国家，比如德国和日本。中国大概在百把里外旁若无人的原地踏步，拿着基础制造业堆泥巴玩，看看身边没有其他人和它抢泥巴，高兴得要命。这就是新世纪的国际局势。\n\n然而麻烦在于，印纸币有它的天生缺陷：纸币总额有上限。美国政府不能无限制地印钞下去。纸币这个东西，本质上其实就是政府发行的债券凭证，用政府信用为它的购买力做背书。在发行机制上，就是美国政府向美联储借钱，美联储印出一笔美元交给美国政府。美国政府以后收到了税，就要把钱还给美联储。这么一看，美元的上限，就是美国政府印钱印到还国债利息都还不上的时候。现在美国国债总额接近 18 万亿，其中最主要的 5 年期国债利率大概是 1.5% 不到，这样算起来，每年要还的利息超过 2500 亿。而美国联邦政府的财政收入也就是 2.8 万亿左右的规模，拿出其中近 1 成的收入来还利息? 那真拿不出来。在奥巴马执政的这些年，年年都是巨额赤字财政，2013 年的财政赤字更是高达万亿。唯一的办法就是印新钱来还旧钱。这个印法是恶性循环，纯属往政府的债务炸弹里添火药。\n\n到了这一刻，美国人也想不出好法子。联邦政府的预算案危机都爆发好几次了，美国两级议会看着预算案里的赤字就犯恶心，每次都不肯干干脆脆批复，先拖着，一直拖到实在拖不下去了，政府都要关门了，才捂着眼睛批上几个月的钱。总之，逼着奥巴马政府改善财政，消灭赤字，已经是美国上下同心，不得不为的事了。所以，美国要自废武功，弱化自己的国际货币地位，鼓励美元和产业回流，这也是势在必行的事。2014 年以来这种趋势日趋明显，仅仅看一个数据就够了：2014 年美国联邦政府的财政赤字锐减，不到 5000 亿，是 08 年以来的历史最低水平。\n\n但是世界各国现在全都傻了眼。全世界的国际贸易，有 8 成都使用美元结算，现在你美国说不玩就不玩了，让其它国家情何以堪。没了美元，大家连怎么做生意都不会了。但是美国人也没办法。国际货币地位虽然很快乐，但要是债还不上，国家信用崩盘，那更可怕。在这种威胁面前，印钱的那点甜头都可以舍弃，美联储对此从不隐晦，从来都是明明白白：世界经济衰退和我美国没关系，只要美元回流，我这边能撑住就行。国际经济的繁荣稳定根本不在美联储的考虑范围之内，美元也绝不承担这样的义务。未来怎么样，你们各国都看着办。\n\n二流国家的应对办法很明确：你美国停止印钱了，我来印! 好歹我也算个二流，信用多少有一点。所以欧盟和日本的央行都在搞宽松货币政策，目前看起来还能苟延残喘，算是绝望之中不是办法的办法。绝大多数的贫穷国家其实根本就没办法，只能等死，经济一个接一个的崩盘，说起来都是一把鼻涕一把泪。委内瑞拉这种国家已经惨到要当裤子的地步，欠的债根本没钱还，打算出让国土还债。俄罗斯试图牛逼一把，逆天改命，重振雄风，以军事大国的地位建立卢布的信用，抵抗美元回流的威胁，于是悍然入侵乌克兰，结果几轮国际制裁下来，被整成了猪头，卢布跌成了渣渣，现在对美元的汇率是 65，一年内贬值了 50%。2014 年所有的新兴国家的货币都在贬值，普遍贬值 10% 以上，只不过和俄罗斯卢布的惨况比起来，没那么明显罢了。\n\n这就是目前的国际经济大势: 纸币时代要走向终结，美元要回流，新的国际货币根本就出不来。恢复金本位纯属扯淡，黄金的总量太少，根本承担不起国际货币的地位。眼看国际经济的游戏规则就要改变，一场大变近在眼前。要说这场巨变能和平度过，我自己就不信。除非目前这些等死的国家，包括俄罗斯，全都乖乖地一直熬到饿死。以人性来说，这是不可能的事。\n\n就目前的情况看起来，唯有中国，好像置身事外似的，人民币汇率岿然不动稳如泰山。虽然中国的宏观经济也是惨淡萧条得不行，但是外表看起来，这个国家竟然好像抵抗住了美元回流的威胁。这个搞了 30 年经济总动员的国家，似乎比其它所有新兴国家都要强。现在我的问题在于：我们真的能以全民总动员的方式，抵御纸币时代终结的风险吗?\n\n## 第二章 人民币的信用\n\n满清被推翻之后，民国政府的货币基本上以贵金属为信用支撑。袁世凯政府铸造的银币「袁大头」举世闻名，是收藏界的热点品种。老蛮我曾经在家里发现了好多枚，后来偷出来和小伙伴打牌玩，袁大头都输给了小伙伴，赢了一叠糖纸回来，高兴得不得了。贵金属货币没啥可多说的，它本身就有信用。铸币的前提，是掌握丰富的贵金属资源，也就是有钱。民国中期发行纸币，也是以贵金属储备作为前提。到了后期，国共争霸的时候，蒋介石政府的财政支出猛增，美国人的资金支持又停止了，依靠总额 10 亿美元左右的黄金储备作为发钞的信用支撑，根本满足不了需求，连一次稍有规模的会战消耗都支持不了。\n\n它的社会动员力极弱，民间的财富根本整合不来，表面上管理着 4 亿人，其实能收到税的也就是几个大城市，占据人口绝大多数的乡镇地区基本上处于自治状态，税收都被地方实力派分了。国民党政府被逼得没办法，军费支出又是刚性的，于是只能凭空印钱，越印购买力就越弱，于是只能印更多钱，恶性循环之下，国民党政府的财政完全破产，很快就失国。问题根源其实就在国民党孱弱的社会动员力上。没有社会动员力，就整合不了资源，就收不到税，于是凭空印出来的「金圆券」就只能变成垃圾，毫无信用可言。\n\n说到这里，很有必要仔细说一下纸币。早期的纸币一般是以贵金属为信用支撑，有多少贵金属储备，就印多少纸币，了不起多印个 30% 出来，其实骨子里还是一种金属币。随着社会经济的发展，政府财政收支规模的扩大，黄金白银的总量太少，根本不足支撑市场大规模交易的需要。所以人类进入纸币时代之后，纷纷就要选择抛弃贵金属，将纸币定位为纯粹的信用币：用政府的信用为它做担保。\n\n问题在于，政府的信用从何而来? 最标准的答案当然是强大的经济实力和军事实力。实力越强，纸币的购买力就越强，放到国际上，汇率就越坚挺。关键是有些政府啥实力都没有，那就要看你印出来的纸币能买到些啥，南美国家的纸币能买到矿山和森林，中东国家的纸币能换石油，这些自然资源也能给纸币加持，增加信用。最差的情况，就是拿着刺刀逼着别人用，不用就刺刀见红，这种情况在人类的纸币发展史上，也不少见，当然这种纸币的流通性和购买力也最弱。说了这么多，现在问题来了：人民币的信用，到底从何而来? 这个问题其实已困扰世人很多年了。\n\n中共发行货币的历史很早了，在 1930 年代就开始发行。当时我党正处于在国民政府的权力真空区建革命根据地的阶段，到处搞「苏维埃政权」。在中央苏区设立了苏维埃银行总行，在其它苏区设立了分行，统一发行纸币。必须注意的是：从一开始，中共手上就没有贵金属储备，它必须为自己的纸币寻找其它信用支撑。单纯用武力强制发行是不行的，这属于竭泽而渔，捞一把就没了，不是理想远大的共产主义者愿意干的事，所以还得用其它办法。\n\n中共的社会动员机制在序章部分解释过，在这套体制之下，老百姓基本上是手无余财的，所有资源都要集中到苏区政府手上。乱世最值钱的就是粮食，而苏区的粮食，基本上都在苏区政府手里。苏区的老百姓拿着苏维埃银行印出来的纸币，才能换购到粮食。所以苏区的纸币，信用非常稳定，接受度也高。当时国民党以贵金属为支撑的法币信用甚至还比不上苏区币，两边打过几次金融战，基本上都以国民党失败而告终。国内经济学界，因此将苏区币的信用来源，简单定义为粮食。但是这个事情要更加深刻的理解：苏维埃政权之所以能掌握粮食资源，恰恰在于它强大的社会动员能力。这种能力保证了它能最大程度的收集整合资源，也就保证了它的纸币信用。\n\n因此，苏区币的信用，完全来源于中共的动员能力，来源于它的资源整合能力，来源于它的「国家社会主义「信仰。一种政治理念付诸实施，就足以替代金银的信用，支撑起一种全新的纸币，支持一个政权的诞生。这种事情，想起来就令人激动。所以当时的知识分子纷纷向中共麾下汇集，这并不是因为人家脑残受了骗，恰恰是因为人家看到了前所未有的奇迹，看到了足以颠覆三观的真实事件。\n\n抗战时期，我党继续了苏维埃政权时期的纸币发行方式。相对于此前较为统一的苏区币，这次由于被封锁得更狠，要突破国军和日军的双重封锁太困难，所以各抗日根据地都发行了自己的纸币，面值样式各有不同，种类超过 500 种。但是这一次我党再次成功的建立起了纸币的信用，哪怕是发行方式简单粗暴到近乎儿戏，强大的社会动员能力，总是能给边区货币以信用支撑。让一个严肃的经济学家看起来，整个过程可以这样描述：我党随便拿出一张纸，指着它说，这张纸值 100 斤大米，它也能轻易花出去。在人类的金融史上，唯有中共，实现过这种逆天的奇迹。\n\n抗战结束后国民党政府的货币系统崩溃，中共各根据地的纸币照样维持稳定，根本就不受牵连。以社会动员能力作为纸币的背书，以强大的资源整合能力为货币加持，即便是被封锁、被围剿、被无数次的逼入绝境，仍然可以保持货币信用，并且无惧社会动乱，无惧战争，无惧近在咫尺的物价暴涨。所以，我党能夺取天下，为举国精英迎入北京，也是没有悬念的事。\n\n说到这里，我们需要进一步思考: 强大的社会动员力可以让中共收集到足以应付大规模战争的物质，但这一切，其实是建立在人民的强悍的生产能力之上，建立在他们高昂的生产热情之上。中共所有的社会动员手段，都是为了激发民众的生产热情，让大家斗志昂扬的投入南泥湾大生产，让普通的老百姓不畏生死的在大炮的轰击下继续抢割小麦。事实上，正是根据地老百姓被充分动员后强大的生产能力，才保证了苏区币和边区币的购买力，才创造了人间奇迹。这就是中共中原逐鹿的真正本钱。\n\n中共建国后，干了 30 年的批斗与自我批斗，商品交易本身几乎都被废止，整个国家的经济回归到原始时期，建立在「凭票供应「基础之上的计划经济体制，和以物易物差别不大。这段时期根本不需要考虑纸币信用问题。1980 年代开始改革开放，这一次，我们仍然是用群众运动的方式，将民众完全动员起来，投入到经济生产之中。在」共同富裕「的梦想之下，中国的老百姓焕发出巨大的生产热情和超乎想象的坚忍。贫瘠的西部种出来一点庄稼，几乎等于是白送给东部的城市居民，自己穷得衣不蔽体，也要让东部的同胞吃饱穿暖了好好搞生产。就这么一直无私奉献了 20 年，东部的工业产业链基本成型，才开始有东部对西部的反哺，取消农业税，同时发起西部大开发。在改革开放的 30 年中，中国人民创造了震惊世界的经济奇迹，从一个纯粹的农业社会变型为部门完备的工业社会，能生产出这个世界上所有种类的工业品。而这，恰恰就是人民币的信用之源。\n\n我们必须要注意，在中共的印钞史中，从未有过贵金属储备的概念。从中共诞生的那一天开始，它就是一穷二白的身份。它最早的印钞就是基于根据地农民被动员之后的强大生产力，这是中共赖以生存和发展的本钱。到了今时今日，这仍然是中共印钞机的动力之源、信用之源。勤劳的中国人民用自己的汗水给人民币加持。拿着这张纸，大家都相信它可以购买到任何一种工业制品。无论我们的央行如何疯狂的印钞，只要我们的制造业还在，只要我们的生产能力还在，那么，我们的纸币就能维持信用。所以 08 年我们印了四万亿，我们能守住汇率; 今年我们又印了两万亿，我们还是守住了汇率。在苛捐杂税之下苦苦求生的工业企业主们，他们的汗水和坚守，是维持人民币信用的最坚实的防线。中国政府引以为傲的庞大外汇储备，也是我们的制造业主们一双袜子一件衣服的换回来的。中国经济学界主流的观点，「以美元为锚印钞」，事实上，这些美元，都是中国齐备的制造业链条带回来的。被广泛动员的工业能力，才是人民币的信用之源。这就是人民币的信用真相。\n\n然而，悲哀的是，这个国家正在以秋风扫落叶的冷酷方式，消灭自己的私营企业主群体。这个国家正在摧毁自己的信用根基，并且洋洋得意，自以为发现了经济的新常态。下一章，我会以翔实的数据，阐释制造业面临的前所未有的严冬。\n\n## 第三章 中国作为大国的破产\n\n对一个经济体来说，实现收支平衡是必须的事。一个家庭不能实现收支平衡，买米都没钱，每天都挨饿，那就只能破产，破产之后不算完，作为生命，日子总得过下去，那就只能走偏路，比如抢劫，比如卖身。偏路也走不通的时候，就只能是活活饿死。所以每逢乱世，很多家庭收入锐减，抢也没地方抢，把邻居做成人肉包子的手艺也不具备，经常就是饿殍千里。\n\n相对来说，公司破产倒是很简单的事。不管你公司有多少优质固定资产，有多少专利技术，有多少高级人才，只要现金流断了，公司就逃不掉破产的命。很多时候，净资产过百亿的企业，能因为短期内 2000 万的资金缺口，活活地被憋死。说不定最后清算下来，你的百亿资产只能折算成几百万的现钱，于是你只能去跳楼，一了百了。你的员工把你剩下的那点遗产分了，高高兴兴地去找另外一家公司打工，继续祸害另一个老板。\n\n最复杂的破产，就是国家破产。政府有支出也有收入，一旦收支不能平衡，即便是印钱也无法维持的时候，那政府也只能破产。政府破产的结果，是货币丧失信用变成废纸，政府的社会管理职能消失，警察和军队系统都无法维持，能源供应断绝，整个国家变成丛林社会。\n\n现在，我的问题是：中国政府，到底有没有可能破产? 这个建立在经济总动员基础之上的国家，这个以制造业生产能力为印钞之锚的国家，它会不会破产?\n\n考察一个经济体是否健康，关键是观察其收入与负债的比例关系。对于中国政府的债务数据，2005 年才开始进行统计，当年度的中央政府负债总额为 3.2 万亿 (注意，这个数据不包含地方政府负债，当时也不太允许地方政府借债)，政府财政总收入 (包含中央与地方两级政府收入) 为 3.1 亿，债务额与收入额大致相等，不过也还好，不算离谱，放到国际上，算是个平均水平。\n\n这种平衡关系维持到 2007 年，当年度的中央政府债务额为 5.2 万亿，两级政府财政总收入为 5.1 万亿。再之后，游戏规则变了。胡温政府为了应对 08 年金融海啸，推出 4 万亿投资计划。中央政府只出 1 万亿，其它资金都必须由地方政府配套投资。可怜地方政府基本上都是讨饭财政，在分税制之下，中央拿走 70% 税收收入，地方只有 30%，所以地方财政的常态就是穷，老师工资都要拖欠的，根本没钱投资。现在逼着地方政府拿钱出来，283 名市长对着温总理就是一句话：要钱没有，要命有一条。\n\n作为交换条件，中央于是放开了对地方政府借债的限制，地方融资平台犹如雨后春笋一样冒出来，潘多拉魔盒就此打开。到 2013 年，两级政府财政总收入是 12.9 万亿，中央政府的债务总额是 8.7 万亿，地方政府的债务总额则是从无到有，膨胀到了无法收拾的地步，按照中央调查组 2013 年中的清查结果，大概是 18 万亿。这个数据当然是缩水的结果，一定有相当额度的地方债务未能纳入统计。不过我们不管了，就看这个缩水的数据，地方与中央的债务相加，达到 20 万亿的规模，对比两级政府 12.9 万亿的收入，债务额是收入的 1.6 倍。这要还起来，根本不知道怎么还。\n\n2014 年以来，地方债的失控状态进一步加剧。在央行疯狂开启印钞机的背景下，地方债规模持续扩大。根据「中央国债登记结算有限责任公司」(简称「中债登」) 统计的「地方债」发行数据 (注意这只是公开发行的地方政府一般性债券，属于地方政府债的一种)，1-11 月已经达到了 4000 亿的规模，显著超过去年的 3500 亿。至于公开发行的城投债，到 6 月份就已经达到 1.1 万亿的惊人规模，远远超过去年全年的 7 千亿。而其它类型的地方政府债新增数量，则根本无从统计。按目前这种发展趋势，中国两级政府的债务总额，今年就能达到总收入的两倍了。\n\n另外一个可以参考的数据是：由中债登托管的债券总量，去年是 25.9 万亿，今年 1-11 月份已经达到了 28.6 万亿的规模，预计全年能达到 29 万亿的规模。基本上中国公开发行的债券，包括国债和地方政府债和企业债，都会在这个托管系统里反映出来。考虑到中国债市的发债主体基本上都是各级政府和国企，私企能发债的少之又少，所以这个数据，也能反映中国官方债务规模的扩大趋势。基本上，这一届的习李政府，没能控制债务的恶性膨胀，这是板上钉钉，无可质疑的事了。\n\n不幸的是，政府收入方面，则出现了显著的萎缩趋势。2014 年 1-11 月的财政总收入也就是 12.9 万亿，和 2013 年全年等同，预计全年的财政增收幅度也就是 9% 的幅度。此前每年的财政增收幅度，那可都是两位数。06 年是 22%，07 年是 32%，08 年是 20%，09 年在金融海啸的余威之下下降到 12%，2010 年恢复到 21%，2011 年还有 25% 呢。然后收入增速开始呈现显著的下降趋势，2012 年是 13%，2013 年则下降到了 10%。这样一看，目前这种财政收入增速，就好像连续遭受了 3 年的金融海啸肆虐似的。\n\n这种财政增收幅度的连续三年萎缩，一定要找到原因。幸运的是，这种原因很容易找，简直是随手拈来。2010 年中国工业企业总数是 45.3 万个，2013 年则是 35.3 万个。10 万个工业企业消失了。消失的主要都是什么类型的工业企业呢? 2010 年纯私营工业企业数量为 27.3 万个，2013 年下降到 19.5 万个，7.8 万个私营工业企业消失了。这就是我们近三年真实的经济状况。这才是冷冰冰的经济真相：民营制造业，正在大规模的死亡，死亡率高达 26%。与此同时，外资制造业逃离中国的趋势，也根本无从掩饰：2010 年外商投资工业企业数为 3.99 万个，2013 年下降到 3.12 万个。3 年时间，外资工业企业的数量减少了 8700 个，萎缩率达 22%。唯有惨烈这个词，才能形容这种极端的萧条。要知道，即便是 08、09 年金融海啸肆虐的年份，中国的工业企业总数，也能维持 42 万个规模不变呢。中国的统计数据基本上都是被处理之后的结果，然而企业数量这种冷门数据，关注的人很少，所以被篡改被调整的可能性很低，因此也相对可信。\n\n最近这三年，在纸币时代终结的大背景下，面对美元和产业回流的趋势，中国完全失去了抵抗之力。全民总动员的经济模式，怎么就抵抗不住产业回流的威胁呢? 怎么就保不住我们赖以生存的制造业呢? 怎么就丢盔卸甲到现在这样的地步? 莫非中国人的工作热情，已经无法再动员起来了吗?\n\n要理解当下中国人的动员力问题，必须追溯到 1995 的经济体制改革，当时的中国正处于经济崩决的关口，在欧美的经济制裁之下苟延残喘。今天的国人大多已经忘了我们当时经历过怎么样的困境，官方承认的居民消费价格涨幅，1993 年为 14%，94 年为 24%，95 年为 17%。这是非常恐怖的涨幅。93 年下半年，美元对人民币汇率从 1 比 5.64，连续攀升到 1 比 8.27，人民币贬值了 6 成多。朱总理为了应对困局，激发经济活力，采用了破釜沉舟的经济动员方式，当然，这也是中共历史上最后一次经济总动员：国企抓大放下，除了保留若干优势垄断企业外，其它国企全部卖掉，员工强制下岗，将生活安逸的国企员工驱赶到残酷的商海，进入富有竞争力的中小民企; 同时在财政上实施分税制，将 70% 的税收都收归中央，以集中和整合资源。\n\n此前中央与地方的财政是根据各自的行政职能比例划分的。中央的职能无非是军事外交，在现代政府所有行政职能中比例也就是 30% 的分量，而民生服务职能全部放在地方政府身上，占比 70%，所以此前税收收入的分配，也是中央 30%，地方 70%。现在一声令下，将税收分配体制倒转过来，但是行政职能的分担方式没有变化，从来没进行过任何调整。中央手里有了钱，当然就有了动员的能力，可以开展大项目的投资和建设，比如三峡工程，比如南水北调工程，以拉动经济发展。\n\n这一次决绝的动员方式影响深远。首先就是，中共逐渐丧失对人力资源的直接掌控。从国企被驱赶出来自谋生路的国人，首先就会丧失对这个政府的信任。考察城镇就业人口数据，2000 年国企的就业人数还有 8100 万人，显著高于民企的 1268 万、外企的 642 万和 2131 万个体户，这三者加起来也就是 4041 万罢了，只相当于国企就业人数的一半。到了 2013 年，国企就业人数下降到 6365 万，而民企则上升到 8242 万，再加上外企的 2963 万人、6142 万个体户，达到 1.73 亿的规模，反过来几乎达到国企员工的三倍。\n\n中共逐渐丧失对人力资源的直接控制的同时，分税制的恶果开始逐渐体现出来。地方政府只有 30% 的收入，却要承担 70% 的行政职能。民生服务职能必须花钱，这些支出都是刚性的，不可能压缩。医疗教育养老交通，任何一项的支出减少，都会造成社会生活水平的显著下降。想想一个城市吧，只有残旧的医院、破烂的学校，坑洼的路面，以及衣食无着的老人，在这里生活的人，绝对不会对这个政府心存感激，然而这确实是我们这个国家广大中西部三四线城市的现状。一个人穷久了，穷凶极恶，就会丧失道德底线，政府同样也是如此。所以我们会有匪夷所思的拆迁，无非是政府想挣点卖地收入罢了; 我们会有凶悍如匪的城管，无非是政府收不到流动商贩的税钱罢了。\n\n理论上，越穷的政府，就会越凶恶，官民矛盾就越大。所以广东最穷的潮汕地区，经常爆发恶性的拆迁事件，而湖南贵州的山区，没事就能闹出万人规模的散步。这么一想，东部发达地区，市场经济发达，民企就业人数显著超越国企，中共对社会的整体动员能力当然很弱，然而即便是中西部穷困地区，同样是民怨沸腾，政府官员走到田间地头去实施动员，基本上就是去找抽。现在这局面，能维持稳定就不错了，维稳费用的花销一直都是个谜，传说中是比军费还要高的，还怎么动员?\n\n此外，将这个国家 70% 的财富集中到中央，这个巨大的蛋糕，这个从未有过的金灿灿的诱惑，成为对中共人性的终极拷问。在中国历史上，曾经有过一次这种资源的高度集中。北宋时期，赵宋王朝聚天下财富于东京汴梁，所有的赋税都要上缴中央，再由中央进行分配。这种结果，是培育出一个庞大的官商团体，贪婪无度，与民争利，并摧毁了这个国家的统治根基，司马光和苏东坡，都是官商团体的代表人物，他们也终生服务于这个团体，从未有过任何背叛。煌煌大宋，屡次三番被外族入侵，而汉民普遍冷眼旁观，赵宋王朝丝毫不具备动员汉民抵御侵略的能力。王安石变法，其实是试图进行一次重新分赃：皇族试图从官商团体的利益中夺取一部分，用以强化皇家的军事力量。\n\n现在这一次，朱总理将天下财富聚集北京，号称特殊材料制成的共产党人，也没能抵御住诱惑，恶性博弈再次发生。官商的事情就不说了，国进民退，权贵资本侵占民资产业，太子奶的前科就在眼前，大家都清楚得很。这里只说政府内部的博弈。我们号称有所谓「财政转移支付」，中央政府会综合考虑贫穷的地方政府的项目需要，向穷市拨款。然而在巨大的利益面前，脆弱的人性根本经不起拷问。这个从未建立任何外部监督体制的国家，任由一帮从农民家庭走出来的官僚承受以万亿计算的财富的终极诱惑，那最终的游戏规则，一定会变成地方官员向中央官员行贿，大家一起坐地分赃，至于项目本身，根本就是可有可无，烂尾了或者根本不存在，也没人过问。随着分赃行为的持续，也一定会形成利益团体，形成派系，所以政坛上随便一数，刚被打掉的四川帮和山西帮，被连根拔起的石油系，正惶惶不可终日的上海帮，五大军区系，各大派系繁花似锦，煞是好看。在利益蛋糕面前狼吞虎咽的各路官系，从不掩饰自己的吃相，嘴角的奶油一直淌到肚皮上，也不会擦一擦。这种官僚团体，也当然不具备社会动员能力。\n\n源自于列宁的「国家社会主义」的动员能力，有两个基础性条件，第一，将最广泛的民众纳入统一的组织系统; 第二，为这个组织寻找到一个共同奋斗的目标。中共初期组织工会农会，发起群众运动，然后为他们设置假想敌作为奋斗目标。地主、资本家、黑五类、右派、知识分子、美帝，轮着斗了一圈。文革后期，民众开始觉醒，设置假想敌的玩法不好使了，于是转为「共同富裕」这种纯物资的诱惑，一穷二白的老百姓也接受了，工作热情再次爆发出来，创造了人类历史上的经济奇迹。\n\n改革开放 10 年之后，官僚资本开始尝试侵吞民财，「价格双轨制」就是赤裸裸的抢劫，官员的钱竟然比民众的钱更值钱，能买到更便宜的商品，还是优先供应，这不是扯淡吗? 于是民怨沸腾，80 年代末的乱局就不说了，经济上产业凋零，经济活力彻底丧失，到 1995 年，眼看这个国家就要破产。朱总理临危受命，使用了最决绝的方式，将组织内的民众赶出组织，将生老病死全部市场化，并最大程度的集中财富，算是勉强度过了危机，官方把这个过程叫做「经济软着陆」，其实是用逼迫老百姓自生自灭的方式，让他们自我动员，自我救赎。从这一刻开始，「组织」在逐渐消失，并被民众慢慢淡忘。动员的大义也不存在了，「共同富裕」已经被一再证明是一个谎言，而中共的高层领导，也没能经受住集中起来的财富的诱惑，他们的人格魅力也已经消失殆尽。中国政府正在日益快速的丧失动员能力，而社会动员能力，恰恰是中国政府的统治根基。\n\n在这样的背景下，这个国家应对危机的能力，脆弱到了危险的地步，或许，只要最后轻轻的一推，就足以让这个国家破产。\n\n## 第四章 不一样的危机\n\n在中共实施改革开放之后，经历过的真正的经济危机，就是两次，一次是 1995 年，还有一次就是现在。只不过这一次的危机，不同于 1995 年。95 年的那次危机，是源于我们自己内部瞎搞，是所谓内生型的危机。红色权贵们通过「价格双轨制」赤裸裸的抢劫，连掩饰都没有，太恶心人了，不弄出危机来简直对不起中国 5000 多年的权谋史。而当时的国际经济局势，仍然是产业大转移，美国、欧洲，包括日本，都在向外转移基础产业，专心挣着发行国际货币带来的钱息。所以当时只要我们再动员一把，把体制内的懒人赶进商海，总能抢到产业，总能度过危机。\n\n而这一次，则是内外交迫。国际货币发行国的债务都已经到了极限，美国政府引导美元回流以降低债务的决心之坚定，可以说是山无棱天地合冬雷震震夏雨雪，不敢再印钱。你再怎么阴谋论说这是美国佬想要剪羊毛了都没问题，关键是现在羊毛已经剪到你身上了，你还躲不过去。美国人撤回资金和产业的趋势已经无可争议了，2014 年三季度人家的 GDP 增长率竟然高达 5%，失业率下降到 08 年以来的最低点。这种数据看起来就像发展中国家似的，只能用突飞猛进来形容，根本都不像发达国家的蜗牛式经济。共和党的里根总统以强硬的手段将世界带入了美元时代，让美国繁荣了 30 年; 而民主党的奥巴马总统则要结束美元时代，目前看来他是对的，美国还能继续繁荣下去，至少不会比中国死得早。而能比中国多一口气，就足够了，就能在中国的废墟上建设经济殖民体系了。在老美看来，奥巴马的八年任期做到现在这种程度足够了，接下来就是擅长外交和打仗的共和党的工作了。\n\n在国内，则是一片萧条。地产市场在狂飙猛进了 15 年之后，今年终于显出了疲态。2013 年全年的商品房销售额是 8.1 万亿，对于 2012 年上涨了 26%，这种销售规模的上涨幅度是常态，大家一点都不惊讶。而到了今年，1-11 月的销售额仅仅只有 6.4 万亿，预计全年也就是 7 万亿左右，对比 2013 年的数据，不说增长了，竟然整个市场规模萎缩了 10% 以上。这可是晴天霹雳，自从 1998 年放弃福利分房政策，启动住房市场化改革以来，除了 08 年金融海啸期间萎缩过一把，市场规模年年都是大增。这样看起来，中国经济就跟金融海啸时期一样惨。\n\n就业方面，更加惨不忍睹。经济学博士李总理年中时候在外国吹牛逼，说我们的经济增长率虽然降了，但是我党我国一定能保住就业，一点问题都没有。这种逆天的话直接把全世界的媒体都给震了，没人再说话，纷纷的用同情的目光看着这位经济学大师。于是国内的媒体都 HIGH 了，说李总理大涨了中华的威风，外国鬼子都被吓住了。然而一查数据，原型毕露。11 月份官方公布的「制造业从业人员指数」为 48.2，并且整个 2014 年，都在 48 左右小幅度浮动。注意这种数据以 50 为分界线，高于 50 就是扩张，低于 50 就是萎缩。现在你制造业就业指数整年都是个 48 的水平，处于明显的萎缩状态。再往前看，上一次这个指数高于 50，还是 2012 年 5 月份的事，这么一看，你的制造业都连续萎缩了 2 年半了，这也刚好和中国政府财政收入连续三年萎缩的数据对应起来，算是数据上的相互印证，根本无从抵赖。\n\n至于非制造业，就业情况同样不乐观。还是官方数据，6 月份的「非制造业就业人员指数」还能有 50.4%，此后每个月都低于 50，在 49 左右浮动，10 月份是 48.9%，11 月份是 49.5%，连续 5 个月处于萎缩状态，这是在中国 07 年开始进行这项数据统计以来，从未发生过的事。要知道这些年中国的服务业其实发展得还不错，零售店餐饮店开得遍地都是，看起来很能吸纳就业人口似的，现在也萎缩了。原因很简单：制造业都萎缩了 2 年半了，财富的源泉枯萎了，旱情总要向下游蔓延。于是房子也买不起了，车子也买不起了，饭店也吃不起了。唯一红火的是淘宝店，刚好便宜，大家都穷的时候也不讲究质量，正版不正版的根本没关系，于是淘宝的双 11 活动火爆得不得了，仅天猫的成交额就有 570 亿，远远超出去年的 350 亿。这种情况反映出的，是整个国家的典型的屌丝消费型特征。屌丝再往下走，就是流民，就是暴民了。\n\n就这么一看，地产业全年萎缩，制造业都萎缩两年半了，消费萎缩了半年，整个国家都处于萧条之中，唯有央行在孜孜不倦的印钱，热情高涨，没事就创新出一种印钱方法。定向宽松、常备借贷便利，降息，最近又搞出一个隐性降准的玩法，据说能释放 1 万亿的钱。至于央行是怎么印钱的，印了多少，我们都不知道，算是国内最顶级的机密，没有之一。反正国内知道的人也不多，被架空了的李博士估计也被蒙在鼓里，糊里糊涂的，还公开声明反对印钱投资模式。结果到了年底，大规模的基础设施项目被发改委批了出来，两个月内光铁路就批了 28 条，这些全都是得印钱来建的。御用经济学家们此刻集体失声，不知道是该点赞还是该骂娘。\n\n在人类历史上，以印钱来应对萧条，没有成功的先例。1930 年代德国这么干，直接把全世界带进了纳粹军旗的阴影之下。简单的开动印钞机，就能振兴经济，除非人民币是跟美元似的国际货币还差不多。然而我们之前就说过了，人民币的信用源于这个国家曾经的广泛动员能力，源于我们被动员之后的强大的生产能力。没有了生产能力，人民币直接就是废纸。现在国际产业回流，国内的制造业持续萎缩，国家的动员力也削弱到了若有如无的地步，还指望无论怎么印都能维持住人民币的信用，这就是说梦话。所以今年以来，人民币汇率没事就剧烈的波动一把，根本就稳不住。再这么波动下去，大家对人民币的信心会越来越弱，守住汇率的成本也会越来越高，到守不住的那一刻，就意味着崩盘。\n\n中国人目前对这个国家目前经历的经济困境，普遍抱着的都是冷眼旁观的心态。想要主动闹事的不多，中国人绝大部分都是自私自利的本份人，有胆量混水摸鱼的还是稀罕物。然而现在问题在于：唯有再一次的全民总动员，才能应对危机。冷眼旁观是不行的，这是等死，而且也等不了几年。从萎靡的制造业中流出来的强壮的劳动力，需要找到工作，不然他们摇身一变，就是流民和暴民。服务业没了消费力，当然也得萎靡，也吸纳不了就业。目前只能靠印钱搞基础设施建设来吸纳就业人口，勉强支撑经济。然而，了不起你能印钱支撑完 2014 年，支撑过 2015 年，到 2016 年，人民币就会变成「金圆券」，信用彻底丧失，到那时整个车尾箱都堆满现金，也加不满一箱油。这种日子就意味着末日，而末日的生存法则，比的是谁更没有底线。越早动手把邻居做成人肉包子的，越能生存下去。在此提醒一句，根据历史文献记载，人血太腥，所以人肉必须要把血放干，正确的做法，是要把人剥光了挂起来，割开腿上的血管，令其慢慢失血而死。这种血流干后的肉身，皮肤发白，犹如白羊，因此学名就叫做「四脚羊」了。\n\n作为天生的乐观主义者，给本文一个这样凄凉的结尾，实在不符合我的个性，所以我在此给出另外一个可能性。要应对这一次的危机，唯一的办法，就是重振这个国家的动员能力。\n\n既然整个改弦更张的做法行不通，那就修修补补吧。党在政府层面的权力可以继续维持，至少把立法和司法层面的权力交出来，把法律的威严真正建立起来。至少你得让老百姓相信，这次你中共把大家伙动员起来，和老美打制造业争夺战，凡是获得的战果，都能得到法律层面切实的保护，不会再被红色权贵肆意的侵吞。这才是壮士断腕的改革。这意味着人大系统、法院系统、检察系统，要真正的去党组织化。人大代表要有真正的选举，法官和检察官要有真正的法律人内部选拔机制。如果能实现这一条，那么，我们还有可能和老美狠狠的打一场，输赢固然不可知，但不至于像现在这样，毫无抵抗力，好歹也能抢回来一些产业，减少一些流民，让灾难爆发的时候，不至于那么惨烈。\n\n然而，这唯一的路径，或许也根本是走不通的吧。",
			"added": 1526222971,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "大型德匹下",
			"body": "大男儿上台后，对外 COS 墨索里尼，对内 COS 腊。既然风向向招核方向发展，加上你国自古以来有用人血染红顶戴的习惯，批爱国热情饱满能力又有限道德几乎没有又想上位的傻逼自然开启告密模式，而且比当初八分钱让查半年简单多，现在有网络，一个傻逼粉红手指一动，一群傻逼闻风而动。\n\n肥肠诡异的是，前清时代，民怕官，但是鸦片战争种，坐拥反洋夷大义之后，P 民组织起来就敢跑去巡抚衙门闹事。同理平时你要微博举报个什么大老爷凌虐 P 民叫兽性骚扰，小粉红不是跳出来洗地，就是装看不见。性浪也是第一时间给你封了。但是举报什么精日啊，分裂国家，第一时间傻逼们就来起哄了。就算性浪怕事给封了，傻逼们也锲而不舍的抓发，还在脑海里给自己补了 COS 屈原的戏码。然后几个超级外围的傻逼组织比如什么紫光阁，共青团就开始带节奏了。当然傻逼们自己玩自己，别人是懒得管，哪怕最近吓大（确实是吓唬大了）的事，洋大人也懒得搭理。但是这股邪火最近烧大了。\n\n起因就是很多企业国家地区的一栏里有香港，澳门，台湾，这个几十年以来一直如此，无论酒店入住，航班预定，哪怕是大赵国自家的机场，港澳台出发都跟国际航班一起的。大家没人当个事\n\n几个小粉红不知道真的是没出过自己家的县城还是装傻，跳将起来，指责别人乳化，分裂祖国。你支的权力部门害怕背锅，第一时间跳出了让外商改，至少也要中国台湾。问题是外商的祖国不答应，大部分不搭理，到了美国这里，现在是美国政府直接跳出来了，讲：别给我这一套，老子不伺候。并将这个视为贵国的挑衅\n\n怎么讲，上层 COS 招核，下层就招核起来，中层害怕担责，就开始招外国人麻烦，这个让本就困难的外交更加没法开展。而 COS 招核的上层更是有苦说不出，估计要比 41 年日本面临的局面还要惨，可谓大型德匹下\n\n> https://www.douban.com/note/668598233",
			"added": 1526554552,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "中国驻南联盟大使馆被炸真相凸显共畜技术盗窃",
			"body": "中国驻南斯拉夫大使馆被炸真相（特别注意：该事件已解密）但媒体没有报道，网络上有些传闻，但不具体，详细的内容绝大多数国人皆有不知，故而在此分享一下。\n\n第一：当年的科索沃战争，共畜症腐不只在国际舆论上支持南斯拉夫，实际上派出了军事顾问为南斯拉夫出谋画策。\n\n1999 年 3 月 24 日北约发动了对南联盟的空中打击，科索沃战争爆发，这次战争中，美军出动了 F117 战斗机对南斯拉夫重要目标实施毁灭性打击。这种战机是美国研发的一种隐形战机，雷达难以发现，南斯拉夫政府对此一筹莫展。在此关键时段，共畜军事顾问透露出了中国共畜军方惯用的一着笨招。\n\n3 月 27 日，美军意大利机场的几架 F117 夜鹰隐形战机像往常一样起飞，直抵南斯拉夫空域。与此同时，在意大利美军基地附近蹲点的共畜军事人员将起飞时间通知了南斯拉夫的共畜军事顾问们，共畜军事顾问根据该基地与南斯拉夫的直线距离和美军 F117 的巡航速度，测算出了 F117 到达南斯拉夫边境的大概时间，并且通知了南斯拉夫防空部队，时间点一到，所有防空火力一齐开火，果然出乎意料，一架 F117 被打了下来。\n\n第二：F117 残骸顺利成章的落到了共畜顾问手中，它们把残骸运到了中国驻南斯拉夫大使馆，放到了地下室，本以为神不知鬼不觉，应该万事大吉地吃庆功宴了。没想到残骸里有 GPS 全球卫星定位装置，美军很快便精确地锁定了残骸的所在位置，克林顿当时十分震惊，决定给臭名昭著却又趁火打劫的大陆共畜症腐一个教训。\n\n美国情报人员找到了中国大使馆的建筑师，了解到该建筑共有五层，每层地板的厚度，楼顶的厚度，为钻地弹输入了参数。\n\n5 月 8 日，美军的 B2 轰炸机从本土起飞，飞临中国驻南斯拉夫大使馆上空，投下了几枚钻地弹。然而令美国军方意外的是，中国大使馆楼顶架设了卫星信号接收装置，俗称「大锅盖」。美国军方在投掷炸弹时，自动激光制导引信恰好照射到了「大锅盖」上，这样楼顶上就相当于又多出了一层，根据激光制导仪器之前设置的参数，每枚钻地弹每穿过一层炸一次，这样楼顶和楼上 5 层全都会被炸毁。由于激光制导系统的自动误判，将大锅盖也算作了一层，而地下室里的 F117 残骸才得侥幸保留。后来被偷运回了中国大陆，共畜症腐成功地剽窃并复制了 F117 战机的隐形技术、吸波技术、降噪技术、减阻技术、反射技术、材料技术等等，从而推动了中国隐身战斗机技术的新一轮发展。\n\n事件经过基本就是这样，可能在细节方面略有出入或偏差。这是一次成功的剽窃与山寨。然而上帝也有打盹的时候，君子真的玩不过流氓吗？真理是君子不屑与流氓缠斗。公理自有昭彰日，共畜团伙太无耻。\n\n正因为共畜在早期盗取的 F117 隐身战机的技术基础，才能有今天共畜症腐底气十足地鼓吹「歼 - 20」为领先世界的战机技术。\n\n---\n\n美国 B-2 隐形飞机设计图被盗，称已辗转流入中国。\n据《环球时报》报道，炒得沸沸扬扬的「美国隐形机工程师泄密给中国案」24 日宣判。此案的审理已进行很长时间，西方媒体一直借此指责中国共畜，渲染中国的很多军事技术是从别国「偷窃」来的。在此案开庭的同时，西方媒体继续轮番炒作中国歼 - 20 战机技术「来自从科索沃战场拿到的美国 F-117 残骸」。\n\n据美联社报道，现年 66 岁的印度裔工程师努希尔 - 戈瓦迪亚曾参与研制 B-2 隐形轰炸机，他涉嫌对华出售能令巡航导弹躲过红外线探测的设计材料。戈瓦迪亚于 2005 年被逮捕。去年 8 月，美国一个联邦陪审团裁定他出售军事机密和帮助中国设计隐形巡航导弹的罪名成立。\n\n报道称，戈瓦迪亚被控 14 项罪名，包括：阴谋策划、违反武器出口禁令、逃税和洗钱等。他最高将面临终身监禁。法官将于美国当地时间 24 日做出最终判决。\n\n此案曝光后进展缓慢。检方指控戈瓦迪亚至少收取来自共畜症腐的 11 万美元，并用这笔钱偿还了在夏威夷海边一座豪宅的贷款。戈瓦迪亚则一直坚称自己无罪。他的儿子反驳说，戈瓦迪亚这样有体面工作的人不可能出卖军事机密，更不会冒险用机密去换「这样一笔小钱」。\n\n另一方面，西方媒体仍在炒作中国共畜「盗窃飞机军用技术」的话题。美国《时代》周刊 23 日撰文称，中国共畜以「工业间谍渗透」而闻名西欧和美国。尤其是近年来，有关中国共畜间谍窃取军用和民用技术的案件日益增多。美国「Aquapour」网站 23 日称，在偷窃军事技术方面，中国共畜已然是久经沙场的老手。之前不断有报告披露，中国共畜通过在美国的间谍和雇用网络黑客，盗取 F-22「猛禽」战斗机的设计详图。\n\n英国《每日邮报》24 日继续炒作中国歼 - 20 战机「剽窃」的话题。该报称，很多西方军事专家认为，中国间谍 1999 年获取了一架被击落的美国 F-117 夜鹰战斗机的部分零件，这使中国共畜军方有可能发展隐形技术。本来，美国早已料定中国在数年内没有能力研发隐形战机，制造类似的 F-22「猛禽」战斗机对中国共畜来说已属上限。\n\n然而，《坏球时报》记者却公然反驳：多年前曾在贝尔格莱德的航空博物馆见到过这架被击落的 F-117 的很大一部分残骸，这些残骸当时是公开展示的，甚至可以拍照，要说研究，似乎每个到这里的军事代表团都可以研究，共畜症腐似乎并没有得到特别的优待。\n\n英国《每日电讯报》则渲染中国共畜剽窃俄罗斯的军事技术。该报称，去年中俄关系突然变得紧张，原因在于俄方指责中国共畜生产出与苏 - 27 战斗机和苏 - 33「海侧卫式」舰载战斗机几乎相同的版本。\n\n印度「国防」网站还称南非的国防装备技术被中国共畜复制。该报道称，在过去 10 年中，中国共畜与南非武器商有大量交易，大多是购买武器。近来出现的一些中国共畜军事装备被怀疑窃取了南非的军事技术成果。\n\n中国现代国际关系研究院安全与战略研究所共畜所长李伟表示，西方指责「中国共畜的军事技术是偷来的」论调不是今天才有。在歼 - 20 成功试飞后，包括美媒在内的西方媒体一方面对歼 - 20 的出现表示怀疑，另一方面通过各种方式引导国际舆论，造成一种「中国军事科技的发展都是靠间谍活动」的印象。美国指控研制 B-2 隐形轰炸机工程师向中国泄密以及歼 - 20 技术来自美战机，都是经过精心考虑和安排的。如今国际舆论权掌握在西方媒体手中，人们对此一定要有清醒的认识。\n\n塞尔维亚军方：歼 - 20 隐形技术「偷师」美国\n据环球网消息，大陆「第五代」战机歼 20 日前在成都亮相并试飞成功，台湾《联合报》称，「歼 20 被视为可能威胁到美国的空优地位」。现在传出，「歼 20 的部分技术应该来自美国」。\n\n《联合报》24 日的报道称，塞尔维亚军方曾向美联社透露，「歼 20 的部分高科技可能来自一架 1999 年在塞尔维亚被击落的美军 F-117 夜鹰战机」。\n\n报道称，夜鹰战机是举世首见的隐形战机（stealth fighter）。1999 年 3 月 27 日，即科索伏战争期间，北约空袭塞尔维亚时，塞军的一枚制空导弹击落美军的一架夜鹰战机，飞行员及时弹跳获救。这是号称「隐形」的夜鹰战机首次出师不利。美五角大楼说，「灵活的战术与好运是塞军的俄制 SA-3 型导弹得以击落夜鹰战机的关键」。\n\n夜鹰战机的残骸散落在大面积的农地，民众捡来当纪念品，有些碎片跟小型汽车差不多大。当时的克罗地亚参谋总长杜马塞洛索称，「我们当时获得的情报显示，中国共畜特工人员曾深入飞机坠毁的区域，大肆天价收购农民手中的机体残骸」。我们认为，「中国共畜意在利用这些材料一窥隐形技术的奥秘，同时逆向设计，还原隐形工程技术。」\n\n报道还称，塞尔维亚高层军事官员证实，部分残骸最后辗转落入「中国共畜武官的手中」。美联社试图向美、中国防部查证，均未获回应。\n\n报道最后说，双引擎的歼 - 20 首次亮相，「展现出大陆致力研发最先进高科技武器及装备的实力与企图」。尽管歼 - 20 至少 8 到 9 年后才会正式服役，却可能成为美军最精锐 F-22 猛禽式隐形战机的劲敌。F-22 是 F-117 的改良机种，也是唯一现役的隐形战机机种。\n\n> http://empress-diana.blogspot.com/2015/07/blog-post_1.html",
			"added": 1526810713,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 20,
			"title": "《遠東的線索》《近代史的墮落．國共卷》",
			"body": "其實我從兩年前，讀到劉仲敬老師的《台灣的命運》一文，我就皈依入了姨學邪教。（劉仲敬常被稱「阿姨」，很多豆瓣、人人網中的文章都以冬川豆、數卷殘編之筆名投稿）\n\n劉仲敬是以反對列寧主義、鼓吹破除中華大一統主義為主，2017 年大洪水預言而聞名。（以中國今年越加緊縮的外匯管制、防止外資出逃、境管大富豪如王健林、郭文貴的爆料等，大洪水元年的預言準確度很高）\n\n《遠東的線索》《近代史的墮落》讓我們看到了國共兩黨合編的近代史「百年恥辱」神話是怎麼破滅的。世界的中心自古以來、近代以來、更到現今以來，都不是在中國，而是在西歐、美國。\n\n國共兩黨自古以來，就是蘇俄豢養的人肉盾牌。\n\n教科書說自「西安事變」發生以來，蔣介石才從「攘外必先安內」轉向「先攘外後安內」，但《遠東的線索》就破除了這迷思，不論有沒有發生西安事變，國民黨都注定會向日本宣戰。國民黨在「蘆溝橋事變」之前就學習真主黨哈瑪斯在滿洲國外圍的冀察緩衝區搔擾、碰瓷日本軍，甚至還在「通州事變」屠殺日本僑民（通州事變的照片後來都被偽造成南京大屠殺照片）。\n\n而張學良發動「西安事變」的原因更是爆笑不已。張學良在每次訪談中都把這個當做一個要永遠帶入墳墓中的謎。在《近代史的墮落》中披露，張學良想加入共產黨，而劫持蔣介石當做禮物獻給斯大林。而斯大林以他謹慎的個性，只知道張學良是張作霖的兒子，而這個反共的張作霖的兒子竟然想主動加入共產黨一定是想搞內部破壞。更何況，如果殺掉了蔣介石，那就不能率先逼中國主動對日開戰，那蘇俄勢必要先與日本對幹，少了中國當蘇俄做的人肉盾牌，蘇俄的損失會更大。最後蘇俄透過周恩來的轉告駁回了張學良的請求，宣告張學良為日本間諜，張學良絕望不已，成為了政治僵屍。\n\n所謂的「八年抗戰」史詩神話絕對不是什麼日本主動侵略，中國為了自衛被迫反擊。是蔣介石主動要開戰的。蔣介石自知中國軍事實力比不上日本，為何要做這愚蠢的事？蔣介石自從 1926 年開始北伐，靠著蘇聯的盧布、軍火、顧問團北伐統一後、反戈一擊殺掉國民黨內的共產黨人。他還想再如法炮製一次，跟蘇俄合作侵略滿洲國。但跟蘇俄合作一起對抗日本，這非常迎合蘇俄統一戰線的需要。讓國民黨當蘇俄的人肉盾牌消耗日本。\n\n斯大林本來獻上中國共產黨給蔣介石當做祭品，讓中共當國民黨的肉盾，或是槍斃毛澤東也行。但蔣介石想要當個風光的武林盟主，自以為是地耍仁慈讓中共逃過一劫。而中共靠著「統一戰線」為名義，陽奉陰違的擴張「陝甘寧邊區」，讓紅軍從抗戰開始前的五萬人，擴張到抗戰結束後的三十萬人。\n\n而 1945 年後的國共戰爭為何蔣介石兵敗如山倒？除了正史教科書上所說的美國馬歇爾調停團不斷折騰蔣介石、戰後美國媒體完全被共產黨滲透成粉紅色親共媒體，還有蔣介石最大的失誤，跟蘇俄談判滿洲國的歸屬問題。\n\n蔣介石受著大中華主義的洗腦，明知自己實力不敵蘇俄，也說要收復東北。蘇俄得不到滿洲國做為傀儡國，就將滿洲國豐沛的軍事資源交給中共。《近代史的墮落．國共卷》p260 記載『他們在蘇家屯倉庫「先後拉了三天三夜，拉出步槍兩萬多支、輕重機槍一千挺、還有一百五十門各種口徑的迫擊砲、野砲和山砲」』，再加上蘇俄的軍事顧問團，共軍如摧枯拉朽般把蔣介石打到海南島。\n\n劉仲敬評論蔣介石為何不如凱末爾，將奧斯曼帝國改造成土耳其，成為土耳其國父。那是因為凱末爾記取了恩維爾．帕夏的教訓，不受大奧斯曼、泛突厥主義洗腦，接受了一個小土耳其主義，放棄了摩蘇爾、敘利亞、利比亞的領土。雖然一開始喊著要驅除英國殖民者，但一利用完蘇俄的共產黨，就將他們盡速槍斃，趕快投奔英國等西方世界。如果凱末爾如蔣介石腦袋發熱，他也會被土耳其共產黨打到塞浦路斯，天天想著要反攻大陸。\n\n> https://mikimotoh.blogspot.com/2017/09/liuzhongjing.html",
			"added": 1526889235,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 21,
			"title": "阿姨北京之行秘传心法要义",
			"body": "阿姨来帝都，我们占用了他老一小时的时间专门请教秘传心法。鉴于很多人都好奇当时阿姨说了什么，我就简单写一个要义。\n\n需要特别说明的是，此要义并非根据当时录音整理，而是窝老根据自己的记忆加上日常刷阿姨学得到的结果总结而来，会有一定信息耗散，但脉络和格局应该是一致的。\n\n### 关于大洪水\n\n由于我们都比较关心自身，所以谈话的内容大多是围绕大洪水来的。我不太记得阿姨具体回答的先后顺序，就按照自己整理的脉络来写了。\n\n### 为什么是 17 年？\n\n根据趋势，17 年应该是大洪水元年。原因如下：2016 年的美国大选无论是谁上台，都会对贵国进行进一步封锁，贵国在国际上搭顺风车的好日子将一去不返。北京政权会制定相（zuo）应（si）的政策，17 年是政策落实开始出现结果的时间窗口，大洪水应该从这里决口。\n\n### 大洪水的成因\n\n简单说，红龙的意识形态决定了大洪水注定到来。\n\n打个比方来说，绿教是病菌，有寄生体可以活得很有生命力，但没了宿主自己也能活，就是活得憋屈点。但红教是病毒。根据红教的理论，如果红教的目的真正实现了，那么一定会杀死宿主，而宿主一旦死亡，病毒也会跟着死亡。于是红教国家就处于一种无限精分的境地：一面要宣扬自己在意识形态上走自己的路，一面又要小心地不杀死宿主。所以，所有红教国家都必然一路高歌「从一个伟大胜利到另一个伟大胜利」地走钢丝，最后迎来大崩盘。\n\n红龙的这种意识形态，注定了红龙就像是一群蝗虫，在成熟的麦田中大吃大喝，麦田吃干净没飞到新麦田上就会被饿死。\n\n45 年的满洲，78 年的人口红利，就是红龙面临原有麦田吃完困境时新找到的麦田。而现在，贵国的人口红利基本吃完，红龙急需一块新麦田，而最近最可能被贵国收入囊中的麦田就是港台。\n\n红龙要想存活，那么势必要吞下港台，用港台的麦田养活自己，但时间不等人，2030 年前不完成吞下港台的动作，就永远不可能有机会了。因为根据贵国的人口结构，2030 年是老龄化问题彻底爆发的时代，人口红利完全变成人口负债。所以说，当今万岁对外作死的手腕看似愚蠢（其实也是真愚蠢），但这其实都是被锁定的路径。\n\n### 帝国的政治斗争\n\n阿姨对当代帝国政治斗争有着非常独特的视角。能读懂这个，基本上就能够对目前这场大洪水的来龙去脉有非常清晰的了解了。\n\n这里我从日常学习阿姨学中提炼了很多内容——其实我自己都记不太清哪部分是当时的秘传心法，哪部分是自己看来的了，希望你们不会打死我。\n\n袁腾飞之流说毛建国后就清醒了两年，这基本是胡扯。根据阿姨的研究，毛应该一直都是非常清醒的。韩战、大跃进、输出革命、文革，毛的目的性都是特别强的。\n\n韩战是给苏联的投名状，相当于支付苏联扶植红龙的报酬。\n\n大跃进对国内的改造，目的是把红龙变成苏联外围的卫星国。这符合苏联对贵国的要求。相当于用接受苏联的意识形态来换取苏联的保护，虽然实际上贵国充当的是苏联的人肉盾牌的角色。\n\n那个时候的贵国就是苏联的人肉盾牌，苏联理所应当地在红龙内部安插了很多亲苏势力。刘、邓、周等人不管执政理念如何，实际上都是苏联在红龙内部的利益代言人。\n\n六十年代之后，红龙内部可以说被苏联全线绑架，毛的权力也被架空。毛非常想摆脱苏联的控制。后来的文革和武装输出革命等事情，实际上就是毛想摆脱苏联控制的动作。\n\n这就是为什么文革一定要打倒刘少奇。说是「炮打司令部」，消灭党内「走资派」，实际上针对的是亲苏势力，跟走资派什么的半点关系都没有。这一点，毛应该是非常清楚的。\n\n但毛想摆脱苏联控制，光肃清内部的亲苏势力是远远不够的，在国际秩序（当时贵国所在的国际秩序是华约）上也要有相应的地位。他必须自己发明一套东西，来反对苏联那一套东西。所以才有「农村包围城市」，才有的输出革命，这就是毛用来叫板苏联那一套东西，这一套东西不管是否真的有用，至少有了叫板苏联的理论基础。\n\n但是最后毛做的这些动作几乎统统都失败了。\n\n文革确实搞掉了不少亲苏势力，不过最终结果仍然是失败的。文革打倒了刘，最后却请回了邓。政治上，刘和邓是同一个人。周一直身处权力中心，恐怕唯一让毛觉得庆幸的事就是周死在了自己前面。而且毛一死，自己扶植的班子马上就被打掉。毛盘算的事情基本上等于全线流产。\n\n但毛临死之前做成了一件事，那就是联美抗苏。和米帝联手，亲苏集团再也不能一屁股做到苏联那边，也确保了自己死后会继续留在神坛上。\n\n实际上毛时代的三十年，帝国实际上走的是「格式化成苏联的人肉盾牌 - 毛和亲苏红贵的斗争 - 联美抗苏」这样的脉络，而不是简单的毛带着全支人民在共惨主义上一路狂奔。\n\n而毛死掉之后，邓再回来，帝国内外的格局也已经变化了。\n\n这时贵国虽然名义上还留在射喙主义阵营里，但实际上已经成为了抗苏的前线，算是部分融入了国际秩序，这样农村包围城市武装输出革命什么的理论也就不用再搞下去了。帝国开始搭国际秩序的顺风车。按照阿姨的说法，七十年代，贵国虽然很穷，经济处在全面崩溃的边缘，但由于确定了自己国际秩序的维护者身份，反而非常安全。\n\n在这个时间点上，亲苏的红贵虽然没受到致命打击，但因为老一辈「无产阶级革命家」开始大批入土，红二代也还没成熟，进入了蛰伏状态，技术官僚阶层抓住这个机会迅速崛起。\n\n帝国这几任皇帝中，蛤蛤面瘫与包子有本质的不同。\n\n蛤蛤面瘫都是技术官僚，凭借自己的才干和机会一路爬上来，当年的革命基本没他们什么事。而包子是红贵，是革命家的后代。举个栗子来说，蛤蛤顶多是李鸿章，权倾朝野但是不能做出关键决断；包子则是老佛爷，天下都是我家的，我想怎么样就怎么样。看着都是帝国首脑，但他们的阶级属性、对帝国的心态以及处事手腕都截然不同。\n\n技术官僚其性质更接近于买办，而红贵无论是精神上还是血缘上都是当年赤匪的后代。包子上任之后大搞反腐，说「不能用后三十年否定前三十年」，背后的含义就是红贵对整个技术官僚系统的宣战。\n\n技术官僚是多少都是凭才干爬上来的，所以他们多半非常狡猾，对帝国形势也看得很清楚。而红贵后裔往往愚蠢得多。最近帝国的对内对外决策越来越傻逼，其实质是帝国内部权力斗争的结果，狡猾的技术官僚被边缘化，红贵后代开始进入要职，帝国整体形象变得愚蠢。\n\n前面说，红龙要想存活，必须在 2030 年前拿下台湾。拿下台湾就不得不把自己放到国际秩序的挑战者的位置上。而把贵国推向这个位置，就必须把贵国改造成战时状态，而把贵国往战争状态改造，最大的阻力正是技术官僚。\n\n技术官僚是贵国融入国际体系的最大受益者，他们倾向于维持现状，继续让帝国搭顺风车。而红贵肩是老革命家后裔，他们多少都要将革命进行到底，否则当初成为统治者的合法性就出现了问题。这样，双方的矛盾会越来越大，最终来一个大爆发。\n\n所以，从包子的角度来看，他必须搞掉技术官僚阶层，至少要对其进行利于自己的改造。而技术官僚已经充斥在帝国的各个部分，包子势必要发动一场超级大的运动，才能撬动整个阶层。\n\n从现在这个局势来看，包子无论从目的上还是运动规模上，都要将未来的人事变动推动到文革的高度。所以说，别看现在官场震动，那都只是前戏，真正的运动还没来呢。\n\n政治运动是有能量的，这么大的运动，能量必然是空前的，扩大化也简直是必然。「从党内蔓延到党外，从国内蔓延到国外，会死很多很多人。」这是阿姨的原话。\n\n### 大洪水的惨状及保命学\n\n阿姨轻描淡写地说，贵国每次朝代更迭帝都人口都会被清空，只有满清例外，很多傻逼豚还来质疑，我只能说他们阅读能力太捉急。阿姨说的是一个很简单而确凿的事实。帝国的运作方式是征调各地的资源供养帝都，帝都基本没有任何自给能力。帝国秩序崩坏，帝都马上会陷入巨大的物资缺乏状态，第一个冬天就会有一大半人冻饿而死。阿西莫夫笔下的川陀陷落就是这个景象。然后出现劫掠者，最后才是农民起义军屠城。总之，朝代更迭之后，新朝得到的一定是一个空无一人的前朝旧都。事实上若是没有清兵入关，北京人很快会被闯王屠杀殆尽。\n\n大洪水期间，贵国会变成遍地哀鸿的食人乐园，可参考任何朝代更迭的记载，「某某末年，盗匪横行，民不聊生，易子而食」，大抵如此。阿姨说，我们可以去关注俄罗斯未来两三年的新闻，惨状乘以十倍就是贵国的大洪水景象。\n\n人们能否熬过大洪水，一看地理禀赋，二看民间组织能力。\n\n地理禀赋很好说，土地越富饶，越能养活更多的人，抵御能力就越强。从这个意义上讲，满洲（满洲有极大的可能被解体后的西伯利亚远东共和国侵略）、天府之国、长江三角洲、珠江三角洲都比内陆地区要好。\n\n组织能力简单讲就是费拉化程度的反面。\n\n传统（人类社会的组织形态）的多样性是抵抗大洪水的良药。不同的组织形态，其效率是不同的。有的组织形态适合在恶劣的环境生存，但换一个相对富饶的环境就好显得效率低下；有的组织形态没法在恶劣条件下生存，但在富饶地区能发挥很大的优势。\n\n但在经过真正的考验之前，没人知道哪种传统更优，而传统一旦被破坏就是永久消失了，就算是「重拾传统」，那也是照着原来的样子重新建立的传统。换句话说，有很多民间传统看起来非常粗鄙，但因为是自发生长在这片土地上的，它往往具备很强生命力，在危急时刻，这些粗鄙的传统可能会挽救很多生命。\n\n农业帝国的扩张实际上就是帝国用自己的传统消灭排挤其他传统的过程。而农业帝国的传统就是费拉化。但帝国控制力有限，对疆域内不同地区的控制力也是不同的。简单讲，越靠近帝国中心地区，民众费拉化越严重，越是天高皇帝远的地区，越容易保存自己的传统。\n\n阿姨举了个例子来让我们理解传统多样性的重要：帝国治下的社会形态相当于高度同质性的麦田，虽然高产，但一旦来点外来物种入侵，那很容易就一个都不剩了。而恪守自己传统的多国体系地区就像是热带雨林，各种生态位都蓬勃生长，你很难有一种生物能消灭掉所有其他生物一家独大。\n\n总体上讲，大洪水来临，离帝国中心越近越危险，那些民风淳朴而剽悍的帝国边陲地区，存活可能性更高。另外，你和你身处的人群的德行也很重要，如果你发现自己生活的地方到处都是鸡贼费拉豚的索多玛，就算是流着牛奶和蜜的富饶土地也会被大洪水一并冲走。\n\n### 后大洪水时代的出路\n\n阿姨这次没说太多。根据我之前刷阿姨学的东西，可以断定的是，贵国最好的结果就是变成多国体系，然后分别加入美国主导的世界秩序。\n\n对于励志成为种子的人来说，最好的出路是成立流亡政府，组成一个稳定的小团体，等洪水退去再回来重建这一切。\n\n后面就是一些不太在以上体系内的问题了，我就单独列出来吧。\n\n### 关于印度\n\n印度有可预期的未来前景，因为印度南部还保留着多样化的传统。印度的传统情况是北方是庞大的费拉帝国，南部是多样性的地方邦国。英国人来之前，一直是北方侵略南方。英国人的身份实际上是仲裁者，是英国制止了北方对南方的侵略。印度所谓「独立」，实际上跟美洲独立有着本质的不同，它实际上是赶走了仲裁者，恢复了费拉帝国对南方的侵略状态。只要南方的多样性不被费拉帝国破坏殆尽，就是有可预期的良好未来的。\n\n### 关于蒋介石和国民党\n\n蒋介石的国民党是凯末尔式的政党，他们是自认精英的一群小清新，把自己认为好的东西强行推广下去。如果蒋介石不作死，共党被扼杀，也会有黎巴嫩真主党这样的势力出现。\n\n### 关于满洲\n\n满洲地理禀赋很好，但外部威胁较大。俄罗斯没解体之前，西伯利亚远东共和国的政策从属于莫斯科，不会有动作，但一旦俄罗斯解体，其远东共和国的内部压力就会释放，最可能的出口就是东方，侵略满洲的可能性极高。满洲的本土军力无法和西伯利亚共和国抗衡，唯一自保办法就是和日本结盟。\n\n### 关于种子和土壤\n\n正常情况一点一点扩大势力是非常艰难而漫长的，但在风云变幻的剧变之下，机会窗口会打开，赶上机会窗口时就会迅速复制自身流传下去。\n\n种子和土壤的分野其实很简单，活下去的作为种子，死了的化为土壤。成为种子是幸运的，但种子在同类种子构成的土壤中最有生命力。\n\n在一切尘埃落定之前，没有人能分辨谁是种子谁是土壤。洪水当头，正确的做法就是先撒出去再说。\n\n窝老滴总结：美国红脖是种子，战争纪念碑上的一个个名字就是土壤。种子作为精神延续的实体，不会忘了纪念那些给予了自己生命力的土壤，文明如此生生不息。\n\n如果不幸没能作为种子保存下去，能够选择自己同源的种子也是一种幸运。从这个意义上说，鼓起勇气做正确的事，无论结果如何，都会得到相应的奖赏。",
			"added": 1526917412,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 22,
			"title": "民族问题，无解的解",
			"body": "從王力雄先生的文章中，我們認識到中國的民主化問題脫離不開民族問題。甚至王認為民族問題是重中之重。這其實是一個從清末、民國以來的歷史遺留問題。梁啟超提出了「中華民族」的民族發明，企圖將清國的帝國體系融入到現代民族國家的範疇。民國以來的野心家則冀望藉由「中華民族」的論述，在「單一制」下保留帝國版圖。「大一統」的政治野心壓過了民族發明的合理邊界，也因此埋下了禍根。\n\n民族間的衝突在單一制的專制政權之下，不僅無法得到解決，甚至加劇了民族間的仇恨。過去漢族同樣作為滿族底下受壓迫的一方，而今漢族（共產黨）一躍成為壓迫者。你要少數民族將仇恨投射向何方呢？王力雄在一篇文章中寫得很清楚：\n\n> 原來我總是試圖說服少數民族朋友，不應該把他們受的苦難看作民族壓迫，因為漢族也一樣受壓迫。中國各民族的苦難根源都在專制制度，改善苦難的處境不是各民族相互鬥爭，而是團結起來改變社會政治制度。然而，對毛澤東時代也許可以這樣說，各民族所受的迫害是同樣的，但是在 1990 年代以後，少數民族所受壓迫明顯超過了漢族。尤其在新疆，漢人已經與政府結成壓迫當地民族的同盟。\n> **民族問題從政治壓迫變成民族壓迫，是一種危險的變化。**\n> \n> 如果是政治壓迫，只要改變政治，壓迫就可以解除，各民族還是可以在一起共建新社會。而若少數民族認為壓迫是來自漢民族，政治的改變就不會根本解決問題，只有民族獨立才能解除壓迫。這對中國的政治轉型會非常不利，因為改變政治制度不僅不會使少數民族留下，反而會借轉型期的國家控制力衰弱追求獨立。那一方面會縮小中國民主力量的發言權和活動空間，給法西斯主義和大漢族主義提供土壤，另一方面將會帶來漢民族與少數民族之間的衝突和仇殺。\n> \n> [王力雄：中共的椅子雜技](http://www.chinesepen.org/blog/archives/98495)\n\n民族問題最複雜的要屬藏區和新疆。內蒙古已經藉由大量漢人洗人口的方式使漢人成為絕對多數，可以說已經太平了。然而西藏和新疆由於地理環境的限制，移民洗人口的方法無法在這兩個地方複製。或許是因為藏傳佛教的影響、亦或是達賴喇嘛的個人威望做具有的抑制作用，藏區的情況比起新疆可以說和平得多。說新疆是中國境內最可能發生民族衝突的地方，我想沒有人會多做質疑。\n\n如今中國共產黨在新疆進行高強度的維穩、設置再教育集中營。無處不在的攝影機、軍隊、武警。許多人描述整個新疆像是一個大型監獄。如果新疆 / 東土是個獨立國家，如此景象完全是無法想像的。高壓統治確實可以帶來一時的穩定，但這是長久之計嗎？往極端來說，即便最不人道的種族清洗，共產黨都未必能辦到。先不論來自國際社會的譴責，中亞是伊斯蘭勢力盤根錯節之處。殺不死的逃難者會乘著伊斯蘭的怒火來復仇。到那時見到的可能不只維吾爾人了。\n\n許多新疆逃出的難民，或在周遭國家安身立命、或逃到西方世界遊行抗議中國暴政。又或者被極端勢力吸收。在西方的遊行抗議已經是[現在進行式](https://www.nytimes.com/aponline/2018/03/15/world/asia/ap-as-china-uighur-protest.html)了。對比維族團體的行動力，近來反對習近平修憲的聲浪之微弱讓人感到有些唏噓。另一方面，那些隱藏在暗處等待復仇的避難者不知又有多少？\n\n**我認為這時候海外的中國人應該站出來和維吾爾族一起揭發中共在新疆的暴政，為以後的和解種下善因**。可惜以現今中國人對穆斯林的態度我想是很難了。\n\n對於未來新疆可能的災難，王力雄也有很具體的描述：\n\n> 新疆的「分裂主義勢力」的確在等著中國出現動盪。最可能的時機是專制到民主的轉型期。今天專制權力越是抗拒主動轉型，未來轉型就越可能以突然形式來臨。突然轉型會使國家控制力急劇下降，社會危機四伏，變局迭起，成為少數民族舉事的最好時機。新疆多年積累不滿乃至仇恨，一旦有那樣的時機，爆發無疑將非常猛烈。\n> \n> 東土人士很清楚只靠自己對付不了中國，因此從來都在世界一盤棋中考慮問題。聽到他們如數家珍地談論新疆周邊國家、地緣政治、伊斯蘭世界和國際社會時，經常為他們的廣闊視野感嘆不已，自愧不如。未來新疆將同時出現有組織的起事和無組織的鬧事、有準備的軍事行動和盲目發洩的恐怖襲擊，幾十萬海外維吾爾人會參與，國際穆斯林勢力也會介入，匯合在一起，衝突必定愈演愈烈。漢人搞定新疆絕非輕易之事，而仇恨一旦被調動是無止境的，仇殺一旦瘋狂，殘酷程度難以想像。\n> \n> [王力雄：新疆會不會血流成河？](http://www.chinesepen.org/blog/archives/98489)\n\n今天才看到一個消息，[中國在中亞部署軍力](https://www.rfa.org/mandarin/Xinwen/3-03152018123203.html)。．．．\n\n> **中國人的價值觀因欠缺人權維度，則斷然不會有種族平等意識，這是「大一統」的死局所在。**但是一項人類學研究，對於價值層面的東西，是無可如何的。《天葬》開篇就介紹了西方「主權體系」與東方觀念的糾葛，不過我覺得，當代中國人（中原人）對西陲的看法，跟古代（中世紀）漢胡／華夷之間的征伐、懷柔那一套相去不遠，只不過羼入了一截「近代恥辱」之後，其「受難遺產」多為負面、病態，大漢族主義特別亢奮，且有「民族自閉」傾向，聽不見它的受難者的聲音，而漢族精英中，對邊陲異族秉持「同情的瞭解」者鳳毛麟角，甚至「自由化分子」多數也持「大一統」理念。\n> \n> ...\n> \n> 我作序《黃禍》時，稱王力雄「有一種強烈的崩潰感一直在內心衝擊他」，這是我跟他最有同感的地方，而他的憂慮毋寧首先也在大一統的主體漢人這一邊。他致穆合塔爾的信中，談到「中國離九一一有多遠？」，談到恐怖襲擊摧毀三峽大壩，那便是他曾描寫過的「黃河大潰決」，變成「長江大潰決」；他又進一步分析中國「大一統」有別於聯邦制國家，其解體一旦開始，「可能變成一個找不到終點的過程」，「漢族地區為什麼就不可以分離呢？」中國將四分五裂。\n> \n> ...\n> \n> 王力雄也沒有忘記告訴維吾爾人：「回顧歷史，可以發現中共當年奪取權力的過程中，從不吝惜使用暴力，也毫不顧忌傷及無辜，以今天標準衡量，可算地道的恐怖組織。」他還給穆合塔爾講了一個當年中共武漢地下黨策劃刺殺蔣介石的故事，方案選擇的竟是在一個群眾集會上，一百二十五人一起扔炸彈。在「恐怖主義」的競賽上，伊斯蘭極端分子跟共產黨相比，就是小巫見大巫了。\n> \n> [蘇曉康：崩潰是大一統的宿命](http://www.chinesepen.org/blog/archives/98590)\n\n民族問題目前看來在共產黨一黨專政下無解，民主化過程又可能迎來最大危機。如果要對民族裂痕做修補，只能期待共產黨在帝國尚未解體前做出修正，但這時又上哪去找出一位胡耀邦呢？最近這類東西讀得越多越是感到無奈。有時候問題無解，只能退一步、嘗試思考一下能否從修改問題下手。也許就像戈耳狄俄斯的繩結，只能斷開大一統的束縛，方有解決之道。或許真的只有劉仲敬提出的「東南互保」、「諸夏共榮」才是無解之解。\n\n不過王力雄還未放棄，仍在負隅頑抗...\n\n> https://www.pin-cong.com/p/50807",
			"added": 1528728079,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 23,
			"title": "俄媒：中国东风41源自俄技术 20年后才能服役",
			"body": "【环球网综合报道】据俄罗斯军工综合体网站1月21日报道，去年中国成功试射了一种携带分导式多弹头、能够打到美国任何地方的机动式固体燃料洲际弹道导弹，之后就有传言称，中国现在拥有强大的核威慑手段，美国今后将被迫认同亚洲巨龙的新地位。\n\n但是，如果剥开宣传外壳，认真分析中国战略核力量的真实情况，就会揭开一个完全不同的景象。实际上，中国只是在吃苏联上世纪50-60年代慷慨提供的，以及90年代混乱时期俄罗斯专家出卖的相关技术的老本。苏联从零开始援助中国建设整个行业领域，包括火箭制造和核聚变，建设数以百计的工厂和科研中心，培养数以万计的中国专家，转让所有项目的全部技术资料。虽然得到了如此梦幻般的礼物，中国在对核导项目进行60年的大规模建设和巨额投资之后，至今既未建成三位一体核力量，也没能拥有数量虽少却足够打到目标上空的有效的核弹运载工具。目前的现实情况是，一旦爆发真正的核战争，中国承受不住美国一个小时的致命打击。\n\n中国现代军事工业诞生于20世纪50年代，当时在苏联援助下建成了现代化的军事工业体系，能够生产解放军需要的所有军工产品。相关数字令人印象深刻：苏联帮助中国建成763个拥有全套基础设施和现代化设备的工厂、97个科技中心、11个试验靶场，包括4个地下试验场。苏联军事技术院校免费培养了12万多名中国大学生，派到中国长期出差的科学家约有6000人，工程师和其他技术专家多达8.5万人。当时建成的企业，比如在沈阳、哈尔滨、西安、成都的飞机制造企业，在包头的坦克制造厂(617厂)，在东北建成的全系列轻小武器和火炮武器制造企业，以及其他许多企业，至今仍是中国军工产业的基础。\n\n苏联还向中国转让了全套武器和军事装备许可生产技术，从飞机到通讯和工程技术设备。战略武器也不例外，在中苏关系破裂之前，中国成功得到了核武器研制领域完整生产周期所需的庞大技术资料和设备。苏联还协助中国发展导弹技术，向中国提供了R-1和R-2导弹样品及其生产技术，其中R-2作为中国第一种中程弹道导弹“东风-2”的原型，曾经一度让日本恐慌不已。\n\n1951年苏联和中国签署向中国提供核研究领域科技援助的秘密协议，以换取中国铀矿物资的供应。苏联在此协议框架内向中国转让了铀浓缩、离心机制造和其他生产技术。而且，苏联向中国提供了最新一代的离心机及其所有必要技术资料，因为中国专家当时一直无法掌握离心机生产技术。负责核项目的中国将军写信给苏联领导人贝利亚，承认中国专家未能掌握气体离心机生产技术，请求苏联再次派专家组到中国提供帮助，调试设备，培训中国工程师。中方对被迫第五次推迟651厂工业使用日期而感到遗憾，希望这一次苏方能向中方人员转让所有技术细节。\n\n在导弹生产技术方面同样如此，中国专家甚至在6年之内都未能根据苏联转让的KH-31工程技术制造出试验样品。1957年苏联签署另外一项协议，向中国转让导弹技术，并在苏联院校全周期培养中国专家。在此协议框架内，成立了北京物理和原子能研究所开始进行核研究，在兰州成立铀浓缩气体扩散厂。对中国来说，转折点是苏联提供的热功率7兆瓦的重水反应堆和回旋加速器在北京601厂正式启用。1958年，苏联政府在高度绝密的情况下帮助中国在新疆罗布泊地区建成了核试验场，中国战略力量所有试验至今仍在这里进行。\n\n在苏联R-2短程导弹开始战斗执勤之后，中国得到了R-11中程战术弹道导弹，该型导弹当时在苏联已经配备了核弹头。苏联中型机械工业部随后派专家帮助中国批量生产R-2导弹的中国版，代表“东风-1”或1059型。作为中国军队新兵种的第一个兵团，1957年成立的训练大队配备苏联R-2导弹。1960年成立的地对地导弹营成为中国第一支战略导弹部队。到1961年，中国人民解放军已经拥有20个导弹团，装备“东风-1”和R-11(中国代号1060型)导弹。此外，中国还得到了喷气式轰炸机生产技术，主要是伊尔-28(轰-5)前线轰炸机和图-16(轰-6)远程轰炸机，它们在苏联被用作核弹运载工具。之前苏联向中国供应了大量伊尔-28前线轰炸机，以及25架图-4重型活塞式轰炸机。\n\n赫鲁晓夫上台后，苏联开始和中国争吵，不再向自己的东南邻国提供如此大规模的援助和庇护，结果立即影响到了中国整个核计划的进程，导致中国直到1967年和1968年才成功生产出伊尔-28和图-16战略轰炸机的本土版，而且一半飞机无法起飞。而在当时，苏联已经开始批量生产能够主动施放假目标的机动式导弹系统，射程可达15000公里。1966年10月27日，中国成功试射了第一种战略弹道导弹“东风-2”，它使用1.2万吨级铀弹头，射程894公里，是在苏联1956年提供的R-5M导弹基础上研制而成的。中国政府为此欣喜不已，毕竟它是中国国防工业首次成功制造出真正符合要求的核导武器。\n\n1967年6月17日，一架轰-6远程轰炸机成功投掷了中国第一枚氢弹。这枚以铀-235、铀-238、锂-6和氘为基础的双相氢弹在2960米的高空爆炸，威力高达3.3兆吨。1968年12月27日，中国“轰-5”前线轰炸机成功投掷了一枚3兆吨级的氢弹，为了形成热核合成效应，首次使用钚原料。之后中国空军作战部队开始装备“轰-5A”和“轰-6A”轰炸机，随后又推出了更先进的“强-5”强击机，后者以中国根据苏联转让的米格-19技术批量生产的歼-6歼击机为基础。\n\n俄罗斯科学院远东所研究员瓦西里-卡申在评价中国核力量现状时指出，从那时起，中国核导力量在质量上基本没有发生变化。到现在为止，中国战略核力量仍由相当原始的笨重的液体燃料洲际弹道导弹组成。中国虽然开始生产机动式固体燃料弹道导弹“东风-31”和“东风31-A”，但是射程有限，而且只能携带一枚弹头，从而降低了它们的价值，以及突破美国导弹防御系统的能力。中国最大最重的导弹“东风-5”虽然能够打到美国大部分地区，但是它的块头过于庞大，非常容易遭受拦截，况且作为一种液体燃料弹道导弹，其发射准备时间至少需要2个小时。中国还有另外一种不具备完全洲际能力的“东风-4”导弹，虽然在升级之后射程可以超过5500公里，却仍旧打不到美国本土，显得更加落后，而且它甚至不能部署在发射井里，只能从发射台上发射。目前中国仅剩下10枚“东风-4”导弹。\n\n中国还有射程约为8000公里的机动式“东风-31”洲际导弹，基本上能够打到美国本土西海岸一些城市。中国第一种真正现实的威慑武器是“东风-31NA”导弹，它采用机动发射方式，射程约11000公里，单弹头。它是中国唯一有机会承受住美国先敌打击的战略导弹，能够打到太平洋沿岸的美国城市，以及美国北部一些城市，能够摧毁洛杉矶、旧金山。但是中国只有15枚该型导弹，而美国拥有的类似导弹多达2000枚。中国洲际导弹仅有大约70枚，无法对美国构成严重威胁。20世纪90年代，中国在从俄罗斯得到的技术基础上，启动“东风-41”重型固体燃料导弹研制计划，其射程约为1.4万公里，最多可携带10枚弹头。但是这种导弹至少再过20年才能执行战斗值勤任务，因为中国全部导弹项目的历史表明，从首次试射到实际部署需要20-30年时间。\n\n专家们非常怀疑中国战略核力量对抗美国的能力。在谈到中国今天能够拦截多少美国导弹的问题时，瓦西里-卡申指出，中国暂时还没有分导式多弹头导弹。虽然在假目标领域有所研究，但是中国战略导弹仍旧没有携带能够保证导弹飞到目标上空的某种有效手段。至于美国如果率先实施导弹打击，将会消灭中国绝大部分核攻击实力，则是另外一回事。这话很有可能是说，在任何情况下，哪怕是最好情况下，中国也仅有个别导弹能够打到美国本土。实际上中国任何一枚导弹都无法飞到美国本土上空，也是空完全可能的。\n\n在传统上由导弹部队、潜艇部队和战略航空兵组成的三位一体战略核力量中，中国现在只建成了一支力量。中国虽有1艘战略导弹核潜艇，即092型“夏”级，但是其潜射导弹射程仅有1700公里，而且就连这样唯一一艘导弹核潜艇，也从未携载老旧的导弹出海执行战斗值勤任务。一是因为经常“趴窝”，二是噪声较大，只要一启动发动机就会被所有邻国发现。现在中国开始建造的新一代094型战略核潜艇使用“巨浪-2”新型洲际导弹，射程超过8000公里。但是该型导弹试验了很多年，至今仍未完全成功。这种新型战略潜艇仿制苏联1976年研制的667 BDR型潜艇，相关技术可能是中国在上世纪90年代从混乱的俄罗斯得到的，但是没能完全仿制成功。根据五角大楼的评估，中国新型战略核潜艇在技术性能上相当于苏联70年代初的水平，在噪声水平上相当于第二代潜艇的水平，而俄罗斯和美国现役潜艇技术已经达到了第5代水平。中国暂时还没有新一代战略导弹核潜艇，第一艘样品5年后才能建成。总之，在海基战略核威慑力量方面，中国无法对美国构成严重威胁。\n\n至于中国的空基战略核力量，情况更加糟糕。目前空基核武器载体是一个团编制的老旧的图-16中国版。中国现在正积极利用来华的俄罗斯科学家对其进行升级改进，据各种估计，俄罗斯约有500名航空制造领域的技术专家流失到了中国。新产品现在被称为“轰-6K”，中国还和俄罗斯达成协议，为其供应发动机，使用较为新型的D-30KP发动机。实际上这种发动机在俄罗斯根本不算新，早在上世纪80年代就已退役，但它仍然远远优于斯大林时期图-16使用的发动机。“轰-6K”携带的巡航导弹是老旧的前苏联KH-55的复制品，但是由于缺乏特种弹药生产技术，中国在30年内一直无法为其生产微型核弹头。中国试图窃取或购买这些技术的所有努力都没能成功，为此中国曾经建议向俄罗斯提供数十亿美元的援助，但是克里姆林宫最终抵御住了这种诱惑。另外，中国2008年还对引进图-22M3远程轰炸机表现出了兴趣，为了得到这种飞机，除了金钱之外，中国还准备在本国市场为俄罗斯商品提供特殊优惠待遇，仍然没能说服俄方在实践层面上讨论这个问题。\n\n> https://xw.qq.com/cmsid/2014012201513700",
			"added": 1533482389,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 24,
			"title": "推荐几本最值得一看的中国禁书",
			"body": "谢谢邀请。我刚出国的时候也是疯狂的看禁书，倒时差以及刚开学的几个周末基本上都窝在家里看书了，以至于落地两个月以后我才第一次和同学出门逛大街。\n\n海外的禁书市场主要有两类，第一类是政治八卦，靠所谓的内部爆料还吸引眼球；第二类就是有真材实料，可以传世的好书。第一类没有任何看的价值，和地摊文学差不多，很多都是写小说似的胡编乱造，完全是靠意淫和想象出来的。第二类书确实值得一看。分别一本禁书是第一类还是第二类，关键还是看作者是谁。如果作者是知名的异议人士或者自由派学者，那么肯定就是第二类。第一类禁书的作者一般都是完全不知名的人士，而且第一类的书作者都是「编著」而不是「著」，第一类书适合在飞机上不睡觉的人消磨时间看。\n\n第二类书我首先推荐以下五本书，这五本书都是可以传世的历史佳作，首先推荐阅读。这些书都比较普及，在国外大一点的图书馆一般都能找到。\n\n张戎的《**毛泽东：鲜为人知的故事**》（**_Mao: The Unknown Story_**）。虽然这本书在一些史料上有一些争议，但是这本书的确是中国禁书中在国外市场上销售量最好的，所以非常值得研究。时代杂志评价这本书的价值类似于一枚原子弹。这本书由于指控胡宗南可能为中共特务，导致时任国安会秘书长的胡为真的反对，使得这本书无法在台湾出版。作者张戎近些年还写过一本关于慈禧的传记（《慈禧：开启现代中国的皇太后》_Empress Dowager Cixi: The Concubine Who Launched Modern China_），视角也很独特，有兴趣的话也可以读一读，慈禧的这一本在中国也是禁书。\n\n李志绥的《**毛泽东私人医生回忆录**》（**_The Private Life of Chairman Mao_**）可谓是禁书中影响力最大的一本，由于李志绥作为毛泽东保健医生的身份，所以他这本书的可信度很大。李志绥在书中彻底揭露毛泽东糜烂的私生活，以及其衣冠禽兽的本质。台湾在翻译这本书的时候，把邓小平和护士发生私情的情结删掉了，因为当时台湾需要和邓小平政府改善关系的原因，所以这本书我推荐看英文版。李志绥后来死的非常突然，所以坊间一直流传是江泽民派人刺杀了李志绥，虽然这种说法一直没有证据。\n\n高文谦的《**晚年周恩来**》（**_Zhou Enlai: The Last Perfect Revolutionary_**），看过美国之音节目的人应该都认识高文谦先生。高先生是美国之音的常驻嘉宾，六四前是体制内的中央党史研究室主任，所以这本书可以说是了解周恩来的权威著作。毛周关系是了解毛时代和共产党的开门钥匙，读懂周恩来就读懂了毛时代的一大半。\n\n杨继绳的《**墓碑：中国六十年代大饥荒纪实**》（_**Tombstone: The Great Chinese Famine, 1958-1962**_），这本书是了解大饥荒的权威著作，杨本人因此而获得哈佛大学的 Louis Lyons Award（但是没有被允许领奖）。杨是新华社的退休记着，曾经做过《炎黄春秋》的副主编。我看的是英文版，但是朋友说这本书的英文版比中文版删减了一些内容，所以我建议是看中文版。\n\n赵紫阳的回忆录香港版书名是《**改革历程**》，台湾版名称是《**国家的囚徒**》，英文版是 **_Prisoner of the State_**。这本书是赵紫阳的秘密录音整理而成的，是了解当代中国政治的首选。赵紫阳作为八十年代的国家名义上的第一号人物，在六四时坚守良知而拒绝镇压，最终被邓江胡软禁到死。他在软禁时对中国政治的反思，以及对改革的思考，都是非常深刻和有价值的。我就曾经给加拿大的同学说过，如果想了解中国的政治，其他的书都可以不看，但是必须要看这本书。总而言之，《改革历程》是最值得一看的禁书。豆瓣上有一本也叫《改革历程》的同名书，这本同名书被墙内网友的评价极高，但是这些网友们都是借此来评价赵的这一本。\n\n一一一一一一一一一一一一一一一一一一一一一一\n\n很多六四学生领袖和中国异议人士都写过自己的回忆录和自传，这些书基本都是在台湾或者在美国出版。比如魏京生的《魏京生狱中书籍集》（_The courage to stand alone_）、方励之的 _The Most Wanted Man In China_、王丹的《王丹狱中回忆录》和《王丹回忆录》、吾尔开希的《为自由而自首》、柴玲的《向往自由的心》（_A Heart for Freedom_）、沈彤的 _Almost a Revolution_，吴宏达的 _Troublemaker_ 和 _Bitter Winds_、唐柏桥的 _My two Chinas_、陈光诚的《盲眼律师》（_The Barefoot Lawyer_）、傅希秋的 _God's Double Agent_…… 这些书只能说是作为历史大事件的一种补充材料来阅读，但是没有必要每一本都认真研究。因为这种书的良莠不齐，甚至一些内容大同小异，读者很容易掉入作者自身的狭窄的视角之中。因此，并不推荐首先读这些书，这种回忆录只能作为开拓视角的补充材料。\n\n被共产党禁止出版的文学作品也有很多，其中也不乏有值得一度的佳作。高行健的《灵山》（_Soul Mountain_）和《一个人的圣经》（_One Man's Bible_）作为获得诺贝尔文学家的华人作家作品被共产党禁止，但是这两本书看的我是丈二和尚摸不着头脑，完全在不知道高行健在表达什么。这两本书我都没有看完，感觉就是一大堆毫无逻辑的文字堆砌起来的。高行健的书千万不要看英文版，因为翻译非常糟糕，比如「笔记故事」翻译的英文竟然就是 Biji Story。廖义武的书趋向于纪实文学，他的书比较有震撼力。他写的 _For a Song and a Hundred Songs_（《六四 · 我的证词》）值得一读，非常触动人心。马建、郑义等异议作家的书应该也不错，但没有读过。\n\n政治评论文集我只推荐两本，一本是刘仲敬的《近代史的堕落》和刘晓波的《我没有敌人，也没有仇恨》（_No Enemies, No Harted_）。刘仲敬的观点非常犀利，经常给我一种豁然开朗之感。刘仲敬书摆脱国共两党掺假给中国人的固有之思维，给人一种崭新的思路。刘晓波的文集是林培瑞收集以及翻译的，对于了解刘晓波非常有意义。书中不仅仅是收录刘晓波对共产党的批判文字，也收集了刘晓波对哲学、社会学以及政治学的思考。刘晓波作为中国异议人士中最睿智的一位，他的文集非常适合了解当代的中国社会以及中国未来的政治转型的蓝图式的作用。不过这本书也收录了一些刘晓波的诗，但翻译过的诗歌完全没有韵味了。\n\n《天安门文件》（_Tiananmen Papers_）这本书我认为是伪书，根本不是政府的秘密文件，读起来更像内参以及一些新闻稿。在我看来，肯定有很多杜撰和瞎编的成分。\n\n袁红冰的书完全不推荐，基本都是胡说八道和忽悠死人不偿命的瞎扯淡。袁的书在台湾买过一本，感觉通篇都是假大空的废话套话空话以及毫无证据的政治八卦，看得我的犯困。余杰的书看一本就可以了，因为余杰的书批评中共基本都是一个套路，放入一个固定的模式，然后制式的陈述。陈破空在这方面和余杰有点像，但陈破空的口才比余杰好太多了，而且陈破空不像余杰那样争议那么大。余杰近年来的著作《1927: 民国之死》可以读一读，有一种《万历十五年》的感觉。\n\n李鹏日记《关键时刻》以及陈希同回忆录《众口铄金难铄真》都是通过共产党官员的角度来了解六四，非常的有历史意义。李鹏的那一本书本来计划在香港出版，但是由于北京的压力过大而没有出版成功，但网上已经流传出李鹏日记的全文。李鹏在书中主要是把六四屠杀的责任推给邓小平，然后把胡锦涛、温家宝等人全部拽出来，李鹏想表达的是「六四屠杀你们人人有份，不要让我李鹏背所有的黑锅」。李鹏肯定是害怕将来共产党官方如果要平反六四，肯定会拿李鹏来祭器，让李鹏来给邓小平背黑锅（就像邓小平让四人帮给毛泽东顶文革的罪一样）。陈希同作为落马的政治局委员，在书中首次对于六四中学生和市民的死亡表示「遗憾」，可以说是第一位共产党官员首次承认六四死了无辜的人。陈希同在书中也表示自己在六四中是邓小平的傀儡，为自己在六四中的罪行洗白。不管怎么，陈希同在经历落马后的人生大转折后，多少有一点良心了，承认六四死了无辜的人，这一点作为前共产党高官而言已经很有价值了。当然陈希同在书中主要是说明自己没有贪腐，自己的贪腐案是冤案。在我看来，共产党的高官都是贪官，陈希同肯定不例外。但是和把陈希同关起来的江泽民、李鹏等人比起来，陈希同那点腐败简直是小巫见大巫了。\n\n挑选一本好禁书，首先看作者，作者一定是真名实姓的人物。其次要看销售量和影响力，好的禁书一般都会被外媒广泛报道。\n\n有些禁书的内容不一定完全都真实，不排除其中有虚构和夸张的成分。但是由于共产党政府已经诚信破产，跳进黄河洗不清，共产党就算说了真话也没人信，即使有的禁书造了共产党的谣，读者也是宁可信其有不可信其无。禁书在海外的热潮也是由于中国没有出版自由所产生的可悲的现象吧。\n\n> https://www.pin-cong.com/p/127888/?s=127889",
			"added": 1535889653,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 25,
			"title": "一個可用的代理",
			"body": "Go2 is a online web PR0XY. (v21080629\\. Support twitter.com. Any bug please report to go2#go2walk.com or twitter to @go2walkC )\n\nIs it safe to use Go2?\n\nThe answer is yes. Go2 uses https protocal to encrypt the content you visit. Go2 promises the content between you and Go2 is encrypted. No one can peek it.\n\nThe answer is also **NO**. Don't trust anybody on the internet. Don't leak your credit card number,\nyour account information. If you are shopping on the internet, please go directly to the official website.\nDon't use a PR0XY to do that.\n\n> https://go2walk.com/\n\n---\n\nThe world is so big, let's go to walk around.\n\n[https://shqip.al/](/https://shqip.al/) _Albanian language; Shqip; Shqipe._\nRevista Shqip është e pasur me përmbajtje, që mbulon çështjet aktuale, shoqërinë, ekonominë, jetën, intervistat, reportazhin, sportin dhe turizmin.\n\n[shqip.al/](https://www.go2walk.com/https://shqip.al/) _Albanian language; Shqip; Shqipe._\nRevista Shqip është e pasur me përmbajtje, që mbulon çështjet aktuale, shoqërinë, ekonominë, jetën, intervistat, reportazhin, sportin dhe turizmin.\n\n[sabq.org](https://www.go2walk.com/https://sabq.org/) _Arabic Language._\nصحيفة سعودية تأسست عام 2007م وحاصلة على ترخيص رسمي من\n\n[oxu.az](https://www.go2walk.com/https://oxu.az/) _Azerbaijan._\nAzərbaycan və dünya xəbərləri.\n\n[www.postimees.ee](https://www.go2walk.com/https://www.postimees.ee/) _Estonian._\nEestikeelsete uudiste portaal. Uudised Eesti ja välismaa sündmustest. Sport, galeriid, arvamuse.\n\n[fotbolti.net](https://www.go2walk.com/http://fotbolti.net/) _Icelandic._\nSpjall, fréttir og tenglar um fótbolta.\n\n[www.vesti.bg](https://www.go2walk.com/https://www.vesti.bg/) _Bulgarian._\nПортален сайт с новини, спорт, право, кино, забавления и справочник.\n\n[www.onet.pl](https://www.go2walk.com/https://www.onet.pl/) _Polish._\nWiadomości z kraju i ze świata, baza danych firm i instytucji, ogłoszenia, pasaż handlowy\n\n[www.klix.ba](https://www.go2walk.com/https://www.klix.ba/) _._\nNajposjećeniji informativni portal u BiH / The most popular news site in B&H,\n\n[www.varzesh3.com](https://www.go2walk.com/http://www.varzesh3.com/) _Persian._\nسايت ورزش سه يك پايگاه اطلاع رساني در حوزه ورزش براي فارسي زبانان است كه اخبار حوزه ورزش ، نتاي\n\n[www.dr.dk](https://www.go2walk.com/https://www.dr.dk/) _Danish._\nDR Online, med adgang til Danmarks Radios radiostationer.\n\n[web.de](https://www.go2walk.com/https://web.de/) _German._\nGroßes deutsches Internet-Verzeichnis und Portal.\n\n[www.kinopoisk.ru](https://www.go2walk.com/https://www.kinopoisk.ru/) _Russian._\nНовости кино. Афиша Москвы. Фотографии звезд, кадры из фильмов и комментарии зрителей.\n\n[www.lemonde.fr](https://www.go2walk.com/https://www.lemonde.fr/) _._\nLe Monde.fr - 1er site d'information francophone sur le web et le mobile. Toute l'actualité en\n\n[Yle.fi](https://www.go2walk.com/https://yle.fi/) _._\nUutiset, tv- ja radio-ohjelmat, ohjelmakohtaiset sivustot, videokuvaa, ääntä ja paljon muuta.\n\n[tvfb.news](https://www.go2walk.com/https://tvfb.news/) _Khmer._\nប្រមូលផ្តុំដោយព័ត៌មានទាន់ហេតុការណ៍ ប្លែកៗ និងកំសា\n\n[www.donga.com](https://www.go2walk.com/http://www.donga.com/) _Korean._\n마이다스동아일보[동아일보뉴스:주요뉴스]\n\n[nos.nl](https://www.go2walk.com/https://nos.nl/) _Dutch._\nWebsite NOS met nieuws van het NOS Journaal, het Radio 1 Journaal en sportnieuws van Studio Spo\n\n[www.idnes.cz](https://www.go2walk.com/https://www.idnes.cz/) _._\nPřináší zprávy z politiky, sportu, ekonomiky i kultury včetně přílohy pro ženy, muže, o společn…More\n\n[www.24sata.hr](https://www.go2walk.com/https://www.24sata.hr/) _Croatian._\nNajnovije vijesti dana iz Hrvatske i svijeta. Pratite i kometirajte politiku, sport, show, lifestyle, biznis na najvećem portalu u Hrvatskoj.\n\n[www.delfi.lv](https://www.go2walk.com/http://www.delfi.lv/) _Latvian._\nJaunākās ziņas, resursu katalogs, bezmaksas e-pasts, spēles, horoskopi, laika ziņas, e-komercija.\n\n[www.delfi.lt](https://www.go2walk.com/https://www.delfi.lt/) _Lithuanian._\nNaujienų portalas su gausiais lankytojų komentarais ir video reportažais.\n\n[www.rtl.lu](https://www.go2walk.com/http://www.rtl.lu/) _Luxembourgish._\nRTL, Radio Télévision Luxembourg. Luxembourg s Number 1 News and Entertainment Portal.\n\n[adevarul.ro](https://www.go2walk.com/http://adevarul.ro/) _Romanian._\nVarianta online a cotidianului cu acelaşi nume.\n\n[news.mn](https://www.go2walk.com/https://www.news.mn/) _Mongol._\nМэдээ мэдээлэл, нийтлэл, сурвалжлага,ярилцлага,шууд, шуурхай, улс төр, эдийн засаг, нийгэм, спорт, дэлхий дахинд, медиа, фото, видео,эх сурвалж, баттай эх сурвалж\n\n[www.24livenewspaper.com](https://www.go2walk.com/http://www.24livenewspaper.com/) _Bengali._\n[অনলাইন সংবাদপত্রের শিরোনাম]\n\n[www.nepalpana.com](https://www.go2walk.com/http://www.nepalpana.com/) _Nepali._\nस्वतन्त्र विचार, सत्य समाचार\n\n[www.vg.no](https://www.go2walk.com/https://www.vg.no/) _Norwegian._\nFull coverage of domestic, foreign, sport and popular culture.\n\n[abola.pt](https://www.go2walk.com/https://abola.pt/) _Portuguese._\nNovidades sobre as principais atividades desportivas no mundo.\n\n[www.nicovideo.jp](https://www.go2walk.com/http://www.nicovideo.jp/) _Japanese._\nニワンゴが運営する投稿動画配信サービス。コメント機能やタグ機能。アニメやニュース番組も配信。\n\n[www.aftonbladet.se](https://www.go2walk.com/https://www.aftonbladet.se/) _Swedish._\nSenaste nytt dygnet runt och hemsida för tidningen.\n\n[www.aktuality.sk](https://www.go2walk.com/https://www.aktuality.sk/) _Slovak._\nInternetové spravodajstvo z domova i zo sveta. Správy z oblasti ekonomiky, kultúry a spoločensk\n\n[www.24ur.com](https://www.go2walk.com/https://www.24ur.com/) _Slovenian._\nSlovenija, svet, gospodarstvo, šport, IT, zanimivosti, vreme in ceste.\n\n[pantip.com](https://www.go2walk.com/https://pantip.com/) _Thai._\nเว็บชุมชนที่ใหญ่ที่สุดในประเทศไทย แบ่งหมวดหมู่ชุมชนหลากหลาย\n\n[sabah.com.tr/](https://www.go2walk.com/https://www.sabah.com.tr/) _Turkish._\nSabah, Dünyadan ve Türkiye gündeminden son dakika haberleri en hızlı şekilde sizlere sunmaktadır.\n\n[Elpais.com](https://www.go2walk.com/http://elpais.com/) _Spanish._\nPeriódico con noticias de última hora, vídeos, audio, música, multimedia, opinión, internaciona\n\n[www.walla.co.il](https://www.go2walk.com/https://www.walla.co.il/) _Hebrew._\nדף הבית הפופולארי בישראל. מציע עשרות ערוצי תוכן ומידע מובילים בתחומם, שירות דואר אלקטרוני ללא ה\n\n[www.Zougla.gr](https://www.go2walk.com/http://www.zougla.gr/) _Greek._\nΕιδησεογραφία από την Ελλάδα και τον κόσμο. Όλα τα νέα γύρω από την Πολιτική, Οικονομία, Υγεία\n\n[www.bien.hu](https://www.go2walk.com/https://www.bien.hu/) _Hungarian._\nA www.Bien.hu iránytű a legújabb trendekhez és praktikákhoz, a szépség, divat, stílus jó ismerő\n\n[www.repubblica.it](https://www.go2walk.com/http://www.repubblica.it/) _Italian._\nRepubblica è il quotidiano online aggiornato 24 ore su 24 su politica, cronaca, economia, sport, esteri, spettacoli, musica, cultura, scienza, tecnologia.\n\n[www.oneindia.com](https://www.go2walk.com/https://www.oneindia.com/) _India._\nभारत और दुनिया भर के सभी नवीनतम समाचार शीर्षकों को पढ़ें, आज के ब्रेकिंग न्यूज और राजनीति, चुनाव, व्यापार, खेल, अर्थव्यवस्था, वर्तमान मामलों, परिणामों और वनइंडिया पर लाइव अपडेट प्राप्त करें।\n\nஇந்தியா மற்றும் உலகெங்கிலும் உள்ள அனைத்து சமீபத்திய செய்திகளையும் படிக்கவும், இன்றைய செய்திகள் மற்றும் அரசியல், தேர்தல்கள், வணிகம், விளையாட்டு, பொருளாதாரம், நடப்பு விவகாரங்கள், முடிவுகள் மற்றும் வெற்றி ஆகியவற்றை முறித்துக் கொள்ளுங்கள்.\n\n[grid.id](https://www.go2walk.com/http://www.grid.id/) _._\nGrid.ID menyajikan Celebrity Breaking News, mengabarkan secepatnya kisah selebriti lokal dan dunia\n\n[Vnexpress.net](https://www.go2walk.com/https://vnexpress.net/) _Vietnamese._\nThông tin hàng ngày ở Việt Nam và thế giới. Các chuyên mục khoa học, sức khoẻ, đời sống và giải\n\n[www.xinhuanet.com](http://www.xinhuanet.com) _Chinese._\n新闻中心,时政,人事任免,国际,地方,香港,台湾,澳门,华人,军事,图片,财经,政权,股票,房产,汽车,体育",
			"added": 1537601108,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 26,
			"title": "六四",
			"body": "一場失敗的運動，學生的訴求從反腐敗逐漸轉化為求民主，用劉仲敬的話說是「弄假成真的運動」。但由於經驗不足和沒有有領導力的領袖，導致一步錯步步錯，徹底的沒有策略和指揮，再加上黨內的改革派中都是軟的不行的書生而沒有厚黑的司馬懿，導致體制內的溫和派根本沒有和廣場上的群眾結合。\n\n王丹、吾爾開希這些人沒有挑大樑的領導力，知識分子也有一種往後退的、不願因承擔的意願，導致廣場上的百萬民眾根本沒有被組織起來，尤其在後期完全亂成一鍋粥。\n\n趙紫陽、胡啟立、萬里這些人也都是軟弱的文人，根本沒有魄力與勇氣。當然，能被鄧小平提拔的，估計也都是趙紫陽這種乖乖寶。趙紫陽這些人根本都不是能夠欺騙曹操的司馬懿，完全是任人擺佈的光緒帝。\n\n很可惜，中國人是不幸的民族，多次錯過民主化的契機。1989 年由於種種不利因素湊再一次，扼殺了這一次民主轉型的最佳機會。\n\n事後諸葛亮式的穿越一下：\n\n如果當年改革派有魄力，趙紫陽就應該 5 月 19 日在廣場上看學生的時候講「同學們是愛國的，今天中央已經被鄧小平、李鵬這些傢伙們搞得爛透了，整個國家被他們搞的烏煙瘴氣，現在同學們就跟著我，衝進中南海，活捉黨內的這些妖孽。」當時廣場上可是有近三百萬人，如果趙紫陽以總書記的身份站在第一排帶著學生往中南海裡面衝，中南海的警衛是不敢開槍的。\n\n如果這麼做，鄧小平、李鵬肯定在人民活捉他們之前就坐著直升飛機跑到外地調兵來鎮壓了。但萬里當時在加拿大訪問，萬里就應該立刻在多倫多或者紐約成立流亡政府，當時萬里是國會議長，完全有資格。萬里就應該的聲明呼應趙紫陽，召開全球記者會，寫一個反鄧挺趙的聲明，讓全世界媒體轉播，然後授權彭沖召開全國人大臨時會議。\n\n彭沖召開全國人大臨時會議，會上立刻罷免鄧小平的軍委主席職務，李鵬、姚依林的正副總理職務，任命趙紫陽為軍委主席。然後趙紫陽召開政治局擴大會議，立刻開除鄧小平、陳雲、李先念、李鵬、王震等人的黨籍。\n\n到那時候，軍隊就會擁護趙紫陽這個新中央，而放棄鄧小平，因為本來徐勤先等軍頭也不認同鎮壓。\n\n接下來就迎接萬里回國，然後和審判四人幫一樣把鄧小平、李鵬等人送上法庭（當然很可能鄧等人會流亡），這就是事後具體的一些細節了。\n\n總而言之，趙紫陽在某些方面也是一個罪人，他的軟弱和猶豫不定，是中國錯過了百年來和平走向民主的最佳機會，非常可惜。趙紫陽、萬里這些人還是太軟了，沒有穩住大局的領導力。\n\n---\n\n誰能動的了軍隊？鄧還是有威望的\n\n你太高看鄧的控制力了。\n當時北京公安和遊行群眾打哈哈，衛戍區聽宣不聽調。野戰軍上有軍長一級抗命，下有連一級嘩變。鄧自己都說當時做了內戰的心理準備。\n\n那現在習近平豈不是隨時都會被幹到？\n\n不然你以為習近平為什麼要拚命清洗。隨時被幹掉不至於，但反對派可是一直在暗中磨刀霍霍的。\n\n---\n\n中國所謂潰而不崩的意思就是：同樣的事情如果發生在其他國家，哪怕不是一個民主國家，統治者把事情做到這個地步民眾肯定造反了，但是對於中國，不論是奴性深重也好，缺乏能力也罷（實際情況肯定是二者的結合），共產黨都不會受到什麼威脅，於是他們可以把壓迫繼續深化下去。而一旦壓迫深化下去以後，你再想反抗它，那就更難，更沒有機會了。\n\n知識分子們試圖改變現狀，他們從外國吸取經驗，錯誤的把像甘地這樣的人當作榜樣，卻忽略了甘地面對的是寬宏的大英帝國。試想如果大英帝國也開著坦克去碾壓食鹽進軍，甘地能有什麼辦法呢？\n\n暴力是共產黨能聽懂的唯一語言，但是中國費拉不具備暴力威脅共產黨的能力，這是非常可悲的事情。如果你在意的是六四的死難者，那麼這些人命當然是可惜的，但是如果要講到所謂民主化進程，那就沒什麼可惜，因為當時本來就沒有實現民主化的機會。你就是換個辦法，或者換一批更有魄力的領導人，鑑於二者已經極其巨大的實力差距，結局還是一樣不會改變。\n\n一些人考證出來 89 年的時候匪調了 18 萬軍隊進入北京。試問你鎮壓一群手無寸鐵的群眾需要這麼多人嗎？難道北京沒有自己的衛戍部隊嗎？說白了這麼多軍隊防的可不只是群眾，還有其他的軍隊。而且事實上我們也知道徐勤先就是抗命了。如果匪不調這麼多軍隊來，不讓他們彼此之間形成壓力，抗命的是不是還會更多？會不會直接嘩變了殺進中南海呢？\n\n所以我們要地方獨立，這也是原因之一（羅馬尼亞人打死齊奧塞斯庫就容易多了）。**總有人碰瓷說美國就沒分裂，可是請問美國獨立的時候局勢有你這麼絕望嗎？**說穿了還是被共產黨操的不夠狠。否則你怎麼能把共產黨和英國混為一談呢？\n\n而在這樣絕望的局勢之下，六四最初的口號也是非常可憐，居然是從悼念胡耀邦開始的。這其實說穿了都是小事。換了其他任何一個正常國家領導人出來安撫一下事情就過去了。但共產黨反正不怕你，所以也沒必要安撫，於是事情逐步發酵，參與者越來越多，口號才從悼念胡耀邦升級為反貪腐反官倒又升級為民主。\n\n如果說我對六四有什麼不滿，一件事就是潑墨三君子被扭送到公安部門，這事幹的太理客中了。或者說是中國人慣常走捷徑的思維在作祟。事實證明三君子無論下場如何，木樨地該流的血都是一樣要流的。那你何苦讓人家去蹲牢房呢？當然這個毛病早就刻在中國人的行為習慣裡了。前些日子岳昕那幫人搞共產主義宣傳，也是一群人出來洗地說這是防止共產黨抓人的策略。但問題是岳昕等人就是在宣揚馬列邪教，而且也確實被抓了，那你意淫出來的策略究竟有什麼意義？除了製造出一批新的邪教徒以外？\n\n林沖上梁山的時候王倫讓他下山砍個腦袋當投名狀，意思就是你這人可能背叛我們。但是如果你手上沾了血，官府將來也不會放過你，那你林沖就只能死心塌地的跟著我們打家劫舍了。**別的事情上中共多半都是做的不如蘇共好的，但唯獨在陰謀厚黑這方面，中國人是全世界的老祖宗。**想當年蘇共就是不懂投名狀，讓一個手上沒血的戈爾巴喬夫當了總書記，後來發生了什麼你們都知道了。\n\n當時的情況是：臘肉已經把中國綁在美國的戰車上了，如果中國還要走回老路，最後只會落得一個把美蘇都得罪乾淨的下場。鄧碾平對此是心知肚明的，但陳雲鄧力群們就未必了。鄧碾平需要一些人來抵抗陳雲們走回老路的主張——但這個人不能真的相信民主，不然一旦民主以後大家手上纍纍血債誰也逃不了——而他只要作為一個幕後大佬拉拉偏架就行了。\n\n但中共畢竟不是水泊梁山，作為一個名義上造福無產階級的黨，壞話是不能明著說的，壞事是要偽裝成為人民服務的，所以就會出現一種明明交了投名狀還不自知，還以為自己在造福廣大勞苦人民的情況。\n\n**趙紫陽就是這種交了投名狀而不自知的人。**他年輕的時候在自己的家鄉搞土改，但是可能因為當地官員和他不全相熟，他那一直以來支持他加入共產黨和抗日，歷史資料也證明沒幹過什麼壞事的父親居然被定性成地主了。後來還被批鬥致死（一說在土改中病死，但即使是病死我們也很難不懷疑這和土改有什麼關聯），而趙紫陽在整個過程中居然也沒什麼表示。當然我們看多了共產黨的黑歷史就不難想到他可能是出於恐懼，但是在鄧碾平的眼中他恐怕就是個六親不認的人，很適合當總理和總書記，或者說自己的打手。\n\n但是如果趙紫陽真的六親不認，他肯定也就成不了你們口中的改革派官員了。在我看來他更多的像是個邪教徒。要說良知他肯定是有的，但是整個價值觀被共產邪教扭曲了，所以才會幹些諸如土改之類自認為正確的事情。\n\n然後歷史跟他開了個玩笑，把一群大學生送上了廣場，這樣一來他的價值觀就受到挑戰了。以前土改的時候他可以說好，我們農民和你們地主之間有著不可調和的階級矛盾，所以你們地主必須改造。但是大學生不是一個階級，以往的階級理論在六四學生身上全都失效了。而且你用腳趾頭想也知道這群大學生不可能像李鵬等人污衊的那樣危害社會主義，首先無論能力還是作案時間就都不存在。\n\n所以他必須承認這些學生是對的，是愛國的，可是承認了以後呢？難道他還真的能夠帶領學生衝進中南海？這可不僅僅是軟弱文人的問題，而是這種行為會衝擊到他一直以來的信仰。哦，為了共產主義，為了造福全中國的無產階級，我親爹我老上司都被犧牲掉了，難道我能承認，那個黨是邪惡的，需要民眾推翻的嗎？沒錯黨內也有很多保守派，但是我一直以來的經濟改革難道不是得到鄧小平全力支持的嗎？——所以你看，趙紫陽怎麼可能背叛黨呢？\n\n然後這裡就形成了一個死結：他只能盡力說服學生離場，說服不了就只能被動等待；可是學生是不能離場的，因為四二六社論已經定調了，如果不撤銷四二六社論的話是一定會被秋後算賬的；但陳雲們當然是不可能撤銷四二六社論的，戈爾巴喬夫也不可能取消訪華，事情就這麼一路衝著藥丸去了。\n\n---\n\n你说得对，我只是做一个比喻，其实现实中是不能指望李秀成来反洪秀全的。\n\n> https://pincong.rocks/question/768",
			"added": 1551609671,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"5_18cRWp8EGniDTB1itbx5WXenypdjStLmoh": 1,
		"6_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": 1,
		"1_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": 1,
		"1_1fo4F2EFpchNKtmxezSBpqM7Xnstc7ZuT": 1,
		"17_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"64_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": 1,
		"14_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": 1,
		"13_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"3_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm": 1,
		"1_164S7NQPD3KDoiVyU8oKx1VmsZM7z161tB": 1,
		"2_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7": 1,
		"4_12eyn7aqnDpzq5WKEZARAt9imQ1sRagAsm": 1,
		"6_1CQAzBixetRWrEto8hLKTKcA7oCDBuNdu8": 1,
		"44_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"3_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": 1,
		"11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa": 1,
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": 1,
		"308_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": 1,
		"346_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": 1,
		"1_13bt9n8uszaJuDD3RKxYU1fJMF36G3dK1U": 1,
		"1_1ET5XVEQK7s2eE6Y8Sqa6M4RvvRVkGs3YE": 1,
		"77_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1
	},
	"next_comment_id": 29,
	"comment": {
		"1_12AyVjYPn8ToxvMSxbxbcMaTYNCBhqE1Fz": [
			{
				"comment_id": 1,
				"body": "太長，麻煩概括一下",
				"added": 1520161390
			}
		],
		"6_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [],
		"5_1CoMVWZDiGBYRBfViuCs3d5ECGhP9zaSuw": [
			{
				"comment_id": 3,
				"body": "這是不可能的。",
				"added": 1520252245
			}
		],
		"2_19AzJi9mcRYJohmYmYooHEBModMimM8R6D": [
			{
				"comment_id": 4,
				"body": "混淆得不像反而更容易檢測到\n當然是原版 shadowsocks 啊",
				"added": 1520252314
			}
		],
		"2_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 5,
				"body": "> [p2p](#comment_1257_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): 我没看出效果。请给出测试用例，谢谢！\n\n前：http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/14ytAKDfNjArMTqGecTi7ginG3aZTsRAum/1520272634\n後：http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/14ytAKDfNjArMTqGecTi7ginG3aZTsRAum/1520272629",
				"added": 1520272231
			},
			{
				"comment_id": 10,
				"body": "> [p2p](#comment_1259_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): 敲两下回车实现空一行，是这样么？\n\n是的",
				"added": 1520509587
			}
		],
		"12_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 7,
				"body": "這是在**比烂**：綠比紅好",
				"added": 1520342215
			}
		],
		"1_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 8,
				"body": "> [sophy](#comment_7_1Kt5qA93xTpqsFRKGzm9tLWGSdjXgpRkxg): 说句题外话，现在的中特除了在进化论上还差点，怎么看都更像第一种。\n\n那是必須的，列寧主義的本質不是階級鬥爭，而是先鋒隊組織。先鋒隊組織和市場經濟結合，最簡單的描繪就是納粹模式。黨委進駐企業，不損害資本家的分紅和日常管理，但對政策性問題實施引導，比斯大林主義更加仁慈高效。**斯大林主義和法西斯主義是列寧主義的兩個分支，納粹主義是法西斯主義和斯大林主義的組合拳。**\n\n請看：http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:5_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum/",
				"added": 1520423417
			}
		],
		"23_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 9,
				"body": "**權貴資本主義**怎麼容得下馬克思？\n請看：http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:8_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
				"added": 1520423554
			}
		],
		"68_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 11,
				"body": "江山永固不成問題",
				"added": 1520519837
			}
		],
		"70_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 12,
				"body": "庫克**主動舔**成這樣真 TM 高貴",
				"added": 1520525203
			}
		],
		"9_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 13,
				"body": "只要知道密碼就能改掉密保，那麼密保有什麼用…… 蘋果腦子有洞",
				"added": 1522738919
			}
		],
		"13_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 14,
				"body": "> [achinese](#comment_5_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q): 最好不要给原文链接，通过zeronet的链接访问其他网站，容易被追踪\n\n轉貼給出原出處是基本素養，你不想被追踪可以不點鏈接",
				"added": 1522742286
			},
			{
				"comment_id": 17,
				"body": "> [achinese](#comment_21_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q): 我同意你说的给出处。但是我说的就是不要发外部链接。\n\n不點就不會被追踪，點了也不一定被追踪",
				"added": 1522743561
			}
		],
		"2_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7": [
			{
				"comment_id": 15,
				"body": "> [achinese](#comment_3_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q): 同意，肯定会联合\n\n必須的，否則制裁無效",
				"added": 1522742345
			}
		],
		"81_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 16,
				"body": "要解决翻墙问题",
				"added": 1522742393
			}
		],
		"7_12eyn7aqnDpzq5WKEZARAt9imQ1sRagAsm": [
			{
				"comment_id": 18,
				"body": "能，複製粘貼即可",
				"added": 1523011154
			}
		],
		"11_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [],
		"51_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 20,
				"body": "- [將最寶貴的信息裝進漂流瓶：評劉仲敬《近代史的墮落》](?Topic:11_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)\n- [帝国、邦国与民族国家的想象](?Topic:12_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)\n- [假國家](?Topic:10_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)",
				"added": 1524154025
			},
			{
				"comment_id": 21,
				"body": "## 刘仲敬访谈之感\n\n【这是今年 5 月份看《刘仲敬：我们在世界中的位置》这篇访谈后的一些想法。5 月份就写好了，然后就忘记了这事。今日偶尔找到，觉得作为一个记录，贴出来也不错。5 月以后也看了刘另外一些访谈，觉得他的想法很有意思，虽然其中有些地方可能也存在一些问题。不管如何，只要想法有依据有逻辑，多接触一些总是好的，就好似「头脑风暴」那样。我的记录仅仅是我当时的想法，写的时候没有进行查证；可能全部是错的，胡说八道。】\n\n前几天看了刘仲敬的一篇访谈，里面提到几个有意思的观点，譬如 ROC 建立在流沙之上，「共产主义」很难说是中国人的选择，新左、新儒、新权威这三种后极权道路难以行得通，自由与民主的价值观虽然赢了冷战，但是难以在没有外力的情况下在各国推行。\n\n对于 ROC 建立在流沙之上，我比较认同这种说法。清朝的覆灭的当时各种中国各种政治力量合力的结果，但民国的建立并不是。当时除了革命派外，有立宪派，保皇派等。建立一个共和制度的 ROC 只是革命派的主张。虽然 1911 之后中国没有了皇帝，但并不是说这是中国人的选择。我认为，即使没有日后的中日战争和国共内战、中共胜利，ROC 即使交上好运气，也跟法兰西差不多，第一共和，第一帝国，第二共和，第二帝国…… 如果运气不佳，就像刘所说的解体，各地独立。顺便说句，毛爷爷当年就搞过湖南独立。\n\n一伙人建立一个国家，要么他们是同一个民族，要么他们有共同的理念或者信仰，要么就是形势所逼，凑合到一块。但归根究底，还是一个群体的共同价值取向相当。制度和法律，构筑于群体的共同价值之上。一伙人没有一致的共同价值，即使找个地方建立国家，或者变革成功推翻前朝，新的国家经常出现混乱甚至陷入内战，譬如萨达姆倒台后的伊拉克（这里有个问题：「萨达姆时代伊拉克人的共同价值是什么」。这个问题超越了刘仲敬那篇访谈的讨论范围，这里先不说）。如果说 ROC 建立在流沙之上，那么后来的 PRC 又是否建立在流沙之上呢？刘没有说这个问题。他不说，我也不说。不过，究竟是不是有必要内战推翻国民政府都存有疑问，而且，「共产主义」这个东西对于中国人来说很陌生，完全没有认知基础，即使对于中共，甚至苏联，也只不过是存在于部分理想主义者和幻想家脑子里的乌托邦，真正出现的只有列宁 - 斯大林的铁血统治。PRC 的建立，是中国人的普遍愿望与选择，是中国梦，还是单纯的中共梦、苏联梦，恐怕不言而喻。1949 年的中国，不是单民族，也没有共同信仰；刚战胜日本，没有 1945 之前的窘迫的形势。如果说有共同理念，恐怕也只有一条，就是不要再战下去。\n中国的皇朝都终于治理溃败、流寇造反，而新皇朝始于新势力打入皇宫弄死皇帝并镇压其他势力。而各个皇朝兴盛与衰落而一直没有改变的价值观念，则是汉朝开始向民众推广的「儒家」（外儒内法）伦理。这套半宗教的伦理学几千年来都是中国人处理人与人（尊与卑），私人与公共，个人与国家关系的准则，即政府（朝廷）与民众（百姓）都接受价值体系。清朝末期，这套令中国社会陷入不断循环的伦理体系开始受到质疑，而到了 1949 年，经过维新、太平天国和新文化运动，一百年之间，中国人原有的价值体系完全崩溃。\n\n20 世纪上半叶，中国从清朝到 ROC 再到 PRC，从皇帝到总统再到主席；在这个过程中，一般人甚至难以数清有多少个「政府」上过台（临时政府、南京政府、北洋政府、国民政府……），这个国家有过多少个首都（广州【这个我不确定，懒的去查了】、南京、北京、武汉、南京、重庆、南京……）。当社会急剧变化的时候，人们的思想会混乱，而普遍愈发激进。刚好在 1949 年，一股 20 世纪最激进的思想随着最激进的政党上台而强行推向全国，更不幸的是，这个激进政党的首脑又是这股激进思潮里面最激进的代表人物，而更更不幸的是，他其实并不知道自己口中念念有词的话语究竟是什么意思…… 此后发生的事情已经可以预见到。1949 年之后，依靠政府强推，虚幻缥缈的「共产主义」曾短暂成为中国人共同的终极妄想。善于鼓动、宣传的政党给经历了长久战乱、一直缺乏政治权利意识的民众画了一个又一个大饼。「多快好省建设社会主义」「跑步进入共产主义」「赶英超美」「中国人民站起来了」「美帝苏修」，这些空洞的宣传激发起中国人前所未有的经济、政治幻想，并且为中国人树立了两个妄想敌，一边使中国人充满激情投入经济生产，一边又使中国人陷入时刻国破家亡的精神紧张。经济、政治、外敌三位一体的激情想象使中国人乖乖地被控制在掌权者的手心。但是，对连自己都不明白的激进信念的荒谬的自信马上就演变成现实的悲剧。从大跃进到大饥荒，为掩盖一连串失误，当权者为民众树立一个又一个的内部和外部敌人。一边激发民众的政治热情，一边却不赋予民众任何政治权利，甚至野蛮剥夺任何人思考的自由，民众这种既亢奋又压抑状态最后在文化大革命里由最高领袖引燃爆发。他们操着最高领袖教给他们的话语，拿起拳头石头和斧头，向领袖指挥的方向挥去，最终割下无数人头。一场最高层和底层结合得天衣无缝的政治运动，清除了最高领袖眼中的政敌。昨天的主席今日变成工贼，明天的接班人今晚就叛国。现在有些人追问为什么毛一个人就可以发动文化革命，为什么普通民众也热衷于无端端去革别人的命，我觉得，这些事情都是水到渠成的。自从他们接受这个激进又说不清的理念开始，这个结局就是合乎情理和逻辑的。后来的事只不过符合了趋势，没有发生意外而已。\n\n但一波又一波的运动最终还是耗尽了人们的激情。第一代的神话随着大神们的死去和现实的衰败而破灭。刘仲敬在另外一篇演讲《缺少土豪的世界》里面讲，文革后 30 年的社会也是一个「流沙社会」，因为人们没有共识。不但没有价值，也没有可以站出来指明、坚持、带领一个群体坚守价值的人（「土豪」，古代意义上的），更没有可以恪守价值的共同体。我对此并不同意。第二代已经没有大话可说，神话可立，于是给人们指了条简单明了的共同价值：赚钱。尽一切手段满足欲望，是后毛时代人们的共同价值。而中共党，掌握着这个社会资源和权力的领导群体，就是维护坚守价值的土豪（古代和当代意义上的）。对自己有利的，无论什么事情，都要不择手段得到，除非自己会栽在争夺的路上；对自己不利的，无论有什么高大上正义凛然的理由，通通避开。这是自毛时代以来人们的普遍教训，也是从「马克思」（列宁）那里学来的发达捷径——我们还处于初级阶段，有什么所谓呢，反正我们还是走在绝对真理的康庄大道上。一些知识分子，无论是自由派，还是新左，抑或是新儒家，认为这个时代没有信仰，没有价值观，批判人们犬儒。其实我们不是没有信仰没有价值观，反而，我们的信仰和价值观高度统一，否则我们就会内战解体，只不过，我们的信仰，这个时代的共同价值观，实在不好意思写在国家格言上。这也是中国一边经常发生各种突破人们心中底线的事情，一边却又繁荣稳定的原因之一。\n\n刘另一层观点，新左、新儒、新权威这三种后极权道路难以行得通，这也是明摆着的。「新左」其实是怀念过去，但这只是一厢情愿的想法，共产党内部也没有多少人觉得跟他们共度漫漫日子总有乐趣，毕竟比起过去还是现在欲望得比较多，也实现得比较多，况且他们的想法也是空中楼阁。新儒其实是一种充满矛盾又不合时宜的说法，在此先不说。新权威也只是一厢情愿的想法，很理想，很稳妥，但就是不知道什么时候会出现，与其盼望后极权向新权威转变，不如去买彩票。我们的「土豪」已经一再强调，要走特色道路。所谓特色道路就是要满足自己欲望。我们的是土豪主导的衙门型市场经济，交易要先满足土豪的欲望，土豪要吃大份，土豪吃完后交易的另一方再吃小的。虽然吃了亏，但总比没有交易好。土豪说，你就认了吧，谁叫你在天朝呢，况且，你那小小的欲望不是也得到小小的满足么。\n\n刘最后提到美国是这个时代的罗马，其输出的价值观自由与民主虽然赢了冷战，却难以移植到全世界。事实上与其说自由与民主赢了冷战，不如说红色阵型的傲慢、野蛮与愚昧输给了进化前夕的工业文明。资本主义阵型在冷战过程中犹豫不决、患得患失，这点从美国没有看到中苏必然的断裂、越战在民主制约下虎头蛇尾、失去越南后扶植赤柬却又被迫抛弃等例子可以看出。红色阵型是一堆拿了飞机大炮和核弹的野蛮人，表面挂着共产主义的旗帜，里面各个心怀鬼胎互不信任。他们本身就身处囚徒困境的博弈。苏联不放心中国，中国不信任苏联。中国支援越共打越战，可越南人从根本上就不相信中国，统一越南后马上转抱苏联的大腿。中国转而扶植新的势力赤柬，可柬埔寨跟周边国家合不过来，还喜欢杀人…… 所以我不认为冷战是自由和民主取得胜利；野蛮人自己玩残废了自己，而西方碰巧给世界树立了成熟的法治的自由、民主国家取得的成就，引起一堆被折腾得断了胳膊缺了腿的国家纷纷效仿。其实民主容易，自由难，秩序和法治更难。给野蛮人选票是件易事，让野蛮人学会尊重他人就难了，让野蛮人有了权力后依然约束好自己就更难。美国光顾着空投选票，将自己的励志故事做成镜像，纷纷向其他国家推销；其实人家拿回去只山寨了个名称，下载后根本没有格式化安装，留下一堆隐患。所以历史没有终结，文明只好继续冲突下去。\n\n> https://peakvisionone.wordpress.com/2014/12/21/liuzhongjing-our-position",
				"added": 1524206367
			}
		],
		"16_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 22,
				"body": "- [洪水学的起源](?Topic:10_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV)\n- [阿姨北京之行秘传心法要义](?Topic:21_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)",
				"added": 1526025003
			}
		],
		"20_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 23,
				"body": "### 低城堡里的女人\n\n数卷：国民革命是一定会发生的。苏联的试探为时甚久，对象不限于民党；但没有孙、蒋愚蠢的聪明，革命主体只能是冯玉祥和若干西北小军阀。满洲继续亲日，东南继续亲英。即使联省自治不能成功，条约体系也不会破裂。俄帝国主义在中欧、满洲和江东都是破坏者，唯独在中亚有益，参见外蒙古。\n\n一个军阀割据、四分五裂的东亚不可能全部赤化或反赤化，注定要分裂成多个相互矛盾的势力。分裂的欧洲同理。多国体系是文明的保险机制，大一统是最后的自杀。\n\n在没有北伐的世界上，张作霖 - 日本联盟会轻易击败冯玉祥 - 苏联联盟。东南各省和日满联盟都会投机性加入英国的反德战争，然后在胜利后自然加入美国的冷战。西北赤化各邦将在 1990 年代独立，处境胜过没有殖民的波斯土耳其。这才是正常的历史进程，可见国民党投机者的破坏之大。\n\n山西注定是满洲 - 波兰的乌克兰，郭松龄战争时期已经是这样。国民党的背叛不仅把江东变成了苏联的人肉盾牌，还通过同盟会统战毁了晋国，正如我匪目前企图通过抗日统战毁灭台湾。\n\n神秘法则不可能抗拒，扭曲肯定会带来延迟而加强的反弹。在这种反弹中，投机者都会打回其德性所能允许的自然位置。世界总会属于英美，中欧总会属于德国，东亚总会属于日本。\n\n> https://plus.google.com/+夏格明/posts/iU55W3ApmW6",
				"added": 1526927503
			}
		],
		"3_17Nkmf7uWjYV7PQ7ZhpeW2KYZDJdMTwHU6": [
			{
				"comment_id": 25,
				"body": "本站作為公共討論區，應當遵守公共道德\n你要是想，可以自行建站",
				"added": 1532694700
			}
		],
		"45_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 26,
				"body": "- [推荐几本最值得一看的中国禁书](?Topic:24_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)\n- [六四](?Topic:26_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum)",
				"added": 1535890068
			}
		],
		"1_1MnknYLJ6Lhd7EECW3Tf8x6Z4ya2DFcELU": [
			{
				"comment_id": 27,
				"body": "VPS",
				"added": 1538328871
			}
		]
	},
	"comment_vote": {
		"10_1JdYoU27TsjrKW1Jtp2GC2YiBZtvFdYxaV": 1,
		"5_1Lamw1Fk5CrdjwLNPfkDBJH8C2znRuCcBL": 1,
		"47_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": 1,
		"51_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": 1,
		"4_14BL9jNfFXAV821beMvgQWJqRumoX9C15t": 1,
		"5_14BL9jNfFXAV821beMvgQWJqRumoX9C15t": 1,
		"251_139DmfQr5fT7Xkcn71DpXBaXhA4X9u873q": 1,
		"10_1G58PQ7Ena3mARGX2p5mYH7yHcBWRLX2Pa": 1,
		"781_1958F7oCppj78MP966AfojMQwHg2WUupzq": 1,
		"141_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"107_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": 1,
		"5_1Kt5qA93xTpqsFRKGzm9tLWGSdjXgpRkxg": 1,
		"145_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"194_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": 1,
		"12_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": 1,
		"21_15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco": 1,
		"175_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"26_15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco": 1,
		"157_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": 1,
		"8_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"4_153rWEXYYScxg18b3yDFbnitonjY9SKE23": 1,
		"1_18DExvnWNRp3xKFDmxuQtDKAnyhpE6e5xv": 1
	}
}