{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "有害还是无害，这并不是关键，关键是选择决定的权利!!",
			"body": "有害还是无害，这并不是关键，关键是选择决定的权利!!\n\n零网上面很简洁的逻辑：\n转基因食品有害还是无害，这并不是关键，关键在于，对于一种无害食品，个体有没有选择不吃或吃的权利，有没有代替他人做选择决定的权利。\nhttp://127.0.0.1:43110/sm.iZero.bit/?Post:2  \n\n越来越多人意识到了支那专政病毒的荒谬逻辑。关于转基因的论述，这篇文章简洁明了，非常好！一起大力推广好信息！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1503408536
		},
		{
			"topic_id": 2,
			"title": "郭文贵爆料—中南海穷途末路，陷入最后的疯狂！！",
			"body": "曹长青痛批美联社和胡舒立关于郭文贵所谓强奸女助理的报导\n\n美联社关于郭文贵涉嫌强奸女助理的报道完全不专业。有关“强奸”只有二百多字，没有见到“受害者“，简短【电话】采访，对“她”的引言只有13个英文字，还没敢提“她”的名字等等。美联社为什么会犯如此低级错误？是不是上面下指令要求写的呢？看看其社长跟中共喉舌的关系，你怎么判断？很多人同意：美联社部分人士丧失良心，是中了伪共匿产帮的“蓝金黄”病毒。\n\n郭文贵爆料引起巨大轰动，中南海已经阵脚全乱，才会公开打出各种疯狂的下三滥招式。\n种种迹象说明：中南海穷途末路，陷入最后的疯狂！！只有小规模金钱腐败、没有参与太多杀人罪孽的贪官们应该准备反戈一击了，以求自保。五毛党们、黑客们可以考虑以零网的新技术比较难对付为理由，多搞一些维稳经费，也随时留意机会反戈一击吧。",
			"added": 1505047111
		},
		{
			"topic_id": 3,
			"title": "《中国国民通识》冷漠十类",
			"body": "《中国国民通识》冷漠十类 （警告：本文国内已无处可以全文发表存活10分钟以上。言论钳制加紧说明中国人在不断觉醒，而支那蛆虫帮陷入最后的疯狂！）\n\n一：冷漠是平庸之恶：\n有一种恶叫平庸之恶，它以淡泊名利、清静无为为托词，逃避了每个人都应该肩负的社会责任。它对发生在自己身边的不义总是视而不见，开口闭口只谈春风杨柳，貌似高雅脱俗，其实，这种人的行为与坐在死尸堆旁吃饭完全没有区别。\n\n二：2.1 冷漠即奴性：\n中国人崇尚明哲保身。明哲保身：在大陆有两条解释：一是绝不触犯天条，二是在灾难中绝不同情任何人。说穿了就是做一个聪明的奴隶。诚然，他们不陷害无辜，但也绝不反抗邪恶，只求苟安、苟活。为了苟安，墙倒众人推时，他们跟着推；破鼓万人捶时，他们跟着捶。这就是所谓的明哲。这就是奴性。\n\n二：2.2 冷漠即奴性：\n美国一位汉学家说，中国的敌人永远不是资本主义，而是骨头里的封建君臣思想！从起火让领导先跑，特供食品，到专车，公款吃喝。再到身边大把见着领点头哈腰尽奉承之能的人。到处都能透着一骨子浓厚的奴性！张鸣说：即使用纸把你铐上，你也不敢挣脱！最深重的奴役，在人的内心！中国人啊，你何时才能做人？\n\n三：3.1 制度使然：\n读过《东德史》你会发现，不仅捷克，东德，x国，几乎所有的xxxx国家都存在漠视公德，人心浮躁，精神空虚，个人野心，自私自利，自吹自擂，特供，口是心非，不相信任何东西，相互否定。这些其实是马科四唯物主义意识形态和极权制度的通病，不是什么中x特色文化。所有s会xx国家在意识形态和人们的心思意念以及行为习惯方面基本上都是大同小异，都是说一套做一套。XX理论听起来头头是道，事实上根本就不可能做到，只好口是心非虚伪地坚持。\n\n3.2 制度使然：\n极权统治的实质就是消除一切自发的政治生活，把社会中的人分裂成一个个的原子，其目的在于使每个人只能孤立地面对整个制度，从而使人感到形单影只，而且往往茫然若失，敢怒不敢言。——米奇尼克\n\n3.3 制度使然：\n肖斯塔科维奇说：这是鸡的心理。鸡在啄食的时候只看到眼前的谷粒，别的什么也看不到。就这样，它啄了一粒又一粒，直到农夫扭断它的脖子。斯大林比谁都懂得这种鸡的心理，他知道怎样对付小鸡，它们都在他手上啄食。\n\n3.4 法律不作为：\n美国的《善人法规》：为鼓励医生和外行（普通人）救死扶伤 ，美国四十多州通过一部制定法，就是著名的善人法规 (Good Samaritan Statutes) ，此成文法鼓励医生和普通人在紧急情况下去救助和自己无关的人，他们只对重大过失承担一点儿责任，其它一般过失完全免责！此法让普通人可以热心做好人好事！\n\n3.5 社会支持：\n巴金说：“一个美国人敢站出来说真话，因为他知道身后会有千万个美国人用行动支持他。一个中国人不敢站出来说真话，因为他知道周围的同胞会默默地与他保持距离。”\n\n3.6 需要良法：\n国人为何冷漠而见死不救？我们需要《撒玛利亚好人法》美国50 个州及哥伦比亚特区都有自己的撒玛利亚好人法。美国《布莱克法学》对撒玛利亚好人法解释为：免除一个人（非专业救护人员）在救助极度危险中的人的过程中，因疏忽加重危害的责任。法国刑法规定，当他人遇到危险而没有提供必要的救助，可被处以6年监禁和大约70 万人民币的罚款。\n\n四：4.1 替强者辩护：\n许多人微信号被封，大多数中国人的第一反应是”你整天瞎逼逼有啥用”而不是问问网管你有什么权力封人家号；老头老太太被骗买了一屋子保健品， 中国人第一反应是这些老头老太太怎么不长个脑袋，而不是问问为什么那么多骗子无人管；一个美国青年跑到朝鲜偷标语被抓，中国人的第一反应是他太傻太天真，而不是问问为什么现在还有这种流氓国家。\n\n4.2 替强者辩护：\n在中国有这么一群奇怪的人，本身是最低阶层，利益每天受到损害，却有着统治阶级的意识，在动物世界里寻找这么低级的东西都不容易。现实中，当你环顾四周，你会发现，那些不畏艰险为老百姓直言为年轻人呐喊的人，谩骂攻击他们为汉奸美狗的，往往不是高高在上的达官显贵，而是生活在最底层的一批粪青，二逼脑残爱国苍蝇。\n\n4.3 替强者辩护：\n所谓的不关心政治 满意现状者 都是得了便宜又卖乖，别人在拼命在让社会进步，而你享受了社会进步 却又在嘲笑那些因推动社会进步而失去自由失去生命 的人，嘲笑他们不识时务 嘲笑他们是鸡蛋喷石头，嘲笑他们没有你们的明哲保身 过好自我垃圾“ 大智慧”。坐等恩赐者 才是这个社会发展的最大绊脚石！\n\n五：冷漠是不能流泪的悲哀：\n正如村上春树在《世界尽头与冷酷仙境》一书中写道，世上存在着不能流泪的悲哀，这种悲哀无法向人解释，即使解释人家也不会理解。它永远一成不变，如无风夜晚的雪花静静沉积在心底。\n\n六：冷漠是无限制的隐忍和扭曲：\n梁启超说：财产被劫掠时，他说还有自由；自由被剥夺时,他说还有生命；生命被扼杀时，他还谢主龙恩。即使眼前一无是处，他也能找到赞美的一万个理由。麻木是幸福之本，媚骨是升迁之道，崇高是痛苦之源，正直是怪异之举。\n\n七：7.1 冷漠与道德：\n如果面对黑暗、邪恶，面对世上一切的不公、不平，你还能够生气，并且很生气，说明你还有道德感的，你的道德感还很强；反之，面对这一切，不很生气，甚至干脆就不生气了，说明你的道德感已经麻木了，甚至已经同流合污了。\n\n7.2 冷漠与道德：\n有些人的聪明其实就是不问黑白与是非，不问真假与对错，有空子就钻有便宜就占；有些人的聪明其实就是不问正义与邪恶，任何时候都是明哲保身式的不要脸昧良心；有些人的聪明其实就是把危险和付出留给别人，把俭巧与拾利留给自己。其实这种聪明就是不讲诚信不讲规则。而这种人占中国人的绝大多数。\n\n7.3 道德变异：\n国人对于戏台上的悲情极其敏感，动不动就感动得流泪，但对于自己身边真切的悲剧又往往充耳不闻漠不关心。——张爱玲\n\n八：集体的冷漠：\n越是了解中国人，越发令人绝望。他们几乎没有任何精神信仰，也不寻求正义，灵魂是僵死的，或者是根本就不存在。他们不仅被愚蠢的汉语传统文化蒙蔽了理性，塑造成精明而又愚蠢，狡诈而又懦弱，表面上看起来规规矩矩，而行事做人却又猥琐肮脏，充满着极大而又隐蔽的破坏性。除此，而且被民族主义和爱国主义的集体主义思想所绑架，时时表现出来的、是一种虚妄的骄傲与滑稽的自豪，而深层次的却是自卑、愚蠢和愚昧。\n\n九：9.1 扮演“先知与毒舌”：\n慕容雪村：没人为他说话，他忍着；有人为他说话，他看着；为他争来权利了，他感谢命运：嘿，该我的就是我的；没争来权利，他扮演先知：早知道没用，折腾什么呀？为他说话的人被抓了，他就在一旁窃笑：活该，让他出风头！\n\n9.2 扮演“先知与毒舌”：\n奴性深入骨髓的表现是什么呢？比如：把“常识”视为反动，把“良知行为”视作即将要倒霉的傻X，并窃笑他，把“正义之举”视为多管闲事。总之，像猪一样只管吃槽里的饲料，无论发生什么，只要不幸没落在自己头上就永远两耳不闻任何事，只要能有一条命就是最大的幸福，什么精神、信仰、思想、自由那都是虚幻的，只有“吃”才是真实的。这是他们人生的终极哲学。然而，这些人还会跟你毫无羞耻感的说一句：“你看，最终还是过来了。”我在想，你虽然活着，但你做过“人”吗？都不觉得自己活得像个驱虫一样卑贱吗？\n\n9.3 扮演“先知与毒舌”：\n为什么说:这个民族没希望，你在QQ微信里发一些‘吃饱喝足，风花雪月’的照片，点赞评论一大堆。若发些关心社会“悲天悯人”的言辞，往往应者寥寥，更有甚者，警告你，“不要乱发这些不和谐的东西”。关心社会，反而遭到周围冷嘲热讽，认为你居心不良，心理阴暗。当柴静用纪录片勇敢地揭开雾霾的事实，那些害怕真相的人，一拥而上，拿出他们前所未有的勇气去攻击柴静。鲁迅对民众的麻木早有深刻的体会，所以才有呐喊。而今天的中国人的确一点儿都没变，我们的思想愚昧反而有增无减。一拥而上的作恶残害有良知的思考者，下手犹狠。王朔说：中国人是猪，感情上不能接受，可他妈的很多事一直都在验证中国人是猪这一事实。不侵犯到自己的利益，就光知道埋头赚钱，谁死都和自己没关系。一旦伤害到自己了，马上就哭天喊地惨叫，然后一个大白馒头扔过去，立马又止住了，别人喊的时候，丫依然埋头吃喝！\n\n9.4 扮演“先知与毒舌”，缺乏制度的批判性：\n李承鹏：你在人群中，叫一声“反腐败”。大家都崇敬地看着你。你又大喊“抓贪官”。人们恨不得立马找砖头行动。你继续说“首先找出贪腐的根源”。大家眼神开始迷离。你再说“用民主来监督权力”。下面就有人骂“傻逼，中国人素质低，民主就乱了，咱没啥好日子过” 。 你说“这是先进国家的经验”。原本伺候贪官的砖头砸来，骂“狗日的肯定是西方国家的走狗，是汉奸。”\n\n9.5 扮演“先知与毒舌”：\n那位痛苦的日本人说，跟某国人辩论纯属浪费时间，不要跟某國人辯論，與某國人相處，專注飲食、唱K、購物，講這類話題，最安全，你不會傷害他，他也感覺好。\n\n9.6 扮演“先知与毒舌”：\n有人说我心里阴暗，所看到的听到的都是阴暗的一面；其实，正因为我心明亮，才看得清世道黑暗的一面，才明白这世道之龌龊；我之所以抱怨，是希望变好；我之所以批判，是希望改变；只有心存光明的人，才愿意去批判和抱怨，你若无视同胞所受的苦难和社会的腐败，对一切都冷漠，你才最阴暗。——杰森斯坦森\n\n十：冷漠者的“我弱我有理”：\n你平时连转发一个常识真相的帖子都不敢，说点真话更不敢，但生病无钱医治时胆子就特别大了，敢四处求爹拜奶借钱，敢面向社会“轻松筹”【实则轻松吗】，敢卖房卖车，敢拖儿携女跪在闹市乞讨，敢公开拍卖自己处女之身，敢跳楼跳桥跳河自杀，你连死都不怕，还怕转个真相常识帖？还怕呼吁人人关注全民免费医。（作者：巧见侠）",
			"added": 1505206339
		},
		{
			"topic_id": 4,
			"title": "更灵活的时代革命",
			"body": "Flexible Way of Hong Kong Revolution\n\n更灵活的方式，如同在Hong Kong Independence前加上小号的”No to”一样。\n但是，顺着“忠君勤王”的传统腐朽思维，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤，在当前不但没有违反“伪共”“匿产帮”的所谓爱国主义思潮，而且完全是爱党爱国的正能量，非常容易促进香港和大陆之间的良好互动。\n\n\n习仲勋 恰巧反对文革暴政，习氏孽障即使再无法无天，也不敢公开污蔑维护习氏祖宗光辉的活动是违法的！",
			"added": 1594458293
		},
		{
			"topic_id": 5,
			"title": "时代革命的新方式，推翻黄俄暴政！",
			"body": "New Approach to Hong Kong Peace Revolution\n光复香港、时代革命的新方式 \n在黄俄专政制造出来的邪恶新冠病毒蔓延全球之际，文明变革势在必行！\nThe crazy Hong Kong security law is much more brutal than the mainland, Chinese version, as it not only defines physical actions, also includes “activities\" (“活动”), which may include many daily trivial activities, such as words, thoughts, discussions and communication, etc!\n\nIn order to reduce the scale of bloody massacre in the potential conflicts, some new tactic can be adopted.\n鉴于香港版版的国安法比大陆的更邪恶，把思想言语的“活动”也纳入镇压范围，为了减少大规模的流血事件，东亚地区的和平革命，可以适当融合儒家文化提倡的“忠君勤王”思想，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤。\n\n\nMany people’s mindset is still limited by the Confucius medieval theory of loyalty to the emperor. In order to reduce the scale of potential conflicts to the minimum level, the best way to launch Peace Revolution is to appeal to all Chinese people to protect the glorious history of Xi's family legacy left by Xi Zhong Xun, as Xi Zhong Xun himself supports Constitutional Democracy with freedom of speech, freedom to worship God.\n\nThe new method can help avoid the bloody massacre in the potential conflicts.\n在中国大陆，由于黄俄“伪共匿产帮”的邪恶专政，篡改历史、误导视听，目前仍然有相当一部分老百姓和军人的意识水平停留在比岳飞思想更僵化的中世纪时期的“忠君报国”之思维。\n\n不少人犯了错误判断，因为习近平的父亲习仲勋先生确实有过光辉的历史。习仲勋先生曾因为反对文化大革命的压迫而英勇奋斗，并为1980年代的改革开放做出了巨大贡献。\n\n为了减少大规模的流血事件，东亚地区的和平革命，可以适当融合儒家文化提倡的“忠君勤王”思想，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤。\n\n一些激进的口号，比如“天灭… 共”，如果还要保留，建议稍微调整为：\n“天灭伪共匿产帮、维护仲勋光辉、恢复宪政!” 等等。那种口号，不但可以减少冲突，而且大陆人士一起传播，也更方便。此举将非常有利于促进整个大陆和香港的良好互动！\n\n上述新方法，绝不是为了抹黑香港人的勇气，而是为了应对险恶时局的务实策略。\n同时说明，真正的现代文明之基石，不是表面化的民主投票、也不是五大诉求、缺一不可，而只是一个最简单的灵魂文化：\n**尊重持枪权、尊重生命**\n仅此而已。\n\n枪支的火药来源于中华文明。所以真正的中华文明，是在美国本土传承。\n在台湾，甚至还有部分韩国瑜的粉丝（韩粉）认为中国人或者台湾人都不配拥有持枪权，那种思维是在侮辱诞生火药发明的中华文化，绝不可取！\n\n香港人的最终追求不应停留在民主选举的表面操作，而是建立一套完整的\n尊重持枪权、尊重生命 的法治体系。\n\n真理很宝贵，因为被很多假象掩盖。一些政客只提“人权”的普世价值，却不提\n尊重持枪权、尊重生命 的普世原则，所以政客们的表演往往很容易背叛舞台上面的漂亮口号，而这也是美国宪法关于持枪权修正案的永恒生命力之所在！\n\n尊重持枪权、尊重生命 的普世原则，属于神圣的追求，通过持枪权规范，把世俗层面的人权和尊重生命的“神圣”宗教态度融合在一起，超越了任何物质层面的科技创新。因为它非常宝贵，所以经常被政客们制造出各种假象所掩盖。\n\n只要这个普世原则存在，美国就具有永恒的生命力，而中华文明也不会消失！\n\n备注：\n把目标从“中共”改为“伪共匿产帮”，部分年轻人可能觉得有点怪异。顺便说明一下，彻头彻尾的、绝对意义上的“无神论”信徒是不存在的，只要他不敢否认有“精神”存在，那么他就无法否认每个人的“精神”空间里都存在着或多或少的“神圣”的情感 — 这种“神圣”的情感，无论是在工作层面的，还是生活层面的，总是伴随着每个生命。 而只要有“神圣”的精神空间存在，就有“神灵”的属性存在于他的精神空间。 对于这一点，共产主义的鼻祖马克思非常雄辩，但也犯错误，即使他不信上帝，而是信仰撒旦魔鬼，撒旦魔鬼也仍然属于邪恶色彩的“神灵”，与“无神论”是自相矛盾的。\n\n所以，在中国大陆，至少在中南海，那些连官僚财产都不敢公开的所谓“共党”根本就不配习仲勋那样的“共产主义“信徒之类的称呼，更准确的叫法应该是“伪共匿产帮”。\n把目标对准一小撮“伪共匿产帮”，而不是囊括数千万基层党员的“共党”，既有应对时局险恶的现实考量，更是严谨的科学分析方法。这方面，请大家仔细思考，再付诸实行。\n如此区分，可以清晰地把囊括数千万基层党员的“共党”，与一小撮“伪共匿产帮”完全区分开来。\n采纳严谨的科学分析方法，可以让严峻而复杂的问题显得更简单一些，尽量减少大规模的冲突。\n\n随着港版国安法的进一步推动，会有更多“五毛党”涌入香港。那些偏激的“五毛党”们往往以特别的“爱国主义”腔调，非常狂热地宣传“热爱祖国”、“热爱领袖”之类的话题。对于那些“五毛党”们，尽量避免浪费口舌跟他们争论，相反，可以顺着他们的思维，既然他们的“祖国”、“领袖”是那么地伟大、光荣、正确，那就非常应该推行持枪权保护真理的原则，去维护伟大的领袖、伟大的祖国。\n\n\n类似的道理，台湾一些韩国瑜的粉丝（韩粉）们如果一直强调“统一祖国”的伟大和急迫，那么，为了保护伟大的“统一祖国”事业，大家都应该支持持枪权保护真理的原则，去保护伟大的“统一”真理。\n…………………………………………………………………………………\nChinese Doctor Lee Wen Liang’s tragedy proves that if there's no freedom of speech or to worship God in East Asia, there's no freedom of breath in Europe and America!\n如果东亚无法自由说话、信仰基督，欧美也甭想自由呼吸！\n\nThere's a huge number of population on the vast land of China, among whom quite some people are still brainwashed by the atheism regime. The Peace Revolution in China will be a little different from other countries.\n\nTraditional Confucius culture often emphasizes loyalty to the country (to the emperor in the past).  Many people made mistakes to support CCP leader Xi Jin Ping, due to their respect of Xi Jin Ping’s father Xi Zhong Xun who did fight bravely against the Oppression by the Atheism Regime itself, and for the Reform and Opening revolution in the 1980's. \n\nIn short, Peace Revolution in the name of protection of Emperor Xi’s glorious family legacy can avoid the bloody massacre in the potential conflicts, since many military people’s mindset is still limited by medieval Confucius loyalty.",
			"added": 1594459850
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 1,
				"body": "一些网友深入分析发现，这也不叫“离间计”。“离间计”之类的东西，属于居心险恶的谋略。居心险恶的谋略，无论是阳谋，还是阴谋，都难以正大光明地推广。毛氏文革当年自称为“阳谋”，但是也仅限于在支那专政的大陆沦陷区里进行，因为老毛很清楚：无法无天的“文革”是无法推广到文明世界的。\n郭文贵目前的策略属于光明正大的公开策略，一方面痛骂支那蛆虫帮、粪坑党；另一方面却歌颂蛆虫帮的党魁是千年圣君，这种态度是非常强烈地提醒良心尚未泯灭的人们，应当公开地与“伪共”匿产帮、粪坑党切割开来。习近平如果不想继续玷污习仲勋曾经有过的光环，如果他不是白痴，应当懂得切割开来。他的智商到底有多高，是否如同网友们所担心的那样，如同阿Q草包那样？这是一个值得深入探讨的问题。",
				"added": 1503201151
			}
		],
		"1_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 2,
				"body": "文贵带动更多人加入爆料革命，自由中国平台也起来了！",
				"added": 1520958154
			}
		],
		"1_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 3,
				"body": "目前是论战，不像诉讼战。",
				"added": 1521433888
			}
		],
		"2_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 4,
				"body": "Currently the percentage of people in China who have been awakened up is about 15%. However, due to the notorious GFW, the huge number of people can't organize up as effectively as in Hong Kong. So the special tactics will help with both the revolution campaign and  presidential campaign for Donald Trump ...",
				"added": 1599892729
			}
		]
	},
	"comment_vote": {}
}