{
	"next_comment_id": 8,
	"user_name": "Quantumworld",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1543612305": 1543775752,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1544317246": 1544638743,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1545854503": 1545983479,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1548861490": 1548903375
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Wow your blog is about as advanced or even better than one that I could make.  Ok since this site it open source there has to be a way to (borrow html code ) that would make a blog look fantastic. And dont tell me I need to edit html code in vi or some other lame text editor to make it happen. Isn't there some cute cuddly gui template thing that would keep me from re learning html? \n\n(HTML is just an advanced FORTRAN lang on steroids.) ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1543612305",
			"date_added": 1543730118
		},
		{
			"comment_id": 2,
			"body": "@caryoscelus: Ok get ready to vomit. I am looking for a wordpress like interface to stream line posting and not get burred in html. Coding it all custom and manual is tedious, repetitive and over all a giant pain in the rear. There has to be something that has been made that can do the job or it can be modified to do the job. Zeronet wont get many sites on here if it is a giant pain to code one. I would feel almost more comfortable coding a site in lisp rather than html at this point. I also use the emacs operating system from time to time. They call it a text editor but I know better. lol",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1543612305",
			"date_added": 1543738625
		},
		{
			"comment_id": 3,
			"body": "@caryoscelus: I will give it a try soon. You can all laugh at it when it is done. I guess you got to start somewhere. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1543612305",
			"date_added": 1543775885
		},
		{
			"comment_id": 4,
			"body": "That looks to me like an undocumented bug to a compiler program that returns the results you want but it went though an error state to get to the results.  (But what do I know)\nSoftware coding using schematics might be interesting.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1545854503",
			"date_added": 1545983646
		},
		{
			"comment_id": 5,
			"body": "@leftside: Sometimes it gets better. But never by the first run of electronics. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1548759072",
			"date_added": 1548787686
		},
		{
			"comment_id": 6,
			"body": "@caryoscelus: Never ever do the upgrade option for a full version update. I have tested this over and over with multiple Linux distributions. They all have issues with them. I wish it was not this way but it all goes back to version numbers and dependencies. And the Linux sound needs serous work done on it still. Like adding a treble and base. If anything that needs a total rewrite its the Linux sound software. There is no reason why Linux should not be at the cutting edge of desktop sound. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1548734695",
			"date_added": 1548789661
		},
		{
			"comment_id": 7,
			"body": "I had the same problem. Is Emacs a text editor or an operating system. I am still confused with this question today.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1557249060",
			"date_added": 1557271513
		}
	]
}