{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1633965085,
			"title": "**FREE** Knowledge - Knowledge NEEDS to be free",
			"body": "Hello. Anyone way smarter than me able to help me make a site where anyone and everyone can upload pdf books, audiobooks, and links to book or audio books?? I would like to make a free library of content that is fully decentralized so as to avoid nazi book burners forever. I want to keep away from videos and other media cuz its heavy storage. but book, audio, and links are light. So yeah anyone able to help me with this and agrees with it lets make it happen. For example im learning cyber security so i have all these.... https://start.me/p/7kRmGE/links-to-share",
			"added": 1633965084
		}
	],
	"topic_vote": {
		"1632345620_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1632345620_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": [
			{
				"comment_id": 1,
				"body": "I would be cool with it. Its just like cash really but with you having to do extra work to get the assets you really want. The company is asking you to do this cuz USDT is a stable coin. This way they deposit money into an exchange and simply transfer it globally without worrying about volatility in the market. But... I you find yourself in a posistion where you have the ability to decide other payments. Then personally i would consider NANO over btc. I buy ASSETS not junk! And NANO is 100% far superior to BTC in every way. Its also free and instant transfers whereas BTC has mining costs.\n\nWhen your talking about hosting companies if this is what your doing then i HIGHLY HIGHLY HIGHLY recommend that you accept payment in crypto!! Cuz i have personally search for such services in the past. So there is totally a market looking for this service.",
				"added": 1632346777
			},
			{
				"comment_id": 3,
				"body": "> [poutre](#comment_11_187XJ7rohVms73dqM2XftFNLuASoeTMU4X): I've been always getting paid in crypto (BTC), i started 2 months ago with them.They're offering the USDT option recenlty but they've not pressed me to accept it, it's a second crypto option (BTC/USDT).So yeah, no NANO either obviously.. i would've probably taken it too. Maybe if i try exchanges (buy/sell things, with a fee obviously) [...]\n\nAhh I see your the buyer not the seller. Ok. Then in that case its really just up to you. BTC would be the easiest since everyone accepts it. But my fear is that you will be paying in BTC giving up your precious btc holding and then the price goes up and they make even more off you. If they are showing Tether/USDT as crypto options. DO IT its much better for you that way. Only thing is idk what its like on your end being European and the exchanges you all use if they have a USDT pair or not. If they do go for it",
				"added": 1632348686
			}
		],
		"1632343427_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda": [
			{
				"comment_id": 2,
				"body": "whats your reasoning to fork??",
				"added": 1632347129
			}
		]
	},
	"comment_vote": {
		"11_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": 1
	}
}