{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1580943879,
			"title": "Archived Metokur streams on Kopykate (AWOOFLU EDITION)",
			"body": "I'm archiving Metokur's Corona streams before Wosjcshniak deletes them from Youtube.\n\n[Mister Metokur: Wu Flu - It's Just A Cold Bro Edition (Jan 25, 2020)](/big.kopykate.bit/?Video=1580168765_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Wu Wu Goes The Achoo Train (Jan 29, 2020)](/big.kopykate.bit/?Video=1580942801_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Peak-a-Wu: I Sneeze On You (Feb 2, 2020)](/big.kopykate.bit/?Video=1580942929_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Celebrating and Incubating Stream (Feb 7, 2020)](/big.kopykate.bit/?Video=1581116912_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: It's Just A WuFlu Bro (Feb 16, 2020)](/big.kopykate.bit/?Video=1582467649_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Getting A Bit Batty (Feb 22, 2020)](/big.kopykate.bit/?Video=1582467905_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: This Empty Bun Is A Nothing Burger (Feb 25, 2020)](/big.kopykate.bit/?Video=1582764813_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: The Red Coast (Feb 29, 2020)](/big.kopykate.bit/?Video=1583411463_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Dipmageddon (March 9, 2020)](/big.kopykate.bit/?Video=1583850620_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[The Killstream: Metokur vs Masterson (March 19, 2020)](/big.kopykate.bit/?Video=1584840668_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Month Three and Counting (March 27, 2020)](/big.kopykate.bit/?Video=1585438479_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n\nHumor is the best disinfectant against the awooful chinese batflu, so get your dose now.",
			"added": 1580943878
		},
		{
			"topic_id": 1595502249,
			"title": "10 Questions for the Woke",
			"body": "1. A pre-op transwoman goes to a waxing salon owned by a muslim woman who is religiously against sharing intimate space with a man. The transwoman demands to have a full body wax. The muslim woman refuses. Who is in the wrong? If you were a judge over the discrimination lawsuit, what would your ruling be?\n\n2. If congress was 50% cis-men and 50% trans women (MtF), would you agree that it had a good gender balance?\n\n3. Today, the City of Berkeley voted to halve the police budget. If you could examine any data from Berkeley in one year's time, what data would you examine to assess if this decision was good or bad?\n\n4. If the criminal justice system in the USA is so racist, why do asians get incarcerated less than whites?\n\n5. BLM says that the disproportionate incarceration and police killings of blacks is evidence of racism. Do you think that the disproportionate incarceration and police killings of men is evidence of sexism? Why?\n\n6. A women's 100-meter sprint race is held. The three finalists will receive a full-ride scholarship to a prestigious university, worth hundreds of thousands of dollars. All three winners are pre-op transgirls. The 4th, 5th, and 6th place are cis-girls. They file a complaint. Are they transphobes?\n\n7. The NBA is majority black. Do you think this is evidence of racism among coaches? Most software companies are majority white. Do you think this is evidence of racism among tech CEOs? Explain your answer.\n\n8. Black people tend to do poorly in standardized tests compared to the national average. BLM says this is because of racism. Why do Asians do better on standardized tests compared to the national average?\n\n9. BLM often says that the reason that black people commit half the violent crimes in the USA despite being about 13% of the population is because of our history of slavery and discrimination. However, black people in countries without slavery like Sweden or Japan have similar violent crime rates to US blacks. Why do you think this is?\n\n10. In the 1960’s, the NY Philharmonic introduced blind auditions to select its musicians (the musician was hidden from view). The gender ratio went from 3% women to almost 50% women. Today, they are considering removing blind auditions because of a lack in racial diversity. Which system do you believe is more fair: blind or open auditions? Why?",
			"added": 1595502247
		},
		{
			"topic_id": 1597857981,
			"title": "Media Insinuates White Doctors Kill Black Babies. Are They Trying To Start a Race War?",
			"body": "# CNN: \"Black newborns 3 times more likely to die when looked after by White doctors\"\n\n[Archive](https://web.archive.org/web/20200819082031/https://edition.cnn.com/2020/08/18/health/black-babies-mortality-rate-doctors-study-wellness-scli-intl/index.html) [CNN](https://edition.cnn.com/2020/08/18/health/black-babies-mortality-rate-doctors-study-wellness-scli-intl/index.html)\n\nI wonder if serious cases disproportionately get redirected to white doctors because specialized doctors are more likely to be white or asian, skewing the mortality rate.",
			"added": 1597857978
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1580943879_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 1,
				"body": "> [rannulfr](#comment_37_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Please upload to IFS. [...]\n\nForgive my newfaggotry, but what makes IFS better place to host video?",
				"added": 1581024756
			},
			{
				"comment_id": 2,
				"body": "[Mister Metokur: It's Just A WuFlu Bro (Feb 16, 2020)](/big.kopykate.bit/?Video=1582467649_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)\n[Mister Metokur: Getting A Bit Batty (Feb 22, 2020)](http://localhost:43110/big.kopykate.bit/?Video=1582467905_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)",
				"added": 1582469957
			},
			{
				"comment_id": 3,
				"body": "Three months and still going strong, so proud of our lil Corona-chan.\n[Mister Metokur: Month Three and Counting (March 27, 2020)](/big.kopykate.bit/?Video=1585438479_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7)",
				"added": 1585439416
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 4,
				"body": "The rich elite don't want us to stand together or to separate. They want to force diversity on us so we end up fighting each other instead of against them. Look up the Amazon leak, they literally researched how to divide and conquer their own workers to prevent unionizing and discovered forced diversity was an effective strategy.",
				"added": 1591041562
			}
		]
	},
	"comment_vote": {}
}