{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1617870617,
			"title": "This fucking autist of von der leyden...",
			"body": "I loved the belgian guy reaction, specially is leg spreading (was it slippery)?\n\nWhy, because it's 100% natural... I have my theory on the french speaking belgian people...\n\nin the sense they are... not very smart, but 100% natural and funny !\n\nand this sequence like the french talking head love to say illustrate the divide with some germans...\n\nyou fucking bitch, what do you wait to seat on this fucking sofa?\n\nwhat ?\n\nseat and stfu or ideally go back to your kitchen.\n\nwhat have you done with your mama merkel regarding the countless rapes in GERMANY in so called peace time?\n\nahhh going to suck the cock of the sultan, because there are too many turks in germany?\n\ngermany, the land of the blueprint 1.0 in extermination dominated by turks?\n\ncensoring us for this?\n\nyour little judicial take over to cloack and defend your invasion of europe, your destruction of national identities?\n\ngo fuck yourself with your past...\n\ndon't impose your mistake on others.\n\nso go belgians !\n\nand this fucking whole setting was approved, 0 fault on turkish side... nothing.\n\nwhat a big sofa ! what do you want more? a throne dwarf?\n\nthat's waht I hate with insecure western feminists, what the fuck, did you see vlad sec team in south africa?\n\nyes, the guy, when a little stressed out?\n\nyou think that when samurai assassin stand off, females or bystanders.... you are in the line you die... \n\nwhat the other assassin moved behind you, smart, you got slashed too, bohhhoooo\n\nmore sakay !",
			"added": 1617870616
		},
		{
			"topic_id": 1617871050,
			"title": "[MEGA POST] Biological warfare",
			"body": "so right now in brazil, they say... blah blah.\n\nwho the fuck knows\n\ntime for the asian biological team to investigate !\n\nin the sense the pedo feudalist GSA (guide stone agenda) seek to depopulate\n\nchildren are next (or not, but 500'000'000) so I let you do the mafff...\n\nso if something nasty is brewing in brazil,. I heard all the close china etc...\n\nso why is brazil still exporting people?\n\nbut again, it maybe just nothing...\n\nIDK.\n\nwe don't have data anyway...\n\nall is screwed by the various agenda (UNO, make WHO the world health ministy, GSA : depopulate, Noaid laws, what ever it is, fight against bolsonaro) etc etc... economic blah blah...\n\ndemocratic society have no meaning without a free press and UNRESTRICTED FREE SPEECH...\n\nfor example I hope that the CCP bio warfare divisions are clearly following the situation... and they do... by the result. \n\nthe ccp is so result oriented...\n\nhow otherwise maintain such an immense central administrative state?\n\nby ideologies (narrative)?\n\nnever worked\n\ndeeds.\n\nwhat the west has fogotten...\n\ntoo much marketing, PR firm, perception managers and others spinners and narrative builders... goebbelites...",
			"added": 1617871048
		}
	],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1617745493_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Plead the Fifth (Amendment)\n1. To refuse to testify against oneself in court, in accordance with the rights guaranteed by the Fifth Amendment to the United States Constitution. The alleged kingpin of the east coast drug cartel simply pled the Fifth after every question the prosecution put to him.\n2. By extension, to refuse to answer a question or provide information, especially if doing so may incriminate or embarrass oneself. Just plead the Fifth if your mom asks where you've been all night! A: \"So, I hear things got pretty messy at the bar last night.\" B: \"Yeah, I'm going to have to plead the Fifth Amendment on that one!\"\n\nThen I don't remember or \n\nI don't recall\n\nand better\n\nI feel sick / tired / hungry, and can't concentrate on your questions.\n\nI need medical attention\n\nwhere is my lawyer?\n\nbut the day we can round up all fbi agents and kill them all will be a great day... all.",
				"added": 1617775559
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": ">target practice.\n\nexactly what they are ! at least the Myanmar people fight... (I don't say rightly so, but they fight, not like the goyim who even let their kids be raped with full on impunity on little st. james island).\n\nconspiracy theories? we need new ones as all the old ones (the real, not the fake \"trust the plan\") have been proven true :).",
				"added": 1617775683
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": "In God We Trust.",
				"added": 1617775706
			}
		],
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 4,
				"body": "I do too believe to have way more free speech in china than anywhere in the west.\n\nOne I believe that you can say anything in China, but with the proper forms.\n\nFor example, rather than go in the street about a perceived corrupt official in a city, it's way simpler to inform Beijing discretely about the situation and let the process follow it's course.\n\nFurthermore, for me the fundamental difference is the law, in the sense that in China there are laws, regulating the whole, not like in the usa...\n\nIn practice, Weibo follows state orders, and in the usa the us federal gov follows twitter and co orders.\n\nFundamentally it comes to the fact that CCP are Chinese Patriots seeking better days for China as a nation, meanwhile in the west, it's constant betrayal for various ideologies, from pedophilia, to serfdom, to a global one world gov, to what ever new idea will infect the mind, but it will be everything, but the bill of rights.\n\nwhat's cool, captain404, is that you don't have the mean to use violence against CCP to change it to the way you see it to have to be.",
				"added": 1617776027
			},
			{
				"comment_id": 5,
				"body": "> [captain404](#comment_35_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): i see your pov but it s really stupid. why believe you have free speech in a countr ywho ban winie the pooh cause xi wasnt finding it funny. u never adress any of my take on whyu dont have freedom of speech. Stil u just write your nonsense. Just go in china with winie the pooh material and some stuff like tianemen square and i can promize u can t even enter or never can t left will depend of your  nationality\n\nI think you really don't understand what I think. You want to go into details?\n\nI believe that winnie the pooh is a great anime and book serie for children. I like the tiger, the donkey and the pig, and of course the honey lover.\n\nHowever, it was another attack on the stability of China.\n\nAnd that's where you will be surprised\n\nof the unrestricted approach to war that people like you will face.\n\nWe will never surrender China.\n\nThere are 800'000'000 Hans, 600'000'000 other \"tribes\" (at this scale).\n\nAnd if you think, the people you represent, will ever rule China, you will face extinction before we do.\n\nWe will fight as 1, on all fronts you wish to create, and win them all.\n\nSo Winnie, was used to create a false image of Xijing Ping. \n\nWinnie will return... rest assured.\n\nTienanmen, HK, Tibet, Xinjang, Fallun Gung have all been plot by the western pedofeodalist colonialist forces to try to create instability inside China, for them to try to create weakness, to attempt another of their futile take over.\n\nFor now, CCP has been able to counter all those threats.\n\nHowever, at one point, it will be appropriate to COUNTER STRIKE.\n\nI don't expect your understanding of the Laws of War to be uptodate.\n\nOtherwise, you would be for REAL free speech, not political polemics decoys, and would clearly seek a true path of peace, or coexistence, as explained by trump in the concept of constellation of nation.\n\nConcept necessary for our financial interests, so that when a star falters, another can be born.\n\nfor your objectives, you will have to defeat, the Eastern, Western, Northern, Southern and Central Chinese Army(ies) Command...\n\nI wish you fun and luck, you will need both, before dying.\n\nIf you believe that a 5000 years continuous civilization will be defeated by your kinds, who have just taken over the west, you will be awaken by death.\n\nwords... pfff.",
				"added": 1617865920
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 6,
				"body": "> [mxh69420](#comment_94_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): i would. as bad as nazis are, nobody should have their opinions silenced. if nazis say \"kill jews\", we should say \"no\" instead of silencing them. let people think for themselves damn it. [...]\n\nThanks for explaining your point of view. I agree with you, but have to differentiate two situation.\n\n1. pre war. In this case no problem, they say what they want, and the better argument wins, in a fully uncensored space, aka you can say too kill the nazis (and argument it), fair.\n\n2. war, in this case the nazis are only allowed free speech in the area they control, and as soon as they lose them they die, as the others forces.\n\nNow my opinion, or of anyone with still a brain, is that all the american msn networks are enemy combatants and that we are at war with them. As such it's only natural that they are hunted down and executed.\n\nI understand your reticences in kill their children, in some kind of whiteknight fashion. I disagree.\n\nFirst, the american and western at large so called free press, was for example in the case of france, killed during ww1. Exactly, it's when Parisian reporters decided to visit for themselves the front lines of ww1. And where shocked by the cheer stupidity and massacre that french troops endured.\n\nFollowing their return to Paris, the french army / state, decided to impose \"the censorship\". Since then, I am not aware of very large media organization, working as the American Founders envisionned, and or according as the 4th pillar of the american republic, as the medias love to portray themselves.\n\nWe are reaching 20 years of occupation in afghanistan, almost the same in iraq, we still don't know what happen on 911. janet yellen gets 7 millions as speaking fees, or why ben bernanke moved everyone on variable mortgage rate before exploding the interests rate on those contracts, we still have no justice regarding pedogate with epstein (or only 1 arrest with weinstein) while they gazlight us on floyd (while briana taylor or the girl from flint michigan are censored). Not a single word on therapeutics regarding covid, even basics like nutritional imbalance or vit.c or garlic.\nDo I need to mention, the bitleashed email of hitlary, benghazi, or the spread of GMO and EMF pollution? Or maybe the events surrounding nov. 4th 2020, with the full on election theft from pedotrump? A word on AG Barr or secretary Acosta or maybe Conway friendships, maybe roger stone ones?\n\nIf you want to perish for an ideology your free to do so. For now, in this regard the situation is fully in control in PRC. bring your legions if you wish, but if already you can't defeat your own ideologies or simple pedos, what chances do you really have, in the unrestricted fields of war? very little, and less at each passing day.\n\nThank you for your message,\n\nand yes their kiddos die, so that the cost of the betrayals of those press, is clear and makes a great history, when we the people said enough with the betrayals (nohaid laws, uno / global agendas , charter / or the GSA (guide stone agenda, population reduction, white genocide / or the feodal pedo rule). And killing their offspring, as unjust as it may appears, is to be weighted by the fact that those MSNers sought to kill OURS. \n\nwe bring equality, the hard way. I understand that the question of killing their children, may still be open, but them, is undebatable.",
				"added": 1617866737
			}
		],
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [
			{
				"comment_id": 7,
				"body": "booohooo boohhhoooo... only PC speak, UNO charter / agenda approved, GSA (guide stone agenda) and or pedoempire... bohhhooooo booohooooo....\n\ngo try to censor the Chinese Hordes (so called netizens...)... goo you will be fragged by the millions if you dared...\n\nPLA 4 Eva !",
				"added": 1617866822
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 8,
				"body": "> [mxh69420](#comment_89_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): dont worry about crazy tech like that. just train with your friends, and if the government comes for your guns, fight back. people that lose these fights are almost always alone. when the british came for ours in 1776 (shot heard round the world), we won even though we had no training because we outnumbered them greatly. but with just a little bit of training and a few friends, you can take on whoever they send. [...]\n\nSure. my biggest strategy, is battlefield inversion. Meaning that the state officials who attack us and our god given right must be targeted at the family level.\n\nI mean, it's useless to go nigga / blm in the street to protest to be mow down by apaches / drones.\n\nIt's sometime important to let a fallen hero, fall, to then follow, track his executioners (state operators) and kill them and their families in their homes...\n\ncivil war is a continuous business... no down play, play time, family time specially for the other side.\n\ntheir reactions will be bunker life (or as in all 3rd world nations, isolation from the people) and as such create, certainly more violence, but more space too.\n\nFor example right now former AG Barr is a soft target to \"solve\" pedogate, meaning inflicting cost on the other side.\n\nin 1775 the physical, moral, nutrional base level of the \"rat tags\" was way higher, furthermore, the arm asymmetry wasn't that high (apaches vs ar15).\n\nModern insurgency is something very very violent, specially when you had the professionnal teams from foreign nations into the mix. It involved BLS4, nuke plants and scorch earth.\n\nYou think it's ala madmax or some kind of romantized version of 1776... \n\nlighter is yacht killing, tactical death squad on soft individual target, etc...",
				"added": 1617867281
			},
			{
				"comment_id": 13,
				"body": "and the daughter of former AG Barr is even a softer target... but current americans are fishes in a ball...",
				"added": 1617869278
			},
			{
				"comment_id": 14,
				"body": "and that really expose the whole validity of this really last resort way of war (how to get worse?).",
				"added": 1617869323
			},
			{
				"comment_id": 15,
				"body": "the feeding strategy... where ag barr must eat his own daughter, shit her, be interviewed (to know how he fells) and then executed or kept alive as trophy, proof of loss.",
				"added": 1617869370
			},
			{
				"comment_id": 16,
				"body": "just for info : if american people can raise up, capture the domestic enemies, force feed them their offspring, who in the world will dare to attack america in the foreseeable future?\n\ncannibals !!!",
				"added": 1617869460
			}
		],
		"1617373305_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 9,
				"body": "> [ixp](#comment_2_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX): Why does everyone on the decentralized net or any privacy respecting protocol always either a socialist or an \"orange man bad\" repeating NPC\n\nbecause they are paid for that. it's part of the narrative building system, they try to create a feeling of overwhelming support for their causes.\n\ndon't get fooled. we are more than them, specially when we will have killed them.\n\nit's a war. this is only the information part of it.",
				"added": 1617867494
			},
			{
				"comment_id": 10,
				"body": "trump is a pedo : acosta, barr, roger stone... trump plan in exposing epstein way early was to try to save his skin, after he fought epstein about who would rape a girl first, which epstein did, which enraged trump, who then banned epstein from his club and tried to smear him to protect himself, and his \"friends\".\n\nLOCK HER UP we chanted... what did we got?",
				"added": 1617867592
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 11,
				"body": "> [mxh69420](#comment_84_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): ra ra rasputin\n\nexactly... very weak... or resaid, the time will inevitably come to go to the bottom of the rabbit hole regarding ukraine...\n\nI explain...\n\nq: zelinsky jewish?\n\nokay...\n\nPoroshenko, pedo provider?\n\nokay...\n\n2 true\n\nlet's check one :\n\nhttps://www.nytimes.com/2019/04/24/world/europe/volodomyr-zelensky-ukraine-jewish-president.html\n\nokay...\n\nso imho we aren't fighting the haredim there... those who want to be left alone, to live in prosperity, love and harmony the way of life of their ancestors...\n\nno\n\nwe fight the axis : nethanyahoo (and all those like him, like ehud barack) - nudeland - and the pedos - noahid law...\n\nlittle warning, you nohaid law, some part may be welcome at this stage of the march in china, however if you think that by anyway you will be able to impose those unwanted, you are going again to face... rome was kind... \n\nall those words to say what? \n\nMaybe the real front line of the ukrainian conlict isn't over ukrainian soil, but Tel Aviv.\n\nremember black cube? maxwell? those who never pay a cost for their cimes, uss liberty, will scale... until our counter strike may become so yuge that the whole haredim population of the world, just become a collateral damage...\n\nremember, as a sheep herd, when you see wolves walking on sheep clothes it may be time to warn, the sheep dogs, other wise, it may be time to unleash the raptors and wipe the whole, sheepdogs, wolves, and sheeps.\n\nmaybe the next herd will be smarter and wiser, specially when seeing the fields of death :).\n\nit's again important to let all ideologies fall (done)\n\nbut equally any past experience, it's not because those haredim in putin youth were exceptional, that some of the nudeland clan may not wear haredim clothes, and even \"pray 5 time at the mosk per day\"....\n\nI don't believe that Tsarnaiev would be fucked like this, or played, or abused, or manipulated, or even threaten...\n\nI don't really understnad what it implies, but there is a french saying : the goat and the califlower... (or choux), you can't have both.\n\nand that's often the problem with over ambitious plan\n\nFurthermore, I am clearly feed up to always play a defensive role in those war against the western pedo feodalists forces...\n\noffensive nuking, as a certainy way to bring equity and calm to the battle field... \n\nif they need to live \"pure contact\" so be it.\n\na little warning to the enemies of CHINA...\n\nUNRESTRICTED WARFARE.\n\nbeyond all you can imagine.\n\nplease for your own safety, think twice.\n\nwe have, and way more.",
				"added": 1617868304
			},
			{
				"comment_id": 12,
				"body": "Force sell the stake of quatar in rosnef, they are OUR ENEMIES.\n\nagain too blind to see it...",
				"added": 1617868462
			}
		],
		"1616102046_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 17,
				"body": "Who doesn't want to be free?",
				"added": 1617871182
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 18,
				"body": "Myself I believe there is a nasty gang there, using zionism as a cover for their nefarious deeds in the world... maxwell/epstein or all the federal reserve chairman jewish or the ukrainian situation... \n\nI am curious what do you think of the noahid laws?\n\nfor example I hate laura loomer, this whore, defended by alexjones, supported the censorship laws against so called antisemitism, laws who have morphed to encompass anything critical to their objectives, to even censor pedotrump...\n\nI mean....\n\nwhat the fuck !",
				"added": 1617871363
			}
		],
		"1617821909_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "why not use zeronet network as another communication layer for cryptos rather than whine toward those who raped kids with impunity?\n\nyou don't accept that you are under occupation, too exceptional for that I guess?",
				"added": 1617871459
			}
		]
	},
	"comment_vote": {}
}