{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [splitfire](#comment_145_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): и везде один и тот же коммент \"ахах, изобрели фидо/фринет\"\n\nА что? Разве нет? Сайты это ФЭХИ )))",
				"added": 1457539810
			},
			{
				"comment_id": 2,
				"body": "Сайты я так понял скачиваются полностью или только просмотренные посетителем страницы?",
				"added": 1457540637
			},
			{
				"comment_id": 6,
				"body": "Вопрос на засыпку... Допустим я сделаю какой-то зайт, используя некий API 0NET. Где гарантия что API не измениться так что зайт перестанет работать?",
				"added": 1457805691
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 3,
				"body": "> [kostanew](#comment_42_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А asm.js? Так же, я полагаю, что если что то очень важное неспособно работать на смартфонах или даже IoT, Embedded, то технология умрет...\nнеее... не катит, нужен небуфиризированный доступ к диску как минимум, наоборот если делать на с/с++ можно будет в IoT юзать, для любых процов есть с/с++ компиляторы, а вот интерпретатор того же js под экзотический процессор и ос должен кто-то ещё сделать.",
				"added": 1457618767
			},
			{
				"comment_id": 4,
				"body": "> [cypher](#comment_11_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): А сфинкс или его аналоги откуда возьмется, если сайты распределенные? Не на джаваскрипте же его писать.\nПоэтому я и пишу... должна быть некая свобода для разработчиков и не только в плане контента.\n\n> Если это технология, причем с открытым доступом для всех, то какая же это монополия? По моему распределенная база данных - это единственный способ сделать полнотекстовый поиск по сети zeronet.\n\nчто толку от открытых исходников если всё равно есть человек который будет делать сборки для пользователей и включать в них то что сам единолично посчитает нужным? и все будут юзать дефолтовый поиск потому что он ... Кто потом будет изменять ядро так что бы в него технически можно было встроить другой поиск?\n\nГугл у нас уже есть )",
				"added": 1457625823
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 5,
				"body": "Я считаю вообще следует как-то совершенствовать систему доставки контента",
				"added": 1457634401
			}
		]
	},
	"comment_vote": {}
}