{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1524280296,
			"title": "So, what alternatives you choose for Facebook? Is an open-source social-network app possible?",
			"body": "I just wonder whether there's a mature app or service as an alternatives for facebook.\nWhat do you guys use after you delete facebook? Telegram & Twitter are slightly different from my perspective.\nIs there a open source alternative which integrates both IM and friends' news (like twitter)? Is it possible?\nI'd appreciate your suggests.",
			"added": 1524280295
		},
		{
			"topic_id": 1526547938,
			"title": "How to achieve global (or partial) dark theme in firefox? only with open source extensions.",
			"body": "White Facebook is so stupid and so are many other websites. \n\n[This dark theme web extension is so good!](https://darknightmode.com/) \n\nIt suits me well as it works for nearly all websites which I want to change into dark theme. (like the startpage, searx; as well as the fxxking facebook, fxxking wechat and fxxking google). It also has an extension for firefox.\n\nBut out of privacy concern, I remove it, and wonder whether there is a more transparent alternative for firefox? Like some source codes in tamper monkey?",
			"added": 1526547936
		},
		{
			"topic_id": 1528116214,
			"title": "ZeroNet Tor permission error",
			"body": "After last Manjaro(Arch) update, my **Zeronet** can't read `/var/lib/tor/control_auth_cookie` and show a **Tor error**.\nI'm sure that I set permission right in `torrc`, since the 3 days before, it works well with tor.\n \nNow I can't get the permission to read `/var/lib/tor/control_auth_cookie` as user `zeronet`, even after I set\n```\nControlPort 9051\nDataDirectoryGroupReadable 1\nCookieAuthentication 1\nCookieAuthFileGroupReadable 1\nCookieAuthFile /var/lib/tor/control_auth_cookie\n```\nin `/etc/tor/torrc` [as archwiki said](https://wiki.archlinux.org/index.php/ZeroNet)\nAny one has the same problem?",
			"added": 1528116211
		},
		{
			"topic_id": 1530276992,
			"title": "Free and Unlimited Mobile Data Traffic with Traffic-Data Obfuscate?",
			"body": "Hey, everyone here.\nCan I obfuscate all my mobile data traffic to pretend that they are sent to a specific host which you have free and unlimited traffic access? like hosts or offical websites hosted by those ISP?\n\nIn China we sometimes do it as a side-effect of bypassing Great firewall with our server and client. And it does work with the traffic proxy with TCP obfuscate to ISP's hosts.\n\nWill it work in US.? Or your ISP have unlimited mobile traffic data by nature?",
			"added": 1530276988
		}
	],
	"topic_vote": {
		"1524280296_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": 1,
		"1522450733_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"1524414787_19zcg1P4bhHh2EaMAKYKJGWXQ53bxAq3Pw": 1
	},
	"next_comment_id": 38,
	"comment": {
		"1522702726_1CdD6UNaXmQLtyQJoi4o2gFwnHMmrMRHgy": [
			{
				"comment_id": 1,
				"body": "Emmmm Great. I will further check it after leaving office.",
				"added": 1522737136
			}
		],
		"1522933439_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "Yeah. Let's make ZeroNet Great Again!",
				"added": 1522940127
			}
		],
		"1523223976_1HR8rARGfHybpYKvFC9SSYM2bxvNWNnHB7": [
			{
				"comment_id": 3,
				"body": "A good Intro. Though I have known about Intel backdoor, Spectre and Meltdown, I've not seen such a blog that talks about how to avoid it. Thus thanks for your suggestion.\nBTW, is the laptop \"TERES-A64-BLACK\" in your link5 a appropriate linux PC for students? I mean, can I manually assemble it even though I haven't known too much about computer hardware? I am a master student switching from Econ to CS.",
				"added": 1523274980
			}
		],
		"1523299159_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": [
			{
				"comment_id": 4,
				"body": "Try aircrack-ng ?\nhttps://www.aircrack-ng.org/doku.php?id=cracking_wpa\nI followed this guide and successfully hacked one's wifi password. I still remember its password of \"nostalgia\"",
				"added": 1523327070
			}
		],
		"1523787478_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 5,
				"body": "I rarely if ever disagree with some people. In more cases, I disagree with some values, some totally unsubstantiated opinions or some kinds of plausible logic. If a person is full of such components, I tend to disagree with his or her other opinions by default. Thus I'd like to avoid listening to him or her, to keep myself happy. After all, listen to or argue with some people that hold entirely opposite value and logic with you is painful.",
				"added": 1523789610
			}
		],
		"1524154906_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 6,
				"body": "pseudo-correlation?",
				"added": 1524197226
			},
			{
				"comment_id": 7,
				"body": "> [eibriel](#comment_25_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Real Correlation!But correlation don't means causality\n\nYes I know. Anyway it's funny!",
				"added": 1524235867
			}
		],
		"1524280296_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 8,
				"body": "> [darkshroud](#comment_22_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni): (joinmastodon.org\n\n> [eibriel](#comment_26_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): I use Telegram + Diaspora, I've also Matrix and XMPP clients installed but I don't really use them\n\n> [0hd](#comment_13_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ): http://127.0.0.1:43110/Me.ZeroNetwork.bit/\n\nThanks! I am checking them! Looks like Good options!",
				"added": 1524287057
			},
			{
				"comment_id": 9,
				"body": "> [darkshroud](#comment_23_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni): This is do for another update, but it still has lots of great information, sites, and services. [...]\n\nI've checked your link of alternatives! Wonderful sum up! That's what I need",
				"added": 1524301656
			},
			{
				"comment_id": 10,
				"body": "> [oyajiru](#comment_4_12LzpfdVEHWvY3fo8JqWVBuhfeAY4JRWav): gorgeous\n\nWow, an ambitious project. I see it. I'd like to wait for its open-source version~",
				"added": 1524376018
			},
			{
				"comment_id": 11,
				"body": "> [xianc78](#comment_21_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Email. Seriously, you can send a message to multiple people at once and there are still some active mailing lists out there.\n\nWow, that's fancy!",
				"added": 1524446256
			},
			{
				"comment_id": 12,
				"body": "> [eibriel](#comment_29_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Matrix is decentralized, it still needs servers, like Diaspora or XMPP\n\nI've realized this specific kind of decentralized social network, it's interesting and efficient currently as far as I'm concerned.",
				"added": 1524446354
			},
			{
				"comment_id": 13,
				"body": "> [eibriel](#comment_31_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Funny enough Email is a Decentralized service by design. Monopolized by Google and others...\n\nHhhhhhh, what if there're embedded SMTP and IMAP in each linux desktop to work as Email server, combined with some decentralized domain name parsing? Actually it's what ZeroMail has done for us, isn't it?",
				"added": 1524450702
			},
			{
				"comment_id": 14,
				"body": "> [eibriel](#comment_30_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Yes, is the middle ground between  Centralized services like Facebook and Distributed services like ZeroNet\n\nYeah, and that's why it has characters of both Centralized services and Distributed services. But to prevent from being blocked, many Chinese mastodon communities don't allow political issues, which makes them meaningless. That's one of the cons of this middle ground from my perspective...",
				"added": 1524451417
			}
		],
		"1524439656_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 15,
				"body": "Wow! I just tried mps-youtube, that's interesting! \nI'd appreciate it if you could tell me some other good terminal clients for clearnet sites.",
				"added": 1524462230
			}
		],
		"1524300556_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 16,
				"body": "Finally, after read your statement, I am determined to switch from Startpage (enhanced by Google) to DDG.\nEven though Google has more relevant answers compared with DDG, and Startpage doesn't set cookies etc, They does filter some \"illegal\" contents. That's annoying.",
				"added": 1524532359
			}
		],
		"1522450733_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": [
			{
				"comment_id": 17,
				"body": "I'm about to buy a Raspberry Pi as a proxy in my home (China) to torrent when I study abroad.",
				"added": 1524547254
			},
			{
				"comment_id": 18,
				"body": "> [shitchell](#comment_1_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo):  using McDonald's WiFi. I've done that before when I was broke and my ISP sent me a DMCA notice.\n\nDid you mean that  ISP will send me a DMCA notice even though I was using McDonald's WiFi for torrent?",
				"added": 1524548396
			},
			{
				"comment_id": 19,
				"body": "> [shitchell](#comment_7_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Sorry, I see how that was ambiguous :p Nah, I meant that after I got a couple of DMCA notices, I just started taking my laptop with me to a couple of fast food places and would torrent movies there. [...]\n\nThanks a lot for your clarification! I was scared of what you said before.\nBesides, I think Chinese ISP just doesn't care BT download at all. Even raspberry pi is in my home, no one will send me a notice. China only care about maintaining their dictatorship by cyber-censorship. \nBut I am about to change my plan, since the connection between a local server (raspberry pi) behind a NAT and my laptop in USA may be  unstable?",
				"added": 1524617145
			},
			{
				"comment_id": 20,
				"body": "> [shitchell](#comment_7_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Sorry, I see how that was ambiguous :p Nah, I meant that after I got a couple of DMCA notices, I just started taking my laptop with me to a couple of fast food places and would torrent movies there. [...]\n\nI have another Question: \nDo you know whether BT download for **open-source** softwares or other kind of **legal P2P** can cause problems in USA? Will policeman comes to see me?",
				"added": 1524622941
			},
			{
				"comment_id": 21,
				"body": "> [shitchell](#comment_11_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Yeah, that'd likely be incredibly slow. I'd still rather torrent at a free public wifi access point if you're trying to avoid spending money on a VPN. [...]\n\nLots of thanks! I will probably follow your suggestion to torrent at a free public wifi area when in USA.\nI **was** afraid that policeman may contact me, or ask me what I'm downloading via torrent, when I just download linux distro through BT.",
				"added": 1524634425
			}
		],
		"1524824473_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 22,
				"body": "LOL. Yeah how I wish my roomates spend more time on game theory rather than games.\nBesides, I prefer mechanism design over game theory, even though both are interesting and game theory are more practical in daily lives.",
				"added": 1524828448
			},
			{
				"comment_id": 23,
				"body": "> [sylvaine](#comment_68_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): Oh shit!\n\nIn China, as far as I imagine, each Government official knows Game theory quite well, for the sake of their political careers. But they seems know nothing about what they ought to learn----mechanism design.",
				"added": 1524829306
			}
		],
		"1526364340_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 24,
				"body": "> [ssdifnskdjfnsdjk](#comment_269_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I do not think so. At least i am using encryption (network traffic, computer data) where i can, anonymously setup VPN and clear logs where i can. Using my real full name and address in very rare cases. Never uploading my photo/video publicly.\n\nYes, maybe it's hard for you to keep your privacy all in your hand. But every efforts of you pay off.\nThe more you take care, the less advertisers get, the less likely hackers can get your sensitive data, the less are carved up by your ISP as well as your government.\nWe are not celebrities. We don't have as beautiful and sexy naked pictures as celebrities. Thus we'd better not let others get them.",
				"added": 1526387019
			}
		],
		"1526547938_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 25,
				"body": "> [skwerlman](#comment_63_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): i use stylus. it lets you install usercss for any given website (including 0net)\n\nWow! That's what I'm looking for! Thanks a lot, and I'm enjoying it. ^v^",
				"added": 1526610297
			},
			{
				"comment_id": 26,
				"body": "> [thunder33345](#comment_76_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you can compile from opensource for all you care\n\nYou're right, I adjusted the title accordingly.\nYeah, it's the final solution, with perhaps a full sense of achievement for those who're not professional programmers like me.",
				"added": 1526610388
			}
		],
		"1525926869_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 27,
				"body": "推荐 V2Ray，抗性更强，即使被TCP阻塞，还能使用MKCP的UDP伪装，最不济还有CDN转发，一节更比六节强。",
				"added": 1528163361
			}
		],
		"1528116214_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 28,
				"body": "> [nofish](#comment_1167_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Yes, others also reported this problem, but no fix yet:https://github.com/HelloZeroNet/ZeroNet/issues/1331https://github.com/HelloZeroNet/ZeroNet/issues/1440\n\n> [republicofme](#comment_1_11WQHH4nhf1MGx2f75r95FKjbbQo8bA2u): With the following settings, it will work again: [...]\n\nI see it. Thanks a lot! And it could be fixed by the aforesaid setting\n```\nCookieAuthentication 1\nDataDirectoryGroupReadable 1\nCookieAuthFileGroupReadable 1\nExtORPortCookieAuthFileGroupReadable 1\nCacheDirectoryGroupReadable 1\nCookieAuthFile /var/lib/tor/control_auth_cookie\n```\nAfter adding `CacheDirectoryGroupReadable 1`, it now works again with `tor`.",
				"added": 1528163491
			},
			{
				"comment_id": 29,
				"body": "> [anonymouslogin](#comment_137_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I had tor already installed via apt-get (debian) maybe this helps ?\n\nSo do I. Install tor via official repo is a better idea I suppose. But my problem exists in this way. Now it's done.",
				"added": 1528163591
			},
			{
				"comment_id": 30,
				"body": "> [rdu](#comment_25_1JdGajsRmeCbZofurLsGcBZaaFg7ao16PQ): Check if your torrc file has been modified with update. Follow the process in FAQ to make it work with zeronet. [...]\n\n`CacheDirectoryGroupReadable 1` helps. But I don't know why it is needed now instead of before.",
				"added": 1528163690
			},
			{
				"comment_id": 31,
				"body": "> [tuxoid](#comment_4_15tm4kMhvtoUgbAHmeKdSXvH7gCgEZGuJT): Add zeronet to group \"$tor_user\" by command \"usermod -a -G $tor_user zeronet\" or something like that.\n\nThat's what I've done at the beginning of my use of `Zeronet` along with `tor`. It can't help the new permission problem. \nAnyway thanks for your reply!",
				"added": 1528252578
			}
		],
		"1528298428_14aByczNBeonC9sGu66hVrUt1Rm3JLE8JF": [
			{
				"comment_id": 32,
				"body": "What you are using to browse [clearnet](https://check.torproject.org/) is not necessarily the same with what you use in zeronet. To use tor in zeronet, you need to read [zeronet's documents](https://zeronet.readthedocs.io/en/latest/faq/#how-to-make-zeronet-work-with-tor-under-linux) or relevant [Archwiki](https://wiki.archlinux.org/index.php/ZeroNet).",
				"added": 1528363457
			}
		],
		"1528170453_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 33,
				"body": "[I have just asked this question several days before](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1528116214_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8/ZeroNet+Tor+permission+error)",
				"added": 1528375837
			},
			{
				"comment_id": 34,
				"body": "> [krakodeal](#comment_5_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): I am exactly two days in zeronet so I did not see your question before\n\nYes, I also find it a little bit difficult to find some topics before in zeronet.",
				"added": 1528507160
			}
		],
		"1528780559_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": [
			{
				"comment_id": 35,
				"body": "What a stupid nightmare.",
				"added": 1528785211
			}
		],
		"1530276992_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 36,
				"body": "> [eliot](#comment_1_1P3JVeqokaicpcrMK9HXzpScWa2fPSLen8): It's possible. I dunno how but it is\n\nThanks, maybe I can coop with it sometime when I can't afford mobile data.",
				"added": 1530327487
			}
		],
		"1532741294_1Po6uY6FBPRJUvAETh8DaNkf66cdNzGXfX": [
			{
				"comment_id": 37,
				"body": "*Welcome!*",
				"added": 1532744578
			}
		]
	},
	"comment_vote": {
		"1_1HR8rARGfHybpYKvFC9SSYM2bxvNWNnHB7": 1,
		"22_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"27_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"26_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"23_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"110_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"4_12LzpfdVEHWvY3fo8JqWVBuhfeAY4JRWav": 1,
		"21_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"4_123rY6a7W3RMmgFHrTdMR1NwGfciuKwsV4": 1,
		"28_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"12_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
		"269_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"10_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"2_14vpMXmnJuhoQ8qv9oDVRh313TaUModCLw": 1,
		"1_11WQHH4nhf1MGx2f75r95FKjbbQo8bA2u": 1,
		"1167_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}