{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "我认为不应该拆墙，应该做的是开放Google和维基等网站",
			"body": "GFW为什么遭人恨？是因为它本身么？我认为不是。\n对普通民众而言，比如我，不喜欢GFW的原因是它封禁了Duckduckgo和Google，查资料比较麻烦了。\n如果GFW能够开放Google这些网站，容忍对中国的不同言论，封禁恶毒攻击、暴力和色情，这倒是我最希望的。\n我们也需要和谐的网络世界啊，如果一个社区没了管理……\n想想20世纪30年代缺少经济管控的美国吧……",
			"added": 1501506857
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"6_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 1,
				"body": "我忍不住说一句，虽然是在零网，但这样说的根据何在？没有根据，不知是事实还是谎言，又怎么能说服人，怎么能代表“零网”派的风格？\n说实话，我不喜欢零网，因为自由必须有自由的规则，必须有让每个人都能最大可能实现自己利益的规则。\n这是Wikipedia对于郭文贵的介绍：\n郭文贵，又名郭文贵，郭浩云，郭浩云，郭国云，是一名中国亿万富翁，成为控制北京天顶控股的政治活动家通过代理人等。在他职业生涯的最高点，他在中国最富有的人中排名第73。\n郭培欣长期以来在房地产开发投资界的突出表现，由胡新立控制的财新媒体长时间的调查报告于2015年开始发布，详细说明了郭先生的政治关系，商业交易和对抗前竞争对手的硬性战术。这部作品成为现代中国新闻史上最受欢迎的调查文章之一。\n截至2017年，郭先生在纽约市自行流放，在曼哈顿上东区拥有一间价值6800万美元的公寓，俯瞰中央公园。他继续从纽约的家中引入政治议程，引起中国政治制度中所谓的腐败。（Wiki英文版，经由Google翻译）\n习近平：\n习近平是中国政客。现任中国共产党总书记，中华人民共和国主席，中央军委主席。由于习近平拥有党和军队的最高职位，除了担任总统职务的国家元首外，他有时被称为中国的“最高领导人”，被党认定作为其领导“核心”。作为总书记，习近平当选中国共产党政治局常委，中国最高决策机构。\n共产党老将习忠勋的儿子习近平在中国沿海各省政治上上升。习近平于1999年至2002年担任福建省长，2002年至2007年任浙江省省长，当时的浙江省党委书记。解放陈良玉后，于2007年转为上海市委书记。政治局常务委员会和中央书记处2007年10月，将胡锦涛推定为继承人，担任未来五年。习近平是2008年至2013年的副总统，中央军委副主席从2010年到2012年。\n自从执政以来，习近平试图通过采取措施强化党纪，确保内部统一，使共产党的权威合法化。他发起了一场前所未有的深远的反腐败运动，导致着名的现任和退休官员的垮台。习近平还对民间社会和思想话语施加了进一步的限制，倡导“互联网主权”的概念。作为中华人民共和国第五代领导层的核心人物，习近平采取了广泛的领导职务，其中包括主持新成立的国家安全委员会，以及新的经济，社会改革，军事改革和互联网。习近平呼吁进一步进行市场经济改革，依法治国，加强法制建设，重视新形“中国梦”下的个人和民族愿望。习近平还倡导更加坚定的外交政策，特别是在中日关系，中国的南海要求以及作为领导倡导自由贸易和全球化的角色方面。他还试图通过“带带道路倡议”扩大中国的区域影响力，在打击气候变化的斗争中发挥了主导作用，并在能源和自然资源方面投入了大量资金。\n说说我的观点：\n1.中国政党制度就我看来，应该说是“想法很天真，现实很艰难”，但不存在彻彻底底地腐化。再想想如果中共腐化了，为什么还会有到处跑到处外交的主席和总理（反腐的事有争议我们不谈），还会有中国政府网的”我给政府捎句话“？\n2.如上面的材料，在一贯中立的Wiki上都不敢把这件事说明，至今我也没见到一家外媒公开谈到这件事（六四是真的）。如果你说的有理有据，欢迎指正；如果是捕风捉影，那么我想自由的零网也不会欢迎。\n谢谢！",
				"added": 1501505824
			},
			{
				"comment_id": 2,
				"body": "至于“人民”的利益，我承认中共确实不具有代表性。不过，这不是发布攻击言论，因为自由而影响社会稳定的借口。试想想如果中国社会变成了南苏丹的模样，谈自由？呵呵。",
				"added": 1501506095
			}
		],
		"1_1Fv1xGsCxVzHNkCyCMLkJsXaqHSqc5VS45": [
			{
				"comment_id": 3,
				"body": "我觉得，六四也好，文革也好，这都有着复杂的历史渊源，也需要中共在内的整个中国反思，去揭开其中的谜团。\n我希望，在我有生之年，能看到“文革”博物馆的建立。\n其他的，捕风捉影的言论，无意义的攻击话语，不谈。\n还有，64和毛泽东什么关系……",
				"added": 1501506322
			}
		],
		"1_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 4,
				"body": "文明、理性\n兼顾人生自由与生命健康——两者缺一不可",
				"added": 1501507058
			}
		],
		"1_1EEBZ23ns3i3gBpeZV6HcYDe9tQ3zsydZk": [
			{
				"comment_id": 5,
				"body": "我要看看零网里找得到几个有点理性的人\n是不是有了自由连家国都可以不要了\n天天喊着反党有种反啊……\n不知楼主怎么看",
				"added": 1501507542
			}
		],
		"1_1AktdZZ17qS2VT6PUPAimbMJ1qe84fQA2i": [
			{
				"comment_id": 6,
				"body": "> [chaosr](#comment_1_1D4tF2AHzXPAEmANbiUMovZMkswVKmcrkM): ZF 应该不会容忍这些言论，ZF建立GFW的目的，貌似就是屏蔽“对中国的不同言论”。在国内，出现了“不同言论”，ZF可以强迫国内的运营商或者公司删除这些内容，必要情况下查一查发帖人的水表。但是如果这些言论出现在了国外的网站，政府无法删除，那就只能靠GFW把这些言论屏蔽在国门之外，让国内的人看不到。\n\n这个“不同”不好定义啊，是恶毒攻击，还是提出不同意见？如果是像零网某些帖子一样的言论，那么我想“言论自由”也不该容忍。有理有据、中肯但逆耳的话语，容忍是很必要的。\n然后就是，为什么要封“Wiki\"和Google？担心外媒的不同意见影响政权稳定？我想这点大部分老百姓都知道。",
				"added": 1501545951
			}
		]
	},
	"comment_vote": {
		"1_1H3obBSu8vDPGeRoRs1bTu3gZ3YhBURhef": 1
	}
}