{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "Кроме простоты, это наверно ещё из-за заголовков. Для всяких бложиков сайтиков стало удобно. BBCode больше распространен по форумам, где это не нужно. Зато богаче и понятнее. Так что вовсе не нужно \"везде переходить на Markdown\". Где-то он уместен, а где-то нет. А ещё в последнее время набирает популярность reStructuredText.",
			"post_id": 21,
			"date_added": 1483868074
		},
		{
			"comment_id": 2,
			"body": ">Для простого пользователя bbcode ничуть не более понятен, чем markdown :) Только для уже знающих html\n\nПрактически любой форум имел редактор BBCode, что позволяло любому постоянному пользователю его выучить, в необходимом минимуме, не делая это целенаправленно, и без всякого знания html.\n\n>Ну, популярность его сама за себя говорит на графике google trends :)\n\nВ данном случае, популярность не о чем не говорит. Есть определенное желание унифицировать, и дело не только в простоте языка, но и в простоте получаемого результата. И много где это хорошо, но далеко не везде.",
			"post_id": 21,
			"date_added": 1483899422
		},
		{
			"comment_id": 3,
			"body": ">BBCode так и не вышел за рамки форумов, а Markdown сегодня уже де факто самый распространённый стандарт для любой разметки кроме форумной. При этом форумы уже составляют очень небольшую часть общения в Интернете и Markdown уже начал проникать на форумы.\n\nИ это собственно тоже не причина ему быть везде. ",
			"post_id": 21,
			"date_added": 1483900866
		},
		{
			"comment_id": 4,
			"body": "Чей выбор? У себя в стартапчиках можно выбирать что угодно. Там же, где BBCode уже используется, крайне сомнительно его менять на Markdown. Ломая при этом текущую функциональность.",
			"post_id": 21,
			"date_added": 1483908773
		},
		{
			"comment_id": 5,
			"body": "Не был бы столь уверен. Почта и мгновенные сообщения немного различаются по применению. С другой стороны, e-mail сейчас уже отживает свое. Он хорошо в рассылках, но теперь для этого более удобны другие средства: вроде каналов в telegram или пабликов в соцсетях. Плюс, этот способ более защищен от спама. А e-mail не нужен хотя-бы из-за html-верстки.\n\nЧем уж и стал e-mail, так это популярным способом регистрации на сайтах.",
			"post_id": 23,
			"date_added": 1484677138
		},
		{
			"comment_id": 6,
			"body": ">Богда народ в Интернете строчит по 10Мб на один подфорум в месяц, то, боюсь, форумы делить не только по темам нужно, но и по отрезкам времени, например, один зайт — один месяц :)\n\nДа, некоторотые сайты, особенно рассчитанные на общение неплохо бы делить по времени. Например: имиджборды - это тяжелы контент, можно сделать так, чтобы максимальный размер доски был 2 Гб, они бы постепенно улетали в архив. Собственно так это обычно и в интернете с бордами. Чаты аналогично.\n\nДругое дело сайты вроде Wiki, нацеленные на создание контента, там уже нужно хранить все. Так что дробить уже по типу или тематике.",
			"post_id": 25,
			"date_added": 1484715438
		},
		{
			"comment_id": 7,
			"body": ">Каждый зайт при обновлении может запушить отчёт об этом изменении в некий «технический чат», \n\nТут пожалуй проще. Нужны альтернативные реализации домашней страницы: ZeroHello. Где будет все более информативно и удобно.",
			"post_id": 26,
			"date_added": 1484715627
		},
		{
			"comment_id": 8,
			"body": ">В общем, надо цеплять это дело к нормальной ноде, собирать значения, сигнализировать о превышении.\n\nЦепляй сразу к окну.",
			"post_id": 29,
			"date_added": 1484916531
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"23": 1
	}
}