{
	"title": "Military@Balancer",
	"description": "Mostly photos & video",
	"links": "*   [English Balancer's Blog](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/)\n*   [Politics blog](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/)\n*   [Balancer's Blog in Russian](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1539090083,
	"post": [
		{
			"post_id": 13,
			"title": "Number of tanks in service in the countries of the world",
			"date_published": 1539089947.456,
			"body": "Количество танков стоящих на вооружении в странах мира.\n\n![photo_2018-10-08_19-54-32.jpg (1280x720)](data/img/post_13_photo_2018-10-08_19-54-32.jpg)"
		},
		{
			"post_id": 12,
			"title": "Exercises \"West-2017\" — Учения «Запад-2017»",
			"date_published": 1539089669.914,
			"body": "\"West-2017\". In the photo TSCV \"Terminator\" and tanks T-90M and T-80BVM.\n\n**«Запад-2017». На фото БМПТ \"Терминатор\" и танки Т-90М и Т-80БВМ.**\n\n![photo_2018-10-08_23-24-41.jpg (912x1080)](data/img/post_12_photo_2018-10-08_23-24-41.jpg)"
		},
		{
			"post_id": 11,
			"title": "MiG-31 with new missile",
			"date_published": 1538308606.902,
			"body": "I have not written anything on the subject for a long time. So I'll start right away with the new info. In the Zhukovsky (Moscow suburb), the MiG-31 was seen with, presumably, an anti-satellite missile or its mock-up. Although this is only a plausible version. There are also assumptions that this is a modification of the \"Kinzhal\" (\"Dagger\") missile with a radar homing. Also there is an assumption that this is a deliberate leaks of information.\n\n![DoVhYlmXUAA6SAq__1_.jpg (1500x1000)](data/img/post_11_DoVhYlmXUAA6SAq__1_.jpg)\n\n**Давно ничего не писал по теме. Так что начну сразу с новинок. В подмосковном Жуковском замечен МиГ-31 с, предположительно, противоспутниковой ракетой или её макетом. Хотя это только вероятная версия. Есть ещё предположения, что это модификация «Кинжала» с радиолокационной ГСН. Также есть предположение, что это намеренный слив информации.**\n\n**Update**: Another photo / Другое фото:\n\n![DoQdiouXkAAhZan.jpg (1280x872)](data/img/post_11_DoQdiouXkAAhZan.jpg)"
		},
		{
			"post_id": 9,
			"title": "Tu-160 lights",
			"date_published": 1525634297.469,
			"body": "Tu-160\\. World's biggest bomber.\n\n![IMG_20180506_182526.jpg (806x1213)](data/img/post_9_IMG_20180506_182526.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "Mass attack of UAV on Russian bases in Syria",
			"date_published": 1515482890.455,
			"body": "Again a big noise from Syria. On January 6, a massive attack by unmanned aerial vehicles on Russian bases in Syria was foiled. In total, 13 vehicles took part in the attack, 10 in Khmeimim and 3 in Tartus.\n\nSix goals managed to take control by the Russian means of electronic warfare. 3 of these was landed in controlled territory outside the base, and 3 more UAVs was detonated from a collision with the ground.\n\nSeven UAVs were destroyed by \"Pantsir-S\" of Russian air defense.\n\nNo UAV has achieved the targets, no injured and no damage.\n\nIn my opinion, this is the world's first case of such a mass attack by homemade UAVs by terrorists. It is very pleasant that our air defense forces were ready to repel such a raid with such complex targets.\n\nAlthough against this background, new questions arise to attack Khmeimim on December 31\\. The official version with mortar shelling is not the best way to explain all the facts. But the fact that it could be a trial attack using UAV, to repel an attack which was then not ready - is more interesting.\n\nHere are photos with intercepted \"gifts\" from ISIS.\n\n![DTBtndXW4AA89FH.jpg (1200x800)](data/img/post_8_DTBtndXW4AA89FH.jpg)\n\n![DTBtpBDWAAAsb1H.jpg (1200x800)](data/img/post_8_DTBtpBDWAAAsb1H.jpg)\n\n![DTBtqFQX4AA5eaW.jpg (1200x800)](data/img/post_8_DTBtqFQX4AA5eaW.jpg)\n\n![5120363_original.jpg (718x960)](data/img/post_8_5120363_original.jpg)\n\nHere is a local resident demonstrating the wreckage of one of the destroyed vehicles.\n\n[https://www.youtube.com/watch/?v=NZPNXQAByss](https://www.youtube.com/watch/?v=NZPNXQAByss)"
		},
		{
			"post_id": 7,
			"title": "Из истории Ка-52",
			"date_published": 1515149671.564,
			"body": "Уже на закате СССР встала задача разработки нового армейского вертолёта. В конструкторское бюро Камова приехали предствители сухопутных войск и обратились к тогдашнему главе бюро, Сергею Михееву. И сказали: «Степень автоматизации нового вертолета должна быть такой, чтобы мы солдатика посадили - и он бы полетел». Михеев поже вспоминал: «Видимо, у нас стали такие выражения лиц, что они решили сильно смягчить требования: Ладно, с солдатиком мы явно погорячились - согласны на старшину-сверхсрочника...» :)\n\nПоэтому вертолёт разрабатывался предельно простым в пилотировании, с автоматизированным прицельным комплексом, очень дешёвым. Но потом СССР распался, много дешёвых вертолётов, доступных мало квалифицированным лётчикам стали не нужны. И в серию вместо большого количества Ка-50 пошло малое количество дорогого двухместного варианта Ка-52.\n\n![Ka-50_helicopters_over_Moscow.jpg (1199x803)](data/img/post_6_Ka-50_helicopters_over_Moscow.jpg)"
		},
		{
			"post_id": 6,
			"title": "Ka-50 history",
			"date_published": 1515149473.677,
			"body": "> **Viacheslav** wrote:\n> And the T-90 does not require high skills from the soldiers\n\nAlready at the end of the Soviet Union, the task was to develop a new army helicopter. In the design office of Kamov came the representatives of the ground forces and appealed to the then head of the bureau, Sergei Mikheev. And they said: \"_The degree of automation of a new helicopter should be such that we put a soldier - and he would fly_\". Mikheev later recalled: \"_Apparently, we have become such expressions of persons that they decided to significantly soften the demands: Okay, with the soldier we clearly got excited - agree to the sergeant-super-term ..._ \" :)\n\n(I do not know how correctly translated into English the title of sergeant, who remains to serve after compulsory recruitment, Google translated this as a \"sergeant-super-term\")\n\nTherefore, the helicopter was developed extremely simple in piloting, with an automated sighting system, very cheap. But then the USSR disintegrated, many cheap helicopters that were available to little qualified pilots became unnecessary. And in the series instead of a large number of Ka-50 went a small amount of expensive two-seat version of the Ka-52.\n\n![Ka-50_helicopters_over_Moscow.jpg (1199x803)](data/img/post_6_Ka-50_helicopters_over_Moscow.jpg)"
		},
		{
			"post_id": 5,
			"title": "Glockophone music",
			"date_published": 1514530159.313,
			"body": "Vitaly Kruchin - Russian IPSC President are the real musical maestro! 1 bullet - 1 note. Outstanding skill play Glocks!\n\n**Музыка на Глокафоне! Кто бы мог подумать, что можно играть мелодию на пистолетах — Президент Федерации практической стрельбы России может! Встречайте Виталия Крючина!**\n\n<video controls=\"controls\"><source src=\"/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Glockophone-music-youtube-LQ96jyfefCk.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n*   To view this video, you need to connect the [ZeroUp zite](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/).\n*   Origin: [https://www.youtube.com/watch?v=LQ96jyfefCk](https://www.youtube.com/watch?v=LQ96jyfefCk)\n*   See also: [Crazy Russian guy plays Beethoven by firing a handgun](https://nypost.com/video/crazy-russian-guy-plays-beethoven-by-firing-a-handgun/) @ New York Post"
		},
		{
			"post_id": 4,
			"title": "Gun performance by \"Kalashnikov\"",
			"date_published": 1507973180.607,
			"body": "Performance by the group of experts of the \"Kalashnikov\" concern on the occasion of the day of the gunsmith. Shooting is conducted by live ammunition :)\n\n<video controls=\"controls\"><source data-cke-saved-src=\"/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Performance-of-the-Concern-Kalashnikov-s-experts-on-the-armourer-s-day-xObykrVBGD0.mp4\" src=\"/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Performance-of-the-Concern-Kalashnikov-s-experts-on-the-armourer-s-day-xObykrVBGD0.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n*   To view this video, you need to connect the [ZeroUp zite](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/).\n*   Origin: [https://www.youtube.com/watch?v=xObykrVBGD0](https://www.youtube.com/watch?v=xObykrVBGD0)"
		},
		{
			"post_id": 3,
			"title": "A Few Fleet",
			"date_published": 1492703115.098,
			"body": "Чтобы не одна только авиация была (хотя я и её фанат :) ) — немного флота.\n\n«Варяг» и однополчане. Владивосток, август 2016г.\n\n**In order not to go all the way to aviation subjects (although I'm a fan of aviation :D) - a little fleet.**\n\n**Varyag and brother-soldiers. Vladivostok, August 2016.**\n\n![Varyag-and-brother-soldiers-Vladivostok-August-2016.jpg (1080x1080)](data/img/post_3_Varyag-and-brother-soldiers-Vladivostok-August-2016.jpg)​​​​​​​"
		},
		{
			"post_id": 2,
			"title": "Mi-28N",
			"date_published": 1492563422.513,
			"body": "Ми-28Н в горах Кавказа. 2012 год.\n\n**Mi-28N in the mountains of the Caucasus. 2012.**\n\n![Mi-28-mountains.jpg (1200x800)](data/img/post_2_Mi-28-mountains.jpg)"
		},
		{
			"post_id": 1,
			"title": "Tu-95MS",
			"date_published": 1487556540,
			"body": "Tu-95MS. Smoked.\n\nТу-95\\. Копчёный.\n\n// http://photos.wrk.ru/picture.php?/209/category/97\n\n[![](http://gateway.ipfs.io/ipfs/QmdqGaxmHaLBoAiR465VMZHDxAe6und8KPgs8u3qdxkidu/Tu-95MS-800x.jpg)](http://gateway.ipfs.io/ipfs/QmQCXq9tyzuJAmPK7R9HVU5p7JbjYDjkdCkYUyirpz7WP1/Tu-95MS.jpg)"
		}
	]
}