{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566178230_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1565820689_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "> [mg0](#comment_99_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I don't find incest wrong as long as both parts agree, but I think I heard something about that having chances for un-healthy offsprings or something.\nGenetics are passed from parents to child. Bad/weak gene are overpowered by the good/healthy genes, so when two siblings or parent/sibling tango they share more of the same DNA which leads to an increased chance of the bad DNA getting into the offspring.",
				"added": 1565833716
			}
		],
		"1565925178_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/1MusicXkuN2pk5hRdmroeyaCLDJtzTicpB/\nNot sure if I'd say it's good, but it's the only thing I know of.",
				"added": 1565925633
			}
		],
		"1565969344_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "I mean this woman could always get another job if it really bothered her all that much.",
				"added": 1566006590
			}
		],
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 4,
				"body": "You can literally just clone the site and have a new site that you run.",
				"added": 1566015223
			}
		],
		"1566845376_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 5,
				"body": "Great news, seeding the files.",
				"added": 1566874820
			}
		],
		"1566891933_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG": [
			{
				"comment_id": 6,
				"body": "Think three times before flushing your money down the toilet paying rent. If you buy a house you can turn around and sell it at some point, possibly for more than you spent to buy it. If you rent you have nothing to show for the money you've spent.\nOh, and your landlord that you are paying rent to, is passing the property tax right to you, so don't think you aren't paying it...",
				"added": 1566909020
			},
			{
				"comment_id": 7,
				"body": "> [numismatist](#comment_72_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): I own my home outright, I pay about $2k a year in property taxes.\n\nI wonder if the OP pays more than 2K in rent a year, 'cause that would really make him/her/they/it an idiot.",
				"added": 1566960039
			},
			{
				"comment_id": 8,
				"body": "> [mrloverman](#comment_5_1DWcgvD7uuH61JxvRZnHhgjwdT4FQnXhqG): Everything you say on ZeroTalk is how well educated and wealthy you are and that you owe precious metals! [...]\n\nI think you're the retarded one. You do realize that there are millions if not billions of people that are well educated, wealthy, and own precious metals. That information literally tells you nothing about numismatist.",
				"added": 1567045427
			}
		],
		"1567473518_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 9,
				"body": "If there was still electric and water why would people die in a week. You can live for about three weeks without food.\nAnybody that has an electric stove would still be able to cook, not sure what happened in this scenario, but microwaves might still be working. Was there some sort of nuclear fallout, in which case aren't we probably all doomed? OP needs more data before we can properly role-play here.",
				"added": 1567474562
			}
		]
	},
	"comment_vote": {
		"99_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"23_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1040_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"3_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG": 1,
		"35_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"5_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"14_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1,
		"528_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"14_155YW8Qn715edvfqPMrsPscUHqut4JCphb": 1,
		"65_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1
	}
}