{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"category": "tvepisodes",
			"title": "The Mask cd rom comic with audio collection",
			"torrent_imdb": "https://en.wikipedia.org/wiki/The_Mask",
			"body": "In an antiques shop, a weak, neurotic man named Stanley Ipkiss shops for a gift to give to his girlfriend, Kathy. At the store he purchases an old jade mask which begins to speak to him. When Stanley wears it, he is transformed into a wacky, super powered being with an abnormally large, bald, green-skinned head and a mouthful of large teeth. After exploring his new abilities, Ipkiss goes on a rampage, taking revenge on those with whom he has a grudge, and earns the nickname Big Head.\n\nAfter taking the mask off, Stan begins to realize what has been happening. His acts as Big Head begin to take an emotional toll on him. He becomes verbally abusive toward Kathy. She kicks him out but keeps the mask since it was a gift from Stanley.\n\nLater Stan breaks into her apartment to steal it back just as the police arrive in response to an earlier domestic violence call. Deciding his only way out is as Big Head, Stan puts the mask back on and kills eleven cops during his escape. He returns home as Big Head and removes the mask only to be shot in the back and killed by Kathy, who has put two and two together and figured out the identity of Big Head.\n\nKathy takes the mask to Lieutenant Kellaway for safe-keeping. Kellaway, who had been struggling with both the recent Big Head murders, and organized crime lords on the loose in his city, disregards Kathy's warnings, believing she is stressed and not thinking clearly, and tries on the mask. Becoming Big Head, Kellaway sets out to take down the crime lords who have plagued his police career.\n\nCity dwellers, not knowing of the magical mask, assumes Big Head is still the same killer whose targets are now high-profile crime lords. Despite Kellaway's good intentions, the mask causes his methods to become increasingly more violent. Big Head encounters Walter, a behemoth-sized mob muscle-man who never speaks, who has undertaken a vendetta against Big Head for killing his employers. Walter never shows pain and is the only one who can injure Big Head to any real degree.\n\nWhile fighting off Walter's attacks, Lieutenant Kellaway, as Big Head, becomes the target of a police manhunt. Big Head fights off the police and tracks down the remaining mobsters. When Kellaway's partner attempts to stop Big Head, the mask-altered policeman nearly kills his friend and colleague. Kellaway, realizing what he has been doing, flees. He removes the mask, buries it in his basement in cement, and vows never to let it be worn again.\n\nThe first half of the story following Stan as Big Head was originally published in the four-issue anthology series Mayhem and was then collected as the first part of The Mask trade paperback.",
			"magnet": "magnet:?xt=urn:btih:259303687130f27e85f1bf7b3273a27b5acd340e&dn=the%20mask%20comic&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969",
			"torrent_file": "data/users/1FVuZhg2gaDHa8mjyUrtFphweYYntnhSrZ/",
			"added": 1515228610
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}