{
	"title": "LululatortuE Blog\n",
	"description": "From french Alpes\nlululatortue@zeroid.bit ",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 26,
	"demo": false,
	"modified": 1626706184,
	"post": [
		{
			"post_id": 25,
			"title": "Podcast /Comment arriver à un Web décentralisé ? Lola Rigaut-Luczak contributrice Zeronet, Namecoin, Dogecoin",
			"date_published": 1626705697.648,
			"body": "Podcast avec <span dir=\"auto\" class=\"style-scope yt-formatted-string\">Lola Rigaut-Luczak, ingénieur en informatique chez Zondax et contributrice sur de nombreux projets tel que Dogecoin, Zeronet et Namecoin.</span>\n\nhttps://www.youtube.com/watch?v=kDEMYlZolrw\n\n![univer.jpg (1200x686)](data/img/post_25_univer.jpg)"
		},
		{
			"post_id": 24,
			"title": "Notre planète vient d'établir un nouveau record effrayant de CO2\n",
			"date_published": 1552325184.733,
			"body": "<div class=\"_2cuy _3dgx _2vxa\">Par [Eric Holthaus](https://grist.org/author/eric-holthaus/) 6 Mars 2019 : [https://grist.org/article/our-planet-just-set-a-scary-new-carbon-dioxide-record/?fbclid=IwAR35LZkww7QhnIPUoURxvEgX96xgh-0XllrLnL7Ast8v2MWaDqr4ifa54j4](https://grist.org/article/our-planet-just-set-a-scary-new-carbon-dioxide-record/?fbclid=IwAR35LZkww7QhnIPUoURxvEgX96xgh-0XllrLnL7Ast8v2MWaDqr4ifa54j4)\n</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Le niveau de dioxyde de carbone dans l'atmosphère de notre planète a atteint un nouveau record le mois dernier. Les scientifiques de la Scripps Institution of Oceanography ont annoncé mardi que la mesure moyenne du dioxyde de carbone en février était de 411,66 parties par million, mesurée à Mauna Loa, Hawaii.\n</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Comme les émissions de gaz à effet de serre de l'humanité ont atteint un niveau record l'an dernier, un nouveau record était attendu. Ce qui est choquant, c'est que cela s'est produit si tôt dans l'année : Les niveaux de dioxyde de carbone de la Terre atteignent généralement leur maximum en mai, lorsque les vastes forêts nordiques de l'Amérique du Nord et de l'Asie commencent à peine à verdir. Établir un nouveau record en février est \"rare\", selon Scripps.</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">\"Pour la plupart des années, le maximum précédent est dépassé en mars ou en avril. Le record battu en février est une mesure de la vitesse à laquelle le CO2 a augmenté ces derniers mois \", a déclaré Ralph Keeling, directeur du groupe Scripps CO2, dans un communiqué. La soudaineté du record de cette année est le résultat de \"la combinaison de conditions El Niño faibles et d'émissions sans précédent provenant de la combustion de combustibles fossiles\", selon Keeling.</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Cette année, le niveau de dioxyde de carbone devrait culminer autour de 415 parties par million en mai.</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Il n'y a pas eu autant de dioxyde de carbone dans l'atmosphère de notre planète depuis que les voitures ont commencé à engorger les routes il y a un siècle, avant que l'agriculture ne se développe il y a 10 000 ans et avant que l'homme moderne n'évolue il y a plus d’un million d'années. Nous avons atteint non seulement une nouvelle phase de l'histoire de la civilisation, mais une nouvelle phase de l'histoire de notre espèce.</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Ces dernières années, l'augmentation des niveaux de dioxyde de carbone sur la planète s'est accélérée. Cela s'inscrit dans la lignée des prédictions des scientifiques selon lesquelles une planète se rapprocherait de points de bascule dangereux et irréversibles, et met en évidence les dangers d'un ralentissement collectif de la transition vers une économie sans carbone.</div>\n\n<div class=\"_2cuy _3dgx _2vxa\">Eric Holthaus\n</div>"
		},
		{
			"post_id": 23,
			"title": "Keeling Curve ou Killing Curve ?",
			"date_published": 1548348293.9,
			"body": "```\nLa moyenne mensuelle d'avril 2018 dépasse 410 parties par million pour la première fois de l'histoire .\n\nC'est la première fois dans l'histoire du record du Mauna Loa qu'une moyenne mensuelle dépasse 410 parties par million. Cela représente également une augmentation de 30% de la concentration de dioxyde de carbone dans l'atmosphère globale depuis le début de la courbe de Keeling en 1958\\.\n```\n\nVOICI LES MESURES POUR LE 22 JANVIER 2019\n\nA daily record of atmospheric carbon dioxide from Scripps Institution of Oceanography at UC San Diego\n\n```\nEnregistrement quotidien du dioxyde de carbone atmosphérique de la Scripps Institution of Oceanography de l’Université de San Diego\n```\n\n[Links](https://scripps.ucsd.edu/programs/keelingcurve/)\n\n![mlo_two_years.png (1000x600)](data/img/post_23_mlo_two_years.png)![mlo_full_record.png (1000x600)](data/img/post_23_mlo_full_record.png)![co2_800k_zoom.png (1000x600)](data/img/post_23_co2_800k_zoom.png)"
		},
		{
			"post_id": 22,
			"title": "Stellite is the first cryptocurrency to link IPFS and ZeroNet with blockchain.",
			"date_published": 1524671736.242,
			"body": "[Stellite](https://stellite.cash/) is a decentralized cryptocurrency based on the CryptoNight hashing algorithm, aiming to become the first coin to decentralize node lists through the use of IPFS and ZeroNet technologies.\n\nStellite is the first cryptocurrency to link IPFS and ZeroNet with blockchain.\n\nMost cryptocurrencies hard-code trusted nodes and peers to help users set up their own nodes.\nThis has been proven to work, but calls for a noticeable security risk. Stellite’s proposed solution is called IPFS. IPFS acts like a permanent storage of the node list and ZeroNet will be the dynamic front end of this permanent storage.\nCompletely secure.\n\nCryptoNote technology is the backbone of Stellite.\nThe CryptoNote algorithm is released under an open source license and has been adopted and incorporated into Stellite as it forms the basis for a solid, well tested cryptocurrency application. It is the same technology used by some of the best currencies out there like monero and bytecoin.True mining for all devices.\n\nTrue mining for all devices.\nStellite plans to bring mining to all sorts of devices, from smartphones to smart TV’s, we do this by running our custom miner in such a way that it doesn’t damage any of the internal aspects of the machine it’s being run on. A person can create an address and mine to that address from an endless number of devices.\n\nSpecifications\nPoW algorithm: CryptoNightV7\nTotal supply: 21,000,000,000\nPre-mine: 0.6%\nBlock rewards: (MoneySupply - A) >> 18\nDecimal places: 2\nDifficulty adjustment: Every block\nGenesis block: 2018-01-22 01:21:34\n\nThe blockchain is already live and you can mine solo or with a pool. Technical details including instructions on solo mining can be found on official [GitHub](https://github.com/stellitecoin/)"
		},
		{
			"post_id": 19,
			"title": "Privacy tools ",
			"date_published": 1518272022.165,
			"body": "A great link for all the information about privacy on internets\nUn super lien pour toutes les informations sur la vie privée sur les internets\n[Links](http://127.0.0.1:43110/14gSEpfWfF5Go7u5y7UidZQCnGa6eSBYZ9/)\n"
		},
		{
			"post_id": 18,
			"title": "NOTHING TO HIDE (Full movie, French)",
			"date_published": 1507653212.268,
			"body": "[NOTHING TO HIDE (Full movie, French) on Vimeo](https://vimeo.com/193515863)\n[Documentaire « Nothing To hide » en téléchargement légal torrent](https://www.aquilenet.fr/nth/Nothing.to.Hide.1080p.VOSTFR.SUBFORCED.WEB-DL.AAC2.0.torrent)\n\nSynopsis - Français\n====================\n\n« Nothing To hide » est un documentaire dédié à la question de la surveillance de masse et à son acceptation dans la population. Il est réalisé et produit par deux journalistes  Français et Allemand, Marc Meillassoux et Mihaela Gladovic. Le documentaire a été crowdfundé par plus de 400 internautes.\nNous nous accordons généralement à dire que les régimes de surveillance sont intrinsèquement liberticides et dangereux. Nous utilisons pourtant un nombre croissant de service et applications « gratuites » comme Facebook, Google, Whatsapp, etc. Les révélations Snowden ont démontré que les données récoltées par ces entités privées servent de matière première à la surveillance de masse (programmes PRISM, XKeyscore, etc.) La réponse à ce dilemme a été notamment fourni par Eric Schmidt, le PDG de Google, et est repris allègrement par nos politiciens : « Si vous n’avez rien à cacher, vous n’avez rien à craindre ». Ainsi, chacun d’entre nous peut continuer de bénéficier en toute sérénité de ces services « gratuits » en ligne, de se répéter « je n’intéresse de toute façon personne » et qu’à la fin « ils peuvent bien regarder, je n’ai rien à cacher ». La logique du « rien à cacher » à l’ère du Big data n’a encore jamais été interrogée. Eluder cette question nous empêche pourtant de répondre à une autre : quelle société sommes-nous en train de construire pour nous et les générations à venir ?\n\nLe réalisateur\nMarc Meillassoux est l’auteur et le réalisateur du documentaire. De formation économique, il commença dans la presse écrite à « La Correspondance Economique » à Paris. Après des séjours à Vienne et à Dresde, il s’installe à Berlin où il collabore pour différents journaux (La Tribune, Paris Berlin Magazine, Rue 89, Neues Deutschland, Imagine Demain le Monde,…). Il travaille par ailleurs régulièrement pour des formats magazines en télévision (France Télévisions, France 24, C dans l’air, ABC News, …) et est l’auteur du documentaire Feindliche Brüder (Les Frères Ennemis d’Ukraine) en 2015.\n"
		},
		{
			"post_id": 17,
			"title": "La tragédie de l’exponentielle ou un siècle de conscience écologique",
			"date_published": 1507652477.696,
			"body": "Ce texte est tiré de ce lien [blogs.mediapart.fr](https://blogs.mediapart.fr/denis-dupre/blog/061017/la-tragedie-de-l-exponentielle-ou-un-siecle-de-conscience-ecologique) 6 oct. 2017 Par denis dupre \n\nLa tendance exponentielle de la dégradation a été comprise en 1972 par les scientifiques hurluberlus du « club de Rome ». Les résultats sont choquants : si le business continue sans inflexion, les dégâts irréversibles entraineront une chute de population dès 2030. Ils écrivent un best-seller sur les limites de la croissance. Quant à nous autres, nous ne comprenons encore rien ! \nIl semble que le cerveau de l’homme peine à entrevoir la spécificité de la croissance exponentielle. Le Grand Vizir Sissa ben Dahir,  aurait inventé le jeu d'échec. Au roi indien Shirham qui lui demandait quelle récompense il souhaitait, le roué mathématicien aurait répondu  : « Majesté, je serais heureux si vous m'offriez un grain de blé que je placerais sur la première case de l'échiquier, deux grains sur la deuxième case, quatre grains sur la troisième, huit grains sur la quatrième, et autant de grains de blé qu’il serait possible de poser en couvrant  ainsi de suite les soixante-quatre cases ».\n\n« 1, 2, 4, 8, 16, 32… » a dû sûrement penser le roi, imaginant dans sa tête les 6 premières cases… Il répondit à son vizir inventeur «  Pas de problème ! Et c'est tout ce que tu souhaites Sissa, espèce d'idiot ? ».\n\nLe roi n’avait pas un cerveau de mathématicien. A la onzième case, il faut déjà 1024 grains de blé… puis tout s’emballe. Qui entrevoit que le nombre de grains demandé est de 18.446.744.073.709.551.615 ce qui correspond à 1000 fois la production mondiale de blé en 2012 ?\n\nTellement habitué aux évolutions  linéaires, le cerveau de l’homme non mathématicien n’appréhende pas une des particularités de la croissance exponentielle : sa vitesse. Cette incapacité d’intelligence est un des éléments qui nous permettent de comprendre l’évolution de notre conscience écologique. Notre cerveau nous fait intuitivement percevoir l’apocalypse écologique, pourtant prévisible à un horizon de 50 ans, comme un évènement possible à une échéance extrêmement lointaine.\n\nPour les besoins de notre démonstration, nous proposons d’imaginer un quelconque territoire découpé en 1024 unités de surfaces équivalentes, qui pourrait être par exemple la mer Méditerranée ou bien la planète entière. Pour simplifier, nous considèrerons que le système qui a organisé l’exploitation de ce lieu, n’a dégradé jusqu’en 1970 aucune de ces 1024 petites surfaces.\n\nExplorons, de 1970 à 2070, un siècle de conscience écologique.\n\nMinime anicroche en 1970 : 1 seule unité de surface est dégradée. Ce peut-être quelques fonds marins et quelques espèces de poissons si l’on a considéré comme territoire la mer Méditerranée, ou l’assèchement de la mer d’Aral si l’on a considéré la planète. Le millième de la surface s’est dégradé, mais qui s’en aperçoit ? Les habitants qui côtoient cette dégradation, sont les oubliés du jeu gagnant-gagnant de la mondialisation des échanges. Juste 7 hurluberlus, scientifiques de haute volée au sein du « Club de Rome » se posent la question du nombre d’unités qui seront à ce rythme dégradées en 2050. Ils modélisent des dynamiques qui se révèlent des exponentielles qui interagissent, en s’appuyant sur diverses données mondiales comme la production, la pollution, la population, etc. Les résultats sont choquants : si le business continue sans inflexion, les dégâts irréversibles entraineront une chute de population dès 2030. Ils écrivent un best-seller sur les limites de la croissance\n\nLéger  problème local en 1980 : 2 unités sont dégradées. Pourquoi se soucier de 2 unités sur 1024 ? Une explosion frénétique de douce consommation, appelée croissance, cache le problème sous le tapis. La question du futur ne se pose alors que pour quelques mathématiciens et certains écologistes. Ils se demandent toujours comment va augmenter cette dégradation : de manière linéaire ou exponentielle ?  Les deux tendances sont toutes deux encore envisageables puisque les séries linéaires et exponentielles commencent par les mêmes chiffres : d’abord 1, ensuite 2…\n\nL’accroissement linéaire atteint 1024 en 1024 coups : 1 (en 1970), 2 (en 1980), 3 (en 1990), puis 4, puis 5 ... et enfin 1024 (dans 10 000 ans)\n\nL’accroissement géométrique atteint 1024 en 11 coups : 1 (en 1970), 2 (en 1980), 4 (en 1990), 8 (en 2000), 16 (en 2010), 32 (en 2020), 64 (en 2030), 128 (en 2040), 256 (en 2050), 512 (en 2060), 1024 (en 2070).\n\nLe président américain Reagan est un non mathématicien, dont le cerveau pense linéaire. Il fustige donc en 1985 le travail du Club de Rome en  affirmant que pour l’Amérique il n’y a pas de Limits to Growth.\n\nPetit problème mondial en 1990 : 4 unités sont dégradées. Au Sommet de la terre de Rio en 1992, le petit monde des décideurs politiques flippe : et si le « Club de Rome » avait raison ? On vit trop bien cependant. Au moins ceux qui profitent au plus du système. Et il faut être réélu. Le président américain, Bush père, dénonce publiquement la pensée anti progrès du livre Limits to Growth. Dans le cerveau de Bush 1, 2, 4 n’est pas si loin de 1, 2, 3. Si la vitesse de destruction s’avère n’être finalement que linéaire, il reste 10 000 ans avant l’effondrement.\n\n2000-2010 : Problème mondial sérieux: 8 unités sont dégradées. Le GIEC confirme l’apocalypse climatique. Pourtant, ceux pour lesquels il fait si bon à vivre de surconsommation préfèrent retenir les doutes climato-sceptiques. Il reste 1016 unités saines. Ils redemandent aux scientifiques de vérifier leurs mesures et voir si d’autres facteurs n’entreraient pas en jeu : est-ce bien  1, 2, 4, 8 ? Les mesures des scientifiques ne sont-elles pas imprécises ? Toutes les complexités sont-elles bien prises en compte ?  La série ne redeviendra-t-elle pas finalement linéaire après deux anomalies, le 4 et le 8,  liées à d’autres causes qui ne se reproduiraient pas ?  Si c’était le cas, en 2070 ce ne seraient que 11 unités dégradées sur 1024, à peine 1% de la surface. Ce serait une fausse alerte de déclinistes grincheux et les inventions technologiques auraient le temps de nous sauver.\n\n2010-2020 : Risque de catastrophe: 16 unités sont dégradées. De ces unités dégradées, l’homme ne tire plus aucun moyen de subsistance. Ceci accélère la dégradation d’autres unités.  De nouveaux hurluberlus proposent de vivre « la décroissance » comme une solution à étendre à l’humanité entière : chacun se contentant d’une juste part.\n\nFace à la catastrophe (en 2020,  32 unités sont dégradées), la COP21 en 2016 se contente d’une mesurette. Elle cumule des promesses qui, même si elles étaient tenues, ne permettraient pas de limiter le réchauffement climatique à 2°C.\n\nLa COP 21 voudrait éviter la catastrophe sans toucher aux  écarts qui se creusent entre les riches et les pauvres et conforte le président Obama qui affirme alors que le mode de vie des américains reste  non négociable : pour que le mode de vie américain passe de 4 planètes à 1 planète, on mise sur la seule technologie et … on croise les doigts.  En 2017, pour la première fois la pauvreté dans le  monde ne baisse plus.\n\nLe choc en 2030 : 64 unités sont dégradées. Face à la catastrophe perceptible aux yeux de chacun, maintenant que 6% du territoire est détérioré, le cerveau humain reconnait le danger de la tendance exponentielle.\n\nPour freiner la dégradation de 6% de plus, promise à la fin de la décennie, deux options émergent.\n\nL’option de répartir égalitairement les consommations sans dépasser ce que notre planète fournit chaque année soit une division par 4 de l’ordinaire des habitants des pays riches et par 2000 des trains de vie des plus riches.\n\nL’option de laisser disparaitre en dix ans les 20% de la population qui consomment 6% de la production mondiale.  Soit 1,5 milliard d’humains.\n\nEmpêcheront-elles qu’en 2040, 128 unités seront dégradées ? En 2050, les 256 unités dégradées représenteront 25% de l’espace encore disponible. En 2060, l’humanité se partagera 50% de l’espace vivable. En 2070, la dégradation  exponentielle aura couvert la totalité du territoire.\n\nDe 1970 à 2070, la tragédie du temps…\n\nLa tragédie du temps si bien chantée par le poète Moustaki:\n\n« Pendant que je dormais, pendant que je rêvais\n\nLes aiguilles ont tourné, il est trop tard…\n\nCertains se sont battus, moi je n'ai jamais su\n\nPasse, passe le temps, il n'y en a plus pour très longtemps…\n\nPendant que je chantais, pendant que je t'aimais\n\nPendant que je rêvais il était encore temps »\n\nLa tendance exponentielle de la dégradation a été comprise en 1972 par les scientifiques hurluberlus du « club de Rome ».\n\nQuant à nous autres, l’exponentielle nous a surpris."
		},
		{
			"post_id": 16,
			"title": "Le numérique fait-il de nous des numéros ? ",
			"date_published": 1489083613.076,
			"body": "Les algorithmes sont-ils les nouveaux décideurs ou sont-ils, au contraire, un moyen d’accéder à des idées, contenus, données ou personnes inaccessibles ou invisibles jusqu’alors ?\n[Link France Culture à écouter ](https://www.franceculture.fr/emissions/la-methode-scientifique/le-numerique-fait-il-de-nous-des-numeros)\nTable ronde enregistrée à La Sorbonne dans le cadre du forum \"L'année vue par les sciences\" le 25 février 2016 .\n\nEt si le nom du prophète était, Patrick McGohan. Héros de la série Le Prisonnier, ça rappelle forcément quelques souvenirs aux plus de 20 ans, je m’explique, regardez le monde dans lequel nous évoluons aujourd’hui. L’omniprésence du numérique dans nos vies. Un « village » global où tout le monde, tout notre entourage numérique, nos « amis », se ressemble étrangement. Tout le monde s’entend bien, dans une sorte de concorde générale un peu étrange, parce que tout le monde a à peu près le même avis.\n\n\nIntervenants\n\n@Jean-Gabriel Ganascia : professeur à l’université Pierre et Marie Curie, chercheur en intelligence artificielle, président du comité d’éthique du CNRS\n@Benjamin Bayart : Président de la Fédération des FAIs (Fournisseurs d’Accès à Internet) associatifs et cofondateur de la Quadrature du net.\n@Antoinette Rouvroy : chercheuse qualifiée au Fonds de la Recherche Scientifique (FNRS), rattachée au Centre de recherche Information, Droit et Société de l'Université de Namur.\n\n"
		},
		{
			"post_id": 15,
			"title": "Quand la technologie déstabilise la #société - #disruption",
			"date_published": 1489082831.34,
			"body": "Bernard Stiegler, dans le cadre de son livre \"Dans la disruption : Comment ne pas devenir fou ?\". \n[Link youtube](https://www.youtube.com/watch?v=iYIogeKTzj0)\n\n"
		},
		{
			"post_id": 14,
			"title": "System76 : Des portables sous linux pour le grand public",
			"date_published": 1489081897.104,
			"body": "System76 c’est une équipe de créateurs qui se présente elle même comme de gros Nerds. Des gens qui se sont réunis autour d’un concept simple et évident : Concevoir et construire des PC libres, uniquement sous Linux. Si la boite est américaine leur production est évidemment délocalisée en Asie, difficile de faire autrement aujourd’hui.\n[System76 le site](https://system76.com/)\nSystem76 s’engage à proposer un matériel sous garantie “Open Hardware”. C’est à dire que l’utilisateur pourra modifier les composants internes de l’engin sans pour autant perdre la garantie de l’appareil.\nL’engin sera commercialisé sous Ubuntu dans sa dernière version, proposera un port USB 3.0 pleine taille, un lecteur de cartes MicroSD, des ports jack audio séparés pour le casque et le micro et enfin une prise d’alimentation. Rien de véritablement original mais un engin qu’il est aujourd’hui impossible de trouver en poussant la porte d’un magasin en France sous Linux aujourd’hui.\n\n\n"
		},
		{
			"post_id": 13,
			"title": "Bitcoin et Fee ?",
			"date_published": 1483804410.6,
			"body": "Le BITCOIN est très bien pour de grosses transactions, le besoin d'une valeur refuge, le stockage d'une information immuable, là, il prend tout son sens,mais pour les petites transactions,là, gros problème.\nOn ne peut acheter une baguette de pain ou un produit de faible valeur avec, j'explique: \nPour chaque transaction il y a des frais \"fee\"\nCe fee moyen pour janvier 2017 et de 0.20 Euro (0.0002034 BTC)\nDe cette valeur de fee dépend aussi la rapidité de la validation de la transaction par les mineurs,moins je mets de fee et plus le temps de transaction sera long.\nAvec un fee de 0.10 Euro (0.0001 BTC) on peut avoir jusqu'a 1 heure d'attente pour valider une transaction.\nPour avoir une transaction rapide (10 minutes) il faut au moins metre 0.30 Euro (0.0003 BTC).\n\n(j'ai pris une valeur de 1 BTC = 1000 Euro)\n"
		},
		{
			"post_id": 12,
			"title": "Le monde ou pas ",
			"date_published": 1479401459.026,
			"body": "Petit tour de ces dernières semaines bien agitée dans le monde informatique et politique.\n[Pékin veut introduire un carnet pour noter le comportement de ses concitoyens grâce aux mégadonnées](https://www.letemps.ch/opinions/2016/11/15/chine-laboratoire-cybertotalitarisme)\n\n[Le fondateur de Pirate Bay : \"J'ai abandonné\". Article du\n14 December 2015. Visionnaire le garçon ? ](https://motherboard.vice.com/fr/read/le-fondateur-de-pirate-bay)\n"
		},
		{
			"post_id": 11,
			"title": "ZeroNet - Le réseau Web décentralisé tuto video",
			"date_published": 1474735142.4,
			"body": "\nHello\n\nTrès bonne vidéo de Présentation du réseau ZeroNet en Français par paf Le Geek. \n[lien video Youtube](https://www.youtube.com/watch?v=T-o_4gllWrk)"
		},
		{
			"post_id": 10,
			"title": "The hidden service TOR .... \nouuuuuuhhhh trop Peur",
			"date_published": 1474733763.6,
			"body": "Bonjour,\n\nVoici quelques liens en .onion, donc pour des infos sur TOR \n[Tor Metrics, the primary place to learn interesting facts about the Tor network](http://rougmnvswfsmd4dq.onion/)\nhttp://rougmnvswfsmd4dq.onion/\n[Top-10 countries by directly connecting users](http://rougmnvswfsmd4dq.onion/userstats-relay-table.html)\nCountry \t                Mean daily users\nUnited States  \t350412 (20.81 %)\nRussia  \t                190070 (11.29 %)\nGermany  \t        170745 (10.14 %)\nFrance               \t  98463 (5.85 %)\nUnited Kingdom  \t  75722 (4.50 %)\nBrazil  \t                  45908 (2.73 %)\nJapan  \t                  43538 (2.59 %)\nItaly  \t                  41803 (2.48 %)\nSpain  \t                  39330 (2.34 %)\nCanada                  \t36738 (2.18 %)\n\n[Ahmia searches hidden services on the Tor network](http://msydqstlz2kzerdg.onion)\n[ The Uncensored Hidden Wiki](http://gxamjbnu7uknahng.onion/wiki/index.php/Main_Page)"
		},
		{
			"post_id": 9,
			"title": "L’enfermement algorithmique des réseaux centralisés",
			"date_published": 1473788068,
			"body": "Un algorithme est une suite finie et non ambiguë d'opérations ou d'instructions permettant de résoudre un problème ou d'obtenir un résultat.\n\nLes algorithmes des réseaux centralisés nous proposent Que ce que l’on aime consommer, regarder ou écouter.\n\nJamais ils ne nous proposent ce que l’on n’aime pas.\n\nLes algorithmes des réseaux centralisés récupèrent toute nos donner intimes (Politiques / sexuelles / familiales / santés /consommations...) pour mieux nous analyser, avec la justification qu’elles « améliorer notre expérience utilisateur ».\n\nCes données seront ensuite vendues sur des plateformes d’échange aux plus offrants, qui ne sont autres que des marques de produit ou de service que nous retrouvons dans nos sites et application favorites aux emplacements vendus par ces même vendeurs.\n\nNous fournissons gratuitement toutes nos données à des algorithmes de réseaux centralisés  qui permettent à d’autres algorithmes  de nous enfermer dans une expérience web qui nous rassure.\n\nLes états sécurisent notre expérience web en diabolisant l’utilisation des systèmes  décentralisés et anonymes qui nous permet pourtant de préserver nos données et notre liberté.    \n\nNous devenons des Moutons de panurge, suivant aveuglement ce que nous proposent les algorithmes des réseaux centralisés et les états.\n\nVoilà pourquoi il faut promouvoir les systèmes décentralisés et anonymes  comme Zeronet .\n\nComme cela nous pourrons vivre un web à l’échelle humaine ou l’on redécouvre le partage et la différence.  \n"
		},
		{
			"post_id": 8,
			"title": "Moteur de recherche Zeronet",
			"date_published": 1473002772.21,
			"body": "[zerosearch](http://127.0.0.1:43110/zerosearch.bit)\n[search kaffie](http://127.0.0.1:43110/search.kaffie.bit/)"
		},
		{
			"post_id": 7,
			"title": "Voir les enregistrements de connexion",
			"date_published": 1473002297.768,
			"body": "Voir les enregistrements de connexion\n\nPour voir les enregistrements de connexion, avec votre ip, connexions entrantes et sortantes ....\nil vous suffit d'aller sur\n[Stats](http://127.0.0.1:43110/Stats)\n"
		},
		{
			"post_id": 6,
			"title": "Benchmark de son installation ZeroNet",
			"date_published": 1473001984.739,
			"body": "Benchmark de son instance ZeroNet\n[Benchmark](http://127.0.0.1:43110/Benchmark)\nil mesure les performances en chiffrement de ta machine"
		},
		{
			"post_id": 5,
			"title": "ZeroMaps ",
			"date_published": 1473001230.041,
			"body": "[ZeroMaps ](http://127.0.0.1:43110/1yUji4qPD7GAog8XkP3EDMEfrL995S4Xd)\nCarte basique du monde "
		},
		{
			"post_id": 4,
			"title": " BwoiMusic Futur de la music en ligne ? ",
			"date_published": 1472926274.834,
			"body": "[ BwoiMusic ](http://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF/)\nShare music with your fans and your friends -- 100% free.\n\nNo hidden costs. No fees. Guaranteed.\nIntroducing Bwoi Music, a revolutionary way to listen to and share music.\n\nOn attend de voir ..."
		},
		{
			"post_id": 3,
			"title": "DES LIENS ZERONET \n\n",
			"date_published": 1472918944.167,
			"body": "Des liens cool \n[Wiki](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/)\n[OpenUser](http://127.0.0.1:43110/16g8mFUtLsQBM6bPMJ6xEEQWLWAufnzEXA/)\n[La mine](http://127.0.0.1:43110/1MNb8vJAyyYEhmn5Lo962DttpGE7NYp4Yp/)\n[ShinraIsAZero](http://127.0.0.1:43110/1BzRecLuaj3SuKDFQ1RXPpaNyUXbVjV89X/)\n"
		},
		{
			"post_id": 2,
			"title": "Liens divers + films",
			"date_published": 1472918874.134,
			"body": "[AstucesBlog](http://127.0.0.1:43110/1Jk4S2xDVTyZiZmJ71PyDKNiVAyp8gLmRf/)\n[PLAY](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/) FILMS  \n"
		},
		{
			"post_id": 1,
			"title": "Hello les zeroneteur !",
			"date_published": 1433033779.604,
			"body": "**"
		}
	]
}