{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "O tripé da Sociologia: Durkheim, Weber e Marx",
			"body": "#Émile Durkheim\nDavid Émile Durkheim foi um sociólogo, antropólogo, cientista político, psicólogo social e filósofo francês. Formalmente, criou a disciplina acadêmica da sociologia e, com Karl Marx e Max Weber, é comumente citado como o principal arquiteto da ciência social moderna e pai da sociologia.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Durkheim.html\n\n#Max Weber\nKarl Emil Maximilian Weber foi um intelectual, jurista e economista alemão considerado um dos fundadores da Sociologia. Seu irmão foi o também famoso sociólogo e economista Alfred Weber.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Max_Weber.html\n\n#Karl Marx\nKarl Marx foi um filósofo, sociólogo, jornalista e revolucionário socialista. Nascido na Prússia, ele mais tarde se tornou apátrida e passou grande parte de sua vida em Londres, no Reino Unido.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Karl_Marx.html",
			"added": 1573509499
		},
		{
			"topic_id": 2,
			"title": "Rede TVT",
			"body": "A TVT é um veículo de comunicação educativo que tem compromisso com a democracia , com  o fortalecimento da cidadania e com a justiça social: é  um espaço aberto para conectar pessoas, compartilhar opiniões, promover igualdade no acesso à informação e incentivar e divulgar conteúdos produzidos por cidadãos comuns.\n\nEssa emissora de TV dá voz aos movimentos sociais, está ao lado dos Direitos Humanos e investe em conteúdos analíticos, críticos e reflexivos para estimular o desejo de transformar a coletividade.\n\n- https://invidio.us/channel/UCmQTY7b5w61WlmBbJ5a8XrQ",
			"added": 1573517824
		}
	],
	"topic_vote": {
		"2_1K2GkqUrrLdofRNuwaM7vCZEsY4BC7nLEM": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1K2GkqUrrLdofRNuwaM7vCZEsY4BC7nLEM": [
			{
				"comment_id": 1,
				"body": "#O tripé da Sociologia: Durkheim, Weber e Marx (ft. Tese Onze)\n- https://invidio.us/T_tUOFvGEWg",
				"added": 1573509608
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 2,
				"body": "#Sócrates\nSócrates foi um filósofo ateniense do período clássico da Grécia Antiga. Creditado como um dos fundadores da filosofia ocidental, é até hoje uma figura enigmática, conhecida principalmente através dos relatos em obras de escritores que viveram mais tarde, especialmente dois de seus alunos, Platão e Xenofonte, bem como pelas peças teatrais de seu contemporâneo Aristófanes. Muitos defendem que os diálogos de Platão seriam o relato mais abrangente de Sócrates a ter perdurado da Antiguidade aos dias de hoje.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Socrates.html\n\n#Platão\nPlatão foi um filósofo e matemático do período clássico da Grécia Antiga, autor de diversos diálogos filosóficos e fundador da Academia em Atenas, a primeira instituição de educação superior do mundo ocidental. Juntamente com seu mentor, Sócrates, e seu pupilo, Aristóteles, Platão ajudou a construir os alicerces da filosofia natural, da ciência e da filosofia ocidental. Acredita-se que seu nome verdadeiro tenha sido Arístocles.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Plato.html\n\n#Aristóteles\nAristóteles foi um filósofo grego, aluno de Platão e professor de Alexandre, o Grande. Seus escritos abrangem diversos assuntos, como a física, a metafísica, as leis da poesia e do drama, a música, a lógica, a retórica, o governo, a ética, a biologia e a zoologia.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Aristotle.html",
				"added": 1573509968
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 3,
				"body": "#Fundamentos da matemática\n\nDenomina-se fundamentos da matemática a uma área de estudo que abrange tanto problemas da filosofia da matemática, como da lógica e da matemática. Ela teve a sua origem nas últimas décadas do século XIX e desenvolveu-se durante as primeiras décadas do século XX, como uma resposta à crise dos fundamentos gerada pelos paradoxos.\n\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Foundations_of_mathematics.html",
				"added": 1573510265
			}
		]
	},
	"comment_vote": {}
}