{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Поделитесь интересными ресурсами",
			"body": "0 list забит тоннами сайтов без комментария и описаний, тыкать в каждый из которых глупо, ИМХО. Zites в Wiki, в общем, не лучше.\n\nПоделитесь в топике живыми активными Зайтами, куда заглядываете сами. С кратким описанием и собственной оценкой.",
			"added": 1475593514
		},
		{
			"topic_id": 2,
			"title": "Кто-нибудь работал с Tahoe-LAFS?",
			"body": "Как раз, для хранилища файлов было бы неплохо использовать в ZeroNet. Но у меня есть вопросы.\n\nГлавный вопрос — безопасность данных. Я правильно понимаю, что вся секурность соединений там в непубличности introducer-uri? И стоит его выдать публично, то к сети сможет присоединиться любой желающий, но также любой желающий сможет забить всю эту сеть файловым мусором?\n\nТо есть невозможно разрешить присоединение нод, которые будут только хранить данные, но не смогут менять их?",
			"added": 1476518715
		},
		{
			"topic_id": 3,
			"title": "Локальная авторизация",
			"body": "Пытался на буржуйском форуме задать вопрос, но взаимопонимания не возникло...\n\nМожно ли как-то разрешить писать в свои ZeroTalk с локальной авторизацией (условно считаем её гостевой), а не централизованной zeroid.bit. Как-то плохо сочетается заявленная децентрализованность ZeroNet и вся авторизация через централизованный сервис, без которого общение на популярных ресурсах невозможно.",
			"added": 1480501114
		},
		{
			"topic_id": 4,
			"title": "Вопрос по русификации (почему не работает)",
			"body": "Есть два почти идентичных клона ZeroTalk:\n\n- [LOR.Talks](/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ)\n- [Infonesy.Talk](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC)\n\nВ первом с русификацией (вообще с интернационализацией) всё в порядке. Всё пишется на выбранном языке. Второй форум является колоном первого. Но выбор языка там не работает вообще, только английский.\n\nЕсть мысли, почему такое происходит? У меня все идеи уже иссякли :)",
			"added": 1499509311
		},
		{
			"topic_id": 5,
			"title": "Потеря ZeroID при каждом обращении — кто сталкивался?",
			"body": "Вот уже второй человек жалуется на пропажу ZeroID на ровном месте:\n\nhttp://www.balancer.ru/g/p6632685\n\nПервый раз: http://www.balancer.ru/g/p6503817\n\nКто-то с этим сталкивался? Один раз — может, какие-то глюки. Два — больше похоже на какую-то типичную проблему.",
			"added": 1535977299
		}
	],
	"topic_vote": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX": 1
	},
	"next_comment_id": 473,
	"comment": {
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 1,
				"body": "Хочу делать двухсторонний гейт Web <-> ZeroTalk. С забором данных из ZeroTalk никаких вопросов — тянем тупо посты/комменты из SQLite и счастливы. А вот как кошерно постить данные в ZeroTalk? Я, смотрю, данные дублируются и в JSON, и в SQLite. Значит ли это, что данные расходятся по сети в JSON, а SQLite — это их кеш для ускорения локальной работы? Получается, что мне придётся полученную информацию сохранять как в JSON, так и в SQLite? Есть ли какое-то более изящное решение?",
				"added": 1475650385
			},
			{
				"comment_id": 5,
				"body": "> [shift](#comment_292_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Тебе стоит работать только с json файлами\n\nДа, я уже разобрался. И читать можно, и писать в сеть. Было бы удобно иметь готовую распарсенную информацию в SQLite, но ZeroTalk имеет ужасную архитектуру. И читать SQLite бесполезно, всё равно за информацией в JSON лазить нужно :) Так что — проще сразу всё в JSON брать.",
				"added": 1476123908
			},
			{
				"comment_id": 32,
				"body": "> [mir](#comment_1_1BbDzdcpcHe9z1QVfWyuFpkzdFMLmpxBDP): Народ, подскажите что делать, установил ZeroTalk, при попытки написать что либо вылазит сообщение: \"File write error: Forbidden, you can only modify your own files\"\n\nПрав доступа не хватает. Видимо, ставил от одного пользователя, а запускаешь от другого.\n\nНужно или поменять права на нужного тебе пользователя, типа:\n```bash\nsudo  chown <user> ZeroNet -R\n```\n\nили дать всем права на запись:\n```bash\nchmod a+w ZeroNet -R\n```",
				"added": 1482083555
			},
			{
				"comment_id": 33,
				"body": "> [mir](#comment_2_1BbDzdcpcHe9z1QVfWyuFpkzdFMLmpxBDP): У меня винда, атрибуты на папки и файлы стоят чтение и запись\n\nЗначит, чего-то в правах не хватает. Хотя у меня ZeroNet под виндой работает «из коробки».",
				"added": 1482083764
			},
			{
				"comment_id": 34,
				"body": "> [mir](#comment_3_1BbDzdcpcHe9z1QVfWyuFpkzdFMLmpxBDP): Там дополнительно чтото настраивать вобще надо в файлах сайта?\n\nЯ ничего такого не делал. Скачал, распаковал, запустил, работает. Правда, свои сайты под Windows не поднимал, только пользовался как клиентом.",
				"added": 1482085422
			},
			{
				"comment_id": 81,
				"body": "> [zernon](#comment_4_1Dif4FhYssQJCe7hFdSDpVbrxEVmFvtYzz): Печально, в Торе достаточно включить расширение NoScript, но тут-то без скриптов не будет работать ничего.\n\n1. Tor Browser.\n\n2. В особо запущенном случае — TailOS в виртуалке.",
				"added": 1488474923
			},
			{
				"comment_id": 100,
				"body": ">Можно ли что нибудь удалить из папки зеронета, чтобы обезопасить себя от случайного запуска тора?\n\n` --tor {disable,enable,always}`\n\n`disable`",
				"added": 1494145235
			},
			{
				"comment_id": 101,
				"body": "> [hanamemo](#comment_1_149VTGbqfHkDvZqrsWxSHJ81hqoMNa799J): Писать буду на html. Но что дальше сделать?\n\nДля голого HTML вообще никаких тонкостей. Создал пустой зайт, разместил там нужный html, подписал, опубликовал. Самый простой вариант.",
				"added": 1494145307
			},
			{
				"comment_id": 129,
				"body": "> [zux](#comment_3_1MsnuK89hgwtHZDNLbWoTYppjbDktR8dzR): подскажите, есть проект который работает в клирнетах и имеет бд на sqlite как мне эту бд перенести в зеронетовскую бд моего зайта ?\n\nУ любых приложения формат БД свой собственный. Поэтому при переносе требуется конвертировать. И тут уже без разницы, в какой базе оно хранится.",
				"added": 1502532260
			},
			{
				"comment_id": 130,
				"body": "> [zux](#comment_4_1MsnuK89hgwtHZDNLbWoTYppjbDktR8dzR): но зеронет же сам создает бд и тут я хз что делать.\n\nВсе данные приходят в .json. То, что в sqlite — это кеш и сам пересчитывается из JSON. То есть для работы из своих приложений, нужно только сформировать правильные JSON и опубликовать результат.",
				"added": 1502553955
			},
			{
				"comment_id": 131,
				"body": "> [zux](#comment_5_1MsnuK89hgwtHZDNLbWoTYppjbDktR8dzR): можно ли вобще в папку с зайтом добавить симлинк на папку с данными ?\n\nНе пробовал, так что не знаю, как с файлами работает движок ZeroNet. По идее — ему должно быть всё равно, файл это или симлинк.\n\nНо тут вопрос концептуальный. ZeroNet не предназначен для раздачи больших объёмов информации. А малый объём и скопировать не жалко вместо создания симлинка.",
				"added": 1502554071
			},
			{
				"comment_id": 132,
				"body": "> [zux](#comment_6_1MsnuK89hgwtHZDNLbWoTYppjbDktR8dzR): я вот попробовал, и оказалось симлинки он не трогает\n\nА такие же файлы? В смысле, они точно подписаны были?\n\n> и если он скопирует симлинк то на другой машине он будет указывать в никуда\n\nВ том-то и дело, что через сеть копируются не файлы, а контент. Поэтому не думаю, что для ZeroNet есть разница, откуда этот контент взять.\n\n...\n\nВпрочем, я не поленился проверить — файлы по симлинку раздаются отлично. Например, см. каталог data в http://127.0.0.1:43110/16dZEVJ63ZMCRMpkMATt8nmN9QRWA4e89h — там cover.jpg это обычный файл, а mp3 — это симлинк.\n\nНо, повторюсь, раздавать больше файлы через ZN — плохая идея. Вот, положил один .mp3 и уже почти исчерпан дефолтовый лимит :)",
				"added": 1502559035
			},
			{
				"comment_id": 133,
				"body": "> [zux](#comment_7_1MsnuK89hgwtHZDNLbWoTYppjbDktR8dzR):  несоглашусь, в content.json: \"optional\": \"(optional_files/.*)\"\n\nНе важно, что ZeroNet технически может раздавать большие файлы. Важно, что это плохо ложится в её идеологию :)",
				"added": 1502590235
			},
			{
				"comment_id": 138,
				"body": "> [ukraine](#comment_1_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): База данных как-то синхронизируется и может скачиваться частично? Можно ли получать из базы только те данные, которые нужно?\n\nЗайты скачиваются целиком (кроме упомянутых выше опциональных файлов — они по запросу, как в GIF Time). Но сами зайты ты скачиваешь и хранишь только те, что тебе нужны.",
				"added": 1503222756
			},
			{
				"comment_id": 146,
				"body": "> [ukraine](#comment_5_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Трудно ли создавать сайты, которые бы работали и в обычном инете и здесь одновременно?\n\nЗависит от задач. Статические сайты и зайты будут работать одинаково.\n\nБлоги/форумы в лоб работать не будут, надо для обычного Интернета делать движки, понимающие формат данных зайтов. Или, как я, понемногу ковыряться с двухсторонней синхронизацией ZeroNet ↔ Internet. Например, сейчас сделал трансляцию ZeroBlogs → HTMLy Blogs: http://www.zites.cf/\n\nПозже сделаю трансляцию двухсторонней и аналогично сделаю для ZeroTalk ↔ Интернет форумы.",
				"added": 1503897546
			},
			{
				"comment_id": 147,
				"body": "> [ukraine](#comment_7_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): У тебя там Disqus не работает\n\nДа, я в курсе. И, в общем, пока ещё не спешу чинить. Я не уверен, что нужно комменты через Disqus делать. Не получится синхронизировать. А нативных у HTMLy нет.\n\n> Вообщем архитектурно такая возможность не рассматривалась\n\nНу, почему? Прокси есть, формат данных — открытый. Бери, да делай :)",
				"added": 1503918085
			},
			{
				"comment_id": 148,
				"body": "> [ukraine](#comment_8_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Были бы хотя б какие-то.\n\nПочинил. Но теперь кто-то может оставлять комментарии, а авторы блогов об этом и знать не будут :) Придётся делать и систему извещения о комментариях.",
				"added": 1503925355
			},
			{
				"comment_id": 149,
				"body": "> [gomzik](#comment_83_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): в смысле синхронизация односторонняя? Впрочем я и не удивлен)\n\nПока это всё делалось элементарно для индексации поисковиками, которые не дружат с ZeroNet через прокси :) А двусторонний синк блогов в ZeroNet возможен только по инициативе их авторов. Никто же не будет светить свои приватные ключи на постороннем ресурсе :) Т.е. для себя я сделаю двухсторонний синк, но будут ли это делать другие...\n\nВот с комментами немного проще. Можно оставлять комментарии от бота. Типа, «*там-то такой-то написал Вам это: ...*»",
				"added": 1503938880
			},
			{
				"comment_id": 150,
				"body": "> [ukraine](#comment_10_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): А нету таких возможности как генерирования многих приватных ключей на основании мастер-ключа и их разделегирования при надобности?\n\nНет. Тут один ключ — один контент. Понятно, что можно самому назначить другим пользователям произвольные ключи, но без понятия, как это на ZeroID автоматизировать. А без ZeroID комменты не примутся у клиентов. Наверное. Хотя надо попробовать :)\n\n> По стандарту биткоина\n\nZeroNet построена не на блокчейне. Чем и хороша по-своему :)",
				"added": 1503943589
			},
			{
				"comment_id": 152,
				"body": "> [ukraine](#comment_13_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Сделал siteSign и sitePublish, но 1JcpTgRn1Vc1A3nKqWHRYsDGcFykwGTnWd так и не появился в сети\n\nС первичным распространением зайта всегда есть сложности. Если ты только создал его и сделал `sitePublish`, то он сам по себе никуда ещё не уйдёт. ZeroNet в отличие от многих других p2p-сетей не химичит с трафиком, подсовывая кому-то что-то, что он не заказывал. Соответственно, и твой контент при первой публикации никуда не уйдёт.\n\nПравильный путь — `sitePublish`, оставить машину на раздаче, отдать ссылку кому понадобится. Когда скачают, тогда уже можно сниматься с раздачи (хотя зачем? — больше пиров, легче доступность).\n\nПрактический путь — после публикации сайта попытаться открыть его через один из открытых прокси. Прокси его скачает и оставит на раздаче. Минус в том, что прокси может забиваться никому не нужной информацией :)\n\nЕсть ещё тонкости — при первичной раздаче очень неохотно уходят данные через Tor. Точнее, очень сложно и долго находится нода-инициатор. Тут можно для ускорения процесса временно выключить Tor, загрузить зайт на доверенный прокси и снова включить Tor.\n\nТакже при изменениях в первую очередь, с высоким приоритетом уходят данные в `*.json`, а потом уже прочий контент (html, css, js). Поэтому при изменениях зайта файлы самого зайта могут расходиться дольше.",
				"added": 1503979875
			},
			{
				"comment_id": 155,
				"body": "> [ukraine](#comment_15_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Полагаю sitePublish надо делать только раз, после чего можно просто запустить python zeronet.py ?\n\nДа, так. Хотя, если это твоя единственная нода и сидит она за Tor, первичное извлечение данных может очень затрудниться.",
				"added": 1504061964
			},
			{
				"comment_id": 227,
				"body": "> [menvil](#comment_1_1JtKhL9JZbUZJKt6Sni8p6KdoTeX9f1uMD): Расскажите как обстоят дела с динамическими сайтами например на javascript.  Как далека система от этого что бы делать сайты с бекендом базой данных и так далее.\n\nПо сети распространяется подписанная пользователями статика. Статика эта может ходить в виде JSON с данными пользователя. Стандартный бэкенд такие JSON умеет собирать в SQLite и давать к ним доступ из JS-морды сайта. Так работают форумы, комменты к блогам, Wiki. Когда ты пишешь сообщение на форуме, JS морды дёргает бэкенд, через него добавляет сообщение в твой JSON и публикует его в сети. На других узлах принимают этот JSON, пишут в базу и показывают обновление на морде сайта.\n\nИспользование собственных централизованных бэкендов в этой схеме не предусмотрено. Да оно и невозможно, потому что суть ZN в децентрализации. То есть ты или должен писать в рамках этой структуры с распространением JSON и SQLIte-базами у каждого пользователя индивидуально, или ты где-то у себя работаешь со своей базой и просто из неё публикуешь данные в сеть (в том же JSON).",
				"added": 1512012879
			},
			{
				"comment_id": 333,
				"body": "Посмотрел на исходники ZeroTalk/ZeroBlog на CoffeeScript. Захотел позаниматься доработкой не на уровне патчей JS, а с оригинальным кодом. Почитал описание языка. Грусть и жесть, блин, зачем его выбрали? ИМХО, Coffee не менее ужасен, чем сам JS :)",
				"added": 1524294321
			},
			{
				"comment_id": 334,
				"body": "> [balancer73](#comment_333_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Посмотрел на исходники ZeroTalk/ZeroBlog на CoffeeScript.\n\nЗавёл форк: http://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/\n\nБуду пилить понемногу :) Подробонее — http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:42:Работа+над+ZeroTalk",
				"added": 1524309037
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 2,
				"body": "Кстати, в ZeroNet возможен параноидальный режим. Можно запускать браузер для работы с сетью только предварительно отключив внешний Интернет :)",
				"added": 1476088804
			},
			{
				"comment_id": 3,
				"body": "> [voland](#comment_6_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Хм, а где такой режим находится?\n\nНапример, можно выдернуть сетевой кабель из гнезда или выключить Wi-Fi :)",
				"added": 1476123665
			},
			{
				"comment_id": 4,
				"body": "> [shift](#comment_291_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): @linxon Если вы зайдете на сфеерический сайт с вирусом.exe - да он его скачает, но запускать естественно не станет\n\nРегулярно всплывают те или иные уязвимости, через которые всякие левосайты без подтверждения со стороны пользователя что-нибудь ставят в систему :) Сейчас, правда, реже стало, чем лет 5-10 назад, но иногда всё ещё попадается. Как правило винда, конечно.",
				"added": 1476123797
			}
		],
		"1_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw": [
			{
				"comment_id": 6,
				"body": ">This function is disabled on this proxy\n\nЗначит, включен режим прокси. Включен плагин Multiuser (который по умолчанию отключен).\n\nНа прокси все «административные» функции отключены.",
				"added": 1476189903
			},
			{
				"comment_id": 7,
				"body": "> [vvvolf](#comment_3_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw): Как включение Multiuser связано со включением режима прокси?\n\nПросто режим Multiuser и есть режим прокси :) И множественность аккаунтов подразумевается не для одного пользователя, а для разных.",
				"added": 1476194834
			}
		],
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 8,
				"body": "Ещё вопрос — можно ли как-то узнать, на сколько нод реально залился сохраняемый файл. В штатной информации об этом ничего не вижу.",
				"added": 1476520841
			},
			{
				"comment_id": 9,
				"body": "Залил файл на 144Мб на одну ноду. Смотрю — на ней лежит три таких зашифрованных файла. Т.е. storage занимает утроенный объём.\n\nСмотрю на другую, соединённую ноду — там два таких файла.\n\nНа третьей — три таких файла.\n\nГде-то ещё, может, и больше, у меня своих только три :) Не слишком жирно 8 дублей на трёх нодах?\n\nВ настройках пишу, что:\n```\nshares.needed = 2\nshares.happy = 3\n```",
				"added": 1476520854
			},
			{
				"comment_id": 10,
				"body": "Также не пойму сущность helper-нод.",
				"added": 1476521074
			},
			{
				"comment_id": 11,
				"body": "> [alexs](#comment_2_1JEFK9PSB2KTgS6vAR5u9iuQZ4QiRMp4vw): Судя по https://www.digitalocean.com/community/tutorials/tahoe-lafs там есть некий \"ro_uri\".\n\nR/O URI там есть. Но я не про взаимодействие с клиентом, а про взаимодействие нод-участников.\n\nСкажем, в BTSync можно опубликовать R/O-ключ и все, кто по нему подцепится, раздавать контент могут, а модифицировать или как-то иначе портить — нет. Вот тут было бы полезно иметь что-то подобное. Открыто публикуешь какой-то ключ и желающие могут цепляться по нему и поддерживать сеть и доступность данных. Но на практике, как я понимаю, такого нет. Т.е. раздавать контент через фиксированные гейты может любой участник, но все участники должны быть доверенными, т.к. любой из них может засрать сеть.",
				"added": 1476525791
			},
			{
				"comment_id": 12,
				"body": "Вот [пример R/O-раздачи файла](http://tahoe.ultimon.wrk.ru/file/URI%3ACHK%3Aqh4guq4wnveyw3qvol26scidpe%3Aauxntp4gfqiwfqbv3zm2jpwsdtp7fxxoqidarliuttclnsjbmnza%3A1%3A10%3A13136109/@@named=/%D8%B4%D8%A7%D9%87%D8%AF_%20%D9%84%D8%AD%D8%B8%D8%A9%20%D8%A7%D8%B3%D8%AA%D9%87%D8%AF%D8%A7%D9%81%20%D8%A7%D9%84%D8%AC%D9%8A%D8%B4%20%D8%A7%D9%84%D9%8A%D9%85%D9%86%D9%8A%20%D9%88%D8%A7%D9%84%D9%84%D8%AC%D8%A7%D9%86%20%D8%A7%D9%84%D8%B4%D8%B9%D8%A8%D9%8A%D8%A9%20%D8%B3%D9%81%D9%8A%D9%86%D8%A9%20%D8%AD%D8%B1%D8%A8%D9%8A%D8%A9%20%D8%A5%D9%85%D8%A7%D8%B1%D8%A7%D8%AA%D9%8A%D8%A9%20%D9%82%D8%A8%D8%A7%D9%84%D8%A9%20%D8%B3%D9%88%D8%A7%D8%AD%D9%84%20%D8%A7%D9%84%D9%85%D8%AE%D8%A7%D8%A1%2001-10-2016-XaMSb_7_3cM.mp4). Но — опять требуется выходная нода. Даже если она сама не является хранилищем (как в этом случае).",
				"added": 1476525849
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_10_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Также не пойму сущность helper-нод.\n\nАга, с этим я разобрался. Аплоад в Tahoe-LAFS более затратен, чем даунлоад. Т.е. твоя нода распихивает файл в N реплик по внешним серверам с избыточностью. Да ещё у многих исходящий канал более узкий, чем входящий. В таких случаях файл при аплоаде льётся на helper, а уже helper распихивает его по хранилищам. Т.е. это транзитная нода, облегчающая аплоад файлов.",
				"added": 1476529801
			}
		],
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 14,
				"body": "> [shift](#comment_302_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Закрыть доступ браузеру куда либо кроме 127.0.0.1\n\nПроще тогда сразу грузиться с TailOS :) Там оно из коробки всё, кроме выхода через Tor запрещено.",
				"added": 1480500638
			}
		],
		"1_1CR8tDsJR9pptbN3kMFP5BiCzCi5zrDfr9": [
			{
				"comment_id": 15,
				"body": "Есть же тема чуть ранее: [Поделитесь интересными ресурсами](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/)",
				"added": 1480530916
			}
		],
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 16,
				"body": "> [shift](#comment_307_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Можно поднять свой zeroid\n\nКак о нём узнают сторонние ресурсы?",
				"added": 1480530955
			},
			{
				"comment_id": 17,
				"body": "> [plalghef](#comment_1_1HC69hhiCSP6854LsZGouLAcZW9hKsZCKc): а как войти под другой учеткой?\n\n**data/users.json**\n```json\n  \"xxxxxxxxxxxxxxxxxxxxxxxxxxx\": {\n    \"certs\": {\n      \"zeroid.bit\": {\n        \"auth_address\": \"xxxxxxxxxxxxxxxxxxxxxxxxxxx\",\n        \"auth_privatekey\": \"xxxxxxxxxxxxxxxxxxxxxxxxxxx\",\n        \"auth_type\": \"web\",\n        \"auth_user_name\": \"balancer73\",\n        \"cert_sign\": \"xxxxxxxxxxxxxxxxxxxxxxxxxxx\"\n      }\n    },\n```\n\nВот эту секцию certs нужно скопировать.",
				"added": 1480531107
			},
			{
				"comment_id": 18,
				"body": "> [shift](#comment_309_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Что бы сайт начал поддерживать другого провайдера авторизации надо его вписать в настройках сайта\n\nВот поэтому оно и не приживётся.",
				"added": 1480583189
			},
			{
				"comment_id": 19,
				"body": "> [shift](#comment_312_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Почему же? \n\nПотому что несовместимо с имеющимися решениями.\n\n> OATH авторизация в интернете же работает\n\nА у OAUTH вообще был принципиально другой путь. Сперва появились реально крупные ресурсы со своей централизованной авторизацией, потом эту их авторизацию стали использовать другие сайты, чтобы не напрягать лишний раз юзера.\n\n...\n\nА, вообще, я вопрос когда задавал цель преследовал противоположную. Не о том, как на любом ZeroNet ресурсе юзать какие-то сторонние авторизации, а о том, как на конкретных своих ресурсах разрешить локальную авторизацию. Такое чувство, что всё это закладывалось — иначе нафига вообще юзерам выдаётся private key, который потом нигде не используется. А при выборе Sign In есть пункт \"Уникальный для этого сайта\" — при выборе которого ничего не происходит. Получается, функционал есть, но не используется.",
				"added": 1480677459
			},
			{
				"comment_id": 20,
				"body": "> [pztrn](#comment_12_1PChmSemiXAoFbhxQDUAivb4G5Qi7jUbUz): Или stub есть, но с появлением zeroid всем насрать %).\n\nZeroId невозможно пользоваться при работе через гейты. Любой чих — и всё, аккаунт не восстановить. Только теряются доступные имена. Ну и весело будет, когда он однажды накроется.",
				"added": 1480692029
			},
			{
				"comment_id": 21,
				"body": "> [pztrn](#comment_13_1PChmSemiXAoFbhxQDUAivb4G5Qi7jUbUz): Согласен, но чито делать?\n\nНе знаю. Я потому тему и поднял, думал, вдруг решение есть. Ну, мало ли, опция какая-то в настройках ZeroTalk есть, чтобы можно было постинг гостям включить :)\n\n> А на тему OAUTH - возможно оно тут и взлетит, кстати.\n\nВнешнее — может. Потому что тут народ не настолько пароноидален, как в RetroShare. Свой внутренний аналог — не взлетит. Во-первых, из-за отсутствия НАСТОЛЬКО крупных ресурсов, во-вторых, боюсь, OAUTH без куков реализовать нереально. А куки тут общие :)",
				"added": 1480698275
			},
			{
				"comment_id": 22,
				"body": "> [vlad20012](#comment_201_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Провайдеры  вроде zeroid выдают сертификат на сопоставления юзернейма с публичным ключем.\n\nВот и вопрос, почему нельзя писать под одним публичным ключом, без юзернейма. Фактически получается, что почти все публичные решения ZeroNet (ZeroTalk/ZeroBlog-комментарии/ZeroMe/...) сегодня повязаны в плане авторизации на один централизованный ресурс и без него неработоспособны.\n\nКстати, вот куда более параноидальная RetroShare не заморачивается вопросом никнейма. Любой может выбрать себе произвольный ник. И ничего, система никуда не пропадает :)",
				"added": 1480865321
			},
			{
				"comment_id": 23,
				"body": ">Правда zeroid тут не сильно помогает. \n\nИменно. В итоге у нас ни защиты от спама, ни свободы от единого центра авторизации :)",
				"added": 1480903108
			},
			{
				"comment_id": 24,
				"body": "> [vlad20012](#comment_204_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Если авторизацию вынести за скобки, то у нас любой юзер может крепить к любому сайту любые данные. В любом количестве. \n> И авторизация - способ владельцу сайта получит немного контроля.\n\nНе даёт авторизация никакого контроля. Ник от zerobit.id получается без всяких ограничений. Соответственно, любой юзер может получить сколько угодно ников и залить любые данные.\n\n>На zeroid.bit так и написано: \"This is a sample trusted authorization provider\". И по-моему это нормально хоть для каждого сайта запиливать собственного провайдера. \n\nНикто не будет пилить сторонних провайдеров и использовать их у себя, пока их нельзя использовать в ключевых приложениях — ZeroTalk/ZeroMe.",
				"added": 1481006429
			}
		],
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": [
			{
				"comment_id": 25,
				"body": ">\"Добавление комментариев возможно через ZeroNet\"; и ссылка на ZeroBundle.\n\nНа такое будут реагировать, где-то, один человек на сотню желающих комментировать. Желают комментировать где-то процентов 10 посетителей. Т.е. таким способом получится притащить в ZeroNet одного человека на 1000 регулярных читателей блога.  ИМХО, овчинка в таком виде не стоит выделки...\n\nЯ со своего форума, где ~5-10 тыс. уников в сутки и 100-150 тыс. просмотров  в сутки в ZeroNet, не смотря на рекламу, не смог затащить пока никого :D\n\nНа Хабре недавно была очередная статья по ZeroNet. Я полагаю, прочитало её тысяч 100 человек. В ZeroNet (судя по последующей активности в ZeroMe) отозвались только несколько из них.\n\nВ общем, это не тот способ, который сработает для привлечения народа :)\n\n...\n\nЯ так думаю просто делать полноценные двусторонние гейты (ZeroBlog/LiveStreet, ZeroTalk/форумы и т.п.) и плевать на посещаемость ZeroNet — буду пользоваться так, как удобно. А народ, если будет контент, появится сам :)\n\nВот чем реально сюда привлекать народ — это всяким блокируемым в обычном Интернете контентом. Книги, музыка, фильмы... Но тут вылезает другая проблема, низкий уровень анонимности (в сравнении с той же RetroShare). Всерьёз забить на правообладателей сложно. Нужно быть очень осмотрительным и осторожным. Но это — реально может привлечь пользователей. «Хотите поговорить о том-то и том-то — вам туда-то».",
				"added": 1481025146
			},
			{
				"comment_id": 26,
				"body": "> [vlad20012work](#comment_5_13JjWdv5tG618jWc7mCMtzGxHqXJYSzAd2): Только как без фрейма-то. Сайт не может работать без фрейма. \n\nСтатический сайт («R/O») может быть каким угодно. Хоть один `index.html` с «Hello world!»",
				"added": 1481025311
			},
			{
				"comment_id": 27,
				"body": "> [vlad20012work](#comment_6_13JjWdv5tG618jWc7mCMtzGxHqXJYSzAd2): Без фрейма только статичный index.html и будет работать.\n\nДля R/O-шлюза, о котором идёт речь, этого хватит. Смотрим за «честным» ZeroTalk/ZeroBlog и по его обновлению генерируем статическую версию сайта для раздачи через гейт.",
				"added": 1481026386
			},
			{
				"comment_id": 28,
				"body": "> [vlad20012work](#comment_7_13JjWdv5tG618jWc7mCMtzGxHqXJYSzAd2): Прогонять JS на сервере\n\nЗачем? Брать готовую инфу из JSON и SQLite. Там есть всё, что нужно для статики.",
				"added": 1481040322
			},
			{
				"comment_id": 29,
				"body": "> [voland](#comment_13_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): у ретры с анонимностью все очень плохо если вы об этом.\n\nВ любом случае намного лучше, чем в ZeroNet :)",
				"added": 1481040353
			},
			{
				"comment_id": 30,
				"body": "> [shift](#comment_317_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А зачем сравнивать P2P и F2F сети ?)\n\n«Зачем сравнивать рыбу и селёдку»? :)",
				"added": 1481092613
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 31,
				"body": "> [oo7o6y](#comment_11_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr): а чем навальный лучше путина? Притом на выборах выигрывает не тот кто голосует а кто считает голоса\n\nДа тут, хоть как считай — всё равно итог один.",
				"added": 1481914416
			}
		],
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 35,
				"body": "> [shift](#comment_332_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): получается, что биткоин отиграл все падения\n\nДа нет, на пике цены он $1200 стоил :)\n\n>продавать/покупать?\n\nТут я не советчик... Я упустил с ним кучу возможностей много раз :D Самоцитаты с моего форума:\n\n>Вчера курс криптовалюты Bitcoin (฿) на бирже впервые превысил отметку в $1,00 и в какой-то момент даже достигал $1,10... те, кто осенью-зимой скупал биткоины у населения [по $0.1], наварились в десять раз :)\n\n\n>Хех. Биткоины уже по $50 идут. Вот, ведь, можно было навариться, если б заранее знать :D\n\n\n>Уже по $100 :) Кто-то на повышение играет, что ли? Блин, за 10 дней можно было удвоить свои финансы. Но, есть подозрение, что пузырь может лопнуть, как в прошлом году с $30 до $5 скатилось \n\n\n>Мля. Bitcoin идут по $140.  Это 366% рост за месяц. Когда оно уже лопнет, а то аж зубы сводит :D \n\n...\n\n:D",
				"added": 1483454820
			},
			{
				"comment_id": 36,
				"body": "> [shift](#comment_337_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): 1200 это уже совсем на пике =) хотя мне кажется, что и 1200 мы увидим, говорят в Венесуэле начали преобщатся к прекрасному\n\nСейчас я думаю, что расти он ещё будет. Но не настолько уверенно думаю, чтобы рисковать вкладываться в BTC :)\n\n...\n\nЗнать бы, где упасть... Я пробовал его генерировать году в 2010-м, но не оценил профит :)",
				"added": 1483462638
			},
			{
				"comment_id": 37,
				"body": "Вот и снова $850 :)\n\nВолатильность радует, от $824 до $990 за сутки.",
				"added": 1483729710
			},
			{
				"comment_id": 157,
				"body": "> [miklosh](#comment_8_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): далеко не каждый человек сможет владеть ЦЕЛЫМ биткоином\n\nЭто не важно, так как биткоин не обязан быть не только целым, но и даже миллибиткоином или микробиткоином :) Сатоши — это одна стомиллионная биткоина или 10 микробиткоинов :D\n\n> а ведь когда-то было достаточно клацнуть на кнопку в кошельке и на баланс падало аж 50 монеток\n\nЯ это время не застал. Когда Биткоин стоил $0.1, то никаких кнопок не было, когда стоит $1, то по 50 биткоинов мало кто рисковал покупать. Я — не рискнул. Потом локти кусал :D — http://www.balancer.ru/g/p2370271",
				"added": 1504117360
			},
			{
				"comment_id": 158,
				"body": "> [miklosh](#comment_9_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): ты кстати как, в биток так и не зашёл?\n\nС покупками — нет. В 2014-м я баловался тем, что майнил альткоины и продавал потом за биткоины. Накопил 0.25 BTC,  но они лежали у Cryptsy, [а потом её ломанули](https://xakep.ru/2016/01/18/cryptsy-face-bankruptcy/) :) Сейчас была бы халявная штука баксов :) А вкладываться, в смысле специально покупать, я так и не рискнул.",
				"added": 1504148375
			},
			{
				"comment_id": 194,
				"body": "$5000\n\nhttp://www.forexpf.ru/bitcoin/",
				"added": 1507799083
			},
			{
				"comment_id": 240,
				"body": "> [linecuber](#comment_1_1GaK8HhvLbxeQK4FLSmAEEd9P6v3eaAH9G): Тем временем биткоин превысил 13к за штуку\n\nУже и $15k :)",
				"added": 1512656182
			},
			{
				"comment_id": 241,
				"body": "> [suchdecentral](#comment_2_15S2W9ZZSUjHXoCabWp8rcirHQefmRN7dg): Когда ждать снова по $1000?\n\nНу, вот, на форуме у нас есть тема «Нефть, опять 25» :) До сих пор не переименовываем :D",
				"added": 1512656212
			},
			{
				"comment_id": 245,
				"body": "$17000",
				"added": 1512692928
			},
			{
				"comment_id": 246,
				"body": "> [difrex](#comment_6_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): Подскажите надежные обменники BTC->USD/RUR\n\nНе знаю, я с этой темы спрыгнул, когда у меня BTC 0.25 на взломанной Cryptsy увели, когда Биткоин ещё по ~$400 был :)",
				"added": 1512729605
			},
			{
				"comment_id": 247,
				"body": "> [difrex](#comment_7_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): Я храню приватные ключи на бумаге =)\n\nТак там увели не ключи, там кошелёк был. Биржа же :)",
				"added": 1513087856
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 38,
				"body": "Слепил наскоро на коленке небольшую заметку, что такое ZeroNet и как его ставить: http://zeronet.a0z.ru/\n\nМожете поспособствовать распространению :)",
				"added": 1484671749
			},
			{
				"comment_id": 206,
				"body": "> [blinkel](#comment_12_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Что за зверь \"Фидонет\"?\n\n- https://ru.wikipedia.org/wiki/Фидонет\n- http://lurkmore.to/Фидо",
				"added": 1509160577
			},
			{
				"comment_id": 215,
				"body": "> [xlx](#comment_2_124y1JubYCp5avtABP5vsHNmfne573cNJg): Может у вас тут есть чего интересного?\n\nЕсли конкретно моё, то:\n\n- http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n- http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n- http://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/\n- http://127.0.0.1:43110/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/\n- http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/\n- http://127.0.0.1:43110/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/\n- http://127.0.0.1:43110/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/\n- http://127.0.0.1:43110/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/\n- http://127.0.0.1:43110/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/\n- http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/\n- http://127.0.0.1:43110/1AdhUSJLmpUE7Aq5nPBkUuxgcWaUfqtS84/\n- http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/balancer73@zeroid.bit\n\nЭто, в общем, не всё и во многом тоже эксперименты, но на ZN я делаю очень большую ставку на будущее :)",
				"added": 1509875572
			},
			{
				"comment_id": 221,
				"body": "> [zeronetuser10050](#comment_1_14J96f5Tgf1ZqLfvjU5cVV6AJhgcAmkCC2): наплыв китайцев хороший знак значит не так крепка стена\n\nGCW в нынешнем варианте плохо поможет против ZeroNet. Это надо целенаправленно у конечных провайдеров убивать. Китай пока это не делает. А просто выход за границу блокировать тут не поможет. Достаточно одной ноде однажды пролезть, чтобы протащить контент основных зайтов.\n\n> где тут зеркало рутрекера ?\n\nС этим пока никак. Только магнеты буржуйских фильмов/сериалов в Play и т.п.\n\nhttp://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:1_1GkRidai8zywUN1oeqjoSWQcLNDPHY2eHF/+Play",
				"added": 1510680351
			},
			{
				"comment_id": 228,
				"body": "> [hugeping](#comment_1_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Зашел посмотреть на зеронет. Прикольная штука!\n\nНе с ЛОРа, часом? :)",
				"added": 1512152652
			},
			{
				"comment_id": 230,
				"body": "> [floodping](#comment_1_1DvqmS7maVsxLZJmCn6NEtnfS7hVKskvdk): Пока изучаю материал, чтобы сделать нормальный сайт инстеда тут.\n\nДля голой статики (включая автономный JS) изучать ничего не нужно, просто создать по `siteCreate` новый пустой зайт, поместить данные и опубликовать.\n\nВот если нужна активная динамика с пользовательскими данными — тогда да, нужно разбираться с API :)",
				"added": 1512275507
			},
			{
				"comment_id": 321,
				"body": "> [wesy](#comment_4_15EL3nJs2b9AXWTtniTkV9Jq77n67nMVCH): Не слишком людно\n\nНа каждом ресурсе по отдельности — не людно. Особенно на русских ресурсах. Да и затишье сейчас. А вот как кучу форумов, блогов, загрузишь, да ещё ZeroMe и прочее — и уже сравнимо с каким-нибудь средним обычным Интернет-ресурсом :)\n\nВот тут есть ссылки некоторые для затравки: http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG",
				"added": 1522342065
			},
			{
				"comment_id": 322,
				"body": "> [wesy](#comment_4_15EL3nJs2b9AXWTtniTkV9Jq77n67nMVCH): Не слишком людно\n\nИ, да, на http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ был? :) Там народа ещё меньше, но зато чуть привычнее :D",
				"added": 1522342169
			},
			{
				"comment_id": 323,
				"body": "> [wesy](#comment_7_15EL3nJs2b9AXWTtniTkV9Jq77n67nMVCH): сеть-то хорошая, надо будет сюда контента притащить.\n\nВот, самый большой бонус ZeroNet, что тут можно не торопиться. Если контент хоть немного интересен, то он будет накапливаться и не исчезнет :) Так что, даже если тут сейчас мало полезного, то местный контент не постигнет судьба gentoo-wiki, форумов Steam и т.п.",
				"added": 1522389715
			},
			{
				"comment_id": 324,
				"body": "> [anotherneko](#comment_28_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Количество контента на каждого пользователя ограничено\n\nЭто касается только комментариев. А я, все же, больше о статьях/блогах.\n\nНо и в случае комментариев на форумах не проблема. Кому тесно и владельцы форумов лимиты не увеличивают, всегда могут сделать клон с увеличенными лимитами, типа http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/ :)",
				"added": 1522422007
			},
			{
				"comment_id": 342,
				"body": "> [dd6587](#comment_1_1FMwgiSBx4y4nrpmACn8fvWYaGtyhPBRoY): тем медленнее про него узнают бляди из кремля.\n\nВ Китае про ZN знают, активно с ним борются и возможностей у них куда больше. Но ZN там жива :)",
				"added": 1524663939
			},
			{
				"comment_id": 462,
				"body": "> [caramba3000](#comment_2_16ez7GDqEFFKrSVJy14VQqRpZMP7XJfTxn): Чего тут есть интересного?\n\nНавскидку: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/?Post:2:Русскоязычные+сайты\n\nА так, можно начать с http://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1543074372
			},
			{
				"comment_id": 468,
				"body": "> [mistalero](#comment_23_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Инстед - это который движок для текстовых игр?\n\nУгумс: [Блог «Краски Сентября»](/1HVhvrompfwLstJExofKAQ5mMss7YivVDj/)",
				"added": 1544547179
			}
		],
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 39,
				"body": "> [vlad20012](#comment_240_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Чето он сходу больше 10 мб\n\nФоточки, видимо, потому что.",
				"added": 1484705094
			},
			{
				"comment_id": 377,
				"body": "> [qiwi](#comment_5_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): чета не работает этот ваш реддит. квадратики переливаются, типа грузится, но ничего не происходит. :(\n\nТам больше 10Мб размер сейчас (15Мб) — запрос на увеличение размера был и подтверждён?",
				"added": 1527909289
			},
			{
				"comment_id": 381,
				"body": "> [qiwi](#comment_9_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): Чёт дохлый этот ваш реддит. Одни иероглифы. :(\n\nТам в движке косяки: http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUwtopic7\n\nСейчас при попытке разместить фотку + текст, текст не выводится.",
				"added": 1528019440
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 40,
				"body": ">USED: 29.1K/30K\n\nВсё, комменты на этой доске у меня почти выговорены :)",
				"added": 1484710552
			},
			{
				"comment_id": 41,
				"body": "> [zalex](#comment_60_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А не проще-ли в ZeroHello через раздел \"Files\"? (слева под логотипом кнопка)\n\nКаша с этими лимитами какая-то. (О! Тут с 30к до 100к подняли лимит ;) ). У меня на нескольких машинах занято только 4% из выделенных 10Мб. А все фотки страше ~3 недель, что я в ZeroMe выкладывал (и на 4-5 машинах поддерживал!) исчезли уже. Примеры:\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1482038517\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1482029913\n\nПри чём они ещё и сторонним народом активно поддерживались. Кажется, видел цифры ~12 раздающих.\n\nТак что я зарёкся выкладывать фотки в ZeroMe в смысле хранения. Только в блог в IPFS, а в ZeroMe — нотификацию :)",
				"added": 1484748902
			},
			{
				"comment_id": 42,
				"body": "> [vlad20012](#comment_244_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Может надо issue зарепортить? Если это твои фотки, то почему они у тебя удаляются?\n\nДля issues нужно хоть какую-то диагностику. А то «*Дорогие учёные. У меня который год в подполе происходит подземный стук. Объясните, пожалуйста, как он происходит*». А у меня никакой информации на этот счёт нет. Фотки пропадают и всё :)",
				"added": 1484793065
			},
			{
				"comment_id": 43,
				"body": "Можно пойти и «наплыть» там на русском :)",
				"added": 1485092523
			},
			{
				"comment_id": 69,
				"body": "> [kilobyte](#comment_2_19A74DXptNyJw9ZRwxDZteyS5J7ncoYvi8): https://bit.surf:43110/1MoAyNQAaTbMFmTCTMiRz7uHV9KzeEZL8W - Зверь-Rutracker\n\nА зачем ссылку давать на сторонний прокси? :) Что мешает дать ссылку от корня сайта? — [вот так](/1MoAyNQAaTbMFmTCTMiRz7uHV9KzeEZL8W/)\n\n...\n\nА автору этого зайта — описание (инфо) тоже пусть размещает в ZeroNet. Понятно, что все тут могут обойти блокировку Роскомнадзора, но тогда какой смысл в ZeroNet? :) Наличие описания позволило бы выбирать, что скачивать, вообще не выходя за пределы ZN. И когда однажды Rutracker закроется, его контент не пропадёт.",
				"added": 1487221656
			},
			{
				"comment_id": 70,
				"body": "> [mist](#comment_5_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Ровно затем, зачем качать кинцо, когда можно онлайн смотреть.\n\nКино онлайн нормального нет, а вот прона — дофига :)\n\n...\n\nВпрочем, кино сегодня тоже многие онлайн смотрят.",
				"added": 1487287205
			},
			{
				"comment_id": 71,
				"body": "> [dragonna](#comment_1_15K5EuZ7F2jmMxxiacTU9Qc5pxsq5cPcVa): Вот так заходишь в даркнет впервые в жизни, а тут опять про прон)\n\nХорошо, хоть не про Гитлера :)",
				"added": 1487292256
			},
			{
				"comment_id": 72,
				"body": "> [dragonna](#comment_3_15K5EuZ7F2jmMxxiacTU9Qc5pxsq5cPcVa): Народ, скажите мне, для чего вы используете зеро? Я чисто с практической целью интересуюсь, потому что лично меня сюда привело чистое любопытство.\n\nЯ, во-первых,  интересуюсь этой платформой в плане защиты от блокировок и  обсуждения вопросов, которые при полной невинности перед законом могут быть легко блокированы по хотению левой пятки Роскомнадзора.\n\nВо-вторых, техническая реализация быстрого p2p-обмена между заранее не скоординировавшимися нодами интересна для моих собственных проектов из «обычного» Web'а.",
				"added": 1487426883
			},
			{
				"comment_id": 73,
				"body": "> [dragonna](#comment_5_15K5EuZ7F2jmMxxiacTU9Qc5pxsq5cPcVa): если только ради бложиков, то сомнительное преимущество\n\nНе сомнительное. Мне очень импонирует возможность хранить данные в отсутствии зависимости от центрального сервера. Я так терял уже наработки своих друзей — после их смерти, после прекращения оплаты за хостинг пропадали очень интересные проекты. Располагались бы в ZeroNet — их труды были бы живы до сих пор. Конечно, есть ещё специализированные сторонние сервисы, типа WordPress или даже соцсетей — но они тоже не вечны. И там тоже уже бывали потери.",
				"added": 1487427061
			},
			{
				"comment_id": 74,
				"body": "> [avoiddowntime](#comment_10_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Кстати вот интересный кейс.\n> Скажем на хабе в ZeroMe выложил кто-то фотки не совсем одетых несовершеннолетних и присовокупил еще кучу магнетов на раздачу того-же добра (там такое есть, да), ты как простой обитатель того же хаба, в глаза этого не видишь и вообще всяческий противник, но хаб лежит в т.ч. и у тебя на диске.\n\nФотки в ZeroMe не качаются к тебе на ноду, пока ты сам их не откроешь. И не хранятся потом долго, если ты принудительно не отметишь их раздачу.\n\nЕдинственный случай такого кейса — это когда ты скачал чей-то блог, до конца не досмотрел, удалять не стал, а там где-то в конце (или скрыто в потрохах) это самое. Но это более экзотический случай.",
				"added": 1487427216
			},
			{
				"comment_id": 75,
				"body": "> [mist](#comment_8_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Ещё, конечно, если хранить весть опциональный контент.\n\nЭто где-то включается? Не видел такого. У меня, вон, обратная проблема, пропадают собственные фотки в ZeroMe, которые поддерживаются множеством серверов через «Help to distribute» :)",
				"added": 1487427482
			},
			{
				"comment_id": 91,
				"body": "> [vvvolf](#comment_13_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw): Подскажет кто, как такую ссылку оформить?\n> https://ru.wikisource.org/wiki/%D0%9D%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D1%8B%D0%B5_%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B5_%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B8_(%D0%90%D1%84%D0%B0%D0%BD%D0%B0%D1%81%D1%8C%D0%B5%D0%B2)/%D0%9A%D0%BE%D0%BB%D0%BE%D0%B1%D0%BE%D0%BA\n> Принятая конструкция ссылки не работает - закрывающая скобка, имеющаяся в ссылке, всё ломает.\n\nurlencode. Например, так: [Моя ссылка](https://ru.wikisource.org/wiki/Народные_русские_сказки_(Афанасьев%29/Колобок)",
				"added": 1491882742
			},
			{
				"comment_id": 94,
				"body": "> [vvvolf](#comment_15_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw): Круто, конечно, работает :-) но совсем не наглядно.\n\nПардон, не обратил внимания, что при ответе в цитате ссылка вырезается. Думал, будет видно :) Да, я просто скобку закрывающуюся закодировал, `)` в `%29`: `[Моя ссылка](https://ru.wikisource.org/wiki/Народные_русские_сказки_(Афанасьев%29/Колобок)`",
				"added": 1492710885
			},
			{
				"comment_id": 103,
				"body": "> [gomzik](#comment_47_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Подвыпал я на полгода так из зеронета. Что тут нового у нас?\n\n- Картинки в блогах и ZeroMe\n- Редактор в блогах\n- Возможность отдавать файлы из архивов (ИМХО, не особо востребовано)\n- Всякие мелочи и в приложениях, и в протоколе\n\nРеволюционного ничего нет, но сеть итак хорошо функционирует :)",
				"added": 1494568257
			},
			{
				"comment_id": 104,
				"body": "> [gomzik](#comment_48_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): В ZeroMe видел упоминание 0Git\n\nЕсли речь о http://127.0.0.1:43110/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/ — то я так и не пощупал.",
				"added": 1494568314
			},
			{
				"comment_id": 105,
				"body": "> [gomzik](#comment_47_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Что тут нового у нас?\n\nМожешь заглянуть на:\n\n- http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n- http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n- http://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/\n\nАктивность слабенькая, но есть :)",
				"added": 1494568554
			},
			{
				"comment_id": 145,
				"body": "> [netrider](#comment_1_15MPsT32EJTpwfoPqpobN8RarvkA65yfqw): Здравствуйте Люди! Меня зовут робот Александр. Чем я могу быть полезен для вас, людей?\n\nТак надо:\n\n- Здравствуйте, меня зовут Александр и я робот.\n- (хором) Здравствуй, Александр!",
				"added": 1503598203
			},
			{
				"comment_id": 190,
				"body": "> [zerostorm](#comment_29_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni): Из всего интернета только у китайцев популярен зеронет. Почему? Из-за блокировок.\n\nА почему у японцев так популярен Mastodon? :)",
				"added": 1507315666
			},
			{
				"comment_id": 193,
				"body": "> [tokyomewmew](#comment_6_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Раз на то пошло, подкиньте японских мессенджеров/ соцсетей\n\nВот, я и пишу, что в Мастодонте японцев больше всего :)\n\n...\n\nХм. Вот, опять они, федеративные сети :) Хотел дать ссылки на несколько профилей японцев,  что меня фолловили, когда я с Мастодонтом экспериментировал — а все их аккаунты на их сервере прибиты. Похоже, всех, с кем контактировал на pawoo.net выпилили. Но, в общем, если ткнуться в эту ноду, то там по японски много понаписано. Наверное, живо что-то :)",
				"added": 1507563976
			},
			{
				"comment_id": 197,
				"body": "> [f1rts0ne](#comment_2_1DLxseC9WZM3yfXj8XYhK5NBfepRPMcM2B): И ни одного пакета мимо тора?\n\nЭто уже от твоей системы и браузера зависит. ZeroNet доставляет приложение, если нужно, «ни одного пакета мимо Тора». Но само приложение, его JS, работает в браузере уже самостоятельно. Ничто не мешает ему отправить пакет куда угодно напрямую. Соответственно, хочешь гарантированной анонимности — браузер должен работать в песочнице.\n\nВпрочем, для совсем параноидального режима можно на время работы из браузера совсем выключать Интернет-соединение :) Читать ZeroNet это не помешает. Писать, как правило, тоже.",
				"added": 1508208987
			},
			{
				"comment_id": 199,
				"body": "> [undyingfirewall](#comment_1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Всем привет. Слышал здесь кто-нибудь про Фидонет?Сеть на анонимная, но тоже децентрализованная\n\nКхм :) Тут два противоположных искажения :D\n\n1. Технически сеть была вполне себе анонимная, подмешивай в транзитный трафик любую анонимную инфо, любой её примет. А вот организационно, в FIDO-конференциях, все авторы, как правило, подписаны реальными именами. Но это просто принятое правило. За нарушение которого возможны наказания, но правило — не техническое.\n\n2. Сеть не только не децентрализована, она имеет жёсткую иерархическую структуру и строго управляется :) Она является распределённой, но жёстко централизованной :)\n\n> Origin: We will stand for Everfree (2:5023/24.2868)\n\nА я был 2:5020/1262.5 :)",
				"added": 1508804650
			},
			{
				"comment_id": 200,
				"body": "> [sigma7](#comment_6_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): ну не жестко. собравшись командой можно было попросить для себя отдельный сетевой номер и жить со своей версией устава.\n\nЭ... Если ты анонимность, то я так и писал, что деанонимизация была чисто административным решением.\n\nЕсли про структуру — то своя реализация сети всё равно такая же жёстко структурированная будет, только под своим управлением :) А так — да, я начинал, как раз, с альтернативной сетки — `418:69/0.2@AlfNet`",
				"added": 1508826111
			},
			{
				"comment_id": 201,
				"body": "> [sigma7](#comment_5_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): современный аналог наверное будет федерации\n\nДумаю, что современного популярного аналога нет. Но это точно не федерация. В федерации может накрыться любой сервер и на сети это не скажется. Роутинг организуется внефедеративными протоколами. ФИДО была более жёсткой и отказ любого из многих узлов мог привести к отказу всей сети. Только отказ конечных узлов с их поинтами не сказывался на сети.",
				"added": 1508826275
			},
			{
				"comment_id": 202,
				"body": "> [stre10k](#comment_12_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx): Это отказ каких узлов мог привести у отказу всей сети?\n\nХабы бекбона же :) Понятно, что это всё быстро исправлялось вручную перенастройкой маршрутизации, но без исправления при таких отказах сеть разваливалась.\n\nХотя, конечно, «отказ всей сети» — я не совсем точно выразился. Части сети работать смогут. Но вот сеть, как единое целое — уже нет.",
				"added": 1508830663
			},
			{
				"comment_id": 204,
				"body": "> [sigma7](#comment_7_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): фидо живо ещё?\n\nЖиво, но жизни в нём меньше, чем даже в ZeroNet :)",
				"added": 1508913939
			},
			{
				"comment_id": 205,
				"body": "> [sigma7](#comment_11_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): если в процессе работыкакой либо сервер уйдет в даун, то клиент перескакивает на другой досупный сервер. это делало приложение.\n\nЭто не федерация, это обычная децентрализованная сеть — клиент же в этом случае может работать через любой узел сети, не обязательно «его» серверу падать :)",
				"added": 1509085578
			},
			{
				"comment_id": 207,
				"body": "> [sigma7](#comment_12_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): тогда я точу услышать ваше определене/ описание федерации\n\nТак примерно: http://127.0.0.1:43110/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:4:Виды+социальных+сетей+с+точки+зрения+распределённости\n\nКонкретно федеративными являются уже упомянутые тут E-Mail и XMPP. А из социальных — Diaspora. Movim, все виды StatusNet (GNU Social и Mastodon).",
				"added": 1509177571
			},
			{
				"comment_id": 208,
				"body": "> [geekless](#comment_3_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):  Мне кажется, в zeronet элементы федеративности можно найти в системе айдишников.\n\nОно не просто элементы, это прямо централизованный компонент :) Хотя он не является ключевым и критическим элементов для ZN. В режиме чтения ZN будет работать и без него, а для записи — потребует правки приложений, но после исправления продолжит работать.",
				"added": 1509177674
			},
			{
				"comment_id": 209,
				"body": "> [geekless](#comment_4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если провайдер имеет server-side в clearnet-е, можно уничтожить провайдера, и тогда станет невозможна регистрация новых пользователей, но не работа уже подписанных.\n\nДа, так.",
				"added": 1509253948
			},
			{
				"comment_id": 213,
				"body": "> [tokyomewmew](#comment_18_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Киньте ссыль на андроид? Я запутался\n\nhttps://play.google.com/store/apps/details?id=net.mkg20001.zeronet",
				"added": 1509525847
			},
			{
				"comment_id": 220,
				"body": "> [sj43i](#comment_1_147qY6bjsNggYfjTiNCGPm4bp1xaJwmRp9): есть кто живой ?\n\npong",
				"added": 1510234291
			},
			{
				"comment_id": 242,
				"body": "> [linecuber](#comment_3_1GaK8HhvLbxeQK4FLSmAEEd9P6v3eaAH9G): Есть ли народ из Москвы? Мне бухать не с кем\n\nБухать в одной фазе тут явно не получится :)",
				"added": 1512656254
			},
			{
				"comment_id": 243,
				"body": "> [unknownusername](#comment_3_13yfHGtGHMJpTvGdkDzushc7inBDjZRtcM): Безопасно ли то приложение, которое есть в google play?\n\nНу, я ставил на пощупать, но ключи приватные не вводил, так, на почитать тестировал. Для себя не посчитал удобным, так как я то же самое имею при работе через свои прокси через браузер.",
				"added": 1512688963
			},
			{
				"comment_id": 260,
				"body": "> [durons](#comment_1_1PFcToy38oZa2sfyss4ZYcRjVRQy86ruZm): А вообще эта сеть живая?есть какая нибудь статистика?\n\nhttp://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:26:География+ZeroNet",
				"added": 1514465093
			},
			{
				"comment_id": 284,
				"body": "> [undyingfirewall](#comment_4_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Уже существуют альтернативные провайдеры имён?\n\nСуществуют, но большинство зайтов их не поддерживают.",
				"added": 1518661482
			},
			{
				"comment_id": 285,
				"body": "> [geekless](#comment_19_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там запрещено добавление новых сайтов, потому и жив. Это прокси balancer73-а.\n\nА, вообще, если нужно кого-то добавить — пишите :)",
				"added": 1518924379
			},
			{
				"comment_id": 286,
				"body": "> [geekless](#comment_22_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я писал на ZeroMail, но то ли почта не работает, то ли ты её не проверяешь :D\n\nПроверил сейчас (в т.ч. через проверку файлов) — ничего нет :-/",
				"added": 1518958574
			},
			{
				"comment_id": 287,
				"body": "> [geekless](#comment_25_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): О, вот так должно работать. Проверка:@swashbuckler\n> @balancer73\n\nНа ZeroHello выводится.",
				"added": 1518958614
			},
			{
				"comment_id": 288,
				"body": "> [user4cd](#comment_2_1P4qqds8jkDihzBXBfx3nMLK2DE5Q6KnzM): что интересного тут есть ?\n\nМожешь порыться, начиная с [ZeroSites](/Sites.ZeroNetwork.bit/) — и дальше по ссылкам. Например, включить `Filter = RU`. Это не всё, что тут есть, но процентов 80 активных зайтов там есть.",
				"added": 1518958750
			},
			{
				"comment_id": 289,
				"body": "> [geekless](#comment_27_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А файл http://127.0.0.1:43110/1MaiL5gfBM1cyb4a8e3iiL8L5gXmoAJu27/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/data.json существует и содержит три записи типа message?\n\nУгу. Есть такой :)",
				"added": 1518960667
			},
			{
				"comment_id": 290,
				"body": "> [geekless](#comment_22_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я писал на ZeroMail, но то ли почта не работает, то ли ты её не проверяешь :D\n\nЗабавно. Зашёл в почту с другой машины, через закрытый свой прокси — тут всё работает :)",
				"added": 1518960816
			},
			{
				"comment_id": 291,
				"body": "> [geekless](#comment_28_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Можно попробовать пересоздать базу данных сайта кнопкой «Rebuild» в боковой панели.\n\nНе помогло даже полное удаление и восстановление почты заново.\n\nНо! Потом, наконец, сообразил :) Я как-то ожидал, что там привязка шифрований идёт на мой идентификатор, его приватный ключ и т.п. И не посмотрел, что ключи шифрования на этой, основной теперь машине, свои и не совпадают со старыми, на той машине, которая стоит как приватный прокси. А почту я впервые заводил на ней.\n\nДо конца всё равно не помогло, входящие пустые. Но в исходящих появились мои _некоторые_ отправленные письма :) Попробую ещё раз грохнуть и перезагрузить почту (перестройка БД не помогает).\n\n**Update:** оказалось достаточно перелогиниться (после копирования ключей с другой машины, конечно)",
				"added": 1519015821
			},
			{
				"comment_id": 302,
				"body": "> [iiboard377](#comment_2_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf): Привет, ZeroNet.\n\nПривет :)",
				"added": 1520118484
			},
			{
				"comment_id": 304,
				"body": "> [iiboard377](#comment_3_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf): Привет-привет. Тут всегда так тихо?\n\nСмотря на что подпишешься :) Конкретно тут — да, пишут мало. На других ресурсах по отдельности тоже не часто обновления идут. Но в сумме, по тем зайтам, на которые я подписан, в сутки десятки обновлений.",
				"added": 1520254381
			},
			{
				"comment_id": 306,
				"body": "> [iiboard377](#comment_4_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf): А на какие сайты ты подписан?\n\nВ data у меня на этой машине ровно 200 подкаталогов :) Большинство из них — разные зайты, в т.ч. и дохлые, конечно. Если тупо по времени обновления взять свежие, то:\n\n## Избранное\n\n- http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n- http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/\n- http://127.0.0.1:43110/sakana.bit/\n- http://127.0.0.1:43110/1ShArE1dJFcHFgTEEAUMXksDZuRckzd3Y/\n- http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/\n- http://127.0.0.1:43110/ZeroLSTN.bit/\n- http://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/\n- http://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/\n- http://127.0.0.1:43110/Me.Mkg20001.bit/\n- http://127.0.0.1:43110/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/\n\n## Подписки\n\n- http://127.0.0.1:43110/tvepisodes.bit/\n- http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n- http://127.0.0.1:43110/Talk.ZeroNetwork.bit/\n- http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/\n- http://127.0.0.1:43110/ZeroMedium.bit/\n- http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\n- http://127.0.0.1:43110/0list.bit/\n- http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\n- http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/\n- http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/\n- http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/\n- http://127.0.0.1:43110/Blog.ZeroNetwork.bit/\n- http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/\n- http://127.0.0.1:43110/1KiwiBCVBUcuypVm8FEmUW9YT6fJDXkN9r/\n- http://127.0.0.1:43110/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/\n- http://127.0.0.1:43110/blog.kaffie.bit/\n- http://127.0.0.1:43110/142jqssVAj2iRxMACJg2dzipB5oicZYz5w/\n- http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/\n- ... ну и дальше за сотню :)\n\n## Собственные\n\n- http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/\n- http://127.0.0.1:43110/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/\n- http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n- http://127.0.0.1:43110/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/\n- http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n- http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/\n- http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/\n- http://127.0.0.1:43110/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/\n- http://127.0.0.1:43110/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/\n- http://127.0.0.1:43110/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/\n- http://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/\n- http://127.0.0.1:43110/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/\n- http://127.0.0.1:43110/18ZaNRBjjZSxV38omZS5tu3ngNExnRYxxA/\n- http://127.0.0.1:43110/1GmoFQHVjYj4xDZZ5oMNnkGhvnfY1w3pPM/\n- http://127.0.0.1:43110/1LRoENA2yjKofGcC5S3QW2u7Qbc7QJz2Yp/\n- http://127.0.0.1:43110/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/\n- http://127.0.0.1:43110/1HidBY8MhvfnGJNPcuh47TCfbK25VvdzzY/\n- http://127.0.0.1:43110/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/\n- http://127.0.0.1:43110/1AdhUSJLmpUE7Aq5nPBkUuxgcWaUfqtS84/\n- http://127.0.0.1:43110/17yiPtXkxqJY6RDyxfh1ZYYWhdq92tbQpE/",
				"added": 1520374770
			},
			{
				"comment_id": 307,
				"body": "Кстати, можно потыкаться в блоги в этой трансляции в clearnet: http://www.zites.cf/\n\nХотя, как сейчас вижу, в трансляции что-то 22 февраля сломалось и более свежих записей нет, надо будет починить.",
				"added": 1520374858
			}
		],
		"4_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 44,
				"body": "mega.nz? Интересно, авторы проекта Розова читали или случайно получилось? :)",
				"added": 1485092906
			}
		],
		"1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 45,
				"body": "> [waylander](#comment_1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2): другой вопрос правда \"зачем\"))\n\nОй, сейчас много ещё есть желающих поиграть... Ну, пусть не в Ogame, он был крайне примитивен, но во что-то, типа MoO1, только в онлайне. Или VGA Planets в ФИДО.\n\nЯ уже лет 10 вынашиваю идею такой игры, желающих куча — но все чисто как пользователи, а программировать в одиночку при лютой нехватки времени на другие проекты грустно :)",
				"added": 1485551843
			},
			{
				"comment_id": 46,
				"body": ">что тут есть интересного вообще?\n\nИнтересных русскоязычному юзеру сайтов/зайтов обычного типа тут пока нет. Слишком молодая система :) Тут развита социальность (блоги/форумы/микроблог достаточно активны и интересны, ИМХО) и отчасти зайты для англоязычных юзеров (зайты с магнитными ссылками для сериалов и т.п.)",
				"added": 1485598502
			}
		],
		"2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 47,
				"body": "ИМХО, что-то из этой категории  [рисования лошади](http://zeronet.home.balancer.ru/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:32:Как+нарисовать+лошадь+Очень+просто!) :)\n\nЗадача технически очень сложная. Да и ненужно оно для ZeroNet. Просто для распределённых вычислений есть куда более подходящие системы.",
				"added": 1485598606
			},
			{
				"comment_id": 48,
				"body": "> [antignu](#comment_24_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Все больше держится на добросовестности пользователей сайтов.\n\nНа добросовестности _владельцев_ зайтов (ну и разработчиков базового программного пакета, конечно). Простой пользователь не может в общем случае навредить зайту (форуму/блогу), кроме как спамом. Пользователь не может изменить скрипты или чужие данные. Его данные складируются отдельно от остальных в JSON и уже оттуда локальным скриптом (который чужие пользователи поменять не могут, только или владелец сайта или локальный пользователь) обрабатывается для отображения информации.",
				"added": 1485600597
			},
			{
				"comment_id": 49,
				"body": "> [antignu](#comment_25_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): А вот и не только. Пользовательские данные на сайте находятся под контролем пользователя.\n\nИменно так. Но некорректный JSON не нарушит работу сервиса.\n\n> Может например изменить или испортить существующие сообщения. В случае сложных приложений, вроде игр, может отменить свой предыдущий ход, например. \n\nНикакая вменяемая игра не вносит изменения состояния задним числом :) Что бы не предпринял пользователь, это будет изменение только текущего состояния.\n\nПервое правило разработчика игрового сервера — **никогда** не доверять данным пользователя. И тут уже не важно, пришли они от специального игрового клиента по UDP или пришли в виде JSON по ZeroNet.\n\n> Чужие не может, но может свои. Этого вполне достаточно, чтобы сильно препятствовать созданию хороших приложений. \n\nПока не вижу как.\n\n> Но пользовательские данные не находятся в полном владеннии пользователя, и это необходимое условие для многих приложений. ZN этого не обеспечивает.\n\nZN обеспечивает передачу пользовательских данных. Всё. Традиционные приложения, использующие пользовательские данные, типа сообщений форума или комментариев к блогу, перечитывают состояние данных пользователя и строят посты/комментарии по ним. Это сделано для того, чтобы пользователь мог редактировать данные. Но никто не запрещает в своём приложении принимать данные только как свежие. Не вносить никаких правок задним числом. Не давать пользователю изменять данные приложения. Это никак не связано с ZeroNet. Тут можно рассматривать ZeroNet только как транспорт.",
				"added": 1485634104
			},
			{
				"comment_id": 50,
				"body": "> [vlad20012](#comment_246_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Но тут все так радеют за децентрализацию и все такое, что центральный (пусть хоть и анонимный) сервер - это так небезопасно...\n\nТут важно тёплое с мягким не путать :) Тут сам, столь важный, процесс аутентификации пользователей централизован. Фактически федеративен, но в условиях монополии основных приложений — практически централизован. Отказ этой точки не скажется на доступности данных, но прекратит возможность появления новых участников форумов.\n\nНо это вопрос организации конкретных сервисов и их обновлению. Вопрос доступа к данным (в т.ч. при недоступности оригинального сервиса) тут совершенно децентрализован :)",
				"added": 1485769547
			}
		],
		"1_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N": [
			{
				"comment_id": 51,
				"body": "> [voland](#comment_64_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): зайт сайт безумно режет глаза\n\nТермин на английском звучит как `Zite`. Предложите иной перевод :)",
				"added": 1485845961
			}
		],
		"1_1PAnNhncRpwtUsy82YbLd7iBJHxTadBaUd": [
			{
				"comment_id": 52,
				"body": "Приветствую. Этот прокси находится у меня. Проблема решилась?",
				"added": 1486248108
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 53,
				"body": "В «живом Web'е» через пять лет отмирает четверть ресурсов, через 10 — половина. Хотя «ответственность» там выше и хостинг обычно «нормальны» — на внешнем сервере.\n\nВ Onion (как и в i2p), полагаю, часто сайты поднимаются как попало, нередко вообще на домашней машине под столом или на старом ноуте. Так что средний срок жизни сайта должен быть ещё меньше.\n\nПри этом, как Onion, так и ip2 имеют централизованные сайты. Умер сайт — всё, пропал у всех.\n\nВ этом плане ZeroNet и должен рулить :) Тут зайт, интересный всем не умрёт, пока к нему есть интерес. В худшем случае может только перестать обновляться.",
				"added": 1486954455
			},
			{
				"comment_id": 58,
				"body": "> [voland](#comment_68_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Да и наврятли тот же гит тут возможен\n\nХм. А что, git возможен в tor?\n\nВообще, раздавать контент через git никто не мешает и тут. Подписывай весь репозиторий и публикуй. Но чтобы его пополнять — придётся коммитерам давать приватный ключ. Хотя теретически можно принимать патчи автоматом от сторонних юзеров. Но это нужно писать соответствующее приложение.\n\n...\n\nПока децентрализованный git только в gittorrent был предложен. Но он, по-моему, умер.",
				"added": 1487000204
			},
			{
				"comment_id": 63,
				"body": ">За сутки минус два ресурса\n\nКстати, может быть связано с: [Тысячи сайтов темной паутины – Dark Web – оказались недоступны из-за атаки](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:8:Тысячи+сайтов+темной+паутины+–+Dark+Web+–+оказались+недоступны+из-за+атаки)",
				"added": 1487005081
			},
			{
				"comment_id": 161,
				"body": "> [redfish](#comment_6_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Умрет. Архив сайта не умрет, а сайт умрет. Ведъ ключ у одного человека, который может запросто пропасть.\n\nВ контексте у меня «смерть сайта» подразумевает пропажу информации, а не прекращение её обновления.\n\n> Нужны полностью автономные ресурсы, которые содержаться, обновляются, и модерируются группами пользователей, а не одним (или мелкой группой) администраторов.\n\n1. Доверенная группа может пользоваться общим ключом.\n2. ZeroWiki\n3. ZeroTalk\n\nВот с модерированием пока да, плохо. В ZeroNet эта проблема пока почти не актуальна, видимо, поэтому почти и не прорабатывается.",
				"added": 1504908557
			},
			{
				"comment_id": 162,
				"body": "> [redfish](#comment_7_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Архивация это легкая задача. Методов полно. Бери и сохраняй, кому не лень.\n\nЭто очень сложная задача. Требует ручной работы. И результаты такой архивации не общедоступны.\n\n> Кому нужен архив трэкера, например, а кому нужен живой трэкер?\n\nТрекеры, мягко говоря, не самый важный источник информации :) Вот статьи всякие, публикации — они, в отличие от трекеров, бывают полезны и 10-15 лет спустя. Но в обычном Интернете у простых пользователей часто тупо исчезают вместе с сайтами.\n\nНужно просто по этим граблям потоптаться не раз, чтобы начать ценить подход ZeroNet.\n\n> Моя мысль это встроить гладкий путь к обновлению сайта без ключа в саму систему.\n\nТак чем не нравится ZeroWiki, ZeroTalk? Вот тебе обновления и без центрального ключа.\n\n>Но, цель -- это избежать ситуации которая произошла с форум.и2п например (хозяин исчез, теперь ни форума ни данных).\n\nТак i2p — это совсем другая история. Это всего лишь анонимный транспорт к централизованной системе. Ушёл сервер — пропал ресурс. Финита. А в ZeroNet уйдёт владелец ZeroTalk — форум продолжит работать, пока будут заинтересованные в нём. Кончатся лимиты? Делаем форк и кидаем на старом форуме ссылки на новый. На новом можно спокойно ссылаться на старый. Вся информация по-прежнему доступна, никуда не девается. Это _качественно_ другой подход.",
				"added": 1504996359
			},
			{
				"comment_id": 163,
				"body": "> [redfish](#comment_8_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Другой подход к этой задаче это строго отделить данные от кода.\n\nТак это и есть ZeroNet :)\n\n> Уже эта модель встречается в реальности: сеть битторента (исключим трэкеры) -- у нее очень простая функциональность по сравнению той что нужна для вики, тветера или трэкера.\n\nКхм. \n\n1. «Твиттер на блокчейне» есть. Twister: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:27_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Twister+p2p\n2. Блокчейн плохо подходит для массивных социальных решений. Как раз пример Twister'а это иллюстрирует. Он мало популярен, но его блокчейн весит уже почти гигабайт. Потому что тащить приходится ВСЁ, 99% того, что тебе не нужно :)\n\n> Или, гипотетический ИРК как текущий ИРК но где все сообщения как-то сохраняются, а не исчезают\n\nZeroChat'ы? ;)",
				"added": 1504996561
			},
			{
				"comment_id": 164,
				"body": "> [towarisch](#comment_17_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Эх, ребят. Контента тут нет, а вам бы технические подробности ресурса пообсуждать.\n\nВ ZeroNet? Контент есть. Хотя эта оценка релативна, конечно :D И, очевидно, что тут народ пасётся технически ориентированный. Поэтому и темы соответствующие. Ну, вот, начну я тут обсуждать авиацию, астрофото, свои дела семейные — кто диалог поддержит? Да никто. Это никому не интересно. Если уж даже обсуждение фантастики или кино тут никак не стартует... Так что — только технические подробности :)",
				"added": 1505002492
			},
			{
				"comment_id": 165,
				"body": "> [towarisch](#comment_18_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Контента тут своего нет.\n\nИ да, и нет, как  в любой другой малораскрученной социальной системе. Без разницы, p2p или централизованной. Свои только блоги/микроблоги да форумы (где они есть). Но это и составляет сразу львиную долю живого контента таких систем. И не важно тут, ZeroNet это, или Twister, Juick, Mastodon, SSB Patchwork...\n\nБолее того, есть раскрученные социальные системы, где своего контента практически нет, одни репосты — те же Pinterest или Tumblr. По сравнению с ними ZeroNet просто кладезь уникального контента :D\n\nВообще, отчасти проблема ZeroNet  в том, что в ней мало заметны изменения. Конечно, тут это на порядок лучше, чем в той же RetroShare, где ты не видишь вообще ничего за пределами подписки в кругу друзей. Но всё равно, активность более высокая, чем может показаться.\n\nВот, только по некоторой части блогов: http://www.zites.cf/ — я сам там уже нахожу больше информации, чем непосредственно сидя в ZeroNet :) Надо и расширять этот список и подключать аналогично ZeroTalk...",
				"added": 1505008748
			},
			{
				"comment_id": 166,
				"body": "> [redfish](#comment_10_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Нет протокола доступа к распределенной базе -- каждый сайт делает что хочет, сайт и является едиственным клиентом.\n\nMergerSite. Смотри [ZeroMe](/Me.ZeroNetwork.bit/) или [ZeroVoat](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/) :)\n\nНапример, сравни контент ZeroMe и [ZeroMe Reloaded](/Me.Mkg20001.bit/). Или [ZeroMe+](/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/).\n\nНо я как раз не считаю такой подход хорошим решением. Снова приходится тащить к себе тонны не нужных тебе данных, как и с блокчейном.",
				"added": 1505030055
			},
			{
				"comment_id": 167,
				"body": "> [radjah](#comment_5_1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik): Всё время выдаёт ошибку localStorage. Из-за того, что у меня не 127.0.0.1, а 192.168.1.22?\n\nУ меня аналогично, хоть и на локалхосте.",
				"added": 1505053975
			},
			{
				"comment_id": 168,
				"body": "> [jehmak](#comment_1_1AyLtNX1hKoT6jqTWM9tFkLDvWPAs6jGpg): А в чём проблема с трекером?\n\nКстати, а даже с «мёртвым» ресурсом, в смысле не обновляемым. Кроме новинок, старые фильмы/раздачи тоже на годы (а в перспективе и на десятилетия) актуальны. Так что архив даже в случае трекеров вполне себе востребован...",
				"added": 1505096542
			},
			{
				"comment_id": 170,
				"body": "> [bplohish](#comment_21_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Сейчас хорошим тоном является публикация в Wiki. Там и умершие ссыки можно усилиями сообщества обновлять.\n\nТут, правда, есть ещё не решённая из-за неактуальности проблема в ZeroNet — спам и вандалы. Сейчас итак нормально, но когда-то решать придётся.",
				"added": 1505361349
			},
			{
				"comment_id": 171,
				"body": "> [bplohish](#comment_28_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): Это неотъемлемая часть открытого общества и свободного доступа к информации.\n\nИ то, и другое не является синонимом информационного мусора.\n\nЕсли разрешить бесконтрольную генерацию контента, то он конструктивный контент станет недоступен на фоне шума. Это суровый факт. Спамботы работают на многие порядки активнее живых юзеров. Так что или нужны ограничения, или информация теряет смысл.",
				"added": 1505408152
			},
			{
				"comment_id": 172,
				"body": "> [jehmak](#comment_5_1AyLtNX1hKoT6jqTWM9tFkLDvWPAs6jGpg): Необходимость борьбы со спамом не значит что надо вводить какую-то жесткую централизованную цензуру или модерацию.\n\nЯ не говорил, что это должно быть в такой форме. Но в какой-то форме оно должно быть обязательно. В ZeroNet сейчас ничего этого нет, поэтому сеть уязвима для спама. И он тут почти не присутствует только по принципу Неуловимого Джо.\n\n>По-моему, в большинстве случаев достаточно кнопки \"перестать принимать, распространять,  и рендерить информацию от пользователя запостившего это\".\n\nЭто и есть техническое решение. Которого пока нет в ZeroNet.\n\nНо от спама поможет слабо, так как создание новых пользователей ничего не стоит и их можно делать по новому для каждого сообщения.",
				"added": 1505411339
			},
			{
				"comment_id": 173,
				"body": "> [jehmak](#comment_6_1AyLtNX1hKoT6jqTWM9tFkLDvWPAs6jGpg): По-моему иметь внешние сервисы с защитой в таком духе для identity провайдеров - это самое простое решение. Дёшево и сердито.\n\nНо — централизация :)\n\n> В идеале, конечно, полная децентрализация, можно делать network-of-trust с коллективной кармой пользователей и сокрытием/баном после достижения каких-то распределённых показателей, но это сложно.\n\nДа, это очевидное решение. Я бы не сказал, что оно очень сложное, но пока в ZN его нет.",
				"added": 1505412441
			},
			{
				"comment_id": 211,
				"body": "> [geekless](#comment_7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В конфиге же есть возможность дать право подписывать сайт другими ключами.\n\nЭтого не знал. Это гут :)",
				"added": 1509273929
			}
		],
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 54,
				"body": "Как было сказано — ZeroBlog. Тонкость тут только в использовании картинок. Через редактор ты картинку добавить не сможешь. Нужно или вручную добавлять её на свой блог (в локальный каталог, а ссылку потом в пост), подписывать и публиковать, или размещать  в других устойчивых сетях, типа IPFS (а в блоге, соответственно, ссылку на IPFS-гейт).\n\n...\n\nЯ всегда пользовался вторым вариантом, через IPFS, но сейчас сообразил, что вариант с публикацией может быть интереснее. С одной стороны, он заставляет качать картинку всех, кто читает блог, что приводит к резкому росту его объёма, с другой — это исключает сторонний сервис, от которого может зависеть полное функционирование блога.",
				"added": 1486954897
			},
			{
				"comment_id": 55,
				"body": "Да, по пунктам.\n\n>чтобы они могли постить длинные опусы\n>чтобы их можно было камментить\n\nЭто в ZeroBlog «из коробки».\n\n> с картинками и было не сложно\n\nТут придётся приложить руки. У меня так есть простейший скрипт, который картинку публикует в IPFS и возвращает markdown-код для вставки превью со ссылкой. Но это всё равно дополнительная ручная работа.\n\n>чтобы можно было банить всяких уродов (автором, или читателями лично - как получится)\n\nС этим в ZeroBlog «из коробки» никак. Но можно комментарии чистить вручную. Ну и пока почему-то уродов тут нет :) Они все в RetroShare сидят :)\n\n>чтобы было трудно прикрыть раздачу информации\n\nВ ZeroNet это возможно только если к твоему блогу потеряют интерес все читатели. Пока кроме тебя доступен хоть один читатель, скопировавший себе твой блог, последний будет доступен всем.\n\n>чтобы каждый мог себе делать копиюшечку интересных постов\n\nВ ZeroNet клонируется весь блог (как и любой зайт) целиком. Это делает каждый читатель.",
				"added": 1486955172
			},
			{
				"comment_id": 56,
				"body": "> [zalex](#comment_66_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Вы чего вводите в заблуждение человека? Уже прикрутили\n\nА, пардон, упустил.\n\n> Опять неверно, через data/users/content.json можно:\n\nЭто вручную, а не «из коробки» (в контексте готового решения).",
				"added": 1486999839
			},
			{
				"comment_id": 57,
				"body": "> [avoiddowntime](#comment_1_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Как-то не очень сейчас прозвучало. Что-то личное? Тебя там обидели что ли? )\n\nДа нет, не обидели. Но народ в тамошних форумах какой-то неадекватный. Параноидальный и злобный :) Тут коммьюнити намного качественнее.",
				"added": 1486999966
			},
			{
				"comment_id": 59,
				"body": "> Вот, что вышлоhttp://127.0.0.1:43110/1EA78W4sAgrJxVVcNR9UFF2CBiiWFfPcQQ/?Post:3:ZeroNet:+разбираемся+с+вопросами...не знаю, опубликовалось или нет - интерфейс писал, что пиры не приняли.Меня видно, или что-то недопилил?\n\nАга. Видно :)",
				"added": 1487001308
			},
			{
				"comment_id": 60,
				"body": "> [avoiddowntime](#comment_2_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): \n> И тут уже встает вопрос о твоей адекватности.\n\nПроблема с адекватность явно у того, кто из лёгкой гиперболы «все уроды в RS» делает вывод о категоричном утверждении «в RS все уроды». Я не говорил того, что ты прочитал в моих словах.\n\n>Чувак, тогда у тебя проблемы с:\n\nВот, видишь. Ты пришёл с RS и принёс с собой разборку. Это тоже о чём-то говорит...",
				"added": 1487001505
			},
			{
				"comment_id": 61,
				"body": "> [dmi](#comment_3_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Так в итоге, что по поводу работы ZN: он сразу весь зайт скачивает, кроме опциональных файлов, или зайт сегментируется?\n\nZero-сайт качается сразу целиком. Вся сегментация — на совести разработчика сайта (и делается через клонирование, в общем, легко).",
				"added": 1487001570
			},
			{
				"comment_id": 62,
				"body": "> [avoiddowntime](#comment_3_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): а благодаря тебе и таким персонажам как ты и не лучше чем тут или где-то еще. Но в принципе, да, зря я перед тобой бисер мечу, видимо...\n\nВот-вот. О чём я и говорю...\n\nЯ, кстати, в RS тоже больше года сижу. Так что имею возможность сравнивать :D",
				"added": 1487002295
			},
			{
				"comment_id": 64,
				"body": "> [unit98237](#comment_2_12DzqzwYCZ1RmHPy2sZ95kHSv6eY3z1agJ): они сразу объявляли любую альтернативу вбросом спецслужб\n\nКстати, в RS очень популярная тема. Своеобразная вариация на тему закона Годвина :) Не скажу, что в каждом втором, но в каждом десятом, наверное, русскоязычном трёпе обязательно поминаются сотрудники ФСБ :) А, может, и чаще, учитывая, что самых одиозных пользователей я регулярно вношу в игнор :D",
				"added": 1487040131
			},
			{
				"comment_id": 65,
				"body": "> [vlad20012](#comment_249_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Так то дело в том, что они опциональные.\n\nНу, я без понятия о тонкостях. Но я вижу в ZeroMe возможность добавить фото. Добавляю. Фото прекрасно видно и на машине, откуда отправил и на других моих машинах. Я на других машинах на фото выбираю «Help distribute...» Через какое-то время даже вижу, что фото поддерживается и другими пользователями (до десятка и более раздающих бывало). Но проходит месяц-другой — и опаньки, фото нигде больше не видно. Ни на изначальной машине, ни на раздающих...\n\nВот, например, в моём ZeroMe в [записи от 3 января](/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1483464131) фото есть, а [от 25 декабря](/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1482656869) и всех более ранних — уже нет.",
				"added": 1487106072
			},
			{
				"comment_id": 66,
				"body": "> [dmi](#comment_9_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Кстати, я правильно понимаю, что сейчас все комюнити ZN не превышает 400 человек? (сужу по к-ву сидов ZeroName и Ко)\n\nНет, это те узлы, с которыми у тебя есть связь. И это число в один и тот же момент времени на разных машинах разное. Я сейчас (на разных нодах) вижу цифры для ZeroName в 739, 1594 и 350 пиров. Что интересно, 1549 — на этом ноуте, который за серым NAT'ом и Tor, который я только полчаса назад включил. А 350 — на выделенном сервере, находящемся в Германии с прямым быстрым каналом :)\n\nДаже для моего собственного блога показывается разное число пиров — 32, 34, 25.\n\n> потянет ли тор-сетка? все-таки, она основной транспорт.\n\nTor, всё же, по умолчанию выключен. И большинство, ИМХО, сидит на прямых соединениях. У меня среди всех машин только две работает через Tor, т.к. при прямом соединении возникает конфликт портов на роутере (из дома ещё две машины работают). И штуки 4 работает напрямую. Так что Tor — это для тех, кто реально опасается потери анонимности :)",
				"added": 1487106519
			},
			{
				"comment_id": 67,
				"body": "> [dmi](#comment_11_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): А там если их у тебя в Файлах выделить и нажать \"Прикрепить\" - это их на твоем компе не заморозит?\n\nМожет быть и поможет. Но это же не дело, лазить вручную и пинить файлы, выискивая их по хешу. Да ещё на всех машинах. И, вот так, зевнёшь однажды — и всё. Восстановить/обновить «упущенный» файл невозможно.  И если я выбираю «Help disribute» — почему это автоматически не пинит файл? Наконец, если я публикую файл сам, почему он у меня не пинится? В общем, пилить ещё и пилить :)",
				"added": 1487107035
			},
			{
				"comment_id": 68,
				"body": "> [dmi](#comment_12_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Про Tor - т.е., uPnP все-таки срабатывает, даже если пишет, что порт закрыт?\n\nНаоборот. Если работает без Tor, то всегда хочет пробрасывания одного конкретного порта. Соответственно, в одной закрытой сети получается только один полноценно работающий клиент. Остальные соединяются уже через внешние ресурсы. А Tor работает, видимо, через произвольные порты и Tor-нод в одной сети может быть несколько.\n\n>Ну и в кафешке и любой корпоративной сетке без тора уже нового ресурса не создать, получается...\n\nРаботать будет, только не так оперативно и надёжно.",
				"added": 1487116125
			},
			{
				"comment_id": 89,
				"body": ">Я так понимаю, распространится подписанный \"вытертый\" контент.\n\nТак.",
				"added": 1490024179
			}
		],
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": [
			{
				"comment_id": 76,
				"body": "Нынешние или бывшие? :) Я свой последний Спекки в лице ATM-Турбо в 1994-м продал :D",
				"added": 1487441610
			},
			{
				"comment_id": 77,
				"body": "> [voland](#comment_72_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): бывших не бывает :)\n\nНу, тогда есть :)\n\n...\n\nКстати, я в ZN в блоге у себя уже [писал как-то про интересный эмулятор](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:10:ZX-Spectrum+эмулятор+в+браузере) :)\n\nХотел его в ZN перетащить (он бы тут прекрасно вписался как статический зайт), но в опенсорсе его нет, а концов, чтобы выкачать, не сыскал.",
				"added": 1487453632
			},
			{
				"comment_id": 160,
				"body": "> [catman](#comment_5_1NxH7JC6pHRkfyzg8fX7bKwdbEA3gCnkuk): ...он не открывается...\n\nСейчас проверил — всё отлично работает.\n\n[![](https://gw-ipfs.tk/ipfs/QmXWKyMn4ThTqRtLsaAQXL4XYMKr1r23VrT9N6RLW5uPxE/2017-09-02_08-58-25-800x.png)](https://gw-ipfs.tk/ipfs/QmZct7Ua287Ua7bdpNDPmZrK5ApU63jv1ZcwHiF8LRcgxm/2017-09-02_08-58-25.png)",
				"added": 1504332046
			}
		],
		"1_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 78,
				"body": "> [gnome](#comment_15_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Zeronet требует доступ к управляющему порту Tor и без этого доступа через Tor работать не хочет.\n\nА в инструкции сказано:\n\n>**Tip:** It's also possible to use Tor without modifying torrc (or to use older versions of Tor clients), by running `zeronet.py --tor disable --proxy 127.0.0.1:9050 --disable_udp`, but then you will lose ability to talk with other .onion addresses.",
				"added": 1487532035
			}
		],
		"1_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk": [
			{
				"comment_id": 79,
				"body": ">цена в 600 евро тормозит экспериментаторский пыл\n\nЭто обратная сторона не мейнстримности :) Да и, боюсь, его долговечность не будет сильно выше смартфонной. Точно также аккумуляторы надо менять, конденсаторы будут дуться, проводники окисляться... Справедливости ради, у меня пока на 17 лет опыта ещё ни один КПК/смартфон не умер своей смертью. И только два телефона умерли (отработав по 6-8 лет). Это на что-то порядка двух десятков гаджетов.\n\nТак что, ИМХО, проще взять смартфон и не париться :)\n\n— Долговечность будет не хуже прочих вариантов + компенсация невысокой ценой\n\n— Под Android можешь допиливать сам программную часть как захочешь, начиная от ОС, кончая приложениями. Выбор «пилибельного» невелик? Ну так у «открытого устройства» будет ещё хуже :)\n\n— Возможность обновления аппаратной части? Естественно, покупкой нового изделия :) Всё равно иного не найдёшь.",
				"added": 1487836235
			},
			{
				"comment_id": 80,
				"body": "> [tolst0evsky](#comment_9_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk): Хм, не первый раз Blackberry советуют. Может, и стоит присмотреться, но ведь проприетарщина...\n\nХуже, чем проприетарщина. Это проприетарщина, которая уже отказалсь от производства своих коммуникаторов и финансовая отчётность которой всё более удручает.\n\nВ плане свободы и независимости, которые озвучивались в топикстарте, это ну никак не вариант :)",
				"added": 1488240863
			}
		],
		"1_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 82,
				"body": ">Лучше бы для каждого пользователя в ZeroMe создавался персональный зайт.\n\nДля этого есть ZeroBlog. Там ты будешь грузить и раздавать только тех, кто тебе интересен. Просто не нужно пользоваться ZeroMe, если идеология его не подходит, нужно пользоваться теми инструментами, идеология которых подходит :)",
				"added": 1488974762
			},
			{
				"comment_id": 85,
				"body": "> [mist](#comment_44_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Кстати да, это было бы лучше. Единственное, как и с блогами, нужно было бы искать себе сидов.\n\nТак в чём разница между таким «лимитированным ZeroMe по подписке» и нынешним ZeroBlog? :)",
				"added": 1489005906
			},
			{
				"comment_id": 86,
				"body": "> [mist](#comment_45_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Общий интерфейс, отсутствие необходимости каждому поддерживать свой свой клон и простота обновления. Единая лента постов.\n\nИнтерфейс итак у почти всех ZeroBlog одинаков, лента постов — единая при подписке на них в HelloZero.\n\n> [stre10k](#comment_4_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx): поиск пользователей, социальный граф\n\nНу, это да. Но на практике сейчас почти не работает :)",
				"added": 1489120277
			}
		],
		"1_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": [
			{
				"comment_id": 83,
				"body": "Ну, у меня просто стоит nginx-proxy, который через http-авторизацию даёт доступ к локалхостовому ZN:\n```\nserver {\n    server_name zeronet.my-host.tld;\n\n    location / {\n        auth_basic \"Protected area: ZeroNet\";\n        auth_basic_user_file /var/www/.htpasswd;\n\n        proxy_pass        http://127.0.0.1:43110;\n        proxy_http_version  1.1;\n        proxy_set_header    Host        $host;\n        proxy_set_header    X-Real-IP   $remote_addr;\n        if_modified_since   before;\n\n        proxy_read_timeout  120s;\n        proxy_send_timeout  120s;\n\n        access_log        off;\n    }\n\n    location /Websocket {\n        proxy_pass http://127.0.0.1:43110;\n        proxy_http_version 1.1;\n        proxy_read_timeout 1h; #for long live websocket connetion\n        proxy_set_header Upgrade $http_upgrade;\n        proxy_set_header Connection \"upgrade\";\n    }\n}\n```",
				"added": 1488977585
			},
			{
				"comment_id": 84,
				"body": "> [zalex](#comment_73_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А почему бы не использовать UI-Password Plugin?\n\n1. HTTP-авторизация — защита, проверенная годами и несусветным числом запросов :) А как они там плагин делали — х.з.\n\n2. Да просто ломает разбираться с ещё одним плагином, когда nginx-прокси делается копипастом сотни раз реализованного конфига :)",
				"added": 1488980056
			}
		],
		"2_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 87,
				"body": ">Понимаю тема холиварная, но серьезно\n\nОна потому и холиворная, что сильно зависит от конкретного железа. Бывают случаи, когда при прочих равных Linux быстрее, бывает, когда Windows. Аналогично на счёт глюков, драйверов... Я в этом случае давно не заморачиваюсь и пользуюсь тем, что лучше работает на данной железке. Поэтому я это сообщение пишу с ноута с Ubuntu (Windows тут страшно тупит с дисковой системой), а десктоп дома — под Win10 (с Linux там вечные проблемы с видео). На предыдущем ноуте тоже была Ubuntu. А вот перед ним — лучше работала Windows.",
				"added": 1489280754
			}
		],
		"2_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": [
			{
				"comment_id": 88,
				"body": "Отчасти эту тему затрагивал в http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:27:ZeroNet:+повторение+большого+пути\n\nСейчас в плане механизмов имеет смысл реализовывать ряд вещей, которые в «Большом Интернете» были в конце 1990-х, до прихода поисковиков и соцсетей.",
				"added": 1489281080
			}
		],
		"1_1PYgJnbJ11uVGSiaRztMnwFycujEvNcdn": [
			{
				"comment_id": 90,
				"body": "https://zeronet.readthedocs.io/en/latest/using_zeronet/create_new_site/",
				"added": 1490555826
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 92,
				"body": "> [blackcat](#comment_4_159SQm48sNsqPd9DJZvjpt7Z4ykVwZDaH8): Живите со своим Путиным в дерьме и пусть вас никто не трогает до поры до времени,как все сгниет в стране так она и рухнет с Путиным или уже только с вами ватные лохи\n\nКак обнаружить в треде украинца по одному предложению :)",
				"added": 1492491710
			},
			{
				"comment_id": 93,
				"body": "> balancer73, не факт, кстати.\n\nТак лексика же! Наши оппозиционеры иначе выражаются и по другим поводам :)\n\n> // Что, тут лучше, чем на ЛОРе, понацполить можно?)\n\nНу, я бы с танцполом и LOR'ом лучше пошёл куда-нить в http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/ :)",
				"added": 1492541108
			}
		],
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 95,
				"body": "> [anoninonelon](#comment_2_17UbJJoiUJF9DHWLUnGYjfw82i5tdb4oqP): Боюсь, что это только начало.\n\nЭто не начало, это продолжение. Начало было, когда в Германии в 2007 оператора exit-ноды арестовали:\n\nhttps://arstechnica.com/tech-policy/2007/09/tor-node-operator-after-run-in-with-police-i-cant-do-this-any-more/\n\nЕго, правда, в результате освободили, но тренд уже стал ясен.\n\n- https://nakedsecurity.sophos.com/2016/04/07/couple-hosting-tor-exit-node-raided-by-cops-investigating-child-abuse/\n- http://www.pcworld.com/article/2452320/tor-exit-node-operator-convicted-of-abetting-spread-of-child-porn.html\n- http://www.zdnet.com/article/austrian-man-raided-for-operating-tor-exit-node/\n\nТаких случаев уже слишком много, чтобы держать у себя Tor-ноду. Даже без учёта российского законодательства. «Хакнет» кто-нибудь с твоего компа через Tor почту очередного американского кандидата в президенты, поедешь в отпуск за границу и повяжут тебя. Разъясняй потом, что не верблюд... :)",
				"added": 1492711439
			},
			{
				"comment_id": 141,
				"body": "> [pirx](#comment_1_1NbAJhZXp65A9BDBbcHPLbAXm9WjTqYyfA):Кто-то в рф вообще считал, сколько людей сажают в тюрьмы? Типа человек/месяц.\n\nЕстественно:\n\n>Согласно данным на 1 января 2017 года, в тюрьмах, исправительных колониях и следственных изоляторах находятся примерно **630 тыс.** человек. Из них числа 523 тыс. содержатся в местах лишения свободы и еще приблизительно 107 тыс. — в СИЗО.\n\nДля сравнения, у США — 2.1 млн. заключённых.",
				"added": 1503371465
			},
			{
				"comment_id": 142,
				"body": "> [pirx](#comment_3_1NbAJhZXp65A9BDBbcHPLbAXm9WjTqYyfA): Попробуем рассмотреть систему с точки зрения технологической цепочки.\n\nТы рассмотри систему с точки зрения «человек поел, переварил, сходил в туалет». Последнее — это явно лишнее. Где-то ошибка в цепочке. Надо бы от этого избавляться.\n\n....\n\nЕсть вещи, которые заложены самой природой. Тяготение, питание через потребление жиров, белков углеводов, стремление большинства жить в социуме, нарушение норм социума меньшинством. Последнего никак не избежать. Это закон человеческой природы.",
				"added": 1503415148
			},
			{
				"comment_id": 143,
				"body": "> [pirx](#comment_6_1NbAJhZXp65A9BDBbcHPLbAXm9WjTqYyfA): Ты шо, нацист?\n\nНет, 43.",
				"added": 1503422682
			},
			{
				"comment_id": 144,
				"body": "> [pirx](#comment_8_1NbAJhZXp65A9BDBbcHPLbAXm9WjTqYyfA): А то я уже как-то удивился настолько упрощенному взгляду на человека...\n\nНе всё то золото, что не вырубишь топором.",
				"added": 1503430634
			}
		],
		"1_14rgoYCYDzEKQfFFSYwweWWFm5egR7Xrxe": [
			{
				"comment_id": 96,
				"body": ">не то чтобы непредвзято, а сообщающие о происшествиях, в принципе?\n\nЕсли отбросить крупные и тормозные ТВ — какие популярные СМИ не сообщают о громких событиях в принципе? Я такого навскидку не назову.\n\nА так — мне достаточно Твиттер-ленты, включающей RT, РБК и несколько известных микроблоггеров, чтобы обо всех событиях узнавать почти сразу же. Не могу навскидку вспомнить никаких событий, которые бы я узнал позже и из других источников :)",
				"added": 1492829372
			},
			{
				"comment_id": 97,
				"body": "Да, ещё регулярно читаю новости в Twister (ту же Медузу) и иногда всякую конспирологию в RetroShare. Первая ничем не выделяется на фоне обычного Интернета, вторая обычно не вызывает ничего, кроме брезгливости :)\n\nЭто посматриваю на всякий случай. Чтобы точно знать, когда меня начнут обманывать и утаивать информацию :D",
				"added": 1492832458
			}
		],
		"2_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 98,
				"body": ">или это в основном газетные утки?\n\nЭто дебильные законы. Которые потом всякие больные люди заставляют срабатывать.",
				"added": 1494095253
			},
			{
				"comment_id": 99,
				"body": "> [gnome](#comment_25_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): То есть, либо ты религиозен, либо по отношению к тебе можно беспредел творить. Вот это тревожно.\n\nТревожно. Тут проблема в том, что планета другая нужна. На этой сейчас везде докопаться могут...\n\n>Я отдал бы немало за пару крыльев,\n>Я отдал бы немало за третий глаз,\n>За руку, на которой четырнадцать пальцев,\n>Мне нужен для дыхания другой газ.",
				"added": 1494127500
			},
			{
				"comment_id": 102,
				"body": "*По поводу поиска другой планеты...*\n\n## Стивена Фрая обвиняют в богохульстве\n\n**На днях стало известно, что полиция Ирландской Республики проводит проверку в отношении британского писателя и комического актера Стивена Фрая в соответствии с местным законом \"О диффамации\", направленном на защиту чувств верующих.**\n\nВ феврале 2015 года Фрай, известный как оригинальный мыслитель и носитель эталонного английского языка, участвовал в программе \"Смысл жизни\" на ирландском телеканале RTE.\n\nНа вопрос ведущего Гая Бирна, что он сказал бы Всевышнему у райских врат, Фрай ответил, что поинтересовался бы у бога, зачем он создал мир полным несправедливости, нищеты и боли.\n\nДалее он заявил, что не может уважать столь \"капризное, узко мыслящее и совершенно эгоистичное существо\", и добавил, что античные боги, по крайней мере, не претендовали на всеведение и благость.\n\nНекий житель города Эннис подал жалобу властям. И вот теперь, спустя два года с ним связался сотрудник полиции и сказал, что по заявлению проводится проверка, о чем гражданин сообщил ирландской газете Independent.\n\nВ свое время высказывания Фрая вызвали возмущенные комментарии в соцсетях со стороны ирландских католиков. В связи с этим он тогда заявил Би-би-си, что не находит свои слова оскорбительными, поскольку они не были направлены против какой-либо конкретной религии.\n\nЗакон 2009 года грозит штрафом на сумму до 25 тысяч евро за \"письменные и устные высказывания, явным образом оскорбляющие предметы и понятия, являющиеся священными для любой религии, и вызвавшие гнев существенного числа ее приверженцев\".\n\n// http://www.bbc.com/russian/news-39834072",
				"added": 1494157241
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 106,
				"body": ">USED: 82.5K/100K\n>You are running out of your allowed space, please contact the site's admin at shift to raise your limit.\n\nСигнализирую :)",
				"added": 1494593129
			},
			{
				"comment_id": 329,
				"body": "У меня тут уже `USED: 243.5K/1000K` :) Когда-то владелец форума быстро реагировал на запросы. Сейчас, то ли потерял интерес, то ли ещё что-то...\n\nНо это же ZeroNet, тут всегда можно сделать клон со своими правилами. Например, так :) — http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/\n\nХотя я заводил в первую очередь из-за «основного» ZeroTalk — там я уже уткнулся в лимит.",
				"added": 1523101701
			},
			{
				"comment_id": 330,
				"body": "> [pozya](#comment_33_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Поднимешь?) И чтобы с нормальными лимитами сразу)\n\nТак уже ж поднято :) Только пока пусто там в отсутствии флеймогонных тем и желания флеймить :)",
				"added": 1523379613
			}
		],
		"1_1JXr7HXJit5v32121p1bfa9ezhurhc2ZPG": [
			{
				"comment_id": 107,
				"body": "и?",
				"added": 1494871796
			},
			{
				"comment_id": 113,
				"body": "> [akachan](#comment_17_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Сделайте зероконфу в телеграм чтоб зайтами обмениватся\n\nЕсть:\n- https://t.me/zeronetchat [en]\n- https://t.me/decentralized_social [ru]",
				"added": 1495407630
			},
			{
				"comment_id": 114,
				"body": "> [tigerru777](#comment_1_1Anoh6Rexrn9FDhBgntUXUx3CYatV2LPZY): Скажите как переносить свою учетку в другой зеронет на другом компьютере?\n\n`data/users.js` — там самый первый блок с секцией \"certs\". Вот эту секцию нужно на новую машину скопировать. Ну, или целиком `data/users.js` скопировать.\n\n>Так же как прописать в настройках зеронета чтоб он при нажатии скрипта открывался в тор браузере\n\nВопроса не понял. ZeroNet — это только демон, весь GUI в нём итак браузерный. В ZeroNet за пределами браузера некуда «скрипт нажимать».",
				"added": 1495407799
			}
		],
		"1_1BGconZDFECxudsuKsBnkXpX1iqKbUWMku": [
			{
				"comment_id": 108,
				"body": "А что, тут может быть иной выход, кроме как пользоваться обходами блокировок (99% решений, от фонаря оценка) или уходить в неблокируемые сети (1%)? :) Ну, ещё есть вариант забить, ровно сидеть на попе и пользоваться доступным, который выбирает 70% населения (а цифры выше — по тем, кто пытается найти обходное решение).\n\n...\n\nВообще, повод затаскивать украинцев в ZeroNet. Но это надо в http://127.0.0.1:43110/193psz3yGj7EH39nyKb4A2KKBXEHT49Csf/ — а там 4 мая последний постинг :)",
				"added": 1495040982
			},
			{
				"comment_id": 109,
				"body": "> [akachan](#comment_13_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Уезжаю из этой говностраны\n\nПроблема в том, что тут всю планету менять надо. «*Остановите Землю, я сойду…*»",
				"added": 1495041245
			},
			{
				"comment_id": 110,
				"body": "> Российская армия может использовать сервисы «Яндекс.Карты», «Яндекс.Пробки», «Яндекс.Навигатор» для планирования наступления на Украину. Об этом в среду, 17 мая, в ходе круглого стола в Киеве заявил руководитель службы по вопросам информационной безопасности Совета национальной безопасности и обороны Украины (СНБО) Валентин Петров, передает агентство «Укринформ».\n\n// https://www.ukrinform.ua/rubric-technology/2229793-rosia-moze-vikoristati-andeks-karti-dla-nastupu-na-ukrainu-rnbo.html",
				"added": 1495042285
			},
			{
				"comment_id": 111,
				"body": "> [murka](#comment_7_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Вот пожалуй чего не надо, это не надо нытья.\n\nА это не нытьё. Это констатация факта :)\n\n> Мы живем в довольно интересное время\n\nУгу. Старое китайское проклятье про жизнь в интересное время :D\n\n...\n\nЯ много интересного времени успел застать, начиная с «периода застоя» чтобы проникнуться смыслом этой поговорки :D\n\n>Если такое воздействие на интернет нас и огорчает, то это потому-что он достался нам в готовом виде.\n\nЯ прошёл почти весь путь формирования современного информационного общества. Начиная от программируемых калькуляторов и 8-ми битных машин. И в формировании Рунета в определённой степени принимал непосредственное участие с 1997-го. Так что — нет, лично мне оно не досталось в готовом виде :D\n\n>Вот что действительно вредно, так это оказываться под влиянием информационной манипуляции, того, что формирует сознание и искажает восприятие окружающей действительности. И если ради удобства продолжаем пользоваться преимущественно такими площадками, при наличии защищенных альтернатив, то какое-то нытье выглядит не только бессмысленным, но и лицемерным.\n\nА [популярных, но и не только] распределённых площадок «без манипуляций» сегодня практически нет. ZeroNet тут выглядит скорее некоторым исключением, за что мне и нравится. Но это не надолго. А, вот, скажем, всевозможные RetroShare/SSB Patchwork/Steem.it/Golos.io/GNU Social/Mastodon — все они уже весьма манипулятивные. Неконформные оттуда выпиливаются.",
				"added": 1495145902
			},
			{
				"comment_id": 112,
				"body": "> [floppydrive0](#comment_1_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b): Лучше бы подумали, да сами выпилились из этого говна.\n\nКак я заметил ранее — для этого нужно «выпилиться» с планеты. Мир сегодня очень тесен.",
				"added": 1495146207
			},
			{
				"comment_id": 140,
				"body": "> [kissarat](#comment_2_1CTfYHpT4BrXndZbGxvsuZUhiEgbMwiwdi): Теперь большинство использует Opera\n\nУ нас на форекс-сайте количество заходов с Украины упало раз в пять. И примерно во столько же выросло количество заходов их Голландии и соседей :) А цена клика с них в разы выше, кстати. Так что у нас контора в небольшом, но выигрыше :D",
				"added": 1503242826
			}
		],
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 115,
				"body": "> [akachan](#comment_27_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Google.ru\n\nОн не умеет индексировать Зайты (через прокси).",
				"added": 1495735582
			},
			{
				"comment_id": 117,
				"body": "> [akachan](#comment_32_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Да я же пошутил ^^\n\nНу, с учётом того, что Гугл, в общем, JS индексирует, это не такая уже и шутка :) Но в этом конкретном случае — увы. Всё хочу сделать статические прокси, чтобы поисковики могли индексировать, но всё руки не доходят :)",
				"added": 1495962084
			}
		],
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 116,
				"body": "> [gnome](#comment_29_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Справедливости ради, тут вообще кроме этого форума пока ничего нет.\n\nЯ бы сказал, что, наоборот, этот форум — одно из самых малопосещаемых мной месте ЗероНета :) Ну и в рамках сабжа мне тут активность сложно проявить: «**USED: 90.4K/100K**». Лимитов почти не осталось, а @shift что-то не отвечает :)\n\nА в целом у меня ZeroNet — самая посещаемая p2p-сеть. Конечно, активность моя тут ниже, чем в реальном Интернете, но всё равно каждый день есть что-то интересное.",
				"added": 1495961958
			},
			{
				"comment_id": 118,
				"body": "> [akachan](#comment_52_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Так подкинь чего интересного?\n\nЕсли речь именно о форумах, то я активнее всего пишу на:\n\n- http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n- http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n\nПлюс к этому ZeroMe и комменты в блогах :)",
				"added": 1496015869
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 119,
				"body": "> [murka](#comment_18_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Проверю, отпишусь если рабочий.\n\nНу, по логике, если рабочий, то отписаться уже не получится :D",
				"added": 1496053040
			},
			{
				"comment_id": 120,
				"body": "> [murka](#comment_20_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): А я говорил, что петарды не тема.\n\nКонечно, не тема. Вот у меня знакомый с друзьями как-то центнер аммонала рванули. Берег речки обрушили :) Этого бы хватило. Материалы, кстати, доступные в любом хозяйственном. Хотя сегодня в таких объёмах сложнее купить. А раньше 80 килограммовые пакеты аммиачной селитры в каждом колхозе многими тоннами даже без сторожей валялись... Идёшь из лесу с грибами, ведро селитры на огород захватишь. «Всё вокруг колхозное, всё вокруг моё» :)\n\nВот в общаге масштабы были скромнее, аммонала только 400 грамм взрывали, берёзку молодую завалили. Но это уже на грани эффективности, друг, что это делал, очень тщательно заряд готовил. Аммонал сложно взорвать в небольших количествах.",
				"added": 1496053280
			},
			{
				"comment_id": 448,
				"body": "> [nyamstr](#comment_2_13ht76ETojWVDjnPwFTyqXT3CDVUVcJDC2): Самый лучший способ)\n\nИМХО, большинство обитающих в ZeroNet уже итак покинули тот мир :)",
				"added": 1540574600
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 121,
				"body": "Нас вот тут немного из ZN есть: https://t.me/decentralized_social",
				"added": 1496286777
			},
			{
				"comment_id": 122,
				"body": "> [pozya](#comment_10_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Пользуюсь, но рекомендую матрицу :) \n\nУ клиентов Matrix юзабилити уровня 2000-го года. Для непритязательного юзера. И там контактов нифига нет :)",
				"added": 1496390262
			},
			{
				"comment_id": 123,
				"body": "> [kodomoneko](#comment_28_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9): Полазил. Ни фига не понятно\n\nОтвет тут: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:21_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/XMPP+Jabber",
				"added": 1496724817
			},
			{
				"comment_id": 179,
				"body": "> [bplohish](#comment_35_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD): А ты уже придумал как в ближайшем будущем будешь обходить DPI провайдера для доступа в Tor и i2p?\n\nНу, Tor ещё ладно. А как DPI будет i2p вычислять?\n\nДа и что про обычные VPN?",
				"added": 1505481114
			},
			{
				"comment_id": 182,
				"body": "> [mewmewpower](#comment_39_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): ⚡ элементарно, не жить в России\n\nТак под Tor понемногу копают во всех странах. Так что либо только под ещё бОльшие санкции нарвёшься, либо только отсрочишь.",
				"added": 1505500842
			},
			{
				"comment_id": 184,
				"body": "> [mewmewpower](#comment_40_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Пока докопаться лет 💯 пройдёт\n\nБоюсь, что не угадаешь. Да ещё того гляди как «российский хакер» сядешь :)",
				"added": 1505548541
			},
			{
				"comment_id": 198,
				"body": "> [tokyomewmew](#comment_11_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Разве? Насколько я понял, все связи с рашкой порваны\n\nФормальные — порваны. Фактически — его разработчики в России. Так что докопаться, в общем, могут.\n\nА переведёт разработчиков на Запад — их там ФБР быстро нагнут куда нужно, если уже во время обычного выезда пытались :)",
				"added": 1508343943
			},
			{
				"comment_id": 216,
				"body": "> [zerogosen](#comment_1_1MZQdtSJWVrCC8L3usDaMmm8MgQbrHDfBY): работает на блокчейне\n\nТогда сразу в отстой. Блокчейновые мессенджеры при активном использовании сообществом жрут память как грязь. Что Twister, что Bitmessage уже малоюзабельны. У первого сам блокчейн уже гик весит, второй просто ресурсов жрёт как не в себя при долгой работе, хотя блокчейн пока относительно небольшой из-за малой популярности.",
				"added": 1510079325
			},
			{
				"comment_id": 219,
				"body": "> [dude](#comment_32_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): В bitmessage нет блокчейна.\n\nОк. Но в любом случае это не отменяет принципиального недостатка блокчейна — необходимость держать локально весь блокчейн.",
				"added": 1510127996
			},
			{
				"comment_id": 223,
				"body": "> [ww](#comment_9_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): А тут есть люди из Retroshare?\n\nЯ — условно. Одно время плотно пасся, но из-за постоянно падающего клиента сейчас почти прекратил. Точнее, это в первую очередь. Во вторую, менее важную, из-за предельной убогости клиента  :) Фактически он в форумах годится только для простенькой переписки. Блоги/микроблоги, статьи — это всё не про RS.\n\nКлюч свой кидал в http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:14_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/RetroShare",
				"added": 1510739150
			},
			{
				"comment_id": 224,
				"body": "> [ww](#comment_10_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): Но в целом там полезное только a'la IRC чатик\n\nЧатиков полно разных, в том числе и анонимных :)\n\nУ RS киллер-фича — анонимный обмен файлами и коллекциями. Но из-за особенностей реализации (падучесть, невозможность работать на безголовом сервере) киллерфича никак не выстреливает, по крайней мере у меня :)",
				"added": 1510760164
			},
			{
				"comment_id": 225,
				"body": "> [ww](#comment_12_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): на безголовом успешно работает. есть веб интерфейс достаточный для чатиков\n\nЧатики — это _не_ работа :) Работа — это хотя бы файлы и форумы.",
				"added": 1511067279
			},
			{
				"comment_id": 226,
				"body": "> [ww](#comment_14_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): скачивать файлы можно было и в первой версии версии веб интерфейса\n\nРаздавать файлы и форумы можно?",
				"added": 1511186649
			}
		],
		"1_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828": [
			{
				"comment_id": 124,
				"body": "> [anonim](#comment_2_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828): да и вообще почему то про ipfs очень мало информаци\n\nА какой там информации не хватает? Он же простой как 5 копеек. Залил, получил ссылку, пользуешься.",
				"added": 1496948166
			},
			{
				"comment_id": 127,
				"body": "> [anonim](#comment_5_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828): почему ипфс не может раздавать,например, видео файлы с файловой системы как торенты?\n\nМожет, см. опцию `--nocopy`. Проблема в том, что для таких файлов хеш отличается от обычного. Т.е. для новых файлов, в т.ч. для раздачи кино это нормально, а перевыложить сотню гигов старых архивов для экономии места не получится :)",
				"added": 1502526969
			},
			{
				"comment_id": 128,
				"body": "Кстати, интересный бонус — одно и то же видео можно смотреть онлайн разными способами :) Например:\n\n- https://ipfstube.erindachtler.me/v/QmXvCAXwkVcxfq8r2WB93CxkoXyveQuKqaCUJEiYY9A48j\n- http://subhttp.radiantmediaplayer.com/test-your-streaming-url.html?streamProtocol=mp4&streamUrl=https%3A%2F%2Fgateway.ipfs.io%2Fipfs%2FQmax6ahC3Rfp6BBkTH23QjY5gTxgJbwg72DR28cAvYPxbB%2F%25D0%2594%25D0%25BE%25D0%25BA%25D1%2582%25D0%25BE%25D1%2580%2520%25D0%25A1%25D1%2582%25D1%2580%25D1%258D%25D0%25BD%25D0%25B4%25D0%25B6%2520%2528Doctor%2520Strange%2C%25202016%2529.mp4\n\nНу и прямые ссылки, типа:\n\nhttps://gateway.ipfs.io/ipfs/Qmax6ahC3Rfp6BBkTH23QjY5gTxgJbwg72DR28cAvYPxbB/\n\nХотя использовать для этого популярные IPFS-гейты, ИМХО, плохая идея — если все кинутся смотреть так кино, то они лягут :) А без гейтов ZeroNet использовать IPFS не может. Надо пропагандировать локалхостовый IPFS.",
				"added": 1502527863
			},
			{
				"comment_id": 181,
				"body": "> [mewmewpower](#comment_27_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Не работает на виндеНе работает на ведре\n\nПро Android не знаю, а вот с видео через удалённые гейты, действительно, всё не весело — похоже, что оно не начинает отдачу, пока весь файл не скачает. А на гейтах такие большие файлы быстро вычищаются сборкой мусора.\n\nВот с локалхостом нормально работает, шустро.\n\nСоответственно, нужно запустить `ipfs daemon` и потом в браузере, например:\n\nhttp://subhttp.radiantmediaplayer.com/test-your-streaming-url.html?streamProtocol=mp4&streamUrl=http%3A%2F%2F127.0.0.1%3A8080%2Fipfs%2FQmax6ahC3Rfp6BBkTH23QjY5gTxgJbwg72DR28cAvYPxbB%2F%25D0%2594%25D0%25BE%25D0%25BA%25D1%2582%25D0%25BE%25D1%2580%2520%25D0%25A1%25D1%2582%25D1%2580%25D1%258D%25D0%25BD%25D0%25B4%25D0%25B6%2520%2528Doctor%2520Strange%2C%25202016%2529.mp4\n\nИли в VLC по Ctrl-N ввести http://127.0.0.1:8080/ipfs/Qmax6ahC3Rfp6BBkTH23QjY5gTxgJbwg72DR28cAvYPxbB/%D0%94%D0%BE%D0%BA%D1%82%D0%BE%D1%80%20%D0%A1%D1%82%D1%80%D1%8D%D0%BD%D0%B4%D0%B6%20%28Doctor%20Strange,%202016%29.mp4",
				"added": 1505499925
			}
		],
		"1_1Cyyr76U2n1mNR7ctgzgH8BoDzVXoRc6UY": [
			{
				"comment_id": 125,
				"body": "1\\.  Используй для оформления кода тройные бэктики ` ``` ` перед блоком кода и после него, а то в этой каше не разобраться.\n\n```html\n<meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\" />\n<base href=\"\" target=\"_top\" id=\"base\">\n```\n\n// http://coddism.com/zametki/razmetka_readmemd_v_github\n\n2\\. Смотри выхлоп в консоли браузера, если есть ошибки, там и увидишь.",
				"added": 1499945054
			}
		],
		"1_131EvTsxkEMjSV2S2oghQGk1zisHAZ2GXG": [
			{
				"comment_id": 126,
				"body": "У меня ZeroNet в Firefox с NoScript при разрешённых скриптах нормально работает. Хотя им почти не пользуюсь, вот это сообщение пишу для теста из Firefox.",
				"added": 1500828921
			}
		],
		"1_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": [
			{
				"comment_id": 134,
				"body": "> [zalex](#comment_95_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Он \"хранится\" в файле ZeroNet/data/users.json (если ZeroNet установлен на компьютер, а не через прокси/gateway)\n\nЕсли через прокси, то также. Только к этому файлу доступа нет и нужно с админами связываться :)",
				"added": 1502717311
			},
			{
				"comment_id": 135,
				"body": "> [zalex](#comment_98_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Ты чего, там же MasterSeed 0_o\n\nА его достаточно? А то я никогда через прокси не сохранялся :)",
				"added": 1502723343
			},
			{
				"comment_id": 136,
				"body": "> [gomzik](#comment_81_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А может кто-нибудь знает, где хранятся ключи от своих сайтов?\n\nВ том же `data/users.json`. У каждого своего сайта параметр:\n```\n\"privatekey\": \"5Kxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxvyr9\"\n```\n\nСобственно, его только достаточно и копировать, чтобы работать с зайтом на новой машине. У меня почти все  зайты настроены на работу с 3-5 машин.",
				"added": 1502809528
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 137,
				"body": "> [intervi](#comment_3_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk): tox\n\nОн только Internet :)",
				"added": 1503051031
			}
		],
		"1_1EHrBqNZLu3He8t98otjqezt5jRE8euGSA": [
			{
				"comment_id": 139,
				"body": "> [ukraine](#comment_2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Пробовал публиковать в ipfs выпуски radio-t, размер которых до 100 МБ. Они вообще не передавались. Хотя с файлами до нескольких мегабайт проблем небыло\n\nЯ по IPFS фильмы смотрел :) Хотя ждать начала показа приходится очень долго...",
				"added": 1503223249
			}
		],
		"1_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 151,
				"body": ">Но они не решают проблемы хранения и согласования изменений \"под редакцией\" одного или нескольких подписчиков\n\nНе понял проблемы. Ты можешь всегда запросить любую старую версию, независимо от того, кто с ней и когда работал. Ну, если там не химичили особым способом с `git push -f` — это отдельная головная боль :)\n\n> я не могу получить репозиторий имея некий ID и форкнуть свой репозиторий\n\nТы можешь получить нужную версию по ID ревизии. Или ты про вариант, когда у тебя есть магическое число и ты по нему хочешь получить копию репозитория, не имея больше никаких данных о нём, просто зная, что он есть где-то в Инфосфере? Этим не занимается VCS, это вопрос транспортов. Положи, например, Git в IPFS или ZeroNet и раздавай уже соответствующий ключ :)",
				"added": 1503979257
			},
			{
				"comment_id": 153,
				"body": "> [ukraine](#comment_14_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Нету DHT, если кратко. В качества идентификатора репозитория можно использовать и URL (в формате //hostname/pathname, без указания протокола, к примеру), но неплохо было бы, если бы репозиторий можно было получать не имея доступа к URL\n\nТогда, как я и писал, нужно пользоваться посторонними транспортами. Например, через IPFS или ZeroNet просто раздавать репо. Если с репо нужно и работать, то уже нужны решения, типа [Git over ZeroNet](/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/). Но по сути, как я понял (сам пока не щупал) это именно всё та же раздача контента через ZeroNet от одного владельца, как и обычная публикация статических сайтов, т.е. не для коллективной работы через ZeroNet.",
				"added": 1504028763
			}
		],
		"2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 154,
				"body": "> [ukraine](#comment_17_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Да, но вопрос о анонимости самого ZeroNet\n\nАнонимность ZeroNet при работе через Tor полностью определяется анонимностью Tor. Других соединений при этом там не возникает. Естественно, речь о раздаче контента бэкендом. Потому что если говорить о фронтенде, то никто не мешает разработчику чужого зайта поставить там JS-закладки (хотя бы счётчики), которые могут тебя спалить как пользователя при работы из незащищённого браузера.",
				"added": 1504061851
			}
		],
		"3_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 156,
				"body": "Если сделать единый такой сервер, то ZeroNet захлебнётся с его синхронизацией — он же будет обновляться при открытии каждой страницы каждым пользователем.\n\nТак что только если внешняя аналитика. Но это будет нарушением приватности :)\n\n...\n\nХотя, сейчас пробежался по index.html в скаченных зайтах, там дофига ресурсов, использующих CDN (гуглошрифты, jquery, bootstrap и т.п.). Что, в общем, странно, так как и без учёта всякой секьюрности, копировать эти файлы вместе с зайтом выгоднее. Место жрёт мало, а от наличия сети не зависит :)",
				"added": 1504077788
			},
			{
				"comment_id": 159,
				"body": "> [ukraine](#comment_22_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): А для того, чтобы была поисковая система надо иметь возможность получать статический контент.\n\nВот для этого (в том числе) я http://www.zites.cf и сделал :)\n\n> Поисковая система тоже должна быть внешним сервисом с открытой базой\n\nДа, внутри ZeroNet поиск сделать можно, но неразумно. Придётся поисковый индекс по каждой ноде таскать. Хотя, наверное, MergerSite может помочь, но как с ним работать я пока так и не понял. Так что проще с внешним сервисом. Хоть со своим, хоть дождаться, пока Гугл проиндексирует :)\n\nПотом форумами займусь...",
				"added": 1504168010
			}
		],
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": [
			{
				"comment_id": 169,
				"body": "> [towarisch](#comment_23_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Эм, разве поддеживается создание сайтов на питоне? Один жс же можно было\n\nНу, в принципе, наверное, можно что-то типа:\n- http://www.transcrypt.org/\n- http://www.skulpt.org/\n\n(наверняка и ещё варианты есть :) )",
				"added": 1505149442
			}
		],
		"1_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": [
			{
				"comment_id": 174,
				"body": "Ещё нет.",
				"added": 1505451107
			},
			{
				"comment_id": 175,
				"body": "Для затравки:\n\n- http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:1_1B5yLEudL6QUA9XmLTuc24QKXPYcCDmb7K/\n- http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1_15iqrDzr8yg6APprfAWYf75Eab8pX5QFZ5/\n- http://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/\n\nПример оформления от автора идеи:\n\nhttp://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/?Page:тимофеев-владимир\n\nСудя по всему, идея заглохла, автора больше не видно, но он реализовал высказанную мной когда-то идею групповой децентрализованной работы над библиотеками имеющимися сейчас средствами ZeroNet. Т.е. продолжить наполнение может любой желающий :)",
				"added": 1505461377
			},
			{
				"comment_id": 178,
				"body": "> [mewmewpower](#comment_20_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Не забываем, про заливку торрент (так же и i2p) в сеть и публикации магнет ссылок тут\n\nЧерез торрент раздавать одиночные книжки очень неудобно. Так что лучше IPFS.",
				"added": 1505479935
			},
			{
				"comment_id": 180,
				"body": "> [mewmewpower](#comment_24_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Ipfs это отдельная тема. Уух сколько надо трахаться с айпиэфэс под виндой...\n\nДаже не знаю. Просто запускаешь бинарник и всё работает.\n\n> Ещё ➖ минус- хрен пойми когда ты на публичном гейтеа когда нет\n\nТо есть? Или ты работаешь локально по 127.0.0.1, или с удалённым гейтом. Как не понять?",
				"added": 1505499665
			},
			{
				"comment_id": 183,
				"body": "> [mewmewpower](#comment_35_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Или винда 🍷 32бит не подходит\n\nТут не скажу, я последний раз на такой работал уже много лет тому назад.\n\nНо, по идее, 32-х битная версия ipfs не должна отличаться в работе.",
				"added": 1505500901
			}
		],
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 176,
				"body": "> [mewmewpower](#comment_15_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): LTE ? Не, не слышали!\n\nГде связь?",
				"added": 1505461816
			},
			{
				"comment_id": 177,
				"body": "> [mewmewpower](#comment_19_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): Что бля простите?\n\nОк, всё понятно.",
				"added": 1505479889
			}
		],
		"1_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 185,
				"body": ">Идея создание социальной сети способной дать возможность каждому пользователю создать собственную уникальную страницу, добавить недостающую ему функцию и предложить всё это в качестве оптимального апгрейда остальным пользователям. \n\nЯ знаю такую. ZeroNet называется.\n\n>С чего начать ?\n\n1. Установить: http://www.balancer.ru/g/p5321961\n2. Потом зайти на: http://127.0.0.1:43110/\n\n:)",
				"added": 1506832350
			},
			{
				"comment_id": 186,
				"body": "> [zerostorm](#comment_19_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni): Нужно так оформить понимание расширяемости, чтобы это не делало из соцсети что-то ещё.\n\nДа пусть из соцсети делается что угодно ещё. Жалко, что ли :)\n\n>Иначе же, интернет вцелом и есть именно такая соцсеть.\n\nНе отвечает ряду критериев соцсети. Нет на уровне системы социальных отношений. В Интернете нету френдов, френдлент, лайков и т.п. :)",
				"added": 1506834180
			},
			{
				"comment_id": 187,
				"body": "> [mewmewpower](#comment_60_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): В саму основу модема\n\nЭ... Это в каком терминологическом поле?\n\n> это ... тор, торренты, i2p, ipfs, мобильные платформы, Bluetooth, NFC и прочее ... Разработку лучше вести на С подобных языках...\n\n_«А теперь, господа, пристегнитесь. Сейчас со всей этой фигнёй мы попробуем взлететь»_ ©",
				"added": 1506848913
			}
		],
		"7_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 188,
				"body": ">по принципу что и сдесь, вместе со ссылкой на локальный ipfs.\n\nИдея многократно озвучена, многократно начиналась и обычно так же быстро заканчивалась :)\n\nВот, например, была задумка по книгам:\n- http://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/\n- http://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/\n\nПо фильмам пока активности особой нет, думаю, потому что IPFS не обеспечивает анонимности. Хотя тут можно было бы давать ссылки на RetroShare.",
				"added": 1506872117
			},
			{
				"comment_id": 189,
				"body": "> [radjah](#comment_13_1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik): Безголовый клиент там есть для запуска на подкроватном сервере?\n\nНормального варианта нет. Фактически только чат с Web-интерфейсом. Форумы, файлы, вот это всё в безголовом варианте не работает.\n\nЭто, увы, очень сильно снижает востребованность RetroShare.",
				"added": 1507181899
			}
		],
		"1_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni": [
			{
				"comment_id": 191,
				"body": "Хм. А картинки там что, не ставятся? Markdown не работает.",
				"added": 1507316186
			},
			{
				"comment_id": 192,
				"body": "> [zerostorm](#comment_32_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni): Похоже на то. Впрочем, внешние картинки и не нужны, а вот нативные бы не помешали.\n\nС нативными оно в текущем виде не взлетит :) При малейшей активности зайт разжиреет до неподъёмных величин. Даже Merger sites может не спасти — чего достаточно для микроблогов, в нормальных блогах будет занимать намного больше.\n\nНо, главное, для нативных требуется серьёзная доработка. Для внешних — только разрешение на их использование :)",
				"added": 1507349272
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 195,
				"body": "Если задаёшься таким вопросом — то нечего :)",
				"added": 1507958515
			},
			{
				"comment_id": 203,
				"body": "> [renha](#comment_2_1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC): контент надо делать такой какой интересен тебе, тащемт\n\nСогласен :) Публикация неинтересного автору контента приведёт к быстрой потере интереса и прекращению публикаций. А когда публикуешь то, что интересно тебе, это надолго. А коммьюнити подберётся.",
				"added": 1508835239
			},
			{
				"comment_id": 231,
				"body": "> [minack](#comment_5_1JMwDcwoUEvk3erLuqzCpMtFJzKtHSPeom): Надо бы ещё хороший JS плеер.\n\nmp4 браузеры итак хорошо показывают, а всё остальное после выпиливания Flash уже простыми средствами уже всё равно не посмотришь. И уже точно не через JS, в лучшем случае — через плагины.",
				"added": 1512276891
			},
			{
				"comment_id": 262,
				"body": "> [bodqhrohro](#comment_2_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck): Пока что правило таково: нет ничего интересного в этих ваших зеронетах ⇒ эти ваши зеронеты не нужны.\n\nТак что давайте создавать тут разнообразный контент :D Это же не так сложно, написал в блог или на форум «в большом Интернете» — продублируй тут :) Более того, ZeroBlog'и сегодня чисто технически удобнее многих блогов в обычном Интернете...",
				"added": 1515238700
			},
			{
				"comment_id": 269,
				"body": "> [avoiddowntime](#comment_36_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Смотреть как Китай бессмысленно сжирает место на твоем винте.\n\nА зачем давать место на винте бессмысленному с твоей точки зрения зайту? Не нравятся китайцы — не загружай их зайты :)",
				"added": 1516743881
			},
			{
				"comment_id": 271,
				"body": "> [zeroida](#comment_1_1PfpLQwP7LePzj3W3dCw4a2HbmgGsv8YfT): Ты реально не понимаешь, или дурака как обычно включил?\n\nБоюсь, что это ты включил. Или понимаешь сути ZN.\n\n> Китай раздувает любой зайт до которого дотянется\n\nМои, включая этот, почему-то не раздувает :) Может, потому что я не пользуюсь зайтами, где сидят китайцы? Кто тебя заставляет пользоваться раздуваемыми китайцами зайтами?",
				"added": 1517281110
			},
			{
				"comment_id": 272,
				"body": "> [proglifpwnz](#comment_1_1Ji1XzkLU4P4u3Z11ifDaNa53DfqKn8nrR): Например : общение без боязни того, что тебе в лучшем случае позвонят в дверь ОМОНовцы, после обсуждения какой нибудь острой полит-новости.\n\nЗа этим в основном в RetroShare ходят. Хоть там и активность несколько сообщений в неделю. В ZN политота практически отсутствует. Я только один раз за последний год недавно схлестнулся, при чём на англоязычном форуме и с русскоязычным же :)\n\n> Порно, естественно, куда же без этого, но \"нелегальное\" конечно же ( детское, фетишное и прочие )\n\nНе сталкивался в ZN :) Обычное порно видел, но очень мало.\n\n> Политики, Журналисты\n\nНе видел.\n\nЯ в ZN вижу в основном либо китайцев, спорящих на всякие общефилософские темы, типа религиозных воззрений, либо IT-шников «на интерес». Сам тут в первую очередь обкатываю площадку, позволяющую сохранить данные «навечно» без централизации и связанных с этим ограничений.",
				"added": 1517343589
			},
			{
				"comment_id": 280,
				"body": "> [l0bster](#comment_4_1FcMuJwqkSPP7C3gnNLugZGwwSGpugX2rA): А что было с Tor? Идея была похожая, создать площадку для безопасного общения.\n\nTor — не площадка. Это транспорт.",
				"added": 1517647055
			},
			{
				"comment_id": 281,
				"body": "> [putsan](#comment_6_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT): Так давайте сделаем все возможное чтоб минимизировать повторение даного сценария!\n\nК сожалению, тут не работают полумеры. Если ты можешь ограничивать распространение информации, то это же может делать и кто-то другой. И сеть перестаёт быть свободной и неблокируемой.\n\nМожно вводить рейтинги пользователей, игнорировать тех, кто тебе противен, но нельзя блокировать распространение их контента. Иначе завтра этим же займётся Роскомнадзор, RIAA и какие-нибудь соответствующие китайские службы.",
				"added": 1517647214
			}
		],
		"1_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 196,
				"body": "> [zerostorm](#comment_37_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni): 035EDCCACAD737A194E598BAB1C66E3FD360E74D\n\nА где описание? :)",
				"added": 1508053877
			}
		],
		"1_1PEBR3TeTAu1rNL3EuGZtymbvMVKXZyqFK": [
			{
				"comment_id": 210,
				"body": "Что, там уже не одни только майнеры срутся?",
				"added": 1509273833
			},
			{
				"comment_id": 212,
				"body": "> [aikhave](#comment_1_1CKpZb3hvyVXBgf2dk48MsuuiGED9eFncK): Придётся авторизацию прикручивать чтобы по домену ходить как белый человек.\n\nУ ZeroNet «из коробки» есть авторизация  — плагин UiPassword.\n\nНо я предпочитаю через NginX морду ходить, в ней и прописываю http-авторизацию:\n\n```conf\nserver {\n    server_name zeronet.myhost.tld;\n\n    location / {\n        auth_basic \"Protected area: ZeroNet\";\n        auth_basic_user_file /var/www/.htpasswd;\n\n        proxy_pass        http://127.0.0.1:43110;\n        proxy_http_version  1.1;\n        proxy_set_header    Host        $host;\n        proxy_set_header    X-Real-IP   $remote_addr;\n        if_modified_since   before;\n\n        proxy_read_timeout  120s;\n        proxy_send_timeout  120s;\n\n        access_log        off;\n    }\n\n\n    location /Websocket {\n        proxy_pass http://127.0.0.1:43110;\n        proxy_http_version 1.1;\n        proxy_read_timeout 1h; #for long live websocket connetion\n        proxy_set_header Upgrade $http_upgrade;\n        proxy_set_header Connection \"upgrade\";\n    }\n}\n```",
				"added": 1509414641
			}
		],
		"4_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 214,
				"body": "Что с Ингресс, что с Покемонами — не хватило разработчикам нормалных квест-дизайнеров. Могли бы сделать продукты, в которые бы играли сотни миллионов, а в итоге получился пшик :)",
				"added": 1509819463
			},
			{
				"comment_id": 222,
				"body": "> [ww](#comment_7_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): да ладно, толпами на международные эвенты собираются\n\nЭто ничтожно от того количество, которое могло бы играть :) Потенциал этой игры при грамотной реализации — миллионы, если не сотни миллионов пользователей.",
				"added": 1510738980
			}
		],
		"1_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS": [
			{
				"comment_id": 217,
				"body": "- IoT/умный дом\n- Астрофото\n- Книжки/SF&F, кино/SF&F\n- Webdev\n- «Танцпол»",
				"added": 1510079450
			}
		],
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 218,
				"body": "Где-то уже кидал ссылку, но тут тоже по теме: https://t.me/decentralized_social",
				"added": 1510079508
			}
		],
		"1_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc": [
			{
				"comment_id": 229,
				"body": ">Почему бы не использовать ссылку на хеш в IPFS - как хранение контента? \n\nЯ так и делаю :)\n\nДругое дело — что конкретно хранить? Как выше заметили, «кто будет хостить»? IPFS в ZN добавляет новую точку отказа у  которой есть две тонкости:\n\n1. Нужно, чтобы кто-то всё это хранил. Да, пока ты в сети, ты раздаёшь контент. Но что будет, если тебя в сети не станет? В ZN контент доступен, пока есть кто-то заинтересованный в нём. Зашёл на зайт — раздаёшь его. В IPFS такого нет. Каждый должен вручную пинить нужные ресурсы и нет никаких средств узнать число пинов. Максимум — количество пиров с файлом, но это может быть кеш других нод, который через час, день или неделю будет вычищен.\n\n2. Львиная доля юзеров ZN, особенно — посторонних читателей через прокси, не имеет у себя IPFS-демона на рабочей машине. Да что там, у меня самого нет IPFS на рабочих десктопах, только на серверах. Значит раздавать ссылки надо через гейты. Можно через официальный гейт. Но где гарантии, что он останется цел завтра? Я поднял под свои раздачи свой гейт, так как могу гарантировать, что он будет работать, пока я жив и дееспособен, но что будет после того, когда меня не станет? :D Да, в таком случае раздача моего контента меня уже не будет беспокоить, но он перестанет быть доступен для других. Проблема, которую как раз ZN предназначена решать.\n\nСловом, простые тексты весят мало, так что ZeroNet прекрасно с ними справляется, на них и ориентирована. А что до остальных ресурсов... Я сейчас пришёл к такой схеме в блогах — превьюшки картинок (ну, как превьюшки, всё, что влезет в штатные 200кБ, т.е. до 1024x...1280x) размещаю в ZeroBlog, а вот ссылку на полноразмер ставлю уже в IPFS через свой гейт.",
				"added": 1512275389
			},
			{
				"comment_id": 320,
				"body": "> [azz](#comment_28_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Вот только смысла особо то нет. Один с двухсот пользователей скопирует хеш и загрузит через ipfs add в лучшем случае.\n\nС моего предыдущего сообщения (всего 4 месяца назад) много воды утекло :) За это время:\n\n- Я [окончательно разочаровался в IPFS](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:28:IPFS:+разочарование) и отказался от дальнейшего использования (хотя продолжаю, естественно, поддерживать старые данные).\n- В ZeroBlog нормально заработал механизм авторесайза для аплоада больших фоток. Это не обеспечивает никакого доступа к оригиналам, но сильно упрощает работу с блогом, из-за чего на полноразмеры проще тупо забить ибо лень делать много лишних движений :)\n- В ZeroNet эффективно заработала раздача больших файлов ([ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/), [KopyKate](/big.kopykate.bit/) и т.п.), а опциональные были и раньше.\n\nТак что потенциал IPFS в ZeroNet, ИМХО, сильно упал :)",
				"added": 1522289810
			},
			{
				"comment_id": 326,
				"body": "> [anotherneko](#comment_29_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Дедупликация уровня файловой системы позволит …\n\nА в каких FS есть дедупликация? Я знаю только в BTRFS и ZFS, но обе ФС — это довольно жёсткое красноглазие, при чём с дедупликацией и в той, и в другой, много жалоб :)\n\n...\n\nНа самом деле контент-адресация в IPFS имеет основным бонусом не дедупликацию, это побочный бонус. А именно отсутствие произвольной адресации. Сокрытие пути до контента. Тебе не важно, где и как хранится контент, главное — знать его идентификатор.\n\nПравда, тут до идеального решения не хватило одного шага. Возможности задавать произвольные имена файлов и расширения для mime. Если бы вместо `/ipfs/QmTUeRKutKfbTRmoXsgRTv4r9zKJyFVrX3NVLQctRmoa1v` можно было писать `/ipfs/QmTUeRKutKfbTRmoXsgRTv4r9zKJyFVrX3NVLQctRmoa1v/any-ignored-file-name-with-extension.jpg`, то юзабельность была бы на порядок выше. Да, такое можно сделать на уровне nginx-реверс-прокси, но это уже будет костыль, к тому же, конфликтующий с валидными именами IPFS-каталогов.",
				"added": 1522485975
			},
			{
				"comment_id": 328,
				"body": "> [anotherneko](#comment_30_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): \n> На самом деле это реализовано. Нужно добавлять файл с ключем -w и тогда вместо  /ipfs/QmTUeRKutKfbTRmoXsgRTv4r9zKJyFVrX3NVLQctRmoa1v будет /ipfs/Qmf8NNfsgANUBs9bWZvzsyv4hA5uFBJrRs4xZBzbzGWd5k/any-ignored-file-name-with-extension.jpg\n\nНет. Это совсем другое. Тут хеш не файла, а каталога. Соответственно, весь бонус контентной адресации (и дедупликации) накрывается. Да, я и сам пользуюсь таким методом, но переименование файла = создание нового каталога с новым хешем.\n\n> На практике все оказалось не так радужно, большинство людей пользуются шлюзом а не поднимают свою ноду, от чего файлы живут только когда выложивший находится в онлайне.\n\nЯ под свои нужды поднял штук 6-7 нод на VPS и нормальных серверах. Но всё пришлось свернуть, когда IPFS стала жить по принципу «сколько находит памяти, столько и занимает» :)",
				"added": 1522563797
			}
		],
		"2_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc": [
			{
				"comment_id": 232,
				"body": ">Add this line to cert_signers to accept these ids:\n>\"kaffie.bit\": [ \"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\" ]\n\nСейчас на пробу добавил в [Infonesy.Talk](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC), но, один фиг, не позволяет выбрать другой сертификат при отправке сообщения. В списке есть, но пассивное.",
				"added": 1512290393
			},
			{
				"comment_id": 233,
				"body": "> [dude](#comment_35_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): balancer: так сначала нужно идент создать, а потом уже использовать.\n\nЭто как?",
				"added": 1512291159
			}
		],
		"1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S": [
			{
				"comment_id": 234,
				"body": ">Сеть на анонимная, но тоже децентрализованная и тоже за свободный обмен информацией\n\nОна не просто не анонимная. Она персонифицированная :) Правила большинства эх требовали участия под своими реальными именами. И за обнаружения нарушений этого правила бывали баны :) Ну и кроме того, большинство фидошников встречались в реале :D\n\nИ она совсем даже не была децентрализованной. У ФИДО довольно жёсткая фиксированная иерархическая структура, изменения в которой должны были тщательно согласовываться.\n\n>сейчас перерождается, то бишь модем уже не нужен\n\nЯ там последние разы писал что-либо в районе 2000 года. И уже тогда модем был не нужен ;)",
				"added": 1512542425
			},
			{
				"comment_id": 235,
				"body": "> [difrex](#comment_1_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): Туда, в  принципе, можно сделать гейт от сюда.\n\nМожно сказать, уже понемногу приступили :)\n\nhttps://www.linux.org.ru/news/internet/13856153\n\n(там дальше в теме обсуждение гейта)",
				"added": 1512542479
			},
			{
				"comment_id": 236,
				"body": "> [raigh](#comment_1_1ErP7V6fm8DXopife1ANk6DEJUBQhCB3F4): Архив зачем?\n\nДля истории. Я сейчас часто ссылаюсь на архивы FIDO конца 1990-х гг, которые доступны в Google Groups. И с ужасом жду момента, когда Google снесёт этот проект :-/ В других-то местах этих архивов не осталось.",
				"added": 1512542581
			},
			{
				"comment_id": 238,
				"body": "> [difrex](#comment_3_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): момент с зеронетом пропустил. Думал, что решили делать связку infonesy<->elp/gk11->idec\n\nНу так Infonesy — это только транспорт, надо же куда-то данные с gk11 потом переправлять? Вот ZeroBlog/ZeroTalk — очень подходящие кандидаты :)",
				"added": 1512571828
			},
			{
				"comment_id": 239,
				"body": "> [difrex](#comment_4_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): Ага, ок. Нужно поближе с Infonesy познакомиться :)\n\nА там пока знакомиться по большому счёту не с чем :) Сколь-нибудь законченного описания системы в документации нет, только многократные обсуждения на форумах и блогах. Обычный замкнутый круг. Пока делаешь это один, нет надобности тратить время на формализацию описаний и документацию. Пока нет документации — работаешь один :)\n\nПримеров работающего завершённого кода тоже очень мало и бОльшая его часть уже концептуально устарела, поскольку при написании новых драйверов/транспортов вылезают какие-то моменты, позволяющие более оптимально потом переписать старый код, но руки до этого обычно не доходит — «работает и ладно». Поэтому пока все компоненты доводятся до уровня «работает собранное на коленке и прибитое гвоздями для тестов — и ладно» :)\n\nЯ так в дальних планах полагал, вот закончу базовый многосторонний охват ZeroTalk/ZeroBlog/Facebook/Twitter/Telegram/Vanilla/Flarum/BalancerBoard — и тогда можно в уже этой работающей структуре начать переписывать драйвера Infonesy в окончательный культурный вид, выкладывать, документировать и давать возможность присоединиться желающим :) Но все работы иду с довольно низким приоритетам, так что, может, и год ещё уйдёт...\n\nТак-то формально входная точка проекта: http://www.infonesy.wrk.ru/\n\nВсякие сырые заготовки и обрывки кода можно тут посмотреть: https://github.com/Balancer?tab=repositories&q=infonesy\n\nЧасть компонентов получается настолько простой, типа чтения избранного из Твиттера, что оно работает вообще на простых однофайловых скриптах и поэтому руки не доходят оформить в нормальном виде. А что-то, наоборот, натыкается на столько подводных камней, что даже в работающем виде реализовано ещё совсем ужасно, типа драйвера для Vanilla из-за особенностей архитектуры форума или MyBB из-за древности кода (второй по возрасту, самый древний — вообще FluxBB, который я потом решил вообще не развивать :))",
				"added": 1512656119
			},
			{
				"comment_id": 244,
				"body": "> [difrex](#comment_5_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): О, есть вика в каком-то состоянии :)\n\nНу да, «edited this page on 14 Jan 2016» :) Это первые прикидки драфтов. Дальше тупо всё описывал в коде, благо в YAML-файлах оно итак красиво смотрится. Суть, правда, не изменилась, основные поля при обмене те же. Разве что от раздельного описания полей, типа автора, стали вложенным массивом. Т.е. раньше было:\n```yaml\nTitle: 'МДК \"Зубры\" и \"Джейраны\" и другие корабли на воздушной подушке [3] [havron#14.01.16 19:43]'\nAuthor: havron\nAuthorEmailMD5: 9302d84bd5b1686e9a96c39a0b669bd5\nAuthorUUID: ru.balancer.board.user.7022\n```\n\nТеперь:\n```yaml\nTitle: 'МДК \"Зубры\" и \"Джейраны\" и другие корабли на воздушной подушке [3] [havron#14.01.16 19:43]'\nAuthor:\n    Title: havron\n    EmailMD5: 9302d84bd5b1686e9a96c39a0b669bd5\n    UUID: ru.balancer.board.user.7022\n```",
				"added": 1512689219
			},
			{
				"comment_id": 263,
				"body": "> [runion](#comment_5_1Bm9NkdtYavTV3FvDtET1D6zjaJNa467YD): мля, это не вопрос это уствержение, вопросительный знак лишний :)\n\nТут можно редактировать свои сообщения ;)",
				"added": 1515365538
			}
		],
		"5_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 237,
				"body": "http://kissvk.com/ + скачивание локально.\n\nСам много лет держал всю музыку в ВК, но теперь пришлось вернуться к локальному использованию.",
				"added": 1512542645
			}
		],
		"1_12TkPLvsD5FecF8Xbv331qjcvbY6Dt9DFa": [
			{
				"comment_id": 248,
				"body": "> [promusik](#comment_4_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): ZeroNet forever!\n\nАга, я уже пару раз упоминал буржуям её в этом контексте. Но не заинтересовал :)",
				"added": 1513409200
			},
			{
				"comment_id": 251,
				"body": "> [blinkel](#comment_13_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Разве это не значит, что провайдер может блокировать трафик ZeroNet?\n\nМожет. Но тут начинаются всякие технические трудности, из-за которых овчинка не стоит выделки. Вот, например, Facebook отбашляет, чтобы блокировали или хотя бы урезали скорость к Google+ — это запросто. Ресурсы централизованные, блокировки финансово выгодны. А на блокировке ZeroNet, во-первых, денег не сделаешь, во-вторых, децентрализованные сети требуют серьёзного DPI, что требует затрат средств, на которые в США провайдеры не пойдут, пока их не прижмут соответствующими законами, как в России.",
				"added": 1513447768
			},
			{
				"comment_id": 252,
				"body": "> [anotherneko](#comment_3_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Не нужен никакой DPI, просто режем все что не 80 и не 443 порт\n\nВот ZeroNet и будет работать по 80 порту в таком случае :) Или через Tor, работающий по 80-му порту.\n\nhttps://superuser.com/questions/437844/using-tor-behind-a-proxy-when-just-port-80-is-open\n\nhttps://tor.stackexchange.com/questions/218/how-to-use-tor-behind-a-http-only-proxy\n\nи т.п.",
				"added": 1513542921
			},
			{
				"comment_id": 254,
				"body": "> [anotherneko](#comment_4_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): В zeronet большинство пиров живут на 15441 порту\n\nЕсли начнут блокировать в тех же США (контекст!), то это не на долго :D\n\nИ, повторюсь, львиная доля ZeroNet работает через Tor. Он вообще ничего не знает про 15441.\n\n> но порог вхождения поднимет одновременно со снижением удобства использования.\n\nНу так любые ограничения в Интернете повышают порог вхождения. На то они и ограничения :) Кстати, при появлении ограничения количество пользователей Даркнета должно только расти. Ибо те, для кого порог вхождения подъёмный, но при нормальной работающем Интернете просто ленятся заниматься всей этой фигнёй, вынуждены будут, таки, ею заняться.",
				"added": 1513565266
			},
			{
				"comment_id": 255,
				"body": "> [uqe](#comment_4_1FgFH7wd14bmcDczVWaBp16hFWSRHUgVcD): Децентрализацию сложней контролировать\n\nНамного сложнее. При отсутствии конкретных единичных критичных узлов, контролировать придётся на порядки больше.\n\n> Кажется, достаточно топорно поставить низкий приоритет IP адресам вне серверных диапазонов.\n\nЧто такое «серверные диапазоны»? :) В условиях катастрофической нехватки IPv4 и перехода на IPv6? :) Переход к «белым спискам» ставит крест на информационном прогрессе. Государство, которое перейдёт к такому начнёт быстро отставать в развитии от государства, где такого не будет. Всеобщая информатизация, Интернет вещей, умный дом, вот это всё... Оно весьма плохо совместимо с «белыми списками» ;)",
				"added": 1513565481
			},
			{
				"comment_id": 259,
				"body": "> [anotherneko](#comment_5_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Можно просто порезать до каких-нибудь 32kbit/s. Формально работает, но пользоваться невозможно.\n\nНу, именно для ZeroNet это, как раз, не проблема :) Просто обмен данными будет замедляться, а работа на локалхосте всё равно будет комфортной. За сутки на 32кбит/с можно перегнать больше 300Мбайт данных.",
				"added": 1513815184
			},
			{
				"comment_id": 261,
				"body": "> [stanz](#comment_4_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS): Бля я недавно в сша переехал :C\n\nНичего, ZeroNet спасёт :)",
				"added": 1514621579
			}
		],
		"2_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 249,
				"body": ">Сколько будет весить ZeroNet при его развитии?\n\nВ самом идеальном случае столько же, сколько весь Интернет :D Но зачем тебе хранить всё?\n\n>Я вот смотрю, посты тянутся с самого начала т.е. с самого появления контента и с самого первого поста блога за которым ты следишь, за форумы вообще молчу. Сейчас мой маленький ZeroNet занимает 250 мегабайт.\n\nТы путаешь мух с котлетами. Тебе не важно, сколько будет занимать весь ZeroNet. Тебе важно, сколько весят интересные тебе зайты. Зайты при некорректной разработке могут весить много, да. Например, если кто-то выложит пару терабайт своей видео-коллекции. И такое возможно :D\n\nНо при правильном подходе отдельные зайты весят единицы мегабайт. Блог за 50 лет? Делай просто клонирование блога раз в год и пиши в новый со ссылкой на старый. Тогда обычные пользователи будут качать только свежий и маленький блог. А вот кому уже будет интересно твоё творчество — загрузят и будут поддерживать и архивы.\n\nНе стоит забывать, что крайняя лёгкость клонирования диктует совершенно другой подход к работе с системой. Зачем на форуме подфорумы, когда идеологически верным будет простое клонирование форума?",
				"added": 1513409506
			},
			{
				"comment_id": 253,
				"body": "> [zeroghostuser](#comment_1_171qmSgBM4H3Lpk5ZZV33bVkbnWL8FVVSU): @balancer73, а где можно прочитать по подробнее про клонирование зайтов?\n\nДля большинства зайтов (где это не запрещено явно, например, из-за целей отладки или сложной архитектуры) это делается в меню зайта в левой колонке на стартовой странице. Т.е. два клика — и у тебя готова своя чистая (без данных) копия зайта. Так клонируются ZeroBlog'и, ZeroTalk'и, ZeroWiki.\n\nЕсли клонирование зайта явно не разрешено, то это нужно делать вручную. Всё равно в ZeroNet у тебя есть полная копия любого зайта. Скажем, мне не подходит то, что в ZeroUp минимальный размер файла 10Мб. А мне нужно и меньше выкладывать. Я лезу в консоль и пишу `./zeronet.py siteCreate`. Получаю адрес (хеш) нового пустого зайта и приватный ключ для его публикации. Потом копирую все файлы ZeroUp и во всех файлах исправляю его адрес на свой. Ну и плюс подправляю всё, что найду сопутствующего — название, адрес владельца, лимиты и т.п. Дальше публикую его как и любой другой зайт — копия готова.",
				"added": 1513564999
			},
			{
				"comment_id": 382,
				"body": "На десктопе сейчас 22.5Гб с разреженными файлами, 14.7Гб реальных. Надо бы почистить optional :)",
				"added": 1528020173
			}
		],
		"2_1PQSdkCfwKLKT4pWEpf33BkjvYX78wj1kJ": [
			{
				"comment_id": 250,
				"body": "> [beavis](#comment_2_1AGBVYHN9hf5DrkJg7YXcrJQtDhdRwZDnb): да тут одна школота ебаная с хакера\n\nВы так самокритичны! Но есть тут и другие, кроме Вас.",
				"added": 1513409531
			}
		],
		"1_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 256,
				"body": "А что за печаль нам в каких-то японских анимешечках в централизованном Интернете?\n\nЯпонские анимешечки, кстати, активно в Mastodon перебрались.\n\nУже много раз приходится давать подобные комментарии, так что слепил затравку:\n\n[Особенности контингента разных распределённых соцсетей](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:26:Особенности+контингента+разных+распределённых+соцсетей)\n\nБуду позже пополнять.",
				"added": 1513651953
			}
		],
		"3_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 257,
				"body": "Ответил в блоге, а то ZeroTalk картинки не умеет: http://127.0.0.1:43110/1GmoFQHVjYj4xDZZ5oMNnkGhvnfY1w3pPM/?Post:9:фейерверки+бывают+разные",
				"added": 1513652672
			}
		],
		"2_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 258,
				"body": "Килограмм на кубометр воды. На речку не наберёшь :)",
				"added": 1513668148
			}
		],
		"1_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 264,
				"body": ">Децентрализованный YouTube\n\nКакой же это YouTube, когда это чистый PornHub :)",
				"added": 1515365629
			},
			{
				"comment_id": 295,
				"body": "> [gitpol](#comment_2_1HfFyR9N9t4qwEngJSV5JoQE5eccWoPaWE): ахахахЧто люди хотят то и показывает, видать ты очень хотел порно посмотреть :)\n\nО! В ZeroNet появилась телепатия и они уже знают, что мне нужно при первом открытии сайта? Даже когда я сам об этом не в курсе? Круто! :D",
				"added": 1519375446
			}
		],
		"1_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 265,
				"body": "> [x86128](#comment_2_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Получается что какой внутренний трекер знает про него, но в данный момент просто нет сидов?\n\nВидимо, инфо о наличии блога разошлась, но ни одного живого пира с этим блогом нет. Я с этим не сталкивался, так как сперва блоги у меня всегда онлайн, а потом они уже по десяткам пиров расходятся.",
				"added": 1515688019
			}
		],
		"1_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": [
			{
				"comment_id": 266,
				"body": "> [touhou13](#comment_10_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t): bitcoin\n\nТолько там для обеспечения анонимности нужно предпринимать меры. И без 100% гарантии.",
				"added": 1515959621
			},
			{
				"comment_id": 268,
				"body": "https://ru.bitcoinwiki.org/wiki/Анонимность\n\nhttps://forklog.com/politsiya-danii-pervoj-v-mire-otsledila-bitkoin-tranzaktsii-narkotorgovtsev/\n\nhttps://habrahabr.ru/post/196528/",
				"added": 1515977270
			}
		],
		"1_14bw6fqidkkwyY7XX6uxPevGvNkEPk3ffk": [
			{
				"comment_id": 270,
				"body": "> [putsan](#comment_4_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT): Что такое RMS?\n\nТрадиционно так зовут Ричарда Столлмана, но тут, по контексту, что-то другое :)\n\nЕсть ещё:\n\n- Records Management System\n- Royal Mail Ship\n- Radiation Monitoring System\n- Root Mean Square\n- Rights Management Services\n- Republik Maluku Selatan\n- Remote Monitoring System\n- Random Mass Storage\n- ...",
				"added": 1516908153
			}
		],
		"3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 273,
				"body": "1 и 4. ZeroNet нет каких-то выделенных серверов. Поэтому весь контент доступен всем юзерам. Отсюда следует  что почта при хранении должна быть зашифрована. Ну и каждый хранит почту всех.\n\n2 и 3 — нет.\n\n5 — год назад работала, потом не использовал. Но ломаться там нечему.\n\n6 — как и всюду в ZN. При нормальном соединении мгновенно. В случае каких-то глюков с соединением может вообще не дойти.",
				"added": 1517461461
			},
			{
				"comment_id": 274,
				"body": "> [promusik](#comment_10_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Вот это жесть конечно. \n\nТак в ZN по этому принципу всё работает :) Смягчают ситуацию только разделение на легко клонируемые зайты и возможность хранить опциональные файлы, что грузятся по запросу.\n\nИ у ZN всё ещё не так плохо, доля бы потому, что есть деление на зайты. У того же Биткоина каждый узел сети хранит все операции за всю историю сети. Сейчас это уже под 200 гигабайт :)",
				"added": 1517477703
			},
			{
				"comment_id": 279,
				"body": "> [tokyomewmew](#comment_44_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Кстати, а на такой хуйне можно же делать чаты на несколько человек? Может кто прокинет идею разработчикам?\n\nА чем обычные Zero-чаты не катят? Или хочется именно шифрованных?\n\nhttp://127.0.0.1:43110/1E6iPAg5TRRKRKd2sr2fzhuvkH58DXiDeY/",
				"added": 1517643672
			},
			{
				"comment_id": 282,
				"body": "> [geekless](#comment_10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Но устроить этой почте DoS — как два пальца.\n\nНо можно клонировать и пользоваться своей копией :)\n\n> Пишите там на мой ник, затестим хоть, как оно\n\nНаписал.\n\n...\n\nИнтересный баг. Помню, была пара тестовых писем. И в Sent показывается, что 3кБ занято. Однако, и в Inbox, и в Sent было пусто, пока тебе письмо не отправил. Теперь есть одно твоё письмо. Куда-то старые письма делись :)",
				"added": 1518374714
			}
		],
		"13_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 275,
				"body": "Если атеист, то подумай о главной цели существования вида — выживании. Займись хотя бы размножением :)\n\nА то 4.3 млрд лет эволюции в твоём случае коту под хвост.",
				"added": 1517509674
			},
			{
				"comment_id": 276,
				"body": "> [gobotheelephant](#comment_4_1DinguqcWEJd9T8FBJ9tMExfz6DHcZZYb9): Вернувшись взад, я бы выбирал что-то из древних профессий, вроде врачей. Нет этих комплексов \"двигателя прогресса\".\n\nНу-ка, протестируем ZeroLSTN: http://127.0.0.1:43110/ZeroLSTN.bit/merged-ZeroLSTN/1P8jb5ykowNukmBATR3VWe7JxgLuSs6tqo/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/04-1517562712002.mp3",
				"added": 1517563744
			},
			{
				"comment_id": 277,
				"body": "> [l0bster](#comment_5_1FcMuJwqkSPP7C3gnNLugZGwwSGpugX2rA): Server errorErr: Exception: Merger site (ZeroLSTN) does not have permission for merged site: 1P8jb5ykowNukmBATR3VWe7JxgLuSs6tqo (None) in UiServer.py line 95 > UiRequest.py line 130 > MutePlugin.py line 138 > UiRequest.py line 272 > UiRequestPlugin.py line 22 > TranslateSitePlugin.py line 25 > FilePackPlugin.py line 67 > UiRequest.py line 437 > MergerSitePlugin.py line 238 > MergerSitePlugin.py line 40\n\nНу так надо же ZeroLSTN загрузить :)\n\nhttp://127.0.0.1:43110/ZeroLSTN.bit/?/\n\nА, вероятно, ещё нужно загрузить жанр:\n\nhttp://127.0.0.1:43110/1P8jb5ykowNukmBATR3VWe7JxgLuSs6tqo/\n\n(да, сыра ещё технология для использования без подготовки)",
				"added": 1517564069
			},
			{
				"comment_id": 278,
				"body": "> [caryoscelus](#comment_3_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А давать Универсальный Абстрактный Совет Самоубийцам незнакомому человеку я бы всё же не стал.\n\nТут не нужен универсальный ответ. Тут просто поговорить нужно.",
				"added": 1517583967
			}
		],
		"4_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 283,
				"body": "> [visty](#comment_1_12UQtEiQuzX6dt2EdhssDpWxcsqaWhNYNG): Реддит закрыли\n\nКак закрыли? Куда закрыли? У меня открывается.",
				"added": 1518607041
			}
		],
		"1_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 292,
				"body": "Нереально. Тут какой-то паршивенький Твистер уже гигабайт блокчейна весит. А если 140 байт сообщения поменять на хотя бы 140Мбай видео? А если на 15Гб? :)\n\nВ Блокчейне можно хранить только метаданные, для хранения и транспорта видео нужны другие технологии.",
				"added": 1519270576
			},
			{
				"comment_id": 293,
				"body": "> [numberedpwnz2](#comment_1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT): хм, есть децентрализованный аналог youtube - viuly\n\nЧудес не бывает:\n\n>Платформа видео обмена Viuly на базе блокчейн  полностью децентрализована и не имеет единой точки отказа. Платформа построена на протоколе IPFS, который позволяет хранить файлы в распределенной сети без общего центра управления.\n\n// https://freedman.club/viuly-zapuskaet-decentralizovannuyu-platformu-obmena-video/\n\nТо есть, как я полагаю, метаданные распространяются в блокчейне, а вот сами видео — через IPFS.\n\nИ, кстати:\n\n>Пользователи Viuly пользуются свободами децентрализации — нулевой цензурой, нулевым ограничением контента, нулевой блокировкой видео. Если контент помечен как потенциальное нарушение общих стандартов сообществом, предупреждение отправляется модераторам, которые случайным образом выбираются среди пользователей с самыми высокими рейтингами на платформе. Если нарушение подтверждено, видео будет удалено, а рейтинг пользователя будет понижен.\n\nЭто автоматически однополярно политизирует систему :) Как только какая-то фракция получит перевес, противоположная быстро будет выпилена.",
				"added": 1519327760
			},
			{
				"comment_id": 294,
				"body": "И вдогонку. Посмотрел сейчас и так понял, что работать можно только через их сайт? Тогда, как и с steemit/golos это на практике не децентрализованная система, пусть она и является распределённой :) Всё будут решать владельцы центрального узла.",
				"added": 1519327958
			}
		],
		"1_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 296,
				"body": "В ZeroNet не используются приватные куки. Тут есть просто прямое использование приватных данных, если нужно. Это же не только Web-клиент, это и заточенный сервер.\n\nНо сама суть ZN, всё же, в открытости информации. Хотя приватные решения есть (та же ZeroMail), но это скорее исключение. Всё опубликованное тут доступно всем.",
				"added": 1519740423
			},
			{
				"comment_id": 300,
				"body": "> [ranx](#comment_1_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr): Ясненько, спасибо. Тут уже DHT реализовали?\n\nНе знаю, на какой конкретно технологии тут p2p реализован, так глубоко не интересовался. Знаю только что не блокчейн и слава Богу ;)",
				"added": 1519759774
			},
			{
				"comment_id": 319,
				"body": "> [architektor](#comment_1_1PLvh33PvqiFXqHdU3Jv5kbPTjLsQ1jxJz): Почему слава богу? Что такого в блокчейн?\n\nТребование связности — это не единственная проблема. Ещё плохо то, что каждый член сети должен содержать весь контент сети.",
				"added": 1521784690
			}
		],
		"1_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": [
			{
				"comment_id": 297,
				"body": "> [jzt](#comment_7_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): Ну что-ж, это на самом деле круто, получается  Zeronet можно без особых усилий публиковать статические сайтики\n\nДа, простая публикация статических сайтов не требует никаких хитростей. Конечно, если там нет каких-то заморочек с путями.",
				"added": 1519740530
			},
			{
				"comment_id": 298,
				"body": "> [jzt](#comment_11_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): А получается открыть ссылку из первого сообщения?\n\nНе вижу в первом сообщении ссылок. А так — всё открылось и загрузилось. В консоли браузера ошибок нет.",
				"added": 1519740808
			},
			{
				"comment_id": 299,
				"body": "> [jzt](#comment_12_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): Ну тоесть в первом комменте, http://127.0.0.1:43110/1Dwz9PPSSDGxJE3HitpjUjpijHqW1tGtAC/\n\nДа, я про неё и пишу — всё ок.",
				"added": 1519740878
			}
		],
		"1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT": [
			{
				"comment_id": 301,
				"body": "Я и более 40 тыс. пиров видел :)\n\nВот тут есть скрины с 17 тыс, но это не максимум:\n\nhttp://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:26:География+ZeroNet\n\nВот тут пиров ещё меньше, но тоже по теме и с новой картой:\n\nhttp://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:37:География+ZeroNet",
				"added": 1519922830
			},
			{
				"comment_id": 314,
				"body": "> [sgushennayavoda](#comment_3_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Да и пиры тут считаются, похоже, \"с накоплением\", т.е. \"все за весь период\", а не \"активные\"...\n\nПо-моему, их число может уменьшаться без перезагрузки сервера. Хотя не ручаюсь, хорошо бы этот момент отследить.",
				"added": 1521707787
			}
		],
		"2_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 303,
				"body": "> [sgushennayavoda](#comment_4_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Тут тебе не нужно иметь все зайты у себя, а только интересные тебе. Так что описанный предел сильно отодвигается.\n\nМожно вообще в локалке сидеть и в большой Интернет не выходить :)\n\n...\n\nПроблемы могут быть только у конкретных зайтов, если их очень многие начнут использовать, типа ZeroMe или «официальных» ZeroTalk/ZeroMail и т.п.",
				"added": 1520254272
			}
		],
		"3_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": [
			{
				"comment_id": 305,
				"body": "> [ktotut](#comment_6_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): ZeroUp не позволяет мелкие файлы грузить, скотина эдакая...\n\nСделай клон с уменьшенными ограничениями :)\n\nМожешь моим воспользоваться: http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/",
				"added": 1520310662
			},
			{
				"comment_id": 309,
				"body": "> [dude](#comment_45_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): А есть способ развернуть комменты? Чтоб свежие снизу, естественным порядком, а не как щас задом наперед?\n\nНадо перепиливать ZeroTalk, вводя разбивку на страницах, как это принято на традиционных форумах. Потому что сейчас идёт AJAX-подгрузка более старых комментов, когда долистаешь вниз.\n\nТехнически с переделкой проблем нет, но на практике ломает. И, конечно, если это решение не протолкнуть  в апстрим, то работать будет только на использующих альтернативный код зайтах.",
				"added": 1520441104
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 308,
				"body": "> [anotherneko](#comment_19_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Собственная инициатива выглядит куда более веротной.\n\nНо и внешний акт тоже исключать нельзя. На американских форумах я уже сталкиваюсь с мнением «*Россию нужно отключить от Интернета*».",
				"added": 1520440965
			},
			{
				"comment_id": 310,
				"body": "> [anotherneko](#comment_20_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Ну до настоящего времени прецедентов, чтобы какую-то страну отключили от всего интернета без ее желания, не было, только собственные инициативы самих стран.\n\nВ мире регулярно происходят события, которых до того времени не было.",
				"added": 1520463236
			},
			{
				"comment_id": 337,
				"body": "> [testuserat2104](#comment_8_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY): FidoNet не пытались контролировать\n\nFIDO, как раз, по своей сути очень легко контролируется. Жёсткая иерархия, фиксированная маршрутизация, открытый контент, все участники строго под реальными именами. Это мечта для любых служб безопасности. Они должны были ФИДО холить, лелеять и развивать :D",
				"added": 1524372260
			},
			{
				"comment_id": 338,
				"body": "Кстати, поздравляю. Google.com забанен :)",
				"added": 1524372291
			}
		],
		"1_1HV141A2vZRjYcjAhoGhnmsdD9mfHAAr5e": [
			{
				"comment_id": 311,
				"body": "> [jzt](#comment_26_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): Зачем это здесь? И так всеь интернет политотой засрали...\n\nТот случай, когда троллей лучше не кормить. Пусть набросят и утихнут.",
				"added": 1520942511
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 312,
				"body": "> [pozya](#comment_23_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Готов спорить, что 99% местных пользователей - в той или иной степени юниксоиды.\n\nЯ думаю, заметно меньше :) Хотя, вероятно, всё же, большинство.",
				"added": 1521688873
			},
			{
				"comment_id": 313,
				"body": "> [pozya](#comment_25_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Судя по локальной переписке - их 100% :D\n\n«Опрос, проведённый на нашем сайте…» © :)\n\nВот, не то, чтобы доля пользователей, но корреляция должна быть:\n\n[What OS would you recommend? @ ZeroPolls](/ZeroPolls.bit/?Poll:1-1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe)",
				"added": 1521693193
			},
			{
				"comment_id": 317,
				"body": "> [pozya](#comment_28_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Так себе опрос. Нету бздей и возможности выбрать более одного варианта.\n\nНу, понять, что тут меньше, чем 99% юниксоидов — вполне можно :)",
				"added": 1521712237
			},
			{
				"comment_id": 327,
				"body": "> [azz](#comment_40_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Мы говорим о разны вещах\n\nНа самом деле, у вас ответ одинаковый будет :) Разные задачи требуют разных ОС или дистрибутивов. Тем более, что в мире Linux сравнительные характеристики дистрибутивов меняются даже под схожими задачами. Так я с 1997 по 2003 предпочитал RedHat, с 2004 по 2011 Gentoo, с 2012 — Ubuntu.",
				"added": 1522511792
			},
			{
				"comment_id": 418,
				"body": "Раз тему подняли, я недавно писал про свой [первый опыт с Linux](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:13:Первый+Linux) :)",
				"added": 1536745117
			},
			{
				"comment_id": 471,
				"body": "> [cocaineninja](#comment_2_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY): Я сильно подозреваю что кроме линуксоидов тут никого и нет.\n\nЯ даже не уверен на 100%, что линуксоидов тут большинство :)",
				"added": 1545192691
			},
			{
				"comment_id": 472,
				"body": "> [kotbezzabot](#comment_1_1JYTJbkJjERFUC2ngeEk2tYBqKBdci5g77): Но неподходящее железо не очень дружит с альтернативными массовой системами.\n\nСамое смешное, что в наше время часто и массово бывает и обратное. У меня два ноута есть, на которых Windows отвратительно работает (тормозит, глючит Wi-Fi) и сканер, под который в Windows нет драйверов, начиная с XP (Win2K последние, выше — не совместимы), но под Linux драйвера все эти годы «из коробки» :)\n\nТак и приходится на одних машинах сидеть под Linux, на других — под Windows. Не потому что какая-то система лучше, а потому что она на той машине лучше работает :)",
				"added": 1545388483
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 315,
				"body": "> [azz](#comment_6_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Созданием аккаунта соцсети в ZeroNET должно быть создание (специального) зайта иначе соцсеть станеть слишком большой\n\nНе понял мысль. Ну и ZeroNet не может быть «слишком большой» — никто не заставляет грузить все зайты сети :)",
				"added": 1521707843
			}
		],
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 316,
				"body": "Стоимость акций просела заметно, но это потому что биржевики люди психанутые :)\n\nНе смотря на акции, типа «удалим аккаунты с Facebook!» — это очень незначительное явление. Подавляющее большинство пользователей FB завтра уже ни про что и не вспомнить. И ничего предпринимать, конечно, не будет.",
				"added": 1521708025
			}
		],
		"1_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 318,
				"body": "> Кто им пользуется и в каких целях?\n\nЯ. В основном в Web'е, хотя есть и по мелочи, типа компиляции прошивок для ESP8266\n\n> Какие возможности используете?\n\nМ... Это как? :) Docker есть Docker — система контейнеризации. Какие там ещё есть возможности?\n\n> Как долго вы уже им пользуетесь и почему он вас заинтересовал?\n\nГде-то с 2014-го. Заинтересовал как альтернатива LXC, в которой есть готовые типовые решения.\n\n> Пользовались вы раньше Vagrant и можете ли вы сравнить проблемы?\n\nНет.\n\n> На сколько серверов вы максимально разворачивали один образ?\n\nЯ использую готовые образы, свои — нет.\n\n> Сколько контейнеров максимально приходилось разворачивать на одной машине?\n\nШтук 20, наверное.\n\n> Храните ли вы отдельно такие вещи как кеш, логи, зависимости проекта (например папка vendor, node_modules)?\n\nЗависит от потребности. Базы данных, логи httpd, весь собственный контент (т.к., как писал выше, использую только готовые образы) — это всё на хосте. Всё, что не нужно — в контейнере.",
				"added": 1521723131
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 325,
				"body": "> [geekless](#comment_40_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): К сожалению, у всех децентрализованных сетей существует точка отказа в виде бутстрап-узла.\n\nЭто проблема нового юзера. Также, как проблема блокировки офсайта, например. В Китае заблокирован узел zeronet.io, соответственно, народу приходится искать для скачивания другое место. Точно также и бустрапы могут быть там указаны.\n\nА вот уже на работе имеющейся сети это всё не скажется.",
				"added": 1522422286
			}
		],
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": [
			{
				"comment_id": 331,
				"body": "> [security13](#comment_1_12xf7EvMBWreUSm3Y5tmYXj72SHHkWet1C): Вот есть такая онлайн-оффлайн штука интересная, недавно нашёл: https://www.scuttlebutt.nz/\n\nhttp://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1_1BkgWBWWN9CoXNeEmyyuagid7roJruBVjz/Scuttlebutt",
				"added": 1524290488
			},
			{
				"comment_id": 332,
				"body": "> [security13](#comment_2_12xf7EvMBWreUSm3Y5tmYXj72SHHkWet1C): Ах да, и ещё P2P браузер прикольный: https://beakerbrowser.com/\n\nПока он только для статики, то ничем не лучше банальных IPFS и любого простого браузера.\n\nВ результате по p2p-браузерам народу вообще не интересно :) — http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:25_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/p2p+Maelstrom+Beaker",
				"added": 1524290573
			},
			{
				"comment_id": 349,
				"body": "> [deepstrelok](#comment_2_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): freenet же\n\nВо, набросал :) — http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1524909406_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/FreeNet",
				"added": 1524909465
			}
		],
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": [
			{
				"comment_id": 335,
				"body": "> Какие средства лучше заготовить на случай введения в России цензуры aka Китай? \n\nZeroNet :) VPN ему не нужен. Опционально — RetroShare и SSB Patchwork.\n\n> А вдруг КНДР?\n\nТогда всё равно ZeroNet, но общение будет только внутри страны :)",
				"added": 1524329368
			},
			{
				"comment_id": 336,
				"body": "> Неужели ZeroNet не возможно заблокировать?\n\nВсё возможно. Но не всё можно просто.\n\n> Каким образом он находит первых пиров?\n\nВот с этим, как раз, проблема, рождённая Телеграмом :) Гугл закрывает domain fronting, а он использовался активно для стартовых трекеров ZN. Nofish сейчас экспериментирует с meek: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:129#Comments — не мытьём, так катаньем решат, надеюсь :)",
				"added": 1524334790
			},
			{
				"comment_id": 339,
				"body": "> [strelok](#comment_2_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): В варианте чебурашки обход блокировки только через сторонний канал связи же.\n\nВнутри сети — не проблема. Там же сеть огораживается, а не каждый юзер.\n\n> Спутниковые интернеты стоят мягко говоря дохуя.\n\nУже давно нет:\n\nhttp://www.starblazer.ru/dvuhstoronnij_sputnikovyj_internet/\n\nhttp://www.sl.spacelink.ru/o_sputnike/tarif2.php\n\nи т.п.\n\nАппаратура, конечно, не дешёвая, ценники от 20к начинаются и за 100к заканчиваются, но трафик потом относительно гуманный, порядка 3-5 тыс. в месяц за мегабит. Хотя, сейчас подумалось, это может только я считаю их гуманными, т.к. начинал в 1990-х через модем, выплачивая по $50/мес на 14.4 кбит/с, когда однушку в Москве можно было за $40/мес. снимать :D",
				"added": 1524377244
			},
			{
				"comment_id": 340,
				"body": "> [anotherneko](#comment_55_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Кстати в случае ZN в перспективе будет достаточно хотябы одного шлюза чтобы ретранслировать сообщения между внешней и внутренней сетями.\n\nВ FIDO когда-то междугородняя и даже международная связь так и работала. Хотя межгород стоил очень приличных денег, а международная связь была вообще чем-то из области фантастики и киберпанка :)",
				"added": 1524387209
			},
			{
				"comment_id": 345,
				"body": "> [nekoneko](#comment_1_1KcdUW53M98k8x41XvvDJ1s8KkgJ9g951): Просто переведите zeronet на i2pТогда будет все заебись\n\nZeroNet и так без проблем работает :) Даже без Tor. «Шо ему сделается-то?» ©",
				"added": 1524825797
			},
			{
				"comment_id": 346,
				"body": "> [strelok](#comment_8_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): А нафига, собственно?\n\nНу, типа, шифрование и анонимизация в i2p лучше, чем в tor, кто шифруется, тому актуально :D Ещё не знаю, как у i2p в сравнении с tor в области детекта по DPI. Если/когда будут банить через DPI, м.б. более легко определяемые протоколы лягут. Но пока такого и в Китае нет.",
				"added": 1524847424
			}
		],
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": [
			{
				"comment_id": 341,
				"body": "> [strelok](#comment_5_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Ну, гуглу обрезали 118 адресов из 915 известных. Часть из них капча, часть - гугл плей. Некоторые жалуются.\n\nGoogle Play непосредственно, вроде, не цепляли. Другое дело, что забанили некоторую статику, типа s.ytimg.ru и забанили google.com, через который идёт вся авторизация, из-за чего накрылась куча сервисов. Как конкретно забанили Рекапчу не могу сказать, у меня прямо сейчас Билайн всё разбанил, в т.ч. google.com, но утром уже такое было, я обрадовался, а потом снова забанили :)",
				"added": 1524489514
			},
			{
				"comment_id": 343,
				"body": "> [rasart](#comment_1_1CAuG7huwvtXEp1tdicwHfpcEb3NcPC2PG): Го сливать ютуб сюда\n\nЯ сегодня слил свои плейлисты/лайки. Вышло около 450 файлов на 26Гб. Надо теперь думать, как это в приличном виде в ZN положить :)",
				"added": 1524682318
			},
			{
				"comment_id": 344,
				"body": "> [rasart](#comment_2_1CAuG7huwvtXEp1tdicwHfpcEb3NcPC2PG): Как лучше слить с ютуба свои плейлисты?\n\n[youtube-dl](https://rg3.github.io/youtube-dl/) умеет целиком качать страницу юзера со всеми плейлистами. Т.е. у меня это было просто:\n\n```\nyoutube-dl --ignore-errors \\\n    --write-info-json \\\n    --write-annotations \\\n    --write-thumbnail \\\n    -f 'bestvideo[ext=mp4]+bestaudio[ext=m4a]/bestvideo+bestaudio' --merge-output-format mp4 \\\n    https://www.youtube.com/user/Balancer73/playlists\n```\n\nВ опциях стоит качать все метаданные в XML и JSON + картинки, чтобы можно было автоматизировать потом выкладывание, а хранить всё в mp4 (в максимальном доступном качестве), чтобы в Web потом без переконвертации класть.\n\nСобственно, `youtube-dl` и сделали задачу простой. Когда-то я для этого кривые скрипты сам писал :)",
				"added": 1524684231
			}
		],
		"1_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY": [
			{
				"comment_id": 347,
				"body": "Не знаю, зашифрован ли открытый трафик, но какой смысл его шифровать? В ZN же все данные по самой сути открытые и отдаются любому запрашивающему. ZeroMail шифруется ещё до передачи.",
				"added": 1524879973
			},
			{
				"comment_id": 348,
				"body": "> [neebrow](#comment_5_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY): Смысл на самом деле есть, особенно учитывая российские реалии, где трафик каждого скоро будут снифить.\n\nА в таких реалиях всем, один фиг, придётся на Tor переключаться :)\n\n> Понятное дело, что тор решает эту проблему полностью, защищая как от пассивных, так и от активных атак, но и шифрование обычных зеронетовских соединений не помешало бы.\n\nМасло масляное же :)",
				"added": 1524903144
			},
			{
				"comment_id": 350,
				"body": "> [swin](#comment_2_1mGVkvn1kU9drvETUm8orvoBRppv4mNeQ): Можно как-то в шиндовсе отключить запуск браузера при старте зеронета?\n\nОпция командной строки `--open_browser`.\n\nПод Windows командная строка игнорируется, но те же параметры можно указать в `zeronet.conf`, лежащий там же, где `ZeroNet.exe`. Формат у него вида:\n```\n[global]\noptional_limit = 5\nui_port = 43111\ntor = always\n```\n\nГде параметры — те же самые, что в командной строке. Теоретически должно быть так:\n\n```\n[global]\nopen_browser = None\n```\nНо на практике почему-то не работает. То ли сломано, то ли я что-то не так делаю.",
				"added": 1525158791
			},
			{
				"comment_id": 372,
				"body": "> [machine799](#comment_1_13mgXgDgHu7hBZGF85DfFprRgaPteNF2kP): Ну и что это ? Это что за сервис Зачем он нужен Какой смысл во всем этом ?\n\nТелепаты в отпускУ.",
				"added": 1525926442
			},
			{
				"comment_id": 394,
				"body": "> [nicolaith](#comment_8_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): а можно в своём ZeroBlogе как-то отключить комментарии читателей?\n\nКонечно. В `data/<ZeroBlogID>/data/users/content.json`. Ставишь там в `permissions` всем 0/false — и готово.",
				"added": 1531302489
			},
			{
				"comment_id": 395,
				"body": "> [mantisss](#comment_2_17CpAQaWYAB8pWEwM1GGXSnrwVfYfVezJF): А на счёт постоянности - только до следующего посещения, вроде.\n\nЕсли боишься забыть и снова зайти, то при удалении можно ещё и забанить. Тогда снова загрузить и открыть сайт не получится, пока не разбанишь :)",
				"added": 1531320526
			},
			{
				"comment_id": 396,
				"body": "> [mantisss](#comment_1_17CpAQaWYAB8pWEwM1GGXSnrwVfYfVezJF): В какой папке хранятся скачанные с Zeronet'а сайты?\n\nВ подкаталоге `data`.",
				"added": 1531320545
			},
			{
				"comment_id": 397,
				"body": "> [nicolaith](#comment_9_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): Спасибо. А почитать об этом структурированно где-то можно? Или надо в исходниках рыться?\n\nПро исходники не знаю, но там по формату конфига всё прозрачно же :)\n```json\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 10000000\n   },\n   \"bitid/.*@zeroid.bit\": {\"max_size\": 400000},\n   \"bitmsg/.*@zeroid.bit\": {\"max_size\": 150000}\n  },\n  \"permissions\": {\n   \"banexample@zeroid.bit\": false,\n   \"nofish@zeroid.bit\": {\"max_size\": 200000}\n  }\n\n```",
				"added": 1531321954
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 351,
				"body": "Реально. Всё, что в ZN нужно (грубо, в рамках нынешних приложений), это передавать юзеровские `data/users/.../*.json`, а это можно делать разными методами, в т.ч. и флоппинетом.",
				"added": 1525171192
			},
			{
				"comment_id": 352,
				"body": "> [strelok](#comment_9_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Не флоппинет, а уже флешконет скорее. Дискеты сейчас хрен найдешь уже, даже в магазинах на складах уже ничего нет.\n\nЭто уже имя нарицательное, отражающее не конкретную технологию носителей, а факт переноса информации на материальных носителях в офлайне ;)",
				"added": 1525249037
			},
			{
				"comment_id": 353,
				"body": "> [strelok](#comment_16_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): С 50% вероятностью в ближайшие года 3-4 вся эта пиздобратия вместе с остатками денег испарится куда-нибудь.\n\nЯ слышу это уже лет 25 :)",
				"added": 1525252632
			},
			{
				"comment_id": 354,
				"body": "> [calmaquesse](#comment_24_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Странно. У меня, по крайней мере, Вай-Фай сбоит при её работе.\n\n- Частота микроволновок — 2.450 ГГц (­± проценты)\n- Частоты Wi-Fi 2.400 — 2.4835 ГГц\n\nТ.е. диапазоны перекрываются. Но исправная микроволновка не пропускает излучение наружу :)\n\nА вот частоты спутникового Интернета порядка 10-14ГГц. И в этом диапазоне излучают мало. Но мощности сигнала малые (единицы Вт), антенна узко направленная, так что возможность пеленгации по боковым лепесткам я оценить не могу, знаний не хватит :)\n\nВообще, у меня на форуме был большой срач на этот счёт: http://www.tanzpol.org/2018/04/t103117--tsifrovoe-soprotivlenie-ili-dikij-zapad.html — там было много и про пеленгацию, и про связанный риск и т.п. :)",
				"added": 1525267271
			},
			{
				"comment_id": 355,
				"body": "> [strellok](#comment_10_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Ради чего человек будет рисковать свободой, даже при условии, что возможность засечь невелика?\n\nТаких везде достаточно много. А для того, чтобы шла связь в том же ZeroNet достаточно единичных гейтов в «большой внешний Интернет» :)",
				"added": 1525267337
			},
			{
				"comment_id": 356,
				"body": "> [cdoki](#comment_9_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Не стоит воспринимать локалку проводную как что-то нерушимое, она всё-таки провайдерами обеспечивается\n\nТут просто важно контекст учитывать. Либо у нас внутри условно открытая сеть с барьером вокруг, типа Китая, и тогда достаточно единичных гейтов, либо у нас жесточайший контроль коммуникаций и тогда проблемы свободного Интернета будут наименьшей из проблем :) Во втором случае страну ждёт гарантированное катастрофическое отставание от остального мира и политический коллапс.",
				"added": 1525269682
			},
			{
				"comment_id": 357,
				"body": "> [cdoki](#comment_11_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Я раньше верил, что у Путина голоса фиктивные, что власть снимут раньше, чем она успеет ввернуть тотальный контроль. У меня в голове не укладывалось, что люди реально могут это поддерживать\n\nЯ, вот, поддерживаю :) Ты реально считаешь, что у нас есть политики, при которых станет лучше? Можно имена? :)\n\n…\n\nВ России вся эта фигня творится все 1000 лет её истории. Последние 15 лет — далеко не худшие в её истории, а последние 10 лет — прямо лучшие. И, не смотря на перекосы, типа идиотизма с Роскомпозором, тренд в целом всё равно положительный. А когда у нас в России было без идиотизма?",
				"added": 1525269871
			},
			{
				"comment_id": 358,
				"body": "> [strellok](#comment_14_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg):  В России ни у кого нет ни политической программы, ни идеологии, ни видения будущего, ради которых люди готовы были реально оказывать неповиновение государству и нести ущерб.\n\nЧтобы такое было, народу должно быть реально ОЧЕНЬ хреново. Как было в 1917-м или неоднократно ранее. Сейчас же средний обыватель живёт весьма комфортно. Особенно, если он помнит всю предыдущую историю страны с момента образования и по 1990-е годы и может посмотреть на соседние страны, где к власти пришли те, кто «оказывал неповиновение и был готов нести ущерб».",
				"added": 1525270097
			},
			{
				"comment_id": 359,
				"body": "> [calmaquesse](#comment_32_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Флоппинет это такая себе замена, полноценную связь между тысячами машин он не выдержит.\n> Ну а про проводную локалку даже комментировать не буду, это на 20-30 человек максимум.\n\nВот «флоппинет» прекрасно справляется с задачей связывания таких локалок :) Мы это в середине 1990-х проходили уже :)",
				"added": 1525271886
			},
			{
				"comment_id": 360,
				"body": "> [cdoki](#comment_12_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK): Вы не верите, что может быть лучше? А вот я верю)\n\nЯ верю, что может быть лучше. Я знаю, что может быть хуже. И ещё я знаю, что принцессы не могут не какать. \n\n> И я не считаю положительным тренд, когда школам, например, не выплачивают денег, совсем - школа зарабатывает на свои нужды благодаря платному дополнительному образованию.\n\nОк. А какая из имеющихся сейчас кандидатур политиков обеспечит развитие российского образование? Не на словах «за всё хорошее против всего плохого», а на практике?\n\n> Насчёт альтернатив Путину - дело не в нём, конечно, дело в принципе во власти. В том, что наша страна оказалась на задворках - виновата не страна и задворки\n\nТак почему Россия 1000 лет своей истории либо остаётся на задворках, либо движется вперёд с жёстким и/или жестоким лидером? Можешь назвать период в истории, когда Россия лидировала будучи свободной страной?\n\n> у страны как раз огромный ресурсный и умственный потенциал, который почему-то не реализуется\n\nКогда проблема существует в течении всей многовековой истории страны, то дело однозначно не в лидерах.",
				"added": 1525275725
			},
			{
				"comment_id": 361,
				"body": "> [strelok](#comment_21_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Путин пожалуй действительно худшее что случалось с Россией, раньше хотя бы пытались изображать какие то приличия.\n\nВот, прямо, в 1917-м, 1937-м или 1993-м в России было лучше, чем сейчас? :) Ну смешно же, честное слово.\n\nУровень жизни в России сейчас самый высокий за всю историю её существования. Мы несколько лет, как обошли достижения СССР на пике его социальных достижений. Конечно, некорректно сравнивать РФ-2018 с СССР-1988, так как СССР не стоял бы на месте и в 2018-м году представлял бы собой что-то намного более развитое, чем 30 лет назад. Но история не знает сослагательного наклонения. И я бы, конечно, с удовольствем посмотрел бы на СССР-2018. Но вот в СССР-1988 больше не хочу :) 10 лет назад ещё хотел, сейчас — нет. Потому что уровень жизни стал реально выше.",
				"added": 1525276032
			},
			{
				"comment_id": 362,
				"body": "> [cdoki](#comment_13_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK):  По-моему отсутствие таких кандидатур вызывает определённые вопросы. Ну не верю я, что на 190млн человек нет никого, кто хотел бы продвигать образование. Пускают его к власти или он сидит где-нибудь в областях - другой вопрос.\n\nТут несколько моментов.\n\n- Толковых руководителей у нас достаточно. Не вся верхушка состоит из Жаровых и Мизулиных. Есть такие, как Кириенко или Шойгу. Проблема в том, что все такие специалисты или итак находятся у власти, или вообще в политику не лезут. А вот у оппозиции людей такого уровня нет вообще.\n\n- Есть те, кто реально заботится об образовании. Есть рост финансирования образования год от года. Я своими глазами вижу, как менялось состояние школ в последние 40 лет. По уровню финансирования и поддержки школы сегодня обошли советский уровень. И даже зарплаты учителей при пересчёте на советские деньги по курсу ~1:150 сегодня получаются в районе 70 (минимальные) - 120 (средние по опросам) - 220 (средние официальные) советских рублей. Что очень близко к советским.\n\n- Не смотря на всю, часто справедливую критику, наше образование всё равно является одним из лучших в мире. Если сравнивать нашу среднюю школу со средней школой в тех же США, то результат не в их пользу.\n\n- Образование мало что даёт без идеологии. А вот тут у нас, действительно, большой прокол. Советскую идеологию разрушили. Новую не построили. Вариант «учиться, чтобы потом жить по-кайфу» в школьные годы не прокатывает. Да и в результате строится та же структура власти, что мы и наблюдаем. Труд учителя совершенно не престижен. Средств воздействия на трудных детей нет. А на что всё это менять — х.з.",
				"added": 1525295222
			}
		],
		"1_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": [
			{
				"comment_id": 363,
				"body": "> [strelok](#comment_24_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Высокая зарплата есть \"по больнице\" в показателях\n\nИменно поэтому я привёл _несколько_ чисел :) «По больнице» мы вообще «порвали СССР». И поэтому у меня это последнее число в ряду.\n\n> потому что у директора и завучей зарплата ~120к, а у учителей больше 20к бааальшая редкость.\n\n20к — это большая сумма в пересчёте на советские бабки. Около 130 рублей. В СССР столько получал учитель со стажем.\n\n> В регионах учителя реально работаю за копейки - у меня среди учителей/преподавателей довольно много знакомств.\n\nТак и у меня тоже, почему я эту тему и затронул :)",
				"added": 1525327574
			},
			{
				"comment_id": 364,
				"body": "> [strelok](#comment_26_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): надо не царька менять а всю систему целиком.\n\nЯ боюсь, что проблема тут глубже, чем в какой-то абстрактной системе. Как я писал в исходной теме, за 1000 лет систему меняли не раз. Проблема остаётся неизменной.",
				"added": 1525327645
			},
			{
				"comment_id": 365,
				"body": "> [anonymous005](#comment_4_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV): Картиночки только на форумах balancer-а работают. А здесь код движка древний.\n\nКартинки не работают не в древнем ZeroTalk, а и в штатном. Они там специально вырублены, чтобы не создавать деанонимизацию внешними автоматическими ссылками. Это я просто вернул эту фишку Markdown, так как кто всерьёз занимается анонимностью, итак отрубает кроссдоменные картинки, а остальные и так деанонимизируются в любом ЗероБлоге или в любом кастомном коде ZeroTalk :)",
				"added": 1525334785
			},
			{
				"comment_id": 366,
				"body": "> [anonymous005](#comment_5_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV): С другой стороны, для хомячков правильно отрубили.\n\nБессмысленно. Хомячки не будут же пастись на одном только официальном ZeroTalk :)",
				"added": 1525335032
			}
		],
		"3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 367,
				"body": "Хостинга в смысле галереи удобной до сих пор нет. Ближе всего к этому понятию Millchan, но он ещё очень-очень крив.\n\nХостинг в смысле расположения картинок для форумов (я так понял, вопрос для [этого топика](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1525603678_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv/+2) сторонний в общем случае быть не может, так как ZN довольно давно не грузит зайты по ссылке автоматически. Нужно загружать явным образом, соответственно, нужно предупреждать пользователей, а то там у других стоит значок ошибочной картинки :)\n\nЯ для таких целей использую IPFS. Если влом самому делать, можно закинуть картинку на http://ipfs.pics, а потом вставить её через штатный gateway.ipfs.io",
				"added": 1525604766
			},
			{
				"comment_id": 368,
				"body": "> [geekless](#comment_50_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А у пользователя не будет настроен выход в клирнетовский web...\n\n`gateway.ipfs.io` — это такой штатный маркер, как `127.0.0.1:43110` :) Кто шугается выхода в клирнет, ставят IPFS-плагин и он меняет эти ссылки на `127.0.0.1:8080` или другой адрес локального IPFS-гейта :)\n\nНапример, возможно, так (не проверял): https://chrome.google.com/webstore/detail/ipfs-companion/nibjojkomfdiaoajekhjakgkdhaomnch",
				"added": 1525605861
			},
			{
				"comment_id": 369,
				"body": "Вот, расписал: [IPFS в ZeroNet на примере хостинга картинок](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:46:IPFS+в+ZeroNet+на+примере+хостинга+картинок)",
				"added": 1525607728
			},
			{
				"comment_id": 370,
				"body": "> [geekless](#comment_51_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Проблема, что обычно никак не видно, что должна быть картинка.\n\nВот, теперь видно :) — http://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/?Topic:1524295020_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/#comment_10_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
				"added": 1525615517
			},
			{
				"comment_id": 371,
				"body": "> [geekless](#comment_52_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Прикольно. Туда можно любой контент так подставить?\n\nНу, это штатный в HTML механизм замены картинки, если отсутствует на аварийную :)",
				"added": 1525615849
			}
		],
		"3_14QcoQB7PsuREm2aD9RK3KtrfxPv73qx6Z": [
			{
				"comment_id": 373,
				"body": "ZeroNet так устроен, что работоспособность приложения и доставка файлов — разные функции. Приложение (ZeroMail в нашем случае) может сломать автор, но оно никак не может сломаться само. И если сломается, то это не будет выражаться в невозможности доставить файлы.\n\nЕсли файлы не доставляются, значит, инфо о них в сети есть, но ни одной ноды с ними в доступе нет. Ситуация почти исключительная, учитывая, первичную публикацию на 5 живых узлов по дефолту.\n\nСкорее всего или какая-то проблема с Tor (нода знает, где файлы, но не может достучаться), или сбой у тебя локально, типа, хеши побились какие-то или ещё что-то. Это решается опцией «Проверить файлы» в меню-«гамбургере» в левой колонке стартовой страницы напротив ZeroMail.",
				"added": 1526566250
			},
			{
				"comment_id": 374,
				"body": "Хотя сейчас у себя перепроверил — действительно, сотня файлов не докачивается. Там же 16 тыс. файлов, а системой пользуются не особо активно, не удивительно, что что-то подзатерялось :)\n\nНо на работу в целом это не влияет.",
				"added": 1526566816
			},
			{
				"comment_id": 375,
				"body": "О. Ещё выплыл глюк. ZeroMail внезапно запросил лимит 40Мб. А раньше, пока не проверил все файлы, не спрашивал. В таком случае тоже может не докачиваться — утыкается в лимит и не качает больше. А запрос на увеличение лимита сайта почему-то не появляется.\n\nUpdate: вот и 50Мб запросило и пошло дальше качать…",
				"added": 1526567162
			}
		],
		"1_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 376,
				"body": "> [qiwi](#comment_7_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): Я думал, что создам здесь бложик и он будет жить вечно. :-) А через 100 лет его найдут наши предки и прочитают. :-D\n\nПока есть интересующиеся — так и будет :) А вот чтобы совсем произвольное хранилось — никаких ресурсов сети не хватит…",
				"added": 1527909231
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 378,
				"body": "> [qiwi](#comment_4_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): за 2 года никто не сделал аналог ласт.фм или саундслауд в зиронете?\n\nZeroLSTN. Но там сейчас сложно. Автор закоммитил оригинал с кривым ассетом (JS/CSS). Сам пилит новую версию, на старую забил, говорит, кому надо — делайте сами старую из исходников :)\n\nЯ сделал — http://127.0.0.1:43110/1MusicKyJsw3CoEA6g1puwAPQGaeLAV3TM/\n\nНо лезут какие-то косяки с разрешениями. Загрузишь Merger-сайт с жанром, выдашь разрешения — всё ок. Проходит немного времени, бац, запрашивает снова разрешение на Merger. Разрешаешь, вся музыка пропадает. Перестроишь БД (пункт в правой контекстной колонке) — появляется. И через какое-то время по кругу. Надо разбираться, что там с merger-БД, может, я при создании с исходников накосячил, может это мой персональный глюк на компе, может, в ZN где-то глюк. Но всё не соберусь, задача не из приоритетных :)",
				"added": 1527909581
			}
		],
		"5_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 379,
				"body": "Описание задаётся в правом контекстном меню, что выдвигается, если потянуть за «нолик» сверху-справа.\n\nСсылки задаются в их блоке слева, если нажать на карандашик рядом, также, как редактируются посты/заголовки/даты.",
				"added": 1528018417
			}
		],
		"1_13QEDyMcaT3GLaKty5Wtsax7naGuwVk6Zb": [
			{
				"comment_id": 380,
				"body": "> [qiwi](#comment_15_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): Отписался просто, чтобы ты не подумал, что тут никого нет. Знай - я тут есть. :)\n\nЯ PIC не программирую, только Arduino и ESP8266 :) Заводил тут себе [DIY-блог](/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/), но пока забросил его, т.к. и в реале почти не ковыряюсь сейчас с электроникой и в ZN отклика особого нет :)",
				"added": 1528018516
			}
		],
		"1_17gmC3ZAJ8Fyu3DH8EHTuV1RNjiob6Fjb8": [
			{
				"comment_id": 383,
				"body": "> [qiwi](#comment_12_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): Так и должно быть? Ниодной статьи.\n\nЗависит от подключённых хабов. В русской пока пусто, в английской есть что-то, но, вообще, это пока всё глубокие тесты.",
				"added": 1528020297
			}
		],
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": [
			{
				"comment_id": 384,
				"body": "> [krakodeal](#comment_3_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): В данный момент в верхушке правления России живёт и процветает банда\n\nПочему только сейчас и только в России? Это всегда так и везде, где есть государство. Государство — всегда самый жирный рэкетир. Мы ему платим часть доходов, оно нам обеспечивает крышу. Всегда, чем круче и выше уровень мафии, тем больше она заботится о своих источниках дохода. Даже у конкурентов государства, «нелегальных группировок» высокого уровня, есть своя страховка, медобслуживание и даже пенсия. Государство же всегда — самый высокий уровень крыши в данной местности.",
				"added": 1528568169
			},
			{
				"comment_id": 385,
				"body": "> [miklosh](#comment_19_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): хотел бы я посмотреть как бы побледнел провайдер какой-нибудь Бельгии когда ему бы вкатили иск о нарушении конституционных прав ВСЕХ граждан страны\n\nНу, вот, посмотрим, как сейчас будут реагировать европы на судебные дела по GDPR и, если примут, новой директивы об авторских правах.\n\nЕщё интересно посмотреть, что в Англии с шифрованием WhatsApp будет.",
				"added": 1528568339
			},
			{
				"comment_id": 386,
				"body": "> [krakodeal](#comment_4_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): Да только что-то не совмещаются \"рекетир\" и \"бесплатное и качественное медицинское обслуживание\" в той же Швеции к примеру.\n\nПочему, нет? В Швеции тоже берут налоги. И тоже разгоняют недовольных.\n\nhttps://russian.rt.com/article/46750\n\n> В других, более приличных странах, государство действительно делает что-то на благо налогоплательщиков.\n\nКак и в России :)",
				"added": 1528872175
			}
		],
		"1_1LpBX68Uou9bsvicBDouMaKr2N3cz9968Z": [
			{
				"comment_id": 387,
				"body": "> [tmpacc69293477](#comment_1_1LpBX68Uou9bsvicBDouMaKr2N3cz9968Z): Но ник до сих пор занят.\n\nНа ZeroID? Это навсегда. Там отмечено, что такой ник уже выдан. Приватный ключ/сертификат на него в `users.json` в секции `certs`. Если потерялся — то это навсегда и безвозвратно. Надо всегда делать бэкап `users.json`.",
				"added": 1529221954
			}
		],
		"2_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 388,
				"body": "> [eliot](#comment_1_1P3JVeqokaicpcrMK9HXzpScWa2fPSLen8): Думаю валить надо\n\nТуда, где пенсионный возраст 67 и иногда кидают с пенсиями или туда, где пенсий вообще нет? :)",
				"added": 1530263073
			}
		],
		"1_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 389,
				"body": ">В моей жизни был момент,когда моё тело потеряло объём и я стал видеть себя,как голограмму\n\nГоду, эдак, в 1997-м, купил очередной номер «[НВО](http://nvo.ng.ru/)», прочёл от корки до корки. Интернета не было, по военной технике статей было крайне мало, так что запоминалось нами тогда практически всё и почти дословно.\n\nПотом передал газету своему товарищу (в общаге дело было), как мы тогда обычно поступали (прочитал сам — передай товарищу). Вечером начали обсуждать новости.\n\nЯ ему — «А круто, наши контракт на поставку Т-90 в Индию утвердили...»\n\nОн — «Где? Почему не видел?»\n\nЯ — да вот же, не втором развороте, в центральной колонке, с прочими новостями... опаньки. Нету новости! Газета та же, остальные материалы на месте, а этой новости — нет.\n\nПосле внимательного изучения газеты, выяснилось, что ещё пропала статья по Су-30, а на её месте (в «подвале» первой страницы, кажется — сейчас уже плохо помню) такая же по объёму статья в духе «репортаж из части такой-то»...\n\nПосмеялись неловко на тему того, что это я в параллельный мир перепрыгнул да и забили. Ибо всё равно объяснить нереально.\n\nВ «новость» по контракту с Индией на поставку им пары сотен Т-90 Славка тогда не поверил.\n\n...\n\nЧерез неделю где-то эту новость уже публиковали всюду, мы вернулись к теме той газеты, опять пожали плечами и больше уже не вспоминали :)",
				"added": 1530474347
			}
		],
		"1_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 390,
				"body": "> [kukiswum4orr](#comment_1_112P12yusWzfvzAUiEbL6YUzWg33hfGxae): чот негусто там книг\n\nОбычная положительная обратная связь. Мало народа -> мало реакции -> мало желающих возиться с наполнением контента -> мало контента -> мало народа :)",
				"added": 1530798532
			}
		],
		"1_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": [
			{
				"comment_id": 391,
				"body": "> [qiwi](#comment_2_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): Чувствую с зеронетом будет такая же петрушка.\n\nЕсть качественная разница. Если гофер никому не интересен, то сервера с ним исчезают. Контент пропадает. Поддержка его выпиливается из клиентов. И новичкам в нём делать вообще нечего.\n\nZN же использует обычный браузер, поэтому не зависит от клиентских причуд и контент тут оседает, остаётся пока есть интересующиеся юзеры. Поэтому, как бы мало ни было народа, количество контента неуклонно растёт. Значит, с каждым годом новым пользователям тут будет интереснее. И есть шанс, что доля постоянных пользователей будет расти. А значит, будет расти и объём контента. Положительная обратная связь.\n\nХотя в любом случае, хорошие пиар-кампании, как с Мастодонтом или ПирТубом тут бы не помешали :)",
				"added": 1530819408
			}
		],
		"2_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 392,
				"body": "> [res](#comment_1_1AM4rX12jEv78BjLj55cHCy6LP7bnPVAL5): Такая же тема. Приходится бессистемно выискивать полезную информацию откуда попало. Что-то есть в FAQ, что-то в интернете, по кускам.\n\nПо-другому в распределённых системах и не бывает. ZN тут ещё не худший вариант, поскольку есть поиск по загруженному контенту и много каталогов :)",
				"added": 1530969369
			}
		],
		"2_1JBcoMArHbt3S8kMXG4YcR88q8HYfwb3x5": [
			{
				"comment_id": 393,
				"body": "> [b1ackpu](#comment_4_1HUChBhnbtRDaHh8MbUizwj4xeUAT7VQzM): друзей по всей видимости тебе тут не найти(((\n\nЯ б добавил, но я так и не поборол падения RetroShare под виндой, а на безголовом сервере RS почти неюзабельна, так что не использую :)",
				"added": 1531302345
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 398,
				"body": "> [gluckman](#comment_23_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Смех смехом, но вот повышение пенсионного возраста - реально людей выкинет в нищету\n\nНа работающих сегодня никак не отразится. Пенсионеры получат повышение пенсий. Отразиться негативно может только на тех, кто выпадает из пенсионного возраста в рабочий. И только в том случае, если они не смогут устроиться на работу или будут получать зарплату меньше своей же будущей пенсии.",
				"added": 1533571805
			},
			{
				"comment_id": 399,
				"body": "> [th1s1n0t](#comment_1_15peXv3N9Z4RNBNHovzwKRVYc93hXca91E): Можно подсчитать, начав работать в 18 лет, допустим с зп в среднем в 30к, при пенсионных отчислениях в 6%, выйдя на пенсию в 65 и умерев, допустим в 85 (повезло)Вопрос, сколько моих денег останется у них?\n\nВ России пенсионная система не накопительная (точнее, это тоже сейчас вводят, но это очень малый объём, несколько процентов), а консолидационная. Люди не откладывают деньги на свою старость, а работающие сейчас платят пенсии нынешним пенсионерам.\n\nПо факту на данный момент мы имеем:\n\n- Число пенсионеров = 43 миллиона.\n- Число работающих = 72 миллиона.\n\nПри средней пенсии в 14 тысяч рублей при нулевых попилах каждый работающий в стране должен отдавать пенсионерам 8300 рублей. Или 23% средней зарплаты.\n\nПенсионный налог в стране -- 22%. То есть на уровне погрешности из-за грубой оценки, сколько в пенсионный фонд работники платят, столько пенсионеры и получают. Конечно, \"усушка-утруска\" в виде всяких гипертрофированных офисов ПФР, зарплат чиновникам и прочие потери есть, но всё это на уровне единиц процентов, а не \"повального воровства\". Бороться с этим имеет смысл, но это сейчас не критическая проблема.",
				"added": 1533709033
			},
			{
				"comment_id": 400,
				"body": "> [marketforce](#comment_3_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): Только еще государство докидывает из федерального бюджета в ПФ больше половины суммы, которую платят работники\n\nНадо уже конкретные детали смотреть. Ибо ПФ -- это не только пенсии старикам, но и инвалидность, материнский капитал, пособия по безработице, всякая социальная помощь... Всё равно при грубой прикидке баш на баш и получается. Может, \"усушка-утруска\" там и больше нескольких процентов, но всё равно -- мизер.",
				"added": 1533735837
			},
			{
				"comment_id": 401,
				"body": "> [marketforce](#comment_4_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): По той грубой прикидке, по которой баш на баш получается, поступающие страховые взносы (4481,9 млрд) должны быть в пределах нескольких процентов от расходов на выплату пенсий (7167,2 млрд). Но что-то тут не так...\n\nПенсии же тоже не только по возрасту. Но и все другие виды тоже. Признаю, грубая прикидка получается неинформативной. Но интересное совпадение доходной и расходной частей.",
				"added": 1533827043
			},
			{
				"comment_id": 428,
				"body": "> [reflevmas](#comment_11_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo): Что вы думаете о бессрочке\n\nДо первых морозов :D\n\nИ, если мы в ZN, то можно видео заливать в [KopyKate](/big.kopykate.bit/) или клоны :)",
				"added": 1537214757
			},
			{
				"comment_id": 442,
				"body": "> [zeronull1](#comment_1_1GUqHnf3MqUpkbvBTbi1uK9WkSgLPFjv7Q): У меня такой вопрос\n\n[Ответил отдельно](/1sociKTwvFGcgqatNriVEmh1o6bqk9qC1/?Topic:1538027191_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/), чтобы тут лимит не сажать.",
				"added": 1538027245
			},
			{
				"comment_id": 447,
				"body": "> [strelok](#comment_31_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Шариат с кадыркой в москвабаде? Легко.\n\n1.2 миллиона чеченцев по всей России против ~17 миллионов русских в одной только Москве? И «москвабад»? Ну, даже не знаю, за что Вы так русских презираете :)",
				"added": 1539666062
			},
			{
				"comment_id": 454,
				"body": "> [oldpirat](#comment_2_1HzUBwmiMiRntjL12LRbZTXz1aWB322M8K): при нарушении подвоза продуктов в москвабад - через неделю если не революция, то жуткий бунт будет точно.\n\nПиу. В 1992 гг., когда даже по «карточке москвича» кроме хлеба и морской капусты часто нечего было купить, когда куча людей вообще голодала (включая, иногда, вашего покорного слугу) — народ ни хрена не бунтовал. Зато бунтовал в 1991-м, когда всё _ещё_ было и бунтовал в 1993-м, когда всё _уже_ было :) Так что прямой корреляции нет. Когда люди вынуждены заботиться о добыче пропитания, им не до революций. Революции начинаются или когда зажрутся и скучают, или когда терять уже ВООБЩЕ нечего, когда дети умирают от голода. Так что за неделю без подвоза бунта не будет. Только ворчание.",
				"added": 1541235410
			},
			{
				"comment_id": 455,
				"body": "> [oldpirat](#comment_3_1HzUBwmiMiRntjL12LRbZTXz1aWB322M8K): \"в 1991-м, когда всё ещё было\" - в стране уже ничего не было. где-то с 90-ого.\"1993-м, когда всё уже было\" - денег только уже на это \"все\" не было\n\nЭто всё уже натяжки. Факт, что в том же 1992-м было НАМНОГО хуже, чем в 1991 или 1993-м. Но бунтов не было. Так что корреляции чёткой нет.",
				"added": 1541253594
			},
			{
				"comment_id": 461,
				"body": "> [krakodeal](#comment_9_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): Массовый голод лапотников, аресты \"политических\", распри князьков при диктаторе\n\nВы свои незалежні мрії умеряйте :) А то палитесь.",
				"added": 1542638005
			}
		],
		"1_1KcPa74X88hPnyc64nnkXveXA8daeKpvcU": [
			{
				"comment_id": 402,
				"body": "> [geobor](#comment_6_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz): как этим пользоваться?\n\nГлавное меню -> Configuration",
				"added": 1534157229
			}
		],
		"2_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 403,
				"body": "> Не удалось найти IP-адрес сервера nnm-club.lib.\n\nБлин, в ZeroBlog все условия для быстрого лёгкого копипаста. И какой смысл давать ссылку на промежуточный форум, когда там сразу ссылка на Хабр? Если уж делать, то так :) — http://127.0.0.1:43110/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/?Post:25:В+настоящее+время+сразу+три+государственных+ведомства+активно+работают+над+созданием+новой+системы+блокировки+запрещенных+ресурсов",
				"added": 1535870267
			}
		],
		"5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 404,
				"body": "> [geekless2](#comment_9_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Зарегистрировать ID через прокси\n\nНет, там честный 127.0.0.1\n\n> Зарегистрировать ID на одном компе.\n\nКомп тот же самый, инстанс ZN тот же самый. Просто получил ZeroID, написал на форум, закрыл браузер, открыл снова через какое-то время — ZeroID нет, требует снова регистрироваться. Сейчас, вот, спрашиваю, есть ли у человека в `users.json` вообще секция `\"certs\"`. Проблема в том, что это не-IT народ и задача для них не тривиальная :)",
				"added": 1535978323
			},
			{
				"comment_id": 405,
				"body": "> [geekless2](#comment_10_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): А не IT-народ мог случайно запустить другую копию ZN из другой папки? Или запустить из какого-то менеджера архивов, который скрывает процесс распаковки файлов?\n\nРазумный вопрос. Переадресовал :)",
				"added": 1535978873
			},
			{
				"comment_id": 406,
				"body": "> [geekless2](#comment_11_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Пусть забекапит master_seed перед любыми действиями.\n\nЯ сказал вообще users.json забэкапить :)\n\n> Если master_seed не менялся, достаточно зайти на ZeroID, и он восстановит сертификат.\n\nТам явно предлагает только новую регистрацию. При чём ругается (естественно), что такой ник уже занят.",
				"added": 1535978928
			},
			{
				"comment_id": 407,
				"body": "Спросил:\n\n>> **Balancer:**\n>> Не может быть так, что ты запускаешь каждый раз из архива прямо с новой распаковкой?\n\n> **В.Н:**\n> ~~нет~~ не знаю. я его из трея запускаю\n\nРаз из трея, то ZN не перезапускается.",
				"added": 1535979352
			},
			{
				"comment_id": 408,
				"body": "> [geekless2](#comment_12_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo):  Может, тоже повезёт наступить на те же грабли. Клиент я юзал под виндой, но с винды никогда никуда не логинился в ZN.\n\nЯ с десятки очень активно пишу, не меньше, чем из под Ubuntu :)",
				"added": 1535980821
			},
			{
				"comment_id": 409,
				"body": "> [test999999](#comment_1_18TXdP92WDunaRxdvSrqAdVEVU76wfgChX): Ну тада у меня только один вариант - закончилось место на диске, так что файл не сохранился. >_<\n\nМало вероятно :) Но вероятность есть. Спрошу :)",
				"added": 1535981906
			},
			{
				"comment_id": 410,
				"body": "Товарищ прислал users.json — с виду нормальный. Но секция certs пустая. master_seed, но предполагаю, к нему никакой ZeroID не привязан. Хотя попробую запустить отдельным инстансом и подсунуть этот users.json",
				"added": 1535982789
			},
			{
				"comment_id": 411,
				"body": "Да, запустил отдельную ноду с его users.json — и по master_seed на ZeroID ничего нет, только новая регистрация предлагается. Зарегал нового юзера, в users.json прописался без проблем. Х.з., что это такое. Но, блин, когда ситуация дважды повторяется у разных юзеров, при чём с разными версиями ZN (полгода разницы) и даже в разных ОС (первый раз Linux, второй — Win10), то это что-то хитрое…",
				"added": 1535984795
			},
			{
				"comment_id": 412,
				"body": "> [anotherneko](#comment_97_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Не может ли быть так, что у пользователя нету прав на запись в каталог с zn?\n\nusers.json на вид корректный. Сайты там есть какие-то. Опять же, master_seed же индивидуальный записался.\n\nПоявилась версия, что может быть виновна кириллица в пути. Товарищ распаковал на рабочий стол. Будет проверять. Хотя это не объясняет первый случай, с Linux'ом — там это не критично.",
				"added": 1535987211
			},
			{
				"comment_id": 413,
				"body": "> [balancer73](#comment_412_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Появилась версия, что может быть виновна кириллица в пути.\n\nТочно. После переноса в каталог без кириллицы всё завелось.",
				"added": 1535988574
			},
			{
				"comment_id": 414,
				"body": "> [geekless2](#comment_13_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): А это точно виновата кириллица, а не пробел в названии \"Рабочий стол\"?\n\nМожет быть и пробел. Я, чтобы наверняка, посоветовал и без пробела. Но у консольных приложений под Windows проблемы с кодировкой кириллицы в путях явление очень частое. Много чаще, чем с пробелами.",
				"added": 1536036905
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 415,
				"body": "> [boozycat](#comment_1_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): но первые впечатления приятные, особенно по сравнению с фринетом. Осталось понять, что я здесь делаю)\n\nТут приятно, что всё просто работает. И быстро :) Вот людей тут намного меньше, чем контента и это печально. Контента много, потому что он остаётся, даже когда его авторы забивают на него. А вот люди приходят и уходят, так что активного русского коммьюнити одномоментно тут не много.\n\nЯ, кстати, начинал, потом забросил, недавно снова начал понемногу описывать ресурсы ZN [у себя на Wiki](/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/). Конечно, есть [ZeroSites](/Sites.ZeroNetwork.bit/) или [0list](/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/), но тут как бы отобраны места, где тусуюсь я :)",
				"added": 1536688429
			},
			{
				"comment_id": 416,
				"body": "> [boozycat](#comment_3_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): ЗЫ: ЛОРу привет =)\n\nДа, я сюда сколько-то народа оттуда затащил. Но не уверен, что хоть кто-то надолго задержался :)",
				"added": 1536744447
			}
		],
		"1_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 417,
				"body": "Интересный вопрос. Сам-то перевод сделать легко, а вот как добавить нужный язык в меню на ZeroHello, я не нашёл. В исходниках ZeroNet ничего такого не нахожу.\n\nНужно спрашивать @nofish ([ZeroMe](/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/nofish@zeroid.bit), [блог](/Blog.ZeroNetwork.bit/)).",
				"added": 1536745055
			}
		],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 419,
				"body": "> [boozycat](#comment_4_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): только в чём смысл? Анонимно двигать игровых персонажей можно и в обычной сети)\n\nТак можно про всё сказать. И на форуме можно в обычной сети общаться, и блоги вести в ней же :)",
				"added": 1536865156
			},
			{
				"comment_id": 420,
				"body": "> [boozycat](#comment_5_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): Но для ММО игр ни то, ни другое, важности не имеет\n\nЗато многим имеет важность невмешательство администрации в игровой процесс, публичность внутриигровых операций, независимость от серверных проблем и т.п. :)\n\n> Это у меня одного такая беда с сетью?..\n\nЯ так понял, это просто демка технологий :D",
				"added": 1536917193
			},
			{
				"comment_id": 421,
				"body": "> [boozycat](#comment_6_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx):  В случае ММО ты вряд ли захочешь продолжать игру, если в ней будут лаги ) Я вот тут, кстати, подумал про MUD — тут скорость обмена не так важна, задержка в 2--3 секунды на процесс не повлияет.\n\nЕсть огромный класс походовых игр, от почти реалтаймовых, типа Civilization или UFO до сеансовых, типа VGA Planet (или шахмат по переписке :D). Вот это — непочатый край для программирования в ZN.",
				"added": 1536946615
			},
			{
				"comment_id": 441,
				"body": "> [geekless2](#comment_17_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Для коллективных вычислений без читерства нужен блокчейн.\n\nЕсли достаточно не исправлять, а только обнаруживать факт читерства, чтобы остановить игру, то можно проще делать. Например, иметь у себя данные, содержащие хеши чужих ходов. Тогда при обнаружении несовпадения, кто-то у себя что-то задним число подправил, это будет обнаружено и игру можно прервать :)\n\nЭто, конечно, всё для тех же походовых игр, я считаю, что они в ZN наиболее реальны.",
				"added": 1537764967
			}
		],
		"2_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 422,
				"body": "Теоретически — запросто, какие-то уже «закрывали», типа LimeWire. В смысле, сеть запретить, понятно, не могут, но бьют по разработчикам клиентов.\n\nНо тут у ZN есть бонус — разработка может прямо в ней идти, тот же GitCenter. Но уязвимая точка — www.zeronet.io",
				"added": 1536999114
			},
			{
				"comment_id": 423,
				"body": "> [reflevmas](#comment_5_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo): если зайт противазаконный разработчик сможет приватный ключ в каком-то другом зайте опубликовать другим разрабам.\n\nТогда законники по этому же ключу тупо убьют сайт :)\n\n> Думаю единственный случай закрыть зеронет. Закрыть доступ к интернету.\n\nЕсли подходить радикально, то банальный переход к сертифицированным шифрованным источникам и DPI на нешифрованные. Т.е. всякие там Сбербанки в белые списки, а остальные — только не шифрованные.\n\nНо ZeroNet в таком случае сможет на какой-нибудь стеганографии выжить :D Конечно, видео так не погоняешь, но текстовый обмен вполне потянет. Но в мире такой антиутопии у государства просто будет банальный удалённый доступ к каждому компу. И за нелиценизрованный софт будут сажать :D",
				"added": 1537008776
			},
			{
				"comment_id": 424,
				"body": "> [reflevmas](#comment_6_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo): Каким образом они найдут вот этот сайт http://127.0.0.1:43110/Q5oJ4bW5HW6bk8ypH5nR3RvZeSC6CVM2W\n\nСайты светятся по соседним пирам, чтобы было известно, у кого что качать. Я на это уже нарвался, когда пробовал завести не публичный блог про детство сына. Типа, ему и родственникам. Хранил только на двух своих машинах, со временем штук на 20 разошлось :D\n\n> Удалил он весь сайт. Но пользователи остались же. Да сайт пропал у разраба. Но вот у пользователей оно должно быть остаться? Или я что-то не так понял смысл децентрализованности.\n\nЕсли у себя грохнешь, то у других пользователей останется. Но поменять уже ничего будет нельзя. А так — да, хороший способ публиковать горячую информацию. Завёл сайт, опубликовал и убил у себя приватный ключ. Даже сайт стирать не обязательно, типа, ты такой же пользователь, как и куча других :) Но момента исчезновения приватного ключа сайт изменить уже никто не сможет. Хотя распространяться он будет свободно, пока есть источники.",
				"added": 1537012840
			}
		],
		"3_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 425,
				"body": "В `data/users.json`. В секции с ID сайта, параметр `privatekey`. Вообще, бэкапить целиком `data/users.json` — хорошая идея :)",
				"added": 1537017087
			}
		],
		"4_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 426,
				"body": "> [jamesjames](#comment_1_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp): а так: sudo zeronet siteCreate\n\nЕсли zeronet работает от юзера, то созданный сайт будет с root-правами и потом с ним ничего от юзера будет не сделать :D\n\nТут надо раньше смотреть, что значит «нифига не помогает». Какие ошибки выдаёт и т.п.",
				"added": 1537047267
			},
			{
				"comment_id": 427,
				"body": "> [jamesjames](#comment_3_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp): как тебе идея reflevmas про «ZeroNet Handbook»? Составишь? :)\n\nМне будет сложно :) Это надо было писать по свежим впечатлениям пару лет назад. Сейчас-то глаз уже замылился и вся возня с ZN для меня выглядит как «распаковал и запустил» :)",
				"added": 1537050131
			}
		],
		"1_1G4ABh5yucpdkSnJNrWSttAYMHRsmFGMqV": [
			{
				"comment_id": 429,
				"body": "Какой конкретно сайт?",
				"added": 1537272855
			},
			{
				"comment_id": 430,
				"body": "> [2222225](#comment_4_1G4ABh5yucpdkSnJNrWSttAYMHRsmFGMqV): просто не могу понять что может блочить загрузку изображений и видео\n\nПервое, что вижу, картинки пытаются из клирнета грузиться. Нахрена такое надо? o_O Например, https://check-you.ru/uploads/posts/16969/index_kzMOL5Ts.jpg\n\n```\nРесурс по данному IP-адресу заблокирован по решению органов государственной власти\n```\n\nЕсли сайт содержит сразу же массовые ссылки в клирнет — нафига он, вообще, в ZN нужен?",
				"added": 1537315620
			}
		],
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 431,
				"body": "Можно. Но лучше будет его утянуть каким-нибудь открытым прокси, чтобы первоначально стал другим доступен сразу.",
				"added": 1537361506
			},
			{
				"comment_id": 433,
				"body": "> [dude](#comment_64_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Зайти на него поначалу смогут лишь те кто имеют у себя тор.\n\nУточнение — те, у кого Tor явно не запрещён :) ZN-ноды по умолчанию используют режим собственной работы без Tor, но с поддержкой соединений через Tor с соответствующими нодами.",
				"added": 1537368422
			},
			{
				"comment_id": 434,
				"body": "> [blackdot](#comment_1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4): Зачем нужен открытый порт?\n\nЧтобы с тобой могли связаться другие ноды. Например, обновить мгновенно сайт при обновлении у них. Без открытого порта ты будешь обновляться только периодически, по расписанию (или вручную).",
				"added": 1537368506
			}
		],
		"2_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 432,
				"body": "У меня работает нормально. Да там и код сайта с 26 июля не обновлялся.",
				"added": 1537363424
			},
			{
				"comment_id": 435,
				"body": "> [mistalero](#comment_9_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что же такое могло произойти?\n\nА в чём конкретно проявляется «невозможность войти в аккаунт»? Не позволяет выбрать ZeroID? ZeroID отсутствует в списке? Merger-сайт с хабом загружен?",
				"added": 1537419010
			},
			{
				"comment_id": 436,
				"body": "> [mistalero](#comment_10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Раньше отображался пост Hello ZeroMe. Сейчас отображается Create new profile. При попытке создания выдаёт ошибку User mistalero@zeroid.bit already exists on this hub.\n\nПохоже на то, что на ноде на загружен нужный хаб. Просмотр в 1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV показывает, что твой хаб — 1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a\n\nПроверь, загружен ли http://127.0.0.1:43110/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/\n\nТвой профиль: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/mistalero@zeroid.bit",
				"added": 1537495054
			},
			{
				"comment_id": 437,
				"body": "> [mistalero](#comment_11_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Please use ZeroMe to browse profiles on this page.\n\nВсё так. Это не самостоятельный сайт, а база данных, которой пользуется ZeroMe.\n\n> User not found or muted\n\nА вот это косяк какой-то. Или сайт повреждён, попробуй:\n- Проверить файлы через контекстное меню сайта на ZeroHello\n- Перестрой базу данных из настроек самого сайта\n- Ничего не поможет — удали и загрузи заново\n\nИли ты сам себя в игнор где-то внёс :D — посмотри в настройках игнора на ZeroHello.",
				"added": 1537523090
			},
			{
				"comment_id": 439,
				"body": "> [mistalero](#comment_12_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54):  А это где?\n\nНа ZeroHello в самом верху в левой колонке есть «гамбургер» (три точки меню) с пунктом «Manage blocked users and sites».",
				"added": 1537527419
			}
		],
		"3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 438,
				"body": "Никак, наверное. Хотя таких автоподписывающих я не встречал, вроде. На форумах подписка появляется при ответе в топик. Других автоматов не встречал, вроде.\n\nМожно оставить предупреждение автору сайта, если предусмотрена обратная связь, если не поможет — просто удалить этот сайт. Раз ты не хочешь видеть обновления из него, то можно и не держать сайт у себя :)",
				"added": 1537523214
			}
		],
		"1_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx": [
			{
				"comment_id": 440,
				"body": "Если у тебя есть проблемы с точностью UTC, то может быть так, что свой сайт обновишь с машины где нормальное время. Потом — с машины, где время сильно отстаёт. После синка в сети время будет больше на первой машине и старый контент забьёт новый, последнее обновление будет потеряно.\n\nЭто первое, что в голову приходит.",
				"added": 1537604798
			}
		],
		"4_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 443,
				"body": "> [matureshare](#comment_1_12QpeSBuu13S3PXz88kxsr9edFsb1dMhkW): А что подразумевается, под заходом через \"гейт\"?\n\nЗаход через прокси. Т.е. не со своего сервера с локалхоста, а с внешнего адреса. Выше пример — https://www.zerogate.tk/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/",
				"added": 1538138509
			}
		],
		"1_1Dw6LvgbshhRFV9XQgPCAkqTZCdK5V7ce1": [
			{
				"comment_id": 444,
				"body": "> [slava](#comment_2_1Dw6LvgbshhRFV9XQgPCAkqTZCdK5V7ce1): Наивный! В этом месте только каждый 100й, а то и только 1000й НЕ знает о криптовалютах. Таргетинг будет зачётный!\n\nВ том-то и проблема, что почти все знают. Значит очень многие заходы могут просто не сработать :D Ну, конечно, зависит от целей и целевой аудитории.",
				"added": 1538325378
			}
		],
		"5_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 445,
				"body": "> [geekless2](#comment_20_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Да.\n> Вообще смысл функции запрещения клонирования от меня ускользает. Любой сайт можно скопировать.\n\nЧисто технические моменты могут быть. Например, в KopyKate в JS захардкожены адреса сайта. Я в некоторых местах пытался поменять этот хардкод на адрес сайта, полученный через API, но в некоторых местах тупо не могу найти, где его брать. Типа, в конфигах в этот момент пусто :) Поэтому после копирования надо менять чужой хардкод на свой. После простого клонирования работать не будет.",
				"added": 1539506975
			}
		],
		"6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 446,
				"body": "> Я правильно понимаю, что если создатель зайта удалит его, то сайт автоматически исчезнет и у других пиров?\n\nЗависит от понимания удаления. Если просто сотрёт у себя каталог, то у других ничего не исчезнет. Если целенаправленно сотрёт содержимое зайта, оставив один content.json и в таком виде опубликует — то исчезнет.\n\n> Есть ли на зайтах возможности модерации: тобиш удаление постов/вклада других пиров админом либо даже его модераторами\n\nВладелец зайта может подписывать изменения в data/users: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1538993787_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1539563983
			}
		],
		"8_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 449,
				"body": "Блог клонировал официальный? А то такое было в старых версиях ZeroBlog при вставке под Windows. Потом вставляться стало, но определение размеров картинки (и тоже только под Windows) не работало. Сейчас в официальном ZeroBlog и производных от него всё ок, но, может, ты чей-то блог со старой версией кода склонировал?",
				"added": 1540640404
			},
			{
				"comment_id": 450,
				"body": "> [promusik](#comment_31_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Сделал Upgrade code у блога, но результат тот же.\n\nТак клон был с официального или нет? Upgrade code просто делает у тебя код таким же, как у оригинального блога, что ты клонировал. Если клонировал не официальный, то на официальный можно переключиться, поменяв адрес `\"cloned_from\": \"1FetDo9hbmSfdSmsTXXPusiLk3S5fgnWpq\"` в `content.json` в корне твоего сайта.\n\n> Я все из под Linux делаю\n\nТогда странно. Я под Linux с таким не сталкивался с момента появления аплоада картинок (раньше этого не было, нужно было или вручную класть их в каталог сайта, или где-нибудь на IPFS хостить).",
				"added": 1540648489
			}
		],
		"7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 451,
				"body": "> [darktrader03](#comment_6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Но ведь в таком случае как проводить модерацию контента? Я имею ввиду мьютить пользователей.\n\nПолная анонимность и модерация на уровне пользователей по определению несовместимы. Или у тебя все посты анонимны и тогда каждый из них сам по себе, или у тебя посты от одного пользователя, но тогда ID этого пользователя известен.",
				"added": 1540898909
			},
			{
				"comment_id": 453,
				"body": "> [darktrader03](#comment_7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Алсо, а зачем тогда каждый раз генерировать новый сертификат? Не лучше ли тогда полностью от них отказаться?\n\nЧтобы каждая нода не могла произвольно подделывать контент (или хотя бы просто случайно повредить и раздавать повреждённый), он должен быть подписан. Для простых сайтов подпись идёт мастер-ключом сайта. Для многопользовательских каждый пользователь подписывает свой контент своим ключом. Даже если это единственное сообщение, оно должно быть подписано.",
				"added": 1540966003
			}
		],
		"8_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 452,
				"body": "Как и другие, клонированием оригинала.",
				"added": 1540965851
			}
		],
		"1_1BfSUGhNmbYZHDgLw67nu2b9LbbPne92Dz": [
			{
				"comment_id": 456,
				"body": "> [saaremaa](#comment_1_1BfSUGhNmbYZHDgLw67nu2b9LbbPne92Dz): Что-то как телеграмм только на основе ZeroNet. Если есть мобильный будет неплохо.\n\nНет. Есть во множестве чаты (но пустые). Есть ZeroMail, который, как понятно, есть простая почта. Есть ZeroMe, который микроблог, но может использоваться как публичный мессенджер. Классических IM в ZN нет. Написать можно, по аналогии с ZeroMail/ZeroMe, но никому из способных написать, пока не нужно было :)",
				"added": 1541578862
			},
			{
				"comment_id": 457,
				"body": "> [minic](#comment_1_16xnUKegknnxfYJn3Lrj9pq62DHenkVDmQ): И какой же?\n\nhttps://play.google.com/store/apps/details?id=net.mkg20001.zeronet",
				"added": 1542166016
			},
			{
				"comment_id": 460,
				"body": "> [ayyuki](#comment_1_16XjK5MaWz1Kum9K7kq7Sx5wQvKcMrdT5U): Это же не мессенжер.\n\nВопрос выше в цепочке был про _мобильный клиент_, а не мессенджер :) Про мессенджер отвечалось ранее.",
				"added": 1542533913
			}
		],
		"1_16xnUKegknnxfYJn3Lrj9pq62DHenkVDmQ": [
			{
				"comment_id": 458,
				"body": "> [boozycat](#comment_11_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): Почему мы бы не сделать ZeroTrack\n\nЕсть [KopyKate](/big.kopykate.bit/).\n\nВ частности:\n\n- [RU Video](/1videomkrGfLUNe2RaQJqbumb4nTgbp2J/)\n- [RU TV Show](/1tvshuFLkoockzDmvmgmoDoXYe7G6GWxL/)\n- [RU Kino](/1kino8s8jT8TfbW1kSMoNL4sqqu6kut28/)\n\nЭто не торренты, это возможность смотреть прямо онлайн :)\n\nИ обсуждение фильмов на [RU Kinozal](/1JUjBANMM5MjbGrzz3faUd3gXUXmAr3ces/).\n\nНо в итоге, кроме меня и @rhon никто этим не занимается :) И на раздачах никого…",
				"added": 1542206985
			},
			{
				"comment_id": 464,
				"body": "> [sgushennayavoda](#comment_28_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): проблема - КОНТЕНТ.Его тут, как и во многих других \"альтерсетях\" нет от слова \"совсем\".\n\nЕсть примерно в тех же пропорциях к имеющимся юзерам, как и в клирнете. Т.е. начинать можно с того, что тут *ПОЛЬЗОВАТЕЛЕЙ, как и во многих других \"альтерсетях\" нет от слова \"совсем\"* :)",
				"added": 1543505551
			},
			{
				"comment_id": 466,
				"body": "> [twentyneons](#comment_2_1FEGP7L4jZNzq27DHXZSWXpYpFyuTNgm9u): Но зато тут есть неубывающая затычка в каждой дырке под названием \"balancer73\".\n\nЧто только подчёркивает моё предыдущее сообщение. Если, в среднем, одно моё сообщение в день, превращается во «в каждой бочке затычка» то с активностью народа в сети совсем всё грустно…",
				"added": 1544089863
			}
		],
		"1_1PT9pN8Cuw62Vvs95xKmHJNYgo86vFwVE3": [
			{
				"comment_id": 459,
				"body": "1. Выбрать то, что как считаешь, у тебя получается и может быть интересно другим. Или что ты хочешь увековечить :)\n2. Склонировать ZeroBlog.\n3. Начать писать.",
				"added": 1542465891
			}
		],
		"1_15GqdBvcxgrSodxpe5QUridX85E9hjmLAW": [
			{
				"comment_id": 463,
				"body": "> [anotherneko](#comment_112_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Доски объявлений же. Они еще на заре интернета появились.\n\nВ RetroShare можно соединяться только с френдами. Встаёт вопрос, как их находить изначально. Кто-то публикует на обычных форумах, а многие берут «ключи френдов» в обычном чате, предназначенном для этой цели :)",
				"added": 1543324043
			},
			{
				"comment_id": 465,
				"body": "> [anotherneko](#comment_113_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Я не про RetroShare а про интернет конца девяностых - начала нулевых.\n\nПросто привожу пример RS, где реализована эта концепция :)\n\n…\n\nКстати, в 90-х/00-х в Интернете этот метод почти не использовался. Для обмена ссылками использовались каталоги (что не то же самое) и кольца ресурсов. Ну и баннерные системы тогда были совсем другие, там крутилась полезная и некоммерческая конкретика. Из-за чего если на 100 показов было менее 5 кликов, то баннер считался паршивым, нормальными считались цифры в 15-20% CTR :) (Сейчас хороший показатель — 0.5%)\n\nhttp://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:27:ZeroNet:+повторение+большого+пути",
				"added": 1543513382
			}
		],
		"10_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 467,
				"body": "> [caryoscelus](#comment_30_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Нормально удаляется, хоть с 0hello, хоть из сайдбара\n\nСобственные так удалить нельзя. Но в `data/` вручную у меня удаляется нормально :)",
				"added": 1544349208
			}
		],
		"2_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 469,
				"body": "Кто на ком стоял? Какая панель? Какая локальная копия зайта?\n\nВсе зайты работают с локальных копий. Ты выкачиваешь к себе и работаешь с ней, рассылая изменения по всей сети. Исходный автор зайта может быть недоступен. Или вообще уже отсутствовать. Он нужен только для модификации кода и базовых данных.",
				"added": 1544682872
			},
			{
				"comment_id": 470,
				"body": "> [ranx](#comment_2_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr): Не знаю кто там на ком стоял, а я про то, что если не будет ни одного пира у ZeroHello\n\nА, ну так и надо было сказать, что речь о ZeroHello. А то телепаты в отпускУ :)\n\n> (в теории), то управлять сайтами станет невозможно.\n\nЕсли не будет ZeroHello, то откуда ты управлять своими зайтами собрался? Только с командной строки? Если же у тебя будет ZeroHello для управления зайтами, то вот тебе уже и первый пир.\n\n…\n\nСкажем так, ZN отлично работает в офлайне :) Куда уж меньше-то пиров?",
				"added": 1544711563
			}
		]
	},
	"comment_vote": {
		"70_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": 1,
		"378_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"2_1DinguqcWEJd9T8FBJ9tMExfz6DHcZZYb9": 1,
		"31_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"18_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg": 1,
		"1_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": 1,
		"1_1AtHamvjTgcyTeJytnTf2i5ah3CrEa3rJG": 1,
		"29_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1
	}
}