{
	"title": "DividedByZero",
	"description": "A privacy-centric ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1463558260,
	"post": [
		{
			"post_id": 13,
			"title": "ZeroBazaar: A New Hope?",
			"date_published": 1463556608.1,
			"body": "On 4/20 it was announced on reddit that a new project to create a fork of OpenBazaar, to be called ZeroBazaar, had been started. The goal of this project is to get OpenBazaar to work on ZeroNet, while providing the anonymity and privacy that was promised with the original DarkMarket project.\n\nWhoever posted it on reddit posted it as the username ZeroBazaar, and posted a link to the GitHub repository in various subreddits. They did not answer any of the questions people had. Some commenters pointed out that there wasn't anything modified from OpenBazaar except the readme file, which read:\n\n\"OpenBazaar + Zeronet\n\nWe are actively working to add OpenBazaar in Zeronet.\nReclaiming Darkmarket Project\n\nDarkmarket\n\nThe original project share a vision of a community based uncensored freemarket. Openbazaar team fork the original project and after getting a fund they seemed to missed the point. Openbazaar does not share the same vision and after mainnet version was released the only thing they share is disappointment among the bitcoin and opensource communities. It is clearly that privacy and anonymization its not projects priority and the whole project was build in a protocol (rudp) that does not support tor or any other anonymization utilities. A freemarket cannot exist with a visible ip and indentities/activities easily associated with personnal info.\n\nThis projects aims to reclaim a community based project driven by community needs.\nZeronet vs Openbazaar\n\n    Network stability / Not stable yet\n    Offers anonymity via tor hidden services / Ip is not hidden\n    Seeding shop/pages(no single point of failure) / If you close app your store goes offline (ipfs still in pre-alpha)\n    Running offline (browsing) / Running only with internet connection\n\nDonation\n\nSorry we missed the 1 M funding. Support this project:\n\nBitcoin address 182ADPcoAsLHowUUAMkmfChDSvnmXkE7tW\nLicense\n\n    \"Privacy: I know who you are, I don't know what you do. Anonymity: I know what you do, I don't know who you are. Don't confuse these two!\"\n\n    -- klaus j zimmermann\n\n...but we want both.\"\n\nWhile the readme claims no anonymization service could work with the current protocol OpenBazaar uses, that is not actually true, as i2p is an anonymity network that people can use to download torrents through, using the same udp protocol that OpenBazaar uses. But that is beside the point, getting it to work over tor is still important. I sincerely hope people contribute to this project, I think it would be a huge asset to ZeroNet and help get more people to use it, and of course the economic freedom and privacy that would come with it. A lot of people question how serious the project is. I will be reaching out to the project and try to get an interview with the developers. Lets hope there are people dedicated to this project, and that it wasn't just some idea that came out of a 4/20 smoking session with no intention of working on it.\n\nIf you code and are interested, get involved!\n\nWhat do you think about ZeroBazaar, do you think it is a serious fork or just a pipe dream? Do you think a decentralized and private free marketplace will ever come to ZeroNet?\n\nSources:\nZeroBazaar - GitHub\nhttps://github.com/zerobazaar/OpenBazaar-Server/\n\nZeroBazaar = Zeronet + OpenBazaar \nhttps://www.reddit.com/r/Bitcoin/comments/4fmd31/zerobazaar_zeronet_openbazaar/\n\n"
		},
		{
			"post_id": 12,
			"title": "Is OpenBazaar Vaporware?",
			"date_published": 1459844333.7,
			"body": "OpenBazaar has officially launched and to me it seems like a huge let down, just a bunch of hype, vaporware. The project started as DarkMarket made by Amir Taaki in 2014 at a Toronto Bitcoin Hackathon but was forked into OpenBazaar by Brian Hoffman, which has ironically chosen to try to distance and insulate itself from darknet markets. Also ironically, within a day of launching there were postings for weed and child porn for sale, so it appears some people were fooled into thinking they could run a shop anonymously using it. Some people even think they can use it with tor, but the Tor Project itself warns about trying to use programs that use the UDP protocol with tor as not being a good idea.\n\nFor years people hoped the project would result in a truly decentralized anonymous online free market. But as long as it runs only over the clearnet, even with the use of VPNs, OpenBazaar will not truly be free. There does seem to be interest in getting OpenBazaar to run over i2p, and if that works out, that would be great.\n\nOB1 CEO Brian Hoffman said in an interview with Bitcoin Magazine that, \"What is the best way to bootstrap a decentralized, private marketplace without basically inviting all of the darknet marketplaces to just shift their stock onto this and scare the crap out of any potential normal user from joining OpenBazaar?\" Hoffman went on to say that they are putting off implementing a way to operate OpenBazaar over an anonymizing network like i2p or tor, saying, \"We’ve basically deferred it to a little bit later in the development process. This, we hope, will give us time to establish a baseline of nodes on the network and liquidity of items without overwhelming it with just darknet items.\"\n\nThere is a great poster of the UFO over a treeline with the words \"I WANT TO BELIEVE\" that is seen on the wall of Mulder and Scully's office on the TV series The X-Files, but instead of the UFO it is a picture of the OpenBazaar tent logo. I'm like Mulder on OpenBazaar, I WANT TO BELIEVE that OpenBazaar will turn into what we all hoped it would. But will the team developing OpenBazaar encourage it to happen soon enough? And if it doesn't end up living up to our hopes, then isn't it nothing more than vaporware? If so, hopefully someone will make a fork for use on the darknet.\n\nI WANT TO BELIEVE Poster: https://postimg.org/image/cgc9zfbpv\n\nSources:\nBittorrent over Tor isn't a good idea - The Tor Project\nhttps://blog.torproject.org/blog/bittorrent-over-tor-isnt-good-idea\n\nOB1 CEO Brian Hoffman Explains Levels of Anonymity in OpenBazaar - Bitcoin Magazine\nhttps://bitcoinmagazine.com/articles/ob-ceo-brian-hoffman-explains-levels-of-anonymity-in-openbazaar-1458059826\n\nBy the way, sorry the IPFS article isn't done yet."
		},
		{
			"post_id": 10,
			"title": "New .bit Domains for the Blog",
			"date_published": 1456662796.501,
			"body": "I will be posting the new article on IPFS soon, but in the meantime I wanted to let you all know that the site is now accessible through DividedByZero.bit and DividedBy0.bit! Huge thanks goes out to glock, who has been doing a great public service for ZeroNet and it's community by offering free .bit domains.\n\nAlso, I'd like to work on organizing the site better in the near future so you can easily click on a page with my contact info, PGP key, and cryptocurrency addresses. Instead of searching through past posts to find the info.\n\nReminder if you like what you see here and you have some cryptocurrency to spare, please support the blog by donating. You can send bitcoin to: 1KECR4gMLpKQvtH6CYcRhGT4CHMvZC9eMd\nWill get other cryptocurrency addresses posted soon, but until then if you want to donate dash, litecoin, or something else please drop me a note at dividedby0 on ZeroMail. Feel free to use the PGP key found at the bottom of the last post."
		},
		{
			"post_id": 9,
			"title": "Internet Killswitch Engaged (Again?)",
			"date_published": 1454780301.729,
			"body": "On Monday, January 11th, 2016, the US Supreme Court declined to hear a petition from EPIC, the Electronic Privacy Information Center. EPIC's petition asked the court to force the Department of Homeland Security (DHS) to release details of Standard Operating Procedure 303 (SOP 303), also known as the government's secret cellular phone and internet killswitch.\n\nEPIC's battle for information about the killswitch started in 2011, and while they weren't able to get the Supreme Court to force a release of the details of SOP 303, they were able to get some information during the legal battle against the government, including a heavily redacted copy of SOP 303. The redacted copy states in part that the purpose of SOP 303 is to provide \"detailed procedures for the National Coordinating Center for \nTelecommunications (NCC) to coordinate requests for the disruption of cellular service.\" According to SOP 303 the disruption or disabling of \"cellular service to a particular site or region\" may be requested \"by a designated federal/state/local law enforcement official or member of government...\" \n\nSOP 303 was approved by the National Communications System on March 9, 2006. The National Communications System was an office of the DHS, but was disbanded by Executive Order 13618 in July of 2012. According to EPIC, \"In a 2006-2007 Report, the President’s National Security Telecommunications Advisory Committee (‘NSTAC’) indicated that SOP 303 would be implemented under the coordination of the National Coordinating Center (‘NCC’) of the NSTAC, while the decision to shut down service would be made by state Homeland Security Advisors or individuals at DHS. The report indicates that NCC will determine if a shutdown is necessary based on a ‘series of questions.’\"\n\nThe killswitch was engaged for a period of 3 hours on August 11, 2011 at 4 Bay Area Rapid Transit (BART) stations in San Francisco. The cellular services were shutdown during a protest of the July 2011 shooting of a homeless man by a BART officer.\n\nIt is possible that the government may have used the killswitch again, this time during the standoff at the Malheur National Wildlife Refuge in Oregon. On Sunday, January 31st, Oregon Public Broadcasting (OPB) interviewed David Fry, one of four remaining occupiers, who told OPB that, \"the FBI made it so the occupiers can’t make outgoing calls on their cellphones,\" and that only his cell phone, \"can receive incoming calls, but that the other three in the refuge appear unable to receive calls on their cellphones.\" The occupiers also told OPB that they’ve lost access to the internet. According to TheCount.com, \"Supporters who attempt to call Fry end up reaching the FBI instead.\"\n\n It isn't clear if SOP 303 is being used or if the government is using a dirtbox or stingray-like device to hack the occupiers phones, whether with or without a warrant. It also isn't known if cell phone service has been tampered with for others that go near the area of the refuge.\n\nSources:\nEPIC v. DHS - SOP 303\nhttps://epic.org/foia/dhs/internet-kill-switch/\n\nStandard Operating Procedure 303 - Redacted\nhttps://epic.org/foia/dhs/internet-kill-switch/25.1-SOP-303-Updated-Release.pdf\n\nTermination of Cellular Networks During Emergency Situations\nThe President’s National Security Telecommunications Advisory Committee\nhttps://assets.documentcloud.org/documents/686341/sop-303.pdf\n\nBART San Francisco cut cell services to avert protest\nThe Washington Post\nhttps://www.washingtonpost.com/blogs/blogpost/post/bart-san-francisco-cut-cell-services-to-avert-protest/2011/08/12/gIQAfLCgBJ_blog.html\n\nFBI Blocking Most Lines Of Communication, Militants Say\nOPB\nhttp://www.opb.org/news/series/burns-oregon-standoff-bundy-militia-news-updates/fbi-blocking-lines-of-communication-militants-say/\n\nFinal Four Militia: FBI Killed Our Cell Phones\nTheCount.com\nhttp://thecount.com/2016/01/31/militia-fbi-cell-phones-shutdown/\n\n\nNew article on IPFS coming soon!\n\nPGP key for ZeroMail:\n-----BEGIN PGP PUBLIC KEY BLOCK-----\nVersion: GnuPG v2.0.22 (GNU/Linux)\n\nmQINBFavCtABEACTaMxGsOwqLfpbJmuegct8T1DG6gKBbWKL/8nSx47PxGwYDWti\n4vCfufCED6B7m7QLMRW7N7M6k7lpTw2d1cm3DRvs4dinTV6JEg3RpggaOCz2DLGL\nH70jr55lCkwkjzYi6fJGIZ14ufO/if6ZLDw32HqLL/muYDVMPMP1UEOVZlJAYcjG\n/8cpepH1C2zowfpjPrgyJBvsJO0ImMSiWmpBw+Wasf++Rk8DP1yhx8xTeSeSc9WN\nCpxue+P0QtZddmJIT3GYJxDdGJExU9w2aM1PY4qejWcK3g7J5P3DKkRj3F2h4dRu\n5MTCzJ23RaY1PyJp/shf9SPRVvXBte2eSBxVIt6l6G7LMP6iATevwTSDbJoCoiPF\nC0vJLObaBMQ0MdJFdeYHiGUZWlLMnF2HsUsTS5uB/xGitZ3mpzy96SklEAHsHJ91\n1WYfV2Z3gWe8wndys3ELj4zKo0muU6hY7BEyVWzW/iJvaczMD1YeHNzXD39u5vXD\nKLGRaBeZsTkEvjWdbtywPBIy/gX1AFq8z1WKj5P+fbZyNcqUP/HyntX5vpEnaS4D\nVx73gSgdi6wGSPCnOrkpV1tKO28qbtUsqa1Bu/PgTOogqf/1jDTaTvuu7AVQvx5H\ntLN1gaVG/bYwpeIg4Qp94b5uJa+Eb0hYZyKKzStd2tspEjZ/2ZflzLydDQARAQAB\ntCVEaXZpZGVkQnlaZXJvIDxkaXZpZGVkYnkwQHplcm9pZC5iaXQ+iQI5BBMBAgAj\nBQJWrwrQAhsDBwsJCAcDAgEGFQgCCQoLBBYCAwECHgECF4AACgkQx/XnNCAu/18s\nWw/+PqpWY/IyRWtgSMwI6ZV2D4VjGu2lHa6dlIVmq+/bcS9RehVjLEcy3IYYpO1V\nEfGvQ+/eVpIU76ztEnxT/4GkT24KdqSvBgAgR6QsMmFgto+vOYddbkyKC0jXpQxZ\nkbKzUNPftVMeOUCB8G+Ezc0VTkKn0dhoVLrpPImNifOc55sa/JjBHQ/98tGtbOyC\ndYWDMwGKI5B0uae0FUnv+sg7vcUNMJOTYwtKHhQJmk3wTtFbz6YddzHG9ldUQ/RV\nASW1WlLyPTtFnG/qFwOpIWt91UyNU8Na7bsb/5KbhvZkz3e0aGW2Gr0XsckeoQgn\nLK4PFtK+ijzbYBqYbhgqZbJ7AyeXidB6jHsXRfVDOxEP2HpqwLo2VQNlwNSfNRcL\nf1ph2E2EEByT35+r7TqQKaJsENF5mcAq5OSZtSaEz3IJkxLxs12KjzVULYiEtKy4\ngCcGGniZSPQPaG2zB6d10m8XtKkANHHdw7MIWQQ17FhjLSh/A9dRSTT28q+LHDEV\nKKdl7YAe6Jl8B2gWRWat0xQJoPiKFAISnsbWRvMlFUs6olIPgrwydYZwcIzRwLX+\nfmZYEYXfoT7bZm+dKkxKrkyebRs6X7ItSNSvAUr89rsHh/elKJ+cxd+xg9QU+2DJ\nCHOOnDfxO46fPpo+T0Nxb60ATskL+WCWuq560Lh6V78k4s65Ag0EVq8K0AEQALp0\nB0ZRj/BDlX4Eeu13vvhnJwVFTLMKHIEc0ok4Y3lOCRGU/XqrnoygKxYWTrLKNGjz\nVeSi1kQgNBLeDulC7cckPEcPVmOFn6vaOBHbnMo+2kTP6ypXSqb4NuKLThJylwoi\nnjaQTUSUH+xTu8hEYVuwDz6k/DMhbtztueAXi7U7etxTHrW9gxcDixZwAY+sMJiE\nB+n3R/4F34qOes5ycfrwRPlpDoUPgWbkrPoTIFKah2MOhdyzBRIAe1HSMNgRnLdP\nop4LC52OaN1kI+M7PFyA2jJoQ2fqDRDdHv1rOUH4qg3o0t+nBdgQGSL9fUGMcimB\nbM88e4O+Yd6CwNu6FOX+K+cLgCaWTNH6+da/IfddSD2YB26NBzNwg+RfswD92rBJ\ncRtMyNB/GAckY7HRhxUeau++z4RbgVyiAeLoWLTVUIjvNtjNYfDqGrAhZn0QcmVH\nzY2bFugPZt94DwLPGyKgENg/DF9Spjl6bAjjuL67JaARaxPiHEMk3BjU5igDwf+/\nDR/r07hrjekQHZ4o5E5AvRX68OuJCDV0Gvw2s1jnA+xnlP/MiTvR69lr4/NMNBot\nBOl4Q8Bg1KzQXEWzl7BNsKfUQPTZga5ImPHsYG0ALSrR2JHdc9GtS6OrYGKVhP3o\nctTob1JFT7ZLEYehNPn1Lj92xU/64Wbs3tvSCzsLABEBAAGJAh8EGAECAAkFAlav\nCtACGwwACgkQx/XnNCAu/1+3lQ/+JqdXX94wwIoghD/FM0cKjCdL/PTP6HTgwFlZ\nncRiBYnw3zwTTC+dXeKlaBwF2X3HlcmlDMEpqLKhnLHm+LX+cQ1V0HP7wHknUgar\n24pMO11ZzET0u0C+Brxs0KKtgxzluqh5VVhmUpsKYTFIfNFd2BKh1AaEy6fsHKg7\n6UTjDr/vFIscpIguuc6jvxrI5dflx3bMTZvQ/ScFuZ9yQGpmObBzotm9lz44a9Xg\njkUAO9DtjU6G5fJns+YO9ERNG7sbzrKE5H8ToiaBOhr5Cq3D/bjlSCHrbnovumls\n+vnY5K4ny1mAsJdVQ9Nfbbs6bKCpSV95Y1cIGoquRBUZdaXEf0NEgsTvJd+E0Naq\n0JoW48VH6Jx3lPML1CVoAbhyVOiJgCy7j4Lssz6v/7dnsljwtJ278/qjis5U2inF\nz4r6cDbGiy5WRXDVcOjsd79bYAXTyNiTEk73U3/vhR40L/pCT8fx9Jx5q5Agkome\nvipKsxKyBudw8FMHX3Tfgvx5cLqg1EZiVNaBDkTJoE1Z2qO4OCemN4H5XWNBcV7t\nF4IIROZ/AXhUr1pHO7E/jWRRkotcIPa5efZedBpxVwLMGP++qtluaJmtVPoazpw3\nA3JZaWBpcXiPJRR9ik+K1r6NpgL18at2LuNhdA+UhAhsy2KMmWziDIFqKr/v3t9s\nHdbhlCU=\n=4N//\n-----END PGP PUBLIC KEY BLOCK-----\n\n"
		},
		{
			"post_id": 8,
			"title": "ZeroNet Update & What Do You Want Here in 2016?",
			"date_published": 1452678301.497,
			"body": "With the new version of ZeroNet (0.3.5) there is now a new recommended way of using ZeroNet with Tor. Use zeronet.py --tor always\n\nI also want to wish you all a belated Happy New Year! New articles should be up this week. What kind of topics and stories do you want to see on DividedByZero in 2016?\n\nR.I.P. David Bowie"
		},
		{
			"post_id": 5,
			"title": "Digital Defeatism",
			"date_published": 1450084044.357,
			"body": "There seemed to be a lot of digital defeatism in the news this week, with Wikileaks founder Julian Assange and Pirate Bay co-founder Peter Sunde claiming defeat in the fight for privacy and an open internet.\n\nAssange Urges Public to Stop Holding onto Privacy \n\nIn a panel on security and surveillance on the RT network, Assange said in response to the topic of \"Security or Surveillance: Can the right to privacy and effective anti-terror security coexist in the digital age?\" that, \"In thinking about this issue I want to take quite a different position, perhaps, from what you would expect me to have taken… I think that we should understand that the game for privacy is gone. It’s gone. The mass surveillance is here to stay.\" He continued by adding, \"Mass surveillance is already being implemented not only by major world powers, but also by some medium and small-sized countries,\" and that \"[privacy] will not be coming back, short of a very regressive economic collapse, which reduces the technological capacity of civilization.\"\n\nAssange said that privacy is among values “that simply are unsustainable … in the face of the reality of technological change; the reality of the deep state with a military-industrial complex and the reality of Islamic terrorism, which is legitimizing that sector in a way that it’s behaving,\" and went on to encourage the panel as well as the general public to \"get on the other side of the debate where it’s going\" and stop holding on to privacy.\n\nPirate Bay co-founder Peter Sunde Has Given Up on the Fight for the Internet\n\nIn an interview with Motherboard, Pirate Bay co-founder Peter Sunde also had some pessimistic defeatist remarks, saying, \"Well, I have given up the idea that we can win this fight for the internet. The situation is not going to be any different, because apparently that is something people are not interested in fixing. Or we can't get people to care enough. Maybe it's a mixture, but this is kind of the situation we are in, so its useless to do anything about it. We have become somehow the Black Knight from Monty Python’s Holy Grail. We have maybe half of our head left and we are still fighting, we still think we have a chance of winning this battle.\" \n\nHe said there was \"nothing\" that could be done to change this, and that he \"would rather not care about [the fight for an open internet] myself. Because it’s very hard to do something about it, and not become a paranoid conspiracy person. And you don’t want to be that. So rather just give up. That’s kind of what people have been thinking, I think.\"\n\nSunde says we are at the point of no return, saying, \"No, I think we are at that point. I think it’s really important people understand this. We lost this fight. Just admit defeat and make sure next time you understand why you lost this fight and make sure it doesn’t happen again when we try and win the war.\"\n\nFortunately, those of use who believe in the right to privacy and internet freedom aren't going to give up as easily as Assange and Sunde, I know I don't intend to.\n\nSources:\nRT - Dec. 10, 2015 - Game for privacy is gone, mass surveillance is here to stay – Assange on #RT10 panel\nhttps://www.rt.com/news/325524-assange-privacy-rt-10/\n\nMotherboard - Dec. 11, 2015 - Pirate Bay Founder: ‘I Have Given Up’\nhttps://motherboard.vice.com/read/pirate-bay-founder-peter-sunde-i-have-given-up"
		},
		{
			"post_id": 4,
			"title": "New Site Address",
			"date_published": 1449561221.379,
			"body": "The old address no longer works, now that I have things sorted out the new address is: http://127.0.0.1:43110/1AyL9MfHbV8nxPBmZpocuVZ6d2JixUPTdv\nPlease seed, thanks!\n\nAlso, feel free to donate some Bitcoin to a starving privacy enthusiast by sending ANY amount greater than 0 to: 1KECR4gMLpKQvtH6CYcRhGT4CHMvZC9eMd\n\nIf anyone wants to contact me you can reach me through Bitmessage @ BM-NBAxCXNm2u7zxdxn7PT4xrXzbvwVSQ9m"
		},
		{
			"post_id": 3,
			"title": "Freenet Users Deanonymized",
			"date_published": 1449561168.697,
			"body": "Freenet, a peer-to-peer network that has been around since March of 2000, and has always been touted as censorship-resistant. It is written in Java and provides a decentralized platform to host websites. Back in 2013 when the Tor hidden service FreedomHosting was attacked and arrests were made, as some of the site's hosted by FreedomHosting hosted child porn, Freenet's website claimed that \"This ... could not happen on Freenet.\" Well it appears that it has happened on Freenet, and has been happening since at least 2011, which means people were being deanonymized at the time the Freenet site was writing that such a thing couldn't happen on Freenet. According to the Grand Forks Herald, and Hacker10, users of Freenet were deanonymized by law enforcement in North Dakota.\n\nFrom Hacker10:\n\"Court records related to Paul Bradley Meagher, a University of North Dakota police officer arrested for downloading child porn from the “anonymous” peer to peer network Freenet, reveal that the North Dakota Bureau of Criminal Investigation had been running an undercover operation in the network since 2011, planting their own nodes inside Freenet to be able to log people’s IPs and trace the final destination of users downloading illegal material.\n\nThe Dakota student news site relates how Investigating Officer Jesse Smith managed to get hold of Paul Bradley’s laptop still switched on and running Freenet on the Wifi network, law enforcement discovered child porn images during the preview before seizing the laptop, arresting the suspect, whom, at that point refused to talk with the investigators. Paul Bradley has now been charged with 10 counts of possession of child pornography and can be sentenced to up to 5 years in prison for each count, facing a possible 50 years in jail.\n\nThe Grand Forks Herald from North Dakota cites detective Jesse Smith in the affidavit as admitting to her department running nodes in Freenet to be able to track people downloading files included in a list of known child porn file hashes from the police database.\"\n\nHacker10 goes on to note that in 2014 ICAC, the Internet Crimes Against Children Task Force, ran a Freenet workshop for law enforcement to present what they called the \"Black Ice Project.\" According to ICAC's website the workshop \"will describe the basic functioning of Freenet, how persons exchanging child abuse material, the system’s vulnerabilities and how the Black Ice project exploits them.”\n\nHave you used Freenet? Do you trust it more than Tor or i2p? For those of you who wish to check out Freenet without downloading the software, Sigaint, a tor hidden services provider, has their own Freenet gateway that can be accessed on tor here: http://freenet7cul5qsz6.onion\n\nSources:\nHacker10 - Police plants own computers in Freenet, log IPs, makes arrest\nhttp://www.hacker10.com/internet-anonymity/police-plants-own-computers-in-freenet-makes-arrest/\n\nGrand Forks Herald - Child predators use technology, but law enforcement does too\nhttp://www.grandforksherald.com/news/crime-and-courts/3885134-child-predators-use-technology-law-enforcement-does-too\n\nFreenet - 2013-08-05 - Statement on the recent Freedom Hosting (Tor) bust\nhttps://freenetproject.org/news.html#2013-tor-bust"
		},
		{
			"post_id": 2,
			"title": "Welcome",
			"date_published": 1449560867.645,
			"body": "Welcome to my blog, I plan on adding much more soon. Just testing things out first.\n\nWhat will be covered on Divided By Zero?\n-Cryptocurrencies\n-Darknets\n-Encryption\n-Steganography\n-The philosophy of liberty"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}