{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1565239855,
			"title": "How do i reset a whole site?",
			"body": "I did update the 08ch code to current millchan version, like threads in /tech/ suggested, because on millchan i am able to post pics while on 08ch i am not.... and this messed up my shit, i couldn't publish anything anymore because of >Content publish failed with every connection on publishing getting a Timeout error in the zeronet log.... so i reverted back to the backup, and it still didn't solve the issue... so i deleted the whole data/blablabla folder of 08ch, and now i can't access it, probably because of \n>KeyError: 'content.json' in UiWebsocket.py line 194 that pops up in the log.\n\nJust fuck my shit up",
			"added": 1565239854
		},
		{
			"topic_id": 1565287005,
			"title": "No filesharing site?",
			"body": "So you are telling me that you built a whole decentralized www using P2P technology and there is not a single filesharing site?\nI would have expected something like thepiratebay, just without proxysites that regularly get taken down and without spyware and without the need of a BitTorrent client.\n\nEven a 1:1 copy of thepiratebay, where you still use a BitTorrent client, would be great",
			"added": 1565287003
		},
		{
			"topic_id": 1565289153,
			"title": "How do i get a new identity address?",
			"body": "I can change it, i can get a new one when i visit a new site, but i can't delete it and can't just create a new one without going to a new site.\nOr am i just retarded?",
			"added": 1565289150
		},
		{
			"topic_id": 1565758451,
			"title": "My Minecraft Dolphins died again, after 3 days",
			"body": "my previous dolphins always died within 10min, so it got at least better...\nidk what their issue is, they were in a big aquarium with air above, some coral, fish and a conduit inside.",
			"added": 1565758447
		},
		{
			"topic_id": 1565922813,
			"title": "Normie Safe Space",
			"body": "Group for normie talk, no meanies allowed, no racism, homophobia, transphobia or misogyny.\nRespect each others feelings, don't offend anybody, use correct pronouns.",
			"added": 1565922808,
			"type": "group"
		},
		{
			"topic_id": 1565922890,
			"title": "Gender is on a spectrum",
			"body": "Science agrees. People need to accept that.",
			"added": 1565922884,
			"parent_topic_uri": "1565922813_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W"
		}
	],
	"topic_vote": {},
	"next_comment_id": 28,
	"comment": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 1,
				"body": "> [plasm](#comment_2_129uWu4oE98C98BFC2GoJGSq51RetSBP4f): hopefully you are correct.\n\ni am here to stay, faggot\n\nNo, honestly, when i saw that its some python script, i didn't think that this would look so good, but it does. Respect to you guys for launching something like that.\nJust that the Tor settings aren't on \"Always\" per default and you potentionally let everyone who browses something that you browse without Tor know your IP, is a huge privacy issue. Should make something like a huge note that this can happen and a big recommendation for usng socks proxy or tor on Always.",
				"added": 1565190517
			},
			{
				"comment_id": 2,
				"body": "Even more scarry is that the new CDN they used got shut down by their infrastructure provider.\nWhile every site can choose another CDN or run without CDN and you can switch as fast as a DNS update gets distributed, you can't do anything when some public company on the backbone decides to shut you down.\n\nBasically the only way to get a internet without getting randomly censored by some company for something that you did that's not even against the law (the shooter posted his manifesto on instagram first, so why not shut that down too, while you are at it?) is to lay your own cables or go full ham radio autist.\nHaving to cuck yourself with Tor + proxies + p2p hosting and all those issues and honey pots just to escape that is dumb and then you get yourself fucked through association because some fag distributes child porn and you weren't fast enough with closing it.",
				"added": 1565191122
			},
			{
				"comment_id": 3,
				"body": "is there some site where i can check my IP that i use to connect to other peers?\nSo that i know that i know for sure that i am behind tor without my IP leaking for non-tor users?",
				"added": 1565191440
			},
			{
				"comment_id": 4,
				"body": "> [anonkraut](#comment_4_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh):\nThank you, got it.\nOne more question:\nPer default the P2P connections run through tor hidden service, except to peers that do not use Tor, if i set the Tor settings in zeronet to \"Always\"... what exactly happenes now to connections to peers without Tor?\nIf they don't use Tor, they can't connect to my Tor hidden service that zeronet uses, so all connections to them are established from me towards them?\n\nIs there some documentation where i can read how that specific case from tor to non-tor works?",
				"added": 1565192977
			},
			{
				"comment_id": 5,
				"body": "Small personal blog post:\nSo i got now all settings correct and i can't see a single connection from zeronet in netstat that doesn't go through  the Tor Browser tor instance.\nSeems  like i don't run into the risk of getting into jail for hosting cp now, just because i accidentally clicked on something where a retard posted cp.\n\nThanks bros, its awesome what you built here, and it was easy to setup.",
				"added": 1565197103
			},
			{
				"comment_id": 6,
				"body": "Btw. this really reminds me of the times when ham radio was a thing. \nAutists doing their own thing so that they don't rely on old shitty telephones.... or just because they can.",
				"added": 1565197551
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 7,
				"body": ">the normies\nare just on the internet to post some pics on facebook, instagram or twitter, they don't use other sites anyway.\nEven on the clearnet, they are all limited to a handful of big platforms, not able to leave.",
				"added": 1565199443
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 8,
				"body": "but it should have",
				"added": 1565238735
			}
		],
		"1565239855_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 9,
				"body": "nevermind, somehow it works not",
				"added": 1565241282
			}
		],
		"1565289153_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 10,
				"body": "> [223556](#comment_35_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): yesfirst google result, lmao\n\nAnswering the question would have been less effort than posting what you just posted.\nSo thanks for nothing.\nMultiuser plugin doesn't work when using TorBrowser btw., if you meant that.",
				"added": 1565294267
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 11,
				"body": "Post-pubescent but under eight-teen is just 16 or 17. With maybe 15 depending on the girl.\nIf it's truly consnsual, meaning that its not some prostitution-like scenario and not a repeated case with different girls, i don't see much of a problem with it.Turning 18 is not some magical moment where you turn adult from one second to another and suddenly be super responsible.\n\nWhat Epstein did is pretty much prostitution, none of those girls did it because they thought that hes hot and he got their panties wet, and he needed fresh meat again and again... sick fuck should hang.\n\nIncest with your daughter is always sick, there is no excuse. There are no fringe cases.",
				"added": 1565831390
			}
		],
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 12,
				"body": ">You want to save your people? Make tons of them.\n...besides that it's obviously a key-part of it.... you can not do competitive breeding against niggers in Africa or Chinks or Pajeets. Especially not if you are the only self-hating nation that actively imports the others to give them gibs for breeding and then provides free medicine and food for africa so that they savely reach the one billion nigger mark. Africa for niggers, Asia for Asians, Europe for everyone.\nSo you breed 6 children and work your ass of while your taxmoney pays for 12 refuggees and 50 niggers?\nYou are just postponing the problem and creating more golems for the jews.\n\nI am really getting more and more used to the idea of Accelerationism. Making everything crash and then rebuild is better than letting it slowly rot to a point of no return.",
				"added": 1565850022
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 13,
				"body": "> [wejehteman2](#comment_22_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): /Shrug. You just don't know who I am and the values I have. I'm a true reactionary. I don't fundamentally oppose society having elites. I don't oppose the strong dominating the weak. They want me to be their slave? I'm not that offended by that because I also want them to be my slave. They starved to death hundreds of millions? Yea that's pretty shitty. I don't know if I could do the same to them. But I have the wherewithal to recognize that that's probably weakness on my part. A crocodile doesn't stop to contemplate the feelings of his meal, he just conquers. You aren't human in their eyes? Are they human in your eyes? Why hate someone for something you are guilty of yourself?  [...]\nToday on \"stories that never happened\".\nWe had this discussion just a few days in another thread, and already before that. But i guess it gets ignored because that would destroy your strawman, so people like you rather hide in delusion.\nAnyway, to explain that again... just so that you can ignore this like all other fags with those strawmen...\n\nWhat even do you think is your concept of superior race? If there is a muscle man who can press 180kg, an athlet who can run a marathon in 2:20, an autistic nerd who can solve every math problem without pen and peper but cant form a coherent sentence and some socially skilled guy who founds a cult where he can fuck all female members... who is the \"stronger\" one?\nHitler did shake hands and congratulated the nigger Jesse Owens, something that not even the people from Jesses own country did.  So you might think that NatSocs do know very well that there are different disciplines where you can be good or bad and that different races have different strenghts.\n\nbtw. did you know that NatSocs considered pretty much half or Europe Aryan? And of course also Persians and even some Pajeets?\nSurprised by that? Maybe you should read a Hitler speech to find out what they meant by \"master race\". In Mein Kampf Hitler wrote about how its their duty to construct a \"master race\" via eugenics... but not that they actually considered themselves to already be the master race.\nHere have  a collection of Nazi propaganda https://research.calvin.edu/german-propaganda-archive\nYou can find speeches about women about jews, about the media, about reforms... everything. You have the publications of \"Neues Volk\" and \"Volk und Rasse\". Do you find a mention of \"master race\" there? In fact, Nietzsche alone used the term \"master race\" more often than i can find it in the whole Nazi propaganda combined.\n\nAnyway, after that short introduction....\nJews didn't get into power of the media and finance because they were so smart or superior.\nThey got there because after they lost Israel (because they sperged out about wanting to mutilate babies) they got scattered across all Europe, but they didn't mix, they did stay withing each other and still stayed in contact with each other internationally. And within that international network you can transfer informations. Jews where the first international postal service. And information is power. The Rothschilds did know the outcome of battles in the napoleonic wars before the governments of the involved countries knew it and used that information to fuck the market and be an incredible leech. And in which branches can you be successful with international informations? Right, finance and the media. The very branches where jews are present.\nAnd while a good network of communication and information did give them a huge advantage in the middle ages, it isn't relevant anymore since telegraphy is a thing. The accomplishment that they once had is gone for over 2 centuries now.\nEverything that came later is solely based on nepotism. You can just replace a jew with a jew, nothing else is allowed, it has nothing to do with being superior, its called being a leech. All other dynasties sooner or later started to assign their successors based on skill which eventually got different people there. Thats not a thing for jews. They rather see everything crash and burn thanks to some incompetent jew leadership than actually assigning someone by skill.\n>I asked him why don't the white supremacists get together and help each other take over Hollywood, the media, et cetera. He said it's impossible, the Jews are too smart and it's too late.\nAnd i never saw any NatSoc saying that, just your strawman does that.\n- To be successful as a media company, you have to have access and connections to news agencies and you rely on public funding and make your money with ads and propaganda. This means that you can just be successful if you are already successful.... or you start in the internet and be confronted with all the mainstream media combining their force to take you down and label you as fake news.\n- You can not launch a bank or financial institute without having a jewish owned central bank above you, so the path of  working yourself to success isn't even available here. The only one who has the power to remove jews from banking is the governent. Good luck on trying to get people in power who abandon our fiat money bullshit and actually deliver! Remember that our current system got established during huge financial instabilities during two world wars. So you will probably need another World War to even get the chance to change something there.\n- Even the non-jewish part of Hollywood (if it exists) is based on who can shag the most kids. It's not just the jewish nepotism that makes sure that nobody else can be there... it's degeneracy in general. Sex sells. You will never have anyone in power there who has any moral standards as long as degeneracy produces the most money there. In order to fix that, you have to make child fuckers and prostitutes a social tabu again with serious consequences for everyone involved, and not just for one scapegoat.",
				"added": 1565921933
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 14,
				"body": "what did he even mean by PHP library?\nServer-side scripting and decentralication doesn't really fit together.\n\nOr did he mean a library so that he could connect to zeronet, i.e. to make a bridge from e normieweb site to a zeronet zite?",
				"added": 1565922408
			},
			{
				"comment_id": 20,
				"body": "> [redlibertyreal](#comment_55_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw)\nI'd just like to interject for moment. What you're refering to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.\n\nMany computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called Linux, and many of its users are not aware that it is basically the GNU system, developed by the GNU Project.\n\nThere really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called Linux distributions are really distributions of GNU/Linux!",
				"added": 1565948211
			},
			{
				"comment_id": 21,
				"body": "> [redlibertyreal](#comment_55_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): as long as they are here they won't infect Freenet or I2P\nFreenet is for niggers, just like anonet.\nGo I2P or go home.",
				"added": 1565948511
			},
			{
				"comment_id": 24,
				"body": "> [xcape2net](#comment_309_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've been thinking we should make a ZeroTalk clone where everyone who is tired of the racism and meanness can hang out.\n\nI have already made that for you:\n##Normie Safe Space\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1565922813_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W/Normie+Safe+Space",
				"added": 1565952585
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 15,
				"body": "# FUCK NIGGERS",
				"added": 1565922502
			},
			{
				"comment_id": 16,
				"body": "> meme arrow test",
				"added": 1565930732
			},
			{
				"comment_id": 17,
				"body": "> god damnit\n\\> test",
				"added": 1565930753
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 18,
				"body": "ZeroNet is a platform of peace!",
				"added": 1565934885
			}
		],
		"1565925621_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 19,
				"body": "You do not upload those files to other peers immediately, you can verify that in your own bandwidth usage.\nBut i guess that if someone is online who has \"Download and help distribute all files\" checked, he will automatically download and seed your shit as soon as he gets the announcement that you seed something.\n\nBut thats also just my stupid guess, some explaination from some insider who knows his shit would be nice.",
				"added": 1565943071
			}
		],
		"1565942944_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 22,
				"body": "Ok, i will try some small criticism....\nfirst of all, you write a lot of text that is out-of-place there. You could have skipt the whole first section. It is a blog post, so bias is implied, there is no reason to write \"This is my commentary\", \"my thoughts and ideas\" and similar stuff.... or you would have to add that on every single post you write. And stay on topic and keep your general ideology talk out of it, if i like what you write and want to know more about your bias or aspirations, i can click on an About page or other links that you set on top.\n> This piece is both a general analysis of what is happening as well as an attempt to say what I think is in the people’s best interests\nNot so good, split that apart. At least the basic \"information at top, personal oppinion and suggestions at the bottom\" will do.\n\nAnyway... to the text itself....\nYou are already starting with the premise that the violent protestors are \"the people\". Which is always a very dangerous stance to take.\nThe last ten recent riots of that kind that i can remember always turned out to be just foreign baked terrorists, nothing more. LITERAL terrorists like Azov battalion, the Muslim Brotherhood, ISIS, Al-Sham, Al-Nusra, and other Al-Quaeda daughter groups. When i read your text, it reminded me on how our media did glorify the arab spring and was celebrating those democracy loving protesters in Egypt, Libya, Ukraine, Syria.... well, i don't have to explain how that one turned out, do i?\n\n> There must be a complete withdraw, a complete rejection and renunciation of the extradition bill\nThere is, the indefinitelly suspended thing was in June, it got declared as dead in July.\nThe argument that they still might silently pass it through is a none argument, because even if they would burn all documents about it, you could still say \"but they might write it again under another name and pass it through\" (something that the EU loves to do, but thats another thing).\nThing is, all those compromises of the government, basically doing exactly what they demand them to do, do not stop the protestors from roaming through the streets and destroying stuff. Getting what they claim to want doesn't stop them in the slightliest.\nNow, does that remind you of something?\nEuromaidan maybe?\nWhere the rioters claimed to be upset because of the EU shit getting partially abandoned because the EU did write military partnership bullshit in the contract which is literally not possible to sign without breaking laws...\nYanukovych did what they wanted and offered more negotiations and deals with the EU.\nThen the rioters said that this isn't actually what they want, they want new elections.\nSo Yanukovych announced early elections in 3 months or so.\nThen the rioters couldn't come up with any more reasons and didn't want to risk a fair democratic vote, so they stormed the Rada with weapons, installed their own puppets and then said that there will be elections in 6 months, but just with political parties that they allow. And so on...\n>Muh capitalist media\nthe mass media is all supporting those riots, just like they supported the Arab spring...\nAnother sign that you should be careful and question your rioters a bit.\nObviously some foreign governments are very invested and interested in those.",
				"added": 1565951996
			}
		],
		"1565951931_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": [
			{
				"comment_id": 23,
				"body": "There is the multiuser plugin that you can enable in Hello-Page -> Three dots -> Plugins. This plugin then manages the IDs with cookies and allows you to remove one and reuse another one or just creating a new one.\nBut this plugin is not so good if you use a browser that doesn't save cookies.\n\nAlternatively you could move/delete the data/users.json file in the zeronet folder. This file holds your IDs. If its gone, you can create new IDs.",
				"added": 1565952358
			},
			{
				"comment_id": 25,
				"body": "> [trevorlaneray](#comment_51_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Wait, if the multiuser plugin uses cookies to manage identities, does it export identities from users.json to cookies, but not use the users.json file once you start using it?Or does it keep users.json file up-to-date with the cookie-based identities you create and manage?\n\nAs i tested it, it ignored the identities from users.json completely and didn't update it. The multiuser plugin requires you to copy the key and store it yourself somewhere in order to reuse old identities.\nI guess the thought process behind that plugin was to move the id management from the file to cookies.",
				"added": 1565953698
			},
			{
				"comment_id": 26,
				"body": "well, my experience with the multiuser plugin (on tor browser, wich rejects tracking cookies and stuff) was that i lost all identities and that it wouldn't remember them and that i couldn't even turn off the plugin, because the Plugin site would give me an invalid private key error.\n\nSo my experience doesn't count very much.\n(just remember that you can manually turn it off by removing data/plugins.json in case that this happens to you)",
				"added": 1565953863
			},
			{
				"comment_id": 27,
				"body": "I have to add that all other people that i saw who tried it (at least three) didn't report any problems with it.\nI am ok with moving/deleting users.json, so i didn't play too much with the plugin after it gave me an horrible experience when i first tried it.\nIt could have just been some super obscure special case... but imho it does make sense that a plugin that uses cookies would not work very well if you don't save cookies.",
				"added": 1565954385
			}
		]
	},
	"comment_vote": {
		"11_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	}
}