{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1567696867,
			"title": "Can't use ZeroNet after selecting 'Help Distribute All Files'",
			"body": "I selected *Download and help distribute all files* on a couple zites via the slider and now ZeroNet is reduced to a crawl. For me to be able to make this post, I had to restart ZeroNet, quickly browse to the *Files* tab and untick *Help distribute all files*, but this seems to be undone the second I try to access the zites. I've paused them from the drop menu and try accessing them when ZeroNet had no internet connection to no avail. What can I do to mitigate this issue?\n\nAs an addendum, I'm using TOR on Tor browser to access everything.",
			"added": 1567696866
		},
		{
			"topic_id": 1572293998,
			"title": "Tor Browser 9.0 removes \"no proxy for\" setting",
			"body": "I updated Tor Browser and found myself unable to browse ZeroNet, seeing as the \"no proxy for\" function was removed. How do I work around this?",
			"added": 1572293996
		}
	],
	"topic_vote": {
		"1567661456_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1567569304_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 1,
				"body": "> [nekololi](#comment_385_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i came here to say this\n\n> [caryoscelus](#comment_226_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): uMatrix [...]\n\nYou want to mislead Tor users into thinking that using an extension helps with anonymity? Every extension presents the opportunity for fingerprinting. This is bad advice.",
				"added": 1567616077
			}
		],
		"1567696867_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK": [
			{
				"comment_id": 2,
				"body": "> [styromaniac@kxoid.bit](#comment_162_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Are you low on storage?\n\nNo. I still have a lot of space on my hard drives. Funnily enough, checking in the files tab, it seems that ZeroNet barely downloaded any optional files. Makes no sense to me why it's struggling to operate with the zites unpaused. I was only connected to roughly 1000 peers as well. Nothing out of the ordinary for ZeroNet usage.",
				"added": 1567697230
			},
			{
				"comment_id": 3,
				"body": "> [publicality](#comment_59_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): maybe start again from a new install?copy the users.json from data/ to the new install and you're good to go\n\nYeah, I think that's the way to go",
				"added": 1567697466
			},
			{
				"comment_id": 4,
				"body": "> [publicality](#comment_60_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): hope it works :3\n\nYup it worked. I can access ZeroNet lag free \\o/",
				"added": 1567699522
			}
		],
		"1567701213_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 5,
				"body": ">Allow commentary like on the guardian\nYes, because the Guardian is well known for allowing comments. They certainly didn't remove the comment feature from most of their articles, only selecting what they allow people to respond to directly.\n\nIf what you *actually* meant to say was nested replies, then I can get behind that idea.",
				"added": 1567701561
			}
		],
		"1567851023_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 6,
				"body": "> [styromaniac@kxoid.bit](#comment_166_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Instructions unclear; made turkey dinner instead.\n\nMy condolences.",
				"added": 1567894834
			}
		]
	},
	"comment_vote": {}
}