{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I remember like, oh shit, 10 or so years ago, I used to use a username along the lines of 'Mr. Pedo' (I was 13). I got contacted on Skype one day by a guy asking if i would like any Child Pornography. I jerked him around a bit finding it extremely suspicious since he kept asking what my career path was, how i obtained my Pizza no Toppings, and just other weird stuff. I'm honestly surprised any people get caught by these glow in the darks.",
				"added": 1575587411
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 2,
				"body": "> [thorburn](#comment_15_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Since when did rubbing your tiny cock while watching other people fuck on a computer screen amount to having your free speech infringed? What enlightening message do you think those porn stars are going to convey to you between pants and groans? What words of wisdom are you going to share as you wipe that dribble of spunk from your flaccid member, while sitting in a basement up to your knees in discarded crusty Kleenex?    [...]\nFree speech isn't about the content of the speech, its about being able to say it even if its a bad idea. for what its worth, i agree with the sentiment that porn is garbage and we're better off without it. That being said, it should be allowed anywhere that promotes the concept of 'free speech'. What Gab is doing is purely right-wing purity spiraling. Gab is shooting itself in the foot on this one.",
				"added": 1575770817
			}
		]
	},
	"comment_vote": {
		"65_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1259_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"46_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1400_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"447_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1
	}
}