{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "My wish, a simple seed server option to get guaranteed bandwidth, and uptime all sites and files in ZeroNet.Especially for large files.\n\nA seed server (automatic download) function in low seeded files less than 5 seeder for more bandwidth and guarantee (files, sites) uptime would be useful in the cilent. Its would be useful if a file have less than 5 seeder.\n\nThe fuction looks like this: \n-ZeroNet users can operate a seed server with limited disk space.\n-The publishers can upload files and zites to this disk space.\n-The publisher or user can use the file or zite link to start it upload to the seed server.\n-Its look like this Publisher+seed servers->user\n-if the file copletly downloaded the leechers, or have more than 5 seeder  are  automatically deleted from the seed server,servers.\n-1 file can uploaded to 5 active seed server all user who have the current file,zite.\n\nIts would be useful zites like decentralised youtube,intergalactic file server,Zero Up,. Its just need use the file or zite link to start the upload to the seed server. With a similar function in the zeronet can grow more bigger services. Smaller users, with low resources can create and operate major pages.\n\nEspecially for larger files would be a guaranteed uptime and bandwith. The operation of the servers would be more efficient and cheaper.The TOR technology can protect the seed servers. \n\nAll the technologies in the zero system available to make such a function like this.No external technology integration is required in the software.\n",
			"post_id": 125,
			"date_added": 1520527199
		},
		{
			"comment_id": 2,
			"body": "If i close the web page in the browser like decentralised youtube or intergalactic file server large files downloading are stop and not contiune.Its not download the file if a user who have the current file  later will be online,if the download started but the page closed.It is impossible to download anything to Zero Up,decentralised youtube,intergalactic file server and decentralised video streeming sites this way.",
			"post_id": 127,
			"date_added": 1520926544
		},
		{
			"comment_id": 3,
			"body": "The biggest problems what i found.\n\n1.,I tested the ZeroNet system large file protocoll.Specifically,with video streeming in zites like KopyKate Big. The biggest problem is that the file transmission protocol is working wrong! Not support correctly the users who are get online and offline time by time.If i close the browser or the current site in the browser the program protocoll not contiune the started downloads.The ZeroNet program are running but not contiune the downloads. The transfer of larger files is not finished with the current setup.In the zites have the same problem. If does not have a user in the current time who seed the files or zites.The program will not try to download it down later when a user will be online who have the current file. Greater investors who want operate larger websites in the ZeroNet system will leave, if it will not be fixed! \n\n2.,The secondary problem the files are not continuously available. Its must be set up a protocol what gives a stable bandwidth and uptime. The simplest way to do this the users must will automatically download the low seeded files too keep it  fix seeded.I think minimum fix non stop 5 seeder/file need to get a fix Non Stop uptime+bandwidth.\n\nThe problem of the current internet costly server sustenance, continuous server uptime problem. What about home computers no deal.The problem with ZeroNet the down and uploads are not finished correctly.\n\nIf these two problems fix the ZeroNet  developers, will be a competitive alternative the payed non stop servers.\n",
			"post_id": 125,
			"date_added": 1521376071
		},
		{
			"comment_id": 4,
			"body": "When i close a site the program are not contiune the files download.And not contiune to search peers if the current time nobody seed the current file.But later will be someone online and start seed the file.In big files like videos in KopyKate impossible to download and seed larger files this way.Some sites are not avaible in 24 hour and have only one seeder.It would be good if i close the browser would still try to download it later.Most larger optional/big files have this way low seeder,unavailable,or the upload are does not working.",
			"post_id": 128,
			"date_added": 1521734304
		},
		{
			"comment_id": 5,
			"body": "Elmondom Magyar nyelven a véleményem mivel a fejlesztő is magyar. Nem régen ajánlottam ezt a szoftvert a nyílt weben és szó szerint kinevettek. Akiknek ajánlottam egy célközönség volt és látszott rajtuk hogy minden megtalálható az interneten és nincs miért felrakniuk a szoftvert. Egy látogatott oldalon teszteltem adott célközönséggel. 1 nap alatt kb 120-an/nap látták a bejegyzést, mind olyanok akik szeretnek filmeket nézni a neten. A weboldalt több ezer Magyar filmrajongó látogatja napi szinten. 3 napig ment a gép folyamatosan hogy elérhetők legyenek a fájlok és senkit nem érdekelt a dolog.\n\nHa a nyílt interneten nem lesz elérhető a tartalom olyan módon hogy a szoftver letöltését az oldal betöltésénél jelzik hogy telepítsék a látogatók. Esetleg még mint a torrentnél ahogy ezt apró torrent fájlokkal elérték hogy lehet velük terjeszteni a nyílt interneten a tartalmat. Értelmesen ez megoldva hogy aki látogat az segítsen is a tartalom megosztásában. Akkor a nagy közönséget ez az egész nem fogja érdekelni. Én akikkel beszéltem eddig számukra ami a nyílt neten nem elérhető az nem is létezik! Még csak a fáradságot sem vették hogy kipróbálják a szoftvert.\n\n2 éve indítottam egy filmes oldalt itt jelenleg több mint 50 filmmel egy KopyKate Big klónnal. És azt lehet mondani hogy szinte senki nem tölti le a fájlokat. A teljes filmekből jó ha pár megabájtos letöltéseket látni és így a fájlok elérhetetlenek! Megfigyeltem viszont hogy a Play ahol a torrenteket a nyílt neten is megosztják működik. \n",
			"post_id": 152,
			"date_added": 1601864432
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}