{
	"title": "ZeroConObs",
	"description": "My corner of the Zeroverse.\n\nconobs@zeroid.bit\n\nI code shit on a daily basis but would rather live in the Eternal Buzz. Mmmmm edibles...",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1551329361,
	"post": [
		{
			"post_id": 20,
			"title": "The Mirror",
			"date_published": 1551326775.632,
			"body": "My latest short story, [The Mirror](http://127.0.0.1:43110/ZeroMedium.bit/?/1AjJqGb8AmPfgD62kEBBtqhg2hYDW5zner/the-mirror), is up over on ZeroMedium."
		},
		{
			"post_id": 19,
			"title": "Two for the Price of One",
			"date_published": 1518750958.358,
			"body": "There are two people I can listen to for hours and still learn new things.\n\nRam Dass and Alan Watts.\n\nAnd all it cost was my ego. An easy price to pay for what I've received in return."
		},
		{
			"post_id": 18,
			"title": "How I Learned a Few Things Moving from Sass to CSS",
			"date_published": 1517627085.961,
			"body": "So in a test build-out of a tool (built in Vue) I'm working on at the day job, I came across a post by Tyler Gaw on his move from Sass to (post)CSS. I liked what I was reading enough to give it a shot myself.\n\nI might not have done this if not for the fact that we're moving a good portion of our front-end development into a *better* workflow with webpack.\n\nSo I guess some backstory might help here. Currently I have a handful of batch files (a different one for each individual VS site we have) that I have to run in the CLI to keep our Sass files compiled since the Visual Studio implementation of Gulp is just an absolute and abject failure. It would work for about ten minutes and then just stop, for no good reason. Annoying is an understatement. But now we have some younger blood on the team who is well versed in the latest workflows for front-end development. This has led to an influx of better methodology for how we do things here. And I for one, am happy.\n\nBack to the topic at hand, I have converted the whole host of Sass files back into CSS using current-spec features such as custom properties (`variables` in Sass), nested rules (thanks to css-next), and left the Sass `@import` statements in place (thanks to css-import). A couple things I've learned:\n\nA) either css-next, or webpack itself, converts `rem` values into their `px` equivalents and outputs both to the rendered css (for browser compatibility?) and...\n\nB) such conversions are picked up (and watched) only after an initial build i.e. changing from Sass to CSS requires the `npm run dev` to be restarted (this is probably a duh).\n\nOh, and...\n\nC) while we can still do nested `@media` queries inside the rules, doing so to change a declaration of a custom property requires the query to be nested inside the initial custom property, and does not work if you have a media query out by itself and have a custom property changed inside of it.\n\nFor example this...\n <pre><code>\n:root {\n  --box: {\n    margin-bottom: 20px;\n    padding: 15px 0;\n    @media screen and (max-width: 991px) {\n      padding: 15px;\n    }\n  };\n}</code></pre>\n...works just fine, while this...\n <pre><code>\n:root {\n  --box: {\n    margin-bottom: 20px;\n    padding: 15px 0;\n  };\n}\n@media screen and (max-width: 991px) {\n  :root {\n    --box: {\n      padding: 15px;\n    };\n  }\n}</code></pre>\n... does not.\n\nI'm not totally sure as to why it works that way, but I'm only just beginning on my journey (yes, far too late, perhaps) on the way to learning this *new to me* workflow. Then again, the first example is more concise and clean, so maybe that's all the reason I need."
		},
		{
			"post_id": 17,
			"title": "Out of the Frying Pan",
			"date_published": 1517455508.617,
			"body": "I haven't been able, financially, to set up the forge just yet. I'm going to enlist the help of a friend of mine who is a sheet metal welder and we'll craft a side blast coke forge that will last for years to come. Might as well do it right the first time around. I am not in any great need to be forging right this instant so the extra time this project will take is fine with me. I'd rather have something that works right, is solid, and will last than throwing something together just to say I did it."
		},
		{
			"post_id": 16,
			"title": "Into the Fire",
			"date_published": 1515731651.755,
			"body": "This weekend I'll be buying the main pieces I need for setting up my home forge. I've watched a *lot* of videos on blacksmithing and my girlfriend bought me a book on how to get started this past Christmas. So this weekend I will go pick up some fire bricks, some charcoal, a blower of one sort or another, and hit up a friend of mine for some iron. I have a small anvil and decent hammers that will all do me well for the time being as I learn.\n\nI'm excited to get started learning blacksmithing. I've been feeling the call to be more creative with my hands, building tangible, physical things.\n\nI've already distanced myself from filmmaking. That gave me joy and fulfillment for many years but never really paid off and it was just time to move on.\n\nFeeling this burning desire to create real things has also eaten away at my love of programming. I don't think my heart is in that any longer, either.\n\nI just really need to start taking raw, hearty materials and turn them into useful, practical, worldly things we, and maybe others, can use."
		},
		{
			"post_id": 15,
			"title": "The World We Live In",
			"date_published": 1515212321.573,
			"body": "A carnival barker, reality TV show host is the President of the United States. Our TVs listen to our private conversations. Our cellphones track where we go. Technology has enslaved us rather than freed us, all for the bidding of the billionaires of the world.\n\nKeep the masses scared, hungry, tired, busy, frustrated and fighting with each other and you'll be able to get away with damned near anything.\n\nWhat a time to live in. Maybe yes, maybe no."
		},
		{
			"post_id": 14,
			"title": "Last Rehearsal of the Year",
			"date_published": 1512954069.894,
			"body": "We had our last rehearsal for the year. We'll be picking it back up in the latter half of January. I'm looking forward to gigging again. We’re thinking of doing a river concert in the Spring. Our keyboard player’s brother has a pontoon boat and generator and we’d just cruise down the river playing music. Maybe put up a banner with a QR tag so boaters could donate, if so inclined. Here’s to hoping that 2018 is far better than 2017. This year has been pretty shitty in many regards."
		},
		{
			"post_id": 13,
			"title": "Need More Hours in the Day",
			"date_published": 1512616471.968,
			"body": "I started up a zite clone of [CrimethInc](http://127.0.0.1:43110/crimethincclone.bit/) but just haven't had the time as of late to really flesh it out. Between wanting to get that zite going and finally getting my wood shop back up, I seriously need more hours in the day or get this fucking divorce support order in place so I can not have to work so god damn always."
		},
		{
			"post_id": 12,
			"title": "Common Sense",
			"date_published": 1507127440.906,
			"body": "As a law abiding gun owner myself, I know the feelings that come up when I think about a future where that ability no longer exists. But I also know that there is no legitimate reason for me as a private citizen to own a Barrett Model 95, .50 caliber, anti-materiel rifle, today available from many gun retailers. And nobody has been able to yet provide an argument against that statement.\n\nI also don't agree that we need to make it easier for people to legally buy silencers. Being able to own a gun for self protection, sport shooting, or hunting doesn't mean we need access to weapons of mass destruction.\n\nWhat we *do* need, is a little common sense."
		},
		{
			"post_id": 11,
			"title": "Of the Irrigate",
			"date_published": 1505141789.381,
			"body": "I totally blanked on finishing out this post. So, we have eleven fruit trees in the yards of the house we recently purchased and watering each one separately was a nightmare, not to mention not the way to do it. We asked an arborist to come out and examine the trees to make sure we were taking care of them the right way and if there were any issues on them that we would need to address. The only real issue was their lack of water.\n\nWatering them every couple weeks for a couple hours just wasn't the right way to go. They needed to be on a watering schedule of about 12 hours once a month, until the rainy season. So I set up a watering system of irrigation tubing as a main line that snakes through our little suburban orchard, with 1/4\" rubber line coming off of that at every tree. Then from the rubber line I tee off a 1/4\" soaker hose. I installed a splitter with valves at the exterior faucet and the irrigation line runs off of one and the garden hose off of the other.\n\nWhen it's time to water the trees we just turn the water on low, close the garden hose valve, and let the trees soak overnight.\n\nEventually I will be building a small gardening shed and will move the tree side of the splitter line into the shed on a wall and set up a timer for the tree irrigation.\n\nI was meaning to add some pics to this post, but have been too busy to get to that yet. Soon."
		},
		{
			"post_id": 10,
			"title": "Another Trip Around the Sun",
			"date_published": 1504408215.684,
			"body": "It's been another trip around the sun for this guy. I still don't feel older, except for some mornings. But I think that may just be due to not being that much of a morning person. I'd rather work for myself again; making my own schedule has always appealed to me. Someday in the not-too-distant future I'll be back in a position for that to be an option. For now, I knowingly validate my own wage slavery in the short-term pursuit of doing the right thing.\n\nI am taking the initiative to return to writing, though. Although, I guess really right now I'm returning to _what I've already written_ to do some clean up and submission to some magazines and whatnot that pay industry rates.\n\nI will probably put some stuff up on my own sites. I don't like the idea of only making money from what I create. I'd rather that not have to be the case, but, for that, return to paragraph one.\n\nMaybe also put up an NMC address and anyone who enjoys what I create can support as they see fit."
		},
		{
			"post_id": 9,
			"title": "Where We Are",
			"date_published": 1504068452.973,
			"body": "As technology has progressed to alleviate the time demands of one task, another quickly drops in place to fill the void left in the vacuum. Rather than make us freer, technology has actually been used to make us busier; more tied to work and wage slavery. The advances promised 60 years ago to make our lives easier with shorter, and fewer working days, automation of every day tasks, automated homes, vehicles free of burning fossil fuels, were quickly realized to work against the world the ruling elite was busy creating to cage us in.\n\nAll of that technology does exist today, but the connections between idea and implementation have been scattered far and wide in order to dissuade the casual observer from accomplishing that freedom. For the rest who are willing to put in the effort, they’ve made sure to make the implementation difficult. In their places we’ve been given the illusion of such conveniences through purchased access to tools that are actually used to track and control us rather than the other way around.\n\nSociety has also placed burdens on us to keep us in line and competing against our neighbors. Keep your lawn green, your grass mowed, your flowers pretty. Don’t use your space to grow your own food to provide for yourself or your neighbors. That’s just unsightly and a nuisance.\n\nBur the latest and greatest TV so you’re friends will want to come to your house, filled with glamorous furnishings to prove you have good taste, when it’s time for you all to drink your pain and suffering away."
		},
		{
			"post_id": 8,
			"title": "After the Move",
			"date_published": 1503162713.698,
			"body": "We've moved into a house with a decent sized back yard that the previous owners used as a small orchard. There are about a half dozen unknown varieties of citrus trees, a cherry tree, two peach trees, a saturn peach tree, and now we've began the work of turning open spaces into a garden and we'll be planting herbs and other ground cover amongst the trees to create a food forrest.\n\nLooking forward to the bounty the land will provide."
		},
		{
			"post_id": 7,
			"title": "Thoughts",
			"date_published": 1476335458.497,
			"body": "I have them. You have them. We *all* have them.\n\nHere's some of mine.\n\nMy roommate has become fascinated by the moving lights reflected on the wall above the head of my bed by my mirrored closet doors as they catch the headlights of the passing cars. She *chases* them, to be more precise.\n\nUnfortunately for me, it's at times like three in the morning that she finds the need to do this.\n\nI really need curtains."
		},
		{
			"post_id": 6,
			"title": "Cannabis card? No gun for you!",
			"date_published": 1473987291.123,
			"body": "A United States federal appeals court has ruled that if you're a medical marijuana card holder, you cannot legally purchase a firearm.\n\n>The Ninth U.S. Circuit Court of Appeals in San Francisco ruled in a 3-0 decision that the defendant, a Nevada woman named S. Rowan Wilson, could not purchase a gun while also possessing a medical cannabis card.\n\n>“It is beyond dispute that illegal drug users, including marijuana users, are likely as a consequence of that use to experience altered or impaired mental states that affect their judgment and that can lead to irrational or unpredictable behavior,” read the opinion written by federal New York judge Jed Rakoff, who has been assigned to the appeals panel temporarily.\n\n>Jakoff went on to note that, while consumers of medical cannabis are less likely to commit violence than users of other illegal substances, the courts are nonetheless supportive of the government’s declaration that “illegal drug users, including marijuana users, are more likely to be involved in violent crimes.”\n\nSeriously?!?\n\nPeople under the influence of mind altering substances such as alcohol or psychiatric drugs are a far greater danger to the public when in possession of a firearm than a pot smoker has ever been."
		},
		{
			"post_id": 5,
			"title": "Green Card",
			"date_published": 1472721404,
			"body": "I've thought for years I wanted a cannabis card. I finally made it come true. Let me say... the pain relief from the motorcycle accident is amazing. Not that I didn't know of the many great benefits of one of nature's best presents."
		},
		{
			"post_id": 4,
			"title": "Cannabis",
			"date_published": 1469682070.774,
			"body": "Had a lively discussion tonight about Matt Davies and the legitimacy of his arrest and charges. My discussion partner on this venture wagered that it was because medical marijuana dispensaries have to operate as shady enterprises under false and fraudulent auspices. My counter was that no, it was because he felt the need to invest in seven dispensaries that put him on the radar. Legitimacy is one thing. Greed is something altogether different."
		},
		{
			"post_id": 3,
			"title": "Alone In The Room",
			"date_published": 1468998188.817,
			"body": "I guess I'm a loner. I do like my solitude and I've never felt more alone than in a room full of people."
		},
		{
			"post_id": 1,
			"title": "ZeroConObs",
			"date_published": 1468473379,
			"body": "I've played with IPFS and i2p but I think I am going to like ZeroNet the most.\n\nTime will tell, though."
		}
	]
}