{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1584743932,
			"title": "Introducing `{FX}.css`, a complete set of CSS animations and filters utility for web UI.",
			"body": "{FX}.css (https://tinyurl.com/rlgqevn) started out as a small side-project of mine. As I was increasingly using CSS animations and filters, I thought it would come in handy to have them organized in a meaningful and accessible way so that they can be easily reused on different projects. I have been using {FX}.css for a while now and I hope some of you will find it useful as well. It is still very much a work in progress and hopefully it will evolve over the time.",
			"added": 1584743931
		},
		{
			"topic_id": 1584744056,
			"title": "Introducing new `FX.css` extended module ~ the `filter preset`.",
			"body": "Spending long holiday pursuing opensource hobby projects. (https://lnkd.in/f75uVWZ)",
			"added": 1584744054
		},
		{
			"topic_id": 1584744127,
			"title": "noozy 1.0.4.3 unofficial `pre-release` for the desktop platform.",
			"body": "Support modern Hi-Res `MQA` and `DSD` audio formats. Download for Linux (https://lnkd.in/f7eRu8s), Windows (https://lnkd.in/fBSTBwJ). Details and documentation come later. Tell me how you like it. Enjoy! Courtesy of Noozxoide Laboratories.\n\nAn audiophile-grade music transport designed to enhance the listening experience for the on-the-go audiophile. The `noozy` features a premium audio player that lets you experience the best possible sound quality from your music library. Introducing the advanced sound engineering from `Noozxoide Laboratories`. The noozy exclusive special effect VSP “EIZO-rewire AE (acoustic engine) Series” delivers software-layered 32bit floating-point processing power bringing the superior and aggressive sound that ever made. With the new VSP processing and mixing each FX separately, you can fully take control of your content effects.\n\nSound Modeling\n(source) > (normalizer) > (noiseReduction) > (compressor) > (acousticEngine) > (output)\n\nSound Characteristic ~ Aggressive!\n\nMUSIC . SOUNDOLOGY",
			"added": 1584744124
		}
	],
	"topic_vote": {
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1584743932_1JQT9rnHDwo6i2dCySE9dEZPNpLLYXKmW7": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_1335_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Nice, finally a CSS-only animation library.\n\nEnjoy, then. I am spending this long holiday due to the COVID19 outbreak trying to complete other `presets`.",
				"added": 1584780528
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 2,
				"body": "I am a UI Designer, Electronic and Software Engineer. I host ZN on a private and separate network with long-range WiFi antenna connecting to my neighborhood who has weak or no `normal internet connection` at all. ZN is the only platform that suits this kind of scenario. Well, it is free of charge to my neighborhood. It just fun to be with ZN.",
				"added": 1584787586
			},
			{
				"comment_id": 3,
				"body": "> [sfs9](#comment_70_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): A few links that might interest You. [...]\n\nWOW, this is so resourceful, I.. I.. I don't even where to start now. Thanks!",
				"added": 1584793129
			}
		],
		"1584744127_1JQT9rnHDwo6i2dCySE9dEZPNpLLYXKmW7": [
			{
				"comment_id": 4,
				"body": "> [robione](#comment_503_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): where's the website? [...]\n\nno website, i am fan of Noozxoide Labs app/products, the author sent me the download links for testing, just that.",
				"added": 1584968312
			}
		]
	},
	"comment_vote": {
		"1335_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}