{
	"next_post_id": 3,
	"next_comment_id": 8,
	"next_follow_id": 3,
	"avatar": "generate",
	"user_name": "Zeronetuser1453",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1589593403,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1590192473,
			"body": "How productive have you been, ZeroMe? \nLearnt any new languages?\nRead any good books?\nCooked any good meals?\nHave you exercised yet?\nTaught yourself something new?\nConversed with your friends and family?\nGone out to enjoy nature?\nMade progress towards your goals?\nSaved your eternal soul?\nEarned some money?\nDon't let the rush and toil of modern life distract you from a very simple fact: it's your life, always has been, and always will be. Don't spend all your time for someone else (especially your boss).\nIf you are missing one or more of these ten, then add them to your daily routine. It's okay to miss a day or two, just try your best! The first step to bettering the world is to better yourself.",
			"date_added": 1590192471
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Attic, Koine, or Modern Greek? For Latin also you have Classical, Ecclesiastical, and Vulgar. Hebrew idk much about.\nMost Attic texts are also available in Koine, which by itself also has many Byzantine texts not all translated to English or Modern Greek yet.\nMost extant Latin texts are in Ecclesiastical (which also borrows words from Koine Greek and Classical and Vulgar Latin).",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1589740080",
			"date_added": 1589835734
		},
		{
			"comment_id": 2,
			"body": "@Aassddff \n🇧🇷\n👑 Σ ✙: For the Old Testament, the Septuagint is one of the oldest and most complete translations; it is in Koine Greek (sometimes called Byzantine, or Medieval, Greek) The text is thought to be from around 200 B.C.\nFor the New Testament, one of the oldest good translations is the Codex Fuldensis, written in 541 A.D., mainly in Classical Latin with a bit of Vulgar.\nIf you want the study an old \"official Bible\", the Clementine Vulgate, designated as the official Bible of the Catholic Church from 1592 until 1979, is a good choice. It is in Ecclesiastical Latin.\nToday, the offical Bible is the Nova Vulgata, and it is in Classical Latin.\nHope this helps! ",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1589740080",
			"date_added": 1589864141
		},
		{
			"comment_id": 3,
			"body": "For me:\nI learned how to say 'weekend' in Lithuanian\nI read the 3rd book (chapter) of Paradise Lost\nI made toast and eggs with hot sauce for breakfast, and a fruit smoothie for lunch\nI worked out my triceps and abs\nI taught myself how to clean out a pipe under my sink\nI called my parents for a while\nI plan to take a walk this evening\nI made $105 today, which is good because growing my business is also my immediate goal\nI plan to pray tonight\n10/10, today should be a good day!",
			"post_uri": "1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG_1590192473",
			"date_added": 1590192507
		},
		{
			"comment_id": 4,
			"body": "So you are going to do it? Or are you just posting for attention/joking/coping? Regardless, if anyone feels this way I urge you to reconsider. No need for a ward, most people have thoughts like yours at least once in a while. Try living. And I don't mean eating, breathing, working, and sleeping. To be alive is completely different than just not being dead.",
			"post_uri": "1JfAyi1JV5YaBjNZ9Jfu73TVR9Jeg7H5re_1590206764",
			"date_added": 1590219040
		},
		{
			"comment_id": 5,
			"body": "@Lajos Nagy: Good for you! It's amazing how much better life can be when you identify what you should be doing, then work towards it. Most people nowadays live as drones, paycheck to paycheck, never noticing whats around them or stopping to relax; people wonder why depression is on the rise, well sometimes it can feel like there's 4 walls around you at all times in this modern world. Fight back with self improvement, then work on helping your neighbors!",
			"post_uri": "1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG_1590192473",
			"date_added": 1590340469
		},
		{
			"comment_id": 6,
			"body": "dudeweed.\n\nI will pray for your soul.",
			"post_uri": "1CvEjGaDZ1qZrPkac2QB5sNTHSsu4cau1Y_1590291747",
			"date_added": 1590455503
		},
		{
			"comment_id": 7,
			"body": "@Aassddff ✠ Σ 🇧🇷 👑: He's a stoner, his brain is too shot to answer questions. He spouts all the bullshit atheist talking points: \n@cannabisabuser\n>to not know that god doesn't exist can deteriorate one's mind\nThis claim runs contrary to historical evidence, and studies today have even shown there is no correlation between intelligence and religious belief. \n>invisible man\nGod is not man, he created man in his image though\n>weren't even written by Him\nIt is confirmed that the Bible is the word of God, no need for Him to come down and autograph it just for you (even then you wouldn't believe, yet i'm sure you have no problem believing space aliens, lol)\n>hindered science\nthe Catholic Church was the only major power structure to promote and advance science throughout the whole of the Middle Ages. A couple instances of ignorance aren't the whole, yet you focus on those only?\n>souls do not exist\nOh? Prove it then. Since you value \"science\" so much you should be able to give evidence for your claim. I make my claim on faith and have no trouble admitting this, though for you to do so would be hypocritical, no?",
			"post_uri": "1CvEjGaDZ1qZrPkac2QB5sNTHSsu4cau1Y_1590291747",
			"date_added": 1590469510
		}
	],
	"follow": []
}