{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1559765720,
			"title": "Toying around with a computer",
			"body": "There's a gazillion of different things one could do with a computer at hand. And I'm not talking about browsing the Internet, or getting famous on social networks. There's so much to explore, so much to see and so much marvel in that box (or laptop). I often think about the world in the 90's where nobody really knew what to actually do with them in a private household. When it was nerds like me who ruled the space and tinkered around with what Basic could do (and not do at this point). I loved that time and often think how awesome it would be to just toy around with it again, but then I always end up with a million distractions which are built into the devices from the core up.\nHow do you guys feel about that?",
			"added": 1559765719
		}
	],
	"topic_vote": {
		"1559076722_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 5,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Pudding: Vanilla VS Chocolate, everyone!",
				"added": 1541872284
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 2,
				"body": "> [scotcyguy2](#comment_3_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Not sure....most people use the internet to post pictures of their lunch and cats and don't care about the creeping censorship because they \"have noting to hide\"\n\nAgree, most of them don't even bother to watch youtube videos with 60% ads and 40% content, or refuse to pay a buck for a mobile game on their 1000$+ handsets. Instead they live with clickbaits and low-response ad placements in free to play and freemium clicker games.",
				"added": 1543326554
			}
		],
		"1559651192_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "From my experience everybody starts out with the ideology of KISS and the one wholesome wondrous piece of software that solves this world's problems. Time is the culprint here, as people start to fuck it up naturally over time. There's always that one luminary expert who learned about nice design patterns at university and needs to show off in front of everybody (because \"I am coding since I'm 5 duuuh\"). Those people bring chaos, and KISS is gone, because nobody understands the wonderfully looking crap they're producing. With growing complexity KISS is just not feasible anymore, and anyone having worked on large projects (or in a team) knows that.",
				"added": 1559764523
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_184_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I know, my standpoint is personal computing, plus I don't use many of the modern gadgets nor need them, no tv, no android, no fancy stuff. \n\nSo what are you doing all day then? I am skeptical like you about modern technology and especially services, but I can see sense in smartphones and Netflix. I'm genuinely interested in your take.",
				"added": 1559766332
			}
		]
	},
	"comment_vote": {}
}