{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "传播“习氏”真理、全民上街、分房分钱!!!",
			"body": "真理直销 — 传播真相、传播真理的好处\n— 传播“习氏”真理、全民上街、分房分钱\n— 捍卫“千年太祖”习仲勋的光辉，保护习氏后人\n\n既然习近平已经是“千年圣君”，习近平的父辈习仲勋自然就是“伟光正”的千年圣祖了—简称“千年太祖”。在这个“伟光正”的时代，全民上街、分房分钱的“真理传销”公益行动非常符合“千年太祖”习仲勋的“共产主义”情怀！\n\n人类对信息的需求，大体有三种：\n1）追求事实真相，探索真理方向；\n2）真理是啥无所谓，发财信息最重要；\n3）真理或者发财致富都不重要，即时享乐的娱乐八卦最有趣。\n\n鉴于郭文贵的猛烈爆料对于促进文明转型很重要，非常有必要让所有的草根阶层都看到关于爆料的各种内容，以便促进“传播真相、传播真理”。鉴于到处蔓延的、类似传销那样的信息到处流动，可行学习类似传销那样的手法，全面地“传播真相、传播真理”—简称为“真理传播”，或者“真理传销”也可以。\n\n+ “真理传销”与“变质传销”的最大区别，是在于让让更多人看到爆料内容，而不是为了让某些信息原创者以损人利己的方式聚集财富，发国难财。此外，“真理传销”还真地能够促进薄熙来当年掀起的“共同富裕”的文明追求，逻辑很简单，当广大群众都看到真相时，自然团结一致，全民上街、和平革命，推翻“伪共”“匿产帮”“支那蛆虫”党的“房地产泡沫”专政。而“地产泡沫”专政的“蛆虫”经济一旦崩溃，买不起房的人立刻就可以享用到处空置的、数量庞大的“投机”房产；同时，伴随着盗国贼巨额财富的收缴，很多平民都可以分到钱。这些钱财虽然无法让平民百姓都成为富翁，但至少能够避免类似“杨改兰”那样的惨剧，即让全国的民众享有物质文明的基本保障。 \n\n在当前，平民阶层中，上访群体很关注法治公平、真理真相，暂时还没有被拆掉房子的普通百姓对江泽民宣扬的“闷声发大财”更感兴趣，普通人目光短浅，看不到法治的重要性。 在这部分人中，很多人已经成为房奴，在经济不景气的大趋势下，收入不断减少，压力很大。 但他们由于思维简单、目光短浅，一直抱着“发财梦”，不懂得在支那丛林暴政体系里，即使发大财，也只会给他们带来杀身之祸。跟那些人沟通，不必要强调文贵爆料对于法治的重要性，只需简单地指出，这个“真理传销”会让很多民众有房住、有钱分，有基本的物质生活保障。对于这类人群的传播主题，不是法治正义，而是“快速买房、致富”。\n\n一些享乐主义者可能只关心“淫乱绯闻”之类的娱乐八卦。对于这个群体，传播的主题就是近期特别轰动的、“爆肛”级别的非常“肛裂”的、英雄赞歌级别的、具有 “共产共妻”性质的超前共产主义水平的、完全献身精神的“巨星淫乱”。\n\n+ 简单归纳，无论人们感兴趣的内容是追求真理、发财买房、还是只有支那蛆虫才能制造出来的、超级恐怖的、以类似王芳那样以“爆肛”级别的非常“肛裂”的、英雄赞歌级别的献身精神的“娱乐八卦”，“真理传销”的信息项目都能够完全包揽。以这种思维，就可以在传播领域不断扩展，涵盖所有人群。\n\n对于盗国贼的淫乱腐败、罄竹难书的罪恶，习近平目前一直都是麻木不仁、无动于衷。习近平的水平到底是某些人所说的，是“千古圣君”般的战略定力，还是笨猪笨驴级别的阿Q草包，外界无法晓得，可能只有他本人清楚。他是如何搞到最高权力位置的？外界也不晓得。 习氏的水平如何不是最重要的问题，最重要的是这个黑箱操作的体系需要改变。\n\n+ “真理传销”，就是为了促进和平变革。 \n\n美国动用国家力量全力保护文贵爆料。文贵保持适当谨慎，他个人安全就没问题了。与文贵有关的、在中国大陆的员工、亲人、同胞等各种群体的安全，与全体国民的安危荣辱密切关联！\n\n传播真相、传播真理，不只是为了中短期的和平革命 — 全民上街、分房分钱，而且也能够促进环境改善，让空气质量提高。在呼吸方面，所有人都有同样的需求，无论是注重优质生活的达官贵人，还是只求自家多子多福、不管别人屋上霜的愚昧老妪。对于一些戏子村妇们，尤其要强调，“真理传销”，将促进空气改善，让他们后代的生命质量更高，对于他们多子多福的“伟光正”“中国梦”非常有帮助！\n\n上述内容只是网友们即兴发挥、拼凑起来的各种观点、策略。稍作分析，鉴于多数人更关心眼前利益，所以比较有效的传播主题应该是“传播真理、全民上街、分房分钱”。\n\n+ “传播真理”，传播的是关于“习氏”的真理，面对腐败，“习氏”一直都不作为，这种奇葩景象到底是“伟光正”的个人定力，还是其它原因？这个问题需要一场和平革命才能搞清楚，需要全民探讨、全民参与，以全民的积极作为，取代“习氏”“伟光正”的不作为，为习仲勋后人排忧解难，保护习仲勋曾经有过的“伟光正”“历史光辉”，既符合法治时代的新文明建设，也符合极端“忠君爱国”的、比义和团等“爱国贼们”更加极端保守的“传统势力”派系所秉持的“极端保守”的思维！\n\n行动起来吧，拥护千古圣君“习近平”，拥护千古太祖“习仲勋”的后代们的“伟光正”光辉！！！ 为了让这么伟大的“宇宙真理”和“宇宙光辉”永远传承下去，丛林暴政的历史改写之后，让持枪权捍卫真理的**小一统规范** 守护中华文明的“中国梦”！\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc",
			"added": 1506603718
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}