{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 1,
				"body": "Ой да ладно вам, сейчас никто не кому не донатит, если только друзья, забудте вообще что такое донат это хуйня придуманая каким то дауном. На деле из миллиона проектов донатят только в еденице и то как я сказал выше друзья.\nПоэтому если вы что то делаете не рассчитываете на донат никогда, эта полная хуйня а все люди жмоты. И эта 99% правда, к сожалению.",
				"added": 1564593419
			},
			{
				"comment_id": 2,
				"body": "А тот кто говорит готов скинуть или еще что то, это пиздабол который на деле нехуя не может только пост вверх подымает для спама.\nТак что не верти в эту хуйню, донат придуман для бедных людей что бы показать что вот смотрите крупные проекты получают бабки, а на деле это либо реклама либо сами себе кидают.\nБолее того все проекты которые типо стоят по миллиардам долоров на деле нехуя не стоят.\nВот недавно майкрософт кубил гитхаб и написали астронамическую сумму, На деле они купили его за копейки там даже ляма долларов наверно не было, все потому что разработчикам уже тупо впадлу сервера держать с кучай кода и они рады избавится от этого мертвого проекта. Подписка которую они предоставляют за донат, типо закрытый исходных код еще всякая хуйня не кому не нужна, если только крупным компаниям IBM и то серьезный код они там не будут держать, ясен пень спиздят нехуй делать.\nПоэтому все что заливают вам в уши это мусор для простолюдинов, богатые знают правду, что их говно не кому не нужно только им а благодоря таким заявлениям они могут просить в долг у банков. А дальше вы знаете схему если есть кредит на хуево тучу лямов можно пиздавать с документами к президенту с требованиям напечатать еще.",
				"added": 1564594162
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 3,
				"body": "Спорим следующий президент будет пидором",
				"added": 1564772554
			}
		]
	},
	"comment_vote": {}
}