{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Программисты, давайте устроим холиворчик по технологиям",
			"body": "Каждое сообщение должно состоять из списка технологий. Рекомендую публиковать такие варианты списков:\n - то за чем будущее и пару слов почему вы так решили.\n - полное говно (желательно тоже с объяснением)\n - \"ни рыба ни мясо\" - странные технологии с непонятной перспективой\n\nНу и голосуем за лучшие подборки.",
			"added": 1473700857
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Самое главное начать. А дальше пойдет.\nОсобенно со всякими там пакетами Яровой и пр.",
				"added": 1473681362
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 2,
				"body": "So ok. In this case who will be next? Medvedev?\nИли кто там сейчас в фаворе в правительстве?",
				"added": 1473681529
			}
		],
		"1_1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3": [
			{
				"comment_id": 3,
				"body": "Ну так начинай глаголить.\nКак ты предлагаешь в Беларуси хорошо сделать?\nПонятно что усатый как бы напрягает, но кем его заменить?\nОппозиция как бы не совсем адекватна, по крайней мере та, что я замечал. \n\nЗ.Ы. Самый большой вопрос который у меня есть это как белорусы отнесутся к Коле в случае чего? Будут таки терпеть или взорвутся?",
				"added": 1473681817
			}
		],
		"1_15wNEoQCms9WKErZUKNLaXRNH9Fn8uPkFj": [
			{
				"comment_id": 4,
				"body": "А тут админ на сайте есть? Может стоит  некоторые топики удалять?",
				"added": 1473682030
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 5,
				"body": "Я думаю разрозненность общества еще имеет и некий профит - Разрозненным обществом легче управлять.  И я сейчас говорю не столько про государство, сколько про различные негосударственные группы.",
				"added": 1473687441
			}
		],
		"1_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": [
			{
				"comment_id": 6,
				"body": "Отстойные технологии:\n- Ruby - абсолютно не понимаю зачем это было создано, особенно когда есть Python, у которого читаемость кода и вменяемость платформы на порядок выше\n- PHP - был неплохой технологией пока вдруг на нем не начали пилить всё что мыслимо и не мыслимо.",
				"added": 1473701060
			},
			{
				"comment_id": 7,
				"body": "> [zalex](#comment_25_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS):\n> Qt - за ним будущее. \n\nВообще то согласен, за исключением этой формулировки. Qt как бы уже 20 лет стукнуло. Столько же сколько и Java. Оно конечно намного упрощает разработку на C++, но как бы не все проблемы платформы C++ они могут решить.",
				"added": 1473767181
			}
		]
	},
	"comment_vote": {}
}