{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Зеронет умер? Ноуфиш слился?",
			"body": "Где обновления? Где py3? Где вообще всё?\n(я чисто похайпить, есичо... а то скучно)",
			"added": 1559558822
		}
	],
	"topic_vote": {
		"1_1P7PoyMkQ7MXyfgReQfHqgcPJaZhKhwAKn": 1,
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": 1,
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1
	},
	"next_comment_id": 65,
	"comment": {
		"2_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 1,
				"body": "> [golden999](#comment_1_12zP1mRAMfSGg3ZBsRnBRd89szfN4Q98td): Всем привет, только начал пользоваться ZeroNet.\n\nПривет. Держи нас в курсе.",
				"added": 1545051347
			}
		],
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 2,
				"body": "Да не было тут особой ру-жизни. Было очень много Балансера.",
				"added": 1548068550
			}
		],
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 3,
				"body": "Зачем?\nИ когда, например, mastodon или diaspora стали дарксетью?",
				"added": 1548068701
			}
		],
		"24_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 4,
				"body": "Запрета там нет никакого. Японские копирасты пару раз приняли кого-то из выложивших там что-то. Но история мутная и скорее всего социально-инженерная.\n\nНо то что она не обновляется уже давно и нет исходников это прекрасно.",
				"added": 1548319268
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 5,
				"body": "Пей, кури, жри говно - поймай инсульт в 45 и умри.",
				"added": 1548319367
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 6,
				"body": "Ржачный пост ))) \"Я стар...\" \"Я бы хотел...\" \"Я буду рад...\" \"Возглавим, ура!\" \"Седина яиц!\". Дурь, вождизм и попытка зарулить п2п, ну-ну (уж молчу что ZN вообще ни в каком месте не дарк)...",
				"added": 1548683232
			},
			{
				"comment_id": 8,
				"body": "Новые самопровозглашённые \"балансеры\" первым делом озаботились модераторскими фичами и банхаммерами.\nРабы могут придумать только кандалы и плетку. Как же это прекрасно ))\n\nЗероНет которую мы заслужили...",
				"added": 1549377637
			},
			{
				"comment_id": 9,
				"body": "> [quirrel](#comment_59_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): \n> У меня противоположное мнение по этому поводу. ... Если открывать двери для всех без исключения, хлынет тот токсичный контент, которого и в Клинете полно. Оно надо, делать из ЗероНета маленькую копию РуНета?\n\nУже который день у меня глаза наполнены слезами умиления...\nОх, ребята,  be careful с этим фюрером.\n\"Я сурьёздно\" )",
				"added": 1549533710
			},
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_112_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Тут посерьёзнее каша заваривается. Китайский спамер атаковал ZeroMe и ZeroTalk.\n\n)))",
				"added": 1549536786
			},
			{
				"comment_id": 11,
				"body": "> [quirrel](#comment_60_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Всё, чего я добиваюсь - пытаюсь сделать так. чтобы ЗероНет не загнулся. \nКто тебе сказал что он загибается?\nКто тебе сказал что ЗероНет нужны какие-либо усилия чтобы он не загибался? \nИ, повторю - кто тебя назначил главным спасальщиком?\n\n> [quirrel](#comment_62_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y):\n> А вот это уже бот.Судя по всему, за ЗероНет взялись по всем фронтам.\nКакой бот? Какие фронты?? Что ты несешь???\n\nИ если надо спасать ЗН, то от тебя (и твоих подпевал), конечно... Ты абсолютно неадекватен.\n\n> [quirrel](#comment_62_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y):\n> Так вот почему у меня тормозит ZeroMe.\nZeroMe у тебя тормозит потому что ZeroMe сама по себе мегалагучая \"в дизайне\" дрянь. И чем дальше тем будет хуже и без всяких школо-спамеров.\n\nТы еще и некомпетентен.",
				"added": 1549551035
			},
			{
				"comment_id": 12,
				"body": "> [quirrel](#comment_72_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Ну что ж, пришло время подвести что-то вроде предварительных итогов по поводу этого треда... Спасибо всем, кто откликнулся. \nОй, да всегда пожалуйста. Ты самое главное, нас не бросай, а то загнемся... Ну отчеты о работе не забывай постить почаще. Это очень важно и для работоспособности сети и вообще.\n\n> [quirrel](#comment_72_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Ну и, разумеется, заходите сюда почаще, поддерживайте активностью сеть, аполняйте контентом, я, со своей стороны. всегда буду стараться это сделать.Всем большое спасибо за участие в обсуждении.\nКакой же ты молодец! Мы спасены. Ура. Пошел бы выпил на радостях, да инсульта опасаюсь...",
				"added": 1549869987
			},
			{
				"comment_id": 13,
				"body": "> [revolter](#comment_1_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Это что, передел власти? Выдвигаются очень странные инициативы, больше похоже на какую-то провокацию. Хочешь застолбить вакантные места чуть ли не основателей русскоязычного сегмента, создать конфочку приближенных айтишничков, которая будет рулить одобренными ресурсами? Может еще вики сделаешь, со смешными логами из конфочки, как вы весело сосете там пивасик и айтишничаете? А калтент ты какой генерировать будешь? Вот такие простыни с самовосхвалением?\n\nКласс ) \nНо бессмысленных маразматических \"фюреров\" всерьез воспринимать не надо, как мне думается. \nСмоется, забудется и будет чисто. Со временем. \nГлавное не вестись...",
				"added": 1549975744
			},
			{
				"comment_id": 14,
				"body": "> [quirrel](#comment_76_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Ничего себе ботов понабежало.\n\nТы так ничего и не понял, лапулька )",
				"added": 1549978046
			},
			{
				"comment_id": 25,
				"body": "> [adiom](#comment_3_1BUgGDu31ceZJeMmFpKpdqro2fGqEb1qXG):  но что значит \"сеть осталась без руководства\"? это децентрализованный проект - каждый популяризирует как может, нет?\n\nЭто значит что автор вождист и идиот, считающий всех вокруг \"тупыми школьниками\". Позавчера у него были \"тупые боты из лахты/ольгино\".\nНе обращайте внимание.",
				"added": 1551437351
			}
		],
		"2_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 7,
				"body": "> quirrel: P.S. Уважаемые novichki, вы развели здесь реальный оффтоп.К сожалению, модераторов нет, чтобы почистили, но, надеюсь, это изменится.Этот форум посвящен глобальным вопросам технического характера. Не обсуждению четамувенесуэльцев и украинской проблеме. Мы всегда рады поучаствовать во внятной дискуссии, но, пожалуйста, на специализированных ресурсах, благо создать политический форум здесь можно в два клика.\n\nА тебя кто тут главным назначил? Ты вообще кто такой? Не жмет ничего?",
				"added": 1548923273
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 15,
				"body": "> [gluek](#comment_3_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Ну например ZeroNet через mesh сети вроде CJDNS, но думаю до этого просто не дойдёт.\n\nМеши очень быстро запретят еще одним \"законом\" (в Китае, вроде как, уже давно запретили). \nОни даже по нынешним законам спорны со своим \"не ограниченным помещением вайфаем\".",
				"added": 1550518582
			},
			{
				"comment_id": 16,
				"body": "Смешно ) Да никто не будет ходить к каждому персонально. Просто запретят меши одним днем и будут принимать чуваков с открытым вайфаем выборочно и показательно. Через месяц забудете как пишется \"меш\". \n> [7heaven](#comment_4_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Ребята о чем речь? Если п2п еще может и возможно заблокировать, то mesh-сети никак. Невозможно. Разве что если товарищ майор будет ходить к каждому домой персонально и садить на бутылку забирая при этом компьютер и роутер.",
				"added": 1550600990
			},
			{
				"comment_id": 17,
				"body": "> [7heaven](#comment_5_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Ну знаешь, я в таких случаях люблю приводить пример даркнет-площадок. Вещества тоже в принципе запрещенны и за них могут посадить на бутылку. Что и делают в принципе с некоторыми товарищами. Но, даркнет маркеты будут продолжать существовать. И наоборот, спрос на них тоже будет расти. Почему? \nДетский сад... Ровно потому что веществами сами менты и торгуют ) \nМеши им нафиг не сдались, у них и так все хорошо в ТОРе.",
				"added": 1550660856
			},
			{
				"comment_id": 18,
				"body": "> [quirrel](#comment_83_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Да-да-да, товарищ майор, прямо будете рейды проводить, как в СССР при поимке радиохулиганов.\n\nкокококо",
				"added": 1550660915
			}
		],
		"1_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 19,
				"body": "БА-ДУМ-ТСС!",
				"added": 1550765312
			}
		],
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 20,
				"body": "Роскомнадзору давно класть на ваши игрушки и фильмы в торрентах.\nСегодня РКН занимается политической цензурой. И только ей. Расслабтесь.",
				"added": 1550765458
			},
			{
				"comment_id": 22,
				"body": "https://iknowwhatyoudownload.com/ru/peer/\nhttps://iknowwhatyoudownload.com/ru/api/\n\nБТ - зло. Запомните. Запишите. Сделайте тату.",
				"added": 1550822809
			}
		],
		"3_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 21,
				"body": "А она развивается? Несколько лет была в полной гибернации.\nА что там подобное Зеронету? Просто торрент-клиент которому трекеры не нужны. Таких, собственно, не одна и не две.",
				"added": 1550767210
			}
		],
		"1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 23,
				"body": "> [quirrel](#comment_88_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): А вот и первый ольгинец. Видите? Собственно, и без этих ребят тут было не айс, но они очень быстро всё засрать могут, если будет необходимость.\n\n> [quirrel](#comment_89_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Плохо работаешь, негодно. Тоньше надо. Поздно уже извиняться, когда ниже толсто намекал на необходимость удалить Зеронет.А всё равно, раз уж эти появились - это уже всё, конец. Всё, к чему прикасается Ольгино, превращается в дерьмо.Проебали мы Зеронет.\n\nКакой же ты дремучий мудак... Эталонный просто. Что ты несешь опять?\n\n> [revolter](#comment_4_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Извини конечно, но ты должен понять, что главные враги Зеронета - это вахтеры, которые делят пользователей на своих/чужих, мечтают ввести доступ по белым спискам и подмять под себя ресурсы.\n\nТЫ, quirrel, и есть главная причина появления таких вот постов.\nПросто обычные люди с мозгом, глядя на тебя, ужасаются.\nВпрочем, надо понимать что мудаки никак не могут навредить сети, ибо кроме смешных пуков ничего производить не умеют. \nЯ бы тебя давно уже заигнорил в ZeroID, но хоть поржать есть теперь над чем )",
				"added": 1551084000
			},
			{
				"comment_id": 24,
				"body": "> [quirrel](#comment_85_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y):  Даже в этой теме ответы оставляют одни левые Аноны, которых я тут раньше не видел. Что свидетельствует о том, что люди приходят и уходят - текучка. Кто эти люди, о чём они пишут вообще - смотришь на ЗероНет и думаешь.\nИ вот опять ты намудачил. Тут сидят люди которые были в ЗН когда ты еще о ней не знал (хорошее время было, кстати). Но, конечно, этого ты не понимаешь, вот сюрприз!",
				"added": 1551084851
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 26,
				"body": "Нууу это, как его... Никак.",
				"added": 1552672330
			}
		],
		"7_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 27,
				"body": "Бандере не платили дань, а Кадырову платим.",
				"added": 1554376294
			}
		],
		"1_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": [
			{
				"comment_id": 28,
				"body": "Судя по сайту и гиту - скорее мертвое чем живое. \nКоннект через какой-то центральный роутер школо-автора. Хахаха.\nПока конечно никакая ничему не альтернатива. Что будет потом - хз, но сейчас скорее какое-то говно на лопате...\n\nААААА SUUKAAAA оно еще и не опен )))\n\"Why isn't Demonsaw 4 open source?\nEijah, the creator and developer, with his trusty developer-god-in-training Cammy, didn't make it open source... yet.\nDemonsaw 1 through 3 are open sourced and available on Github, Demonsaw 4 was opted not to be open source at this time.\"",
				"added": 1555409825
			},
			{
				"comment_id": 30,
				"body": "\"Demonsaw 1 through 3 are open sourced and available on Github, \nDemonsaw 4 was opted not to be open source at this time.\"\n\nCode\nDemonsaw Source Code\n C++  61  10 MIT Updated on 21 Oct 2017\nIssues\n 7  5 Updated on 3 Dec 2016\nWebsite\nDemonsaw Website\n HTML  1  4 Updated on 4 Nov 2016\n\nТы читать умеешь? Тулень...\nХотя мне пофиг, если честно )\nСпамь дальше своим говном. Улетаешь в блок вместо со своей свистоперделкой )\n\nОткуда вы беретесь только?..",
				"added": 1555487696
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 29,
				"body": "Глава Роскомнадзора Александр Жаров сравнил законопроект об автономном интернете с ядерным оружием, сообщает RNS.\n\n«Это достаточно серьезное оружие, но я надеюсь, что как ядерное оружие, которое имеется у ряда стран, оно будет находиться в спящем состоянии. И его наличие будет стимулировать все компании, в том числе находящиеся в нероссийской юрисдикции, к исполнению законодательства РФ», — сказал Жаров на итоговой коллегии Роскомнадзора, комментирую проект.\n\nКакие же они там все ебанутые бараны.",
				"added": 1555410187
			},
			{
				"comment_id": 31,
				"body": "> [deliriumgoddess6](#comment_37_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): не забываем о будущем глобальном интернете от Илона Маска. Правительство, правда на словах, обещало их глушить.\n\nА спутниковый wifi-роутер вы где возьмете? Уже отмечалось что ввоз этого оборудования в Россию будет запрещен. Если уже не...",
				"added": 1555497375
			},
			{
				"comment_id": 32,
				"body": "Качайте, люди, себе в оффлайн Флибусту, Википедию и мешок магнетов пока не поздно. \nИ можно окукливаться - выживем )\nЯ лично так и сделал уже.",
				"added": 1555504649
			},
			{
				"comment_id": 33,
				"body": "> [dece](#comment_2_19XMDZt5z1ACRUAaoH67935RZDMQHErxmD): Та это просто очередной распил бюджета :) Вот увидите. Уже выиграли ведь тендер :)\n\nОдно другому не мешает. Они и спиздят 50% денег и испортят интернет. Вот увидите )",
				"added": 1555582594
			},
			{
				"comment_id": 34,
				"body": "Закон писали малограмотные маразматические старики с помощью некомпетентного ворья, которое нагреет на этом карманы. Это не фигура речи, это научный факт.\n\nНа самом деле, ИТ-специалисты которые как-то пытаются комментировать закон отмечают что никто не понимает КАК ИМЕННО будет работать технология Чебурнета - ни сами ИТ-специалисты, ни тем более умалишенные малограмотные старики это все придумавшие.\n\nПоэтому вопросы типа \"а двусторонняя ли связь?\" или \" какова степень ограничения на транзитных узлах?\" смысла на данный момент не имеют. Как сделают, так и сделают.\n\nНо можно догадываться что сделают как обычно по \"worst case scenario\", все сломают, ничего не будет работать, даже то, что по их мнению должно. Посмотрим.\n\nМогу сказать только что некоторые мои знакомые, весьма далекие от околополитических вопросов и давно проживающих во внутренней эмиграции уже высказались в том смысле, что пойдут громить \"местный райком партии\" (не буду уточнять какой партии) непосредственно сразу после отключения глобального интернета...",
				"added": 1555921269
			},
			{
				"comment_id": 36,
				"body": "> [deliriumgoddess6](#comment_42_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): ну они могут просто сделать по технологии КНДР.\n\nОни в идеале это и хотят. Но у них не получится. В Китае интернет вообще по другому устроен, от слова \"совсем\".\nА вот сломать наш нормальный интернет у них очень даже получится.",
				"added": 1555958313
			},
			{
				"comment_id": 37,
				"body": "\"Говорят, что депутаты только все запрещают, но это совершенно ложное представление. Запрет - это как раз есть то, где человек свободен, потому что он говорит: это нельзя, а все остальное - как хочешь. Что такое право? Это и есть самая большая несвобода. Я вам могу сказать, что чем больше прав у нас будет, тем менее мы свободны, потому что право, в отличие от запрета, это когда ты должен действовать, и только таким образом, как написано в законе. То есть ты должен заполнить бумажки, их куда-то отнести, сходить в суд - то есть это целая гамма действий, в результате - ты несвободен. Чтобы какой-то результат получить, тебе нужно очень много сделать. Поэтому не надо к этому стремиться, к регулированию только правами. Поэтому чем больше прав, тем больше несвободы\", - завершила цепочку умозаключений парламентарий.\n\nЭто надо в золоте отлить. Чтобы понять и запомнить навсегда степень их охуевшего безумия. \n\nИ конечно, их надо будет всех судить и надолго изолировать от общества. И все их законы пакетом отменять.",
				"added": 1556006884
			},
			{
				"comment_id": 38,
				"body": "> [kiraioshikage](#comment_4_1HCrHxcDShSn2H1rTBLkYYpScn7BhF3wLa): Если уже не Митинский Радиорынок и им подобные - видели бы вы, сколько там всего..\n\nНу значит еще все впереди )",
				"added": 1556031065
			},
			{
				"comment_id": 42,
				"body": "> [deliriumgoddess6](#comment_45_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): кндр - северная корея, а не китай. Но суть понятна:)\n\nА, ок )\n\nНо какая такая \"технология\" в Северной Корее? Там просто нет сколько-нибудь значимого количества публичных сетей связи и персональных компов у населения в принципе. Вот и вся технология.\n\nУ нас это все есть и это уже не убрать.",
				"added": 1556266666
			}
		],
		"3_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 35,
				"body": "Чем хуже, тем лучше (с)\nСамый темный час - перед рассветом (с)\nОдна капля переполняет чашу (с)\nЛегкая соломина ломает верблюду хребет (с)\nРабота не волк - в лес... ой, это не то...",
				"added": 1555921871
			}
		],
		"11_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 39,
				"body": "Это какое-то мертвое дремучее старье. Можно не обращать внимание, имхо.",
				"added": 1556038817
			}
		],
		"2_1HEgim6JmWnJtP5j4MwCZmnL6DuxPHZAna": [
			{
				"comment_id": 40,
				"body": "У них флешмоб какой-то. Они это школолошное говно везде форсят.\nОно давно не развивается и не опен.\nМне думается, надо мимо проходить.",
				"added": 1556093188
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 41,
				"body": "Да нееет... Ну какой же он пидор. Он сказочный долбоеб. \nhttps://zona.media/news/2019/04/23/neuvazhenie",
				"added": 1556113110
			},
			{
				"comment_id": 44,
				"body": "> [midnight](#comment_1_1D6npYBZc43Bv1a62Fg689SDcFdthJSFt): Почему \"Вы\" постоянно ругаете Путина?\n\nhttps://putinism.wordpress.com/\nПросвещайся. Не благодари.",
				"added": 1556388407
			},
			{
				"comment_id": 47,
				"body": "> [arktur](#comment_3_15Ju8XcwDDYi74R9WZRks3RGyHVApvLxNv): \"короля делает свита\", а свиту выбрали такие как вы... Наслаждайся, развлекайся, истери\n\nТы когда ВЫБОРЫ тут видел?\n\n> [arktur](#comment_2_15Ju8XcwDDYi74R9WZRks3RGyHVApvLxNv): Ты хотел сказать деградируй...\n\nЯ знаю что я хотел сказать...",
				"added": 1556622771
			},
			{
				"comment_id": 55,
				"body": "https://putinvor.wordpress.com/2019/05/14/hand/",
				"added": 1557833207
			},
			{
				"comment_id": 56,
				"body": "> [ks7715](#comment_6_16NJNN8b3jUEAGtVWoPR1vkEPkXX6BQWAY): Хм, надо же.. даже тут путинисты есть.. ребят, на зарплате?\n\n...или просто малограмотные мудаки. Этого тоже исключать нельзя.",
				"added": 1557833259
			},
			{
				"comment_id": 58,
				"body": "> [yp343vy2yp](#comment_1_15LugVbCkjPr8AZS7L8mitSe2ddFxfbpDQ): если так, то возникает вопрос: \"Как у них руки до zeronet'a дотянулись?\"\n\nМежду МАЛОграмотные и БЕЗграмотные есть небольшой просвет, в который как раз помещается порог вхождения в ZN )",
				"added": 1558342136
			},
			{
				"comment_id": 61,
				"body": "> [zerg0](#comment_3_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): По моим субъективным впечатлениям, основную массу здешнего контингента составляют \"товарищи майоры\" и иже с ними, старательно косящие под криптоанархистов, наркоманов и прочих педофилов\n\nНикак нет.",
				"added": 1559915346
			}
		],
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 43,
				"body": "> Я хочу предложить популяризировать Zero своими силами, а именно просить авторов любимых сайтов портировать их к нам.\n\nЕсли не вдаваться в глубины - это не реализуемо технически почти никак. Конец истории.",
				"added": 1556353957
			},
			{
				"comment_id": 46,
				"body": "> [kalidman](#comment_4_1PNNLHx1b2tCBWA8B8TkW4r9rCEi7TeTKy): Так объяснил бы почему. Схренали нам тебе верить на слово. Вдруг шпиёнъ?\n\nСхренали мне тебе что-то объяснять? Гугли.",
				"added": 1556622596
			},
			{
				"comment_id": 48,
				"body": "> [promusik](#comment_71_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Кому нужно тот знает про ZeroNet. Остальных тащить сюда смысла нет. Просто нам здесь нужно сделать уютный уголок, создавая уникальный контент и поддерживая беседы.Как вариант меньше политоты. А то даже Ru-ZeroTalk уже засрали политотой. Прямо поговорить больше не о чем.\n\nПолитота сама исчезнет когда общество перестанет болеть. Других вариантов нет. А пока  - терпи. \nНе терпишь - выпились из ruZN. \nИ не ной, пожалуйста везде...",
				"added": 1556957448
			}
		],
		"1_1JAiKS3giLzSw1YQWZPVAct377nyiApDW2": [
			{
				"comment_id": 45,
				"body": "Пока путин у власти - нет.",
				"added": 1556388498
			}
		],
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 49,
				"body": "> [promusik](#comment_74_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Как бы запретить ZeroNet ещё распространять эту дрянь, чтобы я не раздавал?\n\nПлак-плак-плак (((",
				"added": 1556957498
			}
		],
		"1_1DESK8jcspe5Vm7YzVunRWbirYNLBtVPWF": [
			{
				"comment_id": 51,
				"body": "> [chameleonlamer](#comment_1_1EyTnQJ7zvCeBQopfDkA8isW3jvjFsJqUT): Пруфы в студию пожалуйста ???\n\nВ гугле забанили?\n\nПсевдо-не-псевдо, но камикадзе это бывший нашист. Если вообще можно быть \"бывшим\" нашистом...",
				"added": 1557129867
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 52,
				"body": "http://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1557220140
			}
		],
		"1_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 53,
				"body": "> [zerolespero](#comment_20_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL):  тогда предлагаю воспользоваться vpn/proxy которые ведут трафик до калифорнии (или одного из датацентров гугла)\n\nИ то не 100%, кто знает как они там маршрутят местный трафик...",
				"added": 1557310340
			}
		],
		"2_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp": [
			{
				"comment_id": 54,
				"body": "> [ruslan777c](#comment_1_1PmTT7rXXV3k1cEr4ecFR3DPEbR2biHbuj): а чем доказывается существование квантовых компьютеров ( не чем это все домыслы )\n\nКакое-то нашествие забаненых в гугле, епрст...\nЕсть фактические доказательства работы квантовых эффектов в вычислениях на КК. \nИщите, все есть в открытом доступе.",
				"added": 1557322464
			}
		],
		"2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 57,
				"body": "ну везде нанекропостил...",
				"added": 1558287683
			}
		],
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": [
			{
				"comment_id": 59,
				"body": "бгг",
				"added": 1559646319
			},
			{
				"comment_id": 60,
				"body": "О. А вот и py3",
				"added": 1559820465
			}
		],
		"1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq": [
			{
				"comment_id": 62,
				"body": "> [zerg0](#comment_9_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): Любопытно. Недавно заметил, что пропали не только некоторые мои сообщения, но и сами темы которые я комментировал. Кто нибудь знает в чем дело?\n\nЯ удалил.",
				"added": 1559915370
			}
		],
		"3_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": [
			{
				"comment_id": 63,
				"body": "ИНДЖОЙ\nhttps://twitter.com/mudakoff/status/1138031082920697859?s=20",
				"added": 1560194538
			}
		],
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 64,
				"body": "Святые слова",
				"added": 1560503209
			}
		]
	},
	"comment_vote": {
		"2_1FEGP7L4jZNzq27DHXZSWXpYpFyuTNgm9u": 1,
		"30_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1,
		"3_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": 1,
		"29_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1,
		"1_1H75ENVJZAW6gzEgmwzxYqrC5Z6MrnXSyM": 1,
		"3_1JYTJbkJjERFUC2ngeEk2tYBqKBdci5g77": 1,
		"8_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"1_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ": 1,
		"44_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"4_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ": 1,
		"20_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": 1,
		"14_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"11_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"85_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"11_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp": 1,
		"67_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"3_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": 1,
		"58_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"57_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"4_1G8uRPFZNoeU4PejqGuL8yBAA22ymDh41M": 1,
		"2_1DESK8jcspe5Vm7YzVunRWbirYNLBtVPWF": 1,
		"154_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"20_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"72_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"11_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"2_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"29_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"3_1CTXZrGJQiFjTappyJ3dJpuyb7Wecw7iSp": 1,
		"31_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1
	}
}