{
	"title": "Ace's ZeroNet Exploration",
	"description": "ZeroNet feels different, it works differently, it's opening up possibilities that weren't available before - I'm here to explore what ZeroNet is and what it can be",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 34,
	"demo": false,
	"modified": 1458503791,
	"post": [
		{
			"post_id": 33,
			"title": "Hello Haaretz!",
			"date_published": 1458503703.934,
			"body": "Hello from ZeroNet!"
		},
		{
			"post_id": 32,
			"title": "The full version of the Tanakh (Hebrew Bible) is available on ZeroNet",
			"date_published": 1457636515.001,
			"body": "As part of my continuing involvement with ZeroNet I've been asked by a friend of mine, [Alex](http://totseret.com/alex), to put the entire Tanakh (תנ\"ך) on ZeroNet as way of demonstrating ZeroNet's abilities. The result is [Tanakh.bit]( http://127.0.0.1:43110/tanakh.bit) - a mixin of ZeroID's lovely intro just to get some color in there, and a touched-up version of [this freely available Tanakh](http://www.mechon-mamre.org/dlt.htm).\n\n[![tanakh.bit](http://i.imgur.com/FLeQCWj.png)]( http://127.0.0.1:43110/tanakh.bit/)"
		},
		{
			"post_id": 30,
			"title": "Looking for a ZeroNet dev? Encrypted is taking on jobs...",
			"date_published": 1457455886.454,
			"body": "So I believe it's a first (simply because I haven't stumbled upon something like this before) on ZeroNet - [a dev has created a simple site](http://zero/1JKKd6DUhaNvWVuaBtNHS948og3JNd7qZM) poaching his web development skill for anyone who needs those.\n\n[![The ad](http://i.imgur.com/davPiRB.png)](http://zero/1JKKd6DUhaNvWVuaBtNHS948og3JNd7qZM)\n\nI think it's excellent that it's happening I hope that Encrypted get's a lot of requests so that he can tell his story to his developer buddies and bring even more developers to work in/on ZeroNet!"
		},
		{
			"post_id": 29,
			"title": "A new experiment shows how to create decentralized IDs on ZeroNet",
			"date_published": 1457454677.913,
			"body": "[@nullpo published](http://talk.zeronetwork.bit/?Topic:3_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar) a new text-board that he's been working on that works without any central identity provider like ZeroID but instead creates its own identities for the users using bitcoin-js lib, [Stefan Thomas](https://www.linkedin.com/in/justmoon) will be happy to know that his library is still finds new uses :)\n\n![Nanasi Text Board](http://i.imgur.com/v8kHm8K.png)\n\nThis could be a great start for anyone who wants to have a completely detached system that needs identities but doesn't want to be bound to a 3rd party identity provider.\n\n![The announcement comment (if you can call it that...)](http://i.imgur.com/wi0AuUg.png)\n\nAfter creating the identity your ZeroShell will have a new ID associated with your account that ends with @nanasi that you can use anywhere else on ZeroNet - so basically we're seeing here is a different method to create IDs for use within ZeroNet (that claim needs to be verified) - excellent pioneering work by nullpo.\n\n![New @nanasi ID](http://i.imgur.com/tactvWa.png)\n\n====================\nUPDATE\n\nI've just noticed that you can't use the @nanasi ID on other zerosites, it's there for you to select, but it's not available to be selected. Interesting.\n\n![Can't click it](http://i.imgur.com/l9TVJCK.png)\n\nUPDATE 2\n\n[@nullpo] was kind of to mention that in fact a zerosite owner can decide to allow usage of @nanasi identities - which I think is pretty awesome functionality to have.\n\n> Oother zerosites can accept the nanasi accounts with this appended to cert_signers in data/users/content.json etc.:\n> `\"nanasi\": [ \"16PmAP6z2MCJX9jNjvMrteMfnqX4KeDRNT\" ],`\n> if the site creator doesn't mind accounts without uniqueness guarantee, and proofs of work or IP filters that (non-bitmessage) ZeroID can potentially provide.\n\n[@nullpo] doesn't recommend to actually use @nanasi particularly because he's actively experimenting on @nanasi identities (experiments that we all hope to see more of!).\n\n"
		},
		{
			"post_id": 28,
			"title": "Hello TMS!",
			"date_published": 1457443185.691,
			"body": "Hello Thomson Reuters Machine-learning Services from ZeroNet!"
		},
		{
			"post_id": 27,
			"title": "Another excellent built in feature - The user controls how much space the app takes!",
			"date_published": 1457400992.124,
			"body": "This is highly significant and gives a clear advantage over AppStore or Google Play style of control.\n\n![Nope, not gonna let you.](http://i.imgur.com/bsYoWm0.png)"
		},
		{
			"post_id": 26,
			"title": "Wow! Setting up a domain is far easier than DNS configuration",
			"date_published": 1457399390.175,
			"body": "I keep finding myself awestruck by the simplicity of ZeroNet's choices.\n\nAfter buying my domain name (and a bunch of others 😅) I proceeded to figuring out how to connecting it to my website. My first step was [ZeroName](http://zero/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F) and lo-and-behold, at the bottom of the page we have a little 'How to add a domain?` button that reveals the two simple steps that are needed to be done.\n\n![The steps on ZeroName](http://i.imgur.com/XQlxKLV.png)\n\nI configured my domain name and added the following JSON to my custom configuration section:\n```json\n  {\"zeronet\": {\"\": \"1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH\"}}\n```\n![Namecoin FTW!](http://i.imgur.com/RM70z6W.png)\n\nand updated my content.js file with the new domain:\n```json\n  {\n    ...\n    \"domain\": \"acehigh.bit\",\n    \"files\": {..},\n  }\n```\n\nThe Namecoin configuration didn't need any additional action besides clicking OK after adding the custom JSON config, but for ZeroNet there is another step we need to do and that's to sign and publish the new changes.\n\nI ran `$ zeronet.cmd siteSign 1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH [priv_key_reducted]` that did it's thing (be aware here - if you see something other than a successful message at the end of the output you might have done something wrong), and then I fired `$ zeronet.cmd sitePublish 1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH` and that finished almost instantly letting me know that it was published to 3 peers.\n\n![Signed and ready](http://i.imgur.com/95HipV8.png)\n\nAnd to make life simpler for you the reader, here are the steps copied from ZeroName for your convenience:\n\n## To register just add 'zeronet' key to your namecoin domain.\n\nThe \"\" key means the primary domain, any other than that is a subdomain. \n\nExample:\n```json\n {\n    \"name\": {\n        \"formatted\": \"ZeroNet project\"\n    },\n    \"bitcoin\": {\n        \"address\": \"1QDhxQ6PraUZa21ET5fYUCPgdrwBomnFgX\"\n    },\n    \"zeronet\": {\n        \"\": \"1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr\", \n        \"blog\": \"1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8\", \n        \"talk\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\"\n    },\n    \"ns\": [\n       \"ns1.domaincoin.net\"\n       \"ns2.domaincoin.net\"\n    ]\n }\n```\n \nAfter the changes confirmed by Namecoin network the domain will automatically added to the registry and anyone can access your site using the registered domain.\n\nTo make the homepage (ZeroHello) link to your site domain you have to add a \"domain\" key to your site's content.json file, for example:\n```json\n {\n  \"address\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\", \n  \"background-color\": \"#F5F5F5\", \n  \"description\": \"Decentralized forum demo\", \n  \"domain\": \"Talk.ZeroNetwork.bit\", \n  \"files\": {\n  ...\n ```\n\nDone.\nNo, really - done."
		},
		{
			"post_id": 25,
			"title": "New domain, sorry for the outage!",
			"date_published": 1457398304.795,
			"body": "So I'm trying to setup a domain name for the blog, and I published the content.js before the namecoin change went through, so now we're in limbo - ZeroNet sends my site to the domain, but the domain is not resolving because no one knows about the new DNS configuration :)\n\nI hope everything will go back to normal soon!\n\nYou can still access the site via the old address: [zero/1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH](/1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH)"
		},
		{
			"post_id": 24,
			"title": "Hello TauChain!",
			"date_published": 1457393221.36,
			"body": "Hello from ZeroNet!"
		},
		{
			"post_id": 23,
			"title": "I just installed my first site - that was EASY!",
			"date_published": 1457387808.004,
			"body": "After my last experience trying to get my hands on .bit domain names that didn't went as smoothly as I hoped it will (mind you, I'm very particular about the quality of the user experience that I like), just now I had a few minutes to tinker around with creating my own site, and that was far easier than I thought!\n\nAdmittedly I'm fairly comfortable in command-line interfaces so I had no problem typing in some `createSite`, `signSite`, and then `publishSite` to get my first ugly (but I love it) ZeroSite up in the air.\n\nConsidering the alternative such as Heroku, CloudApp, Cloud9, and a few others that gives you the \"easy to setup website\" pitch, ZeroNet is an order of magnitude simpler and easier to setup and get going.\n\nI'm utterly impressed."
		},
		{
			"post_id": 22,
			"title": "The Next Internet is Already Here",
			"date_published": 1457358819.405,
			"body": "=================\nWORK IN PROGRESS\n=================\n*Note to self: Need to have drafts.*\n\n20 years ago our society was baffled by the idea of the internet. just look at this [short video from the Today Show from 1994](https://www.youtube.com/watch?v=UlJku_CSyNg) and you'll get a good idea of how our culture perceived the concept of the internet back then.\nZeroNet is far easier to explain nowadays, but don't expect the general perception of ZeroNet to be anything else than that of the internet 20 years ago - people today know what the internet is, or at least they think so; The internet is Facebook, it's Google, it's Apple, it's our Smartphone, it's the movies that we download.\nWe're all pretty used to the idea, we all have a good understanding of how this thing works, even with concepts such as *The Cloud* we seem to go along just fine - the Internet is where you get content - some server hosts your stuff, you navigate your browser to Google to find that server, you type in some words to google, google checks out it's massive databases to see what is the most relevant website in relation to your search query, presents the results to you the user, and now you can click on a link and go to this different website that has what you need.\nAll very simple really - users have browsers to download and view content that server are hosting and processing.\nZeroNet is different. It's different first and foremost in the basic infrastructure that holds the internet - while the internet is built on distributed and decentralized client-server architecture, it relies heavily on knowing what server hosts what data and what domain is pointing to what server - a centralized DNS architecture, in ZeroNet there are no servers, there are no DNS servers, there are no Bouncers, there are no cloud providers. With ZeroNet one does not need to pay a hosting company to deliver their content to their users - with ZeroNet all you need is to create your website and then just share it with others - if they like it, they'll share it some more, and your content will reach more users faster.\n\nReddit, SlashDot, or Hacker News \"effect\" is different on ZeroNet - while on the regular internet if your puny website that is used to be served to a few dozens of visitors on a weekly/monthly basis is suddenly your content hits the front page of Reddit or Hacker News, you'd experience the Reddit Effect - the effect that causes your site to crash because your web hosting service just wasn't prepared for this - it had the appropriate resources for a small website that serves a few thousands of requests on a monthly basis, now crashes under the weight of millions of viewers that are sent from other popular website.\nWith ZeroNet the opposite will happen - if your site suddenly becomes popular everyone will have a far better experience with it because of the architecture that puts the hosting of the static files needed by the users to interpret your website are hosted on individual users computers, much like the movies and TV shows that we download from The Pirate Bay (or similar trackers) that are not hosted on any server, similarly ZeroNet content is not hosted on any server - it's all on the users computers - and the more users are trying to access a given website, or ZeroSite, the better the experience they all have - content loads faster instead of slower, the site is more responsive instead of becoming sluggish to a crawl, and the costs of any individual sharing the site is dropping dramatically unlike with traditional webhosting where the owner of the site would need to pay for the storage and bandwidth, here the collective users that enjoy the website are sharing the load of hosting it and serving it and the more individuals have the same file the less they collectively need to do to get it to more users.\n\nThis brings me to why ZeroNet is the next internet - one of the largest problems we have on the internet today is the cost of hosting an application or a website. That cost is being offset by the site/app owner implementing either a paywall around the site/app, or blasting its users with advertisements - both of which are hated by the users at large, including the users that are producing the content (see Kanye's recent Pirate Bay fiasco, or RIAA employees employees that were found with dozens of pirated movies on their laptops).\n\nWith ZeroNet there is no need to \"pay for the quality\" - unless you want to profit from your content, you have no reason to erect paywalls or plaster ads all over your application, and the users will also chose to move away from such business models once the alternatives show up. Facebook - keep your ears perked here, your business might be at risk if you don't act accordingly.\n\nTo be honest that is just the tip of the iceberg - ZeroNet is much larger than just saying 'There are no servers' - saying just that would be utterly underestimating the value that ZeroNet brings in - which is the empowerment of the open web.\nFor the past decade I've been building my career as a Front End Developer, primarily focusing on building web sites and apps using Javascript, HTML, and CSS - I've recognized the opportunity and the potential in the open web platform early in my career, and decided to focus heavily on developing those skills and learning anything and everything that might be relevant.\nThe reason for that is that I think that Javascript will eventually become the Lingua Franca of computer-to-human and human-to-computer of the web - meaning everyone and everything will be able to use this language to communicate - simply because it's good enough at doing that today, and because there are more devices that can run Javascript than there are devices that are connected to the internet, every new connected device such as a drone, or smart thermostat, or a tiny computer like Raspberry Pie that comes out these days supports Javascript out of the box.\nOne of the key reasons I fell in love with the open web platform is because it is open, look at any website or webapp that you like, right click anywhere on the screen and click 'View Source' - instantly you get all the information you need to understand how to recreate the same functionality and see how the developers did whatever it is that your interested in. This simple fact of life on the internet has enabled the high quality of products that we see now so readily available to anyone who needs them.\nMarketplaces like ThemeForest and free content platforms such as GitHub are providing a great service to our society as a whole - they enable us to build on top of lessons learned by others, experiments done by others, and tools developed by others so we can focus on building WhatApp, Facebook, Instagram, Reddit, and many many others - are products are becoming exponentially better because they incorporate all that the others have learned and on extremely short time scales.\nZeroNet reduces the time between seeing and copying even further by making the Clone ability a core built-in functionality that is available out of the box - if you see something you like, maybe ZeroHello, or ZeroTalk, you can instantly copy it and run your own version (and modify it if you wish) by simply clicking Clone.\nThis will accelerate the development cycle of the open web even more and we'll see amazing things start popping up everywhere and immediettely their copies using spreading like wildfire - everything we know about memes is absolutely applicable to ZeroSites - these tiny torrent files that contain some HTML, JS, CSS are the evolution of memes from basic textual formats, to images, then images with some text on them, then moving gifs... and now ZeroNet. If you've seen a gif that you like or a meme that you want to use, all you need to do is search for the source - the same is true for ZeroNet sites, only that copying and modifying ZeroNet sites is far easier than modifying a gif file or a youtube video.\n\nZeroNet is right now a fast, real-time, peer-to-peer, fully decentralized and distributed alternative to often-slow, client-to-server, overly centralized web application delivery stack - the internet.\n\nWith ZeroNet right now you can reach millions[1] of people who would gladly help you distribute the workload of storing and sending your data across the users of the site without investing any money into costly servers or any kind of infrastructure - everything is provided for free.\n\nThis is Bitcoin's killer app, and it's probably going to be bigger than Bitcoin and much faster. So perk your ears and open your eyes - because we're witnessing the transition from the internet - client-server architecture - to the zeronet - client-client architecture and it's going to be an exciting thing to witness.\n\n[1] More like thousands right now, tbh"
		},
		{
			"post_id": 21,
			"title": "Updating versions? ZeroNet got you covered",
			"date_published": 1457307812.618,
			"body": "![Update!](http://i.imgur.com/rzHVsnl.png)"
		},
		{
			"post_id": 20,
			"title": "Setting up a custom domain name, not that easy...",
			"date_published": 1457300502.033,
			"body": "So far my experience with ZeroNet was phenomenal - most of the things that I need or expect are there, and almost everything works, and works well. This is no easy feat, ladies and gentlemen, people have poured many hours of hard work into developing this platform for me to be able to deliver these words to you as easily as we witness it.\n\nI credit the high quality of work that goes into this project on account of the ZeroNet leadership choosing to use **existing tools** over trying to build everything from scratch.\n\nWhile competing technologies are either being rumored or actively tested in the wild, none are even comparably as easy to use as ZeroNet, their usefulness is primarily theoretical while ZeroNet allows me to talk to thousands of people right now using the browser as the Virtual Machine that executes the content of the ZeroSites that we so easily share amongst us, while the competitors promise of Turing completeness and advanced language mechanics, ZeroNet simply works right here, right now.\n\nWhat is the difference? ZeroNet uses a lot of existing tools and technologies - Data distribution/storage? Bittorent, Email? BitMessage, Identity management? Bitcoin's crypto (which is 100% compatible with bitcoin which makes it even more useful!), Virtual machine? The Browser!, Domain management? Namecoin, Anonymity? Tor Yes Sir!\n\nYou see, the developers realized that what was needed is a good tie-in between these mostly useless tools in their stand-alone model, using ZeroNet we get the benefits of all of these tools and technologies and their individual value increases orders of magnitude now that they're so well woven together into one simple use interface.\n\nAlthough the devs are doing an excellent job of tying in those tools together, they not necessarily have the ability to fully extend their development skills to those tools that they're employing, and one such example is the domain name registration process which is \"offloaded\" to Namecoin.\n\nUp until yesterday my interest in Namecoin was pure academic, and by that I mean I knew about its purpose and existence, planned several times on using it similarly to how ZeroNet is using it in my own projects but never actually got the opportunity to buy Namecoins or register .bit domains.\n\nBeing a long-time Bitcoin user I got used to the advancements we've made in the past 5 years in wallet technologies, with the ability to choose between a plethora of different wallets on any platform with different features that suit anyone's needs - I was taken aback when I downloaded and installed the Namecoin wallet - it's basically 2011's bitcoin wallet.\n\n![ZeroSites, eh?](http://i.imgur.com/rqw6hTx.png)\n\nSo far my experience was somewhat okay, but far more lacking than what ZeroNet is able to provide until now - I purchased 10nmc off of [shapeshift.io](https://shapeshift.io) - which took about 1 minute to setup, about 3-4 hours for the exchange to actually be executed (I guess Namecoin isn't traded as often as other crypto-currencies), and then another 2-3 minutes buying the domain names (I still haven't configured them though...).\n\nAll of that is only after I've downloaded the namecoin wallet and waited about 9 hours until it synchronized with the network, at times it felt like the progress bar is stuck on that dreaded `255 weeks behind` message.\n\nAfter all said and done, I think the process is fairly simple and even technically-challenged people can go through it with some persistence and focus. Furthermore I think that domain management services will be one of the first apps to be successful on ZeroNet as a business model (apart from the usual suspects - porn, piracy, and drugs) which in turn will solve the problem altogether and make the process as simple as creating a ZeroID."
		},
		{
			"post_id": 19,
			"title": "PSA: Using ZeroNet with the default configuration is exposing your identity to anyone on your network!",
			"date_published": 1457298301.05,
			"body": "If you install ZeroNet client and run it using the default configuration, i.e. not in [multi-user mode](http://127.0.0.1:43110/159bRwxjgvNGfhvXw1qzXsTPjenMzy2P4n/?Post:3:Using+the+Multiuser+plugin), anyone who tries to access your computer through your local network, using your machine name or ip address, will see ZeroNet through your identity!\n\nI've realized this once I tried to access my local ZeroNet node on a different computer on the same network, and there my keys were - readily available to be used or abused by anyone who's on the same wifi network as I am.\n\nSo be careful out there, I'm going to try switching to multi-user mode and will report back with findings as I think this is the only reasonable way to safely and securely access ZeroNet considering how easy it is to lose your identity key files.\n\n---\n\nUpdate: It seems that ZeroNet is by default indeed bound to the 127.0.0.1 IP address is NOT ACTUALLY ACCESSIBLE from the outside.\n\n> **nofish**: By default ZeroNet binds to 127.0.0.1, so remote access is not possible. *[source](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:5_1Kg7CXZM5h3wTPENsTDwWUmRBf9VhYy2cW/PSA+Using+ZeroNet+with+the+default+configuration+is+exposing+your+identity+to+anyone+on+your+network)*\n\nSo the problem is not as bad as I thought - no one on your network can actually access your account(s), but if someone else on the same machine tries to access localhost:43110 (if you have siblings for example that use the same machine but different user) they will have access to your identity."
		},
		{
			"post_id": 18,
			"title": "Things that aren't on ZeroNet just yet",
			"date_published": 1457296630.024,
			"body": "I personally have waited quite a long time for something like ZeroNet - furthermore, I've been toying with a very similar idea for at least 5 years - ever since I've found out about bitcoin, maybe even sooner.\n\nNow that it exists, there are some very interesting things we can do with it, and I want to start right away... but a moment before I do, I explore what's around me and postulate what could be based on what I see, the result (or at least a very small subset of it) is the following:\n\n## Isometric world powered by the users\nSo you've probably heard of Minecraft by now, and you probably know that it's a very addicting game although it's very simple (well, at used it used to be, nowadays I don't follow anymore), and because of it's simplicity but diversity users could create the most amazing things that the original creator couldn't even dream of (hat tip to Notch).\n\n![Example JSISO World](http://i.imgur.com/PrUAByS.png)\n\nThis idea is similar in the sense that it gives the user some basic functionality, such as placing a block of some kind on top of another block, or breaking existing blocks, and augmenting the experience so that the game has some basic economics associated with it.\n\nAmong the features that I envision for such a *game* are: Users can buy or rent spaces among themselves, they can use custom sprites (images) to be displayed on their models, all the content is in one single world that all users have access to.\n\nHow to build: There are many tools that can be useful here, but http://jsiso.com/ jumps out immoderately as a prime candidate (the image above is of one of JSISO's demos) as it's easy to use and basically comes out of the box with the functionality that I'm looking for - that's for the display side of things, from the machines behind the scenes it looks like it could initially use the same mechanics as the ZeroTalk boards do in terms of data storage."
		},
		{
			"post_id": 16,
			"title": "Managing multiple identities in ZeroNet",
			"date_published": 1457270720.694,
			"body": "One of the most frequent things that come up from the moment that you discover ZeroNet is the \"How do I use a different identity?\" question - and rightfully so - one of the most important parts of ZeroNet is the ability to trust that a piece of content is generated/curated by a specific identity, and if we are all bound to single identity, we are severely limiting the variety of things we can do on ZeroNet.\n\nLuckily multiple identities is almost baked out of the box to ZeroNet, and enabling that is just a matter of tinkering with some configuration files - I haven't done so myself just yet, but I think it'll be useful to have a good starting point to whoever does starts exploring that - and if you do, please share your experience and conclusions!\n\nFor now, I'll just drop a couple of links to some forum posts that will get you on your way to setting up multiple identities:\n\n- [How can I make a new ZeroID ?](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_19y2tY5XJRD3YqFYn9vVgsq74nWBTPUcgv/How+can+I+make+a+new+ZeroID)\n- [How can I create another identity](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2_1DcDDitsjFJohvwonPmpibRChmA7uGxqL7/How+can+I+create+another+identity)"
		},
		{
			"post_id": 15,
			"title": "How many users does ZeroNet have?",
			"date_published": 1457224620.051,
			"body": "I'm not sure if there are any analytics that are available to the creators of ZeroNet that aren't available to the general public, but looking at the list of most popular sites on the left sidebar can tell us an interesting story and give some insight into the size of the network as it is today.\n\n![The list](http://i.imgur.com/vCbmZi5.png)\n\nAside the fact that Play is the most popular service in that list, and by a significant margin from the next in line - an imageboard similar to 4chan, we can see that it has about 2,300 users. Play is on top of the list because most of the people that know about ZeroNet at this point heard of it first on [TorrentFreak's article about Play](https://torrentfreak.com/play-p2p-impossible-shutdown-160301/), so piratically all ZeroNet users right now have initially installed Play, or at least a very large percentage of them.\n\n![TorrentFreak Article about Play](http://i.imgur.com/BtADqrq.png)\n\n2,500 users is that a reasonable number?"
		},
		{
			"post_id": 14,
			"title": "The hidden sidebar - Analytics at your fingertips",
			"date_published": 1457222347.851,
			"body": "One of the coolest features that come out of the box with ZeroNet is the sidebar that is part of any ZeroNet site. I don't mean the left sidebar on some website that you have, I mean the one that you pull out from the right side by pulling the number 0 on the top right of the screen of this very page.\n\n![The hidden sidebar](http://i.imgur.com/gJeBt1c.png)\n![The rest of it - or is it?](http://i.imgur.com/l1GEa75.png)\n\nThe data it provides is admittedly basic, but even at that it's quite powerful giving you a glimpse of how many users are actively sharing the website, where are they from (really well done there with the 3D globe guys), the amount of data and storage the site uses.\nA very important feature that lies in that sidebar is the **Identity** field that you can *Change*; doing that will allow you to select what identity you are using to identify to this site - right now there isn't a simple way to manage multiple identities, but this already gives some basic abilities to switch back and forth once you have set up multiple identities or simply to use a unique one specifically for this website, which is thankfully the default option.\n\n![What ID would you like to use?](http://i.imgur.com/m5SL6z4.png)\n\nThere is another important feature that lies in the sidebar - the *This is my site* option that is usually turned off, but can be turned on to reveal a few other settings to make managing a ZeroNet site easier and simpler that any existing web hosting solution - but that's for another post.\n\n![My hidden sidebar](http://i.imgur.com/Fl2BkPM.png)"
		},
		{
			"post_id": 13,
			"title": "ZeroNet means no servers?",
			"date_published": 1457221576.055,
			"body": "So it appears that in order to serve content using ZeroNet you don't need a traditional server.\n\nIn this familiar diagram we have clear roles and responsibilities:\n![Webhosting Diagram](http://devgrow.s3.amazonaws.com/assets/images/internet-diagram.gif)\n\nUsers are requesting content from web servers, these send the files the user wants, and if the user wants to interact with the website, he sends more requests to the server, who in turn does something with those specific requests and occasionally replies with relevant information (think REST APIs); With ZeroNet it's completely different paradigm - there is no server to server the static files, and there is no server-side to intercept the incoming requests and perform actions based on different patterns in those requests.\n\nWith ZeroNet we need to rethink how we interact on a client-server basis, and consider the fact that all there is are users who use the site - although classical server-side with dedicated IP/domain address on the internet might still be useful and relevant, the future of ZeroNet is with application that run on those who have permission to run them or parts of them."
		},
		{
			"post_id": 12,
			"title": "Old saying, New Meaning",
			"date_published": 1457221362.469,
			"body": "![There's no place like 127.0.0.1](http://i.imgur.com/sI13NSh.jpg)\n\n---\n\nThere's no place like 127.0.0.1"
		},
		{
			"post_id": 11,
			"title": "Some essential links",
			"date_published": 1457219846.976,
			"body": "So if you've got this far (meaning this very post), you're probably started exploring ZeroNet and interested in finding out more - I'll try to be helpful and provide some basic links that you need to have to interact with ZeroNet with one way or another.\n\nIt's in no way a [comprehensive][1] list, and I don't claim it to be - but it might grow to be one, especially if you help out by mentioning relevant stuff in the comments section (isn't it awesome that I hadn't had to do anything to have a comments section on my blog?).\n\nSo let's start:\n\n## Misc\n\nhttps://zeronet.io/ - obviously - the homepage of this marvelous tech\nhttp://zeronet.readthedocs.org/en/latest/ - documentation for ZeroNet\n[ZeroNet Presentation](https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub)\n[/r/ZeroNet on Reddit](https://www.reddit.com/r/zeronet/)\n[cryptonbits blog](cryptonbits.bit) - lots of useful information\n\n## Tools\n\n[ZeroNet Protocol](https://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop) - Chrome extension to enable `zero/` protocol browsing on Chrome\n[NullPaste](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?) - Pastebin-style app\n\n[Namecoin Explorer](http://explorer.namecoin.info/) - if you're waiting on your namecoins to arrive, this will be useful...\n\n\n\nMore to come...\n\n[1]: Typos are forever on ZeroNet?"
		},
		{
			"post_id": 10,
			"title": "Exploring ZeroNet? Why not have some fun...",
			"date_published": 1457219481.528,
			"body": "One of ZeroNet's awesome features is that it comes with games to kill some free time (if you have some, let me know...), and knowing the fact that people will easily clone and modify these simple games gives me great hopes about the future of mobile gaming (gone are the days of `In app purchase`?).\n\n[HTML5 Games](/14zQjCbU2BAy3uAUAXN5UJhq8YdAHyzUqK) is a simple website that offers some simple games built in HTML5 - great compilation to be honest.\n\n![Taxi Drift](http://i.imgur.com/jU3FA8g.jpg)\n"
		},
		{
			"post_id": 9,
			"title": "Why are some ZeroNet sites are clonable while others aren't?",
			"date_published": 1457218213.892,
			"body": "When browsing Hello ZeroNet you have the left sidebar that shows the `Connected Sites` - basically sites that you're hosting on your ZeroNet node; if you click the little three dots on the top-right corner of each of those sites you have a small menu that shows some functions you can do, and sometimes it will show a `Clone` function - that allows you to easily clone the site and run your own version (like I did with this blog), but other times it's missing.\n\n![Not to clone :(](http://i.imgur.com/p5VJrKx.png)\n![Clone or no clone](http://i.imgur.com/miSQSlc.png)\n\nAnyone got a lead on why or how is that?"
		},
		{
			"post_id": 8,
			"title": "Chrome plugin to surf ZeroNet with ease",
			"date_published": 1457211398.991,
			"body": "A simple plugin for chrome will make using ZeroNet that much simpler by hiding away the `http://127.0.0.1:43110/` part and replacing it with `zero/` and provides built-in support for .bit domains (which reminds me to find out how I get one for myself).\n\n![NameCoin domains](http://i.imgur.com/xgTdQdA.png)\n\nInstall the extension: [ZeroNet Protocol](https://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop).\n"
		},
		{
			"post_id": 7,
			"title": "Access ZeroNet from anywhere using public proxies",
			"date_published": 1457210520.691,
			"body": "Perhaps you don't can't install a python script on the machine you're using, or maybe you want to access a ZeroNet website on your mobile device so you can't always have a ZeroNet node running - that's where ZeroNet proxies come in handy - they allow you to access all the ZeroNet content without having to run your own node, and for now it's pretty quick too.\n\nA good place to start is to follow this post: [A list of availables public proxies](/Talk.ZeroNetwork.bit/?Topic:1_1MBZrgSwMQMRnMFjQkw2JpwdWRaKo7Eb55/A+list+of+availables+public+proxies).\n\nI'm currently using one of them just to experience being behind a proxy like that - and the experience is pretty much the same. I'm still having some trouble understanding how to setup a multi-user kind of experience, or how I import/export identities, but I'm sure I'll get there (feel free to comment if you have relevant information!).\n\n## List compilation\nhttp://zero.pags.to:43110\nhttp://bit.no.com:43110\nhttps://zeronet.classcoder.com\nhttp://zerobit.io:43110\nhttp://zeronet.crypt.cat:8080\n\nSomeone else has begun maintaining a list of proxies here: [ZeroProxies.bit](http://127.0.0.1:43110/ZeroProxies.bit).\n\n---\n\nProtip: Use the follow button on forum posts to get updates as they develop!\n![Follow in Newsfeed](http://i.imgur.com/VP0ILlg.png)"
		},
		{
			"post_id": 6,
			"title": "Amazing how ZeroNet captivated us",
			"date_published": 1457210119.119,
			"body": "Looking at Google Trends for the search term ZeroNet compared with a few other relevant search terms reveals that in a very short time a very large audiance is suddenly interested in this thing that interested almost no-one just a few days ago.\n\nJust look at [this chart](https://www.google.com/trends/explore#q=zeronet%2C%20namecoin%2C%20blockchain%2C%20Ethereum):\n\n![the aforementioned graph](http://i.imgur.com/b2L3WUI.png)\n\nConsidering that the term is as interesting as `Blockchain` was in 2014, and considering that today you can't go by a news paper or, TV news cast, or business news without hearing about either Bitcoin or Blockchain - I'd say that ZeroNet is very captivating and inspiring, and it's doing that very quickly."
		},
		{
			"post_id": 5,
			"title": "Creating a new website in ZeroNet isn't hard at all",
			"date_published": 1457209511.405,
			"body": "Follow the simple instructions here: http://zeronet.readthedocs.org/en/latest/using_zeronet/create_new_site/\n\nAlbeit requires a little bit of technical knowhow, unlike the [blog creation process](/1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH/?Post:2:Creating+a+blog+is+easy...), creating a website in the firstplace requires knowing some basic technical terms and being able to use some basic tools (like command line terminals).\n\nIf you need help, don't hesitate to ask..."
		},
		{
			"post_id": 4,
			"title": "Finding stuff is possible on ZeroNet",
			"date_published": 1457206021.354,
			"body": "Until google gets here, you can use ZeroSearch: http://localhost:43110/zerosearch.bit"
		},
		{
			"post_id": 3,
			"title": "How does ZeroNet workss",
			"date_published": 1457204134.669,
			"body": "Presentation: https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub\n\n*Note to self:\nCan't attach images or files here; perhaps markdown notation could work as an elementary solution.*\n> Obviously markdown is already enabled - at least links work as you'd expect"
		},
		{
			"post_id": 2,
			"title": "Creating a blog is easy...",
			"date_published": 1457201650.817,
			"body": "So I started this blog, and it seems easy enough.\n\nKeep an eye on this post, I will provide more information...\n\nStart here: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this"
		}
	]
}