{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Kopy Kate - Streaming Torrents / YouTube Alternative",
			"body": "WILL SEED YOUR VIDEOS IF YOU SEED MINE!\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/",
			"added": 1473170911
		},
		{
			"topic_id": 2,
			"title": "Watch South Park Season 20 Premiere - Streaming on ZeroNet!",
			"body": "## Online streaming torrents - Brought to you by Kopy Kate\n&nbsp;\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Topic:21_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4/South+Park+Season+20+Episode+1+Member+Berries\n&nbsp;\n## Kopy Kate homepage\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Home",
			"added": 1474014976
		},
		{
			"topic_id": 3,
			"title": "Watch Captain America - Civil War (2016) - Streaming on ZeroNet!",
			"body": "Brought to you by Kopy Kate - Broadcast whatever the fuck you want!\n&nbsp;\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Topic:5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4/Captain+America+Civil+War+2016\n&nbsp;\nKopy Kate main site:\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Home",
			"added": 1474379837
		},
		{
			"topic_id": 4,
			"title": "Kopy Kate - Streaming Torrents on ZeroNet (v1.2 BETA UPDATE)",
			"body": "NEW SITE LINK: http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n&nbsp;\n**Kopy Kate is back with a vengeance! **\nThe site now features WedSeeded torrents. In other words - the site will take advantage of HTTPs files hosted on free cloud file uploading services (such as Dropbox) in order to provide backup seeding for torrents.\n&nbsp;\nThat'll always remain an option for people who are too lazy to seed their videos, of course (like me, sometimes). If you are paranoid about using Clearnet, then SEED!\n&nbsp;\n**Now streaming - South Park Season 20, Episode 3 - The Damned! ENJOY!!!**",
			"added": 1475151205
		},
		{
			"topic_id": 5,
			"title": "Kopykate.bit - Streaming Video Torrents on ZeroNet",
			"body": "## _KopyKate - Streaming Torrents on ZeroNet_\nhttp://127.0.0.1:43110/kopykate.bit/\nhttp://kopykate.tk/\n\n## NEWS:\n** - 10 new movies to choose from in both 720p and 480p. 10000's more to come by the day! **\n** - Site is now available through a domain redirect on clearnet proxies. This is not to be relied upon, though! **\n** - KopyKate.bit is the new namecoin domain. **\n** - Site was just tested on smartphones. Turns out, it works on android, but not apple! **\n** - New promo video on YouTube: https://www.youtube.com/watch?v=tmNCfQDmab8 **\n** - The more people view the videos, the more seeds.. so do share kopykate.tk as much as possible **\n** - Site will use featured videos as main source of revenue. Featured videos must be free from obnoxious and malicious content. **\n** - Enjoy! **",
			"added": 1479912071
		}
	],
	"topic_vote": {
		"1_15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_1GUpiFeZrzjMZPwzAUWsVvF6vwiSZXeE2h": [
			{
				"comment_id": 1,
				"body": "how did this get 13 upvotes? are there really 13 pedos on here? 0_0",
				"added": 1473989429
			}
		],
		"3_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 2,
				"body": "It can take up to 60-90 seconds to load videos if only 1 peer is connected.. especially on a slow connection!",
				"added": 1474381401
			}
		],
		"1_15Hi7MDddHwzTZmmcsj8MWLpZaDz6mLPXg": [
			{
				"comment_id": 3,
				"body": "Good to see people from China on here. ZeroNet should be going viral in China .. hope it does, anyway. ^^",
				"added": 1474641408
			}
		],
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 4,
				"body": "> [cuntwagon](#comment_7_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): Would you be interested in automating the process of copying content from sites like Vimeo and YouTube to draw more users in?  I know the amount of data is prohibitive but maybe if users could browse videos from those places and then just click something to download and seed then this place would be more interesting sooner.\n\nWell, there would be no point in doing so, you may as well go on YouTube in that case lol\nIf you want to watch blocked videos on YouTube you can also go on Tubeunblock.org. \n&nbsp;\nKopyKate will be all about videos that, you're absolutely Not allowed to post on YouTube. That means copyrighted material, and also controversial material. With the exception of child porn of course, there's zero tolerance for that.. but if you want to post a video about how to synthesize MDMA, how to cook meth, or how to grow weed, for example, then that would be allowed, because it's not hurting anybody. It should be your choice whether you want to use drugs or not.... but when it comes to child porn, children cannot consent to sexual acts, and it causes psychological damage.\n&nbsp;\nSo that can also include music videos and film. Even mp3's are uploadable with Webtorrent, you could even just upload a jpg image and an mp3 song at once, instead of using Movie Maker to blend the two. That's the point of the site.. no DMCA takedowns, no Audible Magic trying to block your videos for containing copyrighted music, etc.\n&nbsp;\nThere's still a lot of stuff you won't find on Youtube, as it gets instantly blocked and deleted. It's one thing to have a katy perry background song. If I were to upload South Park to youtube, it would get deleted, for example.",
				"added": 1475203688
			}
		],
		"4_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 5,
				"body": "That's the clearnet proxy link, by the way. ZeroNet link is here ;)\nhttp://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/",
				"added": 1477129683
			},
			{
				"comment_id": 6,
				"body": "If you have any suggestions for TV shows that you want me to Web-seed every week, feel free to comment.\n&nbsp;\nAlso, for those of you who are wondering - WebRTC does not reveal your IP address if you are behind a VPN. Read the FAQ for more info. You're no more or less safe than you would be using BitTorrent.",
				"added": 1477130105
			},
			{
				"comment_id": 7,
				"body": "NEWS:\n- KopyKate now has a temporary clearnet Domain: Kopykate.tk\n- Get your video featured and seeded for 0.005BTC a month (4USD)! No spam, no malware and no fraud .. contact KopyKate at ZeroMail for more info.\nMore movies coming soon.... stay tuned!",
				"added": 1478960804
			}
		],
		"5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 8,
				"body": "**UPDATE: KopyKate now uses TorrentMedia as the standard client for new film releases. This should speed up torrents significantly. TorrentMedia is better than WebTorrent.Desktop for mass-seeding, but it surprisingly works faster if it is minimized compared to Windowed mode. This might have something to do with the CPU and bandwidth consumption of certain Node.js modules. **",
				"added": 1479989372
			},
			{
				"comment_id": 10,
				"body": "> [robin](#comment_1_16KbrDtZC4YXAc9nCy7qT47h6CXFMhmfDE): Any way to easily view the movies in webtorrent.desktop?How can i help seed the movies?\n\nYep. If you just click on the Magnet icon under the video player, it will immediately download to WebTorrent.Desktop, if you have it installed. Otherwise, just right click on the magnet icon, copy link address .. and then Open Torrent Address in the torrent client. cheers",
				"added": 1481412848
			},
			{
				"comment_id": 11,
				"body": "**UPDATE:**\n**- Added new TV show BrainDead. All past episodes are currently being encoded for online streaming. Once it's finished, new episodes will be added as soon as they're released.**\n**- Improved seeding of KopyKate torrents thanks to additional software testing.**",
				"added": 1481413065
			}
		],
		"1_1AZ5bNnWAxgdNSGGSHMRYQTMuv6qvXfTGW": [
			{
				"comment_id": 9,
				"body": "Hi Alex Jones. Been running out of ideas lately, haven't ya?",
				"added": 1481319854
			}
		]
	},
	"comment_vote": {
		"1_1CpD9pJGi6NgHTJvp9ag9HtmvXow5XHebE": 1
	}
}