{
	"title": "Блог одного Товарища",
	"description": "Авторский и не очень креатив",
	"links": "Nothing here yet",
	"next_post_id": 4,
	"demo": false,
	"modified": 1505011360,
	"post": [
		{
			"post_id": 3,
			"title": "Рэндалл Дэджис: 5 утра",
			"date_published": 1504962372.618,
			"body": "Всю мою жизнь я был человеком, который спит до двух часов дня, а потом просыпается и делает что надо. Всю мою сознательную жизнь я был _бодрее_ и активнее ночью, чем днем.\n\nБодрствовать ночью _естественно_ для меня. Это всегда так было.\n\nНо две недели назад я решил несколько изменить распорядок и попробовать что-то новое. Вместо того, чтобы просыпаться в час или в два часа дня, я дал себе слово, что в течение месяца буду просыпаться в пять утра. С понедельника по пятницу.\n\nНо это не всё.\n\n* * *\n\nПоверх этого я еще сделал себе новый график. Несмотря на то, что я обычно не придерживаюсь никаких расписаний, я решил, что в попытке вытащить себя из зоны комфорта (и стать более хорошим человеком), я буду вкалывать на полную этот месяц, придерживаясь строгого расписания и поддерживая интенсивный распорядок дня.\n\nЯ хотел бы воспользоваться этой возможностью и отмечать свои впечатления, чтобы было потом что вспомнить.\n\n### Зачем так делать?\n\nУ меня есть несколько странная одержимость на саморазвитие. Мне действительно нравится идея улучшения себя физически и умственно.\n\nИз-за этого я постоянно пробую новые способы усложнить себе челлендж. Я поднимаю тяжести, придерживаюсь диеты, сосредотачиваюсь на цели и пытаюсь быть максимально эффективным в своих проектах по работе и досугу.\n\nКо всему прочему, одним из тех вещей, которых я годами заставлял себя придерживаться, был жесткий график. Возможно это из-за моего практически смехотворного нонконформизма, но сама идея расписанного и распределенного дня кажется мне невероятно скучной.\n\nКогда я думаю о типичной работе с 9 по 5, то мой мозг немного плавится (к счастью, я работаю в компании, совладельцем которой являюсь, что достаточно неплохо).\n\nВ любом случае, ближе к сути. Я решил, что раз уж я еще не пробовал серьезно впрячься и следовать расписанию, то это может быть отличным способом заставить себя попробовать что-то новое, выйти из зоны комфорта и (надеюсь) стать лучше.\n\nВ последнюю очередь, моя цель в проведении этого эксперимента в том, чтоб замерить свою продуктивность в течение приличного отрезка времени и проверить:\n\n*   Насколько хорошо я могу придерживаться графика\n*   Сколько всего я могу произвести (как в рабочих, так и в личных проектах)\n*   Могу ли я совмещать мои текущие обязательства и жизнь с новым графиком (я женат, в конце-концов)\n\nЧтобы подтолкнуть и повысить шансы на успех, я решил вывернуть цикл сна наизнанку. Причиной послужило то, что раз уж я обычно просыпаюсь днем (и приходится разбираться с кучей мейлов/звонков), то просыпаться возможно раньше поможет мне выжать больше из своего дня, давая много непрерывного времени утром, чтобы сосредоточиться на расписании и успеть возможно больше.\n\n### Приспособление к новому расписанию\n\nПервая проблема, с которой я столкнулся, была в том, чтоб заставить себя лечь достаточно рано, чтобы более-менее проснуться к 5 часам утра. И так как я спланировал всё заранее, а также зная свой характер, я понял, что будет практически невозможно заставить себя лечь в 8 часов вечера — я решил схитрить _и принял снотворное_.\n\nНочью до эксперимента я принял снотворное около 6:30 вечера, и, в конечном счете, добрался до кровати в 7:30 и заснул в 8:00, получив 9 часов крепкого сна, чтобы быть свежим на первый день.\n\n**Заметка:** снотворное отлично сработало в моём случае. Эти таблетки действительно сильные и мне, полностью отдохнувшему, было очень легко пережить первый день с новым расписанием. Иногда (в течение следующих двух недель) мне пришлось принимать еще таблетку, чтобы лечь рано (кажется, мои внутренние часы заставляют меня ложиться всё позже и позже каждую ночь).\n\nВ плане дней (я распланировал с понедельника по пятницу, субботу и воскресенье решил оставить как свободные дни) я решил организовать их как описано ниже:\n\n*   **5:00 - 5:30** Проснуться.\n*   **5:30 - 7:00** Пойти в тренажёрный зал, поднять вес и походить на беговой дорожке.\n*   **7:00 - 7:30** Завтрак и чтение.\n*   **7:30 - 8:30** Выполнение личных проектов на два «помидора»\n\n*   **8:30 - 9:30** Перерыв (расслабиться, писать, что угодно).\n\n*   **9:30 - 13:30** Работа (в «помидорах»).\n\n*   **13:30 - 14:30** Перерыв на обед.\n\n*   **14:30 - 16:30** Работа (в «помидорах»).\n*   **16:30 - сон** Свободное время.\n\nКак можно видеть выше, предложенный график дает мне 6 часов непрерывного труда каждый день (это много времени на программирование), целый час на личные проекты и кучу свободного времени.\n\n**Заметка:** если вы не знаете, что за «помидоры», то не расстраивайтесь. По сути, это блок времени на 25 минут, в течение которого вы пристально сосредотачиваетесь на одной задаче, не отвлекаясь ни на что. Если вы еще не читали книгу [The Pomodoro Technique](https://www.amazon.com/gp/product/1934356506/ref=as_li_ss_tl?ie=UTF8&camp=1789&creative=390957&creativeASIN=1934356506&linkCode=as2&tag=rdegges-20), то прочитайте — это великолепно.\n\n### Тренировка\n\nВойти в колею с новым распорядком тренировок оказалось вовсе не сложно. До начала эксперимента я уже имел привычку идти в тренажёрный зал сразу после пробуждения (за исключением случайного ответа на важный мейл по работе).\n\nИз-за того, что я стал просыпаться раньше, мне вообще не пришлось проверять мейлы утром и я мог спрыгнуть с кровати, почистить зубы, глотнуть протеиновый шейк и направиться в тренажёрный зал.\n\n### Личные проекты"
		},
		{
			"post_id": 2,
			"title": "Рэндалл Дэджис: Мне насрать на лицензирование",
			"date_published": 1504925241.917,
			"body": "Что в прошлом, что сейчас, мне постоянно напоминают, насколько сильно я ненавижу лицензирование ПО. Вместо того, чтобы делать свои обычные дела и тихо бурчать про себя, я решил, что внесу чуть разнообразия и напишу старый-добрый хейтпост.\n\n---\n\nПару дней назад я получил email от разработчика, работающего в какой-то крупной корпорации:\n\n> Здравствуйте, Рэндалл,\n> Я хотел бы использовать ваш проект flask-dynamo в %большая корпорация%. Можете ли вы сообщить, под какой лицензией писался код? Мне нужно отправить это в юротдел, прежде чем я смогу им воспользоваться.\n> Благодарю за внимание.\n\nЯ несколько изменил содержание, но, надеюсь, вы поняли суть.\n\nИтак... это полностью корректный вопрос. Этот человек работает на какую-то крупную компанию с очень строгими требованиями и хочет знать, может ли _ЛЕГАЛЬНО_ использовать мой код у себя в работе.\n\nЭто всё хорошо и круто. Кроме одного: меня просто не волнует лицензирование. Если мне придется выбирать между уборкой собачьего дерьма или же разговором о лицензировании софта, то я с удовольствием пойду подбирать собачье дерьмо. Вот насколько я ненавижу лицензирование.\n\nЯ нахожу всю дискуссию о лицензировании софта полностью бессмысленной. Это одна из наиглупейших, жутчайших и наиболее излишних для обсуждения тем во всём мире технологий. И почему же? Ну...\n\nЭто излишне потому, что НИХУЯ НЕ МЕНЯЕТ. Если вы уже можете найти и посмотреть мой код, то, <span class=\"st\">—</span> догадайтесь что? <span class=\"st\">—</span> вы можете им воспользоваться! Хочу я этого или нет, но вам уже доступен мой код и вы можете скопипастить из него части (или же сразу всё, нахуй).\n\nЕсли даже я решу выложить лицензию на все мои проекты в Гитхабе, гласящую:\n\n> АВТОРСКОЕ ПРАВО принадлежит Рэндаллу Дэджису. Никто в мире не имеет права использовать этот код или скопировать его в любым способом и в любом виде. А то я засужу тебя\n\nто это просто не будет ничего значить.\n\nЯ просто отказываюсь верить в то, что этот разработчик работает в компании, где его босс поминутно проверяет любой его коммит, гуглит каждую строчку кода, высматривая, откуда он мог бы её скопировать и легально ли это.\n\n**Заметка:** если вы работаете в таком месте, то сделайте себе услугу и увольтесь. Есть очень много мест, где вы можете оставить свой след, получать ощутимо больше и где с вами не будут обращаться как с ребенком.\n\nКак разработчику, сама мысль о том, что я должен просить разрешения за кусок кода, который можно найти в интернете, кажется мне сумасшедшей. То бишь, сколько вообще может быть способов это сделать, в конце-концов?\n\nЕсть всего парочка способов сделать for-loop, увеличить переменную и хранить данные в БД. Всё прочее лишь о деталях.\n\nНет, я понимаю и другую сторону вопроса: код написал ты и не хочешь, чтобы вообще кто-либо его использовал! В конце-концов, это твой проект. Ты продумал его, ты написал его и можешь лицензировать как душе угодно, чтобы оградить кого угодно от использования, не?\n\nКак бы это имеет смысл, если рассматривать с такого угла: если ты автор чего-то, то у тебя должен быть контроль над этим.\n\nНо давайте будем реалистами хоть на минутку: если ты создаешь что-то и не хочешь, чтоб его использовал кто-то иной, то решение намного проще лицензирования: просто, блядь, не делай это общедоступным.\n\nПотрать немного ебучего времени, чтоб убедиться, что твой код надежно скрыт и не легкодоступен. Храни его на закрытом серваке, используй Гитхаб Энтерпрайз, или, ради всего святого, сделай из него сервис и требуй деньги за пользование.\n\nВсе эти способы хороши.\n\nДелай что хочешь, но не публикуй код в сеть с глупой лицензией, которая запрещает остальным людям пользоваться твоим кодом, так как <span class=\"st\">—</span> угадай что? <span class=\"st\">—</span> я буду его использовать. Я воспользуюсь им, и даже не загляну в лицензию. И я не один такой.\n\nЭто то, что делает интернет прекрасным. Способность делиться информацией с кем угодно, моментально, без ограничений. Как разработчики, мы должны быть на передовой, продвигая такой подход.\n\nВ конце-концов, всё, что мы делаем, опирается на тысячи слоёв абстракции предшествующих нам программистов. Делать вклад в будущее и обеспечивать будущим поколениям программистов возможность создавать крутые и мощные вещи — наша задача.\n\nИ единственный способ этого достичь: коллективно вытащить голову из задницы и перестать вести себя так, будто мы владеем мыслями и идеями.\n\nПрограммирование это творческое занятие. Если вы не можете жить с мыслью, что кто-то может нахаляву использовать софт, на который вы потратили время и силы, опубликовав в _общедоступной сети_, то может эта сфера не для вас?\n\nПрограммирование это нечто, по своей сути подразумевающее распространение. Сложность, которая требуется для создания современных приложений, была бы неосуществимой без огромного количества общедоступного кода.\n\nВместо того, чтобы рассматривать свой код как имущество, вам следует относиться к нему как к детищу. Когда ты создаешь код, то надеешься, что со временем он подрастет и станет как-то полезным для других людей, а не запираешь его внутри, контролируя весь доступ к нему.\n\nЭто решение может принести вам немного счастья, чуточку печали и много чего еще, но ваша _моральная_ ответственность заключается в том, чтобы выпустить его в мир и дать тому оставить свой собственный след.\n\n* * *\n\nВ следующий раз, как вы захотите опубликовать открытое ПО, я призываю вас всерьез задуматься о вопросах лицензирования. Если вы хотите гарантировать свободный доступ возможно большего количества людей, то:\n\n*   Используйте общедоступную лицензию вроде [UNILICENSE](http://unlicense.org/)\n\n*   Не используйте лицензию вообще\n\nПубликуя свой софт как общественное достояние, вы сознательно решаете сделать его действительно общедостуным. Вы даете ЛЮБОМУ, кто найдет ваш проект, право использовать его как вздумается. То есть тот может скопировать часть или весь проект. Он может даже скопировать всё и сказать, что он это написал. Короче: любой, кому на руки попался код, может делать с ним абсолютно что угодно.\n\nИ... Может, у вас есть уже опубликованный под другой лицензией проект? Может, пора подумать об изменении? Публикация кода в открытый доступ помогает не только корпоративным разработчикам, но и всему сообществу программистов по всей планете.\n\n**Заметка:** если вы корпоративный разработчик, которому действительно важно, под какой лицензией находится проект, то, пожалуйста, потратьте минуту и посмотрите в сам проект, прежде чем писать email.\n\n`<EOF>`"
		}
	]
}