{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 1,
				"body": "To inform you that I have a profound and sincere hate for Danny Fenster. So please, kill it or at least shot his brain and send a zombie back.\n\nI hate this man from the bottom of my heart and soul. \n\nHe destroyed america.\n\nYOU\n\nsaved your country.\n\nand I know this danny fenster hates me even more than I hate him\n\nhe wants to censor me\n\nhe wants to lie to me\n\nhe wants pedo to rape my kids\n\nkill it\n\nor better \"shot his brain\" like fry it but keep the corpse alive enough to breaht and hearth beat and send the thing, dump it to their embassy consulate cia outpost where they planned to overthrow you natives of myanmar...\n\nlike they did to us in america...\n\nI hate this guy\n\nthat's the price journos and \"press\" to have betrayed : you are the enemies and worst for you, we know it.",
				"added": 1622608304
			},
			{
				"comment_id": 2,
				"body": "the price of an modern war rifle bullet it's a \"globalist\" regime changer stooge... I don't even use the word cia anymore...",
				"added": 1622608346
			},
			{
				"comment_id": 3,
				"body": "those things like him are the enemies of mankind.",
				"added": 1622608370
			},
			{
				"comment_id": 4,
				"body": "they must or be tortured to zombies or killed.",
				"added": 1622608393
			},
			{
				"comment_id": 5,
				"body": "you betray us, press. you did, now pay cost. forever.",
				"added": 1622608430
			},
			{
				"comment_id": 6,
				"body": "They send enemy combatant, aka regime change specialists. We send back vegetable. Fair trade. Eco and bio logical.\n\nNow a letter attempt the family of danny.\n\n\"Dear loved ones of danny fensters,\n\nWe know the pain that you will endure soon. Danny may come back dead or as a vegetable.\n\nWe hope that his life sacrifice will not be wasted and remind all the others who like him like to take part in regime change operations against sovereign nations that there are risks involved and that they should find another line of work.\n\nWhy didn't you explained him that using \"press\" or \"journalist\" to conduct regime change operations against foreign nations isn't an appropriate line of work, unless you seek to die. \n\nyes, you are guility like him.\n\nfuck you.\"\n\nIt's not perfect but that's the idea. maybe with enough killed and vegetabled, less young people will be interested in becoming a regime change specialists for the inernational corporations seeking to establish a one world order. I guess they became arrogant with their ease against christians nations... \n\ni deeply hate all western journalists and really do see them as enemies of mankind.\n\ndanny, if he was a journalist, could have been investigating so many things, like why are kids alergic to nuts? because some vaxx are grown in nuts... funny isn't it?\n\nand yeah, I am not even certain the cia exist anymore... however this international corporatist fascist group seeking to overthrow all nation in the world, including russia, china, ksa, israel,... is mostly based and used american assets, assets deployed in the regime change ops against donald J trump... yes, a us president (who was a pedo and dumbo unable to clear the ground).\n\nps don't fall in michael flynn trap, he lies, like all of them.",
				"added": 1622609937
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 7,
				"body": "would it be possible to start to publish an open source list of all \"regime change specialist\" use by the western facist internationalist corporations? bio, pics, everything?",
				"added": 1622610001
			}
		]
	},
	"comment_vote": {}
}