{
	"posts": [
		{
			"id": "c6bf3912-bc42-401c-800f-aa67fe31701d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "Misuse of Israeli Surveillance Tech for Massive Violation of Human Rights",
			"body": "There is a criminal organization in Brazil using NSO Group's Pegasus to infect devices for hack for hire, to incite terrorism, blackmail people, produce illegal pornography and assist in assassinations. They also have other advanced malware, like UEFI implants and even persistent implants for Kindle and Raspberry Pi. Plus face/voice recognition on every camera and microphone they can get into, in public or private places.\n\nBrazil won't do anything to stop them. Only the FBI, CIA and NSA can stop them.\n\nThere is also the possibility that they were engaged on the hack of Bezos' smartphone.\n\nIf you know of any security researcher who wants to reverse engineer the exploits they are using, I am more than willing to help them.\n\nIf you want a story about how they operate, I am willing to work with you to expose them.",
			"time": 1611090174108,
			"files": "[{\"name\":\"jefferson-santos-9SoCnyQmkzI-unsplash.jpg\",\"thumb\":\"cdde855ca3b11c8583ab642a78e014f68a5a2dc7-thumb.jpg\",\"size\":17610,\"type\":\"image/jpeg\",\"original\":\"cdde855ca3b11c8583ab642a78e014f68a5a2dc7.jpg\",\"directory\":\"19AuD3C3VusewLWehweVi29XupaG5TkPVC\"}]"
		},
		{
			"id": "1a7caac2-a79d-4fa9-9bb8-40771d1d5174",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "All AMD Processors Since Phenom II Have BadBIOS Circuitry That Leaks to the Military",
			"body": "Title gives my conclusion from empirical events I witnessed and inside info. PSP runs on the same circuit, but isn't the backdoor per se, which has been around for much longer.\n\nJust like AMD was able to change the crypto algorithms for the Zen chip they licensed to China, they can change how the CPU behaves at any system, even those already deployed. This can be used to sabotage any program or computation, making BadBIOS (uses radio, not sound) vastly nastier than StuxNet.\n\nAmerican military made a grave mistake by giving access to the morons of the Brazilian military, who are letting knowledge of this spread like a fire (and misusing it for petty profit and inside jobs to justify a police state). Israel, UK and France also have access, but are much more professional.",
			"time": 1622796519397,
			"files": "[{\"name\":\"laura-ockel-RoZWxeFL27k-unsplash.jpg\",\"thumb\":\"46c236b0f5c642db0228df074846c97bed3c1614-thumb.jpg\",\"size\":156973,\"type\":\"image/jpeg\",\"original\":\"46c236b0f5c642db0228df074846c97bed3c1614.jpg\",\"directory\":\"19AuD3C3VusewLWehweVi29XupaG5TkPVC\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}