{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566815498_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": 1,
		"1567515898_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> [blurhy](#comment_288_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): I think he won't move the repo, for zeronet is not very 'malicious', no enough motivation\n\nMost things that are \"not malicious\" are now seen as malicious thanks to smear tactics. Hubris of this nature will result in the death of the ZeroNet repository if certain protections aren't mitigated beforehand.\nHow easy would it be for a push to demonize decentralized networks to start and result in wide scale blacklisting?",
				"added": 1566408471
			}
		],
		"1566512268_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 2,
				"body": "> [holeyhouseofair](#comment_70_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): not sure I'm too chuffed having my family members described as ignorant and retarded.\n\nOk this made me laugh.",
				"added": 1566515883
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 3,
				"body": "> [holeyhouseofair](#comment_64_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): Love thy neighbour\n\n\"Loving thy neighbor\" and \"letting them take advantage and manipulate you\" are two different things.\n\"Sticking it to the man\" and \"being a contrarian\" is likewise.",
				"added": 1566516038
			},
			{
				"comment_id": 8,
				"body": "> [hurr](#comment_8_17JUgv1Am5PSRNJj3xtZKCZKd31E8eRjtS): wow its almost like its so vague it can be interpreted to mean whatever the fuck you want it to mean!\n\nIsn't that the beauty of pseudo intellectualism? Pair that with \"death of the author\" and suddenly, everything has no meaning and meaning at the same time. Schrödinger's Cat, eat your heart out.",
				"added": 1566723325
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 4,
				"body": "> [humboldt](#comment_12_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra): I guess capitalism makes you think of monopoly. But monopolism does not exist in capitalism, monopolies are formed only by state violence and lobbyism. If the state did not interfere, subsidize and benefit itself, it would not exist. The banking system today is also anti-capitalist. It is slavery.\n\nExactly. A simple thought experiment is that you literally cannot create a monopoly without interference. Look at the board game for example. You're forced to use the pre-existing lots for purchase and you have to place amenities in the order the game allows. You're not allowed to create any more space in the unused areas on the board.\n\nThe lack of self awareness for anti-capitalists is astonishing.\n\n> [anonymouslogin](#comment_401_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Socialism works when there are plentiful resources and no bourgeoisie. Religion is an antiquated system of superstitions designed to allay fears about death.\n\nCitation needed",
				"added": 1566624261
			},
			{
				"comment_id": 7,
				"body": "> [r3naam3r](#comment_29_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): And atheism is not religion, we don't \"believe god doesn't exist\", we just don't know and find the god theory implausible.\n\nWhy is the opposition to the existence of a \"God\" always from the perspective that said deity is in vain to a human being who is omnipotent, and less of an insurmountable force that is far beyond any human's understanding? Nature literally disagrees with your perspective, and yet you still feel confident to espouse your ideas above any others, regardless of the discrepancies you come across. Folly is the only thing I see in your post. An extreme obnoxious ignorance that refuses to look at a situation from any position other than your own.\n\nI struggle to grasp why such ridiculousness can be adopted with sanguine naïveté.",
				"added": 1566716280
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 5,
				"body": "This screed is all nice and good, but when someone breaks the guidelines, who's enforcing punishment? If someone is enforcing punishment, then who enforces the enforcer? Greed can't be law'd out of existence and there are loopholes for every piece of legislation. At least when you leave it open, you can hit back at corporate espionage. The second you make it against the rules, you put power in the hands of the elite.",
				"added": 1566689155
			},
			{
				"comment_id": 6,
				"body": "This post is also an autistic push for \"intellectual property\" when really we should be moving away from that. If I take inspiration from nature and create something which someone takes inspiration from to create something else, what right do I have to tell them they can't do that? Unless they are plagiarizing my work and calling it their own, there should really be no issue. Apply that same concept to this scenario around OSS.",
				"added": 1566715779
			}
		],
		"1566748537_1PNw9xLFQkRXSTMDbLxFvNvve9sjAVhL3q": [
			{
				"comment_id": 9,
				"body": "I've become accustomed to this change and like [jeff](#comment_2_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT) said, it actually makes more sense than oldest first. However as a QoL improvement, there should be a button that takes you down to the first post when you click it.",
				"added": 1566754800
			},
			{
				"comment_id": 10,
				"body": "I use ZeroNet on a laptop which doesn't have an 'End' key but I use a shortcut which does the same thing. I was thinking more along the lines of a thread which has more than a few replies and requires you to click *Load More* before you can view the earlier replies.",
				"added": 1566758238
			}
		],
		"1566815498_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 11,
				"body": "Honestly, it's the fault of the company going public. Not having enough money or having no direction for your business are the only two reasons used for going public, yet that just opens up your organization to a takeover by someone wealthy. Just assume a public organisation has absolutely no backbone from the get go, therefore nonsensical reactions to things irrelevant to the business like politics should be expected.",
				"added": 1566880198
			}
		],
		"1567003987_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 12,
				"body": "How is that anti-semitic? Anyone doing something wrong should be called out, rightfully so. If a Jew thinks he can cry anti-semitism to protect himself from backlash for bad actions, he has another think coming.",
				"added": 1567012057
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 13,
				"body": "I mean, it's in the documentation so...\n\n> [pseudonymity](#comment_30_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): I got a 4chan pass one year\n\nCan't they track you via the payment process? That's worse imo.",
				"added": 1567012101
			}
		],
		"1567063520_18CNiJ2fa4qWU3mqbmE5kndxLk15oVsxi5": [
			{
				"comment_id": 14,
				"body": "Don't take this clown of an OP seriously. This is clearly a subtle attempt at censorship advocacy and he's testing the waters by trying to determine who agrees with him. If you don't like it, mute it or better yet, don't read it in the first place.",
				"added": 1567075298
			}
		],
		"1567109265_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 15,
				"body": ">ISIA offered content for a regular subscription fee to viewers around the United States, and ISIA publicly asserted that it had more content than Netflix, Hulu, Vudu and Amazon Prime.\n>Attempting to outJew the Jew and getting indicted for it\nImagine my shock.",
				"added": 1567109438
			}
		],
		"1567131012_1BXEpDnqmAicgL8QvAVh6erxpVZY3cRu39": [
			{
				"comment_id": 16,
				"body": "> [unicornninja](#comment_6_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X): I do not believe that the future is written\n\nThe future is observable for anything outside of time. The future is very much as written as the past. That doesn't mean you don't have free will though. Any attempt to ape responsibility such as [moor](#comment_196_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH) does in the first post can't change the truth that you decided to do what you wanted, no matter how \"set in stone\" your decision is. We definitely have free will.\n\n> [aspidochelone](#comment_158_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): There is only one past, only one present, and only one future ... in this universe. \n\nAccording to whom? You? What is the evidence that anything you suggested is the case?\n\n>At the same time, free will is just that - doing things because you're going to do them.\n\nPseudo-intellectualism is a disease. This statement has as much evidence as yours.\n\n>Yeah, free will results because the future can't be changed.\n\nCitation needed.\n\n>If it's \"your choice\", then how do you choose it?\n\nThis is how you make a choice: \"Let's do this\". Done. You've made a choice.\n\n>Perhaps the universe is linked to other parallel universes that are very similar at every point, in a second dimension of time, and that's where you make the decisions. Spiritual time you might say, compare to Days of Creation or New Heaven and New Earth. This is obviously a wide open speculation since it is hard to see beyond this universe!\n\n>Not sure it is impossible though. In our dreams and speculations, maybe we recall or see some of these other worlds. And there could be transdimensional organizations at work that have a better understanding of these things...\n\nWhat is this babbling?",
				"added": 1567186801
			}
		],
		"1567185733_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 17,
				"body": "> [aspidochelone](#comment_159_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The capitalists make out like \"property\" is a mysterious spiritual substance that physically imbues everything on the earth the sky (and now even in outer space) not to mention the files you read and the songs you sing in the shower. Eventually you gotta realize this is a bunch of cultist bullshit and has no real meaning.\n\nThat's not capitalism. Stop attributing your disdain of actions to idealistic concepts. There are most definitely people responsible for this myopic opinion of modern society, and no one calls them out. However, you seem to want to insult someone who believes the idyllic concept of the free market.\n\nI'll tell you this, not one political concept can avoid the clutches of greed.",
				"added": 1567187238
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 18,
				"body": "People quick to call other glowniggers are usually glowniggers themselves. Case in point: FBI affidavit into 8chan.",
				"added": 1567298614
			},
			{
				"comment_id": 19,
				"body": "> [unicornninja](#comment_8_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X): I believe the term is slang for an unfriendly intelligence operative\n\nThe CIA loves them some Tritium. Puts the glow in your skin.",
				"added": 1567299689
			}
		],
		"1567515898_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 20,
				"body": "@qqqqqqqqqqqqqqqq Did that work?",
				"added": 1567530149
			}
		],
		"1567571648_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 21,
				"body": "This has already been done, multiple times. You seem to forget that the larger social networks are operated either in tandem or under the direct influence of the government (except for Twitch - we have Amazon to thank for that), which is the only reason why they are still around. Without the state's intervention, every social network would have gone with the wind, replaced by another. That is the nature of the free market.\n\nInstead, what we are seeing now is the artificial extension of the lifespan of a social network. Twitter, for example, has the POTUS and Congress members use it as an official platform for information dissemination. Facebook is the reincarnation of DARPA's lifelog. YouTube is owned by Google, an organization that has hired former members of Congress in key positions at the company. Now, you have Sergey Brin and Larry Page rubbing shoulders with politicians.\n\nWith this government influence at the top 3 social networks, they can extend their reach as laws and special privileges become accessible to them, maintaining their positions of power. Any other network or site would've died in their position, especially once they begin to undermine their audience and start losing money (much like Twitter has), yet here they still are.\n\nIn short, no my friend. They will not be tasting their own medicine unless literally every user held them accountable for the same things they hold others to account for. Which, as you should expect, will never happen. So people will continue to provide data for social media to sell to third parties and government officials. Collusion has never been so *in your face* as of this age.",
				"added": 1567590674
			}
		]
	},
	"comment_vote": {
		"70_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"129_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"35_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"12_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"1069_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"10_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"130_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"11_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"14_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"63_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"10_1BRQUkyDA6VNhSC3KDLfmuyVKMP3LkwpkG": 1,
		"187_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"32_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"121_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"2_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1,
		"78_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"10_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M": 1,
		"50_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"2_1JT342LZCKfgp8r2FYMruVc2jvFXk3gL24": 1,
		"122_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"51_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"294_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"145_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"551_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"96_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1
	}
}