{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1564043724,
			"title": "The difference between democracy and dictatorship",
			"body": "What is the difference between democracy and dictatorship?\n\n\nIn a dictatorship 1 psychopath decides what millions of sheeps are allowed to do, and what not\n\n\nIn democracy, 500 psychopaths first speak with each other, and tell millions of sheep what they are allowed to do, and what not.",
			"added": 1564043723
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1563459417_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "what about letting someone else buy Monero for you and then exchange it to Bitcoin on xmr.to ?",
				"added": 1563467252
			},
			{
				"comment_id": 2,
				"body": "> [xcape2net](#comment_119_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Too inconvenient.  Also, \"someone else\" can then identify you.\n\nVery convenient. That way you get your coins almost instantly without having them associated to you. Also \"Someone\" can be a close family member or the best friend. Without having anyone you can trust you probably cannot make this convenient.",
				"added": 1563526928
			},
			{
				"comment_id": 3,
				"body": "> [redlibertyreal](#comment_28_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Use Bisq and/or buy BTC with XMR. I really don't like BTC for this reason, cryptocurrencies should be privacy respecting (anonymous) by default. This is why I prefer XMR to BTC. I'm not a right-libertarian but I nonetheless still, even as a leftist, very much appreciate the social necessity of such market technologies. BTC in my mind is just stupid. If it's not respecting your privacy you simply shouldn't use it. It doesn't matter if you \"have nothing to hide\" or if you are \"doing nothing wrong\", it's a matter of principle.\n\nMonero should be at least used to enter (fiat->crypto) and exit (crypto->fiat)",
				"added": 1563528380
			}
		],
		"1564043724_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 4,
				"body": "> [kyu](#comment_1_1BhEu4wstzvjx9v87W5vgE6apPsnSAnnrx): ever heard of direct democracy?\n\nyes",
				"added": 1564044924
			},
			{
				"comment_id": 6,
				"body": "There is another diffence\n\nDictators mainly use physical violence as a weapon.\n\nDemocrats are smarter. They use money and bureaucracy.",
				"added": 1564050767
			},
			{
				"comment_id": 7,
				"body": "But one thing they always have in common is not giving a shit about the people.",
				"added": 1564051579
			}
		],
		"1563945520_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 5,
				"body": "That attorney general is a security risk. Restricting privacy will have the opposite effect and  create more terror.",
				"added": 1564049597
			}
		],
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": [
			{
				"comment_id": 8,
				"body": "muting anyone who have joined zn after a specific date !",
				"added": 1565337972
			},
			{
				"comment_id": 9,
				"body": "> [theosis](#comment_37_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): There is no way to know when someone \"joined\" zn.\n\nyeah, but perhaps when someone registered \"joined\" on ZeroID",
				"added": 1565347954
			},
			{
				"comment_id": 10,
				"body": "afaik when someone activates zerotalk for the first time anything that has been posted before is being downloaded including the nasty stuff and it makes the user automatically seeding it, i think that has to be changed.",
				"added": 1565348679
			},
			{
				"comment_id": 11,
				"body": "however i'm leaving zerotalk and not coming back again anytime soon. feeling too uncomfortable here.\nbye and goodluck in creating your app",
				"added": 1565348813
			}
		]
	},
	"comment_vote": {}
}