{
	"next_post_id": 4,
	"next_comment_id": 4,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Gen128",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1604947809,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1604947859,
			"body": "All statements are claiming to be true...\n",
			"date_added": 1604947857
		},
		{
			"post_id": 1604948213,
			"body": "testing... It has begun... the end is near...repent and believe",
			"date_added": 1604948210
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "It's stored locally on your system. If you check where you launched your zeronet.exe binary, you should see \"data\" folder.  It's a decentralized internet. ",
			"post_uri": "1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC_1605003843",
			"date_added": 1605012260
		},
		{
			"comment_id": 2,
			"body": "if you are on windows, look at the path where you launched the zeronet.exe. There should be a folder called \"data\". This is where you are caching the sites you visit.",
			"post_uri": "1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC_1605003843",
			"date_added": 1610513211
		},
		{
			"comment_id": 3,
			"body": "@Satanlovesyou: You poor thing. This is what God said concerning Satan, Rev 20:10 \"and the devil who had deceived them was thrown into the lake of fire and sulfur where the beast and the false prophet were, and they will be tormented day and night forever and ever.\"\n\nThe gospel is good news. Good news is that Jesus  defeated death.  Yes you read that right, DEATH.  Jesus said \"I give them eternal life, and they will never perish, and no one will snatch them out of my hand.\" Jn 10:28\n\nIt's not to late for you. Satan wants to take as many to hell with him as possible.  Don't let him. If you are reading this, it's because God is keeping you alive so that you'll hear the gospel of Jesus and be saved.\n\nI don't know you, but I don't hate you.  I love you, that is the only reason why I'm sharing the truth.  I pray that God will have mercy on your soul.  \n\nTry taking the ... http://goodpersontest.com/\n\n“The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel.” Mark 1:15\n\nPlease enjoy the freedom of speech.\n\n\n",
			"post_uri": "1BhTd1ppRKVisQbCFA55Y3et5m8s9TsZr4_1604948213",
			"date_added": 1610513963
		}
	],
	"follow": []
}