{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "What's the original URL of the .html?\nThe single .html is 4.1MB. And I'd like to chk the original one.",
			"post_id": 6,
			"date_added": 1553655940
		},
		{
			"comment_id": 2,
			"body": "Plz give me the original link of this singfiled .html.",
			"post_id": 8,
			"date_added": 1553819524
		},
		{
			"comment_id": 3,
			"body": "> [klu9](#comment_1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Hi @leftside: sorry I didn't see your comments. I didn't realize that even on my own blog I need to actively tick \"Comments\" in the Following box :)\n> You can see the blog's main URL at https://www.bbc.com/news/blogs/the_papers\n> Then you can scroll down to find whatever date you need, clicking \"More Stories\" at the bottom to find older ones. Here's the original link for the 28th of March:https://www.bbc.com/news/blogs-the-papers-47728858\n> You'll notice all the images of newspapers are gone already from the original clearnet site.\n\nthanks a lot!",
			"post_id": 8,
			"date_added": 1554601588
		},
		{
			"comment_id": 4,
			"body": "    ffmpeg -i source.mkv -c:v libx264 -c:a aac -strict -2 -f mp4 output.mp4",
			"post_id": 44,
			"date_added": 1557791401
		},
		{
			"comment_id": 5,
			"body": "> [klu9](#comment_5_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @leftside: I understand that videos can be converted. What I don't understand is why those sites don't accept MKV in the first place. Is MKV \"bad\" for streaming or something?\n\nI'm not sure, but as I know even youtube is providing the watchers with .mkv format at a certain video quality such as 360p, etc. (FYI, 144p and 240p are served with .3gp format)\n\nSo the problem must be something to do with the codecs inside the .mkv format. As u guys know, encapsulating format such as .mkv, .mp4, etc don't affect the video quality much... Even with .mp4, without the proper codecs such libx264 and aac, it doesn't work on any browsers...",
			"post_id": 44,
			"date_added": 1557839650
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"10": 1,
		"17": 1
	}
}