{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Rewq",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1602010262,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1602010278,
			"body": "What’s Qucs?\nQucs stands for Quite Universal Circuit Simulator. So far Qucs is not yet finished, but it is already packed with features. Take a look at the screenshots to get a feel for what it can do.\n\nQucs is an integrated circuit simulator which means you are able to setup a circuit with a graphical user interface (GUI) and simulate the large-signal, small-signal and noise behaviour of the circuit. After that simulation has finished you can view the simulation results on a presentation page or window.\n\nhttp://qucs.sourceforge.net/\n\n#gpl #foss #Qucs #EDA",
			"date_added": 1602010276
		},
		{
			"post_id": 1602100114,
			"body": "Decentralized open source online storage network\n\nCurrently, personal information is becoming more valuable and significant in the rapidly developing digital world. Personal photos, files, data on relatives and children, etc. are currently stored separately in various centralized services and are often used without the permission of the data owner, sometimes even causing harm.\n\nThe lack of secure storage is a problem for Internet users. BitDust Technology solves this problem by providing users the ability to store their data fully encrypted on a decentralized network via an easy-to-use application. Providing them the ability to share data only with trusted contacts.\n\nIn the future the blockchain within BitDust will be used to account for the work carried out (storage, data processing, data rebuilding, etc.) and to compensate supporters within the network. BitDust will benefit the collaborative economy by allowing normal people to rent-out their hard disk space, thereby supporting the network. Uploaded data is divided into blocks and fragments, encrypted and uploaded to your suppliers. The system is designed to perform continuous monitoring of each supplier, who stores your data.\n\nBitDust is written in Python using pure Twisted framework and is published under GNU AGPLv3.\n\nAn alpha version is already available for you to try out. If you want to join our project or support us in anyway possible then please contact us.\n\nWe believe that this technology will benefit society by increasing ownership of personal data and protecting data from unauthorized access or censorship.\n\nhttps://bitdust.io/",
			"date_added": 1602100111,
			"meta": "{\"img\":\"900,573,b9caac9bd8bc87babdacd78b98cddeeeedee59c8ac6ac68b,0111122233444155566647789AAAAA44778AAB3C44777D2ECC447FFFCCCC\"}"
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}