{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1544137305,
			"title": "FrameworkJS has been launched!",
			"body": "# FrameworkJS has been launched!\n**On ZeroNet, no need to recreate the same things for every new project you begin. Framework.js already comes with the basic libs and features ZeroNet needs**.\n\nIt already includes the basic features expected from a web framework, plus more!\nIt includes, for reading: Headings, Paragraphs, Blockquotes, Badges, Images, Navbar, Logo\nFor forms: buttons, sticky buttons, inputs, text areas\nFor webpage/app: navbar/header, header menu, navmenu, scroller, footer\nOther elements: Tiled lists, longcard lists\nCSS classes: .full-size, .no-opacity, .color, .color-bg\n\n**For ZeroNet, FrameworkJS is the first usable framework, and the world's first click-to-clone web framework.\nOn FrameworkJS site, just click \"Create your own zite\", and it will redirect to your brand new project. You can also use FrameworkJS on your current project.\nZite owner can call JS to clone your own site or another site. Also, FrameworkJS is doing the begin of UltraApps with the detection of clearnet/zeronet, and supports ZeroNet dark theme. It also comes with the most useful ZeroNet libs**.\n\nFramework isn't better, because ZeroNet didn't implemented yet the new features I suggested for site clonning.\n\nFrameworkJS also includes Bootstrap and Material Design ready to use.\n\nUse it on your project, and copy/paste the JS/CSS (except the custom ones) when a new version of Framework is launched.\nhttp://127.0.0.1:43110/fmwk.bit/\nhttp://framework.js.org/\nhttps://github.com/Plasnerd/Framework.js/releases/tag/r1",
			"added": 1544137304
		}
	],
	"topic_vote": {
		"1535704655_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1525712312_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1544137305_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1535704655_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I was wondering if i can somehow setup a recurring Linux command that would discover recent KopyKate videos and automatically download them. This way i can add this script to some non-stop running server (VPS) with open port, so there is always one seed for me and other people home computers. Though not yet spent time on this :-/ Maybe curl command would DL site, then i would have to extract links from that file and then maybe curl, wget or \".../ZeroNet.py siteDownload URL\" command on the video link. Then setting up a tmpwatch to delete oldest files so i do not fill the HDD.\n\nBe careful about illegal videos automatically being downloaded.\nEvery day review the files you have.",
				"added": 1535727459
			}
		]
	},
	"comment_vote": {
		"10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}