{
	"title": "Deutsches Recht",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1537981573,
	"post": [
		{
			"post_id": 8,
			"title": "Betrug durch Kirchengemeinden ! Die Lutherkirche Osnabrück ist Teil eines Geschäfsverbundes ohne Moral der sich Suedstadtgemeinde nennt.",
			"date_published": 1537977217.7,
			"body": "In einem gottlosen Firmengebäude das einmal als Kirche diente werden fette Geschäfte gemacht. Sie finden alle informationen und Adressen in diesem Artikel.\non Jan 01, 2018\n\nHier die Adressen !\n\nDie Adresse des Geschhäftsführers der Fa. Lutherkirche Osnabrück [ 2009\nbis 2011] und den Hauptverantwortlichen finden Sie in diesem Beitrag weiter unten. \nWer nichts zu verbergen hat , bei dem kann man in Ruhe auch nachfragen so sieht es die Redaktion .\nRechtlicher Grund ist das nichtgewählte Politiker aufgrund eines ungültigen Wahlgesetzes !!!!! daher unlegitimiert !! nichts beschliessen koennen.\nRechtsverstoesse nach ungueltigem Recht gibt es nicht.\nSchauen Sie selbst !\nhttps://youtu.be/Bh-wDtK6EIo\n\nPolitiker sind Firmenmitarbeiter wie alle in dieser Kirche Beschaeftigten ! Sie haben nichts zu melden. Sie handeln als normale Firma nach Handelsrecht und verbrauchen Steuern fuer unsinnige Zwecke.\nUm für die Nachwelt die Täter und Nutzniesser  die gegen jegliches Recht verstossen  dieses unloeschbar zu erhalten , werden Sie hier mit Namen und Adresse dokumentiert !\n\nZur Einstimmung sehen Sie einen Lehrfilm unter folgender Adresse.\n\nhttps://youtu.be/BUcncLo7qWw\n\n\nIn seiner Eigenschaft als Schauspieler stellt ein Herr Dirk Hartung  dort den Diakon dar , er ist jedoch nur ein ehemaliger Geschäftsführer der teure Dienstleistungen an den Mann bringt.\nSeine Verkaufsveranstaltungen nennt er Gottesdienste.\nSein neues Reisebüro ist das Aufgreifen einer schon sehr alten Idee. \nMit der ganzen Manschaft verfolgt er das Machtprinzip Teile und Herrsche.\n\nEs ist ja in jedem Geschäft so. In dieser Firma werden Dienstleistungen angeboten . Hochzeiten für Schwule und Lesben als Event.\n\nDas sind neuerdings Lebensfeste wie es dort heisst. Nicht umsonst , eine sprachliche Entirrung. Schwule , Gender und Kopfkranke regieren ohne jeglich Kompetenz und fuellen sich zudem Ihre Tasche. Ein Anzahl dummer Emanzen lassen sich dort ebenfalls aushalten. Schwul sein ist kein Einstellungshindernis sondern Vorraussetzung fuer eine erfolgreiche Bewerbung.\n\nDiese verbale Enstellung ,, Lebensfeste ,, ist das gleiche wie Jahresendzeitfiguren und ihre Zipfelmänner. \n\nEs gibt in der deutschen Sprache Negerküsse und so sollte es bleiben.\nBibeln in gerechter Sprache ! ist Schwachsinn hoch zehn. \n\nDas es sich hierbei um ein hochkriminelles Unternehmen handelt das vorgibt das Recht zu besitzen ueber andere zu herrschen versteht sich von selbst.\n\nDem wird hier entgegengetreten. Die hier vorliegenden Informationen stammen aus internen Kreisen und sind insoweit untersucht , das Sie jeder Ueberpreufung stand halten.\n\nDas alles macht das hier abgedruckte Firmenkonstrukt. Jeder kann es nachvollziehen.\n\nMan spricht z.B. von einem Pfarramt und darauf reagieren die Leute. Beamte hat das Unternehmen aber keine. Dafuer Schauspieler die den Beamten spielen. Es ist sozusagen wie beim Hauptmann von Köpenik.\n\nWarum gibt es dort keine Beamte ?\nDie Antwort ist ganz einfach und ist für jeden schnell gefunden.\nSie steht im Netz.\nSichern Sie sich diese Vorgaenge . Es wird wie in jeder Diktatur zensiert.\nDieses Plenum kann nicht abgeschaltet werden.\nSie brauchen nichts Glauben. Das ist Sache von diesen Schauspielern.\nSchauen Sie sich die Gesetze an und vergleichen Sie diese mit den hier vorliegenden Informationen.\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone\n\nhttps://opinioiuris.de/entscheidung/805\nBVerfG, 17.12.1953 - 1 BvR 147/52\nUnd das seit 1953 . Ohne Umschweife wurde das vom höchsten deutschen Firmengericht entschieden.\n\nhttps://www.gesetze-im-internet.de/kstg_1977/__4.html\n\nEntscheident ist der letzte Satz !!!!!\nPrüfen Sie es selbst !!!!!!!\n\nKörperschaftsteuergesetz (KStG)\n§ 4 Betriebe gewerblicher Art von juristischen Personen des öffentlichen Rechts\n(1) 1Betriebe gewerblicher Art von juristischen Personen des öffentlichen Rechts im Sinne des § 1 Abs. 1 Nr. 6 sind vorbehaltlich des Absatzes 5 alle Einrichtungen, die einer nachhaltigen wirtschaftlichen Tätigkeit zur Erzielung von Einnahmen außerhalb der Land- und Forstwirtschaft dienen und die sich innerhalb der Gesamtbetätigung der juristischen Person wirtschaftlich herausheben. 2Die Absicht, Gewinn zu erzielen, und die Beteiligung am allgemeinen wirtschaftlichen Verkehr sind nicht erforderlich.\n(2) Ein Betrieb gewerblicher Art ist auch unbeschränkt steuerpflichtig, wenn er selbst eine juristische Person des öffentlichen Rechts ist.\n(3) Zu den Betrieben gewerblicher Art gehören auch Betriebe, die der Versorgung der Bevölkerung mit Wasser, Gas, Elektrizität oder Wärme, dem öffentlichen Verkehr oder dem Hafenbetrieb dienen.\n(4) Als Betrieb gewerblicher Art gilt die Verpachtung eines solchen Betriebs.\n(5) 1Zu den Betrieben gewerblicher Art gehören nicht Betriebe, die überwiegend der Ausübung der öffentlichen Gewalt dienen (Hoheitsbetriebe). 2Für die Annahme eines Hoheitsbetriebs reichen Zwangs- oder Monopolrechte nicht aus.\n(6) 1Ein Betrieb gewerblicher Art kann mit einem oder mehreren anderen Betrieben gewerblicher Art zusammengefasst werden, wenn\n\n1.\nsie gleichartig sind,\n2.\nzwischen ihnen nach dem Gesamtbild der tatsächlichen Verhältnisse objektiv eine enge wechselseitige technisch-wirtschaftliche Verflechtung von einigem Gewicht besteht oder\n3.\nBetriebe gewerblicher Art im Sinne des Absatzes 3 vorliegen.\n\n2Ein Betrieb gewerblicher Art kann nicht mit einem Hoheitsbetrieb zusammengefasst werden.\n\nSehen Sie sich bitte alle Informationen an . Prüfen Sie !!\nNur die Fa. Kirche braucht den Glauben , Sie nicht.\n\nhttps://www.upik.de\ngeben Sie die DUNS Nr. ein , die Sie unten auf dieser Seite\nfinden und prüfen Sie es selbst !\n\nWas macht ein Pastor oder Diakon ?\n\n    Geschäfte !\n    Geschäfte !\n    Geschäfte !\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone/dirk_hartung\n\nZitat unter Persönliches\n,, 2009 bis 2011 Geschäftsführer der Südstadtkirchengemeinde, seit 2011 Gemeindediakon Südstadtkirchengemeinde ,, .\nVeruchen Sie da mal anzurufen und jemanden persönlich zu sprechen. AB heisst die Antwort von dieser Schar hochbezahlter Leute , die sich auf unsere Kosten ein schoenes Leben machen.\nDa schmeissen die lieber die Putzfrau rauss. Ein falsches Wort und es ist passiert.\n\nNun der Chef hat Ansprüche ! Auch hier das Problem der Vermessenheit dieser Schauspieler mit Spitzengagen !\n\nDer ehemaliger Geschäftsführer ist als Burgschauspieler 2011 wieder in seine Rolle geschlüpft !\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nNutzen Sie die Adresse um einmal direkt mit einem echten Geschäftsführer ins Gespräch zu kommen. Der Hauptverantwortliche oder besser Firmengründer ist ebenfalls ausgewiesen. Ein hochbezahlter Geschäftsmann. Schon Calligula hatte solche Marotten.\n\nUPIK® Datensatz – L\nL Name Lutherkirche Osnabrück\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 312512729\nL Geschäftssitz Miquelstr. 5\nL Postleitzahl 49082\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05415690166\nFax Nummer\nW Name Hauptverantwortlicher Martin Wolter\nW Tätigkeit (SIC) 8661\n\nHier ist die Haupstelle !! der Filale Osnabrück\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labor\n\nDie ganze Schauspielertruppe\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone\n\nGeld verschleudern ohne Ende ?\nKein Thema wird doch aus Steuern\nfinanziert.\nHier einige Meisterstücke eines schwulen Geschäftsführers .\nSie machen deutlich wohin der Weg nun hinführt.\nDem Unternehmer fehlt es nicht an Ideen.\nWenn Sie auch nie das Anfangsstadium eines Lehrlings in der Werbewirtschaft verlassen hat.\nWerbewirksam wurde das mal als Gotteshaus geplante Gebäude zum Schwulenzentrum mit Restaurant und Muezzinrufen.\n\nHoffentlich ist die Küche koscher.\n\nEin anderes mal wird der Islam bemüht. Der Muezin auf dem Dach eines Schauspielhauses erbaut als Kirche zur Jahrhundertwende wird nun zum ganzjährigen Schauspielhaus , für passionierte Karnevalisten.\n\nDie Schauspieler sind zugleich Büttenredner für sogenannte Vorstandsmitglieder.\nEin Restbestand an Narren leistet Ihnen Sonntags Gesellschaft.\nIn der sogenannten Sommerkirche schaffen sich seine Mitstreiter viel Freizeit.\n\nUnd keiner merkt es weil ja kaum jemand dort ist.\n\nWird aber alles voll bezahlt ! Das basiert auf 415 AO das ist die nie in Kraft getretene Abgabenordnung .\nSie bezahlen deren Wohlstand obwohle es auf einem Gesetz beruht welche nie in Kraft getreten ist.\n\nhttps://dejure.org/gesetze/AO/415.html\n\nSie sehen das Sie es hier mit Kriminellen zu tun haben.\nDie Mitarbeiter der Fa. Finanzamt erpressen damit die Steuerzahler die dieses Schauspielhaus finanzieren , damit es den Schauspielern entsprechend gut geht. Herzlichen Dank dafür. Gut das es dieses unzensierbare Netz möglich macht das einmal unlöschbar auch als Dokument für die Nachwelt zu erhalten.\n\nDas so durch Betrug erlangte Vermoegen muss verprasst werden und das geht so.\n\nhttp://queer-gottesdienst.de/\n\nhttps://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n\nDafuer wird viel Geld gebraucht. Solche ldeengeber braucht das Land. Hier von geistiger Abgeirrtheit zu sprechen ist unter christlichen Gesichtspunkten mehr als angebracht. Unternehmerisch ist es das gleiche.\n\nWeitere erfolgreiche Geschäftsfilialen\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Ev.-luth. Kirchengemeinde Wietze\nNicht eingetragene Bezeichnung oder\nUnternehmensteil\nL D-U-N-S® Nummer 340435489\nL Geschäftssitz Kirchstr. 6\nL Postleitzahl 29323\nL Postalische Stadt Wietze\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 051462154\nFax Nummer\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labor\n"
		},
		{
			"post_id": 7,
			"title": "Sklaven ohne Ketten !",
			"date_published": 1537897326.7,
			"body": "Filmbeitraege helfen verstehen !\n\n1.https://youtu.be/yZ2bI2bO8Vc\n\n2.https://youtu.be/oirO3zbTXQA\n\nDie historischen Grundlagen finden Sie hier !\n\nhttps://youtu.be/2RI5dvXPWeY  \n\nDer Klassiker von Conrebbi muss man gesehen haben .\n\n"
		},
		{
			"post_id": 6,
			"title": "Mensch wird zur jur. Person Teil 1   Er verliert als Sache nach BGB § 90 BGB alle Rechte. ",
			"date_published": 1537895440.8,
			"body": "Der Mensch ist eine natuerliche Person. Durch die Registrierung beim Standesamt und die Taufe wird er zur Firma und das ist eine Sache.\n\nUeberblick\nIn der BRiD (Bundesrepublik in Deutschland adäquat UN-Bezeichnung: Federal Republic of Germany) ist deine PERSON gefragt und als Mensch bist Du praktisch nicht vorhanden.\n\nDabei kann die PERSON ohne den Menschen, der diese PERSON wie ein Etikett angeheftet bekommen hat, gar nicht existieren. Derweil verleugnen sich die Menschen in der Oligarchie(1) BRiD selbst, dadurch, dass diese verirrten Menschen den Status von PERSONen freiwillig annehmen, indem sie folgendes tun:\n\n    Identifizierung durch PERSONalausweis statt Authentifizierung des Menschen.\n    Die Stimme bei Wahlen abgeben. Das ABGEBEN der eigenen Stimme führt zur Unmündigkeit.\n    Steuern zahlen, obwohl dies nirgends geschrieben steht (die Abgabenordnung ist eine Ordnung – wofür, welches Gesetz ordnet die Abgabenordnung?).\n    Kredite abbezahlen, obwohl diese bereits getilgt sind.\n    Unterstützung der Banken und Sparkassen durch den Glauben, dass diese Verbrecherorganisationen rechtens seien (Zinseszins ist bereits in der Bibel als kriminell bezeichnet).\n    Die PERSONen in der BRiD glauben an Geld, als sei Geld ein Gebot des Glaubens. (Was Geld ist: siehe unten.)\n    Der Mensch ist von den Menschen in der BRiD vergessen. Kein Bürger fragt, ob er als Mensch anerkannt ist, wenn er zur Zahlung von irgendwas oder zur Ladung zu irgendwas aufgefordert oder vor Gericht geladen wird.\n\nSchon im BGB in der neuesten Fassung ist bereits die natürliche PERSON, die vom System erfunden wurde, um mit dem Recht des Systems die erfundenen Pflichten der natürlichen PERSON aufzuerlegen, nicht mehr eingebunden, und wodurch, dem entsprechend, Ihre Rechtsfähigkeit in Frage gestellt wird.\nBGB § 1 Beginn der Rechtsfähigkeit\nDie Rechtsfähigkeit des Menschen beginnt mit der Vollendung der Geburt.\nDer Mensch hat Naturrechte, für die er keine Fähigkeiten benötigt, da diese Rechte von Natur aus vorhanden sind und in der Schöpfung bereits existieren, noch bevor der Mensch geboren ist. Somit ist der § 1 des BGB glatter Unsinn und wiederum doch nicht, wenn anstelle des Menschen die natürliche PERSON stünde. Da aber im BGB der Term Mensch benutzt wird, kann davon ausgegangen werden, dass hier Naturrechte und Geburtsrechte (Systemrechte) gleichgestellt werden, was wiederum glatter Unsinn ist.\n\nUnterschied zwischen Mensch und PERSON\n\nMensch\n\t\n\nPERSON\n\nSchöpfung\n\t\n\nSymbolwelt\n\t\n\nDas Symbol für den Menschen ist die PERSON\n\nHauptdimension\n\t\n\nSubdimension\n\nWirklichkeit\n\t\n\nIllusion, Konvention\n\nEchtheit\n\t\n\nPer Konvention gilt\n\n    Authentisch\n\n    Der Mensch glaubt nur, dass er die PERSON ist.\n    Wie geht das, wenn die Sklaverei verboten ist? Es muss demnach freiwillig sein.\n\n    Der Mensch steht im Mittelpunkt des von ihm gestalteten Rechts. Der Mensch ist demnach die Zielscheibe der PERSON, die ohne den Menschen nicht existiert.\n    Die PERSON holt sich vom Menschen alle seine Daseinsformen, die im Glauben der Menschen ihren Ursprung haben.\n\n    Warum glaubt der Mensch, dass er seine PERSON ist? Wie kommt es dazu?\n\n    Der Mensch bekommt mit der Geburt gewisse Rechte geschenkt, Geburtsrechte heißt das. Dies sind nicht die Naturrechte!\n\n    Geburtsrechte sind die Rechte, die uns das System zur Verfügung stellt.\n\n\t\n\n    Identisch\n    Die PERSON glaubt identisch zu sein mit dem Menschen, der sich   authentifiziert, der authentisch ist.\n    Die PERSON existiert ohne den Menschen nicht\n    Der Eigentümer der PERSON ist das Rechtssystem.\n    Die Mentale Störung\n    Der Mensch glaubt, was in seinem Kopf gültig ist, ist auch echt.\n    An das, was der Mensch glaubt, ist eine Störung.\n    LS-SMS\n    die Latente Subdimensionale – Subliminale Mentale Störung\n    Latent\n    verborgen, ruhend, gebunden, nicht hervortretend, nicht offenkundig, nicht gleich erkennbar, kaum oder nicht in Erscheinung tretend\n    Subdimensional\n    Weil es in der Symbolwelt passiert\n    unterhalb einer Dimension in der Schöpfung.\n    Subliminal\n    Es ist uns nicht bewusst, es ist unterschwellig.\n    Mental\n    Denk- Anschauungsweise, Sinnes- Geistesart\n\n\t\n\n    Wer ist der Schöpfer der PERSON?\n    Der Schöpfer der PERSON ist der menschliche Verstand in einer mentalen Störung.\n\n\t\n\n    Symbol\n    Sym = zusammen\n    bol = bauen, zusammensetzen\n    Symbol = Zusammenbau\n    Symphonie = Zusammenklang\n\n\t\n\nDie PERSON ist das Symbol für den Menschen\n\n    Die natürliche PERSON\n\n    Absolute Schöpfung\n    Wesen zelebrieren die Schöpfung.\n    Jedes Wesen gedeiht.\n\n\t\n\n    Relative Schöpfung\n    Beziehung zum Menschen.\n    Schein\n    Absolute Schöpfung wird kopiert.\n    Diese kopierte Schöpfung versucht den Geist zu kopieren in jedem Belang.\n\n    Gesetze\n    Tag und Nacht\n    Jahr\n    Schwerkraft\n    Hunger\n\n\t\n\n    Gesetze\n    Die Gesetze in der Scheinwelt sind in Wirklichkeit Statuten oder Rechtsverordnungen oder Ordnungen oder Normen und diese werden Gesetze genannt, bekommen in Wirklichkeit nur Gesetzeskraft.\n    Weil die Menschen daran glauben, haben diese Normen die Kraft eines Gesetzes.\n    Dies zeugt auch von der Relativitätstheorie:\n    Es ist alles relativ zu den Gesetzen der Schöpfung.\n    Es ist rechtskräftig.\n\n    Ge-setze\n    Ge ist die Vorgabe durch den Schöpfer\n    sowie Gelenk\n    Geschwür\n    Geduld\n    Gefahr\n\nGe ist die Manifestation aus der Vergangenheit.\nEs ist manifestiert, fix und fertig ohne unser Zutun.\n\t\n\n    Rechtssystem ist eine Konvention von Worten.\n\n    Währung\n    währen\n    wahr\n    Aufmerksame Zuwendung.\n    Gemeinsam gewidmete Zeit.\n    Liebe zu einem Menschen, einer Pflanze, einem Tier.\n    Der Wert ist wahrscheinlich die Lebendigkeit. Wenn diese Lebendigkeit gewidmet wird in Form von Zeit, dann ist das die Währung.\n\n\t\n\n    Das Symbol für Währung ist Geld.\n    Geld ist das Symbol für die in Beziehung zueinander verbrachte Zeit.\n    Bei der Geldschöpfung verpfänden die Menschen ihre Zeit gegeneinander und erzeugen damit ein Symbol für eine Beziehung zueinander, die sie nicht haben, in Form von gewidmeter verbrachter Zeit.\n    Der Wert des Geldes ist der Glaube daran, dass Geld einen Wert hat.\n    Um so mehr Beziehungen die Menschen zueinander haben, um so weniger Wert wird das Geld und umgekehrt.\n    Der eigentliche Wert des Geldes liegt in den Beziehungen der Menschen zueinander, die sie nicht haben.\n    Geld ist ein Beziehungs-Kompensations-Mittel.\n    Geld kompensiert Beziehungen, die nicht vorhanden sind.\n    Wären diese Beziehungen vorhanden, würde es kein Geld geben.\n    Jeder, der einen Freund hat, braucht niemals Geld, weil in den Freundschaften Tauschgeschäfte entstehen, die ohne Geld funktionieren.\n    Jetzt kann sich auch jeder erklären, warum es Städte gibt, in denen die Menschen einander überhaupt nicht kennen und somit auch keine Beziehungen zueinander haben und schon gar keine freundschaftlichen.\n    Geld entzweit die Beziehungen auch in Dorfgemeinschaften.\n\n    Horus im Sinne der Sonne\n\n\t\n\n    Symbol für Horus ist die Zeit\n    Von Horus kommt das Wort hour für Stunde oder Uhr für die Zeit.\n    Wir schauen auf die Uhr und wo ist Horus mit seinen 24 Stationen für die Stunden am Tage?\n\n    Rechte\n    Frische Luft\n    Wasser\n    Naturrecht\n    Empfänger einer Gnade\n\n\t\n\n    Das Symbol für Recht heißt hier auch Recht, aber dieses Recht gestaltet der Mensch und nicht die Schöpfung (Geist). Deshalb ist dieses Recht eine Illusion des Rechts der Schöpfung.\n    Menschen, die auf diese Rechte verzichten, sind als Menschen zu betrachten. Diese Menschen haben das Etikett PERSON entfernt und dem System zurück gegeben zum Beispiel in Form von Lebenderklärung, Freeman-Eid, staatliche Selbstverwaltung (nur in Deutschland, weil Deutschland besetzt ist), usw.\n\n    Pflichten\n    Auf seine Kinder aufpassen.\n    Jemandem helfen, dem es schlecht geht.\n    Das Gefühl eine Pflicht einfach zu tun.\n    Etwas göttliches tun aus sich heraus.\n    Ein Bedürfnis:\n    Putzerfische säubern Wale usw.\n    Eine Symbiose eingehen.\n\n\t\n\n    Das Symbol für Pflichten heißt in der Illusion auch Pflichten:\n    Steuerpflicht\n    Schulpflicht\n    Pflichtbewusstsein\n    Pflichterfüllung\n    pflichtgemäß\n    pflichtschuldig\n    Diese Pflichten haben aber gar nichts mit der Schöpfung zu tun, weil sie für die Ausbeutung des Menschen benutzt werden.\n\n    Sprache\n    Bevor in der Schöpfung das Wort war, existierte der Gedanke und davor die Möglichkeit einen Gedanken denken zu können.\n    Die Stille, der ruhende Geist\n    Die Stille beinhaltet die Möglichkeit für jedes Geräusch.\n    Der ruhende Geist beinhaltet die Möglichkeit für jeden Gedanken.\n    Was nicht gedacht wurde, gibt es nicht.\n    Der Geist muss es denken und dann wird es das auch geben.\n\n\t\n\n    Das Symbol für Sprache ist die Schrift.\n    Am Anfang war das Wort.\n    Die ganze Schöpfung in der Symbolwelt ist eingekreist von Worten, die niedergeschrieben wurden.\n    Das niedergeschriebene Wort ist das System der Menschheit.\n    Was nirgendwo steht, das gibt es nicht.\n    Das geschriebene Wort ist die Grenze des Systems.\n\n    Liebe\n\n\t\n\n    Die Angst ist das eigentliche Symbol für die Liebe.\n    Die Ehe ist z.B. ein Symbol für Liebe:\n    eingetragene Lebensgemeinschaft\n\n\tDie Verbindung zwischen SEIN und Schein passiert in unserem Kopf. Wo ist aber die Verbindungsstelle, der Eingang in diese Scheinwelt?\n\n    Die Verbindungsstelle, der Eingang in die Scheinwelt ist unsere Sprache. Daher ist der Ausgang aus dieser Scheinwelt ebenfalls wieder unsere Sprache.\n    Sprache Macht Frei (Sprache macht frei).\n    Sprache und Schrift sind die Verknüpfungen zwischen Schein und SEIN.\n    Schuld – Vergebung\n    Illusion – Leben\n    Echtheit – Geltung\n    Angst – Liebe\n\nQuelle der Basisinformationen: Joe Kreissl – Die juristisch-spirituelle Betrachtung\n\n \n\nDer Mensch in Gefangenschaft!\n\nDie ausführenden Organe in der Oligarchie BRiD, werden instrumentalisiert. Und zwar in der Weise, dass das „Beamtentum des Staates“ übernommen wurde und als solches den PERSONen, also den Bürgern, vorgegaukelt wird. In der Wirklichkeit bestehen in der Oligarchie BRiD jedoch nur staatliche Strukturen in Form von NGO’s (Nichtregierungsorganisationen), die zudem auch noch eingetragene Firmen sind mit Umsatzsteuer-Nummer als auch DUNS®-Nummer, wie sie die Datenbank von Bisnode in ihren UPIK-Datensätzen ausweist, so die Polizei, alle Gerichte, alle Städte und Gemeinden, alle Finanzämter, die keine Ämter sind, alle Standesämter, die auch keine Ämter sind, alle Kirchengemeinden, alle Landesregierungen, alle Kreistage, die deutsche Bundesregierung und der deutsche Bundestag und sogar das Präsidialamt, das auch kein Amt ist"
		},
		{
			"post_id": 5,
			"title": "Auch das BverfG nur Firma !",
			"date_published": 1537889772.8,
			"body": "Hier der Film der alles erklaert !\n\nhttps://youtu.be/BUcncLo7qWw\n\nDas Verfassungsgericht ist eine Firma, die verfassungswidrig ist und unverdrossen im Namen der Verfassung Urteile spricht?\n\nDie Polizei ist eine eingetragene Marke? Und die Jungs haben alle eine private Haftpflicht, weil es gar keinen Staat gibt, der im Zweifelsfall haftet?\n\nNur eines noch: Ganz eindeutig wasserdicht ist diese Firmenklassifizierung über D-U-N-S und SIC jedoch nicht. Das stellt man bei sorgfältigem Lesen fest. Bezeichnungen und Wortwahl werden hier sicher nicht zufällig gewählt.\n\nSucht man auf Upik, wie man eine solche D-U-N-S-Nummer bekommt, findet sich folgender Text:\n\nD&B D-U-N-S® Nummer\n\nWas ist die D&B D-U-N-S® Nummer?\nDie D&B D-U-N-S® Nummer (Data Universal Numbering System) ist ein neunstelliger Zahlenschlüssel. Mit diesem können Unternehmen weltweit eindeutig identifiziert werden. Firmen und auch Unternehmensbereiche lassen sich so ihren Muttergesellschaften, Niederlassungen, Hauptsitzen und Filialen zuordnen.\n\nFür wen kann eine D&B D-U-N-S® Nummer beantragt werden?\nDie D&B D-U-N-S® Nummer dient ausschließlich dazu, Unternehmen/Wirtschaftsteilnehmer zu identifizieren. Dies umfasst auch Unternehmensbereiche, öffentliche Einrichtungen, Gewerbetreibende und andere Selbstständige. Sie wird nicht für Privatpersonen vergeben. Zusammengefasst wird die D&B D-U-N-S® Nummer jeder kommerziellen, gemeinnützigen oder öffentlichen Entität zugewiesen, für die bereits ein Datensatz oder eine Datei vorhanden oder neu erzeugt worden ist.\n\nEine einmalige D&B D-U-N-S® Nummer wird z.B. folgenden Wirtschaftssubjekten zugeordnet:\n\n    Rechtlich selbständigen Entitäten, z.B. Einzelfirmen, Personengesellschaften, Kapitalgesellschaften, Körperschaften\n    Sämtlichen Nebenstandorten, einschließlich Zweigniederlassungen, oder Abteilungen\n    Selbständig Beschäftigten, z.B. Ärzten, Anwälten, Ingenieuren, Berater bzw. Auftragnehmern und öffentlichen Auftragnehmern, die eine spezifische Geschäftstätigkeit ausüben\n    Gemeinnützigen Einrichtungen\n    Öffentlichen Entitäten, z.B. Zweigstellen, Agenturen, Ministerien, Militäreinrichtungen, usw.\n\nD&B wird einer Geschäftsentität dann eine D&B D-U-N-S® Nummer zuweisen, wenn ihre Existenz entweder durch einen Kontakt mit dem Unternehmen/Wirtschaftsteilnehmer oder durch eine Registration bei einer kompetenten Registrationsstelle (z.B. dem Handelsregister) bestätigt wird.\n\nDetaillierte Informationen zur Vergabe der D&B D-U-N-S® Nummer finden Sie in der Global Policy von D&B, die Sie unter UPIK® Wissen abrufen können.\n\nWas ist bei der Verwendung der D&B D-U-N-S® Nummer zu beachten?\nDie D&B D-U-N-S® Nummer ist ein eingetragenes, weltweit geschütztes Warenzeichen der D&B Corporation, USA. Seine Verwendung in Schriftform ist auf die Schreibweise „D&B D-U-N-S® Nummer“ festgelegt.\n\nWer nutzt und empfiehlt die D&B D-U-N-S® Nummer?\nDie D&B D-U-N-S® Nummer wird unter anderem vom Verband der Automobilindustrie (VDA), dem Verband der Chemischen Industrie (VCI), der Europäischen Kommission und der Internationalen Organisation für Normung (ISO) empfohlen und eingesetzt.\n\nBei der SIC-Nummer gibt es für diesen Bereich ebenfalls eine nicht 100-prozentig eindeutige Formulierung.\n\nDie Klassifizierung „Öffentliche Verwaltung/Public Administration“ ist nicht EINDEUTIG als nicht-staatlich definiert. Es bedeutet nichts anderes, als eine Verwaltung, die öffentlichen Dinge verwaltet. Das kann eine Firma auch. Hier der Wikipedia-Eintrag\nStandard Industrial Classification\n\nStandard Industrial Classification (SIC) ist ein Klassifikationsschema für unterschiedliche Industriezweige bzw. Branchen in den USA. Dieses Klassifikationsschema, welches seit den 1930er Jahren existiert, fand in der nordamerikanischen Forschung häufige Verwendung, um branchenspezifische Untersuchungen durchzuführen.\n\nDer SIC wurde 1997 durch das von den USA, Kanada und Mexiko gemeinsam entwickelte, sechsstellige North American Industry Classification System (NAICS) ersetzt. Von einigen Behörden, wie der United States Securities and Exchange Commission (SEC), wird es weiter verwendet.\nAufbau\n\nBeim SIC werden jeder einzelnen Branche zwei-, drei- oder vierstellige numerische Codes zugeordnet. Ähnliche Branchen werden in sogenannten Hauptgruppen (Major Groups) zusammengefasst. Hauptgruppen werden wiederum zu zehn Divisionen aggregiert. Dies sind:\n\n    Division A: Landwirtschaft, Forstwirtschaft, Fischerei (Agriculture, Forestry, Fishing)\n    Division B: Bergbau (Mining)\n    Division C: Baugewerbe (Construction)\n    Division D: Verarbeitendes Gewerbe (Manufacturing)\n    Division E: Transport, Kommunikation, Energie, … (Transportation, Communications, Electric, Gas and Sanitary Services)\n    Division F: Großhandel (Wholesale Trade)\n    Division G: Einzelhandel (Retail Trade)\n    Division H: Finanz-, Versicherungs- und Immobilienwirtschaft (Finance, Insurance and Real Estate)\n    Division I: Dienstleistungen (Services)\n    Division J: Öffentliche Verwaltung (Public Administration)\n\nHier bleibt anzumerken, daß die deutsche SIC-Klassifizierung das Wort „Regierungsstellen“ benutzt. Das könnte man als Gegenbeweis werten. Denn „Regierungen“ sind eindeutig Staaten zugeordnet. Falls das überhaupt noch was zu bedeuten hat.\n\nIn dem Upik-Text, wer überhaupt eine D-U-N-S-Nummer bekommen kann, heißt es jedoch „öffentliche Entitäten“, und in der Definition der SIC-Klassifikation steht „Öffentliche Verwaltung/Public Aministration„ – und eben nicht „Amt“, „amtlich“, „Staat“, „staatlich“ oder „Regierung“.\n\nEntscheident ist jedoch das die BRvD  keine Verfassung hat laut 146 GG sondern es verhindert wird das dieses entscheidende Element fuer einen Staat nicht vorhanden ist , sondern es  1990 verhindert wurde Kohl und Genscher das dem deutschen Volk die Moeglichkeit verwehrt worden ist.  "
		},
		{
			"post_id": 4,
			"title": "Wer ist Deutscher ?",
			"date_published": 1537885012.7,
			"body": "\n\n\n\n\nArt. 116   Grundgesetz GG\n\n(1) Deutscher im Sinne dieses Grundgesetzes ist vorbehaltlich anderweitiger gesetzlicher Regelung, wer die deutsche Staatsangehörigkeit besitzt oder als Flüchtling oder Vertriebener deutscher Volkszugehörigkeit oder als dessen Ehegatte oder Abkömmling in dem Gebiete des Deutschen Reiches nach dem Stande vom 31. Dezember 1937 Aufnahme gefunden hat.\n\n(2) 1Frühere deutsche Staatsangehörige, denen zwischen dem 30. Januar 1933 und dem 8. Mai 1945 die Staatsangehörigkeit aus politischen, rassischen oder religiösen Gründen entzogen worden ist, und ihre Abkömmlinge sind auf Antrag wieder einzubürgern. 2Sie gelten als nicht ausgebürgert, sofern sie nach dem 8. Mai 1945 ihren Wohnsitz in Deutschland genommen haben und nicht einen entgegengesetzten Willen zum Ausdruck gebracht haben.\n\nDie anderweitige gesetzliche Regelung ist das Reichs und Staatsangehoerigkeitsgesetz RuStAG !!\n\n\nNach dem § 4 Abs. 1 RuStAG (vom 22.07.1913) erwirbt ein Kind durch Geburt aufgrund der Abstammung die Staatsangehörigkeit ehelich vom Vater und unehelich von der Mutter.\n(Deutsches Reich, Weimarer Republik, Bundesrepublik Deutschland).\n\nNach dem §4 Abs. 1 StAG (vom 15.07.1999) erwirbt ein Kind durch Geburt aufgrund der Abstammung die Reichsangehörigkeit (=deutsche Staatsangehörigkeit; seit 05.02.1934), wenn ein Elternteil die Reichsangehörigkeit (=deutsche Staatsangehörigkeit seit 05.02.1934) besitzt (Bundesrepublik Deutschland).\n\nEine Staatsangehörigkeit „Bundesrepublik Deutschland“ existiert nicht, da die Bundesrepublik Deutschland kein Staat ist, sondern nur eine Verwaltungsorganisation nach Genfer Konvention (Gewahrsamstaat). Welche solange weiter betrieben wird, wie der „deutsche Staat“ handlungsunfähig gestellt bleibt (dies seit 1918).\n\nGemäß dem Artikel 50 des Einführungsgesetzes zum Bürgerlichen Gesetzbuch (EGBGB) i.d.a.F. gilt:\n„Die Reichsgesetze bleiben in Kraft. Sie treten jedoch insoweit außer Kraft, als sich aus dem Bürgerlichene Gesetzbuch oder aus diesem Gesetz die Aufhebung ergibt.“\n\nDas Reichs- und Staatsangehörigkeitsgesetz (RuStAG) vom 22.07.1913 gilt fort bis zum heutigen Tage. Daher muss die Bundesrepublik Deutschland es aus völkerrechtlichen Gründen anwenden (Siehe u.a. die Ausstellung des Staatsangehörigkeitsausweis).\n\n+++++\n\nMan darf sich fragen, warum die Richter und Staatsanwälte all die vielen Gesetze zugunsten der Menschen negieren?\nKann die Antwort darin liegen, dass wir immer noch von „NaZis“ regiert werden? Ist der Verein „EU“ das 4.te Reich?"
		},
		{
			"post_id": 3,
			"title": "Firma Finanzamt !",
			"date_published": 1537883446.9,
			"body": "Kleve (06.03.2016). Beim Finanzamt Kleve geht es um Geld. Viel Geld. Auf 865 Millionen Euro belief sich das Steueraufkommen von 50.000 Arbeitnehmern und 20.000 Unternehmern, die hier im vergangenen Jahr ihre Steuererklärungen einreichten. Die Bearbeitung erfolgt mittlerweile weitestgehend elektronisch. „Rund zwei Drittel der gewerblichen und gut die Hälfte aller privaten Steuerklärungen kommen mittlerweile auf elektronischen Weg bei uns an“, sagt Sandra Tigler, Hauptsachgebietsleiterin Einkommenssteuer.\nUnd es werden noch mehr werden. Seit 2011 besteht u.a. für Gewerbetreibende und Selbstständige sowie Land- und Forstwirte die gesetzliche Verpflichtung, die Steuererklärung elektronisch zu übermitteln. In diesem Jahr wird das Finanzamt Kleve hier ein letztes Mal beide Augen zudrücken, eine „letzte Warnung“ verschicken. Ab 2017 wird es teuer, sollte die Erklärung weiterhin „auf Papier“ eingereicht werden. Verspätungszuschläge von bis zu 10 Prozent könnten dann auf die Steuersumme aufgeschlagen werden.  „Deshalb werden für die Zielgruppen auch keine Steuererklärungsvordrucke mehr öffentlich ausgelegt“, sagt Manfred Winkler, Vorsteher des Klever Finanzamtes. Der Grund für dieses Vorgehen: Wenn die Erklärung auf Papier eingeht, muss diese zunächst erfasst oder eingescannt werden. Dieser Arbeitsschritt entfällt bei der elektronischen Abgabe. „Die elektronische Abgabe hat aber auch für den Steuerpflichtigen Vorteile: Über das Elster-Programm können beispielsweise die zur Person gespeicherten Daten in die Erklärung eingefügt werden, mögliche Rechenfehler werden sofort angemahnt und es erfolgt eine direkte unverbindliche Steuerberechnung“, wirbt Winkler für das gewünschte Prozedere.\nDas Finanzamt Kleve kündigte auch an, sich bestimmte Steuererklärungen für das Jahr 2015 genauer ansehen. Und zwar solche, in denen „Steuerbürger“ Firmen- bzw. Dienstfahrzeugen auch für private Zwecke nutzen. „Wir werden genau prüfen, ob hier alles richtig versteuert ist, zum Beispiel, ob Fahrtenbücher korrekt geführt wurden“, sagt Sandra Tingler.\nWas hat sich auf Bundesebene geändert? Der Grundfreibetrag steigt von 8.354  auf 8.472 Euro pro Person an. Zudem steigt der Kinderfreibetrag pro Elternpaar um 144 Euro auf 4.512 Euro. Beides wird bei der Berechnung automatisch berücksichtigt. Zudem wurde der Entlastungsbetrag für Alleinerziehende angehoben. Hierfür muss beim Finanzamt allerdings ein Lohnsteuerermäßigungsantrag gestellt werden. Nicht so schön: Der Besteuerungsanteil der gesetzlichen Rente beträgt für Neurentner jetzt 70 Prozent.\nRalf Wenning, Hauptsachgebietsleiter Erhebung, berichtet davon, dass Steuersäumigen die „Flucht“ ins europäische Ausland nicht weiterhilft. Die 28 Mitgliedsstaaten der Europäischen Union haben nämlich ein gemeinsames System entwickelt, um Schulden einzutreiben. „Insbesondere die Zusammenearbeit mit den holländischen Behörden funktioniert reibungslos“, so Wenning.\n\n"
		},
		{
			"post_id": 2,
			"title": " GEZ ! ",
			"date_published": 1537883339.4,
			"body": "Das Bundesverwaltungsgericht in Leipzig hat eine Entscheidung zum Rundfunkbeitrag gefällt, die bahnbrechend sein könnte: Die Richter stellten fest, dass der Rundfunkbeitrag für Hotel- und Gästezimmer nur erhoben werden darf, wenn die Zimmer auch eine Empfangsmöglichkeit bieten. Nur dann sei die Zahlung des zusätzlichen Rundfunkbeitrags mit dem Grundgesetz vereinbar (Az: BVerwG 6 C 32.16).\nGeklagt hatte eine Hostel-Betreiberin aus Neu-Ulm, die sich weigerte, neben dem allgemeinen Rundfunkbeitrag für Betriebsstätten den zusätzlichen Beitrag für Gästezimmer zu zahlen. Sie hatte ins Feld geführt, dass es in den Zimmern keine Fernseher, Radios und keinen Internetempfang gebe. In den Vorinstanzen war die Klage noch erfolglos geblieben. Für jedes Zimmer beziehungsweise jede Ferienwohnung muss der Inhaber ein Drittel des Rundfunkbeitrags zahlen, bestätigte das Bundesverwaltungsgericht. Das sind monatlich 5,83 Euro pro Zimmer, wobei die erste Räumlichkeit beitragsfrei ist. Neben dem zusätzlichen Beitrag müssen die Betreiber den Beitrag für Betriebsstätten zahlen, dieser richtet sich nach der Zahl der Beschäftigten und der Anzahl der Fahrzeuge. Ob die Hostel-Betreiberin aus Neu-Ulm tatsächlich keine Empfangsmöglichkeit bietet, soll nun überprüft werden. Das Bundesverwaltungsgericht hat den Fall an den Bayerischen Verwaltungsgerichtshof zurückgegeben."
		},
		{
			"post_id": 1,
			"title": "Kirchengemeinden als betrügerische Firmen !\n\nDie Lutherkirche Osnabrück ist Teil eines Geschäfsverbundes. \n\nIn einem gottlosen Firmengebäude werden fette Geschäfte gemacht.",
			"date_published": 1514764800,
			"body": "\nDie Adresse vom Geschhäftsführer der Fa. Lutherkirche [ 2009\nbis 2011] in Osnabrück  finden Sie in diesem Beitrag .\nWer nichts zu verbergen hat , bei dem kann man in Ruhe auch nachfragen so sieht es die Redaktion . \nDen Grund finden Sie hier nichtgewählte Politiker aufgrund eines ungültigen Wahlgesetzes !!!!! daher unlegitimiert !! können nichts beschliessen.\nSchauen Sie selbst !\nhttps://youtu.be/Bh-wDtK6EIo\n\nDie Politiker sind Firmenmitarbeiter wie diese Kirche ! Sie haben nichts zu melden. Um für Nachwelt die Täter und Nutzniesser die gegen jegliches Recht verstossen zu erhalten , werden Sie hier mit Namen und Adresse dokumentiert ! \n\nIn seiner Eigenschaft als Schauspieler stellt er dort den Diakon dar , er ist jedoch nur ein Geschäftsführer  der teure Dienstleistungen an den Mann bringt. \nSein neues Reisebüro ist das Aufgreifen einer schon sehr alten Idee. Mit der ganzen Manschaft verfolgt er das Machtprinzip Teile und Herrsche. \nEs ist ja in jedem Geschäft so. In dieser Firma werden Dienstleistungen angeboten . Hochzeiten für Schwule und Lesben als Event. \n\nDas sind gibt es  neuerdings Lebensfeste wie es dort heisst. Nicht umsonst , eine sprachliche Entirrung. Schwule , Gender und Kopfkranke regieren ohne jeglich Kompetenz und fuellen sich zudem Ihre Tasche.\n\nDiese verbale Enstellung ist das gleiche wie Jahresendzeitfiguren und die Zipfelmänner. Es gibt in der deutschen Sprache Negerküsse und so sollte es bleiben.\nBibeln in gerechter Sprache ! ist Schwachsinn hoch zehn. Das es sich hierbei um ein hochkriminelles Unternehmen handelt das vorgibt ueber ander zu herrschen versteht sich von selbst.\n\nWir sehen das durch die sprachliche Entfremdung und damit die soziale sprachliche Bindung einfach duemmlich ist.\nDem wird hier entgegengetreten.\n\nDas alles macht das hier abgedruckte Firmenkonstrukt. Jeder kann es nachvollziehen.  \n\nMan spricht z.B. von einem Pfarramt und darauf reagieren die Leute. Beamte hat das Unternehmen aber keine. Dafuer Schauspieler die den Beamten spielen. Es ist sozusagen wie beim Hauptmann von Köpenik.\n\nWarum gibt es dort keine Beamte ?\nDie Antwort ist ganz einfach und ist für jeden schnell gefunden.\nSie steht im Netz. \nSichern Sie sich diese Vorgaenge . Es wird wie in jeder Diktatur zensiert.\nDieses Plenum kann nicht abgeschaltet werden.\nSie brauchen nichts Glauben. Das ist Sache von diesen Schauspielern.\nSchauen Sie sich die Gesetze an und vergleichen Sie diese mit den hier vorliegenden Informationen.\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone\n\nhttps://opinioiuris.de/entscheidung/805\nBVerfG, 17.12.1953 - 1 BvR 147/52\nUnd das seit 1953 . Ohne Umschweife wurde das vom höchsten deutschen Firmengericht entschieden.\n\nhttps://www.gesetze-im-internet.de/kstg_1977/__4.html\n\nEntscheident ist der letzte Satz !!!!!    \nPrüfen Sie es selbst !!!!!!!\n\nKörperschaftsteuergesetz (KStG)\n§ 4 Betriebe gewerblicher Art von juristischen Personen des öffentlichen Rechts\n(1) 1Betriebe gewerblicher Art von juristischen Personen des öffentlichen Rechts im Sinne des § 1 Abs. 1 Nr. 6 sind vorbehaltlich des Absatzes 5 alle Einrichtungen, die einer nachhaltigen wirtschaftlichen Tätigkeit zur Erzielung von Einnahmen außerhalb der Land- und Forstwirtschaft dienen und die sich innerhalb der Gesamtbetätigung der juristischen Person wirtschaftlich herausheben. 2Die Absicht, Gewinn zu erzielen, und die Beteiligung am allgemeinen wirtschaftlichen Verkehr sind nicht erforderlich.\n(2) Ein Betrieb gewerblicher Art ist auch unbeschränkt steuerpflichtig, wenn er selbst eine juristische Person des öffentlichen Rechts ist.\n(3) Zu den Betrieben gewerblicher Art gehören auch Betriebe, die der Versorgung der Bevölkerung mit Wasser, Gas, Elektrizität oder Wärme, dem öffentlichen Verkehr oder dem Hafenbetrieb dienen.\n(4) Als Betrieb gewerblicher Art gilt die Verpachtung eines solchen Betriebs.\n(5) 1Zu den Betrieben gewerblicher Art gehören nicht Betriebe, die überwiegend der Ausübung der öffentlichen Gewalt dienen (Hoheitsbetriebe). 2Für die Annahme eines Hoheitsbetriebs reichen Zwangs- oder Monopolrechte nicht aus.\n(6) 1Ein Betrieb gewerblicher Art kann mit einem oder mehreren anderen Betrieben gewerblicher Art zusammengefasst werden, wenn\n\n1.\n    sie gleichartig sind,\n2.\n    zwischen ihnen nach dem Gesamtbild der tatsächlichen Verhältnisse objektiv eine enge wechselseitige technisch-wirtschaftliche Verflechtung von einigem Gewicht besteht oder\n3.\n    Betriebe gewerblicher Art im Sinne des Absatzes 3 vorliegen.\n\n2Ein Betrieb gewerblicher Art kann nicht mit einem Hoheitsbetrieb zusammengefasst werden.\n\n\n\nSehen Sie sich bitte alle Informationen an . Prüfen Sie !! \nNur die Fa. Kirche braucht den Glauben , Sie nicht.\n\nhttps://www.upik.de\ngeben Sie die DUNS Nr. ein , die Sie unten auf dieser Seite\nfinden und prüfen Sie es selbst !\n\nWas macht ein Pastor oder Diakon ?\n1. Geschäfte !\n2. Geschäfte !\n3. Geschäfte !\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone/dirk_hartung\n\nZitat unter Persönliches  \n,, 2009 bis 2011 Geschäftsführer der Südstadtkirchengemeinde, seit 2011 Gemeindediakon Südstadtkirchengemeinde ,, .\nVeruchen Sie da mal anzurufen und jemanden persönlich zu sprechen. AB heisst die Antwort von dieser Schar hochbezahlter Leute , die sich auf unsere Kosten ein schoenes Leben machen.\nDa schmeissen die lieber die Putzfrau rauss. Ein falsches Wort und es ist passiert. \n\nNun der Chef hat Ansprüche !  Auch hier das Problem der Vermessenheit dieser Schauspieler mit Spitzengagen !\n\n\nDer ehemaliger Geschäftsführer ist als Burgschauspieler 2011 wieder in seine Rolle geschlüpft !\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nNutzen Sie die Adresse um einmal direkt mit einem echten Geschäftsführer ins Gespräch zu kommen. Der Hauptverantwortliche oder besser Firmengründer ist ebenfalls ausgewiesen. Ein hochbezahlter  Geschäftsmann. Schon Calligula hatte solche Marotten.\n\n\nUPIK® Datensatz – L\nL \tName \tLutherkirche Osnabrück\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t312512729\nL \tGeschäftssitz \tMiquelstr. 5\nL \tPostleitzahl \t49082\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t05415690166\n\tFax Nummer \t\nW \tName Hauptverantwortlicher \tMartin Wolter\nW \tTätigkeit (SIC) \t8661\n\n\nHier ist die Haupstelle !!  der Filale Osnabrück\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labor\n\nDie ganze Schauspielertruppe \n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone\n\n\n\nGeld verschleudern ohne Ende ? \nKein Thema wird doch aus Steuern\nfinanziert.\nHier einige Meisterstücke eines schwulen Geschäftsführers .\nSie machen deutlich wohin der Weg nun hinführt. \nDem Unternehmer fehlt es nicht an Ideen. \nWenn Sie auch nie das Anfangsstadium eines Lehrlings in der Werbewirtschaft verlassen hat.\nWerbewirksam wurde das mal als Gotteshaus geplante Gebäude zum Schwulenzentrum mit Restaurant und Muezzinrufen. \n\nHoffentlich ist die Küche koscher. \n\nEin anderes mal wird der Islam bemüht. Der Muezin auf dem Dach eines Schauspielhauses erbaut als Kirche zur Jahrhundertwende wird nun zum ganzjährigen Schauspielhaus , für passionierte Karnevalisten.  \n\nDie Schauspieler sind zugleich Büttenredner für sogenannte Vorstandsmitglieder. \nEin Restbestand an Narren leistet Ihnen Sonntags Gesellschaft.\nIn der sogenannten Sommerkirche schaffen sich seine Mitstreiter viel Freizeit. \n\nUnd keiner merkt es weil ja kaum jemand dort ist. \n\nWird aber alles voll bezahlt !  Das basiert auf 415 AO  das ist die nie in Kraft getretene Abgabenordnung . \nSie bezahlen deren Wohlstand obwohle es auf einem Gesetz beruht welche nie in Kraft getreten ist.\n\nhttps://dejure.org/gesetze/AO/415.html\n\n\nSie sehen das Sie es hier mit Kriminellen zu tun haben.\nDie Mitarbeiter der Fa. Finanzamt erpressen damit die Steuerzahler die dieses Schauspielhaus finanzieren , damit es den Schauspielern entsprechend gut geht. Herzlichen Dank dafür. Gut das es dieses unzensierbare Netz möglich macht das einmal unlöschbar auch als Dokument für die Nachwelt zu erhalten.\n\nDas so durch Betrug erlangte Vermoegen muss verprasst werden und das geht so.\n\nhttp://queer-gottesdienst.de/\n \nhttps://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n\nDafuer wird viel Geld gebraucht. Solche ldeengeber braucht das Land. Hier von geistiger Abgeirrtheit zu sprechen ist unter christlichen Gesichtspunkten mehr als angebracht. Unternehmerisch ist es das gleiche.\n\n\n\nWeitere erfolgreiche Geschäftsfilialen\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Ev.-luth. Kirchengemeinde Wietze\nNicht eingetragene Bezeichnung oder\nUnternehmensteil\nL D-U-N-S® Nummer 340435489\nL Geschäftssitz Kirchstr. 6\nL Postleitzahl 29323\nL Postalische Stadt Wietze\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 051462154\nFax Nummer\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labor"
		}
	]
}