{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1556293876_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 1,
				"body": "> [ciniil8n2](#comment_1_17pyCvFSCXyYUiEid8Wa1dmchWa1Cr7AcK): А давай лучше популяризировать что-нибудь, что не требует для своей корректной работы анального жабаскрипта.\n\nПолностью поддерживаю.",
				"added": 1557580174
			},
			{
				"comment_id": 2,
				"body": "> [deliriumgoddess6](#comment_5_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): т.е. ничего не надо популяризировать?\n\nИдея в основе - замечательная, но ее практическая реализация, мягко говоря, весьма далека от заявленного идеала. С одной стороны пропагандируется свобода и открытость, с другой - навязываются сомнительные и в некоторой степени опасная для приватности и безопасности технология: JS - на котором здесь все основано. К тому же создаваемые приложения - \"зайты\" используют специфическое API, в результате чего не способны работать вне сети ZN, другими словами, имеют вендерлок, что \"малость\" проиворечитит заявленной свободе.\n\nС точки зрения простых пользователей, которые не задумываются о технических подробностях, и которых привлекает только внешний красочный фасад  прложений, используемых в ZN - это одна сеть, но для пользователей - создателей контента, в частности - сайтов, это совершенно другое.",
				"added": 1558270938
			},
			{
				"comment_id": 3,
				"body": "> [xan](#comment_4_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Простые пользователи 0net это и есть мы, которые знают про API и другие аббревиатуры. Других тут и не будет.\n\nТогда я не понимаю, для чего разрабы так заморочились с модным, красочным, свистяще-пердящем интерфейсом? Для гиков вполне хватило бы минимализма в стиле Freenet.",
				"added": 1558392064
			},
			{
				"comment_id": 4,
				"body": "> [deliriumgoddess6](#comment_6_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): фринет не привлекателен и неудобен.\n\nВопрос вкуса не является поводом добавить в его функционал и интерфейс как можно больше шахмат и поэтесс. А безопасность всегда проиворечит удобству использования.",
				"added": 1558452618
			},
			{
				"comment_id": 5,
				"body": "> [zerolespero](#comment_1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): как бы в зеронете есть место федерациям, пример -- хабы в ZeroMe\n\nСомнительное решение тащить федеративность в децентрализованую сеть. Плохо, когда нет гарантии сохранения сообщений. Вернее сказать - когда их хранение зависит от желания, доброй воли и энтузиазма владельцев хабов.",
				"added": 1558708134
			},
			{
				"comment_id": 6,
				"body": "> [xan](#comment_5_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Есть возможность сделать свой хаб, а затем убедить окружающих в его благонадёжности; либо довериться одному из существующих хабов. Всё упирается в силу инициативы и доверия.\n\nСлучаются разные жизненные ситуации, в которых создателю хаба будет совсем не до ZN и его пользователей. Или он просто потеряет интерес к данной сети и не захочет продолжать свою деятельность.\n\nКак раз исходя из приведенных соображений следует считать любую федеративность - точкой отказа для децентрализованной сети, способной нарушить ее работу и как следствие, вызвать недовольство пользователей. Уж если разрабы взяли за основу децентрализацию, то необходимо что бы и все вспомогательные сервисы были также децентрализованными. Иначе полностью теряется сам смысл децентрализации, и сводится \"на нет\" все достоинства данной модели устройтства сети.\n\nСитуация усугубляется тем, что все знают, что в один прекрасный день могут остатся без своих сообщений или не смогут аутентифицироваться, но надеятся на авось, что владельцы хабов не разбегуться или не удалят, полностью или частично данные.\n\nО какой популяризации и развитии может идти речь, если присутствуют такие косяки? Создвать интересный контент, что бы однажды остаться без него или лишиться своих читателей...",
				"added": 1558917896
			},
			{
				"comment_id": 7,
				"body": "> [anotherneko](#comment_5_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Хаб не требует поддержки со стороны своего создателя.\n\nА как же размер профиля - каким образом устанавливется лимит на посты? Или каждый пользователь может постить тексты любого размера в неограниченном количестве?",
				"added": 1559050288
			},
			{
				"comment_id": 8,
				"body": "> [anotherneko](#comment_6_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Есть лимит по умолчанию, который применяется ко всем, для кого явно не указан другой.\n\nЧто делать в случае исчерпания лимита на заброшенном хабе?",
				"added": 1559066286
			},
			{
				"comment_id": 9,
				"body": "> [anotherneko](#comment_7_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Удалить свои старые записи, завести новую учетку или переехать на другой хаб.\n\nЗамечательная, просто гениальная фитча!  \"Потенцеальные создатели контента\" наверняка ее уже успели оценить, в равной степени,  как и владельцы работающих сайтов в клирнете оценили необходимось переписывать их \"с нуля\", для возможности переноса в ZeroNet.",
				"added": 1559201387
			},
			{
				"comment_id": 10,
				"body": "> [xan](#comment_6_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Говоря о разных жизненных ситуациях, вы имеете в виду себя или кого-то другого?\n\nЯ имел в виду недостатки данного решения,  весьма похожего на костыль, и сводящего \"на нет\" идею децентрализации.\n\n>Просто не понятно, что вам мешает сделать свой хаб. [...]\n\nВсе, кто захочет читать мои сообщения должны будут его подргузить и постоянно синхронизировать. А теперь представим ситуацию, что каждый активный пользователь сети создаст свой хаб... И их станет не 20, как сейчас, а 1000 или более. Тогда сеть станет неработоспособной, из-за длинных очередей синхронизации,  \"благодря\" которым новые сообщения будут распространаться со значительной задержкой и количество служебного трафика в несколько раз привысит полезный. Наиболее сильно пострадают ноды, не находящиеся постоянно онлайн. После подключения им придется час ждать завершения синхронизации со всеми хабами.\n\nИдея  с хабами -  костыль, работоспособный при низкой сетевой нагрузке. По сути - тупиковый вариант, не позволящий развиваться сети.",
				"added": 1559517440
			},
			{
				"comment_id": 11,
				"body": "> [xan](#comment_7_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY):  Может ну её эту децентрализацию, говорят телега быстро пашет даже в условиях блокировок :-)\n\nДело не в блокировках. У телеги есть хозяин, который собирет и торгует информацией о вас (как ему без прибыли компенсировать затраты противодействие блокировкам? :-) и одобренное пользователм соглашение об услугах, на основании которого все несогласные с администрацией, представляющих волю хозяина, идут... лесом.\n\n>Есть у вас предложения получше?\nДля преодоления цензуры можно использовать i2p или тот же самый Tor. В них тоже имеются борды, форумы и сайты. Да, конечно они не дублиуются автоматически у всех пользователей, зашедших их посмотреть. Но никто не мешеает выкладывать удобный для скачивания и последующего развертывания архив с контентом, для поднятия зеркала. Контент - это главное, что есть в сети. Что толку от 100500 локальных копий \"зайта\", если он не обновляется и заброшен своим создателем пару лет назад? \n\n ZN в том виде, как он есть - демонстрационный прототип, который как-то работает, исходя из условия, что он никогда не наберет популярность и не будет массово использоваться, например, как телега. Его удел: 100-200, максимум 500 более-менее активных пользователй и от силы пару тысяч \"зашедших потыкать палочкой\", сказать \"вау!\". Причем, самые продвинутые - даже сделают по мануале свой \"зайтик\" из трех постов, и вдоволь наигравшись в \"свободолюбивых хакеров, ненавидящих цензуру\", благополучно вернутся в свои уютные телеги, контактики и мордокнижки...",
				"added": 1559583545
			},
			{
				"comment_id": 12,
				"body": "> [xan](#comment_8_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Если вам i2p больше подходит, то почему мы сейчас общаемся в здесь?\n\nКаждый пользователь обязан выбрать один из возможных вариантов. Два или три - запрещено. :-)))\n\n>А про Tor можете поднять данные на досуге, как бы у него тоже не оказалось хозяина… ещё и покрупнее Паши.\n\nРечь вроде как изначально шла про избежание или обход цензуры, а не про другие возможности, тесно связанные с анонимностью. Узлы Tor по крайней мере не принадлежат единолично одной единственной конторе и не хотят ваш телефонный номер для возможности их использования...\n\n>Серьёзно?\n\nА что не так? Многие свободные проекты даже git своего сайта выкладывают, что бы легче было проследить изменения.\n\n>nuff said\n\nТо был горький сарказм, если что.",
				"added": 1559598678
			},
			{
				"comment_id": 13,
				"body": "> [anotherneko](#comment_8_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): С чего бы ей стать от этого неработоспособной? \n\nПервой, самой существенной проблемой видится возрастающий объем служебного трафика при росте количества синхронизируемых ресурсов. Когда имеется 100-200 локальных копий, из которых только несколько обновляются с интервалом час или десятки минут - это одна нагрузка на сеть. Но что произойдет, если их количество возрастет до нескольких тысяч, причем большинство из них будут не сайты, а вспомогательные ресурсы - хабы. Причем анонсы при высокой активности множетсва пользователей будут идти постоянно ежесекундно по нескольким сотням ресурсов. Придется непрерывно загружать сотни файлов  content.json (и data.json - которые могут иметь значительный объем)  в течении каждой секунды.\n\nВторая проблема: отсутстве гарантии достижения читаеля анонсов изменений контента паблишера. Такое может произойти в случае большого количества трекеров, когда возможна ситуация при которой они оба не будут иметь общих трекров и других пиров, подписанных на контент паблишера, имеющих хотя бы один общий с ними трекер, через который может быть передан анонс. Большим, популярным ресурсам это не грзит,  из-за большого количества подписчиков их анонсы будут на большинстве торентов, но для мелких это будет проблемой.\n\nИли же все трекры должны уметь синхронизироваться друг с другом, что тоже не вариант при большом количестве анонсов. Или же на клиенте должна происходить постоянная ротация трекеров. Оба варианта увеличат служебный трафик сети. Неспроста при использовании обычного торрент протокола в процессе создании торента всегда явно указывается трекер, который отвечает за анонсы данного конкретного торента. Те, кто не сумеет подключится к данному трекру, будет сидеть с нулем пиров по данному торенту. Или использовать DHT, который в ZN еще не завезли.\n\n>Что касается задержки, то не вижу в ней ничего плохого.\n\nЭто убъет основую имхо фитчу ZN - возможность большую часть времени находиться оффлайн, подключаясь для синхронизации на время активного взвимодействия с сетью. После оффлайна придется часами ждать завершения синхрноизации, что бы прочитать все сообщения на форуме, а не часть их. Или придется длительное время (десятки минут или часы) ждать после отправки сообщения пока его смогут прочитать другие пользователи форума. Что в этом хорошего?",
				"added": 1559655997
			},
			{
				"comment_id": 14,
				"body": "> [anotherneko](#comment_9_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Каждый ресурс, вне зависимости от того, сайт он или хаб, автономен и не мешает остальным.\n\nРечь не о взаимном влиянии, а количестве сообщений - нагрузке на сеть с которой сможет справиться клиент, в случае роста популярности ZN. Способна ли будет нормально синхронизироваться сеть, если, к примеру, активность в приложении ZeroMe возрастет в сотню раз? Вместо 10 сообщений в сутки их станет 1000?\n\nКаждый раз при написании сообщения производится синхронизация, поэтому количество синхронизация равно количеству новых сообщений, при каждой их которых передается файл: data.json, содержащий сообщения пользователя, размер которого для активных пользователй может составлять сотни КБ. Тоже самое касается форумов, и других сетевых ресурсов с возможностью комментирования.\n\n>Как раз для решения этой проблемы как раз и придуманы хабы.\n\nОни не агрегируют мелкие файлы в один для последующей передачи его по частям пирам, как это делается в обычных торентах, файлы с сообщениями каждого пользователя предается отдельно по факту их обновления.",
				"added": 1559676054
			}
		]
	},
	"comment_vote": {}
}