{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"category": "music",
			"title": "As I Lay Dying - Awakened (Limited Edition) (Flac)",
			"torrent_imdb": "",
			"body": "Released\tSeptember 25, 2012\nRecorded\tMay – June 2012\nStudio\tsee Studios\nGenre\tMetalcore\n\nAudio : Flac",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/",
			"added": 1459796535
		},
		{
			"topic_id": 2,
			"category": "games",
			"title": "Age of Empire 2 HD Africa Kingdoms",
			"torrent_imdb": "",
			"body": "Nothing cut / recoded ;\n Game Versions: - 4.4  ;\n Precracked - install and play;\n Crack based on : CODEX (crack fix) ;\n Install Time - 5 minutes [Quad core]\n Operating system: Win 7,Win 8,Win 8.1,Win 10 ;\n Final size: 4.25gb ;\n Voice Language : English ;\n Display/Text languages : English , Portuguese-Brasil , German , Spanish , French , Italian , Japanese , Korean , Dutch , Russian , Simplified Chinese ;\n\nIncludes all the following campaigns:\n\n AoE2-HD: Age of Kings Campaign\n AoE2-HD: The Conquerers Campaign\n AoE2-HD: The Forgotten Campaign\n AoE2-HD: The African Kingdoms Campaign\n\nINSTALL INSTRUCTIONS:\n\nDISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup.exe' (IMPORTANT) to avoid any error message . (For avast users: Just Disable DeepScreen in antivirus settings)...\n\nAfter running setup,, click on 'Configure',, specify the install directory,, click on next and next,, select the necessary software (Direct X and Visual C++ [provided in Redist folder]),, again next,, finally on 'Install'...PLAY THE GAME FROM DESKTOP SHORTCUT OR AoK HD_Loader.exe in your game directory , open any of them always using run as administrator.... \n\nAlways open the game using 'Run as administrator' to avoid any savegame/crash issue, if it still crashes, lower the graphics settings and make sure u meet the system requirements along with updated graphic drivers for your graphics card ...",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/Age Of Empires II HD 4.4 repack Mrr DJ.torrent",
			"added": 1459803974
		},
		{
			"topic_id": 3,
			"category": "games",
			"title": "Crusader Kings 2 + All DLC 2016 (Conclave)",
			"torrent_imdb": "",
			"body": "Crusader Kings II is a grand strategy game set in the Middle Ages, developed by Paradox Development Studio and published by Paradox Interactive as a sequel to Crusader Kings. It was released for Microsoft Windows on February 14, 2012\n\nContent :\n\ndlc001 = Dynasty Shields\n   dlc002 = Mongol Faces\n   dlc003 = Songs of Albion\n   dlc004 = Songs of Faith\n   dlc005 = Ruler Designer\n   dlc006 = Songs of the Holy Land\n   dlc007 = Sword of Islam\n   dlc008 = African Unit Pack\n   dlc009 = Songs of the Caliph\n   dlc010 = Dynasty Shield II\n   dlc011 = Legacy of Rome\n   dlc012 = Byzantine Unit Pack\n   dlc013 = African Portraits\n   dlc014 = Mediterranean Portraits\n   dlc015 = Russian Unit Pack\n   dlc016 = Russian Portraits\n   dlc017 = Songs of Byzantium\n   dlc018 = Sunset Invasion\n   dlc019 = Songs of the Rus\n   dlc020 = Norse Portraits\n   dlc021 = Norse Unit Pack\n   dlc022 = The Republic\n   dlc023 = Songs of Prosperity\n   dlc024 = The Old Gods\n   dlc025 = Hymns to the Old Gods\n   dlc026 = possibly the as-yet-unseen Songs of Arabia\n   dlc027 = Celtic Unit Pack\n   dlc028 = Celtic Portraits\n   dlc029 = Dynasty Shield III\n   dlc030 = EU4 Converter\n   dlc031 = Customisation Pack\n   dlc032 = Sons of Abraham\n   dlc033 = Military Orders Unit Pack\n   dlc034 = Warriors of Faith Unit Pack\n   dlc035 = Hymns of Abraham\n   dlc036 = Songs of Yuletide\n   dlc037 = Saxon Unit Pack\n   dlc038 = Finno-Ugric Unit Pack\n   dlc039 = Rajas of India\n   dlc040 = Turkish Unit Pack\n   dlc041 = Turkish Portraits\n   dlc042 = Songs of India\n   dlc043 = Persian Unit Pack\n   dlc044 = Persian Portraits\n   dlc045 = Charlemagne\n   dlc046 = Early Western Clothing Pack\n   dlc047 = Early Eastern Clothing Pack\n   dlc048 = Dynasty Shields Charlemagne\n   dlc050 = Way of Life\n   dlc051 = Iberian Unit Pack\n   dlc052 = Iberian Portraits\n   dlc054 = Horse Lords\n   dlc055 = Mongol Unit Pack\n   dlc056 = Songs of the Steppes\n   dlc057 = Cuman Portraits\n   dlc058 = Early Frankish Unit Pack\n   dlc059 = Early Germanic Unit Pack\n   dlc060 = Italian Unit Pack\n   dlc061 = Orchestral House Lords\n   dlc062 = Conclave\n   dlc063 = Conclave Content Pack\n   dlc064 = Viking Metal\n   dlc065 = South Indian Portraits",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/Crusader.Kings.II.Conclave-SKIDROW.torrent",
			"added": 1459805795
		},
		{
			"topic_id": 4,
			"category": "games",
			"title": "Europa Universalis IV +All DLC+All Actualization (S K I D R O W)",
			"torrent_imdb": "",
			"body": "The award-winning series that is back with unprecedented flexibility, new options for imperial management, and the same deep commitment to historical gameplay that has made Europa Universalis the legendary franchise it is today. Prepare to join a worldwide community and experience the drama and tension that only the grand stage of history can provide. Europa Universalis IV gives you control of a nation to guide it through the years and create a dominant global empire, providing you unprecedented freedom in how you want to rule your nation.\n\nDLC\nÛ ß S K I D R O W Üþß Ü\nÛ°° Ü .the leading force. ÞÝ ß²ß\nÛ±± ÞÝ ßÜ Ü Ü\nÛ²² Üß proudly presents ßþÜß²Ü\nÛÛßÜþ Europa Universalis IV: The Cossacks (c) Paradox Interactive ÞÛÛÛ\nÛÛÛÝ ÛÛÛ\nÛÛÛß ÛÛÛ\nÛÛÛ 01-12-2015......Release Date <-> Protection.................Steam ²ÛÛ\nÛÛÛ Strategy...........Game Type <-> Disk(s)....................1 DVD ±ÛÛ\nÛÛÛ °ßÛ\nÛÛßÜ Ü²ß\nÛÛÛÝ Ü þß°\nÛ ß Ü RELEASE NOTES ßÜ\nÛÜÜß ÞÛÛÜ\nÛÛÛ ÛÛÛ\nÛÛÛ The Cossacks is the sixth major expansion for Europa Universalis IV and ÛÛÛ\nÛÛÛ focuses on Hordes and Eastern Europe. This addition allows you to ÛÛÛ\nÛÛÛ plunder your neighbours as a horde in order to keep your tribes loyal ÛÛÛ\nÛÛÛ and raze their lands to gain power to advance in technology or reform ÛÛÛ\nÛÛÛ into a settled nation. The internal politics of nations is brought to ÛÛÛ\nÛÛÛ life with the Estates, representing powerful interests such as the ÛÛÛ\nÛÛÛ Magnates of Poland-Lithuania and the eponymous Cossacks of the steppe. ÛÛÛ\nÛÛÛ More detailed control over the cultures and natives living in your ÛÛÛ\nÛÛÛ nation and the ability to work more closely with your AI allies and ÛÛÛ\nÛÛÛ understand their goals will let you bring out your inner Peter the ÛÛÛ\nÛÛÛ Great. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Features: ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Estates: Adds internal politics in your country, with power groupings ÛÛÛ\nÛÛÛ such as the Church, Nobility and Bourgeois fighting for control. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Diplomatic Feedback: Adds the ability to interact much more deeply ÛÛÛ\nÛÛÛ with the AI by setting your attitude and telling it what you want out ÛÛÛ\nÛÛÛ of wars. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Tengri: New religion mechanics focusing on Syncretism. Tengri have a ÛÛÛ\nÛÛÛ secondary religion that they fully tolerate, and can change this ÛÛÛ\nÛÛÛ secondary religion at will. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Horde Unity and Razing: Hordes must attack their neighbors to secure ÛÛÛ\nÛÛÛ plunder in order to keep the tribes happy, or risk a tribal uprising. ÛÛÛ\nÛÛÛ Hordes can raze territories they conquer to get monarch points and ÛÛÛ\nÛÛÛ raise horde unity. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Advanced Culture Change: Adds the ability to choose what culture you ÛÛÛ\nÛÛÛ want to convert a province to from any neighbouring culture, or ÛÛÛ\nÛÛÛ restore the original culture of the province. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Native Policies: Adds the ability to set your policy towards the ÛÛÛ\nÛÛÛ natives in your colonies, allowing you to focus on trade, assimilation, ÛÛÛ\nÛÛÛ or subjugation. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Improved Espionage: Two new spy actions allowing you to study the ÛÛÛ\nÛÛÛ technology of more advanced countries and agitate for liberty in your ÛÛÛ\nÛÛÛ enemies subjects. ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ NOTE: ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ This release is standalone and contains the following DLC: ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Europa Universalis IV: 100 Years War Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Horsemen of the Crescent Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Winged Hussars Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Star and Crescent DLC ÛÛÛ\nÛÛÛ Europa Universalis IV: American Dream DLC ÛÛÛ\nÛÛÛ Europa Universalis IV: Purple Phoenix ÛÛÛ\nÛÛÛ Europa Universalis IV: National Monuments ÛÛÛ\nÛÛÛ Europa Universalis IV: Conquest of Constantinople Music Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: National Monuments II ÛÛÛ\nÛÛÛ Europa Universalis IV: Conquest of Paradise ÛÛÛ\nÛÛÛ Europa Universalis IV: Conquistadors Unit pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Native Americans Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Songs of the New World ÛÛÛ\nÛÛÛ Europa Universalis IV: Songs of Yuletide ÛÛÛ\nÛÛÛ Europa Universalis IV: Native Americans II Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Colonial British and French Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Muslim Advisor Portraits ÛÛÛ\nÛÛÛ Europa Universalis IV: Wealth of Nations ÛÛÛ\nÛÛÛ Europa Universalis IV: Muslim Ships Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Trade Nations Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Res Publica ÛÛÛ\nÛÛÛ Europa Universalis IV: Anthology of Alternate History ÛÛÛ\nÛÛÛ Europa Universalis IV: Indian Subcontinent Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Indian Ships Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Wealth of Nations E-book ÛÛÛ\nÛÛÛ Europa Universalis IV: Republican Music Pack (Skopje Sessions) ÛÛÛ\nÛÛÛ Europa Universalis IV: Art of War ÛÛÛ\nÛÛÛ Europa Universalis IV: Evangelical Union Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Catholic League Unit Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Songs of War Music Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Guns, Drums and Steel Music Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Art of War Ebook ÛÛÛ\nÛÛÛ Europa Universalis IV: El Dorado ÛÛÛ\nÛÛÛ Europa Universalis IV: El Dorado Content Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Guns, Drums and Steel Volume 2 ÛÛÛ\nÛÛÛ Europa Universalis IV: Common Sense E-Book ÛÛÛ\nÛÛÛ Europa Universalis IV: Common Sense Content Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: Sounds from the community - Kairis Soundtrack ÛÛÛ\nÛÛÛ Europa Universalis IV: Common Sense ÛÛÛ\nÛÛÛ Europa Universalis IV: Sabaton Soundtrack ÛÛÛ\nÛÛÛ Europa Universalis IV: Tribal Cooking Simulator Blue ÛÛÛ\nÛÛÛ Europa Universalis IV: The Cossacks Content Pack ÛÛÛ\nÛÛÛ Europa Universalis IV: The Cossacks ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ NOTE 2: ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ If you previously have played demo or full game edition of Europa ÛÛÛ\nÛÛÛ Universalis IV, and/or want to change language - then delete ÛÛÛ\nÛÛÛ settings.txt from this folder: ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ Users\\User\\Documents\\Paradox Interactive\\Europa Universalis IV\\ ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ ÜÜÜÛÛßÛ\nÛÛÛ ÜÜ ß ÜÜÜÛßÛÜ²ÛßÛÛÛ\nÛÛÜÛß Ü þ ß ÜÜÜÜÛßßßßÜÜÛÛßß ÜÛÛßÛ\nÛÛßÜß ÜÜÜÜÛßßßß ÜÜÜ²²ßßß ÜÜÛß ÜÛ²ß\nßÛÛÝ Ü ÜÜÜÜÜ²²ßßßß ° ÜÜÜÛßßß ÜÜÜ²²ßß ÜÜßß°\nß Ü INSTALL NOTES ß²ß ÜÜÜÛßßßß ° ÜÜ²ßßß ÜÜ ßßß ° ß Ü\nÜÜÛß Üþ ßß Ü ß Ü²Ü ÛÛÜ\nÛÛÛÝ þß ß Ü ÛÛÛ\nÛÛÛ ÛÛÛ\nÛÛÛ 1. Unpack the release ÛÛÛ\nÛÛÛ 2. Mount or burn image ÛÛÛ\nÛÛÛ 3. Install ÛÛÛ\nÛÛÛ 4. Copy everything from the SKIDROW folder into the game installation ÛÛÛ\nÛÛÛ 5. Block the game in your firewall and mark our cracked content as ÛÛÛ\nÛÛÛ secure/trusted in your antivirus program ÛÛÛ\nÛÛÛ 6. Play the game ÛÛÛ\nÛÛÛ 7. Support the companies, which software you actually enjoy! ÛÛÛ\nÛÛÛ ÛÛÛ",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/EUIV.torrent",
			"added": 1459806244
		},
		{
			"topic_id": 5,
			"category": "movies",
			"title": "Age Of Empire III Collection MULTI5PROPHET",
			"torrent_imdb": "",
			"body": "Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The Mac version was ported over and developed and published by Destineer's MacSoft Games. The PC version was released on October 18, 2005 in North America and November 4, 2005 in Europe, while the Mac version was released on November 21, 2006 in North America and September 29, 2006 in Europe. An N-Gage version of the game developed by Glu Mobile was released on April 28, 2009. It is the third game of the Age of Empires series and the sequel to Age of Empires II: The Age of Kings.\n\nThe game portrays the European colonization of the Americas, between approximately 1492 and 1850 AD. There are eight European civilizations to play within the game. Age of Empires III has made several innovations in the series, in particular with the addition of the \"Home City\", which combines real-time strategy and role-playing game features. Two expansion packs have been released: the first, Age of Empires III: The WarChiefs, was released on October 17, 2006, and introduced three Native American civilizations and expanded the timeline to 1876; the second, Age of Empires III: The Asian Dynasties, was released on October 23, 2007, and included three Asian civilizations. Age of Empires III: The Napoleonic Era is an unofficial mod released in 2006 and has an active community that is still adding additional functionality to the game as of 2015.\n\n\nInstall\n\n1.-Open Winrar\n2.-Select 001 file\n3.-Open with winrar by double clicking\n4.-Extract its contents\n5.-Mount ISO and install\n6.-Enjoy\n\nExpansions\n\n-The Warchiefs\n-Asian Dynasties\n-Base game",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/Age.of.Empires.III.Complete.Collection.MULTi5-PROPHET.torrent",
			"added": 1459807535
		},
		{
			"topic_id": 6,
			"category": "movies",
			"title": "Libros Informatica (Español) (Spanish)",
			"torrent_imdb": "",
			"body": "Android,HMTL5,C,ROBOTICA etc",
			"magnet": "",
			"torrent_file": "data/users/16Rzxa6VPukdeqEzS94kTgUAB9mBLQheLd/Libros Informatica.rar.torrent",
			"added": 1459810549
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}