{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1583880411,
			"title": "Communism = Juden = Talmud",
			"body": "Communism  is juden killing machine. \n\nDaily reminder.",
			"added": 1583880410
		}
	],
	"topic_vote": {
		"1583880411_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1571697285_1koSUG26DkPTFK23zE8JNnpeVQsCuPJhr": [
			{
				"comment_id": 1,
				"body": "- it's not USA vs IRAN it's jews vs iran \n- future of manking is in SYRIA. With russia entering in 2015, they stopped country takeover by jewsrael, so jews can't create great israel. Without this place they can't take kikes from Europe to safe space so jews must slow down with neggers and arabs transportation to Europe and destroying Europe with race mixing. Jews of course made a back-up plan - Ukraine 2014 when jewish junta (the same revolution just like 1917 in russia) takeover Ukraine country - ex Khazar empire\n- Trump works for jewish international communist goverment, not for USA. \n- there is no muslim invasion in Europe. Jews simply  transport these subhumans to EU, biggest jews company for doing this is Israaid. And many others of course. Whole EU is jews soviet russia totalitarian state 2.0. Nothing else.",
				"added": 1571812939
			}
		],
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": [
			{
				"comment_id": 2,
				"body": "gametangia - You really believe there is a single mainstream TV in the world for goyim which tell the thruth or showing reality? Read the fucking protocols of kikes, I think media is protocol number twelve.",
				"added": 1572117024
			},
			{
				"comment_id": 3,
				"body": "h3bhkj5gqz4n3pjm  how is weather in tel aviv? I didn t say anything what you write. The reality - now - is strictly acording kikes talmud/protocols. And it start with kike mothefucker from french, who dreamed how he bring the world to devils tong or some shit like that and he rewrite talmud in socieconomic way - socialism.\n\nAfter french revolution they destroy every nation on planet. \n\nThats current reality. And the snake starting bite his own tail in USA.",
				"added": 1572119772
			},
			{
				"comment_id": 4,
				"body": "h3bhkj5gqz4n3pjm The global communist system with kikes god chosen people in charge printing money from air and enslave goyim  through debt is reality. \n\n- you can kill goyim\n- you can rob goyim\n- you can lie to goyim\n-- you must enslave goyim\n\nThat's whole concept how world works.",
				"added": 1572121382
			}
		],
		"1572513197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "Cure already exist, 9 mm. It's cheap and reliable.\n\nkike's talmud and muslim's koran are supporting paedophilia,  what kind of coincidence",
				"added": 1572536820
			}
		],
		"1572747647_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 6,
				"body": "Current Affairs is jew crap (founder god chosen Nathan J. Robinson). \n\nFrom wiki:\n\nCurrent Affairs is an American bimonthly magazine that discusses political and cultural topics from a progressive worldview.[\n\nThat's a lie, typical jewish Baba Kamma 113a. \n\nCurrent Affairs is an jew's bimonthly magazine that spread judeo-bolshevik propaganda.\nWiki:\n\nThe magazine has been praised by influential figures including Noam Chomsky and Glenn Greenwald.\n\nNoam Chomsky: ashkenazi Jew\nGlenn Greenwald: homo jew\n\nYou can buy nice \"Socialism is cool\" poster for 20 bucks with jew Moses Levy Mordecai (Karl Marx) in their koshershop.",
				"added": 1572778534
			}
		],
		"1583203227_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 7,
				"body": "> [hagen](#comment_5_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX): You're on Zeronet but you think decentralisation is bad?\n\nZeronet is not decentralised platform until it get DHT instead torrent trackers and decentralised username provider.",
				"added": 1583303805
			}
		],
		"1583235865_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 8,
				"body": "> [mmmb](#comment_10_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy): let's see if you still laugh when it keeps coming back mutated every year ;)\n\nCan't be worse then transition of attention whore fags like you from reddit to zerotalk.",
				"added": 1583333151
			}
		],
		"1583563665_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 9,
				"body": "Jews judenswineholorollercoasteritwasinmymindhoax is biggest hoax.",
				"added": 1583601063
			}
		]
	},
	"comment_vote": {
		"16_1NcurpanUoXCULWJdFWMQ63RUcHeGp2vuA": 1,
		"174_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"26_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1
	}
}