{
	"next_topic_id": 41,
	"topic": [
		{
			"topic_id": 1549178487,
			"title": "Vote in my new ZeroPoll! AMD or Nvidia?",
			"body": "http://127.0.0.1:43110/ZeroPolls.bit/?Poll:1-1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"added": 1549178486
		},
		{
			"topic_id": 1553642587,
			"title": "The Lightbulb Conspiracy - Planned Obsolescence",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1553642345_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nDid you know that the lifetime of light bulbs have been reduced on purpose to just 1000 hours?\nOr that your printer may 'break' after a  predefined number of printed pages determined by an electronic counter?\nOr that Apple batteries lasted only 18 months which meant that you had to throw away your iPods and buy another?\nWhat about Dupont stockings that were strong enough to tow a car, before they went back to design a stocking that would wear out more quickly!\n\nHave you ever heard the phrase '...They don't make them like they used to' or have you ever wondered why an item fails as soon as the warranty expires or maybe just finished making payments on your car when the mechanic tells you it's time to buy a new one as it's beyond economical repair.\n\nThey say we live in a 'thow-away' society, just look at what turns up in Ghana labelled as '2nd-hand-goods' to get around dumping regulations.\n\n...oh, and see if you can guess how long a lightbulb in a Californian fire-station has been burning for, 1 year? ...5 years? ...10 years?  ...watch and see!\n\nThis documentary from Norway now released under creative commons licensing was originally called 'The Pyramid of Waste - The lightbulb conspiracy' sheds some light (sorry!) on the designed lifespan of products.\n..I just hope they don't have an equivalent program for people ...or do they? -i'll leave that one for the conspiracy theorists.",
			"added": 1553642585
		},
		{
			"topic_id": 1553803052,
			"title": "The EU and The Road to The Nanny State(Article 13, Article 11)",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1553802900_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"added": 1553803049
		},
		{
			"topic_id": 1557602071,
			"title": "The Fate Of Empires",
			"body": "The Fate Of Empires PDF + Video: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj/1557600074-The_fate_of_empires.zip\n\nBitChute video(clearnet): https://www.bitchute.com/video/PNWXhH9Q0g8/\nPDF(clearnet): http://people.uncw.edu/kozloffm/glubb.pdf",
			"added": 1557602066
		},
		{
			"topic_id": 1559258606,
			"title": "Everyone’s mad about Google blocking ad blockers in Chrome. Here’s why",
			"body": "https://www.digitaltrends.com/computing/google-blocks-adblockers-in-chrome-and-everyone-is-mad/\n> An ad-free web browsing experience may only be available to those willing to pay for it.\n\nAt least, that appears to be the future waiting for Google Chrome. In a recent update, Google has moved to hamper Chrome’s ad-blocking capabilities, while also announcing that the deprecation of that feature will not apply to Google’s paid G Suite Enterprise subscribers.\n\nIt’s an understandable decision for a company built on ad money. But, is it the right one?\n\nBLOCKING THE BLOCKERS\nChrome users and the developers of Chrome-friendly, ad-blocker extensions are unhappy about Google’s proposed changes to the Chrome Extensions platform. Their reasons for outrage are compelling.\n\nThe controversy began when Google announced Manifest V3, which was essentially a set of proposed changes to Google Chrome’s Extensions platform. A Google Doc outlining all of these proposed changes was made public late last year. (It was last updated November 18, 2018.)\n\nIn the document, specific changes to Chrome’s “webRequest” API were proposed with the intent “to limit the blocking version of webRequest, potentially removing blocking options from most events (making them observational only).” The proposal went on to advise that content blockers (read: ad blockers) should instead use a different API known as “declarativeNetRequest”, saying that this new API is “more performant and offers better privacy guarantees to users.”\n\nBut according to Engadget, Google’s Manifest V3 changes not only prevent Chrome’s ad-blocker extensions from using the webRequest API as it normally would to block ads, it also forces them to use a new API (declarativeNetRequest) that isn’t compatible with how the extensions function, “rendering them ineffective.” Google may not have officially stated that they were blocking ad blockers in Chrome, but it’s clear that these changes aren’t supportive of ad blockers either.\n\nAnd further confirmation of the proposed changes by a Google staffer didn’t do anything to quell matters either. A Google Groups forum post was published by a staffer named Simeon Vincent on May 24. Within the lengthy post, Vincent confirmed that “Chrome is deprecating the blocking capabilities of the webRequest API in Manifest V3.” But in that same paragraph, a startling detail was dropped regarding content blocking and Enterprise Chrome users as Vincent mentioned that “blocking will still be available to enterprise deployments.”\n\nWhich means, as of last week, Google is still planning on blocking ad blockers in Chrome, but only for people who aren’t subscribed to their G Suite Enterprise-level of services.\n\nPAY TO PLAY\nThis exception for Enterprise payers isn’t a minor detail. Previously, Chrome could be an ad-free browsing experience for no cost. These proposed changes would mean that in order to keep having that experience, they would not only have to subscribe to premium G Suite services, but also subscribe to the highest, most expensive version of that service. Enterprise. And it’s not a small jump in price to go from being a free Chrome user to Enterprise. An Enterprise G Suite subscription is $25 per user, per month. That’s a huge leap in pricing just to have an ad-free experience.\n\nAs Engadget notes, it’s understandable why Google would want to do this since it would probably increase the amount of revenue generated from users viewing ads if non-Enterprise subscribing users were forced to deal with ads in the first place. According to a recent study, as many as 40 percent of people browsing the web from laptops use an ad blocker. That’s a large group of people that aren’t seeing Google’s ads.\n\nBut it still doesn’t seem like a good idea overall, considering that Chrome isn’t the only browser in town. It has competitors (like Microsoft Edge and Firefox) who are still willing to support ad blockers. Jumping up to Enterprise for an ad-free experience isn’t an easy sell.\n\nGoogle’s Enterprise ad-blocking exception doesn’t seem to include G Suite’s low and mid-tier subscribers. G Suite Basic is $6 dollars per user per month and G Suite Business is $12 per user month. With the Enterprise exception, it looks like Google is not only alienating its free Chrome users but also two segments of its paying users as well.\n\nIf all this turns out to be true, Google will be banking a lot on the loyalty of its Chrome users. If it’s wrong, it’ll not only lose users to competitor browsers, but it won’t get that ad revenue it’s chasing in the long run anyways.",
			"added": 1559258600
		},
		{
			"topic_id": 1559759030,
			"title": "(Rambling) The arguments of the pro-censorship groups are really funny.",
			"body": "You have these groups that complain about \"hateful\" content on certain sites. When the people who get censored complain, they say \"make your own site\". Then what happens? The same pro-censorship group tries to shutdown the competitors website. You even have the MSM censoring videos of Julian Assange and the truth behind it all.  I always wondered, why do these groups think censorship works? Havent people learned from history that it does not work? What is their(the pro-censorship authoritarians) end game? Total internet control?\n\nMy theory is that vast majority of people will not even notice the censorship, and eat up the propaganda.",
			"added": 1559759023
		},
		{
			"topic_id": 1560020808,
			"title": "Why dosen't ZeroNet move over to DHT from trackers?",
			"body": "DHT gets rid of the middle man of needing servers with trackers. Is there any reason for this? Or at least have them coexist?",
			"added": 1560020800
		},
		{
			"topic_id": 1560049831,
			"title": "(Video) Media Outlets Escalate WAR On Youtubers, Smear Philip Defranco As Far Right",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1560049156_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nBitChute: https://www.bitchute.com/video/ZtYle7Rqn0Q/\n\nMagnet:\n>magnet:?xt=urn:btih:3feb8e6d366621d1dadc89f6963851220ea324e2&dn=ZtYle7Rqn0Q.mp4&tr=udp://explodie.org:6969&tr=udp://tracker.coppersurfer.tk:6969&tr=udp://tracker.empire-js.us:1337&tr=udp://tracker.leechers-paradise.org:6969&tr=udp://tracker.opentrackr.org:1337&tr=wss://tracker.openwebtorrent.com&as=https://seed12.bitchute.com/ldVrtT5BwSJ0/ZtYle7Rqn0Q.mp4&as=https://seed13.bitchute.com/ldVrtT5BwSJ0/ZtYle7Rqn0Q.mp4&as=https://seed14.bitchute.com/ldVrtT5BwSJ0/ZtYle7Rqn0Q.mp4&xs=https://www.bitchute.com/torrent/ldVrtT5BwSJ0/ZtYle7Rqn0Q.webtorrent\n\nPastebin of Magnet: https://pastebin.com/gH8uUFwZ\n\n\"Media Outlets Escalate WAR On Youtubers, Smear Philip Defranco. The war on youtube has been dramatically escalating in the past few weeks with Philip DeFranco getting the latest hit. So far we have seen the #VoxAdpocalypse as the biggest force in taking down small and independent creators but we also saw CNET write a hit piece on gaming channels resulting in a loss of advertisers.\n\nNow the latest story insinuates that Phil Defranco is \"far right\" and was part of a path to being made radical. However the story is mostly nonsense and their subject claims only to be a conservative.\n\nWhy then include Phil Defranco? In my opinion, so that far left and social justice activists can imply that Phil is a part of or associated with the far right. Even if it wasn't intended to escalate they already have implied that Phil is far right even though I'm sure that the subject of the NYT story watched The Young Turks or other large Youtubers. For Vox's Carlos Maza with Steven Crowder it was easy, he said naughty words, but Phil is a rather neutral commentator so whether intentional or not this could lay seeds for future activists to make claims about Phil and his politics.\n\nThe past few weeks should make it clear that there is an effort to destabilize youtube and target our channels and businesses.\"",
			"added": 1560049822
		},
		{
			"topic_id": 1560368932,
			"title": "(Video) The Kochs and Soros Both Agree: The Internet Must be Censored",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1560368767_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nBitChute: https://www.bitchute.com/video/H6sVvaPSwN8/\n\nMagnet:\n> magnet:?xt=urn:btih:0a423d523d29d63fc1162fe54a2976797eba89ce&dn=H6sVvaPSwN8.mp4&tr=udp://explodie.org:6969&tr=udp://tracker.coppersurfer.tk:6969&tr=udp://tracker.empire-js.us:1337&tr=udp://tracker.leechers-paradise.org:6969&tr=udp://tracker.opentrackr.org:1337&tr=wss://tracker.openwebtorrent.com&as=https://seed15.bitchute.com/Styxhexenham/H6sVvaPSwN8.mp4&as=https://seed13.bitchute.com/Styxhexenham/H6sVvaPSwN8.mp4&as=https://seed14.bitchute.com/Styxhexenham/H6sVvaPSwN8.mp4&xs=https://www.bitchute.com/torrent/Styxhexenham/H6sVvaPSwN8.webtorrent\n\nPastebin of Magnet: https://pastebin.com/AH26KwZD\n\nArticle link: http://archive.is/QmUeg\n\nArticle:\n\n# Koch Brothers Team Up With George Soros, Patreon and Airbnb to Fight Online Extremism\n\n\"The Koch Brothers are teaming up with tech companies, universities and other fellow billionaires to combat online extremism.\nOn July 17, the After Charlottesville Project will host its second summit in San Francisco, California. Founded in the aftermath of the deadly 2017 white supremacist attacks in Virginia, the conference brings together political and business leaders to discuss solutions for curbing political terrorism. While last year’s gathering in Missouri involved grassroots and city response initiatives, the focus of this year’s summit will involve the “private tech sector” and “best practices on the fight against hate and extremism online,” according to the event’s press release.\nRepresentatives for the Charles Koch Institute and the Anti-Defamation League will join executives from tech companies which currently include Eventbrite, Mozilla, Pinterest, Patreon and Airbnb.\n“Now more than ever is the time to create communities that value diversity, inclusivity and positive change,” Michael Signer, the former mayor of Charlottesville, Virginia and the founder and chair of the Communities Overcoming Extremism Project, said in a statement. “We’re excited to assemble with these forward-thinking tech leaders to explore what positive outcomes we can gain from an event full of powerful conversations.”\nThis past year, tech companies have cracked down on online extremism, often with mixed success. Last week, Vox reporter Carlos Maza accused Google’s YouTube of enabling harassment on its platform by allowing conservative media star Steven Crowder to insult him as a “lispy queer” to his 3.8 million followers. The campaign resulted in YouTube deciding to demonetize Crowder’s YouTube videos, though many progressive activists believed the company should have removed his page altogether.\nThe After Charlottesville Project is sponsored by Comcast NBCUniversal, the Kresge Foundation and the Soros Fund Charitable Foundation.\"",
			"added": 1560368922
		},
		{
			"topic_id": 1560456511,
			"title": "(Video on free speech) Social Rot of VICTIMHOOD & Microaggression Culture",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1560456305_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nBitChute: https://www.bitchute.com/video/uDQaerd0KZ0/\n\nMagnet link:\n> magnet:?xt=urn:btih:e394d68b38d6b68f9ee6efeda4a5363b228450c5&dn=uDQaerd0KZ0.mp4&tr=udp://explodie.org:6969&tr=udp://tracker.coppersurfer.tk:6969&tr=udp://tracker.empire-js.us:1337&tr=udp://tracker.leechers-paradise.org:6969&tr=udp://tracker.opentrackr.org:1337&tr=wss://tracker.openwebtorrent.com&as=https://seed15.bitchute.com/yqVw2kOQK4Jl/uDQaerd0KZ0.mp4&as=https://seed13.bitchute.com/yqVw2kOQK4Jl/uDQaerd0KZ0.mp4&as=https://seed14.bitchute.com/yqVw2kOQK4Jl/uDQaerd0KZ0.mp4&as=https://seed12.bitchute.com/yqVw2kOQK4Jl/uDQaerd0KZ0.mp4&xs=https://www.bitchute.com/torrent/yqVw2kOQK4Jl/uDQaerd0KZ0.webtorrent",
			"added": 1560456500
		},
		{
			"topic_id": 1563945520,
			"title": "US attorney general says encryption creates security risk",
			"body": "https://apnews.com/7423e1ef65a144e6a47e4da63683b3c1\n\n#Article:\n NEW YORK (AP) — Attorney General William Barr said Tuesday that increased encryption of data on phones and computers and encrypted messaging apps are putting American security at risk.\n\nBarr’s comments at a cybersecurity conference mark a continuing effort by the Justice Department to push tech companies to provide law enforcement with access to encrypted devices and applications during investigations.\n\n“There have been enough dogmatic pronouncements that lawful access simply cannot be done,” Barr said. “It can be, and it must be.”\n\nThe attorney general said law enforcement is increasingly unable to access information on devices, and between devices, even with a warrant supporting probable cause of criminal activity.\n\nBarr said terrorists and cartels switch mid-communication to encrypted applications to plan deadly operations. He described a transnational drug cartel’s use of WhatsApp group chat to specifically coordinate murders of Mexico-based police officials.\n\nGail Kent, Facebook’s global public policy lead on security, recently said that allowing the government’s ability to gain access to encrypted communications would jeopardize cybersecurity for millions of law-abiding people who rely on it. WhatsApp is owned by Facebook.\n\n“It’s impossible to create any backdoor that couldn’t be discovered, and exploited, by bad actors,” Kent said.\n\nAllowing government access to encrypted devices also wouldn’t prevent people from switching to any new services that may crop up around the world that U.S. agencies can’t access, Kent said.\n\nEncrypted communications are ones that are only available to users on either end of the communications. The increasing use of this technology has long been coined by the Justice Department as the “going dark” problem .\n\nBarr’s remarks also acknowledged the need for encryption to ensure overall cybersecurity that has enabled people to bank relatively securely online and engage in e-commerce.\n\nBarr said that to date, law enforcement in Garland, Texas, have been unable to access 100 instant messages sent between terrorists who carried out an attack there in May 2015.\n\n“The status quo is exceptionally dangerous, it is unacceptable and only getting worse,” Barr said. “It’s time for the United States to stop debating whether to address it and start talking about how to address it.”\n\nEx-FBI director James Comey championed the need for a law enforcement workaround to encrypted devices and communications. He led a highly publicized push to gain access to an iPhone belonging to a perpetrator of a terrorist attack in San Bernardino, California, that killed 14 people in 2015.\n\nFrom the Senate floor on Tuesday, Sen. Ron Wyden, D-Ore., responded to Barr’s remarks in New York calling it an “outrageous, wrongheaded and dangerous proposal.”\n\nWyden said Barr wants to “blow a hole” in a critical security feature for Americans’ digital lives by trying to undermine strong encryption and advocating for government backdoors into the personal devices of Americans. He said strong encryption helps keep health records, personal communications and other sensitive data secure from hackers.\n\nEffectively banning encryption in the U.S. by not allowing companies to provide unbreakable encryption, doesn’t prevent it existing and flourishing elsewhere, and only makes Americans less secure against foreign hackers, Wyden said.\n\n“Once you weaken encryption with a backdoor, you make it far easier for criminals, hackers and predators to get into your digital life,” Wyden said. He said he fears and expects that Barr and President Donald Trump would abuse the power to break encryption if they were allowed to do so.\n\nGiven their records “it is clear to me that they cannot be trusted with this kind of power,” Wyden said.\n\nNoah Theran, a spokesman for the Internet Association, said “strong encryption makes us all safer and more secure” and protects Americans from daily cyberattacks that can compromise personal information. The trade association represents internet companies — including Facebook, Google, Twitter and LinkedIn — on public policy.\n\n“Companies must not be required to engineer vulnerabilities into their products and services that could put us all at risk,” Theran said.\n\nCritics of the Justice Department position also point out that law enforcement agencies have been able to use unencrypted metadata to solve crimes and hired a private contractor to ultimately gain access to the iPhone linked to the San Bernardino attacks.\n\n“There is no way to give the FBI access to encrypted communications without giving the same access to every government on the planet,” said Brett Max Kaufman, senior staff attorney with the ACLU’s Center for Democracy.\n\n“Technology providers should continue to make their products as safe as possible and resist pressure from all governments to undermine the security of the tools they offer.”\n\n#My response:\nBarr is totally in the wrong here and this, ladies and gentlemen, is why we should not be complacent. Even the most free societies and governments could anytime take away your rights. This is why I tell people to keep innovating new technological ways to circumvent tyranny and censorship. You can have anybody go into power and one day do shit against you. This is why we need to be proactive not only on government level, but technological. Whenever our rights are not being threatened, people get complacent, and do not innovate as much. We need stronger ways of encryption and able to bypass government regulations. This will help everyone. The US founding fathers had fail safes for when the government becomes tyrannical. We need fail safes as well with technology.",
			"added": 1563945507
		},
		{
			"topic_id": 1565030629,
			"title": "Video - \"DEMANDS FOR CENSORSHIP ESCALATE FOLLOW EL PASO AND DAYTON, AUTHORITARIANISM IS THEIR ONLY SOLUTION\"",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1565031031_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nhttps://www.bitchute.com/video/zWllK66hgGo/\n\nMagnet:\n>magnet:?xt=urn:btih:36416c2d1e075cde7a30301dd473fbea710d87c6&dn=zWllK66hgGo.mp4&tr=udp://explodie.org:6969&tr=udp://tracker.coppersurfer.tk:6969&tr=udp://tracker.empire-js.us:1337&tr=udp://tracker.leechers-paradise.org:6969&tr=udp://tracker.opentrackr.org:1337&tr=wss://tracker.openwebtorrent.com&as=https://seed15.bitchute.com/FWuhWrsS3GRl/zWllK66hgGo.mp4&as=https://seed13.bitchute.com/FWuhWrsS3GRl/zWllK66hgGo.mp4&as=https://seed14.bitchute.com/FWuhWrsS3GRl/zWllK66hgGo.mp4&as=https://seed27.bitchute.com/FWuhWrsS3GRl/zWllK66hgGo.mp4&xs=https://www.bitchute.com/torrent/FWuhWrsS3GRl/zWllK66hgGo.webtorrent",
			"added": 1565030615
		},
		{
			"topic_id": 1565070314,
			"title": "UK, US, Australia, Canada and New Zealand meet to discuss the “ghost protocol” aka built in encryption backdoors",
			"body": "https://www.privateinternetaccess.com/blog/2019/08/uk-us-australia-canada-and-new-zealand-meet-to-discuss-the-ghost-protocol-aka-built-in-encryption-backdoors/\n\nRepresentatives from the UK, US, Australia, Canada, and New Zealand recently finished a two day meeting in London where the countries renewed their commitment to seeking encryption backdoors from technology companies around the world. The meetings were held by the UK’s Home Secretary, Priti Patel, and the official topics were strengthening the countries’ abilities to operate against terrorism and human sex trafficking. Both UK Attorney General Geoffrey Cox and the US Attorney General William Barr were present. That’s the same William Barr that promulgated last week that tech companies would just have to “accept” these government ordered encryption backdoors.\n\nGovernments want tech companies to build in encryption backdoors and “ghost protocol” functionality to their products. The plan to put encryption backdoors that allow law enforcement eavesdropping is called the ghost protocol by the GCHQ (the UK’s NSA).\nWhile the meeting’s official agenda and minutes are not available to the public, the UK Home Office didn’t leave much to the imagination in a statement saying:\n\n“We need to ensure that our law enforcement and security and intelligence agencies are able to gain lawful and exceptional access to the information they need.”\n\nThe GCHQ has specifically mentioned something called they’re calling the “ghost protocol,” which describes a fantasy scenario where police and other law enforcement officers could be surreptitiously added into supposedly encrypted group chats. Supposedly, applying a “ghost protocol” to WhatsApp was the main concern of the discussion.  Besides precluding a backdoor, a world where this happens is a world where the laws of mathematics are being ignored by governments. Something that Australian Prime Minister Turnbull has actually specifically called for.\n\nTech companies are adamant that encryption backdoors and ghost protocols, aren’t possible, and rightly so Tech companies continue to try and educate ignorant politicians that this is impossible to do securely, but the pleas fall seem to be falling on deaf ears. Private Internet Access continues to protest against government encroachment on tech companies and will never built in any encryption backdoors or ghost protocols. And we aren’t the only American tech company to be taking this hard stance. Apple, Google, WhatsApp, and a total of 47 other tech companies have signed a letter condemning this mere train of thought by governments.\n\nWhat’s truly concerning though, is that some tech companies such as Facebook in particular, are simultaneously developing ways to screen, filter, or otherwise algorithmically “deal” with encrypted messaging. In case you’re wondering, yes that does include decrypting the supposedly end to end encrypted messaging and destroying their messaging apps’ value proposition in its entirety.\n\nDespite this, the Five Eyes are trudging along in their quest against encryption\nThis meeting of the most powerful English speaking countries’ governments is a yearly occurrence known as the Five Eyes Summit and has been held since 2013 – with the last ones being held in Canada. In fact, the participating countries in these anti-encryption talks have been on this warpath for quite some time. Australia was the first Five Eyes country to pass an anti encryption law in late 2018.\n\nThe sooner the politicians in charge realize that they will unintentionally regulate the world into a more dangerous form of itself, the better. With the current path, governments will be lowering the efficacy of the encryption in every day devices and software that is used by the masses – making those popular apps vulnerable to decryption and attack by hackers by way of the exact same encryption backdoor that the government is asking companies to include. As Private Internet Access’s Derek Zimmer so concisely puts it: Government backdoors don’t work.\n\nTo put it in hip colloquialisms, the Five Eye countries need to ghost the idea of a ghost protocol and instead encourage strong encryption and provide the masses with the education on cryptography to make it effective.",
			"added": 1565070299
		},
		{
			"topic_id": 1565197761,
			"title": "The propaganda network against ZeroNet",
			"body": "If you go over the clearnet social media right now, you will see posts about how \"Tor is not anonymous\", as well as other stuff like how ZeroNet is a hub for \"evil darknet people\". The establishment must be in overdrive right now. Probably trying to stop decentralization.",
			"added": 1565197745
		},
		{
			"topic_id": 1565207629,
			"title": "Guilt by association",
			"body": "The establishment will use the media to tell the masses to say somebody is bad, by association. You see this happening with China with their social credit system. We also already see this with ZeroNet. \"If you use ZeroNet you also like CP.\" They use this guilt by association to control whoever they want. They make it so you get less friends, and then cannot spread any knowledge further about anything. This also makes it harder for you to get a job, bank account, anything else. Don't be fooled it.",
			"added": 1565207612
		},
		{
			"topic_id": 1565229380,
			"title": "\"The El Paso Shooting Revived the Free Speech Debate. Europe Has Limits.\" - NY Times advocates for anti-free speech and censorship",
			"body": "https://archive.fo/4NcDF#selection-251.0-251.71 Archive of the NY Times article.\n\n**Excerpt on censorship:**\n\nEuropean nations, and the European Union more broadly, have been more willing to regulate what is said over social media and other internet platforms that are mostly the creation and domain of powerful American tech companies.\n\nWorried that social media platforms were becoming a breeding ground for hate speech, Germany passed a law in 2017 that required companies operating social media platforms to remove illegal, racist or slanderous comments or posts within 24 hours of their appearance online. Violators faced fines of up to $57 million.\n\nHeiko Maas, Germany’s justice minister at the time the law was drafted, described it as “not a limitation, but a prerequisite for freedom of expression,” by ensuring that “everyone can express their opinion freely, without being insulted or threatened.”\n\nIn a broad policy speech earlier this year, the head of Germany’s domestic intelligence agency, Thomas Haldenwang, called for increased patrolling of digital communication, including social media. German law permits officials to search through data in the digital sphere in the face of certain threats, including domestic terrorism.\n\nPartly inspired by Germany’s social media hate speech law, France’s Parliament recently started debating a similar bill.\n\n“There is no reason that comments that would not be tolerated on a bus, in a cafe or in school — basically, in ‘real life’ — should be tolerated on a website or network,” Laetitia Avia, a member of France’s lower house of Parliament who is sponsoring the bill, said in June.\n",
			"added": 1565229362
		},
		{
			"topic_id": 1565287859,
			"title": "Video - \"CNN Makes Propaganda Hit Piece Against 4chan, 8chan\"",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1565287693_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nBitChute: https://www.bitchute.com/video/g_lVUAGPCy4/\n\nMagnet:\n> magnet:?xt=urn:btih:aead8428f8db01a92a201b982be3a825b09bf72b&dn=g_lVUAGPCy4.mp4&tr=udp://explodie.org:6969&tr=udp://tracker.coppersurfer.tk:6969&tr=udp://tracker.empire-js.us:1337&tr=udp://tracker.leechers-paradise.org:6969&tr=udp://tracker.opentrackr.org:1337&tr=wss://tracker.openwebtorrent.com&as=https://seed15.bitchute.com/Styxhexenham/g_lVUAGPCy4.mp4&as=https://seed13.bitchute.com/Styxhexenham/g_lVUAGPCy4.mp4&as=https://seed14.bitchute.com/Styxhexenham/g_lVUAGPCy4.mp4&as=https://seed27.bitchute.com/Styxhexenham/g_lVUAGPCy4.mp4&xs=https://www.bitchute.com/torrent/Styxhexenham/g_lVUAGPCy4.webtorrent",
			"added": 1565287840
		},
		{
			"topic_id": 1565330984,
			"title": "Video - \"Samsung removes headphone jack, takes down commercials mocking Apple for removing headphone jack\"",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1565330800_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"added": 1565330964
		},
		{
			"topic_id": 1565391114,
			"title": "Reddit praises deplatforming 8chan. One user says \"to doxx people all deplorable trolls\".",
			"body": "https://www.reddit.com/r/technology/comments/co490b/8chan_refugees_blow_their_anonymity/",
			"added": 1565391093
		},
		{
			"topic_id": 1565410872,
			"title": "Video - \"Walmart Has Done The Unthinkable To Video Games\"",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1565410616_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"added": 1565410850
		},
		{
			"topic_id": 1565411595,
			"title": "Video - \"10 Years of Gaming PCs: 2009 - 2014 (Part 1)\"",
			"body": "KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1565411495_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"added": 1565411572
		},
		{
			"topic_id": 1565459855,
			"title": "ZeroPrivacyTalk",
			"body": "ZeroTalk cloned by anglosaxon for privacy conversations. http://127.0.0.1:43110/16sMXQo6WghvMdzaRCco85kchKPknXZ4wY/",
			"added": 1565459829
		},
		{
			"topic_id": 1565552295,
			"title": "How to increase your number of trackers in ZeroNet",
			"body": "One of the main weak points in ZeroNet is trackers. If they go down, so does your seeding. Since we have yet to find a way to do DHT for peers, we need to up our number of trackers. Just go to Syncronite and follow the instructions: http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/ Copy the trackers in data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/Syncronite.txt and then put it in your configuration page after the default trackers. If you already have custom trackers, click the dot to reset it before putting the trackers in.",
			"added": 1565552265
		},
		{
			"topic_id": 1565642270,
			"title": "Content.json does not publish",
			"body": "My ZeroTalk clone does not publish the content.json to other peers to up the USED limit. Anybody know a fix?",
			"added": 1565642239
		},
		{
			"topic_id": 1565680565,
			"title": "[Solved]How do I make other peers get changes to content.json in a ZeroTalk clone?",
			"body": "Whenever I try to sign and publish, it seems no other peers get it. Every other file works fine, though. This issue makes it so people will not be able to do anymore posts in a ZeroTalk clone.",
			"added": 1565680533
		},
		{
			"topic_id": 1565682447,
			"title": "ZeroGamingTalk+ (With support for KaffieID, CryptoID, and KxoID that actually works)",
			"body": "http://127.0.0.1:43110/1J789oNvwoawy3xjfhfxEfvTeNk61JYf4Y/?Home \nTo double check, I even deleted it on my 2nd device and re-downloaded the site to make sure.",
			"added": 1565682414
		},
		{
			"topic_id": 1565721504,
			"title": "List of ID providers on ZeroNet",
			"body": "Anybody have a list of ID providers on ZeroNet?",
			"added": 1565721470
		},
		{
			"topic_id": 1565992631,
			"title": "ZeroChat Live+",
			"body": "http://127.0.0.1:43110/1FbZQrfoXk4JkbtnAjt1FiyKTTAoECug7r\n\nZeroChat Live cloned, but with support for KaffieID, KxoID, and CryptoID",
			"added": 1565992596
		},
		{
			"topic_id": 1565994004,
			"title": "ZeroSites+",
			"body": "http://127.0.0.1:43110/1NcCnWssDSyP7xja9rDMGrEwUWDdCSC9n2/\nZeroSites cloned, but with support for KaffieID, KxoID, and CryptoID",
			"added": 1565993968
		},
		{
			"topic_id": 1566240845,
			"title": "Nvidia Have WON! Customers Say YES To Inflated GPU Prices!",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1566240734_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj\n\nLooking at Nvidia's Q2 earnings show that PC Gamers actually APPROVE of the price hikes with the Geforce RTX lineup!",
			"added": 1566240808
		},
		{
			"topic_id": 1566425767,
			"title": "ZeroNet RSS Reader",
			"body": "One of the things that I like with the Dat project is the ability to do a RSS feed. Is it possible to implement this in ZeroNet?",
			"added": 1566425728
		},
		{
			"topic_id": 1575616132,
			"title": "Hello, it's been awhile",
			"body": "I haven't been here in months ever since the whole 8chan thing flooding ZeroNet. Has anything changed?",
			"added": 1575616092
		}
	],
	"topic_vote": {
		"1546990353_1HDmyQsAC4ngUqrGWjqAWbjYBzn2AGY3T": 1,
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": 1,
		"1546599493_1HXd2fNMxRYoanN7RXkF7orx4iywz4hqr1": 1,
		"1547226852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1547259882_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1547266872_1FwDqRAQggNDskwBo4ZLXPWC69tSajS4aX": 1,
		"1547351886_1FwDqRAQggNDskwBo4ZLXPWC69tSajS4aX": 1,
		"1547590466_16dA195gn9p2CL9LXgMYSWeHtp7zCBtqiw": 1,
		"1547736676_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1547924891_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1547971447_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1547816218_1EB2uyiLPp7UzAkgos8NJm8X5rS8jkfBQm": 1,
		"1548112623_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1548168093_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"1545280465_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1549178487_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": 1,
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1,
		"1552623438_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD": 1,
		"1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1553796164_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1553803052_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1516322022_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1555652637_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"1557602071_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": 1,
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"1558925765_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1559258606_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1559590587_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1559076722_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1558919260_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1558853136_1FQBuG1FKTEyYgwmGJmRCQ811mH2EjfBKp": 1,
		"1559567668_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": 1,
		"1559759030_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560049831_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"1560368932_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1560456511_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1563053899_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1562068614_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": 1,
		"1565030629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565120423_13r1hwu6tyYeZsWk48DQDqtq9AN5GWQXmo": 1,
		"1565143738_12Be1Sy2i9vZYp3Cusiqvy5NbhhCKZnEsX": 1,
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565164789_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": 1,
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1565232313_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1,
		"1565252472_1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u": 1,
		"1516098717_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"1565308255_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565131172_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1,
		"1565318502_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": 1,
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1565410872_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1565994004_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1574767629_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1575619462_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": 1,
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1575688284_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1575818739_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1576087205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1576243302_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 504,
	"comment": {
		"1547259882_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "It normally works for me. Probably not for your router.",
				"added": 1547263582
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_420_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Which brand and series do you have? This might influence my cable modem purchase next month. This Arris sucks.\n\nI just use the router FiOS gives me. It is the FiOS Quantum Gateway router and it is very good.",
				"added": 1547264387
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_421_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's no hidden brand emblem anywhere on it?\n\nNot that I know of. Here is the site of my router: https://www.verizon.com/home/accessories/fios-quantum-gateway/",
				"added": 1547264489
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_422_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Ahead of you there. LOL\n\nHave you tried a Netgear, Linksys, or ASUS router?",
				"added": 1547264894
			},
			{
				"comment_id": 6,
				"body": "Just find it odd that UPNP does not work for you, when for me and my friends from multiple routers it has...",
				"added": 1547264953
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_423_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm letting my mother and brother borrow my ASUS RT-AC5300. Their $25 Belkin was quite terrible.\n\nYeah, Belkin is horrible from my experience too. I agree it is terrible.",
				"added": 1547265337
			},
			{
				"comment_id": 9,
				"body": "Yeah, you can use what you know works if that is what you want.",
				"added": 1547265807
			}
		],
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 2,
				"body": "> [g35g](#comment_3_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD): It's not the quantity but the quality. With the exception of a few zites, they do not compare to the quality that you see on the clearnet. My point is only, there is still room to grow and still things to be done as a community. [...]\n\nThe vast majority of people will still use the Clear-net for awhile. I think we should first get more technical people on board who understands this stuff, before going mainstream. To go mainstream I think we need to really hit it popular and accessible.",
				"added": 1547264260
			}
		],
		"1547138341_1A1wfPToMyKh7vu5YTpEtNCbGBmD32DgDH": [
			{
				"comment_id": 7,
				"body": "Looks like it works for me.",
				"added": 1547265071
			}
		],
		"1547590466_16dA195gn9p2CL9LXgMYSWeHtp7zCBtqiw": [
			{
				"comment_id": 10,
				"body": "Beaker browser seems to have much more features than ZeroNet, but ZeroNet works across more browsers and systems, and thus has more of a community. ZeroNet also has more websites too. I rather ZeroNet since DAT protocol you need to either use Node.js or Beaker. Hopefully they extend it to not just a browser or ZeroNet implements its features.",
				"added": 1547591605
			},
			{
				"comment_id": 11,
				"body": "Another thing to realize is that it is backed by a big corporation called Mozilla, so it might become bigger and much better in the future than ZeroNet.",
				"added": 1547591687
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_437_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Where are all the good dat sites at? I'm struggling to find any. Have you made any?\n\nThere is not many. The only ones are through here: dat://explore.beakerbrowser.com/ https://hashbase.io/",
				"added": 1547600225
			},
			{
				"comment_id": 15,
				"body": "> [ssdifnskdjfnsdjk](#comment_642_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): It is like with PeerTube, you also have to have the tab with the video open in order to seed it. This caused i stopped being interested in PeerTube. ZeroNet works different and better way.When i written \"How to use dat:// protocol to share single file or folder between peers\" there was no Dat project tool that would allow easily seeding multiple sites. (like in a torrent client or in zeronet where site is added easily and everything happens in background with simple GUI)\n\nActually, Beaker Browser still seeds even when the tab is not open. Go to the top right > library > currently seeding. What you need to seed the page is to press the little share button next to the URL and it seeds as long as the browser is open. Screenshots: http://prntscr.com/m82obk http://prntscr.com/m82oid",
				"added": 1547662230
			}
		],
		"1547612410_1QGE1KUwdNLyE1oNpcvksRLV72K9BZ3ELa": [
			{
				"comment_id": 13,
				"body": "http://127.0.0.1:43110/kaffiene.bit/ If you want other sites, just go here: http://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1547619230
			}
		],
		"1547971447_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 17,
				"body": "Looks like I am not able to connect. What you can do to try to fix it is by making a new site. I had a problem with a content.json problem with a site I had, and I just coped it over and it worked. I tried looking up if I could fix the content.json file but I do not know how to do that other than coping it over to a new one.",
				"added": 1547972014
			}
		],
		"1548112623_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 18,
				"body": "Very cool program but as with everything that is very early, has some bugs. It does freeze occasionally. Probably due to all of the searching it does.",
				"added": 1548185248
			},
			{
				"comment_id": 19,
				"body": "> [erert45](#comment_3_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi): everything is working fine for me\n\nWorks fine for me vast majority of the time, just freezes if I search once in awhile while scrolling. I have a good PC too so its not bottle necking my PC. I know that you can increase the speed for scanning walk speed to use more CPU, might try that since my 1600X should handle it well.",
				"added": 1548188394
			},
			{
				"comment_id": 20,
				"body": "Increasing the scanner walk speed seem to have worked. Very fast and snappy now.",
				"added": 1548188791
			}
		],
		"1548825111_14uRvph7yp9ZaBRpJMJGZABwVu56N1AMwU": [
			{
				"comment_id": 21,
				"body": "As with anything that cannot be censored, people will use it for bad things. I doubt though that The Washington Post is doing this in good faith but doing this because they do not like ZeroNet in of itself. In my experience, these politicians and publications want control of these places and will use any excuse to do it. If it was not ZeroNet, they would of used something else though. This is with any illegal or harmful organization. You seen this with Silk Road or illegal movies with torrenting. The number one priority to fight radicalization will always be information and helping people. People that tend to be more radicalized are more likely to have troubles in their lives. 2nd way is to not accept people from those highly dangerous countries.\n\nFrom the developers of Riot: https://medium.com/@RiotChat/amber-rudds-two-cents-on-our-privacy-rights-are-national-security-and-digital-privacy-mutually-be601037b11b",
				"added": 1548828667
			},
			{
				"comment_id": 29,
				"body": "> [quantumworld](#comment_180_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): It's a main stream hit peace against Zeronet. There plan to take down p2p will fail.\n\nTheir plan is not to make p2p fail, but make it so less and less users visit. Some of them probably know the more on ZeroNet, the bigger it becomes. So how do you make people not visit? Call ZeroNet full of terrorists or pedophiles. Their plan is to make ZeroNet as niche as possible. What do you think YouTube censorship or school propaganda is? YouTube censorship is supposed to make the average person not notice the censorship. Also in school propaganda it is to make the average person that does not think outside of the box to just think what they tell them to. When YouTube censors, the YouTuber's viewership is less on BitChute because it has less of a audience. That is their game plan. The only way for it to not work is to make it so people know the censorship or propaganda is bullshit through other means. But, you be surprised at how effective propaganda can have even for years.\n\nAmazon is already expanding across the US to teach kids to use their cloud data centers. Companies are already teaching kids to rely on that ecosystem to give them money and low wages. So corporations also to a certain extent also have control over the future generations. Amazon is not doing this because of ZeroNet, but they do have certain control of the curriculum. Anytime, they can push propaganda.",
				"added": 1549095207
			}
		],
		"1545280465_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 22,
				"body": "> [leftside](#comment_511_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Major media's attack against ZeroNet began as I predicted : The Islamic State may have a new propaganda haven from Washington Post.\n\nI also saw this coming too. I told my friend that the media will go anti-decentralization(or pro centralization) propaganda.",
				"added": 1548872769
			}
		],
		"1549027708_155V1pDJWxxohR8eNgocGarkipstcSEARJ": [
			{
				"comment_id": 23,
				"body": "> [oncatcoaster](#comment_3_155V1pDJWxxohR8eNgocGarkipstcSEARJ): despite the fact that zeronet has no limitations, I would still like to make zeronet safe enough for normal people.\n\nWho determines what a naughty list is? What if people that take control of the \"naughty list\" then tries to do less traffic to zites they do not agree with? How about instead of a naughty list, we have something like maybe a review section for each zite so that users express if the site is dangerous or not.",
				"added": 1549052905
			}
		],
		"1549088626_1CxfctP1zfLgY5SPLXqDBQ4nFzx3HMcEcC": [
			{
				"comment_id": 24,
				"body": "The title \"jailbait\" already makes it seem like a troll. Well, muted anyways.",
				"added": 1549092861
			}
		],
		"1549087628_15qxwNQ94ep9jtmxa933ZqemC9QyQg4xUJ": [
			{
				"comment_id": 25,
				"body": "No, but you can back up the data folder sites if you really want to. It worked for me in the past when I wanted to access the sites faster than just re-downloading everything.",
				"added": 1549093000
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 27,
				"body": "ZeroNet I feel is still a little too immature to broaden it to the non technical knowledgeable people. If people do not like something, they will not come back. We need to get the people who will advance ZeroNet first on board then give a good first impression.",
				"added": 1549094863
			},
			{
				"comment_id": 28,
				"body": "> [quantumworld](#comment_43_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Zeronet looks like it would be perfect for News and news leakers. I have seen so many bloggers go down over the years and some even killed because of there news posting. Maybe I am wrong but decentralized news posting would kick ass. Plus whistle blowers would be more apt to leak.\n\nWhistle blowers have a option for WikiLeaks onion site to leak to anonymously already if you did not know.",
				"added": 1549095008
			},
			{
				"comment_id": 30,
				"body": "> [quantumworld](#comment_206_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Minds was interested in moving to Zeronet. One of the developers is working on a project that may include Zeronet.Some one here may know more about it than I do.\n\nThe creator of Minds is also considering DAT I heard in a interview. He is considering all possible decentralized options.",
				"added": 1549136406
			}
		],
		"1549178487_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 31,
				"body": "> [anotherneko](#comment_16_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Where is my intel?\n\nI was thinking of adding that, but decided not to since their dedicated GPU is not out yet. I did not want to involved integrated graphics here, but more gaming oriented.",
				"added": 1549189669
			}
		],
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": [
			{
				"comment_id": 32,
				"body": "T-Series sub's taking over pewdiepie will be a sad day for YouTube.",
				"added": 1549264891
			}
		],
		"1549416429_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 33,
				"body": "Clone it and do not make anybody access the site? Or find a way in the source code to break comments all together? ",
				"added": 1549417311
			}
		],
		"1549511316_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 34,
				"body": "http://novage.com.ua/p2p-media-loader/demo.html This is a example of using P2P livestreaming via webtorrent. GitHub: https://github.com/novage/p2p-media-loader",
				"added": 1549515826
			},
			{
				"comment_id": 35,
				"body": "> [quantumworld](#comment_221_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I used to like discord but then I got some info leaked out from a conversation I had with some one to some Intel agency. I stopped using discord for that reason. I am sure there is a better one out there that is not piped into the DOD for data collection and monitoring purposes.\n\nDiscord is used to sell information to Antifa and the like. Do not trust them. I use Matrix/Riot: https://matrix.org/blog/home/ http://riot.im\n\nUnofficial Matrix server list: https://www.hello-matrix.net/public_servers.php",
				"added": 1549516238
			},
			{
				"comment_id": 36,
				"body": "> [kaffie](#comment_740_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Eh... that's not quite what happened. But yes, naturally discord has it's political agenda and censors things. And has leaked information before. Not that matrix/riot is any better. Not really a suitable replacement tbh.\n\nMatrix/Riot uses decentralized servers that you can make and host. If you do not think that is better, then idk what to say to you. Discord also selling data has been proven. There is a reason why the Linux community prefers Matrix/Riot. I even use it for end to end encryption to talk with my friends.",
				"added": 1549517355
			},
			{
				"comment_id": 37,
				"body": "> [kaffie](#comment_742_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Matrix/Riot is federated, not decentralized. Each server is entirely centralized, but connect to other servers to share channels/rooms. And in terms of internet infrastructure it's entirely centralized. Not to say that discord is any better there, but I find federation to be.... not good. When you use a site it has a higher chance of going permanently down and you losing your account and access to the platform. Likewise mods are more likely to ban/suspend for petty reasons, rather than have an official mod team held to high standards. [...]\n\nYou know you do not need to connect to other servers, right? It allows for you to message other servers via federation, but you do not need to do that when you are hosting it. You also realize that you can register via different sources. http://i66.tinypic.com/wsqkhs.png You do not know how many times I re-registered when I wanted to try out a different server for less latency. The only thing that is centralized is the voice calls, but I use something else for that. Identity servers are used for the registration, which there are multiple different servers for.",
				"added": 1549518010
			},
			{
				"comment_id": 38,
				"body": "> [kaffie](#comment_743_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Saying \"it can be centralized instead of federated!\" isn't really a selling point lmao.  As for \"register via different sources\" eh..... not quite. You're thinking about using riot on a different webhost while still using the matrix server as your login. Which means the login is still centralized, you're just accessing a webclient hosted elsewhere. [...]\n\nIf you can make your own host, that means it has some form of decentralization. The internet when it was first made was made of different websites. Does that make the whole internet centralized? No. Sure ISPs control it in some form, but there were times where you can host your own website. decentralize - \"To distribute the administrative functions or powers of (a central authority) among several local authorities.\" Decentralization has roots to the French where it evolved into the United States for different states. What are you going to say? The US is entirely centralized? Lmfao. Mumble anyone can make a server, does that make it centralized with just one person? Sure its centralized on my server, but you can make your own. What is stopping you? I also been using it for years and been fine. If you want a proper understanding of decentralized, lookup Tim Berners-Lee and its roots to US government and the French. You also cannot say the login is centralized when I tried to login, it did not exist on another server.\n\nI have a challenge for you: Register here: https://www.poddery.com/ or https://chat.poddery.com/#/register And try to login with that here: https://matrix.tedomum.net/#/login",
				"added": 1549518484
			},
			{
				"comment_id": 39,
				"body": "> [kaffie](#comment_744_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I have a challenge for you: Register here: https://www.poddery.com/ or https://chat.poddery.com/#/register And try to login with that here: https://matrix.tedomum.net/#/login\n\nState governments fight the federal all the time. I go to another state and it has totally different laws.",
				"added": 1549519728
			},
			{
				"comment_id": 40,
				"body": "> [kaffie](#comment_745_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): If it's truly decentralized, let me register on my own computer, without touching a server. And then login on the site you mentioned. Deal?\n\nYeah.",
				"added": 1549519766
			},
			{
				"comment_id": 41,
				"body": "> [kaffie](#comment_746_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): So how do I go about doing that then? I'm at a loss.\n\nYou register here: https://poddery.com/ and login here https://chat.poddery.com/ 2nd server is: https://matrix.tedomum.net/#/login Poddery requires you to register via their site, tedomum does it via Riot's interface.",
				"added": 1549519953
			},
			{
				"comment_id": 42,
				"body": "> [kaffie](#comment_748_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I can't register on my own machine? Can I access the site without using a centralized IP address? At least that?\n\nI already told you to register on poddery.com and login via chat.poddery.com, for that server. 2nd one is below.",
				"added": 1549520364
			},
			{
				"comment_id": 43,
				"body": "> [kaffie](#comment_748_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I can't register on my own machine? Can I access the site without using a centralized IP address? At least that?\n\nhttps://poddery.com/users/sign_up If you really need a direct link. Login for 1st server: https://chat.poddery.com/#/home\n\nRegister AND login for 2nd server: https://matrix.tedomum.net/#/login",
				"added": 1549520409
			},
			{
				"comment_id": 44,
				"body": "> [kaffie](#comment_749_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Why must I use that site specifically with that specific domain name? I thought you said it was decentralized? Why can't I just register on my own computer without using their site? Since it's decentralized, I'd rather not put my private info on their server.\n\nIf you register on that site, it wont work on another. You keep making it seem like the same login works on all the others. You also do realize you can make up fake info, right? You seem like some sort of anarchist. I mean, I sure lean libertarian, but damn man.",
				"added": 1549520485
			},
			{
				"comment_id": 45,
				"body": "> [kaffie](#comment_750_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): So what you're saying is that in order to use the service I must register with a centralized authority?\n\nYou can register on ANY site. -_- If you are so afraid, make your own register server! Go ahead, and use Discord. Frankly, I do not care to talk to people who are crazy that wants no central authority to everything and chaos, and think the federal has complete power over state governments.",
				"added": 1549520623
			},
			{
				"comment_id": 46,
				"body": "> [kaffie](#comment_751_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Great. So how do I do that? Dl+run a piece of software, and then after running it/registering I can log in anywhere? I'd rather do that if possible. [...]\n\nZeroNet does have some chaotic elements like pedophiles and ISIS. You cannot deny that. The only reason I am for ZeroNet is due to corrupt politicians, and corporatism making the surface web unbearable. The deep web. Ever heard of it? Used for good and bad alike. P2P is used for movie torrenting. You cannot deny this. Here is the facts: in real life we need some form of government. Internet is a different story.",
				"added": 1549521049
			},
			{
				"comment_id": 47,
				"body": "> [kaffie](#comment_751_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Great. So how do I do that? Dl+run a piece of software, and then after running it/registering I can log in anywhere? I'd rather do that if possible. [...]\n\nGreat. So how do I do that? Just go to the matrix github on making your own server on Linux.",
				"added": 1549521087
			},
			{
				"comment_id": 48,
				"body": "> [quantumworld](#comment_224_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): So why isn't everyone a server of everyone? It would end up as a peer to peer grid but it would allow storage of web (Zite) content that would survive natural disasters. This p2p system has incredible amounts of better data usage structures than I have previously ever thought of before.\n\nI personally think ZeroNet has a lot of promises for chats, emails, etc. I just think that Matrix/Riot approach for now is fine for chatting via creating your own server until ZeroNet takes off more.",
				"added": 1549521543
			},
			{
				"comment_id": 49,
				"body": "> [kaffie](#comment_752_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Could you provide a walkthrough? I'm reading the github page and it's horribly confusing. [...]\n\nI do not make my own registration servers. Cant ask me\n\n> Exactly. ZeroNet is lovely. Federation is trash.\n\nI think federation personally is fine.\n\n\"Decentralisation or devolution can simply be defined as the transfer of part of the powers of the central government to regional or state authorities and it is in response to demands for diversity. In general decentralization or devolution is a response to the problems of centralized systems. It is seen as a solution to problems like economic decline, government inability to fund services and the demands of minorities for greater say in local governance. Decentralization or devolution of powers is linked to concepts of participation in decision-making, democracy, equality and liberty from high authority.\" Aka US is decentralized. https://www.myaccountingcourse.com/accounting-dictionary/decentralized-government",
				"added": 1549521673
			},
			{
				"comment_id": 50,
				"body": "> Why wouldn't you?\nMaybe because I use another server and im fine with it? It is also end to end encryption where it does not see my messages.\n\n>Yes, it's pretty clear you're okay with centralization and dislike decentralization.\nOr, maybe you are just a anarchist.",
				"added": 1549522110
			},
			{
				"comment_id": 51,
				"body": "> [quantumworld](#comment_226_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Those are two entirely different gui design systems. One is more integrated and user orientated the other is more web  based gui designs. (That will change..).\n\nI see what you mean.",
				"added": 1549522355
			},
			{
				"comment_id": 52,
				"body": "> [quantumworld](#comment_227_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have to say that the comment response time on zeronet that is p2p is just blowing my mind. Its fast..\n\nIt depends on the connection between peers, so I am not surprised when ZeroTalk has A LOT of peers to speed things up.",
				"added": 1549522501
			},
			{
				"comment_id": 53,
				"body": "> [kaffie](#comment_754_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Will you still be fine when the server goes down? [...]\n\n>Will you still be fine when the server goes down?\nI moved servers before. All I use it for is to talk to friends. I do not care. Plus, the servers I used do not go down for months on end and usually never go down.",
				"added": 1549522558
			},
			{
				"comment_id": 54,
				"body": ">Naturally. I take pride in that fact.\nWell, as a Consitutionalist/Libertarian, I do not.",
				"added": 1549522766
			},
			{
				"comment_id": 55,
				"body": "> [quantumworld](#comment_228_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Software anarchy is fine. But I am also a Consitutionalist. The two work well together when 90% of the free world is run by an out of control intelligence agency.\n\nYeah that is why I said before that the internet itself should be approached different. It is why I support ZeroNet. The real world and the internet are 2 different things. Just that I think being able to make your own servers itself is fine(since you have control) as well as ZeroNet, but prefer ZeroNet's approach.",
				"added": 1549523053
			},
			{
				"comment_id": 56,
				"body": "> [quantumworld](#comment_230_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I would sort of agree with you until I learned about lisp and then realized that we are all in an Emacs simulation program. I have never been the same since. lol\n\nLol. The argument for human existence might never be answered.",
				"added": 1549523292
			},
			{
				"comment_id": 57,
				"body": "> [quantumworld](#comment_231_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Lisp is program glue sludge structures of ever changing elements of definitions.\n\nI already heard all the explanations, you do not need to explain it.",
				"added": 1549523488
			}
		],
		"1549585526_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [],
		"1548210080_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 59,
				"body": "I have a Samsung SSD which have insane levels of longevity. So I leave my ZeroNet on SSD and barely any less life out of it. https://techreport.com/review/27909/the-ssd-endurance-experiment-theyre-all-dead \"The SSD Endurance Experiment represents the longest test TR has ever conducted. It's been a lot of work, but the results have also been gratifying. Over the past 18 months, we've watched modern SSDs easily write far more data than most consumers will ever need. Errors didn't strike the Samsung 840 Series until after 300TB of writes, and it took over 700TB to induce the first failures. The fact that the 840 Pro exceeded 2.4PB is nothing short of amazing, even if that achievement is also kind of academic.\"",
				"added": 1549599816
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 60,
				"body": "> [kaffie](#comment_810_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): They'd prefer censorship? [...]\n\nBitChute videos have a magnet link. You can use that to mirror videos. People can even use that to seed the main sites videos.",
				"added": 1552932609
			},
			{
				"comment_id": 74,
				"body": "> [quantumworld](#comment_340_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Omg, this may end up being a community thing where everyone gets a headache reading how to code html. It cant be as bad as learning lisp.\n\nIf you want ZeroNet to really be mainstream, there is going to be people who do not have the time to code or do not want to. There will always be people who are programmers. If ZeroNet also grows, there will be programmers who will jump on board due to the futuristic approach to this platform. http://Minds.com is one example of majority of majority of the user base not knowing how to code, yet is developing rapidly with tons of features, and will soon have a version on the DAT protocol.",
				"added": 1553882833
			},
			{
				"comment_id": 75,
				"body": "> [quantumworld](#comment_343_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Minds is good but it is not a full peer to peer platform. Many people here found out about zeronet on minds.com.  And I do like minds, however it has some problems that zeronet does not have.  We need everyone to talk about zeronet on every social media site. Zeronet will save the internet.\n\nMinds is moving to DAT and peer to peer solutions.",
				"added": 1553907566
			},
			{
				"comment_id": 78,
				"body": "> [quantumworld](#comment_344_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have heard this for a while now and there is some movement. My biggest problem with minds is that the content being posted is re circulated over and over and over. I have complained about it to the minds group no one seems to really care. Without that stupid bell notification drop down minds would be a dead stagnant platform. Also boosted content is counted for multiple times viewed. Have you ever seen the same boosted post 3 or 4 times? Well they are all counted in that boost.  I like minds but to me it is like a stale site of the same post over and over. Also to find new post content that is happening at the time of the request you need to search for it and click the latest button. A very cumbersome way to do it.  Minds needs allot of work. The more you use it the more you go WTF is this thing doing?I hope they can get things fixed but my issues with them gets slapped down by the top developers who like there site like that. Even though thousands of users have complained about the exact same issues.  It wont change until some one forks there project and makes it better.  [...]\n\nI use it extensively and see new content constantly. I did not know how the boosted view problem though.",
				"added": 1553910731
			},
			{
				"comment_id": 79,
				"body": "> [quantumworld](#comment_345_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): You need to use it for about 4 months or more to notice the post repeats. It may be a bug on there platform. Lots of people have complained about it. It is very annoying to see the same post four or five times pop up as a new post on the feed.  I have never seen that problem here on zeronet or on gab.\n\nI been using it for longer than that.",
				"added": 1553911842
			}
		],
		"1552875369_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 61,
				"body": "The concept of the \"free market\" assumes competition. For social media platforms, product quality is primarily a matter of the number of members you have. Almost nobody would join a Facebook competitor if they only knew 3 people on it. This is a clear example of what economists call \"network effects,\" which makes social media companies obvious natural monopolies. Not only that, but conservatives cannot make alternative platforms because of these Silicon Valley corporations also controlling the domain name hosting services. Then, when places like Gab get their own domain name hosting service, SPLC gets mad: https://www.splcenter.org/hatewatch/2019/01/11/problem-epik-proportions  It is simple, liberals want to shut off conservatives from the internet. The liberals use the mainstream media to push propaganda, and force companies to shut down alternative sites. That is anti-competitive, not free market. These same liberals that claim to be pro regulating corporations for the little people, then look a blind eye when it censors conservatives. A lot of conservatives are already calling for a Internet Bill of Rights for freedom of speech, if you have not been keeping up.",
				"added": 1552932917
			}
		],
		"1553179395_1GJAbXv4vLCwCBNNfNpiiExkhxKRd1Meqf": [
			{
				"comment_id": 63,
				"body": "You fucked up the moment you married. You gave her the gun to your head the moment you did. Women have all the power in the courts, and society will blame you.",
				"added": 1553186279
			},
			{
				"comment_id": 64,
				"body": "> [nathean](#comment_2_1LruaaESdiS4VB44xgLoaQ2HC17NATMrPT): Exactly.  [...]\n\nExactly. Society does not care about men. It is why I dropped out of high school, and got my GED because of females sexually bullying me everyday. The teachers were in on it too. Honestly, fuck dating. Women have way too much power nowadays.",
				"added": 1553198519
			},
			{
				"comment_id": 66,
				"body": "> [nathean](#comment_3_1LruaaESdiS4VB44xgLoaQ2HC17NATMrPT): I assume you are not married, which is good for you. Look at how many complications a woman brings into your life.The focus of MGTOW, or Man Going Their Own Way is to self actualize. Meaning you get to find what you are passionate about and allocate your time the way you see fit. MGTOW also means getting rid of female validation. You are a man because you have a purpose in your life and you do everything to fulfill it.  [...]\n\nI been a MGTOW for years now, I know what it is.",
				"added": 1553217905
			}
		],
		"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD": [
			{
				"comment_id": 65,
				"body": "Use a VPN on top of TOR. Plenty of people who use TOR for illegal means already do this.",
				"added": 1553198952
			}
		],
		"1553286882_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 67,
				"body": "> [quantumworld](#comment_306_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Good idea!  I need to create an account on github.  I am on Minds.com and I have been posting about zeronet there. I noticed that allot of people would log into zeronet and would not get back on. This may be related to that problem. The world is ripe for Zeronet. We just got to get the word out, and show people how to use it. Also how to use tor and zeronet together would be a great help as well.  I would love to see 1 million users on zeronet. Could be really fun.\n\nA lot of people try something, then leave if it is not something popular. But even if it is something popular, you cannot guarantee 100% retention.",
				"added": 1553315097
			}
		],
		"1553629147_1MkZQvQJrFXBXQ3x5UWQV52jhhi1jvxunC": [
			{
				"comment_id": 68,
				"body": "You need to put it as a exception in its proxy, since it looks like the browser you are mentioning is a version of Tor. I know in ZeroNet's FAQ there is a option to do that on the desktop: http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/\n\n\"How to use ZeroNet with the Tor browser?¶\nIn Tor mode it is recommended to use ZeroNet from within the Tor Browser:\n\n - Start the Tor Browser\n - Go to address \"about:preferences#advanced\"\n - Click Settings...\n - Enter 127.0.0.1 to field No proxy for\n - Open http://127.0.0.1:43110 in the browser\n\nIf you still see a blank page: - Click on NoScript's button (first on the toolbar) - Choose \"Temporary allow all this page\" - Reload the page\"",
				"added": 1553634774
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 69,
				"body": "> [xrpert](#comment_1_195bQwF94JT2ja1vt3DAGTwakyszotwdYq): Yes and i have just discovered the Zero Network because of that.\n\nWe need to spread the word of ZeroNet. The more peers, the stronger we become!",
				"added": 1553670080
			},
			{
				"comment_id": 71,
				"body": "(Wish I could post pictures here): http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj/1553798903",
				"added": 1553798955
			}
		],
		"1553706472_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 70,
				"body": "I mean, if you want, you can delete the users.json file and create a new ZeroID, but that would lose your old one.",
				"added": 1553731448
			}
		],
		"1553710396_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 72,
				"body": "You can also drag the top right zeronet logo to the left to see the number of peers on the current zite.",
				"added": 1553845039
			}
		],
		"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 73,
				"body": "> [satoxyn1](#comment_12_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): It's possible but with additional protection measures. For example, you can use client-side message encryption. All the data will be still available for everyone, but it's all encrypted and can't be read by third-party.\n\nThunderWave's chats I know that my friends messages would not popup on my PC local file storage. I cant actually delete it. I could only delete mine, no matter where I looked in the files. That was with a private chat, by the way. Public chats I could delete them locally, but private I could not.",
				"added": 1553845294
			}
		],
		"1553905331_1KinYupoFogGajrGGqNr6MmoR6fVJJnwqE": [
			{
				"comment_id": 76,
				"body": "You can try uploading videos to kopykate, as well as try to make a better search zite. You can also try to make a zite that grabs news from the clearnet that you can comment on(What im trying to test). Another, is helping advertise it for more peers, and to make places like kopykate bigger for anti-censorship. The last is to maybe make a meme zite so people can post their memes.",
				"added": 1553907986
			},
			{
				"comment_id": 77,
				"body": "> [kaffie](#comment_816_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's just like the web, but better. Make websites, post on forums, watch cat videos, listen to music, whatever. Whatever you do on the regular web, you can do here on ZeroNet.\n\nSome things on the clearnet is still better. Music is still better listening to on the clearnet. Due to peers sometimes not popping up at all.",
				"added": 1553908819
			}
		],
		"1552575038_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 81,
				"body": "> [sharermobile](#comment_1_1N9wxFKMTrnjPD3SV1JGC8c93mdS9hvSfC): @nickwa Again with this bullshit?\n\nIf you cannot handle dissenting opinions, either block me, or get off ZeroNet. I will not be the last to criticize your zite. Even just having the words \"please disable adblock\", will raise eyebrows from other people.",
				"added": 1554262019
			},
			{
				"comment_id": 83,
				"body": "> [krixano](#comment_717_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'll probably be blocking you.\n\nGo ahead, you are free to do so. Again, if you cannot handle the heat, get out of the kitchen.",
				"added": 1554264537
			}
		],
		"1554227095_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 82,
				"body": "Try to delete it from the HTML or JavaScript then publish? I know when I delete full files, it even deletes it on all other peers for zite's I tested.",
				"added": 1554262150
			}
		],
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": [
			{
				"comment_id": 86,
				"body": "ZeroNet, I dont know about its future. Nobody knows yet. Maybe something else will take its place, or ZeroNet will reign supreme. If you go outside of the main sites(ZeroMe, ZeroTalk, KopyKate), it will not be many users or just not used at all. So I think for ZeroNet to even flourish is for us to help promote it. Outside of that, you can do videos, blogs, forums, and chat. Right now, in my opinion, videos, blogs, and the forums are the best to use on ZeroNet right now.  I just hope some decentralized platform takes over, wether its ZeroNet, or another site.",
				"added": 1554267169
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 184,
				"body": "> [zagnut](#comment_4_1PEwg6PYQnsUL34EkvgnG2ckZ9PAYaixbb): l\n\nIt might stop since people are overreacting that the Zite isnt a \"real 8chan zite\" (Its just a clone). I personally don't care if people stop coming, since it will be just like before.",
				"added": 1565140699
			},
			{
				"comment_id": 359,
				"body": "> [caropc7](#comment_1_19siGLDKr3LtXdXo3VL14VwpcvKPr4mikx): nofish, please add suport the  KaffieID http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nThis. It works perfectly fine on my ZeroTalk clone. Should be possible here.",
				"added": 1565750790
			},
			{
				"comment_id": 360,
				"body": "> [crazylime](#comment_93_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): Added to my ZN Sec ZT, but Kiffie ID grey.  Fix?\n\nCreate another file in data/users/ and name it content2.json. Copy all the content.json stuff into content2.json. Drag the 0 to the left on the top right. Click choose: data/users/content.json. Change the content.json to content2.json. Publish. Just know, it still pushes it to the original content.json file for everyone. If it dosent work the first time, try content3.json after. It usually works.\n\nIf you want to know how to put KaffieID: http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/\n\nIf it still does not work, make sure its in this order(it breaks otherwise in my experience):\n```\n   \"cert_signers\": {\n   \"kaffie.bit\": [\"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\"],\n   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\"],\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n ```",
				"added": 1565753337
			},
			{
				"comment_id": 361,
				"body": "> [crazylime](#comment_94_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): lol that sounds like a workaround to a bug.  I'll try it.   [...]\n\nYeah. I said it before its just a loophole to a issue that people haven't found a way around for awhile. I just stumbled upon it trying to fix the issue. I usually saw other peers content.json file not updating, but mine was. So in finding a way to create another one, I found a solution.",
				"added": 1565754563
			},
			{
				"comment_id": 362,
				"body": "> [crazylime](#comment_95_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): Do you work on the Py code?\n\nI dont work on the ZeroNet code at all if thats what your saying. I dont even touch the python code at all otherwise on my device.",
				"added": 1565754716
			}
		],
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 104,
				"body": "ALERT - YOUTUBE SUPPRESSING THIS VIDEO http://127.0.0.1:43110/big.kopykate.bit/?Video=1555006800_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj (Julian Assange) Clearnet link: https://youtu.be/ADP8GfVxpUE",
				"added": 1555006834
			}
		],
		"1555609581_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh": [
			{
				"comment_id": 105,
				"body": "Tor browser spoofs your IP for any links that goes to the clearnet from ZeroNet. Tor option in ZeroNet is anything inside of ZeroNet.",
				"added": 1555819312
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 106,
				"body": "> [kaffie](#comment_834_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Basically all. The ones who are done with Trump have nowhere else to go. They hate the rest of the dems, and like Yang because of $1000/month + accelerationism. He solves the problems that white middle aged truckers/factory workers/etc. are facing. He addresses the same problems as trump, but provides new solutions.  [...]\n\nAs soon as you said healthcare for all, you lost me. Far left candidates are what is ruining America.",
				"added": 1555820170
			},
			{
				"comment_id": 107,
				"body": "Andrew Yang supports illegal immigrants flooding into the country, \"fight for equal pay\" that has been debunked numerous times. Sounds like a crazy candidate to me. He is basically advocating for what \"The Fate of Empires\" warned. Not only that, but he is anti 2nd amendment.",
				"added": 1555820682
			},
			{
				"comment_id": 109,
				"body": "> [cycletrader](#comment_5_16JiMWc6XDUZZWvEEPfwMTzwKb5Xki154u): As I noted, according to Yang, corporations would be charged a 10% vat, or value-added tax. This will total about $800 Billion and total revenue, but ultimately this tax will be passed down to the consumer. > [anonymouslogin]\n\nCorporations will just then move money overseas. Your talking about mega corporations here. They already know ways around the high taxes. They will either move it overseas, or find loopholes.",
				"added": 1555821020
			},
			{
				"comment_id": 110,
				"body": "> [geekosan](#comment_17_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): Why not John McAfee? :)\n\nRemember that video of him making fun of McAfee? Good times.",
				"added": 1555871930
			},
			{
				"comment_id": 114,
				"body": "Woah, this sure blew up, just like any political discussion into huge discussions and arguments.",
				"added": 1556319194
			}
		],
		"1555519409_1GPcQGyxZgHrA7mBwgPSGqSgBVRJmvRdi2": [
			{
				"comment_id": 111,
				"body": "sth",
				"added": 1555872280
			}
		],
		"1556247551_1HTdhnCWjx6CJndUmXpzzcUDAqsXH56J7L": [
			{
				"comment_id": 112,
				"body": "There is VOAT on ZeroNet if you people did not know... I really wish people would make that zite more popular. http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/ It is here if you want to make it more popular with a decentralized alternative.",
				"added": 1556268099
			}
		],
		"1555652637_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 113,
				"body": "Looks interesting. I always wanted a live streaming zite. Hope that you get success.",
				"added": 1556319061
			},
			{
				"comment_id": 115,
				"body": "> [satoxyn1](#comment_67_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): You can clone it, run ffmpeg command which generates HLS stream (look at example below) and it will work.\n\nI know that, I am just too lazy to test right now. I was just saying that for in the future if you ever wanted to make a more streamlined version.",
				"added": 1556328409
			},
			{
				"comment_id": 116,
				"body": "> [xeu100](#comment_6_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq): This is just one more step towards completely leaving the cleannet. Once we get basic services on zero, more people will surely join. Hopefully not the bad ones\n\nAny place will get bad people, especially a uncensored net.",
				"added": 1556328437
			}
		],
		"1556406701_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 121,
				"body": "Somebody can try to just clone the whole site, and rename it. It would work the same way.",
				"added": 1556434070
			},
			{
				"comment_id": 122,
				"body": "> [ztz](#comment_18_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): I'd think implementing custom made filters that you can share would be better. [...]\n\nYeah, a filter would be good to have.",
				"added": 1556435588
			},
			{
				"comment_id": 123,
				"body": "> [ztz](#comment_19_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): I'll try and fiddle around with adguard filters, I'd think that would work\n\nHopefully, we get some results.",
				"added": 1556435680
			}
		],
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": [
			{
				"comment_id": 118,
				"body": "Gr8 b8 m8 I r8 8/8",
				"added": 1556433742
			},
			{
				"comment_id": 119,
				"body": "> [monsterjazz](#comment_30_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp): fuck you- get off the platform.\n\nJust block. You cannot kick anybody off of ZeroNet anyways.",
				"added": 1556433764
			}
		],
		"1556366714_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 120,
				"body": "It is interesting, but in some ways is weaker than ZeroNet in areas like browser support, Tor, as well as others. Also, since it is not very popular as ZeroNet, there seems to be no sites to be found other than the offical ones.",
				"added": 1556433945
			}
		],
		"1556150091_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 124,
				"body": "I guess you can say, it is on BitChute, at least now...",
				"added": 1556435842
			}
		],
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 125,
				"body": "https://www.computerworld.com/article/3389882/former-mozilla-exec-alleges-google-torpedoed-firefox-with-oops-excuses.html\n\nGoogle is the one mostly to blame for the fall of Mozilla.\n\n>  A former Mozilla executive last week claimed Google, a browser rival but again also a business partner, purposefully undermined Firefox's development even as the company denied compatibility problems were anything but accidental. Contrary to declarations by individuals at Google, the search company and Mozilla were not on the same team, charged Johnathan Nightingale, a former vice president of Firefox, who said decisions by Google that ended up hurting Firefox were too frequent to be coincidences. \"Focus on the behaviour of the organism as a whole,\" Nightingale tweeted. \"At the macro level, Google/Alphabet is very intentional. [And] Google as a whole is very different than individual googlers.\"\n\nWant to know why the current Brave CEO who was kicked by Mozilla and taken over? Blame Google. This is why I like Brave, despite it being Chromium. During the whole fiasco of Google going to disable uBlock Origin and ad blockers, Brave was going to become a fork of Chromium(I wished Google did go against ad blockers just so that happened, but Google stopped it, so yeah). This is why I stopped supporting Mozilla. The day that they kicked out that guy as CEO, is the day I knew Mozilla was going to shit. You can argue all you want about competition to Chromium(yes I want competition), but anti-censorship is my top priority. Brave's CEO is not looking to censor extensions anytime soon if you look at his Twitter. I am confident if the worse comes, Brave will just become a fork of Chromium that is better.",
				"added": 1557381819
			}
		],
		"1557414212_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 126,
				"body": "> [561984](#comment_4_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1): For those who don't want to be tracked through YouTube Javascript, these are the links for Invidious and the .onion version:https://invidio.us/watch?v=4Ia81e5KQpEhttp://axqzx4s6s54s32yentfqojs3x5i7faxza6xo3ehd4bzzsg2ii4fv2iid.onion/watch?v=4Ia81e5KQpE\n\nNice anti tracking sites.",
				"added": 1557602713
			},
			{
				"comment_id": 127,
				"body": "I have uploaded the video to KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1557603698_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
				"added": 1557603801
			}
		],
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": [
			{
				"comment_id": 128,
				"body": "I honestly try to go around and help seeding the network. I even leave this on in the background while I am doing other stuff. I am not going anywhere.",
				"added": 1557647879
			},
			{
				"comment_id": 187,
				"body": "> [everybody](#comment_10_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): We need publicity outside ZeroNet.I didn't find any link about ZeroNet in DuckDuckGo search engine. [...]\n\nI doubt ZeroNet will gain traction with the masses, since the masses aren't very technologically able. By the way, there is a ZeroNet app on the Play Store.",
				"added": 1565143697
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 129,
				"body": "Nobody cares about you or help you, except in rare case like family or friends. And even then, they might not know your struggles and still hurt you. Just accept that governments help bad people like me. Also accept that society sucks, people suck, and just do what you like to do. If nobody cares for me, why should I for them? This is now my life, and I make myself happy. Sometimes I want to just go off the grid and be happy to escape this shitty system. If we are going to die anyways, why not do what you like? This is what keeps me happy. Fuck the system, and everybody who follows it and loves it.",
				"added": 1558065991
			},
			{
				"comment_id": 130,
				"body": "> [nekololi](#comment_357_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i'm certain i'm not a bad person though.\n\nBad and good are perspectives. There is no such thing as good or bad. I can say your good, someone can say it is bad, but what constitutes as good or bad? Society? Whoever answers this is already putting in their perspective, and not grounded in truth.",
				"added": 1558066772
			},
			{
				"comment_id": 134,
				"body": "> [kropptyler](#comment_15_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): Well, there's such a thing as ethical philosophy, which I doubt you have training in. But hey, whatever floats your boat.\n\nSo no counter to my claim? Also, your \"training\" does not make you more smart than somebody else. If you mean college, then I have news for you: Your Education Does Not Make You Smart https://youtu.be/iZWHOLnZKAw",
				"added": 1558083743
			},
			{
				"comment_id": 136,
				"body": "> [kropptyler](#comment_17_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): If you are implying that you are more smart than I, that would be an ad hominem, which is not an argument. It was unfair of me, though to comment as I did, because I know there is a section of philosophy dedicated to such ideas, one which is surprisingly popular among intellectuals. After all, how can our eyes be real, if mirrors aren't real?\n\nI was not implying I was more smart, so sorry if I did. I get what you are saying though.",
				"added": 1558114089
			}
		],
		"1557991095_12kqbnJ3QpaT6extMyBhPzaWvbi8xkPVbt": [],
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 133,
				"body": "I usually try to bundle it with something else to make the file big enough, or go on ZeroUP Unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/",
				"added": 1558077208
			}
		],
		"1558041340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 135,
				"body": "> [blazingeye](#comment_21_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Christianity is branch of judaism. It's same religion.\n\nThis is why I find it funny when Christians, and Jewish people fight. You just change a little bit, and call it something else.",
				"added": 1558085474
			}
		],
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 137,
				"body": "I can understand people who are apolitical because of how corrupt politicians and the system is to a certain level. If you vote for someone and then they lie, you become dissuaded. I do vote regularly though and advice people to vote. I will always vote for lesser evil. I understand no party in the US will never match my views, but that the Republican party will be better for me than white and man hating Democrats. Not only that, but less gun control and the like to make me free for less government. I know with the Fate of Empires, it is inevitable for the left to win, but I just want to push it back enough till I am old enough not to care about Socialist States of America. When im old, I can then laugh as everything burns and enjoy the decline. Sometimes I just want to live off the grid and not care. You can argue all you want about the corrupt parties, and I agree, but I just want to push it back till I do not care anymore.",
				"added": 1559209356
			}
		],
		"1559249999_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 138,
				"body": "ZeroNet on my android says port is closed no matter on wifi or data, even if I port forward. Even though canyouseeme says the port is open. Which is odd.",
				"added": 1559258935
			},
			{
				"comment_id": 139,
				"body": "> [styromaniac@kxoid.bit](#comment_57_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Which carrier?\n\nIts on both wifi and data. Its not a carrier issue. My router and ISP is also not the issue, since ZeroNet on my PC says the port is open. The port is clearly open on the other side, so it might be a ZeroNet issue with it detecting whether the port is open. Port open on Router: http://oi64.tinypic.com/qznrqr.jpg ZeroNet PC open : http://oi64.tinypic.com/debrwy.jpg ZeroNet Android says not open? http://oi67.tinypic.com/2lwnc5i.jpg Torrenting also works on Android via port forwarding. I think its the ZeroNet Android app.",
				"added": 1559261129
			},
			{
				"comment_id": 140,
				"body": "> [styromaniac@kxoid.bit](#comment_58_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I use the same app, so that's not it.\n\nMaybe my phone does not play well with the app. Either that or the Android OS itself. Either way, something is glitching it.",
				"added": 1559268116
			},
			{
				"comment_id": 141,
				"body": "> [styromaniac@kxoid.bit](#comment_59_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Have you dedicated a port number to your PC? Have you done similar for your phone?\n\nI dont know what dedicated port is. Also my PC been working fine.",
				"added": 1559269560
			},
			{
				"comment_id": 142,
				"body": "> [styromaniac@kxoid.bit](#comment_60_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I think that's where the issue is. Find a second open port.\n\nWhat port would that be? I do not know where to find it. Sorry for late reply, been a little busy.",
				"added": 1559278589
			}
		],
		"1559590587_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 143,
				"body": "I always wondered what is the point of a ZeroNet browser. Sure, it sounds cool, but there is so many other browsers you can use on ZeroNet. Why not use the other open source browsers out there? My theory is to free yourself of the http protocol as the answer.",
				"added": 1559758584
			}
		],
		"1559682829_1CZMjjnu2qd6BuoeLC35vc4o7A9LRtQZrJ": [
			{
				"comment_id": 144,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_182_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Reddit recently shadow-banned me.\", [...]\n\nReddit was mostly a echo chamber anyways.",
				"added": 1559759217
			}
		],
		"1559164681_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 145,
				"body": "Banks collapse the economy, then get bail out. They crash economies and stocks to buy them low, sell them high. They get rich from boom, bust economy.",
				"added": 1559759453
			}
		],
		"1559711646_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 146,
				"body": "Nobody knows, really. All we do know is it can do computations at a faster rate. Hopefully that does not mean cracking encryption like the ones ZeroNet uses.",
				"added": 1559759803
			}
		],
		"1559765720_1Q1jvHD9GzJskrk2PuWLbudrdFLDT2nvGg": [
			{
				"comment_id": 147,
				"body": "I remember messing around with computers, and websites during the early wild west internet days. I kind of miss how freeing the wild west internet days were and the early days of computers. It was so new, and exciting. I basically learned a lot about computers from being curious, and MapleStory Private Servers. To make those servers, you needed to know PHP, SQL(better make sure to use encryption on your database), HTML, CSS, Java(or C++). Hacks and DDOS programs were also commonplace there. I am not defending hacks, but it made me learn a lot more about technology combined with all the other stuff. I would even go on websites that had chats working on the DSi, which awed me. Those websites you could edit your profile in CSS. It was crazy back then.",
				"added": 1559798242
			}
		],
		"1558494867_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 148,
				"body": "The same been happening to me. Just wait till ZeroNet gets updated, I guess to fix it.",
				"added": 1560020861
			}
		],
		"1559768099_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 149,
				"body": "> [zeronetuser23](#comment_2_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG): Agreed, porn is a cancer. Porn can already be readily found elsewhere, it doesn't have to be everywhere. [...]\n\nRename site to PornTube, then clone the site and have the 2nd be YouTube.",
				"added": 1560050759
			},
			{
				"comment_id": 150,
				"body": "> [sharer](#comment_62_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): Sorry I am not updating my zites lately. I am not very well right now in my health.\n\nHope you get better.",
				"added": 1560050797
			}
		],
		"1560053525_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 151,
				"body": "> [reeeeeeeeeeeeeee](#comment_3_1MutjWS9dBUHWpg67kCVznJn2uG3z4n8Rr): I'm glad ZeroTalk is accommodating to schizophrenics. Even loonies need a place they can express themselves.\n\nI rather them share it here. Big pharma is too corrupt imo for me to even consider people to get \"treatment\".",
				"added": 1560066510
			}
		],
		"1560049831_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 152,
				"body": "> [whitewolf](#comment_4_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): Literally who? YT bans \"far right\" content because the messaging is effective. Only globohomo messaging is allowed within the left or the right.\n\nThey are basically banning anybody who is a threat to the media organizations like Vox and NYT. They are losing sales in cable, newspapers, and online subscriptions, so they are trying to make it up somehow.",
				"added": 1560103217
			}
		],
		"1560368932_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 153,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_242_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Smart people will always find a way to bypass the political agendas of Freaks.As for Soros and his clique, it is better not to meet face to face one day in a remote corner of the world.\n\nI am not worried about the smart people, but the majority of people who just access mainstream sites will become prone to group think. It will feel more and more like the matrix and 1984(even though we kind of already are). These things sometimes takes a long time to undo. It will become harder and harder to unplug people.",
				"added": 1560407847
			},
			{
				"comment_id": 154,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_245_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): So if I understand you correctly, you're trying to make me believe that getting someone out of intellectual and physical laziness is possible. [...]\n\nIts possible, but only when their life's get effected. It usually takes awhile before people wake up.",
				"added": 1560452478
			},
			{
				"comment_id": 156,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_246_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Forcing people is the worst thing you can do. I know you react like that, that like everyone else: you've seen agitators \"on all sides\" do that. [...]\n\nWhat I mean is that once the people controlling others eventually effects them, then they see. I do not agree with forcing people anyways. I already try to live the lifestyle other people want to be anyways.",
				"added": 1560462683
			}
		],
		"1560456511_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 155,
				"body": "> [styromaniac@kxoid.bit](#comment_74_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): That has to be the biggest disappointment in it all. You get a lot of truth and then suddenly the hate/blame train rolls in, on YouTube of course. A lot of truth met with spicy hate for whatever dumb reason. [...]\n\nThese people taking down these videos will not help anyways. All this censoring is doing is making them seem right. People can complain all they want about \"hateful YouTubers\"(which I think they aren't, just being propagandized by big establishment), but censoring just makes them bigger.",
				"added": 1560462343
			}
		],
		"1560461280_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 157,
				"body": "> [holeyhouseofair](#comment_14_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): well hermetic theory would disagree with you, apparently you have to create order to avoid falling into chaos. but I guess that's how we got to the state we are in.\n\nWon't chaos make people want order? I would assume the opposite is true as well. People love to miss what they do not have.",
				"added": 1560462998
			}
		],
		"1562671898_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 158,
				"body": "Tomsguide has not been good for awhile now. I would take what they say with a grain of salt ever since the RTX Nvidia \"just buy it\" articles they made. If its true, then this is bad indeed.",
				"added": 1562747026
			},
			{
				"comment_id": 159,
				"body": "> [geekless](#comment_84_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Putin's government bans messaging apps which refuse to provide a backdoor for FSB. You can search for proofs in Google.\n\nI would not use Google as they have a history of manipulating search results to suit their agenda. Also, privacy concerns... Even if you don't care about those 2 things, its also good to support competition against Google's increasing monopoly.",
				"added": 1562748004
			}
		],
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 160,
				"body": "> [filips](#comment_57_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): They didn't fork Chromium. And Google removed ability for ad blocking only for extensions, and Brave's ad blocker is built in. [...]\n\nYou can get around chromium blocking by changing the user agent. A lot of sites work fine on almost every browser anyway.",
				"added": 1562749309
			},
			{
				"comment_id": 161,
				"body": "> [filips](#comment_81_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): This is actually also problem. Websites block browsers other than Chrome even if they completely work. [...]\n\nI know they already block other Chromium browsers. I get around user agent blockings all the time on many different browsers incluing Chromium browsers, Firefox, etc. I switched between browsers for awhile(and have multiple for website programming reasons for compatibility) I just know Brave's CEO said he will fork Chromium once Google forces no adblocking(Unless something changed, idk)",
				"added": 1562778929
			},
			{
				"comment_id": 162,
				"body": "> [geekless](#comment_93_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): They said Flash had dangerous vulnerabilities, but it seems the most dangerous vulnerability Flash had was actually the fact it was invented not in Google.\n\nAdobe is a really shady company. You can ask people who use their products in programming.",
				"added": 1562779748
			},
			{
				"comment_id": 164,
				"body": "> [filips](#comment_83_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Google is even more shady. Problem is that people don't realize that. [...]\n\nPeople do not realize Google is shady because people do not care. There is so many people I told about Google that still use it. Our problem just like with IE is going to be the normal users who use whatever other people use, as well as laziness. Google uses this to their advantage. Unfortunately, the only ways for things to change like IE: Is for things to get really bad, or another mind share takeover. There is even people who still use Facebook, despite its numerous scandals. Mind share is a hell of a thing. Even if you convince all the technology knowledgeable people to not use anything Google, the non-tech savy outweigh us.\n\nThis is why I doubt people will care if they will have to pay for a walled gateway for the internet to censor any \"harmful\" views. People after all, love ease of use and whatever everyone else uses.\n\nFor those that do not understand it: \"Mind share relates generally to the development of consumer awareness or popularity, and is one of the main objectives of advertising and promotion. When people think of examples of a product type or category, they usually think of a limited number of brand names.\"\n\n\"Kleenex, for example, can distinguish itself as a type of tissue. But, because it has gained popularity amongst consumers, it is frequently used as a term to identify any tissue, even if it is from a competing brand.\"",
				"added": 1562903357
			},
			{
				"comment_id": 165,
				"body": "> [geekless](#comment_94_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Yeah, it has, and it's also a closed-source technology, so better alternatives are welcome. Adobe could try to open the sources and initiate a standardization process, but they missed the time and lost their market. [...]\n\nNot only that, but there is the #1 thing corporations want the most: Mind share. Once you have that, you can become really anti-competitive and anti-consumer and still be bought. Google, Intel, Nvidia, Facebook, and a bunch of other big corporations do it to this day.",
				"added": 1562903422
			}
		],
		"1562568127_1Cu9qgK9V7hFEBueV1SiB46L8AoUHF6mpo": [
			{
				"comment_id": 163,
				"body": "Its easier to do this on the surface web due to more sites.",
				"added": 1562785117
			}
		],
		"1563051650_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 166,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_440_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you have some references the guardian, cnnand what about the new york times ?\n\nEven though they are bad sites, a broken clock is right 2 times a day. I remember CNN even covering slavery in Africa that is still happening objectively.",
				"added": 1563062387
			}
		],
		"1563053899_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 167,
				"body": "It is sad because my friend at college is called a genius just for taking time out of his day to research via the internet.    People do not even research stuff anymore, its sad.",
				"added": 1563062581
			}
		],
		"1562938970_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 168,
				"body": "> [filips](#comment_86_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Is ZeroNet part of Fediverse?If it is, it should be listed on that sites. If it is not, what should be done to be?\n\nNo. ZeroNet utilizes BitTorrent. \"ZeroNet uses Bitcoin cryptography and BitTorrent technology to build a decentralized censorship-resistant network.\"",
				"added": 1563082929
			}
		],
		"1563459417_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 169,
				"body": "There is competing crypto options that are more anonymous if you want a alternative.",
				"added": 1563946364
			},
			{
				"comment_id": 170,
				"body": "> [xcape2net](#comment_136_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The privacy of Monero has already been cracked.  How long do you think it will be until the rest of the \"private coins\" are cracked as well?  When that happens, all your past transactions are out in the open for whoever wants to sift through them.  The only way to insure your privacy is to never give up any personal information during any transaction that can be tracked to your crypto wallet.\n\nAnything can be cracked. Its a game of cat and mouse. You can make the same argument for any encryption.",
				"added": 1563992838
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 171,
				"body": "> [mrfalafel1](#comment_6_14Py1jF6kNycrGV9LBhLEbYvupJWNAcPd3): Is there a competent open source CPU manufacturer? I don't know of one.\n\nThere are open source CPU manufacturers, but they are not that great performance wise.",
				"added": 1564038944
			}
		],
		"1565016468_13m3NoLQwK46WML3WyRBCR8uxS7xSs5H1C": [
			{
				"comment_id": 172,
				"body": "> [filips](#comment_118_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Here are some of my suggestions (without any order): [...]\n\nGood thing about DuckDuckGo, is they have a onion link. Main reason its my go to for private internet searches.",
				"added": 1565031699
			}
		],
		"1562068614_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 173,
				"body": "People usually get around Chinese blockades by using Tor with a meek bridge.",
				"added": 1565032249
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 174,
				"body": "We can try to make alternatives to ZeroTalk, or change ZeroTalk itself that do not need to the owner permission to up the limit. By removing needing a owner to up the limit, it makes take downs impossible(for ZeroTalk). The less central authorities on ZeroNet, the better.",
				"added": 1565032464
			}
		],
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": [
			{
				"comment_id": 175,
				"body": "I think the only way web 3.0 will succeed is if censorship in multiple ways forces people to use it. I think the only way is if government becomes really heavy on censorship, like Soviet Union, or EU.",
				"added": 1565044360
			}
		],
		"1564106401_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi": [
			{
				"comment_id": 176,
				"body": "I find it funny when there are blacks actively going against what MLK said.",
				"added": 1565046683
			},
			{
				"comment_id": 178,
				"body": "> [everybody](#comment_8_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): some people are just crazy, ignorance is the best thing to do.\n\nHonestly its better for sanity sake to ignore some people.",
				"added": 1565076812
			}
		],
		"1565037100_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 177,
				"body": "I always personally never liked running stuff on extreme low end amounts of RAM. Sure, it can be a fun hobby, but it restricts me too much in the options I can use to run on it. Stuff like pocket chip are really fun, but can be quite limiting.",
				"added": 1565046782
			}
		],
		"1565109461_1GCRFuF1HrEdifYfPP69zaKxoJkwUMeZcU": [
			{
				"comment_id": 179,
				"body": "Watch these: Run ZeroNet through Tor network: https://www.youtube.com/watch?v=dYPlle9jGyoHow How to use Tor browser on ZeroNet: https://www.youtube.com/watch?v=ZCey1SqUTrw ZeroNet activity will go through the tor network with that first link, and 2nd link will be if anyone links to the clearnet(not ZeroNet, aka normal websites).",
				"added": 1565119476
			}
		],
		"1565120423_13r1hwu6tyYeZsWk48DQDqtq9AN5GWQXmo": [],
		"1561670029_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 181,
				"body": "> [btc1million2030](#comment_1_1L1UZeqqUxG5yBwWYvZF1GHrXnpmVvYGif): I would recommend setting up a ZeroTalk clone to set up themeing and the like.\n\nThere is a ZeroVoat. http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/ It is not active, though.",
				"added": 1565122683
			}
		],
		"1565123272_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 182,
				"body": "Have you tried deleting the directory then reopening the link? Usually for me that fixes it. Sounds like ZeroNet thinks you already downloaded the zite. If your still experiencing difficulty, you can report it on their github: https://github.com/HelloZeroNet/ZeroNet",
				"added": 1565123306
			}
		],
		"1565125379_1ATpyKRza3N49rrjJFPznrUG9BN1i6e6Uq": [
			{
				"comment_id": 183,
				"body": "ZeroNet does not get faster the more space you set. All it does is decrease the delay in hitting the space limit, and upping it.",
				"added": 1565130104
			}
		],
		"1565141688_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD": [
			{
				"comment_id": 185,
				"body": "My ZeroNet is still fast. Btw if you have 8chan, thats probably whats slowing down your network. Its having tons of requests per second from the flood of new users.",
				"added": 1565141635
			},
			{
				"comment_id": 186,
				"body": "> [bigbadbob](#comment_3_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): :) in a round about way its kinda like a cloudfare ddos with all the 8chan refugees.\n\nPeople have found some illegal activity on the chan, so you should stay away. Dont wanna host any of the content. I mean, this is the downside of decentralization. This is what censorship does, and sometimes the only way to fight it is to use the tools these people will use.",
				"added": 1565142484
			},
			{
				"comment_id": 188,
				"body": "> [needhelp](#comment_17_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p): where's the 8chan link? link me plox\n\nIts literally everywhere on ZeroTalk(8chan link): http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D Its all found here(ZeroTalk link): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU/Where+is+8chan",
				"added": 1565145017
			}
		],
		"1565145571_17Yg9q5JQGGAYFEyg3mJf6Jky8DyXR7WaE": [
			{
				"comment_id": 189,
				"body": "> [needhelp](#comment_19_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p): nofish is dead, hasn't been on reddit zeronet for like 9 months...\n\nReddit =/= here. If he was dead, he wouldn't have upped my ZeroTalk limit twice.",
				"added": 1565146001
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 190,
				"body": "> [needhelp](#comment_20_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p): unfortunately I am not a programmer so unless someone else can do that I can't even use this shit because I do not understand it...\n\nHave you tried opening the code up in notepad++? It tends to clean up the code.",
				"added": 1565146071
			}
		],
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 191,
				"body": "I noticed some propaganda on the clearnet with people claiming that Tor \"isn't anonymous\", and smearing ZeroNet as a whole. Its mostly directed at 8chan. I think it is to stop people coming here.",
				"added": 1565146336
			},
			{
				"comment_id": 192,
				"body": "> [styromaniac](#comment_852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Vice mentioned it as well: [...]\n\nI don't think ZeroNet is \"underground\" anymore. Its all over the internet right now.",
				"added": 1565146495
			},
			{
				"comment_id": 193,
				"body": "> [styromaniac](#comment_854_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They will get in trouble with the hover-load thumbnail issue that got Millchan on blocklists. [...]\n\nWhats the hover-load thumbnail issue? I am out of the loop here.",
				"added": 1565146697
			},
			{
				"comment_id": 194,
				"body": "> [steelmemes](#comment_16_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): What's the over/under on the creator (forgot his handle) making a virtue-signal announcement about Zeronet \"not being a place for hate\" in the next day or two?\n\nIt wont even matter if he says it or not. The media will try to want ZeroNet to be censored, but it won't work. Their views will never be satisfied. They STILL complain about \"extreme right wingers\" on Facebook, Twitter, etc despite them blatantly censoring ALL THE TIME. They even censor moderates left wingers, and it's still not enough",
				"added": 1565147036
			},
			{
				"comment_id": 195,
				"body": "> [steelmemes](#comment_17_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): I know it won't matter, I'm just curious how cringy it'll be. Megacucked or just supercucked?\n\nIm not sure. I know the media got all up in arms about ISIS using ZeroNet, and China got all up in arms about its people using ZeroNet. So im not sure if he will even make any comment at all.",
				"added": 1565147161
			},
			{
				"comment_id": 198,
				"body": "> [styromaniac](#comment_856_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet doesn't have a spokesperson. That would be like having a spokesperson for the clearnet.\n\nTry explaining that to the technologically inept media who called Cloudflare a ISP, and the masses. Let me see if I can find it. https://youtu.be/5astGCFtiws?t=244 If you want another funny example: https://youtu.be/5astGCFtiws?t=414",
				"added": 1565147465
			},
			{
				"comment_id": 199,
				"body": "> [styromaniac](#comment_857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's a series of tubes.\n\nI mean I dont like 8chan, but even hearing some of this scares me: https://youtu.be/5astGCFtiws?t=34 Using banks against people? Yikes. I know crypto and everything, but a lot of places rely on fiat money. Im just afraid of the future of more censorship in general and trying to control people.",
				"added": 1565147787
			}
		],
		"1565146490_17Yg9q5JQGGAYFEyg3mJf6Jky8DyXR7WaE": [
			{
				"comment_id": 196,
				"body": "Use Tor with meek bridge.",
				"added": 1565147205
			},
			{
				"comment_id": 197,
				"body": "> [lialosiu](#comment_1_12Rkd9x36cVgopSut1vpTzjuQcL8Treh5j): use shadowsocks, no more panic.\n\nThis.",
				"added": 1565147238
			}
		],
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 200,
				"body": "> [styromaniac](#comment_858_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Remember the YouTube shooter? I guess it's YouTube's fault because she was a YouTuber.\n\nIts all about control to these mega corporations. They smear alternative platforms, while defending each other for no competition.",
				"added": 1565148558
			},
			{
				"comment_id": 202,
				"body": "> [steelmemes](#comment_19_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): The others were just that era's version of clickbait. 8chan is different, the powers that be are systematically wiping out every site that helped get Trump elected. It's not a coincidence that the closer we get to 2020 the more these takedowns are ramping up and getting fiercer. They only want approved messages getting out once the dem nominee is chosen and the campaign goes into full swing.\n\nThey are even targeting moderate democrats. They don't care. Your either progressive or your a \"Nazi\".",
				"added": 1565149418
			},
			{
				"comment_id": 203,
				"body": "> [styromaniac](#comment_859_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Hillary got Trump elected.\n\nHonestly, they are going to get Trump elected themselves again. I am not joking when they are even bashing Obama now as a \"Republican\".",
				"added": 1565149552
			},
			{
				"comment_id": 204,
				"body": "> [styromaniac](#comment_860_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Depends on which light you define them in. Nonetheless, it's neocons vs us all.\n\nHow are progressives \"neocons\", when the \"neocons\" policies aren't in the progressive wing? Reparations, flirting with socialism, being against deporting illegal immigrants(which majority of population is for deportation), and just getting rid of private health insurance? The only thing remotely \"neocon\" is the illegal immigrants for low wages. Have you watch the Democrat debates?",
				"added": 1565149643
			},
			{
				"comment_id": 205,
				"body": "> [styromaniac](#comment_861_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Regime change wars, crumbling infrastructure, still lacking healthcare. It's a name for the establishment, and that includes all past administrations in recent decades. [...]\n\nIsn't the progressive wings being for universal healthcare and scraping the private what you want? I mean, they do advocate for it.",
				"added": 1565149885
			},
			{
				"comment_id": 206,
				"body": "> [shy](#comment_8_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq): Trump lost already bro he banned bumpstocks over a shooting we still know nothing about, now he is laying the groundwork for his entire supporter base to be labeled as mentally unstable and have their guns taken away with NO due process and worse. the only people still shilling for him are out of touch boomers who will GLADLY hand over their freedom\n\nExactly. As soon as he went banning bump stocks, then recent after the shooting with all the crazy stuff he still says got me lost. Backdoor encryption, bashing Bitcoin, taking away more guns, calling for more internet control to \"stop these things to happen\", bashing video games. I can go on.",
				"added": 1565150328
			},
			{
				"comment_id": 207,
				"body": "I find it funny you have 8chan users overreacting that the alternative version on ZeroNet is not the \"offical\" one, then are like \"DELETE ZERONET NOW, IT WAS MADE BY THE FBI\". It was not even made by the FBI, but by a 8chan user a year ago. I guess this is going to cause massive amounts of 8chan users to leave ZeroNet.",
				"added": 1565150884
			},
			{
				"comment_id": 208,
				"body": "> [styromaniac](#comment_864_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): \n\nIts been confirmed to be made by a 8chan user. I remember accessing it awhile back. The FBI probably does not even need to do anything if there are idiots. Just view all the IP's doing CP without Tor.",
				"added": 1565151298
			},
			{
				"comment_id": 209,
				"body": "> [styromaniac](#comment_866_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I can tell you right now the extreme paranoia they have gives away the meth possession.\n\nBy what I seen, some are extreme paranoid people that won't go anywhere not \"confirmed by Q\". If its not, then its the government or \"the jews\". Just go on Twitter posts, and you will see. Here: https://twitter.com/JohnLambSOL1/status/1158903441370091520 https://twitter.com/AuthorAIJacob/status/1158926055341789184 https://twitter.com/2runtherace/status/1158923279333253120",
				"added": 1565151612
			},
			{
				"comment_id": 210,
				"body": "> [styromaniac](#comment_867_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Let's play by their logic here: That doesn't prove this 8chan user wasn't an FBI plant.\n\nI doubt it. I mean, are we going to call all CP posts a \"FBI\" thing?",
				"added": 1565152571
			},
			{
				"comment_id": 211,
				"body": "> [styromaniac](#comment_868_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Damn it, man. I want the cockroaches gone for sure.\n\nThey are scared enough from the posts calling it a honey pot when its not, and then being mindless drones only accepting where \"Q\" is. If it wasnt the CP or the honey pot, it would of been \"Q\" alone. They are going away, thats it. Q: This isnt the offical 8chan, don't go. 8chan users: They tried to set us up, lets leave. ",
				"added": 1565152661
			},
			{
				"comment_id": 212,
				"body": "> [styromaniac](#comment_869_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Today sucks dick because these people think typing \"nigger kike 9/11 yeet\" is funny to anyone but their bucktoothed middle school classmates.\n\nTry playing a online game where someone spams it in the mic or the chat, then having to mute them.",
				"added": 1565152866
			},
			{
				"comment_id": 213,
				"body": "> [bigbadbob](#comment_5_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I can only imagine the \"official\" 8chan on cloudfare was an actual honeypot like 4chan.  Well maybe not an \"actual\" honey pot but close enough,  I'm not sure how to post anything on 4chan while using a vpn or tor and it uses google captcha.   Im not sure about 8chan.\n\nCP got posted on 4chan and 8chan then usually got taken down after. Its how it works. 8chan on ZeroNet cant be a \"honeypot\", when the user base actively does this stuff. FBI does not need to do much work here.",
				"added": 1565158739
			},
			{
				"comment_id": 214,
				"body": "> [bigbadbob](#comment_10_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): im not the most tech savy but ive been trying to learn.  to my understanding zeronet is like blockchain.  everything posted will always remain and be easily traced to its origins.   What do you feel the greatest danger of using zeronet is?    Being accused of being guilty by association? or accidentally seeding something illegal?    i use tor and avoid 8chan or anything illegal here.   i want to be safe and not get in trouble for being in the wrong place at the wrong time.   best tips?   just stay away from trouble and be aware whats on my system?\n\nZeroNet is not blockchain. Its peer to peer where everyone shares their resources, and it gets copied to multiple different computers. By copying the content, the data becomes un-censorable due to it being in multiple places. This allows for mirrors to exist inside and outside of ZeroNet. Also, you can delete content that you downloaded from ZeroNet. Also, I just heard the 8chan on ZeroNet got CP posts, since the chans usually get those type of people. I heard the advice to avoid the site because technically having the CP and seeding(you sharing your resource of content you downloaded) it is illegal. This is why I mostly don't just wander on random sites on ZeroNet, and like to stay on text stuff, and click to download like ZeroMe. 8chan on ZeroNet runs on where it just downloads straight. On ZeroMe, there is less risk, since you wont accidentally download something illegal just by browsing. If you want a example of what I mean, you can go here for ZeroMe: http://127.0.0.1:43110/Me.ZeroNetwork.bit/ It will have content of \"show image\" to get the image, instead of just downloading images all the time.",
				"added": 1565160936
			},
			{
				"comment_id": 215,
				"body": "> [bigbadbob](#comment_11_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Thx,  That is helpful,   I will check out zero me, keep the system clean and be cautious.     I think decentralized internet is a great idea...  I know it takes power away from some and want to be safe.  We should have these freedoms but things are upside down.   extremists everywhere lol\n\nIf you want to have a blocklist that blocks harmful sites: http://127.0.0.1:43110/Styromaniac.blocklist.bit/ Just click the thing to enable it, then there should be a prompt on the upper right to \"add content\", just click add. If you dont want to enable some of the blocklists, you dont have to. If you also have any questions on blocking things yourself, just ask. MOAB by itself is typically fine for most people, but I usually do NoMiner too http://127.0.0.1:43110/1NominErMMEodukCTKD5NN6HqgmtsG4Z8U/",
				"added": 1565162704
			},
			{
				"comment_id": 216,
				"body": "> [bigbadbob](#comment_12_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Awesome,   thx, just checking it out now.   it looks very useful,   i blocked the sites already,   I figured that youtube site was trash:)  and millchan.\n\nIf you want a good YouTube(Majority of the time, has 2 porn thumbnails on homepage videos, but its legal, rest of videos aren't porn): http://127.0.0.1:43110/big.kopykate.bit/ Also, on KopyKate, just cause you see it, dosen't mean you have the video on your storage, only when you click.",
				"added": 1565163439
			},
			{
				"comment_id": 220,
				"body": "> [bigbadbob](#comment_13_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): right on, thanks for those block lists,  i flicked them all on and appreciate that.   i checked out zeronet a few months ago and then checked out freenet.   been distro hopping too.  ive settled on a distro and think ill stick to zeronet. you been here awhile?\n\nI been here for awhile, yes. I typically just complain about nobody using ZeroNet. Its why I wanted something like 8chan to create buzz for ZeroNet. People do not move to be decentralized, unless forced.",
				"added": 1565165318
			},
			{
				"comment_id": 233,
				"body": "> [bigbadbob](#comment_22_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): no doubt.   when the fake money gets even more fake.   Such a strange concept to me.   Like even real gold.  I know gold has some uses but you can't eat it if you are starving.\n\nAs with anything with economy, it has value for what what we put on it. During the first economies, all we did was trade.",
				"added": 1565208274
			}
		],
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 201,
				"body": "Hey, ZeroNet keeps getting better. Also works fast on my machine. ",
				"added": 1565149230
			},
			{
				"comment_id": 228,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_584_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"ZeroNet is not a platform for large communities or anything big for that matter, large sites don't load or take forever to load. One large site will slow down your whole fucking network making ZeroNet unusable.\"so it must remain small [...]\n\nThem wanting to police is exactly why propaganda is in overdrive.",
				"added": 1565198903
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 217,
				"body": "It died down significantly after all the 8chan people got freaked out that the site was \"make by FBI to lure people in\", and \"Q said not to go here\". So you have tweets of people literally formatting their HDD in fear(I dont blame them cause of the CP, but its not a FBI thing, just a chan thing in general) If your really worried, just know that majority of 8chan users will stop coming here.",
				"added": 1565164347
			},
			{
				"comment_id": 218,
				"body": "> [kidcourageous](#comment_62_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Holy shit yes XD [...]\n\nI just think 8chan users are prone to paranoia and tons of conspiracies, so that happened. I noticed the more tech savy people who moved here after the 8chan take down stayed here and are more tame. And by tech savy, I don't mean just 8chan. The press alone caused these users to move here.",
				"added": 1565164784
			},
			{
				"comment_id": 223,
				"body": "> [sadloli](#comment_1_1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT): +1 [...]\n\nWell im talking about the ones that I saw getting tons of traction on the internet. I always knew that 8chan and the like had some history of CP(that of course is taken down), that I knew will be a mess on ZeroNet. I guess the take down of 8chan attracted those types? I am sorry if I bunched all you guys together. ",
				"added": 1565166346
			},
			{
				"comment_id": 239,
				"body": "> [12345679](#comment_4_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): It sucks that this impact is the thing that boosts traffic to P2P hosting...\n\nWant to know why? Try telling people to move off of Chrome, Facebook or any other service. I dare you. They don't, won't, and say \"its fine\". People only move when shit hits the fan.",
				"added": 1565215322
			},
			{
				"comment_id": 254,
				"body": "> [removeboomer](#comment_6_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): I was specifically talking about the problems we have in the west. Its easy to write of as senseless and hateful violence, its possible when we're talking isolated cases. But people are reacting with violence since there is no way for them to speak. Deplatforming, censoring and attacking people for telling the truth doesn't create the healthiest mind.The entire argument for freedom of speech is that it creates peace and stability. When a society starts aggressively attacking its dissidents, their numbers will grow and we get violence and destruction instead of debate and agreement.\n\nThe main problem is you have people say a poor white man is \"more privileged\" than a rich black man. They assume he can just get up because he \"has privilege\". Same with anything suffering men's issues. They constant belittle people who have actual problems, and then deplatform the people. All this does is create a divide in society more. The blaming creates the opposite reaction. People keep blaming Trump for all the division, meanwhile you have leftists actively doing the same shit that they say they are against.",
				"added": 1565255177
			}
		],
		"1565161765_16saatvk2kQPGCMBcvvbLgi8YkTGcjAuhA": [
			{
				"comment_id": 219,
				"body": "You can try deleting the site then seeding it again. I know it sounds cliche, but it might be glitched, or something.",
				"added": 1565165225
			}
		],
		"1565144194_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 221,
				"body": "If you don't want your IP to get leaked, you can run ZeroNet through Tor if you want to be anonymous.",
				"added": 1565165858
			}
		],
		"1565151110_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": [
			{
				"comment_id": 222,
				"body": "> [kaffie](#comment_864_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Oh wow. I love when nazis just pop up and hand the exact thing I was looking for in my research. Can y'all clarify what race Himmler was? I can't really find any info on it other than that he wasn't nordic/german/aryan. The reason I ask is because my studies have lead me to very similar spiritual views mentioned in the quote, albeit without the hate (I don't hate anyone!) and I found that the germans I've talked to lack that spiritual aspect. Though I found similarly to himmler in other areas: polish, romanians, africans, and asians (from the ones I talked to though more research is needed), and possibly russians as well, all lack it. [...]\n\nI am jealous at the sites you made on ZeroNet. I know its off topic, but I had to say it.",
				"added": 1565166120
			}
		],
		"1559069408_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY": [
			{
				"comment_id": 224,
				"body": "> [ssdifnskdjfnsdjk](#comment_878_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Interesting thread on 08chan called \"VPN/OpSEC Discussion\"They recommend Mullvad, Astril, Air, IVPN. One can also use own linux server purchased from any provider.Anyone knows self hosted VPN software that is free and does port forwarding to the client? (upnp daemon?)\n\nDid you just revive a old thread from the ashes? I literally haven't seen this discussion in awhile.",
				"added": 1565167505
			},
			{
				"comment_id": 234,
				"body": "> [zerowatchdog](#comment_3_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM): worth readinghttps://thetinhat.com/tutorials/darknets/tor-vpn-using-both.htmlhttps://proprivacy.com/guides/using-vpn-tor-together [...]\n\nThanks for the links.",
				"added": 1565208542
			}
		],
		"1565197963_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 225,
				"body": "Are you on Android? That happens to me usually on Android. What country are you in? Your country might be trying to block ZeroNet. Have you tried running a VPN on your device to see if the trackers popup?",
				"added": 1565198025
			},
			{
				"comment_id": 226,
				"body": "> [theosis](#comment_15_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): I have 10/16.\n\nFor me its 7(its usually less for me with Tor turned on). Without Tor on, its typically 13/14(fluctuates in the 10's).",
				"added": 1565198205
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 227,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_592_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"The establishment\" 'think' 'at a few decades ahead normies head'don't worry for them\n\nThe problem is that is the masses. Watch only a small percent of the population even use this. Be like some underground thing that only a few use.",
				"added": 1565198521
			},
			{
				"comment_id": 230,
				"body": "> [wkuvqb5egq](#comment_2_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): been on the internet since 1991 with prodigy. the amount of censorship and propaganda is absolutely astounding compared to even 5 years ago. I haven't really used a chan in 10 years, but i'm running zeronet 24/7 on a raspberry pi in support of free speech, and especially for speech that i disagree with.  fuck silicon valley\n\nI remember the wild west days of the internet where I ecountered frequent DDOS attacks on forums, and people trying to do SQL injections(wasn't that often, but more than nowadays).",
				"added": 1565199580
			},
			{
				"comment_id": 231,
				"body": "> [gerula](#comment_1_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1): That's exactly what I'm going to do, I'm going to build a small machine that runs 24/7. I'm thinking about something with passive cooling because I don't want to hear it all night :D\n\nRaspberry pi. I mean if you want really small.",
				"added": 1565204911
			},
			{
				"comment_id": 240,
				"body": "> [eightyfour](#comment_115_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): The amounts of disinformation coming from Qtards and antifa alike is incredible. So many posts saying \"ZN is malware\" and \"made by FBI/CIA/MOSSAD/etc. as honeypot\" or that \"everyone who installs ZN automatically downloads CP, so all 8ch soon vanned haha\" on social media. It's almost painful to see all of these tech illiterates think they know better. Honestly, I think that's a good thing. I don't want my precious ZN flooded with Qboomers and ecofascists. Also plz no leftypol, they're braindead morons too. [...]\n\n\"TOR ISN'T ANONYMOUS, AND ALL OF ZERONET IS JUST CP MADE BY THE FBI\"",
				"added": 1565216170
			},
			{
				"comment_id": 288,
				"body": "> [wkuvqb5egq](#comment_9_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): The barrier-of-entry to the internet back in the 90's is what made it so great. Now any jerkoff with an obama phone can post, which has diluted conversation considerably.\n\nI find it funny that people think the kids who are on their smartphones all day \"are good at tech\". Just because you know how to use a car, does not mean you know how it runs.",
				"added": 1565409367
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 229,
				"body": "The answer is: Tor(so you dont want to get arrested for something you didnt do), MOAB, dont wander into random ZeroNet pages(check the link you click on), and stick to text places like ZeroTalk, or optional image places like ZeroMe. If you find the content, just scrub it off your machine.",
				"added": 1565199100
			},
			{
				"comment_id": 248,
				"body": "> [unconqueredsun](#comment_2_1AbcdjqfVPUHJsKbvTjzCJJ5isjs7wRZxk): I don't want to be involved in the legal battle of finding out though. [...]\n\nIt will be harder to be a problem is if you anonymize yourself. That would make it so your not fucked by the government for something you did not do.",
				"added": 1565239913
			}
		],
		"1565207629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 232,
				"body": "> [brianhanson2nd](#comment_23_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): What kind of dummy is trying to be annon online and then going around and letting people know about the annon stuff they do. If you don't let people know you use ZeroNet they can't associate you with anything.\n\nIt won't matter if they force you to use a ID online. This is the future they want. Don't be fooled. The EU is also trying the same. They will try in their power to track you.",
				"added": 1565207756
			},
			{
				"comment_id": 245,
				"body": "> [aspidochelone](#comment_7_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): It takes more than the media to do that ... thing is, they have more than the media.  Still, people should try to shove back when it seems pretty safe to do so.  I mean, the spies can insert kiddie porn on literally ANY computer they want for literally ANY reason, then declare a person a criminal for this heinous crime of \"possessing\" the wrong pattern of 1s and 0s on a machine that they don't even have the legal RIGHT to reverse engineer.  (Ask Joshua Schulte: https://theintercept.com/2019/08/04/whistleblowers-surveillance-fbi-trump/ )  A jury properly speaking should convict Microsoft or the NSA of the \"offense\" ... after all, it's their machine!  But are they going to do it because you used a forum, or save it for somebody they dislike more?\n\nYou lost me at sourcing The Intercept.",
				"added": 1565220743
			},
			{
				"comment_id": 247,
				"body": "> [bigbadbob](#comment_43_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): i hope so.  The idea of using my real name online has always creeped me out.   I was always told \"never put your info online\",   and then facebook said it was ok.   i didnt bite.\n\nI never understood why people put their real name on Facebook, with their pictures everywhere.",
				"added": 1565224211
			}
		],
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 235,
				"body": "Its not your post, its the flood from the censorship on the clearnet. This causes of course some extremists, but also some people from establishment trying to scare people away. ",
				"added": 1565210898
			},
			{
				"comment_id": 238,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_588_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i agree and not.apparently the medias are talking about zeronet, when they talk about something:it's to kill it. [...]\n\nVice(yuck) also made a article: https://news.vice.com/en_us/article/j5ye93/8chan-extremists-are-going-dark-heres-why-thats-dangerous",
				"added": 1565214821
			}
		],
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": [
			{
				"comment_id": 236,
				"body": "They even called Obama a \"right winger\" just for deporting.",
				"added": 1565213032
			},
			{
				"comment_id": 246,
				"body": "> [qf2ss4t5y3365](#comment_4_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): Giraffes bleed red too. I identify as a giraffe now. If you don't accept that I am a giraffe then you are a bigot.\n\nI identify as a attack helicopter.",
				"added": 1565224097
			}
		],
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 237,
				"body": "They actually believe that deplatforming works. They think it reduces the reach of these groups. All censorship does is create more push back. It is called the Streisand effect.",
				"added": 1565213195
			}
		],
		"1565214030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 241,
				"body": "> [xcape2net](#comment_171_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Three months ago, there were 3 to 5 posts per day, and they weren't about being fat or favorite sandwiches.  People talked about interesting and significant things.  The average IQ on ZeroTalk has fallen by 20 points since then.\n\nIts the bell curve. If you want more people to move to ZeroNet, you will need more average to above average IQ people. There is only so many \"smart\" people you can fit.",
				"added": 1565216761
			},
			{
				"comment_id": 243,
				"body": "> [mfs](#comment_8_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Would this not be ZeroVoat with a custom channel? [...]\n\nYes, ZeroVoat has sub-category system.",
				"added": 1565218817
			}
		],
		"1565203721_1MprJ7cBPUTpDquydwCvZGQAbGos8371aa": [
			{
				"comment_id": 242,
				"body": "> [port220irq5dma1](#comment_12_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): Oh no, 3D gun parts reeeeeee!!!!!!\n\nIts already on ZeroUp. Its been for awhile. Yeah, there is AR-15 there.",
				"added": 1565217004
			}
		],
		"1565219322_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 244,
				"body": "ZeroNet use Bitcoin cryptography, which is different, I think. Yeah, just looking it up, ZeroNet is probably fine. I am not sure, though.",
				"added": 1565219607
			}
		],
		"1565184146_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 249,
				"body": "> [bober](#comment_12_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): imagine a p2p wikipedia. suddenly the wikipedia mods/admins couldn't stroke their enormous epeens anymore\n\nNah, p2p is evil darknet people.",
				"added": 1565240049
			},
			{
				"comment_id": 250,
				"body": "> [kaffie](#comment_872_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): We have a couple of these. Kiwipedia has the ability to import article from wikipedia. ZeroWiki is a wiki explicitly made for ZN, and lacks the same kind of formatting that wikipedia has. Kiwipedia has a feature to import ZeroWiki articles. [...]\n\nNice. A Wikipedia importer to p2p.",
				"added": 1565240153
			}
		],
		"1565241348_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": [
			{
				"comment_id": 251,
				"body": "> [nowotny](#comment_2_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw): I've removed it and restarted ZeroNet, and it of course made a new users.json file. But on 08chan, for example, old posts I made are still recognized as mine \"(You)\", it shouldn't be doing this, should it?\n\n08chan is based off of a old buggy millchan.",
				"added": 1565242852
			}
		],
		"1565252472_1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u": [
			{
				"comment_id": 252,
				"body": "If you actually want to know, there is a reddit clone, ZeroVoat: http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/ I mean, it cant act like Reddit with its \"admins\" due to how ZeroNet functions, but it exists.",
				"added": 1565253633
			}
		],
		"1565245850_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 253,
				"body": "You can use a proxy that uses another computer as a server to host the content. Other than that, no.",
				"added": 1565253740
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 255,
				"body": "The authoritarian left is going to keep writing hit pieces on us. The Daily Beast is just a far left site that cherry picks things to make their enemies look bad, and also taking some things out of context.",
				"added": 1565288518
			},
			{
				"comment_id": 256,
				"body": "\"Even without the spotty reputation, Zeronet is harder to use than a conventional browser\"\nThis is the funniest line I read. Like comon, ZeroNet is not that hard...",
				"added": 1565289011
			},
			{
				"comment_id": 257,
				"body": "> [moor](#comment_180_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): they are mainstream msm funded by both sides, stop being a tool.\n\nThey arent funded by both sides when they bash one side. Get a grip. If by both you mean authoritarian, then yes.",
				"added": 1565289901
			},
			{
				"comment_id": 258,
				"body": "> [moor](#comment_181_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): What a good 'reporter' you are. she doesn't seem to have a clue to what zeronet is and what it was made for. likely she is one of these morons that praise the west for its liberties and condemns China for its censorship, and then it goes ahead to associate a platform for Chinese people to avoid censorship with 8chan and CP. good job.\n\nShe is the same one who made articles on \"YouTube radicalization\", and wanting to censor and deplatform people. I am sure she will love China censorship here.",
				"added": 1565290055
			},
			{
				"comment_id": 260,
				"body": "It has also been posted here: https://www.reddit.com/r/politics/comments/cnlpx9/8chan_refugees_worried_theyre_downloading_child/",
				"added": 1565290888
			},
			{
				"comment_id": 262,
				"body": "When do we get articles of \"think about the children\"? That would be funny.",
				"added": 1565292114
			},
			{
				"comment_id": 265,
				"body": "> [bigbadbob](#comment_75_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I wonder if she would even notice?\n\nNobody would know about what she notices again, unless she makes another article.",
				"added": 1565294960
			}
		],
		"1565272923_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": [
			{
				"comment_id": 259,
				"body": "> [microvito](#comment_2_18Sf57EgpHUvv4aKaMTGDnAikVjLa1XSPu): Alternatives: [...]\n\nShareTube I don't think is going to be up kept anymore due to the owner's issues.",
				"added": 1565290204
			},
			{
				"comment_id": 261,
				"body": "> [zerodud](#comment_15_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9): Bitchute still depends on hosting to function, retard, if bitchute.com goes away everything goes away, retard.\n\nEven though that is true, it has magnet links. If people actually used them(which people don't), it would be impossible to censor. People would be able to make new magnet links in no time.",
				"added": 1565291359
			}
		],
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 263,
				"body": "These last few days have been so funny with these journalists.",
				"added": 1565292452
			},
			{
				"comment_id": 264,
				"body": "> [scotcyguy2](#comment_13_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): They just want to know who they have to bully to try to get it shut down....but they can't mwhahaha\n\nI forgot where, but somebody actually said \"wait until they shutdown ZeroNet too\". These last few days man.",
				"added": 1565292717
			},
			{
				"comment_id": 269,
				"body": "> [port220irq5dma1](#comment_21_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): Journalists? More like URINALISTS, amirite? [...]\n\nDo I see a thequartering fan? Might be mistaken, but I think he adopted the term(Not sure).",
				"added": 1565313130
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 266,
				"body": "> [merovingian7](#comment_1_12sydgwQhhGrmcJVEt5WgKodUALnmLkWgf): I visited this place like 2-3 times before 08ch. There was nothing keeping me here. Now this is my home. I would also like to find pther places to visit. Maybe share your favorite places if you have any??>\n\nhttp://127.0.0.1:43110/big.kopykate.bit/ KopyKate, Great video site \nhttp://127.0.0.1:43110/0list.bit/ 0list for new sites popping up\nhttp://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/ like 0list, but for seeding new sites\nhttp://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/ ZeroDocs in p2p\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/ ZeroWiki(If you want to find some other sites)\nhttp://127.0.0.1:43110/1UPDatEDxnvHDo7TXvq6AEBARfNkyfxsp/ ZeroUpdate, updating ZeroNet in p2p\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/ ZeroUp Unlimited(ZeroUp but no limit) http://127.0.0.1:43110/1KiwiBCVBUcuypVm8FEmUW9YT6fJDXkN9r/ Kiwipedia, Wikipedia import to p2p, and making Kiwipedia articles \nhttp://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/ GIF Time for funny GIFs \nhttp://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF/ RVRE, great search engine\nhttp://127.0.0.1:43110/thunderwave.bit/ Thunderwave, a bit buggy, but cool p2p live chat(Not much users either)\nhttp://127.0.0.1:43110/164KTePHASdAB4o24XEZw1peQtwyjmFQxF/ IRC ZeroNet chat with game(Not much active users)\nhttp://127.0.0.1:43110/1DaXkbpBN7d9h78T5mjB2gTV9Ui46Bjwcv/ Snowden files\nhttp://127.0.0.1:43110/1BXLnSBQrCamckJfJoTfyyvpYXTvWy6rts/ Wikileaks files\nhttp://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/ 0Play Game Center\nhttp://127.0.0.1:43110/1EwpsssQGBrC2EZeYvxeQQoQbKNGivwDi4/ ZeroNet arcade games\nhttp://127.0.0.1:43110/zeropolls.bit/ ZeroPolls for fun polls\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/ IFS Intergalactic file sharing",
				"added": 1565297629
			}
		],
		"1565279104_1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa": [
			{
				"comment_id": 267,
				"body": "> [stralpha1](#comment_1_1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa): Hi, I created a user in ZeroID yesterday but today when I entered I was told that I had to create one and trying to put the same name told me that it was already in use. Any way to remember the user and always be able to use it? Thank you.\n\nOnce you register a ZeroID, it goes to your data/users.json file. You keep your ZeroID as long as you have the file and back it up. If its gone, its gone.",
				"added": 1565307813
			}
		],
		"1565287005_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 268,
				"body": "> [kaffie](#comment_901_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): We have torrent sites too. ZeroTorrent is one such example. [...]\n\nZeroTorrent is a clone of ZeroTalk, and has a search bar for torrents. Looks like a evolution.",
				"added": 1565307934
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 270,
				"body": "> [aspidochelone](#comment_16_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The day ZeroNet hit the news, I couldn't get through to set up this identity.  I imagine someone already spammed a huge number of ID requests? [...]\n\nYou can get a ID anywhere else, not just from ZeroID. The only problem is if you do not have a ZeroID, it won't work on the main \"offical\" sites like ZeroTalk, and only if sites add the support for the ID provider you use. By the way, if anybody wants it(KaffieID): http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz",
				"added": 1565328353
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 271,
				"body": "Have you tried deleting the site then re-downloading it? Sounds cliche, but might work. Some sites I used to have issues like that, I just re-downloaded and it fixed the issue.",
				"added": 1565330323
			},
			{
				"comment_id": 272,
				"body": "> [wejehteman](#comment_1_1EJorU3nHcCViXXzD7BkmyJzwgqxqC2Zuv): Deleted and redownloaded as per your suggestion. Stuck @2748 this time.\n\nIm not sure then. Try what 08admin said.",
				"added": 1565331191
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 273,
				"body": "> [xcape2net](#comment_229_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I can enable TOR always mode just fine,and everything works.  Then when I close zeronet and TOR, when I reboot I don't get any trackers.  I have to disable TOR always mode, shut down ZeroNet and reboot it.  Then I have to enable TOR always mode.  This somewhat defeats the purpose of Tor always mode, because my IP address is not hidden when I boot up the last time.  I remember someone else complaining about this recently, but I can't find that post--too much traffic on ZeroTalk to find much of anything now.\n\nThats odd, works for me fine when I reboot ZeroNet.",
				"added": 1565388885
			},
			{
				"comment_id": 276,
				"body": "By the way guys, if you see my previous messages disappear, its because my ZeroNet Android glitched where it deleted my previous messages. Might be my users.json files werent the same(due to new ID from KaffieID), so I put it on my phone now. Never happened before.",
				"added": 1565390351
			},
			{
				"comment_id": 278,
				"body": "> [bigbadbob](#comment_116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): im probably the most technically retarded person on the face of the planet.everything seems fine.    on debian so i gotta type \"sudo python3 zeronet.py\"i got green lights with no warnings.\n\n\"Technically retarded\" *Uses debian* I don't think your as retarded as you think you are. Try looking up Dunning Kruger effect. In short, smart people think they are stupid, and stupid people think they are smart.",
				"added": 1565392041
			},
			{
				"comment_id": 279,
				"body": "> [xcape2net](#comment_236_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): OK, now I remember the other problem I had.  The directory structure of the old and new versions of Zeronet are competely different.  I'm not sure where to put the data directory or  json file.\n\nIf you mean users.json then its in the data folder. Should be ZeroNet > Data > users.json",
				"added": 1565392691
			},
			{
				"comment_id": 282,
				"body": "> [bigbadbob](#comment_118_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so the data directory wont work with if zeronet upgrades?   only the user.json file is relevant?\n\nThe data directory has been the same for awhile now. If your on a really old ZeroNet then probably won't work. Also yes, the users.json will 100% work.",
				"added": 1565393410
			},
			{
				"comment_id": 283,
				"body": "> [xcape2net](#comment_238_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): OK, it took a while to copy the folder.  Now, when I type: sudo python3 /home/mint/ZeroNet-py3/zeronet.py with or without the TOR proxy and controller ports specified, I get an error message: [...]\n\nThen that means the data folder might not be compatible probably. Im not that great at Linux, so try questioning others here. You can try a new ZeroNet and just moving over the users.json, and start all your seeding sites from scratch.",
				"added": 1565395300
			},
			{
				"comment_id": 292,
				"body": "> [icr0](#comment_2_19vcqLBN7qJ2gnF5audiwNNnLTn7ypRrrq): gevent is probably an installable package. try pip3 install gevent\n\nThis",
				"added": 1565412485
			},
			{
				"comment_id": 300,
				"body": "> [xcape2net](#comment_259_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): ZeroNet uses TLS encryption.  Good enough to protect against everyone but the government.\n\nI never knew that ZeroNet used TLS(Probably because I don't read the docs much).",
				"added": 1565466184
			}
		],
		"1565339384_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU": [
			{
				"comment_id": 274,
				"body": "> [anshorei](#comment_16_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): I'm still bitter about KXO burning the land behind him when he left. It was pathetic. Have you ever asked nofish whether he'd agree to add KaffieID? I know it's kind of a different think because of the lack of unique ID's though.\n\nWeird. Is that why I cant find the site to seed?",
				"added": 1565389421
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 275,
				"body": "> [caryoscelus](#comment_183_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): hard\n\nJust put in the title of the Wikipedia article.",
				"added": 1565389517
			}
		],
		"1565391114_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 277,
				"body": "> [testuserpleaseig](#comment_9_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU): OP is a n00b nad new to reddit he dont even use the .old.reddit\n\nIm used to redirect reddit add-on taking me to the old reddit. I saw this on Tor browser and didn't notice. Great bait mate.",
				"added": 1565391919
			},
			{
				"comment_id": 281,
				"body": "> [styromaniac](#comment_923_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): he punish me for my enormous penis\nHow can someone not know that is a joke?",
				"added": 1565393035
			}
		],
		"1565342542_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 280,
				"body": "Try a 128GB SD card. Will make you set for awhile (or life in my case for my ZeroNet). I think adapters exist to do SD card to USB.",
				"added": 1565392844
			}
		],
		"1565407828_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N": [
			{
				"comment_id": 286,
				"body": "> [crazylime](#comment_11_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): sometimes it shows 3/12 trackers working, but doesn't help.  can't DL or publish.\n\nPut this in trackers in your configuration page(Top tree dots top left home page > Configuration) after the default trackers(I get 38/58 tracker usually).\nSource(Syncronite): http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/\n\nhttp://bt1.xxxxbt.cc:6969/announce\nhttp://bt-tracker.gamexp.ru:2710/announce\nhttp://explodie.org:6969/announce\nhttp://newtoncity.org:6969/announce\nhttp://open.acgnxtracker.com:80/announce\nhttp://open.acgtracker.com:1096/announce\nhttp://open.trackerlist.xyz:80/announce\nhttp://retracker.goodline.info:80/announce\nhttp://retracker.mgts.by:80/announce\nhttp://retracker.sevstar.net:2710/announce\nhttp://share.camoe.cn:8080/announce\nhttp://sub4all.org:2710/announce\nhttp://t.acg.rip:6699/announce\nhttp://t.nyaatracker.com:80/announce\nhttp://torrent.nwps.ws:80/announce\nhttp://torrentclub.tech:6969/announce\nhttp://tracker01.loveapp.com:6789/announce\nhttp://tracker1.itzmx.com:8080/announce\nhttp://tracker2.itzmx.com:6961/announce\nhttp://tracker3.itzmx.com:6961/announce\nhttp://tracker4.itzmx.com:2710/announce\nhttp://tracker.bt4g.com:2095/announce\nhttp://tracker.bz:80/announce\nhttp://tracker.files.fm:6969/announce\nhttp://tracker.gbitt.info:80/announce\nhttp://tracker.internetwarriors.net:1337/announce\nhttp://tracker.lelux.fi:80/announce\nhttp://tracker.opentrackr.org:1337/announce\nhttp://tracker.publictorrent.net:80/announce\nhttp://tracker.torrentyorg.pl:80/announce\nhttp://tracker.tvunderground.org.ru:3218/announce\nhttp://tracker.yoshi210.com:6969/announce\nhttp://vps02.net.orel.ru:80/announce\nhttps://1337.abcvg.info:443/announce\nhttps://opentracker.co:443/announce\nhttps://opentracker.xyz:443/announce\nhttps://t.quic.ws:443/announce\nhttps://tracker.fastdownload.xyz:443/announce\nhttps://tracker.gbitt.info:443/announce\nhttps://tracker.lelux.fi:443/announce\nhttps://tracker.nanoha.org:443/announce\nhttps://tracker.publictorrent.net:443/announce\nhttps://tracker.vectahosting.eu:2053/announce\nudp://9.rarbg.com:2710/announce\nudp://9.rarbg.me:2710/announce\nudp://9.rarbg.to:2710/announce\nudp://amigacity.xyz:6969/announce\nudp://bt.dy20188.com:80/announce\nudp://bt.reyesleon.eu:53/announce\nudp://bt.xxx-tracker.com:2710/announce\nudp://chihaya.toss.li:9696/announce\nudp://denis.stalker.upeer.me:6969/announce\nudp://exodus.desync.com:6969/announce\nudp://explodie.org:6969/announce\nudp://ipv4.tracker.harry.lu:80/announce\nudp://ipv6.tracker.harry.lu:80/announce\nudp://newtoncity.org:6969/announce\nudp://open.demonii.si:1337/announce\nudp://open.stealth.si:80/announce\nudp://opentor.org:2710/announce\nudp://opentracker.sktorrent.org:6969/announce\nudp://retracker.akado-ural.ru:80/announce\nudp://retracker.baikal-telecom.net:2710/announce\nudp://retracker.hotplug.ru:2710/announce\nudp://retracker.lanta-net.ru:2710/announce\nudp://retracker.maxnet.ua:80/announce\nudp://retracker.netbynet.ru:2710/announce\nudp://retracker.sevstar.net:2710/announce\nudp://torrentclub.tech:6969/announce\nudp://tracker2.itzmx.com:6961/announce\nudp://tracker4.itzmx.com:2710/announce\nudp://tracker-udp.gbitt.info:80/announce\nudp://tracker.0o.is:6969/announce\nudp://tracker.beeimg.com:6969/announce\nudp://tracker.birkenwald.de:6969/announce\nudp://tracker.coppersurfer.tk:6969/announce\nudp://tracker.cyberia.is:6969/announce\nudp://tracker.dler.org:6969/announce\nudp://tracker.ds.is:6969/announce\nudp://tracker.filemail.com:6969/announce\nudp://tracker.filepit.to:6969/announce\nudp://tracker.fixr.pro:6969/announce\nudp://tracker.iamhansen.xyz:2000/announce\nudp://tracker.internetwarriors.net:1337/announce\nudp://tracker.kiwifarms.net:8000/announce\nudp://tracker.lelux.fi:6969/announce\nudp://tracker.moeking.me:6969/announce\nudp://tracker.msm8916.com:6969/announce\nudp://tracker.nibba.trade:1337/announce\nudp://tracker.nyaa.uk:6969/announce\nudp://tracker.openbittorrent.com:80/announce\nudp://tracker.opentrackr.org:1337/announce\nudp://tracker.supertracker.net:1337/announce\nudp://tracker.tiny-vps.com:6969/announce\nudp://tracker.torrent.eu.org:451/announce\nudp://tracker.trackton.ga:7070/announce\nudp://tracker.uw0.xyz:6969/announce\nudp://zephir.monocul.us:6969/announce",
				"added": 1565408561
			},
			{
				"comment_id": 287,
				"body": "> [kingv](#comment_2_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N): Port: ClosedTor: AvailableTrackers: 0/41I don't know how I am still posting.\n\nIf your still posting, its probably working the seeding, just isnt reading it right. My ZeroNet Android has that problem with not reading my port being opened or closed right. Also, when I add all the new trackers, it usually takes a little bit till it ramps up. If you want to refresh the # of trackers ZeroNet sees is there, on the homepage, just on click the # of trackers. Otherwise, try putting it as a issue on the ZeroNet github. Im not sure, otherwise.",
				"added": 1565409079
			},
			{
				"comment_id": 290,
				"body": "> [kingv](#comment_3_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N): Whenever I click the # of trackers, all of the trackers say error(0 % success).\n\nYeah, im not sure. It again sounds like ZeroNet is working fine, just isn't detecting the # of trackers your actually connected to. ZeroNet Github: https://github.com/HelloZeroNet/ZeroNet/issues",
				"added": 1565409808
			}
		],
		"1565409411_1L2K2kRD9xSTdqyDsvmm8iiUVPdCK65tAY": [
			{
				"comment_id": 289,
				"body": "Thats normal. The main content changes to where you get updates for what your following on like ZeroTalk.",
				"added": 1565409492
			},
			{
				"comment_id": 291,
				"body": "> [kaffie](#comment_943_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Click on the various sites that it's showing and unfollow the pages. When you follow nothing it shows the default page, and then when you follow things it adds them to the page.\n\nI find even when I do not follow anything, it still does not show the default. I mean, it does not matter to me either way.",
				"added": 1565412209
			},
			{
				"comment_id": 293,
				"body": "> [kaffie](#comment_944_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm not really sure then, sorry. But yes, it's a normal intended feature of how that particular site works. You can create your own home page if you'd like (some users have done that).\n\nI know that I can make my own home page. Im just too lazy.",
				"added": 1565412974
			}
		],
		"1565420146_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 294,
				"body": "> [ratsmack](#comment_5_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): smh\n\nGo cry some more over a site being made.",
				"added": 1565458573
			},
			{
				"comment_id": 304,
				"body": "Updated zite. Make sure to clean history, cookies, and cache to make it work.\nNew features (Upgraded to ZeroTalk++ code, plus some extra things):\n- Votes start from 0.\n- Admin can now delete and edit other users posts and content\n- Support for images in posts and comments\n- Support for video and audio\n- The long format of the topic list. (The content is formatted and partially visible.)\n- Moderators can modify or delete any post from the UI.\n- Display the actual forum title instead of pretty useless title \"Newest topics\", and also instead of the \"Main\" link in the breadcrumb navigation.\n- Use the same colors for user names as in ZeroMe\n- Colorize the topic's creator name\n- Added support for KaffieID",
				"added": 1565472371
			},
			{
				"comment_id": 314,
				"body": "(Things were glitching, sorry if content was deleted)\n- Added click to load images with warning",
				"added": 1565497992
			}
		],
		"1565458487_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 295,
				"body": "ZeroTalk for privacy.",
				"added": 1565458620
			},
			{
				"comment_id": 299,
				"body": "> [aim64c](#comment_30_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Sort of on the metacrawler idea - a way of giving zites a way to 'front page' or catalog themselves beyond just a text listing would be kind of neat, as well as contain reviews/feedback.\n\nShould be able to clone ZeroSites with reviews in a way.",
				"added": 1565465459
			}
		],
		"1565459855_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 296,
				"body": "> [styromaniac](#comment_928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You need more peers.\n\nThats why im spreading this lol.",
				"added": 1565460152
			},
			{
				"comment_id": 297,
				"body": "> [styromaniac](#comment_929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/\n\nI put the zite there too already. I already know.",
				"added": 1565460468
			}
		],
		"1565456974_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 298,
				"body": "> [everybody](#comment_37_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): To Sticky a topic you must change in content.json file.You'll find in the admin sector:\"...\" : {  \"admin\": ....  \"sticky\": [\"....\",\"....\"],} [...]\n\nThanks.",
				"added": 1565463980
			},
			{
				"comment_id": 301,
				"body": "> [ssdifnskdjfnsdjk](#comment_890_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): How to stick the topic on zerotalk cloned site [...]\n\nZeroTorrent has a search function. http://127.0.0.1:43110/ZeroTorrent.bit/ I think it was cloned from the list you showed of other ZeroNet clones(or other way around). Yeah, from looking at the code, looks like ZeroTorrent was the first.",
				"added": 1565467279
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 305,
				"body": "Epstein \"killed himself\", just like how someone \"disappears\" when they expose the government.",
				"added": 1565472595
			}
		],
		"1565403304_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [],
		"1565480657_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 308,
				"body": "Nvm, works now.",
				"added": 1565481192
			}
		],
		"1565495084_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 309,
				"body": "> [crazylime](#comment_33_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): But you were able to publish here?  It's been all or nothing for me.\n\nI can publish everywhere else but one specific site for updating the content.json to peers",
				"added": 1565495187
			},
			{
				"comment_id": 310,
				"body": "> [crazylime](#comment_34_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n):  \n\nVia the UI by dragging the 0 to the left.",
				"added": 1565495320
			},
			{
				"comment_id": 311,
				"body": "> [crazylime](#comment_35_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): Not sure what dragging the 0 means.  But, what I do after changing content.json is refresh the site in the browser, then I get a button to Sign and Publish.\n\nThat gives me the same issue no matter how I Sign and Publish.",
				"added": 1565495492
			},
			{
				"comment_id": 312,
				"body": "Publish to peers keep circling:\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj/vivaldi_cw4PE3gOvI.png \nContent publish failed:\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj/vivaldi_XKm7C7Uueq.png",
				"added": 1565495530
			},
			{
				"comment_id": 313,
				"body": "FIXED IT BY REDOWNLOADING.",
				"added": 1565495756
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 315,
				"body": "Have I ever told you that I am god?",
				"added": 1565499806
			},
			{
				"comment_id": 316,
				"body": "> [bigbadbob](#comment_172_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): oh.. Great:) I have a couple questions.... Why God Why ? Why must you punish us?   and can i have my rib back?\n\nLife is boring without some drama. Its like playing a video game, and seeing what the NPCs will react with.",
				"added": 1565500439
			},
			{
				"comment_id": 317,
				"body": "> [bigbadbob](#comment_173_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): makes sense.   I knew it must be a game.    >Can i still have my rib back?\n\nNo.",
				"added": 1565500630
			}
		],
		"1565494134_1Cv5b38VHaK8XGixrtufnKWqZJiHqAne5v": [
			{
				"comment_id": 318,
				"body": "TOR is based on Firefox.",
				"added": 1565501785
			},
			{
				"comment_id": 319,
				"body": "> [542vg3](#comment_6_1Fi6FbNTzE6kZNEbR23FzcndyJh3RE9Nhx): yes, but firefox doesn't route its traffic over tor circuits by default\n\nYeah, I know that. I am just saying that they might as well use TOR.",
				"added": 1565501846
			},
			{
				"comment_id": 322,
				"body": "> [kizzie](#comment_1_1GANgPFh4DqZLncNoDXj8oUwECqyY62DDm): Use waterfox. Also ignore the millchan shills, 08 is a fork and not an outdated version. It is not suggested to \"upgrade\" to millchan latest, as there are regression bugs and the board owner is actively developing the zite.\n\nI mean, TOR is anonymous and work better than waterfox. Might as well if you want to be anonymous, with the benefits of the new Firefox Quantum. Waterfox main feature is to get rid of Firefox spyware. If you really want to get rid of all spyware, might as well go the full mile.",
				"added": 1565503309
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 320,
				"body": "The average IQ in the world is actually dropping. https://www.sciencealert.com/iq-scores-falling-in-worrying-reversal-20th-century-intelligence-boom-flynn-effect-intelligence",
				"added": 1565502230
			},
			{
				"comment_id": 347,
				"body": "> [robione](#comment_286_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): You have to be smarter than smart. Actually stupid smart, so you can market to and lead the stupid to clean water.\n\nYou need to break hold of mind share too, which is not easy.",
				"added": 1565685834
			}
		],
		"1565449212_1G2nXDHaHSiL2SV5w9jy1tWddBS5EegZMw": [],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 323,
				"body": "> [kaffie](#comment_988_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just google around for august 11th predictions, terrorist attacks, etc. Tons of predictions and foreshadowing about this date.\n\nYou should try moving to DuckDuckGo or some other privacy oriented search engine.",
				"added": 1565510862
			},
			{
				"comment_id": 326,
				"body": "https://www.kron4.com/news/bay-area/pedestrian-struck-killed-in-san-francisco-3/ I know this happened.",
				"added": 1565549161
			},
			{
				"comment_id": 327,
				"body": "> [bigbadbob](#comment_187_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): woman was struck by a taxi.    OMG IT'S HAPPENING!!!\n\nI am not saying it did. Your taking my words out of context.",
				"added": 1565550522
			},
			{
				"comment_id": 340,
				"body": "> [libertario](#comment_1_1NR75UCuhd6qS5ibDyo5WYXE8zaRZGncrs): fucking EU laws...\n\nIf the EU is blocking you, just use TOR or a VPN.",
				"added": 1565595120
			}
		],
		"1565505415_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 324,
				"body": "You mean the year Nostradamus predicted will happen? Didn't happen yet.",
				"added": 1565511982
			}
		],
		"1565549849_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 328,
				"body": "> [memesadler](#comment_21_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I'm having problems connecting. \"Use Tor meek bridges for tracker connections\" button doesn't even help. Anyone know the fix off the top of their head? Searching is a pain.EDIT: and then it starts working, I think, but not sure about that error in general.\n\nTor has been having issues for me too recently on ZeroNet. I am not sure why. I think the network might be congested. I also had the same \"Use Tor meek bridges for tracker connections\" on another site.",
				"added": 1565550657
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 329,
				"body": "They are probably lurking till the right thread or post to put in their articles.",
				"added": 1565551046
			}
		],
		"1565527640_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 330,
				"body": "There are IRC chats that you can clone. \nZeroChat(original): http://127.0.0.1:43110/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg \nZeroMedia: http://127.0.0.1:43110/12qKywomfW5Hj5sQPYTH9wFQVrWzgaJj66",
				"added": 1565551258
			}
		],
		"1565552295_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 331,
				"body": "> [allballsnobrawn](#comment_1_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): Hmmmm...I had 33 of 99 trackers active before trying this...Now it's been saying Trackers waiting for about 35 minutes....\n\nIf it dosent work for you, then change to default. It works fine for me. Since it is more trackers, sometimes it takes a little longer to ramp up(35 minutes is wayy to long though).",
				"added": 1565557906
			},
			{
				"comment_id": 332,
				"body": "> [allballsnobrawn](#comment_2_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): These were the trackers that were connected successfully before...https://tracker.fastdownload.xyz:443/announcezero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441https://tracker.nanoha.org:443/announcehttp://tracker.yoshi210.com:6969/announcehttp://open.trackerlist.xyz:80/announcehttp://tracker01.loveapp.com:6789/announcehttp://tracker2.itzmx.com:6961/announcehttps://opentracker.co:443/announcehttp://explodie.org:6969/announcehttp://tracker.gbitt.info:80/announcehttp://retracker.sevstar.net:2710/announceudp://tracker.coppersurfer.tk:6969http://tracker.files.fm:6969/announcehttp://tracker.bt4g.com:2095/announcezero://boot3rdez4rzn36x.onion:15441http://tracker1.itzmx.com:8080/announceudp://104.238.198.186:8000http://tracker.torrentyorg.pl:80/announcehttp://tracker.opentrackr.org:1337/announcehttp://tracker.internetwarriors.net:1337/announcehttp://t.nyaatracker.com:80/announcehttp://tracker.tvunderground.org.ru:3218/announcezero://2602:ffc5::c5b2:5360:26312https://t.quic.ws:443/announcezero://116.203.143.118zero://216.189.144.82zero://51.15.54.182zero://100.36.141.97zero://144.34.215.231https://tracker.publictorrent.net:443/announcehttps://opentracker.xyz:443/announcehttp://tracker3.itzmx.com:6961/announcehttp://retracker.goodline.info:80/announcehttp://share.camoe.cn:8080/announcehttps://tracker.vectahosting.eu:2053/announce [...]\n\nI get around 83/113 without TOR and around 40/63 with TOR on. Some of the trackers don't work anymore, but its odd how yours is having issues. I think TOR network on ZeroNet has been having issues since people like me been reporting some stuff. Might be that.",
				"added": 1565559130
			},
			{
				"comment_id": 336,
				"body": "> [bigbadbob](#comment_202_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): i have 14/14...   im clearly missing the point somewhere.   What is a healthy amount?\n\nThe point is to up the number of trackers for if the ZeroNet trackers go down. I currently have 90/114, so that makes it more likely I will still have peers than you. This is so anybody won't just take down the ZeroNet trackers and we won't have trackers.",
				"added": 1565575680
			}
		],
		"1565560390_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 333,
				"body": "> [styromaniac](#comment_944_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Images aren't showing.\n\nThis.",
				"added": 1565561723
			},
			{
				"comment_id": 356,
				"body": "Some constructive criticism: When a new forum thread is made on ZeroCryptTalk, clicking on the title on the ZeroNet homepage(ZeroHello) does not go to the forum. Also KaffieID if you want less centralized weak point. Its up to you though with more ID providers.",
				"added": 1565723066
			}
		],
		"1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 334,
				"body": "Whoever put KxoID into ZeroTalk should know, or maybe nofish.",
				"added": 1565562088
			},
			{
				"comment_id": 438,
				"body": "> [ssdifnskdjfnsdjk](#comment_928_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): SUCCESS(at least partial 🌸):I have upgraded (in my site content.json replace clonned_from address and click Upgrade in site's 3dots menu on ZeroHello) my ZeroTalk clone to the ZaroTalk++ by @geekless and then in my site data/users/content.json i replaced:   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]by   \"cryptoid.bit\": [\"18143WPue3rQykNaopx5KJKzYmaYhCjqhv\"],   \"kaffie.bit\": [\"1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p\"],   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\",\"18Mt3CWBpiqJBLsPSu5JxB4B9MeaSwhyJ\"],   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]and signed/published data/users/content.json file in site's menu (corner button, drag to the left,scroll down)RESULT: these worked. Millchan, nanasi, zerovoat IDs NOT worked though... Unsure why my normal, earlier ZeroTalk clone not worked with kaffie ID (as i described earlier in this topic).\n\nI did this on my ZeroTalk clone.",
				"added": 1567373950
			}
		],
		"1565571217_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 335,
				"body": "For me(In US), 1,071 for US, 91 for China for my peers. Total of 6,000 peers in stats page.",
				"added": 1565572938
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 337,
				"body": "> [qspitzer](#comment_47_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): AFAIK nothing like that exists on ZeroTalk\n\nI think you missed the troll bait.",
				"added": 1565577654
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 338,
				"body": "The day 4chan goes down is the day ZeroNet will get the biggest influx of users its ever seen, which wouldn't be happening anytime soon.",
				"added": 1565591927
			},
			{
				"comment_id": 341,
				"body": "> [bigbadbob](#comment_214_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): From what ive seen the shills demonize this place on 4chan.\n\nThe 8chan Q people did too. It dosen't stop a massive flood of people from the news. What makes people join ZeroNet is coverage.",
				"added": 1565595255
			}
		],
		"1565565971_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 339,
				"body": "> [styromaniac](#comment_948_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No. Some work differently. KaffieID is fully decentralized.\n\nI just wish ZeroTalk clones would just work with adding other ID's. No solution yet.",
				"added": 1565592221
			}
		],
		"1565680565_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 342,
				"body": "Seems like I found a loophole. Making another content.json file and then publishing that. Wonder if this extends to adding other IDs.",
				"added": 1565681308
			},
			{
				"comment_id": 343,
				"body": "YES IT WORKS FOR OTHER IDS TOO.",
				"added": 1565681593
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 344,
				"body": "Nofish should be able to go to antivirus companies and say its a false positive.",
				"added": 1565684850
			}
		],
		"1565669207_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 345,
				"body": "Typically if you need something to keep yourself productive, your not doing it right. It should come more natural. Its the same with motivation. You will do it if you really wanted to.",
				"added": 1565684991
			},
			{
				"comment_id": 425,
				"body": "> [bigbadbob](#comment_480_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): what comes first? Action or motivation?\n\nIt depends on the situation. You can be in a shit place, and want to be motivated to do better because your in a shit place. Its like I said, you do it only if you really wanted to. You can actively hate cleaning, but end up doing it and getting the will to do it. In general, motivation comes first though. The power to do something, is from within. ",
				"added": 1567322884
			}
		],
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 346,
				"body": "Thats been a issue for me for awhile. Whenever I upload on places like KopyKate, ZeroUp, it does not put me as a seeder. This cuts off anyway for me to seed things I post and want to spread.",
				"added": 1565685264
			}
		],
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 348,
				"body": "> [kaffie](#comment_1022_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I remember fine. p2p filesharing people are horribly against capitalism, by nature.\n\nYou don't need to be anti-capitalist to love p2p filesharing. Some people see's its benefits in lowering server costs to distribute stuff(some companies do this), and others do it to torrent because they do not want to pay, or because they hate Hollywood.",
				"added": 1565686411
			}
		],
		"1565682447_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 349,
				"body": "I am about to go to sleep, so if there is no peers, thats why. It says 13 peers now, but not sure if that will hold up.",
				"added": 1565686504
			},
			{
				"comment_id": 350,
				"body": "> [caropc6](#comment_27_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT): I'll be one more peer my friend, because I want people to add support to decentralized systems like KaffieID, THANK YOU for the work. [...]\n\nThank you for seeding.",
				"added": 1565718486
			},
			{
				"comment_id": 382,
				"body": "- Added support for CryptoID",
				"added": 1565989288
			}
		],
		"1565715792_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 354,
				"body": "> [buckfruck](#comment_2_12sqywVGbwufXxaZEHhiNATtJP5pipQ2XB): I'm running on my zeroid and it still is giving me a X > 0 error\n\nProbably because 08chan owner did not use the loophole I found to make content.json changes work for everyone.",
				"added": 1565720901
			},
			{
				"comment_id": 355,
				"body": "> [buckfruck](#comment_4_12sqywVGbwufXxaZEHhiNATtJP5pipQ2XB): How does I into content.json?\n\nYou cant, it has to be the site owner.",
				"added": 1565721364
			}
		],
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 352,
				"body": "Your late to the party on why Discord is shit. If you want a voice chat application, just use mumble. If you want decentralized chatting, use Riot/Matrix.",
				"added": 1565720437
			},
			{
				"comment_id": 353,
				"body": "> [cunny](#comment_3_1FSDJqLBYJ9Ej8SQGgPCuMadPBpi45cXKW): Adding onto this: Be sure not to sign up on matrix.org as it's basically overloaded and slow as shit. Check https://www.hello-matrix.net/public_servers.php\n\nI recommend this server: https://www.poddery.com I been using it for awhile.",
				"added": 1565720740
			}
		],
		"1565721504_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 357,
				"body": "> [pexo](#comment_126_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): \"cert_signers\": { [...]\n\nThanks.",
				"added": 1565723390
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 363,
				"body": "If you really want to legit destroy ZeroNet. Get a spare HDD, encrypt, destroy the whole thing, then physically destroy the HDD. If you want to be 100% sure, just wipe it about 6 times, put a magnet on it, burn it, then piss on it.",
				"added": 1565851718
			}
		],
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 364,
				"body": "Section 230 protections should be taken away from these big tech companies. They have reigned for too long. They say they are not a publisher, yet act like one. You also cite CNN, and other MSM sites who actively defend these big tech companies. Great video: https://youtu.be/inap_Z2jHDE Facebook, Google, Twitter have been abusing section 230 protections while censoring conservatives. There has been numerous studies and leaks showing this. We need to reign these companies in. These companies blatently control the political debate. Maybe this executive order wouldn't be drafted if you stupid liberals wouldn't praise banning people, say \"make your own site\", then try to shutdown the competition?\n\nYou clearly keep on ignoring whistle blowers who keep on showing what Google does behind the scenes, and then get mad at this. This is all on you guys for making this happen. But go ahead, and keep on defending these companies. The truth is that tech companies are the new robber barons.",
				"added": 1565947515
			},
			{
				"comment_id": 365,
				"body": "> [qspitzer](#comment_58_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): exactly. a majority of the us had voted for hillary, but trump still won in the end\n\nBoohoo, you did not get the result you want from a select small big cities. Cry me a river.",
				"added": 1565947728
			},
			{
				"comment_id": 366,
				"body": "> [aspidochelone](#comment_79_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Honestly, I think Trump just likes to keep the Supreme Court busy with make-work.  This is such an absurd overreach I can't see how a court would rule in his favor.  But the credibility of the U.S. on .... ANYTHING ... just keeps going down when you thought it couldn't get lower.  How soon until Chinese internet companies start advertising free speech forums for Americans?\n\nThey started doing that recently because they have been more free than the stupid big tech companies, ironically. The only way for people to fight the monopolization with Google is to use Chinese services that are actually more free. Only 2nd option is to use crypto, because apparently places like Bitchute cannot use any payment processors from MasterCard and the like. And then you get mad when the government tries to step in to stop these blatant monopolizing companies?",
				"added": 1565948524
			}
		],
		"1565977255_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 367,
				"body": "Is the ZT Zite Dev supposed to have \"Initial sync in progress...\" taking so long?",
				"added": 1565979607
			},
			{
				"comment_id": 368,
				"body": "The topic link you showed does not even work. Your site link just brings me to \"Welcome to your own forum! :)\" with no topics of the past. Are you sure your content.json publishing is correct?",
				"added": 1565979765
			},
			{
				"comment_id": 369,
				"body": "> [trevorlaneray](#comment_84_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Speaking of content sizes, I'm running up against my ZeroTalk size quota.Currently sitting at 44.4K/50K used, as of this post.It says to contact nofish to raise my limit, but I don't want to bother them with something so trivial...I read somewhere that they made a script to do this automatically when someone gets close to their limit; should I trust that this is the case, or bite the bullet and contact nofish?\n\nGo to data/users/content.json and up the limit there.\n\n```\n\"bitmsg/.*@zeroid.bit\": {\"max_size\": 3000000}\n```\n^ That is for the default limit\n\n```\n\"permissions\": {\n   \"bad@zeroid.bit\": false,\n   \"nickwa@zeroid.bit\": {\"max_size\": 3000000}\n}\n```\n^ This is for each user.\n\n```\n \"settings\": {\n  \"admin\": \"nofish\",\n  \"admin_href\": \"http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=nofish\",\n```\n^ If you want to change admin from nofish to you, go to your site's main directories content.json, and change this",
				"added": 1565982053
			},
			{
				"comment_id": 370,
				"body": "> [trevorlaneray](#comment_85_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Wait, whuuuut?We can increase our own post size quota? Mind. Blown....Would this increase it just for me, clientside? Would others be able to see posts I make after I exceed ZeroTalk's default 50KB?\n\nYeah, its supposed to do it for everyone, but sometimes does not even publish to other peers. I can share the loophole I used to fix it for me if it does not, but others did not have the same success.",
				"added": 1565982534
			},
			{
				"comment_id": 371,
				"body": "> [crazylime](#comment_110_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): @nickwa I know how to do that.  but there is no data/users yet.  the 21M is for the site files in the root folder.\n\nI did that to trevorlaneray to help him.",
				"added": 1565982549
			},
			{
				"comment_id": 372,
				"body": "> [trevorlaneray](#comment_86_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Just tried to create a thread on ZT Zite Dev, in order to trigger the creation of a data/users folder.(At least, I assume that's what you meant.)I get this weird error though:\n\nHave you tried changing ```\"cloned_from\": \"1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT\",``` in the main directory to another ZeroTalk clone, and upgrading the code? Might make a content.json, not sure.",
				"added": 1565983198
			},
			{
				"comment_id": 373,
				"body": "> [trevorlaneray](#comment_87_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Interesting. I'll try that.\n\nIf you want a easy one, 1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y. Its ZeroTalk++. You can always downgrade back to ZeroTalk if you want. If that does not work, try making your own content.json file.\n\n```\n{\n \"files\": {},\n \"ignore\": \".*\",\n  \"modified\": 1436226671.535, \n \"signs\": {\n    \"1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT\": \"HMS7KltLokl44coJqRBPmGTGVpY48H2nbayXOsCo21J9DtwIUCf47O6WNJdW6WUgObV/NzHr0yiCWey6uDmxlLo=\"\n },\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ],\n   \"kxoid.bit\": [ \"12F5SvxoPR128aiudte78h8pY7mobroG6V\" ]\n  },\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n        \"max_size\": 20000\n   },\n      \"bitid/.*@zeroid.bit\": { \"max_size\": 40000 }, \n      \"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 }\n  },\n  \"permissions\": {\n   \"bad@zeroid.bit\": false,\n      \"nofish@zeroid.bit\": { \"max_size\": 100000 }\n  }\n }\n}\n```\n^ This is a example data/users/content.json file if you want to make one. Just change the signs to what it is in your main directory content.json signs. That might work. I am not sure though.\n\nIf that does not work also, try what worked here http://127.0.0.1:43110/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565983536_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n",
				"added": 1565983353
			},
			{
				"comment_id": 374,
				"body": "> [crazylime](#comment_112_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): The issue is the original site size, not data/users.  There is no data/users for that site, yet.   [...]\n\nIsn't a warning to up the site limit by default? I do not even see a warning from your site because it says it barely uses any storage.",
				"added": 1565984408
			},
			{
				"comment_id": 375,
				"body": "> [gitcenter](#comment_584_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I believe they were talking about the original ZeroTalk.\n\nHe was clearly having a problem with the limit, and needing to up it. By default, it says contact nofish, so he thought to contact him. So I just advised him how to up the limit and change that message to him for his users. You don't want your ZeroTalk clone to ask nofish to up the limit when nofish is not even the owner/admin of it.\n\n> No, we can't.\n\nYou can clearly up the bitmsg limit. I did it on my ZeroTalk.",
				"added": 1565984633
			},
			{
				"comment_id": 376,
				"body": "> [gitcenter](#comment_585_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I believe there was some confusion between you (though I shouldn't have just bumped into this thread, sorry for doing that, I just wanted to help you with some development problems). I think trevorlaneray was saying that he has posted too much on Talk.ZeroNetwork.bit, and you parsed \"my ZeroTalk size qouta\" as \"(my_ZeroTalk).size_quota\", not \"ZeroTalk.my_size_quota\" (uh).\n\nLooks like I did the wrong answer haha. Got confused there.",
				"added": 1565984861
			},
			{
				"comment_id": 378,
				"body": "> [trevorlaneray](#comment_87_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Interesting. I'll try that.\n\nIf you want to up your limit on ZeroTalk, you need to contact nofish. There is no other way.",
				"added": 1565984992
			},
			{
				"comment_id": 379,
				"body": "> [crazylime](#comment_114_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): This is one reason I create new ZeroTalk topical sites so we don't run into limit of ZNT main user space.  I have 2 now.  ZN Sec and ZT Zite Dev\n\nZN Sec limit says 40k max though on my end. Does it continue to go past that, even though the UI says 40k max?",
				"added": 1565985162
			},
			{
				"comment_id": 380,
				"body": "> [gitcenter](#comment_587_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): By the way, there is Unlimit Talk.\n\nYeah, I know there is one. Does upgrading code to Unlimit Talk also remove the limit? Just want to know.",
				"added": 1565985656
			},
			{
				"comment_id": 381,
				"body": "> [gitcenter](#comment_588_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Not sure about this. However, AFAIK, the only change was to modify \"max_size\" from data/users/content.json.\n\nDid the person just put a really big number like me? Haha. EDIT: Looks like they did",
				"added": 1565985750
			}
		],
		"1565966228_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 383,
				"body": "Its good only if you like console games on the go. Sure, the resolution might not be as good, but it being portable is good enough for some people. The only reason to have it only docked is if you like the exclusives.",
				"added": 1565989637
			}
		],
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 384,
				"body": "> [xcape2net](#comment_304_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Go back a month in ZeroTalk, and you will see that ZeroNet was a friendlier place before the invasion of the 8Chan people.  :(\n\nI honestly see less of a cesspool here than on Twitter. ZeroNet is pretty friendly.",
				"added": 1565989930
			}
		],
		"1565994187_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 385,
				"body": "Yes I can",
				"added": 1565994185
			}
		],
		"1565992631_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 386,
				"body": "> [gitcenter](#comment_590_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Heads up: This chat is not actually live, it has a 30 second delay. If you want instant chat, you need PeerMessage plugin and use a site that supports it. 0Play Game Center chat is a good example.\n\nI just took the name and cloned it. If anybody wants to know. There is nothing special, just original with extra IDs. In my experience, this chat had almost no delay for me, even on my phone with someone chatting to me. My phone does not have PeerMessage, but my PC does.\n\nBtw, I thought KxoNetwork was gutted by the owner?",
				"added": 1566025843
			}
		],
		"1565994004_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 387,
				"body": "> [gitcenter](#comment_595_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): While adding more ID providers is a good idea, I think that we shouldn't separate ZeroSites into several, uh, sites, which you can't find on ZeroSites (lol). I think that KxoID is ready to be added to the original ZeroSites. nofish: What do you think?\n\nWouldn't the solution be a way to merge different lists together? We are going to rely on a increasingly centralized list of sites.",
				"added": 1566026217
			}
		],
		"1566153558_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 388,
				"body": "You can upload it yourself if you can find it.",
				"added": 1566161693
			}
		],
		"1566141722_12wsdvQbd5L9bTBKXGgYazbFcHNegJUNfG": [],
		"1566158336_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 390,
				"body": "Feminism is just women superiority movement. They say they are for equality, yet frequently shutdown any input of men's issues, and try to illegally shutdown any men's meetups of these issues.",
				"added": 1566162088
			},
			{
				"comment_id": 392,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_816_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"suicide is illegal\" if you're dead, who's gonna put you in jail?\n\nThey don't even arrest you when you attempt suicide. They just put you in a mental ward and force drugs. That technically is like a prison though.",
				"added": 1566162473
			},
			{
				"comment_id": 393,
				"body": "> [kaffie](#comment_1042_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's baffling to me how men seem to be the mental equivalent to literal cave men.\nIt's baffling to me why women are so into group think for thousands of years, and due to it, having less geniuses than men. Due to this IQ effect, there is more dumb men then dumb women, but also more geniuses. Even though that is the case, men on average have 2-4 points higher IQ due to mental maturity taking longer. So in essence, men are also more mature. Women's maturity peaks at teenage years, and never grows.",
				"added": 1566192832
			},
			{
				"comment_id": 394,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_827_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i would say women are WAY MORE INTELLIGENT in daily life\n\nThat is only because women have evolved to be social creatures. Higher intelligence correlates to lower social understanding. Geniuses have a higher rate of lower social understanding. Even though that is the case, that social understanding can be overtaken by intellect of primal ways people operate. So in essence, women only operate on primal evolutionary social understanding. This does not make them \"more intelligent\". It just makes them fit in more. That is  why you have the average IQ clutter effect.",
				"added": 1566193622
			},
			{
				"comment_id": 395,
				"body": "> [bigbadbob](#comment_356_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): h3bhkj5gqz4n3pjm:  [...]\n\nDo you have MOAB filter for users for him on? Thats why. I turned it off since I diagreed with some of the stuff Styromaniac put on.",
				"added": 1566193861
			},
			{
				"comment_id": 399,
				"body": "> [caryoscelus](#comment_207_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Well, one thing in common is that any \"feminism\" is supposedly pro-women, so if you're misogynist, that's not for you\n\nThat is a stupid argument. Being anti-feminist is not anti-women in any way. Is the woman who invented domestic abuse shelters anti-women because she is anti-feminist? Is she anti-women when she was harassed, and death threats for trying expanding the shelters to men? Are these people anti-women for having their livelihoods destroyed? There is a reason she was even interviewed by MRAs. The woman who invented domestic abuse shelters. Just think about it. When I remember the name, I will share. Just found it: Erin Pizzey. https://youtu.be/GklT1FQpqHo https://youtu.be/G7CTWNoykyQ Is it anti-women when the people you \"Feminists\" praise are now MRAs?\n\nJust admit it: Feminism is women superiority and not for equality. Even the roots are gone with them being MRAs now. I can name more examples.",
				"added": 1566205501
			},
			{
				"comment_id": 401,
				"body": "> [caryoscelus](#comment_208_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Lol, can you read what other people write or only to react to keywords? I said that feminism is not for you if you are misogynist, not the other way around (\"you're misogynist if you don't like feminism\"). If you just want to vent your anger at some story, there's a whole zeronet for you to share it\n\nI did read the whole thing, and I was not angry. The way you phrased it made it seemed like you were calling people who were not for it that. You know, since Feminists love to phrase it like that, to push a agenda. \"Oh, not all feminists are women superiority!\", and then call people who do not like Feminists \"misogynists\". So \"its a abstract, so you can't just be anti-feminists since some are for equality!\". I am sorry if I misread it in that way. ",
				"added": 1566241409
			}
		],
		"1565416035_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [],
		"1566147969_1GmeqFDH3CreaouRZZeg3WuC3JY1mRmXmr": [
			{
				"comment_id": 396,
				"body": "What do you mean by ZeroNet file? The whole site in ZeroNet? If you mean a regular file like mp4, or something like file sharing, just use a torrenting client to make it. Same with a entire site. The only problem is the files don't update if your seeding a ZeroNet site for the magnet link. The magnet link won't have new files since magnet link will have the info of the old files. I might be wrong, but I think that will happen.",
				"added": 1566194359
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 397,
				"body": "> [almostsoul](#comment_21_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): I was thinking about Seth Rich earlier today, and how sadly he died for nothing. The DNC leaks have affected absolutely nothing, and their party has not changed in the slightest even after the revelations. It's at least a lesson in the futility of political change.\n\nWhy would it change if the media is in bed with the establishment? You have them squashing down people as \"conspiracies\", and reference FBI for calling us \"terrorists\". It happened with Epstein too. You then have people who are Democrat believe in these same institutions who do that. The only way for people to wake up is to expose the media, but then we are called \"against the free press\". Why would the DNC or anything like that change if the people believe in the corrupt institutions? Even when some people knew of Hillary corruption with taking away votes from Bernie(even a court slapped the DNC on the wrist), you have people calling Bernie for Russia, and believing it. Its bonkers.\n\nWant to destroy any uprising in your party? Just call them in bed with Russia. You can claim all you want about corrupt Republicans, but the truth is according to statistics, the Democrats believe more in the media that peddles this.",
				"added": 1566202342
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 398,
				"body": "I thought you was serious for a second with that title.",
				"added": 1566202831
			}
		],
		"1566239205_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 400,
				"body": "Did you wait till ZeroNet downloaded all the ZeroMail files, and then refreshed the page? That happens to me because it did not even load all the files when first downloading the site. Check ZeroHello, and wait till it has all the files downloaded. It happened to me multiple times now when deleting and then downloading the site again.",
				"added": 1566239512
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 402,
				"body": "There is a risk of using JavaScript in ZeroNet for exposing your IP, but hopefully what I say can lower your risk if you wanted the info:\n\nUse ZeroNet through TOR network(to hide P2P IP), and then use TOR browser to access the ZeroNet sites(to hide IP to links to clearnet). Use NoScript, and then temporarily whitelist 127.0.0.1:43110. NoScript will block any clearnet(Not ZeroNet) JS, so your IP will not be leaked. Also, VPN+TOR has some weaknesses. Its best to do Your computer -> encrypt with VPN -> Tor -> VPN -> internet.  If you want a good rundown on privacy: https://proprivacy.com/guides/using-vpn-tor-together",
				"added": 1566242041
			},
			{
				"comment_id": 403,
				"body": "> [ascetic](#comment_14_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): So with VPN-->Tor-->Zeronet am I safe? Or is Zeronet a security risk? [...]\n\nAnything online is a security risk for showing your information. The issue is that VPN > Tor > ZeroNet exposes you if the exit node spies on you. Its just by chance if someone exposes you.",
				"added": 1566259978
			},
			{
				"comment_id": 404,
				"body": "> [ascetic](#comment_15_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): At the risk of revealing my methods, I have a chromebook that I deleted the ChromeOS off of and installed Linux on it. Whenever I start my computer I log into my vpn via terminal. Once I am connected to my VPN i open up the tor browser, and start Zeronet, which I always run within the tor browser with tor set to (always). The only weak link I can find is this chain is my VPN, but this article is a little confusing to me. It says that my IP address is visible to my VPN when I connect to tor, however, wouldnt my IP address be visible to my ISP anyways if I connected to tor without my VPN? Furthermore, yes, my VPN would be able to correlate that my real IP address is connecting to the tor network, but wouldn't the Tor Browser prevent any further information from being collected?\n\nYour IP is visible to your VPN since your VPN is the first thing you connect to. Your ISP would not know what you are doing if your using a VPN since it is being encrypted. Using VPN > Tor means that VPN will only see Tor on exit. Doing Tor > VPN after that means you will not be exposed by people spying on youf rom exit node. Also, your ISP only sees your connecting to Tor if you just connect straight to Tor, not the info inside of Tor due to the nature of nodes(same with the VPN). Your ISP always knows your IP anyways, but the point is to encrypt the traffic so your ISP will not know what you are doing. The only main weakness of doing VPN > Tor > VPN is if the VPN provider gets compromised by government since all your info is centralized on the VPN.",
				"added": 1566260302
			},
			{
				"comment_id": 405,
				"body": "> [bigbadbob](#comment_378_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so straight to tor into ZN should be ok if i just stay in ZN?  vpn would be useless?   Just larping.. nothing illegal. lol\n\nMajority of the time is fine, but like I said, somebody can expose your information. Its if someone spies on the exit node. \"No protection from malicious Tor exit nodes. Non-HTTPS traffic entering and leaving Tor exit nodes is unencrypted and could be monitored. Unless some additional form of encryption is used (such as HTTPS), this means that anyone running the exit node can spy on users’ internet traffic.\"\n\nEDIT: Updated incorrect info.",
				"added": 1566260978
			},
			{
				"comment_id": 406,
				"body": "> [bigbadbob](#comment_380_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Anyone spying on the exit node without encryption still would not be able to trace it back to my ip unless they were nsa or something is my understanding.   Doesn't mean my understanding is correct, lol\n\nWell a malicious person can if they wanted to. The only thing I am not sure on is if ZeroNet is encrypted.",
				"added": 1566264315
			},
			{
				"comment_id": 407,
				"body": "> [bigbadbob](#comment_381_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so vpn+tor\n\nThe VPN does not encrypt the connection once it goes through TOR. It has to be HTTPS or something. Its a false assumption to think a VPN encrypts anything once it leaves the VPN. Once something leaves the VPN, it decrypts. It decrypts before going to TOR. So the issue of encryption will be whether or not it is HTTPS for a website. The whole point of the VPN is to make your ISP not see your traffic.",
				"added": 1566264413
			},
			{
				"comment_id": 408,
				"body": "> [bigbadbob](#comment_382_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): One thing thats a mystery to me..  cause my ignorance.  is we actually pass through tor to get to ZN or is it within tor?\n\nIts PC > ISP(Only sees Tor) > Tor Network > 2nd ISP(Only see's Tor if 2nd PC is using it too) > PC. With VPN its PC > ISP > VPN(Now ISP does not see Tor, but sees VPN) > Tor(VPN now sees Tor, but Tor sees only VPN IP address). The only problem like I said is through the Tor network if its not encrypted, can be caught. Using VPN before Tor benefit is encryption so your ISP does not see. This does not encrypt once it exits the VPN though. That is where things like HTTPS comes into play. ZeroNet only goes through Tor for people who have it on. Even if you do not have Tor on, other people using it is still seeding with you. So in essence, yes its through Tor but not inside of it. I typed this long thing out to explain a little more.",
				"added": 1566264548
			}
		],
		"1566264907_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X": [
			{
				"comment_id": 409,
				"body": "Your solution is already here: http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/ This site lets users post new Zites that are low in seeders to auto-seed. This is also a ZeroTalk clone for new sites: http://127.0.0.1:43110/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/",
				"added": 1566327132
			}
		],
		"1566230571_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 410,
				"body": "Bump.",
				"added": 1566361227
			}
		],
		"1566752054_1CgQ84JRbPsRt4RCi5mkUHBj4oNoSDgWaZ": [
			{
				"comment_id": 411,
				"body": "Has anybody tried the link yet?",
				"added": 1566802651
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 412,
				"body": "By address, does it require me to type 127.0.0.1:43110/ in the registration, or just the letters and numbers after it? I assume its just the numbers and letters.",
				"added": 1566802951
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 413,
				"body": "You can break driver installs from windows updates in the registry. I forgot how to do that though. It makes driver installs fail from the windows update and not come at all, and still thinks your up to date.",
				"added": 1566973850
			},
			{
				"comment_id": 439,
				"body": "Although I like Linux(and prefer it), people in this thread made the Linux elitists come out of the woodwork, talking down to anybody who needs Windows for anything that will not function on Linux. All you guys do by talking like that is push people away from switching. https://youtu.be/wJKnVH0Kxlk https://youtu.be/pdCrpq3vFPw",
				"added": 1567374771
			}
		],
		"1566251733_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": [
			{
				"comment_id": 414,
				"body": "All the responses your going to get are people who suck on Firefox's dick, even though Firefox sold out to Google awhile ago. I refuse to use a browser that wants to control what I view. Firefox censors, and trys to \"combat fake news\". The only exception is TOR for what I use. Firefox deserves to burn for firing Brendan Eich for a decade old \"donation against gay marriage\" during a time where even Obama was against it. Everyone here sucks open source dick, even if it controlled their ever action. Also, yes, I rather use Brave. The CEO has said he gives no fucks about censoring anything. \nhttps://stream.org/brendan-eich-fired-from-mozilla-for-defending-marriage-has-a-brave-new-web-browser/\n\n\nMaybe the only problem for Mozilla's demise if you guys.",
				"added": 1566974055
			},
			{
				"comment_id": 415,
				"body": "> [filips](#comment_154_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You will see how anti-censorship will your Brave be when Google will control 100% of the web (let me tell you that they are already breaking major standards).\n\nYet you support a company that wants to combat \"fake news\". Keep being a hypocrite. Google and Firefox are both the same in this regard. I could give two less fucks if Google gets 100% control. Its the same when both companies actively do this shit. I at least know that Brave's CEO said he will fork Chromium(Idk if he will keep that promise though). Keep on being a hypocrite though. Come back when you have a real alternative, instead of me choosing two evils.",
				"added": 1567321315
			},
			{
				"comment_id": 437,
				"body": "> [filips](#comment_171_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): And, if the only reason why do you think Firefox is bad is because of Mozilla, then try Waterfox or Pale Moon. They are based on Firefox, but with some privacy additions and \"independent\" team.\n\nNever used Pale Moon. I liked Waterfox, but it was glitchy. I do like Tor though.\n\n> Also, do not only explain how Mozilla \"wants to combat \"fake news\"\" and how Mozilla is \"completely bad\", but also explain how Brave is \"magical solution which will fix the internet\".\n\nNever said Brave was the \"solution\", do not put words in my mouth.\n\nhttps://youtu.be/6ZOc8gNDQpc",
				"added": 1567373017
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 416,
				"body": "He sucks George Soros dick. He says he is \"on our side\", yet supports companies that encourage censorship.",
				"added": 1567321562
			},
			{
				"comment_id": 417,
				"body": "> [gitcenter](#comment_889_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Which ones?\n\nYou can't say your anti-censorship, and promote Mozilla. Mozilla used to be better, but ever since them tackling \"fake news\", I cannot use Firefox. All you guys are offering me is \"who's shit smells better?\" \"I know Chromium is shit, but Firefox is less shit!\"",
				"added": 1567321772
			},
			{
				"comment_id": 418,
				"body": "> [gitcenter](#comment_890_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That's right. Even if Firefox is shitty, there isn't anything better.\n\nIt's the same with all these tech companies. It is always who is less shit. Oh, you want a phone? You have to choose Google or Apple! Oh, you don't want them, you need to buy a Android, and figure out how to install a custom OS! I am sick of it.",
				"added": 1567322039
			},
			{
				"comment_id": 419,
				"body": "> [gitcenter](#comment_891_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Then what browser should I use?\n\nI frankly could not care at this point. Its just a losing battle.",
				"added": 1567322096
			},
			{
				"comment_id": 420,
				"body": "> [gitcenter](#comment_892_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Then one do you say He says he is \"on our side\", yet supports companies that encourage censorship.?\n\nYeah. You actively say you are, yet support Mozilla. I do not care what browser you use, because why should I? Its all the fucking same! I will call out bullshit when I see it, though.",
				"added": 1567322236
			},
			{
				"comment_id": 421,
				"body": "> [gitcenter](#comment_894_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ok, let's start thinking. I have to use a browser. There is Chrome, Firefox and a few others. I choose Firefox. Now you say I'm doing bad. What should I do then? Use Chrome? Don't use any browser at all?\n\n\"I do not care what browser you use, because why should I?\" You also previously showed your support for Mozilla. That is where my problem lies.",
				"added": 1567322376
			},
			{
				"comment_id": 422,
				"body": "> [gitcenter](#comment_895_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ok, so you're another \"you're bad just because\" guy. Bye.\n\nYou can use something, and not like it, because your forced. All your showing here is your afraid to show me you actively like Firefox. So, continue to suck on that Mozilla dick.",
				"added": 1567322463
			},
			{
				"comment_id": 424,
				"body": "> [gitcenter](#comment_896_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm not afraid of showing anything. Yes, I use Firefox. Yes, I use Firefox every day. Yes, that's the only browser I use on desktop (well, except chromedriver on Selenium because it boots faster). Mozilla might choose wrong decisions but it's not a reason to call it absolutely bad.\n\nSo, you actively support it. That's all I needed to know.",
				"added": 1567322677
			},
			{
				"comment_id": 428,
				"body": "> [testcdtyfyuftydr](#comment_14_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw): Try not to be retarded for a second and think beyond \"orange fox bad\".Firefox is miles better compared\n\nAd hominem attacks sure help your case.",
				"added": 1567323513
			},
			{
				"comment_id": 429,
				"body": "> [testcdtyfyuftydr](#comment_14_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw): There is a reason Tor Browser is based on Firefox and not in Chromium.\n\nThe only benefit Firefox has is privacy in my eyes. You make it seem like I don't actively use Tor. Still does not excuse Mozilla's shit. ",
				"added": 1567323648
			},
			{
				"comment_id": 430,
				"body": "> [testcdtyfyuftydr](#comment_15_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw): Then begin thinking from a perspective of \"what can we get done from here\" and stop calling out people for random inane reasons that are of no consequence at all.\n\nMozilla actively combating \"fake news\" is a real issue, and why they should not be supported. They also kicked out Brendan Eich for a decade old donation \"against gay marriage\" during a time where even Obama was against it. His new company actively support LGBTQ+ to this day. All I am doing is calling you guys out for your bullshit. I cannot support companies that also bring up decades old shit against somebody. Oh, and before you say I love Chromium, I hate Google too. Google does the SAME THING. Mozilla used to be great, and all it is now is a shell of its former self.",
				"added": 1567323842
			},
			{
				"comment_id": 432,
				"body": "> [testcdtyfyuftydr](#comment_16_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw):  It's sad that there are people posting on here who don't have the IQ required to realize that and behave pragmatically rather than throw an autistic fit for no reason.\n\n\nI am not going to argue with somebody who falls for the Dunning-Kruger effect, and keeps doing ad hominem attacks.",
				"added": 1567324829
			},
			{
				"comment_id": 434,
				"body": "> [u7](#comment_4_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ): Joke aside !!! I don't know how ZeroNet and Python really work in detail and usually only understand a third of his technical posts but i'm convinced that he is always right.\n\nHe knows what he is doing here. Kaffie is another example.",
				"added": 1567326428
			}
		],
		"1567259678_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 423,
				"body": "Why should I lie to get people to like me? All that is showing is they do not like the real me. Also, who cares if your stuff is \"popular\". There is a reason why mob rule is not the default anymore.",
				"added": 1567322631
			}
		],
		"1567246553_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": [
			{
				"comment_id": 426,
				"body": "> [ssdifnskdjfnsdjk](#comment_926_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Here is the guide: Help Tor network by relaying part of its traffic thru your server\n\nI would like enough people to try to share their bandwidth and make a server, but I don't see it happening.",
				"added": 1567323142
			}
		],
		"1567248587_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 427,
				"body": "Your surprised that the government will latch onto anything to arrest somebody? They been doing this to serial killers that have not been caught for years. I am not saying that Assange is like those people, but its the same tactic to arrest somebody. Oh, they cannot get you for murder? Let us see if he did tax fraud! Oh, we cannot arrest Assange? Let us try to get him on some stupid charge! If you think they will stop at here if they fail, then your wrong. Watch, they are going to closely monitor him for ANYTHING to charge him with.",
				"added": 1567323304
			},
			{
				"comment_id": 431,
				"body": "> [moor](#comment_202_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): nice catch. liberalism is a disease.\n\nThe modern left is not liberal. They just took the word. Liberal used to mean something.",
				"added": 1567324386
			}
		],
		"1567252251_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": [
			{
				"comment_id": 433,
				"body": "Hopefully he isnt the 2nd person to kill himself. There was one guy who did here. He said he wasn't going to be here for long, then he hasn't been here since. It is all speculation, but most likely he did it when he said that. I am not sure about h3 though.",
				"added": 1567325912
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 435,
				"body": "How did this post get 163 likes?",
				"added": 1567326499
			},
			{
				"comment_id": 436,
				"body": "The number of likes in this thread is more than the original stickies in a couple days.",
				"added": 1567326549
			}
		],
		"1567574940_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 440,
				"body": "I had this issue before on my system where I could not publish my site until I re-downloaded it. I was lucky that my site had enough peers for me to do that.",
				"added": 1567622585
			}
		],
		"1567601358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 441,
				"body": "8chan clearnet version has been down for weeks on end. It shows the inefficiencies of centralization. I doubt anyone keeps track of all the censored sites, but only follow the \"big news\" stories, and try to combat its censorship.",
				"added": 1567622803
			}
		],
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 442,
				"body": "Nice.",
				"added": 1575616212
			}
		],
		"1575211763_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM": [
			{
				"comment_id": 443,
				"body": "200 down, 200 up, fiber",
				"added": 1575616267
			},
			{
				"comment_id": 458,
				"body": "> [maciejplwroclaw2](#comment_20_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM): not bad...unusual though... we hace 100/100 300/300 and 1000/1000\n\nI get free internet speed upgrade for same price occasionally. It used to be 100/100 before. Should be 300/300 soon.",
				"added": 1575744168
			}
		],
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 444,
				"body": "> [azzzzzz](#comment_6_1JYuNAwYAcQXhGRZKMGFGgBvvFi6F9yC7m): its been found out that 08chan is flawed in that you can't actually blacklist correctly. Efforts are ongoing to shill zero's millchan to gain users so it can realize its goal. The Phillipino police are after the cripple and Jim both and 8chan after its resurgence of 8kun is a disappointment.\n\nA lot of people loved 8kun from what I read on the site though, so that's odd.",
				"added": 1575617255
			},
			{
				"comment_id": 448,
				"body": "> [lianna](#comment_51_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): Nothing much, other than the usual shitfest at 08chan. Most of the channers seem to have left for other imageboards, though. [...]\n\nYes, I read that on a reddit post of the 8chan mirror's on the clearnet",
				"added": 1575662289
			},
			{
				"comment_id": 455,
				"body": "> [sprite1ww](#comment_6_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp): Which reddit post? I checked out the 8chan subreddit but apparently it's banned now for some reason\n\nhttps://old.reddit.com/r/infinitechan/ (You can take out the \"old\" part if you like the new layout of reddit)",
				"added": 1575699994
			}
		],
		"1575342587_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 445,
				"body": "Use a RAMDisk or use Tails if you want to really do that. Just make it so the RAMDisk or Tails doesn't actually save anywhere else. I mean, it's cool to have the option, but in the meantime, you can use that option.",
				"added": 1575618218
			},
			{
				"comment_id": 449,
				"body": "> [lianna](#comment_50_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): ZeroNet doesn't work in Tails yet. I've tried both the bundle and the AppImage version. Both fail complaining about bridge support and tell me to upgrade to the latest version of ZeroNet, even though I am on the latest version. [...]\n\nHopefully it will one day work on Tails.",
				"added": 1575662555
			}
		],
		"1574449091_1MFJwynRwEkS2vHr8BH21DjDBEXcbiVZko": [
			{
				"comment_id": 446,
				"body": "> [ssdifnskdjfnsdjk](#comment_944_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): ISPs in the country makes the internet offline (temporarily) or you are unable to cross the national border in some cases?If it is about the border, i think it was said to use VPN services or the Tor browser.Some people create kind of local mesh networks, but i am unsure if this has potential to be widely used.\n\nI know that somebody in Cuba used a mesh network to take data from the US, and then put it into his own countries internet, despite it being cut off.",
				"added": 1575618450
			}
		],
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 447,
				"body": "> [styromaniac](#comment_1400_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Funny how the FBI knows child predator code and yet PizzaGate isn't investigated.\n\nWhy would they investigate themselves? You honestly think the FBI isn't in on it too?",
				"added": 1575618630
			}
		],
		"1575661928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 450,
				"body": "I read people complaining about Tencent years ago, and people just scoffed at it as just a \"conspiracy theory\".",
				"added": 1575662779
			},
			{
				"comment_id": 451,
				"body": "> [moor](#comment_320_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Yes, captive markets (which btw i don't think anything other than captive markets has ever existed, to a significant degree), how else can you keep trading for your advantage, its a systemic problem rather than the big bad wolf being the communist party of china.\n\nChina is merely taking advantage of business looking for profits. It's easy to make a corporation do something if it can give them profit.",
				"added": 1575663658
			}
		],
		"1574767629_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 452,
				"body": "I saw this on a YouTube video recently. Although its glitchy right now, looks promising for future prospects.",
				"added": 1575663791
			}
		],
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 453,
				"body": "> [maho911](#comment_10_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3): There is a category of people who don't need to do it now, but understand, things may become so bad, that there will be a need for this later. But, the information here is lacking tbh. Not much methods, not much pill cocktails, I definitely would like more, especially \"peaceful\" style methods.\n\nA lot of people fail to understand the scope, and just drug these people as the \"cure\" with big pharma. Some people don't understand it doesn't matter how many pills or therapy you get, if your life is so shit, there is no cure. Then you also have people's rights being taken away just for being suicidal, which then makes those suicidal people less likely to open up.",
				"added": 1575665139
			}
		],
		"1575619462_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": [
			{
				"comment_id": 454,
				"body": "First a solar powered generator I got recommended, and now this I see in ZeroNet. Funny how this is all a coincidence. In all seriousness, this combined with a solar generator should be good for in case the system decides to shit itself.",
				"added": 1575665382
			}
		],
		"1575688284_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 456,
				"body": "Wouldn't something like Tor with NoScript make it so this doesn't happen? If it requires JavaScript, more people should try to make a onion site, that doesn't require JavaScript in Hong Kong.",
				"added": 1575713943
			},
			{
				"comment_id": 465,
				"body": "> [aspidochelone](#comment_277_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Even in the U.S. we see sites like 8chan and Bestgore have to hide behind a few big corporations' \"ddos blocking\" until they deny them service.  I think the Chinese have to do what Americans have to do -- invent some means of communication that isn't jammed by any asshole who says he wants to listen a lot.\n\nDDoS protection has been a thing for years for one reason: A lot of DDoS in the wild west days. I remember a decade ago, DDoS was a lot more frequent, and so DDoS protection was implemented.",
				"added": 1575836708
			}
		],
		"1575709869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 457,
				"body": "There is no such thing as good or evil. It's all human terms. What one person think is good, another think is bad. Because of this, what one person think a \"Evil person\" is to not kill themselves will be entirely different. One person might think a murderer should kills themselves, while another person think they shouldn't because the murder is justified. You also have to consider something else. \n\nWe always look down on animals intelligence all the time. What if, a alien race looks down on our intelligence because of us not knowing what is after death, or what really created the universe? How do you know they go to a better place, worse place, or nothingness? Nobody knows. Religion is just made for us to be comfortable what happens after death, and to have a community effort. Those are the facts.",
				"added": 1575714560
			}
		],
		"1575790343_19xaGWaZg4koHQTrXtqdaM58To7cneR1d8": [
			{
				"comment_id": 459,
				"body": "I see it.",
				"added": 1575791179
			}
		],
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": [
			{
				"comment_id": 460,
				"body": "> [fractalzoomer](#comment_33_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): Check out this site. It redirects users to a working zeronet proxy, a server that allows users to view zeronet over a normal internet connection.\n\nNice info.",
				"added": 1575791241
			},
			{
				"comment_id": 463,
				"body": "> [nsm](#comment_3_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r): In this case i can post on Zeronet but be visible out of the zeroweb. It's a good idea avoid censorship, no?\n\nIf you mean posting in two places at once: ZeroNet and clearnet, then it cannot be taken away technically from ZeroNet, but yes on the clearnet.",
				"added": 1575836300
			}
		],
		"1575733657_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 461,
				"body": "It has a limit unless you go on the unlimited clones(which not as many people use). My ZeroTalk for games(that died because I didn't use ZeroNet for a couple of months) also has a much higher limit.",
				"added": 1575791463
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 462,
				"body": "> [caropc1v3](#comment_4_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T): THERE IS NO HALF FREEDOM. [...]\n\nYeah. One thing I like about ZeroNet: is I can block if I want, if someone else wants to see it, idgaf.",
				"added": 1575836110
			}
		],
		"1552609327_1L1UG7n2NqARsPheXq9y4wumdwiaez9ZJS": [
			{
				"comment_id": 464,
				"body": "Honestly, you would find more porn on the clearnet, than on ZeroNet. I wouldn't use ZeroNet for any porn. The clearnet has more, and is more easily accessible. Even torrent sites is easier.",
				"added": 1575836361
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 466,
				"body": "Humanity does not have a long term survival plan, unless we find a way to live on other planets outside of our solar system. The sun is on a ticking time bomb, that will eventually kill all of us when it gets too big. Even then, I do not care about humanity because of one reason: I hate humans.",
				"added": 1575837167
			}
		],
		"1575850577_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 467,
				"body": "If you are using Tor, that is why. It didn't work for me in Tor browser either. You can try KoptKate 2(I haven't tested this site for Tor uploading): http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/",
				"added": 1575852073
			}
		],
		"1576059419_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": [
			{
				"comment_id": 468,
				"body": "You sure you didn't give yourself a virus?",
				"added": 1576059712
			},
			{
				"comment_id": 471,
				"body": "> [selfsigned](#comment_9_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Well, as i didn't read the full zeronet code at all i could not say. Usually I install 0 shit on this computer, and it's likely to not be a virus. I am more fearing merge thing, which says to merge SOMETHING but doesn't tell you in advanced what will it download or not. [...]\n\nMerge isn't the issue here. The merge is to gather user account information. Those \"hubs\" are user info to use on ZeroMe. I don't entirely know how it works, but I know some people on ZeroMe I needed to merge with their hub to be able to see their stuff. Maybe that person's hub had something bad. For example: http://127.0.0.1:43110/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/ RedHub here says you need ZeroMe to access the user profiles. It's there to access people's profile's, and not to overwhelm your storage with too much junk it looks like. This is so you aren't seeding every profile I assume.",
				"added": 1576060661
			},
			{
				"comment_id": 472,
				"body": "> [selfsigned](#comment_10_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): So, the only point of view here is that I entered just 1 person with data, and this fcking person hosts data in such pedoHUB and I just granted access to a HUB that  i may not really need at all to enter \"just the profile\"?  [...]\n\nTo access that person's profile, you need to usually merge with a hub. You might of granted to such a hub that has those issues. I am just guessing, might of been a trap. I don't know entirely how some people made their own \"hubs\", but I know it can be done to make their own.",
				"added": 1576060953
			},
			{
				"comment_id": 473,
				"body": "> [selfsigned](#comment_11_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): As i pointed, i didn't even ensured what is inside that HUB; but name is not that much friendly to want to look at all. [...]\n\nThats ZeroNet in general, whatever you click can be a risk. It's the same with any p2p or torrenting technology.",
				"added": 1576061042
			},
			{
				"comment_id": 474,
				"body": "> [selfsigned](#comment_13_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Nice to know. Im not here to find illegal shit nor other. Lucky me i used TOR from the start. I hope no one want's to fuck me because a fcking missclick. [...]\n\nI didn't have a issue with the merge feature before, but I will myself take note of this in the future. Like I said, I don't know entirely why the hub's are a thing(waiting till somebody here schools me on that). Just noticed I needed some of them to access profiles. But, your welcome anyways.",
				"added": 1576061244
			},
			{
				"comment_id": 475,
				"body": "> [pexo](#comment_179_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Disclaimer: I am the owner of PedoHub.   [...]\n\nThank you for your deep explanation of how things works here(On ZeroMe).",
				"added": 1576111086
			}
		],
		"1575913720_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": [
			{
				"comment_id": 469,
				"body": "> [glightstar](#comment_182_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): First get a domain through Namecoin https://zeronet.io/docs/faq/#how-can-i-register-a-bit-domain or get a free one at Name.YOThen edit the zite' content.json: https://zeronet.io/docs/site_development/content_json/#domain\n\nBy wouldn't the drawback be losing the old domain name? When I have a name.yo address, I can use either or.",
				"added": 1576059805
			}
		],
		"1576012034_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [],
		"1576087205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 476,
				"body": "I am guessing this is a fan made Sonic game? Looks cool.",
				"added": 1576111219
			}
		],
		"1576268669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 477,
				"body": "Yet it dosen't allow you to use the domain name in the clearnet though.",
				"added": 1576289679
			},
			{
				"comment_id": 478,
				"body": "> [styromaniac](#comment_1439_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I know what name.yo isn't. It was an uneducated suggestion that I made.\n\nI like the idea, but that would make it open to censorship unless its a crypto domain name(There are some sites boasting about cannot delete domain names coming now).",
				"added": 1576289814
			}
		],
		"1576182888_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 479,
				"body": "It should be really easy to link it at the top. With the ZeroTalk clones I programmed with, its really quick.",
				"added": 1576290089
			}
		],
		"1576192907_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 480,
				"body": "I wonder if making ZeroNet multithreading will help speed up downloading data. In torrenting programs, upping the number of seeders you can connect to ups the CPU usage, and is multi-threaded.",
				"added": 1576290350
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 481,
				"body": "I am the chosen one. Haven't you noticed?",
				"added": 1576290592
			}
		],
		"1576265919_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 482,
				"body": "Bluetooth has a problem of interference, and not a big range. Phone's making their own Wifi hotspots to connect to each other might be superior(unless a better Bluetooth comes out).",
				"added": 1576290710
			}
		],
		"1576291196_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 483,
				"body": "I am the devil. I am the chosen one who is also the devil.",
				"added": 1576291106
			}
		],
		"1536305203_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 484,
				"body": "> [epstein](#comment_1_1DHG918HYdqqvtLHR3V8oZcg8wHntBaJfu): Retarded site.\n\nI would be surprised if a site DIDN'T use Google for tracking and analytics.",
				"added": 1576291409
			}
		],
		"1576243302_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 485,
				"body": "You late.",
				"added": 1576292082
			}
		],
		"1576246850_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 486,
				"body": "> [bigbadbob](#comment_844_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): They mostly just peddle drugs... or take notes.  In Canada they are not really helpful from what I have seen.\n\nDrug them, and then when those drugs make them feel worse from the side effects, they drug them more.",
				"added": 1576479336
			},
			{
				"comment_id": 487,
				"body": "> [bigbadbob](#comment_846_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): If you don't want to take the drugs.  they can't do anything.   To get any form of assistance (social)  you must follow the doctors orders... and the protocol is always drugs.  So basically if you don't want to be a lab rat for them to experiment upon..  you can go off and die somewhere.\n\nPretty much all therapists are in bed with big pharma. It's all a scam too with the way they label anything that is not \"normal\". If this was back when the guy who said the earth revolves around the sun was alive, they would of labeled and drugged him.",
				"added": 1576479551
			},
			{
				"comment_id": 494,
				"body": "> [edgelordofdecent](#comment_353_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Galileo\n\nJust looked up the name, and yes that is him,",
				"added": 1577426061
			}
		],
		"1576474700_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 490,
				"body": "> [filips](#comment_367_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): There is already KxoQA/ZeroExchange.\n\nBut nobody uses it...",
				"added": 1576563324
			}
		],
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 489,
				"body": "Linux is never finished. It will always be improved upon.",
				"added": 1576523847
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 491,
				"body": "> [opisafag](#comment_32_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2): I blame mobile for lowering the intellectual barrier of entry so much that even the dumbest people can go on the internet. The floodgates are open. The internet is overrun by idiots using gimped devices.\n\nI didn't buy a smartphone for years because of how closed of and limited it is(unless you root Android or jailbreak iOS). And now, your forced to use a smartphone now in some occasions.  At least when you bought a Windows laptop, you could replace the OS very easily. Phone's are overrated tech that people replaced their PCs with that lowered the intelligence needed to use it. Centralized app store, babying you with everything. Not on Google Play Store? Who cares if your app can be downloaded, if it's not on the Play Store, nobody will download it. \n\nThen you have the bloatware being worse than any Windows laptop. Cannot uninstall, cannot get rid off unless you root or jailbreak your phone. Facebook hogging all your battery down because of it spying on you constantly, even when you disable it. Oh browsers? A lot of them don't even have a functioning ad-blocker that is common sense on any PC! Oh, your VPN has ad-blocking capabilities? Cannot put it on the Play Store because it goes against Google! Now you need to rely on pihole or download the VPN outside of the Play Store just to block some ads, even if your browser has a ad-blocker in those annoying other apps!\n\nYou even now have stupid phone only apps that work fine on a website, yet force people to use a app just to access the website. Then you have the stupid apps with communication only working phone to phone, and no phone to PC. Kik communication is cancer compared to anything else like Skype(although I hate Skype, it atleast had PC to mobile communication, and was better!)",
				"added": 1576563565
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 492,
				"body": "I unsubscribed from the users filter because I disagreed with some of them on there. But that is the beauty of ZeroNet, I can choose who I want to mute or not.",
				"added": 1577178574
			},
			{
				"comment_id": 493,
				"body": "> [falconixx](#comment_16_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): maybe it would be a good idea to add a single bottom for every site or person so people can add or remove whoever they want\n\nThis is something I been wanting for the longest and the best thing ZeroNet to have for block lists.\n\n> [styromaniac](#comment_1474_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll take your feedback.\n\nThe issue is that I doubt you will agree with my feedback(just a assumption), and how so many people would agree with you too.",
				"added": 1577425959
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 495,
				"body": "The clearnet understood more during the wild west days. When normies got on, it changed, and then became more about looking good for others. The reason ZeroNet will be different is because ZeroNet has a barrier to normies in how you access the content. You can still find intellectuals on the clearnet, but its harder to find, and only in more niche communities.",
				"added": 1577426766
			}
		],
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 496,
				"body": "I still enjoy video games, just indies and older ones. Switching to PC Gaming has been a blessing in that it allowed me a huge array of emulators, old games, and indies.",
				"added": 1577862889
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 497,
				"body": "> [quantumkitty](#comment_282_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Let's face it. ZeroNet (uncensored platform) is still nowhere near as bad as the YouTube comment's section (censored). Or even Reddit. Censorship breeds even worse bigotry.\n\nAccording to leftists on the clearnet, deplatforming works... It's ridiculous\n\n> [quantumkitty](#comment_284_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Nice. I honestly think I'll be hanging out here a lot more in 2020. Mainstream online communities have gotten too big for their own good. Having $0 server running costs opens up a lot of doors. The only real reason ZeroNet hasn't gone mainstream is because.. well, everyone is on YouTube and Reddit. But small creators will find that their content has more value here on ZeroNet than on social media giants. ..of course there's also the issue that there's a lot of ZeroNet competitors/alternatives too. What makes ZeroNet better than the rest? Well, for one.. ZeroNet isn't tied to any shitcoins or ponzi schemes.. it's legit as it gets. What you see is what you get. Luckily if I type in Google 'decentralized websites' .. ZeroNet.io shows up first. So there's hope.\n\nPeople will stay on those platforms because of laziness. Internet Explorer didn't lose majority of its market share till 2014. It stands that people will continue using something others use, no matter the quality.",
				"added": 1577863014
			}
		],
		"1577829583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 499,
				"body": "Yeah, good luck selling me to live forever. I feel like I wanna die sometimes, because of how shit society is. I don't go and end up doing anyways, because of some of the fun things I can do and me having a chance to fuck up the system legally(like not spending as much so less taxes to government). Just have fun till I die or a collapse.",
				"added": 1577863760
			}
		],
		"1577729890_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 500,
				"body": "I rather not date AT ALL till the laws are fixed. More men are most likely doing that too in the US. I doubt its just that one alone, but higher standards and the laws add to it too.",
				"added": 1577863907
			}
		],
		"1577853034_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": [
			{
				"comment_id": 501,
				"body": "I notice onion connections can sometimes slow down because of the nature of the TOR network, not ZeroNet itself. I notice ZeroNet usually scales well. This is just by my experiences.",
				"added": 1577864023
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 502,
				"body": "The government, media, and schools do not want to help you, but are all in bed with each other to make the elites more powerful. \"Woke\", \"progressives\", are just infiltration by the elites to think they are against the elites. ",
				"added": 1577864243
			},
			{
				"comment_id": 503,
				"body": "> [draugrdeathlord](#comment_22_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): One only need to see what people are experiencing day in day out these days to know that humanity has gone backwards a fucken lot in the last few decades.\n\nHave you read history books? We are the same as we were back then, just to different people.",
				"added": 1577864412
			}
		]
	},
	"comment_vote": {
		"203_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"140_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"2_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD": 1,
		"3_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD": 1,
		"2_1C5gAHhNspK1nB1xYXQAsbnftUqf2r8dDN": 1,
		"50_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"423_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"141_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"424_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"631_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"52_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"632_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"205_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"9_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M": 1,
		"1_1AAAGerzGimCBY5z7h4U8kRfjjWbHMXhPP": 1,
		"1_13uY9aHvmsLFJPFv4wWnraMVLitQhZbMvC": 1,
		"166_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"58_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"8_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"6_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"5_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"4_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"20_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"19_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"18_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"3_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"476_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"175_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"21_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"7_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"510_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"57_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"483_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"484_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"17_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"485_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"486_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"487_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"18_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"511_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"22_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"193_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"180_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"196_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"489_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"200_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"23_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"202_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"203_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"26_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r": 1,
		"23_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r": 1,
		"24_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"28_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r": 1,
		"386_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"50_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"27_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"492_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"26_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"167_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"5_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": 1,
		"65_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"496_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"29_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"206_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"30_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"31_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"67_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"32_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"5_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": 1,
		"728_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"731_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"231_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1258_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"32_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r": 1,
		"54_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"253_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"9_1DQ97EiEM8nSZ34beMaBepz7cM8zDAFLX3": 1,
		"547_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"53_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"4_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"4_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": 1,
		"190_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2_1F2QfFQvM5hn22fnDWpDieTesVmffaivtx": 1,
		"60_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"61_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1_17PzRxum8UYrW4SpffDiBj9Y7cPA9iizB5": 1,
		"205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"209_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"212_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1_188woswaganmWmEP1hzi4GsRHgLPkCDkEA": 1,
		"2_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": 1,
		"2_1LruaaESdiS4VB44xgLoaQ2HC17NATMrPT": 1,
		"3_1LruaaESdiS4VB44xgLoaQ2HC17NATMrPT": 1,
		"27_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"66_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"651_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"303_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"756_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"690_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"313_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"628_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"32_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": 1,
		"43_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"3_14sXjeZErdSDaERcrbZkg5fSBHv8o3Nkrk": 1,
		"1_1PLMmXmgNJXTiKTDSgdwh3gRukC7WspzHt": 1,
		"1_1Mxifa1mKj8HCCrV4vVW3f9TykoDLTVBVj": 1,
		"3_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"662_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"812_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"10_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"109_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"69_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1_195bQwF94JT2ja1vt3DAGTwakyszotwdYq": 1,
		"12_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1,
		"1_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"5_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": 1,
		"85_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"765_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"766_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"347_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"678_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"17_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"8_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"1_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"134_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"78_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1_1Nsd5kJBEgJquSMKw1VAYNpiLPEuJ4j1ci": 1,
		"80_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"702_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"86_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"15_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"356_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"143_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"104_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"3_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1_12PaSAb8szCPmQkZuYMjyu6ckrLDARwsee": 1,
		"26_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"106_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"107_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"109_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"105_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"5_1PJfQpxEFVYhaJhA1wMQBhBaqwb5vBQit9": 1,
		"29_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_16v2kbsvqCKYELZd48rg796zYL41YWoK1c": 1,
		"94_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"7_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"9_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"254_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"18_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"20_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"125_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"394_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"4_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1": 1,
		"126_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"127_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"34_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"128_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"135_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"5_17RgJMZ9wxBZvSyTFnSGkMQVpLrAGYNfba": 1,
		"6_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"129_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"130_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"26_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": 1,
		"132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"51_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"134_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"22_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd": 1,
		"135_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"17_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1,
		"136_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"147_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"45_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"4_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"20_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1,
		"1_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"2_12fRYR1WTnfvn1kNwNBU6Bewu7WFpvCag2": 1,
		"1_12fRYR1WTnfvn1kNwNBU6Bewu7WFpvCag2": 1,
		"3_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"4_12fRYR1WTnfvn1kNwNBU6Bewu7WFpvCag2": 1,
		"137_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"81_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"174_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_18LQtVLHmShqGJ8mPRrhgJa5XMZZsV5cYB": 1,
		"314_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"22_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"4_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"76_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
		"63_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"313_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_1MhLCR913AyW8chNJDGqVQEDitX8AE5PZ6": 1,
		"251_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"5_1MhLCR913AyW8chNJDGqVQEDitX8AE5PZ6": 1,
		"2_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"188_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"7_14WcRkP8bNEpr6wHuaXg3JqZRQxmHHtkRj": 1,
		"772_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"100_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"2_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"11_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"783_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"2_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"3_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": 1,
		"1_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": 1,
		"38_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"841_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"4_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv": 1,
		"2_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG": 1,
		"3_1MutjWS9dBUHWpg67kCVznJn2uG3z4n8Rr": 1,
		"4_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"5_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"5_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"337_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"341_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"12_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"5_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": 1,
		"8_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"9_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3_18ToXEcEF1nZGNJBgUzF9ocFJrGnTaePaN": 1,
		"3_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": 1,
		"242_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"153_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"73_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"74_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"246_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"155_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"75_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"52_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"25_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"83_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"94_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"7_17comAUATPrdZX35UkFVPzCfEGUvWzhP6b": 1,
		"5_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": 1,
		"118_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"13_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"876_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"92_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"120_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"9_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"8_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"18_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"19_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"1_19TLArZeQymSy6HKztTK2xijZCmcSNFyZf": 1,
		"538_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"542_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_114dABk8LD1Yaiu7RRtvSrtUBuwRHQNVmV": 1,
		"4_19ZG8i1DSwiuRsvwUS8EsAgHXYK2tBtQKv": 1,
		"78_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"79_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"368_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"851_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"10_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"177_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"8_1NcurpanUoXCULWJdFWMQ63RUcHeGp2vuA": 1,
		"14_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"854_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"1_12Rkd9x36cVgopSut1vpTzjuQcL8Treh5j": 1,
		"855_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"856_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"858_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"18_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"19_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"20_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"21_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"861_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"862_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1E6tCCUJTK8L9c6mQygDB74yzmBrmvxLVq": 1,
		"863_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"62_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"13_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"865_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"15_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"16_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"592_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"23_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": 1,
		"584_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"591_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"8_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"579_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"7_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"2_1PfGPyKkesp2sF6tmwj19A9Uk9aSgeBnLu": 1,
		"5_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": 1,
		"11_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"880_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"594_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"882_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"23_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"19_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1": 1,
		"16_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"596_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"24_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"599_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1": 1,
		"595_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"17_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"885_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"24_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"3_16saatvk2kQPGCMBcvvbLgi8YkTGcjAuhA": 1,
		"600_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1C4jj78y5jMo2kTtUFKaLMwdkEnpffC76E": 1,
		"887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"28_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": 1,
		"1_1HJJZJfGxA98pc8kVpjaiZSWH2BGjLePEE": 1,
		"5_1NA1GS8pXSCVWDD4ESfGXcfkcBnbV6zJMh": 1,
		"2_16saatvk2kQPGCMBcvvbLgi8YkTGcjAuhA": 1,
		"31_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"890_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"37_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1_1BFTaWPZXtujiULmZsh5cufN9mj9yXaAXA": 1,
		"4_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"2_1BFTaWPZXtujiULmZsh5cufN9mj9yXaAXA": 1,
		"608_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"6_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"5_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"3_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"609_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"588_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"112_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"611_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"114_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"9_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"113_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"115_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"9_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"10_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"2_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"14_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"8_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH": 1,
		"1_12dmwXAY5qaFjMLt1SzzGN1ek9N5CJ9PvA": 1,
		"367_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"4_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"44_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z": 1,
		"43_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"370_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"16_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"48_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"7_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"2_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"619_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"3_1PfGPyKkesp2sF6tmwj19A9Uk9aSgeBnLu": 1,
		"896_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_19UWrRNGRnkxM1JKVEK7CyPNaANKkPXqA5": 1,
		"1_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"3_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"620_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"622_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"54_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"55_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"5_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"875_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"878_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1,
		"12_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"872_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk": 1,
		"877_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk": 1,
		"2_1LgTCiNTcq9f9SgvQYTqPTY2TevQa3YfAu": 1,
		"881_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"6_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"1_14ytGJ8q3o7K8Jydg2Xuy2wPFRerLHGKJf": 1,
		"2_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"135_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"19_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"181_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"897_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"13_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"182_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"5_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"3_18jmm5K92icHYrBzbvG4wo6NtPZEVMoTBP": 1,
		"6_1NA1GS8pXSCVWDD4ESfGXcfkcBnbV6zJMh": 1,
		"12_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"10_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"15_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"18_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"10_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"262_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"257_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"13_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"22_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"264_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"900_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"16_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"901_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"86_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"17_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"18_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"902_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"903_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"904_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1EtzjSN7iajovqGs9EkLX8VPC4affBqmco": 1,
		"1_12sydgwQhhGrmcJVEt5WgKodUALnmLkWgf": 1,
		"8_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"2_13zJujgTGXKmoUHGGFazek97zrRwfXtv5g": 1,
		"3_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"136_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"7_1LFedFTgmtHTfqqMRd4euD7BrVQBzatZUi": 1,
		"8_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"902_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"14_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"18_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"17_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1_1Gadvqei8gjUX6Po6Z8aZ9xRgQr7KXT56e": 1,
		"6_1LFedFTgmtHTfqqMRd4euD7BrVQBzatZUi": 1,
		"9_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"21_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"2_12sydgwQhhGrmcJVEt5WgKodUALnmLkWgf": 1,
		"176_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"19_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"177_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"22_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"661_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1PLaPnEwcMKPkfSJxta8vHr7kXjN7GR82V": 1,
		"914_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"179_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"916_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"918_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"928_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"13_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"924_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"131_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"4_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"1_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"192_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"33_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ": 1,
		"922_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"117_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"237_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"924_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"119_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"7_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"1_1JUcT8ywBK4wSMpWXDbbuyQMaQqfD269ws": 1,
		"2_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL": 1,
		"1_1L2K2kRD9xSTdqyDsvmm8iiUVPdCK65tAY": 1,
		"4_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL": 1,
		"943_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"10_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"2_19vcqLBN7qJ2gnF5audiwNNnLTn7ypRrrq": 1,
		"1_1AvvkCBLN1RLeneDikTfHQ6GkvARNoggSW": 1,
		"944_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": 1,
		"951_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1,
		"21_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"37_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"22_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"259_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"260_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"3_19vcqLBN7qJ2gnF5audiwNNnLTn7ypRrrq": 1,
		"261_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"151_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"8_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"8_1Fi6FbNTzE6kZNEbR23FzcndyJh3RE9Nhx": 1,
		"991_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"267_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"188_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"942_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"943_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"22_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"4_1BX5Fybb58kpdZGw2d9a5arCD3jJbi8DZz": 1,
		"3_1H79P7Dn1eqyVFFhsPux4ZyApMuhzhwXCS": 1,
		"216_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_1FSDJqLBYJ9Ej8SQGgPCuMadPBpi45cXKW": 1,
		"13_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": 1,
		"126_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1_19siGLDKr3LtXdXo3VL14VwpcvKPr4mikx": 1,
		"2_19siGLDKr3LtXdXo3VL14VwpcvKPr4mikx": 1,
		"96_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"321_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"10_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": 1,
		"355_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"357_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_13j5LNZ7dSVQVW7mGd1T8hj2GYydJ67JM4": 1,
		"832_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"7_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": 1,
		"383_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"625_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"112_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"142_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"14_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"46_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"12_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"340_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"5_1NVxcHH8j8PwTQ8YXtZzKbbchua6JRqLFT": 1,
		"13_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": 1,
		"51_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"389_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"110_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"840_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"51_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"57_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"81_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"6_1JYuNAwYAcQXhGRZKMGFGgBvvFi6F9yC7m": 1,
		"7_1JYuNAwYAcQXhGRZKMGFGgBvvFi6F9yC7m": 1,
		"48_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"51_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"50_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"330_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"3_1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx": 1,
		"1406_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"320_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"451_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"321_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"318_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"10_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"30_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1407_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": 1,
		"33_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"2_166uTRSiJyj6QXVFKqaohJQyZ2aFNuGESS": 1,
		"4_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"53_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"330_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"37_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"1276_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"182_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"179_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1419_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"184_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"1125_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"62_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"485_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"844_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"853_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"16_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": 1,
		"353_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"491_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"3_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": 1,
		"6_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": 1,
		"495_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1
	}
}