{
	"posts": [
		{
			"id": "90cbdd26-57a8-44e4-be30-8ca67b533116",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>e5e7a7c9-2797-4f80-a8ad-b983dee3da7e\nOh come on, get the fuck out. First Tarrant is a psyop because he's some kind of Israel trained Mossad ninja, and now this guy is a psyop because he drops spaghetti all over the floor? You can't have it both ways.\nJust because you don't want your views associated with kill people doesn't mean you can call every shooter a crypto kike willy nilly.\n>>99c04289-b2c0-411c-be00-185143425be0\nA chinkshit indoors door? Maybe. But that looks like a pretty robust door. That's why the cops use those big ass weights to breach and not their foot.\n>>bbceb3e1-f6cc-4c2d-8ae6-eeeecb8c8657\nHe was a sperglord, but I'd like to see you try to make a luty and get it to cycle even once on black powder without being able to test them first. If he actually built them himself, that is.\nAt least he recognized the Synagogue was \"a hard target\". Indeed it was, for him at least.\nHonestly the best way to get a high level target is probably either following them outside on their car, and to get a lot of people at once use the fertilizer van of peace. Gas is useless btw (https://www.youtube.com/watch?v=l6uLUaqgWY0).\nI admit his home made shit wasn't any more useful than a knife. Probably what you would want to do is kill someone with a real gun and steal it from him. Otherwise just stick with planting explosives and detonate them remotely/automatically and get them off one by one until you get caught. In an innovative way, like the Unabomber did. Use your imagination. Put something shiny on the ground for them to pick up. Find a way to get into their gas tanks with firecrackers and make their car explode. Find ways of poisoning them by contaminating their food and water. Do not dress with tacticool shit, try to look as inconspicuous as possible and leave as little evidence pointing to you as possible. Know when to give up. If you don't get your actual target then abort the operation.",
			"time": 1570689928225,
			"files": "[]"
		},
		{
			"id": "c5327f37-9e1a-40dd-bf98-5cba09ef9d50",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>82653a52-b48b-43fd-b10a-5451340661e4\nI didn't say it myself. I said the guns were pretty cool and hard to build, nothing else. The ability to machine steel isn't necessarily correlated with not being socially retarded and trying to get people to worship you by being a copycat. And he could perfectly have gotten the guns from somebody else but didn't mention it in the manifesto because he didn't want to rat on his sources. Ever thought about that?\n>and I'm looking forward to seeing how they're going to try to ban lead pipes and sugar.\nHe just proved how you need A LOT of that stuff to cause real damage unless you make the subject pick up the bomb like the Unabomber did. Besides, why only mention the sugar? Why not mention nitric acid and whatever else is needed to make bombs? That stuff can be controlled to some extent. For example by requiring sellers to do a background check, ask and record IDs, implement some kind of industrial chemicals handling license and stuff like that.\nSure, you can make the acid and whatever chemicals are needed in theory, but good luck setting up a lab capable of doing that in a reasonable amount of time within your lifespan in your free time.\n>It's about internet control.\nYou are the naive one. They have the Internet tightly under control already. 4chan is under control for surveillance of the goyim. 8 was gotten rid of because people on there were actually getting too extreme for their tastes and likely it wasn't under as much surveillance because the owners weren't that eager to cooperate with the cops (for example by keeping Tor access, which admittedly was unusable in the later months).\n>I'm sorry but unless I see someone going after goldman sachs' employees I'm calling false flag.\nWhat kind of people do you think were inside that synagogue? One thing is having jewish DNA, but if you're actually part of the diaspora enough that you got in there to celebrate that jewish holiday chances are you're a high level operative for ZOG. Just look at the faggots dancing in the bus for getting away with it **unless that was a 4chan psyop**.\nTo totally and utterly control the Internet you would need to ban all p2p connections. But the thing is they can't do that because\n1. There would be too obvious and too many reddit lukewarm leftists would get redpilled on the nature of the beast\n2. It would make lots of commercial services that rely on p2p to jew out on bandwidth from their servers to stop working until some form of authorization system would be deployed world wide\n>easily connected to imageboards\nIf you were going to shoot jews, wouldn't you post it on your imageboard of choice? I sure would. I think you'd be lying if you say you wouldn't either.\n>low kill count\nI'm sure that has nothing to do with the fact that he was using home made slamfire shotguns, open bolt submachineguns running on homemade blackpowder ammo and blackpowder pipe bombs.\n>retards or shills. I'm surprised either way.\nOr maybe you're just a civnat cuck newfag who's afraid of being associated with anyone who actually killed people. Don't worry, within a few years you'll be cheering on these guys.",
			"time": 1570701106333,
			"files": "[]"
		},
		{
			"id": "89ed1fcb-32f8-4681-910f-dc3b22137e07",
			"directory": "users/1CrnHeXMu3L6LhjormS5WaPW9jHDPT7ufR",
			"uri": "jews",
			"thread": "65ca18d8-21be-4c89-bef7-2b5f83edbed8",
			"body": ">kikes",
			"time": 1570732136594,
			"files": "[]"
		},
		{
			"id": "80f2229d-3959-402c-9f8d-f6f964246130",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d70ea7e7-9af8-43bd-a48f-d8a4a66844c6",
			"body": ">>55d01c7f-b454-448f-825e-82f950214c6d\nYou're right but you're also wrong. You're right in that a lot of schizos call shills anyone that disagrees with them (especially on 8/pol/) but it's also a fact that there has been actual organized shilling from discord trannies, marketing, chinkshit and PR companies hired for various political parties, JIDF and at least once by one of the boomers working at the FBI.",
			"time": 1570732513113,
			"files": "[]"
		},
		{
			"id": "6182d9f8-c24e-49de-8ddb-e137969b97a9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a566a0e7-2761-41e5-966e-3d40ae56d581",
			"body": ">>c1917bb5-7a3a-4126-aedf-02cf5cb46446\nNice but I'd take out the \"he's\" part at the top.",
			"time": 1570732630213,
			"files": "[]"
		},
		{
			"id": "f62f790d-1e18-4241-964a-ef8e373318d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "de1e20d7-9c58-4052-96d1-29c99076305a",
			"body": "Then upload it here faggot.",
			"time": 1570732691913,
			"files": "[]"
		},
		{
			"id": "bf26c4ab-942d-4293-a4b8-153a5c01c933",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3c0fbc49-e1c8-4f62-8b80-3094503ecac5",
			"body": ">>1a1c5abe-3f5a-4962-8ed7-bd552c834ba8\n>it can get a LOT worse\nNot really.\n>and make it legal to persecute you on literal posts with ease.\nThat's not having the Internet under control, that's just removing muh freeze peach. Which is why we need Tor, secure communication systems and plausible deniability no matter what. Work needs to be done in this area.\n>4chan for example is 100% glownigger controlled, yet it can get even worse by adding wordfilters and literally gagging any bad goy comments.\nThey can't do that, because people will then move on to channels they don't have under control (like here). They have to put up a veneer of neutrality. It's all coldly calculated, trust me.\n>You can be required to present a biometric ID each time you connect to the internet \"For your protection\".\nWhich is kind of de facto the case already? Maybe not a biometric ID but just a plain old name and address ID. Unless you get free wifi or a burner phone, which isn't an actual problem because nobody will do it to shitpost unless they're homeless and in the case of a phone the signal can be triangulated to your house without even trying since 99% of modern phones have a GPS chip.\n>Tor can be banned.\nKinda but also not really. The CIA niggers need it themselves for intel and counterintel without making it obvious they are operating from Langley. Where do you think all the funding comes from?\nAnd if they ban Tor, we can make our own Tor. Ever heard of i2p? We can make it hard as fuck for them to find all of the nodes. And if they persist we'll move to mesh networks and packet radio, which would be a nightmare for them because then they lose control of the infrastructure and can't shoot it down in case of a civil war.\n>Background checks can be enabled if you're allowed access to the internet (they already do this shit on communist hellholes)\nYou can take out the circus part of bread and circus and expect people not to take up arms.\n>Just think about how it was 20 years ago and how it is now. If you don't see a change for the worse (not speed-wise of course) then you're blind.\nMy point isn't that they didn't do it. My point is they did it so much we're almost at the bottom already, and if they haven't pushed further it's because they didn't deem it convenient at this time, not because they don't control the infrastructure and web services.\n>They just need better excuses, and this kind of events are giving it to them. \nAgain, they are trying to strike a balance where the Internet is barely good enough that we stay on it. Just like they do with 4chan. A bunch of somewhat decent discussions happen on there and they want to keep it that way so people remain under surveillance and don't go to alternative channels.\n>No. That would be retarded. Such an event would be picked up by the msm and frown over for ages since it's messing with the chosenites. Why the fuck would anyone need an imageboard to amplify that? \nLike the retard say, to improve morale and encourage others. And to publish your manifesto, which if published at all after you go to jail would be heavily censored.\n>so you're saying there is a bigger probability to this guy being a suspiciously resourceful retard\nSpergs have had many accomplishments through history. It's well known many introverts have good scientific skills but they can't think on the spot to save their lives. For fucks sake, Terry made a full operating system and C compiler and he was totally bonkers. If he can do that and still believe a hot woman from Youtube is gonna email him out of the blue that she's going to live with him, this retard can make a few improvised guns while fucking up the tactical aspect.\nBesides, what '''did''' he actually do so wrong? I mean, sure killing random people on the street isn't nice, but he was an edgy weeb trying to impress people on imageboards, not really a mature national socialist. Why didn't he jump over the wall by jumping on the car? Maybe he thought then he couldn't get out afterwards (which would probably be the case, let's be honest). Why didn't he ram the door with it? Same thing, he clearly wanted to get away, which is presumably the reason he threw away the camera.\nAnd he isn't '''that''' resourceful. The fucking favela niggers are into making these kind of guns. He wasn't that good at making explosives, otherwise he'd make guncotton for the ammo and high explosives for the bombs.\nIf he was actually resourceful, he would've had invested in a drone to gather intel about the inside of the complex, or made a thermite package to melt the lock/hinges of the door or some other way of breaching. He knew there was a door with a security camera on it.\nBut rather than prepare and save money to buy more supplies, impatience got the best of him. But I don't blame him, the more you spend in the possession of illegal stuff the higher the risk of someone catching you before you are able to strike, that's also an important aspect.",
			"time": 1570734918612,
			"files": "[]"
		},
		{
			"id": "81d6c65d-048c-44bd-afde-55dfd0d9f962",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "de1e20d7-9c58-4052-96d1-29c99076305a",
			"body": ">>d2c944b6-584b-49ca-a796-0921925e4d75\nTry uploading it there too. As both have the same hash, it won't result in wasted space **probably**.",
			"time": 1570739824702,
			"files": "[]"
		},
		{
			"id": "f066cb58-df08-4c8d-b40e-80488d7ee7b9",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "7c8a5b30-d6d8-4ff0-8e10-003a0a18d6a2",
			"body": ">>988f1ab5-e80f-4923-b2e0-9f6c8d3d3158\n>ten autists set up mesh network\n>cops find out\n>declare it an evil terrorist nazi group\n>fed plant joins the network and get access to every post\n>set up van outside every node to sniff traffic\n>easily de-anonymize everyone through traffic correlation\nYeah no that won't work. The point of Tor is there are so many connections going on at any moment that there are tens of thousands of people who could've made any given connection. If the network is too small onion routing doesn't work.\nAnd besides, what fucking purpose would you use it for? How many natsocs do you know in your area? We barely can get people on here, and you want to limit your userbase to a single city?\nNo, the actual solution is to improve ZeroNet, Tor, i2p and similar projects. Mesh networks would be useful if they offer open wifi nets that allow you to get into the Internet through Tor, then (especially with a store-and-forward system like with Usenet or POP3) you could drive up there in your car, send your terrorist messages or whatever and gtfo, and the advantage it would have over free wifi in a restaurant or something is that those might block Tor or the government could make the Internet stop working and that's where mesh networking comes in but then the system would have to be able to fall back to WLAN instead of Tor. Then the only problem would be security cameras.",
			"time": 1571054471206,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}