{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 1,
				"body": "> [cactusdragon](#comment_16_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): I said it may be possible to track you, but unprobable. For example tor wasn't at fault when the man behind silkroad was captured (it was his own fault for promoting his website with his real name)\n\nThe saying always goes, P.E.B.K.A.C.\nProblem exists between Keyboard and Chair.",
				"added": 1568935969
			},
			{
				"comment_id": 2,
				"body": "There are several layers you can use to blanket yourself, and if you don't want to be heard, then you should. If you're talking politics and sharing copyrighted shit, you're not likely to be at extreme risk of punishment. I'm pretty comfortable using Windows 10 for gaming and for ease of hosting my media server, BBS, and main webpage. I use Linux for more privacy intensive conversations. I know they track me. But I also have Hitman, AdGuard, a high grade VPN, TOR, I2P, and several end-to-ends for talking about shit they hate. Christianity, Constitution, InfoWars, guns, bombs, Hitler, and all that shit. Knowledge shouldn't be illegal, but it threatens your slave masters.\n\nThat being said, if you're more interested in Meth, Uzis, Kiddy porn, and Zero Days... well you're fair game. Someone's going to catch on sooner or later, and it won;t be your security system, it'll be you. Better find a public place for that shit.",
				"added": 1568936711
			},
			{
				"comment_id": 3,
				"body": "> [heretichunter](#comment_2_1MTxJHycYg5VBaCZUPg96nZt3RAYsrKJBe): There are several layers you can use to blanket yourself, and if you don't want to be heard, then you should. If you're talking politics and sharing copyrighted shit, you're not likely to be at extreme risk of punishment. I'm pretty comfortable using Windows 10 for gaming and for ease of hosting my media server, BBS, and main webpage. I use Linux for more privacy intensive conversations. I know they track me. But I also have Hitman, AdGuard, a high grade VPN, TOR, I2P, and several end-to-ends for talking about shit they hate. Christianity, Constitution, InfoWars, guns, bombs, Hitler, and all that shit. Knowledge shouldn't be illegal, but it threatens your slave masters. [...]\n\nI just realized I didn't even leave the original point.... I agree with your critics. Provide proof. lol",
				"added": 1568936833
			}
		]
	},
	"comment_vote": {
		"16_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"190_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	}
}