{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Qu'est-ce qu'un discours de \"haine\" ?",
			"body": "Discours de \"haine\", incitation à la \"haine\", des termes que l'on entend fréquemment dans les médias ces jours-ci.\n\nMlaheureusement, si l'on ne m'explique pas le concept philosophiquo-moral et légal derrière, il m'est actuellement impossible de comprendre de quoi il s'agit.\n\nJe comprends discours. C'est assez simple. L' acte de transmettre un contenu généralement sous la forme de prose.\n\nDéjà, le terme incitation, m'est peu clair. Inciter. Donner l'envie de? On peut peut-être comprendre l'incitation comme étant un discours transmettant la volonté d'un emeteur à un recepteur? A mon avis cela présuppose donc à la fois une volonté préexistante du récepteur, que l'emeteur va essayer de remplacer par la sienne.\n\npar exemple, je t'incite à répondre, au du moins à relfechir a cette question. Donc ma volontée, celle de te voir répondre ou reflechir, j'essaie de te la transmettre.\n\nEt donc, tu as une volontée. Tu peux le faire ou pas. Tu es libre.\n\nA partir de quel moment, je pourrais avoir une responsabilité de ce que tu fais avec ta volontée? \n\nC'est pas parce que je te dis de sauter par la fenetre que tu dois le faire.\n\nCar par définition, c'est une incitation. Il n'y a pas de menace, ni d'obligation de ta part, de deja recevoir l'incitation de ma volonté.\n\nA mon avis. c'est très très important, car cela pose la question de savoir si tout les êtres humains sont dotés d'une volontée propre, individuelle et indivisible. \n\nIl me semble que l'on a compris les termes de discours et d'incitation.\n\nMaintenant la haine...\n\nAlors c'est la que cela me fait rire. Je ne comprends pas.\n\nEt sincèrement ce que cela signifie.\n\nOn peut peut etre commencer par dire que la haine c'est le contraire de l'amour.\n\nJ'aime qqn, je hais qqn. J'aime le boudin, je hais... c'est plus dur de hair de la nourriture :).\n\nJ'aime une chanson, je ne supporte pas une autre... \n\nJe pense qu'on commence à avoir une certaine idée du concept de \"haine\". \n\nIl faut peut-être distingué du concept de \"rage\", qui n'a rien à voir.\n\nAvec la fameuse popularisé par les gueux des banlieus, j'ai \"la haine\", c'est-à-dire une emotion intense de rage lié à phénomène qu'il (généralement) n'aime pas. J'ai la haine, il a mis du porc dans mon kebab :).\n\n(la je me marre).\n\net c'est la, à mon avis, qu'on arrive au centre du problème.\n\nla haine en tant qu'émotion, d'expression d'une volonté, non animé dans l'espace réel, ne peut pas être criminalisé. Cela revient a légisferer sur la pensée, la volonté, le non-être.\n\nDe la même un discours ou toute forme de transmission d'un message ne peut l'être également.\n\nDans le sens que cela serait denié l'humanité du recepteur. \n\nSans rentrer dans la technique de la haine, qui définit ce qui est \"haine\", ce qui peut-être haine.\n\nJe comprends bien que c'est une vision très libre, placant un accent total envers la responsabilité de celui qui fait et non celui qui dit.\n\nJe pense que pour bien comprendre cela, il faut se referer aux grands penseurs de la liberté d'expression dit orgininaliste et autres fondateurs des etats-unis d'amériques.\n\nIl est tout a fait légal de vouloir dire \"je veux tuer le président des états unis\" ou \"il faut tuer le président des etats unis\". \n\nPour bien comprendre, il faut bien distingué le verbe de l'acte.\n\nEt donc c'est l'expression physique de la \"haine\" ou la \"rage\" qui est surveillé ou potentiellement répréhensible. \n\nDans ce cas concret, les petits bonhommes du fbi, vont simpler aller voir s'il y a des préparatifs réels... sinon c'est juste du discours... de \"haine\" si cela vous fait plaisir. Mais rien de répréhensible.\n\nEt c'est la ou on en arrive à la repartition et l'allocation des ressources policières et du sentiment de justice.\n\nOn peut etre enervé, décu et se sentir trahi la présence de ce porc dans ce sandwich turk, sans avoir à faire justice soit meme.\n\nPour cela il faut pouvoir avoir confiance. \n\nDeuxiement et cela rejoins la guerre contre la drogue ou psychoactif créant une dépendance biologiquo psychologique, je peux comprendre que certains voudraient voir le monde à leur image. \n\nMalheureusement cela n'est pas possible.\n\nEt finalement ces lois spécifiques pour certains groupes de la population sont totalement immorale et déstabilisante.\n\nJe rappelle, c'est le geste, pas le mot.\n\nQuand un juif se fait taper dessus, ce n'est pas un crime antisemetique, c'est juste un acte de violence, comme si c'était un papi, une mamie, ou un chien.\n\nCe que j'essaie de dire, c'est Simplification, sinon, on, ou en tout cas moi, je n'y comprends rien.\n\nEt c'est la d'ou vient la véritable destabilization. \n\nOn comprendra aisement que pour certains, dire simone veil n'a rien du sur polanski est une trahison fondamentale, est anti semite. \n\nCelui qui ne le voit pas est fondamentalement un enemi de la republique.\n\nMais y a t'il un crime?\n\nElle a le droit legal de soutenir, proteger, defendre, devier la conversation, occulter, et financer polanski... et bien sur l'ensemble des protagonistes peut également legalement le faire.\n\nMais cela reflete les valeurs réelles de ceux ci.\n\nDe la meme manière quand qqn écrit que l'imam de bordeau est un enemi domestic de la republique, cela est pour certain une incitation à la haine, ou eventuellement un texte de haine.\n\nMais pour moi c'est très clair, il place la sharia, loi coranique au dessus la loi des hommes, visible, par son argumentation de dire, que c'est par le coran qu'on devient citoyen.\n\nCe comportement, ou pensée est intolerable dans certaines civilisations.\n\nCar cette homme vicieux (injure), qui a le meme regard que tarik ramadan (double injure?), illustre parfaitement, dans cette ligne, comment la moindre restriction à la liberté d'expression va être utilisé et transformer d'une bataille des idées (eventuellement a une surenchère des incitations à la haine) en un conflit juridique legal, qui au final, sera egalement une bataille violente, entre chaque groupe essayant de criminaliser le discours des parties adverses.\n\nEt je pense que c'est la l'illustration des différences entre l'amériques fondamentalistes et le reste du monde.\n\nSoit on peut parler liberement et decider calmement qui on va buter aujourd'hui, soit c'est Free For All (que le meilleur gagne, celui qui tue le plus) et on décide une fois que c'est tasser...\n\nau fond cela devient tellement technique qu'à la fin on perd la vision de la réalité et de ce qui se passe réellement.\n\ndes tournantes, au climat d'occupation et d'invasion, à cette américaine dont les parents ont potentiellement libéré la france des nazis, a ne meme plus pouvoir parler de plantes ou de technologie, mais ou va t on...\n\nEnsuite, on censure l'ancien testament?\n\nahh non ca on va pas faire...\n\nmais qu'est ce que ca change... \n\njuste des mots...\n\ny a rien. le concret... \"RE\" ce qui est... \n\nCe qui est marrant c'est que cela reflete egalement l'opposition ferme aux votes populaires... Y a vraiment se desir d'asservir, à la fois dans la pensée, mais également dans la repartition partagé des decisions collectives.\n\nOn peut en conclure qu'il n'y a pas de bonne foi, c'est à dire que cela ne sert pas l'interet general, commun, collectif et individuel dans un souci d'harmonie, de paix, d'emancipation spirituelle et d'expansion economique.\n\nC'est ce qu'on appelle une base solide, pour faire fasse aux défis du quotidien :).\n\nD'ailleurs l'autre imam, avec son \"les profs sont sacrés\" on capte bien l'incitation... et ca marche pas. \n\nQuelle est la loi supreme de la republique populaire de chine ? S'il répond la constitution chinoise, il peut etre entrain de mentir, comme recommander dans sa \"constitution\"... a verifier.\n\nfranchement, ils sont cools les jumpsuits bleus :). quoi? c'est un discours de la haine? une incitation? et bien allez vous expliquer avec les autorités de Beijing... ca va etre chaud de faire le petit rouquin sioniste sur les plateaux tv de chine... il y aura des consequences... inclus l'execution. et voila... \n\nc'est fait... comme dirait voltaire... \n\nalors les leeches, vous cherchez quoi comme film pour vous abrutir :) ahahah.\n\nps allons voir si cette incitation au discours sur la haine portera ses fruits... dans quelque temps, il faut que les propagandistes de la pensée unique se concertent avec les censeurs et leurs équipe psychologique pour trouver la meilleure reponse, qui est generalement attaquer l emeteur... bonne chance avec \"china\" :D. byebye",
			"added": 1603355001
		}
	],
	"topic_vote": {
		"1_15pe7NSQ52usshTYXSVVkLkeocq9qkHJsY": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}