{
	"next_comment_id": 4,
	"user_name": "Gaypidoras",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {
		"1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi_1557306635": 1561767909,
		"1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi_1555590046": 1561767947,
		"1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi_1554994831": 1561767961,
		"1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi_1554467305": 1561768016,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1561836880": 1561853599
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "What don`t you like the United States?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1561561598",
			"date_added": 1561817640
		},
		{
			"comment_id": 2,
			"body": "@Styromaniac: I will say this, I am not an American, and I can talk about America and its politics at least less than an American. But I want to convince you - you live really is not bad. At least when compared with Russia. Real incomes of the population are falling, a huge social stratification, uneducated cattle, huge military spending on other nonsense, corruption, the list goes on and on. And if you think that Putin is good, this is not so. He heads it all. We in Russia have a saying - the fish rots from the head. (and maybe it is not Russian, I do not know). In any case, I wanted to convey only that in the United States maybe not everything is good, but at least they are trying to do everything for people. We do everything only for Putin, his gang and accomplices, (except minor accomplices). There are not even trying to do something for the people. And cattle here too much. Of course there are differences - for example, as you wrote, you all fall into political extremes, on the contrary, we have a huge number of people apolitical (their typical excuse: \"politics is filthy\", \"I am above it\", etc.). But it is precisely on such apolitical, spineless people that Putin’s regime holds on. I love my country. But I hate this state. And what is even sadder, I despise the \"people\" who live on its territory.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1561561598",
			"date_added": 1561847582
		},
		{
			"comment_id": 3,
			"body": "@Styromaniac: I may underestimate corruption in the United States, but I'm sure you can't even imagine the scale of ours. Can see the investigation of opposition leader Navalny called \"he is not dimon to you\" https://www.youtube.com/watch?v=qrwlk7_GF9g",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1561561598",
			"date_added": 1561851281
		}
	]
}