{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "香港抗暴运动，人数远超预期",
			"body": "香港在8月份发起的反抗支那蛆的维权运动，规模宏大。\n苹果日报引述发言人岑敖晖指，游行人数远超预期，是继雨伞运动后最多人参与的游行集会。最新消息指，人数超过14万。http://bit.ly/2ihkXc3  “彼以律令为后盾，我以真理作前驱”，这横幅好！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**\n\n**[科技与新文明变革—有害还是无害，这并不是关键，关键是选择决定的权利!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ )**",
			"added": 1503924534
		},
		{
			"topic_id": 2,
			"title": "周小平就是升级版的雷锋！",
			"body": "周小平这个肮脏的家伙，是中国文化界、娱乐界和媒体界的灾难，这个绿帽子戴大了，能享受在绿帽子上跳舞，在绿帽子上享受精彩人生的人，非周小平莫属。这样的人谈爱国，是对中国的八零后、零后和零零后的奇耻大辱！！——郭文贵\n\n毛泽东当年让假冒的毛岸英死在朝鲜，霸占了假毛岸英的媳妇，其手段与孟建柱操纵周小平的手法类似，只是那个时代信息不够发达，也没有郭文贵这样的情报特工大举揭露。假如毛泽东对雷锋的妻子感兴趣，也完全可以制作出一个类似周小平的雷锋，而在那个愚昧的时代，热烈鼓掌的人们会比申纪兰更加兴高采烈，直到林彪在九一三事件中机毁人亡，才让民众连鼓掌的热情都被吓没了......\n\n21世纪信息科技更加发达，支那丛林暴政却更加残酷。但是，泸州事件和唐山穆斯林抗暴事件说明，跨地区、跨民族的大联合，是可行的。港澳台和遍布全球的华人联合起来，反蛆除孽，恢复人性，恢复中华！！",
			"added": 1505621484
		},
		{
			"topic_id": 3,
			"title": "郭文贵爆料：天上宫殿与地上蝼蚁",
			"body": "https://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n\n以上这个链接，是热心的网友们分享的。传统的分享链接在视频传播方面，效率还是更高一些。所以对于传统的分享链接，应该大力支持！！\n\n与早期的精华视频比起来：\n天上宫殿与地上蝼蚁这个视频更加震撼。把天上飞行的波音787宫殿与地上的杨改兰、退伍老兵们做对照，同时列出盗国贼们巨额的海外财富。短短几分钟的视频，内容简短有力，极其震撼！！ 强烈推荐！！墙内不了解郭文贵的人们，强烈建议：首先观看天上宫殿与地上蝼蚁这个视频！\n\n+  **[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** ",
			"added": 1505622026
		},
		{
			"topic_id": 4,
			"title": "中华联邦不只是“四分五裂”，而是“万分亿裂”",
			"body": "未来的中国不只是“四分五裂”，而是“万分亿裂”，或者更准确地说，应该是“亿差万别”— 因为尊重每个公民独特精神主权的社会，才可能真正地维持“和而不同”的文明底线；换句话说，要维持“和而不同”的文明底线，就必须尊重“亿差万别”的人类社会之最基本的文化特征。 \n \n美国社会能够包容全世界的所有民族文化，并将其汇聚成一个文化的“大熔炉”，其根本原因是因为美国的华盛顿、杰弗逊等开国元勋们采纳了“持枪权捍卫人权”的基本原则，在精英阶层比较妥当地落实了孔子强调的“己所不欲、勿施于人”的普世原则。而枪支的火药来自于中华文明，因此，可以说美国文化是吸收了中华文明之后，反而比赵宋王朝更加规范地传承了儒家文化的“核心理念”，与“己所不欲、勿施于人”的普世原则相对应的，是对自由的规范—正当的自由是“不侵犯别人的同等权利的自由”(freedom without violation of other people's equal rights)。\n \n+ 每个人都想代表真理。追求真理的权利毫无疑问是人权的重要因素。中国文化不大喜欢尖锐的批判，而是喜欢“歌颂吹捧”。人人都想成为“真理”的代表，都想成为被“歌颂”的对象。既然每个人都代表着“真理”，那么，为了维护他们的“真理”，自然应该推行“持枪权捍卫真理”的基本原则。\n \n枪支的火药本来就来自于中华文明。无论是从尚武精神的中华文明来看，还是“和而不同”的传统文化来看，“持枪权捍卫真理”的原则都应该作为最基本的法治规范纳入中华联邦的文明体系之中，作为最底层的法治规范，发挥自然法的作用，在社会文化的最底层，规范人类文明不断变化的各种激烈博弈。\n \n“真理”有“相对真理”和“绝对真理”的说法。\n古中华文明的周易哲理，和马克思的辩证唯物主义都已经充分论证了：矛盾和运动是永恒的， 绝对的真理不存在，任何一个具体的事物都无法代表“绝对永恒的”、“僵化不变的”“绝对真理”。“绝对真理”是无数个“相对真理”的总和，是“矛盾永恒”、“永恒变化”的一个特殊概念。 每一位追求光明的个体，最多只能代表其独特时空的相对真理；没有任何一个人能够代表“绝对真理”的绝对权威，对整个地球进行“永久”的专政。\n\n在理论层面，做个简单的总结，没有矛盾的“大同世界”、“共产主义”之类的理想状态本身违背了“矛盾永恒”的马克思主义和古中华文明的周易哲理。但是，**“世界大同”很难， “原则小同”**却是可行的，这个最基本的小原则就是“持枪权捍卫真理”的普世原则。 在“持枪权捍卫真理”的基础上，才会有真正可持续的、相对稳定的、持久的“和谐社会”和“和平地球”。 \n\n从哲学层面深入思考“相对真理”和“绝对真理”的辩证统一，多数普通人可能需要一段时间，才会慢慢接受。穆斯林文化存在部分偏激的因素，被“伪共”“匿产帮”支那蛆虫党过度专政洗脑的部分中国人也存在着比较偏激的倾向，偏激的倾向容易把具体的人或事物歌颂到“绝对真理”的级别，以满足他们无限贪婪的“专政”欲望。\n\n+ 跟那些偏激的支那伪类们争论、讲理，很多时候是没用的。所以比较妥当的方式是调整思维，顺着他们的“忠诚不绝对，就是绝对不忠诚”的“宇宙真理党”逻辑，既然“宇宙真理党”是代表“宇宙真理”的伟光正，为了维护这么绝对的“伟光正”，那更是非常有必要推行持枪权捍卫真理的普世原则，去维护他们“千年圣君”、“万古圣君”的“神圣不朽”！\n\n具体展开，比如：\n《古兰经》是否每句话都是“真理”，那是次要的逻辑。最重要的是，把《古兰经》每句话都当成“真理”的人们，为了维护“神圣化”的真理，自然有必要推行持枪权捍卫真理的原则。如此，自然就避免了世俗的“人”取代“神”而导致类似“教皇专政”的纳粹大屠杀、古拉格群岛、粮食浮夸风之类的灾难。\n\n同理，“毛泽东思想”、“习近平思想”等等是否每句话都是“真理”，那是次要的逻辑。最重要的是，把“毛泽东思想”、“习近平思想”每句话都当成“真理”的人们，为了维护“神圣化”的真理，自然有必要推行持枪权捍卫真理的原则。如此，自然就避免了世俗的“人”取代“神”而导致类似大饥荒、粮食浮夸风之类的人间灾难。\n\n把马克思当成真理教皇的人们请注意，马克思说：矛盾和运动是永恒的。所有的事物都是在不断运动变化之中。这种智慧也符合古中华文明的周易哲理。\n\n在中世纪时，基督教也面临过宗教领袖利用民智不开的文明漏洞，以人取代神的地位，搞类似“无神论”专政的“教皇专政”，披着“神”的外衣，实际上搞的是亵渎神灵的“无神论”专政。历史上迫害布鲁诺的宗教灾难一直都是西方文化的深刻教训，无论是信仰基督教，还是信仰天主教的人们，都不会忘记这个教训。为了让神圣的世俗“人权”和“神圣”的宗教信仰不冲突过于激烈而导致类似古拉格群岛、粮食大饥荒之类的“教皇”专政式的人间灾难，于是，一群新教徒 “清教徒”们引进了中华文明的火药枪支，施行持枪权捍卫人权的宪政制度，结果无意间，反而比诞生于东方的儒家文明更加完美地传承了孔子经典理念 — “己所不欲，勿施于人”。\n对于儒家经典理念，杰弗逊的论述也很简洁，正当的自由，是不侵犯别人的同等权利的自由(Righteous liberty is freedom without violation of other people’s equal rights)。这种论述，与\n孔子“己所不欲，勿施于人”的论述是很相近的。\n但他们最大的不同点仅仅在于，在世俗生活的行动层面，吸取了中华文明的火药枪支，坚决施行持枪权捍卫人权的宪政共和规范。\n\n其它层面的人性之善和人性之恶，无论是东方文明、西方文明，还是中东的伊斯兰文明，人性的无限复杂、无限丰富、无限多样性，都是一样的。\n\n+ 这些简单的事实说明，持枪权捍卫真理的制度能够突破“教皇专政”的人间灾难。\n\n要让人类维持长久的和平，就应该让所有的宗教信仰都彻底地予以“神圣化”。彻底“神圣化”的简单逻辑就是，无论人们信仰的是哪一个“神”，只要他有良好的诚信记录，就可以拥有持枪权捍卫真理基本权利。对于伊斯兰教可能被极端势力绑架的担心，如同对于“伪共”匿产帮被支那蛆虫绑架的担心一样，最好的方法，不是从整体上与整个“伪共”匿产帮或伊斯兰极端势力为敌，而是在文化信仰上予以彻底的“神圣化”。彻底“神圣化”的简单办法，就是他们所推出来的任何一个领袖，无论智商高低，都可以歌颂到“千年圣君”、“万古圣君”的“神圣不朽”的级别；同时，不要忘记了，既然是“万古不朽”的“神圣真理”，为了维护他们的“神圣真理”，自然应该推行持枪权捍卫真理的原则。推行持枪权捍卫真理，是一个最基本的文明规范，是捍卫普世价值的基本原则，在这个最基本的原则规范之上，各种宗教信仰和言论自由将畅行无碍。\n\n+ 1949年前，文盲那么多，是用黄豆替代选票，在那种情况下，华北地区仍然有很多民兵持有枪支。是持枪权捍卫真理的现象，导致毛泽东不敢制造粮食浮夸风、大饥荒。现在文盲少很多，当然更适合推行持枪权捍卫真理的文明规范。\n\n把公民的的诚信品格和持枪权资格关联起来，在信息时代是完全有可能的。具体如何实施，需要全体公民参与大讨论，那是另外一个话题了。\n\n在实践层面，人们永远只能是在无限多样化的“矛盾运动”之中，化解各种矛盾， 无限接近于，但却永远达不到一个毫无矛盾冲突的“理想文明”，因为没有矛盾的具体事物不存在。 所以，“敢战才能言和”，符合国家之间的“和平共存”理念；尚武才能赢得尊重，符合和谐社会所不可缺少的、“和而不同”的中华传统。这一切的努力，归根结底，只是为了实现被“三纲五常”的儒家糟粕刻意掩盖、扭曲了的儒家核心理念“己所不欲、勿施于人”—现代版的话语—不侵犯别人的同等人权。\n\n+ 真正四分五裂的不是民间维权群体。支那蛆虫党内的派系争斗才是真正的四分五裂。一般来说，每个派系或团伙中都有少数顽固的死硬派—伪类精英。高明的权术家们往往利用伪类精英们对权力的贪婪，刻意制造出各种文化矛盾。有迹象表明，支那蛆虫党内激烈的派系争斗而激发的权术操纵刻意制造出与专政体系相对应的“台独”、“港独”之类的派系。一些 “台独”、“港独”精英，其智商水平与偏激倾向，类似高明的权术家，跟他们争论，往往也是徒劳的。对于把“台独”、“港独”当成“宇宙真理”的人们，也可以顺着他们的逻辑，既然“台独”、“港独”代表着“宇宙真理”，那么，非常有必要推行持枪权捍卫真理的原则。 以持枪权捍卫真理的基本原则为基础，对任何重大的事件表决，都会发现，真正偏激的极端势力，往往都是少数派，因为多数人都是爱好和平的。这种现象在任何地方都一样。1949年前华北地区民兵普遍持有枪支，毛泽东再偏激极端，也不敢制造粮食浮夸风，也是这种原理在起作用。\n\n所以，最重要的是，持枪权捍卫真理是和平共存的社会秩序得以长久存在的基本原则。\n+ 支那蛆虫党激烈内斗，毫无人性；对党外的残酷镇压则更加野蛮，这意味着民众大联合非常有必要。推翻支那丛林暴政，才能重建文明秩序。\n江青在秦城监狱自杀，邓小平洋洋得意，但不会对民众宣传。蛆虫党的内斗再激烈，也只是内爆式的互相倾轧，不会直接倒塌。\n\n孟建柱篡夺江泽民、江绵恒的皇帝权力，夺权前跟1949年前的毛泽东一样谦虚，对江泽民是鞍前马后献殷勤，但在篡权后，直接把江家的文化代言人宋祖英踢开；江泽民、江绵恒等则因为与孟建柱狼狈为奸，罪恶累累，被篡权的蛆虫皇帝，只能是哑巴吃黄连，有苦说不出。 \n\n孟建柱夺权前后对江家的态度巨变，如同天壤之别。这种现象说明，在一个特务权术猖獗横行的匪帮内，江泽民的中毒事件，不排除是孟建柱刻意安排的结果。孟建柱家人在器官移植后很健康，但是江绵恒则经常为病痛折磨，从特务权术来看，不排除江绵恒的器官移植也被人做了手脚。\n\n+ 宋祖英被踢开，曾贵为皇帝的江家也只能是逆来顺受，即使有几万亿美元的海外资产，也是远水救不了近火，被孟建柱的刀把子顶在江家的脖子上，枪杆子顶在江家的后腰上，各种罪恶证据又彼此到处备份，在恐怖平衡的“歌舞升平”外表下，到处都是毫无人性的、丛林般的争夺、杀戮，无人能够安宁。\n\n没有持枪权，只有选票的民主本来就是跛脚的。一旦遇到希特勒、斯大林之类的伪类精英，跛脚的民主很快就会垮塌。蒋经国当年放开党禁报禁，只是形势所逼而已。\n\n+ 蒋经国的政治改革不够彻底，没有推行以持枪权捍卫真理的原则，这是台湾一些日裔后代敢公开给台湾华人贴上“支那猪”标签的深层次因素。简单地说，如果港澳台地区自认为比大陆的体制更先进，那么，港澳台非常有必要率先创建持枪权捍卫真理的新文明。如果港澳台没有这个意识，”支那猪“的耻辱离“支那蛆虫专政”的丛林暴政只有一步之遥。\n所以，对于大陆的丛林暴政，港澳台地区，尤其是台湾人，没有袖手旁观的理由。\n\n+ 每个公民都有其独特的个性、独特的精神主权需要尊重。“万分亿裂”的中华联邦，是指尊重每个公民个体精神主权的中华文明，用褒义的话语描述，就是尊重“亿差万别”的公民个性的中华文明。“万分亿裂”、“亿差万别”，却能够维持“和而不同”的大局平衡，其关键在于持枪权捍卫真理的基本原则，作为最底层的法治规范，让多数人都懂得珍惜孔子“己所不欲、勿施于人”的自由理念。\n\n中华联邦，简单地说，就是在政体上恢复“宪政共和”的法治框架，在文化上创建一套“尊重持枪权、尊重生命”的法治规范，通过信息时代的文明合力，尊重每个公民“亿差万别”的“个体精神主权”之无限多样性，在“持枪权捍卫真理”的原则小同的基础上，不断地接近可兰经、圣经、“共产主义”以及其他哲学家们可能不断制造出来的、无矛盾冲突的“理想文明”。\n\n**唐山事件的启示：汉族和穆斯林可以联合起来，反抗支那暴政\nhttp://127.0.0.1:43110/zybbs.bit/?Topic:2_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ **",
			"added": 1505805272
		},
		{
			"topic_id": 5,
			"title": "王岐山遭遇瑞士政府最後通牒！",
			"body": "瑞士政府最後通牒，要求海航在十月三號17:30 分之前，公佈和說清實際控股人和股份去向，否則就會下達一個法律法規層面的判決通告，這個通告將視海航的' 白手套' 和'代持' 為欺騙。如果這一判決通告作實了，所有西方國家將以此為依據對海航調查和起訴。",
			"added": 1506166161
		},
		{
			"topic_id": 6,
			"title": "孟贱柱绑架江泽民、江绵恒，一起为非作歹，直到地狱",
			"body": "文贵爆料：孟贱柱与江绵恒的生死之交是从2004一2008年，3次在南京军区医院换肾开始的。配型找肾源由孟负责，共杀5人2个不配对。国际著名肾脏专家黎磊石2010.4.16跳楼。北京44岁的肾内科教授李宝春也在2007.5.4日跳楼，为毁灭遗留证据江家族又制造2014年马航失踪事件。\n\n孟建柱夺权前后对江家的态度巨变，如同天壤之别。这种现象说明，在一个特务权术猖獗横行的匪帮内，江泽民的中毒事件，不排除是孟建柱刻意安排的结果。孟建柱家人在器官移植后很健康，但是江绵恒则经常为病痛折磨，从特务权术来看，不排除江绵恒的器官移植也被人做了手脚。\n宋祖英被踢开，曾贵为皇帝的江家也只能是逆来顺受，即使有几万亿美元的海外资产，也是远水救不了近火，被孟建柱的刀把子顶在江家的脖子上，枪杆子顶在江家的后腰上，各种罪恶证据又彼此到处备份，在恐怖平衡的“歌舞升平”外表下，到处都是毫无人性的、丛林般的争夺、杀戮，无人能够安宁。\n没有持枪权，只有选票的民主本来就是跛脚的。一旦遇到希特勒、斯大林之类的伪类精英，跛脚的民主很快就会垮塌。蒋经国当年放开党禁报禁，只是形势所逼而已。\n蒋经国的政治改革不够彻底，没有推行以持枪权捍卫真理的原则，这是台湾一些日裔后代敢公开给台湾华人贴上“支那猪”标签的深层次因素。简单地说，如果港澳台地区自认为比大陆的体制更先进，那么，港澳台非常有必要率先创建持枪权捍卫真理的新文明。如果港澳台没有这个意识，”支那猪“的耻辱离“支那蛆虫专政”的丛林暴政只有一步之遥。\n所以，对于大陆的丛林暴政，港澳台地区，尤其是台湾人，没有袖手旁观的理由。",
			"added": 1506219413
		},
		{
			"topic_id": 7,
			"title": "刘延东副总理狼狈逃串",
			"body": "中共副总理（刘延东）近日来纽约哥伦比亚大学作中美关系演讲，访民们公开其一路睡上去的盗国贼劣迹，并将其围剿在哥大校园里。这位“伟光正”的副总理吓得大门都不敢走，狼狈逃串！\n\n网友评论：国务院副总理刘延东任“足球改革领导小组”组长一事，足可判断习包子的水平与为人。古代尚有“公仪休嗜鱼拒鱼”的故事，习包子有权力而不知道节制，为了满足个人喜好，让国家副总理直接越过体育总局去操心足球的改革，无视行政伦理，荒天下之大谬！\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n",
			"added": 1506521967
		},
		{
			"topic_id": 8,
			"title": "武汉几十个大学生集体失踪，真相恐怖！",
			"body": "武汉几十个大学生集体失踪，真相被刻意掩盖，说明活摘器官的可能性非常大。现在都有体检，普通人的一切身体信息都有记录，如果有需要就可以“失踪”，以方便“精英”人士更换器官。\n\n网友评论：年轻人一定要培养危机意识和解决生活问题的能力。记得有一次在北京车站看到一位二十岁左右的姑娘在墙边啜泣，数名汉子见狀，不怀好意的围了过去，情况危急。我和朋友上前解围，那些汉子才一哄而散。询问之下，才知那姑娘是个高校生，和朋友到北京旅游，卻掉队沒搭上车。当然，在大家協助下，帮她找到了同行的友人，解除了危险。令人感叹的是，一个成年人，还是高校生，遇到状况卻只会哭，真让人担心。\n《圣经》警告过我们：魔鬼如同吼叫的狮子，遍地巡行，寻找可吞吃的人！\n大家一定要提高警觉！﻿\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1507006756
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1_1Cs1wctV42ojYoAostUqqTweB7tvUyRKdJ": [
			{
				"comment_id": 1,
				"body": "顶！伟大的习核心连续几年依法治国，各种丰功伟绩可能争议很大。但最没争议、最伟光正的事迹应当属于翻越网络柏林墙，不经意间似乎有点要统一虚拟主权的意思。但是法西斯重庆居然冒天下之大不韪，把习核心的翻墙救国精神污蔑为犯罪。是可忍，孰不可忍！各地军民应当紧密团结在以习近平为核心的党中央周围，跨越网络柏林墙，统一虚拟主权。能去北京的人们，去北京抗议。不能去北京的，就地奋起抗争。洗雪当代国耻、废除辱习法规！\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:8  \nhttps://bit.surf:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:1",
				"added": 1492960192
			}
		],
		"3_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 2,
				"body": "一些疑似五毛党的人员来到零网发布所谓变态往事之类的垃圾，那种信息建议予以限制。",
				"added": 1499249514
			}
		],
		"1_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 3,
				"body": "> [flyingpanda](#comment_1_1AztBTbD25eZtkKSsmUjQG8MXKP3KQQSy): 毛泽东并没有食言。文革当中人民有大鸣大放大字报大辩论的自由，甚至人民可以将国家主席拉去游街。他本人完全是因为革命年代积累的威望太高导致无人敢反对他而已。\n\n这位网友是真心的支持毛伟人吗？如果是真心的支持毛伟人，就应该比文革时期的群众更真诚，在把毛伟人歌颂到“万岁不朽”的级别时，要坚持推行以持枪权捍卫“万岁”真理的原则。毛伟人在1949年前不会过度背叛民主宪政的原则，没有制造大饥荒之类的灾难，主要是因为华北地区不少民兵拥有枪支，而黄豆选举只是辅助性的因素。\n与此同理，把法轮功歌颂到“真善美”的程度，却不敢坚持以持枪权捍卫类似“伟光正”的“真善美”的真理原则，有同样危险的倾向。",
				"added": 1501208886
			}
		],
		"3_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 4,
				"body": "不少人，尤其是被支那专政病毒洗脑过的异类，存在一个倾向，把别人的逻辑思维当成垃圾。这也无可厚非，符合人类天性中天然含有的“自私”的一面。但更重要的是，人类还有追求光明的“善”的一面，“自私”在某个角度也可以理解为只认为自己的东西是最好的，别人的东西都是垃圾废物！这个逻辑也可以理解。但糟糕的是，认为自己的东西是最好的，别人的东西都是垃圾废物的支那专政异类，如果他们是真心地认为他们自己的东西是最好的，那么，他们就应该有理由相信，既然自己的信仰是最好的，是代表“伟光正”、“真善美”的宇宙真理，那么，既然都是宇宙真理了，毫无疑问，应该毫不犹豫地推行以持枪权捍卫宇宙真理的原则。至于这个宇宙真理到底是“伟光正”，还是“真善美”，那是次要因素。最重要的是，任何一个美好的事物，包括“自私”或者“无私”的理念，只要他是真心地维护他的理念，都应该推行以持枪权来捍卫他的“理念”。“信仰”、“理念”没有最高级别；以持枪权来捍卫各种“理念”、“信仰”应当属于世俗法律所规定的最低级别的“神圣”信仰。在此基础上，才能摆脱支那专政丛林，迈向文明。宋太祖赵匡胤有很好的理念，但是因为无法推行以持枪权来捍卫赵氏信仰，结果只是一只脚迈出了丛林，最终导致崖山之后无中华，支那病毒蔓延近千年。\n这些小论述，算是抛砖引玉吧。既然有不少疑似五毛党的人员光临驾到零网，请更多网友们积极发挥自由论坛的自由思维，让零封锁的零网信息世界真正地给中国带来百家争鸣的新鲜空气。",
				"added": 1501210377
			}
		],
		"9_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 5,
				"body": "随着零网节点不断增加，五毛党和七毛党也到零网骂人了。恶毒的攻击如果是太多了，建议论坛管理员予以适当的限制。因为杰弗逊说过，“自由”的内涵是“不侵犯别人的同等权利”。假如五毛党、七毛党们恶毒的攻击或者险恶的间谍钓鱼信息太多了，那就是破坏了“自由”的内涵。而自由论坛的管理员毫无疑问是有“内涵”的人士，与支那蛆虫是有天壤之别的**华夏新民**。\n更应该顶起来的帖子是突破网络封锁、统一虚拟主权的信息。 \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
				"added": 1503199548
			},
			{
				"comment_id": 6,
				"body": "说郭文贵低级的支那蛆们无疑是“伟光正”的代表，既然是“伟光正”的宇宙真理，为了维护这么伟大的宇宙真理，就非常有必要推行持枪权来捍卫“宇宙真理”。如果他们不敢推行持枪权来捍卫“宇宙真理”,那么，他们就没有谈论“真理”的资格。五毛党、七毛党的逻辑混乱还在于，既然把毛泽东捧上了“万岁”神坛，却不敢坚定地要求推行持枪权去捍卫“万岁不朽”的毛伟人， 以致于五毛党们其实一直都是拖累支那蛆虫帮的毒瘤而已。毛泽东在世时，五毛党们像申纪兰一样不断地举手拍马屁，让老毛在自欺欺人的狂热暴政中跌入深渊；毛泽东去世后，五毛党们又像申纪兰一样不断地拍邓小平的马屁，个个兴高采烈地看着江青、毛远新等被送进支那蛆的人间地狱。\n薄熙来、毛远新等人没有像雷洋那样被人间蒸发，但是支那蛆的大粪坑暴政已经维持不下去了 .... \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**\n\n**[科技与新文明变革—有害还是无害，这并不是关键，关键是选择决定的权利!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ )**",
				"added": 1503899532
			}
		],
		"1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD": [
			{
				"comment_id": 7,
				"body": "郭文贵为杨改兰仗义直言 \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/",
				"added": 1503899979
			}
		],
		"1_1MQUEdi3kDb9u2o1gNLywN5Ms9QDQ3sCed": [
			{
				"comment_id": 8,
				"body": "孟建柱连江家代言人“宋祖英”也踢到一边去，可见这个毫无人性的刀把子对江江绵恒、江志成的威胁远远超过了当年的周永康。 这也是支那蛆虫暴政导致人人自危的必然趋势。\n915郭文贵先生爆料直播出现在山东济南市区英雄山“公园民主”论坛，已越来越引起人们对郭七条及揭露中共本质的共鸣。当地许多上访了多年的访民，在认清上访只是在“忽悠”他们的时候，终于抛弃了它。现在上访民众走进了人流量最多的市区公园，在大庭广众下诉说他们的遭遇及心得。",
				"added": 1505708416
			}
		],
		"4_1MQUEdi3kDb9u2o1gNLywN5Ms9QDQ3sCed": [
			{
				"comment_id": 9,
				"body": "秦始皇都难以持久地专政到万世，支那蛆虫帮更不可能永久地专政下去！",
				"added": 1505737596
			},
			{
				"comment_id": 10,
				"body": "有破才有立。新出现的中华文明，将以“中华联邦”的形式出现。但首先需要推翻支那蛆虫帮的丛林暴政，恢复人性，恢复中华。 \n**唐山事件的启示：汉族和穆斯林可以联合起来，反抗支那暴政\nhttp://127.0.0.1:43110/zybbs.bit/?Topic:2_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ **\n民众大联合，推翻支那丛林暴政！！ ",
				"added": 1505738459
			},
			{
				"comment_id": 13,
				"body": "谢谢网友表达了不同的看法和担心，为了让更多人看到：过于偏激的“共产主义”、“大同世界”、“大一统”之类的洗脑术语可能导致其它方面的偏激结果，经过详细探讨，另外发了一个特殊的帖子：\n** 中华联邦不只是“四分五裂”，而是“万分亿裂”\nhttp://127.0.0.1:43110/zybbs.bit/?Topic:4_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/  **",
				"added": 1505806011
			}
		],
		"4_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 11,
				"body": "欢迎有支那蛆虫特色的五毛党们到零网，说文贵没证据的，欢迎去民主法治的美国控告文贵造谣。所有的官司，一概全包。",
				"added": 1505795617
			}
		],
		"8_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 12,
				"body": "网友已经说得很清楚了：\n从这种低级话题展开探讨，本身就是个很“荒唐”的策略。如同郭文贵的“两极手法”，一边斥骂伪共匿产帮为支那蛆虫、粪坑党，一边却极力歌颂粪坑党魁是“千年圣君”，明眼人都晓得，这是很荒唐的策略；但最重要的是，披着“共产党”外衣，实际上连官员财产都不敢公开的“伪共”匿产帮匪徒们还自称是代表“中华的”、“人民”的、“共和国”，那是更荒唐的事情。以“荒唐”对付“荒唐”，本来就是五千年最荒唐的“盛世”，策略看似荒唐，但是党员数量庞大，多数基层党员跟“匿产帮”没有太大瓜葛，所以看似荒唐的策略，有助于减少大规模的冲突，从历史演变的进程来看，这种策略是比较务实的，对历史负责的策略。\n\n借助于文贵爆料引起轰动效应，而采取的特殊宣传手法，有利于更多人看到新的历史潮流：\n全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。",
				"added": 1505805641
			}
		],
		"3_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 14,
				"body": "网友说：\n为了19大寿终正寝地圆满完成，请不要造谣、不要传谣！\n（注意：寿终正寝地完成 .... )\n\n那些蛆虫们，它们的作法就是在努力把中南海卖掉、把中国卖掉，也要把郭文贵给抓回来，以维持它们的有支那专政特色的中国梦！\n这条信息的风格适合向墙内的朋友们传播零网—零封锁的网络。",
				"added": 1505812770
			}
		],
		"5_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e": [
			{
				"comment_id": 15,
				"body": "郭文贵是塞翁失马焉知非福，诉瑞银UBS纽约法院不受理反而成就了其他诉他案子法院不受理。文贵那5亿美元没白损失。UBS和太平洋对冲基金这两个案例将会导致法院不受理一切对文贵的诉讼。盗国贼们也迅速改变策略，如纽约博讯接着宣布要告文贵。但是文贵已经掌握了这些蛆虫爪牙们的大量特务活动证据，所以在法律途径方面，在民主法治的美国打官司，蛆虫帮必然是一败涂地！",
				"added": 1506058600
			}
		],
		"4_13eQCWHVZGBofzesuAENgDdTz2mS1ACgLS": [
			{
				"comment_id": 16,
				"body": "这里有全球各地的网友，伪共支那蛆虫不可能跨国追捕。所以更应该鼓励网友们热烈探讨文贵爆料，突破封锁。\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )**  \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc",
				"added": 1506421086
			}
		],
		"2_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e": [
			{
				"comment_id": 17,
				"body": "民众大联合，这里的民众不包括支那蛆。 \n\n跨越种族、民族和地区的民众大联合，完全有可能。海外穆斯林的先进代表已经公开站出来声援郭文贵。法国设计师居来提是近期比较显著的代表之一：\nhttps://www.youtube.com/watch?v=4fbJTOqBywE\n我愿倾尽一生支持郭文贵--旅法维吾尔设计师（感谢巴黎张健授权转载）\n美国本土势力主要是盎格鲁·撒克逊人种。以盎格鲁·撒克逊人种为主体的美国精英是完全自发地支持郭文贵，因为他们深切地感受到了支那病毒到处蔓延的威胁。\n\n** “O形”反渗透对抗“C形支那病毒”\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:16_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5/  **",
				"added": 1506522539
			}
		]
	},
	"comment_vote": {}
}