{"cards": [

{
    "card_id": 0,
    "title": "",
    "cost": "",
    "color": "blank",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Incantato",
    "rule": "Chiunque creda che qualcuno debba perdere, ha perso.",
    "date": 0
},

{
    "card_id": 1,
    "title": "Mantra Della Purezza",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "Rimuovi mantra di purezza dal gioco: pesca 4 carte nella tua prossima fase d'acquisizione.",
    "strength": "",
    "extra": "Cosa non è niente, ma senza forma?",
    "rule_title": "Mantra Della Purezza",
    "rule": "Prima dell'inizio ognuno cerca il suo mantra di purezza dalla sua biblioteca e lo scopre davanti a lui. Nel turno zero, puoi rimuovere il Mantra della Purezza dal gioco per attivare il suo effetto (vedi regola 733.734).",
    "pic": true,
    "token": "H1ismCyDm3P6x5zjqoL9hmjQzrn1q8L4uemGSxDJxAk=",
    "taken": true,
    "date": 0
},

{
    "card_id": 2,
    "title": "Sole",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->: Aggiungi un mana incolore alla tua scorta di mana.",
    "strength": "",
    "extra": "... e fu la luce.",
    "rule_title": "Corpi Celesti",
    "rule": "Ci sono due pile di carte: la Biblioteca degli incantesimi e l'Eclittica. Nell'Eclittica ci devono essere 7 corpi celesti di vostra scelta, e vale anche per i corpi celesti la regola secondo cui all'interno di un'Eclittica ci possono essere solo 3 carte identiche. Inoltre, ci sono anche strutture spazio-temporali nell'Eclittica. Nella fase celeste, si scopre una carta dall'Eclittica; non si prende in mano, ma evocata direttamente nel mondo (corpi celesti) o rimossa dal gioco direttamente (struttura Spazio-temporale). In ogni fase d'acquisizione del tuo turno si pesca una carta dal proprio Grimorio, a meno che un effetto (es. Mantra della Purezza) non indichi diversamente.",
    "pic": true,
    "token": "lmt3oLIhNXtR1MS21mKOwlU4Jl4qFjKNjeOOzKWLuQs=",
    "taken": true,
    "date": 0
},

{
    "card_id": 3,
    "title": "Giove",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->, Paga una salute: aggiungi un mana di qualsiasi colore alla tua scorta di mana.",
    "strength": "",
    "extra": "C'è sempre un prezzo da pagare per i doni degli dei.",
    "rule_title": "Mana",
    "rule": "I corpi celesti donano energia cosmica al mago: Mana. Ci sono mana incolore e mana con un certo colore. Gli Incanta sono disponibili in 5 colori: rosso, blu, verde, bianco e nero. La maggior parte degli incantesimi richiede una certa quantità di mana colorato e una certa quantità di mana indefinito, che può essere pagato con qualsiasi colore o mana incolore. Se una carta da gioco ti permette di aggiungere qualsiasi tipo di mana al tuo pool di mana, puoi scegliere quale colore (anche incolore) ha.",
    "pic": true,
    "token": "tBYkQYZatAneign9Yc0ajQ3gBTNEvnOHtlfzJVhQ03Y=",
    "taken": true,
    "date": 0
},

{
    "card_id": 4,
    "title": "Venere",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->: Aggiungi un mana incolore alla tua scorta di mana.",
    "strength": "",
    "extra": "C'è spazio ....",
    "rule_title": "Fase Celeste",
    "rule": "I corpi celesti non sono incantesimi e sono collocati nel mondo direttamente (senza prenderli per mano) durante la fase celeste. Non si può rispondere alla disposizione dei corpi celesti. Durante la Fase Celeste, gli incantesimi non possono essere evocati e gli effetti non possono essere applicati.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 5,
    "title": "Marte",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->: Aggiungi un mana incolore alla tua scorta di mana.",
    "strength": "",
    "extra": "... ci siamo io e te,",
    "rule_title": "Indistruttibile",
    "rule": "Le carte da gioco indistruttibili non possono essere distrutte, non distrutte e non rimosse dal mondo. Tuttavia, è possibile sacrificare carte da gioco indistruttibili. Quando una carta da gioco indistruttibile viene sacrificata, viene rimossa dal mondo.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 6,
    "title": "Saturno",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->: Aggiungi un mana incolore alla tua scorta di mana.",
    "strength": "",
    "extra": "... e il tempo in un lampo.",
    "rule_title": "Mana Con Buona Ragione",
    "rule": "Un mago non può aggiungere mana alle sue scorte di mana senza una buona ragione. Se un mago ha generato mana con una buona ragione, ma non può usarlo, allora il suo avversario può usarlo (Restmana). Se l'avversario non può usarlo, scade. Se un mago ha generato accidentalmente mana senza avere una buona ragione, la generazione è semplicemente invertita come se non fosse mai successo. <br>Se necessario, fornire consigli per scoprire quali sono le buone ragioni.",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 7,
    "title": "Luna",
    "cost": "",
    "color": "sky",
    "type": "Corpo Celeste, Indistruttibile",
    "body": "->: Aggiungi un mana incolore alla tua scorta di mana.",
    "strength": "",
    "extra": "Dove c'è la luce, c'è il riflesso.",
    "rule_title": "Eclittica",
    "rule": "Nell'eclittica, dopo che i 7 corpi celesti (HK.) sono stati mischiati, 6 mappe spazio-temporali (RZG. ) secondo il seguente modello:<br>HK.<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.<br>HK.<br>RZG.<br>HK.<br>RZG.<br>RZG.<br>HK.<br>HK.<br>RZG.<br>HK>HK.",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 8,
    "title": "Struttura Spazio-temporale",
    "cost": "",
    "color": "sky",
    "type": "Esperienza Di Contesto",
    "body": "",
    "strength": "",
    "extra": "O tutti in una volta, o niente di niente.",
    "rule_title": "Bibliotecario",
    "rule": "Una libreria di Incantata consiste esattamente di 46 o 47 carte da gioco (incluso il Mantra della Purezza e del Destino). Ogni biblioteca deve contenere il mantra della purezza. Se si ignora l'ultima regola, è colpa tua!",
    "pic": true,
    "token": "i4Jp634MW+dwd4L\/tM9ATSIDl5ejRNdcdpcISGH\/dw8=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 9,
    "title": "Vastità",
    "cost": "",
    "color": "land",
    "type": "Paese, Moltitudine",
    "body": "_1_: Aggiungi un mana bianco alla tua scorta di mana.",
    "strength": "",
    "extra": "Il cammino",
    "rule_title": "Paesi",
    "rule": "I paesi non sono incantesimi. Sono semplicemente messi al mondo, ma solo nella fase principale. Tuttavia, è possibile reagire all'interpretazione di un paese, perché i paesi entrano nel mondo alla velocità di un incantesimo di materia. Nella fase principale, è possibile visualizzare tutti i paesi che si desidera.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 10,
    "title": "Legno",
    "cost": "",
    "color": "land",
    "type": "Paese, Moltitudine",
    "body": "_1_: Aggiungi un mana verde alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Paesi Standard",
    "rule": "Ci sono i seguenti paesi standard: ampio, foresta, montagna, oceano, singolarità. Tutti i paesi standard sono consentiti tutte le volte che lo si desidera per biblioteca. Tutti i paesi non standard (che non sono leggende) sono ammessi 3 volte per biblioteca.",
    "pic": true,
    "token": "eGa6OZnl4fKqlCLJW9LVoHu1rOJvjzwQW\/95\/SsYUc8=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 11,
    "title": "Montagna",
    "cost": "",
    "color": "land",
    "type": "Paese, Moltitudine",
    "body": "_1_: Aggiungi un mana rosso alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Manapech (opzionale)",
    "rule": "Se credi di essere svantaggiato per caso più spesso e\/o più di altri, puoi opzionalmente aggiungere la seguente regola (se tutti sono d'accordo): prima di iniziare, puoi prendere un paese standard dalla tua biblioteca e metterlo sopra la tua biblioteca. Poiché questa regola cambia l'equilibrio generale, un tale incontro non è più considerato un Incantata rigoroso e non è quindi consentito per i tornei.<br>Consiglio: se si vogliono evitare coincidenze, si dovrebbe provare Geistincantata o Geist-Materie-Incantata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 12,
    "title": "Oceano",
    "cost": "",
    "color": "land",
    "type": "Paese, Moltitudine",
    "body": "_1_: Aggiungi un mana blu alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Torneo Cantata",
    "rule": "Le carte consentite per l'utilizzo nella Cantata del Torneo possono essere determinate liberamente a seconda del torneo, ma le carte da gioco 1-91 (gioiello d'arco) devono sempre essere incluse.",
    "pic": true,
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 13,
    "title": "Singolarità",
    "cost": "",
    "color": "land",
    "type": "Paese, Moltitudine",
    "body": "_1_: Aggiungi un mana nero alla tua riserva di mana.",
    "strength": "",
    "extra": "La terra che nessuno ha mai visto, ma che forse è mai stata attraversata.",
    "rule_title": "Incantata Spirituale",
    "rule": "Geistincantata si gioca senza giocare a carte: Fai tutto quello che hai in testa. Ogni incantesimo è consentito una sola volta, per entrambi i maghi. Ogni mago disegna incantesimi di sua scelta dalla sua mente durante la fase del suo turno. Per esempio, se un mago chiama un Fulmine, l'altro mago non può più usare questo incantesimo in quell'incontro; se ha questo incantesimo sulla sua mano (immaginata), deve scambiarlo con uno che non è ancora stato convocato. I corpi celesti, le strutture spazio-temporali e le terre non sono inclusi in questa limitazione perché non sono incantesimi, ma sono soggetti alla regola del \"rapporto carte da gioco\".",
    "token": "ow+1I7eSt0PitnYCK5HRbW0P1dA2GFb56n6cqh3jVnM=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 14,
    "title": "Specchio Zaffiro",
    "cost": "0",
    "color": "blue",
    "type": "Manufatto, Mito, Sorte",
    "body": "Blue card.<br>->: Aggiungi un mana blu alla tua scorta di mana.<br>Sacrifice lo specchio zaffiro: Contatore un incantesimo spontaneo o interruzione che non costa 0.",
    "strength": "",
    "extra": "",
    "rule_title": "Carte Del Destino",
    "rule": "Ogni mago sceglie il suo destino e la corrispondente carta del destino (blu, rosso, verde, verde, nero, bianco) e la prende in mano dalla sua biblioteca. Si può scegliere solo una carta del destino. Se non si sceglie il destino, la prima carta del destino che si attinge dalla propria biblioteca determinerà il destino.",
    "token": "7jWe1qMPmw+fU8oB5Hl92yFalT\/BYtHjaDmsWGHERmg=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 15,
    "title": "Fuoco Opale",
    "cost": "0",
    "color": "red",
    "type": "Manufatto, Mito, Sorte",
    "body": "Carta da gioco rossa.<br>->: Aggiungi un mana rosso alla tua scorta di mana.<br>Sacrifice the Fire Opal: disegnare una carta da gioco.",
    "strength": "",
    "extra": "",
    "rule_title": "Destino",
    "rule": "Il colore del destino di un mago è determinato dal colore della prima carta del destino che il mago raccoglie. Ad esempio, quando un mago inizia il suo incontro con lo specchio di zaffiro in mano, il suo destino è blu. Se un mago inizia senza un destino, ma poi disegna un opale di fuoco, il suo destino è rosso.",
    "token": "RWoAGEvadLkgvdxmo+Tbg3ZEr6PzIbZsqmazBjsPouc=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 16,
    "title": "Risveglio",
    "cost": "0",
    "color": "green",
    "type": "Incantesimi Violenti, Mito, Sorte",
    "body": "Considerato un biglietto verde.<br> Prendi una foresta dalla tua biblioteca e mettila nel mondo. Disegnare una carta da gioco.",
    "strength": "",
    "extra": "",
    "rule_title": "Solo Un Destino",
    "rule": "Se un mago ha già scelto un destino e gli appare un'altra carta del destino, quella carta viene immediatamente rimossa dal mondo.",
    "token": "ZQU+cB\/IOVyNTVLy8vPEBy0mP4C6Ze\/Ppq\/Mng3UVic=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 17,
    "title": "Farfalla Pavone",
    "cost": "0",
    "color": "black",
    "type": "Incanto, Mito, Sorte",
    "body": "Black card.<br>_1_: Aggiungi un mana nero alla tua scorta di mana.<br>Sacrifice the Night Peacock Eye: Aggiungi 3 mana nero alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Magia Della Materia",
    "rule": "Ci sono i seguenti incantesimi di materia: incantesimi di creatura, incantesimi di incantesimo (anche incantesimi mirati), incantesimi di disincanto e incantesimi di artefatto. Tutti gli incantesimi di materia sono anche carte di soggiorno. Gli Incantesimi mirati sono chiamati a un obiettivo, ad esempio Incantesimo di creatura, Disincantesimo di artefatto, Incantesimo di creatura, Incantesimo di artefatto, Incantesimo di incantesimo, Incantesimo di mago, ecc.",
    "token": "eyLIO\/+BKRxOjV4hqBMPVxNzKzNMr7OF33vdzXEcd+E=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 18,
    "title": "Avatar D'oro",
    "cost": "0",
    "color": "white",
    "type": "Creatura, Mito, Sorte",
    "body": "Considerata una carta da gioco bianca.  _1_: Aggiungi un mana bianco alla tua fornitura di mana.<br>Sacrifice the Golden Avatar: Contatore di una magia che non costa 0.",
    "strength": "0\/1",
    "extra": "",
    "rule_title": "Tigre",
    "rule": "Se si può contrastare la prima tigre, si dovrebbe farlo, altrimenti molto probabilmente non si sarà più in grado di sconfiggere il suo avversario.",
    "pic": true,
    "token": "M6PFljgPS8Ovm93xbf1pMjqW7yXVS28tcCzebCEXN3I=",
    "minting_cost": "1.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 19,
    "title": "Tigre",
    "cost": "G",
    "color": "green",
    "type": "Creatura",
    "body": "",
    "strength": "2\/1",
    "extra": "Invincibile!",
    "rule_title": "Combattimento Fase I",
    "rule": "Puoi attaccare con le creature, ma solo nella fase di combattimento. Il mago può dichiarare una fase d'attacco nella sua fase principale. Potete rispondere alla dichiarazione della fase di attacco. Per impedire a una creatura di attaccare, si può ora spigolarla. Poi il mago chiama le sue creature d'attacco. Le creature attaccano sempre il mago nemico, non le creature direttamente. Il difensore chiama le sue creature bloccanti. Più di una creatura può bloccare un attaccante. Dopo aver nominato attaccanti e bloccanti, si possono evocare effetti rapidi (più veloci degli incantesimi violenti).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 20,
    "title": "Fuoco Elementare",
    "cost": "R",
    "color": "red",
    "type": "Creatura",
    "body": "Distruggere l'elemento fuoco: infliggere danni a un bersaglio.",
    "strength": "1\/1",
    "extra": "Una sola fiamma, ma la mia.",
    "rule_title": "Combattere La Fase II",
    "rule": "Prima della fine della fase di combattimento, tutti gli effetti rapidi sono gestiti. Se una creatura viene rimossa o orlata da un effetto rapido, essa continua a bloccarsi, ma non fa danni. Se una creatura attaccante viene rimossa, la creatura bloccante non può bloccare un'altra creatura. Il bordo di un attaccante non cambia più nulla. Allora i danni da combattimento saranno caricati: Tutti i bloccanti e gli attaccanti si infliggono reciprocamente danni di forza. Alla fine della Fase di Battaglia, tutte le creature che hanno una resistenza pari o inferiore a 0 vengono distrutte (messe negli Inferi, ma la resurrezione è ancora possibile).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 21,
    "title": "Pipistrello",
    "cost": "S",
    "color": "black",
    "type": "Creatura",
    "body": "Vola.",
    "strength": "1\/1",
    "extra": "Come un topo volante, ma piu' brutto.",
    "rule_title": "Bambù",
    "rule": "Quando le creature vengono convocate, soffrono di una frenesia evocativa. Questo significa che le creature che non erano nel mondo prima dell'inizio del tuo turno parziale non possono né attaccare né attivare effetti che hanno un vantaggio come parte del loro costo di attivazione. Tuttavia, gli effetti che non richiedono bordi sono immediatamente disponibili.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 22,
    "title": "Cucina Portoghese",
    "cost": "B",
    "color": "blue",
    "type": "Creatura",
    "body": "Sbloccabile.",
    "strength": "0\/1",
    "extra": "Che bestia.",
    "rule_title": "Spirito-Materia-Incantata",
    "rule": "Geist-Materie-Incantata è una variante di Geistincantata: Ognuno costruisce una biblioteca come al solito, ma può mettere una carta di sua scelta sopra ogni volta che disegna una carta.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 23,
    "title": "Cavallo Volante",
    "cost": "W",
    "color": "white",
    "type": "Creatura",
    "body": "Vola. Non posso attaccare.",
    "strength": "0\/3",
    "extra": "E' sempre un buon segno.",
    "rule_title": "Genuinità",
    "rule": "Dopo il primo incontro, qualsiasi mago può sacrificare il suo Mantra della Purezza nello Zero Round e chiamarlo mappa non standard. Tutti i maghi rimuoveranno dalla loro libreria tutte le carte da gioco dello stesso tipo. Il mago che ha dato il nome alla carta può allora pescare solo 3 carte nel suo turno successivo. (Cantata del torneo, opzionale per la modalità astrale e di potenza)",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 24,
    "title": "Riappacificazione",
    "cost": "W",
    "color": "white",
    "type": "Incantesimo Di Creatura",
    "body": "La creatura non può né attaccare né bloccare.",
    "strength": "",
    "extra": "Perché tutti questi problemi?",
    "rule_title": "Tempi Magri",
    "rule": "Una terra orlata non può trasformare un mana.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 25,
    "title": "Vigore",
    "cost": "G",
    "color": "green",
    "type": "Incantesimo Di Creatura",
    "body": "La creatura riceve +2\/+1 o +1\/+2; imposta quando viene convocata.",
    "strength": "",
    "extra": "",
    "rule_title": "Biblioteca Trionfale",
    "rule": "Una biblioteca si chiama biblioteca trionfale se ha un valore di 34:66 o superiore. (Cantata del torneo, modalità magica)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 26,
    "title": "Bestializzazione",
    "cost": "R",
    "color": "red",
    "type": "Incantesimo Di Creatura",
    "body": "La creatura riceve +3\/+3. Durante la tua fase di rifornimento, metti un -1\/-1 counter sulla creatura.",
    "strength": "",
    "extra": "Dopo tutto, sta morendo piu' in fretta ora.",
    "rule_title": "Signa",
    "rule": "Un counter (Mz. Signa) è un gettone che viene messo sulle carte. Il significato di un segno è determinato dall'incantesimo attraverso il quale è venuto nel mondo.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 27,
    "title": "Ammaliamento",
    "cost": "S",
    "color": "black",
    "type": "Incantesimo Di Creatura",
    "body": "Il controllore della creatura subisce danni durante la sua fase di rifornimento.",
    "strength": "",
    "extra": "",
    "rule_title": "Pesi Massimi",
    "rule": "I corpi celesti sono considerati come carte di soggiorno, ma non possono mai essere presi in mano.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 28,
    "title": "Scudo Astrale",
    "cost": "B",
    "color": "blue",
    "type": "Incantesimo Di Creatura",
    "body": "Distruggere lo scudo astrale: contatore di una magia che ha la creatura come bersaglio.",
    "strength": "",
    "extra": "",
    "rule_title": "Grande Mago",
    "rule": "Un grande mago del torneo è un mago che ha una biblioteca trionfale. Questo titolo viene assegnato solo in occasione di un torneo al vertice di Incantata. (Cantata del torneo, modalità magica)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 29,
    "title": "Potere Mentale",
    "cost": "R",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Tutti i maghi scartare tutte le loro carte a mano e disegnare come molti nuovi.",
    "strength": "",
    "extra": "",
    "rule_title": "Torneo Incantata Summit Tournament",
    "rule": "L'Incantata Summit Tournament può essere giocato solo una volta all'anno e il turno finale è giocato con 28 partecipanti al sistema svizzero (se non ci sono 28 partecipanti, il Summit Tournament non può avere luogo), in modo che ogni mago abbia almeno 21 partite (3 partite per coppia). Prima di ogni incontro, i partecipanti si offrono di scambiarsi in biblioteca (dopo aver incorporato le carte da gioco della cantina della biblioteca). Solo quello con il valore peggiore della biblioteca può rifiutare lo scambio. Dopo l'incontro, le biblioteche vengono scambiate di nuovo. (Torneo cantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 30,
    "title": "Debolezza Attacco",
    "cost": "S",
    "color": "black",
    "type": "Magia Spontanea",
    "body": "Creatura bersaglio che riceve temporaneamente -2\/-2.",
    "strength": "",
    "extra": "",
    "rule_title": "Mago Del Torneo",
    "rule": "Un Mago Torneo di 1°-14° livello è un mago che, con la sua libreria, raggiunge un valore di libreria pari o superiore a 49:51 a 35:65 in un torneo che segue le regole del Torneo Summit. Tutte le regole riguardanti la Biblioteca Trionfale \/ Grandi Maghi devono essere rispettate anche per il conseguimento di questi titoli. (Cantata del torneo, modalità magica)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 31,
    "title": "Sottofondo",
    "cost": "G",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Togliere un incanto dal mondo; non influisce sui destini.",
    "strength": "",
    "extra": "",
    "rule_title": "Selezione Della Mappa Del Torneo Al Vertice",
    "rule": "In un torneo al vertice sono ammesse tutte le carte da gioco pubblicate, ad eccezione di una che è determinata in un processo equo. (Torneo cantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 32,
    "title": "Astinenza",
    "cost": "B",
    "color": "blue",
    "type": "Incantesimi Violenti",
    "body": "Il proprietario di una carta di soggiorno la riprende in mano.",
    "strength": "",
    "extra": "",
    "rule_title": "Valore Della Biblioteca",
    "rule": "Il valore della biblioteca indica la percentuale di cui un mago con la sua (la stessa) biblioteca diventa martire - altri con quella biblioteca diventano martiri. Ad esempio 47:55 (quota martire del 47%: quota martire del 55%). Affinché un tale valore di biblioteca sia valido, prima di ogni incontro si deve chiedere se le biblioteche vengono scambiate, mentre solo il mago con il valore astrale inferiore della sua biblioteca può negarlo - dopo l'incontro le biblioteche vengono scambiate di nuovo.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 33,
    "title": "Forza Vitale",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Tutti i maghi guadagnano 4 Salute.",
    "strength": "",
    "extra": "Una scintilla che inizia.",
    "rule_title": "Mondo Delle Idee",
    "rule": "Il mondo delle idee c'è sempre stato. Tutti gli incantesimi che vengono evocati e, se necessario, copie di incantesimi appaiono nel mondo delle idee. Un mondo delle idee è un intero Incantatakaskade. Gli incantesimi conteggiati rimangono nel mondo delle idee, ma sono contrassegnati come contrastati. Una volta terminata la cascata di Incantataka, il mondo delle idee si rinnoverà, cioè si aprirà un nuovo mondo vuoto di sotto-idee. Tutti i precedenti mondi subidea rimangono di conseguenza. Il mondo delle idee esiste sempre.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 34,
    "title": "Aggressività",
    "cost": "G",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "La creatura bersaglio riceve temporaneamente +3\/+3.",
    "strength": "",
    "extra": "Chi ha iniziato?",
    "rule_title": "Cascate",
    "rule": "Se rispondi ad un incantesimo di una cascata (cascata radice), ma la risposta è più veloce dell'incantesimo di destinazione, viene creata una cascata di ramo. Quando tutti i maghi hanno finito di lanciare incantesimi e non viene lanciata nessuna ulteriore risposta, tutte le cascate di rami e la cascata del tronco formano una Incantatakaskade (breve cascata). Ora le cascate di ramo e la cascata del tronco (prima veloce, poi lenta) vengono srotolate (\"last in - first out\"). Un singolo incantesimo o effetto è anche una cascata, ma con una sola parte.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 35,
    "title": "Fulmine",
    "cost": "R",
    "color": "red",
    "type": "Magia Spontanea, Mito",
    "body": "Infliggere 3 danni a un bersaglio.",
    "strength": "",
    "extra": "Britzel!",
    "rule_title": "Deflagrazione",
    "rule": "Se il bersaglio di un incantesimo è scomparso, l'incantesimo diventerà pop; sarà semplicemente scartato.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 36,
    "title": "Lasciarsi Andare",
    "cost": "B",
    "color": "blue",
    "type": "Magia Spontanea",
    "body": "Una creatura bersaglio può volare temporaneamente. Disegnare una carta.",
    "strength": "",
    "extra": "Dimentica che c'e' la gravita'.",
    "rule_title": "Ricette",
    "rule": "Tutti gli incantesimi che non hanno il tipo leggenda, miracolo, molteplicità, unicità o unicità sono e agiscono come formule (lunga: formula magica). Le formule sono consentite 3 volte per biblioteca.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 37,
    "title": "Fascio Glitter",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea, Mito",
    "body": "Un Mago guadagna 6 Salute se ha 0 o meno Salute.",
    "strength": "",
    "extra": "Nell'ora più buia sarò lì per te.",
    "rule_title": "Fine Della Riunione",
    "rule": "Un incontro Incantata può finire in 2 modi: 1. Uno o entrambi i maghi non hanno salute alla fine di un giro parziale. 2. uno o entrambi i maghi non possono più estrarre carte dalla loro biblioteca se hanno bisogno di farlo. (Questo si riferisce solo ai maghi che erano lì fin dall'inizio.)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 38,
    "title": "Materia Personale",
    "cost": "S",
    "color": "black",
    "type": "Magia Spontanea",
    "body": "Rimuovere una creatura dal mondo; ottenere tanto danno quanto la creatura aveva forza.",
    "strength": "",
    "extra": "Il grande tutto non deve ancora essere distrutto, quindi inizia nel piccolo.",
    "rule_title": "Mana Barare",
    "rule": "Chiunque tradisca il mana giusto e venga catturato dovrebbe vergognarsi.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 39,
    "title": "Tulipano",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Prodigi",
    "body": "->, _1_, Sacrifice the Tulip: aggiungete un mana nero, rosso o blu alla vostra scorta di mana; disegnate un biglietto.",
    "strength": "",
    "extra": "E quando ho guardato su, ho visto milioni.....",
    "rule_title": "Universo",
    "rule": "L'universo degli Incantata consiste nella somma di tutti e 7 i mondi: Il mondo delle idee, il mondo della scrittura, il mondo dei pensieri, il mondo sotterraneo, il mondo, il mondo, il cosmo e l'ultraterreno. \"Il tuo mondo di parte\" è sinonimo di \"Il tuo mondo\", così come \"Il tuo mondo sotterraneo di parte\" è sinonimo di \"Il tuo mondo sotterraneo\". \"sotto il tuo controllo nel mondo\" è sinonimo di \"in parte del tuo mondo\", ecc. Dopo aver rimosso il Mantra della Purezza dal gioco, l'universo degli Incantata diventa l'universo. Questa trasformazione viene annullata dopo la fine dell'incontro.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 40,
    "title": "Assegno",
    "cost": "W",
    "color": "white",
    "type": "Incantesimo D'interruzione",
    "body": "Prendere il controllo di un incantesimo di interrupt.<br>_1_: Forget.",
    "strength": "",
    "extra": "Quanto ti senti libero allo stesso modo.",
    "rule_title": "Sussistenza",
    "rule": "Le regole degli Incantata che esistono si applicano anche se non sono visibili.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 41,
    "title": "Impurità",
    "cost": "S",
    "color": "black",
    "type": "Incantesimo D'interruzione",
    "body": "Un incantesimo o effetto che dà Salute o aumenta la Resistenza di una creatura causa danni o riduce invece la Resistenza della creatura.",
    "strength": "",
    "extra": "La tua avidità per la vita non è altro che dipendenza.",
    "rule_title": "Universo Incantata Crypto Universo",
    "rule": "L'Universo Incantata Crypto è strutturato proprio come l'Universo Incantata. Logicamente, l'Universo Incantata Crypto è nell'Universo Crypto e l'Universo Incantata è nella realtà. A seconda del tipo di universo Incantata Crypto, le carte da gioco che sono in realtà possono mancare. Oppure carte da gioco che non esistono in realtà possono essere presenti in un particolare universo di Incantata Crypto.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 42,
    "title": "Spirito Naturale",
    "cost": "4GGG",
    "color": "green",
    "type": "Creatura, Mito, Incarnazione",
    "body": "Quando lo Spirito della Natura diventa il bersaglio di una magia, ottiene +2\/+1 fino alla fine del turno parziale.",
    "strength": "7\/7",
    "extra": "Vedo che ti piacerebbe essere come me.",
    "rule_title": "Incarnazione",
    "rule": "Potete convocare un'incarnazione solo se avete scelto il destino appropriato. Non è decisivo che sia ancora nel mondo.",
    "pic": true,
    "token": "\/KdR\/HNwNWZnU5eDp02eVGfWUrz\/PaGcb\/UC3KCJ4Kw=",
    "taken": true,
    "date": 0
},

{
    "card_id": 43,
    "title": "Spirito Di Vita",
    "cost": "G",
    "color": "green",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di un incantesimo blu.<br>_2_: Dimenticato.",
    "strength": "",
    "extra": "Sei come lo spirito che capisci.",
    "rule_title": "Dimenticatoio",
    "rule": "Una carta con l'effetto \"Dimentica\" può essere scartata per il costo di attivazione per disegnare una nuova carta, ad esempio: 2: Dimentica -> paga 2 mana qualsiasi per scartare la carta; tira una nuova carta. Questo effetto viene richiamato alla velocità della mappa originale e può essere attivato solo nella fase corrispondente.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 44,
    "title": "Obiezione",
    "cost": "B",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di un incantesimo di interruzione.<br>_2_: Dimenticato.",
    "strength": "",
    "extra": "Una mente affilatissima fa la differenza.",
    "rule_title": "Perfetto",
    "rule": "Annunciare quale sarà l'incantesimo decisivo. Se questo incantesimo è quello decisivo alla fine, questo incontro è considerato perfetto.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 45,
    "title": "Manifestazione",
    "cost": "4WWW",
    "color": "white",
    "type": "Creatura, Mito, Incarnazione",
    "body": "Vola.<br>->, _R__R_: infliggere 2 danni al bersaglio.<br>_G_: Temporaneo +2\/+0",
    "strength": "0\/9",
    "extra": "Se non c'è altro modo.",
    "rule_title": "Pausa Magica",
    "rule": "Non puoi lanciare incantesimi o attivare effetti durante le fasi di Rinnovo, Treno e Cielo. Durante la fase di scarto non possono essere lanciati incantesimi.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 46,
    "title": "Lightbringer",
    "cost": "4SSS",
    "color": "black",
    "type": "Creatura, Mito, Incarnazione",
    "body": "Provoca danni da sfondamento.<br>->: rimuove una creatura bordata dal mondo.",
    "strength": "7\/7",
    "extra": "Sono sempre stato frainteso.",
    "rule_title": "Mondiale",
    "rule": "Ci sono carte da gioco nel mondo (carte convocate o posate), carte da gioco al di fuori del mondo (in mano, in biblioteca o nel mondo sotterraneo) e carte da gioco che vengono rimosse dal mondo.",
    "pic": true,
    "token": "tSmAl\/Wsus6jepcp3meh2ccd5lCYKfCNKOkBHPP4HiE=",
    "minting_cost": "1.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 47,
    "title": "Leviatano",
    "cost": "4BBB",
    "color": "blue",
    "type": "Creatura, Mito, Incarnazione",
    "body": "Distruggere il leviatano se non si controlla l'oceano. Provoca danni da sfondamento. _B_, distruggere un oceano: contatore di un incantesimo che ha il leviatano come bersaglio.",
    "strength": "7\/7",
    "extra": "Ha sempre la risposta giusta.",
    "rule_title": "Versione Ufficiale",
    "rule": "La versione ufficiale di Incantata è quella presente sul sito ufficiale Incantata 0Net. Se viene utilizzata una carta da gioco più vecchia, tecnicamente diversa dalla versione ufficiale, essa può essere utilizzata solo allo stesso modo della versione ufficiale.",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 48,
    "title": "Drago",
    "cost": "4RRR",
    "color": "red",
    "type": "Creatura, Mito, Incarnazione",
    "body": "Vola.<br>->, _R__R_: infligge 2 danni a un bersaglio.",
    "strength": "8\/8",
    "extra": "Contrariamente a quanto si dice, non ho un punto debole.",
    "rule_title": "Effetto Risposte",
    "rule": "Puoi rispondere agli effetti delle lead card. Una magia può essere usata per rispondere se la velocità è uguale o superiore alla velocità dell'effetto Stay Card.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 49,
    "title": "Principio Dell'amido",
    "cost": "R",
    "color": "red",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di un incantesimo blu.<br>_2_: Dimenticato.",
    "strength": "",
    "extra": "Alla fine, lo spirito sconfigge la spada? Non farmi ridere!",
    "rule_title": "Speriamo Che Sia Educato.",
    "rule": "Quando in un Incantatabgung un mago viene fermato per contrastare un incantesimo, è considerato particolarmente educato a farlo in modo educato. Per esempio: Maestà\/ Durchlaucht\/ Hochwohlgeboren! Contestare questo incantesimo!",
    "pic": true,
    "token": "ZRkBR6KLJLQF5CZsJGzcwmhPj2yHz5dT5N6eoYs0mvE=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 50,
    "title": "Martello Incandescente",
    "cost": "XRR",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Non può essere contrastato.<br>Danneggiamento di un bersaglio X.",
    "strength": "",
    "extra": "",
    "rule_title": "Fonti Di Energia",
    "rule": "Ci sono 9 fonti di energia che producono cose nell'universo degli Incantata: Energia della Terra (produce paesi - considerati incolori), Energia Cosmica (produce corpi celesti e RZG - considerati incolori), Blu, Verde, Bianco, Nero, Nero, Rosso, Nero Chiaro, Bianco Chiaro (di qualsiasi colore), Grigio Chiaro (di qualsiasi colore e incolore), e Bianco Ombra. La Terra e l'energia cosmica combinate producono artefatti incolori.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 51,
    "title": "Angelo Vendicatore",
    "cost": "3WW",
    "color": "white",
    "type": "Creatura",
    "body": "Conta anche come carta nera.<br>Vola.<br>Non canted per l'attacco.",
    "strength": "4\/4",
    "extra": "Ora tocca a te.",
    "rule_title": "Lettere A Sconosciuti",
    "rule": "Se siete scritti in lettere maiuscole, allora il mago è indirizzato al mago.",
    "pic": true,
    "token": "bTAz9qAtBQ9bmKE4NtnFjGMmqEgZdXELKk0Xvv0LQMg=",
    "taken": true,
    "zite": "172nCFMgaVNEoWZAiKwHu8G1LXqA3gxMag",
    "date": 0
},

{
    "card_id": 52,
    "title": "Carpa Dorata",
    "cost": "2G",
    "color": "green",
    "type": "Creatura, Mito",
    "body": "Ogni volta che la Carpa d'oro diventa il bersaglio di una magia, pesca una carta.",
    "strength": "1\/1",
    "extra": "L'amicizia è d'oro.",
    "rule_title": "Rapporti Di Mappa",
    "rule": "A differenza delle leggende, tutte le altre carte da gioco sono consentite 3 volte per biblioteca - anche i corpi celesti. I paesi standard sono ammessi tutte le volte che lo si desidera. Le strutture spazio-temporali sono consentite 6 volte. Incantatamaggi molto seri prendono solo una carta per incantesimo da carte che hanno un colore diverso dal loro destino nella libreria.",
    "token": "fl8nebcmamXbj08u7Q8j8PUP\/3bTcykR8jgR2\/2XG2s=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 53,
    "title": "Cavalli D'onda",
    "cost": "1B",
    "color": "blue",
    "type": "Magia Spontanea",
    "body": "Un oceano diventa una creatura 3\/3, ma rimane un oceano.",
    "strength": "",
    "extra": "Improvvisamente si sono alzati e cresciuti come potenti cavalli da guerra.",
    "rule_title": "Maestri Trascendentali",
    "rule": "Quando l'incontro finisce e il martire è determinato, si controlla se la prossima carta da gioco del martire avrebbe definitivamente fatto sì che l'incontro andasse nella direzione opposta (il round parziale è simulato fino alla sola fase di combattimento), allora il martire dell'incontro è trascendente ed entrambi i maghi possono registrare l'altro come martire per le statistiche della loro biblioteca. Questo è possibile solo se l'incontro è terminato alla fine del turno parziale del non martire.",
    "pic": true,
    "token": "QNT6q9xFGjaOn6r8iP4qKd7+nMBhs\/SZ8n\/p\/9RKs0g=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 54,
    "title": "Mela",
    "cost": "2G",
    "color": "green",
    "type": "Creatura",
    "body": "",
    "strength": "3\/4",
    "extra": "",
    "rule_title": "Mito",
    "rule": "Le carte da gioco del tipo \"Legenda\" sono ammesse solo una volta per biblioteca.",
    "pic": true,
    "token": "SLH0j+5HTXhcOWB24r7yWrGGhTPrpcFP5Zru0IqhqyE=",
    "taken": true,
    "date": 0
},

{
    "card_id": 55,
    "title": "Battipalo Tempesta",
    "cost": "5",
    "color": "artifact",
    "type": "Manufatto, Creatura",
    "body": "L'ariete deve attaccare.",
    "strength": "5\/4",
    "extra": "Un rimedio efficace.",
    "rule_title": "Magia Della Materia",
    "rule": "Quando un incantesimo di materia ha avuto successo (=realizzato), l'incantesimo si manifesta come una carta per rimanere nel mondo e diventa, come determina il tipo di carta, una creatura, un artefatto, un incantesimo o un disincanto.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 56,
    "title": "Discontinuità",
    "cost": "WW",
    "color": "white",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di un incantesimo.",
    "strength": "",
    "extra": "La saggezza suona come una follia nelle orecchie di uno sciocco.",
    "rule_title": "Repliche",
    "rule": "Ci sono 7 velocità di Incantata (lento-veloce):<br>- Incantata (Stay Cards)<br>- Incantata violenta<br>- Incantesimi spontanei<br>- Incantesimi di effetto<br>- Incantesimi di interruzione<br>- Incantesimi di energia<br>- Incantesimi di sogno<br>- Puoi rispondere a un incantesimo solo se la risposta è altrettanto veloce o più veloce. Tutti gli incantesimi chiamati in risposta e la prima forma una Incantatakaskade o una breve cascata. Le cascate vengono elaborate \"last in - first out\". Vedi anche: Cascate di Filiale",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 57,
    "title": "Richiamo dell'Oltretomba",
    "cost": "1S",
    "color": "black",
    "type": "Magia Spontanea",
    "body": "Distruggere una creatura non nera.",
    "strength": "",
    "extra": "Non preoccuparti, ti piacerà lì.",
    "rule_title": "Sterminio",
    "rule": "Quando una creatura viene distrutta, viene messa nel Mondo Sotterraneo e non può essere risuscitata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 58,
    "title": "Scintilla Mortale",
    "cost": "1RR",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Distruggere una creatura.",
    "strength": "",
    "extra": "A volte basta una sola scintilla.",
    "rule_title": "Distruggere",
    "rule": "Se una creatura viene distrutta, sarà messa nel Mondo Sotterraneo a meno che non sia resuscitata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 59,
    "title": "Complicazione",
    "cost": "1B",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di una magia se il suo controllore non paga _3_.",
    "strength": "",
    "extra": "Come farò - il mio pensiero sarà zoppo...",
    "rule_title": "Contrattacco",
    "rule": "Quando un incantesimo o un effetto viene contrastato, viene impedito di entrare nel mondo o di lavorare. Se era un incantesimo, la carta viene semplicemente scartata. Le spese già sostenute non saranno recuperate.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 60,
    "title": "Album Pane",
    "cost": "1G",
    "color": "green",
    "type": "Magia Spontanea, Mito",
    "body": "Scegli uno dei seguenti effetti * Guadagni 3 punti vita * Una creatura guadagna +2\/+1 temporaneamente * Tutte le tue creature guadagnano +0\/+1 temporaneamente * Pesca una carta.",
    "strength": "",
    "extra": "Ti sara' sempre utile.",
    "rule_title": "Illegale",
    "rule": "Non è possibile appropriarsi indebitamente delle carte Incantata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 61,
    "title": "Sciamano",
    "cost": "G",
    "color": "green",
    "type": "Creatura, Prodigi",
    "body": "->: Aggiungi un mana verde alla tua scorta di mana.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Effetti Delle Carte Piombo",
    "rule": "Gli effetti delle carte piombo sono attivati con effetti di velocità degli incantesimi, il che significa che puoi rispondere solo con incantesimi di velocità uguale o superiore, o effetti di velocità superiore.<br>Ma ci sono eccezioni:<br>- effetti di carte che producono o trasformano mana: Energy spell speed.<br>- Effetti di carte da gioco che possono contrastare effetti o incantesimi: Interrupt spell= speed.<br>- Effetti di carte da gioco che infliggono danni: Spontaneous spell speed.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 62,
    "title": "Genio In Bottiglia",
    "cost": "2B",
    "color": "blue",
    "type": "Creatura",
    "body": "Vola.<br>Il genio nella bottiglia ti danneggia durante la fase di fornitura.",
    "strength": "3\/4",
    "extra": "Ho detto: \"Ora dobbiamo morire entrambi!\". E lui disse: \"Cosa posso fare? E' la mia natura.\"",
    "rule_title": "Tappe",
    "rule": "In ogni turno parziale ci sono 7 fasi possibili: <br>- fase di rinnovamento<br>- fase di cielo<br>- fase di alimentazione<br>- fase di tiro<br>- fase di attacco (all'interno della fase principale)<br>- fase di scarto.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 63,
    "title": "Tamburi Da Guerra",
    "cost": "2R",
    "color": "red",
    "type": "Incanto",
    "body": "Tutte le tue creature attaccanti ricevono +1\/+0.",
    "strength": "",
    "extra": "Dong do do do do do do do do do do do do do do do do do do.....",
    "rule_title": "Temporaneo",
    "rule": "Un effetto temporaneo dura solo fino alla fine del turno parziale. Se in un set vengono attribuiti più effetti con un \"temporaneo\" precedente, tutti gli effetti sono temporanei.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 64,
    "title": "Alessia",
    "cost": "3SS",
    "color": "black",
    "type": "Creatura",
    "body": "Vola. Mettere un +1\/+1 counter su Alessia alla fine del turno parziale se ha inflitto danno ad una creatura.",
    "strength": "4\/4",
    "extra": "Ipocrisia nel sostenere che sarebbe meglio.",
    "rule_title": "Fine Del Turno Parziale",
    "rule": "La fase \"fine del turno parziale\" si apre con l'annuncio del mago che terminerà il suo turno parziale. In risposta, i maghi possono rispondere con incantesimi ed effetti che sono più veloci di un incantesimo violento. Di conseguenza, si può quindi rispondere nuovamente. Quando tutte le cascate di Incantata sono state completate, il turno parziale termina. Solo allora saranno regolati tutti gli effetti relativi alla fine del sottosuolo. Se un mago, che c'era fin dall'inizio, ha 0 o meno punti vita, l'incontro Incantata finisce.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 65,
    "title": "Baluardo",
    "cost": "1W",
    "color": "white",
    "type": "Incanto",
    "body": "Tutte le tue creature con potenza 0 ottengono +0\/+2.",
    "strength": "",
    "extra": "Come un muro vivente.",
    "rule_title": "I 7 Mondi",
    "rule": "Ci sono 7 mondi: 1. mondo di pensiero (somma di tutti i mondi di pensiero parziali = handcards di un mago) 2. idea mondo 3. mondo sotterraneo (somma di tutti i mondi parziali) 4. mondo (somma di tutti i mondi parziali) 5. mondo di scrittura (somma di tutte le biblioteche) 6. ambiente (= guscio) 7. cosmo (somma di tutte le eclittiche, corpi celesti nel mondo e tutte le strutture spazio-temporali)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 66,
    "title": "Giardino Curativo",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto",
    "body": "->, _2_: Aggiungi un punto vita a te stesso.",
    "strength": "",
    "extra": "Tutto in questo posto sta guarendo.",
    "rule_title": "Incontro",
    "rule": "Un gioco di Incantata si chiama \"Incontro\".",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 67,
    "title": "Delucidazione",
    "cost": "1W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Distruggi un artefatto o un incantesimo.",
    "strength": "",
    "extra": "Credimi, la tua immaturita' e' autoinflitta.",
    "rule_title": "Distruzione Del Destino",
    "rule": "Naturalmente potete distruggere i destini, ma vi ricadrà su di voi in modo fatale.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 68,
    "title": "Ruggine Della Peste",
    "cost": "1S",
    "color": "black",
    "type": "Incantesimi Violenti",
    "body": "Tutti i maghi e tutte le creature ricevono danni.",
    "strength": "",
    "extra": "E questo era solo un assaggio!",
    "rule_title": "Incantesimi Violenti",
    "rule": "Gli incantesimi violenti sono potenti incantesimi che un mago può evocare solo nella sua fase principale, al di fuori della fase di combattimento. Ricordate che gli incantesimi violenti in Incantata possono essere invocati anche come risposta.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 69,
    "title": "Plasma Shock",
    "cost": "XR",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Infliggere X danno ad un bersaglio, questo danno non può essere prevenuto o reindirizzato.",
    "strength": "",
    "extra": "Lo spirito è un fuoco la cui fiamma è il pensiero.",
    "rule_title": "Restrizione Di Fase",
    "rule": "Gli incantesimi violenti e gli incantesimi di materia (creature e incantesimi) possono essere evocati solo durante la fase principale, al di fuori della fase di combattimento. Anche la progettazione dei paesi è soggetta a questa limitazione di fase.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 70,
    "title": "Effetto Tunnel",
    "cost": "1B",
    "color": "blue",
    "type": "Magia Spontanea",
    "body": "Bordo di una carta di soggiorno o girare indietro; disegnare una carta.",
    "strength": "",
    "extra": "O anche: nessuno dei due!",
    "rule_title": "Titolo Del Torneo",
    "rule": "Diversi titoli possono essere assegnati in un torneo in modalità a vostra scelta. Per esempio, la modalità magica e la modalità astrale. Tuttavia, un titolo di Magic Fashion sarà assegnato in ogni caso durante un torneo di vertice. (Torneo cantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 71,
    "title": "Donazione Vivificante",
    "cost": "1G",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Costo addizionale di convocazione = Paga una salute.<br>Ricostruire una creatura; disegnare una carta.",
    "strength": "",
    "extra": "Non ti deluderò!",
    "rule_title": "Potenza&Titolo",
    "rule": "Se un torneo viene giocato in modalità Lore (determinazione della migliore libreria Lore), il giocatore con la migliore libreria Lore ottiene il titolo Lore Magician. (Cantata torneo, modalità Lore)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 72,
    "title": "Freccia Velenosa",
    "cost": "1G",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Una creatura bersaglio riceve danno; distruggi questa creatura se riceve di nuovo danno in questo turno parziale.",
    "strength": "",
    "extra": "Uno può forgiare una spada, un altro può usarla.",
    "rule_title": "Modo Di Potere",
    "rule": "Quando si gioca in modalità Power (vedi Modalità Magia), viene determinata la migliore libreria di potenza. Bilbliotheken non vengono mai scambiati prima dell'inizio del gioco. La migliore libreria di potenza è quella con il miglior valore di libreria (tasso di martirio più basso). (Cantata del torneo, modalità power mode)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 73,
    "title": "Saltimbancore",
    "cost": "3BB",
    "color": "blue",
    "type": "Creatura",
    "body": "Vola.<br>Bordo tutte le altre creature volanti quando lo Sky Striker viene al mondo.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Conseguenze",
    "rule": "Gli effetti sono una lista di affermazioni. Se queste affermazioni non contengono un soggetto o un oggetto, il mago aggiunge l'affermazione a una frase di pensiero. Come se volasse \"la tempesta\".",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 74,
    "title": "Combattimento Nano",
    "cost": "1R",
    "color": "red",
    "type": "Creatura",
    "body": "Primo colpo.",
    "strength": "2\/1",
    "extra": "Un duro bastardo.",
    "rule_title": "Modo Magico",
    "rule": "Quando si gioca in modalità magica, viene determinata la migliore libreria di magia. (Cantata del torneo, modalità magica)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 75,
    "title": "Corvo",
    "cost": "1S",
    "color": "black",
    "type": "Creatura",
    "body": "Vola.",
    "strength": "2\/1",
    "extra": "Krah!",
    "rule_title": "Volare",
    "rule": "Le creature volanti possono bloccare sia le creature volanti che quelle non volanti, mentre le creature non volanti non possono bloccare quelle volanti.",
    "pic": true,
    "token": "90gfg11JPJjQgv9t+G6v1+qMhC9DL7QRi9z6n5BXoU0=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 76,
    "title": "Perla Nera",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Esiguità",
    "body": "Costo di convocazione aggiuntivo= Doppio Cielo Potere.<br>->: Aggiungi un mana incolore alla tua scorta di Mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Esiguità",
    "rule": "Si può avere una rarità solo una volta sotto il tuo controllo nel mondo. Se la stessa rarità è già sotto il vostro controllo, non dovete evocare nuovamente quella rarità, né usare alcun incantesimo o effetto che possa portare quella rarità nel mondo. Se il tuo avversario usa un effetto o una magia che ti dà una Rarità che hai già sotto il tuo controllo, devi rimuovere tutte le Rarità di quel tipo tranne una.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 77,
    "title": "Dissipatore Di Energia",
    "cost": "5",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->: Il bordo di una carta di dimora.",
    "strength": "",
    "extra": "Hellapparillo - strano",
    "rule_title": "Durata",
    "rule": "Il costo di attivazione \/ costo di convocazione degli effetti \/ incantesimi sarà addebitato nel momento esatto in cui avviene l'effetto \/ incantesimo. Vedere realizzazione.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 78,
    "title": "Abolizione Dell'illusione Materiale",
    "cost": "3",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->, Sacrificio di un paese: disegnare una mappa.<br>->, _1_, Sacrificio della Materia Illusione Abolizione: Disegnare una mappa.",
    "strength": "",
    "extra": "Tutte queste cose sono forse tutte presuntuose.",
    "rule_title": "Cascate Con Effetto Lead Card",
    "rule": "Una cascata di Incantata può anche essere avviata da un effetto di una lead card (cascata di effetti).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 79,
    "title": "Incenso",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Impedisci un punto danno per tutte le creature che hanno Forza 0. Disegnare una carta da gioco.",
    "strength": "",
    "extra": "",
    "rule_title": "Spielkarten Ziehen",
    "rule": "Se ti viene chiesto di disegnare una carta da gioco, la estrai dalla tua libreria, se non diversamente specificato (es. eclittica).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 80,
    "title": "Helle Magie",
    "cost": "2WS",
    "color": "light_black",
    "type": "Incantesimo D'interruzione, Unicità",
    "body": "Viene considerata come una carta da gioco nera chiara. Rimuovi la richiesta di sacrificare qualcosa dal costo di attivazione di un effetto di un incantesimo di materia; quell'incantesimo di materia non deve essere il destino.",
    "strength": "",
    "extra": "",
    "rule_title": "ẞ",
    "rule": "Gli incantesimi di interruzione possono anche essere scritti.",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 81,
    "title": "Fulmine A Palla",
    "cost": "RR",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Infliggere 3 danni ad un bersaglio; il controllore di quel bersaglio infligge 2 danni ad un bersaglio di sua scelta; il controllore di quel bersaglio infligge danni ad un bersaglio di sua scelta.",
    "strength": "",
    "extra": "",
    "rule_title": "Autocontrollo",
    "rule": "Se un effetto o un incantesimo si riferisce al controller di un bersaglio, ricordati che ogni mago è sempre il controller di se stesso.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 82,
    "title": "Ritorno alla Creazione",
    "cost": "3BB",
    "color": "blue",
    "type": "Incantesimi Violenti",
    "body": "Tutte le creature sono riprese dai loro proprietari.",
    "strength": "",
    "extra": "",
    "rule_title": "Cosmos",
    "rule": "Il cosmo (mondo celeste) consiste di tutte le eclittiche e di tutti i corpi celesti del mondo e di tutte le strutture spazio-temporali. Il cosmo si dispiega in 13 giri (eoni) e quando si dispiega completamente, il cosmo è nel mondo e il mondo è nel cosmo. Il cosmo trascende perché ad esso appartengono anche strutture spazio-temporali lontane dal mondo.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 83,
    "title": "Legge Naturale",
    "cost": "GG",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Vernichte ein Artefakt. Kann nicht gekontert werden.",
    "strength": "",
    "extra": "",
    "rule_title": "Mondo dei Pensieri",
    "rule": "Il mondo del pensiero è la somma di tutti i mondi di pensiero parziale dei maghi (= carte a mano). Il mondo del pensiero è uno, ma non tutto è ovvio per i maghi. Molti pensieri (carte di mano) rimangono presi in prestito - in particolare i segreti che non devono essere rivelati sulla mano (e anche in biblioteca).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 84,
    "title": "Angelo Custode.",
    "cost": "3WW",
    "color": "white",
    "type": "Creatura, Mito",
    "body": "Vola.<br>Domande per il permesso di attaccare con l'Angelo Custode.<br>0, Sacrifice the Guardian Angel: Salva il tuo avversario.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Miracolo",
    "rule": "I miracoli sono consentiti 2 volte per biblioteca.",
    "token": "M+iL2dPNEcSwg1Xu9Q68GM6ZF8Fl9jkPOYgdECQHZXI=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 85,
    "title": "Ideenklau",
    "cost": "2BB",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Contatore di una magia;<br>_1_: Se quella magia è un artefatto o una magia creatura, mettila direttamente nel tuo mondo.",
    "strength": "",
    "extra": "Divertente, in realtà è stata anche una mia idea.",
    "rule_title": "Segni",
    "rule": "I costi di attivazione per gli effetti possono essere una lista di dichiarazioni separate da una virgola. Per chiarezza, ogni dichiarazione inizia con una lettera maiuscola. Se per una dichiarazione (separata da una virgola) è necessaria una clausola subordinata, essa inizia con una lettera minuscola. Gli effetti di una carta da gioco sono affermazioni che terminano con un punto. Se appare un punto e virgola, inizia una dichiarazione (che inizia con una lettera maiuscola), che si riferisce alla dichiarazione precedente. La dichiarazione dietro il punto e virgola può avvenire solo se si è verificato l'effetto precedente. Se un punto e virgola è scritto in minuscolo, è solo una clausola subordinata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 86,
    "title": "Scintille di Tuono",
    "cost": "4R",
    "color": "red",
    "type": "Incantesimi Violenti, Mito",
    "body": "Distribuire 5 danni su un qualsiasi numero di bersagli.",
    "strength": "",
    "extra": "Le stelle? Certo - ma guardate questo spettacolo!",
    "rule_title": "Gebrochene Zahlen",
    "rule": "Se compaiono numeri interrotti, questi sono sempre arrotondati per eccesso.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 87,
    "title": "Ritorno",
    "cost": "2SS",
    "color": "black",
    "type": "Incantesimi Violenti",
    "body": "Prendi una creatura dalla tua malavita e mettila direttamente nel mondo.",
    "strength": "",
    "extra": "Ovviamente, dopo tutto, non gli è piaciuto.",
    "rule_title": "Incapacità di Blocco",
    "rule": "Se una creatura che è già stata dichiarata bloccante è resa ineleggibile da un effetto rapido (ad esempio, bordata, perde l'abilità di volo), agisce ancora come bloccante, ma non infligge più danni da combattimento.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 88,
    "title": "Guaritore Dell'anima.",
    "cost": "W",
    "color": "white",
    "type": "Creatura",
    "body": "->: Impedire fino a 2 punti danno da una creatura.",
    "strength": "0\/1",
    "extra": "Corpo e anima guariscono in armonia attraverso e l'uno dall'altro.",
    "rule_title": "Costruzione di Carte da Gioco",
    "rule": "In alto a sinistra della carta da gioco c'è il nome dell'incantesimo (nome breve), in alto a destra ci sono i costi di convocazione, sotto nella metà superiore c'è l'immagine, sotto nei tipi di carte da gioco, sotto il testo dell'effetto e in \"....\" sotto c'è il testo della saggezza, che non ha effetto sui mondi Incantata. Le creature hanno ancora Forza\/Resistenze in basso a destra.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 89,
    "title": "Ritirata",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "Ottenere una salute se hai almeno 4 carte da gioco in mano durante la fase di approvvigionamento.",
    "strength": "",
    "extra": "",
    "rule_title": "Offerta E Scambio.",
    "rule": "Dare via e scambiare carte Incantata dà ai maghi coinvolti il più alto potere magico. Anche la vendita è consentita, ma è preferibile fare un regalo. Il mantra della purezza non dovrebbe essere venduto.",
    "pic": true,
    "token": "7BceyCx7AXXwArJwyQMVBigggxhm4dSnP1H65hALdzk=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 90,
    "title": "Corona Di Spine.",
    "cost": "2W",
    "color": "white",
    "type": "Incantesimo Di Creatura, Mito",
    "body": "Costi di convocazione aggiuntivi= Paga 2 punti vita. La creatura ottiene +4\/+4.",
    "strength": "",
    "extra": "",
    "rule_title": "Incoronazione",
    "rule": "Carta da gioco 766 vedi anche regola 90",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 91,
    "title": "Roses",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Prodigi",
    "body": "->, _1_, Aggiungi un mana bianco, verde o blu alla tua scorta di mana; disegnare una carta.",
    "strength": "",
    "extra": "",
    "rule_title": "Simmetria Pausa",
    "rule": "La rottura di simmetria dell'Incanta è superiore a 10E504 (per confronto: l'asimmetria barionica della fisica dello stagno è di circa 6.14E10).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 92,
    "title": "Battaglia Decisiva",
    "cost": "2SW",
    "color": "dark_white",
    "type": "Incantesimi Violenti",
    "body": "Considerata una carta da gioco bianco ombra.<br>Distruggi tutti i paesi.",
    "strength": "",
    "extra": "Sapevi che alla fine sarebbe successo.",
    "rule_title": "Auto-risposta",
    "rule": "Puoi rispondere a un incantesimo che ti sei evocato.",
    "pic": true,
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 93,
    "title": "Doppio Flash",
    "cost": "1R",
    "color": "red",
    "type": "Magia Spontanea, Mito",
    "body": "Infliggere due danni ad un bersaglio e uno ad un altro bersaglio.",
    "strength": "",
    "extra": "Britzel - Bitzel",
    "rule_title": "Convocazione",
    "rule": "Quando un mago lancia un incantesimo, si chiama convocazione. I costi di convocazione devono essere spesi così come devono essere rispettate tutte le regole di fase e di velocità. Se è così, l'incantesimo apparirà nel mondo delle idee. Se l'Incantatakaskade è completata, il completamento inizia (vedi realizzazione). Si applica quanto segue: \"evocato con successo\" è sinonimo di \"realizzato\".",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 94,
    "title": "In Torsione.",
    "cost": "B",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Crea 2 copie di un incantesimo Spontaneo o Interruzione che non controlli tu; il tuo avversario ottiene il controllo di una di queste copie.",
    "strength": "",
    "extra": "Sto solo aspettando l'occasione giusta.",
    "rule_title": "Copie Di Incantesimi",
    "rule": "Una copia di un incantesimo viene trattata come se quell'incantesimo fosse stato richiamato; come se fosse sulla tua mano senza incorrere nel costo di reimpianto. La velocità dell'incantesimo copiato non cambia e viene aggiunto alla cascata corrispondente.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 95,
    "title": "Mela",
    "cost": "4GG",
    "color": "green",
    "type": "Incantesimi Violenti, Mito",
    "body": "Votate con il vostro avversario su quanti punti vita saranno messi sulle vostre due anime; se non siete d'accordo, metteteli su 19.",
    "strength": "",
    "extra": "Prendi un morso di questa mela.",
    "rule_title": "Punti Vita",
    "rule": "Ogni mago inizia l'incontro Incanata con 21 punti vita. Questo vale per un torneo di vertice. Se non si desidera iniziare con 21 punti vita, è possibile richiamare una mela prima di iniziare.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 96,
    "title": "Ratto",
    "cost": "S",
    "color": "black",
    "type": "Creatura",
    "body": "Costo aggiuntivo di convocazione = Paga una salute.<br>Non soffrire per la frenesia di convocazione.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Volontà Del Mago",
    "rule": "Se il costo di attivazione di un effetto è pari a 0 l'attivazione dell'effetto dipende interamente dalla volontà del mago di controllo",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 97,
    "title": "Riflessione Della Materia",
    "cost": "3B",
    "color": "blue",
    "type": "Creatura",
    "body": "Kopiere eine Kreatur.",
    "strength": "*\/*",
    "extra": "Certo, una conseguenza della mia invidia.",
    "rule_title": "Occultamento",
    "rule": "Se un effetto ti chiede di mostrare carte da gioco nel tuo grimorio o nella tua mano puoi se si tratta di un segreto rifiutare di eseguire l'effetto",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 98,
    "title": "Orda di Vichinghi",
    "cost": "3RR",
    "color": "red",
    "type": "Creatura",
    "body": "Provoca danni da sfondamento.",
    "strength": "5\/4",
    "extra": "Erano come se fossero fuori di loro sensi, con assi oscillanti e urla; non potevamo fermarli.",
    "rule_title": "Danni di Rottura",
    "rule": "Quando una creatura con danno da breakthrough viene bloccata l'attaccante decide quali creature bloccanti riceveranno il danno da combattimento La differenza tra il danno inflitto la creatura attaccante e la resistenza dei bloccanti viene inflitta come danno di breakthrough al mago in difesa",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 99,
    "title": "Canapa.",
    "cost": "G",
    "color": "green",
    "type": "Creatura, Prodigi",
    "body": "->: Aggiungi un mana nero, rosso, blu o bianco alla tua scorta di mana.",
    "strength": "0\/1",
    "extra": "",
    "rule_title": "Fissazione Nel Mondo Delle Idee",
    "rule": "Se un incantesimo viene fissato con successo nel mondo delle idee non può essere revocato",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 100,
    "title": "Rullo Di Fuoco",
    "cost": "4R",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Painted in Kreaturen.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 101,
    "title": "Pulizia",
    "cost": "2W",
    "color": "white",
    "type": "Incantesimi Violenti",
    "body": "Distruggere tutti gli artefatti. <br>_1_: distruggere tutti gli artefatti invece di distruggerli.",
    "strength": "",
    "extra": "",
    "rule_title": "Esaurimento",
    "rule": "Una creatura resuscitata non lascia il mondo ma è orlata",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 102,
    "title": "Alba",
    "cost": "2G",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Distruggi tutti gli incantesimi.",
    "strength": "",
    "extra": "Posso solo indovinare, ma è una striscia all'orizzonte.",
    "rule_title": "Preselezione",
    "rule": "Non è consentito pre-ordinare la biblioteca prima (e dopo) l'incontro",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 103,
    "title": "Oscurita'.",
    "cost": "SSSSSS",
    "color": "black",
    "type": "Incantesimi Violenti",
    "body": "Dovete sacrificare tutti i corpi celesti. Un mago di vostra scelta scarta tutte le carte a mano.",
    "strength": "",
    "extra": "Non c'è più niente alla fine.",
    "rule_title": "Creature Toccanti",
    "rule": "Due creature entrano in contatto in combattimento (uno attacca l'altro blocca)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 104,
    "title": "Flusso Di Pensieri.",
    "cost": "2B",
    "color": "blue",
    "type": "Incantesimi Violenti",
    "body": "Tutti i maghi scartano tutte le carte che vogliono e ne disegnano quante nuove.",
    "strength": "",
    "extra": "",
    "rule_title": "Kopien - Ideenwelt",
    "rule": "Se un incantesimo o effetto ti permette di fare copie di incantesimi questo è possibile anche per gli incantesimi che sono stati neutralizzati poiché ogni incantesimo che evocate apparirà nel Mondo delle Idee",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 105,
    "title": "Göttlicher Segen",
    "cost": "3WW",
    "color": "white",
    "type": "Incantesimi Violenti",
    "body": "Tutti i maghi guadagnano 7 punti vita e possono pescare 3 carte da gioco.",
    "strength": "",
    "extra": "",
    "rule_title": "Mutaforma",
    "rule": "Shapeshifters può essere trasformato in qualsiasi creatura del mondo dal mago dominante prima dell'inizio del suo turno parziale (fase intermedia) o nella sua forma primordiale Il mutaforma mantiene sempre la capacità di cambiare forma",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 106,
    "title": "Maledizione",
    "cost": "SS",
    "color": "black",
    "type": "Mago Incanto",
    "body": "Ogni volta che il mago evoca un incantesimo, entrambi dovete pagare una vita.",
    "strength": "",
    "extra": "",
    "rule_title": "Felicità",
    "rule": "Jede Incantatakarte is in Glückbringer",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 107,
    "title": "Rinfresco",
    "cost": "W",
    "color": "white",
    "type": "Incantesimi Violenti",
    "body": "Aggiungere 2 punti vita. Disegnare una carta da gioco.",
    "strength": "",
    "extra": "",
    "rule_title": "Gute Gründe",
    "rule": "Tra le buone ragioni per creare mana oltre a spendere soldi per evocare e attivare incantesimi ed effetti ci sono le seguenti<br>- Usare l'effetto Tulip\/Rose\/Narciso per disegnare una carta se si rischia di diventare un martire<br>- Usare l'effetto Magnolia Blossom per salvare un avatar d'oro",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 108,
    "title": "Guardia",
    "cost": "1W",
    "color": "white",
    "type": "Creatura",
    "body": "->: Infliggere danno a una creatura attaccante.",
    "strength": "0\/2",
    "extra": "",
    "rule_title": "Erste Runde",
    "rule": "Gli incantesimi veloci non possono essere evocati al primo turno",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 109,
    "title": "Fretta",
    "cost": "1GG",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Tutte le tue creature ricevono temporaneamente +1\/+0 e causano danni da sfondamento.",
    "strength": "",
    "extra": "",
    "rule_title": "Nullte Runde",
    "rule": "Nel turno zero puoi evocare il destino che hai in mano Inoltre è possibile rimuovere il Mantra della Purezza di fronte a voi dal gioco per attivare il suo effetto Altrimenti non puoi usare altri incantesimi o effetti",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 110,
    "title": "Giustizia",
    "cost": "2WW",
    "color": "white",
    "type": "Incantesimi Violenti",
    "body": "Tutti i maghi distruggono così tante delle loro creature che tutti hanno un numero pari a quello di chi ha meno; tuttavia, l'ultima creatura non deve essere distrutta.",
    "strength": "",
    "extra": "",
    "rule_title": "Applicare",
    "rule": "Quando si lancia un incantesimo lo si evoca Quando si applica un effetto lo si attiva",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 111,
    "title": "Astralvampirismus",
    "cost": "1S",
    "color": "black",
    "type": "Incantesimi Violenti",
    "body": "Costo d'Evocazione Aggiuntivo = X Black Mana.<br>Danneggi un bersaglio X; guadagni tante Salute quante sono i danni inflitti con successo al bersaglio.",
    "strength": "",
    "extra": "",
    "rule_title": "Anima",
    "rule": "La memoria del punto vita di un mago si chiama anche anima",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 112,
    "title": "Correzione.",
    "cost": "1BB",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Alternative Summoning Cost= Restituisci una delle tue creature alla tua mano e paga due punti vita. Un mago di tua scelta annulla un incantesimo.",
    "strength": "",
    "extra": "Lo terrò per dopo.",
    "rule_title": "Distribuzione Di Copie",
    "rule": "Quando un incantesimo viene copiato da un incantesimo e distribuito a maghi diversi questi incantesimi vengono evocati in ordine di turno a partire dall'incantesimo originale Se più di una copia è stata distribuita a uno o più maghi sarà convocata una sola copia di incantesimo per turno",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 113,
    "title": "Mantide Religiosa.",
    "cost": "1GGG",
    "color": "green",
    "type": "Creatura",
    "body": "Kann fliegende Kreaturen blocken.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Proprietà",
    "rule": "Le proprietà sono effetti permanenti che non sono né condizionali né attivabili",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 114,
    "title": "Abnormal Konstellation",
    "cost": "1",
    "color": "artifact",
    "type": "Manufatto",
    "body": "Tutti i maghi possono resettare al massimo un corpo celeste durante la fase di rinnovamento, o pagare un punto vita per ogni corpo celeste aggiuntivo.",
    "strength": "",
    "extra": "",
    "rule_title": "Calcolo Del Tempo",
    "rule": "Scriviamo l'anno 27790 dell'uomo e l'anno 332790 del cosmo",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 115,
    "title": "Non Morti.",
    "cost": "1S",
    "color": "black",
    "type": "Creatura",
    "body": "_S_: Rianimazione",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Rianimazione",
    "rule": "Una creatura che ha subito danni mortali o è stata distrutta può essere risuscitata cioè la creatura riacquista la sua piena resistenza Se è stata rianimata con successo non ha mai lasciato il mondo",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 116,
    "title": "Aurora Boreale",
    "cost": "W",
    "color": "white",
    "type": "Incantesimo Di Energia, Mito",
    "body": "Aggiungi tre mana bianco alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Restmana",
    "rule": "Mana che un mago ha creato accidentalmente e che non può usare si chiama Restmana",
    "pic": true,
    "token": "UoSWAdfutSR8\/2SxETN5rzHjJycAjmgJXlRRRTye9ms=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 117,
    "title": "Fusione Del Cervello",
    "cost": "2B",
    "color": "blue",
    "type": "Magia Spontanea, Mito",
    "body": "Infliggi 4 danni a un bersaglio; ne ottieni 2 danni.",
    "strength": "",
    "extra": "",
    "rule_title": "Alle Sind Zufrieden",
    "rule": "Prima dell'incontro tutti decidono come vogliono essere indirizzati e lo annunciano Nell'universo degli Incantata tutti i maghi possono usare questa scelta quando si parla di maghi immagini avversari ecc Esempio invece di mago\/avversario dire\/pensiero strega\/mago\/mago\/avversario Trasferire questa regola se lo si desidera anche a tutte le carte da gioco (es lightbringer -> lightbringer)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 118,
    "title": "Narciso.",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->, _1_, Distruggi la giunchiglia: Aggiungete un mana bianco, verde, rosso o nero alla vostra piscina di mana; disegnate un biglietto.",
    "strength": "",
    "extra": "",
    "rule_title": "Proprietà Del Colore",
    "rule": "Il colore è una proprietà di una carta da gioco",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 119,
    "title": "Scoppiare Aperto.",
    "cost": "2G",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Una creatura si apre creando X 1\/1 ragni, dove X era il costo dell'evocazione della creatura.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 120,
    "title": "Karstification",
    "cost": "1RR",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Zerstöre ein Land.",
    "strength": "",
    "extra": "",
    "rule_title": "Punti Astrali",
    "rule": "I punti Astral points (AP) sono assegnati come segue Il difensore (vedi regola 659) annulla i turni fino a quando l'attaccante diventa un martire (R) In questo caso il difensore riceve R AP Se il numero di turni non è previsto correttamente ma il difensore vince il difensore riceve -1 AP Se il difensore perde ottiene -2R AP L'attaccante dell'incontro riceve -2 AP se diventa Martire e +-0 AP se non lo fa L'aggressore può rispondere all'annuncio (temporalmente-spiritualmente pre-programmato) Sono invincibile In questo caso tutti gli AP assegnati saranno raddoppiati (Cantata del torneo modalità Astrale)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 121,
    "title": "Pesce Palla",
    "cost": "B",
    "color": "blue",
    "type": "Creatura",
    "body": "_B__B_: -0\/+3",
    "strength": "1\/1",
    "extra": "... FUMP ...",
    "rule_title": "And The Risk Of Injury",
    "rule": "Gli eoni hanno come simboli i seguenti animali e piante 2.Tiger 3.Tiger 3.Hemp 4.Mantis 5.Mantis 5.Swan 6.Medusa 7.Swusa 8.Oak 9.Dolphin 10.Owl 11.Elephant 12.Bear 13.Horse 1. Fish",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 122,
    "title": "Demone.",
    "cost": "2SS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Protezione da White.<br>Il Demone ti infligge danni durante la tua fase di approvvigionamento.",
    "strength": "5\/5",
    "extra": "Sconfiggerò il mio demone interiore solo siccome te lo infliggo addosso!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 123,
    "title": "Manovre Di Deviazione",
    "cost": "2R",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Per ogni creatura bloccante, devi riassegnare chi bloccare.",
    "strength": "",
    "extra": "1... 2... 3... Du bist frei!",
    "rule_title": "Valore Astrale",
    "rule": "Il valore astrale consiste nella somma dei punti astrali che il mago ha raggiunto con la sua biblioteca (Torneo cantata modalità astrale)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 124,
    "title": "Riccio.",
    "cost": "G",
    "color": "green",
    "type": "Creatura",
    "body": "Può bloccare solo se nessuna delle tue creature blocca la stessa creatura.",
    "strength": "1\/3",
    "extra": "",
    "rule_title": "Round",
    "rule": "Un round a Incantata è la sequenza dei round parziali di tutti i maghi coinvolti ed è chiamato anche Aeon (World Age)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 125,
    "title": "Confusione",
    "cost": "R",
    "color": "red",
    "type": "Incantesimo D'interruzione",
    "body": "Sostituire una magia veloce con una magia veloce dalla tua mano; il bersaglio non può essere riselezionato.<br>_2_: Dimenticato.",
    "strength": "",
    "extra": "",
    "rule_title": "Incantesimo Rapido",
    "rule": "Gli incantesimi veloci sono tutti incantesimi più veloci di quelli violenti",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 126,
    "title": "Mentaler Sieg",
    "cost": "XB",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Neutralizzare un incantesimo con il costo di convocazione di X.",
    "strength": "",
    "extra": "Sono gia' un passo avanti.",
    "rule_title": "Quota Martire",
    "rule": "La quota di martire è la percentuale con cui un'unità mago\/libreria finisce gli incontri",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 127,
    "title": "Schwarze Witwe",
    "cost": "2S",
    "color": "black",
    "type": "Creatura",
    "body": "Dopo la fase di combattimento, decidi quali creature che sono venute a contatto con la vedova nera saranno distrutte.",
    "strength": "1\/3",
    "extra": "Salon-issue-lesson-lesson-real-eal-eal-epply-supply-until-struggle-fresh-polvere-nuova-opzione ... vielleicht beim beim nächsten mal....",
    "rule_title": "Adulto",
    "rule": "Incantata è principalmente per i sorrisi ma può anche essere inquietante Ecco perché Incantata è adatto solo per adulti (dai 18 anni in su) sia nel mondo della crittografia che nella realtà",
    "pic": true,
    "token": "k6e\/t\/u2uhRv4Wau+OxYnarrLV60cQvESBt4aaDHA64=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 128,
    "title": "Streghe",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "Moon Power, _1_: Aggiungi un mana nero alla tua scorta di mana. <br>Venus Power, _1_: Aggiungi un mana verde alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Vocazione Da Mago",
    "rule": "Incantatazauberei è considerato un lavoro onesto e riconosciuto",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 129,
    "title": "Rivolte",
    "cost": "2G",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Alle Deine Kreaturen erhalten temporär +2\/+0.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 130,
    "title": "Incantesimo di Protezione",
    "cost": "3W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Tutte le tue carte da gioco rimanenti sono temporaneamente intoccabili e indistruttibili.",
    "strength": "",
    "extra": "Niente di male entra in questo cerchio.",
    "rule_title": "Bleibende Spielkarten",
    "rule": "Le carte da gioco rimanenti (non le carte rimanenti) sono tutte carte da gioco che hai",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 131,
    "title": "Dunkle Magic",
    "cost": "2SS",
    "color": "light_white",
    "type": "Incantesimo D'interruzione, Mito",
    "body": "E' considerata una carta da gioco bianca e leggera neutralizza di un incantesimo Disegnare una carta da gioco",
    "strength": "",
    "extra": "Se vuoi il male, lo fai bene.",
    "rule_title": "Leggendario",
    "rule": "Una creatura\/spontaneo incantesimo\/ecc con tipo Leggenda viene anche chiamato Leggendario Creatura\/leggendario Spell\/Spontaneo\/ecc",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 132,
    "title": "Uomo Di Metallo.",
    "cost": "1",
    "color": "artifact",
    "type": "Manufatto, Creatura",
    "body": "Il tuo avversario può guardare le tue carte da gioco una volta per round parziale.",
    "strength": "1\/3",
    "extra": "Ben inteso, a volte non e' abbastanza buono.",
    "rule_title": "Regole",
    "rule": "Tutte le regole sono concepite solo per i duelli (incontri tra due maghi) Se avete un incontro con più di 2 maghi le regole saranno interpretate di conseguenza",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 133,
    "title": "Cherub",
    "cost": "WWWWW",
    "color": "white",
    "type": "Creatura, Mito",
    "body": "Vola. Non può attaccare. Non può contatore",
    "strength": "5\/6",
    "extra": "E il cherubino sta davanti a Dio.",
    "rule_title": "Vendi",
    "rule": "È consentita la vendita di carte Incantata Supponiamo che Bitcoin (21 Mio Cap) sia una memoria sicura e di valore ragionevole Il prezzo di una formula non deve essere inferiore a X BTC X è un numero maggiore di 1 Per carte da gioco con diverse quantità di goffratura i prezzi verranno adeguati di conseguenza Quindi ad esempio per una leggenda non dovrebbe essere pagato meno di 3X BTC",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 134,
    "title": "Changelog",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto",
    "body": "",
    "strength": "",
    "extra": "Se cambi una cosa, cambia tutto.",
    "rule_title": "Forgiato Da Me",
    "rule": "Se un mago inizia con il destino in prima persona può usare un destino fatto in casa che naturalmente deve assomigliare alla versione ufficiale sia in termini di contenuto che di dimensioni",
    "minting_cost": "5.1",
    "zite": "13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz\/134.html",
    "date": 0
},

{
    "card_id": 135,
    "title": "Passera di mare",
    "cost": "BB",
    "color": "blue",
    "type": "Creatura, Prodigi",
    "body": "->, _2_, Per fortuna, disegnare o scartare una carta non blu.",
    "strength": "1\/1",
    "extra": "Wünsch Dir was!",
    "rule_title": "Offene Spielkarten",
    "rule": "In un duello ogni mago può sempre mostrare le sue carte di mano",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 136,
    "title": "Formazione Delle Rocce",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "Mars Power, _1_: aggiungete un mana rosso alla vostra scorta di mana. <br>Sun Power, _1_: aggiungete un mana bianco alla vostra scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Fine dell'Incontro",
    "rule": "Il mago che non ha più Salute e\/o non può più estrarre una tessera dalla sua biblioteca ma se necessario è il martire dell'incontro",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 137,
    "title": "Barca A Vela",
    "cost": "W",
    "color": "white",
    "type": "Creatura, Mito, Indistruttibile",
    "body": "Non può essere bersaglio di incantesimi.<br>Salta tua fase di attacco.<br>Dichiarare una fase di attacco: Sacrificare la barca a vela.",
    "strength": "0\/1",
    "extra": "Adatto alla navigazione d'alto mare;",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 138,
    "title": "Spiaggia",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "Sun Power, _1_: Aggiungi un mana bianco alla tua fornitura di mana. <br>Moon Power, _1_: Aggiungi un mana nero alla tua fornitura di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Coincidenza",
    "rule": "Non è consentita la preordinazione della biblioteca prima e dopo l'incontro",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 139,
    "title": "Sjávareldfjall",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "Saturn Power, _1_: Aggiungi un mana blu alla tua scorta di mana. <br>Mars Power, _1_: Aggiungi un mana rosso alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Intoccabile",
    "rule": "E' inviolabile chi non può essere controllato senza il consenso del mago dominante",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 140,
    "title": "Mangrovie",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "Venus Power, _1_: Aggiungi un mana verde alla tua scorta di mana. <br>Saturn Power, _1_: Aggiungi un mana blu alla tua scorta di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Regola",
    "rule": "Se non sono ammessi effetti o incantesimi nessun mago può mischiare o guardare nel suo grimorio Se un effetto permette ad un mago di guardare nella sua biblioteca deve mescolare in seguito",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 141,
    "title": "Collasso",
    "cost": "3R",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Distruggere un artefatto; il controllore di quell'artefatto riceverà un danno pari al costo dell'evocazione dell'artefatto.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 142,
    "title": "Onda D'urto",
    "cost": "R",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Tutte le creature non volanti ricevono danni.",
    "strength": "",
    "extra": "",
    "rule_title": "Cantina Della Biblioteca",
    "rule": "Ogni mago puo' avere una cantina della biblioteca La biblioteca è composta da 13 carte da gioco e il mago può scambiare carte da gioco tra la biblioteca e la cantina della biblioteca (Torneo cantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 143,
    "title": "Angelo Della Morte",
    "cost": "2SSS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Vola.<br>Non può bloccare.<br>->: La creatura bersaglio non può essere rianimata temporaneamente.",
    "strength": "5\/5",
    "extra": "Per conquistare la morte, bisogna solo morire.",
    "rule_title": "Si Prega Di Tradurre Questa Parola Scambio Di Posti A Sedere",
    "rule": "Dopo che l'incontro è iniziato non si può semplicemente cambiare posto; è necessaria una scheda o un effetto che permetta di farlo",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 144,
    "title": "Quartex",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "Jupiter Power, ->: Aggiungi 2 mana incolore alla tua piscina di mana; usa quel mana solo per gli artefatti.<br> 0: Salva il mana rimanente del tuo avversario nel quartetto.<br>->: Aggiungi tutto il mana salvato alla tua piscina di mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Quartex",
    "rule": "Usa quel mana solo per gli artefatti significa Per incantesimi di artefatti e costi di effetto specie<br><br><br><i>Acquistare una cosa divertente<\/i>",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 145,
    "title": "Cometa",
    "cost": "RR",
    "color": "red",
    "type": "Incantesimi Violenti, Mito",
    "body": "Tutti i maghi traggono una carta da gioco dalla loro eclittica.",
    "strength": "",
    "extra": "",
    "rule_title": "Consigli",
    "rule": "Tra le altre cose le seguenti domande dovrebbero ricevere risposta dai consigli<br>* Qual è un buon motivo per generare mana<br>* Qual è il contrario di ciò che incantesimo (le creature non hanno un contrario)<br><br>(vrgl Regola 836735)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 146,
    "title": "Sciame di Calabroni",
    "cost": "XG",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Tutte le creature volanti subiscono danni X.",
    "strength": "",
    "extra": "",
    "rule_title": "Modalità Torneo",
    "rule": "Ci sono 3 modalità di torneo ufficiali (tutte nel sistema svizzero) di cui la modalità magica si gioca sempre in un torneo al vertice 1 modalità di potenza (le biblioteche non vengono scambiate prima vince il miglior valore di biblioteca) 2 modalità astrale (le biblioteche non vengono scambiate prima vince il miglior valore astrale) 3 modalità magica (le biblioteche vengono scambiate prima vince il miglior valore di biblioteca)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 147,
    "title": "Totem",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto",
    "body": "->, _2_, Neutralizzare un effetto attivabile di una scheda principale.",
    "strength": "",
    "extra": "",
    "rule_title": "Aktivierbare Effekte",
    "rule": "Gli effetti attivabili sono effetti che richiedono la spesa dei costi di attivazione (sempre a sinistra del colon ) Le carte piombo possono anche avere proprietà ed effetti condizionali",
    "pic": true,
    "token": "0ts8w3sJAylNtl3GYIljsNDxUKjC2I9ZZdV45A+9NxQ=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 148,
    "title": "Intrico",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto, Esiguità",
    "body": "Tutti i maghi ricevono 2 danni per ogni carta estratta dal loro grimorio, che non è la prima della loro fase di turno. Ogni mago può pagare un punto vita per non disegnare una carta.",
    "strength": "",
    "extra": "",
    "rule_title": "Effetto Condizionato",
    "rule": "Gli effetti condizionali delle Stay Card sono effetti che non possono essere attivati direttamente dal Mago Dominante ma sono innescati da qualcosa nel corso del mondo Gli incantesimi possono anche avere effetti condizionali",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 149,
    "title": "Scomposizione",
    "cost": "1B",
    "color": "blue",
    "type": "Incantesimo D'interruzione, Prodigi",
    "body": "Neutralizzare un Incantesimo Materiale.",
    "strength": "",
    "extra": "",
    "rule_title": "Realizzazione",
    "rule": "Se una cascata di Incantataka è completata allora gli incantesimi che non vengono contrastati e non rimossi dal mondo delle idee saranno eseguiti secondo le regole relative all'ordine allora <b>realizzato<\/b> Questo significa che dispiegano il loro effetto magico",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 150,
    "title": "Desolazione",
    "cost": "SS",
    "color": "black",
    "type": "Terra Incanto",
    "body": "La Terra non puo' piu' trasformare il mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Incantesimo Mirato",
    "rule": "Se il tipo di carta è un Incantesimo mirato il tipo di carta diventa una parola composta dalla parola Incantesimo e il bersaglio valido per quell'Incantesimo Per esempio incanto della terra Se nel blocco di istruzioni allora si parla di il paese il paese incantato è naturalmente inteso",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 151,
    "title": "Meditazione Trascendentale",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->, _2_, Disegnare una carta dal tuo grimorio e rivelarla a te stesso; Evoca quella carta come se fosse in mano tua. Se non li hai convocati all'inizio del tuo prossimo round parziale, mettili nel tuo mondo sotterraneo.",
    "strength": "",
    "extra": "",
    "rule_title": "Cause",
    "rule": "Le cause sono di sostanza spirituale",
    "pic": "true",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 152,
    "title": "Che La Folata Di Vento",
    "cost": "1G",
    "color": "green",
    "type": "Magia Spontanea",
    "body": "Distruggere una creatura volante.",
    "strength": "",
    "extra": "",
    "rule_title": "Fase Del Treno",
    "rule": "Durante la fase del turno il Mago pesca sempre una carta a meno che un effetto o una magia non richieda diversamente Non puoi lanciare incantesimi o applicare effetti durante la fase di turno Se devono essere pescate più carte da gioco questo viene fatto come un'unica azione Se un mago viene fermato per pescare X carte nella sua fase di turno nella sua fase di turno pesca esattamente X carte",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 153,
    "title": "Marcire",
    "cost": "1SS",
    "color": "black",
    "type": "Incantesimo Di Creatura",
    "body": "Inserire un -1\/-1 counter sulla creatura nella fase di rifornimento del controller. Quando la creatura lascia il mondo, il suo sovrano sceglie un nuovo bersaglio per marcire; se non c'è un bersaglio valido nel mondo, il marciume viene distrutto.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 154,
    "title": "Elementale d'Aria",
    "cost": "1BB",
    "color": "blue",
    "type": "Creatura, Mito",
    "body": "Vola. Non soffre di Stordimento da Evocazione. Riprendi in mano l'Elemantale d'Aria alla fine del tuo turno parziale.",
    "strength": "3\/1",
    "extra": "",
    "rule_title": "Unicità",
    "rule": "Un'unicità può essere evocata (realizzata) con successo solo una volta per incontro Inoltre l'unicità è consentita solo una volta per biblioteca",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 155,
    "title": "Intimidazione",
    "cost": "RR",
    "color": "red",
    "type": "Incantesimo D'interruzione, Mito",
    "body": "Contatore di una magia; aggiungi il costo di evocazione della magia neutralizzata alla tua scorta di mana; se non usi quel mana, riceverai un danno pari alla quantità di mana rimanente.",
    "strength": "",
    "extra": "",
    "rule_title": "Costi Di Convocazione Misti",
    "rule": "Se non diversamente specificato il colore di una carta da gioco è determinato dal colore del mana dei costi di convocazione Se i costi di convocazione sono composti da diversi tipi di Mana il colore della carta da gioco è determinato dal primo tipo di Mana dei costi di convocazione",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 156,
    "title": "Cavalluccio Marino",
    "cost": "B",
    "color": "blue",
    "type": "Creatura, Prodigi",
    "body": "->: Aggiungi 2 mana blu alla tua scorta di mana; usa quel mana solo per incantesimi veloci.",
    "strength": "0\/1",
    "extra": "Immerdar",
    "rule_title": "Ultima Possibilit&agrave;",
    "rule": "Una libreria con un valore di libreria <50<50<50 è una libreria di potenza una con un valore di libreria >50>50 è una libreria di redenzione e una con un valore di libreria <50>50 è una libreria magica È vero che una biblioteca magica è più desiderabile di una biblioteca di potere; una biblioteca di potere è più desiderabile di una biblioteca di salvezza",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 157,
    "title": "Agnello Sacrificale",
    "cost": "2S",
    "color": "black",
    "type": "Creatura",
    "body": "->, distruggere l'agnello sacrificale: aggiungere 3 mana nero mana nero alla tua scorta di mana.",
    "strength": "2\/2",
    "extra": "",
    "rule_title": "Effetti Degli Incantesimi",
    "rule": "Spesso gli incantesimi hanno un solo effetto Ma ci sono anche incantesimi che possono avere effetti multipli Se gli effetti sono separati da un punto () questi effetti sono realizzati uno dopo l'altro (vedi regola 642) non importa se uno non è realizzato o no Se gli effetti sono separati da un punto e virgola (;) il seguente effetto dipende dalla riuscita della realizzazione dell'effetto precedente (effetto dipendente) Ci sono anche effetti attivabili per le magie (vedi carta da gioco 85) (vedi regola 757) Se una magia può contrastare un solo effetto di una magia ma ci sono più effetti questi saranno gestiti di conseguenza",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 158,
    "title": "L'era Glaciale",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto",
    "body": "I paesi possono convertire solo un mana per round.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 159,
    "title": "Feenseele",
    "cost": "GG",
    "color": "green",
    "type": "Incantesimo Di Creatura",
    "body": "La creatura ora può volare e deve essere bloccata da tutte le creature che possono.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 160,
    "title": "Capolavoro",
    "cost": "2RR",
    "color": "red",
    "type": "Incantesimi Violenti, Mito",
    "body": "Creare una copia di un artefatto.",
    "strength": "",
    "extra": "La gilda non richiede molto, deve solo essere perfetta.",
    "rule_title": "Stesso",
    "rule": "Una biblioteca rimane la stessa se non viene cambiata o se tra due incontri viene cambiata una sola carta al massimo",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 161,
    "title": "Gentilezza",
    "cost": "G",
    "color": "green",
    "type": "Incantesimo D'interruzione",
    "body": "Una creatura ha temporaneamente il potere 0; pesca una carta.",
    "strength": "",
    "extra": "Ogni bestia può essere domata da un mago di talento.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 162,
    "title": "Aquila Reale.",
    "cost": "2R",
    "color": "red",
    "type": "Creatura",
    "body": "Vola.<br>_R_: Temporaneo +0\/+1",
    "strength": "2\/2",
    "extra": "",
    "rule_title": "Livello Di Crittografia",
    "rule": "Il livello di crittografia è determinato da (842- cryptocard_id più basso) + ((cryptocard_id più alto del più lungo ininterrotto (di quelli che sono già stati impressi) serie di cryptocard di 1) -1))",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 163,
    "title": "Soldato Di Latta.",
    "cost": "3",
    "color": "artifact",
    "type": "Manufatto, Creatura",
    "body": "->, _1_, Infliggi un danno a un bersaglio a tua scelta.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 164,
    "title": "Polpo Pugnalata",
    "cost": "2B",
    "color": "blue",
    "type": "Incantesimi Violenti",
    "body": "2 blaue Kreaturen.",
    "strength": "",
    "extra": "La cosa più importante è che sei abbastanza lontano.",
    "rule_title": "Determinazione Degli Effetti",
    "rule": "L'effetto di un incantesimo è determinato dal suo nome",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 165,
    "title": "Turbinio.",
    "cost": "2B",
    "color": "blue",
    "type": "Incantesimi Violenti",
    "body": "Distruggere tutte le creature volanti..",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 166,
    "title": "Ogre",
    "cost": "5R",
    "color": "red",
    "type": "Creatura, Mito",
    "body": "Quando l'orco entra nel mondo, tutte le creature subiscono 2 danni.",
    "strength": "5\/5",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 167,
    "title": "El Capitan",
    "cost": "1SS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Tutte le creature nere ottengono +1\/+1.",
    "strength": "1\/1",
    "extra": "Canaglia, Mascalzone, Maiale!!",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 168,
    "title": "Ribelle.",
    "cost": "WWW",
    "color": "white",
    "type": "Creatura, Mito",
    "body": "Costo aggiuntivo di convocazione = sacrificio il tuo avatar d'oro.<br>Causa danni di sfondamento.<br>_3_: Dimenticato.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Dimenticare, Ricordare",
    "rule": "Quando si utilizzano gli effetti Dimenticato e Ricordati l'incantesimo non viene richiamato",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 169,
    "title": "Oracolo Del Fuoco.",
    "cost": "RS",
    "color": "red",
    "type": "Incanto",
    "body": "->, _1_: Mostra la carta che hai appena disegnato; se si tratta di una terra, puoi disegnare un'altra carta.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 170,
    "title": "Casa.",
    "cost": "1",
    "color": "artifact",
    "type": "Manufatto",
    "body": "Puoi sempre avere più di 7 carte da gioco in mano. <br>->: Metti una carta da gioco della tua mano sotto il tuo grimorio.",
    "strength": "",
    "extra": "Lo studio della letteratura magica richiede non solo calma, ma anche una certa intimità.",
    "rule_title": "Deposito Di Carte Da Gioco",
    "rule": "Al termine della fase di scarto il giocatore attivo deve aver scartato tutte le sole 7 carte da gioco",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 171,
    "title": "Valanga Di Fango",
    "cost": "GGG",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Distruggere tutte le creature non volanti.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 172,
    "title": "Ape Assassina.",
    "cost": "GG",
    "color": "green",
    "type": "Creatura",
    "body": "Vola.<br>Non soffre la frenesia di evocazione",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 173,
    "title": "Axolotl",
    "cost": "WWW",
    "color": "white",
    "type": "Creatura, Mito",
    "body": "_W_: Ridurre i danni da una fonte a voi a 1.",
    "strength": "0\/2",
    "extra": "",
    "rule_title": "Riduzione Dei Danni",
    "rule": "La riduzione del danno è considerata come prevenzione del danno",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 174,
    "title": "Arcobaleno",
    "cost": "1B",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Cambia la parola di un incantesimo di un colore. Disegnare una carta..",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 175,
    "title": "Cavalli Delle Nuvole.",
    "cost": "1BB",
    "color": "blue",
    "type": "Creatura, Mito",
    "body": "Vola.<br>Tutte le creature volanti ottenere +1\/+1.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Uovo Di Pasqua",
    "rule": "172nCFMgaVNEoWZAi<br>KwHu8G1LXqA3gxMag",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 176,
    "title": "Lacrime dello Scorpione",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "Se tiri la lacrima di scorpione ottieni 2 danni; se la nascondi, ma viene fuori, ottieni 7 danni ->: mescola spontaneamente il tuo mondo sotterraneo con la lacrima di scorpione nel tuo grimorio.",
    "strength": "",
    "extra": "",
    "rule_title": "Prigione",
    "rule": "Quelli che costruiscono una prigione quando arriva il giorno entrano proprio in quella",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 177,
    "title": "Macchina Per Le Talpe",
    "cost": "5",
    "color": "artifact",
    "type": "Manufatto, Creatura",
    "body": "Non può essere bloccato da creature volanti.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 178,
    "title": "La Corona Dell'imperatore",
    "cost": "3",
    "color": "artifact",
    "type": "Manufatto, Unicità",
    "body": "->, _5_: Il tuo avversario ti dà una carta dalla sua mano, ma abbastanza educatamente; attiva questo effetto come un incantesimo violento.",
    "strength": "",
    "extra": "Governatore per grazia di Dio.",
    "rule_title": "Unico",
    "rule": "Un'unicità può essere solo una volta al mondo Se c'è un'unicità nel mondo nessun effetto o incantesimo può essere usato per portare un'altra unicità di questo tipo nel mondo Inoltre l'unicità è consentita solo una volta per biblioteca",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 179,
    "title": "Il Profeta Bugiardo",
    "cost": "S",
    "color": "black",
    "type": "Creatura",
    "body": "_1_: Aggiungi un mana nero alla tua riserva di mana",
    "strength": "1\/1",
    "extra": "La luce del cielo vi è data e voi la corrompete!",
    "rule_title": "Licht Und Schatten",
    "rule": "Tutti gli incantesimi e gli effetti che influenzano le carte bianche e gli incantesimi influenzano anche Shadow White Tutti gli incantesimi che influenzano le carte nere\/incantesimi influenzeranno anche gli incantesimi neri leggeri",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 180,
    "title": "Lotos",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->, _4_, Scartate una cartadate il controllo del loto al vostro avversarioevocate l'ultimo incantesimo del vostro avversarioche è stato lanciato quando il loto era già nel vostro mondo",
    "strength": "",
    "extra": "",
    "rule_title": "Incantata",
    "rule": "Ma nella palude più profonda il fiore di loto fiorisce",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 181,
    "title": "Cane",
    "cost": "WW",
    "color": "white",
    "type": "Creatura, Prodigi",
    "body": "Puoi anche evocare il Cane come incantesimo spontaneo",
    "strength": "0\/4",
    "extra": "Sempre pronto a proteggerti",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 182,
    "title": "Nudibranco.",
    "cost": "3S",
    "color": "black",
    "type": "Creatura",
    "body": "->Colloca una copia di questa lumaca Nact nel mondo <br>Un nemico può bloccare quante più lumache Nact con una creatura quante ne vuole",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 183,
    "title": "Il Massacro Dei Draghi",
    "cost": "2RR",
    "color": "red",
    "type": "Magia Spontanea, Mito",
    "body": "Distruggere una creatura: tu e il tuo avversario ricevete tanto mana chiaro quanto lo è stato il costo di convocazione della creatura; se il tuo avversario non vuole aggiungere la sua quota alla sua scorta di manaquesta scade",
    "strength": "",
    "extra": "",
    "rule_title": "Annuncio",
    "rule": "Dopo aver rimosso il Mantra della Purezza ogni mago nella sua fase principale può annunciare che il suo avversario diventerà un martire Fate questo preferibilmente con le parole お前はもう死んでいる (Omae wa mou shindeiru) Così l'annunciatore diventa il difensore e il suo avversario diventa l'attaccante Il difensore dichiara il numero di turni (a partire da 0) necessari affinché l'attaccante diventi un martire È possibile annunciare solo nella sua fase principale L'aggressore riconosce il suo ruolo proclamando (temporalmente e spiritualmente pretrasferito) Sono insormontabile",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 184,
    "title": "Assertività.",
    "cost": "G",
    "color": "green",
    "type": "Incantesimo D'interruzione",
    "body": "Costo di convocazione alternativa = Scarta una carta che ha il colore _______, paga una Incantesimo di salute.<br>La magia di destinazione non può essere neutralizzata.",
    "strength": "",
    "extra": "",
    "rule_title": "Arte Della Difesa",
    "rule": "L'incantata è la più alta arte della difesa",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 185,
    "title": "Titano",
    "cost": "4BB",
    "color": "blue",
    "type": "Creatura, Mito",
    "body": "Additional Summoning Cost= Scegli una creatura volante; il proprietario deve mettere quella creatura nella sua mano.<br>Vola.",
    "strength": "5\/6",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 186,
    "title": "In Manipolazione Della Memoria.",
    "cost": "3S",
    "color": "black",
    "type": "Incantesimi Violenti",
    "body": "Annulla un incantesimo dell'ultimo giro parziale.",
    "strength": "",
    "extra": "Come posso essere giudicato colpevole di aver mentito?",
    "rule_title": "Ritiro Degli Incantesimi",
    "rule": "Se un incantesimo viene rimosso sarà rimesso in mano e l'incantesimo sarà rimosso dal mondo delle idee ma i costi di convocazione non saranno rimossi Se un punto non è esplicitamente menzionato nella corsa mondiale (ad es ultimo giro) può essere ritirato un solo incantesimo nell'Incantatacascata ancora attiva",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 187,
    "title": "Sfida.",
    "cost": "2R",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Evoca la sfida prima della fase di attacco. Il mago attivo attacca con tutte le creature che possono.",
    "strength": "",
    "extra": "",
    "rule_title": "Aktiv Passiv",
    "rule": "Il mago il cui giro parziale è in corso è il mago attivo tutti gli altri sono maghi passivi",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 188,
    "title": "Incantesimo Di Fortuna",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea, Mito",
    "body": "Scegliere uno dei seguenti effetti * Prevenire fino a 3 danni da una fonte. * Ricevi una vita per ogni fonte che ti danneggia in questo turno parziale. * neutralizza di un incantesimo o effetto attivabile se il suo controllore non paga _1_.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 189,
    "title": "Eiserne Jungfrau",
    "cost": "R",
    "color": "red",
    "type": "Mago Incanto",
    "body": "Il Mago guadagna danni se ha 4 o più carte in mano durante la sua fase di rifornimento.",
    "strength": "",
    "extra": "Aber schön langsam.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 190,
    "title": "Cockatoo",
    "cost": "2G",
    "color": "green",
    "type": "Creatura",
    "body": "Vola.<br>_G_: Resurrezione.<br>->, _1_: Aggiungi un mana verde alla tua fornitura di mana.",
    "strength": "1\/1",
    "extra": "Lora ist da! Lora ist da!",
    "rule_title": "Suggerimenti",
    "rule": "Quando una creatura viene convocata con successo e quindi realizzata non ha alcuna prova mondana dell'esistenza di maghi",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 191,
    "title": "Heitere Gelassenheit",
    "cost": "2W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Tu e le tue creature non puoi essere bersaglio di incantesimi nel prossimo round; pesca una carta.",
    "strength": "",
    "extra": "Se vuoi confondere qualcuno, prova a dargli qualcosa.",
    "rule_title": "Zu Nichte",
    "rule": "Alla fine dell'incontro tutte le carte di soggiorno (ad eccezione dei paesi delle strutture spazio-temporali e dei corpi celesti) vengono distrutte Ciò significa che sono trattati come se non ci fossero mai stati (nel mondo di gioco cioè il mondo di gioco è completato) Paesi strutture spazio-temporali e corpi celesti sono trascendenti (proprio come il mondo delle idee) cioè sono sempre stati lì Paesi strutture spazio-temporali e corpi celesti appaiono così nel mondo come immagini del loro sviluppo naturale",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 192,
    "title": "Biblioteca Del Monastero",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->, _2_: Se non hai una carta da gioco in mano, puoi pescare una carta da gioco.",
    "strength": "",
    "extra": "So I don't know how to make the best of it, but I think it's a good idea.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 193,
    "title": "Unicorno Sognato",
    "cost": "WW",
    "color": "white",
    "type": "Creatura, Moltitudine",
    "body": "Costi di incantesimo alternativi: _W__B_.<br>Quando c'è più di un unicorno sognato nel mondo, tutti gli unicorni sognati sono creature verdi 2\/3.",
    "strength": "0\/3",
    "extra": "Milioni....",
    "rule_title": "Appaiono",
    "rule": "Gli Unicorni appaiono esattamente al momento giusto",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 194,
    "title": "Dunkle Aura",
    "cost": "1S",
    "color": "black",
    "type": "Privazione Della Creatura",
    "body": "Può essere convocato come un incantesimo spontaneo. Le incantesimi non hanno alcun effetto sulla creatura.",
    "strength": "",
    "extra": "",
    "rule_title": "Disenchantments",
    "rule": "I disincantesimi hanno le stesse regole degli Incantesimi ma gli incantesimi relativi agli incantesimi non hanno effetto sui Disincantesimi",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 195,
    "title": "Specchio Scudo",
    "cost": "0",
    "color": "light_grey",
    "type": "Incantesimo Di Energia, Mito",
    "body": "E' considerata una carta da gioco grigio chiaro Selezionare un nuovo target per un effetto attivabile",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 196,
    "title": "Tasso Del Miele",
    "cost": "1GGG",
    "color": "green",
    "type": "Creatura, Mito",
    "body": "Il tasso del miele attacca sempre<br>Causa danni da penetrazione",
    "strength": "4\/4",
    "extra": "Das schert den Honigdachs doch nicht",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 197,
    "title": "Riproduzione Di Combattimento",
    "cost": "GG",
    "color": "green",
    "type": "Incanto",
    "body": "Ogni mago può mettere una copia di una creatura nel suo mondo; distruggere quelle creature quando la procreazione di combattimento lascia il mondo",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 198,
    "title": "Irrer Wissenschaftler",
    "cost": "RRR",
    "color": "red",
    "type": "Creatura",
    "body": "At Artefaktkreaturen erhalten +1\/+1",
    "strength": "1\/2",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 199,
    "title": "Assistente Ortografico",
    "cost": "2B",
    "color": "blue",
    "type": "Creatura",
    "body": "->Scambia interrompendo l'ordine di due incantesimi",
    "strength": "1\/2",
    "extra": "Upsi!",
    "rule_title": "Una Sola Raccomandazione",
    "rule": "Se possibile convocare l'Assistente Incantesimo con Blumenmana",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 200,
    "title": "Apertura",
    "cost": "3R",
    "color": "red",
    "type": "Incantesimi Violenti, Mito",
    "body": "Tutti i maghi distruggono successivamente un terzo delle loro terre, creature, artefatti e incantesimi",
    "strength": "",
    "extra": "Sarebbe meglio ora di capire",
    "rule_title": "Successivamente",
    "rule": "Se una magia innesca effetti multipli uno dopo l'altro (o ha effetti multipli separati con  o effetti dipendenti separati con ;) essi saranno trattati come incantesimi singoli e aggiunti alla cascata di conseguenza - l'ultimo per primo Tutti gli effetti dell'incantesimo vengono aggiunti alla cascata nello stesso momento Questo significa anche che il mago convocante deve impegnarsi in tutti gli effetti che richiedono una decisione o un costo di attivazione al momento della convocazione I termini di performance dei titoli dipendenti sono rivisti al momento del regolamento della cascata L'incantesimo totale deve essere pensato come una parentesi intorno all'insieme degli effetti e se neutralizzato viene neutralizzato del tutto",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 201,
    "title": "Eco Temporale",
    "cost": "B",
    "color": "blue",
    "type": "Incantesimo D'interruzione",
    "body": "Fai una copia dell'incantesimo del tuo avversario dall'ultimo round e dai il controllo al tuo avversario",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 202,
    "title": "Fauna Selvatica",
    "cost": "1GG",
    "color": "green",
    "type": "Incantesimi Violenti",
    "body": "Trasformare un paese in una foresta",
    "strength": "",
    "extra": "La natura si riprende tutto",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 203,
    "title": "Kintsugi",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Riparare una carta di soggiorno che non è una creatura",
    "strength": "",
    "extra": "Jetzt ist es perfekt",
    "rule_title": "Riparazione",
    "rule": "DE:Reparieren ist ähnlich zu Wiederbeleben für Kreaturen.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 204,
    "title": "Messaggero Dell'inferno",
    "cost": "SSS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Vola <br>Quando il messaggero infernale ha inflitto danni a un mago, quel mago scarta una carta dalla sua mano",
    "strength": "2\/2",
    "extra": "Certe cose è meglio dimenticarle",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 205,
    "title": "Negoziazioni Sul Campo",
    "cost": "1W",
    "color": "white",
    "type": "Incanto",
    "body": "Prima dell'inizio di ogni round, concorda con il tuo avversario il numero massimo di incantesimi che ogni mago può evocare nel round successivo; se non sei d'accordo, puoi evocare un massimo di 2 incantesimi per mago",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 206,
    "title": "A-Nerin-Daág",
    "cost": "1W",
    "color": "white",
    "type": "Incantesimo D'interruzione",
    "body": "Contestare un incantesimo che ha un potenziale di danno",
    "strength": "",
    "extra": "Un incantesimo d'altri tempi passati",
    "rule_title": "DE:Schadenspotential",
    "rule": "Una magia creatura che produrrebbe una creatura che ha 0 Potenza o non può attaccare non ha alcun potenziale di danno Gli incantesimi di creature aumentabili hanno un potenziale di danno",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 207,
    "title": "Vero Guerriero",
    "cost": "2SSWW",
    "color": "light_black",
    "type": "Creatura, Mito",
    "body": "Viene considerata come una carta da gioco nera chiara Rimuovi tutte le creature che combattono il vero Guerriero dal mondo dopo la battaglia<br>2_S__S__W__W_: evoca il vero Guerriero dagli Inferi come se fosse nella tua mano",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Lancio Fortunato",
    "rule": "DE:Falls eine Karte einen Glückskartenwurf anfordert, so werden die Regeln für Glückskartenwurf (Handhaltung, Höhe, ausgewogene Kunstoffkarte etc.) so gewählt, daß stets die beste Incantatakartenzufallswurfmaschine unter diesen Regeln keinen statistisch signifikanten Vorteil erwerfen kann.",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 208,
    "title": "Magnolia Blossom",
    "cost": "0",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "->offrire il fiore di magnolia orlare un avatar d'oro Aggiungi un mana bianco alla tua scorta di mana<br>-> Sacrifice the Magnolia Flower Sacrifice a Land Add 2 Health",
    "strength": "",
    "extra": "Non tutti sono degni di lei",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 209,
    "title": "Amnesia",
    "cost": "SS",
    "color": "black",
    "type": "Incantesimi Violenti, Mito",
    "body": "Un mago sceglie 2 carte a mano e le scarta",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 210,
    "title": "Dolore",
    "cost": "R",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Danneggiamento di un bersaglio 4 ricordare",
    "strength": "",
    "extra": "A volte è istruttivo ricordare almeno il dolore",
    "rule_title": "DE:Erinnern",
    "rule": "DE:Ein Zauberspruch mit Erinnern kann, wenn er zumindest einmal verwirklicht wurde, aus der Unterwelt zurück auf die Hand genommen werden. Die Geschwindigkeit dafür ist Spontanzaubergeschwindigkeit.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 211,
    "title": "Quadrifoglio",
    "cost": "1W",
    "color": "white",
    "type": "Magia Spontanea, Mito",
    "body": "Il tuo avversario sceglie una carta dal tuo grimorio Prendi quella carta in mano",
    "strength": "",
    "extra": "Le virtù sono ricompense le ricompense sono virtù",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 212,
    "title": "Passero Incapace di Volare",
    "cost": "G",
    "color": "green",
    "type": "Creatura, Mito",
    "body": "Lancio Carta della Fortuna A tuo favore => Temporaneo +1\/+1 e Volare Contro il tuo favore => Diventa una creatura 0\/1 senza Volare e non puoi più attivare questo effetto questo turno",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 213,
    "title": "Girasole Notturno",
    "cost": "S",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "->, _1_, Salvare un mana lunare nel girasole notturno. ->: Aggiungi un mana precedentemente salvato come mana bianco alle tue scorte di mana.",
    "strength": "0\/1",
    "extra": "La loro bellezza è pienamente visibile solo durante la notte.",
    "rule_title": "Mana Cielo",
    "rule": "I diversi corpi celesti donano soprattutto mana incolore, ma l'origine può ancora essere importante. Per esempio, la luna dona \"Mondmana\".",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 214,
    "title": "Manipolazione Del Tempo",
    "cost": "1B",
    "color": "blue",
    "type": "Magia Spontanea, Mito",
    "body": "Sedetevi al prossimo turno parziale: Fate un altro giro parziale dopo il vostro prossimo giro parziale.",
    "strength": "",
    "extra": "All'inizio sembra un ritiro.....",
    "rule_title": "DE:Heilung",
    "rule": "Dopo un turno parziale, tutte le creature sono riportate alla forza e alla resistenza.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 215,
    "title": "Blutiges Schlachtfest",
    "cost": "3SS",
    "color": "black",
    "type": "Incantesimi Violenti, Mito",
    "body": "Sacrificare una creatura il tuo avversario sacrifica 2 creature; restituire 2 corpi celesti",
    "strength": "",
    "extra": "Zuerst scheut man sich",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 216,
    "title": "Asperula",
    "cost": "2G",
    "color": "green",
    "type": "Magia Spontanea, Mito",
    "body": "Mescolare una creatura dalla tua mano nel tuo grimorio; pescare 3 carte da gioco",
    "strength": "",
    "extra": "Una pianta speciale",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 217,
    "title": "Duplicato",
    "cost": "2B",
    "color": "blue",
    "type": "Incantesimo D'interruzione, Mito",
    "body": "Copia un incantesimo che hai già convocato in questo round parziale e paga il suo costo di convocazione",
    "strength": "",
    "extra": "δ",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 218,
    "title": "Blood Sky Full Moon",
    "cost": "1SS",
    "color": "black",
    "type": "Incanto, Mito",
    "body": "Ogni mago paga un punto vita per ogni corpo celeste non refilato prima dell'inizio del suo turno parziale; questo effetto ha effetto solo prima dell'inizio del tuo prossimo turno parziale.",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Vertrauen",
    "rule": "I grandi maghi sono completamente affidabili.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 219,
    "title": "Teuflischer Vertrag",
    "cost": "S",
    "color": "black",
    "type": "Incantesimi Violenti, Mito",
    "body": "Prendi in mano una carta della tua biblioteca. Prendere a caso una carta dal tuo grimorio e mischiarla nel grimorio del tuo avversario; può pagare il costo della convocazione di quella carta con mana incolore.",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Retten",
    "rule": "Salvare il suo avversario significa:- la sua salute sarà impostata a 1 se ha 0 o meno<br>- non deve pescare una carta se non ha più carte nel suo grimorio.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 220,
    "title": "Fulmine",
    "cost": "RR",
    "color": "red",
    "type": "Incantesimi Violenti, Prodigi",
    "body": "Alle Kreaturen erhalten 2 Schaden",
    "strength": "",
    "extra": "Quando sentite il tuono è già troppo tardi",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 221,
    "title": "Il Filo Di Arianna",
    "cost": "2B",
    "color": "blue",
    "type": "Incanto, Mito",
    "body": "-> _1_ Guarda le prime 3 carte da gioco nel tuo grimorio e mettile a faccia in su o a faccia in giù in qualsiasi ordine <br>-> Mescola una carta enorme dalla tua mano nel tuo grimorio",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 222,
    "title": "Archer",
    "cost": "1G",
    "color": "green",
    "type": "Creatura, Mito",
    "body": "->Infliggere 2 danni a una creatura volante attaccante",
    "strength": "1\/2",
    "extra": "Con gli occhi dell'aquila con l'anima del vero guerriero",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 223,
    "title": "Liberazione",
    "cost": "W",
    "color": "white",
    "type": "Magia Spontanea",
    "body": "Distruggere tutti gli incantesimi e Signa su una creatura.  _W__W__W__W__W_: Ricordate.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 224,
    "title": "In Anima Che Succhia",
    "cost": "1S",
    "color": "black",
    "type": "Incantesimo D'interruzione",
    "body": "Sacrificare una creatura: si perde tutta la salute; guadagnare la salute come molti salute come la creatura sacrificata ha avuto resistenza.",
    "strength": "",
    "extra": "Nun bist du dran!",
    "rule_title": "DE:Konsequent",
    "rule": "Si deve sempre evocare con certezza, vale a dire che l'estrazione di incantesimi, senza una carta da gioco adeguata non è consentita.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 225,
    "title": "Stella Del Mattino",
    "cost": "B",
    "color": "blue",
    "type": "Magia Spontanea, Mito",
    "body": "Parte di una cascata di tre serbatoi spontanei. Tutti i maghi possono pescare fino a 4 carte da gioco, ma solo 7 in ogni mano.",
    "strength": "",
    "extra": "Pazienza senza fine.....questo significa riconoscere il momento giusto!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 226,
    "title": "Curiosità",
    "cost": "1W",
    "color": "white",
    "type": "Incantesimo D'interruzione, Mito",
    "body": "Guarda le prime 4 meno di 1 carte da gioco nel tuo grimorio e rimettile in qualsiasi ordine; pesca una carta da gioco.",
    "strength": "",
    "extra": "Saying you're vergeben.",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 227,
    "title": "L'Occhiolino del Tempo",
    "cost": "1B",
    "color": "blue",
    "type": "Magia Spontanea",
    "body": "Prendi uno dei tuoi artefatti e mettilo nel tuo mondo più tardi in questo round senza pagare le spese di convocazione.",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Belohungen",
    "rule": "Sei ricompensato per i tuoi onesti sforzi.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 229,
    "title": "Armatura Di Pelle",
    "cost": "4",
    "color": "artifact",
    "type": "Manufatto, Mito",
    "body": "Ridurre i danni di uno per fonte.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 230,
    "title": "Stark Gehopftes Bier",
    "cost": "3GG",
    "color": "green",
    "type": "Incantesimi Violenti, Mito",
    "body": "Evoca questo giro parziale solo questo incantesimo; nel tuo prossimo giro parziale i tuoi corpi celesti producono _1_ in più ciascuno.",
    "strength": "",
    "extra": "Rinfresca Enormemente",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 231,
    "title": "Concentrazione",
    "cost": "0",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Costi di convocazione aggiuntivi: Paga _1_ nella prossima fase di convocazione. Carta da gioco rossa. Puoi anche evocare la concentrazione nella fase principale del tuo avversario. Contrastare un incantesimo violento. _2_: Dimenticato.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "Il gatto appartiene alla casa.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 232,
    "title": "In Cavallo Di Fiamma A Tre Pedali",
    "cost": "2RR",
    "color": "red",
    "type": "Creatura, Mito",
    "body": "Tutti i maghi devono sempre attaccare con tutte le creature che possono.",
    "strength": "1\/2",
    "extra": "Beato colui che ha un'altra professione.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 233,
    "title": "Schwarzer Reiter",
    "cost": "3SSS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Ogni creatura riceve un -1\/-1 counter ad ogni fase di rifornimento.",
    "strength": "6\/6",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 234,
    "title": "Pipa Di Tabacco",
    "cost": "2",
    "color": "artifact",
    "type": "Manufatto",
    "body": "Ogni mago può evocare un solo incantesimo rapido per turno parziale.",
    "strength": "",
    "extra": "Un buon tubo trasforma una cabina in un palazzo.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 235,
    "title": "Estorcere",
    "cost": "4RR",
    "color": "red",
    "type": "Incantesimi Violenti",
    "body": "Scambia i posti con un mago",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 236,
    "title": "Senza Nome",
    "cost": "4",
    "color": "artifact",
    "type": "Creatura, Mito",
    "body": "Incarnazione senza nome.<br>Non può essere il bersaglio degli incantesimi.<br>Tutti i tuoi incantesimi costano _1_ meno.<br>_6_: Memoria unica.",
    "strength": "4\/4",
    "extra": "Genau zur rechten Zeit.",
    "rule_title": "DE:Bestimmung",
    "rule": "Quando si inizia con un destino, si ha un destino. Se si parte senza destino, ma si disegnare uno, allora si ha il destino. Se non hai un destino, sei senza destino. Se sei grasso, puoi creare un'incarnazione senza grasso. Se hai un'incarnazione senza grassi sotto il tuo controllo e ricevi un destino, l'incarnazione senza grassi sarà rimossa dal mondo.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 237,
    "title": "Pace Nel Mondo",
    "cost": "W",
    "color": "white",
    "type": "Incanto",
    "body": "Gli incantesimi violenti non possono più essere evocati.",
    "strength": "",
    "extra": "I passeri lo fischiano dai tetti.",
    "rule_title": "DE:Unmündig",
    "rule": "L'immaturità è l'incapacità di usare la propria mente senza la guida di un altro. Questa immaturità è autoinflitta se la causa non sta nella mancanza di comprensione, ma nella risoluzione e nel coraggio di farne uso senza la guida di un altro.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 238,
    "title": "Fiducia",
    "cost": "G",
    "color": "green",
    "type": "Incanto, Prodigi, Indistruttibile",
    "body": "Se anche un altro mago che non sei tu ha fiducia sotto il suo controllo puoi pescare 2 carte ciascuna durante la fase del tuo turno",
    "strength": "",
    "extra": "Non stupitevi dell'effetto magico!",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 248,
    "title": "Paesaggio Collinare",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "->, _1_: Aggiungi un mana rosso al tuo pool di mana<br>_1_ Dimentica",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 249,
    "title": "Nutrizione",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "->, _1_: Aggiungi un mana blu alla tua scorta di mana<br>_1_: Dimentica",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 250,
    "title": "Boschetto",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "->, _1_: Aggiungi un mana verde alla tua scorta di mana<br>_1_: Dimentica",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 251,
    "title": "Canyon",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "->, _1_: Aggiungi un mana nero alla tua scorta di mana<br>_1_: Dimentica",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 252,
    "title": "Steppa",
    "cost": "",
    "color": "land",
    "type": "Paese, Mito",
    "body": "->, _1_: Aggiungi un mana bianco alla tua scorta di mana<br>_1_: Forget",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 260,
    "title": "In \"potenza Di Morte",
    "cost": "SSS",
    "color": "black",
    "type": "Incanto, Mito",
    "body": "Salta la fase del tuo turno.<br>0: disegnare una carta all'inizio della fase di scarto se hai meno di 7 carte in mano; pagare una vita se è nera, ma 2 se non è nera.",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Zwischenphasen",
    "rule": "Puoi sempre innescare un Incantatacascata tra le fasi (per esempio: \"prima della fase di attacco\", \"dopo la fase di scarto\"). In questi stadi intermedi, solo gli incantesimi rapidi possono essere evocati.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 263,
    "title": "Angelo Dei Sogni",
    "cost": "3BB",
    "color": "blue",
    "type": "Creatura, Mito",
    "body": "Mutaforma",
    "strength": "3\/3",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 269,
    "title": "Siccità",
    "cost": "2RR",
    "color": "red",
    "type": "Incanto",
    "body": "Versorgung: _R_.<br> Alle Kreaturen erhalten -0\/-1",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 271,
    "title": "Pugnale Del Fuoco",
    "cost": "R",
    "color": "red",
    "type": "Magia Spontanea",
    "body": "Infliggere 4 danni a una creatura",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 275,
    "title": "Moor",
    "cost": "",
    "color": "land",
    "type": "Paese",
    "body": "->: Infliggere danno a una creatura attaccante.",
    "strength": "",
    "extra": "",
    "rule_title": "Spooken",
    "rule": "Un mago può applicare gli effetti attivabili di una creatura che si trova negli Inferi e ha il tratto \"infestato\".",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 278,
    "title": "Abnormal Activity",
    "cost": "1S",
    "color": "black",
    "type": "Magia Spontanea",
    "body": "Evoca un incantesimo spontaneo da qualsiasi mondo sotterraneo",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 426,
    "title": "Orologio",
    "cost": "",
    "color": "artifact",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "Di tutti le opere umane, il meccanismo d'orologeria è il più diabolico",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 428,
    "title": "Rondine",
    "cost": "WW",
    "color": "white",
    "type": "Creatura",
    "body": "Vola. Cerca una rondine nella tua biblioteca e mettila direttamente nel mondo.",
    "strength": "0\/1",
    "extra": "Una parte ne fa parte, l'altra no.",
    "rule_title": "Enchanted 1-233",
    "rule": "In linea di principio, qualsiasi forma di Incantata è adatta solo per adulti (18+). Tuttavia, se i genitori vogliono permettere ai loro figli di giocare agli Incantata (i genitori sono responsabili), deve essere utilizzata solo la versione attuale delle carte da gioco (carte da gioco reali da 1 a 233) con gli schizzi ufficiali (img_skizze*). Raccomandazione: almeno 14 anni.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 608,
    "title": "Gufo",
    "cost": "SS",
    "color": "black",
    "type": "Creatura, Mito",
    "body": "Vola <br>Potenza lunare, ->: Distruggere una creatura con una resistibilità non superiore a una",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 741,
    "title": "",
    "cost": "0",
    "color": "none",
    "type": "Magia Di Sogno, Mito",
    "body": "È considerata una carta da gioco bianca chiara Scambia i posti con un mago se il mago è d'accordo Disegnare una carta da gioco",
    "strength": "",
    "extra": "741  uno a due e due a uno",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 752,
    "title": "",
    "cost": "",
    "color": "light_white",
    "type": "Regola",
    "body": "Una creatura indistruttibile conosce il suo creatore",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Krönung",
    "rule": "DE:(Titel Krönung) Karte 766 siehe auch Regel 752",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 767,
    "title": "",
    "cost": "",
    "color": "",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "DE:Das Prinzip von Ursache und Wirkung ist stets gültig.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 840,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Regelkarten",
    "rule": "DE:Regeln sind auch Karten. Karten sind auch Regeln.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 841,
    "title": "TIC-841",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Io Sono Incantata\/o!",
    "rule": "Un mago che riconosce di non poter sconfiggere l'avversario lo annuncia con la frase: \"Io sono incantata\/o! \"(\"Sono incantato\/rapito\"). Se un mago non l'ha riconosciuto alla fine, può naturalmente farlo in seguito. Con gli Incantata non si può perdere; l'incontro può solo finire.",
    "pic": true,
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 842,
    "title": "Biglietto Da Visita",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "Ich bin nicht Enchanted<br><br> \"I am Enchanted!",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Visitenkarte",
    "rule": "DE:Ich bin nicht Incantata.<br><br> „Io sono Incantata!“",
    "minting_cost": "",
    "pic": "true",
    "date": 0
},

{
    "card_id": 2000,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Io Sono Incantato!",
    "rule": "Eccolo! Hier ist nun Incantata. Wir schreiben das Jahr 27790. Incantata ist fertig - 7... 4... 2... Zauberei!.<br><b>Io sono Incantata!<\/b><br><br><b>Lizenz<\/b>: Alle Bilder, alle Kartentexte und alles auf dieser Seite ist <b>CC-SA (Creative Common Share Alike) lizensiert<\/b>.<br><br><b>Kontakt<\/b>: über tox: (siehe https:\/\/tox.chat\/ ) 178DCC811AD8810D2DEAD19 275A0773D9E389A123DA067 6AC25FCE88654244555CBA3 211A3B7 <br><br><b>Wallet:<\/b> https:\/\/byteball.org <br><br> <b>set asset names script:<\/b><br><a href='set_asset_names.sh'>set_asset_names.sh<\/a>",
    "date": 0
},

{
    "card_id": 2001,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Assistenza",
    "rule": "- Ospita questa pagina su 0net.<br>- Dipingi un'immagine.<br>- Trova errori di ortografia.<br>- Distribuisci\/sostituisci carte crittografiche (fino a 1 o 2 set). <br>- Regala a un amico <a href='einzel.html?ids=52'>Goldkarpfen<\/a>.<br>- <u>- Trascorri un'ora in serenità con i tuoi amici!",
    "date": 0
},

{
    "card_id": 2002,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Consigli Per Gli Artisti",
    "rule": "<u>Non c'è alcuna garanzia che la vostra immagine sarà accettata proprio come questa <\/u>.<br><br>- Brevetti\/artisti presentano un quadro finito, che non è ancora assegnato (in caso di dubbio, chiedere per esso, prestare attenzione alla qualità fotografica!)<br>- Ricordate che mi riservo il diritto di rifiutare l'immagine. <br>- <u>- <u>Tieni presente che mi riservo il diritto di scegliere il ritaglio\/luminosità\/contrasto! <\/u><br>Solo le immagini con il marchio \"Forgot\" sono fisse, tutte le altre possono cambiare in qualsiasi momento, il primo artista accettato riceverà naturalmente le schede di crittografia.",
    "date": 0
},

{
    "card_id": 2003,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Cloni Linguistici E Cloni",
    "rule": "- Natürlich kannst du jederzeit Incantata klonen (CC-SA) und verändern.<br>- Diese Seite ist sehr einfach zu klonen, alle Texte, die übersetzt werden müssen sind in der data.json<br>- Wenn du einen Sprachklon machen willst (nur übersetzen, Spielmechanik & Seitenstruktur verbleiben wie gehabt, dh. nur cards.db, data.json und content.json dürfen sich von der offiziellen Incantataversion unterscheiden) bist du sehr herzlich willkommen.<br>- Sprachklone dürfen keinen Javascript-tag in der Datenbank enthalten.<br>- Sprachklone werden bevorzugt in der Kopfzeile von Incantata angezeigt.<br>- Andere Klone werden, wenn sie mir gefallen, auch zur Kopfzeile hinzugefügt.<br>",
    "date": 0
},

{
    "card_id": 2004,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Domande E Risposte",
    "rule": "D: Cos'è Incantata? <br>R: Incantata è una parola italiana e significa incantata. Sia nel senso magico, sia nel senso di \"Sono contento!\"<br><br>D: Non ci sono già abbastanza giochi di carte collezionabili? <br>R: Incantata è di più; Incantata è un progetto artistico, una biblioteca magica, un mito, un sistema di pensiero, uno specchio della cultura, e molto altro ancora.<br>Ogni carta Incantata è magica attraverso e attraverso.<br><br>D: Oh, tu spavento, la magia non è anche pericolosa? <br>R: Non preoccupatevi, il Mantra della Purezza vi proteggerà in quanto segna il passaggio all'universo degli Incantata.<br><br>D: Perché tutto questo con le carte cripto? <br>R: Incantata è completamente non commerciale e alla fine sarà liberamente copiabile e stampabile da chiunque; l'idea con le carte cripto serve come incentivo per gli artisti a partecipare - ricevono certificati, per così dire, che dimostrano che hanno aiutato. Così possiamo creare un'opera d'arte senza soldi - perché non è disponibile.<br><br><br>D: E perché ora Byeteball per imprimere le carte. <br>R: Con Byteball si possono facilmente imprimere oggetti digitali. Il Byteball Wallet è molto avanzato e presto sarà sicuramente possibile visualizzare le immagini nel Byetballwallet. Basta leggere il Byteball Whitepaper (https:\/\/byteball.org).<br><br><br>D: Quante carte ci saranno? <br>R: 841<br><br>D: Quanto tempo ci vorrà per preparare tutti?<br>R: Il tempo necessario per farlo fare - certamente più di un anno.<br><br>D: Ci saranno carte più rare<br>R: In linea di principio no. Solo le leggende (consentite solo una volta per biblioteca) sono logicamente goffrate solo 1\/3 volte.<br><br>D: Cos'è il gioiello d'arco<br>R: Le carte Incantata 1-91 si chiamano <b>gioiello d'arco<\/b>.<br><br>D: Chi decide quali carte appartengono a Incantata? <br>R: Alla fine decido per me stesso, ma in questo processo la comunità della rete, gli sponsor della mappa e gli artisti sono molto coinvolti.<br><br>D: Non si tratta in qualche modo di una sorta di struttura centrale dittatoriale <br>R: Fondamentalmente, soprattutto per quanto riguarda le strutture di comunicazione, preferisco i costrutti decentralizzati. In questo caso, però, è un progetto artistico di cui mi occupo della direzione letteraria. Il tutto non è così autoritario come sembra, perché tutti coloro che partecipano cambiano Incantata! <br><br>D: Codice sorgente libero <br>R: Tutti gli strumenti del programma usati per Incantata sono liberi nel senso del Progetto GNU e\/o nel senso della FSF\/FSFE.",
    "date": 0
},

{
    "card_id": 2005,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Status Von Enchanted",
    "rule": "Per le condizioni dei singoli domini vedi \"print views\" (in alto): \"finito\" significa \"rifinito meccanicamente\"; cosmetici, immagini, design della cornice, ecc. non è inteso - che segue più avanti.<br><br><br>Tutte le rappresentazioni delle carte da gioco in questa pagina sono provvisorie e destinate solo a testare il gioco. La progettazione proffessionale delle carte da gioco avrà luogo più tardi.",
    "date": 0
},

{
    "card_id": 2006,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Druckansichten",
    "rule": "(klappt mit chromium, 114%, borderless DIN-A4, borders minimum)<br>",
    "date": 0
},

{
    "card_id": 2007,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 1",
    "rule": "<span class='status_ready'><centro><b><b>Back<\/b><br><\/centro><\/span><br><a href='back-print.html'>Back<\/a><br><a href='eclittica-print.html'>ecliptic<\/a><br><a href='spazio-tempo-pressione.html'>Struttura Spazio-temporale<\/a><br><br><span class='status_ready'><b>dominio materiale (1-99)<\/b>>99,88%<\/center><\/span><br><a href='pressure.html?ids=0,1,1,1,1,1,52,14,15,16,17,18'>Fates & Legends<\/a><br><a href='druck.html? ids=0,02,03,04,05,06,07,07,39,91'>Celesteal body+Rose+Tulip<\/a><br><a href='druck.html?ids=0,08,08,08,08,09,10,11,12,13'>Paesi+RZG<\/a><br><a href='druck.html? ids=35,37,45,45,46,47,48,42,60,77'>incarnazioni+leggende<\/a><br><a href='druck.html?ids=0,90,95,80,84,86,89,93,99'>leggende<\/a><br><a href='druck.html?ids=19,20,21,21,22,23,24,25,26,27'>Base 1<\/a><br><a href='druck.html?ids=0,28,29,30,31,32,33,34,36'>Base 2<\/a><br><a href='druck.html? ids=0,38,44,40,41,41,49,43,51,53'>Base 3<\/a><br><a href='druck.html?ids=54,55,56,57,58,59,61,62,63'>Base 4<\/a><br><a href='druck.html? ids=64,65,66,66,66,67,68,69,70,71,72'>base 5<\/a><br><a href='druck.html?ids=73,74,75,76,78,79,81,82,83'>base 6<\/a><br><a href='druck.html?ids=85,87,92,92,92,94,50,96,97,98'>base 7<\/a><br><br><br>.",
    "date": 0
},

{
    "card_id": 2008,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 2",
    "rule": "<span class='status_beta'><center><b>Gewaltdomäne (100-234)<\/b><br>Beta<\/center><\/span><br><a href='druck.html?ids=100,101,102,103,104,105,106,107,108'>100-108<\/a><br><a href='druck.html?ids=109,110,111,112,113,114,115,116,117'>109-117<\/a><br><a href='druck.html?ids=118,119,120,121,122,123,124,125,126'>118-126<\/a><br><a href='druck.html?ids=127,128,129,130,131,132,133,135,136'>127-136<\/a><br><a href='druck.html?ids=137,138,139,140,141,142,143,144,145'>137-145'><\/a><br><a href='druck.html?ids=146,147,148,149,150,151,152,153,154'>146-154<\/a><br><a href='druck.html?ids=155,156,157,158,159,160,161,162,163'>155-163'><\/a><br><a href='druck.html?ids=164,165,166,167,168,169,170,171,172'>164-172<\/a><br><a href='druck.html?ids=173,174,175,176,177,178,179,180,181'>173-181'><\/a><br><a href='druck.html?ids=182,183,184,185,186,187,188,189,190'>182-190<\/a><br><a href='druck.html?ids=191,192,193,194,195,196,197,198,199'>191-199<\/a><br><a href='druck.html?ids=200,201,202,203,204,205,206,207,208'>200-208<\/a><br><a href='druck.html?ids=209,210,211,212,213,214,215,216,217'>209-217<\/a><br><a href='druck.html?ids=218,219,220,221,222,223,224,225,226'>218-226<\/a><br><a href='druck.html?ids=227,226,229,230,231,232,233,234'>227-234<\/a>",
    "date": 0
},

{
    "card_id": 2009,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 3",
    "rule": "<span class='status_prealpha'><center><b>Bewegungsdomäne (235-420)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2010,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 4",
    "rule": "<span class='status_prealpha'><center><b>Vergeistigungsdomäne (421-607)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2011,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 5",
    "rule": "<span class='status_prealpha'><center><b>Energiedomäne (608-741)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2012,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Druckseiten: 6",
    "rule": "<span class='status_prealpha'><center><b>Traumdomäne (742-841)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2013,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Neuigkeiten",
    "rule": "<a href='134.html'>134.html<\/a><\/a><br><br><b><b>Crypto card gift action<\/b><br>In questa pagina è nascosto un mantra di purezza.",
    "date": 0
},

{
    "card_id": 2014,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Distribuzione Di Schede Crittografiche",
    "rule": "- Ogni sponsor di carte da gioco e ogni artista riceve un \"Mantra di Purezza\"<br>- Lo sponsor di carte da gioco suggerisce una carta da gioco o adotta una carta da gioco.<br>- L'immagine (formato RAW) deve essere ben fotografata con una dimensione minima (After Trimming) di: 4000x3200 (40:32)<br>- L'immagine fotografata avrà una licenza Creative-Common (CC-SA)- L'originale sarà conservato dall'artista, naturalmente. <br>- L'immagine viene visualizzata in un rapporto di aspetto di 40:32 - nota questo <br>- Lo sponsor della carta da gioco trasferisce >= 5,1 MB (il valore esatto sarà impostato da me).<br>- Nessuna carta da gioco sarà mai più impresso.<br>- L'artista ottiene il 15%<br>- Lo sponsor della carta da gioco ottiene il 15%<br>.",
    "date": 0
},

{
    "card_id": 2015,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Prägungsmengen",
    "rule": "<table><tr><td><b>Tipo<\/b><\/td><td><b>100%<\/b><\/td><td><b>15%<\/b><\/td><td><b>Set<\/b><\/td><\/tr><tr><td>Legenda<\/td><td>819<\/td><td>123<\/td><td>1<\/td><\/tr><tr><td>Meraviglia<\/td><td>1638<\/td><td>246<\/td><td>2<\/td><\/tr><tr><td>Formula<\/td><td>2457<\/td><td>369<\/td><td>3<\/td><\/tr><tr><td>Struttura Spazio-temporale<\/td><td>4914<\/td><td>714<\/td><td>6<\/td><\/tr><tr><td>Moltitudine<\/td><td>9828<\/td><td>1475<\/td><td>12<\/td><\/tr><tr><td>Mantra della Purezza<\/td><td>11800<\/td><td>---<\/td><td>1<\/td><\/tr><tr><td>Nr. 841<\/td><td>???(>=2, <97,6 mil.)<\/td><td>---<\/td><td>???<\/td><\/tr><tr><td>Nr. 796<\/td><td>???<\/td><td>---<\/td><td>???<\/td><\/tr><\/table>",
    "date": 0
},

{
    "card_id": 2016,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Bitte Beachten!",
    "rule": "- Nota bene: trasferisco le carte da gioco al padrino delle carte da gioco; il padrino si assume la responsabilità che l'artista faccia la sua parte.<br>- Terrò due set di ogni carta da gioco.<br>- Il resto sarà dato via dal \"Consiglio dei 5 Maghi Saggi\". I maghi saggi hanno il diritto di interpretarlo a loro discrezione.<br>- La carta da gioco n. 796 è coniata in una quantità determinata da tutti i possessori di carte Incantatakrypto (somma 5*α*j, j=quantità di carte da gioco, α (α>1) è ragionevolmente stimata da tutti). <br>- L'ultima carta da gioco (No. 841) è impressa in una quantità determinata da tutti i possessori di carte Incantatacrypto, ponderata di conseguenza (>=2, <97.6 mio.). Mi riservo il diritto di pubblicarli o meno. Tuttavia, le schede crittografiche sono ancora distribuite da it.<br>.",
    "date": 0
},

{
    "card_id": 2017,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Symbole",
    "rule": "<img src='data\/img\/icon_info.gif'> Questa immagine è solo uno schizzo funzionante.<br><img src='data\/img\/icon_taken.gif'> Questa scheda è già stata presa.<br><img src='data\/img\/icon_crypto.gif'> Questa scheda è disponibile come crypto card. <br><br><br>Manasymbole<\/b>:<br>Bianco: <img class='mana_img' valign='middle' class='flag' src='data\/img\/mana_white.gif'><\/img><br>Blu: <img class='mana_img' valign='middle' class='flag' src='data\/img\/mana_blue.gif'><\/img><br>Rosso: <img class='mana_img' valign='middle' class='flag' src='data\/img\/mana_red.gif'><\/img><br>Verde: <img class='mana_img' valign='middle' class='flag' src='data\/img\/mana_green.gif'><\/img><br>nero: <img class='mana_img' valign='middle class='flag' src='data\/img\/mana_black.gif'><\/img><br><br><br>Supplemento: Le carte Real Incantata hanno un effetto nella realtà, come le carte cripto, ma quelle in crypto-universe.",
    "date": 0
},

{
    "card_id": 2018,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Biblioteca del Mondo",
    "rule": "Una biblioteca mondiale è composta da 841 carte da gioco. Ogni carta da gioco è presente una sola volta, ad eccezione del numero 819, quindi una delle altre carte da gioco è doppia. Per carte da gioco intendiamo sia le vere carte da gioco che le carte criptate. Una biblioteca del mondo reale è quella in cui una carta da gioco viene rimossa casualmente da questo set (supponendo che ci siano generatori casuali affidabili e le infrastrutture corrispondenti sia nella realtà che nella cripto-universo), sia in connessione con carte da gioco reali, o carte cripto. Una tale biblioteca mondiale è considerata perfetta se ogni carta da gioco è disponibile una sola volta.",
    "date": 0
},

{
    "card_id": 2019,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Kopfzeile",
    "rule": "<a href='alle.html' class='headlink'><span style='margin-left:50px' class='headelement'>&nbsp;<img  class='flag' src='data\/img\/star.gif'><\/img> Tutte le Carte&nbsp;<\/span><\/a> <a href='alle.html?filter=green' class='headlink'><span class='headelement'>&nbsp;<img  class='flag' src='data\/img\/mana_green.gif'><\/img> &nbsp;<\/span><\/a> <a href='alle.html?filter=blue' class='headlink'><span class='headelement'>&nbsp;<img  class='flag' src='data\/img\/mana_blue.gif'><\/img> &nbsp;<\/span><\/a> <a href='alle.html?filter=red' class='headlink'><span class='headelement'>&nbsp;<img  class='flag' src='data\/img\/mana_red.gif'><\/img> &nbsp;<\/span><\/a> <a href='alle.html?filter=black' class='headlink'><span class='headelement'>&nbsp;<img  class='flag' src='data\/img\/mana_black.gif'><\/img> &nbsp;<\/span><\/a> <a href='alle.html?filter=white' class='headlink'><span class='headelement'>&nbsp;<img  class='flag' src='data\/img\/mana_white.gif'><\/img> &nbsp;<\/span><\/a> <a href='alle.html?filter=none' class='headlink'><span class='headelement'><img  class='flag' src='data\/img\/farbloses_mana.gif'><\/img> incolore&nbsp;<\/span><\/a> <a href='alle.html?filter=krypto' class='headlink'><span class='headelement'>&nbsp;Crypto&nbsp;<\/span><\/a>",
    "date": 0
},

{
    "card_id": 9999,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Perché Non Continui A Camminare?",
    "rule": "Dove una testa così piccola non vede vie d'uscita, immagina immediatamente la fine.",
    "date": 0
},

{
    "card_id": 27790,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Terra Incantata",
    "rule": "<img src='data\/img\/incantata_flagge.gif'><br>27789.51.5: Universumstag<br>27789.52.1: Kosmostag<br>27790.27.4: Gründungstag<br>27.6: Glückstag<br>27790.31.4: Verwirklichungstag<br><br>Anmerkung zur Incantatalandflagge: Die Incantatalandflagge dient ganz allein der inneren Anschauung. Von öffentlicher Zurschaustellung, oder gar Flaggenfuchtelei, ist Abstand zu nehmen!",
    "date": 0
},

{
    "card_id": 27791,
    "title": "Incantato",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "Un segreto di cui tutti sperano e molti vogliono sapere che esiste; ma pochi vogliono conoscerlo e solo uno può e può conoscerlo",
    "strength": "",
    "extra": "",
    "rule_title": "DE:Incantata",
    "rule": "DE:Ein Geheimnis, von dem alle hoffen, und viele wissen wollen, daß es existiert; aber nur wenige wollen es wissen und nur eine darf und kann es wissen.",
    "date": 0
},

{}
]}
