{
	"title": "Sueños Virtuales",
	"description": "Blog de Mr Sandman en la ZeroNet. Actualidad, tutoriales, torrents,  opiniones... etc.",
	"links": "Puedes contactarme aquí\nmrsandman@zeroid.bit\n\n~desudesudesu",
	"next_post_id": 12,
	"demo": false,
	"modified": 1461658043,
	"post": [
		{
			"post_id": 11,
			"title": "Que ha pasado con Mega?",
			"date_published": 1461597979.189,
			"body": "Hace poco vimos la noticia del posible cierre de MEGA, algo a lo que apuntaba Kim Dotcom, quien de hecho hacía un llamamiento a que los usuarios hicieran copias de seguridad de sus archivos por si acaso.\n---\nEn la misma noticia os dijimos que la propia compañía había salido al paso por voz de Stephen Hall a desmentir dichas declaraciones, y estas fueron sus palabras textuales:\n\n” MEGA continúa experimentando un fuerte crecimiento que ilustra la apreciación global de la calidad de sus servicios. Liu tiene una participación accionarial en MEGA, pero no tiene una posición de dirección o control en MEGA “.\nEn resumen, que todo va bien y que las palabras de Kim Dotcom no tienen razón de ser, como dijimos en la noticia original, pero lo cierto es que de las mismas podemos sacar algo importante y hacer una conclusión interesante.\n\nPor un lado vemos que efectivamente Liu tiene acciones en MEGA pero en esas palabras vemos como se esfuerzan en hacer creer que un accionista no controla una empresa. Eso es cierto, pero es una verdad a medias, ya que los accionistas son en realidad los auténticos dueños de una empresa y tienen funciones muy importantes, entre las que destacan por ejemplo escoger a los miembros de la junta de administración y aprobar las decisiones estratégicas.\n\n¿Qué quiere decir esto? Que esas declaraciones no son apropiadas, más que nada porque hacen creer que Liu al ser accionista es casi “un florero” en MEGA, cosa que como vemos no es así.\n\nPor otro lado debemos tener claro que obviamente una empresa no va a reconocer sin más y de forma abierta que las cosas no van bien si no le queda más remedio, es decir, si no es totalmente evidente e imposible de ocultar.\n\n¿Implica esto que MEGA ha mentido? No necesariamente, de hecho la polémica con Kim Dotcom viene de largo y podría ser una simple pataleta de éste, pero definitivamente hay algo que no huele bien."
		},
		{
			"post_id": 10,
			"title": "Pronto podremos pagar con Bitcoin en Steam",
			"date_published": 1461339975.029,
			"body": "<img src=\"./img/bitcoin.jpg\" >\n\nPagar con Bitcoin en Steam será una realidad muy pronto, y eso puede cambiar muchas cosas.\n---\nSi no sabes lo que es Bitcoin, te recomiendo que te pases por aquí: \n\nhttp://127.0.0.1:43110/13QEhijknGXdBToa3M251RyjdaefidnBVi/?Post:9:Bitcoin:+Gu%C3%ADa+completa\n\nSí, es una moneda virtual que realmente no existe, no usamos billetes o monedas físicas de Bitcoin que podamos tocar, pero seamos sinceros, cuando pagamos con tarjeta de crédito tampoco tocamos el dinero.\n\n \nEl uso de Bitcoin es similar, lo verdaderamente interesante está en su estructura interna que fomenta la privacidad de los participantes en las transacciones, y en que no está controlada por ningún país o entidad bancaria. Por todo esto, Bitcoin es la moneda usada en la llamada Dark Web para comerciar con productos ilegales o perseguidos. Lamentablemente la moneda no tiene la mejor de las famas, aunque puede ser, y es usada, de manera legal.\n\n#Comprar juegos con Bitcoin será muy fácil\n\nPor eso es llamativo cuando una empresa establecida y multimillonaria decide que ya va siendo hora de aceptar pagos en Bitcoin. Así lo ha decidido Valve según un anuncio publicado para desarrolladores en la plataforma Steamworks.\n\nSteamworks es la plataforma a la que tienen que apuntarse todos los desarrolladores que quieran sacar juegos en Steam, la tienda de juegos para ordenador más grande e importante del mercado, así que este anuncio es importante y puede ayudar mucho a la expansión de Bitcoin y a las arcas de los desarrolladores.\n\nPero al mismo tiempo, Valve ha querido calmar los miedos que pudiesen tener estos creadores sobre el uso de Bitcoin, en una jugada que demuestra que Valve sigue pensándose mucho las cosas antes de dar un paso.\n\n<img src=\"./img/steam-bitcoin.jpg\" >\n\nEl anuncio, que ha sido filtrado en comunidades como la de reddit, explica en detalle cómo se añadirá la moneda virtual a las opciones de pago disponibles. Tal vez el detalle más importante es que Valve no será la que gestione los pagos en Bitcoin, y se ve que esto es importante porque la compañía luego vuelve a prometer que en ningún momento recibirá ni poseerá Bitcoins.\n\nEn vez de eso, Valve se ha aliado con un proveedor externo, una compañía especializada en Bitcoin de nombre por ahora desconocido y que se encargará de cobrarnos la cantidad establecida, convertirla a la moneda local e transferirla a Valve (que a su vez ingresará su parte al desarrollador).\n\n#Cómo podrás pagar con Bitcoin en Steam\n\nLa cantidad de Bitcoin que paguemos se generará automáticamente dependiendo del precio del juego y nuestra moneda local, por lo que no podremos aprovechar el sistema para pagar menos.\n\n<img src=\"./img/steam.jpg\" >\n\nAsí que para los desarrolladores no es necesario poner un precio en Bitcoin o cambiarlo si van a hacer una oferta, y por supuesto no tendrán que estar pendientes del valor de la moneda. Todo se hará automáticamente, y tanto para el desarrollador como para el usuario será como pagar con moneda local.\n\nEste cambio puede ser muy beneficioso para todas las partes. Para empezar, el sector entusiasta no es extraño a Bitcoin, y dar una oportunidad a estos jugadores para que gasten su dinero virtual en la plataforma nunca será una mala idea. No sólo eso, sino que este movimiento también puede ayudar a Bitcoin en general, como un ejemplo de que puedes tener un negocio importante y aceptar moneda virtual, que no es algo reservado para la “Dark Web”.\n\nEl anuncio no estableció una fecha concreta para la llegada de Bitcoin a Steam, pero no deberíamos tener que esperar mucho."
		},
		{
			"post_id": 9,
			"title": "Bitcoin: Guía completa",
			"date_published": 1461338222.702,
			"body": "#¿Qué es el Bitcoin?\n\nBitcoin (BTC o ฿) es una moneda, como lo es el dólar o el euro. Con ella puedes comprar cualquier tipo de bienes en un creciente número de comercios (online y físicos), y aunque sufre de problemas semejantes a los de las monedas comunes, también cuenta con una serie de ventajas que hacen de ella una moneda diferente: Se trata de una moneda electrónica libre y descentralizada basada en el intercambio de información mediante redes P2P.\n\n<img src=\"./img/Bitcoins.jpg\"  >\n---\nSatoshi Nakamoto allá por el 2009 fue el creador de Bitcoin, el primer software que implementa el protocolo de transferencia de Bitcoins. Desde entonces, el valor de Bitcoin no ha dejado de experimentar un impresionante crecimiento siendo este su actual valor: 1$ = 446.63 BTC (a día de hoy 22/04/2016 17:19)\n\n\n\n#¿Cómo se utiliza Bitcoin?\n\nPara utilizar Bitcoin tan solo necesitamos convertir nuestro dinero y un monedero virtual para almacenarlo:\n\nEL MONEDERO VIRTUAL\n\nUn monedero virtual no es más que una dirección en la que almacenar tus Bitcoins, se trata de una cadena de caracteres que tendremos que facilitar al comprador para que nos ingrese la cantidad de Bitcoins acordada. Un monedero de Bitcoins es algo así:\n____________________________________________\n|    1EGBfNmfNMgRJJCPt8WU8Sy1xqHkhHr9fM   |\n\n\nPara crear un monedero de Bitcoins tan solo tenemos que dirigirnos a cualquiera de los muchos servicios gratuitos que existen, como por ejemplo Blockchain (https://blockchain.info/es/wallet/) o BreadWallet (http://breadwallet.com/), y crear el monedero asociando un nombre de usuario y una contraseña. Una vez creado, podremos realizar depósitos en nuestro monedero de diversas maneras (dependiendo del servicio en sí, país de origen, moneda original, etc).\n\nPAGOS Y COBROS\n\nPara realizar un pago, entramos en nuestro monedero electrónico ingresando el usuario y la contraseña en el servicio utilizado para su creación, y buscamos en la interfaz la opción de enviar dinero. A continuación, tan solo tendremos que introducir el código del monedero destino y la cantidad que queremos transferir.\n\nPara recibir un cobro, basta con facilitar el código de nuestro monedero al comprador para que nos ingrese desde su propio monedero la cantidad acordada. Por ejemplo, el código de monedero de ejemplo que he puesto anteriormente.\n\nAhora que somos unos expertos en el uso de Bitcoins, vamos a conocer una de las peculiaridades que hacen tan interesante a la moneda virtual: La minería de Bitcoins.\n\n# minería de Bitcoins\n\nPara explicar la minería de Bitcoins antes debemos entender el funcionamiento de una moneda libre y descentralizada. Bitcoin es una moneda libre porque no está sujeta a las presiones de los mercados internacionales, y no está sujeta a estas presiones porque su creación y distribución se lleva a cabo mediante redes descentralizadas P2P.\n\nNo existe un organismo que controle la inflación e introducción de Bitcoins como ocurre con las monedas tradicionales, pero tampoco tendría sentido que esta moneda circulase sin ningún control. Por eso, la tasa de generación de esta moneda está regulada para que cada 4 años se reduzca en un 50%, hasta llegar a una tasa de circulación máxima de 21 millones (actualmente están en circulación unos 7 millones).\n\nPero ¿cómo se generan Bitcoins? Pues los Bitcoins se liberan a través de algunas webs que ofrecen pequeñas cuantías con cierta frecuencia, y mediante la minería de Bitcoins. La minería de Bitcoins es el motor que permite la circulación segura de Bitcoins en internet. Es un procedimiento mediante el cual cualquiera de nosotros puede hacer engordar nuestro monedero virtual a cambio de la potencia de procesamiento de nuestro ordenador.\n\n<img src=\"./img/btc_miners.png\"  >\n\n<img src=\"./img/btc_miners2.png\"  >\n\nPara que todo el proceso de intercambio de Bitcoins resulte seguro, se necesitan generar muchos datos relacionados con la creación de contraseñas, descifrado de las mismas, complejas operaciones matemáticas… lo cual, requiere una gran capacidad de procesamiento. La minería de Bitcoins es el proceso mediante el cual cualquiera de nosotros puede ceder parte del procesamiento de nuestro ordenador para ayudar a generar dichos bloques de datos, a cambio de una pequeña comisión en proporción al tiempo y la potencia cedidos, resulta algo parecido al SETI@home del SETI. Para ello, están a disposición de cualquiera una serie de herramientas (realmente complejas de utilizar), las cuales son utilizadas a destajo para tratar de industrializar el proceso y sacar el máximo beneficio de los recursos utilizados.\n\nSi aún dudáis de que esto pueda ser un gran negocio, os invito a ojear la publicación “Bitter to Better — How to Make Bitcoin a Better Currency”, en el cual aprendí que actualmente se tarda en torno a 6 meses en rentabilizar la inversión de una GPU cuya potencia sea utilizada exclusivamente para el proceso de minería de Bitcoins. De hecho, existen numerosas estadísticas que demuestran la eficiencia en minería de Bitcoins de determinadas configuraciones de hardware…\n\nno todo son ventajas…\n\nLos que estáis puestos en el tema seguramente ya os habréis percatado de que no he comentado nada acerca de una de las mejores opciones para generar monederos: Instawallet. El servicio que hasta hace unos días era la opción por defecto para crear monederos y gestionar nuestros Bitcoins, está “suspendido indefinidamente” desde el jueves pasado debido a un ataque DDoS. Pues bien, la compañía que está detrás de Instawallet es nada más y nada menos que Mt.Gox (la Google del Bitcoin), la cual gestiona aproximadamente el 75% de las transacciones de Bitcoins. Como era de esperar tras el ataque, muchos usuarios entraron en pánico y corrieron a deshacerse de sus Bitcoins para evitar las posibles pérdidas, lo cual ciertamente afectó al valor de la moneda virtual, aun quedando realmente lejos de frenar su crecimiento.\n\n<img src=\"./img/btc_graph.png\" alt=\"bitcoin_graphic\" >\n\nEs cierto que ahora mismo el uso de Bitcoin puede tener tanto inconvenientes como ventajas, pero confieso que no tengo ninguna duda de que algún día se hablará del Bitcoin como la tecnología predecesora de una moneda más eficiente, más universal y más justa."
		},
		{
			"post_id": 8,
			"title": "BQ vs MEDIATEK: Quien tiene la razón?",
			"date_published": 1461015541.561,
			"body": "La noticia se ha extendido como la gripe: BQ ha confirmado que el Aquaris E5 FHD, el Aquaris E6 y la Aquaris E10 no se actualizarán a Android 5.1 Lollipop, lo que ha echado por tierra la promesa que la compañía realizó de actualizar unos dispositivos que, tras esta noticia, se acaban de quedar abandonados a su suerte en Android 4.4 KitKat. Tanto el BQ Aquaris E5 FHD como el BQ Aquaris E6 formaban parte desde hace meses de la fase beta de la actualización de Lollipop y de un día para otro la actualización ha quedado cancelada. ¿Que es lo que ha pasado exactamente? \n---\nPor parte de BQ, el comunicado oficial viene a decir que la culpa es de MediaTek, que ahí os dejamos el firmware a medio-acabar por si os sirve de algo y que, por las molestias, los usuarios afectados recibirán un descuento de 50 euros… si compran alguno de los nuevos BQ Aquaris M5, Aquaris M5.5 o Aquaris M10. El descuento, señala la compañía, “no implica la entrega de tu dispositivo“.\n\nLa ira de los usuarios no se sofoca con un descuento para futuras compras, y es comprensible que ahora mismo la pregunta que esté en el aire sea: ¿Quién tiene la culpa de la actualización cancelada de Lollipop en BQ? ¿La compañía de los fucking spaniards o MediaTek, el fabricante de los procesadores que dan vida a los Aquaris afectados?\nBQ manda la pelota directamente al tejado de MediaTek, y asegura que ha llegado a un punto en el que resulta imprescindible la intervención del fabricante del SoC para solucionar errores a nivel interno del procesador (al parecer, los desarrolladores necesitan acceso a los controladores de algunas partes del hardware, cosa que el fabricante se niega a proporcionar). Dicha intervención, señala la compañía española, no es posible debido a que MediaTek ha comunicado que no tiene ninguna intención de ofrecer más soporte a esta plataforma.\n\nEl protagonista de la polémica es el MediaTek MT6592, el procesador ‘true octa-core‘ del que presumía en su día MediaTek. El que llegó con un rendimiento teóricamente superior al del Snapdragon 800 (eso decían las pruebas de rendimiento) parece que ya no está en la lista de prioridades de MediaTek, cosa que tampoco debería sorprendernos en exceso teniendo en cuenta que hablamos de un fabricante cuyos márgenes de beneficio (se encuentra en una encarnizada lucha contra Qualcomm, CNBC.com dixit) difícilmente dejarán mucho lugar al cuidado por los detalles.\n\npero... ¿cómo es posible que el Aquaris E5 HD sí tenga actualización a Lollipop, y el E5 FHD (un modelo superior (al menos sobre el papel) que en su día costaba 80 euros más) no vaya a recibir nada de nada? Por no hablar del Aquaris E6, que a día de hoy todavía se vende en las tiendas por 299 euros.\n\nResulta que el E5 HD está alimentado por un procesador MediaTek MT6582 de cuatro núcleos e, ironías de la vida, su inferioridad técnica no le ha impedido actualizarse oficialmente a esta versión de Android. El hecho de que también sea el procesador que MediaTek utilizó como tarjeta de visita para su desembarco en Android One (lo anunció orgullosa la compañía en su blog oficial), imaginamos, ha tenido algo que ver.\n\n#Mediatek se lava las manos...\n\nMediaTek es una compañía de origen asiático que acostumbra a dar vida a los procesadores de los móviles más económicos del mercado (no todo son Helio X20, ni mucho menos), y a estas alturas no debería coger por sorpresa a nadie el hecho de que el fabricante haya abandonado el soporte de un procesador… ¡presentado en 2013! ¿De verdad a nadie en BQ se le pasó por la cabeza la posibilidad de que se diera esta situación?\n\nBQ ha intentado hacernos sentir cierta empatía por su enfado afirmando en su comunicado que “para los nuevos smartphones BQ apostaremos por Qualcomm, que nos permitirá ofrecer actualizaciones a la altura de lo que nuestros usuarios esperan y de lo que nosotros deseamos“, haciendo referencia a la actualización de Lollipop del BQ Aquaris E5 4G, el cual cabe reconocer que con su procesador Snapdragon 410 acabó por actualizarse a Android 5.1.1 Lollipop.\n\n#Lo que se viene a decir en el comunicado es que BQ rompe su relación con MediaTek, y a partir de ahora confiará tan solamente en Qualcomm para sus futuros modelos. Bien, pero… ¿exactamente, en qué medida soluciona esta decisión el problema de los usuarios afectados?\n\nY de por medio están los afectados\n\nMás allá de la disputa digna de una pareja comida por los celos que están protagonizando ambas compañías, la realidad es que BQ acaba de dejar tirados a todos los usuarios que confiaron en la actualización de Lollipop. Y no lo decimos nosotros, sino que lo demuestra este tweet publicado por la propia compañía en su cuenta oficial de @bqreaders:\n\n\"Todos los #AquarisE y la tablet Edison 3 se actualizarán a #Android #Lollipop #derechoalatecnologia\"\n\n\n'#derechoalatecnologia' , rezaba de forma premonitoria el hashtag que acompañaba al mensaje publicado allá por el mes de noviembre de 2014 (recordemos que los terminales ahora afectados fueron presentados en mayo del mismo año). La compañía no solamente ha decepcionado a los usuarios, sino también a los medios que nos hicimos eco de sus promesas. Así no, BQ, así no.\n\nIndependientemente de si la culpa es de una u otra empresa, lo que está claro es que la red está ahora mismo ardiendo en quejas, críticas y amenazas de denuncias tras el comunicado oficial. De momento, en Change.org ya hay varias recogidas de firmas abiertas (esta y esta, por ejemplo, la segunda con casi 500 firmas en el momento de la redacción de estas palabras), y está por ver cómo prospera legalmente hablando el descontento que los usuarios están plasmando con sus firmas.\n\n#MediaTek, ¿qué tiene que decir al respecto?\n\nPor otra parte, de los dos protagonistas (BQ por un lado, MediaTek por el otro) de momento solamente ha hablado uno. Desde ElAndroideLibre nos hemos puesto en contacto con el departamento de desarrollo de MediaTek, y tenemos la esperanza de que tarde o temprano algún responsable nos haga llegar una respuesta oficial al respecto. \n\n---------------------------------------------------\n\nPersonalmente me he visto parcialmente afectado por el tema, ya que disponía de un terminal FHD pero hace unas pocas semanas se me rompió la pantalla de forma desastrosa y, entre otras cosas, como veía que el soporte no era el adecuado (repito, junto a otros factores) decidí cambiarme de terminal. Suerte que lo hice a tiempo porque si no habría llenado el foro de BQ más de lo que solía hacerlo... \n"
		},
		{
			"post_id": 7,
			"title": "Nueva normativa europea de protección de datos",
			"date_published": 1460748226.843,
			"body": "La UE ha creado una nueva normativa de protección de datos que afectará a todas las empresas que operen dentro de los estados miembros. Estos son los 6 puntos más importantes:\n---\n•\tel derecho al “olvido”, mediante la rectificación o supresión de datos personales,\n•\tla necesidad de “consentimiento claro y afirmativo” de la persona concernida al tratamiento de sus datos personales,\n•\tla “portabilidad”, o el derecho a trasladar los datos a otro proveedor de servicios,\n•\tel derecho a ser informado si los datos personales han sido pirateados,\n•\tlenguaje claro y comprensible sobre las cláusulas de privacidad\n•\tmultas de hasta el 4% de la facturación global de las empresas en caso de infracción.\nEsta nueva regulación entrará en vigor 20 días después de su publicación en el Boletín Oficial de la UE, a partir de ese momento los países miembros tendrán dos años para adaptar sus leyes nacionales. Las excepciones a esto serán el Reino Unido e Irlanda -que tienen un status especial y esta directiva se aplicará sólo en parte-, y Dinamarca, que tendrá seis meses para decidir si la aplica.\nDerecho al olvido\nCon la nueva normativa europea de protección de datos cualquier persona tiene el derecho a ser olvidado y quetoda su información personal sea eliminada si el individuo no quiere que sea accesible, siempre que no existan razones legítimas para mantenerla publica.\nCualquier compañía que reciba una petición debe también enviar esta petición a todo aquel que replique la información. Sin embargo, habrá excepciones si esta información es necesaria por razones históricas, científicas, estadísticas o por la salud pública, así como para ejercer la libertad de expresión. Además, tampoco se aplicará cuando la retención de información sea necesaria para cumplir con un contrato legal.\n\nConsentimiento claro y afirmativo\nA partir de ahora será necesario dar un consentimiento claro, afirmativo y activo para que las empresas puedan usar nuestros datos privados, por ejemplo al pulsar sobre una casilla en una web, pero ya no valdrá que las empresas nos hagan pulsar para evitar que hagan uso de ellos.\nEl silencio, inactividad y las casillas pre-tickadas ya no constituirán permiso. Además, con la nueva normativa las compañías deberán hacer que revocar el permiso de uso de los datos personales sea tan fácil como darlo. Además, antes de recolectar los datos se deberá informar con un lenguaje claro y sencillo y eliminando la letra pequeña.\n\nPortabilidad\nAdemás, la nueva normativa obligará a facilitar el traspaso de datos personales de un servicio a otro. Por ejemplo, a partir de ahora deberá ser posible cambiar de proveedor de correo electrónico sin que por el camino perdamos ni correos ni contactos. Esto no sólo busca dar al ciudadano un mayor control sobre su información, sino también estimular la competición del mercado digital.\nSaber si tus datos han sido robados\nLa seguridad de los datos es uno de los elementos que más preocupan al gran público, ahora que vivimos en una época de hackeos y filtraciones. La nueva normativa europea de protección de datos obliga a las compañías a informar a las autoridades competentes lo más rápido posible de cualquier problema de seguridad, de forma que los usuarios puedan tomar las medidas necesarias para minimizar los daños.\n\nLimitaciones al ‘profiling’\nActualmente, uno de los principales usos de los datos personales es el profiling, una técnica que se usa para analizar y predecir el comportamiento, rendimiento, o preferencias comparando su perfil con el de usuarios similares. La nueva Ley aplicará limitaciones en este aspecto.\nA partir de ahora el profiling sólo estará permitido con el consentimiento de la persona a la que concierne. Además, no podrá llevar a ningún tipo de discriminación basada en datos sensibles, como el origen étnico, opiniones políticas o religión, como tampoco por sanciones administrativas o problemas judiciales anteriores. Tampoco se permitirá que el profiling sea un proceso totalmente automatizado y deberá incluir supervisión humana.\n\nProtección para los menores\nLa Ley añade protección especial para los menores en determinadas áreas, ya que pueden ser menos conscientes de los riesgos y consecuencias que pueda tener la revelación de información personal. Un ejemplo de este tratamiento es que tienen un derecho más definido y menos limitado a ser olvidados, y necesitaránpermiso paternal para abrir cuentas de redes sociales.\nEstá en manos de cada estado la edad concreta a la que podrán abrirla sin permiso, pero deberá situarse entre los 13 y 16 años. Esto no evitará que los menores puedan usar Internet para buscar información. Es más, la nueva normativa especifica que los niños por debajo de 13 años no necesitarán permiso paterno para acceder a los servicios preventivos y de consejo que se ofrecen directamente a los menores.\n\nUna norma que se aplica a quienes quieran actuar dentro de la UE\nDe esta forma, la Ley unificará bajo un único criterio las 28 leyes que actualmente existen al respecto, algo que facilitará la adaptación de las empresas a la actividad dentro de la zona. Además, también facilitará el intercambio de información entre los cuerpos de seguridad de los países miembros en investigaciones criminales. Las medidas se aplicarán de la misma forma a todo el mundo, ya sea víctima, criminal o testigo.\n\nEsta nueva normativa europea de protección de datos se aplica a toda compañía que se quiera dirigir a los consumidores de la Unión, independientemente que esta opera desde fuera. Las empresas que manejen gran cantidad de información personal deberán tener un responsable de protección de datos.\nLas empresas que no cumplan con la ley podrán ser sancionadas con multas que pueden llegar hasta el 4% de la facturación mundial de la firma.\n"
		},
		{
			"post_id": 6,
			"title": "Descargar torrents en castellano? zerosite en proceso.",
			"date_published": 1460710287.685,
			"body": "Después de indagar bastanté en la zeronet he visto que lo que más pide la comunidad hispanohablante son sitios de descargas de torrents en español. pues bien, he descubierto por casualidad este sitio en el cual un aficionado está trasladando poco a poco su web de torrents en castellano a la zeronet. \nSeguidle de cerca y pronto tendremos lo que buscamos :)\n\nhttp://127.0.0.1:43110/1GK6eBSX6Ccsm7k1uKU3puvKwHj6fp5Dnk"
		},
		{
			"post_id": 1,
			"title": "Presentación",
			"date_published": 1460674579,
			"body": "Buenas noches, soy Mr Sandman y hace unas horas he descubierto este apasionante sitio llamado Zero Net. Siempre me ha apasionado el mundo de la red y el anonimato, así que no podía esperar menos de mi mismo y he decidido crear un blog dónde expresarme, enseñar y ayudar desde el anonimato. \nEste es el blog de Mr Sandman, espero que lo disfrutéis!"
		}
	]
}