{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1519293678,
			"title": "IPFS vs ZeroNet",
			"body": "What is the difference between these two systems. Why use one over the other? If I understand it correctly, IPFS is mainly to be used for files whereas ZeroNet's focus seems to be websites. Is this correct? Or am I missing something?",
			"added": 1519293677
		},
		{
			"topic_id": 1533632541,
			"title": "Alex Jones Banned from Social Media and YouTube.",
			"body": "Who is co-ordinating this?",
			"added": 1533632539
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1519037513_1Q8fHVZgauAAHhkQNxKX68eB5HfP1iTFqZ": [
			{
				"comment_id": 1,
				"body": "At what age do you think a child has the ability to understand the gravity of a sexual relationship? At the very least, at what age do you think that they are able to make the decision to enter into a sexual relationship with someone?",
				"added": 1519038233
			},
			{
				"comment_id": 2,
				"body": "> [noneboy](#comment_1_1Q8fHVZgauAAHhkQNxKX68eB5HfP1iTFqZ): I determine it by the age at which they begin to be interested in sexuality, we do not talk about penetrations but to teach them practically what they are when they show interest in sex\n\nI'm confused as to what that may look like in practice. What do you need to teach them practically?",
				"added": 1519038468
			},
			{
				"comment_id": 3,
				"body": "> [noneboy](#comment_3_1Q8fHVZgauAAHhkQNxKX68eB5HfP1iTFqZ): Well, sexuality itself is not confusing, if a girl or a boy shows an interest in sexuality, it would be very convenient to teach him what sex is and if he still wants to learn more, he would go on to practice within the limits of the process. .\n\nAt what point in the child's development phase does this usually happen in your experience?",
				"added": 1519038807
			}
		],
		"1519293678_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_36_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): IPFS is only a transport for transferring static data. ZeroNet is a platform with dynamic applications and its own transport. Compare IPFS and ZeroNet - about the same as comparing the Intel processor and mobile phone :) [...]\n\nOkay cool, thanks for the clarification.",
				"added": 1519310117
			}
		]
	},
	"comment_vote": {
		"1_17GRft8EiGc8hMAqzFAoj9chBpSkFA8g82": 1,
		"2_1Q8fHVZgauAAHhkQNxKX68eB5HfP1iTFqZ": 1,
		"3_1KkhiEGYWv22hZJKdyRbHxGypQGJkV7Rdi": 1
	}
}