{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Do you by any chance know where one can find a list of hubs?",
			"post_id": 25,
			"date_added": 1492477223
		},
		{
			"comment_id": 2,
			"body": "> [thecuriousnerd](#comment_1_16esmH5mTmsJL4S5DW4dup5883xJh6GdDS): Do you by any chance know where one can find a list of hubs?\n\nJust realized that there is one in Kaffiene Search lol",
			"post_id": 25,
			"date_added": 1492665980
		},
		{
			"comment_id": 3,
			"body": "Always good to have another person helping to push you towards your goals, though in my case with my boyfriend he is way more knowledgeable about coding then I am so I really have no excuses when I get stuck lol.",
			"post_id": 35,
			"date_added": 1493061191
		},
		{
			"comment_id": 4,
			"body": "Holy crap, I never thought I would see someone with such similar world views. I was starting to wonder if I would ever encounter someone with this mindset. Have you seen any of Ghost in the Shell? I ultimately believe people can overcome the universe, as well as have it be a good thing. \n\nAlthough in my mind in order to accomplish this you need to create a bridge (for the masses) in order to get to it. This could be via decentralized systems that are easy for the masses to use along with furthering biology, specifically longevity research or biogerontology. \n\nHowever I think getting there will be difficult if we are unable to share information easily and collaborate. Accessibility is the main factor in this.",
			"post_id": 47,
			"date_added": 1521633489
		},
		{
			"comment_id": 5,
			"body": "> [cuda](#comment_1_18Tac6A6tQLGhLRXbP7FafhV7NRbxaboVe): Earth is too small for all people to live.Some people must die for other to live better .\n\nI don't think that is correct, we could support far more simply by avoiding waste, and changing infrastructure. The issue is that the benefits of helping others in this way are not obvious to the public. For example if there are more people who are living well, they could do science and more research to solve more problems.\n\nThen you could have even more people thanks to the advances you would get.\nI recommend this video:  \nA Selfish Argument for Making the World a Better Place – Egoistic Altruism https://www.youtube.com/watch?v=rvskMHn0sqQ\n\n\n> [matso](#comment_2_1H3f2Q8pxbSVy9MuifHryzGQ9i4mmSuRsd): Given more thought on it: Right to privacy is a basic human right.\n\nOne thing to consider is can you truly keep anything secret? Encryption can get dated and broken. Even if you destroy the data, there are hypothetical ways it could be retrieved. In my mind information tries to escape and spread kinda like entropy. So privacy can only be a temporary thing at least from my perspective at the moment.",
			"post_id": 47,
			"date_added": 1528098570
		},
		{
			"comment_id": 6,
			"body": "> [matso](#comment_3_1H3f2Q8pxbSVy9MuifHryzGQ9i4mmSuRsd): Everything is temporary. Universe is temporary, but that doesn't mean it should disappear now. \n> I can keep as much secrets as I need to. Privacy starts from ones own behaviour. I can choose to write and publish this text or not to write it and just keep my thoughts in my head. Then there is digital privacy where I can choose whether I keep this text only locally on my computer or publish it to the internet. Then there is privacy on the internet, where I should be able to choose to which group I want to share certain information with.\n> Money is just one example where privacy is necessary. Let's assume I have a bitcoin wallet with 10 bitcoins in it; I wouldn't want anyone else to know how to access that wallet.\n\nWe don't fully know if the universe is temporary to be fair, it really depends on which school of thought in the quantum physics world wins out. Privacy can only truly be attempted with quantum information networks. That way you can detect tampering of data via quantum effects. Everything will have to be upgraded, especially Bitcoin once optical based computing becomes reality, or quantum enhanced internet via the fiber optic lines.(Requires specialty equipment)\n\nHowever sharing of data can lead to major benefit, especially in terms of medical diagnosis. What if an open source ai that was neutral went through your data? I feel something like that would be not intrusive especially if it kept all data anonymized.",
			"post_id": 47,
			"date_added": 1533028906
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"35": 1,
		"37": 1
	}
}