{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1548671064,
			"title": "\"Forbidden, you can only modify your own files\" when modifying my ZeroTalk post",
			"body": "Please what are Your ideas to fix this issue?\nAlso other dynamic sites stopped working - KopyKate video site database size is too small from real site and do not show any videos. ZeroTalk stopped adding new topics and when i click to rebuild, reload its database, it got reseted from 30M around to 17KB.\nI can not edit my ZeroMe post (it does nothing), other site does not accept my submission saying \"you can only modify your own files\".\nI tried to restore user.json and delete (rebuild) content.db 2 times, but no luck. Tried to restore older backups of my users.json. Rebuilding particular site db also not help and recheck, update also not help. latest rev3827 @nofish\nUPDATE: i think what fdixed this was to backup zeronet files (except /backup directory) and use new updated files from zeronet.io or from github) and then rename content.db file and run zeronet (i ran on different operating system) and Zn should rebuild the database, it can take some time and it worked then)",
			"added": 1548671063
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1546269157_1FnQQkQ4AwjwBhbz61RmqPazDrvdBGy79K": [
			{
				"comment_id": 1,
				"body": "@whitemask what is your Zeronet revision(version)? See it and other things at [/Stats](/Stats) - see the \"Trackers\" and \"Shared trackers\" section... paste here maybe",
				"added": 1546278174
			}
		],
		"1548671064_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK": [
			{
				"comment_id": 2,
				"body": "anyone see this? if yes, please upvote this",
				"added": 1548753694
			},
			{
				"comment_id": 3,
				"body": "> [nofish](#comment_1251_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Have you tried to change the user to something else (eg. using the sidebar identity section), then change it back?\n\nyes, i just tried to switch to two different identities and to no identity and back to my zeroid identity, but that not helped to be able to post content (File write error: Forbidden, you can only modify your own files). When i switch identities on another site it always report i can modify only my files (after switching to the identity). you can also refer to this similar issue: https://github.com/HelloZeroNet/ZeroNet/issues/1782 Thank you",
				"added": 1548757221
			},
			{
				"comment_id": 4,
				"body": "> [nofish](#comment_1253_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Do you have any error after the switches in log/debug.log?\n\nI was looking into that log file around the time of switching identities and found no interesting log line, except the switch itself:\nERROR    Site:1TaLkF..jipT FileWrite forbidden mypublicidkey not in valid_signers [u'1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT']\nERROR    Site:1TaLkF..jipT data/users/someidentitypublickey/data.json fileGet error: [Errno 2] No such file or directory: u'/media/drivename/ZeroNet/data/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/someidentitypublickey/data.json'\nNote that the zerotalk database does not properly rebuild as mentioned. it shows only 1 topic (not mine) now:\nINFO     Site:1TaLkF..jipT Imported 10 data file in 0.342653036118s",
				"added": 1548758424
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": []
	},
	"comment_vote": {}
}