{
	"title": "Squirz's Blog",
	"description": "Just thoughts \n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1521403480,
	"post": [
		{
			"post_id": 10,
			"title": "Third Record of Darkness\n",
			"date_published": 1521398377,
			"body": "Dark Persona is not something you can run away from, it is part of you and your life. What is important is who gets control over whom.\n\nFirst, let's establish that dark persona is not opposite of you and your hidden personality combined with your mask is what I call Personality Core. It is also important to understand that neither you or hidden you, are good or evil. We should not label humans as good or evil, as all of us has aspects of both. It should be clear that Dark Persona is not your evil side and should not be viewed as it. I am going to label your everyday persona as \"positive\" and your dark persona as \"negative\" as it's much better labels then good and evil.\n\nSociety expects us to act in a certain ways. Be polite, respect your elders, smile, contribute something, etc. From the young days we where thought to act in such ways that others would like us, however like I said before another aspect of you starts forming when you are learning how to behave in this world. There many theories how personality develops, little they do explore negative aspects in a depth. That is why I find Jung's shadow theory quite fascinating. Still, I am not exploring \"his\" theory, what I am doing is exploring deep and hidden aspects of complete personality. One of the reasons why negative personality is not heavily discussed is due to the fact that people don't usually want to talk about this stuff. We understand that it is part of us, but we want that side to be somewhere in unreachable location.\n\nNegative is that of calculating chaos. It is like a wild fire, burning with infinite energy, sometimes so big that fire burns the positive. Chaotic and calculating. That burning fire which seems to be infinite and chaotic is what your dark persona is. Nothing less and nothing more. In my last record I used Nietzsche's quote about hero fighting monsters and becoming hero. The biggest monster which you are fighting is you yourself. The negative energy which can consume your positive and burn the house you had build. Eternal struggle between positive and negative is what drives humanity and your soul into deeper meaning.\n\nThe two biggest mistakes of controlling negative is how we are suppressing our other side. First, is when we are giving hard suppression over our Dark Persona. It always backfires and it is not pretty when this happens. Other mistake we usually make is that we are giving soft suppression over our Dark Persona and it is all over the place. The question remains how should I suppress the negative so it won't backfire at me? This where it gets difficult, as it is virtually impossible to have complete control over your negative. The best example of people who are at the highest level of such mastery are: businessman, sportsman, politicians and other successful people. They usually can convert negative into positive results. There are two things I would like to suggest. First, listen to yourself, listen to your soul. It is very important what your soul is saying to you as it has knowledge of your conscious and subconscious minds Second, is that you should not fear exploring your dark self, just need to be cautious as it is being of it's own despite being part of you"
		},
		{
			"post_id": 7,
			"title": "Second Record\n",
			"date_published": 1510658691.924,
			"body": "We have ended up last record with unleash of the beast.\n\n![E226-Beast_of_Darkness-Manga.png (300x460)](data/img/post_7_E226-Beast_of_Darkness-Manga.png)\n\nThis is a picture from Bersek Manga, what you see is called \"Beast of darkness.\"\n\nNow let's go back to the main topic of what happens when beast is unleashed. In most cases it is not pretty thing as the \"animal\" inside you is being unleashed. It usually harms persons relationships with those who he or she cares about.\n\nThe beast in usually unleashed at very crucial moment. There are many reasons why the beast got from inside to outside, most popular ones are:\n\n1) Enormous emotional stress\n\n2) Alcohol - this generally goes toe to toe with the number one spot.\n\n3) Conflicts in relationships.\n\nI have mentioned only 3 reasons why the beast in unleashed. I tend to believe that those 3 reasons are most common. Commonly it is combination of two or one reason causing another. I am not going to discuss details. Mainly due to complexity of person.\n\nThe persons personality is quite hard topic, even people that know person for years, they can't fully comprehend his or her personality. What would be the reason you may ask? In order to answer your question, please describe your best friend all of his or her positive and negative traits. Now as we talk about your best friend, you have quite good picture of this person. The task is quite easy for you to handle and your results would be quite high. Yet, if I would ask you to describe some stranger waiting for a bus it becomes almost impossible task to get the same score you did with a best friend. Sure, you could predict one or two traits of this stranger. If I would ask you why you described your best friend almost perfectly while you made so many mistakes describing stranger, you would most likely would answer that you don't know the person. It is a good answer and answer how we are describing people we know. That is by using our memories about the person. Reader presumably has many memories that includes his best friend, but only one memory of a stranger. That is how he saw him at the bus station.\n\nNow, let us explore the unleashed beast. There are two scenarios one is not pretty another is ugly one. First one happens when the beast is unleashed in front of a persons you reader know and quite hell. It could be anyone from your family to your close friends. This can end up really bad, especially if alcohol or drugs are involved here. Shouting, smashing, using lot's of swear words. This is what I call burst of the hidden emotions. It is like you use electric tea-kettle in order to boil the water. It commonly ends up with a conflict or temporary \"broken relationship.\" Nothing to bad as it would seem. However, if a person in question had enormous emotional stress and is effected by alcohol - emotional outburst could end up you in jail or mental hospital.\n\nSecond one happens in those cases when it is unleashed in front of strangers or people you hardly know. Oh yes, if you tried to made good impression about yourself, you just failed. First impression is really important and if the beast is unleashed it usually creates negative association with your personality. Others could perceive you as angry or hardly controlling emotions.\n\nBefore I end this record, I would like to mentions few things. Exploration about dark thoughts is still not finished there would be 3rd part. Also, I want to mention that keeping some aspects about ourselves hidden is not always a bad thing as the beast could be used in positive ways. About that and more, I will explore more in the upcoming records.\n\nI will end up with this. \"Whoever fights monsters should see to it that in the process he does not become a monster. And if you gaze long enough into an abyss, the abyss will gaze back into you.\" Friedrich Nietzsche"
		},
		{
			"post_id": 5,
			"title": "First Record",
			"date_published": 1510560185.953,
			"body": "Human mind is one of most complicated things than we could encounter. It is so complicated that not even today we could really comprehend the complexity that it is our own mind. Still, this first record is not exactly about how human mind works, I just mentioned this because I am going to explore the dark thoughts of human mind. Perhaps this exploration would end with this record, perhaps it won't.\n\n* * *\n\nLet us talk about demons. Many of us heard about demons despite our religious believes, some of us believes they are real entities while others believe it is a fairy tail.  What about me than?  This is quite complicated, because I am not going to talk about supernatural entities that are causing harm to humans.  I am here to talk about most dangerous type of demon that is real and how that demon is born.\n\nWhen was the first time you have ever felt fear or heard horror story? That most likely happened in your earlier childhood.  Ever since we where children, we where expected to act in certain way.  Smile,  be polite to other people,  follow the law,  help others in need, etc..  In order for those expectations to become truth we create persona little by little.  Persona is how we preserve ourselves to other people.  This creates a big hole that I would mention  later.  Let's explore one of the most dangerous lies that human could tell to others.  You probably heard question \"how do you feel?\" and that most common answer is good or normal.  I am not trying to say that this is a lie,  but humans tend to say this, even if they are not feeling good or had few bad days in a row.  Why this dangerous lie you may ask.  It becomes dangerous when lie becomes truth to that person.  Aka feeling bad or not well becomes normal.  We usually create this lie mainly because we don't want others to carry our weights.   Imagine a married man that has loving wife and perhaps few children.  He is hard working man that tries to provide his family with everything they need for.  However, he has a little secret.  That secret is that he is having romance with another woman.  He starts returning home later, as his wife asks him why he returned home later usually reply is work or that he drink few bears at local bar.   Of course it is hard to determine  what is actually going on that man's mind when he is telling a lie.  However, as the lie becomes norm to him, he slips away and wife finds out that he is cheating on her with another women.  So let's back to persona and about hole it creates. While it is good that others are thinking of us in good colors,  we are not exactly what others see in us.  It is actually the same lie  that I told you about,  but this time it is even more advanced one.  It is easy to say I feel good when I actually don't.  It is much harder to present ourselves in a good matter (it usually takes years).  With a first steps of creation of persona, another entity is born inside you.  This is the demon we are talking about, your own dark persona.  The things you are trying to hide from others, your own weaknesses  that you don't want others to see.  Everyday you feed that demon without even knowing that a beast is growing inside you and you are feeding that beast.  Than one day that beast unleashes himself like an animal.  This is where I end my first record, second one would be about unleashed beast."
		}
	]
}