{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Registro dei presenti",
			"body": "Questo dovrebbe essere il registro degli utenti presenti di Zeronet in Italiano. Basta il proprio nick name seguito da presente come si faceva alle elementari. Comincio io.",
			"added": 1493252297
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": [
			{
				"comment_id": 1,
				"body": "Mancherebbero i messaggi su questo forum.",
				"added": 1475355983
			},
			{
				"comment_id": 3,
				"body": "Ho riaperto zeronet dopo un paio di settimane che non lo usavo, ho visto che ci sono delle novita ma questo forum è ancora poco visitato.\n\nVoi ogni quanto tempo usate zeronet?",
				"added": 1476219285
			}
		],
		"1_13LC7WbJiKcpqPPxR9438yiTReLSgkj5s6": [
			{
				"comment_id": 2,
				"body": "Io non mi sono trovato bene con il Multiuser che funziona in modo sostanzialmente differente da quanto chiesto dall'OP.\n\nIo ho fatto così per cambiare identità: Sono andato sul file user.json dentro zeronet/data e ho cambiato le prime righe del file:\n\n\"certs\": {\n      \"zeroid.bit\": {\n        \"auth_address\": \"1xx\", \n        \"auth_privatekey\": \"5xx\", \n        \"auth_type\": \"web\", \n        \"auth_user_name\": \"kensan\", \n        \"cert_sign\": \"xx\"\n      }\n    }, \nCambiando queste righe si cambia identità sui vari siti eccetto che sul sito zeroid.bit che ci riconosce tramite altri codici. Importante: salvare il file user.json originale e le altre identità create.",
				"added": 1475356585
			}
		],
		"2_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": [
			{
				"comment_id": 4,
				"body": "Diciamo che sopravvive.",
				"added": 1493251919
			},
			{
				"comment_id": 12,
				"body": "Sono il primo del nuovo anno?",
				"added": 1552176506
			}
		],
		"1_1EidJhfDKh2xojwKUdjGRTpQ7osWjt66G2": [
			{
				"comment_id": 5,
				"body": "Io non l'ho fatto ma la chiesa cattolica vive di miliardi con l'8 per mille con la scusa che ci sono moltissimi cristiani in Italia ovvero i battezzati registrati nelle sue canoniche. Quindi ha senso sbattezzarsi.",
				"added": 1493252051
			},
			{
				"comment_id": 7,
				"body": "> [livorno1](#comment_7_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF): Sono perplesso.Aiutatemi a chiarirmi.\n> Dunque, se io chiedo lo \"Sbattezzo\" che non è altro che la cancellazione dai registri della chiesa cattolica, implicitamente do un valore al battesimo, valore che, in quanto ateo, rifiuto.\n> Pero' sono tentato di farlo...\n\nEsplicitamente dai un valore economico al battesimo in quanto ogni battezzato è un adepto della chiesa cattolica il quale permette alla chiesa stessa di richiedere l'8permille, esenzioni IMU e varie agevolazioni economiche.\n\nSe non ci fosse alcun battezzato allora la chiesa cattolica non avrebbe alcun potere in Italia, potere sia economico che potere in senso politico.",
				"added": 1496931926
			}
		],
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 6,
				"body": "kensan presente.",
				"added": 1493252321
			}
		],
		"1_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF": [
			{
				"comment_id": 9,
				"body": "Mageia versione 5. Adesso sta uscendo la 6 ma mi funziona ancora male.\nEdit: adesso sono riuscito a farla funzionare piuttosto bene e sono passato quiandi a mageia 6, consigliata!",
				"added": 1497105137
			}
		],
		"1_17438DhdJ7LHQgQBVTfHmajp8dZXLH2Tiw": [
			{
				"comment_id": 10,
				"body": "Non so che potenzialità abbia ma noto che ogni tanto ci faccio un salto, quindi vale qualche cosa.",
				"added": 1497105437
			}
		],
		"2_1Emd1xB5rK1t7EYRUaYZbA4KNRFQrWhcMF": [
			{
				"comment_id": 11,
				"body": "Molto carina, non avevo mai usato una BBS però è molto limitata.",
				"added": 1497107226
			}
		]
	},
	"comment_vote": {}
}