{
	"posts": [
		{
			"id": "8df8de69-7c1c-4029-ad56-91274105edcf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e69f3155-7702-451b-b642-1977fed560f0",
			"body": "I dropped it after helping a scientist in armour to get out. Too much backtrack and missions just stack one over another.",
			"time": 1568624190624,
			"files": "[]",
			"last_edited": 1568624197024,
			"subject": null,
			"capcode": null
		},
		{
			"id": "6f63c7a6-a7a5-4f5c-852a-773bacaf400d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f33de9f6-1f04-4782-93ca-07421b145b28",
			"body": ">>b52c830c-0291-43fb-9c9f-96605cf638cb\n>just for practice\nYou're already attached to her by pondering about dating her, just stop before you do something ridiculous, like having a mutt family",
			"time": 1568672753355,
			"files": "[]"
		},
		{
			"id": "2ff88c86-3bc0-4b05-8025-2e5611a3bb7d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Saudi Arabia's oil plant bombing thread.",
			"body": "Because there's no /sg/ around here I may as well make a thread about this\n\n==World’s biggest oil plant suffers drone attack at Saudi Arabia==\n'''Saudi Arabia suffered an attack on its biggest oil plant, escalating already high tension in the Gulf and raised concern over global oil supplies.'''\n\n>Iran backed militants have claimed responsibility for a drone attack on the world’s biggest oil plant that could cut the world’s supply in half.\n>Immense fires were seen engulfing two major Saudi Arabian oil plants, one in Abqaiq, Bugayg, and its second largest oilfield in Khurais, about 4am on Saturday, reports The Sun.\n>The Khurais oilfield produces around one per cent of the world’s oil and Abqaiq is the largest facility and can produce seven per cent of the global supply.\n>A staggering 5 million barrels per day of crude production was destroyed, according to sources.\n>This amounts to at least half of the kingdom’s 9.65 million daily output which is shipped around the world.\n>The fires began after the sites were “targeted by drones,” the Interior Ministry said in a statement carried by the state-run Saudi Press Agency.\n>It said an investigation was under way.\n\n>'''THE US BLAMES IRAN'''\n>The US said Iran was behind the attack.\n>US Secretary of State Mike Pompeo blamed Tehran for the attack calling it an “unprecedented attack on the world’s energy supply” and refuted a claim of responsibility from the Iran-linked Houthi rebels in Yemen.\n>“Tehran is behind nearly 100 attacks on Saudi Arabia while [Iran’s president] Rouhani and [Iran’s foreign minister] Zarif pretend to engage in diplomacy,” Mr Pompeo said in a tweet. “Amid all the calls for de-escalation, Iran has now launched an unprecedented attack on the world’s energy supply. There is no evidence the attacks came from Yemen.”\n>Earlier on Saturday the Houthi rebels said they launched a 10-drone attack, which would be among the rebel group’s most significant attacks on the Saudi kingdom.\n>According to Saudi state television, Saturday’s attack did not disrupt the kingdom’s oil exports.\n\n>However, the Wall Street Journal and US broadcaster CNN, citing unnamed sources, said the kingdom has reduced oil production by five million barrels a day, nearly half of the country’s entire oil output.\n>The attack caused fires at two facilities operated by Saudi state oil giant Aramco in the eastern province of Buqyaq, according to a spokesman for the Saudi Interior Ministry.\n>The fires were later brought under control, according to the Saudi official. A military spokesman for the rebels said the attack was a “legal response” to an ongoing Saudi-led military campaign them.\n\n>“We promise the Saudi regime that our next operations will expand and be more painful,” the rebel spokesman added, according to pro-Houthi television al- Masirah.\n>“The Saudi regime has no solution except halting aggression [in Yemen],” said the Houthi official.\n>Saudi private television Al Arabiya meanwhile reported that the attack caused no casualties.\n>US President Donald Trump spoke with Saudi Crown Prince Mohammad Bin Salman and offered his “support for Saudi Arabia’s self-defence,” a statement from White House Deputy Press Secretary Judd Deere said.\n>“The United States Government is monitoring the situation and remains committed to ensuring global oil markets are stable and well supplied,” Ms Deere said.\n>Martin Griffiths, the UN envoy for Yemen, condemned the attack as “extremely worrying”.\n>He called on all parties to exercise restraint and to prevent further incidents, “which pose a serious threat to regional security, complicate the already fragile situation and jeopardise UN-led political process.” In recent months, the Houthis have stepped up their missile and drone attacks into neighbouring Saudi Arabia.\nhttps://archive.is/j6TFM\ncont.",
			"time": 1568673217424,
			"files": "[{\"name\":\"lol.mp4\",\"thumb\":\"daf36bfdfc11537d42523a695d1c6aae395c3350-thumb.jpg\",\"size\":3477243,\"type\":\"video/mp4\",\"original\":\"daf36bfdfc11537d42523a695d1c6aae395c3350.mp4\",\"directory\":\"182q377SKkGkPF9UuEUH6NVzZvb3MrU6F8\"}]",
			"last_edited": 1568673355924,
			"capcode": null
		},
		{
			"id": "9044714e-267e-4f2b-b022-7c6fb41258d6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2ff88c86-3bc0-4b05-8025-2e5611a3bb7d",
			"body": ">'''WHAT THE ATTACK MEANS FOR WORLD OIL'''\n>The US Energy Department says the US “stands ready to deploy resources from the Strategic Petroleum Oil Reserves if necessary to offset any disruptions to oil markets”.\n>In a statement on Saturday night, the department said Energy Secretary Rick Perry has also directed department leadership to work with the International Energy Agency on potential available options for collective global action if needed.\n>Nations of the 30-member IEA seek to respond to disruptions in the oil supply and advocate for energy policy.\n>The US strategic oil reserves holds 630 million barrels.\n>Saudi Arabia’s energy minister has confirmed the attacks knocked out about 50 per cent of the country’s production and said it will make up for some of the loss with oil stocks.\n>In a statement released by the Saudi Press Agency, Prince Abdulaziz bin Salman bin Abdulaziz says that according to preliminary estimates, 5.7 million barrels a day of oil production were lost, and the supply of ethane and natural gas also was cut by about half.\n>He says Aramco will provide updated information within 48 hours of restoring full production.\n>Prince Abdulaziz says the attacks were aimed not only at Saudi Arabia, but also at the world’s oil supply and its security.\n\n>'''TENSIONS MOUNTING'''\n>The Abqaiq oil processing facility is described as the “largest in the world” and uses vital shipping lanes on the Persian Gulf and the Red Sea.\n>It was targeted by al-Qaeda suicide bombers in February 2006, who failed to blow it up.\n>War erupted in 2015 with the Iran-aligned Houthi rebel movement battling against the Yemeni government and a Saudi-led coalition.\n>The violence has pushed Yemen to the brink of famine and killed more than 90,000 people since 2015, according to the US-based Armed Conflict Location & Event Data Project.\n>Now the coalition launches air strikes almost every day, while the Houthis often fire missiles into Saudi Arabia.\n>Tensions have also been rising in the region because of the rivalry between Saudi Arabia and Iran.\n>Saudi Arabia and the US both blamed Iran for attacks in the Gulf on two oil tankers in June and July.\n>And in May, four tankers - two Saudi-flagged - were damaged by explosions within the UAE’s territorial waters in the Gulf of Oman.\n>The shipping lane rivalry was exacerbated even further in June when Iran shot down a US surveillance drone over the Strait of Hormuz.\n>This led to the Pentagon announcing the deployment of US troops to Saudi Arabia.",
			"time": 1568673603724,
			"files": "[{\"name\":\"chew 5 gum.jpg\",\"thumb\":\"d6da4b8da8464da73060fcbb31c8f131f436656c-thumb.jpg\",\"size\":38242,\"type\":\"image/jpeg\",\"original\":\"d6da4b8da8464da73060fcbb31c8f131f436656c.jpg\",\"directory\":\"182q377SKkGkPF9UuEUH6NVzZvb3MrU6F8\"}]"
		},
		{
			"id": "393b9e0f-eda3-4df8-bd56-03dce8e12112",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "112e3faa-c5fa-42bc-a1b1-8cd5aa78198b",
			"body": ">>92f2b98e-bd47-4a58-8c8f-7108dc78ed80\nFor some reason that shirt always ticked me off",
			"time": 1568682550465,
			"files": "[]"
		},
		{
			"id": "5e18e9df-e741-4998-9516-abde3d9accd4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2ff88c86-3bc0-4b05-8025-2e5611a3bb7d",
			"body": ">>25c564fd-3c70-4352-9d37-70aa1d1a05dc\nIt's still pretty impressive the damage that has been done just by bombing infraestructure alone. I wonder how much damage could have been created by attacking electricity generating facilities, while attacking a refinery for Saudi Arabia ends up destroying a big part of the economy, attacking the grid could halt an economic sector by disabling the means of production.",
			"time": 1568683856665,
			"files": "[]"
		},
		{
			"id": "79c66397-59a5-439f-996a-1ff5219b26c2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f33de9f6-1f04-4782-93ca-07421b145b28",
			"body": "What is a good FOSS gif visualizer? Sick of opening my internet browser to see a gif",
			"time": 1568684586765,
			"files": "[]"
		},
		{
			"id": "c770c0c6-ca38-4d07-a6dd-bfea053c0357",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": "This still needs a bit of work though.\nI checked some of the folders that should be deleted once you subscribe to the blocklists, and while some were deleted, others kept existing.",
			"time": 1568684871065,
			"files": "[]"
		},
		{
			"id": "a583ada3-04aa-4200-b486-8aa9449d7b0e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "341d19d3-8f04-42f0-84ec-cde032744c24",
			"body": ">>26980386-8d6a-46b9-88d8-af186605852b\nYou can't hope for good times without rocking the boat a bit.",
			"time": 1568685383865,
			"files": "[{\"name\":\"soda.png\",\"thumb\":\"6e14e4bc2a807fa1d57018011b7898a67c35f39e-thumb.png\",\"size\":629941,\"type\":\"image/png\",\"original\":\"6e14e4bc2a807fa1d57018011b7898a67c35f39e.png\",\"directory\":\"182q377SKkGkPF9UuEUH6NVzZvb3MrU6F8\"}]"
		},
		{
			"id": "507f7675-c82e-4dea-8eed-e439fdc188aa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>eddf8766-a476-4ce0-bd7a-5aaae409ebf3\nYes, had to delete some folders manually to get rid of them",
			"time": 1568695398213,
			"files": "[]"
		},
		{
			"id": "8834776d-80c2-4b4a-837c-f7130cd1d8b8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "04554cd7-9c98-4d78-97a7-9bbda0032676",
			"body": ">>80239d55-624c-4c1a-b48e-bc1be2c95a12\ni think you're cute",
			"time": 1568773513136,
			"files": "[]"
		},
		{
			"id": "59e1bcf5-9605-467b-b042-c5618adb8ed3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "04554cd7-9c98-4d78-97a7-9bbda0032676",
			"body": ">>67e7073f-fcf7-4800-aefe-fcdffdd42434\ncute things are cute, k?",
			"time": 1568864402636,
			"files": "[{\"name\":\"horse notice.png\",\"thumb\":\"6f108a259a4e352b12e53b2ec0215d70d0d2851c-thumb.png\",\"size\":147594,\"type\":\"image/png\",\"original\":\"6f108a259a4e352b12e53b2ec0215d70d0d2851c.png\",\"directory\":\"182q377SKkGkPF9UuEUH6NVzZvb3MrU6F8\"}]"
		},
		{
			"id": "0067b558-9154-4d99-b5d0-61148015f98c",
			"directory": "users/1HjE12yuZCS1dkiPDAidrhXtk8Y7cB4y73",
			"uri": "lit",
			"thread": "bd4a0bc1-8e59-45fb-9d79-22858880e3b7",
			"body": ">boards now have subtitles/descriptions\nThank you /lit/fag, didn't knew 'bout this until now",
			"time": 1568864530786,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}