{
	"name": "Gianluigi",
	"about": "",
	"languages": "EN",
	"interests": "Space,Science,Math",
	"stories": [
		{
			"story_id": 2,
			"title": "Il pendolo di Foucault",
			"slug": "il-pendolo-di-foucault",
			"description": "Il pendolo di Foucault, il romanzo di Umberto Eco",
			"body": "<p>Mi sono appena iscritto su Medium, anche grazie alla pubblicità e all'uso che ne sta facendo il buon @peppeliberti, che sta ristampando qui tutto il materiale precedentemente noto come Rangle.</p><p>L'idea di provarlo c'era da tempo, mancava solo la spinta e quindi qualcosa da proporre. Per ora inizio con una serie di post originariamente usciti su DropSea [1, 2, 3, 4, 5, 6], che insieme costituiscono una recensione de Il pendolo di Foucault di Umberto Eco. La recensione è stata opportunamente riscritta per renderla un tutto unico. Spero che il risultato alla fine sia gradevole per il lettore.</p><p>Keter</p><p>Libro regalato per il Natale 2002, aveva una certa importanza, poiché inizia con la descrizione del pendolo di Foucault, una sfera metallica fissata alla volta di una cupola da un filo di metallo a massa trascurabile (rispetto alla sfera) messo ad oscillare su un pavimento di sabbia per poter dimostrare il movimento rotatorio della Terra intorno al Sole. La trama fu, all'epoca del liceo, l'impulso per una relazione su Galileo Galiei e la sua vita e il primo tassello verso la strada che mi ha portato a laurearmi in fisica.</p><p>Il romanzo è strutturato in varie parti secondo le lettere che indicano ciascun nodo dell'albero della vita (a tal proposito rimando per approfondimenti al sito Le sefirot che avevo originariamente utilizzato per scrivere queste note).</p><p>Dalla lettura della prima parte, la senzazione è che si tratti del &quot;delirio&quot; di una persona che prova meraviglia di fronte al pendolo di Foucault, ma non passione rispetto alla scienza in generale, considerando come si rapporta con le altre invenzioni che incontra nel suo percorso nel museo.</p><p>Ricordo che, dal punto di vista cabalistico, Keter = Corona.</p><p>Hokmah</p><p>Con la 2.a parte, che racconta come è iniziata tutta la storia, vengono raccontati il come e il perché, i legami con la storia dell'alchimia e con la cabala. Non si è ancora nel vivo, a volte sembra di perdersi tra le parole, e si cerca, insieme al narratore, il modo di scardinare un portatile per liberare i suoi segreti e dare inizio all'avventura…</p><p>Hokmah (o Chokhmà, come in Le sefirot) = Sapienza</p><p>Binah</p><p>E siamo alla terza parte: vengono introdotti i protagonisti principali e si inizia ad entrare nel vivo della storia.</p><p>Eco, per bocca del narratore e di un altro personaggio introdotto per l'occasione, fornisce al lettore una serie di informazioni storiche sui Templari, le loro regole e i loro misteri (o presunti tali), facendoci intravedere un complotto su vasta scala che questo ordine avrebbe ordito nel corso del tempo. Sposa una delle molte teorie e interpretazioni complottiste che nel corso dei secoli sono nate e cresciute intorno a quest'ordine monastico-guerriero e realizza una terza parte interessante e ben congegnata, che ci introduce sempre più in profondità nel Piano e nella mente dei protagonisti, nelle loro ossessioni e nella loro vita.</p><p>Binah (o Binà) = Intelligenza</p><p>Hesed e Geburah</p><p>Nelle parti 5 e 6 l'eroe protagonista del romanzo di Eco, tale Casaubon, va in Brasile con la fidanzata (brasiliana) dove vive per un po'. Qui scopre un mondo magico e incredibile nel quale vengono fuse le credenze esoteriche europee con le divinità degli indios pre-colombiani e quelle degli schiavi africani. Viene poi introdotto un personaggio enigmatico e al tempo stesso carismatico che, con lo scorrere delle pagine sembra sempre più di ispirazione lovecraftiana.</p><p>Dopo la parentesi brasiliana, il ritorno a Milano, solo, dove trova una nuova fidanzata e inizia a lavorare sempre più assiduamente per le due case editrici del signor Garamond, il quale inizia ad introdursi (e introdurre il lettore) nel variegato mondo dell'esoterismo. Vengono così poste le basi per il Piano che nel seguito del romanzo verrà sviluppato dal trio composto da Casoubon, Belbo e Diotallevi.</p><p>Le sefirot di queste due parti sono Hesed (o anche Chesed = Amore) e Geburah (o anche Ghevurà = Forza).</p><p>Tiferet, Nezah e Hod</p><p>Siamo giunti alla parte più importante del romanzo: i tre amici iniziano ad elaborare il Piano: partendo dal delirio inventato dal colonnello Ardenti inventano un complicato ed intricato complotto ordito da quel che resta dei Templari per conquistare il mondo. Con questo complotto riescono, in maniera incredibile e magistrale, a collegare uno con l'altro tutta una serie di avvenimenti storici che avvengono dallo scioglimento dei templari fino ad oggi, mettendo in mezzo anche Hitler e gli Assasini arabi. Alla fine, però, la fidanzata di Casaubon ricostruisce i messaggi che Ardenti aveva lasciato nell'ufficio di Belbo come una nota di un commerciante di fiori di Provins e un gioco di codici da parte di un fissato di templari.</p><p>E così finisce Tiferet = Bellezza.</p><p>Il piano, però, gli scoppia in faccia: Diotallevi si ammala di cancro, mentre Belbo, dopo essersi sfogato con Aglié per pura vendetta, viene apertamente attaccato e ricattato affinché riveli l'ubicazione della mappa tanto agognata e per secoli cercata. Si reca così a Parigi, meta finale del nostro Casaubon, che nel periodo in cui Belbo veniva attaccato dagli eredi dei Templari, era fuori città con fidanzata e figlio.</p><p>E questa è Nezah o anche Netzach = Eternità o Vittoria.</p><p>A Parigi, nascosto nel Museo delle Invenzioni, il nostro assiste alla riunione degli esaltati che credono di essere gli eredi dei Cavalieri del Tempio e che per questo cercano di carpire dalla bocca di Belbo una verità che, per colmo di ironia, non esiste! Qui si compie il dramma: un parapiglia incredibile, causato dai veleni esistenti tra le varie fazioni interne, porta alla morte di Belbo, il quale, fino alla fine, nell'impossibilità di essere creduto (il Piano era tutta una loro invenzione), aveva taciuto.</p><p>Casaubon, quindi, esce dal Museo e vaga per le vie di Parigi, in un delirio incredibile in cui ogni strada sembra un indizio della presenza dei complottanti che ha da poco lasciato fino a che, il giorno dopo, non decide di ritornare a casa…</p><p>E qui sorge Hod = Splendore.</p><p>Jesod e Malkut</p><p>Con un racconto sulla vita di Belbo, morto da eroe, e con l'attesa del superstite per l'arrivo di Essi, coloro che credono di essere gli eredi dei Templari si conclude un magistrale romanzo che dimostra come sia assolutamente semplice aggiustare i fatti di storia ai propri comodi, e non semplicemente il puro e semplice &quot;la storia la scrivono i vincitori&quot;.</p><p>E qui si concludono Jesod o Yesod = Fondamento e Malkut = Regno o Sovranità</p>",
			"tags": "Umberto Eco, recensione",
			"language": "EN",
			"date_added": 1609362484829
		}
	],
	"next_story_id": 3
}