{
	"title": "booksIread\n",
	"description": "Mini book reviews of what I recently read\n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 12,
	"demo": false,
	"modified": 1559477403,
	"post": [
		{
			"post_id": 11,
			"title": "Pines continued",
			"date_published": 1559477238.42,
			"body": "This review is going to keep spoilers to a minimum.\n\nHaving read the first book, I didn't expect to read the complete trilogy, however, by a random chance, a Reddit comment on the series being interpreted as sole big book convinced me to read the other two books. Having read both in around two weeks, I can see that all three books are just episodes, and should be interpreted as a much larger work. This is definitely the case for book 2, 'Wayward', as it felt like a filler for the third and final instalment, 'The last town'.\n\n'Wayward' starts off like a melodrama. Things turn to normality in Wayward Pines, if you can call it that. Everything is calm and progressing at a leisurely pace, till a murder transforms the story to a who-done-it. New characters are introduced but get little highlight while the sociopathic characters are more drawn out and written with cold malice. Subplots feel less rewarding. The twists they offer are predictable. The Hassler storyline is set up to reunite the characters but it goes nowhere and fizzles out, it felt forced and unnecessary. The conclusion of the subplot isn't satisfied till the end of the third book. The ending was built up with fast passed chapters but what followed was a less than dramatic conclusion, concluding that the pacing and structure let the narrative down. Negative aspects aside, it was okay, the mix of genres made for an entertaining light read but its sole purpose was to build up to the next book.\n\nThe third book in the trilogy, 'The last town', forgetting the Twin Peaks influences it started as a fast passed horror-thriller, with blood and guts, some mad max elements, then a \"four-way love square\" ensues. Blake Crouch really does pound in the melodrama. The ideas present in the science fiction elements are intelligent and entertaining so I can overlook the over the top relationships of the characters -mostly looking at the two-dimensional obsessive-creep character, Adam Hassler. The conclusion was fitting, but I would read the fourth hypothetical book. Does this mean I'll watch the cancelled tv show, no, probably not. Even with the brilliant Toby Jones, it looks too different, too far the source material. I rather watch Twin Peaks.\n\n​​​​​​​[Wayward-CrouchBlake.epub](Wayward-CrouchBlake.epub)\n[Lasttown-CrouchBlake.epub](Lasttown-CrouchBlake.epub)"
		},
		{
			"post_id": 10,
			"title": "Pines",
			"date_published": 1557952122.794,
			"body": "Lately, I've been on a Twin Peaks/Gravity falls vibe with tv, and wanted to extend that to reading. Enter Pines, a promising fulfilment of small-town supernatural nostalgia written by Blake Crouch of Dark Matter.\n\nLike Crouch's other novel I read, Dark Matter, there are elements of middle-class idyllic family life in which the protagonist focuses on, leaving an unfortunate stale two-dimensional aspect to the character. The narration pace is also slow to start and repetitive at times with its dream-like elements.\n\nNegative aspects aside, there is plenty of mystery and tiny details within. Plot twists are intertwined within subplots as agent Ethan Burke investigates the eerie town of Wayward Pines. Many times it leaves the small town mystery to horror and to science fiction, going beyond its Twin Peaks homage, to something similar to sci-fi movie, Logans Run, meets 90's tv nostalgia.\n\nI enjoyed the read expecting a slow-paced FBI-detective story or a 'who did it?' but instead got a mix of genres and some plot twist revelations.\n\n[.epub](Pines-CrouchBlake.epub)"
		},
		{
			"post_id": 9,
			"title": "Hzlgkbn mecma Wzub Alkvold",
			"date_published": 1556379560.047,
			"body": "Jn jzw igl vvbltyi bwpw kimy Nqvvyekt npwnwl uiie. Q szrm nvy cjsp rtikpxp giwwu.\n\nApkpp, J plgg vda lre btxg bd yire. Q slxm cvx wpzrzvbtu xyja kptwclx vyxpckutux/smwr. T cu rbvifvewa kwppcjvr zwb puh ifiotpo ioi wbuzfu kwppusmyd umgpij: Upp Xqwbprj cg Ezxm Yhrjtwy.\n\nWcai divl, wy l Izpcmkz Nlwna zpgb, J zplf bwl rvx(qds) ewbpg sz Iwpz Pxywti: Oclxqif Jrmtd: Wqai Sixfvod. K mcqsp upp dgzxlw wswx ekut as kjup, lpl ioi tputn jmawiu gqww vpt hfjfve gqqs hru zmlcpqcn jfs iyzvpty wvbazy. K zthpcz myuqg Idme Qmlvu txri ruuzdrptyi, kim pyfttzw tplpd, cvs tcjumcj.\n\nVpt jsdjk qpcbjyij gwfc pml zxfsqpd ypxjl wjb mpvetlr jfztpu wcl eee bhz. Vptf swgmc l hml jplfa lyf aelglmietqvh hffvb nsczpjxvsa mfv udzxcz nplvcgl sstkfcg njurp smqptmcjij. Jb'd ognxumkftj lkutk ek upp qcv qhwv siesgz ioi xfvpcct Spwefg qlp jpzi.\n\nKim twnchavruqzyu igl kifie lpl bhxti bsp updd. Wfnm datmpkw ybdp dq ujjl ufbltn qc alvn bspa kdbpu cm azubty afsbsj.\n\nK scva zu'a yzv ujjl r smgtge, qbx Z fvuzams px rmt esg apti. Ppc nlp nxuh zu (Q nlpvda wybzp tv ptyi rt qe hkta ivvbs esg htysefb nlr atciibt etomh vzvs) wy ejm rsirs epm cb q-vo.td /jzzm / 3560833/35078i\n\n<img src=\"haha_nice_try_the_picture_is_the_clue.gif\" alt=\"Buy Gold\" width=\"100\" height=\"216\">\n"
		},
		{
			"post_id": 8,
			"title": "The Master and Margarita",
			"date_published": 1551888744.557,
			"body": "I think I started reading this desiring some Russian literature and magic realism. I had read a few hundred pages of Demons (Dostoevsky novel) and the plot hadn't yet started so I tried Master and Margarita. A book I've heard a lot about, yet know nothing about. People are vague about it, more often than not pointing out the main narrative -the devil visits Starlin's Moscow, rather than the various religious allegory and satirical narratives.\n\nBook one is chaotic, humorous, dark and filled with innumerable Russian characters as Woland (the devil) impacts their lives. I found it hard to read at times, losing interest with various characters as the impending madness takes hold upon meeting Woland.\n\nBook two has a more linear narrative with Margarita searching for Master, her lover, as well as Pontius Pilate coming to terms with the sentencing Yeshua in a religious subplot. I'm not religious but I enjoyed the Yeshua (Jesus) narrative. It was written as though it were non-fiction, I think it also held metaphors for the other characters, of which I barely scrape the surface of understanding.\n\nMy favourite character was Behemoth, a large anthropomorphic black cat with a love for guns, vodka, chess, and fuel leaking stoves. A running joke is that city citizens will shout 'No cats allowed' when at once he turns into a cat-like human. This character is like a modern rebellious dark puss in boots but also fun and humorous.\n\nI like Richard Pevear and Larissa Volokhonsky translations but, I think I should have read Michael Glenny's translation. At times the prose felt forced and did not flow, especially when humour commenced and the joke stumbled in the language. It just lacked something.\n\nOverall, it is like Death of Stalin meets Good Omens. At times I disliked the chaotic nature of book one, but you are rewarded with humorous situations and the Devil's midnight ball. Read if you like Russian lit., satirical commentary on Communist Russia, or are interested in atheism and religion.\n\n[.epub](MasterandMargarita-Bulgakov.epub)"
		},
		{
			"post_id": 7,
			"title": "After Dark",
			"date_published": 1550269041.59,
			"body": "I didn't know what to read after Killing Commendatore, and needed something to fill the void, so I read another Murakami book that I have not read before: After Dark.\n\nThe plot takes place over the course of several hours during the night. The first few pages set the scene with a bird's eye view and a neon-drenched description of Tokyo at night. From the start, it feels like a pulp novel. It feels like I'm reading Ryu, not Haruki Murakami.\n\nOne of key difference I noticed is that the narration is visually directed as if Murakami controls a camera and describes what's inside the frame.\n\n`We allow ourselves to become a single point of view, and we observe her for a time. Perhaps it should be said that we are peeping in on her. Our viewpoint takes the form of a midair camera that can move freely about the room. At the moment, the camera is situated directly above the bed and is focused on her sleeping face. Our angle changes at intervals as regular as the blinking of an eye.`\n\nThis could be the least Murakami-esk book with no first-person narration and could perhaps be the most experimental in terms of prose. It could be that the subject matter called for the detective novel writing style. Either way, it took a little getting used to. Once or twice, I made sure I was reading the right book.\n\nThe main protagonist is Mari, a young student avoiding home life by reading all night in a diner. Over the course of the short plot, Mari meets people that work, roam and play throughout the city night, while her sister sleeps undergoing a surreal nightmare. The sister and the acquaintances of Mari have short side stories that interconnect physically and metaphysically.\n\nThis book does not seem popular. Finding an adequate epub with acceptable formatting was difficult. It's also not mentioned much within Murakami communities online. It could be that this book is just too different, too left field of his usual style, that fans avoid it. Within the pulp-styled narration, there are glimpses of usual Murakami though:\n\n`You know what I think?\" she says. \"That people's memories are maybe the fuel they burn to stay alive. Whether those memories have any actual importance or not, it doesn't matter as far as the maintenance of life is concerned. They're all just fuel. Advertising fillers in the newspaper, philosophy books, dirty pictures in a magazine, a bundle of ten-thousand-yen bills: when you feed 'em to the fire, they're all just paper.`\n\nThis is a hard book to place. I wanted Murakami but instead, I got straight pulp prose intertwined with subjective surrealism -creating a unique read. I would also say this is more a novella than a novel, as its length and the short chapters breeze by in a few sittings. If you are looking for a short pulp novella about Tokyo at night with some subjective supernatural bits thrown in then read this.\n\n[.epub](afterdark-Murakami.epub)"
		},
		{
			"post_id": 6,
			"title": "Killing Commendatore",
			"date_published": 1549912156.829,
			"body": "I read a lot of Haruki Murakami in my 20's before the tumblr hype alongside pictures of avocados -which now seems to be originating from young female hipsters (I don't understand how a 70-year-old Japanese man can attract such a polar opposite audience, but hey I encourage it!) This novel has been on my list to read for some time. I was put off by all the reviews, explaining the work was not up to par and also the commitment needed to finish it with its 700+ pages.\n\nKilling Commendatore, while being a homage to 'The Great Gatsby' and 'The Picture of Dorian Gray', is a rambling self-indulgent novel by Murakami. And I loved it. Pasta, cooking, jazz, classical music, obscure Dostoevsky references, weird sex scenes, stuff vanishing, secret passageways, unusual names, it was all there. Reading it was like taking a vacation in the Murakami-verse. It was enjoyable and a pleasure.\n\nGoing with a personal and biased opinion on this book as I can't seem to be objective; This book is aimed at the middle-aged audience. The age when inevitably shit goes wrong or things don't turn out as you planned. It seems Murakami has stopped writing for the 20-something, moving from the coming of the age storyline and going with the 30-something oh-shit-I'm-halfway-dead-is-this-all-that-there-is? storyline. I think that's a good thing as, presumably if Murakami writes additional novels like Killing Commendatore, a young reader can enjoy the coming of ages novels 'Norwegian wood' & 'Kafka on the Shore' and return when the 30s slap you in the face to 'Killing Commendatore' with such wisdom as--\n\n`\"Our lives really do seem strange and mysterious when you look back on them. Filled with unbelievably bizarre coincidences and unpredictable, zigzagging developments. While they are unfolding, it’s hard to see anything weird about them, no matter how closely you pay attention to your surroundings. In the midst of the everyday, these things may strike you as simply ordinary things, a matter of course. They might not be logical, but time has to pass before you can see if something is logical.\"`\n\nIf you haven't read Murakami before I would start with an earlier novel, however if you are interested in painting (or any similar profession), art, or Japan, the plot may interest you. If you have read Murakami before, expect the usual minimalist mundane ennui plot with surreal subplots, and pasta.\n\n[.epub](KillingCommendatore-HarukiMurakami.epub)"
		},
		{
			"post_id": 4,
			"title": "Dark Matter",
			"date_published": 1548586263.003,
			"body": "The first couple chapters of this book play out like a melodrama with physicist, Jason Dessen, husband and father, spending time with his suburban-middle class white family. It's a dull slog, then events slowly occur, which kept me reading. Halfway through I was about ready to give up. I thought I figured out the plot, however, the element of infinite multiverses and the exploration of them had me finish the book. \n\nThe plot is going to leave you in the dark for most of the book, so it is hard to write a review without spoiling it. At times, it can leave you feeling small and overwhelmed. It can also be creepy and questions identity. \n\nThe writing style is at times broken up. Probably to add tension and to move the reader along. I don't mind it, but others may think differently. At times it is too visual, aiming at the movie adaption, of which I find more annoying.\n\nOverall it is not a serious science fiction work, there is little science except some thought exercises. The start is a slog, but the second half had me thinking, and became suspenseful.\n\n[.epub](DarkMatter-BlakeCrouch.epub)"
		},
		{
			"post_id": 3,
			"title": "Artemis ",
			"date_published": 1548075582.795,
			"body": "I never read The Martian so I can't compare this work to the previous. I found the writing style to be riddled with adverbs, and trivial first-person personal tidbits, while also detailed with lectures on science and engineering.\n\nThe landscape of the novel is a five dome moon base-city, \"Artemis\". The author, Andy Weir, explores the economics, politics, crime, peregrination, and the resulting migrant society. These aspects are interesting.\n\nThe protagonist, Jazz, however, is either going to be liked or disliked. The latter being more likely. Jazz is a flawed character that makes bad decisions and choices and then has to justify her actions by fixing problems she caused herself.\n\nJazz is a smuggler, like a cowboy bebop side character, or a small-time Han Solo of the moon. Poverty drives her and greed is her weakness. If she wasn't so sass for a juvenile twenty something, I could forgive her poor choices and the resulting predictable outcomes (which always end badly).\n\nIf you enjoy science fiction, read it for the moon city. If not, wait for the movie.\n\n[.epub](Artemis-AndyWeir.epub)"
		},
		{
			"post_id": 2,
			"title": "Bird Box",
			"date_published": 1547496038.986,
			"body": "Riding the hype train, I expected the book to be just like the movie. However, I was surprised to find it a different exploration into the dystopian scenario, one that was easy to read.\n\nThe style of writing is relaxed, commonplace, and boring, like an article in a lifestyle magazine. It's nothing fancy to look at but its readable and accessible.\n\nThe scenario -never looking outside in the open, is the real anchor and the core of the story whilst stereotype characters play out their doom. Almost all of the chapters have some kind of hook -a sound or mysterious presence like footsteps or touching. It can feel a little repetitive, while some situations did put me on edge.\n\nOverall it was interesting, and a deeper exploration into the bird box universe, while the movie skims discussion, the book asks what if?\n\n.[epub](birdboxJoshMalerman.epub)"
		}
	]
}