{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1557762756,
			"title": "Any ZeroNet platform  that could complement/replace SecureDrop/WikiLeaks?",
			"body": "http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:13",
			"added": 1557762755
		},
		{
			"topic_id": 1563546340,
			"title": "QubesOS Certified (and preinstalled) PrivacyBeast X230 is now publicly available!!!!",
			"body": "[Here!](http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:26:QubesOS+certified+and+preinstalled+in+PrivacyBeast+X230+now+available!!!)",
			"added": 1563546338
		},
		{
			"topic_id": 1565663014,
			"title": "https://zn.amorgan.xyz/ ZeroNet<-> ClearNet proxy now asks for password?",
			"body": "Hello.\n\nI use https://zero.acelewis.com/ proxy to link to my blog posts, but there seems to be only https://zn.amorgan.xyz proxy in a working state right now, and it now asks for a password to use it?\n\nYou know who to contact to make this work again?\nThanks!",
			"added": 1565663011
		},
		{
			"topic_id": 1568064692,
			"title": "zn.amorgan.xyz clearnet -> ZeroNet down?",
			"body": "Hello everyone.\nSomeone can contact the hoster to make him know that it's not working properly?\n\n[Exemple](https://zn.amorgan.xyz/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/)",
			"added": 1568064688
		},
		{
			"topic_id": 1572791522,
			"title": "Why so few ZeroNet ClearNet proxies?",
			"body": "http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:33:ZeroNet+ClearNet+proxies+are+dying....",
			"added": 1572791517
		}
	],
	"topic_vote": {
		"1557762756_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"1557855329_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"1557808432_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557931963_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1557880052_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1558187649_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1558288538_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"1558637285_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"1559076722_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1560694067_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"1564865132_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1564958631_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1568064692_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"1602785059_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1635496137_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 56,
	"comment": {
		"1557421253_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 1,
				"body": "Interesting. I'm using Qubes-Whonix-ws qube right now exclusively over tor, using bundled tor browser to write this, and NoScript reports that javascript is blocked on 127.0.0.1 and I do not suffer from any weird behavior. \n\nFollowed the instructions here: http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:9:Finally,+ZeroNet+works+under+QubesOS+to+host+Zites+in+Qubes-Whonix+Workstation!",
				"added": 1557430369
			},
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_278_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): -Note, you will have to disable tor in ZeroNet, but that is ok because Whonix runs all traffic through a dedicated VM acting as a Tor gateway.\n\nNope. Not true anymore since May 6 2019: http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:9:Finally,+ZeroNet+works+under+QubesOS+to+host+Zites+in+Qubes-Whonix+Workstation!",
				"added": 1557434132
			},
			{
				"comment_id": 3,
				"body": "> [fantoski](#comment_26_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): But it's P2P though, won't it lend over your real IP address anyways ? I mean that's why it's known P2P over Tor is normally useless, right ?\n\nNo. Zeronet, through Qubes-Whonix WS, will expose only your tor hidden service, while Qubes-Whonix GW prevents leaks by blocking all udp traffic, making everything go through tor.",
				"added": 1557446193
			},
			{
				"comment_id": 4,
				"body": "> [anonymouslogin](#comment_283_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): VPN\n\nYour VPN provider can hand your IP address and will if raided. There is less risks when using tor only. I know it seems counterintuitive when thinking of what the first hop and last hop could leak as information if spied on, but if using tor browser and making your footprint not unique, making your time skew random (thanks Whonix) most of those things are already taken care of for you. The VPN is a trustee that should be chosen with great care in all case. By choosing a VPN provider, you are basically replacing the trust you don't have toward your ISP and placing it into your VPN provider. This is basically, and unknowingly, what you are doing. This needs to be an informed decision that most of the time you can't make. tor alone is better.\n\nDeeper explanation here if curious: https://matt.traudt.xyz/posts/vpn-tor-not-mRikAa4h.html",
				"added": 1557446572
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_298_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm curious about Qubes. What do people think about that OS?\n\nThat is a big question!!!\nDefinitely, something like this is missing: https://2019.www.torproject.org/about/torusers.html.en\n\nBut this is the goals of QubesOS: https://www.qubes-os.org/security/goals/\nThis is for what it should be used for by different persona: https://github.com/QubesOS/qubes-issues/issues/1906#issuecomment-217473679\n\nAnd how it can be used on a daily basis to compartimentalize everything and reduce exposed risks: https://www.qubes-os.org/video-tours/\n\nHere are the usage stats (30k users!!!) : https://www.qubes-os.org/statistics/",
				"added": 1557754892
			},
			{
				"comment_id": 6,
				"body": "> [pexo](#comment_87_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I disagree. Even if you have a VPN-provider that does nothing but to spy on you the only thing he can learn is that you connected to the tor network and what your first hop was. But what that also does is hiding the fact that you used TOR from your ISP. If you use a VPN in a country that your TLA isn't partnered with, they'd need to go through the drooling process of getting the logs from another country just to find out you were using tor. This is the lower bound of the additional security you can get when using VPN before TOR(remember kids, VPN after TOR will negate any anonymization the TOR network does to your traffic)that you shouldn't just dismiss. [...]\n\nCorrect. There is no one size fits all. Different threat models: different approaches. I just think VPNs are used as no brainers and they shouldn't.  I agree with the content of the article previously referenced. Whonix-gw, as orbot when properly configured (NetGuard always on VPN that can play the role of a SOCKS proxy to redirect all traffic to orbot and port forward all DNS traffic to orbot also and filter traffic and block internet access to untrusted applications as a best effort, showing to the user what their applications are truly talking to over their used network) isolates streams properly and use a different onion route for each IP visited. Connecting to a VPN provider, a single IP address, for everything one's do, may trigger some kind of interest depending of who the adversary is. \n\nI personally use a VPN when abroad prior to going on tor myself. I'm restating here that the trust I do not have on the ISP i'm using, i'm putting into my VPN provider ins such case, and that depending of the VPN trustability, may keep logs of login and accessed IP from them. The question goes really simply to: who do you trust. Using a VPN to cloak it's IP address when torrenting is really different then using a VPN in censured regimes, on which tor may a better solution then creating a static, uninterrupted tunnel to a single IP for as long as you are physically there. Untrust everything :)\n\nUsers of VPN have to be aware of that and do their choices accordingly.",
				"added": 1557755416
			},
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_151_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): If you're afraid of IP address leaking through clearnet requests, there is another option: install uMatrix and disable all third-party requests (not just js, but including pictures/css/media) for zeronet site. Can't say how reliable that is, though. But personally i would advise doing that even if you route all (including clearnet) traffic through tor, because besides IP leaks, there can be other ways to identify you using JS\n\nOr again, using Qubes-Whonix.\nAs stated in another comment, Qubes-Whonix-gw is configured with good privacy defaults which isolate requests through different onion routes. So yep, the first hop is the same, but hte second and third hops are different for clearnet requests. Plus, NoScript is there in TBB provided by Qubes-Whonix-WS and limits javascript on 127.0.0.1, and seriously, my expererience is not that much impacted.\n\nSo it is as simple as creating a new qube from Qubes-Whonix-ws, following https://www.whonix.org/wiki/ZeroNet (onion-grater configurations have been mainstreamed and packages updates deploy them automatically) and depending if sys-whonix used for all other VM forward other onion hidden services, deploy another sys-whonix gw to seperate zeronet from other services. Better safe then sorry.\n\nThat is, IMOHO, the best solution that is available. Everything goes through tor, leaks are prevented in most scenario if user is not stupid, and if parano, spin a disposable vm and copy paste cleaner links to another qube and there you go!\n\nVPN are in a hype now. Most of the providers don't provide canaries publicly to the world; we actually don't know who in trustable until they are not. Stay away of free VPN. And use a VPN only to cloak yourself from your ISP. Consider the DNS requests as metadata collected and shared with anybody, as IP addresses contacted. In my own personal experience working in network security and monitoring, it is better to have short connections with plenty of IP addresses then a single connection to one single IP address: this glows less on the wire. \n\nBe safe. Think preventive. And know your threat model. https://sec.eff.org/materials/threat-modeling-activity-handout-for-learners",
				"added": 1557756920
			},
			{
				"comment_id": 8,
				"body": "> [chinchin](#comment_2_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): really good regarding privacy but if you want to use resource-heavy things (e.g. gaming or stuff like that) you can basically forget about it\n\nOr dedicate a compatible graphic card (forget about nvidia) to a game qube and game on.\nhttps://www.qubes-os.org/faq/#can-i-run-applications-like-games-which-require-3d-support",
				"added": 1557762626
			},
			{
				"comment_id": 9,
				"body": "> [chinchin](#comment_3_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): true but that means that you would need to get a second graphics card\n\nIf you are here, it's because of some reasons. \nWanting to play games on that same computer answers some other needs. \nSome contradictions may arise.\n\nWanting to have everything on the same computer might be a non-sense if you pound those weights accordingly.\n\nYou might have to choose between having multiple computers to answer those needs, or a dedicated graphic card on a QubesOS compatible Workstation/Laptop (some have dual cards on which AdminVM[dom0] can drive the main card and isolate the more powerful one to be dedicated to some other qube dedicated to mining of gaming, as needed.)\n\nLife is always about choice :)\nKnow your threat model and act accordingly.",
				"added": 1557767314
			}
		],
		"1557762756_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 10,
				"body": "> [fantoski](#comment_32_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Why wouldn't any public file uploader already on ZeroNet do the trick ?\n\nWas thinking of something that would make those kind of sites more dynamic, permitting collaboration on leaked material. Those are static:\n[Snowden Files](http://127.0.0.1:43110/1DaXkbpBN7d9h78T5mjB2gTV9Ui46Bjwcv)\n[Vault7](http://127.0.0.1:43110/14y3SeSH7wvr3KqLiYQhbQRc9TCAPCbWeH/year0/vault7/index.html)\n[Internet Of Leaks](http://127.0.0.1:43110/1PYydUXYkUMNyrUNxr6SzJG68z8qkCbc2v)\n\nIf you know any platform that would fit the bill, please advise.\n\nZeroUP:\nPermits file sharing up to 1GB.\nLack proper description, lack discussion possibility of discussion on dropped material.\n\nThink of a mix between SecureDrop, a forum and a blog.\n\nOpened a ticket on [ZeroUp' GitHub](http://127.0.0.1:43110/1Vt7yu21gyxN2fdtxRErUhanjGriCRxBq)\n[Made a blog post about it](http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:13:Decentralized+WikiLeaks/SecureDrop+probable+platforms+)",
				"added": 1557854175
			}
		],
		"1557931963_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": [
			{
				"comment_id": 11,
				"body": "QubesOS enforces the best mitigations for all those threats, mainly by deactivating preventively hyperthreat (pun intended) through \"smt=off\" since around [September 2018](https://groups.google.com/forum/#!msg/qubes-users/Isn_hko7tQs/PcqIuUleEQAJ)\n\nEDIT: They just released a [security bulletin](https://www.qubes-os.org/news/2019/05/15/qsb-049/)\n\nA really [good article](https://www.hostingadvice.com/blog/qubes-offers-security-by-compartmentalization/) landed yesterday that explains why you need preventive protection and switch perspective about security and taking responsibility upon your threat model and limiting risk exposition.\n\n",
				"added": 1557949624
			},
			{
				"comment_id": 12,
				"body": "> [duck0](#comment_64_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Could you tell me more about QubeOS? Is it forked? Is it RYO?\n\nYou can [build it yourself](https://www.qubes-os.org/doc/qubes-builder/), if that is your question, yes.\nTo tell you more about it, I already referenced the most comprehensible article made to date in previous comment.\n\nSecurity goals can be found [here](https://www.qubes-os.org/security/goals/)",
				"added": 1557969903
			},
			{
				"comment_id": 13,
				"body": "> [duck0](#comment_67_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): This is a fully functional Linux distribution? Does it utilize systemd or what is the general working environment?  [...]\n\n> [kropptyler](#comment_9_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): It looks like it's not based on another OS or something. From the website it says:\"Can't decide which Linux distribution you prefer? Still need that one Windows program for work? With Qubes, you're not limited to just one OS. Learn more\" [...]\n\n\nRead a bit, seems like I picked your curiosity, which is all that is required to learn :)\n\nI won't answer what is already covered [here](https://www.qubes-os.org/doc/)\n\nSee [architecture](https://www.qubes-os.org/doc/architecture/)\n\nIt's a Xen based hypervisor, for which AdminVM(dom0: management, graphics) is based on Fedora.\nThe default VMs are Fedora based, but Qubes delivers 4 templates by default: Fedora, Debian, Whonix-WS, Whonix-GW. \n[Here are the other templates](https://www.qubes-os.org/doc/templates/), on which other [software distributions](https://www.qubes-os.org/doc/#managing-operating-systems-within-qubes) can be installed\n\nWhat is interesting in the QubesOS architecture is that you can switch templates for a specific qube (VM) at any time prior to starting it, excluding Windows that cannot mount ext4 partitions by default. This means that you can switch between Debian/Fedora/Arch/Whonix/Ubuntu/Kali/BlackArch templates underlying your data anytime you want. You data cannot infect the templateVM, which are instantiated in read only. You can ephemerally install a software in a qubes (as opposed to in the TemplateVM) for testing, and it will vanish on reboot. \n\nQubes internet traffic goes through tor by default, but you can define any VPN ProxyVM you want, and define, for each qube, how it reaches the outside world. In practice, it means that you can create a captive-portal that exits to the firewall into your local network. While having your disposable qubes leaving through tor, passing though your VPN if required per your threat model.\n\nQubesOS is LVM based, which means that you can clone without additional disk cost a VM, revert changes if you made a mistake, etc.\n\nBut the best thing is the compartmentalization.\n\nIt's XFCE based, but you can choose your own (with window decoration patched in).\n\nCheck their main documentation section, most of your other questions, like nvidia and others.\n\nIt's a workstation based solution, that I also use on my PoC [server](https://github.com/osresearch/heads/issues/134#issuecomment-368922440)",
				"added": 1558010244
			},
			{
				"comment_id": 14,
				"body": "[Small blog post](http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:14:New+blog+post) on why x86 is rotten and why QubesOS running on top of it is the transition to newer, open architectures.",
				"added": 1558019440
			}
		],
		"1557847676_1DR9EVmTR2KA8mJXmzTknbEAUzveKLRJut": [
			{
				"comment_id": 15,
				"body": "> [filips](#comment_23_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): How to add site to RVRE? [...]\n\nActually, the domain link and contact link don't point to valid information either.\nbwoi is an unknown name, and domain list points to a domain not being ownership of original intent.\n\nIs RVRE dead?",
				"added": 1558043844
			}
		],
		"1558017656_19RpjiRJb4ciGUE4CDTrimQSPsL84sJ7WN": [
			{
				"comment_id": 16,
				"body": "Agreed.\nWhile owner is not contactable [through contact link](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=bwoi)\nAnd domains [link points to domain name not being owned by original owner](http://127.0.0.1:43110/domains4free.bit)\n\nI'm without a clue on how to add zite to RVRE search engine.",
				"added": 1558044170
			},
			{
				"comment_id": 19,
				"body": "We should populate alternatives and ditch ditched projects like RVRE.\n[Search and Index Zites](http://127.0.0.1:43110/1xiwbXaTbo9XU32hEpW4NyjZHrugSFdo6) seems the most promising.",
				"added": 1558282390
			}
		],
		"1558187649_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 17,
				"body": "Didn't found your specifc model as provided in OP.\nBut it seems to be this: https://support.hp.com/us-en/drivers/selfservice/hp-x360-310-g1-convertible-pc/6943758\n\nSo if it is, then Qubes HCL doesn't have exact model.\nhttps://www.qubes-os.org/hcl/#hp_spectre-x360-convertible_i7-6500u_skylake_intel-hd-520\n\nCould give a try to the live image hosted by unman here and boot from USB: https://qubes.3isec.org/Live/\n\nThen from dom0 terminal:\nqubes-hcl-report\n\nYou want to see from there all of the following:\nHVM:\t\tActive\nI/O MMU:\tActive\nHAP/SLAT:\tYes\nTPM:\t\tDevice present\nRemapping:\tyes\n\nYou want to make sure that your BIOS has vt-d and vt-x activated prior to boot from Live ISO.",
				"added": 1558199681
			},
			{
				"comment_id": 23,
				"body": "> [fantoski](#comment_34_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Eh the computer you linked is way more powerful than mine. Intel Pentium vs i7 lmao. Thanks for the advice tho, I'll try that.\n\nHo. You need vt-x (virtualization extension) and vt-d (isolation virtualization extension) and SLAT supported all the way from the CPU, the chipset, and BIOS configurations. \n\nReading \"Pentium\" here leave me believing that your system don't meet [QubesOS requirements](https://www.qubes-os.org/doc/system-requirements/)",
				"added": 1558538991
			},
			{
				"comment_id": 24,
				"body": "> [fantoski](#comment_36_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Infortunately I can't start the Live Qubes. I get a \"Kernel Panick Not Synching Fatal Exception\" which apparently is a common Linux error and considering there doesn't seem to be logs for the Live version I can't find out what happened. I tried by creating the Live with both DD ( on Debian ) and Etcher ( on Windows ) so I doubt it's a partition problem such as it seems to be the case for a lot of the problems.\n\nwhich may be linked to [that](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1558187649_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3#comment_23_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2)",
				"added": 1558539111
			}
		],
		"1558266064_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": [
			{
				"comment_id": 18,
				"body": "Not enough promotion of benefits for mainstream users.",
				"added": 1558278661
			},
			{
				"comment_id": 20,
				"body": "> [kropptyler](#comment_18_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): I think one problem with it is how users have to manage their space. Typically, sites are downloaded and stored temporarily, but with ZeroNet it's permanent unless you say otherwise for that specific site. Default options are notoriously popular among typical users, so we can't really say, \"they should just delete zites they don't use durr,\" because I think we all know they won't.\n\nFrom what I get, an optional file you downloaded will be shared as the zite, by default.\nMost of the platforms present you options to that file if you do not want to spread that kind of information. \nElse files can be managed in zite settings, so that you can help share new files, or delete individually the ones you do not want to share.",
				"added": 1558357220
			},
			{
				"comment_id": 21,
				"body": "> [kropptyler](#comment_19_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): edit: I looked at my stats, only 250 MB from zites according to stats page, the rest is something else...\n\nVoilà!",
				"added": 1558365352
			}
		],
		"1558513165_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 22,
				"body": "A collaborative leaking platform. Permitting big files dump, proper description, and comments.",
				"added": 1558533346
			},
			{
				"comment_id": 25,
				"body": "Something like that: http://www.aaronsw.com/weblog/watchdog\n\nBut i'm dreaming here",
				"added": 1558652230
			}
		],
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "Because democracy became other's people business but oneself. Pun intended.\nhttps://democracy.earth/",
				"added": 1560298617
			},
			{
				"comment_id": 27,
				"body": "> [insurgo](#comment_26_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Because democracy became other's people business but oneself. Pun intended.https://democracy.earth/\n\nhttps://9gag.com/gag/4805252/mafalda-on-democracy",
				"added": 1560298835
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 28,
				"body": "https://www.howtogeek.com/howto/6169/use-truecrypt-to-secure-your-data/\n\nIt is possible to reencrypt your disk content. And then inside that encrypted container, you can then create a hidden container. Be sure to have full backup first. Use clonezilla or whatever on an external drive and verify that backup first prior to going further. You have been warned.",
				"added": 1561075399
			},
			{
				"comment_id": 29,
				"body": "https://www.whonix.org/wiki/Download\n\nThis is to cloak your network activity with a leak proof approach. It involves virtualization, so it requires duplication of required OS memory to be able to permit its Tor onion gateway VM and it's client VM to forces all traffic, including DNS traffic, to tunnel through the Tor gateway. No DNS leak, no UDP traffic can leak either. Plus, it enforces the use of Tor Browser by default. \n\nMeanwhile see for yourself how unique you are here https://panopticlick.eff.org/\nAnd discover how even by using a VPN, or Tor, insecurely on your phone, or outside of QubesOS, your browser and (Without talking about all the proprietary applications you refuse to give up on, full of spywares...) betrays you even with all your privacy plugins installed. They are not protecting you against yourself and your past browser habits: https://browserleaks.com/\n\nFor a more secure approach, prefer QubesOS, which enforces Whonix, for which VMs goes through it by default. \nBut not all machines are \"reasonably secure\" enough to provide hardware and memory isolation (IOMMU and vt-d) with virtualization, required by QubesOS. It requires a combination of CPU features, board features and BIOS configuration to properly compartimentalize. See here if your machine supports it: https://www.qubes-os.org/doc/hcl/\n\nOnce inside of QubesOS, lauching a disposable VM is as easy as point and clicking.",
				"added": 1561075447
			},
			{
				"comment_id": 30,
				"body": "https://tails.boum.org/\n\nThis is your only real solution. There is no such thing as hidden application use, even with virtualization. The launching of those VM from the hidden containers will leave trace on the host OS. QubesOS included, if someone makes you type your encryption key passphrase. Physical access, remotely or locally, should always be considered game over.\n\nYour \"hiding\" solution should be to boot an amnesic Operating System (eg. Tails) that won't leave any trace of it's existence between reboots. There is always traces left behind otherwise. Always.\n\nActually, on an unencrypted SSD drive, those deleted files will be there long after having been \"secured deleted\". \nRead [here](https://ssd.eff.org/en/module/how-delete-your-data-securely-linux##SSDs) why. \nBy choosing to use a SSD to boost disk random access time and forget about defragmentation, you traded speed for confidentiality. Now encrypt your drive. You have been warned.",
				"added": 1561075515
			},
			{
				"comment_id": 31,
				"body": "> [insurgo](#comment_29_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): https://www.whonix.org/wiki/Download\n\n> [h3bhkj5gqz4n3pjm](#comment_289_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): First a system in a system you need a lot of memory resources. [...]\n\nDon't forget to put limited trust on your hardware if you don't own it yourself. Someone else might be owning it without you knowing. It's unfortunate, but that's the true. Have you updated your BIOS lately? If your answer is no, or even worst, your answer is \"What is a BIOS\".... Then keep reading.\n\nFor better control, own a Heads empowered computer booted from a binary-blob free Open Source Firmware (and no, unfortunately, coreboot by itself doesn't mean Open Source Firmware... FSP, Intel ME are just other proprietary binary blobs you are putting your trust into without knowing. You have a choice to make here for the moment, unfortunately, if you begin to get the picture. If not... Keep reading here: https://libreboot.org/faq.html#intelme\n\nOpen Source Firmware exists and can be installed on some hardware, still. Like it is possible to do on the Lenovo X230 and be able to use QubesOS. Or on the X200 and get rid completely of Intel ME. Or own Talos II/Blackbird which is open source from the ground up, with the true meaning of Open Source Hardware....But those don't support QubesOS....Yet.  \nWatch/Read this: https://trmm.net/Heads_33c3\n\nIf you followed the white rabbit until the end, you might want to change a couple of things now :)\nIf not, it will come.\n",
				"added": 1561076343
			},
			{
				"comment_id": 32,
				"body": "> [qspitzer](#comment_14_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): https://www.digi77.com/linux-kodachi/Kodachi seems like it has more security and anonymizing features than TAILS, so it might be a better choice\n\nWho's the VPN provider you are choosing to put your blind trust into never betraying you into disclosing your real IP?\nWhy should I trust it better then randomized Onion peers themselves?As a plain reminder, using a VPN justs diplaces the trust you don't currently have in your ISP and puts it into choosen VPN provider. Having all your internet traffic going into that single IP is interesting by itself, when you listen on the wire. ISP do it. It's part of the metadata they have the right to collect, nowadays. As are your DNS requests. And whoever will ask them, they will provide, legally or not, following discretionary powers. Does that VPN keeps logs? Even if they swore they wouldn't, until they are proven to have kept some. Corporations don't have your interests at heart. They have their own.\n\nAnyway, you know your threat model, I don't.\nBut I suggest you to read this: https://matt.traudt.xyz/posts/vpn-tor-not-mRikAa4h.html\n\nI have no personal opinion about kodachi. But a strong positive opinion about Tails and the work they have done and continue to do.",
				"added": 1561076928
			},
			{
				"comment_id": 33,
				"body": "> [fantoski](#comment_61_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): OP just put a live USB Tails on a random USB key and boot on it. Easiest solution for what you wanna do. BE CAREFUL HOWEVER this OS doesn't have persistence by default, meaning that all downloaded files, saved passwords, cookies, etc... Will be delete upon closing the user session, so you wanna have another USB Key where you'll put everything you download. Also, maybe irelevent, but use a password manager with a complex Master Password, that'll make it harder for people not named \"Big-Ass Multi-Billion Company\" or \"Government\" wanting to attack your private life to get into your accounts.  [...]\n\nOupsi. I meant to link to veracypt full disk reencryption article, not truecrypt. My bad:\nhttps://medium.com/@securitystreak/veracrypt-full-disk-drive-encryption-fde-157eacbf0b61",
				"added": 1561127983
			},
			{
				"comment_id": 34,
				"body": "I didn't follow developments, but here is an article from veracrypt on how to install a decoy OS:  https://www.veracrypt.fr/en/VeraCrypt%20Hidden%20Operating%20System.html\n\nExtract:\n\" However, in order to boot a system encrypted by VeraCrypt, an unencrypted copy of the VeraCrypt Boot Loader has to be stored on the system drive or on a VeraCrypt Rescue Disk. Hence, the mere presence of the VeraCrypt Boot Loader can indicate that there is a system encrypted by VeraCrypt on the computer. Therefore, to provide a plausible explanation for the presence of the VeraCrypt Boot Loader, the VeraCrypt wizard helps you create a second encrypted operating system, so-called decoy operating system, during the process of creation of a hidden operating system. A decoy operating system must not contain any sensitive files. Its existence is not secret (it is not installed in a hidden volume). The password for the decoy operating system can be safely revealed to anyone forcing you to disclose your pre-boot authentication password.*\n\nYou should use the decoy operating system as frequently as you use your computer. Ideally, you should use it for all activities that do not involve sensitive data. Otherwise, plausible deniability of the hidden operating system might be adversely affected (if you revealed the password for the decoy operating system to an adversary, he could find out that the system is not used very often, which might indicate the existence of a hidden operating system on your computer). Note that you can save data to the decoy system partition anytime without any risk that the hidden volume will get damaged (because the decoy system is not installed in the outer volume — see below).\nThere will be two pre-boot authentication passwords — one for the hidden system and the other for the decoy system. If you want to start the hidden system, you simply enter the password for the hidden system in the VeraCrypt Boot Loader screen (which appears after you turn on or restart your computer). Likewise, if you want to start the decoy system (for example, when asked to do so by an adversary), you just enter the password for the decoy system in the VeraCrypt Boot Loader screen.\"\n",
				"added": 1561128155
			}
		],
		"1563546340_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 35,
				"body": "> [561984](#comment_10_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1): Thank you, this is much appreciated. Too bad that it doesn't support Libreboot though...\n\nUnfortunately, QubesOS requirements (SLAT, IOMMU) isn't supported on laptops where Intel ME can be completely deactivated, which is why libreboot doesn't support that hardware (and retracted from supporting the x220 for the same reasons.)\n\nLibreboot is a Coreboot distribution, providing FSP free hardware initialization. \nCoreboot also followed that path, but is platform dependent since most of its platform supported requires FSP binaries.\n\nThe X230 hardware initialization is binary blob free. And [Intel ME is neutered](https://github.com/osresearch/heads-wiki/blob/master/Clean-the-ME-firmware.md), not deactivated. \n\n[RYF debate for those models was relaunched with FSF](https://github.com/osresearch/heads/issues/540#issuecomment-502154137) I'll inject time in that important matter.",
				"added": 1563889169
			}
		],
		"1564689117_1A4B6vo5EbmJtnNEkRxoWuG2t9PGHqLFc9": [
			{
				"comment_id": 36,
				"body": "I would point you to [e.foundation](https://e.foundation/), more specifically for models n700 i9300 and i9305, useable now, while  [completely freed midas platforms](https://nlnet.nl/project/ReplicantUpdate/) will be available in the next year by [resumed Replicant ongoing work](https://redmine.replicant.us/projects/replicant/wiki/Porting_Replicant_to_Android_9/#LineageOS-16). \n\ne.foundation continue supporting/mainstreaming LineageOS 14.1 (AndroidOS) supported phones (LineageOS dropped support on their side for image distribution and OTA updates), through [LineageOS for microg](https://lineage.microg.org/), while providing open source software alternatives and open source services based on those. Just like Puri.sm, but on older, freer, well supported and even reversed platforms that [are more open and freer](https://blog.forkwhiletrue.me/posts/an-almost-fully-libre-galaxy-s3/) then newer ones.\n\n\nWrote a blog post [here on my ongoing experiments on the N1700](http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:27:Experiments+on+the+Note+II+(N7100+[codename+t03g],+still+maintained+LineageOS+14.1+for+MicroG+by+e.foundation!!!)\n\nPuri.sm online services are nice. My personal preference, which i'm pushing forward here, is having reversed hardware that is completely freed, until completely open source hardware platforms are really developed. But until the radio itself is freed, don't be blunt. Open source software doesn't mean open source(d)/reversed hardware. And that hardware.... runs software, too.\n\n[SS7 telecommunication system is the real enemy anyway](https://arstechnica.com/features/2019/04/fully-compromised-comms-how-industry-influence-at-the-fcc-risks-our-digital-security/). So unless you only use wifi for calls/textos and geolocalization services without tower information, your privacy/confidentiality/integrity will always be at risk.\n\n[Watch this CBC, Canadian documentary on SS7 International Cellular Network](https://www.youtube.com/watch?v=I_wL0V8ScPw) ( Click setting, CC, then autotranslate and choose your langage). \n\nAnybody trying to reduce the problem to software gets completely off track of the real problems.\n\n",
				"added": 1564862093
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 37,
				"body": "@r3naam3r\nNice opportunity for me to point you to my [blog](http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/) and indirectly, to my company.\n\nUntil we have Power9 based laptops, supported by QubesOS, older, reversed x86 platforms are the best thing currently available. Do it yourself or buy it from me. While work is done to free more platforms and design new the correct way.",
				"added": 1565023637
			},
			{
				"comment_id": 38,
				"body": "@r3naam3r I would love, again, to insist that physical killswiches are nice to have, while not completely required if hardware is properly isolated and generally give a false belief of security.\n\nIf a camera is stuck in a compatment that isolates all usb devices (sys-usb under QubesOS), while the mic is isolated to the hypervisor (dom0/AdminVM), then those devices are readily available while requiring the user to assign those devices manually to the compartment they want to use them, otherwise, they do not exist for that compartment. Dom0 and sys-usb do not have network access.\n\nA physical switch, IMHO, is worse. It gives a false sense of security and are often forgotten in the connected state. If you create a qube designed exclusively for videoconferencing and shut down that compartment when done, then the mic and camera will get back to where they belong.\n\nThe other compartments will never have access to those devices. While having a physical switch, forgotten would compromise all your use cases, by the lack of compartmentalization of your digital life.",
				"added": 1565024100
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_786_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Kill switches for speakers too. [...]\n\n[CBC produced documentary on SS7 and snooping  that can be made remotely. Capturing/modifying SMS, tracking your every moves while listening to your conversations without a single warrant](https://www.youtube.com/watch?v=I_wL0V8ScPw). Hit settings, CC, then auto-translate in your language.\n\n[Here an article on why USA and all other countries won't fix those SS7 vulnerabilities](https://arstechnica.com/features/2019/04/fully-compromised-comms-how-industry-influence-at-the-fcc-risks-our-digital-security/)",
				"added": 1565024307
			},
			{
				"comment_id": 40,
				"body": "> [nickwa](#comment_171_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): There are open source CPU manufacturers, but they are not that great performance wise.\n\n[That is not true. Raptor engineering with their BlackBird and Talos II platforms are real, existing, x86 outperforming platforms.](https://www.raptorcs.com/)\nThey exist and are quite accessible, here and now. [IBM Power9 is not supported by QubesOS as of right now.](https://github.com/QubesOS/qubes-issues/issues/4318)",
				"added": 1565024529
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 41,
				"body": "I don't get your point. \nConfidentiality, Accessibility and integrity are not exclusive concepts, but complementary.\n\nConfidentiality, including privacy, is mostly designed in ZeroNet, where the transport can be done through hidden tor services exclusively, while identity is necessary for accountability. You want to know what I've said through a persona, you can search me and find me. Else you want complete anonymity without accountability, which permits spamming and destroy quality of information. Meanwhile, you can create unlimited number of persona if you like. I do not see any problem there. Can you point me to them?\n\nhttps://www.whonix.org/wiki/ZeroNet\n\n",
				"added": 1565376512
			},
			{
				"comment_id": 42,
				"body": "And I would ask in return: What would fit your vision, instead of pointing what doesn't work?\nConstructivism creates. This doesn't.",
				"added": 1565376605
			},
			{
				"comment_id": 43,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_729_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you need to destroy first, 'then you can create'you can't 'create on bad basis'are you willing to contribute to 'my piece of work' [...]\n\nWe destroyed things over and over. Ancient civilizations over ancient civilizations.\nNow we are here. We haven't learned. The cause is simple: as humans, we forget and believe. Faith.\nFrom laziness. From wanted shortcuts. We think we can do things better. While not learning from past mistakes.\n\nWe are amnesiac, thinking we are wiser then the future generation we put there, and more knowledgeable then the past generations. Yet we do the same things over and over. Both individually and collectively. Why? Because we are egoistic.\n\nDestoying everything would just contribute to that, not resolve it. Open source offers the possibility of building upon what works bests, if not rotten deep down in the roots.\n\nTake what worked, recreate from scratch what didn't. That's the spirit of it.\n\nConstructivism. Not nihilism.\nLike gardeners and life keepers.\nPlant a seed. Watch it grow. Give it love. Repeat.",
				"added": 1565381844
			}
		],
		"1568064692_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 44,
				"body": "> [caryoscelus](#comment_231_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): (most likely) It's not working properly because there are more people who want to use it than resources. It's working somewhat better than 0net.io, though\nIt's not working at all. \"! Connection with UiServer Websocket was lost. Reconnecting...\"",
				"added": 1568486676
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 45,
				"body": "> [asdflkjejaj](#comment_1_1QDqBTPDpyWsGq2dvDmbxCB8KhXvdPXxZR): http://zerocat.org/\n\nhttps://insurgo.ca :)",
				"added": 1586656900
			}
		],
		"1604219688_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 46,
				"body": "http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:13:Decentralized+WikiLeaks/SecureDrop+probable+platforms+",
				"added": 1604620906
			}
		],
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 47,
				"body": "That girl died, by the way.",
				"added": 1609698753
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 48,
				"body": "> [driud2](#comment_1_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Właśnie o to im chodziło, zabić niezależną komunikację. To użytkownicy są sami sobie winni. Bo nie potrafili uszanować tego co mają. Teraz jest właśnie egzamin dla pozostałych, klientów ZeroNeta? Tak długo jak jeszcze są włączone komputery, To Zero żyje. Może jeszcze powstać jak Feniks z popiołów, i wzlecieć w powietrze. To od reszty użytkowników zależy, czy Gady znowu odtrąbią sukces. Pozdrawiam.............................................................................That's what they wanted, to kill independent communication. The users are to blame. Because they couldn't respect what they had. Now there's an exam for the other ZeroNet clients? As long as the computers are still on, zero lives. He may yet rise like a phoenix from the ashes, and fly into the air. It's up to the rest of the users if the reptiles are going to succeed again. Greetings.\n\nMore complicated then that. Protocols evolves, dependencies too. We are now stuck to specific versions, which will become obsolete and vulnerable. Forking is the solution.",
				"added": 1625007989
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 49,
				"body": "Thank you guys for doing this!!!!!!!! Sooooo much! I love ZeroNet. And ZeroNet should thrive. It would be sad it dies prior of massive adoption....",
				"added": 1636123802
			},
			{
				"comment_id": 50,
				"body": "@geekless: Safe way to upgrade from HelloZeronet and test this?\nTesting through QubesOS is making this easy to revert/test after having followed http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:9\n\nSo I should just :\ngit remote add zeronet-enhanced https://github.com/zeronet-enhanced/ZeroNet/\ngit checkout zeronet-enhanced/master\ngit reset --hard\npython3 -m pip install -r requirements.txt\npython3 zeronet.py",
				"added": 1636125905
			},
			{
				"comment_id": 51,
				"body": "> [insurgo](#comment_50_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): @geekless: Safe way to upgrade from HelloZeronet and test this?Testing through QubesOS is making this easy to revert/test after having followed http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:9 [...]\n\nThe above give a bunch of errors! Is there an upgrade path to move away to this branch? Where is that documented please?",
				"added": 1636127729
			},
			{
				"comment_id": 52,
				"body": "> [ssdifnskdjfnsdjk](#comment_1126_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @geekless When i open that github repo, the default branch is plugins, which is confusing. Can you make default the massive-rework ? Maybe i want too much, but can be good if there is some release from time to time and README links to tar.gz updated to match this repo, not nofish's.These things and also updated README instruction how to git clone and keep the clone in sync with repo may prevent noob people using your updated ZN version @geeklessOffcourse, the new v3 updater zite would be big advantage. [...]\n\nTrace of attempt of using the new @geekless massive-rework branch:\nhttps://pastebin.com/AWBfyiGA\n\n\n\n\n",
				"added": 1636127779
			},
			{
				"comment_id": 54,
				"body": "> [insurgo](#comment_52_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Note that i'm under QubesOS with http://127.0.0.1:43110/1DMb3CV66qZPwJqkgm4z12nu8BrAwDoD4g/?Post:9 applied and config working for mainstream ZeroNet to always go through sys-whonix (tor). [...]\n\n@geekless: Advices? Comments?",
				"added": 1636133661
			},
			{
				"comment_id": 55,
				"body": "> [ssdifnskdjfnsdjk](#comment_1127_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @insurgo [...]\n\nThanks for the pointer. Moved data to pastebin and referenced",
				"added": 1636136232
			}
		]
	},
	"comment_vote": {
		"10_1AKTv64HemAWmM762raYNn8aeDNAoojaMd": 1,
		"9_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"32_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"34_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"14_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"9_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1,
		"67_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"23_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"287_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"50_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"10_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"10_1KcivDv72kAwXmY2Pqm3NbyzHWUgG835C8": 1,
		"2_1ETs6hUmZkWdUXBPwnPM33nMUboC56VA7y": 1,
		"1_1ETs6hUmZkWdUXBPwnPM33nMUboC56VA7y": 1,
		"9_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"31_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"29_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"28_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"30_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"32_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"291_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"7_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"10_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1": 1,
		"36_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"521_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"786_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"23_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"41_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"973_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"8_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes": 1,
		"4_1APPNBNF1oxMipeD7mZswXvwtgFLvQoZ2D": 1,
		"22_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"46_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"657_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1048_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"3120_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1126_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"321_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}