{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"1621828480_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"1621843317_1C9uMp36YAt8RV6cf9jPoarY7LPnnzSZ4h": 1,
		"1623654807_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": 1,
		"1624862334_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1625357458_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 1,
				"body": "Why would you not want to be vaccinated? The vaccines are safe and highly effective. Pfizer and Moderna are even effective against the two most common variants (British and South African). mRNA technology cannot modify your DNA as humans do not have the reverse transcriptase enzyme. No fetal cells were involved in the production of the COVID-19 vaccines, either.",
				"added": 1620673151
			}
		],
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 2,
				"body": "While I am a proponent of vaccination and have been vaccinated, the authoritarian measures being taken are deeply troubling. If criticism is not allowed, how will we ever know if something actually does start going really wrong? Regulatory colleges are even telling physicians what they can and cannot say in public and online about the lockdowns and vaccines.",
				"added": 1620673645
			}
		],
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "I'm on the extreme fascist right, almost certainly right of all of you. Yet, I still support and agree with vaccination. We should do everything possible to glorify and strengthen our people, and that includes rendering them invulnerable to all disease.",
				"added": 1621772730
			}
		],
		"1621828480_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 4,
				"body": "I doubt most of the regular commenters here have taken a statistics class, @calmdownholden. It's no wonder that anecdotal evidence coupled with the negativity cognitive bias rule their beliefs. Unfortunately, the credibility of the mainstream media is record low in the court of public opinion (and rightly so, given all that's happened in the past 10 years), so if the mainstream is being leveraged to get the word out on vaccination, they will automatically attempt to discredit that, even though it's a perfectly legitimate and scientifically backed idea.",
				"added": 1621858514
			}
		],
		"1621843317_1C9uMp36YAt8RV6cf9jPoarY7LPnnzSZ4h": [
			{
				"comment_id": 5,
				"body": "The best way to make an economy flourish is to ensure a high degree of order/low degree of crime. Why bother working hard when you can just steal? Why start a shop when it will be robbed? Why provide insurance to a business at a fair price if you know that business will be vandalized?\n\nAside from that, I think a massive public works campaign should be undertaken, similar to China, Singapore, or the Third Reich. Beautify and glorify your nation and its people by building them up and giving them something to be proud of. There's a reason most of the residents of those states continue to support/supported the governments despite their totalitarian nature.",
				"added": 1621858714
			}
		],
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 6,
				"body": "The best way to counter them would be to increase mobility and defederalize as much as possible, if we are still working within a democratic system. If states/jurisdictions could change virtually all the laws with little to no interference from the federal government, we'd see greater variability between states.\n\nIf mobility increased, people could vote with their feet and move to states that more closely aligned with their beliefs. If most of the people on the political right left places like California, leaving it to the leftists to manage, it would rapidly crumble without our productivity and their taxation of us.",
				"added": 1621858879
			}
		],
		"1625061096_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "This man deserves a seat on the Supreme Court.",
				"added": 1625146175
			}
		]
	},
	"comment_vote": {
		"5_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": 1,
		"6_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH": 1,
		"7_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH": 1,
		"8_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH": 1,
		"66_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"67_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"45_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"15_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH": 1,
		"46_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"70_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"69_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"64_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"63_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"59_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"2_1K1Y6kTYm7QXpmvbZiCAdzB5w7jCwBkird": 1,
		"52_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"68_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"15_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"48_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"4_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk": 1,
		"5_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5": 1
	}
}