{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1550822852,
			"title": "concept for decentralizing bitcoin mining without wasting energy",
			"body": "bitcoin could be used in a smart way to minimize energy wasting. Imagine a matured humanity: Every household has solar panels (and other ren. energy sources). Only if there is more energy than needed (or warm water is needed) the households mine bitcoins, which will heat the warm-water-tank. This way no energy is wasted and the network is secured in the most decentralized way. If bitcoins are only mined this way no energy get wasted ever - even better: it gets kind of conservated (in an abstract way) in bitcoins for the households.",
			"added": 1550822851
		}
	],
	"topic_vote": {
		"1550822852_1QDDk8ikEQbFpbnfhubtHLyBAZC9JHnrkX": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1550761507_1E6XbnEgJMBkFbxsd7i7yZWvMaQggchH1C": [
			{
				"comment_id": 1,
				"body": "it is the easiest way to host a small dynamic site (blog, gallery, etc.). If your content is good enough, you don't even need a 24/7 server, but even if not, a small board computer (like raspberry pi ) is enough. \nAlso it scales just fine, even if your content is so popular that millions want to see it, you never have to upgrade your server...\n\nit's the best hosting solution for \"normal\" people.",
				"added": 1550819476
			}
		],
		"1550822852_1QDDk8ikEQbFpbnfhubtHLyBAZC9JHnrkX": [
			{
				"comment_id": 2,
				"body": "> [grubas17](#comment_15_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV): but if everyone had bitcoin it would be worth nothing.\n\nin this scenario you can buy energy for it :)",
				"added": 1550823041
			},
			{
				"comment_id": 3,
				"body": "this is definitely a concept that would work, even if humanity is not ready for it, you could build a village like this to proof this concept and it would be beneficial for the people living there.",
				"added": 1550823618
			},
			{
				"comment_id": 4,
				"body": "combine this with mesh networking for households + zeronet node and you are prepared for the new earth...",
				"added": 1550826052
			},
			{
				"comment_id": 5,
				"body": "also: if the main currency for getting electrical energy would be bitcoin, noone would ever buy energy to mine bitcoin, because the price of bitcoin/energy would automatically scale that way, that it would alway be not profitable to mine bitcoin with bought energy. (noone would spend 1 bitcoin to mine 0.7 bitcoin)",
				"added": 1550832523
			},
			{
				"comment_id": 6,
				"body": "i am quite thrilled after combining all these thought, i always thought the proof-of-work concept of bitcoin is a flaw, but it seems it is a really cool feature to decentralize currency AND energy production and it will avoid energy wasting. i think this is the endgame scenario and the bitcoin revolution is inevitable. bitcoin is much more clever than i thought.",
				"added": 1550833034
			}
		]
	},
	"comment_vote": {
		"117_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1
	}
}