{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1555842771_16aEF8CgaUP162ktjtyUWXTNNUArKaPeHM": [
			{
				"comment_id": 1,
				"body": "Враждебную политику важно поддерживать самим политикам, но не людям. Это происходит для того, чтобы удерживать положение вещей таким, какое оно есть: власть, позиции, рейтинги и т.д.\n\nПолитикам нужна война, они очень боятся за свою власть. Всё их политическое влияние зависит от войн. Если войны исчезнут - политики исчезнут. Тогда правительство будет обыкновенной организацией, вроде почтового офиса или железнодорожной станции. У них будут определенные функции, но не будет власти. Война дает власть, поэтому политики не дадут войнам исчезнуть. Они продолжают говорить о мире и продолжают готовиться к войне. \n\nОбычным людям необходимо обратить своё внимание прежде всего на действия \"политиков у руля\", а не на военные действия, которые происходят между людьми, которых насильно заставляют это делать. Как говорил Джо Глентон: «Для меня было и остается честью отказаться от военной службы. Я обнаружил, что действительный враг — не тот, на кого ты направляешь оружие, а те, кто стоят за и над тобой и требуют от тебя нажимать на курок.»",
				"added": 1556104641
			}
		],
		"1564594845_1LmGWhPuBAMVqUo6wSsnkxFSE1dZkERN2G": [
			{
				"comment_id": 2,
				"body": "Теми завжди є. Людей нема :)",
				"added": 1564796465
			}
		],
		"1567548735_16iGKuwiVs9no6N8gTnn8y12TGMzvxDxEL": [
			{
				"comment_id": 3,
				"body": "А зачем? Хоть на английском, хоть на китайском. Вот что действительно интересно, так это то, могут ли конечные пользователи постить материалы в соответствующие языковые ветки? :D",
				"added": 1567587937
			}
		],
		"1581605319_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 4,
				"body": "Что с этим делать? Они сидят там и штампуют законы для собственного удобства. Это может растянуться во времени и меняться постепенно (под различными предлогами), но вектор у гос. верхушки всегда один и тот же: защита собственной задницы.\n\nВ этой \"новости\" нет ничего нового, потому что система одна и та же, что в РФ, что в UA. Поэтому ещё раз: что с этим делать?",
				"added": 1582567645
			}
		],
		"1629960976_1oApUGs4F9MSQsgCck3Ukj5X5kyLJQyhz": [
			{
				"comment_id": 5,
				"body": "Стан країни: тотальна дупа :D",
				"added": 1630183815
			}
		]
	},
	"comment_vote": {}
}