{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1570142685,
			"title": "Shitposting Advanced Faggotry Heil Hitler Aloha Snackbar",
			"body": "I think ZeroTalk should be a little more organized into subcategories like traditional forums, where special interests and shitposting can be tailored to people on places other than the MAIN FUCKING PAGE.",
			"added": 1570142684
		}
	],
	"topic_vote": {
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1569615886_1Cht2qsdTvLYZq12erudxjk3W68p7KUAL5": 1,
		"1569227990_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570831985_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1570819630_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6": 1,
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 1,
				"body": "Interesting opinion. What evidence do you have to substantiate your claims? You're discussing elements of two forms of government in the exact same statement. But to gain a grasp on what you are saying, what are you using as an example? The United States? Norway? Canada? Australia?\n\nI live in the United Sates, so why don't I use it as a starting point. The United States is not a democracy at all (thank God), it is a Representative Republic, with a Constitution as the foundation of law for the elected representatives. A democracy differs from this in that typically consists of Universal Suffrage, or a similar situation in which a popular vote alone determines the direction of the law. (i.e. Majority Rule). Norway currently ranks the highest as a pure democracy.\n\nIn a situation like The United States at its founding, individuals were granted the greatest of freedoms to pursue the life they wanted, however with the greatest of personal responsibilities. The first is vigilance. The founders of the US understood human nature well enough to know that when your elected officials become corrupt, it is the duty of the citizenry to remove them from office by force (usually by adding a substantial amount of LEAD to their diet). If you are an american, you are personally responsible to know and understand the Constitution, and to defend it with fatal force from anybody who challenges the sanctity of it. The second is that you are on your own. There are no guarantees. Government does not exist to help people. Period. There is no universal health care, housing, public education, socialist security... Nothing.\n\nThe most important factor in this original form of the US Republic was that the population was a moral and religious people, deeply rooted in their faith. A key factor in how people conduct themselves personally and publicly. In fact, John Adams exact quote to the militia was \"Our Constitution was made only for a moral and religious People. It is wholly inadequate to the government of any other.\"\n\nIn all of these responsibilities, the People of The United States of America have failed. Completely. We have traded our freedom for security and as we deserve, shall soon lose both. The only way to gain anything back is to repent, and then to war against our own representatives. Which will never happen.\n\nThis certainly doesn't answer everything you suggested, but does it shed some insight? I would ask, why do you feel that democracy is bad? What alternative would you have? And what are your motivating factors for suggesting? Are you yourself a Christian, and regardless of that key point, do you understand how deeply the religion of a nation as a whole impacts the government at all levels from local, state, federal?",
				"added": 1569539262
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_14_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Well said. Economically, taxation is used to discourage a behavior or habit; patriotism in this case. Why not pay for use? I can't help but agree that UBI appears to be flooding the money supply, but a flood requires an original source of money. Treasuries increase the money supply to maintain value, this is not a flood, it is a transfer payment. A tax on the extraordinarily wealthy for the subsistence of the numerous poor.\n\nExcellent analysis. Dependence on a central currency has enslaved the common man into obedience. Women have become the hardest hit victims here. As a child I recall it was still possible for one man at nearly all income levels to provide enough at 40 hours a week to feed the family. Women had much more freedom to raise the family and interact socially back then. Now with the choking corporate and governmental greed in the US, and the self-serving individualistic lies and promises of \"liberation\" for women, they have to work just as hard for half as much and still fall short. Which leads to another sector of the enslavement. Make everyone focus solely on themselves. Divide all by race, gender, color, etc... Make every human under your control think they are the center of the universe.",
				"added": 1569549790
			}
		],
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 2,
				"body": "If you have a cancer, or anther deadly disease, you quarantine it... then dispose of it properly.\n\nIslam is the purest, most undiluted form of devil worship in the world. Second only to Talmudic False Judaism.",
				"added": 1569541260
			},
			{
				"comment_id": 3,
				"body": "On a less civil, and more personal note I might add,  it's about fuckin time India paid back those filthy swine.",
				"added": 1569541513
			},
			{
				"comment_id": 4,
				"body": "> [kasgjwogksdojgsk](#comment_2_15uXDCC8pjPpGGMz8DZiNC2mPyqBWN2wuj): Pro-tip: If you're from a country that's been at odds with the country you're living in, and part of a religion that's been at odds with the majority population of the country you're living in... move.\n\nPro-tip: Running away only prolongs the inevitable. Violence stops violence.",
				"added": 1569541941
			}
		],
		"1569615886_1Cht2qsdTvLYZq12erudxjk3W68p7KUAL5": [
			{
				"comment_id": 6,
				"body": "Zerodium is known to acquire and sell exploits.\n\nOr Search The Onion - http://xmh57jrzrnw6insl.onion/\nhttp://zqktlwi4i34kbat3.onion/wiki/index.php/Main_Page\nhttp://torlinkbgs6aabns.onion/\nhttp://wiki5kauuihowqi5.onion/",
				"added": 1569628140
			},
			{
				"comment_id": 7,
				"body": "> [haxhax](#comment_1_1Cht2qsdTvLYZq12erudxjk3W68p7KUAL5): Frankly it was just to prove a point to a friend, that \"No, it is not as easy as you think to hack into someone's facebook account and the easier things would involve social engineering. And even if someone had a miracle backdoor, it would most likely cost a shit ton money\" Anyway thanks for the heads-up captain, it's always nice having someone take of their time answering a question, as silly as it is ;) Have a nice day/evening/morning/night\n\nlol. It's nice to see some people are still born with brains. Yeah, your friend is probably gonna have a hard time. The only reliable way I can think of to break into a Facebook account would be to kknow the person and have physical access to their device.\n\nStarting a zero on a stranger, or someone far away would be very difficult, though not impossible.",
				"added": 1569636088
			}
		],
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 8,
				"body": "Uhh, anyone in Iowa wanna sell a stationary bike? lol\n\nXD",
				"added": 1569636308
			}
		],
		"1569227990_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_1055_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Do you ever enjoy a black person who isn't stereotypical? One that talks like you and has common interests? Holds a job? Doesn't listen to trashy rap music but likes rock, electronic or country music? Doesn't think that just because a politician is a Democrat that they're automatically a black people saviour? Maybe ones that agree with you that discrimination is quite well in the past? [...]\n\nAbsolutely. I've had several black friends who aren't retarded. It's actually quite refreshing, if... EXTREMELY rare. As a general rule I find it's best to stay out of other cultures' affairs. I wasn't born racist. I had to learn reality the hard way when my mother's lies started falling apart. lol",
				"added": 1569636670
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_1089_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Racists started it by denying then education, so being ignorant became part of their culture.\n\nOn the contrary, my friend. These people have existed the same way as they do now since the beginning of time. They keep themselves ignorant. They worship devils. They slaughter, fuck, slaughter, fuck, don't rinse and then repeat.\n\nThose hypocrites have owned slaves since the beginning of time, and guess what? They still own slaves today. Give me an example of one... and I mean JUST ONE black civilization that has created, built, or contributed any advancement to the world. I'll give you some examples:\n\n1. Slavery, Sex Slavery, Child Sex Slavery.\n2. AIDS.\n3. Mass murder.\n4. Cannibalism.\n5. Child Sacrifice.\n6. Huts made out of shit.\n\nBro, I'm all for lending support to those less fortunate, but sometimes a  situation speaks for itself. Deuteronomy Chapter 28. Niggers are the only people in the world that have matched the description... from beginning to today. They are the only cultures on Earth that have achieved absolutely nothing. They are a curse unto themselves.",
				"added": 1569638443
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 10,
				"body": "Here's an interesting question. I appear to be sharing/sending very little data, at least as far as I can tell. The main website of concern is ZeroUp Unlimited. I have a few favorites set to help grow and distribute. \n\nShould I open a port? I am not yet hosting any of my own sites, but does that functionality affect seeding and hosting content to other users from other sites?\n\nI use a VPN ALWAYS for Zero. Could this be affecting my share ratio, or is there really not that many interested people on the ZeroNet?",
				"added": 1569637084
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 11,
				"body": "Uhh... That's the essence of human nature dude. We interact with like minded people and reject those who ideas are antithetical to ours. We start learning this in kindergarten.\n\nThe problem would exist if a central self-appointed authority within ZeroNet was censoring opposing ideology in a manner which blocks other users from seeing and interacting with other users. But if you walk into a group of like 3 or 4 and preach to them what they don't want to hear, are you surprised when they go somewhere else, or tell you to get lost?\n\nIs there any evidence to suggest a central authority on ZeroTalk is censoring opposing ideology, and preventing users from having meaningful dialogue with other users? If so, you can always create a special interest site.",
				"added": 1569637681
			},
			{
				"comment_id": 13,
				"body": "> [moor](#comment_270_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): it appears as only humane but in the real world we can't block people who frequent the same place at the same time we do... we may avoid them but our senses can't be fooled, we have to consciously acknowledge them and be reminded about them and reflect on the conflict between them and yourself. [...]\n\nI agree. Very much so. In fact, it's one reason why I'm fond of ZeroNet and some of the other places coming into existence. I think the internet should return to its previous state, and that we shoud spend more time forcing ourselves to interact in the real world... Which, as I'm getting tired I think I just derailed... God damint, let's get a podcast going! lol\n\nSocial interaction is important. We should be kind to everyone, and show the love of Christ. But don't get taken for a ride.",
				"added": 1569638955
			},
			{
				"comment_id": 15,
				"body": "> [reichardnixon](#comment_16_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): I mute people because I can, this is about freedom right? The only people I have muted so far are glowniggers, spammers, and obscene content I dont want to see or get arrested for.\n\nLMFAO, WHAT THE FUCK IS A GLOWNIGGER?",
				"added": 1569983349
			},
			{
				"comment_id": 16,
				"body": "> [reichardnixon](#comment_17_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): glowniggerA governmental agent (FBI, NSA, CIA, ATF) making bait posts on forums and image boards to entrap individuals or gather intelligence. The purported goal of glowniggers is baiting potential criminals or gather intelligence about a particular online community to reveal their intentions or beliefs. [...]\n\nHahahahahahahahahahhahahaha. I should've known. Poor Terry. The guy just needed a friend. Yeah, I suppose, they have to gather intelligence somehow. Fuck em. They can keep this physical body. This machine. It's not coming with me, and I plan to live forever. They'll see soon enough. Every knee shall bow.",
				"added": 1569990665
			},
			{
				"comment_id": 17,
				"body": "> [communism](#comment_1_1H2vbwfU8uNoJycKemBDgyPdrzE3A36Fkc): The right are GENETICALLY inferior to the left. Who would want to listen to those sub-humans? Not me!\n\nGeorgia is in Florida! Dumbass...",
				"added": 1570011800
			}
		],
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Not bad. I think it's a great way to reach the general public about what's available. Very nice! Here's a rough draft of my first AltTech page!\n\nhttps://start.me/p/onPdO0/my-startpage",
				"added": 1569979783
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 18,
				"body": "It's a decent idea, but in practice it could cripple the system. You go one way and just take a look at RetroShare. Ever used it? It's like taking a shot in the dark at random people you may or may not know. It's an even gayer version of Utopia (which is still in Beta).\n\nThe flip side is majority rule over what sites are allowed. Look how well it worked out on the clearnet. WebOfTrust is nothing but a P.C. Police moderating system now.",
				"added": 1570142310
			}
		],
		"1570831985_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 19,
				"body": "Oh, Elon Musk's plan to create Synapse? lol",
				"added": 1570838374
			}
		],
		"1570819630_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6": [
			{
				"comment_id": 20,
				"body": "> [fartknocker2](#comment_2_13QbbhnMswrQegz1Agti6jAp2os3QaS5iM): Seeded (x2 instances)\n\nConfirmed.",
				"added": 1570838615
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 21,
				"body": "There's fags, chomos, liberals, and all kinds of shit to hate. But usually every seems to veer off into their own groups, which is good. That's how the internet USED to work.\n\nBut really, I think people are lazy and uninterested. There's not a lot of demand for a self-hosted internet because normal people are cattle with mashed potatoes for brains, philosophies, work ethics, and dedication. Instant gratification. Who the hell would take the time to host ZeroNet, save us humble few?",
				"added": 1572112587
			}
		]
	},
	"comment_vote": {
		"80_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"23_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"14_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1_1Cht2qsdTvLYZq12erudxjk3W68p7KUAL5": 1,
		"1_1HypovbW2hhBviPEwGu68YiEG46YA7zwZ1": 1,
		"1055_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"270_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"17_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1
	}
}