{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "cloner un site web sur zeronet ",
			"body": "Salut. \nJ'ai déjà héberger des sites sur mon serveur perso, mais comment les cloner sur zeronet ? quelqu'un a une idée ?",
			"added": 1481391950
		},
		{
			"topic_id": 2,
			"title": "Pourquoi l'option \"cloner\" n'apparait pas ?",
			"body": "Salut,\nPourquoi dans la liste des sites qu'on est en train de seeders, si je fais un clique droit l'option cloner n'est pas disponible pour certains sites mais est bien présente pour d'autres ?\nEt je me demandais aussi quelle manip faisait cette action autre que juste copier les fichiers. Est-ce que par exemple il modifierait automatiquement quelle que chose pour que ça soit bien notre site et qu'il ne correspondent plus à l'adresse du site d'origine ?",
			"added": 1484094906
		},
		{
			"topic_id": 3,
			"title": "petite astuce comment regarder des vidéos de youtube (et autres sites) sans utiliser javascript",
			"body": "Comme certains d'entre vous le savent, un des gros problèmes lorsque vous naviguez est l'utilisation des scripts java qui sont non-libres. Il existe des addons comme NoScript ou LibreJS, mais de nombreux sites ne fonctionnent plus avec leur utilisation: c'est le cas de youtube.\nAlors comment continuer à se perdre sur youtube de façon à ne pas utiliser de script java non libre ? et bien j'ai une astuce plutôt simple.\n\nnécéssite linux, un terminal (en tant qu'utilisateur, pas besoin de root), le paquet mpv et pourquoi pas tor.\nCertains s'embête à utiliser youtube-dl puis supprime la vidéo télé-chargé une fois vu.\nCe que je fais maintenant est bien plus  simple : je copie l'adresse de la vidéo et je tape mpv \"adresse\" (sans guillement) dans un terminal. le lecteur vidéo mpv s'ouvrira en lisant la vidéo en streaming (sans téléchargement direct comme youtube-dl).\nVous pouvez même tapez d'abord  \". torsocks on\" pour lire la vidéo en passant par tor.\n\nVoilà j'espère que ça vous sera utile.",
			"added": 1485565202
		}
	],
	"topic_vote": {
		"2_152kdpXWPevMLNm7755GKuzQPsu71bs13t": 1,
		"5_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": 1,
		"1_1JDqkJrKnMkfQm3t4sygbSq2yc6arFfxCw": 1,
		"1_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1,
		"8_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": 1,
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": 1,
		"2_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1_1JDqkJrKnMkfQm3t4sygbSq2yc6arFfxCw": [
			{
				"comment_id": 1,
				"body": "pas besoin de vpn ni de tor pour télécharger des torrents, ensuite c'est pas que je vous le déconseille, mais c'est juste inutile. De plus pour trouver un vrai vpn c'est toujours la galère. Ce qu'il faudrait ça serait d'avoir un ami dans un autre pays (préférablement hors de l'UE et des \"9 yeux\", comme au Laos par exemple) et qu'il monte un serveur chez lui en vous donnant un accès ssh pour que vous pussiez y installer votre vpn et avoir un contrôle total de son fonctionnement. Il n'y aucun moyen de vérifier si le vpn que vous utilisez en ayant loué un accès par mois respectent ce qu'ils disent, comme le no logging par exemple (d'ailleurs en france tout les hébergeurs qui utilisent un data center sont obligés de logger...).Si vous voulez vraiment louer un vpn, payez en bitcoin avec tor (si l'hébergeur ne vous laisse pas le choix de payer en bitcoin c'est que ces vpn sont sûrement de la merde)   Sinon en France c'est Hadopi qui peut soûler, mais il n'y a rien à craindre de son coté. https://www.fier-panda.fr/article/hadopi. \nPour contrer la disparition de tous ces sites de torrents qui se font fermer zeronet est plutôt pas mal, mais il est encore très jeune.\n\nTLDR:  hadopi sert à rien, et de toute façon la plupart des vpn sur internet c'est de la merde. ZeroNet est pas mal mais encore trop jeune pour contrer la fermeture des sites de torrents.",
				"added": 1481391533
			}
		],
		"2_152kdpXWPevMLNm7755GKuzQPsu71bs13t": [
			{
				"comment_id": 2,
				"body": "c'est quoi pleer ?",
				"added": 1481391657
			}
		],
		"8_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 3,
				"body": "si torrent9.biz ferme, au moins tout les liens qui ont été clonés sur ton site resteront là.",
				"added": 1481392478
			}
		],
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 4,
				"body": "\n> Moi je m'en fou des problemes de la France. Mais vous devriez arreter de vous sauver. Les francais devraient rester en france et regler leurs probleme au lieu de venir ici et reproduire leurs attitudes de merde. On a pas de surplus pour aider les imigrants ici meme si ils pretendent etre nos cousins. J'en ai rien a foutre.\n\nExactement. \nLes Français devraient régler leurs problèmes chez eux, plutôt que de les emporter dans un autre pays. Comme chaque immigré qui vient en France en fait.\n\n",
				"added": 1482916084
			}
		],
		"2_1oMXqv6LN67F2aFKqm6hyBY3G2kt1SnEu": [
			{
				"comment_id": 5,
				"body": "Si un site zeronet ferme, tout les anciens seeders peuvent le recréer en le clonant. ",
				"added": 1483993942
			}
		],
		"6_152kdpXWPevMLNm7755GKuzQPsu71bs13t": [
			{
				"comment_id": 6,
				"body": "Les banques aussi utilisent des ordis qui sécurisent les transactions bancaires. Ce n'est pas sépcifique au bitcoin, toute les monnaies dématérialisée sont comme ça. Le bitcoin c'est pas fictif ça existe. Fictif ça veut dire imaginaire.",
				"added": 1483994200
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 7,
				"body": "> [zeptik](#comment_5_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY): http://pleer.net/\n> Ça (re)fonctionne et stop le drama chaque fois qu'un site se fait donne SVP c'est pathétique ! On ne peut RIEN supprimer d'internet.\n\nQu'est-ce qu'il faut pas entendre....\nBien sur que si on peut supprimer des choses d'internet.D'ailleurs chaque seconde plein de contenu est supprimé,censuré,perdu...",
				"added": 1483994421
			},
			{
				"comment_id": 9,
				"body": "> [zeptik](#comment_12_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY): MDR genre ? Parce que la mode est plus au \"tout sauvegarder\" que tout supprimer... Censurer ne veut pas dire supprimer ni même inaccessible, changes tes DNS ou passe par tor et ose me dire qu'on peut te censurer un site... De toute façon même si un site est down => on change l'hébergeur et c'est repartis (regarde zone-telechargement, wawa & co !)\n\nLa mode de sauvegarder c'est  peut-être 0,1% des utilisateurs, et peut-être 5% des hébergeurs de sites. \nPar exemple quand tu regardes une vidéo youtube qui peut sensiblement être censuré/retiré/supprimé pour x raisons, très peu vont penser à la sauvegarder chez soi au cas où. Les uploaders sur youtube ne pense  pas toujours (et ce sont des imbéciles, mais il y en a beaucoup) à garder une copie chez eux après avoir mis leur vidéo sur youtube.\nMais youtube n'est qu'un exemple: tout les forums qui ont des modérateurs ont des millions de posts supprimés.\nPar rapport à la censure avec les DNS je ne parlais pas de cette technique, mais plutôt de la police qui débarque chez l'hébergeur du contenu. Dans ce cas là tes backups t'a intérêt à pas les avoir chez toi mais dans une grotte inconnue de tous et même d'avoir oublié où tu les as planqué en espérant qu'un gars cool les trouvent par hasard parce qu'ils te feront cracher le morceau d'une façon ou d'une autre si l'affaire est sérieuse.",
				"added": 1484096126
			},
			{
				"comment_id": 10,
				"body": "> [zeptik](#comment_17_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY):  !En vrai oui on peut supprimer certains contenu spécifiques et useless, mais un truc qui DOIT rester en ligne le reste ;)\n\nD'accord sur ce point.\n",
				"added": 1484135801
			}
		],
		"4_152kdpXWPevMLNm7755GKuzQPsu71bs13t": [
			{
				"comment_id": 8,
				"body": "utilise youtube-dl, pourquoi tu t'emmerdes avec un site tiers ?\nSinon il existe une interface graphique pour youtube-dl\nhttps://mrs0m30n3.github.io/youtube-dl-gui/#downloads\n\narrête de pleurnicher, ça va bien se passer.",
				"added": 1483994871
			},
			{
				"comment_id": 11,
				"body": "> [greatsick](#comment_10_152kdpXWPevMLNm7755GKuzQPsu71bs13t): ZeroFreedom Tu Sait Depuis Ce Changement J'utilise à Moitier KeepVid Mais Je Peut Utiliser Youtube-DL Mais A Condition qui Prend en Charge Les  480 et 1080 Comme ClipConverter Il Sont Souvent Ignorer Car Ya Pas de Son\n\nEn ligne de commande:\nyoutube-dl -F    \"url\"\nça t'affichera tout les formats supportés de la vidéo avec un chiffre pour chaque format\nyoutube-dl -f \"chiffre du format\" \"url\"\n\nAttention en général le son et vidéo est séparé, pour avoir les deux:\nyoutube-dl -f \"chiffre format vidéo\"+\"chiffre format son\" \"url\"\nça donne par exemple\nyoutube-dl -f 247+251 https://youtube.com/nimportequoi\n\nSi tu veux utiliser youtube-dl avec tor, fait cette commande avant de l'utiliser\n . torsocks on\n\nKeepVid dsl mais ça pue la merde, si tu veux vraiment utiliser une interface graphique installe ça.\nAu moins c'est libre.\nhttps://www.4kdownload.com/fr/products/product-videodownloader\n",
				"added": 1484428590
			}
		],
		"1_1ELqWR9VHttv1e5es9e5H5gRnpiqUZ6h5k": [
			{
				"comment_id": 12,
				"body": "Faudrait surtout convertir tout les liens de téléchargements direct en magnet. C'est déjà le premier travail à faire. Je me demande si créer un script qui fait ça automatiquement ne serait pas possible ? le problème c'est que je crois bien qu'il y a des temps à attendre entre chaque téléchargements (ça fait des années que j'ai pas utilisé zone-téléchargement)",
				"added": 1484927497
			},
			{
				"comment_id": 15,
				"body": "> [mailman](#comment_4_13KjVHdVXjiMLMcN1RMhaRPDFFXRotVzsK): Bonsoir, il vaut mieux prendre un compte Alldebrid ou RealDebrid, comme ça il n'yaura pas de temps d'attente pour récupérer le contenu par téléchargement direct ;)\n\nJe me souviens qu'on peut utiliser des partages de comptes qui sont à la base payant mais qu'on peut alors utiliser gratuitement. Pour syncro les torrents entre la copie zeronet et le site d'origine ça peut-être pas mal.",
				"added": 1485385108
			}
		],
		"2_1pGdkP4RBt8QW66TEBLLY3124RzVw4mSg": [
			{
				"comment_id": 13,
				"body": "ça dépend par rapport à qui tu souhaite être anonyme.\nÀ ton voisin qui pourrait surveiller ton réseau ?\nAux autres peers de zeronet?\nÀ ton FAI ?\nÀ un état ou multinationale milliardaire qui est capable de dépenser des millions juste pour te retrouver si tu leur pose problème  ?\n\n\nJe vais essayer de décrire la méthode pour contrer la surveillance d'un état ou multinationale, qui est le plus haut niveau et malheuresement le plus chiant.\n\nTLDR disponible à la fin\n\nUtiliser linux avec uniquement des logiciels libre et relativement connu (donc ayant 100x moins de problèmes de sécurités que les logiciels propriétaires), utilise tor avec tor browser (tu peux utiliser tor avec firefox mais il faut désactiver pas mal de variables qui présentent un risque, tor browser est déjà configuré comme il faut).\n\nAu mieux ne te connecte jamais depuis chez toi mais toujours depuis la rue dans un endroit sans caméra (et ni sur le chemin) sur un réseau wifi dont tu n'as normalement pas accès (bien sur l'adresse mac de ton interface réseau  doit être changé aléatoirement à chaque connexion).\n\nQuand tu écris ou poste quelque chose sur internet vérifie qu'il n'y aucun moyen de faire le lien avec ta vie en dehors d'internet.\n\nCe qui est cool avec zeronet, puisque tu uploades les sites tu peux regarder au niveau des scripts java: ont peut donc les considérer comme open source. Il faudrait que les gens commemcent à vérifier les scripts java des sites zeronet comme ont fait avec les logiciels open source. Ont pourrait alors être certain (ou presque, une erreur peut toujours passer inaperçu) que le site n'utilise pas javascript pour essayer de trouver ta vraie identité.\n\nN'utilise pas de VPN loué: tu n'as pas accès à leur configuration donc aucun moyen de savoir si c'est sécurisé ou s'ils enregistrent quelque chose. La seule exception à ça c'est les loueurs de vpn qui acceptent le payment en bitcoin (les payements bancaire nécéssitent ta vraie identité sauf compte volé) et dont tu as accès à leur vps (virtual private host) en ssh. Mais c'est toujours pas génial parce qu'ils quand même un contrôle total.\nLe meilleur vpn à utiliséer est celui dans la situation suivante:\n- choisir un pays qui possède des FAI qui ne partagent pas les données de leur client aux autres pays. Pour en être certain il faut y travailler ou connaître quelqu'un qui y travaille et à qui on peut faire confiance. Ou réussir à avoir un accès à leur réseau d'entreprise et de voir ce qu'il s'y trouve.\n- installer un nano-ordinateur avec système chiffré à la racine (au cas où il serait pas assez bien planqué )pour s'en servir comme vpn et le planquer à un endroit avec accès internet. La personne qui possède l'abonnement de cet accès internet ne doit pas vous connaître ni connaître l'existance de cet appareil pirate. \nIl faut répéter ce processus une deuxième fois dans un autre pays avec fai ne partageant pas leur données (explication de pourqoui plus bas).\n-Ensuite ZeroNet peut-être installé en remote host, cad connecté à distance comme un proxy. Il y en a sur internet http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies ou tu peux t'en faire un toi-même (il y aura un mot de passe que tu peux choisir) si tu souhaites uploader toi-même les sites que tu visites (sinon ça serait le proxy choisi sur internet qui pourrait disparaître).\n\nPourquoi utiliser un vpn chez un fai ne partageant pas ses données ? imagine la situation suivante:\nhome -> vpn -> tor -> site web\nle fai sait que home se connecte à vpn. vpn sait que home se connecte à tor, point de sortie sait que quelqu'un se connecte à site.\nA priori tout va bien. Mais c'est une erreur de penser ça à cause du fait que si les FAI de home, vpn, utilisateur de tor peuvent se partagent leurs données (ou pire si c'est le même pour tous) ils peuvent retrouver l'identité de celui qui s'est connecté au site web en regardant les temps de connexion: si home s'est connecté au vpn à 18h00:00 et que vpn s'est connecté à tor onion 1 à 18h00:05 et que onion 1 s'est connecté à onion 2 à 18h00:7 et que onion 2 s'est connecté à onion sortie à 18h00:9 et que onion sortie st'est connécté à site web à 18h00:12, les fai peuvent par algorithme déterminer qui est à l'rigine de cette connexion. Il y a alors deux moyens de contrer ça:\nutiliser plusieurs fai différents ne se partageant pas leurs connexions (ou au mieux n'ayant pas de connexions enregistrés, il y en a eu un en France mais il s'est fait vite fermé par l'état), ou alors le fait qu'il y ait tellement de connexions en même temps à ces points que les algorithmes ne soient pas assez précis. On peut aussi retarder les connexions avec le vpn, mais forcément déjà que c'est lent avec to ça sera encore plus chiant.\n\nIl faut obligatoirement 2 vpn dans deux pays différents avec \"bon\" fai pour la raison suivante:\nSi tout fai se partagent sauf celui du pays où est installé le vpn, ils sauront qui se connecte si ce dernier se connecte à une adresse dans un pays avec fai partageant.\n\nTLDR;\nEn gros le plan: \n\naccès internet avec abonné sans lien avec vous  +sans caméra -> vpn dans pays sans fai partageant données ->  2 ème vpn dans un autre pays avec fai sans partage de données ->tor -> proxy zeronet -> tor -> site zeronet.\n\n\n",
				"added": 1485357420
			},
			{
				"comment_id": 14,
				"body": "si tu veux me parler pour avoir plus de détails/conseils tu peux me contacter par ZeroMail.",
				"added": 1485384814
			}
		],
		"5_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 16,
				"body": "@zeptic  voici mon point de vue, il n'est pas compliqué à comprendre:\nAu lieu de venir jusqu'en France (pourquoi faire tout ce chemin et ne pas juste s'arrêter dans les pays voisins , ah peut-être pour des raisons économiques, c'est pas tout les pays qui offrent un système de sécurité sociale aussi avantageux qu' en France), pourquoi ils ne règlent pas les problèmes dans leur propre pays ?\nSi tu me dis bah oui c'est normal de venir dans un pays qui offre plus d'avantages, alors ce sont sont bien des immigrés économiques, et donc je n'ai pas à avoir de sympathie envers eux. \n\nSinon t'as entendue parler de l'Ukraine et de ces millions de réfugiés ? bah non parce que eux ils s'arrêtent dans les pays juste à côté et ils ne soulent personnes.\n\nLes immigrés je les soutiendrais le jour où ils prendront les armes et les pelles pour reconstruire leurs propres pays.\n\nEn attendant si je regarde ce que ça apporte à la France d'acceuillir des immigrés:\n- permet l'infiltration de \"terroristes\"  de daesh\n- vols, viols en masse\n- quartier sensible où la police n'ose même plus mettre les pieds. \n- des millions de personnes ne voulant pas s'intégrer, parce que l'état ne les pressent pas de le faire.Ça signifie qu'ils ne peuvent pas être fier d'être Français et de partager les même valeur parce qu'ils n'apprenent pas l'histoire du pays. En apprenan l'histoire de son pays on apprend à vouloir en faire quelque chose de mieux et à le défendre.\n- il faut les nourrir, héberger, chauffer...   augmente les impôts, comme s'il y en avait pas assez.\n\nBref ça m'arrange pas tout ça. \n\n\nSinon j'utilise GNU/Linux, Duckduckgo et searx, j'ai jamais eu la télé  (merci mes parents pour cette sage décision) et je n'utilise plus facebook depuis maintenant 6 ans... . \nCe n'est pas parce que quelqu'un ne partage pas le même avis que toi que tu dois les ranger dans une \"catégorie\".",
				"added": 1485398209
			}
		]
	},
	"comment_vote": {
		"11_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1
	}
}