{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Продолжая разговор о \"серверной\" стороне зайтов",
			"body": "В [этой](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2/+ZeroNet) теме пришли к тому, что ZeroNet больше является транспортом, чем фреймворком для децентрализованных приложений. И в этом случае, у зайтов может появиться \"серверная\" часть, например необходимость проверки соблюдения некоторых формальных правил: например запрет изменения старых комментариев. Минус: такой валидатор, работающий от лица владельца или превилегированного пользоватея, должен быть доступен онлайн 24/7. С другой стороны, он может быть запущен на нескольких компьютерах и остается все равно довольно дешевым в поддержании и может оставаться в полуфункциональном состоянии по время даунтайма валидатора (например просто посты помечаются как непроверенные).  \n\nУ некоторых зайтов такая \"серверная\" уже присутствует: ZeroID, ZeroName, echobot в ZeroMail. Так что, пожалуй, это совершенно нормальное и в некоторых случаях необходимое решение, которого не следует избегать. Децентрализации же следует достигать иными мерами, а именно сегментацией по разным зайтам и через Merger Sites.",
			"added": 1485780226
		}
	],
	"topic_vote": {},
	"next_comment_id": 36,
	"comment": {
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "> [kagari](#comment_2_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Мне кажется достаточно глянуть на количество сидов для Ru-ZeroTalk, я вижу 108, значит минимум столько русскоговорящих людей пользуется этой сетью)\n\nВовсе не обязательно. Думаю что этот форум китайцы сидируют, собственно и по GeoIP так.",
				"added": 1483916218
			}
		],
		"1_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "> [voland](#comment_34_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Народ, научите подкат убирать простыни... Что-то в 0нете, это как-то странно работает, или не работает вовсе...\n\nВ блогах работает `---`",
				"added": 1484322376
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 3,
				"body": "Слушал его краем уха, говорит довольно ограниченно. Думаю ему просто больше нравится то состояние, в котором он находится, окруженный единомышленниками организатор некоего протестного движения. На больше он не готов и сам не захочет. В крайнем случае сделает что-то ради показухи для своих подписчиков, когда уже они его прижмут за бездействие.\n\nРадует, что один из немногих оппозиционеров, который при этом позволяет высказываться довольно радикально, а не изображает вежливость и игру по правилам, по которым чего-то добиться невозможно. В отличии от другой оппозиции, типа Яблока или Пиратской партии. Но в остальном, никаких общих взглядов я с ним не разделяю, как и с партией Парнас вцелом.\n\n>Если будет небольшой набег, просим прощения у коренных обитателей.\n\nВсегда если наберется достаточное количество, сможете выделиться в отдельный форум, который тут делается парой кликов.",
				"added": 1484348126
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 4,
				"body": "> [kagari](#comment_9_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): на одну целую единицу валюты\n\nНе нужно сильно волноваться по поводу того где поставлена запятая. Можно и в сатоши мерять, если кому хочется целую.\n\n> [kagari](#comment_10_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): даже если ее курс будет скакать туда-сюда, ведь эти деньги никто не сможет отнять или заморозить счет.\n\nЭто одна из крутых фич криптовалюты, невозможность конфисковать даже при обыске, возить с собой через границу и получить доступ откуда угодно, держа сид в памяти. Такая форма ценности, которую можно иметь, даже если закон не на твоей стороне.",
				"added": 1484410072
			},
			{
				"comment_id": 5,
				"body": "> И еще один ролик про биткоин от того же автора. +Можно много дельного почерпнуть из комментариев.https://www.youtube.com/watch?v=F-vXs59_Ceo\n\nУ Рами хороший канал, но относительно биткоина и криптовалют он весьма поверхностно разбирается в теме, на мой взгляд.",
				"added": 1484415825
			},
			{
				"comment_id": 6,
				"body": "> [c0mm1t](#comment_2_1AzUeVQB37VLhrQDGyQgtL5mbBhE6dzcGy): есть ли тут хорошие сайты с котами?\n\nhttp://127.0.0.1:43110/1Q8KDxfQNe1yN9XzXhu1ZisYEyVnUkif2J",
				"added": 1484430705
			},
			{
				"comment_id": 7,
				"body": ">[shift](#comment_349_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Может тяжелый контент положили в сайт? не верю что текстом набрали\n\nВроде именно текстом. А почему нет, китайцев много. У них ещё есть несколько других форумов,  пара борд и куча бложиков.",
				"added": 1484681326
			},
			{
				"comment_id": 8,
				"body": "> [shift](#comment_351_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Вроде бы или вы сходили в папочку и посмотрели ?)\n\nДа, там текст. Вроде бы, это значит когда-то раньше смотрел.",
				"added": 1484682531
			},
			{
				"comment_id": 14,
				"body": "Какой-то новый наплыв китайцев. Скоро придется делать отдельный EN-ZeroTalk.",
				"added": 1485087403
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 9,
				"body": "Такое решение действительно само напрашивается. Со временем так и будет, по крайней мере с некоторыми сайтами. Куда лучшим примером, чем биткоин является BitShares/Steem, которые изначально сделаны по такому принципу. При правильном решении слепого доверия не будет. \n\nТакой подход это уже отход от формата сайтов, в сторону формата приложений. Но мне это кажется даже более лучшим. Так например, можно было бы создавать приложения, где пользователям даже не обязательно знать что они используют ZN или похожую сеть. Они просто ставят легкую версию с плеймаркета, например, которая коннектится и работает через любой доступный полный узел.",
				"added": 1484850539
			},
			{
				"comment_id": 10,
				"body": "Кстати, в новой версии Nxt теперь во время загрузки блокчейна, работа идет в режиме лайт-клиента через случайную удаленную ноду, только с пометкой об этом. Правда в ZN раньше нужно было думать о таком. Но было бы удобно.",
				"added": 1484932289
			},
			{
				"comment_id": 18,
				"body": "> [shift](#comment_361_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Раньше - не надо тк тогда core узлов будет мало\n\nя имею ввиду не в целом, а по сайтам, то есть без различия на полный узел и API-шлюз.",
				"added": 1485276883
			},
			{
				"comment_id": 19,
				"body": "> [shift](#comment_362_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Тогда я не понял мысли\n\nЧтобы сайт был разбит на фронтенд и бэкенд, и в том числе можно было пользоваться этим удаленно, запросами к другим узлам. В текущем виде, это пожалуй бы усложнило разработку зайтов, которых и так пока немного.",
				"added": 1485445274
			}
		],
		"4_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 11,
				"body": "Сейчас работает.",
				"added": 1484934343
			},
			{
				"comment_id": 12,
				"body": "у меня нет",
				"added": 1484934578
			},
			{
				"comment_id": 13,
				"body": "учетки. во всяком случае не лежит.",
				"added": 1484934707
			},
			{
				"comment_id": 15,
				"body": "Автор Kim Dotcom, название унаследовано от Megaupload, nz - потому-что стракторил от кровавого режима в Новую Зеландию.",
				"added": 1485093324
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 16,
				"body": "Так кто тут понял, зачем оно? Как оно должно использоваться, по мнению автора и используется ли кем-то?",
				"added": 1485192780
			},
			{
				"comment_id": 17,
				"body": "> [zeroalx](#comment_10_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): вот тут 3 главу(про кодекс) можешь почитать, если интересно.\n\nПрочитал. Такого мне точно не надо. В подобной системе, очень быстро захватят власть, которые формально будут следовать кодексу. А те что реально будут на что-то способны, быстро окажутся в положении угнетаемых. В подобной системе нет места творчеству, созданию нового и вообще созиданию, а не тому что там под этим представлял автор. И что особенно противно, думаю у автора именно такая цель, пусть даже он и не до конца это осознает.",
				"added": 1485242033
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 20,
				"body": "Какие возможны способы запретить удаление/редактирование контента. Сейчас пользователь имеет полный контроль над своим контентом на сайте, что вообще сильно ограничивает возможности создания многопользовательских сайтов. Допустим, сайт предполагает премодерацию, тогда для подтвержденных записей не должно быть способа изменить её. Пока приходить на ум только скопировать данные в базу модератора, что однако тоже не выход.",
				"added": 1485446913
			},
			{
				"comment_id": 21,
				"body": "> [shift](#comment_363_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): \n> Изменение контента - изменение хэша, всё просто =)\n\nЭто то да, но модератор модерирует в течении некоторого времени, потом он  может например изменить свое поведение, например. В итоге что? Перекладывать все на владельца сайта? А во вторых, когда контент изменен автором, откуда брать исходный, подтвержденный вариант? Опять же, его нужно бекапить. Все это как-то не есть хорошо.",
				"added": 1485471637
			}
		],
		"1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 22,
				"body": "[0List](http://127.0.0.1:43110/0list.bit/)\n[ZeroCentral](http://127.0.0.1:43110/1Dt7FR5aNLkqAjmosWh8cMWzJu633GYN6u/)\n\nИнтерактивных игр тут не видел, но есть [Zero Bird Competition](http://127.0.0.1:43110/16nsEmQ1ErcdNRpe7zmSg5eF2Y1zQpuURp).",
				"added": 1485536890
			},
			{
				"comment_id": 23,
				"body": "по серьезному тут все равно не поиграешь, плюс интерактивность тут годится разве для чего-то пошагового.",
				"added": 1485537789
			}
		],
		"2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 24,
				"body": "Или рисования совы, да. Задача распределенных вычислений в децентрализованных системах из области тех, что требуют скорее исследований, чем какого-то практического применения.\n\n> [waylander](#comment_3_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2): не. я не про распределенные вычисления. это позволит создавать сайты, которые должны как-то обрабатывать автоматически данные независимо от пользоателей (которые могут подменить скрипт у себя в браузере). \n\nЭто уже ближе к Ethereum, там как раз так сделано. Тут пока нет никакой возможности как-то верифицировать изменения, так что все проверки не в момент записи в базу, а в момент представления.\n\n> можно было бы сделать даже соцсеть сложную или даже браузерную игру\n\nТут пожалуй облом с ZN в том виде, в котором он сейчас. Все больше держится на добросовестности пользователей сайтов. Хотя добросовестность и можно стимулировать.",
				"added": 1485600289
			},
			{
				"comment_id": 25,
				"body": "> [balancer73](#comment_48_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): На добросовестности владельцев зайтов\n\nА вот и не только. Пользовательские данные на сайте находятся под контролем пользователя.\n\n>Простой пользователь не может в общем случае навредить зайту (форуму/блогу), кроме как спамом. \n\nМожет например изменить или испортить существующие сообщения. В случае сложных приложений, вроде игр, может отменить свой предыдущий ход, например. \n\n> Пользователь не может изменить скрипты или чужие данные. \nЧужие не может, но может свои. Этого вполне достаточно, чтобы сильно препятствовать созданию хороших приложений. \n\n> Его данные складируются отдельно от остальных в JSON и уже оттуда локальным скриптом (который чужие пользователи поменять не могут, только или владелец сайта или локальный пользователь) обрабатывается для отображения информации.\n\nЭтого недостаточно. Обычно в централизованных сайтах владелец определяет правила для пользователей и контролирует их соблюдение. Предполагается, что он должен оставаться беспристрастным, в пределах установленных правил. Обычно проблемы именно с этим. Но пользовательские данные не находятся в полном владеннии пользователя, и это необходимое условие для многих приложений. ZN этого не обеспечивает.",
				"added": 1485608455
			},
			{
				"comment_id": 26,
				"body": "Ну вот я пока вижу единственный выход, копировать пользовательские данные в бд владельца.\n\nПредставляю примерно так. Например форум. Пользователь пишет в свою бд, владелец потом приходит, копирует данные себе. Чтобы пользователь не мог отвертеться, каждый пост подписывается. Если необходимо редактирование от лица корректора, оно применяется патчами. Вот и получается как раз, зеронет только как транспорт, а децентрализации иной кроме хостинга, тут и так нет.\n\nВ сухом остатке мы имеем: почти бесплатный хостинг сайтов, почти без даунтайма в идеале, анонимный при необходимости, и нужно все писать с нуля. Если этого достаточно — то можно сказать, что ZN для такого готов. Какжется для себя я определил, что такое ZN.\n\nНа самом деле это не так мало, если посмотреть на сайты i2p и tor, которые много затратнее в плане хостинга. В клирнете же, при умеренных затратах на хостинг, получаем проблемы с анонимностью и прочие нарушения работы доброжелателями извне.\n\n> Пока не вижу как.\nЕсли не изображать децентрализацию, которой тут и так нет, то пожалуй проблемы решаемы.",
				"added": 1485636054
			},
			{
				"comment_id": 28,
				"body": "Можно делать торрент-подобный CDN, можно делать децентрализованные приложения. У того и другого есть свои применения. Я за то чтобы называть вещи своими именами, тогда во первых реализация будет более прямой по отношению к поставленной задаче. Во вторых, не будет неоправданных ожиданий.\n\n> Мда. Очень многие... прямо скажем, большинство существующих сегодня приложений без центрального сервера создать невозможно.\n\nДа, конечно. Если в это очень верить, то нельзя.",
				"added": 1485691997
			},
			{
				"comment_id": 29,
				"body": "Подумал про одну положительную сторону ZeroMe, во контексте этого треда. Он больше ориентирован на пользовательский профиль, чем на цепочки обсуждений, хоть и они присутствуют. Таким образом, то что пользователь имеет полный контроль над своими данными, в ZeroMe это не является чем-то плохим, потому-что пользователь заинтересован в сохранности своего профиля, а повредить другие профили таким образом нельзя. Можно нарушить задним числом дискуссию в комментариях, но комментарии там пожалуй не являются значимыми. То есть, касательно вопроса децентрализации: имеет значение формат представления контента.",
				"added": 1485778969
			}
		],
		"1_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N": [
			{
				"comment_id": 30,
				"body": "> [voland](#comment_63_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): зайт сайт\n\nНе  я это придумал, многим, особенно в англоязычном сегменте (наверно китайцам) такое название [понравилось](http://127.0.0.1:43110/ZeroPolls.bit/?Poll:1-1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC) и они употребляют. Может быть засчет того, что английский менее консервативный на неологизмы. Мне лично больше нравится \"зеросайт\".\n\nЗ.Ы. А ещё есть эти дэппсы (dapps).",
				"added": 1485781952
			},
			{
				"comment_id": 31,
				"body": "> [shift](#comment_368_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Нет, никакой серверной части не надо, валидацию можно описать в коде сайта, что бы неверный контент не попадал.\n\nКак запретить удаление?\n\n> Если потом потребуется какая-то более сложная валидация - так это смарт контракты в *coin системах\n\nРечь про ZeroNet. Не вижу ничего хорошего прикручивать овердофига всяких коинов, и так уже целый неймкоин сбоку. Для децентрализованных приложений будут другие решения, нежели ZN.",
				"added": 1485798787
			}
		],
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 32,
				"body": "дерево комментов теперь отображается.",
				"added": 1485965211
			},
			{
				"comment_id": 35,
				"body": "Русский канал Балансера прибили на видное место.",
				"added": 1486135800
			}
		],
		"1_1PAnNhncRpwtUsy82YbLd7iBJHxTadBaUd": [
			{
				"comment_id": 33,
				"body": "У тебя остался seed?",
				"added": 1486029332
			},
			{
				"comment_id": 34,
				"body": "USER — там выпадающее меню и можно будет сменить. Но там нужен seet формат, а не private key.\n\nseed формат — это строка вроде ce09e8185ee5c55ad0abb2eb31f9886507cb9ef7e960beb2cbf402f68db6d913 \n\n> когда я на захожу на ZeroHome\n\nМожешь включить Multiuser плагин, тогда локально будет такой же интерфейс, как через прокси. Для этого нужно в директории plugins убрать префикс, disabled-",
				"added": 1486057046
			}
		]
	},
	"comment_vote": {
		"347_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"38_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}