<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">14 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b><br>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#36807; &#20004; &#22825; &#26159; &#36926; &#36234; &#33410; &#65292; &#21448; &#26159; &#38500; &#37237; &#33410; &#65292; &#31085; &#21496; &#38271; &#21644; &#25991; &#22763; &#24819; &#27861; &#23376; &#24590; &#40637; &#29992; &#35809; &#35745; &#25417; &#25343; &#32822; &#31267; &#65292; &#26432; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#21482; &#26159; &#35828; &#65306; &#24403; &#33410; &#30340; &#26085; &#23376; &#19981; &#21487; &#65292; &#24656; &#24597; &#30334; &#22995; &#29983; &#20081; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#20271; &#22823; &#23612; &#38271; &#22823; ? &#30127; &#30340; &#35199; &#38376; &#23478; &#37324; &#22352; &#24109; &#30340; &#26102; &#20505; &#65292; &#26377; &#19968; &#20010; &#22899; &#20154; &#25343; &#30528; &#19968; &#29577; &#29942; &#33267; &#36149; &#30340; &#30495; &#21738; &#21714; &#39321; &#33167; &#26469; &#65292; &#25171; &#30772; &#29577; &#29942; &#65292; &#25226; &#33167; &#27975; &#22312; &#32822; &#31267; &#30340; &#22836; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#20960; &#20010; &#20154; &#24515; &#20013; &#24456; &#19981; &#21916; &#24742; &#65292; &#35828; &#65306; &#20309; &#29992; &#36825; &#26679; &#26505; &#36153; &#39321; &#33167; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#39321; &#33167; &#21487; &#20197; &#21334; &#19977; &#21313; &#22810; &#20004; &#38134; &#23376; &#21608; &#27982; &#31351; &#20154; &#12290; &#20182; &#20204; &#23601; &#21521; &#37027; &#22899; &#20154; &#29983; &#27668; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#30001; &#20182; &#32610; &#65281; &#20026; &#29978; &#40637; &#38590; &#20026; &#20182; &#21602; &#65311; &#20182; &#22312; &#25105; &#36523; &#19978; &#20316; &#30340; &#26159; &#19968; &#20214; &#32654; &#20107; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#24120; &#26377; &#31351; &#20154; &#21644; &#20320; &#20204; &#21516; &#22312; &#65292; &#35201; &#21521; &#20182; &#20204; &#34892; &#21892; &#38543; &#26102; &#37117; &#21487; &#20197; &#65307; &#21482; &#26159; &#20320; &#20204; &#19981; &#24120; &#26377; &#25105; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#25152; &#20316; &#30340; &#65292; &#26159; &#23613; &#20182; &#25152; &#33021; &#30340; &#65307; &#20182; &#26159; &#20026; &#25105; &#23433; &#33900; &#30340; &#20107; &#25226; &#39321; &#33167; &#39044; &#20808; &#27975; &#22312; &#25105; &#36523; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#26222; &#22825; &#20043; &#19979; &#65292; &#26080; &#35770; &#22312; &#29978; &#40637; &#22320; &#26041; &#20256; &#36825; &#31119; &#38899; &#65292; &#20063; &#35201; &#36848; &#35828; &#36825; &#22899; &#20154; &#25152; &#20316; &#30340; &#65292; &#20197; &#20026; &#35760; &#24565; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#21313; &#20108; &#38376; &#24466; &#20043; &#20013; &#65292; &#26377; &#19968; &#20010; &#21152; &#30053; &#20154; &#29369; &#22823; &#21435; &#35265; &#31085; &#21496; &#38271; &#65292; &#35201; &#25226; &#32822; &#31267; &#20132; &#32473; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21548; &#35265; &#23601; &#27426; &#21916; &#65292; &#21448; &#24212; &#35768; &#32473; &#20182; &#38134; &#23376; &#65307; &#20182; &#23601; &#23547; &#24605; &#22914; &#20309; &#24471; &#20415; &#25226; &#32822; &#31267; &#20132; &#32473; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#38500; &#37237; &#33410; &#30340; &#31532; &#19968; &#22825; &#65292; &#23601; &#26159; &#23472; &#36926; &#36234; &#32650; &#32660; &#30340; &#37027; &#19968; &#22825; &#65292; &#38376; &#24466; &#23545; &#32822; &#31267; &#35828; &#65306; &#20320; &#21507; &#36926; &#36234; &#33410; &#30340; &#31605; &#24109; &#35201; &#25105; &#20204; &#24448; &#37027; &#37324; &#21435; &#39044; &#22791; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#25171; &#21457; &#20004; &#20010; &#38376; &#24466; &#65292; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#36827; &#22478; &#21435; &#65292; &#24517; &#26377; &#20154; &#25343; &#30528; &#19968; &#29942; &#27700; &#36814; &#38754; &#32780; &#26469; &#65292; &#20320; &#20204; &#23601; &#36319; &#30528; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#36827; &#37027; &#23478; &#21435; &#65292; &#20320; &#20204; &#23601; &#23545; &#37027; &#23478; &#30340; &#20027; &#20154; &#35828; &#65306; &#22827; &#23376; &#35828; &#65306; &#23458; &#25151; &#22312; &#37027; &#37324; &#65311; &#25105; &#19982; &#38376; &#24466; &#22909; &#22312; &#37027; &#37324; &#21507; &#36926; &#36234; &#33410; &#30340; &#31605; &#24109; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#24517; &#25351; &#32473; &#20320; &#20204; &#25670; &#35774; &#25972; &#40784; &#30340; &#19968; &#38388; &#22823; &#27004; &#65292; &#20320; &#20204; &#23601; &#22312; &#37027; &#37324; &#20026; &#25105; &#20204; &#39044; &#22791; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#20986; &#21435; &#65292; &#36827; &#20102; &#22478; &#65292; &#25152; &#36935; &#35265; &#30340; &#27491; &#22914; &#32822; &#31267; &#25152; &#35828; &#30340; &#12290; &#20182; &#20204; &#23601; &#39044; &#22791; &#20102; &#36926; &#36234; &#33410; &#30340; &#31605; &#24109; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#21040; &#20102; &#26202; &#19978; &#65292; &#32822; &#31267; &#21644; &#21313; &#20108; &#20010; &#38376; &#24466; &#37117; &#26469; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#22352; &#24109; &#27491; &#21507; &#30340; &#26102; &#20505; &#65292; &#32822; &#31267; &#35828; &#65306; &#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#20320; &#20204; &#20013; &#38388; &#26377; &#19968; &#20010; &#19982; &#25105; &#21516; &#21507; &#30340; &#20154; &#35201; &#21334; &#25105; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#24551; &#24833; &#36215; &#26469; &#65292; &#19968; &#20010; &#19968; &#20010; &#30340; &#38382; &#20182; &#35828; &#65306; &#26159; &#25105; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#26159; &#21313; &#20108; &#20010; &#38376; &#24466; &#20013; &#21516; &#25105; &#34360; &#25163; &#22312; &#30424; &#23376; &#37324; &#30340; &#37027; &#20010; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#20154; &#23376; &#24517; &#35201; &#21435; &#19990; &#65292; &#27491; &#22914; &#32463; &#19978; &#25351; &#30528; &#20182; &#25152; &#20889; &#30340; &#65307; &#20294; &#21334; &#20154; &#23376; &#30340; &#20154; &#26377; &#31096; &#20102; &#65281; &#37027; &#20154; &#19981; &#29983; &#22312; &#19990; &#19978; &#20498; &#22909; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21507; &#30340; &#26102; &#20505; &#65292; &#32822; &#31267; &#25343; &#36215; &#39292; &#26469; &#65292; &#31069; &#20102; &#31119; &#65292; &#23601; &#25816; &#24320; &#65292; &#36882; &#32473; &#20182; &#20204; &#65292; &#35828; &#65306; &#20320; &#20204; &#25343; &#30528; &#21507; &#65292; &#36825; &#26159; &#25105; &#30340; &#36523; &#20307; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#25343; &#36215; &#26479; &#26469; &#65292; &#31069; &#35874; &#20102; &#65292; &#36882; &#32473; &#20182; &#20204; &#65307; &#20182; &#20204; &#37117; &#21917; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#36825; &#26159; &#25105; &#31435; &#32422; &#30340; &#34880; &#65292; &#20026; &#22810; &#20154; &#27969; &#20986; &#26469; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#25105; &#19981; &#20877; &#21917; &#36825; &#33889; &#33796; &#27713; &#65292; &#30452; &#21040; &#25105; &#22312; &#31070; &#30340; &#22269; &#37324; &#21917; &#26032; &#30340; &#37027; &#26085; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21809; &#20102; &#35799; &#65292; &#23601; &#20986; &#26469; &#65292; &#24448; &#27204; &#27012; &#23665; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#37117; &#35201; &#36300; &#20498; &#20102; &#65292; &#22240; &#20026; &#32463; &#19978; &#35760; &#30528; &#35828; &#65306; &#25105; &#35201; &#20987; &#25171; &#29287; &#20154; &#65292; &#32650; &#23601; &#20998; &#25955; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#25105; &#22797; &#27963; &#20197; &#24460; &#65292; &#35201; &#22312; &#20320; &#20204; &#20197; &#20808; &#24448; &#21152; &#21033; &#21033; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#35828; &#65306; &#20247; &#20154; &#34429; &#28982; &#36300; &#20498; &#65292; &#25105; &#24635; &#19981; &#33021; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#35828; &#65306; &#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#65292; &#23601; &#22312; &#20170; &#22825; &#22812; &#37324; &#65292; &#40481; &#21483; &#20004; &#36941; &#20197; &#20808; &#65292; &#20320; &#35201; &#19977; &#27425; &#19981; &#35748; &#25105; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#21364; &#26497; &#21147; &#30340; &#35828; &#65306; &#25105; &#23601; &#26159; &#24517; &#39035; &#21644; &#20320; &#21516; &#27515; &#65292; &#20063; &#24635; &#19981; &#33021; &#19981; &#35748; &#20320; &#12290; &#20247; &#38376; &#24466; &#37117; &#26159; &#36825; &#26679; &#35828; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#19968; &#20010; &#22320; &#26041; &#65292; &#21517; &#21483; &#23458; &#35199; &#39532; &#23612; &#12290; &#32822; &#31267; &#23545; &#38376; &#24466; &#35828; &#65306; &#20320; &#20204; &#22352; &#22312; &#36825; &#37324; &#65292; &#31561; &#25105; &#31095; &#21578; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#24102; &#30528; &#24444; &#24471; &#12289; &#38597; &#21508; &#12289; &#32422; &#32752; &#21516; &#21435; &#65292; &#23601; &#24778; &#24656; &#36215; &#26469; &#65292; &#26497; &#20854; &#38590; &#36807; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#23545; &#20182; &#20204; &#35828; &#65306; &#25105; &#24515; &#37324; &#29978; &#26159; &#24551; &#20260; &#65292; &#20960; &#20046; &#35201; &#27515; &#65307; &#20320; &#20204; &#22312; &#36825; &#37324; &#31561; &#20505; &#65292; &#20742; &#37266; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#23601; &#31245; &#24448; &#21069; &#36208; &#65292; &#20463; &#20239; &#22312; &#22320; &#65292; &#31095; &#21578; &#35828; &#65306; &#20504; &#33509; &#21487; &#34892; &#65292; &#20415; &#21483; &#37027; &#26102; &#20505; &#36807; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#35828; &#65306; &#38463; &#29240; &#65281; &#29238; &#38463; &#65281; &#22312; &#20320; &#20961; &#20107; &#37117; &#33021; &#65307; &#27714; &#20320; &#23558; &#36825; &#26479; &#25764; &#21435; &#12290; &#28982; &#32780; &#65292; &#19981; &#35201; &#20174; &#25105; &#30340; &#24847; &#24605; &#65292; &#21482; &#35201; &#20174; &#20320; &#30340; &#24847; &#24605; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22238; &#26469; &#65292; &#35265; &#20182; &#20204; &#30561; &#30528; &#20102; &#65292; &#23601; &#23545; &#24444; &#24471; &#35828; &#65306; &#35199; &#38376; &#65292; &#20320; &#30561; &#35273; &#40637; &#65311; &#19981; &#33021; &#20742; &#37266; &#29255; &#26102; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#24635; &#35201; &#20742; &#37266; &#31095; &#21578; &#65292; &#20813; &#24471; &#20837; &#20102; &#36855; &#24785; &#12290; &#20320; &#20204; &#24515; &#28789; &#22266; &#28982; &#24895; &#24847; &#65292; &#32905; &#20307; &#21364; &#36719; &#24369; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#21435; &#31095; &#21578; &#65292; &#35828; &#30340; &#35805; &#36824; &#26159; &#19982; &#20808; &#21069; &#19968; &#26679; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#26469; &#35265; &#20182; &#20204; &#30561; &#30528; &#20102; &#65292; &#22240; &#20026; &#20182; &#20204; &#30340; &#30524; &#30555; &#29978; &#26159; &#22256; &#20518; &#65307; &#20182; &#20204; &#20063; &#19981; &#30693; &#36947; &#24590; &#40637; &#22238; &#31572; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#31532; &#19977; &#27425; &#26469; &#65292; &#23545; &#20182; &#20204; &#35828; &#65306; &#29616; &#22312; &#20320; &#20204; &#20173; &#28982; &#30561; &#35273; &#23433; &#27463; &#32610; &#65288; &#25110; &#20316; &#40637; &#65311; &#65289; &#65281; &#22815; &#20102; &#65292; &#26102; &#20505; &#21040; &#20102; &#12290; &#30475; &#21738; &#65292; &#20154; &#23376; &#34987; &#21334; &#22312; &#32618; &#20154; &#25163; &#37324; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">42</bdo>.&nbsp;</td><td align="left" valign="top">&#36215; &#26469; &#65281; &#25105; &#20204; &#36208; &#32610; &#12290; &#30475; &#21738; &#65292; &#37027; &#21334; &#25105; &#30340; &#20154; &#36817; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">43</bdo>.&nbsp;</td><td align="left" valign="top">&#35828; &#35805; &#20043; &#38388; &#65292; &#24573; &#28982; &#37027; &#21313; &#20108; &#20010; &#38376; &#24466; &#37324; &#30340; &#29369; &#22823; &#26469; &#20102; &#65292; &#24182; &#26377; &#35768; &#22810; &#20154; &#24102; &#30528; &#20992; &#26834; &#65292; &#20174; &#31085; &#21496; &#38271; &#21644; &#25991; &#22763; &#24182; &#38271; &#32769; &#37027; &#37324; &#19982; &#20182; &#21516; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">44</bdo>.&nbsp;</td><td align="left" valign="top">&#21334; &#32822; &#31267; &#30340; &#20154; &#26366; &#32473; &#20182; &#20204; &#19968; &#20010; &#26263; &#21495; &#65292; &#35828; &#65306; &#25105; &#19982; &#35841; &#20146; &#22068; &#65292; &#35841; &#23601; &#26159; &#20182; &#12290; &#20320; &#20204; &#25226; &#20182; &#25343; &#20303; &#65292; &#29282; &#29282; &#38752; &#38752; &#30340; &#24102; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">45</bdo>.&nbsp;</td><td align="left" valign="top">&#29369; &#22823; &#26469; &#20102; &#65292; &#38543; &#21363; &#21040; &#32822; &#31267; &#36319; &#21069; &#65292; &#35828; &#65306; &#25289; &#27604; &#65292; &#20415; &#19982; &#20182; &#20146; &#22068; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">46</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#19979; &#25163; &#25343; &#20303; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">47</bdo>.&nbsp;</td><td align="left" valign="top">&#26049; &#36793; &#31449; &#30528; &#30340; &#20154; &#65292; &#26377; &#19968; &#20010; &#25300; &#20986; &#20992; &#26469; &#65292; &#23558; &#22823; &#31085; &#21496; &#30340; &#20166; &#20154; &#30733; &#20102; &#19968; &#20992; &#65292; &#21066; &#25481; &#20102; &#20182; &#19968; &#20010; &#32819; &#26421; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">48</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#24102; &#30528; &#20992; &#26834; &#20986; &#26469; &#25343; &#25105; &#65292; &#22914; &#21516; &#25343; &#24378; &#30423; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">49</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#22825; &#22825; &#25945; &#35757; &#20154; &#65292; &#21516; &#20320; &#20204; &#22312; &#27583; &#37324; &#65292; &#20320; &#20204; &#24182; &#27809; &#26377; &#25343; &#25105; &#12290; &#20294; &#36825; &#20107; &#25104; &#23601; &#65292; &#20026; &#35201; &#24212; &#39564; &#32463; &#19978; &#30340; &#35805; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">50</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#37117; &#31163; &#24320; &#20182; &#65292; &#36867; &#36208; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">51</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#20010; &#23569; &#24180; &#20154; &#65292; &#36196; &#36523; &#25259; &#30528; &#19968; &#22359; &#40635; &#24067; &#65292; &#36319; &#38543; &#32822; &#31267; &#65292; &#20247; &#20154; &#23601; &#25417; &#25343; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">52</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#21364; &#20002; &#20102; &#40635; &#24067; &#65292; &#36196; &#36523; &#36867; &#36208; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">53</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#25226; &#32822; &#31267; &#24102; &#21040; &#22823; &#31085; &#21496; &#37027; &#37324; &#65292; &#21448; &#26377; &#20247; &#31085; &#21496; &#38271; &#21644; &#38271; &#32769; &#24182; &#25991; &#22763; &#37117; &#26469; &#21644; &#22823; &#31085; &#21496; &#19968; &#21516; &#32858; &#38598; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">54</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#36828; &#36828; &#30340; &#36319; &#30528; &#32822; &#31267; &#65292; &#19968; &#30452; &#36827; &#20837; &#22823; &#31085; &#21496; &#30340; &#38498; &#37324; &#65292; &#21644; &#24046; &#24441; &#19968; &#21516; &#22352; &#22312; &#28779; &#20809; . &#37324; &#28900; &#28779; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">55</bdo>.&nbsp;</td><td align="left" valign="top">&#31085; &#21496; &#38271; &#21644; &#20840; &#20844; &#20250; &#23547; &#25214; &#35265; &#35777; &#25511; &#21578; &#32822; &#31267; &#65292; &#35201; &#27835; &#27515; &#20182; &#65292; &#21364; &#23547; &#19981; &#30528; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">56</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#26377; &#22909; &#20123; &#20154; &#20316; &#35265; &#35777; &#21578; &#20182; &#65292; &#21482; &#26159; &#20182; &#20204; &#30340; &#35265; &#35777; &#21508; &#19981; &#30456; &#21512; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">57</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#26377; &#20960; &#20010; &#20154; &#31449; &#36215; &#26469; &#20316; &#20551; &#35265; &#35777; &#21578; &#20182; &#65292; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">58</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#20204; &#21548; &#35265; &#20182; &#35828; &#65306; &#25105; &#35201; &#25286; &#27585; &#36825; &#20154; &#25163; &#25152; &#36896; &#30340; &#27583; &#65292; &#19977; &#26085; &#20869; &#23601; &#21478; &#36896; &#19968; &#24231; &#19981; &#26159; &#20154; &#25163; &#25152; &#36896; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">59</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#26159; &#36825; &#40637; &#20316; &#35265; &#35777; &#65292; &#20063; &#26159; &#21508; &#19981; &#30456; &#21512; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">60</bdo>.&nbsp;</td><td align="left" valign="top">&#22823; &#31085; &#21496; &#36215; &#26469; &#31449; &#22312; &#20013; &#38388; &#65292; &#38382; &#32822; &#31267; &#35828; &#65306; &#20320; &#29978; &#40637; &#37117; &#19981; &#22238; &#31572; &#40637; &#65311; &#36825; &#20123; &#20154; &#20316; &#35265; &#35777; &#21578; &#20320; ? &#30340; &#26159; &#29978; &#40637; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">61</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21364; &#19981; &#35328; &#35821; &#65292; &#19968; &#21477; &#20063; &#19981; &#22238; &#31572; &#12290; &#22823; &#31085; &#21496; &#21448; &#38382; &#20182; &#35828; &#65306; &#20320; &#26159; &#37027; &#24403; &#31216; &#39042; &#32773; &#30340; &#20799; &#23376; &#22522; &#30563; &#19981; &#26159; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">62</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#25105; &#26159; &#12290; &#20320; &#20204; &#24517; &#30475; &#35265; &#20154; &#23376; &#22352; &#22312; &#37027; &#26435; &#33021; &#32773; &#30340; &#21491; &#36793; &#65292; &#39550; &#30528; &#22825; &#19978; &#30340; &#20113; &#38477; &#20020; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">63</bdo>.&nbsp;</td><td align="left" valign="top">&#22823; &#31085; &#21496; &#23601; &#25749; &#24320; &#34915; &#26381; &#65292; &#35828; &#65306; &#25105; &#20204; &#20309; &#24517; &#20877; &#29992; &#35265; &#35777; &#20154; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">64</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#24050; &#32463; &#21548; &#35265; &#20182; &#36825; &#20717; &#22916; &#30340; &#35805; &#20102; &#12290; &#20320; &#20204; &#30340; &#24847; &#35265; &#22914; &#20309; &#65311; &#20182; &#20204; &#37117; &#23450; &#20182; &#35813; &#27515; &#30340; &#32618; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">65</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#26377; &#20154; &#21520; &#21822; &#27819; &#22312; &#20182; &#33080; &#19978; &#65292; &#21448; &#33945; &#30528; &#20182; &#30340; &#33080; &#65292; &#29992; &#25331; &#22836; &#25171; &#20182; &#65292; &#23545; &#20182; &#35828; &#65306; &#20320; &#35828; &#39044; &#35328; &#32610; &#65281; &#24046; &#24441; &#25509; &#36807; &#20182; &#26469; &#65292; &#29992; &#25163; &#25484; &#25171; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">66</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#22312; &#19979; &#36793; &#38498; &#23376; &#37324; &#65307; &#26469; &#20102; &#22823; &#31085; &#21496; &#30340; &#19968; &#20010; &#20351; &#22899; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">67</bdo>.&nbsp;</td><td align="left" valign="top">&#35265; &#24444; &#24471; &#28900; &#28779; &#65292; &#23601; &#30475; &#30528; &#20182; &#65292; &#35828; &#65306; &#20320; &#32032; &#26469; &#20063; &#26159; &#21516; &#25343; &#25746; &#21202; &#20154; &#32822; &#31267; &#19968; &#22821; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">68</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#21364; &#19981; &#25215; &#35748; &#65292; &#35828; &#65306; &#25105; &#19981; &#30693; &#36947; &#65292; &#20063; &#19981; &#26126; &#30333; &#20320; &#35828; &#30340; &#26159; &#29978; &#40637; &#12290; &#26044; &#26159; &#20986; &#26469; &#65292; &#21040; &#20102; &#21069; &#38498; &#65292; &#40481; &#23601; &#21483; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">69</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#20351; &#22899; &#30475; &#35265; &#20182; &#65292; &#21448; &#23545; &#26049; &#36793; &#31449; &#30528; &#30340; &#20154; &#35828; &#65306; &#36825; &#20063; &#26159; &#20182; &#20204; &#19968; &#20826; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">70</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#21448; &#19981; &#25215; &#35748; &#12290; &#36807; &#20102; &#19981; &#22810; &#30340; &#26102; &#20505; &#65292; &#26049; &#36793; &#31449; &#30528; &#30340; &#20154; &#21448; &#23545; &#24444; &#24471; &#35828; &#65306; &#20320; &#30495; &#26159; &#20182; &#20204; &#19968; &#20826; &#30340; &#65281; &#22240; &#20026; &#20320; &#26159; &#21152; &#21033; &#21033; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">71</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#23601; &#21457; &#21650; &#36215; &#35475; &#30340; &#35828; &#65306; &#25105; &#19981; &#35748; &#24471; &#20320; &#20204; &#35828; &#30340; &#36825; &#20010; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">72</bdo>.&nbsp;</td><td align="left" valign="top">&#31435; &#26102; &#40481; &#21483; &#20102; &#31532; &#20108; &#36941; &#12290; &#24444; &#24471; &#24819; &#36215; &#32822; &#31267; &#23545; &#20182; &#25152; &#35828; &#30340; &#35805; &#65306; &#40481; &#21483; &#20004; &#36941; &#20197; &#20808; &#65292; &#20320; &#35201; &#19977; &#27425; &#19981; &#35748; &#25105; &#12290; &#24605; &#24819; &#36215; &#26469; &#65292; &#23601; &#21741; &#20102; &#12290;</td></tr></tbody>
</table>
<br></div></div>
</body></html>