<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>mark1</title></head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">4 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)<br>
</b>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#22312; &#28023; &#36793; &#25945; &#35757; &#20154; &#12290; &#26377; &#35768; &#22810; &#20154; &#21040; &#20182; &#37027; &#37324; &#32858; &#38598; &#65292; &#20182; &#21482; &#24471; &#19978; &#33337; &#22352; &#19979; &#12290; &#33337; &#22312; &#28023; &#37324; &#65292; &#20247; &#20154; &#37117; &#38752; &#36817; &#28023; &#65292; &#31449; &#22312; &#23736; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#29992; &#27604; &#21947; &#25945; &#35757; &#20182; &#20204; &#35768; &#22810; &#36947; &#29702; &#12290; &#22312; &#25945; &#35757; &#20043; &#38388; &#65292; &#23545; &#20182; &#20204; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#21548; &#38463; &#65281; &#26377; &#19968; &#20010; &#25746; &#31181; &#30340; &#20986; &#21435; &#25746; &#31181; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#25746; &#30340; &#26102; &#20505; &#65292; &#26377; &#33853; &#22312; &#36335; &#26049; &#30340; &#65292; &#39134; &#40479; &#26469; &#21507; &#23613; &#20102; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#33853; &#22312; &#22303; &#27973; &#30707; &#22836; &#22320; &#19978; &#30340; &#65292; &#22303; &#26082; &#19981; &#28145; &#65292; &#21457; &#33495; &#26368; &#24555; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#26085; &#22836; &#20986; &#26469; &#19968; &#26194; &#65292; &#22240; &#20026; &#27809; &#26377; &#26681; &#65292; &#23601; &#26543; &#20094; &#20102; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#33853; &#22312; &#33606; &#26840; &#37324; &#30340; &#65292; &#33606; &#26840; &#38271; &#36215; &#26469; &#65292; &#25226; &#20182; &#25380; &#20303; &#20102; &#65292; &#23601; &#19981; &#32467; &#23454; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#26377; &#33853; &#22312; &#22909; &#22303; &#37324; &#30340; &#65292; &#23601; &#21457; &#29983; &#38271; &#22823; &#65292; &#32467; &#23454; &#26377; &#19977; &#21313; &#20493; &#30340; &#65292; &#26377; &#20845; &#21313; &#20493; &#30340; &#65292; &#26377; &#19968; &#30334; &#20493; &#30340; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#35828; &#65306; &#26377; &#32819; &#21487; &#21548; &#30340; &#65292; &#23601; &#24212; &#24403; &#21548; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#26080; &#20154; &#30340; &#26102; &#20505; &#65292; &#36319; &#38543; &#32822; &#31267; &#30340; &#20154; &#21644; &#21313; &#20108; &#20010; &#38376; &#24466; &#38382; &#20182; &#36825; &#27604; &#21947; &#30340; &#24847; &#24605; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#31070; &#22269; &#30340; &#22885; &#31192; &#21482; &#21483; &#20320; &#20204; &#30693; &#36947; &#65292; &#33509; &#26159; &#23545; &#22806; &#20154; &#35762; &#65292; &#20961; &#20107; &#23601; &#29992; &#27604; &#21947; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#21483; &#20182; &#20204; &#30475; &#26159; &#30475; &#35265; &#65292; &#21364; &#19981; &#26195; &#24471; &#65307; &#21548; &#26159; &#21548; &#35265; &#65292; &#21364; &#19981; &#26126; &#30333; &#65307; &#24656; &#24597; &#20182; &#20204; &#22238; &#36716; &#36807; &#26469; &#65292; &#23601; &#24471; &#36198; &#20813; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#19981; &#26126; &#30333; &#36825; &#27604; &#21947; &#40637; &#65311; &#36825; &#26679; &#24590; &#33021; &#26126; &#30333; &#19968; &#20999; &#30340; &#27604; &#21947; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#25746; &#31181; &#20043; &#20154; &#25152; &#25746; &#30340; &#23601; &#26159; &#36947; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#25746; &#22312; &#36335; &#26049; &#30340; &#65292; &#23601; &#26159; &#20154; &#21548; &#20102; &#36947; &#65292; &#25746; &#20294; &#31435; &#21051; &#26469; &#65292; &#25226; &#25746; &#22312; &#20182; &#24515; &#37324; &#30340; &#36947; &#22842; &#20102; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#25746; &#22312; &#30707; &#22836; &#22320; &#19978; &#30340; &#65292; &#23601; &#26159; &#20154; &#21548; &#20102; &#36947; &#65292; &#31435; &#21051; &#27426; &#21916; &#39046; &#21463; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#20182; &#24515; &#37324; &#27809; &#26377; &#26681; &#65292; &#19981; &#36807; &#26159; &#26242; &#26102; &#30340; &#65292; &#21450; &#33267; &#20026; &#36947; &#36973; &#20102; &#24739; &#38590; &#65292; &#25110; &#26159; &#21463; &#20102; &#36924; &#36843; &#65292; &#31435; &#21051; &#23601; &#36300; &#20498; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#36824; &#26377; &#37027; &#25746; &#22312; &#33606; &#26840; &#37324; &#30340; &#65292; &#23601; &#26159; &#20154; &#21548; &#20102; &#36947; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#24460; &#26469; &#26377; &#19990; &#19978; &#30340; &#24605; &#34385; &#12289; &#38065; &#36130; &#30340; &#36855; &#24785; &#65292; &#21644; &#21035; &#26679; &#30340; &#31169; &#27442; &#36827; &#26469; &#65292; &#25226; &#36947; &#25380; &#20303; &#20102; &#65292; &#23601; &#19981; &#33021; &#32467; &#23454; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#25746; &#22312; &#22909; &#22320; &#19978; &#30340; &#65292; &#23601; &#26159; &#20154; &#21548; &#36947; &#65292; &#21448; &#39046; &#21463; &#65292; &#24182; &#19988; &#32467; &#23454; &#65292; &#26377; &#19977; &#21313; &#20493; &#30340; &#65292; &#26377; &#20845; &#21313; &#20493; &#30340; &#65292; &#26377; &#19968; &#30334; &#20493; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#20154; &#25343; &#28783; &#26469; &#65292; &#23682; &#26159; &#35201; &#25918; &#22312; &#26007; &#24213; &#19979; &#65292; &#24202; &#24213; &#19979; &#65292; &#19981; &#25918; &#22312; &#28783; ? &#19978; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#25513; &#34255; &#30340; &#20107; &#65292; &#27809; &#26377; &#19981; &#26174; &#20986; &#26469; &#30340; &#65307; &#38544; &#30610; &#30340; &#20107; &#65292; &#27809; &#26377; &#19981; &#38706; &#20986; &#26469; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#32819; &#21487; &#21548; &#30340; &#65292; &#23601; &#24212; &#24403; &#21548; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#35828; &#65306; &#20320; &#20204; &#25152; &#21548; &#30340; &#35201; &#30041; &#24515; &#12290; &#20320; &#20204; &#29992; &#29978; &#40637; &#37327; &#22120; &#37327; &#32473; &#20154; &#65292; &#20063; &#24517; &#29992; &#29978; &#40637; &#37327; &#22120; &#37327; &#32473; &#20320; &#20204; &#65292; &#24182; &#19988; &#35201; &#22810; &#32473; &#20320; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#26377; &#30340; &#65292; &#36824; &#35201; &#32473; &#20182; &#65307; &#27809; &#26377; &#30340; &#65292; &#36830; &#20182; &#25152; &#26377; &#30340; &#20063; &#35201; &#22842; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#35828; &#65306; &#31070; &#30340; &#22269; &#22914; &#21516; &#20154; &#25226; &#31181; &#25746; &#22312; &#22320; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#40657; &#22812; &#30561; &#35273; &#65292; &#30333; &#26085; &#36215; &#26469; &#65292; &#36825; &#31181; &#23601; &#21457; &#33469; &#28176; &#38271; &#65292; &#37027; &#20154; &#21364; &#19981; &#26195; &#24471; &#22914; &#20309; &#36825; &#26679; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#22320; &#29983; &#20116; &#35895; &#26159; &#20986; &#26044; &#33258; &#28982; &#30340; &#65306; &#20808; &#21457; &#33495; &#65292; &#24460; &#38271; &#31319; &#65292; &#20877; &#24460; &#31319; &#19978; &#32467; &#25104; &#39281; &#28385; &#30340; &#23376; &#31890; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#35895; &#26082; &#29087; &#20102; &#65292; &#23601; &#29992; &#38256; &#20992; &#21435; &#21106; &#65292; &#22240; &#20026; &#25910; &#25104; &#30340; &#26102; &#20505; &#21040; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#35828; &#65306; &#31070; &#30340; &#22269; &#65292; &#25105; &#20204; &#21487; &#29992; &#29978; &#40637; &#27604; &#36739; &#21602; &#65311; &#21487; &#29992; &#29978; &#40637; &#27604; &#21947; &#34920; &#26126; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#22909; &#20687; &#19968; &#31890; &#33445; &#33756; &#31181; &#65292; &#31181; &#22312; &#22320; &#37324; &#30340; &#26102; &#20505; &#65292; &#34429; &#27604; &#22320; &#19978; &#30340; &#30334; &#31181; &#37117; &#23567; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#31181; &#19978; &#20197; &#24460; &#65292; &#23601; &#38271; &#36215; &#26469; &#65292; &#27604; &#21508; &#26679; &#30340; &#33756; &#37117; &#22823; &#65292; &#21448; &#38271; &#20986; &#22823; &#26525; &#26469; &#65292; &#29978; &#33267; &#22825; &#19978; &#30340; &#39134; &#40479; &#21487; &#20197; &#23487; &#22312; &#20182; &#30340; &#33643; &#19979; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#29992; &#35768; &#22810; &#36825; &#26679; &#30340; &#27604; &#21947; &#65292; &#29031; &#20182; &#20204; &#25152; &#33021; &#21548; &#30340; &#65292; &#23545; &#20182; &#20204; &#35762; &#36947; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#19981; &#29992; &#27604; &#21947; &#65292; &#23601; &#19981; &#23545; &#20182; &#20204; &#35762; &#65307; &#27809; &#26377; &#20154; &#30340; &#26102; &#20505; &#65292; &#23601; &#25226; &#19968; &#20999; &#30340; &#36947; &#35762; &#32473; &#38376; &#24466; &#21548; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#24403; &#37027; &#22825; &#26202; &#19978; &#65292; &#32822; &#31267; &#23545; &#38376; &#24466; &#35828; &#65306; &#25105; &#20204; &#28193; &#21040; &#37027; &#36793; &#21435; &#32610; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#31163; &#24320; &#20247; &#20154; &#65292; &#32822; &#31267; &#20173; &#22312; &#33337; &#19978; &#65292; &#20182; &#20204; &#23601; &#25226; &#20182; &#19968; &#21516; &#24102; &#21435; &#65307; &#20063; &#26377; &#21035; &#30340; &#33337; &#21644; &#20182; &#21516; &#34892; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#24573; &#28982; &#36215; &#20102; &#26292; &#39118; &#65292; &#27874; &#28010; &#25171; &#20837; &#33337; &#20869; &#65292; &#29978; &#33267; &#33337; &#35201; &#28385; &#20102; &#27700; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#33337; &#23614; &#19978; &#65292; &#26517; &#30528; &#26517; &#22836; &#30561; &#35273; &#12290; &#38376; &#24466; &#21483; &#37266; &#20102; &#20182; &#65292; &#35828; &#65306; &#22827; &#23376; &#65281; &#25105; &#20204; &#20007; &#21629; &#65292; &#20320; &#19981; &#39038; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#37266; &#20102; &#65292; &#26021; &#36131; &#39118; &#65292; &#21521; &#28023; &#35828; &#65306; &#20303; &#20102; &#32610; &#65281; &#38745; &#20102; &#32610; &#65281; &#39118; &#23601; &#27490; &#20303; &#65292; &#22823; &#22823; &#30340; &#24179; &#38745; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#20026; &#29978; &#40637; &#32966; &#24623; &#65311; &#20320; &#20204; &#36824; &#27809; &#26377; &#20449; &#24515; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#22823; &#22823; &#30340; &#24807; &#24597; &#65292; &#24444; &#27492; &#35828; &#65306; &#36825; &#21040; &#24213; &#26159; &#35841; &#65292; &#36830; &#39118; &#21644; &#28023; &#20063; &#21548; &#20174; &#20182; &#20102; &#12290;</td></tr></tbody>
</table>
<br>
</div>

</body></html>