<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>mark1</title></head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><br>
<a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">2 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b></div>

<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255); width: 1607px; height: 412px;" border="0" cellpadding="3" cellspacing="0">

<tbody>
<tr>
<td>
      <table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#36807; &#20102; &#20123; &#26085; &#23376; &#65292; &#32822; &#31267; &#21448; &#36827; &#20102; &#36838; &#30334; &#20892; &#12290; &#20154; &#21548; &#35265; &#20182; &#22312; &#25151; &#23376; &#37324; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#26377; &#35768; &#22810; &#20154; &#32858; &#38598; &#65292; &#29978; &#33267; &#36830; &#38376; &#21069; &#37117; &#27809; &#26377; &#31354; &#22320; &#65307; &#32822; &#31267; &#23601; &#23545; &#20182; &#20204; &#35762; &#36947; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#20154; &#24102; &#30528; &#19968; &#20010; &#30251; &#23376; &#26469; &#35265; &#32822; &#31267; &#65292; &#26159; &#29992; &#22235; &#20010; &#20154; &#25260; &#26469; &#30340; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#20154; &#22810; &#65292; &#19981; &#24471; &#36817; &#21069; &#65292; &#23601; &#25226; &#32822; &#31267; &#25152; &#22312; &#30340; &#25151; &#23376; &#65292; &#25286; &#20102; &#25151; &#39030; &#65292; &#26082; &#25286; &#36890; &#20102; &#65292; &#23601; &#25226; &#30251; &#23376; &#36830; &#25152; &#36538; &#21351; &#30340; &#35109; &#23376; &#37117; &#32530; &#19979; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35265; &#20182; &#20204; &#30340; &#20449; &#24515; &#65292; &#23601; &#23545; &#30251; &#23376; &#35828; &#65306; &#23567; &#23376; &#65292; &#20320; &#30340; &#32618; &#36198; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#20960; &#20010; &#25991; &#22763; &#22352; &#22312; &#37027; &#37324; &#65292; &#24515; &#37324; &#35758; &#35770; &#65292; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#20010; &#20154; &#20026; &#29978; &#40637; &#36825; &#26679; &#35828; &#21602; &#65311; &#20182; &#35828; &#20717; &#22916; &#30340; &#35805; &#20102; &#12290; &#38500; &#20102; &#31070; &#20197; &#22806; &#65292; &#35841; &#33021; &#36198; &#32618; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#24515; &#20013; &#30693; &#36947; &#20182; &#20204; &#24515; &#37324; &#36825; &#26679; &#35758; &#35770; &#65292; &#23601; &#35828; &#65306; &#20320; &#20204; &#24515; &#37324; &#20026; &#29978; &#40637; &#36825; &#26679; &#35758; &#35770; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#25110; &#23545; &#30251; &#23376; &#35828; &#20320; &#30340; &#32618; &#36198; &#20102; &#65292; &#25110; &#35828; &#36215; &#26469; &#65281; &#25343; &#20320; &#30340; &#35109; &#23376; &#34892; &#36208; &#65307; &#37027; &#19968; &#26679; &#23481; &#26131; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#35201; &#21483; &#20320; &#20204; &#30693; &#36947; &#65292; &#20154; &#23376; &#22312; &#22320; &#19978; &#26377; &#36198; &#32618; &#30340; &#26435; &#26564; &#12290; &#23601; &#23545; &#30251; &#23376; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#21545; &#21648; &#20320; &#65292; &#36215; &#26469; &#65281; &#25343; &#20320; &#30340; &#35109; &#23376; &#22238; &#23478; &#21435; &#32610; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#20154; &#23601; &#36215; &#26469; &#65292; &#31435; &#21051; &#25343; &#30528; &#35109; &#23376; &#65292; &#24403; &#20247; &#20154; &#38754; &#21069; &#20986; &#21435; &#20102; &#65292; &#20197; &#33268; &#20247; &#20154; &#37117; &#24778; &#22855; &#65292; &#24402; &#33635; &#32768; &#19982; &#31070; &#65292; &#35828; &#65306; &#25105; &#20204; &#20174; &#26469; &#27809; &#26377; &#35265; &#36807; &#36825; &#26679; &#30340; &#20107; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#20986; &#21040; &#28023; &#36793; &#21435; &#65292; &#20247; &#20154; &#37117; &#23601; &#20102; &#20182; &#26469; &#65292; &#20182; &#20415; &#25945; &#35757; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#32463; &#36807; &#30340; &#26102; &#20505; &#65292; &#30475; &#35265; &#20122; &#21202; &#33107; &#30340; &#20799; &#23376; &#21033; &#26410; &#22352; &#22312; &#31246; &#20851; &#19978; &#65292; &#23601; &#23545; &#20182; &#35828; &#65306; &#20320; &#36319; &#20174; &#25105; &#26469; &#12290; &#20182; &#23601; &#36215; &#26469; &#65292; &#36319; &#20174; &#20102; &#32822; &#31267; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#21033; &#26410; &#23478; &#37324; &#22352; &#24109; &#30340; &#26102; &#20505; &#65292; &#26377; &#22909; &#20123; &#31246; &#21519; &#21644; &#32618; &#20154; &#19982; &#32822; &#31267; &#24182; &#38376; &#24466; &#19968; &#21516; &#22352; &#24109; &#65307; &#22240; &#20026; &#36825; &#26679; &#30340; &#20154; &#22810; &#65292; &#20182; &#20204; &#20063; &#36319; &#38543; &#32822; &#31267; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#27861; &#21033; &#36187; &#20154; &#20013; &#30340; &#25991; &#22763; &#65288; &#26377; &#21476; &#21367; &#65306; &#25991; &#22763; &#21644; &#27861; &#21033; &#36187; &#20154; &#65289; &#30475; &#35265; &#32822; &#31267; &#21644; &#32618; &#20154; &#24182; &#31246; &#21519; &#19968; &#21516; &#21507; &#39277; &#65292; &#23601; &#23545; &#20182; &#38376; &#24466; &#35828; &#65306; &#20182; &#21644; &#31246; &#21519; &#24182; &#32618; &#20154; &#19968; &#21516; &#21507; &#21917; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21548; &#35265; &#65292; &#23601; &#23545; &#20182; &#20204; &#35828; &#65306; &#24247; &#20581; &#30340; &#20154; &#29992; &#19981; &#30528; &#21307; &#29983; &#65292; &#26377; &#30149; &#30340; &#20154; &#25165; &#29992; &#24471; &#30528; &#12290; &#25105; &#26469; &#26412; &#19981; &#26159; &#21484; &#20041; &#20154; &#65292; &#20035; &#26159; &#21484; &#32618; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#24403; &#19979; &#65292; &#32422; &#32752; &#30340; &#38376; &#24466; &#21644; &#27861; &#21033; &#36187; &#20154; &#31105; &#39135; &#12290; &#20182; &#20204; &#26469; &#38382; &#32822; &#31267; &#35828; &#65306; &#32422; &#32752; &#30340; &#38376; &#24466; &#21644; &#27861; &#21033; &#36187; &#20154; &#30340; &#38376; &#24466; &#31105; &#39135; &#65292; &#20320; &#30340; &#38376; &#24466; &#20498; &#19981; &#31105; &#39135; &#65292; &#36825; &#26159; &#20026; &#29978; &#40637; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#26032; &#37070; &#21644; &#38506; &#20276; &#20043; &#20154; &#21516; &#22312; &#30340; &#26102; &#20505; &#65292; &#38506; &#20276; &#20043; &#20154; &#23682; &#33021; &#31105; &#39135; &#21602; &#65311; &#26032; &#37070; &#36824; &#21516; &#22312; &#65292; &#20182; &#20204; &#19981; &#33021; &#31105; &#39135; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#26085; &#23376; &#23558; &#21040; &#65292; &#26032; &#37070; &#35201; &#31163; &#24320; &#20182; &#20204; &#65292; &#37027; &#26085; &#20182; &#20204; &#23601; &#35201; &#31105; &#39135; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#27809; &#26377; &#20154; &#25226; &#26032; &#24067; &#32541; &#22312; &#26087; &#34915; &#26381; &#19978; &#65292; &#24656; &#24597; &#25152; &#34917; &#19978; &#30340; &#26032; &#24067; &#24102; &#22351; &#20102; &#26087; &#34915; &#26381; &#65292; &#30772; &#30340; &#23601; &#26356; &#22823; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#20063; &#27809; &#26377; &#20154; &#25226; &#26032; &#37202; &#35013; &#22312; &#26087; &#30382; &#34955; &#37324; &#65292; &#24656; &#24597; &#37202; &#25226; &#30382; &#34955; &#35010; &#24320; &#65292; &#37202; &#21644; &#30382; &#34955; &#23601; &#37117; &#22351; &#20102; &#65307; &#24799; &#25226; &#26032; &#37202; &#35013; &#22312; &#26032; &#30382; &#34955; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#24403; &#23433; &#24687; &#26085; &#20174; &#40614; &#22320; &#32463; &#36807; &#12290; &#20182; &#38376; &#24466; &#34892; &#36335; &#30340; &#26102; &#20505; &#65292; &#25488; &#20102; &#40614; &#31319; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#27861; &#21033; &#36187; &#20154; &#23545; &#32822; &#31267; &#35828; &#65306; &#30475; &#21738; &#65292; &#20182; &#20204; &#22312; &#23433; &#24687; &#26085; &#20026; &#29978; &#40637; &#20570; &#19981; &#21487; &#20570; &#30340; &#20107; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#32463; &#19978; &#35760; &#30528; &#22823; &#21355; &#21644; &#36319; &#20174; &#20182; &#30340; &#20154; &#32570; &#20047; &#39269; &#39295; &#20043; &#26102; &#25152; &#20570; &#30340; &#20107; &#65292; &#20320; &#20204; &#27809; &#26377; &#24565; &#36807; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#24403; &#20122; &#27604; &#20122; &#20182; &#20316; &#22823; &#31085; &#21496; &#30340; &#26102; &#20505; &#65292; &#24590; &#40637; &#36827; &#20102; &#31070; &#30340; &#27583; &#65292; &#21507; &#20102; &#38472; &#35774; &#39292; &#65292; &#21448; &#32473; &#36319; &#20174; &#20182; &#30340; &#20154; &#21507; &#12290; &#36825; &#39292; &#38500; &#20102; &#31085; &#21496; &#20197; &#22806; &#65292; &#20154; &#37117; &#19981; &#21487; &#21507; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#23433; &#24687; &#26085; &#26159; &#20026; &#20154; &#35774; &#31435; &#30340; &#65292; &#20154; &#19981; &#26159; &#20026; &#23433; &#24687; &#26085; &#35774; &#31435; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#25152; &#20197; &#65292; &#20154; &#23376; &#20063; &#26159; &#23433; &#24687; &#26085; &#30340; &#20027; &#12290;</td></tr></tbody>
      </table>

</td>


</tr>












































</tbody>
</table>

</body></html>