<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>mark1</title></head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">6 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)<br>
</b>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#31163; &#24320; &#37027; &#37324; &#65292; &#26469; &#21040; &#33258; &#24049; &#30340; &#23478; &#20065; &#65307; &#38376; &#24466; &#20063; &#36319; &#20174; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#21040; &#20102; &#23433; &#24687; &#26085; &#65292; &#20182; &#22312; &#20250; &#22530; &#37324; &#25945; &#35757; &#20154; &#12290; &#20247; &#20154; &#21548; &#35265; &#65292; &#23601; &#29978; &#24076; &#22855; &#65292; &#35828; &#65306; &#36825; &#20154; &#20174; &#37027; &#37324; &#26377; &#36825; &#20123; &#20107; &#21602; &#65311; &#25152; &#36176; &#32473; &#20182; &#30340; &#26159; &#29978; &#40637; &#26234; &#24935; &#65311; &#20182; &#25163; &#25152; &#20570; &#30340; &#26159; &#20309; &#31561; &#30340; &#24322; &#33021; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#36825;
&#19981; &#26159; &#37027; &#26408; &#21280; &#40637; &#65311; &#19981; &#26159; &#39532; &#21033; &#20122; &#30340; &#20799; &#23376; &#38597; &#21508; &#12289; &#32422; &#35199; &#12289; &#29369; &#22823; &#12289; &#35199; &#38376; &#30340; &#38271; &#20804; &#40637; &#65311; &#20182; &#22969; &#22969; &#20204; &#19981;
&#20063; &#26159; &#22312; &#25105; &#20204; &#36825; &#37324; &#40637; &#65311; &#20182; &#20204; &#23601; &#21388; &#24323; &#20182; &#12290; &#65288; &#21388; &#24323; &#20182; &#65306; &#21407; &#25991; &#26159; &#22240; &#20182; &#36300; &#20498; &#65289;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#22823; &#20961; &#20808; &#30693; &#65292; &#38500; &#20102; &#26412; &#22320; &#12289; &#20146; &#23646; &#12289; &#26412; &#23478; &#20043; &#22806; &#65292; &#27809; &#26377; &#19981; &#34987; &#20154; &#23562; &#25964; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#22312; &#37027; &#37324; &#19981; &#24471; &#34892; &#29978; &#40637; &#24322; &#33021; &#65292; &#19981; &#36807; &#25353; &#25163; &#22312; &#20960; &#20010; &#30149; &#20154; &#36523; &#19978; &#65292; &#27835; &#22909; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20063; &#35815; &#24322; &#20182; &#20204; &#19981; &#20449; &#65292; &#23601; &#24448; &#21608; &#22260; &#20065; &#26449; &#25945; &#35757; &#20154; &#21435; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21483; &#20102; &#21313; &#20108; &#20010; &#38376; &#24466; &#26469; &#65292; &#24046; &#36963; &#20182; &#20204; &#20004; &#20010; &#20004; &#20010; &#30340; &#20986; &#21435; &#65292; &#20063; &#36176; &#32473; &#20182; &#20204; &#26435; &#26564; &#65292; &#21046; &#20239; &#27745; &#39740; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#24182; &#19988; &#22065; &#21648; &#20182; &#20204; &#65306; &#34892; &#36335; &#30340; &#26102; &#20505; &#19981; &#35201; &#24102; &#39135; &#29289; &#21644; &#21475; &#34955; &#65292; &#33136; &#34955; &#37324; &#20063; &#19981; &#35201; &#24102; &#38065; &#65292; &#38500; &#20102; ? &#26454; &#20197; &#22806; &#65292; &#29978; &#40637; &#37117; &#19981; &#35201; &#24102; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#21482; &#35201; &#31359; &#38795; &#65292; &#20063; &#19981; &#35201; &#31359; &#20004; &#20214; &#25346; &#23376; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#26080; &#35770; &#21040; &#20309; &#22788; &#65292; &#36827; &#20102; &#20154; &#30340; &#23478; &#65292; &#23601; &#20303; &#22312; &#37027; &#37324; &#65292; &#30452; &#21040; &#31163; &#24320; &#37027; &#22320; &#26041; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#20309; &#22788; &#30340; &#20154; &#19981; &#25509; &#24453; &#20320; &#20204; &#65292; &#19981; &#21548; &#20320; &#20204; &#65292; &#20320; &#20204; &#31163; &#24320; &#37027; &#37324; &#30340; &#26102; &#20505; &#65292; &#23601; &#25226; &#33050; &#19978; &#30340; &#23576; &#22303; &#36346; &#19979; &#21435; &#65292; &#23545; &#20182; &#20204; &#20316; &#35265; &#35777; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#23601; &#20986; &#21435; &#20256; &#36947; &#65292; &#21483; &#20154; &#24724; &#25913; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#36214; &#20986; &#35768; &#22810; &#30340; &#39740; &#65292; &#29992; &#27833; &#25273; &#20102; &#35768; &#22810; &#30149; &#20154; &#65292; &#27835; &#22909; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#30340; &#21517; &#22768; &#20256; &#25196; &#20986; &#26469; &#12290; &#24076; &#24459; &#29579; &#21548; &#35265; &#20102; &#65292; &#23601; &#35828; &#65306; &#26045; &#27927; &#30340; &#32422; &#32752; &#20174; &#27515; &#37324; &#22797; &#27963; &#20102; &#65292; &#25152; &#20197; &#36825; &#20123; &#24322; &#33021; &#30001; &#20182; &#37324; &#38754; &#21457; &#20986; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#21035; &#20154; &#35828; &#65306; &#26159; &#20197; &#21033; &#20122; &#12290; &#21448; &#26377; &#20154; &#35828; &#65306; &#26159; &#20808; &#30693; &#65292; &#27491; &#20687; &#20808; &#30693; &#20013; &#30340; &#19968; &#20301; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#24076; &#24459; &#21548; &#35265; &#21364; &#35828; &#65306; &#26159; &#25105; &#25152; &#26025; &#30340; &#32422; &#32752; &#65292; &#20182; &#22797; &#27963; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20808; &#26159; &#24076; &#24459; &#20026; &#20182; &#20804; &#24351; &#33107; &#21147; &#30340; &#22971; &#23376; &#24076; &#32599; &#24213; &#30340; &#32536; &#25925; &#65292; &#24046; &#20154; &#21435; &#25343; &#20303; &#32422; &#32752; &#65292; &#38145; &#22312; &#30417; &#37324; &#65292; &#22240; &#20026; &#24076; &#24459; &#24050; &#32463; &#23094; &#20102; &#37027; &#22919; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#32422; &#32752; &#26366; &#23545; &#24076; &#24459; &#35828; &#65306; &#20320; &#23094; &#20320; &#20804; &#24351; &#30340; &#22971; &#23376; &#26159; &#19981; &#21512; &#29702; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#24076; &#32599; &#24213; &#24576; &#24680; &#20182; &#65292; &#24819; &#35201; &#26432; &#20182; &#65292; &#21482; &#26159; &#19981; &#33021; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#24076; &#24459; &#30693; &#36947; &#32422; &#32752; &#26159; &#20041; &#20154; &#65292; &#26159; &#22307; &#20154; &#65292; &#25152; &#20197; &#25964; &#30031; &#20182; &#65292; &#20445; &#25252; &#20182; &#65292; &#21548; &#20182; &#35762; &#35770; &#65292; &#23601; &#22810; &#29031; &#30528; &#34892; &#65288; &#26377; &#21476; &#21367; &#65306; &#28216; &#31227; &#19981; &#23450; &#65289; &#65292; &#24182; &#19988; &#20048; &#24847; &#21548; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#22825; &#65292; &#24688; &#24039; &#26159; &#24076; &#24459; &#30340; &#29983; &#26085; &#65292; &#24076; &#24459; &#25670; &#35774; &#31605; &#24109; &#65292; &#35831; &#20102; &#22823; &#33251; &#21644; &#21315; &#22827; &#38271; &#65292; &#24182; &#21152; &#21033; &#21033; &#20316; &#39318; &#39046; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#24076; &#32599; &#24213; &#30340; &#22899; &#20799; &#36827; &#26469; &#36339; &#33310; &#65292; &#20351; &#24076; &#24459; &#21644; &#21516; &#24109; &#30340; &#20154; &#37117; &#27426; &#21916; &#12290; &#29579; &#23601; &#23545; &#22899; &#23376; &#35828; &#65306; &#20320; &#38543; &#24847; &#21521; &#25105; &#27714; &#29978; &#40637; &#65292; &#25105; &#24517; &#32473; &#20320; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#23545; &#20182; &#36215; &#35475; &#35828; &#65306; &#38543; &#20320; &#21521; &#25105; &#27714; &#29978; &#40637; &#65292; &#23601; &#26159; &#25105; &#22269; &#30340; &#19968; &#21322; &#65292; &#25105; &#20063; &#24517; &#32473; &#20320; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#23601; &#20986; &#21435; &#23545; &#20182; &#27597; &#20146; &#35828; &#65306; &#25105; &#21487; &#20197; &#27714; &#29978; &#40637; &#21602; &#65311; &#20182; &#27597; &#20146; &#35828; &#65306; &#26045; &#27927; &#32422; &#32752; &#30340; &#22836; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#23601; &#24613; &#24537; &#36827; &#21435; &#35265; &#29579; &#65292; &#27714; &#20182; &#35828; &#65306; &#25105; &#24895; &#29579; &#31435; &#26102; &#25226; &#26045; &#27927; &#32422; &#32752; &#30340; &#22836; &#25918; &#22312; &#30424; &#23376; &#37324; &#32473; &#25105; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#29579; &#23601; &#29978; &#24551; &#24833; &#65307; &#20294; &#22240; &#20182; &#25152; &#36215; &#30340; &#35475; &#65292; &#21448; &#22240; &#21516; &#24109; &#30340; &#20154; &#65292; &#23601; &#19981; &#32943; &#25512; &#36766; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#38543; &#21363; &#24046; &#19968; &#20010; &#25252; &#21355; &#20853; &#65292; &#21545; &#21648; &#25343; &#32422; &#32752; &#30340; &#22836; &#26469; &#12290; &#25252; &#21355; &#20853; &#23601; &#21435; &#65292; &#22312; &#30417; &#37324; &#26025; &#20102; &#32422; &#32752; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#25226; &#22836; &#25918; &#22312; &#30424; &#23376; &#37324; &#65292; &#25343; &#26469; &#32473; &#22899; &#23376; &#65292; &#22899; &#23376; &#23601; &#32473; &#20182; &#27597; &#20146; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#32422; &#32752; &#30340; &#38376; &#24466; &#21548; &#35265; &#20102; &#65292; &#23601; &#26469; &#25226; &#20182; &#30340; &#23608; &#39318; &#39046; &#21435; &#65292; &#33900; &#22312; &#22367; &#22675; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#20351; &#24466; &#32858; &#38598; &#21040; &#32822; &#31267; &#37027; &#37324; &#65292; &#23558; &#19968; &#20999; &#25152; &#20570; &#30340; &#20107; &#12289; &#25152; &#20256; &#30340; &#36947; &#20840; &#21578; &#35785; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#23601; &#35828; &#65306; &#20320; &#20204; &#26469; &#65292; &#21516; &#25105; &#26263; &#26263; &#30340; &#21040; &#26103; &#37326; &#22320; &#26041; &#21435; &#27463; &#19968; &#27463; &#12290; &#36825; &#26159; &#22240; &#20026; &#26469; &#24448; &#30340; &#20154; &#22810; &#65292; &#20182; &#20204; &#36830; &#21507; &#39277; &#20063; &#27809; &#26377; &#24037; &#22827; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#22352; &#33337; &#65292; &#26263; &#26263; &#30340; &#24448; &#26103; &#37326; &#22320; &#26041; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#30475; &#35265; &#20182; &#20204; &#21435; &#65292; &#26377; &#35768; &#22810; &#35748; &#35782; &#20182; &#20204; &#30340; &#65292; &#23601; &#20174; &#21508; &#22478; &#27493; &#34892; &#65292; &#19968; &#21516; &#36305; &#21040; &#37027; &#37324; &#65292; &#27604; &#20182; &#20204; &#20808; &#36214; &#21040; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#20986; &#26469; &#65292; &#35265; &#26377; &#35768; &#22810; &#30340; &#20154; &#65292; &#23601; &#24604; &#24751; &#20182; &#20204; &#65292; &#22240; &#20026; &#20182; &#20204; &#22914; &#21516; &#32650; &#27809; &#26377; &#29287; &#20154; &#19968; &#33324; &#65292; &#26044; &#26159; &#24320; &#21475; &#25945; &#35757; &#20182; &#20204; &#35768; &#22810; &#36947; &#29702; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#22825; &#24050; &#32463; &#26202; &#20102; &#65292; &#38376; &#24466; &#36827; &#21069; &#26469; &#65292; &#35828; &#65306; &#36825; &#26159; &#37326; &#22320; &#65292; &#22825; &#24050; &#32463; &#26202; &#20102; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#35831; &#21483; &#20247; &#20154; &#25955; &#24320; &#65292; &#20182; &#20204; &#22909; &#24448; &#22235; &#38754; &#20065; &#26449; &#37324; &#21435; &#65292; &#33258; &#24049; &#20080; &#29978; &#40637; &#21507; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22238; &#31572; &#35828; &#65306; &#20320; &#20204; &#32473; &#20182; &#20204; &#21507; &#32610; &#12290; &#38376; &#24466; &#35828; &#65306; &#25105; &#20204; &#21487; &#20197; &#21435; &#20080; &#20108; &#21313; &#20004; &#38134; &#23376; &#30340; &#39292; &#65292; &#32473; &#20182; &#20204; &#21507; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#20320; &#20204; &#26377; &#22810; &#23569; &#39292; &#65292; &#21487; &#20197; &#21435; &#30475; &#30475; &#12290; &#20182; &#20204; &#30693; &#36947; &#20102; &#65292; &#23601; &#35828; &#65306; &#20116; &#20010; &#39292; &#65292; &#20004; &#26465; &#40060; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21545; &#21648; &#20182; &#20204; &#65292; &#21483; &#20247; &#20154; &#19968; &#24110; &#19968; &#24110; &#30340; &#22352; &#22312; &#38738; &#33609; &#22320; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#23601; &#19968; &#25490; &#19968; &#25490; &#30340; &#22352; &#19979; &#65292; &#26377; &#19968; &#30334; &#19968; &#25490; &#30340; &#65292; &#26377; &#20116; &#21313; &#19968; &#25490; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#25343; &#30528; &#36825; &#20116; &#20010; &#39292; &#65292; &#20004; &#26465; &#40060; &#65292; &#26395; &#30528; &#22825; &#31069; &#31119; &#65292; &#25816; &#24320; &#39292; &#65292; &#36882; &#32473; &#38376; &#24466; &#65292; &#25670; &#22312; &#20247; &#20154; &#38754; &#21069; &#65292; &#20063; &#25226; &#37027; &#20004; &#26465; &#40060; &#20998; &#32473; &#20247; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">42</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#37117; &#21507; &#65292; &#24182; &#19988; &#21507; &#39281; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">43</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#23601; &#25226; &#30862; &#39292; &#30862; &#40060; &#25910; &#25342; &#36215; &#26469; &#65292; &#35013; &#28385; &#20102; &#21313; &#20108; &#20010; &#31726; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">44</bdo>.&nbsp;</td><td align="left" valign="top">&#21507; &#39292; &#30340; &#30007; &#20154; &#20849; &#26377; &#20116; &#21315; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">45</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#38543; &#21363; &#20652; &#38376; &#24466; &#19978; &#33337; &#65292; &#20808; &#28193; &#21040; &#37027; &#36793; &#20271; &#36187; &#22823; &#21435; &#65292; &#31561; &#20182; &#21483; &#20247; &#20154; &#25955; &#24320; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">46</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#26082; &#36766; &#21035; &#20102; &#20182; &#20204; &#65292; &#23601; &#24448; &#23665; &#19978; &#21435; &#31095; &#21578; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">47</bdo>.&nbsp;</td><td align="left" valign="top">&#21040; &#20102; &#26202; &#19978; &#65292; &#33337; &#22312; &#28023; &#20013; &#65292; &#32822; &#31267; &#29420; &#33258; &#22312; &#23736; &#19978; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">48</bdo>.&nbsp;</td><td align="left" valign="top">&#30475; &#35265; &#38376; &#24466; &#22240; &#39118; &#19981; &#39034; &#65292; &#25671; &#27257; &#29978; &#33510; &#12290; &#22812; &#37324; &#32422; &#26377; &#22235; &#26356; &#22825; &#65292; &#23601; &#22312; &#28023; &#38754; &#19978; &#36208; &#65292; &#24448; &#20182; &#20204; &#37027; &#37324; &#21435; &#65292; &#24847; &#24605; &#35201; &#36208; &#36807; &#20182; &#20204; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">49</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#38376; &#24466; &#30475; &#35265; &#20182; &#22312; &#28023; &#38754; &#19978; &#36208; &#65292; &#20197; &#20026; &#26159; &#39740; &#24618; &#65292; &#23601; &#21898; &#21483; &#36215; &#26469; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">50</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#20182; &#20204; &#37117; &#30475; &#35265; &#20102; &#20182; &#65292; &#19988; &#29978; &#24778; &#24908; &#12290; &#32822; &#31267; &#36830; &#24537; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#25918; &#24515; &#65281; &#26159; &#25105; &#65292; &#19981; &#35201; &#24597; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">51</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#21040; &#20182; &#20204; &#37027; &#37324; &#65292; &#19978; &#20102; &#33337; &#65292; &#39118; &#23601; &#20303; &#20102; &#65307; &#20182; &#20204; &#24515; &#37324; &#21313; &#20998; &#24778; &#22855; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">52</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#26159; &#22240; &#20026; &#20182; &#20204; &#19981; &#26126; &#30333; &#37027; &#20998; &#39292; &#30340; &#20107; &#65292; &#24515; &#37324; &#36824; &#26159; &#24858; &#39037; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">53</bdo>.&nbsp;</td><td align="left" valign="top">&#26082; &#28193; &#36807; &#21435; &#65292; &#26469; &#21040; &#38761; &#23612; &#25746; &#21202; &#22320; &#26041; &#65292; &#23601; &#38752; &#20102; &#23736; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">54</bdo>.&nbsp;</td><td align="left" valign="top">&#19968; &#19979; &#33337; &#65292; &#20247; &#20154; &#35748; &#24471; &#26159; &#32822; &#31267; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">55</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#36305; &#36941; &#37027; &#19968; &#24102; &#22320; &#26041; &#65292; &#21548; &#35265; &#20182; &#22312; &#20309; &#22788; &#65292; &#20415; &#23558; &#26377; &#30149; &#30340; &#20154; &#29992; &#35109; &#23376; &#25260; &#21040; &#37027; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">56</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#32822; &#31267; &#25152; &#21040; &#30340; &#22320; &#26041; &#65292; &#25110; &#26449; &#20013; &#65292; &#25110; &#22478; &#37324; &#65292; &#25110; &#20065; &#38388; &#65292; &#20182; &#20204; &#37117; &#23558; &#30149; &#20154; &#25918; &#22312; &#34903; &#24066; &#19978; &#65292; &#27714; &#32822; &#31267; &#21482; &#23481; &#20182; &#20204; &#25720; &#20182; &#30340; &#34915; &#35059; ? &#23376; &#65307; &#20961; &#25720; &#30528; &#30340; &#20154; &#23601; &#37117; &#22909; &#20102; &#12290;</td></tr></tbody>
</table>
<br>
</div>
</body></html>