<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">3 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)<br>
</b>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#36827; &#20102; &#20250; &#22530; &#65292; &#22312; &#37027; &#37324; &#26377; &#19968; &#20010; &#20154; &#26543; &#20094; &#20102; &#19968; &#21482; &#25163; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#31397; &#25506; &#32822; &#31267; &#65292; &#22312; &#23433; &#24687; &#26085; &#21307; &#27835; &#19981; &#21307; &#27835; &#65292; &#24847; &#24605; &#26159; &#35201; &#25511; &#21578; &#32822; &#31267; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#37027; &#26543; &#20094; &#19968; &#21482; &#25163; &#30340; &#20154; &#35828; &#65306; &#36215; &#26469; &#65292; &#31449; &#22312; &#24403; &#20013; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#38382; &#20247; &#20154; &#35828; &#65306; &#22312; &#23433; &#24687; &#26085; &#34892; &#21892; &#34892; &#24694; &#65292; &#25937; &#21629; &#23475; &#21629; &#65292; &#37027; &#26679; &#26159; &#21487; &#20197; &#30340; &#21602; &#65311; &#20182; &#20204; &#37117; &#19981; &#20316; &#22768; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#24594; &#30446; &#21608; &#22260; &#30475; &#20182; &#20204; &#65292; &#24551; &#24833; &#20182; &#20204; &#30340; &#24515; &#21018; &#30828; &#65292; &#23601; &#23545; &#37027; &#20154; &#35828; &#65306; &#20280; &#20986; &#25163; &#26469; &#65281; &#20182; &#25226; &#25163; &#19968; &#20280; &#65292; &#25163; &#23601; &#22797; &#20102; &#21407; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#27861; &#21033; &#36187; &#20154; &#20986; &#21435; &#65292; &#21516; &#24076; &#24459; &#19968; &#20826; &#30340; &#20154; &#21830; &#35758; &#24590; &#26679; &#21487; &#20197; &#38500; &#28781; &#32822; &#31267; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21644; &#38376; &#24466; &#36864; &#21040; &#28023; &#36793; &#21435; &#65292; &#26377; &#35768; &#22810; &#20154; &#20174; &#21152; &#21033; &#21033; &#36319; &#38543; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#36824; &#26377; &#35768; &#22810; &#20154; &#21548; &#35265; &#20182; &#25152; &#20570; &#30340; &#22823; &#20107; &#65292; &#23601; &#20174; &#29369; &#22826; &#12289; &#32822; &#36335; &#25746; &#20919; &#12289; &#20197; &#22303; &#20080; &#12289; &#32422; &#20294; &#27827; &#22806; &#65292; &#24182; &#25512; &#32599; &#12289; &#35199; &#39039; &#30340; &#22235; &#26041; &#26469; &#21040; &#20182; &#37027; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#22240; &#20026; &#20154; &#22810; &#65292; &#23601; &#21545; &#21648; &#38376; &#24466; &#21483; &#19968; &#21482; &#23567; &#33337; &#20282; &#20505; &#30528; &#65292; &#20813; &#24471; &#20247; &#20154; &#25317; &#25380; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#27835; &#22909; &#20102; &#35768; &#22810; &#20154; &#65292; &#25152; &#20197; &#20961; &#26377; &#28798; &#30149; &#30340; &#65292; &#37117; &#25380; &#36827; &#26469; &#35201; &#25720; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#27745; &#39740; &#26080; &#35770; &#20309; &#26102; &#30475; &#35265; &#20182; &#65292; &#23601; &#20463; &#20239; &#22312; &#20182; &#38754; &#21069; &#65292; &#21898; &#30528; &#35828; &#65306; &#20320; &#26159; &#31070; &#30340; &#20799; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#20877; &#19977; &#30340; &#22065; &#21648; &#20182; &#20204; &#65292; &#19981; &#35201; &#25226; &#20182; &#26174; &#38706; &#20986; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#19978; &#20102; &#23665; &#65292; &#38543; &#33258; &#24049; &#30340; &#24847; &#24605; &#21483; &#20154; &#26469; &#65307; &#20182; &#20204; &#20415; &#26469; &#21040; &#20182; &#37027; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#23601; &#35774; &#31435; &#21313; &#20108; &#20010; &#20154; &#65292; &#35201; &#20182; &#20204; &#24120; &#21644; &#33258; &#24049; &#21516; &#22312; &#65292; &#20063; &#35201; &#24046; &#20182; &#20204; &#21435; &#20256; &#36947; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#24182; &#32473; &#20182; &#20204; &#26435; &#26564; &#36214; &#39740; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#21313; &#20108; &#20010; &#20154; &#26377; &#35199; &#38376; &#9472; &#32822; &#31267; &#21448; &#32473; &#20182; &#36215; &#21517; &#21483; &#24444; &#24471; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#36824; &#26377; &#35199; &#24199; &#22826; &#30340; &#20799; &#23376; &#38597; &#21508; &#21644; &#38597; &#21508; &#30340; &#20804; &#24351; &#32422; &#32752; &#65292; &#21448; &#32473; &#36825; &#20004; &#20010; &#20154; &#36215; &#21517; &#21483; &#21322; &#23612; &#20854; &#65292; &#23601; &#26159; &#38647; &#23376; &#30340; &#24847; &#24605; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#26377; &#23433; &#24471; &#28872; &#12289; &#33107; &#21147; &#12289; &#24052; &#22810; &#32599; &#20080; &#12289; &#39532; &#22826; &#12289; &#22810; &#39532; &#12289; &#20122; &#21202; &#33107; &#30340; &#20799; &#23376; &#38597; &#21508; &#12289; &#21644; &#36798; &#22826; &#65292; &#24182; &#22859; &#38160; &#20826; &#30340; &#35199; &#38376; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#36824; &#26377; &#21334; &#32822; &#31267; &#30340; &#21152; &#30053; &#20154; &#29369; &#22823; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#36827; &#20102; &#19968; &#20010; &#23627; &#23376; &#65292; &#20247; &#20154; &#21448; &#32858; &#38598; &#65292; &#29978; &#33267; &#20182; &#36830; &#39277; &#20063; &#39038; &#19981; &#24471; &#21507; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#30340; &#20146; &#23646; &#21548; &#35265; &#65292; &#23601; &#20986; &#26469; &#35201; &#25289; &#20303; &#20182; &#65292; &#22240; &#20026; &#20182; &#20204; &#35828; &#20182; &#30315; &#29378; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#20174; &#32822; &#36335; &#25746; &#20919; &#19979; &#26469; &#30340; &#25991; &#22763; &#35828; &#65306; &#20182; &#26159; &#34987; &#21035; &#35199; &#21340; &#38468; &#30528; &#65307; &#21448; &#35828; &#65306; &#20182; &#26159; &#38752; &#30528; &#39740; &#29579; &#36214; &#39740; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21483; &#20182; &#20204; &#26469; &#65292; &#29992; &#27604; &#21947; &#23545; &#20182; &#20204; &#35828; &#65306; &#25746; &#20294; &#24590; &#33021; &#36214; &#20986; &#25746; &#20294; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#19968; &#22269; &#33258; &#30456; &#20998; &#20105; &#65292; &#37027; &#22269; &#23601; &#31449; &#31435; &#19981; &#20303; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#19968; &#23478; &#33258; &#30456; &#20998; &#20105; &#65292; &#37027; &#23478; &#23601; &#31449; &#31435; &#19981; &#20303; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#25746; &#20294; &#33258; &#30456; &#25915; &#25171; &#20998; &#20105; &#65292; &#20182; &#23601; &#31449; &#31435; &#19981; &#20303; &#65292; &#24517; &#35201; &#28781; &#20129; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#27809; &#26377; &#20154; &#33021; &#36827; &#22766; &#22763; &#23478; &#37324; &#65292; &#25250; &#22842; &#20182; &#30340; &#23478; &#20855; &#65307; &#24517; &#20808; &#25414; &#20303; &#37027; &#22766; &#22763; &#65292; &#25165; &#21487; &#20197; &#25250; &#22842; &#20182; &#30340; &#23478; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#19990; &#20154; &#19968; &#20999; &#30340; &#32618; &#21644; &#19968; &#20999; &#20149; &#28174; &#30340; &#35805; &#37117; &#21487; &#24471; &#36198; &#20813; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#20149; &#28174; &#22307; &#28789; &#30340; &#65292; &#21364; &#27704; &#19981; &#24471; &#36198; &#20813; &#65292; &#20035; &#35201; &#25285; &#24403; &#27704; &#36828; &#30340; &#32618; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#35805; &#26159; &#22240; &#20026; &#20182; &#20204; &#35828; &#65306; &#20182; &#26159; &#34987; &#27745; &#39740; &#38468; &#30528; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#24403; &#19979; &#65292; &#32822; &#31267; &#30340; &#27597; &#20146; &#21644; &#24351; &#20804; &#26469; &#65292; &#31449; &#22312; &#22806; &#36793; &#65292; &#25171; &#21457; &#20154; &#21435; &#21483; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#35768; &#22810; &#20154; &#22312; &#32822; &#31267; &#21608; &#22260; &#22352; &#30528; &#65292; &#20182; &#20204; &#23601; &#21578; &#35785; &#20182; &#35828; &#65306; &#30475; &#21738; &#65292; &#20320; &#27597; &#20146; &#21644; &#20320; &#24351; &#20804; &#22312; &#22806; &#36793; &#25214; &#20320; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22238; &#31572; &#35828; &#65306; &#35841; &#26159; &#25105; &#30340; &#27597; &#20146; &#65311; &#35841; &#26159; &#25105; &#30340; &#24351; &#20804; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#22235; &#38754; &#35266; &#30475; &#37027; &#21608; &#22260; &#22352; &#30528; &#30340; &#20154; &#65292; &#35828; &#65306; &#30475; &#21738; &#65292; &#25105; &#30340; &#27597; &#20146; &#65292; &#25105; &#30340; &#24351; &#20804; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#36981; &#34892; &#31070; &#26088; &#24847; &#30340; &#20154; &#23601; &#26159; &#25105; &#30340; &#24351; &#20804; &#22992; &#22969; &#21644; &#27597; &#20146; &#20102; &#12290;</td></tr></tbody>
</table>
<br>
</div>

</body></html>