<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">5 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)<br>
</b>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#28023; &#37027; &#36793; &#26684; &#25289; &#26862; &#20154; &#30340; &#22320; &#26041; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#19968; &#19979; &#33337; &#65292; &#23601; &#26377; &#19968; &#20010; &#34987; &#27745; &#39740; &#38468; &#30528; &#30340; &#20154; &#20174; &#22367; &#33556; &#37324; &#20986; &#26469; &#36814; &#30528; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#20154; &#24120; &#20303; &#22312; &#22367; &#33556; &#37324; &#65292; &#27809; &#26377; &#20154; &#33021; &#25414; &#20303; &#20182; &#65292; &#23601; &#26159; &#29992; &#38081; &#28860; &#20063; &#19981; &#33021; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#20154; &#23649; &#27425; &#29992; &#33050; &#38243; &#21644; &#38081; &#28860; &#25414; &#38145; &#20182; &#65292; &#38081; &#28860; &#31455; &#34987; &#20182; &#25379; &#26029; &#20102; &#65292; &#33050; &#38243; &#20063; &#34987; &#20182; &#24324; &#30862; &#20102; &#65307; &#24635; &#27809; &#26377; &#20154; &#33021; &#21046; &#20239; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#26172; &#22812; &#24120; &#22312; &#22367; &#33556; &#37324; &#21644; &#23665; &#20013; &#21898; &#21483; &#65292; &#21448; &#29992; &#30707; &#22836; &#30733; &#33258; &#24049; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#36828; &#36828; &#30340; &#30475; &#35265; &#32822; &#31267; &#65292; &#23601; &#36305; &#36807; &#21435; &#25308; &#20182; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#22823; &#22768; &#21628; &#21483; &#35828; &#65306; &#33267; &#39640; &#31070; &#30340; &#20799; &#23376; &#32822; &#31267; &#65292; &#25105; &#19982; &#20320; &#26377; &#29978; &#40637; &#30456; &#24178; &#65311; &#25105; &#25351; &#30528; &#31070; &#24691; &#27714; &#20320; &#65292; &#19981; &#35201; &#21483; &#25105; &#21463; &#33510; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#26159; &#22240; &#32822; &#31267; &#26366; &#21545; &#21648; &#20182; &#35828; &#65306; &#27745; &#39740; &#38463; &#65292; &#20174; &#36825; &#20154; &#36523; &#19978; &#20986; &#26469; &#32610; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#38382; &#20182; &#35828; &#65306; &#20320; &#21517; &#21483; &#29978; &#40637; &#65311; &#22238; &#31572; &#35828; &#65306; &#25105; &#21517; &#21483; &#32676; &#65292; &#22240; &#20026; &#25105; &#20204; &#22810; &#30340; &#32536; &#25925; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#20877; &#19977; &#30340; &#27714; &#32822; &#31267; &#65292; &#19981; &#35201; &#21483; &#20182; &#20204; &#31163; &#24320; &#37027; &#22320; &#26041; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#37027; &#37324; &#23665; &#22369; &#19978; &#65292; &#26377; &#19968; &#22823; &#32676; &#29482; &#21507; &#39135; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#39740; &#23601; &#22830; &#27714; &#32822; &#31267; &#35828; &#65306; &#27714; &#20320; &#25171; &#21457; &#25105; &#20204; &#24448; &#29482; &#32676; &#37324; &#65292; &#38468; &#30528; &#29482; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#20934; &#20102; &#20182; &#20204; &#65292; &#27745; &#39740; &#23601; &#20986; &#26469; &#65292; &#36827; &#20837; &#29482; &#37324; &#21435; &#12290; &#26044; &#26159; &#37027; &#32676; &#29482; &#38383; &#19979; &#23665; &#23830; &#65292; &#25237; &#22312; &#28023; &#37324; &#65292; &#28153; &#27515; &#20102; &#12290; &#29482; &#30340; &#25968; &#30446; &#32422; &#26377; &#20108; &#21315; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#25918; &#29482; &#30340; &#23601; &#36867; &#36305; &#20102; &#65292; &#21435; &#21578; &#35785; &#22478; &#37324; &#21644; &#20065; &#19979; &#30340; &#20154; &#12290; &#20247; &#20154; &#23601; &#26469; &#65292; &#35201; &#30475; &#26159; &#29978; &#40637; &#20107; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#32822; &#31267; &#37027; &#37324; &#65292; &#30475; &#35265; &#37027; &#34987; &#39740; &#38468; &#30528; &#30340; &#20154; &#65292; &#23601; &#26159; &#20174; &#21069; &#34987; &#32676; &#39740; &#25152; &#38468; &#30340; &#65292; &#22352; &#30528; &#65292; &#31359; &#19978; &#34915; &#26381; &#65292; &#24515; &#37324; &#26126; &#30333; &#36807; &#26469; &#65292; &#20182; &#20204; &#23601; &#23475; &#24597; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#30475; &#35265; &#36825; &#20107; &#30340; &#65292; &#20415; &#23558; &#39740; &#38468; &#20043; &#20154; &#25152; &#36935; &#35265; &#30340; &#21644; &#37027; &#32676; &#29482; &#30340; &#20107; &#37117; &#21578; &#35785; &#20102; &#20247; &#20154; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#23601; &#22830; &#27714; &#32822; &#31267; &#31163; &#24320; &#20182; &#20204; &#30340; &#22659; &#30028; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#19978; &#33337; &#30340; &#26102; &#20505; &#65292; &#37027; &#20174; &#21069; &#34987; &#39740; &#38468; &#30528; &#30340; &#20154; &#24691; &#27714; &#21644; &#32822; &#31267; &#21516; &#22312; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#19981; &#35768; &#65292; &#21364; &#23545; &#20182; &#35828; &#65306; &#20320; &#22238; &#23478; &#21435; &#65292; &#21040; &#20320; &#30340; &#20146; &#23646; &#37027; &#37324; &#65292; &#23558; &#20027; &#20026; &#20320; &#25152; &#20570; &#30340; &#26159; &#20309; &#31561; &#22823; &#30340; &#20107; &#65292; &#26159; &#24590; &#26679; &#24604; &#24751; &#20320; &#65292; &#37117; &#21578; &#35785; &#20182; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#20154; &#23601; &#36208; &#20102; &#65292; &#22312; &#20302; &#21152; &#27874; &#21033; &#20256; &#25196; &#32822; &#31267; &#20026; &#20182; &#20570; &#20102; &#20309; &#31561; &#22823; &#30340; &#20107; &#65292; &#20247; &#20154; &#23601; &#37117; &#24076; &#22855; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22352; &#33337; &#21448; &#28193; &#21040; &#37027; &#36793; &#21435; &#65292; &#23601; &#26377; &#35768; &#22810; &#20154; &#21040; &#20182; &#37027; &#37324; &#32858; &#38598; &#65307; &#20182; &#27491; &#22312; &#28023; &#36793; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#20010; &#31649; &#20250; &#22530; &#30340; &#20154; &#65292; &#21517; &#21483; &#30554; &#40065; &#65292; &#26469; &#35265; &#32822; &#31267; &#65292; &#23601; &#20463; &#20239; &#22312; &#20182; &#33050; &#21069; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#20877; &#19977; &#30340; &#27714; &#20182; &#65292; &#35828; &#65306; &#25105; &#30340; &#23567; &#22899; &#20799; &#24555; &#35201; &#27515; &#20102; &#65292; &#27714; &#20320; &#21435; &#25353; &#25163; &#22312; &#20182; &#36523; &#19978; &#65292; &#20351; &#20182; &#30154; &#24840; &#65292; &#24471; &#20197; &#27963; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#21644; &#20182; &#21516; &#21435; &#12290; &#26377; &#35768; &#22810; &#20154; &#36319; &#38543; &#25317; &#25380; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#20010; &#22899; &#20154; &#65292; &#24739; &#20102; &#21313; &#20108; &#24180; &#30340; &#34880; &#28431; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#22909; &#20123; &#21307; &#29983; &#25163; &#37324; &#21463; &#20102; &#35768; &#22810; &#30340; &#33510; &#65292; &#21448; &#33457; &#23613; &#20102; &#20182; &#25152; &#26377; &#30340; &#65292; &#19968; &#28857; &#20063; &#19981; &#35265; &#22909; &#65292; &#30149; &#21183; &#21453; &#20498; &#26356; &#37325; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#21548; &#35265; &#32822; &#31267; &#30340; &#20107; &#65292; &#23601; &#20174; &#24460; &#22836; &#26469; &#65292; &#26434; &#22312; &#20247; &#20154; &#20013; &#38388; &#65292; &#25720; &#32822; &#31267; &#30340; &#34915; &#35059; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#24847; &#24605; &#35828; &#65306; &#25105; &#21482; &#25720; &#20182; &#30340; &#34915; &#35059; &#65292; &#23601; &#24517; &#30154; &#24840; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#20182; &#34880; &#28431; &#30340; &#28304; &#22836; &#31435; &#21051; &#20094; &#20102; &#65307; &#20182; &#20415; &#35273; &#24471; &#36523; &#19978; &#30340; &#28798; &#30149; &#22909; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#39039; &#26102; &#24515; &#37324; &#35273; &#24471; &#26377; &#33021; &#21147; &#20174; &#33258; &#24049; &#36523; &#19978; &#20986; &#21435; &#65292; &#23601; &#22312; &#20247; &#20154; &#20013; &#38388; &#36716; &#36807; &#26469; &#65292; &#35828; &#65306; &#35841; &#25720; &#25105; &#30340; &#34915; &#35059; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#23545; &#20182; &#35828; &#65306; &#20320; &#30475; &#20247; &#20154; &#25317; &#25380; &#20320; &#65292; &#36824; &#35828; &#35841; &#25720; &#25105; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21608; &#22260; &#35266; &#30475; &#65292; &#35201; &#35265; &#20570; &#36825; &#20107; &#30340; &#22899; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#22899; &#20154; &#30693; &#36947; &#22312; &#33258; &#24049; &#36523; &#19978; &#25152; &#25104; &#30340; &#20107; &#65292; &#23601; &#24656; &#24807; &#25112; &#20834; &#65292; &#26469; &#20463; &#20239; &#22312; &#32822; &#31267; &#36319; &#21069; &#65292; &#23558; &#23454; &#24773; &#20840; &#21578; &#35785; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#35828; &#65306; &#22899; &#20799; &#65292; &#20320; &#30340; &#20449; &#25937; &#20102; &#20320; &#65292; &#24179; &#24179; &#23433; &#23433; &#30340; &#22238; &#21435; &#32610; &#65281; &#20320; &#30340; &#28798; &#30149; &#30154; &#24840; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#36824; &#35828; &#35805; &#30340; &#26102; &#20505; &#65292; &#26377; &#20154; &#20174; &#31649; &#20250; &#22530; &#30340; &#23478; &#37324; &#26469; &#65292; &#35828; &#65306; &#20320; &#30340; &#22899; &#20799; &#27515; &#20102; &#65292; &#20309; &#24517; &#36824; &#21171; &#21160; &#20808; &#29983; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21548; &#35265; &#25152; &#35828; &#30340; &#35805; &#65292; &#23601; &#23545; &#31649; &#20250; &#22530; &#30340; &#35828; &#65306; &#19981; &#35201; &#24597; &#65292; &#21482; &#35201; &#20449; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#24102; &#30528; &#24444; &#24471; &#12289; &#38597; &#21508; &#12289; &#21644; &#38597; &#21508; &#30340; &#20804; &#24351; &#32422; &#32752; &#21516; &#21435; &#65292; &#19981; &#35768; &#21035; &#20154; &#36319; &#38543; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#31649; &#20250; &#22530; &#30340; &#23478; &#37324; &#65307; &#32822; &#31267; &#30475; &#35265; &#37027; &#37324; &#20081; &#22199; &#65292; &#24182; &#26377; &#20154; &#22823; &#22823; &#30340; &#21741; &#27875; &#21696; &#21495; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#36827; &#21040; &#37324; &#38754; &#65292; &#23601; &#23545; &#20182; &#20204; &#35828; &#65306; &#20026; &#29978; &#40637; &#20081; &#22199; &#21741; &#27875; &#21602; &#65311; &#23401; &#23376; &#19981; &#26159; &#27515; &#20102; &#65292; &#26159; &#30561; &#30528; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#21988; &#31505; &#32822; &#31267; &#12290; &#32822; &#31267; &#25226; &#20182; &#20204; &#37117; &#25781; &#20986; &#21435; &#65292; &#23601; &#24102; &#30528; &#23401; &#23376; &#30340; &#29238; &#27597; &#65292; &#21644; &#36319; &#38543; &#30340; &#20154; &#36827; &#20102; &#23401; &#23376; &#25152; &#22312; &#30340; &#22320; &#26041; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#23601; &#25289; &#30528; &#23401; &#23376; &#30340; &#25163; &#65292; &#23545; &#20182; &#35828; &#65306; &#22823; &#21033; &#22823; &#65292; &#21476; &#31859; &#65281; ? &#20986; &#26469; &#23601; &#26159; &#35828; &#65306; &#38394; &#22899; &#65292; &#25105; &#21545; &#21648; &#20320; &#36215; &#26469; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">42</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#38394; &#22899; &#31435; &#26102; &#36215; &#26469; &#36208; &#12290; &#20182; &#20204; &#23601; &#22823; &#22823; &#30340; &#24778; &#22855; &#65307; &#38394; &#22899; &#24050; &#32463; &#21313; &#20108; &#23681; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">43</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#20999; &#20999; &#30340; &#22065; &#21648; &#20182; &#20204; &#65292; &#19981; &#35201; &#21483; &#20154; &#30693; &#36947; &#36825; &#20107; &#65292; &#21448; &#21545; &#21648; &#32473; &#20182; &#19996; &#35199; &#21507; &#12290;</td></tr></tbody>
</table>
<br>
</div>
</body></html>