<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">9 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)<br>
</b>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#31449; &#22312; &#36825; &#37324; &#30340; &#65292; &#26377; &#20154; &#22312; &#27809; &#23581; &#27515; &#21619; &#20197; &#21069; &#65292; &#24517; &#35201; &#30475; &#35265; &#31070; &#30340; &#22269; &#22823; &#26377; &#33021; &#21147; &#20020; &#21040; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#36807; &#20102; &#20845; &#22825; &#65292; &#32822; &#31267; &#24102; &#30528; &#24444; &#24471; &#12289; &#38597; &#21508; &#12289; &#32422; &#32752; &#26263; &#26263; &#30340; &#19978; &#20102; &#39640; &#23665; &#65292; &#23601; &#22312; &#20182; &#20204; &#38754; &#21069; &#21464; &#20102; &#24418; &#20687; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#34915; &#26381; &#25918; &#20809; &#65292; &#26497; &#20854; &#27905; &#30333; &#65292; &#22320; &#19978; &#28418; &#24067; &#30340; &#65292; &#27809; &#26377; &#19968; &#20010; &#33021; &#28418; &#24471; &#37027; &#26679; &#30333; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#24573; &#28982; &#65292; &#26377; &#20197; &#21033; &#20122; &#21516; &#25705; &#35199; &#21521; &#20182; &#20204; &#26174; &#29616; &#65292; &#24182; &#19988; &#21644; &#32822; &#31267; &#35828; &#35805; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#23545; &#32822; &#31267; &#35828; &#65306; &#25289; &#27604; &#65288; &#23601; &#26159; &#22827; &#23376; &#65289; &#65292; &#25105; &#20204; &#22312; &#36825; &#37324; &#30495; &#22909; &#65281; &#21487; &#20197; &#25645; &#19977; &#24231; &#26842; &#65292; &#19968; &#24231; &#20026; &#20320; &#65292; &#19968; &#24231; &#20026; &#25705; &#35199; &#65292; &#19968; &#24231; &#20026; &#20197; &#21033; &#20122; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#19981; &#30693; &#36947; &#35828; &#29978; &#40637; &#25165; &#22909; &#65292; &#22240; &#20026; &#20182; &#20204; &#29978; &#26159; &#24807; &#24597; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#26421; &#20113; &#24425; &#26469; &#36974; &#30422; &#20182; &#20204; &#65307; &#20063; &#26377; &#22768; &#38899; &#20174; &#20113; &#24425; &#37324; &#20986; &#26469; &#65292; &#35828; &#65306; &#36825; &#26159; &#25105; &#30340; &#29233; &#23376; &#65292; &#20320; &#20204; &#35201; &#21548; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#24573; &#28982; &#21608; &#22260; &#19968; &#30475; &#65292; &#19981; &#20877; &#35265; &#19968; &#20154; &#65292; &#21482; &#35265; &#32822; &#31267; &#21516; &#20182; &#20204; &#22312; &#37027; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#19979; &#23665; &#30340; &#26102; &#20505; &#65292; &#32822; &#31267; &#22065; &#21648; &#20182; &#20204; &#35828; &#65306; &#20154; &#23376; &#36824; &#27809; &#26377; &#20174; &#27515; &#37324; &#22797; &#27963; &#65292; &#20320; &#20204; &#19981; &#35201; &#23558; &#25152; &#30475; &#35265; &#30340; &#21578; &#35785; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#23558; &#36825; &#35805; &#23384; &#35760; &#22312; &#24515; &#65292; &#24444; &#27492; &#35758; &#35770; &#20174; &#27515; &#37324; &#22797; &#27963; &#26159; &#29978; &#40637; &#24847; &#24605; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#38382; &#32822; &#31267; &#35828; &#65306; &#25991; &#22763; &#20026; &#29978; &#40637; &#35828; &#20197; &#21033; &#20122; &#24517; &#39035; &#20808; &#26469; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#20197; &#21033; &#20122; &#22266; &#28982; &#20808; &#26469; &#22797; &#20852; &#19975; &#20107; &#65307; &#32463; &#19978; &#19981; &#26159; &#25351; &#30528; &#20154; &#23376; &#35828; &#65292; &#20182; &#35201; &#21463; &#35768; &#22810; &#30340; &#33510; &#34987; &#20154; &#36731; &#24930; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#21578; &#35785; &#20320; &#20204; &#65292; &#20197; &#21033; &#20122; &#24050; &#32463; &#26469; &#20102; &#65292; &#20182; &#20204; &#20063; &#20219; &#24847; &#24453; &#20182; &#65292; &#27491; &#22914; &#32463; &#19978; &#25152; &#25351; &#30528; &#20182; &#30340; &#35805; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21040; &#20102; &#38376; &#24466; &#37027; &#37324; &#65292; &#30475; &#35265; &#26377; &#35768; &#22810; &#20154; &#22260; &#30528; &#20182; &#20204; &#65292; &#21448; &#26377; &#25991; &#22763; &#21644; &#20182; &#20204; &#36777; &#35770; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#19968; &#35265; &#32822; &#31267; &#65292; &#37117; &#29978; &#24076; &#22855; &#65292; &#23601; &#36305; &#19978; &#21435; &#38382; &#20182; &#30340; &#23433; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#38382; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#21644; &#20182; &#20204; &#36777; &#35770; &#30340; &#26159; &#29978; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#20154; &#20013; &#38388; &#26377; &#19968; &#20010; &#20154; &#22238; &#31572; &#35828; &#65306; &#22827; &#23376; &#65292; &#25105; &#24102; &#20102; &#25105; &#30340; &#20799; &#23376; &#21040; &#20320; &#36825; &#37324; &#26469; &#65292; &#20182; &#34987; &#21713; &#21543; &#39740; &#38468; &#30528; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#26080; &#35770; &#22312; &#37027; &#37324; &#65292; &#39740; &#25417; &#24324; &#20182; &#65292; &#25226; &#20182; &#25684; &#20498; &#65292; &#20182; &#23601; &#21475; &#20013; &#27969; &#27819; &#65292; &#21676; &#29273; &#20999; &#40831; &#65292; &#36523; &#20307; &#26543; &#20094; &#12290; &#25105; &#35831; &#36807; &#20320; &#30340; &#38376; &#24466; &#25226; &#39740; &#36214; &#20986; &#21435; &#65292; &#20182; &#20204; &#21364; &#26159; &#19981; &#33021; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#22003; &#65281; &#19981; &#20449; &#30340; &#19990; &#20195; &#38463; &#65292; &#25105; &#22312; &#20320; &#20204; &#36825; &#37324; &#35201; &#21040; &#20960; &#26102; &#21602; &#65311; &#25105; &#24525; &#32784; &#20320; &#20204; &#35201; &#21040; &#20960; &#26102; &#21602; &#65311; &#25226; &#20182; &#24102; &#21040; &#25105; &#36825; &#37324; &#26469; &#32610; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#24102; &#20102; &#20182; &#26469; &#12290; &#20182; &#19968; &#35265; &#32822; &#31267; &#65292; &#39740; &#20415; &#21483; &#20182; &#37325; &#37325; &#30340; &#25277; &#30127; &#65292; &#20498; &#22312; &#22320; &#19978; &#65292; &#32763; &#26469; &#35206; &#21435; &#65292; &#21475; &#20013; &#27969; &#27819; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#38382; &#20182; &#29238; &#20146; &#35828; &#65306; &#20182; &#24471; &#36825; &#30149; &#26377; &#22810; &#23569; &#26085; &#23376; &#21602; &#65311; &#22238; &#31572; &#35828; &#65306; &#20174; &#23567; &#30340; &#26102; &#20505; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#39740; &#23649; &#27425; &#25226; &#20182; &#25172; &#22312; &#28779; &#37324; &#12289; &#27700; &#37324; &#65292; &#35201; &#28781; &#20182; &#12290; &#20320; &#33509; &#33021; &#20570; &#29978; &#40637; &#65292; &#27714; &#20320; &#24604; &#24751; &#25105; &#20204; &#65292; &#24110; &#21161; &#25105; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#35828; &#65306; &#20320; &#33509; &#33021; &#20449; &#65292; &#22312; &#20449; &#30340; &#20154; &#65292; &#20961; &#20107; &#37117; &#33021; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#23401; &#23376; &#30340; &#29238; &#20146; &#31435; &#26102; &#21898; &#30528; &#35828; &#65288; &#26377; &#21476; &#21367; &#65306; &#31435; &#26102; &#27969; &#27882; &#30340; &#21898; &#30528; &#35828; &#65289; &#65306; &#25105; &#20449; &#65281; &#20294; &#25105; &#20449; &#19981; &#36275; &#65292; &#27714; &#20027; &#24110; &#21161; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#30475; &#35265; &#20247; &#20154; &#37117; &#36305; &#19978; &#26469; &#65292; &#23601; &#26021; &#36131; &#37027; &#27745; &#39740; &#35828; &#65306; &#20320; &#36825; &#32843; &#21713; &#30340; &#39740; &#65292; &#25105; &#21545; &#21648; &#20320; &#20174; &#20182; &#37324; &#22836; &#20986; &#26469; &#65292; &#20877; &#19981; &#35201; &#36827; &#21435; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#39740; &#21898; &#21483; &#65292; &#20351; &#23401; &#23376; &#22823; &#22823; &#30340; &#25277; &#20102; &#19968; &#38453; &#30127; &#65292; &#23601; &#20986; &#26469; &#20102; &#12290; &#23401; &#23376; &#22909; &#20687; &#27515; &#20102; &#19968; &#33324; &#12290; &#20197; &#33268; &#20247; &#20154; &#22810; &#21322; &#35828; &#65306; &#20182; &#26159; &#27515; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#32822; &#31267; &#25289; &#30528; &#20182; &#30340; &#25163; &#65292; &#25206; &#20182; &#36215; &#26469; &#65292; &#20182; &#23601; &#31449; &#36215; &#26469; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#36827; &#20102; &#23627; &#23376; &#65292; &#38376; &#24466; &#23601; &#26263; &#26263; &#30340; &#38382; &#20182; &#35828; &#65306; &#25105; &#20204; &#20026; &#29978; &#40637; &#19981; &#33021; &#36214; &#20986; &#20182; &#21435; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#38750; &#29992; &#31095; &#21578; &#65288; &#26377; &#21476; &#21367; &#22312; &#27492; &#26377; &#65306; &#31105; &#39135; &#20108; &#23383; &#65289; &#65292; &#36825; &#19968; &#31867; &#30340; &#39740; &#24635; &#19981; &#33021; &#20986; &#26469; &#65288; &#25110; &#20316; &#65306; &#19981; &#33021; &#36214; &#20986; &#20182; &#21435; &#26469; &#65289; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#31163; &#24320; &#37027; &#22320; &#26041; &#65292; &#32463; &#36807; &#21152; &#21033; &#21033; &#65307; &#32822; &#31267; &#19981; &#24895; &#24847; &#20154; &#30693; &#36947; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#25945; &#35757; &#38376; &#24466; &#65292; &#35828; &#65306; &#20154; &#23376; &#23558; &#35201; &#34987; &#20132; &#22312; &#20154; &#25163; &#37324; &#65292; &#20182; &#20204; &#35201; &#26432; &#23475; &#20182; &#65307; &#34987; &#26432; &#20197; &#24460; &#65292; &#36807; &#19977; &#22825; &#20182; &#35201; &#22797; &#27963; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#21364; &#19981; &#26126; &#30333; &#36825; &#35805; &#65292; &#21448; &#19981; &#25954; &#38382; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#36838; &#30334; &#20892; &#65292; &#32822; &#31267; &#22312; &#23627; &#37324; &#38382; &#38376; &#24466; &#35828; &#65306; &#20320; &#20204; &#22312; &#36335; &#19978; &#35758; &#35770; &#30340; &#26159; &#29978; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#19981; &#20316; &#22768; &#65292; &#22240; &#20026; &#20182; &#20204; &#22312; &#36335; &#19978; &#24444; &#27492; &#20105; &#35770; &#35841; &#20026; &#22823; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22352; &#19979; &#65292; &#21483; &#21313; &#20108; &#20010; &#38376; &#24466; &#26469; &#65292; &#35828; &#65306; &#33509; &#26377; &#20154; &#24895; &#24847; &#20316; &#39318; &#20808; &#30340; &#65292; &#20182; &#24517; &#20316; &#20247; &#20154; &#26411; &#24460; &#30340; &#65292; &#20316; &#20247; &#20154; &#30340; &#29992; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#39046; &#36807; &#19968; &#20010; &#23567; &#23401; &#23376; &#26469; &#65292; &#21483; &#20182; &#31449; &#22312; &#38376; &#24466; &#20013; &#38388; &#65292; &#21448; &#25265; &#36215; &#20182; &#26469; &#65292; &#23545; &#20182; &#20204; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#20026; &#25105; &#21517; &#25509; &#24453; &#19968; &#20010; &#20687; &#36825; &#23567; &#23401; &#23376; &#30340; &#65292; &#23601; &#26159; &#25509; &#24453; &#25105; &#65307; &#20961; &#25509; &#24453; &#25105; &#30340; &#65292; &#19981; &#26159; &#25509; &#24453; &#25105; &#65292; &#20035; &#26159; &#25509; &#24453; &#37027; &#24046; &#25105; &#26469; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#32422; &#32752; &#23545; &#32822; &#31267; &#35828; &#65306; &#22827; &#23376; &#65292; &#25105; &#20204; &#30475; &#35265; &#19968; &#20010; &#20154; &#22857; &#20320; &#30340; &#21517; &#36214; &#39740; &#65292; &#25105; &#20204; &#23601; &#31105; &#27490; &#20182; &#65292; &#22240; &#20026; &#20182; &#19981; &#36319; &#20174; &#25105; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#19981; &#35201; &#31105; &#27490; &#20182; &#65307; &#22240; &#20026; &#27809; &#26377; &#20154; &#22857; &#25105; &#21517; &#34892; &#24322; &#33021; &#65292; &#21453; &#20498; &#36731; &#26131; &#27585; &#35876; &#25105; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#19981; &#25932; &#25377; &#25105; &#20204; &#30340; &#65292; &#23601; &#26159; &#24110; &#21161; &#25105; &#20204; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#22240; &#20320; &#20204; &#26159; &#23646; &#22522; &#30563; &#65292; &#32473; &#20320; &#20204; &#19968; &#26479; &#27700; &#21917; &#30340; &#65292; &#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#20182; &#19981; &#33021; &#19981; &#24471; &#36175; &#36176; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">42</bdo>.&nbsp;</td><td align="left" valign="top">&#20961; &#20351; &#36825; &#20449; &#25105; &#30340; &#19968; &#20010; &#23567; &#23376; &#36300; &#20498; &#30340; &#65292; &#20498; &#19981; &#22914; &#25226; &#22823; &#30952; &#30707; &#25332; &#22312; &#36825; &#20154; &#30340; &#39048; &#39033; &#19978; &#65292; &#25172; &#22312; &#28023; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">43</bdo>.&nbsp;</td><td align="left" valign="top">&#20504; &#33509; &#20320; &#19968; &#21482; &#25163; &#21483; &#20320; &#36300; &#20498; &#65292; &#23601; &#25226; &#20182; &#30733; &#19979; &#26469; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">44</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#32570; &#20102; &#32930; &#20307; &#36827; &#20837; &#27704; &#29983; &#65292; &#24378; &#22914; &#26377; &#20004; &#21482; &#25163; &#33853; &#21040; &#22320; &#29425; &#65292; &#20837; &#37027; &#19981; &#28781; &#30340; &#28779; &#37324; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">45</bdo>.&nbsp;</td><td align="left" valign="top">&#20504; &#33509; &#20320; &#19968; &#21482; &#33050; &#21483; &#20320; &#36300; &#20498; &#65292; &#23601; &#25226; &#20182; &#30733; &#19979; &#26469; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">46</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#30264; &#33151; &#36827; &#20837; &#27704; &#29983; &#65292; &#24378; &#22914; &#26377; &#20004; &#21482; &#33050; &#34987; &#20002; &#22312; &#22320; &#29425; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">47</bdo>.&nbsp;</td><td align="left" valign="top">&#20504; &#33509; &#20320; &#19968; &#21482; &#30524; &#21483; &#20320; &#36300; &#20498; &#65292; &#23601; &#21435; &#25481; &#20182; &#65307; &#20320; &#21482; &#26377; &#19968; &#21482; &#30524; &#36827; &#20837; &#31070; &#30340; &#22269; &#65292; &#24378; &#22914; &#26377; &#20004; &#21482; &#30524; &#34987; &#20002; &#22312; &#22320; &#29425; &#37324; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">48</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#37027; &#37324; &#65292; &#34411; &#26159; &#19981; &#27515; &#30340; &#65292; &#28779; &#26159; &#19981; &#28781; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">49</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#24517; &#29992; &#28779; &#24403; &#30416; &#33100; &#21508; &#20154; &#12290; &#65288; &#26377; &#21476; &#21367; &#22312; &#27492; &#26377; &#65306; &#20961; &#31085; &#29289; &#24517; &#29992; &#30416; &#33100; &#12290; &#65289;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">50</bdo>.&nbsp;</td><td align="left" valign="top">&#30416; &#26412; &#26159; &#22909; &#30340; &#65292; &#33509; &#22833; &#20102; &#21619; &#65292; &#21487; &#29992; &#29978; &#40637; &#21483; &#20182; &#20877; &#21688; &#21602; &#65311; &#20320; &#20204; &#37324; &#22836; &#24212; &#24403; &#26377; &#30416; &#65292; &#24444; &#27492; &#21644; &#30566; &#12290;</td></tr></tbody>
</table>
<br>
</div>
</body></html>