<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">12 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b><br>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#29992; &#27604; &#21947; &#23545; &#20182; &#20204; &#35828; &#65306; &#26377; &#20154; &#26685; &#20102; &#19968; &#20010; &#33889; &#33796; &#22253; &#65292; &#21608; &#22260; &#22280; &#19978; &#31729; &#31494; &#65292; &#25366; &#20102; &#19968; &#20010; &#21387; &#37202; &#27744; &#65292; &#30422; &#20102; &#19968; &#24231; &#27004; &#65292; &#31199; &#32473; &#22253; &#25143; &#65292; &#23601; &#24448; &#22806; &#22269; &#21435; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#21040; &#20102; &#26102; &#20505; &#65292; &#25171; &#21457; &#19968; &#20010; &#20166; &#20154; &#21040; &#22253; &#25143; &#37027; &#37324; &#65292; &#35201; &#20174; &#22253; &#25143; &#25910; &#33889; &#33796; &#22253; &#30340; &#26524; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#22253; &#25143; &#25343; &#20303; &#20182; &#65292; &#25171; &#20102; &#20182; &#65292; &#21483; &#20182; &#31354; &#25163; &#22238; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#20877; &#25171; &#21457; &#19968; &#20010; &#20166; &#20154; &#21040; &#20182; &#20204; &#37027; &#37324; &#12290; &#20182; &#20204; &#25171; &#20260; &#20182; &#30340; &#22836; &#65292; &#24182; &#19988; &#20940; &#36785; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#25171; &#21457; &#19968; &#20010; &#20166; &#20154; &#21435; &#65292; &#20182; &#20204; &#23601; &#26432; &#20102; &#20182; &#12290; &#24460; &#21448; &#25171; &#21457; &#22909; &#20123; &#20166; &#20154; &#21435; &#65292; &#26377; &#34987; &#20182; &#20204; &#25171; &#30340; &#65292; &#26377; &#34987; &#20182; &#20204; &#26432; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#22253; &#20027; &#36824; &#26377; &#19968; &#20301; &#26159; &#20182; &#30340; &#29233; &#23376; &#65292; &#26411; &#24460; &#21448; &#25171; &#21457; &#20182; &#21435; &#65292; &#24847; &#24605; &#35828; &#65306; &#20182; &#20204; &#24517; &#23562; &#25964; &#25105; &#30340; &#20799; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#19981; &#26009; &#65292; &#37027; &#20123; &#22253; &#25143; &#24444; &#27492; &#35828; &#65306; &#36825; &#26159; &#25215; &#21463; &#20135; &#19994; &#30340; &#12290; &#26469; &#32610; &#65292; &#25105; &#20204; &#26432; &#20182; &#65292; &#20135; &#19994; &#23601; &#24402; &#25105; &#20204; &#20102; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#25343; &#20303; &#20182; &#65292; &#26432; &#20102; &#20182; &#65292; &#25226; &#20182; &#20002; &#22312; &#22253; &#22806; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#26679; &#65292; &#33889; &#33796; &#22253; &#30340; &#20027; &#20154; &#35201; &#24590; &#40637; &#21150; &#21602; &#65311; &#20182; &#35201; &#26469; &#38500; &#28781; &#37027; &#20123; &#22253; &#25143; &#65292; &#23558; &#33889; &#33796; &#22253; &#36716; &#32473; &#21035; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#32463; &#19978; &#20889; &#30528; &#35828; &#65306; &#21280; &#20154; &#25152; &#24323; &#30340; &#30707; &#22836; &#65292; &#24050; &#20316; &#20102; &#25151; &#35282; &#30340; &#22836; &#22359; &#30707; &#22836; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#26159; &#20027; &#25152; &#20316; &#30340; &#65292; &#22312; &#25105; &#20204; &#30524; &#20013; &#30475; &#20026; &#24076; &#22855; &#12290; &#36825; &#32463; &#20320; &#20204; &#27809; &#26377; &#24565; &#36807; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#30475; &#20986; &#36825; &#27604; &#21947; &#26159; &#25351; &#30528; &#20182; &#20204; &#35828; &#30340; &#65292; &#23601; &#24819; &#35201; &#25417; &#25343; &#20182; &#65292; &#21482; &#26159; &#24807; &#24597; &#30334; &#22995; &#65292; &#26044; &#26159; &#31163; &#24320; &#20182; &#36208; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#24460; &#26469; &#65292; &#20182; &#20204; &#25171; &#21457; &#20960; &#20010; &#27861; &#21033; &#36187; &#20154; &#21644; &#20960; &#20010; &#24076; &#24459; &#20826; &#30340; &#20154; &#21040; &#32822; &#31267; &#37027; &#37324; &#65292; &#35201; &#23601; &#30528; &#20182; &#30340; &#35805; &#38519; &#23475; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#20182;
&#20204; &#26469; &#20102; &#65292; &#23601; &#23545; &#20182; &#35828; &#65306; &#22827; &#23376; &#65292; &#25105; &#20204; &#30693; &#36947; &#20320; &#26159; &#35802; &#23454; &#30340; &#65292; &#29978; &#40637; &#20154; &#20320; &#37117; &#19981; &#24455; &#24773; &#38754; &#65307; &#22240; &#20026; &#20320; &#19981;
&#30475; &#20154; &#30340; &#22806; &#35980; &#65292; &#20035; &#26159; &#35802; &#35802; &#23454; &#23454; &#20256; &#31070; &#30340; &#36947; &#12290; &#32435; &#31246; &#32473; &#35813; &#25746; &#21487; &#20197; &#19981; &#21487; &#20197; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#20204; &#35813; &#32435; &#19981; &#35813; &#32435; &#65311; &#32822; &#31267; &#30693; &#36947; &#20182; &#20204; &#30340; &#20551; &#24847; &#65292; &#23601; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#20026; &#29978; &#40637; &#35797; &#25506; &#25105; &#65311; &#25343; &#19968; &#20010; &#38134; &#38065; &#26469; &#32473; &#25105; &#30475; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#20204; &#35813; &#32435; &#19981; &#35813; &#32435; &#65311; &#32822; &#31267; &#30693; &#36947; &#20182; &#20204; &#30340; &#20551; &#24847; &#65292; &#23601; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#20026; &#29978; &#40637; &#35797; &#25506; &#25105; &#65311; &#25343; &#19968; &#20010; &#38134; &#38065; &#26469; &#32473; &#25105; &#30475; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#35813; &#25746; &#30340; &#29289; &#24403; &#24402; &#32473; &#35813; &#25746; &#65292; &#31070; &#30340; &#29289; &#24403; &#24402; &#32473; &#31070; &#12290; &#20182; &#20204; &#23601; &#24456; &#24076; &#22855; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#25746; &#37117; &#35813; &#20154; &#24120; &#35828; &#27809; &#26377; &#22797; &#27963; &#30340; &#20107; &#12290; &#20182; &#20204; &#26469; &#38382; &#32822; &#31267; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#22827; &#23376; &#65292; &#25705; &#35199; &#20026; &#25105; &#20204; &#20889; &#30528; &#35828; &#65306; &#20154; &#33509; &#27515; &#20102; &#65292; &#25735; &#19979; &#22971; &#23376; &#65292; &#27809; &#26377; &#23401; &#23376; &#65292; &#20182; &#20804; &#24351; &#24403; &#23094; &#20182; &#30340; &#22971; &#65292; &#20026; &#21733; &#21733; &#29983; &#23376; &#31435; &#24460; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#24351; &#20804; &#19971; &#20154; &#65292; &#31532; &#19968; &#20010; &#23094; &#20102; &#22971; &#65292; &#27515; &#20102; &#65292; &#27809; &#26377; &#30041; &#19979; &#23401; &#23376; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#31532; &#20108; &#20010; &#23094; &#20102; &#20182; &#65292; &#20063; &#27515; &#20102; &#65292; &#27809; &#26377; &#30041; &#19979; &#23401; &#23376; &#12290; &#31532; &#19977; &#20010; &#20063; &#26159; &#36825; &#26679; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#19971; &#20010; &#20154; &#37117; &#27809; &#26377; &#30041; &#19979; &#23401; &#23376; &#65307; &#26411; &#20102; &#65292; &#37027; &#22919; &#20154; &#20063; &#27515; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#24403; &#22797; &#27963; &#30340; &#26102; &#20505; &#65292; &#20182; &#26159; &#37027; &#19968; &#20010; &#30340; &#22971; &#23376; &#21602; &#65311; &#22240; &#20026; &#20182; &#20204; &#19971; &#20010; &#20154; &#37117; &#23094; &#36807; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#20320; &#20204; &#25152; &#20197; &#38169; &#20102; &#65292; &#23682; &#19981; &#26159; &#22240; &#20026; &#19981; &#26126; &#30333; &#22307; &#32463; &#65292; &#19981; &#26195; &#24471; &#31070; &#30340; &#22823; &#33021; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#20154; &#20174; &#27515; &#37324; &#22797; &#27963; &#65292; &#20063; &#19981; &#23094; &#20063; &#19981; &#23233; &#65292; &#20035; &#20687; &#22825; &#19978; &#30340; &#20351; &#32773; &#19968; &#26679; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#35770; &#21040; &#27515; &#20154; &#22797; &#27963; &#65292; &#20320; &#20204; &#27809; &#26377; &#24565; &#36807; &#25705; &#35199; &#30340; &#20070; &#33606; &#26840; &#31687; &#19978; &#25152; &#36733; &#30340; &#40637; &#65311; &#31070; &#23545; &#25705; &#35199; &#35828; &#65306; &#25105; &#26159; &#20122; &#20271; &#25289; &#32597; &#30340; &#31070; &#65292; &#20197; &#25746; &#30340; &#31070; &#65292; &#38597; &#21508; &#30340; &#31070; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#31070; &#19981; &#26159; &#27515; &#20154; &#30340; &#31070; &#65292; &#20035; &#26159; &#27963; &#20154; &#30340; &#31070; &#12290; &#20320; &#20204; &#26159; &#22823; &#38169; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#20010; &#25991; &#22763; &#26469; &#65292; &#21548; &#35265; &#20182; &#20204; &#36777; &#35770; &#65292; &#26195; &#24471; &#32822; &#31267; &#22238; &#31572; &#30340; &#22909; &#65292; &#23601; &#38382; &#20182; &#35828; &#65306; &#35819; &#21629; &#20013; &#37027; &#26159; &#31532; &#19968; &#35201; &#32039; &#30340; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22238; &#31572; &#35828; &#65306; &#31532; &#19968; &#35201; &#32039; &#30340; &#23601; &#26159; &#35828; &#65306; &#20197; &#33394; &#21015; &#38463; &#65292; &#20320; &#35201; &#21548; &#65292; &#20027; &#9472; &#25105; &#20204; &#31070; &#26159; &#29420; &#19968; &#30340; &#20027; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#35201; &#23613; &#24515; &#12289; &#23613; &#24615; &#12289; &#23613; &#24847; &#12289; &#23613; &#21147; &#29233; &#20027; &#9472; &#20320; &#30340; &#31070; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#20854; &#27425; &#23601; &#26159; &#35828; &#65306; &#35201; &#29233; &#20154; &#22914; &#24049; &#12290; &#20877; &#27809; &#26377; &#27604; &#36825; &#20004; &#26465; &#35819; &#21629; &#26356; &#22823; &#30340; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#25991; &#22763; &#23545; &#32822; &#31267; &#35828; &#65306; &#22827; &#23376; &#35828; &#65292; &#31070; &#26159; &#19968; &#20301; &#65292; &#23454; &#22312; &#19981; &#38169; &#65307; &#38500; &#20102; &#20182; &#20197; &#22806; &#65292; &#20877; &#27809; &#26377; &#21035; &#30340; &#31070; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#24182; &#19988; &#23613; &#24515; &#12289; &#23613; &#26234; &#12289; &#23613; &#21147; &#29233; &#20182; &#65292; &#21448; &#29233; &#20154; &#22914; &#24049; &#65292; &#23601; &#27604; &#19968; &#20999; &#29140; &#31085; &#21644; &#21508; &#26679; &#31085; &#31040; &#22909; &#30340; &#22810; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35265; &#20182; &#22238; &#31572; &#30340; &#26377; &#26234; &#24935; &#65292; &#23601; &#23545; &#20182; &#35828; &#65306; &#20320; &#31163; &#31070; &#30340; &#22269; &#19981; &#36828; &#20102; &#12290; &#20174; &#27492; &#20197; &#24460; &#65292; &#27809; &#26377; &#20154; &#25954; &#20877; &#38382; &#20182; &#29978; &#40637; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#27583; &#37324; &#25945; &#35757; &#20154; &#65292; &#23601; &#38382; &#20182; &#20204; &#35828; &#65306; &#25991; &#22763; &#24590; &#40637; &#35828; &#22522; &#30563; &#26159; &#22823; &#21355; &#30340; &#23376; &#23385; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#22823; &#21355; &#34987; &#22307; &#28789; &#24863; &#21160; &#65292; &#35828; &#65306; &#20027; &#23545; &#25105; &#20027; &#35828; &#65292; &#20320; &#22352; &#22312; &#25105; &#30340; &#21491; &#36793; &#65292; &#31561; &#25105; &#20351; &#20320; &#20167; &#25932; &#20316; &#20320; &#30340; &#33050; &#20979; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#22823; &#21355; &#26082; &#33258; &#24049; &#31216; &#20182; &#20026; &#20027; &#65292; &#20182; &#24590; &#40637; &#21448; &#26159; &#22823; &#21355; &#30340; &#23376; &#23385; &#21602; &#65311; &#20247; &#20154; &#37117; &#21916; &#27426; &#21548; &#20182; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">38</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#25945; &#35757; &#20043; &#38388; &#65292; &#35828; &#65306; &#20320; &#20204; &#35201; &#38450; &#22791; &#25991; &#22763; &#65307; &#20182; &#20204; &#22909; &#31359; &#38271; &#34915; &#28216; &#34892; &#65292; &#21916; &#29233; &#20154; &#22312; &#34903; &#24066; &#19978; &#38382; &#20182; &#20204; &#30340; &#23433; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">39</bdo>.&nbsp;</td><td align="left" valign="top">&#21448; &#21916; &#29233; &#20250; &#22530; &#37324; &#30340; &#39640; &#20301; &#65292; &#31605; &#24109; &#19978; &#30340; &#39318; &#24231; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">40</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#20405; &#21534; &#23521; &#22919; &#30340; &#23478; &#20135; &#65292; &#20551; &#24847; &#20316; &#24456; &#38271; &#30340; &#31095; &#21578; &#12290; &#36825; &#20123; &#20154; &#35201; &#21463; &#26356; &#37325; &#30340; &#21009; &#32602; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">41</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#38134; &#24211; &#22352; &#30528; &#65292; &#30475; &#20247; &#20154; &#24590; &#26679; &#25237; &#38065; &#20837; &#24211; &#12290; &#26377; &#22909; &#20123; &#36130; &#20027; &#24448; &#37324; &#25237; &#20102; &#33509; &#24178; &#30340; &#38065; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">42</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#19968; &#20010; &#31351; &#23521; &#22919; &#26469; &#65292; &#24448; &#37324; &#25237; &#20102; &#20004; &#20010; &#23567; &#38065; &#65292; &#23601; &#26159; &#19968; &#20010; &#22823; &#38065; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">43</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21483; &#38376; &#24466; &#26469; &#65292; &#35828; &#65306; &#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#36825; &#31351; &#23521; &#22919; &#25237; &#20837; &#24211; &#37324; &#30340; &#65292; &#27604; &#20247; &#20154; &#25152; &#25237; &#30340; &#26356; &#22810; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">44</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#65292; &#20182; &#20204; &#37117; &#26159; &#33258; &#24049; &#26377; &#39296; &#65292; &#25343; &#20986; &#26469; &#25237; &#22312; &#37324; &#22836; &#65307; &#20294; &#36825; &#23521; &#22919; &#26159; &#33258; &#24049; &#19981; &#36275; &#65292; &#25226; &#20182; &#19968; &#20999; &#20859; &#29983; &#30340; &#37117; &#25237; &#19978; &#20102; &#12290;</td></tr></tbody>
</table>
<br>
</div></div>
</body></html>