<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>mark1</title></head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">11 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b><br>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#21644; &#38376; &#24466; &#23558; &#36817; &#32822; &#36335; &#25746; &#20919; &#65292; &#21040; &#20102; &#20271; &#27861; &#20854; &#21644; &#20271; &#22823; &#23612; &#65292; &#22312; &#27204; &#27012; &#23665; &#37027; &#37324; &#65307; &#32822; &#31267; &#23601; &#25171; &#21457; &#20004; &#20010; &#38376; &#24466; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#24448; &#23545; &#38754; &#26449; &#23376; &#37324; &#21435; &#65292; &#19968; &#36827; &#21435; &#30340; &#26102; &#20505; &#65292; &#24517; &#30475; &#35265; &#19968; &#21305; &#39540; &#39545; &#25332; &#22312; &#37027; &#37324; &#65292; &#26159; &#20174; &#26469; &#27809; &#26377; &#20154; &#39569; &#36807; &#30340; &#65292; &#21487; &#20197; &#35299; &#24320; &#65292; &#29301; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#26377; &#20154; &#23545; &#20320; &#20204; &#35828; &#65306; &#20026; &#29978; &#40637; &#20316; &#36825; &#20107; &#65311; &#20320; &#20204; &#23601; &#35828; &#65306; &#20027; &#35201; &#29992; &#20182; &#12290; &#37027; &#20154; &#24517; &#31435; &#26102; &#35753; &#20320; &#20204; &#29301; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21435; &#20102; &#65292; &#20415; &#30475; &#35265; &#19968; &#21305; &#39540; &#39545; &#25332; &#22312; &#38376; &#22806; &#34903; &#36947; &#19978; &#65292; &#23601; &#25226; &#20182; &#35299; &#24320; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#37027; &#37324; &#31449; &#30528; &#30340; &#20154; &#65292; &#26377; &#20960; &#20010; &#35828; &#65306; &#20320; &#20204; &#35299; &#39540; &#39545; &#20316; &#29978; &#40637; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#29031; &#30528; &#32822; &#31267; &#25152; &#35828; &#30340; &#22238; &#31572; &#65292; &#37027; &#20123; &#20154; &#23601; &#20219; &#20973; &#20182; &#20204; &#29301; &#21435; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#25226; &#39540; &#39545; &#29301; &#21040; &#32822; &#31267; &#37027; &#37324; &#65292; &#25226; &#33258; &#24049; &#30340; &#34915; &#26381; &#25645; &#22312; &#19978; &#38754; &#65292; &#32822; &#31267; &#23601; &#39569; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#26377; &#35768; &#22810; &#20154; &#25226; &#34915; &#26381; &#38138; &#22312; &#36335; &#19978; &#65292; &#20063; &#26377; &#20154; &#25226; &#30000; &#38388; &#30340; &#26641; &#26525; &#30733; &#19979; &#26469; &#65292; &#38138; &#22312; &#36335; &#19978; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#21069; &#34892; &#24460; &#38543; &#30340; &#20154; &#37117; &#21898; &#30528; &#35828; &#65306; &#21644; &#25955; &#37027; &#65288; &#21644; &#25955; &#37027; &#65306; &#21407; &#26377; &#27714; &#25937; &#30340; &#24847; &#24605; &#65292; &#22312; &#27492; &#20035; &#26159; &#31216; &#39042; &#30340; &#35805; &#65289; &#65281; &#22857; &#20027; &#21517; &#26469; &#30340; &#26159; &#24212; &#24403; &#31216; &#39042; &#30340; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#23558; &#35201; &#26469; &#30340; &#25105; &#31062; &#22823; &#21355; &#20043; &#22269; &#26159; &#24212; &#24403; &#31216; &#39042; &#30340; &#65281; &#39640; &#39640; &#22312; &#19978; &#21644; &#25955; &#37027; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#36827; &#20102; &#32822; &#36335; &#25746; &#20919; &#65292; &#20837; &#20102; &#22307; &#27583; &#65292; &#21608; &#22260; &#30475; &#20102; &#21508; &#26679; &#29289; &#20214; &#12290; &#22825; &#33394; &#24050; &#26202; &#65292; &#23601; &#21644; &#21313; &#20108; &#20010; &#38376; &#24466; &#20986; &#22478; &#65292; &#24448; &#20271; &#22823; &#23612; &#21435; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#31532; &#20108; &#22825; &#65292; &#20182; &#20204; &#20174; &#20271; &#22823; &#23612; &#20986; &#26469; &#65292; &#32822; &#31267; &#39295; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#36828;
&#36828; &#30340; &#30475; &#35265; &#19968; &#26869; &#26080; &#33457; &#26524; &#26641; &#65292; &#26641; &#19978; &#26377; &#21494; &#23376; &#65292; &#23601; &#24448; &#37027; &#37324; &#21435; &#65292; &#25110; &#32773; &#22312; &#26641; &#19978; &#21487; &#20197; &#25214; &#30528; &#29978; &#40637; &#12290; &#21040;
&#20102; &#26641; &#19979; &#65292; &#31455; &#25214; &#19981; &#30528; &#29978; &#40637; &#65292; &#19981; &#36807; &#26377; &#21494; &#23376; &#65292; &#22240; &#20026; &#19981; &#26159; &#25910; &#26080; &#33457; &#26524; &#30340; &#26102; &#20505; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23601; &#23545; &#26641; &#35828; &#65306; &#20174; &#20170; &#20197; &#24460; &#65292; &#27704; &#27809; &#26377; &#20154; &#21507; &#20320; &#30340; &#26524; &#23376; &#12290; &#20182; &#30340; &#38376; &#24466; &#20063; &#21548; &#35265; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#26469; &#21040; &#32822; &#36335; &#25746; &#20919; &#12290; &#32822; &#31267; &#36827; &#20837; &#22307; &#27583; &#65292; &#36214; &#20986; &#27583; &#37324; &#20316; &#20080; &#21334; &#30340; &#20154; &#65292; &#25512; &#20498; &#20817; &#25442; &#38134; &#38065; &#20043; &#20154; &#30340; &#26700; &#23376; &#65292; &#21644; &#21334; &#40509; &#23376; &#20043; &#20154; &#30340; &#20979; &#23376; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#20063; &#19981; &#35768; &#20154; &#25343; &#30528; &#22120; &#20855; &#20174; &#27583; &#37324; &#32463; &#36807; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20415; &#25945; &#35757; &#20182; &#20204; &#35828; &#65306; &#32463; &#19978; &#19981; &#26159; &#35760; &#30528; &#35828; &#65306; &#25105; &#30340; &#27583; &#24517; &#31216; &#20026; &#19975; &#22269; &#31095; &#21578; &#30340; &#27583; &#40637; &#65311; &#20320; &#20204; &#20498; &#20351; &#20182; &#25104; &#20026; &#36156; &#31389; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#31085; &#21496; &#38271; &#21644; &#25991; &#22763; &#21548; &#35265; &#36825; &#35805; &#65292; &#23601; &#24819; &#27861; &#23376; &#35201; &#38500; &#28781; &#32822; &#31267; &#65292; &#21364; &#21448; &#24597; &#20182; &#65292; &#22240; &#20026; &#20247; &#20154; &#37117; &#24076; &#22855; &#20182; &#30340; &#25945; &#35757; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#27599; &#22825; &#26202; &#19978; &#65292; &#32822; &#31267; &#20986; &#22478; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#26089; &#26216; &#65292; &#20182; &#20204; &#20174; &#37027; &#37324; &#32463; &#36807; &#65292; &#30475; &#35265; &#26080; &#33457; &#26524; &#26641; &#36830; &#26681; &#37117; &#26543; &#20094; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#24471; &#24819; &#36215; &#32822; &#31267; &#30340; &#35805; &#26469; &#65292; &#23601; &#23545; &#20182; &#35828; &#65306; &#25289; &#27604; &#65292; &#35831; &#30475; &#65281; &#20320; &#25152; &#21650; &#35781; &#30340; &#26080; &#33457; &#26524; &#26641; &#65292; &#24050; &#32463; &#26543; &#20094; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22238; &#31572; &#35828; &#65306; &#20320; &#20204; &#24403; &#20449; &#26381; &#31070; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#26080; &#35770; &#20309; &#20154; &#23545; &#36825; &#24231; &#23665; &#35828; &#65306; &#20320; &#25386; &#24320; &#27492; &#22320; &#65292; &#25237; &#22312; &#28023; &#37324; &#65281; &#20182; &#33509; &#24515; &#37324; &#19981; &#30097; &#24785; &#65292; &#21482; &#20449; &#20182; &#25152; &#35828; &#30340; &#24517; &#25104; &#65292; &#23601; &#24517; &#32473; &#20182; &#25104; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#25152; &#20197; &#25105; &#21578; &#35785; &#20320; &#20204; &#65292; &#20961; &#20320; &#20204; &#31095; &#21578; &#31048; &#27714; &#30340; &#65292; &#26080; &#35770; &#26159; &#29978; &#40637; &#65292; &#21482; &#35201; &#20449; &#26159; &#24471; &#30528; &#30340; &#65292; &#23601; &#24517; &#24471; &#30528; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#31449; &#30528; &#31095; &#21578; &#30340; &#26102; &#20505; &#65292; &#33509; &#24819; &#36215; &#26377; &#20154; &#24471; &#32618; &#20320; &#20204; &#65292; &#23601; &#24403; &#39286; &#24661; &#20182; &#65292; &#22909; &#21483; &#20320; &#20204; &#22312; &#22825; &#19978; &#30340; &#29238; &#20063; &#39286; &#24661; &#20320; &#20204; &#30340; &#36807; &#29359; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#33509; &#19981; &#39286; &#24661; &#20154; &#65292; &#20320; &#20204; &#22312; &#22825; &#19978; &#30340; &#29238; &#20063; &#19981; &#39286; &#24661; &#20320; &#20204; &#30340; &#36807; &#29359; &#12290; &#65288; &#26377; &#21476; &#21367; &#26080; &#27492; &#33410; &#65289;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21448; &#26469; &#21040; &#32822; &#36335; &#25746; &#20919; &#12290; &#32822; &#31267; &#22312; &#27583; &#37324; &#34892; &#36208; &#30340; &#26102; &#20505; &#65292; &#31085; &#21496; &#38271; &#21644; &#25991; &#22763; &#24182; &#38271; &#32769; &#36827; &#21069; &#26469; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#38382; &#20182; &#35828; &#65306; &#20320; &#20183; &#30528; &#29978; &#40637; &#26435; &#26564; &#20316; &#36825; &#20123; &#20107; &#65311; &#32473; &#20320; &#36825; &#26435; &#26564; &#30340; &#26159; &#35841; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#20204; &#35828; &#65306; &#25105; &#35201; &#38382; &#20320; &#20204; &#19968; &#21477; &#35805; &#65292; &#20320; &#20204; &#22238; &#31572; &#25105; &#65292; &#25105; &#23601; &#21578; &#35785; &#20320; &#20204; &#25105; &#20183; &#30528; &#29978; &#40637; &#26435; &#26564; &#20316; &#36825; &#20123; &#20107; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#32422; &#32752; &#30340; &#27927; &#31036; &#26159; &#20174; &#22825; &#19978; &#26469; &#30340; &#65311; &#26159; &#20174; &#20154; &#38388; &#26469; &#30340; &#21602; &#65311; &#20320; &#20204; &#21487; &#20197; &#22238; &#31572; &#25105; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#24444; &#27492; &#21830; &#35758; &#35828; &#65306; &#25105; &#20204; &#33509; &#35828; &#20174; &#22825; &#19978; &#26469; &#65292; &#20182; &#24517; &#35828; &#65306; &#36825; &#26679; &#65292; &#20320; &#20204; &#20026; &#29978; &#40637; &#19981; &#20449; &#20182; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#35828; &#20174; &#20154; &#38388; &#26469; &#65292; &#21364; &#21448; &#24597; &#30334; &#22995; &#65292; &#22240; &#20026; &#20247; &#20154; &#30495; &#20197; &#32422; &#32752; &#20026; &#20808; &#30693; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#26044; &#26159; &#22238; &#31572; &#32822; &#31267; &#35828; &#65306; &#25105; &#20204; &#19981; &#30693; &#36947; &#12290; &#32822; &#31267; &#35828; &#65306; &#25105; &#20063; &#19981; &#21578; &#35785; &#20320; &#20204; &#25105; &#20183; &#30528; &#29978; &#40637; &#26435; &#26564; &#20316; &#36825; &#20123; &#20107; &#12290;</td></tr></tbody>
</table>
<br>
<b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">
</b></div>

</div>
</body></html>