<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">
  <title>mark1</title>


</head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">16 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b><br>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#36807; &#20102; &#23433; &#24687; &#26085; &#65292; &#25273; &#22823; &#25289; &#30340; &#39532; &#21033; &#20122; &#21644; &#38597; &#21508; &#30340; &#27597; &#20146; &#39532; &#21033; &#20122; &#24182; &#25746; &#32599; &#31859; &#65292; &#20080; &#20102; &#39321; &#33167; &#35201; &#21435; &#33167; &#32822; &#31267; &#30340; &#36523; &#20307; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#19971; &#26085; &#30340; &#31532; &#19968; &#26085; &#28165; &#26089; &#65292; &#20986; &#22826; &#38451; &#30340; &#26102; &#20505; &#65292; &#20182; &#20204; &#26469; &#21040; &#22367; &#22675; &#37027; &#37324; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#24444; &#27492; &#35828; &#65306; &#35841; &#32473; &#25105; &#20204; &#25226; &#30707; &#22836; &#20174; &#22675; &#38376; &#36746; &#24320; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#30707; &#22836; &#21407; &#26469; &#24456; &#22823; &#65292; &#20182; &#20204; &#25260; &#22836; &#19968; &#30475; &#65292; &#21364; &#35265; &#30707; &#22836; &#24050; &#32463; &#36746; &#24320; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#36827; &#20102; &#22367; &#22675; &#65292; &#30475; &#35265; &#19968; &#20010; &#23569; &#24180; &#20154; &#22352; &#22312; &#21491; &#36793; &#65292; &#31359; &#30528; &#30333; &#34957; &#65292; &#23601; &#29978; &#24778; &#24656; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#23569; &#24180; &#20154; &#23545; &#20182; &#20204; &#35828; &#65306; &#19981; &#35201; &#24778; &#24656; &#65281; &#20320; &#20204; &#23547; &#25214; &#37027; &#38025; &#21313; &#23383; &#26550; &#30340; &#25343; &#25746; &#21202; &#20154; &#32822; &#31267; &#65292; &#20182; &#24050; &#32463; &#22797; &#27963; &#20102; &#65292; &#19981; &#22312; &#36825; &#37324; &#12290; &#35831; &#30475; &#23433; &#25918; &#20182; &#30340; &#22320; &#26041; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#21487; &#20197; &#21435; &#21578; &#35785; &#20182; &#30340; &#38376; &#24466; &#21644; &#24444; &#24471; &#65292; &#35828; &#65306; &#20182; &#22312; &#20320; &#20204; &#20197; &#20808; &#24448; &#21152; &#21033; &#21033; &#21435; &#12290; &#22312; &#37027; &#37324; &#20320; &#20204; &#35201; &#35265; &#20182; &#65292; &#27491; &#22914; &#20182; &#20174; &#21069; &#25152; &#21578; &#35785; &#20320; &#20204; &#30340; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#20986; &#26469; &#65292; &#20174; &#22367; &#22675; &#37027; &#37324; &#36867; &#36305; &#65292; &#21448; &#21457; &#25238; &#21448; &#24778; &#22855; &#65292; &#29978; &#40637; &#20063; &#19981; &#21578; &#35785; &#20154; &#65292; &#22240; &#20026; &#20182; &#20204; &#23475; &#24597; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#19971; &#26085; &#30340; &#31532; &#19968; &#26085; &#28165; &#26089; &#65292; &#32822; &#31267; &#22797; &#27963; &#20102; &#65292; &#23601; &#20808; &#21521; &#25273; &#22823; &#25289; &#30340; &#39532; &#21033; &#20122; &#26174; &#29616; &#12290; &#32822; &#31267; &#20174; &#20182; &#36523; &#19978; &#26366; &#36214; &#20986; &#19971; &#20010; &#39740; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#21435; &#21578; &#35785; &#37027; &#21521; &#26469; &#36319; &#38543; &#32822; &#31267; &#30340; &#20154; &#65307; &#37027; &#26102; &#20182; &#20204; &#27491; &#21696; &#24696; &#21741; &#27875; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#21548; &#35265; &#32822; &#31267; &#27963; &#20102; &#65292; &#34987; &#39532; &#21033; &#20122; &#30475; &#35265; &#65292; &#21364; &#26159; &#19981; &#20449; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#20107; &#20197; &#24460; &#65292; &#38376; &#24466; &#20013; &#38388; &#26377; &#20004; &#20010; &#20154; &#24448; &#20065; &#19979; &#21435; &#12290; &#36208; &#36335; &#30340; &#26102; &#20505; &#65292; &#32822; &#31267; &#21464; &#20102; &#24418; &#20687; &#65292; &#21521; &#20182; &#20204; &#26174; &#29616; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#20204; &#23601; &#21435; &#21578; &#35785; &#20854; &#39296; &#30340; &#38376; &#24466; &#65307; &#20854; &#39296; &#30340; &#38376; &#24466; &#20063; &#26159; &#19981; &#20449; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#24460; &#26469; &#65292; &#21313; &#19968; &#20010; &#38376; &#24466; &#22352; &#24109; &#30340; &#26102; &#20505; &#65292; &#32822; &#31267; &#21521; &#20182; &#20204; &#26174; &#29616; &#65292; &#36131; &#22791; &#20182; &#20204; &#19981; &#20449; &#65292; &#24515; &#37324; &#21018; &#30828; &#65292; &#22240; &#20026; &#20182; &#20204; &#19981; &#20449; &#37027; &#20123; &#22312; &#20182; &#22797; &#27963; &#20197; &#24460; &#30475; &#35265; &#20182; &#30340; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#21448; &#23545; &#20182; &#20204; &#35828; &#65306; &#20320; &#20204; &#24448; &#26222; &#22825; &#19979; &#21435; &#65292; &#20256; &#31119; &#38899; &#32473; &#19975; &#27665; &#65288; &#19975; &#27665; &#65306; &#21407; &#25991; &#26159; &#20961; &#21463; &#36896; &#30340; &#65289; &#21548; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#20449; &#32780; &#21463; &#27927; &#30340; &#65292; &#24517; &#28982; &#24471; &#25937; &#65307; &#19981; &#20449; &#30340; &#65292; &#24517; &#34987; &#23450; &#32618; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#20449; &#30340; &#20154; &#24517; &#26377; &#31070; &#36857; &#38543; &#30528; &#20182; &#20204; &#65292; &#23601; &#26159; &#22857; &#25105; &#30340; &#21517; &#36214; &#39740; &#65307; &#35828; &#26032; &#26041; &#35328; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#25163; &#33021; &#25343; &#34503; &#65307; &#33509; &#21917; &#20102; &#29978; &#40637; &#27602; &#29289; &#65292; &#20063; &#24517; &#19981; &#21463; &#23475; &#65307; &#25163; &#25353; &#30149; &#20154; &#65292; &#30149; &#20154; &#23601; &#24517; &#22909; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#20027; &#32822; &#31267; &#21644; &#20182; &#20204; &#35828; &#23436; &#20102; &#35805; &#65292; &#24460; &#26469; &#34987; &#25509; &#21040; &#22825; &#19978; &#65292; &#22352; &#22312; &#31070; &#30340; &#21491; &#36793; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#38376; &#24466; &#20986; &#21435; &#65292; &#21040; &#22788; &#23459; &#20256; &#31119; &#38899; &#12290; &#20027; &#21644; &#20182; &#20204; &#21516; &#24037; &#65292; &#29992; &#31070; &#36857; &#38543; &#30528; &#65292; &#35777; &#23454; &#25152; &#20256; &#30340; &#36947; &#12290; &#38463; &#20204; &#65281;</td></tr></tbody>
</table>
<br></div></div>
</body></html>