<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>

  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>mark1</title></head><body style="background-color: rgb(255, 204, 102); color: rgb(0, 0, 0);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<div style="text-align: center;">
<div style="text-align: center;"><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);"><a href="index.html">Index</a> Mark<span> </span><bdo dir="ltr">13 </bdo></b><b style="color: rgb(0, 0, 0); font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; font-size: medium; font-style: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);">Chinese:
Union (Simplified)</b><br>
<table style="font-family: &quot;Arial Unicode MS&quot;,&quot;Lucida Sans Unicode&quot;,Arial,sans-serif; letter-spacing: normal; orphans: 2; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; background-color: rgb(255, 255, 255);" border="0" cellpadding="3" cellspacing="0" width="100%">
<tbody><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">1</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#20174; &#27583; &#37324; &#20986; &#26469; &#30340; &#26102; &#20505; &#65292; &#26377; &#19968; &#20010; &#38376; &#24466; &#23545; &#20182; &#35828; &#65306; &#22827; &#23376; &#65292; &#35831; &#30475; &#65292; &#36825; &#26159; &#20309; &#31561; &#30340; &#30707; &#22836; &#65281; &#20309; &#31561; &#30340; &#27583; &#23431; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">2</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#23545; &#20182; &#35828; &#65306; &#20320; &#30475; &#35265; &#36825; &#22823; &#27583; &#23431; &#40637; &#65311; &#23558; &#26469; &#22312; &#36825; &#37324; &#27809; &#26377; &#19968; &#22359; &#30707; &#22836; &#30041; &#22312; &#30707; &#22836; &#19978; &#65292; &#19981; &#34987; &#25286; &#27585; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">3</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#22312; &#27204; &#27012; &#23665; &#19978; &#23545; &#22307; &#27583; &#32780; &#22352; &#65292; &#24444; &#24471; &#12289; &#38597; &#21508; &#12289; &#32422; &#32752; &#65292; &#21644; &#23433; &#24471; &#28872; &#26263; &#26263; &#30340; &#38382; &#20182; &#35828; &#65306;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">4</bdo>.&nbsp;</td><td align="left" valign="top">&#35831; &#21578; &#35785; &#25105; &#20204; &#65292; &#29978; &#40637; &#26102; &#20505; &#26377; &#36825; &#20123; &#20107; &#21602; &#65311; &#36825; &#19968; &#20999; &#20107; &#23558; &#25104; &#30340; &#26102; &#20505; &#26377; &#29978; &#40637; &#35947; &#20806; &#21602; &#65311;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">5</bdo>.&nbsp;</td><td align="left" valign="top">&#32822; &#31267; &#35828; &#65306; &#20320; &#20204; &#35201; &#35880; &#24910; &#65292; &#20813; &#24471; &#26377; &#20154; &#36855; &#24785; &#20320; &#20204; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">6</bdo>.&nbsp;</td><td align="left" valign="top">&#23558; &#26469; &#26377; &#22909; &#20123; &#20154; &#20882; &#25105; &#30340; &#21517; &#26469; &#65292; &#35828; &#65306; &#25105; &#26159; &#22522; &#30563; &#65292; &#24182; &#19988; &#35201; &#36855; &#24785; &#35768; &#22810; &#20154; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">7</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#21548; &#35265; &#25171; &#20183; &#21644; &#25171; &#20183; &#30340; &#39118; &#22768; &#65292; &#19981; &#35201; &#24778; &#24908; &#12290; &#36825; &#20123; &#20107; &#26159; &#24517; &#39035; &#26377; &#30340; &#65292; &#21482; &#26159; &#26411; &#26399; &#36824; &#27809; &#26377; &#21040; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">8</bdo>.&nbsp;</td><td align="left" valign="top">&#27665; &#35201; &#25915; &#25171; &#27665; &#65292; &#22269; &#35201; &#25915; &#25171; &#22269; &#65307; &#22810; &#22788; &#24517; &#26377; &#22320; &#38663; &#12289; &#39269; &#33618; &#12290; &#36825; &#37117; &#26159; &#28798; &#38590; &#65288; &#28798; &#38590; &#65306; &#21407; &#25991; &#26159; &#29983; &#20135; &#20043; &#38590; &#65289; &#30340; &#36215; &#22836; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">9</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#20320; &#20204; &#35201; &#35880; &#24910; &#65307; &#22240; &#20026; &#20154; &#35201; &#25226; &#20320; &#20204; &#20132; &#32473; &#20844; &#20250; &#65292; &#24182; &#19988; &#20320; &#20204; &#22312; &#20250; &#22530; &#37324; &#35201; &#21463; &#38829; &#25171; &#65292; &#21448; &#20026; &#25105; &#30340; &#32536; &#25925; &#31449; &#22312; &#35832; &#20399; &#19982; &#21531; &#29579; &#38754; &#21069; &#65292; &#23545; &#20182; &#20204; . &#20316; &#35265; &#35777; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">10</bdo>.&nbsp;</td><td align="left" valign="top">&#28982; &#32780; &#65292; &#31119; &#38899; &#24517; &#39035; &#20808; &#20256; &#32473; &#19975; &#27665; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">11</bdo>.&nbsp;</td><td align="left" valign="top">&#20154; &#25226; &#20320; &#20204; &#25289; &#21435; &#20132; &#23448; &#30340; &#26102; &#20505; &#65292; &#19981; &#35201; &#39044; &#20808; &#24605; &#34385; &#35828; &#29978; &#40637; &#65307; &#21040; &#37027; &#26102; &#20505; &#65292; &#36176; &#32473; &#20320; &#20204; &#29978; &#40637; &#35805; &#65292; &#20320; &#20204; &#23601; &#35828; &#29978; &#40637; &#65307; &#22240; &#20026; &#35828; &#35805; &#30340; &#19981; &#26159; &#20320; &#20204; &#65292; &#20035; &#26159; &#22307; &#28789; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">12</bdo>.&nbsp;</td><td align="left" valign="top">&#24351; &#20804; &#35201; &#25226; &#24351; &#20804; &#65292; &#29238; &#20146; &#35201; &#25226; &#20799; &#23376; &#65292; &#36865; &#21040; &#27515; &#22320; &#65307; &#20799; &#22899; &#35201; &#36215; &#26469; &#19982; &#29238; &#27597; &#20026; &#25932; &#65292; &#23475; &#27515; &#20182; &#20204; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">13</bdo>.&nbsp;</td><td align="left" valign="top">&#24182; &#19988; &#20320; &#20204; &#35201; &#20026; &#25105; &#30340; &#21517; &#34987; &#20247; &#20154; &#24680; &#24694; &#12290; &#24799; &#26377; &#24525; &#32784; &#21040; &#24213; &#30340; &#65292; &#24517; &#28982; &#24471; &#25937; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">14</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#30475; &#35265; &#37027; &#34892; &#27585; &#22351; &#21487; &#24974; &#30340; &#65292; &#31449; &#22312; &#19981; &#24403; &#31449; &#30340; &#22320; &#26041; &#65288; &#35835; &#36825; &#32463; &#30340; &#20154; &#39035; &#35201; &#20250; &#24847; &#65289; &#12290; &#37027; &#26102; &#65292; &#22312; &#29369; &#22826; &#30340; &#65292; &#24212; &#24403; &#36867; &#21040; &#23665; &#19978; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">15</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#25151; &#19978; &#30340; &#65292; &#19981; &#35201; &#19979; &#26469; &#65292; &#20063; &#19981; &#35201; &#36827; &#21435; &#25343; &#23478; &#37324; &#30340; &#19996; &#35199; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">16</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#30000; &#37324; &#30340; &#65292; &#20063; &#19981; &#35201; &#22238; &#21435; &#21462; &#34915; &#35059; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">17</bdo>.&nbsp;</td><td align="left" valign="top">&#24403; &#37027; &#20123; &#26085; &#23376; &#65292; &#24576; &#23381; &#30340; &#21644; &#22902; &#23401; &#23376; &#30340; &#26377; &#31096; &#20102; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">18</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#24212; &#24403; &#31048; &#27714; &#65292; &#21483; &#36825; &#20123; &#20107; &#19981; &#22312; &#20908; &#22825; &#20020; &#21040; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">19</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#22312; &#37027; &#20123; &#26085; &#23376; &#24517; &#26377; &#28798; &#38590; &#65292; &#33258; &#20174; &#31070; &#21019; &#36896; &#19975; &#29289; &#30452; &#21040; &#22914; &#20170; &#65292; &#24182; &#27809; &#26377; &#36825; &#26679; &#30340; &#28798; &#38590; &#65292; &#24460; &#26469; &#20063; &#24517; &#27809; &#26377; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">20</bdo>.&nbsp;</td><td align="left" valign="top">&#33509; &#19981; &#26159; &#20027; &#20943; &#23569; &#37027; &#26085; &#23376; &#65292; &#20961; &#26377; &#34880; &#27668; &#30340; &#65292; &#24635; &#27809; &#26377; &#19968; &#20010; &#24471; &#25937; &#30340; &#65307; &#21482; &#26159; &#20026; &#20027; &#30340; &#36873; &#27665; &#65292; &#20182; &#23558; &#37027; &#26085; &#23376; &#20943; &#23569; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">21</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#26102; &#33509; &#26377; &#20154; &#23545; &#20320; &#20204; &#35828; &#65306; &#30475; &#21738; &#65292; &#22522; &#30563; &#22312; &#36825; &#37324; &#65292; &#25110; &#35828; &#65306; &#22522; &#30563; &#22312; &#37027; &#37324; &#65292; &#20320; &#20204; &#19981; &#35201; &#20449; &#65281;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">22</bdo>.&nbsp;</td><td align="left" valign="top">&#22240; &#20026; &#20551; &#22522; &#30563; &#12289; &#20551; &#20808; &#30693; &#23558; &#35201; &#36215; &#26469; &#65292; &#26174; &#31070; &#36857; &#22855; &#20107; &#65292; &#20504; &#33509; &#33021; &#34892; &#65292; &#23601; &#25226; &#36873; &#27665; &#36855; &#24785; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">23</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#35201; &#35880; &#24910; &#12290; &#30475; &#21738; &#65292; &#20961; &#20107; &#25105; &#37117; &#39044; &#20808; &#21578; &#35785; &#20320; &#20204; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">24</bdo>.&nbsp;</td><td align="left" valign="top">&#22312; &#37027; &#20123; &#26085; &#23376; &#65292; &#37027; &#28798; &#38590; &#20197; &#24460; &#65292; &#26085; &#22836; &#35201; &#21464; &#40657; &#20102; &#65292; &#26376; &#20142; &#20063; &#19981; &#25918; &#20809; &#65292;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">25</bdo>.&nbsp;</td><td align="left" valign="top">&#20247; &#26143; &#35201; &#20174; &#22825; &#19978; &#22368; &#33853; &#65292; &#22825; &#21183; &#37117; &#35201; &#38663; &#21160; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">26</bdo>.&nbsp;</td><td align="left" valign="top">&#37027; &#26102; &#65292; &#20182; &#20204; &#65288; &#39532; &#22826; &#20108; &#21313; &#22235; &#31456; &#19977; &#21313; &#33410; &#26159; &#22320; &#19978; &#30340; &#19975; &#26063; &#65289; &#35201; &#30475; &#35265; &#20154; &#23376; &#26377; &#22823; &#33021; &#21147; &#12289; &#22823; &#33635; &#32768; &#65292; &#39550; &#20113; &#38477; &#20020; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">27</bdo>.&nbsp;</td><td align="left" valign="top">&#20182; &#35201; &#24046; &#36963; &#22825; &#20351; &#65292; &#25226; &#20182; &#30340; &#36873; &#27665; &#65292; &#20174; &#22235; &#26041; &#65288; &#26041; &#65306; &#21407; &#25991; &#26159; &#39118; &#65289; &#65292; &#20174; &#22320; &#26497; &#30452; &#21040; &#22825; &#36793; &#65292; &#37117; &#25307; &#32858; &#20102; &#26469; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">28</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#21487; &#20197; &#20174; &#26080; &#33457; &#26524; &#26641; &#23398; &#20010; &#27604; &#26041; &#65306; &#24403; &#26641; &#26525; &#21457; &#23273; &#38271; &#21494; &#30340; &#26102; &#20505; &#65292; &#20320; &#20204; &#23601; &#30693; &#36947; &#22799; &#22825; &#36817; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">29</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#26679; &#65292; &#20320; &#20204; &#20960; &#26102; &#30475; &#35265; &#36825; &#20123; &#20107; &#25104; &#23601; &#65292; &#20063; &#35813; &#30693; &#36947; &#20154; &#23376; &#65288; &#20154; &#23376; &#65306; &#25110; &#20316; &#31070; &#30340; &#22269; &#65289; &#36817; &#20102; &#65292; &#27491; &#22312; &#38376; &#21475; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">30</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23454; &#22312; &#21578; &#35785; &#20320; &#20204; &#65292; &#36825; &#19990; &#20195; &#36824; &#27809; &#26377; &#36807; &#21435; &#65292; &#36825; &#20123; &#20107; &#37117; &#35201; &#25104; &#23601; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">31</bdo>.&nbsp;</td><td align="left" valign="top">&#22825; &#22320; &#35201; &#24223; &#21435; &#65292; &#25105; &#30340; &#35805; &#21364; &#19981; &#33021; &#24223; &#21435; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">32</bdo>.&nbsp;</td><td align="left" valign="top">&#20294; &#37027; &#26085; &#23376; &#65292; &#37027; &#26102; &#36784; &#65292; &#27809; &#26377; &#20154; &#30693; &#36947; &#65292; &#36830; &#22825; &#19978; &#30340; &#20351; &#32773; &#20063; &#19981; &#30693; &#36947; &#65292; &#23376; &#20063; &#19981; &#30693; &#36947; &#65292; &#24799; &#26377; &#29238; &#30693; &#36947; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">33</bdo>.&nbsp;</td><td align="left" valign="top">&#20320; &#20204; &#35201; &#35880; &#24910; &#65292; &#20742; &#37266; &#31048; &#31095; &#65292; &#22240; &#20026; &#20320; &#20204; &#19981; &#26195; &#24471; &#37027; &#26085; &#26399; &#20960; &#26102; &#26469; &#21040; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">34</bdo>.&nbsp;</td><td align="left" valign="top">&#36825; &#20107; &#27491; &#22914; &#19968; &#20010; &#20154; &#31163; &#24320; &#26412; &#23478; &#65292; &#23492; &#23621; &#22806; &#37030; &#65292; &#25226; &#26435; &#26564; &#20132; &#32473; &#20166; &#20154; &#65292; &#20998; &#27966; &#21508; &#20154; &#24403; &#20316; &#30340; &#24037; &#21448; &#21545; &#21648; &#30475; &#38376; &#30340; &#20742; &#37266; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">35</bdo>.&nbsp;</td><td align="left" valign="top">&#25152; &#20197; &#65292; &#20320; &#20204; &#35201; &#20742; &#37266; &#65307; &#22240; &#20026; &#20320; &#20204; &#19981; &#30693; &#36947; &#23478; &#20027; &#29978; &#40637; &#26102; &#20505; &#26469; &#65292; &#25110; &#26202; &#19978; &#65292; &#25110; &#21322; &#22812; &#65292; &#25110; &#40481; &#21483; &#65292; &#25110; &#26089; &#26216; &#65307;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">36</bdo>.&nbsp;</td><td align="left" valign="top">&#24656; &#24597; &#20182; &#24573; &#28982; &#26469; &#21040; &#65292; &#30475; &#35265; &#20320; &#20204; &#30561; &#30528; &#20102; &#12290;</td></tr><tr><td align="right" nowrap="nowrap" valign="top"><bdo dir="ltr">37</bdo>.&nbsp;</td><td align="left" valign="top">&#25105; &#23545; &#20320; &#20204; &#25152; &#35828; &#30340; &#35805; &#65292; &#20063; &#26159; &#23545; &#20247; &#20154; &#35828; &#65306; &#35201; &#20742; &#37266; &#65281;</td></tr></tbody>
</table>
<br></div></div>
</body></html>