{
	"posts": [
		{
			"id": "f01a2a8d-d1f6-40b6-a054-da2297547e4d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>a8a9da47-d08e-470f-852d-ffd5b877b905\n>there are numerous peers, how you can know from the zeronet connections which one is the post sender\n>Maybe if some hacker/group setup too many zeronet computers (peers) and monitor connections + which posts apearing when. Unsure if these may come with some acceptable probability.\nYou just answered your own question. You collect data over many days, weeks, months. If there is some IP that comes associated with the new post a very disproportionate amount of times, then that IP and IDs are almost guaranteed to belong to the same person. This of course assumes the person doesn't switch IDs often, and it works better the more the user posts and the more monitoring nodes you have. Dynamic IPs aren't too big of an issue, because generally you'll only have one guy posting from any given range or ISP pool of IPs.\n>Tor relays usually proccess alot of traffic\nThe attack I mentioned is for people not using Tor (and not using/using a treacherous VPN). Tor's a whole different ballgame. It's possible for a state actor to break Tor, but it would be harder than to just deanonymise ZeroNet peers. And if you haven't broken Tor, the only thing you can do is to try to put together a profile for a certain ID to deduce his real life identity from bits of information he has dropped here and there. Remember, the way they found the Unabomber was because he used the phrase \"cold headed logicians\" in two different places, and the way they found the Silk Road owner was because he talked about it on a forum he was connected to with his real IP.\n>Even if they can come with some probability (to match IP to a post author), i doubt they will pursue you and get a court order based on such possibility that some IP connected certain honeypot at similar time when some post was published on certain darknet - seems a unrealistic -\nNot if you live in New Zealand, Australia, Germany, the UK, China, or any other sruveillance state where you have no free speech or privacy rights.\n>In my country police is not allowed to do this - to proactively research/hunt for possible law violators\nNot everybody lives in your country.\n>even if they get to your home/office, there can be multiple computers and these can also be encrypted. \nDepending on where you live, it may be legal to hold you in jail until you give out the password. This already happens regularly in some countries. Search \"key disclosure law\".\n>And also how they can prove who was sitting behind the computer at a time of a violation.\nIt doesn't matter, the judge will assume you as the owner of the computer are who was using it to do whatever they want to convict you of.",
			"time": 1567088620800,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}