{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1551204347,
			"title": "Nel Paese della bugia la verità è rivoluzionaria",
			"body": "«È finita la pacchia» dice il ministro dell’Interno Salvini irridendo chi rischia la vita per raggiungere l’Italia e lavora come uno schiavo del caporalato nelle nostre campagne. «Hanno 17 anni e restano a bordo» sentenzia Salvini, cieco e sordo ai messaggi degli stessi siracusani che urlano e scrivono «Fateli scendere» su lenzuoli bianchi appesi alle finestre. «Non è roba nostra, se li prendano i Paesi Bassi», insiste lui riferendosi ai minorenni a bordo della Sea Watch da giorni in balìa del mare. Il linguaggio carico di odio, sempre più violento, di esponenti di governo rimbomba ogni giorno nelle nostre orecchie....\nL'articolo continua qui:   http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:11:Nel+Paese+della+bugia+la+verit%C3%A0+%C3%A8+rivoluzionaria",
			"added": 1551204346
		},
		{
			"topic_id": 1551204483,
			"title": "Capricci",
			"body": "A prima vista sembra una sciocchezza: lasciarsi scappare un’azienda pronta a creare 25mila posti di lavoro. Ma se si guarda bene, la realtà è più complicata. Da una parte c’è Amazon, la più grande azienda statunitense (800 miliardi di dollari di valore in borsa), di Jeff Bezos, l’uomo più ricco del mondo (133 miliardi di patrimonio personale). Dall’altra ci sono i 60mila abitanti di Long Island City, un’ex area industriale di fronte a Manhattan. Nel 2017 Amazon, che ha sede a Seattle, aveva annunciato l’intenzione di costruire un secondo quartier generale e aveva messo in competizione tra loro le città americane per vedere chi offriva più incentivi.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:9:Capricci",
			"added": 1551204481
		},
		{
			"topic_id": 1551205893,
			"title": "Padroni a casa d'altri",
			"body": "L’attacco di Di Maio a Macron, additato come unico responsabile dei mali d’Africa e delle partenze dei migranti, è solo l’ultimo atto di una sfida tra imperialismi. Prassi in cui l’Italia neoliberista di oggi si differenzia ben poco da quella fascista e coloniale.\n\nL'articolo completo qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:12:Padroni+a+casa+d%27altri",
			"added": 1551205890
		}
	],
	"topic_vote": {
		"1552196439_1C7YrxNaqMVjJNqJ1NWMSnzCLdpyfZz27z": 1,
		"1556648607_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1552478761_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": [
			{
				"comment_id": 1,
				"body": "I'm italian and i use Keybase..... Good!!",
				"added": 1552495986
			}
		]
	},
	"comment_vote": {}
}