{
	"title": "东突厥斯坦运动",
	"description": "介绍海外东突厥斯坦运动",
	"links": "[股市带路党](http://127.0.0.1:43110/12i7CYxN2UxAEMiFarqeBCSegk8sLpmb2R/)\n\n[kai0油管频道](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?Channel=1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv)\n\n[kai0的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit)\n\n[kaishen的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kaishen@zeroid.bit)\n\n[吴越独立](http://127.0.0.1:43110/1JfzWXHBzELkVF12km6ZdnKSZFUAs8mZBw/)\n\n[零网使用方法](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/)\n\n[颠覆国家政权群](http://127.0.0.1:43110/16EwXiGi4Dn9EZFSeEuKc2HNZYRD3RcVDs/)\n\n[吴越独立大论坛](http://127.0.0.1:43110/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/)\n\n[自由曙光](http://127.0.0.1:43110/18GBsUZexWB8BcnGUtxFz4qbFiEeXVgB5B/)\n\n[非洲人的生活](http://127.0.0.1:43110/15zvMb12PZ5XMc6yJBWUEmn2dQvV3TyuQU/)\n\n[上海街头](http://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt/)\n\n[今日新疆西藏](http://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/)\n\n[自由西藏运动](http://127.0.0.1:43110/1HNZuUMURNtRPdfzBDxrNonPD2EBN6TKfV/)\n\n[中国发展模式](http://127.0.0.1:43110/1HNYEHtg6BPAW1jmWfBGPrRMxsPjd6nVA2/)\n\n[中国故事](http://127.0.0.1:43110/1PhcqYWiQHAiasQkcpsHp6btASom2tMGQK/)\n\n[共产党的故事](http://127.0.0.1:43110/17DwzkEgpqtCWK9i1CGdioXojBpN1uaJ2N/)\n\n[天安门大屠杀](http://127.0.0.1:43110/1NT2LeRWQs3zCFCRwuPWbKwcamXVEu1hbU/)\n\n[郭文贵揭露的腐败](http://127.0.0.1:43110/1JWBMmJtHs7uDK1pm6wEJjrZFn3uk1FG6V/)\n\n[中共惊人的腐败](http://127.0.0.1:43110/1PPF2jZ2uBiQyFD75VPpXdCapRHrvezFtz/)\n\n[地狱 中国](http://127.0.0.1:43110/1P9MwRTBWUdbyRgrytY7jg191trnZTomu9/)\n\n[加拿大风情](http://127.0.0.1:43110/1JCehSb5nREM7EivyQDXXkTsGpbKikDiaw/)\n\n[台湾建国运动](http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/)\n\n[中国各地的抗争](http://127.0.0.1:43110/1KXgv2wg6UdzoCqusaS5cCuXzkPsy7f1wm/)\n\n[美中贸易大战](http://127.0.0.1:43110/1LXgC6GXAc535zw8gLQbZpXnfoXNGkQDjh/)\n\n[爆料台](http://127.0.0.1:43110/18eb8HAMQnS8SLJRxMekSGjskNXEtNZZzw/)\n\n[墙内消息](http://127.0.0.1:43110/17PC9PwGFg1rzXnnr6uZe9uQKj7QyED5P6/)\n\n[谈革命](http://127.0.0.1:43110/13LzMTjYM5xGMfnXq6hqAARra5UpmCYt12/)\n\n[自由人聊天室](http://127.0.0.1:43110/1LaXzrgAtsXwdQQdkzFwbLPozoWgTVUQnv/)\n\n[Zer0 Up Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)\n\n[ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)\n\n[1024记录](http://127.0.0.1:43110/1CuGFe64XH3XLCiEPkSkwRprrfqZzdAjpp/)\n\n[公义行动](http://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/)\n\n[幻想未知](http://127.0.0.1:43110/19vi7xKAZsuMrfpp4z4zAMmhY8QNvXN3Sm/)\n\n[大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/)\n\n[朝花夕拾](http://127.0.0.1:43110/lastone.bit/)\n\n[历史中的404](http://127.0.0.1:43110/1PGxGwpMtEJ22FPDiyXAiQFBrhiFXEtGF5/)\n\n[卡拉卡拉的博客](http://127.0.0.1:43110/12YPedbiK2S74s5Fjgcvjv21JYAjL1zaCC/)",
	"next_post_id": 61,
	"demo": false,
	"modified": 1611123741,
	"post": [
		{
			"post_id": 60,
			"title": "世界維吾爾代表大會新聞發布：",
			"date_published": 1611123713.896,
			"body": "世界維吾爾代表大會歡迎美國（對維吾爾人遭遇迫害的）種族滅絕定性"
		},
		{
			"post_id": 59,
			"title": "国务卿鹏佩奥：",
			"date_published": 1611123400.066,
			"body": "我已确定中华人民共和国正在中国新疆对维吾尔族穆斯林和其他少数民族和宗教团体成员犯种族灭绝和违反人类罪。"
		},
		{
			"post_id": 58,
			"title": "特朗普政府考虑指控中国对维吾尔人实施“种族灭绝”",
			"date_published": 1598626034.278,
			"body": "据美国新闻网站“政治”8月25日引述两名特朗普政府官员透露，美国正考虑将中国残酷压迫维吾尔穆斯林少数民族的行径正式指控为“种族灭绝”。"
		},
		{
			"post_id": 57,
			"title": "美国国会终于通过了《维吾尔法案》",
			"date_published": 1589549073.68,
			"body": "美国参院今天傍晚无异议地通过《维吾尔人权政策法案》，将对侵犯穆斯林人权的中国官员进行制裁，新疆自治区党委书记 陈全国 被特别点名。\n\n这是美国对中国在过去三年来大规模实行的再教育营的最明确表态，也为已经走向对抗的美中关系再添柴火。"
		},
		{
			"post_id": 56,
			"title": "美国驻荷兰大使与荷兰维吾尔社区代表共进午餐",
			"date_published": 1586523374.029,
			"body": "![2.jpg (0x0)](data/img/post_56_2.jpg)\n\n美国驻荷兰大使与荷兰维吾尔社区代表共进午餐，并且听取了维吾尔代表们揭露的中国政府在新疆的更多人权侵犯行为。大使也希望以后跟维吾尔社区开展合作结束中国政府的恐怖行为。"
		},
		{
			"post_id": 55,
			"title": "欧洲议会向伊力哈木颁发萨哈罗夫人权奖",
			"date_published": 1576972621.879,
			"body": "![1.jpg (0x0)](data/img/post_55_1.jpg)\n\n![2.jpg (0x0)](data/img/post_55_2.jpg)\n\n伊力哈木的女儿代表父亲出席颁奖典礼\n\n![3.jpg (0x0)](data/img/post_55_3.jpg)\n\n伊力哈木的女儿代表父亲出席颁奖典礼\n\n![4.jpg (0x0)](data/img/post_55_4.jpg)\n\n伊力哈木的女儿代表父亲出席颁奖典礼\n\n![5.jpg (0x0)](data/img/post_55_5.jpg)\n\n伊力哈木的女儿代表父亲发言致谢"
		},
		{
			"post_id": 54,
			"title": "世维会柏林设分部 议员政要到场声援",
			"date_published": 1572011179.782,
			"body": "![1.jpeg (0x0)](data/img/post_54_1.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。世维会主席多力坤．艾沙（Dolkun Isa，中）、国会议员马丁．帕策尔特（Martin Patzelt，右四）、国会议员鲍泽女士（Margarete Bause，左四）和美国驻德使馆代表内尔森（Jake Nelson，左二）合影。_\n\n【大纪元2019年10月25日讯】（大纪元记者黄芩德国柏林采访报导）在新疆遭受中共打压的维吾尔族人在欧洲又多了一个发声的地方。总部位于德国慕尼黑的世界维吾尔代表大会（简称“世维会”）在柏林新增办事处，方便沟通，帮助德国政府和舆论更关注中共对维族人的人权迫害。在10月22日晚的首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。\n\n现任世维会主席多力坤．艾沙（Dolkun Isa）在致词中表示，中共建政以来，一直在试图消灭维族文化，目前在新疆省，至少有三百万维吾尔族人被关押在再教育营，政府到处实施监控。世维会之所以在柏林设立分支，因为德国是欧盟最重要的国家，一贯支持人权，但对维族人在新疆遭受的迫害不够重视。他强调，德国政府有责任，发出比其它欧盟国家更强的声音，要求中共关闭集中营。\n\n![2.jpeg (0x0)](data/img/post_54_2.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为德国国会议员马丁．帕策尔特（Martin Patzelt）现场发言。（张清飖／大纪元）_\n\n执政党CDU负责人权的国会议员马丁．帕策尔特（Martin Patzelt）来自前东德，对共产主义的本质深有了解。他在发言中说，中共政府没有意识到，对个人自由的消灭，就是对繁荣幸福的消灭。当年东德的制度类似中共，早就走向解体，如今柏林墙已被推倒了30年。而今天的香港，还在为自由和人权抗争，在这样的情况下，应给予自由和人权优先权，经济利益先往后放。\n\n![3.jpeg (0x0)](data/img/post_54_3.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为德国国会议员鲍泽女士（Margarete Bause）现场发言。（张清飖／大纪元）_\n\n德国国会议员、绿党人权政策发言人鲍泽女士（Margarete Bause）来自慕尼黑，她在现场发言中说，因为世维会总部在慕尼黑，所以13年来她一直在密切关注维族人受中共迫害的情况。她祝贺柏林新办公室的开张，表示这能增加世维会的能见度。她说读过关于中共企图消灭维族文化的报导，令人震惊，通过世维会这类组织的努力，要让全世界都知道这件事情，各界要共同来谴责中共，对其进行制裁。要记录人权侵犯的罪行，将来追究责任。她强调，在人权问题上，保持沉默是最糟糕的，为别人的人权发声也就是为自己的人权发声。\n\n![4.jpeg (0x0)](data/img/post_54_4.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为美国驻德使馆代表内尔森（Jake Nelson）现场发言。（张清飖／大纪元）_\n\n美国驻德使馆代表内尔森（Jake Nelson）到场致贺词。内尔森表示，美国对中国广泛限制宗教自由并不断升级深感担忧，美国一直在关注维族和穆斯林在中国遭受迫害的情况。中国的镇压不只表现在集中营，还体现在利用高科技监视收集个人数据，限制文化、语言和宗教身份，并对第三国合法工业施加压力等。内尔森强调，我们敦促中国政府根据国际法规定的义务，尊重所有人的人权和基本自由。\n\n![5.jpeg (0x0)](data/img/post_54_5.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为台湾驻德代表处大使谢志伟教授现场发言。（张清飖／大纪元）_\n\n台湾驻德代表处大使谢志伟教授也到场致词，他表示，新办事处的设立展示了希望，他到场是代表台湾支持维族人争取人权。他说，中共处处想改造别人，而真正应该接受改造的是中共，改造到全社会有言论自由、信仰自由。\n\n![6.jpeg (0x0)](data/img/post_54_6.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为德国国会议员米勒-罗森特瑞特（Frank Müller-Rosentritt，中）到场祝贺。（黄芩／大纪元）_\n\n德国自民党国会议员米勒-罗森特瑞特（Frank Müller-Rosentritt）也到场表示祝贺，他告诉大纪元记者，前来参加开幕式是为自由民主和多样性发出强大的声音，大力支持现今不能自由生活和受压迫的所有人。\n\n![7.jpeg (0x0)](data/img/post_54_7.jpeg)\n\n_2019年10月22日晚，世维大会在德国首都分部开张仪式上，政界、外交、人权组织等各界代表纷纷前来祝贺。图为国际支持藏族协会主席穆勒（Kai Müller)现场发言。（张清飖／大纪元）_\n\n到场祝贺发言的还有德国人权组织“为了受威胁的民族”主席德琉斯（Ulrich Delius）和国际支持藏族协会主席穆勒（Kai Müller）。\n\n在欧洲，除了德国，世维会在欧盟中心布鲁塞尔和英国首都伦敦均已设立分支。\n\n责任编辑：李沐恩"
		},
		{
			"post_id": 53,
			"title": "传中共治疆三头目上制裁名单 川普手握利器",
			"date_published": 1571462235.209,
			"body": "![1.jpeg (0x0)](data/img/post_53_1.jpeg)\n\n_在新一轮美中贸易谈判前，美国公布制裁中共涉疆的部分单位，同时美国还将一批涉疆中共高官列入制裁名单。图为新疆再教育营地。_\n\n【大纪元2019年10月19日讯】（大纪元记者古清儿报导）在新一轮美中贸易谈判前，美国公布了制裁中共涉疆的部分单位，同时美国还将一批涉疆中共高官列入制裁名单。近期，有外媒披露了这批遭制裁的新疆官员名单，包括新疆书记陈全国等共有9人。如果这份名单属实，那中共控制新疆当地的三大头目，即新疆书记、自治区主席、人大主任全部上了名单。\n\n---\n\n**传中共新疆三头目上制裁名单 美在多个人权问题上施压中共**\n\n10月7日，因为人权原因，美国商务部将28个中共公安部门和企业列入黑名单，包括海康威视、旷视科技等。美国国务卿迈克?蓬佩奥（Mike Pompeo）8日宣布，将一批涉疆中共高官列入制裁名单，但没有公布官员的数量与姓名。\n\n有外媒引述来自美国华裔律师傅希秋的消息指，美方因顾及中美贸易谈判暂未公布名单，据知目前有9人被列入制裁名单中，包括新疆书记陈全国、中央统战部九局（新疆局）副局长胡联合、新疆主席雪克来提?扎克尔、新疆人大副主任朱海伦（曾任新疆政法委书记）、新疆生产建设兵团党委书记兼政委孙金龙、新疆副主席兼新疆生产建设兵团司令彭家瑞、武警新疆总队司令周建国、武警部队装备部长管延密（原新疆总队司令员）及新疆自治区人大主任肖开提?依明。\n\n报导说，名单一旦公布，这9名高官不仅无法赴美，他们在美国的亲属将受影响，财产也将面临被美国政府没收。例如，扎克尔有多个亲属定居在美国和德国，其他高官也有亲属在美国或澳洲等。\n\n报导提到，目前中共非常紧张，据悉已透过各种途径要求美国停止公布名单。为此，中共还暂停了新疆再教育营，并把大部分被关押洗脑的维族人放回家。\n\n如果外媒报导属实，那么中共治疆四套班子的头目，即书记、自治区主席、人大主任、政协主席中的三人上了美国的制裁名单。\n\n除新疆问题外，有关香港的一个人权法案也受到全球关注。\n\n10月15日，美国国会就《香港人权与民主法案》进行审议并表决，并一致通过。之后该法案将在美国参议院举行表决。\n\n此法案要求美国国务卿根据香港的经贸和法治人权状况，每年向国会报告是否应保留香港的特殊待遇；要求美国国务院不要对那些因参与非暴力请愿而被捕的香港人拒发签证；要求总统每年点名、制裁香港侵害人权人士。\n\n**贸易战中共作出部分让步**\n\n与之几乎同时出现的是，中共在美中贸易谈判上作出的部分让步。\n\n美中第13轮（高级别）贸易磋商于10月11日上午结束。下午2点45分，川普在椭圆形办公室会见了中共副总理刘鹤。\n\n川普11日对外表示，他认为美中两国已“非常接近”结束贸易战。\n\n此轮谈判究竟涉及哪些具体内容呢？川普会见刘鹤后，举行了记者招待会，谈到10个方面的问题：1、书面协议仍需数周；2、中美在原则上取得进展，包括农业、知识产权保护等；3、农产品；4、关税；5、金融；6、技术转让；7、华为公司；8、中国公司黑名单；9、中国留学生；10、香港抗议。\n\n中共承诺将购买多达400至500亿美元的美国农产品，并对外国金融服务机构进一步开放。\n\n川普形容现在美中关系，从“紧张”又重新回到了“爱情时光”。\n\n相对美国对于谈判结果的乐观，中共官媒的态度却含糊其词。此外，一些亲中媒体批评中共“屈服”了。\n\n港媒东网10月13日的评论文章表示，这份与其说是对双方皆为“大好事”的协议，毋宁说是中国向美国屈服的协议，由农业到技术转让，由金融市场到知识产权，无一不大幅度向美国让步。\n\n时事评论员李林一说，近期中共在贸易战作出让步，有多方面的原因，诸如国内经济持续下行，压力较大；香港抗议难以收场，美国欧盟紧盯不放等。这次美国对中共在新疆人权问题上的制裁，应该也是推动中共让步的原因之一。其实就是中共求饶。\n\n李林一认为，中共在人权方面劣迹斑斑。如果中共在贸易问题上仍不让步，川普随便拿出几条来，就会在道义上占上风，并对中共官员予以制裁。如制裁迫害法轮功、基督教、异议人士的官员等等。\n\n**在人权问题上 川普对中共有更大杀伤力“武器”**\n\n除了香港、新疆问题，川普在人权问题上握着的利器，那就是法轮功问题。美国近期已在特别关注法轮功在中国遭受迫害的状况。\n\n今年7月17日下午4点半，川普在白宫椭圆形办公室会见了来自17个国家的27位宗教迫害幸存者，其中包括来自中国的法轮功学员张玉华女士。这是川普总统首次在白宫正式与受中共迫害的法轮功学员会见。\n\n张玉华告诉川普，活摘法轮功学员器官仍在发生着，她请求川普帮助制止中共政权发动的这场迫害。\n\n川普对张玉华女士连声说：“我明白。”川普还说，“在美国，我们始终明白我们的权利来自上帝（神），而不是来自政府。”\n\n7月18日，彭斯副总统出席美国国务院主办的第二届推进宗教自由部长级会议时，批评了中共对宗教团体的迫害，并表示，中共的迫害无法阻止人们对于信仰的追求，而如今信仰正在中国遍地开花。\n\n7月18日﹐美国国务卿蓬佩奥在美国国务院主办的第二届推进宗教自由部长级会议上，以法轮功等信仰团体为例，指出中共迫害宗教自由的严重性。\n\n蓬佩奥说：“在场的每个人都知道，中国有信仰的人们需要支持。去年9月，陈慧霞，一名法轮功学员，被判入狱三年半，仅仅因为实践她的信仰。”\n\n8月5日上午，美国副总统彭斯在白宫副总统会议室，会见了4名受邀参加“国际宗教自由圆桌会议”的成员。其中包括华盛顿DC法轮功学员代表陈杰夫先生（Jeff Chen）等。\n\n海外明慧网今年5月31日《通告》，美国政府意在更加严格地审核签证申请、对人权及宗教迫害者拒发签证。美国国务院官员告知美国法轮功学员可以提交迫害者名单。\n\n这期间，法轮功学员将一批迫害者的名单递交给美国国务院。这些名单包括中共宣传部门负责人、各级政法委、“610”负责人、涉嫌活摘法轮功学员器官的医生、监狱系统负责人，也有法官和劳教所恶警。他们当中既有直接实施迫害者，也有政策制定者及命令下达者。\n\n李林一认为，从1999年迫害发生开始算起，这20年来，中共参与迫害法轮功的高官遍布大陆各地。如果这次对新疆人权问题的制裁名单最后被证实是真的，那未来仍在迫害法轮功的官员或会受到美国的制裁。\n\n责任编辑：林锐"
		},
		{
			"post_id": 52,
			"title": "美国国会“维吾尔人权政策法”全文翻译",
			"date_published": 1569992252.705,
			"body": "【大纪元2019年10月02日讯】谴责严重侵犯新疆突厥族穆斯林人权的行为，并呼吁停止对中国境内外这些（维族）社区的任意拘留、酷刑和骚扰。\n\n第116届国会第一届会议\n\n由美国参议院和美国众议院在国会中制定\n\n**第1章 简短标题**\n\n该法案可能被称为“2019年维吾尔人权政策法案”。\n\n**第2章 目的声明**\n\n该法案的目的是指导美国分配资源处理严重侵犯公认人权的行为，包括大规模拘留中国境内超过1千万名维吾尔族和其他主要是穆斯林的少数民族，以及对美国公民和合法永久性居民的恐吓和威胁。\n\n---\n\n**第3章 适当的国会委员会**\n\n在本章节中，“适当的国会委员会”一词是指：\n（1）（参议院）对外关系委员会，武装部队委员会，情报特别委员会，银行、住房和城市事务委员会，司法委员会和参议院拨款委员会；和\n（2）（众议院）外交事务委员会，武装部队委员会，情报常设委员会，财务委员会，司法委员会和众议院拨款委员会。\n\n**第4章 国会作出以下调查结果：**\n\n（1）中华人民共和国政府（PRC）长期以来一直压制大约1千3百万突厥、温和的逊尼派穆斯林，特别是维吾尔人，名义上自治的新疆地区。这些行动违反了国际人权标准，包括《世界人权宣言》和《公民权利和政治权利国际公约》。\n\n（2）近几十年来，中央和地区的中央政府政策系统地歧视维吾尔族、哈萨克族和新疆的其他穆斯林，剥夺了他们的一系列公民权利和政治权利，包括言论自由，宗教信仰，运动自由，以及公平审判等等。\n\n（3）由于中央政府的严厉镇压，新疆地区的动乱加剧，这被中华人民共和国政府用作奥威尔式的“恐怖主义”和“分裂主义”的证据，并以此为借口做进一步不合比例的（镇压）反应。\n\n（4）自从2014年，针对新疆少数民族社区，中国当局发起了他们最近期的“抵制暴力极端主义”运动，其中以大规模、国际性的恐怖主义威胁为借口，用来合理化普遍存在的限制和严重侵犯人权的行为。\n\n（5）这些政策包括：\n\n（A）在整个地区进行普遍的高科技监测，包括在不知情或不同意的情况下任意收集生物数据，包括儿童的DNA样本；\n（C）面部和语音识别软件和“预测警务”数据库；\n（D）严格限制整个地区的行动自由。\n\n（6）中国安全部队从未对Alaqagha（2014），Hanerik（2013）和Siriqbuya（2013）的大规模枪击事件，以及非法杀害Abdulbasit Ablimit（2013）和Rozi Osman（ 2014）提供可靠报告。\n\n（7）（A）2016年8月前西藏自治区党委书记陈全国转为新疆党委书记，促使该地区的镇压行动加快。\n（B）新疆的地方官员使用令人毛骨悚然的政治言论来描述政府政策的目的，包括“铲除肿瘤”和“化学除草”。\n（C）维吾尔人被迫庆祝中国的文化传统，如中国新年。由于国家对维吾尔族文化遗产的控制，例如muqam（音乐传统）和meshrep（传统文化聚会），并且由于取消了维吾尔语作为新疆学校和大学的教学语言，维吾尔文化面临着被根除。\n\n（8）2017年，可靠的报告发现，居住在中国境外的维吾尔族家庭成员在中国境内失踪，中国当局向国外的人施压，要求他们返回，并有大量人被任意拘留。\n\n（9）学者，人权组织，记者和智囊团提供了充分的可靠证据，证明中国当局建立了“政治教育”营地。\n\n（10）独立组织进行了采访，包括KayratSamarkan，Omir Bekali和Mihrigul Tursun，以及其他被拘留在这些设施中的人的证词，他们描述了强迫政治灌输，酷刑，殴打，食物匮乏和单独监禁，以及无法统计时间拘留的，羞辱，并且否认宗教，文化和语言自由，并确认被警卫人员告诉他们，获得释放的唯一方法是表现出足够的政治忠诚。\n\n这些设施的条件恶劣和缺乏医疗明显导致一些被拘留者死亡，包括老人和体弱者。\n\n据报导，Hesen Imin（2017年）和Sawut Raxman（2017年）在没有经过适当调查的情况下，在“政治教育”营地中被中国当局拘留期间去世。\n\n现已在其他国家获得永久居留或公民身份的维吾尔人和哈萨克人，提供证词说他们受到中国官员的威胁和骚扰。\n\n（12）在中国政府的压力下，各国不得不将维吾尔人遣返中国，这违反了不驱回原则及其违反了有充分理由的迫害恐惧的原则。\n\n遣返维吾尔族的国家包括埃及（2017年），阿拉伯联合酋长国（2017年），马来西亚（2011年，2013年），泰国（2011年，2015年），老挝（2010年），缅甸（2010年），柬埔寨（2009年），越南（2014年） ，哈萨克斯坦（1999年，2001，2003，2006），乌兹别克斯坦（2007年），塔吉克斯坦（2011年），巴基斯坦（2003年，2009年，2011年），尼泊尔（2002年）和印度（2016年）。\n\n（13）自由亚洲电台维吾尔族服务的六名记者公开详细报导了他们在新疆的家人为应对他们在该地区暴露滥用政策的工作而遭受的虐待。\n\n（14）一些美国公司正在与新疆当局开展业务，但没有充分的干预或保障措施，以确保其业务运营不会造成或助长侵犯人权行为。\n\n（15）中华人民共和国政府越来越多地投资于新疆和整个中亚的“一带一路”倡议，通过“上海合作组织”等组织扩大其影响力，而不考虑政治，文化，或少数民族的语言权利。\n\n（16）国务卿、国会中国执行委员会、汤姆·兰托斯人权委员会以及行政部门和国会的个人成员都对新疆普遍存在的侵犯人权行为和“政治再教育营”表示了越来越多的关注。\n\n（17）2018年8月，联合国消除种族歧视委员会向中华民国政府提出了新疆侵权行为的质疑，包括建立大规模任意拘留营。\n\n（18）2018年8月至9月期间，中国当局对这些指控做出了回应，要么断然否认这些指控，要么坚称这些设施是“职业培训中心”。\n\n（19）2018年9月，新任命的联合国人权事务高级专员米歇尔·巴切莱特在她的第一次高级专员讲话中指出，“对维吾尔族和其他穆斯林社区进行大规模任意拘留的令人深感不安的指控，即所谓的遍布新疆的教育营地。\n\n（20）2018年9月18日，华盛顿邮报的编辑委员会写道，“利害攸关的不仅仅是维吾尔人的福利，还有21世纪的技术是否会被用来扼杀人类的自由。”\n\n（21）2018年12月，参议院外交关系委员会，民主，人权和劳工局副助理部长斯科特·巴斯比的东亚，太平洋和国际网络安全政策小组委员会作证，证实被拘留者人数自2017年4月以来，在难民营中“至少有80万，可能超过200万”。\n\n（22）2018年12月，独立媒体报导指出越来越多的证据显示难民营中有强迫劳动，并且有报告说，从营地被释放的人被迫在附近的工厂以低工资做劳工，否则被威胁被送回“政治再教育营”。\n\n（23）2018年12月和2019年1月，中国官员组织了来自12个非西方国家的一小群外国记者和外交官访问新疆的“政治教育营”。在访问之前的几个月里，国际媒体报导说，官员们努力从一些“政治教育”营中拆除安全设备痕迹，并勒令被拘留者和当地居民不要对营地做出负面评论。报告还指出，官员已将大量被拘留者转移到中国其它地区的拘留所。\n\n（24）专家们将新疆地区描述为“与朝鲜竞争的警察国家，如同南非种族隔离的正式种族主义”以及新疆地区的“慢动作天安门”的镇压。\n\n**第5章 国会的意见**\n\n（1）总统应该谴责中国当局在新疆对突厥穆斯林的虐待，并呼吁中国国家主席习近平承认针对中国现行政策的深刻滥用和不易持久的破坏，并立即关闭“政治教育”营，解除所有限制并确保尊重整个地区的国际保障人权，并允许重新建立中国国内外的联系；\n\n（2）美国政府应制定一项战略，支持联合国人权事务高级专员和许多联合国特别报告员紧急呼吁立即和不受限制地进入新疆，包括“政治再教育营”； 并指示美国驻联合国代表利用美国的声音和投票权来谴责中华人民共和国境内对突厥穆斯林的大规模任意拘留，酷刑和强迫劳动；\n\n（3）国务卿应考虑现有权力机构的适用性，包括“全球马格尼茨基法案”（公法114-328副标题F），对中华人民共和国政府，中国共产党政府成员实施有针对性的制裁，中国共产党和国家安全机构，包括新疆党委书记陈全国和其他官员，可信地指控他们在新疆和其他地方侵犯人权；\n\n（4）国务卿应充分执行“弗兰克沃尔夫国际宗教自由法”（公法114-281）的规定，并考虑根据“国际宗教自由法”（22 USC 6401 et seq.）战略性地采用制裁和其他工具。指对中华人民共和国政府作为的“特别关注国家”（CPC）中的一部分，直接针对其特别严重的宗教自由侵犯行为采取必要的措施；\n\n（5）商务部应审议和考虑禁止销售或提供任何美国制品和服务给中共政府在新疆的代理机构，包括新疆共产党分支机构，新疆公安局和新疆中共中央统战部，或代表他们针对突厥穆斯林人士进行大规模拘禁或强迫劳动的任何实体机构，并将其列入到商务部管理的“实体清单”（Entity List）；\n\n（6）国务卿应探索建立自愿数据库的适当机制，维吾尔族侨民的美国公民或永久居民家庭成员可以提供有关失踪家庭成员的详细信息，以期向政府提供信息和对中华人民共和国问责，并采取适当措施加快维吾尔族、哈萨克族和其他突厥穆斯林少数民族的庇护申请；\n\n（7）在新疆销售商品或服务或以其它方式经营的美国公司和个人应采取措施，包括在任何公共或财务备案中公开宣称其商业活动没有助长新疆或中国其他地区的侵犯人权行为；以及他们的供应链不会受到强迫劳动的损害；\n\n（8）联邦调查局和适当的美国执法机构应跟踪并采取步骤，追究来自中国官员的责任，这些官员骚扰，威胁或恐吓美国公民和合法永久居民，包括突厥穆斯林、维吾尔裔美国人、华裔美国人。在美国合法学习或工作的中国国民；\n\n（9）国务卿应与美国传统盟友和合作伙伴一起采取类似步骤，并在针对性制裁和签证限制方面进行密切协调；\n\n（10）需赞扬自由亚洲电台维吾尔语服务的工作，因为它详细、准确地介绍了维吾尔人和中国其他少数民族身上正在发生的事，尽管中华人民共和国政府努力通过威胁和拘留来恐吓他们的在中国的家庭成员。\n\n**第6章 国家安全报告**\n\n（a）总体而言——在本法案颁布之日起180天内，国家情报局长应与国务卿协调，向有关国会委员会提供一份机密和非机密报告评估整个新疆的镇压行动对国家和地区的安全威胁，中亚和东南亚各国政府强行遣返突厥族穆斯林难民和寻求庇护者的频率，以及使得中华人民共和国政府为突厥穆斯林进行大规模拘留和监视而使用的技术的转移或研发，包括与预测性警务和大规模资料收集和分析有关的技术。\n\n（b） 附件——（a）要求的报告应附上一份附件，其中列出所有参与新疆“政治教育”营建设或运营，以及提供或操作监视技术或业务的中国公司。\n\n**第7章 保护美国公民和居民免受恐吓和威胁**\n\n（a）总体而言——在该法颁布之日起90天内，联邦调查局局长应与国务卿协商，向适当的国会委员会提交报告，概述任何以及向美国公民和居民提供资讯和保护的一切努力，包括维吾尔族和在美国合法学习或暂时工作的中国公民，却在美国受到中华人民共和国政府和共产党官员继代理人的骚扰或恐吓，以及因工作或传播（信念）而导致在中国的家人遭受威胁或拘留的人。\n\n（b） 被拘留的美国公民和居民家属资料库——国务卿应探讨适当的机制，建立一个自愿性质资料库，供美国公民或永久居民使用，可以提供有关失踪家庭成员的详细情况，以便敦促中华人民共和国政府提供资讯和问责，并采取适当措施加快维吾尔人、哈萨克人和其他突厥穆斯林少数民族的申诉。\n\n**第8章 公共外交报告**\n\n（a） 报告——不迟于本法颁布之日起120天，美国全球媒体机构的首席执行官应向适当的国会委员会提交一份报告以：\n\n（1）描述美国广播到新疆地区和全球维吾尔文社区的现状和范围，对新闻和资讯自由流向这些社区的障碍，并酌情详细提供技术和财政的必要要求，以增加向全球这些社区（送达）广播和其它媒体；\n（2）描述为恐吓自由亚洲电台和美国之音记者报导中华人民共和国人权问题所作的后果；\n（3）并与美国国务院全球接触中心协商，描述和评估中华人民共和国政府或上海合作组织其他成员针对维吾尔文的虚假资讯和宣传社会，并努力淡化在新疆地区发生的严重侵犯普遍承认的人权，以及任何针对这些努力的活动或计划。\n\n（b）国会意见——国会认为，自由亚洲电台的维吾尔文服务社的记者们，尽管遭遇中华人民共和国政府以拘留其家庭成员和亲属来竭力消声或恐吓他们的报导，但他们（仍然）对新疆的人权和政治局势进行了报导，（他们）应该受到高度赞扬。\n\n**第9章 年报**\n\n（a） 在该法颁布之日起180天内，以及此后每年，国务卿在咨询有关联邦机构和民间社会组织后，应提交适当的国会委员会，并在国务院网站上提供一份机构间报告，其中包括：\n\n（1）评估在新疆地区被拘押者中被拘留的“再教育营”人数和在拘留营的条件，包括被拘留者是否遭受酷刑、被迫放弃信仰或其他虐待；\n（2）尽可能说明营地的地理位置，估计被拘留在这类设施中的人数；\n（3）说明中华人民共和国当局对维吾尔族在押人员以及中华人民共和国负责再教育的机构”再教育”的方法；\n（4）评估被任意拘留的人数，包括在审前拘留所和监狱中；\n（5）对在营地和地区工厂中被迫送回“政治教育”营地的威胁下的低工资进行的强迫劳动评估；\n（6）受益于这种劳动的中国公司和行业清单，以及 一份描述为从事强迫劳动而采取的行动（根据《 2018年人口贩运报告》，中华人民共和国被认定为第三级国家。）\n（7）对中华民国政府给予外交、新闻工作者和其他人员进入新疆地区的准入程度的评估，并描述了用于阻碍监测新疆地区人权状况的措施；\n（8）对中华人民共和国新疆地区公安机关使用的压制性监视、侦查和控制方法的评估，以及担任高级领导职务和负责”高科技”警务的人员名单，针对新疆地区维吾尔族和其他穆斯林占多数的少数民族的大规模监禁和再教育工作；\n（9）说明美国为解决新疆地区严重侵犯普遍承认的权利和保护该地区的寻求庇护者而进行的外交努力，其包括在多边机构中以及通过双边关系与中华人民共和国，各国的双边关系伊斯兰合作组织（OIC）以及其他国家/地区。\n\n（b） 终止——国务卿可终止（a）条款所要求的报告，如果国务卿向国会有关委员会证明：严重侵犯人权和大规模拘留维吾尔族和其他穆斯林占多数的少数民族（的行为）在新疆地区已经结束。\n\n**第10章 国务院特别协调员**\n\n（a）总而言之——国务卿应考虑在美国国务院特别事务部国务院内设立一个新职位，该职位将协调外交，政治，公共外交，财政援助，制裁，反恐，美国政府内部的安全资源和国会报告要求，以应对新疆地区发生的严重侵犯普遍承认的人权的行为，包括解决维吾尔族和其他主要是穆斯林少数民族的大规模拘留，采用先进技术监视和警察侦查方法，以及使用反恐和反激进主义主张为中华人民共和国政府在新疆的政策辩护。\n\n（b）任命——如果国务卿确定设立（a）款所述职位是适当的，则国务卿可以从国务院的官员和雇员中任命特别协调员。国务卿可允许该高级职员或雇员保留该高级职员或雇员担任的职务（以及与该职务有关的责任），然后再任命高级职员或雇员为特别协调员。\n\n（c）终止——国务卿可在向适当的国会委员会证明在新疆结束了普遍侵犯维吾尔人和其他穆斯林为主的少数民族的严重侵犯人权行为后，终止了特别协调员的职务区域。\n\n（d）咨询——在根据本条指定特别协调员之前，国务卿应与适当的国会委员会的主席和少数党成员进行咨询。\n\n_本法案原文来自马克·卢比奥（Marco Rubio）议员的官方网站。_\n\n责任编辑：孟文澜"
		},
		{
			"post_id": 51,
			"title": "反中共迫害人权 维吾尔人在纽发声",
			"date_published": 1569846836.86,
			"body": "![1.jpg (0x0)](data/img/post_51_1.jpg)\n\n_9月29日上午，国际特赦组织在奥克兰市中心的Aotea广场举行反对中共迫害人权集会。（易凡／大纪元）_\n\n【大纪元2019年09月30日讯】（大纪元记者易凡新西兰奥克兰报导）9月29日上午，国际特赦组织在新西兰奥克兰市中心的Aotea广场举行反对中共迫害人权集会。维吾尔社区参与了此次集会，法轮功学员也在集会上对中共的迫害表示谴责，多名嘉宾发言。\n\n世界和平联盟（federation of world peace）和平大使Anne Degia-Pala在集会中说：“今年联合国最高人权机构以及联合国的22个国家在日内瓦发表了联合声明，敦促中囯（中共）结束对新疆地区的大规模拘留和相关暴力。他们还呼吁中国与联合国人权事务专员合作，使联合国专家可以进入该地区。上次关于中国的联合声明有12个签署国，而这一次几乎翻了一倍，这反映出国际社会对新疆局势的日益关注。”\n\n---\n\n“上百万人未经法律程序就被拘留、洗脑、虐待甚至是酷刑。中国（中共）在言论自由和法治等关键问题上提供公然错误的答案，甚至利用外交相威胁。北京认为在新疆问题上可以逃避国际审查，这是错误的。我们必须谴责这种对人权的迫害，制止这种对少数民族的种族清洗。”\n\nPonsonby浸信会教堂的Alison Sharon说：“生活在新疆的维吾尔人，他们的世界已远离和平，没有信仰的自由，甚至没有生活的自由。安全检查已成为该地区所有人日常生活的组成部分，中共随时可以检查你的手机查找可疑内容，使用脸部识别软件核查你的身份。一个维吾尔族学生2017年底回国探亲，至今再也没有回来。我担心他可能已被拘留在再教育营中。”\n\n“维吾尔人民迫切需要和平与正义。希望我们在有仇恨的地方播下爱，在受伤的地方播下宽恕，在有矛盾的地方播下团结，在有怀疑的地方播下信任，在绝望的地方播下希望，在有悲伤的地方播下欢乐，将同情和希望带入彼此的生活。”\n\n![2.jpg (0x0)](data/img/post_51_2.jpg)\n\nPonsonby浸信会教堂的Alison Sharon发言。（易凡／大纪元）\n\n人权律师Kerry Gore说：“10月1日中共将庆祝建政70周年，但这实在没什么好庆祝的。如果你是法轮功学员、是维吾尔人、是家庭教会成员、是藏传佛教徒、是民主倡导者、是人权律师，或者是家里房子被强拆的普通人，你都有可能遭受非法抓捕、非法拘禁、洗脑、虐待、精神折磨、强制放弃信仰、强制劳工、甚至活摘器官等。”\n\n“虽然中共签署了联合国的人权法案，实际上却形同虚设。我希望你们能拜访当地的国会议员，呼吁他们帮助制止中共的迫害，并将迫害者绳之以法。”\n\n集会中民众发言踊跃。由于担心国内的家人受牵连迫害，有的人带着面具发言，也有的人将自己的发言写在本子上，由主持人代读。还有很多人将自己的希望写在地上的留言布上。\n\n集会中展示的照片显示，新疆目前已知有172家集中营，即所谓的“再教育营”，有100万维吾尔族人被关在其中。不但他们的文化、信仰被强制剥夺，在喀什机场还设有一条“人体器官快速通道”，所经受的大规模迫害想必还没有被披露出来。\n\n![3.jpg (0x0)](data/img/post_51_3.jpg)\n\n维吾尔族人Shawudun Abdul-Gopur发言。他的大哥被判刑11年。二哥、弟弟和78岁的母亲都被关在集中营里。（易凡／大纪元）\n\n![4.jpg (0x0)](data/img/post_51_4.jpg)\n\n新西兰穆斯林协会主席Ikhlaq Kashkari发言，呼吁中国包容多远文化。（易凡／大纪元）\n\n![5.jpg (0x0)](data/img/post_51_5.jpg)\n\n维吾尔族的专家、学者、社会名流，据信有300多人也被关押在集中营内。图为其中一小部分。（易凡／大纪元）\n\n![6.jpg (0x0)](data/img/post_51_6.jpg)\n\n集会中展示的部分图片（易凡／大纪元）\n\n![7.jpg (0x0)](data/img/post_51_7.jpg)\n\n集会中展示的照片显示，新疆目前已知有172家集中营，即所谓的“再教育营”。（易凡／大纪元）\n\n![8.jpg (0x0)](data/img/post_51_8.jpg)\n\n有人担心家人被迫害，不得不带着面具发言。（易凡／大纪元）\n\n![9.jpg (0x0)](data/img/post_51_9.jpg)\n\n集会民众自由发言。（易凡／大纪元）\n\n![10.jpg (0x0)](data/img/post_51_10.jpg)\n\n奥克兰公民权利委员会主席Barry Wilson谴责中共迫。害人权。（易凡／大纪元）\n\n责任编辑：徐亦扬"
		},
		{
			"post_id": 50,
			"title": "蓬佩奥怒批中共：在消灭自己公民",
			"date_published": 1569238682.369,
			"body": "【新唐人北京时间2019年09月23日讯】中共迫害新疆维吾尔族的手段不断升级，近日中共更要求各国将维吾尔族人遣返。对此，美国国务卿蓬佩奥（Mike Pompeo）谴责中共是在“消灭自己的公民”。\n\n---\n\n美国国务卿蓬佩奥9月22日呼吁所有国家，抵制中共遣返维吾尔族人的要求，并批评中共在新疆的行为，是在“消灭自己的公民”。\n\n总部设于德国的流亡维吾尔人组织“世界维吾尔大会”，去年8月向联合国一个人权委员会提交报告，指控中共政府大约将100万名维族人非法拘禁在“再教育中心”，进行思想改造。\n\n蓬佩奥批评中共，在新疆的镇压行动与恐怖主义无关，是试图抹杀自己的公民，“我们呼吁所有国家抵制中国（共）遣返维吾尔人的要求。”\n\n蓬佩奥是22日在纽约的联合国大会开始之前，与5个中亚国家——土库曼斯坦、吉尔吉斯斯坦、乌兹别克斯坦、哈萨克斯坦、塔吉克斯坦等国外长会晤后，发表了上述评论。\n\n在联合国大会期间，华盛顿将在这一问题上谴责中共。有外交人士说，美国副国务卿苏利文将于24日主持一场有关“新疆人权危机”的活动。\n\n近年来，中共迫害维吾尔族的手段不断升级，除了进驻大批军警严密监控新疆地区，并用“再教育营”关押维族人之外，还将幼童集中起来实施洗脑教育，其行径被曝光后，引起国际挞伐。\n\n2018年11月，15个西方国家的驻华大使，联署致信新疆党委书记陈全国，要求他讲清楚侵犯新疆维吾尔人权利的情况，同时美国也正在考虑对陈全国和其他涉嫌践踏新疆人权的官员和公司实施制裁。\n\n当时美驻华使馆在一份声明中说，美国自2017年4月得知中共在多个“再教育营”里关押80万以上、甚至近200万维吾尔人的信息，且一直对此警觉。\n\n美国将继续呼吁中共结束类似的政策，并立即释放所有被任意拘押的人，美国政府将致力于对那些犯有侵犯人权罪行的人进行问责，包括针对那些新疆官员进行制裁。\n\n今年4月3日，包括43名美国参、众两院国会议员，联名致信美国政府呼吁制裁严重侵犯穆斯林人权的中共官员，包括主政新疆的陈全国。\n\n这些议员在信中指责中共政府和官员，合谋或指使了新疆不断发生的侵犯人权行为，这些行为可能构成反人类罪行。\n\n7月份，22个西方国家驻联合国大使联名致信联合国人权理事会，批评中国在新疆地区大规模拘押维吾尔族等少数民族。\n\n（记者李芸报导/责任编辑：李泉）"
		},
		{
			"post_id": 49,
			"title": "美参议院迅速通过《新疆人权法案》",
			"date_published": 1568453632.544,
			"body": "![1.jpg (0x0)](data/img/post_49_1.jpg)\n\n_这张照片拍摄于2019年6月2日，展示了新疆阿图克斯市一个戒备森严的再教育营的建筑物，那里被中共政府称为职业技能教育培训服务中心。_\n\n【新唐人北京时间2019年09月12日讯】美国国会复会前，多名议员呼吁优先表决《香港人权与民主法案》。复会第3天，在中共全力阻挠该法案之际，美国参议院却迅速通过了《新疆人权法案》。有分析指，后者直指新疆党官以致中南海，对中共的杀伤力比前者更大。\n\n* * *\n\n9月11日，美国国会及行政部门中国问题委员会主席、共和党参议员卢比奥（Marco Rubio）发表推文表示，参议院当晚通过了他与民主党参议员梅南德兹（Bob Menendez）共同发起的《维吾尔人权政策法案》，对于反制中共极权政府在新疆进行的广泛而骇人听闻的侵犯人权行为，这是重要的一步。\n\n```\n    Tonight, the Senate passed Senator Marco Rubio & @SenatorMenendez's Uyghur Human Rights\n    Policy Act, an important step in countering the totalitarian Chinese government’s \n    widespread and horrific human rights abuses in Xinjiang.\n\n    — Senator Rubio Press (@SenRubioPress) September 11, 2019\n```\n\n鲁比奥与梅南德兹发表一份联合声明指出，中共在新疆人权恶行包括关押超过100万名维族人和少数族群，威胁和恫吓美国境内的公民和合法永久居民等。\n\n鲁比奥在该声明中说，对于美国要求制裁中共政府与官员在新疆的人权迫害和可能的反人类罪行，这项法案来得太迟了。他敦促众议院尽快通过这项法案，然后送给总统签署生效。\n\n据美媒报导，该法案要求国务院就新疆问题设立新职，并要求多个政府部门提交有关中共在新疆或海外迫害维吾尔人的报告，其中包括新疆再教育营关押人数、是否存在强逼劳动、政府监控规模等，以及参与兴建和经营新疆集中营的中国公司清单。\n\n法案还敦促美国政府高层参与这项议题，并依据《全球马格尼茨基人权问责法》对中共官员问责并施加制裁。\n\n法案尚未直接对中共高层提出制裁，但一些网友认为，美国开始认真调查中共在新疆迫害人权情况，就足以让北京胆战心惊。还有评论人士认为，在中共全力阻挠《香港人权与民主法案》之际，参议院迅速通过《维吾尔人权政策法案》，达到了声东击西的效果。\n\n```\n    美国参议院今晚通过新疆人权法案，众院通过总统签署将毫无悬念。在中共全力动员潜伏力量阻止香港人权民主\n    法案时，参议院以闪电速度通过更具杀伤力的新疆人权法案，直接剑指中南海元凶。他们会感到惊恐，因为新疆\n    人权侵害属于反人类和种族灭绝罪行。深究下去下令镇压的元凶都难逃最严厉的制裁！\n\n    — baiqiao tang 唐柏桥 (@tangbaiqiao) September 12, 2019\n```\n\n美国国会9月9日复会。在此之前，包括参议院少数党领袖舒默（Chuck Schumer）在内的多名重磅议员接连发声，要求复会后优先表决《香港人权与民主法案》。与此同时，中共官媒指责该法案“干涉中国内政”，并威胁如果法案通过，中共将“全面报复”。\n\n（记者钟景明综合报导/责任编辑：明轩）"
		},
		{
			"post_id": 48,
			"title": "伊力哈木角逐年度“哈维尔人权奖”，中共要求欧委收回提名",
			"date_published": 1567171657.168,
			"body": "【西藏之声2019年8月30日报道】遭中共当局以“涉嫌分裂国家”罪判处无期徒刑的维吾尔学者伊力哈木•土赫提，近日被欧洲人权机构欧洲理事会提名角逐“2019哈维尔人权奖”。中共当局作出回应，要求欧洲理事会收回伊力哈木的提名，停止支持分裂和暴恐势力。\n\n---\n\n欧洲理事会（The European Council）提名维吾尔学者伊力哈木•土赫提（Ilham Tohti），角逐“2019哈维尔人权奖”（Vaclav Havel Prize for Human Rights）。\n\n据“非联合国会员国家及民族组织”（UNPO）近日发布的消息，在布拉格召开的欧洲理事会议员大会于本月26日发表声明指出，伊力哈木“二十多年来一直致力于改善维吾尔人的处境，促进不同民族之间的对话和理解”。\n\n伊力哈木是“2019哈维尔人权奖”三位被提名人之一，另两位是塔吉克斯坦人权律师布泽梅尔•约洛夫（Buzurgmehr Yorov）和一个在巴尔干地区推动战后和解的青年组织。得奖人姓名将于9月30日在欧洲理事会的总部斯特拉斯堡公布，获奖者将得到6万欧元的奖金。\n\n除了哈维尔人权奖，伊力哈木今年1月获美国国会议员提名角逐诺贝尔和平奖。\n\n**中共谴责欧委会支持恐怖主义者**\n\n中共外交部发言人耿爽于昨天（29日）在例行记者会上表示，这位49岁的经济学教授是“支持极端暴恐活动的分裂分子”。\n\n此外，中方声称有关机构粉饰伊力哈木的犯罪行为，并欺骗人权界。因此他们要求欧洲理事会收回提名，停止支持分裂和暴恐势力。\n\n伊力哈木于2006年创立“维吾尔在线”（Uighurbiz）网站，目的是以便向各方提供讨论的平台来化解民族矛盾，但他在2014年1月遭中共当局拘捕。而后，中共当局罔顾联合国等机构对此作出“任意拘押”的鉴定，仅经过两次庭审就在同年9月，以“分裂国家”罪名将其判处无期徒刑。\n\n**哈维尔人权奖背景**\n\n“哈维尔人权奖”是于2013年由欧洲理事会议员大会、捷克哈维尔图书馆（Vaclav Havel Library），以及七七宪章基金会（Charta 77 Foundation）共同设立。该奖项每年颁发一次，奖金六万欧元，旨在表扬卓越的捍卫人权公民行动。\n\n瓦茨拉夫•哈维尔(1936－2011)是捷克作家、思想家，在推动捷克自由民主化方面贡献卓著。1993年他当选捷克共和国总统，并且于1998年连任，2003年卸任。"
		},
		{
			"post_id": 47,
			"title": "罕见获许参访新疆“再教育营” 他发现令人吃惊的细节",
			"date_published": 1561026191.254,
			"body": "![1.jpg (0x0)](data/img/post_47_1.jpg)\n\n新疆“思想转化营”中的学员，眼圈处明显有被殴打过的痕迹（视频截图）\n\n```\n日前，英国《BBC》罕见获得许可，进入中共新疆“再教育营”进行实地访问。中共当局试图借此澄清，这些\n设施是“培训学校”而非“集中营”或“监狱”。但BBC记者表示，随着越是独立深入的访问、探查，越是觉\n得事情不对劲，所得到的疑问亦远比答案多。\n```\n\n【希望之声2019年6月19日】（本台记者蕭晴综合报导）日前，英国《BBC》罕见获得许可，进入中共新疆“再教育营”进行实地访问。中共当局试图借此澄清，这些设施是“培训学校”而非“集中营”或“监狱”。但BBC记者表示，随着越是独立深入的访问、探查，越是觉得事情不对劲，所得到的疑问亦远比答案多。\n\nBBC记者沙雷（John Sudworth）近日获许进入中国西部新疆地区的多个戒备森严的设施。中共当局一直坚称这些设施是“培训学校”，而非外界所指的“再教育集中营”或洗脑基地。\n\n沙雷表示，在这个横跨整个新疆的庞大网络中，羁押着数以十万计的维族人和哈萨克人，但在他采访期间，这些人却出奇地“被消失了”。\n\n---\n\n**亲临新疆“培训学校”专访 引发更多质疑**\n\n在BBC于6月19日的采访视频中，我们可留意到如下几个片段：\n\n记者询问：“你被判有罪吗？”学员回应：“我没有犯罪，我就是犯了错。”\n\n记者询问：“你在这多久可以礼拜一次？”学员用生硬的套话回应：“国家（中共）法律规定，学校是公共场所，不能从事宗教活动。”\n\n随后，记者被引入一间教室，里面被关押的穆斯林正“载歌载舞”。记者询问：“是你自己选择过来的吗？”该男学员虽然回应“就是”，但视频中明显可见，他的右眼眶附近有被殴打过的瘀痕。\n\n在BBC访问“培训学校”的全程中，中共政府官员一直在记者背后，监视其每一次采访。但尽管如此，记者还是在洗漱间的隐蔽处发现了一些涂鸦，上面写道“我心碎欲裂”等。\n\n此外，当局宣称这些学员需要接受“职业技能培训”，而培训的内容却只有“铺床叠被、打扫卫生”，更匪夷所思的是，这样简单的动作竟需要“培训”长达2-4个月。\n\n当局还宣称，这些学员“每人每周都可以（轮流）回家一晚”。但当BBC记者当晚准时（当局规定的离校回家时间）站在“培训学校”大楼外等待离校学员时，却不见一人回家。\n\n记者向当局相关人员提出质疑：“为什么我们没有看到任何学生离开，甚至准备离开？”得到的回复却是，“有的天有回家的，有的（天）没有回家的”。但此前记者曾被明确告知，“每天都有人回家”。\n\nBBC记者说，在这些“培训学校”中，中共具体实施“转化思想”的方式包括：长时间死记硬背汉语；学习中共日益收紧的宗教法律法规；用效忠共产党的口号，改变穆斯林原来的宗教信仰和文化等。\n\n此外，记者还发现，学员们在每晚天黑后很久，仍在读著那些中共用来“转化思想”的教材……\n\n**外媒实地采访前 中共对“再教育营”做了改建**\n\n视频中通过卫星照片的对比，BBC记者发现，他们被安排参观的场地，在此前不久被改建过。\n\n此前的营区在新疆多地被兴建，它们通常被高墙环绕，墙外有铁丝网和瞭望塔。但在BBC记者允许参观的营区，卫星图片显示，内部的安全网及似瞭望塔结构的物体，在不久前被移除；而此前空旷的操场，也被改为各种球类运动场地，并在记者访问期间被安排使用，以此营造所谓“和谐”气氛。\n\n![2.jpg (0x0)](data/img/post_47_2.jpg)\n\n空旷的操场在BBC记者访问前不久，被改建为各种球类运动场（视频截图/希望之声合成）\n\n记者质疑，他被当局安排访问的营区，是被用来“展示”的营区；而隔壁仍高墙矗立、墙外可见铁丝网和瞭望塔的处所，才是中共对穆斯林进行暴力洗脑的罪恶场所，然而，记者在刚要靠近时，就被勒令禁止入内。沙雷说，这些地方“看上去更不像学校”。\n\n**“歌舞升平”的背后**\n\n随后，BBC记者对现居哈萨克斯坦的Rakhima Senbay进行了一次专访。\n\nRakhima Senbay女士曾被中共关押在新疆“再教育营”一年多时间，她被关押的理由，只是因其手机里安装了Whatsapp聊天软件。\n\n她告诉BBC，只有在她将要被放出的时候，才“有幸”被关到上述用于“展示”的营地（即BBC记者参访的“培训学校”），而其它更多的时间里，那些维族和哈萨克族穆斯林人，则都被关押在更加严厉且环境恶劣的集中营里。\n\nRakhima Senbay还透露：“我被戴上脚链超过一周，我们被殴打过几次；有一次，我被电棍击打。”\n\n而上述BBC记者参访时看到的情景，比如，“开心的”穆斯林、“努力地”学习汉语，甚至在唱歌、跳舞等，Rakhima Senbay回应说：“我在营地里亲身经历过，他们（当局）在外人访问前警告我们，如果你们说出来，你们会被送到一个更差的地方。所以每个人都很害怕，（不得不）按照他们说的去做，包括唱歌和跳舞。”\n\n记者沙雷也认为，中共所有让他看到的场景，只不过“是它（中共）想让世界看到的……，以此来证明这些人并非‘囚犯’，而是‘学员’”，并自愿接受当局的所谓“再教育”。\n\n沙雷表示，当他们独立收集到的证据越多，所产生的疑问也就越多……\n\n责任编辑：元明清"
		},
		{
			"post_id": 46,
			"title": "联合国人权高级专员正与中方讨论 “全面接触式访问”新疆问题",
			"date_published": 1561025143.33,
			"body": "联合国人权事务高级专员办公室证实，联合国人权事务高级专员巴切莱特收到了访问中国新疆维吾尔自治区的邀请，正在与中国政府讨论“全面接触式访问”的问题。\n\n---\n\n中国常驻联合国日内瓦办事处代表陈旭大使6月13日在一个记者会上邀请联合国人权主管巴切莱特访问新疆，并表示对她的邀请始终有效，希望在一个“双方都合适”的时间成行。陈旭同时否认外界对“再教育营”的说法，称这些“培训中心”是帮助年轻人获取技能，帮助他们更好地融入社会。他表示，希望巴切莱特女士能来“亲眼看看这里没有所谓的再教育营”。\n\n联合国人权事务高级专员办公室周五在给自由亚洲电台的邮件中表示，联合国人权事务高级专员巴切莱特本周与陈旭大使会了面。\n\n人权事务高级专员办公室发言人玛塔·胡塔多说:“高级专员已被邀请访问中国，我们正在继续与中国政府讨论全面接触式访问的问题。”\n\n曾任智利总统的巴切莱特去年8月就任联合国人权事务高级专员，曾努力推动中国允许联合国人员进入新疆，对有关中国当局大规模监禁新疆穆斯林的报告进行调查。中国方面此前表示，欢迎联合国官员访问新疆，前提是要避免“干涉中国内政”。如果巴切莱特接受了邀请，她将成为访问新疆的联合国最高级别官员。\n\n与此同时，联合国反恐怖主义办公室副秘书长弗拉基米尔・伊凡诺维奇・沃龙科夫正在中国进行访问，此前有报道说沃龙科夫可能会访问新疆。人权团体批评说，联合国派遣一个负责反恐事务的官员而不是人权事务官员访问中国会“落入中国官方说法的圈套”。\n\n位于纽约的人权组织“人权观察”的联合国事务部主任路易斯・夏邦努发表声明说：”派遣联合国反恐首长访问新疆，可能为中国的虚假说法背书，即当地存在的是反恐议题，而非政府大规模侵犯突厥裔穆斯林居民的人权。联合国秘书长不应派出反恐官员，而应要呼吁立即关闭拘押高达一百万穆斯林的‘政治教育’营区，停止普遍压迫基本权利。他也应该确保高级专员和其他人权专家可以不受干预前往新疆，查证当地人权侵犯的范围与规模。”\n\n中国政府此前曾邀请外国媒体记者和俄罗斯、印度尼西亚、哈萨克斯坦等国的外交人员对新疆进行参观访问。但批评人士表示，这些访问都是在中国政府的严密监控下、按照中方事先安排好的路线进行的，访问者并不能真实了解新疆的现状。\n\n人权组织对陈旭邀请巴切莱特访问新疆的动机也表示了怀疑。他们说，这是中国试图在联合国人权理事会下星期就要召开会议之前抵挡国际社会的批评。\n\n来源： VOA  【维吾尔之声 uyghurpress.com】\n\n2019年6月18日"
		},
		{
			"post_id": 45,
			"title": "新疆斋月逾百维吾尔人被捕 伊犁五百名女工失联",
			"date_published": 1557909540.795,
			"body": "当前是全世界伊斯兰教的斋月，穆斯林已进入为期一个月的封斋期。总部在德国的世界维吾尔人代表大会对本台披露，在新疆和田地区，当局为阻止穆斯林封斋，并抓捕了所谓对维稳政策有抵触情绪的维吾尔族共137人。该组织发言人迪里夏提本周一（13日）告诉本台：“和田地区，中国政府在斋月以有‘抵触情绪’为罪名，拘押了137名维吾尔人，当中42人是妇女，95名男士，其中30人因为封斋，遭当局指控涉嫌参与非法宗教活动，目前关押在和田地区公安局，其余的人被关入再教育集中营。”\n\n---\n\n本台记者就此致电和田地区公安局，但始终无人接听。\n\n世维会发言人迪里夏提还说，新疆南部地区政府为了检查维吾尔族人是否封斋， 近期主办了名为“我与亲戚游和田”的活动，强迫上千名维吾尔人参加各种形式的午餐联谊会，还要与汉人一起进餐。还明文规定在外省学校就读的穆斯林学生，一周内至少有三天到学校食堂报到进餐。迪里夏提说，非常担心有更多的人因封斋被捕：“我担心有更多的人可能因为斋月封斋而被关进集中营，而维吾尔人在斋月受到新一轮的限制和系统性的迫害，应该广泛地引起国际社会的关注。”\n\n按照伊斯兰教《古兰经》教义规定，穆斯林不得吃猪肉、喝酒，斋月期间，每天日出后到日落期间，停止饮食。在伊犁州等北部地区，哈萨克族穆斯林被要求签署保证书，承诺斋月期间不封斋。\n\n伊犁一位哈萨克族人说，当地一工厂内有五百多名妇女失踪，剩下三百多名男性在做苦力：“肯定是（不能封斋），有个工厂，五百多名女性失踪了，有三百多个男性在干苦工，为什么不来拯救我们。”\n\n所谓苦工是当地少数民族被当局从再教育营转移到改建的工厂，被强迫从事廉价劳动的工人。他们每天被迫劳动十个小时以上，下班后还要从事官方指定的“政治学习”。一位居住在哈萨克斯坦的哈萨克人海拉提对本台说：在新疆：“最近有500多个女的和300多个男的，16岁到25岁之间。300个男的做黑工（强制工作），500个女的失踪了，现在被火车拉走了，往哪个方向去不知道。现在新疆少数民族中16岁到25岁的孩子，年轻人失踪的最多。”\n\n海拉提说，一个多月前，在伊犁塔城乌苏市，有二十多名不足25岁的哈萨克族年轻人被送往其他省份，目前下落不明：“伊犁哈萨克自治州塔城地区乌苏市，20多个哈萨克人现在在哪里，都不知道。” 本台今年一月下旬曾报道，新疆伊犁一批哈萨克族人，今年初被当地政府转往江西南昌，受聘于中国航天集团旗下一军方企业，他们在下班后被要求学习汉语，甚至被要求加入中国共产党。\n\n**向境外披露维人现况其家人会被秋后算帐**\n\n一位穆斯林对本台说，他们不敢对外界披露发生在新疆的很多残酷事件，否则整个家族成员都会遭到报复：“我们当地的政府人员说，不能泄露这些秘密，如果你泄露了，你的安全，你家人的安全。一家有10口人，九个兄弟姐妹都在中国，他们9个人的生命谁来担保。”\n\n美国国防部负责亚太印度洋事务的助理部长薛瑞福 (Randall Schriver) 日前表示，根据他们对关押规模的了解，至少有一百万人，甚至可能接近三百万人被强制拘押。\n\n来源：RFA  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 44,
			"title": "德人权委员会担忧新疆局势和中国宗教群体处境",
			"date_published": 1557909218.57,
			"body": "5月8日，德国议会人权委员会邀请多位人权问题以及中国问题专家，在联邦议院举行了听证会。其讨论重点是目前令人担忧的新疆局势以及中国宗教少数群体的处境。\n\n（德国之声中文网）中国政府针对新疆维吾尔人等穆斯林少数民族、信奉藏传佛教的藏人以及该国基督教徒的行动是试图”让宗教从人们的日常生活中消失、降低宗教的吸引力”，德国”受威胁民族协会”（GfbV）主席、中国问题专家德里乌斯（Ulrich Delius）在联邦议院的听证会上说。他表示，中国领导层试图瓦解一切在其掌控之外的事物。\n\n---\n\n新疆再教育营的官方名称为”职业技能教育培训中心”。在过去两年，这些营地明显增加，对穆斯林少数民族进行严格监控。中国政府在今年3月发布的《新疆的反恐、去极端化斗争与人权保障》白皮书中，将再教育营称之为有效的预防性反恐措施。但这种大规模的拘禁引发公民社会活动人士以及一些外国政府、国际组织的强烈批评。\n\n在柏林人权委员会的听证会上，世维会主席多里坤·艾沙(Dolkun Isa) 讲述了新疆再教育营的情况。他表示，过去两年间有数百万人曾经或仍在面临再教育营的拘禁，其中主要是维吾尔人。他说，被关押者完全无法通过法律方式维权，也无法与外界取得联系。当局这样做的目的是要将被关押者”彻底同化”，强迫其表明对中国领导层的忠诚。\n\n**“将自定义的国家利益凌驾于法律之上”**\n\n同样与会的”人权观察”组织德国部主任米切尔斯基（Wenzel Michalski），谈到了新疆在数字化技术支持下的大规模监控问题。该组织在不久前公布了一款中国警方所使用的、让当局在新疆收集到大量信息的移动应用程序（APP）。\n\n米切尔斯基说，凭借这个APP，如果有人的智能手机时常处于关闭状态、给不是自己的车加油或者从他家的后门进屋，警方就会受到通报，这个人就会被看作是可疑的。\n\n墨卡托中国研究中心(MERICS)的负责人彭轲（Frank N. Pieke）强调，在没有检方起诉的情况下将人关入再教育营，中国当局的这种做法不仅违背基本人权，也违背了中国本国的法律基本原则。他表示，中共领导层在新疆以反恐和打击分裂为理由的做法，是将自己定义的国家利益凌驾于法律之上。\n\n**“汉化”战略**\n\n前达赖喇嘛驻欧洲特使格桑坚赞（Kelsang Gyaltsen）对西藏的未来也表示担忧，称在达赖喇嘛离世以后，年轻一代藏人可能会诉诸暴力手段。\n\n达赖喇嘛此前曾警告称，藏人不会接受中国政府指定的转世灵童。格桑坚赞在周三的听证会上也表示，北京不顾藏人传统而自己选择达赖喇嘛的继承人，显示了中国无视并且侵害宗教权利，显示了北京希望用自己官方控制的一套来代替西藏原本的文化与传统。\n\n图宾根大学中国中心主任、德国知名汉学家施寒微（Helwig Schmidt-Glintzer）也在会上提及中共针对宗教团体的严厉政策。不过他同时强调，要在历史背景下看待这一发展，称中国在历史上曾经多次感到受到外部世界威胁，例如，苏联在与中国交恶后曾试图将维吾尔人工具化以反对北京。\n\n施寒微表示，中国政府目前正在追求”汉化”的国家战略。现在应该做的是，与中国国内”能从不同角度看待这一问题”的力量进行对话。\n\n来源：德国之声  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 43,
			"title": "中共搞政治秀 联合国官员再要求赴新疆调查",
			"date_published": 1552187217.868,
			"body": "【大纪元2019年03月07日讯】（大纪元记者李新安采访报导）3月6日，联合国人权事务主任米歇尔·巴切莱特（Michelle Bachelet）再次向中共当局提出赴新疆了解“再教育营”情况的要求。预计中共代表团将在本周晚些时候作出回应。\n\n路透社报导，巴切莱特周三（3月6日）表示，她正在寻求进入中国，特别是新疆地区，以核实持续不断的、有关失踪和任意拘留的报导。\n\n---\n\n巴切莱特在向联合国人权理事会提交的年度报告中表示，新疆做为中共“一带一路”计划的中心，其稳定性可以通过当局实施尊重权利的政策来得到促进。\n\n去年12月初，巴切莱特就希望能够亲自前往新疆调查。她在日内瓦的新闻发布会上说，“我们一直要求直接进入该地区，以便能够检查和核实我们收到的令人担忧的报告。”\n\n而中共外交部发言人陆慷曾在今年1月记者会上称，联合国官员应当“避免干涉中国内部事务”。\n\n此外，联合国宗教自由调查员艾哈迈德·沙希德（Ahmed Shaheed）周二（3月5日）表示，他已在2月份提出访问新疆的要求，但中共当局尚未回复。\n\n此前，德国人权专员柯夫勒（Barbel Kofler）访问新疆的要求也被拒绝。\n\n值得注意的是，中共一方面拒绝联合国官员和宗教自由专家的访问，另一方面却在受到国际压力后，近期密集邀请多国驻华使节访问新疆，向他们宣传在新疆打击恐怖主义。\n\n去年年底以来的2个月内，中共邀请了至少4批访疆团，包括巴基斯坦、委内瑞拉、古巴、埃及、柬埔寨、俄罗斯、塞内加尔、白俄罗斯等国家常驻日内瓦的代表和主要外交官。\n\n**中共安排政治秀 缓冲国际谴责**\n\n世界维吾尔代表大会发言人迪里夏提在接受大纪元采访时表示，中共政府始终拒绝西方民主国家前往当地的合理要求。相反的，中共利用欺骗和谎言的手段邀请那些人权记录差、专制极端的国家的外交官员，前往当地观看中共特意安排的一些政治表演。中共希望通过这些专制国家的言论，来欺骗国际社会，掩盖中共政府在当地建立“再教育集中营”的真实目的。\n\n他表示，目前中共通过人力、财力，以及外交资源，动用了所有的国家资源来掩盖当地的真相，其目的就是缓冲国际压力。同时，中共还刻意安排了一些特定的国家媒体到当地进行所谓的采访，这一系列都是想通过外交、舆论、境外的一些媒体，美化“再教育集中营”。\n\n他说，中共政府采取各种措施，限制西方媒体前往当地不受阻碍地进行采访。中共也拒绝向西方国家提供更加透明的有关“再教育营”的相关信息。\n\n他介绍，在两会前，中共以所谓的“维稳”，加强了针对维吾尔人的清查，而且这种清查是不分昼夜的，随时抽查。所有的维吾尔人，被中共认为是潜在的危险和敌对势力。现在中共在北京开两会，成了新一轮镇压和监控、打击维吾尔人的政治借口。\n\n“进入2019年以后，中共对这种迫害更新了名称，说是建立再教育集中营是为了反恐，打击极端，”他说，“中共的这种宣传，暴露了中共的政治动机，中共又说是反恐、反对极端宗教，将他们关进去了，但是对外又宣传说把这些人关进去是进行职业培训。”\n\n迪里夏提说，新疆是典型的一个在中共系统迫害下的人权危机的一个区域，任何人随时随地可能因为一个不满的情绪失去人身自由，这就是现在维吾尔人所面临的处境。\n\n他表示，“令人担忧的是，中共肯定会提前安排、布置好特意的政治场所。但是，如果中国能允许联合国的机构进入到当地，至少对中共来说是个外交上的压力。”\n\n“我们期待着中共政府在国际社会的压力下，能容许联合国前往当地进行独立的调查。”他说，“我们期待国际社会采取积极措施，要求中共关闭再教育集中营，释放所有被非法关押者。”\n\n**中共不断欺骗国际社会**\n\n纽约大学访问学者、中国人权律师滕彪在接受大纪元采访时表示，中共当局让国外的官员访问新疆，是继续欺骗国际社会的手段而已。之前，比如国外的一些学者、专家、政府官员要参观监狱、劳教所，中共就会盖起那些样板监狱、模范监狱，里面各种设施都很好，这些参观的人看不到真相。所以在新疆集中营也是一样，看到的一切都是被安排好的。\n\n“他们不可能自由地去参观、采访，那些他们遇到的人，包括被关押的维吾尔人、再教育集中营的工作人员，都是提前做好演练的，能够说什么话，不能说什么话。”他说，“要避免真相被外人知道。都是找那些特别可靠的人，才能够有机会对参观者说话。这个是可以想像得到的。”\n\n滕彪说，新疆集中营的情况因被国际社会不断曝光和严重关注，中共政府从一开始是否认、抵赖，到后来说是教育中心职业培训。但是有大量的证据能够证明中共是在撒谎，也有很多人抱怨在新疆没有办法进行调查和采访。所以中共就用了这样一个办法，这也是中共一贯的欺骗手段。\n\n**律师：新疆再教育营是大规模的法外监狱**\n\n滕彪表示，国际社会一直对中共进行谴责，呼吁关闭所有的再教育集中营。但是中共有它的政治目的；另外，中共本来也没有任何的法制体系，没有建立起来司法独立和尊重宪法、法律的传统，以及受到国际社会的强烈谴责，它仍然置之不理。\n\n他表示，新疆的再教育集中营是大规模的法外监狱。在目前的中共体制下，除了一些法律规定的羁押场所，像看守所、拘留所，还有很多没有经过任何司法程序的羁押场所，叫非司法羁押。包括之前废除的收容遣送、劳教，主要关押法轮功学员的法制教育中心，还有更多的黑监狱。\n\n迪里夏提说，现在维吾尔人居住的地区成了中共摧残人权的实验场地，其经验很有可能会推广到中国大陆各地，甚至可能输出到周边国家。\n\n责任编辑：李穹"
		},
		{
			"post_id": 42,
			"title": "人权组织齐聚日内瓦 吁联合国对新疆展开调查",
			"date_published": 1549627703.521,
			"body": "2019年2月7日\n\n来自数个人权组织的代表昨日齐聚日内瓦，公开要求欧洲及其他穆斯林国家带头在联合国内部成立一个调查小组，并对中国在新疆大规模关押少数民族穆斯林的行为进行调查。\n\n---\n\n数个人权组织代表周一齐聚日内瓦，要求联合国人权理事会成员国组成调查小组，针对中国对新疆少数民族穆斯林的迫害展开调查。\n\n(德国之声中文网) 人权组织将中国在新疆关押将近百万少数民族穆斯林的现象称作强迫性的教化。 而中国在国际社会持续施压数月后，上个月表示愿意在确保外界不干涉国内政治的前提下，邀请联合国官员参访新疆。\n\n来自人权观察 (Human Rights Watch) 及国际特赦组织 (Amnesty International) 的代表要求联合国人权理事会派遣一个国际调查小组到新疆采证。 人权观察的执行董事罗斯 (Kenneth Roth) 在日内瓦记者协会的记者会上表示: “中国政府在新疆进行的打压已经严重到了国际社会必须发声援助的地步。 ”\n\n他认为中国政府在新疆大规模关押少数民族穆斯林是为了消除他们的民族与宗教认同，并确保他们只效忠于中国政府、中国共产党以及习近平。 然而，中国政府已多次反驳外界的批评。 北京在上个月邀请一小群外国媒体以及来自12个非西方国家的外交官，参访三个再教育营。 根据路透社报导，在营内的穆斯林学员透过中文来了解伊斯兰思想的危险之处。\n\n开放的监狱\n\n人权组织称，至少百万名少数民族穆斯林被关押在再教育营内，并强调，这些穆斯林往往缺乏法律保证且时常被虐待。 国际特赦组织的秘书长奈杜 (Kumi Naidoo) 在日内瓦的记者会上表示: “新疆已成为一个开放监狱。 中国政府透过高科技监视、政治教化、强迫性的文化同化及逮捕来迫使这些少数民族穆斯林在他们自己的故乡成为陌生人。 ”\n\n他们呼吁联合国人权理事会成员国不要因为中国的政治或经济影响就容忍中国迫害少数民族人权。\n\n他呼吁联合国成员国不要因中国的政治与经济影响，而选择容忍中国的这些作为。 此前，中国不断强调他们保障少数民族的文化及宗教信仰，并表示在新疆推展的安全措施是为了防止特定组织在当地煽动仇恨。 中国是联合国人权理事会的其中一个成员国，而他们过去一年时常带头阻止该理事会针对特定国家的人权迫害案例展开调查。\n\n由多个伊斯兰国家组成的伊斯兰合作组织 (the Organization of Islamic Cooperation) 去年九月曾与欧盟合作，针对缅甸政府迫害罗兴亚人的事件准备证据，以便日后能对缅甸政府提出告诉。 人权观察的罗斯认为，世界各国应该针对中国迫害少数民族穆斯林的情形展开类似的行动。 人权国际服务中心 (the International Service for Human Rights) 的伊奈岑 (Michael Ineichen) 则说: “现在这个时刻联合国人权理事会如何决策将会是对其信誉的一个考验。 我认为成员国应该开始更仔细思考每个决策。 ”\n\n来源：   德国之声  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 41,
			"title": "联合国：以行动终结中国新疆大规模拘押",
			"date_published": 1549455881.691,
			"body": "**成立国际实况调查团是解决人权危机关键**\n\n（日内瓦）－众多非政府组织在今天发布的致联合国共同声明中指出，联合国人权理事会应通过决议，成立国际实况调查任务团，调查中国新疆地区高达一百万突厥语系穆斯林被任意拘押问题。\n\n---\n\n人权理事会下次会议将于2019年2月25日至3月22日召开，届时该理事会将审议2018年11月中国普遍定期审议的结果报告，中国官员在参加审议时否认新疆发生大规模人权侵犯。\n\n“新疆据称发生暴行的规模之大，亟需人权理事会彻底调查，”人权观察执行长肯尼思・罗斯（Kenneth Roth）说。“人权理事会的信誉，端赖各国不许中国利用成员身份或经济力量逃避问责。”\n\n中国当局将其认为不忠于党和政府的维吾尔人和其他突厥语系穆斯林关进“政治教育”营区，不经任何法律程序。在这些营区里面，在押人员被迫接受政治思想灌输、宣布放弃原本信仰，并且遭到不当对待，有时包括酷刑。联合国的许多专家、条约机构和人权高专都曾对新疆情势表达关切，呼吁开放该地区自由进出。\n\n中国迄未正面回覆前述要求。12月到1月，中国政府安排了一些记者和外交官访问他们口中的“职业技能教育培训中心”。中国国营媒体在这几次访问结束后报导说，访客们认为环境“优良”、在押人员“状态很好。”\n\n“一年来，中国有多次机会回应有关新疆骇人情势的严肃质疑，却一再给出荒唐无理的说法，”国际特赦组织秘书长库米・奈都（Kumi Naidoo）说。“中国应当认识到，唯有国际实况调查团才能查明真相、排除编造，做成公正纪录。”\n\n此次提出的决议案，主旨在要求人权高专派出实况调查团评估当地情势，在人权理事会下次会议提交报告。决议内容应肯定中国先前表示允许国际专家前往访问的意愿，但应强调相关访问必须独立自主、不受限制且不受监督；同时应提醒中国，做为人权理事会成员之一，负有“维护人权最高标准”以及“与人权理事会充分合作”等义务。\n\n这份共同声明由国际特赦组织、人权观察、国际人权服务社和世界维吾尔大会联名发布，并获众多区域性及全球性组织支持。\n\n“中国人权的恶化是一个长期问题，但现已来到关键节点。世上任何国家若任意拘押上百万国民，都不能被纵容，”国际人权服务社执行长菲利普・林区（Philip Lynch）说。“通过这项成立实况调查团的决议，是所有认真看待促进人权义务的人权理事会成员国最起码应做到的事。”\n\n“维吾尔人和其他穆斯林承受中国当局高压统治已经够久了，”世界维吾尔大会主席多里坤・艾沙（Dolkun Isa）说。“我们期待人权理事会采取行动，厘清真相。”​\n\n来源：   人权观察  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 40,
			"title": "人权观察等组织呼吁联合国就新疆大规模拘押成立调查组",
			"date_published": 1549338621.599,
			"body": "包括国际特赦，人权观察，国际人权服务等组织在内十多个国际人权组织周一呼吁联合国成立专门调查组就中国当局在新疆大规模任意拘押维族等少数民族居民的行为展开调查。"
		},
		{
			"post_id": 39,
			"title": "13美国议员提名伊力哈木角逐诺贝尔和平奖",
			"date_published": 1549114436.56,
			"body": "美国13名议员致信挪威诺贝尔奖委员会主席，提议将2019年度诺贝尔和平奖授予在狱中的维族学者伊力哈木。在当前新疆逾百万维吾尔人被关入「集中营」局势下，更需要伊力哈木这样的和平声音。伊力哈木的女儿也认为如果获奖，不但可以改善父亲的处境，更能帮助整个维吾尔社区。（吴亦桐 / 覃晓言 报道）\n\n---\n\n美国参众两院13名议员周二（29日）致挪威诺贝尔委员会主席贝丽特‧赖斯‧安德森（Berit Reiss-Andersen），提议将2019年度的诺贝尔和平奖颁发给目前系狱的维吾尔族学者伊力哈木‧土赫提（Ilham Tohti）。\n\n13名议员中，包括持续批评中共对新疆政策的共和党参议员鲁比奥。\n\n议员指提名伊力哈木，是表彰他致力于维吾尔族与汉族的族群间和平对话。信中还回顾了伊力哈木的价值主张、中共对他迫害过程。他们还指出在当前新疆的局势下，比以往任何时候都需要像伊力哈木这样的和平声音。\n\n目前在美国留学的伊力哈木的女儿菊尔向本台表示，去年也有人权活动人士、教授等提名伊力哈木并顺利入围诺贝尔奖名单。她相信这次13位议员的提名信更具说服力。她认为这个提名不仅是为自己的父亲，而是将让世人更关切维吾尔人的处境。\n\n菊尔说︰他们也说我父亲是这个奖项的绝佳人选，我也是非常认同。当然也有其他人像我父亲一样为人权付出很多代价，他们当然也非常胜任这个奖。但是我觉得我父亲一直以来不只是为维吾尔族，还对各少数民族的人权、自由问题发声，他为此付出的代价就是无期徒刑。要是读过他的文章就会发现他一直都是倡导和平。他提名这个奖或是将来他获得这个奖，我都觉得他是实至名归的。不只是对我父亲有帮助，当然对整个维吾尔社会都是一个很大的影响。\n\n菊尔也向本台透露，她和家人近几年都无法获知父亲在狱中的任何消息，因此非常担心父亲的安危。\n\n菊尔说︰现在他的情况是怎样我们也不知道，我们都非常担心，毕竟几年都没法探望他。我们现在都是靠听传闻「知道」他的消息，现在很忐忑。\n\n旅美法学学者滕彪指出，2014年伊力哈木被判刑后，他曾在英国《卫报》发表文章《伊力哈木应获得诺贝尔和平奖而不是终身监禁》。滕彪认为伊力哈木倡导的和平主张更能凸显中共的国家恐怖主义。\n\n滕彪说︰新疆现在有100多万甚至200万维吾尔人被关到「集中营」，在这种情况下，伊力哈木的价值就更加凸显出来，中共在制造仇恨、分裂，用国家恐怖的方式在新疆实施高压统治。伊力哈木强调的是人权、自由、民族之间的和平理解。诺贝尔和平奖（如）授予伊力哈木有非常重要的意义。\n\n北京维权人士胡佳认为伊力哈木完全可以像达赖喇嘛一样成为本民族的精神引领者。\n\n胡佳说︰维吾尔族这个民族一直缺少像藏人的达赖喇嘛那样的在精神、品格上的引领者。伊力哈木从学识到品格、再到和平的主张既符合在他们民族中的这样一个角色，也符合诺贝尔和平奖本身的要义。\n\n现年50岁的伊力哈木曾是中央民族大学教授，于2006年创办了「维吾尔在线」网站，因多次公开批评中国对新疆的高压政策而遭到当局长期监控。\n\n2014年1月伊力哈木遭抄家和拘留；同年9月，被乌鲁木齐法院以「分裂国家罪」判处无期徒刑，目前关押在新疆第一监狱，期间传出酷刑消息。2016年10月，伊力哈木被授予马丁‧恩纳尔斯人权捍卫者奖。\n\n来源：   RFA  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 38,
			"title": "美参院重提维吾尔人权法案关切“集中营”状况",
			"date_published": 1547980689.961,
			"body": "【西藏之声2019年1月19日报道】近日，美国参议院重新提出反制中国当局打压维吾尔人人权的一项议案。一旦通过，美国将依照《马格尼茨基人权问责法》，对涉及迫害维吾尔人的中共官员，实施经济与旅行制裁。\n\n---\n\n近年来，中共对“新疆自治区”内维吾尔等穆斯林民众所进行的压迫，逐渐被外界所知，受到国际关注。尤其是当局在新疆各地设立“再教育营”、据押上百万穆斯林、强迫灌输中共意识形态的行为，更引发西方民主国家为主的谴责声浪。\n\n《华盛顿邮报》（The Washington Post）本月18日发布消息指出，美国参议院于1月17日，重新提出了反制中国当局打压维吾尔人人权的一项议案。相似的议案已在去年11月份提出，但是由于国会假期休会而耽搁了审议。\n\n报道指出，该法案将会影响国务院和情报机构在面对维吾尔集中营事件之上的立场。\n\n这份提案要求调查在美维吾尔人受中共安全部门胁迫的情况，同时重新呼吁依照《马格尼茨基人权问责法》，对那些涉及迫害维吾尔人的中共官员，实施经济与旅行方面的制裁。\n\n除此之外，该议案还要求国务卿定期提交有关新疆“再教育营”状况的报告。"
		},
		{
			"post_id": 37,
			"title": "美国公司为避新疆“再教育营”制造 中断合作",
			"date_published": 1547655002.962,
			"body": "![8.jpg (0x0)](data/img/post_37_8.jpg)\n\n新疆当局组织参观喀什市职业培训中心缝纫班2019年1月4日喀什\n\n美国一家服装公司为了避开新疆“再教育营”制造，中断与中方供应商的合作。这家美企的决定受到共产政权的抨击。法新社发自北京的报道说，新疆“再教育营”拘押着大量维吾尔人。\n\n位于北卡罗莱纳州的贝德吉（Badger Sportswear）体育服装公司周三晚间发布声明表示停止从新疆和田泰达服装公司进货。该公司说，在严重担忧的背景下，为排除一切对我们产品进货途径的争议和怀疑，我们决定不再接受任何来自新疆和田及中国西北地区的供货。\n\n---\n\n法新社这个报道说，突厥语系穆斯林维吾尔人是新疆的主要族群。近些年，新疆族群间紧张暴力升级，经常引发流血冲突，受到当局的严密监视。专家和捍卫人权组织指控，该地区或有100万维族人被关入“政治再教育中心”。但北京否认这些指控，坚称那是一些防止伊斯兰极端化的“职业培训中心”。\n\n最近多个媒体报道了贝德吉公司与新疆和田泰达服装公司的合作关系。据《纽约时报》去年12月报道，和田泰达公司给贝德吉发送了一个集装箱的T恤衫。澳媒ABC新闻也在12月说，美联社追踪到位于拘留营内的和田泰达服装公司最近持续向美国“贝德吉“体育服装公司发货。据中国国家电视台新闻表示，和田泰达公司是求助于穆斯林再教育营的工作者。\n\n当然，不论是独立调查人员或是贝德吉公司的内部调查，在判定企业社会责任方面，都未发现任何与这家美企制造道德原则相违背的情况。\n\n来源：   rfi  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 36,
			"title": "专访 : 新疆面对全球最紧急人道危机",
			"date_published": 1542383400.425,
			"body": "德国之声, 2018年11月15日\n\n国际人权会议“奥斯陆自由论坛”首次在亚洲举办,选址台北，中国议题也成为焦点之一。美国记者李香梅（Megha Rajagopalan）获邀担任演讲嘉宾，曾经担任BuzzFeed和路透社驻中国记者六年的她，是首批揭露新疆“再教育营”的外媒记者之一。但是报导刊登后，她被北京拒绝续发签证而被迫离开中国。李香梅接受《德国之声》专访时，以亲身经验分析新疆和中国近年的剧烈改变。\n\n---\n\n德国之声：甚麽启发你开始关注新疆？为何世界需要知道这个地方的状况？\n\n李香梅：我一直对新疆感到兴趣，我在学生时代就曾经到当地旅游，被其美丽和独特的风貌所震撼。我在路透社供职时都有报导新疆的事，后来在2017年初转投BuzzFeed，开始听到新疆状况大幅度恶化，所以想做一则长篇报导，那时候极少人写过新疆的状况。后来我决定聚焦监控技术，成为我第一篇报导的主要框架。\n\n新疆恶化的状况是非常明显，你只要到了当地就会看到处处都有警察和检查站，镜头和人脸辨识系统布满巡逻站甚至幼稚园。这也构成我的报导的两大部分–大规模监控和人脸辨识。关于监控，我认为重要之处在于这些技术并不只存在于中国，许多政府都在采购监控技术。某种程度上它让人们觉醒，如果政府把监控科技运用到极致，将会落得跟新疆一样的下场。关于“再教育营”，现在有近百万人被关押其中，是一个庞大的数字。那是全球最紧急的人道危机之一，世界应该关注。\n\n维族人就连在家中奉行伊斯兰生活方式也被禁止，政府正在撤底改造他们的文化和宗教习惯，这种规模是前所未有的。中国侵犯人权不是新鲜事，但现今中国政府够胆量作出如此大规模的行动，正好令当权者的本质以及国际社会的沉默表露无遗。\n\n德国之声：中国国家主席习近平上台后，中国的新闻自由状况有何改变？\n\n李香梅：在胡锦涛执政或以前的时代，虽然有资讯审查，但中国本地媒体可以报导的内容仍然相对广泛，部分报章还可以发布不同种类的调查报导。但时至今日，大部分中国记者都会告诉你，这些空间已被收窄。中国国内的好记者不再能够像以往那样做新闻，是一件不幸的事。\n\n对外国记者来说，我们确实看到过去五、六年来情况持续恶化。例如政府拒绝延续记者的签证，导致一定数量的记者被迫离开。当然，这对业内造成愈来愈大的压力。很多采访地点以往不会受到干预，但如今再去的话，警察一定会在酒店等着你。这些手段都是为了阻止采访。另一点我想特别提出的是，消息人士受到的压力也愈来愈大。这对于记者在中国做好新闻是非常不利的，因为我们都要确定消息来源得到保护。消息人士单纯因为接触传媒而面临恶果，在这种环境下我们更难做出好的报导。\n\n德国之声：你在中国做访问和搜集采访资料时遇到甚麽困难？\n\n李香梅：举个例子来说，以往要找学者做评论相对来得容易，但今时今日他们说话时都变得极度谨慎。我曾经与一位官方智库学者讨论一系列政治议题，那是一次很好、很和睦的对话，我也没有要引述他的任何发言。于是我问他以后能否再碰面，他告诉我：“我不被允许给你名片，但我们可以用微信联络。”他说智库明确规定，禁止他们发名片给外国人。大概从2013年开始，像这类人都不会想跟你说话，因为跟外国记者说话对他们没有益处，这令我们更难游说别人开口。外媒的报导无法在中国广泛流通，加上政府和官媒不断散播对外媒的恐惧，令我们的工作更加困难。\n\n德国之声：你认为身在外地的新闻工作者，还有甚麽方法继续报导新疆状况？\n\n李香梅：新疆的问题是警察无处不在，以致在当地采访非常困难。当地是没有出入境限制的，很多记者运用不同方法报导这场危机。很幸运地，我们有很多当地的卫星图片，不少出色的报导都以此为切入点，其他途径还包括招聘启示和政府采购数据。最后就是流亡者，要让他们诉说新疆的事并不容易，因为他们的家人无法离开当地，但很多流亡者还是鼓起巨大勇气接受记者访问。\n\n德国之声：你一直关注和报导中国人权议题，如何评价目前的人权状况？\n\n李香梅：自从习近平执政以来，律师、公民团体和记者身处的环境恶化，这已不是秘密。一些以往能较自由地发声的消息人士，即使他们不会被捕，都很明显感受到来自政府的压力，令他们无法用以往的方式说话。在公民社会方面，有关非政府组织 (NGO) 法律的改革迫走了部分团体，例如美国律师协会。\n\n我们目前身处的中国，所谓“敏感话题”涵盖范围之广是前所未见的，在各个方面都显然易见。另外，审查也比以往恶化。在谷歌和脸书被封锁以后，现在人们只用中国公司出品的网络服务，这情况已经非常普遍。如果你在几年前问我，我会说那不可能持续，但今天我已经不再这麽认为了，这很有可能是未来的大方向。\n\n德国之声：中国的局势也影响着香港，最近《金融时报》记者马凯（Victor Mallet）被港府拒续签证，你认为会影响香港的新闻自由吗？\n\n李香梅：新闻工作者因为做出反对政府的事而被拒发签证，不是一个好兆头。这不利于香港的资讯自由，而且对所有在香港居住的记者来说，确实是一个警号。\n\n德国之声：记者要准确地向全球读者报导中国新闻，你认为最重要的技能和知识是甚麽？\n\n李香梅：同情心、对消息来源保持敏感度，在很多时候都很重要。因为受访者是冒着风险跟你说话，尤其谈到人权的时候。他们会失去家庭、工作，甚至自己的人身自由。你必须保持高度敏感，抱持最大的尊重并确保他们受到保护，这是一种实实在在的责任。"
		},
		{
			"post_id": 35,
			"title": "德议院讨论新疆人权 惹恼中国",
			"date_published": 1542382661.13,
			"body": "德国联邦议院就新疆的人权状况讨论后，北京发出回应。中国当局发出威胁，给德国政府施压之时，正是德国外长访华前夕。马斯曾表示会在此行与对方讨论新疆问题。\n\n（德国之声中文网）中国驻德国使馆网站发布了一份声明，谴责德国联邦议院就新疆问题进行讨论并对中方发出指责的做法，驻德国使馆发言人在声明中写道：”中方对此强烈不满，并就此向联邦议院及政府提出严正交涉。”\n\n德国联邦议院本周四（11月8日）首次就维吾尔人和哈萨克人在中国新疆自治区的境况展开讨论。会议之前，人权活动者呼吁寻找新的途径帮助中国少数民族群体，他们认为，联邦议院应发表一个公开谴责中国迫害少数民族的声明。\n\n---\n\n中国2300万穆斯林人口中，维吾尔族人大约为1000万，仅次于回族，是中国第二大穆斯林少数民族。绿党联邦议员保泽（Margarete Bause）对媒体说，维族人的人权”受到严重损害”。\n\n根据未经过官方证实的报道，被关押在”再教育营”的维吾尔族人数高至百万。\n\n中国驻德使馆声明写道：”德国联邦议院罔顾事实，对中国涉疆反恐和去极端化措施、民族和人权政策横加指责，这是对中国内政和主权的粗暴干 (ZH): 德议院讨论新疆人权 惹恼中国 涉。”声明还说：”希望联邦议院反躬自省，做好自己的事情，同时能客观认识中国，多做有利于增进中德合作与信任的事。希望德方重视中方的关切和提出的交涉，以确保中德关系在正确的轨道上继续向前发展。”\n\n本周日，德国外长马斯（Heiko Maas）会带领经济代表团前往北京进行访问。届时他也会与中方讨论新疆问题。\n\n在联邦议院展开讨论之前，德国移民与难民署已做出决定，重新评估那些已被拒绝的维吾尔难民的避难申请，他们总共不到10人。\n\n驻德国使馆发言人在声明中写道：”中德历史、文化不同，对人权的看法和理解存在差异。中方愿意在平等和相互尊重的基础上同德方进行对话，达到增进了解、相互借鉴的目的。但中方坚决反对他国不顾事实、违反国际法准则，将人权政治化、工具化，借人权干涉他国内政。”\n\n基民盟/基社盟的议会党团人权政策发言人布兰特（Michael Brand）批评了中国发出的这番回应，他对明镜在线（Spiegel Online）表示：”这怎么行。德国联邦议不会接受任何威胁，讨论什么话题更是不会听从他人的指手划脚。”他补充说，马斯必须明确向对方表明这个态度。\n\n来源：   德国之声  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 34,
			"title": "联合国官员谴责中国拘禁穆斯林",
			"date_published": 1542380933.399,
			"body": "日内瓦——联合国人权官员强烈谴责了中国发布的监管条例，这些条例谋求为在新疆地区大规模拘禁穆斯林提供法律依据。\n\n在周一一封递交给中国政府的信中，六名联合国官员及人权专家表示，这些法规违反了国际法，并敦促追究相关人士的责任。\n\n该条例是由中国西部的新疆当局发布的，当局表示此举意在“遏制、消除”极端主义。\n\n联合国专家提出，这些将“再教育营”大规模拘禁合理化的条例是基于对极端主义行为过于宽泛的定义，并且相当于将合法行使基本人权定义为犯罪。\n\n专家们表示，条例“与中国在国际人权法下的义务不相符”。\n\n---\n\n近几个月来，西方的媒体报道及学术研究均揭露出一场对新疆维吾尔族及其他少数民族的打压行动，在镇压中，多达100万人——约占该地区人口的十分之一——消失在了再教育营。此外，几乎日常生活及宗教习俗的每个方面都受到了细致规范。\n\n参与撰写这封信的专家包括埃利娜·施泰纳特(Elina Steinerte)和伯纳德·杜海姆(Bernard Duhaime)，两人均为联合国监测强制失踪及随意拘禁委员会的成员；还有言论自由权问题特别报告员戴维·凯(David Kaye)；以及少数族裔权利专家费尔南德·瓦雷讷(Fernand Varennes)。\n\n他们认为中国官员过度管制的一个例子是，条例中对极端主义的一个定义为“以非正常蓄须”或起名“渲染宗教狂热”。\n\n条例表明，当局意在让宗教“坚持中国化、法治化方向，积极引导宗教与社会主义社会相适应”。\n\n“我们希望强调的是，社会的同质化，以及让宗教变得‘中国化’的目标，按照国际法并不属于合法目标，”专家们表示。他们还提出，再教育营强迫性的本质意味着它们等同于拘禁营。\n\n这个声明似乎刺痛了北京的神经，它严厉批评的这个政策与习近平推动新疆稳定的举措紧密相连，在中国将该国与中亚及欧洲连接起来、充满雄心的“一带一路”倡议中，新疆的战略地位越来越重要。\n\n8月，中国官员向联合国一个调查委员否认了大规模拘禁的指控。自那之后，中国通过官方媒体开始了一项宣传行动，为自己的政策进行辩护，称其为人道主义行动，并表示该行动为新疆的少数民族提供了职业培训，保护易受伤害的新疆人不受极端主义的蹂躏，并且创造了就业机会。\n\n人权专家们表示，他们担忧新疆的条例及中国各地压制异见人士的其他举措不仅违反了基本人权，还“制造恐惧、仇恨及孤立”，可能会导致出现更多的激进及极端主义。\n\n其他参与起草该信件的人权专家还有监督宗教及信仰自由的艾哈迈德·沙希德(Ahmed Shaheed)，以及关注反恐措施背景下人权保护的菲奥努瓦拉·尼·奥蕾茵(Fionnuala Ní Aoláin)。\n\n他们作出批评前一周，中国在日内瓦的联合国人权委员会上为本国的人权记录作出辩护，声称该国在促进和保护“中国特色社会主义的人权”方面取得“实质、巨大进步”，并且反驳称，批评背后有政治因素推动。\n\n2018-11-15 东突厥斯坦新闻\n来源：   纽约时报中文网  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 33,
			"title": "维吾尔人权政策法案：美参议员联署提案",
			"date_published": 1542380370.048,
			"body": "RFA, 2018年11月15日\n\n美国共和党籍参议员、美国国会与行政当局中国委员会主席马克-卢比奥(Marco Rubio)，与民主党籍参议员罗伯特.梅南德兹(Robert Menendez) ，以及其他15位两党参议员，星期三联合提出了《维吾尔人权政策法案》。法案旨在敦促特朗普政府针对中国当局打压穆斯林少数民族的行为作出更强硬反应，包括对一些中国高级官员进行制裁。\n\n---\n\n据参议员卢比奥办公室发布的有关信息，《维吾尔人权政策法案》是针对中国当局在新疆将100万维吾尔人及其他穆斯林少数民族大规模拘押等严重侵权行为，以及中国当局在美国国土上对已成为美国公民或持有美国绿卡的维吾尔人进行恐吓与威胁的行为而提出的。\n\n卢比奥参议员表示，美国必须对那些在新疆实行严重侵权措施、包括将维吾尔人和其他穆斯林人关押在政治再教育营、并有可能犯有反人类罪的中国政府官员和中共党员予以问责。\n\n梅南德兹参议员表示，新疆的形势以及中国政府虐待维吾尔人的做法简直超越了一般的可恶程度，揭示了中国政府在新疆进行大规模监视的手法是对人们基本尊严的严重威胁。特朗普政府需要针对中国具有清晰且一贯的政策，而不要对中国当局的不公正行为视而不见。\n\n《维吾尔人权政策法案》呼吁美国政府在新疆人权问题上与中国政府进行高级别接触，以及在国务院设立一个新疆问题特别协调员，和对中国实行与《马格尼茨基法案》有关的制裁。\n\n总部位于德国慕尼黑的“世界维吾尔大会”发言人迪里夏提就《维吾尔人权政策法案》表示，他们希望世界其它国家也按照美国的榜样，对中国政府对维吾尔人的严重侵权施加压力：\n\n“我们希望该法案能够促使美国行政当局对中国采取更严厉的制裁和实施更大的压力。我们也希望，该法案能使国际社会其它国家也像美国那样，对中国政府针对维吾尔人的侵权予以制裁。”\n\n针对中国在新疆实施违反人权的政策，穆斯林国家迄今表示反对立场了吗？他们对中国政府就此施加压力了吗？迪里夏提就此表示，虽然许多穆斯林国家的民众对中国当局针对维吾尔人和其他穆斯林人的人权打压进行了抗议示威，但他们所在国的政府却保持沉默：\n\n“我们就穆斯林世界对中国政府迫害维吾尔人和其他穆斯林人保持沉默感到失望。中国政府一直在利用各种方式来拉拢他们，因为它知道，如果一个穆斯林国家开始作出反应，那会在所有穆斯林国家之间引发连锁反应。”\n\n路透社的有关报道说，《维吾尔人权政策法案》在要求美国总统特朗普对中国政府打压和监禁维吾尔人的做法予以谴责的同时，还寻求在相当程度上限制美国向中国出口的科技产品，尤其限制那些可被中国当局用于进行监视和大规模监禁穆斯林少数民族的技术。\n\n中国外交部发言人华春莹在星期三的例行记者会上表示，美国政府和美国国会成员们没有权利干涉其它国家的内政。\n\n联合国人权理事会从11月6日到9日在日内瓦举行的第三轮国别人权审查期间，联合国成员国对中国的总体人权状况和在新疆任意拘押百万穆斯林人等违反人权的做法进行了质询。联合国人权理事会信息官员罗兰德.戈麦斯 (Rolando Gomez) 向自由亚洲电台记者介绍说，成员国就中国改善人权状况提出了三百多个建议：\n\n“审议期间针对中国提出的建议就有三百多条，涉及了广泛的议题，其中包括在新疆任意监禁近百万维吾尔人和其他穆斯林人的指控、对少数民族基于宗教信仰的歧视，以及中国至今仍然实行诸多的死刑等问题。”\n\n美国《纽约时报》星期三的报道说，六名联合国官员和人权专家在11月12日递交给中国政府的一封信函中指出，它在新疆大规模地把维吾尔人拘押在再教育营里的做法是违反了国际法。信函还指出，中国当局以“遏制和消除极端主义”为名把大规模拘押穆斯林人的做法合理化，是基于对“极端主义行为”的过于宽泛的定义。"
		},
		{
			"post_id": 32,
			"title": "15国联署  盼与高官谈新疆问题",
			"date_published": 1542294531.213,
			"body": "随着新疆再教育营的人权报告接连出炉、影像报导陆续曝光，各国对中国对待维吾尔族的方式更加关注。15个国家的大使联合写信给新疆党委书记陈全国，要求面谈新疆问题\n\n十五个国家的驻北京大使联合写信给新疆中共党委书记陈全国，表达对新疆再教育营的关切，并邀请他与外交官们见面，对维吾尔族群的人权状况提出解释。\n\n---\n\n路透社首先取得了信件的草稿。信件内容提到：“对于一些关于少数族群报告，我们深深感到困扰，特别是关于新疆自治区的维吾尔族。”\n\n“为了更好的了解情况，我们提议尽快在您方便的时间，与您见面讨论这些问题。”\n\n还不清楚信是否已经寄出，或是内容是否还会修改。一位外交官说，这封信还会传给更多国家进行联署。其他外交官只有承认了这封信的存在，但是拒绝提供更多的细节。\n\n这封信的副本料将送往中国的外交部、公安部，以及共产党的对外联络部。\n\n参与联署的西方外交官，包括加拿大、英国、法国、瑞士、欧盟、德国、荷兰、澳大利亚，以及爱尔兰、瑞典、比利时、挪威、爱沙尼亚、芬兰、丹麦。当中有四位大使指称是加拿大领衔写信。\n\n这次行动是一次针对人权问题的大规模联合行动，并不寻常。这也象征着中国在新疆地区的作为受到越来越多的反对。\n\n八月，联合国人权委员会说，他们收到许多可信的报告，显示有上百万名维吾尔人被中国当局暗中拘禁在大型营区里。中国一再的强调那些营区是培养技能与提高就业率的“职业训练所”。13日，中国外交部长王毅曾说，各国应该少听信关于新疆的“小道消息”，相信当地官员说的话。\n\n随着一带一路计划在各国展开，中国的经济影响力越来越广，许多国家因为害怕触怒中国，而不敢对新疆问题表示意见。\n\n美国两院提案\n\n尽管美国一向宣称关切新疆议题，这次却还没有在信中署名。被问及此事，美国响应，会持续呼吁中国停止有害的政策，释放被强制拘禁的人。\n\n15日，美国参众两院提出法案，提议就人权侵害的原因，制裁新疆的党委书记陈全国，以及其他与新疆再教育营有关的中国官员与企业。\n\n这项法案由共和党联邦参议员卢比奥（Marco Rubio）发起，获得15名参议员的背书，而众议员史密斯（Chris Smith）也提出众议院版本的配套法案。\n\n法案对一系列机关提出要求：美国情报机构对中国如何影响区域安全提出报告，并列出参与再教育营建设与营运的公司名单。联邦调查局对如何保护美国公民免受中国骚扰提出报告。国务院则需要了解北京在该地区施压的规模，加强对新疆地区的监控，并审查商务部对中国的出口管制成效。\n\n中国外交部发言人华春莹隔空响应：“美国议员哪来莫名奇妙的优越感，对其他国家的内政说三道四？”她提出美国的各种族之间，刑期、薪酬、就业机会等都不平等，提点美国议员“可以更关心自己国内的事情，把自己的事情做得好一点。”\n\n她说：“如果通过他们的努力，能让美国少数族裔民众像中国56个民族人民一样享有平等、获得感、幸福感和安全感，那是一件极好的事情。”\n\n来源：德国之声\n作者：罗法，达扬"
		},
		{
			"post_id": 31,
			"title": "维藏大集会，联合国日内瓦总部外抗议中共。",
			"date_published": 1541524586.457,
			"body": "日内瓦，维吾尔人和藏人、蒙古、越南朋友大游行。从联合国人权高专办外游行约一公里，至联合国日内瓦驻地外。联合国理事会正在里面举行对中国人权的第三轮普遍定期审查。\n\n![1.jpg (0x0)](data/img/post_31_1.jpg)\n\n日内瓦抗议现场组织人员Abdusattar Abdurasul他这张图上的家人，全在集中营里。\n\n![2.jpg (0x0)](data/img/post_31_2.jpg)\n\n蒙古族代表\n\n![3.jpg (0x0)](data/img/post_31_3.jpg)\n\n美国维吾尔人协会主席伊力夏提，和他可爱的小女儿，也在日内瓦现场。"
		},
		{
			"post_id": 30,
			"title": "实访新疆英外交官员证实相关报道大致准确",
			"date_published": 1541164025.281,
			"body": "【西藏之声2018年11月1日报道】近日有关中共于“新疆”设立集中营、关押上百万维吾尔等穆斯林的报告，引起国际社会的关注。中共当局最初保持沉默，而后一口否认，最终以“职业培训中心”为借口进行辩解。近日，英国外交大臣在议会透露，英国外交官员实地走访“新疆”，发现相关报告的内容大致准确，因此英国将继续严密关切那里的局势。\n\n在英国国会于10月30日举行的一场质询会议中，该国外交大臣杰瑞米•杭特（Jeremy Hunt）提到“新疆”的恶劣人权状况，尤其是近期备受关注的“集中营”报告。他指英国对这些报告中记录的内容非常担忧，且英方外交官员已经于8月实地走访“新疆”，他们发现相关报告的内容大致准确。\n\n---\n\n杰瑞米•杭特并指出，自己去中国时同中国外长王毅提出了这一关切，而英国外交部也将持续关切发生在那里的情况。\n\n今年10月4日，欧洲议会对“新疆自治区”大量维吾尔与哈萨克人被拘禁问题进行讨论，欧洲联盟外交与安全事务高级代表费代丽卡•莫盖里尼（Federica Mogherini）发表声明表达了关切。\n\n近期联合国消除种族歧视委员会（CERD）发布的结论性意见报告，也关切中国设立大规模“政治再教育营”、对无数维吾尔与其他少数民族进行监视管控、限制行动自由，以及强迫国外维吾尔人返回等等情况。\n\n10月25日，美国国际宗教自由无任所大使布朗拜克（Sam Brownback）也在华府一场记者会上指出，他了解“新疆”的状况非常恶劣，并指针对维吾尔人的宗教限制是错误的，违反了联合国人权宣言。他提出在“新疆”和中国其它地区，人们选择并信仰自己宗教的权利都被限制。“基督教、法轮功、佛教徒、达赖喇嘛议题，还有西藏的状况一直很糟糕。我们看到这些群体在中国遭受的迫害不断升级，这无法令人接受。”"
		},
		{
			"post_id": 29,
			"title": "新疆遍设集中营  孔杰荣呼吁公开讨论制裁习近平",
			"date_published": 1540962628.408,
			"body": "中国政府在新疆实行高压政策，把当地百万维吾尔人投入再教育营，引起国际舆论强烈反应。为降低国际压力，北京千方百计对海外的维吾尔人进行控制。\n\n丽恰克热·霍迦（Gulchehra Hoja）是自由亚洲电台维语部记者。维语部率先报道了中国当局在新疆对维吾尔人的镇压。该部四名记者在中国的亲属被中国警方拘押。霍迦是这些记者之一。\n\n今年8月，霍迦到美国国会就新疆局势作证。她说，跟其他许多居住在海外的维吾尔人一样，一开始她也不敢说话，“因为我们不想让已经处于危险中的亲人更加危险。”\n\n---\n\n中国警察传过来我们父母的照片\n\n霍迦说，中国政府使用高科技手段在新疆挨家挨户地搜集家人在海外的信息，他们甚至有你的电话和地址，“所以中国警察从中国打电话到海外，给留学生或居住在海外的人，象我。打电话给我们，甚至传过来我们父母的照片，说你的家长就跟我们在一起，你应该保持沉默。”\n\n《外交政策》（Foreign Policy）杂志资深编辑詹姆斯·帕尔默（James Palmer）说，新疆大规模打压行动导致他所有的维吾尔消息来源都断了。他说，这种恐怖气氛不仅使他“无法联系到维吾尔消息来源，甚至汉人也不能跟维吾尔人说话，否则就会被抓。”\n\n帕尔默还担任亚洲协会《中参馆》（ChinaFile）亚洲编辑，他说，“几个月前我们停止了跟维吾尔人的联络，因为即便是联系他们的行动本身，都会让他们冒被送进（再教育）营的风险。”\n\n帕尔默说，维吾尔留学生告诉他，他们必须回去否则他们的父母兄弟就要被送进（再教育）营，“我们给他们的答案是，如果你回去，你和你父母还是会被送进（再教育）营，因为你跟外国人有联系，这被看做是最危险的事情之一。”\n\n帕尔默说，为了安全必须留在海外的艰难决定使得维吾尔人作出了巨大牺牲，他们“失去希望、失去国家，甚至对很多人来说是失去中国，因为他们还认为自己是中国人，就像当年的犹太人认为自己是德国人一样。”\n\n打压维吾尔人的制度性恐惧\n\n洛约拉大学（Loyola University）历史学副教授瑞安·图姆（Rian Thum）说，对维吾尔人的打压是一种制度性的恐惧。他有一个朋友的朋友，“她是个被高度同化了的维吾尔妇女，嫁给了汉人，有个半汉的儿子，在天津有一份专业工作，说一口流利中文。”\n\n“一年半前，她到另一个中国东部城市过节。就在她刚抵达酒店、用身份证入住时，她立刻被认出是个维吾尔人。半小时内警察就到了，把他们母子俩软禁在酒店里。一个中年职业母亲和她6岁的小孩，被软禁在酒店里整整一个星期，不允许他们离开，不允许他们跟任何人交谈。然后他们被送回居住的城市。”\n\n图姆说：“这是当下针对维吾尔人的制度性恐惧和不信任的程度：他们被视为威胁、灾难，本质上是危险和令人不安的。”\n\n中共在新疆的大规模打压行动被披露后，据报道，美国国际宗教自由事务无任所大使萨姆·布朗巴克（Sam Brownback）敦促川普政府制裁中共政治局委员兼新疆党委书记陈全国。\n\n中国违反了多项联合国人权公约\n\n纽约大学法学院教授孔杰荣（Jerome Cohen）说，必须实施《全球马格尼茨基法案》，对那些对中国可怕事件的责任者实施制裁。但是他说：“谁是真正的责任者呢？是习近平。他责无旁贷。可没人敢考虑我们可以制裁他。我认为公开讨论这个问题很有价值，因为他是老板。如果要对陈全国实施制裁——他是执行命令，那我们更应该考虑对伟大领袖实施制裁，是他告诉陈要做什么的。”\n\n孔杰荣教授说，中国政府在新疆的做法违反了北京批准并承诺履行的很多联合国国际公约。“不仅是《反酷刑公约》，还有《经济社会和文化权利国际公约》，也违反了《反歧视公约》”，他说。\n\n中国称办职业培训中心\n\n在新疆再教育营逐渐引起国际社会注意后，中国官方说，这是为了反恐和去极端化而开办的职业培训学校。中国又在本月宣布新疆当局通过了修改后的《去极端化条例》，补加了有关开设职业培训中心的内容。\n\n有报道说中国政府把在新疆再教育营的做法合法化了，孔杰荣批评说，这是荒唐的做法。他说，要合法化，“他们必须通过立法，或者根据中国的刑事司法制度抓人。但他们没有这样做，多数人是被非法任意羁押的。”\n\n孔杰荣说，美国很快将与中国就人权问题进行对话，“我们坚持要他们讨论新疆问题。他们终于在压力下同意了，因为否则我们就不去。但后来他们说，他们也要讨论美国对穆斯林及其子女所做的事情。”\n\n来源：美国之音"
		},
		{
			"post_id": 28,
			"title": "美国国际宗教自由大使：新疆与西藏状况持续恶劣",
			"date_published": 1540659826.335,
			"body": "【西藏之声2018年10月26日报道】美国国际宗教自由大使布朗拜克日前于华盛顿的一场记者会上指出，维吾尔与藏人所遭受的迫害正在不断升级，美国对此无法接受，因此将继续呼吁中国允许其公民享有宗教信仰自由。\n\n![9.jpg (0x0)](data/img/post_28_9.jpg)\n\n10月27日为美国《国际宗教自由法案》获通过20周年纪念日，也是美国设立的“世界宗教自由日”。美国国际宗教自由无任所大使布朗拜克（Sam Brownback）于本月25日出席在华府举办的记者会，发表演说介绍了“世界宗教自由日”与美国的宗教自由政策。他强调，美国的建国宗旨之一，就是每一个人都有权享有尊严、选择自己的信仰，这是天赋人权，没有任何国家有权干预。\n\n---\n\n他指出，很不幸的是，世界上80%的人口都生活在宗教信仰受限制的环境中，美国将继续在世界各地、为所有人的宗教信仰自由发声。因为这不但关乎人的尊严，事实也证明宗教信仰开放自由的国度，经济也会随之发展，并且鲜有恐怖主义事件发生——因没有人被强迫接受某种特定宗教模式。\n\n布朗拜克在回答记者提问时指出，他了解“新疆”的状况非常恶劣，并指针对维吾尔人的宗教限制是错误的，违反了联合国人权宣言。他提出在“新疆”和中国其它地区，人们选择并信仰自己宗教的权利都被限制。“基督教、法轮功、佛教徒、达赖喇嘛议题，还有西藏的状况一直很糟糕。我们看到这些群体在中国遭受的迫害不断升级，这无法令人接受。”\n\n布朗拜克强调，美国因此一直将中国列入需特别关注国家名单，同时将继续呼吁中国允许其公民自由信仰宗教。\n\n在今年7月，美国国务院曾举办“促进宗教自由部长级会议”（Ministerial to Advance Religious Freedom）。当时布朗拜克也曾致词指出，在中国，无数维吾尔人被送到再教育营，藏人佛教徒的信仰自由也受到极大的限制、基督教家庭教会领袖被关入监狱。“对宗教自由的限制，就是对和平、繁荣、稳定的威胁。宗教信仰自由权利，以及依照个人意愿而生活的权利，正在世界各地遭到攻击。我们必须改变这一点。”"
		},
		{
			"post_id": 27,
			"title": "憂心新疆再教育營慘況 印度穆斯林上街抗議：反中國！",
			"date_published": 1539836469.897,
			"body": "![9.jpg (0x0)](data/img/post_27_9.jpg)"
		},
		{
			"post_id": 26,
			"title": "美国国会把中共在新疆的所为定为【反人类罪】",
			"date_published": 1539328014.358,
			"body": "卢比奥说：中共始终不渝地通过残暴镇压，监视，洗脑等手段来确保自己的强权。看看美国国会对中共的指控以及中共挣来的惩罚！此法案已送到川普的办公桌。\n\n卢比奥说：我确信川普会签字！"
		},
		{
			"post_id": 25,
			"title": "歐洲議會並通過議案",
			"date_published": 1538761674.389,
			"body": "歐洲議會議員周四譴責中國新疆維吾爾族自治區大規模任意拘留維吾爾族和哈薩克族人行徑，法新社消息，歐洲議會並通過議案要求中國當局立即停止大規模拘留維吾爾族穆斯林人士。"
		},
		{
			"post_id": 24,
			"title": "美议员联署吁制裁中共官员 陈全国赫然上榜排第一",
			"date_published": 1535793767.364,
			"body": "据希望之声消息：联合国消除种族歧视委员会日前指，中共在新疆拘押了上百万维族人，并迫使多达200万人接受再教育和灌输洗脑。近日多名美国国会议员联署呼吁川普政府，对参与迫害的官员及公司实施制裁。\n\n此次联署是由“国会及行政当局中国委员会”两位共同主席，共和党参议员卢比奥（Marco Rubio）和众议院议员史密斯（Chris Smith）牵头，向国务卿蓬佩奥（Mike Pompeo）发信。联署信指出，中共对信奉伊斯兰教的维族人，进行拘禁、虐待，限制他们的宗教、文化活动，而且在新疆进行严密监控，当地民众活在电子监控之下，违反人权情况极为严重。\n\n议员要求行政部门以马格尼茨基人权问责法，对违反人权的中共政府和中共高层作出制裁。该法令授权美国政府，对外国违反人权及贪腐人士实施包括禁止入境、冻结并禁止官员在美国的财产交易等制裁措施。信中列出了一个包括中共官员和企业的名单，名单上排首位的，是中共新疆党委书记陈全国，他被指曾于西藏进行过类似的种族迫害。\n\n企业名单当中，则包括“海康威视数字技术”（Hikvision）和浙江大华技术（Dahua Technology），这两间企业获得中共政府总值12亿美元合同，开发新疆的电子监控系统。"
		},
		{
			"post_id": 23,
			"title": "美国终于站出来了！",
			"date_published": 1533097008.292,
			"body": "![8.jpg (24x24)](data/img/post_23_8.jpg)\n\n图片：2018年7月26日，美国行政当局与国会中国委员会举行听证会，调查新疆地区的人权危机。（记者王允）\n\n上一周，称为美国首都华盛顿的维吾尔人周，或者维吾尔人权周，应该不算夸张。\n\n自星期一开始的有关维吾尔人，有关东突厥斯坦‘再教育集中营’，有关维吾尔人在中共暴政下文化、宗教、民族身份生死存亡危机的问题，几乎成了美国政界、政府各部门、主流媒体及社交媒体的主题！\n\n星期天，也就是7月22日，大华盛顿地区的维吾尔人，先是迎来了世界维吾尔代表大会主席多力坤·艾沙先生；多力坤·艾沙先生是受邀美国共产主义受难者基金会，来参加在美国国会前草坪举办的、由众多非政府组织参与、美国参众两院人士出席的、抗议共产主义暴政肆意践踏宗教自由活动的。\n\n---\n\n华盛顿的维吾尔人权周，首先于7月23日星期一中午，由在美国参议院大楼举办以宗教迫害为题目的、由众多人权组织及参众两院重量级人士出席的研讨会，及由多力坤·艾沙先生参加共产主义受难者基金会午餐交流，在华盛顿首府两地同时拉开序幕。\n\n在参议院举行的的会议上，世界维吾尔代表大会法律事务顾问Nury Turkel先生以书面发言形式介绍了东突厥斯坦维吾尔人在被关押集中营的恶劣处境和维吾尔人面临的生死存亡危机。\n\n在共产主义受难者基金会的午餐会上，多力坤·艾沙先生也以自己亲人、十多年未见的母亲在‘再教育集中营’去世，及一个多月后才得到母亲去世的消息；而且更令人痛苦的是，在这种最需要亲人相互安慰的时候，却无法和父亲及其他亲人通话的凄凉遭遇，介绍了不仅是东突厥斯坦的维吾尔人，而且海外的每一个维吾尔人也都面临的撕心裂肺的生离死别。\n\n紧接着，当天下午，在国会山前的草坪上，有共产主义受难者基金会举办的，有十几个非政府人权组织参加、参众两院政治人物出席的抗议共产暴政迫害宗教自由会议开始了。会上多力坤艾沙先生做了长篇书面发言；多力坤·艾沙先生及其他世维会成员，在会议结束时，还和出席会议发表演讲的参议员Ted Cruz进行了初步接触。\n\n第二天，7月24日，星期二，世界维吾尔代表大会主席多力坤·艾沙先生与美国前总统竞选人、反共重量级参议员Ted Cruz进行了会晤，并向参议员介绍了维吾尔人面临的人权灾难、困境，以及世界维吾尔代表大会的基本情况及其工作。\n\n7月25日，星期三，另一场规模更大的由美国国务院发起、自7月24日至26日为期三天、由国务卿Mike Pompeo主持、副总统Mike Pence出席讲话的《部长级促进世界宗教自由》会议开始了；会议主要聚焦中国各宗教信徒面临的极端宗教迫害。\n\n世界维吾尔代表大会执行委员会主席、维吾尔人权项目主任乌麦尔·卡纳特，著名维吾尔现代派诗人塔依尔·哈姆提等出席会议并发表演讲，向与会者介绍了目前维吾尔人面临的史无前例的残酷宗教迫害。\n\n美国副总统Make Pence在出席部长级促进宗教自由会议讲话中，特别提到了维吾尔人被无端抓捕关押的情况，副总统指出：“今天，中共在其所谓的‘再教育集中营’关押了成千上万，可能上百万的维吾尔人，一天二十四小时强迫他们接受中共洗脑，强制他们否认自己的民族和宗教身份。”\n\n7月26日，星期四，与美国国务院《促进宗教自由》会议遥相呼应，在美国国会，美国参众两院中国事务委员会，在对中共强硬派参议员Marco Rubio主持下召开了以《监控、迫害和大规模抓捕：新疆的人权危机》为题的听证会。参与作证的有自由亚洲电台维吾尔语部记者Gulchehra Hoja；美国驻联合国经济和社会署代表Kelley E. Currie；美国商务部外交政策部门主管Anthony Christino III；中国民族问题学者Rian Thum；高级编辑Jessica Batke。\n\n在听证会上参议院Marco Rubio一针见血地指出：中共政权正在以所谓‘再教育集中营’，无限期大规模抓捕关押维吾尔人，以强制改变维吾尔人的思维方式，清除维吾尔人的民族和宗教身份特征。\n\n参与作证的自由亚洲电台维吾尔语部记者Gulchehra Hoja，以自己亲身经历、疾病缠身父母如噩梦般被抓捕关押的遭遇，讲述了维吾尔人被无端抓捕关押的事实，维吾尔人作为一个民族正在面临的民族清洗危机。\n\n学者Rian Thum 在做证时指出：因为信息的严格控制，尽管目前传出的在“再教育集中营”因滥用酷刑而导致死亡的案例数量不是很多，但不能排除，未来不会出现如纳粹式的民族大屠杀的可能。\n\n出席听证会作证的其他无论是外交官、商务部官员，还是学者、记者都一致的指出：维吾尔自治区各民族现在面临的是，一场史无前例的、高科技全面覆盖下的全天候监控、警察化恐怖迫害，美国作为民主、人权倡导者，必须在各种公开场合坚定的高举人权旗帜，强烈谴责中共对人权的恶意践踏、对宗教信仰者的迫害，必须要求中共关闭集中营。\n\n7月27日，星期五，世界维吾尔代表大会主席多力坤·艾沙先生又马不停蹄的拜访了美国政府一些官员、美国民主基金会、共产主义受难者基金会官员、工作人员，再一次向他们讲述了维吾尔人的情况，并制定了一些未来共同开展工作的一些计划。\n\n7月27日，星期五，美国维吾尔协会主席伊利夏提先生受邀参加了由《明镜》举办的中国研究院第53次以《警察治疆兵团南扩，新疆问题从此无解？》为题的研讨会。伊利夏提用中文向与会者及观众简单介绍了东突厥斯坦问题的由来、发展、及目前维吾尔人面临灾难性局面；伊利夏提呼吁中国有正义感良心人士站出来，和维吾尔人站在一起，共同谴责中共暴行；最后，伊利夏提指出：今天是维吾尔人在面临中共的暴行，如果不加以阻止，如果大家不站出来进行强烈谴责的话；明天很难保证这恐怖迫害不会不降临到每一个中国人头上。\n\n总之，上一个星期，伴随着美国这些政府、非政府组织举办的各种活动，维吾尔人问题几乎成为了各大报纸、电视、社交媒体的焦点问题，让黑暗中的维吾尔人看到了正义的存在，看到了美国人权大国的风范！使我们海外每一个维吾尔人感到，这一周是维吾尔人权周！同时，美国再一次以宗教自由举起了人权大旗，站出来为被压迫民族发声。\n\n来源：自由亚洲\n作者：伊利夏提"
		},
		{
			"post_id": 22,
			"title": "世界维吾尔代表大会全体代表，在东京的中国大使馆外，举行抗议游行！",
			"date_published": 1527939543.442,
			"body": "![8.jpg (24x24)](data/img/post_22_8.jpg)\n\n![9.jpg (24x24)](data/img/post_22_9.jpg)"
		},
		{
			"post_id": 21,
			"title": "世界维吾尔代表大会全体代表，在东京的中国大使馆外，举行抗议游行！",
			"date_published": 1527933065.155,
			"body": "![3.jpg (24x24)](data/img/post_21_3.jpg)\n\n![4.jpg (24x24)](data/img/post_21_4.jpg)"
		},
		{
			"post_id": 20,
			"title": "世界维吾尔大会主席多里坤艾沙先生就即将开始的斋月发表主席声明",
			"date_published": 1526458415.026,
			"body": "维吾尔人权项目, 2018年5月14日\n\n斋月是穆斯林最神圣的宗教生活之一。东突厥斯坦地区的斋月是否能够和平顺利进行，不仅关系该地区维吾尔人，而且也会影响国际社会之秩序；因而，在即将来临斋月前，世界维吾尔大会发言人，代表多里坤艾沙先生向媒体传达其5点声明。\n\n![8.jpg (0x0)](data/img/post_20_8.jpg)\n\n在其声明中，首先，多里坤艾沙先生特别指出：\n\n中国共产党政府如同世界上曾经存在过的一切一党专制政权一样，从来没有实行过民主、自由、平等，也从未真正落实过宗教自由，从未尊重过基本人权。近二十年来，由于自由世界一些国家在政治和经济上对中共政权的实用主义做法，使得中国政府肆无忌惮，特别是是在宗教问题上，更是武断使用暴力进行压制。这一趋势在最近五年的斋月期间年复一年日趋恶化。中国政府每年在斋月前都公开发表政策性文件，明确声明禁止党员、政府公务员、教师学生参加斋戒及其他宗教活动。对于封斋民众，以及清真寺施行严密监视、监控。这种压制和镇压造成的恐怖气氛使得每年的斋月都笼罩在恐惧与不安中，严重地威胁和影响着每一个维吾尔人的封斋及其宗教生活。因此，世维大会在今年斋月即将来临前敦促中国政府：\n\n---\n\n中国政府必须明白，在伊斯兰教神圣的斋月期间，让每一个信仰者在和平、安详中实践其宗教信仰不仅是对每一个教徒的尊重，也有助于东突厥斯坦社会的紧张局势。让每一个维吾尔穆斯林在斋月期间不受挑衅，不被骚扰，安心正常地度过斋月的每一天，是对基本人权的尊重；只有尊重和理解才能使东突厥斯坦的民族对立渐趋缓和，才能避免重大民族冲突事件的发生。\n\n在伊斯兰教的神圣斋月期间，任何针对维吾尔人宗教信仰的挑衅和骚扰，都有可能引发激烈的民族冲突，使本已紧张的局势更趋恶化。斋月期间，如果因中国政府的恶意挑衅和压制而引发任何民族冲突，中国政府必须负全部的责任，国际社会应该对此保持高度的警惕。\n\n作为在国际社会代表维吾尔人的唯一机构，世界维吾尔大会再一次强烈呼吁中国政府，在斋月期间，必须保障东突厥斯坦维吾尔及其他信教群众的宗教信仰自由之权利，保障东突厥斯坦各民族人民的通信及信息自由权利。\n\n同时，世界维吾尔代表大会至此斋月之际，再一次敦促中国政府立即释放全部“再教育集中营”中关押人员，释放全部被关押、被判决政治犯，释放伊力哈穆教授及其他维吾尔学者、社会名人、作家、诗人、企业家；允许他们回家度过一个和平、自由的斋月。\n\n最后，世界维吾尔代表大会还呼吁自由世界各国，国际人权团体、国际组织，国际媒体，请敦促中国政府遵守签约各国际公约、人权准则，遵守国际法，尊重东突厥斯坦各民族人民的基本人权，尊重穆斯林信教群众的宗教自由权利；允许国际有关机构、国际媒体人员自由出入东突厥斯坦，以保障国际社会有效、客观、及时地了解当地发生一切情况。"
		},
		{
			"post_id": 19,
			"title": "《同一个步伐，共同的呼声》",
			"date_published": 1525607542.836,
			"body": "维吾尔人在布鲁塞尔及多个国家举行大规模抗议游行\n\n![1.jpg (0x0)](data/img/post_19_1.jpg)\n\n![2.jpg (0x0)](data/img/post_19_2.jpg)​​​​​​​"
		},
		{
			"post_id": 18,
			"title": "《同一个步伐，共同的呼声》",
			"date_published": 1525594942.725,
			"body": "维吾尔人在布鲁塞尔及多个国家举行大规模抗议游行\n\n![1.jpg (0x0)](data/img/post_18_1.jpg)\n\n![2.jpg (0x0)](data/img/post_18_2.jpg)​​​​​​​"
		},
		{
			"post_id": 17,
			"title": "《同一个步伐，共同的呼声》",
			"date_published": 1525584038.547,
			"body": "维吾尔人在布鲁塞尔及多个国家举行大规模抗议游行\n\n![8.jpg (0x0)](data/img/post_17_8.jpg)\n\n![9.jpg (0x0)](data/img/post_17_9.jpg)​​​​​​​"
		},
		{
			"post_id": 16,
			"title": "《同一个步伐，共同的呼声》",
			"date_published": 1525568463.955,
			"body": "维吾尔人在布鲁塞尔及多个国家举行大规模抗议游行\n\n![8.jpg (0x0)](data/img/post_16_8.jpg)\n\n![9.jpg (0x0)](data/img/post_16_9.jpg)​​​​​​​"
		},
		{
			"post_id": 15,
			"title": "《同一个步伐，共同的呼声》",
			"date_published": 1525538672.55,
			"body": "维吾尔人在布鲁塞尔及多个国家举行大规模抗议游行\n\n![8.jpg (0x0)](data/img/post_15_8.jpg)\n\n![9.jpg (0x0)](data/img/post_15_9.jpg)​​​​​​​"
		},
		{
			"post_id": 14,
			"title": "4到5千新疆维吾尔人偷潜至叙利亚作战",
			"date_published": 1524395903.756,
			"body": "4到5千新疆维吾尔人偷潜至叙利亚作战 反抗阿萨德政权: 中国新疆至少有4000至5000维吾尔人目前在叙利亚参战。根据叙利亚驻中共大使今天透露，这些维吾尔人参加各个不同反抗叙利亚政府的武装作战。该大使说，中共应当关注这一问题。\n\n--这条消息是去年的，现在这些维吾尔武装都聚集到新疆边境了，是一股不小的反抗力量。我估计他们还会逐步扩大武装，可能会扩大到几万人，争取外界的支持，包括资金的支持，然后等待机会对中共展开武装反抗。"
		},
		{
			"post_id": 13,
			"title": "鲁比奥等国会议员敦促美驻华大使优先关注新疆人权并访问新疆",
			"date_published": 1524376414.399,
			"body": "分别担任美国两党国会行政当局中国委员会主席和共同主席的国会参议员马可·鲁比奥和众议员克里斯·史密斯星期三致信美国驻中国大使特里·布兰斯塔德，敦促他访问新疆维吾尔自治区，把那里大规模监视和拘押维吾尔少数民族，其中包括拘押自由亚洲电台维语部雇员家庭成员以及维吾尔人权活动人士热比娅·卡德尔家人的问题当作当务之急，并开始搜集参与实施这项政策的高级官员的信息，以备对他们可能采取的全球马格尼茨基制裁措施。\n\n这两位共和党议员在信中说，“维吾尔和新疆维吾尔自治区其他少数族裔一直遭受任意逮捕，对宗教活动以及文化极为严厉的限制以及四处遍布的数字化监视系统对每天生活各个方面的监视。”\n\n他们在给布兰斯塔德大使的信中表示，有可信的媒体报道说，有多达50万到1百万人正在或者已经被关押进所谓的“政治教育中心”，这是现今世界上最大规模针对少数族裔人口的拘禁行为。中国政府和共产党当局在新疆地区的镇压行为触及到诸多对于美国努力确保一个自由和开放的印太地区来说重要的利益。\n\n两位议员的信中最后说，“我们期待着和您一道推进美国的利益，解决侵犯国际公认人权问题以及削弱可能成为激进主义催化剂作用的政府政策。”\n\n来源：美国之音\n作者：安华"
		},
		{
			"post_id": 12,
			"title": "新疆大肆关押维族，美国拟制裁中共官员",
			"date_published": 1524194378.828,
			"body": "![8.jpg (0x0)](data/img/post_12_8.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "要求中国停止针对维吾尔人充满敌意的政策",
			"date_published": 1524191218.898,
			"body": "总部设在慕尼黑的世界维吾尔人大会发言人迪里夏提通过书面声明对美国之音说：“我们期待美国政府能采取强硬措施，要求中国停止针对维吾尔人充满敌意的政策。”"
		},
		{
			"post_id": 10,
			"title": "大批维吾尔武装人员正在向新疆边境集结",
			"date_published": 1524187682.549,
			"body": "![1.jpg (0x0)](data/img/post_10_1.jpg)\n\n大批维吾尔武装人员正向新疆边境集结。这些武装人员都是从叙利亚过来的，目前不知道他们是否属于被美国列入恐怖组织的“东突武装”。应该都是自行从新疆去叙利亚加入“伊斯兰国”的。个人认为“东突武装”组织到新疆招募的可能性不大。\n\n不过现在他们集结在新疆边境，应该会形成组织，或许会成为那个“东突”的成员，或许会成为“世界维吾尔代表大会”领导的一支武装，或许他们会自行成立新的组织，比如“维吾尔自由军”。"
		},
		{
			"post_id": 9,
			"title": "为“亚洲自由和平行走“",
			"date_published": 1524151530.238,
			"body": "第九届为“亚洲自由和平行走“示威游行2016年10月8号在巴黎举行，主办此次活动团体是越南、老挝、柬埔寨等东南亚人权团体，另外法国参议院部分议员协同“南蒙古大呼拉尔筹委会”、“世界维吾尔代表大会”及在法国藏人民间团体一同参加。\n\n![8.jpg (0x0)](data/img/post_9_8.jpg)\n\n![9.jpg (0x0)](data/img/post_9_9.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "东突独立运动人士示威集会",
			"date_published": 1524142222.659,
			"body": "![9.jpg (0x0)](data/img/post_8_9.jpg)​​​​​​​"
		},
		{
			"post_id": 7,
			"title": "维吾尔独立运动人士在东京",
			"date_published": 1524141899.862,
			"body": "![8.jpg (0x0)](data/img/post_7_8.jpg)​​​​​​​\n\n维吾尔独立运动人士在东京与西藏独立运动，南蒙古独立运动，台湾独立运动人士，及越南反共人士，菲律宾人权运动人士共同集会。"
		},
		{
			"post_id": 6,
			"title": "全球14个国家的维吾尔人集会抗议中共",
			"date_published": 1524141210.326,
			"body": "![8.jpg (0x0)](data/img/post_6_8.jpg)\n\n![9.jpg (0x0)](data/img/post_6_9.jpg)​​​​​​​"
		},
		{
			"post_id": 5,
			"title": "全球14个国家的维吾尔人集会抗议中共",
			"date_published": 1524141003.246,
			"body": "![8.jpg (0x0)](data/img/post_5_8.jpg)\n\n![9.jpg (0x0)](data/img/post_5_9.jpg)​​​​​​​"
		},
		{
			"post_id": 4,
			"title": "全球14个国家的维吾尔人集会抗议中共",
			"date_published": 1524135638.466,
			"body": "![7.jpg (0x0)](data/img/post_4_7.jpg)​​​​​​​"
		},
		{
			"post_id": 3,
			"title": "东突厥斯坦独立运动最早其实是中共及苏联支持的",
			"date_published": 1524122917.311,
			"body": "独立运动的起义武装都是苏联提供的，是受苏联直接指挥的。中共称为三区革命。\n\n电子书：東突厥斯坦獨立運動（1930年代至1940年代）\n\n[http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/htmlfile/dongtuduli/001.html](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/htmlfile/dongtuduli/001.html)"
		},
		{
			"post_id": 2,
			"title": "简单介绍一下东突厥斯坦运动",
			"date_published": 1524111033.449,
			"body": "东突厥斯坦运动与自由西藏运动不同，东突厥斯坦运动没有中间路线，只有独立运动。\n\n东突厥斯坦运动主要以“世界维吾尔大会”为代表。另外还有一个主要的组织是“东突”，具体什么名称我也不清楚。这个组织是被美国政府列为恐怖组织的。但是我没看到过这个组织的网站，也没见过这个组织的宣传。是否真有这么一个组织是有疑问的，质疑的人也不是只有我一个。\n\n但是既然美国政府把它列为恐怖组织，应该中国政府有提供相关资料的，美国方面可能也掌握一些情报的。\n\n不过没见过这个组织在什么地方实行恐怖袭击的报道。新疆境内的一些暴力冲突也看不出有什么境外组织与其关联，都是一些自发的暴力冲突。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}