{
	"title": "TeknoLógico",
	"description": "p2p world",
	"links": "",
	"next_post_id": 11,
	"demo": false,
	"modified": 1512613821,
	"post": [
		{
			"post_id": 10,
			"title": "La era Cypherpunk",
			"date_published": 1512606988.12,
			"body": "**La era [Cypherpunk](https://en.wikipedia.org/wiki/Cypherpunk)** es una realidad. Pero lo es desde que surgió en los 90's. La aparición de la criptografía pronto dejó ver que haría las comunicaciones directamente, secretas. Esta tecnología auguraba que no sólo se podrían escribir emails cifrados, sino que también se podría pasar dinero en secreto. Los bancos lo hacen a diario, y los pagos con tarjeta de crédito son electrónicos desde hace mucho tiempo. De hecho los [precursores del dinero exclusivamente digital](http://www.newsbtc.com/2015/11/01/a-brief-history-of-digital-currency/) se remontan precisamente a esa década.\n\nEn 2009 es la llegada de las *criptodivisas*. Bitcoin aparece al público en 2008 como una idea [plasmada en un famoso documento técnico](https://bitcoin.org/bitcoin.pdf). Aunque el dinero digital existía, ya había experiencia en censurar las webs y requisar los servidores que los temidos malhechores tenían como soporte. La comunidad cypherpunk tuvo por fin un soporte que usaba mecanismos incensurables de los programas peer-to-peer para realizar pagos.\n\nEl gobierno de EEUU prohibió que un organismo *\"no competente\"* permitiera reemplazar sus funciones. Los Estados necesitan tener en una medida aceptable el control sobre la población para que no esquiven el pago de impuestos ni se rebelen contra el Poder. Por tanto los estados aplican leyes coactivas (impositivas) sobre los ciudadanos que les obligan a cumplir unas normas que no han validado ellos.\n\nEn un último ejercicio de libertad, los ciudadanos intentan excabuirse de toda coacción y no legitiman la violencia de los estados para conseguir sus fines. Y hasta ahora como ciudadanos libres no pueden elegir __no seguir__ muchas de las normas. Y por otro lado mientras, los ciudadanos se ven sometidos a estricta vigilancia, los políticos siguen maquillando su transparencia.\n\n"
		},
		{
			"post_id": 9,
			"title": "ZeroNet sigue un algoritmo evolutivo",
			"date_published": 1473657124,
			"body": "ZeroNet es evolutivo porque:\n\n1. Las páginas compiten por su supervivencia\n2. Las menos aptas acaban olvidadas y a la larga eliminadas\n3. Cada día pueden añadir nueva información y se actualiza.\n\nA su vez, ZeroNet compite con otras redes p2p (anónimas o no). La supervivencia de las mismas está condicionada a su adopción (y a no ser abandonadas por los creadores del software). Dependiendo de las cualidades y de las mejoras del software (ej. facilidad de uso), unido a los nuevos contenidos, atraerán a más gente y se verá garantizada su supervivencia.\n\nLa condiciones para su supervivencia son:\n* Una masa crítica suficiente\n* Fácil creación de contenidos\n* Un software seguro y sin bugs\n* Fácil de usar por el usuario sin nociones"
		},
		{
			"post_id": 8,
			"title": "Algoritmos evolutivos",
			"date_published": 1473652727,
			"body": "Algoritmos evolutivos. Los algoritmos evolutivos son aquellos que son sometidos a muchos ciclos de vida. Los ciclos también son llamados \"generaciones\". En un algoritmo informático una generación puede incluso ocurrir en milésimas de segundo, mientras que el ciclo en la naturaleza viene dado por las generaciones de individuos.\n\nUn algoritmo evolutivo busca la supervivencia del individuo más apto, cada generación puede añadir mutaciones (cambios) y al seleccionarse los individuos más aptos, el resultado tiende a ser una *evolución* o mejora.\n\nEn la naturaleza, la competición por la supervivencia consigue que los individuos mejor adaptados tengan más ventajas para sobrevivir y se reproducirán más prolíficamente. Difundirán más prolíficamente sus genes y predominarán sobre el resto. Durante generaciones, esto consigue una evolución bastante homogénea. Cuando no es homogénea --generalmente por una separación geográfica-- se da lugar a diferencias importantes que dan lugar a una nueva 'especie'.\n\n**Así en un algoritmo evolutivo se da:**\n1. Individuos compitiendo por su supervivencia\n2. Sometidos a un proceso de eliminación de los menos aptos\n3. Cada nueva generación añade ligeros cambios a los individuos\n\nLos algoritmos genéticos son un caso concreto de algoritmo evolutivo. La naturaleza y la sociedad también están sometidos a tal proceso. Las personas compiten por trabajo y se crea un *mercado de trabajo* cualquier mercado está sometido al proceso evolutivo de oferta/demanda.\n\nCapitalismo vs socialismo estuvo sometido a un proceso evolutivo, donde el capitalismo salió vencedor debido a la alta competitividad interna que generaba una fuente de riqueza (bienes y servicios que aportaban valor y hacían mejorar la tecnología). No en vano, las guerras también crean esa competitividad y supervivencia del más \"apto\" que en ese contexto es el que más debilita al enemigo. Y las empresas a su vez, compiten con su *competencia* valga la redundancia por sobrevivir, a su vez las que sobreviven se van adaptando a las necesidades del mercado (sus clientes).\n"
		},
		{
			"post_id": 7,
			"title": "Un manifiesto cyberpunk [ES]",
			"date_published": 1472471299.391,
			"body": "Un Manifiesto Cyberpunk\nTransceiverfreq\n20 de agosto de 2011\n\n>\"Information is information, not matter or energy.\"\n>-- Norbert Wiener\n\n#### El Triángulo Kanisza\n![Kanisza Triangle](http://cyberpunk.asia/interface/kanizsa.jpg)\n\nCreado en 1976-1979 por Gaetano Kanisza, psicólogo italiano y artista, fundador del Instituto de Psycología de Trieste. Una ilusión óptica, constituida por tres círculos negros con cortes iguales enfocados al centro y tres ángulos negros sobre un fondo blanco. Los contornos ilusorios definidos por estas formas crean un triángulo blanco en el espacio negativo marginal. Esto es una metáfora del \"cyberespacio\" en la que está definida por límites ilusorios y es también intangible.\n\nLa *idea* del triángulo existe. Pero en realidad está definido por la interacción de las formas y la percepción de nuestra mente. Este es el símbolo más simple que he encontrado para describir \"**cyberespacio\".\n\n## LECTURAS\n\n* [Wikipedia - Cybernetics](http://en.wikipedia.org/wiki/Cybernetics).\n* The Human Use of Human Beings - Norbert Wiener, 1948.\n* Cybernetics: Or the Control and Communication in the Animal and the Machine - Norbert Wiener, 1950.\n* Does Technology Drive History? The Dilemma of Technological Determinism - Merritt Roe Smith, Leo Marx, 1994.\n* Human-Built World: How to Think about Technology and Culture - Thomas P. Hughes, 2004.\n* Cyberspace: First Steps - Michael Benedikt, 1991.\n* Neuromancer - William Gibson.\n* Fear of Knowledge: Against Relativism and Constructivism - Paul Boghossian, 2006.\n* Cyborg: Digital Destiny and Human Possibility in the Age of the Wearable Computer - Steve Mann, 2001.\n* Simulacra and Simulation - Jean Baudrillard, 1981.\n\n## NOSOTROS AFIRMAMOS:\n\n* la información \"quiere ser libre\" y debería ser libre.\n* la información alcanza la calidad de vida.\n* la información madura la autonomía.\n* no solo la información \"quiere ser libre\" sino que es imparable y proclive a ser libre de forma natural.\n* la información mantendrá su propia libertad sea por inacción o acción de liberación por fuerzas externas.\n* todas las guerras previas están basadas parcialmente si no enteramente en el intercambio de, supresión de o descubrimiento de muchas formas de información.\n* la necesidad alimenta la invención y el mundo tiene una terrible necesidad de cambio.\n* la red humano/máquina es la victoria de la información.\n* internet es a la vez anacional y una nación en sí mismo.\n* el ciberespacio existe entre los nodos de una red. Es el meta-espacio definido por el intercambio de información entre usuarios.\n* internet define cyberespacio desde sus propios límites que se expanden y cambian.\n* los movimientos de cyberespacio traspasan hacia el metaespacio. De esta manera la red está siempre moviéndose en el mundo real.\n* el mundo está en constante estado de revolución.\n* la web es el mundo.\n\n## NOSOTROS:\n* somos nativos a la red.\n* estamos enlazados en anonimidad y justificados en ella cada día.\n* somos la red en sí misma. Está definida por nuestra acción e inacción.\n* somos sin una nación de origen y libres como tal.\n* esperamos más de nuestra generación que de los que nos precedieron.\n* elegimos libertad como nuestra nacionalidad y nuestra nodalidad al uso como nuestro lenguaje nativo.\n* elegimos velocidad como nuestro método y flujo como nuestra fuerza fuerza dirigida.\n* rechazamos el gobierno, las naciones, la religión y las entidades corporativas. rechazamos su estrangulación sobre la mente humana y su condición.\n* creemos que \"la calle\" define su propio uso de la tecnología.\n* creemos que no hay tal cosa llamada exceso de información.\n* creemos que todos deberíamos tener acceso a la red y a los datos.\n* creemos que el acceso a los dispositivos electrónicos -y cualquier cosa que enseñe algo sobre cómo funciona el mundo- debería ser ilimitado.\n* nos mantenemos contra formas de jerarquías establecidas y promover la descentralización.\n* promovemos el exceso de limitaciones tanto personal como compartido.\n* somos tecnología. internet está hecho de carne.\n* no somos los rebeldes quinceañeros abatidos descritos por nuestros antecesores.\n* no nos definimos por la tecnología que usamos sino por el para qué la usamos.\n* creemos en la ardiente presencia del futuro\n\n## CONSEJO (Ø):\n\n* cuando ellos lo llaman \"paradoja\", están escondiendo el oxígeno.\n* hay una cualidad especial en una buena traducción que nunca puede ser caputrada en la original.\n* viajar a la velocidad de la luz, estáte alerta y come lo que mates.\n* siempre mira primero el lado de abajo.\n* cuando encuentres la verdad, pásala, rápido, antes que ellos la entierren con dinero.\n* \"la revolución\" devora su juventud.\n* para contactar al operador humano, presiona \"0\"\n\n[traducción libre zeronauta@zeroid.bit]"
		},
		{
			"post_id": 6,
			"title": "A cyberpunk manifesto [EN] [2011]",
			"date_published": 1472470640.098,
			"body": "A Cyberpunk Manifesto\nTransceiverfreq\nAugust 20, 2011\n\n>\"Information is information, not matter or energy.\"\n>-- Norbert Wiener\n\n####The Kanisza Triangle\n![Kanisza Triangle](http://cyberpunk.asia/interface/kanizsa.jpg)\n\nCreated in 1976-79 by Gaetano Kanizsa, Italian psychologist and artist, founder of the Institute of Psychology of Trieste. An optical illusion, comprised of three black circles with equal wedges cut out of them facing the center point and three black angles on a white background. The illusory contours defined by these shapes creates a white triangle in the liminal negative space. This is a metaphor for \"cyberspace\" in that it is defined by illusory boundaries and yet is intangible.\n\nThe \"idea\" of the triangle exists. But in actuality it is defined by the interaction of the shapes and our mind's perception. This is the simplest symbol as yet I have found to describe \"cyberspace\".\n\n## READ\n\n* [Wikipedia - Cybernetics](http://en.wikipedia.org/wiki/Cybernetics).\n* The Human Use of Human Beings - Norbert Wiener, 1948.\n* Cybernetics: Or the Control and Communication in the Animal and the Machine - Norbert Wiener, 1950.\n* Does Technology Drive History? The Dilemma of Technological Determinism - Merritt Roe Smith, Leo Marx, 1994.\n* Human-Built World: How to Think about Technology and Culture - Thomas P. Hughes, 2004.\n* Cyberspace: First Steps - Michael Benedikt, 1991.\n* Neuromancer - William Gibson.\n* Fear of Knowledge: Against Relativism and Constructivism - Paul Boghossian, 2006.\n* Cyborg: Digital Destiny and Human Possibility in the Age of the Wearable Computer - Steve Mann, 2001.\n* Simulacra and Simulation - Jean Baudrillard, 1981.\n\n## WE ASSERT:\n\n* information \"wants to be free\" and should be free.\n* information raises quality of living.\n* information maturates autonomy.\n* not only does information \"want to be free\" but has an unstoppable and natural proclivity to become free.\n* information will maintain it's own freedom by means of inaction or action of liberation by external forces.\n* all previous wars are based partially if not entirely in the exchange of, suppression of or discovery of many forms of information.\n* necessity breeds invention and the world has a dire necessity for change.\n* the human/machine network is the victory of information.\n* the internet is at the same anational and a nation unto itself.\n* cyberspace exists between the nodes of the network. It is the meta-space defined by the exchange of information between users.\n* the internet defines cyberspace by it's own expanding and mutable boundaries.\n* the movements of cyberspace encroach on meatspace. In this way the net is always moving into the real world.\n* the world is constantly in a state of revolution.\n* the web is the world.\n\n## WE:\n\n* are native to the net.\n* are linked in anonymity and justified in it daily.\n* are the network itself. It is defined by our action and inaction.\n* are without a born nation and free as such.\n* expect more from our generation than the ones before us.\n* choose freedom as our nationality and stand alone nodality as our native language.\n* choose speed as our method and flux as our driving force.\n* reject governance, nations, religion and corporate entities. we reject their stranglehold on the human mind and condition.\n* believe \"the street\" defines it's own use for technology.\n* believe there is no such thing as too much information.\n* believe all should have access to the network and the data.\n* believe access to computing devices - and anything that teaches something about the way the world works - should be unlimited.\n* stand against established forms of hierarchies and promote decentralization.\n* promote the exceeding of limitations both personal and shared.\n* are the technology. the internet is made of meat.\n* are not the dejected teenage rebels described by our forebears.\n* do not define ourselves by the technology we use but what we use it for.\n* believe in the burning presence of the future.\n\n## ADVICE (Ø):\n\n* when they call it \"paradox\", they're hiding the oxygen.\n* there's a special quality in a good translation that can never be captured in the original.\n* travel light, stay alert and eat what you kill.\n* always look at the underside first.\n* when you find truth, pass it on, quick, before they bury it under money.\n* \"the revolution\" devours it's young.\n* to contact a human opereator, press \"0\"."
		},
		{
			"post_id": 5,
			"title": "Evolución, liderazgo y estrategia",
			"date_published": 1472322693,
			"body": "[Evolucionista](http://eltamiz.com/elcedazo/series/biografia-de-lo-humano/). Así creo que debe ser el pensamiento racional para explicar muchas cosas, si bien no todo es intuitivo de explicar de esa manera. Por ejemplo, en los roles sexuales la explicación evolutiva es la más sensata; entender nuestros orígenes, hace a quienes somos más racionales/estrategas tener una ventaja competitiva. Saber que siempre ha existido una diferenciación de roles, y que los cerebros de hombre-mujer son distintos porque están especializados en dichos roles, explica muchas cosas. Que el hombre tenga el placentero instinto de replicarse, y que en la mujer recaiga la responsabilidad de elegir muy bien una pareja con unos **buenos genes**  (y que la **quiera** y **proteja** a ella con su prole) hace replantearse cómo nos han ~~vendido el mundo~~ educado.\n\nTambién nos hace ver lo equivocado que es ceder ante los enfoques neo-feministas *(aquellos que no solo buscan la igualdad de derechos)* o las creencias populares con las que nos educan que principalmente tienen sesgos religiosos, románticos o políticamente correctos. Opino que si quieres aprender del mejor, no leas sus libros destinados a un público generalista y escritos muy cuidadosamente para no ofender a nadie. Vas a aprender mucho más conociéndolo personalmente y viendo lo que **hace** y dice tras las bambalinas.\n\nAl final quien la pifia, es el más pringao, el inexperto... que viene a ser el que no se ha molestado en aprender y en desarrollarse. Y a veces lo paga con creces el resto de su vida cuando no planifica sus gastos, sus metas, su felicidad. Por ejemplo cuando tiene un hijo de manera no planificada, o una novia que le chantajea desde su debilidad emocional son situaciones que a veces le exigen tanto hasta el punto de impedirle autorrealizarse. Y cuando en lugar de liderar, es liderado, pierde toda la atracción hacia su pareja.\n\nNo hay que olvidar que la sociedad viene cambiando progresivamente pero a pasos agigantados con las revoluciones industriales y en especial desde las guerras mundiales. Que la sociedad de los últimos 20 ó 40 años tiene una realidad que nada tiene que ver con los miles de años atrás para los que hemos estado evolucionando. Nos toca vivir una nueva época, con una complejidad sin igual, pero nuestro cerebro es tan arcaico como siempre, y está endiabladamente preparado para una sociedad rural y sin estrés. Las creencias populares nos dicen desde \"hay que comer de todo\" hasta \"hay que encontrar a tu media naranja\" cuando ni estamos *incompletos* ni estamos precisamente *en buena forma*. La sociedad actual de hoy en día exige ser transgresor, pues los del rebaño sigue una mano invisible que no busca lo mejor para ellos. La gente inteligente debe mirar fuera de la caja y aprender a liderarse a sí y a los demás.\n\n"
		},
		{
			"post_id": 4,
			"title": "SSHS",
			"date_published": 1472215423,
			"body": "«Ser un Ser Humano superior está al alcance de cualquiera» Eso dice mi amigo. En el sentido que lo dice, yo creo que tiene razón. La media es *casi* por definición **mediocre**.\n\nQuizá es la zona de España donde vivo, pero cada vez me encuentro gente poco comprometida con su trabajo, ni con su palabra. ¿Tan difícil es que un trabajador piense por sí mismo y atienda al público de manera agradable? Otro amigo empresario afirma que sí es difícil. Cada día me encuentro ejemplos. Sólo el emprendedor es quien más hace por que vaya bien el servicio que ofrece.\n\nEn el mundo tecnológico, la *\"excelencia\"* brilla por su ausencia. Conozco chavales preparados que aprenden nuevas tecnologías mucho antes que la gente de las grandes empresas y se dice de ellos que NIestudian-NItrabajan.\n\nPor otro lado tenemos a \"la inmensa mayoría\", donde me incluyo ~~por temporadas~~, donde nos dejamos llevar por las emociones, y en especial por el placer. De esa manera somos manipulados por los medios y la industria (no solo la del entretenimiento). Consecuencia de ello es que no soportamos _el dolor_ cuando es algo muy natural que hemos olvidado. El ser humano ha vivido entre guerras, entre hambrunas y sometido a las inclemencias del tiempo como el resto de animales; en cambio ahora preferimos adorar el sofá, la comida y el sexo sin olvidar otras drogas como el alcohol, la cafeína ni la nicotina. Lo llamamos \"bienestar\" cuando en realidad es \"malvivir\".\n\n## Quieres triunfar?\nEsfuérzate más que el resto, aplica la inteligencia (razón sobre emoción) para preguntarte si lo que haces es el camino más corto a lo que quieres lograr. Desengánchate de tu droga. Permite que la dopamina no campe a sus anchas para educarte hacia el compromiso y la disciplina. Sin duda, una vida enfocada en el [estoicismo](https://es.wikipedia.org/wiki/Estoicismo):\n\n>[En el estoiciosmo] la libertad no puede consistir más que en la aceptación de nuestro propio destino, el cual estriba fundamentalmente en vivir conforme a la naturaleza. Para ello el hombre debe conocer qué hechos son verdaderos y en qué se apoya su verdad. --Wikipedia"
		},
		{
			"post_id": 3,
			"title": "Es esta la web del futuro?",
			"date_published": 1471396427.979,
			"body": "[ZeroNet](http://zeronet.io) Es una red que sirve páginas web de forma descentralizada. Esta facultad evita que un servidor o dominio pueda ser atacado (y así evitar el dañino DDoS). Es más que una prueba de concepto, pues ha comenzado a usarse desde hace más de un año con algunos resultados interesantes. También he visto algunas webs supuestamente tomadas por el departamento de seguridad de EEUU, por lo que hay que recordar que no es anónima --y por lo visto puede ser rastreable--.\n\nAdemás, el creador de cada Zero-web es el único que decide sobre su web y modificarla a su antojo. Aunque puede dar permisos a los usuarios para que vayan añadiendo contenido. Si consiguen la clave privada de tu sitio, pueden editarlo a su antojo.\n\nEn cualquier tecnología hay que pensar que puede haber un componente hostil. Wikipedia previene las ediciones masivas, y la supervisión humana permite detectar a los hostiles, pero perder las claves y con ello la \"autoría\" de un sitio, no permitiría poder reprogramarlo, sino dejarlo al descontrol de cualquiera que lo pueda editar. Esta red p2p unido al anonimato TOR --y el uso correcto de la privacidad-- puede ser una buena combinación para saltar los límites de las redes centralizadas.\n\nSi no es la red p2p del futuro, en realidad se le parece mucho. Está bien enfocada, es fácil de usar y pronto acabará encontrando su hueco de usuarios, que por ahora parece ser la comunidad p2p de torrents ante el cierre de páginas centralizadas.\n\nAunque lo importante es que haya una comunidad de usuarios que se retroalimente. Programadores web están comenzando a sacar lo mejor de javascript y ampliando el ecosistema de ZeroNet.\n\n* Os dejo mi perfil en [ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg/zeronauta@zeroid.bit)\n* La [ZeroWiki ES](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/) que es fuente de links"
		},
		{
			"post_id": 2,
			"title": "[Cómo] Crear webs en ZeroNet",
			"date_published": 1470862116.674,
			"body": "Crear un blog o una Wiki es muy sencillo. Ve al  [listado de la izquierda](http://127.0.0.1:43110/), busca mi blog *TeknoLógico* y dale a clonar. Copiarás la estructura de mi blog.\n\nPero hablamos de algo más que eso... de crear nuevas webs para agrandar y mejorar el ecosistema de ZeroNet. Para crear un sitio, puedes empezar por [aquí: #1](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:43) y ([#2](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:46)). También aprenderás mucho con la [documentación](https://zeronet.readthedocs.io/en/latest/site_development/getting_started/).\n\nEn esencia, tienes que crear un sitio vacío, y todos los archivos que vayas añadiendo, debes de ir firmándolos antes de que se puedan publicar a todos los pares. De otro modo sólo tú verás las modificaciones.\n\n**¿Qué tipo de web puedo crear y qué no?**\nLas posibilidades están abiertas. Las webs en ZeroNet Tienen una estructura en html (HTML5 + CSS) y la lógica de programación se la añade javascript. Debido a su estructura descentralizada, las webs participativas permiten cada usuario añadir y editar contenido teniendo cada usuario un espacio único donde puede añadir contenido. Los usuarios sólo tienen acceso a sus propias carpetas, y sólo pueden añadir contenido mediante algoritmos diferenciales. Esa información primero se guarda en formato JSON. Luego se recopila toda la info de todos los usuarios y se pasa automáticamente a una base de datos donde se convertirán en artículos, comentarios, votos....\n\nHay sitios curiosos de los que aprender. Como:\n* [ZeroTube](http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/) para ir subiendo vídeos. Se crea un enlace magnet.\n* [Web con contenido cifrado](http://127.0.0.1:43110/1AduLtTFQ3jrW4ZwryAcnWx3pLyfgpaFU5) - Se descifra automáticamente en la máquina local. El contenido de la web no tiene sentido hasta que es abierto por el navegador y descifrado con Javascript.\n* [baxtoBlog](http://127.0.0.1:43110/basxto.bit/?Post:6) - Encrypt and share content (post)."
		},
		{
			"post_id": 1,
			"title": "Bienvenido!",
			"date_published": 1470650400,
			"body": "Aquí hablaré de todo un poco. Frikadas, P2P y cosas que puedan ser interesantes. ¡Sígueme!"
		}
	]
}