{
	"title": "СБОРНИК ИНФОРМАЦИИ",
	"description": "Я не претендую на авторство статей на ходящихся на данном ресурсе.\n@dobrota",
	"links": "1",
	"next_post_id": 16,
	"demo": false,
	"modified": 1542515653,
	"post": [
		{
			"post_id": 15,
			"title": "Все темы",
			"date_published": 1542515341.403,
			"body": "<a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:11:БИБLNЯ+KЛADMЕHA\">Библия кладмена</a>\n<p class=\"_article_paragraph article_paragraph article_decoration_last\"><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:13:Бизнес-план+по+организации+мелко-розничного+интернет-магазина+авто-продаж,+с+уставным+капиталом+не+более+350+000.\">Бизнес-план по организации мелко-розничного интернет-магазина авто-продаж</a></p>"
		},
		{
			"post_id": 13,
			"title": "Бизнес-план по организации мелко-розничного интернет-магазина авто-продаж, с уставным капиталом не более 350 000.",
			"date_published": 1542514772.282,
			"body": "![](https://pp.userapi.com/c830509/v830509484/1c46ea/nkixRwxS_HM.jpg)\n\n**Обзорный раздел**\n_Настоящим бизнес-планом предполагается открытие мелко-розничного интернет-магазина, далее магазина.\nОрганизационно-правовая форма ведения бизнеса – тёмный предприниматель. Такая форма ведения бизнеса позволит сэкономить на налогах и упростит бухгалтерию и взаиморасчёты.\nСтепень успешности проекта оценивается как очень высокая, так как спрос на нелегальную продукцию остаётся неизменно высоким практически всегда. Основная задача на первом этапе – занять свою малоконкурентную или среднеконкурентную нишу._\n\n**_Описание предприятия_**\n_Предполагается открытие магазина, занимающимся продажей нелегальных товаров через тёмную паутину, далее даркнет, и рассчитанного на круглосуточный режим работы._\n\n**Описание услуг**\n_Бизнес-планом предполагается магазина, продающего нелегальные вещества путём расположения их на определённой местности, в специальных местах, для бесконтактной передачи их покупателю._\n\n**Анализ рынка**\n_В данном разделе бизнес-плана необходимо первым делом осознать, что надо полостью изучить рынок Вашего города(или населённого пункта), причём отмечать не только непосредственных конкурентов – минимаркеты, но и средних и крупных продавцов, и особенно производителей._\n\n**Производственный план**\n_Первым шагом в реализации бизнес-плана по созданию собственного магазина станет подготовка рабочего места, необходимо иметь ноутбук, с установленной на флешке Tails OS, подключение к интернету только USB-модем и сим-карту, оформленную не на Вас. Если ноутбук и флешка есть и хоть как-то разбираетесь в компьютерах то операционную систему сможете поставить сами, приобретёте интернет. По работе выходить только вот так, Вы заниметесь на прямую продажами, Вам нельзя ошибаться.\nСразу снимите гараж или квартиру, Вам они понадобятся ровно на месяц.\nПора заказывать первый вес, данный бизнес-план предполагает, что первичный товар, будет покупаться только через гарант. Заберёте его сами, расфасуете его по 0,5 максмум 1 грамм, на пробы, и отдадите сотруднику в курьерскую службу. Если принято решение сначала чуть сэкономить, то можете курьером сбегать и самому, если будете делать всё с утра и быстро, то риск не велик.\nДалее нанимается курьер, только под залог финансовых средств, ему Вы делаете один клад, в котором вся розница, уже Вами расфасованный, по размеру залога, считая вес в закупочной цене._\n\n**Сотрудники**\n_Кадры в любом деле решают всё, в данном бизнес-плане они решают всё и даже больше. По этому наняв несколько курьеров и быстро посмотрев результат их работы, выберете лучшего и предлагайте повышение - склад. Буквально через пару месяцев именно этот человек будет хранить весь товар, будьте в нём уверены, не стоит доверять кому попало. Не экономьте на сотрудниках, зарплата курьеров это 40-50%._\n\n**Приём сотрудников на работу и план их действий**\n_Чем больше платите курьерам - тем лучше и надежнее сервис.\nОбязательно надо залог.\nк примеру - залог 3000р. даёте человеку 2гр и ставите задачу - сделать 20 кладов по 0.1гр, обещая по 300р за клад.\nОн их делает - теперь у него залог 3000р+6000р за новые клады. 9000руб. теперь человеку можно дать 5гр (заранее заготовленных) и поставить задачу - сделать 10 кладов по 0.5\\. делает. Платим ему например 500р за 1 клад.\nТеперь его залог 14000руб - можно дать 10гр. на любом этапе человеку теряться нет смысла, его залоговая сумма должна соответствовать вашему оптовому прайсу, чтоб он не мог обмануть.\nОн делает еще 20 кладов и его залоговая сумма 24000рублей, выплачиваем ему 10000руб, чтоб увидел и почувствовал деньги. 14000 остаётся в залоге. повторяем схему, доводим его залог до 50000 рублей, и работаем с ним пополам, выплачивая всегда лишь часть зарплаты, оставляя страховую сумму._\n\nКогда человек заработал доверие, переводим его на опт. Фасует, делает только для курьеров. Например 100р за фасовку+100р с каждого грамма. Сделал 10гр - получил 2000руб.\n\n**План сбыта**\n_Настоящий бизнес-план мелко-розничного магазина авто-продаж предусматривает реализацию готовой продукции через сайты в даркнете, путём установления договорённости о размещении товаров магазина на их страницах. Доставку готовой продукции к месту в котором его должен будет забрать покупатель осуществляет курьерская служба, после доставки сообщая адрес где необходимо товар забрать покупателю._\n\n**_Финансовый план_**\n_Далее мы рассмотрим основные финансовые аспекты создания магазина.\nРасходы на открытие, считались все с большим запасом:\nАренда помещения – 10 000 рублей разово за один месяц.\nПокупка ноутбука - 20 000 рублей\nфлешка - 1 000 рублей\nсим-карты - 500 рублей\nusb-модем - 2 000 рублей.\nвесы, зип-локи - 10 000 рублей.\nЗарплата персонала – при условии, что сотрудник устраивается под залог собственных денег и в первые дни деньги ему платить не надо, 0.\nЗакупка товара - 250 000 рублей минимум.\nОплата открытия на сайте авто-продаж 300$, берём с запасом курс, 20 000 рублей.\nИтого: 313500 рублей на открытие магазина\nОстаток идёт на форс-мажоры, премии сотрудникам._\n\n_Так же есть способ дистанционно работы через форум. На форуме можно создать тему в разделе закладок по своему региону или купить размещение в доверенных магазинах на главной странице форума. Более подробная информация и цены прведены ниже:\n\nДля начала торговли вам нужно создать тему, в разделе \"темы на модерации\" вашего региона (находится под разделом закладок вашего региона соответственно)\n\nДалее нужно опубликовать фото товара. Фото должно содержать товар, ник, дату и название форума.\n\nЗатем в обязательном порядке раздайте пробники и получите 5 трип-репортов, ссылки на которые поместите в шапку темы. Пробники стоит раздавать людям с регистрацией от пол года.\n\nПосле того как вы получите 5 трип-репортов вы должны оплатить тему и переехать в закладки.\n\nЗапрещается: Выкладывать контакты, прайсы и вести продажи до переезда в закладки.\n\nЦены на услуги (в месяц):\nДоверенная : 75.000\n\nДоверенные могут БЕСПЛАТНО разместить 4 торговых темы в Закладках/Отправках, в своей ветке количество тем не ограничено!!!_\n\n_Доверенная СНГ: 50.000\nМагазины и сервисы теневой сферы: 10.000\nЗакладки подраздел 35.000\nЗакладки топ важная 30.000\nЗакладки важная : 20.000\nЗакладки обычная : 10.000\nРеклама текстом : 20.000\nСиний Ник : 5.000 тыс (доверенным бесплатно)\n\nТак же на форуме чтобы упростить процесс работы можно нанять саппорта для того чтобы он отвечал на вопросы и занимался продвижением вашей темы (раздела на главной). Как правило расценки на работу саппорта обсуждаются отдельно после личного собеселования.\n\nНу и наконец упростит вашу работу размещение вашего магазина на торговой площадке **ГИДРА**. Это система автоматических продаж вашего товара. Для этого необходимо написать админу **ГИДРЫ** в личку, оплатить размещение магзина и разместить товар на прилавке вашего магазина. Возможнв варианты моментальных продаж или прода по предзаказу. Не забудте про красочное оформление магазина и качественные фото товара. Они могут привлеч большее количество покупателей.\n\n**Расходы в процессе бизнеса**\n20% - стоимость веса.\n15% - работа оператора, саппорта (наймите знакомого по сети и обезопасьте как следует, желающих миллионы)\n15% - ваш чистый доход если вы вообще не будете ничего делать кроме как иногда выводить деньги с кошельков.\n\nи 40-50% на курьеров.\n\nТаким образом видно, что если делать 1 город и иметь допустим по 50000 руб кассу в день, то ваши 15% это не большая сумма, но можно и не нанимать оператора и саппорта, тогда 30% - вполне себе ничего, учитывая то что в реале вы ни к чему не прикасаетесь и по сути работа безопасна если с самого начала не косячить и следовать элементарным правилам.\n\n**Мелкие хитрости из 5-летнего стажа**\n\n1) Никогда не давайте перезаклады, пока человек не купит у Вас на такое количество товара, что перезаклад ему всё равно для Вас будет маловажным. Необходимо, чтобы сумма потраченная у Вас клиентом как минимум полностт окупала перезаклад.\n\n2) Название лучше выбрать короткое и запоминающееся, локаничное и понятное.\n\n3) При условии, что Вы собираетесь реализовывать товар через сайт авто-продаж, то Вам необходимо тщательно отмывать средства полученные с сайта, всегда прогоняйте через миксеры.\n\nСамое главное правило - абсолютно никому об этом знать не надо, не болтать - главное правило этого бизнеса.\n\nСовет всем читателям, все нюансы учесть невозможно, всегда есть такая вещь, как случай, у всех свои секреты, по этому и работаем годами. Автор бизнес-плана настоятельно рекомендует взвесить все риски, так как от 5 лет до пожизненного да и блатная романтика не всем нравится. Вы обязаны понимать, на что идёте._"
		},
		{
			"post_id": 11,
			"title": "БИБLNЯ KЛADMЕHA",
			"date_published": 1542510859.631,
			"body": "<a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:2:%D0%A3%D0%BF%D0%B0%D0%BA%D0%BE%D0%B2%D0%BA%D0%B0+%D0%B8+%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:2:%D0%A3%D0%BF%D0%B0%D0%BA%D0%BE%D0%B2%D0%BA%D0%B0+%D0%B8+%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5\">Упаковка и хранение</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:3:%D0%91%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D1%8C+\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:3:%D0%91%D0%B5%D0%B7%D0%BE%D0%BF%D0%B0%D1%81%D0%BD%D0%BE%D1%81%D1%82%D1%8C+\">Безопасность</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:4:%D0%A2%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5+%D0%B8+%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BD%D1%8B%D0%B5+%D1%81%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B2%D0%B0\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:4:%D0%A2%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B5+%D0%B8+%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BD%D1%8B%D0%B5+%D1%81%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B2%D0%B0\">Технические и программные средства</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:5:%D0%9E%D1%80%D0%B3%D0%B0%D0%BD%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F+%D0%B8+%D0%BF%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B+\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:5:%D0%9E%D1%80%D0%B3%D0%B0%D0%BD%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F+%D0%B8+%D0%BF%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D1%8B+\">Организация и принцип работы</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:6:%D0%92%D0%B7%D0%B0%D0%B8%D0%BC%D0%BE%D0%BE%D1%82%D0%BD%D0%BE%D1%88%D0%B5%D0%BD%D0%B8%D1%8F+c+%D0%B4%D1%80%D1%83%D0%B3%D0%B8%D0%BC%D0%B8+%D1%83%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%B8%D0%BA%D0%B0%D0%BC%D0%B8+%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:6:%D0%92%D0%B7%D0%B0%D0%B8%D0%BC%D0%BE%D0%BE%D1%82%D0%BD%D0%BE%D1%88%D0%B5%D0%BD%D0%B8%D1%8F+c+%D0%B4%D1%80%D1%83%D0%B3%D0%B8%D0%BC%D0%B8+%D1%83%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%B8%D0%BA%D0%B0%D0%BC%D0%B8+%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0\">Взаимоотношения c другими участниками процесса</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:7:%D0%9C%D0%BE%D0%BC%D0%B5%D0%BD%D1%82+%D0%B7%D0%B0%D0%BA%D0%BB%D0%B0%D0%B4%D0%B0+\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:7:%D0%9C%D0%BE%D0%BC%D0%B5%D0%BD%D1%82+%D0%B7%D0%B0%D0%BA%D0%BB%D0%B0%D0%B4%D0%B0+\">Момент закладa</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:8:%D0%A7%D0%B5%D0%B3%D0%BE+%D0%BD%D0%B5+%D1%81%D0%BB%D0%B5%D0%B4%D1%83%D0%B5%D1%82+%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C,+%D0%BA%D0%BE%D0%B3%D0%B4%D0%B0+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%D0%B5%D1%88%D1%8C.\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:8:%D0%A7%D0%B5%D0%B3%D0%BE+%D0%BD%D0%B5+%D1%81%D0%BB%D0%B5%D0%B4%D1%83%D0%B5%D1%82+%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C,+%D0%BA%D0%BE%D0%B3%D0%B4%D0%B0+%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%D0%B5%D1%88%D1%8C.\">Чего не следует делать, когда работаешь.</a></em></strong></p><p><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:9:%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0+%D0%BD%D0%B0+%D0%BC%D0%B5%D1%81%D1%82%D0%BD%D0%BE%D1%81%D1%82%D0%B8+\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:9:%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0+%D0%BD%D0%B0+%D0%BC%D0%B5%D1%81%D1%82%D0%BD%D0%BE%D1%81%D1%82%D0%B8+\">Работа на местности </a></em></strong></p><p class=\" article_decoration_last\"><strong><em><a href=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:10:%D0%9E%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5+%D1%82%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2+\" title=\"http://127.0.0.1:43110/18VeZx3Y6JPc4qsHRtgyGwZV9ZK9c8w8QD/?Post:10:%D0%9E%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5+%D1%82%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2+\">Описание тайников</a>"
		},
		{
			"post_id": 10,
			"title": "Описание тайников ",
			"date_published": 1542510723.258,
			"body": "**Описание тайников**\n\n**Клады на магнитах**\nТут в большинстве случаев нам достаточно одной фотки, поскольку есть адрес дома, а на снимке должно быть отчетливо видно место крепления. Стандартная схема описания содержит в себе адрес дома, где расположено место крепления\n\n_Примеры:_\n1\\. (Адрес). Клад прикреплен магнитом к верхнему левому углу 1й справа подвальной решетки с задней стороны дома. Или. Клад прикреплен магнитом к левому верхнему углу подвальной решетки. Если смотреть с задней стороны дома, это будет правая угловая решетка.\n2\\. (Адрес). Клад находится снизу левой стенки внутри трансформаторного ящика на изгибе дома. Или. Клад прикреплен магнитом к левой стенке трансформатора, который расположен с задней стороны в углу дома.\n\n**Клады в земле**\nВ отличие от предыдущего варианта, одной фотки нам здесь будет точно не достаточно. Как минимум нам нужно показать общий вид местности и место прикопа с соответствующими пометками. Если клад в парке, то будет очень неплохо, если вы в описании расскажете, как дойти до нужного места.\n\n_Примеры:_\n1\\. Нужно войти в парк со входа напротив Адрес (фото места входа), идти прямо по дороге до большого перекрестка (фото), повернуть направо и идти до тропинки в густой лес у срубленного дуба (фото), дойти до большого разбитого гранитного камня, и внизу под ним с дальней стороны будет клад (фото с отметкой).\n2\\. Идем между домов Адреса в заброшенный двор (фото места входа), проходим по разбитой дороге до помойки, слева напротив будет куча металлолома (фото), рядом с ней фонарный столб, клад прикопан у столба под металлической решеткой (фото с отметкой).\n3\\. Идем по аллее в сторону Улицы (фото начала движения), доходим до тропинки, поворачиваем налево, входим в небольшую рощу (фото), идем прямо до сгоревшего бака, рядом будет лежать кусок бетонная плита (фото), клад под ней посередине со стороны бака под черным пакетом (фото с отметкой).\n4\\. Если смотреть на дом Адрес с задней стороны, то клад будет во второй цветочной клумбе-покрышке под сломанной линейкой (фото с пометкой).\n5\\. Идем по тропинки от дома1 к дому2 Адреса, по дороге видим сломанное дерево (фото), от него нужно идти до следующего дерева, и там в низу, где оно раскалывается на двое, посередине спрятан клад (фото с отметкой).\n\n_Хочу особо обратить внимание на описания кладов в земле_.\nПеречитайте их еще раз. Основной особенностью хорошего описания – это возможность найти клад в земле без наличия фоток, только по описанию. Для этого точно указывайте все повороты и привязывайтесь к недвижимым объектом, а когда будете прикапывать, старайтесь накрыть место каким-нибудь предметом, способным выдержать любые погодные условия. Предмет для опознания, как правило, всегда находится где-то рядом.\nНе самым лучшим вариантом в описании будет указывать расстояние в метрах или количестве шагов, только большие неподвижные предметы, потому что именно так без фото можно найти клад без фотографий. Ну а если, как было показано, делать фотки начального положения, всех поворотов и конечную отметку, то такие клады идеальны для длительного нахождения на улице.\n\nВнимание! Если вы думаете, что в описании достаточно будет только указать координаты и приложить фотку с местом заклада, то уверяю вас, такой формат не принесет ничего хорошего. Зачастую при съеме координат происходят ошибки, неточность может достигать в отдельных случаях несколько сотен метров, это может быть вызвано некачественным gps-приемником, сменой спутников в данный момент, погодными условиями, внешними помехами. Не надейтесь на то, что с вами этого не произойдет, составляйте нормальные описания и все будет хорошо.\n\n**Подведем итоги**.\nИдеальным вариантом описания закладки будет такое, которое четко и однозначно описывает тайник, и включает в себя:\n- Адрес дома или строения\n- Где находится место крепления (если на магните)\n- К какой части места крепления прикреплен клад (если на магните)\n- Подробный путь до места (если в земле)\n- Фотка с указанием, где клад\n- Географические координаты"
		},
		{
			"post_id": 9,
			"title": "Работа на местности ",
			"date_published": 1542510599.174,
			"body": "**Работа на местности**\n\nВыезд и работа в полях. Местность для клада может быть совершенно разной: жилые районы, центр, промзоны, отдельностоящие здания, парки, лесополоса, памятники (у кого на что фантазии хватит) и все прочее, вариантов масса. _Перед тем как выехать на место, не поленитесь и гляньте на карту, куда поедете, определите район работы_. Возможно, в будущем это как-то пригодится, например, при выборе дальнейшего направления движения или общего понимания, куда надо идти обратно.\n\n**ВНИМАНИЕ! Правилами торговой площадки Гидра строго запрещается делать клады рядом с детским учреждениями (школы детские сады и т.п.), на детских площадках (песочницы и т.п.), кладбищах и мемориалах, а также возле учреждения структуры МВД (УВД, ОВД, ГИБДД)**.\n\nТеперь давайте рассмотрим, куда можно спрятать клад. Существует три разных способа заклада – _на магните, в земле и тайник_. Магниты используются в основном для крепления на зданиях или металлических предметах на улицах, а в земле клады могут быть как прикопаны, так и лежать в каком-нибудь предмете или под ним (тайник). Тайник это золотая середина между прикопом и магнитом, тут все опирается на вашу фантазию, спрятать клад можно во что угодно, и где угодно.\n\n_Магнит_:\n+ удачные для быстрого съема места\n+ легкие описания\n- риски шкуроходства\n\n_Прикоп_:\n+ надежность клада\n- трудность описания, много фоток\n\n_Тайник_:\n+ надежность клада\n+ легкость съема\n\nЕсли совсем кратко, то клады на магните можно легко снимать, как правило, они на зданиях, или металлических предметах в городской зоне, а это привязка к адресу, их описания довольно простые, но при этом они более подвержены ненаходам. Клады в земле напротив, очень надежны, но на них сложнее сделать описание и покупателю порой бывает трудно найти место, а еще они не любят копаться в земле. Тайник как было сказано ранее, это что-то среднее между прикопом и магнитом.\nКакой вариант выбрать, каждый решает сам, возможно и комбинированное использование. Может быть, ваш дилер будет настаивать на каком-то одном из них.\n\nОбщие характеристики места заклада.\n**_Удаленность от метро_**.\nС одной стороны, покупатель в большинстве своем жаждет видеть клады у метро, а с другой, кладмен старается спрятать понадежнее. При выборе мест в непосредственной близости к станциям нужно быть особенно осторожным, поскольку прогрессивное шкуроходство тоже не дремлет. Поэтому если у метро, то, во-первых, место крепления клада выбираем особо тщательно, и, во-вторых, ставим в моментальный магазин такие клады в первую очередь, это важно, ведь чем меньше они лежат, тем больше вероятности, что их снимет покупатель.\n\n**_Маскировка_**.\nОчень важный фактор, поскольку для заклада открытая местность, особенно если напротив окон, подходит плохо, потому что это повышает шанс на то, что кто-нибудь вас увидит и снимет клад. И покупателям будет не очень комфортно снимать такой клад, что может отразиться в отзывах.\n\nПри выборе места крепления также очень важно, чтобы клад был не виден с ходу, для того чтобы эти места не выглядели подозрительными. Если клад виден с ходу, то это значит, что его потенциально может заметить любой прохожий, а значит, наверняка найдется любопытный, который захочет проверить. И в этом случае многое зависит от проходимости места, но все же есть очень простое правило, которое поможет устранить эту проблему изначально. Выбирайте места либо ближе к земле, либо закрытые места, куда нужно просунуть руку, чтобы достать клад, главное не на открытом пространстве на уровне глаз человека.\nДля кладов в земле маскировкой (а также и опознавательным знаком) может служить любой предмет, накрывающий место вашего клада.\n\n**_Проходимость места_**.\nПосмотрите вокруг, как много людей проходит мимо вашего потенциального тайника, как много пешеходных дорог поблизости, оцените плотность движения в часы пик. Выбирайте те места, где людей проходит меньше.\n\nРассмотрим некоторые места для закладов.\n\n**Клады на магнитах**.\nОсновная трудность использования магнитов заключается в том, что подходящие места, либо стандартные, по которым работают шкуроходы, либо нестандартные, а их значительно меньше, и на поиск хорошего уникального уходит достаточно много времени.\n\n**Клады в земле**.\nЗдесь вариантов очень много, можно использовать практически любое тихое неприметное место. Это может быть парк или заброшенный двор, это может быть пустое открытое место или хорошо замаскированное. Здесь, в отличие от кладов на магнитах, тайники уже не могут быть видны с ходу, а мест для заклада бесчисленное множество. Любой статичный предмет может служить местом для клада: дерево, столб, большой камень.., в общем все что угодно, что не может быть легко перемещено.\nВажно! Привязывайте место прикопа к какому-нибудь объекту, чтобы покупатель смог легко сориентироваться на местности.\n\nСледующим шагом для нас, когда подходящее место тайника выбрано, это сделать соответствующую для себя пометку в смартфоне. Делайте записи, чтобы они были в первую очередь понятны именно вам, когда вы будете составлять описания. Здесь самое главное однозначно определить место положения точки крепления и адрес дома или объекта, на котором находится точка крепления или же, что сложнее, привязать место закопанного клада к основным строениям.\n\n_С кладами в земле будьте особенно внимательны, и привязывайтесь всегда к крупным неперемещаемым предметам_, в случае неточных пометок с места, вы вряд ли достоверно сможете восстановить картину, а это гарантированный ненаход. Для того чтобы не запутаться самому и тем более не запутать покупателя, нам нужно иметь полное представление о том, как мы попадем к месту клада от центральной улицы или какого-нибудь здания. То есть, нам нужно знать место входа в зону клада, это может быть парк, двор, пустырь и т.д., а также полный путь до места клада.\nЕще один момент, который нельзя упускать из виду, делайте себе такие пометки, чтобы при составлении описания тайника вы не прикрепили неправильную фотку. Подозреваю, это также может очень негативно сказаться на качестве вашей работы. И последнее из этого. Но используя, централизованную программу для хранения фоток и диктофонных пометок, вы тем самым уберегаете себя от собственных ошибок расхождения.\n\nВсегда используйте разные места креплений, тайников и прикопов. Применяйте фантазию и не бойтесь эксперементировать. Плохим вариантом будет делать прикопы по одной линии деревьев, и втыкать палки в землю в качестве ориентира или вешать магниты на одинаковых предметах соседних домов.\n\n**Внешний вид и поведение**.\nПоследний пункт, который нужно учитывать, работая на местности, как при поиске тайников, так и раскидывая стафф, это ваш внешний вид и поведение. С последним, для меня очевидно, что если вы выбрали для себя профессию кладмена, то с характером у вас все должно быть в порядке, и вы не будете впадать в панику при первой же возможности. А случаи у вас наверняка будут, и самая распространенная опасность – это встреча с сотрудниками правоохранительных органов. С полицейскими можно встретиться легче, чем можно себе представить и когда они пешком и в случае патрулирования на машине.\nЕсли при вас нет веса, то это вообще не должно никаким образом отвлекать вас от работы, помним, что если телефон зашифорван и заблокирован, то он не вызовет никаких подозрений, даже если вы чем-то привлекли внимание копов. Если он есть, то нужно быть особо внимательным, и самое главное не подавать виду, спокойствие придет довольно быстро, но поначалу возможно будет трудно.\n\nИ ни в коем случае не втыкаем плеер в уши, не надо ради удовольствия лишать себя окружающих звуков. В любом случае помним основное правило – чем естественнее, тем незаметнее. Передвигаемся со средним темпом, не спешим, но и не зеваем, ни в коем случае не делаем резких движений, взгляд переводим плавно.\nЧто касается внешнего вида, тут тоже все просто, вы должны быть как можно более подходящим к местности и своему поведению. Не стоит шариться по складам в образе хиппи, панка или бомжа, ваши намерения не так поймут, и возможно предпримут меры, и будет обидно попасть с весом из-за такой глупости, не так ли? И обратное, будет смотреться очень странно, если офисный менеджер в идеально белой выглаженной сорочке передвигается по кустам в середине дня в самых спальных районах. Не привлекайте к себе и своим действиям внимание, и все будет хорошо.\n\n**Сезонная специфика**.\nОчевидно, время года напрямую влияет на общую ситуацию на улице, и мы не можем этого не учитывать. Конечно, значение имеет и регион, и населенный пункт, везде есть свои отличия, как по архитектуре зданий, ландшафту местности, длине светового дня, но мы разберем основные особенности работы в разные времена года.\n\n_Лето_. В это время всем тепло и хорошо, с одной стороны, удобно гулять и раскладывать, с другой – гулять выходят большие толпы народу. Поэтому сразу нужно исключить места для заклада с лицевой стороны дома, где есть скамейки у парадных и открытые места напротив детских или игровых площадок. Мы не знаем, в какое время поедет снимать наш клад покупатель, но вполне вероятно, это будет популярное время, и как следствие, обоснованное недовольство.\nЕще одной особенностью работы летом можно смело считать наличие маскировки в виде кустов, деревьев и прочей растительности, и вот это реально самый большой плюс.\n\n_Зима_. Тут напротив, работать менее приятно, но зато и народу мало, особенно когда совсем холодно, при этом сильно затрудняет работу отсутствие листвы у растений, которая обеспечивает наилучшую маскировку. Еще момент, когда выпадает снег, здесь нужно четко для себя уяснить, что следы, ведущие к месту клада, в безлюдном месте могут привести туда шкурохода, поэтому подход к такому месту должен быть хорошо проработан или же вовсе исключен. И последнее, вытекающее обстоятельство из этих двух – отсутствие маскировки и сидящий народ дома, поэтому лучше исключить места, которые просматриваются из больших домов напрямую, в итоге может получится определенное количество ненаходов именно из-за этого.\n\n_Осень-весна_. Тут уже больше зависит от региона, но в общем виде, можно осенний и весенний периоды можно записать куда-то в середину, между летом и зимой. Отмечу лишь несколько неочевидных моментов. По выходным зимой работается очень хорошо и быстро, поскольку народ рано утром отсыпается, на улицу никому неохота, для нас это просто идеальное время, за час можно делать до 20 отличных, удаленных друг от друга в неприметных местах кладов, а вот с наступлением весны ситуация резко меняется, утро выходного дня становится уже не тем…\n\n**Безопасность места**.\nСхема действий патрульных: основные маршруты по главным улицам с заездом во дворы. Как правило, ездят они по первой прилегающей дороге, иногда заезжают дальше, а в глушь дворов значительно реже. Отсюда вывод, чем более глубоко работаем во дворах и дальше от дорог, тем безопаснее.\n\nПродумайте заранее маршруты передвижения с одного района в другой. Крайне нежелательно работать по долгу в одном секторе, это может привлечь лишнее внимание разных лиц. Также не стоит ежедневно работать в одних и тех же районах. Оптимальным вариантом будет каждый день чередовать районы, а в каждом районе от раза к разу можно выбирать различные локации.\nПри передвижении пешком используйте главные улицы, при движении на автомобиле не нарушайте правил дорожного движения, прячьте стафф в укромное место на случай досмотра.\nОсобое внимание стоит уделить паркам и лесополосам. Последнее время, во всех городах там участились патрули.\n\n_Тихие и безопасные места не только хороши для вас, но и приятны для покупателей!_\n\n**Причины исчезновения кладов**.\nПосле того, как мы детально рассмотрели каждый этап в нашей схеме, настало время поговорить о том, по каким причинам прекрасно сделанный клад вдруг исчез, версию о недобросовестности покупателя сейчас не рассматриваем. На счет последних, такие всегда были, есть и будут, хотя очевидно, что система отзывов и комментов на площадке, а также статистическая информация позволяют их вычислять.\n\n_Шкуроходы_. Для уменьшения рисков, связанных со шкуроходством, придерживайтесь простых правил: 1\\. чем ближе клад к метро, тем приоритетнее он должен быть забит в моментальный магазин, чтобы его быстрее купили 2\\. не делайте клады близко друг к другу в похожих местах. Вот такими простыми мерами мы сможем очень сильно усложнить жизнь шкуроходам, и очень вероятно, что они будут находить клады, сделанные менее опытными кладменами.\n\n_Случайный съем_. Тут варианта два – либо спалились при закладе, либо выбрали плохое место. Как избежать того и другого, описано в этом пособии.\n\n_Плохое описание_. Пожалуй, это самая частая причина. Клад лежит на месте, а клиент найти не может. Теперь понятно, почему я неоднократно твердил об этом всю дорогу. И не в самом тайнике дело было…\n\n_Сотрудники коммунальных служб_. Они всегда подметают улицы, чинят предметы общественного пользования, косят траву, работают с электричеством и вообще постоянно при деле.\n\n_Отвалился магнит_. Да, такое бывает/ Но причина тому не слабые магниты, как многие при этом полагают, а поверхность, к которой был прикреплен клад. Чаще всего это ржавчина или другие слои грязи на месте крепления. Чтобы избежать подобного, при закладе потратьте на 1 секунду больше, чтобы убедиться, что клад примагничен надежно. В противном случае, можно попытаться быстро одним-двумя движениями рукой очистить место и примагнитить снова, или же отказаться от этого места, если нет полной уверенности в том, что клад не упадет.\n\n_Ваш коллеги кладмены_. Если вы нашли хорошее место, то возможно это сделает и другой кладмен. Такое частенько бывает в стандартных местах с магнитами.\n\n**Подведем итоги**.\n• Выбирайте день и планируйте район выезда заранее\n• Чем ближе клад к метро, тем приоритетней он должен быть в продаже\n• Внешний вид и поведение не должны вызывать никаких подозрений\n• Делайте четкие пометки у себя в смартфоне\n•Основные факторы выбора места тайника\n• Проходимость места. Чем меньше народу ходит народу вокруг, смотрит с детских площадок или из зданий напротив, чем меньше поблизости мест скопления народу, тем лучше\n• Маскировка. Чем менее заметно место вашего тайника, тем лучше\n• Не забываем учитывать ситуации ограниченного доступа, например, если во двор есть ворота, хоть и открытые, не закладываем в парадные, смотрим по сторонам в поисках камер, и не используем места в их рабочем пространстве. Также обращайте внимание на подозрительные моменты в непосредственной близости от вашему места, как-то отогнутый подоконник, множество окурков на земле и всякие подобные проявления людской активности\n• Учитывайте сезонную специфику\n• Все описания должны быть четкими и однозначными"
		},
		{
			"post_id": 8,
			"title": "Чего не следует делать, когда работаешь.",
			"date_published": 1542510446.448,
			"body": "**Типичные ошибки или чего не следует делать:**\n\n- Подозрительный внешний вид. Капюшон, спортивная одежда, сутулость, неопрятный внешний вид именно по внешнему виду ППС зачастую определяют свою следующую жертву. Твой внешний вид должен соответствовать местности на которой ты работаешь.\n\n- Оглядываться, озираться по сторонам выискивая места\n\n- Носить вещества в карманах не продумав тайник\n\n- Выходить с весом на незнакомый район изначально не изучив его и не спланировав маршрут. Следует соблюдать безопасную дистанцию до полицейских участков\n\n- Считать, что на отдаленных пустырях/отшибах безопасно. Любое подобное место может оказаться довольно популярным и быть под ментовским контролем.\n\n- Не иметь подходящей легенды на случай встречи с полицией. Ваша легенда должна быть максимально убедительной, в лучшем случае подкреплена визуально, например: вы выгуливаете собаку, вы велосипедист в экипировке и с шлемом.\n\n- Использовать места кладов повторно и слишком часто мелькать на одной и той же местности.\n\n- Оставлять данные о времени и дате на фотографиях кладов\n\n- Использовать фото-хостинги\n\n- Фотографировать или закладывать не убедившись, что вас точно никто не видит. На подходе к месту всматривайтесь в окна припаркованных рядом машин, внимательно осмотрите ближайшую территорию.\n\n- Закладывать у проезжих частей. В таком случае поднявшись после заклада можно обнаружить перед собой патрульную машину.\n\n- Долго мельтешить на месте заклада.\n\n- Использовать популярные места входа в парковые и лесные зоны\n\n- Закладывать и находится в местах в которых однозначно можно вызвать подозрения. Например в заброшенных постройках.\n\n- Хранить фото кладов в фотогалерее. Организуй смартфон так, чтобы все фотографии, координаты были либо надежно скрыты либо синхронизировались/передавались на другое устройство и удалялись.\n\n- Закладывать в точках с прямым обзором окон домов"
		},
		{
			"post_id": 7,
			"title": "Момент заклада ",
			"date_published": 1542509747.91,
			"body": "**Момент заклада**\n\nВот мы и подошли к самому кульминационному моменту во всем разнообразии наших действий. Маршрут составлен, какие и где остановки делать известно, можно выезжать. К этому моменту у нас сделана вся подготовительная работа, и осталось развезти стафф и готово.\n_Совет_. Если вы передвигаетесь на метро (самый опасный вариант) с расфасованным стаффом, уделяйте особое внимание упаковке, своему внешнему виду и спокойному поведению. Старайтесь брать поменьше за раз. Задумайтесь о покупке личного транспорта или используйте наземный.\n\n**Важно. Момент заклада никто не должен видеть!**\n\nЕсли в момент заклада на вас в упор смотрит человек из припаркованного автомобиля, это, как вы понимаете, не очень хорошо, хотя бы потому, что есть определенный риск, что он проявит интерес, а еще хуже для нас – бдительность. Оградите себя от ненужных проблем, подходя к намеченному тайнику, осторожно смотрите по сторонам, время, которое вы тратите на подход к месту можно использовать с умом.\nПо идее, ваш момент заклада – это те же действия, что покупатель будет совершать, снимая клад, поэтому сейчас самый лучший эпизод, когда можно убедиться, все ли в порядке. Подходя к месту, оцените всю полноту картины, есть ли камеры на подходе, есть ли поблизости потенциальные места скопления народу и т.д. Все это вы уже проделали раньше, если использовали раздельную схему работы, но так или иначе, другого шанса уже не будет.\n\n**Безопасность при закладе**\nИменно момент заклада является самым вероятным местом прокола. Ведь если вы просто идете по улице, как обычный человек, вас в общем-то не в чем подозревать, а вот если вы возитесь возле трансформатора в присядку, то тут уж извините, оснований вас задержать более чем достаточно.\nПоэтому никогда, ни на минуту, нельзя терять контроль над собой и переставать думать о рисках встречи с ППС. Если это произойдет, вашим большим шансом на успех будет видимость, что вы покупатель, а для этого нужно, чтобы при вас на этот момент в кармане была всего 1 упаковка. В таком случае, при умело разыгранном спектакле и определенной сумме денег, вопрос решается, не доезжая до полицейского участка. Зачем спектакль, и какой он должен быть? Поймите, полицейские тоже люди, им будет намного легче взять деньги, если они уверены, что просто проучили очередного наркомана, поэтому дайте понять, что употребляете травку раз в полгода, а тут решил попробовать что-нибудь другое, просто не знал, что это незаконно, за травку-то ведь до 6 грамм административка, думал и здесь так же. Самое лучшее – стараться держаться как можно более спокойно, эмоции у вас и так будут, поверьте.\n\nДалее, в разделе безопасность будет написано, как действовать в таких ситуациях, а пока что ваша задача определить потайные места для всей фасовки. Вот сделали вы клад, отошли от места, убедились, что никого нет рядом, надиктовали все что нужно, и только тогда можно доставать следующий пак, или же ходить с пустыми карманами, а вытаскивать уже после того, как сделаете фото, непосредственно перед самим закладом. Так тоже можно, если удобно.\nЕще очень важный момент – ваш смартфон. Он является доказательством сбыта.\n\nТо есть, если вы делаете клады, а потом фотки, то очевидно, что если об этом станет известно при обыске, то шансов на успех, увы, практически не остается. Поэтому если понимаете, что сейчас начнется экшен, неторопливым движением в карман и нажимайте на кнопку включения для блокировки телефона. Там при обыске главное чтобы экран был выключен, все внимание копов будет направлено на то, чтобы найти у вас много стаффа (кладмены попадаются, у ментов тоже есть свои методы по выявлению закладчиков), а когда они быстро поймут, что вы обычный покупатель, разговор пойдет об откупе. Ни в ком случае(!) не привлекайте внимания к смартфону, а если вас попросят его разблокировать, это скорее всего будет означать, что вы были не убедительны и доверия к вам нет, нету твердого понимания, что вы покупатель.\nСовет. Не подъезжайте на тачке к месту тайника, обязательно быть трезвым и выглядеть не приметным.\n\nЕще одним важным моментом является время заклада, и это по сути определяет ваш стиль поведения на улице.\nРассмотрим основные тонкости.\n\n**_Ночь_**\nВо дворах никого нет, темно, все спокойно. Патрульные машины ездят регулярно, если встретитесь с ними, есть очень большой шанс на общение. Если решили работать ночью, будьте предельно осторожны, напрягайте уши, ночью тишина, машину, въезжающую во двор легко можно услышать. Вглубь ППС обычно все-таки не ездят, поэтому планируйте микрорайоны, где можно ходить пешком, подальше от основных дорог. Помните, это, пожалуй, самый опасный период для работы со стаффом, но, с другой стороны, и самый продуктивный.\n\n**_Час пик_**\nТут все наоборот, народу много, полиции практически нет. Здесь основная сложность, что все постоянно пялятся, только и делают, что подозревают именно тебя в чем-то (по началу кажется именно так), и вообще мешают работать. Смотрите, есть микрорайоны, где можно и в час пик работать, в большинстве случаев, конечно, есть нюансы.\n\n**_Утро_**\nПосле того, как все уехали на работу, начинается лучшее время для заклада. Обычно есть пару часов в жилых районах, когда все кому надо уехали, пенсионеры и мамаши с детьми еще дома (возможно, попивают чай у окна), а школьники на уроках, когда можно работать довольно эффективно с относительно небольшими рисками по безопасности. Условно это время с 10 до 12 дня, хотя день на день не приходится, могут и в 10:30 зимой машины по полчаса прогревать, а могут и уже в 11 утра все повылезать. Я бы назвал этот период ”ночь, но с небольшим количеством народу, и значительно лучшими шансами по безопасности”.\n\n**_После обеда и вечер_**\nЗдесь народу почти как в час пик, но и патрули присутствуют. Сразу после обеда вблизи школ много учеников, у детских площадок мамаши с детьми (закладывать в этих местах запрещено правилами торговой площадки), а пенсионеры с новыми силами идут по своим делам, а вечером полно молодежных компаний, дышащих свежим воздухом. Но не всегда. Зимой вечером, когда темно, работать можно практически как утром.\n\n**Фото**\nВремя для фотографирования должно быть минимальным, и в идеале, это должно быть плавное движение при подходе к месту или сразу после заклада. Этого легко добиться, если использовать в приложении кнопки громкости для снимка, а не держать одной рукой смартфон, а другой пытаться попасть по сенсорному экрану. Заранее подготовьте свой аппарат при подходе к месту, чтобы оставалось только его вытащить и нажать на кнопку для получения снимка. На все про все фото+заклад должно уходить не более 5 секунд, все остальное, разблокировку телефона и составление голосового описания мы проводим до и после этого момента. Напоминаю еще раз, смартфон ОБЯЗАТЕЛЬНО должен быть зашифрован, чтобы для доступа необходимо было вводить пароль.\n\nИ еще. Помните, деньги могут помочь, поэтому, чем быстрее вы создадите себе подушку безопасности, тем лучше, возможно именно она поможет избежать крупных проблем. Карточки тоже принимают. Точнее, довозят до банкомата."
		},
		{
			"post_id": 6,
			"title": "Взаимоотношения c другими участниками процесса",
			"date_published": 1542509692.306,
			"body": "Имея крепкие профессиональные навыки доставки стаффа вы гарантируете себе хорошую ЗП, следуя всем правилам безопасности вы обеспечиваете себе работу на долгое время, но эта работа является автономной по своей сути, то есть вы гуляете, делаете закладки, описания, фотки, а что дальше… Или что этому предшествовало?\nДля начала давайте поймем, с кем нам придется общаться в повседневной работе. Понятное дело, дилер. Это ваш босс, с ним общение может быть построено по-разному, все люди разные, но главное, что дилер и вы работаете в одной команде, и это значит, что все вопросы и проблемы не должны покидать пределы вашей организации. То есть, какие бы внутренние проблемы не возникли, они никак не должны влиять на отзывы о магазине, качестве отзывов о вашей работе и т.д.\nКлиенты, напротив, если возникают какие-либо сложности, у них сразу же включается моментальная реакция рассказать о том, как я не нашел клад, какой отстойный стафф, кладмен все на свете перепутал и т.д. При том не важно, кто прав, кто виноват, я говорю о реальном положении вещей, определенный процент людей по своей сути любит паниковать, другие просто не могут разобраться, что где лежит даже с фоткой. И в общем их понять можно, отзывы и оценки – это именно то, что в анонимном дипвэбе дает представление о вашем магазине, поэтому если покупатель не разобравшись в ситуации будет сразу же оставлять негативные отзывы, это может отрицательно сказаться на продажах всех товаров в магазине во всех районах. Поэтому здесь наша задача состоит в том, чтобы клиенты находили то, за что заплатили, очевидное рядом!\n\n**Дилер**\nЕго цель простая, продать стафф, получить прибыль, вложить ее, снова заработать и т.д. Решать все эти задачи опять-таки можно по-разному, но без кладмена ему не обойтись, притом понятно, что без последнего дилеру просто не обойтись, ведь стафф сам по себе не окажется у покупателя в кармане. У крупных дилеров в разных районах работают разные кладмены, а отзывы по каждой покупке публикуются в соответствующему товару разделе, отсюда и необходимость, чтобы в команде все кладмены работали хорошо.\n\nИтак, конкретно, какие же вопросы могут возникнуть при общении с дилером?\n_Мастерклад._ В основном, дилеры предпочитают, чтобы мастер был снят как можно скорее, но некоторые не парятся и уверены, что их оптовые курьеры прячут все на века, и вы можете спокойно забрать стафф в удобное для вас время, обычно это места удаленные от цивилизации, и там действительно, без квеста случайно найти просто нереально. Опять же, в ваших интересах не затягивать с этим.\n\n_График работы._ Некоторые дилеры, просто дают вам стафф, и вы работаете в удобном для вас ритме, другие же имеют представление о плане продаж и им важно понимать, на что они могут с вами рассчитывать по количеству, когда вы будете заливать описания, когда будете брать выходные. Эти вопросы тем более важны, чем серьезнее построена организация, ведь представьте, что допустим, у магазина есть хотя бы 100 постоянных покупателей, половина из которых прямо сейчас думает о покупке, но видит, что товара нет в его районе. Он пишет дилеру (или оператору, не важно) вопрос и что? Если дилер в курсе вашего графика, он сразу даст эту информацию клиенту, и тот будет доволен, что либо скоро его любимый товар появится в магазине, либо ему не на что рассчитывать сегодня, и он купит в другом месте, но будет рад, что точно все выяснил и не мучился, а может быть он готов подождать сутки, т.к. стафф ему нужен через день и т.д.\n\nЗапомните, в любом из этих случаев и множества других, покупателю важно знать как можно более точную информацию, таким образом он становится более лояльным к вашему магазину. Поэтому, если того просит дилер, согласовывайте с ним все моменты по рабочему графику планам и прочим организационным моментам. Также важно, можете вы быть онлайн или нет для решения оперативных вопросов.\n\n_Деньги._ Не менее для вас важным являются вопросы залога и механизм выплаты зп. Оговорите заранее следующие вопросы: сколько вы будете иметь с клада, зависит ли зп от веса клада (бывает по-разному), сколько вычет с ненахода, график выплаты зп. Залог – это та сумма, на которую дилер выдает вам стафф, то есть, чем он больше, тем больше вес мастерклада вам будет выдан, а это в свою очередь дает вам определенные плюсы. Как и любые финансовые дела, их лучше решить сразу и более к ним не возвращаться.\n\n_Ненаходы._ Тут нужно понимать, что вы делаете, если случился ненаход, дилер возвращает деньги или вы делаете перезаклад и в каком объеме. Вообще напомню, их быть не должно, но они случаются )) и быть готовым нужно, также как и иметь представление о своих действиях в этом случае. Также следует решить, имеете ли вы право самостоятельно принимать решения по таким вопросам.\n\nЭто основные вопросы, с которыми вы будете сталкиваться при общении с дилерами, как видите, их совсем не много, и вообще дилер – это ваш друг, старший коллега, руководитель и т.д., и они не менее вас заинтересованы в качественной совместной работе.\n\n**Покупатели**\nТут с одной стороны проще, с другой сложнее. Проще тем, что если все в порядке, вы делаете нормальные клады с понятным описанием и фотками, то вы и знать не знаете про их существование, просто смотрите, как разлетаются ваши клады и считаете прибыль. Что может быть приятнее? Но! Если вдруг возникают проблемы, вот тут нужно быть очень внимательным, ведь ненаход – это потеря зп, а часто бывает так, что ненаход случился из-за того, что клиент не понял описание, вот и все. Итак, 2 основных момента с покупателями.\n\n_Неточность описания._ Бывает такое, что фотка не загрузилась, или квест не слишком четкий или еще чего… Вы сразу же получите вопрос, на который чем быстрее отреагируете, тем лучше. А лучше всего, чтобы их вообще не было, точнее, их отсутствие свидетельствует о хорошем качестве вашей работы. Как бы там ни было, уточнить описание во время, это даже может сыграть в плюс при написании отзыва клиентом, мол, ”купил, была проблема, оперативно решили, все круто - респект”. И это для других покупателей будет свидетельством того, что даже если возникнут проблемы, его не оставят наедине с проблемой, а это является одним из ключевых факторов при выборе места покупки.\n\n_Ненаходы._ Если вы сошлись на мнении, что место найдено то самое, клиент абсолютно уверен, что смотрел именно там, и вы это подтверждаете, а клада нет, то это ненаход. Что делать в таком случае, вы должны заранее проговорить с дилером, особенно ответственность за принятие решения о перезакладе.\n\n**Схема работы по проблемным заказам**\nКак узнать, есть ли проблема? По нашим условиям работы, покупатель, в случае возникновения проблем должен написать об этом непосредственно в самом заказе, открыв диспут или задав вопрос. Также сообщения о проблемных заказах попадают в папку Сообщения.\nИтак, если проблема с заказом возникла, то это может быть как сообщение о ненаходе, так и просьба уточнить место. В случае уточнения покупатель может задать вопросы или попросить пояснить какие-то детали, тут сразу как увидели, не затягивая, по свежей памяти даем пояснения. Если покупатель говорит о ненаходе, тогда в первую очередь надо дождаться фоток с места, о чем смело можно попросить покупателя.\n\nПосле того, как покупатель скинул ссылку на фото с места, задача кладмена определить, правильно ли покупатель нашел место, там ли он искал и отписать об этом в заказе.\nОчень важный момент на этом этапе заключается в налаживании контакта с покупателем, и зачастую, в совокупности с дилерской статистикой становится понятно, если мы имеем дело с чайкой. После того, как кладмен отписывает в заказе свое заключения о правильности нахождения места, дилер или саппорт принимает решение по ненаходу, а также сообщает о дальнейших действиях по перезакладу.\n\n**_Запомните, проблемы с заказом нужно решать, а не отстраняться от них, это залог успешной работы кладмена и всего магазина._**"
		},
		{
			"post_id": 5,
			"title": "Организация и принцип работы ",
			"date_published": 1542509356.771,
			"body": "**Организация и принцип работы**\n\nСвое рабочее время можно использовать по-разному, и от этого будет зависеть скорость выполнения заданий, безопасность и комфорт. Мы рассмотрим 2 метода работы, принципиально отличных друг от друга.\n\n1\\. **Однодневный**\nЗдесь схема вполне очевидна. Выезжаем, ходим-гуляем, находим место, делаем закладку, фоткаем, делаем себе пометки и идем дальше.\nЭтот вариант подходит уже опытным кладменам, поскольку требует, чтобы все вышеперечисленные действия были доведены до автоматизма, и только так будет достигаться максимальная эффективность, которая будет выражаться в большом количестве кладов и точными описаниями.\n_Преимущества_:\n* Высокая скорость работы\n_Недостатки_:\n* Находимся на улице всегда со стаффом, повышенные риски\n* В случае ошибки описания, трудно будет все проверить\n\n2\\. **Раздельный**\nВесь цикл от выезда на место до поступления описания закладки в моментальный магазин разделяется на несколько этапов:\n1\\. выезжаем на местность, ищем места, делаем пометки, возвращаемся, далее (лучше с этим не затягивать, вдруг понадобится свежая память)\n2\\. составляем описание, это предварительная работа, потом\n3\\. разъезжаем по уже готовым тайникам и делаем клады.\n_Преимущества_:\n* Повышенная безопасность.\n* Возможность проверить описание\n_Недостатки_:\n1\\. Требует большого запаса времени\n2\\. Зависимость от людей\n\nОчевидно, что для начинающего кладмена больше подойдет раздельный вариант работы, поскольку дает возможность без палева гулять по дворам, фоткать, рассматривать места, проверять их на возможность крепления и т.д., все это вы можете делать, если на руках нет стаффа. Единственное но. Вы можете подготовить потрясающее место, приехать туда и выяснить, что прямо напротив в двух метрах от него зависли посторонние люди и не собираются никуда уходить.\nОднодневный вариант, напротив, очень эффективен, совершенно не зависит от народа и сводится, по сути к тому, чтобы гулять, смотреть-искать и закладывать, если нет никого рядом. Смотрите, критерий, по которому можно переходить на такую схему – это уверенность, безошибочность и точность действий. Если вы еще не уверены, хорошее выбранное место или нет или же сомневаетесь, а есть кто рядом или нет при закладе, то оставайтесь на раздельном варианте работы.\n\nНу а по жизни все рано или поздно придет на свои места, и вы будете пользоваться неким средним способом. С приобретением опыта, вы будете запоминать районы, будете знать несколько десятков лучших мест, которые будете использовать раз в пару недель, и откуда будете начинать свое путешествие, и эти места известны как отправные точки, а дальше начинаете гулять и искать остальные, потом другой микрорайон и т.д.\n\n**САМОЕ ГЛАВНОЕ % НЕНАХОДОВ, А НЕ СКОРОСТЬ**\n\nНе бойтесь составлять свои схемы работы, делать как вам удобнее, ведь только так вы сможете достичь максимальной эффективности."
		},
		{
			"post_id": 4,
			"title": "Технические и программные средства",
			"date_published": 1542509212.516,
			"body": "**Технические и программные средства**\n\nПеред тем, как начать работать, лучше заранее подготовить себе рабочее место, установить нужное ПО на телефон, погулять и потренироваться использовать все это. Также необходимо закупить весы и расходники, найти, где они продаются можно в интернете, а вот покупать лучше съездить самому и взять за наличку.\n\nДля работы нам понадобится стационарный компьютер или ноутбук для заливки адресов и смартфон для работы на местности.\nНа рабочем месте у вас должен стоять ТОР-браузер для выхода на сайт Гидра и желательно использовать зарубежный VPN, оплаченный биткоинами.\n\nЕсли вы планируете работать по раздельной схеме (см. главу \"Организация и принцип работы\"), то для хранения описаний тайников можно использовать программу **_SAS.Planet_**, в ней можно наносить описание тайников на оффлайн карту. Так вы будете видеть географию своих тайников.\n\nСмартфон для работы на улицах должен быть оснащен хорошей камерой и фонариком, gps-приемником, иметь достаточный объем внутренней памяти и флэшки. Самые дешевые варианты за 2-3т.р. можно не рассматривать, потому что у них ужасные камеры, отчего фотки получаются не четкими, малый объем внутренней памяти, из-за чего вы не сможете установить и использовать все нужные приложения, бывает, еще к тому же не всегда работает gps-приемник. Из относительно бюджетных вариантов можно выделить **_Xiaomi Redmi 4A_** и **_MEIZU M5_**, их цена за новый телефон в районе 6,5-7т.р.\n\nПрограммное обеспечение для смартфона.\nОффлайн-карты **_MAPS-ME_** - карты с детальной прорисовкой, работают без подключения к интернету\nФоторедактор. Подойдет любой, где есть возможность ставить метки, можно использовать Infinite Painter (_Android_)\nЗаметки. Любой редактор, где можно прикреплять фото к заметкам.\nДиктофон **_ZZ gram_**. Позволяет сделать фото (хорошо использовать в связке с OpenCamera) и добавить к нему голосовой комментарий.\nКамера **_OpenCamera_** (_для Android_) удобная камера, которая фоткает по нажатию на клавиши регулировки громкости, есть функция, запрещающая делать фото, если gps-приемник не готов.\n\nДля того, чтобы эффективно работать со смартфоном, нужно заранее продумать последовательность действий, что вы делаете и какую программу при этом используете. По сути, нам нужно сделать несколько фото и нанести на них отметки.\nМожно совмещать, использовать голосовые комментарии и графические пометки, об этом в главе \"Работа на местности\"."
		},
		{
			"post_id": 3,
			"title": "Безопасность ",
			"date_published": 1542508724.516,
			"body": "Все вопросы по безопасности можно разделить на две большие категории -- инет и реал. Безопасность в инете обеспечивает программный комплекс, используемый вами, в реале -- только вы сами. Все программы, такие как torbrowser, jabber client, vpn client и т.п. умеют шифровать данные, что в свою очередь дает нам определенную гарантию того, что даже если ваш провайдер захочет прослушать весь трафик, ничего толкового из этого не выйдет. Точно такие же гарантии можно дать и относительно вычисления вашего реального ip-адреса, и соответственно определения вашего местоположения или хотя бы интернет-провайдера. Так это работает. Но тут тоже могут быть нюансы. Другая сторона вашей безопасности -- реальный мир: улицы, полицейские, граждане, камеры...\n\n**Правило №1\\. Не болтай лишнего.** Чем больше людей знают о вашей деятельности, тем больше у вас проблем. Личные контакты -- это самый верный шанс оказаться за решеткой!\n\nИтак, правило #1\\. Действует всегда и везде, в сети и в реале, каждую минуту и не имеет обратного действия отмены. Сами посудите, как проще всего задержать кладмена (да собственно как и всех профессионалов темного рынка), по наводке, вычислить на улице среди толпы или через информационные технологии? Поэтому если вступили в это дело, умейте держать язык за зубами! А если уже кто-то знает? Смотрите сами, даже если вы давно работаете в связке с кладменом-лучшим другом с детского сада и доверяете ему больше чем всем остальным на свете, поймите, это уже вариант прокола, это уже говорит о том, что не все в ваших руках. Оценивайте риски личных контактов самым тщательным образом. В идеале конечно, когда никто вообще не знает, но в жизни такое встречается далеко не всегда.\n\n**Безопасность в интернете\\** Использование компьютеров и смартфонов для выхода в интернет не может проходить бесследно, вы всегда оставляете какую-то информацию в логах провайдера, на серверах, в мессенджерах, точно также как человек оставляет свои отпечатки пальцев на предметах. Суть в том, чтобы ваши следы не указывали никаким образом на род деятельности и не вызывали никаких подозрений.\n\n_Tor Browser._ Это браузер, Mozilla Firefox, который имеет встроенный функционал шифрования и подключения к сети .onion, в которой находится торговая площадка. Тут все просто, если вы зашли на Гидру, вы уже имеете базовую защиту.\n\n_VPN-сервис._ Я не стал расписывать как работает сеть TOR, но принципиальным моментом здесь является то, что мы попадаем в нее со своего ip-адреса, то есть, чисто теоретически, если входная нода принадлежит властям (а такое теоретически возможно), нас можно вычислить при условии, что и выходная нода прослушивается и можно выявить наш трафик. Опять-таки, это все очень трудозатратно, но для того, чтобы обезопасить себя и скрыть свой реальный ip-адрес, или адрес провайдера, что в общем-то не так уж важно, прекрасно подходят анонимные vpn-сервисы. Если хотите больше защиты, используйте VPN, многие из таких сервисов, кстати, принимают bitcoin.\n\n_Рабочее место._ Идеальный вариант работы, это когда у вас отдельный ноут или комп только для незаконной деятельности. Ни для кого не секрет, что в современном интернете все поисковые службы, финансовые системы и другие различные сервисы очень любят сопоставлять информацию обо всех запросах, покупках, движении средств и т.д. Ну вы понимаете о чем я, информации об этом в интернете достаточно. Поэтому, лучше всего использовать отдельный ноутбук, и не использовать на нем ничего, кроме рабочих инструментов, ни в коем случае не заходить с него на почту, вконтакт и т.д.. Если же вы, в добавок к вышеуказанному, поставите программу шифрования жесткого диска, то получится, что к анонимности вы добавите еще и надежную защиту информации, и в случае если ваш ноут попадет не в те руки, это позволит избежать определенных проблем.\n\nНи в коем случае не используйте _фотохостинги_. Большинство фотохостингов успешно сотрудничает или стоят на контроле у правоохранительных органов. Со всех этих сайтов аккумулируются и сортируются фотографии по регионам и тематике (паспорта, закладки). По запросу, фотохостинги выдают информацию об ip-адресе отправителя, лог подключений, количество загрузок, imei телефона. Для того, чтобы исключить разного рода рисков, связанных с фотохостингами, рекомендую загружать картинки напрямую в магазин, используя внутренний функционал Гидры.\n\n_СОРМ._ Многие слышали, но не все понимают что это.\\\nЕсли вкратце, это комплекс, который собирает и анализирует трафик с голосовых сетях и сетях передачи данных. СОРМ внедряется в инфраструктуру интернет-провайдеров на законодательном уровне, и при этом его использование возможно до решения суда.\\\nКладмена можно выявить по анализу трафика. Например, если не пользоваться голосовыми вызовами, при этом активно использовать Tor, Wickr, jabber. В этом случае можно попасть на контроль, и впоследствии в полноценную разработку.\n\n**Безопасность в реале\\\n***Финансы.* В последнее время сотрудники правоохранительных органов стали анализировать обменники и брать на контроль людей с выводом, особенно тех, кто выводит на свои персональные реквизиты. В большинстве своем это кладмены или операторы.\\\nОдним из самых опасных банков можно смело назвать КИВИ, который активно взаимодействует с правоохранительными органами. На проведение запроса не надо никаких судебных постановлений, только запрос за подписью начальника отдела, что позволяет выполнять оперативные запросы, время ответа в среднем 4-5 часов. Ответ из КИВИ-банка содержит в себе информацию об аккаунте, ip-адрес последнего входа, лог подключений, информацию о привязанных картах КИВИ и привязанных картах сторонних банков, а также список всех входящих и исходящих транзакций. По такой же схеме сотрудничают и другие банки, и вполне вероятно, совсем скоро в подобную паутину будут вовлечены все участники финансовой системы.\n\n_Поведение в обществе._ Мы уже говорили о том, что быть незаметным -- самая лучшая наша маскировка, и это правда, также мы никогда не забываем про правило #1\\. Одним из самых важных моментов заключается в том, что истинные причины, по которым кладмен может иметь крупные неприятности, состоят только в незнании или нежелании использования самых главных основ, вторую из которых можно сформулировать так: всегда оставайся незаметным. Подавляющее большинство, и все крупные дела по наркоторговле основано на имеющийся информации, подозрениям, доносам и т.д. В любом случае, если вы вызываете подозрения у обычных граждан, оно может дойти до полицейского участка. Чтобы такого не случилось, используйте простые правила.\\\nБудьте готовы вступать с людьми в разговор и вести себя при этом максимально естественно. Например, если вы идете по улице со стаффом, и вас незаметно спрашивает прохожий, который час, вы ни в коем случае не должны теряться и вести себя как первокурсник на экзамене, а спокойно посмотреть на часы или достать телефон и сообщить время.\\\nДругой пример. Вы снимаете квартиру и сочетаете функцию склада, и частенько возите туда крупные объемы, и при этом, на новом месте к вам соседи испытывают огромный интерес. В такой ситуации лучше всего первым идти на контакт, быть приветливым, здороваться, если с вами пытаются завести разговор, это лишний раз дает возможность заявить о себе, как о хорошем соседе, но помните, заводить никаких близких знакомств, напротив, нельзя. Главное все делать спокойно и естественно, тогда в вас никто не сможет заподозрить ничего плохого даже в той ситуации, когда вы сами допустили грубую ошибку.\n\nОчень важно! В случае, если в момент заклада вас встречает патруль ППС, это еще далеко не конец. Это значит, что сейчас выйдут здоровые полицейские, у которых есть оружие и наручники и сразу начнут обыск, проверят карманы, сразу же начнут резко грузить вопросами, ну в общем сложная психологическая ситуация. Но при этом, если вы ЗАРАНЕЕ позаботились о том, чтобы в самых основных местах (как в клубах обыскивают практически) не было фасовки, и сразу же даете понять, что вы покупатель, то деньги, скорее всего, могут решить вопрос. Здесь важно понимать, вы попались и ситуация не в вашу пользу, если вы будете требовать протокола, понятых и всего прочего, в данных конкретно обстоятельствах это лишь подтвердит вашу вину в глазах патрульных, а там уже того гляди и обыск будет более серьезный, где уже точно весь фасованный стафф будет найден, а вероятность доехать до участка будет максимальной. Поэтому, если вы соблюдаете правило \"в кармане не более 1 штуки\", то вариантов два:\n\n1.Вы долго возитесь (поправляете стафф, снимаете ржавчину с места крепления) и упаковка у вас еще в руках, и вы видите, как рядом останавливается машина. Тогда берете стафф в карман, потом говорите, что только что снял, купил в интернете, это простой из двух вариантов.\n\n2\\. Вы только что заложили стафф, отходите от места делать фото, если еще не сделали или вовсе собираетесь уходить, и тут они! Это уже намного сложнее, потому как, чтобы вы не говорили, у вас в карманах ничего не найдут, и следующим шагом одного из полицейских наверняка будет осмотр места, которое вы фоткали, а вот там уже может найтись закладка. Если так, то роль ваша практически на 100% установлена, копы знают, что вы кладмен. В таком случае нужно конструктивно начинать вести разговор об откупе. Если клад шишки, то копы очень охотно работают с такими кладменами и как правило (на момент написания, все известные автору кладмены, работающие с натурпродуктом и попавшие на ППС откупались (в разных городах разные суммы) все заканчивается успешно. К химии все относятся в основном негативно, и наверняка есть такие полицейские, которые принципиально доставят такого кладмена в отделение. Но все-таки, наиболее вероятный исход и в этом случае -- откуп, только суммы потребуются несколько выше.\n\nВариант. Если на месте копы не отыщут закладку, она хитро примагничена или закопана так, что не сразу можно догадаться по следам где, то дальнейшие ваши действия зависят только от вашей психологической готовности. Если вы способны в такой экстремальной ситуации сделать лицо кирпичем и хладнокровно заявлять, что просто гулял, у меня ничего при себе нет, какие могут быть ко мне вопросы, то вас сразу же отпустят. Но если вы будете говорить то же самое, но нервничать, запинаться, краснеть и т.д., то это сделает только хуже, теперь вас точно обыщут с ног до головы или более тщательно проверят местность, которую вы фоткали. Поэтому, если не чувствуете уверенность, то говорите, что купил 2 грамма шишек в интернете, пришел, а тут ничего нет, мне сказали, что нужно фото сделать, вот я и делал в надежде на перезаклад. В таком случае картина будет целостной и вас наверняка попытаются раскрутить на \"мелкую взятку\".\n\nВ случае, если сотрудники ппс находят у вас более одного клада, то есть небольшая вероятность закосить под шкурохода, объяснив, что ходил и собирал все подряд, это было на соседних домах примагничено. Прикопано без следов земли тут не прокатит. Это может сработать, потому что в последнее время участились случаи приема шкуроходов, потому как они наиболее приметные персонажи во всей движухе.\n\n_Интеллектуальные системы.\\_ Вот и настал тот день, когда власти начинают применять высокие технологии в своей работе. Наиболее известная нам система \"Безопасный город\" уже полностью или частично внедрен в большинство крупных городов нашей страны. Помните СОРМ? Там дело касалось прохождения интернет и телефонного трафика, а здесь вашего физического перемещения. Смысл и цели те же -- выделить подозрительных личностей из общей массы, используя аналитику.\n\n**Проект «Безопасный город»** -- это программный комплекс с применением видеоаналитических решений, который помогает быстро определить и оперативно отреагировать на всякого рода нештатные ситуации, а также вовремя принять меры по устранению их последствий.\\\nДля контроля работы всех городских систем, обеспечения безопасности каждого жителя и всех уязвимых точек городской инфраструктуры, получения и архивирования информации обо всех важных событиях и оперативного предоставления этой информации всем заинтересованным службам реализована комплексная информационная система, способная аккумулировать, объединять, анализировать и группировать разнородные данные, поступающие от множества источников. Именно такую систему представляет собой «Безопасный город».\n\n_Типовые объекты контроля:\\\n*_ жилой сектор (подъезды, дворовые территории)\\\n\n*   муниципальные здания, школы и детские сады\\\n*   объекты промышленного и энергетического комплексов\\\n*   объекты транспортной инфраструктуры (проезжие части, остановки и салоны общественного транспорта, вокзалы и аэропорты, метрополитен)\\\n*   места массового скопления людей\n\n_Опасности:\\_ -Контроль передвижения с помощью системы Безопасный город. БГ представляет собой систему, в которую интегрированы различные системы безопасности государственных организаций (ГИБДД МВД, Метрополитен, камеры расположенные в общественном транспорте, на площадях, улицах, домах и их домофонах). Наиболее насыщенна камерами центральная часть города, соответственно районы расположенные ближе к МКАД имеют наименее большое количество камер.\\\n-Контроль передвижения камерами, расположенными на территории и зданиях коммерческих организаций. Несмотря на то, что данные системы безопасности не интегрированы в БГ информацию с данных камер могут беспрепятственно получить правоохранительные органы.\\\n-Транспорт, вычисление машины, на которой осуществляется передвижение.\\\n-Места закладок, и возможный физический контроль их сотрудниками правоохранительных органов.\n\n**Как можно не спалившись, попасть на полицейских.\\** Нередко случается так, что закладку находят сотрудники коммунальных служб, в этом случае они могут вызвать полицейских, которые могут провести дактилоскопическую экспертизу, и если ваши отпечатки есть в базе, то есть вероятность попасть в разработку. Также полицию могут вызвать любые прохожие или бабки, сидящие у подъезда, если им покажется, что вы слишком долго копаетесь в их клумбах. Бывали случаи, когда прохожие задерживали кладменов и вызывали полицию, мало ли у кого какие мотивы к этому. Выбирайте изначально места с небольшой проходимостью.\n\nЕсли вы следуете максимальной безопасности и выбираете глухие места для своих тайников, то в таком случае у вас появляется шанс на бегство, потому что в глухих дворах сложно быстро передвигаться на машине, и скорее всего, 1) вы поймете о приближении полицейской машины заранее и 2) будет больше пространства для маневра\n\nВ случае, если вы закладываете в первом доме от главной улицы, вероятность встретить ППС очень высока. Если вы закладываете быстро, то это конечно хорошо, но все же нужно учитывать и время подхода к месту и выхода из него, а если еще это секунд по 10 (бывают такие места), то судите сами, а если еще и в опасное время, то вот вам и очень высокая вероятность быть пойманным.\\\nЭто если допускать все вышеназванные ошибки. Но самое печальное в таком варианте будет то, что и шанса на побег практически не останется, машина подъедет быстро, выйдут патрульные и схватят, а если побежите, кто-то за вами, один на тачке поедет насколько это возможно, ведь вы же на первой улице, помните?\n\n**Можно ли скрыться с места преступления?\\** Да, можно, но для этого нужно учесть несколько моментов.\\\nДаже если патрульный проедет за вами на машине метров 200, то в режиме спринта это отнимет у вас много сил, и свеженький водитель будет иметь преимущество.\\\nЕсли вы придерживаетесь правил безопасности места, то глухие дворики, куда сложно заехать на машине, дают возможность определить опасность, а следовательно будет какая-то секунда-другая на то, чтобы оценить обстановку, и особо важными моментами будут: наличие пешеходной дороги в глубь и наличие дальше выхода. Если патрульный подъезжает со стороны, где вы еще не были и не знаете что там, то логично, что вы будете рассматривать вариант отхода по пути прибытия на место, и у вас в памяти будет свежая информация о том, что вас ждет, и в этом случае для принятия решения будет и время и географическая осведомленность, добавьте к этому понимание своих физических возможностей, и можно уже быстро спрогнозировать успех такого шага.\\\nВ случае, если патрульные подъезжают с неизвестной для вас стороны, то информации для принятия решения будет меньше, и действовать придется, более полагаясь на удачу. Отсюда правило, особо внимательно осматривайте при подходе к месту заклада именно неизвестные для вас стороны.\n\nСамое главное понимать, что побег -- это как all in в покере, спалились при закладе и убежали, прекрасно, сэкономили деньги на откуп и уберегли себя от неприятностей, если же бежали, но были пойманы -- сопротивление при задержании, как вы понимаете, совсем ничего хорошего.\n\n_Позаботьтесь об адвокате заранее._ Выбирать нужно тех, кто специализируется именно на похожих делах, чтобы был подтвержденный опыт. Ни в коем случае, не стоит связываться с теми, кто обещает и гарантирует выиграть для вас любое дело или надеяться на адвокатские конторы, которые, \"в случае чего\" дадут вам самого лучшего специалиста. Нет. Позаботьтесь об этом сами, ведь при вашем проколе, это очень может помочь.\n\n**Несколько слов об оперативной разработке**.\\\nЭто очень плохой вариант, когда вас изначально подозревают и заводят дело. Самое печальное, что во время разработки оперативники формируют доказательную базу, собирают улики, выявляют финансовые транзакции. В этом случае момент задержания не так важен, потому что для обвинения уже все собрано. Также нет смысла рассчитывать на откуп на месте.\n\n_В разработку можно попасть по ряду причин:\\\nСдал кто-то из своих._ Это самый распространенный вариант, если друзья из близкого круга общения употребляют ПАВ. Человек попадает в руки ментам с запретом, его хорошо запугивают, он рассказывает о знакомом, у которого всегда есть. Информация проверяется, подозрительная активность фиксируется, разработка начинается.\n\n_Обналичивание денег._ Мы уже говорили, что КИВИ-банк, обменники и фотохостинги активно сотрудничают с правоохранительными органами. Выводить деньги на именные карты очень опасно, особенно крупные суммы денег. Чем выше сумма единоразового перевода или ежемесячного вывода, тем больше вероятность попасть в зону финансового мониторинга.\n\n_Множество других вариантов._ Это, как мы уже говорили, может быть анализ интернет-трафика, снятые отпечатки пальцев с найденного дворником клада, анализ данных с камер, подключенных к системе \"Безопасный город\".\n\nКак выявить, что за вами следят? Есть явные признаки разработки: это наружное наблюдение, и разного рода пробивы, например левые звонки на телефон, могут придти на дом представители закона под видом жэка или социальных служб с тупыми вопросами. Здесь самое главное уметь объективно взвешивать все факторы, уметь находить причинно-следственные связи. Например, если вам недавно каким-либо образом угрожал человек, знающий о вашем употреблении или работе в сфере ПАВ, а потом на улице случайно подошел незнакомый человек с никчемным вопросом, а потом попытался разговориться, к вам зачастили проверять газ и электричество и все подряд, когда раньше такого не было. Выявить слежку непростое дело, а заработать паранойю гораздо легче, при том, что сам факт разработки исключать нельзя.\n\n**Если поймали**.\\\nВ первую очередь, нужно осознать, что у вас нет шансов и попытаться максимально хладнокровно рассуждать и действовать. Если копы принципиально отказываются брать взятку или же вы были в разработке, может по другим причинам, то легко из ситуации выйти не получится. Ваша цель как можно меньше сотрудничать со следствием. Обязательно будут пугать, угрожать, предлагать выгодные сделки, все это против вас, никакого содействия, будет только хуже. Если вы укажите на свои закладки, они пойдут отдельными эпизодами, если сдадите склад - тоже дополнительный вес, подельников - объединение в опг. Необходимо успокоиться и правильно оценивать ситуацию, взвешивать происходящие события. Бывали случаи, когда человека брали с 3г амфа, он сдавал склад около кг, вместо условного срока по приговору получал чуть ли не 15, из которых пару лет вычитали за сотрудничество.\n\n**Подведем итоги:\\** 1\\. Держим язык за зубами, никому ни слова о своей работе\\\n2\\. Используем отдельный комп или ноутбук для работы, не заходим с него никуда, кроме рабочих сайтов\\\n3\\. Подключаем VPN\\\n4\\. Не пользуемся фотохостингами\\\n5\\. Аккуратно выводим деньги\\\n6\\. Выбираем тихие места для заклада, подальше от людей и от дорог, изучаем местность\\\n7\\. Регулярно меняем район работы\\\n8\\. Имеем легенду, готовы четко ответить на любой вопрос ППСников\\\n9\\. Имеем сумму для откупа на случай неприятностей\\\n10\\. Знаем, к кому обратиться из адвокатов\\\n11\\. Не исключаем возможность оперативной разработки, если на то есть причины\\\n12\\. ВСЕГДА РАБОТАЕМ НА УЛИЦЕ АККУРАТНО И ВНИМАТЕЛЬНО"
		},
		{
			"post_id": 2,
			"title": "Упаковка и хранение",
			"date_published": 1542508050.388,
			"body": "**Упаковка и хранение**\n\nВ качестве упаковки мы рассмотрим два варианта. Оба они проверены времением и отвечают главным требованиям по обеспечению герметичности, не пропускают ни воду, ни запах.\n\nВариант 1\\. **Зиплок+фольга+изолента\\** Взвешиваем стафф и закладываем его в зиплок. Далее обертываем в фольгу, как бы заворачивая стафф в рулон, после чего делаем первый боковой слой изоленты и прижимаем его. Наносим основной слой изоленты. Если стафф крупный, то оборачиваем наискосок, как показано на рисунке, а если небольшой, то вторым слоем оборачиваем дно и верх.\\\nВ случае, если зиплок значительно превышает объем стаффа, необходимо сложить его и завернуть.\n\nКак видно, сам процесс не представляет собой никакой хитрости, все предельно понятно, но при этом, как я уже говорил, она не пропускает ни влаги, ни запаха, а также является очень экономичной по времени, если работать последовательно. То есть, сперва только упаковываем в зиплок, потом все зиплоки оборачиваем в фольгу, а потом все в изоленту. Так у вас все движения будут однотипными, довольно точными и быстрыми.\n![](https://pp.userapi.com/c851428/v851428196/33950/wTGzQ1z3Wl4.jpg)\n\nВариант 2\\. **Термоусадочные трубки**.\\\nНаборы продаются разных цветов и диаметров, но также можно покупать и отдельно необходимый диаметр в метрах.\\\nПри использовании трубок тонкого диаметра, упакованный стафф будет иметь продолговатую форму (как в нашем примере), это хорошо для прикопов, потому что когда покупатель будет выкапывать свой клад, вероятность того, что он его просто не заметит сводится к минимуму.\\\nТрубки большого диаметра хороши для упаковки стаффа более крупного веса.\n\nИ так нам потребуется:\\\nЗажигалка\\\nТермоусадочная трубка\\\nПлоскогубцы\\\nЧопик (им легко пропихнуть пакет с содержимым, если используем небольшой диаметр трубки)\n\nВзвешиваем стафф и закладываем его в зиплок. Плоскогубцами зажимаем кончик трубки и опаиваем кончик до сжатия и сплавления. Далее сворачиваем в трубочку пакетик с содержимым, и пакуем пакетик с содержимым в подготовленную трубочку, при необходимости проталкиваем чопиком до упора. В завершении с помощью плоскогубцев и зажигалки запаиваем трубку.\n![](https://pp.userapi.com/c851428/v851428196/33957/kgn1Nc-CO-Q.jpg)\n\n_Совет. Используйте различный цвет изоленты и термоусадочных трубок, если собираетесь раскладывать разный по составу или фасовке стафф. Это поможет вам ничего не перепутать, а также, в случае проблем с нечестными покупателями даст возможность разобраться в ситуации. То есть, если вы в описании не указываете какого цвета пак, то вы всегда можете его спросить об этом. Например, покупатель заплатил за 2г, а утверждает, что получил один, вы задаете вопрос, какого цвета был пак, и по его ответу делаете вывод. Меняя цвета от заклада к закладу, вы тем самым не даете возможности подготовить ответ на такой вопрос._\n\n**Особенности фасовки и упаковки некоторых веществ**.\\\n_Шишки._ Большие объемы. Например, непрессованные 5г будут выглядеть внушительно, и много такого стаффа с собой особо не потаскаешь в потайных местах. Но по упаковке все стандартно.\\\n_Гашиш._ Основная проблема состоит в его фасовке. Для нарезки лучше всего использовать опасную бритву (можно удалить ручку) подогревая ее перед использованием.\\\n_Порошки._ Обычно с ними проблем не возникает, разве что с острыми комочками (в редких случаях), которые могут проткнуть зиплок. Следите, чтобы этого не произошло. Также у некоторых бывает очень сильный запах, но это личные неудобства.\\\n_Марки._ Это самый мелкогабаритный незаметный стафф. Смысл упаковки такой же, только используется минимум упаковочного материала.\\\n_Таблетки, капсулы._ Упаковка стандартная.\n\n**Хранение**.\\\nВажный вопрос хранения ПАВ - где прятать. Принципиально отличные друг от друга варианта, дома или за его пределами.\\\nГлавный недостаток хранения дома, это риски, связанные с тем, что если попадетесь ментам на мелочи, они вероятно проведут обыск важего жилища, и если найдут крупные размеры стаффа, очевидно, это не пойдет вам на пользу. Также, если проживаете не один, нужно учитывать этот факт.\n\nХранение крупного веса вне дома можно организовать с помощью тайников (неподалеку) или же использовать съемную квартиру, где можно спокойно заниматься фасовкой и упаковкой. Тайник не отменяет того, что фасовку вы, вероятно, будете проводить дома, а значит, в случае совместного с кем-то проживания этот момент никуда не исчезает. В случае съемной квартиры, будьте приветливы с соседями и не давайте им повода вас в чем-то заподозрить."
		}
	]
}