{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1519459714_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "> [helium](#comment_1_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): It seems to me that the ordinary ls on Linux already does that, without any extra parameters. A command  [...]\n\nHi, I just want to have the rule what not to delete, what to delete and which file/directory matters what.\n\nPS: \" ls | grep -E ^. \" <--- what is it good for? FYI, I am a master of bash command, but a poor guy in zeronet directory structure.",
				"added": 1519463596
			},
			{
				"comment_id": 2,
				"body": "> [helium](#comment_2_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): It's good for getting a different text layout at the screen, when not redirecting ls output to a file. The difference is visible, if You compare the console outputs of  [...]\n\nJust tiniest difference from $ ls -1, isn't it??",
				"added": 1519464274
			},
			{
				"comment_id": 3,
				"body": "> [helium](#comment_2_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): It's good for getting a different text layout at the screen, when not redirecting ls output to a file. The difference is visible, if You compare the console outputs of  [...]\n\nTry this one: ls -1 | egrep -f <(ls -1 | sed '0~2 s/.*/\\$/')",
				"added": 1519465360
			},
			{
				"comment_id": 4,
				"body": "> [helium](#comment_4_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): Than You for the reply and thank You for the interesting example.I guess, different people do have different ways to process text :-D\n\n$ ls -lhtra | cat\n\nI sometimes do this when I ssh-connects to the server since sometimes I feel tired of seeing the resulted lines with background-highlighted in dark green, but with the above command I get simple black and white characters on the screen :)",
				"added": 1519567620
			},
			{
				"comment_id": 5,
				"body": "> [helium](#comment_5_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): If You place the following line  [...]\n\nThank u, helium. But I don't want to add any more aliases in my life if possible. ^^",
				"added": 1519602369
			}
		]
	},
	"comment_vote": {}
}