{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1547238715,
			"title": "Help Reassessing Tools and OS Recommendations of Privacytools.io",
			"body": "We are trying to start an 2019 update of privacytools.io.  If anyone would like to give their input on privacy tools for the new year, sectors and services to watch (hosted and self-hosted).  Lets talk about them.",
			"added": 1547238714
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1547238715_1P2V8C9A6T8ExWibrWqPdLoBnm5DnKMQe9": [
			{
				"comment_id": 1,
				"body": "Privacytools.io is a website that outlines tools, OS and information about mass surveillance and how to combat it.",
				"added": 1547306272
			},
			{
				"comment_id": 2,
				"body": "> [robione](#comment_151_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): http://confidantmail.org/ - CM is great for an SMTP alternative and unlimited file size attachments. Combine it with a good on disk encryption and it's pretty hard to beat.\n\nThis is a great one thank you.  It is really important when talking about these tools to keep it a collaborative conversation.  My years in the privacy and security industry I had never heard of this one.",
				"added": 1547306600
			},
			{
				"comment_id": 3,
				"body": "> [robione](#comment_159_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Did you just recently add CM was was it there before? It seems to be missing from some of the other categories it could be in. [...]\n\nI set up ZeroMail. Still getting introduced to ZeroNet.  Thinking about moving CM to a card or more prominent space.",
				"added": 1547509319
			},
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_638_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I think this is a hype. The page you linked is outdated and from what i found here, the issue with google analytics being used on about:addons page (and data was claimed to be anonymized) is no longer issue when DoNotTrack is enabled (and i think every privacy oriented person has this by default, check this page: about:preferences#privacy)\n\njames007 is not hyping it there are at least 10 references of firefox sending data back to google in about:config. This is my quick list for helping users understand:\n\nPreparation:\n\n    Enter \"about:config\" in the firefox address bar and press enter.\n    Press the button \"I'll be careful, I promise!\"\n    Follow the instructions below...\n\nGetting started:\n\n    privacy.firstparty.isolate = true\n        A result of the Tor Uplift effort, this preference isolates all browser identifier sources (e.g. cookies) to the first party domain, with the goal of preventing tracking across different domains. (Don't do this if you are using the Firefox Addon \"Cookie AutoDelete\" with Firefox v58 or below.)\n    privacy.resistFingerprinting = true\n        A result of the Tor Uplift effort, this preference makes Firefox more resistant to browser fingerprinting.\n    privacy.trackingprotection.enabled = true\n        This is Mozilla's new built-in tracking protection. It uses Disconnect.me filter list, which is redundant if you are already using uBlock Origin 3rd party filters, therefore you should set it to false if you are using the add-on functionalities.\n    browser.cache.offline.enable = false\n        Disables offline cache.\n    browser.safebrowsing.malware.enabled = false\n        Disable Google Safe Browsing malware checks. Security risk, but privacy improvement.\n    browser.safebrowsing.phishing.enabled = false\n        Disable Google Safe Browsing and phishing protection. Security risk, but privacy improvement.\n    browser.send_pings = false\n        The attribute would be useful for letting websites track visitors' clicks.\n    browser.sessionstore.max_tabs_undo = 0\n        Even with Firefox set to not remember history, your closed tabs are stored temporarily at Menu -> History -> Recently Closed Tabs.\n    browser.urlbar.speculativeConnect.enabled = false\n        Disable preloading of autocomplete URLs. Firefox preloads URLs that autocomplete when a user types into the address bar, which is a concern if URLs are suggested that the user does not want to connect to. Source\n    dom.battery.enabled = false\n        Website owners can track the battery status of your device. Source\n    dom.event.clipboardevents.enabled = false\n        Disable that websites can get notifications if you copy, paste, or cut something from a web page, and it lets them know which part of the page had been selected.\n    geo.enabled = false\n        Disables geolocation.\n    media.eme.enabled = false\n        Disables playback of DRM-controlled HTML5 content, which, if enabled, automatically downloads the Widevine Content Decryption Module provided by Google Inc. Details\n        DRM-controlled content that requires the Adobe Flash or Microsoft Silverlight NPAPI plugins will still play, if installed and enabled in Firefox.\n    media.gmp-widevinecdm.enabled = false\n        Disables the Widevine Content Decryption Module provided by Google Inc., used for the playback of DRM-controlled HTML5 content. Details\n    media.navigator.enabled = false\n        Websites can track the microphone and camera status of your device.\n    network.cookie.cookieBehavior = 1\n        Disable cookies\n        0 = Accept all cookies by default\n        1 = Only accept from the originating site (block third-party cookies)\n        2 = Block all cookies by default\n    network.cookie.lifetimePolicy = 2\n        cookies are deleted at the end of the session\n        0 = Accept cookies normally\n        1 = Prompt for each cookie\n        2 = Accept for current session only\n        3 = Accept for N days\n    network.http.referer.trimmingPolicy = 2\n        Send only the scheme, host, and port in the Referer header\n        0 = Send the full URL in the Referer header\n        1 = Send the URL without its query string in the Referer header\n        2 = Send only the scheme, host, and port in the Referer header\n    network.http.referer.XOriginPolicy = 2\n        Only send Referer header when the full hostnames match. (Note: if you notice significant breakage, you might try 1 combined with an XOriginTrimmingPolicy tweak below.) Source\n        0 = Send Referer in all cases\n        1 = Send Referer to same eTLD sites\n        2 = Send Referer only when the full hostnames match\n    network.http.referer.XOriginTrimmingPolicy = 2\n        When sending Referer across origins, only send scheme, host, and port in the Referer header of cross-origin requests. Source\n        0 = Send full url in Referer\n        1 = Send url without query string in Referer\n        2 = Only send scheme, host, and port in Referer\n    webgl.disabled = true\n        WebGL is a potential security risk. Source\n    browser.sessionstore.privacy_level = 2\n        This preference controls when to store extra information about a session: contents of forms, scrollbar positions, cookies, and POST data. Details\n        0 = Store extra session data for any site. (Default starting with Firefox 4.)\n        1 = Store extra session data for unencrypted (non-HTTPS) sites only. (Default before Firefox 4.)\n        2 = Never store extra session data.\n    network.IDN_show_punycode = true\n        Not rendering IDNs as their Punycode equivalent leaves you open to phishing attacks that can be very difficult to notice. Source\n    extensions.blocklist.url = https://blocklists.settings.services.mozilla.com/v1/blocklist/3/%20/%20/\n        Limit the amount of identifiable information sent when requesting the Mozilla harmful extension blocklist.\n        Optionally, the blocklist can be disabled entirely by setting extensions.blocklist.enabled to false for increased privacy, but decreased security. Source",
				"added": 1547563233
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_639_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I checked that about:config page, searching \"google\" and NOT found yours mentioned 10 entries indicating sending data to Google. If you mean Safe Browsing service, it can be disabled in Firefox options and i doubt Firefox is sending any really sensitive data to G. But thanks for posting it, because it is interesting to know that Google can be contacted and asked if certain site is malicious or not. Yours quoted text also does not show that there is some sensitive information transfer to Google.\n\nSorry for being unclear.  I think firefox knows that if their users saw google in any part of the config they would have a huge problem.  So they use google services under other names like browser.safebrowsing.malware.enabled.  \n\nJust thinking of the way most browsers I know work, in order for them to be able to tell you if a site you visit is safe or not they have to know what sites you are visiting.  That is where I believe google is being sent the information on the settings I posted below.  I  personally wouldn't want any information going to google about my browsing habits and others feel the same hence the creation of the pasted tutorial on how to stop it.  \n\nThe fact that config and settings are two different things is kind of weird too.  I feel in open source tools something shouldn't be set up in this manner.  I thought settings were all I could control until i found out about about:config.",
				"added": 1547571812
			}
		]
	},
	"comment_vote": {
		"151_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1
	}
}