{
	"next_topic_id": 22,
	"topic": [
		{
			"topic_id": 1,
			"title": "怎么没几个人就有五毛狗了",
			"body": "零网能走多远？retroshare看起来比tox功能多，没有公开电驴都不如，好像没有介绍人不能用，一个p2p网站，论坛搜不到建了也发不了，除非你有已经熟人愿意参与这个。",
			"added": 1519641600,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "为什么犹太教变种能传播那么广，这其中包括共产",
			"body": "世界上都是×××创造的，最终都是×××的，×××要枪回被×××抢走的部分，共产，旧约，一模一样教义为什么新瓶装旧酒能反复骗。很多人误以为犹太人擅长是经商，《上帝选择犹太人——一个游牧民族如何改变了世界》说，古以色列的活动是抢劫，最著名的抢劫者就是所罗门，以抢的多出名。在连通埃及与欧洲交通要道抢劫。《新约》是罗马的希腊人写的，也是罗马捕获并杀死耶稣后仍无法组织其在罗马的传播，为了改变教义，召集希腊学者写了《新约》，并将耶稣定为神。",
			"added": 1519649936,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "tox如果能支持p2p搜索陌生人，公众号可能能大大增加使用人数",
			"body": "当然是愿意公开部分信息的人，搜索陌生人，让软件对极少意愿使用这个新社交软件的人，变得有用。公众号是自发的内容提供者，有希望成为自媒体扩大自身影响的，也有希望获取信息的。能让新软件扩大用户群。",
			"added": 1519654960,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "中国经济的末日乱象：中央苏区重演（转载）",
			"body": "\"同志们都知道,中央苏区最后不能坚持而被迫万里长征,除了路线错误之外,其中最重要的原因之一,就是财政的枯竭,人力物力财力的枯竭,几乎到了山穷水尽的境地 ——舒同\n\n全民炒房、全民放高利贷到全民炒股，中国经济一派末日乱象。乱象的背后是中共的操控，继摧毁农业和工业后推动发展金融业，引导民众入股市进行剪羊毛，权贵则集聚更多资金，为逃离做准备。\n\n历史上，这种操作方式已多次使用，1931-34年的中央苏区最为典型。今天中国跟当时苏区的操纵模式类似，只不过当年苏区规模较小，操作手段简单，一目了然，今天的操作手段隐蔽性较强。\n\n中共在苏区的基本手段是打土豪分田地。中共抢劫地主后把金银货币集中自己手里，把土地分给农民。分地前，中共缺乏农民支持到处流窜；分地后，农民大力支持中共积极参军。由此中共获得固定区域，建立固定的统治机构，逐渐扩大地盘，进而形成苏维埃统治区，也就是苏区。\n\n1931年3月，中央苏区刚建立，新土地法草案出台，明文规定“地主不分田，富农分坏田”。1931年11月，苏维埃共和国成立，又颁布新土地法令，各苏区又依据新法令陆续查田分田，又发起分地斗争。\n\n三次分田地后，中共为了稳定民心，保证说自此后的土地，农民有买卖、租佃之权，不分配了。但是1933年初，临时中央迁来江西中央苏区，强调要弄成“一个剧烈与残酷的阶级斗争”，很快发动新一轮查田运动，分地斗争更加激烈。\n\n虽然土地革命有效发动农民，但无法解决农村日益衰败。为保持农民革命积极性，只有不断的反复实施分地，称为翻饼。在苏区的不同区域，实施一年一次，乃至一年两次、三次，不停打土豪分田地。1933年，王明撰文《中国苏维埃政权底经济政策》，批评中央苏区的翻饼行为，指出“有一种现象阻碍苏区农业生产的振兴，这就是再三不断地重新分配土地”。共产国际执委会也曾致电中共中央，要求避免重新分田。但是，翻饼反而越来越狠。多次翻饼后，种田收成勉强达到温饱线的农民也不可避免被划成地主。农民丧失种粮积极性，粮食产量大幅降低。田地分来分去的结果是苏区的农业崩溃并引发饥荒。\n\n苏区还大规模征粮，以供养庞大的机关和军队。粮食产量更少而征粮更多，苏区从自足有余逐步陷入饥荒。生活状况急剧恶化，当地农民纷纷逃亡到国统区讨饭。部分农民组织起来，袭击苏区的中共基础单位。1934年，民众不再积极参军，大量开小差，军官也开始逃跑，甚至司务长带着伙食逃跑。\n\n工业制造也崩塌。中共占领县城后，以共产（充公）的名义把工厂据为己有，民众私产变成党产。例如，中共攻占福建龙岩的汀州府后，征缴工商业变成公营工厂和合作社。布厂、红军斗笠厂、汀州弹棉厂、四都兵工厂、濯田炼铁厂、熔银厂、造船厂、熬盐厂、砖瓦厂和造纸厂等等，成为苏区的骨干工业体系。另外，还把造船、农具、织袜、铸锅、雨伞、油布、烟丝、染布、陶器、制糖、榨油、锡纸、硝盐、樟脑、竹器、木器、砖瓦、缝衣、竹篓、造纸等各种私人作坊变成生产合作社。\n\n工厂实施国有工业军事化管理。厂长发挥不了作用，工厂管理混乱，浪费严重，产品质量低劣。到1933年，工厂亏损严重，已经无法生产出合格的产品。中共领导人对工业管理一无所知，面对混乱局面束手无策。后来，刘少奇到工厂调查后撰写了《论国家工厂的管理》，提出国有工厂实行厂长负责制、成本核算制和计件工资制。1934年4月，中央人民委员会制定和颁布《苏维埃国有工厂管理条例》。但是无法解决根本问题，仅仅减缓倒闭速度而已。合作社存在同样的问题，面临倒闭潮。\n\n另外，苏区对个体工商户的税收日益严厉，导致个体商户难以生存。\n\n工厂、作坊和个体工商户全面崩溃，军需物资匮乏，民众生活日用品短缺，生活艰难。\n\n而对于中共，通过金融系统搜刮金钱则是工作的核心。早在1930年10月，赣西南特委书记刘士奇在给中央的信中说到，由于外部对当地经济封锁，已无土豪可打，同时耗费甚巨，均感困难，惟东古银行票币甚行畅销，几乎每天能印几万，都能销出。中央闻之大喜，迅速推广经验，大量印刷纸币。\n\n1930年11月21日，中共总前委发出“立即动手出票子”的号召，命令下属各苏区大量印刷苏区纸币。江西省苏维埃政府于1930年11月27日发出《秘字第四号通令》：“本政府为要取得这一决战的胜利，当然要准备充分的经济，为了这一决战的胜利之需，因此本政府财政部以一百万现金创设大规模的江西工农银行，同时财政部为着要使金融有广泛的流动，使革命群众与红军在经济上有绝大的充裕，因此发行钞票一百万元。”从此，苏区开始重视金融系统建设，操控货币实施搜刮。手段主要包括：印刷纸钞、铸造假银币、吸收存款以及发行公债。\n\n中共通过金融系统，大规模搜刮社会中的硬通货。最初设立东固平民银行，银行基金（股本）主要来自四方面：一是向东固地区的党员、干部借贷；二是由当地的社会公堂及富有之家捐助（强捐）；三是在区委的革命活动经费中借贷；四是开展银行储蓄，宣传动员革命群众向银行存款。1929年春，银行基金扩大到8000元，发行纸币2万元。基于东固银行的成功经验，各苏区纷纷建立银行，吸收存款，同时加大纸币供应。\n\n1934年3月，苏维埃国家银行成立，开办储蓄存款业务。据记载，当年仅瑞金支行就吸收存款2600万元(均为银圆)，规模极大。中央苏区还先后发行三次公债，其中两次为1932年发行的战争公债，共180万元。1933年8月，又发行300万元经济建设公债。根据苏区宣传，该公债的发行是基于“苏区经济的困难日益加重，为了保障红军给养，改善工农群众生活，争取粉碎敌人围剿”。\n\n通过这些方式，中共吸收银元发放纸币，最终把民众手中的硬通货，基本都变成了纸币。\n\n1934年下半年，苏区进入三光状态： 粮食吃光，工业产品用光，硬通货花光，民众只有手里的纸币、银行存款和债权以及债券。中共作为寄生在当地经济的群体，在三光和饥荒里无法维持统治，加上国民党围剿，只好带着搜刮来的银元和金条和国民党的纸币逃亡，也就是开始长征。\n\n留下苏区民众陷入绝对贫困状态。农业秩序完全打乱，工厂的工业设备被拆走损毁，作坊和商业全面破产，硬通货被席卷一空，过去的积累全部被掠夺，资源也被破坏殆尽。至今80年过去，老区依然是穷困落后的代名词。\n\n2015年的中国大陆，正在重演1934年中共从苏区逃跑前的情景。首先，农业崩溃，粮食供应短缺。农民种粮不仅不赚钱，还经常亏损，农民已经不把种粮当营生，仅仅种点口粮。铁公基、房地产和产业集聚区大肆扩张，大量宜耕土地被侵占或者污染，难以恢复耕种。过度使用化肥农药，地力严重退化，产出能力日益降低。如果没有大量进口粮食、地沟油和瘦肉精、化肥农药、转基因等支持粮食供应或者生产，中国的粮食危机早已开始。\n\n其次，实体大量裁员和倒闭。人民币外升内贬，造成中国制造业成本日益高昂，出口陷入绝境。在国内市场， 2015年春节后，多数铁公基和房地产项目停工，建筑业基本停滞。与建筑相关的制造业处于倒闭边缘，包括钢铁水泥建材有色金属等；相关服务行业大量裁员或关门。出口和建筑相关产业占据中国经济的绝大部分份额，既占据巨大的资金，又雇佣大量劳动力，随着上述两类行业萧条，工商业也进入崩溃阶段。\n\n第三，金融是最后的操控和掠夺。中国的外汇储备模式与苏区的货币发行实质相同，在苏区，只要人们从事经济交易，就必须把手中的金银换成苏区纸币。二战后的国际经贸中，美元取代金银成为国际流通的主要硬通货。要和中国做经济交易，则必须拿中共发行的人民币作为媒介，进入中国的个人或者企业，必须把美元等国际货币交给外管局，然后外管局发放人民币给对方，最后，外汇都集中在中共手中，如同苏区的金银控制在中共手中。\n\n在中国经济中，中共除了与美元匹配进行人民币印钞外，还自行印钞，通过银行在社会中发行。自行印钞的模式与苏区时也相同，中共拿着几乎无成本的纸币，在社会中任意采购消费。\n\n外储表面上是中共控制的资金，但实际上并不真正归中共所有，而是归属进入中国的个人或企业。正规渠道进入中国的外资，中共承诺未来撤资时，把人民币兑换成美元还回去。\n\n外储机制和承诺的特点是今天中国和苏区的重要差别。苏区时代，中共获得金银后，一方面用于和国统区交易购买物资，另一方面藏匿起来供以后逃跑时用。今天，中共获得外汇后，一方面与苏区时类似，用于购买国外的原材料和产品或者对外投资，另一方面，中共无法藏匿美元等外汇，只能把存在国外银行，或者购买美债等外国政府债券或者企业债券。这意味着中共持有的硬通货透明化，不能像金银随身携带逃跑。基于中共在加入WTO时的承诺，中国居民每人每年有5万美元额度外汇兑换，所以，中共既无法完全卡死外汇兑换，也无法整体转移资金。\n\n中共加强金融炒作，尽可能吸干民众手中的人民币。由于国际规则的约束，中共如果敢对居民实施严厉的外汇管制，国外可以直接冻结中共的所有外储。所以，中共采取通过宣传和炒作，让民众手中都变得没钱，这样也就无法和中共争换外汇。这其中的措施里，最具吸金作用的就是房地产。通过对房价的拉抬以及各种宣传，引发民众的跟风买房继而炒房，大量民众把积蓄投资房产，还大量按揭贷款，也就是未来的资金也要交给银行。\n\n银行看到地方政府和房地产面临极大风险后，积极推出理财产品，以相对高的利率吸引民众资金。民众不能像银行存款那样提前支取理财产品款项，如果理财产品到期违约，意味着买理财产品的人遭受损失。在政府的鼓励下，各地高利贷又盛行起来，很多民众把救命钱都拿去放高利贷。随着高利贷到处爆破，大量民众返贫。另外，网上高利贷也在政府鼓励下迅速扩大规模，这一轮掠夺又能消灭一些资金。一轮轮集资后，民众现金所剩无几。\n\n股市成为最后的吸金主战场。2014下半年开始，股市再一次被聚焦，资金大规模进入爆炒。随着股市上涨，越来越多中小散户跑步进场，投资额也越来越大。在美指大幅上涨、外汇加速离开中国的背景下，股市上涨可以看作是中共抵御资金外流的一个关键手段。工商业全面溃败，楼市面临不可阻挡的下跌，没有新的获利热点，资金大规模逃离中国，民众也恐慌换购美元，很容易导致外储崩盘。股市的火爆炒作，让民众有了新的关注点，减弱换美元的积极性。\n\n与此同时，实体经济正在经历倒闭潮，股市上涨完全脱离基本面，注定难以持久。股市上涨中，大户资金逐渐出货，大量中小散户接盘。而且炒作资金中存在大量融资盘，一旦股市流出资金超过流入资金，市场下跌，很容易出现多杀多的局面，这意味着股市崩盘，中小散户被血洗，自然也无钱再换美元。\n\n在民众买房炒房、买理财产品、参与高利贷和炒股时，资金不断流向权贵和富人。这些人早知危机，提前安排家属携带资金转移海外，趁最后的疯狂再捞一把，再火速换购美元出逃与家人汇合。\n\n跟当年中央主力撤退后的苏区一样，权贵富人携带资金跑路之后，留下满目疮痍的中国。空气污染，土壤污染，水资源匮乏，粮食极度短缺，实体倒闭，商业凋零，金融崩盘，人们在艰苦的环境里为基本的生存而搏杀。",
			"added": 1519705964,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "假如路金所如果出事，五毛狗还是会跳出来说受害者贪婪，活该",
			"body": "地方城投债要赖帐时，它们这么说，云南省委背书的泛亚，还是一样。平安做后台，会不会，路金所倒，平安无事？",
			"added": 1519707141,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "城管都欠薪，找五毛肯定也要用免费的。",
			"body": "云南第三女子监狱举办2010年度通讯员、网络评论员培训班 像这种培训班不知道有多少",
			"added": 1519712673,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "正如牛顿第一定律所描述的那样，一种制度总是会抵制其在目前方向中出现的任何变化。",
			"body": "假如称帝时候就由不得人怎么想了，反复怕丢掉权力被报复，于是要握紧权力，一种叫骑虎难下的强制力。权力给人戴来多大的安全感，失去时就有多大的危险。所以不要抱幻想，朝鲜化、非洲化、不是危言耸听。",
			"added": 1519804660,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "梁启超《与令娴女士等书》，《苏联间谍在中国》新黎民， 《历史的先声》序——革命压倒民主 李慎之。",
			"body": "按照顺序观看，非常流畅",
			"added": 1519806715,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "从大量的垃圾数据里筛选所需信息，还得人力筛选",
			"body": "以前在VeryCD找中文电子书，每天更新好多有价值的。现在图书版发布的都是只要看标题介绍就知道是厕纸不如的书。\n豆瓣书简介还不支持多标签搜索，据说以前支持。后来倒退了",
			"added": 1519976620,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "丛林国家这个词这里有人认识吗？还有匪帮",
			"body": "谎言帝国里能出现傻逼毛左批判《通往奴役之路》,实在不想这种人来什么辩论。有兴趣留qtox的id，qtox无需注册，随时删号。id是和种子的hash差不多作用",
			"added": 1519995327,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "周恩来原名周志荣，家庭是出身绿教徒，改信基督以后改名周恩来",
			"body": "在facebook上搜索时，一个基督教的人说的，证据就是，因为“恩来”是《圣经》里摘出来的。",
			"added": 1520062398,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "刘仲敬这种绿教猪跑出国，怎么还有人一直在转它的文章？",
			"body": "他是绿教猪证明太多了，包括中国文化起源于绿教猪，等等。墙内胡锡进这种知名绿教猪，有人转不奇怪，用臆造词“非拉”代替好像是顺民的意思，结合它是绿猪一看，这他妈不是”咖啡了“吗？所谓那些文人里也那么多绿猪？",
			"added": 1520249691,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "阎崇年这种满族畜生在ccav公开洗地扬州十日屠，嘉定三屠，谁在侮辱底层，看看辫子戏还不明白吗？",
			"body": "谁在侮辱底层，看看辫子戏还不明白吗？满族这种垃圾自诩贵族，它们会做什么不很清楚吗？不——这些畜生很多人确实掌握了实权。辫子戏那么多就是铁证！还有计生委的满族，共产本来用来用作异（游牧民族）族统治的，谁在学校宣传狼图腾这种赞美畜生游牧民族的垃圾书？没有实力，这种垃圾书能有那么大影响？",
			"added": 1520422811,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "大跃进至少饿死3000万没有倒，历史从来没有所谓“农民起义”“民心”",
			"body": "红色高棉屠杀其所在国三分之一人口，还是被越南推翻的。历史上推翻上个朝代，建立下个朝代的基本都上个朝代官员，从周武王，五霸七雄，三国，五代十国，隋文帝，李渊，赵匡胤，一直到袁世凯，甚至毛腊肉，不是说牛说横是说好，儒家——防民甚于防川，（防民比防洪更重要）。韩非子——明主治吏不治民（明白的君主会下功夫修理官员，而不是被防民这种假话欺骗）",
			"added": 1520423613,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 15,
			"title": "有意的谣言——只有电离辐射有危害，首先X射线和伽马射线都是电磁辐射，电磁波，紫外线致癌原理可搜索",
			"body": "因为产生辐射源的大多是官有单位。所以才有这种用谣言“辟谣”\n高压线与儿童白血病的关系，可以查阅有关资料，长期接触x射线，其结果也是白血病。\n一个大多数人不知道的知识，有个家用电器是可以产生x射线的。\n电视显像管玻壳是什么\n采用含铅量（PbO）玻璃，所以发黑，达21%以上的高铅玻璃以吸收75%—80%的X射线。",
			"added": 1520686519,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "wpa2协议破解了？是不是有了跑字典以外的方法破解？",
			"body": "跑字典成功率太低，而且对方一旦改密码，就白费了。",
			"added": 1520854062,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "没想到包子终身没遇到任何阻力，官员群体面对“枪杆子”还不如\"黔之驴\"",
			"body": "\"黔之驴\"是腊肉形容\"知识分子“的，估计文官团体反包子的也不少，”多数人“干不过”少数人“，且不说包子能否达成三胖坚持至今一样的奇迹，初中生多次扯遮羞布的事件可是古今以来的进步。",
			"added": 1521781306,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "tox本身用户就少，没群组搜索怎么认识陌生人？",
			"body": "记得以前百度贴吧不要手机号时，某个已经被封的贴吧有人在公共图书馆发帖，都被五毛狗点名恐吓。还查什么，移动设备过滤无线网络，为几毛钱还真拼。",
			"added": 1523419781,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "把irc整合进tox的客户端是什么？",
			"body": "好像有人说有这种软件？",
			"added": 1523607420,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 20,
			"title": "把irc整合进tox的客户端是什么？",
			"body": "好像有人说有这种软件？",
			"added": 1523607433,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 21,
			"title": "retroshare加不上好友显示离线怎么回事？自己两台电脑连同一个网都不行。",
			"body": "DHT绿灯，右边有网络数字有1.5k,qtox不管是这里的id，还是局域网只要在线都是一几秒就加上了，局域网更快，几乎秒加。一样技术，，官网给的节点，ping通的ip，显示离线怎么加都加不上。",
			"added": 1525274398,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 50,
	"comment": {
		"2_12v4reBZbKrP3m6Ceiz7YR4ahPKQBg5ATt": [
			{
				"comment_id": 1,
				"body": "最大的问题是怎么跑？",
				"added": 1519641814
			},
			{
				"comment_id": 2,
				"body": "楼主肯定不知道丛林国家这个的意思",
				"added": 1519641922
			}
		],
		"33_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU": [
			{
				"comment_id": 3,
				"body": "朝鲜那么胡搞也没垮掉，非洲那些国家怎么胡搞也都没垮，别以为自己是什么锦囊妙计诸葛孔明，常州毒地出事的是外国语学院类似贵族学校，才有声音传出。辱母案欠账的是县长老婆，也才有声音。有了网，土匪政府治下也没有有平等。想象非洲，想想朝鲜，会好受点，虽然以后可能就是朝鲜非洲的样子。",
				"added": 1519648354
			}
		],
		"2_1Eq1e59rNgEmdsRqdpfN3eqqPapA57wE7r": [
			{
				"comment_id": 4,
				"body": "最有钱的是官员，你斗谁？官员联手，包子不也认怂了？还阶级，要真有阶级，自古，统治阶级、权力阶级是第一阶级。知道土匪这个阶级的有很多",
				"added": 1519648763
			}
		],
		"1_1B8mFJ7QazWvzGE7jkQHv22tEiqDspjyFU": [
			{
				"comment_id": 5,
				"body": "这个东西要互相加对方，而且没有公开分享的功能，网站、论坛、文件、公众号、想公开都不行，没有一个介绍人。什么都不行，单说聊天，还不如tox，tox随时可以换号",
				"added": 1519654078
			},
			{
				"comment_id": 6,
				"body": "试用了一下发现可用节点为零。只有中间一个点，没有一个你知道的愿意领你进去的封闭网络内部的人，它几乎不能用，没有任何内容。",
				"added": 1519655183
			}
		],
		"2_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 7,
				"body": "有没有网盘可以上传,chm，pdf，txt，的电子书？收了很多扫描版。百度网盘一不能用，发现没有可用的了。",
				"added": 1519655945
			},
			{
				"comment_id": 8,
				"body": "《上帝选择了犹太人:一个游牧民族如何改变了世界》这本书可以直接搜。\ned2k://|file|%5B上帝选择了犹太人：一个游牧民族如何%5D.%28美%29托马斯·卡希尔.扫描版.pdf|5012662|44d6183bfa08e162780c25c44c80ec6f|h=yvezmsd7kutk6lwfci4o6ywib6xefh5j|/\n\n有人分享过50本商业巨著里面有介绍，先知马克思，与选民，概念的。摘出来的 谷歌只搜到这个应该是书里摘出来的。\n\n“历史规律不可抗拒不可抗拒”——在马克思主义中，犹太教的“上帝”概念被“物质”概念所替换，“上帝不可抗拒的意志”被“不可抗拒的历史规律”所替换了。“唯上帝论”与“唯物论”，需要有唯心与唯物的差别，但在绝对主义这个意义上，它们是完全一致的。\n　　第二个要素——无产阶级——新时代的选民，新生产力的承担者，资本主义掘墓人，承担着摧毁资本主义建立共产主义的特殊使命。马克思主义中，犹太教的“选民”由“犹太人”变成了“无产阶级”。\n“上帝选择了犹太人”与“历史选择了无产阶级”，在选民意义上是同一的。\n直到今天，政府的文件里还习惯用“历史选择了”这样的词语。 \n\n先知马克思\n上帝god（上帝意志） ——物质（客观规律）\n选民（犹太人） ——无产阶级（工人阶级）\n救世主（弥赛亚） ——共产党（无产阶级先锋队）\n善恶之战（最后审判） ——最后的斗争（无产阶级与资产阶级的最后决战）\n天国降临大地 ——建立共产主义社会\n\n　　马克思主义的内在结构，与犹太教的内在结构完全统一。表相上的差异性，并不能掩盖其深层结构上的一致性。在这个意义上，马克思主义，不过是以科学理性的话语方式，再次展现了犹太教的内涵，是科学化的犹太教。大概正是因为这种文化心理结构的原因，共产主义运动早期的领导人，多是犹太人。早期共产党的军队，依托在社会最底层的人群身上（奴隶民族），表现出一种宗教般的狂热和宗教般的献身精神，原因之一，就是因为马克思主义的根子，本来就在犹太教精神结构之中。或者说，它本来就是一个宗教团队。",
				"added": 1519657405
			},
			{
				"comment_id": 9,
				"body": "国家诞生模型理论里，丛林这个概念一表明，这些提出“资本”这个提法的犹太人——是不折不扣的恶棍",
				"added": 1519657929
			},
			{
				"comment_id": 10,
				"body": "如果大家记的绿教的教义，世界上一切都是真主创造的，都是给绿教猪的，为什么绿教猪这么穷，咖啡了占了那么多，咖啡了抢的，所以绿教猪要抢光咖啡了，杀光咖啡了",
				"added": 1519705200
			},
			{
				"comment_id": 24,
				"body": "共产主义理论是犹太民族包装的游牧民族的异族统治理论， 列宁说：“真正的党员流的是犹太人的血!” 如在十月革命开始的时候，因为沙皇对犹太人的暴政，所以\n\n犹太人都加入了红军，以至于有些人认为这是一场犹太人的革命，列宁本身有1/4的犹太血统，还有蒙古血统。犹太人是失去故土祖国的一个民族，由于坚持信奉自己\n\n的宗教，且犹太人多生活在自己的社区而孤立于所在国的主流社会，不认同居住国，另外犹太人经商放高利贷，掌握巨大财富，却很少承担社会责任，拒绝履行社会义\n\n务，所以他们被其它民族所排斥，每当社会动荡，往往被当作替罪羊。因而他们就否认民族性而宣扬阶级性，以此来颠覆欧洲的民族国家，最终招致其他农耕民族的痛\n\n恨和排斥。\n\n“苏联这个国家的主体民族虽然是俄罗斯人，但是苏联这个国家其实不是俄罗斯人建立，而是由外族人建立起来的，特别是犹太人，在苏联这个第\n\n一个共产主义国家的建立上起了最重要的作用，不光是在建立苏联这个国家，近代欧洲共产主义运动史上犹太人也一直起着首要作用，因为犹太人是没有国家的民族，\n\n便利用共产主义这一学说提出“无产者无祖国“的观点，马克思不说了，德国的无产阶级政党头子拉萨尔是犹太人，革命家卢森堡是犹太人，俄国第一个宣扬无产阶级\n\n观点的普列汉诺夫的妻子是犹太人，全俄肃反委员会头子捷尔仁斯基是犹太人，苏联红军的创始人是犹太人，列宁的曾祖父是犹太人（注：应该是外祖父是犹太人），\n\n站俄国人口总数不到百分之二的犹太人在俄共中央委员会成员总竟占到一半以上，斯达林的秘密警察骨干也多数是犹太人，国家政治局也有超过半数是犹太人。　另外\n\n苏共前领导人斯大林本人是格鲁吉亚人，也不是俄罗斯族。\n所以说1945年以前的苏联其实是一个政权保持在犹太人手里（而不是保持在俄罗斯人手里）的国家，30年代，大量的犹太共产主义分子披着苏共的外衣钻进人民内务部\n\n，进行疯狂的罪恶活动，30年代农业集体化和大清洗运动中死亡，被迫害的数以千万计的苏联工农群众其实都是犹太人暴行的牺牲品，现在的人都认为苏联30年代大饥\n\n荒，大清洗是斯达林对苏联人民经济和意识形态方面的犯罪，其实不是，苏联的大饥荒，大清洗是苏联犹太人对苏联其他民族——俄罗斯人，白俄罗斯人，乌克兰人的\n\n种族迫害罪行。”\n马克思主义是俄国革命取得成功的主要原因之一。",
				"added": 1520005600
			},
			{
				"comment_id": 26,
				"body": "开头创世神话抄袭苏美尔神话，一神教是在埃及为奴时山寨埃及宗教改革，摩西是一个埃及贵族名称，出埃及以后进行游牧屠城种族屠杀然后建国抢劫。不义的国家最终被罗马所灭，后来被绿教猪救了。这是旧约里涉及的历史。\n没有希腊人写的《新约》，基督估计也可能无法改革，原教旨就是《旧约》。",
				"added": 1520061888
			},
			{
				"comment_id": 27,
				"body": "犹太教，共产与绿教与自然界生物相似的——僵尸细菌，双盘吸虫。\n蚂蚁爆头王（真菌）\n 在热带雨林里有一种叫做Ophiocordyceps unilateralis 的僵尸真菌，通过在高处散播孢子繁衍后代。无奈无足无手，这些真菌只能搭蚂蚁的顺风车\n\n——是的，它们能够入侵任何蚂蚁的身体，并控制其大脑。\n被感染的蚂蚁先是在植物之间疯狂地爬上爬下，最终停留在某片离地面大约25cm的叶子背面，在真菌的指示下誓死紧咬叶脉不放。\n\n几天的等待之后，一股僵尸真菌流便如触手般从蚂蚁头中爆裂而出，四处播撒的孢子重新潜伏在雨林中，等待下一轮牺牲品的到来。\n动次打次鱼制造者（吸虫）\n加州鳉鱼广泛分布在南加州和加利福尼亚半岛，是一种名叫Euhaplorchis Californiensis吸虫的理想寄主，钻进大脑后，这些虫子就会像脑细胞一样\n\n安静下来（上图）。\n这种吸虫的感染机制非常神奇，受害鱼不再甘心安静地在水中潜游躲避猎食者，而是像飞大了一样不由自主地摇摆摇摆，携带吸虫越多的鱼，跳得就\n\n越high。这种动次打次的剧烈运动只有一个目的，吸引苍鹭等空中猎食者前来捕捉。\n公螃蟹绝育师（线形虫）\n藤壶蟹奴虫，心比较狠，虽然也能感染雌蟹，但明显对雄性手段更残忍：它们先会把雄性阉了，再进一步控制其大脑（这两步都是靠嘴）。\n虽然长得一点都不像藤壶，但是这种虫子绝对比藤壶难缠。它们生长在雌蟹产卵处，由此鸠占鹊巢，享受着蟹爸蟹妈的无私抚养。天性使然雄蟹对于\n\n照顾孩子往往不太上心，所以会被施加特别的惩罚：寄生虫会直接将雄蟹娘化，让他们像雌蟹一样尽心尽力照顾后代，然而实际受益的确是蟹奴虫自\n\n己的子子孙孙。\n让蟋蟀变成性瘾者的病毒\n（注：高清无码.avi中的蟋蟀并不是Gryllus texensis品种，只作为蟋蟀交配示范教学视频使用。）\n交配行为对动物来说妙不可言，然而通过交配感染的寄生虫尤其希望自己的寄主能更加频繁地啪啪，最好直接过劳死，一石二鸟。\n被感染后，靡乱.avi的场面是这样的……\n拥有如此前卫思想的寄生虫名叫“昆虫虹色病毒 IIV-6/CrIV”，会在感染一种叫做Gryllus texensis的蟋蟀后升华它们的灵魂：雌蟋蟀停止产卵，雄\n\n蟋蟀丧失基本生存技能变成废物，两口子双双混吃等死。不仅如此，在它们杀死寄主的前一天晚上，会使寄主比以往更频繁地交配，享受最后的晚餐\n\n。通常情况下被病毒感染的动物交配欲望会降低（人类同理），由此推断，被感染蟋蟀的行为异常只能是寄生虫入侵的副产品。\n让蜗牛眼睛巨大化的扁形虫\nLeucochloridium paradoxum 是一种寄生在蜗牛体内的扁形虫，通过鸟类排泄物传播的它们面临的最大难题就是如何抵达鸟类消化道。和前文提到的\n\n加州鳉鱼寄生虫一样，这种扁形虫需要使寄主最大可能地被捕食。\nLeucochloridium双管齐下：首先它控制蜗牛爬到叶子表面暴露的地方，使它们有更大的几率被吃掉，接下来（高能预警，这不是演习）它会使蜗牛眼\n\n部感染囊状幼虫病，并将卵一个个产进其灵活而丰腴的眼柄中。\n卵在生长过程中不断颤抖鬼畜，眼柄便随之蠢蠢欲动，远看像柔软多汁的毛毛虫，能大大吸引捕食者的注意。蜗牛只能接受自己被吃掉的宿命，成为\n\n扁形虫繁殖路上无辜的垫脚石。\n能让宿主溺死的线形虫\nSpinochordodes tellinii ，一种生活在水中的线形动物，可以感染蚂蚱和蟋蟀。成年寄生虫会翻滚成密密麻麻的一大团进行交配。蟋蟀和蚂蚱在饮\n\n水时稍不注意，便会将这种寄生虫的微小幼虫送入体内。\n茁壮生长的幼虫最终能释放一种强烈的神经控制毒素，麻痹寄主的中枢神经系统，迫使其跳入最近的水域内溺亡。对外宣称寄主是自杀的成虫之后便\n\n重新回到水体内开始新的犯罪之旅。\n可控制鼠脑和人脑的线形虫\nToxoplasma gondii 在控制大脑方面可谓是寄生虫界的翘楚。这种单细胞生命体几乎能感染所有的温血动物，尽管如此，低调的它们只选择猫作为繁\n\n殖终极介质，深藏功与名。在传播过程的前期，这种寄生虫先是感染小鼠，使其对猫的毛发和排泄物更感兴趣，降低其对猫这种天敌的警觉，甚至会\n\n出现主动接近天敌的个体。\n而科学家更感兴趣这种寄生虫对人类的影响。许多研究都探讨了被感染人类行为上的微妙变化，还有论文直接表明了神经过敏症的严重程度和被Toxo\n\n感染的人口比例的关系，结论是：这种寄生虫能使男性更内向，女性更热衷于社交，从而间接影响人类的社会文化。\n让蜘蛛“代孕”的蜂\nHymenoepimecis argyraphaga 是一种哥斯达黎加寄生蜂，专门攻击名为Plesiometa argyra的蜘蛛。一到繁殖季节，成年雌性寄生蜂便会出动寻找目\n\n标，麻痹某只可怜的路人蜘蛛，然后将卵产在其腹部。\n这是受感染的蜘蛛逐渐把自己和蛛网献祭给寄生蜂的过程\n蜘蛛一觉醒来，浑然不知自己此生注定为他人做嫁衣裳。经过几周悄无声息的疯狂嗜血，由卵孵化出的幼虫会在蜘蛛体内注入一种化学毒素，控制其\n\n织出奇怪的网。这种网虽然形状无感，但胜在结实耐操，足以为寄生蜂幼虫遮风挡雨。之后寄生虫就用毒液杀死完工后留在网中麻木等死的蜘蛛，榨\n\n干其最后一滴血，马不停蹄地在蜘蛛最后的杰作上开始自己茧室的建造。\n能控制生物链的肝吸虫\n柳叶刀形肝吸虫（Dicrocoelium dendriticum）往往业务繁忙，其成年寄生虫生活在牛等草食性动物的肝部并在此交配产卵，大量的虫卵随着寄主的\n\n粪便排出体外。之后会有蜗牛前来进食排泄物，此时卵便借机入侵，长驱直入蜗牛的消化腺定点进行无性繁殖。之后的它们若无其事地回到蜗牛表皮\n\n，触发机体抵御机制，蜗牛也就自然而然地将其围在包囊里，通过咳出的粘液排出体外。这一切都在肝吸虫的掌控之中。\n一些品种甚至达到肉眼可以分辨\n随后而来的蚂蚁靠吞食蜗牛吐出的粘液为生。寄生虫由此进入蚂蚁体内并攻占大脑，然后就等待夜幕降临伺机而动，夺取蚂蚁身体的主动权。这种肝\n\n吸虫能控制蚂蚁在夜间爬到草叶上，安静等待被食草动物捎带吞食。当太阳升起它们则释放傀儡蚂蚁允许其自由行动，因为白天草地气温过高，很容\n\n易导致寄主和宿主双双暴毙。这样的昼夜交替会一直持续到蚂蚁成为草食动物的盘中餐，寄生虫完成最初的梦想，开始新一轮的循环。",
				"added": 1520134046
			},
			{
				"comment_id": 29,
				"body": "环球时报总编胡锡进是绿教猪，以前承认是回族，现在不承认了。有一个很大的基数，才有有一个总编。它们给isis洗地可见它们与其说是为共匪服务，不如说是打入共匪内部的绿教。共产主义理论是犹太民族包装的游牧民族的异族统治理论,他们就否认民族性而宣扬阶级性，以此来颠覆欧洲的民族国家，最终招致其他农耕民族的痛恨和排斥。同样的手法也可以解释环球时报的种种行径",
				"added": 1520134443
			}
		],
		"2_1fo4F2EFpchNKtmxezSBpqM7Xnstc7ZuT": [
			{
				"comment_id": 11,
				"body": "除了傻逼和赵家人没有人会赞同共匪。你说泛亚受害者是支持共匪的吗？",
				"added": 1519705313
			}
		],
		"100_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 12,
				"body": "狗屁，丛林国家暴力是第一位的。让一个土匪团伙不堪承受不存在的，朝鲜那样还存在着，只有土匪内部冲突才有可能，说个历史规律，中古古代建立下个朝代，推翻上个朝代的，基本都是上个朝代官员",
				"added": 1519705596
			},
			{
				"comment_id": 14,
				"body": "8964学生的血染红了一堆官员的顶子，这种是只会给共匪续命。苏联之所以和平解体，因为他们内部有对军队高官的除奸队，所以军官宁可自杀也不屠城。",
				"added": 1519706315
			},
			{
				"comment_id": 18,
				"body": "五毛狗把对共匪不利的都叫谣言",
				"added": 1519712767
			}
		],
		"1_18tQgVR1eb2Y1LSXmzZSMp7K8z8dTGpcAo": [
			{
				"comment_id": 13,
				"body": "为什么日本一党可以干这种事？没有法律吗？没有宪法吗？",
				"added": 1519705718
			},
			{
				"comment_id": 16,
				"body": "还以为说首相任期，原来说的是自民党内部",
				"added": 1519707326
			},
			{
				"comment_id": 17,
				"body": "不愧对你的id",
				"added": 1519707342
			}
		],
		"55_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 15,
				"body": "包子意识到宪法本啦就是装饰，枪杆子出政权，有枪随便改",
				"added": 1519706718
			}
		],
		"7_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 19,
				"body": "西王要反拉开反腐大幕，反腐怕被报复，然后害怕丢权力。",
				"added": 1519804778
			}
		],
		"1_1Lf9ruA9iMU6fRqAFEhHgVRHyspUo9xvH3": [
			{
				"comment_id": 20,
				"body": "qtox可以建群，但不能搜索群，用的人一多官网就会被封，如果能p2p搜索，群组，公众号，有了内容提供者自然能吸引到人。",
				"added": 1519967330
			},
			{
				"comment_id": 41,
				"body": "> [hdhz](#comment_10_145kg9WZryLeefr2FuGERptM7frEf7ySGH): tox可以在无网环境使用吗？节点间通过热点连接\n\n所有的wifi对讲机都不用外网，很多类似软件，只要链接同一个路由器就可以",
				"added": 1520935286
			}
		],
		"64_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 21,
				"body": "因为你没有了解过政府的本质，以及其是如何产生的。知道了你就不奇怪了。\n在20世纪的前90年里，大约有1.7亿人被他们自己的政府所杀害。研究表明，在现代社会里，大部分人所面临的首要危险是权力不受制衡的政府，而非罪犯、企业或恐怖分子。对人的生命造成最大威胁的是本国政府，而非外国政府。",
				"added": 1519975467
			}
		],
		"9_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 22,
				"body": "某个id是ccav9的sb不知从那扫的垃圾数据，破坏图书分享",
				"added": 1519976736
			}
		],
		"1_1NcfPfTNyqtL7jkgmCL4yjuxdMXa16AsC8": [
			{
				"comment_id": 23,
				"body": "北朝鲜——韩国。东德——西德。",
				"added": 1519994642
			}
		],
		"109_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 25,
				"body": "手淫强身,下句——",
				"added": 1520061225
			}
		],
		"4_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 28,
				"body": "蚂蚁爆头王（真菌）\n 在热带雨林里有一种叫做Ophiocordyceps unilateralis 的僵尸真菌，通过在高处散播孢子繁衍后代。无奈无足无手，这些真菌只能搭蚂蚁的顺风车\n\n——是的，它们能够入侵任何蚂蚁的身体，并控制其大脑。\n被感染的蚂蚁先是在植物之间疯狂地爬上爬下，最终停留在某片离地面大约25cm的叶子背面，在真菌的指示下誓死紧咬叶脉不放。\n\n几天的等待之后，一股僵尸真菌流便如触手般从蚂蚁头中爆裂而出，四处播撒的孢子重新潜伏在雨林中，等待下一轮牺牲品的到来。\n动次打次鱼制造者（吸虫）\n加州鳉鱼广泛分布在南加州和加利福尼亚半岛，是一种名叫Euhaplorchis Californiensis吸虫的理想寄主，钻进大脑后，这些虫子就会像脑细胞一样\n\n安静下来（上图）。\n这种吸虫的感染机制非常神奇，受害鱼不再甘心安静地在水中潜游躲避猎食者，而是像飞大了一样不由自主地摇摆摇摆，携带吸虫越多的鱼，跳得就\n\n越high。这种动次打次的剧烈运动只有一个目的，吸引苍鹭等空中猎食者前来捕捉。\n公螃蟹绝育师（线形虫）\n藤壶蟹奴虫，心比较狠，虽然也能感染雌蟹，但明显对雄性手段更残忍：它们先会把雄性阉了，再进一步控制其大脑（这两步都是靠嘴）。\n虽然长得一点都不像藤壶，但是这种虫子绝对比藤壶难缠。它们生长在雌蟹产卵处，由此鸠占鹊巢，享受着蟹爸蟹妈的无私抚养。天性使然雄蟹对于\n\n照顾孩子往往不太上心，所以会被施加特别的惩罚：寄生虫会直接将雄蟹娘化，让他们像雌蟹一样尽心尽力照顾后代，然而实际受益的确是蟹奴虫自\n\n己的子子孙孙。\n让蟋蟀变成性瘾者的病毒\n（注：高清无码.avi中的蟋蟀并不是Gryllus texensis品种，只作为蟋蟀交配示范教学视频使用。）\n交配行为对动物来说妙不可言，然而通过交配感染的寄生虫尤其希望自己的寄主能更加频繁地啪啪，最好直接过劳死，一石二鸟。\n被感染后，靡乱.avi的场面是这样的……\n拥有如此前卫思想的寄生虫名叫“昆虫虹色病毒 IIV-6/CrIV”，会在感染一种叫做Gryllus texensis的蟋蟀后升华它们的灵魂：雌蟋蟀停止产卵，雄\n\n蟋蟀丧失基本生存技能变成废物，两口子双双混吃等死。不仅如此，在它们杀死寄主的前一天晚上，会使寄主比以往更频繁地交配，享受最后的晚餐\n\n。通常情况下被病毒感染的动物交配欲望会降低（人类同理），由此推断，被感染蟋蟀的行为异常只能是寄生虫入侵的副产品。\n让蜗牛眼睛巨大化的扁形虫\nLeucochloridium paradoxum 是一种寄生在蜗牛体内的扁形虫，通过鸟类排泄物传播的它们面临的最大难题就是如何抵达鸟类消化道。和前文提到的\n\n加州鳉鱼寄生虫一样，这种扁形虫需要使寄主最大可能地被捕食。\nLeucochloridium双管齐下：首先它控制蜗牛爬到叶子表面暴露的地方，使它们有更大的几率被吃掉，接下来（高能预警，这不是演习）它会使蜗牛眼\n\n部感染囊状幼虫病，并将卵一个个产进其灵活而丰腴的眼柄中。\n卵在生长过程中不断颤抖鬼畜，眼柄便随之蠢蠢欲动，远看像柔软多汁的毛毛虫，能大大吸引捕食者的注意。蜗牛只能接受自己被吃掉的宿命，成为\n\n扁形虫繁殖路上无辜的垫脚石。\n能让宿主溺死的线形虫\nSpinochordodes tellinii ，一种生活在水中的线形动物，可以感染蚂蚱和蟋蟀。成年寄生虫会翻滚成密密麻麻的一大团进行交配。蟋蟀和蚂蚱在饮\n\n水时稍不注意，便会将这种寄生虫的微小幼虫送入体内。\n茁壮生长的幼虫最终能释放一种强烈的神经控制毒素，麻痹寄主的中枢神经系统，迫使其跳入最近的水域内溺亡。对外宣称寄主是自杀的成虫之后便\n\n重新回到水体内开始新的犯罪之旅。\n可控制鼠脑和人脑的线形虫\nToxoplasma gondii 在控制大脑方面可谓是寄生虫界的翘楚。这种单细胞生命体几乎能感染所有的温血动物，尽管如此，低调的它们只选择猫作为繁\n\n殖终极介质，深藏功与名。在传播过程的前期，这种寄生虫先是感染小鼠，使其对猫的毛发和排泄物更感兴趣，降低其对猫这种天敌的警觉，甚至会\n\n出现主动接近天敌的个体。\n而科学家更感兴趣这种寄生虫对人类的影响。许多研究都探讨了被感染人类行为上的微妙变化，还有论文直接表明了神经过敏症的严重程度和被Toxo\n\n感染的人口比例的关系，结论是：这种寄生虫能使男性更内向，女性更热衷于社交，从而间接影响人类的社会文化。\n让蜘蛛“代孕”的蜂\nHymenoepimecis argyraphaga 是一种哥斯达黎加寄生蜂，专门攻击名为Plesiometa argyra的蜘蛛。一到繁殖季节，成年雌性寄生蜂便会出动寻找目\n\n标，麻痹某只可怜的路人蜘蛛，然后将卵产在其腹部。\n这是受感染的蜘蛛逐渐把自己和蛛网献祭给寄生蜂的过程\n蜘蛛一觉醒来，浑然不知自己此生注定为他人做嫁衣裳。经过几周悄无声息的疯狂嗜血，由卵孵化出的幼虫会在蜘蛛体内注入一种化学毒素，控制其\n\n织出奇怪的网。这种网虽然形状无感，但胜在结实耐操，足以为寄生蜂幼虫遮风挡雨。之后寄生虫就用毒液杀死完工后留在网中麻木等死的蜘蛛，榨\n\n干其最后一滴血，马不停蹄地在蜘蛛最后的杰作上开始自己茧室的建造。\n能控制生物链的肝吸虫\n柳叶刀形肝吸虫（Dicrocoelium dendriticum）往往业务繁忙，其成年寄生虫生活在牛等草食性动物的肝部并在此交配产卵，大量的虫卵随着寄主的\n\n粪便排出体外。之后会有蜗牛前来进食排泄物，此时卵便借机入侵，长驱直入蜗牛的消化腺定点进行无性繁殖。之后的它们若无其事地回到蜗牛表皮\n\n，触发机体抵御机制，蜗牛也就自然而然地将其围在包囊里，通过咳出的粘液排出体外。这一切都在肝吸虫的掌控之中。\n一些品种甚至达到肉眼可以分辨\n随后而来的蚂蚁靠吞食蜗牛吐出的粘液为生。寄生虫由此进入蚂蚁体内并攻占大脑，然后就等待夜幕降临伺机而动，夺取蚂蚁身体的主动权。这种肝\n\n吸虫能控制蚂蚁在夜间爬到草叶上，安静等待被食草动物捎带吞食。当太阳升起它们则释放傀儡蚂蚁允许其自由行动，因为白天草地气温过高，很容\n\n易导致寄主和宿主双双暴毙。这样的昼夜交替会一直持续到蚂蚁成为草食动物的盘中餐，寄生虫完成最初的梦想，开始新一轮的循环。",
				"added": 1520134097
			}
		],
		"2_12AyVjYPn8ToxvMSxbxbcMaTYNCBhqE1Fz": [
			{
				"comment_id": 30,
				"body": "从有实物的周武王叛乱，五霸七雄，李渊叛乱，赵匡胤造反，到逼清退位的袁世凯，历朝建立下个朝代，推翻上个朝代的基本都是上个朝代的官员。\n\n 卡斯特罗死了，此人出身在一个拥有几千亩种植园园主之家。他为啥闹革命？这当然会有无数官方文件给出正能量满满的回答。\n    卡斯特罗是渴望建立苏式社会主义并获得成功的最后一位。他不是工人，也不是穷人。\n  而这个世界上建立第一个社会主义国家的发起者——列宁也不是工人，穷人，而是一个准贵族。1870年4月22日列宁出生在俄国辛比尔斯克省辛比尔斯克市（现乌里扬诺夫斯克州乌里扬诺夫斯克市），他有俄罗斯人、莫尔多瓦人、卡尔梅克人、犹太人、伏尔加德意志人及瑞典人的血统。他的父亲名叫伊利亚·乌里扬诺夫，是在辛比尔斯克行政区内公内学校的督学。\n\n    比卡斯特罗还晚，在南亚古国柬埔寨建立社会主义社会的大名鼎鼎的杀人狂波尔布特，出生于柬埔寨磅同省磅斯威县波列斯布村的一个富裕的华人与柬埔寨人的混合血统农民家庭。祖上姓吕。你要是有兴趣，从中国的缔造者毛腊肉往下一个个捋，无论是祸水东引组建党组织，还是扩大到规模惊人的的队伍，会发现最高层那些革命家出身工人、穷人的出奇的少。\n   在49年以前，多数地主是要亲自干活的，只有极少数大地主可以只靠租赁，毛的父亲毛顺生就是这种极少的大地主。而毛也是民国的官员。",
				"added": 1520246638
			},
			{
				"comment_id": 31,
				"body": "波尔布特也是准贵族出身。柬埔寨皇室姻亲，复制的这个有问题，",
				"added": 1520249187
			}
		],
		"23_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 32,
				"body": "因为他们真的研究起学校后勤工这种底层了，待遇如和差。前阵子，不是想法设法提高后勤工工资待遇，有些学校还想用免费的学生替代辞退这些后勤工人，恬不知耻的说“尊重劳动”。劳动没有贵贱，有贵贱的是工资。这么做是在打学校的脸，砸了学校的如意算盘。",
				"added": 1520250216
			},
			{
				"comment_id": 33,
				"body": "“历史规律不可抗拒不可抗拒”——在马克思主义中，犹太教的“上帝”概念被“物质”概念所替换，“上帝不可抗拒的意志”被“不可抗拒的历史规律”所替换了。“唯上帝论”与“唯物论”，需要有唯心与唯物的差别，但在绝对主义这个意义上，它们是完全一致的。\n　　第二个要素——无产阶级——新时代的选民，新生产力的承担者，资本主义掘墓人，承担着摧毁资本主义建立共产主义的特殊使命。马克思主义中，犹太教的“选民”由“犹太人”变成了“无产阶级”。\n“上帝选择了犹太人”与“历史选择了无产阶级”，在选民意义上是同一的。\n直到今天，政府的文件里还习惯用“历史选择了”这样的词语。\n\n先知马克思\n上帝god（上帝意志） ——物质（客观规律）\n选民（犹太人） ——无产阶级（工人阶级）\n救世主（弥赛亚） ——共产党（无产阶级先锋队）\n善恶之战（最后审判） ——最后的斗争（无产阶级与资产阶级的最后决战）\n天国降临大地 ——建立共产主义社会\n\n　　马克思主义的内在结构，与犹太教的内在结构完全统一。表相上的差异性，并不能掩盖其深层结构上的一致性。在这个意义上，马克思主义，不过是以科学理性的话语方式，再次展现了犹太教的内涵，是科学化的犹太教。大概正是因为这种文化心理结构的原因，共产主义运动早期的领导人，多是犹太人。早期共产党的军队，依托在社会最底层的人群身上（奴隶民族），表现出一种宗教般的狂热和宗教般的献身精神，原因之一，就是因为马克思主义的根子，本来就在犹太教精神结构之中。或者说，它本来就是一个宗教团队。\n\n共产主义理论是犹太民族包装的游牧民族的异族统治理论， 列宁说：“真正的党员流的是犹太人的血!” 如在十月革命开始的时候，因为沙皇对犹太人的暴政，所以犹太人都加入了红军，以至于有些人认为这是一场犹太人的革命，列宁本身有1/4的犹太血统，还有蒙古血统。犹太人是失去故土祖国的一个民族，由于坚持信奉自己的宗教，且犹太人多生活在自己的社区而孤立于所在国的主流社会，不认同居住国，另外犹太人经商放高利贷，掌握巨大财富，却很少承担社会责任，拒绝履行社会义务，所以他们被其它民族所排斥，每当社会动荡，往往被当作替罪羊。因而他们就否认民族性而宣扬阶级性，以此来颠覆欧洲的民族国家，最终招致其他农耕民族的痛恨和排斥。\n“苏联这个国家的主体民族虽然是俄罗斯人，但是苏联这个国家其实不是俄罗斯人建立，而是由外族人建立起来的，特别是犹太人，在苏联这个第一个共产主义国家的建立上起了最重要的作用，不光是在建立苏联这个国家，近代欧洲共产主义运动史上犹太人也一直起着首要作用，因为犹太人是没有国家的民族，便利用共产主义这一学说提出“无产者无祖国“的观点，马克思不说了，德国的无产阶级政党头子拉萨尔是犹太人，革命家卢森堡是犹太人，俄国第一个宣扬无产阶级观点的普列汉诺夫的妻子是犹太人，全俄肃反委员会头子捷尔仁斯基是犹太人，苏联红军的创始人是犹太人，列宁的曾祖父是犹太人（注：应该是外祖父是犹太人），站俄国人口总数不到百分之二的犹太人在俄共中央委员会成员总竟占到一半以上，斯达林的秘密警察骨干也多数是犹太人，国家政治局也有超过半数是犹太人。　另外苏共前领导人斯大林本人是格鲁吉亚人，也不是俄罗斯族。\n所以说1945年以前的苏联其实是一个政权保持在犹太人手里（而不是保持在俄罗斯人手里）的国家，30年代，大量的犹太共产主义分子披着苏共的外衣钻进人民内务部，进行疯狂的罪恶活动，30年代农业集体化和大清洗运动中死亡，被迫害的数以千万计的苏联工农群众其实都是犹太人暴行的牺牲品，现在的人都认为苏联30年代大饥荒，大清洗是斯达林对苏联人民经济和意识形态方面的犯罪，其实不是，苏联的大饥荒，大清洗是苏联犹太人对苏联其他民族——俄罗斯人，白俄罗斯人，乌克兰人的种族迫害罪行。”\n马克思主义是俄国革命取得成功的主要原因之一。\n马列是外族入侵的异族统治理论，怎么区分无产就是个荒唐的事，只是用仇富心理转移对犹太人的民族仇",
				"added": 1520421344
			}
		],
		"13_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 34,
				"body": "小白帽特权象征，五毛舔的环球总编胡锡进回族绿教猪，赵家狗替底层说话？有病",
				"added": 1520422998
			}
		],
		"144_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 35,
				"body": "共匪打天下靠，日军的百万装备，俄国给的苏德战场重武器。实际指挥的俄国军事顾问，共匪现在有核弹，而且共匪敢往国内扔核弹，60年前后饿死过三千万不皱眉头。如果你解决不了这些，别打扰别人骂，毕竟比五毛狗舔强多了",
				"added": 1520686249
			}
		],
		"132_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 36,
				"body": "真正懂的人需要一张大功率无线网卡，然后学习无线安全技术。",
				"added": 1520688562
			}
		],
		"43_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 37,
				"body": "被吹的牛逼哄哄的犹太人被屠杀了那么多次，那次他们反抗了？自杀叫个屁反抗。被所谓\"执法“拦路抢劫，已经有案例了，上车抢车钥匙直接那榔头打昏，对方认都不敢认，人家犹太人弄个共产教，弄死那么多人那只能叫报复。",
				"added": 1520854564
			}
		],
		"1_14BL9jNfFXAV821beMvgQWJqRumoX9C15t": [
			{
				"comment_id": 38,
				"body": "你这个预测没有依据，至少现在看不出有谁能扳倒包子。初中生这个说法也不疼不痒，那些官员联合起啦没用，就找了个郭文贵放空屁，或许官员勾结俄国有用，毕竟宗教传出国，官员打黄俄口号或许能当官员的反旗",
				"added": 1520855149
			}
		],
		"3_1DXSGj6Fq7SuptyLTYGBpMpKRijL7Wf2kH": [
			{
				"comment_id": 39,
				"body": "鲜血终末，屁民可能又要当柴火了。",
				"added": 1520855422
			},
			{
				"comment_id": 40,
				"body": "漫长人生路,跌宕前行 若在世时要尽兴",
				"added": 1520855867
			}
		],
		"46_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 42,
				"body": "一个要坚持抢劫与杀戮为生的宗教如何民主化？抢劫是传统文化，杀人防火是传统文化，传统文化还神圣不可侵犯。别人不想管绿教猪怎么坚持传统文化，绿教猪像生化危机一样，努力清除就行。",
				"added": 1521780063
			}
		],
		"11_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 43,
				"body": "挂着日本动画片头像的学生里面五毛意向太多了，什么学校培养五毛程序员？学生里想给共匪当狗的太多了。猪狗一样的老师一把屎一把尿喂着这些学生。国内几个日本动画片网站基本就快成了狗窝。\n即使是做翻墙这种项目的，有意做点什么的人，还是耐不住寂寞。",
				"added": 1523417562
			}
		],
		"6_12eyn7aqnDpzq5WKEZARAt9imQ1sRagAsm": [
			{
				"comment_id": 44,
				"body": "tox所有版本好像都没有搜索群组的功能？是因为没有服务器的原因？",
				"added": 1523417911
			}
		],
		"12_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 45,
				"body": "刘是绿教猪，宗教人士，当它学者是傻",
				"added": 1524898401
			},
			{
				"comment_id": 46,
				"body": "文明世界不需要墓尸淋，土匪内有胡锡进、马寅初这种塔基亚，外面还有这种绿猪骗傻子。",
				"added": 1524898660
			},
			{
				"comment_id": 47,
				"body": "群体过大没有人愿意为其利益付诸行动。汉族这点上对绿教猪怕是没办法了。写这种垃圾的绿教猪以消灭汉族为动机团结了起来",
				"added": 1524899950
			}
		],
		"115_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 48,
				"body": "中兴刚死时国资委报告你看了没有，它是军工集团下属子公司。减少它的死对母公司的影响，菊花估计也是一样，开口匪气那么大。",
				"added": 1525175056
			},
			{
				"comment_id": 49,
				"body": "海军应该是职业五毛吧兼职来着。在美国之音的外宣前几年就透露包子要搞终身制的，小骂提醒——军队几大收入源——走私，开医院，开饭店，开妓院。爱国的逼是领导特供，你操不上。",
				"added": 1525175319
			}
		]
	},
	"comment_vote": {}
}