{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Thank you for providing such an honest review. This is exactly what I needed to read as a backer of the Librem 5. Despite all the problems that you encountered, it gives me a great deal of hope to see Purism shipping the Librem 5. \n\nNobody has posted the weight of the Librem 5. Can you weigh it for us?\n\nI'm dying to know about the hardware in the Librem 5. Would you mind posting the output of the following commands?\ndmesg\nlshw  \nlspci -v -n\nlsusb -v\ndmidecode \n(you probably have to install lshw and dmidecode and they might not work)\n\n> To my knowledge it is the only phone that separates the main CPU from the base band. \n\nThe PinePhone and Apple's iPhones separate the cellular baseband from the CPU. All the 5G phones on the market that I have looked at also have the cellular baseband separated from the CPU, because Qualcomm hasn't yet incorporated a 5G modem into the Snapdragon. Now that Apple bought the cellular baseband division from Intel, I expect that iPhones will start incorporating the cellular baseband into their A-series SoC. \n",
			"post_id": 45,
			"date_added": 1575390534
		},
		{
			"comment_id": 2,
			"body": "By the way, I made a list of corrections for your post. These are phrases that sound awkward me:\n\nI ordered one as soon as they opened the *pre-orders*.\n\nA quick *look* in my Bitcoin wallet revealed that I *pre-ordered* the phone on Aug 24, 2017. \n\nA solid base is more important to me than the *finished product*.\n\nBluetooth audio is one of the *sore* points with my current UBports phone. \n\nI *haven't* test mobile data connection yet. \n\nno friend is with me who *can* set up an access point on his phone. \n\nSending a text message worked *on* the first try.\n\nOnly the integration with the address book *still needs to* be improved.\n\nSpeaking of the address book, I *haven't yet found out* how to synchronize or import my contacts.\n\nthere is no *voice-capable* modem.\n\nI went through them all, and clicked the test sound button*, but* I couldn't hear any sound coming from the device.\n\nThe Librem 5 comes with *Kings Cross pre-installed*. \n\nWhether the screen is on or off doesn't seem to make a difference. The device gets *very, very* hot.\n\nhour.* I* just have to switch the phone off while it is not *being* used and not plugged in.\n\nand put the CPU *to* sleep when not in use.\n\nbut it *no longer processes* touch inputs.\n\n*I'm not* sure if the phone registers as *an* HDI device,\n\nfrom the apt repository*, but* so far I *have* only installed command line applications. \n\n*After* using UBports for the longest time, I am used to most apps not being available *to me, so* the whole app thing is no big deal for me.\n\n*Let's* see how things progress from here... With some software updates, I hope it will become the phone *that* I want to use for the next five years.\n",
			"post_id": 45,
			"date_added": 1575390778
		},
		{
			"comment_id": 3,
			"body": "Hi Richi, Now I have even more questions! Let's continue this on the Purism forum:\nhttps://forums.puri.sm/t/so-it-has-shipped-where-are-the-reviews/7204/53",
			"post_id": 45,
			"date_added": 1575498893
		}
	],
	"comment_vote": {},
	"post_vote": {
		"45": 1
	}
}