{
	"next_topic_id": 23,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet Meetup in Budapest in September",
			"body": "Hello,\n\nI was wondering if some of you would like to meet in Budapest at the end of September ? It would be the occasion to talk about what we are interesting in ZeroNet and what we can build on it.\n\nnofish: If you are not too busy ?",
			"added": 1502567896
		},
		{
			"topic_id": 2,
			"title": "How accessible are Zeronet sites to blind people ?",
			"body": "Is there any blind people using Zeronet today ? Does anyone know how we could judge of the accessibility of a website ?",
			"added": 1507990120
		},
		{
			"topic_id": 1518637483,
			"title": "Preparing a presentation of Zeronet. What should I show ?",
			"body": "Hello everyone,\n\nI am currently in Medellin, Colombia. I am going to do short presentation on Zeronet in 4 hours. I would like to show a bunch of cool sites to illustrate what cool stuff we can do.\n\nCould you post your favorite sites ?\n",
			"added": 1518637480
		},
		{
			"topic_id": 1522279439,
			"title": "Mixtape : new music site",
			"body": "Hi everyone,\n\nI have published my new project call Mixtape. It is a collaborative playlist site. It has lots of bug that I am trying to fix. If anyone want to contribute or report a bug it would be much appreciated.\n\nA small explanation of how it works :\n* It use the big file feature for songs.\n* Every playlist is a hub. The site doesn't offer the possibility to create one but you should be able to clone one of the hub that are already available.\n* You can also manage permission. The playlist can be read only or public or just give access to a couple of people. A more detailed guide on how to do that will come soon.\n\nWhat to expect for the future:\n* A page to manage your playlist\n* Better user experience (the code need some refactoring)\n* Follow update of playlist\n* Desktop application - experimental - This could be achieved by using electron and loading the url of the page and maybe some other cool feature if possible like notification.\n* A plugin to quickly add a song listened on clearnet to your playlist or even other site like ZeroSTLN\n\nMany exciting stuff to do !\n\nPS : The address [Mixtape](/mixtape.bit)",
			"added": 1522279435
		},
		{
			"topic_id": 1522801185,
			"title": "Timestamp server on Zeronet",
			"body": "I have been doing some reading and research on timestamp server (mostly because Bitcoin). I believe that Zeronet would be the perfect network to have a timestamp service.\n\nWhat for ?\nI am actually not sure why but it could be use for research notes (it would proves who has done what first), original content like tv show or music or art and maybe for insurance...\n\nAny thoughts ?",
			"added": 1522801180
		},
		{
			"topic_id": 1523408171,
			"title": "Online Censorship",
			"body": "I have found an interesting website : [Online Censorhip](https://onlinecensorship.org/) <-- clearnet.",
			"added": 1523408165
		},
		{
			"topic_id": 1525185835,
			"title": "Second Zeronet meetup in September",
			"body": "Last year some of us met in Budapest. Should we do it again ?",
			"added": 1525185828
		},
		{
			"topic_id": 1525357146,
			"title": "Zeronet Meetups",
			"body": "Let's get together.",
			"added": 1525357138,
			"type": "group"
		},
		{
			"topic_id": 1525358793,
			"title": "Meetup Zeronet Budapest September 2018",
			"body": "Second meetup in Budapest !\n\nWe need to decide on a date, talks, venue,...",
			"added": 1525358784,
			"parent_topic_uri": "1525357146_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u"
		},
		{
			"topic_id": 1531129038,
			"title": "Ethic & design in technology",
			"body": "I have been more and more interested in design in the tech, mostly with the movement Time Well Spent (now call [Humane Tech](http://humanetech.com/)).\n\nI believe it would be great to start thinking on how it we could apply those principles here. The idea would be to write a guide for developing Zeronet sites which respect users and therefore not falling into old habit.\n\nWhat do you guys think ?",
			"added": 1531129028
		},
		{
			"topic_id": 1532697310,
			"title": "Plugin ideas",
			"body": "Here some ideas for plugins :\n- Bitcoin SPV node + wallet (for crowdfunding and stuff)\n- Chromecast-like plugin (so we can stream stuff on screen)\n- Namecoin spv node + wallet (for id thingy)\n- Sonos plugin (this time to stream music)\n- Ledger plugin (sign your site using your ledger)\n\nAs you can see I gave a lot of though in each of those ideas :wink:",
			"added": 1532697299
		},
		{
			"topic_id": 1534333715,
			"title": "Digilante (2017) - A filmmaker confronts the real-world damage he caused when he uploaded a viral shaming video that resulted in two jail terms",
			"body": "https://www.youtube.com/watch?v=rjUakQYKdPw\n\nDigilante (2017) - A filmmaker confronts the real-world damage he caused when he uploaded a viral shaming video that resulted in two jail terms\n\nWhat people think of this ?",
			"added": 1534333703
		},
		{
			"topic_id": 1536060054,
			"title": "Anyone who is into CTF ?",
			"body": "I started to do CTF for fun. Anyone who also do competition for fun and want to team up ?",
			"added": 1536060041
		},
		{
			"topic_id": 1536069895,
			"title": "Looking into creating a browser for Zeronet",
			"body": "I have been looking into zeronet-kivy and python GUI framework.\nI would like to create a Zeronet Browser POC. Having a native browser could give more control over the application and offer other opportunities for plugins and site. \n\nIt would be great to be able to do it and using a lib to render site. The best one I have found is webkit and it seems to work great with PyQT. There is also https://pypi.org/project/cefpython3/ which seems to be compatible with a bunch of GUI framework. It doesnt seems to be maintain for kivy or it is maintain by a third party and doesnt really push update.\n\nUsing PyQT and webkit seems the right choice but PyQT seems to have a annoying license ? Might not be a problem because Zeronet is free. \n\nOther solution is the Beeware : https://pybee.org/project/using/desktop-app/\nBut seems quite a young project.\n\nI also tested Pyinstaller to create ready to use app and dpkg to create packaging for linux. \n\nHere the state of my research. Please comment if you have feedback or other lib to add.\n\nUPDATE: I finally chose to go with pyt5 : https://github.com/rllola/ZeronetBrowser\n\nUsing Electron would have require having 2 languages in one app making it more difficult to package, distribute and update. Also contrary to what it has been said javascript doesn't allow to embed python code (like for bindings in c++/python). It would just call the app and start it externally. Using IPC would have been a good solution for communication between the 2 processes. However it would have been a lot of work, lets keep it simple.\n\nThe project is open to PR ! I am focusing on packaging, distribution and update first and if anyone want to start adding features please do. You actually don't need to know that much python to start. ",
			"added": 1536069881
		},
		{
			"topic_id": 1539101626,
			"title": "Solid the new world wide web by Berners-Lee",
			"body": "Have people heard of Solid (https://solid.inrupt.com/) ? What do you think of it ?",
			"added": 1539101611
		},
		{
			"topic_id": 1539131791,
			"title": "Zeronet Torrent Plugin first release",
			"body": "I am happy to announce the first release of the Zeronet Torrent Plugin !\nhttps://github.com/rllola/zeronet-torrent-plugin/releases/tag/v0.1.0\n\n## How to install ?\n\nYou just need to download the release for your computer and extract it in the plugins folder under the name Torrent.\n\n## Test\n\nYou can then run test.py to see if it is working. If not please fill a issue ticket with as much details as possible so I can help you with it.\n\n## What it is for ?\n\nIt allows you to create download/seed files from the Torrent network. It is a bridge between both world.\n\n## Important\n\nIt is not anonymous ! Please use it with caution and do not install if you want to stay anonymous. It as anonymous as Bittorrent. You can use it behind a VPN if you want.\n\n## Sites which support the plugin\n\nYou can test it here : http://127.0.0.1:43110/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/\n\nFor any questions or requests I will be available here or you can contact me through ZeroMail.",
			"added": 1539131775
		},
		{
			"topic_id": 1540413487,
			"title": "ZeroNet talk in SF Starfish Mission 24 Oct 2018",
			"body": "I am doing a short presentation at a co-working in SF this evening. I have showed it to the people in the space and they were interesting in learning more.\n\nhttps://www.starfish.network/events/2018/10/24/zeronet",
			"added": 1540413470,
			"parent_topic_uri": "1525357146_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u"
		},
		{
			"topic_id": 1549333095,
			"title": "Anyone using React for Zeronet Development ?",
			"body": "I have been using react for some sites. It has been a bit tricky for some parts. I would be interested in people experience.",
			"added": 1549333077
		},
		{
			"topic_id": 1549990519,
			"title": "Zeronet Torrent Plugin v0.1.2 (osx+linux)",
			"body": "Hello,\n\nI have release a new version for the torrent plugin. It just fix a bug and use Libtorrent 1.1.12 \n\nYou can find the plugin here : http://127.0.0.1:43110/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/\n\nOnce installed you can also test it on the same site.",
			"added": 1549990500
		},
		{
			"topic_id": 1578059130,
			"title": "Version v0.3.1 torrent plugin",
			"body": "Here the latest version of the torrent plugin I have been working on. I have re-wrote it to be a lot simpler for dev to use (it is now really similar to how zeronet do it for optional file). Documentation will be published on the site.\n\nYou can find the plugin for py3 here : zero://1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/\n\nThere is still python2 version files but those are outdated now. So if it shows python2 code it means that your are using python2 zeronet version and you should update it.\n\nOnce the plugin is installed you can just visit the site again and it should offer you a dead simple form in order to test the plugin with Sintel torrent\n\nWhile zeronet is running it will seed the file but once zeronet stop running it will stop and starting again will not start sharing file again (this should come in next version).\n\nIn order to keep exploring this, your feedbacks are welcome. Please feel free to share them here.\n\n!!! Important !!! Using this plugin will show your address IP (it doesn't use Tor) but you should be fine behind a VPN.",
			"added": 1578059110
		},
		{
			"topic_id": 1627161257,
			"title": "Torrent plugin for ZeroNet",
			"body": "I have updated the Torrent plugin and Torrent plugin site.\n\n[/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL](/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL)\n\nIt now supports BitTorrent v2. Careful using it because it will not make you anonymous even if you use ZeroNet with Tor.\n\nThis plugin allows you download files from the Torrent network.\n\n## FAQ\n\n### How to install it\nYou will need to install it via this site [/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL](/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL). Once it is installed you will be asked to restart ZeroNet and then refresh the site.\n\n### How to use it\nYou will be presented with a form to add a torrent via either a magnet link or a .torrent file. To properly test if the plugin is working please click on the `sintel` link which will fill the form with the Sintel movie magnet and then submit.\n\nYou will need to wait a bit for it to connect to peers and start downloading the film. It will then show the video  player and you can start to watch Sintel as it is being downloaded.\n\n### How to stop it\nOnce you have stopped ZeroNet or disabled the plugin (using [/Plugins](/Plugins)) the torrent will not be shared anymore.\n\n### Where is the file saved\nThe file will be saved in your `data` folder under the folder of the site that it has been requested from (so here `1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL`) under a `downloads` folder (e.g `data/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/downloads`).\n\n### How can I hide my identity\nUse a no-logging VPN.\n\n### Where can it be used\nIt can only be used in site that supports and have implemented the specific api of the plugin. Documentation will be available soon. Devs can also take a look at this file for the available actions implemented by the plugin (https://github.com/rllola/zeronet-torrent-plugin-example/blob/master/app/stores/Site.js)\n\n## Whats next\n- UI page for the plugin (show list of torrents and save path)\n- Configuration\n- Dev documentation and tutorial\n\nImportant! This is still work in progress. Don't use it if you don't want to.\n\n# UPDATE\n\nNew version out and should fix the issues mentioned in the comment. \nIf you installed the plugin before, you will need to delete it. Go back to the site, install restart ZeroNet, refresh the page, grant the permission for the site and test the demo!\n",
			"added": 1627161236
		},
		{
			"topic_id": 1632517987,
			"title": "Electrum NMC plugin",
			"body": "Here the install site for the Electrum NMC plugin : http://127.0.0.1:43110/1BD92Qo8p2UnLfkdNeex9CgtYsn2LNAFnN/\n\nThis plugin allow to resolve .bit domain name without using the Zeroname site (so in a decentralized old fashion). It doesn't download the all block chain but only interesting tx by following the SPV protocol. IT desktop friendly.\n\nThis finally an old issue : https://github.com/HelloZeroNet/ZeroNet/issues/407\n\nNothing more has to be done after installing the plugin. It just work out of the box. You can `disabled` the `Zeroname` plugin.\n\nFeedbacks are welcome.",
			"added": 1632517965
		}
	],
	"topic_vote": {
		"4_1Jk6iv2QXUgZo4Y4P5ZUKe7SrpMnGs5unL": 1,
		"1_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1_1M2My6KVbq6UPeE4qpN15LCh2TCitnZsRc": 1,
		"10_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"11_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1510393256_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"1518979406_18YsrRv5LsoqhKgirUbKNy8tXCRN1HqnDw": 1,
		"1522933439_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1528064284_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"1532224996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1532715560_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"1533504784_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1534331588_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA": 1,
		"1534274094_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1535613688_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1,
		"1537231091_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1540170934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": 1,
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1516322022_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1549032910_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1549988261_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": 1,
		"1556748857_16WUTDjmD5j8EznVUgLiksh4Eg2SbFnX35": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1559590587_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": 1,
		"1560444643_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1565466571_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1573477450_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1606531643_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": 1,
		"1625807197_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1624713894_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1632249852_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": 1
	},
	"next_comment_id": 150,
	"comment": {
		"1_17R9N6TFQ5u4MnbppJqbyXt9jNe1WkijRY": [
			{
				"comment_id": 1,
				"body": "> [akito](#comment_126_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): on its blockchain.\nI don't remember reading anything about blockchain for ZeroNet. Only that it using Bitcoin cryptography. Could you point me where you have seen it mentioned ?",
				"added": 1501459523
			},
			{
				"comment_id": 2,
				"body": "> [canvas](#comment_4_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX): In my understanding of Bitcoin cryptography, it is blockchain.\n\nWhen people talk about the 'blockchain' they often refer to the consensus protocol and the way the data are stored or sometimes only the way the data are stored. For the first one I prefer call it the Proof-of-Work chain and not 'blockchain' like SN used to name it in his explanation ( [example here](http://satoshi.nakamotoinstitute.org/emails/cryptography/11/)(clearnet)) but ZeroNet does not use this specific part of the Bitcoin protocol. However, it does use the same cryptography as Bitcoin which is based on the Elliptic Curve Digital Signature Algorithm or ECDSA.",
				"added": 1501490082
			},
			{
				"comment_id": 3,
				"body": "> [akito](#comment_129_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): I think it would be better for you, if you actually gathered some information on the topic instead of throwing shit at a fan directed at us...\n\nI apologize if you find my explanation uncomplete or false. I just tried to share details of my understanding of ZeroNet and Bitcoin. This is the information that I gathered for a small presentation that I have done on the topic.\n\nAlso in the ZeroNet FAQ it is mentioned that ZeroNet doesn't use Bitcoin's blockchain. \n> Does ZeroNet use Bitcoin's blockchain?\n>\n>No, ZeroNet only uses the cryptography of Bitcoin for site addresses and content signing/verification. The users >identification is also based on Bitcoin's BIP32 format.\n>\n>Namecoin's blockchain is being used for domain registrations.\n\n[link FAQ](https://zeronet.readthedocs.io/en/latest/faq/) (clearnet)\n\n\n@yinhongfei789 : You can also find more on ZeroNet protocol on this [PDF](https://zeronet.io/files/ZeroNet_Presentation.pdf) (clearnet)",
				"added": 1501579539
			}
		],
		"5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 4,
				"body": "I haven't tried beaker browser but I looked at their protocol `Dat` : https://datproject.org/\n\nIt is interesting as it can handle sharing big file unlike ZeroNet. But they don't seems to have something as secure as TOR to protect anonymity.",
				"added": 1501925318
			}
		],
		"1_1AqXhGEgfmdaUUsvNp3GL9pueqqLbHMkXp": [
			{
				"comment_id": 5,
				"body": "Do you want to stream directly Zeronet Play's torrent to your KODI ?\n\nIf it is what you are looking for you can try [webtorrent-desktop](https://github.com/webtorrent/webtorrent-desktop) it allow you to broadcast to an appleTV/chromecast/Kodi/osmc.\n\nOtherwise, it would be interesting to have a zeronet plugin that would do that.",
				"added": 1502186904
			},
			{
				"comment_id": 13,
				"body": "> [humanfarmer](#comment_4_1AqXhGEgfmdaUUsvNp3GL9pueqqLbHMkXp): how much $ for the plugin ? this is the future in KODI.1) I can see the PLAY films2) I click on any, it picks the configured resolution3) plays the torrent\n\nWhen saying a zeronet plugin I am talking about a plugin in ZeroNet to stream torrent from the Play zite (or any torrents) to your KODI.\n\nOtherwise, you would need to create a KODI plugin that run zeronet which has Play zite already and can fetch the list of film with its torrents magnets/file and then you can stream then using bittorrent.\n\nThe first solution I am working on it. The second would ask a little bit more coding.\n\nBut the idea of having a plugin that can fetch data from peers instead of a central server sounds quite nice. I do believe however that it must exist somewhere already...",
				"added": 1502732302
			}
		],
		"1_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 6,
				"body": "What about the 30 Sept. -1 Oct. week end ?",
				"added": 1502628233
			},
			{
				"comment_id": 7,
				"body": "I could the friday or thursday before. So 28 or 29 ?",
				"added": 1502651720
			},
			{
				"comment_id": 8,
				"body": "Cool. I am going to book my flight. I have never been to Budapest.",
				"added": 1502653719
			},
			{
				"comment_id": 10,
				"body": "Any recommendation on the best neighborhood where to stay in Budapest ?",
				"added": 1502659161
			},
			{
				"comment_id": 12,
				"body": "> [lime](#comment_3_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR): Is it okay for people to come who do not know how to code? Or is the meet up strictly for developers?\n\nYeah come !",
				"added": 1502710133
			},
			{
				"comment_id": 14,
				"body": "> [ace](#comment_1_1An7ATsNMMNqRgSgB2upWwbpXgFXQ9E2XD): I will be living in the Netherlands in September so I may look into train tickets. Is it going to be organised 100% in this thread?\n\nI guess yes.",
				"added": 1502788249
			},
			{
				"comment_id": 17,
				"body": "Do we have a place where to meet ?",
				"added": 1504542605
			}
		],
		"1_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 9,
				"body": "On https://dotbit.me/ you can buy domain name using paypal. Otherwise if you just want 1USD worth of bitcoins, give your bitcoin address.",
				"added": 1502659085
			},
			{
				"comment_id": 11,
				"body": "> [spukkinfaceship](#comment_1_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): current bitcoin transaction fee is 2 or 3 dollars, so no point trying to transmit one dollars worth of btc...\n\nDamn it ! 2 or 3 dollars ? I though it was still under 1 dollar. I am quite happy that we will soon have Lighning Network.",
				"added": 1502692369
			}
		],
		"1_1M2My6KVbq6UPeE4qpN15LCh2TCitnZsRc": [
			{
				"comment_id": 15,
				"body": "I know. I need to fix it...\n\nI have been spending most of my time working on a torrent plugin for zeronet because of the lack of seeders with webtorrent. I am now trying to add webtrc support to this plugin (which means to libtorrent too and I have no idea how to do that...) so even people without the plugin could get videos from someone with the plugin.\n\nAlso it would be better to implement merger site feature in ZeroTube instead of downloading everything.\n\nThe project is open source if you are interested to resume this project.",
				"added": 1503089599
			}
		],
		"7_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib": [
			{
				"comment_id": 16,
				"body": "I ma wondering if it would be worth the trouble to have a plugin that embeded an ipfs node ? It would also allow for site to check if plugin is installed and then either ask the user to install it or modify its behavior ?",
				"added": 1503426932
			}
		],
		"1518637483_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 18,
				"body": "> [flappyearz](#comment_153_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): How was it?\n\nI would say it went well. It was a small crowd really (12 people).\n\nWe started to talk about censorship and went through the Freedom House report from 2016. I tried then to explain in a really simple way how Zeronet works (might have lost a couple of people on the way). We then talked about the Zeronet advantages and particularities (Tor, Built-in account, Namecoin, Plugins, BigFile,...).\n\nI ended the talk with a small demo and showcase what the community has build. \n\nI had the usual questions : \"What happened if someone download child pornography ?\"  and \"But does it work on Blockchain ?\"\n\nA couple of people talked to me after so I would say it is a win.\n\nI will probably publish the presentation somewhere soon but I want first to change a couple of things. It is always a work in progress.",
				"added": 1518995160
			}
		],
		"1518979406_18YsrRv5LsoqhKgirUbKNy8tXCRN1HqnDw": [
			{
				"comment_id": 19,
				"body": "> [ssdifnskdjfnsdjk](#comment_108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hello, check this project, i have not tried it, if you decide to try it, please report back your finding or issues directly to project's issue tracker.. :)\n\nLook pretty neat. Thanks for sharing.",
				"added": 1518995275
			}
		],
		"1522801185_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 20,
				"body": "> [nofish](#comment_1152_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): It could work (if we add immutable data support), but it's not 100% sure as what if someone joins with 10000 nodes that are distributing different truth?\n\nIf you have the hash on several place you can prove it has existed somehow at one point in the past. If someone come with 10000 nodes they can create a new chain that's all. But the others want to keep it because it is the proof that their document has been timestamped they will ignore the new chain.\n\nI am not really sure how it would work exactly. I have been reading the documents that are referenced in the Bitcoin whitepaper. I also realized that you might need a central server which would be sure that the items are chained and then distribute the hash to the others.\n\nOr each and everyone could have is own hub with his own chain and from time to time you will add the hash of someone else chain in yours which would prove the existence.\n\nI am just throwing ideas here. I haven't figure out how it would work.",
				"added": 1522877490
			}
		],
		"1522933439_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 21,
				"body": "I am just here for the \"I'm drunk as fuck right now\". Lol. Cheers to that.",
				"added": 1522968157
			}
		],
		"1523689892_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 22,
				"body": "Hey !\n\nI wrote this. I didn't found much resources neither but I can share my knowledge if needed.\n\nMight also be interesting in doing an advance tutorial.",
				"added": 1523751733
			}
		],
		"1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 23,
				"body": "I have made some updates in [staging](/staging.mixtape.bit) :\n* Support playlist\n* Fix multiples audio player running at the same time\n* Cleaning the code a little\n\nMy goal for the end of this week :\n* Follow playlist feature\n* Show number of peers by songs\n\nPlease remember that in the staging version you can encounter bugs. Feel free to report it to me. You can also just use the [prod version](/mixtape.bit).",
				"added": 1525275399
			},
			{
				"comment_id": 33,
				"body": "Thanks everyone for your interest in the project.\n\nI will give you a short update on this week development :\n\nI am still struggling on the **Follow Playlist** feature mostly because I used the wrong datetime format in my db. For future reference I advise you to use unix timestamp (or epoch ?) for every time format or you will have a bad time. I have created an issue and will try to work on an a solution (https://github.com/HelloZeroNet/ZeroNet/issues/1415 <-- if there is any regexp wizard here this one is for you).\n\nSo it took most of my free time and I badly failed to have it work. \n\n@eibriel also created a new playlist and wrote an article on how to do it the hard way. Thank you Eibriel.\n\nThis week goal will be to finish this.\n\n> [ssdifnskdjfnsdjk](#comment_253_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Creating your Mixtape on ZeroNet (Spotify alternative) [...]\n\nCreating a playlist from site will be my next mission. I am taking note of a search bar. It is a good idea.",
				"added": 1525778790
			},
			{
				"comment_id": 34,
				"body": "> [sylviecloud](#comment_30_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): I'm sorry for what I did to you lola. But this time we'll both winhttps://www.youtube.com/watch?v=IvVr2uks0C8\n\nLol. What ?",
				"added": 1525947490
			},
			{
				"comment_id": 35,
				"body": "> [capdoki](#comment_5_1Pc2q4qAeEpfsfCi3GSwApiMcfYtudVEPL): Would it support .flac? I have almost everything in my library in .flac format, so it's kind of trouble for me :)Or this is browser's problem?\n\nIt is browser related and I took a quick look at the mozilla site (https://developer.mozilla.org/en-US/docs/Web/HTML/Supported_media_formats) which seems to say that flac is supported. I haven't done the test. Could you try it and give us a feedback ? But I agree flac support would be cool for quality.",
				"added": 1526210755
			},
			{
				"comment_id": 36,
				"body": "> [capdoki](#comment_9_1Pc2q4qAeEpfsfCi3GSwApiMcfYtudVEPL): Mentioned bug: if you click one track more than one time, it starts playing many similar tracks simultaneously => distorts the sound\n\nYeah it is fix but I haven't update the site yet (I had some computer issues).\n\nI never heard of Vilvaldi before. I will test it. Thank you for the feedback.",
				"added": 1526476350
			},
			{
				"comment_id": 37,
				"body": "## Update\n\nI have push on (staging)[/staging.mixtape.bit] the follow feature. I have a couple of issue with alignment (css is the worse) so I am try to fix it first before pushing to the main version.\n\nIf people can test and tell me what you think about it it would be nice.",
				"added": 1526647787
			},
			{
				"comment_id": 38,
				"body": "I spent some time working on my other project (dogecoin spv node). Starting next week I will come back on Mixtape. If there is any bugs or issues on staging let me know I will fix it.",
				"added": 1527880624
			},
			{
				"comment_id": 47,
				"body": "## Update\n\nYou can now create new playlist using the UI. Unfortunately it will requires that you grant admin permission to the site which is not the best. For people who doesn't feel comfortable granting admin permission you can use the tutorial to do it old school.\n\nI have also found a bug in the support feature. Now it should work fine allowing you to automatically download new songs.\n\nI am now working on an edit form.\n\nThe latest feature are now on [staging](/staging.mixtape.bit). I am waiting for you feedback.\n\nEnjoy !",
				"added": 1531952740
			},
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_69_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This is what I want from a music site. The fact that playlists are easy to make and that you can autoseed playlists is why I favor your site. [...]\n\nWe were talking about collaborating with ZeroLSTN. I am really open to the idea.",
				"added": 1532077980
			}
		],
		"1525185835_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 24,
				"body": "> [accept](#comment_4_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP): May be somewhere else...? In France, where there is an Internet censorship... ;)\n\nBudapest can be easier and cheaper for lots of people (and I have to say I kind of want to go back to those ruins bars...). However if enough people want to do it in France, we could.\n\n> [beenotung](#comment_13_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): I would like to join zeronet meet up, however I'm living in Hong Kong, having it in September may have time clash with my study :/\n\nMaybe a second meetup in Asia could be organize at the end of the year ? If you feel like you can organize something in Hong Kong it would be really cool ! I might even try to attempt this meetup.",
				"added": 1525275830
			},
			{
				"comment_id": 26,
				"body": "I am trying to find a way to create a sub-topic dedicated for Zeronet meetup but I cannot find how to do it. Anyone knows ? Or should I just create a separate forum for it ?",
				"added": 1525353622
			},
			{
				"comment_id": 27,
				"body": "> [p2p](#comment_337_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7and then click Sign & publish in the sidebar, and don't forget to post at least one topic in that group, otherwise it will stay at the bottom of the forum.\n\nSweet ! Thank you.",
				"added": 1525356736
			},
			{
				"comment_id": 28,
				"body": "Ok we can talk about organization in this topic :\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1525357146_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u",
				"added": 1525358849
			},
			{
				"comment_id": 29,
				"body": "> [gitcenter](#comment_320_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Come on, why was this deleted? Or am I the only one who can't see the post?\n\nWhich post ? Nothing has been deleted.",
				"added": 1525603835
			},
			{
				"comment_id": 31,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1525358793_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/Meetup+Zeronet+Budapest+September+2018\n\nWe move the discussion here and you can add meetups event that you want to organize.",
				"added": 1525604026
			},
			{
				"comment_id": 39,
				"body": "Up ?",
				"added": 1527955405
			}
		],
		"1525358793_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 30,
				"body": "> [glightstar](#comment_77_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Maybe there could be something like a Livestream as well, so people who can't attend the Meetup, could still be part of it. I, for example, am still a student, and neither have the money to really travel anywhere, nor the time, and TBH, I don't really have the balls to go to some foreign place... But I'd still like to see the stuff in some sort, so I can kinda get a picture of how stuff might get changed, and see cool new ideas!\n\nI think we could. It depends if the speaker is ok to be filmed (might be an issue for some people).\n\nFor the date I propose the end of September like last year (last week maybe 28 - 30 or 21 - 23). The weather is still nice and everyone should be back from summer holidays.",
				"added": 1525603965
			}
		],
		"1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 32,
				"body": "Travel sites like travel guides, booking hotel or houses, forums, ...",
				"added": 1525670689
			}
		],
		"1531122868_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 40,
				"body": "If it says \"content published to 1/5 peers\" you should be fine. But yes you definitely need to wait for at least 1 peer so you content is accessible.\n\nEDIT: I realize that I misread the post and though you were talking about the 'app' and not the 'tab'. So you are fine as long as the zeronet application is running. ",
				"added": 1531125031
			}
		],
		"1531129038_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 41,
				"body": "> [thunder33345](#comment_169_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): sure you shoulddont see why notpersonally i see the core feature of zeronet is integrating with news feedmaking checking multiple sites a thing of the past(wish clearnet has that(notification API personally is not the same as a homepage with everything at a glance))\n\nSame. I really like the notification page. We use to have RSS which wasn't bad but it is starting to be something of the past. I don't think new site are even bothering with it.\n\nAlso I notice because Zeronet sites don't have business model (like selling users data or advertisement) there is no need for developers to use those old tricks on their site (like infinity scroll, notifications, likes...)\n\nOne thing which I also have in mind is the counter on the post. On reddit you can downvote, I am wondering why we don't have the possibility to do it (which I believe is good) and is being able to upvote a good thing ? (I was asking myself this question for the site I am working on)...\n\nI would be interested in having the experience of others devs on that.",
				"added": 1531134375
			},
			{
				"comment_id": 42,
				"body": "> [thunder33345](#comment_170_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): I thought zerotalk and me and also zerohello is infinite scrollingalso personally like the upvote/downvote thing is not a perfect systemnor i can think of any perfect system for voting on commentsworth watching The Downvote Predicament And Why YouTube Comments Suck (and Reddit comments don't) [...]\n\nThank you for the videos. They are really well done and interesting. It gave me good insight of what I could do for my project.\n\nI don't believe there is a perfect system for judging of the validity of a content. I also often look at the numbers of comments on reddit and Zerotalk. I do like the current system here. It is not going to be possible to have a perfect one but having the less terrible one is already great.\n\nMaybe ZeroTalk could use more sub-section like for reddit.\n\nAlso unlike reddit I like that we don't have karma. Upvote are just valable per post which is nice. You have a small incentive to post good and interesting content but no general reward which would led you to create clickbait content for increasing your karma.",
				"added": 1531218389
			},
			{
				"comment_id": 43,
				"body": "> [thunder33345](#comment_171_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): if you like it they also made other content while not directly related it's interesting nonetheless [...]\n\nI have read it but it took me a while :)\n\nI am going to write an article on that. Can I mention you ?",
				"added": 1531479300
			}
		],
		"1531726444_1BG8WrV2VY1bNjQiKR4tcL52FAw6Y6BoJ8": [
			{
				"comment_id": 44,
				"body": "The problem seems to be caused by big javascript file. If you are trying to load javascript script bigger than 1MB it will fail because of the 1MB limit.",
				"added": 1531753592
			},
			{
				"comment_id": 45,
				"body": "I have started a PR so it could be fix and work like before. No need for site dev to do modification : https://github.com/HelloZeroNet/ZeroNet/pull/1487\nReview would be nice.\n\nAnd test...",
				"added": 1531770030
			}
		],
		"1531727504_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 46,
				"body": "Same. The excitement and novelty of those things pass quite fast. Physical activities help. Traveling can also help to break with routine.",
				"added": 1531771330
			}
		],
		"1532143906_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 49,
				"body": "I am wondering if you could somehow ping localhost... ? But now that the port is random it would probably not work.",
				"added": 1532174879
			}
		],
		"1532224996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 50,
				"body": "I am not really interested by the money. I am more interested by the experience. However I believe to create a proper fully functional site and maintain it we might need to pay the developers. There is also stuff that I would like to work on but might take me less time if I could find someone to help or hire someone (like design or user experience stuff). Also knowing that people paid for something and having some kind of obligation could, personally, make me less incline to procrastination.\n\nFor this reason, it might be a good idea to create a fund for ZeroNet projects.\n\nI believe it a good idea @styromaniac maybe something like patreon would work like @krixano suggested but I would prefer something based on crypto-currencies...",
				"added": 1532279673
			},
			{
				"comment_id": 51,
				"body": "> [krixano](#comment_490_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Maybe we can setup a zite that will show different projects and their donation addresses (for bitcoin, etc.), and have updates and community comments, etc. kinda like patreon's posts and community sections. We could also track the people who have donated from there as long as they used the zite to donate. [...]\n\nCould we do it on important zite or do you want to create a new dedicated one ? Maybe a new one would be best.\n\nWe could use payment processor but it would make it less anonymous and less censorship free and people from some countries could not make payment. For transferring into USD you can use localbitcoin (I have done for 2 months in SF exchanging some bitcoins with cash). You could also register in exchange/broker (I personnally tried to avoid). In some places you also have ATM. We can figure something out and write a guide.",
				"added": 1532338664
			},
			{
				"comment_id": 52,
				"body": "The seed issue can also be improve by using Torrent Plugin ;)\n\nYes, it was self-promotion...",
				"added": 1532342881
			},
			{
				"comment_id": 53,
				"body": "> [styromaniac](#comment_97_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Plugins I have to compile might not get usage by me. It's not user-friendly installation, and I've compiled drivers before, so I can do it on a properly configured computer, but I'm not even using my PC anymore and I don't like going through such a process as compiling.\n\nI know I was working on that. I am going to try again to make it easy to install.",
				"added": 1532679738
			},
			{
				"comment_id": 55,
				"body": "> [quantumkitty](#comment_177_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): What seeding issue are we talking about specifically? Why do we need a plugin?\n\nSomeone has apparently some issues but he seems to be the only one...\n\nThe plugin was just an old project of mine which was supposed to be used in ZeroTube to be added next to webtorrent. It is a torrent plugin. The main advantage with it is to be able to connect to the torrent network and find more seed for a particular file and be streamed directly into the browser. Today it is working but it is a bit difficult to install it because it need to compile some libraries.\n\nBy the way if anyone is familiar with Conan... please contact me.",
				"added": 1532696858
			},
			{
				"comment_id": 56,
				"body": "> [zeropyro](#comment_14_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): If nobody seed the video or a zite the download are not resume.Its failed IFS too.Does not help the +seed button in KopyKate or ZeroUp, if not have seeder the current time.Lot of files are dead in this zites.If you run a low visited zite the content.json download always faild because the zite download are not resume too.Low seeded zites are not correctly updated.If you not seed 24/7 your files or zite.And its not popular in the 0Net network,in this case becomes fast unavailable.The protocol is incomplete and have critical bugs.\n\nI am sorry if you misunderstood how Zeronet works. It is a bittorrent like protocol. It is people responsibilities to seed files they want to share but as long as there is one it will be available to you. It is also possible to automatically download and support to help the network. Take a look at the files tab on the homepage.\n\n\nPeople also made available proxies which can help seeding but you can also run it on 15$ small computer (if you still cannot afford this I am sure we can help you).\n\n\nIf you find bug, you can report them on the github page or here.\n\n\nAlso remember that devs and contributors are working for free. It is not always easy to find free time to work on ZeroNet site and this is why we are talking here about creating a fund.\n\n",
				"added": 1532708464
			},
			{
				"comment_id": 57,
				"body": "@zeropyro\n@styromaniac\n\nOouuuuhhhh. I think I get what you mean. It is more of trackers/DHT problem. Do you always have access to all the trackers ? I am personally fine but I can see this being a problem. That's also why the 'help distributing' feature is useful then proxies or people who run permanent node can automatically download from seeders and help distributing.\n\nI confirm that the torrent plugin can help for big files especially if they are already being share on torrent or webtorrent network (thinking of peertube) and I can walk you through the installation process. \n\nAlso the DHT is still work in progress as far as I can tell (https://github.com/HelloZeroNet/ZeroNet/issues/57).",
				"added": 1532723117
			},
			{
				"comment_id": 61,
				"body": "> [zeropyro](#comment_16_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): If i try download a file 11:00.But someone seed it 12:00 the file will not be downloaded. Does not matter me and the seeder are online 12:00.\n\nThis scenario seems really unlikely if a seeder start to seed the file at 12:00 it should be announced to you. I use to work with libtorrent however I am not sure how Zeronet handle this. I will take a look at the code but it might be a mechanism to save bandwidth. It might be trying to prioritize site you are trying to look at the present time. If it is the case it could be possible to configure this in the zeronet config file.\n\nAlso if you don't have the content.json downloaded you cannot know which file to download. So it might be another reason why it fails. The content.json contain the hashes of the files.\n\nAlso are we talking of about optional file ? It might be a different mechanism too.",
				"added": 1532803301
			},
			{
				"comment_id": 62,
				"body": "> [toyata](#comment_4_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): libtorrent doesnt give you automatic tor protection even with zeronet=tor always.With all those 3 strike rules and cease and desist letters, this exposes people to high risk without their knowledge, similar to intentional embedded clearnet content.Imo everything should be routed through ZN, thats why BFS of ZN is a great step forward and only lacks autoreconnect when a new peer goes online at a later point in time and serves missing chunks to anyone who having the corresponding piecemap.\n\nTrue the libtorrent plugin can be an issue for anonymity. It is why it should be a plugin and used with caution. I will make sure it is clear for everyone. However sharing files you have the right to share like original content is not illegal and it is of course what we are talking about.\n\nIt might be possible to use torrent with Tor also but I would recommend a good VPN for better result.",
				"added": 1532952161
			},
			{
				"comment_id": 63,
				"body": "@toyota\n\nI entirely agree with you. I am going to try to clarify some points. \n\n>How? It is impossible without using VPN.\nYou can use torrent with Tor (https://www.best-bittorrent-vpn.com/tor-for-torrents.html) but it is difficult to configure and slow so a VPN is the way to go. \n\n>Otherwise anyone sharing a video is risk to a cease and desist, the same as when uploading content via a normal torrent client and no VPN.\nSharing pirated content is illegal and you risk to have problem is you do. But if you have the permission to share, it is fine. Let's say you created a small fun tv show on hacking you can share via torrent protocol and you won't get problems.\n\nI have been working for 2 years with libtorrent. I never used a VPN to hide (and it is not good practice I was just lazy) and I never had a problem because I was using free torrents (https://www.freetorrent.fr/torrents.php <-- sorry it is in french)\n\n>It is imo even more dangerous as people might not be aware they are revealing their iP automatically by clicking on any video thats copyrighted on your service. They think they are safe/protected by using ZN via tor=always, but your plugin is circumventing tor protection and risking anyone to be easilly exposed without a VPN.\nIt is why it is a plugin. You will have to install it on Zeronet. It won't be there by default only for people who want to use it. I will try to make it as clear as possible about the risk that you mentioned. It could also even be made unavailable if tor is activated to prevent any risk.\n\nRemember this plugin was developed before BigFile where available (which would gave you access to streaming because webtorrent didn't really work well..). It is now just an attempt to get files from torrent network available here (like for example to be use as a bridge with PeerTube). If some people run it they also can make those files accessible for people who only use ZN. No one is forcing you to use it. It is just a fun project.",
				"added": 1533031531
			},
			{
				"comment_id": 64,
				"body": "> [styromaniac](#comment_137_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): So the msgpack files and content.json entries are still generated in a Bigfile-compatible format?\n\nYes, they would. It would not change the core functions of Zeronet. Just add a new feature if installed. Like a chromium browser extension would.",
				"added": 1533057356
			},
			{
				"comment_id": 65,
				"body": "> [styromaniac](#comment_139_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Would the Torrent plugin work on any site with Bigfiles?\n\nYes, it would.\n\nSo far it has been developed when BigFiles were not yet introduced to Zeronet so I created a special zeroframe api but now I can adapt the code to make it compatible with it. So yes.",
				"added": 1533057827
			},
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_140_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): KopyKate BIG Official?IFS?ZeroLSTN?ZeroUp? [...]\n\nIt is not really adding a functionality.\n\nIt would improve the seeding. Allowing a bridge between Torrent network and Zeronet network.",
				"added": 1533058129
			},
			{
				"comment_id": 67,
				"body": "@styromaniac\n\nI started to modify it yesterday. So give me a couple of months and then we can maybe try and see if it really works.",
				"added": 1533058247
			}
		],
		"1532176916_1DHR4ecu1SzoASiC7XH9Y4hoJVbDdgJbow": [
			{
				"comment_id": 54,
				"body": "Do you still needs namecoins ?",
				"added": 1532686739
			}
		],
		"1532697310_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 58,
				"body": "> [thunder33345](#comment_185_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): is it specific to browser or zeronet?i would like a browser plugin that:blocks any webrequest that isnt zeronet boundedand prompt user to whitelist destination or site or allow onceit's simple way to prevent leakage [...]\n\nThe archive plugin is a good idea. I think at one point it was planned to be part of Zeronet by default.\n\nI would also like to be able to have several identities/username under the same masterseed. I don't think it is unsafe unless your masterseed is discovered but it is good enought for Bitcoin wallet so...",
				"added": 1532774770
			},
			{
				"comment_id": 60,
				"body": "I also found a nice tool : http://rg3.github.io/youtube-dl/index.html\n\nCould be use to easily transfert videos from youtube (or others platform) to KopyKate or ZeroUpload or Mixtape. Same this could be a plugin.",
				"added": 1532789499
			}
		],
		"1532715560_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 59,
				"body": "I think it is a good idea. It is also a good practice in general to have hubs.",
				"added": 1532775389
			}
		],
		"1533074344_1NpBDnpSGkXGKLtq9x75Lb846dfgLCWNtn": [
			{
				"comment_id": 68,
				"body": "> [nicwow](#comment_18_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): Sound Cloud I believe is legal. Isn't ZeroLSTN illegal. Idk, I am not lawyer but I kinda thought that was pirating.Not trying to be \"that guy\" but I am \"that guy\". I would like to support my artists work.I wish their was a way to listen to them and use a payment model like Brave Payments though.........sadly I only know of Ujo Music and YouTube.\n\nAre you the same one who posted on reddit ?",
				"added": 1533157041
			},
			{
				"comment_id": 69,
				"body": "> [nicwow](#comment_19_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): Maybe =)(yes)\n\nAh ah !\n\nI was just wondering. But yeah sadly it is not an easy task and I don't think it is possible. I still believe that sharing content even if they don't get money per listening is at the advantage of the artist. They get to be known. I wish we could somehow have them getting a tip or something.\n\nI started to work on music platforms in 2012. I always had the idea to be able to share what I like but also always wanted to respect the work of the artist. I was pretty angry at youtube and those channels which are making money from their channel. I used to have a blog where I would only publish linked of official soundcloud. I realise though that those channels have a huge influence. Even if it would not pay the artist it was a huge chance for people to be publish on those because it would make them known because of all the subscribers. I am strongly against piracy but paying per listen is for me a bit too unpractical and will make it difficult to 'share' the good vibes.\n\nIt might also incentive 'clickbait' song. People would create songs to get paid and we will be stuck with Pitbull. \n\nThis is a subject that I am really interested in talking about tho if you want to resume this in a DM or new subject...",
				"added": 1533158036
			}
		],
		"1534331588_1NF9DMeY1kNvm7yNDcxkVgZ2Y9Jc893bgA": [
			{
				"comment_id": 70,
				"body": "It is in Java. Not sure how easy it would be to integrate in a plugin.\n\nOr we could wrote a python implementation of the SPV node.",
				"added": 1534333176
			},
			{
				"comment_id": 71,
				"body": "> [glightstar](#comment_94_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): I don't know anything about Namecoin's code, but this looked interesting: https://github.com/namecoin/electrum-nmc (it seems to be a client written in python)\n\nIndeed this one is in python and should be a good fit !",
				"added": 1534368394
			}
		],
		"1534333715_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 72,
				"body": "> [krakodeal](#comment_16_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): Did Mike Naya filmed some true facts of someone's illegal actions? Yes he did.Did he reported them to a police before making video of them? I do not know.If police was unaware of these facts - shame on Mike.If police was aware and was able to do something about it but did nothing - shame on police.If police was aware but was unable to do something about it legally - shame on lynching mob.\n\nIt is interesting to see how the public/viewers participated in this story and how it got \"viral\" and how people may have tried to reproduce this content for the sake of views. It made me think deeply about what should and should not be published. I also recommend reading Michel Foucault regarding prison.",
				"added": 1534369066
			}
		],
		"1536060054_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 73,
				"body": "> [deadclover](#comment_2_1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG): Oh, CTF is cool! I like gaming in CTF\n\nAh ah I am not sure we are talking about the same kind of CTF. I am talking about this : https://ctftime.org/ctf-wtf/\n\nIf you are into computer science stuff it is really fun.",
				"added": 1536070117
			},
			{
				"comment_id": 74,
				"body": "> [deadclover](#comment_3_1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG): Yes, I about it\n\nCool ! Sorry I misunderstood your sentence.\n\nThere is a couple of online competitions that I want to do. Would you like to team up ? I am new to it but have been reading some writeups.",
				"added": 1536075761
			},
			{
				"comment_id": 76,
				"body": "> [d14na](#comment_18_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @lola hey, just a quick hello. I read your Write a Plugin Tutorial on DevCenter. it allowed me to quickly and easily create 2 plugins that I really NEEDED to manage things better on ZeroNet. They're not quite complete yet, but I'll post to git once they're a little more polished. Thanks! [...]\n\nGlad that it helped. I need to write a more advance tutorial and looking into packaging and distributing plugins (so far we are doing hacky by git cloning directly). Really excited to see what you have done. \n\nLast year, I have done the junior CTF at (34C3)[https://archive.aachen.ccc.de/junior.34c3ctf.ccc.ac/index.html] (My team was  RainbowRockerz ). It was junior but it was not easy at all lol. One of the organizer was nice enough to spend time with me and teach me some stuff. I hope to do better next year.",
				"added": 1536328839
			},
			{
				"comment_id": 82,
				"body": "> [d0049](#comment_1_1H6NpEfqbtwB7ksSn3dx51Y3UespNLdFJf): I found it fun, but don't know where to start.\n\nYou can look at this https://trailofbits.github.io/ctf/intro/find.html\n\nThere is also some good write up on yt : https://www.youtube.com/user/RootOfTheNull/videos\nHe also created a list of ressources that can be usefull : https://github.com/JohnHammond/ctf-katana\n\nWe can also select one soon and try to do it together.",
				"added": 1537646848
			}
		],
		"1536069895_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 75,
				"body": "> [styromaniac](#comment_66_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Better sidebar compatibility on mobileZeroHello system notifications'Share to site' file parsing via system promptSite name + favicon shortcuts automatically generatedSet to open an application by default on click of a file typeZero:// protocol or eliminate the prefixes altogetherOptional no browser chromeOptional fullscreenGive each site a separate window so the OS handles switching between them more gracefullyOpen site(s) at bootToggle 0 button visibility on all sitesMake 'Show Data Director'y actually work on mobileHave premade bookmarks for Stats and other such hidden pages\n\nAll of that would be fcking great. I am going to attempt a POC using PyQT and webkit but for mobile I would definitely go Kivy + native webview and the zeronet-kivy guy has done a great job and fixed the Vagrant for me.\n\nHowever maintaining 2 projects could be annoying but choosing having one for all could be too hacky at the end...",
				"added": 1536076457
			},
			{
				"comment_id": 77,
				"body": "I have looked into https://github.com/kustomzone/Fuzium \n\nOriginally I also though that using Electron would be a neat way to make a browser because of how easy is it to do cross platform app. However, because Zeronet is written in python I feel we should keep this language for the browser and also because I want to package it with Zeronet.\n\nLet's see how the PoC will be in python...",
				"added": 1536500832
			},
			{
				"comment_id": 78,
				"body": "> [daniell](#comment_63_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): You can run Python code on Electron.\n\nReally ? How ?",
				"added": 1536578844
			},
			{
				"comment_id": 79,
				"body": "> [naholyr](#comment_7_1HWk8h9HnBsRABw75gyXkbu7WSBSwEmTXg): you can always execute \"python file.py\" from Node anyway\n\nYeah... But it feels hacky. And if you want to execute complexe tasks it would quickly become a shit show.\n\nWritting a C++ implementation of Zeronet would make it possible though... You could write bindings and use it in Node and Python. But... C++.",
				"added": 1536765714
			},
			{
				"comment_id": 80,
				"body": "> [d14na](#comment_42_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): this seems inevitable, but I don't know c/c++, so I can only be with you in spirit :pgood luck!\n\nI am pretty bad at it too. I have done bindings for c++/node for libtorrent and it was hell. I agree that this would be really nice and might offer more flexibility and better performance.",
				"added": 1536859773
			},
			{
				"comment_id": 81,
				"body": "> [naholyr](#comment_10_1HWk8h9HnBsRABw75gyXkbu7WSBSwEmTXg): You don't necessarily have to make it too hacky, another possible way would be to write an IPC-aware Python app directly running ZeroNet, so you can execute it from Node and communicate with standard IPC channel. Your Python app becomes just a \"compatibility wrapper\" between ZeroNet and Node binaries. How about that?\n\nIt is really good option and an idea worth exploring. I will spend some time looking into IPC.",
				"added": 1536864195
			},
			{
				"comment_id": 96,
				"body": "So more than one month later I have something. It has been pretty straight forward to get a minimal browser working. What was more tricky was the pyinstaller script and a really weird behavior with it which need a small PR for it to work.\n\nHere my repo : \nhttps://github.com/rllola/ZeronetBrowser",
				"added": 1539656222
			},
			{
				"comment_id": 97,
				"body": "> [d14na](#comment_73_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @lola ImportError: No module named PyQt5 [...]\n\nFor Ubuntu 18.04, I needed to do that :\n```\nsudo apt install python-pyqt5\nsudo apt install python-pyqt5.qtwebengine python-pyqt5.qtwebkit\n```\nLet me know if it works for you.",
				"added": 1539711234
			},
			{
				"comment_id": 98,
				"body": "> [d14na](#comment_74_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @lola I just tried it again, but still no luck. Even booted up a fresh Ubuntu install to see if that made a difference. I opened an issue on your repo, if that might make it easier to debug. [...]\n\nOk I am going to look into it in a VM. You said that you have pyton 2.7 installed right ?",
				"added": 1539840076
			},
			{
				"comment_id": 99,
				"body": "> [d14na](#comment_77_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): So no PyQt5 libraries on CentOS. Next try will be to compile from source on Ubuntu. I'll let you know.\n\nCool thank you. \n\nI have found this gist (https://gist.github.com/hsercanatli/9773597f58a9961b558b58d2f0cffe6c) that I am testing for a travis build. Travis doesn't seems to have pyqt5 library neither.\n\nI think I am just going to a do a build locally and publish on github. Might take a while until I found a solution or get an answer from support.",
				"added": 1540150893
			},
			{
				"comment_id": 100,
				"body": "Now looking into PyQTdeploy https://pypi.org/project/pyqtdeploy/\n\nInstead of using pyinstaller which doesnt support mobile (android and iOS).\n\nBy the way, I am focusing on the packaging and distribution side because I believe it is important but there is plenty of features which can be added if you have some python experience. The projec is open for contribution https://github.com/rllola/ZeronetBrowser",
				"added": 1540152339
			},
			{
				"comment_id": 101,
				"body": "@d14na Maybe you can try the executable I have publish. I have built locally and uploaded it to github. Not my favorite method but travis is giving me a hard time...\n\nhttps://github.com/rllola/ZeronetBrowser/releases/tag/v0.1.0",
				"added": 1540236173
			},
			{
				"comment_id": 102,
				"body": "> [d14na](#comment_78_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @lola SUCCESS!! Wow, I'm really happy to see this working. I'll try to check it out more later today. [...]\n\nYes they are self-contained and you can still update ZeroNet code and audit it ! I am also going to leave the code for the browser in clear in the package so people can verify what it does.\n\nAnd for `PyQt5` I am still struggling in travis to have it work. I am testing anaconda so I can have something which would work cross-platform and more easy to deal with. https://www.anaconda.com",
				"added": 1540313026
			},
			{
				"comment_id": 104,
				"body": "> [d14na](#comment_79_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): okay, that's really fantastic! I haven't had time this week (juggling a bunch of projects), but I'm looking forward to using the browser for some upcoming testing, where I want a clean environment (from a Fist-time User perspective). I'll definitely post detailed feedback at that time. [...]\n\nWith the help of Travis support we finally got it working. I am now doing the same for OSX and then I will look into Windows.\n\nIt might take me a while but in the same time people could start working on :\n- Navigation bar. I already started, it is not that difficult if you are familiar with python.\n- Site on Zeronet with description of the project, donation qrcode and downloading latest version of it.",
				"added": 1540640657
			},
			{
				"comment_id": 105,
				"body": "Build for windows avaiable : https://github.com/rllola/ZeronetBrowser/releases/tag/v0.1.2\n\nNext step is actually finishing the basic functionalities and test pqtdeploy for Andorid/iOS",
				"added": 1541310673
			},
			{
				"comment_id": 106,
				"body": "> [andreas](#comment_3_16ExhLrK3XmMRhe7XWHJYHdJZa6JnzHr6R): 154 MB? :/\n\nYes, it is shipped with python, zeronet and all the dependencies... Good side of it, it is supposed to work out of the box. Bad side, it is heavy.",
				"added": 1541473189
			},
			{
				"comment_id": 107,
				"body": "> [fenial](#comment_2_16A9WgvZF8Vuci8q61gcWEikqEMQf6XjwJ): will it support tor usage?\n\nI am not super familiar with Tor but I want to. Anyone who want to help is welcome to do a PR. \n\nIt does work with Tor if you have it running in your computer but it is not bundle with it.",
				"added": 1541555417
			}
		],
		"1537880954_1PBLyfpS2m3DFJpz4p4An3ko99oF5BQrgt": [
			{
				"comment_id": 83,
				"body": "> [gitcenter](#comment_364_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There's a realtime chat on 0Play Game Center (you need the PeerMessage plugin to use it). I made 0Play Game Center and also the chat, but I've lost the private keys for the site. I'm also going to make a better mail service for ZeroNet. It'll support something like chat. [...]\n\nI started to use IRC. I think it could be a nice place where to chat. I also use thunderwave a lot.",
				"added": 1537903846
			}
		],
		"1538246886_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 84,
				"body": "> [pexo](#comment_21_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): In my infinite omnipotence I shall predict that in no more than 12 full moons there will be the next one to be unveiled. [...]\n\nBrace yourself because soon we will have WebAssembly !",
				"added": 1538433545
			}
		],
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 85,
				"body": "I am not convinced neither by the project but some big names have work on it. Makes me wonder if there is something that I am missing ?",
				"added": 1539118920
			},
			{
				"comment_id": 86,
				"body": "> [shibeotp](#comment_2_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): Hi, I heard about it, in fact, ZeroNet is a good compromise, but the fact is that there is a very low number of users, also requires a connection through an application and can be too complicated for those who do not know a minimum of how it works.In fact SOLID, has a slightly different way of operating, and still too immature to use it, in addition to the POD is something that allows you to store your data in a private server. and it would not work well in a P2P infrastructure unless a POD manager knows who the POD is of which user. [...]\n\nThe POD concept makes me think of FOAF and they actually mention it somewhere in the site. It is a really neat concept but instead of having the POD on servers at your place you seems to host people data and have your data on some people servers. My only questions is are those data encrypted ?\n\nBut POD + ZKA (Zero Knowledge Architecture) could be a cool new standard. Lets keep an eye on it.",
				"added": 1539132460
			},
			{
				"comment_id": 87,
				"body": "> [wabbe](#comment_7_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): No problem I think. You can install your own POD server at home.\n\nBut it doesnt necessarily means that your data is not going to be on an other POD ?\n\nAlso I don't understand the all \"You own your data\" thing. Because once it is shared it can be harvested and shared again without your consent...",
				"added": 1539186297
			}
		],
		"1539131791_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 88,
				"body": "> [homulilly](#comment_79_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Interesting, but why the need for a plugin? Couldn't you just embed webtorrent in a zeronet site?\n\nI did that a couple of years ago with ZeroTube. It didnt worked well because once your browser is closed your are not on the newtork anymore. Also @trenta3 is right Webtorrent in browser is only working with webtorrent peers. The experience wasn't really conclusive. I started to work on this plugin instead, then the Big File feature has been added but I believe that the plugin can act as a bridge.\n\nAlso while doing research for ZeroTube I have discovered PeerTube. It is using Webtorrent but also use a hybrid node giving you access to torrent newtork too. Blender and others are starting to use it. We could create a clone on ZeroNet allowing people to access without installing peertube and support the newtork at the same time.\n\nAlso last but not least libtorrent has been developed since 2001 and is pretty efficient.",
				"added": 1539188043
			},
			{
				"comment_id": 89,
				"body": "> [freeperson](#comment_21_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6): Can you connect with other clients over ZeroNet only using the Zero:// protocol? Are there any plans for i2p support, like i2p snark?\n\nPeople without the plugin can still connect with the ZeroNet protocol like usual. Concerning i2p I don't know...",
				"added": 1539188297
			},
			{
				"comment_id": 90,
				"body": "> [freeperson](#comment_23_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6): If people are only connecting via the zero protocol is it more anonymous or does it expose ones IP address?\n\nIf you are using ZeroNet you are as anonymous as ZeroNet. If you have activated the plugin and are using it you are as anonymous as Bittorrent so yes your IP address is exposed. \n\nJust a note : it is the same for ZeroNet if you havent activated Tor. \n\nIt is also why I have added the important section. To make sure people understand that by using the plugin you are exposed. You can however use a VPN and it will hide your IP address while using the plugin.",
				"added": 1539195268
			},
			{
				"comment_id": 91,
				"body": "> [thunder33345](#comment_263_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i get a \"Torrent plugin not installed\" on the site even tho i am pretty sure i did\n\nWhat happen if you do f5 ? \nIn the `plugins/Torrent` folder have you tried to run `test.py` ? Just to make sure the built lib is compatible with your system.",
				"added": 1539195512
			},
			{
				"comment_id": 92,
				"body": "> [thunder33345](#comment_264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): due to lack of the python binaries(still dont know where zeronet hides that) which i failed to find i cant test thatbut i do found this[02:22:03] PluginManager Plugin Plugin-Torrent load error: ImportError: DLL load failed: The specified module could not be found. in PluginManager.py line 50 > builtins.py line 93 > __init__.py line 1 > builtins.py line 93 > TorrentPlugin.py line 2 > builtins.py line 93 [...]\n\nOk cool. You need to rename your folder 'Plugin-Torrent' to 'Torrent' and you should be able to find it. The name of the folder define the name of the plugin. I know it is not the best.",
				"added": 1539199163
			},
			{
				"comment_id": 93,
				"body": "> [thunder33345](#comment_264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): due to lack of the python binaries(still dont know where zeronet hides that) which i failed to find i cant test thatbut i do found this[02:22:03] PluginManager Plugin Plugin-Torrent load error: ImportError: DLL load failed: The specified module could not be found. in PluginManager.py line 50 > builtins.py line 93 > __init__.py line 1 > builtins.py line 93 > TorrentPlugin.py line 2 > builtins.py line 93 [...]\n\nAlso from the log I can tell that your are missing some dependencies... You are running on windows right ?",
				"added": 1539199253
			},
			{
				"comment_id": 94,
				"body": "> [thunder33345](#comment_265_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): yep that solves it oh well that sucks you cant name it something else\n\nZeroNet is able to load it. That's why I saw it in the log but when the test website is looking for the plugin it looks for  \"Torrrent\" and wont get that \"Plugin-Torrent\" is actually the correct plugin.\n\nConcerning the missing dependency... I might have forgot something in the Zip because when I build locally I dont have the problem. I am going to switch machine and take a look at it.",
				"added": 1539202901
			},
			{
				"comment_id": 95,
				"body": "Cool to hear that some people got it working on Windows. I personnaly tried but I don't seems to have it working with ZeroBundle. Might be because it is python x86 and I have built libtorrent on x64...",
				"added": 1539231814
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 103,
				"body": "123",
				"added": 1540431275
			},
			{
				"comment_id": 108,
				"body": "test",
				"added": 1542268775
			},
			{
				"comment_id": 109,
				"body": "> [511](#comment_2_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv): How many linux users are here and which distro?\n\nubuntu",
				"added": 1542281030
			},
			{
				"comment_id": 110,
				"body": "lol",
				"added": 1546092847
			}
		],
		"1546285113_1LQfRyignLepAZoVq55vajMQTm15wooA5V": [
			{
				"comment_id": 111,
				"body": "Dogecoin.\n\nAnd I am not joking.",
				"added": 1549148016
			},
			{
				"comment_id": 112,
				"body": "> [somename666](#comment_4_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): Use that Dogecoin\n\n",
				"added": 1549215828
			}
		],
		"1549333095_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 113,
				"body": "> [zeronetix](#comment_12_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): I prefer to use Vue.js but React is ok at all too. Need nothing special, just include zeroframe library and play with it as described in official zf docs.\n\nLots of people are using Vue.js now. I need to try. It is just always a pain to learn new framework... I got lazy.",
				"added": 1549382962
			}
		],
		"1549988261_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": [
			{
				"comment_id": 114,
				"body": "Hi!\n\nYou might want to try : \n```\n{\n    \"zeronet\": {\n        \"\": \"19TKfCHjaMWhTcyF8cUp95TrsutYmzGVRS\"\n    }\n}\n```\n\nI am not sure yet this standard is supported. This one should work.",
				"added": 1549989217
			}
		],
		"1549990519_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 115,
				"body": "> [klu9](#comment_51_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I'm not sure I understand what this does (and I'm on Windows for now so I can't try it yet). Could you give an example use to explain? Or what problems does it solve?\n\nIt just allows you to read torrent files in the zeronet. It will download the magnet or torrent file given to the sites directory. It makes it possible to stream videos or music from the torrent newtork (To be use with caution because it not anonymous.\n\nAn use case for this would be to mirror Peertube (which use webtorrent hybrid node) and have content accessible from Zeronet. People with the plugin could download it from Peertube peers and then serve it as BigFile to Zeronet users who doesn't have the plugin.",
				"added": 1550421024
			},
			{
				"comment_id": 116,
				"body": "> [testtesttt](#comment_2_1G8q2HUhxjFPR9FngDgf3cZFoJHzEaU5nP): Fuck Yes !!  Been waiting for this for a long time.  Tu viens a EthCC a Paris?  Ca cera cool de te revoir.  A+\n\nThanks! Non, je ne pense pas venir  EthCC. Je ne serais pas dans les environs.",
				"added": 1550421088
			}
		],
		"1550822852_1QDDk8ikEQbFpbnfhubtHLyBAZC9JHnrkX": [
			{
				"comment_id": 117,
				"body": "I have seen a post of a russian guy using Bitcoin miners to dry his clothes. I agree, I think we should go toward that.",
				"added": 1550828976
			}
		],
		"1556748857_16WUTDjmD5j8EznVUgLiksh4Eg2SbFnX35": [
			{
				"comment_id": 118,
				"body": "We already tried Webtorrent + ZeroNet. Didn't worked well because once you close the page the peers disappears. So now we have BigFile and it works much better because the peers are seeding as long as you have the ZeroNet running.\n\nYou can also use the torrent plugin to have a bridge torrent-zeronet but it needs to be re-write for python3.\n\nBut yeah I want to have that too.",
				"added": 1556749700
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 119,
				"body": "Lol. Fun name.",
				"added": 1557592846
			}
		],
		"1559590587_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 120,
				"body": "I should work on a small site to publish the release for the web browser on it. But please keep in mind it is highly experimental.",
				"added": 1559742234
			}
		],
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": [
			{
				"comment_id": 121,
				"body": "Yep. And here some python books (and others) for the peeps.\n[/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_1CKt2mJ6qoDx2YzuJLKr7d2uyLFSDkqfzm](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_1CKt2mJ6qoDx2YzuJLKr7d2uyLFSDkqfzm)",
				"added": 1560118926
			}
		],
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": [
			{
				"comment_id": 122,
				"body": "I have been here for some years. I kind of like it because of the lack of content too... Clearnet as become a huge machine of creating engagement in order for companies to get their investment back and it does get frustrating and time consuming. Here it is more chill. I like it.",
				"added": 1560205277
			}
		],
		"1560245103_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 123,
				"body": "> [pubg](#comment_49_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR): Doc about zeronet\n\n+1 and you will find more information in this section (/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/dbschema_json/)[/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/dbschema_json/]\n\nIt would help to have access to the source code to answer your question or even at least the `dbschema.json` file. You can also use sqlitebrowser to test your query.",
				"added": 1560272566
			},
			{
				"comment_id": 124,
				"body": "Also I think to update a value, you can just modify the `data.json` and sign it. It will automatically update the value in your database once it has detected modification in the json file.",
				"added": 1560272820
			}
		],
		"1558983538_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 125,
				"body": "> [pexo](#comment_102_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Shame. [...]\n\nI am not sure if it is exactly what you want but I have created a Bittorrent plugin last year. It is still working but now only for python2. \n\n[/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/](/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/)\n\nI have plans to migrate to python3 and improve the api.",
				"added": 1560555076
			}
		],
		"1578059130_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 126,
				"body": "> [babisai5552](#comment_2_18nt3sviw9WH14xJbggoDNvPfE5sMaMhDX): when i post a magnet link and click submit nothing happens\n\nYou don't see the status bar ? If you can tried with the Sintel torrent (you can click the Sintel link and it will add the magnet link in the form) because sometimes it is because it can't find a peer to download the metatadata from.",
				"added": 1578226307
			},
			{
				"comment_id": 127,
				"body": "> [draugrdeathlord](#comment_177_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Should something happen after i click submit ? i tried on both of my Browsers to be sure. It doesn't do anything.(Sintel)\n\nYeah it should show the status bar and show the video player (and start to play)... If it is not happening it might be an issue with libtorrent... I have only tested on Ubuntu 18.04\n\nWhat OS are you on ?",
				"added": 1578238681
			},
			{
				"comment_id": 128,
				"body": "> [anshorei](#comment_78_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): It could be interesting to make a similar plugin using I2PSnark torrents, those enjoy the protections offered by Tor-like routing.\n\nI am not familiar with I2PSnark torrents but I can look into it. I also believe Tor-like routing for anonimity would be nice.",
				"added": 1578312976
			},
			{
				"comment_id": 129,
				"body": "> [schiz0](#comment_92_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): on ubuntu 18.10 nothing happens\n\nFuk... I am going to add a log file to get more information on the issue. Do you see anything in the log which could help ?",
				"added": 1578313283
			}
		],
		"1606531643_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 130,
				"body": "I like poached eggs. Please don't judge me",
				"added": 1606651761
			}
		],
		"1627161257_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 131,
				"body": "> [suchamazingdude](#comment_3_1ByMNprXfr5dSfPErFqLPW1nvqAZphqR5D): whats the point of using something that can deanonimize you with ease?(anyway, thanks for contributing to ZeroNet life, but still...)\n\nYou can use it behind a VPN to hide your identity. I redirect you to this article for more information https://www.downloadprivacy.com/tor-for-torrents",
				"added": 1627212605
			},
			{
				"comment_id": 132,
				"body": "I have updated the original post with more information.",
				"added": 1627214428
			},
			{
				"comment_id": 133,
				"body": "I have updated to v0.4.4 (rev8) to correct a bug in the streaming part.",
				"added": 1627229237
			},
			{
				"comment_id": 134,
				"body": "> [jeff](#comment_129_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): I'm not getting the add torrent form. I did get this message, though:ErrorDisplaying 1 of 1 lines found in the last 189kB of the log file. (189kB total)[2021-07-25 12:33:55,315] ERROR PluginManager Plugin Torrent load error: ImportError: DLL load failed: The specified module could not be found. in <core>/src/Plugin/PluginManager.py line 138 > ...\n\nOk interesting...\nWhat OS do you use ? and what version of ZeroNet ?\n\nDo you think you could look into your logs the full error ? I suspect the compiled version of libtorrent I am shipping is not working on your system. It should support linux, osx and windows tho.",
				"added": 1627235247
			},
			{
				"comment_id": 135,
				"body": "> [jeff](#comment_130_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): ZN Version 0.7.2 (rev4555) running on Win 7 64 bit. That is the entire error message.\n\nI have only fully tested it on Linux. I am going to try on windows. However I am afraid windows 7 is a bit old for it to work as is.",
				"added": 1627239963
			},
			{
				"comment_id": 136,
				"body": "> [jeff](#comment_131_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Oh well, maybe it's just not meant to be.\n\nI am sorry... Thank you for giving it a try. I will keep investigating.",
				"added": 1627241560
			},
			{
				"comment_id": 137,
				"body": "So I just realized that the dependency of the plugin is not properly distributed. The libtorrent.so is bigger than 10MB so it will be shared only as an optional file and optional files can't be installed as plugin.\n\nI need to rethink how I can distribute this.\n\nAn temporary work around is to unzip the corresponding zip (https://github.com/rllola/zeronet-torrent-plugin/releases/tag/v0.4.4) under `1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/plugin/(darwin|linux|win32)/Torrent` (make sure to choose the correct platform as the folder for the plugin) and try to install.",
				"added": 1627245362
			},
			{
				"comment_id": 138,
				"body": "# Update\n\nNew version out and should fix the issues mentioned in the comment.\nIf you installed the plugin before, you will need to delete it. Go back to the site, install restart ZeroNet, refresh the page, grant the permission for the site and test the demo!\n\n> [styromaniac](#comment_3166_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm wondering if you're able to link to the zip archive contents. [...]\n\nYeah I did that. I hope it works ok.\n\n\n**jeff@zeroid.bit** If you were using the  ZeroNet bundle it might have failed because I build against python 3.8 and not 3.7 like for the windows bundle. Let me know if it fixes it. I am going to test on my side too.\n\nIf this works, I will try to get videos from peertube... a channel or something like this in a new site. See if we can bridge the two services. Would be neat also to serve files downloaded using Torrent in ZeroNet for folks who can't use the plugin.",
				"added": 1628078584
			},
			{
				"comment_id": 139,
				"body": "> [styromaniac](#comment_3183_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are you targeting Android at all? I haven't seen the Sintel video on your site using Android. I'm about to test your latest revision on Linux. Edit: I still don't see Sintel on Linux.\n\nUnfortunately no. I don't have much time to spare so I will focus on the main platforms. It should be possible tho as I have seen Torrent apps on Android.",
				"added": 1629237092
			},
			{
				"comment_id": 140,
				"body": "> [jeff](#comment_136_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Yes, that worked! I've run into two other quirks, though. The sintil video downloaded, but it wasn't saved. The /data/1ChMN.../downloads folder isn't there either. When I tried to d/l again, the Submit button doesn't respond.  I deleted and reinstalled the plugin, but that didn't help.\n\nYou might need to restart ZeroNet. It is pretty much a PoC and there is a lot of bugs. Thanks for reporting.\n\nI will try to add some logs to figure out what's happening in your case.",
				"added": 1629237376
			},
			{
				"comment_id": 141,
				"body": "> [6283822](#comment_117_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): wait a minute, i thiought i already compiled libtorrent.so for Android, long time ago. It might be useful.https://github.com/canewsin/LibTorrent-Android/tree/master/app/src/main/cpp/libtorrent\n\nTy! Yeah that would be a good place to start from.",
				"added": 1631005329
			},
			{
				"comment_id": 142,
				"body": "> [ssdifnskdjfnsdjk](#comment_1081_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @lola i see this error in the log:ERROR PluginManager Plugin Torrent load error: ImportError: /home/myname/zeronet/data/_plugins_/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/plugin/linux/Torrent/libtorrent/libtorrent.so: undefined symbol: Pytracemallocconfig in PluginManager.py line 138 > ?/data/_plugins_/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/plugin/linux/Torrent/_init.py line 7 > ?/data/__plugins/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/plugin/linux/Torrent/TorrentPlugin.py line 6 > ?/data/__plugins/1ChMNjXpW5vU5iXb9DSXzqAUfY46Pc2RTL/plugin/linux/Torrent/libtorrent/__init.py line 1 [...]\n\nThe latest Torrent plugin version is rev12. Looks like the latest update took sometime to propagate. I am going to seed it for a while. Maybe someone with a proxy could help ?",
				"added": 1631005412
			},
			{
				"comment_id": 143,
				"body": "> [139472](#comment_3_1LbvNdqw2Y3xc1Zcxm6k2ZbcN5k3xAXsF3): Is it compatible with web seeders? It's an essential torrent feature!\n\nI have checked the features in libtorrent and there is the `HTTP seed` (if I am not mistaken it is the same as web seed). So it should be supported.\n\nSee https://www.libtorrent.org/features.html",
				"added": 1631542277
			},
			{
				"comment_id": 144,
				"body": "> [ssdifnskdjfnsdjk](#comment_1105_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Pytracemallocconfig\n\nWhat python3 version and what system are you using ?",
				"added": 1631542328
			},
			{
				"comment_id": 145,
				"body": "> [transcoder](#comment_33_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): this plugin would work a lot better i think if it supported adding proxies to it so for instance you could anonymize it over i2p or something of that nature.\n\nIt is possible already but I am missing the interface for it. This version is still a poc. I am taking notes of it  though.",
				"added": 1631542429
			},
			{
				"comment_id": 146,
				"body": "> [styromaniac@kxoid.bit](#comment_78_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Does this also allow creation of BitTorrent trackers?\n\nNo it does not. I think it should stay separated. There is already good open source code that allows creating BitTorrent trackers (like OpenTracker?).",
				"added": 1631542794
			},
			{
				"comment_id": 147,
				"body": "> [6283822](#comment_118_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): i was not able to create kxoid.bit,  [...]\n\nMaybe we can move the discussion to a dedicated forum (features, supports, bug...)?",
				"added": 1631543291
			},
			{
				"comment_id": 148,
				"body": "> [ssdifnskdjfnsdjk](#comment_1106_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Python 3.9.6-1, Linux Manjaro (Arch based) stable\n\nOh I need to compile libtorrent for each version of python. I believe I don't have 3.9. I will add this to my list.",
				"added": 1631547413
			},
			{
				"comment_id": 149,
				"body": "> [styromaniac@kxoid.bit](#comment_95_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): You didn't reply to my other comment about KKBO not working while this plugin is installed.\n\nYes sorry. I didn't have the time to check it. I will investigate asap and let you know. Do you know who run it in case I need to contact them ?",
				"added": 1631570745
			}
		]
	},
	"comment_vote": {
		"4_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"972_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"5_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": 1,
		"7_1N1bEAsjdqCy5f7SG6jPXUoa1BA2QES8DZ": 1,
		"269_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"117_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"40_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"55_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"9_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"31_1PfpsxK9HpYgyPkBtdr7C7UJNfhMwFACue": 1,
		"135_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"13_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"3_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": 1,
		"73_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"31_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": 1,
		"321_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"46_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"4_1GSRaRPZCcWUiQxz2cKYDd8s9WL5zCMJ83": 1,
		"4_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
		"110_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"13_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": 1,
		"170_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"8_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx": 1,
		"1176_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_1BG8WrV2VY1bNjQiKR4tcL52FAw6Y6BoJ8": 1,
		"4_18Fiosd2Z4CG9bzpYJUERCr1k8T1kSuomn": 1,
		"490_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"227_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"139_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"19_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": 1,
		"168_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"94_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"4_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"16_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu": 1,
		"3_1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG": 1,
		"66_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"19_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"4_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"18_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"7_1HWk8h9HnBsRABw75gyXkbu7WSBSwEmTXg": 1,
		"42_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"677_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"483_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1": 1,
		"218_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"64_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"705_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"265_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"63_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"9_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"372_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"21_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"12_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"266_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"78_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"69_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"2_1Ji1cTwqd2B4Ka2xe22wPz5TRzQ6BM1P4": 1,
		"2_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": 1,
		"79_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"80_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"4_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB": 1,
		"286_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"105_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"1_1HkYTMKuQW4FS3EBTfLbS5dAZ1DSsKpZVc": 1,
		"2_1N2WfXhs791TrszCnZL24mK4DSQfPcAZZs": 1,
		"1258_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"31_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": 1,
		"2_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"24_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"21_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"21_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd": 1,
		"22_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd": 1,
		"135_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"850_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"49_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": 1,
		"1_19mAuNGqnePcvAmLuq6856A4PNY5MdySsc": 1,
		"22_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"883_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": 1,
		"117_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}