{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "> [mclanarb](#comment_10_1QHtQkdJDXnioEAmVWda3hZmw87WHS5A9b): Juche TV é um canal no Youtube em língua portuguesa que combate a manipulação midiática contra a Coreia do Norte, divulgando a verdade sobre o país. Foi ao ar pela primeira vez em 20 de setembro de 2017.\n> \n> https://invidio.us/channel/UCDL1vd54UFeyKiqeyIRI6xQ\n\n#Coreia do Norte em Foco.\n- https://www.facebook.com/coreiadonorteemfoco/\n\nCoreia do Norte em Foco tem como objetivo divulgar as conquistas do regime socialista da República Popular Democrática da Coreia.\n\n#Blog Solidariedade a Coreia Popular\n- https://solidariedadecoreiapopular.blogspot.com/\n\nO Blog Solidariedade a Coreia Popular é a página oficial do Centro de Estudos da Ideia Juche - Brasil. O objetivo do Blog criado em 2010 é divulgar informações sobre a Coreia Popular, criando assim um contraponto às constumeiras mentiras e deturpações da imprensa ocidental.\n\n#Centro de Estudos da Política Songun – Brasil\n- https://cepsongunbr.com/\n- https://www.facebook.com/CEPSBR/\n- https://invidio.us/channel/UC001pdZ7vaiksSDtyvlgmMg\n- https://twitter.com/CEPSBR\n- https://www.instagram.com/cepsongunbr/\n\nO Centro de Estudos da Política Songun – Brasil é uma organização responsável pelo estudo da política de valorização dos aspectos militares adotada pela República Popular Democrática da Coreia, além da discussão sobre temas históricos, políticos, econômicos, filosóficos e sociais do país.\n\n#KFA - Brasil - Associação de Amizade com a Coreia\n- https://korea-dpr.com/index.html\n- https://www.facebook.com/KFA.Brasil/\n\nA Associação de Amizade da Coreia (KFA) foi fundada em novembro de Juche 89 (2000) com o objetivo de construir laços internacionais com a República Democrática Popular da Coreia. Tem atuação em 120 países. A KFA tem total reconhecimento do Governo da República Popular Democrática da Coreia, e foi criada com a aprovação desta.\n\n#O Outro Lado da Coreia do Norte\n- https://www.facebook.com/OOutroLadodaCoreiadoNorte/\n- https://invidio.us/channel/UC4RwYem5zm74VxqV1wPVPMg\n\nPagina com o objetivo de mostrar O Outro Lado da Coreia do Norte, que vive constantemente sendo bombardeada com enxurradas de mentiras, falacias e calunias por parte da grande mídia.",
				"added": 1588427275
			}
		]
	},
	"comment_vote": {}
}