{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#Computação quântica para todos (The MIT Press) - Chris Bernhardt\n- https://ipfs.infura.io/ipfs/QmSMq9iyvtHmP6p7Yx6q1J6nMthdt89KvXQmitexLqyedr\n\nA computação quântica é uma bela fusão da física quântica e da ciência da computação, incorporando algumas das idéias mais impressionantes da física do século XX em uma maneira totalmente nova de pensar sobre a computação. Neste livro, [Chris Bernhardt](https://www.chrisbernhardt.info/home) oferece uma introdução à computação quântica que é acessível a qualquer pessoa que se sinta à vontade com a matemática do ensino médio. Ele explica qubits, entrelaçamento, teletransporte quântico, algoritmos quânticos e outros tópicos relacionados ao quantum da maneira mais clara possível para o leitor em geral.\n\n#[Errata](https://pt.wikipedia.org/wiki/Errata): https://ipfs.infura.io/ipfs/QmU1rF5ZUmu3GeAX7fHTVj71coLRRdecxFJXxN1LkLcMbL",
				"added": 1592063004
			},
			{
				"comment_id": 3,
				"body": "#Capitalismo e colapso ambiental - Luiz Marques\n- https://ipfs.infura.io/ipfs/QmXwpcs6WTTwsAL89NY1ssoy6XPnvYZwxHLJrbpTHBq4PL\n\n#Descrição:\nA perspectiva de um colapso ambiental vem sendo evidenciada pelas ciências e pelas humanidades desde os anos 1960. Hoje, ela impõe sua urgência. Achim Steiner, subsecretário-geral da ONU, adverte incessantemente: “se nada for feito, o colapso dos serviços prestados pelos ecossistemas é uma clara possibilidade”. Esse colapso difere dos das civilizações passadas por não ser nem local, nem apenas civilizacional. Ele é global e ocorre no nível mais amplo da biosfera, da qual as sociedades humanas dependem existencialmente. Evitar a falência das estruturas de sustentação dos ecossistemas, voltar a “caber” na biosfera, isso só será possível se desmontarmos a engrenagem socioeconômica expansiva que moldou nossas sociedades desde o século XVI. A sociedade futura será pós-capitalista ou não será uma sociedade complexa, e mesmo talvez, deve-se temer, sociedade alguma. Alargar esse consenso nascente foi o que motivou este livro.\n\n#Sobre o Autor:\nLuiz Marques é professor do Departamento de História (IFCH) da Unicamp. Publicou diversos livros e ensaios sobre a Tradição Clássica e, mais recentemente, também sobre a crescente degradação antropogênica dos ecossistemas, entre os quais, “Brazil. The legacy of slavery and environmental suicide” (History of Nations, Londres, Thames & Hudson, 2012). Atualmente participa, com um coletivo de professores da Unicamp, da criação do portal Crisálida, dedicado a informação, pesquisa, debate e mobilização acadêmica em torno das crises socioambientais contemporâneas.\n\n#Vídeo sobre o livro: https://invidio.us/_tuBDRmrqTs",
				"added": 1592063086
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 2,
				"body": "#O Quantum Katas é uma série de tutoriais individualizados para ajudá-lo a aprender [computação quântica](https://everipedia.org/wiki/lang_en/Quantum_computing) e [programação Q#](https://github.com/microsoft/Quantum.git).\n\n- https://github.com/microsoft/QuantumKatas.git",
				"added": 1592063065
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 4,
				"body": "#Fundamentos do ECOSSOCIALISMO\n- https://invidio.us/WcpZG3HkEtQ\n- https://swarm-gateways.net/bzz:/7c4630c168b489a1b7ff5b340bf2c54cea988a921c8740a7f9146e8025705a77/Fundamentos_do_ECOSSOCIALISMO.mp4\n\n#Principais obras dos autores citados:\nMichael Löwy - https://ipfs.infura.io/ipfs/QmYgjSxVfXreyutrM9zcQM37AtsGBuytf9YVin2vkYAw2v\nJohn Bellamy Foster - https://ipfs.infura.io/ipfs/QmTYBYYchAu6Bt86yXyDLLmJfM4wrLZr52XXNY9TrEvD7A\nKohei Saito - https://ipfs.infura.io/ipfs/QmUT68EHgHkFgdJGAZnrv7GfeupaBxw5iT5eYgamhtyB4s",
				"added": 1592064104
			},
			{
				"comment_id": 5,
				"body": "#Diálogos com Marx — ECOLOGIA | Michael Löwy, Sabrina Fernandes e Camila Moreno\n- https://invidio.us/21IzYwB9bTc\n\nÉ possível preservar o meio ambiente sem romper com o capitalismo? Como desenvolver nossa sociedade sem esgotar os recursos naturais? O que é ecossocialismo? Essas questões e muitas outras foram discutidas neste encontro especial do ciclo de debates Diálogos com Marx.",
				"added": 1592065045
			},
			{
				"comment_id": 6,
				"body": "#Entrevista com Sabrina Fernandes, do canal [Tese Onze](https://invidio.us/channel/UC0fGGprihDIlQ3ykWvcb9hg) (31.5.19)\nhttps://invidio.us/q5ABD0mbCFQ",
				"added": 1592065112
			},
			{
				"comment_id": 7,
				"body": "#COMO COMEÇAR A LER MARX?\n- https://invidio.us/rzhzXCTE1ko",
				"added": 1592065254
			},
			{
				"comment_id": 8,
				"body": "#Jones Manoel explica o colapso do capitalismo\n- https://invidio.us/cx_-T2y8BLM\n\nO jornalista Leonardo Attuch entrevista o pensador Jones Manoel sobre a profundidade da crise capitalista.",
				"added": 1592065384
			},
			{
				"comment_id": 9,
				"body": "#Introdução ao método da teoria social - José Paulo Netto\nhttps://ipfs.infura.io/ipfs/QmfF4uyTcNEGto8imGYEP7RGWWPemcaiW7MxuWLDTKQsFe",
				"added": 1592066243
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#Da Servidão Moderna\n- https://open.lbry.com/Da-Servidão-Moderna:3\n\nO objetivo principal deste filme é de por em dia a condição do escravo moderno dentro do sistema totalitário mercante e de evidenciar as formas de mistificação que ocultam esta condição subserviente. Ele foi feito com o único objetivo de atacar de frente a organização dominante do mundo.\n\n#Livro: https://ipfs.infura.io/ipfs/QmQuMzkAtG5pq4cxuP8PgntqkvHt2YVwcM2atrmbv6gF46\n\n",
				"added": 1592067053
			}
		]
	},
	"comment_vote": {}
}