{"cert_user_id": "ROBERT-MCDOWELL@github", "next_comment_id": 6, "comment": {"1604065216_mirrored_WeirdCarrotMonster_github": [{"comment_id": 1, "body": "please first stop to bully. Secondly, if you think that zeronet is a nightmare so fork it and make your own.", "added": 1495852046, "modified": 1495852046, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/382#issuecomment-304429070", "source_type": "github"}], "1604065299_mirrored_Tomas-M_github": [{"comment_id": 2, "body": "crazy how google, firefox and other are just stealing all flash technology, ipfs uses a \"smart\" global sharedObject implemented in actionscript3 8 years ago.", "added": 1520551434, "modified": 1520551459, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-371692575", "source_type": "github"}], "1604065812_mirrored_sonatagreen_github": [{"comment_id": 3, "body": "On 3/14/2017 12:34 PM, Sonata Green wrote:\n\n> As I understand it, it's currently possible to create a site that \n> /doesn't/ update, by refraining from making use of the update feature; \n> but it's not currently possible to create a site that /can't/ update.\n>\n> A site that /can/ update, even if it /doesn't/, provides no verifiable \n> guarantee that it /won't/.\n>\n> ------------------------------------------------------------------------\n>\n> Sites can contain Javascript; therefore, sites are computer programs. \n> Zeronet's sandboxing security model limits the damage that malicious \n> sites can do, but users who choose to run a particular program benefit \n> from being able to rely on it doing what they expect.\n>\n> Security requires code review.\n>\n> For any site that even in principle could possibly ever update, each \n> user must either:\n>\n>  1. review the code every time she visits; or\n>  2. pause the site so as to block future updates; or\n>  3. accept on faith that the site owner will not push a malicious (or\n>     careless) update.\n>\n> Only option 2 is compatible with reasonable security practices. Even \n> then, it's not possible to write a hyperlink to a particular version \n> of a site, so even if there's widespread consensus that site X is not \n> evil as of date Y, I can't readily download the date-Y version of X.\n>\n> ------------------------------------------------------------------------\n>\n> Zeronet is based on Bittorrent.\n>\n> Imagine a version of Bittorrent where, even after you finished \n> downloading a file, by default the original uploader could /push a \n> different version/ so that /the copy on your machine was automatically \n> replaced without notifying you/.\n>\n> Imagine if, even if you turned off automatic updates for a particular \n> file, there was no way for a tracker website to publish a .torrent \n> file referring to a specific version, so that no matter how \n> well-vetted a particular .torrent file was, it would always be \n> possible for the original uploader to decide unilaterally that any \n> newcomers downloading the file for the first time should get an \n> altered version of the file instead of the well-vetted original.\n>\n> Would you want to use such a thing?\n>\n> ------------------------------------------------------------------------\n>\n> There are many cases where it's good for updating a site to be \n> possible. There are also cases where it's /very bad/ for it to be \n> possible to update a site /even if that possibility is never exercised/.\n>\n> The site owner being able to refrain from updating the site is /very \n> different/ from ordinary users being able to be sure that the site can \n> never be changed.\n>\n>\n\nDo you mean that use zeronet is more risky that to use the conventional \nclient -> server website?\nwhat about if zeronet has a config to deactivate completely any client \nside code like javascript as an option?\n\n", "added": 1489509898, "modified": 1489509898, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/859#issuecomment-286537910", "source_type": "github"}], "1604065842_mirrored_jancborchardt_github": [{"comment_id": 4, "body": "contributors don't need to be considered as free employees after the organization is created.\r\nthats' the case for most of so called open source projects hijacked as a so called \"foundation\" or \"community\" blablah. If you think that it's more serious to create an organization I would say no, since today a hierarchy is obsolete, thanks to the internet open source tools which developer and contributor teams can easily manage any serious project without any leader or investor. But maybe Mr jancborchardt (http://jancborchardt.net) has more interest that zeronet becoming an \"organization\"? Could you elaborate why it will be better for you?", "added": 1492929601, "modified": 1492930329, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/882#issuecomment-296431359", "source_type": "github"}], "1604066263_mirrored_0polar_github": [{"comment_id": 5, "body": "My opinion, all this crypto currency mood is a trap, a massive trap for a one world currency based on nothing.", "added": 1514705765, "modified": 1514705765, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1213#issuecomment-354596771", "source_type": "github"}]}}