{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1517556000_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1514422899_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 1,
				"body": "Luckily he's just an actor.. If he is that bad of an actor, I would just stop watching movies he plays in... lol\nAs long as the blacklists are optional, I'm okay with it. You don't want to censor \"uncensorable sites\"..",
				"added": 1517749906
			},
			{
				"comment_id": 2,
				"body": "> [krixano](#comment_269_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): One thing that may be of help is having zites be automatically deleted if you have not visited them for a certain period of time. I don't think this would be hard to implement in the client, but the only question is how long to wait before zites are deleted. This could be optional and you could allow people to control this amount of time.\n\nI actually like this. This would help people save tons of ssd/hdd space. And bad sites would die eventually.",
				"added": 1517750073
			}
		],
		"1525800997_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 3,
				"body": "I hardly drink coffee. Has the potential to fuck up my biological clock even more and draining even more energy in the long run.So I usually drink tea unless I absolutely need something stronger.",
				"added": 1525801295
			}
		],
		"1525797672_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 4,
				"body": "Please don't commercialize this platform. Haven't you seen what businesses did to \"Social Media\"? They've made it \"Business Media\" with all their monetized promotions and ads.",
				"added": 1525801745
			},
			{
				"comment_id": 5,
				"body": "> [thunder33345](#comment_29_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): by that i just meant simply allowing people to sell and buy stuff, which personally i find zeronet is lacking/not possible, not really thinking zeronet should be some network that everything requires moneybut personally i believe it will just be one of these things that wont be possible due to how zeronet worktho if one really want it's not really impossible to have say promoted ads in zerome or promoted posts in zerotalk if the site admins really want that(or just run coinhive at your sites already), i would argue it isnt really needed due to how the site hosting itself is already free\n\nIt will get  out of control. It's not about the money. On every social media platform the feeds show to many business ads/promotions.  If businesses find out they could potentially make money on ZeroNet, 9 out of 10 posts on ZeroMe would be \"Buy tickets now and come see us!\" posted from a business account. Do we really want that here on ZeroNet? I'm just hoping this will stay a platform which enables me to communicate with real people, instead of businesses.",
				"added": 1525806428
			}
		]
	},
	"comment_vote": {
		"269_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"3_1ENrYUYUHj6DcykKxnJmTJTppdQEwMPgSM": 1,
		"144_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"3_1PDNRLfMxyxUmEM7PnBy3tp2BdWPjyZ4Y5": 1
	}
}