{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1528558109,
			"title": "Running Mail Server",
			"body": "I'm no expert, I mainly do hobby projects, and I'm wondering if a mail server is one that I ought to get into or stay out of. It looks to me like it can be a bit costly, and isn't a one-and-done deal, but rather requires constant work to keep it secure and off blacklists etc. Anyone else got their own mail server and want to share?",
			"added": 1528558108
		}
	],
	"topic_vote": {
		"1527022297_1Nr4AQaJrccU6StFBXogUSGVCX7hUAHHSB": 1,
		"1523804682_1FkxDSUsa4ex8zTQcrmdtm7oaGCUNjBh9F": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 1,
				"body": "The Venus Project is in essence the desire to return to the womb and live forever in an amniotic sack within a mothering AI that takes care of one's every need. There are many, many aspects of the project which are simply primed and ready to fail, but we can discuss a few to start.\n1. Happiness is positively created\nThe idea that you can simply sit on a mountaintop somewhere and breathe yourself to happiness is silly. We are not innately happy and made unhappy by our surroundings. If you have ever mastered anything or accomplished any great task, then you know that this is the genesis of happiness: doing things makes us happy, not doing nothing. This has been known since ancient times. And yes, you will make people more agreeable if you make sure all of their basic needs are met, but it is frankly childish to think that doing this will make everyone get along.\n2. Actualization diminishes hatred\nThis utopia is meant to reduce conflicts between people by deploying whatever type of pacifier they want when a need arises. Of course people who have everything already still hate each other: see suburbanite high schools, populated by teenagers of the middle class. People have no hesitation when it comes to being hateful, normally--it's very, very easy to find something to dislike about someone. However when you self actualize, and fulfill some kind of goal for yourself, you do so by overcoming the flaws in your own nature (while not entirely removing them either). And in facing your own flaws, you are more able to face the flaws in other people as well, because you're no longer denying your flaws and projecting them onto other people, are miraculously you start to hate humanity a little less. So in this world where there is nothing to be done and conquered--sure brilliant people can come up with genius ideas and creations, but that is a virtually non-existent portion of the population--where do the masses turn to actualize? I'll pose another question, to answer that: we already have government programs that give poor urban-dwellers housing, food, water, etc., and where do the men in those societies go to actualize? Violent gangs. Whereas people in the hills of west Virginia without even running water or subsidized power grids grin and bear it.\n3. Behavioral sink\nThere is a lot of back and forth on whether or not John B. Calhoun's rat experiments have any bearing on human nature in urban spaces. I think it plays out on large scales. For example: humans are necessarily territorial. Old cities with organic designs developed over centuries of habitation like London are conducive to territorial understandings of one's surroundings, as opposed to modern grid-based cities in America or ancient China. Cities with very unplanned designs about them tend to be the ones that are the most \"lively\" as we know them: there is a more prolific flourishing of the arts and of intellectual discussion (not that these things don't happen outside of urban spaces, but they are harder to get going there), whereas in grid cities, people feel more akin to \"units of labor\" being transported to and from their functions, and these cities develop slower, if at all. The Venus Project of course proposes we abandon our current cities and take up residence in yet more closely-planned cities of radiating central zones. From a mathematical perspective, maybe it works (like OP said, \"110% logic\"), but in practice this is an obvious recipe for failure. God help us if the more gruesome aspects of behavioral sink become true in these kinds of utopias, like the experiments have shown.",
				"added": 1525813347
			}
		],
		"1527176149_1D1DTxbngBSkKe6BfHPyuudBrB8ZapNjoV": [
			{
				"comment_id": 2,
				"body": "Why are you even on a decentralized platform? I thought you hated this kind of thing because it's not owned and controlled by the state. Wouldn't you rather just be on a service that only lets you visit .gov sites, just to make sure they are as censored and government-approved as possible?",
				"added": 1527213068
			},
			{
				"comment_id": 3,
				"body": "> [skwerlman](#comment_65_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): ah, the classic \"conflate everyone on the left with neoliberals\" gag.\nI'm aware of the many flavors of the left. But I think it is safe to say that a key feature there is government rules and regulation. Even if there were little to no corporate regulation, leftists would demand there be regulation of society, and almost certainly of the web itself. Is it not fair to say that anyone on the left has a regulatory bent in some way?\n\n> [nzrcbotnet001](#comment_1_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f): Something that isn't controlled by a state, could still end up being controlled by a wealthy corporation ... it would just become a government surrogate.\nI hate to make such an oft-repeated argument, but it's just too easy to create a substitute in a market economy. I mean, we're all here, on this grassroots, alternative service in the first place. You have to admit it works. The difference between actual government ownership/regulation and \"surrogate government\" ownership by a firm is that the government is allowed to use threats and violence to get their way. If a firm is threatened by a new innovation, then they improve, and/or the new service flourishes besides. If the government says they're the only entity allowed to provide telecom services, and you try and start up your own, you're going to get guys with guns knocking on your door. Corporations are only \"above the law\" when there is a government with a monopoly on violence which they can control. In the absolute worst case: the state is a gun in the hand of a corporation. So take the gun away, and they'll have to play a whole lot nicer. This is why we created the separation between church and state--wars of religion in Europe killed tens of thousands of people because they all wanted to control the state and use it against their enemies. Removing the state's ability to intervene in religious affairs ended that. Where there is state power, there emerges violence to control that power. Corporations have never achieved \"government surrogate\" status without there actually being a government for them to use in the first place.",
				"added": 1527282529
			}
		],
		"1527416420_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 4,
				"body": "> [thunder33345](#comment_101_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i mean if they do,we all know what it takes is just someone stepping up to be an alternate game store[...]\n\nCame here to post this. It's not REALLY an issue, I think. If there's a demand for these games, and they're legal, then it'll be served one way or another.",
				"added": 1527436573
			}
		]
	},
	"comment_vote": {
		"1_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"101_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"22_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1,
		"71_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": 1
	}
}