{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "How do I avoid state influences on my life?",
			"body": "I disbelieve that state's laws are actually laws, like the law of cause-effect and the law of gravity. Laws are models of experimentally found, consistent, predictable behaviors, whose quality is a correspondent response to observable characteristics of itself or other objects that it interacts with; in other words, laws are a definition of mechanic or remote interactions in a causal relationship that are consistent with respect to other iterations and instances of itself. That does not correspond to what is perceptible of what the state call “laws”.\nState laws are exclusively the declaration that state agents are supposed to make an effort to approximate future state-of-affairs to what the state's desires are for it. It does not, by any means, guarantee that the state agents will make that effort, much less that the effort made will be sufficient to cause future state-of-affairs to correspond at any degree of accuracy to what the state desires.\nPutting aside the legitimacy and unquestionability that would be inferred onto state “laws” by them actually being laws, all that is left is coercion, a state-emitted attitude that causes other entities other than the state to be held hostage to its wants and needs, much like an object whose existence is to serve a purpose and not itself. And that can certainly be questioned, avoided or even struggled against since coercion is not a law. You can even disagree with the model of the law of gravity, however you cannot question the law of gravity itself since its existence and behavior is independent of what you think of and do about it, unlike the state's “laws”.\nI do not consider neither submit to the imposition, that I am purposeful object. I am a sentient entity with intrinsic wills and the efforts that I made will be directed at the purpose of satisfying my own human requirements. That brings me to the original question: How can I completely mitigate the state needs and wants such that my own's would not be influenced or conflicted by the state's?\nIgnoring the state's existence will not make it or its “laws's” influences go away. Living in the woods is unrealistic to me personally, and fighting the state head on is self-destructing to me giving its size and power to canalize it on a specific entity.\n\nI would like to leave this thread open to discussion and suggestions now.",
			"added": 1600789399
		}
	],
	"topic_vote": {
		"1_18SFer1zAMegr8LEtnFPWK8MnneWkYtZzr": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_192xAupujZXB6jpoWqpwobPnEdQovAKiXc": [
			{
				"comment_id": 1,
				"body": "Why?",
				"added": 1600796052
			}
		]
	},
	"comment_vote": {}
}