{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 1,
				"body": "Oh man. It took me a half hour to get a new cert. I guess I'm glad for all the popularity. Hopefully the devs of 08chan and Zeronet can both rise to the challenge and the attack on 8chan can actually have been for the best in the long run.",
				"added": 1565365167
			},
			{
				"comment_id": 6,
				"body": "Update: Still stuck at \"updating: 2185\" but when I attempt use the Zite it appears to be working properly. Of course I can't see the posts I can't see. But I do see quite a few and appear to be able to reply to them.",
				"added": 1565468917
			}
		],
		"1565373995_1PLaPnEwcMKPkfSJxta8vHr7kXjN7GR82V": [
			{
				"comment_id": 2,
				"body": "You're going to want to go ahead and make sure you have some bitcoin or monero on hand too. You are going to need that somewhere along the process guaranteed. Make sure who ever you procure services from has a reputation in a community or a rating in a place where rating systems are reliable.",
				"added": 1565378462
			},
			{
				"comment_id": 3,
				"body": "> [fodase](#comment_11_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): zeronet is not a place for criminals. get lost scumbag.\n\nThat's not fair. You have no idea why he needs it. He could be trying to escape from a dictatorship for all you know.",
				"added": 1565381731
			},
			{
				"comment_id": 4,
				"body": "> [fodase](#comment_12_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): If that was the case, he should have made it clear, which he didn't.You're also a criminal for helping him. I hope you both get jailed because people like you are the reason projects like zeronet get badmouthed.I'm not in favor of censorship but I also don't like criminals.\n\nWithout knowing what jurisdiction hes in there is no way of knowing if he is a criminal according to my legal system. If he is one of my nations enemies then it could be laudable, legally speaking, to help him undermine the criminal regime he lives under.",
				"added": 1565402321
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 5,
				"body": "Even establishment shills like paul krugman are calling BS on this one. That's how transparent it is this time.",
				"added": 1565467206
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 7,
				"body": "> [bvcfbfbcbcvd](#comment_4_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Good answers. The key stuff sounds very nice yet somehow \"too obvious\" to not have been thought of before just the last few years, so I assume there must be some heavy downside to this which I haven't yet thought of... [...]\n\nTry SRWare Iron.",
				"added": 1565578462
			},
			{
				"comment_id": 8,
				"body": "> [montecarlo](#comment_2_14YF6gMYCfUxtez1sJ8btUkD9u8Q4P6h9H): Impossible. Google has no power over ZeroNet because it's distributed across thousands of users. The very posts you're reading are stored and seeded across each participant's PC and not a singular network, so the content is pretty much immutable unless you choose to block the user id. ZeroNet is not beholden to the constraints of clearnet. No DNS so CloudFlare cannot censor it. It cannot be indexed nor blacklisted by Google. The only way to kill ZeroNet is to kill the trackers, as far as I know.\n\nTrackers can be decentralized as long as a perspective user can find some bootstrapping information somewhere about atleast a couple of currently active nodes. I suspect we might be vulnerable to DDOS until the network is massive. If someone with a botnet with thousands or tens of thousands of IPs started connecting to everyone and not sharing any data thus making 95% of the peers you are connected to non functional and requesting data and throwing it out there by clogging the few remaining legitimate seeders ability to distribute files to real people... that would be a tough nut to crack.",
				"added": 1565589637
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 9,
				"body": "Whats with having to build zeronet from source? I never used to have to do that. Why no Linux binaries any more?",
				"added": 1565658459
			}
		],
		"1565806779_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 10,
				"body": "This thread? http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:39343381-08bd-41be-9c8c-fd101da32bf4",
				"added": 1565807785
			},
			{
				"comment_id": 11,
				"body": "> [wejehteman2](#comment_10_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): This thread? http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:39343381-08bd-41be-9c8c-fd101da32bf4\n\nI bumped it with a comment \"test/bump\" let me know if you see it.",
				"added": 1565807856
			},
			{
				"comment_id": 12,
				"body": "> [dtek](#comment_9_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y/Nigger+hate+thread\n\nThanks for clarifying. Nate Higgers thread is pretty good too though.",
				"added": 1565809613
			},
			{
				"comment_id": 20,
				"body": "> [ratsmack](#comment_13_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Nigger hating threads are always fun... unless you're a nigger.\n\nPoor chaps. I really do feel bad for them. They can't help the way they were born.",
				"added": 1565847914
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 13,
				"body": "Every time I see graffiti I have no idea what on gods flat earth it says. Can blacks read that. If so how come they can read that but not normal English?",
				"added": 1565809683
			},
			{
				"comment_id": 16,
				"body": "> [spiegel](#comment_4_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd): based and redpilled. [...]\n\nI couldn't disagree more. The Jews are hard working and almost all of them are successful. They look out for each other and aren't afraid to put the interests of their group above the consideration of any other. They are calm and collected and not boisterous or obnoxious. Honestly, the only real criticism I have of them is that they rely of deceit, trickery and destruction to reach their ends rather than hard work, creation and honest face to face challenge. While the white man will challenge you to a duel at high noon the jew will poison you in your sleep. \n\nA lot of the hate, I think, comes from the fact that they are our enemy. Of course a lot of it comes from the negatives I pointed out above, but a lot of it too is hating the player for the game.\n\nAnd so yea, niggers, they are like a literal plague. A blight. Like locusts and breed like them too. They devour and destroy everywhere they go. If they get anywhere NEAR your property you have to sell and move before its value implodes. If you are in their area of town YOU BETTER HAVE ENOUGH GAS IN YOUR CAR AND PRAY YOU GET IT SERVICED REGULARLY. Jews aren't beautiful, but they don't look like fucking monkies. They don't go months without washing their hair. Sorry, just not the same league for me. Not even close.",
				"added": 1565828362
			},
			{
				"comment_id": 22,
				"body": "> [spiegel](#comment_5_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd): This literally doesn't matter. Jews rape kids. Non-jewish kids, YOUR kids if they could. They have starved people that look like you to death in the hundreds of millions. And they have laughed about it, they are even proud of it. They want to have YOU as a filthy slave and kill you if you dare defend yourself because in their eyes you are not human, you are cattle. [...]\n\n/Shrug. You just don't know who I am and the values I have. I'm a true reactionary. I don't fundamentally oppose society having elites. I don't oppose the strong dominating the weak. They want me to be their slave? I'm not that offended by that because I also want them to be my slave. They starved to death hundreds of millions? Yea that's pretty shitty. I don't know if I could do the same to them. But I have the wherewithal to recognize that that's probably weakness on my part. A crocodile doesn't stop to contemplate the feelings of his meal, he just conquers. You aren't human in their eyes? Are they human in your eyes? Why hate someone for something you are guilty of yourself? \n\nI read your whole post as \"my opponent is winning and not me and therefor I hate him\". Well I'm sorry, thats not a good reason to hate someone, not to me.\n\nLife is fundamentally about competition. Humans never escaped from nature and its games and we never will. The strong out compete the week spread their genes and the weak die. Through this process the species grows stronger. Life is Darwinian. Except for being clever AF we are animals just like all the rest.\n\nNow, all that being said, I do have some reasons that I don't like them. I don't like how their strategies resemble that of a parasite. I don't like how they focus more on bringing others down than raising themselves up. I don't like how the get power through destruction instead of creation. Where as whites are the opposite. We build to elevate ourselves rather than tearing down others to make ourselves seem taller. When we conquer we do it with honor rather than subterfuge and subversion.\n\nYou are accusing me of being vain. And you are hitting at some truth here. I think you are alluding to the idea that my preference appears to be aesthetic more than fundamental. This is true. But I would argue that preference for being around people is always going to boil down to aesthetics. How annoying they are how much they stink. So maybe the Jew who is near me is thinking in his heady \"filthy goy\" when he looks at me, so what? I'm thinking \"filthy jew\" in my head, even steven. Atleast he isn't chimping out and stinking and dripping grease everywhere. He can think what ever he wants, I can be around unpleasant thoughts, I can't be around unpleasant noises, odors, and crashing property values if it's my property.",
				"added": 1565910015
			}
		],
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 14,
				"body": "The Nazis had 3 components. Socialism, Nationalism, and White Supremacy. Modern alt right only has one of those three. The modern alt right is made up of Nationalism and White Advocacy. Which is actually pretty open ended. In that way I would say Nazis fall into the category alt right but being alt right doesn't make you a Nazi at all. It's like saying Hitler is a human but being a human doesn't make you Hitler.",
				"added": 1565812880
			},
			{
				"comment_id": 15,
				"body": "> [russianspy]\n\nSays the national socialists weren't socialist and accuses me of revisionism. You're a funny little man.",
				"added": 1565824543
			},
			{
				"comment_id": 17,
				"body": "> [dfgdsfgertyrety4](#comment_6_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP): The real 'alt-right' are anarchists.\n\nNo they are not. This is so stupid. Alt right is just anyone who is a nationalist and willing to engage in identity politics on behalf of white people and white interests. That's all it is. They can be capitalist or socialist. It doesn't make any claims about economics. It's a big tent philosophy.",
				"added": 1565828953
			},
			{
				"comment_id": 18,
				"body": "> [memesadler](#comment_62_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Homo-sapiens are exempt from Darwin's theory of evolution. Egalitarianists are inherently creationists when it comes to humans.\n\nIts because we can breed with them and have offspring that are just as fertile as the parents. That's why we are technically the same species. That's the litmus test. Those species that look identical but are different species, they are different enough below the surface that they can't do that.\n\nAlso the reason they look so similar is they are a different species. Among their own species the differences are obvious to them.\n\nAnd also I would point out that all dogs are still dogs but think about the amount of polymorphism in dogs.\n\nYou don't need to make it this black and white. We can accurately say that whites and negroids are in the process of transpeciation but not quite there yet.",
				"added": 1565836499
			},
			{
				"comment_id": 21,
				"body": "> [nvhgfd7856f8](#comment_5_12KbcTzaEjQyNsWtKV7JSXyE8eJNRuj8EP): All dogs are dogs, but not all breeds of dogs can naturally mix. Even if they could, not all of them would, and that's important. The reproductive barrier between races is more than just social.\n\nYou may have a very good point here that I hadn't considered. Perhaps scientists identify distinct species by whether they do breed with each other or not, and not whether they technically CAN breed with each other. Now that I think about it I think it is actually the former.",
				"added": 1565908346
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 19,
				"body": "keep a copy of torbrowser inside the varacrypt drive and use that to browse",
				"added": 1565847845
			}
		]
	},
	"comment_vote": {
		"1_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"2_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"3_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"81_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"6_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"26_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"8_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"10_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"11_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"100_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"19_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"6_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"9_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"14_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"57_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"13_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"16_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"17_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"18_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"22_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"48_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1
	}
}