{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1539790604,
			"title": "Pentagon report points to US preparations for total war. \"Over the past two weeks, with next to no media coverage, the US has moved substantially closer toward open military confrontation with both Russia and China, the 2nd- and 3rd-ranked nuclear powers in the world.\"",
			"body": "Pentagon report points to US preparations for total war\nBy Andre Damon\n11 October 2018\n\nOver the past two weeks, with next to no media coverage, the United States has moved substantially closer toward open military confrontation with both Russia and China, the second- and third-ranked nuclear powers in the world.\n\nOn October 3, the United States threatened, for the first time since the Cold War, to directly attack the Russian homeland. UN Ambassador to NATO Kay Bailey Hutchison accused the country of violating the Intermediate Range Nuclear Forces (INF) treaty by developing a nuclear cruise missile and said that Washington was preparing to “take out” the weapon with a US strike.\n\nThis statement came just three days after a Chinese warship set a collision course with a US destroyer carrying out a so-called “freedom of navigation” operation in the South China Sea, forcing the American ship to maneuver to avoid a collision and the potentially deadliest military clash in the Pacific in decades.\n\nBehind such hair-raising incidents, the United States is undertaking serious, long-term preparations to restructure the American economy to fight a major war with a “peer” adversary, entailing radical changes to American economic, social and political life.\n\nThis is the essential content of a 146-page document released by the Pentagon last Friday, titled “Assessing and Strengthening the Manufacturing and Defense Industrial Base and Supply Chain Resiliency of the United States.” It makes it clear that Washington is preparing not just for isolated regional clashes, but rather for a massive, long-term war effort against Russia and China under conditions of potential national autarchy.\nMartin employees work on the F-35 Lightning II Joint Strike Fighter production line in Fort Worth, Texas [Credit - Defense Contract Management Agency].jpg\n\nThe document made clear that a major restructuring of the American economy will be necessary to reach the United States military’s stated goal of being prepared to “fight tonight” against a “peer adversary.” The United States must “retool” for “great-power competition,” the document declared.\n\n“America’s manufacturing and defense industrial base,” observes the report, creates the “platform and systems” upon which “our Warfighter depends.” This complex encompasses not just the government, but the private sector, as well as “R&D organizations” and “academic institutions.” In other words, the entire economy and society.\n\nIt warns that “The erosion of American manufacturing over the last two decades… threatens to undermine the ability of U.S. manufacturers to meet national security requirements. Today, we rely on single domestic sources for some products and foreign supply chains for others, and we face the possibility of not being able to produce specialized components for the military at home.”\n\nCorrecting this strategic deficiency, the report concludes, means that “support for a vibrant domestic manufacturing sector, a solid defense industrial base, and resilient supply chains is a national priority.”\n\nThe report squarely targets China, declaring, “China’s economic strategies, combined with the adverse impacts of other nations’ industrial policies, pose significant threats to the U.S. industrial base and thereby pose a growing risk to U.S. national security.”\n\nThe promotion of US manufacturing dominance, in other words, is vital for promoting military dominance.\n\nThe protection of heavy industry goes together with the administration’s efforts to defend America’s high-tech sector, the source of a vast portion of US profitability.\n\nAs the report notes, “One of the Chinese Communist Party’s primary industrial initiatives, Made in China 2025, targets artificial intelligence, quantum computing, robotics, autonomous and new energy vehicles, high performance medical devices, high-tech ship components, and other emerging industries critical to national defense.”\n\nIt warns that “Chinese R&D spending is rapidly converging to that of the U.S. and will likely achieve parity sometime in the near future,” and worriedly points to the fact that the Chinese manufacturer DJI dominates the commercial aerial drone market.\n\nThe Pentagon’s plans for protecting and expanding the US high-tech sector include its backing for the administration’s efforts to limit the admission of Chinese students to US universities through visa restrictions. The report complains that, with as many as 25 percent of “STEM [Science, Technology, Engineering and Mathematics] graduates in the U.S. being Chinese nationals… American universities are major enablers of China’s economic and military rise.”\n\nThe vision in the document, in other words, is the concrete expression of the conception outlined in the latest US national security strategy, calling for “the seamless integration of multiple elements of national power—diplomacy, information, economics, finance, intelligence, law enforcement and military.”\n\nA leading element of this equation is the American corporate technology sector, which has scrambled for fat Pentagon contracts to develop the latest generation of weapons systems. In exchange for these payouts, and aggressive protection from their international rivals, they have worked closely to implement what one leaked internal Google document called a “shift towards censorship” in cooperation with the demands of the US military and intelligence agencies.\n\nThe logic of this growing fusion between the repressive apparatus of the state and increasingly powerful monopolies is the necessary correlation between “total war” and a “totalitarian” society, in which key constitutional provisions are rendered effectively meaningless.\n\nThe central target of such measures will be the forcible suppression of the class struggle in the name of promoting “national security.” The escalation of global US militarism has coincided with a major upsurge in the class struggle, including the rejection of a concessions contract by workers at UPS, the logistics giant whose powerful workforce is capable of crippling not just America’s industrial base, but substantial sections of the wartime economy.\n\n\nhttps://www.wsws.org/en/articles/2018/10/11/tota-o11.html",
			"added": 1539790603
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}