{
	"title": " * Blog FR\n * 19w37",
	"description": "Un ZeroBlog francophone",
	"links": "*   [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=katian)\n*   [Zero Wiki FR](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/)\n*   [Zero Talk FR 19w36](http://127.0.0.1:43110/1GCV21sR7FrZhgh31KXqbbz1X7ePHjWAik/)\n* [Dhammapada FR](http://127.0.0.1:43110/1469sYMqXgtzCtThj9VmxjiJyJXLmB7Ecy/)",
	"next_post_id": 73,
	"demo": false,
	"modified": 1571466410,
	"post": [
		{
			"post_id": 72,
			"title": "Ubuntu 19.10 Eoan Ermine",
			"date_published": 1571466326.179,
			"body": "Mise à jour réussie !\n\n![eoan-ermine-ubuntu-1910.jpg (0x0)](data/img/post_72_eoan-ermine-ubuntu-1910.jpg)"
		},
		{
			"post_id": 71,
			"title": "Discours de S.N. Goenka (vidéos)",
			"date_published": 1571110658,
			"body": "[kopykate jour 01](http://127.0.0.1:43110/big.kopykate.bit/?Video=1570118426_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)\n\n[kopykate jour 02](http://127.0.0.1:43110/big.kopykate.bit/?Video=1571075604_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 70,
			"title": "Ajahn Chah (citation)",
			"date_published": 1570423629.874,
			"body": "« Essayez d'être attentif et de laisser les choses suivre leur cours. Votre esprit deviendra imperturbable en toute situation, comme un clair lac de forêt. Toutes sortes de merveilleux et rares animaux viendront boire à ce lac, et vous verrez clairement la nature de toute chose. Vous verrez beaucoup de choses étranges et merveilleuses aller et venir, mais vous resterez imperturbable. Ceci est le bonheur de Bouddha. »"
		},
		{
			"post_id": 69,
			"title": "Samadhi, le film (vidéo)",
			"date_published": 1570338389.212,
			"body": "[kopykate 1/2](http://127.0.0.1:43110/big.kopykate.bit/?Video=1570261146_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)\n[kopykate 2/2](http://127.0.0.1:43110/big.kopykate.bit/?Video=1570266354_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 68,
			"title": "Ajahn Chah (citation)",
			"date_published": 1570254248.551,
			"body": "« Vous êtes votre propre maître. Rechercher des enseignants ne peut éliminer vos doutes. Examinez vous pour trouver la vérité - l'intérieur, pas l'extérieur. Vous connaître est plus important. »"
		},
		{
			"post_id": 67,
			"title": "Ajahn Chah (citation)",
			"date_published": 1570205518.234,
			"body": "« Si vous lâchez prise un peu, vous aurez un peu de paix. Si vous lâchez prise beaucoup, vous aurez beaucoup de paix. Si vous lâchez prise complètement, vous aurez la paix complète. »"
		},
		{
			"post_id": 66,
			"title": "Citation Bouddhisme",
			"date_published": 1570118761.355,
			"body": "\"Il est bon de contrôler l’œil, il est bon de contrôler l’oreille ; il est bon de contrôler le nez, il est bon de contrôler la langue.\""
		},
		{
			"post_id": 65,
			"title": "Ajahn Chah (citation)",
			"date_published": 1570116913.379,
			"body": "« Le Dhamma doit être trouvé en regardant votre cœur et en voyant ce qui est vrai et ce qui ne l'est pas, ce qui est équilibré et ce qui ne l'est pas. »"
		},
		{
			"post_id": 64,
			"title": "Ajahn Chah (citation)",
			"date_published": 1570062650.891,
			"body": "« Nous pratiquons pour apprendre à lâcher prise, pas pour accroître notre maîtrise des choses. L'illumination apparait quand vous ne voulez plus rien. »"
		},
		{
			"post_id": 63,
			"title": "Ajahn Chah (citation)",
			"date_published": 1569978775.654,
			"body": "« Le cœur du chemin est très simple. Il n'y a besoin de rien expliquer. Abandonnez l'amour et la haine et laissez les choses être. C'est tout ce que je fais dans ma pratique. »"
		},
		{
			"post_id": 62,
			"title": "Ajahn Chah (citation)",
			"date_published": 1569857683.754,
			"body": "« Quand vous êtes assis en méditation, pensez « Cela ne me regarde pas ! » à chaque fois qu'une pensée émerge. »"
		},
		{
			"post_id": 61,
			"title": "L'octuple sentier (vidéo)",
			"date_published": 1569765035.537,
			"body": "[kopykate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1569764964_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 60,
			"title": "Ajahn Chah (citation)",
			"date_published": 1569751497.727,
			"body": "« Ne pensez pas que simplement s'asseoir les yeux fermés soit pratiquer. Si vous pensez cela, alors changez vite d'avis. La pratique est de rester attentif dans toute posture, assis, en marchant, debout ou allongé. Quand vous vous relevez, ne pensez pas que vous sortez de méditation mais simplement que vous changez de posture. Si vous réfléchissez de cette manière, vous aurez la paix. Partout où vous serez, vous aurez cette attitude de pratique avec vous. Vous aurez une connaissance directe de vous-même. »"
		},
		{
			"post_id": 58,
			"title": "Citation Bouddhisme",
			"date_published": 1569605981.761,
			"body": "\"Cette action n’est pas bien faite, quand étant faite, on s’en repent après, et de laquelle on en cueille le fruit, pleurant, le visage plein de larmes.\""
		},
		{
			"post_id": 57,
			"title": "Citation Bouddhisme",
			"date_published": 1569515251.748,
			"body": "\"Il se réjouit dans cette vie, il se réjouit après cette vie, dans tous les mondes, le faiseur de bien se réjouit. Il se réjouit, il se réjouit extrêmement, voyant ses actions pures.\""
		},
		{
			"post_id": 56,
			"title": "Citation Bouddhisme",
			"date_published": 1569469770.867,
			"body": "\"Le don du Dhamma surpasse tous les dons. La saveur du Dhamma surpasse toutes les saveurs. Le délice dans le Dhamma surpasse tous les délices. Celui qui a détruit la soif surmonte toutes les douleurs.\""
		},
		{
			"post_id": 55,
			"title": "Citation Bouddhisme",
			"date_published": 1569430658.5,
			"body": "\"Les hommes, enveloppés par la soif, sont terrifiés comme un lièvre captif ; tenus fermes par les entraves et les liens, pour longtemps, ils vont vers le chagrin, encore et encore.\""
		},
		{
			"post_id": 54,
			"title": "Citation Bouddhisme",
			"date_published": 1569340506.823,
			"body": "\"En infligeant la douleur aux autres, celui qui désire son propre bonheur n’est pas soulagé de la haine, étant lui-même embarrassé dans les liens de la haine.\""
		},
		{
			"post_id": 53,
			"title": "La méditation Vipassana (vidéo)",
			"date_published": 1569286466.078,
			"body": "Sagesses Bouddhistes 2011 Ariya Nani - 2 - La méditation Vipassana\n\n[kopykate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1569286418_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 51,
			"title": "Citation Bouddhisme",
			"date_published": 1569252947.688,
			"body": "\"Dompter la colère par la non-colère. Dompter le mal par le bien. Dompter l’avarice par le don. Dompter le mensonge par la vérité.\""
		},
		{
			"post_id": 50,
			"title": "Citation Bouddhisme",
			"date_published": 1569190230.477,
			"body": "\"La victoire engendre la haine, le vaincu vit dans la souffrance. Le paisible vit heureux, abandonnant victoire et défaite.\""
		},
		{
			"post_id": 49,
			"title": "Citation Bouddhisme",
			"date_published": 1569156193.33,
			"body": "\"S’abstenir de tout mal, cultiver le bien, purifier son esprit, voici l’enseignement des bouddhas.\""
		},
		{
			"post_id": 47,
			"title": "Dhamma Mahi (vidéo)",
			"date_published": 1569124034.658,
			"body": "Dhamma Mahi, le centre français de méditation Vipassana - Vidéo de présentation\n\n[kopykate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1569123858_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 46,
			"title": "Citation Bouddhisme",
			"date_published": 1569063470.808,
			"body": "\"Nulle part dans les airs, ni au milieu de l’océan, ni au fond d’une grotte profonde, n’est trouvée une place sur terre où, y demeurant, l’on puisse échapper aux conséquences des mauvaises actions.\""
		},
		{
			"post_id": 45,
			"title": "Citation Bouddhisme",
			"date_published": 1568993391.689,
			"body": "\"Pour celui qui a achevé le voyage, pour celui qui est sans chagrin, pour celui qui est entièrement libéré de toutes choses, pour celui qui a détruit toutes les attaches, la fièvre de la passion n’existe pas\""
		},
		{
			"post_id": 44,
			"title": "ubuntu : kazam (logiciel)",
			"date_published": 1568824128.698,
			"body": "Kazam est un logiciel capable d'enregistrer votre écran. Il vous laissera le choix de faire soit une capture en continu (format vidéo) ou une simple capture d'écran.\n\n![kazam.jpg (0x0)](data/img/post_44_kazam.jpg)\n\npour installer kazam :\n\n`sudo apt install kazam`"
		},
		{
			"post_id": 43,
			"title": "Citation Bouddhisme",
			"date_published": 1568819588.141,
			"body": "\"Par vous-mêmes, en vérité, vous êtes le protecteur de vous-mêmes. Vous-mêmes, en vérité, êtes le refuge de vous-mêmes.\""
		},
		{
			"post_id": 42,
			"title": "Et s'il suffisait d'être présent (livre)",
			"date_published": 1568743817.858,
			"body": "Un excellent livre que je suis en train de lire :\n\n![schut-suffisait-present.jpg (0x0)](data/img/post_42_schut-suffisait-present.jpg)"
		},
		{
			"post_id": 41,
			"title": "Citation Bouddhisme",
			"date_published": 1568734011.585,
			"body": "\"Il n’y à pas de méditation (jhāna) sans sagesse. Il n’y a pas de sagesse sans méditation. Celui en qui il y a sagesse et méditation est, en vérité, en présence de Nibbāna.\""
		},
		{
			"post_id": 40,
			"title": "Explorer et comprendre (Dhamma)",
			"date_published": 1568608295.634,
			"body": "\"Dans le bouddhisme, il ne s’agit pas seulement de croire aux enseignements, mais plutôt et surtout de les explorer, les comprendre et de les tester à travers sa propre expérience.\n\nLe processus d’exploration, de compréhension, d’essai et de la réalisation est le bouddhisme.\"\n\n* * *\n\n[source web](https://www.comprendrebouddhisme.com/connaitre/boudddhisme-qu-est-ce-que-general.html)"
		},
		{
			"post_id": 39,
			"title": "2048 le jeu",
			"date_published": 1568571230.315,
			"body": "[http://127.0.0.1:43110/18tw81j7CJV5ZSXtf7ThYRpPZCR1PFzQLx/](http://127.0.0.1:43110/18tw81j7CJV5ZSXtf7ThYRpPZCR1PFzQLx/)\n\n![2048.jpg (0x0)](data/img/post_39_2048.jpg)​​​​​​​"
		},
		{
			"post_id": 38,
			"title": "Etre ce qui est (vidéo)",
			"date_published": 1568542041.117,
			"body": "Jeanne Schut : Ajahn Chah - Sagesses Bouddhistes 2018 :\n\n[lien KopyKate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1568541988_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 36,
			"title": "Les deux moines et la jolie jeune fille",
			"date_published": 1568489151.644,
			"body": "Le 13-09-2019\n\nOu comment s’affranchir de tout esprit moralisateur.\n\n* * *\n\nDans le Japon ancien, deux moines s’étaient mis en chemin et avaient laissé leur monastère afin d’entreprendre un long voyage semé de pièges et de difficultés, plusieurs jours pendant lesquels ils allaient traverser de profondes vallées peuplées d’étranges animaux, des ours terrifiants, des vipères véloces, des sangliers renâclant, soufflant et couinant, des scolopendres venimeuses et de vilains frelons obstinés et mortels. Il était coutume à l’époque que les moines accomplissent de tels périples vêtus le plus simplement du monde et trimballant les quelques maigres objets utilitaires qu’ils étaient autorisés à posséder. On les appelait _unsui_, nuages et eaux vives, car ils cheminaient avec cette aisance et liberté de l’eau et des nuées qui glissent sur les aspérités du monde. Les cols étaient hostiles et les chemins peu balisés, d’énormes stèles de pierres taillées et sommairement calligraphiées donnaient quelques indications sur les lieux ; les forêts étaient sombres et menaçantes, les hameaux rares et à l’hospitalité peu avenante. Peu d’âmes se rencontraient dans ces voyages improvisés, de temps en temps un vieillard halluciné, un palanquin pressé, un marchand ou des gueux aux airs patibulaires et manières peu courtoises. Il fallait souvent dormir à la belle étoile et trouver le moyen d’échapper aux pluies battantes et aux vents glacés. Quant à la nourriture, elle était aussi frugale que précieuse.\n\n* * *\n\n« Cette jeune fille, je ne l’ai portée que quelques instants, le temps de franchir le courant, je l’avais déjà oubliée, mais toi, tu la portes dans ton esprit depuis bien des heures ! »\n\n* * *\n\nOr, voici qu’ils arrivèrent face à un large torrent impétueux qui grondait de toutes ses eaux agitées et devant lequel se tenait une jeune fille toute frêle et tremblante. Cette dernière, au corps léger comme brindille, mal assurée et hésitante, semblait ne pas vouloir franchir la rivière tumultueuse à gué. Sa longue chevelure noire était nouée en un chignon épais et son _yukata_, kimono d’été, était taillé dans un lin rigide imprimé de motifs géométriques. Belle comme le jour dans cette grisaille environnante, elle était comme une trouée de lumière, une clairière paisible dans la pénombre ambiante. L’un des moines, plus bavard et curieux que son camarade, l’interrogea et lui demanda ce qu’elle faisait là. Elle lui répondit qu’elle n’osait mettre le pied dans cette eau troublée, redoutant d’y perdre équilibre et vie. La jeunette était vraiment bellotte, et le moine sans demander son reste et encore moins en débattre avec son compagnon, se décida, après lui en avoir demandé la permission, à la prendre dans ses bras et lui fit traverser le courant affolé et tonitruant. Une fois sur l’autre rive, il la reposa, lui donna un sourire franc et large, avant de s’incliner les mains jointes et reprendre son chemin avec son compagnon de route.\n\n* * *\n\nIls cheminèrent ainsi péniblement, car la chaleur pesait et la pente était abrupte. Au bout d’un long moment, n’en pouvant certainement plus, le second moine qui avait observé la scène sans rien dire, mais qui ne parvenait plus à endiguer son indignation et sa consternation, ouvrit enfin la bouche pour se déverser en critiques amères : comment avait-il osé lever les yeux sur cette jeune femme, et plus encore lui adresser la parole ? Comment avait-il pu la toucher et la prendre dans ses bras ? Il s’était rendu coupable de tant de fautes et brisé tant et tant de préceptes saints, et cela pour faire le malin auprès d’une écervelée ! Pour cela, il finirait par brûler d’un juste châtiment dans les enfers, taquiné par de terribles démons ! Nul ne pouvait aussi légèrement se moquer des préceptes monastiques et enfreindre la loi des Anciens ! Le premier moine l’avait écouté en silence et finit par se retourner pour lui répondre : « Je n’ai pas aidé une écervelée, mais une pauvre fille qui souffrait de ne pas pouvoir rejoindre son village. Et cette jeune fille, je ne l’ai portée que quelques instants, le temps de franchir le courant, je l’avais déjà oubliée, mais toi, tu la portes dans ton esprit depuis bien des heures ! ». Par cette simplissime histoire, chacun comprendra aisément que l’esprit moralisateur et querelleur qui voit et dénonce le mal avec violence et sermonne à tout va est bel et bien celui qui le conçoit. Il n’est de péché et de faute que dans le regard de celles et ceux qui jugent, les innocents vont dans l’insouciance des enfants et la liberté des nuages.\n\n* * *\n\nPierre Taïgu Turlur."
		},
		{
			"post_id": 35,
			"title": "Technique Pomodoro",
			"date_published": 1568481098.214,
			"body": "La technique se présente sous la forme de cinq étapes :\n\n1.  décider de la tâche à effectuer ;\n2.  régler le _pomodoro_ (minuteur) sur 25 minutes ;\n3.  travailler sur la tâche jusqu'à ce que le minuteur sonne et la noter comme faite ;\n4.  prendre une courte pause (5 minutes) ;\n5.  tous les quatre _pomodori_ prendre une pause un peu plus longue (15-20 minutes).\n\n***\n\nsource : https://fr.wikipedia.org/wiki/Technique_Pomodoro"
		},
		{
			"post_id": 34,
			"title": "B comme Bruit (méditation)",
			"date_published": 1568477562.341,
			"body": "\"Je ne sais pas si vous êtes comme moi, mais quand je veux méditer ou tout simplement me reconnecter à moi-même, le bruit m’insupporte et me pousse à éprouver des émotions conflictuelles et à m’éloigner de moi. En prendre conscience m’a permis de décider d’en faire un super maître et d’être à l’écoute de ce qu’il m’apprend de moi.\"\n\n***\n\nsource : https://bouddhanews.fr/b-comme-bruit/"
		},
		{
			"post_id": 33,
			"title": "La base de la pratique (Dhamma)",
			"date_published": 1568474844.328,
			"body": "\"La base de la pratique est la discipline. Elle porte sur le comportement extérieur, les actions physiques et verbales, la pensée intérieure, et l'entraînement à la méditation.\nLa discipline soutient la méditation qui soutient, à son tour, la discipline. Les deux sont soutenues par la motivation. Une pratique équilibrée et correctement motivée se fonde sur certaines convictions - qui peuvent résulter de tendances \"innées\" ou de réflexions nourries par l'étude - et sur des instructions demandées et reçues au cours d'un enseignement suivi avec un maître.\"\n\nsource : https://bica-vipassana.blogspot.com/2007/07/la-pratique-au-quotidien_09.html"
		},
		{
			"post_id": 32,
			"title": "ubuntu : variety (logiciel)",
			"date_published": 1568472231.256,
			"body": "Une application automatique pour changer, gérer et télécharger des fonds d'écran.\n\n![variety.jpg (0x0)](data/img/post_32_variety.jpg)​​​​​​​\n\npour installer variety :\n`sudo apt install variety`\n"
		},
		{
			"post_id": 31,
			"title": "Granola au chocolat (recette)",
			"date_published": 1568458668.053,
			"body": "testée et approuvée :\n\n![granola_au_chocolat.jpg (0x0)](data/img/post_31_granola_au_chocolat.jpg)​​​​​​​"
		},
		{
			"post_id": 30,
			"title": "L'homme prisonnier du vice (image)",
			"date_published": 1568448466.304,
			"body": "![Screenshot_2019-09-07_Tweets_avec_media_de_Citations_Bouddhistes-portail_dhamma-Twitter.jpg (0x0)](data/img/post_30_Screenshot_2019-09-07_Tweets_avec_media_de_Citations_Bouddhistes-portail_dhamma-Twitter.jpg)​​​​​​​![](data:,)"
		},
		{
			"post_id": 28,
			"title": "Mise à jour du Zero Wiki FR",
			"date_published": 1568437955.177,
			"body": "J'ai ajouté un groupe Discord & Telegram :\n\n[http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/?Page:guide-du-dbutant](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/?Page:guide-du-dbutant)"
		},
		{
			"post_id": 27,
			"title": "Sylvia Ritter - Art & Illustrations",
			"date_published": 1568398682.375,
			"body": "![EDkvAhoX4AA4Osz.jpeg (0x0)](data/img/post_27_EDkvAhoX4AA4Osz.jpeg)​​​​​​​\n\nclearnet : [https://www.sylvia-ritter.com/](https://www.sylvia-ritter.com/)"
		},
		{
			"post_id": 26,
			"title": "souffrance et méditation",
			"date_published": 1568392730.39,
			"body": "Ce sont les deux mots qui me viennent à l'esprit à cet instant précis..."
		},
		{
			"post_id": 25,
			"title": "Qu'appelle-t-on, la parole juste?",
			"date_published": 1568388348.225,
			"body": "\"C'est éviter de dire des mensonges, éviter de calomnier, éviter de parler de façon haineuse ou injurieuse, éviter les paroles frivoles ou le bavardage futile. Moines, éviter ces quatre façons négatives de parler est appelé la parole juste.\n\nCette définition donne à comprendre qu'un entretien religieux ou le seul fait de dire la vérité, par exemple, ne fondent pas la \"parole juste\". La parole juste consiste à éviter de parler de façon erronée. Si l'occasion se présente de mentir, de calomnier, d'être injurieux ou de bavarder inutilement et qu'on ne la saisisse pas, on établit la pratique de la parole juste. En fait, éviter les paroles erronées conduit par soi-même au langage vrai, aimable, bénéfique et créateur d'harmonie.\"\n\nsource : https://bica-vipassana.blogspot.com/2007/11/la-parole-juste.html"
		},
		{
			"post_id": 24,
			"title": "ubuntu : detox (commande)",
			"date_published": 1568387798.271,
			"body": "`detox` : Nettoyer les noms de fichiers sous Linux\n\n* * *\n\npour installer detox :\n`sudo apt install detox`\n\npour un tuto voir ici :\n[https://memo-linux.com/detox-nettoyer-nom-de-fichier-sous-linux/](https://memo-linux.com/detox-nettoyer-nom-de-fichier-sous-linux/)"
		},
		{
			"post_id": 22,
			"title": "un essai d'image sur ce blog",
			"date_published": 1568304057.624,
			"body": "![EEOBWBdXkAAlO6m.png (0x0)](data/img/post_22_EEOBWBdXkAAlO6m.png)​​​​​​​"
		},
		{
			"post_id": 21,
			"title": "ubuntu : ncdu (commande)",
			"date_published": 1568303439.081,
			"body": "```ncdu``` est un visualiseur d'utilisation de disque\n\n* * *\n\npour installer ncdu :\n`sudo apt install ncdu`\n\npour voir la taille de votre $HOME :\n`ncdu $HOME`"
		},
		{
			"post_id": 20,
			"title": "L’itinéraire d’un renonçant (lecture)",
			"date_published": 1568303179.093,
			"body": "![image](https://dhammadana.org/tel-livre/01/img/lidurcou.jpg)\n\nJ'ai aimé lire ce livre, il est disponible ici :\n\n[https://dhammadana.org/tel-livre/itineraire/index.htm](https://dhammadana.org/tel-livre/itineraire/index.htm)"
		},
		{
			"post_id": 19,
			"title": "Medativo : Timer pour Méditation (Android)",
			"date_published": 1568257357.121,
			"body": "Une excellente application Android pour méditer : Medativo\n\n[https://play.google.com/store/apps/details?id=com.despdev.meditationapp](https://play.google.com/store/apps/details?id=com.despdev.meditationapp)"
		},
		{
			"post_id": 18,
			"title": "ubuntu : journalctl (commande)",
			"date_published": 1568255982.328,
			"body": "pour connaitre la taille utilisée par le journal de systemd :\n`journalctl --disk-usage`\n\npour ne garder que les deux derniers jours :\n`journalctl --vacuum-time=2d`\n\npour limiter la taille à 500Mo :\n`journalctl --vacuum-size=500M`"
		},
		{
			"post_id": 17,
			"title": "Le bricolage spirituel ou le bouddhisme instrumentalisé (vidéo)",
			"date_published": 1568250744.829,
			"body": "Philippe Cornu - Vidéo en ligne : [KopyKate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1567037300_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 16,
			"title": "Les quatre vérités des êtres nobles (vidéo)",
			"date_published": 1568250550.141,
			"body": "Philippe Cornu - Vidéo en ligne : [KoyKate](http://127.0.0.1:43110/big.kopykate.bit/?Video=1567011502_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 15,
			"title": "ZeroWiki FR & Name.YO",
			"date_published": 1568234071.63,
			"body": "J'ai ajouté une partie Name.YO sur le [Zero Wiki FR](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/?Page:home)\n\nTODO : traduction à faire"
		},
		{
			"post_id": 14,
			"title": "L'octuple sentier",
			"date_published": 1568221296.322,
			"body": "*   La compréhension juste\n\n*   La pensée juste\n\n*   La parole juste\n\n*   L’action juste\n\n*   Le mode de vie juste\n\n*   L’effort juste\n\n*   L’attention juste\n\n*   La concentration juste\n\n![image](https://i.pinimg.com/originals/93/35/c8/9335c8405ea6ef4fe001f614ad4638c6.png)"
		},
		{
			"post_id": 13,
			"title": "L’esprit méditatif, Ayya Khema",
			"date_published": 1568216125.623,
			"body": "\"Les gens sont souvent surpris quand ils découvrent qu’il n’est pas facile de méditer. Vu de l’extérieur, cela semble tellement simple: on s’assoit sur un coussin et on observe sa respiration. Que pourrait-il y avoir de difficile à cela ? La difficulté vient du fait que nous ne sommes aucunement préparés à ce genre d’exercice. Notre esprit, nos sens et nos ressentis sont habitués à évoluer dans le monde, c’est-à-dire dans la société de consommation dans laquelle nous vivons. Or, la méditation ne relève pas de la consommation –c’est impossible: il n’y a rien à acheter, à vendre ou à organiser dans la méditation. Mais la plupart des gens ne changent pas d’attitude quand ils méditent… et cela ne fonctionne pas.\"\n\nsource : [Dhamma de la forêt](http://www.dhammadelaforet.org/) :​​​​​​​ [http://portail-dhamma.com/lesprit-meditatif](http://portail-dhamma.com/lesprit-meditatif)"
		},
		{
			"post_id": 12,
			"title": "mise à jour du ZeroWiki FR",
			"date_published": 1568177886.991,
			"body": "Mise à jour du ZeroWiki FR avec changelog & todo-list :\n\n[http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "Dhamma & audio",
			"date_published": 1568147225.114,
			"body": "Fichiers [ZeroUp Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/) :\n\n[En_quelques_lignes....ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_En_quelques_lignes....ogg)\n\n[Entrevue_avec_le_moine_Sila_Vanta.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Entrevue_avec_le_moine_Sila_Vanta.ogg)\n\n[Instructions_de_base_a_vipassana.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Instructions_de_base_a_vipassana.ogg)\n\n[Introduction_et_methode.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Introduction_et_methode.ogg)\n\n[La_pratique_laique_1sur2.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_La_pratique_laique_1sur2.ogg)\n\n[La_pratique_laique_2sur2.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_La_pratique_laique_2sur2.ogg)\n\n​​​​​​​[Les_8_preceptes.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Les_8_preceptes.ogg)\n\n[Questions_frequentes-en_2_parties-1sur2.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Questions_frequentes-en_2_parties-1sur2.ogg)\n\n[Questions_frequentes-en_2_parties-2sur2.ogg](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx/french_dhamma_Questions_frequentes-en_2_parties-2sur2.ogg)\n\nsource : [https://dhammadana.org/](https://dhammadana.org/)"
		},
		{
			"post_id": 10,
			"title": "Proverbe amérindien",
			"date_published": 1568143514.998,
			"body": "\"La paix n’arrive jamais par surprise. Elle ne tombe pas du ciel comme la pluie. Elle vient à ceux qui la préparent.\""
		},
		{
			"post_id": 9,
			"title": "citation",
			"date_published": 1568143326.186,
			"body": "\"Nous sous-estimons souvent le pouvoir d'un contact, d'un sourire, d'un mot gentil, d'une oreille attentive, d'un compliment sincère, ou d'une moindre attention, ils ont tous le pouvoir de changer une vie.\""
		},
		{
			"post_id": 8,
			"title": "Je veux changer ma vie...",
			"date_published": 1568142821.015,
			"body": "Je veux changer ma vie en adoptant de nouvelles habitudes et en apprenant à voir le monde sous un nouveau jour..."
		},
		{
			"post_id": 6,
			"title": "J'utilise Linux Ubuntu MATE 19.04",
			"date_published": 1568136010.199,
			"body": "Voici le détail :\n\n![image](http://pix.toile-libre.org/upload/original/1568137868.png)"
		},
		{
			"post_id": 5,
			"title": "La méditation est un exercice difficile",
			"date_published": 1568132761.112,
			"body": "Il ne faut pas se faire d’illusions : la méditation est un exercice très difficile mais je continue de m’entraîner..."
		},
		{
			"post_id": 3,
			"title": "Les huit marches vers le bonheur (audio)",
			"date_published": 1568130936.653,
			"body": "Livre audio gratuit :\n\n[KopyKate partie 1/2](http://127.0.0.1:43110/big.kopykate.bit/?Video=1566984071_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)\n[KopyKate partie 2/2](http://127.0.0.1:43110/big.kopykate.bit/?Video=1566984414_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx)"
		},
		{
			"post_id": 2,
			"title": "L'Effort Juste",
			"date_published": 1568129971.867,
			"body": "Amis, qu'est-ce que l'Effort Juste ?\n\nC'est un disciple qui espère, lutte, s'efforce, maîtrise son mental, s'exerce pour combattre l'apparition du Mal et de mauvaises pensées.\n\nIl espère, lutte, s'efforce, maîtrise son mental, s'exerce pour l'apparition de bonnes pensées.\n\nIl espère, lutte, s'efforce, maîtrise son mental, s'exerce pour la stabilité, pour l'absence de confusion, pour la croissance, la plénitude, et la culture du mental, pour la consolidation des bonnes pensées apparues.\n\nAmis, tel est l'Effort juste."
		}
	],
	"tag": [
		{
			"value": "dhamma",
			"post_id": 2
		},
		{
			"value": "dhamma",
			"post_id": 3
		},
		{
			"value": "méditation",
			"post_id": 5
		},
		{
			"value": "ubuntu",
			"post_id": 6
		},
		{
			"value": "blog",
			"post_id": 8
		},
		{
			"value": "blog",
			"post_id": 9
		},
		{
			"value": "blog",
			"post_id": 10
		},
		{
			"value": "dhamma",
			"post_id": 11
		},
		{
			"value": "wiki",
			"post_id": 12
		},
		{
			"value": "dhamma",
			"post_id": 13
		},
		{
			"value": "dhamma",
			"post_id": 14
		},
		{
			"value": "wiki",
			"post_id": 15
		},
		{
			"value": "dhamma",
			"post_id": 16
		},
		{
			"value": "dhamma",
			"post_id": 17
		},
		{
			"value": "ubuntu",
			"post_id": 18
		},
		{
			"value": "méditation",
			"post_id": 19
		},
		{
			"value": "dhamma",
			"post_id": 20
		},
		{
			"value": "ubuntu",
			"post_id": 21
		},
		{
			"value": "blog",
			"post_id": 22
		},
		{
			"value": "ubuntu",
			"post_id": 24
		},
		{
			"value": "dhamma",
			"post_id": 25
		},
		{
			"value": "méditation",
			"post_id": 26
		},
		{
			"value": "dhamma",
			"post_id": 26
		},
		{
			"value": "wiki",
			"post_id": 28
		},
		{
			"value": "dessins",
			"post_id": 27
		},
		{
			"value": "dhamma",
			"post_id": 30
		},
		{
			"value": "cuisine",
			"post_id": 31
		},
		{
			"value": "ubuntu",
			"post_id": 32
		},
		{
			"value": "dhamma",
			"post_id": 33
		},
		{
			"value": "méditation",
			"post_id": 34
		},
		{
			"value": "blog",
			"post_id": 35
		},
		{
			"value": "dhamma",
			"post_id": 36
		},
		{
			"value": "dhamma",
			"post_id": 38
		},
		{
			"value": "méditation",
			"post_id": 38
		},
		{
			"value": "zeronet",
			"post_id": 39
		},
		{
			"value": "dhamma",
			"post_id": 40
		},
		{
			"value": "dhamma",
			"post_id": 41
		},
		{
			"value": "méditation",
			"post_id": 41
		},
		{
			"value": "dhamma",
			"post_id": 42
		},
		{
			"value": "méditation",
			"post_id": 42
		},
		{
			"value": "dhamma",
			"post_id": 43
		},
		{
			"value": "méditation",
			"post_id": 43
		},
		{
			"value": "ubuntu",
			"post_id": 44
		},
		{
			"value": "dhamma",
			"post_id": 45
		},
		{
			"value": "méditation",
			"post_id": 45
		},
		{
			"value": "dhamma",
			"post_id": 46
		},
		{
			"value": "méditation",
			"post_id": 46
		},
		{
			"value": "dhamma",
			"post_id": 47
		},
		{
			"value": "méditation",
			"post_id": 47
		},
		{
			"value": "dhamma",
			"post_id": 49
		},
		{
			"value": "méditation",
			"post_id": 49
		},
		{
			"value": "dhamma",
			"post_id": 50
		},
		{
			"value": "méditation",
			"post_id": 50
		},
		{
			"value": "dhamma",
			"post_id": 51
		},
		{
			"value": "méditation",
			"post_id": 51
		},
		{
			"value": "dhamma",
			"post_id": 53
		},
		{
			"value": "méditation",
			"post_id": 53
		},
		{
			"value": "dhamma",
			"post_id": 54
		},
		{
			"value": "méditation",
			"post_id": 54
		},
		{
			"value": "dhamma",
			"post_id": 55
		},
		{
			"value": "méditation",
			"post_id": 55
		},
		{
			"value": "dhamma",
			"post_id": 56
		},
		{
			"value": "méditation",
			"post_id": 56
		},
		{
			"value": "dhamma",
			"post_id": 57
		},
		{
			"value": "méditation",
			"post_id": 57
		},
		{
			"value": "dhamma",
			"post_id": 58
		},
		{
			"value": "méditation",
			"post_id": 58
		},
		{
			"value": "dhamma",
			"post_id": 60
		},
		{
			"value": "méditation",
			"post_id": 60
		},
		{
			"value": "dhamma",
			"post_id": 61
		},
		{
			"value": "méditation",
			"post_id": 61
		},
		{
			"value": "dhamma",
			"post_id": 62
		},
		{
			"value": "méditation",
			"post_id": 62
		},
		{
			"value": "dhamma",
			"post_id": 63
		},
		{
			"value": "méditation",
			"post_id": 63
		},
		{
			"value": "dhamma",
			"post_id": 64
		},
		{
			"value": "méditation",
			"post_id": 64
		},
		{
			"value": "dhamma",
			"post_id": 65
		},
		{
			"value": "méditation",
			"post_id": 65
		},
		{
			"value": "dhamma",
			"post_id": 66
		},
		{
			"value": "méditation",
			"post_id": 66
		},
		{
			"value": "dhamma",
			"post_id": 67
		},
		{
			"value": "méditation",
			"post_id": 67
		},
		{
			"value": "dhamma",
			"post_id": 68
		},
		{
			"value": "méditation",
			"post_id": 68
		},
		{
			"value": "dhamma",
			"post_id": 69
		},
		{
			"value": "méditation",
			"post_id": 69
		},
		{
			"value": "dhamma",
			"post_id": 70
		},
		{
			"value": "méditation",
			"post_id": 70
		},
		{
			"value": "dhamma",
			"post_id": 71
		},
		{
			"value": "méditation",
			"post_id": 71
		},
		{
			"value": "ubuntu",
			"post_id": 72
		}
	]
}