{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Tor has started the switch from V2 Onions to V3 Onions. They warned will in advance that at first, the decline would be slow - then very sudden. If you are using Tor (and you should) - there just is no telling how bad things will get. With the last update, many relays don't even speak V2 anymore. So they don't know how to handle your request.\n\nClearnet users should be unaffected.",
				"added": 1635827841
			},
			{
				"comment_id": 2,
				"body": "> [mozez](#comment_12_13ui1ziWUVZb7giGNYpAzHzdfCirkobc8x): I see no more than three people in China, same in Russia, only 3 people. It's possible some glowing is happening here.\n\nNumbers here have always been higher. I show 520 in China, Iran at 2659 (even higher than US at this mome0.\n\nHave no idea how these numbers are derived...after all, most likely use the Tor Network to hide their location.",
				"added": 1635828090
			},
			{
				"comment_id": 3,
				"body": "> [whitestar](#comment_5_1KaN3y1iWg1yktfnvm5isci2LaqubETcDd): ZeroNet is amazing. The problem comes from the neo-Neanderthal that inhabits Earth now. Laziness, baby-like lifestyle. Nobody wants to put in the effort to keep ZeroNet alive, and no one wants to be the one to maintain backbones to keep it running right.\n\nThe number of 24/7 platforms may be higher than you imagine.",
				"added": 1635828217
			},
			{
				"comment_id": 4,
				"body": "Have you tried that new Synchronite setting? http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/\n\nHe did some changes which really helped here, and our setup always worked pretty well.",
				"added": 1635828374
			}
		],
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": [
			{
				"comment_id": 5,
				"body": "http://www.reddit.com/r/unitedkingdom/comments/qkhml5/causing_psychological_harm_to_be_added_to_the/hj1cpi8\n\nThe_Great_Angel\n·\n1d\n\nnext step ZeroNet",
				"added": 1635965233
			}
		],
		"1546466091_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 6,
				"body": "Yes",
				"added": 1636042849
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 7,
				"body": "I2P Transport. Yeah, I understand this is a huge request.",
				"added": 1636066499
			}
		],
		"1634709308_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 8,
				"body": "Well they can, and do.....just maybe not with Covid. \n\nThat's the real problem with these talking heads. had they even mentioned from the git-go their vax was leaky then criminally tested - many of us would have just taken our chances. If you once trusted health professions - you don't anymore.\n\nNever could have imagined health becoming just another cultist football for know nothings :(",
				"added": 1636066779
			}
		],
		"1635188644_1H6E7oCSjVBWLzepwc6BEtMxn4LcdtYSJ9": [
			{
				"comment_id": 9,
				"body": "Believe just the opposite. Life is so rare and so fleeting - it's impossible for us to locate and verify. Despite vast sums spent to do just that.\n\nAnd if there was anything to these alien being stories, Bubba would have already bagged one.",
				"added": 1636066923
			}
		],
		"1632580545_1C16U7WJ34kMraYJsf5EwjrCQqhWiofm85": [
			{
				"comment_id": 10,
				"body": "Nothing changes until people die. Guns are good for defense...but not terribly effective for offense. For that you need bombs.\n\nI do think it odd that Australians deprived themselves of defensive weapons. Baffling.",
				"added": 1636067120
			}
		],
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "I don't buy your argument. You either believe in free speech or you don't. It's a binary choice.\n\nParents should control their kid's access, but words do not hurt you. The idea they do is a narcissistic idea hatched up very recently. Unworthy of any serious adult.",
				"added": 1636070911
			}
		],
		"1636134204_12rAw78P4EdKZWbBv2t3VYRFMiJEaf17SS": [
			{
				"comment_id": 12,
				"body": "There are no experts in this, excepting perhaps criminal elements which are likely making a killing in Australia right now. So that's probably what you need. A local criminal. One with access to private aviation.\n\nAssuming you already have a passport - you just leave. Don't try to break any laws or kill anyone :) Authorities don't take kindly to that.\n\nMake no mistake, this is risky tho. Criminals could take your money and dump you. Payment? Maybe half now, half on delivery via a cryptocurrency like Monero? If they knew with absolute certainty they would get nothing if they kidnapped you\n\nGiven what has leaked out of Australia - your effort will be very similar to escaping the Soviet Union (and you should treat it that way).\n\nGoto some private airports. Try to work backward from there. Chances are you will find a drug smuggler.\n\nThen write down your adventure and sell it to Hollywood. Escape from Australia :)",
				"added": 1636147676
			}
		],
		"1636174431_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 13,
				"body": "(shrug) Using NextDNS, blocklists, others ...along with GRSecurity patches and CPUS known immune to spectre bugs.\n\nStill not certain I can keep them out.\n\nBest may still be bootable LiveCDs and WORM backups.\n\nDefenders have been losing these battles for a long time. Everyone in the industry knows this.",
				"added": 1636176584
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac@kxoid.bit](#comment_204_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Hmm... Neither Blokada nor NextDNS block the test links, so you're probably less safe using them.\n\nAll of these DNS firewall schemes rely on user reports (usually delayed). They are mostly no different than antivirus products reliant on signatures...\n\nAttackers are far more nimble than any such systems. Worse, legitimate users then tie themselves up in knots. Consider the capchas you've endured over time.\n\nAbout the only success you'll ever get from blocking might be with the spies you purchase and install into your home. Like smart TVs, or many devices using web based control panels (really in the cloud). Even then - you just annoy them. Those weasels will find a way.",
				"added": 1636220134
			},
			{
				"comment_id": 15,
				"body": "Great joy. Especially if it later leaks that all their attacks can be proved. Followed by a special day when all are found dead.\n\nHackers should die. All of them.\nhttps://www.bbc.com/news/technology-59215167\n\nThe economic logic of executing computer hackers.\n\nhttps://slate.com/culture/2004/05/the-economic-logic-of-executing-hackers.html",
				"added": 1636435638
			},
			{
				"comment_id": 16,
				"body": "> [ssdifnskdjfnsdjk](#comment_1132_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @c6wy2qr5wuyulvmg liking hacking is not a problem, problem is causing damage (of various kind) by doing it, i wish people use less stupid generalizing statements of the \"hackers should die\" kind. And i am not a hacker, obviously, too stupid for that. [...]\n\nYes it's hard to catch them. But when you do - making the consequences physical is mandatory. No more larping invaders.....Make it real. Heads on a pike real.",
				"added": 1636487716
			}
		]
	},
	"comment_vote": {}
}