{
	"posts": [
		{
			"id": "c5b4a142-9399-4861-97cf-bc95d2ce2a98",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"subject": "Code Vein",
			"body": "I know this game came out a fair while back, but I'd like to know if anyone besides me here has had a chance to play it. \n\nWhat are your own thoughts? I'll give you my own:\nI'd say it's definitely trying too hard to be what Dark Souls was as far as the gameplay and UI go. The story is actually told, so I suppose that part of it is the only differentiation (except for the fact that it's all in an 'anime' style). \n\nIt is unfortunate that they did not copy the Dark Souls gameplay enough, however. The game is certainly playable, but it is a large step back from Dark Souls and I just felt truly disappointed with how poor the gameplay is. First of all, they throw enemies at you like it's a Duke Nukem game. You have the option of teaming up with a different player or the NPC's, but it's really not even an argument - you NEED another person with you in order to win most engagements. Otherwise you're facing three or more normal enemies at once. And blocking isn't a viable option for stalling since you still take considerable damage through your block, even if it's well-timed. \n\nParrying is absolutely fucked, I don't know why the added it in. It's ill-responsive, and I noticed it's very picky - even pickier than Dark Souls was - with what attacks can be parried and where the hitbox for it is. Not to mention there's a varying wind-up time for the actual parry, depending on which Blood-veil you have equipped. \n\nThe boss fights are the worst of all. It takes the usual annoyance of big enemies and multiplies it by many. With every boss, the strategy is to hug their feet and get lucky with your blocks and dodges; though, even that may fuck you over. Why? Because every boss has attacks with very little or no tell, and most of those attacks are nearby AoE spinning moves. I'd have less of a problem with that if there was more of a tell, but there simply isn't. The game can even trick you if you haven't seen the particular attack made before, and what may block usually, or spell the end of the boss' attack animation, may actually be just another windup for ANOTHER attack, which can mean instant death for some. \n\nI played all other Fromsoft games and got through them with no particular pointed gripes, but this game is very different. I can tell it isn't my fault that I am dying most of the time. \n\nI will say that the stylized look of the game definitely does it a few favors, and I wish more 'anime' styled games will follow in its footsteps - that's only because most other games with a similar attempts to look like an anime fall flat, and that's without the comically oversized weapons slung over the shoulder of a skinny man or frail woman. \n\nHow do you feel about it? Do you agree with my thoughts? I'd like to know if there's a shield I can buy somewhere in the game.",
			"time": 1572909026918,
			"files": "[{\"name\":\"code_vein-min.jpg\",\"thumb\":\"1cffea1627e1c34d6396d6bc1a4d8cf3338b0645-thumb.jpg\",\"size\":402179,\"type\":\"image/jpeg\",\"original\":\"1cffea1627e1c34d6396d6bc1a4d8cf3338b0645.jpg\",\"directory\":\"1BpTVZkimyVeQ2amLobsgqq12WW8egus35\"}]"
		},
		{
			"id": "8f3a9f94-8399-419c-b750-1d2e8a2f49fc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>59236b0c-319e-404b-90d5-8a6321a79f80\nThey're doing it methodically, and for a reason. Well, multiple reasons. One of which is distributing power. They're not going to give the legacy boards to just anyone. It's going to be given to insiders - people who have porchmonkey's - and by extension, Jim's - trust. The rules are going to be carefully crafted to allow for as little freedom as possible, or rather, just enough to make it seem like your rights arent being encroached upon. It'll be a slow burn like a frog in a boiling pot of water. Problem posters will be shadow banned and those with proxies or VPNs will be banned so many times that they'll give up eventually and just stop posting or lurking altogether, ensuring that the board has its \"intended\" amount of resistance to the new administration. \n\nJust taking one look at Mark's bunker should be enough of a hint as to how bad it will really be. It's 4chan-lite instead of 8chan-lite. There's no facade anymore, it's really just post-exodus era 4/v/",
			"time": 1572993345415,
			"files": "[]"
		},
		{
			"id": "4e98a52c-cdc7-4292-b30d-2a88564ba438",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"subject": "Cake Kike announces that 8chan is to be back up on the 30th of this month",
			"body": "I finally decide to bite the bullet and take a peak into vch.moe just to see the state of things and this is what I get. Why the fuck is it so busy there? I can only hope that the posters therein are mostly unhappy and discontent with how badly the Puppet-Kike runs things and having to deal with SpyFl(w)are. \nIt pains me to think that the brethren I thought I shared opinions with have such low willpower that they'd willingly go into such a den of the very traits which initially turned them away from 4chan. You can even tell that most of the posters there clearly don't even fucking belong. If you've a keen eye, you can tell by the manner of speech and parlance. If it weren't clearly evident enough from the 'streams' that the board does every so often. I had the 'pleasure' of being in the Jackbox stream, as I remember it being a part of 8chan's /v/. They apparently moved to vch.moe, and I could tell right away from the sort of chaff that wandered into the stream and started making themselves known in the stream chat.\n\nThis is bad fucking news guys, and I know for sure that most of you are going to use 8chan or 8kun whatever the fuck it's to be called when it comes back up. I can only pray that they fuck it up so bad with their censorship and moot-ish ways that the website separates itself from the redditors, 4channers, and other crossposting faggots (whom I know exist in great quantity), and the sane ones either go here, or better yet, find some better alternative which hopefully will not split the users any more than it already has been. \n\nYou know, I used to joke about the whole \"Divide and Conquer\" shit that the shills tried back on 8chan's earlier days as ultimately harmless, but I'm thinking they were successful. Or maybe it was all buggered from the start, considering who was in charge of the website and legacy boards. No matter what happens, I don't want to turn into one of them - one of the crossposting, meme-loving, discord-talking shitskins who ruined smaller boards and contributed to the downfall of 8chan. I'm trying really hard here not to become content with censorship and garbage simply out of desperation for socialization with people who may or may not be of similar mind, and may or may not have been right there with me over 10 years ago on /b/ and /v/ and /new, laughing, having fun, making memories, in what may have been one of the only places a person like me could feel normal and among brothers.",
			"time": 1574967526254,
			"files": "[{\"name\":\"lairofthesubversiveone.png\",\"thumb\":\"f0695a98211ad4fd9520ccae6718c4bb3e453b15-thumb.png\",\"size\":37604,\"type\":\"image/png\",\"original\":\"f0695a98211ad4fd9520ccae6718c4bb3e453b15.png\",\"directory\":\"1BpTVZkimyVeQ2amLobsgqq12WW8egus35\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}