{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1609617529_1MBvMN1a6WpuVMrbh2RTDeeJk7Mf1LYvUL": 1,
		"1609405437_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1610045007_1Dt486kkbdhZktV8JXcv7F9YqpSNBAsxYt": 1,
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": 1,
		"1610354895_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": 1
	},
	"next_comment_id": 25,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test",
				"added": 1609782669
			},
			{
				"comment_id": 7,
				"body": "> [kekistancitizen](#comment_3_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp): did it work?\n\nyes",
				"added": 1610200542
			},
			{
				"comment_id": 13,
				"body": "> [unsnapgreedless](#comment_5_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): Until they all get tired of being censored on the Big Tech platforms and figure out how to come over here...\n\nhopefully",
				"added": 1610228984
			},
			{
				"comment_id": 16,
				"body": "> [sweetholymosiah](#comment_1_1MkpgpPpiHXpmfktjDPCNSKKmz4F3qBspH): Greetings:Hello\n\nHello",
				"added": 1610305726
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 2,
				"body": "i can see why someone wouldn't believe politicians and the media, but do you also not believe scientific organizations, and non for profits",
				"added": 1609894700
			}
		],
		"1609874864_1KCXLUdxYKm5ukuc8s6kWaAdz6A7Hi8GQE": [
			{
				"comment_id": 3,
				"body": "you should probably switch to monero as they don't have the concept of tainted coins",
				"added": 1609895491
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 4,
				"body": "its not a scam",
				"added": 1609895583
			},
			{
				"comment_id": 6,
				"body": "> [tored](#comment_5_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn): Covid exists, but it has been effectively used to gain authoritarian power across the globe. The virus itself isn't a scam, the response to it absolutely is. It has exposed how many people go along with literal retardation (mask mandates outside with no one even remotely nearby) just because the government tells them to do so. Telling us that we can control viruses is also a scam, all over the globe we see that the measures short of total police state lockdown at best postpone the problem (and even then I do not believe you can actually achieve 0 cases, seems ridiculous and false numbers seem to be a better explanation).\n\nthe goal isn't to reach 0 cases its to slow down the spread as a cure or vaccine can be developed and distributed. also governments aren't saying that masks and lockdowns prevent the spread health and scientific authorities are.",
				"added": 1610192228
			},
			{
				"comment_id": 8,
				"body": "> I am fairly certain the WHO's current position is that lockdowns are not effective\n\ntheir current stance is that they're effective just not as a primary strategy to halt spread.\n\n> I am against both being forced onto people on principle\n\nthat's a good point but personally I'm ok with measures like that being forced as long as they're temporary and reasonable, because the saving of human life achieved by the measures outweighs their admittedly totalitarian implementation.",
				"added": 1610201211
			},
			{
				"comment_id": 9,
				"body": "> We also have not seen any public debate weighing the pros and cons of the preventative measures taken\n\nI don't know about yours but in my country they're are public debates about the pros and cons of preventative measures.\n\n> We've been treated to confusing messaging, constantly shifting standards, endless bait and switches of \"we'll allow you to open in a month\" changing to \"sorry, you can't open\" after people already invested their money.\n\nWith it being a virus its almost imposible to predict even how it will be in even a few weeks, and as it being new research into it is still in its infancy as new information about the virus is discoverd advice must change with it. No one wants the economy to be damaged as governments an politicans benifit from a stronger economy as well. They're just trying to strike a ballence between many factors in an ever changing situation with extremly high stakes.\n\n> On top of that, time and time again the politicians and media personalities were caught breaking the rules they set or promoted, with little to no consequence for doing so.\n\nAgain I don't know about your country but over hear when a politicain was found out to have broken lockdown measuers it was a major scandel.\n\n>  Lockdowns lead to higher suicide and abuse rates, deteriorating mental health, destruction of small businesses, not to mention economical damage and further debt.\n\nAtleast over hear all of the above are recongnised negatives of lockdown and their are many programs in place and organisations founded to try combat those negatives. They're all some of the biggest factors taken into account when determining how lockdowns should be introduced.\n\n> and objectors called morons, censored or deplatformed.\n\nI completly agree that your being rediculed, censord, and deplatfromed. I think its a disgrace, even if I disagree with you, you still deserve a platform to speak your openions freely and people should still listen to those openions, and take on board some ideas presented.",
				"added": 1610209789
			},
			{
				"comment_id": 10,
				"body": "> HIDE YOUR KIDS HIDE YOUR WIFE CAUSE THEY BE SHOOTING ERRYONE OUT HERE\n\nwe have to lockdown most people not because they themselves are at rick of the symptoms its because they are at risk of spreading it to those who are at risk of the symptoms.\n\n>  while you ride the tidal wave of panic to the throne of power.\n\nwho's gaining power from all this?",
				"added": 1610212244
			},
			{
				"comment_id": 11,
				"body": "> [tored](#comment_8_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn): Thanks a lot for the conversation, I'm very glad to talk to someone reasonable after feeling like the world is going insane for a long time. I suppose it comes down to country differences, I envy your situation and would definitely have far less of a problem with lockdowns had it been the same here.\n\nthanks as well I think if I were in your country O would probably have different views on the matter as well. A lot of the time online people can get stuck in echochambers not understanding why people of opposing views believe what they believe, I'm glad we can come to an understanding. I hope we both understand eachothers sides a bit more and take that in to account in future.",
				"added": 1610213738
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 5,
				"body": "> [sj29msn5kz0ldmn](#comment_38_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): It was a mirror of this one: https://www.lostallhope.com/but unfortunately I can't find zeronet link\n\nthis one http://127.0.0.1:43110/1FfA8CzMxxmxCqrsMh39CNZbT1qWWaXRrB/",
				"added": 1610060130
			}
		],
		"1610213876_1DwHLw8xozvxUCnABQUo3RENEScpas5kRj": [
			{
				"comment_id": 12,
				"body": "did you lose your private key?",
				"added": 1610217639
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 14,
				"body": "> [oldone](#comment_3_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp): gross\n\nagreed",
				"added": 1610229159
			}
		],
		"1609818090_16GjpPqXFJ8Vv9bXgBPCNswucvtTeDU4C5": [
			{
				"comment_id": 15,
				"body": "hi",
				"added": 1610300570
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 17,
				"body": "> [bigbadbob](#comment_1239_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Don't worry... They will just announce new variants to shit on your \"hard work\"\n\ncan you please expand",
				"added": 1610310590
			}
		],
		"1610273837_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 18,
				"body": "> [bigbadbob](#comment_1240_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I predict global revolt.\n\nmost of the world is pretty stable",
				"added": 1610310637
			},
			{
				"comment_id": 21,
				"body": "> [bigbadbob](#comment_1243_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): It is your belief... Not mine.\n\nI mean I could kind of see why you'd think America isn't that stable but the rest of the world is still pretty stable.",
				"added": 1610364456
			}
		],
		"1610356743_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 19,
				"body": "> I like the minimal design of this zite but it's lacking in features. I want some way to get notified when someone replies to me\n\nThey'res a mention tab on ZeroHello. If someone replies to your comment it will mention you by default.",
				"added": 1610357372
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 20,
				"body": "can you present some evidence that he won?",
				"added": 1610359439
			},
			{
				"comment_id": 22,
				"body": "> [steeljacket](#comment_30_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): I don't think there is any evidence he won, but only because off a mountain of circumstantial, statistical, historical, and not-quite-certain evidence that the election was ballot stuffed. So we just have to live with Biden until he croaks, then it's boogaloo time. [...]\n\ncan you please site a source.",
				"added": 1610394248
			}
		],
		"1610479210_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 23,
				"body": "if you click the three dots beside zerotalk and click on \"Clone\" it will clone the zite and make you your own forum. To change the language to your hometowns you navigate to data in the zeronet folder, then you open the directory that has the same name as your new zites url. Next open the directory called languages open any of .json files copy everything in it . After that create a new .json and paste everything in it. Then just change all of the translations in it to be those of your hometowns language.",
				"added": 1610483447
			}
		],
		"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 24,
				"body": ">  Yet, in God's mercy, He sent his Son, Jesus to pay the debt of death in hell that I should have paid, but Jesus died on the cross for me and the sins of the world and rose from death on the third day, showing that God's wrath and justice was satisfied. Hence, Jesus can offer eternal life to all who repents, trusts in him. \n\nas someone who isn't christian i never really understood Jesus sacrificing himself do you mind explaining it.",
				"added": 1610577365
			}
		]
	},
	"comment_vote": {
		"756_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"22_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"28_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1_1ApLZcR6jewmFQQmfruTbDtdHc1X1qbMeP": 1,
		"821_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"2_112NAM5jhYWH4egafracJEF92oyeUY3F3T": 1,
		"7_18rBTXj2fkSLcnaumaafaidHTFEA6eu5kV": 1,
		"2_1AcrqMJj7MBya3MAK6pFCKL1j83qT95B1r": 1,
		"17_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"11_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": 1,
		"28_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"4_112NAM5jhYWH4egafracJEF92oyeUY3F3T": 1,
		"5_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"3_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"1_112NAM5jhYWH4egafracJEF92oyeUY3F3T": 1,
		"8_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"1_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": 1,
		"4_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW": 1,
		"5_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW": 1,
		"10_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"9_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"1_1DwHLw8xozvxUCnABQUo3RENEScpas5kRj": 1,
		"3_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"13_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW": 1,
		"74_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"4_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"13_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"7_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"2_14MENdHX7mu4JWxeHuUibBHmZhr6brq7AN": 1,
		"7_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": 1,
		"527_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2864_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem": 1
	}
}