{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1572281379_1KJWLBhkwmtbUH2zhcbfWinQK9kJ4Kosfb": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1572281379_1KJWLBhkwmtbUH2zhcbfWinQK9kJ4Kosfb": [
			{
				"comment_id": 1,
				"body": "https://www.youtube.com/watch?v=VyBD9opVGpk\nNazi boy (((Andrew Anglin))) exposed as Jew \nANDREW ANGLIN IS JEWISH.",
				"added": 1572403773
			}
		],
		"1572423224_1K6oaTYB17miXmrQJQFFKss1Qg4mBox1Lr": [
			{
				"comment_id": 2,
				"body": "The website loads just fine.",
				"added": 1572441050
			}
		],
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 3,
				"body": "Violence will not solve the problem.  It will only give the Jewish ran Federal government and MSM more justification to pound the idea that whites are domestic terrorists into the heads of the American public.",
				"added": 1572913114
			}
		],
		"1572647527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Jewish people had to correct the record?????   You are aware major media companies in the US/World are JEWISH OWNED right?  \n\n\nhttp://tapnewswire.com/2015/10/six-jewish-companies-control-96-of-the-worlds-media/\n\n\nSix Jewish Companies Control 96% of the World’s Media\n Sat 9:52 am +00:00, 17 Oct 2015  18\t\nposted by Gordon\n\nThe power of lies, deceptions and disinformation as Americans pay the price of collective stupidity.\n\n“You know very well, and the stupid Americans know equally well, that we control their government, irrespective of who sits in the White House. You see, I know it and you know it that no American president can be in a position to challenge us even if we do the unthinkable. What can they (Americans) do to us? We control congress, we control the media, we control show biz, and we control everything in America. In America you can criticize God, but you can’t criticize Israel…” Israeli spokeswoman, Tzipora Menache\n\nFacts of Jewish Media Control\n\nThe largest media conglomerate today is Walt Disney Company, whose chairman and CEO, Michael Eisner, is a Jew. The Disney Empire, headed by a man described by one media analyst as a “control freak”, includes several television production companies (Walt Disney Television, Touchstone Television, Buena Vista Television), its own cable network with 14 million subscribers, and two video production companies. As for feature films, the Walt Disney Picture Group, headed by Joe Roth (also a Jew), includes Touchstone Pictures, Hollywood Pictures, and Caravan Pictures. Disney also owns Miramax Films, run by the Weinstein brothers. When the Disney Company was run by the Gentile Disney family prior to its takeover by Eisner in 1984, it epitomized wholesome, family entertainment. While it still holds the rights to Snow White, under Eisner, the company has expanded into the production of graphic sex and violence. In addition, it has 225 affiliated stations in the United States and is part owner of several European TV companies. ABC’s cable subsidiary, ESPN, is headed by president and CEO Steven Bornstein, a Jew.\n\nThis corporation also has a controlling share of Lifetime Television and the Arts & Entertainment Network cable companies. ABC Radio Network owns eleven AM and ten FM stations, again in major cities such as New York, Washington, Los Angeles, and has over 3,400 affiliates. Although primarily a telecommunications company, Capital Cities/ABC earned over $1 billion in publishing in 1994. It owns seven daily newspapers, Fairchild Publications, Chilton Publications, and the Diversified Publishing Group. Time Warner, Inc, is the second of the international media leviathans.\n\nThe chairman of the board and CEO, Gerald Levin, is a Jew. Time Warner’s subsidiary HBO is the country’s largest pay-TV cable network. Warner Music is by far the world’s largest record company, with 50 labels, the biggest of which is Warner Brothers Records, headed by Danny Goldberg. Stuart Hersch is president of Warnervision, Warner Music’s video production unit. Goldberg and Hersch are Jews. Warner Music was an early promoter of “gangsta rap.” Through its involvement with Interscope Records, it helped popularize a genre whose graphic lyrics explicitly urge Blacks to commit acts of violence against Whites. In addition to cable and music, Time Warner is heavily involved in the production of feature films (Warner Brothers Studio) and publishing. Time Warner’s publishing division (editor-in-chief Norman Pearlstine, a Jew) is the largest magazine publisher in the country (Time, Sports Illustrated, People, Fortune).\n\nWhen Ted Turner, a Gentile, made a bid to buy CBS in 1985, there was panic in media boardrooms across the nation. Turner made a fortune in advertising and then had built a successful cable-TV news network, CNN. Although Turner employed a number of Jews in key executive positions in CNN and had never taken public positions contrary to Jewish interests, he is a man with a large ego and a strong personality and was regarded by Chairman William Paley (real name Palinsky, a Jew) and the other Jews at CBS as uncontrollable: a loose cannon who might at some time in the future turn against them. Furthermore, Jewish newsman Daniel Schorr, who had worked for Turner, publicly charged that his former boss held a personal dislike for Jews.\n\nTo block Turner’s bid, CBS executives invited billionaire Jewish theater, hotel, insurance, and cigarette magnate Laurence Tisch to launch a “friendly” takeover of the company, and from 1986 till 1995 Tisch was the chairman and CEO of CBS, removing any threat of non-Jewish influence there. Subsequent efforts by Turner to acquire a major network have been obstructed by Levin’s Time Warner, which owns nearly 20 percent of CBS stock and has veto power over major deals. Viacom, Inc, headed by Sumner Redstone (born Murray Rothstein), a Jew, is the third largest megamedia corporation in the country, with revenues of over $10 billion a year. Viacom, which produces and distributes TV programs for the three largest networks, owns 12 television stations and 12 radio stations. It produces feature films through Paramount Pictures, headed by Jewess Sherry Lansing. Its publishing division includes Prentice Hall, Simon & Schuster, and Pocket Books.\n\nIt distributes videos through over 4,000 Blockbuster stores. Viacom’s chief claim to fame, however, is as the world’s largest provider of cable programming, through its Showtime, MTV, Nickelodeon, and other networks. Since 1989, MTV and Nickelodeon have acquired larger and larger shares of the younger television audience. With the top three, and by far the largest, media companies in the hand of Jews, it is difficult to believe that such an overwhelming degree of control came about without a deliberate, concerted effort on their part. What about the other big media companies? Number four on the list is Rupert Murdoch’s News Corporation, which owns Fox Television and 20th Century Fox Films. Murdoch is a Gentile, but Peter Chermin, who heads Murdoch’s film studio and also oversees his TV production, is a Jew. Number five is the Japanese Sony Corporation, whose U.S. subsidiary, Sony Corporation of America, is run by Michael Schulhof, a Jew. Alan Levine, another Jew, heads the Sony Pictures division. Most of the television and movie production companies that are not owned by the largest corporations are also controlled by Jews. For example, New World Entertainment, proclaimed by one media analyst as “the premiere independent TV program producer in the United States,” is owned by Ronald Perelman, a Jew. The best known of the smaller media companies, Dreamworks SKG, is a strictly kosher affair.\n\nDream Works was formed in 1994 amid great media hype by recording industry mogul David Geffen, former Disney Pictures chairman Jeffrey Katzenberg, and film director Steven Spielberg, all three of whom are Jews. The company produces movies, animated films, television programs, and recorded music. Two other large production companies, MCA and Universal Pictures, are both owned by Seagram Company, Ltd. The president and CEO of Seagram, the liquor giant, is Edgar Bronfman Jr., who is also president of the World Jewish Congress. It is well known that Jews have controlled the production and distribution of films since the inception of the movie industry in the early decades of the 20th century.\n\nThis is still the case today. Films produced by just the five largest motion picture companies mentioned above-Disney, Warner Brothers, Sony, Paramount (Viacom), and Universal (Seagram)-accounted for 74 per cent of the total box-office receipts for the first eight months of 1995. The big three in television network broadcasting used to be ABC, CBS, and NBC. With the consolidation of the media empires, these three are no longer independent entities. While they were independent, however, each was controlled by a Jew since its inception: ABC by Leonard Goldenson, CBS first by William Paley and then by Lawrence Tisch, and NBC first by David Sarnoff and then by his son Robert. Over periods of several decades, these networks were staffed from top to bottom with Jews, and the essential Jewishness of network television did not change when the networks were absorbed by other corporations. The Jewish presence in television news remains particularly strong. As noted, ABC is part of Eisner’s Disney Company, and the executive producers of ABC’s news programs are all Jews: Victor Neufeld (20-20), Bob Reichbloom (Good Morning America), and Rick Kaplan (World News Tonight). CBS was recently purchased by Westinghouse Electric Corporation. Nevertheless, the man appointed by Lawrence Tisch, Eric Ober, remains president of CBS News, and Ober is a Jew. At NBC, now owned by General Electric, NBC News president Andrew Lack is a Jew, as are executive producers Jeff Zucker (Today), Jeff Gralnick (NBC Nightly News), and Neal Shapiro (Dateline).\n\nThe Print Media After television news, daily newspapers are the most influential information medium in America. Sixty million of them are sold (and presumably read) each day. These millions are divided among some 1,500 different publications. One might conclude that the sheer number of different newspapers across America would provide a safeguard against Jewish control and distortion. However, this is not the case. There is less independence, less competition, and much less representation of our interests than a casual observer would think.\n\nThe days when most cities and even towns had several independently owned newspapers published by local people with close ties to the community are gone. Today, most “local” newspapers are owned by a rather small number of large companies controlled by executives who live and work hundreds or ever thousands of miles away. The fact is that only about 25 per cent of the country’s 1,500 papers are independently owned; the rest belong to multi-newspaper chains. Only a handful are large enough to maintain independent reporting staffs outside their own communities; the rest depend on these few for all of their national and international news. The Newhouse empire of Jewish brothers Samuel and Donald Newhouse provides an example of more than the lack of real competition among America’s daily newspapers: it also illustrates the insatiable appetite Jews have shown for all the organs of opinion control on which they could fasten their grip.\n\nThe Newhouses own 26 daily newspapers, including several large and important ones, such as the Cleveland Plain Dealer, the Newark Star-Ledger, and the New Orleans Times-Picayune; the nation’s largest trade book publishing conglomerate, Random House, with all its subsidiaries; Newhouse Broadcasting, consisting of 12 television broadcasting stations and 87 cable-TV systems, including some of the country’s largest cable networks; the Sunday supplement Parade, with a circulation of more than 22 million copies per week; some two dozen major magazines, including the New Yorker, Vogue, Madmoiselle, Glamour, Vanity Fair, Bride’s, Gentlemen’s Quarterly, Self, House & Garden, and all the other magazines of the wholly owned Conde Nast group.\n\nThis Jewish media empire was founded by the late Samuel Newhouse, an immigrant from Russia. The gobbling up of so many newspapers by the Newhouse family was in large degree made possible by the fact that newspapers are not supported by their subscribers, but by their advertisers. It is advertising revenue–not the small change collected from a newspaper’s readers–that largely pays the editor’s salary and yields the owner’s profit. Whenever the large advertisers in a city choose to favor one newspaper over another with their business, the favored newspaper will flourish while its competitor dies. Since the beginning of the 20th century, when Jewish mercantile power in America became a dominant economic force, there has been a steady rise in the number of American newspapers in Jewish hands, accompanied by a steady decline in the number of competing Gentile newspapers–primarily as a result of selective advertising policies by Jewish merchants. Furthermore, even those newspapers still under Gentile ownership and management are so thoroughly dependent upon Jewish advertising revenue that their editorial and news reporting policies are largely constrained by Jewish likes and dislikes. It holds true in the newspaper business as elsewhere that he who pays the piper calls the tune.\n\nThree Jewish Newspapers\n\nThe suppression of competition and the establishment of local monopolies on the dissemination of news and opinion have characterized the rise of Jewish control over America’s newspapers. The resulting ability of the Jews to use the press as an unopposed instrument of Jewish policy could hardly be better illustrated than by the examples of the nation’s three most prestigious and influential newspapers: the New York Times, the Wall Street Journal, and the Washington Post. These three, dominating America’s financial and political capitals, are the newspapers which set the trends and the guidelines for nearly all the others. They are the ones which decide what is news and what isn’t, at the national and international levels. They originate the news; the others merely copy it, and all three newspapers are in Jewish hands. The New York Times was founded in 1851 by two Gentiles, Henry Raymond and George Jones. After their deaths, it was purchased in 1896 from Jones’s estate by a wealthy Jewish publisher, Adolph Ochs. His great-grandson, Arthur Ochs Sulzberger, Jr., is the paper’s current publisher and CEO. The executive editor is Max Frankel, and the managing editor is Joseph Lelyveld.\n\nBoth of the latter are also Jews. The Sulzberger family also owns, through the New York Times Co., 33 other newspapers, including the Boston Globe; twelve magazines, including McCall’s and Family Circle with circulations of more than 5 million each; seven radio and TV broadcasting stations; a cable-TV system; and three book publishing companies. The New York Times News Service transmits news stories, features, and photographs from the New York Times by wire to 506 other newspapers, news agencies, and magazines. Of similar national importance is the Washington Post, which, by establishing its “leaks” throughout government agencies in Washington, has an inside track on news involving the Federal government.\n\nThe Washington Post, like the New York Times, had a non-Jewish origin. It was established in 1877 by Stilson Hutchins, purchased from him in 1905 by John McLean, and later inherited by Edward McLean. In June 1933, however, at the height of the Great Depression, the newspaper was forced into bankruptcy. It was purchased at a bankruptcy auction by Eugene Meyer, a Jewish financier. The Washington Post is now run by Katherine Meyer Graham, Eugene Meyer’s daughter. She is the principal stockholder and the board chairman of the Washington Post Co.\n\nIn 1979, she appointed her son Donald publisher of the paper. He now also holds the posts of president and CEO of the Washington Post Co. The Washington Post Co. has a number of other media holdings in newspapers, television, and magazines, most notably the nation’s number-two weekly newsmagazine, Newsweek. The Wall Street Journal, which sells 1.8 million copies each weekday, is the nation’s largest-circulation daily newspaper. It is owned by Dow Jones & Company, Inc., a New York corporation which also publishes 24 other daily newspapers and the weekly financial tabloid Barron’s, among other things. The chairman and CEO of Dow Jones is Peter Kann, who is a Jew. Kann also holds the posts of chairman and publisher of the Wall Street Journal. Most of New York’s other major newspapers are in no better hands than the New York Times and the Wall Street Journal. The New York Daily News is owned by Jewish real-estate developer Mortimer B. Zuckerman. The Village Voice is the personal property of Leonard Stern, the billionaire Jewish owner of the Hartz Mountain pet supply firm.\n\nOther Mass Media\n\nThe story is pretty much the same for other media as it is for television, radio, and newspapers. Consider, for example, newsmagazines. There are only three of any note published in the United States: Time, Newsweek, and U.S. News and World Report. Time, with a weekly circulation of 4.1 million, is published by a susidiary of Time Warner Communications. The CEO of Time Warner Communications, as mentioned above, is Gerald Levin, a Jew. Newsweek, as mentioned above, is published by the Washington Post Company, under the Jewess Katherine Meyer Graham.\n\nIts weekly circulation is 3.2 million. U.S. News & World Report, with a weekly circulation of 2.3 million, is owned and published by Mortimer Zuckerman, a Jew. Zuckerman also owns the Atlantic Monthly and New York’s tabloid newspaper, the Daily News, which is the sixth-largest paper in the country. Among the giant book-publishing conglomerates, the situation is also Jewish. Three of the six largest book publishers in the U.S., according to Publisher’s Weekly, are owned or controlled by Jews. The three are first-place Random House (with its many subsidiaries, including Crown Publishing Group), third-place Simon & Schuster, and sixth-place Time Warner Trade Group (including Warner Books and Little, Brown). Another publisher of special significance is Western Publishing. Although it ranks only 13th in size among all U.S. publishers, it ranks first among publishers of children’s books, with more than 50 percent of the market. Its chairman and CEO is Richard Snyder, a Jew, who just replaced Richard Bernstein, also a Jew.\n\nThe Effect of Jewish Control of the Media\n\nThese are the facts of Jewish media control in America. Anyone willing to spend several hours in a large library can verify their accuracy. I hope that these facts are disturbing to you, to say the least. Should any minority be allowed to wield such awesome power? Certainly, not and allowing a people with beliefs such as expressed in the Talmud, to determine what we get to read or watch in effect gives this small minority the power to mold our minds to suit their own Talmudic interests, interests which as we have demonstrated are diametrically opposed to the interests of our people. By permitting the Jews to control our news and entertainment media, we are doing more than merely giving them a decisive influence on our political system and virtual control of our government; we also are giving them control of the minds and souls of our children, whose attitudes and ideas are shaped more by Jewish television and Jewish films than by their parents, their schools, or any other influence.",
				"added": 1572914199
			},
			{
				"comment_id": 5,
				"body": "And, wasn't there a few conservative Jews called antisemite?  Here is a fantastic article written by Mr. Winston Churchhill about Zionism v. Bolshevism:\n\nhttps://archive.org/details/ZionismVsBolshevismByWinstonChurchill <<<<<<<<Picture of the original news article\n\n\nhttps://www.europeandefenceleague.com/2018/04/17/zionism-versus-bolshevism-a-struggle-for-the-soul-of-the-jewish-people-by-the-rt-hon-winston-s-churchill/  <<<<<<<<<<<<<<<<<<<<<<<<Copy and paste of article from European Defense League\n\nThis article by Winston Churchill was published in Illustrated Sunday Herald (London) on February 8, 1920 and I reproduce it here to show that the Jewish Question is nothing new but rather that it has preoccupied societies in which Jews live for centuries.\nI need to research the subject a great deal more but I suspect that one of the reasons Churchill supported the Balfour Declaration and the creation of the State of Israel some 30 years later was because he believed that this would divert Jews from their obsession with Bolshevism. I think he was mistakenly optimistic. Although Jews in Israel have moved towards the ethnocentric right since 1948, the Jewish diaspora remains strongly, but not wholly, left-leaning whilst at the same time generally supporting the right of Israel to exist.\nI also reject Churchill’s idea that Christian ethics are based on Judaism. If anything maintaining Leviticus and Deuteronomy as part of broader Christian doctrine has been more harmful than anything else. Furthermore in the same way as the Talmud divides humanity into Jews and Goyim, the Torah preaches one rule for the Israelites and another for any tribe that opposes them.\nChurchill speaks in detail of International Jews, who he describes as a “world-wide conspiracy for the overthrow of civilisation and for the reconstitution of society on the basis of arrested development, of envious malevolence, and impossible equality”. Even before the Holodomor of the 1930s, he recognises that despite special protection having been given to Jewish places of worship, Jews have been responsible for inflicting “injustice on millions of helpless people”.\nHis solution is the creation of an Israeli state. However, as I said above, I think he is overly optimistic about this being a definitive solution to the Jewish Question. It’s not a question of either or regarding Zionism and Bolshevism because the former seems to be part of the DNA of even secular atheistic Jews. It seems to me that Jewish identity seems to be a complex mix of ethnic, religious and cultural factors, which I admit I do not fully understand.\nFurthermore, the creation of Israel has if anything aggravated the problem and has led to the creation of Jewish lobbies in Western societies and political infiltrators, the most visible of which is the Neocons in the United States, who constantly work for destabilisation and regime change in the Middle East which will benefit Israel. Not only the Iraq War but also the current conflict in Syria are ominous cases in point.\nHere’s the text:\nSOME people like Jews and some do not; but no thoughtful man can doubt the fact that they are beyond all question the most formidable and the most remarkable race which has ever appeared in the world.\nDisraeli, the Jew Prime Minister of England, and Leader of the Conservative Party, who was always true to his race and proud of his origin, said on a well-known occasion: “The Lord deals with the nations as the nations deal with the Jews.” Certainly when we look at the miserable state of Russia, where of all countries in the world the Jews were the most cruelly treated, and contrast it with the fortunes of our own country, which seems to have been so providentially preserved amid the awful perils of these times, we must admit that nothing that has since happened in the history of the world has falsified the truth of Disraeli’s confident assertion.\nGood and Bad Jews.\nThe conflict between good and evil which proceeds unceasingly in the breast of man nowhere reaches such an intensity as in the Jewish race. The dual nature of mankind is nowhere more strongly or more terribly exemplified. We owe to the Jews in the Christian revelation a system of ethics which, even if it were entirely separated from the supernatural, would be incomparably the most precious possession of mankind, worth in fact the fruits of all other wisdom and learning put together. On that system and by that faith there has been built out of the wreck of the Roman Empire the whole of our existing civilisation.\nAnd it may well be that this same astounding race may at the present time be in the actual process of producing another system of morals and philosophy, as malevolent as Christianity was benevolent, which, if not arrested, would shatter irretrievably all that Christianity has rendered possible. It would almost seem as if the gospel of Christ and the gospel of Antichrist were destined to originate among the same people; and that this mystic and mysterious race had been chosen for the supreme manifestations, both of the divine and the diabolical.\n“National” Jews.\nThere can be no greater mistake than to attribute to each individual a recognisable share in the qualities which make up the national character. There are all sorts of men – good, bad and, for the most part, indifferent – in every country, and in every race. Nothing is more wrong than to deny to an individual, on account of race or origin, his right to be judged on his personal merits and conduct. In a people of peculiar genius like the Jews, contrasts are more vivid, the extremes are more widely separated, the resulting consequences are more decisive.\nAt the present fateful period there are three main lines of political conception among the Jews, two of which are helpful and hopeful in a very high degree to humanity, and the third absolutely destructive.\nFirst there are the Jews who, dwelling in every country throughout the world, identify themselves with that country, enter into its national life, and, while adhering faithfully to their own religion, regard themselves as citizens in the fullest sense of the State which has received them. Such a Jew living in England would say, “I am an Englishman practising the Jewish faith.” This is a worthy conception, and useful in the highest degree. We in Great Britain well know that during the great struggle the influence of what may be called the “National Jews” in many lands was cast preponderatingly on the side of the Allies; and in our own Army Jewish soldiers have played a most distinguished part, some rising to the command of armies, others winning the Victoria Cross for valour.\nThe National Russian Jews, in spite of the disabilities under which they have suffered, have managed to play an honourable and useful part in the national life even of Russia. As bankers and industrialists they have strenuously promoted the development of Russia’s economic resources and they were foremost in the creation of those remarkable organisations, the Russian Co-operative Societies. In politics their support has been given, for the most part, to liberal and progressive movements, and they have been among the staunchest upholders of friendship with France and Great Britain.\nInternational Jews.\nIn violent opposition to all this sphere of Jewish effort rise the schemes of the International Jews. The adherents of this sinister confederacy are mostly men reared up among the unhappy populations of countries where Jews are persecuted on account of their race. Most, if not all, of them have forsaken the faith of their forefathers, and divorced from their minds all spiritual hopes of the next world. This movement among the Jews is not new. From the days of Spartacus-Weishaupt to those of Karl Marx, and down to Trotsky (Russia), Bela Kun (Hungary), Rosa Luxembourg (Germany), and Emma Goldman (United States), this world-wide conspiracy for the overthrow of civilisation and for the reconstitution of society on the basis of arrested development, of envious malevolence, and impossible equality, has been steadily growing. It played, as a modern writer, Mrs. Webster, has so ably shown, a definitely recognisable part in the tragedy of the French Revolution. It has been the mainspring of every subversive movement during the Nineteenth Century; and now at last this band of extraordinary personalities from the underworld of the great cities of Europe and America have gripped the Russian people by the hair of their heads and have become practically the undisputed masters of that enormous empire.\nTerrorist Jews.\nThere is no need to exaggerate the part played in the creation of Bolshevism and in the actual bringing about of the Russian Revolution by these international and for the most part atheistical Jews. It is certainly a very great one; it probably outweighs all others. With the notable exception of Lenin, the majority of the leading figures are Jews. Moreover, the principal inspiration and driving power comes from the Jewish leaders. Thus Tchitcherin, a pure Russian, is eclipsed by his nominal subordinate Litvinoff, and the influence of Russians like Bukharin or Lunacharski cannot be compared with the power of Trotsky, or of Zinovieff, the Dictator of the Red Citadel (Petrograd), or of Krassin or Radek – all Jews. In the Soviet institutions the predominance of Jews is even more astonishing. And the prominent, if not indeed the principal, part in the system of terrorism applied by the Extraordinary Commissions for Combating Counter-Revolution has been taken by Jews, and in some notable cases by Jewesses. The same evil prominence was obtained by Jews in the brief period of terror during which Bela Kun ruled in Hungary. The same phenomenon has been presented in Germany (especially in Bavaria), so far as this madness has been allowed to prey upon the temporary prostration of the German people. Although in all these countries there are many non-Jews every whit as bad as the worst of the Jewish revolutionaries, the part played by the latter in proportion to their numbers in the population is astonishing.\n“Protector of the Jews.”\nNeedless to say, the most intense passions of revenge have been excited in the breasts of the Russian people. Wherever General Denikin’s authority could reach, protection was always accorded to the Jewish population, and strenuous efforts were made by his officers to prevent reprisals and to punish those guilty of them. So much was this the case that the Petlurist propaganda against General Denikin denounced him as the Protector of the Jews. The Misses Healy, nieces of Mr. Tim Healy, in relating their personal experiences in Kieff, have declared that to their knowledge on more than one occasion officers who committed offences against Jews were reduced to the ranks and sent out of the city to the front. But the hordes of brigands by whom the whole vast expanse of the Russian Empire is becoming infested do not hesitate to gratify their lust for blood and for revenge at the expense of the innocent Jewish population whenever an opportunity occurs. The brigand Makhno, the hordes of Petlura and of Gregorieff, who signalised their every success by the most brutal massacres, everywhere found among the half-stupefied, half-infuriated population an eager response to anti-Semitism in its worst and foulest forms.\nThe fact that in many cases Jewish interests and Jewish places of worship are excepted by the Bolsheviks from their universal hostility has tended more and more to associate the Jewish race in Russia with the villainies which are now being perpetrated. This is an injustice on millions of helpless people, most of whom are themselves sufferers from the revolutionary regime. It becomes, therefore, specially important to foster and develop any strongly-marked Jewish movement which leads directly away from these fatal associations. And it is here that Zionism has such a deep significance for the whole world at the present time.\nA Home for the Jews.\nZionism offers the third sphere to the political conceptions of the Jewish race. In violent contrast to international communism, it presents to the Jew a national idea of a commanding character. It has fallen to the British Government, as the result of the conquest of Palestine, to have the opportunity and the responsibility of securing for the Jewish race all over the world a home and a centre of national life. The statesmanship and historic sense of Mr. Balfour were prompt to seize this opportunity. Declarations have been made which have irrevocably decided the policy of Great Britain. The fiery energies of Dr. Weissmann, the leader, for practical purposes, of the Zionist project, backed by many of the most prominent British Jews, and supported by the full authority of Lord Allenby, are all directed to achieving the success of this inspiring movement.\nOf course, Palestine is far too small to accommodate more than a fraction of the Jewish race, nor do the majority of national Jews wish to go there. But if, as may well happen, there should be created in our own lifetime by the banks of the Jordan a Jewish State under the protection of the British Crown, which might comprise three or four millions of Jews, an event would have occurred in the history of the world which would, from every point of view, be beneficial, and would be especially in harmony with the truest interests of the British Empire.\nZionism has already become a factor in the political convulsions of Russia, as a powerful competing influence in Bolshevik circles with the international communistic system. Nothing could be more significant than the fury with which Trotsky has attacked the Zionists generally, and Dr. Weissmann in particular. The cruel penetration of his mind leaves him in no doubt that his schemes of a world-wide communistic State under Jewish domination are directly thwarted and hindered by this new ideal, which directs the energies and the hopes of Jews in every land towards a simpler, a truer, and a far more attainable goal. The struggle which is now beginning between the Zionist and Bolshevik Jews is little less than a struggle for the soul of the Jewish people.\nDuty of Loyal Jews.\nIt is particularly important in these circumstances that the national Jews in every country who are loyal to the land of their adoption should come forward on every occasion, as many of them in England have already done, and take a prominent part in every measure for combating the Bolshevik conspiracy. In this way they will be able to vindicate the honour of the Jewish name and make it clear to all the world that the Bolshevik movement is not a Jewish movement, but is repudiated vehemently by the great mass of the Jewish race.\nBut a negative resistance to Bolshevism in any field is not enough. Positive and practicable alternatives are needed in the moral as well as in the social sphere; and in building up with the utmost possible rapidity a Jewish national centre in Palestine which may become not only a refuge to the oppressed from the unhappy lands of Central Europe, but which will also be a symbol of Jewish unity and the temple of Jewish glory, a task is presented on which many blessings rest.",
				"added": 1572914491
			},
			{
				"comment_id": 6,
				"body": "> [muhwaycism](#comment_1_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): 1) There is no such thing as \"racism.\"2) Anti-\"racism\" is just a codeword for anti-white.3) The Rothschilds run the world. The Rothschilds are Jews. Jews enjoy superior status everywhere they are, hate goyim, and have a literal supremacist religion.4) They are making it illegal to oppose them in any way. They may also elect to just have someone assassinated who they dislike.5) Your government (wherever you are) will cover it up because your government is owned by them.6) If your government was better, your leader will be attacked and defamed, like Hitler, Gaddafi, Saddam, or anyone else. [...]\n\nYes but what is important is that whites try and organize at a grass roots level in their respective communities.  I am not sure how that can be done when most white people are too brain dead or simply afraid to do so. If some people do organize, the US government will make sure it infiltrates  all attempt of white political/religious organization.",
				"added": 1572914768
			}
		],
		"1572837213_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 7,
				"body": "8kun lacks the /pol section.  The only section worth going to.",
				"added": 1572916573
			},
			{
				"comment_id": 8,
				"body": "> [1bfqutudhtexlka](#comment_21_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): should we spam ZN there ?should we advertise 08chan ?\n\nWhat is the point of advertising them when /pol is not included on their website?",
				"added": 1572917325
			}
		]
	},
	"comment_vote": {
		"1_1DwXwzh7tFMXb3HgTwPRxuKD38HVcdBiA3": 1,
		"5_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5": 1
	}
}