{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 1,
				"body": "You would need to make a system where people register privately.   Zeronet is technically not a blockchain so ledgers would be impossible without worrying about someone messing with such.    If you create a Tor hidden server and host a web server you could perhaps create a registration then send via email their credentials for their Zeronet account..   You would need people to run something like a Python App that does all the encryption and processing of data...   But the ledger (Blockchain) is actually the really hard part.",
				"added": 1592834925
			},
			{
				"comment_id": 2,
				"body": "> [frankwalter](#comment_32_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): This thread is not meant for discussions of this type. [...]\n\nThere is NO way you an create a P2P crypto exchange on Zeronet...  You would need people to download a python app that you create for data processing and submission.   Creating something private on Zeronet is not possible as everything is in the open for all to see...    You can post encrypted data that you and the individual using your service could see and use Zeronet as a ledger of sorts, kind of like an XML feed...   The python app could update its data from the feed and submit changes to you via Zeronet.\n\n\"I'm working on a design to make a truly p2p trading crypto exchange, safe, here on zeronet. Comments?\"\nSimply not possible purely using Zeronet!  ...  But a python app that works with Zeronet could be a method to do what you want...   Zeronet uses IPFS but the data is still on a server somewhere...    IPFS and Tor handles the DNS aspects via their networks...   You can try to setup a Zeronet site and have a IPFS address point to such BUT that is somewhat more complicated then simply having users run a python app that does all the processing.",
				"added": 1593105034
			}
		],
		"1593971855_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 3,
				"body": "No switching to FreeBSD for most people is not the best idea...   If you are a system administrator who has a background in BSD and prefer it to Linux then either FreeBSD or OpenBSD will be useful to you...   If you use Linux nearly any flavor / distro will be secure...    BSD and Linux were developed during about the same timeline, Linux for most being the more simple of the two.",
				"added": 1594028923
			},
			{
				"comment_id": 4,
				"body": "> [ryuyu5](#comment_3_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS): In 2020 the reason for using FreeBSD at hosting companies might be just adherence to legacy systems and reuse of various administration scripts that have been created over some long time period. In the past the reason was that the FreeBSD operating system processes did not freeze while one of them was waiting for data to arrive from disk. Even the year 2020 Linux distributions still have that problem with the default process scheduler. Easy to test: start copying some huge ISO images from one non-SSD disk to another and the Linux system freezes till the copying operation is complete. Supposedly the modern Linux has an alternative process scheduler available that does not freeze the system in that occasion, but supposedly (I have not tested it) it is in average less efficient than the one that does freeze. [...]\n\nInformation helps to clarify why admins kept using BSD for such a long time.",
				"added": 1594547467
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 5,
				"body": "That is what happens when Supreme Court Justices are mostly far left wing.   Perhaps because nearly all US States are broke they simply don't want the responsibility and push it back on the native Americans (Indians) ...  Wait until a great many other native tribes start claiming land...  Good bye USA!",
				"added": 1594547754
			},
			{
				"comment_id": 6,
				"body": "> [reichama](#comment_20_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Truly Clown World.\n\nThat is putting it very nicely!",
				"added": 1594547809
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 7,
				"body": "Buying and selling...   Second hand shops for example can be started...   Fairly complex making money...  Easy way is to find a part time job.",
				"added": 1594547971
			}
		],
		"1594313562_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 8,
				"body": "\"The distance relationship between the 60GHz frequency reuse range, the green region, and the traditional range, the blue region. Oxygen absorption makes possible the same-frequency reuse within a very localized region of air space. Operation within the 60GHz millimeter wave spectrum enables very dense interference free deployment of same frequency radio terminals.\"   Source: \"https://scientists4wiredtech.com/wireless-at-60-ghz-has-unique-oxygen-absorption-properties/\"",
				"added": 1594548554
			}
		],
		"1594580652_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 9,
				"body": "You need to HOST and pin the data...  So create an IPFS server, not client, \"upload\" / connect your file to IPFS then pin it to IPFS.  There needs to be enough nodes for the data to propagate through the public network.   Pinning your data helps keep your data available longer and indicates importance...  The Garbage collector will eventually remove / delete NON pinned content...    You can always unpin your file(s) at a later time...   Fairly Easy!",
				"added": 1594582727
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_2469_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Don't listen to vcrovuep4lnye2b9. IFS has nothing to do with IPFS.\n\nIntergalactic File Server (IFS) uses IPFS, such is simply a front end...",
				"added": 1594684443
			},
			{
				"comment_id": 11,
				"body": "http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
				"added": 1594684557
			},
			{
				"comment_id": 13,
				"body": "No Scientology is a cult, and I am starting to think you are a Troll!",
				"added": 1594703235
			},
			{
				"comment_id": 14,
				"body": "Zeronet uses IPFS, what exactly is soooooo hard for you people to understand???   IFS (Intergalactic File Server) is a Zeronet site that allows people to \"upload\" / serve out files through visitors.    And YES IFS is a front end to post to IPFS...    No proof, are you kidding me!?   You can \"upload\" a file through IFS and even get the IPFS address...  What in the HELL are you people passing BS...   I have \"uploaded\" a file through Zeronet and used a Client IPFS connection to view that file...    Stop posting BS...  Just becaue you have NOT checked out the FACTS on the subject does not give you the right to pass misinformation...  There are plenty of people on Zeronet who would develop but are given poor and misleading BS...   I don't have to proof shit, it is not my responsibility to educate you on the subject!",
				"added": 1595133675
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2490_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I have an equal amount of proof that you're a child predator, and no, I'm not trolling.\n\nLet me take a wild guess styromaniac you are a 50 cent army troll!?  ...  Slander, miss information, anti western comments.    Child predator and proof... REALLY!?  ... and how exactly do you know that I'm not female?",
				"added": 1595400842
			}
		],
		"1594689481_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "Yea, it is more complicated than it needs to be...   Perhaps a Python plugin to extend functionality would be better...",
				"added": 1594695371
			}
		],
		"1594974805_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 15,
				"body": "I do not understand this post, can someone please explain it to me? ...  Thanks :)",
				"added": 1595133821
			}
		]
	},
	"comment_vote": {}
}