{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1585494937,
			"title": "COVID19 + Digital Dollar + Surveillance + Biometric-ID   -- putting all the pieces together = Global Government",
			"body": "\"Digital identity is a computerized record of who a person is, stored in a registry. It is used, in this case, to keep track of who has received vaccination.\"\n\n\"The program to leverage immunization as an opportunity to establish digital identity was unveiled by ID2020 in partnership with the Bangladesh Government’s Access to Information (a2i) Program, the Directorate General of Health Services, and Gavi, according to the announcement.\"\n\nhttps://www.biometricupdate.com/201909/id2020-and-partners-launch-program-to-provide-digital-id-with-vaccines\n\nMicrosoft published a patent dubbed “Cryptocurrency system using body activity data” on March 26. Their paperwork details a method of crypto mining which exploits data associated with a user’s body activity to exercise a new form of proof-of-work. The document further details:\n\n    “For example, a brain wave or body heat emitted from the user when the user performs the task provided by an information or service provider, such as viewing advertisement or using certain internet services, can be used in the mining process.”\n\nhttps://cointelegraph.com/news/microsoft-files-patent-for-crypto-mining-system-using-body-activity-data",
			"added": 1585494936
		}
	],
	"topic_vote": {
		"1585905585_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1585842700_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1585226591_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "ID2020  = Mark of the Beast \n\nhttps://www.biometricupdate.com/201909/id2020-and-partners-launch-program-to-provide-digital-id-with-vaccines\n\nDigital identity is a computerized record of who a person is, stored in a registry. It is used, in this case, to keep track of who has received vaccination.\n\n“We are implementing a forward-looking approach to digital identity that gives individuals control over their own personal information, while still building off existing systems and programs,” says Anir Chowdhury, policy advisor at a2i. “The Government of Bangladesh recognizes that the design of digital identity systems carries far-reaching implications for individuals’ access to services and livelihoods, and we are eager to pioneer this approach.”",
				"added": 1585495262
			}
		],
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 2,
				"body": "\"The case, commonly referred to as Telegram Nth Room, has sparked widespread public outrage. Millions of Koreans signed petitions calling for police to reveal the identities of the chat room operator and all other participants.\"\n\nThe government responded SWIFTLY\".  This is what you're asking for : More Government in our private lives.\n\nhttps://www.hrw.org/news/2020/03/26/south-korea-online-sexual-abuse-case-illustrates-gaps-government-response\n\n\"For preventing recurrence and resolving this case, experts have indicated that the following is necessary. First, request the active international cooperation of governments. Second, establish a dedicated department for digital sexual crimes. Third, build a strong system for strengthening the weighing of offenses, and CONFISCATING the proceeds of crime. Fourth, permitting sting investigations....\nFifth, PUNISHING the PLATFORMS.  (!!!)\" Then Enters the EARN IT ACT - And that's how our Internet Freedom ends.",
				"added": 1585496899
			}
		],
		"1585399613_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 3,
				"body": "I don't see anything wrong in having \"Nth Rooms\" flourishing all over decentralized networks like this. There is no real crime on that, they're just bits of data moving around computers. Transmitting controversial content doesn't harm people at all,  no victims are affected. \nThe only problem in this world is bad parenting, those real people harming  little children and then exploiting them. The solution is not allowing idiots to procreate and bringing children to this rotten world, those people that don't take any responsibility of their heinous acts. \n\nTechnology should be neutral to any moral aspects in human lives, and must be developed freely without any government interference.  \n\nInternet and privacy networks aren't bad at all: like cars, can be used for transportation but also they could kill people when they were used improperly. Just because cars can cause a lot of harm in accidents doesn't mean that they should be prohibited.",
				"added": 1585588104
			}
		]
	},
	"comment_vote": {
		"31_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"70_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"34_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1,
		"26_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"389_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"513_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"453_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"11_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1_1BKJiQF8pvdQw99D1XpTG2UJ6eno1zFPCK": 1
	}
}