{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1537466014,
			"title": "Adding Zerome Users from a Different Hub",
			"body": "I created an id in whitehub and I'm not able to add some users from sunhub. Are there any tricks to doing this?",
			"added": 1537466013
		},
		{
			"topic_id": 1537600418,
			"title": "Does the ZeroWiki have a Code for Table of Contents",
			"body": "Is there a way to automatically generate a table of contents for the ZeroNet wiki?",
			"added": 1537600416
		},
		{
			"topic_id": 1537763395,
			"title": "Can we follow boards w/o the following button?",
			"body": "Is there a way to follow boards that don't have the following button? For instance the [LInux.net](/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Home) board doesn't have a following button.",
			"added": 1537763392
		}
	],
	"topic_vote": {
		"1538501905_1G77baH5aGCXXRrUkyWQwmeCJppzC56wc2": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1537461292_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "Tor Peers only ever conect via Tor., so closing your zeronet port won't block a Tor peer. It will though block clearnet peers that are using Tor as \"proxy only\".",
				"added": 1537486998
			}
		],
		"1537537878_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 2,
				"body": "How is proving the Riemann Hypothesis a threat to ZeroNet?",
				"added": 1537552301
			}
		],
		"1536786377_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": [
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_687_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Lol. Are you serious? The second pizzagate became a thing the entire MSM from both sides was already on it to try and cover it up. The opposition is the propaganda. [...]\n\nYou don't think the response had anything to do with the fact that someone shot up a Pizza place?",
				"added": 1537589478
			},
			{
				"comment_id": 4,
				"body": "It seems really strange all the focus on a Pizza restaurant, don't most conspiracy revolve around higher symbols of power like the Vatican or something? Also if this Pizza joint was really such a center of misdoings why would they be posting things that would blow their cover? Truthfully, though I know next to nothing about PIzzagate but if I was trying to uncover this type of conspiracy I'd be focusing on [Jeffrey Epstein’s ‘Lolita Express’](https://www.rawstory.com/2015/01/bill-clinton-used-billionaire-jeffrey-epsteins-lolita-express-for-african-charity-tour/) and not some DC PIZZA joint.",
				"added": 1537593462
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 5,
				"body": "So when awarding damagers I guess some judge is going to have to decide how much their egos are worth.  That said I wonder who would pay for the the damages.",
				"added": 1537596203
			},
			{
				"comment_id": 11,
				"body": "I don't understand why there are so much politics around this. People volunteer their time to do this why would we want to prevent people from volunteering their time?",
				"added": 1537840862
			}
		],
		"1537594142_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 6,
				"body": "Why not use a semicolon, run it all in one line and never create a file for this script. Well, I suppose someone might find this script useful enough to save it as a file.",
				"added": 1537596365
			}
		],
		"1537647789_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 7,
				"body": "For sites that a user visits a lot they should be able to use a second method of encryption/verification like pgp. Unfortunately this isn't a web standard. I did notice though in the most recent release of tor for onion sites tor was offering alternative methods of authentication/encryption to either supplement or replace SSL. \n\n  o Major features (portability, cryptography, experimental, TLS):\n    - Tor now has the option to compile with the NSS library instead of\n      OpenSSL. This feature is experimental, and we expect that bugs may\n      remain. It is mainly intended for environments where Tor's\n      performance is not CPU-bound, and where NSS is already known to be\n      installed. To try it out, configure Tor with the --enable-nss\n      flag. Closes tickets 26631, 26815, and 26816.\n\n      If you are experimenting with this option and using an old cached\n      consensus, Tor may fail to start. To solve this, delete your\n      \"cached-consensus\" and \"cached-microdesc-consensus\" files,\n      (if present), and restart Tor.\nhttps://gitweb.torproject.org/tor.git/plain/ChangeLog",
				"added": 1537655763
			},
			{
				"comment_id": 8,
				"body": "Not sure if my last post is right or not because I don't know if tor is or is planning on using NSS for anything other then TSL but here is what I could find about NSS:\n\nNSS supports SSL v2 and v3, TLS, PKCS #5, PKCS #7, PKCS #11, PKCS #12, S/MIME, and X.509 v3 certificates. For complete details, see Encryption Technologies Available in NSS 3.11\nLink to sectionWhat is the relationship between NSS and PSM?\n\nPersonal Security Manager (PSM) is built on top of NSS. It consists of libraries and a daemon designed to support cross-platform development of security-enabled client applications. The PSM binary provides a client module that performs cryptographic operations on behalf of applications. Netscape Personal Security Manager ships with Netscape 6 and the Gateway Connected Touch Pad with Instant AOL, and is also available for use with Communicator 4.7x.\nhttps://developer.mozilla.org/en-US/docs/Mozilla/Projects/NSS/FAQ\n\nPerhaps one of the above listed protocols is something other than a type of https. I need to research each type of certificate. ",
				"added": 1537656007
			}
		],
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 9,
				"body": "> [nekololi](#comment_257_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): ZeroBoard should either be rebuilt to not use clearnet resources or delisted from ZeroHello's default list of zites, since its usefulness as a showcase for what ZeroNet can do is outdated at this point.\n\nAgreed. ZeroBoard sucks. It should definitely be removed from the default list of sites.",
				"added": 1537836229
			}
		],
		"1537763395_12H7vawHrBcyhkGXZYTJKPiboSKaAXyKw6": [
			{
				"comment_id": 10,
				"body": "> [blurhy](#comment_163_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Yeah,we can.Follow the zeronet API\n\nAre there guides on how to do this?",
				"added": 1537840715
			}
		],
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": [
			{
				"comment_id": 12,
				"body": "How would a CoC help Zeronet development???",
				"added": 1537840894
			}
		],
		"1538314307_1AdgRmF4CQZRJVUf7t7GWmETZc2fq6PuBy": [
			{
				"comment_id": 13,
				"body": "If it doesn't support a modified CA store I bet you could could force it to do so by running it in a chroot container.",
				"added": 1538502345
			}
		],
		"1538505571_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 14,
				"body": "> [krixano](#comment_585_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu):  ipv6 a\n\nIsn't the ipv6 address space for cjdns not currently used in the ipv> [krixano](#comment_585_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): p\n\nI think that's not true if you set up a gate operator:\n\"IpTunnel is designed to make it easy to access The Old Internet through cjdns. The way you get to the internet is via \"gate\" nodes which hand you an address the same way as a traditional VPN service would. TOR users might think of it as \"exit nodes\" for cjdns, the main difference is with cjdns you need to ask permission from the gate operator before (ab)using their gateway. to modity thenect to an IPv6 gate, you must first ask the operator of the \"\n\nhttps://github.com/cjdelisle/cjdns/tree/master/tunnel",
				"added": 1538634025
			},
			{
				"comment_id": 15,
				"body": "> [wulf](#comment_9_1AdgRmF4CQZRJVUf7t7GWmETZc2fq6PuBy): Has this been merged into the master ZN github? [...]\n\nOver the Internet cjdns nodes connect to a gateway. The gateway bridges the cjdns Local mesh-networks over some other  network such as Hyperboria. Hyberboria supports IPv4 and IPv6 connections.",
				"added": 1538634576
			},
			{
				"comment_id": 16,
				"body": "> [krixano](#comment_591_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): That first sentence is not coherent at the end, what is \"ipv>krixano:p\" - last time I checked I don't have an ip protocol named after me, and there exists no \"ipv>\" or even \"ipv\", because v stands for version. [...]\n\nI think the javascript is butchering what I type when it tries to trim the quoted text. Anyway, I meant to say something like the IPv6 specification, inInternet task force or whatever party was responsible for reserving Internet addresses.",
				"added": 1538634993
			},
			{
				"comment_id": 19,
				"body": "With regards to denial of service of cjdns over the public Internet, an ISP can only block a single IP address, as single cjdns node may not rely on a single ip address to connect to it, it could have multiple routes to the public netowrks and these routes could be briged over: local networks, local mesh networks, over tor, over VPNs. \n\nHowever, that all said I don't know how necessary such counter measures are because I don't know how well, cjdns protects against DDOS without these counter measures. I do know though that if one is to target the ip address of a cjdn node on the the regular Internet they must first discover which ip addresses and I suspect that in may cases there may be too many of these gateways to target.",
				"added": 1538841796
			}
		],
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 17,
				"body": "> [zeropyro](#comment_26_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): Its possible to access tourgh the browser another zites or clearnet sites to sensitive files. [...]\n\nOne could use iptables to prevent the browser from connecting to anything other than zeronet. For examples look to see how the tor transparent proxy is set up.\n\nhttps://trac.torproject.org/projects/tor/wiki/doc/TransparentProxy \n\nModify this to make the browser a specific user to identify it and then set up ip tables so said user can only send ip traffic through zeronet. As for one site being able to ready from other site, I belive that noscript has protection against cross site scripting. Alternativly, maybe one could set up either privoxy or nginx to reject all such requests. In this case one would instead modify the iptables so that the browser can only connect through either privoxy or nginx -- depending on which approach one takes. ",
				"added": 1538770101
			},
			{
				"comment_id": 18,
				"body": "Anyway, regarding my last post, perhaps an alternative way to mitigate the concerns here is to use a browser with noscript installed, when updating zeronet. This assumes that one trusts noscript -- the people at palemoon don't seem to -- but one has to trust someone!",
				"added": 1538770330
			}
		]
	},
	"comment_vote": {
		"1_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"245_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1
	}
}