{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1591797434_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"1576331633_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1591797434_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": [
			{
				"comment_id": 1,
				"body": "ممنون بابت توضیحات کاملی که دادی.\nقاعدتا باید توی قطعی اینترنت(بین الملل) کار بکنه ولی کارکردنش محدود میشه به peer های داخل ایران و یعنی خیلی از سایت ها که peer ایرانی ندارن قابل استفاده نیستن.\nو اینکه زیرونت هنوز کاملا بدون نیاز به سرور نیست نیاز به ترکر داره برای کار کردن که البته این مشکل رو یه جورایی حل کردن با کمک پلاگین Bootstrapper ولی به صورت دیفالت فعال نیست.",
				"added": 1591814840
			},
			{
				"comment_id": 2,
				"body": "> [badrabbbit](#comment_5_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY): درست میگید هلوایم بی اچ عزیز. همینطوره. با از کار افتادن اینترنت بین المللی چه از داخل چه به خاطر تحریم این هم قطع میشه متاسفانه. جالب اینجاست که وقتی تاریخچه اینترنت رو میخونی برای این توسعه داده شد که در زمان جنگ و حتی بمب اتمی هم کار کنه نه اینکه با یک کلید خاموش بشه. برای همین تو خیلی کشور ها شبکه های مش در حال گسترش هستن. مثل https://en.wikipedia.org/wiki/Guifi.net  https://guifi.net/en که تنها مواردی هستن که عملا به اینترنت نیازی ندارن.مثال های دیگهhttps://en.wikipedia.org/wiki/Freifunkhttps://en.wikipedia.org/wiki/NYC_Mesh\n\nکامل قطع نمیشه.\nکافیه یک peer داخل ایران داشته باشه هر سایت که فعال هم باشه همیشه\nاکثر سایت ها peer های ایرانی دارن و این یکم اوضاع رو بهتر میکنه.\nبه نظرم باید کمی تبلیغات بشه و حجم کاربر های ایرانی ها بره بالاتر.\nو اینکه شبکه کار میکنه توی قطعی نت ولی محدود به peer های داخل ایران.\nحتی اگه کار نکنه به هر دلیلی از وب متمرکز خیلی بهتره.",
				"added": 1591823112
			},
			{
				"comment_id": 4,
				"body": "> [badrabbbit](#comment_7_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY): موافقم. اما من یادمه در ایامی که نت مشکل داشت آی پی های داخلی رو نمیشد حتی ping گرفت. نمیدونم شاید بشه.\n\nاحتمالن به خاطر دی ان اس سروری که استفاده میکردی بوده.\nایپی رو پینگ میکردی یا دامین؟\nچون توی قطعی نت تاکسی های اینترنتی و بانک ها کار میکردن و سرور ایرانی که داشتم هم وصل میشد.",
				"added": 1591824661
			},
			{
				"comment_id": 5,
				"body": "> [badrabbbit](#comment_8_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY): دوست عزیز من محدودیت فضای نوشتاریم داره تموم میشه چطوری باید افزایش بدم؟ مدیر سایت رو شما میشناسید؟\n\nنمیدونم ولی احتمالن بتونی با تغییر دادن Identity address توی ساید بار ۲۰ کیلوبایت دیگه بگیری",
				"added": 1591824996
			},
			{
				"comment_id": 6,
				"body": "> [badrabbbit](#comment_10_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY): خب اینجوری که ای دی فعلی ام رو از دست میدم که؟ بعد زایت های دیگه رو چکار کنم؟ مدیر کیه؟ بهش بگیم افزایش بده اینو بابا.\n\nاره این ایدی رو از دست میدی ولی فکر کنم زیروتاک انگلیسی هم همین باشه.",
				"added": 1591825594
			},
			{
				"comment_id": 7,
				"body": "> [badrabbbit](#comment_11_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY): نه بابا انگلیسی 50 کیلوبایته. تازه کارکتر های فارسی چون unicode بیشتر جا میگیره. خیلی کمه.\n\nاره ولی اگه زیاد هم باشه حجم زایت میره بالا",
				"added": 1591826080
			}
		],
		"1576331633_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 3,
				"body": "> [haxxer](#comment_28_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): ترکر کلاینت برای زیرونت هست.یک سرور میگیری (ارزون چون حجم نمیخواد خیلی ) بعد کلاینت رو نصب میکنی و آدرس رو پخش میکنی.اگر از قبل باهم در ارتباط باشید که بقیه جفت ها رو پیدا میکنید مثل بقیه.یا برای کاور میتونی یک کلاینت برای تورنت بسازی(فرقی نمیکنه ولی نمیگی هدف زیرونت بوده چون زیرونت از ترکر تورنت هم پشتیبانی میکنه)\n\nپلاگین bootstrapper خود زیرونت هر peer رو تبدیل میکنه به یه ترکر نیازی به سرور گرفتن نیست.\nحتی میشه با یه ddns(برای ایپی dynamic) روی کامپیوتر خودت ترکر ران کنی.",
				"added": 1591823442
			}
		]
	},
	"comment_vote": {
		"5_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"6_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"3_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"28_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": 1,
		"2_1Npgz7D2fF5U3u2ZZTd7YMBzsmzyQ2NcDp": 1,
		"7_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"8_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"9_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"1_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"2_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"4_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"5_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"10_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"6_14sm5Lnr4VnRejT6Lecys1pBnuxoazjEQr": 1,
		"1_1Ca5eVEuFUKH52KcsykRCw5zg19Juqdqpy": 1,
		"11_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1,
		"12_1DS2MQYmhVpyFaWVsidXWi22NZD5fvkttY": 1
	}
}