{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "新华社公布媒体禁用词102例",
			"body": "新华社在《新闻阅评动态》第 315 期发表《新华社新闻报道中的禁用词（第一批）》中规定了媒体报道中的禁用词。\n由于原文甚长，此处仅摘录具有明显政治色彩的条目。\n\n5、对各级领导同志的各种活动报道，慎用“亲自”等词。除了党中央国务院召开的重要会议外，一般性会议不用“隆重召开”字眼。\n\n6、对国内领导干部和国有企业负责人，不使用“老板”。\n\n8、不使用“践行‘八荣八耻’”的提法，应使用“践行社会主义荣辱观”。\n\n14、不得使用“某某党委决定给某政府干部行政上撤职、开除等处分”，可使用“某某党委建议给予某某撤职、开除等处分”。\n\n15、不要将“全国人大常委会副委员长”称作“全国人大副委员长”，也不要将“省人大常委会副主任”称作“省人大副主任”。各级人大常委会的委员，不要称作“人大常委”。\n\n17、“村民委员会主任”简称“村主任”，不得称“村长”。大学生村干部可称作“大学生村官”，除此之外不要把村干部称作“村官”。\n\n22、一般不再公开使用“非党人士”的提法。在特定场合，如需强调民主党派人士的身份，可使用“非中共人士”。“党外人士”主要强调中共党内与党外的区别，已经约定俗成，可继续使用。\n\n23、除对过去特定历史时期的表述外，不再继续使用“少数民族上层人士”的称谓。\n\n26、少数民族支系、部落不能称为民族，只能称为“XX人”，如“摩梭人”“撒尼人”“穿（川）青人”，不能称为“摩梭族”“撒尼族”“穿（川）青族”等。\n\n27、不要把古代民族名称与后世民族名称混淆，如不能将“高句丽”称为“高丽”，不能将“哈萨克族”“乌孜别克族”等泛称为“突厥族”或“突厥人”。\n\n28、“穆罕默德”通常是指伊斯兰教先知。有一些穆斯林的名字叫“穆罕默德”。为了区别和避免误解，对这些穆斯林应加上其姓，即使用两节姓名。\n\n29、“穆斯林”是伊斯兰教信徒的通称，不能把宗教和民族混为一谈。不能说“回族就是伊斯兰教”“伊斯兰教就是回族”。稿件中遇到“阿拉伯人”等提法，不要改称“穆斯林”。\n\n30、涉及信仰伊斯兰教的民族的报道，不得提及与猪相关内容。\n\n31、穆斯林宰牛羊及家禽，只说“宰”，不能写作“杀”。\n\n32、香港、澳门是中国的特别行政区。在任何文字、地图、图表中都要避免让人误以为香港、澳门是“国家”。尤其是与其他国家名称连用时，应注意以“国家和地区”来限定。\n\n33、不得将香港、澳门与中国并列提及，如“中港”“中澳”等。不宜将内地与香港、澳门简称为“内港”“内澳”，可以使用“内地与香港(澳门)”，或者“京港（澳）”“沪港（澳）”等。\n\n34、“台湾”与“祖国大陆（或‘大陆’）”为对应概念，“香港、澳门”与“内地”为对应概念，不得弄混。\n\n35、不得将港澳台居民来内地（大陆）称为来“中国”或“国内”。不得说“港澳台游客来华（国内）旅游”，应称为“港澳台游客来内地(大陆)旅游”。\n\n36、中央领导同志到访香港、澳门应称为“视察\"，不得称为“出访”。中央有关部门负责同志到访香港、澳门应称为“考察”或“访问”。\n\n37、称呼包含香港、澳门的国际组织如世界贸易组织、世界气象组织成员时，应统称为“世界贸易组织成员”“世界气象组织成员”等，不得称为“成员国”。\n\n38、在囯际奥林匹克委员会或其他体育事务中，原则上按相应章程的要求或约定称呼。如“中国奥林匹克委员会”可简称为“中国奥委会”，“中国香港奥林匹克委员会”可简称为“中国香港奥委会”，“中国国家队”可简称为“国家队”，“中国香港队”可简称为“香港队”。\n\n39、区分“香港（澳门）居民（市民）”和“香港（澳门）同胞”概念，前者指居住在港(澳)的全体人员，包括永久性居民和非永久性居民，也包括中国籍居民和外国籍居民，后者则指中华民族大家庭成员。\n\n40、区分国境与关境概念。国境是指一个国家行使主权的领土范围，从国境的角度讲，港澳属“境内”;关境是指适用同一海关法或实行同一关税制度的区域，从关境的角度讲，港澳属单独关税区，相对于内地属于“境外”。内地人员赴港澳不属出国但属出境，故内地人员赴港澳纳入出国（境）管理。\n\n41、将港澳台业务单列为国内业务的特殊类别加以规范管理，将往来内地及港澳台之间的交通线路称为“港澳台航线”或“国际/港澳台航线”；将手机“港澳台漫游”业务单独表示，或称为“国际/港澳台漫游”，也可称为“跨境漫游”或“区域漫游”。\n\n42、不得将港资、澳资企业划入外国企业，在表述时少用“视同外资”，多用“参照外资”。\n\n43、内地与港澳在交流合作中签订的协议文本等不得称为“条约”，可称为“安排”“协议”等；不得将适用于国家与国家之间的专属名词用于内地与港澳。\n\n44、涉及内地与港澳在司法联系与司法协助方面，不得套用国际法上的术语，如内地依照涉外民事诉讼、刑事诉讼等程序与港澳开展司法协助，不得使用“中外司法协助”“国际司法协助”“中港（澳）司法协助”等提法，应表述为“区际司法协助”或“内地与香港（澳门）司法协助”等；对两地管辖权或法律规范冲突，应使用“管辖权冲突”“法律冲突”等规范提法，不得使用“侵犯司法主权”等不规范提法；不得使用“引渡犯罪嫌疑人或罪犯”的表述，应称为“移交或遣返犯罪嫌疑人或罪犯”。\n\n45、不得将香港、澳门回归祖国称为“主权移交”“收回主权”，应表述为中国政府对香港、澳门“恢复行使主权”“政权交接”。不得将回归前的香港、澳门称为“殖民地”，可说“受殖民统治”。不得将香港、澳门视为或称为“次主权”地区。\n\n46、不得使用内地与港澳“融合”“一体化”或深港、珠澳“同城化”等词语，避免被解读为模糊“两制”界限、不符合“一国两制”方针政策。\n\n47、香港、澳门特别行政区的官方机构和制度安排，应按照基本法表述。如“香港特别行政区行政长官”不得说成“香港特别行政区政府行政长官”，“澳门特别行政区立法会”不得说成“澳门特别行政区政府立法会”；香港、澳门实行行政主导的政治体制，不得说成“三权分立”。\n\n48、对港澳反对派自我褒扬的用语和提法要谨慎引用。如不使用“雨伞运动”的说法，应称为“非法‘占中’”或“违法‘占中’”；不称“占中三子”，应称为“非法‘占中’发起人”，开展舆论斗争时可视情称为“占中三丑”；不称天主教香港教区退休主教陈日君等为“荣休主教”，应称为“前主教”。\n\n49、对 1949 年 10 月 1 日之后的台湾地区政权，应称之为“台湾当局”或“台湾方面”，不使用“中华民国”，也一律不使用“中华民国”纪年及旗、徽、歌。严禁用“中华民国总统（副总统）”称呼台湾地区正（副）领导人，可称为“台湾当局领导人（副领导人）”“台湾地区领导人（副领导人）”。 对台湾“总统选举”，可称为“台湾地区领导人选举”，简称为“台湾大选”。\n\n50、不使用“台湾政府” 一词。不直接使用台湾当局以所谓“国家”“中央”“全国”名义设立的官方机构名称，对台湾方面“一府”（“总统府”）、“五院”（“行政院”“立法院”“司法院”“考试院”“监察院”）及其下属机构，如“内政部”“文化部”等，可变通处理。如对“总统府”，可称其为“台湾当局领导人幕僚机构”“台湾当局领导人办公室”；对“立法院”可称其为“台湾地区立法机构”；对“行政院”可称其为“台湾地区行政管理机构”；对“台湾当局行政院各部会”可称其为“台湾某某事务主管部门”“台湾某某事务主管机关”，如“文化部”可称其为“台湾文化事务主管部门”，“中央银行”可称其为“台湾地区货币政策主管机关”，“金管会”可称其为“台湾地区金融监管机构”特殊情况下不得不直接称呼上述机构时，必须加引号，我广播电视媒体口播时则需加“所谓”一词。陆委会现可以直接使用，一般称其为“台湾方面陆委会”或“台湾陆委会”。\n\n51、不直接使用台湾当局以所谓“国家”“中央”“全国”名义设立的官方机构中官员的职务名称，可称其为“台湾知名人士”“台湾政界人士”或“xx 先生（女士）”。对“总统府秘书长”，可称其为“台湾当局领导人幕僚长”“台湾当局领导人办公室负责人”；对“行政院长”，可称其为“台湾地区行政管理机构负责人”；对“台湾各部会首长”，可称其为“台湾当局某某事务主管部门负责人”;对“立法委员”，可称其为“台湾地区民意代表”。台湾省、市级及以下（包括台北市、高雄市等“行政院直辖市”）的政府机构名称及官员职务，如省长、市长、县长、议长、议员、乡镇长、局长、处长等，可以直接称呼。\n\n52、“总统府”“行政院”“国父纪念馆”等作为地名，在行文中使用时，可变通处理，可改为“台湾当局领导人办公场所”“台湾地区行政管理机构办公场所”“台北中山纪念馆”等。\n\n53、“政府”一词可使用于省、市、县以下行政机构，如“台湾省政府”“台北市政府”，不用加引号，但台湾当局所设“福建省”“连江县”除外。对台湾地区省、市、县行政、立法等机构，应避免使用“地方政府”“地方议会”的提法。\n\n54、涉及“台独”政党“台湾团结联盟”时，不得简称为“台联”，可简称“台联党”。“时代力量”因主张“台独”，需加引号处理。“福摩萨”“福尔摩莎”因具有殖民色彩，不得使用，如确需使用时，须加引号。\n\n55、对国民党、民进党、亲民党等党派机构和人员的职务，一般不加引号。中国国民党与中国共产党并列时可简称“国共两党”。对于国共两党交流，不使用“国共合作”、“第三次国共合作”等说法。对亲民党、新党不冠以“台湾”字眼。\n\n56、对台湾民间团体，一般不加引号，但对以民间名义出现而实有官方背景的团体，如台湾当局境外设置的所谓“经济文化代表处（办事处）”等应加引号;对具有反共性质的机构、组织（如“反共爱国同盟”“三民主义统一中国大同盟”）以及冠有“中华民国”字样的名称须回避，或采取变通的方式处理。\n\n57、对岛内带有“中国”“中华”字眼的民间团体及企事业单位，如台湾“中华航空”“中华电信”“中国美术学会”“中华道教文化团体联合会”“中华两岸婚姻协调促进会”等，可以在前面冠以“台湾”直接称呼，不用加引号。\n\n58、对以民间身份来访的台湾官方人士，一律称其民间身份。因执行某项两岸协议而来访的台湾官方人士，可称其为“两岸XX协议台湾方面召集人”“台湾XX事务主管部门负责人”。\n\n59、对台湾与我名称相同的大学和文化事业机构，如“清华大学”“故宫博物院”等，应在前面加上台湾、台北或所在地域，如“台湾清华大学”“台湾交通大学”“台北故宫博物院”，一般不使用“台北故宫”的说法。\n\n60、对台湾冠有“国立”字样的学校和机构，使用时均须去掉“国立”二字。如“国立台湾大学”，应称“台湾大学”;“XX国小”“XX囯中”，应称“XX小学”“XX初中”。\n\n61、金门、马祖行政区划隶属福建省管理，因此不得称为台湾金门县、台湾连江（马祖地区），可直接称金门、马祖。从地理上讲，金门、马祖属于福建离岛，不得称为“台湾离岛”，可使用“外岛”的说法。\n\n62、对台湾当局及其所属机构的法规性文件与各式官方文书等，应加引号或变通处理。对台湾当局或其所属机构的“白皮书”，可用“小册子”“文件”一类的用语称之。\n\n63、不得将中华人民共和国法律自称为“大陆法律”。对台湾所谓“宪法”，应改为“台湾地区宪制性规定”，“修宪”“宪改”“新宪”等一律加引号。对台湾地区施行的“法律”改称为“台湾地区有关规定”。如果必须引用台湾当局颁布的“法律”时，应加引号并冠之“所谓”两字。不得使用“两岸法律”等具有对等含义的词语，可就涉及的有关内容和问题进行具体表述，如“海峡两岸律师事务”“两岸婚姻、继承问题”“两岸投资保护问题”等。\n\n64、两岸关系事务是中国内部事务，在处理涉台法律事务及有关报道中，一律不使用国际法上专门用语。如“护照”“文书认证、验证”“司法协助”“引渡”“偷渡”等，可采用“旅行证件”“两岸公证书使用”“文书查证”“司法合作” “司法互助”“遣返”“私渡”等用语。涉及台湾海峡海域时不得使用“海峡中线”一词，确需引用时应加引号。\n\n65、国际场合涉及我国时应称中国或中华人民共和国，不能自称“大陆”；涉及台湾时应称“中国台湾”，且不能把台湾和其他国家并列，确需并列时应标注“国家和地区”。\n\n66、对不属于只有主权国家才能参加的国际组织和民间性的囯际经贸、文化、体育组织中的台湾团组机构，不能以“台湾”或“台北”称之，而应称其为“中国台北”“中囯台湾”。若特殊情况下使用“中华台北”，需事先请示外交部和国台办。\n\n67、台湾地区在 WTO 中的名称为“台湾、澎湖、金门、马祖单独关税区”（简称“中国台北单独关税区”）。2008 年以来经我安排允许台湾参与的国际组织，如世界卫生大会、国际民航组织公约大会，可根据双方约定称台湾代表团为“中华台北” 。\n\n68、海峡两岸交流活动应称“海峡两岸XX活动”。台湾与港澳并列时应称“港澳台地区”或“台港澳地区”。对海峡两岸和港澳共同举办的交流活动，不得出现“中、港、台”“中、澳、台”“中、港、澳、台”之类的表述，应称为“海峡两岸暨香港”“海峡两岸暨澳门”“海峡两岸暨香港、澳门”。不使用“两岸三（四）地”的提法。\n\n69、台商在祖国大陆投资，不得称“中外合资”“中台合资”，可称“沪台合资”“桂台合资”等。对来投资的台商可称“台方”，不能称“外方”;与此相对应，我有关省、区、市，不能称“中方”，可称“闽方”“沪方”等。\n\n70、台湾是中国的一个省，但考虑到台湾同胞的心理感受，现在一般不称“台湾省”，多用“台湾地区”或“台湾”。\n\n71、具有“台独”性质的政治术语应加引号，如“台独”“台湾独立”“台湾地位未定”“台湾住民自决”“台湾主权独立”“去中国化”“法理台独”“太阳花学运”等。\n\n72、对台湾教育文化领域“去中国化”的政治术语，应结合上下文意思及语境区别处理。如“本土”“主体意识”等，如语意上指与祖国分离、对立的含义应加引号。\n\n73、荷兰、日本对台湾的侵占和殖民统治不得简称为“荷治”“日治”。不得将我中央历代政府对台湾的治理与荷兰、日本对台湾的侵占和殖民统治等同。\n\n74、涉及到台湾同胞不能称“全民”“公民”，可称“台湾民众”“台湾人民”“台湾同胞”。\n\n75、不涉及台湾时我不得自称中国为“大陆”，也不使用“中国大陆”的提法，只有相对于台湾方面时方可使用。如不得使用“大陆改革开放”“大陆流行歌曲排行榜”之类的提法，而应使用“我国（或中国）改革开放”“我国（或中囯）流行歌曲排行榜”等提法。\n\n76、不得自称中华人民共和国政府为“大陆政府”，也不得在中央政府所属机构前冠以“大陆”，如“大陆国家文物局”，不要把全国统计数字称为“大陆统计数字”。涉及全国重要统计数字时，如未包括台湾统计数字，应在全国统计数字之后加括号注明“未包括台湾省”。\n\n77、一般不用“解放前（后）”或“新中国成立前（后）”提法，用“中华人民共和国成立前（后）”或“一九四九年前（后）”提法。\n\n78、中央领导同志涉台活动，要根据场合使用不同的称谓，如在政党交流中，多只使用党职。\n\n79、中台办的全称为“中共中央台湾工作办公室”，国台办的全称为“国务院台湾事务办公室”，可简称“中央台办（中台办）”“国务院台办（国台办）”，要注意其在不同场合的不同称谓和使用，如在两岸政党交流中，多用“中央台办（中台办）”。\n\n80、“海峡两岸关系协会”简称为“海协会”，不加“大陆”；“台湾海峡交流基金会”可简称为“海基会”或“台湾海基会”。海协会领导人称“会长”，海基会领导人称“董事长”。两个机构可合并简称为“两会”或“两岸两会”。不称两会为“白手套”。\n\n81、国台办与台湾陆委会联系沟通机制，是双方两岸事务主管部门的对话平台，不得称为“官方接触”。这一机制，也不扩及两岸其他业务主管部门。\n\n82、对“九二共识”，不使用台湾方面“九二共识、一中各表”的说法。一个中国原则、一个中国政策、一个中国框架不加引号，“一国两制”加引号。\n\n83、台胞经日本、美国等国家往返大陆和台湾，不能称“经第三国回大陆”或“经第三国回台湾”，应称“经其他国家”或“经XX国家回大陆(或台湾)”。\n\n84、不得将台湾民众日常使用的汉语方言闽南话称为“台语”，各类出版物、各类场所不得使用或出现“台语”字样，如对台湾歌星不能简单称为“台语”歌星，可称为“台湾闽南语”歌星，确实无法回避时应加引号。涉及台湾所谓“国语”无法回避时应加引号，涉及两岸语言交流时应使用“两岸汉语”，不称“两岸华语”。\n\n85、对台湾少数民族不称“原住民”，可统称为台湾少数民族或称具体的名称，如“阿美人”“泰雅人”。在国家正式文件中仍称高山族。\n\n86、对台湾方面所谓“小三通”一词，使用时须加引号，或称“福建沿海与金门、马祖地区直接往来”。\n\n87、对南沙群岛不得称为“斯普拉特利群岛”。\n\n88、钓鱼岛不得称为“尖阁群岛”。\n\n89、严禁将新疆称为“东突厥斯坦”，在涉及新疆分裂势力时，不使用“疆独”“维独”。\n\n90、有的囯际组织的成员中，既包括一些国家也包括一些地区。在涉及此类国际组织时，不得使用“成员囯”，而应使用“成员”或“成员方”，如不能使用“世界贸易组织成员国”“亚太经合组织成员国”，而应使用“世界贸易组织成员”“世界贸易组织成员方”“亚太经合组织成员(members)”“亚太经合组织成员经济体(member economies)”。应使用“亚太经合组织领导人非正式会议”，不应使用“亚太经合组织峰会”。台方在亚太经合组织中的英文称谓为 Chinese Taipei，中文译法要慎用，我称“中国台北”，台方称“中华台北”，不得称“中国台湾”或“台湾”。\n\n91、不得使用“北朝鲜（英文 North Korea ）”来称呼“朝鲜民主主义人民共和国”，可直接使用简称“朝鲜”。英文应使用“theDemocratic People's Republic of Korea”或使用缩写“DPRK\" 。\n\n92、不使用“穆斯林国家”或“穆斯林世界”，可用“伊斯兰国家”或“伊斯兰世界”。但充分尊重有关国家自己的界定，如印尼不将自己称为“伊斯兰国家”。\n\n93、在达尔富尔报道中不使用“阿拉伯民兵”，而应使用“民兵武装”或“部族武装”。\n\n96、公开报道不要使用“伊斯兰原教旨主义”“伊斯兰原教旨主义者”等说法，可用“宗教激进主义（激进派、激进组织）”替代。如回避不了而必须使用时，可使用“伊斯兰激进组织（成员）”，但不要用“激进伊斯兰组织（成员）”。\n\n97、在涉及阿拉伯和中东等的报道中，不要使用“十字军（东征）”等说法。\n\n98、对国际战争中双方战斗人员死亡的报道，不使用“击毙”“被击毙”等词汇，也不使用“牺牲”等词汇，可使用“打死”等词汇。\n\n99、不要将哈马斯称为恐怖组织或极端组织。\n\n100、一般情况下不使用“前苏联\"，而使用“苏联”。\n\n101、应使用“乌克兰东部民间武装”不使用“乌克兰亲俄武装”“乌克兰民兵武装”“乌克兰分裂分子”等。\n\n102、不使用“一带一路”战略的提法，而使用“一带一路”倡议。",
			"added": 1583230175,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"9_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	},
	"next_comment_id": 24,
	"comment": {
		"8_1DzpF7398yNGjFwHQqHAu9fRkbE3WZ6dZA": [
			{
				"comment_id": 1,
				"body": ">全国彻底物理断网，切断所有外网连接。\n代价其实比这个小。单向信息传输的图文电视系统了解一下（就是90年代末到00年代初流行的“股票卡”），全面关闭互联网（含国内网）信息上传功能就可以了，把互联网改造成“先进数字图文电视系统”。",
				"added": 1582800968
			}
		],
		"21_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": ">希特勒大搞阅兵，柏林大兴土木，军队大搞研发，结果一样被灭\n纳粹德国灭亡是其政治，军事，经济上一系列问题导致的，不是一个简单的“大兴土木”或者更大而泛之的“反人类事业”“邪恶事业”这么个标签导致的。\n\n以简单贴标签的方式认识历史，和“你看，我就说他要遭报应，现在显灵了吧”没有任何本质上的区别。",
				"added": 1583029877
			}
		],
		"3_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 3,
				"body": ">我最近发现， 是不是tracker都被ban了， 零网也要翻墙才能连上了？\n在找到第一批节点之后ZeroNet会不断地寻找新的tracker，如果一直开着的话，大多数时间都可以找到可用tracker",
				"added": 1583129990
			}
		],
		"4_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": [
			{
				"comment_id": 4,
				"body": ">没错，朝鲜和中日韩三国这么近，却一个新冠确诊都没有，就是因为他们掌握了核心技术啊！\n朝鲜曾经发现了一例，但发现的病患被立刻枪毙了。",
				"added": 1583329179
			}
		],
		"1_1BweXpLLykrbTVcjgEBM4VE5h6vqitKrMi": [
			{
				"comment_id": 5,
				"body": "> [ttup](#comment_6_1BweXpLLykrbTVcjgEBM4VE5h6vqitKrMi): 让新人只能看到置顶贴，3天后才允许看其他帖子\n\nZeronet提供这种管理功能吗",
				"added": 1584009799
			}
		],
		"19_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9": [
			{
				"comment_id": 6,
				"body": "> [gonggong](#comment_106_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5): 什么智障玩意，有本事和我这个逆向工程师拿汇编装比啊？\n\n写VHDL的怕是会投来不屑的眼光",
				"added": 1584244369
			}
		],
		"7_159WoHVCiWnZNsoAoP5y7SxCnXgAd29ANC": [
			{
				"comment_id": 7,
				"body": ">有可能，俄罗斯就实验过物理断网，切断了所有通往国际的连接，而且成功了\n不必完全物理断网，只要全国运营商关闭网络数据上传功能，只可下载，不可上传，ZeroNet就无法使用了。",
				"added": 1587821832
			},
			{
				"comment_id": 10,
				"body": "> 这是没搞懂计算机网络.单工的网络,就是像电视广播那样的了,不止零网不能用,100%的网站都没法用,你请求网站数据本身也是一种上传\n确实，如果完全禁止上传，整个网络就没法工作了。\n但是针对上传的封锁仍然是可以进行的，以HTTP协议为例，分为GET和POST两种，如果POST协议被封锁，那么各种文件，图形，音视频等大数据量的内容都无法上传了。\n如果试图用GET协议少量多次传数据，还可以采取上传白名单制度，只准向特定网站上传数据，只能上传指定内容和数据量。现在国内网站备案已经开始区分交互式网站与非交互式网站，要限定上传地址和上传数据是有可能的。",
				"added": 1588157528
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 8,
				"body": "民主兴，中国亡。\n这话听起来似乎很反常，但是共产党在过去的近一个世纪里，已经摧毁了全体中国人的民族认同，民族文化，民族精神传承和社会体系，并以一种围绕着共产党的方式把这些重新建造了起来。中国文化已经成为共产党的文化。\n如果共产党垮台，中国和中华民族必将在民族认同瓦解的基础上分崩离析，每一个分崩离析的部分的思想意识形态都会和“港独”“台独”一样，“中国已经亡了，现在我们是“北京/上海/xxx 帝国/共和国/联邦”。整个中国就此陷入藩镇割据，烽火连天的战争时代。",
				"added": 1587822462
			}
		],
		"340_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 9,
				"body": "宗教不过是人类在认识到洗脑的意义，过程和方法之前就存在的一种自然发生的洗脑形式罢了。\n但这不意味着宗教灭亡了，人类就能得到“自由”或者“绝对理性”。相反地，人类能得到的将是有组织，有目标，成体系的社会化洗脑，比如奶头乐和伟大的金同志。",
				"added": 1587822766
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 11,
				"body": "> 非暴力抗争是必须的\n非暴力不合作注定被血洗，但又不可能得到足够的武装力量去正面抗争。个人观点，唯一的出路是恐怖主义化发展，成为类似东突厥斯坦和圣战组织的群体，反恐反恐，越反越恐，成为一个真正的老大难问题，才有可能把对方逼到和解的路上。",
				"added": 1592111293
			}
		],
		"6_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": [
			{
				"comment_id": 12,
				"body": "只是你的梯子不好用而已吧。最近没有留意到任何问题。",
				"added": 1592649883
			}
		],
		"460_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 13,
				"body": "“一个元首，一个民族，一个帝国”。",
				"added": 1593835771
			}
		],
		"2_1MNQpA7jFonxychu3au8HphC5G7wJ9jRF1": [
			{
				"comment_id": 14,
				"body": "不太可能。社会主义政体存在，必须否认人权存在（而非支持或不支持）。如果承认人权，那么事实上就承认了允许推翻共产党，因为所谓的人权往往包含“有推翻暴政的自由”。如果开始搞多党制，那么参考苏联是怎么解体的。",
				"added": 1595127265
			}
		],
		"1_14YRXkBPNptU6pRRyLSmWosLLNiiKvy9Kv": [
			{
				"comment_id": 15,
				"body": "UEFI的全面普及意味着IBM PC/AT标准的终结。",
				"added": 1614493380
			}
		],
		"6_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm": [
			{
				"comment_id": 16,
				"body": "除非语义级互联网审查系统能够普及，否则互联网管制不会开放。",
				"added": 1614856691
			}
		],
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 17,
				"body": "谁能控制信息，谁就能控制意识；谁能绝对控制信息，谁就能控制时空。",
				"added": 1617597137
			}
		],
		"7_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 18,
				"body": "感觉Matrix更类似于互联网版的《飞鸽传书》，只是能自定义服务器而已，一旦服务器栽了就麻烦了。",
				"added": 1617932605
			}
		],
		"6_13XxUnL4WgmyNhfmUqtVVfe15hyrV4qDpe": [
			{
				"comment_id": 19,
				"body": "所以我根本就不相信通用教育的价值和意义。",
				"added": 1620346590
			}
		],
		"1_13WLQiV9Ks42dKQgaJrCJSgPpBVx64AezT": [
			{
				"comment_id": 20,
				"body": "谁能控制信息，谁就能控制意识。",
				"added": 1620346626
			}
		],
		"21_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": [
			{
				"comment_id": 21,
				"body": "想活捉这位可真没那么容易。",
				"added": 1631166920
			}
		],
		"17_13XxUnL4WgmyNhfmUqtVVfe15hyrV4qDpe": [
			{
				"comment_id": 22,
				"body": "“监护管理 Nintendo Switch专用”微信小程序（下文简称“小程序”）是一款方便家长或监护人管理孩子合理游戏时间的工具。近日小程序已经完成更新，更新后绑定用户将根据国家新闻出版署《关于进一步严格管理 切实防止未成年人沉迷网络游戏的通知》中的相关要求默认设置。请家长或监护人在小程序中进行绑定后使用和设置。",
				"added": 1631520411
			}
		],
		"18_13XxUnL4WgmyNhfmUqtVVfe15hyrV4qDpe": [
			{
				"comment_id": 23,
				"body": "不可证伪的东西不科学。",
				"added": 1632561335
			}
		]
	},
	"comment_vote": {
		"126_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"15_19j1obcsYihhYGVrEqerD8zuataig8TTQP": 1,
		"6_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": 1,
		"1_1MbDVGa5sCS3HH5PDZZhndTvDgm1QwWsmv": 1,
		"15_1ARf4SpYy1bTHXDAEyXVmEbxrcvVreUaNF": 1,
		"39_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1
	}
}