{
	"posts": [
		{
			"id": "caca938e-6d7b-445f-8749-1aec91dbf943",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"thread": "7f0ebb7e-a8da-4efd-a75c-517ea00a4817",
			"body": "Testing",
			"time": 1572933190076,
			"files": "[]",
			"last_edited": 1572933197268,
			"subject": null,
			"capcode": null
		},
		{
			"id": "39d6631f-c7d4-487a-bc32-a1abd53fa4be",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dbf6440-5412-43f2-9d03-5bf2643479eb",
			"body": ">>4dbf6440-5412-43f2-9d03-5bf2643479eb\nVpn and/or Tor is usually sufficient. You won't get caught in as long as you are browsing in your home and don't leave your computer on.\n\nBut if you want to go the extra mile, you can either use a virtual machine and configure it either Whonix(linux based) or Prime/Bliss OS(Android) . Since Whonix is Linux, it should work with the latest version of Zeronet. In addition to routing the traffic through Tor, for added security you can use Open VPN to route the said traffic through an additional layer from your vpn provider or another one. \n\nWith Bliss or Prime OS, they are android environments that you are aware of and easier to navigate then Whonix. They can either be installed on a virtual machine or in a partition in your computer as an OS. You can install one of them, then download Zeronet and either Tor/Firefox/Brave from APKpure. If using the OS for this purpose do NOT connect your Google Play account to Bliss or Prime if used for this purpose. You can also run a VPN on the android VM even if you are already running one in the background.",
			"time": 1573025736952,
			"files": "[]",
			"last_edited": 1573025982152,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2724469b-6a0d-4d11-a8fc-b63ceb62c136",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dbf6440-5412-43f2-9d03-5bf2643479eb",
			"body": ">>4dbf6440-5412-43f2-9d03-5bf2643479eb\nAnother OS I forgot to mention is Tails, unlike Whonix or the android ones, TailsOS is an amnesic OS loads on your Ram instead of your Hardrive. No files are left behind your system, it already comes with OpenVPN and Tor, and runs from a CD or USB, however, while it is a linux environment, I'm not sure if its compatible with Zeronet. Have to do some testing myself.",
			"time": 1573026222252,
			"files": "[]",
			"last_edited": 1573026390952,
			"subject": null,
			"capcode": null
		},
		{
			"id": "a8123d75-cc5a-47ed-b9ea-07bb95f2a22a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dbf6440-5412-43f2-9d03-5bf2643479eb",
			"body": "Zeronet has comparability issues with Tails to be expected since its amnesic and you can't seed under that environment.\n\nSurprisingly works with Nox Android Emulator will post screens later but gotta configure it to ensure all the spyware and bloatware is disabled. There's a page on that with a video here \n\nhttps://diy-techinsight.com/2018/06/30/disable-adware-and-spyware-on-nox-player-android-emulator/\n\nNox Emulator\nhttps://www.bignox.com/\n\nOnce you block/remove the spyware, you can use Nox for whatever you want, or just stick with using Tor+Zeronet+Vpn combo.",
			"time": 1573030093800,
			"files": "[]",
			"last_edited": 1573030478500,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}