{"cert_user_id": "sim590@github", "next_comment_id": 4, "comment": {"1604064810_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "Hi,\r\n\r\nI propose to you to consider using [OpenDHT][]. It has the following features:\r\n\r\n- C++11 (maybe C++14 somewhat soon);\r\n- [Python bindings][pybinds];\r\n- IPv4 and IPv6 support;\r\n- Nice crypto layer for handling encrypted blobs and signatures;\r\n- Transition from 160-bits SHA1 hashes to 256-bits hashes is in progress;\r\n- TCP support is work in progress (@aberaud may comment on the status);\r\n- Distributed indexing: it literally permits to do searches on complex queries rather than exact key lookups. This is based on [PHT][] data structure although we have added substantial changes to support *Fully distributed indexing* which are documented into an article to be presented at [UNet2017][]. **This is more than relevant for this project**. You can compare this to providing Google search features on ZeroNet;\r\n- It is actively used by the software called [Ring][] which is driven to deliver distributed and secure p2p communications to its users. More people use the same DHT, more the apps based on it will behave well.\r\n\r\nI personally would like more projects to join like [Syncthing][].\r\n\r\n[pybinds]: https://github.com/savoirfairelinux/opendht/tree/master/python\r\n[OpenDHT]: https://github.com/savoirfairelinux/opendht/\r\n[PHT]: https://people.eecs.berkeley.edu/~sylvia/papers/pht.pdf\r\n[UNet2017]: http://www.unet-conf.org/\r\n[Ring]: https://ring.cx\r\n[Syncthing]: https://github.com/syncthing/syncthing/issues/3388\r\n\r\n", "added": 1492781015, "modified": 1492781257, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/57#issuecomment-296237289", "source_type": "github"}, {"comment_id": 2, "body": "@HulaHoopWhonix The thing with relay servers, is that you still have a form of centralization: indexation system of IP addresses. If the indexation system is put down, you cannot query the list of IP addresses. Even worst: censorship, mitm and all centralized scheme attacks are possible. When using DHT, a new routing protocol emerges on top of the IP network which is (really) hard to take down and attack once you have passed a certain point in the number of nodes. After you have resolved the hash query, you can exchange with your peer through DHT `put` and `get` operations to go on with hole punching.\r\n\r\nHowever, what you speak of makes me think that [onion services][onion] may be a good fit for syncthing's use case. Each device could host an onion service in the tor network when it's online so that it can exchange ip address with each other. I'm throwing that idea out there, but I don't know a lot about the onion service design... Also, it seems funny to use an anonymizing network to exchange IP address. May be syncthing could even run directly on tor, but I digress from the original subject.\r\n\r\n[onion]: https://www.torproject.org/docs/onion-services.html.en\r\n\r\n", "added": 1519758376, "modified": 1519758376, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/57#issuecomment-369043577", "source_type": "github"}, {"comment_id": 3, "body": "> Any network, including DHT and P2P ones will rely on bootstrap nodes to help them reach the wider network.\r\n\r\nYes. However, listing relays on a centralized machine, contrary to using a DHT, doesn't scale.\r\n\r\n> DHT can never be used over Tor\r\n\r\nI didn't say that. However, I assumed the opposite. In fact, [onion services use DHT][tor-dht].\r\n\r\n> that's why a commonly emerging solution in the Tox project and Syncthing is to rely on some form of federated relays.\r\n\r\nAs I acknowledged above, bootstrap nodes are needed at first, but you don't need to solely rely on fixed relays over time. Once you're connected to the network, to a DHT for example, you save that list of ip addresses you have contacted, you don't rely on the centralized ip address list and you continuously learn about new nodes through the protocol itself, hence the scaling capability. Opting for centralized relay indexation system implies lacking of scale or reinventing the wheel, like the DHT that is. I'm sure that you know that.\r\n\r\n> While Tor support in the form of ephemeral services using Txtorcon are a neat addition it still doesn't solve the problem of a Tor user interoperating with the outside zeronet network that runs on on the clearnet. Unless Tor use is enforced by default, you will end up with a fragmented network.\r\n\r\nExcuse me. I recognize(d) that I digressed from the subject in the last paragraph of my last [post][digression]. I was not speaking of a solution for ZeroNet.\r\n\r\n> You realize that onions don't have IPs?\r\n\r\nWhat exacly do you imply? Please, can you avoid making sentences in the form of \"You realize that [place some supposed well-known fact here]?\" They're not clear and tend to be taken with offense.\r\n\r\nI think I understand what's the concern here. You're thinking that I'm speaking of onion services for ZeroNet, but I'm not. I'm speaking about the case of Syncthing. Onion services are resolved with a [distributed hash table lookup][tor-dht] if that's what you meant by your sentense above. What I meant is that Syncthing devices could use onion services to exchange their ip address like you'd do in a distributed hash table, except that they'd do it through the tor network in addition to looking up the DHT. That may not be adequate indeed after a second thought. A DHT is sufficient, I guess.\r\n\r\nI think that we should avoid continuing to speak about Syncthing now as it is not the concern of this issue.\r\n\r\n[digression]: https://github.com/HelloZeroNet/ZeroNet/issues/57#issuecomment-369043577\r\n[tor-dht]: https://www.torproject.org/docs/onion-services.html.en\r\n", "added": 1519839270, "modified": 1519839270, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/57#issuecomment-369373576", "source_type": "github"}]}}