{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": 1,
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": [
			{
				"comment_id": 1,
				"body": "Najó, történjen itt valami! Ezért én most leírom röviden az álláspontomat.\n\n**Először kicsit magamról.** _(nyugodtan át lehet ugrani :) )_\n19 éves vagyok, néhány 2018 dec.-i tüntetésen ott voltam, a többin pedig csak szívvel vettem részt. Személyes \"kedvencem\" a Momentum, tehát ahol tehetem az ő színükben vállalom véleményem / ő rájuk szavaztam listásan, amúgy körzetiben a taktikaiszavazas.hu -nak megfelelően a helyi legerősebbre, a DK-ra szavaztam.\n\nA legtöbbször a Fidesz melletti érvként azt hallom, hogy \"a többiek már bizonyították hogy megbízhatatlanok\" (az újak pedig még nem, hogy megbízhatóak), ellenben a Fidesz - annak ellenére, hogy csinál pár hülyeséget (pl. sorosozás, Nemzeti Konzultáció) - többnyire megbízható (\"Jó irányba tolja az ország szekerét\"). Ami igaz is a gazdasági mutatók alapján (és nem csak a rezsicsökkentést reklámozó füzetkékre alapozok).\n\nÉn most leszögezném, hogy korrupció volt, van és lesz.\n\nAzonban a negyedik Orbán-kormány idején szintén 2/3-dal bármit megtehet, és - ha a döntések frakción belül egyeztetésre kerülnek - más párt (azaz más érdeket képviselő csoport) kizárólag a házszabály-módosításokat vétózhatja meg, teljes összefogással is (lásd a túlóratörvény elfogadása). Ezáltal az átláthatóság megszűnik.\nErre a megoldást pl. a frakcióülésekről szóló közvetítések jelentenék, illetve nekem hiányzik hogy az egyes lépések mögött valamilyen indoklás álljon. Ez természetesen nem kötelező, de legalább megnyernék így azok szimpátiáját is, akik szerint csak a butítás megy (pl. én).\n\nA másik, klasszikus aggály, amit ez felvet, hogy a baloldaliak nem tudnak szóhoz jutni így emellett a (Wiki szerint konzervatív) szélsőjobb oldali párt mellett. Természetesen nekem ez sem tetszik, de ez már tényleg a demokrácia szükséges rossza, a nép akarata :)\n\nEgyes ügyek népszavazásra bocsájtása hosszú és bonyodalmas, jelenleg több kísérlet folyik egyes ügyek ily módon való tárgyalás elé állítására. Az szomorú, hogy alternatív útnak a tüntetés alapján történő kormányváltás maradt.\n\n​\n\nSzívesen várom észrevételeiteket, hogy ebből ti mivel nem értetetek egyet, illetve mivel tudnátok kiegészíteni, esetleg ha valakinek új gondolata van, az is kommentelhet!\nIlletve természetesen szabad a többi bejegyzést is átfutni ;)\n\n​\n\n_PS.: Kicsit hosszúra sikerült ez az agymenésem, később (lehet, hogy) visszanézek és megszerkesztem._",
				"added": 1546457437
			},
			{
				"comment_id": 2,
				"body": "> [toma](#comment_1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB): Szerintetek a Fidesz alt-right?\n\nJól hangzik, hogy a Fidesz alt-jobb, de szerintem határozottan nem az. A céljai világosak (gazdasági stabilitás), és megküzdött a jelenlegi hatalmáért (1988-ban (ha nem előtte) kezdték), tehát van tapasztalatuk.",
				"added": 1546457800
			},
			{
				"comment_id": 3,
				"body": "Van itt még rajtam kívül valaki, aki viszonylag komolyan gondolja? 😂🤔",
				"added": 1546457993
			}
		],
		"1_1N1bEAsjdqCy5f7SG6jPXUoa1BA2QES8DZ": [
			{
				"comment_id": 4,
				"body": "Én nekem működik (Nexus 5X, Android P), azonban marha lassú (i. e. megeszi az összes RAM-ot), és bonyolultabb oldalak betöltésekor (pl. globális ZeroTalk) bezárul, szóval használhatatlan.",
				"added": 1547239571
			}
		],
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 5,
				"body": "Nagyon jó ötlet ennek a ZeroNettel való megvalósítása. Van erre angol nyelvű thread illetve talált valaki?\n\nA programban valószínűleg nem csak a magyarok érdekeltek, így azt érdemes lenne nemzetközileg fejleszteni.",
				"added": 1552801491
			},
			{
				"comment_id": 6,
				"body": "Szerintem ha ez a projekt előmozdul, ~nem~_kevésbé_ lenne szükség bábokra. A rendszer sokkal átláthatóbb és, ahogyan OPban is olvasható, a rendszer olcsóbban fenntartható. Végeredményben talán nagyobb a társadalmi mobilitás.\n\nAzonban több okból kifolyólag ez nehezen lenne kivitelezhető. A tökéletes demokrácia megvalósításához elsősorban okos polgárok kellenek (tehát jelenleg is lehetne sokkal előrébb az ország), másrészt egy új, teljesen digitális rendszer bevezetése rengeteg képzést kéne hogy maga után vonjon.\n\nPéldául van a Kréta, amit most minden iskolában kötelezővé tettek. A választás ezért erre a szoftverre esett, mert a Kréta volt az egyetlen kompetens pályázat. A szoftver egyébként valóban nagyon hasznos lenne, de a tanárok fele nem tudja illetve nem akarja kezelni.",
				"added": 1553763997
			}
		]
	},
	"comment_vote": {
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": 1,
		"1_17ZVAxJdsXnLoRdMMAjggTnuRLKFGxs4to": 1,
		"19_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1
	}
}