{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1610168765,
			"title": "Reminder they nuked Parler for the simple fact that Donald Trump signed up",
			"body": "10:30pm: The president is on Twitter were we can correct the record on everything he posts. There is this thing called Parler on Google Play that is perfectly fine.\n10:31pm: The president is on Parler. Parler is absolutely unacceptable.\n\nHe didn't even post anything on it lol. Don't call it a grave, this is the future you chose.",
			"added": 1610168764
		}
	],
	"topic_vote": {
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": 1,
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 1,
				"body": "The last time 8chan got nuked a few years ago a lot of people went to an imageboard thing called 0chan or nullchan. I forgot zeronet after a few days until now. What is the imageboard all the cool kids are using now? thanks.",
				"added": 1610156491
			},
			{
				"comment_id": 2,
				"body": "> [sirlotaplot](#comment_28_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): ZeroNet's ideal use-case is splintered communities and personal blogs. Many of the bigger sites like MillChan, 08Chan, 0chan, nullchan, zerovoat etc. run into performance problems when there's plenty of users. [...]\n\nIs that supposed to be mitigated as more users join the network or does zeronet just not scale?",
				"added": 1610156569
			},
			{
				"comment_id": 5,
				"body": "> [sirlotaplot](#comment_29_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): ZeroNet itself scales, sites with limited user interaction also scale, but I 8chan on ZeroNet at the scale 8chan was will never be a thing. ZeroNet offer site owners the option of cleaning stale content, but most site owners disable it. With that enabled you wouldn't be able to browse old threads intact, but it would scale much better with user interaction.\n\nI see. thanks for the info",
				"added": 1610156922
			},
			{
				"comment_id": 6,
				"body": "> [sirlotaplot](#comment_30_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): 4chan style with threads being gone after a while is a much better format for ZeroNet, but the chan devs on here used the 8chan style instead, probably because of the user influx from there\n\nand the threads on here disappear quickly too?",
				"added": 1610157136
			},
			{
				"comment_id": 7,
				"body": "> [sirlotaplot](#comment_32_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): zerotalk only has text so it's a lot simpler, I think it has a cleanup cycle of a year or two for removal but I don't know where to check,  I'll leave it to someone else to answer\n\nhonestly just text is plenty for a good forum. but people just -have- to have their pay pays.",
				"added": 1610157795
			},
			{
				"comment_id": 10,
				"body": "> [sirlotaplot](#comment_33_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): watcha doing there, glowie?http://localhost:43110/0chan.bit is the real link, don't trust any exit links (links going to other addresses than http://localhost:43110 or http://127.0.0.1:43110)\n\nThanks. Too bad it seems to be dead, last post from almost an hour ago. A slow imageboard is no fun at all.",
				"added": 1610158195
			},
			{
				"comment_id": 14,
				"body": "> [18ah](#comment_8_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP): ISP, CDN, DNS and payment processors next though\nYep, that's what they do when they want something gone. Won't take very long now.",
				"added": 1610167773
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "> [goodusername](#comment_1_112NAM5jhYWH4egafracJEF92oyeUY3F3T): test\n\ndid it work?",
				"added": 1610156717
			}
		],
		"1603637541_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 4,
				"body": "and what am I supposed to do with that?",
				"added": 1610156837
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "for good this time? I feel like I've read he was banned at least half a dozen times this week.\npost sauce",
				"added": 1610158024
			},
			{
				"comment_id": 9,
				"body": "> [driud](#comment_197_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Let it stay where it is; Anyway, they will change the internet with Japan.The new internet is supposed to better control everyone.\n\nWhat are you on about japan?",
				"added": 1610158104
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 11,
				"body": "Why would the world elites bother with this theater to sterilize people? The birth rates in the vast majority of the western world have already been far below replacement for a very long time now. The modern lifestyle and sensibilities have already caused people to sterilize themselves in body and mind. Can any conspiratard explain this to me please?",
				"added": 1610158364
			}
		],
		"1610164924_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 12,
				"body": "no one I know cares about digital privacy.\nI haven't bothered telling anyone I know about zeronet because it is pointless.",
				"added": 1610167050
			},
			{
				"comment_id": 13,
				"body": "I think the best thing for wide adoption would be to create a dedicated zeronet browser, just like there is a zeronet browser. This browser could come with all of the optimal configurations and use tor by default. It would also ban any clearnet links and only recognize .bit addresses.",
				"added": 1610167356
			},
			{
				"comment_id": 16,
				"body": "> [deuxzaron](#comment_30_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): If it's using tor anyways why would clearnet links be a problem?\n\nI suppose it wouldn't necessarily be a problem for privacy. What I mean to express is that when you type \"talk.zeronetwork.bit\" in the address bar of this imaginary browser it should take you to the zeronet address instead of looking up the clear net .bit DNS. This localhost:43110 thing is a hassle.",
				"added": 1610168078
			},
			{
				"comment_id": 17,
				"body": "> [18ah](#comment_7_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP): only been able to get people to stop using big tech for private messaging\n\nThis by itself is a huge win. You can delete instagram and facebook and still live a normal life, but if you are without the IM app everyone uses you might as well not exist. I dream of a day when I can get rid of WhatsApp, but while it means not being able to talk to literally anyone (in Brazil no one uses anything else) it is simply not possible. SMS was actually a pretty good standard, just add end to end encryption and you have yourself a very privacy respecting way of communicating, but it doesn't handle images and videos well which is how whatsapp and similar services hot all of the normies to sign up in droves.",
				"added": 1610168308
			}
		],
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 15,
				"body": "The real red pill you need to swallow is that \"free speech\" was never a thing in human history. If you \"speak your mind\" you are and have always been at risk of being hurt by government or mob (is there a difference?). It is only through technology like tor and zeronet that for the very first time we have a shot at a truly free flow of information.",
				"added": 1610167919
			}
		],
		"1610169002_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 18,
				"body": "Liberals are not used to having the rules enforced on them when they call for violence and death. They are only used to having carte blanche to do whatever on Twitter.",
				"added": 1610168898
			}
		],
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 19,
				"body": ">Maybe have a ZeroNet addon that automatically stops seeding content that is highly likely to be CP.\n\nYou are already introducing the possibility of a centralized authority to abuse this system and block things arbitrarily. The very definition of CP is contentious. Look, no one likes that children are trafficked and abused to produce content for sickos to watch, but either streams of bytes on the internet are free flowing or there is censorship, no middle way about that. Maybe the interpol faggots can get busy and actually make more effort to catch the people that produce the stuff instead of arresting random people that probably ought to be in some kind of mental therapy ward for having zeroes and ones in their hard drive arranged in a distasteful order.",
				"added": 1610169152
			},
			{
				"comment_id": 20,
				"body": "> @quantumkitty And so by limiting the distribution of CP, you're also protecting users themselves from potential jail time.\nI see were you are coming from, but I still think using tor and purging your cache regularly is the best way to solve this problem.\n\n> Would you allow viruses and malware to spread on your zite?\nI certainly wouldn't empower a central authority to remove files arbitrarily under the pretense of them being viruses.",
				"added": 1610170447
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 21,
				"body": "I hope interpol finds you and sends you to Guantanamo bay, sicko.",
				"added": 1610287109
			}
		],
		"1610637299_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 22,
				"body": "tox leeks you're aye pee",
				"added": 1610728789
			}
		]
	},
	"comment_vote": {
		"1_1Q1XaWRtj7SGymmyrop2PSmM35kHckmHjf": 1,
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1
	}
}