{
	"next_post_id": 15,
	"next_comment_id": 36,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Hikkiaut",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "❤️ hikki & autist ❤️\n\"male\"",
	"post": [
		{
			"post_id": 1,
			"date_added": 1549892539,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1549893558,
			"body": "Hello! I am hikki and autistic.\nI have no education and work, and I live with my parents.\nMy life is just hell and I have no future!\n\nEvery day I dream only about suicide.\n\n\nВсем привет! Я хикки и аутист.\nУ меня нет образования и работы, и я живу с родителями.\nМоя жизнь просто ад и у меня нет будущего!\n\nКаждый день я мечтаю только о суициде.",
			"date_added": 1549893556
		},
		{
			"post_id": 1549894517,
			"body": "Every day I go through the same cycle.\n\nEvery day I turn on the computer, watch porn, listen to music, play games, I eat and go to the toilet, watch movies, turn off the computer and sleep.\n\nI can never break out of this vicious vicious circle.\n\nMy life is truly awful!\n\n\nMy brain is sick and unable to cope with stress, and I fear people.\nI was born that way. And I can never change.\n\n\nКаждый день я прохожу один и тот же цикл.\n\nКаждый день я включаю компьютер, смотрю порно, слушаю музыку, играю в игры, я ем и хожу в туалет, смотрю фильмы, выключаю компьютер и сплю.\n\nЯ никогда не смогу вырваться из этого порочного замкнутого круга.\n\nМоя жизнь поистине ужасна!\n\n\nМой мозг болен и не справляется со стрессами и я боюсь людей.\nЯ родился таким. И я никогда не смогу измениться.",
			"date_added": 1549894514
		},
		{
			"post_id": 1549895229,
			"body": "I came to the conclusion that my life needs some kind of system.\nAnd without this system, I can not change anything.\n\nThe state turned the wild animals into its slaves using the system.\nTrue, I'm not going to become anyone's slave.\n\nTo begin with, I have to start observing the daily regimen, now I often go to bed in the morning.\nI have to start washing every day and brush my teeth at least once a day.\n\nI have to overcome the craving for food, because it is an addiction. Similarly with laziness.\n\nBut I am not a lazy person at all, the problem is in my brain, I am too inactive, I simply do not have the strength to do anything. I'm stoned.\n\n\nЯ пришёл к выводу, что моей жизни нужна какая-то система.\nИ без этой системы я ничего не смогу изменить.\n\nГосударство превратило диких животных в своих рабов при помощи системы.\nПравда, я не собираюсь становиться чьим-либо рабом.\n\nДля начала, я должен начать соблюдать режим дня, сейчас я часто ложусь утром.\nЯ должен начать мыться каждый день и чистить зубы хотя бы раз в день.\n\nЯ должен побороть тягу к еде, потому что это наркомания. Аналогично с ленью.\n\nНо я вовсе не ленивый человек, проблема в моём мозгу, я слишком малоактивный, у меня просто нет сил что-либо делать. Я пристукнутый.",
			"date_added": 1549895225
		},
		{
			"post_id": 1549966445,
			"body": "It seems my brain produces an insufficient amount of certain hormones.\nBut I cannot constantly go to doctors, give blood for tests, etc. And not only because of my phobias (social phobia, fear of piercing my skin, fear of experiencing pain ...)\nMy veins just disappear after piercing them with a needle. Perhaps this is genetics.\nAnd to be treated (to take hormones), you need to constantly find out the amount of hormones in the blood.\n\nI will try to drink coffee every morning and stop masturbating every day. As far as I understand, this should help me a little.\n\n\nBut the easiest thing is to just die. This will immediately solve all my problems in one moment. Panacea.\n\n\nКажется, мой мозг вырабатывает недостаточное количество некоторых гормонов.\nНо я не могу постоянно ходить по врачам, сдавать кровь на анализы итд. И не только из-за моих фобий (социофобия, страх протыкания моей кожи, страх испытать боль...)\nПросто мои вены исчезают после протыкания их иглой. Возможно, это генетика.\nА чтобы лечиться (принимать гормоны), нужно постоянно узнавать количество гормонов в крови.\n\n\nЯ постараюсь пить кофе каждое утро и перестать мастурбировать каждый день. Насколько я понимаю, это должно мне немного помочь.\n\n\nНо проще всего просто умереть. Это сразу решится все мои проблемы в один момент. Панацея.",
			"date_added": 1549966440
		},
		{
			"post_id": 1550076361,
			"body": "I could never understand what my sexual orientation is and what my gender is.\nI believe that the main cause of this problem is my hormonal disorders, which are caused by my diseased brain.\nAnd my weakness and my fears are to blame. A man must be a strong and fearless warrior.\nBut all this is a consequence of my diseased brain (phobias, powerlessness, sexual identity, ...).\nWho am I?\n\nЯ никогда не мог/ла понять, какая у меня сексуальная ориентация и какой у меня пол.\nЯ считаю, что главная причина данной проблемы - мои гормональные нарушения, которые вызваны моим больным мозгом.\nА ещё виноваты моя слабость и мои страхи. Мужчина должен быть сильным и бесстрашным воином.\nНо всё это следствия моего больного мозга (фобии, бессилие, половая самоидентификация, …).\nКто я?",
			"date_added": 1550076355
		},
		{
			"post_id": 1550104309,
			"body": "#\"Cats infect humans with homosexuality!\"#\n\nPathogen: Unknown to science stealth virus!\n(Proved by Chinese scientists.)",
			"date_added": 1550104302,
			"meta": "{\"img\":\"900,675,bb9eeded9feaec8ca7766555876855434d95c98887ea7b87,01111021112211123300333212204156785414419AA7024B42C7AD1D5E452F664CBE5522CC4EE4F9\"}"
		},
		{
			"post_id": 1550136116,
			"body": "1) Every day I go to bed later for 30 minutes - 1.5 hours.\nAs a result, after 12 days, I go to bed during the day, and wake up at night.\nAnd after about 24 days, this cycle begins again.\nMy day is 25 hours. Apparently, I'm from another planet ...\nBut I doubt that my life is longer by one hour per day. Most likely this mode shortens my life.\n2) I believe that I should install a reminder program with alarms or something.\nI will create my daily routine and this program will remind me that the time has come to do something.\nSelf discipline.\nP.S.\nI wanted to write this program myself, but I can not learn programming languages.\n1) Каждый день я ложусь спать позже на 30 минут - 1,5 часа.\nВ итоге через 12 дней я ложусь днём, а просыпаюсь ночью.\nА примерно через 24 дня этот цикл начинается снова.\nВ моих сутках 25 часов. Видимо, я с другой планеты...\nНо я сомневаюсь, что моя жизнь длиннее на один час в день. Скорее всего такой режим сокращает мою жизнь.\n2) Я считаю, что я должен установить программу-напоминалку с будильниками или нечто такое.\nЯ создам себе распорядок дня и это программа будет напоминать мне, что пришло время что-то делать.\nСамодисциплина.\nP.S.\nЯ хотел написать эту программу сам, но я не могу освоить языки программирования.",
			"date_added": 1550136107,
			"meta": "{\"img\":\"550,700,fffddddbccab745d8aa88523a5699aabc866a67aaa978767,001111000110021003411450023113200267862009ABCCD00A9112A002EECF20005FF50000011000\"}"
		},
		{
			"post_id": 1550241474,
			"body": "I have a lot of tabs in the browser and strong procrastination.\nEvery day I open dozens of new tabs in Firefox Portable.\nEvery day there are new ideas, the implementation of which I leave for the future. But I don’t do anything.\nI can not even read the articles that I liked.\n\nI use one browser until it breaks down or starts to slow down very much (hundreds and thousands of tabs).\nAfter that I send another browser to the archive. I put them in a VeraCrypt container.\nI still hope that someday I will be able at least to structure all this into a single Database.\n\nУ меня очень много вкладок в браузере и сильная прокрастинация.\nЯ каждый день открываю десятки новых вкладок в Firefox Portable.\nКаждый день появляются новые идеи, осуществление которых я оставляю на будущее. Но я так ничего и не делаю.\nДаже не могу прочитать статьи, которые мне понравились.\n\nЯ использую один браузер до тех пор, пока он не ломается или не начинает очень сильно тормозить (сотни и тысячи вкладок).\nПосле этого я отправляю очередной браузер в архив. Я складываю их в VeraCrypt контейнер.\nЯ всё ещё надеюсь, что когда-нибудь я смогу хотя бы структурировать всё это в единую Базу Данных.",
			"date_added": 1550241464,
			"meta": "{\"img\":\"900,497,000111334345446233011223122112234,012334356053553772283227899554223557779AA5977AA7725899A3552A\"}"
		},
		{
			"post_id": 1550249688,
			"body": "For many years I have been recording various things, including my thoughts. And also I save pictures, sites, etc.\nBut almost all of the old information was lost due to dead hard drives. :(\nI was so crying then ... :(\nNow there is a good internet and free cloud storage. It is very good.\n\nBut in my notes and in these stored things there is chaos, there is just a dump, everything is mixed up.\nI also want to structure this information in the form of a single database.\nFor this, there are special automatic programs, programming languages ​​and databases, but all this is so difficult for me, it is simply unreal ... :(\n\nIt’s probably easier to just remove and forget it all.\nBut then I lived in vain all these years and suffered in vain.\n\nМногие годы я записываю различные вещи, в том числе свои мысли. А также я сохраняю картинки, сайты итд.\nНо почти вся старая информация была утеряна из-за умерших жёстких дисков. :(\nЯ так плакал тогда... :(\nСейчас есть хороший интернет и бесплатные облачные хранилища. Это очень хорошо.\n\nНо в моих записях и в этих сохранённых вещах хаос, там просто свалка, всё вперемежку.\nЭту информацию я тоже хочу структурировать и оформить в виде единой Базы Данных.\nДля этого существуют специальные автоматические программы, языки программирования и базы данных, но всё это так сложно для меня, просто нереально... :(\n\nВозможно, проще всё это просто удалить и забыть.\nНо тогда я зря жил все эти годы и зря мучился.",
			"date_added": 1550249677,
			"meta": "{\"img\":\"900,468,000fd7d72952feba73300221e92f81a84432610db7c40e61,00011234250671898ABC6BDEFF3C6CCEEF993CCCCCEECCCCC0\"}"
		},
		{
			"post_id": 1550437434,
			"body": "I did not answer for two days just because I did not have the strength. Sometimes it happens.\nIf I will not be here for a long time, it means that most likely I am no more.",
			"date_added": 1550437422
		},
		{
			"post_id": 1550585223,
			"body": "I, like any autist, have many imaginary inner worlds.\nBut these are not just those imaginary worlds that we all had in childhood. These worlds are much more mature, more adequate, more thoughtful. They are really cool, it's like another real reality, like a movie or a modern computer game.\n\nMostly they are fantastic.\nI am a superhero or supervillain in them or all at once. I have not divided the world into good and evil for a long time.\nIn some, I am a soldier in a war in distant space.\nIn some I build my cosmic empires and create my worlds. Worlds within worlds within worlds ... But this is already an advanced level of schizophrenia ^^\nI do not make myself a god in my worlds ... This is not interesting.\nI create myself not the strongest. I must go through difficulties, I must overcome all enemies. I gradually become stronger, as allies, and as opponents.\nWe appear new superpowers.\nAnd our armies are getting stronger.\nSooner or later I win, or sacrifice myself for a great mission, or just no end.\nBut if the end is reached, I restart the world. I can do this without reaching the end, simply by creating new versions of the beginning.\nAlmost all of my inner worlds are connected with wars and cruelty.\nBut besides violence, there is a place for love.\nIn one of the worlds, I even have my family, I live with a transgender, we have a daughter, we have everything, everyone respects us, we are rich and we have power.\nIn another world, me and my boyfriend are superheroes, and we are entering into an intimate relationship. The remaining allies treat this differently.\n\nEvery night before bedtime, lying in bed, I plunge into my worlds and stay there for several hours until I fall asleep.\nFrom time to time I plunge into them and while i'm awake.\n\nI spent most of my life not in reality, but in my head (\"disconnection from reality\"). I was thinking about different things and almost always this process starts by itself, all this happens usually uncontrollably, and \"automatically.\"\nOften I am precisely in my inner worlds. It helps me cope with depression, stress. There I am not an empty place.\n\nI can not say that I have an ultra-developed imagination. It's not about imagination or creativity.\n\nOf course, this ailment bothers me. I just can't concentrate on anything, but I don't want to poison myself with antipsychotics, and there are other problems as well.\nOn the one hand, it is a disease that prevents me from living, but on the other hand it is a gift.\n\nWithout these worlds and disconnected from reality, I will cease to be myself, it will be a different person.\n\nI want to turn some of these worlds into books.\nBut I do not know how to do it. Not so simple.\n\nУ меня, как и у любого аутиста, много своих воображаемых внутренних миров.\nНо это не просто те воображаемые миры, которые были у всех нас в детстве. Эти миры гораздо взрослее, адекватнее, продуманней. Они реально крутые, это, как другая полноценная реальность, как фильм или современная компьютерная игра.\n\nВ основном они фантастические.\nЯ в них супергерой или суперзлодей или всё сразу. Я уже давно не делю мир на добро и зло.\nВ некоторых, я солдат на войне в далёком космосе.\nВ некоторых я строю свои космические империи и создаю свои миры. Миры внутри миров внутри миров... Но это уже продвинутый уровень шизофрении ^^\nЯ не делаю себя богом в своих мирах... Это не интересно.\nЯ создаю себя не самым сильным. Я должен пройти через трудности, должен одолеть всех врагов. Я постепенно становлюсь сильнее, как и союзники, как и противники.\nУ нас появляются новые суперспособности.\nИ наши армии становятся сильнее.\nРано или поздно я побеждаю, или жертвую собой ради великой миссии, или конца просто нет.\nНо если конец достигнут, я перезапускаю мир. Я могу сделать это и не достигнув конца, просто создавая новые варианты начала.\nПочти все мои внутренние миры связаны с войнами и жестокостью.\nНо кроме насилия, там есть место и для любви.\nВ одном из миров у меня даже есть моя семья, я живу с трансгендером, у нас есть дочь, у нас есть всё, все нас уважают, мы богаты и у нас есть власть.\nВ другом мире, я и мой парень супергерои, и мы вступаем в интимную связь. Остальные союзники относятся к этому по-разному.\n\nКаждый вечер перед сном, лёжа в пастели, я погружаюсь в свои миры и пребываю там несколько часов, пока не засну.\nВремя от времени я погружаюсь в них и пока бодрствую.\n\nБольшую часть своей жизни, я провёл не в реальности, а в своей голове (\"отключение от реальности\"). Я думал я о разных вещах и почти всегда этот процесс запускается сам по себе, всё это происходит обычно неконтролируемо, а \"автоматически\".\nЧасто я нахожусь именно в своих внутренних мирах. Это помогает мне справляться с депрессиями, стрессами. Там я не пустое место.\n\nЯ не могу сказать, что у меня ультрахорошо развито воображение. Дело вовсе не в воображении или творчестве.\n\nКонечно, мне мешает этот недуг. Я просто не могу ни на чём сосредоточиться, но я не хочу отравлять себя нейролептиками, к тому же есть и другие проблемы.\nС одной стороны, это недуг, который мешает мне жить, а с другой стороны это дар.\n\nБез этих миров и отключек от реальности, я перестану быть собой, это будет уже другой человек.\n\nНекоторые из этих миров я хочу превратить в книги.\nНо не знаю, как это сделать. Не всё так просто.",
			"date_added": 1550585210,
			"meta": "{\"img\":\"900,450,57969a89b89a567367677456355bbc345245122222479333,012345664780294AAABCD7E1A7D6DCCDB5E8BAFCCCDDB85AFC\"}"
		},
		{
			"post_id": 1550756239,
			"body": "The translator could not properly translate my post into English.\nThere is quite a lot of text.\nIt makes no sense to blog in English if you do not know it.\n",
			"date_added": 1550756225
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Moor: thanks I know.\nBut my case is hopeless. (спасибо я знаю.\nНо мой случай безнадежен.)",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1549966676
		},
		{
			"comment_id": 2,
			"body": "@sl: пасиб, но я тоже не согласен подчиняться грубой силе государства, которое загоняет меня в жёсктие рамки и делает рабом системе. (Thank you, but I also do not agree to obey the brute force of the state, which drives me into the framework and makes a slave to the system.)",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1549967324
		},
		{
			"comment_id": 3,
			"body": "@leftside: I doubt that I have a lack of vitamins.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550074234
		},
		{
			"comment_id": 4,
			"body": "@Moor:  receptors? Oo",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550074321
		},
		{
			"comment_id": 5,
			"body": "I think that vitamin B12 is much more important in my case.\nExercise will add testosterone. But it is very difficult for me to do physical exercise.\n\nI take thyroid hormones. True, I did not go to the doctor, because I can not give blood for tests. It is good that these hormones are sold without a prescription (unofficially).",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549966445",
			"date_added": 1550075023
		},
		{
			"comment_id": 6,
			"body": "@Moor: conditioned reflexes are more important, imho.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550075328
		},
		{
			"comment_id": 7,
			"body": "@Moor: Motivation is nothing when a person is too weak. :(",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550076437
		},
		{
			"comment_id": 8,
			"body": "@SSDifnskdjfnsdjk: Christians are homophobes.\n@leftside: but I'm trying, probably.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550076361",
			"date_added": 1550105335
		},
		{
			"comment_id": 9,
			"body": "@Moor: pfff\n@leftside: I eat everything",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550105539
		},
		{
			"comment_id": 10,
			"body": "@Sudongpo: ^^\n\n@Deliriumgoddesss: just humor :)\n\nI sometimes see IT news that in China they allegedly invented something again, and so on. But they can only copy. So people talk about them.\nChina says it launched a satellite to the moon with plants, but what if they shoot all these films in a basement? :)) No one knows the truth.\nBut everyone knows that the dictatorship in China and that the Chinese consider it normal, because for thousands of years as a result of selection they have become a slave nation.\nI feel sorry for them. They do not even understand what freedom is.\nFreedom is something they do not have. They were deprived of freedom thousands of years ago and they no longer remember what freedom is.\n@Styromaniac: Yes, this is complete nonsense, I think so too.\nTrue, in my childhood, too, it was. In some countries, this is considered normal to this day. For example, Muslim countries, where adult men do it with young boys and this is not condemned. This is their own business.\n\nIn addition, once in my childhood, someone hit me on the back of the head and I even lost consciousness. I woke up on the ground in the street. This world is full of terrible people. And my childhood was just awful.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550104309",
			"date_added": 1550133350
		},
		{
			"comment_id": 12,
			"body": "@Pexo: Thank you!",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550136116",
			"date_added": 1550237052
		},
		{
			"comment_id": 13,
			"body": "Thanks for your advice, friends!",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549966445",
			"date_added": 1550239008
		},
		{
			"comment_id": 14,
			"body": "@Kaffie: Probably all have small hormonal disorders. Just genetics.\nBut I am afraid that this is how nature gets rid of unwanted code.\nWe are probably defects. :(\nBut all this convention.\nWithout deviation, there will be no evolutionary process. Animal species will no longer adapt to the environment and they will all become extinct.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550104309",
			"date_added": 1550239428
		},
		{
			"comment_id": 15,
			"body": "@SSDifnskdjfnsdjk: In the future, grandchildren will study the history of the family ... :))\n",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550241474",
			"date_added": 1550243111
		},
		{
			"comment_id": 16,
			"body": "@Polar🍀☘️🌿🌾🌴: I use bookmarks for music, for what is not needed now and so on.\nI am not comfortable using bookmarks.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550241474",
			"date_added": 1550245459
		},
		{
			"comment_id": 17,
			"body": "@Quantumworld: I know about this program, it is just a powerful notepad.\nBut it seemed inconvenient to me, besides that it lacked functionality.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550249993
		},
		{
			"comment_id": 18,
			"body": "@SSDifnskdjfnsdjk:\n\"Everything is a desktop search utility for Windows that can rapidly find files and folders by name.\"\nMy files usually have the name \"e5i83tfio8.txt\".\nIn addition, recently I save everything in several files. They have become quite large. \nThis program does not suit me.\nAnd unfortunately I have little money, I can not buy a system of information storage.\nI have no money at all. Money from relatives, but they are poor.\nMaybe I will learn some programming language and Database, and I can solve my problem.\nOr I can not learn ...\n\n@Quantumworld: \nEmacs makes no sense for this task. There is no visible general structure, pictures, etc.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550251975
		},
		{
			"comment_id": 19,
			"body": "@Polar🍀☘️🌿🌾🌴: I need to organize the information that is inside a large file. For example by tags.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550253220
		},
		{
			"comment_id": 20,
			"body": "@Polar🍀☘️🌿🌾🌴: By topic, they are roughly divided, but I want a list of theses or something similar within each topic.\nI also want to turn it into several books.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550254858
		},
		{
			"comment_id": 21,
			"body": "@Quantumworld: \nLinux is the kernel, not the distribution.\nYou probably didn't like the particular Desktop Environment.\nIn addition, LInux is best suited for servers, and not as a client OS.\nAndroid is the only exception.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550264498
		},
		{
			"comment_id": 22,
			"body": "@Hikkiaut: Thanks, but it does not suit me, I need a program to organize my information.\nThis is called \"Personal Database\".",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550264933
		},
		{
			"comment_id": 23,
			"body": "@Quantumworld: I'm autistic, we like structures.\nBut I agree to use and a graph system.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550266308
		},
		{
			"comment_id": 24,
			"body": "@leftside: People constantly need food.\nBut if they came to a new place, they do not know what to eat and what is poisonous.\nNot even all mushrooms and berries can be eaten.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1550436911
		},
		{
			"comment_id": 25,
			"body": "@leftside: Firefox Portable",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550241474",
			"date_added": 1550437140
		},
		{
			"comment_id": 26,
			"body": "@leftside: Sorry, but the \"grep\" program doesn't suit me, because I want a GUI.\n\n\n@Klu9: and @Quantumworld: \nRichard Stallman and Linus Torvalds are two businesspersons who make money on a crowd of lemmings.\nThey don't care about you and free software, they just need money.\nOpen Source is a sect and nothing else.\nSmart people exploit stupid people. Stupid people work for free. It is just slavery.\nEveryone knows this, but no one talks about it.\nAnd all corporations know it.\nFree developers and free testers. Also, these lemmings are looking for bugs for free and even correct them.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550249688",
			"date_added": 1550439857
		},
		{
			"comment_id": 27,
			"body": "@SSDifnskdjfnsdjk: ^^\nThe last blog in my life.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550437434",
			"date_added": 1550440742
		},
		{
			"comment_id": 28,
			"body": "я так и знал, что ты умеешь в русиш",
			"post_uri": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1550164042",
			"date_added": 1550444338
		},
		{
			"comment_id": 29,
			"body": "но ты совершенно зря теряешь время на прокремлёвские СМИ.",
			"post_uri": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1550164042",
			"date_added": 1550444677
		},
		{
			"comment_id": 30,
			"body": "@Polar🍀☘️🌿🌾🌴: ^^\n\n@leftside: Real autists do not like MineCraft and chess.\nI draw badly. It takes a long time to learn to draw, but autists do not like to learn. XD",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550585223",
			"date_added": 1550591687
		},
		{
			"comment_id": 31,
			"body": "But I can write text ...",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550585223",
			"date_added": 1550595454
		},
		{
			"comment_id": 32,
			"body": "Only a professional artist can paint the things that are in my head.\nBut I can describe everything in the smallest detail with the help of the text.\nIt is a pity that I can not just download all this from my head to the computer. Although in the future it will definitely be possible.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550585223",
			"date_added": 1550596261
		},
		{
			"comment_id": 33,
			"body": "@leftside: Thank you for your help, but most likely everything will have to be done manually.\nIt is unlikely that I can train the neural network to do everything automatically :)",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550241474",
			"date_added": 1550749734
		},
		{
			"comment_id": 34,
			"body": "@leftside: I doubt this is just ADHD.\nIn addition, I am not going to sit in a dirty mental hospital, it’s just terrible there, but without that, no one will give me medicine.\n\n\"shuffled trump cards\"?",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550585223",
			"date_added": 1550750077
		},
		{
			"comment_id": 35,
			"body": "I will try to learn English and then continue to run my blog.\nIf I'm not very busy.\nI love you all! ^^",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550756239",
			"date_added": 1550859169
		}
	],
	"follow": []
}