{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1584714965,
			"title": "Дебиан запускает кучу \"социальных\"сервисов",
			"body": "Сабж: https://www.opennet.ru/opennews/art.shtml?num=52576\n\nКучу барахла, включая блоги на *вордпрессе*. (Чтобы их взламывать было легче?)\n\nЯ солидарен с комментариями тех, кто пишет, что это нецелевое расходование средств и тупо попил бабла. В целом Дебиан как проект уже давно катится куда-то не туда.\nБудь это какой-то отдельный проект -- другое дело. Но деньги Дебиану явно дают не на это.",
			"added": 1584714964
		},
		{
			"topic_id": 1584724683,
			"title": "Хьюстон, у нас проблемы?",
			"body": "@gitcenter:\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/16yCk4uqPmSvaqoZoFJhvBgyaRWMeVe7Sv/ZeroNet-content-bug.png\n\nЧто-то новенькое:\n\n* Дата выставлена по дате правки самого сайта. (Без пользовательского контента.)\n* Пользовательских данных нет, файлы отсутствуют.\n* При попытке обновить сайт через UI, ZeroNet выкачивает файлы (судя по счётчику файлов в UI), но файлы не сохраняет. Первое предположение: фейлится их валидация.\n* Глючат только эти три форума. Но я думаю, что баг случайно возникает.\n* 0.7.1. rev4206, Windows 7 64 bit, свежая инсталляция ZN\n\nНе имею сейчас доступа к своим основным учёткам, поэтому вместо багрепорта на гитхаб, пока так.\n\nПопытаюсь еще разобраться на месте.",
			"added": 1584724681
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 1,
				"body": "> [xandanyesm](#comment_29_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): \n\nА вдруг хорошо получится? Дай человеку шанс.\n\n> [xandanyesm](#comment_29_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY):  управляемый одним автором зайт\n\nТак-то почти любой сайт здесь управляется одним человеком.\n\nА насчёт вики, есть одна идея...",
				"added": 1584714214
			}
		],
		"1584542139_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "> [jixuucix](#comment_5_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): О, даже с субфорумами. А в новом движке и в ++ такое есть?\n\nДа.\n\nStart New Topic -> Topic type -> Create Group",
				"added": 1584714363
			},
			{
				"comment_id": 4,
				"body": "> [jixuucix](#comment_9_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): А вот это что за «другой» Ru-ZeroTalk 🇷🇺 v2?\n\nЭто наверное @gitcenter отлаживал код для переноса сообщений.",
				"added": 1584717706
			},
			{
				"comment_id": 9,
				"body": "http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n отсюда?",
				"added": 1584770075
			},
			{
				"comment_id": 10,
				"body": "Я смотрю, когда захожу добавить что-нибудь. Интересно в случайные ссылки потыкать.\n\nОбычно попадаю только на пустые блоги на китайском.",
				"added": 1584770284
			},
			{
				"comment_id": 11,
				"body": "Увидел, синхронизировался. Винда вроде сама должна,но что-то не хочет.",
				"added": 1584770398
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_84_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Вроде это должны были починить, а воз и ныне там...\n\nКак это починить?",
				"added": 1584770413
			},
			{
				"comment_id": 13,
				"body": "Но сайт создавая новую запись, берёт время из браузера, разве нет?\n\nА у нас есть API, чтобы запросить время с ядра ZeroNet? Если есть, я сделаю проверку, и если время расходится, буду пользователю показывать диалог, какому времени он доверяет: локальному системному или сетевому p2p консенсусу.",
				"added": 1584770629
			},
			{
				"comment_id": 14,
				"body": "Еще, нам нужно дерево комментариев в явном виде, а не просто в виде цитаты предыдущего комментария. Как на LOR, habr и opennet. Тогда мы можем упорядочивать реплики вне зависимости от расхождения времени.",
				"added": 1584770794
			},
			{
				"comment_id": 15,
				"body": "> [gitcenter](#comment_86_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Есть. Где-то в serverInfo.\n\nХорошо. Посмотрю, что можно сделать, как буду в городе.",
				"added": 1584770818
			},
			{
				"comment_id": 16,
				"body": "> [gitcenter](#comment_87_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): timecorrection -- расхождение в секундах, его нужно прибавлять к времени хоста.\n\nНужно еще глянуть, что это за `timecorrection` такой.\nЕсли это расхождение между сетевым временем и **временем хоста ZeroNet**, то это в корне неправильно.\nБраузер может исполняться на другом хосте и иметь другое локальное время.",
				"added": 1584772025
			},
			{
				"comment_id": 17,
				"body": "> [geekless3](#comment_16_16yCk4uqPmSvaqoZoFJhvBgyaRWMeVe7Sv): Нужно еще глянуть, что это за timecorrection такой.Если это расхождение между сетевым временем и временем хоста ZeroNet, то это в корне неправильно.Браузер может исполняться на другом хосте и иметь другое локальное время.\n\nТаки да. Нам нужно передавать еще и время хоста ZeroNet в браузер.\n\nИ лучше где-то в ZeroFrame сразу вычислять разницу между временем браузера и хоста, с поправкой на время выполнения запроса. ",
				"added": 1584772895
			}
		],
		"1584548291_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 3,
				"body": "> [jixuucix](#comment_8_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Удалил видеосайты, потому что на них много мусора, никакой каталогизации, а ролики еле раздают. Может, конечно, я избалован известно каким клирнетным монопольным ресурсом, но почему-то торренты в худшем случае качаются со скоростью 2–3 Mbytes/s, пусть и после некоторого разогрева. Здесь же можно поставить ролик на скачивание, оставить на неделю — и он не скачается! Вывод один — эти сайты никому не нужны всерьёз.\n\nНу, они все кривые, недоделанные, да и раздавать эту свалку мало кто хочет.\n\nСейчас когда в ZeroNet наконец-то добавили поддержку utf8 в именах файлов, можно просто делать сайты-\"торренты\". Один сайт - одна раздача. И нужен тематический каталог типа рутрекера, конечно.",
				"added": 1584714575
			}
		],
		"1584724683_16yCk4uqPmSvaqoZoFJhvBgyaRWMeVe7Sv": [
			{
				"comment_id": 5,
				"body": "```\nWARNING  Site:1TALK5..S1Xq data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json: verify sign error: VerifyError: No rules for this file in ContentManager.py line 979 > ContentManager.py line 804\nDEBUG    WorkerManager:1TALK5..S1Xq hl7gkkg2lternvuc.onion:15441: Verify failed: data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json, error: No rules for this file, failed peers: 0, workers: 0\n```\n\n```\nDEBUG    Site:1F4WVH..jVHC Download data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json failed, check_modifications: False\n```",
				"added": 1584726152
			},
			{
				"comment_id": 7,
				"body": "Хм. Баг не воспроизводится после перезапуска ZeroNet. А вот это интересно... Значит это другой баг, не тот, что на моём ноуте. Там я не вижу **часть файлов** и баг **сохраняется** после перезапуска.\n\nТак, значит, в этом случае ZeroNet скачала `data/users/content.json`, но забыла взять из него правила. Херово, что непонятно теперь, как это воспроизвести. Взять снова чистую установку и попытаться открыть кучу сайтов?...",
				"added": 1584726561
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_80_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Починить можно, удалив сайт и скачав его заново. \n\nДа хотелось бы, чтобы не приходилось такое \"чинить\"... Не каждая домохозяйка сможет в зеронет, да.\n\nГде-то race condition. Я эти три форума примерно в одно время кинул на закачку, значит неправильная работа длилась краткое время. Логи буду смотреть, может какое исключение где увижу подозрительное.",
				"added": 1584726963
			}
		]
	},
	"comment_vote": {}
}