{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1545341925,
			"title": "ZeroNet relay in Raspberry?",
			"body": "I think it's a good option to have a relay for 24 hours. The consumption of Raspberry is only 5 watts / hour. It costs less than 100 dollars.\nBut will it have enough power? Some users are already using it now?\n\nThanks for your help.",
			"added": 1545341924
		},
		{
			"topic_id": 1556366714,
			"title": "BEAKER browser, host a web and 2P2 mode.",
			"body": "ZeroNet is not alone. There is a new browser that can host a web page, and it works in 2P2 mode.\nI have not tried it but it seems interesting.\n(Danger external link) https :::::: //beakerbrowser.com/",
			"added": 1556366712
		},
		{
			"topic_id": 1558099954,
			"title": "Notre Dame of Paris",
			"body": "There are different theories to explain The Fire of Notre Dame de Paris, but what I have seen is that the wood that burned was not oak but pine. The oak burns very slowly but the pinewood burns very quickly.\nI think there was a fraud the last time they changed the roof beams (year?), Sold to the archbishopric of Paris pine wood at a price of much more expensive oak. Researchers of the fire will have already discovered pine in the burnt remains but the French government is adamant in refusing to tell the truth to the people because of the fear that France will be ridiculed throughout the world.\nIn the great and majestic France there were also and there are scams; Macrom is silent.",
			"added": 1558099951
		}
	],
	"topic_vote": {
		"1545341925_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": 1,
		"1556469750_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1545325711_1PhqJPvtSbw5RkpHj63w8cRtyJw2ivpCSy": [
			{
				"comment_id": 1,
				"body": "Download photos, music, and other files ever format zip, rar, etc. Use you antivirus ever.",
				"added": 1545341047
			}
		],
		"1546425545_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 2,
				"body": "ah hahahh I had think in NEW HORIZONS spacecraft, yesterday 1 january arrive to ULTIMA THULE. Sorry. Happy 2019 year.\nhttp://pluto.jhuapl.edu/",
				"added": 1546429351
			}
		],
		"1546519350_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 3,
				"body": "True or false it´s the question.",
				"added": 1546523108
			}
		],
		"1547295582_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 4,
				"body": "It´s good idea.",
				"added": 1547297281
			},
			{
				"comment_id": 5,
				"body": "There is a 5 groups in TELEGRAM.",
				"added": 1547299254
			},
			{
				"comment_id": 6,
				"body": "There is a 5 groups in TELEGRAM.",
				"added": 1547299308
			}
		],
		"1552495966_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 7,
				"body": "Is a war, iluminatis A versus iluminatis B.",
				"added": 1552566796
			}
		],
		"1554018829_1EUP5MZuyBCFNrj3rARxA426G8TKpBjqiz": [
			{
				"comment_id": 8,
				"body": "Boa sorte amigo.",
				"added": 1554046749
			}
		],
		"1556366714_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 9,
				"body": "Yes, excuse me,  is P2P",
				"added": 1556367356
			},
			{
				"comment_id": 10,
				"body": "There is the fear of a possible back door. NSA, PRISMA, they watch us.",
				"added": 1556393598
			}
		],
		"1556469750_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "I have ZeroNet in a old SAMSUNG ANDROID 4.3 and it working 2 months any problema, run in the background. Hardware tipe???? I don´t know. The software had download in GOOGLE PLAY.",
				"added": 1556475941
			},
			{
				"comment_id": 12,
				"body": "My cell phone is on 24 hours and is always connected to the power grid, and with battery.\nSettings, wifi always connected, and no SIM card, nothing more.\nTOR does not work but the server works fine.",
				"added": 1556476781
			}
		],
		"1558099954_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 13,
				"body": "I have experience with the 2 types of woods. This is science, the speed of the fire advancing coincides with the pine wood; With the oak wood I reckon it would take more than 12 hours to burn completely and it would be easy for firefighters to work.",
				"added": 1558110310
			},
			{
				"comment_id": 14,
				"body": "> [upnet](#comment_13_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV): I have experience with the 2 types of woods. This is science, the speed of the fire advancing coincides with the pine wood; With the oak wood I reckon it would take more than 12 hours to burn completely and it would be easy for firefighters to work.\nPresident Macrom is afraid that people will laugh at France because of the bad image of being cheats.\nThey invent conspiracies as if the guilt was to remove the \"gargolas\" that are protective demons.\nIt was all a fraud in the sale of the wood type.",
				"added": 1558110634
			},
			{
				"comment_id": 15,
				"body": "It seems strange to me that the cigar is not well extinguished or it could have been an electric derivation, but if the wood is pine, it is possible to ignite the fire and its expansion would be fast, almost exponential. The oak placed on burning coals takes a long time to burn and it does it slowly, a small trunk lasts all night, at home we use it to smoke foods like sausages. I am convinced that the firemen would have time to put out the fire.\nThe gargoyles were no longer there to protect the building.",
				"added": 1558179383
			}
		],
		"1558542225_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": [
			{
				"comment_id": 16,
				"body": "Versión beta? I prove I2P+ in other computer.",
				"added": 1558556894
			}
		],
		"1566980845_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 17,
				"body": "Land where you live? I think that is possible.",
				"added": 1566995397
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 18,
				"body": "Dear Bracken.\nNobody has answers to those questions but you have to know that you are not to blame for what happened. You should look for other activities, support group, and over time you will feel much better.\nYou are not alone, I will pray for you and for the love of your life. Have faith in yourself.",
				"added": 1567880949
			}
		],
		"1577464517_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "Bug? Thank stromaniac.",
				"added": 1577710756
			}
		],
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 20,
				"body": "You can speak with zelenazvezda@zeroid.bit. He spoken sperantaj.",
				"added": 1582896283
			}
		],
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 21,
				"body": "NWO coming.",
				"added": 1584642755
			}
		],
		"1604109014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "It´s possible but...........Biden can......",
				"added": 1604174761
			},
			{
				"comment_id": 23,
				"body": "Civil war coming?",
				"added": 1604174800
			}
		],
		"1611514697_1GA4uRggxQfqedqj7rAHWpg47PRt6YuqGv": [
			{
				"comment_id": 24,
				"body": "Lo mejor es no tener dependencia psicológica de ella. Déjala atrás y empieza una nueva vida.",
				"added": 1611581992
			}
		]
	},
	"comment_vote": {}
}