{
	"title": "Politics & Social @ Balancer",
	"description": "Hard Russian propaganda in broken english :)",
	"links": "*   [Broken English blog](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/)\n*   [Politics blog](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/)\n*   [USSR-Russia. 1988-2018](/18ZaNRBjjZSxV38omZS5tu3ngNExnRYxxA/)\n*   [Military blog](/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/)",
	"next_post_id": 67,
	"demo": false,
	"modified": 1542125296,
	"post": [
		{
			"post_id": 66,
			"title": "People Living in Extreme Poverty",
			"date_published": 1542125233.361,
			"body": "I got an interesting map. Is it that it turns out that there are so many beggars in the USA? Or am I somehow mistaken in the interpretation of this data? It warms my soul that Russia looks so good here :)\n\n![poverty-world-map-874a.jpg (1200x743)](data/img/post_66_poverty-world-map-874a.jpg)\n\nOrigin: https://howmuch.net/articles/people-living-in-extreme-poverty-2018"
		},
		{
			"post_id": 65,
			"title": "Gender differences in life expectancy",
			"date_published": 1537837075.346,
			"body": "A bit depressing statistics.\n\n![xcgUOdKMksEYcO3L9O8mVo8-LyftZqkb3mNd5yJB4Qs.jpg (1024x546)](data/img/post_65_xcgUOdKMksEYcO3L9O8mVo8-LyftZqkb3mNd5yJB4Qs.jpg)"
		},
		{
			"post_id": 64,
			"title": "[Music] Motor-Roller — “About obedient boys”",
			"date_published": 1524427782.414,
			"body": "I'm a little drunk and listening to my favorite music. This is a state in which you always want to share what you like. And why not share music with foreign acquaintances. But there is a problem. For me, always text means an order of magnitude more than music or, especially, video. And most of the things that I love will be simply not clear to foreigners. But sometimes there are songs that have a pretty good performance and a visual video. I'll try to share such. Here is the song of the group \"Motor-roller\" under the title \"About obedient boys\". Literally - a song about how the boy was summoned to him by some external force (the Moon), as he obeyed her false call and went to her on the heavenly staircase. And how society (relatives and friends) began to call him back. He obeyed, returned to the people, but somewhere in the sky he dropped his heart. And it remained there to shine a star, like other similar heart-stars. Who is right, who is to blame? The song does not give an answer.\n\n<video controls=\"\"><source data-cke-saved-src=\"/big.kopykate.bit/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1524427505-Motor-Roller--About-obedient-boys.mp4\" src=\"/big.kopykate.bit/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1524427505-Motor-Roller--About-obedient-boys.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n(To view you must have a [KopyKate zite](/big.kopykate.bit/))\n\nMotor-roller is an unusual group. This is a rock band from Kazakhstan, who sings a songs in Russian. One of the shards of the former USSR. People whose nationality is not Kazakh and not Russian, but Soviet.\n\nThe music video is not professional, shot by amateurs."
		},
		{
			"post_id": 63,
			"title": "Telegramachy",
			"date_published": 1524381100.638,
			"body": "I have not written anything for a long time, it's a lot of work, it's not enough time :) But now in Russia there is really an epic battle, which is little reflected in the Western media, so I will note it shortly. There is such an Instant Messenger, Telegram. It is much more functional than WhatsApp, and although its popularity is noticeably lower, in Russia it is used by very many, about 15 million people or every fifth Internet user. In this messenger there is a secret chat function that allows you to encrypt the correspondence from user to user, so that it can not be intercepted by the server or the provider. Last year there was a loud terrorist attack, when in St. Petersburg terrorists blew up the subway car. During the investigation, it turned out that the terrorists were planning and preparing the terrorist attack, communicating in Telegram. The FSB decided to get the messenger's developers the opportunity to access the correspondence of individuals. The developers refused, citing the technical impossibility of intercepting e2e communication. The FSB through the court  reached a decision on the blockade of Telegram in Russia. A week ago, Roskomnadzor began to implement the decision.\n\nAnd then the circus began.\n\nTelegram uses several, as practice, very effective way to protect against locks, using a large number of different and constantly changing subnets of cloud providers. Roskomnadzor attacks with massive blocking of subnets. At the moment, Russia has blocked 17-19 million IP-addresses (~ 0.5% of the world's Internet!). Almost all services related to AWS do not work. Many Google services are blocked. There were problems with MS Office 365, Xbox, PSN, etc. Last night, even google.com and gmail.com was banned, but at the moment they have already been unlocked.\n\nThe funniest thing is that Telegram with all this works: D\n\nIn Russia, now this duel is the number one news, after which people are having fun with popcorn :) But in fact, the process is not very rosy. In fact, Roskomnadzor is experimenting in the area of ​​mass locks. And the Russian Internet can turn into an analogue of the Chinese, hiding behind the Great Firewall :-/"
		},
		{
			"post_id": 62,
			"title": "US blow to Syria",
			"date_published": 1523777787.821,
			"body": "An interesting version of such a high effectiveness of air defense and a divergence in the stated targets of the Pentagon and the Ministry of Defense appeared. Americans have long been preparing for strikes against Syrian airfields. And so the cruise missiles had in advance developed routes for such attacks. Therefore, when new targets suddenly appeared, the routes to them were developed not from scratch, but as a continuation of already existing ones. This provided a series of approaches to the Syrian airbases and further on to new targets. But the Syrian air bases had air defense. And so anti-aircraft complexes shot down cruise missiles flying past like on exercises with high efficiency and without risk of defeat. At the same time, it seemed to the Syrian and Russian military that the air bases were the target of the strike - the missiles flew to them.\n\n![2be460c8581d.jpg (640x360)](data/img/post_62_2be460c8581d.jpg)"
		},
		{
			"post_id": 61,
			"title": "Russian voters",
			"date_published": 1521537306.67,
			"body": "Some voters in the past elections :)\n\n![orig-snimok-1521361499.PNG (847x472)](data/img/post_61_orig-snimok-1521361499.PNG)\n\n![kostumi-na-viborah-7.jpg (640x360)](data/img/post_61_kostumi-na-viborah-7.jpg)\n\n![f08a6749a675bd7930aef60c0b167e13.jpg (1080x1196)](data/img/post_61_f08a6749a675bd7930aef60c0b167e13.jpg)\n\n![wx1080.jpg (1080x720)](data/img/post_61_wx1080.jpg)"
		},
		{
			"post_id": 60,
			"title": "Russia in Wonderland",
			"date_published": 1521356148.535,
			"body": "'There's more evidence to come yet, please your Majesty,' said the White Rabbit, jumping up in a great hurry; 'this paper has just been picked up.'\n\n'What's in it?' said the Queen.\n\n'I haven't opened it yet, said the White Rabbit, 'but it seems to be a letter, written by the prisoner to — to somebody.'\n\n'It must have been that,' said the King, 'unless it was written to nobody, which isn't usual, you know.'\n\n'Who is it directed to?' said one of the jurymen.\n\n'It isn't directed at all,' said the White Rabbit; 'in fact, there's nothing written on the OUTSIDE.' He unfolded the paper as he spoke, and added 'It isn't a letter, after all: it's a set of verses.'\n\nAre they in the prisoner's handwriting?' asked another of they jurymen.\n\n'No, they're not,' said the White Rabbit, 'and that's the queerest thing about it.' (The jury all looked puzzled.)\n\n'He must have imitated somebody else's hand,' said the King. (The jury all brightened up again.)\n\n'Please your Majesty,' said the Knave, 'I didn't write it, and they can't prove I did: there's no name signed at the end.'\n\n'If you didn't sign it,' said the King, 'that only makes the matter worse. You MUST have meant some mischief, or else you'd have signed your name like an honest man.'\n\nThere was a general clapping of hands at this: it was the first really clever thing the King had said that day.\n\n'That PROVES his guilt,' said the Queen.\n\nIt's a pun!' the King added in an offended tone, and everybody laughed, 'Let the jury consider their verdict,' the King said, for about the twentieth time that day.\n\n'No, no!' said the Queen. 'Sentence first — verdict afterwards.'"
		},
		{
			"post_id": 59,
			"title": "Journalists in the UK came to interview the Russian ambassador.",
			"date_published": 1521268769.249,
			"body": "Journalists in the UK came to interview the Russian ambassador.\n\n![photo_2018-03-14_22-18-45.jpg (496x750)](data/img/post_59_photo_2018-03-14_22-18-45.jpg)"
		},
		{
			"post_id": 58,
			"title": "Golden Rain",
			"date_published": 1521138732.671,
			"body": "Today there was an amusing incident. At the airport of Yakutsk, when the An-12 transport airplane took off, a badly fixed cargo was broken. He punched the rear ramp and partially crumbled. No harm done.\n\n![152110166912134141__1_.jpg (712x900)](data/img/post_58_152110166912134141__1_.jpg)\n\n![wx1080.jpg (507x900)](data/img/post_58_wx1080.jpg)\n\nBut the funny is different :) The plane carried silver and gold in ingots. 9.3 tons worth 21.6 billion rubles (~ $ 380 million). More than 3.5 tons scattered on the runway and 12 kilometers around the neighborhood on the take-off trajectory :) Truly - golden rain. Well, at least no one was killed, 172 ingots fell on 20 kilograms each :)\n\n![yakutsk_samolet_zoloto_15032018.jpg (1180x730)](data/img/post_58_yakutsk_samolet_zoloto_15032018.jpg)\n\n![DYULVQtWkAAfNvQ.jpg (675x900)](data/img/post_58_DYULVQtWkAAfNvQ.jpg)​​​​​​​"
		},
		{
			"post_id": 57,
			"title": "Iraqi chemical weapons",
			"date_published": 1521131929.348,
			"body": ">**foxdemon** wrote:\n>Saddam had chemical weapons.\n\nYou have fallen behind by 10+ years:\n\nhttps://www.today.com/popculture/bush-admits-mistakes-defends-decisions-wbna39976132\n\n> He also wrote of many errors involving the Iraq campaign and the failure to find weapons of mass destruction there, despite numerous intelligence reports pointing to their existence.\n\n> “No one was more shocked or angry than I was when we didn’t find the weapons. I had a sickening feeling every time I thought about it. I still do,” Bush writes.\n\nhttps://www.theguardian.com/world/2011/feb/16/colin-powell-cia-curveball\n\n> Colin Powell, the US secretary of state at the time of the Iraq invasion, has called on the CIA and Pentagon to explain why they failed to alert him to the unreliability of a key source behind claims of Saddam Hussein's bio-weapons capability.\n\n> Responding to the Guardian's revelation that the source, Rafid Ahmed Alwan al-Janabi or \"Curveball\" as his US and German handlers called him, admitted fabricating evidence of Iraq's secret biological weapons programme, Powell said that questions should be put to the US agencies involved in compiling the case for war.\n\n> In particular he singled out the CIA and the Defence Intelligence Agency – the Pentagon's military intelligence arm. Janabi, an Iraqi defector, was used as the primary source by the Bush administration to justify invading Iraq in March 2003\\. Doubts about his credibility circulated before the war and have been confirmed by his admission this week that he lied.\n\nYou are waiting for an interesting period of news accumulated over the past 10 years! A lot of new!"
		},
		{
			"post_id": 56,
			"title": "But you don't ask with respect",
			"date_published": 1521118954.476,
			"body": "In Russia, people are offended now. When Powell fantasized about the chemical weapons in Iraq, he even shook the test-tube from the rostrum. But in the case of the poisoning of Skrypal, even a test tube was not needed, only verbal accusations were made. Is Russia much less respected than Iraq? Putin is less authoritative ruler than Saddam Hussein? We are offended!"
		},
		{
			"post_id": 55,
			"title": "World history of poisons",
			"date_published": 1521036494.565,
			"body": "On the eve of the assassination attempt on the traitor, a brooding FSB officer stood in front of a table of boards on a secret appearance in Salisbury. On the table were laid out:\n\n*   potassium cyanide\n*   strychnine\n*   British spy poison from the number of seized earlier\n*   hatchet from the nearest wood-burning barn\n*   a black market gun in the East End, missing from the radar ten years ago\n*   homemade bomb\n*   bayonet knife\n*   Banana\n\n*   and, finally, a unique nerve agent, developed in the USSR in the 1980s.\n\n\"Well, of course!\" — slapped an officer on his forehead. \"Only with the help of a unique Soviet toxic agent can I cover up the tracks leading to Russia!\" Then he grabbed a tube of poison, straightened his hat with a star on his head and went out into the morning Salisbury, mixing with the crowd."
		},
		{
			"post_id": 54,
			"title": "March 8 in Russia",
			"date_published": 1520852119.593,
			"body": "I wrote [before in parallel blog](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:77:Flowers+on+March,+8) how this year to my wife, random guys on the street gave two huge bouquets of flowers.\n\nIn my opinion, these are the consequences of the ever-expanding actions on the congratulation of women. Especially distinguished this year with gifts Russian special forces :D\n\nhttps://www.youtube.com/watch?v=AROAoQDoQ1g\n\n![1HVBg558zd0.jpg (800x450)](data/img/post_54_1HVBg558zd0.jpg)\n\nSo congratulated women from March 8 firefighters in Karelia:\n\n![j7p63tywlq800gwwgg8.jpg (960x720)](data/img/post_54_j7p63tywlq800gwwgg8.jpg)\n\n---\n\nGifts for women in the subway:\n\n![2c455a87.jpg (690x391)](data/img/post_54_2c455a87.jpg)\n\nFlowers are given by the mounted police.\n\n![117602.jpg (800x757)](data/img/post_54_117602.jpg)\n\nThe traffic police, too, did not stay aloof.\n\n![inx960x640.jpg (960x640)](data/img/post_54_inx960x640.jpg)\n\nIt was already traditionally many congratulations from ordinary Russians. Here is a congratulation from men in the Volgograd region.\n\n![1520602200_snimok.jpg (1052x629)](data/img/post_54_1520602200_snimok.jpg)"
		},
		{
			"post_id": 53,
			"title": "Where are the reports from the Ministry of Defense?",
			"date_published": 1520591704.333,
			"body": "Some information for reflection. About how Russia is closed, censored and how it suppresses freedom of the media. In Syria, the transport An-26 crashed. 39 people died. Since the disaster took one day. The Russian Internet is packed with complaints and accusations that the Ministry of Defense does not share with each information about the disaster. I am not kidding. Some people have not read even preliminary announcements in the media, have not seen them - and accuse the Ministry of Defense of the Russian Federation in the absence of comments. That is, obviously, they want the Defense Ministry to report in detail about everything to them personally :) And, of course, they blame Putin for everything."
		},
		{
			"post_id": 52,
			"title": "Impact on elections in Russia",
			"date_published": 1519905527.224,
			"body": "In recent months, a very aggressive and obviously coordinated attack on Russia in general and against Putin's government in particular has been carried out in social networks. I am not his supporter, rather, I choose him as the least of evils, but the mass character and consistency of the shares attracts attention. Obviously, someone before the elections is very active in influencing the election results :)\n\nNow Putin is speaking to the Federal Assembly. In Twitter, instantly appeared hundreds of comments on the discrediting of any of his statements. At what almost all statements or are simple insults, or operate with outright lies. For example, according to the published figures, it turns out that:\n\n*   \"**The average Russian works for 12 hours a day**\". In fact, we have a working day of 8 hours, many actually work less - late for the start of the working day or in the evening leave work earlier. People at us lazy, here I will not embroider smile :) Work more than 8 hours happens, but just not at the state enterprises for which the government answers, and in commerce.\n\n*   \"**The average salary for these 12 hours of work is 20,000 rubles/month ($354)**\". In fact, now the average salary is about 37 thousand rubles per month ($656) .\n\n*   \"**People rarely live up to 50 years**\". That's only the average life expectancy has grown to 72.5 years and is constantly growing :)\n\n*   \"**Russians were completely impoverished during Putin's reign**\". On this issue, I've written here more than once. The average increase in welfare over the past 25 years was 10-15 times. Even life 10 years ago seems much more poor than now.\n\n*   \"**In pharmacies do not find drugs cheaper 200-300 rubles ($3.5-$5.5)**\". Really in Moscow, prices for the most affordable medications start from 6-10 rubles ($0.1 - $0.2). In the province, usually even cheaper.\n\nThe saddest thing is that the phenomenon is massive, no denials (except for me sometimes: D) no one writes, so with all the inconsistency of such statements with reality, the notorious \"70% of the conforming population\", having read this, will also be considered as well. In my opinion, Russia is now clearly losing the information war in social networks."
		},
		{
			"post_id": 51,
			"title": "Apocalypse horse in Moscow",
			"date_published": 1517965023.804,
			"body": "A mysterious picture was observed yesterday in Moscow. A horse galloping along the Moscow Highway with tubing. Riderless. People assume that this is the horse of one of the horsemen of the Apocalypse, which fell out of the saddle. Judging by its color, it is a black horse, which John the Apostle is responsible for hunger and other economics.\n\n<video controls=\"controls\"><source src=\"/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/moscow-apocalypse-horse--youtube=2eFMLw_wik0--zeronet=17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n*   To view this video, you need to connect the [ZeroUp@Balancer zite](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/).\n*   Origin: [https://www.youtube.com/watch?v=2eFMLw_wik0](https://www.youtube.com/watch?v=2eFMLw_wik0)"
		},
		{
			"post_id": 50,
			"title": "Really influence",
			"date_published": 1517958882.59,
			"body": "Do you want a real example of a really strong influence? A real propaganda? Imagine, your family in New York goes to bed. A daughter in Russian sings \"V lesu rodilas' yolochka, v lesu ona rosla ...\", then - \"Malenkoy yolochke kholodno zimoy. Iz lesu yolochku vzyali my domoy\". And you suddenly realize that the daughter does not know by heart \"Jingle Bells\" or \"I Wish You A Merry Christmas\" in your English. Have you imagined it?\n\nNow my daughter before the bed sings in English \"Jingle Bells\" and \"I Wish You A Merry Christmas\". And she does not know our Russian New Year songs. Only a few lines. In part, this is my omission, I did not teach our Russian songs with her. At school they do not learn Russian songs. And in English lessons, obviously, they learn songs in English. But imagine the degree of influence of the West on Russia :)\n\nAnd you - \"Russian advertising looked 1000 people.\" Ugh!\n\n![hqdefault.jpg (480x360)](data/img/post_50_hqdefault.jpg)"
		},
		{
			"post_id": 49,
			"title": "Winter in Moscow today",
			"date_published": 1517846574.85,
			"body": "A little bit about the weather in Moscow in recent days.\n\n![photo_2018-02-04_21-01-00.jpg (824x1024)](data/img/post_49_photo_2018-02-04_21-01-00.jpg)\n\n![DVRS3doVMAAE4-3.jpg (700x442)](data/img/post_49_DVRS3doVMAAE4-3.jpg)\n\n* * *\n\nThe main thing is to raise the wipers so that they do not stick.\n\n![photo_2018-02-05_11-07-20__2_.jpg (590x393)](data/img/post_49_photo_2018-02-05_11-07-20__2_.jpg)\n\n![photo_2018-02-04_21-00-44.jpg (600x564)](data/img/post_49_photo_2018-02-04_21-00-44.jpg)\n\nWell, I threw my pictures of these days in the blog \"without politics\" :)\n\n*   [Record snowfall in Moscow](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:67:Record+snowfall+in+Moscow)\n*   [Meanwhile in Moscow](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:71:Meanwhile+in+Moscow)"
		},
		{
			"post_id": 48,
			"title": "Third launch from Russia's Vostochny spaceport",
			"date_published": 1517519549.357,
			"body": "The third launch from the new spaceport \"Vostochny\" (\"Eastern\"). Successfully put into orbit 11 small satellites, including four American and 5 German satellites.\n\n![Vostochny-3.jpg (1280x853)](data/img/post_48_Vostochny-3.jpg)"
		},
		{
			"post_id": 47,
			"title": "Richard Nixon in the Moscow subway",
			"date_published": 1517518946.861,
			"body": "Richard Nixon in the subway. USSR, Moscow. June 1959.\n\nWhy did no one blame him for his relations with Russia? :)\n\n![Nixon-subway.jpg (900x593)](data/img/post_47_Nixon-subway.jpg)\n\n![Nixon-subway-USSR-Moscow-1959.jpg (556x776)](data/img/post_47_Nixon-subway-USSR-Moscow-1959.jpg)​​​​​​​"
		},
		{
			"post_id": 46,
			"title": "USS Little Rock Stuck in Montreal",
			"date_published": 1516444673.596,
			"body": "[The U.S. Navy's brand-new battleship is stuck in the Canadian ice](http://www.newsweek.com/us-navys-new-ship-little-rock-gets-stuck-icy-waters-after-ceremony-777706)\n\n[USS Little Rock Stuck in Montreal, Ship Might Not Leave Until Spring](https://news.usni.org/2018/01/19/uss-little-rock-ice-montreal)\n\n![Y3dfB5l.jpg (268x900)](data/img/post_46_Y3dfB5l.jpg)"
		},
		{
			"post_id": 45,
			"title": "Great ancient Ukrainians",
			"date_published": 1516397139.004,
			"body": "I try to avoid writing about Ukraine. It's such a stupid topic that in most news it will seem like I'm making it up, people can not really say it all. But sometimes it breaks through me :)\n\nFor example, on Monday, Ukrainian political scientist Alexander Paliy shared new information that King Arthur was a native of Ukraine. He writes that in the UK the theory is popular, according to which King Arthur belonged to the Sarmatians who inhabited the territory from the Black to the Aral Sea in the II-III centuries. According to Palia, traces of the stay of this people are found in Ukraine. And concludes that Arthur's ancestors were Ukrainians.\n\nEarlier, Ukrainians, including historians and scientists, argued that the Ukrainian roots are Christ, Buddha, Christopher Columbus. In the Ukrainian language he wrote poems of the ancient Greek Ovid. In general, the brother of the former president of Ukraine, the historian Peter Yushchenko, asserts that the ancient Greek philosophers spoke in Ukrainian. In a word, I can not remember everyone, it was necessary to write down immediately, as it happened :) If on any of the facts there are doubts, do not hesitate, I will find and share a link to the source :)\n\nHowever, I will add a little more specifics.\n\n* * *\n\nDoctor of Science, Professor, historian Lev Ivanovich Pshenko made a sensational statement: in his opinion, ancient Palestine was originally inhabited by tribes related to modern Ukrainians, and all the Old Testament kings and prophets may have had Ukrainian roots. Source: [https://censor.net.ua/f2650249](https://censor.net.ua/f2650249)\n\n* * *\n\nCandidate of Psychological Sciences and Doctor of Political Sciences, Chairman of the Board of the All-Ukrainian Political Association, Honorary Academician of the International Personnel Academy, Vice-Rector of the University of Ukraine Valery Bebik, argues that the Ukrainian civilization gave birth to outstanding world prophets, philosophers and leaders, in particular, Jesus Christ and Buddha.\n\n\"Christ actually lived three thousand years before his\" canonical \"birth and spoke (like Queen Nefertiti) in Coptic, close to the ancestral language of modern Ukrainians,\" the Ukrainian professor said.\n\n\"Jesus is the Hellenic version of the name Yas, meaning \"clear\", \"bright\". Such names as Yasus, Yazion, and Jason were familiar to the ancient Hellas, their Ukrainian correspondences are the names Yas', Yasko, Yatsko, and the Greek word 'chrestos' means \"the best, kind, noble\". Bebik argued, in his opinion, Jesus was from the sect of the Essenes who came from Prykarpattya, and given the factor of \"land,\" and the fact that Ukrainian blood was flowing in the veins of the Galileans, it must be considered that Jesus was a Ukrainian.\n\nSince Ukrainian civilization, according to Ukrainian historians, has, no less, 140 thousand years, then almost any historical person can tie to Ukrainian roots.\n\n[http://vazhno.info/news/40537-ukrainskij-chinovnik-obyavil-iisusa-hrista-ukraincem-i--dokazal---chto-krym-byl-zaselen-ukrami--.html](http://vazhno.info/news/40537-ukrainskij-chinovnik-obyavil-iisusa-hrista-ukraincem-i--dokazal---chto-krym-byl-zaselen-ukrami--.html)"
		},
		{
			"post_id": 44,
			"title": "Week in Russia",
			"date_published": 1516370775.11,
			"body": "In Russia this week, two high-profile news. Curious and tragic. I'll start with the curious. Cadets of the flying school in the city of Ulyanovsk released such a clip.\n\nhttps://www.youtube.com/watch?v=UM4zS_HaZRQ\n\nGiven the Russian aversion to public propaganda of all homosexual-like, a big scandal has turned out. Even the authorities had a split. Someone demanded immediately to exclude them from the flying school. Someone defended the ways of self-expression. However, there were no reasons for excluding them from the school, a lot of imitators of both sexes appeared, so that the scandal languidly subsided.\n\n...\n\nOther news is tragic. January 15, immediately after the beginning of classes in schools, in the city of Perm in the school there was an attack with knives. Two students of the senior classes, under the influence of the massacre at Columbine School, decided to repeat the feat in Russia. They with knives attacked pupils of elementary grades of the school and planned to kill then each other. Fortunately, they could not kill anybody, wounded the teacher and about a dozen children. They could not kill themselves and were detained by the police. Some of the wounded are still in serious condition.\n\nYesterday another school, already the city of Ulan-Ude, two more schoolchildren, under the influence of the previous case, committed an attack in their school. Armed with a Molotov cocktail, a knife and an ax. Five wounded. Some are seriously wounded.\n\nMost of all in both cases, the teachers suffered, which closed their bodies from the knives of their children."
		},
		{
			"post_id": 43,
			"title": "A small bridge from Putin's troll :)",
			"date_published": 1516367646.103,
			"body": "> **[mnemonic](/Talk.ZeroNetwork.bit/?Topic:1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv#comment_26_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE)** wrote:\n> The easiest way to manipulate the masses is to ignite emotional response. It is very hard to think rationally and critically when its fogged by strong emotions. Or to have a civilised dialog.\n> \n> Therefore tribalism is very desirable thing to ignite, because you allienate people who you disagree with and not allow them (or yourself) have a chance to see the other one's point of view.\n> \n> Divide and conquer.\n\nOne of the reasons I came to English-speaking forums three years ago. As soon as the electronic translators began to allow this. (Since I know English only at the level of reading technical documentation :)) Western media, show a very one-sided and distorted picture of Russia. And it builds a natural one-sided iron curtain. It is very simple to abstractly hate someone unfamiliar. But it's harder to hate someone you know. The Russians are in a somewhat more favorable position. There are a lot of Western media in Russia. We watch western films. We read modern Western literature. Tens of millions of Russians communicate on the Internet, which, for the time being, has no boundaries. Therefore, we in Russia represent what the West is living and Russian official propaganda affects us much less. In addition, many people in Russia have remained immune to state propaganda since the time of the USSR. In the West, the picture is quite different. Western users do not go to Russian sites. Do not watch the Russian media. Blindly believe what is said in the Western media. Although here some blow struck the last scandals with Trump. But still, the belief in official sources in the West, at times, is simply amazing. So I'm trying to build a bridge. No, the bridge is an exaggeration. I try to put my small plaque on the construction of such a bridge :) Well, since I write something like that in English-language forums, so that my translations into English are not lost and did not disappear, at the same time I write many of my notes here, in ZeroNet in my \"Broken-English\" blog :)"
		},
		{
			"post_id": 42,
			"title": "Baptism of Jesus in Russia",
			"date_published": 1516320053.996,
			"body": "Continuing the [theme of swimming in the ice hole in Epiphany frosts](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:39:A+long+Russian+winter+holiday+:)) :) In Russia, the Baptism of Jesus came and, as always, the frosts struck. Although this year the frost is weaker than usual, in the daytime the temperature in Moscow does not drop to 14 °F (-10 °C). Two things are interesting with respect to tradition.\n\nFirst, Epiphany bathing was in Yakutia, where now the temperature drops to -60 °F (-50 °C) :) Of course, the situation is saved by the fact that the temperature of liquid water can never be below 0 °C (32 °F), and a tent is placed above the hole, but it's still extreme, in my opinion :D\n\n![0_30e6d4_9889bfa6_orig.jpg (1000x667)](data/img/post_42_0_30e6d4_9889bfa6_orig.jpg)\n\n![1sha0155.jpg (1000x666)](data/img/post_42_1sha0155.jpg)\n\n![80991.jpg (900x445)](data/img/post_42_80991.jpg)\n\nSecondly, this year Putin was swimming in the ice-hole. Although so far only one photo in the media has been published, but still a good move :D\n\n![2a3757363fd222ddd091a481690ad094.jpg (800x600)](data/img/post_42_2a3757363fd222ddd091a481690ad094.jpg)\n\nAnd we with the children, of course, people who are ~~afraid of cold~~ more civilized, we did not go swimming, but went for a [drive on a sled from a hill](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:64:Sledding) :)"
		},
		{
			"post_id": 41,
			"title": "New Year gifts",
			"date_published": 1515617081.97,
			"body": "In the New Year holidays, Russians spent almost trillion rubles (more than $17 billion) on shopping, with a considerable share of jewelry and fur coats. About 7 million people made purchases directly on New Year's Eve.\n\nWe had more modest gifts for this new year :) We gave my daughter a microscope and gold earrings, my son two sets of steam locomotives from the series \"Thomas and Friends\", I gave my wife a set of glasses for wine. Well, I bought myself MFU (color laser printer / scanner / copier) :)"
		},
		{
			"post_id": 40,
			"title": "Mistake of Defense Ministry",
			"date_published": 1515544937.228,
			"body": "> **Montecresto** wrote:\n> I have no way of knowing with any certainty at this point whether the US was involved or not. But I also can’t comprehend why Russia might accuse the US if they know better.\n\nThe press center of our Ministry of Defense is very unstable in terms of the level and quality of propaganda :) After a very subtle and clever move with the [demonstration of Su-24 No. 29](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:36:Russian+Defense+Ministry+planes+delivered+school+boards+and+New+Year+gifts+to+Syria), simultaneously, at first a completely normal and correct report on the attack of terrorists' drones, and then - a completely flimsy hint at the possibility US involvement. Yes, the probability of participation in this American intelligence services is (although I personally estimate this probability is low), but there is no evidence, the arguments are extremely weak ... Our Defense Ministry behaves in this statement as the US Department of State. Excluding only what has not slipped in this case to a direct lie. Direct power confrontation in the information war with the United States is impossible - on the US side, most of the world's media. Therefore, we need to conduct a less profitable policy in the short term, but more profitable in the long term, the policy of openness and truth. And here, although there is a tendency to this, such rare failures undermine the very essence of the information war. If you bet on the truth, you can not just lie, but you can not even categorically state the unproven. One case of violation of such a rule undermines dozens of others, with real truth."
		},
		{
			"post_id": 39,
			"title": "A long Russian winter holiday :)",
			"date_published": 1515486113.952,
			"body": "> > **Balancer** wrote:\n> > Yes, now the New Year holidays have been reduced and tomorrow they already go to work in Russia. But, in general, the last informal New Year's holiday is on January 13\\. New Year in the old, Julian calendar :)\n> \n> **Stratford57** wrote:\n> Technically, the last day of Orthodox Christian holidays (святок) is Jan. 19, the day of Jesus' Baptizing according to Julian calendar.\n\nDespite the fact that formally representatives of Orthodox culture in Russia consider themselves 70 percent of the population (and I including :)), the true Orthodox believers in Russia are about 2%. Therefore, few people in Russia celebrate all Orthodox holidays. During the years of atheistic propaganda in the USSR, the main holiday was the New Year. The night from December 31 to January 1\\. But, since the USSR was constantly referring to the old, pre-revolutionary Julian calendar, the main dates were also cited \"according to the old style.\" So in the USSR there was an unofficial tradition of meeting the \"Old New Year\" on January 13 :) In the West, as far as I can tell, the main New Year's holiday is not the New Year, but Christmas, December 25\\. Therefore, although this holiday did not become very popular in Russia, nevertheless, after the fall of the Iron Curtain, many also unofficially began to meet and Christmas in the western style. And, of course, with the restoration of Orthodox traditions, we began to celebrate Orthodox Christmas on the Julian calendar. Jan. 7\\. Thus, the main New Year holidays were four: D Catholic Christmas, New Year, Orthodox Christmas and \"Old New Year\".\n\nBaptism is a very important Orthodox holiday, but it is marked by a much smaller number of people and does not formally refer to the New Year holidays. But for some time now, in a literally new Russian show tradition, bathing in Epiphany frosts turns :D\n\n![64b7dd4bd9794bcea546005eb526ee49.jpg (838x562)](data/img/post_39_64b7dd4bd9794bcea546005eb526ee49.jpg)\n\nAnd, of course, more girls :)\n\n![4570276142.jpg (998x666)](data/img/post_39_4570276142.jpg)​​​​​​​\n\n* * *\n\n![DSC_3595.jpg (1200x800)](data/img/post_39_DSC_3595.jpg)\n\n![6983359.jpg (1280x853)](data/img/post_39_6983359.jpg)\n\n![___-_________-__________.jpg (972x648)](data/img/post_39____-_________-__________.jpg)​​​​​​​\n\nNext **NSFW** photo in the old topic:\n\n- [Bathing in the ice-hole](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:33:Bathing+in+the+ice-hole)"
		},
		{
			"post_id": 38,
			"title": "Mass attack of UAV on Russian bases in Syria",
			"date_published": 1515482858.746,
			"body": "I posted a separate post in a military blog, since the topic is more military-technical than political :)\n\nhttp://127.0.0.1:43110/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/?Post:8:Mass+attack+of+UAV+on+Russian+bases+in+Syria\n\n![5120363_original.jpg (718x960)](data/img/post_38_5120363_original.jpg)"
		},
		{
			"post_id": 37,
			"title": "Russia Banned From Winter Olympics",
			"date_published": 1515179019.606,
			"body": "> **AlpinLuke** wrote:\n> Russian athletes can compete as singles and without the Russian Federation.\n\nBecause of this, they did not cease to be Russia ;) We already passed it in 1992:\n\n![9032.png (673x296)](data/img/post_37_9032.png)​​​​​​​\n\nAlthough, of course, this time the results will be much worse, because they have forbidden to come to the best athletes. It's sad that politics kills sports. But, no matter what prohibitions are imposed, the whole world knows so, what kind of athletes will be under the neutral flag :D"
		},
		{
			"post_id": 36,
			"title": "Russian Defense Ministry planes delivered school boards and New Year gifts to Syria",
			"date_published": 1515177354.982,
			"body": "[https://www.youtube.com/watch/?v=1dLN4Dzxzs8](https://www.youtube.com/watch/?v=1dLN4Dzxzs8)\n\nIt looks like trolling from the Ministry of Defense :) The plot at 01:19 shows the Su-24 with the number 29, which [was recently shown damaged](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:35:Russian+losses+in+Syria). Whether the recording was made before December 31, whether it had already been repaired, or whether the number had been repainted for another plane."
		},
		{
			"post_id": 35,
			"title": "Russian losses in Syria",
			"date_published": 1515087324.88,
			"body": "Several high-profile news from Syria. At first there was sad news that on December 31 the Mi-24 helicopter crashed. Two pilots were killed, the flight engineer was wounded. Militants from Jabal Sheikh Mujahidin said they shot down a helicopter, the Russian Defense Ministry said later that the helicopter was lost due to a technical malfunction.\n\nBut this news immediately eclipsed the other. In the Russian media yesterday, a sensation was published. Russian airbase Khmeimim was attacked on the same day, December 31, by mortar shelling by militants. Seven airplanes were destroyed. Including 4 Su-24 bombers, two Su-35S fighters and one An-72 transport aircraft.\n\nThis information originated from internal sources. There was no such statement on the part of the militants. Therefore, it was worth attentive to her. The probability that the information was fake is not high, because initially the publication was in the media \"Kommersant\", which were rarely published on the publication of fakes. A little later, through independent channels, information was received that the shelling was, but the losses are not as terrible as stated in Kommersant.\n\nThe Russian Defense Ministry today commented on this information very vaguely: \"_Information on the destruction of seven planes by the enemy at the airbase of Khmeimim in Syria does not correspond to reality. \"Kommersant's\" report on the alleged actual destruction of seven Russian military aircraft at the Khmeimim airbase is a fake.The Russian air group in Syria is in combat readiness and continues to fulfill all tasks for the intended purpose in full.\"_ Pay attention to the wording - fake actually called the statement of the amount of loss. The fact of the shelling itself is not denied and is not confirmed. It is claimed that the air group is combat-ready, but this is possible in the presence of losses.\n\nThat is, collecting all the sources of information into a single whole, it turns out that the shelling was, there are some losses of technology, but not in the same volume as it is stated in Kommersant. And the Ministry of Defense did not lie, having got rid of the truth in a streamlined form :)\n\nAnd, finally, there were the first unofficial photos from the air base of Khmeimim. It can be seen that at least one Su-24 is moderately damaged. He has destroyed the fin tail and there is a hole in the fuel tank. We are waiting for more information :)\n\nAnd I wonder in what form all this will be filed in Western media :)\n\nAlthough, of course, the fact that the militants were allowed into the distance mortar shot - this is a huge miscalculation of the security services.\n\n![XS8zhTeoyPg.jpg (780x1040)](data/img/post_35_XS8zhTeoyPg.jpg)\n\n![su-24-syria-damaged.jpg (620x420)](data/img/post_35_su-24-syria-damaged.jpg)"
		},
		{
			"post_id": 34,
			"title": "Happy New Year!",
			"date_published": 1514723421.02,
			"body": "20 minutes ago the New Year came to Russia! :) Since childhood, I still remember the stamp. When on the radio at 15:00 the time was listed on the time zones, the enumeration ended with the phrase \"In Petropavlovsk-Kamchatsky - midnight\". There were even jokes, in the spirit, \"It's always midnight in Petropavlovsk-Kamchatsky\" :)\n\nSo, here, it was 15:00 in Moscow, and, therefore, the New Year began its journey in Russia! He will end at 01:00 Moscow time New Year in Kaliningrad.\n\nCongratulations to all on the holiday! :D\n\n![inside_mp.jpg (720x446)](data/img/post_34_inside_mp.jpg)"
		},
		{
			"post_id": 33,
			"title": "Bathing in the ice-hole",
			"date_published": 1514655510.235,
			"body": "> [Version](http://127.0.0.1:43110/Me.Mkg20001.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1514632901) wrote in ZeroMe:\n> The girl don't feel cold? So crazy Russian.....\n\nThis is an old Russian tradition. Bathing in the winter, in the day of Christ's Baptism. In the most severe frosts :D Here are a few Russian women under the spoiler - I warn you, you need to remove the children from the screens, this a photos is NSFW :)\n\n* * *\n\n![________-_____-_______-________-_-_______-_____.jpg (795x535)](data/img/post_33_________-_____-_______-________-_-_______-_____.jpg)\n\n![nude-swomming-001.jpg (886x1059)](data/img/post_33_nude-swomming-001.jpg)​​​​​​​\n\n![chastnoe-foto-zhenshina-v-prorubi-4.jpg (720x960)](data/img/post_33_chastnoe-foto-zhenshina-v-prorubi-4.jpg)\n\n![ice-hole-girl.jpeg (1200x865)](data/img/post_33_ice-hole-girl.jpeg)\n\n## See also\n\n- [Winter in Russia](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:5:Winter+in+Russia)"
		},
		{
			"post_id": 32,
			"title": "In this photo everything is fine :)",
			"date_published": 1514632311.113,
			"body": "![Meanwhile-in-Russia-04.03.2013.jpg (980x662)](data/img/post_32_Meanwhile-in-Russia-04.03.2013.jpg)"
		},
		{
			"post_id": 31,
			"title": "Prank stemming from ‘Call of Duty’ bet leads to deadly police shooting",
			"date_published": 1514623253.988,
			"body": "https://nypost.com/2017/12/29/prank-stemming-from-call-of-duty-bet-leads-to-deadly-police-shooting/\n\nSimilar news at a sight from Russia horrifies. Despite all our shortcomings and the corruption of the police system, the police usually do not shoot us, without understanding the situation."
		},
		{
			"post_id": 30,
			"title": "Snow World War",
			"date_published": 1514575709.229,
			"body": "In Moscow, a foreign invasion. For some reason, the tram is managed by Santa Claus with deer, not Ded Moroz with Snegurochka (~~Dead Morose~~ Grandfather Frost and Snow Maiden)!\n\n![photo_2017-12-29_22-05-39.jpg (1200x790)](data/img/post_30_photo_2017-12-29_22-05-39.jpg)\n\n![photo_2017-12-29_22-06-00.jpg (1200x795)](data/img/post_30_photo_2017-12-29_22-06-00.jpg)​​​​​​​\n\n:D"
		},
		{
			"post_id": 29,
			"title": "Chinese in ZeroMe",
			"date_published": 1514316721.14,
			"body": "A bit offtopic, but interesting. I'm looking now, in ZeroMe - there 90 percent of the traffic is Chinese. Well, the Chinese in ZeroNet have always been a lot, it's their way to go for the Great Chinese Firewall, but still - a lot somehow, usually they used to write more in English. It became interesting to read them through a Google translator. In principle, the translation from Chinese into it became much better. Up to the level of almost ready-made texts from English is not enough, but the meaning is already clear, and not as once the \"blue circle bite iron\" :) Basically, the flame on religion. Islamism, terrorism, atheism as a religion and all of what we had in the forums was fashionable to wrestle about 10 years ago :)\n\nExample of translation without editing:\n\n> It seems that the Islamic cult does not allow to take off the education. This is the case with the cult. In a normal world, freedom from religion is free. Freedom from political parties is different. The cult is more like a pyramid scheme.\n>\n> However, the horror of MLM is that it has mosques as a base for training terrorist ideas, a steady flow of output.\n\nIt is interesting that despite the bulky images hieroglyphs: Chinese occupies considerably less space than in Russian or English :) Hieroglyphics smaller words."
		},
		{
			"post_id": 28,
			"title": "Crime in Russia and the US",
			"date_published": 1514102361.548,
			"body": "> **Doug1943** wrote:\n> I have only lived briefly in Russia (or rather Ukraine, then in the USSR) and my impression was that the streets were quite safe ... but that was a long time ago (1985).\n\nIt was a very, very long time ago. Two (or even three) historical periods ago :D 1985 was the peak of the heyday of socialism in the USSR. Then there was Perestroika, when everything began to break. Everywhere there was a decite. Social structures began to break down, ideology collapsed. By the end of the USSR, crime in the country has grown. Then there was the first half of the 1990s, the beginning of capitalism. The rise of banditry. When millions of people lost their jobs, many of them lost their homes. Very many went to criminal structures. In broad daylight in the streets there were skirmishes. They killed businessmen. The police (then it was called the militia since the times of the USSR) was itself extremely corrupt and closely connected with criminals. On the streets there were crowds of alcoholics and homeless people. Chechen terrorists blew up houses and planes, took whole schools and theaters as hostages. It was quite a dangerous time to walk at night in many areas. Since the second half of the 1990s, the situation has begun to improve. Since the 2000s - began to improve very quickly. At first criminals were crushed and the police, which clearly supported them. Then they began to fight corruption in the police. Then - with corruption in the country's leadership. As a result of the level of security of the USSR, we have not reached, I'm afraid, it is impossible in principle in a capitalist country, but security has generally conformed to Western norms :) Yes, we have twice as many murders per unit of population as in the USA, but 90% of them - this is domestic crime. It is enough not to drink vodka at home with strangers to avoid this :)\n\n> **Doug1943** wrote:\n> From my own personal experience, I don't think being shot by the police is really something you have to worry much about in the US.\n> ...\n> You have to remember that the widespread availability of firearms in the US, plus a large, violent, impulsive underclass, makes being an American policeman a dangerous job.\n\nI know this and understand the reasons for this. I wrote above that this is the answer in support of ironic perception, my subjective irrational opinion :) I am also not without irrational assessments;) It's another matter that I usually understand when my subjective assessment is based on facts, and when - then the stereotypes, the cultural code, the subconscious, and so on. :)"
		},
		{
			"post_id": 27,
			"title": "Difference in perception",
			"date_published": 1514047692.644,
			"body": "> **Doug1943** wrote:\n> There is an ironic parallel here in the view of some Europeans that ordinary life in the United States is a daily struggle to avoid being shot by a fellow-citizen or a policeman.\n\nWithout any irony :) I, as a resident of Russia, are horrified that in the US a policeman can simply take and shoot you if you do something wrong, but do not break the law. Well, there, you do not hold your hands in your pockets, you run around in headphones and do not react to shouting and the like. There are many such videos on YouTube. From Russia, this looks wild. We do not even have a death penalty here. I understand perfectly well that for the United States this is a relatively rare case and in Russia, under the wheels of cars on the roads, 30 times more people die than the police in the United States are shooting. But still subjectively, this is perceived as horror. I just do not know how to behave with American policemen, if I have to meet :)\n\n![Police-violence_USA_NEO_Feb-2015_1_.jpg (650x366)](data/img/post_27_Police-violence_USA_NEO_Feb-2015_1_.jpg)"
		},
		{
			"post_id": 26,
			"title": "Alcohol consumption in Russia",
			"date_published": 1514022092.084,
			"body": "> **Sbiker** wrote:\n> P.S. Maybe they drink a lot, but do you know - every people have own rights and other people couldn't denounce them or force them to do, what they don't want. At least, at Russia, don't know about your country...\n\nWith alcohol in Russia, everything is not so bad :)\n\n> In recent years, consumption of alcohol in Russia is rapidly declining (by almost a third over the period 2011-2016 - from **18 to 12.8 liters** per person per year), and the indicator of life expectancy in the country is growing rapidly (since 2003 the average life expectancy in Russia has increased by more than 6 years, and for men - more than 7 years.). According to the Ministry of Health, at the beginning of 2017, alcohol consumption in the country fell to **10 liters** per adult per year, whereas the World Health Organization recommended rate is 8 liters.\n\nand\n\n> By 2017 in Russia, the level of consumption of alcoholic beverages decreased to **10.3** liters per capita per year\n\nWe look at how Russia occupies about 10 or 10.3 liters of water per capita per year:\n\n[Who Drinks The Most? - Alcohol Consumption By Country](https://www.worldatlas.com/articles/who-drinks-the-most-alcohol-consumption-by-country.html)\n\n1 Belarus 17.50\n2 Moldova 16.80\n3 Lithuania 15.40\n~~4 Russia 15.10~~ obsolete data\n5 Romania 14.40\n6 Ukraine 13.90\n7 Andorra 13.80\n8 Hungary 13.30\n9 Czech Republic 13.00\n10 Slovakia 13.00\n11 Portugal 12.90\n12 Serbia 12.60\n13 Grenada 12.50\n14 Poland 12.50\n15 Latvia 12.30\n16 Finland 12.30\n17 South Korea 12.30\n18 France 12.20\n19 Australia 12.20\n20 Croatia 12.20\n21 Ireland 11.90\n22 Luxembourg 11.90\n23 Germany 11.80\n24 Slovenia 11.60\n25 United Kingdom 11.60\n\nOops. Russia is not included in this list even in the Top-25 :)\n\nAlthough, of course, all these methods of estimation are inaccurate and exemplary. But the fact that in Russia now drink much less than even some 10 years ago - it is quite obvious. It is also due to the growth in the standard of living, and in the anti-alcoholic state decisions, and that people who drank in the 1990s basically died out.\n\n![n_graf08.jpg (550x399)](data/img/post_26_n_graf08.jpg)"
		},
		{
			"post_id": 25,
			"title": "Personal attitude",
			"date_published": 1513959068.962,
			"body": "This is what I recently realized after three years of communication in American forums. Most anti-American views are developed not by Russian propaganda. Official Russian propaganda, in general, tries to avoid direct accusations of Western countries, more inclined to accusing specific people and organizations. Much more anti-Americanism develops direct communication with radical Americans. I am a very tolerant and forgiving person, but even then my attitude towards Americans during these three years of communication became worse on average. Yes, I perfectly understand that Americans are different. I see many Americans who agree with me and support me. I perfectly understand why those with whom I do not agree think so, but not otherwise .. However, this does not save. The more I communicate in American forums, the more I understand that America in the current state is not capable of being on good terms with Russia. And I have accumulated more and more negative to American opponents. No hypothetical anti-American propaganda in Russia is able to make one-tenth of this impact."
		},
		{
			"post_id": 24,
			"title": "Aleppo. One year later.",
			"date_published": 1513932936.006,
			"body": "Yesterday in Aleppo. Celebrating the first anniversary of liberation from ISIS. The city that razed to the ground Russian aviation and drowned in the blood of the dictator Assad.\n\n![DRkrutTXcAAvo9Y.jpg (1200x900)](data/img/post_24_DRkrutTXcAAvo9Y.jpg)\n\n---\n\n![DRkrutUWkAA-LQR.jpg (1200x900)](data/img/post_24_DRkrutUWkAA-LQR.jpg)\n![DRkrutWXkAAUu9F.jpg (960x540)](data/img/post_24_DRkrutWXkAAUu9F.jpg)\n![DRkrutVXkAAnhJ7.jpg (960x540)](data/img/post_24_DRkrutVXkAAnhJ7.jpg)​​​​​​​\n"
		},
		{
			"post_id": 23,
			"title": "A little cherry on the cake. ",
			"date_published": 1513932144.593,
			"body": "Well, a little cherry on the cake. This is the population of Lithuania during the bloody Soviet dictatorship and in the period of freedom and independence.\n\n![580px-Population_of_Lithuania.svg.png (580x415)](data/img/post_23_580px-Population_of_Lithuania.svg.png)​​​​​​​"
		},
		{
			"post_id": 22,
			"title": "A few words about the Baltics",
			"date_published": 1513928351.925,
			"body": "In two American forums where I communicate, there is such an evil participant, Litwin :) I do not know his nationality. The fact is that Lithuanians are residents of the Grand Duchy of Lithuania. Which broke up and the heiress of which basically became Belarus. But the response of this forum participant does not look like on Belorus. His manners are more like a Baltic citizen. And, I suspect that he believes that the Litvinians are the inhabitants of Lithuania :)\n\n[https://en.wikipedia.org/wiki/Litvin](https://en.wikipedia.org/wiki/Litvin)\n\nIn the Baltics in general, and in Lithuania in particular, Russians do not like. In Soviet times it was a showcase of socialism. The Baltic States received the best goods. In the Baltic, the best industry and culture developed. The USSR tried to preserve the national self-consciousness and self-identification of the Balts as much as possible. On the inhabitants of the Baltic, the rest of the inhabitants of the USSR looked from below upwards, onto people who are a model of culture. And then the USSR collapsed, the Baltic States rushed to the European Union. And although the standard of living in these republics has indeed become somewhat higher, the Baltic States themselves from the best republics of the USSR have turned into the worst states of the European Union. Of course, when you were treated like a demigod before, and then begin to be treated like a guest worker, it always causes anger. But you can not be angry with the West, where the Baltic countries were so anxious. This will be an admission of your mistake. Conclusion - you need to be angry with the heir to the USSR, Russia :)\n\nI've been to the Baltics (mostly in Lithuania and Latvia) almost every few years every year since 1980\\. Once it was a prosperous land. Accurate, well-groomed houses, garden plots, fields, plants. It was necessary to cross the border - Culture began with a capital letter. I do not know how things are in Latvia now, I was not there in the post-Soviet period. But in Lithuania in recent years 15 the difference began to decrease. The population of the Baltic States is dying out. The rest are leaving for other countries. The EU is not interested in the development of the Baltic republics - factories have stopped, farms are being ruined. When I now cross the border of Russia and Lithuania - I no longer see any cultural difference. The general impression became the same. At what in Russia now there are many places that look already clearly better than many places in Lithuania.\n\nHere, for example, compare a couple of my road photos. The first one is Vilnius. The capital of Lithuania.\n\n![2016-0818-1240-48-200k.jpg (1280x960)](data/img/post_22_2016-0818-1240-48-200k.jpg)\n\nOn the second - a village club in Mikhailovka in Gusevsky district of the Kaliningrad region. Very close, 125 miles in a straight line (200 kilometers).\n\n![2016-0828-1914-img_9455-200k.jpg (1280x856)](data/img/post_22_2016-0828-1914-img_9455-200k.jpg)​​​​​​​\n\nOf course, this is a deliberately chosen contrast example. In Vilnius there are many beautiful well-groomed places, and in my village there are pigsties and cowsheds, where the mud is knee-deep :) But here at the USSR such a combination was almost impossible to find."
		},
		{
			"post_id": 21,
			"title": "Russia vs nazis",
			"date_published": 1513858513.607,
			"body": "Many times I see that the greatest rejection of Russia's actions is manifested in primitive nazis. I think that means that Russia is acting correctly. A good touchstone."
		},
		{
			"post_id": 20,
			"title": "He who fights too long against dragons becomes a dragon himself",
			"date_published": 1513700277.853,
			"body": "Topic: **Senate intel committee investigating Jill Stein campaign for possible collusion with the Russians ..**\n\n> > **Balancer** wrote:\n> > Your witch hunt is very happy opponents of the USA :)\n> > All this is very similar to the atmosphere of the Stalinist USSR, when all were very much afraid to tarnish themselves in their contacts with the West and constantly accused each other of collusion with the West ...\n> \n> **Antiduopolist** wrote:\n> Yup; we are that which we despised.\n\nI usually recall the classic _\"He who fights too long against dragons becomes a dragon himself\"_.\n\nAnd this is very sad, because for decades the United States has been a symbol of freedom of speech and opinion. Even if we feared America for being aggressive or despised of her for arrogance, we still admired American freedom. And we broke the USSR to make our country as free as the US.\n\nAnd now I look at the US and see the second USSR, only at a new historical level. And yet not so lost herself. It makes me sad. I want to believe that American freedom will win. But there is little hope."
		},
		{
			"post_id": 19,
			"title": "GDP vs GDP (PPP)",
			"date_published": 1513669263.025,
			"body": "> **Plus Ultra** wrote:\n> In terms of GDP per capita, Russia is in an awful 64th place (right behind Lebanon – defintely Third World). [http://statisticstimes.com/economy/countries-by-projected-gdp-capita.php](http://statisticstimes.com/economy/countries-by-projected-gdp-capita.php)\n\nIt is necessary to compare not GDP, but GDP in PPP. You do not consider that goods in Russia (including weapons) are much cheaper than in the West. In terms of GDP (PPP) per capita is also not among the leaders in Russia ($26,926 in 2016), but above Greece ($26,829) or Turkey ($24,986) and MUCH above China ($15,395) :) China will you also underestimate? Even a number of Western countries with a relatively high standard of living come off Russia not very far - Israel ($35,220), Spain ($36,347)."
		},
		{
			"post_id": 18,
			"title": "Manipulation of search results in Google",
			"date_published": 1513663839.024,
			"body": "Very interesting manipulation of search results in Google :) I [posted above](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:16:And+how+do+you+feel+about+torture) an infographics about the attitude towards torture in different countries. First I caught a cropped picture without indicating the source, and in this form it was posted it. However, I thought that without indicating this very source, the reliability of the picture is lower. So I quickly found the original through Google, it was Forbes, changed the forums where editing was available, and calmed down.\n\n[https://www.forbes.com/sites/niallmccarthy/2017/01/26/the-world-is-divided-on-the-use-of-torture-infographic/](https://www.forbes.com/sites/niallmccarthy/2017/01/26/the-world-is-divided-on-the-use-of-torture-infographic/)\n\nAt my forum, where I in Russian sometimes make copies of what I write on the American, I forgot to change. One user in Canada decided to find the source himself ... And he received a link with a comment that it could be Fake News without any mention of Forbes: D\n\nInterestingly, Google processes search results.\n\nHere is the issuance of a search for a picture in Canada (the first source of Forbes is not at all):\n\n![3Qsi8uh.png (899x482)](data/img/post_18_3Qsi8uh.png)\n\nHere is the result of the search in Russia (The source of Forbes is lower, since the cropped picture does not exactly correspond to the original).\n\n---\n\n![19-5727397-2017-12-19-06-16-54.png (881x672)](data/img/post_18_19-5727397-2017-12-19-06-16-54.png)\n\nGoogle in the West thinks Forbes fake news, or does he think all the potential negative about the US? :)\n\nIf it is interesting to try to compare the output of the search result in other countries, here is the cropped image that the search for:\n\n![18-5724741-dq1hh7bwaaag9ee.jpg (550x343)](data/img/post_18_18-5724741-dq1hh7bwaaag9ee.jpg)"
		},
		{
			"post_id": 17,
			"title": "Russian aggression",
			"date_published": 1513656023.022,
			"body": "> **Max Rockatansky** wrote:\n> Who did Russians fight in Afghanistan for 10 years, Georgia, Chechnya, Ukraine and Syria?\n\n1.  Afghanistan formally invited the USSR. Now in Afghanistan there are USA. But this, apparently, is not aggression, right? :)\n\n2.  Russia did not attack Georgia. On August 8, 2008, Georgian troops attacked Russian peacekeepers in South Ossetia. After that, the Georgian army was defeated. Russia did not occupy Georgia. Although, of course, after the destruction of the Georgian army, this would not be difficult.\n\n3.  Chechnya is part of Russia. After the collapse of the Soviet Union, she was granted de facto independence. But Chechnya became a hotbed of terrorists, Chechens began to attack neighboring regions and organize terrorist attacks. After that, Russia was forced to return Chechnya to the leadership of Moscow. Is it possible to consider aggression when Spain is putting things in order in Catalonia?\n\n4.  Russia did not attack Ukraine. In Ukraine, there was a pro-Western coup d'état and a civil war began. Yes, Russian volunteers are fighting in Donbas and Russia informally helps the Donbas. But there is no direct aggression against Ukraine. For almost four years, no American intelligence has been able to find Russian troops in the Donbas. But there are American troops in Ukraine.\n\n5.  In Syria, Russia is at the invitation of a legitimate government. But what is the US doing there? Who invited them there?\n\nIn response, I can ask, by what right have the United States bombed Yugoslavia, Iraq, Libya? Why did NATO begin to expand to the east despite all the agreements long before Russia had to take retaliatory measures?"
		},
		{
			"post_id": 16,
			"title": "And how do you feel about torture?",
			"date_published": 1513586247.224,
			"body": "I do not want to offend anyone, but this, really, explains a lot: - /\n\n![20170126_Torture_FO-1.jpg (960x684)](data/img/post_16_20170126_Torture_FO-1.jpg)​​​​​​​"
		},
		{
			"post_id": 15,
			"title": "Secret photos from Russia",
			"date_published": 1513575061.604,
			"body": "That's how we grow bears in the role of domestic helpers.\n\n![image.jpg (598x449)](data/img/post_15_image.jpg)"
		},
		{
			"post_id": 14,
			"title": "It's just Russian winter.",
			"date_published": 1513502152.606,
			"body": "Severe northern swings and children of Snezhnogorsk 23 April 2017\n\n<video controls=\"controls\"><source data-cke-saved-src=\"cors-1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Severe-northern-swings-and-children-of-Snezhnogorsk-23-April-2017-IP4XeBVaMWc.mp4\" src=\"/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Severe-northern-swings-and-children-of-Snezhnogorsk-23-April-2017-IP4XeBVaMWc.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n(ZeroUp clone video test)"
		},
		{
			"post_id": 13,
			"title": "Meanwhile in Russia",
			"date_published": 1513501718.965,
			"body": "Homeless in the subway. On the floor lies the book of Jean-Paul Sartre.\n\n![photo_2017-12-16_12-33-39.jpg (640x640)](data/img/post_13_photo_2017-12-16_12-33-39.jpg)"
		},
		{
			"post_id": 12,
			"title": "Orthodox Church in the USSR",
			"date_published": 1513453687.5,
			"body": "Soviet leader, Leonid Brezhnev at a meeting with the hierarchs of the Russian Orthodox Church. I do not know if such photos are known in the West, but many believe that the church was subjected to persecution and persecution during the Soviet times :) While in the USSR itself, the majority believed that the Orthodox Church was a tool of the KGB.\n\n![1366484011_1087984476.jpg (900x766)](data/img/post_12_1366484011_1087984476.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "Russian military doctors from Syria returned to Krasnodar",
			"date_published": 1513451905.933,
			"body": "![1510947711.jpg (1036x588)](data/img/post_11_1510947711.jpg)"
		},
		{
			"post_id": 10,
			"title": "Ordinary Fascism",
			"date_published": 1513450928.896,
			"body": "Christmas decoration in Saldus, Latvian city. I understand that fascism in the US is not perceived with such a negative as in Russia. But, at least someone will understand that all the allegations that there is no support for fascism in the Baltics is a lie.\n\n![photo_2017-12-15_08-42-45.jpg (800x500)](data/img/post_10_photo_2017-12-15_08-42-45.jpg)​​​​​​​"
		},
		{
			"post_id": 9,
			"title": "Now not a very important topic:",
			"date_published": 1513450120.212,
			"body": "> **ben campen wrote**\n> Russian must be giving drugs to the wrong person\n\n![photo_2017-12-13_23-20-35.jpg (720x540)](data/img/post_9_photo_2017-12-13_23-20-35.jpg)"
		},
		{
			"post_id": 8,
			"title": "The end of net neutrality for ZeroNet",
			"date_published": 1513448274.66,
			"body": "> **blinkel** wrote:\n>Does not this mean that the provider can block ZeroNet traffic?\n\nYes, an ISP in the US can now block ZeroNet. But here the big technical difficulties begin, because of which the costs of their solution do not pay off. For example, Facebook will pay the provider to block or at least cut the speed to Google+ - it's easy. The resources are centralized, the blockages are financially profitable. And on the ZeroNet lock, firstly, you will not make any money, and secondly, decentralized networks require a serious DPI, which requires the costs of funds that the providers will not use in the US until they are pressed by the relevant laws, as in Russia."
		},
		{
			"post_id": 7,
			"title": "The end of net neutrality",
			"date_published": 1513440312.334,
			"body": "> **MistyTiger** wrote\n> I think I'll just purchase a VPN.\n\nThe problem is that if they are not stopped, then the VPN will also be banned. They are already effectively fighting in China. There are talks about the blocking of VPN in Russia. So the rest of the world is also potentially in this queue ...\n\nI would look at the place of Westerners with concern about attempts at state regulation of the Internet in Russia as well as in Russia with concern about the state of affairs in China. These are all links of the same chain. Any state always wants to limit as much as possible the freedoms of its citizens. And if in the second half of the last century the West was a beacon of freedom for the rest of the world, since the late 1990s in the West there has been an obvious trend towards ever more restrictive restrictions on freedom of opinion and freedom of speech."
		},
		{
			"post_id": 6,
			"title": "Forgive the Germans",
			"date_published": 1513426225.293,
			"body": "> **xwsmithx** wrote:\n> I think it's time we rehabilitated and forgave the average Nazi German soldier\n\nSimple German soldiers in Russia have never really been accused. Stalin in the hardest, in 1942, when the Germans stood near Moscow, he wrote \"The experience of history says that the hitlers come and go, and the people are German, and the German state remains.\" The Germans killed tens of millions of Russians. What is the majority of these killed - the civilian population. This is a terrible number that few people can imagine. And, of course, in Russia, many hated the Germans. But this was never an official position of the state and propaganda always separated a simple German soldier from the Nazi command. In Russia, they always remembered about German antifascists.\n\nBut in this case, however, it is a question of another. I do not know whether it will be possible to convey subtlety through electronic translation. Everyone who came to fight in Russia, even if they did not tarnish themselves in war crimes, can not be innocent. Even if these soldiers came to Russia by military conscription, and not by volunteers, they went to war and kill. And on each of them there is a blood of 27 million killed Russians. We forgave them in Russia. And the German Democratic Republic was the most loyal ally of the USSR after the war. But those who have memory will never call innocent German soldiers who fought in Russia."
		},
		{
			"post_id": 5,
			"title": "Russian influence on Brexit",
			"date_published": 1513425581.673,
			"body": "> **Facebook and Twitter: Nine Russian Brexit ads found by inquiries**\n> \n> Facebook said it had looked into activity by accounts and pages it had previously tied to a Russian organisation called the Internet Research Agency.\n> \n> It said the Brexit ads had cost less than $1 (75p) in total to post, and had reached no more than 200 UK-based viewers over four days.\n> \n> The Kremlin has previously denied trying to meddle in the referendum.\n> \n> *   [http://www.bbc.com/news/technology-42342216](http://www.bbc.com/news/technology-42342216)\n\nHeck. We were exposed. The grandiose Russian influence on Brexit was revealed. I told to Putin, it was necessary not to spend $1, but immediately $10\\. No, he did not listen to me :-("
		},
		{
			"post_id": 4,
			"title": "Does Russia gets many terrorist attacks or attempts?",
			"date_published": 1513425421.745,
			"body": "> **Politiks** wrote:\n> Does Russia gets many terrorist attacks or attempts?\n\nThis year in Russia there were two acts of terrorism.\n\nOn April 3, a suicide bomber exploded in the metro of St. Petersburg. Killed 16 people. Strangely enough, no terrorist organization clearly took responsibility for this attack. The terrorist was a native of Kyrgyzstan, who received Russian citizenship.\n\nOn August 19, a terrorist with a knife and an ax attacked passers-by in Surgut. Fortunately, no one died. 7 people were injured, but the terrorist was shot by a policeman. Responsibility to myself took ISIS.\n\n---\n\nIn the past, in 2016, there was one terrorist act. On February 15, during a check on the police station in Dagestan, a car with a suicide bomber exploded. Two policemen were killed.\n\nIn 2015, there was also a terrorist act. Unknown fired at tourists in an ancient fortress in the same Dagestan. One tourist died.\n\nIn 2014, there were three similar acts of terrorism in Dagestan and one in Chechnya.\n\nIn 2013, there were 10 terrorist acts. Including three high-profile terrorist attacks in Volgograd - at different times there were explosions in the bus, at the railway station and in the city trolleybus. In total, 40 people were killed in the terrorist attacks in 2013.\n\nIt seems that the FSB began to work much better. Despite the terrorist attack in St. Petersburg. This year, 16 high-profile terrorist attacks were prevented. The latest case - more recently - a few days ago detained a group of people from Central Asia who planned suicide bombings in Moscow on New Year's holidays in Moscow. Last year, 42 terrorist attacks were prevented.\n\n---\n\n**Update:** I have just above written about the terrorist attacks, carried out and prevented. And then - fresh news. Today in St. Petersburg, a group of seven terrorists were detained, who planned a series of terrorist attacks on the New Year holidays.\n\nhttps://www.youtube.com/watch?v=Z1AA8NjKh90"
		},
		{
			"post_id": 3,
			"title": "Canada approves lethal weapons supply to Ukraine",
			"date_published": 1513424074.169,
			"body": "Canada decided to supply lethal weapons to Ukraine. The leadership of the Donbas is now also ready to supply lethal weapons to Ukraine in response. Unexpected move. But, in general, it is logical. Although, I think this is an empty statement. Russia is not interested in aggravating the situation in Ukraine and therefore, most likely, will not allow the leaders of the DPR and LPR to take such a step."
		},
		{
			"post_id": 2,
			"title": "Who kills whom in Syria?",
			"date_published": 1513421570.762,
			"body": "> **theHawk** wrote:\n> I could care less about Muslims killing other Muslims, nor do I care if Russia is helping one side.\n\nSomewhat incorrectly. Despite the fact that there are many Muslims on the side of Assad and he himself is an Alawite, Syria of Assad is a secular state. And Russia helps not one Muslims to kill other Muslims, but helps one multi-religious, including the Christian side, to kill the Islamists of the other side.\n\n![bashar_i_asma_asad_v_monastyre_2.jpg (1280x1280)](data/img/post_2_bashar_i_asma_asad_v_monastyre_2.jpg)\n\n* * *\n\nBut the United States, really, can not reconcile and calm down. Now the Americans began to arm and train the New Syrian Army, which opposes Assad. And this New Syrian Army is the same Islamists from Igil and An-Nusra.\n\nSo in fact in this war, Russia supports Christians, and the US supports Islamists.\n\nThis is Syria, which Russia supports. I hope you do not need to mention how badly compatible are the Islamists and Christmas? :)\n\n![8.jpg (1200x800)](data/img/post_2_8.jpg)\n\n![aleppo-christmas-2.jpg (1200x514)](data/img/post_2_aleppo-christmas-2.jpg)\n\n![1032291635.jpg (1000x665)](data/img/post_2_1032291635.jpg)\n\n![12391200_1078067668911087_4845533401385243607_n.jpg (768x960)](data/img/post_2_12391200_1078067668911087_4845533401385243607_n.jpg)​​​​​​​\n\nNow try to find the same attitude to Christianity among the militants supported by the United States."
		},
		{
			"post_id": 1,
			"title": "Why is all this necessary?",
			"date_published": 1433033779.604,
			"body": "I understand that many people do not care about reading politics. And that's why in the [main blog](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/) I was constantly twitching - to write or not to write :) And then I thought it was ZeroNet. Cloning here blogs is easier than you can _say Blueberry pie_. And I decided for a policy to have a separate blog.\n\nFor those who do not know me, a little background. I live in Russia, I know English very badly, mostly just as a reader of technical documentation. Therefore, I followed the development of electronic translators for a long time and with interest. About two years ago they reached a level allowing more or less successfully communicate in English-language forums on an arbitrary topic. To discuss technical issues, Russian forums are usually enough. To argue on different philosophical topics is boring - a lot of text, but there is little sense :) But I found that it is interesting to me to communicate in the Western political community. The Russian information community is very open to information from the West, so I can not find anything new in this sense. But on the contrary - in the West they very badly imagine what is happening in Russia. All information from the Western reader is only from the media, and in any media, information is always very distorted. So I started to communicate in American political forums :)\n\nQuite quickly it turned out that simply arguing in different topics is an ungrateful occupation. Anyone who is ready to perceive new information, does it right away. Who does not want to - that can not be persuaded. Especially when communicating through an electronic translator. As a result, after two years of communication, I came to foreign forums in a format similar to the blog. I have selected separate topics, such as \"Voice of Russia\" or \"Point of View. A look from the other side, \"where he began to occasionally write some facts that interested me, comment on events, and so on. Well, answer direct questions, without getting involved in a prolonged flame.\n\nAnd since the blog-like format appeared, it's a sin not to have similar pages on [Facebook](https://www.facebook.com/groups/852308428278691/) and [ZeroNet](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/) :) That's just me and in the FB and ZN tried to avoid sharp political issues, because English-language blogs there tried to lead more personal than political. And, if with Facebook, I have not decided this question for myself yet, in ZeroNet the problem is easily solved by cloning the blog :)\n\nHello! Meet the new blog! :)"
		}
	]
}