{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1581384962,
			"title": "ZeroNet on a seedbox?",
			"body": "would like to know how to install and run zeronet from a seedbox",
			"added": 1581384961
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1581116791_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 1,
				"body": "I fucking hate trump!",
				"added": 1581221592
			},
			{
				"comment_id": 2,
				"body": "> [sfs9](#comment_40_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): I'm not necessarily a Trump fan either, but given what the alternatives were at the previous U.S. presidential election, then one can say without any exaggeration that the Trump SAVED AMERICA. I do recall that thanks to the Russian intelligence services and the WikiLeaks it turned out that the Democratic Party leadership was intentionally downplaying Bernie Sanders and up-playing the Hillary Clinton. That leak led to the resignation of the Democratic Party leader, Deborah Wasserman Schultzhttps://en.wikipedia.org/wiki/2016_Democratic_National_Committee_email_leakhttps://archive.is/wip/6Vslb [...]\n\nmakes sense in some ways.",
				"added": 1581267297
			},
			{
				"comment_id": 5,
				"body": "> [consus](#comment_18_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3): Hunter Biden smoking crack and snorting cocaine off of Burisma Company's executive boardroom table, while getting 1.5 billion for sitting on his ass playing with a yo-yo, while Nancy Pelosi is crying her eyes out about America being taken over by a power hungry president with what little fluid her mummified, botox injected, living corpse like body has left. The Ammerican president checking with the new Ukrainian President, a county known for corruption about 400 billion$ in aid is being responsible not quid pro quo. Now the Democrats using the FBI to oust a democratically elected president, there's a really good image of how corrupt and power ridden American politics is, lets not forget the FBI acquitted Hillary for nothing when they had tons, mountains, of evidence against her.\n\nblah blah blah just make some shit up why don't you",
				"added": 1581737328
			},
			{
				"comment_id": 6,
				"body": "I will",
				"added": 1581918602
			}
		],
		"1581271452_17FotRRc6msHBzM2jrs6tQCmpLaXi1kHd5": [
			{
				"comment_id": 3,
				"body": "lol",
				"added": 1581380008
			}
		],
		"1581518987_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 4,
				"body": "it actually came out that Jesus had a boyfriend. I wonder if it was Mohammed? hmmm something to think about for sure. lol",
				"added": 1581559672
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 7,
				"body": "time is a made up concept so no",
				"added": 1581967746
			},
			{
				"comment_id": 9,
				"body": "> [flc](#comment_7_1MKjTZTDyEz9R4geRYoQgDCAgAzBVHkTVs): You're thinking of time measurements. Time itself is a fundamental dimension of the universe, and it IS possible to \"waste\" it since the slice of it we experience is limited by the period we're alive and conscious in\n\nyea you're correct my bad lol",
				"added": 1582069047
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 8,
				"body": "how did you do this?",
				"added": 1581978668
			}
		]
	},
	"comment_vote": {
		"40_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"7_1MKjTZTDyEz9R4geRYoQgDCAgAzBVHkTVs": 1
	}
}