{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1550002610,
			"title": "A Timeline of Article 13 (2015 - 2019)",
			"body": "With all the confusion around Article 13 and who it does or doesn't benefit. I figured it might be beneficial to examine a timeline of the events reported by TorrentFreak. \n\nThe article is posted on Unlimit Talk Article: http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1550001108_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY/A+TF+Timeline+of+Article+13+2015+2019",
			"added": 1550002609
		},
		{
			"topic_id": 1566065435,
			"title": "Man Tried to Burn Down Telecoms Watchdog to Avenge Pirate Site-Blocking",
			"body": "A man in Russia who admitted to attempting three arson attacks says he took action in response to the authorities blocking pirate sites. The prosecutor demanded two years in prison but the man, who tried to burn down the offices of telecoms watchdog Roscomnadzor, has now received 18 months probation.  [...read more](https://torrentfreak.com/man-tried-to-burn-down-telecoms-watchdog-to-avenge-pirate-site-blocking-190817/#disqus_thread)\n\nPriceless!!!",
			"added": 1566065433
		},
		{
			"topic_id": 1567124913,
			"title": "Why does ZeroTorrent have more functionality than ZeroTalk?",
			"body": "While it appears that ZeroTorrent(http://127.0.0.1:43110/ZeroTorrent.bit) was originally a clone of ZeroTalk, the site has added functionality such as categories and even a search ability. I'm just curious as to why nofish or some other competent developer hasn't integrated some of these changes into ZeroTalk so when new users decide to clone the forum for their own use, they aren't left without search, categories, or other improvements.\n\nJust my two cents as finding anything on ZeroTalk is extremely frustrations to the point that it is a put off.",
			"added": 1567124909
		},
		{
			"topic_id": 1567904814,
			"title": "Did Jeffery Epstein really die?",
			"body": "The suicide was not caught on camera with a whole line of other coincidence leading to his suicide. But with enough wealth to be able to own at least two islands, I would not be surprised if the male corpse that was found hanging was actually a placed body double.\n\nIt does happen and the masses would not be the wiser while being caught up in the drama. But we all know that billionaires seldom follow through with their prosecution. It is not as if a DNA test is being done and even those organisations can be bought with his wealth.\n\nAny thoughts?",
			"added": 1567904809
		},
		{
			"topic_id": 1568220374,
			"title": "Did Google just break Youtube-dl? (solved)",
			"body": "\n\nIs anyone else having this problem?",
			"added": 1568220368
		}
	],
	"topic_vote": {
		"1549988261_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": 1,
		"1550076671_1BhRWTibRK1tQVgBjhwVq6Ra5xJhTViPhY": 1,
		"1549958573_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1550190694_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": 1,
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1553405816_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1558752511_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": 1,
		"1559759030_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1564381634_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1566141272_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566230571_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"1566256283_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567063520_18CNiJ2fa4qWU3mqbmE5kndxLk15oVsxi5": 1,
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1546121685_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1567521662_17ezFE1pdnXf9sFsoGvzZqxsZhX6DiQg4J": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567728985_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"1567941149_12R7P1Qo5kVigBjRF51xawYCww5JCvA5CS": 1,
		"1567951156_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1568052562_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"1568342293_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": 1,
		"1568675236_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1568656823_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"1568583688_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"1568783263_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": 1,
		"1568826985_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"1568856272_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1569007083_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1569091295_1HEFBARrwQ11fqordfVWknwZSngrqnCcUG": 1,
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"1569089727_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1569353016_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1569405299_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1570196788_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570901775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1571803065_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": 1,
		"1572732591_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1572898292_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1572908137_1BwpEuQZAvCqQaPqrPB4fS6PTfLRtx2PA6": 1,
		"1572852310_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1572974675_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1573491192_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575014742_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": 1,
		"1575180863_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": 1,
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1575265213_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1575473198_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1575708225_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1576066471_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": 1,
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": 1,
		"1576431661_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1576434866_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": 1,
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": 1,
		"1576403647_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": 1,
		"1577283326_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": 1,
		"1577321500_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577464517_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577574820_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577589368_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577569682_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577718964_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577790149_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1535022026_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 407,
	"comment": {
		"1549988261_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": [
			{
				"comment_id": 1,
				"body": "As lola stated, I'm pretty sure you need it to be:\n\n`{\"zeronet\": {\"\": \"19TKfCHjaMWhTcyF8cUp95TrsutYmzGVRS\"}}`\n\nbased off of the example provided on Zeroname",
				"added": 1550012889
			},
			{
				"comment_id": 2,
				"body": "Nice!\n\n> [ssdifnskdjfnsdjk](#comment_669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think maybe also needed to edit content.json to define the domain?\n\nThe name can be defined from the Right side slide-out panel\n- Tick on 'This is my site', which will expand the options\n- Fill in the values for Site Title, and a short site description (in this case title would be 'artifaxradio.bit' to properly display in the browser title bar and Zerohome\n- Click 'Save site settings' and click 'Sign & Publish' to publish the title change.",
				"added": 1550028022
			}
		],
		"1550190694_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": [
			{
				"comment_id": 3,
				"body": "> [leftside](#comment_602_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): how to unmute him again?\n\nFrom the main ZeroHello page, click three dot options and goto manage blocked users and sites.",
				"added": 1550193700
			},
			{
				"comment_id": 5,
				"body": "> [handojin](#comment_2_1KBqCUbW4CEHCXtJZRFXy6M1xcbCbAgqGs): maybe it's his cry for help across the netz?\n\nMy private zeronet proxy has a bind to port 666.\nIt reminds me that every time I visit the gate of hell, it is not I who is entering hell, but I am leaving it.\nClearnet is fucking hell. I don't really expect anyone to make it out with their sanity still intact.",
				"added": 1550243957
			}
		],
		"1550002610_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 6,
				"body": "Updated the timeline with the latest action concerning the article removal by the EU Commission",
				"added": 1550534723
			}
		],
		"1550686723_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 7,
				"body": "> [loligod](#comment_18_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): Feel free to request a .bit domain name to be directed to one of your Zsites. \n\nThat's really nice of you, if there is not enough activity on the EN side, I'm sure the RU side of zeronet would be just as appreciative.\n\nZeroPolls: [What is your native language?](http://127.0.0.1:43110/ZeroPolls.bit/?Poll:5-1GooUE19488nDwG3TdkM8seYAHct4gjkq4)",
				"added": 1550703978
			},
			{
				"comment_id": 8,
				"body": "> [ssdifnskdjfnsdjk](#comment_685_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): assume loligod will not renew the domains and after several months they will need a renewal or else it will mean dead links on zeronet.\n\nCan someone confirm this because I have registered and let expire names in the past (multiple years ago) and the original address is still cached on zeroname.\n\nI've registered many of these multiple years ago and they have since expired or have been renewed by other users. Yet, the original entries are still cached on zeronames, so I'm not confident on the accuracy of that statement.",
				"added": 1550704556
			},
			{
				"comment_id": 9,
				"body": "I never expected the NMC system to replace the resolving system due to all of the obvious problems, but is is a nice perk to have. That and obtaining NMC is not the easiest thing to do.\n\nZeronet URLshortners seem to have potential though.",
				"added": 1550721269
			}
		],
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 10,
				"body": "If the regular Joe doesn't want to learn and adapt to Zeronet, then don't force them to. \nThe last thing Zeronet needs is 1,001 'Kitten Head Stuck in Bread Slice' videos.\n\nA sheep that is dead set at being the next in line to the slaughter house will not be of any benefit to your cause as their viewpoints will be easily swayed by the next pretty face spokesman who is able to preach louder than you.",
				"added": 1551023004
			},
			{
				"comment_id": 11,
				"body": "To be fair, I really don't like the socially engineered idea that I need to be on some 'farm' in the first place.\n\nFarms have owners, zeronet does not have an owner.\nI know the title is just figurative but come' on now...",
				"added": 1551024495
			},
			{
				"comment_id": 12,
				"body": "Marketing Zeronet will be a risky attempt. All the vulnerabilities and ugliness of the zeronet's deep network will be emphasised in the largest smear campaign ever. It would be foolish to expect the power holders to let go of their reigns of ownership, control, and censorship without a push back.",
				"added": 1551024953
			},
			{
				"comment_id": 13,
				"body": "> [quantumworld](#comment_287_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): If a Voice of Just One could Unify the Core of Zeronet [...] We are all here to save them or all there social data will be censored and destroyed. And this means all sides.\n\nWell said.",
				"added": 1551028969
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "> What's the craziest thing you could believe, yet you don't really know for sure and even is practical?\n\nThat we live if a fractal universe which includes our conscious realities and existences.\n\n> [robione](#comment_186_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Every proton is a mini black hole. And contains all the information of the universe on the surface of the proton. For all knowledge, all you need to do is, go within.\n\nWith gravity and mass being related to time as seen in the quantum phenomena of time dilation, an entire universe with their own relative time could exist within such black holes while we live out our existences in some black hole found on another dimension.",
				"added": 1552578229
			}
		],
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "You guys... if you live in NZ and want to watch acceptable war porn and instances of violent shootings, simply purchase the latest Triple-A video game title like Battlefield or Grand Theft Auto and play with visual settings on maximum. We can even get our young kids and other siblings involved in the multiplayer fun! Such Great Entertainment!\n\nAlways question as to what you have been conditioned to accept or not accept.",
				"added": 1552841332
			},
			{
				"comment_id": 16,
				"body": "> [thereitgoes69](#comment_2_1HWwBeyNyz95mgfUsNPEVgrpd3xcCgM6sJ): is time to put this topic on its own forum son there is no bad PR for zerotalk\n\nIf the \"Pedo for Crypto\" topics didn't do it, I doubt this topic would make that Bad PR stain any darker.",
				"added": 1552962887
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 17,
				"body": "The question should not be \"Where are the Wikipedia projects on [x] platform\", it should be, \"How do we prevent these next gen Wikipedia becoming the Wikipedia that it is today.\n\nWikipedia – A Tool Of The Ruling Elite\nZeronet: http://127.0.0.1:43110/big.kopykate.bit/?Video=1545977901_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2\nClearnet: https://youtu.be/nDPrpKDjQ5U",
				"added": 1557756456
			}
		],
		"1558266064_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": [
			{
				"comment_id": 18,
				"body": "Zeronet is not widely popular for a combination of reasons. While I'm sure I will miss some but here are a few reasons as to why Zeronet will likely never have a huge popularity spark.\n\n1. Zeronet has an expansion problem. While I'm sure it's not a dead end but when sites begin to have hundreds of thousands of peers and seeders who are active, last I read syncing the updates is going to prove problematic.\n\n2. The 'darknet' carries a social taboo. Mainly due to the lack of centralised control over the networks by the governing bodies.\n\n3. As hinted prior. The governments and regulators would rather loosen their control over society just a little bit to squash the opposition and fans of darknet usage rather than have the majority of society adopt said uncontrollable technology.\n\n4. Zeronet has a steep learning curve. If you don't have a basic understanding of HTML, Javascript, and CSS. You're not going to create anything really special here.\n\n5. Lack of content. The network is still relatively new. Many sites have zero seeders many sites have unseeded content.\n\n6. The zeronet network is still attempting to find it's purpose. I haven't seen any viable marketplaces or currency exchange sites. I haven't seen any long lasting music portals to which development hasn't been abandoned and said sites now stand more as a proof of concept rather than a typical portal of today's standards and expectations.\n\nNow don't get me wrong, Zeronet is a godsend for the persistence of communication and has potential. But a mass influx of users would be more toxic rather than beneficial at this stage of development. The world doesn't need nor want another TOR 2.0. And Zeronet will not become popular advertising itself as one.",
				"added": 1558792346
			}
		],
		"1558919326_1JfiWdvnnv2VwfwvXRv3LiKQfFcDgrHu1p": [
			{
				"comment_id": 19,
				"body": "I'm pretty sure most of the What.CD contributors have moved there.",
				"added": 1558964519
			},
			{
				"comment_id": 21,
				"body": "> [daz](#comment_37_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): does any Zeroworld humans know of a place that specialises in audio books.\n\nhttps://librivox.org\nhttp://www.loyalbooks.com/\nhttps://etc.usf.edu/lit2go/books/\nhttp://thoughtaudio.com/",
				"added": 1558975327
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 20,
				"body": "> [quantumworld](#comment_474_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Toss him on your block list \n\nThree cheers for Kaffee's Spammer list\n\n> Apr 21, 2019 22:13:23\tduende@zeroid.bit\t Pedo who's encouraging me to suicide and spamming his bullshit.\nhttp://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/",
				"added": 1558966940
			}
		],
		"1560428512_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 22,
				"body": "00 Become rich to finance your 'hiding yourself' operation.\n\nIt's like when I get pissed off at my country, I just 'move' to a more socialist one. Simple!",
				"added": 1560436162
			}
		],
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_240_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"ideologies and organizations are self replicating\", not really. ideologies and organizations are not material things.\n\nNeither is a computer virus which is nothing more than a packet of self replicating information within some medium of information storage.\n\nJust like an ideology which often forms organizations are based on Memes (packet of self replicating information) within some other medium of information storage (your brain).",
				"added": 1560436781
			}
		],
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 24,
				"body": "If the gatekeepers of knowledge, entertainment, and publicity are in close partnerships with governing bodies that are prone to regulate the individual over the corporation. Why would such liberating technologies like a Dark Network ever gain popularity.\n\nThe only reason people know about the darknet of what it is today is because multiple versions of SilkRoad made the mainstream media headlines. (Which was considered a mistake and will not be repeated)\n\nSaid governing body that regulates individuals would rather loosen the noose just enough to prevent such technologies from reaching some hyped up trend.\n\nRules and regulations don't change societies, the daily beliefs and actions do. (i.e. The legalization of cannabis consumption throughout the United States) as their prisons were becoming too full with pot smokers & sellers while the wealthy couldn't be bothered nor jailed with such laws. Which resulted in the legalization on the federal level while the backwood (and under educated) states are attempting to catch up.\n\nBut then we have states like Alabama that are going backwards by criminalizing the majority of abortions, even when it is an instance of rape or incest. But that's another topic.",
				"added": 1560438063
			},
			{
				"comment_id": 25,
				"body": "> [xcape2net](#comment_10_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Because, \"No man is so truly enslaved as the man who falsely believes that he is free.\"\n\nFive words highlight this.\n\"The Treatment of American Veterans\"",
				"added": 1560523598
			}
		],
		"1561690274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 26,
				"body": "I would ask said AI what utility percentage does it get out of me. Life is self-serving, why would A.I. be any different.",
				"added": 1561692741
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": "@h3bhkj5gqz4n3pjm \nZeroID is not the only ID provider, ID providers on Zeronet are likely to come and go and also adapt, People can make websites and publish their own viewpoints without an ID service. \n\nSaying Zeronet is gong to die is like saying the internet is going to die, highly repeated but yet to be witnessed.",
				"added": 1565360308
			},
			{
				"comment_id": 29,
				"body": "> [xcape2net](#comment_194_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You need to read what I said more carefully.\nMy comment was directed at h3bhkj5gqz4n3pjm, i have since edited my post to reflect that.\n\n> you do realize that you have a 50K limit for posts and comments on ZeroTalk\nThose who don't spam the forum with irrelevant bullshit have their limits raised.\n\n> If @nofish decides not to increase your limit, you are silenced.\nZeroTalk is not the only public social forum, there is also RuTalk and a various others (Links are on top of Zerotalk)\nThese forums have different owners who choose to be named, or unnamed.\n",
				"added": 1565360732
			},
			{
				"comment_id": 30,
				"body": "> [xcape2net](#comment_196_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Exactly.  Although, I think @nofish is very lenient.  \n\nIf nofish passed, nobody's size limit would get increased, correct. But development would continue and ZeroTalk would be replaced or someone who has access to the forum limits would take over. ZeroTalk is not the only forum to converse on.\n\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/?Category:1:Forums+Boards",
				"added": 1565361542
			},
			{
				"comment_id": 31,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_702_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): no centralization means no centralization\n\nYour claims are all over the place. Is it with centralisation or anonymity. It seems you lose one argument only to make an attempt at moving the goal posts.",
				"added": 1565361829
			},
			{
				"comment_id": 32,
				"body": "> [xcape2net](#comment_199_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If @nofish dies, no one's limit would increase, because he and he alone holds the keys to ZeroTalk.\n\nYou don't know this, that is an assumption that only nofish has access to those keys",
				"added": 1565361906
			},
			{
				"comment_id": 33,
				"body": "> [xcape2net](#comment_200_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I'm sure many take this approach.\n\nMost who know a discussion will be extensive will often carry or link it over to Unlimit Talk which has a vastly increased posting size.\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/",
				"added": 1565362091
			},
			{
				"comment_id": 34,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_705_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you all talk like zombies \n\nTo be honest, I would rather read a comment by someone asking intelligent questions rather than some lamer seeking attention by posing unfounded assumptions. \"Zeronet will die like the other networks created in the same way,\"",
				"added": 1565362286
			},
			{
				"comment_id": 35,
				"body": "> [trevorlaneray](#comment_22_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Is Unlimit Talk considered the #2 place following ZeroTalk?\n\nNo, it is nowhere nearly as popular as ZeroTalk.\nBut if you post a link on the ZeroTalk article saying \"Continue the discussion Here\", most people comply",
				"added": 1565362627
			},
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_708_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol this seems to be fully centralized process. guys you're funny 'denying the reality' really.\n\nThat's only because you have already demonstrated that you don't know shit and have little understanding about the working of zeronet. It is clear this conversation has moved far past you.",
				"added": 1565362813
			},
			{
				"comment_id": 37,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_706_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you already told that once ... i don't care.\nYou need not say more, A troll is going to attempt to troll.\n\n> This guy isn't nearly as entertaining as the Aussie tranny \nThe 'good' trolls are added to [Zeronet blocklists](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists).",
				"added": 1565362929
			},
			{
				"comment_id": 38,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_710_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): so Idiot, if you use an ID are you identified or not,\n\nIf you don't use an ID, you have nothing to worry about. You don't understand that Social Sites make up a very small percentage of what is on Zeronet.",
				"added": 1565363199
			},
			{
				"comment_id": 39,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_712_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): your computer creates an identity for zeronet, yes or no\n\nTo just browse the network, NO",
				"added": 1565363315
			},
			{
				"comment_id": 40,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_714_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): so your system does not, you should look more carefully, if haven't one, you couldn't connect to zeronet.\n\nYou are wrong, zeronet users don't even need to visit nor seed any ID sites,  Nor do they need to create a ZeroID before browsing zeronet sites.\nTo publishing pictures or text on a social site, yes, but to browse, no.\n\nYou should retest",
				"added": 1565363594
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 28,
				"body": "@ petrina\nWhat's your point? I can do the same thing with anyone who connects to my dark Zeronet proxy.\nVisiting a website does not constitute illegality.",
				"added": 1565360616
			}
		],
		"1565614209_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 41,
				"body": "There is chronic sadness and depression in the tribes of the jungle. But they know the remedy is social support structure rather than a fist full of pills. Our first world countries have little social support for our military veterans let alone the sad and disturbed, who will develop depression if left untreated.\n\nYour analogy give little to explain away the depression faced by those who live in severe poverty such as the children who live in the Bucharest, Romania's sewer system.",
				"added": 1565618208
			}
		],
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 42,
				"body": "Agreed, Life is not so fucking precious that we have to swallow every rotten apple.",
				"added": 1565619530
			}
		],
		"1565658736_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 43,
				"body": "> What I don't understand yet is how long Joe can wait before coming back online, before his page can no longer be accessed while he's offline\n\nSo long at least one other visitor has left their PC on or running a VPS instance to receive the incoming updates, the unprocessed updates can be compiled indefinitely until that user's Site Size Limit has been exceeded. \n\n> What if one million people send messages, causing many megabytes of data to just \"live in the ether\"\n\nThe messages wouldn't 'live in the ether', upon the visitor loading the site on a first visit, they would be prompted to increase the site storage limit as it has been exceeded. If the visitor chooses not to do this, the user should not be able to add any posts as there is no addition space left for their saved comment. If the user does extend the Storage Limit for that site, they would be able to post their comment, but unless others also increase their site limits, the site will fail to propagate to those who choose not to, or are unable to at that specific time, to extend the site storage limit.\n\n> But at the same time, there must be a longer \"grace period\" since nobody can be expected to be online all the time and servers are very problematic for a number of reasons (whether at home or in a data center)...\n\nNot true,, I've been running a Zeronet node in a VPS for over a year now to help seed various KopyKate videos and other zeronet content that I am fond of. Sure it had to have some restarts but the focus is more on redundancy. If I have a Zeronet VPS, and You have a Zeronet VPS out of hobby, and Joe has a Zeronet VPS out of research, those three VPS combined have enough up time to keep most material available well enough to supply a barrage of hit-&-run visitors. (Given the condition that all three VPS users are sharing the same social site or popular content)",
				"added": 1565666062
			},
			{
				"comment_id": 44,
				"body": "> [bvcfbfbcbcvd](#comment_25_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): hey all require photo id to have any kind of server\n\nNot all, A List of VPSs that accept Bitcoin http://cryto.net/~joepie91/bitcoinvps.html",
				"added": 1565672834
			},
			{
				"comment_id": 45,
				"body": "> [xcape2net](#comment_282_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  When you figure out how to do this, I would really appreciate a detailed tutorial.\n\nGo visit Kaffiene Search and search for 'tutorial'\nhttp://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/",
				"added": 1565710682
			}
		],
		"1565777740_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 46,
				"body": "Venezuela",
				"added": 1565792423
			}
		],
		"1565925178_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 47,
				"body": "A list of file-sharing sites on Zerowiki\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:file-sharing",
				"added": 1565964863
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 48,
				"body": "Even if this is sarcasm, we get it... Zeronet is now infested by whiny kids who consistently need their hand to be held and can not even preform a simple search of zerosites for a search provider to find zeronet development tutorials.\n\nI'm starting to think I enjoyed this place better when there were rumors of Zeronet being a Sharing Portal of Pedophilia.",
				"added": 1566051776
			}
		],
		"1566155811_12wsdvQbd5L9bTBKXGgYazbFcHNegJUNfG": [
			{
				"comment_id": 49,
				"body": "The lack of seeds and everyone who is using it has their client set to strict TOR . But between youtube ripping sites, direct download sites, and even direct sharing clients, there really is not a need not a large demand for a music site on zeronet. I see them more as a demonstration of the network's ability.",
				"added": 1566177283
			}
		],
		"1566256283_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 50,
				"body": "One of my favs, https://soundcloud.com/dubstep/soltan-jadu-premiere",
				"added": 1566313979
			},
			{
				"comment_id": 52,
				"body": "I know this is a bit excessive... but there's just so many to love!!!\n- [Lil Nas X, Cardi B - Rodeo (Not Your Dope Remix)](https://invidio.us/watch?v=vRRr6f1NqnM)\n- [MORTEN - Hypnotized](https://invidio.us/watch?v=Ky613bc_EJc)\n- [Mija - Secrets (Crankdat Remix)](https://invidio.us/watch?v=xCVXl3rI-MU)\n- [POKEMON GOLD/SILVER (CG5 Trap Remix)](https://invidio.us/watch?v=OY9TCdHGatg)\n- [Fortnite Theme Song (SKY Remix)](https://invidio.us/watch?v=uYMGVLFFWv4)\n- [DRAGON BALL SUPER Ultimate Battle (Trap Remix) (Goku VS Jiren)](https://invidio.us/watch?v=4qrI8x-pCNo)\n- [Rick and Morty - Evil Morty Theme Song (Feewet Trap Remix)](https://invidio.us/watch?v=mb-XCaA2HZs)",
				"added": 1566346148
			},
			{
				"comment_id": 56,
				"body": "> [dkeyzjkeys](#comment_23_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): Try to link with indvio.us , so we don't see ads.\n\nIs that a youtube proxy? I am unaware of this website 'indvio.us', as visiting directly reveals nothing and search results come up empty as well. PS: I've updated my comment with what direct download links that I could find to help avoid adverts.",
				"added": 1566396524
			},
			{
				"comment_id": 58,
				"body": "> [fzorkas](#comment_4_1B8BPkJ3tf9iyQcoh9mPoocuWrvnBgn2yT): it does appear to avoid lots of the YouTube crap\n\nI thought it was its own separate platform. I had no idea i could use the 'https://invidio.us/watch?v=' prefix + youtubeID to filter out all of the tracking nonsense.",
				"added": 1566449191
			}
		],
		"1566251733_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": [
			{
				"comment_id": 51,
				"body": "I highly recommend [Brave Browser](https://brave.com/) on mobile devices. Not only is there a [Github source](https://github.com/brave).\n\nI've switched to it because I got tired of websites using the mobile browser using advertisements to hide the webpage i was viewing, or other malicious attempts to hijack my phone with popups, adverts, and other potential exploits that can cause system or application stability problems.",
				"added": 1566323968
			},
			{
				"comment_id": 53,
				"body": "> [littlepaw](#comment_13_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3):  Really? Brave shills have already made it here? \n\nWhere in the original topic did you state your exclusions? This might come as a shocker, but from my perspective, I was giving a browser suggestion to a topic that was allegedly open to recommendations given the whole \"but I'm interested in what do you guys use. What are the options, even?\" bit.\n\nMaybe your next request for recommendation should include some of those requirements before you expect readers to preemptively be aware of your preferences as little ungrateful shits such as yourself are often the reason as to why zeronet veterans are so cautious before providing any assistance to others.",
				"added": 1566347183
			},
			{
				"comment_id": 55,
				"body": "> [littlepaw](#comment_14_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): Yeah, you're right. I should have asked for no paid recommendations in my original post. I wrongfully assumed that was implied, I'm sorry.\n\nDon't be sorry, some fuckwit retards in this world simply can not be helped.",
				"added": 1566396256
			}
		],
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 54,
				"body": "To be fair, I had all these random posters muted and I ended up removing the mutes a few days later because the ZeroTalk News feed was pretty much dead besides a few tech support topics. At least with these off topic conversations there is quite of bit of activity, interaction, and ultimately entertainment, being generated.",
				"added": 1566395999
			}
		],
		"1566352663_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 57,
				"body": "> [holeyhouseofair](#comment_63_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): Love thy neighbour\nLife is not so fucking precious that we have to swallow every rotten apple.",
				"added": 1566396902
			}
		],
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [],
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 60,
				"body": "Bump due to the latest ZeroTalk spammer.",
				"added": 1566924797
			},
			{
				"comment_id": 61,
				"body": "There is a video on Kopykate that shows how to issue a global mute. Global as in the mute will work across all Zeronet sites. \nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2\n\nAlso, for the three dots to appear on the ZeroTalk page, one must hover their pointer on the username of the topic creator.",
				"added": 1566926167
			}
		],
		"1566984204_1DWcgvD7uuH61JxvRZnHhgjwdT4FQnXhqG": [
			{
				"comment_id": 62,
				"body": "Have you tried printing out the page or comment that you have a complaint with and presenting it to your local police department for a good laugh?",
				"added": 1567000881
			}
		],
		"1566920820_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 63,
				"body": "How would a reader go about issuing a global mute of a nanasi username when nanasi.bit does not resolve to an ID provider.",
				"added": 1567001871
			}
		],
		"1566953714_17YLe3Jg9YRvVknLPRrtzuKcTs43TKkfhz": [
			{
				"comment_id": 64,
				"body": "\"Why is it so easy to fool you\" asks the guy who expected 40 ZeroTalkers to trigger on his comment of troll-fail.",
				"added": 1567003692
			}
		],
		"1567013011_1JM6gfdXN5wnxLR2LmUuvx4216mtPzXmzB": [
			{
				"comment_id": 65,
				"body": "Russian audiobooks\nhttp://127.0.0.1:43110/1N77kxgd29cR8w9xt481JDJEtYdX1hCqAR/",
				"added": 1567038174
			}
		],
		"1567232126_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 66,
				"body": "That's why it is so important to discuss and plant the Crumbs of Epstein & Darren Indyke in topics that discuss Terrorism, Drugs, and Trafficking. They are called Easter Eggs.",
				"added": 1567260759
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 67,
				"body": "I've been a zeronet adopter for a very long time now and I have always found it strange that development was slow on a network that has this much potential. For a long time now I have agreed with gitcenter in that the project should be opened up to more people who have the want & desire to contribute their coding efforts.\n\nI know nofish is not the best coder out there, I see it as an opportunity squandered as we are all susceptible to burnouts.",
				"added": 1567264328
			}
		],
		"1567341551_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 68,
				"body": "Here is his profile (with image) on Ted Talk\nhttps://www.ted.com/speakers/tamas_kocsis",
				"added": 1567346739
			}
		],
		"1567130399_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 69,
				"body": "From my understanding TOR:Available  means your Zeronet client can communicate with other zeronet clients that are set to TOR:Strict & TOR:Available. This is a benefit for the network as the TOR:Available client will allow TOR:Strict clients to communicate with TOR:Unavailable clients by using the TOR:Available client as a proxy for data transmission.\n\nOtherwise it uses non tor communication for file-transfers and tracker lookups. If the user has a desire for the tracker connections to be masked or proxy, that can be done in the zeronet configuration with a tor or http proxy.",
				"added": 1567347724
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 71,
				"body": "This was a well needed demonstration as some actor hired by some deep state agency would have done far worse  such as creating a topic per zeroID and flooding the front page of zeronet making it unreadable and virtually impossible to mute every zeroID which would practically kill the utility of the default forum without some behind-the-scenes intervention by nofish. (But with enough money, he could fall off the face of the planet just as easily.) \n\nThis is just some things to consider if anyone here really expects this network to challenge the current power holders of the currently established status quo.",
				"added": 1567350992
			}
		],
		"1567424767_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": [
			{
				"comment_id": 72,
				"body": "I upload videos to Kopykate all the time and I'm able to close my tab once the content is published. (But I do have a zerobox that runs to keep the stuff I share available.",
				"added": 1567433930
			}
		],
		"1567549379_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": [
			{
				"comment_id": 73,
				"body": "From what I understand of it 2/4 means 2 peers are actively seeding at that very moment, while four peers have been seen since the last peer refresh.",
				"added": 1567558000
			},
			{
				"comment_id": 74,
				"body": "> [katian](#comment_31_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx): i saw this morningg Peers 6 / 4 [...]\n\nI see this too when I release popular stuff. I suspect it means (Number of connected peers / delay in updating the current peers)  (sometimes a page refresh will fix it) or it is somehow counting the connected peers twice. I'm not a coder of javascript, All I can accomplish is amateur c#.\n\n> [kaffie](#comment_1100_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Kopykate peer counts never seen to work right for me.\n\nFor my own stuff that I seed (in the proxies) the count seems right to me. But, for my local client that I constantly turn off and on for a as needed basis, not so much.",
				"added": 1567572206
			}
		],
		"1567571648_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 75,
				"body": "Wow! I have to hand it to you on this one, but you're making that sound like a really great idea! In fact, you should show us the champ that you are and set the bar for us all as you go first. \n\nI could just see it now, there would be so many lols & pepez in your grand honor.",
				"added": 1567572888
			}
		],
		"1567601358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 76,
				"body": "> [discriminatr114](#comment_7_1HtE91fqZYffGTb8m9LbgR4S1adESxP8nx): They need to put that shit on zn...\n\nOften the problem arises with maintenance as the currently blocked sites move to new ones to bypass said blocks while letting the known ones expire. I don't see anyone here really having the time to scrape various sources to compile a usable list to be published on zn. Instead, just use a reverseproxy site like http://127.0.0.1:43110/unblocked.bit",
				"added": 1567608311
			}
		],
		"1567569304_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 77,
				"body": "This is one of my concerns as well and I always thought the same thing in that there is nothing to prevent site publishers to release a zeronet site, let it become popular, and then update the site with an image or links that call resources from the clearnet with tracking tags.\n\nI know on many sites clearnet resources are notated with a ⚠️ char, but there really should be an option on each sites slide out menu to allow or revoke that sites access to clearnet resources written within zeronet and have such ability disabled by default on newly visited sites.",
				"added": 1567608725
			}
		],
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 79,
				"body": "After 19 years of resilience, I doubt sharing the resource with anyone here will change anything.\n\nhttps://torrentfreak.com/paypal-bans-file-sharing-classic-soulseek-after-14-years-151205/\n(there is a popular What.CD channel there)",
				"added": 1567613632
			}
		],
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 80,
				"body": "We are all here, is that not something?\n\n> [436sdwd](#comment_6_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): ZeroNet still relies on trackers for peering. DHT hasn't been implemented yet. \n\nA zeronet client that has the bootstrapper addon enabled is able to become a tracker and propagate the list of other bootstrapped trackers to other clients, which works quite well.",
				"added": 1567704177
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 81,
				"body": "I agree, let us forget about these non violent offenses such as copyright infringement! Between predators like Roger Ailes and Jeffrey Epstein, there is a whole line of pikes that are awaiting their rightful companions..\n\nLife is not so damn precious that every rotten apple has to be eaten, and the world is already a better place without them. http://127.0.0.1:43110/big.kopykate.bit/?Video=1567780439_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1567719355
			},
			{
				"comment_id": 85,
				"body": "> [bigbadbob](#comment_593_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Clownworld\n\n I have a suspicion that the general sum of humanity has a untold infatuation with misery and suffering. How often do people watch movies, television shows, and video games that detail all sorts of suffering as presented as forms of entertainment. \n\nEven the now famous Ghislaine Maxwell is able to walk among us as a free individual even though many admit to being groomed by her. But this is not nothing that many haven't already suspected. That rampant pedophilia, consecutive rape, and extensive drug use is acceptable when it concerns the prestigious wealthy.",
				"added": 1567792948
			}
		],
		"1567722717_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 82,
				"body": "Submitting my site here helped me when I was launching sites and didn't yet have my own zerobox.\n\nNew ZeroNet Sites - Submit and help seeding new sites \nhttp://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n",
				"added": 1567723265
			}
		],
		"1567774655_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 83,
				"body": "__Correct procedure to delete a zeronet site:__\nTo be able to delete created sites, you have to open your '0' side bar while visiting that site, Uncheck \"This is my site\", then you can click the Delete button, then select the option to either delete the site (or to blacklist it) to remove the site from your zeronet client.\n\nMany times the \"you cannot delete your own site\" message appears simply because that person has \"This is my site\" checked and the removal denial is a precautionary measure against the removal of owned sites by accident.",
				"added": 1567778589
			},
			{
				"comment_id": 84,
				"body": "> [dmd](#comment_11_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): so you know how companies spend millions of dollars on a new product and then just as a final check they have a trial where the general public tries it out. Then they find out that the average person can't figure out their product.\n\nZeronet is loaded full with these. Sadly, only nofish can make final changes to the project. Many have pleaded for him to open the project up to others, but that's a whole different topic.\n\n> [dmd](#comment_11_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): Yeah, well the \"0\" side bar is little like that because while the data is great and the graphics are slick.... it is nearly impossible to see that there is a pull down bar to the right of the world globe.\n\nI agree, I always wondered why the '0' icon didn't have some left arrow next to it to give a hint of the slide out feature.\n\nlike:\n\n← 0",
				"added": 1567785227
			},
			{
				"comment_id": 86,
				"body": "> [dmd](#comment_12_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): randomshits.. since I have your attention\n\nMany (including myself) grow very tired of repeating ourselves concerning information that can already be found within the network and zeronet search oriented sites. If I was you, i would start at [Zeronet Dev Center http://127.0.0.1:43110/devcenter.bit/",
				"added": 1567793183
			},
			{
				"comment_id": 87,
				"body": "> [dmd](#comment_13_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): I am sorry you are having to answer the same question over and over again, but it is only going to get worse. \n\n\nTo copy almost any zeronet site, simply browse to the site, pull open the Right '0' and then click the small text that reads 'OPEN SITE DIRECTORY\"\n\nThis will take you to the local file path on yoru pc that contains the website data that you are viewing.\n\nTo make a copy, simply create a new empty site on zeronet, goto that sites file path by using the \"OPEN SITE DIRECTORY\" clickable text, and then copy the data from the site you want to copy to the site you just created.\n\nNow you will be able to modify the site's files and sign & publish the site as you are the owner. Of course this get's complicated when concerning merger sites like ZeroMe and social sites that are riddled with comments.\n\n'Cloning' is a feature that can be enabled by the site creator by altering that site's content.json file by altering the values of\n\n \"clone_root\": \"\",\n \"cloneable\": true,\n\nWhere root points to a copy of the site before any extra user data has been added.(Like copying a social site but without the user comments)\n\nI will admit that one large drawback from the expansion of Zeronet is the learning curve and lack of documentation that developers must overcome.\n\nPS thanks GitCenter, I didn't notice your reply before mine",
				"added": 1567795422
			},
			{
				"comment_id": 88,
				"body": "> [dmd](#comment_16_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): I get a \"Content publish failed\" error.\n\nAs gitcenter stated, this is because nobody else besides you is seeding your site, so it can't be published to anyone.\nThe message will go away once your site has other people seeding it which will happen once you share the link on social forums and make it popular.",
				"added": 1567807711
			}
		],
		"1567851023_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 89,
				"body": "Sounds like American propaganda!\n\"Want to spread your voice to the world? Join Facebook!\"",
				"added": 1567869583
			}
		],
		"1567892030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 90,
				"body": "After I realised how well Zeronet ran on a Raspberry Pi 3B, I moved it over to a Cloud VPS that offered 512mb of Ram and a 20 GB SSD for 3.50 a month which I now use as my main portal.",
				"added": 1567895699
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 91,
				"body": "> [defconzero](#comment_9_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE):  I think he's dead, due to the inmate reports of his screaming for his life\nBut how can someone scream while they are hanging themselves, often the only sounds they can make is a gurgle.\n\n> [kidcourageous](#comment_103_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Das Juden take care of their own.\nEpstein would have been the first suicidal billionaire that I have ever heard of. I can only figure that excessive wealth and sex is the leading cause of depression.\n\n> [undisclosed](#comment_63_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Video of Jeffrey possibly back on pedo island\nThanks for the share!\n\n> [dtek](#comment_14_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ): good chance he was silenced. he knew too much. \nThere have been men of lesser wealth such as El Chapo who have been able to escape from even higher security facilities. An empty cell would lead to a manhunt, but a body swap would only lead to questions of incompetence.\n\nMy question is why haven't the multiple islands been raided, searched, and investigated. I highly doubt he was the only permanent male resident who was committing acts of pedophilia on the island.",
				"added": 1567951406
			}
		],
		"1568118783_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 92,
				"body": "Trolls are not really a concern as they are easily dealt with through the use of forum mutes, [global mutes](http://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2),  and user blocklists such as [Kaffie's Spamlist](http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/).\n\nA true troll attack that I would be concerned about would be one the renders the forum inoperable such as a random username topic flood that could originate from some highly funded deep state(s).\n\nI suppose if such a problem does arise, the site owner could revoke the usage of any new or existing ZeroID and instead require a different provider that uses a less susceptible means of username registration.",
				"added": 1568124923
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 93,
				"body": "> [xcape2net](#comment_374_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  But it has degenerated a lot in the last couple of months.\n\nBetween my personally issued mutes and  Kaffie's Spamlist I can't notice any difference. On Zeronet, trolls have their ability to troll, but I don't have to see it. It is rather nice. If one day that troll wants to grow up and attempt to have some serious discussion, it's too late, fuck em'.",
				"added": 1568125695
			}
		],
		"1568052562_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 94,
				"body": "Here is what I did for my headless Ubuntu 19.04 server.\n\nGuide moved to ZeroWiki to preserve ZeroTalk quota\nhttp://localhost:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerobox",
				"added": 1568130148
			},
			{
				"comment_id": 96,
				"body": "> [filips](#comment_190_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Everything is described here \n\nGuide updated to work with python3 version and cleaned up the prior (irrelevant) conversation because I'm 52 / 100 on quote, thanks.",
				"added": 1568133187
			}
		],
		"1568208722_1HnepkYQUYxzgLMr1SYhWURoR2vs9NENFL": [
			{
				"comment_id": 97,
				"body": "What is the address of your site?",
				"added": 1568209774
			}
		],
		"1568220374_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 99,
				"body": "It's not a plugin\nhttps://github.com/ytdl-org/youtube-dl/\n\nAlso I attempted a new installation of it in  VM which yielded the same error.",
				"added": 1568220530
			},
			{
				"comment_id": 100,
				"body": "Downloading from Soundcloud and YouPorn sites are still functional, just not youtube",
				"added": 1568220762
			},
			{
				"comment_id": 101,
				"body": "> [styromaniac](#comment_1022_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): All apps like it no longer work.\n\nDo you have a link to an article that talks about the breakage?",
				"added": 1568220795
			},
			{
				"comment_id": 102,
				"body": "> [styromaniac](#comment_1023_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):  I think it was an update last night to YouTube.\n\nI tried keepvid.pro an hour ago and again just now and it was able to get me my video that Youtube-dl failed on, hence why I thought it was just me. Maybe keepvid fixed theirs already.",
				"added": 1568220948
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 103,
				"body": "First it was the Russians, now it's Israel, while the truth is that US agencies and local law enforcement have been using stingray devices to intercept cell phone transmissions for a long time now. There's even a US government project to fly one on a drone to intercept large areas of transmissions that was fairly called 'Operation Shenanigans'\n\nhttps://www.aclu.org/issues/privacy-technology/surveillance-technologies/stingray-tracking-devices-whos-got-them\n\nFederal Agencies Known to Use Cell Site Simulators:\nFederal Bureau of Investigation, Drug Enforcement Administration, U.S. Secret Service, Immigration and Customs Enforcement, U.S. Marshals Service, Bureau of Alcohol, Tobacco, Firearms, and Explosives, Internal Revenue Service, U.S. Army, U.S. Navy, U.S. Marine Corps, U.S. National Guard, U.S. Special Operations Command, National Security Agency, Customs and Border Protection",
				"added": 1568426037
			}
		],
		"1568442422_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 104,
				"body": "Humanity is a pestilence that attempts to destroy all that it touches.",
				"added": 1568468987
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 105,
				"body": "The majority of people who use such terms have little understanding of their meanings as they attempt to classify an entire group of people into one opposing viewpoint. I always find it comical to read such comments when being a user of a darknet is a liberal act on its own.\n\nThe opposite of a liberal is a conservative, so maybe the OP should stop liberating their free speech and conform to the Institutionalized and conservative viewpoints of the well established Facebooktopias of the world.",
				"added": 1568469517
			}
		],
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 106,
				"body": "Here is a chance for you to try out this 'setting up a dedicated headless box' guide.\nGuide on ZeroWiki http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerobox\n\nThe best of luck to my fellow retard.",
				"added": 1568509639
			},
			{
				"comment_id": 107,
				"body": "> [zenanon](#comment_11_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Personally I'd set up a headless box on linux and just...\n\nWhile that may sound effective, it doesn't sound very retard proof. 😛 \nI really don't expect much skill beyond an ability to copy & paste lines of code from a guide and hope for success.\n\nMeanwhile on Planet Earth in the year 2020...",
				"added": 1568532572
			},
			{
				"comment_id": 108,
				"body": "> [alternedleanings](#comment_17_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): What i'm working toward is a retard proof zeronet distro, [...] Even better would be if we could distribute small pre-configured systems that the user only has to plug into their network,\n\nBig dreams with small chances of success. I like that. We all have to start somewhere, even the retards.",
				"added": 1568561710
			}
		],
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 109,
				"body": "Once I realised that companies will use inferior ingredients and inexpensive methods in their meal preparations of processed foods, I took an interest in preparing my own meals for myself and the family. I don't blame these companies as profit is the bottom line and there is not enough employees to supervise the entire automated food process. \n\nI do admit that after making the switch, about 2 to 4 hours of my day are spent in meal preparations cooking from fresh ingredients. But it is worth it when considering the chances of developing an illness related to colon cancers from  various preservatives, diabetes from hidden high fructose corn syrups, and heart diseases from fat being used as a inexpensive food filler,  the decline is significant simply because you are aware as to what you are eating.",
				"added": 1568571277
			},
			{
				"comment_id": 110,
				"body": "> [dmd](#comment_27_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1): No, that's called answering the OP's question you dumb fucking twat. [...] Good luck ZeroNet, your going to need it with people like this.\n\nIt's more like \"Good luck [Earth], your going to need it with people like this.\" as we are all trying to live out our lives  happily in a clown world.\n\nIt's not such a big problem as it seems. Here on Zeronet, the flooders have their ability to flood, the spammers have their abilities to spam, the trollers have their ability to troll, and the retards have their ability to be retarded. And while they are free to create their own ZeroTalk forum where such activities are permitted, encouraged, and optionally managed by the forum owner, the reader can always give a mute and never be bothered by that user again.\n\nIt would be like Alex Jones still maintaining his Youtube channel but nobody was ever forced to watch it.\nI don't care about what the bastard has to say so long as nobody takes him seriously.",
				"added": 1568642248
			}
		],
		"1568656823_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 111,
				"body": "If Zeronet becomes popular with content creators and specialized platforms, I would rather opt to give direct contributions through a service like Patreon rather than allow for advertisements. Advertisements often cater to commercial enterprises and their presence often fucks things up. Ergo, the current state of the clear net and the desire to adopt a decentralised network in the first place.\"",
				"added": 1568678269
			}
		],
		"1568583688_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 112,
				"body": "Op is a moron, what makes you think your next existence will be any better than this one. And what have you done to deserve any better of an existence than the one that has been already given to you.  Being able to fail OD with access to vodka and xanax? Sounds like a fucking luxury!\n\nWho knows, maybe in your next life you will be reborn as a female in some shit area of China only to get raped as a teenager while at a music festival and then be willingly sold off to the sex trade business to spare your family name the dishonor of an illegitimate pregnancy to deal with. Then the only relief you will be granted is the dose of heroin before your session with the next arranged client.\n\nAfter all, some poor self loathing soul is going to have to fill those shoes. May as well be yours, right?",
				"added": 1568679859
			},
			{
				"comment_id": 118,
				"body": "> [pyromisanthrope](#comment_23_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): my life more or less, so instead of being a keyboard warrior, go fuck yourself you privileged douchebag son of a bitch [...] Oh and, read a book, there is no such thing as, \"Rebirth\", you illiterate piece of shit. [...] You neo-neanderthal piece of shit\n\nWell, it seems my comment must have struck a nerve.  Nice to see that you have the fighting spirit back in you. \n\nAnd to think, so much quantum data in the known and unknown universe and it is still difficult for you to believe that there may be a near identical copy of your own quantum data or a copy of your brain waves that makes you, 'you'.. Random bits of proteins can only be arranged so many times before duplicates and similarities to previous combinations start to arise.\n\n> [pyromisanthrope](#comment_23_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): I would appreciate if you shoved a bunch of cocks up your mouth, and your ass \n\nI've done that a few times already now, It's actually quite a fun time. Living life (including my mouth and ass) to the 'fullest' and all of that.",
				"added": 1568731412
			}
		],
		"1568626187_116GwtLxi8HFbD3HTVWHHbW5fa1R7sSRQT": [
			{
				"comment_id": 113,
				"body": "Updated 38 min ago. I have witnessed the site going for more than three years now. I don't really expect it to one day fall over and die any time soon.",
				"added": 1568680551
			},
			{
				"comment_id": 119,
				"body": "> [toyata](#comment_104_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): are we now able to \n\nI'm not sure I understand what you are asking. A 'save as zip' option can be used from the three verticle dot menu on each site. Click and select 'Save as zip', but I'm pretty sure this will include any user content that has been added to the site.",
				"added": 1568739559
			}
		],
		"1568607154_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 114,
				"body": "My ISP charges me an additional 20 on my bill if I go over 1 TB, so I just use 5 of that and put zeronet on a vps that comes with 100gb of bandwidth a month.",
				"added": 1568681536
			},
			{
				"comment_id": 116,
				"body": "As far as I know there's not a way to establish a data limit on zeronet. If you did, sites would fail to publish or update. You kind of have to just test the waters and judge it from your stats page. On my proxy ZeroTalk and ZeroID do about 1gb each of transmission data on a weekly basis, so it just goes up the more you host and seed.\n\nMaybe it would be nice to have a site auto-toggle to a paused state if it went past a specific amount of bandwidth allotment, but then again that would just be another data set to keep track of and manage, so meh.",
				"added": 1568683214
			}
		],
		"1568598626_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 115,
				"body": "> [trustedleanings](#comment_7_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX): if i'm seeding other peoples shady content? I didn't sign it, am I really responsible for it?\n\nYes, but just use some damn common sense. Browsing Zeronet is no more dangerous than browsing the TOR network or even some really shady porn sites on the clearnet. Not many people browse the internet properly and decide to let their browsers store their browsing cache for extended periods of time which makes them just as liable as hosting illegal content on zeroent.\n\nSure TOR is great at keeping your identity private both on zeronet and the clearnet, but the point is just use common sense. One thing I have noticed on Zeronet is that the pedos are quite meticulous at properly naming and identifying the material they share, so it is a bit difficult to stumble upon it unless you go looking for it. (Blindly clicking on every site in ZeroSites for example)\n\nBut yes, if you are the owner of a piece of hardware that is making available illegal content, you will likely be responsible. The question is one of are you willing to stand up for your right to share said material. As there are grey areas such as sharing educational films for educational purposes.\n\nTL:DR Yes, you are responsible, but every tool has it beneficial uses and associated dangers.\nJust don't be that girl trying to take a selfie near a cliff and you will fine.",
				"added": 1568682240
			}
		],
		"1568598141_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 117,
				"body": "Getting a territorial dog that is on a leash that is able to reach to the door is a great way to prevent anyone knocking on my door.",
				"added": 1568730406
			}
		],
		"1568735040_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 120,
				"body": "I thought KaffieID was the only ZeroID alternate. It is nice to have more to choose from so I added it to my zerobox.",
				"added": 1568739858
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 121,
				"body": "If the Feds are reading this now then I would just like to say \"Shame on You!\"\nHow dare you consider the criminality of such non violent offenses such as copyright infringement when men like Jeffery Epstein or any of his associates can't even be brought to justice.",
				"added": 1568808603
			}
		],
		"1568782020_14dLR39SjPzrhXEJc2m81SEndzkijn9Hao": [
			{
				"comment_id": 122,
				"body": "Judging by the domains listed in ZeroNames, 0play.bit and playmovies.bit also redirect to the same site\n\nhttp:127.0.0.1:43110/0play.bit\nhttp:127.0.0.1:43110/playmovies.bit",
				"added": 1568818141
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 123,
				"body": "I love zeronet because it is still a new and young network whos plains are still ripe with magic and potential. The boundaries of zeronet are only limited to the potential of the code sorcerers who wield and develops it. There are so many zites on this network that are shining proof of concepts and would serve as a great starting foundations while still being imperfect enough to scream a need of TLC and improvement.",
				"added": 1568818643
			},
			{
				"comment_id": 141,
				"body": "> [gagger](#comment_3_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG):  I am from China, you know\n\nWelcome to the zeronet family.",
				"added": 1569165542
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 124,
				"body": "So does Microsoft, and your smartphone, and the majority of the games people play.  But then again I don't see anyone here plotting to undermine the oil, pharmaceutical, or agriculture industries either.\n\nFirefox is the last thing to worry about when the latest 2bit mobile game or designer app wants unhindered access to all smartphone privileges that users so easily grant. Big brother is not there to watch you, but the corporations who found it profitable to sell you.",
				"added": 1568902135
			}
		],
		"1568856272_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 125,
				"body": "a user named 'trustedlearnings' is unable to comprehend what they read. You're going to have one hell of a time here.",
				"added": 1568902320
			}
		],
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 126,
				"body": "> and his cronies. And no, they get away with it because the people in power wanted it to happen.\n\nJust like (not dead) Jeffery Epstein.",
				"added": 1568903660
			}
		],
		"1568849713_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": [
			{
				"comment_id": 127,
				"body": "If my memory serves me correctly, the site owner only needs to include the `favicon.ico` file in the site's root directory and sign the site for the zeronet client to seamlessly apply the favicon.",
				"added": 1568904188
			}
		],
		"1568910089_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 128,
				"body": "Well nobody can really place blame when the television and gaming industries not only portray violence, murder, and other acts of crudity as forms of entertainment, but they extensively capitalise from it. So things are looking pretty normal to me.",
				"added": 1568911280
			}
		],
		"1568982640_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": [
			{
				"comment_id": 129,
				"body": "I sent you 0.03 NMC to the address you specified which is enough to register a domain. You're welcome.",
				"added": 1568987714
			},
			{
				"comment_id": 132,
				"body": "> [filips](#comment_213_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Also, for how long, in years, I will be able to renew domain with 0.03 NMC?\n\nOnce you register the domain and added the json tag needed for zeronet to identify the domain entry the registration is indefinite, additional subdomains can be added by updating the json entry for that domain which will cost more NMC each time a request is sent. So make sure there are no mistakes in the original json entry as the FIRST_UPDATE is free.\n\nI'm the owner of the blocklist.bit domain and here is what the json entry looks like to register the subdomains of the main zeronet users who have published one. Feel free to use this as an example. There is also an example on the [ZeroNames](http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/) site.\n\n\n```\n{     \"name\": {\"formatted\": \"blocklist.bit\"},\n    \"bitcoin\": {\"address\": \"\"},\n    \"zeronet\": {\n        \"\": \"1FiLTerEAHp7UT8Aw2zQBypcm5T14kgZDa\", \n        \"ssdifnskdjfnsdjk\": \"13CgSQeywg2ius5pjXVCk7dKUCRkz5xvW3\",\n        \"styromaniac\": \"1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1\",\n        \"balancer\": \"1HnyzU52qiJBW4LxHHzDJHiTceWrqMhh69\",\n        \"kaffie\": \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\"\n    },\n    \"ns\": [\"ns1.domaincoin.net\", \"ns2.domaincoin.net\"]\n}\n```\n\nAlso sent some 0.03 NMC, lucky day for you.\n\nAdditional Notes:\n - it is still possible to lose OWNERSHIP of your . bit domain if you let it expire and then someone else registers that domain. While they will not be able to undo the previous name registration they could append additional and potentially malicious site addresses to the subdomains.\n - I would recommend alternate methods of domain registration such as registering the address with the less problem prone [Name.YO](http://127.0.0.1:43110/1NAMEz7stUPZErkV1d3yLkVWQFa4PTqDNv) zeronet site.\n\n",
				"added": 1568999688
			},
			{
				"comment_id": 135,
				"body": "> [robione](#comment_306_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): use Name.YOhttp://127.0.0.1:43110/1NAMEz7stUPZErkV1d3yLkVWQFa4PTqDNv/\n\nI hope they opt to use Name.YO as well, but I didn't mind giving them two a 'bit' of experience on my dime. (pun intended)",
				"added": 1569001941
			},
			{
				"comment_id": 137,
				"body": "> [kusoneko](#comment_49_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): Why support something that's basically dead at this point in time?\n\nMaybe Nofish was waiting for something better to come along or be developed by other members of the community. But that's just the optimistic side of me.",
				"added": 1569004881
			},
			{
				"comment_id": 138,
				"body": "> [kusoneko](#comment_50_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): so we should consider whether keeping Namecoin, a DNS system that is largely dead is worth it, especially since I'm assuming ZeroName requires that someone, likely nofish, runs a full NMC node\n\nI would support this suggestion and would like to add that.\n\n  - The name updates are not consistent as I updated the json of blocklist.bit to include kaffie's spamlist and I'm sure Zeroname will reflect the addition when nofish decides to use his script to update the entries as the last recorded activity was September 11th.\n  - many of the entries that have been populated was from the attempts of a .bit domain squatter who was seeking to exchange registered domains for btc. But too bad for him he never realised that the original json entry was permanent which means the spam of domains would be forever locked to his squat zite.\n  - as mentioned by others, NMC is practically impossible to obtain unless you join a mining group and mine it yourself or affluent with virtual currency exchange sites. (Not many people are) The NMC that I'm sitting on was obtained when the stuff could be purchased on ShapeShift\n\nJust my opinion of the naming system.",
				"added": 1569012072
			}
		],
		"1568995610_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 130,
				"body": "Everyone wants to blame foreigners and their unfortunate situations instead of the results of capitalism that have put them in to those situations in the first place.\n\nAlso why are you still listening to mainstream propaganda? That stuff will rot your brain.",
				"added": 1568998396
			},
			{
				"comment_id": 133,
				"body": "That's why I mute you fools, waste of my time and chat quota.",
				"added": 1569001072
			},
			{
				"comment_id": 136,
				"body": "self righteous? Nah, I'm just highly allergic to detrimental retards as they make me irritable.",
				"added": 1569003440
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 131,
				"body": "I wouldn't be surprised if when we die we wake up from a helmet and are immediately asked, \"Now do you understand the reasons we have abolished and now forbid the ideals and practices of capitalism?\" \n\nIf they waker answers Yes, they are allowed into their new society of community bonds while those who answer 'No' are sent right back into the \"End Days of Earth\" simulation to continuously experience mankinds' destruction due to their own greed and tribal mentality.",
				"added": 1568998953
			},
			{
				"comment_id": 134,
				"body": "> [k0hlr4bi](#comment_11_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): The hard limit of the speed of light is believed by some to be hardware limitation of a simulation.\n\nIt really does make one think when they attempt to understand the fundamentals of concepts such as quantum entanglement which is able to transfer data far beyond the speeds of light. (which is suppose to be impossible)",
				"added": 1569001345
			},
			{
				"comment_id": 139,
				"body": "> [k0hlr4bi](#comment_14_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): it just uses a 4th or higher dimension to \"fold\" our 3D world, \nThe explanation alone should give hint that humans in general understand very little of the true nature of the realities we live in. It is a reason why I give pity on those who believe they are so small that we must be the only intellectual beings in this vast universe while being trapped on this dimension, all while we humans attempt to create our own form of general intelligence that is built out of a potentially limitless (and exponentially shrinking) array of microprocessors & sensors.",
				"added": 1569076272
			},
			{
				"comment_id": 142,
				"body": "> [robione](#comment_307_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Fractal.\n\nYou see this over and over throughout life, from the very small seashells to the development of the galaxies and cosmos. Is it really so hard to believe that the realities we experience may follow the same rules.",
				"added": 1569165917
			}
		],
		"1569073039_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": [
			{
				"comment_id": 140,
				"body": "I am having the same problem, it is not you. The last time ZeroNames was resolved it was Sept 11, it seems nofish lowered the frequency of the update otherwise my newly updated entry of kaffie.blocklist.bit would resolve.\n\nI didn't even bother to think the update frequency was lowered before sending you that 0.03, another reason to use Name.YO",
				"added": 1569076693
			},
			{
				"comment_id": 168,
				"body": "> [gagger](#comment_2_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG):  can not visit my site\n it looks like ZeroNames is updating again\nhttp://127.0.0.1:43110/tuili.bit/ successfully resolves.",
				"added": 1569425753
			}
		],
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 143,
				"body": "Hi, I clicked random opponent and it says\n'Please wait till someone wants to play.' but nothing happens.\n\nWhile creating my randomshits@kaffie.bit id it gave this error message but allowed me to continue:\n\nContent signing failed\nPrivate key not found in sites.json\n\nPS does this need WebRTC? I have that disabled if so",
				"added": 1569166716
			},
			{
				"comment_id": 144,
				"body": "> [cactusdragon](#comment_26_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): ok do it the friend way\n\nI entered cactusdragon as friend, now ask you to do same",
				"added": 1569166778
			},
			{
				"comment_id": 145,
				"body": "> [cactusdragon](#comment_28_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): help\n\nI wish I could, I don't know javascript, just C#",
				"added": 1569166946
			}
		],
		"1569149074_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 146,
				"body": "Wow guy! It is hard to take your long explanation and analysis seriously about some reaction to pheromones only to then discredit your own viewpoint by saying ' Children don't really produce much if any pheromone'.\n\nThe truth is pedophiles are addicted to the predatory nature of their actions and their ability to groom an individual into tolerable and receptive acts of abuse. It is the same thing as radicals giving children improvised explosives and then telling them the backpack will protect them.\n\nChild Predators will find colorful excuses to excuse their predatory tactics against children. pheromone have little to do with it. My proposal means of treatment would be the same as another zeronet user recommended, castrate them.",
				"added": 1569168531
			},
			{
				"comment_id": 149,
				"body": "> [aspidochelone](#comment_206_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): P. S. You ought to know by now that castration is NOT a sure cure for sexual abusers -- especially not the predatory sort you describe who are not simply succumbing to their desires.\n\nMaybe not, but that is still my opinion and I have yet to be convinced of any better solution or deterrent.",
				"added": 1569177397
			},
			{
				"comment_id": 152,
				"body": "> [side](#comment_10_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3): It seems to me there is some hidden reason they are being demonized so heavily\n\nMaybe because an adult taking predatory action against mentally undeveloped children is one of the most heinous crimes imaginable?\n\nIt is like torturing someone and they saying \"This is what I have known all my life, and it is not the worst part of it, so groom me more please.\" as they have a scientifically proven undeveloped mind that is incapable of adult reasoning and decision making. \n\nMore research needs to be done into it yes, but with such cases like Roger Ailes, Jeffery Epstein, and all the other famous and wealthy sadists still fresh in the minds of society, it seems it will forever be a sensitive topic.\n\n> [side](#comment_10_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3): Holy shit you are retarded. Some are (especially women for some reason?) but most... not so much\n\nIf you partially agree with me would not that make me partially retarded?",
				"added": 1569184817
			}
		],
		"1569172866_1LQUzLxUdiuVZKwr7wiqii7GzGs8ivGxjR": [
			{
				"comment_id": 147,
				"body": "When I migrate my users.json to a new zeronet instance, here is my procedure that works for linux & windows\n\n  - Ensure your prior user.json from your /data/ zeroent directory is safe and secured. And shut down that zeronet instance.\n  - Install a new instance of zeronet, then launch it so the data folder can be created, then Shut down Zeronet\n  - Copy the users.json file to the /data/ directory of the new zeronet instance.\n  - Launch Zeronet then visit the ZeroID provider.\n  - After the initial loading of the ZeroID archive files it should say your are authenticated without submitting a new ID.\n\nIf you want to backup / import your prior list of zeronet sites be sure to include sites.json in the same procedure.\n\nBest of luck.",
				"added": 1569174535
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 148,
				"body": "It is really simple...\nI will stand to protect your ability to say 'fuck niggers' , but that doesn't mean that I must be forced to hear your retarded ass say 'fuck niggers' That group is not my cup of tea, but I also realise that the world does not revolve around my flavour choice.",
				"added": 1569174945
			},
			{
				"comment_id": 150,
				"body": "\nFree Speech Forum http://127.0.0.1:43110/12ye7c7efq7FGvfML6c8u4ZcfNZDk9mjw1/?Home",
				"added": 1569180962
			},
			{
				"comment_id": 151,
				"body": "> [side](#comment_9_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3): Do some particular combinations of characters trigger you or what? \n\nIn short, yes.",
				"added": 1569183026
			},
			{
				"comment_id": 153,
				"body": "> [side](#comment_13_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3): Youve missed the point\nIt is likely no surprise to you but I agree with cary... \nIt could be worse, zeronet already lived through the 'Age of Pedophilia' rumors, so the 'Age of Daily Stormer' doesn't sound as toxic.",
				"added": 1569188303
			},
			{
				"comment_id": 158,
				"body": "\n  - If you click the three dots and mute someone on the main forum page, ~~it hides their activity on this forum only~~ It gives a network wide mute.\n\n  - If you mute someone [from the ZeroID page](http://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2) it issues a network wide mute.\n\n  - [A blacklist](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists) (for the real nasties) is a collection of sites and/or IDs in a list that is maintained by someone that a user can subscribe to and then forget about. When new entries are added, the block lists of each subscriber updates as well creating a \"set it & forget it system\" that relies on publisher trust. ([A clonable example](http://127.0.0.1:43110/1FiLTerEAHp7UT8Aw2zQBypcm5T14kgZDa))\n\nPublishers of Child Porn or Terrorism such as the guided construction of improvised explosives will often land that ID and site on one of the blocklists and some are more current than others.\n\nDo remember that none of those blocklists are enable by default.",
				"added": 1569208174
			},
			{
				"comment_id": 176,
				"body": "> [moor](#comment_270_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): we can't block people who frequent the same place at the same time we do... we may avoid them but our senses can't be fooled, we have to consciously acknowledge them and be reminded about them and reflect on the conflict between them and yourself.\n\nIf you mute someone on zeronet you can avoid them but you will still see their quoted replies which makes you consciously aware of their presence. If you and your fallen out neighbor visit the same bar, must you go sit at their table, or even be near enough to hear each others conversations? Of course not. Sure you may hear their name being mentioned or see the effects of an uproar they cause. But it is up to the individual to reconnect with that fallen out neighbor when they are good and ready to.\n\nBesides I really don't see how someone who is an advocate of any forms of racism would not also be a fan of segregation. During the segregation days in the US, people were separated for the very reason of \"protect their made up, cognitive-dissonace-protected reality\"",
				"added": 1569685104
			}
		],
		"1569200371_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": [
			{
				"comment_id": 155,
				"body": "There are other boards that give very large limits such as [Unlimit Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/)\n\nAnd while not nearly as popular as this main landing forum, it still provides an opportunity to say what needs to be said. There is nothing preventing someone from creating a topic here, linking to that post over there, and just bumping it here now and then.",
				"added": 1569203286
			},
			{
				"comment_id": 156,
				"body": "> [kusoneko](#comment_61_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): Lies.\n\nFrom my understanding of it the limit is to prevent forum spam and other attacks, every now and then nofish will use some kind of determination to give those who are near their limit an increase while denying those who create forum spam. I'm 91.1k / 100k hence my great resilience to prevent myself from engaging in unnecessary and non productive conversations.\n\nBut until then the only other option is to make a new ID, make your own forum, use a different forum, or go back and edit any irrelevant bullshit out of your previous posts to reclaim some of that quota. ",
				"added": 1569203788
			},
			{
				"comment_id": 157,
				"body": "> [kusoneko](#comment_62_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I don't really care what it's for tbh, it's way too small a limit\n\nI agree it is too small of a limit for the main landing forum of Zeronet but it is ultimately nofish's decision.\nIt seems to me he never wanted ZeroTalk to be the landing page for 202 philosophical questions  or a publication of racial power or even political movements, but one that was here to help and direct other users to expanding the network with their own creative sites and interactions. Hence the piles of \"How do i get my site going\" or 'please seed my site' conversations.\n\nI don't know the future of zeronet, if people just grab new IDs and turn ZeroTalk into Philosophy Talk so be it. There is more activity on this network now than has ever been seen in prior years and in my opinion, that's a good thing. It means the adoption of the network is on an exponential growth curve.",
				"added": 1569207310
			}
		],
		"1569215330_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [],
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 164,
				"body": "> This is more than likely the tip of the iceberg on YouTube's hypocrisy. [...] I'll be looking into where content creators are going.\n\nI've noticed an unsettling trend where channels are linking to Patreon for their means of financial support. But while this may be a temporary fix I've witnessed Youtube masking and removing videos from searches, demonetization of platforms due to competition against a larger Youtube player and just other means of anti-competition tactics such as you mentioned video advertising bloat, but also masking less known creators or even attempting to hide the controversial ones.\n\nThese channels end up asking for 'likes & shares' as their new subscribers begin to diminish because their video platform of choice is undermining them. Some video creators have chosen to use Vimeo's paid tier as a means of securing content that would get them demonetised or video removed on Youtube such as the tactic seen by \"Joseph Carter the Mink Man\"\n\nLet's not forget Youtube's attempt to migrate music videos into their Music Service as being able to search and discover these channels diminish. Just like clicking next on the playlist, many times the playlist will stop feeding you potentially new artists that you may enjoy but instead begin to cycle through a Youtube preferred creators channel to help that channel generate views.\n\nOverall it is a very serious issue that should trigger concern.",
				"added": 1569344010
			}
		],
		"1569370965_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 166,
				"body": "The numbers you should be looking at are connected & onion, the rest are previous connections that are likely no longer active. (Such as visitors of the site but then deleted it or those who shut down their zeronet client)\n\n> [k0hlr4bi](#comment_21_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): They want to gain majority on the ZeroNe\n\nUnlikely, even if that was true, a radical group of people could create a forum site, keep the site address among their own select group of people, and the NSA would not be able to find the site even if they owned the majority of the zeronet network. (Unless they compromised a website that was seeded on a zeronet node that was also seeding the target site, but that is unlikely if the zeronet instance of the target site is used only for that site and nothing else as well as some plugins and stat logs are disabled)",
				"added": 1569423283
			}
		],
		"1569419442_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 167,
				"body": "Instead of identifying parties as lefties and righties, why not call out for what political parties should represent?  A party for the ownership class and the party for the working class. Currently, both parties are falling victim to their donors who represent the ownership class, but there are people on both sides who are waking up only to discover that neither party really represents their interests as a common citizen.\n\nI believe that's why Alex Jones was deplatformed from Youtube. Not because he was spouting off his usual rants. But within those rants were small truths that had the ability to unite his listeners regardless of their party preference.",
				"added": 1569424519
			},
			{
				"comment_id": 173,
				"body": "> [tempora](#comment_1_19z58V5PFmx65DK1jcX3MJmt5Y74pHYkkY): which is as satanic as it gets\nBut beauty only matters in the eyes of the beholder.\n\nThere are only two gravitational forces in this realm, one of positive (creation) and one of negative (destruction).\nYour balance between the two will forever be a dance. (\"Satan\" is just a construct for our small minds to understand the greater working of the cosmos.\n\nYou can happily serve in heaven or gladly rule in hell.",
				"added": 1569537985
			}
		],
		"1569427205_1A1k72VXvb6h2eST6JV2kLS55PeEB6X5Eh": [
			{
				"comment_id": 169,
				"body": "I'm sorry, but that response of 'test123456' could not be understood.\nWould you like to try again?",
				"added": 1569427267
			}
		],
		"1569353016_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 170,
				"body": "Thanks",
				"added": 1569442588
			}
		],
		"1569510413_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 171,
				"body": "One of the most popular (and nicest) public portal for zeronet that I have seen is 0net.io\nhttps://0net.io/1PoRTALoun8Y69nSZ5aye9Q87GGrg7EvRc\n\nThere are some zeronet sites to visit under the Discovery tab.",
				"added": 1569515488
			}
		],
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 172,
				"body": "Don't worry, the US public education program is being slashed while teacher unions are being up stood by outsourced labours. Soon enough the average American won't even be able to understand your comment while US corporations continues to push automated war machines.\n\nWhat a world. I wonder what will come first, a financial implosion or a foreign invasion.",
				"added": 1569537416
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 174,
				"body": "> [styromaniac](#comment_1083_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I tried telling everyone, but few listened\n\nWho wants to shake their heads at the realities of life when we can wrap ourselves up in some hugbox belief that the ruling parties will represent the interests of the average citizenry.",
				"added": 1569593554
			},
			{
				"comment_id": 178,
				"body": "> [saintdeath](#comment_10_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U): what's with americans and the jews.\n\nI don't know anymore. Americans have a tendency to circumcise their children soon after birth without even a need to follow the Hebrew faith.",
				"added": 1569691115
			},
			{
				"comment_id": 248,
				"body": "Why is anyone fooled into believing that casting a ballot for any preconditioned candidate is a form of 'democracy'.",
				"added": 1573224932
			}
		],
		"1569615886_1Cht2qsdTvLYZq12erudxjk3W68p7KUAL5": [
			{
				"comment_id": 175,
				"body": "> [fartknocker](#comment_7_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E): he only reliable way I can think of to break into a Facebook account would be to kknow the person and have physical access to their device.\n\nIt is much easier than you think. Most of these hijacking tactics are done by phishing emails or text messages of \n\"Your account has been reported for copyright infringement. Please sign in now to reactivate your account\"\nThat originated from 'support@786258facebock.net' which leads to a login page that looks just like the real Facebook login page that captures the persons login credentials and feeds them back a dummy activation page. \n\nMeanwhile their account is ready for hijacking. It really is that easy to the unsuspecting.",
				"added": 1569682628
			}
		],
		"1569681691_1E57Vo1oeu4cMqHP6AaWbMxhkg3XRF4hbi": [
			{
				"comment_id": 177,
				"body": "I would gladly name my son after Big Man Tyrone. \nyoutube.com/user/TheBigManTyrone",
				"added": 1569685665
			},
			{
				"comment_id": 179,
				"body": "> [whitewolf](#comment_55_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): you mean your wife's son?\n\nDoes not 'my son' carry a portion of 'my' genetic makeup?",
				"added": 1569691830
			},
			{
				"comment_id": 180,
				"body": "> [whitewolf](#comment_56_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): your wife's son implies that it is from a different man. old meme.knowyourmeme.com/memes/my-wifes-son\n\nHahaha \"Ahchoo\", Sorry... I'm allergic to stupid.",
				"added": 1569693415
			}
		],
		"1569711666_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 181,
				"body": "> God I feel so guilty about the CP [...] I just like to see children suffer :(\n\nSounds like they are talking to the wrong 'god'.",
				"added": 1569716828
			}
		],
		"1569767202_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 182,
				"body": "Humanity has long since played in a petrochemical world, it is only natural for our children to then live in it.",
				"added": 1569770147
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 183,
				"body": "Have you tried ZeroTalk? A swift search of the prior discussions can surely find a reader with similar viewpoints. You guys can then meet up on ZeroMe or some other zeronet social site.",
				"added": 1569770257
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 184,
				"body": "Let's take a fun scenario of probabilities to see why zeronet has so few users.\n\n  - How many people are upset with their current social media network to seek an alternative?\n  - Of those remaining, how many will be able to overcome the mainstream taboo of \"Only pedophiles and hackers use darknets\"\n  - Of those remaining, how many will choose to seek a darknet alternative rather than some other clearnet social site.\n  - Of those remaining, how many are aware that there are more darknet choices other than just TOR and continue to choose zeronet and not freenet or some other darknet alternative.\n  - Of those remaining, how many are technically capable enough to install or understand the basics of zeronet.\n  - Of those remaining, how many will stick with the network rather than decide to no longer visit it for one reason or another.\n  - Of those remaining, how many reside in the same language based community as you do?\n  - Of those remaining, how many will choose to announce their activities , actions, or presence to the darknet community.\n\nThis doesn't even consider how burdensome zeronet is for strict mobile users. It gets to a point where the fraction of people remaining are so small that only a few handfuls of people will seemingly make it to the public scene.",
				"added": 1569771857
			},
			{
				"comment_id": 186,
				"body": "> [anonymouslogin](#comment_31_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Have you checked the full 0net source code? Do you compile it yourself? Python too?\n\nOne of the major objectives of open-source is making the code publicly available on a collaborative basis. There are no secrets or nefarious conspiracies because every revision of the code is publicly available and can be audited by any technically qualified individual and independent third parties. Nothing can be hidden, concealed, or otherwise buried in the code without risking discovery. \n\nA reply of \"Have you checked the full [x] source code? [yourself]\" in an attempt to discredit open sourced software in the defense of proprietary is just poor form.",
				"added": 1569872548
			},
			{
				"comment_id": 187,
				"body": "> [xcape2net](#comment_422_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The only value they may have is catching people who are either incompetent or are not making a good-faith effort to write good code.\n\nPeer reviews failing to catch errors that may have the ability to cause exploits is a totally different subject than someone saying \"Open source software is full of potential backdoors unless you check the code and compile it yourself.\" Which is what @anonymouslogin seemed to be implying about zeronet and python as his defense of the inability to audit the proprietary code of WastsApp & Telegram.",
				"added": 1569881691
			},
			{
				"comment_id": 208,
				"body": "> [onlinemovies](#comment_16_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): OPTIONAL FILES ARE POORLY SEEDED: Who want to upload files to a network where the files are almost inaccessible.\n\nThis is something I never understood about some users of p2p technology who complain about the lack of seeded content... If the uploader is not willing to seed what they deem as valuable, why would they expect others to seed the equivalent of digital garbage?\n\n> [onlinemovies](#comment_16_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): OFFLINE OR NOT AVAIBLE DEAD CONTENTS:  ||  PUBLISHERS MUST RUN THEIR MASHINE TO KEEP THEIR CONTENT 24/7 ONLINE: \n\nYour understanding of the network is incorrect. If those files are seeded by others, they will be accessible even if the user who uploaded the file goes offline. But as I stated prior, if you're uploading digital garbage that even the uploader is not willing to seed, why the fuck would anyone else want to seed your irrelevant shit.",
				"added": 1571065228
			},
			{
				"comment_id": 220,
				"body": "> [xcape2net](#comment_457_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  This is getting ridiculous.\n\nMine shows ~100 Connected ~400 Onion",
				"added": 1571587544
			}
		],
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 185,
				"body": "> [k0hlr4bi](#comment_30_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): notepad++ ->  geany\n\nNotepadqq is almost identical to np++ for debian.",
				"added": 1569856108
			}
		],
		"1570017594_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 188,
				"body": "I wouldn't mind so long as they don't auto load or seed.",
				"added": 1570025216
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 189,
				"body": "With a bit of safe browsing habits, tor is not necessary on the clearnet nor zeronet.\nDon't want to stumble on questionable or criminal material with that instance, then don't pursue it.",
				"added": 1570033290
			},
			{
				"comment_id": 190,
				"body": "For you guys who use strict tor, I hope you don't use Apple or Microsoft products and have ditched your mobile phones as well. (Those can be used against you just as easily)\n\nLife is too short to live in constant fear, and besides with the trigger happy cops around here. My crazy ass wouldn't even make it alive to the jail house. So joke is on them, I believe in multiple existences.\n\nYou either die for something or live for nothing.",
				"added": 1570038287
			},
			{
				"comment_id": 191,
				"body": "> [sperg](#comment_21_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ): He won it by making the other poor dumb son of a bitch die for his principles.\n\nMeh, It could be worse, I could be some poor fisherman eating a democracy bomb.",
				"added": 1570038675
			},
			{
				"comment_id": 192,
				"body": "> [pexo](#comment_158_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Take ZeroMe for example Due to the way it is structured it is possible to have everyone, on a ZeroMe hub of your choosing, download and seed any image you want.\n\n@gitcenter can you confirm this? While I don't use the site I do seed content of trusted users such as you, kaffie, and a few others that I can trust not to be stupid.",
				"added": 1570040042
			},
			{
				"comment_id": 193,
				"body": "> [pexo](#comment_159_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): For the record, I reported this issue months ago.\n\nEven KopyKate and the multiple clones like (zeronet)Youtube and RU Video has a potential exploit where someone can upload a bunch of small videos and then plant images of child porn as the thumbnail  jpeg;base64 text string causing everyone who seeds the site to also seed the cp thumbnail collection.  But like you said.\n\n> I [and others] trust that users that are tech savvy enough to find it on their own, are also wise enough to not abuse this.",
				"added": 1570041763
			},
			{
				"comment_id": 194,
				"body": "> [pexo](#comment_160_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): There's even an effort to insert CP into the bitcoin blockchain [...] At some point it just turns into a game of semantics\n\nI agree, I was even going to mention that users on ZeroTalk who could be posting these 'questionable' base64 encoding strings would not even be susceptible to ID blocks as muting a users only tells the local client to not load that users data, but that user's data (including the questionable base64 string) are still stored on the machine. So it seems like all zeronet users who don't use strict tor are just fucked.\n\nNo, as I said prior it is a balance. I leave my proxy exposed to the clearnet, but I also don't go seeding the Xchans sites or other sites that are known to have regular questionable material posted on them. Are they susceptible to attacks? Yes, but so is YouPorn.",
				"added": 1570043643
			},
			{
				"comment_id": 195,
				"body": "> [pexo](#comment_160_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): (I'm not saying that makes it less valid of an issue, just that kopykates issue is a bit less 'real').\n\nIf the governments want to prosecute you, they will. I doubt a jury would understand the difference between Image Viewer and a jpeg versus a Base64 Viewer and a base64 encoding string. They would just see the end result which is the local storage of a questionable image.",
				"added": 1570045295
			},
			{
				"comment_id": 197,
				"body": "> [gitcenter](#comment_1121_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You can post a 100x100 image to most sites (Clearnet as well) by just base64-encoding raw data. Does that count?\n\nThat's not what he's saying, though.\n\n> [pexo](#comment_160_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): The ZeroMe thing is a bit different in that it will store the actual .jpg file on everyones computer not some other representation(base64 inside of a json file in this case) of it",
				"added": 1570117754
			},
			{
				"comment_id": 198,
				"body": "So for example, If I look at the jpegs stored on SunHub, these images are from users that I have chosen to host their images for them. pexo is saying he knows a way to make all users of [x] hub host an image. I just find it interesting if such a claim is true.",
				"added": 1570118288
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 196,
				"body": "> [stardust666](#comment_2_16Fu36vdXG8dynYf9XUqN9F1za5xa19gHK): I don't use TOR.\nEvery now & then I eyeball my proxy stats on different sites, and I would say for any given moment for the majority of the more popular zeronet sites ~26% of users don't use tor.",
				"added": 1570116823
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 199,
				"body": "I just laugh when i see someone say \"[They] own mainstream social media, Hollywood, the government, etc\" because it has been clearly overlooked how such parties were smart enough to buy the assets of another rather than to opt to sell themselves to the highest bidder like some money crazed whore.",
				"added": 1570127325
			},
			{
				"comment_id": 211,
				"body": "While the Saudi Royal Family may have investments in those companies, they don't own them. It is called a US & Saudi Arabia partnership. This serves Jack Dorsey well for selling his company (stock) assets without conditions like some eager schoolgirl whore.\n\nThey sold the majority of the company to a foreign dictator. Aww, does the poor babies haz too much money to count?",
				"added": 1571240593
			},
			{
				"comment_id": 212,
				"body": "> [chergriog](#comment_18_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): FBI is an American crime drama television series created by Dick Wolf and Craig Turk that airs on CBS, where it premiered on September 25, 2018\n\nWtf...  How can anyone take you seriously after they see you brown nosing and promoting material that is produced by partners of the same entities you are bitching about.",
				"added": 1571322268
			}
		],
		"1570159543_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 200,
				"body": "While I'm not disagreeing, the client will often be able to intercept the url correctly http://127.0.0.1:43110/Talk.ZeroNetwork.bit works just the same on my local client as it does on my proxy that doesn't even use port 43110",
				"added": 1570198786
			},
			{
				"comment_id": 201,
				"body": "On zerotalk relative links are disabled, I'm pretty sure OP is suggesting other sites to use relative links, which they should.",
				"added": 1570207414
			}
		],
		"1570196788_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 202,
				"body": "> [noquat](#comment_5_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh): Not sure exactly what causes them to end up in this state. Perhaps they went to far from home? Bad food? High summer temperatures?\n\nDon't forget about pesticides and other pollutants.  But it was likely a combination of all the above.",
				"added": 1570207767
			}
		],
		"1570306236_1GEnjtQHeGRmTA8iiN5TrBEAVbzSaYVgae": [
			{
				"comment_id": 203,
				"body": "My e-reader stalks me to bed almost every night.",
				"added": 1570376156
			}
		],
		"1570379712_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 204,
				"body": "Yacy- Web Search by the people, for the people\nhttps://yacy.net/en/index.html\n\nBitMessage - Bitmessage is a P2P communications protocol used to send encrypted messages to another person or to many subscribers\nhttps://bitmessage.org/wiki/Main_Page",
				"added": 1570458799
			}
		],
		"1570518001_1C2bvWvxQ5nCmpCQn5Cs9pX9hVVgRwY4Gp": [
			{
				"comment_id": 205,
				"body": "Maybe you should stop revolving around Hollywood propaganda?",
				"added": 1570542844
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 206,
				"body": "What else is there to explain the numerous extraterrestrial radio signals that scientists can't explain as natural phenomenon due to transmission patterns, such as The 'Wow' Signal\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1515128376_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1570628334
			}
		],
		"1570935984_149NKX715zpvjyRaoR7ZdVKMDQ9BQ7kj5s": [
			{
				"comment_id": 207,
				"body": "It is a thin blue line. Cops will stick together and even give favorable testimonies when there are wrong doings.",
				"added": 1570974786
			}
		],
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 209,
				"body": "Almost every official IPTV device will monitor your viewing habits in one way or another. Location along with other sensitive data is part of the licensing agreement that is required to be collected for the platform to distribute the official media.\n\nEven the Roku are known to actively monitor the microphone (for your convenience) by default.",
				"added": 1571070584
			},
			{
				"comment_id": 218,
				"body": "The embedded tracking is one reason why I refuse to buy a Smart TV even when they are on sale and cost as much as an older 32' tv.\n\nNot only do these TV track you when connected to the internet, but I've read way to many stories about the TV manufacture changing product direction and no longer providing OS updates so things that work, eventually break in a year or two as software updates but your Smart TV platform doesn't.",
				"added": 1571408582
			},
			{
				"comment_id": 219,
				"body": "> [xianc78](#comment_64_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): here is really no point of getting a smart TV or a dumb TV with a cable box, game console, DVD/Blu-ray player, etc\n\nYou won't be saying that when you are assigned the role of providing media to your family household and attempting to turn your cable addicted spouse into a cable cutter. Now my spouse is addicted to cable and Roku which is a half way there.\n\nMany would opt for the discounted Smart TV rather than a Roku or some other device.",
				"added": 1571587076
			}
		],
		"1571178755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 210,
				"body": "I know for sure that the US will continue to appease the interests of the CCP much like the US government and corporations appease the interests of the Saudi Royal family who (you guessed it) claim ownership of all Saudi Arabia simply because it is too easy to sell themselves without any short term consequence.\n\nJust another example that companies who stand by their values of Capitalism will ultimately sell itself out to a dictatorship that identifies as Communist.\n\n> [moor](#comment_284_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): its almost as if this whole thing was planned, but i digress.\n\nThe joy of multinational corporations and their vested interests while operating with little oversight and regulation.",
				"added": 1571239878
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 213,
				"body": "I bet you are a nigger.",
				"added": 1571322473
			},
			{
				"comment_id": 221,
				"body": "> [decompiler](#comment_17_1NcurpanUoXCULWJdFWMQ63RUcHeGp2vuA): Mention one, just one single country, culture or region that has been improved by the introduction of a substantial amount of niggers.\n\n~~  America Bitch! ~~\n\nBefore dem niggers came around as slaves by the prestigious English White Man, there was nothing but desolate land with herds of buffalo butt lickers. But boy, after those Noble English white men came with their boom sticks and farts of death dem buffalo butt lickers almost all died and dem Niggers lived happily ever after in the US getting free money from the government with their Mexican wives. \n\nWhy they even gone ended up and elected a Nigger President, didn't ya hear!",
				"added": 1571588213
			}
		],
		"1571260392_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 214,
				"body": "I think mainstream social platforms are censoring voices of dissent while mainstream media downplays inequality.\n\n> [styromaniac](#comment_1126_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The Vegas shooting looked like an agent operation from what my friends and I saw of it.\n\nI hear the US is classifying conspiracy theorists as the latest form of 'terrorist' by causing social unrest.\nIt is almost difficult to distinguish if we are still talking about the US or the CCP.",
				"added": 1571323786
			},
			{
				"comment_id": 216,
				"body": "Want to know what happened during the last major US protest? A 21 year old girl participating in the protest by handing out bottles of water nearly had her arm blown off by a concussion grenade that was launched into the crowd by the police while other demonstrators were being hosed down by pepper spray laced water cannons in sub freezing temperatures.\n\nArticle details: https://www.snopes.com/news/2016/11/22/standing-rock-protester-in-danger-of-losing-arm-after-police-use-force/\n\nHer father took and released images of the extensiveness of the injuries.\nhttps://docs.google.com/document/d/16OfqB5u0lQd75qVA-e9ok9eBeJbk0SrPGP01jCV3KOI/edit\n\nSo pardon me as I give little concern to what the hell the corrupt as fuck US 'media' is doing.\nIt has been proven that 90% of media and Hollywood participants are overpaid and then use that excessive wealth to fuck little eight year olds too. And the FBI is only there to ensure the steady supply of orphaned children.",
				"added": 1571325297
			}
		],
		"1571275597_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 215,
				"body": "> [cactusdragon](#comment_52_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): Why and how should a company have a moral compass?\n\nThey don't have one, as they are human machines that are programmed with one objective which to generate revenue for itself. Hence the reason and necessity for extensively strict regulation and supervision by the people it generates its wealth from. In this instance Apple, Google, and many others are the equivalent of automated commercial meat grinders that have ran amuck.\n\n> [cactusdragon](#comment_52_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): AND Google is the one trying to set full disk encryption as standard\n\nI remember there was once a time when Apple bragged about how their phones couldn't even be decrypted by the FBI and used it as a sales tactic and then the FBI gained entry to those phones and the sales pitch never went away because people are fucking retarded. This comparison resembles astonishing similar characteristics.",
				"added": 1571324494
			},
			{
				"comment_id": 217,
				"body": "While encryption by default is a good thing, I'm more for educating the user how to better use their potentially dangerous tools.",
				"added": 1571326982
			}
		],
		"1571549623_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 222,
				"body": "Receiving a blowjob while getting an enema is always a mind blower.",
				"added": 1571588651
			}
		],
		"1571702582_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 223,
				"body": "Why visit a darknet forum to discuss the stupid ass movies you like?",
				"added": 1571752903
			},
			{
				"comment_id": 224,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_877_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't be an ass. it's not like we can change that wworld, do we ?\n\nWell, people like you don't have a chance in hell as you are clearly a sucker for corporate abuse.\n\nOthers on the other hand are giving a daily push back which has led to the adoption of Netflix, Hulu, Roku, Fire TV, YouTube TV, Spotify, and all the other various media services that were once highly criticized by the same media industry that they now partner with.",
				"added": 1571759528
			}
		],
		"1571760514_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 225,
				"body": "Its comical to see so many complaints lodged against the latest generation of youth who supposedly 'don't know shit' while the majority of the example provided are work related instances who's bad decisions are often the result of a conglomerate of 'older' senior staff members.\n\nThe company you work for isn't heading in the right direction, blame the young new hires, not the senior staff who has worked there for 40 years. Stop blaming your lack of priorities on the kids who have more motivation than you.",
				"added": 1571840333
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 226,
				"body": "nofish stated a long time ago that no single zeronet peer will connect to all other peers on the network and instead a limit has been set; could explain your results from what you once remembered of it.",
				"added": 1572031594
			},
			{
				"comment_id": 229,
				"body": "> [quantumkitty](#comment_224_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): And probably in Chinese\n\nAnd Russian.  \n\n(a Russian audiobook site for starters)\nhttp://127.0.0.1:43110/1N77kxgd29cR8w9xt481JDJEtYdX1hCqAR/",
				"added": 1572532708
			}
		],
		"1572403703_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 227,
				"body": "nobody cares",
				"added": 1572443950
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 228,
				"body": "> [quantumkitty](#comment_233_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It's an understandable concern \n\nFor some reason I thought you freaked out and left the network. Nice to see you are still around.",
				"added": 1572531619
			},
			{
				"comment_id": 230,
				"body": "> [xcape2net](#comment_513_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): She received at least two other derogatory comments--in my opinion unjustified. [...] Hopefully, she wasn't insulted enough to leave for good.\n\nYes... the interwebs is not the place for soft shelled netitizens, especially a network that fosters dark activities.\n\nMaybe the user left because they were looking for some unlimited collection of media and all they could find were conversations. There is even a percentage of zeronet users who don't even bother to converse because why would they. At least not on ZeroTalk anyways where the hit & run xenophobes are plentiful.",
				"added": 1572620384
			},
			{
				"comment_id": 233,
				"body": "> [xcape2net](#comment_516_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I got the distinct impression she was interested in participating on ZeroTalk.\n\nShe needs to learn to adapt to the network that she is using. It is ridiculous to expect the network to adapt to her. If such a place of conversation is desired, someone could create their own ZeroTalk and attempt to moderate it against pessimistic users.\n\n> [xcape2net](#comment_520_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've never thought hazing was justified--in college, or anywhere else.\n\nIt is never justified, but nofish has left this forum as a place where such characters are tolerated. Your words are not going to change that as their will always be NEW characters who haven't read your words but will mirror what has already been published on this forum.\n\n> [kanade](#comment_35_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): trying to make ZeroNet more mainstream was a horrible idea, and this is why. You don't invite someone into your house and 'be nice' when they shit on your floor. They either start being of quality or get bullied out. \n\nZeronet will never be mainstream, there is no need to worry about that. But new 'potentially beneficial residents' need to be invited to the network somehow. And that's not going to happen if this network is not Liked & Shared, per say.\n\n> [h3bhkj5gqz4n3pjm](#comment_924_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): In every past and future civilization, there have been and will be a handful of people, able to stand out FROM THE CROWD\n \nHeros will remain unsung because those special few who stand out from the crowd are also persecuted for their acts with their public image and mission statement twisted by mainstream media. For example, look how many are quick to throw their criticism at Kim Dotcom while ignoring the injustices he faced and continues to face. He denounces the MPA & RIAA, opposes censorship, used Hollywood celebrities against them by paying them to promote MegaUpload, Created and lost a huge amount of wealth by providing a free to use file-sharing platform, which ultimately resulted in the comments of today that litter his topics which often consist of nothing more but remarks concerning his weight. Asking people to stand out in the world of today could be considered the request of a glownigger. But I  digress \n\nAdopters of Zeronet would understand that Zeronet is a place for everyone, even the trolls and the retards. If that is a problem, the user is free to create & moderate their own place of discussion as they see fit. But would that really help as even moderators need to sleep. I guess what I'm trying to say is that if someone attempt to use a dark network only to be turned off by the dark characters who reside on it, maybe the well moderated clearnet sites of FaceBook and Twitter would be a better choice. You really are wasting your time imo attempting to teach anyone here the value of giving warm welcomes.",
				"added": 1572795807
			},
			{
				"comment_id": 240,
				"body": "> [kanade](#comment_37_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): - why did any of us join?\n\nI joined zeronet because it was a place to publish my sometimes controversial voice without worrying if those comments will continue to be there a year or two later. I also joined zeronet because when I share something, I'm not going to get an email saying \"Your fair use documentary has been removed because some shadow party sent a complaint.\"\n\nAlmost two years later and KopyKate still lists, doesn't down rank, or mask the documentaries I shared.",
				"added": 1572881137
			},
			{
				"comment_id": 245,
				"body": "> [styromaniac](#comment_1204_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Take Reddit for example\n\nI agree, reddit is pure toxic, and now that the site self moderates anything questionable I don't feel bad for never making it a part of my life in the first place. I'm still able to obtain whatever I want without Reddit and I'm not surprised at all about that.\n\n> [bigbadbob](#comment_806_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Do people actually flog the newcomers? I was never flogged...\n\nI have been guilty of flogging retards who advertise their stupidity and are not receptive to correction. The only thing a new comer has to do with it is how they project their ignorance of the zeronet network or any xenophobic viewpoints.\n\n> [xcape2net](#comment_534_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): That was eight days ago, and she hasn't been back. I think it's fairly safe to say she's gone for good.\n\nI agree, it really is a shame.. Odd how we are not yet numb enough to those intellectual face slaps by our peers.\n\n> [funnyisrelative](#comment_1_12qSZM3muUixgbzjXf7NFjg6nkuA8XyL5R): One points of Zeronet is to have a free exchange of information without censorship. regardless of what you agree or disagree with.\n\nOn zeronet, the retards have their ability to express how retarded they really are...",
				"added": 1573052434
			}
		],
		"1572791522_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 231,
				"body": "There are more than you think, they are just private ones.",
				"added": 1572793494
			}
		],
		"1572721528_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 232,
				"body": "From what I read in the past, the only disadvantage to doing this is that flash drives of lower quality will die more quickly if the client is left always running from the constant I/O usage of zeronet.",
				"added": 1572793641
			}
		],
		"1572705629_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 234,
				"body": "I would believe so just because obtaining a magnet link does not leave a server side trace as opposed to obtaining a .torrent file which would leave an active log of the file download which the persons PC could then be searched for.\n\nWith magnet links, all that could be identified would be that someone visited the page that had the magnet link published on it. But that doesn't mean that torrent tracker information can be embedded within the magnet link.\n\n\n> [h3bhkj5gqz4n3pjm](#comment_936_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): a brain \n\nIs something fucking wrong with yours?",
				"added": 1572796502
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 235,
				"body": "I miss the days when getting connected to the internet meant you likely had a sound understanding of the technology and tools that you are using because you were able to get your new modem driver installed on that Windows system and could converse with people who would equally laugh at the idea of preventing the duplication of data in an environment that facilitates the copying of data without restrictions.",
				"added": 1572799301
			}
		],
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 236,
				"body": "This shit really does remind me of how in those old history films of the Nazis there would be those occasional moments where the crowd would yell \"Hail Hitler!\" every so often without any reason, goal, or other thought behind it.",
				"added": 1572803207
			}
		],
		"1572732591_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 237,
				"body": "From what I understand of Bitchute when it was first launched was that it was a hybrid of youtube in that the videos would be seeded by a central server, but the service had the capability to have peers distribute the video to other peers who may be viewing the same video to conserve server bandwidth and was ultimately a working proof of concept to lower expenses. It's been many years later and I would consider the service vaguely popular.\n\nZeronet on the other hand does not have one server that is operated by one entity. I would consider Zeronet to be more redundant in that if BitChute decided to throw in the towel, their platform, and the videos the users host would eventually result in a 404 error while Zeronet distribution nodes will last as long as those interested to preserve the media continue to seed it for others. Similar to how torrent swarms operate. Someone's non-profit generosity serves the benefit to others for a small request that they do the same.",
				"added": 1572804142
			}
		],
		"1572804023_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 238,
				"body": "Here is a fraction of some file-sharing sites that have been found on Zeronet\n\nZeroWiki: List of FIle-sharing sites\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:file-sharing",
				"added": 1572804625
			}
		],
		"1572807733_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 239,
				"body": "You should do what I do and collect them while you can.\nMany of the older roms can be highly compressed.",
				"added": 1572880469
			},
			{
				"comment_id": 244,
				"body": "Well, if you want to create a fun project for yourself and amaze any of the grand kids for the holidays, you should check out RetroPie.  https://github.com/retropie/RetroPie-Setup/wiki\n\nI used a Raspberry pi3B with a few cheap heatsinks for the chips and super glued the case together and included 2 usb snes controllers.",
				"added": 1572916516
			}
		],
		"1572852310_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 241,
				"body": "Quantum computing will remain in the hands of the wealthy because just imagine the power a hacked out quantum computer could do in the hands of a poor man.",
				"added": 1572881396
			}
		],
		"1572897732_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 242,
				"body": "Much like the terms of socialism have been perverted by those who oppose it, so has the definition of a SJW.\n\nA SJW was once described as a Social Justice Warrior, as someone who was an activist and would even encourage vigilantism against actors that were exempt from traditional laws for one reason or another. \n\nThe engineered confusion was just another creative way to preserve the current status quo as it is difficult to change the topics that become difficult to discuss.",
				"added": 1572908374
			},
			{
				"comment_id": 243,
				"body": "> [quantumkitty](#comment_251_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): If only people protested against poverty and homelessness as much as they protest climate change.\n\nWe're fucked.... The rampant climate change protests have had little to zero impact on a global level.\nThere is still rampant deforestation for the preparation of agriculture farmlands while countries give little discussion concerning reproduction regulations or even what it would mean to obtain sustainability let alone discussions of the preparations that should be taken to prepare ourselves for the fast approaching economical disasters that await all of us.\n\nIf you think the plastic ocean is fucked now, just wait until glacial melt pushes the sea level above the nuclear dump sites that is found at Bikini Atoll and other nuclear waste stockpile sites that was never dealt with.",
				"added": 1572908542
			}
		],
		"1572980315_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 246,
				"body": "> [accumonkey](#comment_6_1JVUxDzQdXwM9ZBxqFVRqCdYJGBTiHo4Hs): . I don't censor anything but the kiddie stuff - and by god there's a lot of that on here.\n\nYou have to be careful with the government leaked document stuff too like the Panama Papers, the Snowden Documents, and even the WikiLeaks Torrent Archive.",
				"added": 1573052904
			}
		],
		"1573186132_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 247,
				"body": "If so many people have died due to 'communist oppression', then why are US companies so eager to cater to the demands of a dictatorship that identifies as communist?",
				"added": 1573224731
			},
			{
				"comment_id": 251,
				"body": "I'm pretty much to the point that anything that is supported by the US is done so simply because some vested party has a lucrative financial gain to be had.\n\nMaybe China see's Honk Kong as a foot hold of American values.",
				"added": 1573273947
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 249,
				"body": "> [kaar4bears](#comment_24_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): https://unblocked.ltda/\n\nUnblocked.bit if the .ltda domain is unreachable.\n\n> [h3bhkj5gqz4n3pjm](#comment_964_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): who needs prison set up by wealthy people?\n\nOften an island was suffice, but Hawaii was turned into a tourist attraction.\n\n\n",
				"added": 1573225082
			}
		],
		"1573155626_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 250,
				"body": "You don't need to create a new account as nofish will raise limits periodically for those who don't spam. my limit is 141/200k",
				"added": 1573225415
			},
			{
				"comment_id": 252,
				"body": "> [aspidochelone](#comment_261_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): but the point is, you have a trade off between limit, number of users, and length of time to download it all\n\nWhich will forever expand because new users don't know how to search for already answered topics so they ask the same questions again, and again.",
				"added": 1573398183
			}
		],
		"1573380699_1DW4katFP9UNot9m99gAW8vAQRMaEohQLC": [
			{
				"comment_id": 253,
				"body": "Must feed and water (2015)\nUnless it is on some private tracker somewhere, it looks like another kickstarter film that has been lost to obscurity",
				"added": 1573398868
			}
		],
		"1573396729_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 254,
				"body": "> I have to recognize what my anxiety is from and realize that there's no reason for it. You have to convince your brain that everything will be fine.\n\nWhile mine maybe not be as severe, I would say I suffer from the same in that my anxiety was getting so bad I had to reduce my daily intake of cannabis. For me, an hours worth of intensive exercise with music helps me calm my nerves.",
				"added": 1573399541
			},
			{
				"comment_id": 255,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1018_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i thought you had understood the religious thinking.\n\nWait... exactly when was I suppose to give a shit about what you think again?",
				"added": 1573408692
			}
		],
		"1573463079_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 256,
				"body": "This has been going on since the Bush presidency and possibly prior.\n\nVideo on KopyKate: Wikipedia – A Tool Of The Ruling Elite\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1545977901_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1573484178
			}
		],
		"1573407833_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 257,
				"body": "Enjoying my morning routine of a fresh soft salted pretzel with a hot black coffee.",
				"added": 1573484313
			}
		],
		"1573291463_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 258,
				"body": "> [1bfqutudhtexlka](#comment_33_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY):  i really like linux , but i like games too\n\nWhy not dual boot your system? You can even dual boot from two HDDs.\n\nOne partition or HDD with Windows10 for strictly gaming due to the polished graphics comparability and use your second partition or HDD that has linux for everything else.",
				"added": 1573485619
			}
		],
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 259,
				"body": "Imagine that... It is almost seems as if humanity was engineered for volunteer slavery and servitude.",
				"added": 1573485757
			}
		],
		"1573543018_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 260,
				"body": "This idea had been tossed around with a few times now.\n\nThere was once a public ZeroProxy that made users agree to allowing a BTC miner run while they used the public portal. But, as usual, all the normies couldn't shit on the idea & service hard enough as the majority will expect something for nothing.",
				"added": 1573582280
			}
		],
		"1573656884_1BoazbM5hxwjz51eQ8PYHwSTFNFe2a81ec": [
			{
				"comment_id": 261,
				"body": "Yeah? Well I found the secret to unlimited money! And I'm willing to share the knowledge with you for the steal bargain price of $500,000.99",
				"added": 1573657312
			}
		],
		"1573689881_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 262,
				"body": "> [styromaniac](#comment_1243_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The UI is kind of lackluster, lacks thumbnails and is not very mobile-optimized. KopyKate BIG Official's is nicer-looking, mobile-optimized, has thumbnails and is a bit more simplified.\n\nKK only supports three different video formats while potentially anything from zips to roms can be uploaded to IFS.",
				"added": 1573745252
			}
		],
		"1574452793_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 263,
				"body": "On the py3 ver of Zeronet, does going into Configuration and then ticking \n\n\"Offline mode\nDisable network communication.\"\n\nhave any effect?",
				"added": 1574869477
			}
		],
		"1574925072_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 264,
				"body": "> Because I increased the previous limit of the site kopy kate big and now I realize that my uploaded files are NOT visible.\n\nKopy.Kate.Big has a hard coded file limit on the number of uploads a user can preform.\nYou can meet your file limit at KK and not be able to publish any more,  but still be able to post comments at other places.\n\nA solution is to remove junk data from your content and data.json files in your folder on KK as when deleting files from the KK interface does not remove the meta data from your content files. (Don't forget to sign your file before the site updates them with the old data) && (Caution is advised as a corrupted file would render all of your uploads as unlisted.) Or just make another ID to use with that zite and discard your previous ID to freeze the uploads in place forever.",
				"added": 1574951134
			},
			{
				"comment_id": 267,
				"body": "I didn't know that was a different site, thanks!",
				"added": 1575042434
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 265,
				"body": "The faster humanity goes extinct the better, maybe the next generation species will be able to move past their tribal nature and understand that one planet means one home.",
				"added": 1574951320
			},
			{
				"comment_id": 266,
				"body": "> [fke13](#comment_12_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Well, You can speed that process up by killing Yourself \n\nIf one is not able to witness it all begin, it is second best to witness it all end.\n\nHumanity can't move past the tribal nature of capitalism. The wealthy defend those of wealth and the poor defend their life sustaining social services that cater to others in need. It is still tribalism.\n\nHumanity is far to young as a species to realise that we all share the resources on this earth together. If we created an General AI (in which humans are eagerly attempting to do), it would consider us a hostile pestilence for wasting so much of its own finite resources so carelessly. Even with an existential threat like climate change hasn't been able to bring the nations of humanity together.",
				"added": 1575041456
			}
		],
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": [
			{
				"comment_id": 268,
				"body": "In a way, one could say Zeronet has community moderators as well. \n\nThese would be the people who manage and make available the multiple blocklists that are found around the network. But unlike with Aether, these moderator lists are not enabled by default while also providing a superseding moderator who could be the zeronet social site owner.",
				"added": 1575046166
			},
			{
				"comment_id": 269,
				"body": "> [kanade](#comment_55_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Zeronet isn't the best and honestly quite flawed,\n\nYou say quite flawed, but I would say it's vast room for improvement.",
				"added": 1575214481
			}
		],
		"1575211763_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM": [
			{
				"comment_id": 270,
				"body": "50/10 cable, but my zeroproxy is connected to a 100/100",
				"added": 1575236083
			}
		],
		"1575244200_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 271,
				"body": "A vote is actually quite valuable and should not be wasted.\n\nI reason that voting is important as there are so many means to revoke the voting rights of citizens from false incarceration, (A felon can't vote) to project Cross-Check, to voter spoilage, to the closing and consideration of voting centers in places of minorities, to the confusion generated by mainstream media coverage.\n\nIf voting wasn't important, all of these clever ways to squash people's ability to vote wouldn't exist as there would be no fear from the ballot.",
				"added": 1575299055
			}
		],
		"1575265213_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 272,
				"body": "Sometimes I wonder if forms of religion are not meant to help people understand a higher plane of existence or bring them closer to some great deity, but rather a means of information control. \n\nOften followers would say madness will follow when one chooses to ignore the blissful ignorance that is taught by religious followers and has instead chosen to take a bite of the forbidden fruit from the tree of knowledge. Now you will never be let back into the garden of ignorant bliss.\n\n(PS: I'm not religious, but I can see the links between it's teachings and keeping followers enshrined in ignorance for their own mental health and safety. \n\nMaybe the rising trend of atheism is what caused a new movement of information control which would be copyrights. Just a thought.",
				"added": 1575299692
			}
		],
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 273,
				"body": "The KickassTorrent Clone was created when the original KAT site was raided and taken offline.\n\nWhile it was never adopted by the Kat community, it still servers a great Proof of Concept that such a feat is possible to the determined mind.",
				"added": 1575385503
			},
			{
				"comment_id": 275,
				"body": "A list of filesharing sites on ZeroWiki:\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:file-sharing",
				"added": 1575424973
			}
		],
		"1575339719_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 274,
				"body": "I mainly try to seed material that I consider valuable but youtube finds objectionable.\n\n> used the Big Kopy Kate 2 \n\nI agree, use BKK2 as the original KopyKate is no longer under development.",
				"added": 1575385992
			}
		],
		"1575467766_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 277,
				"body": "So you list a technological advancement (Unix) that has been built on prior technology (internet & PC hardware), but instead of continuing the chain of technological advancements, you opt to criticize it. No wonder you have discover nothing. Welcome to the zeronet community, but I don't expect you to be here for long.",
				"added": 1575477958
			}
		],
		"1575523101_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 278,
				"body": "As an alternate, Telegram seems to be causing some waves in the media with their refusal to side with authoritarian agencies.",
				"added": 1575560076
			}
		],
		"1575532867_1ApA2iB2ZgqnbhHWsG7XH5QZQkPDqHNKzZ": [
			{
				"comment_id": 279,
				"body": "I ordered some from your mother yesterday, I'm waiting for your lazy ass father to ship them to me.\n\nCan you be a good glownigger and check up on the delivery status?",
				"added": 1575560310
			}
		],
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 280,
				"body": "It didn't work for my firefox browser, shows the image and nothing else happens.\nI haven't given enough shits to look at the source to see what's going on or if it s even a real site. But no worky, no seedy",
				"added": 1575560493
			}
		],
		"1575708225_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 281,
				"body": "It's nice to see you are doing better now that you are able to keep the mind busy.\nRestlessness really will make any person go insane.",
				"added": 1575733300
			},
			{
				"comment_id": 282,
				"body": "Eventually everyone will realise that this is all happening exactly the way it was suppose to.  Quite often everyone will feel that they are no longer in control of something important to them. \n\nBut, more often than not, the problems is not that the problems we face can't be solved.  The problem is that we become so afraid of failure that we refuse to see our problems from a new perspective. And so, we do the same things again, and again, and again. And therein, of course, we find exactly the failure we were looking for.\n\nYour life will always be a struggle and you will always have problems. But today, you have the chance to see things differently. Even though it means facing obstacles that seemed impossible at first, you will be able to think outside of the box, and overcome them. Because when we begin to see things from every angle, we begin to understand them for what they really are. Because you kept moving forward, no matter how far off the path you were told you were headed, or how unexpected it became... you found your way.\n\n~Superliminal",
				"added": 1575739361
			}
		],
		"1575866209_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 283,
				"body": "It prevents spam and other malicious attacks such as uploading 1kb icons.",
				"added": 1575906674
			}
		],
		"1575869098_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8": [
			{
				"comment_id": 284,
				"body": "You will thank that learning curve later. It serves as a great filter to weed out the temp users, trolls, and other morons who believe the internet comprises of Facebook & Twitter.\n\nThey get to Zeronet and say \"OMG what am I suppose to do? I can't do anything here\" and back to Facebook they go.",
				"added": 1575906785
			}
		],
		"1576066471_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": [
			{
				"comment_id": 285,
				"body": "Good job on the zite.",
				"added": 1576077944
			}
		],
		"1576144410_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 286,
				"body": "I agree, I spent many months browsing that site and still haven't discovered all that is on there.",
				"added": 1576164115
			},
			{
				"comment_id": 289,
				"body": "There is not a feature encoded on that site to mute a user(s), you have to data mine the site manually, locate that user's directory address from their profile url,  go over to the merger site they used and navigate to that discovered directory path address which holds their content.json file which will reveal their @zeroid.bit address. that you can then go to ZeroID and mute.\n\nJust another learning curve to climb. Best of luck.",
				"added": 1576172061
			},
			{
				"comment_id": 290,
				"body": "> [1bfqutudhtexlka](#comment_117_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): hope the developer add mute function ,also in the FAQ there is a moderation , which is a sad thing :(\n\nMany of these sites were intended to be working proof of concepts and were never meant to be the adopted file-sharing platforms of zeronet.\n\nBut sadly coders are the laziest people who will automate the world if they could and often live by a mentality of \"If it isn't broken, then don't fix it.\"\n\nIFS will stop being used when a better platform comes along, Who knows when that will be.",
				"added": 1576173500
			},
			{
				"comment_id": 330,
				"body": "The CSS is only broken for me when I access this site through a proxy, but otherwise it works well. I can organize the uploads from the FILES page and if a person remembers to pin their files, they will stay well seeded.\n\nI prefer it over ZeroUP actually.",
				"added": 1576959055
			}
		],
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 287,
				"body": "I prefer Greek Yogurts that I add my own flavours like crushed pineapples. I'll pass on the baby cow growth hormones, thanks.",
				"added": 1576164289
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 288,
				"body": "Maybe some people don't express themselves with words but rather with anonymous creations and other shared articles.",
				"added": 1576169907
			}
		],
		"1576243302_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 291,
				"body": ".washingtontimes is about as bad as Breitbart.",
				"added": 1576252852
			}
		],
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 292,
				"body": "I still don't believe he is dead and instead was a body double.\n\nTell me... why does a dead man need multiple islands that are filled with luxurious assets built from a criminal sex trade enterprise again?\n\nI guess helicopters filled with federal agents just can't fly that far. I mean they would have to rent multiple freight ships just to haul back his seized assets.\n\nFederal agents haven't even considered searching the islands for the buried remains of any corpses of non-compliant sex workers. Or the buried aftermath of that one client who just got a little bit too carried away with the merchandise.",
				"added": 1576253114
			}
		],
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": [
			{
				"comment_id": 293,
				"body": "> [anonymouslogin](#comment_162_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): But this meta proxy may be censored.\n\nThere is a 95% chance the proxy will get censored over bogus & unverified DMCA claims. No legitimate reasons necessary.\n\nExample, https://0net.io/ is one of the best & nicest public zeronet proxies that I have ever seen. Sad it was always impossible to find it from the clearweb",
				"added": 1576259221
			}
		],
		"1575850577_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 294,
				"body": "> [styromaniac](#comment_1449_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're on thin ice.\n\nto be fair, you should give the same warning / consideration to the original KopyKate site.\n\nIt is no longer moderated or updated and the [Report] button should be more aptly renamed as [Block] because that is all it does concerning potential incriminating uploads...",
				"added": 1576433061
			}
		],
		"1576431661_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 295,
				"body": "I imagine it would be beneficial for those who don't have access to a proxy or VPN for their BitTorrent client.",
				"added": 1576434676
			},
			{
				"comment_id": 306,
				"body": "> You may read the details from  https://github.com/Tr.....\nAre you aware that the issue you linked to was solved & closed?\n\nJust in case I was wrong, I just tested the latest version on my Windows 10 rig and not only did it load just fine, the built in Anonymous Proxy for torrents worked great as well, (which is where the majority of the funding went into building the anonymous node network)",
				"added": 1576536392
			}
		],
		"1576357002_1LnYB5hBWt5ev2swqkFHz5bkW5jNK7KRzy": [
			{
				"comment_id": 296,
				"body": "protonmail.com... Why not use the ZeroMail service + Tor",
				"added": 1576434884
			},
			{
				"comment_id": 304,
				"body": "You should send some BTC to the wallet address of `1K4t2vSBSS2xFjZ6PofYnbgZewjeqbG1TM` so that everyone here can look at the public ledger and see that you are serious.",
				"added": 1576475169
			}
		],
		"1576434866_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": [
			{
				"comment_id": 298,
				"body": "It should be better now.",
				"added": 1576435741
			},
			{
				"comment_id": 301,
				"body": "Well it was working... now the links go nowhere for me.",
				"added": 1576461253
			},
			{
				"comment_id": 302,
				"body": "It seems the '127.0.0.1:43110/1XinYeo9fCjP5VrayvR6iBMzyyWWq963J/docs/es-es/asymptotic-notation-es/index.html' are absolute paths and I can't access it through a proxy.\n\n\nyou should be able to just have the paths defined as relative as in, \n/docs/es-es/asymptotic-notation-es/index.html\n\nwithout the \n\n127.0.0.1:43110/1XinYeo9fCjP5VrayvR6iBMzyyWWq963J/ prefix",
				"added": 1576473279
			},
			{
				"comment_id": 305,
				"body": "> [fractalzoomer](#comment_56_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): Try it now\n\n\nWorking again, thanks. If you haven't already you should add the site to the ZeroSites and 0list index so that it can get some more attention. ZeroNetwork.bit && 0List: 186THqMWuptrZxq1rxzpguAivK3Bs6z84o",
				"added": 1576512811
			}
		],
		"1576436753_1K2gWrwEPk1xUKM6Uq8g4AmKq6DQfJ99y6": [
			{
				"comment_id": 300,
				"body": "See similar ZeroTalk topic: [Can i create a web site hosted in zeronet but visible on clear net?](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r/Can+i+create+a+web+site+hosted+in+zeronet+but+visible+on+clear+net)",
				"added": 1576437206
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 303,
				"body": "But for the deceivers who do evil by Satan, what would there be to fear upon Judgement Day as the most horrible of places would be their unimaginable paradise?\n\nThere are only two forces on this realm, one of creation and attraction or repulsion and destruction. We are free to serve in the creation of our own heaven or rule with a lust for power in our own hells. But neither needs to be an experience that can not be enjoyed.",
				"added": 1576474252
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 307,
				"body": "> [nerdy](#comment_2_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf): ...and hate all churches\n\nThere are many christian organisations who go out into the world and do really good work for their community like feeding the hungry and ensuring those who are without decent cloths are given some. There are many who even have followers who donate money & items which are then given to the children of needy families so they don't feel left out for the holidays.\n\nYou understand nothing of this world and your ideas are shit. I'm not religious but h3 is right, It's not about you, grow some fucking empathy for a change. You might start feeling better about yourself.",
				"added": 1576601086
			},
			{
				"comment_id": 308,
				"body": "> [nerdy](#comment_3_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf): that parasite priests and all other people under them).\n\nThen your anger should be focused at the Catholic Religion as a 'priest' is a title that is strictly used by the Catholic faith. Non Catholic but still christian churches have pastures & ministers, they don't identify as priests",
				"added": 1576604694
			},
			{
				"comment_id": 310,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1324_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11):  suppose you like it that way, don't you?\n\nAttempting to stereotype all religious groups as detrimental entities is just a highlight of your own ignorance. Also I guess you missed my comment when I said I wasn't religious, so I've been brainwashed by a religion that I don't follow?",
				"added": 1576682902
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 311,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1333_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): who cares\nAh, the toxic characters that make Zeronet the lovely place that it is today.\n\nMuted :)",
				"added": 1576683700
			},
			{
				"comment_id": 312,
				"body": "> [clearnet15bad](#comment_69_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): Free Hong Kong.\n\nI don't know anymore if that is such a good thing. China (even though they identify as a communist dictatorship) are gaining economical power status because they are doing something right while nations that are allegedly democratic can't sell themselves out to the highest Chinese bidder fast enough in the hopes of avoiding a greed induced economic downturn.\n\nSeriously, we think Democracy is so great but when was the last time China decided to overthrow a country for their oil or drop clusterbombs on some nation so their land can be clear for the production of Soybean.",
				"added": 1576684396
			},
			{
				"comment_id": 316,
				"body": "> [gggff](#comment_2_15D1u4mnaevkiMaJkf8YUXzCPP9pu9J9au): You have serious brain damage\n\nYawn, do you fail at life as badly as you fail at trolling? And don't bother answering because I won't see it :)",
				"added": 1576771245
			},
			{
				"comment_id": 325,
				"body": "> [testuser3](#comment_40_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): hey will take off your money ,woman, house, land which all of they interested things and brainwash from education to conduct propaganda...\n\nWait... are we talking about the US government?",
				"added": 1576854530
			},
			{
				"comment_id": 347,
				"body": "People don't seem to understand what it means to have reached the potential of this planet's resource output coupled with a sustained population growth with littler concern or preparations for sustainable living,, it would only be natural to expect far worse to come.",
				"added": 1577467733
			}
		],
		"1576568035_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 313,
				"body": "While unity will strength the community, children who throw tantrums in the hopes of seeking attention should rightfully be dragged away from the discussion table no matter how much they kick and scream.",
				"added": 1576684883
			}
		],
		"1576471992_1Du836ay9peD2SD5M1383ApEDJh8CDYYd8": [
			{
				"comment_id": 315,
				"body": "> [muhwaycism](#comment_44_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): How do I mute\n\n[Different ways to mute or block a user detailed on ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:mute)",
				"added": 1576686581
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 317,
				"body": "> [draugrdeathlord](#comment_5_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): No Need, people just need to stop indulging in comfort and go riot.\n\nKeyword there is riot, not protest. Protesting will get you confined to a 'free speech area' that is surrounded by barricades while being slandered by the mainstream news media as a rioting crowd that is in need of containment.",
				"added": 1576771854
			}
		],
		"1576748335_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 318,
				"body": "It would be nice if people would provide a short description of what their site is before asking people to seed it.",
				"added": 1576772003
			}
		],
		"1576787090_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 319,
				"body": "Bootstrapper is meant for Zeronet clients that are ran 24 / 7 such as those found on a VPS. The plugin will turn your client into a tracker which will allow other zeronet clients that have trouble communicating with standard trackers will be able to communicate with your client.\n\nIt can be enabled by navigating to the plugin folder and renaming it from disabled-Bootstrapper to Bootstrapper and then launching zeronet",
				"added": 1576787315
			},
			{
				"comment_id": 320,
				"body": "On your ZeroHello, go to the Top Right and click on trackers and your IP will be listed on the Tracker List for peers to connect to you.\n\nNote: The priority is by peer up time meaning your IP will be the last one or two listed of the list while those up the longest will be listed first.",
				"added": 1576788210
			},
			{
				"comment_id": 321,
				"body": "just take a look at the plugin folder, they are pretty self descriptive.\n\nOtherwise nothing is really of importance unless you run your client from a remote server.",
				"added": 1576792614
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 322,
				"body": "If you care enough, add it to the [list of blocklists](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists) that are found on ZeroWiki.",
				"added": 1576804859
			},
			{
				"comment_id": 329,
				"body": "I don't understand why some people get so upset over their existence. It's not like they are enabled on a fresh Zeronet install.",
				"added": 1576949944
			},
			{
				"comment_id": 346,
				"body": "Without manually adding it to some json or using a cloned blocklist, is there currently a way to block a site without prior visiting it first?",
				"added": 1577204172
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 323,
				"body": "> Just find it on pornhub.\n\nThewhispering should start his own KopyKate clone that is centered around prego porn.\nSometimes I think WTF, there is so much porn on the clearnet, but then I remember that in India and Iran, porn sites are blocked / censored.",
				"added": 1576805123
			},
			{
				"comment_id": 324,
				"body": "> [thewhispering](#comment_13_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH): What is a KopyKate clone? I\n\nA clone of the KopyKate video sharing website that is found on Zeronet\n- [Kopykate](/big.kopykate.bit)\n- A [list of file-sharing websites](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:file-sharing) on Zeronet on ZeroWiki\n\nYou'll figure it all out with time. There is a lot to absorb here.",
				"added": 1576807113
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 326,
				"body": "There's a documentary that helps with this, it's called You Don't Know Hitler (2006) [on KopyKate](/big.kopykate.bit/?Video=1546185553_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2) \n\nAnd while it doesn't explain everything, it is one of the better documentaries on the subject that I have been able to find. It helps explain that the Holocaust had to do with Hitler the same way as Operation Iraqi Freedom had to do with George Bush. These people are just tools used as proxies similar to the military convincing Hitler to execute their gay military personnel.",
				"added": 1576854819
			}
		],
		"1576768836_1Tr8KpfPw9HXit4dC5U6Eiu3nV5pd5Cnf": [
			{
				"comment_id": 327,
				"body": "> [lianna](#comment_85_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): Really? I can't seem to duplicate the issue.\n> [styromaniac](#comment_1466_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I think he's misdescribing ZeroMe's bug. \n\nCome to find out that it wasn't due to merger sites at all because after disabling the merger site plugin it was still happening. What did it was adding  a site to the [Favorites] section. It's not even corruption, it's a bloody feature...\n\nIf you add a site to [favorite] on ZeroHello, it's entry (and files) will disappear from the [FILES] tab completely, and vise versa. I didn't know this was added. I pretty much wasted hours figuring that out. It was a refresher in creating a headless zeronnode i guess, I'm just happy I didn't have to do any file migration...",
				"added": 1576856312
			}
		],
		"1576403647_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": [
			{
				"comment_id": 328,
				"body": "Thanks for marking them as optional.",
				"added": 1576945997
			},
			{
				"comment_id": 354,
				"body": "Thanks for sharing",
				"added": 1577727289
			},
			{
				"comment_id": 355,
				"body": "> [mg0](#comment_204_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): There was an attempt of making such a big lib here in zeronet, it was callend Antilibrary.\n\nIf the rumor was true, the developer died in a freak vehicle accident.",
				"added": 1577732285
			},
			{
				"comment_id": 356,
				"body": "I don't remember where I seen it sorry, there was once a Antilibrary Talk where users could request books, but I no longer have that address.",
				"added": 1577732446
			},
			{
				"comment_id": 357,
				"body": "> we should make a libgen zite then. \nIt would likely need to be based on some kind of merger site to portion out the documents as the latest TF article about it mentioned the total site was around 100TB.\n\nSomething that is seen on a dedicated server rather than the combined storage space of ~10-20 users who are willing to seed & stay online to host a percentage of the project. Quite Do'able, But It would be quite a task to undertake.",
				"added": 1577732720
			},
			{
				"comment_id": 362,
				"body": "> [hferbwauif](#comment_16_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): Yeah I was just joking\n\nWhile the documentation could be sourced by torrent swarms, the front end indexing page is very much susceptible to censorship and website blocking. It is a novel idea.",
				"added": 1577734537
			},
			{
				"comment_id": 375,
				"body": "It seems [zbookdb.bit](/zbookdb.bit) is finally working.",
				"added": 1577806593
			},
			{
				"comment_id": 378,
				"body": "> [zbookdb](#comment_7_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr):  I wouldn't be against a transfer\n\nsent",
				"added": 1577831958
			},
			{
				"comment_id": 380,
				"body": "> [draugrdeathlord](#comment_130_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It's a hard one to find apparently\n\nNot on the AM private tracker",
				"added": 1577840583
			},
			{
				"comment_id": 381,
				"body": "> [draugrdeathlord](#comment_135_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): ??\n\nit's a 10+ year old private tracker for ebooks, I used it for college books once upon a time.",
				"added": 1577896393
			}
		],
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 331,
				"body": "For someone who is anti-religious, you sure do obsess over the subject. You poor soul, if the love of religion hasn't consumed you, the hate for it sure has.",
				"added": 1577026305
			},
			{
				"comment_id": 333,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1369_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Because you don't understand 'how your body works' and thinks 'as a good religious'\n\nWTF are you even talking about, you're not making sense anymore.  You know religious fanatics will often attempt to dictate the actions of others right, which is exactly what you are attempting to do by claiming what does and doesn't belong on Zeronet.",
				"added": 1577027515
			}
		],
		"1577019778_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 335,
				"body": "not worth the storage",
				"added": 1577028178
			}
		],
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 336,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1372_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I made my own removing the crap:it's 'what I Advise'.\n\nWhat components did you remove? Care to share your list as I highly doubt you are capable of any that you have claimed.",
				"added": 1577028361
			},
			{
				"comment_id": 341,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1376_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the useless ones lol. Kiddo it took me three to four years to remove 'all the crap' \n\nNice platitude, with so many years of practice, it is comical that you couldn't even name one element that was suitable for removal. We can call this troll practice, you currently scored a D -",
				"added": 1577032952
			},
			{
				"comment_id": 342,
				"body": "> [hguehfauiwehfibw](#comment_9_1K2gWrwEPk1xUKM6Uq8g4AmKq6DQfJ99y6): I removed kebab.exe. am I l33t hax0r?\n\nThis world of code just because your bitch, my good Sir!\n\nI just can't help but to laugh that the guy had nothing better to do with his life but to sit there, type all of the original post of garbage, and can't even be a good enough troll to not resort to a reply of platitude when asked about one single element.\n\nOh well, back on the mute list he goes. I've had my fill of a failed troll for today.",
				"added": 1577033223
			}
		],
		"1576885309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 340,
				"body": "I know you might be to daft to understand this, but someone opting not to see your comments by granting you a mute, or someone subscribing to a blocklist that has you included on it, is not 'censorship'. They are exercising their choice to not tune in to your acts of incoherent retardation. \n\nYou are still free to spread your incoherent viewpoints of retardation to those who bother to read it, but don't expect us not to laugh at you when your attempts to force your viewpoints fail.",
				"added": 1577032761
			}
		],
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [],
		"1576765890_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 344,
				"body": "If that was the US it would just be another day of business as usual. Jeffery Epstein & Roger Ailes build their empire doing exactly that.",
				"added": 1577115369
			}
		],
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 345,
				"body": "To celebrate the occasion, there are a few Christmas Specials that have been shared on [KopyKate](/big.kopykate.bit/?Channel=htgozn2@zeroid.bit) to enjoy over those holiday feasts.",
				"added": 1577201303
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 348,
				"body": "> [xane](#comment_13_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): people who want to fuck children do not deserve to breathe\n\n(...meanwhile in the Vatican, numerous children pray for you to be more than some keyboard warrior..)",
				"added": 1577468138
			},
			{
				"comment_id": 351,
				"body": "> [draugrdeathlord](#comment_43_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): only way is the earth itself has to become totally incapable of supporting life.\n\nHumanity said 'challenge accepted'! There can even be an UberSuits app for when you want to go outside.",
				"added": 1577637413
			}
		],
		"1577480609_18geLXyGaD6oU3wBj7GXVpqP9Wk1QzGtC8": [],
		"1577574820_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 350,
				"body": "Believe it or not, I have came across more kid porn being published on these small lesser known porn upload sites on the open clearnet like xxxtubes than I have found on KopyKate.",
				"added": 1577634056
			}
		],
		"1577653744_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 352,
				"body": "I'm not a fan of PewDiePie, I really enjoyed Rosman's Rewind\n[YouTube Rewind 2019 - Rossmann Edition](https://youtu.be/AwZCHKvM4BA)",
				"added": 1577666704
			}
		],
		"1577718964_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 353,
				"body": "These mobile usage guides are becoming a bit scattered on ZeroTalk, Imo, this info really should be placed in some kind of easier-to-find location. You can always just do what I do and dump the data somewhere in a collection and put formatting later.  Such as on ZeroWiki (/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:mobile)\n\nI don't use zeronet on my mobile now but instead opt to use a private proxy, but I can imagine myself in the future wanting to.",
				"added": 1577721121
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 358,
				"body": "> [draugrdeathlord](#comment_75_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): zeronet doesn't seem to have a troll problem like the clearnet does.\n\nThat's because imagine a troll waking up in the morning, cranking up their daily clearnet, only to visit their usual forum to discover that their online identity has been added to some network wide blocklist that auto hides their comments from potentially everyone.\n\nThey often suddenly stop trolling and become a free speech advocate. It's quite the spectacle to witness.",
				"added": 1577733160
			},
			{
				"comment_id": 359,
				"body": "> [hferbwauif](#comment_15_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): I mean... If you used Reddit in the first place you kinda deserve it.\n\nBut that's not what I mean. Take ZeroVoat which is what Zeronet has closest to Reddit. If a ZeroVoat troll gets muted or placed on a blocklist people subscribe to , their content will also vanish from ZeroTalk.\n\nThere wouldn't be so many Reddit trolls if their content was removed from Facebook, Twitter, etc as consequence.",
				"added": 1577733471
			},
			{
				"comment_id": 360,
				"body": "> [styromaniac](#comment_1536_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): that people think you troll if you tell them a conspiracy they don't like to hear. [...]\n\n> anything gets you a Nazi label for nothing\nDirty tactics practiced by a dirty world. Just like the opposition would consider Zeronet & TOR as a dirty tactic suitable for such labels as such networks allow communication outside the bounds of their reach.\n\n> [draugrdeathlord](#comment_79_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): ZeroID does look a little like a InternetID doesn't it 🤔🤔🤔\n\nTo be fair, I deliberately avoid zite that use ID providers that don't also allow a way to block that ID as it would only be a matter of time before that site is ruined with spammers at a moment of relaxed moderation.",
				"added": 1577733842
			},
			{
				"comment_id": 361,
				"body": "> [quantumkitty](#comment_286_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Terms like SJW and Bigot aren't even used that much anymore. Time to evolve.\n\nComing from a family that gave me the experience of growing up in an English society speaking horrible English. I think it is more important to not let anyone get lost in translation.",
				"added": 1577734373
			},
			{
				"comment_id": 363,
				"body": "> [quantumkitty](#comment_287_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I hope we haven't been living under a rock on here just because you've avoided the clearnet for some time..\n\nYou can keep your hope to yourself, I love my rock. (or at least my area of it)",
				"added": 1577734647
			},
			{
				"comment_id": 364,
				"body": "> [quantumkitty](#comment_291_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Little do they realize that the USA is a culturally capitalist country and to have something like a UBI, in the USA, is rather generous and you'd be stupid to miss such an opportunity if you're actually progressive or left-wing.\n\nDon't worry, their endless banter won't stop their receding economy, the drastic inflation of medical and living expenses, the stagnation of wages, and the overwhelming pileup of debt. A UBI would just show the world how bad the state of the American economy really is. They have to give money away because unhindered capitalism has reached the limits of inequality to an extent that the average American has lost their buying power. \n\nPS: Even if a Universal Basic Income was granted, it would only be funneled back to the bankers if the Credit & Student load debts are not also nullified.",
				"added": 1577736834
			},
			{
				"comment_id": 365,
				"body": "> [anon05](#comment_5_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): The government prints money and gives it to the rich, though.\n\nThe rich are not tolerant of manual labor jobs and automation won't be able to replace everything. If the middle class falls out, so would the US economy. Not a good position for a country to be in after decades of creating national enemies.",
				"added": 1577737381
			},
			{
				"comment_id": 367,
				"body": "> [quantumkitty](#comment_292_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I wouldn't waste money going to college \n\nI went to college only to discover my field has been outsourced to India and that instead of a well paying wage with benefits, I get to scout for contracts with a million other enthusiastic kids desperate for work. Yeah, I would of skipped the 30k+ debt if I would have known that one too.\n\nOr at least opted to be a fucking lawyer.",
				"added": 1577739015
			},
			{
				"comment_id": 368,
				"body": "> [draugrdeathlord](#comment_89_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC):  is a private [surplus repository] that enslaves the entire country\n\nCapitalism in a nutshell",
				"added": 1577741193
			},
			{
				"comment_id": 370,
				"body": "> The countryside is virtually empty everywhere in the west....\n\nHere's a bit of advice from someone who lives in the West\n\n - The countryside is virtually empty everywhere in the west, meaning there will be an expense to build housing and utility to the place of residence in the middle of said emptiness\n - Towns are becoming ghost towns in rural areas, and before they completely implode, there is often a desperation move that causes a price hike in rent, utilities, and other local consumables. \n - They will beg you to buy which is a common sales tactic. Don't visit a Best Buy. \n - All the young people are moving to the cities to buy small apartments with minimal travel expenses because they couldn't afford to place a home in the middle of nowhere either.\n - Old people are dying off in rural areas and leaving their land to their children who then often turn around and sell it to corporations. \n - Agricultural Land, comparative to purchasing power, is now the cheapest its been in a long while. But it going to be difficult to maintain that purchasing power in an economy that laughs at a basic livable income without affordable access to medical treatment.\n\nBut then again I hear there are numerous vacancies in Flint, Michigan.",
				"added": 1577778934
			}
		],
		"1577737812_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 366,
				"body": "About four years ago I started to vape as an alternative to smoking cigarettes for 20 years. I did that for about two years until my lymph node on my neck got swollen and wouldn't go down. I went to an ENT for an examination and he couldn't give me an prognosis of what caused it without a biopsy because much like other exposures to chemicals; vaping, the metals used for the coil, the additive, and chemicals used for the dyes and flavoring were not yet regulated nor given any long term studies.\n\nI pretty much stopped cold turkey from vaping with nicotine and flavorings and went through withdrawal for about 3 months and the lump on my neck went back to the normal size after 7 months later, it's been two years since then and I haven't had any desire to vape even without nicotine simply because there are just too many uncertainties in the manufacturing process of the coil & juices.\n\nI knew something was up after it was more difficult to breath from a year of vaping compared to 20 years of smoking.",
				"added": 1577738378
			}
		],
		"1577729890_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 369,
				"body": "A blessing in disguise. It's going to either a decline in reproduction or mass genocide.\n\nI wonder if years of BPA contamination or the unaddressed leaking reactors have any influence on these statistics.",
				"added": 1577741572
			}
		],
		"1577775629_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 371,
				"body": "Without responding with some platitude, in what ways is fidonet better than this current hole of prime fertilizer??",
				"added": 1577779408
			},
			{
				"comment_id": 372,
				"body": "I didn't want to spoil my wine buzz with wikipedia, but oh well.\n\n> Throughout its lifetime, FidoNet was beset with management problems and infighting [...] The problems were so bad that Jennings came to refer to the system as the \"fight-o-net\".",
				"added": 1577780175
			},
			{
				"comment_id": 376,
				"body": "> [anon05](#comment_14_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): ZeroNet could kinda do that too but you would have to set up local trackers everywhere\n\nSee [BootStrapper](https://github.com/HelloZeroNet/ZeroNet/blob/py3/plugins/disabled-Bootstrapper/plugin_info.json) and [AnnounceLocal](https://github.com/HelloZeroNet/ZeroNet/blob/py3/plugins/AnnounceLocal/plugin_info.json) plugins",
				"added": 1577808111
			}
		],
		"1577740713_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": [
			{
				"comment_id": 373,
				"body": "If I had to pick a preference it would be Czechvar.",
				"added": 1577780362
			}
		],
		"1577722948_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 374,
				"body": "Much like Christianity, Satanism is just another religion of thought.\n\nIt takes real faith to strap explosives to one's self and go out into a public place to scream 'God is Great\" before pressing some detonation button.",
				"added": 1577780784
			}
		],
		"1577829583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 379,
				"body": "> The real challenge is to create affordable technology that anyone can use.\n\nI believe humans are not allowed to have nice things if those things do not favour those of wealth.\nA short video that helps to explain what I mean on KopyKate: [Cream by David Firth](/big.kopykate.bit/?Video=1572505223_1Fza2SFyqmiLLUc99fACNkDNPQ7k4V3935)\n\nOr via CruelTube https://www.youtube.com/watch?v=0UgiJPnwtQU",
				"added": 1577835124
			}
		],
		"1577931417_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 382,
				"body": "> The part that eludes me is the end result doesn't seem to reflect the assumed outcome...\n\nThere should be some consideration given that these corporations who are known to have surveillance contracts with the US government while operating in a war driven economy. A society that is at war with themselves will be unable to unite against those who conjured said war in the first place.",
				"added": 1577932380
			}
		],
		"1577932335_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 383,
				"body": "I'm really wondering which way it is going to go. Will the wealth let the economy crash causing extensive hardship in a time of potential conflict as the US has just spent a few decades acting as the bully of the world,\n\nKnow what happened the last time the US faced a recession followed by a depression? Food vouchers based on family size rather than wealth was given out. wellness programs such as Social Security and Medicare were created, and issued citizens were encouraged to get a post education for nearly free, all in the hopes of preventing an implosion of the country that would lead to rampant death, disease, and eventual foreign invasion.\n\nImagine that... so fear not. Actually now would be the time to get a piece of that soon to be wiped free debt pie.",
				"added": 1577932963
			}
		],
		"1577969522_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 384,
				"body": "Meh, I would rather have the CCP as world law rather than the US world law. At least with the CCP, there is a clear understanding as to what you are going to get unlike the US World law that gives financial protection to those who have the most wealth under a guise of fairness & democracy.",
				"added": 1577977182
			},
			{
				"comment_id": 390,
				"body": "> [fke13](#comment_91_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): You may also find it very predictable to go to Saudi Arabia and wave with a protest sign.  They literally chop people's heads off on a public square with SWORDS\n\nLike I said, there's no lack of acknowledgement of who's in control there, Meanwhile in the US, officers will lodge concussion grenades into a protesting crowd in the hopes of blowing off the arm of a young demonstrator.\n\n> [fke13](#comment_91_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): if You place the barrel under Your chin and pull the trigger. [...] That way You'll get an audience to Your suicide and a \"free burial\"\n\nYou're only proving my point by exercising that lack of non-violent nature of yours.",
				"added": 1577997467
			}
		],
		"1577943090_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 385,
				"body": "Not like that would matter as those who have a determination could easily clone ZeroTalk and only share that site address among their select activist members, as the address would never be discovered unless one of the machines of the visitors was compromised.\n\nBut thankfully with big data, when the nets of surveillance are cast too wide, the operators end up learning nothing.",
				"added": 1577983293
			},
			{
				"comment_id": 386,
				"body": "> [draugrdeathlord](#comment_150_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): There isn't a list somewhere that logs creation of zites ? [...]\n\nNope, that's the whole purpose of a darknet\nThe creation of sites are undocumented and random guessing them is practically impossible.\n\nIt would be like randomly guessing tthe BTC wallet address of your target.",
				"added": 1577983942
			},
			{
				"comment_id": 387,
				"body": "> [draugrdeathlord](#comment_151_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): since it's on my server\n\nUnless that server is in your physical control, it is susceptible to a court ordered subpoena.",
				"added": 1577984481
			},
			{
				"comment_id": 388,
				"body": "> [draugrdeathlord](#comment_151_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC):  but I can just give it to friends only sweet !\n\nI do this for my own easily transportable notes & document site that I use for my own personal logs across multiple devices. Zeronet will fit in nicely with your collection.",
				"added": 1577984699
			},
			{
				"comment_id": 393,
				"body": "> [draugrdeathlord](#comment_154_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): What are engine do you recommend ?\n\nFor my own notes I use ZeroWiki clone, for a favorite comment / quote / reference repository I use ZeroTalk. For my code snippits I use 0Paste",
				"added": 1578067009
			},
			{
				"comment_id": 394,
				"body": "> [hferbwauif](#comment_38_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): Unless you only access them with clients having custom trackers configured., tracker operators can know when every site is created.\n\nI don't see how you came to that conclusion when sites can be created offline. That's like saying trackers are aware when each bitcoin wallet address had been created.\n\n\nBesides, there is always Disabled.[AnnounceBitTorrent](https://github.com/HelloZeroNet/ZeroNet/blob/py3/plugins/AnnounceBitTorrent/plugin_info.json); but even then so, my cloned sites have existed for over two years now and none of them have ever had more then 1 peer while being hosted on a zerobox that is online 24/7.   Considering there has yet to be some automated script that has scraped all of Zeronet, I can't help but to wonder how valid your claim is to the ease of their discovery.\n\n",
				"added": 1578111436
			}
		],
		"1577943220_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 389,
				"body": "Just remember that no matter when or where you do it, someone, somewhere in this world, is fapping with you. :) Because that's the magic of probabilities.",
				"added": 1577985110
			},
			{
				"comment_id": 391,
				"body": "> [anon05](#comment_21_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): They are jerking off at the same time I am, not with __me__.\n\nAre __you__ going to go to every comment and interpret it as if it was directed specifically at you?",
				"added": 1577997705
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [],
		"1578136145_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": [
			{
				"comment_id": 395,
				"body": "> publicly accessible libraries, educational establishments or museums, or by archives, \n\nI have yet to see a museum or educational establishment carry the latest title of some fictional ebook or Hollywood flik. But besides that, I always found it ironic that users are not willing to even initial seed the mediocre garbage that they share.",
				"added": 1578151753
			}
		],
		"1578091204_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 396,
				"body": "imo, ID providers that don't provide a means for other users to mute IDs from that provider encourage the growth of SPAM cancer and should be avoided.",
				"added": 1578152141
			}
		],
		"1578154157_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 397,
				"body": "> I don't want nofish being able to nuke all my posts from existence whenever he feels like it.\n\n Why not create/clone and be the owner of your own board? That way you can tolerate all the spammers and child porn posters that you could want. =p",
				"added": 1578155334
			},
			{
				"comment_id": 398,
				"body": "> Because ZeroTalk barely gets enough traffic as it is for my tastes. [...] ZeroNet is basically dead except for the pornposting on Millchan.\n\nWhat are you even looking for in a decentralised darknet? Some single purpose popular social media site that doesn't include potentially illegal porn? If that's the case Fidonet may be for you.",
				"added": 1578156090
			}
		],
		"1578236236_1Y7bUwSNLFn6pLdzGyqWkMu2bieAdYsba": [
			{
				"comment_id": 399,
				"body": "Thanks for this",
				"added": 1578238126
			}
		],
		"1578223165_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [],
		"1578303373_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 401,
				"body": "Play @ [playmovies.bit](/playmovies.bit)\nUNBLOCKED @ [unblocked.bit](/unblocked.bit)\nIntergalactic File Server @ [ifserver.bit](/ifserver.bit)",
				"added": 1578322927
			}
		],
		"1578270893_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 402,
				"body": "> [quantumkitty](#comment_356_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Actually, even opt-in cryptominers are getting blocked by antivirus and browsers altogether.\n\nBecause fuck giving power to the people when it doesn't include a slew of 3rd party advertisers. (sarcasm)",
				"added": 1578323172
			}
		],
		"1578260544_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 403,
				"body": "Let's take New Zealand's social service programs for example. Do you believe those would be better managed under a private organisation?",
				"added": 1578323390
			}
		],
		"1578325176_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": [
			{
				"comment_id": 405,
				"body": "Facebook it not a neutral platform. The service has shown to social engineer the posts and articles that users are able to see. Especially near the US election seasons. It is what Cambridge Analytica was all about and nobody went to jail over that.",
				"added": 1578326806
			}
		],
		"1578305039_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 406,
				"body": "\nIn my opinion is it good advice. Smarten up. Those citizens will learn who bought their laws & politicians while they are learning to program. A coal chucker doesn't get a shit who's in office.",
				"added": 1578326994
			}
		]
	},
	"comment_vote": {
		"114_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"31_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": 1,
		"2_1E4pHuWqYkTKxPxQUCC5g1zi8AJp3PU5ZT": 1,
		"776_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1261_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"603_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"777_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"261_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"262_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"2_1KBqCUbW4CEHCXtJZRFXy6M1xcbCbAgqGs": 1,
		"1262_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"270_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"269_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"271_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"787_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"276_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"85_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"117_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"287_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"3_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": 1,
		"205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1_188woswaganmWmEP1hzi4GsRHgLPkCDkEA": 1,
		"211_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"719_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"63_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"313_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"474_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"9_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3_18ToXEcEF1nZGNJBgUzF9ocFJrGnTaePaN": 1,
		"245_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"79_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"85_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"77_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"2_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"10_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1Lqdz2qr89sLVibtztaPyAhbeDBnjDXDc8": 1,
		"200_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"201_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"706_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"15_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"25_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"937_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"16_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"938_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"14_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"31_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"26_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"37_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"49_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"18_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"2_1K5vMhAjczivFeq8wod18PcmsgbrM5BZaH": 1,
		"3_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": 1,
		"6_1D8TyrF6WYHSWMPSwRCmDR868WxaTihFjA": 1,
		"1040_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"304_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"97_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"5_19nmLTEGX8iQPtCSwQ9TnSDVJRxCBgFpSy": 1,
		"1045_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1285_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"133_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"7_1BHW9TDfbFkuPJaSZyoUTyHosRnUsFZHca": 1,
		"104_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"109_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"23_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": 1,
		"1049_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"635_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"49_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"1051_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"157_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"1053_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"4_1B8BPkJ3tf9iyQcoh9mPoocuWrvnBgn2yT": 1,
		"3_17JUgv1Am5PSRNJj3xtZKCZKd31E8eRjtS": 1,
		"8_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M": 1,
		"50_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"67_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"121_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"2_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": 1,
		"261_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"428_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"67_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"153_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_18Jd474vQNYSXv6kV7X9Jn1btPxq73HD6E": 1,
		"414_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"803_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1012_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"854_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"415_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"482_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"11_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"903_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"905_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"112_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1097_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"926_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"153_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"929_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"945_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"6_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"554_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"555_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"559_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"21_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ": 1,
		"87_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"54_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"593_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"15_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"52_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"962_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"966_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"9_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE": 1,
		"103_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"7_1CcHo4q4s8nJwtjuoNQ8C2JeVFbL3mwdER": 1,
		"631_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"441_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"972_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"64_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"171_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"974_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"172_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"27_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ": 1,
		"979_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"980_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1023_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1PMJncxnJAR5UnoxHX7ymFrEZEedmbSdku": 1,
		"31_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1105_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"56_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"11_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"998_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"17_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"66_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"384_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"35_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"25_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"70_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"247_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"34_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"389_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1006_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1042_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"755_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"40_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"1068_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"397_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1040_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1039_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"191_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"43_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"1061_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"19_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"134_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"1_1QKBw5pHsSUokVZXrvLmo4PiPytto86CMu": 1,
		"209_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"196_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"402_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"306_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"215_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"216_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"107_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"1074_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"14_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"122_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": 1,
		"1076_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1050_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1082_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"47_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"12_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"307_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"252_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"222_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1089_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"9_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": 1,
		"5_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": 1,
		"250_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"18_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"58_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"75_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"2_1FmQCziBtaj5CevDW7cfBRJ7k6rRYQ1AKK": 1,
		"1106_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"5_1FmQCziBtaj5CevDW7cfBRJ7k6rRYQ1AKK": 1,
		"5_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"252_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1066_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"213_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"313_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1067_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1100_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"418_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"20_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1074_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1072_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1075_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"24_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"255_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"80_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"23_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"101_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"30_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"11_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"272_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1099_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"790_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1096_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1098_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1099_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"273_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"30_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"37_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"30_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"24_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"14_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"17_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"177_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"221_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"423_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"17_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"1103_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"159_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"265_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"5_1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC": 1,
		"132_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1,
		"1121_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1124_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"235_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1105_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_149JsPomUWvpfHqaAPPZhdxu24FGnKVnCg": 1,
		"1_12pxfKmo6ZzL7RM8oYGGmEBCSUBZKzv7Bh": 1,
		"8_1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC": 1,
		"316_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"166_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"10_1A2qMS9kj8yHsZzuS621ttaMp8PJqT5YyU": 1,
		"237_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"15_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"1109_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"29_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"37_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"45_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"13_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": 1,
		"82_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"283_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"284_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"7_126rNR8K25HUiECkWc11qtLyWNFEbG4sV9": 1,
		"285_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"25_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"287_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"59_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1127_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_126rNR8K25HUiECkWc11qtLyWNFEbG4sV9": 1,
		"55_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"44_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"63_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"45_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"860_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"333_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"120_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"272_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"8_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": 1,
		"233_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"224_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"237_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"510_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"35_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"247_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"105_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"97_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"37_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1_1MLPKg9NExpnXsdUjqyRGMd9wZqZoubh3c": 1,
		"82_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_1PzzUPCWpWMafqr2gcvKSg84cqX7SwAgYR": 1,
		"248_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1_1PUCGkKu8TnLxyJuwKGwQXJYmiS5z2mk5o": 1,
		"251_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"3_1DwXwzh7tFMXb3HgTwPRxuKD38HVcdBiA3": 1,
		"1204_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_12qSZM3muUixgbzjXf7NFjg6nkuA8XyL5R": 1,
		"6_1JVUxDzQdXwM9ZBxqFVRqCdYJGBTiHo4Hs": 1,
		"252_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"3_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7": 1,
		"988_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"123_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1176_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1Q5QuuT62rrmmMVZ2yXg3LgRHwhUJtugkr": 1,
		"1213_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"261_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"6_1HmE9NBVKZgaidhK26GKWppmafJkrHUvej": 1,
		"1223_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"1222_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"52_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"73_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1119_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1113_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"19_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"35_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"8_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"184_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"39_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": 1,
		"3_16ASv3suyqJoy1Uzy4WB5sSQciVJetzTJL": 1,
		"834_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"269_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1346_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"44_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"1362_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_16ASv3suyqJoy1Uzy4WB5sSQciVJetzTJL": 1,
		"6_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"5_16ASv3suyqJoy1Uzy4WB5sSQciVJetzTJL": 1,
		"1379_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"270_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"55_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"12_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"3_1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx": 1,
		"1_18BU8cPZhTo3jPVUyVzVHPzwfSxXDeFHPQ": 1,
		"32_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"842_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"45_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"345_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2_1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx": 1,
		"52_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"2_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"56_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"105_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"337_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"335_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"3_1ME7Z5WLJyFnN6E32MqxEN8GLdezQYebjk": 1,
		"361_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"362_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"363_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"4_1ME7Z5WLJyFnN6E32MqxEN8GLdezQYebjk": 1,
		"1_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"852_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"339_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"82_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"23_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"4_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_1Tr8KpfPw9HXit4dC5U6Eiu3nV5pd5Cnf": 1,
		"5_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"12_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": 1,
		"1461_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1463_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1464_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"86_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"15_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": 1,
		"1467_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": 1,
		"1470_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"118_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"9_1K2gWrwEPk1xUKM6Uq8g4AmKq6DQfJ99y6": 1,
		"8_1K2gWrwEPk1xUKM6Uq8g4AmKq6DQfJ99y6": 1,
		"1_13KwoYsPQsMpKL27znfVicYa9FSPnEX73F": 1,
		"11_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"12_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": 1,
		"1490_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"9_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"10_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"1491_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"12_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"13_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"14_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"24_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"278_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"276_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"271_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1505_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"39_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"13_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": 1,
		"279_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"79_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1537_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1539_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"82_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"288_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"289_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"293_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"296_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"3_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"305_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"306_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"120_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"4_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"5_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"6_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"49_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"138_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"2_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"129_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"4_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": 1,
		"115_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"321_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"123_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"124_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"128_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"130_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"132_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"389_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1184_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"323_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"356_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"360_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}