{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565549528,
			"title": "Why contain it?",
			"body": "The analysts, strategists and other plotters embedded in governments worldwide do not single-mindedly seek power for their respective countries, not even in the US. They work to maintain ambiguous hegemony of any kind anywhere. The people and the places do not matter, so long as there is some loci of control: a group of people able to coerce and manipulate the population. Dividing the world into nation states is manageable and conducive to this plan, and superpowers are maintained for the sake of metanarratives, not for the sake of territorial expansion.\n\nTo these people, governments are havens to be protected above all else. I say this to reconcile the apparently conflicting narratives of governments manufacturing terrorism and instability and of governments seeking power and security. As societies fracture and split apart, the number of governing bodies increases. With 320 million people in its borders, no group of people could effectively control the population of the US, or be insulated from its ire when things turn sour. Things do not completely fall apart because there are people who desire explicit power: political party leaders, for example. The president of the United States wouldn't suffer a single state to secede because it is a threat to explicit power and stability. But make no mistake that those more deeply embedded do desire divisions and fractions and cracks they can slip between.\n\nThey'll keep giving schizophrenic men bombs and guns and drive them to designated shootings, and it's not for explicit power, for a party agenda, it is to build new havens. In that sense, we don't use ZeroNet because we believe a paradigm shift from central servers to p2p is necessary or imminent, but because it is a haven. The Daily Beast can bark about the threat ZeroNet poses all day, just as we can call Epstein's death a hoax or a murder all we want. But we have our havens, and they have theirs, and they are havens precisely because they cannot be affected by outcry or wills.",
			"added": 1565549527
		}
	],
	"topic_vote": {
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": 1,
		"1565617632_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567722717_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 1,
				"body": "Lately I have begun to think the Holocaust necessarily happened, not because of any evidence or witness accounts, but because the Holocaust represents the secularization of Hell, and this is a spiritual inevitability of our world. If the Holocaust hasn't happened yet, something in that vein will inevitably occur because we simply cannot resist it, in our fallen culture.",
				"added": 1565240404
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 2,
				"body": "The point of P2P isn't anonymity in the first place though. The point is that it is virtually impossible to take down the site, so they're still completely impotent.",
				"added": 1565357388
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 3,
				"body": "80% chance this is fake and they let him walk free while the media concocts a fake story to take attention off him. Literally everyone knew for a fact that they were going to let him walk with no consequences like they've been doing for decades. The idea that the justice system would suddenly convict someone like Epstein out of nowhere is absurd and unbelievable.",
				"added": 1565449490
			},
			{
				"comment_id": 4,
				"body": "Okay but, even bluepilled normies are saying it was fake, and the \"security camera malfunctioning\" thing is so on the nose, that it being a fake story is now becoming suspiciously convenient. Do the silent majority just believe it's real, and they don't expect anyone to react? When Epstein was alive, nobody ever attacked him, so it's reasonable to assume they can let him go and nobody will do anything about it. Why fabricate a story and make it this obvious? They could have done an entire fake trial and imprisonment and let him go after that.",
				"added": 1565471909
			},
			{
				"comment_id": 5,
				"body": "You can't do anything about it; all evidence will disappear, and even if you had the evidence in your hand you couldn't do anything with it. The government is invincible in this way; it is impossible to damage or criticize the government from within government institutions; it is impossible to critique a society from within spaces it controls. All court cases are completely irrelevant because they take place in courts. And the media is going to try and damage ZeroNet because it is a space beyond the direct control of the established social order.",
				"added": 1565479204
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 6,
				"body": "In the Garden of Eden, we walked alongside God and were always with him: all paths lead mankind to God and life. For there to be free will, there must be a path which does not lead to God, otherwise all choices are superficial, and the path which does not lead to God leads to death. Sin is disobedience towards God, and is the path which merits punishment. In a world created by a perfect God, all sin appears infinitely evil, in a way we cannot comprehend, and due to our original sin, all of humanity is damned to Hell, but by the Grace of God.\nI would argue that most punishments are really due to the sins of other people who wrong you, but some terrible and unjust things do happen still. In these cases I would also ask \"why does God not us further?\" We deserve absolute and endless misery, which is damnation, yet we are allowed to carry on sinning as we please. I know it really sounds like a cop-out but the trials and blessings are not random. Just as the Word of God is infinite and transcends time and vocabulary, I believe the choices and paths we are offered are infinite in their complexity and adaptability. Each choice brings us closer or further from God and always nearer to a destination. Some choices bring us to trials or blessings, but it is never over when it does: there are always more paths and choices ahead, and whatever grave injustice you face now is not the end. If the Bible teaches us anything, it is that even the most innocent among us can still be made to suffer, and it is not because they have sinned.",
				"added": 1565480667
			},
			{
				"comment_id": 7,
				"body": "> [kidcourageous](#comment_81_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Without the apple we were mindless cattle.>  [...]\nI have to disagree: in Eden, mankind spoke with God, and could ask him anything, we had access to all of God's omniscient wisdom. The taste of death was the only thing we did not know, and that is the only knowledge the forbidden fruit held. Satan did not free us, we were made free to sin by God's own will.\nFurthermore, God told Satan he was subservient to Adam and Eve when they were created. Humanity was made in his image, meanwhile Satan wished to have that honor and glory for himself. He lead his rebellion in Heaven and was cast down at its end; he sought to dethrone humanity and invited us to sin. Satan does not care for your freedom, he only wants your submission.",
				"added": 1565481329
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 8,
				"body": ">Bombing the bridge\nI'll be impressed if it happens. I know the FBI has been giving bombs to some of the mentally unstable people they recruit for shootings and other attacks, but they tend to be fake bombs.",
				"added": 1565548273
			},
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_996_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm developing schizophrenia\n\nIn a metaphorical sense, I hope ... I've been on ZeroNet for years using other IDs, your blog and zites always been a strong pillar of the community, even though I don't agree with some of the things you've posted about privacy in the past, I would never wish ill on you my guy.",
				"added": 1565586838
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 9,
				"body": "I'm enjoying /cm/ as we speak.",
				"added": 1565586622
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 11,
				"body": "Between the two, KDE. I personally say don't use a DE though, use a WM like Openbox.",
				"added": 1565623750
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "We don't live in a free society to begin with, what you rail against is a society of control where vast portions like schools, infrastructure, and the monetary system are completely owned by the state, and where the state manipulates corporations into serving it and vice versa. If this is capitalism, then yeah I'm against it too. I want to be rid of the state to achieve this, I know others thing regulation by the state is the solution instead, but I guess as long as we hate the same thing we have something to talk about. That's all there really is to do, since critique or improvement of a system from within that system is impossible. Also, nobody tweeted \"Trans rights\" before it was guaranteed to get them likes and retweets.",
				"added": 1565624428
			},
			{
				"comment_id": 13,
				"body": "> [r6uysrgw4g4tg](#comment_19_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): Wall Street ... Walmart ... Insurance ... Loans ... credit cards [...]\nYou literally just made this language barrier out of thin air. People selling stocks which they own at exchanges is no different from people selling fish which they catch at a market, in a moral sense. People go to Walmart because they have families and want lower prices are things like children's clothes, diapers, cleaning products etc., are you saying we just can't sell things at a certain price? What about the fish at the market--is he allowed to sell it but only at a price you approve of? Insurance is just the communication of information: how much do people value certain services and things. If it's so wrong, then literally don't buy it; legally required insurances are a state program, not a market one. Same with loans, if it's bad then don't do it, it will drive up the value of good loans until people start loaning out money at more agreeable interest rates.\nMost of the things you describe are regulated or plainly controlled by the state, but then things like insurance and credit cards aren't, so I don't see what your point or guiding principle is. Instead you just seem to judge things by taste: \"does it visually fit in with my ideal or not?\" You would need a massive, all-powerful government lording over all human interactions to regulate everything so arbitrarily. And to wish for this kind of power over others is a form of greed that surpasses anything you imagine to be on Wall Street.",
				"added": 1565625760
			},
			{
				"comment_id": 14,
				"body": "> [memesadler](#comment_34_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Capitalism is great. I can buy politicians with my compound-interest usury scheme, subvert the society of human cattle to enslave them, and then watch as they defend my tribe's right to do this because they can't distinguish free enterprise from exploitation.\nPeople cannot tell the difference between the two because they themselves are exploiters and not guided by any principle which forbids it. Applying the non-agression principle universally is too inconvenient and so people invent distinctions based on taste and aesthetics, not on morals or reason. It's why propaganda is so effective: create tastes, trends, subjective preferences, and you can control something as supposedly absolute as morals in this way. A farmer's market and stock exchange are principally the same, but aesthetically different, that's the only reason some people hate one and not the other. Rather than agreeing that voluntary transactions free from coercion are morally just, things are judged by how they make us feel and if they look nice when you frame a photo of them on the wall.",
				"added": 1565628732
			},
			{
				"comment_id": 15,
				"body": "> [r6uysrgw4g4tg](#comment_20_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ)\nI wrote a long response and then accidentally pressed some key shortcut to go back a page, so rip. So I'll do a streamlined version, because I still appreciate the response.\n>Stock brokers and retirement funds\nYou and I can't buy stocks in new companies like Twitter when they're cheap because the government only allows state-backed firms to have access to those stocks, meaning these large trading companies benefit the most from pumping up the value of stocks as much as possible, without the moderate voices of smaller traders interfering.\nRetirement funds used to invest almost entirely in bonds because the slow accumulation of interest was enough to outweigh value lost to inflation. The government has made treasury bonds virtually worthless because it makes it easier to pay off debts to foreign countries who have bought US treasury bonds; as a result, retirement funds in the last several years have had to invest in the more volatile stock markets in order to make their necessary returns for retirees. As a result, the biggest funds in the US can lose hundreds of millions of dollars in a single week of trading. \n>Superstores\nOnline shopping and physical superstores save people money which then gets spent in other sectors of the economy, while making it more viable to buy houses and start families. People have access to books and materials they would not have been able to acquire before. I do not believe it is possible to evaluate the economic or personal benefits of these things and then subsequently claim small stores provide greater value.",
				"added": 1565637678
			},
			{
				"comment_id": 16,
				"body": "> [r6uysrgw4g4tg](#comment_22_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): I don't have blind faith in Statism.\nBut you're also saying that the state can be improved, and fixed? The state is compulsory by nature, and by design it can never be voluntary. If people within the state wish to be free of it, then they are destroyed by it. It is illegal to secede from the union, you will be executed if you don't pay taxes, even if all of your taxes go to paying off interest on the national debt, or to foreign wars. Why would a state improve if it has this kind of power of people? It is not as a father caring for his children. We are ants to these people, and it's because the existence of the state creates logically contradictory groups of people: those who must obey the non-aggression principle by law, and those who are above them.\n\nYou're saying people like Jeff Bezos must adhere to a universal principle, that his economic activities ought to be for the benefit of the United States, yet the government itself is exempt from universal morals and ethics. The government is allowed to initiate the use of force against anyone, but if you attempt to use force against them, you are in violation of their laws. They create courts and laws which you must follow, yet nobody else is allowed to create judicial or legal systems. So the government is exempt from all things which apply to its people, yet you expect people to obey universal ethical codes?\n\nThe definition of \"the people\" whom the government is meant to serve is itself decided by the government. The governments of socialist countries in particular have been more than eager to eliminate ethnic and religious groups within their borders rather than grant them sovereignty. On some level I agree, that biologically distinct groups of people are a natural basis of organization. And I imagine we'd agree that culture, personality, intelligence, etc. all stem at least partly from genetics, and thus vary among ethnicities. But that just turns state power into a weapon for groups to use against one another instead of negotiating. Cooperation is basically always preferable, I believe, except to those who may use violence to take what they want, and so states regularly compete with acts of force, including embargoes.",
				"added": 1565649029
			}
		],
		"1565639543_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 17,
				"body": "Check out ZeroMe. It's more suited for one-off comments like this. Helps keep the talk pages more concise.",
				"added": 1565662104
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 18,
				"body": "People pay for what they value. If you have no skills and your labor is easily replaced by others', then don't expect anyone to want to give you much for it.",
				"added": 1565705759
			}
		],
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 19,
				"body": "I believe you're right about Firefox disabling the extensions in support of a government sting. But I don't think we should be trying to make something equal to the internet, with \"no difference\" as you say. I say let them have it, let Hollywood have all the movie franchises, let governments and government-backed/protected corporations have the clearnet etc. The only way to make anything of this is to keep it separate: you cannot critique or improve a system from within, so our only recourse is to remain outside.\nI also think we should obey/enforce laws as little as possible. Not that we should deliberately do terrible things, but that we should not accept legality as an argument for or against anything. Culture > Laws, that's how it is everywhere you go.",
				"added": 1565885477
			}
		],
		"1565914918_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 20,
				"body": "Never post here again.",
				"added": 1565916744
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 21,
				"body": "I was thinking about Seth Rich earlier today, and how sadly he died for nothing. The DNC leaks have affected absolutely nothing, and their party has not changed in the slightest even after the revelations. It's at least a lesson in the futility of political change.",
				"added": 1566157513
			}
		],
		"1566251733_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": [
			{
				"comment_id": 22,
				"body": "I use Naked Browser pro. The free version is perfectly fine, I just bought pro as a donation pretty much. It's highly customizable, and someone using a phone from 2013, it is useful to be able to keep cache size and RAM usage low. If you have a more modern phone then you can still take advantage of some features like keeping 15 tabs loaded at once to switch between. You can use custom HTML for the new tab page, so I have some cute ascii and my bookmarks loaded each time.",
				"added": 1567367663
			}
		],
		"1567722717_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 23,
				"body": "Works for me tooooo. Thanks for the reading material too, I used to read Anarchist Developments in Cultural Studies some, but didn't get to a lot of the issues. Maybe it's because I'm not a 'real' anarchist like this FAQ says :b",
				"added": 1567741078
			}
		]
	},
	"comment_vote": {
		"3_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"1_1AvvkCBLN1RLeneDikTfHQ6GkvARNoggSW": 1,
		"1_13v75z66xMg9xXt6aJ25gahjDpCNgUooNL": 1,
		"984_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"15_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"80_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"36_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1
	}
}