{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Чем заменить смартфон?",
			"body": "В последнее время всё плотнее начал осознавать, что меня достали смартфоны. Просто как класс устройств. Сама концепция интерфейса, заточенного исключительно под тыкание пальцем в экран убога и неудобна, доминирует же на рынке она за счёт простоты — ткнуть в картинку сообразит даже обезьяна, страдающая олигофренией. В мире маркетинга, победившего здравый смысл, именно доступность для идиотов является решающим фактором — то, что это идёт в ущерб эффективности, надёжности и собственно удобству, мало кого волнует. Тачскрин удобен в очень ограниченном количестве операций — это:\n- изменение размера и положения объектов и регулирование масштаба\n- в некотороых случаях — прокрутка текста (но неспроста в большинстве браузеров и читалок электронных книг для мобильных устройств есть возможность прокрутки клавишами громкости)\n- рисование и рукописный ввод (причём последние два — с оговоркой, что стилус несравнимо удобнее пальца).\nВвод приличного (то бишь нетвиттерного) объёма текста на экранной клавиатуре, равно как и работа в приложениях, подразумевающих большую, нежели тыкание лайков, активность на смартфоне превращается в пытку. Попытки исправить ситуацию вроде swype и более экзотических, типа MessageEase, достойны уважения, но по-прежнему неудобны и не способны исправить фатальный недостаток — заточенность интерфейса под дегенерата, способного исключительно потреблять \"контент\" и лайкать бугогашечки.\n\nПроанализировав, для чего я собственно использую смартфон, а это:\n- музыкальный плеер\n- доступ к заметкам, которые я предпочитаю набирать на полноценной клавиатуре компьютера (в моём случае используется персональная установка [Etherpad](http://etherpad.org/)\n- переписка в мессенджерах типа jabber и telegram (по возможности также используется клиент на ноутбуке, ибо печатать удобнее)\n- фотографирование интересностей или объявлений/расписаний, которые лень переписывать\n- собственно телефон\nя прихожу к выводу, что собственно смартфон мне не нужен, а сама покупка устройств этого класса (в моём случае, по крайней мере) — просто приступ потреблядства и проявление конформности мышления.\n\nТак как, по сути, смартфон представляет собой крайне недолговечный одноплатник с убогим интерфейсом и весьма ограниченными возможностями для изменения \"под себя\", прошу помощи сообщества в подборе вариантов. По большому счёту, лично мне требуется то, что когда-то звалось КПК, с интернетиками и возможностью принимать смс (GSM-звонки желательны, но совершенно необязательны в силу наличия обходных решений, например от Sipnet). Главными требованиями, не касающимися напрямую функционала (по уменьшению значимости) являются:\n- надёжность/долговечность\n- максимально возможная в данном контексте открытость (из чего следует возможость \"допилить\" как минимум програмную часть)\n- возможность обновления аппаратной части\n\nПожалуй, близким к идеалу носимого устройства, из того что мне попадалось в свободной продаже, является [Dragonbox](https://www.dragonbox.de/en/45-pyra) в версии со слотом для симкарты, но\n- цена в 600 евро тормозит экспериментаторский пыл\n- огромный кусок клавиатурного пространства сожран игровым контроллером, которым заведомо не буду пользоваться",
			"added": 1487831936
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk": [
			{
				"comment_id": 1,
				"body": "> [balancer73](#comment_79_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw):\n\nПринято к обдумыванию ) Вообще, мне, видимо, просто не упёрся сам класс устройств. Взять современное прочтение недобука и звонилку/модем видится годным решением. Но весьма актуален вопрос долговечности и обновлябельности аппаратной части.",
				"added": 1487865732
			},
			{
				"comment_id": 2,
				"body": "> [mist](#comment_18_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Он тебе так не упёрс, что ты хочешь замену привычного смартфоновского функционала. Чем это не потреблядство?\n\nЯ хочу удобства, \"кастомизабельности\" и надёжности. Всего этого то, что ныне зовётся смартфоном, предоставить не может. Какая связь с потреблядством?",
				"added": 1487868264
			},
			{
				"comment_id": 3,
				"body": "> [mist](#comment_19_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Такая, что ты в условиях наличия вообще устройств такого рода, жалуешься на отсутствие девайса под свои вкусы. А ведь ещё не так давно, функционал мобильных устройств был куда скуднее. А сегодня тебе нужен телеграм.\n> Так то, можно подобрать телефон, если пересмотреть потребности.\n\nГрустно, ты нихера не понял из прочитанного.",
				"added": 1487872470
			},
			{
				"comment_id": 4,
				"body": "Обсуждать, по итогам вброса данного текста на нескольких площадках, больше и нечего. Либо жричодали — сиречь, тупо следуй за маркетолухами (что является потреблядством с моей точки зрения), либо комбинировать хорошо зарекомендовавшие себя в прошлом устройства, ну или типы устройств в современном прочтении (что является весьма нетривиальной задачей в силу их ограниченной доступности в продаже), либо пытаться отыскать устройство под мои личные потребности (что по непонятной мне причине объявляет потреблядством mist)...\nМестное сообщество с последним пунктом помочь явно не в состоянии.",
				"added": 1487874000
			},
			{
				"comment_id": 5,
				"body": "> [zalex](#comment_69_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Тогда уж лучше дождаться Neo900\n\nНу, по итогам трёпа на ЛОРе, например, осталось два варианта: N900 (или Neo900, да) и GPD Pocket (или подобное нетбукообразное).",
				"added": 1487921743
			},
			{
				"comment_id": 6,
				"body": "> [mist](#comment_20_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): На лоре прошел мимо заголовка, а оно ещё и даже неплохо, оказывается. Краудфандинговая компания очень успешная. Да и сам дизайн очень хипстерский на свою цену. Правда, форм-фактор не годится на замену смартфону, ввиду трудности использования на весу. Штеуд и вентилятор там лишнее.\n\nТам нет слота для симкарты, вот то меня расстраивает. Насчёт штеуда, пожалуй,  соглашусь, а вот активное охлаждение, по моим наблюдениям, на долговечности сказывается чаще всего хорошо, ибо меньше перегрева.",
				"added": 1487924502
			},
			{
				"comment_id": 9,
				"body": "> [zeroalx](#comment_19_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): Из современного:BlackBerry Q10/Q5/Classic. Да сенсорное, но с удобной клавиатурой. Нативных приложений только маловато, но можно запускать apk-шки.\n> Из древнего:Nokia e75 - это просто шедевр смартфоностроения, увы такого уже не выпускают.Ну и вообще symbian'овские сматрфоны досенсорной эрой были неплохими девайсами.\n\nХм, не первый раз Blackberry советуют. Может, и стоит присмотреться, но ведь проприетарщина...",
				"added": 1488224197
			},
			{
				"comment_id": 12,
				"body": "> [zeroalx](#comment_26_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): https://geektimes.ru/post/286412/ Тут еще новый BB KEYone на свежем ведройде выпустили. Тоже с физической клавиатурой на которой можно как нажатиями, так и швайпом набирать. Но, блин, это-же ведроид...\n\nпо ссылке более интересен перезапуск некронокии :-)",
				"added": 1488300796
			},
			{
				"comment_id": 13,
				"body": "> [zeroalx](#comment_28_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): https://www.indiegogo.com/projects/gemini-pda-android-linux-keyboard-mobile-device-phone#/ вот тут чуваки пилят деньги на смартбук с более вменяемой клавиатурой.\n\nТам русская раскладка не поместится.",
				"added": 1488611223
			},
			{
				"comment_id": 14,
				"body": "> [mist](#comment_38_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Новые фоточки Pinebook\n\nДа, pinebook симпатичен :-)",
				"added": 1488611288
			},
			{
				"comment_id": 15,
				"body": "но симки у него нетути.",
				"added": 1488612251
			},
			{
				"comment_id": 16,
				"body": "В итоге пришёл к выводу, что идеальным вариантом лично для меня будет комбинация из обычной прочной звонилки (все девяностые хотел себе нормальную раскладушку, но что-то не складывалось, теперь, пожалуй, выхвачу LG G360 или подобное) и современной версии недобука (склоняюсь к варианту [GPD Pocket](https://www.indiegogo.com/projects/gpd-pocket-7-0-umpc-laptop-ubuntu-or-win-10-os-laptop--2#/) )\n\nА камеру, пожалуй, можно и плёночную реанимировать, благо имеется в загашнике Зоркий родом из детства. Для съёмки же объявлений/расписаний достаточно любой затычки на 0.3 мегапикселя.\n\nДа, с открытостью и апгрейдами в случае звонилки я пролетаю, но тут GSM сам по себе не оставляет шансов, зато выигрыш в надёжности несомненный.",
				"added": 1488733602
			}
		],
		"2_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 7,
				"body": "Я пользуюсь. Народ есть, шевеление и интересные дискусси присутствуют. Но, во-первых, ключевые проблемы уже mist озвучил, во-вторых русскоязычных таки немного (хотя тусовка и поактивней зеронетовской).",
				"added": 1488103222
			},
			{
				"comment_id": 8,
				"body": "Особенно меня, как пользователя, раздражает бесконечная прокрутка и невозможность пользоваться без JS. Но в целом несколько приятней фкантактика и фейлбука. \nGNUSocial - таки малость другой формат и сравнивать их некорректно, ящитаю.",
				"added": 1488103339
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 10,
				"body": "багрепорт отправляли уже?",
				"added": 1488239608
			},
			{
				"comment_id": 11,
				"body": "Откуда мне знать — не я ж хакирь :-)",
				"added": 1488258623
			}
		]
	},
	"comment_vote": {}
}