{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1586039346,
			"title": "Наткнулся на любопытный канал в LBRY посвященный 5G сетям и некую теорию заговора с Covid-19)) На слух в англ. не силен, кто что думает?",
			"body": "LBRY channel \nhttps://open.lbry.com/@TRUTH-ON-5G:1?r=Dtjr4BTY3hxbrHi8TQFrctsMvZoUHfjk",
			"added": 1586039345
		}
	],
	"topic_vote": {
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": 1
	},
	"next_comment_id": 12,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "кукузямба",
				"added": 1585396034
			}
		],
		"1584803286_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC": [
			{
				"comment_id": 2,
				"body": "ввести систему рейтингов и фильтрацию настраиваемую пользователем",
				"added": 1585720223
			}
		],
		"1585772185_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 3,
				"body": "буэ windows клиент тока",
				"added": 1585847347
			}
		],
		"1586030691_1QKthGzNypqBm38Z4CCCqxxMnfm1KT8KX5": [
			{
				"comment_id": 4,
				"body": "водники?",
				"added": 1586039053
			}
		],
		"1586039346_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": [
			{
				"comment_id": 5,
				"body": "Так-то у нас в России 5g сетей еще и нет, правда есть всего одна точка билайн в Москве (по карте покрытии в России по операторам).\nhttps://www.nperf.com/ru/map/RU/1496747.Novosibirsk/21937.Beeline-Mobile/signal/?ll=55.718130961361894&lg=37.56195545196534&zoom=16\nhttps://www.speedtest.net/ru/ookla-5g-map",
				"added": 1586039739
			},
			{
				"comment_id": 6,
				"body": "> [cra](#comment_71_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): По-моему это параноидальная шизофрения\n\nвозможно) я ничего практически не принимаю и не отвергаю, если есть хоть немного разумного прислушаюсь но до конца не приму, пока не будет прямых фактов",
				"added": 1586092198
			},
			{
				"comment_id": 7,
				"body": "есть и военное применение 5g\nhttps://ntp.niehs.nih.gov/ntp/about_ntp/trpanel/2018/march/presentations/15devra_508.pdf",
				"added": 1586092824
			},
			{
				"comment_id": 8,
				"body": "да все норм так-то, всегда когда что-то внедряют, начинают появляться люди с загонами, просто интересно что каждый думает",
				"added": 1586099611
			}
		],
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": [
			{
				"comment_id": 9,
				"body": "а возможно и другое, если подумать) подумать головой верхней)\nВсе страны не наращивают военный потенциал? Кто более всего наращивает? Возможно ли победить имея ядерное оружие? Теоретически, биологическое оружие возможно ли, почему нет? И возможен сценарий учения, чтоб посмотреть реакцию на это всех чтобы учесть все меры? Нужен ли при этом карантин? Иногда правильные вопросы могут дать ответы.",
				"added": 1586417793
			},
			{
				"comment_id": 10,
				"body": "даже если короновирус лишь проект, чтобы мир в него поверил нужны реальные случаи заражения! но если нет способов сдерживания вируса который предположим где-то в секретной лаборатории делают для будущих скрытых войн уже биологическим оружием то те кто это делают безумцы, вирусы не подконтрольно распространяются очень быстро и непригодны в качестве оружия! опять же если нет способа избирательного инфицирования, или ручного где способ проверки от него включает заражение им, не знаю, можно строить множество версий)",
				"added": 1586753401
			},
			{
				"comment_id": 11,
				"body": "Вот боюсь, если честно вакцину больше чем сам вирус, просто думать что вирус можно использовать как биологическое оружие безумно, а вот вакцина ... это гениально) \nВот реально, разговоры о неком золотом миллиарде, и  скрижали в Джорджии, и высказывания английской короны о том что надо бы для планеты подсократить все человечество, т.к. слишком большой урон от инфраструктуры людей, безудержное потребление и т.п. Технически люди уже многое создали что могло бы пригодиться без большого количества населения.. Хотел бы поверить в обратное, но сама мысль что это гипотетически возможно пугает, надеюсь я сошел с ума раз так думаю)))) хотелось бы иметь какието 100% доводы..\nВот некие мысли Катасонова\nhttp://zavtra.ru/blogs/stanet_li_vaktcina_ot_koronovirusa_sposobom_unichtozheniya_chelovechestva",
				"added": 1587057226
			}
		]
	},
	"comment_vote": {
		"1_18keR867hn3rmzisEPoADwrXkyT6v4eqVS": 1,
		"73_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"2_1PHntD2ruZCta8SpVvFTjvDSKaCZZEaXRG": 1
	}
}