{
	"posts": [
		{
			"id": "48df2ebf-7faf-4f4d-bc6c-8b75d822ef1f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "0fee6667-d79a-4795-ab3f-6238c1af934a",
			"body": ">>0fee6667-d79a-4795-ab3f-6238c1af934a\nThe game was just a stupid vanity project made to meet celebrities. If you want a cameo by Lady Gaga, then normally you'd just use her likeness and not bother much with her voice, especially when it's someone not known for their speaking voice; but instead they use the actual celebrity, which is needlessly expensive. The reason being, the big dick in charge gets to meet her and take her out for lunch between mo-cap sessions.\n\nBasically nobody making the game actually cares about the game, the entire project is just an aesthetic on top of a GTA clone. People stopped writing cyberpunk fiction because it became irrelevant: technology got taken over by governments, corporations, and the masses, so you can't use it to criticize anything anymore. 8ch getting destroyed is proof that technology is irrelevant as a tool for criticizing things. For them to be making a cybperunk game now just means they're doing it for the looks and the memes. And some retarded shit like \"Does being augmented make you less human?\"",
			"time": 1569972760145,
			"files": "[]"
		},
		{
			"id": "6c7550c2-1bd1-4f2c-bdf3-4d47579ffcc7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "0fee6667-d79a-4795-ab3f-6238c1af934a",
			"body": ">>fe151f27-93f4-4f20-98b2-48a07be2da93\nIt mostly has to do with new technologies being exploited and dragged down by the masses, so we're in a technological Malthusian trap. We get highspeed internet, then it becomes useless because all your neighbors are streaming three different sitcoms at 4K and you have to wait until midnight for it to speed back up again. Basically it's like we're still living with dial up where you can't use the internet while someone else is on the phone. The only reason people want 5G is because they send hundreds of gigabytes of snapchat photos a month. Literally no one needs more than 4-5GB of phone storage yet new phones are driven to include hundreds because of this.\nTechnology isn't being driven by any meaningful intent, it's just for the sake of satisfying the lowest common denominator. Governments have also made spying more profitable than consumer services, so the only real advances you'll see are in spyware and monitoring devices like Echo, or Alexis, whichever one is made by Amazon who has hundred-million dollar contracts with the CIA.\n\nAlso the \"tech-literate millennials\" thing is a myth . They are able to navigate UI's but not much more. The death of computing is dense layers of UI's. Users are separated from the computer by so many degrees of UI that they don't actually know how to interact with the program, just with the UI. Every UI has its own learning curve and retarded idiosyncrasies you have to figure out to use it, whereas running something in the terminal is simple, verbose, and universal. But you can't open up the terminal on your iPhone and give commands and arguments to get what you want, you have to wade through unique UI hells and correct the program several times along the way.\n\ntl;dr APPS APPS APPS APPS APPS",
			"time": 1569977692045,
			"files": "[]"
		},
		{
			"id": "ff4cd9b9-be62-4ae9-af32-454df1cb183a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "0fee6667-d79a-4795-ab3f-6238c1af934a",
			"body": ">>fe151f27-93f4-4f20-98b2-48a07be2da93\nP.S. on diversity hires: yes Indian programmers do fuck things up, but this basically only affects consumer technology companies, like Microsoft and Google. Neither MS nor Google have been relevant in computing since their inceptions, the fact that OS's like Windows and whatever Apple makes rely on code libraries from open source projects like OpenBSD tells you what you need to know. Consumer technology companies aren't innovating anything, they're just packaging and marketing technology made by someone else. Yeah, Windows is getting worse and can't even fit on a 4GB DVD anymore, but does that really matter? If you want quality, don't use a consumer-grade operating system.\nGoing back to the whole millennials thing: the early adopters of personal computers in the 80s and 90s had some degree of understanding of the actual machine they were using--the guys who talk about programming games in basic as kids--and that was a small percentage of the population. Most people didn't use computers at the time. Today, most people use products like Windows, which does not require any understanding of the machine you're using; a smaller percentage of the population uses less abstract software and operating systems, but in reality it's probably the same proportion of society as in the 80s and 90s. I don't have any real numbers but let's say 5% of the population: the new generations aren't \"tech literate\", it's still just 5% of them now, as it was 40 years ago.",
			"time": 1569978252745,
			"files": "[]"
		},
		{
			"id": "073c4a1d-52ee-4a36-80a7-78799445338a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "23205214-b278-4c73-a279-571126c56cf4",
			"body": ">>23205214-b278-4c73-a279-571126c56cf4\nI just found out that players can make roads for each other, and that you have a motorcycle that goes fast as fuck when it's on the \"power grid\". I say we forget about this \"reconnecting the world\" crap and make a downhill drift track, compare time slips and see whose the true downhill legend. The game also has a baby so we can probably make Muscle Roller Legend 3 with this game.",
			"time": 1570161959555,
			"files": "[]"
		},
		{
			"id": "237a3b8f-a165-434b-ad30-35999e47a278",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "dd469e1c-bd86-4673-b294-8e3ac36ab130",
			"body": ">>dd469e1c-bd86-4673-b294-8e3ac36ab130\nNah, never going back. It's slow here, but this is the future. Give it time, this is all that will remain.",
			"time": 1570419205541,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}