{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1575905163,
			"title": "( آموزشی (چطور در زمان قطعی به اینترنت وصل بشیم",
			"body": "آموزش دور زدن اینترنت ملی",
			"added": 1575905162
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1575719026_1J8Z3dnffKkBzmtdNjCUVPa4DWNGPLqn9L": [
			{
				"comment_id": 1,
				"body": "کاش میشد دسترسی به سایت ها هم فراهم بود",
				"added": 1575841637
			}
		],
		"1575880017_1Gdc3eMkRLN8XLpkw5eyVunGAcnTegJJkD": [
			{
				"comment_id": 2,
				"body": "> [behdad](#comment_3_1LQQUaNQXzMad9UJ3qWDgK9ss6YMWg1o8C): این فقط برای چت کردن هست راهی برای بقیه اینترنت هست که زمانی که قطع بشه بتونیم بقیه سایت ها رو ببینیم\n\nبعید میدونم باشه مگر اینکه اینجا پروکسی قرار بدن",
				"added": 1575901626
			}
		],
		"1575905163_19GLaMks6RC8w69H2QqkQNH4UKj95ne1Cz": [
			{
				"comment_id": 3,
				"body": "آموزش اول (راحت ترین راه) اول یک سرور ایرانی تهیه میکنید که هزینه آن تقریبا بین 50 تا 100 تومن هست  سپس یک سرور خارجی تهیه میکنید هزنیه تقریبا 50 تومان  . ابتدا به سرور ایرانی ریموت میزنید و سپس از سرور ایرانی به سرور خارجی ریموت میزنید یعنی اول به اینترانت وصل میشید و از ان به اینترنت جهانی متصل میشید",
				"added": 1575905342
			},
			{
				"comment_id": 4,
				"body": "> [beygi1368](#comment_5_19E14rWN77YTRpN3j1diXKM97q5WBytw6z): اینترنت ماهواره‌ای\n\nعزیز اینترنت ماهواره ای نویز میندازه و حکومت سریع متوجه شما میشه و به اتهام جاسوسی دستگیر میشید سعی در این هست روش هایی گفته بشه که ریسک  آنها کمتر باشه",
				"added": 1575905403
			},
			{
				"comment_id": 5,
				"body": "> [mosttafa](#comment_1_16A8UiASviVmGUCmrvpWtGzwsWRGM6AF4x): چطور میشه سرور خارجی تهیه کرد زمانی که اینترانت بشه\n\nسرور های ایرانی اینترنت دارند و میشه ریموت زد به اونها  بعد از داخل آنها به سرور های خارجی وصل شد",
				"added": 1575905573
			},
			{
				"comment_id": 6,
				"body": "آموزش دوم (کمی نیاز به دانش شبکه و میکروتیک داره ) ابتدا یک سرور میکروتیک ایرانی تهیه میکنید و از طریق وینباکس به اون وصل میشید بعد از کانفیگ اولیه سرور ابتدا بر روی قسمت  آیپی رفته و از داخل قسمت آی پی روی ساکس کلیک میکنیم  در پنجره ای که باز میشه ابتدا تیک فعال سازی رو میزنید  سپس پورت دلخواه رو وارد میکنید و اپلای میکنید سپس برنامه پروکسی دروید را نصب کنید و مشخصات پروکسی خود را وارد کرده  و فعال کنید سپس فیلتر شکن خود را فعال کنید البته میتونید پروکسی رو داخل خود وی پی ان سایفون اد کنید",
				"added": 1575905820
			},
			{
				"comment_id": 7,
				"body": "> [13apr2001](#comment_2_1HvS9w1ovcevi2Kc3mCEahFpgXZkxduWhG): مطمئن باشید این دفعه اگه قطع کنن یه فکری واسه سرور ایران میکنن\n\nنمیتونن چون اکثر سایت ها و ... داخل سرور های ایرانی هست",
				"added": 1575905992
			},
			{
				"comment_id": 8,
				"body": "> [13apr2001](#comment_3_1HvS9w1ovcevi2Kc3mCEahFpgXZkxduWhG): خب به اونا مجوز میدناگه کسی مجوز نتونه بگیره سروری هم در کار نیس\n\nباز هم راه هست که افشا نمیشه .....",
				"added": 1575906106
			},
			{
				"comment_id": 9,
				"body": "ساخت پروکسی رو سرور های ویندوزی : ابتدا برنامه سی سی پروکسی را داخل سرور دانلود و نصب میکنیم سپس آن برنامه را بازکزده بعد از کرک رو آپشن میزنیم  سرویس هایی که نیاز هست تیک میزنیم و پورت دلخواه رو وارد میکنی میتونید یوزر پس و ... بزارید داخل  در قسمت اکانت . سپس پروکسی رو بر روی دستگاه خود ست کرده و وی پی ان خود را روشن میکنیم میتونیم به جای  وی پی ان تور رو روی سیستم ست کنیم و از اینترنت جهانی استفاده کنیم",
				"added": 1575906456
			},
			{
				"comment_id": 10,
				"body": "دوستان لطفا زیرو نت رو به تمام دوستان و آشنایان معرفی کنید تا با ارتباط با هم بتونیم در زمان تظاهرات این رژیم ضالم  و عقب مانده را سرنگون کرده و انقلابی نو را آغاز کنیم و میهن و وطن خود را  پاکیزه سازیم",
				"added": 1575906706
			},
			{
				"comment_id": 11,
				"body": "> [gstar](#comment_1_15EZ9hJtEB3if1FHjak4uDmbn28G3WabAC): به دیتاسنترها فشار اوردن خیلی سختگیری میکنن دیگه پروکسی ایرانی دیگه گیر نمیاد از این به بعد، این برنامه هم معلوم نیست چجوریه میشه روش حساب کرد یا نه\n\nآره دیگه باید به فکر پروکسی اختصاصی باشید : )",
				"added": 1575981925
			},
			{
				"comment_id": 12,
				"body": "> [amir59](#comment_3_1AeBbm4qVhVzEDKrXHX1HdjFXAk4QFi8Av): اولین روزیه که من به زیرونت وصل شدم، چیزی که توجه امرو جلب کرد نبود اطلاعات موثق و معتبر در باره نحوه استفاده از زیرو نت هستشف همچنین من هنوز نتونستم دستورالعمل یا تکست فارسی در باره تنظیمات و نحوه استفاده از این برنامه هم پیدا کنم. اگر قرار باشه بشه از این د رمواقع قطع دسترسی ها استفاده کرد باید دستورالعمل های فارسی قبلش تهیه شده باشه\n\nآموزش خاصی لازم نداره یه ایمیلش لازم داشت فقط که گذاشتم :)",
				"added": 1575981988
			},
			{
				"comment_id": 13,
				"body": "یک روش دیگه برای دور زدن اینترانت این هست که یکسری وی پی ان خاص تهیه کنید که با اینترانت هم کار میکنند قیمتشون هم بین 10 تا 15 هزار تومن هست داخل میدون انقلاب میفروشن هم چنین در میدان ولی عصر  هم میفروشند البته به سختی میشه فروشنده رو پیدا کرد  : (",
				"added": 1575982480
			},
			{
				"comment_id": 15,
				"body": "> [amir59](#comment_5_1AeBbm4qVhVzEDKrXHX1HdjFXAk4QFi8Av): در زمان قطع اتصال این وی پی ان ها کار نخواهند کرد.\n\n کار میکنند گفتم این وی پی ان ها بسیار خاص هستند سری قبل میفروختند گرفتم من  !به خوبی کار میکرد",
				"added": 1575983020
			},
			{
				"comment_id": 17,
				"body": "> [amir59](#comment_6_1AeBbm4qVhVzEDKrXHX1HdjFXAk4QFi8Av): بسیار خاص نیستند ولی در مواقع قطع سراسری یعنی زمانی که هیچ نودی در ایران به اینرنت جهانی متصل نیست وی پی ان کار نخواهد کرد.\nحتما شما بهتر میدونی ! سری پیش که کار کردن وی پی ان های اینترانت",
				"added": 1575995014
			}
		],
		"1575930275_1EAAeLMF5R69XJUZc5F4xrr3Ls5twrCTCL": [
			{
				"comment_id": 14,
				"body": "الان اینترنت کار میکنه یا قطع هست ؟؟؟؟؟",
				"added": 1575982642
			}
		],
		"1575982419_1Gnbkv1CsZnXBSv5ZDa5fu4Y34msi37mFm": [
			{
				"comment_id": 16,
				"body": "پروکسی ها بعد از اشتراک گذاری  کار نمیکنند ( پروکسی ها رو قطع میکنند بعد از شناسایی ) ! یه سرور بگیری بهتره",
				"added": 1575983131
			}
		]
	},
	"comment_vote": {}
}