{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1516818749_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1517355233_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1516747933_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "> [mnemonic](#comment_2_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): Archive page (so that I can go back to old posts without extreme scrolling)\n\nHere is [ZeroBlog Plus](/15mSYzsDxzarssqtV1pFPKqoCTaLdjVB2f/) \"TOC by date\" = \"Archive page\"",
				"added": 1517057095
			},
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): I would like to see such a mechanism in ZeroBlog. Now a large full-sized photo is reduced to 200 kB and is published in this form. But sometimes I need to have a link to a big photo. Now it requires manual work with the photo uploading manually. It would be nice if when upload a photo in ZeroBlog, a large photo would be added to the blog as an optional file. And the preview remained automatically reduced, as it is now.\n\nBefore I tried to add big file uploading support, but when looking at [the doc of alloy-editor](https://alloyeditor.com/docs/), I couldn't understand it very well. Will give another try ;)",
				"added": 1517972052
			},
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_16_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Allow importing data from any MySQL database into ZeroBlog, here it is described\n\nThe solutions both look complicated. Here is mine: if wordpress blog has full-text rss feed, using feed bot script from [my messy repo](/13zzNGxEXDeLxHEGZdG3mE7G8dChf45LrV) can easily import Wordpress blog data to ZeroBlog. If a clearnet blog has no full-text rss feed, add some code to `feedbot/htmlparser.py` then I can still import any kind of data to ZeroBlog, as long as there is no Javascript wall (htmlparser.py can't handle javascript).",
				"added": 1518264333
			},
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_19_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): And following all posts comments is too broad.\n\nGood idea, add an issue to ZeroBlog Plus repo for memo. It shouldn't be a hard job by referencing ZeroTalk or ZeroMe, but I guarantee when I will finish it, and if old blogs from other users will update their blog with this feature.\n\nIf you really want it now, you can add it by yourself, here is my related writing: [Some Experiments about ZeroHello Feed](/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:46)\n\n> because some user do not use mentions to reply\n\nThen just mention them and suggest them to add mention :)",
				"added": 1520061207
			}
		],
		"1516747912_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 2,
				"body": "There is [ZeroVoat](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/). Just not many users... [[src]](https://github.com/zer0net/zerovoat/)",
				"added": 1517057461
			}
		],
		"1524258152_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 7,
				"body": "Tip: use ` \"ignore\": \"((js|css)/(?!all.(js|css)))\",` in `content.json` for avoiding signing and publishing other css and js files except `all.js` and `all.css`.",
				"added": 1524282075
			},
			{
				"comment_id": 8,
				"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): That's about all i could find when searching for the info on all.css ;)\n\nAh, find it inside official docs ><\n> Anyway, my specific problem was solved\n\nThat's nice.",
				"added": 1524350899
			}
		]
	},
	"comment_vote": {
		"1_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"30_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"6_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": 1
	}
}