{
	"title": "Geekless.News.En",
	"description": "Personal news feed",
	"links": "[Geekless@ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/geekless@zeroid.bit)\n\n[Geekless.Blog](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/)\n\n[Geekless.News.Ru](http://127.0.0.1:43110/1BLogrYk5XU4A82eRugxzcwYDpYwkUXerj/)\n",
	"next_post_id": 4,
	"demo": false,
	"modified": 1548341552,
	"post": [
		{
			"post_id": 3,
			"title": "Most of What You Read on the Internet is Written by Insane People",
			"date_published": 1548341259.964,
			"body": "*DinoInNameOnly, [reddit.com](https://www.reddit.com/r/slatestarcodex/comments/9rvroo/most_of_what_you_read_on_the_internet_is_written/).*\n*January 22 2019*\n*In other languages: [\\[RU\\]](http://127.0.0.1:43110/1BLogrYk5XU4A82eRugxzcwYDpYwkUXerj/?Post:3).*\n\nI found a [post](https://np.reddit.com/r/TheoryOfReddit/comments/3qbpsp/do_we_know_the_percentage_of_redditors_who/cwefw3v/) from a few years ago detailing just what percentage of reddit users actually post anything:\n\n> *   Askreddit has about 15m uniques, and 500,000 unique commenters.\n> *   [/r/pics](/r/pics) and [/r/funny](/r/funny) have about 10m uniques, 200k commenters\n> *   [/r/TIL](/r/TIL) and [/r/videos](/r/videos) don't have public traffic stats, but have about 150k unique commenters. nor do [/r/pcmasterrace](/r/pcmasterrace), [/r/wtf](/r/wtf), [/r/gaming](/r/gaming), all with around 120k commenters.\n> *   The following all have about 100k unique commenters and the following uniques: [/r/leagueoflegends](/r/leagueoflegends) 8m, [/r/worldnews](/r/worldnews) 6m, [/r/news](/r/news) 6m, [/r/movies](/r/movies) 5m, [/r/adviceanimals](/r/adviceanimals) 3m, [/r/gifs](/r/gifs) stats not public.\n\nConclusion:\n\n> The largest subs see from 1% to 3% of uniques comment per month.\n\nSo Reddit consists of 97-99% of users rarely contributing to the discussion, just passively consuming the content generated by the other 1-3%. This is a pretty consistent trend in Internet communities and is known as the [1% rule]([https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture)](https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture))).\n\nBut there's more, because not all the users who post do so with the same frequency. The 1% rule is of course just another way of saying that the distribution of contributions follows a [Power Law Distribution](https://en.wikipedia.org/wiki/Power_law), which means that the level of inequality gets more drastic as you look at smaller subsets of users. From [this 2006 article](https://www.nngroup.com/articles/participation-inequality/):\n\n> Inequalities are also found on Wikipedia, where more than 99% of users are lurkers. According to Wikipedia's \"about\" page, it has only 68,000 active contributors, which is 0.2% of the 32 million unique visitors it has in the U.S. alone.\n>\n> Wikipedia's most active 1,000 people — **0.003% of its users** — contribute about **two-thirds of the site's edits**. Wikipedia is thus even more skewed than blogs, with a 99.8–0.2–0.003 rule.\n>\n> Participation inequality exists in many places on the web. A quick glance at Amazon.com, for example, showed that the site had sold thousands of copies of a book that had only 12 reviews, meaning that less than 1% of customers contribute reviews.\n>\n> Furthermore, at the time I wrote this, 167,113 of Amazons book reviews were contributed by just a few \"top-100\" reviewers; the most prolific reviewer had written 12,423 reviews. How anybody can write that many reviews — let alone read that many books — is beyond me, but it's a classic example of participation inequality.\n\nI don't know how that author identified the most prolific reviewer at the time but I found one [reviewer](https://www.amazon.com/gp/profile/amzn1.account.AGZV527R2U6APJG2FF4DP3AB5KBA/ref=cm_cr_tr_tbl_hof_name) with 20.8k reviews since 2011\\. That's just under 3,000 reviews per year, which comes out to around 8 per day. This man has written an average of 8 reviews on Amazon per day, all of the ones I see about books, _every day for seven years_. I thought it might be some bot account writing fake reviews in exchange for money, but if it is then it's a really good bot because [Grady Harp is a real person](http://fictionaut.com/users/grady-harp) whose job matches that account's description. And my skimming of some reviews looked like they were all relevant to the book, and he has the \"verified purchase\" tag on all of them, which also means he's probably _actually reading them_.\n\nThe only explanation for this behavior is that he is insane. I mean, normal people don't do that. We read maybe 20 books a year, tops, and we probably don't write reviews on Amazon for all of them. There has to be something wrong with this guy.\n\nSo it goes with other websites. One of Wikipedia's power users, [Justin Knapp](https://en.wikipedia.org/wiki/Justin_Knapp), had been submitting an average of 385 edits per day since signing up in 2005 as of 2012\\. Assuming he doesn't sleep or eat or anything else (currently my favored prediction), that's still one edit every _four minutes_. He hasn't slowed down either; he hit his one millionth edit after seven years of editing and is nearing his two millionth now at 13 years. This man has been editing a Wikipedia article _every four minutes for 13 years_. He is insane, and he has had a huge impact on what you and I read every day when we need more information about literally anything. And there are [more like him](https://en.wikipedia.org/wiki/Wikipedia:List_of_Wikipedians_by_number_of_edits); there is one user with 2.7 million edits and many others with more than one million. Note that some of them joined later than Knapp and therefore might have higher _rates_ of edits, but I don't feel like computing it.\n\nTwitch streamer Tyler Blevins (Ninja) films himself playing video games for people to watch for [12 hours per day](https://www.polygon.com/2018/4/24/17274636/ninja-fortnite-twitch-h3h3-podcast):\n\n> The schedule is: 9:30 is when I start in the morning and then I play until 4, so that’s like six, six-and-a-half hours,” Blevins said. “Then I’ll take a nice three- to four-hour break with the wife, the dogs or family — we have like family nights, too — and then come back on around 7 o’clock central until like 2, 3 in the morning. The minimum is 12 hours a day, and then I’ll sleep for less than six or seven hours.”\n\nAnd he's been more or less doing that since 2011, even though he only started bringing in big bucks recently.\n\nHe's less prominent now, but YouTube power-user [Justin Y.](https://www.youtube.com/watch?v=85l5VbJbTtM) had a top comment on pretty much every video you clicked on for like a year. He says he spends 1-3 hours per day commenting on YouTube, finds videos by looking at the statistics section of the site to see which are spiking in popularity, and comments on a lot of videos without watching them. Maybe he's not quite insane, but he's clearly interacting the site in a way that's different than most people, essentially optimizing for comment likes.\n\nIf you read reviews on Amazon, you're mostly reading reviews written by people like Grady Harp. If you read Wikipedia, you're mostly reading articles written by people like Justin Knapp. If you watch Twitch streamers, you're mostly watching people like Tyler Blevins. And if you read YouTube comments, you're mostly reading comments written by people like Justin Young. If you consume _any_ content on the Internet, you're mostly consuming content created by people who for some reason spend most of their time and energy creating content on the Internet. And those people clearly differ from the general population in important ways.\n\nI don't really know what to do with this observation except to note that it seems like it's worth keeping in mind when using the Internet.\n\nEdit: I guess my tone-projection is off. A lot of people seem to be put-off by my usage of the word \"insane.\" I intended that as tongue-in-cheek and did not mean to imply that any of them literally have diagnosable mental illnesses. I have a lot of respect for all of the individuals I listed and they seem like nice people, I was just trying to make a point about how unusual their behavior is.\n\n"
		},
		{
			"post_id": 2,
			"title": "Nobody Knows Anything About China",
			"date_published": 1548315946.436,
			"body": "*James Palmer, [foreignpolicy.com](https://foreignpolicy.com/2018/03/21/nobody-knows-anything-about-china/)*.\n*March 21, 2018.*\n*In other languages: [\\[RU\\]](http://127.0.0.1:43110/1BLogrYk5XU4A82eRugxzcwYDpYwkUXerj/?Post:2).*\n\nAs a foreigner in China, you get used to hearing the retort “You don’t know China!” spat at you by locals. It’s usually a knee-jerk reaction to some uncomfortable modern issue or in defense of one of the many [historical myths](https://camphorpress.com/5000-years-of-history/) children in the mainland are taught as unshakeable facts about the world. But it’s also true. We don’t know China. Nor, however, do the Chinese — not even the government.\n\nWe don’t know China because, in ways that have generally not been acknowledged, virtually every piece of information issued from or about the country is unreliable, partial, or distorted. The sheer scale of the country, mixed with a regime of ever-growing censorship and a pervasive paranoia about sharing information, has crippled our ability to know China. Official data is [repeatedly smoothed](https://qz.com/530096/china-data-tricks/) for both propaganda purposes and individual career ambitions. That goes as much for Chinese as it does for foreigners; access may sometimes be easier for Chinese citizens, but the costs of going after information can be even higher.\n\nWe don’t know the real figures for GDP growth, for example. GDP growth has long been one of the main criteria used to judge officials’ careers — as a result, the relevant data is warped at every level, since the folk reporting it are the same ones benefitting from it being high. If you add up the GDP figures issued by the provinces, the sum is [10 percent higher](http://www.scmp.com/week-asia/opinion/article/2130788/heres-how-beat-fake-data-about-chinese-economy) than the figure ultimately issued by the national government, which in itself is tweaked to hit politicized targets. [Provincial governments](https://www.wsj.com/articles/real-news-on-fake-data-in-china-1515573859) have increasingly admitted to this in recent years, but the fakery has been going on for decades. We don’t know the extent of [bad loans](https://www.bloomberg.com/news/articles/2018-01-22/fresh-doubts-raised-on-china-s-bad-loan-data-as-fraud-uncovered), routinely concealed by banks. We don’t know the makeup of most Chinese [financial assets](http://www.baldingsworld.com/2017/10/23/everything-we-think-we-know-about-chinese-finances-is-wrong/). Sometimes we don’t know the [good news](https://www.ft.com/content/a9889330-f51c-11e7-88f7-5465a6ce1a00) of recoveries because the concealment of bad news beforehand has disguised it. We [don’t know](http://www.nytimes.com/2012/01/26/world/asia/26iht-letter26.html) China’s real Gini coefficient, the measure of economic inequality.\n\nBut economic data may be, ironically, more reliable than most just because so much attention has been paid to its unreliability. China’s National Bureau of Statistics itself has repeatedly called out instances of bad data reportage and now attempts to [gather](http://www.scmp.com/news/china/economy/article/2117616/chinas-statistics-bureau-take-over-accounting-provincial-gdp-data) provincial data directly itself. There have been [clean-ups and attempts](https://foreignpolicy.com/2013/03/20/lies-damned-lies-and-chinese-statistics/) at rectifying past mistakes — although the increasingly ideological and paranoid turn of the party-state may be obstructing these efforts.\n\nBut what we don’t know goes far beyond just economics. Look at any sector in China and you’ll find distorted or unreported public information; go to the relevant authorities and they’ll generally admit the most shocking practices in private.\n\nWe don’t know the true size of the Chinese population because of the [reluctance to register](https://qz.com/941240/china-keeps-finding-millions-of-people-who-never-officially-existed/) unapproved second children or for the family planning bureau to report that they’d failed to control births. We don’t know where those people are; rural counties are incentivized to overreport population to receive more benefits from higher levels of government, while city districts report lower figures to hit population control targets. Beijing’s official population is 21.7 million; it may really be as high as 30 or 35 million. Tens — perhaps hundreds — of millions of migrants are officially in the countryside but really in the cities. (Perhaps. We [don’t know](https://www.economist.com/news/leaders/21731838-officials-beijing-are-using-brutal-tactics-limit-citys-population-they-are-wrong-even) the extent of the recent winter expulsions of the poor from the metropolises.) We don’t know whether these people are breathing clean air or drinking clean water because the environmental data is [full of holes](http://datadriven.yale.edu/wp-content/uploads/2017/01/ThirdWave_Data_Gap_Analysis_Final.pdf).\n\nWe [don’t know](http://www.chinafile.com/reporting-opinion/viewpoint/why-do-we-keep-writing-about-chinese-politics-if-we-know-more-we-do) _anything_ about high-level Chinese politics. At best, we can make — as I have — [informed guesses](https://foreignpolicy.com/2017/10/19/the-resistible-rise-of-xi-jinping/). We don’t know how the internal politics of Zhongnanhai, the Chinese Kremlin equivalent, operate. Chinese politicians don’t write tell-all memoirs; Chinese journalists can’t write a _Fire and Fury_, a [_What It Takes_](https://www.amazon.com/What-Takes-Way-White-House-ebook/dp/B005EXHAVK/ref=sr_1_1?s=digital-text&ie=UTF8&qid=1521462553&sr=1-1&keywords=richard+cramer), or even a [_Game Change_](https://www.amazon.com/dp/B0033V4SDI/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1). We don’t know whether Xi Jinping truly values China’s [wealth and power](https://www.amazon.com/dp/B00BH0VU4W/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1) or only his own.\n\nWe don’t know whether the officials targeted in the “anti-corruption” campaigns were really unusually [corrupt](https://www.nytimes.com/2015/06/12/world/asia/zhou-yongkang-former-security-chief-in-china-gets-life-sentence-for-corruption.html?mtrref=www.google.com&gwh=06FDE9F0D7FCE56CA3B35986230EAE81&gwt=pay&assetType=nyt_now), [lascivious](http://languagelog.ldc.upenn.edu/nll/?p=36737), or treacherous — or whether they were just [political opponents](http://www.scmp.com/news/china/policies-politics/article/2123802/criminal-case-opened-against-sun-zhengcai-graft-charges) of Xi. We don’t know the extent of factionalism within the Chinese Communist Party, though we do know how often its [existence](http://www.globaltimes.cn/content/968895.shtml) is [condemned](https://www.theguardian.com/world/2016/may/04/china-xi-jinping-house-of-cards-attacks-conspirators) — by Xi and his faction. We don’t know whether officials who lather [slavish praise](http://languagelog.ldc.upenn.edu/nll/?p=37158) on Xi actually believe anything of what they say or are acting out purely out of fear and greed.\n\nWe don’t know what people really think. We don’t know whether interviewees really support the government or give cautious answers when asked questions by a stranger in a politically repressive country. We don’t know why Chinese [tell pollsters](https://books.google.com/books?id=VGA9OONVhtcC&pg=PA102&lpg=PA102&dq=chinese+trust+values+survey&source=bl&ots=8_u0_otfAm&sig=NGEeQ1gCPw-kfMO9JnsDo3ljK4I&hl=en&sa=X&redir_esc=y#v=onepage&q=chinese%20trust%20values%20survey&f=false) they are more trusting of others than any other country in the world, while in practice [paranoia](https://foreignpolicy.com/2017/05/24/chinese-citizens-want-the-government-to-rank-them/) about the intentions of others is so rampant that old people [aren’t helped](https://thenanfang.com/helping-fallen-old-people-china-takes-another-backlash-video-proves-old-woman-wrong/) on the streets for fear they’re running a scam and children like toddler Wang Yue are [left to die](https://en.wikipedia.org/wiki/Death_of_Wang_Yue) after being hit by cars.\n\nWe don’t know the real [defense budget](https://chinapower.csis.org/military-spending/). We don’t know the everyday conditions of the Chinese army because the restrictions placed on military coverage and the ability of soldiers to talk are even more tightly limited than for civilians.\n\nWe don’t know how good Chinese schools really are because the much-quoted statistics provided by the Program for International Student Assessment (PISA) that placed China first in the world were taken from the study of a small group of elite Shanghai schools. As soon as that was expanded merely to Beijing — another metropolis — and two rich provinces, the results [dropped sharply](http://www.sixthtone.com/news/1659/china-drops-top-tenth-pisa-education-ranking). (PISA’s willingness to accept only this limited sample is typical of the [gullibility and compliance](https://www.brookings.edu/research/attention-oecd-pisa-your-silence-on-china-is-wrong/) of many foreign NGOs, especially in education, when dealing with China; I have seen numerous foreign educators fall victim to obvious Potemkinism, including believing that [Beijing No. 4 High School](https://en.wikipedia.org/wiki/Beijing_No._4_High_School) — the rough equivalent of Eton — was a “typical Chinese public school.”) We don’t know the extent of the [collapse](http://www.sciencemag.org/news/2017/09/one-three-chinese-children-faces-education-apocalypse-ambitious-experiment-hopes-save) of rural education. We don’t know the real literacy figures, not least because rural and urban literacy is measured by different standards — a common trick for many figures.\n\nWe don’t know the real crime figures, especially in the cities, which [may represent](https://chinachannel.org/2018/01/10/crime-statistics/) as little as 2.5 percent of the actual total. We don’t know the death toll for the ethnic Uighur insurgency in Xinjiang, where local officials, in the words of one government terrorism expert, “bend figures as much as during the Great Leap Forward,” nor do we know how [many people](https://www.theguardian.com/world/2018/jan/25/at-least-120000-muslim-uighurs-held-in-chinese-re-education-camps-report) are currently held in “re-education camps.” (Incidentally, we don’t know how many people died in the Great Leap Forward, piled up in village ditches or abandoned on empty grasslands: the 16.5 million once given in official tolls or the [45 million](http://www.scmp.com/article/723956/revisiting-calamitous-time) estimated by some historians.)\n\nAnd we don’t know what we don’t know. These are the known unknowns, but the unknown unknowns are equally worrying. We may be missing the biggest future stories, the ones that will shake or transform China and the world, right now. Foreign reporters are limited to residence in a few major cities, chiefly Beijing, Shanghai, and Shenzhen; they are [followed and harassed](http://www.scmp.com/news/china/policies-politics/article/2131231/foreign-journalists-china-complain-growing-abuse) when they travel elsewhere in the country and find it particularly difficult to reach the countryside. (According to the official population figures, Beijing and Shanghai, often portrayed as the norm for the new China, house less than 4 percent of the country’s residents.) The situation for Chinese journalists is far worse; a limited ability to conduct investigative journalism in the 2000s has been almost obliterated by authorities determined that there will be no oversight beyond the party. Fear grips throats; those who would once give names now talk anonymously, where many others do not talk at all.\n\nOur sources of information, always a thin stream, have dried up almost entirely under an increasingly tight censorship regime of the last few years. Social media platform Weibo was once a limited window into provincial complaints and scandals; it is now [massively censored](https://pen.org/forbidden-feeds/). Private messaging groups on WeChat, an all-conquering messaging service, replaced it; last year, they were massively censored in turn.\n\nAll this makes the work of those who manage to successfully extract meaningful economic or political data, such as the masterful researcher [Adrian Zenz](https://www.wsj.com/articles/china-spends-more-on-domestic-security-as-xis-powers-grow-1520358522), all the more impressive. And as the government closes down any source of information outside its control, we can only wonder at how much it knows itself. Local officials have always demanded enormous amounts of data — it’s not uncommon to receive requests like: “List everybody who attends religious services in your district and where.” But the system has [always distorted](https://aeon.co/essays/will-information-open-up-china-or-close-the-ranks-for-good) the information it sends up even internally and may be doing so even more as Xi [establishes outright dictatorship](https://foreignpolicy.com/2018/02/26/chinas-stability-myth-is-dead/). Li Keqiang, the increasingly irrelevant (we think) Chinese premier, complained to U.S. diplomats in 2007 of his inability to know basic economic information about the province he then ruled and his need to send out friends and colleagues on surreptitious data-gathering trips.\n\nThe government’s solution to this is an increasing faith in big data, a belief that by circumventing lower-level officials it can gather information directly from the source. Huge amounts of money are [being poured](https://www.newamerica.org/cybersecurity-initiative/blog/chinas-plan-lead-ai-purpose-prospects-and-problems/) into big data, including efforts at [predictive policing](https://www.hrw.org/news/2018/02/26/china-big-data-fuels-crackdown-minority-region) and the [widespread monitoring](https://www.project-syndicate.org/commentary/xi-jinping-surveillance-state-by-mark-leonard-2018-02) of dissidents. The government requires Chinese firms, and [foreign firms](https://www.theregister.co.uk/2017/06/01/china_cybersecurity_law/) with a Chinese presence, such as Apple, to store and hand over data on a vast scale. But big data itself is prone to [systematic distortions](https://arstechnica.com/tech-policy/2017/12/is-big-data-racist-why-policing-by-data-isnt-necessarily-objective/), [misplaced trust](https://theconversation.com/googles-flu-fail-shows-the-problem-with-big-data-19363), and the oldest rule of coding: garbage in, garbage out.\n\nAs the economist Josiah Stamp recounted of another power trying to control a vast territory through oppressive means, “The Government [of British India] are very keen on amassing statistics—they collect them, add them, raise them to the _n_-th power, take the cube root and prepare wonderful diagrams. But you must never forget that every one of these figures comes in the first instance from the _chowty dar_ (village watchman), who just puts down what he damn pleases.” Will technology let the Chinese government today do any better? We don’t know.\n"
		},
		{
			"post_id": 1,
			"title": "About",
			"date_published": 1548298800,
			"body": "Hi!\n\nWelcome to my personal news feed! I'm going to publish here various articles from the clearnet, primarily related to IT, and maybe also to other topics such as science, languages, politics etc.\n\nSome others sites of mine::\n\n* [My Zero.Me profile](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/geekless@zeroid.bit)\n* [My personal blog, primarily in Russian](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/)\n* [My news feed in Russian](http://127.0.0.1:43110/1BLogrYk5XU4A82eRugxzcwYDpYwkUXerj/)\n"
		}
	]
}