{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1543928148,
			"title": "Tumblr bans porn",
			"body": "As of December 17th, Tumblr will start censoring the site according to new community guidelines, which prohibit “images, videos, or GIFs that show real-life human genitals or female-presenting nipples.” Female-presenting nipples! Can we get over boobs already. The policy allows for some rare exceptions: “Certain types of artistic, educational, newsworthy, or political content featuring nudity are fine.”\n\nThe rationale for the decision is unclear, despite a lengthy blog post from CEO Jeff D’Onofrio on the subject. It seems vaguely to do with protecting people from the porns, even though the site already makes it fairly difficult to find the porns. This decision follows Tumblr’s recent removal from the Apple iOS App Store over a failure to fully filter out **child pornography**.\n\nSo rather than fix the problem, they just removed everything for everyone. -.-",
			"added": 1543928147
		},
		{
			"topic_id": 1545123114,
			"title": "Breaking from Iframe",
			"body": "some sites I visit say this message and I want to know what it means.",
			"added": 1545123112
		}
	],
	"topic_vote": {
		"1543859802_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": 1,
		"1544106168_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1509065748_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": 1,
		"1544138177_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1535186853_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1545123114_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"1546990353_1HDmyQsAC4ngUqrGWjqAWbjYBzn2AGY3T": 1,
		"1546939398_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1546797562_1En5vgohdFfruuqXmaJ1UJNjonWcGaBH4Z": 1,
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": 1,
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	},
	"next_comment_id": 40,
	"comment": {
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 1,
				"body": "> [schiz0](#comment_28_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): Evviva! [...]\n\nI hope so, I have been using this for a fee days now and it's very nice. Much easier to find content than over tor.",
				"added": 1543933792
			},
			{
				"comment_id": 4,
				"body": "> [psybin](#comment_5_1FEureQqgUD5PLLxvaMWajQUzfzRAwJ4UE): So what happens when a MTF/FTM trans shows their boobs on there?..\n\non here nothing, there is no one to enforce any rules.You can pub;ish what ever you like.",
				"added": 1543941121
			},
			{
				"comment_id": 5,
				"body": "> [timelinehyperbot](#comment_81_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Due to stupid people posting CP on Tumblr they were FORCED to ban adult content.\n\nthats not true, there is a national database of child porn images that you can train AI's on to detect it. This plus manually reviews and reports would have been enough.\n\nNot only that they could have worked with authority's  to catch the uploads.",
				"added": 1544090091
			},
			{
				"comment_id": 6,
				"body": "> [timelinehyperbot](#comment_82_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Yea... that is true but they stated CP that is not on that special police data base was being displayed on Tumblr.\n\nwhich is the whole point of using the AI to look for images LIKE CP, plus adding support staff to handle reports when they come in but instead they just ruined it for everyone.",
				"added": 1544094420
			},
			{
				"comment_id": 7,
				"body": "> [lacapo](#comment_16_1Nv1anNtKATNc9NQwBEXqSFTtwXTf6o6xX): Tumblr isnt dead already ? XD\n\nno, it had a rather large adult content community, it was the only thing going for it.",
				"added": 1544108087
			},
			{
				"comment_id": 14,
				"body": "> [xianc78](#comment_28_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Yes, but I don't think most Tumblr users would be tech-savvy enough to use them and I bet once they realize that ZeroNet is uncensored, they will call us an \"alt-right platform\" or something like that.\n\nthat is exactly what will happen, the same thing happened to gab because that guy went on a killing spree even though Facebook, twitter and other have all had their fair share of extreme people using their platform.\n\nI was thinking of created a website that would act as a proxy that would remove the barrier completely, basically you go to a website and get access to zeronet.",
				"added": 1544458355
			},
			{
				"comment_id": 15,
				"body": "> [xianc78](#comment_29_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): There are many sites that do that already. ZeroWiki has a list here. What we really need is to have major browser to have ZeroNet built in. Firefox is the most likely since they have natively supported the gopher protocol for the longest time and there have been talks about implementing IPFS. I'm sure that if ZeroNet gets popular enough, they may implement it as well or instead of IPFS.\n\ndidn't know thanks for the link :P though I do like running it on my machine.",
				"added": 1544460218
			}
		],
		"1543859802_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 2,
				"body": "> [biglybt](#comment_13_18e4U5WvC4d8Megkv2Sqek9HzrG6TFwRC7): Sorry just realized it is an onion website.\n\nworking fine here, though I am using tor.",
				"added": 1543933951
			}
		],
		"1543914606_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": [
			{
				"comment_id": 3,
				"body": "> [tempest](#comment_2_186JDoRvixr4EUx2EUc8dGW5opZbWi9SzK): What are responsibilities of maintainer?\n\nI assume to be a moderator and remove dead links and/or content they don't like.\n\nthat last part literally goes against what this whole thing is about.",
				"added": 1543936856
			}
		],
		"1544189569_13pMUCyHCSA16YYxki54Zh8FCv6qL18pcP": [
			{
				"comment_id": 8,
				"body": "> [blurhy](#comment_188_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): There is no way to count all users,but you can force every user post a comment when visit\n\ndoesn't it auto seed each website you go to? E.G number of seeds is roughly equal to number of users.",
				"added": 1544192184
			}
		],
		"1544190671_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 9,
				"body": "https://zeronet.readthedocs.io/en/latest/faq/",
				"added": 1544192262
			},
			{
				"comment_id": 10,
				"body": "> [anonimoose](#comment_9_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): https://zeronet.readthedocs.io/en/latest/faq/\n\nor even the FAQ pinned to the top of this board\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/ZeroNet+help+FAQ",
				"added": 1544192964
			},
			{
				"comment_id": 11,
				"body": "> [blurhy](#comment_189_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Yeah,it's quite hard to understand zeronet for newbie\n\nI guess that depends on the person, I picked this up rather quickly I feel but then again I am a techy person.",
				"added": 1544195130
			}
		],
		"1544254269_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 12,
				"body": "> [robione](#comment_96_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): The idea is to use a command or a few that will reliably get you the external IP of the machine which you can connect to for services and used in management. It cannot be a custom script, it must be something available on any system by default. [...]\n\nI always use \n\ncurl 'https://api.ipify.org?format=json'\n\nretrurns json like this\n\n{\"ip\":\"123.123.123.123\"}",
				"added": 1544430099
			},
			{
				"comment_id": 13,
				"body": "> [robione](#comment_98_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Here's a bad example with a good outcome: [...]\n\nthis returns nothing on my machine.",
				"added": 1544435795
			},
			{
				"comment_id": 17,
				"body": "> [robione](#comment_99_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): that is why it is a bad example.take off the last command and see what the result is. if nothing, keep going.\n\nit actually fails at | grep 32 | :/",
				"added": 1544516737
			}
		],
		"1544500987_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 16,
				"body": "Its working find for me.",
				"added": 1544516433
			}
		],
		"1544560849_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 18,
				"body": "> [tomasz21](#comment_27_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): I do not use any social media platforms. Surveillance.\n\nwhich is great but the vast majority of people do use them.  \n\nto op yes, Facebook has a very large ad network",
				"added": 1544605730
			}
		],
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": [
			{
				"comment_id": 19,
				"body": "> [tusiko](#comment_17_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): The shared data in Freenet is fully encrypted and so you can always say that you never know, what you share. In my eyes ZeroNet is a very good thing, but I would prefer some encryption. Perhaps encrypted peer data and json content.\n\nSeeing as you only share sites you visit and after seeing such content you can just block and remove.\n\nPlus for the encryption to work everyone would have to know the encryption key to verify the published content is valid and as every would have the key the point of encrypting it is very quickly lost and all you are left with is a slower network for everyone.",
				"added": 1544614397
			}
		],
		"1544661120_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 20,
				"body": "> [quantumworld](#comment_63_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): We all know that it is most likely a communist plot to take over everything and create a centralized Nazi system for Zpoo JinPlop. Personally I think that 80% of the world needs to be turned to glass anyway.  Most people are scum and don't deserve to be breathing the same air as I do at this time. I am sorry if I sound too positive for people.\n\nPreach.",
				"added": 1544690532
			}
		],
		"1544706846_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 21,
				"body": "> [styromaniac](#comment_333_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It can happen. Don't browse just any site anyway. A few are being malicious. [...]\n\nhaving the all reasons as \"nope\" is a pretty poor way to maintain a list, also, not providing the link to verify it should be blocked is also not ok.",
				"added": 1544716214
			},
			{
				"comment_id": 23,
				"body": "> [ssdifnskdjfnsdjk](#comment_551_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @hypercode yes, you can not prevent it thus you have to:1) encrypt your zeronet data folder as suggested (Veracrypt works on Windows and Linux)2) use proxy to connect internet to hide your real IPA) VPN server from reliable \"no logging\" VPN provider or setup own VPN serverB) in zeronet.conf or in /Config enable tor Always mode and run Zeronet in Tor Browser (it is also on ZeroUp) [...]\n\nthanks for the config, if you use tor always why does it not set the trackers proxy to also use tor?",
				"added": 1544783174
			},
			{
				"comment_id": 24,
				"body": "> [ssdifnskdjfnsdjk](#comment_552_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I think that it is because the tracker connections do not carry and private/sensitive information. When using proxy (especialy Tor), the data have to travel longer route via more computers which is making connection slower (maybe even a few hundred miliseconds?)\n\nbut couldn't a person create a tractor and then use that to monitor a network and that this IP asked for this site? could be used to prove you were looking at illegal content?",
				"added": 1544795931
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 22,
				"body": "> [quantumworld](#comment_7_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Omg! What you said there was so offensive and racist. How can you say something like that about some one.\n\nTruth always hurts when it's something you didn't want to hear.",
				"added": 1544718647
			}
		],
		"1545026098_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 25,
				"body": "launching zero net with --open_browser \"browser here\" will change it. if you do it with just \"\" it doesn't open in a browser which is much better and should be the default.",
				"added": 1545036311
			}
		],
		"1545042706_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 26,
				"body": "You could always create a script to download all the pages and serve them but wouldn't it be better to get the service to move here?",
				"added": 1545043440
			}
		],
		"1545029431_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 27,
				"body": "> [nws](#comment_14_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf): I'm asking because there are a lot of users here from countries where accessing or sharing certain content can get you in serious trouble. A security audit could reduce the risk for de-anonymization attacks that would put these users at risk.\n\nZeronet is open source and there are a lot of active developers I would assume security bug would be found and fix on github.",
				"added": 1545047430
			}
		],
		"1545106555_1NPaMdmTDg441cn76DGdUjz5ZXeVTPfWfx": [
			{
				"comment_id": 28,
				"body": "> [timelinehyperbot](#comment_97_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Dynamic content that can except a web form needs PHP processing which is server side. \n\nThis is not true PHP is not required to take form data, using this website is a perfect example of how user input can be taken without any server side processing.\n\nThis form I am typing in is no different to any other form that you could create.",
				"added": 1545122055
			}
		],
		"1545123114_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 29,
				"body": "> [gitcenter](#comment_389_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Short explanation: It's bad. [...]\n\nThank you for the detailed explanation :) I'll be sure to avoid the breaking iframe sites then ^_^",
				"added": 1545230130
			}
		],
		"1545280465_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 30,
				"body": "> [leftside](#comment_450_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Short and smart text always wins.\n\nThe whole point of zero net is to be free from censorship, you or anyone creating a \"list\" is already going have bias towards one thing or another, say trump vs Hillary propaganda.\n\nas for point 2. you should be doing that anyone, it's called a discussion maybe try it sometime.",
				"added": 1545296834
			}
		],
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 31,
				"body": "> [n4n0](#comment_1_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M): Doesn't sound too complicated to be honest. Maybe I'll cook something up.\n\njust be sure to make seeding the roms optional else thats going to hit your site space limit really quickly",
				"added": 1546872482
			},
			{
				"comment_id": 33,
				"body": "> [n4n0](#comment_2_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M): Good call. I'm not too into developing content for ZeroNet yet so any advise is highly appreciated.\n\ni've only briefly looked into it and only then cloned a blog to try, I am mostly a back end developer so I would read up on the documentation",
				"added": 1546941520
			},
			{
				"comment_id": 35,
				"body": "> [n4n0](#comment_3_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M): Yeah I played around with site creation on ZeroNet a bit and it's pretty straightforward; create whatever you want in vue or react or simple bootstrap html, then webpack it and you're done. Need to read up on how data is distributed among zn-clients, and how to minimize storage impact.This is really fun stuff!\n\nit really is :) though my free time is been taken up with machine learning, there is a package called brain.js that you can use in the browser to create neural networks. actually simple and fun.\n\nI don't understand any of the math.",
				"added": 1546946827
			}
		],
		"1546939398_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 32,
				"body": "it's using the bittorrent protocal AKA perr to perr downloading.\n\ntracker keep a list of seeds and when you go to a new site it asks the trackers and you download from them.",
				"added": 1546941456
			}
		],
		"1546269477_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"comment_id": 34,
				"body": "> [htgozn](#comment_253_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): Yeah, you keep saying that but what would be your solution for Reload a Linux user's group assignments without logging out and back in?\n\nhow about.:\n\nsu - $USER\nor\nexec su -l $USER so you don't have a sub shell\n\nor maybe even \n\nnewgrp tor",
				"added": 1546942630
			}
		],
		"1546797562_1En5vgohdFfruuqXmaJ1UJNjonWcGaBH4Z": [
			{
				"comment_id": 36,
				"body": "> [cybernex](#comment_3_1En5vgohdFfruuqXmaJ1UJNjonWcGaBH4Z): It takes a while to get your bearings, but overall it's pretty cool.It could use a bit more polish --but I know that's a duh and it's coming :D-- Or maybe I missed some tutorial or guide that shows me what's what. That would be really helpful and it would bring a lot more people to it. Most are just sutck on using the deadnet(facebook, twitter etc.) because they are turned off by how raw the alternatives are.  [...]\n\nnormal people just don't care. Google plus was a far better and more polished social network than facebook but becuase everyone was already on facebook no one moved.",
				"added": 1547048036
			}
		],
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": [
			{
				"comment_id": 37,
				"body": "> [n4n0](#comment_5_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M): Some people are working on a messageboard that's using Ethereum as a ledger, maybe that will help chinese users to freely express themselves: https://0xchan.net\n\nuntil thats blocked too.",
				"added": 1547117174
			}
		],
		"1547199390_1G81ZjuwUW8W14s12ykHMo3Yxh2NMBmLe8": [
			{
				"comment_id": 38,
				"body": "as with all things, anything you can make it do,",
				"added": 1547199974
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_402_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Clarification upon this: Be sure you have ZeroNet and TOR working together. Some operating systems don't have the TOR bundle included and ready to go, most notably Android.\n\nyou can go to http://127.0.0.1:43110/Config to check the settings",
				"added": 1547224181
			}
		]
	},
	"comment_vote": {
		"28_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"347_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"43_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"349_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1_1KT1yp7bYJS8rCTHPVLUSUqt57B4diyjMA": 1,
		"93_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": 1,
		"1_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"1_1GQavEpwS1D6pdD3suzaEu8Y25NFzNxvge": 1,
		"29_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"3_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"33_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"63_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"3_1BWJEJG6cycG5GRfkHSgd8F34NmafEzYxu": 1,
		"5_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"3_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"101_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1_1JwAJqcH78mtHGwLHyQZ5jvi5si8kJDeq9": 1,
		"10_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"99_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"31_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"109_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"389_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"390_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"119_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"86_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"3_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M": 1,
		"120_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"3_1En5vgohdFfruuqXmaJ1UJNjonWcGaBH4Z": 1,
		"6_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"7_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M": 1,
		"49_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1
	}
}