{
	"title": "ZeroVC",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1464587370,
	"post": [
		{
			"post_id": 14,
			"title": "talk about trading? why not sell one thing, and then you know whta is trading and what is need",
			"date_published": 1464580883.506,
			"body": "again, this force you to think:\n\n- who is your target clients\n- what you provide to them"
		},
		{
			"post_id": 11,
			"title": "idea of the day - online trading",
			"date_published": 1464579940.827,
			"body": "the online trading platform is needed to handle needs like this -\n\nhttp://127.0.0.1:43110/12BYDUaA1zjg13r7yfn4x4jg4DehqEBF8b\n\ndesign features -\n\n- vendor listing \n- buyer login and pay and able to follow up with evaluation of service: this evaluation is independent of the vendor and can only be controled by the buyer.\n- the key will be a credit system that form credible evaluation of both sides of the trade.\n\nas the platform operator, how you make money? \n\n- first of all, the maintainance cost of this platform is extremely low.\n- it is not hard to come up a way to make money on trade"
		},
		{
			"post_id": 10,
			"title": "Why",
			"date_published": 1464496606.415,
			"body": "The need for significant enhancement of the infrastructure and service for zeronet is as apparent as its promise. Without funding all these promises can not happen quickly. Let's raise money and fund the further development of zeronet."
		},
		{
			"post_id": 9,
			"title": "How we invest",
			"date_published": 1464486587.242,
			"body": "- we review zero plans;\n- we invite the most promising zero-starters and discuss;\n- as much as possible we make our discussions, investment intentions, and actual investment open for examinations of the zero community;\n- we invest, and typically we look to own 20% of the startup we make investment in;\n- we follow their progresses, and report them here;\n- we promote our startups;\n- we raise more fund from bigger VCs for our zero-startups;\n- we push either for their IPO, or other cashout events;"
		},
		{
			"post_id": 8,
			"title": "If you are simply a zero",
			"date_published": 1464485521.826,
			"body": "That is fine and fun too. Being a zero is a great thing. Let's learn, grow, and one day start a zero business."
		},
		{
			"post_id": 7,
			"title": "If you are a programmer ",
			"date_published": 1464485521.766,
			"body": "Hey, this is a great time to join the great zero revolution. Let us here from you, there are many projects waiting for a great guy like you. Here is a list of things we are thinking of doing - \n\n- zero chat: by far we think there is a great need here; let's beat the hell out of things like wechat and so on;\n- zeromail extension: making zeromail working with regular .com emails;\n- zero game: it becomes almost boring now without some zero games;\n- z-commerce;\n- search engine for zites;\n- zero antivirus;"
		},
		{
			"post_id": 6,
			"title": "If you are an investor",
			"date_published": 1464485383.592,
			"body": "We would like to talk to you. We can work flexibly on investment terms. Please drop us a note here.\n\nOur objective is clear - we raise money and invest in zero businesses.\n\nIf you want to donate, simply donate to this site, and we will pool akll donations and invest in zero startups."
		},
		{
			"post_id": 4,
			"title": "If you are a zero startup",
			"date_published": 1464485260.797,
			"body": "We would like to hear from you. Please simply drop us a note here. Let's talk about your zero business."
		},
		{
			"post_id": 3,
			"title": "Raising money for zero businesses",
			"date_published": 1464485027.76,
			"body": "We would like to work with - \n\n- small investment institutions\n- regular VCs\n- angel investors\n- research institutions that have projects and funding for next generation technology projects"
		},
		{
			"post_id": 2,
			"title": "ZeroVC - our mission and who we are",
			"date_published": 1464484670.411,
			"body": "Our mission:\n- funding great zero startups.\n\nWe are a few zeros who are excited about zeronet and believe in its great potential. Here are our zites - \n\nkp - \nhttp://127.0.0.1:43110/1KPk8RzTRc7aMtPYJ6bfUjuV3d23RfiYhE\n\nDoctorZ\nhttp://127.0.0.1:43110/18on2beXadyCe5GvAYq6sVXD9ejwRLXShd"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}