{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565324173,
			"title": "QANON needs to see this, Please read all QPatriots",
			"body": "All QPatriots please RT b4 it could be c3nsored - White House Counselor Kellyanne Conway read over 2nd email regarding Brian’s Wrongful Conviction https://justiceforuswgo.wordpress.com/2019/08/05/white-house-counselor-kellyanne-conway-read-over-2nd-email-regarding-brians-wrongful-conviction/\n\nAll QPatriots please RT - Brian D. Hill asks QANON for help July 9, 2019 - https://www.bitchute.com/video/2DOEKQu0PzQ1/",
			"added": 1565324172
		},
		{
			"topic_id": 1566632049,
			"title": "Approximately 36 Department of Defense staff read email about [USWGO] Brian D. Hill’s plight",
			"body": "https://www.bitchute.com/video/2DOEKQu0PzQ1/\n\nApproximately 36 Department of Defense staff read email about [USWGO] Brian D. Hill’s plight\n\nby Laurie Azgard\n\nEmails are being directed to the patriots alliance inside of the Department of Defense [DOD] government agency. I am asking them to get a message to President Donald John Trump or even Attorney General William Barr. Whether any of them are actually Qanon or not, David Wilcock of divinecosmos.com had mentioned about a group of patriots inside the DOD who are sick and tired of the criminal globalist group known as the “cabal” who are also known as the “Swamp”, “deep state”, and arbitrators of the New-World-Order conspiracy.\n\nI had decided to email them and already got 36 read receipts from “.mil” military email addresses, some civilian workers and some actual military. A few have decided to try to ban my emails by nconsidering the content to be “banned” content and are likely cabal advocates scared that Brian’s story is spreading around the White House, around Trump Organization, and now around the Department of Defense.\n\nWhoever had decided to frame journalists Brian D. Hill [USWGO alternative news] and even Alex Jones of infowars.com, and others with CP filth files could be involved with Jeffrey Epstein and are a security threat to the United States. It is sexual/political terrorism where people send child porn to other people through either emails or malware in attempts to frame them with possession and receipt of child pornography. Anybody who is attempting to frame other people with child porn over the internet is cyber-terrorism. It ruins lives, clogs up our federal and state courts with frame up victims, clogs up the Internet Crimes Against Children [ICAC] and other anti-child-porn task forces while they believe them arresting framed individuals or groups will protect children when it is not.\n\nIt is time for the Department of Defense to investigate the cyber TERRORIST acts of framing innocent people with child porn. It is despicable, it is unpatriotic. It is immoral, and is unamerican. If anybody inside of government is aware of anybody in operations of attempting to frame innocent people with child porn then please email me and contact me through this blog. I understand nobody wants to risk criminal charges by blowing the whistle but it would be better for somebody to admit an operation to frame people with such child abuse images rather then face God and Jesus with their shameful horrible acts of cyber-terrorism.\n\nThe DOD has every right to investigate the frame up of journalist Brian D. Hill. There are some within the DOD that are attempting to block my message’s content throughout their email systems while others are taking an interest in hearing what I’ve had to say. The Deep State cabal is involved with pedophilia and has been proven with the exposure and DECLAS of Jeffrey Epstein of Lolita Express. Framing people with child porn shouldn’t be an impossibility here. If they love that filth, they can set up their political enemies with that filth.\n\nThe DOD alliance is listening, here is the screenshot.\n\nThey may have also reviewed over the Bitchute video about Brian asking Qanon for help. See video: Brian D. Hill asks QANON for help July 9, 2019\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/data/users/1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC/src/4910747b775e35af43105c648f96042429441219.jpg\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/data/users/1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC/src/61f85e5c1a5a818df8d6f20db158bc9195ed6749.jpg",
			"added": 1566632047
		}
	],
	"topic_vote": {
		"1565324173_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1,
		"1565358483_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1566632049_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1565324173_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": [
			{
				"comment_id": 1,
				"body": "Please put on your GAB.AI accounts, ReMinds on Minds, Please put on your Parler accounts. Please get that video out to everyone you know. This man is begging QANOn for help. Don't let him become a victim like Tommy Robinson of the UK?",
				"added": 1565324253
			},
			{
				"comment_id": 2,
				"body": "Please everybody on here, this needs to come out. People need to stand up for a fallen patriot. Alex Jones is fighting an information war, in war nobody leaves any patriots behind. Never leave your men and women behind in a information war. Please help Brian D. Hill.",
				"added": 1565324382
			},
			{
				"comment_id": 3,
				"body": "> [28eb9](#comment_8_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): then tell that faggot to plug ZeroNet on his show\n\nGood point, Alex Jones needs to stop turning his back on the very patriots that got him as successful as he had gotten. Alex turns his back on Luke Rudkowski, Brian D. Hill, and others who got CP set up attempts. However Alex Jones is having Stewart Rhodes back on his show, so that is good at least. Alex Jones still turned his back on many of his fallen comrades. I can try but Darrin McBreen blocked his cell phone number, Darrin McBreen is cold as ice.",
				"added": 1565330998
			},
			{
				"comment_id": 4,
				"body": "Everyone, more people from the White House are reviewing over this.",
				"added": 1565406542
			},
			{
				"comment_id": 5,
				"body": "Brian needs to be pardoned, or acquitted by AG William Barr.",
				"added": 1565415888
			}
		],
		"1566632049_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": [
			{
				"comment_id": 6,
				"body": "https://justiceforuswgo.wordpress.com/2019/08/23/approximately-36-department-of-defense-staff-read-email-about-uswgo-brian-d-hills-plight/",
				"added": 1566632376
			}
		]
	},
	"comment_vote": {
		"1_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1
	}
}