{
	"next_post_id": 11,
	"next_comment_id": 27,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Bigbadbob",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1579456519,
			"body": "A little re-cap of 2019 (a work in progress)  Any ideas?\nThe side of the truck needs an ad or something...\nClown pepe made it in because he was in the news last year.",
			"date_added": 1579456514,
			"meta": "{\"img\":\"900,675,a88655aaabbb888a99544777667865987789434322776222,012333425566152718819A23344BBBA03233291516A12331C9CDD6667175C666616CCE9611996F6E\"}"
		},
		{
			"post_id": 1580084741,
			"body": "Updated.   I think thats all.   No more space. \nToo much?",
			"date_added": 1580084735,
			"meta": "{\"img\":\"900,675,a87765977bbbaa9988a99a7954477668a777abcccc444332,010234546781154219919263355A9B2036CD411511213341E9EFF11898968886418F899812091119\"}"
		},
		{
			"post_id": 1598899300,
			"body": "Is it just me?  Or are we long past due for a Tumbleweed post?",
			"date_added": 1598899293
		},
		{
			"post_id": 1600575756,
			"body": "\nTo the prankster who thought it would be hilarious to hide the big rats nest of haywire in the mud hole...  Good one.  Ya got me good.  It took over an hour to untangle it from my drive shaft,   Next time I will bring wire cutters and a rake no doubt.",
			"date_added": 1600575747,
			"meta": "{\"img\":\"900,675,4335445546554433322111112228887767776669989a9543,01234567688421045786923ABB08869C9DED0568442BD40808400442108540444440514FFF122454\"}"
		},
		{
			"post_id": 1600575869,
			"body": "What a mess.  lol  This tangled rats nest of wire brought me to a dead stop.   Very effective \"prank\"  I went out with the 4x4 expecting to get stuck, I just wasn't expecting it to be like this.  Still had fun :p",
			"date_added": 1600575859,
			"meta": "{\"img\":\"900,675,655765877543444233433332a99654dcceeeaaa222cbb988,012033456611304435578201111933A214333966BC009466DDEC021936772F8AC103361FBBBEF119\"}"
		}
	],
	"bgColor": "#D30C37",
	"post_like": {
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1566145495": 1566188058,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1583295899": 1583471514,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1583275237": 1583472389,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1585768670": 1585776115,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1592383919": 1592405686,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1592343805": 1592405700,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1592527816": 1592595877,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1604076644": 1604069461
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Publicality: This literally just showed up right now... Wtf is going on.   Hmmm   Try guessing eh?  Do I get a hint?",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1566189263
		},
		{
			"comment_id": 2,
			"body": "@Publicality: as impossible as this is to guess:)  I'll try.  Did you have another user name here that starts with T?  ",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1566280215
		},
		{
			"comment_id": 3,
			"body": "@Publicality: :) I didn't want to spell it out to protect your secret.  (in case I'm correct) Its impossible to know how many id's people have, but not everyone is friendly and playful.  I would even guess you're \"Awesome\". Do you have lots of id's?   I only have one ;)  For now.  ",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1566322523
		},
		{
			"comment_id": 4,
			"body": "@Publicality: I suppose this is true, however. if 30 people shared an ip and were all dressed like furries (for example) that would make it nearly impossible to say for sure.  Someone would have to dig pretty deep in that instance:)  And it can be fun not knowing:) Guessing games are fun.\nHow accurate would you think my user name is?  Would you think I'm big? bad? Bob? I promise to answer truthfully.",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1566414227
		},
		{
			"comment_id": 5,
			"body": "@Styromaniac: Indeed strange to ponder.  Are we aliens or did aliens come rape monkeys?  We are like no other species and very destructive... Like a super virus.  With our ability to build and launch spacecraft we are like an airborne super virus. Cover the earth in cement and ruin everything then go fuck up another if possible.  Wtf are we? lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1566528102",
			"date_added": 1566529618
		},
		{
			"comment_id": 6,
			"body": "@Publicality: You are correct and and I believe that's happening.  We love to build machines to do the work.  From my understanding we could destroy the world(and ourselves) with the push of a button.  It would seem we are too smart for our own good but have not yet destroyed ourselves somehow.  Ain't gonna lie, self replicating robots sound pretty cool.  will we survive?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1566528102",
			"date_added": 1566535434
		},
		{
			"comment_id": 7,
			"body": "@Publicality: That is some interesting insight;) I would say both. My heart is pure and my demons are dark.  Its the everyday struggle:) In real life it would depend who you asked and some would be torn.  Some who have mistaken kindness for weakness have learned to respect and others would never believe it.  I've had a short fuse with bullies in the past but am now on my best behavior:)  My user name reflects some peoples misinterpretations of me irl. I think I'm a sweet guy, documentation suggests I'm dangerous.  My name is not actually bob lol:)   Teasingly sadistic?  Perhaps... Ive had some real life black pills and can still laugh:)",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1566629425
		},
		{
			"comment_id": 8,
			"body": "@Publicality: you know it:)  I do my best to move forward.  I have some time yet to where i am  systematically punished now and then, and reminded of the past.  Reasonable people seem few are far in between:)  You seem kind,  the world needs more kind people.  Its not always easy when dealing with the unreasonable:)   I appreciate the well wishes, I hope all is good for you too.  ",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1",
			"date_added": 1567032415
		},
		{
			"comment_id": 9,
			"body": "@Moor: Makes sense as I am using tor.  Thanks,  I'll piss around with it.",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1579454867",
			"date_added": 1579455282
		},
		{
			"comment_id": 10,
			"body": "@Beefdiesel: good one,   I'll do that and re upload.",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1579456519",
			"date_added": 1579484258
		},
		{
			"comment_id": 11,
			"body": "@draugrdeathlord@zeroid.bit: I thought so,  just learning to use gimp.  Did you notice the 737 falling out of the sky?   I figured it needed to be there too, lol",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1579456519",
			"date_added": 1579484364
		},
		{
			"comment_id": 12,
			"body": "@draugrdeathlord@zeroid.bit: Meta?  Like the privacy compromising type? ",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1579456519",
			"date_added": 1579494484
		},
		{
			"comment_id": 13,
			"body": "@draugrdeathlord@zeroid.bit: OK, fabulous,  cause i have an updated version with loads more meta ill post soon.  Any requests?  I got a little more space yet, lol  ",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1579456519",
			"date_added": 1579569700
		},
		{
			"comment_id": 14,
			"body": "@Lianna: Good question.  The image somewhat built itself and certainly is chaotic.  I would consider it art so it can be interpreted as art by the individual.  To me it would represent influential people having a party and the general insanity of this world.  I tried to capture some of the happenings of 2019 as reported by media with a twist of conspiracy and popular opinion.  But mostly just pissing around with gimp:)",
			"post_uri": "1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj_1580084741",
			"date_added": 1580174043
		},
		{
			"comment_id": 15,
			"body": "I would if I could... that be sweet",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1582516714",
			"date_added": 1582595261
		},
		{
			"comment_id": 16,
			"body": "The negativity bias is strong in you, and its not a bad thing.  The more we get burned the more we retract.  There is no bigger \"fuck you\" to the world as when we get back on the horse and smile in the face of adversity.  Healing takes time and every one suffers in life.   Must not let fear win and keep the expectations (for oneself) in check.  I did not work for a year and feel I can relate to not wanting to (Bad experiences).  Ive been back working now and my new job feels much better, possibly because I refuse to put alot of pressure on myself.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1583275237",
			"date_added": 1583472313
		},
		{
			"comment_id": 17,
			"body": "Yup,  even when they try to force it upon you.  It's like \"Back off ego strokers\" \"Take it back\"   lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1583615420",
			"date_added": 1583624950
		},
		{
			"comment_id": 18,
			"body": "If this does not completely crash the global economy...  I will be quite surprised.  The way the media is handling this in my country (government approved media/propaganda state) does nothing but cause hysteria and it really does seem intentional.   They say not to go to work and do not travel.  Time to welcome the U.N overlords next level?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1584219937",
			"date_added": 1584207702
		},
		{
			"comment_id": 19,
			"body": "Well isn't this a delicious remedy.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1584484925",
			"date_added": 1584475165
		},
		{
			"comment_id": 20,
			"body": "She is kinda cute...  So naturally I would opt to agree,  But she also looks like a well mannered/less crazy version of one of my ex's,   so I must remain skeptical.   Good video.   ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1584505003",
			"date_added": 1584503641
		},
		{
			"comment_id": 21,
			"body": "I was seriously considering wearing the full tyvek suit and full face mask to go to the store...  mostly for fun and because I can.  maybe next time.   Might want to hold on to that card for later.   ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1584935602",
			"date_added": 1584923577
		},
		{
			"comment_id": 22,
			"body": "Looks like a decent distro as far as being set up for ease.  I might give it a whirl on a usb.  Oh,  they want money for the good one, lol\nI really like mint but I use debian 10 instead.  ",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1585768670",
			"date_added": 1585776631
		},
		{
			"comment_id": 23,
			"body": "@Styromaniac: I've been using it, seems like all the other distros running off a usb.  They are all snappy off a usb.   I  gotta try it with windows programs to see if it is special and everything they claim it to be.  I like mint because everything seems plug and play where debian makes you work for everything.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1585768670",
			"date_added": 1585837876
		},
		{
			"comment_id": 24,
			"body": "Just be happy it wasn't my butt.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1588996257",
			"date_added": 1589043900
		},
		{
			"comment_id": 25,
			"body": "@Styromaniac: Not too bad.  I just went and had a look.  I would post a pic but I wouldn't want to steal any Natalia's thunder.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1588996257",
			"date_added": 1589046935
		},
		{
			"comment_id": 26,
			"body": "Can't worry too much.  There is a lot of good that comes with the bad. Gotta enjoy the now and all the good days cause it can always be much worst.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1597808116",
			"date_added": 1597901642
		}
	],
	"follow": []
}