{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 2,
			"title": "Agorismo (ANCAP) - Como evadir de impostos.",
			"body": "Tópico para discutir técnicas agoristas para evadir de impostos, através de importação e tributação, por exemplo.\n\nPor favor, seja sucinto ao dar a sua dica de evasão. A ideia é que este post seja uma lista com diversas técnicas.\n\nLembrem-se sempre: Imposto é roubo.",
			"added": 1474950565
		},
		{
			"topic_id": 3,
			"title": "Agorismo (ANCAP) - Como navegar de forma anônima e segura online.",
			"body": "Tópico para discutir técnicas de segurança para navegar de forma segura e anônima.\n\nPor favor, seja sucinto ao dar a sua dica de como navegar de forma segura e se manter anônimo. A ideia é que este post seja uma lista com diversas técnicas.\n\nATENÇÃO - LEIA ISTO ANTES DE POSTAR\n\nCertifique-se que a sua conexão é segura e de que você de fato está anônimo antes de postar aqui.\nUse uma combinação de VPN + Tor + ZeroNet.\nUse um nome de usuário que não lhe identifique.\nNão poste informações pessoais.\n\nLembrem-se sempre: Big brother is watching you.",
			"added": 1474950845
		},
		{
			"topic_id": 4,
			"title": "Agorismo (ANCAP) - OFF TOPIC",
			"body": "Tópico para falarmos sobre agorismo e jogarmos conversa fora :)",
			"added": 1474951239
		},
		{
			"topic_id": 5,
			"title": "Agorismo (ANCAP) - FreeMarket",
			"body": "Espaço dedicado para anunciar objetos a venda. \n\nUsem o ZeroMail, Tormail ou alguma forma anônima para se comunicar. \nTenha cuidado para não ser enganado na sua compra.\nUsem Bitcoin.\n\nRelacionado: http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y/Agorismo+ANCAP+Como+navegar+de+forma+an+nima+e+segura+online",
			"added": 1474955503
		}
	],
	"topic_vote": {
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"4_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"2_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": 1,
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"1_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1
	},
	"next_comment_id": 4,
	"comment": {
		"3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": [
			{
				"comment_id": 1,
				"body": "> [sirenyc](#comment_124_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Usa o VPN do navegador OPERA que e ilimitado!\n\nEu uso o Tor. De vez em quando uma combinação de uma VPN + Tor.",
				"added": 1474955644
			},
			{
				"comment_id": 2,
				"body": "> [sirenyc](#comment_126_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): o TOR ja vem configurado? e só instalar e usar?\n\nMais ou menos. Eu tive que apenas que configurar uma coisa bem simples:\n\n1 - Digite: \"about:preferences\" (sem aspas) na barra de endereços do Tor (Firefox).\n2 - Em seguida clique em Advanced->Network->Settings (Ou Avançado->Rede->Configurações)\n3 - No campo \"No proxy for\" (Sem proxy para), adicione o endereço IP: \"127.0.0.1\" (sem aspas)\n4 - Agora a ZeroNet vai funcionar junto com o Tor :) basta acessar: http://127.0.0.1:43110",
				"added": 1475010367
			}
		],
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 3,
				"body": "Eu tentei clonar e criar um site próprio na ZeroNet. Estou tendo problemas com a assinatura do site. Dá um erro bem maluco.\n\nAbri uma issue no GitHub e os desenvolvedores falaram que estava corrigido e que era para fazer download e tentar de novo. Eu fiz exatamente isto em uma máquina com Debian e ainda não consegui. Se tiver voluntários suficientes, posso colocar a Wiki como hidden service do Tor até migrarmos novamente para cá.",
				"added": 1476320377
			}
		]
	},
	"comment_vote": {
		"124_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1
	}
}