{
	"posts": [
		{
			"id": "0bd7df97-3093-440a-b959-cdb40331a997",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "41fae65e-1972-456c-b5f6-d64e45560986",
			"body": ">>d7e8c991-bada-4459-865f-1b1edeb12d86\nThe problem is post numbers are client side. So if your client retrieves some more posts it didn't have between the moment that you click on a post number and the moment you click \"reply\", the post that shows up as you replying to won't be the correct one.\nYou can (mostly) prevent this by visually checking the post number is still the right one when you click on \"reply\".",
			"time": 1565836202632,
			"files": "[]"
		},
		{
			"id": "cf5cb5d0-b1b5-400d-85a7-5246c75c1770",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f372c3ca-5dd0-462b-a5ba-adf29ef11ce7",
			"body": ">>b584c54d-0d2c-4045-a977-2d1cb860ee97\nZites can ony execute javascript. No different than any clearnet site.\nI'd get into nntpchan but there is too little documentation. For example, how do I run my own instance? How do I run it over Tor? With ZeroNet everybody is running their own instance by default and can easily enable Tor by editing a few config files.",
			"time": 1565838708088,
			"files": "[]"
		},
		{
			"id": "d63650d6-a27d-4bc6-90c1-a0700f04eb5e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>c4a4e07c-2005-4960-93a1-bfce62e10fe5\nLiking them (for themselves) and believing owning them should be an inalienable constitutional right that should never be violated are two different things.\nLeftists inherently like central planning. That includes centralizing law enforcement, personal and national defense as well as the decision making with respect to who should own guns or not.\nShow me one leftist organization with more than 10 members that is staunchly pro-gun. There is none.",
			"time": 1565839123775,
			"files": "[]"
		},
		{
			"id": "b51cd692-76c1-4c91-a4fb-de5464a4624a",
			"directory": "users/1P98Jo7EvoqHxHX1xsYSHmbpQgfjtSHheQ",
			"uri": "hgg",
			"thread": "aabbe3c0-b7e3-4e6e-ab15-462f19d1ae4c",
			"body": ">>807615c7-cfcc-4f03-8a94-3224384d75ef\nTry updating.\nhttps://anonfile.com/79R1c039n9/update_08chan_s_Millchan_version_201908141821_zip",
			"time": 1565840570694,
			"files": "[]"
		},
		{
			"id": "c8bb1470-1842-4ed6-b277-ea22ba522adc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4ec0eed-e962-4e77-9943-a7ec20406765",
			"body": ">>ccd929dd-7749-44cc-ae70-868c41bfc1a5\n>we\nWho? Cocksuckers United?",
			"time": 1565840879299,
			"files": "[]"
		},
		{
			"id": "6b1427ed-78f1-4206-abbe-6a620b09c0f6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>81468416-9ded-4946-bf1b-db9a8bb40aeb\nRight, now prove\n- That they're leftist\n- That they supports gun ownership unconditionally\n- That they have more than 10 people\n>Also you're lying about leftists, inherently, liking centralization.\nIt's true though. Anarchists might not like centralization, but their ideology is so incoherent it doesn't matter.\n>The whole point is to decentralize the work place as much as possible through democracy.\nIn theory, everybody owns the productive enterprises. In practice, direct democracy is impossible for more than one or two decisions a year. So you need indirect democracy, in which a select few end up taking every decision. So power is centralized in the government. You, as an everyday guy, only have the choice to pick between one bunch of crooks and another bunch of crooks once every X number of years.",
			"time": 1565841431445,
			"files": "[]"
		},
		{
			"id": "a2236635-182f-4098-b05e-ce520dfd7faf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>550534f8-9703-4063-9973-6186e02b9e56\n>In reality everyone should just be free to act autonomously with out the intervention of others.\n>Why is you people can't just let people be free?\nNice LARP.",
			"time": 1565843143128,
			"files": "[]"
		},
		{
			"id": "e5edad99-930b-49c4-a0a4-f51c25bc256e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>532340ef-bfb1-49dd-b331-e3c33186ac76\nIt was set up that way because the spambots were making the site unusable.",
			"time": 1565844495198,
			"files": "[]"
		},
		{
			"id": "9f2be50f-9ded-41ba-be30-8e0708f4169f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>a775c7dc-07fb-4520-8177-e1b0f329ac2d\nSecurity through obscurity is not worth it. People could hack their clients to display the IDs, or just dig through their client's files. Better to just let everyone be aware they're pseudonymous rather than anonymous.\nThe obfuscation is just picking a random string of characters as your username and changing it as often as you can be bothered to.\nWhat could be done is making a script to generate IDs and switch to them automatically before each post, but it would require some serious programming work.",
			"time": 1565845423481,
			"files": "[]"
		},
		{
			"id": "623852f2-b8bf-48ad-aa65-486d38728213",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>1e962974-0d23-4823-856d-73dd2d32fc31\nYou are LARPing as someone who wants freedom. The government monitoring all your transactions so they can come steal shit from you and give it to the nigger next door whenever you make a dime is not freedom.",
			"time": 1565846176673,
			"files": "[]"
		},
		{
			"id": "cac8855a-e3e4-460d-b31e-d373d8858603",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>ccc47e60-4f7e-4c0f-b641-b993b4dd864f\nWhat is leftism if not stealing from the haves and give it to the have nots? (at least in theory)",
			"time": 1565847506611,
			"files": "[]"
		},
		{
			"id": "4c5c11c9-3914-4b37-90ad-66df2159b3d1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>5e0549bb-a291-4863-9040-9b94baac480d\n>Look i'm trying to be nice, but, at least read what I posted prior to this:\nI don't give a shit about you being nice.\n>\"the left\" typically holds the view that workers should control the means of production democratically rather than autocratically like you all believe.\nWhat if I spend all my free time making means of production? What if I spend my life working in exchange of [real goods] so I can exchange it for means of production? That's right, the commie gov will come and steal that from me. Or from my children. Or from my grandchildren. Whenever it becomes big enough for the gov to consider it worth stealing.\n>It has nothing to do with \"steal from the rich and giving to the poor\" though that can always be fun to do!\n1. Kill yourself.\n2. You are contradicting your previous sentence. The way they would \"democratically control them\" would be by stealing them from their owner first.\n>\"The haves\" as you so , bluntly, put it, subsist off the labor of the working classes, that is, the people who own the means of production subsist off no to little labor of their own while the people who actually produce commodities get ripped off.\nThey aren't being ripped off. Without the means of production the capitalist and their ancestors spent their lives working towards owning, the workers would produce even less than the portion they get from operating the means of production owned by the capitalist. If that was not the case, then they would just walk away and produce commodities at home rather than asking the capitalist to let them use his capital.\n>Why the hell is that ok?\nBecause people should be able to decide who or what the fruits of their labor goes towards?",
			"time": 1565849150311,
			"files": "[]"
		},
		{
			"id": "9858ea2e-3af3-4ff4-b9ed-4563ceef1b3b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>36eb24e8-a3ed-447b-b82a-f7a67a221cec\nHe can remove them from the software with a little bit of coding, but you can re-enable them just as easily by patching your own client-side copy of it.",
			"time": 1565849571515,
			"files": "[]"
		},
		{
			"id": "006834fd-d385-4338-ae79-d70ab84cc882",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>51557b25-6c34-419c-b09e-946e0d8e5280\n>Do you mind telling me exactly how you will go about creating these means of production?\n1. Acquire the necessary parts\n2. Put them together\n3. Voila\n>You realize that task is not possible to do on your own, correct?\nSometimes it is, sometimes it isn't. If you can't do it by yourself then pool your resources with other people who are trying to achieve the same thing you are.\n>And even if it was; Why does that justify you having autocratic control over it?\nWe're getting into philosophy here. I don't know what's your preferred moral philosophy, but from an utilitarian perspective, it could be that letting people who are capable of creating things own what they create makes them more likely to survive than the people who aren't, thus advancing darwinian evolution, and making everybody happier in the future because of more resources being available as a result of the higher average intelligence levels.\n>Ownership is not as elf justifying metric.\nDepends on your moral philosophy. For deontologists it sure might be, and even for utilitarians under some conditions like the one I mentioned above.\nThen there are the non-cognitivists, for whom \"people should own what they make\" does not mean anything other than \"I would like this to be the case\".\nIn any case I don't think we are going to solve the relevant millenarian ethical and meta-ethical questions today.\n>Yes they are, because what they produce is worth twice as much as they are paid.\nThose things are not created just by them. They are created by the combination of them plus the capital that was produced by somebody else. So it stands to reason that if they didn't create the stuff all by themselves, they don't get the money all by themselves either.\n>You're just spouting off a bunch of bullshit that you cannot prove and which you have pulled directly out of your ass.\nNo.\n>People cannot just \"create\" things because the means by which to do so are owned privately (autocratically.)\n>It's like mini feudalism.\nIt's not like there's any other way of doing things. If somebody is retarded enough that he can't make a deal with somebody else who has those means in exchange for a fraction of the results of the productive process, then he won't be smart enough to avoid getting swayed out of the fruits of his labor by the leaders of whatever movement he helped get into power (just like it happened anywhere there was a commie revolution ever).\n>>813fb8ba-d752-4842-a481-2de36f42ded1\nWell, to be fair pretty much every corner of the Earth is owned by someone already. So you pretty much need somebody's permission to even build a hut in the middle of the jungle, or the firepower to defend it when they come fuck your shit up. Heck, even if you build an island in the middle of the ocean you won't be left alone.",
			"time": 1565851828784,
			"files": "[]"
		},
		{
			"id": "38e17776-f20e-40cd-b29d-28aeb4783967",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>ff66e70c-cb8f-4bf5-84c5-82d28a5e8e7a\nWhy does it have to be one computer, all done by just one person? That's not the minimum requirement for \"producing\" something. Computers are not produced by single companies. Not even by single countries.\nBut a single person can produce the design for the mask aligner. Or he can produce a wafer with a grown gate oxide layer when given a wafer with the patterned photoresist, a kiln, a spin coater and a bunch of chemicals. Bam, you just created the (consumable) means of production for producing wafers with the interconnect layer finished.",
			"time": 1565852336384,
			"files": "[]"
		},
		{
			"id": "0719b97c-9f2b-4e59-8913-a021db41f326",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>fb4a8ac1-1caf-4d87-b0e4-b76092ac22e4\nProve to me you're morally justified to steal from somebody else even if your life sucks.\nPro tip: **you can't.**",
			"time": 1565852475284,
			"files": "[]"
		},
		{
			"id": "d96c63b9-7d20-4e73-b560-819bc11f974a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">not possible on your own.\nFor you, maybe. I've produced things that way and all I've started with was a $200 laptop and a room in my mom's house.\n>Generally it is not.\nGenerally as in \"generally for most people\" or \"generally for most things\"?\n>Yeah but you didn't actually create anything. You just employed other people to do it for you.\nNope. I didn't employ anyone. I created software by myself and sold it to other people.\n>I am a moral nihilist/egoist.\nThen the notions of right and wrong don't exist for you. By your own philosophy there's nothing wrong with capitalism.\n>Let's look at it like this; if you abstract away everything but the relationship of person A and person B;\n>If person A employs a person (person B) to create X for him then obviously the what Person B recivies for his labor must be equivalent to X otherwise person B would not work for person A because that's how exchanges work.\n<Let's look at it like this; if you ignore the inconvenient parts of my argument and oversimplify the situation, then ...\nHeh. Nice try though.\n>Not currently, what do you think this conversation is about?\nNot currently and not in the future. The conversation is about educating you btw.",
			"time": 1565852934859,
			"files": "[]"
		},
		{
			"id": "8810d018-206c-4748-a964-7564edf423d2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>26b0ace1-da80-44bb-8fb3-bb01790a1bee\nWho are you quoting?",
			"time": 1565853027859,
			"files": "[]"
		},
		{
			"id": "0343f39e-c489-48d0-ab1b-dae2a0c68643",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>0719b97c-9f2b-4e59-8913-a021db41f326\n>It doesn't, which was my point.\nThen we agree on that point.\n>That's exactly why the labor of many should not be owned by the labor of few.\nMaybe it isn't.",
			"time": 1565853187259,
			"files": "[]"
		},
		{
			"id": "b8ecc839-9329-4e20-8051-cb50aea685e5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>19cf0e1b-23ae-4a47-bdd7-6fc627cafa73\nSounds like an unproven claim to me.",
			"time": 1565853551359,
			"files": "[]"
		},
		{
			"id": "64d6ce45-150b-4436-9fd8-8c3a7f3cabc4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>ad67ece4-a0b0-46ca-acc5-e56649faaab1\n>fucking kek.\nOut of arguments?\n>Generally as in 99% of the time; unless you are making autistic mud pies or some shit.\nThen I guess I'm part of the 1%?\n>I assume you built the computer you use too?\nNo? I said \"acquire the parts\", not \"build the parts\". Doing labor for somebody else or asking for charity is a valid way of acquiring parts.\n>This is true. There is only my self interest and the destruction of the capitalist mode of production is aligned with that.\nLol. So not even commies believe in communism now? Good to know.\n>Wow not an argument.\nNeither was yours sweetie.\n>Lmfao, imagine thinking i';m the one being educated.=\nLets leave it up to the audience to decide.",
			"time": 1565853937259,
			"files": "[]"
		},
		{
			"id": "2a66d372-2a24-4222-8706-207e08bcc793",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>3c491ee8-c4d9-4c7f-b172-f5f48a57cb5e\nThat's not what you claimed. You claimed \"the labor of many should not be owned by the labor of few\". So presumably your implicit claim was that the labor of many is owned by the labor of the few.",
			"time": 1565854051459,
			"files": "[]"
		},
		{
			"id": "295da4a9-a605-46ac-be7f-fa7f07706ed3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>d5157421-c09c-446e-9442-4a4ad53feff8\nIn case you decide to push the contents of that zip, be aware it includes a read-only root content.json that you would need to avoid copying or delete in order to generate your own in the publishing process.",
			"time": 1565854747974,
			"files": "[]"
		},
		{
			"id": "6b2e2e38-ff1a-47c7-83d4-a17d4fcf4c1a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>849f3612-725d-4162-b5e7-55be3cab0807\n>If you own capital, yeah, probs\nSo everyone who owns a laptop is part of the 1%? Nice.\n>The people who do not create the mills should not own the mills \nDefine what you mean by \"should\". You yourself said morally there's nothing wrong with it, so in what sense there is anything wrong with it? Because you don't like it? That doesn't mean they \"should not\", that only means they should not if they want to please you.\n>The people who actually build things of utility are the ones who should own them\nAgain, on what basis? Because you want it to be so doesn't mean they \"should\".\n>not the people who just \"own them\" for no reason other than \"cause I won them\"\nThey don't own it \"cause I won them\", they own it because the own the means that were used to build them, which is a shorthand for saying \"they have the military means of defending the usage of those goods for their preferred purposes, and under some moral systems (not including nihilism), they also should be the ones who determine the usage of those goods\".\n>those people have done no actual labor themselves; eg the production of useful commodities.\nIf those people had done no actual labor themselves, then they would not be in a position of militarily defending the usage of those goods. At the very least they did enough work to convince people to both work for them, and to work towards militarily defending the capital and it's output when combined with the work performed by the first group.\n>This makes no sense, go back to reddit.\nno u\n>ok??? I mean we are on a board mostly consisting of radical right wingers, so.\nWhat other alternative there is? If you don't like it you're free to go to [whatever leftypol's bunker was called].",
			"time": 1565855456033,
			"files": "[]"
		},
		{
			"id": "abb6e385-6951-48e2-a423-dd1503ae353a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>9a0d2f1b-6fe1-41d1-badb-2afef3560e6f\n\"The labor of many should not be owned by the labor of few\", \"people own things\" and \"capital owns labor\" are literally three different claims. Make up your mind on what claims you want to make.",
			"time": 1565855739633,
			"files": "[]"
		},
		{
			"id": "0cfcbd05-f97e-4e30-822b-d9fbd4b5d0f3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>ff1f747d-0c13-42c9-bf57-c30df45a7ede\nOh and another thing, could you allow the posting of zip files? Could be useful sometimes.",
			"time": 1565856171074,
			"files": "[]"
		},
		{
			"id": "cfca237e-f572-469c-b26c-30033d5e165f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>8207ab1b-5a1b-488c-a275-896f6a9cfa05\n>Because if you infringe me, I will kill you. There is no other answer. Try it. \nWell, commie governments could say the same thing though.",
			"time": 1565857596384,
			"files": "[]"
		},
		{
			"id": "355eb88f-ffe3-45fa-873e-099292f906a0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>fdf40b57-5861-4e1f-a245-4b06ba7ba63e\nYeah. You'd have to search and replace\n[code]\n\"(src\\\\/)?.{40}(-thumb)?\\\\.(png|jpeg|jpg|gif|webm|mp4|ogg|mp3|pdf|epub)(\\\\.piecemap\\\\.msgpack)?\"\n[/code]\nwith something like\n[code]\n\"(src\\\\/)?.{40}(-thumb)?\\\\.(png|jpeg|jpg|gif|webm|mp4|ogg|mp3|pdf|epub|zip|7z|rar)(\\\\.piecemap\\\\.msgpack)?\"\n[/code]\nin users\\content.json and then sign and publish.",
			"time": 1565857881121,
			"files": "[]"
		},
		{
			"id": "637d4bc6-bcfd-4432-b9d3-0435f0eefcc5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "50ce8639-f0ea-46ea-9f6b-9f30fadb9292",
			"body": ">>a1f0ff7a-2956-4b49-afb8-f9ea22344bf8\nUsing >>35be6b45-ff35-44a2-b8cb-c9397aace82e? Did that issue begin after installing the update?",
			"time": 1565858244032,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}