{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1564850670,
			"title": "Multiuser",
			"body": "Help with using multiuser effectively. I renamed the disabled-Multiuser folder to Multiuser. I added multiuser_local to the zeronet.conf file. When I log out of the user assigned and enter a private key to log in to my zeroid user it doesn't work. Only creating a new zeroid allows content publishing. Is this a bug? If not, please explain how this feature is used properly. Thank you.",
			"added": 1564850669
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1564584559_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y": [
			{
				"comment_id": 1,
				"body": "> [joda](#comment_5_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y): This sounds very interesting but I'm not sure if I get everything. A sketch would be perfect :) ... or do you have a source of this setup? [...]\n\nThis technique has evolved on my machine as I've seen the need for more comprehensive OPSEC. You have the order correct, I'll explain the second VPN. The second VPN makes the traffic unintelligible to the Tor network. There are malicious exit nodes out there. Ideally the second WS VPN should be a free service setup with no personally identifiable information...like ProtonVPN. They don't know who you are and all they see is encrypted Tor traffic headed for the first hop. The second VPN only sees traffic encrypted by the WS VPN and Tor with two different keys leaving the gateway. The final destination only sees encrypted traffic leaving your HM VPN provider who knows your HM IP address, but can't read any of the traffic. In this way the HM VPN can know only your IP and the IP of the Tor exit node and nothing more. It is complex and slow as a result but in our current censorship and legality ridden world it is important to separate yourself from the content potentially hosted when supporting an uncensored internet. There will always be people breaking laws, and it is inevitable that content illegal in your jurisdiction will end up on your HDD or SSD at some point so be prepared. It's a noble cause and no real change has ever been made without brave people sacrificing and leading the charge. I hope this helps. :-)",
				"added": 1564850355
			},
			{
				"comment_id": 3,
				"body": "Notes on config: Don't modify the Whonix gateway. For the fileserver_ip use 10.152.152.11. Enable Tor  always and use Syncronite http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/ for your tracker sync. I user Tor as the tracker proxy and have 32/61 trackers connected. In terminal when starting Zeronet use --force_encryption, --download_option auto, --db_mode security, --fix_float_decimals True, --msgpack_purepython True, --stream_downloads True, --use_tempfiles True, --force_encryption, --filesever_ip 10.152.152.11. If it bogs your system down back away from decimals, msgpack, stream, and tempfiles and try again. The form generally is ./ZeroNet-py3/zeronet.py --options --options --options. I wrote this because there is a gap between developers and users. Developers understand the cli so well that they don't explain simple formatting that users generally don't know how to do. Ask questions if you have them and I will try to answer them. Good luck!",
				"added": 1564851933
			}
		],
		"1564798399_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "I think it is important to do what you can when you can. Every bit of unintelligible traffic on the internet adds to the static that must be sorted through to glean solid information. In most justice systems it isn't what LEA suspects or even what they know. It is what accusations evidence supports. Encrypt, encrypt, encrypt. Support uncensored content. Support free expression of opinions, and networking between people. The goal of our opposition is profit and division. Just as normal light collated makes a powerful laser, people united are an unstoppable force.",
				"added": 1564851176
			}
		],
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": [
			{
				"comment_id": 4,
				"body": "> [xcape2net](#comment_155_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Every website that has only html pages (without javascript, php, etc) is a Web 1.0 website, and they are still around.  So, Web 1.0 and web 2.0 coexist today.  Mostly likely, the same will happen with Web 3.0.  We will continue seeing Web 1.0 and 2.0 sites as more and more Web 3.0 sites are appearing.  All three will coexist.  So, there will never be some point at which we now have web 3.0, even though some people may declare it to be true long after the fact.  We will just gradually have more Web 3.0 sites.  Many big companies will choose to continue to have their central servers for one reason or another, so Web 2.0 sites will never disappear completely, just like Web 1.0 sites will never disappear completely.\n\nThe big corporate interests will find a way to monetize 3.0 as well, but we don't have to make it easy for them!",
				"added": 1564852143
			}
		]
	},
	"comment_vote": {
		"1_1FCgqJ8zYU1iZtfQJY2v4hSMfaNFUExr7T": 1,
		"155_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"36_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1
	}
}