{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1517380880,
			"title": "Nullpointer's Dev Blog - Code resource for Java developers",
			"body": "Hey all, I've started a zite aimed at Java game programmers.  \n\nThe key aspect of the zite is to act as support and provides explanations on various topics such as graphics rendering, game loops, the math behind 3D perspective and much more. All articles have some source code downloadable(actually just a copy from disc) as a link.\n\nI may be adding different programming languages in the future, most notably c++. But it'll all be Java for now, since that's the language I've been working with for the past 5 years.\n\naddress: http://127.0.0.1:43110/1KLA715npMkKeDAA7CuUTsQQzE5DnQwApw/\n\nPS: English isn't my first language, so bear with me as I improve the readability over time.",
			"added": 1517380879
		}
	],
	"topic_vote": {
		"1517072402_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"1517355233_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": 1,
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1517355233_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": [
			{
				"comment_id": 1,
				"body": "Sounds like a great idea. I wonder about the possibilities. I'll be keeping an eye on your project.",
				"added": 1517379144
			},
			{
				"comment_id": 3,
				"body": "> [wellan](#comment_1_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC): I don't know if I will find time and motivation for that, but it would be nice to create a browser game with economy, maybe resources, and long term fight to see how it can scale with optimizations. When the project will be more mature, I will probably explain how to use the API so people can build things with it.\n\nSounds great. I'll be looking in to some game designs once your API leaves beta.",
				"added": 1517419311
			},
			{
				"comment_id": 4,
				"body": "> [wellan](#comment_4_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC): While debugging an issue, I removed all my blocks, but gitcenter became the chain start. Didn't expect that, but I think I will keep this behavior.\n\nThe first game that came to mind was OGame. A browser strategy game where you need to collect resources, build defenses, attack players, etc. I have actually never played it myself, but got a friend who did. I'll ask him for some details.\n\nclearnet:\nhttps://en.ogame.gameforge.com/",
				"added": 1517462627
			},
			{
				"comment_id": 5,
				"body": "> [wellan](#comment_7_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC): I added a GitHub link with the zchain.js file synced with the base-zite file, with documentation.\n\nThanks. I'll look into it. Can't say I'll be having a game up and running in a few weeks though. Got my own zite to sort out first.",
				"added": 1517666845
			}
		],
		"1517380880_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw": [
			{
				"comment_id": 2,
				"body": "Thanks, bro",
				"added": 1517418078
			},
			{
				"comment_id": 6,
				"body": "> [helium](#comment_3_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): My native language is Estonian. I have found the following dictionaries very useful: [...]\n\nThanks, that's going to help me a lot.",
				"added": 1518290854
			}
		]
	},
	"comment_vote": {
		"26_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"28_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"7_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": 1,
		"3_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1
	}
}