{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1565880498,
			"title": "SOPA is back, WhiteHouse drafty to censor internet (feat. Ajit Pai)",
			"body": "https://actionnetwork.org/petitions/censor-the-internet/",
			"added": 1565880497
		},
		{
			"topic_id": 1565881045,
			"title": "Typhoon Lekima - scary shit and marvels of Chinese engineering",
			"body": "https://www.youtube.com/watch?v=hH3yyEPWE0o",
			"added": 1565881043
		},
		{
			"topic_id": 1565907500,
			"title": "Everything is better with metal! \\m/",
			"body": "https://youtu.be/iybYK53pzYw",
			"added": 1565907497
		},
		{
			"topic_id": 1565907846,
			"title": "Dont we need some categories here?",
			"body": "Before it will turn into monocultured echo chamber. I guess sooner or later everyone gets tired or repetitive content. Just asking, dont shoot.",
			"added": 1565907842
		}
	],
	"topic_vote": {
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": 1,
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1565342542_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 1,
				"body": "> [anonkraut](#comment_14_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh): 1GB? It's 2019 mate. We are talking TB now.\n\nHe said \"USB\" ;)",
				"added": 1565344392
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 2,
				"body": "Free speech without netiquette was, is and will be garbage. Sooner or later every site needs moderation. Reddit idea is brilliant - users creates streams/channels and moderate it with friends or trusted users. Look at Voat and you see where free speech is going.\nDemocracy doesnt work if IQ drops < 90",
				"added": 1565344601
			},
			{
				"comment_id": 3,
				"body": "> [dsfkjdhskfhds](#comment_4_1KzwNCqdRAhnPoKktNh4t8ZSgpbzWWvLGx): you clowns can have any opinion you want. i don't care. i just don't want to see your bullcrap by default. that is all.\n\nYou DO understand in which group \"you clowns\" lands you, right? \nIn many cases not in the one thats missed a lot",
				"added": 1565344855
			},
			{
				"comment_id": 4,
				"body": "> [anonkraut](#comment_15_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh): I don't need rules as long as I got regular expressions and a killfile.\nEverything needs rules. Even if this is \"no rules\" rule.",
				"added": 1565344978
			},
			{
				"comment_id": 6,
				"body": "> [zeronetanon4](#comment_52_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): We'll figure it out as time progresses.  It will be pretty challenging to balance all of the project's priorities in a decentralized environment.  I'm looking forward to be a part of it.\n\nWe shouldnt. It was right there from the very beginning of public internet and was called \"netiquette\" - boils down to simple \"dont be moron\". Sadly is dead now. The new norm is \"give a man a mask, and he will show you his real face\". Mostly the face belongs to some fuckin moron, but thats sign of times, I presume",
				"added": 1565345645
			},
			{
				"comment_id": 7,
				"body": "> [zeronetanon4](#comment_53_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): minimal framework (perhaps optional on sites and not required) to protect its integrity and function\n\nVery unpopular opinion: it shouldn't be minimal. It should censor the proverbial shit out of any public site to match human decency. There are no regular expressions to resolve it, nothing less that TensorFlow and SciKit. Otherwise will be sabotaged as soon as it gains popularity and will threat powers-that-be. Someone WILL start posting things that will force all 3 letter agencies to intervene and they will do it. Silk Road was full of invincible people.\n4chan censored itself, altough I wouldnt call it \"censorship\". Even in regular classromm you throw fuckin morons off the group simply because they are fuckin morons. No need to tolerate them online",
				"added": 1565346239
			},
			{
				"comment_id": 8,
				"body": "> [zeronetanon4](#comment_56_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): []\n\nTechnically theres nothing to do. You cant win the race. The best way to avoid morons is to not give them resons to come. First: needs successful downvote mechanism and hide posts below certain points by defaut. Users can, if they want, lower the threshold and scuba dive in shit if they please. Something like slashdot.org has. Methods are already there - well tested in clearnet. This would need some brainstorming but is definitely doable. What should be fixed is human factor, not technicals. The goal is that even if you will get unlimited count of saboteurs, SJW moron, shills, niggerfaggots of all sorts - they will be limited to threads. \nIs definitely better to hear \"ZN hidden channels are full of shit\" than \"ZN is full of shit\".\n\nOr, I dont know, gold membership based on existing mechanisms like 1 USD lifetime certificate paid with CC or PayPal (not BTC) which will stop spammers and shills before they start (since one CC or PP can be used only once)\nYou ban CC/PP once - finito la musica, passato la fiesta - shill is out once and forever.\nI wouldnt have problems to pay for it, majority of valuable banned YT people already pay for Vimeo etc. Maybe will fly, maybe will not. Maybe this is completely stupid idea. Or ingenious. \nIm pretty sure there are countless possibilities but tech arms race is not one of them.",
				"added": 1565348701
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 5,
				"body": "You fags rejected the God and complaining that the world is going to hell. Because fuck logic.\nYes, it's THAT fuckin simple. Think it through.\nIm not saying is ideal - it's just the best we have.",
				"added": 1565345117
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "For child porn is enough to turn on CNN and their fuckin drag queens molesting 5 yo kids in library. Those fucin degenerates are LAST to call anyone else.\nThey have too much HIV under their skull so their nonfunctioning brains can comprehend, that people are leaving media to AVOID this fuckin disgust and CP they are pushing on air",
				"added": 1565359275
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 10,
				"body": "Request 1USD paid with CC or Paypal, then allow it only once, problem solved. Or get SMS.\nOh I forgot, we are all partners in crime here. The well, tough shit, drown in the cloak.\nStill anonymous, if the registration code will be publicly available - just compare hash of the phone number without storing it. Matter of trust, but completely doable. \nAgain: Use phone like password is used. Compare salted hash, dont store it.\n",
				"added": 1565359416
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 11,
				"body": "GitHub is blocking access to countries that need ZeroNet the most. This is the most ridiculous place to store  the repo, coz muh tradewar \nStoring ZN on Microsoft servers (thats what GitHub is) is an equivalent of those \"Free Tibet Now!!!\" \n shirts made in China",
				"added": 1565417204
			}
		],
		"1565777740_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "3? They really had hard week",
				"added": 1565879865
			}
		],
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 13,
				"body": "> [theecollector](#comment_35_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): cool if privacy is a crime the i forbid you to ware clothes and you now have to walk around naked for everyone to see you needle dick. Fuck outa here LEA🚨\n\nDont feed the troll",
				"added": 1565907141
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 14,
				"body": "> [memesadler](#comment_89_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I'd just like to interject for a moment [...]\n\nStallman never gets old :D",
				"added": 1565959276
			},
			{
				"comment_id": 15,
				"body": "> [xcape2net](#comment_315_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I thought Linus Torvalds invented Linux in the early '90's.  What does GNU have to do with it?\n\nIt';s like you said he invented Android. Android uses as much Linux as Gnu. Or like you said that windows is ntldr.exe",
				"added": 1565959340
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 16,
				"body": "Everyone using term \"white people\" is racist by very definition of it. So yeah, 2 words for you (and they are not \"Merry Christmas\")",
				"added": 1565959482
			},
			{
				"comment_id": 17,
				"body": "I would like to point the fact that whole Africa not only lack single written language but also never built a single fuckin road (not to mention city). Cambridge University was opened in 1209, way before we knew Africa even exists, so blaming whites is very convenient, but about as retarded as niggers can get.\nHow about you sort your fuckin degeneracy and imbecility first instead of demanding something that you cannot even describe, you obnoxious piece of shits? Then and only then we can start talking. Look Japan/China/Korea and recently India. Non-whites, hard working, intelligent and by definition - rising enemy of poor sandniggers who could disappear tomorrow and ther world wouldnt even notice.\nOK,. now I can mute this shill :) But it's always worth to spread the word :)",
				"added": 1565959627
			}
		],
		"1565922890_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 18,
				"body": "Some evidence of this science?",
				"added": 1565960363
			}
		],
		"1565922993_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 19,
				"body": "Why?",
				"added": 1565960402
			}
		]
	},
	"comment_vote": {
		"89_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1
	}
}