{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "> [chergriog](#comment_10_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): If you 'religion' is about converting others to your religion or i die, or i go to hell, or something bad may happen to me, or i'm damned, or i'm an infidel... then you are a serious obstacle to peace and civilization and you have to be killed, before you cause any more pain.\n\nDie in your rage, your rage and hatred towards Islam only increases the faith of the believers. Your lunacy is stupid as well as humorous. The spread of Islam into your lands only causes you rage and anger and Monotheism will continue to spread until the final hour.",
				"added": 1569381451
			}
		],
		"1569339653_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 2,
				"body": "You Non Muslims are barbaric and are willing to kill women and children in the name of your idiotic ideology and lunacy. Enraged youth who become arrogant and amazed with themselves, eventually drowning in delusion and rage.",
				"added": 1569381707
			},
			{
				"comment_id": 3,
				"body": "You Non Muslims are barbaric and are willing to kill women and children in the name of your idiotic ideology and lunacy. Enraged youth who become arrogant and amazed with themselves, eventually drowning in delusion and rage.",
				"added": 1569381712
			}
		],
		"1568768337_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 4,
				"body": "> [toyata](#comment_106_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Who is Tarrant?\n\nAn enraged idiot who was drowning in rage and self-amazement, eventually going on to kill Monotheists. Non-Muslims have proven time and time again to be barbarians who justify their killing of innocents by wanting to spread their lunacy and idiotic ideologies such as Temper Tantrum Tarrant.",
				"added": 1569382021
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 5,
				"body": "To think the world came from 3 scenarios\n1. It came from nothing\n2. It always was \n3. A computer simulation\n\nThe first makes no sense and even a child can understand this. A cause always has an effect, an effect does not exist unless a cause brings the effect into existence. So this is discarded.\n2. It always was, this is lunacy as the universe is known to have a beginning, a creation always has a creator. This 2nd option has no evidence has relies only on philosophy and conjecture. \n3rd, do I really even need to say why this one is stupid?",
				"added": 1569384329
			}
		],
		"1568373932_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 6,
				"body": "> [hotwheels](#comment_18_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu): ايه رأيك في اللي بيعمله الفترة دي ؟\n\n> [hotwheels](#comment_18_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu): why you are wondering there is an egyptian (arabic speaking) is present on zeronet ?\n\nWhat religion are you?",
				"added": 1569384557
			}
		]
	},
	"comment_vote": {}
}