{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1556264224_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": [
			{
				"comment_id": 1,
				"body": "I have to stand in line for way to long just to pay in cash, their machines dont do it and where in the passed a manager or free staff member would walk down the line asking if anyone paying in cash, they would pull you to the front as it was by far the easiest thing to do. \n\nAnnoyingly, most of the people in front of me are asking why their mobile phone app has stopped working, one lady even had to hand over her phone to cashier to 'fiddle' ... not good. \n\nHigh St branch closures and cash machines no longer take cash in, forces me to be as polite as I can while the staff speak loudly about How much an elderly lady wants to move from her ISA ...\n\nSometimes I just start singing so I can give them privacy!!",
				"added": 1556277159
			},
			{
				"comment_id": 2,
				"body": "Haha ! @Winstonsmythe84 Tell them you are recording the phone call for training purposes!! Cant believe they reacted like that! \n\nThat reminds me, when an auto card top up payment was going out that I had no way of stopping as it did not appear on the vendors site. I had been told that they could not help as despite it being MY ard being used, data protection prevented them from divulging where that money was going!\n\nIn the branch I was told the payment would carry on even with a new card issued ( even though the Fraud specialist had said the opposite). This she said this was to protect the vendor in case i cancelled the payment when i might owe them money. - This is a phone top up so the payment is in advance of the bundle not after.\n\nI said so your rules are not protecting my money at all, its protecting Visa, she tipped her head to the side and said ... 'erm... yes'.\n\nAll they could do was block ALL payments going to this vender, and also wait while she printed out 6 months of statements, so i could highlight with a pen the incorrect payments!!!! Maybe I will get a refund after they investigate it!",
				"added": 1556278432
			},
			{
				"comment_id": 3,
				"body": "> [ztz](#comment_15_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): I called to close a USD account after making a last transfer. (Wanted it to be closed asap)I was told to just send a msg online and it would be done. [...]\n\nGood Mantra! ",
				"added": 1557980084
			}
		]
	},
	"comment_vote": {}
}