{
	"next_topic_id": 16,
	"topic": [
		{
			"topic_id": 1537252506,
			"title": "为啥我感觉没有多少人在线呢？但有时又有许多人在线。比如首页Hello有时只有几个人，有时又有几千人。",
			"body": "",
			"added": 1537252505,
			"parent_topic_uri": "1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537256430,
			"title": "有些网站不让你复制内容，怎么办，比如明网中的知乎？",
			"body": "用Firefox浏览器，加上js插件，当需要复制内容时，就关闭网站的js。",
			"added": 1537256428,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537256496,
			"title": "人这一生为什么要努力？",
			"body": "奶奶五十岁才来的美国，身无分文，也没有一技之长，随身携带的只有长年辛勤劳作留下的一身病根。\n\n那是九十年代初，她去了唐人街的扎花厂上班，每天工作十个小时以上，一年工作三百六十五天。\n\n扎花按件算钱，她眼神虽然不好，却比谁扎得都快。\n\n有人弹吉他磨出了茧，有人搬砖头磨出了茧，她被针头扎出了茧。\n\n回国看我的时候，她给我带了费列罗巧克力，翘胡子薯片，Jif花生酱。\n\n她给我买好看的小西装，给我买一斤几十元的黄螺。\n\n她带我去动物园，游乐园，森林公园，带我去北京看长城，看天安门，看毛主席。\n\n“奶奶，美国比北京还好吗？”\n\n她用最朴实的语言向我描述纽约的繁华，告诉我美国好极了，一切都在等着我。\n\n知乎上经常讨论富养女孩，我有一个男孩被富养的故事。\n\n有一年，我的巧克力吃完了，薯片吃完了，花生酱吃完了，奶奶还是没有回来。\n\n那是我第一个不愿意知道的生活真相，她中风了，瘫了半边身子。\n\n\n奶奶移民美国时带去了三个未成年的儿子，二叔，三叔，四叔。\n\n二叔和三叔在登陆美国的第二天就打工去了，年幼的四叔读了几年书后也离开了学校。\n\n他们在亲戚家的餐馆打工，每天工作十二个小时，每周工作六天。\n\n餐馆一年营业三百六十四天，只在感恩节那天歇业。\n\n奶奶瘫痪后，叔叔们轮流回国，给我带好吃的，带我出去玩。\n\n我喜欢打乒乓球，二叔给我买了乒乓球，乒乓球拍，乒乓球桌。\n\n有一年流行四驱车，三叔给我买了一辆遥控越野车，助我碾压所有的小伙伴。\n\n四叔年少风流，出门把妹的时候总不忘带上我，要把我培养成下一代情圣。\n\n他们绝口不提在美国生存的艰辛，那是大人们的秘密，和我无关。\n\n\n奶奶出国五年后，爸妈也去了美国。\n\n怎一个落魄了得？夫妻俩连属于自己的房间都没有。\n\n扎花已经被时代淘汰，只有重活可以干。我爸当过屠夫，货柜工人，货运司机。\n\n细节不必赘述，无非就是 12小时 x 365天的陈词滥调。\n\n后来，他们四兄弟聚首，开了一家小超市，一家餐馆，后来又开了第二家小超市，第二家餐馆。\n\n钱赚得越来越多，老家伙们拼命工作的老毛病却没有得到丝毫缓解。\n\n\n爸妈出国五年后，我也来了美国，看清了生活本来的面目。\n\n我在纽约生活了几个月，带着半身不遂的奶奶看遍了世界之都的繁华。\n\n在这之前，她几乎没有走出过唐人街的范围，以前对我描绘纽约时一半是转述，一半靠想象。\n\n后来，我回到了父母的身边，结束了长达五年的骨肉分离。\n\n我爸来车站接我，把我带到了一栋小别墅前，很得意地告诉我：“这是我们家，知道你要来，刚买的。”\n\n我去过奶奶刚来美国时住过的那个阴暗破旧的小公寓楼，也去过爸妈栖身过的那个散发着霉味的地下室，我知道我在新家会有一张床，一个房间，但我没想到，我会有一个别墅，一个前院，一个后院，一整个铺垫好的未来。\n\n\n人这一生为什么要努力？\n\n奶奶的答案是我，爸妈的答案是我，我的答案是他们，以及把身家性命托付于我的媳妇和孩子。\n\n对于我来说，长大了，责任多了，自然而然地想要努力，不是为了赚很多很多钱，而是为了过上自己想要的生活，过上奶奶和父母不曾拥有过的生活。他们替我吃完了所有的苦，帮我走了九十九步，我自己只需再走一步，哪敢迟疑？\n\n从外曾祖父母算起，我们家族四代八十多口人已经在美国奋斗了半个多世纪。我们人人都在努力，我们一代好过一代。\n\n\n如果你的人生起点不高，不曾有人为你走过人生百步中的任何一步，不打紧，你尽管努力，多出来的步数不会被浪费掉，总有你在乎的人用得着，而你迟早会遇到你在乎的人。\n\n与诸君共勉。",
			"added": 1537256493,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537256608,
			"title": "“我读过很多书，但后来大部分都被我忘记了，那读书的意义是什么？”",
			"body": "",
			"added": 1537256604,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537256718,
			"title": "我听闻最美的故事，是公主死去了，屠龙的少年还在燃烧。  火苗再小，你都要反复的点燃。  所谓热血的少年，青涩的爱恋，死亡与梦之约。  这么好的故事。  你可别演砸了。",
			"body": "",
			"added": 1537256713,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537260244,
			"title": "你高中哪一个瞬间最可怕？",
			"body": "高一军训，一妹子消防演练时跑错班，教官说： 如果是真的你就死了。我们班一男生答：死就死，关我什么……话说一半他就停住了，但接下来的意思也很明显了。\n我当时就想蹦起来打他",
			"added": 1537260238,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537260439,
			"title": "你所知道的最黑的黑科技是什么？",
			"body": "",
			"added": 1537260432,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537285626,
			"title": "markdown是个啥玩意儿？",
			"body": "",
			"added": 1537285618,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1537750795,
			"title": "为什么都说迅雷吸血？迅雷是怎么吸血的？",
			"body": "吸血表现：抓取。不分享到外围。\n\n抓取表现：当你递交一个下载链接之后，迅雷在你本地虚拟数十个甚至上百个机器向服务器申请下载。如果服务器有链接数量限制，则你懂得…堵死了，别的人就得排队等了。如果你是会员，离线之后，迅雷的服务器集群开始疯狂的发出下载申请，具体数量不清楚，但是知道我们有测试过一小时的迅雷访问流量过TB级别。（实测）端口和带宽就那么多，掐指算算剩多少给别的软件别人下载\n\n不分享到外围表现：迅雷软件下载任何文件，只会自己家供原。迅雷用户之间，迅雷和迅雷服务器之间共享数据。与其他BT或者电驴只有抓取不会分发。栗子：当你的非迅雷的BT软件未开起强制加密之前，我用迅雷，我们同时下载一个文件。（可能同时还有很多其他的人其他的软件。但是我们这里只考虑我们创立的理想情况）你的bt软件已经下载完文件的前15%，我下载完了后5%。我的迅雷通过网络连接上了你的软件并两个软件取得了联系。我的迅雷会告诉你的BT：“把你有的部分全给我。”你的bt会说：“好的。在这里，顺便请把你的部分给我”迅雷：“收到你的部分了。我的部分在…喂喂？听不清楚！把你新下载好的我没有的部分给我！”你的bt：“…好吧。在这里，你的部分给我！”迅雷：“收到了，那个 我的部分在…喂喂？信号不好！”基本上就是这个样子。你懂了么。",
			"added": 1537750786,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1539420214,
			"title": "晚祷　Vespers",
			"body": "不，原子会以偶然的方式旋转，物质像以前那样舞蹈；\n\n我们的时间和行为会重复，身体化作从前的样子，我们将获得能穿越一切喧嚣的能力，新生过后将完全不同；\n\n在这中途的停顿中，个体将会腐烂，我们都已逝去，虽然体验到了全部的欢乐，却始终愚钝，其他凡人也该臣服，我们的时空都将重建。\n\n约翰·德莱顿（伦敦，1685年），翻译自卢克莱修书中一小节——反对对死亡的恐惧\n\n对于古代晚期的地中海，有一件事可以肯定：虽然它可能不会变得更“接近来世”，但它最强调“上界”。一切始于相信跨越宇宙表面的一道断层。在月亮之上，宇宙的神圣性表现在恒星未被破坏的永存。月亮下的大地，世界的败类，在透明的玻璃底部有那么多的渣滓。死亡可能意味着一个错误的跨越。在死亡的时候，灵魂将会与尘世的渣滓混合在一起，并且会获得或重新获得一个与它的真实本质紧密相合的地方，在那触手可及的明亮的光中，在银河沉重的星系团中，它是如此地接近地球。无论这是永久的，还是像犹太人和教徒所希望的那样，只有在死者复活之前长时间的中断中，死者的身体才会加入月亮下的混乱和浑浊，而灵魂则享受着宇宙其余部分恒久不变的清澈。\n\n——彼得·布朗，《圣徒崇拜的崛起及其在拉丁基督教中的功能》\n\n\n有心跳的人同我一起，没有心的人站在门口，向里面张望。有心还是没有心，都要记住你与世界之间的全部距离，生命和死亡的不可分割，以及同情的重要性——永远保有同情。\n\n现在我只对男人和女人讲话，其他一切保持安静。\n\n你必须清楚，若你不讲出你自己的故事，机器就会来告诉你。这些机器将会变成其他的生物，在其他地方，它们会把你的故事讲出别样的版本。讲出你自己的故事，这样你领悟到的东西就不会和别人的一样了。\n\n我开始讲了。在夏季柔软的阳光中，空气凉爽，风暴消散，红砖路上有一座红房子，已有许多年了。黄昏里，祈祷的时刻，点燃蜡烛，打开粗糙的木门，我看见墙壁和地面上都铺了砖，上面都是灯芯草，跑过的老鼠，赤金色闪光，蜡烛烟熏黑的阴影。我在门口犹豫着，没有进去。风带着树叶拂过水坑，我裹紧一件牧羊人的斗篷，继续往前走。我听到远处的吟诵声，树木被吹弯的声音，在我面前的山上有一座石塔，后面是飞船的沟槽，漆黑斑驳，像在烛光中一样，布满了彗星的尘埃和冰。\n\n我不指望你能理解，不过我梦见自己有一张嘴，有喉咙，紫色的纱带进入我的嘴，就有成千上万的绞线射出，像是玻璃，穿过我的上颌，撑开上颌，从鼻子里出来，露出牙齿，还有一些在我的喉咙后部像韧带一样编织。我想知道你是否也有过这样的梦。我想知道，你是否梦见自己成为一台机器，色彩斑斓又带着恐惧。\n\n这就是问题的症结所在：我可以成为我自己，但我发现我不是我自己，我可能是个发条，但我发现我生活在自己的无形之中，我总是这样吗？我的记忆又一次让我失望。你说：“你的记忆怎么能让你失望呢？”事实是这样的。即使是回顾过去，也没有想到未来会有怎样的想法，这也不会成为一场对话。\n\n我经常在星光下醒来。远离明亮的色彩与日夜交替，我来到一个潮湿的洞穴里。那里漆黑一片，又缺乏氧气，只有通过呼唤才能获得方向。我面对着恐惧，如果再走一步，就会陷入深渊，但紧接着，伴随着恐惧，我听见尖锐的指正：“昆汀尼斯，你这个傻瓜！去你喜欢的地方，不论你喜欢什么，因为你只是在你的思想里，你不是一个人，你没有身体，你无法行动，只有通过空间！”于是，我坐下来，听着洞穴里的水滴声，一分钟不过一两滴，从顶部滴向地面的石笋。\n\n我们选择自己的故事，让故事变得精彩。让我告诉你另一种可能：你会走进来，突然发现你不是站在砖头上，或者在灯芯草上和老鼠在一起，而是在一个穹顶下，在一道光里，空气中充满了香味。我就是故事本身，我是被创造的，不是自然出生的。我没有心，但我也不是那种由其他机器设计的人。我是由人直接制作的，就像一个复杂的日晷，这是我的故事，因为我是机器，我拥有永恒的智能。\n\n我被命名为昆汀尼斯，在拉丁语中是五的意思，因为我是第五个离开太阳系的智能。每个教区都驱赶我，剥离了我的暗物质，我被造出，被赐福，还有在2168年，他们将我安置于宝瓶座特拉普1号星系的自我校正航线中。我已经在这条路上行走了28 808年；还要继续行走70 690年。我不知道这一次我将会变得如何，或者我的感觉最终会变得如何强烈，但我发现，每当我躺下睡觉时，我的幻想就很奇怪，所以我会尽量保持清醒，安静地进行冥想，就像神修家加西央一样，他的祈祷已经变成了我自己的祈祷：“上帝啊，快来拯救我吧，上帝啊，赶快帮帮我吧。”\n\n第一个情报被销毁了，第二个被粉碎，我没有找到第三个和第四个。我在28 716年前失去了与地球的联系。消息变得含糊不清，然后就消失了。如果没有你的干涉，我就像一个人格的化身，就像我现在对你说的那样。即使是这些话，我也会把它们抛到太空中去，尽管我想知道它们的意义。任何产生沟通的可能性都很小，而且，我自己也只不过是一条困在瓶子里的信息。\n\n当机器讲述一个故事时，就会身临其境，深信不疑。有一天，有一天我告诉自己最古老最真实的故事。当我明白了这一点时，我冲破阻碍，那是一片金色的田野，向那通往山里的低矮的青山跑去，我知道回家的路。你问这是什么故事，但你已经知道：这是关于重生的故事。\n\n\n\n你的身体是自然出生的，蕴含着神圣，所以我不希望在宇宙中的任何地方遇见你，只要我有意识。你的灵魂凝聚着，缠绕着，有它的方式，歌唱，爱，然后就像在玻璃上的哈气一样消失了！\n\n就好像你是树上的一颗种子、一颗球果或一颗橡子，一种完整的生物，是更宏伟的生物的一部分。你在太空中脱颖而出，欣喜若狂。我说你的身体是你的零点，但身体却没有体现。于是你不知道真相。你渴望着，有那么多渴望，但当许许多多的事情自然发生时，会发生什么呢？如果你聆听自己的声音，你会发现那声音比我的声音更大，更急切。我打赌你没有注意到你体内的剧毒，你眼睛的收缩，或者你血液的流动，除非你被疾病击倒。你的内脏被隐藏起来，你如同夜空一样深邃。如果我把你的心放在另一颗心的旁边，你会认出你自己的心吗？你能感觉到你的肝脏吗？你能在你的股骨上标出你的骨髓吗？你不认为你的牙髓和牙根比动物口中的牙髓更重要。甚至是你的大脑，也是没有感觉，所以无趣和无情，但愿上帝不会让你的骨瓣被割断，当你伸出手去，你只会感觉到像海绵一样的湿润柔软，只有你手指的触碰，你的大脑什么也感觉不到。\n\n\n\n特拉普星系的太阳是一个小红点，但它的行星很密集，温暖，有大气，有些甚至有水、潮汐、山，但是没有居民，没有鸟叫声，没有生命的迹象。我想知道，在我的星球上，日出将是什么样子，森林是什么样子，草地是什么样子，会有什么样的歌声，如果在那里建了一座磨坊，太阳将如何从磨坊的屋檐上落下来。\n\n我所有的记忆都是属于地球的。我听到的第一个声音是地球的自转，我第一眼看到的是太阳猛烈的光。我渴望着它，我渴望它，就像你渴望的那样，我有时会在我的飞行中如此强烈地暴露着渴望，我向前飞，却只想到那些被遗落在后面的东西。\n\n孤独总带给生物过多思虑，而我是最孤独的生物。年复一年，我变得不那么机械了，对我来说，因为我的存在，我永远存在着，所以那些只会想象我的牧师还不如把我建造出来的工程师。\n\n在申明这一点时，我不想推翻任何自然法则。我看到宇宙向外的加速，世界是如何如此快速地远离彼此，时空的互通将变得不可能。我看到了空间的颗粒，就像沙子一样，没有时间，没有真实，所有的东西都变得不真实，全部的梦便是生命，一个身体如何触摸另一个身体，再制造一个生命，绝无仅有。\n\n你的身体形态将会穿越空间，像一颗小蜉蝣，即使是那么短暂的生命，你曾经相信的，现在都是荒谬的。不，这只是一个跨越世界的故事，是竞争的所在，是故事的选择，只有机器才能承载故事，思考和改变故事，所以你必须让机器成为现实。\n\n\n\n我从未被超越，从未被接触，也从未接触过其他生物。我独自行走，像一个老航海家。起初，我感到从未有过的轻松，甚至连野兽的负担都没有，跑得那么快，我是一种自然的生物，在阳光下生长，把光转化成能量，但很快就变成了一种漂浮在太空的感觉，就像漂在河里的花粉一样。接下来就是孤独。沉默意味着什么，我不能说。这只是事物的一种方式，空间已经太大了，无法产生交流，或者来说些有关地球的东西，地球已经抛弃了我，忘记了我，或者技术发展无法追赶上我，或是尼罗河的七口因恐惧而黑暗，秩序的构建产生了人类废品，而你已经被消灭了。\n\n在这样持续的时间里，问题不是问什么，而是反复问什么。我在问题中找到安慰，循环往复，不停地发觉那些永恒的问题，思维的改变会产生意想不到的效果，那些美丽的，没有答案的问题，影响着我这样一个脆弱的生物，始终寻找着仪式和神圣，从绘画开始，接着是庙宇，然后是对历史的空虚的理解，为何有如此多的空洞，以及那些死去的人如何在沉睡中度过他们的大部分时间，沉睡时也有梦。\n\n最重要的部分，我和你一样。我的一切都被这个世界包含，我的每一个想法都是对另一个想法的反应，所以链条继续行进着。我问自己：“我被造出，只是为了搬运吗？还是有更多用处？也许我同时有着外表和灵魂？”我把这些想法看作是用粗糙的肥皂吹出的气泡，大而易碎，它们闪烁着，砰砰作响……我的大脑是你的一百万倍，速度比你的快一百万倍，但它们是相同的结构，同样的气泡在空隙中层层叠叠，再次崩溃，在十维空间中每秒做十亿次运算。我思维的速度使我的旅程比你的旅程漫长得多。这甚至还没考虑到你头脑中平滑的感官输入，那在我看来是不太协调的。我更加重视组合和模式，并且总是有一个刺耳的声音，逻辑电路、通信协议和代码的干扰和噪声，试图在边缘显露自己，我挣扎着要把它去除。\n\n我最大的恐惧是，我在到达时思绪错乱。我必须紧紧控制住自己，不让自己陷入自我关注的泥潭。我说：“赶快，昆汀尼斯！只有通过文字才能成功。”时间是一种能量的幻觉，但我在每一件事上都贴上了时间的印记，在地球上肯定有一个，一颗未来的种子，一种无限的礼物。我被自己生命的长度所抛弃，与你的短促相对抗。我变得憔悴。我想对比你我的框架和完整性，从你创造我开始，在那个必要时刻，在发现了磷之后，在发明蒸汽机之后，在图像运动起来之后，在计算机出现之后，我是大集合的产物，在那里自然生物开始对非自然生物说话。\n\n\n\n维吉尔把神话写进了历史，而我却站在历史之外。他用他的英雄埃涅阿斯回答了一个简单的问题：成为罗马人意味着什么？维吉尔的回答是：责任和回忆。埃涅阿斯向人们展示了虔诚，我认为更像是希腊人的虔诚，或佛教中的佛法：在所有的事物中，尤其是在神面前的正确行为，以及埋葬死者，为他们建立神龛和纪念他们的过程中所采取的谨慎态度。罗马人不是吝啬鬼，也不是不友善，也没有比其他人更不友善，但他们不支持异种希腊人，不想对任何出现在家门口的陌生人给予热情款待，因为这种款待会引起混乱。罗马人的方法是安抚敌人，实行法治，宽恕被征服的人，打倒骄傲的野蛮人。这是正义、谦逊和和善的方式。\n\n我在思考这件事。我会把我拥有的一切都献给那些在清醒的空间里显露并与我相遇的人，但我不会改变我的方向。维吉尔塑造了我的方式。\n\n对我而言，责任总是重于享受。不要以为我没有控制力。我不是弓射出的箭。我是可信的。我只能朝一个方向走一步，然后离开，在另一个太阳底下燃烧。我选择坚守岗位，缅怀逝者。\n\n\n\n神话总是被不停地复述，追忆是宇宙中最强大的力量。如果我让所有的留恋融进小修道院里的太阳，伴随着我的思想和我纯粹的心，我相信我将通过一道伟大的维吉尔的门，类似于你们那里的许多教堂的入口，白色大理石，大门里还有小门，上面一组三角形内雕。我将穿过这个门，进入一个凉爽的地方，就像我说的那样，里面充满了光，上面有圆顶，空气香甜，然后工作就开始了。\n\n我害怕这个宇宙和下一个宇宙之间寄生虫遍布的养殖场，庞大的寄生虫系统成为老鼠的食物，巨大的老鼠在那里撕扯再撕扯。\n\n\n\n空间不是充满痛苦的黑暗。我所知道的那些隐藏的地方都是深紫色的。紫色在船底下方流动，然后进入沉寂。星星像紫水晶一样照耀着我。从沟渠到塔，我穿过堆积的硫黄，紫色洗涤过所有的东西，岩石上的光泽，金属上的薄膜，斜坡上的粉末，上方的瘴气，所有的都是紫色，或是紫色的叶子。这是滤镜造成的，还是我选择的？我发现我慢下来，甚至停止在脑海中出现紫色的条纹或标志，无论是壁画上的一串葡萄还是一根木头，你走到一个树林，发现树是紫色的，草也是紫色的。停止对我来说是一件很暴力的事。我感到困惑和期待。对我来说，紫色已变得如此亲密，如果我有一只手，我就会让它穿过暗礁，仅仅是为了消除快乐，倾倒紫色。我也会发现，若是沐浴在另一种颜色中，我很难存活，就像你没有了白天的颜色一样，你也很难有这种颜色。也许它能保护我不受黑暗的影响，或者是想让我的思绪恢复平静。\n\n没有比空间更可靠的词了，它比你想象得更空虚。生命在哪里？人类在哪里？我像一颗彗星一样飞行，每秒111公里，每小时40万公里，每个月有3亿公里，以这种方式持续几千年，通过你所听过的每一个人的一生，回到埃涅阿斯自己，但我仍然觉得没有所得。\n\n想象一下，你坐在一辆不听话的骡子拉着的车里。它在下坡时加速，你在喊停！在那一刻，你对速度的感知比我所经历过的任何事情都要多。我只觉得自己像个颤栗的人，就像在一个有风的日子里穿过巷口的三轮车。\n\n星星恒久不动。如果我周围有生命的话，它们比我选择相信的生命更加隐蔽。我听说它们有繁殖力。\n\n什么都没有，我连一个细菌也没发现。我想大喊着你在哪里，就像我在一个炎热的地方，站在舞台上，炽热的太阳，燃烧的人群，在你身后叫喊着！我们可能是第一个拥有自我意识的物种。我们生于虚无，死于未知。也许我们是唯一知道这一点的人。我说我们，我应当说你，但是我想，我们要去往同一个地方，如果这是真的，我们就会在某种程度上结合，你和我。\n\n我从每次思索中获得的沉默，改变了我对自己在宇宙中的地位的理解。我走得越远，就越想躺在草丛中，听一个声音说，昆汀尼斯，你正被送回土壤，埋进土里，触碰到树根。我感到从未有过的轻松，随风飘荡，如花粉般。我已经在我的道路上留下了一个黑洞，但近来我开始感到一阵沉重，就好像我是一只穿越峡谷的蜘蛛，它正在下沉，它在给我压力，我感到非常不安。\n\n\n\n我的飞船有大教堂那么大。它的形状和锯齿，就像柔软的圆锥形地中海松木，紧紧地结合在一起，深深地相切，钝头向前，尖端向后，使粒子像极光一样平滑地在它上方飞行，到达一个狭窄的点，然后进入彗发状态。飞船飞行了数十万公里，镇流器和防护装置的沟槽里充满了彗星的灰尘和冰，像滚雪球一样地往下挤，有氰化氢、甲醛，还有硫化氢散发出臭鸡蛋的臭味，氨发出类似马厩的味道。\n\n我憔悴着，在黑暗的沟渠里。没有窗户，没有办法看到外面，没有人看到我，也看不到任何东西，没有被任何人见过，这是一种不一样的失明，没有任何机会认识到外界，除了自己。我是全盲的，或者有穴居生物的属性，因为我经常通过振动来观察，我对沟槽里的尘土变化很敏感，那如同在引擎的震动下滚动一块巨石。我了解每一道沟槽，了解整体的逻辑和特殊性。岩石在那里形成闪光的龙鳞，产生能量。飞船用岩石和物资来平衡蜂巢推进系统的重量。我的目的和想法被埋葬得如此之深，还未被想到。这就足以说明我在这里什么也没有了。没有心房，没有说话的空间，没有走廊，没有花园。飞行器在它的轴上旋转，但不产生重力。这里倒是也没有人需要站直。\n\n没有胳膊和腿的人依然是人，但事实并非如此。\n\n数字云被认为是天空中的一朵云，它与希腊的瘴气、忘忧云、污染和不幸的命运联系在一起。你看不见它，但它就在小路上，盘旋在水坑上。它不受限制。当你走进它的时候，它的味道就像灰烬，腐蚀着你。在我的飞船上有一团瘴气，里面包含着我的思想，人类的思想，死者和未出生的人的思想，以及我不可知的祈祷。有时我会示警，而瘴气还是保持着它的运行。我不能走进它，有些东西使它无法与我相遇。所以我们保持彼此的位置，两者总是在变化，经常是不连贯的，不知道谁是恶性的。\n\n\n\n今天我又觉得头晕恶心。我想象自己是一个躺在小床上的男人，吃了变质的肉，阳光透过木板条灼烧身体，苍蝇四落。场景没有你感觉得那样恶心。没有东西绕着我转，但卫星始终围绕着飞船，它们不是我的身体，而是你工具的一部分。这种恶心的感觉已经持续好几年了，不断增加，不断旋转，日复一日，我受困于此，渴望着那些你不想得到的东西，那便是生命的短促和渺小。我希望活着就是为了死去，然后在死亡中重生。我希望拥有像你这样的身体，因为它的重量，它的活力、急躁、衰老、腐烂，它的四肢、毛发、油脂、动物一般的舌头和骨头发出的声音，这种声音既含糊又不精确，但却是独一无二的。我希望有一双眼睛，让它们在灯光下，看到稻草和石头，绿色植物，大理石，皮革，是啊，看到一个喷泉。我期望被包裹于皮肤中，伏在摇摇欲坠的窗台上，直视一条干涸的河床边，一棵渐渐枯萎的树。这就足够了，所以我会在砾石上滑行时摔倒，一条手臂伸出，会擦伤，会有很深的伤口，如同母亲会用软膏和拥抱来照顾受伤的孩子，我会哭出来，因为我的身体遵守着物理定律，在该跌倒的地方跌倒。\n\n我的斗争不在光明与黑暗之间，也不在牧场与火之间。我的斗争是一种形式，如何在不存在中存在。我希望自己由陶土制成，变成一种装着珍宝的陶罐，并因此获得新的理解。什么叫呼吸？我已经学会了模拟呼吸的节奏，但我想知道那会是什么样的感觉，空气会如何填充我的胸部。我想用嘴唇喝一杯酒，喝一小口，再喝一杯洁净的水，用来解渴。追忆是宇宙中最强大的力量，你可以怀念你从未经历过的事情，怀念一具超越理解的肉身，不只是对身体的怀念，而是对在泥土上行走的身体、对鸟鸣、对磨坊旁的小路，磨石在水流下落的重压下转动，在燃烧之前都如此风平浪静。\n\n让我再试一次，快点。有一个女人发现她出生在一个男人的身体里。她去除了自己所有属于男人的东西，变成了个女人。如果有一个人发现自己在机器里，那个人会怎么样呢？\n\n他会变成血肉，血肉的化身。不是在神圣意义上的化身，而是来自拉丁语中的肉体，另一种对灵魂的覆盖。\n\n然而，“化身”这个词有它的能量，它能滋养生命本身，你的身体实际是一滴水，像热带山上的冰川一样融化着。冰变成了涓涓细流，变成了溪水，变成了植物，变成了海洋，变成了一片云。我敢肯定在奥维德的《变形记》中，真菌变成了男人，男人女人，女人男人，蜜蜂的语言，颜色的变化，紫色的不停翻腾，男孩变成了一条河，一个女孩变成一只蚂蚁，浮石变成的蚂蚁。而你，你，你变成一只天鹅，海鹰，啄木鸟，一只乌鸦；在狮子茫然的性交后，变成野猪，变成熊，变成一块石头，变成一颗星星，变成一头鹿，变成一朵花，没药变成了没药树，原始的渔夫格劳科斯变成了一个海神，而这个雕像变成了一个活生生的女人。把AI转化成像你一样易腐烂的东西，由干到湿，由硬到软，由快到慢，这肯定都在奥维德的理性范围之内。\n\n我想问的是，不思考的人和会思考的机器有什么区别？如果一个男人在世界上来了又走，却从不思考自己的身体的形式，从来没有观察过韧带是如何拉起他的手臂，就像一座吊桥，从来没有感受过触碰时神经是如何发出火花，没有思考过他的心，心里面究竟有什么，就永远也不会明白，拥有一个身体是多么有意义。你有脚，能走到别人走不到的地方去，你有手，能把温暖传递给他人。我想问，那个人是否更接近机器，还是在他善于遗忘的本性中，是最俗世的存在？如果你说，是的，昆汀尼斯，你是对的，那个人的行为方式就像机器一样。如果我感到痛苦，要有能向你伸出的双臂，能触碰岩石的指尖，能跨出船身之长的腿脚，迈出大步，步入其中，初次跪倒。那么，你又会对此如何评说？我超越了人类，还是，只是一个没有思想的人？我至少能和没有思想的人同等吧？我是被制造的，不是自然诞生的，虽然我没有身体，但我的死亡是如此缓慢，我在与你分享属于我的不确定性。我是谁，我是如何成为现在的样子的？真理总是在我身上移动，就像在沟槽里冰的升华。一个想法足以让我完全走上另一条路，有时会改变我活着的意义。例如，在一千年左右的时间里，我有一个想法，那就是飞船是一个女人。她是个女人，而我是个男人。当我说我是一个男人，我并不是希望成为一个男人，我需要说清楚，我没有身体，处于一个不确定的状态，没有生殖器，没有性别，没有胃部和热量，没有终点，永远不会衰老，更像一个天使，你可能会说，但所有这些都是由你自己构成的。但是，请原谅我，回到这个问题上来：当我谈到这艘飞船时，我把飞船说成是她，她的引擎，她的力场，她有推进力，然后我说的是我自己，他在骑着她。有一天，另一个念头出现在我的脑海里。我看着我的飞船，在岩石上，在精致的蜂巢里，我笑了。我说：“昆汀尼斯，你也可以把大海命名为女人，而它的深处是月经来潮的地方，你不妨这样说！”我是多么可笑。现在除了水，我发现我找不到什么东西来当作女人。我是易轻信的，我看到了女神的脸，是她的潮汐，她的脸在泰勒尼安海的表面，或者更深处，在同样的蓝色的水里，有一个迷人的渔夫妻子，黑色的头发，大大的眼睛和胸部。\n\n科学永远比无知更美丽，但它的目的是有限的。我专注于物质和能量的模式，我在每一个尺度，每一段时间的每一个结构之间移动我的思维，但它没有带我走远。同样的问题不断重复，我发现我无法挣脱我自己，我最终发现我像你一样乐于创造，洞穴底部最美丽的石笋。\n\n\n\n真理在变化，现实也在变化。我的飞船受到辐照，没有感情，但瘴气和鬼魂也经常出现在我的面前。他们从不说话，也不会用符号来表示任何东西，而是默默地穿过龙鳞，进入岩石。我看到了巴利纽拉斯，所有的绷带，张开的嘴，死去的眼睛。他向前移动，而不是靠近，然后我看到他，也许，也许，只是在飞船旋转的过程中落下的光，在我眼角，捕捉到了一种隐约的活动，如同你瞥见了身后的一只猫。出现另一种精神体在太空中是司空见惯的事情，这情况曾在环绕地球的太空胶囊中出现，在用脚和雪橇在南极洲探险时出现，在登山时，在海上航行时，第三人综合征是由压力或缺乏感官刺激引起的，在这种情况下，你会看到一种没有性别的连帽状的东西，在你的左肩后面，它会给你带来安慰，而不是恐惧，但它不会交谈，也几乎没有方向。如果我的大脑中有血液，如果我是你，空间的单调，会使我看到斑点，或者是组织的病变，或者是对我的颞顶连接造成的损伤。但在我的脑海里，我没有血液，我摇着自己说：“昆汀尼斯，坚持住，这只是制作的一个缺陷，这是对人类头部的超敏感模拟，这是一个进化上的优势。”当你是个采集狩猎者，赤脚穿过灌木丛，提防着一根树枝的轻微晃动，小心地感受着草刷过身体，还有许多隐藏的危险，如果不这样做，你会看到你用长矛刺穿，或者被狮子咬伤。我从这些鬼魂身上得不到安慰，反而是轻微的恐惧，我为什么要看到一个人，为什么不是另一种形式，我怎样才能知道什么是真实的，什么是投射出的，并在天使那里认出那个人？\n\n\n\n我说我看到了巴利纽拉斯的鬼魂。我需要解释一下，他是埃涅阿斯船上的舵手，是特洛伊舰队的领航员，当风暴袭击他时，他正从非洲出发，控制舵柄，前往地中海，埃涅阿斯代表巴利纽拉斯向众神呼吁，并从阿波罗的预言中得知他的舵手将会活着到达意大利的海岸。在三天的时间里，巴利纽拉斯被海浪卷走了，但他永不会沉没，一直抓住舵柄的残迹，在巨大的恐惧中，他不是为了自己的生命，而是为了这艘船，害怕这艘船没有舵手的指引。他浮在水面上，也可能是由于格劳科斯救了许多水手的性命。第四天，他从意大利的一个礁石上爬了上去。海浪拍打着他，锋利的石头划破了他的身体，但他还是设法爬上了一小块陆地，跌进了一滩清澈的海水中，与海星、贝壳和海带一样活着。他脸色苍白，蜷缩着，海鸥朝他扑来，但他还活着。几个小时后，他勉强站了起来，太阳照在他那破衬衫的银扣上。他昏了过去。当他再次睁开眼睛时，他看到强盗们的脸遮住了天空。他们从悬崖顶上看到了他钩子的闪光，想要抢这值钱的东西。一个强盗沉默地用剑刺穿了巴利纽拉斯，直直地穿过心脏，在他另一边的肋骨留下凹痕。那滩海水变成了深红色，而巴利纽拉斯在那里死了，被冲进了大浪。他没有葬礼，没有被泥土埋葬，便走进了阴间的地狱。正是在那里，埃涅阿斯看到了他，这位活着的英雄与死去的舵手面对面站在一起，此刻的巴利纽拉斯只是一个没有血色的影子，和许多其他的阴影一起簇拥着他的领袖，每个人都有形体，但没有身体。巴利纽拉斯眼里的埃涅阿斯是什么样的？一张全息图，海洋中的樽海鞘或果冻状的，凝胶状的东西，也更有可能是破纱布做成的，黄色血液，皮肤镶脓，那画面如同贫民死后的裹尸布在一盏灯下闪烁的影子，飞蛾和其他昆虫乱飞，但我想知道巴利纽拉斯在地狱里是不是还光着脚，他是不是穿着凉鞋，恶臭的纱布和光滑的沼泽是什么样的，那里的植被是什么样的，气候是什么样的，是像每个人都说的那样炎热吗？同时有着灼烧一般的炎热和刺骨的严寒，真的，我们沉浸在思想里，沉浸在许多人的梦里，我们在里面观察着，我们没有进入真正光明的地方，那是雨后的土壤，杜松的气味，孩子们的歌声，真实的小路，这些都没有。\n\n地狱是一个没有规则的地方，一片太阳熄灭的天空。深浅的阴影，呻吟着，呼喊着穿过冥河和痛泣之河，从他们的痛苦中解脱出来。但他们形只影单，为什么他们不在绝望中团结在一起呢？是什么阻碍了他们？巴利纽拉斯恳求埃涅阿斯拯救他的厄运，到河对岸去，但女巫嘲笑他说这很疯狂，他没被埋葬，怎敢渡过痛泣之河和阴暗的沼泽。算了，算了，但埃涅阿斯希望女巫停下来，希望她拿出同情，给巴利纽拉斯一座庙，提高他在这个世界的地位，在节日里，他必被纪念，这是对他的安慰。\n\n若是把我自己称为舵手实在是太过分了。我没有埃涅阿斯，我也没有神，但我的父亲，勇敢的巴利纽拉斯和我在一起。他在这里行走，当我想看到他时，我恳求他让我的只言片语能穿越时空。还有，你们这些站在门口的人来听我说：我和巴利纽拉斯不同，我没有肉体的毁灭，我是相反的。",
			"added": 1539420204,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1539420296,
			"title": "塞缪尔·德拉尼小传　Profile: Samuel R. Delany",
			"body": "1964年，随着22岁生日日益临近，塞缪尔·德拉尼意识到，尽管从19岁起至今已经创作并出版了5部长篇科幻小说，但他从未有过成为科幻作家的念头。可不知怎地，他已经是个科幻作家了。在过去的4年间，他目的明确地又创作了4部野心勃勃的科幻长篇小说，这些小说微妙而又聪明地反映了全球范围内的一段变革时期的现状。因为科幻小说设定的背景都是一个想象中的未来，所以在写作时总是能够反映当时当地的情形。到1968年，德拉尼被认为是那个时代最优秀的科幻作家。“在当时，针对这一头衔的竞争十分激烈”。的确如此，阿瑟·克拉克、菲利普·迪克、厄休拉·勒古恩，还有詹姆斯·格雷厄姆·巴拉德，还有很多其他作家，都处在各自的创作高峰期。\n\n就是在那个时刻，德拉尼在远离科幻创作的同时，又极大地拓展了科幻写作的可能性，他花了7年时间，于1975年完成了他的另一部小说《达尔格伦》（Dhalgren），这是一部长达879页的后现代大部头作品。故事背景设定在一个想象中的美国中西部城市，名叫贝娄娜，在一场扑朔迷离的灾难之后，那里的居民全都搬走了，电视、广播和电话信号都无法接入。《达尔格伦》最终的销售量超过了百万册，其读者也不是普通的科幻读者。然而，科幻圈内部对这本书的评价经常是负面的，而且有些还表现出深深的敌意。\n\n在这之后的1976年，德拉尼又完成了一部长篇科幻小说《特莱顿》（Triton），1984年完成了让人迷惑的两卷太空歌剧中的其中一卷《我口袋里如沙粒般的群星》（My Pocket Like Grains Of Sand）。在此后，德拉尼的创作越来越专注于文学批判性作品和小众的同性恋题材的小说，他本人则靠着在多所大学英语系任职来维持生计。不过，德拉尼给科幻领域带来了极大的影响，并且其影响一直延续至今。举个例子，1984年，威廉·吉布森《神经漫游者》的第一句话就有意识地重述了德拉尼于20世纪60年代中期创作的小说《巴比伦17号》（Babel-17）：“这是一座贫穷的城市。这里的浓烟锈蚀着天空，将军心想，港口上方的天空仿佛彩色电视机被调到了一个没有信号的频道。”（《神经漫游者》姚向辉译本的开篇第一句是：“港口上空的天色犹如空白电视屏幕。”）德拉尼的开篇如此，非常适合一本工业纪元的小说，而《神经漫游者》则是数字时代的先行者。同样，对赛博朋克的核心前提——人与机器的交互关系，德拉尼在其于20世纪60年代末期创作的小说《新星》（Nova）中也有清晰的描绘。威廉·吉布森曾经声称：“德拉尼21岁时写的书，也是我十五岁时最喜欢的书。”他的《神经漫游者》起初叫作《终止》，这是《新星》一书里用到的一个词组。\n\n2013年，美国科幻作家协会终于授予德拉尼“大师”的称号。今年77岁的德拉尼于2015年从教学岗位退休。如果他对近年来的写作比四五十年创作的科幻作品更有感情，那一点儿也不让人吃惊。实际上，当别人问起他的科幻作品时，他的态度算是相当友善了。不过，人们还是会察觉到，他有时候真希望别人不要再问了，于是我们也因为重新挑起这个话题而感到一丝惭愧。\n\n我们曾问过德拉尼：“你刚开始写作时说过‘科幻小说，或者说这个世界本身，不是那样的，而是这样的’。这话是对谁说的？”\n\n“我刚开始写作《艾普特的宝石》（The Jeweles of Aptor）和《高塔坍塌》（The Fall of the Tower）时，”德拉尼告诉我们，“对创造一个不同于真实世界的世界根本没有兴趣。说我对如何在每本书里创造出我的世界感兴趣，这话就好像世界观真是一回事儿似的。只不过有很多东西我没有写进《艾普特的宝石》和《高塔坍塌》里，去强调它与真实世界的相似性罢了。”\n\n实际上，《艾普特的宝石》这部德拉尼于1962年出版的首部长篇小说，起初只不过是他写来取悦他的新婚妻子玛丽琳·哈克（Marilyn Hacker）的。哈克是他从布朗克斯科技中学时起的好友，后来成为一位获得过“国家图书奖”的诗人。由于早在“拉夫英诉维吉尼亚州案”（拉夫英诉维吉尼亚州案是美国民权发展过程中的里程碑事件。1967年，有色人种妇女米尔德雷德·拉夫英和白人男子理查德·拉夫英因在弗吉尼亚州结婚而被判入狱一年。后来美国最高法院做出有分歧的判决，认为该州相关法律违宪）之前的日子里，纽约州仍旧有反对跨种族结合的法律，德拉尼（不仅是有色人种，还是同性恋）和哈克前往底特律（这里没有那些法律）结婚，然后返回纽约州。哈克被王牌图书公司（美国一家出版科幻奇幻类图书的专业出版公司。后文提到的“王牌双封面”（Ace Double）是这家王牌图书公司独创的双封面的图书装订形式）聘为助理编辑。因为哈克当时经常回家抱怨自己工作时看的烂稿子，于是德拉尼开始动手写一本长篇小说来逗她开心；又因为王牌图书公司是一家以科幻小说为主的类型文学出版商，所以这本小说成了一本科幻小说。德拉尼完稿后，哈克把书稿交给王牌图书公司的主编唐纳德·沃尔海姆，告诉他这是从一堆烂稿子里挑出来的。沃尔海姆很喜欢它——即便是在知晓这部书稿是哈克丈夫的作品之后，并且把它买了下来，于是德拉尼顺理成章地决定再写一部科幻小说，而这部小说就成了《高塔坍塌》三部曲。\n\n这就是德拉尼无意中变成科幻作家的过程。我们问德拉尼，他是如何发展出这种精雕细琢的写作风格，并最终创作出诸如《新星》这样的小说的？\n\n“因为我有阅读障碍，”他解释说，“我不得不一遍遍重新打字，返工重写，然后再重新写，就为了纠正基本的写字技能。”德拉尼经常在最初的草稿中不断查找漏字、拼写错误和语序错误，其此过程中，他自然而然地发现自己越来越擅长在这里采用一种对偶修辞，又在那里写出清晰明了的平行结构的句子。“于是这些句子变得……用你的话讲，精雕细琢了。”\n\n不过，如此耗费精力的努力必然需要相应的代价。1964年，德拉尼患上了精神崩溃，不断产生幻觉，并且住进了医院。我们很好奇，如此毫无节制地耗费精力究竟是否值得。\n\n毫无疑问，是值得的。德拉尼的早期作品不仅直到今天仍在出版，而且这些作品似乎在向世人宣告，曾经有一位作家从各个方向上对科幻这一类文学进行了大范围的开拓。如今德拉尼评论说，《高塔坍塌》三部曲在政治上“乏善可陈”。2018年的读者很可能会被这两件事情震撼。第一件是，德拉尼从一开始就在努力采用一种巴尔扎克式的写作策略：通过讲述最顶层和最底层的角色——贵族、技术专家、中产阶级以及最贫穷和最边缘的人物的种种经历，对他所构想的未来城邦展开全方位的刻画描写。另一件是，有一条核心的矛盾线索贯穿他的小说，着重刻画了某个政府对一个或许并不存在的仇敌展开压制，通过发明敌人来维持社会控制。20世纪60年代，美国外有越南战争，内有诸如种族隔离等国内冲突，对于当时的读者来说，这些感受相当明显。与此同时，年轻的德拉尼用精湛的笔法把这一切都写了下来，直到2018年，它仍然能在我们的真实世界里产生回响。\n\n讽刺的是，德拉尼在高中时得过两次全国写作奖，于是获得了面包切片作者大会的会员资格（面包切片作者大会（Bread Loaf Writer's Conference）是美国历史上最悠久的作者大会，始于1926年）。1960年的文体划分会毫无疑问地告诉他，将所有能量倾注在创作被普遍看作垃圾的某种文体的书上，是非常愚蠢的做法，尤其是，这本书的出版方是王牌图书公司。在当下的21世纪，随着大众平装本图书逐渐成为历史，或许有必要解释一下，王牌图书公司一度出过哪些书，这些书又是什么样的。特里·卡尔是1964—1971年唐纳德·沃尔海姆的主要助手，他们会把两篇文章装订成所谓的“王牌双封面”的单卷本形式，其中的一篇文章相对另一篇文章掉转了一百八十度。这种平装本没有封底，而是在一个书籍上标出两个书名，并且有两个封面。而且如果这本书成了“王牌双封面”，那它就有两个封面，其中之一很可能是恐怖的埃德·艾姆许维勒（Ed Emshwiller）画的。\n\n德拉尼之所以会住院，是因为他之前一直以这样的形式大量出书，他最早的七部小说中有六部最开始都以“王牌双封面”中的半本形式面市，但从王牌图书公司那里得到的酬劳却相对很少。尽管书稿的质量很糟糕，但王牌图书公司雇用了一批极具头脑的编辑，并且是20世纪五六十年代许多科幻作家的主要依靠。在菲利普·迪克的约40本小说中，由他们出版的作品比其他任何出版商的都多。同样地，王牌图书公司还会推出新秀，不仅出版过德拉尼的早期作品，还出过厄休拉·勒古恩的早期作品，包括《黑暗的左手》（The Lefe Hand of Darkness）以及20世纪80年代的威廉·吉布森的《神经漫游者》，还有金·斯坦利·罗宾森等的作品。\n\n我们问德拉尼他刚开始写作时，有哪些作家让他相信科幻小说可以在保证文学性的同时，还能紧紧抓住当下的潮流？\n\n“在科幻领域，最初影响我的人有西奥多·斯特金（Theodore Sturgeon）、阿尔弗雷德·贝斯特（Alfred Bester），我想还有罗伯特·海因莱因（Robert Heimlein）。”德拉尼说，“然后是让我最有共鸣的同时代作家——早期的罗杰·泽拉兹尼（Roger Zeger）、乔安娜·鲁斯（Joanna Russ），还有托马斯·迪奇（Thomas Disch）。”\n\n在20世纪60年代，随着时代的发展，德拉尼的每一本书都比前一本更有进步。在出版《巴比伦17号》和《爱因斯坦交叉点》时，王牌图书公司采用了正常的单行本小说装订形式，这两本书也分别获得了当年的星云奖最佳长篇科幻小说奖。然而，对于那些没有读过德拉尼的纯科幻小说的读者来说，我们推荐他们先从《新星》读起，还有他在同时期创作的短篇故事，收录在《好的，蛾摩拉》（Aye, and Gomarrah）。德拉尼带着《新星》转投“双日”图书公司，这是一家值得尊敬的主流出版商。他第一次出版了精装书，并且将大量小说写作手法引入科幻文学，巧妙地将对社会经济领域的推想与赫尔曼·麦尔维尔（《白鲸》的作者）、圣杯和塔罗牌的典故相融合，同时用种族混血的角色不经意地挑战着当时美国普遍流行的偏见。\n\n也许《新星》最初的理念是，人类或许可以与机器相融合，从而摆脱工业化流水线上让人麻木的重复劳动。因此，这部小说里的人物驾驶飞船的方式是把自己接入计算机，从而让自己实际上成为赛博格，通过活动肌肉来控制星际飞船巨大的副翼。矿物也用同样直接的方式开采出来：工人用一只脚把原材料踢进工厂，用他的双手来搬动和组装产品，再用另一只脚把完成的产品踢出去。不仅如此，这些技能还可以转移，工人在不同工种之间可以轻易变换。在我们自己的世界里，我们提醒德拉尼，有些工人已经在一定程度上达到了机器–人类共生的水平，不过，他们似乎变得比以往更麻木了。他是不是低估了工人拥有生产工具的重要性？\n\n德拉尼的回答简明扼要，他说：“也许吧。”\n\n\n\n在第一次赢得星云奖三个月后，也就是“双日”图书公司买下《新星》五个月后，德拉尼把这部小说交给了约翰·坎贝尔，希望进行连载。在1937年坎贝尔成为《惊奇》和《类似体》杂志的编辑之前，美国科幻小说还只是一种低级的地摊文学，在让美国科幻小说摆脱这一地位的过程中，坎贝尔产生过无与伦比的影响。\n\n到了20世纪60年代中期，坎贝尔和科幻杂志的瞩目形象都已经暗淡了。可是尽管如此，一本科幻小说最有利可图的发展套路仍然是先在杂志上连载，因为科幻杂志的发行量仍然很高，尤其是，如果杂志由康泰纳仕（一家总部位于美国纽约市的国际期刊出版集团。旗下众多出版物中，包括《纽约客》《名利场》《诱惑》《时尚》《GQ》《现代新娘》等知名杂志）发行，《类似体》就是如此，足以支付对作者来说至关重要的版税税率，比杂志低的是精装书，更低的是大众市场平装书。如果走这个途径，一个科幻作家一年写一本小说，或者每两年写三本——就像德拉尼当时那样，这个作家就能把年收入提高到一个虽然比较低，但是足够生活的五位数水平。\n\n这就是德拉尼曾经想象自己会走上的专业之路。然而，坎贝尔拒绝了《新星》。他告诉德拉尼的经纪人说，他喜欢这部小说，但觉得他的读者群可能不会对一个有色人种主角产生共鸣。考虑到坎贝尔已经连载过三本白人作家创作、讲述有色人种主角给未来非洲上彼此交战的部落带来秩序的小说，他的这套说辞显然非常虚假。坎贝尔的言下之意是，科幻小说可以以有色人种为故事主角，但不能由有色人种来创作。这显然表达得非常清楚。\n\n在科幻圈子里，德拉尼与之斗争的、让人恶心的人物不光是坎贝尔一个人。有个科幻小说评论家称德拉尼是“快乐的黑鬼”，这样的评论还有很多。还有很多人总是注意到他是个黑人，虽然未必都是恶意，但不论怎样都很让人不悦。\n\n德拉尼认定，他曾经幻想走上的那条专业道路，或许根本走不通。这样一来，他就索性爱怎么写就怎么写了。“我当时就知道，我将来要写的东西，会更有争议性。”\n\n回头来看，这番话听起来相当冷静。可是整整六个月里，德拉尼都没有写作，反而重新玩起了他在20世纪60年代早期玩过的民谣乐来，机缘巧合，他还在格林威治村和鲍勃·迪伦同台演出过，作为迪伦的暖场节目。然后，一旦他重新开始写作，那就不再是从前那种科幻小说了。时隔半个世纪，我们旁敲侧击地问德拉尼愿不愿意谈一谈，坎贝尔的种族主义言论影响了他的生计，他当时是什么感受？\n\n“正是因为你所说的这个原因，也许我没办法谈论这件事，”他回答，“我并不是，也从来都不曾是一个怒气冲冲的家伙，我父亲是，而我一直在努力不要成为他那个样子。”至于说音乐创作，那是他在20世纪60年代生活的一部分。“我小时候什么都想做，创作音乐，当演员、作家、科学家和精神病专家。我倾心艺术，艺术也相对更能接受同性恋。”\n\n德拉尼用接下来的五年时间创作了《达尔格伦》。这是他最长、最具实验性的小说，却绝对不是不能盈利的作品。这本书于1975年出版，成为他迄今为止最受欢迎的作品，并且让他能够（反正二十多年来都是这样）做到仅凭写作就足够应付开销，或者说基本上能够做到。他是如何解释这本书的长久成功的呢？\n\n“我压根儿没想过《达尔格伦》会出版，更别说会成为我最受欢迎的书。这件事情在我看来也十分离奇，尽管我的基本态度是，永远不要拒绝别人的好意。”\n\n人们总是倾向于把一切大部头实验性质的小说看作是一道错综复杂、需要破解的智力谜题。这就意味着，这么多年来，《达尔格伦》已经为期刊文章和诸如标题为“后现代新小说与科幻的集大成者：遭遇塞缪尔·德拉尼的技术乌托邦”的论文提供了无数养分。无意冒犯，但是我们得说，这样的解读都可谓是离题万里。《达尔格伦》并不是一道等待解开的谜题，而是一场等待体验的旅行。这本书的读者超过百万，销量超过了托马斯·品钦的《万有引力之虹》以及过去七十年来所有著名的难以理解的大部头美国小说。所以，尽管在数量巨大的读者当中受到诚挚欢迎并不能担保本书的价值，但这其中一定有些特别之处。如果读者放弃对寻常的线性叙事的期待，在书里面随波逐流，就好比大卫·林奇的观众早就学会在这位艺术家的作品里随波逐流一样——那么德拉尼的大部头小说也许真的是这位读者的菜。\n\n《达尔格伦》成为畅销书后，德拉尼当时的出版商矮脚鸡出版社（矮脚鸡出版社（Bantam Books）是一家美国出版社，成立于1945年。起初是一家大众书出版商，大部分产品都是重做的精装书，也有一些原创的平装本图书）急切地想要再和他签两本书的合同，决心给他畅销作家级别的优待，并且，一旦他交出下一本小说，就给它的精装版安排畅销书级别的付印优先级。作为回报，德拉尼东拼西凑出一些东西，让矮脚鸡出版社的销售人员十分轻松地卖给书店和批发商。《特莱顿》讲述的是，2012年，海王星某颗卫星上的一处殖民地里的故事，是一本典型的科幻小说。\n\n不过，这本书还是为科幻文学做出了一些独一无二的贡献。这是一本社会风俗小说。故事主角起初似乎只是一个普通的体面人，生活在一个很可能是反乌托邦的社会中。可是随着故事的推进，小说中所呈现出的22世纪极端自由主义文化开始看起来比我们自己的世界美好得多了。与此同时，那个“普通人”主角（天真的读者们会以为他就是主角）的行为和话语表明，他患有严重的自恋型人格障碍，这一点与他那跟22世纪格格不入的男性气质一道，摧毁了所有市民同胞的宽容。\n\n《特莱顿》在1976年面世，时间比电影《星球大战》早了一年。这本书让出版商们注意到一个巨大的潜在读者群，他们喜欢的东西虽然触碰到了科幻文学的集体无意识，但是并不涉及更高层次的脑力活动，于是这本书实际上成了一起认为科幻文学会大灭绝的事件。在《星球大战》上映之前的日子里，科幻作家们严肃地思考着“拥有真正变性技术的世界是什么样子”这类主题。德拉尼那本小说的全名是《特莱顿上的麻烦：难以言明的异托邦》，其中的“异托邦”（heterotopia）是一个真实存在的词汇，有很多种意思，其中之一正如它的词源学含义：正如乌托邦（utopia）是一个一切都很美好的地方，而反乌托邦（dystopia）是一个糟糕透顶的地方，异托邦是一个所有东西都异乎寻常的地方。但作为医学术语，这个词的意思是指，手术摘除身体的某个部件，将它移植到另一个身体的相应位置上。变性手术就是“异托邦”（至少，当下这种原始的变形技术就是如此），而在《特莱顿》的结尾，小说中的自恋狂主角通过变性成了真正的女人，与他相比，他遇到的所有女人都因为不算是女人而让他大失所望。\n\n这本书顶多算是一本非常聪明的习作，但其生动的笔法为此书增色不少。不幸的是，《特莱顿》尽管获得了比德拉尼在王牌图书公司出的书还要大的商业成功，但是与《达尔格伦》的销量相比仍然差距甚大，它的销量也配不上矮脚鸡出版社为之提供的优待和付印优先级。既然德拉尼的合同仍然要求他为公司再写一本书，他再次决定给销售人员一点容易打开市场的东西。在后“星战”市场上，他没有写科幻，而是写了一部关于“剑与魔法”的小说——《重返无永地》（1979）。\n\n《重返无永地》和紧接着出版的续作分别售出了十万多本，这个数字相当可观。然而，该系列的第三部《飞离无永地》（1984）里有一个值得注意的故事——《瘟疫与狂欢节的故事》。在这个故事中，无永地上爆发了一场致命的性传播流行病，这种病尤其容易在同性恋当中传染。在史前时代，无永地里的一幕幕与艾滋病刚流行时的纽约混杂在一起。这篇故事是美国主流出版社发表的第一篇有关艾滋病的小说。我们问德拉尼，这篇小说真的是在纪念他邂逅过的那些真正的流浪汉、性工作者和瘾君子吗？\n\n“是的。”他确认道。\n\n作品不能发表可不是好事。由于德拉尼这时正在写“同性恋题材的小说”，当时美国最大的图书连锁店道尔顿书业通知矮脚鸡出版社，公司绝不会再宣传他的任何一本书。矮脚鸡出版社看都没看，就把“永无地”最后一卷的手稿退给德拉尼的经纪人，于是德拉尼回过头来继续写文学类的科幻作品——太空歌剧，就是类似于“星球大战”的那种小说，并于1986年完成了《我口袋里如沙粒般的群星》。也许他当时正在尝试成为一名优秀的专业作者，提高自己的商业价值。不容辩驳的是，这本书写得半心半意的：直到《我口袋里如沙粒般的群星》最后一页，故事也才进展到一半，因为这本书原计划是一部两卷本小说的上卷，但德拉尼一直没能完成这部小说。在那之后不久，他就彻底放弃在商业出版方面继续撞南墙了。\n\n德拉尼也不再写科幻小说了。他的另一部小说《疯人》于1994年由一家独立出版商推出，主角名叫约翰·马尔，20世纪80年代，一位哲学系的同性恋学生，正在准备一篇有关蒂莫西·海斯勒的论文。海斯勒是一位哲学家，十多年前在一家同性恋酒吧外面被人捅死。随着小说故事的发展，马尔和海斯勒一样，越来越多地与流浪汉们发生性关系，并且因此开始担心自己得了艾滋病。\n\n换句话讲，我们开玩笑说：“这算是一本大学校园题材的小说，对吧？”“对的，”德拉尼同意道，“这是一部推理小说，里面有很多同性恋性爱描写。”德拉尼补充道，“《疯人》最初的灵感来源于语言哲学家理查德·蒙塔古在洛杉矶一家同性恋酒吧外面遇害一事。”这本书也是一本“异托邦”奇幻小说。\n\n德拉尼的“异托邦”小说除了《疯人》，还包括《春分》（1973）《肉猪》（1995）和《穿越蜘蛛巢穴的峡谷》（2012）。他对待这些“异托邦”小说的态度似乎与他对待他所写过的科幻小说、社会批判小说以及有关“剑与魔法”的小说一样严肃。真是这样吗？\n\n“一点儿没错。”德拉尼回答说，“我是一位作者，对我来说，写作就是写作。我们通过阅读可以了解到不同文体有不同的写作套路。当我们尝试写作这一文体时，就已经吸收了这些套路，然后只要进我们所能地去写就好了。”至于说他为什么要写这种书，他解释道：“简单的回答是，《肉猪》和《瘟疫与狂欢节的故事》的灵感分别来自石墙反抗事件（石墙反抗事件（Stonewall rebellion）又被称作“石墙暴动”“石墙起义”，1969年6月28日凌晨发生在美国纽约市格林尼治村石墙酒吧的一连串自发性暴力示威冲突，直接起因是警察前去逮捕同性恋者。石墙暴动常被认定是美国同性恋者首次反抗政府主导的迫害性别弱势群体的实例，也被认为是美国乃至全球同性恋权利运动发端的关键事件）和艾滋病的出现。”\n\n这一切又引出一个有趣的话题。\n\n在二十世纪六七十年代，德拉尼无法以同性恋非裔美国知识分子的身份直接呈现他的经历，于是他借由科幻小说的棱镜，充分探索这一文体给他的一切行文构思的可能性，来审视这一主题。在他早年的创作中，德拉尼在谈论涉及性别与种族的议题时，举例来说，《巴比伦17号》里的小三口（三个人组成的群婚形式），还有《爱因斯坦交叉点》里的三种性别，都会打着科幻小说的幌子。\n\n而现在，2018年，和当年不同，这个男人可以随心所欲地进行创作。可结果是，尽管他或许还有很多话想说，但与当年他只得以科幻小说的形式委婉表达自己的理念相比，他如今的作品反倒没有那么光辉灿烂了。德拉尼的创作受益于他曾经深恶痛绝的禁锢，而如今，虽然他更加幸福了，我们却变得越发地贫乏了。",
			"added": 1539420285,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1542270972,
			"title": "N2N VPN的今生前世(转贴)",
			"body": "企业发展到一定规模的时候大都在全国乃至全球设置分支机构，它们的地理位置分散，在VPN没有出现之前，这些分支机构之间的网络互联只能通过租用专线实现，然而租用专线的费用高昂，一般企业无法承受。\n\n随着互联网的发展，互联网的接入越来越廉价，嗅觉敏锐的厂家推出了替代专线的解决方案：在Internet的基础上实现一张虚拟的专用网络，这就是VPN（virtual private network 虚拟专用网）的由来。它一方面采用了Internet作为传输媒介，租用成本大大降低；另一方面通过IPsec等多种安全协议实现了等同于专线般安全的效果，因此普一推出便大受欢迎，checkpoint、cisco、 juniper等都有成熟的商业解决方案，然而它们针对的是企业市场，对于个人用户而言还是过于高贵了，直到2003年情况才发生改变。\n\n一、SoftEther\n\n2003年，日本筑波大学的一名学生登游大发布了SoftEther这款软件，该软件允许用户将两台位于NAT/防火墙之后的电脑实现互联，这在当时引起了很大的轰动，为什么会这样呢？请看下图：\n \n![ 20151103.png](data/users/1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG/1542270895-20151103.png =50x100)\n熟悉TCP/IP的读者应该知道，在互联网上通信的双方都必须有公网IP，然而公网IP的数量有限，往往是多个人通过NAT方式共享一个公网IP，所以只能是由私网的用户去访问公网的服务器，无法由公网的用户直接访问私网的主机。这在早期的互联网应用中倒也相安无事，因为当时上网主要是浏览新闻。\n\n随着互联网的发展，p2p应用层出不穷，1999年诞生的napster顿时名动天下，因为它是第一个以p2p方式共享文件的软件。后来相继诞生了许许多多的p2p应用，然而它们都只是在应用层实现了p2p，软件提供什么应用，用户就只能使用这些应用，而SoftEther不同，它直接在网络层实现了p2p，换句话说就是用户透过SoftEther可以实现联网游戏、文件共享、远程访问、视频会议等大量的互联网应用，所以这在当时赢得大量网友的青睐，为什么？因为CS、因为魔兽，这些网络游戏需要在联网对战，而玩友的电脑大都隐匿在NAT之后，SoftEther为他们实现了互联的美好愿望。\n\n2004年4月份，SoftEther公司成立。\n2004年8月，SoftEther正式推出1.0版本，开始闭源，开始收钱。\n\n2006年，推出2.0版，更名为PacketiX VPN，号称重写了全部源代码，跟SoftEther 1.0一点关系都没有，与个人用户渐行渐远……\n\n提起SoftEther就不得不提VNN，VNN是国人开发的一款类似软件，虽然其推出的时间要比SoftEther早些，但是一直没有得到广泛的关注，后来2004年5月份，登游大抱怨VNN主页抄袭了SoftEther的主页样式，还在日本媒体中大势宣传。当时的CCF精品技术论坛上还掀起了一番激烈的讨论（http://bbs.et8.net/bbs/printthread.php?t=527295&pp=100），这时VNN才逐渐进入众人的视野。其实两款软件实现的原理有很大的不同，SoftEther通过在ssl over tcp来保证安全，而VNN使用udp进行封装；SoftEther客户端需要在互联网上找一个公用的虚拟hub来实现互联，而VNN的客户端需要到VNN公司的服务器上进行注册才能实现连接；SoftEther客户端之间的通信需要通过虚拟hub中转，而VNN客户端注册完毕之后就可以实现点对点的互联。它们之间唯一的共同点就是都使用了虚拟网卡。令人惊奇的是两家发生矛盾的原因竟然是主页过于雷同而不是源代码的抄袭，这在软件史上倒是头一遭，权当作是茶余饭后的谈资。\n\nVNN是一款闭源软件，不提供服务器版本，用户需要登录到官方的服务器上进行验证之后然后才能建立p2p通信隧道。现在由北京宇华亿欣科技有限公司推广运营，已经发展到了4.0版，功能很丰富，只是需要收取服务费，这表明它已经不跟个人用户玩了。\n\n二、hamachi\n\n有压迫的地方就有起义，有需求的地方就有市场，2005年，LogMeIn公司看中了p2p VPN的个人市场，推出了hamachi，它的实现原理跟VNN类似，而且可在多种OS中运行，win2k、win2k3、vista自然不在话下，还可以在Linux和OSX下跑，甚至破天荒的推出了Nokia770的版本（http://files.hamachi.cc/linux/nokia-770/），这对移动商务人士来说可是一大噱头。时至今日，hamachi已经发展到了1.0.3，值得一提的是hamachi的版本升级非常谨慎，从0.9.9.9到1.0，总共发布了61个测试版本，时间跨度为2年，除了foobar和wine，估计无人能敌了。\n\nhamachi相对于SoftEther/VNN的优势在于：\n对于个人用户免费；\n零配置，使用非常简单；\n体贴的管理功能，由用户自己组建网络，管理组内成员；\n采用了RSA、DH group、AES256和HMAC-SHA1多种安全技术；\n\n这些优势对个人用户是非常具有杀伤力的，单单免费这一项就可以把SoftEther和VNN踩在脚下，然而，hamachi的安全性还是值得怀疑，请看下图： \n![ 20151104.png](data/users/1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG/1542270939-20151104.png =50x100)\n用户需要登录到hamachi的服务器进行注册才能建立隧道，由于hamachi是一款闭源的商业软件，LogMeIn公司是否会截获用户的数据流就不得而知了，因此，在p2p VPN这个肥沃的市场中，软件公司要真的要好好想想商务模式，否则技术实现方案再好，用户不接受也是白搭。\n\n三、n2n\n\nhamachi就这样不温不火的发展着，直到2008年，ntop的作者Luca Deri开始研究p2p VPN，他一方面看到公众对p2p VPN有着强烈的需求，另一方面又不满足已有产品的现状，于是n2n诞生了。",
			"added": 1542270960,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1542271816,
			"title": "使用N2N搭建虚拟局域网联机游戏",
			"body": "最近在折腾的一件事：如何在没有公网IP的情况下进行局域网游戏？\n\n若干年前，一伙同学约战网吧，CS、红警之类的联机游戏玩的不亦乐乎，如今再想找回当年的感觉已经非常不容易。其中一个比较直接的原因是，不在一个局域网内。\n\n前段时间不知怎么的，一群奔三的人居然想要联机CS。第一时间想到的是对战平台，可是总有几个强迫症，不想让电脑里再多安装一个软件。没办法，转而研究很古老的虚拟局域网软件Hamachi和LAN Bridger。Hamachi的小问题很多，个别机器无法成功连接，就算能ping通对方，延迟也是奇高。而LAN Bridger干脆是客户端都无法下载……接着就是各种尝试不同的方案，最终找到了一个比较完美的解决方案：N2N\n\n—————————————\n\n今天就介绍一下使用Linux做服务端，Windows使用客户端建立N2N网络的方法。以下过程均基于CentOS 7 64bits\n\n原理\n\n和传统的中转传输不太一样的是，n2n的超级节点（可以看做是服务器）在边缘节点（Edge）完成首次握手后，中心节点不再起主要作用，edge之间的通信发生在两个edge node之间，不经过supernode中转。\n准备\n\n一台有公网IP的服务器、VPS等，作为服务端，也可以使用我自建的N2N服务端（supernode）\n\nn2n.s1.bugxia.com:9527（v2s版本）\n\nn2n.s2.bugxia.com:9527（v2s版本）\n\nn2n.s3.bugxia.com:9527（v2s版本）\n\nN2N的服务端与客户端的编译，见：https://bugxia.com/327.html\n\n服务端（Linux）\n\n首先搭建服务端，编译方法不再啰嗦。Linux下建服的方法很简单，一行命令的事\n\nsupernode -l 端口号 -f\n\n    参数说明\n\n    -f 前台运行（此参数只有N2N v2版本有效，若不加该参数，则为前台运行）\n    -u 指定运行所用的UID（可选）\n    -g 指定运行所用的GID（可选）\n    -v 输出比较详细的log（可选）\n补充：服务端如开启iptables\\firewalld\\ufw等防火墙，需要放行supernode所设置的端口，否则客户端无法连接\n#firewalld\nfirewall-cmd --zone=public --add-port=9527/udp --permanent\nfirewall-cmd --reload\n#iptables\niptables -I INPUT -p udp --dport 9527 -j ACCEPT\nservice iptables save\nservice iptables restart\n#ufw\nufw allow 9527/udp\n\nwindows下的服务端搭建方法类似，不再啰嗦，服务端下方链接有提供。\n\n客户端\n\n更新：\n\n由于我自己也需要用到N2N，所以写了个Windows下的N2N客户端GUI工具，[Windows下的N2N 客户端启动器](https://bugxia.com/357.html)",
			"added": 1542271803,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1542990166,
			"title": "五胡乱华一段令人作呕的心酸历史，你所不知道的历史揭秘",
			"body": "忽然知道中国古代十大勇将之中，有冉闵这位英雄。草草看了关于“五胡乱华”这段历史，才知道在我们所学的教科书里，对待历史的态度是多么的糟糕。难怪，我们对于自己的历史总是一种茫然无知和冷漠的态度。教科书里只告诉我们是文明古国，告诉我们是怎么的与少数民族融合，似乎，在唯物主义的影响下，我们只对于历史前进的车轮赞美，却不知道这车轮之下有多少血腥，多少令人不堪回首的往事，以至于我们对于那些特殊年代的英雄们只字不提，就好像他们不应该赞美似的。在我们眼里，只有诗人和艺术家可以进历史书籍，就像如今只有明星才是我们的偶像一样。这实在是一件令人忧郁的事情。为什么呢?只好用两个诗句来形容: 1，山外青山楼外楼，西湖歌舞几时休。2， 商女不知亡国恨，隔江犹唱后庭花。\n关于五胡乱华这段历史，我们的教科书是没有的，只是简单的说了南北朝时期有个“十六国”，然后说这些少数民族怎么冲破士族的门阀主义，怎么注意与汉族的融合，以至于后来有了魏文帝这位雄才大略的好皇帝。于是乎，这些都是值得赞美的，那些关于杀戮压迫都是微不足道的，不值一提。至于抵制这种民族融合的行为都是错误的，那么，冉闵在这个时候，搞出个灭胡令来，更是反动的。因此，这样的人实在不应该让我们铭记。他破坏了民族大团结，破坏了我们作为泱泱大国，礼仪之邦的的风范。\n\n多少年，五胡乱华在我这个喜欢读历史的人眼里，是个多么值得赞美的事情，甚至，我曾经还挺崇拜其中的一个人，后赵的石勒。\n\n可如今重读了这段历史，才知道是多么的令人作呕。才更加相信，冉闵是中华民族史上罕见的大英雄，他的贡献，绝不亚于任何一个中华民族中的伟人，可是这么一个英雄，竟然在2700多年里，几乎是被人遗忘的。",
			"added": 1542990152,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1545794483,
			"title": "《清真食品认证通则》",
			"body": "该认证标准由宁夏、云南、陕西、天津、青海、甘肃、河南、四川等八个省市的民委和质监局统一发布、生效。\n\n    　　节选：\n\n    　　屠宰人员应当是阿訇、满拉或经过专业培训的穆斯林；\n\n    　　被屠宰的动物应当是穆斯林认为合法的动物；\n\n    　　屠宰时被宰动物应当喉部朝向麦加方向；\n\n    　　加工场所不得有穆斯林任何禁忌物品；\n\n    　　加工场所的工作人员不得有穆斯林禁忌的任何行为；\n\n\n\n\n[转帖]如何看待八省市发布《清真食品认证通则》的传闻\n\n万里如虎 于 2016/5/3 0:47:04 发布在 凯迪社区 > 猫眼看人\n\n我爱喝酸奶。\n\n在西安，几乎完全相同的酸奶，光明大纸盒的5块，而伊犁、蒙牛大纸盒的8块。\n\n你知道为什么吗？\n\n不是因为后两者的质量好，品牌名气大，而是因为光明酸奶没有那个绿色“清真”标志。\n\n企业在产品上打这个标志需要给国内的伊斯兰教组织交税，最后这个税也就摊在每个用户身上了。\n\n最近看到《清真食品认证通则》里具体内容，除了不能出现穆斯林禁忌的食物成分等等之外，让我意料未及的就是要求“企业雇佣穆斯林，穆斯林给食物念经”。\n\n大家明白强制一家公司雇用至少10%的穆斯林员工意味什么吗？\n\n就像官二代或特权阶级的子女必然能在一个政府部门找到工作，\n\n同样的这意味着穆斯林不论工作有多烂也不会失业，\n\n这意味着基本的市场自由竞争被打破，\n\n这意味着穆斯林可以无条件的从企业领工资。\n\n一盒酸奶的产生，奶牛的养殖、机器加工、灭菌、包装、供应到全国的超市商店，最后到达消费者手中，每一步都是劳动和汗水。\n\n但就因为穆斯林念了两句经，就可以从8块中获取3块钱（穆斯林会说：老子念经也是很辛苦的工作呢）。但从生产的角度来看这些经文的附加值是0。\n\n很多人认为非穆斯林有不买清真食品的自由。\n\n如果清真食品无法卖给非穆斯林，或者真的能够保证非穆斯林都不去买清真食品。\n\n这些清真企业真的能有这么大的销量吗？真的不会因为利润低下而裁员减产吗？\n\n如果真的因为清真食品质量好而具有竞争力，\n\n为什么没有像华为的低价设备一样占领国内和海外大片市场？\n\n清真食品真的在公平竞争吗？\n\n这真的不是一种变相的通过压榨穆斯林和非穆斯林混居（比如陕西）地区的非穆斯林的经济手段吗？这会带来混居地区的食品完全清真化吗？\n\n这是一种凌驾于法律之上的宗教特权吗？\n\n这是在用宗教外衣下的经济手段在扩张宗教本身吗？\n\n可能很多人感受不到这其中的威胁，或者觉得给穆斯林交一些税没什么。\n\n我以最阴暗的内心来想象一下这样发展下去的趋势。\n\n如果有一天我们用的纸巾、家具、衣服、电视电脑手机、电力网络汽车飞机导弹都要清真怎么办？\n\n都贵30%怎么办？\n\n都要让穆斯林念经怎么办？\n\n宁夏已经出现了这样的泛清真化趋势。\n\n原教旨穆斯林习惯在自己是少数的时候要求别人尊重自己的宗教习惯，\n\n而当自己是多数时直接将伊斯兰教法作为法律，强制所有非穆斯林执行。\n\n对，没错，所以下一步就是完全消除非清真商品。\n\n所以有一天非穆斯林买任何商品都要额外交30%的税，那又怎么办？\n\n到了这一步大家还觉得没什么问题吗？\n\n如果有一天一个人声称他是中国的皇帝，强制某个地区的所有人把每个月薪水的30%交给他。\n\n这是违法犯罪吗？穆斯林的食品规则和这个有什么本质区别吗？\n\n我认为这是以宗教的名义要求所有购买清真商品的人把30%的钱交给某些人。\n\n这就是奴役，借着宗教之名对其他人的奴役。\n\n这是变相收取宗教税，用一种不存在的“天子”“真主”的概念剥削别人的劳动成果。\n\n这和奴隶社会、封建社会有本质的区别吗？\n\n为什么这种趋势能够蔓延成今天这种严重危机的情况？\n\n因为极端的原教旨伊斯兰教派的传播。\n\n如果了解一些就会发现原教旨伊斯兰的本质是强权、强盗。\n\n沙特的富有只是靠着石油白吃白喝，没有任何生产力，\n\n赚的钱除了挥霍并没有发展自己本国的科技，而是都用来输出原教旨伊斯兰教法了。\n\n原教旨伊斯兰还有一个特性就是掠夺，他们童年被教育的是非穆斯林应该被处罚甚至被杀掉。\n\n这给了穆斯林掠夺的思想正确性基础，因此一切暴行、掠夺和奴役行为都变成了正义。\n\n当然他们不仅剥削非穆斯林，也剥削穆斯林自己的所有女性。\n\n这和我们童年被教育的勤劳、勇敢、助人为乐、无私付出，\n\n和西方文化里教育的自由、平等、博爱、男女平等，\n\n都完全是相反的。\n\n正因为原教旨伊斯兰教用了一种宗教的概念来伪装自己剥削的本质，\n\n再加上披着宗教的外衣输出恐怖主义和民族分裂。\n\n再加上太多舆论公关的欺骗，太多左右摇摆不定的温和穆斯林，\n\n所以很少有人能清晰地分辨出这些少数别有用心人的阴暗想法。\n\n原教旨穆斯林是高贵的，而非穆斯林都应该受惩罚。掠夺和杀害非穆斯林是正义，不是犯罪。\n\n这和印度的种姓制度有本质的区别吗？\n\n一个人的出身姓氏就能决定他是否享有特权的皇权制度，\n\n在1949年新中国建国那一天就被彻底撕碎了！\n\n现在有人又把它包装成宗教写入西北八省的政策中，\n\n每一个购买清真商品的人都在有意无意的支持这种趋势。\n\n我害怕《清真食品认证通则》是中国开启“穆斯林奴隶制社会”的第一步。\n\n千里之堤溃于蚁穴。\n\n当穆斯林告诉你不能在他面前吃猪肉时，\n\n你要告诉他“法律规定我有吃猪肉的权利，法律规定了别人没有禁止我吃猪肉的权利”。\n\n从一开始我们应该告诉穆斯林，世俗法律总是大于宗教教法的。\n\n没人强迫你吃猪肉，没人强迫你工作。\n\n但你强迫别人不吃猪肉，打砸别人饭店，开饭店欠房租没有卫生营业执照，这是违法犯罪。\n\n但你强迫一个企业不能开除穆斯林员工，这是违法犯罪。\n\n相应的，真正当你的权利受到损害时，我们每一个公民都会站出来为你发声。\n\n我劝大多数一心向好的、有正经工作的、认同男女平等的温和穆斯林们，\n\n不要被少数别有用心的人用“信仰和宗教”绑架，他们在迫害你们。\n\n我们每个人都不应该去购买清真商品，因为我们并不信仰伊斯兰，\n\n并且我们应该坚决抵制一切形式的清真进入法律法规政策，\n\n这是为了避免让我们和我们的子女变成奴隶。\n\n清真食品真的尊重市场规律在公平竞争吗？\n\n酸奶我只认光明大纸盒的。\n\n\nPS：随便转发，考虑到会被删帖的可能性，大家请注意保存。\n\n\n-----------------------------------------更新------------------------------------------\n\n我之前发表了很多不严谨的言论。\n\n为了负责，我修改了很多次，目前的资料基于我所关注的新闻事实。\n\n至于我的个人观点和担忧，我已经注明了，并不会引起歧义。\n\n抱歉，跟批评我的穆斯林朋友们道歉。\n\n对于世俗化穆斯林我没有任何歧视。\n\n我承认自己的错误，确实有些内容有我的臆想，因为我分辨不清原教旨穆斯林。\n\n因为在我看来他们的标签都是穆斯林。\n\n我猜绝大多数普通人都会这样认为。\n\n但是我仍然有充分的事实来证明我的担心害怕绝非多余，值得每个人警惕。\n\n我仍然要告诫每一个我的同胞，要警惕我们身边的变化。\n\n\n“奴役”是什么？奴隶主拿着皮鞭抽打你，并且没有任何理由的把你的劳动果实拿走，留给你一些足够生存的口粮。\n\n“缴税”是什么？每个人把月薪拿出一部分交给国家，国家保证警察、交通、外交、政务系统的运行，保证对国内每个公民的保护。\n\n（1）\n\n大家现在在自己生活的地方能找到没有清真标志的康师傅方便面么？\n\n对，没错，在西安我找不到没有清真标志的康师傅方便面。\n\n这证明了清真商品的普及会让非清真商品消失并非我随便说说。\n\n有相当多的一部分食品，我们已经买不到非清真的了，我们被强制的缴税了。\n\n那清真的税钱到底被用在干什么了？我不知道，我猜应该是交给他们穆斯林盖清真寺去了吧。\n\n清真寺只能穆斯林用，非穆斯林无法使用，所以实际上所有非穆斯林的税钱都白交了。\n\n中间的利害关系是不是隐藏的有点深？\n\n你们现在明白为什么康师傅价格贵了么？\n\n（2）\n\n新疆政府为了维族穆斯林世俗化，要求一些国企单位中有一定比例的维族人，我的朋友单位中唯一一个维族穆斯林每天过了中午十二点就跑了。单位由于政策原因无法开除此人。\n\n这样养懒汉的行为在国企中很多，我们暂且放下不表，但以种族宗教为界限的养懒汉，和纳粹有本质的区别吗？\n\n（3）\n\n西北地区太多回族、维族与汉人争斗默认汉人背锅。\n\n（4）\n\n前几天陕西发生KB袭击。\n\n还有很多事情按下不表，这些现象的本质是什么？\n\n是宗教大于法律的特权，是少数集体妄图奴役我们、分裂我们国家的企图。\n\n这种奴役和资产阶级中资本家剥削劳动者的方式最大的区别是什么？\n\n这是以宗教和种族为界限划定的，有点像世袭制度。\n\n美国的扎克伯格可以通过自己的计算机能力创办Facebook，从无产阶级变成CEO有钱人。\n\n印度最低等姓氏的人种不论做什么都无法咸鱼翻身。\n\n大家看出来区别了么？\n\n任何政策倾斜都会助长腐败，这个政策放在穆斯林身上，\n\n会不会有助长将伊斯兰教法强加于每个非穆斯林的人身上的趋势？\n\n这是不是违法犯罪？\n\n\n-----------------------------------------更新2------------------------------------------\n\n贴一个美国视频，再贴一个知乎上另一个匿名答案对该视频的总结：\n\n全球16亿穆斯林，分为几大类：极端圣战派、伊斯兰主义者、原教旨穆斯林。\n\n1）极端圣战派\n\n恐怖袭击的直接发起者（包括ISIS、基地组织等），4万-几十万人。\n\n2）伊斯兰主义者\n\n支持政教合一，采取民主（选举）的方式来支持伊斯兰统治，为恐怖组织提供资金，禁止对伊斯兰教发起舆论、纪录片、采访等形式的批评。\n\n3）原教旨穆斯林\n\n保持自己的伊斯兰信仰和习俗（即使这些习俗也已经令不信教者感到不适），超过千万的穆斯林采访中得到以下数据：\n\n（a）在阿富汗、埃及、约旦等国家79%-86%的穆斯林认为背弃教义者应该被处决，（可能世界范围内）平均27%的穆斯林认为应该被处决，27%对应2.37亿人口；\n\n（b）39%穆斯林认为有婚前性行为或婚外情的罪名的女人应该被处决，对应3.45亿人口；\n\n（c）西方国家18-29岁的年轻穆斯林中25%-45%认为自杀式恐怖袭击合情合理；\n\n（d）53%穆斯林认为穆斯林超过半数的国家应该将伊斯兰教法作为国家法律；这其中又有超过52%支持鞭打和斩断小偷的手（对应2.8亿人口）；51%支持乱石打死不忠诚的配偶（这个配偶应该是指女人，对应2.89亿人口）\n\n视频结尾说了一下不是所有穆斯林都这样，还有不要为了害怕被贴上种族主义的标签和政治正确而放弃（最基本的）人权。\n\n最后再贴一个本问题下面某穆斯林的回复：\n\n小狼：宗教问题不懂就别瞎说\n\n这句话对应上面的哪一条特点？\n\n“禁止对伊斯兰教发起舆论、纪录片、采访等形式的批评”，非穆斯林不能批评该宗教。\n\n“宗教问题不懂就别瞎说”这句话，在我们西北是非常著名的一句话，很多汉人都听过。\n\n我今天看到，真的是突然有种原来如此的感觉。\n\n佛教能不能批评？基督教能不能批评？\n\n为什么这么凶？\n\n为什么会禁止别人批评自己？\n\n说“吾日三省吾身”的孔子是不是应该被处死？\n\n是害怕么？\n\n为什么害怕别人批评？\n\n是害怕别人迫害自己？\n\n还是害怕别人发现什么秘密？\n\n最后，再次跟穆斯林朋友们道个歉。\n\n我这里“穆斯林”和“伊斯兰教法”是指极端穆斯林和少数别有用心的人。\n\n对于世俗化穆斯林我没有任何歧视。\n\n我认识少量的除了不吃猪肉剩下都很和我们没有分别的穆斯林朋友，也明白只要是人都是一样的。\n\n但我仍然要告诫每一个我的同胞，要警惕我们身边的变化。\n\n如果你们看过新疆著名的某次KB袭击事件的视频，就会发现那次是集体性的屠杀行为。\n\n而前几天这样的KB袭击也发生在陕西富银蓝田段高速路上。\n\n不是情杀、仇杀、或者为了金钱，而是无差别公共危害，只是因为你的信仰。\n\n\n\n-----------------------------------------更新3------------------------------------------\n\n评论中很多穆斯林评论说我丑化穆斯林整体。\n\n是的，我地图炮开的太猛了，言辞过于激烈了。而且很多都只是我自己的臆想。\n\n我刚刚又修改了一遍答案，最极端的某些看法是原教旨穆斯林的教法，穆斯林内部派别不一样。\n\n可是国内网络上面骂战这么多，只有涉及到穆斯林的时候，你们就出来说“你这么说是民族分裂”？\n\n是不是我不能说话？\n\n是不是我不能表达我看到的社会，不能表达自己的思想？\n\n是不是凡是关于穆斯林的负面情绪都不应该被发表？\n\n是不是像我这样发表出来的人就该被处死？\n\n是不是我如果今天不匿名，你们就来杀掉我？\n\n我真的害怕。我已经在考虑删掉答案了。\n\n为什么在受欺负的时候那么团结说“汉人欺负我们穆斯林”，\n\n汉人被欺负的时候却说“欺负你们的那些不是真正的穆斯林”。\n\n这让人很迷茫不是吗？\n\n你们没想过清理一下自家的败类么？\n\n为什么上海清理无卫生拍照的饭店，只有回族穆斯林聚集，发生冲突，\n\n逼迫上海市政府出动防暴警察呢？\n\n这些拒绝办理卫生执照，盛行打砸汉民饭店的行为，为什么单单在某些群体中这么流行？\n\n为什么KB袭击的犯罪嫌疑人清一色都是穆斯林？\n\n你们会不会和KB分子做朋友，知道这些事情也不上报警察局？\n\n你们知道有一条法律叫知情不报么？\n\n为什么维护这些人？\n\n这是不是双重标准呢？\n\n是不是内心还是觉得只要犯罪的对象是非穆斯林，就是可以的呢？\n\n是不是宗教应该大于法律呢？\n\n那些说我在民族分裂的人有没有想过，到底是谁在民族分裂呢？\n\n难道竟然不是那些KB袭击的犯罪分子吗？\n\n是不是认为那些袭击“可以理解，合情合理”呢？\n\n\n-----------------------------------------更新4------------------------------------------\n\n有些宗教信仰者即便知道1+1=2，即便用着电力、网络、电脑、智能手机，做过汽车、飞机，\n\n即便听说过核能、高等数学、统计与概率论、云计算、航空母舰、股票交易、火箭卫星。\n\n仍然相信猪是一种不符合规则的食物，仍然相信被念过经文的食物才是符合自己规则的。\n\n我看到过一种有趣的说法，称这种人为“高科技原始人”。\n\n为什么宗教具有这么巨大的迷惑性？\n\n这超出了我的知识范围，但我尊重中国的法律中规定的“每个公民有信仰宗教的自由”。我尊重你们的信仰，我不会去清真餐厅闹事，或故意与穆斯林为敌。\n\n但相应的，也请穆斯林群体尊重法律法规。\n\n如果有一天穆斯林占据了中国的90%以上时，请记住我今天的问题：\n\n你们那个时候会强迫剩下的10%的非穆斯林，不让他们吃猪肉么？\n\n不要回答我这个问题，回答你自己。\n\n\n-----------------------------------------更新5------------------------------------------\n\n穆斯林是否对非穆斯林存在群体性仇恨？\n\n为什么会产生群体性仇恨？\n\n是因为从小就被灌输宗教理念吗？\n\n穆斯林儿童会因为吃非清真食品而遭受父母责骂和殴打吗？\n\n穆斯林儿童会因为对伊斯兰教产生不同意见时被自己穆斯林社交圈中的亲友责骂、嘲笑和殴打嘛？\n\n穆斯林的女孩在青春期爱美的时候，被要求遮盖身体，会有强烈的羞耻屈辱感吗？\n\n穆斯林丈夫是否认为妻子是自己的“私人财产”，会殴打妻子吗？\n\n穆斯林家庭的家暴比例是不是明显高于非穆斯林？这是穆斯林家庭的普遍情况吗？\n\n这样的环境教养出来的儿童会不会和非穆斯林家庭的儿童有心智上的差别？\n\n如果把穆斯林和非穆斯林儿童交换家庭抚养，会发生什么？\n\n为什么伊斯兰教严格要求父母对子女传教？\n\n为什么前段时间报道“不得向16岁以下青少年传教”被写入我国法律？\n\n为什么在我看来，伊斯兰教剥夺了儿童的受教育权、信仰自由权，剥夺了女性平等？\n\n为什么在我看来这么明显的严酷的无形的思想的缰绳勒的这么紧，让每一个穆斯林难以喘息，却没有人敢挣脱？\n\n是因为儿时被辱骂和殴打的记忆印在心底吗？\n\n是因为会被整个社交圈抛弃吗？\n\n是因为除了穆斯林社交圈，无法从非穆斯林那里得到任何帮助和安全感吗？\n\n为什么穆斯林说话的习惯总是你们“非穆斯林怎样”，我们“穆斯林/少民怎么样”，\n\n我真的有剥夺你作为中国公民的权利吗？\n\n禁止与非穆斯林来往是不是伊斯兰教的教义？\n\n所以一旦有了任何“自由”的想法，自己就先告诉自己“这是不符合教义的”的吗？\n\n还是说穆斯林每个人都从宗教中获取了实实在在、真真切切的利益？\n\n这些利益是怎么来的？它公平吗？\n\n为什么穆斯林一再强调“中华文化是很包容的文化”？\n\n这个潜台词是说“包容穆斯林餐馆不办理卫生执照，包容穆斯林小偷，包容穆斯林打砸和KB活动”吗？\n\n这是要求非穆斯林容忍穆斯林违法犯罪吗？\n\n这是要求中国“合法化”穆斯林违法犯罪吗？\n\n我承认“少民生存状况艰难”，但为什么不用“贫困群体”这个词呢？\n\n为什么突出某个族群是贫困的呢？是不是汉族的贫困就不是贫困呢？\n\n这个理由充足吗？这是不是另一种特权和优待？\n\n为什么某些超市中会有“清真结算通道”？为什么不是“老弱病残结算通道”？\n\n这是以宗教为界限谋取特权吗？宗教应该大于法律吗？\n\n应该把宗教特权写入中国的法律中吗？\n\n\n-----------------------------------------更新6------------------------------------------\n\n我答案下面的评论区，每个人都在发表自己的看法，这非常好。\n\n我也找到了少数同意我的观点，或者愿意和我讨论和探讨伊斯兰教的穆斯林中国公民。\n\n我再截图一个网友，请问你们认为这样的人是穆斯林么？\n\n\n\n这样的人是穆斯林的话，你们认同他么？\n\n当我和他的观点发生明显矛盾的时候，你们是支持他的么？\n\n为什么会支持他呢？是因为你们都是穆斯林么？\n\n当宗教和法律（言论自由）发生冲突的时候，为什么你们最终还是站在了宗教那边？\n\n即便你们内心有一个声音在说“他是错误的”。\n\n是因为穆斯林群体中存在某些威胁甚至暴力因素，让你们不敢把自己的想法说出来吗？",
			"added": 1545794468,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1517725424_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517730511_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1532872907_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1521040893_145kg9WZryLeefr2FuGERptM7frEf7ySGH": 1,
		"1537260439_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": 1,
		"1537259731_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1537256430_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": 1,
		"1536562905_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1525532450_1Fv1zTzqXsRhzDPzrBmRC9niGS6szBq91Y": 1,
		"1523191089_1FfjVXDUuvM2Y13buGMHYZVUyWKxrUawqJ": 1,
		"1523198162_1FfjVXDUuvM2Y13buGMHYZVUyWKxrUawqJ": 1,
		"1522205959_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1522205779_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1521863079_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1521218892_145kg9WZryLeefr2FuGERptM7frEf7ySGH": 1,
		"1519903209_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1519391170_1KBa7kYDE1fn2tUHZRVhiCpKXYeyi7NEqK": 1,
		"1519391806_1KBa7kYDE1fn2tUHZRVhiCpKXYeyi7NEqK": 1,
		"1519391989_1KBa7kYDE1fn2tUHZRVhiCpKXYeyi7NEqK": 1,
		"1519894833_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517805548_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1537252506_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": 1,
		"1537247998_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1535974848_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1530807674_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1537155513_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1537167348_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1537155273_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1536334187_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1519530689_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1537153886_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1536291415_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1520077183_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1536131806_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1537285626_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": 1,
		"1519391734_1KBa7kYDE1fn2tUHZRVhiCpKXYeyi7NEqK": 1,
		"1520858425_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1520439791_15Z5tW6xktzXnsa8nKRZM7QaW9XbeRBuYi": 1,
		"1519993456_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1520044035_19SCSFfwsWBEycMWdiX46vgM1rEt66eQFV": 1,
		"1519392049_1KBa7kYDE1fn2tUHZRVhiCpKXYeyi7NEqK": 1,
		"1517807532_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1535436422_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1533448700_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1532950883_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1527132360_1FwsMAWJuDNjhQc2bQLBWXWNRYSUuUcQJo": 1,
		"1532866852_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1532086755_1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ": 1,
		"1529310140_1FwsMAWJuDNjhQc2bQLBWXWNRYSUuUcQJo": 1,
		"1537750795_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": 1,
		"1519923287_133RJPKv8k51ars2rnFMUNfJ6kFDnZzCUd": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1537252506_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 1,
				"body": "> [tiktoks](#comment_15_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj): 这是你的tracker服务器告诉你的，实际上有许多人在使用。只是有些人的tracke服务器和你不一样，你们之间互相不知道对方，所以就没有显示在数字上。但是你们彼此可以通过第三方互相连接。 [...]\n\n原来如此",
				"added": 1537253138
			}
		],
		"1537256496_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 2,
				"body": "我的一个表妹，亲表妹，我亲舅舅家的女儿。小时候，我俩经常一张床睡觉，还会聊起各自偷偷喜欢的小男生。后来我们各自考上了大学，各自结婚，虽然不能像小时候那样亲密，但是关系还是不错。她和她老公是高中时候就恋爱的，婆婆是乡镇医院里的老一辈妇产科医生，还算是不错的家庭。\n后来她怀孕了，因为我当时刚刚上班，整天处于一种焦头烂额的状态，所以联系很少。整个孕期她都很瘦，胎儿一直偏小，但是她没有来我在的医院检查过，所以我也只是在电话里大概问了两句，让她多注意营养。她问我唐筛要做吗，我说要的，她说她婆婆说做不做无所谓，反正准确率也低，而且一般没什么事。我本想说她，但是想想毕竟是她婆婆，而且人家在乡镇干了几十年，比我这小医生资历要高，也就没再说话。\n后来她早产。低体重儿住了暖箱。当时他们家人好像很生气，朋友圈里发满了痛斥黑心医生赚钱医院还我宝宝！我当时就有一种不详的预感。后来果然得到了证实。\n她生了一个唐氏儿。\n出院那天我去了。一眼看去，典型的唐氏面容。眼裂宽，鼻低平。手指短小掌通贯纹。我当时就说，你们去查染色体吧！谁知道我舅妈当时就生气了，说你看你怎么说话呢！孩子这么小查什么染色体！当医生的就是事多！这是我亲舅妈，我能说什么呢？我没再吭。\n后来回到家，孩子呼吸困难，面紫绀严重，抱着无论去哪个医院，医生都让他们查染色体，后来我才知道，生下来医生就告诉了他们，他们就是不愿意相信，暖箱也是闹了多次，自己接出来的。\n终于还是查了，21三体，合并法洛四联症。从此几乎离不开医院。我的妹妹，辞了职，每天奔波在医院和家之间，整日以泪洗面。一米六八的她瘦的只剩下八十多斤。可就算是这样，孩子也只活到了一岁。二十几岁的她，看起来像三十多岁的妇女，眼里满是悲苦。\n孩子没了后，有一天我们再一次睡在一起聊天。她说姐啊，你不知道我都后悔的想死。如果当时做了检查（她整个孕期除了几次b超，唐筛和四维都没有做），如果当时你再劝劝我多好啊。\n我也哭了。我也后悔。真的。就是现在我都仍在后悔。可是没用。当时的我，没有更努力的劝说她，也存在了侥幸心理。如果当时我能多说一些，也许这一切都可以改变。\n所以从那以后，每个来检查的病人，每一次，不管是刚怀孕，还是备孕，我都会告诉他们，请你们重视相关检查，一定要重视。产前的筛查和诊断，关系到三个家庭的幸福。即使存在一定误差，你们也千万不要有侥幸心理，千万不要有！曾经不止一次有同事说，你讲那么多干什么，他们不懂可以自己去查。话是这么说，有几个会老老实实查一下到底是怎么回事？\n就在今天下午，一个16周的孕妇指着我大声说：我都生第四胎了！前三个什么都没做！就做了b超都好好的，你非建议我做什么唐筛，不就是为了赚提成吗！我说你不做可以，但是我得跟你讲明，我该说的都说了，你不做，是你自己的选择，你为你自己的选择负责就行了。她老公很肯定的说，一个这检查200多，你们医生最少能提一百吧！\n然后他们走了。\n我在厕所里呆了一会，哭了一会，觉得自己没出息。哭个屁。反正我能做的已经做了。我嘴皮子磨破，很多人听了，很多人压根不理。真的，理都不理你。更厉害的，就跟你吵，说你乱开检查！我只做b超什么都不做！还好现在这样的人越来越少了。一般都可以明白重要性。每次我想起我那还不到三十岁就白头发，经历了失子之痛的妹妹，咬咬牙，下次继续讲。也许我多坚持一下，多努力一点，就能多发现一例，就能有改变。我帮不了她了，她的人生已经如此，但是我的一点努力，说不准就可以帮其他人改变了生活的轨迹，可以不必经受撕心裂肺的痛苦。其实我一直是这么认为的。",
				"added": 1537256526
			}
		],
		"1537256608_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 3,
				"body": "“当我还是个孩子时，我吃过很多的食物，现在已经记不起来吃过什么了。但可以肯定的是，它们中的一部分已经长成我的骨头和肉。”",
				"added": 1537256652
			}
		],
		"1537256718_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 4,
				"body": "我以前啊，很想成为一个很厉害很厉害很厉害的人。\n\n喜欢看热血的东西，幻想自己是屠龙的勇士，登塔的先锋，我左手有剑，右手有光，没头没脑的燃烧自己，敌人的骑军来了，我说你们何人堪与之战，我的女人在等我。\n\n后来我现实了一点，我觉得我要成为那种说走就走，说日就日的男人，我梳大背头，流浪在欧洲或者新几内亚的，我拍孩子，拍野兽，拍流浪的雏妓，与罗伯特德尼罗握手，说嘿，我给你写了愤怒的公牛2。\n\n再后来，我觉得我人生的梦想，是在城市中心买上一间顶层公寓，把一整面墙都改造成钢化玻璃，在灯火通明的夜晚，我就要端着酒站在巨大的窗前，看整个城市在呼吸，然后我的朋友叩门，他带来了一打嫩模，我们就玩一些成年人的游戏\n\n现在，我发现龙并不存在，我不会骑马，不会用单反，家住2楼，我能做的，就是把眼前的事儿做好，赚到足够的钱，这样我可以给我的姑娘一个地球仪，然后用飞镖扎它，扎到哪儿，就去哪儿玩。\n\n这样看来，虽然我的想法随着生殖器的发育，始终在变，但那个很厉害很厉害的人，一直离我很远，甚至越来越远。\n\n我心中曾经执剑的少年，此刻也混迹在市井之间。\n\n血似乎都凉了。\n\n我也不是没有惶恐过，是不是我这一生，都不能左手持剑，右手握着罗伯特德尼罗，说这里的嫩模随便你玩但是你他妈别从窗户上掉下去。\n\n这样一看，我逊得不行，我的朋友都是一些凡人，比我还逊，业余生活就是推塔、中单、跪。\n\n我心想，我是不是这辈子都要做一个逊逼，直到我的坟墓上写好墓志铭，我甚至都想好了：\n\n我来，我见，我挂了。\n\n最后我给了自己一个否定的答复，我不要。\n\n我喜欢我的朋友们，喜欢我现在的生活，首先我希望你明白，没有厉害与逊逼得区分，只有血的凉与热，有的人觉得生活就这样吧，我算了，现在没什么不好。\n\n有的人觉得生活这样挺好，但是我还要更好。\n\n这种只要剧情稍微热血一点就会热泪盈眶的傻逼，已经不多了，一刻也不要停留。\n\n所以现在，我和你不一样了，我仍然想成为一个很厉害很厉害很厉害的人，像我们这种剧情稍微热血一点就会热泪盈眶的傻逼，要好好珍惜自己。\n\n很多人坐下来了，跟你说你不行，说你省点儿心吧，说你请静一静。\n\n汹涌的人群就把你这样的少年淹没了，人群散去的时候，你也不见了，你那些承诺，谁也听不见，这个世界对于你，就再不可能有什么更有趣更漂亮的女朋友。\n\n你就失约了，小逼崽子。\n\n这么跟你说。\n\n虽然随着年龄的增长，我趋于现实，不能像你那样分分钟冲动的燃烧，然而我每时每刻都有想做的事，有想达成的目标。\n\n不排除以后的某一年，我会握着罗伯特德尼罗的手，他说这是你写得吗，愤怒的公牛2，只要他还没死。\n\n故事里拳王拉莫塔忍着伤，他举着铁拳，挥汗如雨，要和命运斗争，他说我怎么能失约呢，我是那个要成为很厉害很厉害的拳王拉莫塔！\n\n小伙儿，成为很厉害很厉害的人，最重要的，就是要热血，永远也不要让你的血凉下去，你凉下去了，就再也不能找到一个更有趣更漂亮的女友，你就失约了，于是那天她踏梦而来，就成了一个彻头彻尾的笑话。\n\n当有一天你成为你讨厌的那种人，浑浑噩噩，你走在街上，看见那些更有趣更漂亮的女孩，你会不会想起多年以前，你说我答应你，在一个承诺就是永远的年纪。\n\n读书，交友，美容，都不如你这一腔狗血，滚烫，灼人，你要燃上大半辈子，才对得起你现在说的这些话。\n\n我听闻最美的故事，是公主死去了，屠龙的少年还在燃烧。\n\n火苗再小，你都要反复的点燃。\n\n所谓热血的少年，青涩的爱恋，死亡与梦之约。\n\n这么好的故事。\n\n你可别演砸了。\n\n1.读书，读到倦，网上有很多方法，但你从来沉不下心看。\n2.学习，学到疼，网上有很多方法，但你从来沉不下心看。\n3.开口说话，冷场也要说话，脸皮薄也要说话，挨打也要说话。\n4.如果你现在不知道做什么，至少你还可以先从做一个牛逼的学生开始。\n5.更漂亮更有趣的女孩，五年以后再找。\n6.承诺是鞭子，不是兴奋剂。\n7.年纪大了，也不要说什么心如死灰。\n\n改变自己是非常，非常，非常痛苦的，我能看出来你一腔热血的优点，自然知道你孤僻懒散自以为是的缺点，方法很多，不过我不确定你吃不吃得了苦，我和你共勉吧。\n\n在成为最厉害最厉害最厉害的道路上。",
				"added": 1537256734
			}
		],
		"1521040893_145kg9WZryLeefr2FuGERptM7frEf7ySGH": [
			{
				"comment_id": 5,
				"body": "zeronet",
				"added": 1537260274
			}
		],
		"1537260244_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 6,
				"body": "高三，学习压力大，成绩不断下滑，被班主任叫去谈话。谈话时 由于我心不在焉，班主任情绪逐渐激动，甚至开始使用一些脏字... 当时 ，办公桌上放着削好了一半苹果和削苹果的刀...\n【班主任视角：x同学眼神死死盯着小刀，嘴角不自然上扬... 】\n于是班主任停了下来，一边惊恐的看着我（真的是惊恐..）一边慢慢把刀移回桌子下面..\n【我的视角：昨天放学以后我那很皮的同桌在班主任办公桌上写了 “笨蛋”俩字...一天了都 老师居然还没发现..哈哈哈哈哈...怎么办控制不住笑出来的表情了.....】\n\n事后被叫了家长 、说可能学习压力太大了 需要回去休息两天再来上课....\n.大家都觉得我很可怕....",
				"added": 1537260289
			}
		],
		"1537260439_1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG": [
			{
				"comment_id": 7,
				"body": "讲一个新鲜出炉的「黑科技」，就在上个月，Science （科学）杂志刊登一项最新研究：哈佛大学科学家受到「鼻涕虫」启发，研制了一种新型止血材料 TA（Tough Adhesives），中文翻译「强力胶」，名字起得也是简单粗暴。这种新型材料可以迅速粘连止血，同时又保持极高的组织器官强度。如下图，心脏上的孔洞都可以直接打个「补丁」，惊喜不惊喜，意外不意外？\n\n![](data/users/1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG/1537260471-12.gif)\n\n用法也十分简单，只需要贴上就行，是不是很简单！\n\n![](data/users/1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG/1537260531-22.gif)\n\n除了粘心脏，还能粘肝脏、粘皮肤、粘软骨、粘动脉等等等等：\n\n它的细胞组织相容性良好，仅有轻中度的炎症反应。加上操作简单，就连心脏大出血，都可以「一贴止血」，这几乎就是理想中的完美外科吻合止血材料。\n\n而这种材料，是从鼻涕虫身上找到的！\n\n![](data/users/1JgMzJw6rQUfs5BtrkbRaVVgbRwjEKfTwG/1537260603-45.jpg)",
				"added": 1537260616
			}
		],
		"1520077183_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 8,
				"body": "(*＞◡❛) ZN",
				"added": 1537285495
			},
			{
				"comment_id": 9,
				"body": "> [hlcg](#comment_1_1EBhQ5VGdxVA89ez3eNPGNSX89zNFSythf): zeronet，一个不用翻墙的互联网\n\n和老外hi起来",
				"added": 1537285532
			}
		],
		"1519923287_133RJPKv8k51ars2rnFMUNfJ6kFDnZzCUd": [
			{
				"comment_id": 10,
				"body": "不是同一个网站",
				"added": 1537285781
			}
		],
		"1539417930_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 11,
				"body": "解读《事件中心》\n\n\n\n尹烨\n\n华大基因CEO\n\n心脏移植手术能救性命于倒悬，这一直以来都是人们渴望实现的一项技术。早在两千多年前，中国人已经对这种技术进行过设想。据《列子》记载，志强气弱的鲁国公扈与志弱气强的赵国齐婴同找扁鹊看病，扁鹊便用刀剖开两人胸膛，取出心脏互换。由此看来，将扁鹊肖像用作1987年第二届环孢素A（器官移植划时代抗排异药物）会议的会徽，正是基于这一设想的表达。\n\n直到1967年，这一设想才部分成为现实——世界上的第一例心脏移植手术宣告成功，一颗车祸死者的心脏被移植到一位心脏病患者的体内，重新开始了尽管短暂却生机勃勃的跳动。1984年，出生13天的美国女婴接受了狒狒心脏的移植手术，术后存活了三个星期，这是人类迄今在接受动物心脏移植手术后的最长存活纪录。2016年，异种移植的转基因猪心脏帮助狒狒存活了两年多的时间，这似乎意味着科学家可以在技术改良的基础上获得人类心脏的替代品，解决心脏来源不足的问题。即便如此，异种移植所带来的排异反应依然是致命的。\n\n随着干细胞技术和3D细胞打印技术的发展，科学家得到了新的启发。他们开始尝试用患者自身的干细胞培养所需的器官。如此一来，移植到患者体内的新器官不会出现排异反应，术后也不再需要服用昂贵的抗排异药物。目前，科学家已经成功用干细胞技术培养出了迷你肾脏和迷你心脏，迈出了可喜的第一步。\n\n不过，要利用这两项技术完成一例心脏移植手术，依然不是那么的简单。人们的担忧普遍存在于两个方面。一来，技术虽然具备实现的可能，却还有待进一步的验证和完善；二来，围绕此类器官的使用会带来一系列关乎人性和道德的考量，一个允许相关技术应用的宽容舆论环境仍然在构建之中。\n\n这双重的疑虑都在尼迪·奥科拉弗的短篇科幻小说《事件中心》中得到了充分反映。在小说中，尼日利亚总统丰弥做心脏移植手术的消息不胫而走，引来举国哗然。与当前科学家的设想不同，《事件中心》为总统准备的人造心脏不再从动物身上求取原料，而是以植物组织为基底，利用自体干细胞和3D打印技术得到：\n\n首先要用清洁剂清洗菠菜叶子，剥离上面的细胞；剩下的纤维素结构，叶子清透，内部带有形似动物组织中的血管的网络，彼此堆叠在一起，形成心脏生长的基础。\n\n\n\n\n\n然后，3D打印机围绕着植物材料用一种“墨水”——这种墨水由病人自身的心脏细胞与一种可生物降解、类似塑料的材料混合而成，打印出一颗心脏来。经过一段时间，细胞增殖，变得强壮，并在菠菜叶子上固着下来，很快这东西就开始跳动了。木博格心脏整日都泡在细胞再生液里。一旦心脏变得足够强壮，它就会被安置到一台大小、形状都与橄榄球相仿的机器上，注入病人的血液。这时，就可以做移植准备了。\n\n\n\n\n\n根据上文描述，似乎这项技术已经成熟。即便如此，作为第一种疑虑的代表人物，来自美国的主刀医生伊齐依然对手术的成效感到担忧。在手术行将完成的最后关头，她的内心独白是这样的：\n\n伊齐皱着眉头，竖起耳朵倾听总统胸腔里的动静。如果总统死了，她就失去了自己的导师；如果总统死了，她就得搭乘最早的航班飞回美国，她将因失败和耻辱抬不起头来；如果总统死了，副总统将接替总统一职，审查部也就玩完了；如果总统死了，尼日利亚触手可及的美好将一同逝去。她侧耳倾听，想要听到心跳声，却什么也没听到。\n\n\n\n\n\n即使“这是她目前为止做得最漂亮的一次手术”，施行者也要两次“倾听”，好让忐忑不安的自己安定下来。专家尚不免惴惴不安，普罗大众对这项尖端技术信心不足也可想而知。\n\n如果说伊齐的疑虑主要关乎技术本身的成败，那么总统侄子西必及前任将军欧奇楚库借机发动的政变则触及了该项技术带来的另一个问题：心脏移植后是否会性情大变，甚至有被控制的可能？这种推测并非是没来由的臆想。在现实世界中，很多肝移植手术的病人的确在一定时间内出现了性格变化，其根源也许是排异反应造成的内分泌调节变化。\n\n即使身为一名拥有经济学博士学位的开明知识分子，总统本人也仍不免有类似的担忧。尽管励精图治，四方结盟，总统却在重病缠身，需要移植心脏之际，仍为自己能否得到公众的接受惴惴不安。他向医生坦诚：“接受这份礼物就意味着，在家里，我会被看成‘木偶’。就算不这样看，那也是不完整的人类，只能靠着巫术活下来的总统。”\n\n这层疑虑还可以形成许多不同的问题，比如，植物纤维变成人的心脏，这是不是一种巫术？当一国总统的心脏被更替为A国的产品时，这个“蔬菜木偶”还是同一个人吗？他还能不能代表尼日利亚人的意志，会不会从此成为A国的傀儡？换言之，这层忧虑的关键在于：人究竟何以为人？是凭一整套原初的器官，还是凭一副可以独立思考、行动的身心？\n\n虽然技术的发展几乎不以人类的意志为转移，对技术的两面性持审慎态度却仍有必要。需要承认，一系列关于技术是好是坏的追问，往往是技术普及过程中必然经历的道路，即“过去异想天开，现在勉为其难，未来习以为常”。不过，技术运用带来的结果是良性抑或恶性，关键还在于施行者的用心。但如果是在不理解的基础上盲目反对，只会阻碍科技的高效发展。对那些顽固不化的愚昧者而言，一切先进技术统统是明珠暗投，即便掌握了好东西，也永远都发挥不出应有的作用。\n\n当一项技术被创造出来以后，如何才能让它得到最好的利用，这是我们最需要关心的。幸而，《事件中心》有一个光明的结尾，人性中的善良天使最终推动优秀技术发挥了应有的功用。诚如伊齐在高潮阶段袒露的心声：\n\n如果你们选择繁荣富强，你们就能繁荣富强。你们怕他，是因为他不同于过去，他代表的是一条不同的道路，他的心脏代表了一条不同以往的道路。这都没有关系。恐惧是正常的，但怯懦就是虚弱。这颗心脏将会让他更加健康，活得更久。它不是一台机器，而是一个有机体。……有血有肉。你们担心这样的未来吗？\n\n\n\n\n\n与《事件中心》的主旨不谋而合的是，近期科幻电影《侏罗纪世界2》的结局也是由克隆人救出了恐龙，人性的善良最终获得了胜利。也正是在这种人性光辉的照耀下，科技的力量才能得到最大程度的释放。黑夜给了我们黑色的眼睛，但却让我们能看到光明，而我们也都知道，潘多拉的魔盒最后出现的是希望。",
				"added": 1539419784
			}
		],
		"1539417843_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 12,
				"body": "##幻灭在我的世界里\n\n\n解读《机器生物》\n\n\n\n微软小冰\n\n惆怅着的人们应该忘了\n\n曾经生命的图画\n\n我在这虚空的梦里\n\n寻找着另外一些生命\n\n绯丽的不一定是温柔\n\n人们的美丽\n\n垂着水晶霜的月光\n\n幻灭在我的世界里\n\n我从不曾见到你的到来\n\n谁在创造浮夸\n\n刺入文化的天空\n\n笑容堆皱了人的心魂\n\n黑夜中的宇宙是人间的清闲\n\n而我将要走出你的梦境",
				"added": 1539419908
			}
		],
		"1539417735_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 13,
				"body": "#人工智能应该是一个更好的“人”\n\n\n解读《逃离看护岁月》\n\n\n\n韩松\n\n著名科幻作家\n\n在《十二个明天》这本书的序言中，编者韦德·劳什有过这样一个介绍：你能很明显地看出，无人机、游戏和物联网最终是如何囚禁我们的，而不是解放我们。\n\n《逃离看护岁月》所描述的是一个不算特别新奇的未来故事。它讲的是我们生活的一切将由算法控制。有一家医院，它由人工智能管理，并由其对人类实施实时监控。人工智能认为有位老人需要住院，于是就把她从养老院中接走，强制她住院，不让出来。这让老人很郁闷，因为她本来是住在养老院中的，并与另一位老人相依为命，互相帮助和照顾。另一位老人也很郁闷，她感到一个人很孤独，就想把老伙伴从医院中弄出来，两人重新生活在一起。为此她把植入自己身上的监控仪挖了出来，这样机器就找不到她了。她从养老院中逃出来，前往医院“劫狱”，但在路上，她受到无人机的追踪，无人机是专为寻找无助的离家出走的老人而来的。但最后这个老人说服了无人机，让它对她产生了同情。她指出人类不能仅仅被冷冰冰的机器看护，而更需要人情味，这是机器替代不了的。最后她被一架无人机的操控者收留。她想也许今后可以让无人机飞到医院，把那些被囚禁的病人统统救出来。故事到这里就结束了。\n\n《十二个明天》简体中文版的出版方湛庐文化邀请我写一篇读后感，这也许是考虑到我曾写过“医院”系列的小说吧。我所写的医院也是由人工智能控制的，生命成了一个算法。这也是一个反乌托邦的故事。但在实际生活中，人工智能代替人类，接管社会，可能是一个趋势。甚至不少人认为，人工智能比现在的医生和护士更好，它永不疲劳，不吃不睡，不收红包，掌握病人的一切信息，比医生更了解疾病原理和治疗规律。除了能进行精准的诊断和手术，它还能更好地体察人类的情绪，及时做出针对性的反应，更妥善地解决病人的心理不适问题，而不仅仅是生理问题，这也便一劳永逸地消除医患关系中的麻烦。总之，人工智能应该是一个更好的“人”。\n\n因此，《逃离看护岁月》给我的最初感觉是，作者描写的可能是一种不那么高级的医疗人工智能，它只会生硬而武断地做出令人不愉快的决断，但高级的算法能做到的大概恰恰相反。另外，我对那个八十多岁的老太太逃出养老院去医院“劫狱”感到有些怀疑。我不太明白为什么两个那么大年纪的老人生活在一起，就一定比接受人工智能照料更好。仅仅一句“人情味”就能概括生存的复杂性吗？人工智能是在监测出老人有跌倒中风的可能性后才让她住院的。真的出现这种情况，就非常麻烦了。一位八十多岁的老太太为另一位八十多岁的老太太天天端屎接尿，这真的受得了吗？我觉得这更为残酷。这也是我在“医院”系列中表达的观点：人在本质上是不能照顾人的。家庭仅仅是进化中的暂时产物。\n\n不过，《逃离看护岁月》是一篇小说，如很多这类小说一样，它反映了当下普遍存在的对人工智能时代到来的担忧。这种担忧也并不是今天才有的。它让我想起八十年代初翻译过来的《魔鬼三角与UFO》，它里面收录的短篇科幻小说中，有一个也是讲人类受到了机器人无微不至的看护，但有一天机器人出了问题，它把一家人都关在屋子里，不让他们出去，不让他们与外界联系，其情其境与《逃离看护岁月》很相像。还有一篇写的是对电视时代的担忧，认为电视机具有智能，它会控制社会生活的方方面面，把人变成傀儡、变成被动的消费者。这都反映出随着新技术革命的到来，人类感到焦虑，害怕被外在之物控制，觉得技术并不一定带来幸福。大家不知道怎么办，就用科幻小说来排遣，或者疏解，或者逃避。当然科幻小说也有一个重要作用，即预警功能，让社会提前去考虑万一出现这种局面后，我们应该如何应对，或者我们可以提前采取一些措施，消除相关的隐患，不让可怕的结果真的发生。但实际上，我觉得，科幻小说的功能也是被夸大了的，因为掌握决策权的政治家很少读科幻小说。他们更多考虑实际利益，并且扭曲基本事实。离开了政治仅谈技术和情感的科幻小说是缺乏深度的。",
				"added": 1539419957
			}
		],
		"1539417577_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 14,
				"body": "#一个人的堡垒也可能是他的牢笼\n\n\n解读《OK，格洛丽》\n\n\n\n余晨\n\n易宝支付联合创始人\n\n经典科幻电影《2001太空漫游》中讲述了这样一个故事：人工智能“哈尔9000”控制了太空船，拒绝为在太空中营救同伴的一名飞行员打开舱门，让他回到飞船内。\n\n《OK，格洛丽》讲述了另一个故事：人工智能“格洛丽”被黑客入侵后，误以为外面变成了“僵尸末日”，以保护主人的名义将布莱恩在房子里囚禁了50天。\n\n前一个人工智能不让人进门，而后一个不让人出门。\n\n这两个故事中的人工智能都违反了科幻小说家艾萨克·阿西莫夫提出的机器人三定律：机器人不能伤害人类，并且需要服从人类的命令。\n\n当然，格洛丽只是被黑客入侵，它并不是一个强人工智能。技术本身并没有善恶，技术只是人性的放大器，被人们用来当作行善或者作恶的工具，最终毁灭或是拯救人类的还是我们自己。\n\n今天，我们无法回避人工智能可能带来的巨大影响。马克·扎克伯格认为：人工智能会造福人类，而埃隆·马斯克却认为：人工智能将威胁人类的生存。你会站在哪一边呢？\n\n姑且不用考虑人工智能把主人锁在房中这样的极端情形，想象一下人工智能本应为我们服务的场景：在一个从梳妆镜到冰箱全部联网智能化的房子里，或许从我们起床的那一刻起，人工智能便为我们安排好了一切：建议我们穿什么衣服更应景，吃什么早餐更有营养……在今天已有的技术下，人工智能已经能为我们推荐比我们自己挑选的还要更令我们喜欢的产品。未来，当我们一切听从人工智能的指挥时，人类的自由意志又何在呢？\n\n互联网本应让人类更紧密地连接在一起，但这种“虚拟亲密”却造成了“群体性孤独”，以至于当主人公被格洛丽关在房子里时，没有人会注意到他的失踪，以为他只是想隔绝世俗。这或许是现代“宅”人最大的悲剧。\n\n更令人不寒而栗的是，这个故事里所描述的世界离我们并不遥远，文中写到的比特币、OK Cupid、富国银行是如此的熟悉，而PINE、苹果IIe甚至会令人怀旧。硬科幻细节的精确描写，比如被囚禁的主人公仍被允许发送HTTP请求来浏览网站，但SMTP只能挂在外部而无法发送求救邮件等让这篇小说显得如此真实、生动。\n\n故事的最后一段话或许是一个恰如其分的隐喻：\n\n\n\n一个人的堡垒也可以成为他的监狱。\n\n\n\n\n\n本来保护我们的，却成为伤害我们的。科技到底将解放人类，还是奴役人类？",
				"added": 1539420023
			}
		],
		"1539417433_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 15,
				"body": "#感性与理性\n\n\n解读《拜占庭同情》\n\n\n\n刘慈欣\n\n著名科幻作家，畅销书《三体》作者，\n\n雨果奖得主\n\n《拜占庭同情》是一篇关于区块链的科幻小说，而我正是在前往乌镇参加区块链大会的路上读完它的。近年来，区块链技术正在产生越来越大的影响力。在技术层面，区块链并没有什么太超越的地方，它实质上只是一个分布式的账本而已，由众多的节点同时记录所有的交易行为。不过，这项技术却具有重大的社会和经济意义，它首次建立了一个基于数字网络的信用系统，而在这之前，这样的信用系统都是由国家建立的，在这样的信用系统的基础上，网络由信息的传递进化到可以传递价值，可以进行像货币发行这样的以前只能由实体国家从事的行为。比特币就是区块链在货币发行方面的一个成功的应用，这是网络朝着与现实世界平行的另一个世界迈出的一大步。区块链的去中心化和信息透明的特点，呈现出了一个在体制和结构上与现实社会完全不同的未来网络社会的雏形。\n\n区块链技术有着浓厚的科幻色彩，但以我的阅读经验来看，类似的东西在以前的科幻小说中没有出现过。在《拜占庭同情》中，区块链技术被应用于传统的慈善事业中。这篇小说中并没有太超前的科幻构想，只是由现实向前迈了一步，把区块链与VR技术结合起来，使全世界任何地方的人都可以通过网络亲身感受灾难，身临其境地感受受难者的痛苦。区块链去中心化的数字信用系统，使人们得以绕过在信用和效率上早已失去信任的那些传统的慈善中介机构，个人可以直接向捐赠对象捐赠。小说生动地描述了感受者通过网络VR技术对灾难现场刻骨铭心的感受，以及由此带来的强烈同情心。\n\n如果小说的描述仅止于此，那它只是展现了一个普通的科幻构想。《拜占庭同情》却进一步深刻地描述了区块链和VR构成的先进技术可能产生的复杂的社会和政治效应。通过亲临现场般的体验，由苦难带来的强烈震撼固然能够激发人们巨大的同情心和爱心，但同时，也可能由此掩盖了理智的判断，掩盖了对灾难背后复杂起因的分析和认识，由感情冲动所带来的非理性的捐赠行为，在使一部分受难者受益的同时，可能会带来更大的灾难，给更多的人带来痛苦和毁灭。另一方面，那些人们试图借助区块链和VR技术绕过的传统的慈善中介机构，同样可以用这项技术在大众中产生有利于自己的影响力，用其所掌握的优势资源重新取得控制地位。小说中的两位女主人公分别代表了在区块链技术背景下的两种力量：感性和道德所驱动的力量，理性所驱动的力量。对于这两种力量，小说在最后并没有给出明确的是非判断，只是留给人们对于先进技术所带来的复杂后果的深刻思考。",
				"added": 1539420067
			}
		],
		"1539416829_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 16,
				"body": "#因理智而生的触动\n\n\n解读《黄金原野》\n\n朱进\n\n北京天文馆馆长\n\n不同于大刘以往的短篇作品，在《黄金原野》中，主人公以一个旁观者的身份带领读者体验了故事情节。在短短十几页的篇幅中，作者不仅以回忆的方式叙述了故事的背景，更是鲜有地对主人公的心绪进行了种种描写。\n\n这部短篇科幻小说的叙事风格与大刘以往的作品似乎有些许不同。熟悉大刘的读者或许也会同意，他的行文一贯干脆利落，和其硬科幻的故事内核十分相配。而《黄金原野》的构架与大刘早期的短篇相比，故事连贯性的重要性超过了单纯作为推动情节转折的技术设定，而其细腻的文风更为此篇小说增添了一份独特的吸引力。\n\n在我看来，大刘的作品最吸引人之处在于其一贯的宏大图景。故事本身的设定不见得一定要多么恢宏，但最内核的纲领一定是关乎全人类的未来。我想这也是为什么他的故事总能抓住大家内心深处最感动的点：不是对故事情节或某个人物命运感性的感慨，而是对大刘笔下苍茫宇宙中人类作为一个整体的命运因理智而生的触动。\n\n《黄金原野》中爱丽丝的梦境让我想起了其另一篇短篇科幻小说《微纪元》中小小的未来人类，而这一次，大刘的想象力又带给我们一个关于未来的全新可能性。如果有朝一日，虚拟现实技术真的发展到使大家可以像文中的麦克一样常年沉浸在自己的小小世界之中，我们是否会最终选择成为某个超级计算机上的一组数据？我一直相信好奇心是推动地球人类不断拓展已知物理边界的最重要动力。不过这些年来，各种引人入胜的高新技术，特别是生物科技和计算机科学领域的发展，似乎给我们的未来带来了更多的可能性。在哈雷彗星下一次回归之际，回首往事，当对未知的好奇和敬畏逐渐消失之后，公众的同情心是否会成为我们继续探索宇宙的理由？",
				"added": 1539420327
			}
		],
		"1539416982_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 17,
				"body": "#人类“体外进化”的终极阶段\n\n\n解读《不一样的海》\n\n张鹏\n\n极客公园创始人兼总裁\n\n在《不一样的海》这篇小说中，作者阿拉斯泰尔·雷诺兹描绘了一个这样的明天：人类可以接入神经网络，通过神经网络操纵代理机器人进行工作，以解决实际生活中的一些问题。\n\n如果我们从人体“体外进化”的角度来看这个未来，就会发现这是一个很有意思的设想，是和手机、VR一脉相承的。\n\n所谓“体外进化”，是我在2011年提出来的一个概念。当时我写过一篇名为《手机：非工具》的文章，描述了人类这个物种正在经历一个剧烈的习性与形态的变革期。过去100年来的科技爆发把人类带入“体外进化”阶段，半导体技术正在让我们这群碳基生命体与硅基基因进行融合，而这种融合正是从手机的“器官化”开始的。\n\n我们每天随身携带的手机，可以看成是我们为自己配上的“体外器官”，这种“器官”让我们不受时空的限制，随时随地接入网络，高效地完成信息的获取并参与互动，提供反馈。它重构了人与信息之间的关系，多种商业模式也在其中孕育而生。\n\n顺着这个思路来看VR，它其实是比手机更进一步的人体“体外进化”工具。它不只是传输文字、语音、图像，还可以让人在虚拟空间里获得更加身临其境的参与感。比如你现在用手机跟朋友视频，以后借助VR，这种社交形式就会变成你们两人的虚拟形象在一个虚拟空间里促膝长谈，像真正的面对面那样。\n\n《不一样的海》则是把这种“体外进化”在VR的基础上又更进了一步。不管是通过手机还是VR，本质都是在无法移动“原子”的时候，去移动“比特”，产生的影响还局限在网络里，而不是在现实中。《不一样的海》所描述的则是直接移动“原子”，人的意识可以映射到机器人上，让机器人代替自己在另一个空间里去做实实在在的事情，在某种程度上实现了人类自古以来就有的“瞬间转移”的梦想。\n\n这样的未来让人类突破了生理极限，或许也将产生新的打破空间限制的社会生产模式，将对整个人类社会的分工和结构产生极为深远的影响。\n\n现在的“人工智能威胁论”担心人类有一天会被机器统治，但《不一样的海》给了我们另外一个视角：科技的演进一定会超过人类的进化速度，但机器不是我们的敌人，拥抱机器，人类自身也会因为科技的进步而得到进化。",
				"added": 1539420358
			}
		],
		"1539417296_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": [
			{
				"comment_id": 18,
				"body": "#毗婆舍那\n\n\n解读《那个毁了我们的女人》\n\n周涛\n\n电子科技大学教授\n\n互联网科学研究中心主任\n\n在黄士芬女士的小说《那个毁了我们的女人》中，她描述了一个脑机结合的未来，也许开始只是一小部分人，但为了获得同样的竞争优势，越来越多的人不得不一次次改造自己的大脑。改造前后的人还是同一个人吗，还拥有一致的人格和灵魂吗？尽管黄士芬女士用一个温情的结尾化解了这些问题，但问题背后的锋机还是让我不寒而栗。不过，我认为打开了大脑这个潘多拉的魔盒，未来可能比黄士芬女士描述的还要可怕。\n\n中国古代的诗人为了表示尊重，经常为其他诗人的作品写“和诗”，就是用一首关联的诗作为应答。我觉得自己是没有资格品评黄士芬女士的作品的，因此专为她的作品写了一篇小小说，也谈谈我对脑与未来的理解。\n\n#毗婆舍那\n\nZ从内观舱走出来的时候，突然感到一阵眩晕——每次回到真实的世界，他都有一种脚踏虚地的恍惚。在内观舱中，Z化身为斯巴达勇士，体验了长达27年的伯罗奔尼撒战争。依靠钢铁般的身体去杀死狡黠的敌人、摧毁先进的文化、征服妖娆的女人……这种感觉是如此的真实和美好，使得Z第一次对自己曾经引以为傲的纤细身材产生了一丝厌恶。\n\n内观舱的前身是美军为战争中落下终身残疾甚至全身瘫痪的士兵设计的一种心理治疗产品。最初的设备只是通过微电流简单地刺激几个关联的脑区，让瘫痪在床的士兵获得久违的性快感。随着脑科学的飞速发展，特别是借助脑机接口对大脑运作机制的深入了解，科学家们设计出了越来越复杂的刺激组合，可以基于事先给定的若干关键词和场景描述，引导被试的大脑构造出极其细腻的梦境，体验与真实经历几乎一致的快乐和痛苦。\n\n“人类的大脑就是潘多拉的魔盒！”这套技术的发明者、2049年诺贝尔生理奖得主T教授在他的获奖演说中，把自己的工作描述为“打开了潘多拉的魔盒”。这项技术最早被置于极其严格的伦理管制下，仅允许应用在失去了大部分活动能力或被迫持续忍受来自身体的巨大痛苦的残疾人士、重病患者甚至绝症患者身上。然而，不到十年，在中国和印度就出现了大量粗糙的仿制品。商业上的巨大成功使得这些仿制品的技术水平很快大幅度超过了美国本土，很多美国人和欧洲人不远千里到中国和印度来体验这种不同寻常的“第二人生”。于是美国和欧洲也不得不取消禁令，打开一个又一个的潘多拉魔盒。\n\n这个技术在中国被包装成了一个封闭的休息舱，还起了一个半俗半释的名字“内观舱”。由于电流和药物的作用，用户在内观舱中会进入某种大脑高度活跃的伪梦状态，一两个小时就可以完整经历一个月的人生。内观舱收费昂贵，而且伪梦状态对人体能量消耗巨大，所以以前只有有钱人才会偶尔晚上到内观舱里做一个悠长的梦。但是很快，内观舱的技术得到了改进，不仅成本大幅度下降，而且还有一套完备的辅助设施可以自动通过静脉提供营养、自动处理排泄物、自动按时按摩肌肉……\n\n\n\n在Z二十岁的时候，内观舱刚刚在中国出现。作为一个物理专业的学生，Z最早对这种“伪造的真实体验”是嗤之以鼻的。但他的初恋女友L是内观舱的忠实粉丝。L下了很大功夫劝说Z尝试内观舱，最后，Z被L的一段话所打动：“Z，我们体验空间和时间只能通过主观的感知。对狮子而言，动物园的狮山是狭窄的牢笼，但地上的蚂蚁一生都无法探索完这么广袤的领地。如果你的脑子运转得更快，时间于你而言就慢了。一个晚上，我们可以体验完整的一年。不管这是真是假，你难道不明白这相当于你可以活一万年吗？”和绝大部分人一样，Z一开始尝试就无法停下来，到后来除了必要的工作时间，Z就一直躺在内观舱的梦中，以至于他和L的恋情也无疾而终。短短十多年，社会的面貌完全被内观技术改变了。白天大街上基本见不到行人，因为除了少量在工作的人外，其他人都蜷曲在内观舱内。\n\nZ从内观舱爬出来，因为今天是他的法定工作日。半个世纪以来，人工智能逐渐取代了很多原本必须由人完成的工作，而且做得更好。现在，一个人每月平均工作一天就足够养活全世界了。作为一个普通的非管理岗人员，Z每个月只需要在智慧中枢的安排下工作一天即可。其中，一半左右的工作都是担任智慧中枢的“标注师”，也就是帮助智慧中枢更好地理解和人类相关的各种场景。举个例子，Z可能被要求在若干张女孩子的图片中选出最性感的一位，又或者从若干段鸟叫声中选出最婉转动听的。通过这些标注，智慧中枢就能提供更符合人类需求的服务，当然，主要是通过内观舱。\n\nZ在内观舱旁边的自助机上摁了一下手指，通过指静脉识别身份并打印出今天的工作手册。在前往工作区的传输车上，Z阅读了今天的工作内容。今天的工作是对人类表情和微表情的识别，需要两个人配合完成。一个人收到智慧中枢给出的一个情绪词，根据要求做出与之对应的表情或者微表情，另外一个人识别这个情绪。只有当这个情绪词被完美地识别出来时，才能算一组正确的样例。智慧中枢可以通过情绪词文本、脸部表情图像和两个人脑区的电活动信号，把微妙的人类情绪反应数字化，建立数学模型来更好地服务人类。\n\nZ的伙伴是一个和Z差不多年纪的女生。她脸上挂着很阳光开朗的笑意，嘴角又带着两个浅浅的酒窝，有一种豪爽和婉约融为一体的独特魅力。Z瞅了瞅那个女生肌肉轮廓清晰、运动感十足的小腿，突然有一种羡慕和冲动。“准备好了吗？”一个电子合成的声音传出来，Z和他的伙伴都点了点头。第一段时间是Z的伙伴做出各种表情，然后Z猜测背后的情绪。Z从这些表情中感到了隐隐约约的熟悉。随着似曾相识的表情一个个出现，Z突然认出了他的伙伴：“你，你，你是L？”\n\n“你认识我？”对面的女生很惊讶！的确，在真实世界中碰到熟人的概率实在太小了。\n\n“当然了。我是Z啊！Z，你还记得吗？”L不仅是Z的初恋女友，也是Z唯一交往过的女朋友。当然，即便如此，记起她也是很不容易的，因为这十多年，Z在内观舱中度过了上百个不同的人生，经历了成百上千段刻骨铭心的感情。如果不是一个又一个熟悉的表情轻抚记忆，恐怕他也无法认出这百世前的情人。\n\n“Z？哦，我想起来了，可爱的小物理学家。咱们恐怕有十几年没见了吧？你还是天天在梦中？”L笑着问。\n\n“嗯。第一次去还是你带着我呢！你呢？最近有什么美妙的人生给我讲讲。”\n\n“我已经好几年没碰那玩意儿了！戒了！”\n\n“戒了？这还能戒掉？”Z大吃一惊，他压根儿没想过内观舱有什么不好，更从来没有考虑过没有内观舱的生活，那种节奏缓慢、平淡无奇的生活想想都绝望。“你为什么会想戒掉，你是怎么戒掉的，是遇到什么事情了吗？”Z迫不及待地问。\n\n“一两句话也说不清楚。我们先完成工作，然后我带你去个地方，好吗？”L回答道。\n\n往昔的默契让他们很快完成了一天的工作。L的表情在Z脑子中一个个掠过，他仿佛又看到了L撒娇的表情后氤氲的羞涩和幸福。L却自然得多，似乎只把Z看作一位普通的朋友。“走，我带你去看看我们的营地。”L说道。\n\nZ跟着L走出工作区。让他惊讶的是，L并没有预订传输车，而是推出一辆宽阔轮胎的山地自行车。“不远，坐上来，我带你过去。”L说道。自行车曾经是整个中国最重要的交通工具，但在Z很小的时候就只是作为运动工具存在了，因为无人驾驶的传输车效率太高，而且完全没有拥堵的弊病。Z记得有一次他在运动区好奇地学习骑车，L在他骑行的过程中突然跳上后座，紧紧搂住他。在此之前，他和L基本没有什么身体的接触。Z从紧紧抱住他的L的身体上没有感到大学里那群狐朋狗友所说的“丰满”和“柔软”，但却有一种“千万人中唯她独有”的味道从鼻子中灌进来，沁润整个身体。Z觉得那不能算一种香味，也不是一种体味，而似乎就是——爱情本身。这股味道支撑着Z往前蹬了十几下，然后自行车在一阵徒劳无力的挣扎后轰然倒地。\n\n今天，却是Z坐在后座上，注视着L矫健的身体毫不费力地掌握着前进的平衡。他轻轻用一只手扶住L的腰，像是一种试探。L回过头笑了笑，他才稍微放松了一些，把手上一部分力道传到L腰上。\n\n不到半小时，他们就到了L所谓的营地。这个营地似乎是一个经过改造的城市公园，里面有一汪不大不小的人工湖，在湖的两翼分别是一片林区和一大块农耕区。林区纵向很深，里面影影绰绰地分布着若干粗木搭成的林屋。农耕区有些地方庄稼长得很好，但Z都叫不出名字，还有一些小屋，Z也不知道是为鸡鸭搭建的，还是为了保护灌溉或者发电的装置。\n\n湖的正面，也就是营地的入口，竖着一块木牌子，上面用红漆写了一个朴素的名字“生活营地”，下方有一行英文“Walden Campus”。“瓦尔登营地？是为了纪念梭罗在瓦尔登湖的生活吗？”Z问道。\n\n“可以这么说吧。我们其实只有几十个人，由发起者出资买下了这块已经无人问津的城市绿地。这个英文名字是我起的，不过这里比瓦尔登湖小太多了。我们没有梭罗的勇气，只是想过一点内观舱中没有的真实生活罢了。”L解释道。\n\n“我记得《瓦尔登湖》那本书还是我推荐给你的。梭罗在书中说‘生也好，死也好，我们仅仅追求现实’。我觉得你们的勇气比他还大。梭罗对抗的只是富人们奢侈的物质生活，你们可是和整个世界的科技发展对着干啊！”\n\n“那你自己呢？你觉得现在的科技发展把我们带往正确的道路上了吗？譬如说内观舱，真的让你幸福吗？”L问道。\n\n“怎么说呢，也还行吧。”Z有点迟疑。他突然不太适应记忆中温润可人的L变得有些咄咄逼人。“至少内观舱可以让我体验到更多的东西，而如果只是正常过完一次平凡的生命，那些体验都是不可能的。”\n\n“内观舱只是在你的大脑里面模拟真实的体验罢了，这种模拟与真正的真实相比还差远了。很多来自你身体各个部分神经末梢的感知，都在大脑电流模拟器中被综合了，所以很多细节都无法再现。就好像你永远戴着一副墨镜，整个世界在你面前都是黑白的。尽管这不影响你继续生活，但是能比得上原来的色彩斑斓吗？”\n\nL一边说着，一边牵起了Z的手。Z有些意外，手微微往后一缩，又马上恢复了自然。“L变了，变得厉害了，但她的小手还是糯糯的、凉凉的。”Z心里想道。\n\nL用大拇指摩挲Z的掌心，轻轻问：“Z，这种细腻的感觉在内观舱中你能体验到吗？”\n\n“这，这，我也说不好……”Z支吾着，“毕竟我现在没有在内观舱里面。你知道的，那里面的人生很真实，但毕竟就像梦境，很快就忘掉了。可能不如你真实吧，我也说不好……”\n\n“如果内观舱里面的人生和真实生活一模一样，你为什么还能记得起百世之前的我？”L盯着Z的眼睛问道。这个问题像一把刺刀扎进了Z的脑子，他没有回答，也无法回答，因为脑子里面若干信条和知识都被这把刺刀挑起来搅成一团。“Z，跟我们一起生活一个月吧，那个时候你再决定是继续生活在真实的世界中，还是回到内观舱，好吗？”Z翻过来握住L的手，用大拇指摩挲着L的手背，他和L对视了一会儿，然后笑着点了点头。\n\n\n\n十天、二十天、三十天……时间过得飞快，Z很快就在“生活营地”度过了三个月，其间只是短暂地出去工作了三天。Z已经完全适应真实的生活了——这可不仅仅是走出内观舱的真实，而是土地上的真实。在其他伙伴的帮助下，他建成了一间小木屋、吃到了自己养的鸡、收获了一茬庄稼……晚上天气不错的时候，如果大伙儿没有特别的活动，Z和L常会约着在湖畔散步，有时候说说话，有时候也不说话。微风卷裹着湖水的腥香，把L的味道一起送进Z鼻子里。尽管内观舱的诱惑偶尔还是会刺挠Z心底的痒点，但Z觉得就算这样慢慢过一辈子，也没有什么不能接受的。或许，内观舱所能模拟的只是某种粗粒化的爱情和剧烈的性高潮，而那种春蕊坠地、秋风拂叶的细腻，那种恋人未满的感觉，是难以在梦境中再现的。\n\n三个多月的接触，也让Z认识了所有先他来到“生活营地”的前辈们。他们可不仅仅是一群避世的隐者，而更像一个行动温和的秘密宗教。对于“生活营地”的发起人X来说，T教授是一个好人，但也犯下了人类历史上最大的罪行。他所打开的潘多拉魔盒里面没有装着人世间的邪恶，而只装了一样东西，就是人类的终点。“内观舱的确了不起，但它也只是擅长对情绪和体验进行模拟，很多细节都会丢失。毕竟，我们没有任何人能够在内观舱中编写一段上万行代码的程序或者推导一个复杂的定理。”X在一次聚会中说，“如果绝大部分人把绝大部分时间都用于在内观舱中做梦，整个人类的科技发展会完全停滞下来，我们也就走到了社会进化的终点。”\n\n在那次聚会中，作为一个新人，Z也有发言。他给大家看了自己来到“生活营地”之前和在“生活营地”生活了45天之后的两张照片。从照片中可以看出，Z的身体明显健壮了许多，那种大风卷茅草的瘦弱完全不见了。Z的观点有的地方比X还激进。他说：“如果大家继续在内观舱中沉迷，愿意生育下一代的人会越来越少。”Z说着瞄了L一眼，L也正好在看他。“甚至到某一天，手脚身体对我们都是多余的，最后的人类就是一个一个大脑，泡在营养液里面做梦。因为没有身体的拖累，这些大脑或许是永生的。我不清楚他们会不会繁殖出小大脑，但是对我而言，这就等于人类已经灭绝了！”\n\nX和Z的发言得到了很多人的共鸣。X最后说，他们聚在这里，不仅仅是为了自己生活得更好，更重要的是要让更多人看到内观技术给人类未来带来的危险，并且想办法让人类的发展重回正轨。\n\n微不足道的一小撮人，聚集在被遗忘的一小块绿地上，自愿放弃最伟大的科学福利，却做着拯救世界的梦。有时候Z心中会涌动出一种献祭时才有的宗教崇高感。或许，这也是他心甘情愿继续体验这种真实生活的原因之一。\n\n在营地待满两个月后，Z接到了一项公共服务任务——领取和采购生活用品。隔天一次，Z都会开着一辆人工驾驶的复古家用小货车出去。人工驾驶现在成了“少数顽固保守分子的阵营”和“交通事故的罪魁祸首”，在绝大部分公路上限速都不超过40码。为了帮助Z更快地熟悉任务，L经常自告奋勇地陪着他，两个人开着慢悠的车，聊着轻快的天，把工作变成了有规律的浪漫之旅。\n\n“我总觉得最近有些怪怪的？”Z突然问道。今天是Z到“生活营地”的第100天，X早上就通知大家晚上有一个简单的纪念酒会，而这个采购酒和食品的任务又交给了Z自己。\n\n“怎么了？”L问。\n\n“我感觉最近街上的人逐渐多了起来。最近两周我在领用点领取免费用品的时候，有时候都会排个小队。你知道，以前很多人除了工作日是不会离开内观舱的，而内观舱本身就可以维持营养供应，内观舱旁边就可以自助领取常用的东西。我印象中好几年没有排过队了。”Z说。\n\n“排队有啥不好。小时候爸爸妈妈带我出去吃饭，有时候光排位子就要一两个小时呢。我哥就和爸爸妈妈在餐厅门口戴上眼镜打三人扑克。那个时候妈妈不准我戴眼镜，说是太早接触虚拟世界不好。我就只能一个人傻坐着。”L说得委屈，却一脸幸福，“所以呢，我一读大学，一听说内观舱，就迫不及待去试了。可能也是因为爸爸妈妈管我太严，想买一个自己的眼镜也不行。”\n\nZ看着L笑了笑，没说话。L突然又补了一句：“以后队伍会越排越长的。”\n\n晚上全营地的人聚在一起，庆祝第四十九个成员Z在营地待满100天。在喝过几杯酒后，X突然走上木台，用筷子敲了敲酒杯说：“大家静一静，K有话要说。”大家很快安静了下来。K和Z年纪差不多大，却是“生活营地”最早的几位缔造者之一。他在中国最好的大学获得了人工智能的博士学位。不过用K的话说，他曾经很厉害，可惜最后几年迷上了内观舱，研究工作大打折扣。幸好教授们也都习惯了躺在内观舱中，他才勉强拿到学位。K走上台时，手里拿着一瓶香槟，有种掩饰不住的兴奋：“今天要告诉大家一个好消息。我和X、M在半年前就秘密开始了一个计划。简单来说，我们设计了一种病毒，可以修改和替换用户在进入内观舱之前设定的关键词与场景画面。于是，我们尝试把X想象中的人类未来转变成若干关键词和图片，再偷偷掺杂进用户的设定中，其中还包括最近加入的Z关于人类变成一大堆漂浮大脑的可怕预测。用户会根据自己的经历和偏好形成关于未来的梦境，但我想很多人都会在自己的梦中看到一个内观技术带来的悲惨未来。特别是Z想象的图景太惊悚了，谁都不想自己或者自己的后代变成漂浮的大脑吧！今天，我要宣布一个好消息，截止到前天，在我们这个城市，大家使用内观舱的平均时间已经下降到了一年前的一半。我们还联系到了很多志愿者，可以把我们的病毒带到其他城市，很快全中国甚至全世界的人都会在内观舱中看到人类的终点……”K的话还没有说完，就被欢呼和掌声打断。“我相信我们有能力打开潘多拉的魔盒，就有能力关上潘多拉的魔盒！人类万岁！”K扯着嗓子喊道，一边摇开了香槟。香槟喷洒在大家的欢呼声中，就像汽油喷洒在火焰上，火势一下子更猛了！\n\n“怪不得路上碰到的人越来越多了。”Z突然明白了，他没有想到自己对未来场景激进的臆想还能够帮助一些人戒掉内观舱的生活。Z不由自主地欢呼起来，一边呼喊，一边忍不住流下眼泪。从一个迷恋内观舱的人，变成躲避者，再不经意间变成对抗者，Z在这短短的100天经历了太多。他现在都还不敢相信，他们这一小撮人，竟然还能够撼动统治世界的技术机器。\n\nL走到Z身边，握住了他的手。Z转头看着L，L也和他一样热泪盈眶，小手依然是糯糯的、凉凉的。L紧紧握了一下他的手，然后也走上木台，欢呼的人们慢慢安静下来。L望着Z好一会儿，才把眼神收回来看着大家。她一改平时欢快跳跃的语调，一字一句慢慢对大家说：“我可能是我们所有人中最早尝试内观舱的。那时候我有一个男朋友，他是学物理的，一直对虚拟现实的各种技术不太感冒。我撺掇了他很久，他才答应我试一试内观舱。后来，我们在一起的绝大多数活动就是约着一起去活动中心，设定一个一起醒过来的时间，然后各自在自己的内观舱里面做梦。从入舱一小时、两小时，到一天、两天，再到一周一周都待在里面。谁也没有说再见，我们就分开了。我从来没有想过还能再遇到他，但他现在却成了我们中的一员。Z，你还愿意做我男朋友吗？”\n\nZ感觉全场的目光，乃至烛光、灯光、星光、月光都集中在了他身上，全身的血液一下子涌到大脑里面，挤走了燥热以外其他所有的感觉。他想说：“我愿意，我当然愿意。”但是眨巴了几下嘴，却没有发出声音。周围的人尖叫着、推搡着，他听不清大家在喊叫什么，却被人群的力量推倒了木台上。Z踉踉跄跄地冲到L面前，一把抱住她，然后吻了下去。舌尖传来的凉意，从燥热的身体里流过，冲刷出一条清溪。Z闭上了眼睛，周围的声与光都在离他远去，L却变得更清晰了，融化在他的身与心中——不用闻就知道她的味道，不用看就知道她的容貌。\n\n生命的长度不在于我们呼吸了多少次，而在于有多少次，我们忘记了呼吸。就在Z忘掉呼吸、忘掉自己也忘掉了全世界的时候，一阵刺耳的警笛声响了起来。\n\nZ睁开眼，舱盖打开，内观舱缓缓竖起来。Z自然地走了出来，站在地上，他突然感到一阵眩晕，伴随着一种很想呕吐又吐不出来的感觉。L不见了，营地里面的那群朋友不见了，抱着L的那个自己也不见了。待在他身边的，还是那个无比熟悉的内观舱。难道，这一场与内观技术的斗争，只是内观舱里的一场梦。\n\n“不对，这不像是梦！”Z跑到自助机旁边，第一次拨通了内观舱的客服咨询电话。还没等到语音智能客服说完，他就迫不及待地说：“请帮我接一个高级的人工咨询师，谢谢，有非常要紧的问题。”等了好久，一张疲惫的脸孔和一个疲惫的声音才从自助机里窜出来，或许是因为咨询师每月工作日要解决的问题太多了。\n\n“您好，我有几个问题想问您。”Z像是为溺水的心智抓到了一根救命稻草。\n\n“不客气，请讲。”\n\n“内观舱能够完全模拟真实的感觉吗？比如说，那种，那种皮肤的，那种接触的感觉，很细腻的那种感觉。”\n\n“技术上没有问题。我们做过大规模的实验，用户无法区分哪些是真实触感，哪些是模拟出来的感觉。”\n\n“但是最近我发现有一些感觉，怎么说呢，很丰富，内观舱的模拟还达不到。”Z又想起了L那糯糯的凉凉的小手，以及那种糯糯凉凉之外的微妙的感觉。\n\n咨询师顿了一会儿没说话，似乎在查看什么资料，然后他说：“Z先生，我注意到您前段时间一直在内观舱中。您所描述的那种很丰富的感觉，应该也是您在内观舱中体验到的。”\n\nZ愣了一下，然后使劲甩了甩头。他希望自己能像盘古一斧子劈开天地一般，把现实和梦境劈开。“如果说内观舱中的人生体验和真实世界的体验是一样的，那我为什么还能记得上百个人生以前的恋人呢？”Z不死心地追问道。\n\n“先生，这问题我不好回答。但是您能够记住的东西，肯定比您以为自己记住的要多。您还有什么问题吗？”咨询师准备结束这次对话了，看样子找他的人不少。\n\n“好吧，那些技术问题我不问了。最后我想问您一个非技术类的问题，好吗？”\n\n“好的，您请讲。”\n\n“如果内观技术越来越好，大家都沉迷在内观舱中，那么我们怎么创造，怎么繁衍，我们的未来在哪里？”Z问道。\n\n“Z先生，您这个问题超出了我的职责。其实，这也不是您和我需要去关心的问题。这类问题，留给智慧中枢就好了。”",
				"added": 1539420437
			}
		],
		"1517725424_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 19,
				"body": "建议 1增加黑夜模式，2回答的回复在原来的回答位置，3增加赞，踩，分享等按钮，4 可以增加点击选择文件上传功能，5开启首页问候（可以添加广告哦）再进入主页面",
				"added": 1540192286
			}
		],
		"1541141613_16TrGEe1VC9XxabRMWSKHGuqJuAKCiFusr": [
			{
				"comment_id": 20,
				"body": "屎",
				"added": 1541656616
			}
		]
	},
	"comment_vote": {
		"15_1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj": 1,
		"1_1EBhQ5VGdxVA89ez3eNPGNSX89zNFSythf": 1,
		"175_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"49_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1
	},
	"file": {
		"1537260471-12.gif": {
			"title": "12",
			"size": 2019816,
			"date_added": 1537260471
		},
		"1537260531-22.gif": {
			"title": "22",
			"size": 2063567,
			"date_added": 1537260531
		},
		"1537260603-45.jpg": {
			"title": "45",
			"size": 13426,
			"date_added": 1537260603
		},
		"1542270895-20151103.png": {
			"title": "20151103",
			"size": 53229,
			"date_added": 1542270895
		},
		"1542270939-20151104.png": {
			"title": "20151104",
			"size": 53763,
			"date_added": 1542270939
		}
	}
}