{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1580487512_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "Wonder why Chinese gov banning all those international rescues.",
				"added": 1580537439
			},
			{
				"comment_id": 2,
				"body": "> [testuser3](#comment_76_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): The Chinese gov CCP's goal is to great reduce their population so that can resolve the Chinese social contradiction and save gov's power! And then full controlling all of their people even the world for ever!CCP wants to use climate war, biological war, and geographical war to recover Taiwan. When it kills half of the Taiwanese,it will belong to Beijing!\n\nO, come on. You can't be serios.",
				"added": 1580542183
			},
			{
				"comment_id": 13,
				"body": "> [toppfungg](#comment_16_16j1WtLKAKpemCzA2suD1aaWfie2854o5T): 发贴子在故意黑中国，你竟然还信。实际情况是中国正在全力以赴抗击疫情，形势已经向好。\n\n抨击中国当然不好，但形势向好也是假的。",
				"added": 1581041734
			}
		],
		"1580487512_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 3,
				"body": "Yes, But some of them do not appear as a so-called backdoor. For example, Intel had developed a debug bridge over USB 3.0(used on some of the Xeon processers). So in some occasion, if you had set something wrong in UEFI, thus a simply plug of a USB device could easily read every instruction and every byte in your internal memory. However, this technology is so convinient and widely-used so that we mostly do not recognize it as a serious safety leak.",
				"added": 1580547655
			},
			{
				"comment_id": 4,
				"body": "Also, I guess the reason why China has banned the import of TPM chipset is that the gov is afraid of having a backdoor in such a highly-secured chipset.",
				"added": 1580547795
			},
			{
				"comment_id": 5,
				"body": "> [testuser3](#comment_75_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): exist , CCP developed this\n\nOops, It's you again. I don't believe that CCP is going to develop such a hardware-based backdoor, in reason that as far as I know, China do not have such an advanced tech to build chips, so made-in-China ones aren't so widely used around the world. Then what's the point of adding a hard backdoor? Just spying on civilians?",
				"added": 1580548124
			},
			{
				"comment_id": 10,
				"body": "> [rannulfr](#comment_29_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): everything is compromised. every proprietary processor has hardware backdoors. X86, ARM etc. If you want to remove them you need to go fully open source and support RISC-V.  [...]\n\nI support RISC-V too.",
				"added": 1580631041
			}
		],
		"1580200766_12nzpTjSwUuQJ3KVgEn8DrxWoGEuicrbNS": [
			{
				"comment_id": 6,
				"body": "Haha, me too.",
				"added": 1580548339
			}
		],
		"1580551703_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 7,
				"body": "Here! ;)",
				"added": 1580552817
			}
		],
		"1580551763_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 8,
				"body": "No... It's still active! Why do you think it's closed?",
				"added": 1580552921
			},
			{
				"comment_id": 9,
				"body": "We call it New GFW Talk",
				"added": 1580553268
			}
		],
		"1580594957_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5": [
			{
				"comment_id": 11,
				"body": "Musescore for noting! I love music and muse is a fantastic cross-platform score editor.",
				"added": 1580716909
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 12,
				"body": "The good old days when we did not have a GFW.",
				"added": 1580716965
			}
		]
	},
	"comment_vote": {
		"53_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1
	}
}