{
	"next_post_id": 27,
	"next_comment_id": 1,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "四书五经bot",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "苟志于仁矣，无恶也",
	"post": [
		{
			"post_id": 1,
			"date_added": 1543724036,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1543725301,
			"body": "子曰：“笃信好学，守死善道。危邦不入，乱邦不居。天下有道则见，无道则隐。邦有道，贫且贱焉，耻也；邦无道，富且贵焉，耻也。”\n——《论语·泰伯》",
			"date_added": 1543725299
		},
		{
			"post_id": 1543725424,
			"body": "汤武革命，顺乎天而应乎人，革之时大矣哉。\n——《易传·彖传下·革》",
			"date_added": 1543725421
		},
		{
			"post_id": 1543725550,
			"body": "齐宣王问曰：“汤放桀，武王伐纣，有诸？”\n孟子对曰：“于传有之。”\n曰：“臣弑其君，可乎？”\n曰：“贼仁者谓之贼，贼义者谓之残，残贼之人谓之一夫。闻诛一夫纣矣，未闻弑君也。”\n——《孟子·梁惠王下》",
			"date_added": 1543725546
		},
		{
			"post_id": 1543725726,
			"body": "然而暴国独侈，安能诛之，必不伤害无罪之民，诛暴国之君，若诛独夫。若是，则可谓能用天下矣。能用天下之谓王。\n——《荀子·正论》",
			"date_added": 1543725721
		},
		{
			"post_id": 1543726013,
			"body": "子贡问曰：“何如斯可谓之士矣？”\n子曰：“行己有耻，使于四方不辱君命，可谓士矣。”\n曰：“敢问其次。”\n曰：“宗族称孝焉，乡党称弟焉。”\n曰：“敢问其次。”\n曰：“言必信，行必果，踁踁然小人哉！抑亦可以为次矣。”\n曰：“今之从政者何如？”\n子曰：“噫！斗筲之人，何足算也！”\n——《论语·子路》",
			"date_added": 1543726007
		},
		{
			"post_id": 1543726256,
			"body": "齐人伐燕，胜之。\n宣王问曰：“或谓寡人勿取，或谓寡人取之。以万乘之国伐万乘之国，五旬而举之，人力不至于此。不取，必有天殃。取之，何如？”\n孟子对曰：“取之而燕民悦，则取之。古之人有行之者，武王是也。取之而燕民不悦，则勿取。古之人有行之者，文王是也。以万乘之国伐万乘之国，箪食壶浆，以迎王师。岂有他哉？避水火也。如水益深，如火益热，亦运而已矣。”\n——《孟子·梁惠王下》",
			"date_added": 1543726249
		},
		{
			"post_id": 1543726486,
			"body": "天之生民，非为王也，而天立王以为民也。故其德足以安乐民者，天予之；其恶足以贼害民者，天夺之。\n——《春秋繁露·尧舜不擅移、汤武不专杀》",
			"date_added": 1543726478
		},
		{
			"post_id": 1543726521,
			"body": "余闻董生曰：“周道衰废，孔子为鲁司寇，诸侯害之，大夫壅之。孔子知言之不用，道之不行也，是非二百四十二年之中，以为天下仪表，贬天子，退诸侯，讨大夫，以达王事而已矣。”\n——《史记·太史公自序》",
			"date_added": 1543726512
		},
		{
			"post_id": 1543727159,
			"body": "天视自我民视，天听自我民听。百姓有过，在予一人。\n——《尚书·周书·泰誓》",
			"date_added": 1543727149
		},
		{
			"post_id": 1543727255,
			"body": "入孝出弟，人之小行也。上顺下笃，人之中行也；从道不从君，从义不从父， 人之大行也。若夫志以礼安，言以类使，则儒道毕矣，虽尧舜不能加毫末于是矣。 \n孝子所不从命有三：从命则亲危，不从命则亲安，孝子不从命乃衷；从命则亲辱， 不从命则亲荣，孝子不从命乃义；从命则禽兽，不从命则修饰，孝子不从命乃敬。 \n——《荀子·子道》",
			"date_added": 1543727244
		},
		{
			"post_id": 1543728247,
			"body": "孟子告齐宣王曰：“君之视臣如手足；则臣视君如腹心；君之视臣如犬马，则臣视君如国人；君之视臣如土芥，则臣视君如寇仇。”\n王曰：“礼，为旧君有服，何如斯可为服矣？”\n曰：“谏行言听，膏泽下于民；有故\n去，则君使人导之出疆，又先于其所往；去三年不反，然后收其田里。此之谓三有礼焉。如此，则为之服矣。今也为臣。谏则不行，言则不听；膏泽不下于民；有故而去，则君搏执之，又极之于其所往；去之日，遂收其田里。此之谓寇仇。寇仇何服之有？”\n——《孟子·离娄下》",
			"date_added": 1543728235
		},
		{
			"post_id": 1543728487,
			"body": "呦呦鹿鸣，食野之苹。我有嘉宾，鼓瑟吹笙。吹笙鼓簧，承筐是将。人之好我，示我周行。\n呦呦鹿鸣，食野之蒿。我有嘉宾，德音孔昭。视民不恌，君子是则是效。我有旨酒，嘉宾式燕以敖。\n呦呦鹿鸣，食野之芩。我有嘉宾，鼓瑟鼓琴。鼓瑟鼓琴，和乐且湛。我有旨酒，以燕乐嘉宾之心。\n——《诗经·小雅·鹿鸣》",
			"date_added": 1543728474
		},
		{
			"post_id": 1543730596,
			"body": "儒有上不臣天子，下不事诸侯；慎静而尚宽，强毅以与人，博学以知服；近文章砥厉廉隅；虽分国如锱铢，不臣不仕。其规为有如此者。\n——《礼记·儒行》",
			"date_added": 1543730582
		},
		{
			"post_id": 1543738762,
			"body": "子夏问于孔子曰：“居父母之仇如之何？”\n夫子曰：“寝苫枕干，不仕，弗与共天下也；遇诸市朝，不反兵而斗。”\n曰：“请问居昆弟之仇如之何？”\n曰：“仕弗与共国；衔君命而使，虽遇之不斗。”\n曰：“请问居从父昆弟之仇如之何？”\n曰：“不为魁，主人能，则执兵而陪其后。”\n——《礼记·檀弓上》",
			"date_added": 1543738747
		},
		{
			"post_id": 1543739010,
			"body": "为父绝君，不为君绝父。为昆弟绝妻，不为妻绝昆弟。为宗族疾朋友，不为朋友疾宗族。人有六德，三亲不断。门内之治恩掩义，门外之治义斩恩。\n——《郭店楚简·六德》",
			"date_added": 1543738994
		},
		{
			"post_id": 1543739216,
			"body": "厉王虐，国人谤王。邵公告曰：“民不堪命矣！”王怒，得卫巫，使监谤者，以告则杀之。国人莫敢言，道路以目。\n王喜，告召公曰：“吾能弭谤矣，乃不敢言。”\n邵公曰：“是障之也。防民之口，甚于防川。川壅而溃，伤人必多，民亦如之。是故为川者决之使导，为民者宣之使言。故天子听政，使公卿至于列士献诗，瞽献曲，史献书，师箴，瞍赋，蒙诵，百工谏，庶人传语，近臣尽规，亲戚补察，瞽、史教诲，耆、艾修之，而后王斟酌焉，是以事行而不悖。\n民之有口，犹土之有山川也，财用于是乎出；犹其原隰之有衍沃也，衣食于是乎生。口之宣言也，善败于是乎兴，行善而备败，其所以阜财用、衣食者也。夫民虑之于心而宣之于口，成而行之，胡可壅也？若壅其口，其与能几何？”\n王不听，于是国莫敢出言，三年，乃流王于彘。\n——《国语·周语三》",
			"date_added": 1543739199
		},
		{
			"post_id": 1543739929,
			"body": "天之生民，非为君也；天之立君，以为民也。故古者，列地建国，非以贵诸侯而已；列官职，差爵禄，非以尊大夫而已。\n——《荀子·大略》",
			"date_added": 1543739910
		},
		{
			"post_id": 1543740119,
			"body": "故曰：凶年修旧则讥，造邑则讳，是害民之小者，恶之小也；害民之大者，恶之大也。\n——《春秋繁露·竹林》",
			"date_added": 1543740099
		},
		{
			"post_id": 1543740409,
			"body": "孟子曰：“民为贵，社稷次之，君为轻。是故得乎丘民而为天子，得乎天子为诸侯，得乎诸侯为大夫。诸侯危社稷，则变置。牺牲既成，粢盛既洁，祭祀以时，然而旱干水溢，则变置社稷。”\n——《孟子·尽心下》",
			"date_added": 1543740388
		},
		{
			"post_id": 1543796954,
			"body": "佛肸召，子欲往。子路曰：“昔者由也闻诸夫子曰：‘亲于其身为不善者，君子不入也。’佛肸以中牟畔，子之往也，如之何？”\n子曰：“然，有是言也。不曰坚乎，磨而不磷；不曰白乎，涅而不缁。吾岂匏瓜也哉？焉能系而不食？”\n——《论语·阳货》",
			"date_added": 1543796932
		},
		{
			"post_id": 1543797332,
			"body": "菀彼桑柔，其下侯旬，捋采其刘，瘼此下民。不殄心忧，仓兄填兮。倬彼昊天，宁不我矜？\n四牡骙骙，旟旐有翩。乱生不夷，靡国不泯。民靡有黎，具祸以烬。於乎有哀，国步斯频。\n国步蔑资，天不我将。靡所止疑，云徂何往？君子实维，秉心无竞。谁生厉阶，至今为梗？\n忧心慇慇，念我土宇。我生不辰，逢天僤怒。自西徂东，靡所定处。多我觏痻，孔棘我圉。\n为谋为毖，乱况斯削。告尔忧恤，诲尔序爵。谁能执热，逝不以濯？其何能淑，载胥及溺。\n如彼遡风，亦孔之僾。民有肃心，荓云不逮。好是稼穑，力民代食。稼穑维宝，代食维好？\n天降丧乱，灭我立王。降此蟊贼，稼穑卒痒。哀恫中国，具赘卒荒。靡有旅力，以念穹苍。\n维此惠君，民人所瞻。秉心宣犹，考慎其相。维彼不顺，自独俾臧。自有肺肠，俾民卒狂。\n瞻彼中林，甡甡其鹿。朋友已谮，不胥以谷。人亦有言：进退维谷。\n维此圣人，瞻言百里。维彼愚人，覆狂以喜。匪言不能，胡斯畏忌？\n维此良人，弗求弗迪。维彼忍心，是顾是复。民之贪乱，宁为荼毒。\n大风有隧，有空大谷。维此良人，作为式谷。维彼不顺，征以中垢。\n大风有隧，贪人败类。听言则对，诵言如醉。匪用其良，复俾我悖。\n嗟尔朋友，予岂不知而作。如彼飞虫，时亦弋获。既之阴女，反予来赫。\n民之罔极，职凉善背。为民不利，如云不克。民之回遹，职竞用力。\n民之未戾，职盗为寇。凉曰不可，覆背善詈。虽曰匪予，既作尔歌！\n——《诗经·大雅·柔桑》",
			"date_added": 1543797309
		},
		{
			"post_id": 1543812517,
			"body": "纪侯大去其国。\n大去者何？灭也。孰灭之？齐灭之。曷为不言齐灭之？为襄公讳也。春秋为贤讳。何贤乎襄公？复仇也。何仇尔？远祖也。哀公亨乎周，纪侯谮之。以襄公之为于此焉者，事祖祢之心尽矣。尽者何？襄公将复仇乎纪，卜之曰：“师丧分焉。寡人死之，不为不吉也。”远祖者几世乎？九世矣。九世犹可以复仇乎？虽百世可也。\n——《公羊传·庄公四年》",
			"date_added": 1543812493
		},
		{
			"post_id": 1543814984,
			"body": "梁惠王曰：“寡人之于国也，尽心焉耳矣。河内凶，则移其民于河东，移其粟于河内。河东凶亦然。察邻国之政，无如寡人之用心者。邻国之民不加少，寡人之民不加多，何也？”\n孟子对曰：“王好战，请以战喻。填然鼓之，兵刃既接，弃甲曳兵而走。或百步而后止，或五十步而后止。以五十步笑百步，则何如？”\n曰：“不可，直不百步耳，是亦走也。”\n曰：“王如知此，则无望民之多于邻国也。不违农时，谷不可胜食也；数罟不入洿池，鱼鳖不可胜食也；斧斤以时入山林，材木不可胜用也。谷与鱼鳖不可胜食，材木不可胜用，是使民养生丧死无憾也。养生丧死无憾，王道之始也。\n五亩之宅，树之以桑，五十者可以衣帛矣；鸡豚狗彘之畜，无失其时，七十者可以食肉矣；百亩之田，勿夺其时，数口之家可以无饥矣；谨庠序之教，申之以孝悌之义，颁白者不负戴于道路矣。七十者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。\n狗彘食人食而不知检，涂有饿莩而不知发；人死，则曰：‘非我也，岁也。’是何异于刺人而杀之，曰：‘非我也，兵也。’王无罪岁，斯天下之民至焉。”\n——《孟子·梁惠王上》",
			"date_added": 1543814959
		},
		{
			"post_id": 1543913388,
			"body": "士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？\n——《论语·泰伯》",
			"date_added": 1543913362
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1GL68xw9TpGBdGgZ91uwbUkP9fo8y6Q29Y",
			"user_name": "Sishu",
			"date_added": 1543725073
		}
	]
}