{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 1,
				"body": "it's so bad that when I capsized transfering all my modern sports rifle I hadn't the gps and lost consciousness to wash on a shore, I don't even know the lake name, but I walked for days to regain civilization... of course I can tell you the name of the dinner I landed, sadly it went bankcrupt with the pandemics :D.",
				"added": 1615529935
			},
			{
				"comment_id": 2,
				"body": "what do you think pedogen honoré has in store? I heard he was quite active in the rapedom of texas :).",
				"added": 1615529976
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 3,
				"body": "> [realtrump](#comment_4_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz): I donnot like british government, because they are liars.\n\nit's not called the pedodungeon of the europe for no reason. As told once IW1 was won, the ocean should have been crossed to terminate the thing, once and for all !\n\nit's still possible, after IW2 :D.",
				"added": 1615530054
			},
			{
				"comment_id": 9,
				"body": "why? I prefer to be a minority in NK or China, knowing that I always be a foreigners and adapt rather than to have to adapt to suckers who seek to white genocide me, replace me with foreigners and rape kids... anything else? constant bail out...\n\ntian anmen was the same gig as in hk, tibet, xinjang a failed plot by the CIA... when will you get it taht your decoy of \"democracy\" was raped in little st james... for the slowest (like me)... we don't believe you at all...\n\nyou just want my tax, and the total submission of my life to your will...\n\nslave herder... and you could be black !",
				"added": 1615534847
			}
		],
		"1615515631_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc": [
			{
				"comment_id": 4,
				"body": "raycist !",
				"added": 1615530072
			}
		],
		"1611850021_1N6HArdCgfF7zK7vWNR5UEPBDSXAbv2WEN": [
			{
				"comment_id": 5,
				"body": "cool",
				"added": 1615532853
			}
		],
		"1615444288_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 6,
				"body": "or maybe florida... where is pedogen honoré from? they have a good base with the jetset antigun boy there... who knows... they have to ! the UNO / global agenda said so. will see how it goes :).",
				"added": 1615533632
			}
		],
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 7,
				"body": "I love mexican food ! big fan, big league ! everything, but the tequilla with the worms, never tried... I prefer cocktails :D.",
				"added": 1615533696
			},
			{
				"comment_id": 10,
				"body": "did you know that the cezar salad was invented in mexico ? heheheh !",
				"added": 1615534884
			},
			{
				"comment_id": 11,
				"body": "and there no vegan nazi will stop me to eat beef if I wish with my beans :D. glory to mexico !",
				"added": 1615534909
			}
		],
		"1615534190_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 8,
				"body": "you can't sucker ! go back to twitter, you will be safe for your take over :D.",
				"added": 1615534707
			}
		]
	},
	"comment_vote": {}
}