{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1631979939,
			"title": "Candle May Light or Be Extinguished!",
			"body": "[Candle May Light or Be Extinguished! ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:6_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Candle+May+Light+or+Be+Extinguished)\n\n\nFaith is just like candle — Candle May Light or Be Extinguished!\n**Democracy and Rule of Law is similar to candle, either light up the civilization or be extinguished!**",
			"added": 1631979938
		},
		{
			"topic_id": 1634708439,
			"title": "Great Awakening",
			"body": "##Great Awakening \n#####— The Definite Principle \n\nAll innovations are inspired by a special force in the universe.  Among the big mix-up of uncertainties, there's a definite way out. \nAt a technology-explosive era, the speed of innovation on both technology and virus production is going at so quick a pace that even the most advanced vaccines can't catch up with the mutations of the virus! \nMany scientists have proven that the limited types of vaccines do not solve the on-going pandemics.  Some scholars even found that vaccines might accelerate the mutations of virus! \nSo there should be diversified solutions on the complicated mutations of virus. Besides the vaccines, some traditional medicines are also developed, like the Home Ivermectin based kits widely adopted by people in India, which is proven to be a scientific approach, to ease the tough situation, though perfect solution on the pandemics is not found yet. \n**Science is just a special part of human being's recognition of the universe** — the logical part which is verified either by regular formulas or substantial facts.  To tackle complicated issues requires serious mind and persistent passions, which is similar to a strong faith in God.  \nWith the popularization of IT equipments, many people see that if there is a serious systematic self-conflict that's not solved, the operation task will be plunged into an infinite loop, unable to move forward.   \nHippocrates, often described as the father of modern medicine, once said, \"The greatest medicine of all is to teach people how not to need it\".  When vaccines are over-commercialized on profiteering purpose, it’s a self-evident contradiction against the medical practice to save people.  Thus, there will be an endless loop of troubles, even with vaccines accelerating the mutations of virus!  \n## Respect Life, Respect God, Respect the Eternal Heaven and Earth.  \nTo ensure that such principle is not discarded, the forefathers of America established a special constitution, protecting Human Rights with Gun Rights, which is an universal principle on the planet, of vital importance for the ballots democracy system.  \nIt's an unusual stage of history. Over-entertaining atmosphere eroded the fine essence of traditional culture. The conflicts between virus and vaccines will make more and more people get awakened up.  \nA new tide of Puritanism Christendom Resurrection will emerge in 21st century!",
			"added": 1634708437
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1631979939_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 1,
				"body": "“Freedom is never more than one generation away from extinction. We didn't pass it to our children in the bloodstream. It must be fought for, protected, and handed on for them to do the same, or one day we will spend our sunset years telling our children and our children's children what it was once like in the United States where men were free.”\n― Ronald Reagan",
				"added": 1631981339
			}
		],
		"1634708439_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 2,
				"body": "Bilingual version is here.\n[Great Awakening — The Definite Principle ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:7_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Great+Awakening+The+Definite+Principle)\n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)",
				"added": 1634708773
			}
		]
	},
	"comment_vote": {}
}