{
	"next_post_id": 8,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Zxriurwgby",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1614405301,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1614405317,
			"body": "Update Retroshare 0.6.6\n\nhttps://github.com/RetroShare/RetroShare/releases\n\nhttps://retroshare.ch/invite\n\n#Retroshare #p2p",
			"date_added": 1614405315
		},
		{
			"post_id": 1614475553,
			"body": "https://www.youtube.com/watch?v=A-qkix_R6Hs\nMy video overview of the RetroShare Peer-To-Peer Social Network\n\nThis open source and privacy focussed social network offers a lot more functionality than most other social networks especially in the P2P space. In this video I explain how to get connected to other peers, I give an overview of all the functions it can perform, and end off touring around the interface and showing how it works.\n\nFunctions include Chatrooms, Mail, Channels, Forums, Boards with more to come in the next version.",
			"date_added": 1614475550
		},
		{
			"post_id": 1614698221,
			"body": null,
			"date_added": 1614698216,
			"meta": "{\"img\":\"777,700,734765aaabbb998876776987555654443887342332221,01222334430565612743111589181416778AA16B8B1688A861A8AACADD98ACCCDEEEA1CADCAEEEC1ADDD6DCC8B\"}"
		},
		{
			"post_id": 1614970156,
			"body": "\n\nQuantum is a professional dosimeter with two SBM 20-1 Geiger counters.\nThe SOEKS Quantum dosimeter is registered in the Register of Measuring Equipment (Certificate of Measuring Instrument Type Approval No. 62619-15, issued on December 8, 2015 by the Federal Agency for Technical Regulation and Metrology).\n\nQuantum is very easy to use. It can be easily operated both by professionals and users who have no special training.\n\nIf necessary, the dosimeter may be tested by any accredited laboratory according to the approved calibration procedure.\n\nSOEKS Quantum is the most affordable and one of the most advanced professional dosimeters available on the market. This is the only truly mass-produced professional dosimeter.\nQuantum is sold in more than 40 countries worldwide. Tens of thousands of these dosimeters are produced, which makes Quantum more affordable compared with its immediate competitors. Moreover, it offers a much wider range of functions and is easy to use.\n\nYou can connect Quantum to your computer to upload measurement readings to Excel, customize the settings or upgrade firmware.\n\n2 Geiger-Muller counters (SBM 20-1)\n700 hours of stand-alone operation\nMeasurement speed - 9 seconds\nSaving measurement results on PC\nAccumulated dose recording - for at least 1 year\nCapability to update software without assistance\nMenu easily understandable even for a non-professional user\nSetting the threshold values of radiation and accumulated dose\nSound and color indication\nOriginal SOEKS power supply kit (capability to charge batteries inside the device)\nSOEKS Quantum - the most popular professional dosimeter in the world - is successfully sold in 40 countries. It is distinguished by high accuracy and measurement speed. Owing to intuitive menu, color and sound indication, device operation does not cause any difficulties even for naive users. At the same time SOEKS Quantum is much cheaper than its nearest competitors.\n\nhttps://intersoeks.com/\n\n#SOEKS #DOSIMETER #geiger\n",
			"date_added": 1614970150,
			"meta": "{\"img\":\"700,700,fffeee888bbbddd222555777333121343444,00012130000004567000000468700000045970000004A5700000048B70000004487000000455700000045670000001213000\"}"
		},
		{
			"post_id": 1615153357,
			"body": "\n\nSynaptics/HP keylogger\n\nTL;DR: HP had a keylogger in the keyboard driver. The keylogger saved scan codes to a WPP trace. The logging was disabled by default but could be enabled by setting a registry value (UAC required). Get the list of affected hardware and patch here: https://support.hp.com/us-en/document/c05827409\n\nUPD: Turns out it’s not HP’s failure. Synaptics released a statement on the issue: https://www.synaptics.com/company/blog/touchpad-security-brief\nFrom the statement I can conclude that other vendors (Lenovo, Dell, …) might be affected too. To check if your driver contains ‘the debug tool’ run “findstr.exe /I ulScanCode SynTP.sys” from the command line: if the driver is clean findstr won’t print anything. Also it worth to note that the “proprietary binary format” mentioned in the statement is easy to decode and is not necessarily “a rolling memory buffer” but might be a persistent file.\n\nSometime ago someone asked me if I can figure out how to control HP’s laptop keyboard backlit. I asked for the keyboard driver SynTP.sys, opened it in IDA and after some browsing noticed a few interesting strings:\n\nhttps://zwclose.github.io/HP-keylogger/\n\n#keylogger\n",
			"date_added": 1615153350
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}