{
	"message": [
		{
			"body": "Salut à tous. Voici mes premiers pas : http://127.0.0.1:43110/1NE4mtFzSyaNb5vEz7zvBUkgjuT8jK8utP/",
			"date_added": 1528811000118
		},
		{
			"body": "Salut rototo0, j'ai remarqué que si on clique simplement sur les liens, on obtient une page vide, par contre si on ouvre dans un nouvel onglet ça marche (sans doute un problème de frame)",
			"date_added": 1530229997798
		},
		{
			"body": "Avez-vous déjà installé Zeronet sur une tablette ? dans mon cas, sur une Samsung Galaxy tab2, c'est pas terrible !",
			"date_added": 1535529212568
		},
		{
			"body": "Pas beaucoup de mouvements dans la \"Zeronet francophonie\", allez, je me lance http://127.0.0.1:43110/13yp8wuPuYG7rqQXFAL66QjCj8AmhQAfFi/",
			"date_added": 1561714842856
		},
		{
			"body": "Salut les radio-amateurs !",
			"date_added": 1570446448166
		},
		{
			"body": "Je n'ai jamais été radio-amateur, mais dans ma jeunesse j'étais passionné de radio, et j'ai donc dès l'age de 14 ans construit mon propre récepteur de trafic. C'était un super-hétérodyne avec un étage de préamplification en tête et bien sûr un C.V. à 3 cages. Les transistors existaient, mais c'était trop cher pour moi, j'ai donc réalisé tout ça avec un stock de très vieilles lampes qu'un ami m'avait donné... Je me souviens encore que la changeuse de fréquence était une transcontinentale ECF1. :)",
			"date_added": 1570450901804
		},
		{
			"body": "@f0gxr39100 Tu nous dis il y a 2 jours avoir perdu l'identité de ta page sur le radioamateurisme, j'ai trouvé celle-ci, est-ce la bonne ? http://127.0.0.1:43110/1KFqEB1EXLp8d1uoYUqzJCcKV4k3u29f4ri",
			"date_added": 1570526330098
		},
		{
			"body": "@f0gxr39100 , désolé un \"i\" parasite s'est glissé à la fin de l'adresse, je recommence : http://127.0.0.1:43110/1KFqEB1EXLp8d1uoYUqzJCcKV4k3u29f4r",
			"date_added": 1570526811612
		},
		{
			"body": "@f0gxr39100 , cest moche de perdre la main sur ses données. Je conseille toujours aux zeronautes de garder précieusement sur une clé USB leur fichier users.jso, cela permet si votre machine vient à crever de reprendre la main sur une autre, et dans ton cas de travailler sur un live-cd sans soucis, en replaçant bien sûr ton users.json sur cette machine dans .../zeronet/common/data/users.json",
			"date_added": 1570534958489
		},
		{
			"body": "@f0gxr39100, oui, c'est plus ou moins un foutoir... http://127.0.0.1:43110/13yp8wuPuYG7rqQXFAL66QjCj8AmhQAfFi",
			"date_added": 1570535888379
		},
		{
			"body": "Oui, c'est sûr, il n'y a pas beaucoup de mouvements ici !",
			"date_added": 1598799212826
		},
		{
			"body": "Pour relancer le débat, je vous pose la question suivante : parmi les francophones, est-ce que quelqu'un d'autre que moi a expérimenté MAVO avec Zeronet ? Voici le lien sur les travaux que j'avais réalisés : 0net:/13yp8wuPuYG7rqQXFAL66QjCj8AmhQAfFi/mavo/",
			"date_added": 1598800194535
		},
		{
			"body": "Petit pb, le lien n'était pas cliquable : http://127.0.0.1:43110/13yp8wuPuYG7rqQXFAL66QjCj8AmhQAfFi/mavo/",
			"date_added": 1598801865523
		}
	]
}