{
	"title": "多成義工",
	"description": "<font color=>**<font color=Blue>http://127.0.0.1:43110/Duosuccess.bit　　　學校案例分享</font>**</font>.",
	"links": "\n- [<font color=><font color=Blue>多成學校、醫院</font></font>](/)官方　https://Duosuccess.com\n [<font color=Blue>多成智能瀏覽器下載</font>\n](http://rick-li.github.io/midi-browser/en.html)\n＝＝以下是見證者分享＝＝\n- [天人合一：多成義工分享](http://127.0.0.1:43110/1td4ie5ZvKCzzCfJnQKTAT5a7cneceB6M/)\n[見證：馮綺雲乳癌協會](http://efbcc.com/index.html/)http://efbcc.com/index.html\n- [平淡如我（整理多成案例）](http://blog.sina.com.cn/mianfeiyiyuan)\n==（Facebook)\n- \nDuoSuccess TCM e-Hospital ](https://www.facebook.com/duosuccess/?fref=ts&sw_fnr_id=2526810051&fnr_t=0)\n- [Social Welfare Awareness And Assistance](https://www.facebook.com/Social.Welfare.Awareness.And.Assistance)\n[多成健康公益平台 DuoSuccess TCM Philanthropic Efforts](https://www.facebook.com/groups/480969432092975/)\n [孟焱精神健康協會](https://www.facebook.com/duosuccesstcm/)\n [田雨晰先天性心臟病健康協會](https://www.facebook.com/groups/1271879866169111/)\n [各健康協會總集](http://www.duosuccess.com/bbs/viewtopic.php?f=12&t=4338)\n＝＝＝視頻分享＝＝\n[<font color=Blue>翡翠台采访：龍醫師抗癌秘方\n</font>\n](https://www.youtube.com/watch?v=aCvPVeMvjkM)\n- [多成音樂進村居](https://www.youtube.com/watch?v=tQf2kV9M4Ic)\n[生命奇蹟見證短片](https://www.youtube.com/watch?v=7Leb3ojoG2M&feature=youtu.be)\n- [我的人生新希望](https://www.youtube.com/watch?v=TOrd_0HRUsY&feature=youtu.be)　\n[<font color=><font color=Blue></font></font>](http://127.0.0.1:43110/duosuccess.bit)＝＝語音版＝＝\n [瞑眩反應](https://www.dropbox.com/s/2560xgzx5758f7d/MingXuanReactions.mp3?dl=0)\n\n\n [<font color=><font color=DeepPink>荔枝FM3090537止若主播：多成中醫\n</font></font>](https://www.lizhi.fm/3090537?from=groupmessage&isappinstalled=1)\n＝＝＝ZeroNet <font color=>**<font color=Blue>新手指導</font>**</font>＝＝＝\n- [<font color=>**<font color=Blue>入門篇：零網教學　zh-wiki-編程隨想之友</font>**</font>](http://127.0.0.1:43110/1NCezLP8aXjABVreBB1CKGPub2tKTtyhWU/?Page:map1)　\n[浮生網志：ZeroBlog新手指导](http://127.0.0.1:43110/mosen.bit/?Post:5)\n[Zeroalpha中文博客](http://127.0.0.1:43110/1NYgLKpinyihB7NtnQkH9Z4jNQ3o9zC8BX/)\n[愛我中華](http://127.0.0.1:43110/1CNvGEzT1Mn8UFSJVR7Pm6CaL7thPcDXj6)",
	"next_post_id": 17,
	"demo": false,
	"modified": 1519021740,
	"post": [
		{
			"post_id": 9,
			"title": "<font color=><font color=Blue>多成學校 DuoSuccess School</font></font>",
			"date_published": 1501052064.962,
			"body": "Students use Duosuccess Online Energy Music (effect sharing)\n[點擊閱讀](http://127.0.0.1:43110/Duosuccess.bit/data/004a05090101-English.html\n Thank you for your music treatment,this activity to improve our academic performance and attitude, \nYou pay the door we will never forget, thanks! \nprint \"Introduction of Music Therapy for Primary School in Penang (Malaysia)\nWe introduced a music therapy called Duosuccess Online Energy Music to one of the primary schools in the suburbs.  Introduction of Music Therapy for Primary School in Penang (Malaysia)\nWe introduced a music therapy called Duosuccess Online Energy Music to one of the primary schools in the suburbs.\nThis therapy are to improve children's mindfulness, concentration and change of their bad habits. Prior to the adoption of the music therapy, majority of the students were very rebellious, hyperactive, fighting to each other and very hard paying attention at classes.\nHeadmaster selected their student from Standard 5 & Standard 6 for priority due to their exam is coming soon. We would like to share out the progress after their hearing.\nDay 1 : 22/2/2016 (67 Students)\n- The situation was out of control as students were not familiar with the music and classroom environment. \n- It was discovered that 95% of the student were busy talking to each other, few of them closed their ears to eliminate the noise, and not be able to concentrate nor focus. \n- The sound system a bit noise due to the volume was too heavy. The music automatically stopped after half an hour and we replay it for one hour session ended and the helper was worried as the first day didn't give much positive result. \nDay 2 : 23/2/2016 (67 Students) \n- The situation improved drastically. Around 50% of students started to accept the music, they sat down and listened quietly. Some even fell asleep. \n- After half an hour the music stopped and we replay to continue it. \n- Today has a lot of student go out to toilet; in and out…it might be disturb the environment energy.\nDay 3 : 24/2/2016 (67 Students) \n- Even better improvements compared to Day 1 & 2, where 70% students were seen concentrating during the session. It was observed that some felt sleep, those awake kept to themselves. \n- The students took out their wallet, spectacles, ties and play it without making much noise, they whisper as they talked to each other. The music stopped after half an hour and resumed after. \nDay 4 : 25/2/2016 (67 Students) \n- There were 80% students were concentrating to the music. It was indeed amazing as the music did not stop for the entire session. \n- There were students falling asleep until the music was stopped and they were still sleeping. Some of the student even started to snore. \n- The atmosphere was very different, the energy surroundings call for peace and tranquility…serenity. You can feel the classroom energy was so different, peace and comfort. The headmaster was so happy with it.\n- Started from today we stop them to go to toilet, advice them go toilet before the music start.\nDay 5 : 26/2/2016 (67 Students) \n- There were 90% students were felt sleep. The music was interrupted twice, but no adverse effect. \n- Students were patience when they woke up. We observed for 4 days that once music stopped the students started to move their body and making some noise before they went out from classroom but the “Day 5” was slightly different as the students were sitting and waiting for the instruction then only go out from classroom. It was a pleasant surprise for all of us, including the Headmaster and the Teacher.\nDay 6 : 29/2/2016 (65 Students)\n- There were 92% students who fell sleep.\n- The music interrupted once after started about 10 minus.\n- 2 students snoring and 7 students who slept throughout the session. \n- There was a student with slightly different reaction. His eyes were closed with hand movements, similar to the Chinese Martial Art- “Kung Fu”. Upon checking, we were told by headmaster he is taking Taekwondo classes as his extra curricular, which might explain his behavior.\n- The students manage to go out silently after the music ended.\n- It was amazing within this few days the students were seen attitude change to be well disciplined and well behaved.\nDay 7 : 1/3/2016 (60 Students)\n- There were 92% students who fell sleep. Quiet and peaceful, some coughing sound here and there. \n- According to the Headmaster, some of the students were not making so much noise and some started to concentrate on their study.\n"
		},
		{
			"post_id": 7,
			"title": "問題少年",
			"date_published": 1500384327,
			"body": "新聞星島日報：報道　《澳洲教育部為教師提供摔跤訓練　應付有暴力傾向學生》\n## 關於暴力傾響：用中醫理論來解釋，即身心不平衡。青春期及少年更加需要調整身心平衡關係。\n- [<font color=><font color=Blue>問題少年系列</font></font>](http://www.duosuccess.com/tcm/001a06040889.htm)　\nhttp://www.duosuccess.com/tcm/001a06040889.htm\n構成問題少年的原因錯綜複雜：\n1. 首先是家庭教育的缺失易使孩子產生情緒障礙，從而形成反社會心理引發犯罪；\n2. 應試教育只重視考試成績，忽視道德規範和法制教育，而對成績差的學生冷眼相待甚至放任自流，導致他們自暴自棄；\n3. 社會上黃賭毒和流行文化氾濫，誤導青少年的人生觀和價值觀；\n4. 青少年感情脆弱，承受挫折的能力低，易受情緒左右，犯罪行為帶有很大的隨意性和偶然性。\n子女不聽話，家長通常的處理方法是「先罵後打」。然而兒童若經常出現爭辯、抗衡頂嘴、大哭大叫、情緒突變、吹牛自誇、引人注意、破壞物件、不聽指示、固執易怒、說話過多、愛說粗話、欺負他人、攻擊他人、戲弄他人、恐嚇他人等行為，可能是有暴躁問題，即問題少年。「打罵」只會使問題變本加厲，一般來說，問題少年十歲後就難於轉變（兒童十歲開始踏入青春期）。故家長若發現子女有暴躁跡象，應與我們合作協助子女消除暴躁傾向。 同時在面對逆境時，需要培養建立正面樂觀態度，和堅毅積極的人生觀。\n造成兒童暴躁的原因很多，家長管教過嚴或婚姻出現問題、兒童在學校遭朋輩欺凌、被針對導致自尊感低、再加上電視節目、電子遊戲和漫畫卡通的影響，都會使兒童變得暴躁。\n\n"
		},
		{
			"post_id": 6,
			"title": "<font color=><font color=Blue>多成學校 DuoSuccess School</font></font>",
			"date_published": 1483228800,
			"body": "[<font color=Green>**多成學校主頁**</font>](http://127.0.0.1:43110/duosuccess.bit/data/001a12061101school.html/)\nhttp://127.0.0.1:43110/1AUHC6wpgF676cEd8uZX6cU8BucGU4KAP7/data/001a12061101school.html\n校訓：大道至簡\n宗旨：無所為而無所不為\n使命：為網絡社會創造一全新的教育基礎設施。多成音樂作為核心技術，具有潛力顯著塑造未來的教育景觀......\n理念：為天地立心，為生民立命，為往聖繼絕學，為萬世開太平\n平等對待所有學生，不論民族、宗教、天賦、健康、地位和經濟狀況，任何人都可以有機會接受高品質教育，拓展智能和前景，有教無類。在這裡，教育成為權利，而非特權；\n目的：德智體均衡發展、高瞻遠矚\n原理：身心合一和天人合一的提升能使人類發揮最大潛能\n特色：網上學習、數碼教材、因材施教（網上數碼學校）\n內容：音樂欣賞\n課程：循序漸進\n結婚之後或想懷孕時用「孕前準備」，懷孕後用「胎教」，嬰兒一出生就可上「幼稚園」，之後「小學」、「初中」、「高中」、「大學」等學年開始日期自定，結束日期以實際學習月數為準。\n培養下一代，是人生最有價值的事情。只要方向正確，按部就班，其實也很簡單。\n"
		}
	]
}