{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1545469324_12Mvq5uNp3DouDNDHAvph1Uoovja7iAvz4": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1598206333_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": [
			{
				"comment_id": 1,
				"body": "(...)Na razie nie widziałem aplikacji, która naprawdę negatywnie korzysta ipfs( bez instalacji go-ipfs lub node).(...)\nJest jeszcze przeglądarka Brave, która daje też przy okazji wejście do kryptowalut.",
				"added": 1634142582
			},
			{
				"comment_id": 2,
				"body": "@korkolev\nMoże wyrażniej?",
				"added": 1634148862
			}
		],
		"1605552425_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 3,
				"body": "Już prawie koniec tego roku (...)Roku zagłady(...) i... gówno. Nawet w Afganistanie się nie postarali.",
				"added": 1634172625
			},
			{
				"comment_id": 11,
				"body": "Co niby się dzieje? Nawet na granicy nie dają rady się sprowokować...",
				"added": 1634253824
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 4,
				"body": "> [ey2xjpdx](#comment_29_1At298vUijuhjA2GtqXEydC8csRnhETzdH): Tak naprawdę to większość polskiej strefy 0 to malkontenci i pisarze sci-fi. Nie chcę tu nikogo obrażać.\n\nNa polskim TOR'ze jest jeszcze gorzej... Można go opisać 2 słowami: Cipki i wyjebki. Jeśli kogoś obraziłem to nie przepraszam.",
				"added": 1634221111
			}
		],
		"1610822859_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 5,
				"body": "> [driud](#comment_187_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH):To wszystko jest już ustalone, jeśli biden dojdzie do władzy? To mamy wojnę z Rosją; A po drodze wojna na bliskim wschodzie, jak zostanie Tramp. \n\nBiden rządzi już prawie rok... i gdzie ta wojna?",
				"added": 1634223957
			},
			{
				"comment_id": 6,
				"body": "> [gafel2](#comment_71_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Zadziwiające jest, jak on dzisiaj \"podpuszcza\" tę drugą stronę, na zasadzie: przestępstwo staje się przestępstwem dopiero wtedy, kiedy zostanie dokonane.\n\nPrzypomnij mi kto w 2015 najgłośniej krzyczał (...)Dulity!!!(...)...",
				"added": 1634224319
			},
			{
				"comment_id": 7,
				"body": "> [gafel2](#comment_72_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Bez tego, potrzebne są jakieś łamańce logiczne, aby wyjaśnić sobie, o co tu może chodzić.\n\nŁamańców logicznych to wymaga wyjaśnianie dlaczego siły dobra po przejęciu zasobów Ameryki zamiast zacząć trzepanie sił zła to dorabiały sobie mordę idiotów... te wszystkie wolty sekretarzy tego i owego, doradców itp.",
				"added": 1634224485
			},
			{
				"comment_id": 8,
				"body": "Dodajmy do tego akcje w stylu (...)Już wydał rozkaz ataku na Iran(...)...",
				"added": 1634224628
			},
			{
				"comment_id": 9,
				"body": "> [gafel2](#comment_74_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Np. za 2-3 lata masowa liczba przypadków zwłóknienia płuc.\n\nA w Klewkach jest epidemia tego wąglika co Talibowie Leppera naprodukowali.",
				"added": 1634224754
			},
			{
				"comment_id": 12,
				"body": "> [kovkolev](#comment_45_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3): A co ty się obudziłeś po pół roku?\nWeszłem do ZeroNeta dopiero teraz\n\n> [kovkolev](#comment_45_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3): Po przejęciu jakich zasobów kiedy korporacje są te same?\nPrzejęli za to CIA, FBI zatem mogli odpalać każde śledztwo jakie tylko chcieli, HilaryGate na czele, federalne organy władzy wykonawczej, zdolność wydawania rozporządzeń wykonawczych. A korpo można kroić już wspomnianymi śledztwami FBI czy CIA, embargami czy wręcz wojnami handlowymi i nie tylko, nakładaniem sankcji i nie tylko... a ostatnio dzięki pandemii nawinęła się okazja do ręcznego sterowania tego kto czy co legalnie przemieści się przez granicę jedną czy w drugą stronę.\nMieli tak dużo, a zdziałali tak mało... jakim łamańcami logicznymi spróbujecie to wytłumaczyć.",
				"added": 1634298085
			}
		],
		"1612049550_1HxF6zesCAqUtGzUYJ8WpE1TnLFsnQZw8s": [
			{
				"comment_id": 10,
				"body": "Najlepsza metoda zapewnienia prywatności DNS to postawić Binda i ściągnąć na niego najważniejsze strefy.",
				"added": 1634243306
			}
		],
		"1620938699_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 13,
				"body": "(...)Teraz przejdźmy do sedna, jakie dane chcą od Polaków Żydzi z PIS podczas spisu w roku 2021 ? Lista może zszokować, dokładność i zakres danych budzą najwyższy niepokój.(...)\nPrzecież te dane są w już istniejących bazach danych...",
				"added": 1634415184
			}
		]
	},
	"comment_vote": {}
}