{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1LoSnDfaYjrwHLzXDPgxW81doTMnVq19hg": [
			{
				"comment_id": 1,
				"body": "Felhasználók részéről van hova fejlődni. Kár hogy többen akarják tönkretenni mint ahányan segítenek az oldalak terjesztésében. A legtöbb fertőzött tartalom kínai és orosz pontokról jön. Trojan JS Coin A/B (állami cenzúra tönkreteszi vagy itt is hasonlót láthatunk ahogy oroszok kínai oldalaknak álcázva nyomulnak?) Elég szomorúan tapasztalom hogy a magyar nyelvű fordítások is el vannak maradva. Az működése decentralizált, viszont a fejlesztőknek mindenképpen kellene egy átmeneti centralizálás, koordinálás, fejlesztési terv és kivitelezés, mert így van egy nagy tortánk amibe beletúr mindenki, van aki villával és van aki kézzel :) Kitartást és kooperációt a fejlesztőknek! A user meg szokjon hozzá hogy pénzt keresni munkával lehet nem egy mindenki számára elérhető ingyenes tartalom szolgáltatással.",
				"added": 1589360657
			}
		],
		"1_1PXXUwyKemsXQ4P8o5ErFwsm8GbgNzcmXB": [
			{
				"comment_id": 2,
				"body": "Üdvözlet! A fiatalabb generációhoz szólnék pár szót, aki esetleg úgy érzi hogy a szíve a helyén van. Gondoljatok csak bele abba ha valakinek hazudnak és véleményét kérik ki a hazugságról, értékelhető? Nem velünk emberekkel van a baj. A politika kőkemény Üzlet!! Az egész világon!! Egy percig sem szabad azt gondolni hogy bármelyik politikus ki tud minket vezetni a mocsár alól, nem azért mert emberileg nincs hanem azért mert játékszabályok között mozognak. Lehetőségük sincsen! Magyarországi példa: - Amikor az első világháború kitört Magyarország nem volt független. Osztrák-Magyar monarchia volt ennyit azért tanítanak, DE a háború kirobbanásának oka egészen más volt. Ebben az időben Széchenyi belépett a szabad kőműves páholyba több magyar kiválósággal együtt és nagyon keményen kritizálták a szervezetet. Saját magyar pénzt vezettek be (igaz nagyon rövid időre) és hozzáállásuk inspirált másokat is. Az akkori Wartburg, Rotchild ház tagjai összeesküdtek hogy ezt a rájuk nézve \"kártékony\" nemzetet eltakarítsák a föld színéről, ugyanis ha az államok elkezdenek önálló kereskedelmet felépíteni abból a zsiráfoknak nem sok hasznuk lesz, sőt. Az Angolszász-Coburg dinnasztia hatalma és befolyása ekkorra már egész európára kiterjedt. Trianon kérdés még a háború kirobbanása előtt el volt döntve. Érdemes meghallgatni Gróf Aponyi Albert védőbeszédét, melyet több nyelven közölt - viszont ekkor már a többi fél aláírta az egyezményt. Mára bizonyossá vált hogy az ellenségek által beadott dokumentumok nagy része hamisítás volt. (néprajzi térképek, lakossági összeírások..stb) Az első tervek szerint Budapest és 30KM-es körzete maradt volna MO! Lényeg: példátlanul és kegyetlenül megbüntettek egy nemzetet aki a háború idején nem volt független! Ez a történelmi árulás vezetett a második,harmadik és fog vezetni a 4. világháborúhoz. Igen a 4. ami éppen napjainkban is zajlik. 1998 Rendszerváltás? Nem nem csupán egy taktikai lépés hogy mindenki nyugodjon le a .... Azok a politikai erők akik radikális nemzeti érzelmű embereket gyűjtöttek maguk köré csupán egyetlen céljuk volt. Megosztani az embereket, hogy még véletlenül se legyen összefogás és amint lehet el kell fojtani. Magyarországon az \"elit\" okos megfontolt és egy cseppet sem riad vissza attól hogy beáldozzon BÁRKIT az ügyükért. A mai Fidesz tele van volt kommunistákkal, Soros alapítványokon CEO -n keresztül kiképzett politikusokkal. Mit gondoltok emberséget tanítanak itt? (szerintem azt tanulni nem lehet) 2012 elején 3 magyar politikus puccsot hajtott végre a nemzet ellen. Megszüntették a régi poros alkotmányunkat és létrehoztak egy új tákolmányt - mert a népet bizony nem kérdezték meg róla se szavazás se fórum útján. Ha előveszed az igazolványodat az áll rajta hogy magyar köztársaság igaz? Az a nagy büdös igazság hogy jelenleg MO egy bejegyzett cégként üzemel a tőzsdén. Lakói mint árucikkek szerepelnek benne és erőforrásként alkalmazzák őket. (trilateral.org) Nem mi vagyunk egyedül ebben a helyzetben.  A nemzeti fronton pedig jól látszik kezdve a Miéptől a Jobbikig hogy az egy és minden felett álló cél megvalósult. Ezek a pártok rendre lemorzsolódnak. És a többi párttal mi a helyzet? Egy pártot nem a tagjai hanem a vezetősége (vagy a vezetőség mögött álló hatalmi érdek) határoz meg. Ha valaki azt hiszi hogy a rózsadombi paktum egy urban legenda, az sajnos téved. 2 alkalommal is született megállapodás, mely röviden arról szól hogy beszabályozza MO vezetését és kereskedelmi lehetőségét. Szdsz - momentum ez kb egy és ugyanaz a zsidó kereskedő betelepülésekből kinőtt társadalmi réteg és leszármazottai akik jelenleg is tulajdonba tartják például a duna menti vízhasznosítású cégek 90% át, a mezőgazdaság 70% -át. Ezek az embernek nem nevezhető férgek kihasználva lehetőséget felvásárolták a szegény parasztok földjeit és külföldi kézre adták defacto hazát árultak. Ez a mai napig így megy! Ha most egy szimulációt készítünk tulajdonviszony alapján, akkor leesik hogy a jelenlegi országunknak kb 1/3 van magyar tulajdonba. A látszólag nagy káoszból pedig nem sok kivezető út létezik. Tájékozódni kell értékes megbízható embereket magdköré gyűjteni és ezek a kis underground csapatok majd egyszer találkoznak a jövőben és nem kis áldozat árán TALÁN lesz esélye az emberiségnek egy aranykorra. Otthon maradsz lapítasz ez a legtökéletesebb amivel támogatni lehet egy világméretű átállítást. A baj az hogy még mindig nem a JÓ oldalon vagyunk.",
				"added": 1589556956
			}
		]
	},
	"comment_vote": {
		"1_1DTAhpf3ehXs9f3z21gxQ77ddow9NPVtZS": 1
	}
}