{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "新的基督教",
			"body": "我是一个基督徒。我虔诚的信仰上帝，我的主。我体会到 祂在我身上有一个宏大的计划。 祂给我的使命就是重新认识 祂。下面是我对上帝的一些认识：\n1、上帝是 神。或者反过来说：至高无上的 神是唯一的， 祂就是上帝。 神不是人，也不是由人变成的。这一点很重要。为什么呢？因为人，不管他如何修炼，哪怕就是圣人、至人、真人，或者是佛，只要是人，或者由人修炼成的，它都是有局限性的，是会犯错的。比如，释迦摩尼，他必须要先自己修炼成佛，才能去普度众生。在他修炼期间，众生就只好跌进地狱了；而且，万一他修炼失败怎么办？我们是不是可以认为那些当初与释迦牟尼看法不一致的人就是修炼失败了的呢？对这部分人来说，因为他们的错误，不但没有成佛，他们就不能“普度众生”了。佛教如此，道教、儒教也是如此。这意味着：佛教、道教和儒教都不是真正的宗教。因为它们都没有 神。\n2、但是，至高的唯一 神（上帝）是没有属性的。这一点与传统的看法不太一致。我们平时都说 神是大能的，这个“大能”就是 祂的一个属性。一旦 神有了一个属性，他就不是“大能”的了，这个属性就把 祂局限住了。也就是说，如果 祂不具有“大能”的属性， 祂就不是 神。这反而证明了 祂“不是大能的”。因此，我们说， 神是没有属性的， 祂是零属性的。这个宇宙，只有 祂才是零属性的。一切从 祂而来的东西都是有属性的。\n3、因此， 神的任何作为其动机只有 祂自己知道，对 祂而言都是合理的。但对于因 祂而生的宇宙万物而言那就不一定是合理的，也不一定是仁爱的。这些有各种各样属性的万物，一经产生，就会千方百计要生存下去。但他们能否能生存下去，并不由他们自己决定，而是由 神决定。 神的行为也是没有属性的，并不是象人所理解的那样有“好”与“坏”的区分。正因为如此，人类当然希望得到 神的眷顾，所以，不断的祈求 神。这就是我们不断祈求 神的原因。但 神是否眷顾我们，这也不由我们决定，乃是由 神自己决定的。\n4、所以，人类的一切善行（祈祷、和平、合作、文明）都是为了取悦 神。\n基于上面的认识，我认为应该强化基督教的教条。有这样一些：\n1、必须信仰一位唯一的至高 神。 祂没有属性。任何语言不能描述 祂。我们之所以要描述 祂，是要传播\n 祂。但是我们必须要明白：我们的语言所描述的部分不及 祂的无穷小。\n2、 神既可以爱我们，也可以灭我们。因此，信徒必须时时事事祈求祷告 神。求 祂的宽恕。\n3、而最重要的是信徒只能行善。而善不仅是有利于自己的那些行为，也是有利于教友的那些行为。\n4、因此，必须与不利于自己和教友的行为进行抗争。\n5、最大的善就是独立。你必须独立，你不得依附任何人或组织，就是你所信赖的宗教组织也不可以。你唯一的依附就是 神。\n6、除 神以外，你只能依靠你自己。为了达成你自己的善良意愿，你必须学会与别人真诚合作。你不得欺骗任何人。\n7、要善待那些欺凌、践踏你的人，除非他们要剥夺你的生命。\n8、追求更好的生活是你生存下去的原动力，这是 神的应许。",
			"added": 1517327424
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"11_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a": [
			{
				"comment_id": 1,
				"body": "不知道在哪里发主题帖。",
				"added": 1517216788
			}
		],
		"9_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 2,
				"body": "真是可怕。每次失窃，都会造成币市雪崩。",
				"added": 1517216880
			}
		],
		"1_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 3,
				"body": "注册的时候，没叫输入密码呀。可是很多地方又要求输入秘钥。什么意思啊？",
				"added": 1517217091
			}
		],
		"22_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": [
			{
				"comment_id": 4,
				"body": "这是肯定的。因为你要去攻击别人，你得先下载他的站点，你就做了备份了他的站点，帮助他传播。所以，攻击行为就变成了传播行为。这设计好棒。",
				"added": 1517298044
			}
		],
		"13_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a": [
			{
				"comment_id": 5,
				"body": "解锁是什么意思？为什么要解锁？",
				"added": 1517298126
			}
		],
		"1_1PTdwLV4gpQNjfhnBnAnofWASpheKEFHbL": [
			{
				"comment_id": 6,
				"body": "零网中会不会形成一种新的宗教呢？比如就叫“零教”。",
				"added": 1517327527
			}
		]
	},
	"comment_vote": {}
}