{
	"next_topic_id": 21,
	"topic": [
		{
			"topic_id": 1615362040,
			"title": "Which country in your opinion will NOT fall for the vaxxnazi certificate of vaxx id aka COVID?",
			"body": "I am curious. I have heard that the poorer a country is the higher the risk the gov surrender to bribe and or financial black mail! what do you think? where do you place your bets? I think it must be more than the leadership, aka a whole belief in freedom and specially medical freedom in the whole population.\n\nthose fucking vaxxnazis... progressing fast.",
			"added": 1615362039
		},
		{
			"topic_id": 1615362255,
			"title": "Do you think sunni muslim leaders prefer their wealth or islam?",
			"body": "if they are faced with renouncing islam, but in exchange can keep for a while their wealth, what do you think they will chose? I believe the shias won't surrender islam, what ever the cost, as the reward is heaven.",
			"added": 1615362253
		},
		{
			"topic_id": 1615363797,
			"title": "PLEASE HELP - I would like to send flowers to Stephanie Ruhle (MSNBC anchor)",
			"body": "I am such a fan :). How should I proceed? which are the best websites or darknets to have an accurate location of her home: I wouldn't want those flowers to be stolen by a dishonest coworker...",
			"added": 1615363794
		},
		{
			"topic_id": 1615436371,
			"title": "What the fuck is going on with the germans neonazis?",
			"body": "I mean :\n\n1 they love to see rapefugee rape german kids.\n2 they censor worst than the stasi or ss.\n3 they have moved from the naziman to the euman (what will be next ?!?)\n\nall of this isn't bad... 4. is where the unforgivable crime happened, the one there is no way back, the one leading to war... the one which will paid in blood and mass murder...\n\n4 they have supported the election theft, the steal, from pedotrump (2 arrests, accosta, barr).\n\nso the question is simple, why the fuck the nazileadership is attacking AGAIN our great country and leader? maybe the only solution was always a satan 2 over berlin? maybe.",
			"added": 1615436367
		},
		{
			"topic_id": 1615440077,
			"title": "Would you bet that when Kate Middletown use her dildo she dreams of Julian Assange?",
			"body": "that would explain why the pedomonarchy jailed him and not the countless childrapists swarming the uk... \n\nI love to see the propagandists of the west carrying the \"press\" flag having not a word for Julian... what a bunch of traitors, I hope they will be rounded up and executed in the KLS 2.0.",
			"added": 1615440072
		},
		{
			"topic_id": 1615440257,
			"title": "What do you think of PRC (People Republic of China) new covidvaxx certificate?",
			"body": "I fully support to mark and be able to track the mutants ! However I am against restricting the liberties of the natural human beings using such a ploy as a vaxxnaziausweise to creep on our liberties to jail us in our homes !!! that's terrorism and a cause for transition.\n\nWill see how things evolve. At least PRC doesn't lie (and doesn't rape kids officially and legally on childraperesorts across china).",
			"added": 1615440251
		},
		{
			"topic_id": 1615440461,
			"title": "Wall street financing People Libertation Army of China (PLA) ?",
			"body": "What do you think of such morons low iq child rapists censors wanna be feodalists behaviors regarding financing PLA? It makes me laugh how stupid they are, that's not news, otherwise they wouldn't need to be constantly be bailed out and rule over a pile of debt and hollowed out domestic production basis.\n\nWhat surprise me is how dumb the american counter intelligence is ! they let american children be used as sexrapechild for the bailed... I mean... it's beyond abomination. \n\nDo you think obama used white girls in voodoo sacrifices? I do.",
			"added": 1615440454
		},
		{
			"topic_id": 1615441502,
			"title": "Medical Challenge : taking 30gr of vit. C. in a day !",
			"body": "Have you ever tried?",
			"added": 1615441494
		},
		{
			"topic_id": 1615441735,
			"title": "Viktor Orban : the pedochildraping whitegenociding west hates him.",
			"body": "so I guess they only see his eventual shady dealings with his buddies? I guess merkel and co want a cut of the loot and more importantly to destroy ALL white nations? So they bash him constantly. However by having bought a nuke plant from Vladimir, he can simply shit on the western traitors. And I guess even if corrupt the money stay in his country or does it goes to various sunny heavens? It seems the tax reform in this country are moving in the right direction. I guess some socialuseless workers are whining (think the fat lesbians at DMV refusing to digitalize).",
			"added": 1615441726
		},
		{
			"topic_id": 1615442560,
			"title": "A proof of american future will be the official execution of sean hannity",
			"body": "one of the top pedo protectors. executed with his whole family... if america wants a future... happily we have a far wider world where little shit like citadel and his front don't rule the floors...",
			"added": 1615442550
		},
		{
			"topic_id": 1615443698,
			"title": "When will turkey retreat from it's occupation of syrian territory?",
			"body": "Will it be peaceful or confrontational? the future will tell...",
			"added": 1615443687
		},
		{
			"topic_id": 1615443846,
			"title": "Why Italy could get sputnick V while the slovaks are being gays?",
			"body": "I guess it went like this : Mario was informed of covaxx... they said it worked. okay fine.... the pedos at bruxelles got all mad... and then bruxelles was reminded that \"black hands\" of \"our cause\" believes in liberty. Bruxelles folded. rightly so. meanwhile at slovak hq, they banged some chicks after american troops... lowlives.",
			"added": 1615443834
		},
		{
			"topic_id": 1615443938,
			"title": "What is for you the legal age for a male or female to prostitute him/herself?",
			"body": "I think 18 is way to young... I would say 25, but would settle at 21. I mean give them a chance at least to mothers and wives before entering the sex trade. IMHO. and you? opinions? What shocks me is the spread of the pedochildsexslavery west wide. their real values applied and exposed.",
			"added": 1615443925
		},
		{
			"topic_id": 1615444288,
			"title": "California teachers are right to not want to go back to school : biden is preparing a false flag aka mass shooting in a us school...",
			"body": "that's a given, the only real question is when ! the pedo feodalists occupying the usa, fear arms dads... how to rape kids safely otherwise? so they will attack, very soon... and I guess california is a nice place for nancy the thief and all the gang to try to take A2, afterall they destroyed A1 in their digital goolags.",
			"added": 1615444274
		},
		{
			"topic_id": 1615445021,
			"title": "I would find super fun to dissapear all cnn personals in hk...",
			"body": "They all work for the pedochildrapists bosses of Julie Eadeh.",
			"added": 1615445006
		},
		{
			"topic_id": 1615446906,
			"title": "Cult of LGBTQ is \"a gateway drug\" to pedophilia",
			"body": "100% agreed ! to the KLS (for the E program).",
			"added": 1615446889
		},
		{
			"topic_id": 1615449081,
			"title": "Rating the Unified Military of Myanmar (UMM)",
			"body": "I think it is going badly. \n\nThe UMM couldn't pivot the cia lead protests into something peaceful. \n\nFurthermore by cutting the internet, all opponents are now using cia deployed tech (satellite based, or mesh networks (wifi,bluetooth etc).\n\nThen An san suki, should be executed. It's not because she supporter the block of the bengladeshi invasion (so called roheengas) that she is a patriot.\n\ndo you think the cia will succeed in overthrowing the UMM and gain a better acces to China southern frontier to foment trouble, ruins and rapes?",
			"added": 1615449063
		},
		{
			"topic_id": 1615458168,
			"title": "Brazil : should Bolsonaro kill lula?",
			"body": "It is still sad, that both are overlording over the destruction of the Amazon Primitive Rain Forest.\n\nHowever at least Bolsonaro isn't a pedoleftists. kill leftist = good, or live in Ruins.\n\nLula is a bitch of the UNO / global agenda > die !",
			"added": 1615458149
		},
		{
			"topic_id": 1615468688,
			"title": "Not a single HK resident was killed by the HK police during the massive ultra violent riots supported by the CIA, Mi6 and western \"press\"",
			"body": "meanwhile, I look in the so called free and democratic west (where kids are raped with impunity by the petit bourgeoisie) and can only get very angry... very.\n\nRIP Ashli Babbitt\n\nmeanwhile a man like george flyod who https://www.snopes.com/news/2020/06/12/george-floyd-criminal-record/\n\nand I know that the american of african descents were really happy and supported the rapes of white girls on little st. james...\n\nno need to talk about their knock out game and others so called reparation scams and drive to white genocide and raid america...\n\nbut of course white peons taken over by 501 (c) (3) whose preachers are full on board the pedotrains don't have anymore what it takes to be free ever again.\n\n(https://time.com/5729279/hong-kong-protest-death-xi-jinping/)",
			"added": 1615468668
		}
	],
	"topic_vote": {
		"1615362040_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": 1,
		"1615445021_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": 1
	},
	"next_comment_id": 36,
	"comment": {
		"1615336195_15UpNdGVLEKZdVuQqTdmRWrHzeELTHbwmi": [
			{
				"comment_id": 1,
				"body": "no pics allowed?",
				"added": 1615359802
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 2,
				"body": "> [anonysan](#comment_25_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): No, he's the leader of a mafia state he inherited during the chaos of the Yeltsin administration. If you worship Putin because you want \"fuck america\" points and hate the US government, you're a fucking moron. Lots of complaints about the government here are made by Russians against the Putin government as well (shit tier foreign policy, elitism, political corruption, etc.)\n\nThis is an interesting opinion. I support free speech and the exchange of all opinions, specially those I disagree with. How otherwise learn and discover new things?\n\nWhy do I disagree with you?\n\n1. Putin and the Kremlin, aka the whole russian real leadership is against the white genocide / depopulation agenda / population replacement / guidestone agenda. For an obvious and simple mathematical reason : russia is the largest land mass on earth, and the one with the lowest population density. There is no will nor will be, from the Kremlin to reduce the russian population. \n\nFor me, this, in itself, is already mighty of worthy respect and support.\n\n2. I understand your frustration to have lost control of the assets and rape rights you got during the Yeltsin years. \n\n3. there are real reason to hate the us gov and the people occupied by it. From constant wars, to occupation, to the white genocide, support for guidestone agenda, the multiple bioweapon release, the fiat scam and of course the constant censorship.\n\n4. finally, the leader of the russian mafia... did you know the word mafia means equally family? who do you want to lead the russian people? a trump : a whimp who fucked kids with epstein and who allowed gmo, made his son his laws more money than cresus and who got cheated from the election, censored and banned from so called censoredmedias, who did nothing to prevent and destroy the enemies of mankind? remember LOCK HER UP?\n\nno, she got the cctv tapes of epstein, so trump was a very docile kitty... among the ruling class... and he was betrayed.\n\nso total noob...\n\nWe want the best to lead russia. Putin fits the role better than expected. you may disagree, see you on the front lines... real with real live ammunitions, like Satan2.\n\ngl and hf.",
				"added": 1615361156
			},
			{
				"comment_id": 10,
				"body": "Glory to the Motherslands, Glory to it's Glorious leader !",
				"added": 1615436055
			},
			{
				"comment_id": 11,
				"body": "and now therapeutics... SU research laid serious foundation to build upon ! the future belongs to us.",
				"added": 1615440524
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 3,
				"body": "> [dingleberry](#comment_2_1JAn6MYwzZFPfg9cQ8Y6j1vUHVmr5hvXLM): t sounds like a bad idea. Sure, I don't watch those underqualified news anchors, but either way, creating a kill list is not a good. If anything, we should engage them in the free exercise of debate, not murder. Minds will not change if people are killed because of the script they are given to read. Understand the people who write the stories as CNN are not the same people as the eye candy they have on camera. Even the writers are told what to write by management, which is dictated by the DNC and other left wing extreme organizations in the propaganda machine.\n\n1. I agree that the OP chose a bad title... it should have been something like : how to send flowers to cnn personals ? aka how to get their home addresses. it would have been way more politically correct.\n\n2. there is no way to enegae in free exercise of debate. they censor, they ignore, they DOXX, they wage war. so you want to talk with hitler? what will you tell him? cnn are worst.\n\n3. we don't need to change the minds of the enemies, just killing them is enough.\n\n4. once enough are killed, they will refuse to read the script. I think it's the whole point of the OP.\n\n5. cnn people are on avg quite ugly, lying make such to man.\n\n6. once none will dare to spew the lies, because of death squad, order will be restored.\n\n7. the DNC and so called squad is just a decoy, meanwhile white genocide, population replacement, UNO /global agenda world gov setting up.\n\n8.you aren't dumb enough to believe in the kabuki theater? the right/left Hegelian dialectic? poor you...\n\n> [styromaniac](#comment_3020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That I'll do. Meanwhile, I'll watch your activity disappear, as you might end up in questioning.\n\nit's them or us. no middle ground possible. they don't want the USC and BoR. there is nothing else to say. it just that a lot of Brass at the MIIC (military industrial and intelligence complex) have betrayed too.\n\n> [5h1n1n9d4rkn355](#comment_3_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): Murder and suicide lead only to missed learned opportunities. [...]\n\nI wait for your lecture to hitler, maybe you can propose one here on a dedicated post... at least try to prove us your point. I can't wait for the lulz... plz don't kill the jews? lol.\n\n\n\n> [anonysan](#comment_23_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): These people don't want to debate you, they want to get rid of your right to disagree with them. You think these people live my a moral and ethic code? They've killed countless of millions of people around the globe with their lying and only serve to do further damage to our people and our civilization should their activities presist, they don't give a flying fuck about ethics and playing fair. These people want you broke, dead, your kids raped and brainwashed, and they think it's funny. There is no 'rank and file\" in the media, even the lowest staff of these publications that write dogshit editorial pieces nobody wants to read, want anyone who doesn't think like them to live in a world of misery until they submit and conform to their ideology. The modern world we live in is the most nightmarish combination of Brave New World and 1984 all wrapped into one package.\n\nexactly. they even fear to debate us ! they fear that the mass of sheeple in trance wake up and join us in the hunt. \n\napplauze ! upvoted ! great post ! thank you, sad we disagree on Putin :).\n\n> [anonysan](#comment_24_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): The tables are ALREADY set against you, don't you fucking get it? The boiling frog effect only works if the temperature is slowly turned up over time, our only option out is to accelerate the chaos. In other words, we must force the chef boiling the frog in the pot to frantically turn up the temperature so the frog realizes he's being cooked alive and reacts accordingly. Make sense? Now I myself do not plan on participating in this should some media personalities get killed but I'm not gonna act like these motherfuckers don't have it coming. This is what happens when you tell people that they will own nothing, have no privacy, live at the whims of the state and the ruling class, and be perfectly happy with it.\n\ngreat post ! me neither, I prefer to nuke.\n\n> [5h1n1n9d4rkn355](#comment_4_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): then you are lost.\n\nwrong you are, and of course, you fear us... your kiddies are next (remember in nuking, contrary to target assassination, no need to hunt them in their heavy league schools... gone.\n\n>> [baconboi](#comment_6_1KBserDE8oownu1aR5REHcC3jf9qNkmQDo): You can literally google \"CNN HQ\" you retard tier glownigger. It's in Atlanta.\n\nthey are spread... nyc, la, london... each single one of them. we don't need their work addresses... it's just to send flowers, for their funerals :).\n\n> [edgelordofdecent](#comment_805_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): So you guys are going to dress up like some kid at the renusance fair and yell cringy slogans in front of their house and you use kill list as an expression? Whatever you want to do with your time I guess instead of finding a job or a decent hobby.  [...]\n\nno, nuking... faster, cleaner, safer and makes better visual frame ! specially the little white dots :).\nWhat they can take from you, you don't and never have owned.\n\n\n> [anonysan](#comment_26_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): no YOU are lost if you think you can vote and protest your way out of the great reset\n\n100% true ! illusion for them to gain time.\n\n> [5h1n1n9d4rkn355](#comment_5_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): who said anything about voting. [...]\n\nnuke first, no retaliation !\n\n> [thebigbadchile55](#comment_1_16d7d6T1vC4u5cwf24Vf7Ct6w1ZkXRZvk): \"kill all my political opponents\" screw off man.\n\nyou understand what is a REPUBLIC? anyway...\n\nthanks for all your post ! could maybe the OP change the title? like How to send flower to cnn personals without their home address? it's very pc. gays like flowers.",
				"added": 1615361918
			},
			{
				"comment_id": 4,
				"body": "pleased don't forget to setup your zmail. thanks.\nhttp://127.0.0.1:43110/Mail.ZeroNetwork.bit/",
				"added": 1615362326
			},
			{
				"comment_id": 7,
				"body": "FYI those kill lists will be dispatched officially to american troops, hunting down traitors (domestic enemies) is part of the job. C U Soon.",
				"added": 1615435686
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 5,
				"body": "\"Coronavirus vaccine deaths aren't covered by life insurance because jabs are \"experimental medical intervention\"\"\n\nhttp://natural3jytxrhh5wqmpcz67yumyptr7pn2c52hppvn3vanmqzjlkryd.onion/2021-03-09-coronavirus-vaccine-deaths-life-insurance.html",
				"added": 1615363381
			}
		],
		"1615237176_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_250_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I think no one is justified in killing anyone. I'm sure there are people who disagree to a large enough degree with your politics to hunt you down. Aren't you glad they can't or don't do that?\n\nso you think pedophilia is just a political thing? no worry... drones carry more than one hellfire...",
				"added": 1615435613
			}
		],
		"1615363797_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 8,
				"body": "> [anonymouslogin](#comment_244_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X):  Sending them to her home would be creepy and menacing, hopefully not a gesture you intend to convey by sending them in the first place.\n\nI like the reference to hypergamie/female antropological studies :).\n\nNo, I don't have the time... if I did it would be to her extermination camp, for the lulz, if I have the time :). \n\nI prefer to nuke, who doesn't ?\n\n> [bigbadbob](#comment_1253_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Who the fuck is Stephanie Ruhle?\n\none among 100's of thousand who has betrayed. her husband is one of those constantly bailed out. she is a propagandist for the DE.",
				"added": 1615435750
			},
			{
				"comment_id": 14,
				"body": "Stephanie Rulhe (Hubbard) worth over $2,497,789... but due to her extensive criminal past, I wouldn't exclude some stash well hidden... \n\nTreason is a lucrative business...\n\nps it wasn't hard... I just hadn't the time earlier and for free :).",
				"added": 1615441325
			}
		],
		"1615362040_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 9,
				"body": "> [anonymouslogin](#comment_246_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I think it will be a country conquered by US imperialism recently, populated by intelligent people. Possibilities? Iran or Iraq.\n\nIt's an interesting take. You mean the native people there will be less like sheep? It's true that no one can deny a fair resistance to american invasion troops in those countries... \n\n> [diurpagissa](#comment_68_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): Tanzania!\n\nWhy? Tell us more? Are you from there?\n\n\n> [randname666](#comment_48_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): \"medical freedom\" ? Tbh I don't really get it. The freedom to refuse medication and keep yourself in illness or potental dying risk ?\n\nthanks for your question. it asks : are you the propriety of a state or uno etc or your own. who does own your body, as such what goes in, and what goes out of it? for example slaves in the plantations could be forced chained, or forced \"medicalized\", like the jews in the KLS.\n\nyou have to remove \"morals\" or \"ethics\" and move to math. Is it your body? yes or no? \n\nproof : can you do an abortion? can you use plants of the creation? etc. the reverse works too : can you keep the baby? can you refuse to take plants or etc.\n\nSee?\n\nso when someone come before you with \"morals\" or \"ethics\": shot. it lies and it's a thing.\n\n",
				"added": 1615435985
			},
			{
				"comment_id": 26,
				"body": "https://www.theguardian.com/world/2021/mar/10/tanzania-missing-president-kenya-covid-says-opposition-leader\n\nI dream to visit Tanzania... is it safe for prone to sunburns? Can you use plants of the creation legally there (like cannabis, opiates or coca leaves and extracts)?\n\n> [randname666](#comment_50_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): Who owns the army owns you because they can \"confiscate\" you by a bullet in head.  [...]\n\nhappily there isn't one army yet in the world :).\n\n> [randname666](#comment_50_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): They are just tools for profit.\n\nno, if only. depopulation, white genocide, installment and continuation of neo feodalism, legalizing childrape etc.",
				"added": 1615449584
			},
			{
				"comment_id": 28,
				"body": "> [anonymouslogin](#comment_256_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): It isn't the people's fault that Iraq has the oil, and Iran the natural gas reserves that the US craves relentlessly, however Saddam, like Castro was trying to look out for his people's best interest in the face of the global gorilla the US is, and the people were aware enough to support them. \n\nLoL, I kill lefists, and then I force them to eat their own children. That being said let's review what a fucking sodomite child rapists like you defend :\n\n1 https://www.rockyroadtravel.com/saddam-hussein-palace/\n\n> It's estimated that Iraqi dictator Saddam Hussein built 8o - 100 palaces during his 24 year reign. Billions of dollars were spent on lavish structures with gold and marble fittings - no expense was spared. They were seen as an expression of his power and authority over Iraq.\n\nI guess it's normal for a leftists that the leadership lives like that, isn't it? When do you plan to cease Nancy Pelosi assets ilegally earned (aka legally but through her \"political career\" using her husband like joe is bro)?\n\n2 https://www.miamiherald.com/news/nation-world/world/americas/cuba/article223928565.html\n\n>Vacations on the Maya Riviera. A visit to the Basilica of the Sacred Family in Barcelona. A BMW. Expensive meals and a tour aboard a yacht. Those are some of the photos shared by Tony Castro ...\n\nor : https://nypost.com/2015/05/10/inside-fidel-castros-luxurious-life-on-his-secret-island-getaway/\n\nDon't worry, with the iranians we think you are and will always be a kuffars lead by corrupt bitches and pedogays.\n\nnext :\n\n> [anonymouslogin](#comment_256_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Most people in the US are clueless, content to consume and not ask questions. Further down in the post, the question; is it your body or not? No, absolutely not. You can't even take your own life legally, the state wants your body on the production treadmill.\n\nOn that we agree, however I hope you conclude too that it's very hard to prevent someone from killing himself, like even Jeffrey Epstein in his jail cell where he is the only jailmate to have suicided in the last 20 years.\n\nIf only all sodomite leftists from the rape&lootDemonNC (DNC) and pedoRINOs weren't all hell bent on censorship, things could improve. the treadmill is steep, unless you rape kids with bill clinton.",
				"added": 1615457006
			}
		],
		"1615243619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_249_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Believe what you want, but when you gather in some compound and menace or harm people with different beliefs or attributes you deserve the attention you get from LEA. This article is reasonable, thank you Styromaniac!\n\nwhen those people have commited treason, they will be hunted down and killed like rabbid animal. sad to know that you are one of them :).\n\n> [scotcyguy2](#comment_82_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): This labeling of everyone not in a certain narrow way of thinking as \"far-right\" really has to stop...it's getting beyond ridiculous...is there far right people around, sure, but it's a small group of people that have a weird kind of \"the jooooos did it\" tourettes...most people aren't extremists and by labeling large groups of the public Commies/Far Right we are in fact pushing people towards these gorups\n\n\nonly way is to kill them. start with dorsey... war 101. but modern americans sucks at it. weak minds and coward spirits.",
				"added": 1615440618
			},
			{
				"comment_id": 30,
				"body": "> [anonymouslogin](#comment_258_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): snip\n\nyou = MAP.\n\naka go die pedoleftistsrinosucker.\n\nyou will be executed for treason, anyway.",
				"added": 1615457456
			}
		],
		"1598242145_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 13,
				"body": "the cia has a serious pedo infiltration to clear. I don't think it's possible anymore. the spread of the pedocreep is already too advanced. only termination of all former and current employees could solve the situation.",
				"added": 1615440775
			}
		],
		"1615442560_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 15,
				"body": "he wears the pins of the enemies of mankind.",
				"added": 1615442583
			}
		],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 16,
				"body": "> [anonymouslogin](#comment_252_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Shouldn't publishing continue though? The books, like so many others need to be taken in the context of the time they were written. Add a disclaimer to the first page of the book...\"this book was written in 1926, a time when social understandings of race and culture was different from understandings in this year of publishing......blah blah....proceed at your own risk.....blah and enjoyment....blah blah....\"\n\nwhat the fuck publish the original, like mein kampf ! who cares... free speech or not? you start with one book, you end up with all books.",
				"added": 1615444007
			},
			{
				"comment_id": 34,
				"body": "silicon valley is a cartel, it behaves as one entity. who really controls it is the real question...",
				"added": 1615556034
			}
		],
		"1615440077_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 17,
				"body": "How to liberate Julian Assange from the pedodungeon hands? My bet, is first a capture of the 3 kings inline, for their own safety ! then, with this ransom start to ask. they will fold. \n\nbut assange was such an idiot to go to such a poor low iq country embassy. just for that he deserves it. Secondly, I hate all the assange and co non violence movement. how do you stop the nazis? by pleading and exposing them? just lol.",
				"added": 1615444128
			}
		],
		"1615444288_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 18,
				"body": "I even bet that the cia/fbi/doj are involved in necrochildrape... aka raping dead kids. they are so wicked... it's even beyond beliefs.",
				"added": 1615444376
			}
		],
		"1615441735_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 19,
				"body": "When does the countdown to meltdown starts?",
				"added": 1615445034
			}
		],
		"1578088043_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 20,
				"body": "http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/\n\na little up !\n\nthe search function is solid.",
				"added": 1615445195
			}
		],
		"1615441502_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 21,
				"body": "It's seem a lot :). Curious so they say it's 4h to vit. c. purge... or more exactly what is the avg vit. c elimination rate? I mean does the body eliminates (uses) as fast 500mg or 30gr? IDK.\n\n> [svvarog](#comment_3_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY):  Prepare for detox effect.\n\nWhat are you referring to? Personal feedback/experience/witness? ",
				"added": 1615446328
			},
			{
				"comment_id": 29,
				"body": "> [anonymouslogin](#comment_257_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Linus Pauling famously took 4 grams of vitamin C every day. He lived to a fairly normal age, I think there isn't any real benefit, your body processes the excess citric acid, balances your pH levels the same way it otherwise would and all of that vitamin goes right into the toilet in your urine. There could be some placebo effect if you truly believe you are doing yourself some good, the power of perception is very real.\n\nyou are speaking about chronic use. Here, we are trying to discuss a punctual over-doses. Let's stabilize our knowledge on this before moving on to the chronic use side-effects. thank you, focus.",
				"added": 1615457410
			}
		],
		"1615443698_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 22,
				"body": "hehehe ! at least, it's clear! I like that ! what are the Syrians saying? did they agree?",
				"added": 1615446750
			},
			{
				"comment_id": 23,
				"body": "Is there a special tax rate to invest in new turkey?",
				"added": 1615446976
			}
		],
		"1615446906_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 24,
				"body": "What do REAL muslims do with the corpses of the pedophiliac agents (LGBTQ) when they splash below the buildings where they are thrown into the void? serious question... I would prefer to touch a bleeding, but heathly pig (be aware some are biological time bombs, those treated worst than KLS legal residents)!!!",
				"added": 1615447162
			},
			{
				"comment_id": 25,
				"body": "> [randname666](#comment_49_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): LGBTQ itself is probably cult but that leads to pedophilia ? I don't get it.\n\nPlease find more information below :\n\n>\"Minor Attracted Persons,\" or MAPs, using its platform as well – MAPs being a euphemism for pedophiles. If you are sick and perverted, in other words, then Twitter is for you. If you have moral values, on the other hand, then anything you say on Twitter will violate its terms of service, resulting in your eventual expulsion. Twitter actually amended its terms of service to condone pedophilia and child rape as mere additions to the LGBTQ \"rainbow\" of \"inclusion.\" \"Discussions related to child sexual exploitation as a phenomenon or attraction towards minors are permitted,\" Twitter's terms now read.\n\nand more : \n\n>Twitter also condones and supports \"artistic depictions of nude minors,\" so long as they are \"works by internationally renowned artists that feature minors.\" This presumably includes celebrities, politicians and other wealthy elite who do not have to abide by the same rules as the peons. Dr. James Cantor, a proud Jewish homosexual, is credited with implementing Twitter's pro-pedo policies. He is a notoriously outspoken advocate for pedophilia and self-identifies as a \"minor-attracted person.\" \"It's a vile platform and it's probably best that I'm not on it,\" Witzke added about Twitter and the filth that lives there. \"Twitter is the new pedophile hangout. It's the new pedophile-sympathizer platform.\" \"They called us crazy 10 years ago when we spoke of the slippery slope, and now we can't even speak out against the LGBT agenda,\" she added. \"The whole end goal was pedophilia, and that's where we are today. And we are losing because Republicans are silent,\" adding that the Cult of LGBT is merely \"a gateway drug to pedophilia.\" More related news about Twitter can be found at Evil.news. Sources for this article include: BigLeaguePolitics.com NaturalNews.com\n\nhttp://natural3jytxrhh5wqmpcz67yumyptr7pn2c52hppvn3vanmqzjlkryd.onion/2021-03-10-twitter-directly-enabling-pedophiles-banning-detractors.html\n\nanything else to add? yes that this dr james cantor isn't jewish anymore. What is the Talmud / Torah / rabinical law saying about those sodomites? I think they are still right...\n\nMAPs > KLS > VIP lane to the E program > end.",
				"added": 1615449329
			},
			{
				"comment_id": 27,
				"body": "from : https://help.twitter.com/en/rules-and-policies/sexual-exploitation-policy\n\nChild sexual exploitation policy\nOverview\n\nOctober 2020\n\nWe have a zero-tolerance child sexual exploitation policy on Twitter.\n\nTwitter has zero tolerance towards any material that features or promotes child sexual exploitation, one of the most serious violations of the Twitter Rules. This may include media, text, illustrated, or computer-generated images. Regardless of the intent, viewing, sharing, or linking to child sexual exploitation material contributes to the re-victimization of the depicted children. This also applies to content that may further contribute to victimization of children through the promotion or glorification of child sexual exploitation. For the purposes of this policy, a minor is any person under the age of 18. \nWhat is in violation of this policy?\n\nAny content that depicts or promotes child sexual exploitation including, but not limited to: \n\n- visual depictions of a child engaging in sexually explicit or sexually suggestive acts;\n- illustrated, computer-generated or other forms of realistic depictions of a human child in a sexually explicit context, or engaging in sexually explicit acts; \n- sexualized commentaries about or directed at a known or unknown minor; and\n- links to third-party sites that host child sexual exploitation material.\n\nThe following behaviors are also not permitted: \n\n- sharing fantasies about or promoting engagement in child sexual exploitation;\n- expressing a desire to obtain materials that feature child sexual exploitation;\n- recruiting, advertising or expressing an interest in a commercial sex act involving a child, or in harboring and/or transporting a child for sexual purposes;\n- sending sexually explicit media to a child;\n- engaging or trying to engage a child in a sexually explicit conversation;\n- trying to obtain sexually explicit media from a child or trying to engage a child in sexual activity  through blackmail or other incentives;\n- identifying alleged victims of childhood sexual exploitation by name or image; and\n    promoting or normalizing sexual attraction to minors as a form of identity or sexual orientation. \n\nWhat is not a violation of this policy?\n\n- Discussions related to child sexual exploitation are permitted, provided they don’t normalise, promote or glorify child sexual exploitation in any way;\n- Conversations about help-seeking behaviour of individuals who may struggle with an attraction to minors;\n- Advocacy against illegal or harmful activity involving minors provided there is no sharing of, or linking to any material featuring child sexual exploitation; and\n- Depictions of nude minors in a non-sexualized context or setting may be permitted in a limited number of scenarios (e.g., art works by internationally renowned artists that feature minors, news media reportage, media created and shared for scientific or educational purposes).",
				"added": 1615449904
			}
		],
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 31,
				"body": "> [reflektion](#comment_3_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): This year has shown us all the government love nothing more than to have complete control and people are willing to blindly follow the rules they set.\n\nThe US and UK govs have provably supported child rapists for years (epstein, jimmy saville and ALL their associates), so what are you expecting?\n\n> [scotcyguy2](#comment_83_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): yea...I expect if from the government...but I have to admit the large number of people happily prepared to surrender all their basic human rights has really disappointed me\n\nWho proves you that they were humans in the first place? \n\n>Matthew 7:15 “Beware of false prophets, who come to you in sheep’s clothing but inwardly are ravenous wolves.\n\nthere is a nice one in the quran too, but sadly the false prophets of the silicon valley do their job to make search results hard to find.\n\nMany forget the Nuremberg code (https://www.pbs.org/newshour/science/how-the-nazis-defense-of-just-following-orders-plays-out-in-the-mind) and Helsinki declaration.\n\nDue to the threat of mandatory vaxx / vaxxnazipass, I am not surprised that my stress level, cortisone saturation derived from pedochildrapists supported by fox news like donald j trump and mr alan dershowitz, which I hope to execute with such a brutality, very soon... but fully legally...",
				"added": 1615468086
			}
		],
		"1615458168_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 32,
				"body": "> [5h1n1n9d4rkn355](#comment_6_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): What's with the killing? Are we so weak-minded on this planet that the only way to resolve a conflict is through killing?\n\ntraitors (UNO / global agenda), corrupts and pedophiliac all oppose death penalty, curious isn't it?\n\nHow do you resolve a conflict with the FBI / CIA / DOJ / DOD who have for years and to this day protected child rapists, epstein/pedogate = 2 arrests or with Hitler... a little hitler... or the fucking invader on the Gaza DMZ using children as human shield?\n\nplease, you who pretend to have the moral high ground, please...  I see only one path for your kind : death.\n\nFYI : https://www.loc.gov/rr/frd/Military_Law/pdf/procedure_dec-1947.pdf and\nhttps://uscode.house.gov/view.xhtml?path=%2Fprelim%40title18%2Fpart1%2Fchapter115&edition=prelim\n\nand as for you CNN is GOD : https://www.cnn.com/2013/07/28/justice/military-execution-soldier-profile/index.html\n",
				"added": 1615468216
			}
		],
		"1615548817_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg": [
			{
				"comment_id": 33,
				"body": "Oath Defenders? Oath Protectors? Oath Loyalists? Oath vets ? Oath pro? who cares... the spirit first but pedogen honoré is aiming serving feinstein and the UNO / global agenda against arms for civilians...",
				"added": 1615550837
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 35,
				"body": "cloud = pigeons",
				"added": 1615556117
			}
		]
	},
	"comment_vote": {
		"24_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"23_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"21_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"4_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": 1
	}
}