{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "O papel do Estado na economia: crítica à escola austríaca",
			"body": "\"O Estado mínimo, como defende esta escola, significa, na verdade, oposição às políticas de direitos e garantias sociais. O capitalismo darwinista não faz política social, quem faz política social é o Estado\". O comentário é de Juliano Giassi Goularti, doutorando do Instituto de Economia da Unicamp, em artigo publicado por Brasil Debate, 05-07-2015.\n\n#Eis o artigo.\n\nPartindo do nível de abstração teórico e dentro do princípio da liberdade de expressão e da democracia, pretendemos neste artigo nos contrapor à [escola austríaca](https://web.archive.org/web/20190404130221/http://www.ihu.unisinos.br/noticias/527830-o-que-ha-de-novo-na-qdireitaq). Dado a limitação de espaço, refutaremos um ponto da escola: o papel do Estado e da autoridade monetária (Banco Central).\n\nNo entendimento da escola, a intervenção do Estado prejudica o conjunto das relações econômicas, por isso defende o laissez-faire. No seu conjunto, as intervenções são vistas como uma prática equivocada, perniciosa e trazem danos e consequências desastrosas. O Estado mínimo é condição essencial para florescer o “espírito capitalista”, prevalecendo a radicalização da crença smithiana da mão invisível, na capacidade autorreguladora do mercado e na crença da lei de Say. Logo, “quem pede maior intervenção estatal está, em última análise, pedindo mais compulsão e menos liberdade”.\n\nPartindo desta defesa, a postura da escola quanto a não intervenção do Estado é muito mais aguerrida do que os próprios clássicos. Em última instância, há por detrás deste espírito a visão de que a espada do Leviatã é uma arma opressora que apunhala as liberdades individuais. Estaria a escola defendendo o estado de natureza hobbesiano, um estado de guerra permanente de todos contra todos?\n\nNeste debate, [Ludwig von Mises](https://web.archive.org/web/20190805043328/http://www.ihu.unisinos.br/noticias/553607-mais-mises-menos-direitos) dá uma atenção especial à atividade bancária. A intervenção do governo no mercado de crédito, ou seja, na sua intensificação/expansão “está fadada ao fracasso. Mais cedo ou mais tarde resultará numa catástrofe”. Ao lançar crédito no mercado, faz aumentar a quantidade de dinheiro em circulação e isso gera inflação. O mesmo se dá para os gastos “irresponsáveis” do governo, que são uma espécie de fermento para dívidas públicas e pressionam a inflação.\n\nRessurgindo recentemente por meio do neoliberalismo, a escola vê malefícios da atuação da autoridade monetária. Referindo-se ao caso brasileiro, citando, com exemplo a mudança de moeda, Ubiratan Iorio entende que “literalmente, desde que foi criado, o Banco Central do Brasil nada mais fez do que destruir a nossa moeda!”. Isto quer dizer que a economia funcionaria muito melhor sem um Banco Central.\n\nFriedrich Hayek defende uma postura ultra-radical: moedas privadas e concorrentes entre si como forma de dar maior estabilidade ao sistema. Em outros termos, não caberia ao Estado estabelecer nenhum tipo de monopólio no mercado monetário. No contexto da moeda privada, a tendência seria o caos do tipo “salve-se quem puder”. De uma forma geral, não resolveria o problema da incerteza, não traria estabilidade dos preços e aprofundaria com a velocidade de uma fecha a concentração de riqueza e ampliação das desigualdades sociais.\n\nDesta maneira, é um mito de que a existência de concorrência entre moedas seria a saída para o problema da inflação como também para a garantia de uma maior estabilidade do regime do capital. Repassar ao mercado a função de guardião da moeda e privá-la é renunciar toda e qualquer autonomia de política monetária. Seria como estar preso a uma bola de ferro aferrolhada aos pés.\n\nQuanto ao papel do Estado, “o capitalismo só triunfa quando se identifica com o Estado, quando ele é o Estado” (Braudel). A “sobrevivência do capitalismo tornou-se possível apenas em razão do papel jogado pelo Estado” (Przeworsky). Amiúde, o capitalismo só tornou-se o que é porque a centelha proveio do Estado.\n\nPor excelência, é preciso entender que o Estado teve e tem papel essencial na reprodução contínua do capitalismo, isto é, o Estado é ao mesmo tempo a ossatura material e a espinha dorsal do capitalismo. O Estado não somente garante a defesa dos interesses dos capitalistas, mas também sua reprodução em escala ampliada. Por isso, cada vez mais, o capital necessita do Estado.\n\nNão existe o auto-salvamento do capitalismo sem Estado, existe sim o suicídio. Quem salva o capitalismo de sua própria anarquia é o Estado. Se fosse trilhar por suas próprias pernas, o capitalismo ainda estaria nocauteado em decorrência de suas sucessivas crises.\n\nEssa narrativa vulgar papagaiada da necessidade da existência do Estado mínimo significa oposição às políticas de direitos e garantias sociais. Na verdade, isto representa uma defesa do tipo de estratégia militar para rendição do Estado em fazer política de desenvolvimento social. O capitalismo darwinista não faz política social, quem faz política social é o Estado. Nesse tocante, se hoje temos direitos trabalhistas, universidades e previdência públicas, SUS dentre outros direitos sociais e serviços públicos é porque teve a intervenção do Estado.\n\nDo contrário ao exposto, é óbvio que, se fôssemos submeter a economia política ao modelo de Estado mínimo, não haveria tais direitos sociais e os serviços seriam privados, o que privaria a ampla e esmagadora maioria da sociedade. Neste sentido categórico, o Estado mínimo nos leva a parafrasear Tucídides: “os fortes fazem o que podem, e os fracos sofrem o que devem”. Poderíamos também comparar o Estado mínimo com a pintura a óleo de Francisco de Goya “Saturno devora seu próprio filho”.\n\nQuanto à atuação da autoridade monetária, esta foi criada para sanear as contradições internas do capitalismo. Não foi criada por vontade divina ou satânica, mas sim para garantir a estabilidade do próprio sistema capitalista, isto é, impedir sua anarquia. Não por menos, quem salvou o sistema financeiro do colapso em 2007-8 foi o socorro público pela via da socialização dos prejuízos. Caso destitua a autoridade monetária, o sistema entraria em chilique na primeira esquina.\n\nO sistema de crédito é que permite a realização de investimentos, novas combinações, demanda efetiva, reprodução ampliada. O crédito é a força motriz da produção capitalista, que permite acelerar a dinâmica da circulação do capital, como também faz com que a articulação das relações capitalistas se propague no mercado.\n\nO progresso técnico e o processo de inovação tecnológica seriam impossíveis de existir sem o sistema de crédito. Se fôssemos esperar pela formação da poupança para o desdobramento do modo de produção capitalista, certamente esta ainda estaria em seu estágio primitivo. Portanto, associar a expansão o crédito à inflação é uma blasfêmia.\n\nJá quanto ao gasto governamental, assim como o crédito, é emprego, renda e, sobretudo, política social. No caso brasileiro, a dívida pública está correlacionada com as altas taxas de juros, e não com os gastos governamentais. Na prática, o gasto público é que permite a máquina capitalista continuar seu fluxo circular. Inibir o gasto público pelo mecanismo astuto de ajuste fiscal significa evocar a desgraça da ampla maioria da população, colocando-a para ser triturada pelo “moinho satânico”.\n\nNesta lógica, é preciso entender o sistema de crédito e de gasto governamental como fenômeno fundamental do desenvolvimento econômico e social, e não como elemento draconiano da inflação. Por essas e outras razões, a fé emocional na austeridade fiscal é uma crença vulgar na estabilidade macroeconômica, que corrói o tecido social dos “filhos deste solo”.\n\nPara encerrar, se o pecado original do historiador é o anacronismo, o pecado original do economista liberal/ultraliberal é seu constante divórcio com a realidade – é o caso da escola austríaca.\n\n- Fonte: http://www.ihu.unisinos.br/557367",
			"added": 1587240123
		},
		{
			"topic_id": 2,
			"title": "Pandemia e as falácias do homo economicus. Artigo de Castor Bartolomé Ruiz",
			"body": "\"A pandemia mostrou a crua nudez das falácias do discurso do homo economicus, que foram ensinadas e impostas como verdades naturais do modelo neoliberal de vida. Dentre os vários princípios do homo economicus que a pandemia desconstruiu de modo vertiginoso, podemos destacar: a redução da vida a valor econômico; a negação do público e do comum; o indivíduo como valor absoluto e a redução da alteridade do outro à lógica utilitarista do interesse próprio\", escreve Castor M.M. Bartolomé Ruiz, doutor em Filosofia, professor titular do Programa de Pós-Graduação de Filosofia da Unisinos, coordenador da Cátedra Unesco-Unisinos de Direitos Humanos e Violência, Governo e Governança e coordenador do Grupo de Pesquisa CNPq Ética, Biopolítica e Alteridade.\n\n \n\nPara o autor, \"a pandemia está colocando em crise nosso modelo civilizatório. Por isso, talvez seja uma das raras oportunidades que a humanidade recebeu para pensarmos a necessidade de modificar estrutural e culturalmente o atual modelo de capitalismo predador e egocêntrico\".\n\n#Eis o artigo.\n\n \n\nEsta pandemia do coronavírus está colocando a humanidade perante muitos desafios, porém, entre eles, talvez estejamos sendo testemunhas de uma grande crise civilizatória que está fazendo tremer os alicerces estruturais e culturais construídos pelo capitalismo nos últimos quatro séculos. Há muitas décadas que desde diversas perspectivas do pensamento crítico vinham se levantando vozes que nos alertavam sobre a insustentabilidade a médio e longo prazo deste modelo civilizatório baseado na acumulação indefinida de riqueza em poucos oligopólios, que exige uma predação ad infinitum do planeta terra. Este modelo impôs a cultura do homo economicus como uma espécie de nova religião naturalizada. A cultura do homo economicus, muito mais que um projeto econômico ou político, tornou-se um modo de subjetivação através do qual as atuais gerações globalizam a cultura da mercantilização da vida e a descartabilidade econômica de tudo que se toca.\n\nA chegada da pandemia como um evento imprevisto despiu o discurso do homo economicus da densa roupagem midiática que o globalizou como se fosse uma verdade natural. A pandemia mostrou a crua nudez das falácias do discurso do homo economicus, que foram ensinadas e impostas como verdades naturais do modelo neoliberal de vida. Este evento pandêmico caiu como um raio sobre alguns princípios da estratégia biopolítica na gestão econômica da vida no planeta. De outro lado, a imprevisibilidade do evento pandêmico abre uma nova temporalidade, quase messiânica na leitura benjaminiana, em que, de repente, tudo que era sólido se desmancha no ar e irrompem novas oportunidades para pensar outras formas-de-vida. O novo, que sempre está por vir, depende, inicialmente, da nossa capacidade de nos desfazer dos odres velhos que azedam a vida no planeta.\n\nO discurso do homo economicus foi construído ao longo do último século dentro da matriz do liberalismo econômico tradicional, porém propondo algumas mudanças significativas do mesmo. Pensadores muito importantes e influentes das atuais políticas econômicas do mundo como Milton Friedman, George Stigler, Friedrich von Hayek, Ludwig E. von Mises, Gary Becker, entre muitos outros, alguns deles prêmios Nobel de Economia, construíram a filosofia do homo economicus como matriz cultural e utopia de vida da doutrina econômica do chamado neoliberalismo. Estes pensadores tiveram e têm uma influência decisiva sobre a maioria dos modelos econômicos e políticos implementados no planeta desde, no mínimo, os anos 1970 até o presente. Muitos deles foram professores ou publicaram na Universidade de Chicago, EUA, onde se constituiu o principal foco irradiador deste pensamento do homo economicus. Não por acaso muitos dos ministros e gestores da economia em todo o mundo, incluindo vários dos últimos ministros de Economia do Brasil, como o atual, se formaram nessa universidade e importaram a filosofia do homo economicus como uma espécie de missão apostólica de salvação do mundo.\n\nDentre os vários princípios do homo economicus que a pandemia desconstruiu de modo vertiginoso, podemos destacar:\n\n \n\n- 1 - A redução da vida a valor econômico;\n\n \n\n- 2 - A negação do público e do comum;\n\n \n\n- 3 - O indivíduo como valor absoluto e a redução da alteridade do outro à lógica utilitarista do interesse próprio.\n\n#1. A redução da vida à economia\n\n \n\nA filosofia do homo economicus propõe que todas as dimensões da vida humana podem e devem ser traduzidas em valor econômico. Para este modelo de subjetivação, tudo que fazemos na vida deve ser percebido como um investimento econômico para extrair rendimento. A vida humana é compreendida como um empreendimento econômico que deve rentabilizar cada uma de suas facetas como a educação, os afetos, as amizades, as habilidades e todos os demais aspectos vitais. Todos eles devem ser entendidos como oportunidade de interesse, negócio ou possibilidade de obter renda. A lógica das relações humanas do homo economicus é o cálculo utilitarista dos rendimentos. A vida vale tanto quanto os benefícios ou rendimentos que dela podemos obter. O ideal é nos tornar empresários de nós mesmos, fazendo da vida um empreendimento, uma empresa. O modelo de vida do homo economicus é o empresário de si, que gerencia cada circunstância de sua vida como uma oportunidade de negócio. O homo economicus aponta para a utopia final da mercantilização total da vida, tanto da vida humana quanto da vida do planeta. Tudo é suscetível de se tornar mercadoria e negócio, pois só na forma de mercadoria a vida será melhor gerida.\n\nEstes princípios utilitaristas do homo economicus estão por trás das posturas negacionistas da pandemia de um conjunto de presidentes e governantes, que afirmam que a pandemia não é tão grave quanto o dano econômico que ocasionaria parar a produção e o comércio para se proteger do vírus. A rigor, a negação do perigo da pandemia para a vida das pessoas não é invocada por estes governantes com argumentos médicos ou epidemiológicos. O argumento principal para negar a letalidade da pandemia é que ela pode ter um custo econômico superior ao valor das vidas que se perderão, caso a atividade econômica pare.\n\nA política negacionista destes governantes deriva da sua convicção, quase religiosa, dos princípios do homo economicus de que o valor da vida humana deve ser ponderado na equação de custos-benefícios. Segundo essa lógica, a morte de um elevado número de pessoas se justifica moralmente pelo maior benefício que obteremos ao manter a economia funcionando. A economia não pode parar! Esta máxima repetida à exaustão em muitos países espelha um dos princípios básicos do homo economicus: o valor da vida humana é relativo ao seu rendimento e utilidade econômica. A política negacionista da pandemia, que até o momento presente muitos governantes continuam a pregar, tem como pressuposto filosófico os princípios do homo economicus de que a vida humana tem um valor relativo ao custo econômico de sua manutenção. Caso a conservação de vidas humanas tenha um custo econômico superior à sua morte, o gestor deverá entender que o sacrifício dessas vidas é o mal menor necessário para que outros vivam com melhor qualidade de vida.\n\nEstes são os pressupostos que legitimam a tanatopolítica do homo economicus como uma política eficiente de resultados. A biopolítica da gestão produtiva da vida, própria do neoliberalismo, tornou-se, de modo inescrupuloso, uma tanatopolítica legitimada pelo princípio dos resultados econômicos. A pandemia revelou as vergonhas mais imorais contidas no discurso do homo economicus, ao propor, muitos de seus pregadores, o sacrifício calculado de milhares de vidas humanas para que o produto interno bruto (PIB) não diminua. A pandemia mostrou como a filosofia do homo economicus coloca a vida humana a serviço da economia, ou seja, da lucratividade dos negócios e não ao contrário, legitimando, inclusive, a tanatopolítica como uma gestão eficiente de recursos escassos.\n\n \n\nConcomitantemente, a pandemia, além de escancarar a hipocrisia moral contida nos argumentos do homo economicus, vem mostrando a inutilidade desses princípios economicistas perante o avanço inexorável da contaminação em grande escala e do crescimento geométrico das mortes em todos aqueles países e regiões que adotaram o negacionismo como princípio e a economia como fim em si mesma. Na prática, muitos desses governantes, como Boris Johnson, primeiro-ministro da Inglaterra, tiveram que recuar de sua pregação, quando eles mesmos foram internados em estado grave pelo coronavírus.\n\n#2. A negação do público e do comum\n\n \n\nA filosofia do homo economicus considera que a dimensão pública da vida humana assim como suas formas comunitárias de organização são uma invenção ideológica do socialismo. Elas seriam ineficientes na gestão e seriam um lastro econômico deficitário. Por fim, tanto a dimensão pública quanto o comum são considerados quase uma aberração antinatural da economia e das relações sociais. A filosofia do homo economicus pensa que, por exemplo, a saúde, a educação, alimentação, etc., não podem ser considerados direitos humanos ou direitos fundamentais. Estes aspectos, como todos os demais da vida humana, devem entrar na lógica do mercado e serem administrados pela racionalidade do lucro, que permitirá uma melhor gestão, evitando o desperdício de dinheiro público. Na racionalidade do homo economicus, há que privatizar todas as formas comunitárias, assim como tudo o que for público deve ser desmontado e reduzido na sua mínima expressão, deixando à iniciativa privada a gestão de tudo. O homo economicus tem uma fé cega na capacidade natural do indivíduo como empreendedor e na sua motivação do interesse próprio, com sua consequente aspiração a maximizar o lucro, como motores naturais para impulsionar e gerenciar com eficiência todas as esferas da vida pública e social. Nada deve impedir a expansão do interesse próprio inerente ao homo economicus. A verdadeira liberdade é a liberdade de negócios.\n\n \n\nCertamente que a saúde é um desses âmbitos da vida humana que, para o homo economicus, deve estar exclusivamente regido pela lógica do interesse particular e entregue à iniciativa privada. Segundo essa lógica, cada um deve cuidar de sua saúde como um investimento em si mesmo, e para tanto deve investir no plano de saúde. A saúde não é um direito, senão uma mercadoria. Por sua vez, a gestão da saúde deve ser uma lógica de mercado. Quem puder pagar, terá os benefícios e quem não pagar não tem por que ter direito àquilo que não é capaz de conseguir por si mesmo.\n\n \n\nA pandemia caiu como um raio sobre estes axiomas do homo economicus. A pandemia mostrou a ineficácia da iniciativa privada para enfrentar de forma global e em ampla escala um problema de saúde pública tão abrangente. Algumas minorias privilegiadas que têm seus bons planos de saúde sentem-se protegidas individualmente, enquanto pensam que o abandono daqueles que não podem pagar a saúde é uma consequência natural da livre concorrência, que não devemos impedir. Mas essa atitude egoísta também mostra a ignorância de quanto o individualismo é ineficaz perante a pandemia. Não é suficiente que alguns tenham plano de saúde, a pandemia atinge a todos enquanto todos não sejamos capazes de enfrentá-la de modo coletivo. Por ironia do destino ou destino da pandemia, em muitos lugares como o Brasil, o primeiro foco da pandemia se registrou entre as elites ricas, porque eles viajaram de avião aos países infectados como China, Itália, tornando-se o alvo central da pandemia e o foco de sua irradiação.\n\nA pandemia está mostrando que a única maneira de enfrentarmos problemas e desafios globais é de forma coletiva. Para tanto, só um bom serviço público de saúde pode conseguir frear em grande escala os efeitos da pandemia. Por isso, resulta paradoxal ver como, de repente, muitos dos líderes mundiais do neoliberalismo se tornaram grandes defensores do sistema público de saúde, a começar pelo Brasil. Muitos governos neoliberais que pretendiam simplesmente esvaziar ou até acabar com o sistema público de saúde por considerá-lo uma aberração ideológica, estão sendo obrigados pela pandemia a reforçar o sistema público de saúde como a única e melhor alternativa possível para evitar uma tragédia monumental de mortes em grande escala.\n\n \n\nTalvez um dos exemplos mais paradoxais impostos pela pandemia como lição moral e política seja o momento em que o primeiro-ministro da Inglaterra, Boris Johnson, saiu recuperado do hospital público e agradeceu ao sistema público de saúde que lhe salvou a vida, e elogiou a importância do sistema público de saúde nestes momentos. Talvez faltou complementar que várias das enfermeiras que lhe atenderam eram estrangeiras, já que ele tem uma política para expulsão compulsória dos estrangeiros.\n\n \n\nDe repente, na pandemia, irrompeu imprevisivelmente a importância do público, do comum, como a única ou a melhor alternativa para enfrentarmos esta ameaça global. Concomitantemente, vemos como os principais apóstolos do homo economicus abandonam suas crenças dogmáticas neoliberais e adotam como única solução possível em tempos de pandemia o reforço do serviço público de saúde e as formas comunitárias de enfrentar a pandemia.\n\n \n\nMas a pandemia também mostrou as falácias de outros muitos dogmas econômicos da doutrina do homo economicus quando observamos que os líderes neoliberais do mundo optaram por injetar dinheiro público em quantidades gigantescas, como nunca antes na história da humanidade, para reforçar as empresas privadas. Ou seja, enquanto nos tempos de bonança econômica se prega a livre iniciativa para gerar lucro aos negócios privados, em tempos de crise esse princípio do mercado neoliberal é deixado de lado e se apela ao dinheiro público como a única solução capaz de socorrer o agora denominado tecido produtivo. Na época de pandemia, como nas outras grandes crises, se afirma que as empresas também são um patrimônio comunitário e cumprem uma função social que não se pode deixar morrer. De repente, em época de pandemia, como em outras grandes crises, se abandona a doutrina do liberalismo econômico e se apela para o socorro público como única solução.\n\n \n\nDe igual forma, os governos neoliberais, totalmente contrários às políticas sociais por considerá-las a negação dos princípios fundadores da livre iniciativa do homo economicus, decidiram, inclusive, implementar uma espécie de “renda universal mínima” para todos os que não conseguem sequer ter o mínimo para se sustentar nos tempos de pandemia. A renda mínima universal é uma das reivindicações mais importantes das últimas décadas, proposta pelos movimentos sociais como alternativa solidária contra a exclusão social. Até agora era considerada uma iniciativa de caráter socialista e inaceitável para os princípios neoliberais. Mais uma vez, a pandemia não só está despindo o homo economicus de suas roupagens falaciosas, senão que está mostrando a viabilidade de alternativas políticas de caráter solidário, quando há vontade política.\n\n#3. O indivíduo como valor absoluto e a redução da alteridade do outro à lógica utilitarista do interesse próprio\n\n \n\nUm terceiro aspecto que a pandemia está evidenciando ser falacioso é o axioma do homo economicus de que o indivíduo tem um valor absoluto, sendo a relação com o outro um desdobramento utilitário do interesse individual. Este princípio antropológico do homo economicus tem solidificado a cultura do individualismo como sendo o modo natural de existirmos no atual momento. O individualismo do homo economicus prega que a natureza individual está essencialmente eivada pelo impulso do interesse próprio que inevitavelmente nos lançaria a entender o outro como um apêndice útil para minha sobrevivência.\n\n \n\nO modo de subjetivação individualista tem penetrado capilarmente em quase todas as dimensões da vida humana de nossas sociedades contemporâneas, ao extremo de considerarmos absolutamente natural esta visão do in-divíduo como sendo o indivisível de nós mesmos. Nos percebemos, antes de tudo, indivíduos, e os outros são satélites mais ou menos necessários para meu eu. Esta cultura individualista penetrou capilarmente no âmago da alma contemporânea, incapacitando-nos para entender que seja possível uma outra forma de subjetivação que não o individualismo.\n\n \n\nO individualismo pregado pelo modelo do homo economicus sustenta que cada indivíduo deve ter a capacidade de solucionar individualmente seus problemas. É a capacidade individual que possibilita a ascensão social. O outro é sempre uma oportunidade para o interesse individual. Desta forma, o outro é alguém de quem posso tirar proveito, ou alguém com que posso me beneficiar. Em qualquer caso, na relação com o outro há sempre uma dimensão de cálculo utilitarista. Em última instância, o indivíduo é o único responsável de si mesmo e por tudo que ele conseguir ser. De igual modo, a sociedade é o resultado das decisões individuais. A maximização do progresso econômico e social se consegue, por sua vez, através do equilíbrio natural dos egoísmos individuais.\n\n \n\nA falácia individualista de nossa cultura há tempo que foi mostrada pelos pensadores da alteridade, uma vez que o indivíduo que nós pensamos ser, nada mais é que o resultado da complexa rede de relações que mantivemos ao longo de nossa existência com os outros. Não existe um in-divíduo indivisível! Somos o resultado das interações com os outros. Nos constituímos através de um processo de subjetivação em que os outros são condição necessária para nossa subjetividade. O processo de subjetivação do eu humano só é possível pela relação com os outros. O outro não é um apêndice do eu, como pensa o individualismo. O outro me constitui no modo como eu sou. O outro é condição necessária para ser o que eu sou, permanecendo em mim como parte de mim mesmo no modo como eu sou. Dentro de cada um de nós coexistem parte do pai, da mãe, de irmãos, amigos, professores, convivências, relações que tivemos ou não ao longo de nossa existência. Nosso eu é mais um caleidoscópio resultado das relações com os outros, que se costura de modo complexo ao longo dos processos de subjetivação.\n\nA pandemia também desconstruiu muitas das falácias do individualismo do homo economicus. A pandemia está nos indicando que somos absolutamente interdependentes uns dos outros. A atitude individual tem uma imediata repercussão nos outros. Nestes tempos de pandemia vivemos a mais capilar interdependência em escala planetária que jamais se experimentou na história da humanidade. Poderíamos dizer que a pandemia nos mostrou que a fraternidade é muito mais que um ideal ético, é uma dimensão antropológica através da qual estamos inexoravelmente interligados uns com os outros.\n\n \n\nEssa interdependência tem muitas faces. A primeira mostra que são estéreis as atitudes individualistas como solução egocêntrica para um problema global de grandes dimensões. Ninguém consegue solucionar o problema da pandemia para si mesmo nem por si mesmo. Só é possível enfrentarmos a pandemia de forma coletiva, com atitudes coletivas e de modo comunitário. A dimensão comunitária é essencial para conseguirmos enfrentar problemas globais de grande magnitude como a atual pandemia. O individualismo fica desmascarado pela pandemia como uma falácia cultural estéril.\n\n \n\nUm segundo aspecto da radical interdependência que temos uns dos outros aparece nas consequências imediatas e em grande escala dos meus atos pessoais. Um acontecimento ocorrido numa remota região central da China, em poucos meses, colocou o planeta inteiro numa crise sem precedentes. De igual forma, a minha atitude pessoal em relação à pandemia não afeta só a mim, pois o que eu fizer pode ou não contribuir para contaminar muitos outros e talvez levá-los à morte. A pandemia espelha nossa interdependência radical de seres humanos, cuja existência, nestas circunstâncias, depende muito da atitude que outros tomem sobre si mesmos.\n\nA máxima da pandemia cuide de si para melhor cuidar dos outros é a inversão do dogma do homo economicus: cuide de si aproveitando-se dos outros. Na pandemia ninguém pode pensar em tirar vantagem própria só cuidando de si, pois cada um de nós depende muito do comportamento dos outros. A pandemia evidenciou o princípio da responsabilidade coletiva que todos temos em relação aos demais.\n\n \n\nA pandemia está colocando em crise nosso modelo civilizatório. Por isso, talvez seja uma das raras oportunidades que a humanidade recebeu para pensarmos a necessidade de modificar estrutural e culturalmente o atual modelo de capitalismo predador e egocêntrico. Tudo aponta que, se não formos capazes de modificar em curto prazo este modelo insustentável de utilitarismo tanatopolítico da vida, estão por vir novas e grandes crises, desta vez de caráter ecológico, a que talvez nem consigamos dar uma resposta tão eficiente. Estamos perante um tempo único, um tempo oportuno, para implementar transformações radicais na nossa forma-de-vida. É um tempo de reciclar os odres velhos que negam o valor da vida e pensar responsabilidade coletiva de novas formas-de-vida.\n\n- Fonte: https://web.archive.org/web/20200418204800/http://www.ihu.unisinos.br/598157-pandemia-e-as-falacias-do-homo-economicus",
			"added": 1587243117
		},
		{
			"topic_id": 3,
			"title": "Terrenos da desigualdade: Terra, agricultura e desigualdade no Brasil rural",
			"body": "- Relatório Terrenos da Desigualdade Brasil: https://swarm-gateways.net/bzz:/50d1a4acd5702135cb6d1a12b9947ac978dd6cd4185bc2351be97b147bbbce56/relatorio-terrenos_desigualdade-brasil.pdf\n\nA desigualdade extrema tem múltiplas origens e traz sérias consequências negativas para a garantia de direitos e o desenvolvimento sustentável. Entre suas causas estruturais está a concentração da terra, um fator de preocupação na América Latina e, em especial, no Brasil. A concentração da terra está ligada ao êxodo rural, à captura de recursos naturais e bens comuns, à degradação do meio ambiente e à formação de uma poderosa elite associada a um modelo agrícola baseado no latifúndio de monocultivo, voltado à produção de commodities para exportação e não para a produção de alimentos. É preciso reconhecer que a desigualdade é um grave e urgente problema no Brasil e que sua solução passa por transformações em suas causas estruturais.",
			"added": 1587257302
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_1338XMgU2xuHoGPEqs8Gf25f7C7yTrU5CT": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 9,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#O papel do Estado na economia: crítica à escola austríaca\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1338XMgU2xuHoGPEqs8Gf25f7C7yTrU5CT/O+papel+do+Estado+na+economia+cr+tica+escola+austr+aca",
				"added": 1587243553
			},
			{
				"comment_id": 4,
				"body": "#Capitalismo de Estado\n\n- https://swarm-gateways.net/bzz:/ab66a71f13505ca153078c159e7c1e99e68d0bbb7244b5d67b5eae0e8c211464/Capitalismo_de_Estado.pdf\n\nO conceito de Capitalismo de Estado abrange dois significados distintos. O primeiro significado refere-se aos países designados de socialistas (URSS e Cuba, por exemplo), que se caracterizam por manter a exploração dos trabalhadores via extração do mais-valia, tal como no capitalismo privado, mas onde o Estado se transforma no principal proprietário. O Estado possui o monopólio dos meios de produção e extrai a mais-valia e o redistribui, além do investimento no processo de acumulação de capital, entre os burocratas, que passam a usufruir de diversos privilégios, formando uma burguesia de Estado. O segundo se refere a países capitalistas com forte intervenção do Estado na economia, onde este se esforça para desenvolver as forças produtivas, opondo-se assim ao liberalismo.",
				"added": 1587255930
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 2,
				"body": "#Império Sassânida\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Sasanian_Empire.html\n\n#Império Japonês\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Empire_of_Japan.html\n\n#Império Aquemênida\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Achaemenid_Empire.html\n\n#Império do Brasil\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Empire_of_Brazil.html\n\n#Califado de Rashidun\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Rashidun_Caliphate.html\n\n#Império Português\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Portuguese_Empire.html\n\n#Califado Abássida\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Abbasid_Caliphate.html\n\n#Império Colonial Francês\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/French_colonial_empire.html\n\n#Dinastia Yuan\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Yuan_dynasty.html\n\n#Dinastia Qing\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Qing_dynasty.html\n\n#Califado Omíada\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Umayyad_Caliphate.html\n\n#Império Espanhol\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Spanish_Empire.html\n\n#Império Russo\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Russian_Empire.html\n\n#Império Mongol\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Mongol_Empire.html\n\n#Império Britânico\nhttps://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/British_Empire.html",
				"added": 1587245427
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 3,
				"body": "> [lindishe](#comment_11_15EBpr2PMGy1LdUcM6w1uBrQp7zrko64wn): Redes Livres\n> \n> https://www.redeslivres.org.br/\n> \n> “Imagine um meio de comunicação em que você e seus vizinhos estão interconectados e todos podem trocar arquivos em alta velocidade com anonimato e segurança; falar gratuitamente através de telefonemas, mensagens e bate-papos; transmitir canais locais de rádio e TV; mapear, trocar e divulgar serviços do bairro através de sites, wikis e outros serviços que ficam hospedados em seus próprios servidores.E a partir dessas ferramentas todas, a vizinhança local poderia realizar pesquisas, abaixo-assinados, consensos, votações, até agendar encontros físicos para se conhecer.E tudo isso funcionando sem depender da estrutura da internet, mas podendo, também, ser acessado ou oferecer o acesso a ela”\n\n#Programas para Usar com Redes Livres \n- https://web.archive.org/web/20171018141749/http://sustentacomuni.blogspot.com/2013/08/programas-para-usar-com-redes-livres.html\n\n#Como Criar uma Rede Livre \n- https://web.archive.org/web/20160128012140/http://sustentacomuni.blogspot.com.br/2013/02/como-criar-uma-rede-livre.html",
				"added": 1587246976
			}
		],
		"1_1338XMgU2xuHoGPEqs8Gf25f7C7yTrU5CT": [
			{
				"comment_id": 5,
				"body": "#Homs – Breve história do mercado e do Estado\nhttps://web.archive.org/web/20200411160618/https://eleuterioprado.files.wordpress.com/2020/03/homs-breve-histc3b3ria-do-mercado-e-do-estado.pdf (SHA-256: d3e61ed3df984df2167490ef49340ce0e86aa9873d620f377d69200cb1fbe511)",
				"added": 1587256018
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 6,
				"body": "Toda a ferramenta preparada contra ti não prosperará, e toda a língua que se levantar contra ti em juízo tu a condenarás; esta é a herança dos servos do Senhor, e a sua justiça que de mim procede, diz o Senhor.\n\n- Isaías 54:17",
				"added": 1587257140
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 7,
				"body": "#INVASORES - NENHUM SISTEMA ESTÁ À SALVO\n- https://swarm-gateways.net/bzz:/213642b365af520ad0adf635b80a0bf8df698c7efac66986a2606945e6aabc2d/Filmaço+:+Os+++Invasores:++Nenhum+Sistema+Está+à+Salvo-URIRp6cODhA.mp4\n\nBenjamin, um jovem gênio da informática é convidado para se integrar a um subversivo grupo de hackers que procura a atenção por todo o mundo.",
				"added": 1587259047
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 8,
				"body": "#Até onde poderiam ir os estragos de uma bomba nuclear?\n\nEsta é uma questão que nos intriga e que, na verdade, nos amedronta tendo em consideração a história já conhecida. A bomba atómica que caiu em Hiroshima, no Japão, a 1945, provocou a morte de 66 mil pessoas e feriu outras 69 mil, extrapolando para os dias de hoje, se esta bomba caísse numa cidade metropolitana atual, como Londres, por exemplo, o número de mortos poderia ir para os 90 mil e os feridos para os 272 mil.\n\nEstes valores são assustadores e revelam bem a dimensão que teria uma guerra nos dias de hoje.\n\nPara conseguir ter uma ideia da dimensão dos estragos de uma arma nuclear existe um mapa, o [NUKEMAP](https://nuclearsecrecy.com/nukemap/), desenvolvido por Alex Wellerstein do Sevens Institute of Technology, onde pode escolher a localização, o tipo de bomba e a forma como seria lançada, onde além da dimensão, ainda é possível analisar o tipo de estragos que provocaria.",
				"added": 1587259378
			}
		]
	},
	"comment_vote": {}
}