{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1587107391,
			"title": "Не впадайте в панику",
			"body": "Обращусь ко всем тем кто кричит здесь о цифровом концлагере и сговоре мирового правительства. Несколько лет назад, когда я только начал разбираться в устройстве современного общества я тоже был подвержен схожим идеям и не перестаю удивляться как много народа идёт по тому же самому пути.\n\nНет никакого мирового правительства, современный порядок больше похож на анархию. Оглянитесь вокруг, можете ли вы сказать что этим бардаком кто-то управляет? Цифровой концлагерь? Да они на карантин то нас закрыть толком не могут. Чипирование? Да мы и так уже все зачипированы своими гаджетами, все пронумерованы паспортами, снилсами, ИНН.\n\nЭти панические настроения эксплуатируют наш страх перед будущим и наше невежество, а порождаются они такими же невеждами, мнящими себя специалистами. Я призываю вас встать на путь научного познания, как единственно верного, поскольку оно опирается на доказательство. Впредь подвергайте сомнению любую поступающую информацию. Если очередной \"эксперт\" втирает вам о еврейском сговоре, поинтересуйтесь, есть ли у него доказательство и насколько оно основательное. Наши догадки и домыслы позволяют водить нас за нос. Всё зло от невежества, благими намерениями вымощена дорога в ад.\n\nТеория заговора V.S. Наука: https://www.youtube.com/watch?v=0v2T6KgI9ic\nПсихология Теорий Заговоров: https://www.youtube.com/watch?v=HYNxVolcVJo",
			"added": 1587107390
		}
	],
	"topic_vote": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Бамбаргия! Киргуду!",
				"added": 1587047694
			}
		],
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": [],
		"1587107391_15zutMkc1LGBS6ntJdYxyYkXbnM7t3BJ43": [
			{
				"comment_id": 3,
				"body": "Где-то вас оторвало от реальности",
				"added": 1587271448
			}
		]
	},
	"comment_vote": {
		"1_1JY6yAbyYZhop19BQAxYe3niwz7ByZxkoX": 1,
		"41_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1
	}
}