{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Файловый обмен в ZeroNet",
			"body": "Существует ли в ZeroNet готовые решения для файлового обмена? Интересует как помещение файлов в общий доступ, так и пересылка конкретному пользователю. Пока, как наиболее универсальное решение, в голову пришла толко пересылка закодированных в base64 файлов через ZeroMail, но где узнать лимит на резмер сообщения? И как быть, если я хочу опубликовать файл публично? Не создавать же ради каждого файла отдельный ресурс.",
			"added": 1499829351
		}
	],
	"topic_vote": {
		"5_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Тест",
				"added": 1476223591
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 2,
				"body": "На ресурсе http://127.0.0.1:43110/zerosecurity.bit/ есть достаточно интересная информация на тему безопасности и анонимности ZeroNet.",
				"added": 1476577848
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 3,
				"body": "На своём старом устройстве ставил внутри дебиана в linux deploy, однако на моём текущем устройстве проблемы с получение рута. Теоретически, ZeroNet можно завести на обычном нерутованном Android устройстве через termux с установленным в нем интерпретатором питона, но чтобы завелось, код в некоторых местах придется править. Думаю, если выдастся свободное время, перепилю немного ZeroBundle под такой запуск.",
				"added": 1476631683
			},
			{
				"comment_id": 4,
				"body": "> [trava](#comment_3_1EHrBqNZLu3He8t98otjqezt5jRE8euGSA): На своём старом устройстве ставил внутри дебиана в linux deploy, однако на моём текущем устройстве проблемы с получение рута. Теоретически, ZeroNet можно завести на обычном нерутованном Android устройстве через termux с установленным в нем интерпретатором питона, но чтобы завелось, код в некоторых местах придется править. Думаю, если выдастся свободное время, перепилю немного ZeroBundle под такой запуск.\n\nУра, в ZeroBundle вроде как ничего править не надо. Но нужно придумать способ установить gevent в termux на arm.",
				"added": 1476648754
			},
			{
				"comment_id": 5,
				"body": "> [akachan](#comment_5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Сижу именно с такого. Заходим на zeronet.io с мобилы и по ссылке качаем apk.  Ставим и юзаем. Не очень удобно правд, но сойдет\n\nК сожалению пока очень сырой клиент, и непонятно, куда файл с пользовательскими ключами класть.",
				"added": 1499776577
			},
			{
				"comment_id": 6,
				"body": "Хочу поделиться реально рабочим и относительно удобным способом запуска ZeroNet на Android.\nДля начала необходимо установить termux, он позволит запускать многие linux приложения без рута и прочих плясок с бубном. В termux нам достаточно выполнить скрипт zn.sh с этого репозитория https://github.com/WillyPillow/Termux-ZeroNet\nСкрипт сам установит ZeroNet и все зависимости. Установится все в ~/ZeroNet/",
				"added": 1499777644
			}
		]
	},
	"comment_vote": {
		"1_1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka": 1,
		"85_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1
	}
}