{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1617530919,
			"title": "Dr. Leana Wen",
			"body": "Leana wants us lock down so that she has a \"carrot\" to force \"vaccinate\" us. \n\nShe wants \"to tie reopening with vaccination status\".\n\nI am deeply outraged by the intention of this female.\n\nI am curious, does she still live in Baltimore? And how much does she value the life of her own children?\n\nBecause if she wants to get me injected with their poison, her children die too.\n\nI hope I am clear?",
			"added": 1617530918
		},
		{
			"topic_id": 1617878152,
			"title": "EU Supreme court just made mandatory vaccine legal...",
			"body": "ready 2 rumble? no a2 to europeon? gl & HF... you will understand what the american founder intented once again you will be plowed... (it didn't worked in america, at least systematically, but apparently some states have still a strong bound with liberty)... will see...",
			"added": 1617878150
		},
		{
			"topic_id": 1617909117,
			"title": "[MEGA POST] taking down the brits, love to see ireland burn again !",
			"body": "I mean, ireland is the perfect way to start fire in the whole UK, to put down this regime of worldwide tyranny...\n\nagain I have no idea who is behind it\n\nbut I frankly HATE everyone at the mi6 (the guitar event)...\n\nI hope they all get fragged :).\n\nbut again, useless opinion !\n\ngg wp !\n\nenjoy the \"regret\"... you will...\n\nunless you can really wipe...\n\nwill see...\n\nbecause your mongroloid trope, will fail...\n\nit's just melanin... most are dumb like fucks, but some will rise...\n\nat least I guess...\n\nbecause what will happen is unknown to me too....\n\nthe famous meteorite... for example :).",
			"added": 1617909114
		},
		{
			"topic_id": 1618263006,
			"title": "Should trump at least once explained the real story with epstein?",
			"body": "personally, I would love to pass trump to the electronic mind reader... you know for once have the real story of the 45th potus... would be cool... I would love that all be true, to devastate all the people he fooled... to ruin them psychological and mentally, to find them wanting to execute him, even ivanka... it would make me really happy... not happy happy, but a necessary step...",
			"added": 1618263002
		}
	],
	"topic_vote": {},
	"next_comment_id": 52,
	"comment": {
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "> [calmdownholden](#comment_38_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Trying to eliminate the Free Press is a sign you've been brainwashed by fascist propaganda.c17h21no4 & hyperangrymuppet are obviously mentally ill, and the rest of you posting on here don't seem much better.\n\nWould you consider the Reich Ministry of Public Enlightenment and Propaganda (nazi propaganda) as free press?\n\nThis is the central question.\n\nDid you know that CNN has more personal working for it (nazi propaganda officially 2,000 workers in 1939) and a bigger budget ?\n\nThe ministry was organized into seven departments.\n\n    Division I: Administration and legal\n    Division II: Mass rallies; public health; youth; race\n    Division III: Broadcasting\n    Division IV: National and foreign press\n    Division V: Films and film censorship\n    Division VI: Art, music, and theatre\n    Division VII: Protection against counter-propaganda, both foreign and domestic\n\nIt's important to respect the speech of the enemy (free speech) until the time has come to kill it.\n\nIMHO this time has arrived for the whole cnn team.\n\nAre you maybe from the Division 7 from CNN?",
				"added": 1617554071
			},
			{
				"comment_id": 45,
				"body": "I am very pleased to annouce that Linda Kinkade enters the witness program ! what a lucky girl ! why? \n\n1. only one black girl would have been raycist\n2. she is such a pervert... she will tell the story well, of the day, the whole cnn personals, but two, died.\n\nanother issue, so sometimes, I like to watch the enemy media...\n\nand curiously I saw the cops events with the black guy wearing a military camo...\n\nwhat an asshole this guy, and the guys at cnn...\n\nwhy?\n\nI would like to command the two cops for their excellent reactions and handling of this potential combatant...\n\nhow?\n\nso the thing is that the guy was certainly right in his appreciation of the law, but this isn't the question... that should have been settled in COURT later...\n\nWhat did he do wrong and why I would execute him to teach everyone clearly a lesson.\n\n1. the time the two cops could focus on this event is limited.\n2. he was trying to wear them out.\n3. at this point who knows...\n\nso rather than play the obama layer, get out of the car, hands up, like done, check the stuff, clear it out, everyone apologize, moving on for the two cops to the next situation...\n\nthe little spray is quite funny :D.\n\nso recap applause to them, negative rating to the so called solider, and of course a kill list for cnn is even useless... the whole, but 2.\n\nthey don't understand how lucky they are... \n\nso many would give all they got, for those 2 privileges... to not be executed, like the rest.\n\nwell done ! another victory :).",
				"added": 1618261592
			},
			{
				"comment_id": 50,
				"body": "On the negative, and the failure was brief is to have for one of the two entered in the narrative game... I am a vet, huh no active\n\n-> me too... \n\nNO...\n\nGET OUT OF THE FUCKING CARE !\n\nthat's one of the scene in most movies I don't like : the negotiation armed... moving on...\n\nand by this I mean that very often there are a return of fortune...\n\nat least in the movie the 5th wave, she takes the shot...\n\nby mistake :)\n\nbut it was the right call...\n\nand even way too slow and pussified...\n\nspray this fucking door, and will see what's get out... \n\nso to get back, narrative trap\n\nobey order now.\n\ndo\n\nmoving on...\n\n-------------\n\nother situation, those \"cops\" would in realiy be vaxxnazi, don't open windows, stop, (already loaded) security remove, aim, 1, 2, repass, done moving on... and if really out, why not some necros, but the lighted spot seemed to exposed for some looting... but on the other could be valuable information, like cop address, munitions, coms gears, car... pure necro... of course the whole in xm1158... and that's the whole difficulty to move enough power in such short space... hmmm another training scenario...",
				"added": 1618262661
			},
			{
				"comment_id": 51,
				"body": "ideally there would be a second car passing once the cop are stopped and advancing, spraying, moving on...\n\nthere is a video in irak/syria... so impressive... 2 cops on the side of the road, unexpecting, vs 4 aks in car... nothing remained... even if unclear in the video... ahhh those great video... so hard to find... like pedotrump recent mar a lago apparently finally great discourse...",
				"added": 1618262875
			}
		],
		"1617530919_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 2,
				"body": "Leana Wen Biography – Leana Wen Wiki\n\nLeana Wen full name Leana Sheryle Wen, is an American physician and author. She graduated summa cum laude with a bachelor’s degree in biochemistry from California State University, Los Angeles at the age of 18, and went on to earn her medical degree from Washington University School of Medicine. She also obtained master’s degrees in Economic and Social History and Modern Chinese Studies at the University of Oxford.\n\nAs President of the American Medical Students Association, she led a campaign focused on improving healthcare access. She practiced emergency medicine at Massachusetts General Hospital and Brigham and Women’s Hospital before moving into a research position and then her role as Baltimore’s Health Commissioner.\n\nShe served as the health commissioner of Baltimore City, Maryland. She began her role at the city health department in January 2015, appointed to the position by then-Mayor Stephanie Rawlings Blake. During her tenure, she has been a driving force behind several initiatives aimed at confronting some of Baltimore’s most critical public health concerns including teen pregnancy, infant mortality and the opioid epidemic.\nDr. Leana Wen Planned Parenthood\n\nDr. Leana Wen was appointed the president of Planned Parenthood Federation of America on September 12, 2018 effective November 12, 2018. Naomi Aberly, chair of Planned Parenthood’s board, said in a statement: “Today is a historic day for Planned Parenthood and the millions of people it serves. Not only will [Dr. Wen] help Planned Parenthood continue to provide high-quality care to women, men and young people across the country, she will be a powerful voice in our fight to ensure women have the ability to make their own health care decisions — no matter what.”\n\nShe replaced Cecile Richards as president of Planned Parenthood. Richards spent 12 years at the helm of the organization until stepping down in April 2018.\n\nOn July 16, 2019, Wen was removed as president of Planned Parenthood by the organization’s board of directors. Wen wrote on Twitter, “I just learned that the @PPFA Board ended my employment at a secret meeting. We were engaged in good faith negotiations about my departure based on philosophical differences over the direction and future of Planned Parenthood. My statement to come shortly.”\n\nDr. Leana Wen in a statement posted on Twitter just minutes after her initial tweet: “I believe that the best way to protect abortion care is to be clear that it is not a political issue but a health care one, and that we can expand support for reproductive rights by finding common ground with the majority of Americans who understand reproductive health care as the fundamental health care that it is,” Wen wrote.\n\n“I am leaving because the new Board Chairs and I have philosophical differences over the direction and future of Planned Parenthood,” she continued.\nDr. Leana Wen Age\n\nShe was born on January 27, 1983, in Shanghai, China as Wen Linyan.\n\nLeana Wen Husband\n\nShe has been married to her husband Sebastian Neil Walker since 2012.\nLeana Wen Family\n\nLeana Wen’s family moved to Compton, California from China just after the Tiananmen Square massacre in 1989. According to Wen, her parents had only $40 to their name and depended on Medicaid, food stamps, and Planned Parenthood.\nLeana Wen Salary – Leana Wen Net Worth\n\nLeana Wen ‘s salary for the fiscal year 2017 was $212,200.\n\nDr. Leana Wen Nationality\n\nWen and her family became U.S. citizens in 2003.",
				"added": 1617554446
			},
			{
				"comment_id": 3,
				"body": "Planned Parenthood... girl you could be a little bit less obvious... I know the american CIs are suckers, but still...",
				"added": 1617554485
			},
			{
				"comment_id": 4,
				"body": "Naomi Aberly, chair of Planned Parenthood’s board, said in a statement: “Today is a historic day for Planned Parenthood and the millions of people it serves. Not only will [Dr. Wen] help Planned Parenthood continue to provide high-quality care to women, men and young people across the country, she will be a powerful voice in our fight to ensure women have the ability to make their own health care decisions — no matter what.”",
				"added": 1617554550
			},
			{
				"comment_id": 5,
				"body": "my body my choice, but only when it comes to killing babies, isn't it, miss wen? lol... against any normal country, you will fragged, by now, meaning the Death squads would be on your tail... but you are lucky americans are suckers... just know, we know.\n\nbeware, we kill, dogs, cats, bats, what ever... and the children of our enemies, like you do...",
				"added": 1617554624
			},
			{
				"comment_id": 6,
				"body": "and so my niggas are again right ! good job guys ! time to flash some asians... what ? guns flashes too...",
				"added": 1617554656
			},
			{
				"comment_id": 7,
				"body": "and so you slut want to take our A2 to vaxx us like slaves? ahahahah... a2 is only for whities... they don't dare to OWN it and LIVE it ! it's a gun... god given right, enuf said. \n\npop pop pop...\n\nand walker?`\n\npop pop pop",
				"added": 1617554745
			},
			{
				"comment_id": 8,
				"body": "the most funniest in this whole story, will be the american counter intelligence... ahahahahah...",
				"added": 1617554835
			}
		],
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 9,
				"body": "> [captain404](#comment_24_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): fair it s called freedom and u seem to have issue with the understanding of this, cause i have never seen any chinees app who defend your freedom. Just try winie the pooh in 10 sec u could test your freedom. Also how many different account you create ? about  p2p just try to learn me something i dont know i just want to see how funny u can go ( dont embarass youserlf ;) Also u dont have to wait for china cause u know they are already a lot of solution maybe do your research, i mean if your are in china im no suprised was u r not aware of thishttps://www.privacytools.io\n\nyou still haven't been unable to explain how you understand freedom of speech, and what restrictions you find appropriate.\n\nI defend the value proposition of the Bill of Rights, unrestricted, words aren't swords.\n\nWhat's yours? \n\nI don't believe in any restriction of free speech.\n\nHowever I fully support CCP choices in regards to how they handle anything. If you wish to get more precise I believe that the enemies of the chinese revolution were in a position to use free speech in detrimental way for the accomplishement of it. Furthermore, as they always seek destabilization it's a hard balance to find...\n\nHappily, and that's the thing the hardest for you to admit, I HAVE NO SAY IN HOW THE CHINESE CHOSE TO LIVE, and as such defending the U.S. bill of rights, I just read what I see...\n\ncongress shall make no law regarding free speech.\n\nso there is no hate speech, love speech, nazi speech etc.\n\njust those who are the enemies who must be killed, those like you.\n\nhave fun.\n\nps you are so smart ^^",
				"added": 1617694983
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 10,
				"body": "the most stupid army in the whole world... the real question why does the industrial part succeed so much? is it a lie or not... will know soon...\n\nIDK...\n\nI am always open minded toward the gears... but reality, or war thorn, proves... not marketing, no ads, not anything...\n\nak for example, has proven.\n\nstinger, for example has proven...\n\nI don't expect the inventors of black powder to dissapoint me :) !! even armless the boxers went in...\n\nI hope american forces will take the blast... type nazi germans... razed + those escapees with the loot... the blast.\n\nkill the eagle.",
				"added": 1617879527
			},
			{
				"comment_id": 49,
				"body": "Personally I am very convinced that they want to impose this small arms treaty over the american population, to totally cement their serfdom take over pedoaristofeodalist colonialist dream...\n\nand, to this end, expressly let a lot of people get in, to foster more violence, to again pin it on the guns ,rather than themselves...\n\nand in my opinion the most violent and astute way to resolve it, is for the Cartels, to take care of those negative impacts on the trade...\n\nand so rather than have the slow current american approach, expeditive justice could return...\n\nremember in the spice trade, there are only willing participtants, the rest are dead, even if they don't know it yet... :).\n\nthis is one of the big mistake of the imposture of pedotrump, remember the wall is the people wall, to not have terminated this UNO... to eventually restore the real intend : a forum of discussion in the spirit of the constellation of nation.... \n\nagain, a failure ! so critical !",
				"added": 1618262241
			}
		],
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": [
			{
				"comment_id": 11,
				"body": "tyrannical silicon valley does it's best to not let us out of the corrals...",
				"added": 1617880515
			},
			{
				"comment_id": 12,
				"body": "they need our attentions, so they earn money, buy and cheat elections and rape kids in impunity, furthermore as the american counter intelligence are owned and powned and don't believe in the american ideals, the silicon valley is one of the gateway used by various forces seeking (justly) the end of the usa...\n\nso wake up or die.,",
				"added": 1617880591
			},
			{
				"comment_id": 13,
				"body": "furthermore one system is invitation for critical failure...",
				"added": 1617880704
			},
			{
				"comment_id": 14,
				"body": "it's a war, why are you sooo dumb and guilible and naive to believe that all people in the world are like you, and don't want to harm others? when will you wake up from this brainwashing...",
				"added": 1617880737
			},
			{
				"comment_id": 28,
				"body": "> [styromaniac](#comment_3049_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): BlurHY wanted to create something like that before he was likely disappeared by the CCP.\n\nor drafted by big tech.",
				"added": 1617894332
			},
			{
				"comment_id": 29,
				"body": "most coders have a too low awareness of the world around them, they are the perfect tools.",
				"added": 1617894359
			},
			{
				"comment_id": 34,
				"body": "> [houtje](#comment_5_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): I've been checking out IPFS and it works well enough... a big stepping stone to get people to migrate is ease of use and fast loading time. Are there currently public message boards hosted on the IPFS network?  [...]\n\nmoney has no value in the fields of war... only trust and will. example what was the value of money in the hills of hiwojima?",
				"added": 1617895981
			}
		],
		"1617878152_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 15,
				"body": "you fuking muppet use a web crawler... or maybe official website of the european human right court... it's on the front... they are so happy to serve the vaxxnazis...",
				"added": 1617884241
			},
			{
				"comment_id": 16,
				"body": "> [rolouzis](#comment_50_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): any link?\n\nserioulsy, people told you were dumb right, maybe you should listen to them...",
				"added": 1617884269
			},
			{
				"comment_id": 30,
				"body": "we will have to kill all the children of all those judges, how else to send a message clear, simple and concise :\n\nmy body, my choice\n\nas they don't want to ear it, because to them we are THEIR PROPRIETIES\n\nkilling their children, as innocents as they may be, is the only way to be fair and just.\n\nequitable.",
				"added": 1617894416
			},
			{
				"comment_id": 31,
				"body": "it's the old doctrine, don't negociate with terrorists, and personally I live under constant increasing terror.",
				"added": 1617894468
			},
			{
				"comment_id": 35,
				"body": "https://www.echr.coe.int/Pages/home.aspx?p=home&c front page, but they are shut down for \"maintenance\" right now or soon...",
				"added": 1617899624
			},
			{
				"comment_id": 43,
				"body": "> [rolouzis](#comment_51_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): Moronic in charge POS! That resolution applies to already accepted vaccines! Not COVID!\n\nin short you still are under the illusion that you live in a \"democratic society\", you believe there are laws, and that those laws are just.\n\nyou will learn.",
				"added": 1617906996
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 17,
				"body": "would it be possible to think about a vaxxfree city in the federation? like a science project city? \n\nthe vaxx nazis have everything ready.\n\nwe are sitting ducks.\n\nall our politicians will be bribed and or black mailed (500m euros to the greek one model)\n\nand then they take over our body, destroy our wills, a form of rape...\n\nit's time to stop the posing\n\ntsarniaev at least he would answer us, yes or no\n\nand in both way his words would have true meaning.",
				"added": 1617884780
			},
			{
				"comment_id": 18,
				"body": "I start to support tsarniaef for russian tsar...",
				"added": 1617884829
			},
			{
				"comment_id": 19,
				"body": "there you would see the browder and co, shit their pants...",
				"added": 1617884840
			},
			{
				"comment_id": 20,
				"body": "nudeland family would be dead.",
				"added": 1617884892
			},
			{
				"comment_id": 21,
				"body": "christians are too weak for this war...",
				"added": 1617884914
			},
			{
				"comment_id": 22,
				"body": "and those pretending to be it too.",
				"added": 1617884923
			},
			{
				"comment_id": 23,
				"body": "you take 3 mortal launcher in irak / syia / afg > move them to dc. locate the house of the nudelman, wait for confirmation of inside, fire fire fire, snipe if survivors, target energy plants / transformer move out relax... like the killers of seth rich...\n\nwhat is going wrong in the kremlin? papi putin only sees domestic opponents to be blind to the foreign ones?",
				"added": 1617885032
			},
			{
				"comment_id": 24,
				"body": "or drone bombs ! I mean wtf !!!!",
				"added": 1617885086
			},
			{
				"comment_id": 25,
				"body": "or a bio weapon... I mean what the fuck !\n\nis is the fault of the new wife ? sedentarizing putin? or maybe even sedating him?\n\nno vladimir, no violence, think about the children...\n\nsomething along the line?",
				"added": 1617885149
			},
			{
				"comment_id": 26,
				"body": "with tsarnaief in charge, the americans would kill themselves victoria nuland and her husband... because they will know that it's FOR REAL...",
				"added": 1617885200
			},
			{
				"comment_id": 27,
				"body": "I can wait to see tsarnief re negociate the quatari energy buying... ahahhaha...\n\nyeah, real tsar !",
				"added": 1617885237
			},
			{
				"comment_id": 39,
				"body": "where are we : https://www.zerohedge.com/geopolitical/merkel-demands-putin-reduce-russian-troop-build-near-ukraine\n\ndemands... Die Führerin fördert ! sie mussen befelh folgen commrad putin, ich bin die FUHRERIN !!!!!!!!\n\ntime to nuke it. once and for all.",
				"added": 1617899848
			},
			{
				"comment_id": 40,
				"body": "she would NOT dare to tsarnaief, unless she wanted to see berlin burn, subway attacks... chemical and bio warfare unleashed... it would be good, less kids...",
				"added": 1617899910
			},
			{
				"comment_id": 41,
				"body": "a real release of novichock in german subways in all the major cities? like hamburg, munchen, berlin, stutgart? how many death if in rush hours with 4 points of injection in all those cities? is it air born or only surface / contact? I guess there is something at least as good purely air born :).",
				"added": 1617900036
			},
			{
				"comment_id": 42,
				"body": "remember, they want to kill our children, we just kill their before they do ours... logic... and maybe, maybe ours will live... maybe.\n\nbut doing nothing they die...\n\nso...\n\nat least it's worth the try\n\nwar.\n\nsomething that putin NEVER did.",
				"added": 1617900106
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 32,
				"body": "in a sense, I am for totally enslaving the american people... In the sense they believed to be \"exceptionnal\" and as such have almost no chances to wake up...\n\nthey are typically the type to really believe, those are showers, specially if you sell them vip passes... they would even rush, just find a narrative for the exit of the \"shower\" that they would believe... like a disney land...",
				"added": 1617895088
			},
			{
				"comment_id": 33,
				"body": "\"mommy why no one get out of the shower?\"\n\"it's just steam, don't worry, oven for bread\"\n\"but but\"\n\"don't be conspriational, can't your read ; if we work well we will be free\"\n\"okay, I will behave\".",
				"added": 1617895363
			}
		],
		"1617899570_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 36,
				"body": "the founder of it, is a big pedo, I think it's read or something like this his name...",
				"added": 1617899748
			}
		],
		"1617821909_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 37,
				"body": "big",
				"added": 1617899775
			}
		],
		"1617894413_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX": [
			{
				"comment_id": 38,
				"body": "chan : general :).",
				"added": 1617899793
			}
		],
		"1617906794_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": [
			{
				"comment_id": 44,
				"body": "there is a config file... maybe start to play there :).\n\nI tried to upload a file, but it failed miserably... (900mo maybe too big?).",
				"added": 1617909168
			}
		],
		"1617909117_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 46,
				"body": "> [0x03s](#comment_1_1FT4okqXxiHYR1Q5msFx4KAyLq44eCbKFX): Well, that was to be expected, huh? They should realize it's not the 1920s anymore, they act like an empire yet they fail to even keep themselves together... The oldest \"Democracy\" in the world is dying\n\nyeah... what does this word \"democracy\" means?",
				"added": 1618261756
			},
			{
				"comment_id": 47,
				"body": "for me the uk is a constitutional monarchy...",
				"added": 1618261770
			},
			{
				"comment_id": 48,
				"body": "with a lot of problems... but not unsolvable...",
				"added": 1618261812
			}
		]
	},
	"comment_vote": {}
}