{
	"posts": [
		{
			"id": "0053a561-8a02-46de-8084-820a04526ae1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>4a9a1028-7769-4f40-8e80-33b658841dee\nWrong. Modern DRAM stores data for a minute up to a few minutes without power at normal temperatures. The liquid nitrogen meme is spread by retards who don't know better. The only reason you would need liquid nitrogen would be to move the RAM sticks to a lab where the information can be extracted. But you don't need to do that. You can just boot a USB sticks that dumps the contents onto its filesystem.\nWhat I did is not that impressive, because when rebooting the sticks only lose power and refresh signals for a few miliseconds at most if they do at all. More impressive would be to turn off the computer for a few minutes and then try to recover the data. But still, LN2 wouldn't help at all there, because by the time you get ahold of the computer you can just boot into the BIOS settings screen and wait until somebody hands you over a stick with the necessary dump tools.\nYou know what, I think I know where that LN2 myth must comes from. IIRC, early PCs used to test all the available RAM when booting, didn't they? That would destroy whatever information was stored there. As opposed to modern comptuers, where the BIOS probably only overwrites a couple megs at the beginning of the address space. So if you had one of these, or if you were really hardcore about preserving as much of the contents as possible, you would need a special device to dump the contents of a turned off computer's RAM. But in that case you have a whole new set of problems to deal with. Mainly condensation and the fact that LN2 isn't magical and the contents are still going to be erased, except instead of 5 minutes it'll take half an hour.\nThe problem of using Loonix for dumping is that it obviously overwrites quite a lot of the address space itself, and secondly in modern Linux distros you need to download, compile and load an additional kernel module to get /dev/mem and /dev/kmem like they used to exist in old kernel versions.",
			"time": 1567011709300,
			"files": "[]",
			"last_edited": 1567011811000,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2cbee092-5b44-4bcb-a242-df11ea82d8b1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Anyone feeling dopamine withdrawal yet?",
			"body": "This place is fucking dead. Cuckchan is literally unusable. Every other small imageboard is dead too.\nWhat are you guys doing to get your dopamine hit? Is this the same levels of dopamine some fat nerd posting on USENET in the 80s would be getting?",
			"time": 1567019592300,
			"files": "[]"
		},
		{
			"id": "5db5c762-f51a-4870-a2a9-d528a6a729ad",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>12881212-8a99-4ba9-abcb-dfaf609f976e\nIt seems you are correct. I tried to hold a test patter for a full minute and it wasn't retained. Now all we need is for someone to do the experiment with LN2. Still, it doesn't change the fact that the memory can be dumped with a simple reboot, because as I mentioned, it cuts power to the memory controller for a few hundred milliseconds if even that (or maybe not at all).",
			"time": 1567026613300,
			"files": "[]"
		},
		{
			"id": "6e62f8d5-c3dc-4d5a-b2d5-bddf76324c04",
			"directory": "users/1LkM33Rh7DP79wJFKKCYiFKv6tkgyXtnGC",
			"uri": "MT",
			"thread": "31c9ab00-cc76-4e2a-8315-643bdf9c9adc",
			"body": ">>31c9ab00-cc76-4e2a-8315-643bdf9c9adc\nCould you please stop flooding the new posts list with bumps?",
			"time": 1567027138363,
			"files": "[]"
		},
		{
			"id": "f87d531b-7362-43a9-80c5-fe427a2d70cc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b0206e23-ef4e-4cc3-9bcd-b62d625e4866",
			"body": ">>a99fe8ae-252a-404e-bd12-f786d814fe68\nIs that supposed to be a bad thing?",
			"time": 1567030732585,
			"files": "[]"
		},
		{
			"id": "3b5f6e0e-740c-4d71-a6fc-0e1702cba1bd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b0206e23-ef4e-4cc3-9bcd-b62d625e4866",
			"body": ">>c501be04-7c88-4225-acc6-26d35c65085b\nI do.",
			"time": 1567031500972,
			"files": "[]"
		},
		{
			"id": "f05a59cf-5930-4873-964c-a5678dab5014",
			"directory": "users/1BHW9TDfbFkuPJaSZyoUTyHosRnUsFZHca",
			"uri": "pastebin",
			"thread": "c47bc55a-cc62-4bf9-9844-342950a04869",
			"body": "Most of your links don't even work. Either get your shit together or stop spamming this crap.",
			"time": 1567032965900,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}