{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": [
			{
				"comment_id": 1,
				"body": "> [kimet](#comment_1_14tvQQLMmtDF2Wd7NozrVmymbi2qdDqpC2): Hola bitbit2,llevo en internet desde el año 1995, en ese momento yo tenia 15 años, aunque quizas a ti te gusten incluse más jovencitos aún.Recuerdo con mucho afecto aquellos dias, donde se estaba fraguando a gran velocidad,  un cambio de paradigma tecnologico como fue internet. Habia una libertad y hasta gran grado de anonimato, muy similar al que crees que tienes ahora. La técnologia era fantastica, pero el uso que le han dado las personas tiene sus luces y sombras, evidentemente tu frecuencia mental no esta en la sombra, sino en la más perversa de las oscuridades.Lo más aterrador, és que alguien que sufre la enfermedad mental de excitarse con pobres victimas que son niñós y por lo tanto, no estan formados, ni fisica ni mentalmente y que arrastraran un trauma de por vida, lo frustrante, es que 24 después de usar internet, proyectos totalmente legitimos como zeronet, se vean ensuciados por gentuza como tu. En su dia internet fué en sus  inicios, algo que se vendió la idea a la gente, a través de los medios de la epoca mendiante ingeniería social, amplificando las sombras en lugar de las luces de la tecnologia, ya que estaba lleno de gente muy peligrosa, pedofilos, maleantes, etc, y és cierto que los hay, pero no és cierto que este lleno.Por suerte, hay mucha más gente buena que mala en este mundo, pero la perversa realidad és que los malos soys los que jodeis a los demas.Igual que ha pasado con el bitcoin, toda la maquinaria propagandistica de la banca tradicional ha hecho bandera de las sombras en lugar de las luces de la técnología.Te imagino a ti, en una solitaria habitación, con tu falta de autoestima, tu perversa cabecita como habrá dado con proyectos como zeronet? No habrá sido por una inquietud técnica no, quizas simplemente estés en un grupo de pervertidos en telegram, ya que en whatsap ya no os es seguro, donde compartis cualquier tipo de deleznable material, pensadote que estais tecnicamente protegidos, tranquilo, és cuestión de tiempo que la gentuza como tu acabe donde se merece. Pues todas las cautelas técnicas que crees que has tomado, no te serviran de nada el dia que tu instinto depravado te delate, y formes parte de la corrección necesaria de tantas cosas a corregir que tenemos pendientes aqui, en el planeta tierra, tu mente, és una de esas correcciones necesarias.No quiero un internet controlado ni censurado, pero si tienes un problema mental, que no solo te afecta a ti, sino que destroza de por vida a las victimas que la sufren, o ponés de parte en corregirte, o serás corregido por los que no aceptamos la existencia de gentuza como tu. Nunca una frase tan breve como la tuya, me habia hecho, teclear tanto. Ojalá la buena gente, que és mayoría, conozcan y usen herramientas como esta para organizarse y hacer un mundo mejor.\n\nExcepto que se dé un cruce de inteligencia excepcional y la suma necesaria de conocimientos técnicos y el más extremo sentido de la paranoia y por último un grave trastorno equivalente a la excepcionalidad de la inteligencia dotada, toda esta puta gentuza que cree estar en el anonimato haciendo putadas al resto de la humanidad suelen ser cazados al primer paso en falso.",
				"added": 1576023608
			},
			{
				"comment_id": 2,
				"body": "> [rambo214](#comment_1_1FRzGqvVTChBnmwyHc9E7VsXB3vULbbMXY): Lo mejor sería algun sistema de votación. Que impidiese que engendros enfermos se quedasen cada vez mas acorralados. Así podría despacharlos agusto con la M60.\n\nCon borrar el users.json o reinstalar el zeronet lo tienes de nuevo peinado de otra forma. No es solución alguna a mi parecer.",
				"added": 1576024225
			},
			{
				"comment_id": 3,
				"body": "> [havin](#comment_5_1AvPdG8fBjmpY9xYBQBNdYatfAcxuMqy3E): Respondiendo a la pregunta. No he visto nada de porno en ZeroNet. Aun.\n\n¿Y los vídeos que hay subidos en zeroUp con nombres tipo \"my ass is excited\" que es, un documental sobre hemorroides?",
				"added": 1576024322
			},
			{
				"comment_id": 4,
				"body": "> [cmkat](#comment_2_1Hw7w7Swdeexw86XmyfMHLbsSpzzH4yk5z): ZeroNet un poco si debería tener un sistema de karma para los trolls a pesar del anonimato... y segun la pagina de quien sea también, un poco de organización.\n\nNo puedes evitar que vuelvan, y no puedes censurar que entren bajo ningún concepto. Si implantas una forma de censurarlos, estás creando la misma forma para que yo te pueda censurar a tí. No con ids, ni con reputacion ni karma ni ostias. Todo se puede incrementar/farmear artificialmente y usarlo en tu contra. \n\nEl punto de vista que considero que debería adoptarse, es que el usuario sea el que pueda crear filtros para la visualización del contenido, en plan blacklist de usuarios, así como de ocultar/borrar de parte del usuario el contenido que contenga tags o palabras censuradas por el mismo usuario. Así como un \"zervicio\" generalizado que incluya a usuarios votados negativamente, para que la gente que no quiera estar gestionandose la vida pueda usar una lista \"comunitaria\" de forma opcional.\n\nYo propongo algo que se llame tr0lls (zero trolls) y que contenga al menos los IDs de indeseables y sus sites/blogs, etc.\n\nInsisto, la censura la ha de imponer uno mismo a su contenido, ni a otros ni a la red. De lo contrario ni esto ni nada tiene sentido.",
				"added": 1576024641
			},
			{
				"comment_id": 5,
				"body": "> [riotpulv](#comment_8_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): No se lo tomen tan en serio, puede ser un niño rata brasileño tratando de llamar la atención.\n\nTotalmente, yo también creo que es alguien con pocos amigos intentando conseguir algún feedback, de ahí la apuesta de poner algo polémico. Será un subnormal, como poco.",
				"added": 1576024779
			}
		],
		"2_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 6,
				"body": "> [suguri](#comment_2_15qnbTzjvJsd1m4WNij5aFHzsEHPy5y1DL): El problema de ZeroNet es que no tiene implementado un sistema de ID en frío (funcionaría así como las criptomonedas en frío en una cripto-billetera USB). Hasta ahora, si elimino mi cliente de ZeroNet, se acabó el nombre de usuario anterior con el que estaba familiarizado.\n\nEs que hay que leer para estar informado. Hasta donde he podido leer en algún warning dentro de IDs cuando abrí este cliente zeronet por primera vez, con guardar tu \"users.json\" guardas tu usuario y con ello tu firma, que te identifica como \"tu\" en zeroID.\n\nSi lo buscas en /data, podrás ver tus ids, tus private_keys, etc. Eso es tu DNI aquí.\nSi tienes sitios privados, no estaría demás guardarlos, porque si todos los demás borrasen tu site por mucho certificado que guardes no tendrías el contenido asociado al mismo.\n\nLo ideal es llevarte la carpeta /data completa si cambias de sitio, para seguir llevando tu identidad y la información relacionada con tu perfil.",
				"added": 1576025654
			},
			{
				"comment_id": 7,
				"body": "A zeronet solo le falta la publicidad adecuada, porque lo demás diría que lo tiene todo. Sitios, framework, tor integrado en plan zeroconfig, y una interfaz MUY bonita. No me impresionaría que zeronet fuera la precursora de todas las redes \"dentro de la red\", subinternetes dentro de internet para evitar ser censuradas. De hecho, tiene el nombre ideal, partiendo de 0.",
				"added": 1576025811
			},
			{
				"comment_id": 8,
				"body": "> [cmv](#comment_2_1LAL1KdBuEmqPrBs8mpqAaZmLuz5rhGnyj): Más usuarios implica más y mejor contenido, pero es muy difícil evangelizar sobre algo que no es mainstream\n\nEl truco para cambiar algo impuesto no es luchar contra lo anterior, es crear algo nuevo que deje a lo anterior a la altura del betún. Creo que zeronet ha hecho un trabajo excelente poniendo la red a golpe de click, que suele ser el principal problema por el cual algunas cosas no fraguan (la -perdon- inutilidad e ignorancia del usuario medio de internet). No es la primera vez que me dejo caer por zeronet, pero creo que es algo que tarde o temprano tendrá éxito, como plataforma YA creada, así como concepto, de crear subredes tuneladas dentro del propio internet, para que internet no sea jamás un rio abierto donde se vé lo que hay, sinó simplemente una autopista de corriente eléctrica, de unos y ceros, puramente.",
				"added": 1576025992
			},
			{
				"comment_id": 9,
				"body": "> [upnet](#comment_2_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV): Publicitarlo en los centros de enseñanza; de ESO para arriba; hablar a los amiguetes  y convencerles de las bondades del anonimato usando nuestro dominio @zeroid.\n\nzeronet no es anónima por diseño. es gracias a tor que la red se convierte en algo \"mas anónima\". Si te dedicas a decir que zeronet es anónimo, en vez de hablar de zeronet como red, y de tor como sistema de ocultación, estás haciendo un flaco favor a gente que lo terminará usando mal.",
				"added": 1576026295
			},
			{
				"comment_id": 10,
				"body": "> [selfsigned](#comment_9_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): zeronet no es anónima por diseño. es gracias a tor que la red se convierte en algo \"mas anónima\". Si te dedicas a decir que zeronet es anónimo, en vez de hablar de zeronet como red, y de tor como sistema de ocultación, estás haciendo un flaco favor a gente que lo terminará usando mal.\n\nEs más, me atrevo a añadir, que una vez escribes en \"cualquier\" sitio, con \"sencillo\" análisis de tu semántica pueden saber quien, donde y como. Hasta mi abuso de \"comillas\" se podría utilizar para saber que xxxxxx soy yo, porque TU escribes \"en principio\" igual, hables de lo que hables. Muletillas, expresiones, ediciones a posts para corregir la ortografía y otras manías que te delatan de forma flagrante.\n\nYa estuve pensando un día en que se podría usar algún sitio que utilice tor y las webs de traducción para anonimizar el contenido escrito en plan indio del google. Que en vez de tus palabras sean la traducción de tus palabras al inglés y del inglés de nuevo al castellano, dejando una versión MUCHO más impersonal del contenido.\n \nAhora mismo, si les diera la puta gana a quien sea que tenga conocimientos serios, podrían saber mi nombre y apellidos. Es así de sencillo. Si, hay que ser un paranoide y un capullo para rastrear a alguien por la semántica, pero si lo hacen analizando tu caligrafía, imagínate lo que no se podrá hacer con la semántica.",
				"added": 1576026584
			},
			{
				"comment_id": 11,
				"body": "> [1r34l](#comment_2_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH): La única gracia que le veo a la ZeroNet es compartir información comprometida o censurada que pueda acarrear consecuencias como ya ha ocurrido alguna vez en foros famosos. Para el resto, ya existen los foros normales.\n> Internet es cada vez más restrictivo, la gracia es volver al internet primitivo y apartarnos de la transformación del Internet en la nueva TELEVISIÓN. Con el tiempo nos darán motivos para buscar una alternativa.\n\nPues yo la gracia se la veo a que no es un foro, es UNA RED completa en base al P2P, lo que tarde o temprano podría convertirse en la única forma inteligente de usar internet.",
				"added": 1576026717
			}
		],
		"1_1BoazbM5hxwjz51eQ8PYHwSTFNFe2a81ec": [
			{
				"comment_id": 12,
				"body": "EL TÍPICO ENGAÑABOBOS\n\nPuto anormal. Habría que ser tremendamente subnormal para darte a tí una wallet para crackear y fiarse de tí.\nPor otro lado, no serás tan bueno cuando necesitas buscar clientes para ganar dinero ...\nNo se, yo creo que la propia oferta que pones aquí deja en evidencia tu ineptitud.\n\nYo aquí veo claramente zeroclients.",
				"added": 1576026984
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 13,
				"body": "¿Podrías elaborar tu queja un poco más? Me inquieta mucho conocer los aspectos básicos como \"cuantos clientes zeronet albergaban una copia de tus ficheros\". \n\nPuede y dígo sólo que puede que no hayas entendido el concepto p2p en sí mismo, por muchas palabras como \"rooter\" que escribas, que por cierto está fatalmente escrita.\n\nY antes de que llames a un concepto pre-alfa y ridículo en la misma frase te aconsejaría que te crees tu puta red privada perfecta y luego vuelvas a quejarte.\nSi has perdido 4 meses de trabajo es porque eres un inútil en la toma de decisiones y en el concepto backup, por no hablar de la automatización para publicar contenidos.\n\nLlamas a una red funcional \"concepto\" y yo me tengo que reir en tu puta cara, lo siento. Lo siento de ser el verdugo, pero me toca mucho los cojones la gente que no aprecia algo sólo porque no lo ha sudado el mismo.\n\nSi los proyectos basados en zeronet te parecen todos EXTREMADAMENTE inteligentes, es en contraste de tu estupidez. \n\nRespecto a \"de un grupo muy pequeño de desarrolladores\", podrías también alegar que la teoría de la relatividad es una puta mierda porque la hicieron 4 matados con 10 pizarras.\n\nSolo puedo decir, JODETE y si no te gusta zeronet no pongas tu trabajo aquí 10 veces porque haciéndolo me pareces 10 veces más subnormal que cuando te leí la primera vez.",
				"added": 1576027570
			}
		],
		"2_12YzecmCkUZujXT2NVvQiZQiVhMfSsox1J": [
			{
				"comment_id": 14,
				"body": "Nada. Es inverosímil pensar que algo tan grande como es hoy FSF o Linux se venga abajo solo porque una persona deje el cargo. Al menos eso me gusta pensar, porque sinó los demás no pintamos una mierda, solo Stallman, el solito representa a FSF. Es como decir que un equipo de fútbol no vale nada porque se marcha el portero. Se pone otro y listo.",
				"added": 1576028264
			},
			{
				"comment_id": 15,
				"body": "> [libertario](#comment_7_1NR75UCuhd6qS5ibDyo5WYXE8zaRZGncrs): Espero que echen a todos los pedófilos de la FSF\n\nTronco, mezclas temas mediáticos sin ton ni son. Habla de la FSF y la marcha de su fundador, no de si tiene barba o le gusta no pagar por ir al baño. Entiendo que lo que comentas es algo importante y de traca, pero mezclar al tuntún no ayuda.",
				"added": 1576028361
			}
		],
		"1_15eTuvZsi1KYGhCNC9ye8zgZMXNBZ1Na42": [
			{
				"comment_id": 16,
				"body": "> [zerotecerdo](#comment_3_1Gs2ZLXiNHLXuWeX7yxS9FfKuXmRvnpKAp): ¿Tú estás nervioso?\n\nBe as leio la bente",
				"added": 1576029604
			}
		],
		"1_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": [
			{
				"comment_id": 17,
				"body": "Yo creo que no necesitas ver porno casero para llegar a una deducción sobre la Justicia española por dos motivos;\n1) La escasa relación entre ver una prueba de vídeo porno con el estado general de la Justícia Española\n2) Lo obvio que resulta la Justicia Española cuando los Jueces del Tribunal Supremo se eligen a dedo por los partidos políticos.\n\nMe atrevo a decir que te puede el morbo más que el sentido de la Justícia.",
				"added": 1576029887
			}
		],
		"2_1H79P7Dn1eqyVFFhsPux4ZyApMuhzhwXCS": [
			{
				"comment_id": 18,
				"body": "Por un lado, es cierto que creando algo antes se genera una mayor confianza, pero no me parece que sea imprescindible para publicar una solicitud de trabajo al respecto, para eso están las entrevistas y las pruebas de aptitudes.\n\nMe parece un poco rancio decirle a alguien que pierda su tiempo en hacer algo útil y gratis y que luego se verá.\nEs como si te pongo a servir copas gratis y ya según me guste o no me guste te contrato o te vas a la calle sin nada.\n\nExisten muchas formas de trabajar \"el open source\", incluso puedes hacer un software opensource y vender tu propio servicio.",
				"added": 1576030210
			}
		],
		"2_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 19,
				"body": "¿Y no sería mejor contactar con la wikipedia REAL y proponer una migración del contenido a esta \"base de datos\" decentralizada? Siempre se están quejando del coste de los servidores :-) ... o incluso mejor, poner un bot a copiar y pegar directamente de la wikipedia. \n\nPor un segundo me ha parecido creer que piensas que el contenido y la calidad actual de la Wikipedia se consigue con 4 matados hispanohablantes. Lleva mucho tiempo, recursos y conocimientos.\n\nHe entrado por insana curiosidad y no tenéis ni contenido. No se ni para que he entrado, porque mi suposición era mucho más indulgente que lo que pienso ahora de la realidad. Un sitio vacío, mucho más vacio que un blog de mierda con 4 entradas de algún matado.\n\nNo tenéis ni la gente, ni la estructura, ni la capacidad humana de hacer una zer0pedia. Sin fondos, sin gente, sin contenido y sin sentido.\n\nA últimas, he visto que el logo \"ni carga\", y me has recordado a mí cuando no tenía ni idea de programar, intentando hacer proyectos creyéndo que con darle un nombre y un logo era suficiente...",
				"added": 1576031071
			}
		],
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 20,
				"body": "Para un resumen no está mal. \nCreo que te centras demasiado en el problema y poco en lo que puedes hacer tú por cambiarlo. \n\nEn lo que más razón te puedo dar, es que el sistema de votar a un partido que luego hace y deshace me parece el sistema más absurdo y de gilipollas jamás creado. Un sistema de votación mucho más granular sería mejor, por no hablar de sanciones o penas de cárcel a quien prometa el oro y el moro y luego sólo te cague en la cara.\n\nEl problema de este puto páis es que mentir no está mal, el alcohol no es una droga, y dejarte convencer por cualquier gilipollas que te hable es ser ciudadano y sociable. Si a todos estos que prometen mierda les escupieran sus propios votantes en la cara otro gallo cantaría. El problema auténtico es que españa está llena de subnormales y como supongo te figuras, hacen falta muy pocos lobos para controlar cientos de ovejas.\n\nA la gente de este país le faltan huevos para pensar, porque eso cansa mucho, y oye, ya tienen bastante con trabajar como putos animales para no tener ni un euro en el banco a fin de mes. Si eso no les hace pensar, nada puede.\n\nPor mí sinceramente que les jodan a todos los anormales de este país.\n\nNo es que me dé vergüenza ser Español, es que hay días que siento vergüenza de considerarme un ser Humano inteligente, así que te puedes imaginar lo que pienso del resto.\n\nLa felicidad tiene que venir de tí mismo, así como el cambio, si tanto lo necesitas.\n\nPD: Entre todo estoy la crudeza de mi lenguaje, también siento admiración en el mismo grado de intensidad por gente que ha sacrificado su tiempo, su carrera e incluso su propia vida por defender cosas que vale la pena defender, porque quien ama, odia, y viceversa.\n\nSuerte!",
				"added": 1576032250
			}
		]
	},
	"comment_vote": {
		"1_14tvQQLMmtDF2Wd7NozrVmymbi2qdDqpC2": 1,
		"3_1Gs2ZLXiNHLXuWeX7yxS9FfKuXmRvnpKAp": 1
	}
}