{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1557855329,
			"title": "Tried to write a new blogging platform for ZeroNet",
			"body": "Hello everyone. I stumbled upon ZeroNet a couple of weeks ago and I started writing a blogging platform trying to understand how it works.\n\nAnyway, I 've ended up with more questions than answers, but stabilizing the platform with stick and glue, I have come to a first crude result.\n\nIf you want to check it out, you can find it here: http://127.0.0.1:43110/1JrT4VnMgpm6GgHV6R9yvgp5WkY8yTnRr7\n\nI intend to work more on it and add some more features, the lack of which at the moment is obvious.\n\nWould like to hear some thoughts\n\nThank you",
			"added": 1557855328
		},
		{
			"topic_id": 1558288538,
			"title": "ZeroPress version 0.3",
			"body": "http://127.0.0.1:43110/1JrT4VnMgpm6GgHV6R9yvgp5WkY8yTnRr7/\n\nThis version comes with the ability to add images inside your posts. It is still in a primitive stage, so after insertion you will have to drag and drop it at the point of your document you want it to exist. The feature where it will be placed right where you type, will be implemented in a later version. Not the next one.\n\n\nIt also comes with some minor upgrades to the code which from now on will also be available on github. ZeroNet GitCenter will be next.\n\nhttps://github.com/cleancodetech/ZeroPress",
			"added": 1558288536
		},
		{
			"topic_id": 1559820421,
			"title": "ZeroPress version 0.4",
			"body": "Hello all.\n\nI made some further modifications to a blogging platform I try to write for ZeroNet on my free time:\n\nAdded an assets panel in the admin section, where users can manage their uploaded images. Using the interface, one can also find unused images, meaning images that are not used in some way either on posts or on the site in general and they can delete them.\nAlso the Social Menus were moved to their own panel and reddit is also made available.\nSome changes to the theme as well, trying to tackle the problem where an admin would create a new post but it would not appear on the front side.\nAlso added a viewport entry on the content.json file. Props to styromaniac@kxoid.bit\n\nYou can find it here: http://127.0.0.1:43110/1JrT4VnMgpm6GgHV6R9yvgp5WkY8yTnRr7\n\nAny feedback would be appreciated. Thank you for your time :)",
			"added": 1559820418
		}
	],
	"topic_vote": {
		"1558291815_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1557855329_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": [
			{
				"comment_id": 1,
				"body": "> [duende](#comment_54_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): What a piece of shit. Think about killing yourself.\n\nWell... I guess constructive criticism is always welcome :)",
				"added": 1557872202
			},
			{
				"comment_id": 2,
				"body": "> [splitpierre](#comment_1_1Asfj3KCe238Yczd9agP9CzALUdfujbK5p): Bit ugly, but interesting, can we take a look at code?Might even contribute if interesting enough.\n\nJust need a couple of days to rewrite some embarrassing parts, and i will make a github. Thank you for your reply",
				"added": 1557902317
			},
			{
				"comment_id": 3,
				"body": "> [klu9](#comment_168_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @gtat314: Interesting. One issue that happens for me (Vivaldi 2.5.1525.41 for Windows desktop) is that the header image on a post ( example ) takes up the entire screen and I have to scroll down before I can even see the top line of the article. [...]\n\nThank you. I will have to take a look at that and come back to you.\n\n> [eightyfour](#comment_105_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): He does that to everyone, nice to someone attempt a completely different style of blogging on here.\n\nThank you for your comment",
				"added": 1557937738
			},
			{
				"comment_id": 4,
				"body": "Ok, so i have moved to version 0.2, which comes with an inner updater, so that all future version can be installed through the admin panel. Don't have anymore time today, but tomorrow i will upload the code to a github and gitcenter",
				"added": 1558011701
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_839_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @gtat314Post modification is not reflected on the front endi clonned your blog and editted the default blog post, but on the homepage i still see the blog post \"ZeroPress version 0.3\", its text is \"version 0.3May 19th 2019This version comes with the ability\"...When i click \"Read more\" it redirect me to \"/post.html?id=48\". When i try to edit it via /admin/editPost.html?id=48 , i see my modified post, but on the site front end, it shows not modified default post text and title. [...]\n\nHello. Thank you for your feedback.\n\nThis is not a ZeroPress problem. This is how ZeroNet works. Your changes will not be visible to the public, until you have seeders for your site. If your new post is visible in the admin panel but not in public view, then your new post will appear to all visitors of your site, regardless if you do not see it at the moment. Try restarting ZeroNet. This usually make the changes visible to you as well. The same goes for edited posts. Changes will not be visible to public view, until you have seeders to your site, or you restart ZeroNet.\n\nI am writing a guide at the moment, and probably tomorrow there will be a better explanation at the moment.\n\nPS: Yes, the image will not be deleted. For the time, you 'll have to remove it manually. The deletion of images not in use, is an upcoming feature",
				"added": 1558440605
			}
		],
		"1558288538_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": [
			{
				"comment_id": 5,
				"body": "> [styromaniac@kxoid.bit](#comment_42_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): add to content.json width=device-width\n\ncan you elaborate a bit please?",
				"added": 1558289604
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac@kxoid.bit](#comment_43_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): \"viewport\": \"width=device-width, initial-scale=1.0\", [...]\n\nthank you. did not know that. will add.",
				"added": 1558289897
			},
			{
				"comment_id": 7,
				"body": "> [filips](#comment_28_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Can you add some installation and usage guide? And also README.md on GitHub?\n\nGood idea. Will be adding the next days. Thank you.",
				"added": 1558293912
			},
			{
				"comment_id": 8,
				"body": "> [traveller](#comment_1_1Dk3PiZs78AsJ5vRY5dq891VqAovECQbzx): hello & thanks for ZeroPress :) are there instructions anywhere to explain how to install & setup? I'm using Ubuntu 18.04. I've installed to my home directory.\n\nThe first set of instructions is being written as you read these lines. Apart from this, there is no special installation. You just go to the link above, you clone the site, you go to the admin panel and you start writing posts\n\n> [ict21](#comment_2_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v): looks nice. I guess people want a page like this.\n\nthank you :)",
				"added": 1558362234
			}
		],
		"1558637285_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [],
		"1559937565_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 11,
				"body": "The fact that it provides a last small glimpse to how internet should be and reminds how easily we traded our freedom for money.",
				"added": 1559948316
			}
		]
	},
	"comment_vote": {
		"168_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"42_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"43_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"28_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"2_1Dk3PiZs78AsJ5vRY5dq891VqAovECQbzx": 1,
		"839_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}