{
	"next_comment_id": 12,
	"user_name": "D14na",
	"hub": "1N9sU8qh3S4ei9PHE1qQyYPbcckJomvwMd",
	"post_like": {
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535867064": 1535922729,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536629576": 1536828643
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535910692",
			"date_added": 1535920190
		},
		{
			"comment_id": 2,
			"body": "\"Get off of Facebook and put your face in a book!\"",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1535867064",
			"date_added": 1535922785
		},
		{
			"comment_id": 3,
			"body": "@styromaniac i'm not sure what I changed, it was a while ago, and I know I had to hack quite a bit to get my apps working on mobile. send me the link to the image and I'll diff the proxy against the original source code to see where the change occurred.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536689421",
			"date_added": 1536700999
		},
		{
			"comment_id": 4,
			"body": "@styromaniac I have the viewport set as `<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />` by default, perhaps that's having an affect on your responsive image?\n---\nEDIT: You can \"manually\" set the viewport in `content.json`.\nhttps://zeronet.readthedocs.io/en/latest/site_development/content_json/#viewport",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536689421",
			"date_added": 1536701278
		},
		{
			"comment_id": 5,
			"body": "> 4Kave is the 4K kave\n\n@styromaniac was testing [Zitetags](http://127.0.0.1:43110/zitetags.bit) (locally, haven't published yet) and I thought this was worth while http://127.0.0.1:43110/4kave.bit. you'll be able to use your zeroid to manage it (or claim/move it entirely) once the zite is done.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536629576",
			"date_added": 1536828942
		},
		{
			"comment_id": 6,
			"body": "> My ZeroID can be used to manage the zitetags entry for 4Kave once zitetags is done?\n\n@Styromaniac: yes! making a simple GoDaddy-like registrar to help manage .bit addresses. I really feel for what happened to kaffie when her name got swiped by an opportunistic squatter. more help is needed to manage these .bit addresses. keeping it simple at first, (1) will provide notifications (maybe ZeroMail or other) when you need to renew, (2) you'll be able to point it to a new address, and (3) claim it all-together by providing a namecoin address (then YOU become the custodian).\n\n---\n\nthe problem is that I believe most users will WANT us to be their domain's custodians (people love convenience) and I KNOW (from past crypto projects that stored private keys) that's a horrible, Horrible, HORRIBLE idea. so we're trying to find a reasonable way to secure the names WITHOUT becoming a target for hackers. we've been leaning towards OFF-LINE wallet, but that's got a lot of logistics attached to it. hopefully will be ready in the next few weeks though",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536629576",
			"date_added": 1536884880
		},
		{
			"comment_id": 7,
			"body": "@Styromaniac should be working now. the gateway WILL fail from time to time. when I'm updating zite limits, I have to reset it a couple time, but other than that it's been solid so far.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536969622",
			"date_added": 1537250774
		},
		{
			"comment_id": 8,
			"body": "@Thornranger I have an app in dev called [Zeronet Explorer](http://127.0.0.1:43110/zeronetexplorer.bit) you can try, but the last version was pretty buggy as well. have a newer (much better) version, really need to push that update soon.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536969622",
			"date_added": 1537250891
		},
		{
			"comment_id": 9,
			"body": "@Styromaniac to be honest, I have no idea what the purpose of `initial-scale=0.8` is, I've only ever seen it set at `1.0`. trial and error always seems to work best for me lol",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536981770",
			"date_added": 1537251012
		},
		{
			"comment_id": 10,
			"body": "@Thornranger: yeah, that first release was a lil too buggy. I have an update, but its also got some issues with peer discovery that I'd like to see resolved before we push it out. thank you for the support and I assure you we're working to get this new mobile client out to the community asap.\n\nit's likely that we're going to push a web client sooner than the Android client (same JS codebase, but easier to overcome certain bugs). what's notable about the web client (and the next Android client) is that they'll offer a built-in (free) VPN powered by [SUPeer.](http://127.0.0.1:43110/supeer.bit). Will announce in ZeroTalk when its ready for testing.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536969622",
			"date_added": 1537527716
		},
		{
			"comment_id": 11,
			"body": "@Styromaniac is it possible for you to be more specific? (feel free to ZeroMail) we actually do have redirects built-in for the worst of it and our team is working on a project now (http://127.0.0.1:43110/zerofilters.bit) to address the rest (of anything illegal). i always welcome feedback from the community, as I'm still learning and exploring and its very possible that I've missed something big. thanks for the feedback!",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1537569326",
			"date_added": 1537837071
		}
	]
}