{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Cabal - bate-papo privado descentralizado de código aberto",
			"body": "- https://cabal-club.github.io/\n- https://github.com/cabal-club",
			"added": 1560290815
		}
	],
	"topic_vote": {
		"1_165jJot18hEonJPMXHYFo4D2P1wX5TqYSZ": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 1,
				"body": "Esta série interessante explora sob uma nova perspectiva as grandes batalhas da Segunda Guerra Mundial, analisando as decisões, os dilemas e os desastres dos grandes generais de ambos \nEpisódio 1…….A Batalha de Singapura\nEpisódio 2…….A Batalha de Midway\nEpisódio 3…….A Batalha de El Alamein\nEpisódio 4…….A Batalha de Stalingrado\nEpisódio 5…….A Batalha de Bulge\nEpisódio 6…….A Batalha de Kursk\n\nhttps://www.youtube.com/playlist?list=PLrq-22ib8kR0ElECdAhzsRWlFyDylHskK",
				"added": 1560290956
			},
			{
				"comment_id": 2,
				"body": "#Estratégias Militares\n- https://www.youtube.com/playlist?list=PLHU9D8D3exmVvwVWB2YQ-DMyzkMjcWUf1",
				"added": 1560291023
			},
			{
				"comment_id": 18,
				"body": "#65 Ensinamentos de Sun Tzu no Livro ‘A Arte da Guerra’\n\nO livro A Arte da Guerra de Sun Tzu é um rico e verdadeiro tratado sobre planejamento, estratégia e liderança. Peça a 100 pessoas para nomearem o melhor livro de negócios que já leram, e provavelmente boa parte dirá “A Arte da Guerra”, ou pelo menos citará como referência.\n\nTudo bem que “melhor” ou “pior” sejam conceitos relativos, mas esse livro de Sun Tzu definitivamente precisa estar na lista de livros de quem deseja aperfeiçoar conhecimentos práticos sobre disciplina, tática, comando, lealdade, gerenciamento de recursos, noções geográficas, enfim, sobre a natureza da guerra e o sucesso militar (ou organizacional).\n\nSun Tzu foi um general chinês que viveu há mais de 2.500 anos atrás, possivelmente durante o século 6 a.C. Até hoje, seus conselhos inspiram legiões de líderes a motivarem outros ao sucesso, honra e glória em suas diferentes métricas e formas.\n\nA Arte da Guerra é um dos mais antigos tratados de guerra, se não for o mais. Embora as táticas militares e condições sistêmicas tenham mudado desde a época de Sun Tzu, seus ensinamentos teriam influenciado, segundo a Enciclopédia Britânica, alguns generais modernos como Mao Tsé-Tung na batalha contra os japoneses e chineses nacionalistas, e seria possível de imaginar que tenham auxiliado vários outros líderes em guerras recentes.\n\nConsiderando a atual conjectura social e geopolítica, podemos dizer que, hoje, esse livro é destinado a substanciar uma guerra específica: a das empresas no mundo dos negócios. Assim, A Arte da Guerra serve como manual tanto para estrategistas militares quanto para economistas e administradores.\n\nA Arte da Guerra é composto por 13 capítulos, cada um deles concentrado num aspecto diferente da guerra. É um livro absurdamente inteligente, poético, útil e que gera efeitos práticos reais se forem de fato aplicados.\n\nNo livro, Sun Tzu parte da premissa de que é melhor vencer a guerra antes mesmo de desembainhar a espada; melhor ainda, despender o inimigo sem precisar fazer nada. Segundo ele, a vitória conquistada penosa e custosamente sempre acompanha um gosto amargo de derrota, mesmo para os próprios vencedores. Daí tiramos uma grande lição: a primeira batalha que devemos travar é contra nós mesmos.\n\nPara fins de recomendação do livro, aqui estão 65 ensinamentos valiosos de Sun Tzu em A Arte da Guerra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?165jJot18hEonJPMXHYFo4D2P1wX5TqYSZ_0",
				"added": 1560308133
			},
			{
				"comment_id": 19,
				"body": "#A Arte da Guerra\n\nA Arte da Guerra, é um tratado militar escrito durante o século IV a.C. pelo estrategista conhecido como Sun Tzu. O tratado é composto por treze capítulos, cada qual abordando um aspecto da estratégia de guerra, de modo a compor um panorama de todos os eventos e estratégias que devem ser abordados em um combate racional. Acredita-se que o livro tenha sido usado por diversos estrategistas militares através da história como Napoleão, Zhuge Liang, Cao Cao, Takeda Shingen, Vo Nguyen Giap e Mao Tse Tung.\n\n- https://webcache.googleusercontent.com/search?q=cache:http://unes.br/Biblioteca/Arquivos/A_Arte_da_Guerra_L%26PM.pdf",
				"added": 1560308622
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 3,
				"body": "#Revolução Russa de 1917\n\nA Revolução Russa de 1917 foi uma série de eventos políticos na Rússia, que, após a eliminação da autocracia russa e depois do Governo Provisório (Duma), resultou no estabelecimento do poder soviético sob o controle do partido bolchevique. O resultado desse processo foi a criação da União Soviética, que durou até 1991.\n\nNo começo do século XX, a Rússia era um país de economia atrasada e dependente da agricultura, pois 80% de sua economia estava concentrada no campo (produção de gêneros agrícolas).\n\n#Rússia Czarista\nOs trabalhadores rurais viviam em extrema miséria e pobreza, pagando altos impostos para manter a base do sistema czarista de Nicolau II. O czar governava a Rússia de forma absolutista, ou seja, concentrava poderes em suas mãos não abrindo espaço para a democracia. Mesmo os trabalhadores urbanos, que desfrutavam os poucos empregos da fraca indústria russa, viviam descontentes com o governo do czar.\n\nNo ano de 1905, Nicolau II mostra a cara violenta e repressiva de seu governo. No conhecido Domingo Sangrento, manda seu exército fuzilar milhares de manifestantes. Marinheiros do encouraçado Potenkim também foram reprimidos pelo czar.\n\nComeçava então a formação dos sovietes (organização de trabalhadores russos) sob a liderança de Lênin. Os bolcheviques começavam a preparar a revolução socialista na Rússia e a queda da monarquia.\n\n#A Revolução compreendeu duas fases distintas:\n\n- A Revolução de Fevereiro de 1917(março de 1917, pelo calendário ocidental), que derrubou a autocracia do Czar Nicolau II da Rússia, o último Czar a governar, e procurou estabelecer em seu lugar uma república de cunho liberal.\n\n- A Revolução de Outubro (novembro de 1917, pelo calendário ocidental), na qual o Partido Bolchevique, liderado por Vladimir Lênin, derrubou o governo provisório e impôs o governo socialista soviético.\n\n#O Governo Provisório e o Soviete de Petrogrado\nO Governo Provisório iniciou de imediato diversas reformas liberalizantes, inclusive a abolição da corporação policial e sua substituição por uma milícia popular. Mas os líderes bolcheviques, entre os quais estava Lenin, formaram os Sovietes (Conselhos) em Petrogrado e outras cidades, estabelecendo o que a historiografia, posteriormente, registraria como ‘duplo poder’: o Governo Provisório e os Sovietes.\n\nLenin foi o primeiro dirigente da URRS. Liderou os bolcheviques quando estes tomaram o poder do governo provisório russo, após a Revolução de Outubro de 1917 (esta sublevação ocorreu em 6 e 7 de novembro, segundo o calendário adotado em 1918; em conformidade com o calendário juliano, adotado na Rússia naquela época, a revolução eclodiu em outubro). Lenin acreditava que a revolução provocaria rebeliões socialistas em outros países do Ocidente.\n\nAo expor as chamadas Teses de abril, Lenin declarou que os bolcheviques não apoiariam o Governo Provisório, e pediu a união dos soldados numa frente que viesse pôr fim à guerra imperialista (I Guerra Mundial) e iniciasse a revolução proletária, em escala internacional, ideia que seria fortalecida com a propaganda de Leon Trotski. Enquanto isso, Alexandr Kerenski buscava fortalecer a moral das tropas.\n\nNo Congresso de Sovietes de toda a Rússia, realizado em 16 de junho, foi criado um órgão central para a organização dos Sovietes: o Comitê Executivo Central dos Sovietes que organizou, em Petrogrado, uma enorme manifestação, como demonstração de força.\n\n#O aumento do poder dos Bolcheviques\nAvisado que seria acusado pelo Governo de ser um agente a serviço da Alemanha, Lenin fugiu para a Finlândia. Em Petrogrado, os bolcheviques enfrentavam uma imprensa hostil e a opinião pública, que os acusava de traição ao exército e de organização de um golpe de Estado. A 20 de julho, o general Lavr Kornilov tentou implantar uma ditadura militar, através de um fracassado golpe de Estado.\n\nDa Finlândia, Lenin começou a preparar uma rebelião armada. Havia chegado o momento em que o Soviete enfrentaria o poder. Foi Trotski, então presidente do Soviete de Petrogrado, quem encontrou a solução: depois de formar um Comitê Militar Revolucionário, convenceu Lenin de que a rebelião deveria coincidir com o II Congresso dos Sovietes, convocado para 7 de novembro, ocasião em que seria declarado que o poder estava sob o domínio dos Sovietes.\n\nNa noite de 6 de novembro a Guarda Vermelha ocupou as principais praças da capital, invadiu o Palácio de Inverno, prendendo os ministros do Governo Provisório, mas Kerenski conseguiu escapar. No dia seguinte, Teotski anunciou, conforme o previsto, a transferência do poder aos Sovietes.\n\n#O novo governo\nO poder supremo, na nova estrutura governamental, ficou reservado ao Congresso dos Sovietes de toda a Rússia. O cumprimento das decisões aprovadas no Congresso ficou a cargo do Soviete dos Comissários do Povo, primeiro Governo Operário e Camponês, que teria caráter temporário, até a convocação de uma Assembleia Constituinte. Lênin foi eleito presidente do Soviete, onde Trotski era comissário do povo e ministro das Relações Exteriores e, Stalin, das Nacionalidades.\n\nJosef Stalin foi o dirigente máximo da União das Repúblicas Socialistas Soviéticas (URSS) de 1929 a 1953. Governou por meio do terror, embora também tenha convertido a URSS em uma das principais potências mundiais.\n\nA 15 de novembro, o Soviete ou Conselho dos Comissários do Povo estabeleceu o direito de autodeterminação dos povos da Rússia. Os bancos foram nacionalizados e o controle da produção entregue aos trabalhadores. A Assembleia Constituinte foi dissolvida pelo novo governo por representar a fase burguesa da revolução, já que fora convocada pelo Governo Provisório. Em seu lugar foi reunido o III Congresso de Sovietes de toda a Rússia. O Congresso aprovou a Declaração dos Direitos do Povo Trabalhador e Explorado como introdução à Constituição, pela qual era criada a República Soviética Federativa Socialista da Rússia (RSFSR).\n\n#A guerra civil\nO novo governo pôs fim à participação da Rússia na I Guerra Mundial, através do acordo de Paz de Brest-Litovsk assinado em 3 de março de 1918. O acordo provocou novas rebeliões internas que terminariam em 1920, quando o Exército Vermelho derrotou o desorganizado e impopular Exército Branco antibolchevique.\n\nLenin e o Partido Comunista Russo (nome dado, em 1918, à formação política integrada pelos bolcheviques do antigo POSDR) assumiram o controle do país. A 30 de dezembro de 1922, foi oficialmente constituída a União de Repúblicas Socialistas Soviéticas (URSS). A ela se uniriam os territórios étnicos do antigo Império russo.\n\n#Significado da palavra czar\nA palavra czar, que se pronuncia-se “tzar”, tem suas origens no título de césar, que era concedido aos imperadores romanos, na Idade Antiga.\n\nNa Idade Média, o título de czar era ostentado também por soberanos búlgaros e sérvios.\n\n- Fonte: https://www.sohistoria.com.br/ef2/revolucaorussa/",
				"added": 1560292262
			},
			{
				"comment_id": 4,
				"body": "#Revolução Chinesa\nA Revolução Chinesa, que durou de 1946 a 1952, foi a fase final da longa Guerra Civil Chinesa, que durou de 1927 a 1952, entre o Kuomintang de Chiang Kai-Shek, que governava o país, e o Partido Comunista Chinês e sua ala paramilitar, o Exército de Liberação Popular, comandados por Mao Tse-Tung.\n\n#Antecedentes e Causas da Revolução Chinesa\nApesar das derrotas para a Inglaterra, na Segunda Guerra do Ópio, e para o Japão, Primeira Guerra Sino-Japonesa, a dinastia Qing, no poder no começo na China do começo do sec.XX, continuava forte. O imperador Gangxu tentava diversas reformas para ocidentalizar e modernizar a China e restaurá-la como uma grande potência, mas era frustrado pela de facto governante da China, a imperatriz Tzu-Hsi, que desprezava a influência ocidental. Quando o imperador Xuantong assumiu em 1908 após a morte de Tzu-Hsi, já era tarde, e o país estava a beira da revolta. Esta três anos depois, quando Sun Yat-Sen comandou a Revolução de 1911 e instaurou-se como Premier do partido que fundou, o Kuomintang, em 1912.\n\nNa prática contudo, o governo de Sun Yat-Sen inicialmente controlou apenas uma pequena parte do país, que foi repartido por centenas de senhores locais,, cada um com seu exército, iniciando a chamada \"Era dos Senhores da Guerra\". O governo Kuomintang foi, de 1912 até a morte de Sun Yat-Sen em 1925 lentamente reconquistando e reunificando o país.\n\nCom a morte de Sun-Yat Sen em 1925, os elementos de esquerda revolucionária do Kuomintang, incluindo o próprio Mao Tse-Tung, buscaram e receberam apoio da União Soviética para empreender uma revolução comunista no país. Chiang Kai-Shek ficou furioso, e acusou a ala comunista de violar os princípios revolução por obedecer às ordens de estrangeiros. Isso causou a secessão do Partido Comunista do resto do Kuomintang, e começou a Guerra Civil Chinesa.\n\n#A Revolução\nA invasão da China pelo Japão em 1937 pôs um fim temporário à Guerra Civil, enquanto as duas partes se uniam para expulsar o inimigo do solo chinês, e em 1944 começaram negociações de paz para discutir conjuntamente o futuro do país.\n\nContudo, com o fim da Segunda Guerra Mundial em 1945 e a polarização da Guerra Fria, tanto a URSS quanto os Estados Unidos interviram e acabaram causando o colapso das negociações, e a guerra civil continuou a partir de 1946, com o Kuomintang recebendo ajuda financeira e militar norte-americana, e o Partido Comunista dos soviéticos.\n\nLentamente as forças comunistas começaram a ganhar terreno. O Kuomintang possuía, inicialmente, superioridade númerica e em equipamentos, mas tinham sofrido pesadas baixas na luta contra a dominação japonesa, estava desmoralizado na luta contra seus próprios conterrâneos. Além disso, por seu envolvimento em diversos escândalos, era visto pela população camponesa como uma instituição extremamente corrupta, além de incompetente, pois todas as reformas econômicas que tinha tentando implementar, sobretudo de caráter liberal, tinham sido um fracasso, resultando num país com hiperinflação e a beira de um colapso econômico. Nesse contexto, os Comunistas foram lentamente reduzindo os números do Exército Nacionalista, ala militar do Kuomintang, através de ações de guerrilha sobretudo no norte chinês e na manchúria, e aumentando os seus próprios contingentes, através de uma campanha de recrutamente focada principalmente nos camponeses e no operariado urbano não-qualificado.\n\nApós a tomada de Pequim pelas forças maoístas em 1950, Chiang Kai-Shek acabou fugindo, juntamente com mais de meio milhão de suas tropas restantes, para a ilha de Taiwan, onde proclamou a República da China (ROC), e derrotando sucessivamente as forças comunistas que tentaram tomar a ilha entre 1950 e 1952.\n\n#Consequências da Revolução Chinesa\nAs principais consequências da Revolução Chinesa e da consequente tomada do poder pelo Partido Comunista Chinês foram o fortalecimento do bloco Soviético, as revoluções internas, sobretudo o \"Grande Salto à Frente\" e a \"Revolução Cultural\".\n\nApesar das diferenças ideológicas e políticas posteriores entre a URSS e a RPC (República Popular Chinesa) o fato é que a China contribuiu muito para o fortalecimento da posição soviética e do restante dos países do bloco comunista no mundo, tornando-se ao longo do tempo uma enorme potência econômica e um \"escudo\" que bloqueava efetivamente a influência política e militar dos Estados Unidos e da O.T.A.N. (Organização do Tratado do Atlântico Norte, bloco militar que reunia os Estados Unidos e as potências européias capitalistas).\n\n#Grande Salto à Frente\nJá o \"Grande Salto à Frente\" e a \"Revolução Cultural\" foram duas das maiores matanças da história da humanidade, superando facilmente o holocausto nazista. A primeira constitiu em uma tentativa de reforma repentina e maciça da economia agrária chinesa, de modo a eliminar a propriedade privata, coletivizar a produção agrícola, e substituir enormes áreas de plantio por pátios industriais. Todos os que resistiam ou protestavam eram acusados de \"contra-revolucionários\", e assim perseguidos e mortos. Além disso, a industrialização forçada privou grande parte da China de produtos básicos de alimentação, o que também foi muito agravado pelo embargo dos países capitalistas. A perseguição e a fome resulturam em mais de 20 milhões de mortos entre 1958 e 1961, e causou uma grande perda do apoio popular das lideranças do Partido Comunista.\n\n#Revolução Cultural\nA \"Revolução Cultural\" foi uma direta conseqüência do desastre do Grande Salto, e da perda de apoio do regime maoísta. Ela foi uma perseguição maciça destinada a tornar o país completamente leal ao líder e livre de elementos subversivos, procurando mudar completamente a cultura chinesa e eliminar \"seus elementos capitalistas\". Além da destruição de inúmeras relíquias históricas, monastérios e obras de arte, estima-se que os eventos da Revolução Cultural foram responsáveis por mais de 2 milhões de mortes diretas, embora o Partido Comunista Chinês não permita a divulgação de documentos relacionados às perseguições até os dias de hoje.\n\n- Fonte: https://rachacuca.com.br/educacao/historia/revolucao-chinesa/",
				"added": 1560293185
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "#Nejimaki Seirei Senki: Tenkyou No Alderamin\n\nUma guerra entre a República de Kioka e seu vizinho, o Império Katjvarna. Nessa região, devido a certas circunstâncias, havia um jovem se preparando a contragosto para o exame de Oficial Militar de Alta Classe. Seu nome, Ikta. Ele odeia a guerra, é preguiçoso e gosta de mulheres. Ninguém previu que o gentil Ikta se tornaria um soldado referido até como um grande comandante. Ele que sobreviveu a um mundo envolto em guerra com seu gênio superior, Ikta. As cortinas se abrem, ilustrando sua vida dinâmica, dramática e sua esplêndida e fantasiosa história militar.\n\n\n- https://www.superanimes.site/anime/nejimaki-seirei-senki-tenkyou-no-alderamin",
				"added": 1560296827
			},
			{
				"comment_id": 6,
				"body": "#Gate: Jieitai Kanochi Nite, Kaku Tatakaeri\nUm portal para um mundo paralelo conhecido como Gate apareceu de repente em Ginza, Tóquio. Monstros e tropas saíram dele, transformando o distrito de compras num inferno sangrento. As Forças de Defesa Japonesas agiram imediatamente e expulsaram as criaturas de volta para Gate. Para facilitar as negociações e preparar-se para lutas futuras, as FAJ enviam a Terceira Equipe de Reconhecimento para a Região Especial no outro lado de Gate. Itami Youji, um oficial das FAJ que também é um otaku de 33 anos foi designado como líder da equipe. Em meio a ataques das tropas inimigas, a equipe visitou vários lugares e aprendeu bastante sobre a cultura e geografia locais. Graças a seus esforços humanitários, apesar de algumas dificuldades conseguira aos poucos chegarem aos locais. Juntaram-se a eles uma linda elfa, uma maga e uma semi-deusa. Por outro lado, as grandes potências fora de Gate como os EUA, China e Rússia estava extremamente interessados nos abundantes recursos da Região Especial, assim começaram a pressionar o Japão. Para as grandes potências, um portal para um mundo desconhecido pode ser a chave para a dominação mundial, mas para nossos heróis, é uma oportunidade única de aumentar seus conhecimentos, amizades e perspectiva sobre o mundo.\n\n\n- https://www.superanimes.site/anime/gate-jieitai-kanochi-nite-kaku-tatakaeri",
				"added": 1560296953
			},
			{
				"comment_id": 7,
				"body": "> [yamashita](#comment_6_165jJot18hEonJPMXHYFo4D2P1wX5TqYSZ): Gate: Jieitai Kanochi Nite, Kaku Tatakaeri\n> Um portal para um mundo paralelo conhecido como Gate apareceu de repente em Ginza, Tóquio. Monstros e tropas saíram dele, transformando o distrito de compras num inferno sangrento. As Forças de Defesa Japonesas agiram imediatamente e expulsaram as criaturas de volta para Gate. Para facilitar as negociações e preparar-se para lutas futuras, as FAJ enviam a Terceira Equipe de Reconhecimento para a Região Especial no outro lado de Gate. Itami Youji, um oficial das FAJ que também é um otaku de 33 anos foi designado como líder da equipe. Em meio a ataques das tropas inimigas, a equipe visitou vários lugares e aprendeu bastante sobre a cultura e geografia locais. Graças a seus esforços humanitários, apesar de algumas dificuldades conseguira aos poucos chegarem aos locais. Juntaram-se a eles uma linda elfa, uma maga e uma semi-deusa. Por outro lado, as grandes potências fora de Gate como os EUA, China e Rússia estava extremamente interessados nos abundantes recursos da Região Especial, assim começaram a pressionar o Japão. Para as grandes potências, um portal para um mundo desconhecido pode ser a chave para a dominação mundial, mas para nossos heróis, é uma oportunidade única de aumentar seus conhecimentos, amizades e perspectiva sobre o mundo.\n> \n> https://www.superanimes.site/anime/gate-jieitai-kanochi-nite-kaku-tatakaeri\n\n#Gate: Jieitai Kanochi Nite, Kaku Tatakaeri - Enryuu-hen\nSegunda temporada de Gate: Jieitai Kanochi Nite, Kaku Tatakaeri.\n\n\n- https://www.superanimes.site/anime/gate-jieitai-kanochi-nite-kaku-tatakaeri-enryuu-hen",
				"added": 1560296985
			},
			{
				"comment_id": 8,
				"body": "#Akatsuki No Yona\n\nYona é a única princesa do reino, vivendo a vida luxuosa e despreocupada como uma princesa deveria. Ela tem de tudo: as melhores roupas e cosméticos, os doces mais divinas, um imperador amar como um pai, eo mais quente paixão primo, Soo-won, alguém poderia esperar ter. Agora, se seu guarda-costas, Son Hak, não era tão chato para ela e seu cabelo não era tão vermelho. Mas seu mundo quase perfeito quebra rapidamente como o homem que ela ama, Soo-won, mata seu pai eo caminho para sua ascensão ao trono, está garantida. Filho Hak escapa com Yona, e eles levam uma vida em fuga a partir desse ponto.\n\n\n- https://www.superanimes.site/anime/akatsuki-no-yona",
				"added": 1560297202
			},
			{
				"comment_id": 9,
				"body": "#Densetsu No Yuusha No Densetsu\nRyner Lute é um estudante preguiçoso da Academia da Roland Império Real do Mago. Um dia, o Império Roland entra em guerra contra o seu país vizinho Estabul, e Ryner perde seus colegas na guerra. Depois da guerra, Ryner sai em uma jornada para procurar as relíquias de um \"Herói Lendário\" no comando do Rei Sion Astal e descobre que uma maldição mortal está se espalhando por todo o continente.\n\n\n- https://www.superanimes.site/anime/densetsu-no-yuusha-no-densetsu",
				"added": 1560297387
			},
			{
				"comment_id": 10,
				"body": "#Bakuman\nBakuman começa com Moritaka Mashiro, um estudante ginasial, deixando seu caderno com um desenho de sua paixão e colega de classe, Miho Azuki, em sala de aula. Quando ele percebe e volta para a sala de aula depois da escola, seu colega, Akito Takagi, está esperando por ele com o seu caderno na mão, e diz a ele que ele acredita que Azuki gosta de Mashiro também. Masahiro acaba pensando que Takagi também gosta de Azuki. Takagi, então, tenta convencer Mashiro para se tornar um mangaká (quadrinista de mangá) e o chama para ilustrar as histórias que ele escreve. No entanto, Mashiro, é relutânte à desilusão com a sociedade moderna e o destino de seu tio, um antigo mangaká serializado que morreu por excesso de trabalho, enquanto tentava recuperar seu status. Mais tarde Takagi chama Mashiro dizendo que ele vai confessar à Azuki. Mashiro corre até a casa de Azuki para encontrar Takagi, e ele em seguida, solicita Azuki e confessa a ela que ele e Mashiro são destinados a ser mangakás. Mashiro, em seguida, descobre que ela quer ser uma Seiyuu (dubladora) e, pensando nas desventuras românticas de seu tio, propõe Azuki em casamento, sob a condição de que eles só se casam depois de alcançar seus sonhos. Com um gol antes dele, Mashiro expõe a tornar esse sonho realidade. Seu objetivo é ter a voz de Azuki como a heroína da adaptação do anime de seu mangá. Para ter a maior probabilidade de sucesso, ele e Takagi votam para se serializar na revista semanal Shonen Jump e tentar criar o mangá mais popular para a revista.\n\n\n- https://www.superanimes.site/anime/bakuman",
				"added": 1560297649
			},
			{
				"comment_id": 11,
				"body": "#Serial Experiments Lain\nLain Iwakura parece ser uma garota comum, com quase nenhuma experiência com computadores. No entanto, o suicídio repentino de um colega de escola, e uma série de estranhos acontecimentos, conspiram para puxar Lain no mundo da Wired, onde ela gradualmente descobre que nada é o que parece ser ... nem mesmo Lain si mesma.\n\n\n- https://www.superanimes.site/anime/serial-experiments-lain",
				"added": 1560297710
			},
			{
				"comment_id": 12,
				"body": "#Ookami To Koushinryou\nO mascate Kraft Lawrence viaja pelo mundo vendendo todos os tipos de coisas. Depois de visitar uma aldeia, ele descobre uma menina dormindo sob as peles em seu carrinho. Ela tem orelhas de lobo e uma cauda. A menina lobo explica que ela tem sido chamado de \"deus\", mas que seu nome é Holo e nada mais. Lawrence brinca a garota um pouco, mas depois de ouvir mais de sua história, ele é movido e decide acompanhá-la mais ao norte. Em suas viagens os dois têm muitas aventuras, muitas vezes se meter em encrencas, mas a ligação entre eles fica mais forte.\n\n\n- https://www.superanimes.site/anime/ookami-to-koushinryou",
				"added": 1560297800
			},
			{
				"comment_id": 13,
				"body": "> [yamashita](#comment_12_165jJot18hEonJPMXHYFo4D2P1wX5TqYSZ): Ookami To Koushinryou\n> O mascate Kraft Lawrence viaja pelo mundo vendendo todos os tipos de coisas. Depois de visitar uma aldeia, ele descobre uma menina dormindo sob as peles em seu carrinho. Ela tem orelhas de lobo e uma cauda. A menina lobo explica que ela tem sido chamado de \"deus\", mas que seu nome é Holo e nada mais. Lawrence brinca a garota um pouco, mas depois de ouvir mais de sua história, ele é movido e decide acompanhá-la mais ao norte. Em suas viagens os dois têm muitas aventuras, muitas vezes se meter em encrencas, mas a ligação entre eles fica mais forte.\n> \n> https://www.superanimes.site/anime/ookami-to-koushinryou\n\n#Ookami To Koushinryou II\nSegunda Temporada , A viagem de Kraft Lawrence e Horo continuam a jornada rumo ao norte… o relacionamento dos dois se torna mais íntimo, enquanto se aproximam do destino que Horo quer ir….\n\n- https://www.superanimes.site/anime/ookami-to-koushinryou-ii",
				"added": 1560297845
			},
			{
				"comment_id": 14,
				"body": "#Taboo Tattoo\nSeigi, um estudante do fundamental treinado em artes marciais sempre tem a inclinação de ajudar os fracos ao seu redor. Certo dia, ele protege um morador de rua de alguns arruaceiros e o homem dá a ele uma tatuagem estranha na palma da mão em troca. A tatuagem é uma arma secreta produzida na corrida de armas entre os Estados Unidos e o Reino de Selinistão. Seigi fica totalmente perdido quando uma garota poderosa, usando a mesma arma secreta, o persegue violentamente para recuperá-la. Suas habilidades nas artes marciais podemnão ser o bastante para mantê-lo vivo, mas será ele capaz de aprender a usar o poder de sua tatuagem a tempo?\n\n\n- https://www.superanimes.site/anime/taboo-tattoo",
				"added": 1560297994
			},
			{
				"comment_id": 15,
				"body": "#Subete Ga F Ni Naru: The Perfect Insider\nO anime conta sobre Saikawa Souhei, membro do Laboratório de Pesquisas Saikawa. Em um período de férias do laboratório, ele conhece Nishinosono Moe, filha de seu mentor, que se junta ao grupo em suas férias, apesar de não ser parte do laboratório. Depois de se conhecerem, eles acabam encontrando um cadáver. Os dois então trabalham juntos para resolver os mistérios do que acaba se tornando um caso de assassinatos em série.\n\n\n- https://www.superanimes.site/anime/subete-ga-f-ni-naru-the-perfect-insider",
				"added": 1560298114
			},
			{
				"comment_id": 16,
				"body": "#Akame Ga Kill!\nTatsumi é um lutador que sai para a Capital em busca de uma maneira de ganhar dinheiro para ajudar a sua aldeia pobre, apenas para descobrir a corrupção profunda lá. Depois de ser vítima de um assalto por uma mulher e perder todo o seu dinheiro, Tatsumi é levado por uma menina aristocrática nobre com o nome de Aria. Na noite seguinte, o lugar de Aria é atacado por um grupo de assassinos conhecidos como Noite Raid.Enquanto Tatsumi no primeiro tenta defender Aria do Akame assassino, um outro membro do grupo pára a luta. Ela revela que Aria raptou vários aldeões e tortura-los para se divertir. Vendo o potencial no Tatsumi, Noite Raid convida o rapaz para o seu aviso grupo que, independentemente de como eles querem assassino pessoas corrompidas, eles são assassinos. Tatsumi aceita, a fim de se tornar mais forte e proteger sua aldeia. Como resultado, Tatsumi começa a treinar, não só para se tornar um lutador melhor, mas assim como assassino frio. Em sua luta contra o Império, Noite Raid começa antagonizar uma organização conhecida como The Jaegars liderados por Edese, o lutador mais poderoso do Império.\n\n\n- https://www.superanimes.site/anime/akame-ga-kill",
				"added": 1560299123
			},
			{
				"comment_id": 17,
				"body": "#Mirai Nikki\nYukiteru Amano é um garoto comum, que tem uma vida não muito agitada. É o tipo de pessoa que se exclui da escola e dos amigos e que prefere ficar o dia inteiro mexendo em seu celular. Não que isso seja muito diferente da realidade que vivemos hoje, mas Yukiteru tem um motivo em especial para fazer isso: seu celular é seu diário, e nele descreve tudo que acontece em seu dia-a-dia. Porém o lado \"estranho\" de Yukiteru não para por aí. O garoto é tão recluso que acaba entrando em um mundo \"dentro de seu pensamento\". Ou ao menos era isso que ele pensava, que tudo não passava de um sonho. Um dia, em um desses \"sonhos\", Yukiteru acaba sendo convidado para um “jogo” pelo Deus Ex Machina, criatura soberana criada dentro da mente do garoto. Achando que tudo não passava de um delírio, o garoto acorda e percebe que seu celular tinha anotações que não eram dele, que relatavam o futuro! O tal Deus Ex Machina não era um delírio, afinal, e agora Yukiteru é o portador de um diário do futuro (Mirai Nikki) e terá que proteger tal item até a morte. Isso mesmo: caso o celular seja destruído, Yukiteru também será morto.\n\n\n- https://www.superanimes.site/anime/mirai-nikki",
				"added": 1560299301
			}
		]
	},
	"comment_vote": {}
}