{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 1,
				"body": "So what does the history tell us? Has any society ever succeeded in stopping the creeping regime from becoming powerful and totalitarian to the point in which any effective dissent is virtually impossible, and the only hope for change would lie in some external political circumstances, or implosion of the unstable system itself? I can't think of any. If yes, then which path proved to be successful? Peace? Violence? Targeted violence? Indiscriminate violence? Silent opposition? Infiltration of the system and slow erosion from within or revolution?\n\nWe don't have much time. If NWO succeeded in implementing in the West the cybernetic control system like the one currently used in China then any effective rebellion will be impossible. Also there won't be any external political circumstances to look forwrad to if NWO succeeded in entangling the whole World.",
				"added": 1620430978
			},
			{
				"comment_id": 2,
				"body": "> [thefather](#comment_2_1QF6hFgijw5BqUeyY9hRPmH7qxcaRvgCyM): the authoritarian measures being taken are deeply troubling\nWith all respect, thefather, possibly not apparent from my choice of wording, but wake the fuck up.\n\nWe are way past the point of being \"deeply troubled\". Deeply troubling was the state of the West 20 years ago. Right now we are in the midst of the Third World War being conducted according to the fourth generation warfare rules, already on the verge of fifth, started by China with the release of viral bioweapon, with the quite probable help of USA agencies, coupled with an attempt of Marxist revolution in the West by the financial elite and transition of the whole economical paradigm to the neo-feudal, technocratic New World Order, a transition being a de facto controlled bursting of the economical bubble, blown for the last 70 years at least, that the fiat-based and necessarily debt-driven capitalist economy is. We are, with the silent explosion of AI and the advent of DNA engineering technology being tested en-masse right now via the \"vaccines\" proxy, at the crossroads of homo sapiens species: a split into\n1. demigod-like, transhuman, world-ruling elite,\n2. their narrow caste of engineering angels looking after the technocratic Eden, and\n3. the swaths of brainwashed, genetically pacified, economically utterly enslaved and in all imaginable aspects of life, including reproduction, completely dependent on the system, caste of human cattle, unable to ever rebel from their position again, similarly to any other mammal species being unable to compete with the hominid once it went through the linguistic phase transition.\n\nJust so you know, this is what we are facing.",
				"added": 1620679908
			},
			{
				"comment_id": 3,
				"body": "> [calmdownholden](#comment_46_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): There's a difference between Civil Disobedience, and active disruption and spreading harmful misinformation.Take your meds.\n\nHa! Let's engage with this one, shall we? You got me with that \"misinformation\" codeword.\n\nFirst and foremost: I didn't provide almost any information at all, merely an INTERPRETATION of the current situation. Perhaps you should update your NPC dictionary with a new entry: misinterpretation.\n\nSecond: You are not an arbiter of what constitutes an accurate interpretation of the world, since an interpretation is inherently subjective.\n\nThird: You are not an arbiter of what constitutes accurate information and what constitutes dis- or mis- information either. That's the role of objective logic coupled with objective reality and empirical methods of probing it. We are not in the realm of centralized cyberspace in which you can project your perspective on others in an authoritative fashion, report me to daddy Zuckerberg, nor shame me female-style and cancel into oblivion with the help of your twitter mob. This is the incubator of truth, a memetic primordial forest, where the species of theories are let to roam freely and survive on their own by the virtue of their relation to objective reality alone - or maybe just their supporters fancy and aesthetic liking? - whatever the unbound Evolution God decided their fitness measure to be.\n\nFourth: I took my meds, or supplements rather (where is the distinction, really?) - 2400 mg of Piracetam, and it's doing wonders. It's been a long time since I had my mental vision equally clear and consistent in that. Highly recommended.\n\nFifth: Who am I harming, really, and in what way, exactly? How do I disrupt anything? Besides - what kind of paternalistic approach is that? How do you recognize you possess understanding higher than that of anyone else not agreeing with you? This is a silent assumption one has to make in order to treat people like children. How can you know it's not YOU who is harming them by imposing your inferior, possibly, understanding? I don't treat people like children. I give them what I see and let them decide how much it's worth. It's not harming - it's respecting.\n\nSixth: It's not my point to be \"civilly disobedient\", it's not an ideal I aspire to, which could be used as a frame of reference to judge my position and bring me back on the right path. How did you even come up with the idea it may be the case? That's silly.\n\nHaving said all that - it's true my perspective has gloomy shades. Overly, perhaps? It's a bias of mine I'm well aware of, and about which I warned everyone in my nickname.",
				"added": 1621370962
			}
		]
	},
	"comment_vote": {}
}