{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "Nice project, I'd like to know if you have some resources as to become aware of how all these security technologies work and how to use them (LUKS, TPM, etc...). I think this is important because otherwise what you work for looks like a lot of highly nerdy stuff that normal user won't ever get to use properly. Another thing is the addition of more cert signers for this blog, I'm posting this on my zeroid nick but I'd like to use my kaffieid one for a change, others may find it useful too.\n\nAbout the forum, it sounds like a good idea since it would be easier to reach old posts and allow for interaction and community, I don't know of any zite that looks forum-like enough; the closest call is ZeroTalk, you could clone it and tweak it for Insurgo needs.\n\nKeep zeroing~",
			"post_id": 11,
			"date_added": 1557334033
		},
		{
			"comment_id": 2,
			"body": "I thought meltdown and spectre are based on out-of-order speculative branching, afaik that's not just related to SMT enabled processors, like, it should go back haunting really old processors and different architectures as well. ",
			"post_id": 14,
			"date_added": 1558020132
		},
		{
			"comment_id": 3,
			"body": "If the windows 7 VM is meant for being stateful, like, changes and files will stay across VM reboots, then you could use a sysprep'ed image, it removes unique stuff from a windows installation but that stuff should be recreated once the image is booted again. I've used it once to deploy that OS to about 20 machines or so quickly. It will uninstall already installed drivers in the machine you install (the machine in which you sysprep the image) so you could move the installation to another machine, may it be swapping hdds or cloning them altogether.\n\nNow, I can't help with the legal aspects, I'm pretty used to warez (hehe) and KMS makes activating everything really a breeze.",
			"post_id": 20,
			"date_added": 1560353116
		},
		{
			"comment_id": 4,
			"body": "After edit: So, if I understand correctly, there's the TemplateVM which pretty much has read-write access to VMs and can make modifications that survive reboots, and instantiations of a VM that would just get a running copy of what templateVM had and anything done there is lost forever at reboot.  In this case you'd just need to have a sysprep'd image in the templateVM, then boot it in it so it creates unique identificators that will stay, same for the drivers. Subsequent uses of that VM, though instantiation will feature a fully activated and unique windows 7 OS, which should be unique with other windows 7 OSs across the world (I don't know how W7 comes up with its unique IDs tho).\n\nSo, just take a normal PC and install Windows 7 in it, tweak it as much as you'd like/need it for the templateVM and then sysprep it. Set up the VM with TemplateVM and run it once so it creates its unique stuff and it should be done since it will always be called in the same Virtual hardware drivers should work. The need for sysprep is because if for whatever reason two or more of those VMs connect through the network they are essentially the same and may have a really hard time trying to communicate with each other. I'm talking about the same PC names, and maybe same MAC address but that depends on the hypervisor too.",
			"post_id": 20,
			"date_added": 1560356080
		},
		{
			"comment_id": 5,
			"body": "if `-j` and `-e` are at fault it sounds that the partition table is sub-optimal in the destination drive, so alignment issues?",
			"post_id": 48,
			"date_added": 1606428131
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}