{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1520306814,
			"title": "Video on Government, Central Banks, and the USA's Monetary System",
			"body": "Saw some posts on ZeroTalk about economics and societal models, so I thought I'd throw this in as another interesting resource.\n\nMike Maloney's Hidden Secrets of Money - Episode 4\nhttps://www.youtube.com/watch?v=iFDe5kUUyT0\n\nBasically a visualization of the how the economy works when government and central banks collude to influence currency. There's a decent amount of hype (start at 1:20 if you want to skip it), but for the most part the video's content is factually accurate as far as I know. The only claim in the video that I know to be false is at 22:11; it was in fact Thomas Jefferson who wrote that letter to James Madison--not George Washington. (Source: https://founders.archives.gov/documents/Madison/01-12-02-0248)\n\nLet me know what you guys think about it.",
			"added": 1520306813
		},
		{
			"topic_id": 1523671767,
			"title": "How to Use ZeroUpdate?",
			"body": "I've visited/downloaded the zite. It says \"Your version: 0.6.2 (rev3408)\" and then below it \"Latest version!\" and the background color is yellow. Based on past experience I know this means that a new revision of ZeroNet is available. So how do I update through ZeroUpdate?\n\nI'm still able to update ZeroNet via Github by clicking on the three dots on ZeroHello and then on \"Version 0.6.2 (rev3408): Up to date!\" I just want to test updating through p2p. Also is it a bug that ZeroHello says ZeroNet is up to date even though there is a new revision available? Or are revisions different from updates? I'm new to Git, thanks : )",
			"added": 1523671765
		}
	],
	"topic_vote": {
		"1520188230_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"1520175309_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1520413394_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1520456088_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": 1,
		"1520477389_16s5LJukSE1jDFYau5t6ighdKrfyNzYixL": 1,
		"1520489485_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1520606515_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1521057855_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1521170566_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1521628102_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1521869348_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1523024673_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1523082496_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": 1,
		"1523121756_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": 1,
		"1523223976_1HR8rARGfHybpYKvFC9SSYM2bxvNWNnHB7": 1,
		"1523510907_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1523575854_1FKWKJcvHG4tatrW68b4CkHGXYNjxv7uBt": 1,
		"1523529424_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1523697103_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr": 1,
		"1526239496_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": 1
	},
	"next_comment_id": 28,
	"comment": {
		"1520188230_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 1,
				"body": "> [4567l](#comment_15_1Lh89nAb4YeizEER15JUcpscy37mZwDUer): I agree. Hosting at no cost is one of the best aspects of a decentralized network.\n\nI wouldn't say that there are no hosting costs (you still pay for your Internet access - with local volunteer meshnets that may change). It's more like anyone can contribute to paying the hosting costs by volunteering to seed.\n\nTo answer OP's question: the main draw of ZeroNet for me is easy integration of BitTorrent tech with websites and the ability to route everything through Tor.",
				"added": 1520212214
			},
			{
				"comment_id": 2,
				"body": "> [4567l](#comment_17_1Lh89nAb4YeizEER15JUcpscy37mZwDUer): I remember FireChat stirred up the conversation a bit when it was released, but other than that, it's never reached a significant point regarding its potential.\n\nHuh, I'd never heard of that app before. Seems pretty cool, if it wasn't proprietary. :) Another downside with *wireless* meshnets is that they're very easy to shut down in hostile environments. Just follow the WiFi signal, wave your gun around, and poof - meshnet gone.\n\nThat's why anonymity--physical and digital--is so important. You can't threaten someone you don't know. The psychological and morale effects of not knowing your enemy are incredible as well.\n\nBut, I digress...",
				"added": 1520303739
			}
		],
		"1517743836_1HsgZpHaZ5BRUK5qr2YMWnubgKyNuSqokH": [
			{
				"comment_id": 3,
				"body": "> [namshub](#comment_1_1LkCpkL3TohdyYnrnEbUtPDKLag9XHbgVV): I don't give a flying fuck about \"my country\". NO BORDERS! NO NATIONS!\n\nSame boat as you. I'm fond of my local community and the culture I grew up in, but mostly just because it's familiar. \n\nThat said, I have no love for these lines that divide involuntary nation-states and prevent free people from interacting with each other.",
				"added": 1520304704
			}
		],
		"1520051262_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "I know I'm late to the party, but I saw this comment and just had to ask a few questions...\n\n> [styromaniac](#comment_208_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've given away my passive oil generation process. Nature had to have done it first anyway.\nWhat type of oil are we talking about, lol? Care to share the process?\n\n> [styromaniac](#comment_208_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):I've also learned an unheard of method for silver plating teeth and stove coils, so the applications are endless and the material I created that did that can also be used as anxiety medication if not also cure a few diseases, because it's extremely potent instant dissolving water soluble silver flakes I made.\nWhat's your proof that silver dissolved in water is an anxiety medication, or can \"cure a few diseases\"?",
				"added": 1520305771
			}
		],
		"1520413394_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "I think this is a valid suggestion and I'm glad you raised the issue on Github. Hopefully the devs will consider it.",
				"added": 1520447057
			}
		],
		"1520456088_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": [
			{
				"comment_id": 6,
				"body": "The only rationale I see behind forcing people to vote is to keep mainstream parties in power (I'm assuming uninterested voters would be more likely to gravitate to these candidates) and give legitimacy to the elected government.\n\nI commend you for refusing to abide by these unjust laws. Keep up the good work!",
				"added": 1520468525
			}
		],
		"1520477389_16s5LJukSE1jDFYau5t6ighdKrfyNzYixL": [
			{
				"comment_id": 7,
				"body": "Thanks for the article, I have a lot of respect for the EFF.\n\n> But some evidence in the case appears to show Geek Squad employees did make an affirmative effort to identify illegal material. For example, the image found on Rettenmaier’s hard drive was in an unallocated space, which typically requires forensic software to find. Other evidence showed that Geek Squad employees were financially rewarded for finding child pornography. Such a bounty would likely encourage Geek Squad employees to actively sweep for suspicious content.\n\nUnless customers of Geek Squad agreed to a contract in which they affirmed Geek Squad's right to read data from their hard drives, this is an infringement of property rights and personal privacy.",
				"added": 1520482063
			}
		],
		"1520480628_19k3r2zgWTUszFvHSBBrxDWzEt83VqY7BA": [
			{
				"comment_id": 8,
				"body": "Today, war means conflict between nation-states. It usually entails one group of individuals declaring war and then forcibly conscripting others to participate. Is that justified? In my opinion, no.\n\nI generally believe that the application of force is only ever justified as a means of self-defense. So if a group is being threatened or oppressed, I do believe they have a right to voluntarily fight for their freedom/defense.",
				"added": 1520482894
			}
		],
		"1520489485_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 9,
				"body": "I've been interested in learning how to create a zite, and your tutorials on the Dev Center seem like the perfect way to get started. Thanks!",
				"added": 1520523944
			}
		],
		"1520741210_152jxyDu7V8pxqTh31rc1n8tqPD1NudC2a": [
			{
				"comment_id": 10,
				"body": "What operating system and version of Firefox are you using? \n\nIf you've setup Firefox to use a proxy, make sure it's disabled for localhost by navigating to Preferences --> Advanced --> Network --> Settings, and adding 127.0.0.1 under \"No proxy for:\"\n\nHere are some more general troubleshooting steps:\n1) Clear your cache/cookies and try again.\n2) Restart Firefox in Safe Mode (https://support.mozilla.org/en-US/kb/troubleshoot-firefox-issues-using-safe-mode?redirectlocale=en-US&redirectslug=Safe+Mode)\n3) \"Refresh\" Firefox (https://support.mozilla.org/en-US/kb/refresh-firefox-reset-add-ons-and-settings)",
				"added": 1520751219
			},
			{
				"comment_id": 11,
				"body": "> [cooperdooper](#comment_1_152jxyDu7V8pxqTh31rc1n8tqPD1NudC2a): Thanks, refreshing FireFox worked!\n\nGlad I could help. :-)",
				"added": 1520888580
			}
		],
		"1521057855_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 12,
				"body": "> [sylvaine](#comment_23_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): I should add .. this is part of the reason I can relate to the show Mr. Robot. It’s probably the first time I ever watched a TV show and thought to myself .. ‘fuck. That’s me.’ [...]\n\nIf you haven't already seen Fight Club (the movie), I highly recommend it. In fact, Mr. Robot \"borrows\" the multiple personalities/imaginary friend trope from it. Essentially, the movie deals with a societal loneliness (felt by mostly middle-class white men however) and the protagonist's \"imaginary friend\" blames rampant consumerism/emasculation as the cause. At least, that was my takeaway.\n\nCheck it out if you get a chance.",
				"added": 1521168728
			}
		],
		"1521170566_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 13,
				"body": "Looking forward to the first episode! :-)",
				"added": 1521171615
			}
		],
		"1522338314_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn": [
			{
				"comment_id": 14,
				"body": "Basically, you need to have your browser configured a certain way to defend against attacks on your privacy while browsing ZeroNet or the clearnet through Tor, and the Tor Browser Bundle is the probably the best option for most people.\n\nThe Tor Browser has extra security features (NoScript, HTTPS, browser settings, etc.) that protect you from [1] websites trying to discover your IP, [2] websites trying to track and profile your online behavior, and [3] malicious Tor exit nodes. Like others have said, websites can use JavaScript, trackers, cookies, and other methods to unmask your IP, user agent, and operating system, track your activity and develop a profile for your browsing session.",
				"added": 1522363882
			}
		],
		"1521869348_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 15,
				"body": "That was actually pretty good! I cringed when you made out with your laptop, though. XD\n\nI'll be sure to seed. :-)",
				"added": 1522528643
			}
		],
		"1522586677_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 17,
				"body": "> [nullbock](#comment_7_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): Where you mount something like https://en.wikipedia.org/wiki/RONJA and have stealth connections.\n\nWow, that's some really cool technology! Thanks for sharing.",
				"added": 1522874195
			}
		],
		"1522940738_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr": [
			{
				"comment_id": 18,
				"body": "> [cootason](#comment_3_1AuzNXVJxV7rzAugV5RpsgM9Pm4j981a8S): Yep scraping everything you post for potential advertising info to send back your way,\n\nGoogle also use to scan Gmail messages for advertising purposes.\nhttps://www.nytimes.com/2017/06/23/technology/gmail-ads.html",
				"added": 1522973375
			},
			{
				"comment_id": 19,
				"body": "> [cootason](#comment_4_1AuzNXVJxV7rzAugV5RpsgM9Pm4j981a8S): I really like this Zeronet and could see it growing extensively, an online alternative to ebay using blockchain could be a really interesting prospect combining fiat and blockchain for purchasing goods online using this system.\n\nIf you're interested in participating in an online marketplace, I'd suggest checking out the OpenBazaar project (https://www.openbazaar.org/). It's still in its infancy and uses cryptocurrency, not fiat, (I see that as positive) but it uses p2p tech with Tor integration, similar to ZeroNet, and there are no fees.",
				"added": 1523059335
			}
		],
		"1522978931_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 20,
				"body": "I did the steps outlined below, no bug and no wrapper_nonce in the URL.\nZeroNet rev3408, Tor Browser v7.5.3 (based on Mozilla Firefox 52.7.3)",
				"added": 1523063396
			}
		],
		"1523082496_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 21,
				"body": "I don't really know anything about it, but I'd like to learn. :-)",
				"added": 1523116009
			}
		],
		"16_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": [
			{
				"comment_id": 22,
				"body": "Huh, I'd always thought that nuclear energy was just clean energy (no greenhouse gas emissions) but not renewable or would be able to fill the majority of human energy needs. Guess I was wrong: https://www.forbes.com/sites/jamesconca/2016/03/24/is-nuclear-power-a-renewable-or-a-sustainable-energy-source/\n\nBut isn't the spent Uranium highly radioactive and buried deep in the earth in a big concrete block?",
				"added": 1523117302
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [],
		"1523193334_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 24,
				"body": "Emma González did not \"admit\" to bullying Nikolas Cruz, the Parkland school shooter. Her words were taken out of context: https://www.snopes.com/fact-check/did-gonzalez-admit-bullying-school-shooter/",
				"added": 1523206107
			}
		],
		"1523408171_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 25,
				"body": "> [sylvaine](#comment_58_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): Freedom of Speech is pointless if it only protects what the average person says. It's probably more applicable for violent terrorists, neo-nazis, etc. than anything else these days. You have to be willing to stand up for their rights to speak freely, too.\n\nCouldn't agree more. This also applies to the market and labor too, though. Racism and bigotry are irrational, but there's something sinister about forcing people to work for those they don't want to serve.\n\nIf a baker refuses to bake a wedding cake for a gay couple, his rights should be respected. To be even more extreme, a white supremacist business owner has the right to refuse to serve black people. But the flip side is that the white supremacist has no right to restrict others from serving those he refuses.\n\nIf one truly believes in self-ownership, I can't imagine how it could be otherwise (but I'm open to discussion). Rights are not given by government, \"society,\" or any other authority. They are principles that the individual has decided are rational, just, and extend to all people; and (s)he will exercise them by him/herself, regardless of the approval (or lack thereof) of those with power.\n\nSorry for the speech, but I love discussing topics like this one. : )",
				"added": 1523486399
			}
		],
		"1523451391_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 26,
				"body": "> [jetten](#comment_15_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e): I'd be careful about disclosing information about your plant operations, if you have both picture, country, name(?), and a video of your univerity and neighborhood area uploaded here. Hopefully police have not yet infiltrated Zeronet, but you newer know if some anti-cannabis fanatic sees your posts and decides to make your life hell. [...]\n\nI second that. Be careful, Sylvaine. I'd delete this post and not talk about your operations again. At least not on an account tied to your offline identity.",
				"added": 1523488427
			}
		],
		"1523671767_1KYNzbwSXsS1k6uuYrhKkmSHWwDKWFQyY5": [
			{
				"comment_id": 27,
				"body": "> [styromaniac](#comment_257_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's supposed to update via P2P when you have ZeroUpdate downloaded, according to other people on ZeroNet, so you're already doing that.\n\n> [nofish](#comment_1156_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): If you add the site, then it will automatically use that site to update the source code when you press the Update button on ZeroHello.You not receiving notifications when new Rev available, because the updates between versions are still under testing, so it's only for adventurous people :)\n\nThanks for explaining!",
				"added": 1523713685
			}
		]
	},
	"comment_vote": {
		"593_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"30_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"2_1NeKNyC1by4c7Upfxn9w4U93MQXy5i5CDo": 1,
		"17_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"1_1LkCpkL3TohdyYnrnEbUtPDKLag9XHbgVV": 1,
		"6_12rGah2WFY4XFcASwmT9THLBVB7gWakhKr": 1,
		"176_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"3_171vcSK8P8d121e9CCJRiFjpEXGG5CUqDF": 1,
		"1148_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"9_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"7_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6": 1,
		"1155_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"49_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF": 1,
		"58_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"15_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1,
		"2_1KS7VGicyC62NFGQkuopzabwcGUNPUFmSM": 1,
		"1_1HysVuWJvNSTxVj6Y5vMGiBZ7pJTBtrwow": 1,
		"11_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"257_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1156_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"212_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}