{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "Andrew Yang's main campaign proposal is universal basic income \"I'm proposing that we declare a dividend of $1,000 a month for every American adult\"! \n\nAccording to the 2018 US census, there are roughly 253.8 million U.S. citizens over the age of 18 in the United States so the freedom dividend would come at a cost of $253.8 million a month or $3.045 Trillion a YEAR! Yang states that MLK was championing for universal basic income. This is a fallacy, Yang is incorrect on these grounds since MLK was ‘proposing a guaranteed minimum’. Yang also makes note of stating Richard Nixon’s reforms support Yang’s universal basic income. Nixon in 1971 and 1969 proposed reforms to the welfare program that would include a minimum income to poor families, the handicapped, and the aged. It did not apply to single people or married couples without children. Nixon's plan was NOT universal basic income. Again Yang’s same remarks about economist Milton Friedman. And again the answer, no. Economist Milton Friedman was not for the universal basic income he was for in ‘negative income tax’ and doing away with welfare programs, the proposal for a negative income tax is a proposal to help poor people by giving them money. \n\nThe negative income tax the concept is similar to the Earned Income Tax Credit which benefits working people with low to moderate income so again Friedman's concept of a negative income\nthe tax did not apply to everyone in the United States. \n\nMLK, Nixon, Friedman were advocating for a guaranteed minimum income to reduce poverty which is very different than hey let's give every US citizen free money!\n\nYang also makes remarks on Alaska’s annual dividend “a plan just like this has been in effect in one state for 36 years where it has created thousands of jobs helped improve children's nutrition and lowered income inequality.” This fund is also called the Alaska Permanent Fund. The money is derived from funds from the petroleum profits and mineral leases, but the amount that is paid is not guaranteed because as oil prices rise and fall so does the dividend. In recent years Alaska's budget also affected the size of the payout. For Yang to state that one of our states already is not accurate. The fund isn't large enough to cover even basic expenses. so you're not even close enough to have a universal basic income. \n\nYang states, “we've automated away 4 million manufacturing jobs in Michigan, Ohio, Pennsylvania, Missouri, Wisconsin, and nearly 40,000 right here in Iowa”. Yang is not including the whole picture for why there's a loss in manufacturing jobs in the United States. Outsourcing and offshoring in the Bureau of Labor Statistics also cite that skills mismatch the gap between skilled workers have in the skills employees need to also contribute. \n\nHis claims about truck drivers losing their jobs because of self-driving technology. In the study done by the American Center for Mobility with Michigan State University, “In the coming decades, automated vehicles will not stop accordingly, if at all, impact truck driving jobs.” Automated trucks is not designed to replace a human at the wheel, is designed to make the truck more efficient, easier, and safer. You still need someone in the cab to watch the cargo, navigate in the city streets, on and off highway ramps, through road construction, and someone to load and unload the cargo. \n\nYang's website claims, “the smartest people in the world now predict that a third of all working Americans will lose their jobs to Automation in the next 12 years.” This is from far accurate, according to a report done by the McKinley Global Institute “very few occupants less than 5% consists entirely of activities that can be fully automated and that in about 60% of occupations, at least one-third of constituent activities could be automated, implying substantially workplace transformation and changes for all workers.” “Even with automation, the demand for work and workers could increase as economies grow, partly fueled by productivity growth enabled by technological progress.” “This job growth (jobs gained) could more than offset the jobs lost to automation.”\n\nYang’s sites state, “As technology improves, workers will be able to stop doing the most dangerous, repetitive, and boring jobs. This should excite us, but if Americans have no source of income...the future could be very dark.” If technology is going to take your job and source of income how is $1,000 a month going to help? \n\nYang’s plan also includes, If you do receive, Social Security, Disability, HUD, SNAP, and or  TANF. You are not eligible for the $1,000 a month. \n\nAccording to Yang, corporations would be charged a 10% vat, or value-added tax. This will total about $800 Billion and total revenue, but ultimately this tax will be passed down to the consumer. \n\nThere's more bullshit that he states, his ‘smart people’ that he has on board as nothing more than his elector pyramid scheme that he's building up. It sounds great, but the fundamental idea is not valid at all. This is how any scam starts at the beginning, I'll give you free money now you don't have to worry later. Yang idea is not going to benefit anyone, other than possibly the corporations and himself.",
				"added": 1555804875
			},
			{
				"comment_id": 2,
				"body": "@anonymouslogin: I liked what I found and I think you need to read to see if you want to be living in a country like the post Soviet Union. Every one has to work, if your working not my problem but don't tell me and all the other tax payers that we are going to pay for you to sit on a couch and do nothing!",
				"added": 1555805228
			},
			{
				"comment_id": 4,
				"body": "@h3bhkj5gqz4n3pjm: \"WEST IS COMPLETELY SCREWED UP.\" By your logic, let's say that all the people that looked at this page are from the western civilization are you implying or stating that 80% of these people are, and I quote, \"CAN'T THINK RATIONALLY\"?",
				"added": 1555817727
			},
			{
				"comment_id": 5,
				"body": "As I noted, according to Yang, corporations would be charged a 10% vat, or value-added tax. This will total about $800 Billion and total revenue, but ultimately this tax will be passed down to the consumer. > [anonymouslogin]",
				"added": 1555820903
			},
			{
				"comment_id": 6,
				"body": "@h3bhkj5gqz4n3pjm I appreciate the remarks you alluded too. We may not have the same ideas, but no one does. We are all humans and that is what gives our live some spice. Without people's different ideas we would be living in a dystopia world. The main premise that I have not mentioned is that I am firmly against politicians siding with specifically large corporate banks and or investment banks. Theses banks should be held accountable for all their actions. Including eradicating the infamous Federal Reserve that enriches its shareholders and fellow bankers. While, burdening the American society with the interest on trillions, inflation, and inevitably a fiat currency worth nothing. These banks are nonpartisan and having 3-4 lobbies per congresspersons and senators. We need a candidate that keeps by his or her word of \"Drain the Swamps\".\n\n> [anonymouslogin](#comment_226_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm disturbed by this discourse. I think it is unnecessarily aggressive and not productive in the context of polite discussion. @cycletrader disagrees with my position and wrote a comprehensive explanation that makes sense to me, and as a result I respect his position and have reconsidered some notions I previously held. Please allow others to express their opinions without assaulting them on this forum like you have assaulted me for expressing my opinions.",
				"added": 1555889851
			}
		]
	},
	"comment_vote": {
		"1_16JiMWc6XDUZZWvEEPfwMTzwKb5Xki154u": 1,
		"2_16JiMWc6XDUZZWvEEPfwMTzwKb5Xki154u": 1,
		"4_16JiMWc6XDUZZWvEEPfwMTzwKb5Xki154u": 1,
		"107_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"106_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"226_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"6_16JiMWc6XDUZZWvEEPfwMTzwKb5Xki154u": 1,
		"36_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}