{
	"next_topic_id": 5,
	"topic": [],
	"topic_vote": {
		"39_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1,
		"1_12YXQ7Mi4nWmAKfHytZqaLvKGp3kwi7MXi": 1,
		"1_1JmA3gpcAoVTkx4auTc7gDiUQhFCKyc1cQ": 1,
		"4_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": 1,
		"1_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"3_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"1_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": 1,
		"4_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"7_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"8_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"2_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"6_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"4_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"8_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"3_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": 1,
		"3_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1
	},
	"next_comment_id": 75,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "Saludos a todos!",
				"added": 1470565654
			},
			{
				"comment_id": 2,
				"body": "> [diegotco](#comment_1_16fvx5UWqKJ4kgorjF3SbqtvzTre6ciiNU): Hola. Porque mi usuario se ve diferente al de los demás. \n> Vi un artículo en xataka y vine a dar acá. Alguien me podría resumir o pasarme un video sobre de que va esto de Zeronet?\n\ncreo q zero se parece o es una vpn, como freenet, i2p,tor",
				"added": 1470565707
			},
			{
				"comment_id": 10,
				"body": "> [piratexzeta](#comment_1_1C5bCeLcSBkwbJnmMWiqEUvgGLwbyiCaC2): Hola, espero que esto sea aprovechado por toda la comunidad que intercambiamos archivos\n\njusto a eso me voy a dedicar, la caida multiple de KAT y TORRENTZ es algo descomunal",
				"added": 1470618417
			},
			{
				"comment_id": 16,
				"body": "> [prexxett](#comment_1_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b): Saludos desde España a toda Latinoamerica\n\nbienvenido prexxett",
				"added": 1470710363
			},
			{
				"comment_id": 31,
				"body": "> [zypira](#comment_1_1JoqE4ennXH2kpkmDGxugqK1zE2LMa36hD): interesante esta red, saludos.\n\nsaludos, bienvenido",
				"added": 1471266841
			},
			{
				"comment_id": 53,
				"body": "> [tere](#comment_1_1CLnevVhvzKaU2wAM5A4rCx3TtbbsqJS7f): Hola!!! nueva por aqui saludos desde españa\n\nbienvenida",
				"added": 1472243035
			},
			{
				"comment_id": 57,
				"body": "> [potatoe](#comment_1_1KiHoNhCgAEkBGoQ7Tuvrfr2NcSL9Rui8q): Vamos a ver como se prepara un puto sitio de torrents ¿no? Que nos estan quitando todo lo weno.\n\nte recomiendo este: [UZTorrent](http://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Home)\nNo tiene las limitaciones de posts que tiene zerotorrent.bit para los que quieren compartir torrents; incluyendo mas categorias y foro",
				"added": 1474712268
			}
		],
		"1_1AZ8PAvb9ChktEbe1jy38b1TvbYB1xVJbh": [
			{
				"comment_id": 3,
				"body": "todo esto deberia centrarse en compartir material pirata y fomentar los medios,como el torrent, para obtenerlos; por otro lado, una wiki en español sobre zeronet no estaria mal\n\nsaludos",
				"added": 1470566017
			}
		],
		"1_1GsrTPLoAfhqn8Ds4DDNjYRzupw5inbm9": [
			{
				"comment_id": 4,
				"body": "> [riotpulv](#comment_7_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): Yo solo he visto esta y parece un directorio http://127.0.0.1:43110/13NS3rSzCTpAYtH997rphfZDaWRypyjwnU/ je\n\ngracias, deberias matizar de q es un directorio a redes externas",
				"added": 1470566079
			},
			{
				"comment_id": 5,
				"body": "tengo pensado compartir por aqui compilaciones de autor por torrent",
				"added": 1470566185
			},
			{
				"comment_id": 6,
				"body": "> [rapapobre](#comment_5_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): tengo pensado compartir por aqui compilaciones de autor por torrent\n\npor zerotorrent",
				"added": 1470568844
			}
		],
		"1_12YXQ7Mi4nWmAKfHytZqaLvKGp3kwi7MXi": [],
		"39_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 8,
				"body": "eso no estaria nada mal, hay muchas herramientas para i2p, esperemos q llegue a buen puerto, gracias por la info",
				"added": 1470569575
			},
			{
				"comment_id": 23,
				"body": "> [prexxett](#comment_14_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b): Estaría bien si no pierde rapidez, en caso contrario sería desaconsejable. Si va a ser como I2P no hace falta sustitutos sino mejorar el presente.\n\npienso lo mismo, aunque si eso va a dañar el rendimiento es posible q lo hagan opcional, como un modulo, que puedes o no activar",
				"added": 1470806540
			}
		],
		"1_1JmA3gpcAoVTkx4auTc7gDiUQhFCKyc1cQ": [
			{
				"comment_id": 9,
				"body": "tambien pasa en zerotorrent, son entre 1-2 file update",
				"added": 1470571913
			},
			{
				"comment_id": 17,
				"body": "añado:  zeromail ocurre el mismo error\no el caso UPDATING constante",
				"added": 1470756606
			}
		],
		"8_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 12,
				"body": "muy buena info entre todos, gracias",
				"added": 1470618966
			}
		],
		"3_1MNLXtMWLF4FX32eFfztzru14n7rn7V6nj": [
			{
				"comment_id": 13,
				"body": "KAFFIENE SEARCH_ tiene mas sitios indexados por ahora\nhttp://127.0.0.1:43110/kaffiene.bit/",
				"added": 1470619243
			}
		],
		"4_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 14,
				"body": "> [raito](#comment_11_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw): Prefiero hospedar en mi disco los sitios que me gustan, de esa forma se apoya a la red.\n\nopino lo mismo; pero tengo una duda: \nsi dejas de seguir a un sitio y lo borras,  los contenidos locales tambien se borran o debes hacerlo manualmente?\nen el segundo caso, como se identifican q contenidos son? \ny en que carpeta se encuentran?\ngracias de antemano",
				"added": 1470632894
			},
			{
				"comment_id": 22,
				"body": "> [zeronauta](#comment_2_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg): Si borras un sitio los contenidos locales también se borran. Se guardan en la carpeta data/ y el nombre coincide con el identificador de la página. Cuando creas un Sitio lo puedes editar directamente desde ahí (bueno, hay que firmarlo y todo eso).\n> Yo también prefiero alojar los sitios yo mismo. Poner un límite inicial de 10MB está bien para hacer sostenible la red. He hecho un uso intensivo estos días y me ocupa 250MB\n\ngracias por responder, sobre el limite inicial, yo lo he cambio en funcion de necesidad, y al final me ocupa mas o menos como a ti, sobre los 250-280MB",
				"added": 1470806436
			}
		],
		"1_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": [
			{
				"comment_id": 15,
				"body": "> [prexxett](#comment_2_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b): Muchas gracias\n\npara nada colega prexxett, estos aportes tambien te los puedes encontrar en 1337x, PTB y en la extinta KAT XD\ngracias por pasarte",
				"added": 1470710297
			}
		],
		"2_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 18,
				"body": "desde mi posicion, la de un usuario medio sin aspiraciones en esta red, me tengo q mojar a mi forma, yo lo q voy a hacer es compartir por torrent aportes propios en español; dices esto y si no lo intentas.por la regla q tu mismo marcas. pues ya puedes apagar el pc...\ncomo dicen mas abajo:Quien no quiere ofrecer nada, no puede esperar nada a cambio.\nsolo esperemos que el q lo dice este actualmente aportando algo tangible",
				"added": 1470757499
			},
			{
				"comment_id": 54,
				"body": "> [userzero](#comment_42_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk): De momento ZeroTorrent.bit ya ha muerto, no existe un digno sucesor, no se están creando muchos clones de webs, personalizándolas y añadiendo contenidos nuevos, Zerome la red social no acaba de despegar, el creador de Zeronet es un sólo usuario y no parece tener tiempo para hacer actualizaciones de gran calado, el streaming novedoso no funciona/es el de toda la vida/o hay alternativas mejores y más privadas,.....\n\nsolo espero q no piensen en zeronet, exclusivamente, como una herramienta social; entonces esto va acabar muy abandonado, si lanzas una app torrent, video & audio straming en este ecosistema la cosa va a subir mucho; al menos, con lo q va de historia, si aceptamos q casi todos los usuarios q estan en zeronet, se encuentran con un perfil en zerome, son mas de mil, pero de esos mil, activos unos cien y ese panorama no es bueno. es decir, con las herramientas y apps del staff de zeronet actuales resulta insuficiente; yo al principio me pasaba a diario, ahora solo, cada dos dias y supongo q el siguiente paso es cada semana...",
				"added": 1473729758
			}
		],
		"3_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": [
			{
				"comment_id": 19,
				"body": "Dadle a seguir en Newsfeed, con el fin de recibir notificaciones de este post a vuestra bandeja de entrada en zeronet. saludos",
				"added": 1470762870
			}
		],
		"1_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": [
			{
				"comment_id": 20,
				"body": "tantas formas de ganar dinero, y yo con tan pocas ganas de hacer nada XD",
				"added": 1470762965
			}
		],
		"1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": [
			{
				"comment_id": 21,
				"body": "como no hay forma de puntuar negativamente yo pongo lo siguiente: SPAM.TROLL.FAKE.BUG.BOT.COCHA.DEFACE.HACK.MOCOSOFT.HDSPM.LAMER.LEECHER.",
				"added": 1470763459
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 24,
				"body": "en torrentfreak y webs de informatica españolas",
				"added": 1470807093
			}
		],
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 25,
				"body": "gracias por el aporte! enlazada",
				"added": 1470807669
			},
			{
				"comment_id": 26,
				"body": "> [prexxett](#comment_20_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b): Yo he añadido algún enlace pero aunque se supone que es en español veo difícil que algunos no sean en inglés.\n\nentiendo, aun asi, mientras esten las directrices mas simples, creo q bastará con eso",
				"added": 1470842315
			},
			{
				"comment_id": 27,
				"body": "blogs en español_en la lista de los sites de los usuarios hispanohablantes, se deberia situar una sinopsis de la tematica q tratan en el mismo, no solo el nombre del usuario.",
				"added": 1470842556
			},
			{
				"comment_id": 28,
				"body": "hay un nuevo servicio zerome! pinta bien",
				"added": 1470858250
			},
			{
				"comment_id": 29,
				"body": "esta quedando muy completo! gracias",
				"added": 1470937702
			}
		],
		"2_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": [
			{
				"comment_id": 30,
				"body": "si existen cambios relevantes en la lista lo ire añadiendo/cambiando",
				"added": 1471260904
			},
			{
				"comment_id": 34,
				"body": "RECOMENDADO_utilicen como maximo un TOTAL DE 10 TRACKERS; es posible que cause el efecto contrario en el cliente, ralentizandolo.",
				"added": 1471407742
			},
			{
				"comment_id": 38,
				"body": "actualizado a 19/8/16",
				"added": 1471598268
			},
			{
				"comment_id": 47,
				"body": "actualizado 22/8/16",
				"added": 1471828149
			}
		],
		"1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN": [
			{
				"comment_id": 32,
				"body": "> [aquila200](#comment_1_1LhzvZpMc9fNxuKpVYGFH9xVATd12oJtC5): para que serve este site??\n\nte recomendaria visitar este enlace WIKI ES, para que te hagas una idea general de lo q es zeronet y sus secciones como zerotalkES  \nhttp://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/",
				"added": 1471369017
			},
			{
				"comment_id": 33,
				"body": "> [aquila200](#comment_1_1LhzvZpMc9fNxuKpVYGFH9xVATd12oJtC5): para que serve este site??\n\nyo, personalmente, lo utilizo para compartir torrents por zerotorrent",
				"added": 1471369163
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 35,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc/rapapobre@zeroid.bit",
				"added": 1471408052
			},
			{
				"comment_id": 37,
				"body": "> [icf20](#comment_7_1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5): de momento tu perfil a mi me sale en blanco\n\npuede deberse a q tienes q descargar el perfil, debe salirte en el centro del perfil",
				"added": 1471597861
			},
			{
				"comment_id": 41,
				"body": "> [dios](#comment_6_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z): 0me esta mas muerto que vivo, la mayoria de los usuarios solo han puesto el post por defecto y nada mas\n\nes cierto, zeronet deberia tener herramientas mas completas y no a medias, por problemas del sistema de busqueda de **zerotorrent** aun no he bajado nada de aqui(solo subo). en el caso de zerome deberian implementar y unificar nuestro perfil social con zerohello pero YA\nzeromail_ debes entrar en la app ya q no tienes idea si recibes correo...\nsolo esperemos a q los usuarios sigan tenian teniendo zeronet en su pc/dispositivos y cuando sea mas estable y atractivo ya veremos...",
				"added": 1471716206
			},
			{
				"comment_id": 42,
				"body": "> [icf20](#comment_9_1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5): eso a la larga puede ser un problema, si zeronet se centra solo en eso, la distribución de material ilegal a la larga puede perjudicar\n\nes una herramienta q utilizan los usuarios y creado por usuarios; si algo va mal q lo eliminen, aunque resulte contradictorio, dado el medio y la ideologia expuesta, e incluso las herramientas propias de zeronet y su uso abogan estos terminos; de todas formas, yo no quiero estar en una red q no permitan esos medios y por ende otros muchos; en este sentido seria lo mismo q estar en la \"red indexada google\", es decir, zeronet perderia toda la aplicabilidad, ya q si es censurable algo pq no todo; en concreto: red intervenida",
				"added": 1471717220
			},
			{
				"comment_id": 43,
				"body": "> [userzero](#comment_7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk): Sólo cuatro usuarios suben torrents, parece que si no hay un sistema de puntos, subir de categoría u otro tipo de compensación económica/socia/etc la gente no hace nada\n\nestaria bien **un sistema para uploaders verificados**, puntuacion negativa etc; solo con el fin de q los torrents se reconozcan como verificos y libres de malware; es decir, q la gente confie (resulta lo mas practico)\nahora bien, tal y como  dices, puede q sea cierto q se busque la **compensacion egoista** sin ninguna praxis; algo q veo obsoleto en un entorno como este, donde \"el anonimato\"(o eso se pretende) esta primero; si no se hace nada, exceptuando a unos pocos q intentan mantener informado a una comunidad, q no es \"comunidad\" como se cree, ya q esto se basa en la actividad, nos encontramos con el mismo problema...",
				"added": 1471726031
			},
			{
				"comment_id": 44,
				"body": "> [dios](#comment_7_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z): todas las direcciones de la web zeronet son también direcciones bitcoin se puede enviar bitcoin a todas ellas \n> por ejemplo http://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL https://blockchain.info/address/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL\n> hoy el precio del bitcoin esta en 575 USD http://bitcoinity.org/markets/bitstamp/USD\n> para que se necesitan puntos cuando se pueden enviar dinero?\n\ngracias por la info; pero si te fijas en el comentario, ahi no esta el problema...",
				"added": 1471744769
			},
			{
				"comment_id": 45,
				"body": "> [dios](#comment_9_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z): yo creo que si, los puntos, el karma, la fama, etc es recompensa y no hay mejor recompensa que el dinero\n\nsi y no, para mi personalmente, si una red no aporta nada, puede proponer lo q quiera pero eso es forzar a los users a permanecer en un entorno monetizado y q no desean, no por la monetizacion, sino pq no responde a intereses atractivos; habria muchos q si, pero otra inmensa mayoria q no, no por el dinero sino por no conocer el entorno ya q no atrae: a eso se le llama comunidad q persigue un ideal (como en KAT); si no existe un entorno complejo donde abale eso q dices de \"dinero, fama, etc\" entonces puedes esperar sentado, primero se priorizan unas cosas y despues otras(ganar dinero en un site abandonado?); y el tema en si(si has seguido la conversacion), no se hablaba de dinero como algo \"positivo\" sino en negativo, como recurso para cazar redes no indexadas como esta; es decir, el dinero es un bien invasivo, pq? pq ofrece justamente lo contrario, la exclusion.\nBasicamente, pensar q todo esto puede ser monetizado, no es el problema; sino solidarizar a los users para crear un entorno sano primero y despues introduce todo los caramelos que quieras pero no como reclamo! sino como **proyecto de intereses** ; claro esta, tiene mas dificultad lo 2º que lo 1º; pero es un hecho q solo 4-5 tipos estan haciendo algo, y es justo eso, de forma desinteresada lo q mas me atrae como user. Es muy facil decir: \"el dinero es el problema/solucion\",  pero visto lo visto, yo mismo, como usuario, relacionar el dinero con algo positivo, es solo en contadas ocasiones y q por lo general no lleva a contenidos interesantes sino todo lo contrario: a discurso masticado.",
				"added": 1471781399
			},
			{
				"comment_id": 46,
				"body": "> [userzero](#comment_10_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk): Totalmente de acuerdo, yo he colaborado en muchos proyectos y nunca he cobrado un euro, es más si en Zeronet se asigna/paga/cobra algún dinero abandonaré el proyecto.Yo sólo quiero saber cuantos torrents hay, cuantos he subido yo, en que fechas, cuantos otros, modificarlos,...pero no por los demás sino por mi mismo.  : )\n\nyo solo espero q cuando vayan a manipular zerotorrent(si es q lo hacen), para hacerlo mas completo, no se vaya todo el contenido al traste XD",
				"added": 1471795954
			},
			{
				"comment_id": 48,
				"body": "> [pythonmx](#comment_1_13ef3vCJM2uabiDDmJDzu6g3wavRRW4zy2): y... ¿como se publica un perfil en ZeroMe?\n\nen zerome, pulsa en el nombre de tu perfil(es tu ID), una vez ahi, copia el contenido de la barra de direcciones de tu navegador (esa es la direccion de tu perfil) y la pegas aqui.",
				"added": 1471987963
			},
			{
				"comment_id": 52,
				"body": "> [riotpulv](#comment_11_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): Perdón a sus mercedes hijos del lenguaje políticamente correcto ;)\n\neh eh eh, políticamente correcto no, pirata si",
				"added": 1472238007
			},
			{
				"comment_id": 59,
				"body": "> [xikujaro](#comment_1_15rDwTWvkH2digEM8BSxWCUanhBJVXnKki): Me imagino que aquí somos siempre cuatro gatos ¿no?.  #pueseso #loteniaquedecir\n\njusto eso, creo q el **problema radica en la lentitud de desarrollo de zeronet y en la carencia de apps OFICIALES** atractivas para los usuarios. yo, actualmente, solo me paso cuando hay actualizaciones, poco más.\n**en el caso de las apps de usuarios**, son unos pocos, streaming de musica? aun en desarrollo; streaming de vídeo? demasiados datos locales alojados en tu zeronet y datos concretos del vídeo (sigue compensando verlo online); apps alternativas q cubren un servicio oficial(como 0me dark/0me+/IDKaffie)? quizás ahora valgan pero cuando zeronet avance, no tienen pq seguir el mismo camino ya q el desarrollo depende de los usuarios, sin contar que las IDs no oficiales dan problemas a la hora de sign en algunos 0sites...",
				"added": 1476012998
			},
			{
				"comment_id": 72,
				"body": "> [kaligula](#comment_2_1LQ2rmokNb5cL1Mrhawmp7YeioBAUr2iWR): bueno soy kaligula no se como poner mi perfil\n\nentra en tu perfil zerome (zerome> arriba derecha>click en tu nombre) copias la dirección que aparece en tu navegador (esa es tu dirección de zerome)",
				"added": 1489956135
			}
		],
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 36,
				"body": "gracias por la info; seria interesante una introduccion a las distintas alternativas a zeronet y sus diferencias (i2p,ipfs,freenet,etc)",
				"added": 1471425160
			},
			{
				"comment_id": 55,
				"body": "recomiendo pasar por aqui, es una guia completa para lenguaje markdown\nhttps://exo.do/topic/10994/tutorial-editor-del-foro-markdown-para-dummies\npor ejemplo quieres meter una imagen? usa esto:\n`![entre ambos corchetes no poner nada](direccion de la imagen estatica/animada url)`\nseria asi: `![](url imagen)` (entre el signo \"!\" y el primer corchete no hay espacios)\n---\nañado que la dirección, al final debe contener la extension de la imagen, como .jpg,.gif, en tal caso no funciona; tampoco se puede garantizar su uso en todos los ambitos, puedo garantizar que si en 0blogs. suerte\nejemplo `![](http://torrentinvitez.com/customavatars/avatar393_13.gif)`\n",
				"added": 1474338185
			}
		],
		"1_1KEw6wTgDMKNnvqYjVa7zk8hGxdC5EXa5U": [
			{
				"comment_id": 40,
				"body": "alguna introduccion? info?",
				"added": 1471706452
			}
		],
		"3_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": [
			{
				"comment_id": 49,
				"body": "> [drymer](#comment_1_1BBCbDdZtZ5ZJGhF2WcMRcn3FEKQ7PaoMS): Usa markdown, puedes ver lo básico aquí. https://elbinario.net/2014/06/25/markdown-for-kitties-introduccion/\n\nGracias por responder",
				"added": 1472136151
			}
		],
		"6_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 50,
				"body": "> [userzero](#comment_18_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk): ¡Mi trabajo desapareció! Más de un 60 % borrado. Put. mierda\n\nacaso, hay limite de post por tema?",
				"added": 1472224498
			},
			{
				"comment_id": 51,
				"body": "voy a empezar a compartir tu post tambien\nsuerte!",
				"added": 1472224564
			}
		],
		"57_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 58,
				"body": "no sale el post, lo he buscado y el correcto seria el siguiente: http://127.0.0.1:43110/procesos.bit/?Post:106:No+todo+lo+que+brilla+es+onion!",
				"added": 1474999536
			}
		],
		"1_1NUR48H6bvCL3YnUccZCbYwVYdpP7HjL9r": [
			{
				"comment_id": 60,
				"body": "> [ceritium](#comment_11_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo): un tracker o un sitio rollo piratebay para publicar los torrents?\n\nsi es por las posibilidades del formato de piratebay(muy pobre en comparación con otros), eso ya lo tenemos con UZTorrent, excepto por la visualización de los pares y del perfil de usuario; lo ideal seria tener un tracker q aproveche la tecnología de zeronet (incluyendo tracker de publicacion) o al menos una app torrent mas compleja q las q existen ahora.",
				"added": 1476645681
			},
			{
				"comment_id": 61,
				"body": "si quieres ir a lo practico, deberías clonar UZTorrent y extender sus posibilidades:\n+ visualización de perfil de usuario: subidas propias\n+ visualización de pares: semillas/clientes\n+ visualización/manipulación de trackers (manipular magnet/torrent)\n+ mejorar busqueda_agilizar la búsqueda de torrents: obviar o incluir los signos de puntuación etc\n+ mejorar busqueda_categorias extendidas\n+ mejorar busqueda_ en funcion del idioma de los aportes",
				"added": 1476646150
			},
			{
				"comment_id": 62,
				"body": "las semillas? ni idea, solo he propuesto lo q me parece a mi, pero no tengo conocimiento ni de programar ni q servicios/apps existentes se deben indexar al cliente o q dependencias existirían entre si con el fin de visualizar semillas...",
				"added": 1476683675
			}
		],
		"1_15WwrPNDDrq1NsGVGsj5LjRififxHrsw8Q": [
			{
				"comment_id": 63,
				"body": "pasate por mi blog [FOMO](http://127.0.0.1:43110/17Tzm1HYknrRiiHZ5xLJqGNooebmoLqit7/?Post:57:Torrent+sites) en torrent sites, tengo una sección de torrent_cine/series en español/castellano; puedes, al igual q en play, usar metodos streaming; ahora bien, si lo q buscas es un site dentro de zeronet, no existe ninguno mas completo q play, pero NO con material en español, play usa las bases de datos RARBG, un tracker en ingles. suerte",
				"added": 1476692753
			},
			{
				"comment_id": 64,
				"body": "> [chemajmq](#comment_3_1PML5L3YPxQXuzpkBvkt6LGY8cNeRp6kJD): una pregunta rapapobre como se entra en play estoy un poco perdido.\n\nlo primero pasate por aqui [ZeroWikiES](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/?Page:lista-zites) esa guia no solo es para conceptos sino tambien una base de datos de los sites existentes mas importantes, en una de esas secciones encontraras \"peliculas y videos\", ahí aparece no solo play sino otras, con ello sus direcciones para acceder claro. suerte",
				"added": 1476824961
			}
		],
		"7_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": [
			{
				"comment_id": 65,
				"body": "> [riotpulv](#comment_14_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): El único problema que veo es que ya existe, aunque anda un poco quieto, por qué no le ayudáis?http://torrenttunes.tk/\n\nlo malo de esta app: sigue consumiendo muchos recursos con java y no acepta (creo) otros formatos a parte de mp3",
				"added": 1476894372
			}
		],
		"8_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": [
			{
				"comment_id": 67,
				"body": "> [cer](#comment_54_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Gracias a ti por tu reporte! (yo tambien sigo tu blog, ya te habras dado cuenta ;)\n\ngracias, seguiré el asunto de cerca y  notifico si vuelve a la normalidad; ya me di cuenta, gracias por pasarte por mi 0blog y también por la info de I2P, la utilicé en su momento citando las fuentes. saludos :)",
				"added": 1477426391
			}
		],
		"2_1HQ8XgxtabgN9qLhPvbwWzUQsoTPRsmeLs": [
			{
				"comment_id": 68,
				"body": "existen navegadores, extensiones q evitan la actividad de webRTC; siempre recomiendan una VPN corriendo tras el navegador en el caso de utilizar webRTC",
				"added": 1478882837
			}
		],
		"7_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 69,
				"body": "muy buen aporte; aunque se echa en falta, no solo en chatbox, sino en todas las opciones de chats en zeronet, la implicación con zerohello como bandeja de notificación donde el usuario pueda informarse y actuar",
				"added": 1482251680
			}
		],
		"1_1EPLXp3NkA2e8eiNUY4toZNkHmojgKriTj": [
			{
				"comment_id": 70,
				"body": "buen aporte, pero la direccion es incorrecta, seria la siguiente\n\nhttp://127.0.0.1:43110/1KbdkxDdHxSFxkbMjHzXvWnJQCQJkYq8Mo/index.html\n\nel error se encuentra aqui `...:43110...`",
				"added": 1483078436
			}
		],
		"1_1MPwgdpsMPvHibH5qVGJ28wM5VbFZmhCfE": [
			{
				"comment_id": 71,
				"body": "pasate por la wiki en español:\n[Lista de sitios](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/?Page:lista-zites)",
				"added": 1487783955
			}
		],
		"2_17LGTUrcDk4efCtCDX3D8CaDY8Yt9icA8Y": [
			{
				"comment_id": 73,
				"body": "no olvides publicar tu blog en la [Wiki ES](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/)\nen la sección lista de blogs, están divididos alfabéticamente en función del nombre del blog.",
				"added": 1489973645
			}
		],
		"1_1NvEE1fCHFtVEF8iJHhm8AYCH2LwdBx4Zr": [
			{
				"comment_id": 74,
				"body": "ese sitio fue abandonado prueba con http://127.0.0.1:43110/ZeroTorrent.bit/\nfue el primero en aparecer\nsuerte",
				"added": 1499234955
			}
		]
	},
	"comment_vote": {
		"5_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"11_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": 1,
		"2_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"1_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"10_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": 1,
		"2_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": 1,
		"5_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"10_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"12_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"1_1BBCbDdZtZ5ZJGhF2WcMRcn3FEKQ7PaoMS": 1,
		"16_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"18_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"1_1CLnevVhvzKaU2wAM5A4rCx3TtbbsqJS7f": 1,
		"21_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"12_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"36_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"48_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"49_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"45_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"53_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"1_1NytpXTrrY8qe7yxBjRuzjGePDZk2Kz98M": 1,
		"2_1PML5L3YPxQXuzpkBvkt6LGY8cNeRp6kJD": 1,
		"54_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1
	}
}