{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1
	},
	"next_comment_id": 6,
	"comment": {
		"2_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": [
			{
				"comment_id": 1,
				"body": "Всем привет друзья.\nЯ в первый раз зашел в Zero.Net. Рад буду общению",
				"added": 1548150141
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 2,
				"body": "Вот уже переселение начал.",
				"added": 1548405127
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 3,
				"body": "Здравствуйте. Я так понимаю, что ушел из жизни один из первопроходцев русскоязычного кластера Зеро Нет? К сожалению, я не знал Романа раньше, да и вообще здесь новичок. Но от всего сердца выражаю свои искренние соболезнования.\nУважаемые форумчане! Подскажите, где в Зеро Нет находится раздел для новеньких, где более-менее понятно описаны основные принципы взаимодействия в сети, возможности её, ну и места где можно пообщаться.",
				"added": 1548405504
			},
			{
				"comment_id": 4,
				"body": "> [geekless2](#comment_24_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Вот мой раздел для новеньких: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\n> Не обновлял около полугода, к сожалению.\n\nСпасибо.  Главное начать.",
				"added": 1548498218
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 5,
				"body": "Всем привет, друзья. \nПрочитал несколько форумных веток и хочу высказать свое мнение.  \nВот здесь многие активные пользователи указывают на то, что популяризация Zero Net проходит не очень то и активно.  Есть пользователи, которые наполняют контентом сеть, но большинство приходит и уходит.  И вот что мне хочется сказать.\nЧтобы сеть была популярна, она должна быть понятной и доступной не только для гиков, но и для обывателей. Есть особенности технологии, которые требуют помощи, так почему бы не  написать внятный мануал по \n- регистрации в сети,\n- создании блога,\n- возможностей форматирования в блоге.\n- уникальных плюшек сети, \nи тп.\nИ чтобы это было понятно даже деду Василию, который месяц назад купил ноутбук, научился сидеть в соцсетях и воспылал желанием создать что-то своё.  Когда такой мануал появится, народ сюда пойдет, не то что пойдет а побежит. Не спорю, есть пытливые умы,  до которых всё прекрасно и без этого доходит. Но не все такие. \nОдно дело, если хотите чтобы Zero Net оставался вотчиной только доля продвинутых пользователей, программистов, линуксоидов и прочей IT публики.  Таких, несмотря на массовость на рынке труда в целом не очень много.\nКонтент создаёт обыватель. Ему похрен что и как тут устроено в деталях, надо проще и чтобы работало.  Тогда и будет успех.\nПри наличии такого мануала я сам с удовольствием буду продвигать его где угодно и сколько угодно.  \nСпасибо.",
				"added": 1549452269
			}
		]
	},
	"comment_vote": {
		"5_1FSbdEiKNhHNUNpnHBbbPS3s39TrFCS7P8": 1
	}
}