{
	"title": "EpiBlog",
	"description": "Unofficial Epitech blog",
	"links": "- [Epicheat](https://github.com/Epicheat) _external_",
	"next_post_id": 9,
	"demo": false,
	"modified": 1457433192,
	"post": [
		{
			"post_id": 6,
			"title": "Some stats about cheating",
			"date_published": 1457230434,
			"body": "This post is not related to Epicheat. Actually, it's not totally related to Epicheat.\nOn GitHub, you can see the traffic for each one of your repositories.\nIf you publish your epitech projects on it, especially if you have a famous github account or if you had an awesome mark, you could make correlations.\nOn Twitter, you can find tweets about this analysis. Here are two examples :\n\n## Epicheat/Exam-C-Tek-2\n![Stats](img/CbqytZHWAAEgCBc.png)\nWe already talked about Epicheat in a previous post. This screenshot shows traffic on this repository a few days before an exam, which occured the 02/20. There were 52 visitors in the 5 days preceding this test. Let's assume that only parisian students watched it. (It's obviously false, some random people may have seen it, teachers and regional students have also seen it, but it will be easier to process). At this test, there were 331 people registered. 73 students were missing. So, 258 did the test. It means that 20.2% of the students cheated on this test.\n\n## Emeraude/nm-objdump\n![Stats](img/CcZLfRqWAAEXsy9.jpg)\nThe nm/objdump project is a mandatory project. During the past year, this project was a part of the optionnal \"advanced unix programming\" module.\nFunny fact : None of the current teachers (the ones who mark the students) did the project when it was optionnal. I think the pitches were very interesting...\nThis repository has been made by broggi_t, which had the best mark last year. During the two weeks preceding the deadline of the project, no less than 229 people saw this repository.\nThere were 420 people registered to the project in Paris. So, let's make some hypothesis:\n\n### Not turned in project have not cheated\n174 students did not turn anything in, which means 246 actually did the project... Whoops! According to my calculations, 92% of the students who turned the project in cheated! That's pretty awesome (and it will probably please the paranoid teachers - we will talk about it later).\n\n### Everybody looked at it\nEven if we take into account the people who did not turn in the project, it represents 53.8% of the promotion. It's still A LOT.\n\n### Only good projects used it\nOnly 41 people have a mark superior to 1.5. With a simple calculation, we can conclude that 551% of the promotion cheated.\nHmmm... that does not make any sense...\n\n## Conclusion\n\nThis results are only informative. Some students who saw the repository may have only searched it to know if somebody achieve this project correctly, or simply to have an idea of how to do it. There are probably some teachers that looked at it, maybe it represents a quarter of the visitors.\nAnyway, this graphes (especially the drop after the deadline) show that a large part of the students search for the answers on github, and part of them use it to make their projects, or simply turn it in without any modifications.\n\nNB: All this stats have been done in march 2016, so it concerns the 2019 promotion. Keep that in mind if you read this post later."
		},
		{
			"post_id": 4,
			"title": "Epicheat",
			"date_published": 1457099872.163,
			"body": "You probably already now [Epicheat](https://github.com/Epicheat).\nIt's one of the most famous github repository that will be helpful during your studies at Epitech.\nCreated in April 2015, it contains two repositories (one for C exams and one for SQL exams), both usable during your tek2 exams. These answers are also useful in tek1.\nIt's the only github that contains that much answers for your exams.\nThe README file will tell you how to you it on the exam partition.\nIf you are too lazy, there are already some shell scripts that will parse the subject and answer for you."
		},
		{
			"post_id": 3,
			"title": "Welcome on EpiBlog",
			"date_published": 1457099316.72,
			"body": "EpiBlog is the first blog about the Epitech school on ZeroNet.\n\nHere we will share some informations about our (and probably your) school."
		}
	]
}