{
	"posts": [
		{
			"id": "67bbd9f4-88c3-4923-9a98-4370aeb30840",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "3dd02ad1-2cbb-44bd-9a61-215f2f312091",
			"body": ">>3dd02ad1-2cbb-44bd-9a61-215f2f312091\nI came here to laugh at you, civnat faggot. \n\nRemember lads, post infographics before muting slide threads and tell others to do the same. ",
			"time": 1565217724188,
			"files": "[{\"name\":\"1544536164614.jpg\",\"thumb\":\"ddbaad1f15fc2f879eb99d58adaeb9e4dff33805-thumb.jpg\",\"size\":71420,\"type\":\"image/jpeg\",\"original\":\"6abcf621158b081188fc1911d6a7c0e0f269dd85.jpg\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"},{\"name\":\"pierce_on_muh_false_flags.jpg\",\"thumb\":\"16fa60907fc54773e3c20dbaf4f0a6ed894c8ab6-thumb.jpg\",\"size\":43849,\"type\":\"image/jpeg\",\"original\":\"a38de31edbca030651ac82164efde72c4b35e922.jpg\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"},{\"name\":\"4chan_II.jpg\",\"thumb\":\"619a8486225d9f85fe2e9481b036672eeaed43f1-thumb.jpg\",\"size\":233845,\"type\":\"image/jpeg\",\"original\":\"384768c03a77401830b88a70edeea193fe18e755.jpg\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"}]"
		},
		{
			"id": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "/sig/ Self Improvement General- We're back, baby!",
			"body": "Before we can defeat the jews in the World Bank and the jews in Hollywood, we must first defeat the jews within ourselves\n\n\nShills and useful idiots will come. They will attempt to derail the thread and undermine good advice, as they do in every /SIG/. Ignore them and mute– do not even respond.\n\nGo to the gym or start a body weight routine fat ass. Don’t neglect cardio, go for a morning run. Take a cold shower. Get 7-9 hours of good quality sleep every night, avoid stimulants in the late afternoon. Become a morning person and get up early. \n\n>https://hooktube.com/watch?v=XtDc_iJ-j-M\n\nHygiene is important. BRUSH YOUR TEETH TWICE A DAY FOR 2 MINUTES, don’t forget to floss. Make your own toothpaste. Get a tongue scraper too. Your tongue should be a nice pink color, not white or yellow. This is not some ancient, long forgotten secret, but it’s amazing how many people neglect oral health - it’s just as important as lifting. Deodorants containing aluminium salts are toxic, avoid their use at all costs. You can make your own spray from baking soda, water and a few drops of a nice smelling essential oil. This will stop body odour without making you sterile. \n\nLower your carb intake and eat more animal fat. Eat lots of organic meat and fish. The (((food pyramid))) overestimates the amount of carbs you should be eating - stop consuming excessive amounts. Do not eat feminized products soyboy. Treat yourself to an occasional glass of good red wine, or a small portion of high cocoa dark chocolate. Try intermittent fasting, a simple 18/6 routine can work wonders. \n\nDo not breed with roasties or THOT’s. Find a wholesome waifu. Do not expect to meet a wholesome girl in a bar, nightclub or university campus. Plan a family. Raise strong men and respectable women who will lead in the race war.\n\nMeditate. It calms the mind, builds discipline and is an ancient, tried and tested method of building mental clarity, control and spirituality. Start today, it only takes 10 minutes.\n\n>https://hooktube.com/watch?v=Q-L2ZKYMsag\n\nDo not act like a nigger, do not steal, rob or vandalize. Violence should be used sparingly when there is no other option, you are not a monkey. Respect yourself and your race. Don't humiliate your women with the degeneracy of feminism.\n\nStop consuming (((pornography))). Oh, you think that you’re not addicted to porn? Prove it. Try to go without porn or fapping for a whole week or two. Then aim for a month. It’s harder than you think.\n\n>https://hooktube.com/watch?v=wSF82AwSDiU\n\n>https://hooktube.com/watch?v=7oFVOJf0TzY\n\nQuit playing video games faggot. Do something productive, write something or build something. Plan your career, climb the ranks or start a business. Learn something useful. \n\nWe need more strong, kike-free men in positions of power.\n\nNow get off the internet, go /out/side and get some sun. Go for a hike. Go camping. Join some wholesome clubs and make some normal friends. Do not reveal your power level to normalfags, drip feed them redpills. Stop smoking cigs and don't do drugs. Don't watch degenerate (((media))) and read some good books. You can easily source used books cheaply from local stores or online. \n\n>https://www.abebooks.com/\n\n>http://gutenberg.org/\n\nWork towards owning property and/or land. Don’t waste your time and money buying new cars on finance, it is a jewish trick. Save 10% of your income for a rainy day, even a little will go a long way. Stash some money in safe alternate forms, like silver and gold. Maybe a little crypto too, but be cautious. \n\nBecome informed on prepping and homesteading, make sure you’re ready when SHTF. \n\nThis is your life now.\n\nWelcome to /SIG/ 2019 in exile",
			"time": 1565223281891,
			"files": "[{\"name\":\"DO_IT_NOW_0.jpg\",\"thumb\":\"de812673a74eca12b6a4395c7cc26e49a6351b50-thumb.jpg\",\"size\":107133,\"type\":\"image/jpeg\",\"original\":\"b9827e7932c2b6d8becf2f579bbd3ba6701b650b.jpg\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"}]"
		},
		{
			"id": "110e3a56-57b2-4bf5-8a2c-19e54f78cea4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"body": ">3364\nShill case in point #1, remember to mute lads.\n>>36ecb380-3d45-42c1-8026-efdaa77244cc\nI would recommend bodyweight exercises and running. Keep it simple. I bought a pullup bar at walmart for 30 bucks, and I combine that with pushups and running on my toes. It builds a solid foundation and you don't have to deal with normies. Remember to run on your toes to work your whole leg.",
			"time": 1565224792643,
			"files": "[]"
		},
		{
			"id": "751d0708-d73a-4b8c-87ee-b6302b075e15",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b24064a8-8bbd-4177-bc4d-98fb9772ddcc",
			"body": ">>b24064a8-8bbd-4177-bc4d-98fb9772ddcc\n>(((Thornberg)))\nM",
			"time": 1565225012851,
			"files": "[{\"name\":\"FormOfTheJew.png\",\"thumb\":\"8e0db0188511cde8c55948c4128ee311cabb2866-thumb.png\",\"size\":251480,\"type\":\"image/png\",\"original\":\"d5e85c012bfa5c3d8c74b3d39ce03e57d78c6f9f.png\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"}]"
		},
		{
			"id": "4f9f90b3-8106-4131-8d6d-9ebb686a1cbb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"body": ">>889800da-1237-47a0-82d4-fcaeda35503e\nMany thanks for this one! I've been collecting as many /sig/ infographics as I could the last year and somehow I didn't have one. ",
			"time": 1565233558332,
			"files": "[{\"name\":\"doomer.png\",\"thumb\":\"ef7d1653d9018edf6f80fa6aa7037b119fb4d66d-thumb.png\",\"size\":513769,\"type\":\"image/png\",\"original\":\"4ca912ad1eb310cea280390e3b5c5f945f295e5f.png\",\"directory\":\"15y1pUmq2jgh6i1bRAnsDjjGbvLfyrPe4W\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}