{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1AoBLSHxtHL11EBHgm2d1Epp5Chxkn45EA": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_1AoBLSHxtHL11EBHgm2d1Epp5Chxkn45EA": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1557692292_1D6Nt1Jti5YQYMwfrTC9rTrRVK2WVfzzFR\nДавайте послушаем джаз. Мне кажется это вполне интересно. Интересно, русская аудитория Zeronet слушает Джаз? Пишите в комменты, если, конечно, хотите. Мне кажется вполне интересная тема для разговора.",
				"added": 1557866246
			},
			{
				"comment_id": 2,
				"body": "На видео --- величайший канадский, джазовый пианист Оскар Питерсон. Что скажете?",
				"added": 1557866387
			},
			{
				"comment_id": 3,
				"body": "Это один из самых моих любимых джазовых пианистов. Я стремлюсь играть также, как и он, а также ищу свою манеру, на основе его манеры игры.",
				"added": 1557866543
			},
			{
				"comment_id": 5,
				"body": "> [4elovekkun](#comment_2_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7): Чем здесь вообще можно заняться?\n\nСам задаюсь тем же вопросом. По моим соображениям, можно посёрфить какой-нибудь местный поисковик и послушать музыку. Или зайти на KopyKate и что нибудь посмотреть. Там много всего, но больше всего там всякого аниме. Хотя если честно говорить, я здесь новичок, и знаю об этой сети слишком мало. Не думаю, что мой совет как то поможет.",
				"added": 1557942991
			},
			{
				"comment_id": 6,
				"body": "> [c4at4w4y](#comment_3_1AoBLSHxtHL11EBHgm2d1Epp5Chxkn45EA): Тут можно поговорить о чём-то\n\nА о чём вы любите общаться? Надеюсь я вам здесь не мешаю со своим джазом? :)",
				"added": 1557943331
			},
			{
				"comment_id": 7,
				"body": "> [4elovekkun](#comment_4_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7): А в ZeroNet есть какой-нибудь поисковик или что-то типа того?\n\nДа. Например: Zoogle, RVRE, Kaffiene.",
				"added": 1557944569
			},
			{
				"comment_id": 8,
				"body": "> [4elovekkun](#comment_5_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7): А как на них собственно попасть?\n\nВ первую очередь вам требуется пройти на сайт \"ZeroSites\". На этом сайте публикуются ссылки на местные сайты. Там вы всё увидите. И да, насколко мне известно, в Zeronet сайты принято называть как \"Зайты\", от английск. \"Zites\".",
				"added": 1557945143
			},
			{
				"comment_id": 9,
				"body": "> [4elovekkun](#comment_6_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7): Спасибо\n\nВсегда рад.",
				"added": 1557945216
			}
		]
	},
	"comment_vote": {}
}