{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 1,
				"body": "la vida es siempre doble filo, tienes cosas buenas y no tan buenas,\nen la vida un cuchillo tanto te puede salvar la vida como quitartela, todo depende de muchas cosas.\nIncluso no dudo que ya con esta idea algunos quieran crear una herramienta o filtro sobre aquello que quieran compartir o no compartir, este medio, esta técnica y este método todavía anda bien en pañales, toca esperar que tenga suficiente participación como para que se presenten nuevas posibilidades así como nuevos problema con nuevos planteamientos. Saludos cordiales, optimicemos y disfrutemos del medio.",
				"added": 1457214231
			}
		],
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 2,
				"body": "> [spanishbizarro](#comment_1_1iTmFPpNrC4SeTzZu9pnYudeXwEQhWLwo): Pero que raro\n\nque un \"bizarro\" diga que es raro... es todo un éxito demencial.   #losiento #loteniaquedecir",
				"added": 1457216707
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 3,
				"body": "\"¡¡Raito tiene la culpa!!  Si si, él fue quien me \"introdujo\" aquí...\"  muahahaahahahahahaaaaaa\nFuera bromas pues resulta un poco confuso, se lee mucho, se comenta en muchas redes sociales y nunca se sabe cual merece la pena probar, aunque claro al final siempre alguien te acaba explicando y así entendiendo mejor.",
				"added": 1457271740
			}
		],
		"4_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 4,
				"body": "A mi solo 88mb, y tengo mas tiempo en Zeronet... claro que tampoco me puse a navegar por cualquier sitio.",
				"added": 1457293845
			}
		],
		"1_1FWs5hAEDUok67DZtQYYauBXNXDV99MGJy": [
			{
				"comment_id": 5,
				"body": "Listo, añadido.",
				"added": 1457294291
			}
		],
		"4_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 6,
				"body": "Mi idea o necesidad es, ¿puedo bloquear a alguien?\nSupongamos que visito algo o alguien y se me carga su contenido, no me gusta o quiero contribuir en su red, ¿como lo hago? Como lo elimino de mi propia maquina.\nSaludos.",
				"added": 1457536413
			},
			{
				"comment_id": 8,
				"body": "> [cub3](#comment_6_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf): En tu página de inicio de ZeroNet busca la web que quieres eliminar en la lista de \"CONNECTED SITES:\", clicka en los tres puntos y delete. Por ahora no hay forma de bloquear, así que si vuelves a visitarla tendrás que eliminarla de nuevo.\n\nperfecto, que cosa mas simple se me pasó, y eso que estaba usando el \"favorite\" para ver si siempre quedaba por encima de los demás, gracias.",
				"added": 1457539772
			}
		],
		"1_1PQca3MXiRpHzemfZw7PWz4wfx1P71cpNC": [
			{
				"comment_id": 7,
				"body": "Si no me equivoco ya Raito lo ha compartido por aquí mismo,\nlo tengo en mis miles pendientes por probar.\nhttp://127.0.0.1:43110/17bpDUXTEvSjzp8zvG1RQA8jPuaVCsK52Q/?Post:12:ZeroNet+remoto\nCon la idea de dejar siempre una pc como \"server\", y así no preocuparse mas.\nSaludos.",
				"added": 1457536848
			}
		],
		"1_18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx": [
			{
				"comment_id": 9,
				"body": "Por ahora no carga.",
				"added": 1474507953
			}
		],
		"5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 10,
				"body": "¿El origen de la independencia cual es? Si no se sabe o no se entiende entonces puede tener un problema.",
				"added": 1507832822
			}
		]
	},
	"comment_vote": {
		"6_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": 1
	}
}