{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "Dove into the [\"Wendy's\" tag on Pixiv](https://www.pixiv.net/search.php?s_mode=s_tag_full&word=Wendy%27s). I do not regret my action.",
			"post_id": 2,
			"date_added": 1495158337
		},
		{
			"comment_id": 2,
			"body": "> [jmsebastian](#comment_1_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): I haven't really checked out Pixiv, generally, but probably will after finding out how much of the Wendy's stuff was on there.\n> Also, looks like you were able to make it to the site after all, which is great. Thanks for reading and thanks for the heads up about using a proxy to boost peers. I'll probably do that once I get zeronet running on another machine laying around.\n\nJust need to visit your zite through some random Zeronet Proxy. It'll download it and seed it for a while.",
			"post_id": 2,
			"date_added": 1495242232
		},
		{
			"comment_id": 3,
			"body": "The characters all having shoulder length black hair and wearing the same uniform makes it hard for me to tell them apart. Would've been nice if some shading was used on the hair to at least make them easier to distinguish.",
			"post_id": 3,
			"date_added": 1495385630
		},
		{
			"comment_id": 4,
			"body": "My problem is that I'm really bad at finding hentai I like. The premise could be good, and the art interesting, but all it takes is for one thing to turn me off and the product is basically ruined for me. Which makes it hard for me to spend my money on purchasing something that can't be returned, or isn't a service which I can always move onto a different product if one of them doesn't suit me. If Fakku was a Netflix for hentai, I'd be more likely to pay.",
			"post_id": 5,
			"date_added": 1496814595
		},
		{
			"comment_id": 5,
			"body": "> [jmsebastian](#comment_3_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): FAKKU actually does have a subscription service, though I'm not really sure exactly what their subscription content contains. At thirteen bucks a month, it isn't something I would subscribe to for more than a month or two, but for avid readers it's probably not a bad deal. I prefer physical copies of books and magazines, if possible, which is why I have bought what most interested me directly.\n> I do like the idea of a hentai focused Netflix, though. I would be a lot more likely to use that for OVAs and movies rather than manga.\n\nOuch, $13 is a bit high for the amount of hentai I read. And it seems like the selection is a bit limited.\n\nI've given up on physical mostly because I just don't have space to put things, and I'm anticipating having to move in the near future. So I mostly buy things that I know are DRM free or I can rip the DRM off of, since if I'm paying to own it I better *own* it, not license it. Subscription services I'm okay with not owning things since I'm basically paying a monthly admission to walk into somebody else' library and borrow whatever I want.",
			"post_id": 5,
			"date_added": 1496857646
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"2": 1
	}
}