{
	"title": "100 Evils",
	"description": "My Blog.",
	"links": "- [ghost](http://127.0.0.1:43110/1FFgggJuMx89wyV76iCPQnjPNmsZw126bs/)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1467545847,
	"post": [
		{
			"post_id": 2,
			"title": "百度百毒",
			"date_published": 1467545684.186,
			"body": "莆田医院（卖假药）谋财害命，制毒百度公司（吹喇叭）助纣为虐，贩毒普通百姓（世袭奴）水深火热，吸毒官府朝廷（收保费）封锁信息，做梦百度身后站着百毒，最大的恶是听凭百度为恶，揽功推过从来不认错。魏则西之死，板子应该打在谁身上？神秘的有关部门。专制体制是一切灾难的根源！医患矛盾激化、科技缺乏创新、金融海啸频发......根本原因还是在于市场监管混乱，医疗体制和网络监管都有原则性错误。一说监管，对于官员来说就是：收费、缴税、索贿。只要官员收够好处，企业就能畅行无阻。朝廷现在是啥也管，啥也管管不好。必须明确市场和市长的边界，凯撒的归凯撒，上帝的归上帝。把权力关在法制的笼子里，不能任由官员胡作非为。认真修法，严格执法。开放媒体管制，发挥舆论监督，阳光是打击一切黑暗罪恶的最有力武器。\n“魏则西之死”拷问整个中国社会西安电子科技大学计算机专业学生魏则西近日因身患滑膜肉瘤去世。在求医过程中，他通过百度搜索找到排名前列的武警北京总队第二医院（涉事科室被外包给“莆田系”医院），接受其“生物免疫疗法”的治疗，耗资20多万元却治疗未果，最终延误了其他治疗时机，病情迅速恶化，以致早逝。以当前医学发展水平，有些疾病是无法救治的，但却有人利用患者以及家属的心理弱点，抛出根本不可能的救命稻草来榨取他们的钱财，这是这个社会的病。\n莆田系与时俱进，从电线杆的“老军医”到报纸电视的狂轰滥炸，再到网络时代与搜索引擎的合作已持续了十几年，“百度2013年的广告总量是260亿元，莆田的民营医院在百度上就做了120亿元的广告。”莆田系医院具备行医的资格吗？如果具备，为何医疗事故如此频发民愤如此大？有关部门尸位素餐不作为、狼狈为奸乱作为，如何从立法上杜绝后患？国家应当成立专门机构，彻底清查莆田系医院的医疗效果、行医执照、药品质量、医疗事故，给社会一个信服的调查报告。\n百度之恶在于，它不惮于以最邪恶的方式，来助纣为虐，来实施对于极端弱者的欺骗与伐害。竞价排名，即是此种“最邪恶”。百度能毁掉一条生命，那它也有能力毁掉更多的人。这不是危言耸听。如果百度势将成为更大的信息平台，控制着人们的信息入口，继续以竞价排名或其它邪恶的方式，将人们导向一个充满欺骗与罪恶的世界。那么不难想象，这个世界还会好吗？\n这已不是百度第一次因类似事件遭到舆论“讨伐”。2016年1月，百度亦曾因出售“血友吧”一事被“炮轰”。百度就是靠着中国人的血暴力成长的，百度员工领的每一分钱，里面有一半都是受害者的医疗费。百度的恶，特别是在医疗行业推广的竞价排名，如同纳粹拔犹太人金牙一般挣钱，它唯利是图到让人感觉恐怖程度。百度要挣钱，中国人也要活命！百度必须为自己的虚假广告负责，对每个受害者进行10倍赔偿损失。\n互联网作为高科技企业，积累了海量用户数据，并基于这些数据研发功能性产品工具。而工具起到的作用是向善还是相反，关键看交给谁来用。是交给机器无差别的计算，还是加入了人欲的“算计”？是真心为公众服务，还是为心存不良的金主服务？ 竞价排名这种赢利方式，本质上就是把这一好工具交给了心存不良的逐利者。百度控制着普通人接触信息时代的入口，却把路标指向邪恶欺骗的世界。它让人们对互联网世界失去信任、对技术失去尊重、在使用这个时代最先进的知识/信息获取方式时感到恐惧。加剧了信息占有乃至智识上的不平等。这种对弱势群体对普通大众的经年累月的作恶，是最深的恶。\n\n\n\n为什么让百度一家独大？如果有谷歌Google这个竞争对手，百度便无法如此肆无忌惮，这反而有可能让百度，变得不是如此邪恶。谷歌（Google）的创始人于1999年提出了\"永不作恶\"的企业宗旨，并一直沿用。谷歌公司的口号全称是\"完美的搜索引擎，不作恶\"。中国以防火墙为代表的互联网管制破坏了市场竞争，滋生了垄断，严重妨害了信息的自由传播，包庇了许多见不得人的丑恶罪行，让以贪官奸商为主力的违法犯罪分子隐藏行踪，轻松逃脱法律制裁。同时也侵害了大众的知情权，助涨了犯罪分子的嚣张气焰。正是垄断助长了百度的恶，应该对百度发起垄断调查。过去发生的诸多事情已经证明，靠百度自律和自我纠错很难禁绝虚假信息的肆虐，应该考虑分拆百度或者对谷歌有限开放。只有充分竞争才能促进企业自省和自律。害人终害己，莆田系与百度合谋欺骗患者的商业模式注定不可持续，必须果断终止！"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}