{
	"message": [
		{
			"body": "因发表 “ 中共每年供养两千万党务人员，给社会带来耗损二十万亿元 ... \" 的言论，贵州大学经济学院杨绍政教授昨天被开除。贵州大学校长办公室发出《贵州大学关于给予杨绍政开除处分的决定》，称：“杨绍政经常在课堂上讲与课程无关内容，长期在网络上发表和传播政治性错误言论，编撰大量政治性有害文稿，在学校和社会上造成不良影响。",
			"date_added": 1534509095614
		},
		{
			"body": "【勁爆！P2P後台是上海國資委 金融難民聚斐訊總部討錢】8月14日，聯璧斐訊金融受害人聚集上海斐訊總部要求還錢，有平台代理一度激憤欲舉刀自殺，也有投資人慾跳樓自殺，警方准備氣墊以防悲劇發生。而斐訊總部三天兩頭有民眾前往維權，但他們遭到上海警方的打壓，甚至有的被刑拘。",
			"date_added": 1534509778603
		},
		{
			"body": "【五毛的报应很快就要来了】经济大崩溃，这些五毛是最先受到打击的一个群体。而且他们的承受力都是很差的，活该，这就是报应。这次大崩溃，50年都恢复不过来，这些五毛别再做中国梦了。",
			"date_added": 1534536033818
		},
		{
			"body": "一个大陆宣传系统的朋友说，p2p爆雷潮开始后，全国下发了一份网络维稳标准材料（话语术），总结起来不外乎相信政府，相信警察，不要信谣传谣，不要上访，别被境外敌对势力利用之类的。搞笑的是，很多五毛的家人亲戚朋友都被骗了，他们不相信这个，却不得不每天去发，很多人都快抑郁的成精神病了。",
			"date_added": 1534564815987
		},
		{
			"body": "【东莞泼墨抗议标语】东莞某公交站牌，某人印刷了含有五星红旗，习近平头像和抗争宣传的海报，然后向习近平头像和五星红旗处泼墨，待墨晾干后，清晨时分，张贴在东莞某公交站牌上。某马来西亚华人声称对此事件负责。拍摄于2018-8-18上午。",
			"date_added": 1534601882662
		},
		{
			"body": "【中国人根本连人都算不上】  每天10几个小时工作，有些甚至连休息天都没有，几亿人辛辛苦苦30几年，好不容易积累了4万亿外汇存储，就因为共产党要不忘初心，要在全世界颠覆民主制度，要向全世界输出腐败，要红色江山代代相传，永远作威作福，结果被美国制裁，被西方民主国家围剿，短短1年时间，就弄得经济面临崩溃。  眼看着自己的生活，自己的前途就将毁在一个狂妄之徒的手里，中国人对此完全无能为力，甚至不敢吭一声。更有甚者，对自己面临的危险，对自己家人面临的危险一无所知，或者对自己面临的危险，对自己家人面临的危险无动于衷，还整天到处举着一面沾满千百万无辜中国人鲜血的血旗，群魔起舞，还拥护共产党的专制，还为共产党对抗世界民主阵营摇旗呐喊。  中国人根本连人都算不上。",
			"date_added": 1534613549060
		},
		{
			"body": "菲律宾当地时间本周六中午11点40分左右，两名中国公民在菲律宾马尼拉大街上遭到不明身份的摩托车手枪杀。一名30岁受害者中枪后当场死亡，另一名35岁受害者在被送往医院后死亡。",
			"date_added": 1534652094339
		},
		{
			"body": "【中国人真的跟猪一样，智商实在太低】你问问你身边的人，有没有一个知道大难已经临头？有没有一个知道自己的财富很快就要灰飞烟灭了？有没有一个知道共产党要你“共克时艰”的含义？知道不知道是要你的财富来度难关？有的只是在发“中国梦”的傻逼，有的只是要干倒美帝的白痴。",
			"date_added": 1534689355042
		},
		{
			"body": "20180819 蘇州大抓捕案已近兩年仍有戈覺平、吳其和及徐文石3人遭羈押未判。VOA記者採訪孫⽂廣遭國保綁架紀實。促釋沈夢雨。案衛小兵被解除取保。",
			"date_added": 1534732859759
		},
		{
			"body": "袁世凯搞世袭 83 天毙命。死因是小便赌塞；让尿给憋死了。习近平这货就那点 \"梁家河\" 的业绩，福荫肯定大不了，大概应是大便赌塞，死于 \"肛闭\"。",
			"date_added": 1534733112234
		},
		{
			"body": "中共征收新一轮抚养费 每年数百亿被瓜分给官员发奖金",
			"date_added": 1534733414318
		},
		{
			"body": "毛泽东私人医生李志绥是第一位站出来指证毛荒淫无道的人，他的权威见证，引起广泛关注。而据毛泽东玩伴陈露文补充：中共高层除陈云身体衰弱，林彪抽海洛英外，个个都玩女人，朱叶邓都不例外。随着权力的增长，毛的性欲越发变态。",
			"date_added": 1534766271285
		},
		{
			"body": "叶利钦亲身见证前苏联权利腐化。当他去参观分配给他的别墅时，全家都被别墅奢侈豪华惊呆了！“就连我这个政治局候补委员，都配有三个厨师，三个服务员，一个清洁女工，还有一个花匠。”他感慨：“如果你爬到了党的权利金字塔顶端，则可享有一切，你就进入了共产主义，这才叫“共产主义”。",
			"date_added": 1534818196429
		},
		{
			"body": "【本来是共产党自己的事情,但全要全国纳税人去养活共产党】书记多了害死人： 据统计全国从总书记到乡镇、居委会，共有80多万个书记，国企、集体企业、私企正副书记约4890万个。各类全薪正副书记加一起，人数超5000万。按人均年薪5万计（还没算各种福利、补贴），年耗资超25000亿元。这大概就是每年财政支出中不敢公开的那部分。",
			"date_added": 1534839320990
		},
		{
			"body": "走投无路 广州伤残女工相约自杀身亡",
			"date_added": 1534839631178
		},
		{
			"body": "【美国版辛灏年Charlie Kirk答女学生问】问：社会主义有什么好的方面吗？有没有可能社会主义还是有点好的地方呢？ 答：没有。社会主义是拿枪指着你脑袋抢东西，是妒忌贪婪与社会弊端，是破坏基本人权、私有财产与自由之思想，当代马克思主义实施的100年内，有1亿人因此遭到杀害。",
			"date_added": 1534899470570
		},
		{
			"body": "【马来西亚总理在北京正式宣布退出「一带一路」项目】北京时政评论人章立凡向本台表示，「一带一路」项目是携带「特洛伊木马病毒」的项目，项目输出中国式腐败的同时，有可能让更目标国在巨额债务中受到中国越来越多箝制，随著一些国家已经开始警醒，该项目最终的命运会是巨大的「烂尾工程」。章立凡说：现在大家都认为「一带一路」这一类的属于「特洛伊木马」项目，随著这样的项目进入这些国家，中共对他们的经济，甚至政治的这种渗透和控制都会加强，这也是引起很多国家警惕的一个重要原因，「一带一路」会成烂尾工程。",
			"date_added": 1534900508650
		},
		{
			"body": "最新消息：绍兴年产100万吨生产已经十年之久的石矿，被发现有超高铀辐射，矿石在变成碎石和混凝土后，大量流入绍兴市内多个在建小区的工地！经调查发现，很多小区建筑辐射检测结果在0.25 - 0.35微西弗每小时，每天24小时，相当于每天做一次全身PET-CT检查，辐射值远超国际辐射“每年”接触限值：1豪西弗。",
			"date_added": 1534937345211
		},
		{
			"body": "【川普突敲打中南海 北京態度急轉 北戴河會議重中之重曝光】在中美經貿談判於本周重啟之前，美國總統川普在接受英國路透社采訪時，重提“貨幣匯率操縱”話題，批評中共試圖以此手段抵消美國關稅措施。外媒披露，平息中美貿易戰是今年北戴河會議的重中之重，尤其是如何把人民幣匯率作... ",
			"date_added": 1534999753385
		},
		{
			"body": "佳士工人声援团成员、中国人民大学学生严超（音）的父母亲，支持儿子的声援行动。他们也是工人。",
			"date_added": 1535000077838
		},
		{
			"body": "中國星巴克被發現用調制乳代替鮮牛奶",
			"date_added": 1535024391449
		},
		{
			"body": "華府警告︰若中國續進口伊朗石油 將面臨制裁",
			"date_added": 1535074655295
		},
		{
			"body": "【浙江淪陷 中國非洲豬瘟疫情往南蔓延】中國本月爆發非洲豬瘟疫情，中國農業農村部23日發布消息，表示浙江省溫州市樂清市17日接獲報告，某社區3個養殖戶的豬只不明死亡，後經檢驗，確診為非洲豬瘟疫情。這也是中國在這個月以來，發生的第4起非洲豬瘟案例。",
			"date_added": 1535078080195
		},
		{
			"body": "【美政要：川普在纠正中共这个“贸易坏角色”】越来越多的议员表示川普的对外贸易改革值得支持，他们表示，川普正在纠正长期以来美国受到的不公正待遇，人们需要给川普时间，让他完成对外贸易改革。",
			"date_added": 1535089520306
		},
		{
			"body": "日前，深圳市「蛇口改革開放」博物館的鄧小平「南巡」浮雕被撤換，北京畫展上紀念深圳建特區的「歷史畫作」中，主角也換成習仲勛。",
			"date_added": 1535090065590
		},
		{
			"body": "被防暴警察带走的声援团人员是谁目前不得而知。美国之音试图与佳士工运青年声援团有关人士联系，他（她）们的电话或者其他社交平台，均无应答，或者处于关机状态。",
			"date_added": 1535129928070
		},
		{
			"body": "非洲猪瘟在官方掩盖下，正在中国呈蔓延趋势。江苏、浙江温州乐清沦陷，又传出山东发现猪瘟疫情……自沈阳爆发非洲猪瘟，短短二十天，猪瘟疫情蔓延半个中国……当地卫生官员正全力扑杀猪只，但当地人担心，受感染的猪只很可能已售卖至全国各省。根据相关资料显示，目前这种非洲猪瘟疫情仅在俄罗斯部分地区存在。由于打贸易战，中国停止进口美国猪肉而进口俄国猪肉。翻查非洲猪瘟历史，传播路径也是从非洲，绕过西丶东欧，再经俄罗斯到中俄边境。中国的检疫监管部门为何没检验出猪瘟病毒？又是谁下令进口疫区猪肉的？",
			"date_added": 1535172090950
		},
		{
			"body": "【眾叛親離？俄羅斯考慮從嚴限制進口華為和中興設備】在美國、澳大利亞、印度等國宣布禁止進口或使用中國華為、中興電信設備之後，俄羅斯政府也緊隨其後，正在考慮從嚴進口華為和中興設備的建議。俄羅斯政府透過媒體對外放出消息稱，俄羅斯多家電子設備生產商和行業協會已經向政府提議，從嚴規定對華為和中興電信設備的進口。",
			"date_added": 1535218703866
		},
		{
			"body": "馬來西亞首相馬哈地（Mahathir Mohamad）近訪問中國期間，除拒絕中國一帶一路計畫之外，另要求中國遵循馬來西亞法律以維護馬國主權，要拆除他們在馬來西亞關丹城築起的「中國長城」。",
			"date_added": 1535220500195
		},
		{
			"body": "Sol Lo@Somkanel刚问我妈寿光淹了，青岛现在蔬菜是不是涨价了，老人家说菜市场没有绿叶菜了基本上，能找到的香菜现在是 60 块钱一斤，各大酒店已经把香菜从配货单上划掉了。",
			"date_added": 1535263121334
		},
		{
			"body": "猪瘟的源头在哪里？只要把下面4则新闻连起来看，就一目了然了。 1，中国从俄进口了24万吨政治猪肉，拿美国寻开心。2.进口俄猪肉不久，国内就爆发了猪瘟。3.最早发现疫情的是与俄接壤的东三省。4.俄去年底发生猪瘟疫情。自从贸易战以来中共就不停地搬起石头砸自己的脚，梁家河那一尊猪头更是误国误民。",
			"date_added": 1535263748042
		},
		{
			"body": "【日本政府決定拒絕華為和中興電信設備】對華為和ZTE的安全警惕，迅速向全球擴散。日媒報導，繼美國、澳大利亞、印度等國之後，因憂慮國家機密被泄露，日本政府也決定在政府層面上拒絕使用中國華為和ZTE的電信設備。",
			"date_added": 1535308931097
		},
		{
			"body": "馬來西亞警方周五（24日）正式起訴涉入國營 “一馬發展基金” （1MDB）洗錢丑聞的華裔富商劉特佐及其父親劉福平。法院已向兩人發出逮捕令。 ",
			"date_added": 1535334807763
		},
		{
			"body": "斯大林的女儿逃往美国，赫鲁晓夫的儿子逃往美国，邓小平的儿子邓质芳移民美国，江泽民的孙子江志诚移民美国，胡锦涛的女儿胡海移民美国，温家宝的女儿温如春移民美国，李照星的全家移民美国，金正恩的哥哥的儿子金韩松移民美国，查韦斯的母亲移民美国后又被遣返回国，，它们咋不移民朝鲜俄罗斯伊朗？",
			"date_added": 1535369236470
		},
		{
			"body": "【集中营里的中国梦】联合国消除种族歧视委员会最近开会，会员相继批评新疆广设维吾尔族洗脑集中营，在囚者估计达一百万，被迫背弃回教教义，天天上政治课，唱中共国歌，礼敬五星旗，吃饭前还要喊“感谢党，感谢祖国，感谢习主席”。据说，今年六月，和田集中营就有二十六人瘐死。",
			"date_added": 1535418344870
		},
		{
			"body": "【布莱尔上将：台湾应在辽宁号绕行时做模拟攻击】中国航母辽宁号不久前在台湾周边海域绕岛巡航，引起台湾和周边地区的关注。前美军太平洋司令布莱尔说，这是中国利用和平时期对台湾的恫吓，台湾应该利用机会对辽宁号进行模拟攻击，借此提升自己的战备能力。",
			"date_added": 1535460086175
		},
		{
			"body": "【美前國防官員批中國：自創「世界金錢萬能宣言」】包士可（ Joseph Bosco） 今天在國會山莊（The Hill）發表的文章指出，富起來之後的中國不但沒有遵守世界人權宣言等國際規範，反而以「世界金錢萬能宣言」來替代。",
			"date_added": 1535514208364
		},
		{
			"body": "中國台商怕了！美中貿易戰升溫 科技大廠返台擴廠",
			"date_added": 1535514602647
		},
		{
			"body": "【重磅！網傳大陸公安爆料：大情報意味着什麼？】身為體制內十幾年的公安系統人員，我曾經一直認為大數據、大情報系統可以幫助我們一線人員更方便的破案（兩搶一盜、暴力犯罪、團伙作案等），直到這幾年發現大情報系統成為了黨對小部分族裔的迫害工具（新疆、西藏、少數民族）",
			"date_added": 1535561622568
		},
		{
			"body": "中官媒稱豬瘟可放心吃豬肉 外媒酸：這還不是最離譜的",
			"date_added": 1535562072407
		},
		{
			"body": "一桩看似普通的走私案，却牵涉出天朝作为万税大国的核心鸡密！ 价值2.7亿的大米竟然含有1.23亿的税款，税率达到惊人可怕的45.5%！共产主义每一个毛细血孔都带着冷血与贪婪，共全民财产，供一党挥霍。高赋税，低福利，高压迫，低人权，所刮的钱财不是去海外开了离岸公司，就是用作对外的金元撒币外交 。",
			"date_added": 1535602304132
		},
		{
			"body": "【日媒：外國公司應放棄對中共的幻想】台灣連鎖餐飲店85度C最近在大陸受到中共當局的刁難，只因為中華民國總統蔡英文先前光顧了該公司位於美國洛杉磯的分店。對此，日本媒體刊文說，這只是中共脅迫外國公司接受其意識形態的冰山一角，欲在大陸投資的外國公司應放棄對中共的幻想。",
			"date_added": 1535602725795
		},
		{
			"body": "【前所未見！美將派海軍陸戰隊駐守美在台協會】香港英文報「南華早報」今天報導，美國政府比照派駐於世界各地美國官方機構的配置，將對美國在台協會（AIT）派出由陸戰隊員組成的護衛小組，此舉表明美國對台關系穩固。",
			"date_added": 1535634391337
		},
		{
			"body": "【安徽省芜湖市南陵县发生非洲猪瘟疫情】8月30日被确诊。该场共存栏生猪459头，发病185头，死亡80头。当地已扑杀379头发病猪和同群猪，全部病死和扑杀猪均已无害化处理。禁止所有生猪及易感动物和产品运入或流出封锁区。目前，该起疫情已得到有效处置。——这已经是国内发现的第五起非洲猪瘟了，如果有效，应该不至于蔓延的这么广才对。",
			"date_added": 1535690778514
		},
		{
			"body": "天安社党委书记兼师爷四哥发表重要声明……后台最大的靠山就是中国共产党",
			"date_added": 1535691191786
		},
		{
			"body": "不会是上帝借习猪头之手灭了中国人这个劣种吧？不然怎么会人为地弄出这么大的疫情。",
			"date_added": 1535731243126
		},
		{
			"body": "【紧急呼吁，关注、帮助被黑恶势力围困在昆明火车站的声援团成员!!!】今晚，声援团成员人民大学哲学院16级本科生杨舒涵，在离家返校乘火车的过程中，被近十个自称当地街道办却拿不出工作证的黑恶势力阻碍拦截，手机被抢夺、遭到人身威胁，目前仍被围困在火车站！！！",
			"date_added": 1535753555207
		},
		{
			"body": "【網曝哈市居民感染羊炭疽 美農業部長質疑中共隱瞞疫情】中國大陸持續爆出各類家畜疫情，另大陸民眾倍感恐慌的同時，外界質疑，中共當局又在隱瞞動物疫情。大陸各類家畜疫情持續擴散 據中共農業農村部官網8月30日通報，29日，安徽省蕪湖市南陵縣爆發非洲... ",
			"date_added": 1535789167155
		},
		{
			"body": "周五，美国国务院发布公告，宣布将停止对联合国，近东巴勒斯坦难民救济工作署的资金支持。公告表示，该机构的运作，存在根本缺陷，需要寻找新方法帮助巴勒斯坦难民。美国是联合国巴勒斯坦难民救济工作署最大的资助国，去年承担超过3.5亿美元的支出。",
			"date_added": 1535873897023
		},
		{
			"body": "【湖南耒陽抗議增學費示威 當局暴力鎮壓46人被拘】湖南耒陽警方9月2日在網上發布聲明說，周六到周日夜間大約600人在警察局前面集會，並向警方投擲瓶子和磚頭，有多輛汽車被焚燒。有46人被捕。 從推特上可以看到在耒陽政府大樓外，一些人拉標語，上寫“我們要讀公... ",
			"date_added": 1535909594993
		},
		{
			"body": "川普不出席APEC與東協峰會 外媒：不想看到習近平",
			"date_added": 1535947938843
		},
		{
			"body": "【这输出的是假新闻还是假银行？】厉害了。近日非洲最大的新闻是一家中国银行Maxtor（迈拓）银行与索马里一家公司投资部签订了10亿美元的投资合同，轰动索马里。好事的索马里媒体到中国人民银行打听，原来这家中国银行根本不存在。",
			"date_added": 1535948197189
		},
		{
			"body": "【劉強東若罪成最高判監30年 美國警方披露部分細節】京東集團主席兼行政總裁劉強東，當地時間上周五（8月31日）在美國明尼蘇達州進行商務活動期間，涉性侵被警方扣查，於上周六（9日1日）獲釋。有媒體稱這幾天是美國的勞動節小長假，警方和檢方都處於放假狀態，就先釋放... ",
			"date_added": 1535977854170
		},
		{
			"body": "【拍桌子】   1965年罗瑞卿走进会场。彭真一拍桌子：罗瑞卿，不要再换幻想了，交待问题吧，于是罗瑞卿被打倒。半年后，彭真走进会场，刘少奇一拍桌子，吼道：彭真，你要彻底丢掉幻想，交待问题。于是彭真被打倒。复半年，刘少奇走进会场，周恩来一拍桌子，吼道：刘少奇，不要再抱幻想了，老实交待问题吧！",
			"date_added": 1535993485430
		},
		{
			"body": "台湾官方三日傍晚宣布，台湾在七月间丧失主办「东亚青年运动会」的机会，但政治不应介入运动赛事，因此台湾将自创国际运动会品牌，在明年举办第一届「亚太青年运动会」，广邀亚洲和太平洋国家参加，规模将比东亚青运更大，参与的国家更多。",
			"date_added": 1536037412593
		},
		{
			"body": "中共的贼船容不下良知与公平！坦承公益与良知的民警邵曳戎先生早在2011年7.23火车颠覆事故中、因抗命救出女童而被处分、声誉远扬！而今天于海明被释放了。放出于海明正当防卫视频的警察，却因为铁证如山，舆情沸腾，而被开除除名了。这不是提倡公平正义！而是助长野蛮犯罪！必须推翻！‬",
			"date_added": 1536059580421
		},
		{
			"body": "湖南省5月动用了应急资金，才使负债累累的耒阳市有钱支付公务员薪水。因中国地方政府债台高筑已是普遍存在的问题，因此类似事件被认为可能会在更多地方出现。",
			"date_added": 1536083460377
		},
		{
			"body": "在星期二的太平洋岛国论坛的闭门会议上，中国代表团与论坛主席、瑙鲁总统巴伦·瓦卡发生争执后中途退场。法新社报道说，中国代表团坚持要讨论气候变化问题被巴伦·瓦卡总统打断，因此离场。",
			"date_added": 1536120193150
		},
		{
			"body": "【瑙鲁总统批评中国代表团的行为“霸凌”】瑙鲁总统巴伦·瓦卡9月4日星期二批评中国代表团的行为并使用了“霸凌”一词。在星期二的太平洋岛国论坛的闭门会议上，中国代表团与论坛主席、瑙鲁总统巴伦·瓦卡发生争执后中途退场。法新社报道说，中国代表团坚持要讨论气候变化问题被巴伦·瓦卡总统打断，因此离场。美联社报道说，瑙鲁总统巴伦·瓦卡指责一位中国官员在轮到其他国家领导人的时候坚持发言：“他非常坚持，而且很无礼，耽搁了领导人会议数分钟，而他只是个官员。”巴伦·瓦卡还说：“也许因为他来自一个大国就想要霸凌我们。”在论坛开始前，中国代表团迟迟未获得与台湾有外交关系的瑙鲁颁发签证，直到论坛马上即将开始问题才得到解决。",
			"date_added": 1536120615352
		},
		{
			"body": "【烧别人棺材的省长自己被烧死在“棺材”里】大纪元消息：中共前江西省副省长、公安厅长，现任中共江西人大常委会副主任郑为文日前发生严重车祸死亡。但大陆媒体的相关报导目前全已部被删除了。《经济观察报》9月5日报导，数位知情者证实了上述消息。知情者介绍，这起车祸发生于9月3日上午，郑为文乘坐的一辆小车，在江西南昌西环外高速公路上与一辆大货车相撞，并引发大火。网上流传的车祸现场视频（未获官方确认）显示，车祸发生的瞬间，相撞的两辆车起火燃烧，烈焰熊熊，黑烟冲天，据说郑为文被活活烧死在车内。——江西网友说：这个省长下令把农民棺材挖出来，当场焚烧，烧棺材的省长，昨天因为车祸烧死在轿车里面，铁棺材？！这就是报应，作恶多端，阎王爷也不放过他。",
			"date_added": 1536207172420
		},
		{
			"body": "河南自今年2月开始查封家庭教会，而这一针对基督教的打压行为近期越演愈烈：拆十字架、烧圣经、冲击教会……河南全省的基督教会，无论是官方三自教会还是家庭教会都面临着同样的困境。",
			"date_added": 1536207704019
		},
		{
			"body": "【600億 大多進了他們自己的口袋】之所以能在國際上如此瀟灑地大手筆揮霍，表現地像個大財主，完全仰仗於咱自身制度的優越性。共產主義實行公有制，舉國財富盡數收歸集體，然後掌管這個“集體”的人，就富得流油。",
			"date_added": 1536292263983
		},
		{
			"body": "【当局秘密审判甄江华】《新公民》：甄江华涉嫌“煽动颠覆国家政权罪”一案已于8月10日在珠海市中级法院开庭审理。 甄案两位辩护人任全牛律师及闻宇律师均未收到任何官方的开庭通知。珠海当局一直不准上述两名律师会见。甄江华并不乐意见到”官派律师”。 令人意外的是连甄江华家属都未获开庭审理的通知。",
			"date_added": 1536292619452
		},
		{
			"body": "【印度与美国宣布将举行联合军演】美国和印度首次外交与国防2+2对话周四在新德里举行，双方会后发表联合声明指出，印度和美国签署了具历史意义的通讯相容与安全协定（COMCASA）。两国将于明年举行海陆空联合军演。  ",
			"date_added": 1536310113891
		},
		{
			"body": "爆炸性新闻，20分钟前消息，川普在前往北卡罗来纳州的空军一号上表示，另外的2670亿关税已经上膛了。",
			"date_added": 1536371696236
		},
		{
			"body": "31岁上吊自杀的女子王倩 ，生前p2p受骗维权受辱视频。她曾经爱党爱国，现在受骗后成了中共的维稳对象，她承受不了网络上天天都是正能量和现实对她如此残暴的差距，自杀了！遗书中希望她的孩子能够尽可能的移民出去。",
			"date_added": 1536384264364
		},
		{
			"body": "日本最新的直升飞机护卫舰加贺号， 加入了美国海军里根号航母战斗群，在中国南海演练。前两天英国登陆舰也巡航南海，这在英国是非常罕见的。 ​​​​加贺号虽然号称护卫舰，其实是一艘准航母。现在美国，英国，澳洲，印度，日本组建成强大的准军事联盟在对抗中共扩张。",
			"date_added": 1536418824071
		},
		{
			"body": "【英國泰晤士報社論吁西方聯合抵制中共霸凌台灣】近年來中共不斷在國際上打壓台灣，還挖走台灣邦交國。昨天英國媒體《泰晤士報》（The Times）就刊出一篇社論，呼籲西方必須聯合抵制中共霸凌台灣，而不是該讓美國單獨捍衛。",
			"date_added": 1536426866931
		},
		{
			"body": "苏联援助外交的巨额损失和教训。截止到1989年，苏联共向12个社会主义国家和49个第三世界国家提供了约1490亿美元。苏联援助的都是最穷国，根本没有偿还债务的能力，最后基本“打了水漂”，而这些钱都是苏联极力压低国内劳动人民，降低人民生活水平挤出来的“真金白银”，不能不说是苏联人民悲剧。",
			"date_added": 1536469252981
		},
		{
			"body": "【恐怖！中國教師開BMW沖撞小學生 多人壓車底哀嚎】中國河南省5日發生1起誇張車禍事件，濮陽市1名小學老師駕駛BMW汽車，眼見前方大批排隊等候入校的小學生，竟踩油門向前沖撞，將多名小學生壓至車底，引發現場驚聲尖叫，且該名教師下車察看時竟也未將車熄火。",
			"date_added": 1536515254391
		},
		{
			"body": "【贸易战寒意彻骨谁先知?】转述: 福建 某街道，让职工以上员工，把前几年号称多发的钱退回来，职工退十几万，公务员退二十几万，领导干部退几十万，都要退，退休的也不行，辞职也不行。农商行还专门针对他们开发了一个信用贷，帮忙解决没有钱退的问题。",
			"date_added": 1536546260399
		},
		{
			"body": "安徽豬瘟泛濫 沒翻牆民眾不知情 豬肉仍流通: 近期，非洲豬瘟在安徽省三地肆虐，民眾對此卻多不知情。瘟疫事發當地有民眾表示，一個半月過後，豬肉會再次上市，目前仍有剩餘豬肉在市場上銷售。 ",
			"date_added": 1536585209975
		},
		{
			"body": "【党媒：榨菜二锅头拉动消费，学者：我没接受采访】一桩新闻公案引起关注。新华社说：在当下中国社会，榨菜二锅头热销不是消费降级而是升级，该社的报道还援引浙江学者冯钢的话说，这是“是消费理念的提升”，不过，设在香港的凤凰卫视说，浙江大学教授冯钢证实自己并没有接受新华社的采访。",
			"date_added": 1536598012573
		},
		{
			"body": "【中美大戰要升級 美國威脅制裁中共高官 川普警告北京】中美貿易戰不斷升級，近日美國對中共再釋放強硬信號。外媒指，美國正考慮向中共侵犯人權的高級官員及企業實施制裁行動。",
			"date_added": 1536637759007
		},
		{
			"body": "‪视频对白：“你为什么砍死他了！”‬刀手坐在旁边：“他扣我工资！”‬ ‪惠州TCL王牌一个主管克扣员工工资，刚下班就被砍死在大门口。‬ ‪很多人的压力已经到了极限，往往为了一点不平事，心中的怒火就会爆发，做出无法挽回的事来，这就是高压之下的社会戾气，所以在当今社会，每个人都不要去做损害别人利益的事。",
			"date_added": 1536683452466
		},
		{
			"body": "共匪铲党拆教堂，开封通许小鬼忙。天怒人怨现世报，立马砸死嗷嗷叫。",
			"date_added": 1536683947541
		},
		{
			"body": "路透社周二消息，美国白宫发言人萨拉-桑德斯本周一宣布，美国总统特朗普收到了来自朝鲜最高领导人金正恩的一封信，信中建议举行双方第二次峰会。",
			"date_added": 1536690370533
		},
		{
			"body": "【紧急关注✊】福州维权公民张华来电：9月12日上午9:30左右，福州维权公民林应强、张华、陈气、唐兆星、何宗旺、林兰英、陈茂妹、谢小珍等三十多人，前往福州第一看守所迎接“小709案之福州大抓捕”严兴声先生光荣出狱。因在看守所门口放了鞭炮，30多人被警察团团围住，并叫来警车将30多人全部带走。",
			"date_added": 1536759447909
		},
		{
			"body": "天下苦共久矣",
			"date_added": 1536773918447
		},
		{
			"body": "中國湖南省衡陽市的衡東縣，12日晚間發生重大的街頭無差別攻擊事件。當地晚間在衡東縣洣江公園廣場，大批練習「廣場舞」的民眾，突然遭到一輛高速行駛的休旅車衝撞輾壓，之後駕駛還下車砍殺行人，當場造成9人死亡、46人輕重傷。中國各大官媒表示，衡陽警方目前已逮捕犯案的一名54歲漢族男性，具體的犯案動機與兇嫌背景則不明朗，但全案已定調為「反社會報復事件」而非「恐怖攻擊」。",
			"date_added": 1536829478465
		},
		{
			"body": "川普對報導說法並不滿意，他在推特上表示，《華爾街日報》是錯的，美國沒有和中國簽訂協議的壓力，但中國相反，有必須和美國簽約的壓力。川普說，美國的市場蓬勃發展，中國則在崩潰。",
			"date_added": 1536893104208
		},
		{
			"body": "吴小平这个二货，大吼一声，把猪都吓醒了到处乱跑……没法按节奏杀猪了！——人民日报",
			"date_added": 1536912009367
		},
		{
			"body": "【马云为众多“红色爸爸”代孕】阿里巴巴背后的“阿里爸爸”是先后在中央政治局常委任职的20多人的子孙。博裕资本江志成是江泽民的孙子，国开金融贺锦雷是前政治局常委贺国强的儿子，中信资本刘乐飞是当朝常委刘云山的儿子，中信资本曾之杰是前副总理曾炎培的儿子，中信21世纪王军是王震之子…真正的拼爹啊！",
			"date_added": 1536999640827
		},
		{
			"body": "聯合國一份報告將中國等 38 個國家列為「可恥」（shameful）的國家。恰如其分。下為港媒與路透社新聞：聯合國發表的一份年度報告，將中國、俄羅斯在內的38個國家列為「可恥」（shameful）的國家，指有關國家以殺戮，酷刑和逮捕形式對待維權人士，並經常以破壞國家安全和與外國實體合作為名起訴維權人士。中國外交部發言人耿爽昨日在例行記者會批評報告內容嚴重失實。",
			"date_added": 1537013433842
		},
		{
			"body": "【人民日报海外版头条：中国对困境中的委内瑞拉不能视而不见】像委内瑞拉这样和中共三观一致践行社会主义的国家在世界上已经屈指可数了。一个曾经富得流油的南美首富，没几年就摸着石头来到了破产的边缘。贸易战使中共泥菩萨过河自身难保。人民日报公开扬言援助委内瑞拉势必在民众中引发巨大反对声浪。",
			"date_added": 1537031177787
		},
		{
			"body": "【中共恐嚇新西蘭教授 國際刑警介入調查】據新西蘭最大主流媒體披露，自今年2月坎特伯雷大學教授、著名中國問題專家布萊迪教授的住宅及辦公室連續失竊後，新西蘭警方、新西蘭情報局（NZSIS）及國際刑警組織（Interpol）一直在進行調查。",
			"date_added": 1537068503452
		},
		{
			"body": "【中共地方政府債務違約 公務員工資被扣買債】大陸地方債高企一直是業界關注的焦點，近來有消息顯示，大陸地方債已經開始違約，有的地方公務員的工資被強制扣除一定的百分比買地方當局的債務。 今年5月份，湖南耒陽市未按時發放公務員工資引發外界嘩然。",
			"date_added": 1537069033725
		},
		{
			"body": "台风来临，一张写着“不忘初心，牢记使命，为中国人民谋幸福，为中华民族谋幸福”的共产党广告牌被大风吹倒了，竟把人砸死了😱！这是不是天大的讽刺？",
			"date_added": 1537080823857
		},
		{
			"body": "許多女孩子以與毛有這種特殊關係為榮，這些女孩子大多是貧農出身，或是從小由政府養大，思想上非常崇拜毛，毛的臨幸自然會讓她們感覺到莫大的恩寵。但是也有一些女孩子拒絕毛的要求，通常她們是年紀較大，教育水平較高的女青年。有些護士認為與病人發生親密關係，有違職業道德。大部分的女孩都知道這特殊關係只是暫時的，她們開始服侍毛時都極為年輕，而且未婚，等毛厭倦了……",
			"date_added": 1537107923167
		},
		{
			"body": "特朗普坚推2000亿关税但留情减至10% 未知北京赴鸿门宴否",
			"date_added": 1537108121078
		},
		{
			"body": "三个中国人在瑞典无理取闹被驱离，众多中国媒体和爱国贼进行了声嘶力竭的谴责。但是，北京在零下八度驱赶外地农民工，大人小孩夜宿街头时，这些人却完全缄口不言，屁都不敢放一个。这使我明白了一个道理：那些善于在无需勇气时义愤填膺，在需要勇气时却噤若寒蝉的人，不但是懦弱的，而且是虚伪的。",
			"date_added": 1537157859308
		},
		{
			"body": "【秀给大陆北韩看 日神盾舰拦截弹道飞弹成功】据美国商业内幕网（Business Insider）报导，面对邻居北韩与大陆的威胁，日本长久以来不断地强化自身的防卫系统，其中包含能拦截弹道飞弹的武器。昨日晚间，日本海上自卫队（JMSDF）的爱宕级护卫舰（Atago-class destroyer），成功以升级版舰载神盾防空系统（Aegis anti-missile system），发射SM-3 Block IB升级版飞弹，成功将美军从夏威夷发射、跨越太平洋上空的弹道飞弹拦截。美军飞弹防御署（Missile Defense Agency）指挥官格里弗中将（Lt. Gen. Sam Greaves）表示，「这次的测试、已证明日本有足够的能力，可以保护本国的领空不受侵犯。",
			"date_added": 1537176085180
		},
		{
			"body": "【新唐人亞太台 2018 年 09 月 17 日訊】再來關心，歐洲議會12日決議通過歐中關係決議，要求歐盟以人權、法治作為與中國關係的核心。決議中大篇幅譴責中共迫害人權，並要求，歐中人權對話，應該開放中國民間的獨立聲音 參與討論。而且延續2015年的關係決議，再次提及2013年譴責中共強摘法輪功器官的決議。",
			"date_added": 1537197102654
		},
		{
			"body": "【美媒：華爾街對華府影響力大減 中共恐找錯說客】中美貿易戰持續升溫，搶在下輪的貿易協商前，美國華爾街數名金融業高管赴中國與國家副主席王岐山會晤，中共應是希望透過華爾街的政治影響力來讓川普改變主意，但《紐約時報》昨日撰文表示，中共的如意算盤恐怕要落空。",
			"date_added": 1537203897900
		},
		{
			"body": "瑞典丢人事件，王毅竟发推要求瑞士人（Swiss)向中国游客赔偿和道歉！",
			"date_added": 1537222123498
		},
		{
			"body": "【貿易戰第二輪敏感時刻 川普政府對中共兩大黨媒動手了！】美媒據知情人士透露，美國司法部對中共加強立場，下令中共兩大黨媒在美國的分支，注冊為外國代理人，加強對這兩大黨媒的管控。中共黨媒在海外迅速擴張，明目張膽開展宣傳活動，令美國擔憂影響美國輿論。",
			"date_added": 1537362473808
		},
		{
			"body": "【中共将以黑治国模式推向全球】新西兰大学教授Brady因揭中共渗透新国而受到异乎寻常威胁，中共官员让她闭嘴，并向政府和大学施压，她还收到恐吓信，办公室被砸，家中被盗，电脑电话被窃走。警方启动特别调查，国际刑警组织也已介入。经7个月调查，该案获重大进展，一旦坐实，北京又要出丑了。",
			"date_added": 1537362848871
		},
		{
			"body": "中美貿易戰 中共大事不妙 李克強急了！中美新一輪關稅戰開打。19日中共總理李克強再次要求“穩住投資”，凸顯中國經濟困境。日本在華企業已有6成撤出中國大陸，4成在計劃中，不少台企也在迴流台灣中。明年中國新年前珠三角逾萬家港商倒閉。",
			"date_added": 1537416662999
		},
		{
			"body": "上海西郊五号餐厅天价饭局一顿饭吃掉41万，8个人一顿吃掉杨改兰一家20年口粮。华润前老总宋林，曾一顿饭吃掉150万！究竟这八位宾客是谁？目前引发了全网的大讨论。而是否有公职人员在场，是否违反国家相关规定也成为了大家猜想关注的热点",
			"date_added": 1537417352059
		},
		{
			"body": "南蒙古人权信息中心执行主任恩赫巴图说，他们到这里来抗议中国政府在南蒙古、西藏和维吾尔实行的民族政策，他们“剥夺了蒙古人、维吾尔人、藏人的最基本人权和自由。”",
			"date_added": 1537417723955
		},
		{
			"body": "9 月 19 至 20 日，在中國天津舉行的第十二屆夏季達沃斯論壇，讓外界嗅到了中美貿易戰的硝煙。中共國務院總理李克強在論壇上發表主旨講話後，有兩名美國議員公開質疑中共在保護知識產權和平等對待外國公司上〝光說不做〞。",
			"date_added": 1537430794133
		},
		{
			"body": "【中南海擴建拆遷 百姓怎麼說？】當地王女士對記者說：“府右街樓都蓋起來了，給中央領導人蓋的小別墅，一棟一棟的裡面漂亮這呢。外面都是大圍牆，一大片二、三層樓裡面都帶電梯的，青色磚大圍牆。我姑娘說，這皇帝真會找地方，這地方真好，真舒坦。” ",
			"date_added": 1537506704952
		},
		{
			"body": "【这才是刚刚开始，对盗国贼个人的制裁正在启动】特大喜讯，美国对中共中央军委装备发展部及其部长李尚福施加金融制裁，  冻结了他们在美国司法管辖区的资产、阻止外汇交易，限制他们透过美国金融体系进入全球金融市场。",
			"date_added": 1537522927722
		},
		{
			"body": "【西方專家談中共活摘罪行 引澳洲人思考討論】 “中國，地球上人口最多的國家，已成為一個器官移植產業快速發展的國家。在過去十餘年間，大量良心犯被按需殺害。”這是9月19日晚，來自加拿大與澳洲的律師、學者們舉行的一場座談會上播放的短片的內容，也是當晚研討的... ",
			"date_added": 1537580166311
		},
		{
			"body": "巴鐵翻臉！罕見敦促中共善待新疆穆斯林",
			"date_added": 1537608423871
		},
		{
			"body": "【温州瑞安隆山小学生戳瞎女孩眼被其家长报复杀害】新京报消息：21日，浙江温州瑞安市一四年级小学生浑身是血倒在隆山小学厕所内，旁边一男子坐在台阶上淡定抽烟。其实已经死了，瑞安市公安局通报称，受伤学生正在医院救治中，嫌犯林某现已被警方控制。死者叶某(男，10岁)系该校学生，据网友称该男孩将一女孩眼睛弄瞎，招到女孩父亲强烈复仇杀害。",
			"date_added": 1537608705902
		},
		{
			"body": "據維權網站民生觀察及網上消息，在近年率先強拆教堂十字架、打壓教會的浙江省的重災區溫州，當局展開了一場“滅教運動”，強制要求民眾承諾與基督教切割。",
			"date_added": 1537669937665
		},
		{
			"body": "常识扫盲：金砖五国，中国、俄罗斯、巴西、印度、南非。首先金砖五国都是大国；第二金砖五国都是发展中的大国；第三金砖五国都是具有世界影响力的大国。金砖五国中：1、中国是唯一没有实行免费医疗的国家；2、中国是唯一没有实现免费教育的国家；3、中国是唯一没有实现免费养老的国家。",
			"date_added": 1537682423547
		},
		{
			"body": "世界各国领袖下周将齐聚联合国大会， 美国总统特朗普26日还将首度轮值，代表美国出任安理会主席，讨论防止大规模毁灭性武器扩散等议题，预料重点将摆在伊朗问题上。中国国家主席习近平和俄罗斯总统普京将缺席此次联大。",
			"date_added": 1537724881979
		},
		{
			"body": "抗議者：中共等於希特勒！不滿被中共掐住經濟咽喉 贊比亞民怨高漲。",
			"date_added": 1537755780271
		},
		{
			"body": "【瑞典有多可怕 中国驻瑞使馆2月内5发旅游安全提醒】中国与瑞典最近因曾姓一家人在瑞典旅馆哭闹一事争议不断，且有升级之势。中国驻瑞典大使馆周六（9月22号）向瑞典的一个媒体以“辱华”为由提出抗议后，周日再次通过官网提醒在瑞典中国公民注意安全。报道统计，这是中国使馆在2个多月间第5次对瑞典发布旅游安全提醒。",
			"date_added": 1537756126428
		},
		{
			"body": "【国际特赦要求中共停止系统性迫害新疆维吾尔人】人权组织国际特赦要求中国当局停止“系统性迫害”行动，公布据信近百万被“强制关押”的新疆维吾尔人的下落。国际特赦星期天晚发布一份报告，包括对海外100多位维吾尔人的采访，讲述他们的亲属据报遭到酷刑、拘禁或被关进“教育转化中心”。",
			"date_added": 1537810407518
		},
		{
			"body": "【瑞典再和中共杠上 停止遣返新疆維吾爾人】中共和瑞典近日因陸客大鬧飯店、瑞典電視節目製作辱中節目等而關系緊張。瑞典政府昨日宣布，由於中共在新疆關押大批維吾爾人進行洗腦再教育，瑞典決定暫停把不符合政治難民資格的維吾爾人遣返回中國。",
			"date_added": 1537844076339
		},
		{
			"body": "白宮前首席策略師班農（Steve Bannon）日前在接受獨家專訪時說，美國總統川普（特朗普）採取的中美貿易戰巨大規模在美國歷史上“沒有前例”，會讓北京“痛到難以承受”，而且川普“不會退縮”。",
			"date_added": 1537844352484
		},
		{
			"body": "中南海在重重壓力下，已經把鐮刀揮向了超級富豪。這次從2017年展開的圍獵行動，已經造成各路富豪紛紛被調查、死亡、入獄和引退。",
			"date_added": 1537859141358
		},
		{
			"body": "傻逼脑残以为别人要他接受，笑死人了。脑残还能接受什么正常的东西？",
			"date_added": 1537859213786
		},
		{
			"body": "一个新时代已经开始了，世界各国的选举，凡是亲华亲共的政治客大都落选，凡是能够抓住中国议题，对中国渗透进行反击的政治人物大都能够胜出。这是人心所向，历史趋势。‬",
			"date_added": 1537887741008
		},
		{
			"body": "川普给了美国供应链三个月的时间移出中国，并对输往中国的国际供应链列出禁运清单，这是我说的第一张表的延伸。目前用于监控百姓的天网工程的核心部件己被荷兰禁运，防火墙所用芯片和脸部识别图文处理芯片应该也很快被禁。C919和高铁用大型集成软件也是选项。贸易与价值观的结合是国际贸易发展新动向。",
			"date_added": 1537929999266
		},
		{
			"body": "【川普联大演讲：社会主义带来灾难，不能容忍中共的方式。所有国家都应抵制】实质上，不管什么地方尝试了社会主义或共产主义，都导致了苦难、腐败和衰变。川普还说，社会主义对权利的渴望导致了扩张、入侵和压迫。世界上所有国家都应该抵制社会主义及其给每个人带来的苦难。",
			"date_added": 1537939443893
		},
		{
			"body": "司局級朱軍信心滿滿 將受害女告倒 北京市公安局親自出馬 劉強東羨慕中: 指控中共央視主持人朱軍猥褻的當事女生〝弦子〞公開了自己的正面照。中共高官、央視主持人朱軍涉性騷擾女實習生事件日前出現新情況，受害人首次在微博上曬出正面照，並在網路上披露了遭朱軍起訴的消息。",
			"date_added": 1537961913161
		},
		{
			"body": "【美國轟炸機再次飛越南中國海】美國官員周三透露，美國本周派轟炸機飛越了南中國海上空，此舉可能進一步加劇北京與華盛頓之間的緊張關系。這是美國本月第二次派轟炸機飛越南中國海。",
			"date_added": 1538023777244
		},
		{
			"body": "上半年还构建人类命运共同体呢， 下半年就灰头土脸要自力更生了 这剧情超过美剧反转烧脑情节了,观众表示需要追剧,看看剧情是如何发展到这个阶段的。",
			"date_added": 1538049892688
		},
		{
			"body": "【怕美国不饶过朝鲜 金正恩承认不敢耍诈？】日前身为美朝中间人的韩国总统文在寅再度访问美国，于一次公开活动中，他透露，朝鲜最高领导人金正恩曾经对他说，在弃核问题方面，朝鲜并不敢使诈。",
			"date_added": 1538060642065
		},
		{
			"body": "宣戰？ 不滿美轟炸機飛越南海 共軍揚言採取必要措施",
			"date_added": 1538108959557
		},
		{
			"body": "上台6年，环球撒币万亿美元，高喊要构建“人类命运共同体”。 结果发现，一扇扇大门对他关闭。他或在困惑——钱是用来买仇恨的吗？ 被关起来的他，现在唠叨的是——苦练内功，自力更生。钱都白砸了，中国又回到从前。 选领导人，不测智商后果很严重。光体力好有什么用？",
			"date_added": 1538109176411
		},
		{
			"body": "革命党今天砍杀广东省惠州市副市长一家",
			"date_added": 1538127102780
		},
		{
			"body": "中美关系恶化，中国就需要自立更生，这个信号说明，中共确实一直在依靠美国过日子。",
			"date_added": 1538189568606
		},
		{
			"body": "【中共審查經濟負面消息 管控六個話題】中共長期以來明確規定，報導政治、公民社會和敏感歷史事件是禁止的。最近，隨着經濟增長放緩，它也越來越多地控制經濟負面消息。《紐約時報》獲得一份中共政府發給記者的命令文件拷貝。當局要求，需要管控六個經濟話題。",
			"date_added": 1538199092973
		},
		{
			"body": "【美国国会就中共在新疆虐待人权举行听证会】督促 川普 政府多方面制裁中共。1 停止出售美国高科技技术。2 通过马格尼斯基法案，经济制裁中共高官，包括没收其海外资产，禁止签发西方各国签证。",
			"date_added": 1538276247248
		},
		{
			"body": "29日有俄媒披露，中共外長王毅在聯大的發言次序是中共預先協調的結果，刻意規避王毅與川普（特朗普）同台。在川普做完講演後，習近平又緊急修改了已經過目的王毅的演講稿。",
			"date_added": 1538303575993
		},
		{
			"body": "最新消息：新“八国联军”即将在南海进行联合军演 目前由美国带头，日本、英国、法国、印度、加拿大、澳大利亚、韩国的八国军舰战机正向南海集结，这次军演的目的是反对南海霸权，维护“南海航行自由”。",
			"date_added": 1538384700871
		},
		{
			"body": "预告：中国律师后俱乐部投资的第一间早餐店计划先在长沙市落地，让真正的律师后直接上地气，长沙市据说冤案错案不少，中国律师后俱乐部成员一定会穷尽一切手段帮助他们！有人问我为什么先选择长沙开展第一间律师后的连锁店，你懂的，那堆“腊肉”就是湖南人！操",
			"date_added": 1538388309023
		},
		{
			"body": "【大闹英国保守党年会  中国央视女记者打人被捕】在英国保守党年会期间，一名中国中央电视台女记者在一场有关香港问题的研讨会上与在场人士发生言语冲突，并动手打人，被警方逮捕。事后，中国驻英大使馆和中央电视台都发表声明抗议。",
			"date_added": 1538407524629
		},
		{
			"body": "【不只退休！ 馬雲早已放棄阿里巴巴所有權】中國電商阿里巴巴創辦人馬雲在日前宣布將退休後，阿里巴巴今證實，馬雲已放棄阿里巴巴的主要法律實體所有權。 《金融時報》報導，據阿里巴巴7月向美國證券交易委員會（SEC）提交的文件，顯示馬雲和阿里巴巴聯... ",
			"date_added": 1538416008617
		},
		{
			"body": "習近平將軍美國資產被凍結、女兒綠卡被註銷、中國網友：請川普抄家習遠平齊喬喬齊安安鄧家貴",
			"date_added": 1538450269033
		},
		{
			"body": "大陆对民间活动全面收紧　教师上缴护照　出境须审批",
			"date_added": 1538458459807
		},
		{
			"body": "日本防卫省：美军 B-52 战略轰炸机 + 日本 14 架 F-15 战机 + 两架 F-2 战机，前天在东海尖阁诸岛（钓鱼岛）上空举行联合军事演习 ... 云评：以前跟你讲道理，你说人家是“搬石头砸自己脚“，还要”两小时荡平“。现在人家来硬的，你就喊”刀架脖子“，你那么牛逼怎么会让人把刀架在你的脖子上？",
			"date_added": 1538489357845
		},
		{
			"body": "也难怪川普这么说，在美国抗议美国政府和言论自由的行动，包括反川普。都来自中国大陆的留学生。当然背后都是由中领馆组织。可是学生们自己也不争气。好不容易逃出狼窝，但却心甘情愿被中共所利用。跑到美国来反美！",
			"date_added": 1538542587174
		},
		{
			"body": "中国官方在国庆长假前下发通知，要求各地学校对中小学老师出境加强管理，管制适用于幼稚园及离职退休教师。一些省市已收缴老师们的护照，一些地方则要求老师出境必须经教育主管部门先审查，而严厉管控亦是40年来的首次。",
			"date_added": 1538543113855
		},
		{
			"body": "中共出兵敘利亞，从遮遮掩掩到台前，已彻底放弃了韬光养晦战略，从軍事上加入了反美阵营，公开和美军交手！以後世界更多战乱中，將出現共军的影子！中共已取代毛子，成为老美的头号敌人！",
			"date_added": 1538564587308
		},
		{
			"body": "中共经济快崩溃了，鬼子六连把自己的爱妾都召回来放它个数十亿的血，马淫又主动把公司全白送给中共，又勒令全国私企全部白送给中共，再又下达死命令，要召回所有的贪官家属大放血，又怕普京把新疆变成第二个克里米亚，把穆斯林全部内迁，看来中共倒台很快了。",
			"date_added": 1538618719364
		},
		{
			"body": "中共权贵高层隐藏着一个沉船计划。对内强拆、掠夺，对外撒钱讨好，勒紧全国人民的裤腰带，举全国之财力，全面援交外国，结友邦之欢好，是为权贵先准备好生活条件，搞好外交关系，建设新外国，然后好移民。原来是在用百姓的钱给自己铺后路。有人说他岂止绿卡这么简单，肯定已有一个“末日方舟”计划：该贿赂的国家已经贿赂了，该洗的钱早就洗好了，一旦那一天来临，立即激活档案自毁系统（全国联网）销毁所有危险的历史档案，然后整个家族从容撤至避难国，可保几代人平安富贵。",
			"date_added": 1538625470717
		},
		{
			"body": "【中美对抗公开化 彭斯全方位不留情警告北京】美国副总统彭斯预计在今天美国当地上午11点，即北京时间今天晚上11点发表讲话，全面阐述特朗普政权对华外交政策，但讲话内容先行曝光。根据预先曝光的讲稿中，彭斯厉声批评北京一系列作为，包括在南海。评论认为，在中美贸易战之际，此番谈话预计将加剧美中之间的紧张局势。",
			"date_added": 1538671647042
		},
		{
			"body": "美国国务院5月份通知：自6月11日开始，将限制理工学科中国学生和研究人员，签证期限从五年缩短为一年。这些专业包括机器人技术 航空 高科技制造业等与“中国制造2025”计划有关的重要行业。中国公民应聘为美国有关公司担任研究人员或经理，其签证申请需要获得美国多个部门的特别准许。属长期政策不会变。",
			"date_added": 1538671826583
		},
		{
			"body": "美國副總統彭斯星期四在華盛頓智庫哈德遜研究所就美國政府的中國政策發表長篇演說。彭斯抨擊中國試圖破壞美國的民主制度。彭斯的講話涉及話題廣泛，還包括美中貿易爭端、中國在南中國海的軍事化、對臺灣的打壓，還有中共對國內民眾的監控和壓制以及在美國和海外施加影響力等等。他在講話中引用了情報評估和公開信息，並談到了一些具體例證。彭斯副總統批評前幾屆美國政府忽視了中國的行動甚至“助長”了中國。但是他說：“這樣的日子結束了。”彭斯說，特朗普政府已經對中國採取新的政策。他說：“我們尋求公平、對等以及相互尊重主權的關係，而且我們已經開始採取迅速有力的行動來達成這個目標。”",
			"date_added": 1538738754230
		},
		{
			"body": "国际刑警组织现任主席孟宏伟的妻子对法国媒体称，上周五她的丈夫孟宏伟回到中国就失联了。中共现在什么都不顾及了，任性地玩黑帮政治。",
			"date_added": 1538760750891
		},
		{
			"body": "美国副总统彭斯周四在哈德逊研究所针对中国的讲话引起许多热议。首要一点，不少人觉得，这是自尼克松以来，美国第一次如此严厉地抨击中国，彭斯指控中国不怀好意，范围远远超出贸易战。一位网友说，“感觉上，美国对习近平的中国不抱希望了“。还有网友说：“几十年一直视美国为敌，终于如愿以偿了。”",
			"date_added": 1538761224883
		},
		{
			"body": "国际刑警组织主席被中国警方抓捕……呵呵，想想都好笑﻿",
			"date_added": 1538821302723
		},
		{
			"body": "【孟宏伟 的妻子生命安全不断遭到威胁】国际刑警组织 孟宏伟 被失踪！ 孟的家属报警称：自9月25号以后失联。由于总部在法国，法国已开始立案侦查。现已确定人不是在法国失踪的。 中共官方没有给出任何有关孟的消息和回复。 为红匪做事，人人自危！",
			"date_added": 1538890215470
		},
		{
			"body": "【关注老兵】请大家关注老兵维权升级版： 老兵上北京维权中途被十比一的黑保安维稳加打，再次激发起老兵抗议。不同的是吸取镇江被镇压的经验，这次老兵带上了打狗棒！",
			"date_added": 1538890439493
		},
		{
			"body": "2018年10月4日晚，38名山东平度老兵乘车进京，在利津服务区遭大群截访人员拦截、殴打。5日，数百名青岛退伍老兵支援到平度市政府门前，手持木棍要说法。",
			"date_added": 1538890672198
		},
		{
			"body": "国庆日只有朝鲜发来贺电",
			"date_added": 1538897064039
		},
		{
			"body": "平度，老兵离开广场，走上大街，以求更多市民见证。当局调集青岛周边五六个地级市警力来到平度，波及半个山东省。",
			"date_added": 1538915335240
		},
		{
			"body": "平度，老兵离开小广场，转往大街行进。警车、警队如影随形。",
			"date_added": 1538915893473
		},
		{
			"body": "孟宏伟的妻子在法国应对很周密，有条不紊：1）昨天孟妻向法国警方报警，只反映其丈夫从法国分手就联系不上了。这样，孟的家人就非常合理地求助法方，尽管法国警方毫不费力查出孟宏伟登上去中国的飞机，并且到达中国。2）今天孟妻向法国警方反映遭到电话恐吓和社交媒体辱骂，法方很自然加强其安全保护。",
			"date_added": 1538917047380
		},
		{
			"body": "多家官媒六日刊出中国驻美大使崔天凯10月3日接受美国全国公共广播电台的专访报道，题目叫：“美方有些人想美国完胜中国完输，这不可能实现”。其实，关于这一天崔大使接受采访的情形，海外报道已有不少，崔大使说的话既不像题目那样铿锵，人也“形单影只”。",
			"date_added": 1538929400599
		},
		{
			"body": "海风点评：出大事了，几百万老兵被中共定性为不法分子，从此，对付老兵就可枪炮相加了，老兵们，是该拿起枪棒迎接挑战了。否则，等待你们的就是牢狱之灾了。等着看吧！注：金雷保安公司隶属青岛市公安局。",
			"date_added": 1538931915493
		},
		{
			"body": "平度，7日夜，一位老兵从楼顶拍摄的视频。街上很多警车，围在平度医院周围一带。",
			"date_added": 1538932788302
		},
		{
			"body": "山东省政府还征调了保安公司队伍，前往协助警方。",
			"date_added": 1538932983579
		},
		{
			"body": "孟宏伟的老婆手里有大把的猛料，会把党国的内幕报个底儿掉！目前正在幕后和中共讨价还价，让中共放人，向法国报警不过是压迫中共尽快放人的手段，防止中共无休止的拖延战术！否则中共只需宣部孟涉贪被捕就好了，显然目前正在勾兑，中共不敢贸然宣部其违法！",
			"date_added": 1538934862109
		},
		{
			"body": "失踪的#国际刑警组织 主席#孟宏伟 的妻子格蕾丝（Grace Meng）今天说，她的丈夫在失踪之前给了她一张刀的照片。格蕾丝。孟在记者会上要求不露脸以保护自己和孩子的安全。目前她与孩子被法国方面保护。",
			"date_added": 1538969176857
		},
		{
			"body": "国际刑警组织突然收到孟宏伟辞职电信,中国这6千万美元算结束了。再花6千万买下一任主席席位。",
			"date_added": 1538975916949
		},
		{
			"body": "  广西今日，老兵上街，声援平度。形式有些奇葩，警察紧紧跟随，伺机控制。",
			"date_added": 1539003609826
		},
		{
			"body": "  10月8日晚，平度，几个河北老兵还在街上。他们可能是留在平度最后的老兵了。",
			"date_added": 1539017545451
		},
		{
			"body": "【內部好友透露】垬原訂先拿下孟，然後用交換條件讓孟打電話給在法國妻兒令他們回國，然後再以身體原因辭去主席一職。沒想到孟已不信垬，他堅信只有歐美才能救其命。並在回國前將6份機密文件交給其妻。還告知如果法國政府靠不住如何聯繫美領館。多年公安經驗打垬個出其不意。",
			"date_added": 1539056266403
		},
		{
			"body": "据网上消息，原定11月8国全球南海联合军演将扩大至26国！继美国，英国，法国，加拿大，澳大利亚，日本，韩国，印度8国后，新增德国，以色列，墨西哥，巴西，新西兰，智利，哥伦比亚，荷兰，秘鲁，文莱，泰国，马来西亚，菲律宾，新加坡，斯里兰卡，汤加，越南，印度尼西亚等18国，全球灭中共进入高潮！",
			"date_added": 1539058526331
		},
		{
			"body": "平度访民刘兰香因围观“老兵维权事件”被拘留五天。 山东省平度市维权访民刘兰香因围观“平度老兵维权事件”而遭到警方五天行政拘留的处罚，罪名为“寻衅滋事”，拘押于青岛市拘留所。刘兰香在“平度老兵维权事件”发生第五天，即10月8日，到老兵聚集静坐的广场围观，并带去食物和水果。",
			"date_added": 1539102923604
		},
		{
			"body": "差点忘了爆料：其实这次罚范冰冰补税9亿就是习明泽的阴谋，范冰冰交的这9亿税款全进了习明泽的口袋，这个婊子养的贪财鬼贪婪无耻在国内外情报圈是公认的🖕，比她妈那个卖B求荣傍了俩红匪(习近平和陈元)的老军妓彭丽媛还贪婪🖕，自从习家买下了丹麦盛宝银行，习明泽可有地方存钱了，接下来打劫更多土豪。",
			"date_added": 1539105605964
		},
		{
			"body": "今天孟宏伟的妻子又揭露了中共黑社会式行径：孟妻报案之前，中共已派两个小组去法国找孟妻，并威胁知道她在哪儿。这件事表明：1）中共无视法国国家安全，未经法国许可擅自派执法人员到法国，粗暴侵害法国主权。2）中共试图将孟妻绑架或威逼闭嘴，遮掩孟被秘密逮捕。孟妻报案，让中共法国违法计划搁浅。",
			"date_added": 1539137832871
		},
		{
			"body": "由端典碰瓷，至英国央视大妈动粗，到法国国际型警主席被失踪。短短半个月，中共把欧洲搞得天天有新剧，利害了，还想中欧友好，豬头是有妄想症！﻿",
			"date_added": 1539146601834
		},
		{
			"body": "【关注平度】经打三交打压老兵打狗棍灭火器被缴。正腐为全胜武警加入围点打援，实行戒严交通管制。援军被驱平度外。对群众送衣捐食以寻衅滋事罪名，目前老兵弹尽、饥寒、众多伤员。手机电池已尽，通讯中断。刚得消息:目前尚剩七省三百多老兵在抗争英勇无畏，陕西老兵打头阵。愿保佑老兵们活着回来，",
			"date_added": 1539175111914
		},
		{
			"body": "参议员卢比奥：习近平在美国骚扰华裔美国人和合法永久居民",
			"date_added": 1539224488596
		},
		{
			"body": "川普宣布重大新闻： 美国不再向联合国派住大使。",
			"date_added": 1539246339094
		},
		{
			"body": "明天，美国国会和行政中国委员会两位主席将联合提出“2018新疆维吾尔族人权行动”法案。",
			"date_added": 1539274029160
		},
		{
			"body": "大陸有人填了一首詞，來形容這幾年習帝掌權後的形勢變化，調寄《江城子》： 「大國豪氣震山河，聯黑非，戰美國，宇宙真理，盡在手中握。人類命運要構建，厲害了，我的國。」 「無奈經濟斷崖落，股狂瀉，債違約，哀鴻遍野，百業風中瑟。尋問神醫方怎開，華佗曰：梁家河。」",
			"date_added": 1539275448043
		},
		{
			"body": "陸東獨家披露：孟宏偉是從斯德哥爾摩坐國航CA912航班直飛北京，現得到部分證實！《名利场》（Vanity Fair）杂志10月9日问：”孟宏伟为什么9月25日这一天经瑞典返回中国？”日媒與我同感，孟案或與王健兇殺案有关。另據“內部”消息说，孟宏伟囑妻子若法国政府靠不住，可考虑向美国寻求帮助。我持同樣觀點！",
			"date_added": 1539312351692
		},
		{
			"body": "中共与孟宏伟妻子斗嘴，不便派新华社、《人民日报》、《环球时报》这些野战军，只好启用中宣部嫡系“外媒”。昨天喂料“起底孟宏伟妻子 并无“驻外人员家属”；今天又喂料“孟宏伟妻子身份遭起底：小三上位吃空饷日均挥金过万”。这就是大国、厉害国当权者做的事儿，连续两天“起底”一个女人。",
			"date_added": 1539324303241
		},
		{
			"body": "老兵没死，芜湖一百多条又摆在了市政府门前。高喊“反对忽悠”！",
			"date_added": 1539345271373
		},
		{
			"body": "上海南汇莎海苑小区一对夫妻，P2P理财被骗，跳楼自杀！",
			"date_added": 1539361295433
		},
		{
			"body": "早知道资产会被没收，还不如把钱拿来搞民主运动成立民主救国军",
			"date_added": 1539401265644
		},
		{
			"body": "中国官方2018年10月12日周五通报说，天津市葪州区发生非洲猪瘟疫情，造成近二百头猪只死亡。中央社说，这是京津冀地区首次出现非洲猪瘟疫情。此外，辽宁省鞍山市也再次排查出非洲猪瘟疫情。",
			"date_added": 1539407246925
		},
		{
			"body": "【上海村民遭入室绑架 警方不立案】 新唐人电视台消息：2018年10月6号，上海市闵行区浦江镇群益村维权村民王美华，被闯入家中的一群蒙面人绑架带走，她的丈夫谈永江向当地警方报案，但警方不予立案。目前王美华下落不明。——连国际刑警组织主席、公安部副部长都被消失的黑社会里，一个屁民在它们眼里又算个啥？",
			"date_added": 1539417101847
		},
		{
			"body": "白宫国家安全顾问约翰博尔顿本周直接警告中共党国，美国不会坐视中共海军挑衅和威胁在国际水域中的美国军舰。他表示美海军指挥官已经得到授权，在受到中共海军挑衅时按交战规则保卫美国军舰。这意味着下次中共军舰逼近威胁美舰时，美军要动手予以痛击。",
			"date_added": 1539417320409
		},
		{
			"body": "镇江事件，有被打老兵申请信息公开，镇江市政府回复：无可奉告。",
			"date_added": 1539438649077
		},
		{
			"body": "习主席抓了孟主席。习主席指控孟主席贪腐，孟主席揭露习主席也贪腐，香港资产就是证据，习主席说孟主席养小三搞婚外情。孟主席问习主席梦雪是谁？为什么要抓桂明海？习主席无言以对。",
			"date_added": 1539440128123
		},
		{
			"body": "中共當局鉗制社會網絡言論明顯升級(圖): 中共當局近年嚴控和打壓社會和網絡言論的行動，近期明顯升級，更有近乎荒唐的趨勢。浙江一位大學教授因新生開學致辭遭處罰，河南青年因一句把“家業送給共產黨”便遭行政拘留，南京一位女性在自家車上貼標語被“尋滋”批捕",
			"date_added": 1539481269751
		},
		{
			"body": "川普号召制造业回流美國，正在見成效！苹果公司供应商airpot將成为继富士康之後，第二家撤离大陆的苹果合作伙伴！該公司在大陆有3万9千名员工，意味着撤离后将有近4万人失业！苹果系统全部撤离后，将带走近500萬工作岗位，強國失业潮將席卷每个家庭！",
			"date_added": 1539486682969
		},
		{
			"body": "火车座位下面全部安装了窃听器，所有，包括茶座下面！厉害国，你到底要干什么？",
			"date_added": 1539496263040
		},
		{
			"body": "2018.10.14日上午我和梁颂基上街买菜 刚出小区南门就被十多名身份不明人士绑架。我上前解救并要求它们出示证件 有人向我晃动一下警察胸卡 我不同意 又去试图解救。这时有人告诉我你在防碍公务 我要它们继续出示相关文件 有人向我出示了广州荔湾区公安分局的刑事拘留通知书 后阿基被带到青塔派出所。張寶成",
			"date_added": 1539524919719
		},
		{
			"body": "美國推翻獨裁者薩達姆後10年，伊拉克人一勞永逸解決了極權及腐敗問題，變化天翻地覆，GDP翻倍，吸引很多中國人去打工！而中國主流媒體隻字不提，繼續灌輸戰爭動盪百姓苦，欺騙百姓說伊拉克、阿富汗、利比亞人民苦不堪言！謊言是維繫垬暴政的工具。",
			"date_added": 1539534269538
		},
		{
			"body": "10月12日，河南郑州，一老太躺在保时捷车前碰瓷，要价5000元，120来了她也不去，110来了她也不起来，就非要要钱。司机拿出500欲让她走，被愤怒的市民制止，称不能助长这种歪风邪气。最后，老太被市民“齐心协力”抬到路边。附近市民说她一个礼拜碰瓷一回。",
			"date_added": 1539568499065
		},
		{
			"body": "克林顿夫妇因为位高权重，大陆这边对他们没少下功夫！  克林顿卸任后来过中国几次，带走大笔演讲费，连合影都是10万美金起步的。  希拉里写的书，因为有的内容太过对党不利，没办法，删除了一些章节，还是让在大陆出版了，当时我就感觉蛮奇怪。这种情况，照理，是发不了的  这就叫：“蓝金黄”！",
			"date_added": 1539574485450
		},
		{
			"body": "深圳斥百亿救市，晚了!",
			"date_added": 1539584652380
		},
		{
			"body": "最近大陆各地各种民营企业开始扎堆倒闭，以至于注销登报版面都排不下，因为2019年1月到3月期间暂停注销，彻查社保与税务问题，只有补齐社保才能注销，由于受明星风波的影响，年关税务更是严查，公司注销难度剧增！扎堆注销现象更严重，形式严峻拥挤！！",
			"date_added": 1539595140595
		},
		{
			"body": "在班农眼里，中共是一个没有文明底线的流氓政权，牠们早已认识到成为金融大国的重要性，想让人民币拥有美元的地位，企图通过一带一路掠夺别国资源。说穿了，一带一路就是借给你永远无法偿还的钱，以达到控制你的目的。一个腐朽没落的制度，越是表面强大，就越是令人担忧其恶性扩张带来无法收拾的局面。",
			"date_added": 1539614862844
		},
		{
			"body": "“党中央”挺有意思。党中央对习近平家族六亿香港买房不震怒、对曾庆红儿子买澳洲最贵的房子不震怒、对李鹏女儿李小琳瑞士账户被曝光不震怒，独独对赖小民藏3亿现金就震怒？党中央不喜欢不会理财的贪官？🙈",
			"date_added": 1539662656899
		},
		{
			"body": "浙江传媒学院文学院副院长赵思运，因在开学典礼上号召新生重拾知识分子优良传统，独立思考，担当道义，批评阴暗，被共匪党内严重警告处分！",
			"date_added": 1539665902933
		},
		{
			"body": "看习的动作，准备搞先军政策，一切东西先供养暴力机器（警察，军队，城管，特勤，安保） 对百姓直接往死里整，没有钱就用抢的方式维持（城管驱赶小贩实现市场垄断经营，私有企业充公或者以公私合营接管，打土豪分田地，参考马云，刘强东，范冰冰…） 这个国家状况比现象中严重！",
			"date_added": 1539689027757
		},
		{
			"body": "【紧急关注】南大马会学子为注册社团奔走长达四十多天，屡遭校方漠视回避！今日傍晚6时许，南大马克思主义学会成员来到食堂门口举横幅抗议，声讨南大哲学系党委副书记 #孟振华！",
			"date_added": 1539693803588
		},
		{
			"body": "白宮說：我們也許必須將中國踢出世貿組織。",
			"date_added": 1539713327794
		},
		{
			"body": "今天凌晨两架中国制造的歼-7战斗机在缅甸坠毁，两名飞行员死亡，碎片还造成一位十一岁女童死亡。今年四月三日，同样的歼-7战机坠毁飞行员丧命。此款是仿制苏联米格-21，九十年代缅甸从中国进口了六十架。去年一架中国制造的运-8军用运输机坠海，导致122人死亡。两个月前，缅甸改从俄罗斯购买战机 ",
			"date_added": 1539744608250
		},
		{
			"body": "人间最恶的制度，莫过于先交钱再救人。台州女子林金叶，丈夫脑出血，医生要交10万再手术。勉强凑够8万，医生仍不同意。等她借够最后2万，丈夫救不回来了。",
			"date_added": 1539748009571
		},
		{
			"body": "参与制造709案导致无数维权律师消失的孟宏伟，如今自己也“被消失”，如何解读中共体制下的混乱怪象？",
			"date_added": 1539750938894
		},
		{
			"body": "《东亚日报》报道称，在文明社会中逮捕一个人的时候，通知家人并保障其邀请律师的权力是最基本的人权。而突然的失踪带给人民的恐惧远远大于事件本身。华尔街日报Twitter评论称，从神秘富豪肖建华，影视明星范冰冰，到国际刑警组织主席孟宏伟，无论他们拥有怎样的财富、声名和权势，都经历了原由不明的失踪。随着失踪人士扩大到党外，这些事件传达了一个讯息：无论你是谁，党都能抓你。",
			"date_added": 1539761967078
		},
		{
			"body": "1、历史上的丝绸之路，既不是中国人兴建的，也不是中国人推行的，而是境外对中国的丝绸有需要，才形成了丝绸之路。 2、每当有战乱，或者西方的需求变小了时，这条路也就不通了。 3、现在建设“一带一路”的主要动力来自我们自己，如果没有对方的配合，没有对方的需求，这个经济带能建设起来吗？",
			"date_added": 1539775436598
		},
		{
			"body": "今日深圳报纸，排队注销公司，报纸版面都不够用了。",
			"date_added": 1539777069060
		},
		{
			"body": "貿易戰處處失算 中國尷尬續買美豆",
			"date_added": 1539799455849
		},
		{
			"body": "川普宣布美国退出万国邮政协议。该协议对各国极不公平的收费标准导致不公平贸易。比如，淘宝向美国发送商品的运费时，其美国境内运费比其他美国国内运费还便宜，因为美国邮政按万国邮政规定收费送货。",
			"date_added": 1539801406810
		},
		{
			"body": "根據港府資料，這個“秘密警察”部門有至少700名成員，由一名警務處助理處長領導，而其中不少人與中國大陸方面的聯繫十分密切。",
			"date_added": 1539831288388
		},
		{
			"body": "几千名洪都拉斯人浩浩荡荡穿过邻国危地马拉向美国进军。川普也没什么好招，今天威胁洪都拉斯总统，如果不拦着这些人，将大幅度减少援助。",
			"date_added": 1539834685143
		},
		{
			"body": "山西首现非洲猪瘟疫情 辽宁3天5例",
			"date_added": 1539839146244
		},
		{
			"body": "抗暴！揚州上千人圍堵派出所 為強拆血案鳴不平(圖): 江蘇揚州市杭集鎮抗強拆血案事件升級。10月17日，上千名民眾圍堵派出所、鎮政府，為此案鳴不平。",
			"date_added": 1539854046346
		},
		{
			"body": "经济学家高善文今年说过一句不该说的话：“我老了，也财务自由了，静观其变。你们30岁以下的年轻人最可怜，如果这一次走错了路，这辈子就可以洗洗睡了”。一代人有一代人的命运，成长于开元天宝时期的人，以为盛世是常态，谁又能想到，他们大多数人会死于随后的安史之乱。",
			"date_added": 1539868422618
		},
		{
			"body": "中国人不管是读过书还是没读过书的，基本上都是文盲。在学校学的是被严重阉割过的知识，出了学校，认为这辈子就不需要读书了，反而觉得是一种解脱。就是看书，看的都是厚黑学，鸡汤文，成功学之类的。从来不会思考，也从来没有探索和思考的欲望。每天关心的都是吃喝玩乐，只满足物质和原始生理需求。转",
			"date_added": 1539885846563
		},
		{
			"body": "川普 重大决定：斩断美国和中共的经济关系  中美步入全面脱钩阶段 ",
			"date_added": 1539917370429
		},
		{
			"body": "联合新闻网 | 未见成果却背重债多国取消一带一路工程",
			"date_added": 1539932316986
		},
		{
			"body": "山西李发旺大哥，刚刚被国保请去喝茶，本周已经第三次了。他因参与维权活动，尤其去年营救高智晟律师后，备受折磨，国保喝茶已是家常便饭。",
			"date_added": 1539945408706
		},
		{
			"body": "北京这位女侠说了，只要破2500点，就在天安门裸奔！她做到了，是个女汉子[强]但愿她这是历经大跌之后的豁然开朗…………",
			"date_added": 1539948036071
		},
		{
			"body": "11月6日，欧洲维吾尔和藏族朋友，将在日内瓦联合国广场大规模集会游行。 适值联合国人权理事会对中国的第三轮普遍定期审议。目前中国人权状况比四年半前第二轮审议时，更加糟糕。",
			"date_added": 1539974674389
		},
		{
			"body": "【批評中國「掠奪性經濟」 美國務卿：與北京做生意要小心】當中國想要與你洽談時，並不是總為了你們的公民利益著想，龐皮歐說，中國的國有企業明顯以一種不透明的方式出現時，顯然不是市場驅動的，並且不是為了使巴拿馬人民受益，而是為了使中國政府受益，對於巴拿馬人民或中國從事這種掠奪性經濟活動的任何其他國家來說，這些都是美國認為既不合適也不利的事情。",
			"date_added": 1540002399906
		},
		{
			"body": "有报道称，美国前国防部官员博思科建议美国应该考虑废除美中第三个联合公报，即影响对台军售最大的“八一七公报”。中国专家称这是一些以前根本是不可思议的言论及观点，被美鹰派人士抛出来，值得注意和警惕。",
			"date_added": 1540012070416
		},
		{
			"body": "《美聯社》9 月 21 日內容指出，中共當局將維吾爾人孩子，以及新疆自治區境內的其它少數族群兒童，通通送進數 10 個國家孤兒院。",
			"date_added": 1540094133127
		},
		{
			"body": "澳門中聯辦主任鄭曉松，星期六墮樓身亡",
			"date_added": 1540107213377
		},
		{
			"body": "中國汽車銷量暴跌 比房市泡沫更可怕 一場大風暴來了！(圖): 火了30年的中國汽車行業，寒冬說來就來了！下半年以來，汽車銷售遭遇滑鐵盧，連續三個月負增長，9月更是創下7年內最大降幅，令人瞠目結舌！中國汽車的盛世，真過去了嗎？汽車是國內第二大產業，是中國家庭中僅次房子的重要",
			"date_added": 1540141641969
		},
		{
			"body": "川普废掉美俄的中程核导弹条约，也只是个开始，退出各类条约的大幕拉开了！川普今日说： 如果中共和俄国都不遵守条约，私下发展核武器。为什么只有我们要遵守合约？ ",
			"date_added": 1540179670027
		},
		{
			"body": "新疆集中营官员威胁被拘禁的人，如果谁对外说谁是不情愿进集中营里学习的，谁的家人就会永久关进集中营学习！被关进集中营在外的家人，如果谁敢对外说不情愿的话，那么在集中营里面的家人就会被失踪，被器官！这是陈全国这个共畜的铁手腕！！",
			"date_added": 1540221447111
		},
		{
			"body": "印度尼西亚渔业和海洋事务部长Susi Pudjiastuti 向中国发出了强烈信息，中国是世界上最大的捕鱼船队的所有者。  “他们正在做的不是钓鱼，而是跨国有组织犯罪，”她在雅加达举行的新闻发布会后对亚洲本周进行了采访。“你应该这样写。他们需要明白。“",
			"date_added": 1540225494046
		},
		{
			"body": "民主、共和兩黨在「比狠」(圖): 最新一期《經濟學人》以「中美對抗」（China v America）作為封面故事，文章指出，現在中共已被美國政黨、外交、商業等界視為戰略對手，而且民主黨、共和黨更在相互比較，看誰對中共更狠。",
			"date_added": 1540261651896
		},
		{
			"body": "【韩朝与联合国军司令部就非军事区和平化举行会谈】朝鲜、韩国与联合国军司令部的代表星期一举行会晤，进一步讨论在朝鲜半岛非军事区共同警备区解除武装的计划。三方代表上星期刚刚举行会晤，讨论朝韩第三次峰会签署的全面军事协议的落实方法，以实现非军事区的和平化目标。",
			"date_added": 1540266303610
		},
		{
			"body": "从中共建政以来，甚至是从延安时期开始，对媒体的控制就相当自觉、深入、有技巧。这种控制是全方位的，从人事到出版的每个审查环节再到最后的市场都有控制。但其实“媒体姓党”从一开始就是如此。这个大方针从未变过，变的是管控的技术。",
			"date_added": 1540271309063
		},
		{
			"body": "日媒:日本政府希望停止对华40年的\"政府开发援助\" 2018-10-23 ",
			"date_added": 1540297023205
		},
		{
			"body": "我给各位形容一下什么叫“为老不尊”：我爷爷那辈没在60年代被饿死，我爸爸那辈没在70年代被斗死，到了现在他们都觉得自己是国家的主人。",
			"date_added": 1540301186242
		},
		{
			"body": "安倍訪華時將宣布結束對華政府開發援助",
			"date_added": 1540305929082
		},
		{
			"body": "用繩「釣」出寺廟香油錢 兩華客在泰國被捕",
			"date_added": 1540306077344
		},
		{
			"body": "‪10月23日黃琦与律师会见笔录：我的病情恶化到今天这个地步，完全是法西斯迫害的结果，告诉大家黄琦会抗争到底！请未来的朋友追究中国法西斯的罪行‬",
			"date_added": 1540312295261
		},
		{
			"body": "上月底在英國保守黨年會上涉嫌掌摑他人的央視女記者孔琳琳，據報被英國警方控以普通襲擊罪。  48歲的孔琳琳上月30日在保守黨年會一場有關香港問題的研討會上，大罵發言者意圖分裂中國，其間更兩次掌摑一名香港義工，警方一度以普通襲擊罪拘捕她。  央視和中國駐英大使館批評有人阻止中國記者提問及表達觀點是不可接受，要求主辦單位道歉，孔琳琳翌日獲釋，不過有報道指英國警方已正式以普通襲擊罪起訴孔琳琳，下月7日在伯明翰法院提堂。",
			"date_added": 1540450539367
		},
		{
			"body": "京學者炮轟“中國模式” 警示中南海四面楚歌 中國經濟最大受益者皆他造(圖): 中國大陸在過去的40年間，經濟保持了高增長的態勢，中共一直宣傳是〝中國模式〞取得成就。大陸知名經濟學家近日分析，中國經濟靠的是市場化和技術後發優勢，一味鼓吹“中國模式\"會自毀前程。",
			"date_added": 1540450756215
		},
		{
			"body": "美国陆军驻欧洲前最高司令、本·霍奇斯将军周三警告，美国与中国未来在太平洋爆发战争冲突的可能性很大。",
			"date_added": 1540467738930
		},
		{
			"body": "中國日前傳出有當局的審查人員直接前往書店，以「審查」為由將書籍全部搬走，有網友稱「相關部門幾乎把整的店都搬空了」，受害網友估計至少被搬走1600本書，其中不少的日本漫畫也被帶走；不過消息才發布在微博沒幾天，就全被「和諧」得無影無蹤，而日前中國各地有圖書館、書店也傳出暫時關閉，進行整頓的消息，懷疑中共當局對思想控制再一次加強緊縮。",
			"date_added": 1540471434692
		},
		{
			"body": "【中国央视记者孔琳琳在英涉袭击案：伯明翰警方提起公诉】英国伯明翰警方证实，此前在英国保守党大会一场香港事务活动上与在场人员争执的中国中央电视台欧洲中心站记者孔琳琳被正式起诉。",
			"date_added": 1540476954613
		},
		{
			"body": "有一个苏联时代的笑话：毛泽东和美国总统、苏联主席一起散步。看到一个老太太在追赶一只逃跑的狗。毛说咱们帮帮这个老太太吧，看谁有本事叫这只狗自己回来。美国总统喊道：“狗，回来我给你自由和优裕的生活。”狗还在跑。苏联主席叫道：“狗啊，你要不回来我就指使KGB（苏联特务组织）杀死你。”狗还是不理会。这时候毛操着浓重的湖南话对狗喊：“狗儿，向前跑吧，你前面是一条社会主义的康庄大道。”狗一听，立刻掉过头跑了回来。",
			"date_added": 1540482216492
		},
		{
			"body": "【实时线报】 此时，佛山市顺德区杏坛镇，民众抗议政府在此建设化学危险品处理场，大规模群众示威游行正在进行中！",
			"date_added": 1540485732425
		},
		{
			"body": "黄琦遭隐瞒病情 家属向国际社会求援 维权网站“六四天网”负责人黄琦的健康状况一直备受关注。他近日透过律师对外透露，看守所为了掩盖他的病情，无所不用其极。有国际人权组织相信，当局这样做动机并不单纯。",
			"date_added": 1540488156160
		},
		{
			"body": "法國多家報紙報道中國間諜滲透法國呈越來越嚴重事態，涉及領域政治軍事，經濟金融，科技與工業研究。…法國越來越認識到中國間諜行為危害法國安全，敲響反擊警鐘。",
			"date_added": 1540488198438
		},
		{
			"body": "此次日中关系回温，  垬同意与日本共同开发东海石油天然气资源， 等同承认日本享有东海主权， 日本对钓鱼岛的实际占领将更稳固， 垬不再对日本政治人物到靖国神社参拜说三道四。  同时， 日本顺利停止了对中经济援助， 日企可更顺利地撤出中国， 日本将扩大对中出口。  而美日同盟仍无法撼动。  垬赢了面子， 日本则赢了里子。",
			"date_added": 1540640967296
		},
		{
			"body": "万里行寻找高智晟 发起人李发旺病重住院",
			"date_added": 1540648099169
		},
		{
			"body": "邓小平南巡被美化了 改革其实在64邓举起屠刀时就已经被强行终止了。 邓南巡不过是鼓动中共权贵八仙过海各显神通，放手劫掠而已 邓想拯救的只是中共 所以注定两极分化、官场腐败和人性扭曲 在维护中共统治上习和邓并没分别 只不过习近平更加愚蠢，不知世界大势。",
			"date_added": 1540651541842
		},
		{
			"body": "1969年8月28日苏联驻美大使多勃雷宁接到克里姆林宫的密令：苏联准备对中国的重要军事目标进行一次外科手术式的打击，请秘密征询美国当政者的意见；计划投放的核武器属于精确打击，不会产生多少核污染。多勃雷宁立即向美国国务卿基辛格通报。白宫的反应是，美国反对苏联的计划，若苏联这样做，将违反美苏间关于维持世界稳定的协定，也不符合国际宪章；同时，白宫故意向《华盛顿邮报》泄露了苏联的这一计划，以便让中国有所准备。8月28日该报刊登了一则震动世界的消息，标题是，《苏联欲对中国做外科手术式的核打击》。",
			"date_added": 1540652884503
		},
		{
			"body": "日本外相河野太郎要求中国撤掉在尖阁诸岛（中国钓鱼岛）周边的浮标。这是他陪同安倍访问北京时向中国外长王毅提出的要求。王毅没有回应，但同意妥善处理双方对立。",
			"date_added": 1540653871744
		},
		{
			"body": "下月的川習會要泡湯？美媒曝光關鍵內幕: 習特能否如期下月底在G20峰會期間會面，似乎再添變數，美方官員暗批中方仍未提出解決問題方案，並警告美國或因此拒與中國重啟談判。",
			"date_added": 1540654319285
		},
		{
			"body": "因长期鼓吹基层工农维权或抗争，左派网站红旗网主编武夷山（真名吴立杰）近日被河南警方刑拘，观察人士指中共维稳是基于现实的统治需要，一旦对现政权形成威胁，即使是意识形态同盟亦会成为打击对象。",
			"date_added": 1540664814573
		},
		{
			"body": " 美國彭博新聞社報道說，特朗普政府考慮在11月底的美中首腦峰會上，把貿易問題排除在正式議程之外。 ",
			"date_added": 1540664942214
		},
		{
			"body": "澳大利亚中国问题学者凯大熊（Kevin Carrico）在《外交政策》撰文，讲述参加御用学者胡鞍钢在edX平台上开设的“习近平新时代中国特色社会主义思想”课程学习并获得证书经历，更嘲讽“习近平思想是切片面包以来最伟大的发明”。",
			"date_added": 1540827510418
		},
		{
			"body": "不怕北京抗議美可攜核彈B-52轟炸機已5闖中國東海防空識別區",
			"date_added": 1540832828607
		},
		{
			"body": "中美对峙升级 越南亲美主席诡异死亡 出访北京时遭中共下毒？",
			"date_added": 1540832930857
		},
		{
			"body": "華南美國商會：逾7成美國企業考慮延緩對中進一步投資(圖): 根據華南美國商會的最新調查報告，由於美中貿易戰持續升溫，吃掉他們的獲利，在中國南方設廠的美國企業中，超過70%考慮延緩進一步投資，並將部分或全部生產移至其他國家。",
			"date_added": 1540833086452
		},
		{
			"body": "最近一周内，中国多地再有至少数十个家庭教会遭到取缔或被强拆十字架。其中，上周六及本周日（10月28日），河南、河北、湖北、浙江都有教会受到逼迫。浙江有基督徒对本台表示，进入年底，地方当局正在全面取缔家庭教会。",
			"date_added": 1540833130221
		},
		{
			"body": "广州地铁已从10月26日开始，使用面容识别系统检查入站的乘客，这是全中国首个城市的地铁站使用这种生物辨识技术，作为安全保障的措施。在此之前，中国大陆的地铁站使用机场式的保安检查措施。包括珠江新城地铁站在内，广州有5个地铁站上周五开始，使用面容识别系统。",
			"date_added": 1540833195008
		},
		{
			"body": "原中国医药学会部门负责人刘玉辉被立案审查后检察官问刘玉辉：“你父亲住院吃的药，你是不是要亲自看一下才放心？” 刘:“那当然！我清楚哪些药厂的药吃不得。那些药厂连审批文件都是假的，生产的药还能吃吗？中国生产的药品百分之八十是无效的，骗钱且害人。我父亲吃的药我都要亲自把关。”",
			"date_added": 1541035801332
		},
		{
			"body": "【加拿大参议院获得一致通过的反强摘器官法案纳入了加拿大联邦议会的议程】国会议员 Garnett Genuis：〝该法案将使得通过强摘而获得器官成为违法行为, 这方面，目前最大的问题是中共政府。〞 〝比如有人一个月前预定一颗心脏， 或者制定某天有某个器官可以移植 显然， 如果不是杀人那是做不到的〞。",
			"date_added": 1541035921085
		},
		{
			"body": "習中央首認貿易戰受重創 四中全會難產 川普啟用重型武器 科技戰開打: 最近，美方連串動作顯示已啟動科技戰。美高官日前更警告英國，與中企合建核電站存在洩密和安全風險。俄媒稱，美國決定動用重型武器，譴責中共盜竊技術。",
			"date_added": 1541036459468
		},
		{
			"body": "默克尔在地区选举中受重创，周一宣布将辞去基督教民主联盟领导人职位，并在2021年总理任期结束后不再参加竞选。中国一直在通过与德国建立密切关系来推动与欧盟的经贸合作，默克尔2005年上任后已11次到访中国“务实”合作，她的离开会让中国担心继任者是否继续与中国“务实”合作。——凡是跟中共走得近，跟中共暗通款曲的，必然要受到神的惩罚。",
			"date_added": 1541036498562
		},
		{
			"body": "受中美贸易战影响，中国经济形势继续变坏。一系列数字告急：制造业跌倒25月以来最低，人民币兑美元持续走低，当局承认经济下行压力增大，长期累积的风险隐患开始暴露。习近平31日主持中共政治局开会讨论应对之法，重申“六稳”。",
			"date_added": 1541036529224
		},
		{
			"body": "盜取器官！ 湖南男子屍體放醫院太平間 雙眼被挖走(圖): 湖南寧鄉市李女士的哥哥在日前因病離世，遺體放在湖南寧鄉市人民醫院太平間，但數小時後，她去太平間料理後事時，發現哥哥的雙眼被挖走，情形非常恐怖。",
			"date_added": 1541059163664
		},
		{
			"body": "十月初，已經定居美國、不願透露全名的張女士回北京賣房。她發現在把錢匯到美國的過程中，障礙重重，使她陷入了漫長的等待， “現在這個情況就是還在等，我每天就看到美元匯率一直在攀升，我就知道我每天都在裡面損失",
			"date_added": 1541059240118
		},
		{
			"body": "【“无美国版TPP”完成批准程序 将于年底生效】澳大利亚政府10月31日宣布，已完成《全面与进步跨太平洋伙伴关系协定》(CPTPP)批准程序。这份11国多边贸易协定迄今获得一半以上、即六个签署国的立法机构批准，按规定将在60天后、即12月30日生效。 ​",
			"date_added": 1541059306016
		},
		{
			"body": "罕见 美国群控中国间谍 10人涉偷航天发动机核心技术",
			"date_added": 1541059335007
		},
		{
			"body": "上海发生类似辛亥革命前革命党发生意外大爆炸！！！",
			"date_added": 1541142580733
		},
		{
			"body": "进博会前夕，上海发生企图炸死习近平的大爆炸！中共正全面封锁消息！!!",
			"date_added": 1541142644398
		},
		{
			"body": "上海发生大爆炸！！！显然在进博会上炸死习近平的计划已经失败了。目前无法知道反习势力有没有其它下一步的计划。",
			"date_added": 1541142710273
		},
		{
			"body": "上海龙华中路，船厂路一带被200多名特警包围封锁!!!可能与搜捕九亭爆炸案人员有关！！！",
			"date_added": 1541142860361
		},
		{
			"body": "天津发生巨大爆炸！！！判断与上海爆炸案有关，反习势力在天津制造巨大爆炸，吸引警方注意力，为掩护在上海实施炸死习近平的计划！！！",
			"date_added": 1541143034701
		},
		{
			"body": "4路革命党正联手行动，推动各地独立革命。傻逼五毛干嘛老说轮子？难道上级不让说革命党？只能说轮子？还是革命党太过隐蔽，还没渗透成功？",
			"date_added": 1541144458772
		},
		{
			"body": "11月2日，自贡市的中国银行已经发生挤兑啦！ 人们都蜂拥而至去银行取款， 银行为了稳定情绪，说你们不要冲动，算好账不要损失了利息！ ",
			"date_added": 1541231494651
		},
		{
			"body": "【新疆集中营中不断有人死亡】 网传知名企业家，Amina食品有限公司创办人Amina Ablimit 于2018年11月2日死于新疆集中营里。",
			"date_added": 1541231692524
		},
		{
			"body": "美國務卿證實：中國是美國面臨最大的國安挑戰",
			"date_added": 1541233429884
		},
		{
			"body": "大學馬克思主義學會遭禁 崇馬學生親身體驗馬氏暴力: 中國南京大學兩名學生11月1日星期四因抗議學校阻礙他們注冊馬克思主義閱讀研究會而遭到毆打。",
			"date_added": 1541233479350
		},
		{
			"body": "推特（Twitter）盡管一直被中共“防火牆”封鎖，但仍有民眾“翻牆”可上。近期，不少使用推特的大陸網民被中共有關部門約談，被要求刪除推文和賬號。",
			"date_added": 1541235317860
		},
		{
			"body": "川普暗指習近平來求和 專家：中共進退都是傷 川習會難有大突破(圖): 就在美中貿易戰不斷升級，雙方僵持不下之際，美國總統川普突然一改原本強硬的立場，談起可能與北京達成貿易新協議，令市場出現樂觀的氣氛。不過美國政經分析人士認為，中美貿易充滿了復雜性，使達成協議極具高難度。",
			"date_added": 1541239777173
		},
		{
			"body": "盡管中美首腦周四（1日）關於中美問題進行了通話，甚至2日，美國總統川普在白宮表示美國正在接近與中國的貿易協議。但是同一天，白宮貿易顧問納瓦羅稱，為了保護美國的知識產權，中共的不公正行為必須放到談判桌上。",
			"date_added": 1541239836452
		},
		{
			"body": "美国司法部今日又起诉了一名，持美国绿卡，但为红匪效忠的亲共分子  罪名有4 1 非法走私潜艇设备给中共解放军 2 洗钱 3 以欺诈手段获得绿卡 4 欺骗美国政府 数罪并罚，最高刑期65年。罚款125万美元",
			"date_added": 1541240114854
		},
		{
			"body": "因假疫苗案被問責1個月 女高官再獲重用引爆網絡 中共無底線屢屢震驚社會(組圖): 近日，前山東省食品葯品監督管理局黨組書記、局長馬越男（女）因長春長生問題疫苗流入山東而被問責，僅僅一月後，搖身一變成為山東省大數據局首任局長，引發網絡憤怒，媒體人怒送對聯。",
			"date_added": 1541245803461
		},
		{
			"body": "王明远：我们经常在媒体看到“企业家吃下定心丸”、“农民吃下定心丸”之类的话，看得多了，不禁思索：“定心丸”一词从何而来，到底“吃”了多久了。笔者好奇，在《人民日报》上利用大数据检索了一番，结果大吃一惊，原来自从《人民日报》创刊起就有群众吃“定心丸”的报道，70年来一共1840篇报道的标题或内容含有“定心丸”。",
			"date_added": 1541402768024
		},
		{
			"body": "零网聊天室",
			"date_added": 1541409512918
		},
		{
			"body": "五毛来这里党宣没屁用的。这里的人是要看我发的新闻，是要了解世界上发生些什么事。没人来这里接受洗脑的。只要看我每天发布短新闻的3个聊天室，3个论坛，人数都很多就知道了。五毛认为有人会关注他党宣，他可以找个聊天室或者论坛去每天发党宣就知道了，很快人都跑光了，很快就会无法打开聊天室或者论坛的，因为节点都没有了。",
			"date_added": 1541410125059
		},
		{
			"body": "感到五毛的党宣碍眼，可以把它删除的。拉开右菜单，点击打开聊天室文件夹，打开data文件夹，再打开user文件夹，找到五毛的文件夹16TrGEe1VC9XxabRMWSKHGuqJuAKCiFusr。把这个文件夹直接删除了，然后在右菜单中点击重建数据库，五毛的党宣就没有了。不过如果这个五毛又来发党宣了，这些删除的东西会回来的。如果他不来发党宣了，这些删除的东西就一直没有了。当然他一直来发东西也就是一直来帮我们提供节点。",
			"date_added": 1541412645855
		},
		{
			"body": "参加进博会的国家： 捷克 古巴 多米尼加 肯尼亚 立陶宛 巴拿马 萨尔瓦多 瑞士 库克群岛 克罗地亚 埃及 匈牙利 格鲁吉亚 老挝 马耳他 巴基斯坦 俄罗斯 越南",
			"date_added": 1541413923310
		},
		{
			"body": "美國總統川普10月20日宣布美國將退出「中程核飛彈條約」。中共外交部發言人華春瑩今天說，中方反對美國單方面退出「中程核飛彈條約」，反對將這項條約多邊化。 ",
			"date_added": 1541414698558
		},
		{
			"body": "伊朗總統魯哈尼(Hassan Rouhani)今天(5日)在一場透過國家電視台實況轉播的會議上，強調即使受到美國祭出的第二階段、針對重要的能源與銀行部門的制裁，伊朗仍將繼續出口石油，不會退縮。  魯哈尼在這場與經濟專家的會議上說：「美國想要將伊朗的石油外銷，削減至零出口…但是我們仍將繼續出口石油…突破美方的制裁。」",
			"date_added": 1541415240013
		},
		{
			"body": "不過，華府2日表示，儘管制裁生效，仍會暫時允許8個「管轄區」(jurisdictions)，也就是8個進口國家或地區可以繼續輸入伊朗石油。  中國、印度、南韓、日本與土耳其是進口伊朗石油的前五大國家，可望被列入8個暫時豁免繼續進口伊朗石油的名單中。美國豁免8個國家或地區可以繼續進口伊朗石油，目的是希望對伊朗禁運石油的制裁，不致於造成國際石油市場太大的動盪。",
			"date_added": 1541415598031
		},
		{
			"body": "另外，華府也在2日表示，在制裁伊朗的黑名單中，新增700個個人與實體，並迫使國際銀行網路─銀行結算系統(SWIFT)將伊朗排除在系統之外，使美國對伊朗的制裁達到「最大壓力」，藉此癱瘓伊朗經濟。  美國希望藉由對伊朗的新制裁措施，遏止德黑蘭當局介入中東地區事務、核子計畫和飛彈研發。",
			"date_added": 1541415619555
		},
		{
			"body": "至於中國是否這8個進口方之一，華春瑩在北京的例行記者會上，並沒有就此直接評論。",
			"date_added": 1541415735343
		},
		{
			"body": "蔡總統今天(5號)上午在府內接見美國在台協會AIT主席(莫健)，總統感謝川普政府對台軍售，強化台灣自主防衛力量，也強調政府透過新南向計畫，以互惠的合作方式，強化與東南亞及南亞國家的關係，期待美國及其他國家持續與台灣攜手合作，共同為印太區域打造更加穩定和繁榮的未來。 ",
			"date_added": 1541415820777
		},
		{
			"body": "人權團體今天(5日)警告，中國網路異議人士黃琦有許多嚴重的健康問題，目前遭到警方關押的他，如果沒接受治療，恐怕有生命危險。  現年55歲的黃琦2016年因為「洩漏國家機密」罪被捕。根據黃琦的母親，他現在被關在四川省的綿陽看守所。",
			"date_added": 1541416070011
		},
		{
			"body": "2014年，六四天網報導一名在天安門廣場自焚的婦女，隨後黃琦與至少3位替六四天網供稿的公民記者都被警方拘留。",
			"date_added": 1541416113646
		},
		{
			"body": "经常在媒体看到“民营企业家吃下定心丸”、“农民吃下定心丸”之类说法。“定心丸”一词从何而来？到底“吃”了多久了？一位叫王明远的人好奇，利用大数据检索一番《人民日报》，结果让他大吃一惊，原来自从《人民日报》创刊起就有给群众吃“定心丸”的报道，70年来共有1840篇报道的标题或内容含有“定心丸”。",
			"date_added": 1541562237090
		},
		{
			"body": "現在瘋狂宇宙對付釘子戶用那上衝鋒槍了",
			"date_added": 1541567079862
		},
		{
			"body": " ‪大选头一天，中共批准了 #川普 女儿 #伊万卡 16个商标。‬",
			"date_added": 1541567127033
		},
		{
			"body": "美中期選舉最新戰況-----參議院50:38 眾議院128:114(圖): 1142:目前戰況：參議院改選方面，共和黨50席：民主黨38席。眾議院方面，共和黨128席：民主黨114席。州長改選，共和黨17席：民主黨13席。 ",
			"date_added": 1541567244736
		},
		{
			"body": "蘇志民，聖名雅各伯，天主教保定教區正權主教。自1997年10月8日被强行绑架后至2018年10月8日就整整21年，7665天。因捍卫信仰自由被非法判刑40年左右，加之此次21年，总计是22266天，是目前世界上被判刑期及非法拘禁最长的神职人员。",
			"date_added": 1541572494791
		},
		{
			"body": "这些值得习近平骄傲吗？(20181107) 习近平昨天在进口博览会上说了一段与川普赌气的话。他称，中国5000年历史中，经历了各种贸易战，但中国仍然哪儿。美国媒体普遍感受到习近平的一种对抗情绪。习近平的秘书们写这段话显然经不起推敲，清政府被大炮轰开过门，并签订一系列投降协议，海参崴等被永久割让，这些值得习近平骄傲吗？",
			"date_added": 1541572582230
		},
		{
			"body": "一个伊拉克小伙子写的纪实小说，里边写着巴格达那夜的真相。前一天黄昏，部队准备好了迎战联军，第二天早上战士们发现连长不见了，去找营长，也没了，团部呢？一个人都没有了。于是，大家就各自回老家了，仗就这样糊里糊涂的结束了。没人替萨达姆打仗，大家只是互相忽悠一番。",
			"date_added": 1541573770957
		},
		{
			"body": "作为美国公民自豪！做个真正的选民！刚投完票。不管结果如何，我明天开始就可以对这些公仆问责了！",
			"date_added": 1541574018266
		},
		{
			"body": "美國之音報導，現年八十三歲的西藏流亡精神領袖達賴喇嘛表示，他不會再轉世；而他的繼任人選，將會由一個由西藏高僧僧團所組成的委員會來決定。達賴喇嘛說，他的繼任者「可能會是一名高僧，也可能會是一個二十歲左右的年輕僧侶；但不管如何，都會由這個委員會，從十一月二十九號左右，開始見面遴選」。 ",
			"date_added": 1541574394147
		},
		{
			"body": "中共違反美中網絡協議 美國或祭制裁: 美國一名高級情報官員周四（11月8日）表示，中共三年前與美國簽署了一項網絡協議，承諾不會以經濟間諜為目的進行黑客行為。但中共違反了這項協議，美國可能會採取制裁措施。",
			"date_added": 1541744442268
		},
		{
			"body": "美國加征關稅清單上的中國商品進口量下降30%: 瑞銀集團(UBS)的調查數據顯示，美中貿易戰7月份開打以來，在美國340億美元關稅清單上的中國商品進口量下降了30%。分析人士認為，受美國關稅的影響，下滑是“急劇和明顯的”。",
			"date_added": 1541744702709
		},
		{
			"body": "中共外交事务最高官员杨洁篪于周三，在美国白宫会见了美国总统国家安全事务助理博尔顿。他告诉博尔顿称，中美双方要通过平等互利的谈判共同寻找妥善解决办法。",
			"date_added": 1541744809123
		},
		{
			"body": "【费正清陷阱】费正清在中共上台时有一个预言：中国共产党将来会遇到三个问题，一是人口问题，二是官僚腐败的问题，三是强调思想统一，使整个民族丧失创造力的问题。",
			"date_added": 1541753242115
		},
		{
			"body": "中共掩蓋非洲豬瘟來源 疫情失控蔓延16省市: 大陸非洲豬瘟疫情失控，福建8日也首爆疫情，令疫區擴大到16個省及直轄市，共計53宗。",
			"date_added": 1541753440513
		},
		{
			"body": "胡欣曾是“任理軒”、“任仲平”寫作班子成員. 自從習近平十八大之後開始反腐，中共官員因抑鬱墜亡開始頻繁出現。近日，中共喉舌《人民日報》頂尖大筆桿子胡欣墜亡引輿論關注。",
			"date_added": 1541763079947
		},
		{
			"body": "1986年4月26日，切尔诺贝利核电站突然失火引起爆炸。基辅居民莎娜说：切尔诺贝利爆炸后，没有任何消息，大家都不知情，学校却停课了，领导的子女被一个个秘密接走。三周后，我们才知道发生了什么。",
			"date_added": 1541763102739
		},
		{
			"body": "美國一名高級情報官員周四（11月8日）表示，中共三年前與美國簽署了一項網絡協議，承諾不會以經濟間諜為目的進行黑客行為。但中共違反了這項協議，美國可能會採取制裁措施。 ",
			"date_added": 1541763166293
		},
		{
			"body": "中共掩蓋非洲豬瘟來源 疫情失控蔓延16省市",
			"date_added": 1541922558909
		},
		{
			"body": "北京稱740萬人下鄉",
			"date_added": 1541936893751
		},
		{
			"body": "中国新疆天才诗人（12岁就写诗）Nurmuhemmet Yasin因发表寓言小说《野鸽子》（讲述了一只被人类关进笼子里的野鸽子“不自由、毋宁死” 的故事）2005年以“煽动颠覆国家罪”被判刑十年，不允许家人探望，2011年死于沙雅监狱，家人一年后才得知诗人已经不在人世了。",
			"date_added": 1541941848991
		},
		{
			"body": "740万农民工失业还乡，比我估计的情况要严重。过年之后情况更差。看来会有2千万人失业。",
			"date_added": 1541942445779
		},
		{
			"body": "我原来测算，按2500亿输美产品加税会影响1000万人的就业，现在看来要影响2000万人的就业。如果另外的2570亿输美产品也加关税，可能要影响3-4千万人的就业。",
			"date_added": 1541942936588
		},
		{
			"body": "我是按出口产品平均5%的利润测算的，会影响1000万就业。现在实际影响远超过1000万就业，这说明两个问题：一个是中国的出口产品的利润率远低于5%，出口企业都是靠17%出口退税补贴生存的，肯定会被25%的新增关税干死。第二点说明中国其实不富有，因为出口产品其实不增加财富，出口补贴只是一种财富转移，把其他人应该得的钱转移给出口企业。出口企业只起了一个换取外汇的作用。当然企业也提供了就业。",
			"date_added": 1541944088140
		},
		{
			"body": "所谓的中国特色，就是承认了不被世界认可。坚持中国特色，就是中国人在全世界被排斥的原因。",
			"date_added": 1541948853512
		},
		{
			"body": "中国特色显然不适合新疆，西藏。因为新疆，西藏原来并不属于中国。而且中国这个国号是1911年以后才有的，原来并没有一个称为中国的朝代，也就没有这样一个国号。",
			"date_added": 1541949290690
		},
		{
			"body": "中国古代是以地名为国号的。吴地称为吴国，越南",
			"date_added": 1541949754323
		}
	]
}