{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1513519731,
			"title": "Section13.bit",
			"body": "Decentralized gaming community.\n\nhttp://127.0.0.1:43110/Section13.bit",
			"added": 1513519730
		},
		{
			"topic_id": 1532111686,
			"title": "Censorship-Master-Plan-Decoded PDF",
			"body": "PLEASE SEED AND LONG LIVE THE REPUBLIC!\n\nTHE CENSORSHIP MASTERPLAN DECODED\n(i.e. “The Adams Report”)\nThe blueprint for how tech giants covertly silence online speech, and\nhow America can fight back against corporate tech monopolist\n\nBy Mike Adam\n\nTable of Contents\nIntroduction ..........................................................................................................................1\nPart One: The Societal Cost of Censorship and the Denial of the Right to Exist ...................4\nPart Two: The Fight for Reality (censorship motivations and justifications) .........................15\nPart Three: The Fallacy of “Fake News” ..............................................................................24\nPart Four: Decentralization and the Structure of News Consumption .................................36\nPart Five: Technological and Psychological Methods of Overt and Covert Censorship .........42\nPart Six: Legislative and Regulatory Solutions to Techno-Tyranny .......................................53\nAbout the Author ................................................................................................................59\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/?Latest\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F/Censorship-Master-Plan-Decoded.zip",
			"added": 1532111684
		}
	],
	"topic_vote": {
		"1513519731_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": 1,
		"1532111686_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1513519731_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": [
			{
				"comment_id": 1,
				"body": "Currently we're building the organization looking for people who play Star Citizen or Space Engineers. Currently we're renting a server for Space Engineers and have assets in there. It's slow going but we're making progress. Star Citizen isn't even out and I'd like to see us \"established\" before the game launches.",
				"added": 1513632640
			},
			{
				"comment_id": 2,
				"body": "\"Undercover Federation work?\" \n\nThink space pirates lol",
				"added": 1513632804
			},
			{
				"comment_id": 3,
				"body": "If you have a mic we also have a public discord. Currently thinking of how to include that info on the site. Here is the invite link. It's a public channel with people signed up but not that many active your welcome to join though.\n\nhttps://discord.gg/BVt4ZGT",
				"added": 1513637021
			},
			{
				"comment_id": 4,
				"body": "> [james007](#comment_136_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Discord is the antithesis of decentralization and privacy. Better off to use Mumble.\n\nThat's a good idea I'll have to check into it.",
				"added": 1514445061
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_135_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Change title from myZeroTalk to Section 13 and it is ok.\n\nI've been updating the site it's got a better forum section on there now and other background tweaks. Also I did change the title : )",
				"added": 1514445122
			},
			{
				"comment_id": 6,
				"body": "> [xsmith322](#comment_4_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F): That's a good idea I'll have to check into it.\n\nAfter thinking about it we decided to keep it and perhaps phase it out when it becomes unnecessary. The games we officially support already have voice communications in them. In the case of Star Citizen voice is a planned feature we'll just need to wait on till it gets developed. For now discord serves it's purpose of organizing people and it's been used to connect members to our RetroShare node. It has added value but like I said it may not even be necessary at some point. RetroShare already has video/voice conferencing capabilities which are limited but may improve over time. I've tested it out and have been able to get the plugin to work. I'm not sure if you could add multiple people to the call but that can also be explored.",
				"added": 1514509027
			}
		],
		"1532111686_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": [
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_371_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I add more details what is in that .pdf: [...]\n\nAwesome thank you, I've updated the post with your changes. This needs to be distributed to your local higher education centers ( i.e. SJW Colleges/Institutions )",
				"added": 1532116411
			}
		]
	},
	"comment_vote": {
		"4_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": 1,
		"136_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"1_1NJFTsPTSkL6HRn3Pi8X9mxhuL47UB91WU": 1,
		"1_18YwvP36gwZKnk1KfQ8Rb3ca8xJpuzJBPo": 1,
		"6_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": 1,
		"7_1FFMmVeZe5E8yhkPxtn3ndZhrW8J8Vbq1F": 1
	}
}