{
	"next_topic_id": 10,
	"topic": [],
	"topic_vote": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": 1,
		"2_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": 1,
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"6_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"4_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": 1,
		"7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"3_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1,
		"8_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": 1
	},
	"next_comment_id": 64,
	"comment": {
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/userzero@zeroid.bit",
				"added": 1471269545
			},
			{
				"comment_id": 7,
				"body": "Sólo cuatro usuarios suben torrents, parece que si no hay un sistema de puntos, subir de categoría u otro tipo de compensación económica/social/etc la gente no hace nada",
				"added": 1471723964
			},
			{
				"comment_id": 9,
				"body": "> [dios](#comment_9_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z): yo creo que si, los puntos, el karma, la fama, etc es recompensa y no hay mejor recompensa que el dinero\n\nNo creo que el dinero sea indispensable, en Kickass y otras webs había muchos uploaders y no te daban dinero. Pero sueles subir de categoría, ganas puntos, tienes derecho a pequeñas ventajas o privilegios, tu labor es verificable y reconocida. Aquí no se sabe ni cuantos torrents hay, ni cuantos ha subido un usuario en particular,...No se sabe quienes contribuyen, aportan,  ni quienes simplemente \"parasitan\"",
				"added": 1471773706
			},
			{
				"comment_id": 10,
				"body": "> [rapapobre](#comment_45_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): si y no, para mi personalmente, si una red no aporta nada, puede proponer lo q quiera pero eso es forzar a los users a permanecer en un entorno monetizado y q no desean, no por la monetizacion, sino pq no responde a intereses atractivos; habria muchos q si, pero otra inmensa mayoria q no, no por el dinero sino por no conocer el entorno ya q no atrae: a eso se le llama comunidad q persigue un ideal (como en KAT); si no existe un entorno complejo donde abale eso q dices de \"dinero, fama, etc\" entonces puedes esperar sentado, primero se priorizan unas cosas y despues otras(ganar dinero en un site abandonado?); y el tema en si(si has seguido la conversacion), no se hablaba de dinero como algo \"positivo\" sino en negativo, como recurso para cazar redes no indexadas como esta; es decir, el dinero es un bien invasivo, pq? pq ofrece justamente lo contrario, la exclusion.Basicamente, pensar q todo esto puede ser monetizado, no es el problema; sino solidarizar a los users para crear un entorno sano primero y despues introduce todo los caramelos que quieras pero no como reclamo! sino como proyecto de intereses ; claro esta, tiene mas dificultad lo 2º que lo 1º; pero es un hecho q solo 4-5 tipos estan haciendo algo, y es justo eso, de forma desinteresada lo q mas me atrae como user. Es muy facil decir: \"el dinero es el problema/solucion\",  pero visto lo visto, yo mismo, como usuario, relacionar el dinero con algo positivo, es solo en contadas ocasiones y q por lo general no lleva a contenidos interesantes sino todo lo contrario: a discurso masticado.\n\nTotalmente de acuerdo, yo he colaborado en muchos proyectos y nunca he cobrado un euro, es más si en Zeronet se asigna/paga/cobra algún dinero abandonaré el proyecto.\nYo sólo quiero saber cuantos torrents hay, cuantos he subido yo, en que fechas, cuantos otros, modificarlos,...pero no por los demás sino por mi mismo.  : )",
				"added": 1471782497
			},
			{
				"comment_id": 13,
				"body": "> [rapapobre](#comment_46_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): yo solo espero q cuando vayan a manipular zerotorrent(si es q lo hacen), para hacerlo mas completo, no se vaya todo el contenido al traste XD\n\nYa te digo XD",
				"added": 1471798040
			},
			{
				"comment_id": 16,
				"body": "> [riotpulv](#comment_9_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): jajajaja yo creo que eres un tipo mamón y que estás un poco perdido amigo :)\n\nyo creo que le puedes rebatir sin insultar",
				"added": 1472195796
			},
			{
				"comment_id": 23,
				"body": "> [thekiller66](#comment_4_18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx): Oye dude, emm, alguien sabe a quien pertenece la pagina de \"zerotorrents\"? Digo, podrian pedirle que les comparta el codigo y que los usuarios lo mejoren, digo, si eso es posible, esto para todas las webs que aun necesitan muchas cosas (por ejemplo ZeroMe).Perdonen si mi idea suena descabellada :'v\n\nTotalmente de acuerdo, es imprescindible mejorarla : busquedas avanzadas, más categorias, fecha de creación del post para saber cuanto tiempo lleva, tamaño, valoración, estadísticas, poder actualizar trackers en post, calidad, imágenes, etc, etc, etc",
				"added": 1472655703
			},
			{
				"comment_id": 29,
				"body": "> [dios](#comment_11_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z): http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/19D4EHbgiKPCAR1aR75Ei4RXSuAmFHwK2G/dios@kaffie.bit\n\n??? no sale nada importante",
				"added": 1473098136
			}
		],
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/\nZeroTalk con imágenes\nY es que una imágen dice más que mil palabras  : P",
				"added": 1471348963
			},
			{
				"comment_id": 60,
				"body": ".",
				"added": 1477867634
			}
		],
		"3_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/ZeroTorrent.bit/?Home\nLa web de torrents falla mucho al sacar el enlace magnet o el .torrent, aconsejo, para no estar perdiendo el tiempo, al publicar los torrents pegar el enlace magnet en la categoría \"Magnet link\" y además en la de \"Torrent description\"\n\nEl fallo ocurre principalmente usando el navegador TOR y en Firefox. El navedor Chrome y Slimjet van mucho mejor.",
				"added": 1471392288
			},
			{
				"comment_id": 21,
				"body": "https://katcr.co/\n\nKICKASStorrents\n\"As of July 30th KAT does not support torrents. We are also not changing how we run or operate. We have nothing to hide because we aren't doing anything thing wrong.\n\nWith that and after talking with Mr.Prairi3DoG please no more threads or post asking to change how we do things. Please no more threads/posts asking to use zeronet. Admins have already said no to this idea. That's a standing decision for now and the future for a while. If and when things change they'll let us know them. They'll explain them to us. We have to trust them that they are doing the best and doing what is right by us. In the end KAT will be back even better, but it's going to take time. So let's focus on the community for now.\"\n\nA 30 de julio de KAT no soporta torrents. Tampoco estamos cambiando la forma en que corremos ni operamos. No tenemos nada que ocultar, porque no estamos haciendo nada malo cosa.\n\nCon eso y después de hablar con Mr.Prairi3DoG Por favor no más hilos o mensajes pidiendo cambiar la forma en que hacemos las cosas. Por favor, no más hilos / mensajes pidiendo que utilizemos zeronet. Administradores ya han dicho que no a esta idea. Esta es una decisión que se coloca para el presente y el futuro por un tiempo. Si y cuando cambian las cosas nos dejan los conocemos. Ellos explican a nosotros. Tenemos que confiar en que ellos están haciendo lo mejor y lo que es correcto para nosotros. Al final KAT estará de vuelta aún mejor, pero va a tomar tiempo. Así que vamos a centrarnos en la comunidad por ahora.",
				"added": 1472473153
			},
			{
				"comment_id": 37,
				"body": "Critical security notice - Transmission\n\nQ. What happened?\n\nA. It appears that on or about August 28, 2016, unauthorized access was gained to our website server. The official Mac version of Transmission 2.92 was replaced with an unauthorized version that contained the OSX/Keydnap malware. The infected file was available for download somewhere between a few hours and less than a day. Additional information about the malware is available here and here.\n\nQ. What steps have been taken following the incident?\n\nA. The infected file was removed from the server immediately upon discovering its existence, which was less than 24 hours after the file was posted to the website. To help prevent future incidents, we have migrated the website and all binary files from our current servers to GitHub. Other services, which are currently unavailable, will be migrated to new servers in the coming days. As an added precaution, we will be hosting the binaries and the website (including checksums) in two separate repositories.\n\nQ. Am I at risk?\n\nA. The infected file was available for download from our website for less than a day, and the file was not available through the auto-update mechanism. Steps to check for, and remove, an infection are available here.\n\nQ. Can you share any more information about this incident?\n\nA. We are in the process of investigating the incident and will share any relevant information that we discover here.\n\nP. ¿Qué ha pasado?\n\nA. Parece que aproximadamente el 28 de de agosto de, 2016, acceso no autorizado fue adquirida a nuestro servidor web. La versión oficial para Mac de Transmisión 2,92 fue reemplazado por una versión no autorizada que contenía el malware OSX / Keydnap. El archivo infectado estaba disponible para su descarga en algún lugar entre unas pocas horas y menos de un día. Información adicional sobre el malware está disponible aquí y aquí.\n\nP. ¿Qué medidas se han adoptado tras el incidente?\n\nA. El archivo infectado se elimina del servidor inmediatamente después de descubrir su existencia, que era menos de 24 horas después de que el archivo se ha publicado en el sitio web. Para ayudar a prevenir futuros incidentes, hemos migrado el sitio web y todos los archivos binarios de nuestros servidores actuales a GitHub. Otros servicios, que actualmente no están disponibles, se migrarán a nuevos servidores en los próximos días. Como precaución adicional, será el anfitrión de los binarios y el sitio web (incluyendo las sumas de comprobación) en dos lugares de almacenamiento separados.\n\nP. ¿Estoy en riesgo?\n\nA. El archivo infectado se puede descargar desde nuestro sitio web por menos de un día, y el archivo no estaba disponible a través del mecanismo de actualización automática. Pasos para verificar y eliminar, una infección están disponibles aquí.\nhttp://transmissionbt.com/keydnap_removal/\n\nP. ¿Se puede compartir más información acerca de este incidente?\n\nA. Estamos en el proceso de investigar el incidente y compartiremos ninguna información relevante que descubrimos aquí.",
				"added": 1473320939
			},
			{
				"comment_id": 40,
				"body": "D.E.P                           ZeroTorrent.bit/\nhttp://127.0.0.1:43110/ZeroTorrent.bit/?Home",
				"added": 1473633717
			},
			{
				"comment_id": 47,
				"body": "New ZeroTorrent - Unlimited Version \nhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Home",
				"added": 1473940480
			},
			{
				"comment_id": 48,
				"body": "> [userzero](#comment_47_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk): New ZeroTorrent - Unlimited Versionhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Home\n\nVeo que ya le empiezan a clonar \nhttp://127.0.0.1:43110/18szrC8my99LwU2Ufkcjef6nbjRymKaGJY/?Home",
				"added": 1473944332
			}
		],
		"5_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": [
			{
				"comment_id": 4,
				"body": "Problemas en Tor y Firefox",
				"added": 1471393214
			}
		],
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 5,
				"body": "Actualización Zeronet 0.4.0 Rev.1422\n¿Cómo actualizar?\nVas a https://github.com/HelloZeroNet/ZeroNet\nPulsas en el botón verde: Clone or download >  Download Zip\nLo extraes. Copias todo el contenido de ZeroNet-master y lo pegas en la carpeta Zeronet (del viejo).\nTe pregunta Windows ¿Desea reemplazar el archivo en el destino?. Reemplazar todos\nArrancar como siempre desde zeronet.cmd",
				"added": 1471445350
			},
			{
				"comment_id": 12,
				"body": "Actualización Zeronet 0.4.0 Rev.1424",
				"added": 1471783205
			},
			{
				"comment_id": 17,
				"body": "Actualización Zeronet 0.4.0  Rev1426",
				"added": 1472222330
			},
			{
				"comment_id": 25,
				"body": "Actualización Zeronet 0.4.1, Rev1501",
				"added": 1473008063
			},
			{
				"comment_id": 27,
				"body": "https://es.wikipedia.org/wiki/ZeroNet",
				"added": 1473030870
			},
			{
				"comment_id": 28,
				"body": "Configurar Zeronet con Tor en GNU/Linux\nhttp://www.retzner.net/configurar-zeronet-tor-gnu-linux/",
				"added": 1473032042
			},
			{
				"comment_id": 30,
				"body": "Actualización Zeronet 0.4.1, Rev1509, Fix site delete",
				"added": 1473157380
			},
			{
				"comment_id": 31,
				"body": "Actualización Zeronet 0.4.1, Rev1510",
				"added": 1473182312
			},
			{
				"comment_id": 35,
				"body": "Tutorial por icf20 para personalizar tu web clonada\nhttp://127.0.0.1:43110/1JfpEppAtZJZo3rVZQGjYDpkn2gcwGTJn/?Post:3:Modificar+el+clon+de+zerotorrents.bit",
				"added": 1473248125
			},
			{
				"comment_id": 36,
				"body": "Esta pequeña aplicación nos resolverá algunos problemas en la carga de Zeronet y sus webs (navegador Chrome)\n\nhttps://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop\n\n\nZeroNet Protocol\nZeroNet Protocol helps you to browse ZeroNet websites without http://127.0.0.1:43110\nFor example, after installing this extension you can access ZeroNet websites like:\n\nhttp://zero/1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr\nhttp://zero/1GamESVFyJfkmbxtcrLR2VX4m4VFmwyeRY\n\nSounds cool?\n\nAlso code is open source: https://github.com/goldenratio/zeronet-protocol-crx",
				"added": 1473248317
			},
			{
				"comment_id": 45,
				"body": "ZeroMods\nhttp://127.0.0.1:43110/1JjHyLeEDidHyyN33Y8f8cQKVEzWCEPnW7/",
				"added": 1473732458
			},
			{
				"comment_id": 46,
				"body": "Nofish me ha confirmado el tema de cómo quitar las limitaciones : you can change the limits in data/users/content.json file. (you have to sign and publish this file after every changes)\n\nFácil de cambiar utilizando el programa Atom.\nAnímense a clonar webs y personalizarlas, este es el auténtico punto fuerte de Zeronet ¡Pero no olviden quitar las limitaciones \"de fábrica\" antes de publicar.",
				"added": 1473940289
			},
			{
				"comment_id": 49,
				"body": "Fijar un hilo.(Stickied)\nEjemplo queremos fijar este hilo:\nhttp://127.0.0.1:43110/1ArzJQzPVdxdHCZcGjTfD6VAKPdSaSmiu6/?Topic:37_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/+Requests+Peticiones+Post+your+request+here+and+mind+to+give+as+much+info+as+will+be+helpful+to+find+it+title+edition+isbn+author+etc\n\n\nEn settings del content.json ponemos:\n\n  \"topic_sticky_uris\": [\n   \"37_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk\"\n  ]",
				"added": 1474125340
			},
			{
				"comment_id": 53,
				"body": "Añadir enlaces en tu recuadro de Zerome.\nEjemplo:\n+(dejas un espacio)Nombre de la web entre corchete(enlace link de web entre paréntesis)",
				"added": 1474326336
			}
		],
		"2_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": [
			{
				"comment_id": 6,
				"body": "Failed to initialize the demo!\n\nwebgl not supported, try upgrading your browser or graphics drivers http://get.webgl.org",
				"added": 1471541208
			}
		],
		"5_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 8,
				"body": "He clonado \"Zerotalk with images\" para hacer esta web pero no me deja subir imágenes ni poner comentarios, ni nada. Esta todo el rato \"Loading...\"\nSi intento poner un nuevo  NEW POST me sale \"Content sign failed: invalid private key\"\n¿Cuál es el error? Zeronet presume del sistema de clonación pero no veo que funcione muy bien. La paciencia no es eterna... : (",
				"added": 1471724402
			},
			{
				"comment_id": 11,
				"body": "Nofish · nofish@zeroid.bit ― 1 minute agoReply\n@Userzero: Probably that site is not ready for cloning",
				"added": 1471782604
			}
		],
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 15,
				"body": "Saludos tere",
				"added": 1472195252
			},
			{
				"comment_id": 24,
				"body": "Saludos abiky",
				"added": 1472655749
			}
		],
		"6_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 18,
				"body": "¡Mi trabajo desapareció! Más de un 60 % borrado. Put. mierda",
				"added": 1472224410
			},
			{
				"comment_id": 19,
				"body": "\"usado: 38.9k/40k\nYou are running out of your allowed space, please contact the site's admin at raito to raise your limit\"\n\nPero antes ponía el mismo mensaje y salían correctamentre.",
				"added": 1472251727
			}
		],
		"4_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 20,
				"body": "Gracias a los que responden",
				"added": 1472378132
			},
			{
				"comment_id": 26,
				"body": "Los Meizu están muy bien de precio y características",
				"added": 1473008741
			},
			{
				"comment_id": 41,
				"body": "> [bru](#comment_1_1QKALTkDmKyTC5L7mZZu6R8ARLmrRfiAhL): ¿Ya pensaste en algún Google Nexus?\n\nDicen que están bien pero mi idea era no gastarme mucho dinero. Los expertos dicen que con los procesadores, memoria y otras características actuales  el mercado ya tiene suficiente para un uso normal y el futuro está ampliar las funcionalidades del móvil mediante sensores y conseguir una sensación de \"realidad aumentada\". Pueden comprobar que muchas marcas no incluyen muchos sensores para abaratar los móviles. Ahora mismo no deberían bajar de 7 en un móvil nuevo, de los económicos sólo Meizu con el M3 y Xiaomi Redmi Note Pro los incluyen.",
				"added": 1473680996
			}
		],
		"7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 22,
				"body": "Con la persecución a los usuarios de las distintas industrias audiovisuales y leyes como la Ley Sinde o la Ley Hadopi, muchos usuarios han decidido pasarse a los SeedBox y a los servidores dedicados para poder intercambiar archivos mediante P2P como Bittorrent.\n\n                                                                         ¿Qué es un SeedBox?\n\nUn SeedBox es un servidor para la descarga y subida de archivos mediante P2P, normalmente casi todos ellos usan el protocolo Bittorrent. Los archivos se bajan al disco duro del SeedBox, y nos los descargamos a nuestro hogar mediante conexiones SSL o SFTP (Filezilla), conexiones cifradas para proteger nuestra privacidad.\n\nLos SeedBox pueden ejecutarse en sistemas operativos Windows o Linux, tienen altas velocidades de descarga y de subida (perfecto para los trackers privados de Bittorrent donde el ratio es importante). Si queremos tener Windows deberemos pagar la licencia, por eso lo más usado son los Linux Ubuntu Desktop.\n\n*Seedbox no dedicado (compartes el uso de la máquina con otros usuarios)\n\nEn estos SeedBox únicamente podremos usar cliente Torrent (normalmente se instala Rutorrent (también Deluge o Transmission) al que se tiene acceso remoto vía web con el navegador) y pocas funciones más (acceso por SFTP y en algunos casos VNC).\n\nDependiendo de qué servidor contratemos, tendremos unas características u otras.\n\n*Sin embargo también podemos contratar servidores dedicados donde tenemos un completo sistema Ubuntu-Linux (o cualquier otra distribución) como si estuviéramos en nuestro hogar.\n\nLos pagos se realizan por Paypal u otros sistemas de pago electrónico  ( también con transferencias bancarias o tarjeta de crédito) y pueden ser mensuales, trimestrales etc. Desde que se realizan los pagos hasta que el servidor está activo pasan unas horas ( no siempre), y cuando esté todo listo te mandan un email con todos los datos para entrar al servidor.\n\nAntes de contratar un Seedbox hay que pensar el uso que se le va a dar y el dinero que estamos dispuestos a gastarnos (desde unos 8€ los más sencillos en adelante).\nTodos aceptan trackers privados sin problemas pero muchos no permiten los trackers públicos.\n\nComparación entre empresas (actualizado):\n\nPublic trackers (actualización):\n\n-lbseed.es\nSí (pero sin pasarse). Descarga ilimitada. Precios económicos\n-kaosbox.net\nWe do allow public trackers on our Seedbox, but the torrent is automatically stop when completed 100%.\n-alphaseedbox.com\nPermitido\n-seedblaze.com\nPermitido\n-seedbox.fr\nPermitido?\n-superseedbox.co.uk\nProhibidos\n-swizards.net\nProhibidos\n-vpsdime.com\nProhibidos\n-theworldservers.com\nProhibidos\n-blackwidowhosting.com\nSí se puede descargar desde rastreadores públicos, pero hasta completar.\n-idfnv.com\nPermitidos.(Precios muy económicos pero cobran de tres en tres meses. Cobran unos 5 € por instalación. Servicio técnico desaparecido. Servicio de facturación sospechoso)\n-Pulsedmedia.com\nPermitidos\n-meggafast.com\nPermitidos\n-evoseedbox.com\nPuede descargar torrents públicos y detener el torrent, no se permite la carga.\n-cheapseedboxes.com\nDescargas no tienen límite, pero las subidas de los registradores públicos está suspendida.\n-rapidseedbox.com\nNosotros apoyamos rastreadores públicos en nuestra Seedbox, siempre y cuando no se abuse de ancho de banda.\n-seedstuff.ca\nMuy limitado\n-seedboxbay.com\npublic and private trackers are allowed.\n-seedbox.me\npermitidos\n-seedhost.eu\nPermitido (Muy rápidos y con un montón de extras SABNZBD, Rapidleech, Bittorrent Sync, Transmission, Deluge, Sickrage , Couchpotato, Madsonic, Subsonic...). Pero tienes, según el plan contratado, un límite de subida de un determinado número de TB. Sobrepasado se reduce bastante la velocidad de subida hasta el próximo mes o puedes comprar un bono extra . Si subes mucho te lo comes en cinco días, eso sí, el servicio técnico es muy bueno)\n\n*** Truco: Normalmente con Transmission se notan menos las limitacíones de los proveedores\n-tal0ne.co.uk\nUnmetered download\n1MB/s upload and 2.0 ratio\n-leechdrive.com\nUnmetered download\n1MB/s upload and 2.0 ratio\n-seedbox.io\nThe use of public trackers is allowed but on a limited basis. All public torrents will automatically be stopped once one of the following conditions has been met:\n\nThe sharing ratio has exceed 2\nThe torrent has been seeding for more than 2 hours (not including download time)\nThe torrent has been active for more than 24 hours (included download time)\n\n-ultraseedbox.com\nSe permite la descarga, la carga (siembra) en trackers públicos se detiene una vez que es completado.\n-tuvixhosting.com\nPermitido.\n-whatbox.ca\nsi?\n-seedboxes.cc\nPermitidos\n-seedboxco.net\nPermitidos (Recomendable)\n-yourseedbox.com\n?\n-flameboxes.com\nPermitido (A veces falla)\n-feralhosting.com\nPermitido (El mejor. Instalación instantanea. Super rápidos 10 Gbps, estables. Con extras gratuitos: Deluge, Transmission,...(aunque menos que seedhost.eu), sin limites y servicio técnico excelente (aunque no te permite resetearlo). No es el más barato pero si se valora en conjunto tiene una excelente relación calidad-precio) Con VPN\n-box4seed.com\nPermitidos ( Tiene unos precios super-competitivos. Por el precio de un Seedbox simple, aquí puedes contratar un Dedicated Seedbox. Pero claro no es el más rápido y estable del mercado) ¡CERRADO!\n-hostdzire.com\nLimitado\n-superseeder.eu\nLimitado\n-dediseedbox.com\nLimitado",
				"added": 1472474362
			}
		],
		"8_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 32,
				"body": "> [icf20](#comment_13_1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5): No he podido resistirme al web tu clone y he escrito un tutorial http://127.0.0.1:43110/1JfpEppAtZJZo3rVZQGjYDpkn2gcwGTJn/?Post:3:Modificar+el+clon+de+zerotorrents.bit\n\nok, pero no consigo cambiar el nombre con Atom",
				"added": 1473203180
			},
			{
				"comment_id": 34,
				"body": "Muy bueno, ya reemplazé C<br/>L<br/>O<br/>N<br/>E<br/>- <br/>M<br/>E  por  ZeroLanguages\n\n\nQueda así (tal vez esto sirva como ejemplo para otras personas):\n\n<!-- Head -->\n<div class=\"head\">\n<a class='logo nolink' href=\"?Home\"> ZeroLanguages\n\n</div>\n<!-- EOF Head -->\n\n\n----------------------------------------------------\nCreo que reparé lo del content.json",
				"added": 1473243649
			},
			{
				"comment_id": 43,
				"body": "Mejor así:\n\n<!-- Head -->\n<div class=\"head\">\n<a class='logo nolink' href=\"?Home\">Z<br/>E<br/>R<br/>O<br/>- <br/>L<br/>A<br/>N<br/>G<br/>U<br/>A<br/>G<br/>E<br/>S</a>\n</div>\n<!-- EOF Head -->",
				"added": 1473682786
			}
		],
		"3_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": [
			{
				"comment_id": 33,
				"body": "Muchas gracias",
				"added": 1473243135
			}
		],
		"1_18782hkwUUVCC4QormwpLxyMuj9mhD52Fj": [
			{
				"comment_id": 38,
				"body": "http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3/?Topic:1656_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk/Mutant+Year+Zero+pdf+39+0+MB\n\nSólo encontré Mutant Year Zero",
				"added": 1473355608
			}
		],
		"1_13bJknLwBVJ4nmEHLqovNhzyD8wVA6ez6C": [
			{
				"comment_id": 39,
				"body": "sí, es visible",
				"added": 1473420421
			},
			{
				"comment_id": 59,
				"body": ".",
				"added": 1477867603
			}
		],
		"2_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 42,
				"body": "De momento ZeroTorrent.bit ya ha muerto, no existe un digno sucesor, no se están creando muchos clones de webs, personalizándolas y añadiendo contenidos nuevos, Zerome la red social no acaba de despegar, el creador de Zeronet es un sólo usuario y no parece tener tiempo para hacer actualizaciones de gran calado, el streaming novedoso no funciona/es el de toda la vida/o hay alternativas mejores y más privadas,.....",
				"added": 1473681358
			},
			{
				"comment_id": 58,
				"body": ".",
				"added": 1477867569
			}
		],
		"9_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 44,
				"body": "Kopy Kate - A decentralized YouTube alternative\n\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/",
				"added": 1473731539
			}
		],
		"1_18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx": [
			{
				"comment_id": 56,
				"body": ".",
				"added": 1477867499
			}
		],
		"1_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 57,
				"body": ".",
				"added": 1477867542
			}
		],
		"8_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 61,
				"body": ".",
				"added": 1477867670
			}
		],
		"2_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": []
	},
	"comment_vote": {}
}