{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1_1Bgv1ZZhGXq2218TpsDE1oudW1ExZBbQZS": [
			{
				"comment_id": 1,
				"body": "Quelqu'un sait si on est anonyme ici ? On peut remonter jusqu'à nous depuis notre pseudo ?\n\nC pour un pote.",
				"added": 1556656846
			}
		],
		"1_19AjK43a3DvLCEfmcrLx9XBpTQg1Kc6BS4": [
			{
				"comment_id": 2,
				"body": "Je suis Gj depuis le début, et j'apprécie beaucoup le discours de Juan Branco. Il a les bons mots. En revanche, je m'interroge sur sa soudaine ascension et sa promotion permanente dans les médias.\n\nIl y a un autre aspect qui me rend méfiant : il a d'abord été avocat de la plus grande figure des Gj, Fly Riders, avant de devenir son conseiller, puis il l'a accompagné sur tous les plateaux télé, et maintenant il l'a quasiment remplacé...\n\nDe plus, il sort de Science Po, c'est un ancien protégé de Descoings (anti France notoire), il a été conçu et modelé par et pour le système. Bref, probabilité qu'il soit là pour s'accaparer le mouvement et le donner aux élites : très élevé. Rappelons nous de Cohn Bendit qui a joué ce rôle pour mai 68.\n\nCependant je mise toujours sur son honnêteté et j'apprécie beaucoup l'écouter. Si c'est un infiltré, on l'apprendra un jour.",
				"added": 1556699157
			},
			{
				"comment_id": 3,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_2_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): de plus, il ne veut pas parler de complots-ni de franc-maçons...\"ça provoque des théories complotistes\" dit-ilhttps://invidio.us/watch?v=l0GzZZZGsBchttps://invidio.us/watch?v=XSj056p-dEY\n> https://invidio.us/watch?v=XAeVC-pkuTAhttps://invidio.us/watch?v=GVpFvIVwX3o\n> lol quand on sait qui est Descoings.\n\nMerci pour les vidéos, j'ai beaucoup appris.",
				"added": 1556726833
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_3_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): de rien.le nerf de la guerre est la franc-maçonnerie (l'état dans l'état). peu de gens le savent mais la création de la république est maçonnique, les gens ont dans l'idée que 1789 était une révolution populaire mais n'était qu'une agitation du peuple pour le faire bouger vers une république, et torpiller les corporatismes (et la royauté+église) qui assurait 'le pouvoir temporel'. nous sommes passé dans le temps de l'immédiat et dans l'illusion d'une démocratie.c'est d'ailleurs pourquoi 230 ans après (Notre-Dame) les franc-maçons continuent de détruire les valeurs plus les corporatismes, sachant que Notre-Dame ne sera pas reconstruite par le corps de métier des ouvriers des cathédrales.Tout est twisté à 180° dans la réalité que nous vivons.\n> Et les gilets jaunes ont été mis dans les rues comme ils ont été mis dans les rues comme dans le passé, tout ça est une pantomime, une mise en scène:https://invidio.us/watch?v=8yBKGq3jtrchttps://invidio.us/watch?v=r2hm0wQRRiE?? des black blocks qui seraient venus avec un cygne noir, comment ils ont pu déplacer sans se faire arrêter un tel truc.Les gens sont naïfs au delà de toute raison.\n\nEt une fois que l'on sait tout cela on fait quoi ?",
				"added": 1556805666
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_4_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): les changements de pouvoir se sont toujours fait par une minorité, quelques dizaines d'individus.l'horizontalité ou cette pauvre démocratie est un feu de paille, ça n'a jamais existé que dans les livres.\n> Mais il ne faut pas désespérer, à un moment ou l'autre, ça finira par se retourner contre eux.\n> À l'époque L'Église veillait au grain et supprimait toute dissidence (loges et sociétés secrètes), et même dernièrement (siècle dernier) Pétain a fait supprimé toutes les loges et confisquer biens et archives (plus imprimer la liste des franc-maçons sur le Journal officiel lol).Tout ou tard la vapeur s'inversera tant le système maçonnique; démocratie et libéralisme est non viable. De toute façon les peuples du monde entier ne sont pas prêt de se laisser dicter leurs sorts par une minorité. Donc patience. Tout ou tard ça tombera.\n\nJe ne te cache pas que c'est toujours ce qui me rend prudent vis à vis de ceux qui vont pointer la franc maçonnerie et autres systèmes souterrains. J'aime bien entendre le fruit de leurs recherches, mais chaque fois que l'on arrive aux solutions, c'est la passivité, il faut attendre, ça viendra tout seul, là tout de suite surtout ne faisons rien car en face ils sont beaucoup trop gros et trop forts. J'ai envie de dire : si le système devait organiser sa propre dissidence, il ne pourrait rêver mieux comme état d'esprit que celui-ci ! A part ce point merci pour les infos",
				"added": 1556990228
			},
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_6_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Fais ta propre introspection, et réalise que tout ce que tu viens de dire ne s'adresse pas à moi.\n> C'est précisemment parce que tu n'as pas évacué cette petite mentalité bourgeoise provincialiste individualistique maçonnique,que tu as l'air (que tu penses) être différent d'un autre.\n> Sache que le luciférianisme maçonnique n'est rien d'autre (:un culte de l'individualisme, de la personnalité*). Mais je suppose que tu sais mieux que moi ce qu'il faut faire.\n> Mais merci de m'avoir répondu lol.\n> \n> personnalité qui n'a aucun fondement biologique.\n\nMon propos ne s'adressait effectivement pas à toi, mais comme je l'ai dit à ceux qui parlent sur internet de systèmes souterrains surpuissants et qui, dans le monde réel, ne se bougent jamais ou ne proposent jamais de d'actions concrètes. Mais tu n'en fais sûrement pas partis car je sais très bien que tu luttes dans le monde réel même si tu ne veux pas en parler par modestie. Quoi qu'il en soit merci pour le partage.",
				"added": 1557150584
			},
			{
				"comment_id": 7,
				"body": "> [ilitch](#comment_4_19AjK43a3DvLCEfmcrLx9XBpTQg1Kc6BS4): C'est interessant. Surtout le lien du CNC. Ce qui est encore plus interesstant c'est la difference de comprehension de cette meme information. Je t'invite a bien regarder la liste des beneficiaires et a t'interoger sur le role du CNC et cela avant de courir sur des racourcis ridicules. Ceci dit le timing, ce soir, est interessant. Je viens de lire tes commentaires sur un autre thread du ZeroTalk Anglais (The Gentleman’s Guide To Forum Disruption) et du coup je ne peux m'empecher de sourire. Ce qui compte c'est justement de laisser chacun s'interoger et digerer ces informations pour se forger ses propres opinions. Et la bonne nouvelle pour toi, c'est que je n'ai rien contre les gens qui justement postent des conneries. Et tu sembles avoir de grandes dispositions a cela.Tant que cela permet de generer une reflexion ce n'est deja pas si mal.\n\nConcernant l'histoire de l'avocat, je rejoins totalement l'avis de h3bhkj5gqz4n3pjm. Mélenchon n'est pas la mère Michel ou le terroriste du coin, il connait probablement des centaines d'avocat et ça me paraît évident que pour un poste aussi important (l'avocat est amené à connaître tous les petits secrets et les petites magouilles), il a choisi quelqu'un de parfaitement fidèle sur tous les plans, moral comme idéologique.",
				"added": 1557313258
			}
		],
		"2_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 8,
				"body": "Je connais aussi Youtube Vanced qui est génial. C'est exactement l'appli youtube mais avec les fonctionnalités premium, et tu peux même garder tes abonnements",
				"added": 1598039196
			}
		],
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 9,
				"body": "Y'a beaucoup de trucs qui ne vont pas en France, mais l'interdiction des drogues est une bonne chose. Quand je vois ces drogués, de vrais déchets qui ne bougent du canapé que pour aller acheter leur beuh avec l'argent du RSA, je em dis que la France devrait être beaucoup plus sévère que ça. La drogue est un vrai fléau qui détruit les vies des gens qui en consomment.",
				"added": 1598039445
			},
			{
				"comment_id": 10,
				"body": "Ouais bien sûr, je connais ce discours qui vise à comparer le cannabis avec d'autres drogues encore plus merdiques pour faire passer l'idée: \"hey, tu vois y'a pire, le cannabis c'est pas si mal ;)\". Le plus drôle c'est les témoignages \"je m'en suis sorti grâce au cannabis <3\". Enfin, ça serait vraiment drôle si ça pouvait pas pousser de jeunes ado à tomber dedans.\n\nIl peut y avoir quelques cas particuliers c'est vrai, mais 99% des usages c'est des gars normaux qui deviennent des déchets en tombant dans la drogue, exta, meth, cannabis, etc, et qui ensuite vont s'inventer des histoires et même une pseudo culture pour justifier le fait qu'ils sont devenus des déchets.\n\nEt je parle en connaissance de cause. Je me suis fait avoir ainsi qu'une bonne partie de mes potes. On a cru les discours gentillets du style \"oh tu sais, le cannabis c'est une drogue douce\", \"tu arrêtes quand tu veux\", \"c'est récréatif\". Résultat: 3 ans de mes jeunes années perdues. :)\n\nAujourd'hui je m'en suis sorti, et tous mes potes qui ont arrêté le cannabis s'en sortent, et tous ceux qui ont continué à se droguer en mode \"tkt c'est qu'un joint\", bah 10 ans après ils sont encore au RSA à se branler sur leur canapé, à parler de cannabis toute la journée.\n\nLes seuls fois où je vais les voir, je vois le dégoût d'eux mêmes dans leur yeux. Ils ont parfaitement conscience de voir leur vie défiler sans eux, d'être des déchets malgré toutes les histoires qu'ils s'inventent. Ca me rend malheureux pour eux. Mais quand je leur parle d'arrêter le cannabis, ils s'étonnent, ils se braquent, s'énervent, me disent qu'ils arrêtent quand ils veulent (alors qu'ils fument depuis 15 ans !!), que c'est pas ça le problème et tous les poncifs habituels.\n\nIls ont parfaitement intégrer les discours faisant l'apologie du cannabis. Des esclaves qui protègent leur cage mental avec férocité.\n\nEnfin bref, aujourd'hui tout ça est derrière moi, je m'en sorti et j'invite tout le monde à ne JAMAIS laisser passer les discours complaisants sur les drogues. Car même si vous, vous savez que le cannabis et autres drogues détruisent des vies, d'autres plus naïfs pourraient les croire et tomber dans cette merde pour des années.",
				"added": 1598228933
			}
		]
	},
	"comment_vote": {
		"1_1NUiRgkdv1kwBZFmyi3NrbDD2QBk6MARij": 1
	}
}