{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1611752946,
			"title": "Urgent, the zeronet prompts: your network even accept restrictions.Please open port 38106 on your router Make sure your site is accessible to everyone..",
			"body": "Hi all, i cloned a site on zeronet(just like zerotalk), it worked fine  until this afternoon. i find i can not  publish suddenly .  the system prompts: your network even accept restrictions.Please open port 38106 on your route, to make sure your site is accessible to everyone.\nIs there anyone to help me to solved it? thanks a lot!\nAnd seems the big brother's watching me?",
			"added": 1611752945
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1610256866_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 1,
				"body": "You r right, maybe you should talk about it in a Chinese forum , It's more lively than here when it comes to discussing bitcoin...",
				"added": 1610259424
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> [freemankind](#comment_71_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): youre just another troll thats been added to a blacklist\n\nI have to say, I don't like bitmessage at all, it looks like a simple encrypted email system, and in this age, email is obviously not enough, instant encrypted communication, including one-to-many, and many-to-many instant encrypted communication is the minimum required.",
				"added": 1610952734
			},
			{
				"comment_id": 3,
				"body": "In this day and age, email is clearly not enough, and instant encrypted communication, including one-to-many, or even many-to-many instant encrypted communication, is the minimum required.On this basis, it is most important that we can easily build different groups and find different groups, so that people can quickly, safely and find their own peers or organizations, and discuss what they like,  even if these things are not liked by some other organizations and institutions, they can do nothing.",
				"added": 1610952977
			},
			{
				"comment_id": 7,
				"body": "How about disorder? it seems to be the  most popular communication app in the Darknet, though the end-to-end encryption is not supported.",
				"added": 1612370710
			},
			{
				"comment_id": 8,
				"body": "> [asdf111](#comment_18_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN): Which one is disorder?\n\nSorry，it's discord,  it seems to be the most popular communication app in the Darknet, and it is said to be nine times more popular than the next most popular app telegram.",
				"added": 1612629411
			}
		],
		"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": [
			{
				"comment_id": 4,
				"body": "Who can develop an app which can include all function of QQ, and provide instant encrypted communication, including one-to-many, or even many-to-many instant encrypted communicatio?\nOn this basis, we can easily build different groups and find different groups, so that people can quickly, safely and find their own peers or organizations, and discuss with them what they like, even if these things are not liked by some organizations and institutions, they can do nothing. \nI think that's the essence of decentralization.",
				"added": 1610953384
			}
		],
		"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 5,
				"body": "> [mxh69420](#comment_40_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): thats the spirit!\n\nlet‘s do something....",
				"added": 1610979172
			}
		],
		"1611150861_1DaNdDeFckV6pdQCFrtHCMF7ZfJEPhaJQd": [
			{
				"comment_id": 6,
				"body": "i have the same question....",
				"added": 1611151076
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 9,
				"body": "Impossible，nobody konws that what‘s the time.",
				"added": 1613360632
			}
		],
		"1613421453_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 10,
				"body": "You need some guys and some bitcoins to start a Bazaar project on github.",
				"added": 1613453919
			},
			{
				"comment_id": 11,
				"body": "You need some guys and some bitcoins to start a ZeroBazaar project on github. And before that, you need to find a secure communication tool, such as support end-to-end encryption, perfect group communication capabilities and so on, because you are talking about a decentralized, secure, anonymous, anti-investigation business platform.\nSuch platform has the potential power to disrupt society structurally, so it is essential to ensure the absolute safety of participants from the start.",
				"added": 1613454591
			}
		],
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 12,
				"body": "I think they just tree new bee.",
				"added": 1613923829
			}
		],
		"1621239876_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 13,
				"body": "maybe a template or framework for a ZeroNet shop/market......",
				"added": 1621327496
			}
		],
		"1625793981_1PoimK7hZWHqrhWBZAVe8bi9g7sv4cj87R": [
			{
				"comment_id": 14,
				"body": "> [sword00000](#comment_65_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): There is a lot of crazy uncensored chat going on Session. Just install Session, and join any of the Open Groups listed herehttp://lokilocker.com/Mods/Session-OpenGroups/wiki/Session-Open-Groups\n\nWhere is the chinese group?  thanks a lot....",
				"added": 1630128912
			}
		]
	},
	"comment_vote": {}
}