{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1543239891,
			"title": "Comments and suggestions about the initial work",
			"body": "I know the wiki is missing lots of pages, so please help by writing some tutorial or adding links to other places to find documentation.",
			"added": 1543239890
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1543239891_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, here is similar forum: 0DevTalkRegarding developer resources, open this page and search for line starting \"DEVELOPMENT:\".\n\nThank you for the informations. Actually this forum is only to talk about wiki issues, so I think there is a difference with 0DevTalk",
				"added": 1543394690
			},
			{
				"comment_id": 2,
				"body": "> [diligentslacker](#comment_1_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): This has been really helpful. thank you.\n\nYou are welcome. What in particular has been helpful to you?",
				"added": 1544262163
			},
			{
				"comment_id": 3,
				"body": "> [diligentslacker](#comment_2_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): I like the layout first of all. It's easy to go back and find what you're looking for. Things move around and get buried in forums and blogs.\n\nThis is the exact reason for which I made this Wiki: to collect all experience that I have collected in some months in only one place.\n\n> [diligentslacker](#comment_2_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): A live developers chat would be awesome\n\nThere exist a couple of these. I don't remember them now, but I will try to get the sites addresses and write them here.\n\n> [diligentslacker](#comment_2_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): I guess while typing the documentation they skipped over the example explaining how paths actually work.\n\nYeah, I also think so. Concerning what it is said in the gitbook, since ZeroNet acts as a local WebServer, its host is `127.0.0.1` and so when you write an absolute URL as `/about.html` you are not referring to the base of your site, but actually to the \"host\" of ZeroNet so the URL becomes `127.0.0.1:43110/about.html` which is not the page you were looking for.\nYou can simply write URLs as `/1YOUR_SITE_ADDRESS/about.html` which will get rendered correctly or just write relative URLs like `../about.html` or just `about.html` depending on the \"folder\" you currently are serving something from.",
				"added": 1544314419
			},
			{
				"comment_id": 4,
				"body": "> [diligentslacker](#comment_3_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): An interesting tool for teaching.https://scrimba.com/c/cKp6LhL\n\nThe idea is really good, but it would be great if it was opensource so that we could host something similar on ZeroNet...",
				"added": 1544436141
			},
			{
				"comment_id": 5,
				"body": "> [diligentslacker](#comment_4_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): any idea where i can find info on how zerome handles images?\n\nNot really except in [ZeroMe source code on GitHub](https://github.com/HelloZeroNet/ZeroMe).\n\nI can try to imagine how it works, but notice that I haven't worked with optional files yet.\n- In your `content.json` you should specify the [regular expression that identifies optional files](http://127.0.0.1:43110/18hFUweFE3AJwZWnaMeq3fJMobrq8jevfd/?Page:complete-content-guide#optional).\n  In this way the user can upload a foto and when he signs it it will be handled as optional file (i.e. not every peer will have it). You can see [in the official documentation](https://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/#bigfileuploadinit-inner_path-size) an example of how to upload a \"bigfile\".\n- To give informations about the file you should call [optionalFileInfo](http://127.0.0.1:43110/18hFUweFE3AJwZWnaMeq3fJMobrq8jevfd/?Page:zeroframe-api-command#optionalfileinfo) and to download it you should use [fileNeed](http://127.0.0.1:43110/18hFUweFE3AJwZWnaMeq3fJMobrq8jevfd/?Page:zeroframe-api-command#fileneed).\n  Be sure to checkout also the other command in OptionalManager plugin since they could be very useful for optional file management.",
				"added": 1544527040
			},
			{
				"comment_id": 6,
				"body": "> [diligentslacker](#comment_5_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): Thank you! That really helped out. Your links to anchors doesn't seem to work. I've tried in chrome and tor browser. Just a heads up. thanks again.\n\nStrange: they worked for me when I was searching them but don't work now...\nGlad they were useful nonetheless.",
				"added": 1544546424
			},
			{
				"comment_id": 7,
				"body": "@diligentslacker I've written my previous reply in [a wiki page](/18hFUweFE3AJwZWnaMeq3fJMobrq8jevfd/?Page:write-your-own-zerotube). If you like it, add something that you discovered about it or that you think is not clear enogh. A complete tutorial with code will be very much appreciated but I think this is asking too much :)",
				"added": 1544547793
			},
			{
				"comment_id": 8,
				"body": "> [diligentslacker](#comment_7_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): @trenta3 I'm not comfortable enough with my knowledge of zeronet to do a tutorial yet but I have been adding to the wiki here and there.\n\nThank you",
				"added": 1544631905
			}
		]
	},
	"comment_vote": {}
}