{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 15,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#LAS LEYES DE LA TERMODINÁMICA\nUm cientista neurótico associa o seu azar no amor e sua relação conturbada com um famosa modelo com as Leis da Termodinâmica, para tentar entender o mundo romântico e conseguir alcançar o famoso final feliz.\n- https://ok.ru/video/891646642857",
				"added": 1544205579
			},
			{
				"comment_id": 2,
				"body": "#Leo Da Vinci : Missão Mona Lisa\nNo final da Idade Média, na Itália, Leonardo “Leo” Da Vinci é um jovem amante do garoto para inventar máquinas avançadas que vive feliz com seu melhor amigo Lorenzo e a bela Lisa, sendo secretamente apaixonada por ela. Depois de testar o primeiro traje de mergulho de sua criação em um lago, a tragédia aparece quando, voltando para casa, Lisa percebe que sua casa e suas terras foram queimadas por um incêndio. O dono das terras ameaça o pai de Lisa para se casar com seu filho se ele não der todo o dinheiro que ele paga como retribuição pelo incêndio, causando a tristeza de Lisa. Tentando salvá-la, Leo Da Vinci decide viajar para Florencia para ganhar dinheiro e pagar a dívida com a ajuda de Lorenzo. Incapaz de manter o segredo, Lorenzo revela os planos de Lisa Leo, e Lisa se junta a seus amigos para fazer a viagem para a cidade grande, onde encontram um contador de histórias que explica em uma praça a história de um navio pirata afundado com um grande tesouro dentro dele. Acreditando nisso como um evento verdadeiro, Leo compra o mapa do tesouro para o contador de histórias, mas é roubado por uma criança pequena e órfã chamada Agnes. Fazendo um trato com ela, Leo recupera o mapa e Agnes se junta ao grupo ao mesmo tempo que Niccoló, uma criança pequena amante da ciência e da astronomia que faz amizade com Lisa. Todos os cinco chegam à Ilha Montecristo em busca do tesouro, mas não sabem que os piratas seguem cada passo que dão, esperando o momento certo para roubar o tesouro e eliminar Leão e seus amigos.\n\n- https://ok.ru/video/953285872297",
				"added": 1544205609
			},
			{
				"comment_id": 3,
				"body": "#O FÍSICO\nInglaterra, século XI. Ainda criança, Rob vê sua mãe morrer em decorrência da \"doença do lado\". O garoto cresce sob os cuidados de Bader (Stellan Sarsgard), o barbeiro local, que vende bebidas que prometem curar doenças. Ao crescer, Rob (Tom Payne) aprende tudo o que Bader sabe sobre cuidar de pessoas doentes, mas ele sonha em saber mais. Após Bader passar por uma operação nos olhos, Rob descobre que na Pérsia há um médico famoso, Ibn Sina (Ben Kingsley), que coordena um hospital, algo impensável na Inglaterra. Para aprender com ele, Rob aceita não apenas fazer uma longa viagem rumo à Ásia mas também esconde o fato de ser cristão, já que apenas judeus e árabes podem entrar na Pérsia.\n\n- https://ok.ru/video/291689925136",
				"added": 1544205885
			},
			{
				"comment_id": 13,
				"body": "#MEU CACHORRO SKIP\nYazoo City, Mississipi, 1942. Willie Morris (Frankie Muniz) é um garoto tímido que tem dificuldades em fazer amizades. Até que, ao completar nove anos, seus pais Ellen (Diane Lane) e Jack (Kevin Bacon) lhe dão um cachorro, que recebe o nome de Skip. Com o passar do tempo Skip passa a ser conhecido e amado por toda a vizinhança, além de se tornar o grande amigo de Willie.\n\n- https://youtu.be/qx0BcgWDkeQ",
				"added": 1544230336
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#Introdução de um Quantum of Time (\"chronon\") e suas conseqüências para a mecânica quântica\n\n- https://web.archive.org/web/20181207191009/https://arxiv.org/pdf/quant-ph/9706059.pdf",
				"added": 1544209875
			},
			{
				"comment_id": 5,
				"body": "#Hipótese dos números grandes de Dirac\n- https://en.wikipedia.org/wiki/Dirac_large_numbers_hypothesis",
				"added": 1544212289
			},
			{
				"comment_id": 6,
				"body": "#Nota preliminar sobre as massas do elétron, do próton e do universo - Arthur Eddington\n- https://sci-hub.tw/10.1017/S0305004100009269",
				"added": 1544212416
			},
			{
				"comment_id": 7,
				"body": "#Teoria de tudo\n\n- http://abyss.uoregon.edu/~js/21st_century_science/lectures/lec17.html",
				"added": 1544215223
			},
			{
				"comment_id": 8,
				"body": "#Por que os quarks não podem ser partículas fundamentais\n- https://web.archive.org/web/20181208004652/https://arxiv.org/pdf/hep-ph/0411313.pdf",
				"added": 1544230050
			},
			{
				"comment_id": 11,
				"body": "#Biografia do cientista Albert Einstein contada pelo jornalista e físico Cássio Leite Vieira. Este vídeo pertence à coleção Imortais da Ciência produzido pela Seara da Ciência, órgão de divulgação científica da Universidade Federal do Ceará.\n- https://youtu.be/X7m5C-m6mDY",
				"added": 1544230148
			},
			{
				"comment_id": 12,
				"body": "#Biografia dos cientistas Erwin Schrödinger e Werner Heisenberg contada por Antonio Toledo Piza. Este vídeo faz parte da Coleção Imortais da Ciência, órgão de divulgação científica da Universidade Federal do Ceará.\n- https://youtu.be/zJJq388H_fQ",
				"added": 1544230289
			},
			{
				"comment_id": 14,
				"body": "#Focus fusion\nFocus fusion é uma abordagem alternativa para chegar ao domínio da tecnologia da fusão nuclear para fins pacíficos de geração de eletricidade. Vem sendo desenvolvida por alguns cientistas como o americano Eric Lerner e o chileno Leopoldo Soto.\n\n- https://sci-hub.tw/10.1063/1.4989845",
				"added": 1544243901
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 9,
				"body": "#Jesus e a Natureza de Deus\n\n- https://web.archive.org/web/20181208002106/https://www.estudosdabiblia.net/a9.htm",
				"added": 1544230077
			},
			{
				"comment_id": 10,
				"body": "E havia entre os fariseus um homem, chamado Nicodemos, príncipe dos judeus.\nEste foi ter de noite com Jesus, e disse-lhe: Rabi, bem sabemos que és Mestre, vindo de Deus; porque ninguém pode fazer estes sinais que tu fazes, se Deus não for com ele.\nJesus respondeu, e disse-lhe: Na verdade, na verdade te digo que aquele que não nascer de novo, não pode ver o reino de Deus.\nDisse-lhe Nicodemos: Como pode um homem nascer, sendo velho? Pode, porventura, tornar a entrar no ventre de sua mãe, e nascer?\nJesus respondeu: Na verdade, na verdade te digo que aquele que não nascer da água e do Espírito, não pode entrar no reino de Deus.\nO que é nascido da carne é carne, e o que é nascido do Espírito é espírito.\nNão te maravilhes de te ter dito: Necessário vos é nascer de novo.\nO vento assopra onde quer, e ouves a sua voz, mas não sabes de onde vem, nem para onde vai; assim étodo aquele que é nascido do Espírito.\nNicodemos respondeu, e disse-lhe: Como pode ser isso?\nJesus respondeu, e disse-lhe: Tu és mestre de Israel, e não sabes isto?\nNa verdade, na verdade te digo que nós dizemos o que sabemos, e testificamos o que vimos; e não aceitais o nosso testemunho.\nSe vos falei de coisas terrestres, e não crestes, como crereis, se vos falar das celestiais?\nOra, ninguém subiu ao céu, senão o que desceu do céu, o Filho do homem, que está no céu.\nE, como Moisés levantou a serpente no deserto, assim importa que o Filho do homem seja levantado;\nPara que todo aquele que nele crê não pereça, mas tenha a vida eterna.\nPorque Deus amou o mundo de tal maneira que deu o seu Filho unigênito, para que todo aquele que nele crê não pereça, mas tenha a vida eterna.\nPorque Deus enviou o seu Filho ao mundo, não para que condenasse o mundo, mas para que o mundo fosse salvo por ele.\nQuem crê nele não é condenado; mas quem não crê já está condenado, porquanto não crê no nome do unigênito Filho de Deus.\nE a condenação é esta: Que a luz veio ao mundo, e os homens amaram mais as trevas do que a luz, porque as suas obras eram más.\nPorque todo aquele que faz o mal odeia a luz, e não vem para a luz, para que as suas obras não sejam reprovadas.\nMas quem pratica a verdade vem para a luz, a fim de que as suas obras sejam manifestas, porque são feitas em Deus.\nDepois disto foi Jesus com os seus discípulos para a terra da Judéia; e estava ali com eles, e batizava.\nOra, João batizava também em Enom, junto a Salim, porque havia ali muitas águas; e vinham ali, e eram batizados.\nPorque ainda João não tinha sido lançado na prisão.\nHouve então uma questão entre os discípulos de João e os judeus acerca da purificação.\nE foram ter com João, e disseram-lhe: Rabi, aquele que estava contigo além do Jordão, do qual tu deste testemunho, ei-lo batizando, e todos vão ter com ele.\nJoão respondeu, e disse: O homem não pode receber coisa alguma, se não lhe for dada do céu.\nVós mesmos me sois testemunhas de que disse: Eu não sou o Cristo, mas sou enviado adiante dele.\nAquele que tem a esposa é o esposo; mas o amigo do esposo, que lhe assiste e o ouve, alegra-se muito com a voz do esposo. Assim, pois, já este meu gozo está cumprido.\nÉ necessário que ele cresça e que eu diminua.\nAquele que vem de cima é sobre todos; aquele que vem da terra é da terra e fala da terra. Aquele que vem do céu é sobre todos.\nE aquilo que ele viu e ouviu isso testifica; e ninguém aceita o seu testemunho.\nAquele que aceitou o seu testemunho, esse confirmou que Deus é verdadeiro.\nPorque aquele que Deus enviou fala as palavras de Deus; pois não lhe dá Deus o Espírito por medida.\nO Pai ama o Filho, e todas as coisas entregou nas suas mãos.\nAquele que crê no Filho tem a vida eterna; mas aquele que não crê no Filho não verá a vida, mas a ira de Deus sobre ele permanece.\n\n- João 3:1-36",
				"added": 1544230121
			}
		]
	},
	"comment_vote": {}
}