{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "fant@zero",
			"body": "###Лучшая мировая фантастика, фэнтези и приключения.\n\n> [Каталог аудиокниг](/1N77kxgd29cR8w9xt481JDJEtYdX1hCqAR/) (mp3, 32 kbps).\n\nКаталог условно разделен на \"[описательную](/1N77kxgd29cR8w9xt481JDJEtYdX1hCqAR/)\" и \"[содержательную](/1N77kxgd29cR8w9xt481JDJEtYdX1hCqAR/fantpril.html)\" части. В описательной части располагаются предгенеренные статические вэб-страницы с названиями, иллюстрациями и (не) очень удобной навигацией. В содержательной - собственно mp3 в виде опциональных BigFiles. \n\n> Т.е. вы сидируете только \"описательную\" часть и те mp3-файлы которые сами решили послушать и/или скачать, а не весь каталог mp3, разумеется (который со временем раздуется до 100+ ГБ).\n\nПополнение каталога будет происходить спонтанно и нерегулярно. Но пока есть желание и будет спрос - пополнения будут.\n\n> С учетом полного количества аудиокниг на данный момент (600+ шт) размер \"описательной\" части (только вэб-морда без mp3) вряд ли когда-либо превысит 130-150 МБ, что по здешним меркам не мало, но и совсем не много если думать об этом как об одной среднестатистической торрент-раздаче.\n\nНе стесняйтесь сидировать )\nВы и сети помогаете, и автора мотивируете - win-win. Спасибо!\n\n> На возможный вопрос \"зачем это все?..\" комплексный ответ, наверное такой:\n\n> 1. Тут часто говорят \"Нужен контент\". Я принес. Вы тоже несите.\n> 2. Мне это просто интересно в социально-познавательных целях.\n> 3. Есть лишний винт, и чем просто держать там бэкап аудио, не лучше ли его причесать, накрасить и раздать.\n\n###[Подписывайтесь в ZMe](/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ/fant@zeroid.bit) - там анонсируются все обновления.\n\n> Я полностью за Тор-ом. Т.е. с включенным в настройках \"Always: Use Tor for every connections to hide your IP address\". Полагаю, некоторые коннекты с клиентами у которых опция использования Тора отключена будут затруднены. Очевидно, большое количество сидов с разными вариантами подключения будет со временем улучшать доступность, но сейчас сидов мало, и возможно включение Тора в настройках ZN решит проблему доступности файлов для тех кто пытается скачать mp3-файлы прямо сейчас.",
			"added": 1561993688
		},
		{
			"topic_id": 2,
			"title": "UTOPIA",
			"body": "https://u.is/ru/\n\n> UTOPIA — ЕДИНОЕ РЕШЕНИЕ ДЛЯ БЕЗОПАСНОГО ОБМЕНА СООБЩЕНИЯМИ, ШИФРОВАНИЯ ЭЛЕКТРОННОЙ ПОЧТЫ, ВЫПОЛНЕНИЯ АНОНИМНЫХ ПЛАТЕЖЕЙ И ПРИВАТНОГО СЕРФИНГА.\n\nКод закрытый - хехехе.\nЛегкий майнинг \"для поддержания работоспособности сети и некоторых сервисов\" - хехехе.\nКриптокоины Crypton - кто нибудь такие видел на торгах или где-нибудь?\n\nВообще задумка прекрасная. Исполнение - эдакая Retroshare здорового человека.\nМожно туннелировать любой сервис (как в ш2з), правда для этого надо сначала намайнить коинов.\n\nВсе довольно \"вкусно\", но без опенсорса, которого нет и не предвидится. А жаль.",
			"added": 1576588230
		}
	],
	"topic_vote": {
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf": 1,
		"1_1BvGbtWBRYMNXZhv5A1tw3qgdb44pfzi2d": 1,
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": 1,
		"1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": 1,
		"1_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": 1
	},
	"next_comment_id": 88,
	"comment": {
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 1,
				"body": "И еще. Я полностью за Тор-ом. Т.е. с включенным в настройках \"Always: Use Tor for every connections to hide your IP address\".\nПолагаю, некоторые коннекты с клиентами у которых опция использования Тора отключена будут затруднены.\nОчевидно, большое количество сидов с разными вариантами подключения будет со временем улучшать доступность, но сейчас сидов мало, и возможно включение Тора в настройках ZN решит проблему доступности файлов для тех кто пытается прямо сейчас скачать mp3-файлы.",
				"added": 1562061253
			},
			{
				"comment_id": 13,
				"body": "После оптимизации автогенерируемых изображений каталога можно заметить значительное уменьшение его размера на диске. \nПриятного сидирования )",
				"added": 1562773815
			},
			{
				"comment_id": 24,
				"body": "> [trooper](#comment_22_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): очень большой минус, что все 5 часов одним файлом...\n\nЯ понимаю что это не идеальный вариант, но в текущих реалиях ZN это наиболее оптимальный рабочий вариант. Иначе только архив. А архив требует дополнительных телодвижений по переносу и распаковке. Есть плееры которые запоминают позицию проигрывания, и для них не важно в данной ситуации один файл или много.\n\n> [trooper](#comment_23_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): еще бы поиск какой то прикрутить бы..) была бы песня!\n\nЕсть \"каталогизация\" по авторам. В других случаях: Ctrl+F  :)",
				"added": 1565770388
			},
			{
				"comment_id": 26,
				"body": "Конечно можно. Но бумажных миллионы...\nВпрочем, если говорить только о сабже топика, то могу дополнить каждую аудиокнигу ее fb2 версией.\nВесь вопорос \"надо ли\"?",
				"added": 1566473384
			},
			{
				"comment_id": 63,
				"body": "Не смущаясь апну для недавно присоединившихся )",
				"added": 1573642213
			},
			{
				"comment_id": 64,
				"body": "> [exhumator](#comment_10_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): И качать ничего не скачивается.\n\nС включенным тором?",
				"added": 1573925978
			},
			{
				"comment_id": 80,
				"body": "Судя по всему в одном из последних обновлений ZN (0.7.1 rev4360) поломали плагин BigFiles. Теперь раздача больших файлов не работает. Будем подождать... Пока \"under construction\".",
				"added": 1576752843
			},
			{
				"comment_id": 86,
				"body": "> [lukashenko](#comment_11_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): Ахахах, просто взял и удалил контент. И где хваленая распределённость зиронета? всё один фейк. \n\nВ ZN владелец зайта имеет над его контентом полный контроль со всеми плюсами и минусами. Это не раз обсуждалось с разных сторон. Если вам нужна неубиваемость контента, то вам, например, во FreeNet, но точно не сюда. Тут вы не разобрались с вопросом...\n\n> И из телеграма удалил весь контент своих аудиокниг, так что не надо говорить, что проблема чисто техническая\n\nИзвините, но я никогда не говорил что каким-то образом отвечаю за канал в телеграме. Я говорил что канал является источником для коллекции в ZN. \n\nЧто касается технических проблем, то я на последней версии win-ZN до сих пор периодически получаю вот такую ошибку при попытке скачать файлы из ZeroUp (и что намного хуже - из коллекции), причем на разных копиях ZN на разных машинах. \n\n> Server error Err: OSError: [WinError 123] Синтаксическая ошибка в имени файла, имени папки или метке тома: '***/data/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/D:' in core/src/Ui/UiServer.py line 129 > ... > UiPluginManager/UiPluginManagerPlugin.py line 33 > UiConfig/UiConfigPlugin.py line 20 > ContentFilter/ContentFilterPlugin.py line 199 > core/src/Ui/UiRequest.py line 361 > NameYo/UiRequestPlugin.py line 24 > TranslateSite/TranslateSitePlugin.py line 33 > FilePack/FilePackPlugin.py line 86 > core/src/Ui/UiRequest.py line 645 > Bigfile/BigfilePlugin.py line 777 > core/src/Site/Site.py line 819 > Bigfile/BigfilePlugin.py line 595 > 409 > core/src/Site/SiteStorage.py line 248 > ... > os.py line 211 > 211 > 211 > 211 > 211 > 211 > 221\n\nНа версиях раньше 42** такой проблемы не наблюдаю. Как бороться не знаю,  я \"не сварщик\"... В любом случае спасибо что не остаетесь равнодушными )",
				"added": 1578413983
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": "Обсуждение в английской версии \"обфрикилось\" и вообще свернуло не туда.",
				"added": 1562092283
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_12_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Да. Ибо что делать -- вообще непонятно. Хоть какого-то консенсуса достичь не получилось. А nofish молчит. Я не знаю, что делать.\n\nПилить своё на базе уже сделанного. Максимально совместимое с существующей сетью, конечно. Форкать существующий питон или переписывать на чем угодно - не принципиально вообще.\n\nl2pd - прекрасный пример такого подхода.",
				"added": 1562093269
			},
			{
				"comment_id": 4,
				"body": "<off>\nСлушайте, вы же все и всех тут знаете )\nZeroLSTN ушел? Он же потрясающую штуку так и не допилил до конца ((\n</off>",
				"added": 1562096460
			},
			{
				"comment_id": 6,
				"body": "> [pizdahd](#comment_2_14CEhTncVyUDVGxaFD9PEv2YqdF6xe6oCV): И научись читать лицензию придурок\nНоуфиш перелогинился :)\n\nЯ как \"сраный нищеброд\" еще раз говорю - все эти разговоры не стоят потраченного трафика. \nНадо просто начать делать свое, или форкать, или переписывать. Сохраняя совместимость.\nИ все.",
				"added": 1562319641
			},
			{
				"comment_id": 21,
				"body": "> [mistalero](#comment_84_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что такое цп?\n\nпорно c несовершеннолетними",
				"added": 1565208031
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 5,
				"body": "Пилите свое. \nПилите. Свое.\nВремя все расставит по местам. Я гарантирую это )",
				"added": 1562318867
			},
			{
				"comment_id": 7,
				"body": "> [if0] Только за пределами ZN\nРазумеется.",
				"added": 1562324078
			},
			{
				"comment_id": 12,
				"body": "> [gitcentermobile](#comment_2_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): \"Держу в курсе\": я все же начал разработку своей реализации на JavaScript, с нуля. Пока доволен, может получиться лучше оригинальной.\n\nБыло бы круто еще уметь заводить ZN через i2p )",
				"added": 1562762135
			}
		],
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 8,
				"body": "> [justman](#comment_4_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): ну, Тор можно скомпилировать через биндинги) если уже на то пошлотак что он (если будет нужно) может быть прямо внутри приложения\n\nКак в ZN и сделано.",
				"added": 1562503912
			},
			{
				"comment_id": 9,
				"body": "Я не сварщик )",
				"added": 1562505611
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 10,
				"body": "> [tridvaraz](#comment_4_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd): То-есть, если кто-то создаст тут сайт и выложит детское порно, даже разработчики zero не смогут удалить?)\n\nНикто не удалит. Но люди просто могут не сидировать.",
				"added": 1562685079
			},
			{
				"comment_id": 11,
				"body": "Если не заниматься моральными аспектами, то надо помнить что ZN - сеть не анонимная. И если что-то выкладывать, то всегда надо включать Тор в настройках.",
				"added": 1562685275
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 14,
				"body": "Смешно )",
				"added": 1562851510
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 15,
				"body": "> [stainlessrat](#comment_16_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Готов скинуться ему деньгами. Есть счёт?\n\nНаверное только закладка с конвертом с мелкими старыми купюрами...",
				"added": 1563276179
			},
			{
				"comment_id": 16,
				"body": "))))))))))))",
				"added": 1563715500
			}
		],
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 17,
				"body": "> [ultraviolet](#comment_76_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Администрация ВК как ни удивительно никаких враждебных действий не предпринимает.\n\nПока ее не попросили. А не просят пока потому что не интересно. А как только, так сразу. Мгновенно.",
				"added": 1564730300
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 18,
				"body": "> [if0](#comment_199_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Подделать можно 10-15%, но ни как не 50% или более.\n\nДа ладно!? Посмотрите на кавказкие \"республики\".\n> Идти и потрить бюллетени, коль нет кандидата или пункта \"проив всех\", что бы узурпаторы не могли бахвалится на каждом углу о своей \"легитимности\" и \"народном выборе\". Не пришел - значит - поддержал режим.\n\nИспорченные бюллетени \"размазывают\" по всем прошедшим в процентном соотношении. Бессмысленная тактика.\nЕдинственная нормальная сейчас тактика - протестное голосование.",
				"added": 1565093028
			},
			{
				"comment_id": 19,
				"body": "> [if0](#comment_200_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Там не подделывают, там \"весьма убедительно просят\" \"проявлять сознательность\", точно так же, как личный состав в армии и внутренних войсках.\n\nЧот вы совсем от жизни оторваны. Нет. Там рисуют до 90% и больше. Все есть в открытых источниках. Включая видео.\n\n> Как \"размыть\", если будет половина, или хотя бы треть испорченных бюллетеней от общего количества проголосовавших?\n\nВозьмут и размоют. Вопрос не ко мне, а к законодателям.\n\n> За дядю, который гарантированно лоялен к власти, раз его не побоялись допустить к \"выборам\", внеся в список голосования?\n\nДа. За любого.",
				"added": 1565095806
			},
			{
				"comment_id": 20,
				"body": "Даже и без вбросов просто пишут выдуманные числа в итоговых протоколах. Вбросы-то само собой.",
				"added": 1565114229
			},
			{
				"comment_id": 27,
				"body": "Ребята и девчата, в Москве уже скоро: https://vote2019.appspot.com/",
				"added": 1566491359
			},
			{
				"comment_id": 28,
				"body": "> [caryoscelus](#comment_122_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Очень \"умная стратегия\", ага. Посмотрите как голосуют не-ЕРовцы из \"парламентской оппозиции\", посмотрите как ведут себя губеры из оной. Смысл тут скорее всего в том, чтобы присвоить себе победу над трупом ЕР. И да, думаю ради этой флеймотемы стоило бы создать отдельный топик, лол\n\nВы не поняли сути. Читайте, перечитывайте. Впрочем, по желанию...",
				"added": 1566493304
			},
			{
				"comment_id": 29,
				"body": "> [caryoscelus](#comment_123_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n> А отсылать перечитывать — это так просто, да\n\nhttps://www.novayagazeta.ru/articles/2019/08/24/81715-golosovat-za-drugih-svolochey",
				"added": 1566739966
			},
			{
				"comment_id": 36,
				"body": "> Ссылками кидаться и я могу. Вот только смысл в контексте спора в этом очень сомнительный\nС вами тут никто не спорит, и уж точно не я.\nЯ вам говорю, и продолжаю говорить, что вы не понимаете смысла, и не делаете труда понять. Это ваш выбор и ваше право, разумеется. Это просто констатация, и лично мне ваша позиция до лампы, мягко говоря.\n\nНу и \"в контекст\":\nhttps://www.facebook.com/leonid.m.volkov/posts/2466736500015635",
				"added": 1567069414
			}
		],
		"5_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 22,
				"body": "Не замечал.",
				"added": 1565339994
			}
		],
		"1_1JJoeimWbdW8iRd5dpgE7CJ5gAQVGphQFB": [
			{
				"comment_id": 25,
				"body": "Привет 2000-й год...",
				"added": 1566207478
			}
		],
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 30,
				"body": "А почему-то у меня ссылки открываются в виде:\n\nNot Found\n/kiwipedia.yo\n\nПлагин поставлен. Включен. ZN перезагружена много раз.",
				"added": 1566740105
			},
			{
				"comment_id": 31,
				"body": "Обновлена до 4191. Не работает.\nЕдинственное, у меня Py3 версия.",
				"added": 1566809550
			},
			{
				"comment_id": 32,
				"body": "Трудно сказать что это было, но помогла полная переустановка плагина.",
				"added": 1566814473
			},
			{
				"comment_id": 39,
				"body": "> [gitcenter](#comment_30_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): \n\nНапишите инструкцию \"для чайников\" как добавить кнопку и сам плагин на собственные зайты.\nЯ бы поставил себе, к примеру...\n\nПроблема подлинности плагина только будет... да?",
				"added": 1567178688
			},
			{
				"comment_id": 40,
				"body": "Наааааайс. Добавил.",
				"added": 1567195190
			}
		],
		"6_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 33,
				"body": "https://github.com/ngosang/trackerslist\n\nИли сразу:\n\nhttp://127.0.0.1:43110/Config\nTrackers files\nLoad additional list of torrent trackers dynamically, from a file\nhttps://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_best.txt\n\nВсегда полный набор.",
				"added": 1566926039
			},
			{
				"comment_id": 34,
				"body": "> Пробовал такой метод. После старта клиента трекеров много, но через нескольколько часов онлайна их становится 0.\n\nУ меня всегда битком рабочих трекеров из /trackers_best.txt. \nНе понимаю проблемы.",
				"added": 1566932581
			},
			{
				"comment_id": 35,
				"body": "> [if0](#comment_218_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Интенсивность запросов к трекерам может зависить от количества загруженных зайтов.\n\nАа, ок. Логично.",
				"added": 1566981373
			}
		],
		"7_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 37,
				"body": "Да. Генерируете (или берете готовые) связные статичные хтмл-страницы и несете их в папочку с зайтом. Он или сам унюхает изменения и попросит подписать content или вы вручную это сделаете в правой консоли зайта.",
				"added": 1567154670
			},
			{
				"comment_id": 42,
				"body": "> [7heaven](#comment_25_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): \n> Алсо, посоветуйте граббер для статичных веб-сайтов, чтобы можно было сразу выбирать насколько углубляться при граббинге веб-страниц.\n\nTeleport Pro",
				"added": 1567327060
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 41,
				"body": "wow",
				"added": 1567266342
			},
			{
				"comment_id": 46,
				"body": "Диванная онолитека подъехала )",
				"added": 1567707878
			},
			{
				"comment_id": 47,
				"body": "И никак не уезжает ) \nСвятое дело Блансера живет. Ну и ~~хрен с ним~~ слава богу...",
				"added": 1567766976
			},
			{
				"comment_id": 48,
				"body": "а с балансером они оч. обходили? О__О",
				"added": 1567959309
			},
			{
				"comment_id": 49,
				"body": "> [loskiq1](#comment_1_1Mkq3r9yYfis6Fx3rAdW99BFsRWPpx23Wn): проверка\n\nутверждения в сабже?",
				"added": 1568116841
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 43,
				"body": "> [7heaven](#comment_26_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Могу тупить, но это случайно не балансер?\n\nСлучайно",
				"added": 1567351857
			},
			{
				"comment_id": 45,
				"body": "Не, нуачо. Зато не скучно.",
				"added": 1567438419
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 44,
				"body": "> [ultraviolet2](#comment_12_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): \n> Есть ещё полиция и росгвардия которые бьют по тупым башкам \"сверхчеловеков \"дубинами.\n\nДа вы оба \"хороши\"...",
				"added": 1567427185
			}
		],
		"2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 50,
				"body": "u",
				"added": 1571754103
			},
			{
				"comment_id": 51,
				"body": "Ничего... Кинопаб (пока) не забанили. У него своя CDN.",
				"added": 1571905226
			},
			{
				"comment_id": 53,
				"body": "> [if0](#comment_241_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Торенты. Чем не альтернатива?\n\nСломался мотоцикл - садись на велосипед... Чем не альтернатива? Ничем.\n\nЧтобы как-то приблизить одно к другому надо как минимум:\n1. Поднять и настроить (и в идеале, держать 24/7) локальный потоковый сервак (на соответствующей задаче железке, что тоже отдельный вопрос, как и настройка особенно для вещания наружу, с ограничением по логину, с преобразованием под разные скорости и устройства).\n2. Настроить (а предварительно его скорее всего придется купить, ибо он не всегда бесплатный) персональный фид для скармливания обновлений интересующих раздач торрент-клиенту (для сериалов) и настроить сам торрент-клиент для автоматического скачивания.\n3. Следить за актуальностью источника фида и самих раздач (которые надо еще найти, отсортировать и выделить нужное).\n4. Изыскать сотни гигов локального хранения.\n\nФигня вопрос.",
				"added": 1572007523
			},
			{
				"comment_id": 54,
				"body": "> [if0](#comment_244_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что бы аналогия была правильной, надо сказать: сломался мотоцикл с дилдой вместо седла на которую насаживались его пользователи во время каждой поездки. Дилдоцикл - сломался и теперь они негодуют, что приходится пользоваться велосипедом с обычным седлом, без дилды. \n\nЯ в дилдах не спец, ничего не могу сказать.\n\n> Зачем, что-то к чему-то приближать? Качай себе торенты, раздавай их и смотри на здоровье. В чем проблема?\n\nВ том что вы предлагаете как \"альтернативу\" такой вариант, который в моем понимании альтернативой никак не является. Приемлемая альтернатива подразумевает нечто равноценное или близкое к равноценному. Торренты даже близко не равноценны стриминговому сервису.\n\n> Не так. Пользователи стриминговых сервисов любят \"кататься\" - смотреть \"по одному клику\", но жуть как не любят \"саночки возить\" - предоставлять свои ресурсы: дисковое пространство, трафик, процессорное время для нужд распределенной сети.  \n\nЛюбой (в т.ч. и пиратский) более-менее приличный стриминг-сервис - платный. Каждый платит за свои санки. Не надо ерунды писать.",
				"added": 1572085604
			},
			{
				"comment_id": 55,
				"body": "> [swashbuckler](#comment_15_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Технически, может ли ZeroNet выступить в роли CDN для раздачи медиа-контента? Каковы требования и ограничения? Оправдан ли вообще такой подход (использование ZeroNet в качестве сидера контента)?\n\nИ может, и давно используется - BigFiles. \nПодход оправдан ровно настолько, насколько и любая раздача в торрентах. \nСкачал/создал, хранишь, раздаешь - контент доступен. Не хранишь и не раздаешь - недоступен.",
				"added": 1572086616
			},
			{
				"comment_id": 56,
				"body": "> [web30](#comment_1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH): Очень хорошо, что позакрывали это днище. Может, хоть сидов на рутрекере прибавится.\n\nВряд ли значительно прибавится. Посмотрите статистику скачавших и сидирующих на том же рутрекере. \"Скачать\" и \"сидировать\" две огромные разницы.",
				"added": 1572249677
			}
		],
		"1_1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf": [
			{
				"comment_id": 52,
				"body": "На ютубе есть. Шиеса сейчас везде много.",
				"added": 1571905292
			},
			{
				"comment_id": 65,
				"body": "Да. Судя по всему, там принято решение о полной зачистке. \nКак и в теме про чебурнет, повторюсь -  звучит цинично, но это к лучшему. \nТакими шагами и разрушается текущее \"государство\". И чем скорее тем лучше.\nНу и традиционное \"Север помнит\". И не простит...",
				"added": 1574151250
			},
			{
				"comment_id": 87,
				"body": "> Арбитражный суд Архангельской области признал незаконными постройки, которые возвели на станции Шиес для обслуживания будущего мусорного полигона. Теперь застройщик - ООО \"Технопарк\" - обязан снести их в течение месяца, передает корреспондент \"Новой газеты\". Иск к \"Технопарку\" был подан администрацией Урдомского муниципального образования еще в конце 2018 года. Истец просил на время рассмотрения дела остановить стройку в Шиесе, однако работы продолжались. \"Если застройщик выполнит решение суда, это приведет к полной остановке строительства свалки на Шиесе\", - отмечает \"Новая газета\".\n\nВот как бывает. Молодцы.\n\n> Да. Судя по всему, там принято решение о полной зачистке.\n\nОчень приятно когда такие прогнозы не сбываются. Посмотрим как дальше пойдет.",
				"added": 1578573040
			}
		],
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 57,
				"body": "Основная задача старцев, как они ее себе представляют, взять контроль над интернетом до 21 года, к выборам в Думу (причем желательно минимум за год). И скорее всего это им удастся, скорее всего будут отключать. Криво, косо, кое-как, но будут.\nИ слава Мирозданию. Придумать что-либо более смертоносное для нынешней власти чем изоляция фейсбукиков, ютубчиков, твиторов и твичей в условиях когда \"дрова и так уже сухие\" можно, но очень сложно. \nЭто классическое \"самосбывающееся проклятие\" их и прикончит в считанные дни )",
				"added": 1572599223
			}
		],
		"1_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": [
			{
				"comment_id": 58,
				"body": "Выложить не проблема, но никто не будет сидировать 260 гигов, да и еще на постоянной основе.",
				"added": 1572599733
			}
		],
		"1_1BvGbtWBRYMNXZhv5A1tw3qgdb44pfzi2d": [
			{
				"comment_id": 59,
				"body": "Мы в курсе, спс.",
				"added": 1573038257
			},
			{
				"comment_id": 62,
				"body": "Люблю такие темы )\nСразу всех видно.",
				"added": 1573394594
			}
		],
		"1_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 60,
				"body": "Ок. Отправил...",
				"added": 1573386574
			}
		],
		"4_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 61,
				"body": "> [vcxt](#comment_28_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): нажер это нужно ...\n\nЧтобы не выходить из \"экосистемы\" ZN, я полагаю?",
				"added": 1573386696
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 66,
				"body": "По-моему, в данном случае совершенно непродуктивно пытаться подстроиться под спрос (тем боле несуществующий).\nСоздавайте спрос сами, занимаясь тем, что лично вам ближе.\nНесите контент. Любой, всегда и не спрашивая.",
				"added": 1574414491
			},
			{
				"comment_id": 69,
				"body": "Смотреть \"нЕкому\" потому что \"нЕчего\". Будет чего - будет и кому. Я гарантирую это.\n\nКстати, наблюдаю падение кол-ва пиров в ZN. Или в моей \"видимости\" или вообще...",
				"added": 1574939564
			},
			{
				"comment_id": 70,
				"body": "> Сильно зависит от выходного узла Tor, который может органичивать запросы к трекерам при привышении некоторой их интенсивности. Вплоть до полной невозможности подключения к трекерам. Из своего опыта могу сказать: чем больше вы раздаете зайтов и файлов, тем большее количестов аноносов вы генерите, тем быстрее будут отваливаться трекеры.\n\nНаблюдаю не разово, а в течение недель. Количество трекеров онлайн всегда 30-40 шт, это не проблема.\n\n> К сожалению, правило: \"нет пользователей, потому что нет контента, потому что нет пользователей\" обратного действия не имеет.\n\nИмеет. Просто надо выйти из \"гравитационного колодца\" бедности контента. Это сложно, а иногда и невозможно...\n\n> Уже многие пытались \"нести сюда контет\"\n\nВот ЭТОГО как раз не замечал. Сервисы - да. Контент - нет.\n\n> Хотя, это может сработать, если вам удасться (неким фантастическим способом) перенести сюда контент в объеме эквивалентном, например, rutracker.org. Причем, простого зеркалировнания будет мало, требуется, что бы новый контент появлялся в ZN раньше, чем на других ресурсах и доступ к нему был надежнее и быстрее, чем на других.\n\nЭто правда. В этом и сложность ситуации.",
				"added": 1575019417
			}
		],
		"1_1Ho7Tzm2SCWNRWmSz47pyZC1C1fadtJdSw": [
			{
				"comment_id": 67,
				"body": "Пиров нет.",
				"added": 1574670128
			},
			{
				"comment_id": 68,
				"body": "[Тут не видно?](/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Files)",
				"added": 1574759266
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 71,
				"body": "А в Иране отключили внешний мир или вообще всю сеть внутри грохнули?\nПросто во втором случае уже ничего не поможет кроме мешей, если я что-то понимаю (возможно и не понимаю).",
				"added": 1575023618
			},
			{
				"comment_id": 72,
				"body": "> [if0](#comment_269_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И кто же, позвольте узнать, этот загадочный \"определитель перспективности сетевых технологий\"? лол\n\nС учетом *истории появления и развития* Ygg - это скорее всего и правда самая интересная и популярная сейчас мешка. И там есть жизнь.\n\n> [22igor](#comment_1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54):  нужно в конфиге fileserver ip поставить на ip из yggdrasil, и тогда можно будет обмениваться трафиком в ZeroNet через yggdrasil\n\nНужно еще z-трекер в ygg указать.",
				"added": 1575106966
			},
			{
				"comment_id": 74,
				"body": "Тор, ш2з, ZN - не меши. Разговор о мешах. И меши вообще не про анонимность изначально, хотя они вполне анонимны при условии что не работают оверлеем.\n\nИ при локауте интернета в рамках района/города/страны только меш, развернутая например, на wifi-точках, сохранит работоспособность. А в ней уже и ZN можно запустить или Ретрошару. Тут уже свобода творчества...\n\nА на вопрос ТС,\n> Если отключат Интернет как в Иране. Что делать-то будем?\n\nответ вощемта простой - стройте меши, джентльмены...",
				"added": 1575371083
			},
			{
				"comment_id": 78,
				"body": "Fidonet  - что угодно, но не меш )",
				"added": 1576312763
			},
			{
				"comment_id": 79,
				"body": "> [jk7](#comment_18_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): флоппинет спасёт отца русской демократии!\n\nХодить по дворам ночью и ныкать закладки с флешками. Да.",
				"added": 1576410700
			},
			{
				"comment_id": 81,
				"body": "23 декабря в России пройдут учения по изоляции Рунета, предусмотренные законом о суверенном Рунете. Письмо с датой учений и указаниями от Минкомсвязи было направлено в адрес ряда ведомств и операторов связи. Копию письма разместил в своем Telegram-канале \"ЗаТелеком\" директор Общества защиты интернета Михаил Климарев.\n\nВ письме указано, что учения пройдут 19 декабря, но Климарев также опубликовал телеграмму, из которой следует, что их перенесли на четыре дня. Возможно, изменение даты связано с пресс-конференцией президента Владимира Путина, которая проходит в четверг.\n\nИз документа следует, что целями учений среди прочего являются \"проверка координации организации ремонтно-восстановительных работ на единой сети электросвязи РФ\", \"проверка целостности и устойчивости функционирования интернета на территории России, в том числе в случае искажения информации маршрутизации в базах данных RIPE DB и в системе DNS\", а также \"проверка возможности перехвата абонентского трафика и раскрытия информации об абоненте, блокировки услуг связи для абонентов\".\n\nВ качестве одной из задач учений указана \"отработка навыков применения приемов по обеспечению устойчивости, безопасности и функционирования интернета на территории России\", пишет TJ. К учениям планируют привлечь в том числе МВД, Минобороны, ФСБ, ФСО, Роскомнадзор, Ростелеком, \"МегаФон\", МТС, \"ВымпелКом\" и \"Лабораторию Касперского\".",
				"added": 1576756289
			},
			{
				"comment_id": 84,
				"body": "«Блокировка YouTube может создать околореволюционную ситуацию»\nПочему российским властям важно научиться точечно отключать интернет к 2021 году\n\nhttps://www.znak.com/2019-12-25/pochemu_rossiyskim_vlastyam_vazhno_nauchitsya_tochechno_otklyuchat_internet_k_2021_godu",
				"added": 1577285759
			},
			{
				"comment_id": 85,
				"body": "Весь Знак лежит.",
				"added": 1577371460
			}
		],
		"1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": [
			{
				"comment_id": 76,
				"body": "Никогда такого не было, и вот опять.\nНо самое главное хранить персданные в России, иначе как же их воровать и продавать?",
				"added": 1575796206
			}
		],
		"2_1Ho7Tzm2SCWNRWmSz47pyZC1C1fadtJdSw": [
			{
				"comment_id": 77,
				"body": "> [tyum](#comment_1_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx):  вот поисковик не хуже гугла http://127.0.0.1:43110/1xiwbXaTbo9XU32hEpW4NyjZHrugSFdo6/?/\n\nСколько ни старался, добавить новый зайт туда не получилось.",
				"added": 1575895303
			}
		],
		"1_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": [
			{
				"comment_id": 82,
				"body": "Это было бы хорошо и православно. Но не понятно как завернуть ZN в i2p так чтобы она оттуда не вылезала никуда больше.",
				"added": 1577093780
			}
		],
		"1_1DwjB1qvyHRAa7bLFeosWy7wMaNsCDCeGN": [
			{
				"comment_id": 83,
				"body": "> [koloved](#comment_2_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA): Новости даркнета не в даркнете? XD\n\nExactly...",
				"added": 1577097190
			}
		]
	},
	"comment_vote": {
		"181_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"10_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"12_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB": 1,
		"11_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"185_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"19_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"198_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"207_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"77_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"2_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"235_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"239_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"246_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"250_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"76_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"45_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"18_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB": 1,
		"13_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"107_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"106_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"171_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"174_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"205_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"72_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"93_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"180_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1PS34S4Rnz9kyBEicX1nGsARnwmDQniHYH": 1,
		"12_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"1_15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2": 1,
		"30_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"32_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"33_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1BSQUgGx4ncaBdVS6LBN3ep7i3BvUNctR6": 1,
		"10_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"7_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": 1,
		"7_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy": 1,
		"20_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"12_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"6_1KcPa74X88hPnyc64nnkXveXA8daeKpvcU": 1,
		"2_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X": 1,
		"249_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_1BvGbtWBRYMNXZhv5A1tw3qgdb44pfzi2d": 1,
		"23_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"12_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X": 1,
		"3_1PD4Rp1t61tPPYr4KLidGkLxdS4QSqrsBv": 1,
		"13_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X": 1,
		"2_1Ho7Tzm2SCWNRWmSz47pyZC1C1fadtJdSw": 1,
		"1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"2_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"3_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"2_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww": 1,
		"3_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww": 1,
		"6_1EFhXfFwH97coL14ZYb1WCUPaHemXJby2y": 1,
		"273_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"2_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": 1,
		"1_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"4_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"5_15MjvWSzncffai1aqXybyrsg1SwLk2iNbh": 1
	}
}