{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "наш мир нереален",
			"body": "обсуждение! https://www.youtube.com/watch?v=huAL5Qlxe_Q",
			"added": 1495633339
		},
		{
			"topic_id": 2,
			"title": "анимешники есть? а если найду?",
			"body": "ня кавай десу!\n\nдавайте пообщаемся\n\nпишите/рекомендуйте тайтлы к просмотру",
			"added": 1495885180
		},
		{
			"topic_id": 3,
			"title": "Телеграм, телега, телегус папирус",
			"body": "много ли тут пользователей телеграм? на сколько он надежен на самом деле? какие клиенты юзаете? обсуждение!",
			"added": 1496263472
		}
	],
	"topic_vote": {
		"1_1JXr7HXJit5v32121p1bfa9ezhurhc2ZPG": 1,
		"1_1HHsJVKEXQwfg8d1NSnNi55SfMWCsuqGYR": 1,
		"1_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"2_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"1_12WG2wGf3i1pGq6aRSmw4oaC5jkLKPiMyz": 1,
		"2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"1_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": 1,
		"1_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1KGjw62VbKqGtehKJ1MA6cF6s8KmAQY8ha": 1,
		"2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_175A4pxQi9MxM3im5oWZGqZPTyVWXQA6Bw": 1,
		"1_14cKggGNbHgLq1W4XYs56i2B3KciGwpurk": 1,
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_1HvraQzSVUU6TKffYzvCzEXYYjXPAZ3nkW": 1,
		"2_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": 1,
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": 1,
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": 1,
		"1_1AmvBauncC7rZyisrSf4a56tbJCNtdrxN5": 1,
		"1_1BGconZDFECxudsuKsBnkXpX1iqKbUWMku": 1,
		"2_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": 1,
		"1_1Anoh6Rexrn9FDhBgntUXUx3CYatV2LPZY": 1,
		"1_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1_1JXr7HXJit5v32121p1bfa9ezhurhc2ZPG": [
			{
				"comment_id": 1,
				"body": "+",
				"added": 1495383790
			}
		],
		"1_1HHsJVKEXQwfg8d1NSnNi55SfMWCsuqGYR": [
			{
				"comment_id": 2,
				"body": "да! поддержите тему!",
				"added": 1495470807
			}
		],
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": [
			{
				"comment_id": 3,
				"body": "это что?",
				"added": 1495470894
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 4,
				"body": "что это такое?",
				"added": 1495471019
			}
		],
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": [
			{
				"comment_id": 5,
				"body": "кек",
				"added": 1495471068
			}
		],
		"1_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 6,
				"body": "Эээмэмэм\nДратути. Я хочу поведать вам важную тайну. Наш мир нереален. Это матрица. Но не такая которую вы видели в фильмах. Я сам из другого мира. Рептилоиды пидарасы затащили меня сюда, и я не помню откуда я? Может с венеры а может с сириуса? Настоящие люди должны уметь телепатию и полет, но эти возможности заблокированы. Большенство настоящих людей эвакуировано на другие планеты. Есть так же мы- духи в телах людей. Но мы тоже, скоро, покинем этот мир.\n\nБольшинство людей на земле это боты. Физика. Религия. Магия. Закон бумеранга. Все это модификации поставленные на матрицу.\n\nРептилоиды пидарасы.\n\nСкоро космическая война между расами достигнет и солнечной системы. В китае разразитсья эпидемия. А мы - высшие существа из высших измерений уйдем далеко отсюда. Нам не интересны даже шестимерные миры с компьютерами по миллиарду гигагерц. Мы стремимся лальше. Туда, где есть только энэргия. Скоро. Земля будет стерта. А пока. Мы будем баловатся, троллить роботов, ломать систему, юзать руны.\n\nВсе что я вам рассказываю никто знать не должен. Но случились события. Я в отчаянии. Я просто сделал это и мне все равно что дальше.\n\nРептилоиды пидарасы.\n\nНе поддавайтесь иллюзии. Если ваш мозг не вскипел прослушав все это , возможно вы один из нас\n\nСпасибо за внимание. С вами был Анонимный Пришелец. Рептилоиды пидарасы.",
				"added": 1495633361
			}
		],
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 7,
				"body": "Свобода пораждает беспредел",
				"added": 1495885009
			},
			{
				"comment_id": 8,
				"body": "шучу",
				"added": 1495885015
			},
			{
				"comment_id": 9,
				"body": "> [murka](#comment_15_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Беспредел порождает власть.\n\nдавайте станем властью!",
				"added": 1495904525
			}
		],
		"2_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 10,
				"body": "> [murka](#comment_14_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Злую Таню смотри. Вот.\n\nспасибо!",
				"added": 1495904593
			},
			{
				"comment_id": 27,
				"body": "> [ronins](#comment_2_1CuVyHDng9o9zNsxtar3ddGNssLZ9aQKy5): Из онгоингов могу посоветовать:Clockwork PlanetEromanga SenseiBusou Shoujo MachiavellianismAkashic Records\n\nспасибо",
				"added": 1496516699
			}
		],
		"1_12WG2wGf3i1pGq6aRSmw4oaC5jkLKPiMyz": [
			{
				"comment_id": 11,
				"body": "напишите мне пару писем тут, хочу пообщатся по старинке сдесь)))",
				"added": 1495905021
			}
		],
		"2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 12,
				"body": "История одной поездки дяди: Ехал как то он ЗИЛом с другом в город за гробом (в деревне кто-то умер, а большая машина был только у него). По дороге назад подобрали они одного мужика. Места в салоне не было, поэтому мужик полез в кузов. Внезапно начался дождь. Мужик решил спрятаться в гроб и накрыть себя крышкой. Потом дядя с другом подобрали по дороге еще несколько людей. Они так же полезли в кузов. Мужик (тот, что в гробу), услышав шум, открыл крышку гроба встал и спросил: - Народ, а что - дождь уже закончился? Двое людей в момент выскочили на ходу из ЗИЛа и переломали себе ноги и пару ребер. Другому \"повезло\" чуть больше. Он отключился сразу",
				"added": 1495910833
			},
			{
				"comment_id": 22,
				"body": "Вступительная лекция в техническом ВУЗе. Профессор говорит: \n- Представьте себе завод, куда каждый день привозят машину спирта для техничных нужд. Стоит огромный бак, куда заливают спирт. Около бака сидит учетчица, которая выдает спирт строго по накладной; для этого у бака есть краник. Вечером остатки спирта сливаются через тот же краник. Ставлю вопрос: как украсть спирт с завода? \nОбалдевшие студенты начинают выдвигать версии. \n- А теперь ответ, - говорит наш профессор. - Инженеры поставили в бак ведро. В результате ведро наполнялось, когда утром заливали бак, а после того как спирт сливался, ведро вытаскивалось и распивалось. А теперь будем учиться на инженеров.",
				"added": 1496263863
			},
			{
				"comment_id": 23,
				"body": "На светофоре стоят рядом «Запорожец» и крутой «Мерседес». Из «Запорожца» высовывается рука и стучит в стекло «Мерседеса»:\n- Мужик, у тебя бумага для факса есть? У меня кончилась, а мне сообщение идет.\n«Мерседес» срывается на красный и уезжает. Его хозяин приезжает в гараж и орет на механиков:\n- Я говорил, чтобы вы мне установили в машину все, что можно. Какой-то ржавый «Запорожец» факс имеет, а вы мне что подсунули?\nЕму тут же поставили факс. Через неделю обе машины встречаются на стоянке у супермаркета. Хозяин «Мерседеса» с довольным видом стучит в стекло «Запорожца»:\n- Мужик, а мужик?\nМолчание. Снова стук, снова молчание. Наконец из «Запорожца» высовывается голова:\n- Ну чё?\n- Мужик, бумага для факса нужна? Могу одолжить.\n- Ты из-за такой ерунды меня из джакузи вынул?",
				"added": 1496263882
			},
			{
				"comment_id": 24,
				"body": "Клaссификaция чaев\n\nЧaй по-кaтолически: зaвaрен в чaйнике по всем прaвилaм.\nЧaй по-доминикaнски: с aромaтом роз.\nЧaй по-фрaнцискaнски: с цветочкaми.\nЧaй по-сaлезиaнски: зaвaрить чaй и отдaть его детям.\nЧaй по-иезуитски: опрaвдывaет средствa к вящей слaве Божией.\nЧaй по-протестaнтски: в пaкетикaх.\nЧaй по-прaвослaвному: из сaмовaрa.\nЧaй по-прaвослaвнутому: из сушеной морковки (и процеженный через фофудью).\nЧaй по-aльбигойски: зaвaривaется некуртуaзными фрaнкaми и дaется господaм aльбигойцaм нa понюхaть.\nЧaй по-тaмплиерски: зaвaривaется в строжaйшей тaйне.\nЧaй по-иеговистcки: без зaвaрки.\nЧaй по-мусульмaнски: от кружки с поросенком отбивaется поросенок и чaй пьется из черепкa.\nЧaй по-иудaистски: не вaри чaй в молоке\nЧaй по-нaучному: a нa кaфедре только что зaвaрилось, пошли, рaботa никудa не уйдет\nЧaй по-лингвистически: сорт Фердинaнд де Соссюр.\nЧaй по-лингвистически (иной вaриaнт): сорт Бодуэн-де-Куртене.\nЧaй по-модернистски: должен быть густ, пaхуч и эклектичен, кaк модернистский ромaн. Листья всего, что только вaрится, кидaются в общую зaвaрку.\nЧaй по Дерриде: кофе.\nЧaй по-писaтельски: когдa я сел писaть ромaн, этa бурдa еще былa чaем.\nЧaй по-переводчески: то же, что по-писaтельски, но с лимоном.\nЧaй по-редaкторски: предлaгaется aффтaрaм в кaчестве йaду.\nЧaй по-интернетчиковски: то же, что по-писaтельски. И нaфигa я зaляпaл клaву этой бурдой?\nЧaй по-интернетчиковски, версия 2.0: почитaл бaшорг, угостил чaем клaву.\nЧaй по-дизaйнерски: нaрисовaн и зaaнимировaн в Photoshop CS3.\nЧaй по-прогрaммистски: употребляется в сухом виде без зaвaривaния, ибо мысль.\nЧaй по-ICQ: Нужно чокaться кружкaми с собеседником через монитор.\nЧaй по-скaйповски: То же сaмое, что чaй по-ICQ, но с гaрнитурой и веб-кaмерой.\nЧaй в Контaкте: блин, я же шел зaвaривaть чaй!\nЧaй по-диккенсовски: нa Рождество и с морaлью.\nЧaй по-филдинговски: то же, но ржaчно.\nЧaй по-стерновски: его можно пить не только из сострaдaния, но из aппетитного его видa.\nЧaй по-ролевушному: отыгрывaется коньяком.\nЧaй по-реконструкторски: вырaщен, собрaн и высушен сaмостоятельно, зaвaривaется и подaется в aутентичной посуде.\nЧaй по-реконструкторски (экстремaльный вaриaнт): отыгрывaется техническим спиртом. Или сaмогоном, смотря что реконструируют.\nЧaй по-мaстерски: приходит к состоянию чaя по-переводчески по умолчaнию. После строякa, мaтa, и прочей околоигровой жизни Потому игрокaм нaстоятельно рекомендуется отыгрывaть чaй по-мaстерски кофе в пaлaтку, коньяком, глинтвейном, и тaк дaлее\nЧaй по-гномски: зaвaривaется с блaгословения aулэ, перед тем, кaк пить, чaйник нaдо попытaться рaсколотить Но с позволения гостя не сделaть этого.\nЧaй по-дориaтски: рецепт стaщен у гномов.\nЧaй по-нaрготрондски: рецепт стaщен у Дориaтa, только зaвaрки больше.\nЧaй по-гондолински: рецепт стaщен у тaмплиеров. И об этом никто не узнaл!\nЧaй по-феaнорингски: зaвaривaется в Лосгaре.\nЧaй от Туринa Турaмбaрa: зaвaривaется вопреки судьбе. Но все рaвно невкусный.\nЧaй по-нуменорски: пьется из золотых чaшек нa пляжaх Вaлинорa. Прaвдa, всего один рaз.\nЧaй по-нуменорски-2: ну оччччень жидкий и соленый чaй прaктически однa водa!\nЧaй по-гондорски: черный чaй из листиков белого древa.\nЧaй по-aрнорски: a нaш все рaвно круче гондорского!!!\nЧaй по-морийски: кипятится нa бaлроге.\nЧaй по-ровaнионски/рохaнски: его нужно пить, кaк лошaдь!\nЧaй от Горлумa: зaвaривaется из мелкой рыбббсы, змейсов и пияввсов вкусссно, моя прелесссть, голлм\nЧaй по-ниеннистски: черный и пaхнет полынью. Проще говоря, эллери, не жaлейте aбсентa.\nЧaй по-перумовски: много чaя, но вкус уже не тот, дa\nЧaй по-перумовски, сaкрaльный: в процессе выпивaния чaя ты осознaешь, что есть Боги, еще более крутые Боги, еще более крутые, чем более крутые И чaй все не кончaется\nЧaй по-хогвaртски: с тыквенным соком.\nЧaй от близнецов Уизли: не знaю, чего они тудa нaмешaли, но выпив, окрaсишься в кaкой-нибудь экзотический цвет. Или у выпившего вырaстут ослиные уши.\nЧaй от Ксенофилиусa Лaвгудa: ой, ну и зaпaх a вид-то кaкой психоделический (не инaче у хиппи зaвaривaть учились). Я всегдa знaл – не чaй они потребляют!!!\nЧaй по Ордену Фениксa: не пускaйте Тонкс к чaйнику, a остaльное приложится\nЧaй по-мaлфоевски: белый.\nЧaй по-пожирaтельски: проверьте, не для Дaмблдорa ли Снейп это зaвaривaл.\nЧaй по-aзкaбaнски подaется в мятой aлюминиевой кружке. Выпивший лишaется рaдости и интересa к жизни.\nЧaй по-дaмблдоровски: в чaе от aльбусa Дaмблдорa глaвное- побольше лимонных долек!\nЧaй по-дaмблдоровски-2: чaй от aберфортa Дaмблдорa, подaётся в очень нестерильном стaкaне. Пaхнет козaми.\nЧaй по-мaкгонaгaлловски: трaнсфигурировaн из сливочного пивa.\nЧaй по-сириусовcки: огневиски.\nЧaй по-волдемортовски: кровь единорогa+яд Нaгини в соотношении 50:50.\nЧaй по-снейповски: не вздумaйте это пить, если вaм дорогa жизнь!\nЧaй по-джедaйски: кипятится с помощью Силы.\nЧaй по-ситхски: кипятится в лaве.\nЧaй по-скaйуокерски: возможно выпить только с использовaнием силы, вслепую, удерживaя кружку нa кончике сaберa.\nЧaй нa aррaкисе: у выпившего синеют глaзa, он нaчинaет орaть \"Муaд-диб!\" и творить стрaнные вещи. Что же вы хотите, чaй нa aррaкисе зaвaривaется нa Спaйсе.\nЧaй До-Урден: ядовитое черное вaрево, зaвaревaемое с блaгословения богини-Ллос. Нa свету мгновенно испaряется.\nЧaй по-aмберски: дaже пить это не буду, отрaвлено, сто пудов отрaвлено.\nЧaй по-aмберски (иной вaриaнт): выпить может только тот, в чьих жилaх течет кровь королей aмберa. Остaльные же получaт рaсстройство желудкa.\nЧaй по-приддски: нa воде, собрaнной в шторм.\nЧaй по-нaдорски: зaвaривaется минимум рaз 10.\nЧaй по-кэнaллийски: \"Чёрнaя кровь\"\nЧaй по-эпинински: кипятится с помощью Молний.\nЧaй по-сaвиньякски: из виногрaдa.\nЧaй по-aвтоботски: из нефти.\nЧaй по-десептиконски: из нефти, потыренной у aвтоботов.\nЧaй по-шaпоклякски: с тортиком. Шоколaдным. Изготовленным первого aпреля. Свеженьким!\nЧaй по-королельвовски: хaкунa мaтaтa и зaчем нaм чaй?\nЧaй по-супергеройски: в плотно зaкупоренном термосе.\nЧaй по-суперзлодейски: с ядом и взрывчaткой.\nЧaй по-бендеровски: с огоньком.\nЧaй по-гомеровски: Мaaaрдж, принеси чaю! Нет, лучше пивa!\nЧaй по-робинзонски: с бaнaном и в пятницу.\nЧaй по-рaстaмaнски: трaвяной.\nЧaй по-хипповски: всех цветов рaдуги.\nЧaй по-пaнковски: водкa и вообще всё, что горит.\nЧaй по-метaллистски: пиво.\nЧaй по-готски: очень крепкий и очень черный чaй.\nЧaй по-r'n'bшному: сaмый дорогой и элитный сорт подaется в золотой чaшке, рaзмешивaется плaтиновой ложкой с бриллиaнтaми Свaровски. И коньякa побольше. Больше! Ещё больше!!!\nЧaй по-эмокидски: в пaфосной черной кружечке с розовенькими рaзбитыми сердечкaми. Соленый от периодически кaпaющих в него горючих слёз.\nЧaй по-конформистски: у нaс тaкой же чaй, кaк у всех!\nЧaй по-нонконформистски: чaй это конформизм!!!\nЧaй по-постнонконформистски: кaкaя рaзницa Всё рaвно придётся пить этот чaй.\nИ в зaключение:\nЧaй по-волaндовски: только первой свежести, онa же последняя.\nЧaй по-бегемотовски: рaзве бы я позволил себе предложить дaме чaю? Это чистaя зaвaркa!",
				"added": 1496264390
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 13,
				"body": "> [gomzik](#comment_56_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): https://play.google.com/store/apps/details?id=org.disrupted.rumble\n\nне работает",
				"added": 1495911961
			},
			{
				"comment_id": 21,
				"body": "да хули вы такие скучные............................................................................................................................................",
				"added": 1496263658
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 14,
				"body": "> [hanamemo](#comment_4_149VTGbqfHkDvZqrsWxSHJ81hqoMNa799J): Всем привет\n\nи тебе не хворать",
				"added": 1495912082
			},
			{
				"comment_id": 19,
				"body": "> [rosaly](#comment_1_1KWHWJ7JBKf3mwpCKh95Qtxwj3eZv8ikFY): Здаров всем)\n\nприветусик, сестренка",
				"added": 1496154823
			}
		],
		"1_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": [
			{
				"comment_id": 15,
				"body": "> [gomzik](#comment_65_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Скачал дистрибутив для Windows. Не вижу внутри TorBrowser\n\nа ты по папкам пройдись, тор есть",
				"added": 1496080995
			},
			{
				"comment_id": 16,
				"body": "> [gomzik](#comment_65_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Скачал дистрибутив для Windows. Не вижу внутри TorBrowser\n\nстоп, а сидел ты через что???",
				"added": 1496081269
			},
			{
				"comment_id": 17,
				"body": "> [gomzik](#comment_67_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А почему вы вообще хотите от него избавиться?\n\n1. нагружает систему\n2. лично мне бесполезен\n3. используя тор в любой форме попадаешь в базу ФСБ",
				"added": 1496154320
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 18,
				"body": "жаль",
				"added": 1496154791
			},
			{
				"comment_id": 25,
				"body": "USED: 27.0K/30KUSED: 27.0K/30K\nповысте,пж!",
				"added": 1496264484
			},
			{
				"comment_id": 28,
				"body": "USED: 29.0K/30KUSED: 29.0K/30K\nああああああああああああああああああ",
				"added": 1496524243
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 20,
				"body": "> [murka](#comment_18_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Есть один способ, не проверенный. Проверю, отпишусь если рабочий.\n> \n> А вот это плохо. Для меня всегда это проверка осознанности поступка. Боль имеет смысл только как средство сохранения жизни, и если человек действительно всё, то боль не должна пугать. Нет, я конечно не к чему не призываю, это больше требование к самому себе. Хотя и отговариваю, в какой-то степени, да. Суицидники же в основном хорошие люди (кроме позеров), наоборот тех других нужно убивать, которые имеют наглость хотеть жить. Да и вообще, суицид — явление больше социальное и альтруистическое, может порой стоит забивать на мнение людей и действовать только в личных интересах, по крайней мере не в интересах ближнего окружения. Расширять круг общения стоит, потому-что в узких сообществах, вроде зеронетовского, обычно сплошная чернуха и безысходность, и вообще страшные вещи творятся.\n> Но опять же, извиняюсь за попытку на что-то повлиять, действуй на свое усмотрение. Я просто люблю вставить ИМХО, где не следует.\n\nпозяяяя",
				"added": 1496154872
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 26,
				"body": "> [pozya](#comment_12_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Контактов нет, это да. Но сейчас риот потихоньку (хотя и медленно) приходит к вменяемому виду.\n> Ну и как всегда остается XMPP. С Movim + Gajim + Conversations вполне юзабельно.\n\nопиши пожалуйста принципы работы и возможности",
				"added": 1496423171
			}
		],
		"2_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": [
			{
				"comment_id": 29,
				"body": "PLEASE! HELP AND ALSO USED: 29.3K/30KUSED: 29.3K/30K!",
				"added": 1496693168
			}
		]
	},
	"comment_vote": {
		"19_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"7_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"8_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"1_1GoaTbvoF1HFSuh4sD9HYY4hUiDUmEtvz4": 1,
		"21_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"20_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"6_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"5_14HmFoEtmv6iw4TiaASeaFaDLwmquUtg6j": 1,
		"6_14HmFoEtmv6iw4TiaASeaFaDLwmquUtg6j": 1,
		"22_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": 1,
		"24_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"22_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"23_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"12_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"1_1KWHWJ7JBKf3mwpCKh95Qtxwj3eZv8ikFY": 1,
		"42_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"14_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"19_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"29_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1
	}
}