{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 1,
				"body": "> [captain404](#comment_20_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): yes but here it make much more sens, cause u also block upload of that id so so much better than just mute someone on fb or twitter\n\nYour plan isn't to mute users for your convenience, but to censor them by not relaying their data? What are you doing here captain404?",
				"added": 1616482241
			},
			{
				"comment_id": 2,
				"body": "> [captain404](#comment_21_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): i came for the plurality of opinion but that doesnt mean i must endorses those, also because thei are some fucking illegal content and i dont want share it and some opinion are just bad as a point i dont think anybody need them\n\nOn zerotalk it's only text. Do you oppose the 1stA of the bill of rights?",
				"added": 1616493621
			},
			{
				"comment_id": 4,
				"body": "> [captain404](#comment_22_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): yes i have my own idea about right and freedom and stil u call me censor, but i dont owne u any hosting stop ignoring that\n\nCould you maybe expand on your own ideas about the 1stA ? Your problem is that you would have to rewrite the ZN code, integrate a seed ban linked to an interchangeable crypto address... In short you are better muting users whose text is unbearable to your mind.",
				"added": 1616494253
			}
		],
		"1616492110_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32": [
			{
				"comment_id": 3,
				"body": "It's a totalitarian hegemonic project to establish planetary serfdom started with the league of nations and the establishment of the federal reserve system/IRS.\n\n>“Some even believe we are part of a secret cabal working against the best interests of the United States, characterizing my family and me as ‘internationalists’ and of conspiring with others around the world to build a more integrated global political and economic structure—one world, if you will. If that’s the charge, I stand guilty, and I am proud of it.”\n-- Mr. Rockfeller\n\n\n>We are grateful to The Washington Post, The New York Times, Time Magazine, and other great publications whose directors have attended our meetings and respected their promises of discretion for almost forty years. It would have been impossible for us to develop our plan for the world if we had been subject to the lights of publicity during those years. But, the world is now more sophisticated and prepared to march towards a world government. The supranational sovereignty of an intellectual elite and world bankers is surely preferable to the national auto-determination [democracy] practiced in past centuries.\"\n—David Rockefeller in June 5, 1991 at the Bilderberger meeting in Baden Baden, Germany (a meeting also attended by then-Governor Bill Clinton.\n\n\n>The real menace of our Republic is the invisible government, which like a giant octopus sprawls its slimy legs over our cities, states and nation . . .  The little coterie of powerful international bankers virtually run the United States government for their own selfish purposes. They practically control both parties . . .  [and] control the majority of the newspapers and magazines in this country. They use the columns of these papers to club into submission or drive out of office public officials who refuse to do the bidding of the powerful corrupt cliques which compose the invisible government. It operates under cover of a self-created screen [and] seizes our executive officers, legislative bodies, schools, courts, newspapers and every agency created for the public protection.\nJohn F. Hylan, former Mayor of New York City,\n\nI hope you will understand the threat... (it's consolidation stage now).",
				"added": 1616494093
			}
		],
		"1615829493_18w7xHq6PfLBDhcTqJSMkgvqYEYiKWEtjS": [
			{
				"comment_id": 5,
				"body": "full medias ban ! lol.",
				"added": 1616494753
			}
		]
	},
	"comment_vote": {}
}