{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1567722717,
			"title": "Can you see my Zite (An Anarchist FAQ)",
			"body": "I just moved my old ZeroNet install to a different VM with Tor Always mode enabled in hopes that it would allow me to actually publish new Zites without this annoying \"open port X that's actually already open bug\". The good news: it says I can! But I need a verification that other people (especially non-Tor users) can see it. Thanks!\\\n\nThe zite is here:\n\nhttp://127.0.0.1:43110/15svGCBYesS8QjbwvZpxSeLvf6At2sk4RB/",
			"added": 1567722716
		},
		{
			"topic_id": 1567724543,
			"title": "Requesting Seeds on Lectures on History of Democracy",
			"body": "http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw/George_Novack_Lectures_on_History_of_Democracy.zip\n\nIt's by a left-wing political thinker if that makes any difference. For an upcoming Zite!",
			"added": 1567724541
		},
		{
			"topic_id": 1567724707,
			"title": "I'm going to paste links to all my Zites here that I am mirroring from Freenet (Seeders Welcome)!",
			"body": "These are my Zites mirrored from Freesites I have made in the past. See comments. Thanks!",
			"added": 1567724704
		},
		{
			"topic_id": 1567752163,
			"title": "How to brute force ZeroNet zite names?",
			"body": "Like the  HeLLo in http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/? I am sure it takes time but I only need a few characters. Thanks.",
			"added": 1567752159
		},
		{
			"topic_id": 1567999355,
			"title": "Be Kind to Bug Friends",
			"body": "When you find inside your home a spider or an insect of any kind in a place where they do not belong, you should drop what you are doing at once and seek to rescue it from the potential danger of being in a place where they could be harmed. You must capture the insect and release it back into the wild, careful not to cause it any injury or unnecessary fright, careful not to injure yourself with a sting or a bite. When walking you should always be careful not to step on any insects carelessly, for how would you feel if someone stepped on you? They are as terrified of us as we are of them, maybe even more so. It is always a tragedy when insects have to be killed. They too are living things capable of feeling wellness and pain. Be kind to them even if they cannot understand your kindness or show you any gratitude. Even for the smallest of God's creatures, when love and kindness is shown the world becomes a much brighter place.",
			"added": 1567999350
		},
		{
			"topic_id": 1568002955,
			"title": "If everyone on here had taken ~300μg of quality LSD there would be a lot less hate on here.",
			"body": "If you want to be racist fine. But you won't be so hateful and closed minded once you've REALLY gone deep inside yourself and seen the golden light. If you have nothing to fear, you won't be afraid of it peeling back your preconceptions of reality, of being open to the possibility that everything you know is wrong. Let it fill you up, bring down those psychic defenses and see clearly. I certainly am not afraid of such possibilities, I admit them to myself every day. You have to take enough to really let it dissolve the ego, to really cleanse the spirit, so you need a trip sitter and a test-kit to make sure you are safe, good set and setting. Everyone should take psychedelics at least once in their life.\n\nIf every ZeroNet user took psychedelics there would be a lot less hate on here.\n\nNaturally I have to say \"if you actually do this get a DEA license to take it\" or \"do it somewhere legal\" as a legal disclaimer but you know...",
			"added": 1568002949
		}
	],
	"topic_vote": {
		"1567728985_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1567722717_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 1,
				"body": "> [katian](#comment_32_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx): it works for me !\n\nHooray!!!",
				"added": 1567722878
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_82_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Submitting my site here helped me when I was launching sites and didn't yet have my own zerobox. [...]\n\nAdded :)",
				"added": 1567749944
			}
		],
		"1567724543_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 2,
				"body": "Also you can press \"seed\" on the \"latest\" section of ZeroUp. Much appreciated!\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/?Latest",
				"added": 1567724590
			}
		],
		"1567724707_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 3,
				"body": "New zites pasted from here on in order (keep checking for updates). PLEASE SEED:\n\nCursor Mania: http://127.0.0.1:43110/1Gby75JN8jvYTJyHRKuV36YF2fXXDqTKoq/\nred.i2p: http://127.0.0.1:43110/1DACg1rSKLwj2sz7M6D4XfnPgKq9Q1BvDk/\nUniversal Declaration of Human Rights: http://127.0.0.1:43110/1Hd6RgX8ybVeQR21FLxfR6aL8D5mf8CbtZ\nSuicide Prevention Hotlines: http://127.0.0.1:43110/15GbDJPVbjW3rs9b2oNUjYVPAVuW1KcPMe\nA Cypherpunk's Manifesto: http://127.0.0.1:43110/1Eud3ofrZHh6Gz9Cyn2Kr64hjXkiG9JXRJ\n\nI am the ONLY person keeping these zites alive (PLEASE SEED):\n\nThe State and Revolution by V.I. Lenin: http://127.0.0.1:43110/14GWQkfKDhUvc4zQQtcurueqJS16m4sPkj\nThe Russian Revolution by Rosa Luxemburg: http://127.0.0.1:43110/1AdyBomxVUGVoSQ4Hz2LUmZNhG4VgPyp2T\nThe Civil War in France by Karl Marx: http://127.0.0.1:43110/1AgZ7frCzPeRdDL2gQ3ZgCA83awxahCfW7\nManifesto of the Communist Party: http://127.0.0.1:43110/1M4zzoXAWoEgME42DCFULihcBsXBmCyMC5\n\nMany more to come! THIS COMMENT WILL BE CONTINUALLY UPDATED!\n\nThanks!",
				"added": 1567724747
			},
			{
				"comment_id": 7,
				"body": "> [memesadler](#comment_115_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Cool. Here's my Nazi site. Fash Nest.\n\nLooks like someone was TRIGGERED (see usually right-wing people say that to make fun of leftists, that's why its funny). I mean this is ZeroNet. You're an adult you can say what you want. It's a censorship resistant platform. I won't seed your site because I think your views are the embodiment of evil, but unlike you if I was in power I would not censor my political opponents. And this fact speaks for itself.\n\nHere's my libertarian socialist zite: http://127.0.0.1:43110/1CoVgJCDb588bVtxU9VAwGLGuybzdr3mfg/",
				"added": 1567824408
			},
			{
				"comment_id": 9,
				"body": "> [memesadler](#comment_117_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Hello, fellow human. I have made an act of humor to elicit laughter. Ha. Ha. Ha. [...]\n\nNormally I wouldn't reply to fascists but I am somewhat bored. I am glad you enjoy my elicitation of humor. As for the later point;\n\nThe Tsar was already long overthrown when the Bolsheviks took power, the Kerensky government (which came to power as a result of the February revolution and did not listen to the basic demands of the people for an end to the war, land, and bread) was overthrown by a popular insurrection led by the Bolsheviks, initially one of the most peaceful in the world until there was a violent reaction from the ruling classes, leading a military intervention from all sides that started the bloody Russian Civil War. How could there be peaceful fraternity and brotherhood between oppressor and oppressed? Yes have your \"free exchange of ideas\" but have it in a place where the society is already in the hands of the oppressed, the workers and peasants (in the case of Russia). This was sort of the idea. Even then in this impossible scenario there was libertarian sentiments and pleas for liberty from the socialist, communist, and anarchist left. That which I agree with most is Rosa Luxemburg's pamphlet 'The Russian Revolution' which I have mirrored on ZeroNet here:\n\nhttp://127.0.0.1:43110/1AdyBomxVUGVoSQ4Hz2LUmZNhG4VgPyp2T/\n\nI'll quote:\n\n\"Freedom only for the supporters of the government, only for the members of one party – however numerous they may be – is no freedom at all. Freedom is always and exclusively freedom for the one who thinks differently. Not because of any fanatical concept of “justice” but because all that is instructive, wholesome and purifying in political freedom depends on this essential characteristic, and its effectiveness vanishes when “freedom” becomes a special privilege...\n\nWithout general elections, without unrestricted freedom of press and assembly, without a free struggle of opinion, life dies out in every public institution, becomes a mere semblance of life, in which only the bureaucracy remains as the active element. Public life gradually falls asleep, a few dozen party leaders of inexhaustible energy and boundless experience direct and rule. Among them, in reality only a dozen outstanding heads do the leading and an elite of the working class is invited from time to time to meetings where they are to applaud the speeches of the leaders, and to approve proposed resolutions unanimously – at bottom, then, a clique affair – a dictatorship, to be sure, not the dictatorship of the proletariat but only the dictatorship of a handful of politicians, that is a dictatorship in the bourgeois sense, in the sense of the rule of the Jacobins\"\n\nOf course her criticisms may have been premature for a society in the midst of a bloody civil war for the future of Russia and the world as some critics have pointed out, but as for what followed her writings are prophetic in the extreme (this was written in 1919). She was right in her criticisms of Lenin and Trotsky, her warnings of the possibility of something terrible if the revolution failed to spread to Germany and abroad as it inevitably did. Do not think I am an idiot here, I know the horrors of what followed under Stalin and later dictators.\n\nAs for the \"free exchange of ideas\", the internet has opened up an avenue for the truly free, uncensorable communications, for the purely intellectual free flow of ideas unpolluted by the groupthink so typical in grand political rallies and other typical avenues of public entertainment. I do not trust the masses to always make the best decisions, but without freedom they have nothing. Remember that your Hitler was a very popular fellow in Germany during the 1930's. But you like Hitler and even though I find that detestable I can say \"remember that X ruler you hate historically was very popular\" so you get the point. Unlike with a violent march threatening, lynching, and intimidating minorities, someone such as yourself can hold racist views and host their own website on a network such as this. I defend the technology, it's necessary for a free and democratic society to exist even if it can be abused, even if its used who think a free and democratic society shouldn't exist. There is a paradox of tolerance here I admit that must be safe-guarded against, but the censorship resistant internet is a world in its own right. I won't attempt to underplay the dangers of internet radicalization to racist, violent, and hateful ideologies but it isn't the same as open violence, intimidation, and the violent seizure of political power which anti-fascists tend to stand against. So there, you have your free exchange of ideas. Even if you don't agree with it, it's a \"safe space\" for everyone who uses it.",
				"added": 1567830948
			},
			{
				"comment_id": 16,
				"body": "> [kidcourageous](#comment_124_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Anyone is better than that kike-loving embarrassment in office right now. I mean you think Trump is your guy but he's got Kushner cucking him and he's sucking that fucking slav Putin's cock hard enough that even Israel made him their bitch when he put the embassy there. Fuck Trump I hope he gets aids raped.\n\nIs everyone an anti-semite on here? God damn it",
				"added": 1567990989
			}
		],
		"1567752163_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 5,
				"body": "> [anshorei](#comment_41_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): I wrote about it on my blogWhat you're looking for is called vanitygen (clearnet)\n\nThanks I'll check it out!",
				"added": 1567753499
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 6,
				"body": "There are many things in life which can break a person. I like to look at it like smashing a piece of pottery, there are things which can smash a vase quickly and traumatically, things that are so stressful that they traumatize the very way your mind perceives the world, making you think you are always in danger, ordinary experiences begin to be perceived as existential threats. Then there are other things too like depression which can slowly chip away at the vase. Those things can equally break a person down but in a much slower, more gradual way. But the end result is still the same, you find yourself broken, smashed into a million pieces bearing no similarity to who you once were. You struggle but eventually you pick the pieces up and find the strength to glue yourself back together again. But that’s not all, there is a flip side to all of this, sometimes the person you glue back together is stronger than the one which was broken in the first place. You take away something from the experience which somehow makes you stronger than you ever thought you could be. There is an ancient Japanese word called Kintsugi, which literally means ‘to repair with gold’. It’s when you take a broken piece of pottery and instead of discarding it you glue it back together with a paste mixed with gold dust. In this way you create a piece of pottery which is more beautiful and unique than the pottery which was smashed in the first place, it’s a beautiful metaphor for these depressing subjects. Always remember there is hope.\n\nSuicide Prevention Hotlines Zite: http://127.0.0.1:43110/15GbDJPVbjW3rs9b2oNUjYVPAVuW1KcPMe/",
				"added": 1567821923
			}
		],
		"1567878918_114mSgWDZpRknb492fpx91DL6jSNgRRXba": [
			{
				"comment_id": 10,
				"body": "Does he know that you know? Make sure he does, that will frighten him. Then tell him that you forgive him and turn the other cheek, and do nothing with that information.",
				"added": 1567887028
			},
			{
				"comment_id": 12,
				"body": "> [revengeisgood](#comment_7_114mSgWDZpRknb492fpx91DL6jSNgRRXba): I prefer ruining his reputation so he can't work again. Will be looking into how to do that.\n\nImagine if you were judged by the public solely for the worst thing YOU have ever done! We are all humans, we all do and have done bad things. Why revenge? What good is vengeance if you want mercy for yourself but justice for everyone else? We are all guilty of something. Would you yourself be employable if all the public saw this thread and the lengths you would go to ruin the public image of a person who once wronged you? How do you even know for sure it is the same person and not a decoy? You don't. I implore you yet again to please turn the other cheek. You have real power over this person, be the better person and do what he did not do when he had power over you, and show mercy. An eye for an eye makes the whole world blind, it has to stop somewhere, let that be here!",
				"added": 1567893591
			}
		],
		"1567862434_1KeYAouLFhS2WxAbfS8hdYXSN1zDcHuvS1": [
			{
				"comment_id": 11,
				"body": "I personally don't know of any such tool with ZeroNet. You can however encrypt the messages themselves with PGP or similar software and post the ciphertext on ZeroChat or similar allowing only the intended recipient the ability to decipher it.",
				"added": 1567887205
			}
		],
		"1567892030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 13,
				"body": "Not ZeroNet but I ran I2P on a Gateway 2000 workstation made for Windows 98.. for about 5 minutes. It used an old Pentium processor and had around 398MB of RAM out of the original 64MB. Apparently Linux did not work well with the hardware, it didn't even recognize the fan. So as soon as I started I2P my processor shot up to a consistent 100% and since the fan wasn't working it got VERY hot so I had to shut it down to avoid burning the place down. But for around 5 minutes some random I2P users somewhere had their traffic routed to/from them with a Windows 98 workstation, so that's pretty cool. Also ZeroNet works pretty well in my experience on mid-to-late 2000's hardware though I wouldn't try much earlier than that.",
				"added": 1567907627
			}
		],
		"1567919694_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 14,
				"body": "Pretty sure they have markets for that stuff in onionland.",
				"added": 1567919755
			},
			{
				"comment_id": 15,
				"body": "> [kidcourageous](#comment_113_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): If onionland can meet these requirements, please direct message my tox with the appropriate address/addresses.\n\nWas going to drop a link but your ZeroMe says \" I have to risk everything for her. I don't care how many bodies it takes. Without ethical violations there would be no modern medicine.\"\n\nAre you okay mate? What kind of experiments are you doing? Why?",
				"added": 1567922001
			}
		],
		"1567989820_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 17,
				"body": "Can you be more specific?",
				"added": 1567991309
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 18,
				"body": "I only go without Tor when absolutely necessary, the atmosphere of performing even the most innocuous task openly under mass surveillance is to me, suffocating.",
				"added": 1570856057
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 19,
				"body": "See my site Red Liberty for that http://127.0.0.1:43110/1CoVgJCDb588bVtxU9VAwGLGuybzdr3mfg/",
				"added": 1570856123
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 20,
				"body": "Ugh yet another garbage, hateful, disgusting post. On ZeroTalk there are 3 little dots to the right of the name of OP on the post. Click them, a menu opens with the option \"Mute This User\". And there you go, ZeroNet got a whole lot better. Don't feed the trolls, mute them! This doesn't censor THEM, it just makes it so their trash doesn't appear on your ZeroNet instance.",
				"added": 1571465462
			}
		],
		"1571488787_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 21,
				"body": "> [zenanon](#comment_37_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Not lately but I have had people trying to brute force SSH passwords before, it kind of looks like that. I solved it by turning off password-based login and only using keyfiles. The hackers got the message pretty fast.\n\nYes definitely use keyfiles as opposed to just passwords. That way they need the keyfile BEFORE they can try and brute force.",
				"added": 1571513899
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 22,
				"body": "Hacker here. For true hardcore mode get a Libreboot compatible pre-2008 computer. There are a lot of thinkpads that are Libreboot compatible, even some niche macbooks (ironically) that work. Just flash the BIOS chip (some you can do this for without having to open up the computer) with Libreboot and run a fully free OS such as Trisquel GNU/ Linux and you can be as close to 100% sure as possible that there are no software backdoors, even at the BIOS level. Of course if you're hardware is compromised you're fucked but that depends on your threat model. Falun Gong practitioner in China? Yeah... your hardware is probably fucked. Just a normal nerdy guy/ gal who likes IT? You're probably fine. That's up to you to figure out though.\n\nA 100% free (as in freedom) OS is great, but if the BIOS isn't free, you aren't free. I'm in the Free Software Foundation (fsf.org) and this is the kind of computer they recommend as it being 100% in your control means it is 100% free (as in freedom). Every single line of code down to the lowest level can be freely read, copied, distributed, studied, changed, and improved upon by YOU and anyone else. Do not trust third parties, always verify. I won't lie, I have a few librebooted computers and the experience of using them is... for lack of a better word, liberating. When you understand the implications of true user freedom, it's worth the sacrifice and you will never go back.\n\nA more modern option is to go with a laptop by Purism such as the Librem 13 or Librem 15. You could also double down for the Insurgo Privacy Beast X230, the only laptop that meets (and exceeds) the certified hardware requirements set by the Qubes OS team (note the base X230 is still old if I recall, it's just modded to hell with privacy enhancements). This thing is INSANE. If I recall it comes with Heads and a Nitrokey that can cryptographically verify that your laptop has not been tampered with. Purism offers this for Librem 13 and 15 but it's DIY and in beta so sketchy as hell IMO. I only don't have the Privacy Beast because I have a Qubes machine I am happy with, and my librebooted laptops satisfy my needs in that direction. I've used the Librem 15 and it's surprisingly good, it just wears easily. It runs Qubes OS and Trisquel flawlessly and I highly recommend it for freedom, privacy, and security. Purism also has their own FSF endorsed PureOS which is good but... I'm a Trisquel person all the way. \n\nSome people linked to Libiquity which is basically pre-configured Libreboot. That's great and I support them but it's honestly quite a bit cheaper to do it yourself if you know how with a used, compatible Thinkpad. That being said there is no shame in ordering pre-built!\n\nFor me it is a political statement. Not just me but EVERYONE should use software/ hardware that respects their freedom. A precondition to being a netizen should be an uncompromising refusal to accept anything that curtails your rights as a human being. If you understand these values donate to the EFF, FSF, and other causes that advance digital rights. Get involved with these projects. Also as a side-note, as good as Purism is, you should know that Purism computers leave ~3% of the proprietary code in the Intel ME because removing the last 3% causes the system to brick after 30 minutes (thank Intel for this). But that 3%? I highly doubt its harmful. I'm just something of a free software \"purist\". You are still light years ahead of 99% of computer users as far as freedom is concerned. I hope this helps! Enjoy your freedom!",
				"added": 1575266642
			},
			{
				"comment_id": 24,
				"body": "Install Libreboot on old, compatible hardware and run a FSF approved distro such as Trisquel or Parabola. That's the only way to be fully free (as in freedom) and to actually be the only one who owns your computer. Librem laptops (way more expensive) also theoretically are free but there are still (if I recall) some minor freedom issues. The Intel ME has been nuked on their devices I'm quite sure. A bonus of Librem though is that it works with Qubes. It's shocking that this is such a fringe thing, freedom should be the default, the norm, not something you have to actively seek out.",
				"added": 1589423705
			}
		],
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": [
			{
				"comment_id": 23,
				"body": "> [fke13](#comment_15_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Actually, ZeroNet is NOT the First. Historically FreeNET might qualify as the first by some criteria and back in the day, when people used phone lines for data connections and the phone companies lacked proper logging, the Usenet was de facto anonymous, because the logging of phone calls was that poor. It's kind of hard to imagine nowadays, but the Usenet, the same \"internet\" that the Linux kernel was supposedly first announced at, actually was truly anonymous, if people wanted to stay anonymous. The technical details: [...]\n\nFreenet was (if I recall) the first really free network. Also don't forget I2P!",
				"added": 1575266723
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 25,
				"body": "You'll hear a lot of conspiratorial bullshit on this issue. \n\nIt's hard to say someone is entirely good or entirely evil. Bill has done some phenomenal charity work and seems to genuinely care about people, but how he made his money (in my opinion) is unethical. It wasn't your typical billionaire success story in line with a Marxist critique of capitalism (some billionaire making billions by exploiting his workers, basically being entitled by property right to 1/3 what all his workers produce while they live in poverty and want, etc). No, he made his money in a different way, but it's still unethical in my view.\n\nIf you go way back to the early days of computing you'll find Bill to be what I politely term a \"whiny little bitch\". While figures such as Richard Stallman and (to a lesser degree) Linus Torvalds were promoting user freedom with computers and software, Bill Gates wrote this whiny little article complaining about how people were copying, modifying, and redistributing his code without paying him any money. \n\nAnd I get it, coding is hard and you want to be paid for it. But he basically laid the foundation for proprietary software (\"you can't see my code it's muh intellectual property, you only get a DRM-packed pre-compiled binary that runs mystery code on your machine and you pay me 150$ to 'license' it and if this software YOU BOUGHT breaks and YOU try to fix it or even try to understand how it works, I'll bring you to court and fuck you\"). This is the EULA you check every time you download non-free code. \n\nThis is less secure than free software (what is sometimes called \"open source\") and it restricts the users freedom. This is why so much software and so many operating systems run non-free software today. It effectively means you cannot be sure what your own device YOU BOUGHT is doing, if it's broken or bugged you cannot fix it, you cannot even tell (AND IT IS) that it's spying on you and how. This surveillance, fueled by proprietary software, is effectively eroding the very prerequisites to all civil liberty in our digital age.\n\nBut like I said Bill also does legitimately good humanitarian work, so it's complicated. No, he isn't in league with some conspiratorial cloak and dagger cabal of lucifarian reptilian free masons conspiring to invent COVID-19 as an excuse for his 5G towers that will give you the mark of the beast, as some (less mentally well, more naive people on ZeroNet) would have you believe. He's just a human being. I have no right to say if he is, as a whole, good or evil.",
				"added": 1589424708
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 26,
				"body": "No one \"owns it\", usually there is no money exchanged. Yes it's communist in the simplest use of the word. This word frightens people needlessly, especially when used in this context. It's communist and superior in regards to innovation, freedom, privacy, security, and usability.",
				"added": 1589424899
			}
		],
		"1594313562_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 27,
				"body": "From what I can tell it seems to be something paranoid schizophrenics use in an attempt to justify on rational grounds their mental illness that worried people on the internet (particularly soccer moms) read about and take seriously. Like people who think vaccines cause autism, the world is flat, Soros is behind progressive movements, etc. People protesting against the COVID-19 shutdown were talking about that and 5G as \"reasons\" for the \"real\" disease. Their ideas simply put are not rooted in reality.",
				"added": 1594544525
			}
		],
		"1593315937_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 28,
				"body": "Sounds like \"Sovereign Citizen\" bullshit to me",
				"added": 1594545492
			},
			{
				"comment_id": 29,
				"body": "> [rannulfr](#comment_82_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): The whole world is under occupation by jews. Don't be naive.\n\nImagine thinking people who don't buy into antiquated 19th century anti-Semitic conspiracy theories are the naive ones hahahahahaha",
				"added": 1594545550
			}
		],
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 30,
				"body": "> [eightyfour](#comment_118_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): The right: [...]\n\nAm 100% leftist, am also 100% in favor of both the first and second amendments as you pointed out. Long live Black Lives Matter and the Bill of Rights!\n\nSocialism or Barbarism, Liberty or Death!\n\nhttp://127.0.0.1:43110/1CoVgJCDb588bVtxU9VAwGLGuybzdr3mfg/",
				"added": 1594545731
			}
		]
	},
	"comment_vote": {
		"32_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"12_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"4_1GZpEfwLctYr3JvsD96qYGozQQPfqkagWP": 1
	}
}