{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1611726067_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [
			{
				"comment_id": 1,
				"body": "If there are opinions existing in the world so convincing, that they can convince so many people, why should anyone want that opinions to be silenced? If a thing is so convincing it must be the truth. How else can you know which is truth when not allowing an open discussion about it? The truth can be anything. It is true even if you think it is not or it is bad or evil. The truth will always find its ways into reality and the mind of the people.",
				"added": 1611844747
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 2,
				"body": "@zeroseed4 ok vaccinator",
				"added": 1611932712
			},
			{
				"comment_id": 3,
				"body": "Why don't you get it: \nIt is my body - my choice. This is not be true for abortion, because the body growing in women are not theirs but the babies body itself. \n\nIf you don't want to do a vaccine you should not have to - without any consequences. There are borders between humans, which separates one human from another. Forcing anybody to do something against his will is a violation of this border. Breathing is required to be alive. If you start regulating how people are allowed to breath, they have no more control about their own life. If you do so everything they do is now your fault, because you have forced them to give up their own will. If they get desperate because of this and aim to kill you it is just your fault. Why intervene in anybodies issues? \n\nIf you want to live in the basement because of a mild flu, do it and shut up. Let others have their life. If old people die so it will be. There is nothing you can or should do about it. Accept it. But you morons don't want to accept and so you transform everybody's life  into a nightmare for no reason others than your endless stupidity. It's not the elites its people like you who go along with this bullshit.\n\nBut at the same time it is the elites, because normally you people need rulers who rule in their own favor AND in the people's favor. But our current elites are not from us, thus they feel not symbiotic tied to the people who they rule over.\n\nYeah yeah it's the jews, stupid.",
				"added": 1611954089
			},
			{
				"comment_id": 4,
				"body": "yes",
				"added": 1611954286
			},
			{
				"comment_id": 5,
				"body": "there is no china virus. there is just stupid lies. It's just good propaganda that make you idiots believe it.",
				"added": 1611954459
			},
			{
				"comment_id": 6,
				"body": "Quote \"I'm in a low risk category, but I've had much worse symptoms from the flu.\" Are you even a thinking human being?",
				"added": 1611954750
			},
			{
				"comment_id": 7,
				"body": "ok, what is your conclusion about your words I just quoted. Hint: Read them again and again and think about it.",
				"added": 1611955041
			},
			{
				"comment_id": 8,
				"body": "yeah, I know. So I will tell it to you, because you obviously are not able to think. There is no conclusion my friend. You were just trying to make a point were no point was in the first place.",
				"added": 1611955324
			},
			{
				"comment_id": 9,
				"body": "@quantumkitty is a NPC that truly believes that whenever someone  has another opinion than itself, the reason is always that the other person must be stupid. It can not believe that other people do genuinely have another worldview than itself based on experience, knowledge, logic and true facts.",
				"added": 1611955818
			},
			{
				"comment_id": 10,
				"body": "How do you tell opinions apart from facts?",
				"added": 1611955935
			},
			{
				"comment_id": 11,
				"body": "Well you can not decide like that. It depends on the situation. How did the accident happen? Who was involved? Was a person drunken etc.... You need to answer endless questions and sometimes you never know for 100%.",
				"added": 1611956284
			},
			{
				"comment_id": 12,
				"body": "@grouch0 Who made these \"scientific medical definitions\" ? Did you check these definitions with your own mind? \n- No I trust science\nWhat is the difference between trust \"science\" and trust the plan?\nRight, there is no difference. \nIf you don't understand the science presented to you and if can not see any faults in it, what are you?\nYou're a true believer.\n\nIf you could make the choice between two leaders who would you choose?\n\nLeader #1 is telling you there is a deadly disease and you can not have a normal life anymore.This will be forever because of yearly mutations and vaccinates can not be adapted this fast.\n\nLeader #2 is telling you that leader #1 is just lying. Leader #2 tells you that you should know that there are no more people dying than the last years. Yes it might be a little bit more than usual than normal, but this is just a small statistical abnormality . He tells you that he might be wrong and that maybe 10% of the population could die. But then he tells you that despite of all this you can have a normal life with no masks or social distancing or restrictions on large public gatherings. Yeah some people will die, but you (if you survive) will have a normal life.He tells you that he will use more money to build hospitals and pay better wages for healthcare workers, to encourage more people to choose these kind of jobs. He tells you that this might come to late, but he will try it anyway.\n\nWho would you choose and why? Additional: This decision can not be reversed it will determine the rest of your life?\nSo choose wisely.",
				"added": 1611963536
			},
			{
				"comment_id": 13,
				"body": "@grouch0 \"I don't follow any leaders and I sure as hell don't buy into false dialectics such as a false two party system.\"\n\nSure you follow leaders.Everybody does. At least you follow the rules these leaders make.Otherwise you were in jail right now.\n\n\"I prefer the Socratic method to weed out the bullshit/fact from fiction.\"\nThere is no time for this really, really ineffective method. You have to make decisions right now. Only time can tell if your decision was right or wrong.\n\n\"I'm not trying to tell you or anyone else not to take it.\"\nWhy are you even here? Of course you are trying to influence people in a certain direction.\n\n\n\nTo make it clear:\nI would choose leader #2. Because I would rather die or see many people die than I have to live a life like that.\nAnd I forgot to say that leader #2 would also not force you to take any vaccine against your will.\n\nAnd yes, personally I'm trying to tell people not to tell the vaccine, because of many reasons:\n-Big pharma should not get more money\n-Big pharma should not make the people more dependent on their medicine\n-I think that the vaccine does not do what everybody claims\n-It might be harmful\n-I don't trust big pharma\n-People with a weak immune system should simply die if there is no other solution than taking away all rights from 99% of population\n-Yes, I would say that I would sacrifice them, or even me if I was old and weak.\n-Their sacrifice can then be hold in memory by monuments telling people, that these people have died for you to enable you a normal life (No that is actually a joke, monuments are for brave warriors only)",
				"added": 1611999891
			},
			{
				"comment_id": 14,
				"body": "@grouch0 I can see right through jew.\nWith all your stupid nonsense you're trying to distract the readers of this forum from the only thing that really matters.\n__________________________\nThe future of our all lives\n__________________________\n\nAnd there are effectively just two options you can choose from:\n\n#1 You're generally are buying what everybody tells you. yeah, you may disagree with a little detail here and there but overall you go along with everything. And if you go along with all this our future is doomed.\n\n#2 You refuse all this bullshit, because to say it in simple plain words : Where are the fucking millions corpses? And not the million dead people who die every year. No, the millions who die on top of them. And then again, even if all these million people are dying on top of them, you claim, still you have NO other solution than endless lockdowns and useless (useless because of mutations)vaccines. Sorry, than I rather die or let others die than have to live like that.",
				"added": 1612030291
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "haha quatumkitty goes full retard. The NPC really felt into the question trap, I set up. It is all working out guys. LOL",
				"added": 1612031316
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 16,
				"body": "Memo to based traitors: go back to reddit.",
				"added": 1612034113
			}
		]
	},
	"comment_vote": {}
}