{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "The King's Avatar, the best not anime anime of the season",
			"body": "For those who haven't checked it out yet, The King's Avatar is a new chinese cartoon based off a popular chinese novel about Pro Gaming. It's being made by the owners of the developer of League of Legends, though it is not based off the game. It's worth checking out because of the impressive animation and the fact that it is the first serious show about Pro Gaming. Hope we can get more in the future.",
			"added": 1492283731
		}
	],
	"topic_vote": {
		"5_1Ax7URbeVrWRB6zcmg3eYVeyiTz6iYyEd7": 1
	},
	"next_comment_id": 21,
	"comment": {
		"5_1Ax7URbeVrWRB6zcmg3eYVeyiTz6iYyEd7": [
			{
				"comment_id": 1,
				"body": "Kobayashi's Dragon Maid - Dark Horse of the season that a lot of people seem to have missed.\n\nAlso Tenchi Muyo Season 4 OVAs are finally trickling out after more than 10 years since Season 3 :D",
				"added": 1488852572
			},
			{
				"comment_id": 2,
				"body": "> [cgretski](#comment_2_16bqqWeWsRKC9DuWd9B8f9C7amJA31vJaZ): Thank you! did not know about season 4\n\nIt's great so far. Getting a lot more insight into Jurai's complicated royal family tree, and Seina will be winning this year's award for \"Most Mentioned off-screen character\". They mention him so often I'm amazed they haven't at least shown a clip of him sneezing XD",
				"added": 1489365768
			},
			{
				"comment_id": 3,
				"body": "Interesting Anime from this season so far...\n\n* Alice to Zouroku - Girl with powers escapes from research facility and get's taken in by an old man who teaches her about the outside world\n* Re:Creators - Pixiv Artist summons his favorite Anime character into the real world and then gets dragged into the pseudo Holy Grail Wars\n* Tsugumomo - Boy's memento from his dead mom turns out to be a Tsukumogami(possessed object), and he gets dragged into being an exorcist and fighting rouge Tsukumogami called Amasogi, following in the footsteps of his mom\n* Oushitsu Kyoushi Haine - Dwarf sized Professor gets hired as the Royal Tutor to a bunch of eccentric princes, hi-jinks ensue\n* Seikaisuru Kado - MC is a top negotiator civil servant and gets dragged into circumstances involving a giant impervious cube that appears on the coast of Japan, and the strange man that seems to control it, political tension ensues\n* Renai Boukun - MC meets a Grim Reaper/Cupid/Angel that wields a \"Kiss Note\" and tells him that he must kiss someone by the end of the day or else she dies and he's a virgin forever.\n* Silver Guardian (Chinese) - MC goes to a boarding school and spends most of his free time doing part-time jobs, plays an MMO when he can, setup to get dragged into some kind of supernatural battles, has potential\n* King's Avatar (Chinese) - About Pro Gamers, MC is looking to work his way back up after he quits his previous team, some amazing animation and art direction (especially compared to past Chinese shows)\n\nAnd of course the Season 2s for a bunch of shows like Rage of Bahamut, Attack on Titan, and My Hero Academia.",
				"added": 1491779207
			},
			{
				"comment_id": 7,
				"body": "> [jmsebastian](#comment_1_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): Has anybody been keeping up with Berserk? I watched a couple episodes of the new season and didn't enjoy it as much as the first.\n\nI had to bail long ago because the animation makes my eyes bleed. It's bad even by Anime CGI standards. Now Kado, that's a CGI anime done right.\n\n*But seriously, watch Kado. The show is a great Thinking-man's Sci-fi aimed at Adults, and it's from Toei of all companies.*",
				"added": 1495242864
			},
			{
				"comment_id": 8,
				"body": "> [jmsebastian](#comment_3_1Gu13rN1pkfocLRtoHdTyChZTq1yNHgwcB): Thanks for the heads up Kado. I haven't really been watching much new anime lately, unless you count Persona 5's cutscenes. You know, I watched a pretty decent youtube video on some of Berserk's quality issues that was pretty decent (not just the usual boring rant). I have to say, I still enjoy it, mostly because I enjoy the voice acting so much. I definitely noticed some animation issues in season 2 that I didn't notice in the first. I love Berserk and I don't really think the animation is that bad, it's heavily stylized, anyway. But I definitely get why some people aren't into it.\n\nFeel free to watch Berserk if you can get past the animation. I just couldn't, and I just find it really disappointing that something like Berserk isn't being given better treatment in its animation.",
				"added": 1495385263
			},
			{
				"comment_id": 15,
				"body": "> [synapse](#comment_1_1NmomwXDxpsc9qwyzV4xh4JqxGtT44XwCB): Has anyone here watched Serial Experiments Lain? I feel like people here would enjoy it, I found it a few days ago and its very interesting.\n\nI watched it when I was probably too young to be watching it XD",
				"added": 1510105433
			},
			{
				"comment_id": 19,
				"body": "I was way too young to understand Lain the first time I watched it.",
				"added": 1564806965
			}
		],
		"4_1Ax7URbeVrWRB6zcmg3eYVeyiTz6iYyEd7": [
			{
				"comment_id": 4,
				"body": "> [emondae](#comment_1_1HEX5jpVUwbALLv6pHAPhM5VnMD1AEo78n): ello\n\nYo",
				"added": 1492055055
			},
			{
				"comment_id": 5,
				"body": "> [unanimous](#comment_1_1H5VKNWtkBA7RpJWyYuFw5bqjwbgjXoqKp): Interesting, wonder what if a community can rise from this being around.\n\nWe can hope.",
				"added": 1492264721
			},
			{
				"comment_id": 6,
				"body": "> [cyberslave](#comment_3_1BkgWBWWN9CoXNeEmyyuagid7roJruBVjz): Maybe one to create more topics?\n\nFeel free. I'll join in if you post something.",
				"added": 1492281555
			},
			{
				"comment_id": 9,
				"body": "> [pacobell](#comment_1_1CS1AQby8pMCZV3wG5rkYiDDzw21Jcsf7J): Now that more low-power media playback devices like the Chromecast Ultra, Nvidia Shield TV, and even cheap Chinese media players support hardware-accelerated HEVC decoding, do you find yourself switching to HEVC releases to save 50% disk space for your archives?\n\nNope. Device support in my house for HEVC is still too low. Cheapo chinese players may support it, but that doesn't justify replacing all my equipment that's perfectly functional otherwise. So for now I'm sticking to x264 until a majority of my devices support HEVC or AV1. Besides, storage is cheap these days so it's not like there's really a need to ration every byte. You can get a 2TB USB3.0 drive for around $70, or if you don't need an enclosure, a decent bare 2TB 3.5 inch drive can be found for around $50. Even if you're being generous with the bitrate on your x264 anime files for some reason, that's still something like 2000 episodes at 1080p.\n\nIf you have low bandwidth caps and a device that supports HEVC, go ahead, but I'm happy for now.",
				"added": 1497679940
			},
			{
				"comment_id": 10,
				"body": "> [netshadowx](#comment_1_1LxCPvqsa78HDaX15U1PVrZ52MpCvZmLYk): Hello all, I just found Zeronet (In Reddit's /Deepweb of all places) and I knew the first place I needed to come was the anime discussion board. Any .Hack:// fans here?\n\nHaven't watched them in years. I've tried to go back to them, but now a lot of it feels like it's trying to be too \"deep\" and ignoring the mechanics of VR too much. Though it's still better than SAO in many ways,  it's also harder to swallow as well. As someone who's well versed in technology and games, it asks me to suspend my disbelief on way too many things, at which point it just gets boring for me. In a time where VR is here, and full dive could be just around the corner these details are more important than ever. In comparison, something like Log Horizon does a better job at suspending disbelief, since they're not actually trapped in the game, and it focuses on the fantasy aspects more while using the game mechanics as a catalyst to show how the world has changed.\n\nOf course this could just be my faulty memory, but I don't have the time to go back and watch them again to see if I'm wrong; when my media to-do list is a mile long and new things come out every few months. :P",
				"added": 1497996157
			},
			{
				"comment_id": 12,
				"body": "> [z3r](#comment_1_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): hi,i realy like the original GitS, are ther similar?\nAs in the movie? What exactly did you like about it? Hard to give suggestions otherwise.",
				"added": 1500318273
			},
			{
				"comment_id": 13,
				"body": "> [z3r](#comment_2_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): animes that hase strong focus on cyberspace and cyberpunk\n\nHmm, that's a tough one. There hasn't been a lot of those lately, as the genre has kinda died a bit. You might want to check out 'Psycho-pass' for a recent cyberpunk, and for something net focused you might want to try the classic, 'Serial Experiments Lain' (just be warned that it leans heavily on the psychological).\n\nOther cyberpunk stuff that I can recall are early 2000s at the latest, but the names escape me. There just hasn't been much cyberpunk lately. Though plenty of psychological if you're interested in that.\n\nPS: Make sure you watch GitS: Stand Alone Complex if you haven't already.",
				"added": 1500336996
			},
			{
				"comment_id": 14,
				"body": "> [z3r](#comment_3_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): Thanks for writing.i already watched Psycho-pass, Also all the GitS Series and Movies, Serial Experiments Lain, ...its hard to finde others. so i only can rewatch all the time the same ones...\n\nYeah, Cyberpunk is just rare in general these days",
				"added": 1500578239
			}
		],
		"1_1NFECnD3xTpq46D4iJkrf3BdUfzEqBL8Xm": [
			{
				"comment_id": 11,
				"body": "Cool, though I lost interest in AoT a while ago and didn't even watch much of S2. But I'm happy for those who care. Hopefully they won't have to wait four years for it this time.",
				"added": 1498317295
			}
		],
		"1_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 16,
				"body": "It'd be a stupid move on many levels.\n\nAlso they're technically Visual Novels, not anime. Some aren't even made in Japan.",
				"added": 1527475775
			}
		],
		"1_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 17,
				"body": "To be honest, I've lost interest in Fairy Tail at this point. After all these years, delays, and filler, I just can't get back into the show.",
				"added": 1539985399
			}
		],
		"1_14PhvcynfBcDHV1EE3C21AjURTwLrxX48T": [
			{
				"comment_id": 18,
				"body": "Never seen it. I'm not big into sports anime.",
				"added": 1561653470
			}
		],
		"1_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4": [
			{
				"comment_id": 20,
				"body": "https://horriblesubs.info/shows/boruto-naruto-next-generations/",
				"added": 1589920170
			}
		]
	},
	"comment_vote": {
		"1_186FqpSSU2mhFvHpsZXjhfUGuog4okYWDT": 1
	}
}