{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1578522999,
			"title": "Is there a way to backup users.json on Zeronet itself",
			"body": "We can use users.json file and use it on different devices what if we lost users.json file can we get back our identity.",
			"added": 1578522998
		},
		{
			"topic_id": 1583557114,
			"title": "ZeroNet Mobile [ py3 ] is Live on Playstore",
			"body": "Now you can download ZeroNet Mobile on Android Playstore\nhttps://play.google.com/store/apps/details?id=in.canews.zeronet\nApp is Fully Native and Usable for Every One.\nIf You face any error you can report on ZeroNet Mobile on App Home Page.\nThis is latest py3 version so you can update ZeroNet as on desktop.\n\nIf you want to download from other source or don't have Playstore on your device, you can download Apk at\nhttps://github.com/canewsin/ZeroNet/releases",
			"added": 1583557112
		},
		{
			"topic_id": 1601057110,
			"title": "ZeroNet Mobile with Modern UI released.",
			"body": "ZeroNet Mobile with modern ui released to Google Play Store.\nhttps://play.google.com/store/apps/details?id=in.canews.zeronet\n\nGithub releases at https://github.com/canewsin/zeronet_mobile/releases\n\nIt has built in tor support.\nTry and give your feedback. 😃😘",
			"added": 1601057107
		}
	],
	"topic_vote": {
		"1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578690181_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1590978133_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1597198574_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	},
	"next_comment_id": 50,
	"comment": {
		"1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 1,
				"body": "Profile Switcher",
				"added": 1578522256
			},
			{
				"comment_id": 2,
				"body": "> [zeromepro](#comment_1_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71): Profile Switcher\n\nFor Using Multiple Profiles",
				"added": 1578522291
			}
		],
		"1578522999_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 3,
				"body": "I was thinking that there should be a service on zeronet to hold encrypted users.json on network itself with username and password or similar combination.",
				"added": 1578523821
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_1637_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There is. Use the ASCII password you get here: https://www.grc.com/passwords.htm&ved=2ahUKEwi2p_PKi_XmAhWOZM0KHX9yCeMQFjAAegQIAxAB&usg=AOvVaw2k4T3XdbbdNu1DrxDjckVE [...]\n\nThe site is for password generation, my question is not that",
				"added": 1578524089
			},
			{
				"comment_id": 5,
				"body": "I was saying like how zeroid holding of references there should be service to hold users.json on Zeronet instead of distributing to all peers distribute it 10 peers if 1 peer is lost connection for long time we remove that user's encrypted file from seeding send it to another thus no user can hold more than specific no. of files",
				"added": 1578524418
			},
			{
				"comment_id": 6,
				"body": "May be it's time to create one",
				"added": 1578524644
			},
			{
				"comment_id": 7,
				"body": "This is same logic how this ZeroTalk publishes to 5 or more connected peers when we post something on site",
				"added": 1578524766
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_1640_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It spreads further than that.\n\nWe can stop and limit for specific no of peers",
				"added": 1578525516
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_1642_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I would do trusted peers, which will probably require a new plug-in.\n\nI think so",
				"added": 1578525721
			},
			{
				"comment_id": 10,
				"body": "> [beenotung](#comment_41_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): Is it really that hard to externally backup your users.jsom file or the master seed? [...]\n\nI'm just thinking about the possibilities of it on network itself.",
				"added": 1578690566
			}
		],
		"1578538583_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 11,
				"body": "One thing i observed to installing requirements take very long time because it will compile python module on your device ask anyone on this thread\nI released an App with py3 branch if you want to try forum link http://127.0.0.1:43110/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk/",
				"added": 1578691420
			}
		],
		"1578700360_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "Really ? How is it possible i didn't make any changes to python code, i will check it once.",
				"added": 1578701182
			},
			{
				"comment_id": 13,
				"body": "I see it py3 i thought it's on app, is it right ?",
				"added": 1578701264
			}
		],
		"1578704557_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 14,
				"body": "This is why I created issues site here because it will appears on feedlist if you follow it.",
				"added": 1578704774
			},
			{
				"comment_id": 15,
				"body": "Stl ext seems like 3d model format. I was mostly working on dart lang side so i cannot help you. even for checking i was using mobile client now.",
				"added": 1578705085
			}
		],
		"1578171588_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "> [krzysztof113](#comment_13_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): For me works only once after installation. Libpython .so not found\n\nIf you have any issues post here\nhttp://127.0.0.1:43110/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk/\nHow to reproduce the bug, follow the rules for bug report.",
				"added": 1579055433
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 17,
				"body": "instead you can use\n> {data\\_dir}/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h_.html",
				"added": 1582311018
			}
		],
		"1578059130_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 18,
				"body": "i was building src using cmake,\nprovide full src code, it is asking conanbuildinfo.co.cmake",
				"added": 1583168908
			},
			{
				"comment_id": 19,
				"body": "i get this error on zeronet console.\n@lola\n> [2020-03-02 22:25:13,323] ERROR PluginManager Plugin Torrent load error: AttributeError: module 'Torrent.libtorrent' has no attribute 'session' in core/src/Plugin/PluginManager.py line 138 > Torrent/__init__.py line 3 > Torrent/TorrentPlugin.py line 28",
				"added": 1583168989
			},
			{
				"comment_id": 20,
				"body": "> [krzysztof113](#comment_18_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): Is this still live? What would be the use case?\n\nI Think Video Streaming Sites will improved with this type of distribution also we can use existing files on bittorrent network and avoid duplication.",
				"added": 1583211593
			}
		],
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 21,
				"body": "> [schiz0](#comment_100_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): why not on f-droid?I think it's the best place\n\nCurrently app needs some tweaks before source code is open sourced.",
				"added": 1583575051
			},
			{
				"comment_id": 23,
				"body": "> [schiz0](#comment_101_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): I've installed it from scratch (I've removed the previous installation) but now I can't find data directory [...]\n\nYou need to use ZeroNet atleast once before importing users.json file",
				"added": 1583585476
			},
			{
				"comment_id": 24,
				"body": "> [zeromepro](#comment_23_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71): You need to use ZeroNet atleast once before importing users.json file\n\nWith new update, you can import users.json file on app install",
				"added": 1583602370
			},
			{
				"comment_id": 25,
				"body": "> [p0rtal](#comment_24_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2): Why would you not release the code immediately? ZN is fully opensource, are you sure you dont breach the original license?\n\nI was not modifing any ZeroNet code here, you can update the ZeroNet core as you do on Desktop version. App is written in flutter framework, due to very low people know about flutter, so releasing code doesn't get any help from community, if you know how to code with Flutter, that will be helpful to me, at this stage project need polish, which is mentioned in app store page. Once I am happy with code, I will definitely open source the app. Building app is very cumbersome at this point, so it will be pain to contributors at this stage, I was planning native apps with ZeroNet Protocol, so it will be used by standalone apps as well, these features take more time to implement as well.",
				"added": 1583675780
			},
			{
				"comment_id": 26,
				"body": "One more thing is My App is runner for Mobile devices, so how do you say it will breach the Original license, it is totally different from main code, so it will not affect my code.",
				"added": 1583675966
			},
			{
				"comment_id": 29,
				"body": "> [schiz0](#comment_104_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): I need to install  PeerMessage plugin needed by my KxoId; have I need to make a plugins dir in a new core dir in /Android/data/in.canews.zeronet/files?\n\nNoted to my to do, it will be added soon.",
				"added": 1583858015
			},
			{
				"comment_id": 30,
				"body": "> [vipor](#comment_1_12MxK9TrswQgtBoQRpFpRrvGeA2i1wyPQr): It's not packed, it's too much trouble to install, and there's a firewall, it's too hard to connect.\n\nIf I had to pack in single file app is 50 MB which contains all archs, that are unnecessary for storage but I will try to close this gap, I had thought about it few days before, but never implemented it, now I will add to my todo.",
				"added": 1583858275
			},
			{
				"comment_id": 31,
				"body": "> [broo49664](#comment_14_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3): ZeroNet in a google-ruled appstore? That kinda defeats the purpose. Put it on F-Droid!\n\nAs I stated before, packed binary are downloaded to the app, F-Droid doesn't allow this type of behavior and currently ZeroNet needs Normal Audience who don't care about on what it works or how it works, they just want a platform to protect their privacy on Internet, if you notice all these years on ZeroNet, there are only people where most of them are tech enthusiastic but it doesn't grow the community, and about Google thing Currently ZeroNet is hosted on GitHub which central server, so I find no difference to this, did you remember the common audience I talked above, they use their mobile with Google Playstore only, if want to improve the network just contribute something like translations of App page in your language, this will increase adaptability, I always has surprises for community, so wait for those, you can adopt my apps as your self.",
				"added": 1583858959
			},
			{
				"comment_id": 32,
				"body": "> [peppefail](#comment_33_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): It works, but the button \"import profile\" does not.\n\nUpdate to new version, if available it should work.",
				"added": 1583864374
			},
			{
				"comment_id": 33,
				"body": "> [krzysztof113](#comment_22_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): @styromaniac Overall it does shady things, loads binaries from server and executes them ;)\n\nIt downloads binaries from servers and loads on device. If you have any doubts I will put an option to use your own binaries, this is very huge work to compile those binaries, so it's your wish to use the app or not.",
				"added": 1583898424
			},
			{
				"comment_id": 34,
				"body": "One thing, I want to tell you guys that, some of you feel discomfort about things like downloading binaries from server etc, the thing is, how do you expect to run python script on a mobile which is not compatible at all. If you trust Google or not, it will take some care about the app that installed via Playstore, it will scan your phone all the times for malware, if I was malware expert who has ability to skip the Google security, I will be on different community where there are person data is available, I don't has to be on this ZeroNet community, what did I gain from you nothing. Those binaries, which I download for app are available on GitHub, you can check for malware detection softwares on them. One Last thing is, Every thing you phone, pc or some device need to be run on some native binary that you don't have source to it, it depends on how much trust, you have on the Opposite Person or Company.",
				"added": 1583899672
			},
			{
				"comment_id": 40,
				"body": "I will introduce native for ZeroNet, which are pure native to device/platform you are viewing the ZeroNet.",
				"added": 1585294274
			}
		],
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 22,
				"body": "Here's the new py3 version for Android\nhttps://play.google.com/store/apps/details?id=in.canews.zeronet",
				"added": 1583577146
			}
		],
		"1583768669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "I'm currently busy(until May mid) now, but my first priority is different project on ZeroNet, if I had a time I will make feature rich Video Sharing Platform from scratch.",
				"added": 1583783800
			},
			{
				"comment_id": 28,
				"body": "> [styromaniac](#comment_1873_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): He said from scratch though. I think he'll make something special. He made an app for a social network before.\n\nYeah, you got it, I was planning that social network to work on ZeroNet and Content Sharing Network.",
				"added": 1583812552
			}
		],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 35,
				"body": "> [anonymous1973](#comment_1_17uEjJm6477fBX1thzLmUEBpG59fz6ZN3R): I'm using the app now - seems fine!Is there a 'dark mode'?\n\nWill add it to my todo now.",
				"added": 1584006312
			},
			{
				"comment_id": 37,
				"body": "> [anonymous1973](#comment_2_17uEjJm6477fBX1thzLmUEBpG59fz6ZN3R): The only issue I have with downloading this from the App Store is that it creates a list of users for Google to hand over to the Feds...\n\nHow this is possible ? I don't get it though !",
				"added": 1584368252
			},
			{
				"comment_id": 38,
				"body": "> [bigbadbob](#comment_1026_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Is Google trustworthy?\n\nI don't think they(Google) will appoint a guy to pry into app and watch us.",
				"added": 1584416914
			},
			{
				"comment_id": 39,
				"body": "Yeah I do see the prying behaviour of Google, I always use the tracking blocker always-on on the phone, which runs all the time, which filters trackers as well as ads all the time, I use Redmi phone, when I installed the app and see the filter log, I was shocked that how much data it was taking, so I will ensure blocker is always running. I use Adguard app.",
				"added": 1584505457
			},
			{
				"comment_id": 41,
				"body": "> [styromaniac](#comment_1983_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You used to have to scroll down very, very, very far to see it in search results, so you're wrong.\n\nI was seeing it in 2nd position, you may need to clear cache of Playstore.",
				"added": 1585317742
			},
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_1986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I said \"You used to.\" [...]\n\nOh, I skipped that line 🤪🤪🤪",
				"added": 1585331585
			},
			{
				"comment_id": 43,
				"body": "Some people are spamming review section of Playstore, if you see that behaviour mark it as spam on Playstore.",
				"added": 1585331677
			}
		],
		"1584197126_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "Bug is fixed in latest commit on ZeroNet repo, since there is no change in rev number, change is not applied to code, once there is a new rev update, it will work fine.",
				"added": 1584213632
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 44,
				"body": "Ok, what about identifing ZeroNet by identity of contacts, also there must be mandatory encryption for individual contact identifier and local only contact connections.",
				"added": 1587270006
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_2058_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't understand what you're saying.\n\nI mean contacts refers to your local sim contacts, instead of full contact storage, system will assign an identifier and announce it to your trusted contacts and only decrypted by them.",
				"added": 1587284379
			}
		],
		"1591963383_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 46,
				"body": "Are you using Playstore",
				"added": 1592026558
			}
		],
		"1598827107_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 47,
				"body": "I think, he need to know how things work on ZeroNet Core. Its better to ask nofish.",
				"added": 1598854160
			}
		],
		"1608100813_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 48,
				"body": "Tor is located in app private directory, what is the purpose of editing, because in the latest version tor is working perfectly.",
				"added": 1608103958
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 49,
				"body": "> [loli1488](#comment_12_1Dsw1CpgZiPYkVWLiqrgMJDTyXWEggCg2m): there is a mobile version of zeronet however it looks like shit so probably thats one of the reasons\n\nIf you are talking about old version of zeronet, there is a new zeronet mobile released with modern ui\nlink : https://play.google.com/store/apps/details?id=in.canews.zeronetmobile",
				"added": 1614249212
			}
		]
	},
	"comment_vote": {
		"1_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1573_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}