{
	"title": "Bugu's Blog",
	"description": "自由探索，自由表达",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"footer": "Powered by [ZeroNet](https://zeronet.io) [open, free, and uncensored]",
	"modified": 1546260686,
	"post": [
		{
			"post_id": 13,
			"title": "自由与公民权利宣言",
			"date_published": 1546260224.5,
			"body": "在中国，无论是五千年的封建文化传统还是萌芽于清晚期的民主思潮，都并没有真正开创出一个真正的公民社会。公民的基本权利，在现代社会中本应是常识的概念，对于现今中国人的生活，仍旧陌生而遥远。今天分享的这个文本，是 1998 年蒋培坤起草的。\n\n1998 年 9 月 28 日，由蒋培坤执笔起草的《自由与公民权利宣言》和《社会公正与公民权利宣言》以中、英、法等多种文字发表。丁子霖在《纽约时报》记者问及《自由与公民权利宣言》与捷克的《七七宪章》有何异同时说：我们在起草过程中详细研究了《七七宪章》的经验，可以说出发点是基本相同的，都是为了争取和维护公民权利，都是一种自由表达活动。 所不同的是，我们的宣言更带有启蒙的性质，因为中国缺乏崇尚自由、民主的传统。\n\n```\n  自由与公民权利宣言\n```\n\n签署者（中国公民）﹕丁子霖、林牧、江棋生（发言人）、蒋培坤（起草人）、魏晓涛\n\n在即将过去的一个世纪里，人类战胜了反人类的法西斯主义，战胜了各种形式的专制与奴役，世界自由事业获得了空前的发展。80年代和90年代之交，东欧及苏联极权制度解体，东西方冷战结束，使得世界上更多的人获得了自由。然而，世纪末的中国，就其根本方面来说，然是一个不自由的国家，而且是当今世界上最大的不自由国家。这给我们每一个中国人留下了深深的遗憾。\n\n在一个新的世纪即将来临之际，我们谨以中国普通公民的名义，向你们，向所有中国的知识界人士、工人、农民、军人、学生、个体及私营业者、企业管理人员、党政军各级官员及公务员，以及所有境内外的中国人郑重宣告﹕\n\n21世纪的中国，应该是自由的中国﹔\n21世纪的中国人，应该是自由的中国人。\n\n我们提出此项诉求，首先是基于对人的固有权利之确认﹕即确认人人生而自由，这种自由属于每一个人，不分种族、肤色、性别、语言、宗教、政治或其它见解、国藉或社会出身、财产、出生或其它身份﹔它既不可剥夺，也不可转让﹔每一个人在行使自由权利时应以尊重并不妨碍他人享有同等权利为限。人的此项权利业已加载联合国《世界人权宣言》及相关的两个人权公约，即《经济、社会、文化权利国际公约》和《公民权利和政治权利国际公约》（包括有关后一个公约的任意议定书），得到了世界进步人类的确认。\n\n我们提出此项诉求，还基于这样一个历史的启示﹕对于每一个意识到自身价值的人类个体来说，自由本身就是目的。这种自由不仅是现代文明社会赖以存在的基础，而且是其生命力的永不枯竭的源泉。一个国家、一个民族的文明程度及其生活质量的优劣，不仅要以老百姓的生存是否得到保证以及物质的是否丰裕来衡量，而且还要看每一个公民能否自由地选择自己的生存方式，能否按照自己的个性和意愿去追求自身价值的实现。对于任何一个至今仍因循专制传统的国家来说，公民的自由权利必须首先得到确认和保障，否则就不可能跻身于现代文明国家的行列。\n\n我们提出此项诉求，同时还基于这样一个事实﹕在共产党执政的中国，曾有过各种为官方认可的民主，如传统意义上的即所谓“民主集中制”（实为少数人乃至个人的专制）意义上的民主，如毛泽东一度倡导和鼓励的“文革”式民主，以及经邓小平重新解释和改造过的所谓有中国特色的社会主义民主等等，它们都曾被冠以无产阶级的或社会主义的名号。但是，作为人类个体所固有的自由，却事实上始终未被官方所认可，也未被官方允许冠以无产阶级或社会主义的名称。然而我们认为，就人的权利而言，自由先于民主，任何排斥自由的所谓民主，都不过是极权专制的代名词。同时我们还认为，现代民主运动的真正目标，在于建立一种能够确保公民个人自由不受侵犯的政治制度﹔如果仅仅把这个运动看作各种政治力量对权力的角逐和重新分配，那就最终不能划清民主与专制的界限。\n\n今天，我们中国人最缺乏因而也是最迫切需要得到保障的正是公民的个人自由。\n\n在过去的一个多世纪里，我们中国人苦苦寻求富国强兵、民族解放之道，为此作出了难以估量的巨大牺牲。其间，一批优秀的中国人为争取个人的自由权利进行了不懈的求索，然而终因缺乏经济的依托和社会的支持而半途而废。\n\n在过去的半个多世纪里，我们中国人驱除了外患，获得了民族的解放。但是，当我们有可能为自身争取人的基本权利和自由的时候，我们却又被抛入了国内战争的深重灾难之中，为所谓阶级的解放付出了同样巨大的代价。中国人再一次延误了个人的自由解放。\n\n当1949年内战的一方取得胜利，善良的中国人期待著实现自由理想的时候，他们却又被安置于一种强加的制度和秩序之中。这种制度和秩序敌视一切属于人的东西，包括人的权利和自由。在以后的岁月里，人们为争取自由权利所作的努力统统被扼杀，数以千万计的中国人为此惨遭迫害甚至死于非命。最后，在中国大地上竟发生了震惊中外的1989年“六四”大屠杀，中国人梦寐以求的自由一夜之间被淹没在血泊中。\n\n中国人一个多世纪以来苦苦追求自由权利而不可得，不仅因为多次失去了历史的机遇，而且更因为走入了历史的误区。\n\n在本世纪中叶中国共产党掌握政权以后，即在全国范围内实行了土地改革、农业合作化及私营工商业的社会主义改造，从根本上剥夺了公民最基本的人权之一即财产权。从而，在20世纪的中国，出现了惟有古代社会才存在过的“普天之下，莫非王土﹔率土之滨，莫非王臣”那样一种局面，每一个中国人均被置于对一种异己的生存条件的人身依附关系之中，完全失去了实现经济自由以及社会、政治、文化等等自由权利的可能性。\n\n与此同时，中国的执政者以所谓人民民主专政即无产阶级专政的名义谋得了其权力的“合法性”，进而实现了对所有公共权力的柯断。这种绝对的权力几乎控制了整个社会生活包括精神生活的一切领域。人与人之间的一切关系尤其是基于人性和人道的关系被单一的阶级关系所取代﹔人类社会中一切善良、纯洁、美好的情感遭到无情的扫荡和清洗，而仇恨、残忍、构陷、叛卖、谎言、欺骗等等恶行由于被授予某种阶级的合理性而得到前所未有的张扬。人们目睹并身受了人类有史以来对人性的一次最不加掩饰的背弃，以及对于人类道德和价值的一次最无所顾忌的践踏。在这种情况下，人们唯一的选择就是逃避自由。\n\n这是20世纪整个时代的耻辱，也是20世纪整个人类的耻辱。然而，从整个世界范围来说，人类走向自由的航道毕竟已经开通，一个压制性的、自我封闭的中国已难以阻挡世界文明的冲击，中国人期待走出牢笼、面向世界的愿望越来越变得不可遏止。在最近的20年里，一批又一批勇敢的中国人站立起来为自由而战。整个80年代，对自由和人性的呼唤成为时代的主要标志，一种被专制守旧者贬斥为与西方“和平演变”相呼应的“自由化”思潮?仍?伏，冲决著一切殭化教条和极端专制主义的陈旧事物﹔至80年代末，终于汇成了以首都北京为中心的全国性争自由、争民主的民众示威抗议运动，即89天安门运动。\n\n这场规模空前的运动虽然以流血而告终，但她标志著中国人开始了新的觉醒，意识到必须作出新的选择﹔同时也预示著人类自由的曙光必将照亮每一个中国人的心灵，照亮他们脚下的每一寸土地。\n\n89天安门运动显示了人心向背，使得现存制度的合法性受到前所未有的挑战。然而，面对这种合法性危机，执政当局却并没有痛下决心以顺应民意。今天，他们的一切最基本的政策，一切最重要的举措，依然是为了一个既定的目标，这就是在他们能够控制的一切最主要的领域，继续违逆和压制民意，阻遏公民行使自由权利，以维持其原有的制度和秩序。\n\n中国人是惯于忍耐的。当一种制度和秩序对其权利和自由的侵害尚可忍受的时候，他们宁可选择容忍。他们忍受了“六四”惨案留下的巨大伤痛﹔他们忍受了有恃无恐的腐败官吏勾结社会恶势力对他们的欺压和掠夺﹔他们忍受了执政当局在所谓“稳定压倒一切”的口号下对他们的任何一点不满和反抗的打压。然而，中国这9年多来毕竟已发生了很大变化。随著公民权利意识的苏醒以及为自身权益所作的抗争越来越走向自觉﹔随著民间经济的逐渐壮大、中等以上收入居民人数的不断增加及其社会地位的提升﹔随著知识界、学术界、新闻出版界乃至一些党内人士开始冲破言禁争取到越来越多的言论空间，一个相对独立于现体制的、多元的现代民间社会正在逐步形成，人们对政权的依附性已经减弱。在这种情况下，如果执政当局不思变革而继续推行其压制政策，就会越来越不得人心﹔如果执政当局把人们的容忍视为对其权势的顺从而继续一意孤行，人们的容忍就会达到极限，他们就有充份的理由起来抵制权势者，以解除强加于他们身上的枷锁。\n\n现在，已经到了这样的时候，它迫使我们不得不把执政当局至今仍拒绝革除的种种弊政公诸于众──这些弊政过去是今天依然是我们争取自由及公民权利的最主要的障碍。\n\n时至今日，中国普通公民的财产权依然没有得到法律上的确认。这就从根本上限制了公民谋求自由、平等地参与社会经济活动和市场竞争的权利﹔同时，也给予了那些凭借权力侵吞国有资产、扰乱市场的蠹虫们以可趁之机。从法律上保障公民的财产权是保证公民获得其它一切自由权利的基础。然而，在今天的中国，社会成员中构成多数的无权者不仅得不到其财产的法律保护，而且事实上被剥夺了获取并拥有财产的机会。\n\n时至今日，中国的执政者依然把一个事实上已不能代表全民利益和意志的政治党派强加于全体公民的头上。他们以立法的形式使这个政治党派?驾于政府及所有其它政治党派和团体之上，并使国家的军队成为隶属于这个党派的军队。这种不经公民同意擅自把某一特定党派定为一尊的做法，今天已很难得到人们的认同。如果让这种状况继续存在下去，必将越来越同我国现代化进程中利益与价值趋向多元化的现实相冲突。\n\n时至今日，中国的执政者依然没有放弃对公民的意识形态统制。他们强制公民与“中央”保持一致，只允许公民接受一种“理论”、一种“主义”，不允许接受为官方所排斥的其它思想或价值体系，尤其是所谓“西方的”价值体系。他们至今仍然把诸如报纸、电台、电视台等公共媒体置于某一特定党派宣传部门的控制之下，迫使媒体充当这个党派的喉舌，以行使其箝制公众舆论的职能。他们封锁消息，隐瞒真相，用精心编织的谎言来掩盖现实生活中实际发生和存在的事情，掩盖特定党派和利益集团的特殊利益。然而，这种以最陈旧、最殭硬的方式干涉思想自由，限制公民自由地寻求、接受和传递信息的做法，已越来越同今天高度信息化的时代不兼容。\n\n时至今日，中国的执政者依然没有放松对各级选举的控制。他们利用手中的权力，通过内定候选人提名、操纵选举程序、对选举人施加压力、限制和取缔竞选等等一系列做法，以保证那些得不到民意支持却能效忠于他们的人当选，从而维持其对国家权力的控制。这种以专横的权力意志代替自由选举的做法，是对公民权利的公然践踏。它不仅完全违背社会的公正原则，而且完全违背优胜劣汰的社会进化法则。\n\n时至今日，中国的现行法律体系事实上依然是执政集团权力意志的体现和维护其权力的工具。由于在今天的立法和司法中仍然是党的权力高于公民的权力，领导人个人的权威高于法律的权威，这就使得普通公民很难通过现行的立法程序有效地保护自身应有的权益，也很少有可能通过这种程序有效地限制政府的权力尤其是权力的滥用﹔至于所谓“司法公正”、所谓公民在法律面前人人平等，则在多数情况下依然是有其名而无其实。近年来，执政当局一再作出承诺，要实行“依法治国”、要“加强法制”，但这并不能从根本上改变现行法律体系在国家权力系统中的从属地位。\n\n时至今日，中国的执政者依然没有放弃对言论、出版、集会、结社、游行、示威等等公民自由权利的压制。他们以“危害国家安全”、“阴谋颠覆政府”等莫须有的罪名，逮捕、审判依法行使这些权利尤其是言论、结社等自由权利的民间人士﹔他们采取种种极不文明的手段，限制、剥夺这些人士的人身自由，甚至采取法律外的强制措施，对这些人士实行任意羁押、监视居住乃至“劳动教养”。最近十余年来，处于社会弱势地位的工农劳动者被迅速地抛向社会的边缘，他们的合法权益遭受到远甚于其它社会群体的严重侵犯。然而，这些普通劳动者却被剥夺了任何反抗的权利，尤其是自由地组织工会（或农会）的权利﹔当他们被迫行使游行、示威等自由权利起来抗争时，政府当局不是推诿搪塞，虚意应付，就是实行粗暴的压制甚至无情的镇压。长期以来，中国执政当局在压制公民基本自由方面创下的恶劣人权记录，不仅遭到国内人士持续的抗议，而且遭到国际社会的普遍谴责。但是，执政当局至今仍拒不作出任何实质性的改善。\n\n时至今日，中国的执政者依然没有放弃对宗教和信仰自由的压制。他们查禁、取缔非官方的宗教团体和宗教活动﹔罗织种种罪名迫害宗教异议人士﹔威胁、恫吓民间教会的信徒。他们对藏族地区宗教人士、宗教文化的摧残至今仍没有停止。在对待宗教信仰的问题上，中国的执政者无视人们精神需要的多样性，更无视人们精神生活中形而上?求对于人类生存的意义﹔他们甚至以所谓“唯物论”和“科学”的名义来否定宗教本身存在的合理性。中国执政者这种对待宗教和信仰自由的蛮横态度，不仅是一种无知，而且是对人类自由心灵的一种仇视。\n\n时至今日，中国的执政者依然没有停止对学术活动、艺术创作的设禁与审查。他们严厉查抄有违官方禁忌的学术著作和文艺作品，严格控制非官方学术和艺术团体的活动。他们放任粗陋与平庸，放任恶俗与低下，却以极不信任、极不宽容的态度对待严肃而富有个性的创造。他们胁迫学者、艺术家实行自律，诱使学术界、艺术界人士放弃责任与良知而只关心自己的钱袋。这种情况不仅造成了民众精神追求的极度萎缩，而且导致了国民素养、民族文化的普遍劣质化。\n\n凡此种种，都与联合国《世界人权宣言》及两个人权公约的原则相抵触。长期以来，国内外许多有识之士曾以最恳切的词语提请中国执政当局关注公民基本人权和自由受到严重侵犯的种种事实，并吁请当局采取切实步骤予以纠正。然而，人们的每一次呼吁，执政当局不是置若罔闻，就是报之以恶意的侮蔑和报复。\n\n鉴于执政当局对民意的漠视，我们谨向所有中国公民及各界有识之士呼吁﹕在新的世纪即将来临之际，中国需要有一个好的开端。我们呼吁群策群力，以促成这样的开端。我们希望这个过程是和平、有序的。我们期待著公民们的广泛参与。\n\n为此，我们吁请所有的中国公民注意到我们所列举的种种妨碍我们获得自由的事实，并意识到改变目前的状况不仅是政府的职责，而且是每一个公民自身的责任。\n\n今天，中国和世界的种种事态表明，在即将来到的世纪里，无论从可以预期的国内演变来说，还是从可以预期的国际支持来说，都十分有利于中国自由事业的实现。我们不应放过任何一个历史的契机，不应放弃任何一个可能的努力。\n\n为此我们重申，人的自由是每一个人与生俱来的固有权利﹔人们为实现此项权利所作的抗争具有天然的合理性。这种抗争理应得到各个方面的同情，包括来自政府方面的同情。我们呼吁中国的执政者顺应民意，承认公民具有合法抗争的权利，直至放弃对这种抗争的压制。我们愿意看到中国的执政者以理性和明智的态度，来面对进入下一世纪必将提到议事日程的现存制度的根本性变革。\n\n中国是一个具有悠久历史传统的国家。由于几千年源远流长的皇权主义和等级观念的束缚，我们中国人的个体意识以及对于个人权利及自由的信念一向相当淡薄。我们应当承认，这决不是我们民族的优点，而恰恰是我们民族的弱点。这种弱点使得很大一部份中国人至今仍难以摆脱传统的依附性性格和历史的惰性﹔但是，如果不改变这种性格和惰性，中国将仍然在王朝专制的历史回圈中踯躅。为此，我们需要作全民族的检讨，从根本上改变所谓国家和整体利益至上，而把个体的价值消融于整体之中的陈腐观念，以树立起公民的独立人格。中国人应以新的面貌向世人表明，我们同世界上其它民族的人民一样，同样有足够的勇气与智能同自己的过去告别，更有足够的勇气与智能去面向未来。\n\n我们深信，未来的中国将是充满希望的中国﹔未来的中国人将是充满自豪的中国人。\n                                                                                                     1998年9月22日\n```"
		},
		{
			"post_id": 10,
			"title": "许章润：我们当下的恐惧与期待",
			"date_published": 1546259235,
			"body": "   包括整个官僚集团在内，当下全体国民对于国家发展方向和个人身家性命安危，再度深感迷惘，担忧日甚，已然引发全民范围一定程度的恐慌。盖因近年来的立国之道，突破了下列底线原则，倒行逆施，而这曾是“文革”后执政党收拾合法性，并为三十多年的“改革开放”证明为最具正当性的政治路线，也是全体公民和平共处最低限度的社会政治共识，本不该动摇，千万不能摇撼。\n\n   一、四条底线\n\n   那么，是哪四项底线原则呢？\n\n   第一，维持基本治安，明确国家愿景。结束连年“运动”，中止“和尚打伞无法无天”，以包括连番“严打”在内的强力整肃，阻止社会失范，维护社会治安，同时尽力实现社会和解，大致提供了一般民众生聚作息的基本秩序条件，是四十年里现有政体的底线合法性，也是历经劫难后的亿万国民拥护“改革开放”的原因所在。虽说从治安到公正，自就业而尊严，公共产品的内涵缺一不可，而且时移世易，诉求必然逐次提升，但在高端产品阙如之际好歹有底线保障，对于历经动乱和苦难的百姓而言，总是好事。毕竟，升斗小民，日常起居的美好愿景不过是安宁生活，期期于温饱小康，而以世道安靖为前提。虽说此种治安格局及其后来发展出来的“维稳”路径，反过来滋生出新的问题，暴露出政治统治正当性不足这一致命病灶，但就其提供基本治安而言，却是成功的，也是合意的。\n   不宁唯是，三十多年里，尤其是1992年春夏之后，执政党以经济建设为中心，所谓“专心致志谋发展，聚精会神搞建设”，坚持二十年不变，则官民互动之下，几个回合下来，一般国民认为不管谁上谁下，他唱罢你登场，反正发展经济、专心国家建设这一条蔚为基本国策不会改变。有此预期兜底，遂仿佛多所安心，接受既有政体安排，你当你的官，我过我的小日子，而合作共谋出此刻这一社会治安格局。换言之，不是这个梦那个梦，而是发展经济社会，专注于国家建设，别搞运动，安宁生计，凡此底线原则，筑就了展示并通达国家道义愿景的起点，也是百姓接受统治的前提。\n\n   第二，有限尊重私有产权，容忍国民财富追求。从废除私有制，声言私产为万恶之源，到有限保护私有产权，容忍亿万人民对于财富增长的追求，并且诉诸立宪，所谓“私产入宪”，释放了发家致富的普遍人欲，给予追求美好生活的人性志向以正面政治迎应。在此情形下，不仅国家经济实力空前增长，并以此支撑了科教文卫与国防武备，特别是庞大的党政费用，而且，一般国民亦多获益，生活水准多所提升。此为中国经济快速成长的法制缘由，同时说明了既有政制合法性之获得全民容忍的经济原因。毕竟，动什么，别动大家的钱袋子，是硬道理。其实，此为一切正常人类社会的通则，近世产权理念与人性观念为此特加张本，“改革开放”以“拨乱反正”皈依普世大道，实为知错能改善莫大焉。\n\n   第三，有限容忍市民生活自由。几十年里，公民社会不见成长，稍有冒头即遭整治，严重阻滞了国民政治心智发育与公民人格养成。政治社会更是不见踪影，导致中华国族的政治成熟捉襟见肘。但是，伦理社会基本恢复，经济社会与市民社会确乎多所发育。市民自由而非公民自由，尤在市场经济较为发达省份，早成生活事实。所谓市民生活及其市民自由，指的是私性领域的有限生活权利，着重于吃喝拉撒卿卿我我，特别是对于自家生活方式无涉政治的自我支配，至少是发型服饰无需看官家脸色行事。大家搓澡搓脚，旅游宴飨婚外恋，小资麻麻，这世道才有烟火气。较诸毛氏极权政治下千篇一律的铁桶生活，连裤裆都管得死死的，此刻国民暂弃公民身份追求，而满足于市民幸福，回归普通人的日常本色，既无可厚非，更是大家之能容忍刻下政体的原因所在。就此而言，警力以抓嫖为柄，实施定向人身控制，造成普遍不安全感，虽于一案一事得计，可丧失的却是普遍的市民预期，反而得不偿失。至于北京市以整治市容为据，而将好端端便民商铺酒肆一律封拆，彰显的是“光荣政治”对于市民社会的为所欲为，一种权力的美学恶趣。——就是香港、伦敦与巴黎，超大规模国际大都会，不还都容忍并规划街市交易嘛。至于市场经济之下，笑贫不笑娼与娱/愚乐至死，忸怩作态、无德无识无耻却大富大贵，亦为普通众生的市民生存，遵循的是商品逻辑，讲述了一个不得不为了市民常态生聚而付出文明腐朽代价的现代喜剧与后现代闹剧。\n\n   第四，实行政治任期制。三十多年里，究其实质，虽说社会多元与政治容忍度明显增长，但整个政治体制未见任何具有实质进步意义的变革，骨子里依旧是那一套陈腐而残忍的敌我斗争与专政理念，外加上“吃江山”的贪婪丑态。但因立宪规定了包括国家主席和国务总理在内的政治任期制，以及“人权入宪”，并经2003年以还的十年任期后实现党内和平禅让，终于兑现了最多连任两届、最长十年这一宪法规定，纸上的宪法规定至此似乎积习而为“宪法惯例”，好像立法与实践均双双尘埃落地，这便总算给予国民以一定政治安全感，也令国际社会觉得中国正在步入现代政治。不妨说，三十多年里嚷嚷政体改革而政体岿然不动，这是唯一看得见摸得着也拿得出手的政治改革成果。在大家看来，不管你如何，不过就是十年的事。诸位，百姓无辜，小民蝼蚁，平时面朝黄土背朝天，分散如沙，为养家糊口而劳生息死，根本无力抵抗任何组织化强权。此刻终于好歹有此“十年任期”，似乎感觉也还算是对于随时可能爆发的政治任性的一招制约，这便随遇而安地打理自家柴米油盐也。\n\n   综上所述，总体来看，以治安为导向的社会控制，在提供治安这一基本公共产品层面，依然有效，但发展至“维稳”体制，局部地区甚至是一种准戒严状态，则尾大不掉，靡费非常，说明体制潜力已然用尽，有待升级换代。特别是此次中美贸易战争，将国力的虚弱与制度软肋暴露无遗，更加强化了不安全感。此前高峰申言，“执政合法性不是一劳永逸的”，对此危机似乎还有所警醒，而近年来对此严重缺乏敏感，却自信膨胀，类如“扶贫运动”和这波正在进行的“打黑运动”这种准运动式政经操作方式再度登场，令国家愿景的确定性再度打折。另一方面，对于私有产权的有限保护与一般国民发家致富欲望的有限满足，不仅促进了经济增长，而且提升了亿万国民的生活水准，但却终于遭遇所谓“国进民退”与实际生活中屡屡发生的公权力肆意剥夺私有产权恶性案件的证伪，倒逼出“私权神圣”这一国民诉求，而背后的逻辑不过是“权力不能私有，财产不能公有”这一公民认知。本来，“分清公私”方能“提供和平”，二者均为古今政治的基本内涵，今日于此必得过关而后安。而最为世诟病并令人胆战心惊的，便是修宪取消政治任期制，等于一笔勾销了三十多年的改革开放，一巴掌直要把中国打回那个令人恐惧的毛时代，伴随着甚嚣尘上而又可笑之至的领袖个人崇拜，这才引发出下列全面恐慌。\n\n   二、八种担忧\n\n   在此，总括而言，大家的担忧与恐慌，主要集中在下列八个方面。\n\n   第一，产权恐惧。几十年里积攒的财富，不管多少，能否保有？既有的生活方式能否持续？法定的产权关系还能获得立法所宣谕的保障吗？会不会因为得罪了哪位实权人物（包括村委会主任）就企业破产、家破人亡？凡此种种，最近几年间，反倒随着时间推移，而愈发缺乏确定性，遂至上上下下恐慌不已。它首先冲击的是在改革开放大潮中已然掘金成功人士，而以大规模富人移民现象作为应对之道。一般中产阶级中下层，温饱有余，但却同样为生老病死进程中随时可能降临的任何意外而担惊受怕，尤其害怕通胀通缩钱不值钱。当然，富人移民的原因复杂，既有追求更高生活品质的，也不乏洗钱赶紧溜的，更有权贵携款逍遥法外的，但普遍缺乏产权安全感则为通例。官商一体权贵的巧取豪夺是“改革开放”的最大赢家，也是富人移民的主体。官方信息披露有限，民间传说嘈嘈切切，加上官媒时不时演奏个“共产党的终极理想就是消灭私有制”之过门，伴随着“打土豪分田地”式民粹叫嚣，更且加剧了此种不安全感。恐慌之际，高峰居然集体学习《共产党宣言》，一份曾令世界不得安生的两位年轻天才的轻狂之作，其予全体国民的负面心理震撼，也只有在此语境下，才能获得真切解释。\n\n   第二，再次凸显政治挂帅，抛弃以经济建设为中心这一基本国策。几年来，意识形态火药味愈来愈浓，以争夺话语权为标识，而实则依仗公权力施行意识形态迫害的阵势，已然导致知识界的普遍恐慌。置此情形下，自我审查，层层加码，导致出版业遭受重挫，舆论界钳口日甚，中国与外部世界勾连之阻力加剧。甚至出现了鼓励小朋友举报告发父母这类官方宣传品，违忤基本伦理，既反传统又违现代，活脱脱一副极权政治嘴脸，令人不得不想起曾经的野蛮“文革”岁月，实在匪夷所思。影响所及，大学教师连连因言获罪，因为担忧党政宣传口子找麻烦与课堂上学生特务告密，而战战兢兢。更为严重的是，地方官僚基于政治担忧普遍不作为，而中国经济的成长实在有赖于地方官员基于政绩观而认真干活的发展观。那边厢，“重庆模式”那帮余孽与高校中曾经的“三种人”联袂一体，今日摇身一变，滚雪球，构成“新极左”，喊打喊杀。\n\n   本来，一般国民对于“政治运动”之苦记忆犹新，新生代汲汲于市民生活，已然习惯于常态经济社会与市民生活，对于人为的“政治挂帅”与毫无逻辑的极权泛政治化倾向，了无兴趣，也不关心，硬逼他们，只能徒增反感。实际上，几十年来，上下一心，这个政治体制还能获得国民容忍，就在于国家以经济建设为中心，全心全意谋发展，不再天天运动式“讲政治”，停止或者减少干涉私人生活，更不会上演什么“宁要社会主义草，不要资本主义苗”这类荒唐闹剧。终究而言，“以经济建设为中心”发展到一定阶段，必需转向以宪政建设为中心，而于政经两面次第推进建设现代国族，为现代中国接生。但就目下而言，最低限度却依然应该是固守前者，再谋他图，岂能背道而驰。\n\n   第三，又搞阶级斗争。前几年官媒与官方意识形态主管官员屡提阶级斗争，早已让大家一阵恐慌。这几年的施政方向，令人再度怀疑会否重搞斯大林—毛韶山氏阶级斗争那一套。犹有甚者，随着反腐之第次展开，特别是新建国家监察委及其权力之无限扩大，将全体公教人员悉数划入，连普通医生、护士与教师都“全覆盖”，不仅未能提升大家基于法制的安全感，相反，却不禁令人联想到克格勃式辖制以及残酷的党内斗争的可能性，而再度引发重回过往阶级斗争岁月的阵阵恐慌。因而，对于“斗，斗，斗”这一恐怖政治模式的国民记忆，及其是否重回华夏大地的普遍担忧，使得政治疏离感日增，和合与祥和气氛日减。本来，“私产入宪”与“人权入宪”，伴随着两任到顶这一党内禅让制的施行，有望朝向一个常态国家渐行渐近，意味着不再需要动用“斗”字诀，可这几年的做法却仿佛与此背道而驰，大家自然心惊胆战。\n\n   第四，再度关门锁国，与以美国为代表的西方世界闹僵，却与朝鲜这类恶政打得火热。中国的经济成长与社会进步，是中国文明的自我进步，循沿的是超逾一个半世纪的文明大转型固有逻辑，也是现代世界体系在中国落地后之发育成长，并非外力所能主导。但在具体操作层面，却是在重启“改革开放”而与西方世界关系改善之后，以进步主义为导向，以“与世界接轨”为目标，而搭乘上全球化市场经济快车实现的。没有“开放倒逼改革”，就没有今天的中国经济、社会和文化。而与朝鲜、委内瑞拉这类失败国家、极权国家打得火热，违背民意，忤逆历史潮流，实在不智。虽说民间调侃，鉴于中国大量官商的子女玉帛均寄存于彼方山水，故而不用担心两国交恶，但明暗之间一闪失，倒霉的是这个据说全民所有的国族，而必然落在每个具体的百姓人头，摇撼的是他们的口粮与衣衫。在此，究其缘由，就在于以政党理性代替国家理性，而以扭曲的国家理性压制公民理性，不思进取，一意孤行，早已落后于时代思潮，所以然哉，有以然哉。\n\n   第五，对外援助过量，导致国民勒紧裤腰带。据说中国已成世界最大外援国，动不动“大手笔”划拉几十亿几百亿。此就一个发展中人口大国而言，不少地方还处在前现代，实在是不自量力。究其根源，扩张性“光荣政治”逻辑作祟，蔚为主因，而公子哥心态与做派亦且难辞其咎。现有的国家财富，包括那三万亿外储在内，是四十年里几代人血汗累积的，更是远自洋务运动以还数代中国人奋斗的善果，怎能随便乱花。长期高速的经济增长终有结束之时，则如此慷慨，类如当年无原则“支援亚非拉”，导致亿万国民勒紧裤腰带过日子，甚至于饿殍遍野，在在不能重演。此次中美贸易战爆发后官媒以“共克时艰”号令，傥论什么“先天下之忧而忧，后天下之乐而乐”，立刻遭遇百姓无情嘲讽，“去你妈的，都哪儿对哪儿呀”，正说明人心所向，早已非当年那般忽悠得了的了。\n\n   第六，知识分子政策左转与施行思想改造。虽然早就说知识分子是劳动人民的一部分，但一有风吹草动就拿他们当外人，甚至当敌人，已成国朝政治的最佳晴雨表，也是政制底色的政治表达。教育部一再声言要加强对教师的思想教育，网传必须重点防范海归教师，以及高校中的极少数文革遗左纷纷如打鸡血般跳将出来喊打喊杀等等，都令人担忧所谓的知识分子改造政策再度降临，特别是伴随着政策左转而再次施行思想改造运动，乃至于不排除更为严重的态势。“妄议”大棒挥舞，人人噤若寒蝉，还有什么言论自由可言。而无自由思想与独立精神，则探索未知、学术精进与思想创发云乎哉。本来，历经这四十年的积累奋斗，再好好干一、两代人，中华文明有望迎来一个思想学术的全盛高峰。但是，假若此种钳口政策再延续下去，甚至日益趋紧，则此种可能性无望变成现实性，中华国族终究只是精神侏儒与文明小国。\n\n   第七，陷入重度军备竞赛与爆发战争，包括新冷战。短短十年间，整个东亚其实已然陷入军备竞赛，但所幸爆发战争的概率依旧尚处可控层面。问题是，不能由此打断中国的常规发展，就此摧折了尚未最后水落石出的伟大现代转型。两年来，在“阻止中国陷入全面内战”与“保卫改革开放”两文中，笔者都曾指认中国逐渐于“维稳体制”之上又叠加了“战备体制”，就在于提示其危险性，防范其负面影响。此刻随着内政紧绷与外贸纠纷日甚，经济下滑可能性加剧，则其进程不可控因素增多，防范其不至被迫走向战争状态，不管是热战还是冷战，绝非杞人忧天。坊间舆议提醒中美贸易争端不应再引向意识形态之争，更不要进行政治模式之争，亦为同此忧虑而发，还算靠谱。\n\n   第八，改革开放终止与极权政治全面回归。虽说“改革”一词已然多少污名化，毕竟，恶政亦且假尔之名而行之，但在当下中国语境下，置身大转型尚未完成、有待临门一脚的现状，较诸爆炸性革命与极左式的倒退，改革依旧是最为稳妥的路径。改革空转，抑或不进则退，早已非只近几年的事了，实已延绵一届任期。照此趋势以往，“改革开放”会否就此终止，极权回归，亦未可知。此时此刻，全体国民之最大担忧，莫此为甚。说是极权回归，就在于胡温任期，仿佛出现极权向威权过渡趋势，故而称为“后极权时代全能型威权政制”。但这两年反其道而行之，这才引发“极权政治全面回归”的恐慌。中国近代史上，1894年的甲午战争与1937年抗战爆发，两度打断中国的现代进程，致使追求日常政治的努力付诸东流，中国的现代事业因而被迫延宕。今日这一波延绵将近两个世纪的大转型已到收尾时段，有待临门一脚，切切不能再因战祸而中断。倘若中断，下次历史机遇何时再来，恐伊于胡底矣。\n\n   三、八项期待\n\n   当此之际，针对上述担忧与恐慌，从内政着眼，无涉经贸（包括大幅度减税），也不上纲上线到民主法治层面，仅就下列八项而言，具体而有形，允为时务。\n\n   第一，杜绝援外撒钱“大手笔”。非必要的无谓援外大撒把，砸钱，最令一般民众反感寒心。中国尚处发展爬坡时段，无论基础设施还是民生福利，均难题如山，任重道远。且不说养老、就业与教育，但就乡村凋敝而言，就压力山大，而需公权力多所措意。否则，半个中国仍处前现代，等于现代中国只是个半拉子工程，谈何文明复兴。近日中阿论坛期间宣布拨银两百亿美金，设立所谓阿拉伯国家“重建专项计划”，并且“探讨实施总额为10亿元人民币的项目，支持有关国家维稳能力建设”。可我们知道，海湾国家个个富得流油，何需尚有上亿未曾脱贫国民的中国在此充当冤大头，让人不禁感慨有司心肠何在，还把自家国民当人待吗？——纵便此间涉及“战略布局”，但难免搅入既有大国博弈，而导致战线过长，亦嫌稍早。而且，凡此支出，完全无视既有预决算体制，将最高国家权力机关的国库司库宪法职权撇在一旁，在实质性瘫痪既有官僚科层建制化之际，等于向宪制与法制开战。\n\n   第二，杜绝主场外交中的铺张浪费。开个平常的会，就使劲折腾，不计成本，劳民伤财，其实既无里子也无面子。此为“光荣政治”，而非“实利政治”，更非“实力政治”，亦非什么“中国人民自古以来具有热情好客的优良传统”，非徒谋虚荣者不为。照此思路，联合国所在地的纽约峨冠博带，岂非天天戒严不可；全球性组织最多的日内瓦和巴黎，衣香鬓影，还不夜夜都要放烟火。就国家自助体而言，概需以实力立世，而旨在谋取实利，同时不废道义心肠。两项既存，三者并立，沾溉国民，荣光不求自来。无此维度，汲汲于光荣政治那一套，当事者出头露面好像挺风光，而不恤民力，做冤大头，实则招人鄙夷，也会激发民愤。连举世嫌弃的隔壁独夫胖墩来，居然大阵仗迎送，那文图俱在、传闻中酒席宴上128万元一瓶的矮嘴茅台，说实在的，一下子令亿万国民离心离德。——还中国梦呢，做梦吧！\n\n   第三，取消退休高干的权贵特权。国朝体制，高干生养病死全赖国库，而享受超国民待遇。原有生活待遇、医疗标准与度假休养诸项，耗费巨量民脂民膏，大家耳闻目睹，而至今不敢公布，正说明见不得人。此种体制，承继的是朱姓子民、八旗子弟的奉养传统，既违忤曾经自诩之革命精神，更不符现代公民立国原则。若说什么“封建残余”，此为典型。国民痛恨不已，可毫无办法，遂成制度招恨之一大毒瘤。这边厢普通人民住院难，那边厢高干病房巍哉峨兮，隔离于一般病区，让多少百姓看在眼里恨在心里，而每一丝仇恨都可能在某个时刻于心田中成长为惊天雷暴。\n\n   第四，取消特供制度。七十多年里，其实早从延安时期就已开始，无论是在国民饥寒交迫的年代里，还是此刻亿万百姓为婴儿奶品、日常食品安全而提心吊胆之际，特供制度供养着这个号称人民政权的高层权贵，提供着一般人做梦都不敢想象的诸种特权，除开几个极权政体之外，举世找不出第二家，可谓豪奢之至，而无耻之尤。社会恒有差等，贤愚贫富实为自然，但那是结果，而非抹煞起点平等的公民理想，更非公然利用国库供养少数权贵。此制一日不除，“第34号”依旧，中国食品安全就一日没有保障，两方同样无任何真正的安全可言。\n\n   第五，实施官员财产阳光法案。有关于此，民间早已呼吁多年，居然毫无动静，说明其间猫腻最大，最见不得人。现有官员升迁程序中对于子女玉帛的说明，只限内部掌握，存见于干部档案，而一般国民无从知晓，遂使一切迷雾重重。而无论人力物力，还是技术手段，早已成熟，正为施行此制，并经由全国联网，用十四亿双眼睛施行有效监督，铺垫好一切基础。反腐而腐败不止，就在于搞成了内部的事，而非基于政治公开原则的法制作业，缺的就是阳光法案这一环。你们若非心虚，那就施行此制，让一切大白于天下吧！你们要是正心诚意，那就加入大多数国家均在其中的《艾格蒙国际反洗钱组织》吧！何必云山雾罩，将亿万国民当二百五。\n\n   第六，“个人崇拜”亟需赶紧刹车。改革开放四十年，没想到神州大地再度兴起领袖个人崇拜。党媒造神无以复加，俨然一副前现代极权国家的景象。而领袖像重现神州，高高挂起，仿佛神灵，平添诡异。再者，官员讲话，本为秘书手笔，不过等因奉此，居然汇编刊行，精装亮相，全球免费赠送，徒耗纸张，令人喷饭。此间不仅需要反思为何当事人如此弱智而好名，更需要检讨为何曾经遭遇此种戕害的偌大国家，包括她的芸芸“理论家”“研究者”，居然对此毫无抵抗力，却不乏舔痈吸疽之徒。而亿万人犹如虚无，竟然容忍其大行其道，奈何不了那几个马屁精大员，正说明所谓启蒙是一个未竟事业，需要每一代人在公共事务上公开运用自己的理性，方能如履如临而砥砺前行。而且，它更加说明中国尚未完全进入现代世俗理性的常态国家境界，而有待接续奋斗矣。\n\n   第七，恢复国家主席任期制。年初修宪，取消政治任期，令世界舆论哗然，让国人胆战心惊，顿生“改革四十年，一觉回从前”的忧虑。此间作业，等于凭空制造一个“超级元首”，无所制衡，令人不禁浮想联翩而顿生恐惧。因此，今明两年的适当时机，如秋季召开人大特别会议或者明年三月全国人大例会，通过再度修宪，恢复国家主席任期制，以保卫改革开放、防范重回文革极权政治。《宪法》既立，无论是何种质量的宪法，本不宜改来改去，无奈这是大转型时段过渡政体下的一部临时宪法，只好频繁修订。但愿转型落地之前，这是最后一次修宪。\n\n   第八，平反“六四”。今明两年，适值“改开”四十周年、“五四”百年与“六四”三十周年，一连串所谓敏感节点纷沓。而中美贸易战的后果，亦将延时第次显现，增加了所谓的不确定性。在此，既有的“维稳”思路是“以治安对付政治”，叠加上“用政制钳制政治”，而非“以政治迎应政治”这一常态政治之道。当年给“四五”平反，从此每年四月五号不再成为敏感节点，就在于“以政治迎应政治”，兵来将挡水来土掩，结果各得其所，皆大欢喜。因此，值此迎来“六四”爆发三十周年之际，当局于今明两年适当时刻公开为其平反，不仅表明“以政治迎应政治”的诚意与智慧，而且，从此每年六月四号无需再如临大敌，为全体公民政治上的和平共处扫清障碍，既裨益于民心舒畅，更有助于收拾政治合法性。\n\n   以上诸项，均为现代政治的一般常识，也是刻下国人的普遍诉求。此番“冒着杀头的危险说出人所共知的道理”，就在于举世滔滔，若无此说法，就无此立法，从而吾侪百姓没个活法，其奈也何，呜呼哀哉！\n\n   四、过渡时段\n\n   两年多来的世界进入政治调整小周期，无需惊恐，远未到分晓时分，更须也唯有稳健推行内政改革，健全国族身心，方能应对过关，维持包括中国在内的这艘世界大船持续扬帆于和平与发展的常态政治航道。冲突与战争是人类这个残忍物种的常态，但是身处历史机遇关头而推延或者避免其发生，则为政治的天命所在，更是对于肉食者政治智慧与德性的大考，而人类恰恰就是政治的动物，政治为世间最高智慧。就刻下情形而言，纵便事态已如今日，也还未能根本偏转“和平与发展”这一大势。而这就是历史机遇，就是所谓的“机遇期”，唯智者方能攫获，而不至于东怼西怼，将一手好牌打成烂牌也。\n\n   至于太平洋沿岸东西两大国均不期然间先后步入“老红卫兵执政”状态，是而且不过是一种短暂的过渡现象，实为每临历史危机关头就会出现的那种一再上演的乱象之再现而已。就此岸言，其毫无历史感与现代政治意识，更无基于普世文明自觉的道义担当，昧于时势大道，却又深濡文革政治烙印，虚骄之下，允为干才而用力过猛却用错了方向，致使弄权有术，当官有方，而治国无道，岂止折腾，直是倒行逆施。就彼岸看，实为一群依旧生活在列强时代与冷战政治中的老不死幽灵登台，虽不乏对于当今世界政治图景与文明变局的现实判断，却同样缺乏历史感，短视而贪婪，根本开出了误诊处方，反将早年裙带资本权贵的重商主义国策与基于唯我独尊、掠夺成性的帝国主义式傲慢偏见与粗鄙蛮横，赤裸裸的讹诈，尽兴抖露无遗，展示了一个文明衰败的疲惫帝国狗急跳墙式的晚期症状。而自大爱国狂适成祸国害人精，所谓爱国贼，中外古今，史不鲜见。同时，它还说明，如同“坏人变老了”一般，人人都是自己早年教育体系的产物，此后无所用心，了无自省，便难以挣脱羁绊。以旧知识应对新事物，却又自信爆棚，遂刚愎自用。其理念，其政策，如托克维尔所言，不过是“发霉的旧货”。\n\n   此时此刻，就中文世界的一般舆议心态与脉络来看，基于公民理性的政治自觉已然充沛发育，更不缺昂扬正大的道义立场，但少见基于国家理性意识的文明自觉，特别是未能梳理清楚适用于“国家间政治”的国家理性与适用于“国家政治”的公民理性之二元分际，而混战一团，指东打西，甚至崇拜起彼岸老红卫兵来，将自己降格到铁锈州红脖子们的水准，套用一句名人名言，可谓“土样土尿泡”。同时，也是政体感召不足，导致认同缺失或者疲弱，而使国民身份与公民认同两相悖逆之怪象。毕竟，“大清”与“中华”，虽纠结缠绕，还就真的不是一回事。你们“坐江山”“吃江山”，江山有事了，就让大家“共克时艰”来“保江山”，这不扯淡吗！有舆议感慨，一些人说话办事，仿佛自己不是中国人，而处处倒为对方设计着想，实在是怪而不怪，正为向心力凝聚力这一软实力不足国族常见的景象矣。再者，撇开究竟何为“中国人”等等认知争议，置此情形下，可得申言者，两边各说各话，越是昂扬正大，越可能将话谈死，而无转圜余地。凡此再度说明，国族的政治成熟必以其知识精英的心智作育为先导，而心智作育要在精神自由，众口喧哗却又紧扣人生与人心的普世心思，摒拒任何定于一尊的愚妄与傲慢，要求当局不要再钳口日甚，而把言论自由还给读书人——毕竟，“子产不毁乡校”——从而，在几代人的接续用功磨砺中，涵养保育中华文明思想母机，护卫其功用，强化其势能，这才有望清醒观势，冷静应事，而清明用世矣。\n\n   目前来看，当局一再重申绝不会因为贸易战而改变“改革开放”的基本国策，也不会动摇在开放交往中发展经济的既有路线，并决心协力捍卫多边体制。与此表态相呼应，并有相应开放措施出台，仿佛尚有定力。其于证明“开放倒逼改革”这一中国式发展路径依赖的同时，却又似乎未见任何实质性内政改革，雷声大雨点小，则不免令人失望，而对其诚意和实效，采取游移观望态度。故而，上述八项，允为时务，先做起来再说。\n\n   都说你能干肯干，这八项你只要干一件，我们就欢喜。你要是干三、四件，我们就心服口服。你要是全干了，则普天同庆。\n\n   年初高官曾经宣示今年还要陆续放大招，以回应“改革开放”四十周年，此刻时间过半，宁信其有，且翘首以待矣。\n\n   最后，顺说一句，陕西省梁家河村四五十户人家，常驻百十来口，居然在上海设立联络处和农副产品展示馆，一望可知非淳朴乡民所能为，毋宁，官商勾结的媚上双簧，于各怀襟抱中各逞其图。还有，最高检开设“12309检察服务中心”，层峰邀约与此八竿子打不到一块儿的梁家河村支书共同揭牌，同属太监姿态，希图借此创造勾兑机会，拍马屁不要脸。至于陕西省社科联的招标项目“梁家河大学问”，以及近年来各类所谓社科项目之造神运动与领袖崇拜，反现代，逆潮流，匪夷所思，恬不知耻，丢人现眼，更不论矣！凡此种种，太作了，太过分了，而过犹不及，只会把我们带回那个人人觳觫苟存的酷烈人世也！\n\n   话说完了，生死由命，而兴亡在天矣。\n\n   2018年7月"
		},
		{
			"post_id": 9,
			"title": "杜光：在严正学画展开幕式上的讲话",
			"date_published": 1525445221,
			"body": "我今天很高兴能有机会参加严正学先生的个人画展。严正学先生是一位我很敬重的杰出的艺术家，但他长期受到当局的打压。今天的这个个人画展得以举行，是他坚持斗争的成果，值得高兴，值得祝贺！\n\n---\n\n长期以来，我们大家所接受的教育都告诉我们：艺术应当为人民服务，为社会服务。这个观念当然不错。但是我认为，对这两句话应当准确地进行解读。在现当代的中国社会，艺术要为人民服务，为社会服务，就必须为经济市场化、政治民主化、文化自由化、社会平等化服务，因为这“四化”符合于人民群众的利益和愿望，符合于社会进步的要求和前景。严正学多年来的创作，不但是艺术的精品，而且也是反封建反专制、争民主争自由的武器，为争取政治民主和文化自由，做出了显著的贡献。\n\n我是艺术创作的外行，但看了今天在这里展出的严正学的画作，却强烈地感受到这些画作的抗争和自由的精神。为自由而抗争，因抗争而自由，这些画作正是抗争和自由的结晶。\n\n我认为，抗争和自由，是严正学的艺术创作的精神所在。这种精神，也同样体现在他所创作的林昭和张志新的雕塑里。我就是在严正学创作林昭和张志新的雕塑的过程中同他结识的，我曾参观严正学创作的林昭和张志新的石膏塑像，也参加了在铁玫瑰园举行的林昭、张志新铜像的揭幕式。林昭和张志新是现代中华民族最优秀的女儿，她们由于坚持自由民主的理念和对专制统治的批判与抗争而惨遭迫害，备受摧残，最后献出了她们宝贵的青春和生命。严正学以建立塑像的方式，为她们树碑立传，发扬她们的抗争不屈的精神，在民间争取自由民主的历史上，写下了光辉的记录。\n\n严正学先生曾经主张把林昭的铜像送给她的母校北京大学，把张志新的铜像送给她的母校人民大学，希望这两个学校把铜像分别安放在她们母校的校园里，但遭到这两个学校的拒绝。北大和人大是林昭和张志新的母校，有这样杰出的校友，是母校的光荣。但这两个学校的领导人却把光荣当耻辱，拒绝接受林昭张志新的铜像。如此是非颠倒，实在令人愤慨。严正学无奈之下，只好把两个铜像安放在自己住宅的庭院“铁玫瑰园”里，对外开放，供全国各地人士瞻仰。\n\n我希望并且相信，林昭和张志新的铜像总有一天会回到她们的母校，被安放在她们母校的校园里，供学生们瞻仰。林昭、张志新的理念和精神，将成为千千万万青年学生学习的榜样。只有这样，严正学先生创作的铜像，才真正能够发挥应有的作用。\n\n祝严正学先生的画展圆满！成功！\n\n谢谢大家！\n\n（根据记忆中的2018年1月6日讲话内容整理，略有增删）"
		},
		{
			"post_id": 8,
			"title": "（转）《批评官员的尺度》摘录",
			"date_published": 1525003876.5,
			"body": "半日偷闲于 Sep 17, 2017\n\n——若批评不自由，则赞美无意义。（中文版封面）\n\n在kindle上又重温了一遍《批评官员的尺度》，不得不说，kindle太方便了，读书过程中看到好的东西直接批注或标记一下，再导出来，那么方便。\n\n* * *\n\n介绍：《批评官员的尺度:〈纽约时报〉诉警察局长沙利文案》内容简介：1960年，因为一则批评性广告，警察局长沙利文以诽谤为由，将《纽约时报》告上法庭，并申请巨额赔偿。两审失利后，几乎被各地官员相继提起的索赔逼至绝境的《纽约时报》，奋起上诉至联邦法院。九位大法官在“《纽约时报》诉沙利文案”中力挽狂澜，宣布“对公共事务的讨论应当不受抑制、充满活力并广泛公开”，维护了媒体、公民批评官员的自由。《纽约时报》资深记者、两度普利策奖得主安东尼• 刘易斯以翔实史料、生动笔触，系统回顾了这起新闻自由史上的“里程碑”案件，并循此为线，串接起美国民众关于言论自由的司法抗争历史，完美展现了霍姆斯、布兰代斯、汉德、沃伦、布伦南、布莱克、韦克斯勒等伟大法官、律师的形象。\n\n我们来看看那些经典的语句吧，相信，看完了对现在的社会会有所想法。\n\n1、杰弗逊在总统就职演说中表达的政治理念：“如果我们当中有任何人试图令联邦解体，或者改变共和政体，就让他们不受任何干扰地畅所欲言吧。容忍错误意见的存在，让不同观点辩驳交锋，正是我们得享安全的基石。”\n2、宪法禁止处罚任何思想、信仰的传播，无论在多数人眼中，这些思想或信仰有多么荒谬，多么危险。他写道：“在宪法第一修正案项下，没有什么错误思想之说。无论一种思想看起来多么有害，我们赖以校正它的，不是法官或陪审团的良心，而是其他思想的竞争。”\n3、不能把对政府的批评，等同于对官员的诽谤，\n4、霍姆斯大法官在异议意见中，提醒人们“应当对某种做法时刻保持警惕，那就是对那些我们深恶痛绝，甚至认为罪该万死的言论的不当遏制”。\n5、在言论自由与宪政体制内的其他重要价值（如公民名誉权）之间保持平衡。名誉，是人们自我认知的重要因素，损害名誉就是破坏一个人的完整性。\n6、判决不仅将言论自由视为公民的固有权利，还将之视为良好政治的必要条件。\n7、“是人民，而不是政府，拥有绝对主权”，这是美国政制与英国制度的“本质区别”。以及麦迪逊稍早前在众议院说过的话：“如果我们留意共和政府的性质，我们不难发现：如果有检查言论的权力，那也应当是人民检查政府的言论，而不是政府检查人民的言论。”\n8、它不仅约束了人民自由检视公众人物和公共事务的权利，还限制了人民自由沟通的权利。\n9、“全国有色人种协进会案”的判词：“在自由争论中，错误意见不可避免；如果自由表达要找到赖以生存的呼吸空间，就必须保护错误意见的表达。”\n10、自由的本质所在：容忍不受限制，甚至刻薄、尖锐的争论。\n11、人民有权获知政府的日常作为，无论这些作为是否正当。充分的资讯是遏制恶政的最有效手段。\n12、严厉追惩的威胁，逼迫编辑、记者们不得不进行自我审查，这对表达自由的威慑程度，要远大于正式的法律限制。但是，多数人仍然认为，事前限制有时比事后追惩更具钳制力。对一个出版物申请事前禁令，法官一人即可作出决定，但若想对出版者进行刑事追诉，必须由陪审团定罪。况且，出版物出炉前，若想阻止其发行，申请人可以向法官渲染夸大出版后可能导致的严重后果。但是，当事人如果在出版后提起诉讼，\n13、这项自由，不仅属于那些我们所赞同的思想，也包括我们深恶痛绝的思想的自由。\n14、靠更多言论矫正异议，而非强制他人噤声沉默。\n15、禁锢思想、希望和想象会招致更多危险；恐惧会滋生更多压迫；压迫会引发更多仇恨；仇恨必将危及政府的稳定。保障安全的万全之策，在于保证人们能够自由讨论各种困境及解决方案。\n16、自由的最大威胁，是思维僵化、消极冷漠的民众。\n17、自由思考，畅所欲言，是探索和传播政治真理不可或缺的途径。\n18、国家的终极目的，是协助人们自由、全面地发展；在政府内部，民主协商的力量，应超过独裁专断的势力。\n19、言论自由的唯一含义，就是给予这一理念被传播的机会，使它有自己的发展空间。\n20、表达某种意见和狭义上的煽动行为的区别在于，演说者是不是热衷于实现自己所要表述的思想。\n21、任何思想都有煽动性，总想得到他人的认同，\n22、我们应当对某种做法时刻保持警惕，那就是对那些我们深恶痛绝，甚至认为罪该万死的言论的不当遏制。\n23、达至心中至善的最好方式，是不同思想的自由交流。也就是说，如果我们想确定一种思想是否真理，就应让它在思想市场的竞争中接受检验。\n24、只有对可能立即引发现实危险，或者意图如此的行为，国会才能在未涉及个人权利的前提下，对言论自由施加限制。\n25、所有关于言论自由的争议中，最为关键的，是国家是否有权惩治任何具有某种倾向的言论，哪怕这种倾向有多么不明显。在我看来，只有直接煽动违法的言论，才应受到处罚。\n26、我们假设自己永远正确。\n27、设置“煽动诽谤政府罪”，是“全世界封闭社会的共同特征，在这样的社会里，批评政府就是诽谤，并构成严重罪行。如果政府以强力逼迫批评者噤声，政治自由将荡然无存。在我看来，一个社会如果保留煽动诽谤政府罪，这个社会就算不上自由社会”。\n28、这是美国法官首次在判决书中阐释言论自由和出版自由的意义。\n29、“是人民，而不是政府，拥有绝对主权”\n30、“自由检视公众人物和公共事务的权利”\n31、这一时期的美国，政府对舆论的压制，完全受政党利益驱动。1798 年 6 月，参议院将相关法律草案交付审议，在联邦党议员的一致推动下，草案于 7 月 4 日正式通过。联邦党人刻意选择这个日子，旨在强化这部法律的爱国色彩。7 月 10 日，众议院审议通过此法。\n32、任何普遍意见，又或主流观点，却不可能囊括全部真理，只有让各种观点彼此辩驳印证，真理才会越辩越明。\n33、出版许可制（the practice of licensing the press）。\n34、出版自由是自由的重要屏障之一，只有独裁政府，才会压制这一自由。”\n35、这是值得当街起舞的时刻。\n36、依法禁止某种言论并不可怕，可怕的是禁止者不给出明确的认定标准，想查禁什么言论，就随意给某种言论贴上禁止“标签”。\n\n既然看到这里了，感觉应该要放个购买 链接了：批评官员的尺度:《纽约时报》诉警察局长沙利文案\n\n言论的边界: 美国宪法第一修正案简史\n\n第二本《言论的边界》还正在看，也是冲击很大啊。"
		},
		{
			"post_id": 7,
			"title": "几次校园事件最深的感触——生活有双手扼住我的喉咙",
			"date_published": 1524485627.4,
			"body": "李霜氤 发表于2018年4月\n\n这几日，网络上连续曝出了多起发生在校园的不幸事件，在校学生遭到性侵、人格羞辱或精神控制，有的受害者已经在绝望中结束了自己年轻的生命。这些事件，无不令人痛心疾首。随后又有更多知情者和相似事件的受害者相继站出来，这不能不令人感觉到希望。\n\n---\n\n相关事件的讨论群组里充满了同情、悲愤、深刻的话语。\n\n看着大家的讨论和相关的文章，我大致赞同这样的一种思路：硕士、博士导师和学生之间存在着不对等的权力关系，导师在学生的学术、科研、成绩、毕业、就业方面起着关键甚至是决定性的作用。于是，和导师的关系好坏可能会对学生的前途产生重大影响。在这种情况下，部分品行不端导师提出不合理甚至非法要求，学生的接受或者拒绝可能影响到自己的前途。不对等的关系滋生了伤害的温床，使得受害者维权成本增高。因此，应在法律层面进行完善，消除不对的权力关系，营造更加公平的学术环境。\n\n这是个任重道远的伟大目标，只遗憾已经离开人世的受害者无法等到这一天。暂时关闭讨论群组的页面，切换到朋友圈，我看见和往常一样的晒吃喝、晒美拍、晒娃等内容。两幅画面的切换，不同的信息交融在我脑海里，衍生出一种思绪。当然不是批判网友的这些行为，这些也是朋友圈最常见的内容，是一部分人生活的记录。只是我时常感觉有双手扼住我的喉咙，在此刻尤其觉得它真实存在，唯有发这类“温和无害”的内容，才能暂时逃离它。\n\n这无形的可怕的双手，假如要给它取个名字，要不要叫它“正常”？每当我关注一些社会公共事件，每当我想说一些话的时候。它时不时出现，似乎在阻止我发出声音。如果我不遵从，就会被打上“不正常”的标记，失去在生活中的地位。又或者可以叫它“平和”，因为语气激烈一点，就会被打上“极端、偏激”的标签。又或者叫它“正能量”……这手属于谁，从哪里来？\n\n作为在读研究生，除了事件本身带来的沉重，最深刻的感受是我就在这权力体系之中。在我和我周围的同学中间没听说有这类事件，但我知道这仅仅是概率下的幸运。在我决定读研之前，一位学长说过：“考研是要拼运气的，关键是遇上一个好老板（指导师）”。他将导师称作“老板”，部分揭露了关系的本质。\n\n但导师与研究生之间不是纯粹的劳务关系，员工和雇主之间虽然也有不对等的权力关系，但员工与雇主发生矛盾后解除劳动关系另谋职业的成本，低于研究生与导师发生冲突的代价。研究生一旦和导师发生冲突，如果有其他导师愿意接收，可以换一位导师。如果没有，他（她）将面临要么与导师达成和解，要么选择退学，放弃学位证的两难局面。如果他（她）是博士，可能意味着几年时光的浪费，而且无法为就业、发展增加一份保障。对于家境尚可，爱好科研的学生，失去的是宝贵的科研资源；对于家境贫困，经济压力大，需要学位证书为自己的就业前途增加保障的学生呢？在这样的体系内部，和老师发生冲突时，学生最可能的“选择”就是忍耐与和解。这恐怕就是扼住学生发出声音的渠道的那双可怕的手，或者，只是组成它的一部分。最可怕的不是这一系列事情发生之后将要失去什么，而是它会把反抗的可能消解掉。\n\n我忍不住想，当侵害发生后，这双手更是勒紧了受害者的脖子。在我生活的环境，挑战公共权力关系的个体往往被称作“不和谐音符”，仿佛“相安无事，各司其职”才是“正常”。在这种环境下，作为一个受害者，甚至可能对自身的存在产生自我怀疑：为什么我是个受害者，我会不会破坏“正常”的秩序。更别说网络上流行这样一种言论——“受害者有罪论”。“为什么别人不被性侵，就你被性侵，一定是你穿得太暴露了，行为不够自重”、“都怪他自己不会拒绝，被欺负成这样，真怂”。\n\n而此时，当我们站出来帮受害者说话，可能换来的是一句“关你什么事，做好自己的事就够了”。可以推想，假如我们不幸成为下一个受害者，这双手会箍住更多人的嘴巴。那么这双手是来自发表“受害者有罪论”的网友吗？恐怕不是，批判冷漠的态度的文章曾经出现过很多，但是这类言论不绝于网上网下。冷漠更像是一种“自我保护”，试图与受害者“划清界限”，从而规避掉自己内心对被称为受害者的恐惧。而真实的情况是，每个人对自己成为受害者的可能性都充满恐惧。\n\n更别说，很多时候这双手从家人的方向伸过来。一位朋友的家人曾经对她说：“好好学习，不要不务正业，也不要多管闲事。社会上这么多不好的事，你管也管不过来”。但是这双手的根源绝不是家人自身，一个家庭辛苦培养子女读大学，读硕士、博士，可能期待的是他（她）能够获得更广阔的前途以及改善家庭。因此，家人当然不希望子女断送前途。这类情况下，家人也是被这双手扼住喉咙，无法发出声音的人。\n\n这双手来自个人无法违抗的权力结构，即少数人稳坐于权力的上游，对于处于下游的人群层层盘剥，仅仅靠良知无法完全约束权力。而我们觉得无力去反抗，就无形中维护了它，甚至为它的合理性进行辩护。在我们周围，几乎每个人都能感受到它存在，却又无可奈何。我们的力量聚集在一起，是否会发生改变呢？不得不说，作为研究生，我们是幸运的甚至奢侈的，能够有机会获得更多的知识和学术资源，在就业、薪资水平方面有着相对优势等等。但在现有结构下，依然处于权力关系中的不利地位，同样面对着扼住我们喉咙的无形的手，我们需要的是更多地反思是否有可能打破它，以及如何做到。\n\n也许，除了受害者不再沉默，更需要暂时幸免于伤害的人，告诉更多人，有这么一双看不见的可怕的手。"
		},
		{
			"post_id": 6,
			"title": "为什么噤若寒蝉——《不能说的夏天》电影影评",
			"date_published": 1524228224.9,
			"body": "张冉的教育法律课堂 2018-04-06\n\n本影评原为作者提交给北京大学本科生公选课《影像中的教育世界》的个人作业\n\n作为台湾著名导演杨德昌弟子王维明的处女作，《不能说的夏天》（原名《寒蝉效应》）讲述了一个以真实事件改编的校园性侵的故事。电影本身格局较大，隐喻颇多，本文将尝试从高校性侵害和性骚扰的视角对该影片进行分析，理解在教师性侵害和性骚扰中学生受害者所面临的心理、法律和伦理的困境。\n\n* * *\n\n一 、不得不说的真实\n\n23岁的女主角白白从小在母亲的教导下学习音乐，这次她离开台北只身来到台东大学音乐学院求学， 希望追求自由与梦想。像乐团的其他人一样，她很仰慕指导教授李仁昉，欣赏他有才华，有风度，儒雅而幽默。恰好李教授在招学生助理，于是白白投了简历去面试。\n\n然而，关上门之后，在办公室里，在爵士乐中，上一秒还在谈着家人的教授忽然靠近，混杂着白白的震惊和恐惧，教授威胁着嘶吼着侵害了她。几天之后，乐团练习结束后李教授把白白单独留了下来，一开始她害怕得发抖，但教授却十分温柔，于是白白把头渐渐靠向他。\n\n三个月过去了，白白开始出现无意识自残，割腕之后被心理中心的王老师送往医院急救，医生诊断她患的是PTSD（创伤后应激障碍）。王老师请来自己的好友方律师为白白维权，起诉李教授利用职权对白白进行性侵害。\n\n李教授的妻子林律师为其辩护，反而指责白白单恋李教授，破坏其家庭不成转而诬告李教授，白白的学姐利亚和好友小玲都出庭为李教授作证，教授也宣称是白白勾引他。而面对这些不利的指控，白白只能在庭上讲出自己的真实困惑——大家都很喜欢教授，她不知道自己是不是爱上了他。案子陷入僵局，白白却不得不面对校园里同学的讥讽和指责，承受网络世界铺天盖地的谩骂和陌生号码不断发来的问候全家的短信，甚至是自己的母亲也质问她是不是主动勾引教授，于是她再度选择了割腕自杀。\n\n在影片的结尾，李教授因为突发心脏病去世，很多之前被李教授侵害的同学都站出来指控他，这里面包括曾经出庭作证的利亚和小玲，林律师对她们一一进行了赔偿，而白白躺在病床上与母亲相拥入睡。\n\n对于这部影片，不少人诟病结局仓促而缺少力度，却不知这是影片忠实于其原型事件。在真实的事件中，台湾南投县暨南大学公共行政系的副教授李文志涉嫌利用职务之便强制猥亵女研究生，案件一审判刑一年两个月，减刑为七个月，二审改判无罪，被害方继续上诉。然而还没有等到宣判，教授就死于心脏病，当事女生先后自杀了4次，并未走出阴霾。\n\n无独有偶，《不能说的夏天》上映当时就正撞上了厦门大学教授吴春明被曝长期利用职权猥亵诱奸女学生。而那些已经被曝光或是仍然被黑布遮住的真实事件又岂止这两件，噤若寒蝉的人又不知还有多少。影片将真实事件搬上荧幕，被认为是国内第一部关注校园性侵的电影，也许它还未能像《熔炉》一样改变韩国的历史，但真实本身自有万钧之力，它至少让我们不会因为不知道就认为不存在，让我们将目光投向校园，关注作为教育圣地的高校中潜藏的危险，关注那些像白白一样的受害者所面临的困境。\n\n二、 你为什么沉默？\n\n尽管在观影中一直持着尝试理解和包容的态度，我还是不禁向影片中的白白发问：你为什么选择沉默？所有人都在问这个问题，观众不理解白白为什么在长达三个月的时间里一直保持沉默，李教授的妻子林律师在法庭上质问白白为何受到侵害却什么也不说，这个问题的答案白白不知道，因为她直到最后一次庭审前还在一遍遍问方律师：我们为什么要告教授啊？她甚至不确定自己是不是爱上了教授。白白这种听起来有些荒谬的心理困境并不是个例，它在心理学上被称作斯德哥尔摩症候群，是指被害者对加害者产生好感和依赖心。在这里我尝试对影片中白白产生斯德哥尔摩效应的原因进行分析，并从中管窥校园性骚扰和性侵害中受害者的心理困境。\n\n在影片中，白白和其他受到李教授侵害的女学生们沉默的最主要原因，在于她们与教授之间不对等的权力关系所造成的压力。作为指导老师，李教授能够决定学生们的毕业论文是否过关、分数高低；作为乐团的指挥，李教授能够决定学生们能否继续留团，决定是否帮他们写推荐信。正如影片中方律师所说，李教授掌握了每个学生的学业事业的生杀大权，在这样的权力关系和利益结构中，我们如何能够期待那些被害的学生主动吐露心声呢？李教授利用自己的职务便利，营造了这种封闭的共生关系，在第一次对白白实行侵害时他不止一次的直言白白独奏吹得不好、乐团不缺她这么一个人，这样的压力使得本来就涉世未深的白白心生恐惧，掉入了他的陷阱，认为自己无力反抗，因而丧失了向外求助的能力，这种无力感是斯德哥尔摩综合症产生的首要原因。\n\n白白在与教授的关系中越陷越深，甚至认为自己爱上了教授，这种斯德哥尔摩症状的本质其实是一种认知失调，而她产生认知失调的原因是教授的诱奸带来的耻感和罪感。当她被教授强行侵犯后，她冲出办公室，在宿舍的浴室内一遍遍冲洗着满是伤痕的身体，性侵带给她性尊严的伤害使她难以承受，这种无能反抗的耻感使她产生了认知失调。相比于认为衣冠禽兽的教授侵害了自己，不如暗示自己是否内心里爱慕着教授，只有爱才能解释自己为什么不反抗，只有诉诸爱才能使白白免于耻感的折磨。于是，当伤害过白白的教授在音乐教室里将她单独留下来，弯下腰温柔地说：“你不必害怕我。”白白逐渐把头靠向他的怀中。\n\n正如那位将自己的故事写作《房思琪的初恋乐园》但最终选择自杀的台湾作家林奕含所说，“这是一个关于女孩子爱上了诱奸犯的故事。我要爱老师，否则我太痛苦了，因为你爱的人要对你做什么都可以，不是么？”而与教授的这种关系，使得白白在面对教授的家庭和喜欢的男生时又充满了罪感，这种害怕别人知晓的罪感将她更有力地推向了与教授的封闭关系里。方律师在最后一场庭审中说“当自诉人告诉我，她认为自己爱着被告的时候，我不能说什么，不能阻止她在庭上说出实话，我也不能告诉她那是她的幻觉。白白说服自己，他们彼此爱着对方，因为那是她唯一赖以为生的念头。”这就像一场不容辩解的密室谋杀，白白和那些女同学们就像寒蝉一般不敢出声，困在李教授这样的社会精英们设下的感情迷障中，明知牵着她们的是一双污秽的手，却没有退路。\n\n三、 法律和伦理的双重困境\n\n在白白和李教授对质的那一场庭审中，面对林律师一遍又一遍地质问“你是否曾经自愿与李教授发生性行为且不止一次”，白白的回答显得无力“第一次不是”，这就是白白们在利用法律控告教授性侵时所不得不面对的困境。我们常说的诱奸不是一个法律词汇，只是民间对欺骗妇女发生性关系的行为的俗称，更不是一项罪名。在当事人为教授和已经成年的女大学生时这个问题就变得更加复杂了，双方均有正常的判断能力，且牵扯出许多的利益关系，胁迫性的暗示还是交换性的引诱，被迫还是自愿，其间的界限已经十分模糊且难以被局外人确定。所以帮助白白的王老师只是求方律师证明第一次性侵事实的存在，但即使是这一次定罪也有待于证据的搜集能否达到犯罪事实清楚，取证的极大困难依然存在。\n\n比起法律的困境，白白面对的伦理困境也许才是使她二度自杀的最后一根稻草。即使案件尚未判决，在众人的眼中白白已经成为了与已婚男教授发生性关系的“污秽”的存在，这其中当然有一夫一妻制社会中道德的基本要求，但不可否认的是社会对性的禁忌也在其中推波助澜，所以会有同学们异样的眼光，会有“苍蝇不叮无缝的蛋”类似的言论将二次伤害强加给白白这样的受害者。即使维权成功，我们也可以想见，同学们看待白白的眼光依然是异样的。受害者不仅要承受暴力的伤害，还要面对社会大众的异样注视和窃窃私语，更不用说网络世界铺天盖地的极端言论。电影《素媛》中小素媛问爸爸：“我是不是做错了什么？”《不能说的夏天》中白白也问：“我到底做错了什么？”\n\n电影《不能说的夏天》延续了台湾电影一贯的小清新风格，镜头也非常克制，并没有刻意放大性侵过程的痛苦，而是聚焦在白白的心理困境、维权的艰难和社会大众的回应上，也因而较完整地向观众展现了在这类高校性侵事件中学生受害者所面临的困境。讨论至此，也许问题的改善需要诉诸学校规章的健全，国家法律制度的完善，乃至整个社会性观念的进步，好像已非我们力所能及。方律师在最后一次庭审中有一段精彩的台词：“但只要相信，我们就能做出改变，改变不会容易，真相让人痛苦，但我们不能因此袖手旁观，保持缄默。庭上，您的判决将唤醒那些装睡的人。”\n\n电影中刚到学校的白白抱怨台东的蝉声太大，在进入秋天之后所有的人都噤若寒蝉，直到片尾聒噪的蝉声才再度响起。借用林奕含在《房思琪的初恋乐园》中所写“当你在阅读中遇到痛苦或不舒服，我希望你不要认为‘幸好是一本小说’而放下它，我希望你能与思琪同情共感”，对《不能说的夏天》，我们也不要认为“幸好是一部电影”，不要无视白白、房思琪、林奕含们的存在，不要做装睡的人。\n\n文献参考：\n\n1\\. 宋伟峰.从厦大博导“诱奸门”谈学生权益保护问题[J].江苏警官学院学报.2014(6).\n\n2\\. 黄河.社会性别视野下校园性骚扰的迷思与反思[J].中国青年研究.2010(10).\n\n3\\. 噤若寒蝉的夏天——《不能说的夏天》精神分析初探[J].戏剧之家.2015(7)."
		},
		{
			"post_id": 5,
			"title": "（转）捷克摇滚乐队宇宙塑胶人的歌《百分之百》",
			"date_published": 1523780821.2,
			"body": "1970年因受查禁而转入地下的捷克摇滚乐队宇宙塑胶人（The Plastic People of the Universe）的这首歌中写到：他们害怕老人的记忆，他们害怕年少者的天真，他们害怕坟墓和墓上的鲜花，他们害怕……那么我们到底为什么要怕他们？\n\n---\n\nThey're afraid of the old for their memory.\n他们害怕老人的记忆。\nThey're afraid of the young for their ideas - ideals.\n他们害怕年轻人的思想和理想。\nThey're afraid of funerals - of flowers - of workers - of churches - of party members - of good times.\n他们害怕葬礼，害怕墓上的鲜花，害怕工人，害怕教堂，害怕党员，害怕所有的快乐时光。\n\nThey're afraid of art - they're afraid of art.\n他们害怕艺术，他们害怕艺术。\nThey're afraid of language - communication.\n他们害怕语言这沟通的桥梁。\nThey're afraid of theater.\n他们害怕剧院。\nThey're afraid of film - of Pasolini - of God/dard - of painters - of musicians - of stones and sculptors.\n他们害怕电影，害怕帕索里尼，害怕戈达尔，害怕画家，害怕音乐家，害怕石块和雕塑家。\n\nThey're afraid.\n他们害怕。\nThey're afraid of radio stations.\n他们害怕电台。\nThey're afraid of technology, free float form of information.\n他们害怕技术，害怕信息自由流动。\nParis Match - Telex - Guttenburg - Xerox - IBM - wave lengths.\n害怕《巴黎竞赛画报》，害怕电传，害怕古登堡，害怕施乐，害怕 IBM，害怕所有的波长。\nThey're afraid of telephones.\n他们害怕电话。\n\nThey're afraid.\n他们害怕。\nThey're afraid to let the people in.\n他们害怕让人民进来。\nThey're afraid to let the people out.\n他们害怕让人民出去。\nThey're afraid of the left.\n他们害怕左派。\nThey're afraid of the right.\n他们害怕右派。\nThey're afraid of the sudden departure of Soviet troops - of change in Moscow - of facing the strange - of spies - of counterspies.\n他们害怕苏联军队突然离去，害怕莫斯科的变化，害怕面对陌生人，害怕间谍，害怕反间谍。\n\nThey're afraid.\n他们害怕。\nThey're afraid of their own police.\n他们害怕自己的警察。\nThey're afraid of guitar players.\n他们害怕吉他手。\nThey're afraid of athletes - of Olympics - of the Olympic spirit - of saints - of the innocence of children.\n他们害怕运动员，害怕奥运会，害怕奥林匹克精神，害怕圣人，害怕儿童的天真。\n\nThey're afraid.\n他们害怕。\nThey're afraid of political prisoners.\n他们害怕政治犯。\nThey're afraid of prisoners families - of conscience - of science.\n他们害怕犯人的家属，害怕良知，害怕科学。\nThey're afraid of the future.\n他们害怕未来。\nThey're afraid of tomorrow's morning.\n他们害怕明天的早上。\nThey're afraid of tomorrow's evening.\n他们害怕明天的晚上。\nThey're afraid of tomorrow.\n他们害怕明天。\nThey're afraid of the future.\n他们害怕未来。\nThey're afraid of stratocasters - of telecasters.\n他们害怕电吉他，害怕电吉他。\nThey're afraid of rock 'n' roll.\n他们害怕摇滚乐。\n\nWhat does he mean, even rock bands?  Even rock bands?\n他怎么回事？连摇滚乐队都怕？连摇滚乐队都怕？\nRock bands more than anybody else suffer from political repression.\n摇滚乐队比别人更遭受政治镇压。\n\nThey're afraid.\n他们害怕。\nThey're afraid of rock 'n' roll - of telecasters - of stratocasters - of old age - in the streets - behind the locked doors.\n他们害怕摇滚乐，害怕电吉他，害怕电吉他，害怕走在街上的和锁好的门后的老人。\nThey're afraid of what they've written - of what they've said - of fire - of water - of wind - of slow - of snow - of love - excretion.\n他们害怕人们写的东西，害怕人们说的话，害怕火，害怕水，害怕风，害怕雪花纷扬，害怕爱，害怕排泄。\nThey're afraid of noise - of peace - of silence - of grief - of joy - of language - of laughter - of pornography - of honest and upright - they're uptight.\n他们害怕噪音，害怕和平，害怕沉默，害怕悲伤，害怕欢乐，害怕语言，害怕笑，害怕色情，害怕诚实和正直，他们紧张了。\n\nThey're afraid of lone and learn and learned people.\n他们害怕孤独，害怕学习，害怕有学识的人。\nThey're afraid of human rights and Karl Marx and raw power.\n他们害怕人权，害怕卡尔·马克思，害怕原生力量。\nThey're afraid of socialism.\n他们害怕社会主义。\nThey're afraid of rock 'n' roll.\n他们害怕摇滚乐。\nThey're afraid of rock 'n' roll.\n他们害怕摇滚乐。\nThey're afraid of rock 'n' roll.\n他们害怕摇滚乐。\nThey're afraid of rock 'n' roll.\n他们害怕摇滚乐。\n\nAND WHY THE HELL ARE WE AFRAID OF THEM?\n那么，我们究竟为什么要怕他们？"
		},
		{
			"post_id": 4,
			"title": "民主制度的基本原则（三）",
			"date_published": 1523685173.4,
			"body": "美国国务院介绍民主制度的基本原则之三(官方版)\n\n这里刊载的是美国国务院国际信息局(IIP)编写的介绍民主制度基本原则的一个新的短文集。文集共含12篇文章。每篇文章有英文、中文、阿拉伯文、法文、波斯文、葡萄牙文和俄文版本。\n\n---\n\n九、人权\n\n所有人都享有与生俱来的权利。这些权利使人具有追求人生尊严的能力──因此这些权利不是任何政府的恩赐，而是应受到所有政府的保护。建立在公正、容忍、尊严和尊重基础之上的自由──不分民族、宗教、政治从属或社会地位──使人们能够追求这些基本权利。专制统治剥夺人权，而自由社会不断争取人权。\n\n人的权利相互依存，不可分割；它们存在于社会、政治和经济等人生各个方面。其中最为人们普遍接受的是：\n\n所有人应该有形成自己观点的权利以及独自地或在和平集会中表达这些观点的权利。自由社会创造“思想的自由市场”，使人们能够就各种问题交换意见。\n\n所有人应该有参与政府的权利。政府应制定保护人权的法律，司法系统则应使这些法律对所有人平等有效。\n\n免遭任意逮捕、关押和酷刑是一项基本的人权──即便对执政党的反对派、少数族裔、甚至哪怕是刑事罪犯亦是如此。专业警察队伍在执行国家法律的过程中尊重所有公民。\n\n在多元民族的国家，宗教少数派和少数族裔应能自由使用自己的语言和维护自己的传统，不必担心受到多数派的责难。政府应该在尊重多数人意愿的同时，承认少数派的权利。\n\n所有人应该有机会工作、谋生和赡养家庭。\n\n儿童应该受到特别保护。他们应至少受到小学教育，得到应有的营养和保健。\n\n为维护人权，任何自由社会的公民都需保持警惕。公民的责任──通过参与各种活动──将确保政府始终对人民负责。自由国家同盟决心为保护人权而努力，并且将这一决心以多项人权国际条约和公约的形式确定下来。\n\n十、行政权\n\n民主政府的领导人经本国公民同意而执政。这些领导人的巨大权力不是来自对千军万马或经济财富的控制，而是来自对参加自由、公正选举的选民为他们所设立的种种限制的尊重。\n\n通过自由选举，民主制度下的公民赋予他们的领导人法律所规定的权力。宪政民主制度实行分权制──立法机构制定法律，行政机构贯彻执行法律，司法机构独立运作。\n\n民主政府的领导人既不是民选独裁，也不是“终身总统”。他们有固定任期并接受自由选举的结果，即使这意味着失去政权。\n\n在宪政民主制度下，行政权通常受到三种限制：将国家政府的行政权、立法权和司法权分立的分权制衡制度；在联邦政府同州/地方政府之间实行权力分工的联邦制；以及宪法规定的基本权利。\n\n国家政府的行政机构受到宪法赋予立法机构的权威及独立的司法体制的限制。\n\n在现代民主制度下，行政权力一般有两种组织形式：议会制或总统制。\n\n° 在议会制下，立法机构中的多数党组建政府，以总理为首。\n\n° 在议会制下，由于总理及内阁成员都是从议会中产生，因此立法机构和行政机构不是截然分开。在这种制度下，政治反对派是限制或制约行政机构的主要手段。\n\n° 在总统制下，总统是通过与议员选举分别进行的选举产生。\n\n° 在总统制下，总统和立法机构有各自的权力基础和政治阵营，从而起到相互制衡的作用。\n\n民主制度只对政府施加限制，而不将其架空。因此，在民主体制下，就全国性问题达成共识的过程可能缓慢；但一旦达成共识，政府领导人能够享有采取行动的巨大权威和信心。\n\n宪政民主制度下的政府领导人自始至终都在由法律确定和限制的权力范围内依法行事。\n\n十一、立法权\n\n在民主制度下，民选代表──无论是议会、立法会议还是国会成员──的职责是为民服务。他们对民主政体的健康运作具有数项关键作用。\n\n经选举产生的立法机构是民主代表制中商议、辩论及批准法律事宜的主要场所。他们不是应声附和专制领导人的决定的“橡皮图章”。\n\n监督和调查权使立法代表能公开质疑政府官员的行动和决定，并且起到限制政府各部门权力的作用──在立法权与行政权分离的总统制政体中尤其是这样。\n\n立法代表有权批准国家预算、就急待解决的问题举行听证、确认行政当局对法院及各部的人事任命。在一些民主政体中，立法委员会是供立法代表就全国性问题进行公开审议的论坛。\n\n立法代表可以支持当权政府，也可以成为真实的政治反对派，提出与执政党的主张不同的政策和项目。\n\n立法代表有责任以尽可能有力的方式阐明他们的观点。但他们必须遵守容忍、尊重以及为达成共识而妥协等民主道德规范，使最后结果有利于全体人民的整体福祉，而不仅是他们的政治支持者的利益。每位立法代表必须自行决定如何兼顾全民福祉和地方选民的需求。\n\n立法代表常常举行体恤民情的听证，倾听选民的申诉和他们提出的问题，并协助他们从庞大的政府机构中获得帮助。立法代表为此通常拥有一个训练有素的工作班子。\n\n选举全国立法代表的方式通常有两种。在采用简单多数制的选举中，又称“第一过杆制”(“first past the post”)，得票最多的候选人当选。而在议会选举通常采用的比例代表制选举中，选民往往投票给政党而不是个人，代表是根据各党派的得票率选出。\n\n比例代表制有利于组织严密、规模较小的多个政党。简单多数制则有利于较为松散的两党制。但两种制度下的立法代表都采取辩论、谈判、结盟和妥协等做法，这些是民主立法机构的标志。\n\n立法机构通常实行两院制，新的立法一般必须得到上、下两院批准。\n\n十二、司法独立\n\n独立的、职业化的法官是使法庭系统──即司法体制──做到公平、公正和有宪法保障的基础。这种独立性不意味着法官可以根据个人主张做决定，而是表明，他们可以自由地依法裁决──即使他们的裁决违背政府或涉案的权势集团的意愿。\n\n在民主体制下，法官不受来自民选官员和议员的政治压力，从而使他们的公正性得到保障。司法裁决应该公正，以事实真相、法律依据、司法论证以及有关法律为基础，不受任何限制或有关方面的不正当影响。这些原则确保所有人都得到同等的法律保护。\n\n法官有权审核公法并宣布某项公法违反国家宪法。这是防止政府──即便是由多数民众选出的政府──滥用权力的一项重要机制。但这项权力要求法庭必须独立，并具备依照法律而不是政治因素做出裁决的能力。\n\n法官无论经选举还是通过任命产生，都必须享有法律保护的职位稳定或享有终身制，以使他们在做出裁决时不必担心可能受到当权者的压力或攻击。公民社会认识到职业法官的重要性，因此为他们提供充份的培训和薪金。\n\n法庭系统的权威及合法性主要来源于人们对其公正性的信赖，即它被看作是一个“不带政治色彩的”政府分支。\n\n但国家法庭同其他机构一样，不可避免公众的评论、监督和批评。所有人都享有言论自由，包括法官及对法官持批评态度的人。\n\n为确保法官秉公执法，司法系统的职业道德要求他们退出(或称回避)审理同他们有利益冲突的案件。\n\n在民主制度下，不能因法官受到无足轻重的或受到政治批评而将其解职。只有在他们有严重罪行或违规行为时，才能通过由立法机构或特别法庭进行的冗长复杂的弹劾(提出指控)和审判程序将其解职。\n\n独立的司法系统使人民相信，法庭的决定是基于国家法律和宪法，而不受制于政治风云的变幻或一时的多数派压力。这种独立性使民主制度下的司法体制成为对人民权利与自由的保障。"
		},
		{
			"post_id": 3,
			"title": "民主制度的基本原则(二)",
			"date_published": 1523277598.5,
			"body": "美国国务院介绍民主制度的基本原则之二(官方版)\n\n这里刊载的是美国国务院国际信息局(IIP)编写的介绍民主制度基本原则的一个新的短文集。文集共含12篇文章。每篇文章有英文、中文、阿拉伯文、法文、波斯文、葡萄牙文和俄文版本。\n\n---\n\n五、公民责任\n\n民主政府不同于专制政权，它存在的目的是为人民服务；但民主国家的公民也必须同意遵守管理公民的规则和义务。民主国家给予公民许多自由，包括对政府表示异议或批评政府的自由。\n\n作一个民主国家的公民需要参与、讲道理和有耐心。\n\n民主国家的公民知道他们不但有权利，而且有责任。他们认识到民主需要投入时间和艰苦努力──人民的政府要求人民的时刻关注和支持。\n\n在有些民主国家，公民参与意味着需要公民担任陪审员，或在一段时间内服义务兵役或从事国民义务服务。在所有民主国家都实行并且完全属于公民职责的其他义务中，尊重法律是最首要的义务。缴纳自己应承担的税务，接受经选举产生的政府的领导，尊重持不同观点的人的权利等，也都属于公民应尽的职责。\n\n民主国家的公民知道，他们如果要受益于社会对自己权利的保护， 就必须为社会承担责任。\n\n在自由社会里有一种说法：你是什么样，你的政府就是什么样。要使民主获得成功，公民必须积极主动而不是消极被动，因为他们知道，政府的成败取决于自己，责无旁贷。同样，政府官员懂得，所有公民应该得到平等对待，而且，民主政府不容贿赂。\n\n在民主制度下，不满意他们领导人的民众可以组织起来，和平地要求改变，或者在定期的选举中，通过投票使那些领导人下台。\n\n民主制度要保持健康运转，单靠偶而的公民投票是不够的。它需要大批公民的经常关心、付出时间和承担义务。反过来，公民依靠政府保护他们的权利和自由。\n\n民主国家的公民参加政党，为他们属意的候选人助选。他们接受自己的政党不可能永远掌权的事实。\n\n° 他们可以竞选公职或被任命担任一段时期的官职。\n\n° 他们运用新闻自由发表自己对地方和全国性问题的看法。\n\n° 他们加入工会、社团和商业协会。\n\n° 他们加入有共同兴趣爱好的私人志愿组织──无论是涉及宗教、民族文化、学术研究、体育、艺术、文学、住区发展、国际学生交流，还是成百上千其他不同的活动。\n\n° 所有这些团体──无论与政府多么相关或多么无关──都在为其民主体制的繁荣健康做出贡献。\n\n六、新闻自由\n\n在民主国家，新闻媒体的运作应该不受政府控制。民主政府内没有规范报纸内容或管理新闻工作者活动的部门；没有要求记者接受国家审查的规定；也不强迫记者加入政府控制的工会。\n\n自由的媒体向公众提供信息，向领导人提出问责，并成为辩论地方和国家问题的论坛。\n\n民主国家培育自由媒体。独立的司法、实行法治的公民社会以及言论自由都有利于维护新闻自由。新闻自由必须得到法律保护。\n\n在民主国家，政府对自身行为负责。因此，公民期待了解政府为民决策的情况。新闻媒体作为监督政府的工具，推动运用这一“知情权”，帮助公民向政府问责，对政府的政策提出质疑。民主政府使记者能够出席政府会议和获得公文，并且不对他们报导或出版的内容作预先限制。\n\n新闻媒体本身的行动必须是负责任的。通过行业协会、独立的新闻理事会以及专门负责公众的内部“调查官”，新闻媒体对有关其过度行为的种种申诉作出回应，并追究内部责任。\n\n民主制度要求公众做出选择和决定。为使新闻媒体具有公信度，新闻工作者必须提供基于可靠来源和信息的如实报导。剽窃和失真报导有损于自由的媒体。\n\n新闻机构应建立不受政府控制的自身的编辑部，把采集和传播新闻与评论区别开来。\n\n新闻工作者不应受舆论左右，而是以追求真实为已任，尽力接近事实真相。民主国家使新闻媒体能够在既没有对政府的畏惧，也不受政府偏袒的情况下，从事信息采集和报导。\n\n民主体制造成两种权利之间的永恒较量：政府保护国家安全的责任与人民的知情权，后者取决于新闻工作者获取信息的能力。政府有时需要对那些被认为过于敏感而不宜公布于众的信息实行限制。但是，在民主体制下，新闻工作者有充份权利追踪这些信息。\n\n七、联邦制\n\n当有着不同的语言、宗教信仰或文化规范的不同族群的自由人民愿意在一个公认的宪法体制下共同生活时，他们期待享有某种程度的地方自治和平等的经济和社会发展机会。在地方、地区和国家分权的联邦政府制中，当选官员负责制定和执行针对地方和地区需要的政策。地方和地区政府与国家政府合作，并也相互合作，共同解决国家面临的许多问题。\n\n联邦制是经自由选举产生的、由负责管理同一人口群和同一地区的两个或两个以上政府分担权力和决策的体制。联邦制不仅使高层政府有决策权，而且也使受决策直接影响的地方社区有决策权，并且保护这一权力。\n\n联邦制允许地方政府制定和执行法律，从而促使政府对人民负责并鼓励公民的参与和履行公民职责。\n\n联邦制通过成文宪法规定出各级政府的权力和责任分工而得到巩固。\n\n一般认为地方政府应为地方服务，而有些事务则最适于由国家政府处理。这方面常被提到的例子是国防、国际条约、联邦预算及邮政服务等。\n\n地方法令反映地方社区的意愿：警察和消防巡逻、学校管理、地方保健和建筑规章往往由地方设置和管理。\n\n政府间关系意味着，在一些具有法定必要性的问题需要通过合作解决时，联邦国家的各级政府(国家、地区和地方)将共同努力。国家政府往往有权调解地区间的争端。\n\n在地域辽阔和经济多样化的国家，各个地区在收入和社会福利上的差距可以通过国家政府的税收再分配政策得到调整。\n\n联邦制反应灵敏，包容力强。公民可以自由竞选各级政府职务──地方和地区政府给人们提供了在自己社区发挥影响力的最多职位，或许也是最大的机会。\n\n联邦制为各政党提供为其选民服务的多种机会。即使某一政党在国家立法机构或行政机构内不占多数，它仍可以参加地区和地方一级的立法和行政。\n\n八、法治\n\n在人类历史上很多时候，统治者和法律是同义词──法律就是统治者的意志。摆脱这种专制的第一步是法制(rule by law)，其中包括统治者也受制于法律并应依法施政的观念。而民主体制则更向前推进一步，建立起法治(rule of law)。虽然没有任何社会或政府体制能够完美无缺，但法治保护根本的政治、社会和经济权利，并且提醒人们，他们并非只能在专制和无法这两种体制中做选择。\n\n法治意味着任何人，无论是总统还是普通公民，都不能高于法律。民主政府通过法律手段施政，其自身也受法律约束。\n\n法律应表达人民的意愿，而不是君王、独裁者、军事首领、宗教领袖或自封执政党的意念。\n\n民主制度下的公民因此而愿意遵守社会法律，因为他们是在服从自己制定的规则。只有在人民制定自己必须遵守的法律时，司法才会最好地得到贯彻。\n\n在法治社会，强大、独立的法庭制度应该有权力、权威、手段和威望使政府官员，甚至高层领导人，奉公守法。\n\n为此，法官应该训练有素、职业化、具有独立性、公正不倚。法官必须信守民主原则才能担当起在法律和政治制度中所必需的角色。\n\n民主国家的法律可能有很多来源依据：成文宪法、法令规章、宗教伦理、文化传统习俗。无论源于何处，法律都应包含保护公民权利和自由的条文：\n\n° 法律面前人人平等，法律不能只被用于某一个人或某一群体。\n\n° 公民必须受到保护，不能被任意逮捕，被无理搜家或被没收个人财产。\n\n° 受到犯罪指控的公民有权得到及时和公开的审理，并有机会与起诉人对质和向他们提问。如果被判有罪，他们不得受到酷刑或非常惩罚。\n\n° 公民不得被迫提供不利于自己的证词。这项原则保护公民不遭受胁迫、虐待或酷刑，并大大减少警方诉诸这些手段的倾向。"
		},
		{
			"post_id": 2,
			"title": "民主制度的基本原则",
			"date_published": 1522899009.664,
			"body": "美国国务院介绍民主制度的基本原则之一(官方版)\n\n这里刊载的是美国国务院国际信息局(IIP)编写的介绍民主制度基本原则的一个新的短文集。文集共含12篇文章。每篇文章有英文、中文、阿拉伯文、法文、波斯文、葡萄牙文和俄文版本。\n\n---\n\n虽然“民主”一词今天已经传遍世界，但要解释它的确切含义并不容易。短文集的第一篇文章概述了民主的概念，其后各篇文章则按照民主治国的具体要素划分专题，逐一做出解释。每篇短文既反映了主流理论家的见解，也代表着在民主政体下欣欣向荣的许多自由社会的普遍做法。\n\n一、何谓民主?\n\n民主一词源于希腊字“demos”，意为人民。在民主体制下，人民拥有超越立法者和政府的最高主权。\n\n尽管世界各民主政体间存在细微差异，但民主政府有着区别于其他政府形式的特定原则和运作方式。\n\n民主是由全体公民──直接或通过他们自由选出的代表──行使权力和公民责任的政府。\n\n民主是保护人类自由的一系列原则和行为方式；它是自由的体制化表现。\n\n民主是以多数决定、同时尊重个人与少数人的权利为原则。所有民主国家都在尊重多数人意愿的同时，极力保护个人与少数群体的基本权利。\n\n民主国家注意不使中央政府具有至高无上的权力，政府权力分散到地区和地方，并且理解，地方政府必须最大程度地对人民敞开和对他们的要求做出反应。\n\n民主政府知道其首要职能是保护言论和宗教自由等基本人权，保护法律面前人人平等的权利，保护人们组织和充份参与社会政治、经济和文化生活的机会。\n\n民主国家定期举行全体公民参与的自由和公正的选举。民主国家的选举不会成为独裁者或单一政党的门面装饰，而是争取人民支持的真正角逐。\n\n民主使政府遵循法治，确保全体公民获得平等的法律保护，其权利受到司法体制的保护。\n\n民主体制多种多样，反映着每个国家各自的政治、社会和文化生活特点。决定民主体制的是其基本原则，而不是某种特定形式。\n\n在民主国家，公民不仅享有权利，而且负有参与政治体制的责任，而他们的权利和自由也正是通过这一体制得到保护。\n\n民主社会奉行容忍、合作和妥协的价值观念。民主国家认识到，达成共识需要妥协，而且时常无法达成共识。用圣雄甘地(Mahatma Gandhi)的话说：“不宽容本身就是一种暴力，是妨碍真正民主精神发展的障碍。”\n\n二、多数决定和少数权利\n\n从表面看，多数决定与保护个人和少数派权利的原则似乎相互矛盾。但实际上，它们是一对支撑我们所说的民主政体的基础支柱。\n\n多数决定的原则是组织政府和决定公共事务的一种方式，不是导致压制的另一途径。正如没有任何一个自我任命的群体有权压迫其他人一样，多数派，即便是在民主制度下，也不应剥夺少数群体或个人的基本权利和自由。\n\n少数派──无论是以族裔背景、宗教信仰、地理位置或收入水平而论，还是仅因在选举或政治论坛上失利而致──都享有基本人权的保障，这些权利不得被任何政府或任何多数派剥夺，无论它们由选举产生与否。\n\n少数派要相信政府会保护他们的权利和特徵。一旦有了这种信任，这些群体就能够参与本国的民主机制运作，并为之贡献力量。\n\n任何民主政府都必须保护的基本人权包括：言论和表达自由、宗教和信仰自由、合法程序及平等的法律保护，以及组织起来、公开讲话、表达歧见和全面参与社会公共生活的自由。\n\n民主政府认识到，其首要任务之一是保护少数族裔维护文化特徵、社会习俗、个人良知和宗教活动的权利。\n\n民主政府可能面临的最大挑战之一，是接受那些即使不被多数派视为怪异，也令他们感到陌生的族裔和文化群体。但民主政府认识到，多样化可以变成巨大的财富。民主国家视这些特徵、文化和价值观上的差异为一种可以促使自己变得更强大、更充实的挑战；而不是一种威胁。\n\n对如何解决少数派观点和价值观带来的分歧没有单一的答案，可以肯定的只有一点，即只有通过容忍、对话和愿意妥协的民主进程，自由社会才能达成共识，实践多数决定和少数权利这一双重原则。\n\n三、文官政府与军方的关系\n\n事关战争与和平的问题对任何国家都是极其严峻的，在危机时刻，很多国家转向军方领导。但民主国家不是这样。\n\n在民主国家，和平与战争或其他威胁到国家安全的问题是社会面临的最重要问题，必须由人民通过他们选出的代表来决定。民主国家的军队服务于国家，而不是领导国家。军方领导充当民选领导人的顾问并执行他们的决定。只有那些由人民选出的领导人有权也有责任决定国家的命运。\n\n因此，文官统率军队和文权高于军权的理念是民主的根本。\n\n需要由文官指挥国家军队和负责国防决策并不是因为他们一定比职业军人英明，而是因为他们是人民的代表；作为人民的代表，他们有责任进行这些决策并为之承担责任。\n\n民主国家的军队是为保卫国家和人民自由而存在。它不代表或支持任何一种政治观点或任何一个族群和社会团体。它忠实于国家的更宏观的理念，忠实于法治和民主原则本身。\n\n文官统率军队得以确保国家的价值体系、各项建制和政策是出自人民的自由选择，而不是军方的意志。军队的宗旨是保卫社会，不是塑造社会。\n\n任何民主政府在进行国家安全与防卫的决策时，都重视职业军人的专业知识和建议。文职官员在这些事务中依靠军方的行家意见，并依靠军队执行政府的决定。但最终决策只能由民选文职领导人做出，随后由军方在其职责范围内予以实施。\n\n当然，军界人士可以像其他公民一样，充份而平等地参与国家的政治生活──但只能作为选民，以个人身份参与。军人必须在退役后才可从政；军队必须始终同政治分开。军队是国家的中立仆人，是社会的保护者。\n\n归根结底，文官统率军队能够确保不因国防和国家安全事务而损失基本的民主价值──多数决定、少数权利，以及言论自由、宗教自由和正当法律程序等。所有政治领导人都有责任实施文官统率军队，并使军队履行其服从文职政府合法命令的职责。\n\n四、政党\n\n为保持和捍卫个人权利和自由，民主制度下的人民必须共同缔造自己的政府。政党是进行这种努力的主要途径。\n\n政党是联系人民与政府的自愿组织。政党推选候选人竞选公职，为使他们当选而展开助选活动，并动员民众参与选举政府领导人。\n\n多数党(或在选举中获胜当政的党)力争通过立法确立一系列的政策和规划。各反对党能自由地批评多数党的政策观点并提出他们自己的方案。\n\n政党为公民提供了一条就当选政党官员的施政表现向他们问责的途径。\n\n民主政党坚信民主原则，因此即便本党领导人没有掌权，这些政党也承认并尊重民选政府的权威。\n\n与任何民主体制一样，各政党成员的组成也反映了这些党发展的不同环境。有些政党规模小，以一套政治信仰为核心。另一些政党是基于相同的经济利益或背景而组织起来。还有一些政党则是由不同公民组成的松散联盟，可能只有在选举期间才汇集在一起。\n\n所有民主政党，不论是小党还是全国性大党，都以妥协和容忍为原则。他们知道，只有通过与其他政党和组织的广泛结盟与合作，才能形成赢得全国人民支持的领导力量和共同目标。\n\n民主党派认识到政治观点是动态的、可以改变的，共识往往能从和平、自由、公开的观念和价值观的交锋中产生。\n\n忠实的反对派(loyal opposition)是所有民主体制中的一个重要概念。它的含义是，政治辩论中的所有各方──不论他们的分歧多深──都崇尚言论和信仰自由以及平等的法律保护等基本民主价值观。在竞选中失利的政党进入反对党的角色──坚信这个政治制度将继续保护他们的组织和言论自由。在一段时间后，反对党有机会为宣传他们的理念和争取人民的选票而再次竞选。\n\n在民主体制中，各政党之间的斗争不是求生存的搏斗；而是为民服务的竞争。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1522268420,
			"body": "My zeronet blog has been successfully created!"
		}
	],
	"tag": [
		{
			"value": "birth",
			"post_id": 1
		},
		{
			"value": "民主制度，美国国务院",
			"post_id": 2
		},
		{
			"value": "民主制度，基本原则，美国国务院",
			"post_id": 3
		},
		{
			"value": "民主制度，基本原则，美国国务院",
			"post_id": 4
		},
		{
			"value": "他们害怕",
			"post_id": 5
		},
		{
			"value": "校园性侵，不能说的夏天，影评",
			"post_id": 6
		},
		{
			"value": "生活感悟，校园事件",
			"post_id": 7
		},
		{
			"value": "书摘，言论自由，批评官员的尺度",
			"post_id": 8
		},
		{
			"value": "严正学画展，自由与抗争",
			"post_id": 9
		},
		{
			"value": "许章润，时评",
			"post_id": 10
		},
		{
			"value": "宣言，自由与公民权利",
			"post_id": 13
		}
	]
}