{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Можно ли убрать сайты из списка CONNECTED SITES?",
			"body": "При посещении какого-либо сайта, он автоматически попадает в список CONNECTED SITES. Хотелось бы некоторые сайты убрать из этого списка. Это реально?",
			"added": 1464446154
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_12TrG3aMsHiPAsfJ65vg4TKUnCpFpHMF1b": [
			{
				"comment_id": 1,
				"body": "> [zerro](#comment_36_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Там в контекстном меню есть пункт Delete\n\nДа, есть, но после удаления получаем сообщение: This function is disabled on this proxy\n\nСайт пропадает из списка, но после обновления страницы — опять на месте.",
				"added": 1464449367
			},
			{
				"comment_id": 2,
				"body": "> [zerro](#comment_37_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Потому-что ты используешь прокси. Тебе дают возможность пользоваться, а не администрировать ноду.\n\nМ... у меня локально запущен ZeroBundle под OS X.",
				"added": 1464449512
			},
			{
				"comment_id": 3,
				"body": "> [zerro](#comment_38_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Тогда не знаю, не сталкивался с таким.\n\nПогуглил — сообщение такое есть только в плагине MultiUser, похоже, что связано с ним.",
				"added": 1464449655
			},
			{
				"comment_id": 4,
				"body": "> [zerro](#comment_38_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Тогда не знаю, не сталкивался с таким.\n\nПросто проблема усугубляется ещё тем, что отключить то данный плагин я могу без проблем, но к сожалению зарегистрировал ZeroID нормальный на другом компьютере, теперь хз как перенести его сюда. Делать это получается только с плагином MultiUser и вводя там masterseed.",
				"added": 1464449762
			},
			{
				"comment_id": 5,
				"body": "> [zerro](#comment_39_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Значит так же как и с публичными гейтами. Может там где есть настройки разрешений?\n\nВроде бы нету… не попадалось на глаза, хотя перерыл уже всё.",
				"added": 1464449801
			},
			{
				"comment_id": 6,
				"body": "> [zerro](#comment_40_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Просто перенести id и ключи можно заменив файл ./data/users.json. только забекапь текущий, если хочешь сохранить и этот профиль.\n\nСпасибо, попробую.",
				"added": 1464449954
			}
		]
	},
	"comment_vote": {}
}