{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1
	},
	"next_comment_id": 34,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+",
				"added": 1481553528
			}
		],
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 2,
				"body": "Первое впечатление от пролистывания по-диагонали: наркоманский дизайн сайта, странная терминология, отсутствие внятной идеологии (помимо очевидного нацизма — просто всё в кучу).\nМожешь тезисно рассказать хотя бы самый минимум?\n1. Откуда вылез термин \"Копная русь\"\n2. Конкретная экономическая программа.\n3. Методы",
				"added": 1481555518
			},
			{
				"comment_id": 3,
				"body": "Народовластие — не идеология, а метод управления. \"Экономическая программа\"  (это оно ведь оно по ссылке вторым пунктом?) - какая-то бредовая калька со средневековых исламских государств. Подтверждения существования \"Копной Руси\" не видел нигде. Короче, полная ерунда.\nЗа сим прекращаю кормить тролля — автор либо слишком жирен, либо безумен.",
				"added": 1481718891
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 4,
				"body": "> [shift](#comment_321_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Имхо стоит выбрать хоть кого-то кроме текущего, тк любая смена - это хорошо, а если и победит нынешний, но если навальный наберет значительный % голосов это позволит выторговать по больше профитов для народа у власти показав что не всё так хорошо с 146%\n\nВыбирать \"хоть кого-то\" не имеет никакого смысла, так как \"хоть кто-то\" не изменит саму систему, он просто заменит часть мудаков у кормушки, и, с некоторой долей вероятности, снизит им паёк,  в результате чего плебсу будет перепадать чуточку больше.\nНадо выдвигать не тупо кандидата в президенты — тем более такоего невразумительного — а подготовить полный набор: идеология, партия с массой сторонников и _внятной_ программой, и, главное, разработанный метод ротации и подготовки элит.  У кого-то это есть? Так называемая оппозиция, в лице в том числе и Навального, показала, IMHOm свою марионеточную прокремлёвскую сущность уже в том, что так и не сумела объединиться даже на думских выборах, на президентских же тем более не стоит ждать единого кандидата — будет стопицот блёклых вырожденцев с невнятными и неразличающимися программами..\nЯ это не к тому, что \"расслабьтесь и получайте удовольствие\", я это к тому, что не надо торопиться и реагировать на псевдооппозиционеров. Взращивайте идеологию, разрабатиывайте программу, и копите сторонников, развивайте себя , если действительно собрались что-то менять.",
				"added": 1482222762
			},
			{
				"comment_id": 7,
				"body": "Если все порвут бюллетени¸ что нереально, но допустим, что больше половины населения, с чего-то вдруг... Будут учтены только результаты подделок и каруселей. И? Что изменится-то?  Пассивный протест не сработает, это отмазка трусов и лентяев. Голосование на Навального — один из вариантов бессмысленного пассивного протеста, так как с гарантией 146% закончится ничем, ибо нет объединённого оппозиционного фронта (и не появится, покуда всяческие навальные, явлинские и прочие михаилы не сольют своих сторонников в единое целое, как минимум). И голосовавшее за них хомячьё в подавляющем большинстве своём утрётся так же, как и после Болотной (о бессмысленности коей я тоже, кстати, предупреждал на ряде площадок во время оно).\nВарианты действий существуют, но некосметических изменений невозможно добиться, участвуя в \"выборах\", равно как и тупо игнорируя их.",
				"added": 1482426186
			},
			{
				"comment_id": 8,
				"body": "> [vlad20012](#comment_208_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вы только что перечислили все, что имеется у незарегистрированной \"Партии Прогресса\" Алексея Навального. Которую минюст 2 раза ликвидировал видимо именно по этой причине.\n\n\nСерьёзно? Можно вкратце позицию Партии Прогресса по этим пунктам?",
				"added": 1482426749
			},
			{
				"comment_id": 9,
				"body": "> [shift](#comment_322_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Моё имхо - есть предел % проголосовавших который невозможно фальсифицировать, 50% или 60%Хотя если навальный наберет хотя бы 20-30 это будет уже мега круто и его сторонники увидят что они более чем не одни\n\nВам про \"выборы\" 1996 напомнить?",
				"added": 1482435048
			},
			{
				"comment_id": 10,
				"body": "> [vlad20012](#comment_209_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вкратце позиция Партии Прогресса по всем пунктам разъясняется здесь https://navalny.com/issues/\n\nЭто уход от ответа. Вы утверждаете, что у партии есть чёткая идеология, есть внятная программа, есть разработанный механизм подготовки и ротации элит. Вместо доказательства отсылать меня на какой-то FAQ, чтоб я там искал подтверждения _ваших_ утверждений — это чистейший слив. К тому же есть сильное подозрение, что данной чёрной кошки в той комнате нету вовсе. Укажите тезисно.",
				"added": 1482469950
			},
			{
				"comment_id": 11,
				"body": "> [vlad20012](#comment_210_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Могу только процитировать. Не проще ли Ctrl+F?\n\nСлив засчитываем, или ответите?",
				"added": 1482470235
			},
			{
				"comment_id": 12,
				"body": "Воот. Пойду почитаю. Спасибо. Но последний абзац сразу разочаровал, ибо  политическая конкуренция указанными методами достигается очень ненадолго.",
				"added": 1482470762
			},
			{
				"comment_id": 13,
				"body": "Программу прочёл по-диагонали. Наивненько, но в целом покатит. Популизма многовато, направление лично мне не везде нравится, но хоть понятно, чего хотят. Идеология же нужна. Это то, что работает на уровне супер-эго, без неё никуда. Так что сей вопрос, с моей точки зрения, требует обязательной проработки. \n\nОстаётся главный интересующий меня пункт — почему при наличии хоть чего-то из необходимого,  вокруг ПП не объединилось остальные оппозиционеры? \n\n\nP.S.: Под элитами я подразумеваю не обычных госслужащих, а \"властителей дум\" и толстосумов, так что ссылка не о том, но тоже интересна.",
				"added": 1482476349
			},
			{
				"comment_id": 14,
				"body": "Резюмирую своё бурчание: Навальный проиграет президентские выборы, равно как и любая оппозиционная партия продолжит пролетать на парламентских. Надо менять образ действий, ибо, если всё оставить как есть, всё это будет бесполезной тратой людских и материальных реурсов. Вариантов, как обычно, не один. Соберусь с силами — выкачу статью про это, но не на этой неделе точно.",
				"added": 1482476564
			},
			{
				"comment_id": 15,
				"body": "> [vlad20012](#comment_215_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): лучше делать что-то, чем не делать ничего. \n\nДа, верно, просто вот именно это конкретное \"что-то\" крайне неэффективно и обречено на провал. Ну не годится это — бороться с нелигитимным (а на декларируемой нелигитимности путички держится вся поддержка Навального) режимом законными в рамках этого режима методами. Разве что для демонстрации очевидного. Но смысл показывать в очередной раз то, что и так все знают?",
				"added": 1482516006
			},
			{
				"comment_id": 16,
				"body": "> [vlad20012](#comment_216_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Ничего эффективнее пока не придумали значит. Есть предложения?\n\nДа, есть несколько. На той неделе постараюсь облечь в читаемую форму.",
				"added": 1482517542
			},
			{
				"comment_id": 17,
				"body": "> [shift](#comment_324_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Было бы интересно почитать\n\nПрошу прощения за задержку - времени не было от слова \"совсем\". Выложу прямо тут, потому что внезапно и по непонятной для меня причине лишился возможности редактировать свой зеробложик.\n\n Эти идеи я уже излагал перед событиями на Болотной, так как, объявляя действия организаторов оных событий вредными и бессмысленными, чувствовал, то должен предложить что-то взамен. Оригинал статьи уже канул в Лету вместе с бложиком, в коем она была опубликована, посему изложу по памяти с некоторыми доработками и сокращениями.\n        В контексте обсуждения, заставившего меня коснуться этой тебы был свормулирован вопрос о вариантах эффективных действий оппозиции в условиях России 2016 года. Ну а поскольку участие Навального в президентских выборах я заранее объявил фарсом, то\nи алтернативы предложить должен.\n\n## Итак, вариант первый, агорический.\n\n                К восьмидесятым годам окончательно стало ясно, что в СССР сформировалось ультракапиталистическое общество, управляемое кучкой олигархов, которые впоследствии, устроив, фактически, революцию, ухитрились сменить строй не поменяв элит. Ценой этого стала вассальная зависимость экономики, но это речь для отдельной статьи, а то и серии оных. В данном же контексте важен вот какой аспект -- на чём держится власть в олигархическом обществе? Да таки элементарно на деньгах. Производство, религия, идеология -- это всё ерунда, при желании корректируемая и, главное, _покупаемая_. То есть вывод лежит на поверхности -- чтобы отобрать власть у текущей элиты вам нужно всего лишь лишить их денег. Конкретных способов, разумеется, далеко не один, но захватывать печатный станок ФРС -- тяжело и далеко, а \"производить экспроприации непосредственно на местах\" -- кроваво и неэффективно. Таки что может в таких условиях поделать обычный городской житель, не умеющий грабить/убивать, не любящий боли, да и вообще, желающий сохранить некоторый комфорт и уровень благосостояния, для выбивания почвы из-под жирных олигархических ножек?\n        Рецепт, который я бы старательно пропагандировал на месте оппозиции, носит незатейливое и довольно заезженное название\n-- _контрэкономика_. Всё, в общем-то, просто: система кормится за счёт денег, отбираемых у обывателей, предпринимателей и организаций в виде многочисленных налогов и поборов, верно? Вот этот-то ручеёк (на самом деле, нехилый такой водопадик) способны перекрыть любые офисные хомячки, не отрывая седалищ от икеевских стульев:\n\n        * если вы предприниматель - уходите от налогов и старайтесь не платить взяток, ибо они тоже оседают в системном кармане\n        * если вы наёмнй работник - идите к тем, кто платит \"серую\" или вовсе неофициальную зарплату\n        * покупки лучше совершать у мелких частников, желательно, незарегистрированых и нелегальных\n        * использование официальных валют необходимо снизить, а по-возможности -- вовсе исключить\n        * как дополнение предыдущему пункту -- максимально использовать сообщества, обменивающиеся вещами без использования денег. Благо, при уровне производства, многократно перекрывающем вообще все потребности, это не проблема\n        * гонки за модой и новыми гаджетами -- главное оружие  вашего противника, и лишить его этого оружия -- так, казалось бы, просто...\n        * активно используйте криптовалюты, просвещайте окружающих на этот счёт\n        * в тех случаях, когда вы используете официальные валюты -- не пользуйтесь услугами банков (они платят налоги и взятки). Если же это неизбежно -- не приближайтесь к банкам с государственным капиталом\n\n        Список при желании легко расширить и дополнить, достаточно остановиться и включить голову. В случае, если те ресурсы, которые сейчас расходуются на идиотские акции и \"борьбу с коррупцией\", будут пущены на пропаганду и реализацию подобного образа\nдействий, в течение десятилетия основная часть экономики государства просто будет выведена \"в тень\", и как следствие, будет независима и абсолютно защищена от государства. Армия и карательные органы не станут поддерживать тех кто не станет их кормить --\nэто наглядно было продемонстрировано в девяностых. Зачем выходить против толпы студентов, если ствол теперь не только у тебя, и за это не дадут квартирку? А вот организовать защиту \"нелегального\", но эффективного производства -- это пожалуйста...\n        Думаю, мысль понятна. В следующий раз постараюсь описать ещё пару методов.",
				"added": 1483185779
			},
			{
				"comment_id": 18,
				"body": "Ох, как тут форматирование разносит...",
				"added": 1483185821
			},
			{
				"comment_id": 19,
				"body": "> [vlad20012](#comment_227_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Но это незаконно. Т.е. Навальный, например, не может публично призывать к этому. По сути предложения - сейчас все и так примерно к этому идет. Зарплату все меньше платят по белому, в рублях люди деньги не хранят и т.п. Бюджет все меньше,  фед. резерв также иссякает. Что дальше?\n\nТак \"законными\" методами сместить текущую власть и не получится. Особенно при абсолютной резиновости законов. Это же очевидно. Я заявил, что не могу понять, как из \"незаконности\" эффективных методов люди делают вывод о необходимости тратить ресурсы на действия, заведомо и гарантирванно обречённые на провал. У меня спросили варианты действий, которые сработают. Один привёл. \nПрограмма, подстраивающаяся под имещиеся и постоянно меняющиеся законы, не взлетит, при условии, что вы хотите быстрого (то бишь в перспективе меньшей, чему пара поколений) результата.",
				"added": 1483221801
			},
			{
				"comment_id": 20,
				"body": "> [shift](#comment_336_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Я вижу куда более реалистисный вариант смены - волнения внутри элит, посадки некоторых людей сверху - признак профилактики этих волнений, что на мой взгляд говорит о том, что есть такой вектор\n\nТо бишь, выехать на разборках в среде текущей элиты. Это будет просто замена одной группы свиней у кормушки на другую  — строй не изменится, разве что чисто косметически. Можно, конечно, и поучаствовать в надежде, что новые будут больше делиться, но мне думается, что такой вариант не стоит прилагаемых усилий.",
				"added": 1483456579
			},
			{
				"comment_id": 21,
				"body": "> [shift](#comment_339_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): гм, нет, если разлад в элитах будет достаточно сильный всё карабль может раскачатся и хорошие могут в нужный момент запрыгнуть на борт\n\n> хорошие\n\nХех. Собраться всем хорошим и убить всех плохих. :-)\nЯ таки убеждён, что кораблик надо шатать, но исключительно при условии тщательнейшей предварительной подготовки. А то снова повсплывает.",
				"added": 1483481898
			}
		],
		"1_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 5,
				"body": "http://127.0.0.1:43110/18bBvT42f4WjnqXS39vrqoCL492Qhqqj9L/ - вручную копирую из clearnet-бложика",
				"added": 1482413173
			},
			{
				"comment_id": 26,
				"body": "> [voland](#comment_26_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Парочка бложиков, может кому понравится:Linux.RUБлогПост\n\nвторой годный",
				"added": 1484071911
			}
		],
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 6,
				"body": "> [gaslimit](#comment_4_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX): Antilibrary\n> Книжечки.\n\nТам на русском нетути...",
				"added": 1482413296
			}
		],
		"1_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq": [
			{
				"comment_id": 22,
				"body": "На днях переключился с owncloud на него. Дом+работа+телефон+vps = всегда в доступности как мининмум две точки.",
				"added": 1484034270
			},
			{
				"comment_id": 23,
				"body": "> [tolstoevsky](#comment_22_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): На днях переключился с owncloud на него. Дом+работа+телефон+vps = всегда в доступности как мининмум две точки.\n\nБлин, ответил в тред вместо комментария. Имелся в виду syncthing.",
				"added": 1484034324
			},
			{
				"comment_id": 27,
				"body": "> [voland](#comment_24_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): а оно хоть работает? я что-то вот так и не увидел его в работе\n\nда, последние версии достойны",
				"added": 1484071976
			}
		],
		"3_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 24,
				"body": "> [linxon](#comment_10_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4): у меня там не работают коментарии и лайки выводит ошибку: File write error: [object Object]\n\nТакая же фигня",
				"added": 1484071505
			},
			{
				"comment_id": 25,
				"body": "И пока что там не про отечественное линуксостроение, а про нарушающий GPL Гослинукс и осутствующий в продаже Эльбрус.",
				"added": 1484071636
			}
		],
		"1_19nB39bXLXo8trU1gs1XZPzPq58NGiNLKX": [
			{
				"comment_id": 28,
				"body": "> [kagari](#comment_12_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Лучше посоветуйте платные и не в рф для постоянного пользования.\n\nriseup.net :-)  Не то, чтоб платный, но по приглашениям и просят пожертвований.",
				"added": 1484655893
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 29,
				"body": "> [balancer73](#comment_40_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Всё, комменты на этой доске у меня почти выговорены :)\n\nUSED: 27.1K/30K - таже фигня. Что-то быстро...",
				"added": 1484727460
			}
		],
		"2_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 30,
				"body": "http://127.0.0.1:43110/#b9e8e97cca2f80954cf1db71274f526d0db109d1",
				"added": 1484809134
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 31,
				"body": "Учитывая, что в большинстве городов есть быстрый интернет, а средний ноутбук быстрее сервера семилетней давности, в этом сейчас нет необходимости. Моя нода в данный момент весит чуть больше 300 мегабайт, например.",
				"added": 1484809447
			},
			{
				"comment_id": 32,
				"body": "> [voland](#comment_40_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): хм, а если большие файлы заменять торрентами или даже точнее магнет ссылками\n\nВыглядит разумно. Только делаться это должно автоматически. Кто-нибудь вбрасывал идею разработчикам?",
				"added": 1484809759
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 33,
				"body": "> Представление информации в виде веб-страницы - это эволюционный тупик. \n\nВсё правильно. Даёшь Gopher :-)",
				"added": 1485160539
			}
		]
	},
	"comment_vote": {
		"27_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"3_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N": 1,
		"9_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N": 1
	}
}