{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Quali siti mi consigliate?",
			"body": "Buongiorno ragazzi mi sono appena iscritto, Avete qualche sito da consigliarmi?",
			"added": 1523012482
		},
		{
			"topic_id": 2,
			"title": "NeedleCoin - La Cryptovaluta made in San Marino!",
			"body": "Informazioni riguardo NeedleCoin: http://127.0.0.1:43110/16qxxfxFUMtPmjnDH1hpNuE6gjHXqpRc25/",
			"added": 1523025324
		}
	],
	"topic_vote": {
		"1_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": 1,
		"1_1JQaQ21DhL5q3HiCCX5DJ5xV4wFysqwJzb": 1,
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1JQaQ21DhL5q3HiCCX5DJ5xV4wFysqwJzb": [
			{
				"comment_id": 1,
				"body": "Morrolinux, Ma fatemi capire è tipo un deep web? Ci può stare qualsiasi tipo di sito? Non ho ben capito..",
				"added": 1523012075
			}
		],
		"1_1PhuJ8mEFKaS2pKUbWKyuP1FkKaVkq7bk": [
			{
				"comment_id": 2,
				"body": "> [chikan](#comment_7_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB): ZeroMail - Servizio di messaggistica criptatoZeroUP - File SharingUnlimiUP - Come ZeroUP, ma con limiti di dimensione più grandiZeroMe - Social network twitter-like (solo inglese e cinese)YouTube, KopyKate BIG - Video sharingMillchan - Image boarding (tipo 4chan)0chan porn - Image boarding a tema pornografico (presente pedopornografia)GIF Time - Gif umoristiche, a tema per lo più informaticoRVRE, Kaffiene Search, Snifferdog - Motori di ricercaKidsearch - Motore di ricerca per bambini (contenuti espliciti rimossi)ZeroMedium - Pubblicazione di storie, racconti e riflessioni varieZeroSites - Elenco di siti di ZeroNetZeroBoard - Invio di messaggi anonimi pubblici, utile per pubblicizzare linkZeroDocs, ZeroWiki, ZeroWiki - Italiano, ZeroNet Dev Center - Wiki e guide varie. ZeroNet Dev Center è dedicata agli sviluppatori di siti e servizi \n> Oltre a questi, ce ne sono molti altri. Spero di esserti stato d'aiuto.\n> \n> In tal caso, benvenuto e buon divertimento!\n\nGrazie Mille! ;)",
				"added": 1523184494
			}
		]
	},
	"comment_vote": {
		"7_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1
	}
}