{
	"next_post_id": 11,
	"next_comment_id": 8,
	"next_follow_id": 4,
	"avatar": "generate",
	"user_name": "Kaiserotto",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1537730458,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1537732845,
			"date_added": 1537732843,
			"meta": "{\"img\":\"900,506,45557799a688466333467555233345bbb6677898999ab,01234043454647580169041AB0C6601DEAD2E1171CD1616479031C166008\"}"
		},
		{
			"post_id": 1537732873,
			"body": "",
			"date_added": 1537732870,
			"meta": "{\"img\":\"900,487,000222111110555211332444333,00000100000000213003002334503500202133032267811122\"}"
		},
		{
			"post_id": 1537732886,
			"body": "",
			"date_added": 1537732882,
			"meta": "{\"img\":\"900,506,000666111777bbb999888222555333444,000012222000001132120000145262000065101700008390A70000712077\"}"
		},
		{
			"post_id": 1537732936,
			"body": "",
			"date_added": 1537732931,
			"meta": "{\"img\":\"875,700,000111222333,00001222220001211000001210010000120001000032300000002100000000210000000012000110\"}"
		},
		{
			"post_id": 1537733091,
			"body": "",
			"date_added": 1537733085
		},
		{
			"post_id": 1537809843,
			"body": "\n... die im Dunkeln sieht man nicht\n26. Juli 2005 Klaus Heck\n\nAlle Augen schauen auf Hartz IV, doch der eigentliche Angriff auf Sozialstaat und Bürgerrechte findet woanders statt\n\n“Im Osten lärmen, im Westen angreifen” lautet eines der 36 Strategeme der Kriegskunst, die heute zum kleinen Einmaleins der Manager und Unternehmensberater gehört. Deutschland braucht “einen Turnarround, eine grundlegende Reform, die wehtut”, wissen die Rationalisierer von McKinsey - und wir wissen schon, wem es regelmäßig wehtut, wenn McKinsey auftaucht.\n\nDen medienwirksam inszenierten Großangriff auf den Sozialstaat, an dem McKinsey maßgeblich beteiligt war, kennen wir unter dem Namen Hartz IV. Doch da geht inzwischen nichts mehr. Wer sich hier rührt, das weiß jeder Pop-Politiker, der wird zerpflückt.\n\nWährend sich also mal wieder in Deutschland scheinbar gar nichts mehr bewegt, geht im Schatten von Hartz IV ein Gespenst um, dessen Auftauchen wir nicht einmal in unseren düstersten Visionen erahnten: die Rede ist von “Lebensmittelarmut”, von Hunger überall in Deutschland. Wo aber Gefahr ist, wächst das Rettende auch, hat uns Hölderlin nachhaltig eingeprägt. Auch diesmal naht Rettung, zwar nicht von Politikern oder von traditionellen Wohlfahrtsverbänden, sondern ausgehend von einer einfachen Idee, welche binnen weniger Jahre die “größte soziale Bewegung Deutschlands” entfachte. So jedenfalls heißt es in der Gründungslegende der Tafel.\n\nWir hören Heinz Walter, Küchenleiter der Kantine der Aachener Agentur für Arbeit:\n\n    Ich war immer der Meinung, dass nur in der dritten Welt, bzw. in Afrika Hunger gelitten wird, aber nicht hier vor der Haustür. Das will mir nicht in den Kopf rein, das kann einfach nicht sein.\n\nHerr Walter kocht in Reaktion auf einen WDR-Fernsehbericht nun täglich 20-25 Essen zusätzlich, die dann von der Aachener Tafel an eine Grundschule geliefert werden. In dem Folgebeitrag des WDR-Fernsehens berichtet Jutta Schlockermann, Vorsitzende der Aachener Tafel, von Kindern, “die kein Essen haben, während der Mittagspause, während der Frühstückszeit und auch am Abend”.\n\nGenau wie ihr Bundesverband in Berlin, hat auch die Aachener Tafel ihre Gründungslegende. “Wir konnten die Not in unserer Nachbarschaft nicht mehr sehen”, heißt es auf der Homepage. Und “die überquellenden Abfall-Container an manchen Supermärkten auch nicht\".\n\nDas klingt erfrischend spontan, basisdemokratisch und einleuchtend. Allein: im Zusammenhang mit einer scheinbar von unten kommenden spontan entstandenen sozialen Bewegung fällt zunächst deren Professionalität auf. So hat der Bundesverband der Tafeln acht Grundsätze festgelegt, die für alle Filialen in Deutschland verbindlich sind und sich “Tafel”, verbunden mit der Androhung von strafrechtlichen Konsequenzen bei Markenmissbrauch, schützen lassen.\n\nAuch die Internetauftritte der Tafeln sind, während viele Vereine und selbst mittelständige Unternehmen immer noch selbst gebastelte Seiten für ausreichend halten, durchweg professionell unter Beachtung der Corporate Identity gestaltet. Der Gesamteindruck erinnert eher an ein Franchise-Konzept nach Art von McDonald’s als an altbekannte Bürgerinitiativen oder Friedensgruppen. Wer steckt wirklich hinter der erfolgreichen Markteinführung der Tafel®?\nDeutschland in Sachen Hungerhilfe noch ein Entwicklungsland. Karte: European Federation of Food Banks\nFirst we take Manhatten...\n\nSabine Werth , die zusammen mit anderen Berliner Frauen irgend etwas für Obdachlose tun wollte, so heißt es, las 1993 zufällig einen Artikel über die New Yorker Organisation City Harvest.\n\nEs war das Jahr, in dem Bill Clinton Präsident, Scharping erstmal Kanzlerkandidat wurde und in dem Oscar Lafontaine Unterweltkontakte vorgeworfen wurden. Die deutsche Öffentlichkeit war entsetzt vom fremdenfeindlichen Brandanschlag in Solingen.\n\nUnd in Berlin überzeugte Frau Werth ihre Freundinnen davon, das Leitmotiv einer New Yorker Charity-Resteverwertung zu übernehmen:\n\n    Millions of pounds of good, edible food are thrown away each year by New York City food businesses. At the same time, an estimated 1.6 million people are hungry, one third of them children. City Harvest is the link between those who have so much and those who have too little.\n\nMan kann es kaum glauben. Noch nicht einmal drei Jahre nach der Wiedervereinigung waren ja die meisten Wessis noch stolz und die meisten Ossis versessen auf unsere blühenden Landschaften. Man war entsetzt, wenn man gehört hat, dass im reichen Amerika angeblich Menschen nicht genug zu essen hätten. Aber mal ehrlich: Wer hätte es damals schon für möglich gehalten, dass es ein halbe Jahrhundert nach der Luftbrücke hungernde Berliner gibt, und wer wäre darauf gekommen, ihnen Lebensmittelpakete zukommen zu lassen? Für soviel Kreativität hat Frau Werth das Bundesverdienstkreuz, das ihr 2003 verliehen wurde, wohl verdient.\n... then we take Berlin\n\nJedenfalls soll der Aufbau einer deutschen Tafellandschaft zunächst nicht so toll geklappt haben. Glücklicherweise tauchte dann irgendwann Hilfe von einem global vernetzen Beraterkonzern auf, der bisher eher im Zusammenhang mit Massenentlassungen bei DAX-Unternehmen, Vorschlägen zum Sozialabbau und Sonderförderung für die Eliten bekannt war als für die Unterstützung “sozialer Bewegungen”.\n\nDie Konzernzentrale dieser Beratergruppe, bei der man trotz weltweiter Verzweigung viel Wert darauf legt, eine geschlossene Gesamtfirma zu bilden, hat ihre Zentrale in New York - genau wie City Harvest. Da war es nahe liegend, einmal nachzuschauen, ob vielleicht auch die amerikanische Mutter der deutschen Tafelidee Unterstützung durch McKinsey erfahren hat. - Sie hat. Solche McKinsey-Leitfäden zur Gründung und zum Management von Tafeln, gehören in jeder deutschen Tafelfiliale zur Standardausstattung.\n\nEinmal auf dieser Spur zeigt sich eine Einflussnahme von McKinsey in einem Umfang, der den Verdacht entstehen lässt: Ist McKinsey womöglich der eigentliche Initiator der “internationalen Tafellandschaft”? Müssen wir nach McDonalds Fastfood bald mit McKinseys Junkfood für Bedürftige weltweit rechnen?\n\nZum Beispiel die Schweiz: Hier wollte Bankiersgattin Yvonne Kurzmeyer Gutes tun und kam auf die Idee, eine Tafel nach New Yorker und Berliner Vorbild zu gründen. Mit 600.000 Franken von ihrem privaten Geld gründete sie die Stiftung “Hoffnung für Menschen in Not”. Und weiter heißt es in der Schweizer Gründungslegende:\n\n    Dank guten Kontakten zur Wirtschaft konnte Kurzmeyer die Unternehmensberater-Firma McKinsey motivieren, ein für die Schweiz zugeschnittenes “Handbuch zum Betrieb einer Tafel” zu entwickeln.\n\nAuch in Kanada und Österreich berät McKinsey die Tafeln. Eindeutig klar ist also: McKinsey ist das internationale Bindeglied zwischen den nationalen Tafelgesellschaften.\n\nNun wird sich wohl kaum ein Beweis dafür erbringen lassen, dass McKinsey der eigentliche Initiator der Tafeln ist. Folgt man Foucaults Machttheorie, wie er sie im ersten Band von “Sexualität und Wahrheit”, in “Der Wille zum Wissen”, entwickelt, dann ist eine eindeutig identifizierbare Zentralmacht analog zum fürstlichen Souverän bei Machiavelli, nach der noch jede Verschwörungstheorie sucht, unter den gegenwärtigen Bedingungen globaler Herrschaft des Kapitals weder wahrscheinlich, noch ist es notwendig, um dann, in einem zweiten Schritt, dieses souveräne Subjekt nach der Intention dieser Macht befragen zu können.\n\nFür die Tafelentwicklung erleichtert das Wissen um die intensive Einflussnahme von McKinsey das Erkennen ihrer teilweise noch verborgenen Intention: dass sie genau auf den Turnaround zusteuert, den McKinsey immer wieder fordert, nämlich die massive Einschränkung des staatlichen Geldtransfers auf der Grundlage von Bürgerrechten. Statt Geld mit Bürgerrechtsanspruch gibt es großzügige private Spenden an die Bedürftigen auf Grundlage der Menschenrechte.\n\nAber es ist keineswegs so, dass es hier eine klare Frontlinie gibt zwischen einem Regime, das diese Macht von oben erzwingen will, und einem Widerstand, der sich von unten dagegenstemmt. “Macht ist unten” sagt Foucault.\nTafeln hebeln deutsches Recht aus\n\nIn Aachen haben wir gesehen, wurde die Tafel vom Leiter des Sozialamtes angeregt. In Bochum dagegen hat der Leiter der Bezirksverwaltung Wattenscheid versucht, der Tafelmacht Widerstand entgegenzusetzen, indem er in einem Fernsehinterview angekündigt hat, schlicht und ergreifend die geltenden Gesetze anzuwenden und das bedeutete immerhin noch bis zum 16. Juni 2005, dass Sachleistungen auf den Hilfebedarf angerechnet werden - müssen! Mit anderen Worten: Aus dem verführerischen Angebot der Tafeln, kostenloses Essen zusätzlich zum staatlichen Geldtransfer zur Grundversorgung zu verteilen, wäre die Alternative geworden: Fütterung mit Lebensmittelpaketen statt Geld für den Supermarkteinkauf.\n\nDas Anwenden dieses im Übrigen das gesamte Sozialrecht wesentlich bestimmenden Subsidiaritätsprinzips, nach dem eben - vereinfacht gesagt - nur der vom Staat versorgt werden soll, der nicht von anderer Seite schon genug bekommt, hätte natürlich das sofortige Aus der Tafeln nach sich gezogen. Man darf wohl unterstellen, dass genau das die Absicht dieses mutigen Menschen war. Denn dass es sich hier nicht um einen dummen Paragrafenreiter gehandelt hat, wird durch die Begründung sofort deutlich: Man habe schließlich kein Sozialsystem wie in Amerika, sagte er vor laufender Kamera.\n\nAus dem entblößten Blickwinkel des nur noch bedarfsorientierten Lebens, des Bedürftigen, wie er in der Tafelbewegung genannt und genormt wird, aus diesem bedürftigen Blick heraus, repräsentiert natürlich dieser Beamter die Staatsmacht, die ihm, dem kleinen Mann, noch das letzte Butterbrot nicht gönnt. Und die prompte Reaktion von höherer Verwaltung und Politikern, dieser Beamte habe “absoluten Quatsch” erzählt und natürlich würde die Tafelspende nicht auf die Sozialhilfe angerechnet, beruhigt diesen bedürftigen Blick, während es uns gerade in Unruhe versetzt und zeigt, welch enorme Macht die Tafel ist. Das, was sich Verwaltungsspitze und Politiker da geleistet haben, nennt man nach meinem Rechtsempfinden Nötigung zur Veruntreuung.\n\nUnd die Klarstellung, um die der Vorsitzende eines Unterausschusses im Bundestag gebeten hat, dass ja wohl mit “anderweitiger Bedarfsdeckung” nicht die Lebensmittel der Tafeln gemeint wären, wird in einer späteren Phase natürlich als “zum Missbrauch von staatlichen Leistungen geradezu einladende Gesetzeslücke” bezeichnet und gestrichen werden. Oder aber der Geldbetrag wird nach und nach immer geringer ausfallen. Schließlich ist es gerade noch genug für Zigaretten. Dann aber muss man ja schon aus Verantwortung für die Gesundheit der Schutzbefohlenen heraus auch diesen Betrag streichen. Nein, das wird nicht zynisch klingen, eher schon eine Argumentation, die dem Bedürftigen eine Entscheidungskompetenz unterstellt, die man nicht voraussetzen darf, die also zu seinem Tode führen würde.\n\nJedenfalls sehen wir also eine Welle der Hilfsbereitschaft auf uns zurollen, die täglich größer wird. Aktuell zum Beispiel durch die Gründung von so genannten Foodbanks auch in Deutschland, die logistisch auf riesige Mengen minderwertiger Lebensmittel ausgerichtet werden und durch die der Lebensmittelausstoß der lokalen Tafeln, die ihren Umsatz längst in Tonnen messen, um ein Vielfaches wachsen wird.\n\nGeostrategie von Biopolitik: Noch ist Deutschland ein weißer Fleck auf der Karte der “European Federation of Food Banks”. Doch die Gründung wird gegenwärtig von den Tafeln mit Hochdruck betrieben. Wir ahnen, wie diese Welle der Hilfsbereitschaft den Sozialstaat unter sich begraben wird. (Klaus Heck) \n\nhttps://www.heise.de/tp/features/die-im-Dunkeln-sieht-man-nicht-3401940.html\n\n\n",
			"date_added": 1537809836
		},
		{
			"post_id": 1537899495,
			"body": "Deutschland\nReaktionen nach Niederlage von Kauder: \"Anfang vom Ende der GroKo\" - \"System Merkel geht zu Ende\" \n Der unerwartete Wechsel an der Spitze der CDU/CSU-Fraktion wird sowohl von der Opposition als auch vom Koalitionspartner SPD als schwere Niederlage für Bundeskanzlerin Angela Merkel gewertet. Auch Merkel selbst äußert sich. Eine Übersicht über die Reaktionen:\n\n\"Ich freue mich riesig über das Wahlergebnis.\" (Der neue Unions-Fraktionsvorsitzende Ralph Brinkhaus, CDU)\n\n    Das ist eine Stunde der Demokratie. In der gibt es auch Niederlagen, und da gibt es auch nichts zu beschönigen. (Bundeskanzlerin Angela Merkel, CDU)\n\n\"Bei uns knallen die Korken.\" (AfD-Fraktionschefin Alice Weidel)\n\n    Die Wahl ist ein Ausdruck dafür, dass das System Merkel zu Ende geht. (Die Linken-Fraktionsvorsitzenden Sahra Wagenknecht und Dietmar Bartsch)\n\nAbschiedsläuten?\nMehr lesen:Merkel-Dämmerung: Kauder verliert Kampfabstimmung - CDU/CSU wählt Ralph Brinkhaus zum Fraktionschef\n\n\"Ich glaube, dass es jedenfalls ein weiterer Schritt zum Ende der Regierung Merkel ist, und wir werden das Ende viel früher erleben als wir uns das heute vorstellen.\" (AfD-Fraktionschef Alexander Gauland)\n\n    Das ist der Anfang vom Ende der GroKo. Die Autorität der Kanzlerin in ihrer eigenen Fraktion ist offiziell zerstört.» (FDP-Fraktionsvize Alexander Graf Lambsdorff via Twitter)\n\n\"Die Unionsfraktion rückt mit der Wahl von Ralph Brinkhaus weiter nach rechts.\" (Linken-Parteichef Bernd Riexinger)\n\n\"Es ist ein Zeichen, wie tief zerstritten die Union insgesamt ist und dass ihr im Kern die Ideen ausgegangen sind, dieses Land weiter zu regieren.\" (Der Grünen-Fraktionsvorsitzende Anton Hofreiter)\n\n    Das ist ein Aufstand gegen Merkel. (Bundestags-Vizepräsident Thomas Oppermann via Twitter)\n\n\"Das ist für Frau Merkel als Bundeskanzlerin und Vorsitzende der CDU schon ein mächtiger Schlag ins Kontor.\"(SPD-Vize Ralf Stegner)\n\n    Das ist ein Signal der Erneuerung. Wir freuen uns auf die Zusammenarbeit mit Herrn Brinkhaus. (Gesamtmetall-Hauptgeschäftsführers Oliver Zander in einer Mitteilung)\nhttps://deutsch.rt.com/inland/76585-reaktionen-nach-niederlage-von-kauder-merkel/?utm_source=browser&utm_medium=aplication_firefox&utm_campaign=firefox",
			"date_added": 1537899487
		},
		{
			"post_id": 1537905520,
			"body": "Download: 5 Jahre Propagandaschau    in einem handlichen Offline-Archiv\n\n\nPosted by Dok in Allgemein\t\n\n≈ 10 Kommentare\n\nGepackt sind es etwas mehr als 3GB in 7 Dateien, entpackt (mit 7-Zip oder einem anderen Packprogramm) passt es noch immer auf eine DVD: Anarchrist hat 5 Jahre Propagandaschau in ein Archiv geschnürt, das ab sofort hier heruntergeladen werden kann. Es sind entscheidende 5 Jahre, in denen Deutschland und die EU durch Größenwahn, Vasallentum, Dummheit und Skrupellosigkeit in Politik und Medien tiefgreifend gespalten wurden, der Westen mit Desinformation und Lügen einen gewaltsamen Putsch und mörderischen Krieg in die Ukraine brachte und dieses geopolitisch motivierte Verbrechen mit einer Verleumdungs- und Hetzkampagne gegen Russland kaschierte, die bis heute anhält. Auch die wahren Hintergründe über die Kriege in Syrien und die Desinformation über den Jemen versteht niemand, der nicht die alltäglichen Methoden der Propaganda in ARD, DLF und ZDF durchschaut. Da abzusehen ist, dass der forcierte Krieg gegen die Meinungsfreiheit auch diesen Blog früher oder später einholen und einebnen wird, sollte sich jeder, der die hanebüchenen Lügen von Golineh Atai, Claus Kleber und Konsorten irgendwann noch mal nachlesen möchte, so bald wie möglich eine Kopie ziehen. Wer auch nur einen Bruchteil der Wahrheit kennt, der weiß, dass der Begriff Lügenpresse eine Verharmlosung ist. Es sind Massenmordmedien, deren arglose Opfer in der Regel nicht im Geringsten verstehen oder auch nur ahnen, wie sie manipuliert und in Tod und Elend gestürzt werden.\n\nWorkUpload oder ZippyShare\n\n(Hashwerte der einzelnen Dateien gibt es hier.)\nhttps://propagandaschau.wordpress.com/2018/09/23/download-5-jahre-propagandaschau-in-einem-handlichen-offline-archiv/",
			"date_added": 1537905511
		},
		{
			"post_id": 1538069625,
			"body": "Wolkenkunde! | Tropospherische Aerosol Injektion (TAI) | Solar Radiation Management (SRM) | Künstlicher Pinatubo Effekt.\nWolken bestehen aus Wasser und wer das Wasser der Wolken und die sie tragenden Winde beherrscht, wird zum Herren über Leben und Tod! Die militärische Verwendung wird als Geophysische Kriegsführung, die zivile als Geoengineering (Geoarchitektur) bezeichnet!\n\nINHALT\n.\n1. Einleitung\n2. Atmosphärische Schichten\n3. Wetter\n4. Cumulus-Wolke\n5. Stratosphäre und Thermik\n6. Cirrus-Wolken\n7. Findet CO2!\n8. KONDENSSTREIFEN\n9. Persistente Streifen\n10. Quellen zur Eigenrecherche\n.\n.\n.\n.\n.\n.\n.\n1. Einleitung\n.\nDie Gesamtdarstellung der Klimakontrolle ist im folgenden PDF-Dokument verfügbar:\n.\nWasserklau_Wasserhandel_per_Luftfracht.pdf\n.\nIch möchte hier kompaktes Basiswissen zu einzelnen Aspekten der Meteorologie, Wolkenkunde und Flugtechnik zusammenfassen, um das Verständnis der Klimakontrolle zu erleichtern.\n.\nBedenkt bitte, dass die Wolkenkunde seit dem Beginn der Klimakontrolle im Verlauf des 2. Weltkrieges zum strategisch militärischen Wissen mutiert ist. Wolken bestehen aus Wasser und wer das Wasser der Wolken und die sie tragenden Winde beherrscht, wird zum Herren über Leben und Tod! Die militärische Verwendung wird als Geophysische Kriegsführung, die zivile als Geoengineering (Geoarchitektur) bezeichnet!\n.\nUm die Bewirtschaftung der Wolken zu „normalisieren“ wurden sogar die industriellen Wolken im März 2017 in den internationalen Wolkenatlas aufgenommen.\n\nhttps://dudeweblog.wordpress.com/2018/03/23/wolkenkunde-tropospherische-aerosol-injektion-tai-solar-radiation-management-srm-kuenstlicher-pinatubo-effekt/",
			"date_added": 1538069615
		}
	],
	"post_like": {
		"1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1537732936": 1537733166,
		"1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1537732886": 1537733173,
		"1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1537732845": 1537733211,
		"1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1": 1537733226,
		"1C1aVzLkdEKAya2V6WcjbeRFk9SNBuJrk6_1": 1537900742
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Merkel und die Politik der verbrannten Erde",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537730602
		},
		{
			"comment_id": 2,
			"body": "Die Bilder aus dem Emsland sind voller Symbolkraft. Dort verursacht die Bundeswehr einen Moorbrand, der schon hunderttausende Menschen in der Großregion in Mittleidenschaft gezogen hat. Ohne Rücksicht auf die Folgen wurde losgeballert.https://cdnde1.img.sputniknews.com/images/32240/13/322401308.png",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537730732
		},
		{
			"comment_id": 3,
			"body": "Mit vereinten Kräften gelang es Regierungs- und Kirchenführung in Mecklenburg-Vorpommern am vergangenen Sonnabend, das Demonstrationsrecht für die AfD außer Kraft zu setzen. Gemeinsames Ziel war, nur solche demonstrieren zu lassen, die den Kurs der Regierungsparteien unterstützen, für Kritiker sollte das Recht nach dem Willen von Kirche und SPD nicht gelten.\n\nDiese Ziele propagierten sie passenderweise in der Marienkirche bei einer „interreligiösen Andacht“. Der NDR berichtet entsprechendwohlwollend:\n\nIn der Marienkirche hatte am Nachmittag eine interreligiöse Andacht mit Bischof Andreas von Maltzahn stattgefunden. Er rief die Menschen dazu auf, „Flagge zu zeigen und üblem Gerede zu widersprechen“. Wörtlich forderte von Maltzahn, Menschen, die ausgegrenzt sind, in die Mitte zu holen und jeglichem Antisemitismus, Islamfeindlichkeit, Fremdenhass und dumpfer Wut zu widerstehen.\n\nÜbersetzt: Es sollten die Teilnehmer der angemeldeten AfD-Demo am Reden und am Demonstrieren gehindert werden. Insbesondere Kritik am Islam soll nicht geäußert werden können. Also an der Religion, die überall auf der Welt am brutalsten gegen Andersgläubige vorgeht, wenn sie das Sagen hat. Solche Stimmen sollen stigmatisiert und (gerne mit dumpfer Wut – Antifa) aus der Mitte der Gesellschaft ausgegrenzt werden. Das gefiel auch Ministerpräsidentin Schwesig:\n\nZur Andacht in die Marienkirche kam auch Ministerpräsidentin Manuela Schwesig (SPD). „Ich bin heute in Rostock, um allen den Rücken zu stärken, die für Demokratie und Vielfalt und gegen Hass und Gewalt eintreten“, so Schwesig. „Mecklenburg-Vorpommern ist ein weltoffenes und freundliches Land. Und das wollen wir auch bleiben“, sagte die Ministerpräsidentin.\n\nÜbersetzt: Wer gegen das Demonstrationsrecht für die Opposition ist, ist ein Demokrat, wer das Demonstrationsrecht verhindert, ist ein besonders starker Demokrat. „Vielfalt“ ist, wenn alle Teilnehmer die SPD und die CDU loben und deren Politiker*Innen wie zum Beispiel Manuela Schwesig. Das von Schwesig geforderte „Eintreten“ darf man dabei ruhig wörtlich nehmen, da die SPD mittlerweile ganz offen für eine Zusammenarbeit mit der Antifa wirbt, die die „Weltoffenheit“ gerne mit Fußtritten, Faustschlägen und auch durch den Einsatz von Schusswaffen gegen die Oppositon bewirbt.\n\nIm Angesicht der eigenen Regierungschefin, die sich deutlich gegen die Durchführung der Demonstration ausgesprochen hatte, nimmt es nicht wunder, dass die Polizei das Grundrecht der Demonstrationsfreiheit am Sonnabend nicht verteidigte und durchsetzte.\n\n1.250 Beamten vor Ort, Reiterstaffeln und Wasserwerfer hätten sicher ausgereicht, um die Straßenblockade der Demokratiefeinde zu verhindern bzw. aufzulösen. Dies war ausdrücklich von den Veranstaltern der blockierten Demonstration gefordert worden. Doch nach der recht deutlichen Ansage der SPD-Regierungschefin und ihres kirchlichen Lakaien war kein leitender Polizist mehr bereit, sich an dem Tag für das Recht einzusetzen. „Aus Sicherheitsgründen“, so der NDR, wurde der Aufzug von der Polizei gestoppt und zurück zum zentralen Versammlungsort am Neuen Markt begleitet. Demnächst wird man dann wohl auch mit „Schutzhaft“ für AfD-Mitglieder rechnen dürfen.http://www.pi-news.net/2018/09/rostock-schwesig-und-maltzahn-fuer-einschraenkung-des-demorechts/http://www.pi-news.net/2018/09/rostock-schwesig-und-maltzahn-fuer-einschraenkung-des-demorechts/",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537730921
		},
		{
			"comment_id": 4,
			"body": "Sun Sep 23 2018\n\n    [l] Falls ihr euch gewundert hat,wieso Flinten-Uschi so gerne McKinsey Millionenaufträge gibt: Ihr Sohn arbeitet da seit sieben Jahren.\n\n    Davor hat der auch kurz bei der Boston Consulting Group gearbeitet. Na die werden sich in den Arsch beißen, dass sie ihn nicht gehalten haben.\n https://blog.fefe.de/?ts=a5591dd6\n",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537731083
		},
		{
			"comment_id": 5,
			"body": "Am Freitag treffen sich Bundeskanzlerin Merkel und Bundesinnenminister Seehofer zu einem „Wohngipfel“. Die Erwartungen an die Regierung sind hoch. Es muss dringend und schnell etwas geschehen, um etwas gegen die Wohnungsnot und die explodierenden Miet- und Kaufpreise zu unternehmen. Der Druck von der Straße wächst. Doch werden die Erwartungen durch die Regierung erfüllt?\n\nWohl kaum, denn die Industriegewerkschaft Bauen-Agrar-Umwelt (IG BAU) und andere Wohnbauexperten rechnen damit, dass dieses Jahr nicht einmal 300.000 Wohnungen gebaut werden. Die Bundesregierung hatte versprochen, bis zum Ende der Legislaturperiode 1,5 Millionen Wohnungen zu bauen. Pro Jahr müssten also mindestens 375.000 Wohnungen entstehen. Doch die Zahl der Baugenehmigungen weist auf ganz andere, viel niedrigere Zahlen im Wohnungsbau hin.\n\nBeim „Wohngipfel“ am Freitag wollen Vertreter aus Mieterbund, Gewerkschaften, Sozial- und Wohlfahrtsorganisationen nochmals ihre Forderungen auf den Tisch legen: Mehr gemeinnütziger Wohnbau ohne Rendite, besserer Kündigungsschutz, strengerer Mietenstopp sowie niedrigere Modernisierungsumlagen. „Die Eigentümerlobby muss zurückgedrängt, der Immobilienbesitz transparent gemacht werden“, so die Forderung des Aktionsbündnisses.\nIn München sind vor wenigen Tagen tausende Menschen auf die Straße gegangen, um gegen die explodierenden Mieten zu demonstrieren. Der Frust wächst in Deutschlands Großstädten. Das Kernproblem ist vor allem der Wohnungsmangel. Es werden nicht genügend Sozialwohnungen gebaut, bei vielen Wohnungen laufen die Mietpreisbindungen aus. Die normalen Bürger können es sich bald nicht mehr leisten, in den Städten zu wohnen. Diese werden an den Rand oder aus den Städten gedrängt.\n\nAus Angst vor nicht mehr bezahlbaren Mieten werden zudem immer mehr Menschen in den Kauf einer Immobilie gedrängt. Bisher waren eigene Immobilien eine gute Geldanlage. Das hat sich allerdings geändert. Die Immobilienblase bläht sich weiter auf, die Renditen sinken. Bisher war der Kauf eines Eigenheims oft als Altersvorsorge gedacht, um im Alter mietfrei wohnen zu können und finanzielle Sicherheit zu schaffen.\n\nJetzt kaufen aber immer mehr Menschen Wohneigentum aus Angst. Innerhalb von zwei Jahren sind die Mieten durchschnittlich um sechs Prozent gestiegen. Für die kommenden Jahre wird ein Mietpreisanstieg von knapp acht Prozent erwartet, in den Städten sogar über acht Prozent. Trotz der steigenden Quadratmeterpreise ist der Anteil derjenigen, die Immobilen kaufen, von 15 Prozent im vergangenen Jahr auf 18 Prozent dieses Jahr gestiegen, berichtet die Welt. Doch wer glaubt, seine Immobilie einmal teurer verkaufen zu können, als sie eingekauft wurde, der irrt. Denn die Immobilienpreise werden über kurz oder lang wieder fallen.\n\nhttps://www.neopresse.com/gesellschaft/wohnungsnot-tausende-muenchner-demonstrieren-regierung-versagt/",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537731283
		},
		{
			"comment_id": 6,
			"body": "Lettland baut einen 90 Kilometer langen, 2,5 Meter hohen Metallzaun entlang der Grenze zu Russland, der noch in diesem Jahr fertiggestellt wird. Im Jahr 2019 wird er über mehr als 190 Grenzkilometer mit geschätzten Kosten von 17 Millionen Euro erweitert.\n\nEin ähnlicher, 135 Kilometer langer Zaun, wird von Litauen an der Grenze zum russischen Gebiet Kaliningrad errichtet.\n\nEstland kündigte den bevorstehenden Bau eines 110 km langen und 2,5 m hohen Zauns an der Grenze zu Russland an. Erwartete Kosten von über 70 Millionen Euro, für die die estnische Regierung EU-Mittel beantragen wird.\n\nDer Zweck dieser Zäune ist, laut Regierungserklärungen, der \"Schutz der Außengrenzen Europas und der NATO\". Der Beweggrund ausgenommen, dass diese vor massiven Migrationsströmen aus Russland \"geschützt\" werden sollen, bleibt nur der andere: Die Außengrenzen von EU und NATO müssen vor der \"russischen Bedrohung\" geschützt\" werden.\n\nDa der von den baltischen Ländern entlang der Grenze zu Russland errichtete Zaun praktisch keine militärische Wirksamkeit hat, ist sein Zweck grundsätzlich ideologisch: das greifbare Symbol, dass es jenseits des Zauns einen gefährlichen Feind gibt, der uns bedroht. Dies ist Teil der politischen und medialen PSYOPS [psychologische Operationen, Anm. d. Übers.], um die Eskalation von USA und NATO in Europa gegen Russland zu rechtfertigen.\n\nIn diesem Zusammenhang reiste der Präsident der Italienischen Republik, Sergio Mattarella, zweimal nach Lettland, erstmals im Juli auf einer Besuchsreise in die baltischen Länder und Georgien. Beim offiziellen Mittagessen in Riga lobte der Präsident der Italienischen Republik Lettland für die Wahl der \"Integration in die NATO und die Europäische Union\" und für die Entscheidung, \"ein offenes Gesellschaftsmodell anzunehmen, das auf der Achtung der Rechtsstaatlichkeit, der Demokratie und der Zentralität der Menschenrechte beruht\".\n\nDies wurde dem lettischen Präsidenten Raymond Vejonis verkündet, der bereits im April den Gesetzentwurf zum Verbot des Russischunterrichts in Lettland gebilligt hatte, einem Land, dessen Bevölkerung aus fast 30% russischer Ethnie besteht und in dem 40% der Einwohner Russisch als Hauptsprache verwenden. Eine libertizide [stark bevormundende, Anm. d. Übers.] Maßnahme, die durch das Verbot der von der Europäischen Union selbst anerkannten Zweisprachigkeit die russische Minderheit weiter diskriminiert, der vorgeworfen wird, \"die fünfte Säule Moskaus\" zu sein.\n\nZwei Monate später, im September, kehrte Präsident Mattarella nach Lettland zurück, um an einem informellen Gipfel der Staatschefs der Europäischen Union teilzunehmen, bei dem die Frage der Cyberangriffe von \"Staaten mit feindseliger Haltung\" behandelt wurde (eindeutiger Hinweis auf Russland).\n\nNach dem Gipfel besuchte der Präsident der Republik den Militärstützpunkt Ᾱdaži, wo er das italienische Kontingent in der von der NATO in Lettland im Rahmen der \"verstärkten Vorwärtspräsenz\" an der Grenze zu Russland eingesetzten Kampfgruppe traf. \"Ihre Anwesenheit hier ist ein Grundbaustein, der unsere lettischen Freunde und andere baltische Länder beruhigt\", sagte der Präsident der Republik. Worte, die im Wesentlichen die PSYOP nähren und die Existenz einer Bedrohung für die baltischen Länder und den Rest Europas durch Russland unterstellen.\n\nAm 24. September wird auch Papst Franziskus Lettland besuchen, auf einer Reise durch die drei baltischen Länder. Wer weiß, ob er, indem er wiederholt, dass wir \"Brücken bauen müssen anstatt Mauern\", auch etwas über den neuen Eisernen Vorhang sagen wird, der durch die Spaltung der europäischen Region das Denken auf Krieg vorbereitet. Oder ob er in Riga, wenn er Blumen am \"Denkmal für die Freiheit\" niederlegt, die Freiheit junger Letten einfordern wird, ihre eigene Sprache zu lernen und zu benutzen.\nManlio Dinucci\n\nÜbersetzung \nhttp://www.voltairenet.org/article203069.html",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537731450
		},
		{
			"comment_id": 7,
			"body": "https://www.youtube.com/watch?time_continue=23&v=0MoP5Q-dBts\nIn Britisch Kolumbien, Kanada wurde ein sogenannter \"Firenado\" aufgezeichnet, der einen Feuerwehrschlauch von den Feuerwehrleuten in Besitz genommen hat.\nhttps://de.sott.net/article/32956-Feuernado-in-Kanada-aufgenommen",
			"post_uri": "1DPRn8nU9mM9sQbfMZB6acWk5tSkJPJsoa_1",
			"date_added": 1537731861
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "19dCY2LeCMat8FZihJkibLaFWszfyEKDhp",
			"user_name": "Rootossi",
			"date_added": 1538253040
		},
		{
			"follow_id": 2,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "198VMhh9cxCoEqJN5LzyAKwwv6LDmKgWX1",
			"user_name": "Deutscherin",
			"date_added": 1538471967
		},
		{
			"follow_id": 3,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1E6aRfHzDwDC2LLYpa3PK7gbFXfB6weMYf",
			"user_name": "Wunderkind",
			"date_added": 1538471983
		}
	]
}