{
	"title": "the first hell",
	"description": "My Blog.",
	"links": "- [sigma fund sq](http://127.0.0.1:43110/1Fih5isDDA6r8W8XuieWkrkez2EGyJnMLk/)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1496817244,
	"post": [
		{
			"post_id": 5,
			"title": "stressful voice of the people - a case study",
			"date_published": 1496796173.359,
			"body": "here is a great showcase of the stressful voice of hte people in the first stress:\n\n来源： 李志林\n\n　　需要就股市重大问题给刘主席上上课\n\n　　本周，限制大小非的新政出台后，四指数仍然收周阴线，周四，在上证50再创新高的情况下，108只股跌停，800只股跌幅超5%，2600只股下跌。周五创业板更是创出了1711点新低。市场悲观绝望情绪到了极点。\n\n　　是大小非减持新规不好吗？不是！改善供求关系利好，毕竟是利好。\n\n　　是市场刻意割肉做空，让刘主席难堪吗？也不是！毕竟，众多的割肉者亏掉的人民币，而不是橘子皮。\n\n　　那么，是什么原因导致股市跌跌不休、市场信心全无呢？\n\n　　李志林认为，由于刘主席以往在农行、中行工作期间，主要分工和强项的是监管，临危受命掌管股市。并且在上任的一年里，卓有成效有效，将股灾3.0版2638点拯救了过来，并稳步将股市推进到3300点。但是，因他对股市的业务和症结知之甚少，随后，在一些列重大问题上的指导思想，治市方针、理念，以及监管方法上，出现了严重的偏差，导致了除上证50指数(2475.4636, -20.98, -0.84%)以外的股灾4.0版的发生。\n\n　　在此，作为一个大学老师，作为一个资深的投资者，有必要给刘主席上上课。\n\n　　1、股市的功能是否只有融资？\n\n　　根据金融常识，股市具有四大功能：融资功能、优化资源配置功能、投资功能（价值再发现功能）、经济晴雨表功能。\n\n　　但是，到了刘主席那里，股市却变成了只有一个功能——融资功能。\n\n　　去年发了242只新股，今年前5个月又发了220只新股。据交易所称，2017年将发行500只新股。据刘主席称，用2、3年时间解决IPO堰塞湖问题。每周五夜里，新股排片表都毫不例外地发布。在发挥融资功能上，刘主席可谓毫不含糊，丝毫不懈怠。\n\n　　令人遗憾的是，刘主席上任后，他心目中从来没有股市的另外三个功能。对资源优化配置、购并重组，不仅不予支持，还竭尽打压、扼杀之能事。对美、欧、日、港、台股市天天上涨、屡创历史新高，视而不见，毫无紧迫感。对经济30年来在全球一枝独秀而股市连年熊冠全球、经济晴雨表遭到抹黑，毫无愧疚感，对股市市值大幅缩水、国有资产大幅贬值，以及广大投资者连年亏损累累、财富被腰斩、甚至许多人痛不欲生，毫无同情感。\n\n　　刘主席为何不想一想，金融危机的发源地的美国、欧债危机发源地的欧洲各国，甚至破产的希腊、冰岛，为何没有通过大量发新股来拯救危机，哪怕美股在21000点高位都很少发新股，而是让股市大涨几倍、屡创新高、千方百计地维护股市牛市延续，来化解危机，带动经济复苏？中国为什么只知道通过加快新股抽血、来支持实体经济、化解金融风险，而不顾、不惜股市一跌再跌，而结果则是金融风险越来越大，实体经济也没有带动起来、股灾却不断发生？\n\n　　难道这不是表明，他把股市的功能扭曲了，缺乏大局观和担当意识，抓了芝麻而丢了西瓜。所以上任仅一年另两个月，就遭到市场广泛的骂声和指责声，是很少见的\n\n　　2、加快发新股真的是为实体经济服务吗？\n\n　　今年以来，每周发行10只以上的新股，已雷打不动。对此，市场惊呼：这种扩容大跃进速度，不仅让其前七任望尘莫及，而且比之所谓的“10送30的高送转全世界没有”，还要“全世界从来没有”。\n\n　　美其名曰：“这是更好地为实体经济服务”。但实际情况又是如何呢？今年前5个月，大小非减持751亿，103家上市公司大股东清仓式减持，大批董监高为了减持而辞职。一大批大小非们，上市才不久，就纷纷卷走了巨资，离开了实体经济。这是对“加快发新股是为实体经济服务”的绝妙讽刺！\n\n　　新股以23市盈率发行，1元成本的原始股就获取了20多倍的利润。加上上市后的10来个涨停，以及10送20，甚至10送30，再经爆炒，便使大小股东们的身价暴涨。如果一年发500只新股，等于是造就了几百个10亿以上的富翁和几千个亿万富翁，为福布斯财富排行榜增添了光彩。\n\n　　严重的问题在于，在大小股东的构成中，很多都是家族成员（兄弟姐妹、岳父岳母、大舅小姨、公公婆婆），还包括七大姑八大姨。一旦到了解禁期，他们就不问三七二十一，坚决减持兑现，把股市当成了提款机和快速致富的场所，把自己的致富建立在1.16亿股民财富被不断吞噬的基础之上。巨额资金落到了富二代手里，便大肆挥霍，甚至转移民到国外，去置地购房。\n\n　　加快发新股的背后是巨量大小非减持，一至三年便暴富。从而加剧了社会的分配不公和两级分化，造成了“中国梦”的变形，破坏了社会的稳定和谐，成了当今社会一个重大的政治问题。\n\n　　更为恶劣的是，大量的民营上市公司争相上市，仅1—3年，巨量大小非不计成本的抛售，一茬又一茬地割广大长期被套的中小投资者的“韭菜”，导致了整个市场价值中枢崩溃，致使解禁快20年，但至今都为维护股市稳定做出巨大贡献、没有减持的央企和地方国企的国有股，今年5个月股价普遍被腰斩，国有资产大幅贬值，严重流失。并使国资改革和供给侧改革，陷于将近一年的中断，严重危害了国家利益。请问，这还能说加快发新股能弥补的损失吗？刘主席负得起这个党中央、国务院的重大政策方针受阻的责任吗？\n\n　　3、新股加速发行果真与股市下跌无关吗？\n\n　　稍有经济和金融常识的人都应该知道的，在商品市场和金融市场，最本质的关系是供求关系。当供不应求时，价格就会上涨；当供大于求时，价格就会下跌。\n\n　　就以快速发新股为例，每周10家，每月40家，一年就是500家，占到了股市总量的六分之一，这显然是超过了正常的扩容速度的大跃进做法，与“唯GDP速度“论，毫无二致。\n\n　　仅27年历史的新兴中国股市，股票数量便达到了3300多家，而具有200年历史的美国股市，至今只有3600家。何况，美国的人均GDP是中国的5倍以上，美国股市的机构投资者占总市值的70%以上，而中国股市的机构投资者只占12%。这种扩容过速，显然超越了中国现阶段的客观条件，违背了经济金融规律。目前的股市，便是遭到了扩容大跃进必然的报复。\n\n　　再说发行新股的结构：首发时，中小盘股的流通股与总股本是25%∶75%，大盘股是10%∶90%，看起来，每周、每月新股的融资额并不大，但是一上市，因盘子小就遭到了市场的爆炒，连续10涨停板以上。1--3年后，另75%——90%的大小非的股份，便以首发10倍以上的价格，抛向市场，股市怎么能不跌？\n\n　　无论是从投资者对新股首发和日后大小非减持的恐惧心理，还是市场遭到的实实在在的抛压来看，新股加速扩容，是股市下跌的直接导因。\n\n　　但是，令人不可思议的是，对新股发行过快，扩容大跃进超越了市场的承受力，超越了市场的存量资金的承受度，从而导致股市下跌这么一个浅显的道理，从刘主席，到权威媒体，竟然一而再、再而三地断然予以否认，一再宣称新股发行加速与股市下跌无关，不禁让人想起极左年代的那首“就是好，就是好，就是好“的歌，未免辱没了人们的智商，让人啼笑皆非！\n\n　　4、资本市场发展的重点是什么？\n\n　　刘主席，包括历届证监会主席，都把资本市场发展的重点放在IPO上。在每年底的总结报告中，谈到“发展”时，就例举IPO家数有多少，融资额有多少，以此作为自己向上级汇报的政绩。而闭口不谈当年四大指数跌多少、市值缩水了多少。\n\n　　正是在这个“发展的重点”上，历届证监会主席都犯了方向性的错误！\n\n　　其实，资本市场发展的重点，最基本、最核心的功能，不是IPO，而是购并重组。\n\n　　我们当然反对虚假的购并重组，更反对操纵市场的购并重组，反对内幕交易的资产重组，\n\n　　但是，推动合理有序的、透明的、高效的购并重组，确实是资本市场的生命所在。\n\n　　中国要建立现代金融，离不开资本市场的发展。资本市场要发展，就离不开购并重组。一旦购并重组被遏制，现代金融最重要的功能——优化资源配置、风险配置、价值再发现、财富管理、资产证券化、民间资本的流动等，就无法进行。这样的资本市场，就必然成为一个死市。\n\n　　刘主席的最大失误就在于：殚精竭虑、一门心思地加快IPO，千方百计、不遗余力地遏制购并重组，去年还颁布了新的《重大资产重组的规定》，便是一个阻扰、刁难、遏制购并重组的错误文件。诸如购买资产不能超过原净资产的100%，严禁跨界购并等。这等于反对企业结构调整、转型升级。还因为有一些投机机构充当了举牌的“野蛮人”，就把全球股市司空见惯的举牌收购废了。把机构投资者中的财务投资者、财富管理者、购并重组者、合理价格的推动者，都一股脑儿地赶出了资本市场。\n\n　　当着全世界股市最有活力、最有魅力、对投资者和新增资金最有吸引力、对提升上市公司业绩最有推动力和效力的购并重组，在中国股市销声匿迹了。目前，广大投资者都视国资改革股、资产重组股为“忽悠式重组”的妖魔，凡是公布重组方案复牌，便什么题材都不管用，什么故事都没人听，一概抛售、连续跌停，便意味着，在监管层对购并重组的错误导向下，中国资本市场已“死”了！\n\n　　5、靠上证50指数能粉饰太平吗？\n\n　　也许刘主席为了证明自己上任后拯救股灾，稳定股市的成绩，以为只要靠国家队集中攻打指数权重最大的五大行（工、农、中、建、招），三大保险（平安、人寿、新华），两桶油（中石油、中石化），以及贵州茅台(447.310, -1.97, -0.44%)，将上证50指数创出新高，就可使上证指数在站3100点之上，高于上任时的2860点、8.5%，就可以装点门面、粉饰太平，向上交差。\n\n　　但是，请别忘了，深成指从10162点——9794点，跌幅3.7%；中小板从10703点——10524点，跌幅1.7%；创业板从2211点——1745点，跌幅21.1%。\n\n　　请别忘了，至本周四，在2720只有可比性股票中，有1600只股票跌破了2638点时价位，有80多只股票跌破了2013年6月熊市1849点价位，可谓血流成河，惨不忍睹！\n\n　　更别忘了，为响应李克强总理“大众创新、万众创业”号召，踊跃投资新兴产业的创业板的广大投资者，今年前5个月，因高送转被扼杀，所持中小创以及主板中的高科技股，普遍跌幅达到惊人的60%——70%。投资国资改革和资产重组的投资者的损失普遍在50%左右。\n\n　　这些实际上的股灾4.0版，却被所谓“漂亮的上证50指数”所掩盖了，使党中央和国务院都看不到股市真实的情况。\n\n　　更需要纠正的是，从管理层到国家队，到公募基金和其他机构，至今仍然对抱团取暖，打造以周期性产业股为主的“漂亮50指数”沾沾自喜，以为这是从美国股市学来的、先进的价值投资理念。\n\n　　但那是邯郸学步，是在美国股市过了时的价值投资理念。当今美国股市领涨的是高科技股，如苹果、亚马逊、思科、特斯拉、谷歌、Facebook、百度、阿里巴巴等，带领了纳指从09年的1265点到如今的6246点，涨幅394%，远远超过传统大盘股为主的道指6490点——21142点、250%的涨幅。中国的国家队和各路机构。为什么不学学这个新理念、新方向、新经验？\n\n　　市场强烈的呼声是：上证50指数不能代表中国股市整体，唯有中证500指数，才能代表占中国股市绝大多数的中小盘高科技股和成长股的面貌。试图用行政力量来给创业板“去泡沫”，是违反股市自由交易原则的错误行为。只要代表新兴产业的创业板不能止跌企稳，那么中国股市就难以走出危机。\n\n　　甚至可以说，本轮股灾4.0版的发生，是上证50指数猛涨所导致的。\n\n　　一二十年股市的实践告诉我们，上证50指数的角色应该是为大盘“搭台”，而主角应该是中小盘高成长股唱戏。包括美国股市的全世界股市都是如此。\n\n　　近段时间，中国股市之所以出现崩塌，就是因为出现了结构性的“角色错乱”：上证50指数由搭台的角色，变成了主角唱戏的角色；而中小盘高成长股则从主角唱戏的角色，被赶到台下，并被打倒在地。颇有点极左年代某阶级领导一切，“封资修”全部是“大毒草”的味道。\n\n　　角色错位必须纠正，股市才有希望。\n\n　　6、股市沉疴何能治？\n\n　　中国股市沉疴已深重，积重已难返。连限制大小非减持的新政都难挽跌势，还有何办法能扭转危机，使中国股市重返慢牛之途？\n\n　　我以为：\n\n　　第一，杜绝新增大小非。即对未来新股的结构，按照现代企业制度进行治理。将大股东的股权由以往的51%以上，下降到不超过33%，改变一股独大，使之成为名副其实的公众上市公司。大股东多余的股权，部分可协议转让给其他的产业资本或机构投资者，部分按发行价作为流通股发行。这样，就能一劳永逸地防止新的大小非减持的毒瘤产生，存量的大小分减持，按新规办理，才能显示其积极作用。甚至老的大小非不再那么急迫地减持。\n\n　　第二，鉴于目前市场广大机构和投资者以及国有股东的财富严重受损，按“两利之中取其大，两害之中取其轻”的原则，将每周发行新股的数量，先由10家减为3—5家，并从严把握新股质量，给股市以休养生息的机会。\n\n　　第三，大幅修改去年颁布的《重大资产重组的规定》，恢复到先前国务院文件所规定的：“除借壳上市外，其他所有的购并重组，一概不需要经过政府部门的审批”，积极鼓励民间资本、各类机构、上市公司、中介进行购并重组，优化资产配置，将之作为提升上市公司质量、激活股市的重要手段。证监会只需加强对购并重组的事中和事后监管即可。\n\n　　第四，国家队应终止对上证50指数的刻意炒作、逆势拉升、抱团取暖的不正常行为，恢复其正常的波段运行技术走势。全面充当股市平准基金的角色，把主要精力放在维护中证500指数上。如周五下午，尽管上证50跌了0.84%、沪深300跌了0.32%，但由于中证500指数从5655点上涨到5772点，涨幅超1%，致使上证指数、深成指、中小板、创业板全面翻红，分别涨0.09%、0.66%、0.74%、1.01%，两市个股的涨跌比908∶283、1415∶308，黄线元远远高于白线，恢复“八二现象”，维稳效果反而显著。\n\n　　至本周末，大盘指数已经连续5天站在五周均线之上，发出了有空头市场转为多头市场的信号。\n\n　　但愿下周国家队能再接再厉，继续维稳中证500指数，通过结构性个股行情，将股市引入慢牛轨道。大盘能逐步去收复3295点见顶以来留下的3189—3196点、3229点——3238点两个跳空缺口。至少先补掉一个。 \n"
		},
		{
			"post_id": 4,
			"title": "indicators of first stress",
			"date_published": 1496795934.816,
			"body": "1. fall of price of most stocks by 30%;\n30% is a syche landsmark for the first 30% of people, these people doom to lose their money in the cock market; they mistakenly bought way earlier in the fuking cock market, they do not know the nature of the cock, they blindly follow, easily influenced by the people and experts who care to say and write about things. some of them are simply bored, has too much money, taking money less serious than others. these are the first 30% people who doom to lose their money in the cock market.\n2. the voice of the people\nthis is a reliable indicator of the coming of stress."
		},
		{
			"post_id": 3,
			"title": "it normally takes n-strike to reach the point of first stress",
			"date_published": 1496795914.721,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "first stress is not just first strike, no matter how big the strike is",
			"date_published": 1496795894.727,
			"body": "Blog post body"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}