{
	"title": "Записки из Усть-Неры",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1550370063,
	"post": [
		{
			"post_id": 8,
			"title": "Зима",
			"date_published": 1550363611.128,
			"body": "Зима в Усть-Нере - очень тревожное состояние... Вроде всё тихо и спокойно, но в случае чего ситуация развивается молниеносно. Так, за 1,5-2 часа можно полностью заморозить посёлок с полоповшимися магистральными и потребительскими сетями водоснабжения и теплоснобжения. Про канализацию я вообще молчу - с ней вечная беда... Поэтому на любую тревожную ситуацию приходится реагировать быстро, и местные более-менее крупные организации это понимают.\n\nДень в посёлке выглядит примерно так:\n\n![IMG_20190217_094116.jpg (800x600)](data/img/post_8_IMG_20190217_094116.jpg)\n\nТуман наблюдается при температурах ниже -40 градусов цельсия... Данный кадр сделан при -50\\. Если температура опускается до -64, то с видимостью становится совсем печально. Туман - это вымерзающая влага. Вымерзает буквально всё. Воздух очень сухой и кислорода явно не хватает.\n\nСнег здесь очень сухой и грязный. И его почти нет. Из этого снега не слепишь снежок или снежную бабу. Он как сахар и совсем не клеится. грязный он из-за пепла котельных. Даже если припорошило свежими 5 мм снега, через 2-3 суток он становится тёмным от пепла. Если пнуть какую-нибудь не тронутую кучку. то чётки видны слои светлого и тёмного снега - это периоды между осадками. Осадков здесь кстати как-таковых не бывает. Снежок зачастую образовывается из-за опадающего тумана.\n\n![IMG_20190217_094232.jpg (800x600)](data/img/post_8_IMG_20190217_094232.jpg)\n\nВся растительность покрыта инеем. Каждая травинка, каждая веточка дерева. Выглядит это примерно так:\n\n![IMG_20190217_094251.jpg (800x600)](data/img/post_8_IMG_20190217_094251.jpg)"
		},
		{
			"post_id": 7,
			"title": "Говнянная соляра на Сусумане и -52",
			"date_published": 1544337912.941,
			"body": "На трассе \"Колыма\" зимой не до шуток. Температура на протяжении всего пути легко опускается ниже -40\\. При таких температурах и отсутствии на ближайшие 300-400 км населенных пунктов и больниц, передвигаться весьма рискованно. Здесь нельзя к чему-то не подготовиться или что-то забыть/не уметь - иногда такое стоит жизни.\n\nДвинулись мы как-то на УРАЛе вахтовке в командировку, а далее возвращались назад в Усть-Неру.\n\nМашина выглядела примерно так:![222.jpg (1200x900)](data/img/post_7_222.jpg)\n\nМежду пгт. Ягодное и г. Сусуманом в 2 часа ночи у нас начало падать давление, вырабатываемое компрессором и пропала основная система торможения... Остановка среди ночи на первом же пятаке... На улице -38 градусов. 20 минут поиска утечки воздуха и обнаруженный разорванный шланг не далеко от компрессора был отремонтирован путём укорачивания до места разрыва.\n\nБлиже к г. Сусуману была плановая заправка солярой. Заправились и поехали... К утру (после проезда Кедрового) автомобиль стал глохнуть и... заглох. На улице -43... Сразу выключаем печку, чтобы не посадить аккумулятор. В кунк заскакивает водитель и каким-то чудом заводит автономную тепловую пушку Webasto, работающую от солярки. Она немного начинает нагнетать тепло, её явно не хватает, но это точно не даст замерзнуть пока горит. Поиск места замерзания топлива занял 2 часа! Два часа при -43 это довольно долгие два часа... Что такое -43? Это когда выносишь топливный шланг и через 25 секунд его уже не стоит сгибать. Мозг начинает работать очень быстро... В ход идут любые идеи и материалы. Помимо автономного подогревателя у нас в кунке была буржуйка, запас угля и дров на первое время.\n\nСливаем с бака ведро соляры, поджигаем её, ставим под топливный бак, чтобы нагреть его содержимое. Топливо залитое на АЗС близ Сусумана оказалось с водой. Перемерзла помпа перед фильтром грубой очистки. Помпа перемерзла намертво и не качалась даже вручную. Провели замену всех фильтров, оказывается на УРАЛе их довольно много. При таком морозе пропитывание фильтров соляркой вызывает непередаваемые ощущения. Начали отогревать помпу газовой горелкой, газ в баллоне быстро остывает и горелка перестаёт гореть... Из вскрытой помпы хлынула замерзшая вода... Каким-то чудом завелись...\n\nПоехали! Настала ночь... Не доезжая до п. Артык 5 км машина опять заглохла. На улице -52 градуса. Солярка в ведре уже просто на просто не горела. Смоченная тряпка загоралась, но сама соляра в ведре даже не пыталась гореть при такой температуре. Причиной была всё та же помпа, находившаяся в шоке от попавшей в неё воды. В этот раз справились быстрее... Отогрели помпу газовыми баллонами. Но это не передаваемый экстрим, когда ты в прямом смысле борешься за выживание. Многие действия становятся автоматическими. При слаженной работе команды гораздо больше шансов на выживание.\n\nНа трассе не всегда есть машины, да и не все её участки имеют хоть какую-то интенсивность движения. Поэтому нужно быть готовым ко всему и лучше иметь спутниковый телефон, но даже при его присутствии вам никто быстро не поможет!"
		},
		{
			"post_id": 6,
			"title": "Полезное мясо.",
			"date_published": 1544335493.187,
			"body": "Настало время забоя разного зверья... Из разных улусов (сёл) местные жители везут мясо. Везут в основном жеребятину и оленину.\n\nЭто именно то полезное мясо, которое можно и нужно есть. Местные фермеры выращивают жеребят и оленей, которые питаются естественными кормами в т.ч. мхом, которого здесь ОЧЕНЬ много. Чем питаются жеребята я точно не знаю, но про подкормки, антибиотики и прочие медикаменты, с помощью которых из животных делают бройлеров, здесь даже не слыхивали, не говоря о том что привезти это всё сюда стоит непомерных денег. Живность, выращенная здесь является самой натуральной и экологически чистой, потому что фермерство здесь не знает о том что такое прогресс и весьма первобытно.\n\nЗабой скота ведется когда наступают холода. Как только температура опустилась до -40 - это самое время - туши очень удобно хранить и транспортировать. Фермеры не заморачиваются распиливанием туш на мелкие куски. Продают или целыми оленями или четвертинами туши (ляхи, рёбра). Цены умеренные (400-650 руб/кг.). Различные потроха и внутренности достать сложнее - местные их очень ценят. Например одна печень оленя стоит 2000 руб. за штуку. Из неё можно делать строганину, но я не любитель...\n\nИногда в местных магазинах можно найти оленину кусками, но немного дороже и такое бывает редко.\n\nСегодня при -40 пилили двух оленей - это обычное явление для Усть-Неры. Туши удобно хранятся в контейнере всю зиму.\n\nЖеребятина несколько жирнее и нежнее, оленина суше. Мяса в олене не так уж и много. Много костей и сухожилий. Это не те бройлеры говядины или свинины, которыми наводнены магазины. Некоторые вообще считают оленину \"лечебным мясом\". Не знаю правда ли это, но иногда позволяю себе отужинать местную дичь."
		},
		{
			"post_id": 4,
			"title": "Зима близко",
			"date_published": 1541200304.49,
			"body": "Зимой в Усть-Нере довольно мало снега. Да и тот который есть не пригоден для лепки снеговиков и даже снежков. Его очень мало и он больше напоминает сахар, валяющийся под ногами, только более легкий и не сладкий.\n\nПосле выпадения снега, буквально через пару дней, он весь покрывается серым налётом - пеплом с котельных. Котельных в Усть-Нере множество. Фильтров на них как правило нет и уже в -20 они начинают коптить довольно сильно. Кидают в котлы всё в подряд, начиная от низкокачественного (сильно коптящего) угля и заканчивая бумажной макулатурой и прочим. Пепел валяется везде и даже свежий лёд на ручье из скользкого, быстро превращается в какое-то не понятное не скользящее покрытие.\n\nКстати, если говорить о скользкости, то в этом удивительном и не большом посёлке подскользнуться можно очень много где. Все привычные нам материалы: бетон, кафель, плитка, линолиум и резина при сильно пониженных температурах резко теряют не скользящие свойства. Здесь нет гололёда, но если заходя в помещение неосторожно околевшей подошвой наступить на околевший бетон или линолеум, то можно исполнить пару элементов фигурного катания и отправиться в больницу с переломом чего-нибудь."
		},
		{
			"post_id": 3,
			"title": "Федеральная автодорога Колыма или Красота и ужас",
			"date_published": 1540723906.764,
			"body": "Немного расскажу о том как я добирался до Усть-Неры...\n\nФедеральная автомобильная дорога Р504 «Колыма́» (прежний индекс — М56) — действующая автодорога федерального значения между Якутском и Магаданом протяжённостью 2032 км, из которых 1197 км проложено по территории Республики Саха (Якутия), 835 — по Магаданской области. Дорога имеет также историческое название — Колымская трасса, под которым она известна в литературе и СМИ.\n\nМне пришлось проехать по ней из города Магадана до находящегося практически ровно посередине поселка Усть-Нера Оймяконского района Республики Саха (Якутия). Оймякон является полюсом холода - это одно из холоднейших мест России и вообще нашей планеты. Зимой температура легко доходит до отметки -65 градусов Цельсия. Но пока не об этом.\n\nВвиду тяжелых климатических условий и отдалённости от цивилизации, находясь в условиях вечной мерзлоты (когда эксаватор не может прокопать ковшем глубже одного метра земли даже летом) дорога находится в не лучшем состоянии, а во многих местах очень опасна. Асфальт на ней отсутствует почти полностью. Участки грунта постоянно меняют свою высоту из-за вечной мерзлоты. Любое передвижение по ФАД \"Колыма\" это испытание для людей и техники.\n\nДорога представляет из себя \"грунтовку\". Она постоянно разбивается и её регулярно отсыпают и выравнивают так называемой \"оптималкой\" (смесь песка и дробленного до очень мелкого состояния скальника), но любые работы осложнены гигантскими расстояниями и тяжелыми климатическими условиями. ФАД \"Колыма\" - это 2032 км практически без цивилизации. Т.е. у вас нет никакой сотовой связи, больниц, мед. пунктов и мест обогрева. Всё это конечно встречается, но чрезвычайно редко.\n\nИз Магадана мы выехали не очень рано. Ехали ещё до выпадения первого снега... Но здесь не знаешь чему радоваться... Летом очень сильно осложняет движение пыль от проходящих тягочей, да и вообще от любого транспортного средства. В практически безветренную погоду она стоит часами над трассой.\n\n![IMG_20180818_200249.jpg (640x480)](data/img/post_3_IMG_20180818_200249.jpg)\n\n![IMG_20180818_193504.jpg (640x480)](data/img/post_3_IMG_20180818_193504.jpg)\n\nОпытный водитель едет со скоростью 40-60 км/ч, изредка разгоняясь до 80 км/ч на небольших участках дороги. Дорога не прощает высокую скорость, гвозди валяются по всей трассе, а колесные шпильки не редко ломает и колеса улетают в кувет - на большой скорости не будет времени на остановку автомобиля. Комфортабельный современный джип здесь создает только иллюзию безопасности.\n\nФуры движутся ещё медленнее - их скорость 40 км/ч, от них стоит огромная непроглядная пыль и их обгон это опасное для жизни мероприятие. Последствиями от таких аварий во время обгонов, на дороге стоит множество памятников по обочине. До ближайшего посёлка как правило сотни километров и помощи не будет ни через час ни через 2 часа... Сотовая связь отсутствует практически на всём участке автодороги, появляясь лишь возле немногочисленных посёлков или на единичных стационарных местах экстренного обогрева.\n\n![IMG_20180818_164634.jpg (640x480)](data/img/post_3_IMG_20180818_164634.jpg)\n\n![IMG_20180818_165320.jpg (640x480)](data/img/post_3_IMG_20180818_165320.jpg)\n\n![IMG_20180818_165518.jpg (640x480)](data/img/post_3_IMG_20180818_165518.jpg)\n\n![IMG_20180818_165310.jpg (640x480)](data/img/post_3_IMG_20180818_165310.jpg)\n\nТаких мест обогрева можно пересчитать по пальцам на одной руке на расстоянии до 500 км от Магадана, а дальше - не большой посёлок Ягодное и не большой город Сусуман, а после 650 км цивилизации уже почти нет.\n\nИзредка встречаются \"мёртвые\" посёлки, численность жителей которых равна нулю или составляет не более нескольких жителей. Разваленные строения, бензохранилища и когда-то жилые дома оставляют мрачные впечатления. Жизнь есть только на участках золотодобычи и в располагающихся на не большом расстоянии городе Сусумане и поселке Ягодное.\n\n![IMG_20180818_135641.jpg (640x480)](data/img/post_3_IMG_20180818_135641.jpg)\n\nИзредка встречаются \"дорожники\" равняющие и отсыпающие дорогу. Удивительно их видеть когда до ближайшего населённого пункта более 200 километров очень пыльной и неблагоприятной дороги.\n\n![IMG_20180818_154200.jpg (640x480)](data/img/post_3_IMG_20180818_154200.jpg)\n\n![IMG_20180818_154225.jpg (640x480)](data/img/post_3_IMG_20180818_154225.jpg)\n\n![IMG_20180818_143235.jpg (640x480)](data/img/post_3_IMG_20180818_143235.jpg)\n\nПри всём при этом трасса очень красива. По пути встречаются красивейшие и опасные перевалы и конечно же река Колыма.\n\n![IMG_20180818_203006.jpg (640x480)](data/img/post_3_IMG_20180818_203006.jpg)\n\nОсенью трасса особенно красочна и придорожные деревья окрашены в яркие цвета.\n\n![IMG_20180908_110017.jpg (640x480)](data/img/post_3_IMG_20180908_110017.jpg)\n\n![PANO_20180908_110053.jpg (1200x309)](data/img/post_3_PANO_20180908_110053.jpg)"
		},
		{
			"post_id": 2,
			"title": "Полюс холода или одно из самых холодных мест на Земле",
			"date_published": 1540723687.476,
			"body": "Посёлок Усть-Нера Оймяконского района Республики Саха (Якутия) является районным центром и одним из холоднейших мест на Земле.\n\nПо данным 2017 года в посёлке проживает 5434 человека. Однако фактически история с населением здесь немного другая. Часть населения проживают не здесь, а в более тёплых районах страны, но зарегистрированы в Усть-Нере чтобы получать более высокую пенсию. Большая часть населения в летний период уезжает в длительный отпуск. Обычно он составляет не менее 52 дней, но когда люди берут отпуск за 2 года - они пропадают из посёлка аж на 104 дня. В посёлке очень много сезонных работников, работающих по направлению золотодобычи. Золото здесь везде. Чтобы мыть золото даже временами сдвигают с места (перекладывают участками) федеральную автодорогу Колыма и линии электропередач, т.к. под ними ещё не велась промывка золота. В посёлке много выходцев из стран СНГ... Занимаются они всем в подряд в т.ч. и манипуляциями с золотом.\n\nЛетом в Усть-Нере температура доходит до +40, а зимой опускается до -60\\. Преобладают очень большие амплитуды температур. Ночью -20, а днем +7 - это норма в осенне-весенний период.\n\nЗдесь мне придётся жить какое-то время... Постараюсь рассказать Вам немного о местных реалиях..."
		}
	]
}