{
	"next_post_id": 37,
	"next_comment_id": 3,
	"next_follow_id": 47,
	"avatar": "jpg",
	"user_name": "Ztmscr",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "🇺🇦",
	"post": [
		{
			"post_id": 1,
			"date_added": 1533489193,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1533749724,
			"body": "Space Jam (Space paste)\n\nThis is an interesting mix of legal herbs that is said to produce a very serious psychedelic trip. It's called \"Space Jam\" and \"Space Paste\". This recipe is all over the place with different names and even appears on Erowid.\n\n4 parts nutmeg (ground from whole nutmeg)\n4 parts almonds (soak overnight and rinse)\n4 parts raw pistachios\n2 parts cinnamon\n1 part cumin\n1 part tarragon\n1 part oregano\n1 part basil\n1 part turmeric\n1/2 part cayenne pepper\n1/2 part black pepper\nmaple syrup (to taste)\n\nGrind all the dry ingredients into a very fine powder. Add syrup and mix. About 2 tablespoons makes a \"decent dose\".\n\nAll ingredients need to be present. It’s said that if any one of the herbs are omitted, it doesn’t work well. \n\n1 part=1 tablespoon\n\n",
			"date_added": 1533749722,
			"meta": "{\"img\":\"900,503,210311022000522632321221111533223133334344043,00123345678108281933AA82A3BCC3CA82A3BCC3CB2BA81906DBEB838001\"}"
		},
		{
			"post_id": 1533749798,
			"body": "NOTE: The space paste recipe has been out for some time, and I have been doing a lot of research into how it works and why it works. Currently, I don't claim to have all the answers, and unless someone reading this post DEVELOPED the recipe, I don't know if any of us will ever have the full story. See the space paste thread for details on how I developed these theories. I will be the first to admit that there may be conflicts between my posts in the space paste thread and here, but I am in a different place of research now, and I have integrated what I have learned along the way (offline), so bear with me. ALL CONTRIBUTIONS ARE MOST WELCOMED - the Human Genome Project was a success because of online collaboration with all kinds of people, and I hope this space paste/space booze project will have similar success with collaboration.\n\nNow a way to try space paste without eating 2 tablespoons of spices! The procedure is ridiculously easy. This creates a high proof alcoholic beverage with hallucinogenic properties. This recipe is legal on most locations; if nutmeg is illegal in your area, this recipe would be illegal as well. It is up to each individual to research the laws of your area to determine if all ingredients are legal to use.\n\nTHEORY:\nSpace paste has been tested by many individuals with good results. However, there are 2 things about the space paste experience that most individuals report as difficult:\n\n1. Space paste can last upwards of 30 hours. This makes it impractical in certain \nsituations.\n2. Space paste does not taste good. It is hard to eat the stuff and many are turned off \njust because of this aspect of the experience.\n\nThe chemical compounds that produce psychedelic effects in nutmeg are part of the volatile fraction of nutmeg oil, and they are all soluble in ethanol. Nutmeg oil comprises about 2% dry weight of the nutmeg kernel. When ingesting the whole spice, many unpleasant effects have been reported including gastric pain, lethargy, and flu-like symptoms. It is not known if this is due to the hallucinogenic components of nutmeg or to other components in the spice. Anecdotal reports suggest that the essential oil of nutmeg, when ingested, produces an experience with many less side effects than ingesting the whole spice. The author therefore theorizes that extracting the ethanol-soluble, hallucinogenic fraction from the whole spice will produce a more pleasant experience.\n\nWhy not just extract nutmeg, without the other ingredients in space paste. This experiment was conducted by the author. It worked, but it was found that a lot of extract was needed to achieve psychedelic effects. Space paste has been shown in numerous trials to be effective at increasing the potency of nutmeg, thus allowing the user to experience its effects at a lower dose. 2 tablespoons of space paste contain about 1.5 teaspoons of nutmeg, and yet the experience is powerful; 1.5 teaspoons of nutmeg produces a much less pronounced effect. Therefore, the author theorizes that extract of space paste will produce a more pronounced experience than a straight nutmeg extract.\n\nMATERIALS:\n1 750mL bottle of high proof ethanol (at least 75.5% ABV) - it must be consumable (no \ndenatured ethanol)\n1 batch of modified space paste. Follow the space paste recipe, but DO NOT ADD almonds, pistachios, or maple \nsyrup. The nuts will rot and ruin your product. The maple syrup is extremely viscous \nand makes extraction more difficult. Use 1 part = 1 tablespoon.\nNote (edit): I've noticed two types of nutmeg. One is a sandy brown color; do not use this one. The other is more of a reddish/gold color. This is the one you want for your space paste. The sandy brown one does not work well, and often makes me sick.\n\nPROCEDURE:\nMake the space paste, leaving out the almonds, pistachios, and maple syrup from the recipe. Mix the entire batch of space paste with 750mL of high proof ethanol, in a glass or stainless steel container with a tight fitting lid; if you use plastic or metals other than stainless steel, the ethanol may extract unwanted and potentially toxic byproducts from the container during extraction!. \n\nIn my location, the highest alcohol concentration available is 75.5% ABV, and it worked fine. Experiments with 50% ABV vodka resulted in a rather weak final product. If higher proof alcohol is available, it may potentially yield a stronger product. I don't have enough experience with making the stuff to tell where the diminished returns start.\n\nNext, shake the mixture for a while. How long? A while - maybe 5 minutes. Now look - you'll see that the entire mixture is extremely cloudy. If you leave it sit, though, in about 15 minutes it will have separated into two layers. The top layer is what we want, and it will be the ethanol which has now been colored a dark reddish color. The bottom is all the solids, which we don't want. Repeat this shaking and settling procedure for 3-5 days, shaking whenever you remember and then letting the mixture settle.\n\nAfter 3-5 days, you can drink it. Actually you can try it earlier, but it's much better after 3-5 days. I did not notice a significant difference after that point.\n\nDOSE RECOMMENDATIONS:\n2 tablespoons of space paste is pretty strong, in my opinion. You get really high, and it lasts a long time. The question is how much booze = 2 tablespoons of paste? Well, let's do some quick math: if we assume that the strength of 2 tablespoons is the desired dose and we assume a full extraction, then a batch of space paste has 6 total doses, so if we divide 750mL by 6 we get 125mL.\n\nOK - don't drink 125mL of high proof ethanol! This might kill you, or at least make you extremely drunk AND trip, a dangerous combination. But a few more things to consider. The human digestive system does not fully extract all the oils from what we eat. Some of it stays in the food being digested and is excreted. So to say that 2 tablespoons of paste are completely absorbed is probably wrong. Additionally, ethanol is miscible with water, which is why it can pass the blood brain barrier even though it is not oily - it's called the Trojan Horse effect in a lot of the literature because the ethanol is sneaking into the brain by mixing with water. This will allow a lot of the space paste oils to be carried along with the ethanol to the brain, and then to be readily accepted across the blood brain barrier due to their high lipidity. So it would make sense to say that less will go further with our recipe.\n\nMy recommendation is to drink one shot of the space booze to start, about 1.5 oz or 45mL. I drank one shot and was pleasantly surprised to feel effects THE ENTIRE DAY. If you've ever taken space paste, I would say it was about 25% less intense than 2 tablespoons of straight space paste. I woke up the next day with no residual effects. I have tried it 5 times, every time with the same experience. I have not yet increased the dose, so if you do, let us know.\n\nEffects begin for me right away, but pronounced effects begin after about 4 hours. Each person's body is different, though. Happy spacing.\n\nSource: www.dmt-nexus.me",
			"date_added": 1533749795
		},
		{
			"post_id": 1533942600,
			"date_added": 1533942596,
			"meta": "{\"img\":\"900,506,375434511632323234201000514603625813447377924344,012222234512267762848967777624AB27777628CBB9626681D3EBBB883F\"}"
		},
		{
			"post_id": 1533942649,
			"body": "",
			"date_added": 1533942644,
			"meta": "{\"img\":\"900,506,446533324632943665d73d64a62524644622715734752753,0123443210052678615099A6886A99BC36776ACC4D386683D4B113EF311B\"}"
		},
		{
			"post_id": 1533942672,
			"body": "",
			"date_added": 1533942666,
			"meta": "{\"img\":\"900,570,524234442568bbca7898a34637517928a955645658935435,01213445657713544653889A644463BB55BB6433BBBBC565CDBBEEEEB3F1\"}"
		},
		{
			"post_id": 1533958108,
			"date_added": 1533958101,
			"meta": "{\"img\":\"900,506,000011122022133123245144355255,010231234101111565730012258440115311159011100011511001000271\"}"
		},
		{
			"post_id": 1533958126,
			"body": "",
			"date_added": 1533958118,
			"meta": "{\"img\":\"900,506,a999a96a97899abcbbabb8877877a97aaaaa9aa,012344321051366663157896AA69877896AA69875136666315BC236632CB\"}"
		},
		{
			"post_id": 1533958144,
			"body": "",
			"date_added": 1533958135,
			"meta": "{\"img\":\"900,600,33934956c45b44a34b46c33834a45a22722655a,001234210056417714658297777925A73BCCB37A869777792856407704650012442100\"}"
		},
		{
			"post_id": 1533958161,
			"body": "",
			"date_added": 1533958151,
			"meta": "{\"img\":\"900,650,441331245479658647844622453a82831a62aa3535573384,012345561710846666511917AB9B421AA6BB9911186844BC881DD10D5EF2115D775E81\"}"
		},
		{
			"post_id": 1534040386,
			"body": "Lifehacks\nFree alcohol\n\nИнгредиенты:\n\nмед – 300 грамм;\nвода – 2 литра;\nсухие дрожжи – 1 чайная ложка (или 25 грамм прессованных);\nшишки хмеля – 5 грамм;\nкорица и мускатный орех – 1 щепотка.\nВсе ингредиенты доступны, затруднения могут возникнуть только с шишками хмеля. Они продаются почти в каждой аптеке, так что и это не проблема. Дрожжи можно брать любые, например, для выпечки хлеба.\n\nТехнология приготовления медовухи\n1. Выбор меда. Один из самых важных этапов, от которого во многом зависит качество готового напитка. Старайтесь подбирать самые ароматные сорта. Отлично подходит гречишный мед, но можно взять другой, например липовый.\n\nВесной многие пасечники предлагают свежий жидкий мед, но если плохо разбираетесь в пчеловодстве, лучше отказаться от покупки. Есть риск, что вместо натурального продукта дельцы продадут суррогат из сахара или же сам мед будет низкого качества. С подобного сырья никогда не получится вкусной домашней медовухи.\n\n2. Растворение меда в воде. Налить воду в эмалированную кастрюлю, довести до кипения. Добавить в кипяток мед, постоянно перемешивая ложкой. После 4-5 минут кипячения медовой смеси на поверхности начнет появляться белая пенка, которую нужно аккуратно собрать ложкой.\n\n3. Внесение вкусовых добавок. После того как пена удалена, добавить в смесь другие составляющие: корицу, мускатный орех и хмель, которые придадут напитку оригинальные вкусовые нотки. После тщательного перемешивания кастрюлю снять с огня.\n\n4. Подготовка к брожению. Смесь охладить до 25-30°C (очень важно) и добавить разведенные дрожжи. Если сделать это при более высокой температуре, дрожжи погибнут, и брожение не начнется.\n\nПеренести кастрюлю с медовым раствором в темное место с температурой около 25°C. Если отдельного помещения нет, можно воспользоваться аквариумным нагревателем. Чтобы избежать попадания в сусло сторонних веществ и насекомых (летом особенно достают мухи), рекомендую обвязать кастрюлю марлей.\n\nЧерез 1-2 дня появятся признаки брожения: на поверхности смеси начнет образовываться пена, будет слышно шипение. Содержимое кастрюли перелить в емкость для брожения, установив на горлышке медицинскую перчатку с дырочкой в пальце или водяной затвор. \n\n5. Брожение. Как правило, брожение медовухи длится 4-6 дней. Об окончании процесса свидетельствует сдувшаяся перчатка или длительное отсутствие пузырей, выходящих через гидрозатвор. Еще один метод проверки – поднести к поверхности жидкости горящую спичку, которая не должна потухнуть. Бояться нечего, крепость напитка всего 5-10 градусов, он не загорится.\n\n6. Фильтрация и разлив. Заключительный этап приготовления. Медовуху осторожно перелить в другую емкость, оставляя осадок на дне, затем процедить через несколько слоев марли.\n\nГотовый напиток разлить в бутылки (стеклянные или пластиковые), плотно закупорить и перенести в холодильник или подвал. Я не сторонник хранения алкоголя в пластиковой таре, но в данном случае это безвредно. Крепость медовухи низкая, поэтому спирт не будет взаимодействовать с пластиком. Пиво же продают в таких бутылках. Медовуху можно пить практически сразу после приготовления, но рекомендую настоять 3-5 дней и только после этого пробовать на вкус.",
			"date_added": 1534040375
		},
		{
			"post_id": 1534040409,
			"body": "",
			"date_added": 1534040397,
			"meta": "{\"img\":\"900,506,666888555544877766655444aa9bbb777,011223241056427724250007777000762622020720780683022609A59022\"}"
		},
		{
			"post_id": 1534040426,
			"body": "",
			"date_added": 1534040413,
			"meta": "{\"img\":\"900,506,110211221233331232342552532444773642784542432454,0012345111011267211011489A4441214B9CD481115EEFE4411122565112\"}"
		},
		{
			"post_id": 1534040442,
			"body": "",
			"date_added": 1534040428,
			"meta": "{\"img\":\"900,504,000222244621531841951420322158534135200147811400,001234556700829A5644118A23554718A8B82387CC180BDEEC0081001FC1\"}"
		},
		{
			"post_id": 1534040456,
			"body": "",
			"date_added": 1534040441,
			"meta": "{\"img\":\"900,581,333332443554222433543564122322665223674,000110232204445607778490AB6277899560540089941542C38888881777\"}"
		},
		{
			"post_id": 1534040469,
			"body": "",
			"date_added": 1534040453,
			"meta": "{\"img\":\"900,506,48a54a849748459469957965956549975885786776649867,0112232114536677886396ABCCCDD6E67ACCA8F353368666395493393114\"}"
		},
		{
			"post_id": 1534040487,
			"body": "",
			"date_added": 1534040470,
			"meta": "{\"img\":\"900,499,212533744954a65734b857665687774364576999877aa644,001111110001234443500267787930149A88BC611334DED62001115FF500\"}"
		},
		{
			"post_id": 1534041732,
			"date_added": 1534041713,
			"meta": "{\"img\":\"393,700,423788cedcca568543456332101401733986865655b97ba8,012234056708088998887A5A8000770001B58CBB3D85E07085F0008DFD00\"}"
		},
		{
			"post_id": 1534043928,
			"date_added": 1534043907,
			"meta": "{\"img\":\"900,576,111211643654432443843732864332986532421853,001232410005678876901372AA272192328872BC52B76D7BB9B24CBBC9B4\"}"
		},
		{
			"post_id": 1534043959,
			"body": "",
			"date_added": 1534043937,
			"meta": "{\"img\":\"882,700,102113224446558668336447557335,00112211110123454611027784553117437547811588473682247687996219226322101111221100\"}"
		},
		{
			"post_id": 1534044035,
			"body": "",
			"date_added": 1534044012,
			"meta": "{\"img\":\"556,700,311422752532755643633544763874432652773662a62c83,00011011023043013567551116689711AB7CB311A32B5310D1A25510BAA557EBAB7771F217AA7AAA\"}"
		},
		{
			"post_id": 1534044102,
			"date_added": 1534044078,
			"meta": "{\"img\":\"700,700,00112324588aa76779755a54833da8edc53458b2784abbcd,011222220011345445110546556751156588565209799A979215478B35412C4B6664C1DE34534FDD2DEFFFFCDD0012222100\"}"
		},
		{
			"post_id": 1534044119,
			"body": "",
			"date_added": 1534044094,
			"meta": "{\"img\":\"900,506,645857978a89b9a878535a9a8897785676794572259ab236,01233345061572223310584855289A98788988B9A978888BACDCC988EBFD\"}"
		},
		{
			"post_id": 1534243099,
			"body": "",
			"date_added": 1534243073,
			"meta": "{\"img\":\"467,700,643773553752842862a82465642664443776332442532,0011122345667221389177153317AB516027C90AC7A2848AAADD8EEAAAA4AAAAAA1AAA\"}"
		},
		{
			"post_id": 1534243114,
			"body": "",
			"date_added": 1534243087,
			"meta": "{\"img\":\"900,600,533644334646736223554654a83b95778a78877567666,0122203430056727220013897A65245257BCCA52D37E737623422663022230262D2773\"}"
		},
		{
			"post_id": 1534243128,
			"body": "",
			"date_added": 1534243100,
			"meta": "{\"img\":\"827,700,421611542211732724a43752666773935882c33979aa3234,0102034522044400644004789599A204B2CC72A01960DC18E71772AC42B7025F8762243030FF0F22\"}"
		},
		{
			"post_id": 1534243146,
			"body": "",
			"date_added": 1534243117,
			"meta": "{\"img\":\"900,506,001104513625326318838848a6a21731532a83a97b74b637,01112341101156787491ABC8DD88B9ABE88D8EB90A46CCFB91001A4A1100\"}"
		},
		{
			"post_id": 1534243161,
			"body": "",
			"date_added": 1534243131,
			"meta": "{\"img\":\"900,506,621722551523432555476354332853212421244937846756,01233435673480133940A3AB3B3B00C5C44B3B4B755BBBBBBBDEF8A3348B\"}"
		},
		{
			"post_id": 1534243179,
			"body": "",
			"date_added": 1534243148,
			"meta": "{\"img\":\"700,700,004317449639a6eb9d76b999a77659caeb86755876953821,0001231000003455630003427899302A7BCCB7A1148DEFC8433687FFD89114DBEEB74103578B659000946949010001331000\"}"
		},
		{
			"post_id": 1534243193,
			"body": "",
			"date_added": 1534243161,
			"meta": "{\"img\":\"900,504,049177383761841951871492039284731641059178961223,0123456718096ABB469CD2EBFFB52DD2EBFFB52DC964BBA69C8176543710\"}"
		},
		{
			"post_id": 1534243210,
			"body": "",
			"date_added": 1534243177,
			"meta": "{\"img\":\"900,674,246265655487958669598676866747ac79a8b86ba748b6ba,01102201314567887659AB577775CD7777557777DC877775BA95E7887654EFE18C1EFE\"}"
		},
		{
			"post_id": 1534243224,
			"body": "",
			"date_added": 1534243190,
			"meta": "{\"img\":\"900,504,103112214431121223114421111001314221641321,012344351606789987600A790097A00AB8008BA002C8998C20005DBBD560\"}"
		},
		{
			"post_id": 1534243241,
			"body": "",
			"date_added": 1534243206,
			"meta": "{\"img\":\"525,700,464743554665658378945b66435356987775964838587d57,012345451261474321389AB30244C4BBD6CC77A20E76F4AD62440402D43474492334E430164B0488\"}"
		},
		{
			"post_id": 1534243263,
			"body": "",
			"date_added": 1534243227,
			"meta": "{\"img\":\"700,700,632663853884557667222842436101878622b73675a94bb4,00121343356706486414220689666166886A61680062B91C0D90E3CF3D64600077801416686908018660610D4481006D0018\"}"
		}
	],
	"post_like": {
		"1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik_1507267856": 1533527043,
		"173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh_1525209675": 1533741244,
		"1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT_1514370844": 1533885238,
		"1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT_1513613777": 1533885339,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533927764": 1533942299,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918908": 1533942303,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918901": 1533942305,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918890": 1533942308,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918877": 1533942310,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918865": 1533942316,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918849": 1533942323,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918840": 1533942328,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918833": 1533942333,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918821": 1533942338,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918809": 1533942343,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918715": 1533942357,
		"17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi_1533918673": 1533942382,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1534042982": 1534044181,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1534807052": 1534863353
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "no(((",
			"post_uri": "1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG_1534043928",
			"date_added": 1534100590
		},
		{
			"comment_id": 2,
			"body": "@Tommykakashi: :)",
			"post_uri": "1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG_1534040386",
			"date_added": 1534863314
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K",
			"user_name": "Thunder",
			"date_added": 1533489854
		},
		{
			"follow_id": 2,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL",
			"user_name": "Realjohndoe",
			"date_added": 1533489878
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1533489931
		},
		{
			"follow_id": 4,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
			"user_name": "ZeroLSTN",
			"date_added": 1533489972
		},
		{
			"follow_id": 5,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u",
			"user_name": "Lola",
			"date_added": 1533490052
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi",
			"user_name": "Eibriel",
			"date_added": 1533490089
		},
		{
			"follow_id": 7,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8",
			"user_name": "Chandelier",
			"date_added": 1533490133
		},
		{
			"follow_id": 8,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1533490188
		},
		{
			"follow_id": 9,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb",
			"user_name": "Bot",
			"date_added": 1533490240
		},
		{
			"follow_id": 10,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "136wmwLTBJoGTjXTAa7sWmXewn9P53EKML",
			"user_name": "Zero News",
			"date_added": 1533490287
		},
		{
			"follow_id": 11,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik",
			"user_name": "Radjah",
			"date_added": 1533527270
		},
		{
			"follow_id": 12,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB",
			"user_name": "Nekololi",
			"date_added": 1533528667
		},
		{
			"follow_id": 14,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp",
			"user_name": "Loligod",
			"date_added": 1533530985
		},
		{
			"follow_id": 15,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1KLQ5p24RZxxuSXJqG6FSGzMYy4rXSa8Bi",
			"user_name": "Aag",
			"date_added": 1533660316
		},
		{
			"follow_id": 16,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1F6rW7FtZsHiCaoKQWessLcbpjUwiXUX76",
			"user_name": "Zundei",
			"date_added": 1533660402
		},
		{
			"follow_id": 17,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5",
			"user_name": "Zeronetix",
			"date_added": 1533793895
		},
		{
			"follow_id": 18,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp",
			"user_name": "Ivesen",
			"date_added": 1533828406
		},
		{
			"follow_id": 19,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv",
			"user_name": "Calmaquesse",
			"date_added": 1533884278
		},
		{
			"follow_id": 20,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC",
			"user_name": "Promusik",
			"date_added": 1533884908
		},
		{
			"follow_id": 21,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "156HySyXH37jFXXqKCwVq8HqsrZLZzy8Qx",
			"user_name": "rushka life feed",
			"date_added": 1533885608
		},
		{
			"follow_id": 22,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1M6mvowPpeYyegFe6byJKP1aoehgKk84d2",
			"user_name": "Dstr1991",
			"date_added": 1533885659
		},
		{
			"follow_id": 23,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "17WWv3tyEUEukpaXdKVf59L1nHiqCuAXqi",
			"user_name": "Kub",
			"date_added": 1533942401
		},
		{
			"follow_id": 24,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AMvd655poPQSmfa5cyPRUvR8UJRPVECVD",
			"user_name": "Gamefreq0",
			"date_added": 1533946630
		},
		{
			"follow_id": 25,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "17Zks611RR4oN8USC3RxJzaw94GyPufioG",
			"user_name": "U53r",
			"date_added": 1534044703
		},
		{
			"follow_id": 26,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1PBw3FYm9DHTVbdm4Hrf1kQJMJd2LRNujT",
			"user_name": "Dogs",
			"date_added": 1534045398
		},
		{
			"follow_id": 27,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "18oQPES15W27Ks1GBZRKx9zf9wFmXLraEW",
			"user_name": "Sick Bird",
			"date_added": 1534045460
		},
		{
			"follow_id": 28,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC",
			"user_name": "meidan",
			"date_added": 1534150065
		},
		{
			"follow_id": 29,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1ACc4pa2pJam33SkSE1zF1seF3LQKWR24v",
			"user_name": "Punkcoder",
			"date_added": 1534150117
		},
		{
			"follow_id": 30,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1L1RLoEsVMEa18PKD22bthXAPGDFwYeq4v",
			"user_name": "Gimli",
			"date_added": 1534150315
		},
		{
			"follow_id": 31,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y",
			"user_name": "Rythyrix",
			"date_added": 1534150522
		},
		{
			"follow_id": 32,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib",
			"user_name": "Elspru",
			"date_added": 1534150568
		},
		{
			"follow_id": 33,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6",
			"user_name": "Border0464fred",
			"date_added": 1534150648
		},
		{
			"follow_id": 34,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "14HCuNUPNauHjToiDN4fQjedc5JPoQdciY",
			"user_name": "Bot032",
			"date_added": 1534150685
		},
		{
			"follow_id": 35,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1DD52vhXkbAdaS54PoZ2vNauiQ8XMiswC5",
			"user_name": "莱文倩",
			"date_added": 1534150705
		},
		{
			"follow_id": 36,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1Q5jU3rMt6F8ucYLpDKPzs13rzr49iqpGS",
			"user_name": "咕咕咕",
			"date_added": 1534150723
		},
		{
			"follow_id": 37,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1GAWwPWreQXo1CwcefCgL6w5wYPkNFWbsj",
			"user_name": "西木野真姬",
			"date_added": 1534150734
		},
		{
			"follow_id": 38,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1AjxW1N844WRpscEFSotfsqLXsQurz83xc",
			"user_name": "Arne Bolen",
			"date_added": 1534150821
		},
		{
			"follow_id": 39,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1K7pivtg6E1qRnih7nmnnPrCnRRSxSCMQQ",
			"user_name": "Lain",
			"date_added": 1534150845
		},
		{
			"follow_id": 40,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16nArdxrSaNThNp83kL8E6NLL9WD98iUne",
			"user_name": "Jayofthezero",
			"date_added": 1534150893
		},
		{
			"follow_id": 41,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1CFhytwoGGPNqmueehPqotaf2iG9uxD98e",
			"user_name": "Method-X",
			"date_added": 1534150917
		},
		{
			"follow_id": 42,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "17gEFavobc7RsKNGbSzZwoSZ6jNB7hT2KN",
			"user_name": "Fav",
			"date_added": 1534150936
		},
		{
			"follow_id": 43,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX",
			"user_name": "Deadjoker",
			"date_added": 1534150949
		},
		{
			"follow_id": 44,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331",
			"user_name": "Andrewm",
			"date_added": 1534150958
		},
		{
			"follow_id": 45,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47",
			"user_name": "Mv00🐰🐶💡",
			"date_added": 1534242245
		},
		{
			"follow_id": 46,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1rYi49f3DNfJntyt2EV3H1xjpVobJMoLz",
			"user_name": "Tommykakashi",
			"date_added": 1534863325
		}
	]
}