{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1615829493,
			"title": "Responsum of the Congregation for the Doctrine of the Faith to a dubium regarding the blessing of the unions of persons of the same sex",
			"body": "TO THE QUESTION PROPOSED:\nDoes the Church have the power to give the blessing to unions of persons of the same sex?\n\nRESPONSE:\nNegative.\n\nExplanatory Note\n\nIn some ecclesial contexts, plans and proposals for blessings of unions of persons of the same sex are being advanced. Such projects are not infrequently motivated by a sincere desire to welcome and accompany homosexual persons, to whom are proposed paths of growth in faith, “so that those who manifest a homosexual orientation can receive the assistance they need to understand and fully carry out God’s will in their lives”[1].     \n\nOn such paths, listening to the word of God, prayer, participation in ecclesial liturgical actions and the exercise of charity can play an important role in sustaining the commitment to read one's own history and to adhere with freedom and responsibility to one's baptismal call, because “God loves every person and the Church does the same”[2], rejecting all unjust discrimination.\n\nAmong the liturgical actions of the Church, the sacramentals have a singular importance: “These are sacred signs that resemble the sacraments: they signify effects, particularly of a spiritual kind, which are obtained through the Church’s intercession. By them men are disposed to receive the chief effect of the sacraments, and various occasions of life are sanctified”[3]. The Catechism of the Catholic Church specifies, then, that “sacramentals do not confer the grace of the Holy Spirit in the way that the sacraments do, but by the Church’s prayer, they prepare us to receive grace and dispose us to cooperate with it” (#1670).\n\nBlessings belong to the category of the sacramentals, whereby the Church “calls us to praise God, encourages us to implore his protection, and exhorts us to seek his mercy by our holiness of life”[4]. In addition, they “have been established as a kind of imitation of the sacraments, blessings are signs above all of spiritual effects that are achieved through the Church’s intercession”[5].\n\nConsequently, in order to conform with the nature of sacramentals, when a blessing is invoked on particular human relationships, in addition to the right intention of those who participate, it is necessary that what is blessed be objectively and positively ordered to receive and express grace, according to the designs of God inscribed in creation, and fully revealed by Christ the Lord. Therefore, only those realities which are in themselves ordered to serve those ends are congruent with the essence of the blessing imparted by the Church.\n\nFor this reason, it is not licit to impart a blessing on relationships, or partnerships, even stable, that involve sexual activity outside of marriage (i.e., outside the indissoluble union of a man and a woman open in itself to the transmission of life), as is the case of the unions between persons of the same sex[6]. The presence in such relationships of positive elements, which are in themselves to be valued and appreciated, cannot justify these relationships and render them legitimate objects of an ecclesial blessing, since the positive elements exist within the context of a union not ordered to the Creator’s plan.\n\nFurthermore, since blessings on persons are in relationship with the sacraments, the blessing of homosexual unions cannot be considered licit. This is because they would constitute a certain imitation or analogue of the nuptial blessing[7] invoked on the man and woman united in the sacrament of Matrimony, while in fact “there are absolutely no grounds for considering homosexual unions to be in any way similar or even remotely analogous to God’s plan for marriage and family”[8].\n\nThe declaration of the unlawfulness of blessings of unions between persons of the same sex is not therefore, and is not intended to be, a form of unjust discrimination, but rather a reminder of the truth of the liturgical rite and of the very nature of the sacramentals, as the Church understands them.\n\nThe Christian community and its Pastors are called to welcome with respect and sensitivity persons with homosexual inclinations, and will know how to find the most appropriate ways, consistent with Church teaching, to proclaim to them the Gospel in its fullness. At the same time, they should recognize the genuine nearness of the Church – which prays for them, accompanies them and shares their journey of Christian faith[9] – and  receive the teachings with sincere openness.\n\nThe answer to the proposed dubium does not preclude the blessings given to individual persons with homosexual inclinations[10], who manifest the will to live in fidelity to the revealed plans of God as proposed by Church teaching. Rather, it declares illicit any form of blessing that tends to acknowledge their unions as such. In this case, in fact, the blessing would manifest not the intention to entrust such individual persons to the protection and help of God, in the sense mentioned above, but to approve and encourage a choice and a way of life that cannot be recognized as objectively ordered to the revealed plans of God[11].\n\nAt the same time, the Church recalls that God Himself never ceases to bless each of His pilgrim children in this world, because for Him “we are more important to God than all of the sins that we can commit”[12].  But he does not and cannot bless sin: he blesses sinful man, so that he may recognize that he is part of his plan of love and allow himself to be changed by him. He in fact “takes us as we are, but never leaves us as we are”[13].\n\nFor the above mentioned reasons, the Church does not have, and cannot have, the power to bless unions of persons of the same sex in the sense intended above.\n\nThe Sovereign Pontiff Francis, at the Audience granted to the undersigned Secretary of this Congregation, was informed and gave his assent to the publication of the above-mentioned Responsum ad dubium, with the annexed Explanatory Note.\n\nRome, from the Offices of the Congregation for the Doctrine of the Faith, the 22nd of February 2021, Feast of the Chair of Saint Peter, Apostle.\n\n \n\nLuis F. Card. Ladaria, S.I.\nPrefect\n\n✠ Giacomo Morandi\nArchbishop tit. of Cerveteri\nSecretary\n \n\n[1] FRANCIS, Apostolic Exhortation Amoris laetitia, 250.\n\n[2] SYNOD OF BISHOPS, Final Document of the XV Ordinary General Assembly, 150.\n\n[3] SECOND VATICAN ECUMENICAL COUNCIL, Constitution on the Sacred Liturgy Sacrosanctum Concilium, 60.\n\n[4] RITUALE ROMANUM ex Decreto Sacrosancti Oecumenici Concilii Vaticani II instauratum auctoritate Ioannis Pauli PP. Il promulgatum, De bendictionibus, Praenotanda Generalia, n.9.\n\n[5] Ibidem, n. 10.\n\n[6] Catechism of the Catholic Church, 2357.\n\n[7] In fact, the nuptial blessing refers back to the creation account, in which God's blessing on man and woman is related to their fruitful union (cf. Gen 1:28) and their complementarity (cf. Gen 2:18-24).\n\n[8] FRANCIS, Apostolic Exhortation Amoris laetitia, 251.\n\n[9] Cf. CONGREGATION FOR THE DOCTRINE OF THE FAITH, Letter Homosexualitatis problema On the Pastoral Care of Homosexual Persons, 15.\n\n[10] De benedictionibusin fact presents an extended list of situations for which to invoke the blessing of the Lord.\n\n[11] CONGREGATION FOR THE DOCTRINE OF THE FAITH, Letter Homosexualitatis problema On the Pastoral Care of Homosexual Persons, 7.\n\n[12] FRANCIS, General Audience of December 2, 2020, Catechesis on Prayer, the blessing.\n\n[13] Ibidem.",
			"added": 1615829492
		},
		{
			"topic_id": 1615839546,
			"title": "imho one of the big mistake post ww2 is to not have explained and desentivized people to propaganda!",
			"body": "in the usa, before obama (gwb and his freedom fries) there was the perfect solution : A1\n\nbut of course the collectivists of the UNO can't stand it ! \n\nI hope death will be brough to them in a defeat so massive that the worst hit area of syria will look nice in comparison to what awaits them.\n\nwhat do you think? how do you cope with propaganda? specifically in one vote one man country, for reminder hitler was elected...",
			"added": 1615839544
		}
	],
	"topic_vote": {},
	"next_comment_id": 29,
	"comment": {
		"1615806111_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz": [
			{
				"comment_id": 1,
				"body": "one of the greatest post ever on the subject, congratulations ! let's hope that the US DOD will be able to recover the USA in a true american fashion, by exposing and defeating it's real enemies, and not those those enemies seek to make us off them.",
				"added": 1615818310
			},
			{
				"comment_id": 13,
				"body": "option 1 would ideally be realized in dropping those corpses from the mount to the \"prayer wall spot\" so if haredims want to pray there again, they will have to take of those corpses. It's a nice visual. I like it. but I guess it will 2 or 3, or both at the same time.",
				"added": 1615824304
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 2,
				"body": "Dear Arwa Damon, please go to israel, to mossad HQ to find the source of what affects those kids... go to little st james island, go to interview all those on the jeffrey epstein plane fly log... go, or we will kill you. and don't think a second to white genocide us.\n\nokay?\n\nyou start to think?\n\nwar!\n\nis\n\nour \n\nlast \n\nresort\n\ntoo!\n\nwe \n\ntoo\n\nhave\n\nno\n\nfuture",
				"added": 1615821136
			},
			{
				"comment_id": 3,
				"body": "and rest assured it's not a pleasure to condemn those kids to death, but as always, sometimes, one camp live, and for that the other dies. but contrary to them, you, your kind, are those I seek... get it?\n\nthey are Collateral damages to me, products of exponential breeding\n\nyou are targets... things to kill for us to live.\n\neven if your cia, dod, wh, and all this crap submitted to pedofiat scams are to low iq to get it.",
				"added": 1615821249
			},
			{
				"comment_id": 21,
				"body": "Dear Clarissa Ward,\n\nWhat you saw in syria, is just a warm up ! \n\nthe DoD should invite you to review some footage and impression, reports or REAL WAR , how do they call them, specialists of recording of combat actions and follow up sequelles... you don't understand. you are just a female. that's maybe why.\n\npoor you.\n\na warm up\n\notherwise why do you think they are all so afraid, including the russians? doesn't it tell a lot?\n\nyeah yeah...\n\nso is life\n\nyou have to learn to live with DIVERSITY\n\nnot the one you create \n\nthe fake artificial\n\nnope nope\n\nthe REAL",
				"added": 1615832891
			},
			{
				"comment_id": 22,
				"body": "go \nback\nto\nyour\nkitchen!",
				"added": 1615832991
			},
			{
				"comment_id": 23,
				"body": "and you know, thinking about it, if you were in your kitchen, maybe your would have left overs for those children ! \n\n(because I know your little UNO plan, of population replacement / white genocide / erestz preparation / no unity...)\n\nhuh? no words? like for interviewing the pedoprotagonists?\n\naka > to the wall.\n\n1 more.",
				"added": 1615833127
			}
		],
		"1615820872_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 4,
				"body": "> [biznizman](#comment_8_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): Please feel free to add additional information about these individuals here, or send it directly to vdare. [...]\n\nyeah the thing is that's it's exactly what they planned, that's the exact protocol how the original mussolinist fachist spread. \n\nso 100% to get them, however not fall in the providential man trap > back to the USC and BoR in the spirit of George Washington and as such we can be HYPER VIOLENT NATIVE STYLE (like fraging andrea mitchel and feeding her to alan greespan) while remaining a REPUBLIC ! \n\nin short it's just killing \"red coat\" be they wear UNO blue helmet or israeli david star or what ever the fuck : ONE FLAG; ONE NATION.",
				"added": 1615822397
			},
			{
				"comment_id": 5,
				"body": "for example the PLA flag : * / \\ - \nis a rallying one...\nat the scale of china :D.",
				"added": 1615822484
			},
			{
				"comment_id": 6,
				"body": "but the star is luxury already, as the flag.. when for 5000 years living a place with recorded history, even with 1.4 billions souls, it's easy to know who is with us, and those who ain't...",
				"added": 1615822553
			},
			{
				"comment_id": 7,
				"body": "and don't forget what Lemay said (gen lemay ww2 usa vs imperial japan) \"If l lost, I would have been executed for war crimes\" me : :D, finally someone who got it as it is, not as he wished it :D because of some crap bullshit heard in a superstructure designed to induce trance (church))",
				"added": 1615822898
			},
			{
				"comment_id": 8,
				"body": "poor low information / education who knows who is lemay or even gw? white fags? hu?",
				"added": 1615822988
			},
			{
				"comment_id": 9,
				"body": "fyi : Curtis Emerson LeMay (November 15, 1906 – October 1, 1990) was an American Air Force general who implemented an effective but controversial strategic bombing campaign in the Pacific theater of World War II. He later served as Chief of Staff of the U.S. Air Force from 1961 to 1965.",
				"added": 1615823062
			},
			{
				"comment_id": 10,
				"body": "so to the little civilians of the doj, cia, fbi, wh, congress and co, I say : It would be a pleasure to smash to the ground each and and every single one of your skulls... to pulp.",
				"added": 1615823127
			},
			{
				"comment_id": 11,
				"body": "and to user of the 7th floor,. watch out... watch out...",
				"added": 1615823199
			},
			{
				"comment_id": 12,
				"body": "an a little warning... this is the story of a chinese emperor who got the troops mad, as their gens, so they moved out ! to wage war... just to cool off, otherwise this emperor would have died already. becarefull... you can't push a panda for long before getting a massive back lash, and PLA protects the panda... get it?",
				"added": 1615823281
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 14,
				"body": "What they hate the most of and in putin is the image it re-envoys of themselves... I understand them.",
				"added": 1615825095
			}
		],
		"1615829493_18w7xHq6PfLBDhcTqJSMkgvqYEYiKWEtjS": [
			{
				"comment_id": 15,
				"body": "I hope it's not copyrighed ^^ and where is the Latin version? :D.\n\nI approve this message ! what's funny, when I was in school, I was ordered to write short sentences, I guess, my teachers couldn't read long one, their respectives heads will certainly be shocked by this one, however they may find it true in their heart.\n\nthe guidestone agendaers will not approve this message\n\nand however as said ! more peace to those in sin, but not approved. \nand don't forget dear gays and lesbians, you can't impose your lifestyle to the church, but are legally free to live it !\naka we let you live, you let us live, everyone is happy and God judges all :).\n\nGreat great ! super happy ! mega cool !",
				"added": 1615829964
			},
			{
				"comment_id": 16,
				"body": "ah this meeting with sistani was more postiive than expected ! great great great !",
				"added": 1615830112
			},
			{
				"comment_id": 17,
				"body": "And the AIs loved it : \n\nTO THE QUESTION PROPOSED:\nDoes the Church have the power to give the blessing to unions of persons of the same sex?\n\nRESPONSE:\nNegative.\n\nperfect with explanations later... excellent !",
				"added": 1615830166
			},
			{
				"comment_id": 18,
				"body": "for me it's important to understand the question, then the answer to it ! and is done perfectly. the follow up amazing ! but very hard to do ! great job !",
				"added": 1615830218
			},
			{
				"comment_id": 19,
				"body": "on the subject what I found terrible, is the men or women who did fake weddings, to hide their sins. that's for me, super super bad ! I don't care what you do in your own bedroom with your own body and those of adult with you. it's not my problem, however your ways, dont' have to become the way. mutual respect and tolerance.\nit great that the great leader of the roman church answered finally clearly again the question.\ndoubt removed.\nnow the tolerance and love in the Christ way, the hard part to do ... :) or live ! because in it, saying the faith is easy, living it can it too be , but not always, it's up to you :).",
				"added": 1615830410
			},
			{
				"comment_id": 20,
				"body": "ps little advice and warning to aggressive gays and lesbians, you know what happen to those who attack the great shia leader of irak aka ali sistani? exactly , you better not find out, the sunnah may join in the reprisals...",
				"added": 1615830573
			}
		],
		"1615837036_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 24,
				"body": "how to react to this? let's say that my opinion on natural immunity is clear. I have MY BODY and so MY CHOICE. so I hate all vaxxnazis and wish death to them.\n\nthat being said, let's say that the VAXXnazis are before all EUROnazis... need I say more? yes that the EUROnazis are just a preparatory ground for their real objectives : the UNOnazis.\n\nso at one point... who knows ! IDK\n\nyour body > YOUR CHOICE ! good luck ! enjoy, have fun ! see death !",
				"added": 1615838108
			},
			{
				"comment_id": 25,
				"body": "ah and if you can't jail and kill pedos, and those who support them, like all the bbc personals regarding jimmy saville, me say : 0 trust !",
				"added": 1615838137
			},
			{
				"comment_id": 26,
				"body": "I saw british cops beating citizens with such a pleasure... I hope those same cops will enjoy STORMFRONT ! and for optimal killing them, may they still wear such perfect target practices clothes... loved it ! more fun ! more aim !",
				"added": 1615838188
			},
			{
				"comment_id": 27,
				"body": "u c? \n\nat least rapefugeecensornazis aka merkel lost this we ! one step before she is guillotined.",
				"added": 1615838230
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 28,
				"body": "flush ! if it's not too late... I have heard of organs liquefying after mRNA jabs...",
				"added": 1615839588
			}
		]
	},
	"comment_vote": {}
}