{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "tuer macron, ou alors ce sera la guerre civil, cher policiers...",
			"body": "vous qui nous avez arretez et detruis nos vies pour des plantes, maintenant que la HAUTE court europeene des droits de l'homme a decider qu'on peut etre injecter de force, il ne reste plus qu'a nous battre\n\nnous viserons vos femmes et enfants pendants que vous nous chasserez\n\npeut etre que vous gagnierez, mais nous aurons tué beaucoup des votres\n\nvous ne pouvez pas etre partout\n\nvous etes comme les nazis\n\nvous n'arriver pas respecter et encore moins comprendre NOTRE LIBERTE, qui est aussi la votre, mais vous oubliez que vous l'enlever cette uniforme qui vous tient a coeur\n\net ca ces moments la que nous frapperons\n\ndans votre sommeil\n\npendant vos gardes\n\nlorsque vous n etes pas la\n\nnous nous vengerons\n\net peut etre perderons\n\nmais au moins\n\nnous auront vécu libre\n\npas comme vous\n\nnous n'avons pas collaboré pour un modeste repas\n\nalors oui vous pourrez prendre nos vis, nous vous rendrons la pareille\n\nmais pas notre dignité\n\nqu'un maitre :\n\nDIEU.",
			"added": 1617877908
		},
		{
			"topic_id": 2,
			"title": "oh les grosses connes arbes sur cnews?",
			"body": "pour quoi il ferme les frontiere alors que le virus est dedans, mais t as tjrs pas capté sale pute : ce vaxx, ils veulent... c'est tout\n\net l'autre bonfoonne la petite pute d'avocate (ouais ta fille on va la buter) t en a pas marre de nous mettre en prison pour des plantes salopes?\n\nallez vous faire bande de sous mettre, et vous etes meme pas arabe connasse dechets!",
			"added": 1617878761
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 1,
				"body": "poruquoi tuer macron? car on sait deja qu'il veut la court europeenne, c'est sa mission, l'europe, l'europe... L'EU...\n\nla france peut crever pour eux.\n\nfaut s'en debarasser.\n\nmais bon, hitler aussi il etait élu\n\nalors forcement comme les nazis...\n\ncome les nazis...\n\nles memes.",
				"added": 1617877983
			},
			{
				"comment_id": 2,
				"body": "\"la democratie c'est le nazisme aussi\"... oui oui...",
				"added": 1617878011
			},
			{
				"comment_id": 3,
				"body": "alors vous etez face a vous meme, mais qu'on gagne ou qu'on perde, on meurt tous... n'oubliez pas... la mort elle ne vous oubliera pas...\n\nalors oui moi je fais partie des laches, je vais essayer de me sauver...\n\nmais pas dit que j'y arrive...",
				"added": 1617878062
			}
		],
		"3_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 4,
				"body": "on en a rien a foutre de ces putins de dinner, s'ils veulent manger ensemble ils font ce qu'ils veulent, comme rasheed il propose de faire tourner son joint en bas... voila...\n\nalors vous faire nicker...\n\nj espere qu on va vous eclater...\n\nje vous hais, en tant qu'humain.",
				"added": 1617878823
			},
			{
				"comment_id": 5,
				"body": "> [fistpharma](#comment_1_1KJWwT67jevaZZMQmcspiJToGt63sxkwrj): Salut, pour Strasbourg: en Alsace-Moselle, ce sont les 2 seuls endroits en France métropolitaine où les religieux de tous bords sont encore payés par le gouvernement... La loi de 1905 ne s'applique pas dans ces territoires. Donc, légalement, l'Etat doit payer aussi bien pour une église que pour une synagogue, un temple ou une mosquée. Même si cette dernière est proche des Frères musulmans..et donc soutien le terrorisme.\n\nmais putin une moskée c'est UN QG !!! HQ islam... c'est la ou la societe islamic se retrouve, tribunal, mariage, prayer, planning...\n\nalors toi va te faire foutre avec ton islam de france\n\nmoi je 100% wahhbism !\n\nalors tu peux me hairi me traiter de gros porc\n\nretour aux sources\n\net oui avec les mullahs mon probleme c'est pas leur intepretation c'est a propos de la \"blood line\", en gros, moi je dis comme dans la Sunnah, que aujourd hui le Sheik de Dubai c'est le best pour LEAD The WHOLE FUCKING UMMAH WORLD WIDE !!!\n\nagree or not fuck off !\n\nparce que tu crois avec ta vision de pds que tu va changer l'islam, mais tu va te faire eclater comme une merde.\n\net t as gueule avec ton terrorism c'est juste une TACTIQUE !!!\n\nquel con !\n\nt es avec macron?\n\nmerci de ta reponse.",
				"added": 1617878992
			},
			{
				"comment_id": 6,
				"body": "put1 j'attend les vrai fatwa a propos d'une injection involontaire... mais on est ou ?!? !!!\n\nle prophete (PBUH) revient, vous allez le vaxxer de force? Total JIHAD WORLDWIDE !",
				"added": 1617879088
			},
			{
				"comment_id": 7,
				"body": "toi j ai hate que tu vois les death rows... ces lignes plus longue que l horizon et passage a l'AK... ",
				"added": 1617879163
			},
			{
				"comment_id": 8,
				"body": "qut tu vois la chair gicler des corps... chairs et os... ouais ouais... tu vas voir ... ",
				"added": 1617879188
			},
			{
				"comment_id": 9,
				"body": "mecrants... those who have gone ashtray...\n\nputin notre liberté rien a foutre...\n\nbill gates\n\ndepopulation\n\nwhite genocide\n\neu eue eue eueeueue\n\nputin\n\ntous vous crever...\n\ntoute maniere on a plus le choix\n\nmais les cons comme alex jones et les autres bouffons genre micheal flynn ils vont devoir ou se trahir ou se rendre a l evidence\n\nva falloir tuer\n\net l enemi c'est pas rashid en afghanistan...",
				"added": 1617879282
			},
			{
				"comment_id": 10,
				"body": "et une fois que ca c'est fait...\n\npar china army peut etre\n\nvous etez morts...\n\nenfin !\n\nfinalement !\n\n",
				"added": 1617879308
			}
		],
		"3_1KJWwT67jevaZZMQmcspiJToGt63sxkwrj": [
			{
				"comment_id": 11,
				"body": "deja bien venu sur zn... regarde i2p, bitmessage, et autre tor services... y a beaucoup a apprendre... wionix / torbrowers / tails... et d autre\n\nbon ensuite fo rester calme...\n\npremiere question : la weed...\n\non veut du hash !\n\nt es contre ou pour?\n\nattention, on est aussi pour la coke...\n\nquoi=?\n\ntu veux te battre?\n\nahhh tu comprend les stimulants?\n\noui l'hero aussi\n\ntu t es jamais battus?\n\nvoila...\n\nmais la donc tu vois on est plus dans ton monde\n\non prend un gamin de 10-12 et la il a la chance de sa vie\n\nil va devenir assassin pour un cartel\n\nvoici un juge gras qui sort de son domicile\n\nnotre petit protegé, a 12-14 s'apporche par derrière, sort son arme, pointe et click\n\nboom boom\n\nencore une au sol\n\njob done, il se reprend court, vehicule in\n\nWELCOME KIDDO !\n\net la force grandit...\n\noui oui c'est pas tous les jours aussi drole...\n\nmais bon\n\nle trade first !\n\nt en es ou la?\n\nencore dans le reve?\n\ngenre un espece d'ideal romantique democratique?\n\nou t es pret a aller avec les planteurs de pavots en afghanistan contre les talibans?\n\ntu vois?\n\nnon...\n\ntu fake\n\nje paris.\n\n",
				"added": 1617879809
			},
			{
				"comment_id": 12,
				"body": "en gros on rentre pas dans leur jeux de polemistes... c'est tout. tu t heberge aiilleurs zeronet,,, ca marche plus, bah tu t achete des piegons... faut pas etre con a la fin...\n\nno one gets in the crime to earn pesos :D.",
				"added": 1617879928
			},
			{
				"comment_id": 13,
				"body": "et macron ce qu'il fait c'est du scanning, il va tous vous round up, avec une excuse qu'il va trouver et ces putins de flics, c'est des nazis, rien a foutre,... ordre = bouffe = la grosse contente, il suit les ordres...\n\ny a rien\n\ny a pas d education\n\ny a pas de fibre, de feu de la liberté...\n\nvous connaissez pas \n\nvous comprennez pas\n\nmais alors vous bourrez la gueule en beuglant et sautant dans tous les sens, alors la champion, mais rien de plus...\n\nc'est nul.",
				"added": 1617880051
			},
			{
				"comment_id": 15,
				"body": "essaye matrix.",
				"added": 1617880085
			},
			{
				"comment_id": 17,
				"body": "aussi fo vraiment etre con pour aller sur l'instance d'un autre sur mastodon... s'ils peuvent te censuer ils vont le faire... c est une guerre globale... avec une bande de brelles comme toi, incapable intellectuellement de comprendre le flow, et le pire c'est ton arrogance sur ton dit intellect... t es trop con pour te rendre compte que t es con...\n\ntu vois au basquet, si je faisais 2m, tu le verrias, et l'accepterai... la tu peux pas\n\nalors tu vas sur mastodon, t essaye de t infiltrer sur l'instance d un autre, au lien de creer la tienne...\n\net si y a pas moyen de sync to node avec les autres car ils te bannent, a nouveau va sur du vraiment pas censorable...\n\nbitmessage, i2p, freenet, zeronet,.... ou cree ton instance matrix... genre... lol...\n\nles bisounours.\n\nd'un coté je suis d'accord avec le GSA, USELESS BREEDERS... juste ca me fait chier car y a pas vraiment moyen d eviter leur culling...\n\nahhh oui mais c'est quoi?\n\nconspiration\n\nduuhhhhhhh\n\nallez ",
				"added": 1617884490
			}
		],
		"2_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 14,
				"body": "elles sont envoyés ces lettres?",
				"added": 1617880069
			}
		],
		"2_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 16,
				"body": "biatch",
				"added": 1617880470
			}
		]
	},
	"comment_vote": {}
}