{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Palestra: Manual do estudante e engenheiro recém-formado em tempos de crise",
			"body": "Nessa Palestra apresentada na UFSC falamos sobre o atual momento do setor da indústria, em especial da construção civil. Também falamos sobre a nossa experiência de 14 anos como engenheiro graduado, enfatizando como o estudante e o engenheiro podem se destacar no mercado de trabalho com base em exemplos práticos e nossa vivência.\n- https://youtu.be/3q3g4b7Udwg",
			"added": 1545954050
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Criptaritmética\nCriptaritmética é a ciência e arte de criar e resolver criptogramas. É um setor da Matemática Recreativa.\n- http://criptaritmetica.awardspace.us/index.html\n\n#Sobre a NP-Completitude dos Criptaritmos\n- https://sci-hub.tw/10.1145/24658.24662",
				"added": 1545953590
			},
			{
				"comment_id": 2,
				"body": "#A mineração de bitcoin é NP-difícil\n- https://web.archive.org/web/20181003020839/https://freedom-to-tinker.com/2014/10/27/bitcoin-mining-is-np-hard/",
				"added": 1545953791
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#BIRD BOX\nEm um mundo pós-apocalíptico, Malorie (Sandra Bullock) e seus filhos precisam chegar em um refúgio para escapar do Problema, criaturas que ao serem vistas fazem pessoas se tornarem extremamente violentas. De olhos vendados para nao serem afedaos, a família segue o curso de um rio para chegar à segurança.\n- https://ok.ru/video/964174154409\n- https://openload.co/embed/cmTqAO4Fhm4/B1RDB0XDUB.mp4",
				"added": 1545967802
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 4,
				"body": "Todos devem sujeitar-se às autoridades governamentais, pois não há autoridade que não venha de Deus; as autoridades que existem foram por ele estabelecidas.\nPortanto, aquele que se rebela contra a autoridade está se colocando contra o que Deus instituiu, e aqueles que assim procedem trazem condenação sobre si mesmos.\nPois os governantes não devem ser temidos, a não ser pelos que praticam o mal. Você quer viver livre do medo da autoridade? Pratique o bem, e ela o enaltecerá.\nPois é serva de Deus para o seu bem. Mas se você praticar o mal, tenha medo, pois ela não porta a espada sem motivo. É serva de Deus, agente da justiça para punir quem pratica o mal.\nPortanto, é necessário que sejamos submissos às autoridades, não apenas por causa da possibilidade de uma punição, mas também por questão de consciência.\nÉ por isso também que vocês pagam imposto, pois as autoridades estão a serviço de Deus, sempre dedicadas a esse trabalho.\nDêem a cada um o que lhe é devido: Se imposto, imposto; se tributo, tributo; se temor, temor; se honra, honra.\nNão devam nada a ninguém, a não ser o amor de uns pelos outros, pois aquele que ama seu próximo tem cumprido a lei.\nPois estes mandamentos: \"Não adulterarás\", \"não matarás\", \"não furtarás\", \"não cobiçarás\", e qualquer outro mandamento, todos se resumem neste preceito: \"Ame o seu próximo como a si mesmo\".\nO amor não pratica o mal contra o próximo. Portanto, o amor é o cumprimento da lei.\nFaçam isso, compreendendo o tempo em que vivemos. Chegou a hora de vocês despertarem do sono, porque agora a nossa salvação está mais próxima do que quando cremos.\nA noite está quase acabando; o dia logo vem. Portanto, deixemos de lado as obras das trevas e vistamo-nos a armadura da luz.\nComportemo-nos com decência, como quem age à luz do dia, não em orgias e bebedeiras, não em imoralidade sexual e depravação, não em desavença e inveja.\nPelo contrário, revistam-se do Senhor Jesus Cristo, e não fiquem premeditando como satisfazer os desejos da carne.\n\n- Romanos 13:1-14",
				"added": 1545973521
			},
			{
				"comment_id": 5,
				"body": "Que vantagem há então em ser judeu, ou que utilidade há na circuncisão?\nMuita, em todos os sentidos! Principalmente porque aos judeus foram confiadas as palavras de Deus.\nQue importa se alguns deles foram infiéis? A sua infidelidade anulará a fidelidade de Deus?\nDe maneira nenhuma! Seja Deus verdadeiro, e todo homem mentiroso. Como está escrito: \"De modo que são justas as tuas palavras e prevaleces quando julgas\".\nMas, se a nossa injustiça ressalta de maneira ainda mais clara a justiça de Deus, que diremos? Que Deus é injusto por aplicar a sua ira? ( Estou usando um argumento humano. )\nClaro que não! Se fosse assim, como Deus iria julgar o mundo?\nAlguém pode alegar ainda: \"Se a minha mentira ressalta a veracidade de Deus, aumentando assim a sua glória, por que sou condenado como pecador? \"\nPor que não dizer como alguns caluniosamente afirmam que dizemos: \"Façamos o mal, para que nos venha o bem\"? A condenação dos tais é merecida.\nQue concluiremos então? Estamos em posição de vantagem? Não! Já demonstramos que tanto judeus quanto gentios estão debaixo do pecado.\nComo está escrito: \"Não há nenhum justo, nem um sequer;\nnão há ninguém que entenda, ninguém que busque a Deus.\nTodos se desviaram, tornaram-se juntamente inúteis; não há ninguém que faça o bem, não há nem um sequer\".\n\"Suas gargantas são um túmulo aberto; com suas línguas enganam\". \"Veneno de serpentes está em seus lábios\".\n\"Suas bocas estão cheias de maldição e amargura\".\n\"Seus pés são ágeis para derramar sangue;\nruína e desgraça marcam os seus caminhos,\ne não conhecem o caminho da paz\".\n\"Aos seus olhos é inútil temer a Deus\".\nSabemos que tudo o que a lei diz, o diz àqueles que estão debaixo dela, para que toda boca se cale e todo o mundo esteja sob o juízo de Deus.\nPortanto, ninguém será declarado justo diante dele baseando-se na obediência à lei, pois é mediante a lei que nos tornamos plenamente conscientes do pecado.\nMas agora se manifestou uma justiça que provém de Deus, independente da lei, da qual testemunham a Lei e os Profetas,\njustiça de Deus mediante a fé em Jesus Cristo para todos os que crêem. Não há distinção,\npois todos pecaram e estão destituídos da glória de Deus,\nsendo justificados gratuitamente por sua graça, por meio da redenção que há em Cristo Jesus.\nDeus o ofereceu como sacrifício para propiciação mediante a fé, pelo seu sangue, demonstrando a sua justiça. Em sua tolerância, havia deixado impunes os pecados anteriormente cometidos;\nmas, no presente, demonstrou a sua justiça, a fim de ser justo e justificador daquele que tem fé em Jesus.\nOnde está, então, o motivo de vanglória? É excluído. Baseado em que princípio? No da obediência à lei? Não, mas no princípio da fé.\nPois sustentamos que o homem é justificado pela fé, independente da obediência à lei.\nDeus é Deus apenas dos judeus? Ele não é também o Deus dos gentios? Sim, dos gentios também,\nvisto que existe um só Deus, que pela fé justificará os circuncisos e os incircuncisos.\nAnulamos então a lei pela fé? De maneira nenhuma! Pelo contrário, confirmamos a lei.\n\n- Romanos 3:1-31",
				"added": 1545973655
			}
		]
	},
	"comment_vote": {}
}