{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Иллюзия сознания",
			"body": "Эту статью написал не я, но я хочу ее сохранить навсегда, знаю что ZeroNet не умрет никогда.\n\nВопрос о сознании. Вопрос о сознании имеет первостепенное значение, именно поэтому он никогда не ставится в самом начале любого рассуждения, но почти всегда венчает его как замковый камень на вершине очередной пирамиды человеческих иллюзий и заблуждений. Сознание не слушают, ему диктуют в рамках господствующих теоретических моделей и картин мира. Проблема заключается в том, что все эти модели и картины существуют исключительно в самом сознании, сознание вмещает их, но никак не наоборот. Все наши представления, в том числе и, о ужас, представления об самой объективности, субъективны ровно в той степени, в которой мы позволяем себе верить в их непреложную истинность. Говоря проще, мы придумали «объективность», чтобы оправдать собственное невежество. А еще — как защиту от безумия, время от времени охватывающего целые народы и континенты.\n\nНепознанное через неизвестное. Мы пытаемся познавать мир с помощью собственного сознания, о котором практически ничего не знаем. Нам не известно по каким причинам оно возникло, мы не знаем механизмов его функционирования и пределов его точности в деле отображения реальности, однако мы априори верим в то, что картинки в нашей голове более или менее соответствуют окружающей действительности. И уж тем более мы не допускаем такой мысли, что сознание — это всего лишь ошибка природы, вычурная патология, которая не встречается больше нигде в известной нам части Вселенной, тяжелое умственное расстройство, неизбежно ведущее к вырождению и гибели вида. Мы не знаем, мы лишь слепо верим в сознание как иные верят в бога или в собственные навязчивые идеи.\n\nРама без картины. Нам неизвестно, что такое сознание, зато мы знаем, чем сознание не является. Память, привычки, мечты, фантазии, комплексы, жизненные цели и сама личность — это не есть сознание, но лишь окружающие его наслоения опыта. Амнезия может лишить человека прошлого, но не сознания. Он по-прежнему будет осознавать себя, но уже как человека без жизненного опыта. Однако если убрать сознание, то все вышеперечисленное потеряет свое значения. Когда мы спим и не осознаем себя, наша личность и память абсолютно бесполезны. Вера в существование души — это предельное выражение тяги западного человека к бездумному накопительству себя, своих впечатлений, воспоминаний, положительной кармы, etc. Но без сознания все это не имеет значение, а сознание нельзя накапливать как деньги под матрасом. Таким образом основополагающие установки западной цивилизации (накопительство и прогресс) базируются на ошибочных предположениях и вступают в противоречие с поставленными задачами, ибо прогресс всегда заканчивается кризисом и упадком, а индивидуальная жизнь — смертью и разложением.\n\nПередозировка лекарства. Восток подошел к проблеме сознания с бóльшим прагматизмом и трезвостью ума. Поскольку сознание невозможно определить, пребывая в нем, как невозможно вытащить самого себя за волосы из болота, то нет и необходимости в бесконечном теоретизировании о сознании, а познать его можно лишь единственным способом — пребывая в нем и осознавая собственную осознанность. Запад, конечно, не мог не извратить это учение, подобно тому как это произошло с представлениями о карме. Для восточного человека карма — это то, что необходимо избыть (обнулить), чтобы вырваться из колеса сансары, но одержимый накопительством человек Запада тут же бросился накапливать так называемую «положительную карму» во имя мифического «прогресса личности», восходящей постепенно на «высшие планы бытия». Очевидно, что прогресс личности западный человек измерят исключительно числом прочтенных книги, посещенных семинаров и количеством часов, проведенных в медитации. Ни о какой осознанности здесь речи не идет, главное — заставить себя поверить в очередную сказочную концепцию, чтобы поверить в осмысленность личного бытия, без которой западный человек не мыслит собственного существования.\n\nСказки о мире. Если отбросить слова, нет никакой принципиальной разницы между христианами, теософами, сатанистами, оккультистами и эзотериками. Каждый из них проходит один и тот же путь: сначала человек находит удобную сказку, описывающую мир, затем он заставляет себя поверить в нее, учась истолковывать факты в терминах своей новой картины мира, и в конце концов начинает видеть мир таким, каким его описывает та или иная концепция. Содержание этих сказок не имеет принципиального значения, поскольку их все равно нечем подкрепить: христиане не могут предъявить бога, теософы — своих великих махатм, а все сверхчеловеческие способности магов и оккультистов заключаются лишь в фантастическом умении безостановочно болтать на форумах о вещах, которые никто никогда не видел, поскольку существуют они лишь в форме этой самой болтовни, то есть в виде лжи и самообмана.\n\nЛожь и самообман. Для чего людям все эти красивые сказки о богах, демонах, посланцах Шамбалы и великих тибетских магах? Почему человек не может просто пребывать в осознанности, наслаждаясь чистым бытием, незамутненным никакими иллюзиями, предубеждениями и самохвальством? Проблема заключается в том, что любая попытка ответить на эти вопросы в рамках известных картин мира ведет лишь к их укреплению, то есть к удалению от чистого сознания в царство иллюзий. «Потому что человек грешен», — ответит христианин и предложит свою картину мира в качестве единственного лекарства. «Потому что человек не достиг еще высоких уровней духовного развития», — скажут теософы и ньюэйджевцы и предложат свои методы решения глобальных проблем. «Потому что в своем психологическом развитии человек недалеко ушел от животных», — заявят ученые и политики и потребуют ужесточения законодательства усиления контроля государства, призванного дрессировать этих непослушных животных, едва научившихся говорить. Однако картины мира, сколь величественными и прекрасными они бы ни были, не решают этой проблемы, решение в том и состоит, чтобы отбросить все картины мира.\n\nСущественное отличие. То, что физически и психологически человек представляет собой животное, факт в общем-то в достаточной степени оче-видный. Вся заслуга людей заключается лишь в том, что они со временем придумали новые названия для старых инстинктов, чтобы хоть чем-то выделиться на фоне бобров и орангутангов. Свой половой инстинкт человек называет теперь «любовью», стадный инстинкт — «общительностью», инстинкт защиты территории — «патриотизмом», а стадную иерархию — «субординацией». Все это так, и этология описывает человека в подобающих ему терминах, однако именно сознание в этой схеме не присутствует, что делает ее совершенно непригодной, поскольку именно сознание и интересует нас в первую очередь. В медитации все эти инстинкты и терминологические фокусы теряют всякое значение, потому что сознание не является инстинктом в той же степени, в которой оно не является всем прочим, что может в нем отражаться.\n\nСаморазрушающиеся новостройки. Сознание неуправляемо. Человеком можно манипулировать, играя на его чувствах, инстинктах и потребностях, однако лишь сам он является единственным источником всех своих радостей и печалей, и никто не может дать ему больше, чем уже содержится в нем самом. Манипуляция же всегда создает у людей иллюзию избытка или недостатка в чем-то. С помощью сказочных картин мира можно легко управлять целыми народами и государствами. Например, христианство говорит человеку, что у него есть душа, которая будет существовать после смерти физического тела (избыток), затем оно утверждает, что душа будет обречена на вечные муки в Аду, если человек не будет слушаться Бога и лишится его милости (недостаток), и в конце представляет себя в качестве единственного выразителя божественной воли на Земле (манипуляция). В данном случае вопрос о действительном существовании души, Ада и Бога не имеет принципиального значения, важно другое — страдания и наслаждения возникают в различающем уме и для чистого сознания представляют собой лишь две волны на поверхности безбрежного океана, катящиеся одна за другой. Когда океан успокоится, и различающий ум исчезнет, все картины мира разрушатся сами собой, обнажив в своей основе пустоту, которой попросту нет.\n\nИллюзиум. Общий рост осознанности невыгоден тем, кто использует идеологии и картины мира для удовлетворения своей животной потребности в доминировании над массами. Именно поэтому ни о какой осознанности в современном обществе не может идти и речи. Наоборот, мы становимся свидетелями взрывного роста индустрии развлечений, затягивающей сотни миллионов людей в пучину иллюзий, где главным достоинством человека становится умение производить и потреблять правдоподобные имитации упрощенных представлений о реальности, давным давно погребенной под ворохом симулякров четвертого порядка. Образованным человеком сегодня считается тот, у кого есть диплом, а не знания, религиозная вера заключается в ежедневном поминании Бога в своем блоге, а счастье состоит в том, чтобы перенести как можно больше вещей из магазина на помойку. В подобной ситуации вопрос «зачем все это нужно?» ведет не к пробуждению осознанности, а к депрессии и к тотальному нигилизму. Лишь тонкая пелена иллюзий отделяет современного человека от осознания абсурдности своей жизни и, как следствие, от самоубийства.\n\nИллюзиум 2. Все это можно было бы назвать заговором, если бы не одна существенная деталь: у иллюзий нет собственного сознания, за ними никто не стоит и никто их не направляет, они — всего лишь грязь на зеркале сознания, принесенная космическим ветром случайных перемен. Нельзя даже сказать, что эти омрачения порождают другие, ведь вне сознания они вовсе не существуют, лишь сознание наделяет их призрачным бытием, смыслом и значением для людей. Почему сознание отдается во власть иллюзий? Откуда у омрачений столько власти над людьми? Корень проблемы кроется в желании многих людей быть тем, кем они не являются. Сознание становится рабом иллюзий в тот момент, когда начинает считать себя бессмертной душой, мужчиной, женщиной, русским, американцем, то есть любым ярлыком или маской, которыми оно не является. Любое содержание сознания есть ничто иное как зыбкое отражение реальности, прошедшей сквозь фильтры органов чувств, сокровенных желаний и идеологических установок. В конечном итоге вера в иллюзии не делает их реальностью, но лишь немногие готовы пойти до конца по пути их разоблачения.\n\nЛекарство и болезнь. Опасны не те иллюзии, о которых мы с легкостью можем сказать, что они — ложь и суета, но те, что рядятся в одежды святости, истинности и полезности. Последний пункт приобрел колоссальное значение после того, как многие идолы и святыни были свергнуты с постаментов и преданы публичному осмеянию. Однако современный человек все еще верит в святость пользы и полагает ее лучшим свидетельством истины. Религия полезна для общества тем, что ограничивает животные порывы людей, однако это ни в коей мере не свидетельствует об ее истинности. Мало того, следует в первую очередь задуматься над вопросом, а почему, собственно, возникла необходимость искусственным образом ограничивать человека? Ни одно другое живое существо на на нашей планете не проходит в своей жизни через такую череду запретов и предписаний, как человек. Проблема человека заключается не в его изначальной природе, возникшей в результате четырех миллиардов лет эволюции без законов, постановлений, полицейских и тюрем, а в поработивших человеческое сознание иллюзиях, от последствий которых мы теперь вынуждены отчаянно защищаться. Нравственность, мораль, религия, государство — это не лекарства, а симптомы поразившей человечество болезни — чудовищной мании величия, инспирированной верой в ценность собственных фантазий, порожденных религией и обществом.\n\nСмерть метафизики, рождение потребителя. Древний человек верил, что сны позволяют ему прикоснуться к иной реальности. Со временем царство сновидений стало казаться ему боле подлинным или, если угодно, истинным миром, нежели обычная повседневность, ведь во снах он мог встречаться со своими умершими родственниками и даже с богами. Из превратного толкования ночных иллюзий впоследствии родились религии, овладевшие умами людей на долгие тысячелетия. В конце девятнадцатого века Фридрих Ницше положил конец этому метафизическому безумию, однако долгожданный свободы человек так и не увидел. Разоблаченные иллюзии перекочевали из вымышленного потустороннего мира в повседневную реальность, а веру в грядущее царствие Божие сменило желание построить Рай на Земле, если не для себя, то хотя бы для своих детей. Впрочем, вера в светлое коммунистическое будущее продержалась недолго и была сметена идеологией потребления, обещавшей Рай здесь и сейчас, путь даже в кредит и под большие проценты. Люди поменяли хозяина, но все равно остались рабами.\n\nИдеология потребления. Только очень наивные люди могут думать, будто идеология потребления начинается с рекламы и заканчивается в ближайшем супермаркете. Потребительство сделалось тотальным фетишем, определяющим жизнь людей с рождения и до самой смерти. Потребляют не только товары и услуги, но и все остальное. В первую очередь все остальное: информацию, идеологии, мемы, общение, друг друга в конце концов. Человек превратился в товар для других людей, ничем практически не отличающийся от ярких упаковок в магазинах. Он хочет быть таким же ярким, популярным и востребованным, он хочет, чтобы его покупали и потребляли; чтобы его желали и восхищались им как новенькой моделью гламурного смартфона; в Интернете и в повседневном общении он рекламирует себя как жвачку или средство для чистки унитазов, а затем скрупулезно подсчитывает новых френдов, лайки и ретвиты, полагая, будто изрядное их количество делает его лучше или умнее. Однако все это иллюзорное величие развеивается, как только очередная социальная сеть ложится под ddos-атакой на неопределенный срок.\n\nМусорный потлач. Заключение в одиночной камере считается одним из самых страшных наказаний, потому что обычный человек не может долго выносить самого себя — слишком много в нем мусора, который не будучи выплеснутым на окружающих начинает преть и перегнивать. Однако многие люди полагают, будто общение с ними должно отчего-то вызывать у других исключительно положительные эмоции. В сущности, повседневное общение заключается во взаимном обмене этим мусором: в непрерывной циркуляции объедков чужих идей, отходов жизнедеятельности маркетологов и отрыжки медийного бреда. Неудивительно, что некоторые сходят с ума в одиночестве, лишившись возможности пачкать своим дерьмом окружающих. С другой стороны, именно в одиночестве человек способен понять, кто он такой и что на самом деле имеет для него значение. Яд может оказаться лекарством, если уметь его применять.\n\nПрощай, сознание! Урбанизация и развитие социальных сетей оставляют современным людям человеку все меньше шансов побыть наедине с собой. Ускорение информационных процессов уменьшает промежуток между раздражителем и ответной реакцией, в результате чего у человека не остается времени обдумать свою стратегию поведения. Амебы не думают, амебы реагируют. Вопрос «зачем?» не в глобально-мировоззренческом смысле, а хотя бы в любой конкретной ситуации, вроде «зачем мне новый смартфон?» табуирован и считается неприличным. На него всегда отвечают неправильно: потому что есть у других или потому что новый — лучше или потому что он мне нравится. Никто уже не обращает внимание на ставшую привычной подмену понятий: «потому что…» — это ответ на вопрос «почему?», ответ на вопрос «зачем?» должен начинаться со слов «для того, чтобы…». В жизни людей остается все меньше места для сознательной деятельности, сознательность уже даже не симулируется, поскольку в ней не видят острой необходимости, в конце концов, разве сознание — это не такая же иллюзия, как и все остальное?",
			"added": 1531650494
		}
	],
	"topic_vote": {
		"1_15RqJjTSfY9F6xZkCnvgk5JeAewRd9sQgq": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}