{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Os cúmplices",
			"body": "#Em 2020, cada um saberá quem é diante de uma realidade que exige coragem para enfrentar e coragem para perder\n\nNenhum autoritarismo se instala ou se mantém sem a cumplicidade da maioria. É o que a história nos ensina. Não haveria nazismo sem a conivência da maioria dos alemães, os ditos “cidadãos comuns”, nem a ditadura militar no Brasil teria durado tanto sem a conivência da maioria dos brasileiros, os ditos “cidadãos de bem”. O mesmo vale para cada grande tragédia em diferentes realidades. Os déspotas não são alimentados apenas pelo silêncio estrondoso de muitos, mas também pela pequena colaboração dos tantos que encontram maneiras de tirar vantagem da situação. Em tempos de autoritarismo, nenhum silêncio é inocente —e toda omissão é ação. Esta é a escolha posta para os brasileiros em 2020. Diante do avanço autoritário liderado pelo antidemocrata de ultradireita Jair Bolsonaro, que está corroendo a justiça, destruindo a Amazônia, estimulando o assassinato de ativistas e roubando o futuro das novas gerações, cada um terá que se haver consigo mesmo e escolher seu caminho. 2020 é o ano em que saberemos quem somos —e quem é cada um.\n\nHá várias ações em curso. E várias mistificações. Quem viveu a ditadura militar (1964-1985) conhece bem, guardadas as diferenças, como o roteiro vai se desenhando. No final de 2019, parte da imprensa, da academia e do que se chama de mercado começou a exaltar os sinais de “melhora econômica”. A alta da bolsa, a “queda gradual” do desemprego, a indicação de aumento do PIB em 2020 são elencados entre os sinais. Ainda que se esperasse mais, afirmam, “os inegáveis avanços do ponto de vista econômico”, entre eles a reforma da Previdência, “a inflação comportada” e os juros fechando 2019 “em patamar inimaginável” permitem —e aí vem uma das expressões favoritas deste seleto grupo de players— um “otimismo moderado”. Até a pesquisa de uma associação de lojistas divulgou uma incrível alta de 9,5% nas vendas de Natal, imediatamente contestada por outra associação de lojistas. É como se a “economia” fosse uma entidade separada da carne do país, é como se houvesse uma parte que pudesse ser isolada e sobre a qual se pudesse discorrer usando palavras enfiadas em luvas de cirurgião. É como se bastasse enluvar jargões técnicos para salvar os donos das mãos de todo o sangue.\n\nEnquanto esse diálogo empolado e bem-educado do pessoal da sala de jantar, dos que sempre estão na sala de jantar, independentemente do governo, é estabelecido, bombas explodiram no prédio da produtora do programa de humor Porta dos Fundos, policiais matam como nunca nas periferias de cidades como Rio de Janeiro e São Paulo, ampliando o genocídio da juventude negra, o antipresidente legaliza o roubo de terras públicas na Amazônia, ambientalistas são acusados de crimes que não cometeram, ONGs são invadidas sem nenhuma justificativa remotamente legítima, adolescentes pobres morrem pisoteados porque decidiram se divertir num baile funk numa noite de sábado, indígenas guardiões da floresta e agricultores familiares são executados, as polícias vão se convertendo em milícias como se isso fosse parte da normalidade, e são também os policiais e “agentes de segurança” condenados por crimes os únicos que são libertados no indulto de Natal. Os sinais estão por toda parte, mas membros respeitados de instituições da República que deveriam ser os primeiros a percebê-los —e combatê-los— seguem inflando a boca para assegurar que “a democracia no Brasil não está ameaçada”.\n\nA qual Brasil se referem estes senhores bem-educados? De qual país estes luminares do presente falam? Certamente não do meu nem do de muitos, não o das favelas onde as pessoas se trancam sabendo que não há porta capaz de barrar a violência da polícia, não este em que os policiais já exterminam os pretos sem responderem por isso há muito, mas esperam mais já que o extermínio vai sendo legalizado pelas beiradas. Não este em que os templos de religiões afro-brasileiras são invadidos e destruídos apesar de o Estado ser formalmente laico. Não este em que as lideranças da floresta enxergam o Natal e o Ano-Novo como os piores momentos do ano porque é o tempo de deixar a família e fugir, pelo menos até que as capengas instituições voltem do recesso.\n\nNeste país, pessoas da sala de jantar, há muita gente escondida neste exato momento para poder virar o ano vivo. Não esperam brindar, desejam apenas não ter o corpo atravessado por uma bala —ou por quatro na cabeça, como ocorreu com Marielle Franco, num crime não decifrado quase dois anos depois. Democracia onde? Os escondidos, os ameaçados, os parentes dos mortos querem saber. Todos nós queremos muito viver neste país em que vocês enxergaram “inegáveis avanços na economia em 2019” e “instituições que funcionam”. Não fiquem com o endereço só para vocês.\n\nAs pessoas da sala de jantar, porém, só podem seguir na sala de jantar ditando o que é a realidade porque a maioria assim permite, omitindo-se ou aproveitando-se das sobras. São as pessoas, no dizer da historiadora franco-alemã Géraldine Schwarz, “que seguem a corrente”. A questão é se você, que lê este texto, vai engrossar o rebanho dos que seguem a corrente.\n\nNão o rebanho de ovelhas. Esta imagem evoca passividade, engano, uma obediência absolvida pela inocência. Não. Este rebanho, o dos que agem se omitindo, ou o dos que agem tirando pequenos proveitos, “porque afinal é assim mesmo e quem sou eu para mudar a realidade”, é um rebanho de lobos. Porque o ativismo de sua omissão é cúmplice do sangue das vítimas, estas que tombam, estas que vivem uma vida de terror. É cúmplice também das ruínas de um país. No caso da Amazônia, é cúmplice das ruínas da vida da nossa e de muitas espécies no único planeta disponível.\n\nGéraldine Schwarz escreveu um premiado livro chamado Os amnésicos (Flammarion), infelizmente sem tradução no Brasil. A historiadora, cuja família foi uma dessas que obteve vantagens no nazismo, mas se considerava inocente do Holocausto, deu uma excelente entrevista ao jornalista Fernando Eichenberg, em O Globo. Ela aponta como a adesão aos déspotas do século 21 mantém a estrutura da adesão aos totalitarismos do século 20:\n\n“No imaginário coletivo, temos tendência a dividir a sociedade em três categorias históricas no século 20: heróis, vítimas e carrascos. Na verdade, a maioria da população não se reconhece em nenhuma delas. É a via mais fácil não se incluir em nenhuma das três categorias, mas apenas seguir a corrente. Há o magnífico filme baseado no romance de Alberto Moravia [O conformista, de Bernardo Bertolucci], que mostra muito bem como o conformista acaba aceitando o que antes era inaceitável. No ensino da história, muitas vezes por meio da ficção ou de comemorações, temos uma visão um pouco distorcida do passado. Se tem a impressão de que a população não teve nenhum papel nessa história. E teve, muitas vezes, um papel de pilar e consolidador de ditaduras. É nisso que a democracia tem um papel importante, pois o povo tem os meios de impedir um golpe e a instalação de um regime criminoso. Eleger Bolsonaro, por exemplo, para mim, é brincar com o fogo, pois parece alguém capaz de tudo.”\n\nA historiadora defende a memória como um dos principais instrumentos de defesa da democracia. “O importante é tomar consciência de nossa falibilidade e reconhecer que podemos nos transformar também em um bárbaro”, afirma. \"A história não se repete, mas os métodos de manipulação, sim, porque a psicologia humana não muda. Em um contexto de crise, em meio a um grupo, o homem terá reações similares. Um dos métodos é difundir o medo, muitas vezes exagerado em relação à realidade. [...] Trata-se de confundir a fronteira entre o verdadeiro e o falso, desorientando totalmente as pessoas. Perde-se as referências, não se sabe mais no que acreditar. E, como dizia [a filósofa alemã] Hannah Arendt, quem não acredita em mais nada é manipulável à vontade. Ao ponto de inverter seus valores: o que era bom ontem já não o é mais hoje. É o que se observa em várias sociedades do mundo. As pessoas que, hoje, apoiam Jair Bolsonaro, há dez anos provavelmente defendiam os direitos humanos. Por isso que o ensino do Terceiro Reich é capital. Na história há muito poucos exemplos de uma sociedade tão civilizada, moderna, intelectual, que derivou rapidamente para a barbárie. É um ensinamento universal, que serve de alarme a todo mundo.”\n\nO problema é que países como o Brasil não produziram a memória da ditadura justamente para absolver os assassinos, sequestradores e torturadores de Estado. A condição da retomada da democracia foi o perdão ao imperdoável. Essa política de amnésia resultou, em 2018, na eleição de um presidente que tem como herói um torturador e assassino de civis. Diante de uma população desmemoriada, ao final do primeiro ano do governo do déspota eleito vimos um roteiro semelhante se repetir, com as necessárias adaptações a uma época impactada pela Internet. Ainda que a memória no Brasil seja frágil, porém, ela existe. Não há desculpa para omissão. Nem há qualquer inocência no suposto conformismo.\n\nO problema, no Brasil e em outros países que vivem processos políticos semelhantes, é também de memória recente. Esta que está sendo construída agora, não só nas mentiras disseminadas nas redes sociais por Bolsonaro e sua familícia, mas também nas narrativas que isolam a economia da carne que sangra. Como se a evocação do AI-5 por Paulo Guedes não tivesse nada a ver com suas escolhas econômicas, como se o Posto Ipiranga fosse radicalmente diferente do dono do posto. Está em produção uma memória falsa, o que é pior do que desmemória. Pior do que não lembrar é lembrar de um acontecido que nunca aconteceu.\n\nEntre as tantas perversões da ditadura, uma se mostrava particularmente enlouquecedora para aqueles que escolheram lutar contra o regime de opressão. Enquanto homens e mulheres eram vigiados e perseguidos dia e noite, afastados de seus postos, demitidos de seus empregos, transformados em párias e criminalizados, enquanto livros, jornais, filmes e peças de teatro eram censurados, enquanto brasileiros precisavam deixar o país para salvar a vida ameaçada pelo Estado, enquanto os que ficavam eram sequestrados, torturados e mortos por agentes do Estado, uma maioria fingia que nada estava acontecendo. Fingia tanto que acabava acreditando que não eram gritos de dor e de terror o que ouvia. Era o cidadão de bem que apenas seguia a corrente, protegendo os próprios interesses e avaliando o que poderia ganhar com o estado das coisas.\n\nComeçamos a testemunhar hoje o mesmo mecanismo perverso. Com todas as desculpas possíveis, auxiliadas pela polarização que desloca o perigo para uma falsa oposição. Com todos os erros e os crimes do PT no poder, o antipetismo não é justificativa aceitável para alguém seguir a corrente. Não tem mais clima para se fingir de iludido. Basta ter vergonha na cara para perceber que não se trata mais do PT. Se trata da corrosão do que ainda resta de democracia no Brasil. Se trata da autorização para roubar enormes pedaços de floresta, desmatá-los e botá-los no nome dos autores do crime. Se trata da conversão das forças de segurança em milícias com autorização para matar. Se trata da criminalização de quem defende os mais frágeis, usando para isso o aparato do Estado. Se trata de genocídio de negros —e também de indígenas.\n\nHá muita gente se fingindo de ovelha para lavar as mãos diante do que vive o Brasil. Mas há também gente angustiada perguntando o que fazer diante do que já não consegue deixar de ver. A estes, respondo que ninguém vai dar a resposta. Esta resposta terá que ser criada, coletivamente, por iniciativa dos que fazem a pergunta. Em cada profissão há o que fazer. Este é um momento em que precisamos fazer melhor o que sabemos fazer, mas também precisamos fazer bem o que não sabemos. Apenas o que sabemos já não é suficiente. O que somos já não é suficiente. Temos que ser melhores do que somos para enfrentar este tempo em que já não há tempo. E temos que ser juntos, fazendo laços e tecendo redes entre nós.\n\nEste é o desafio de 2020. O ano novo não está dado. 2020 só será novo se nossa resistência resgatar o presente das mãos dos déspotas. Esta é a única resolução possível diante do que vivemos e do que testemunhamos. Cada um de nós precisa se responsabilizar pelo horror do nosso tempo.\n\n- Fonte: https://web.archive.org/web/20200102184332/https://brasil.elpais.com/opiniao/2020-01-01/os-cumplices.html",
			"added": 1578056116
		}
	],
	"topic_vote": {
		"1_1KB16NvxU21eij16pXcDEbb8gDXuSqB8Uy": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}