{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1591273076,
			"title": "The BLM Revolution of 2020",
			"body": "Overview updates of the BLM Protests in 2020.\n\nSee https://t.me/BLMProtests/1113 for information about known protests.\n\nDirectory of Local Protests: https://t.me/BLMProtests/3361\n\nYou can contact @BLMProtestsBot with any questions/information",
			"added": 1591273075
		},
		{
			"topic_id": 1591530136,
			"title": "It could be useful a ZeroTalk<->Telegram bridge",
			"body": "As (in Matrix) there's Mautrix-Telegram bridge\nIt could be useful a ZeroTalk-Telegram bridge,\nSomething like Binchan's ZeroMe Mastodon Bridge",
			"added": 1591530134
		},
		{
			"topic_id": 1591795514,
			"title": "Capitol Hill Autonomous Zone (CHAZ or the Zone)",
			"body": "**The Capitol Hill Autonomous Zone (CHAZ or the Zone)**, also known as **Free Capitol Hill**, is a self-declared intentional community and commune of around 200 residents, covering about six city blocks in the Capitol Hill neighborhood of Seattle, Washington. The zone was established on June 8, 2020 after the East Precinct was abandoned by the Seattle Police Department.\n\n**Foundation**\n\nAfter days of protests commemorating George Floyd and condemning police brutality outside of the Seattle Police Department's East Precinct, Mayor Jenny Durkan announced a series of \"de-escalate interactions\" which limited the police presence in the Capitol Hill neighborhood. Following a \"police retreat\",[4] citizens erected street barricades and declared the anarchist Capitol Hill Autonomous Zone...\n\nhttps://en.wikipedia.org/wiki/Capitol_Hill_Autonomous_Zone",
			"added": 1591795511
		},
		{
			"topic_id": 1591876601,
			"title": "KiwiPedia; is it an abandoned project?",
			"body": "I've tryed to import wikipedia page of CHAZ (the Zone - Autonomous Zone on Capitol Hill) in KiwiPedia; is it an abandoned project? I've not seen hubs",
			"added": 1591876597
		},
		{
			"topic_id": 1592496583,
			"title": "org-mode files on ZeroNet",
			"body": "I wish to nice formatting org-mode files on a text based Zite,\nhave you got any suggestions?\n\nfor example, it could be cool include interactively (but I don't know how)\n-  https://github.com/jessekelly881/Imagine - A theme for org mode exports using professional web development techniques. Designed to be simple but also creative. \n-  https://github.com/jessekelly881/Rethink Another in the line of beautiful css themes for org exports using professional web development techniques. Targeted at clean, technical content. \n\nas a top solution a Zite like https://org-web.org/",
			"added": 1592496578
		},
		{
			"topic_id": 1592974194,
			"title": "Twitter Bans Journalist Organization for Linking to Leaked Secret Police Files",
			"body": ">Twitter confirmed on Tuesday night that it had permanently banned the account of Distributed Denial of Secrets, a journalist organization that earlier this week made accessible to the public one of the largest repositories of leaked U.S. law enforcement documents to date... https://gizmodo.com/twitter-bans-journalist-organization-for-linking-to-lea-1844142166\n\nZeroNet!\n*Open, free and uncensorable websites*",
			"added": 1592974188
		},
		{
			"topic_id": 1604321375,
			"title": "A script for zite's ownership",
			"body": "Often I loose ownership on my zites and when this happens I need to visit all my loosed zites (even my ZeroMe hub and my Gallery hub) and select ownership; which are commands that I can include in a script that automatically set this parameter?",
			"added": 1604321368
		},
		{
			"topic_id": 1604872780,
			"title": "Tor Browser 10 (Firefox) issue",
			"body": "In new versions of Tor Browser it's not possible to access at *about:config*, so \n*no_proxies_on* could not be set on *localhost,127.0.0.1*\n\nhttps://www.reddit.com/r/TOR/comments/jnlqwb/tor_browser_1003_android_aboutconfig_not_working/\n\nFirefox issue\nhttps://support.mozilla.org/lt/questions/1300502",
			"added": 1604872772
		},
		{
			"topic_id": 1605824826,
			"title": "European Union Moves To Outlaw Encrypted Apps",
			"body": "The European Union is moving to ban end-to-end encrypted communication. \n\nAn EU council of ministers resolution spearheaded by French Prime Minister Emmanuel Macron and Austrian Chancellor Sebastian Kurz of the conservative Austrian People's Party would mandate that apps such as Telegram, Signal, and WhatsApp provide European intelligence services with backdoor access in order to allow them to better monitor the conversations of their citizens...\n\nhttps://www.zerohedge.com/political/european-union-moves-outlaw-encrypted-apps",
			"added": 1605824817
		},
		{
			"topic_id": 1607776599,
			"title": "Beyond The Paranoid Style - QAnon",
			"body": "Some QCards on How Italian Literature and Italian Counterculture Experimented With Ways of Covering and Creatively Debunking Conspiracism.\nDepartment of Languages, Literatures and Cultures, McGill University, Montréal, September 30th, 2018.\n\nhttps://www.wumingfoundation.com/giap/2018/09/cospirazionismo-qanon-pendolo-foucault/#english",
			"added": 1607776589
		}
	],
	"topic_vote": {
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1592878565_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"1541621809_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1588386916_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1597198574_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": 1,
		"1597818504_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1598171709_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1598564669_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1599146530_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1597083511_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": 1,
		"1601057110_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1601382291_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN": 1,
		"1602618933_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": 1,
		"1603284377_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1604061320_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1604144267_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1604257651_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1604495423_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1,
		"1607096892_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607575526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1607613860_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1607909105_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1607947918_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1
	},
	"next_comment_id": 88,
	"comment": {
		"1591273076_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 1,
				"body": "It could be useful a ZeroTalk<->Telegram bridge",
				"added": 1591529008
			}
		],
		"1591530136_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 2,
				"body": "I know everything, but I think there're too few contents on ZeroNet; I suppose most of us lurke on other platforms, as I do, so some bridges I think could be useful for ZeroNet users to remain on this fantastic environment even to read those external contents\n\nWe can think of it as a sort of federation",
				"added": 1591552218
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 3,
				"body": "# Get In the Zone: A Report from the Capitol Hill Autonomous Zone in Seattle\n\nThe following is an interview with a Seattle resident who has been out on the streets during the recent uprising and watched as both vigilantes, police, and the National Guard have attacked protesters in the Capital Hill neighborhood. Now, after over a week of intense rioting and clashes with the authorities, Seattle police have evacuated...\n\nhttps://itsgoingdown.org/get-in-the-zone/",
				"added": 1591795583
			},
			{
				"comment_id": 4,
				"body": "# The Birth of the Capitol Hill Autonomous Zone\n\n**Solidarity in Seattle’s Autonomous Zone: Building community power**\n\nThe capitalist class in American society has been in a state of denial over the growing disenfranchisement of the people who live here and create all the wealth. BIPOC communities and the LGBTQ+ community have been mistreated and abused for the entire history of the United States. In doing so, the capitalist class has sold the working class down the river with a worldwide war on the workers, the most recent wave of attacks begins with the founding of the World Trade Organization, and it is here where the story of Capitol Hill picks up. \n\nhttps://industrialworker.org/the-birth-of-the-capitol-hill-autonomous-zone/",
				"added": 1591813221
			},
			{
				"comment_id": 5,
				"body": "# THE DEMANDS OF THE COLLECTIVE BLACK VOICES AT FREE CAPITOL HILL TO THE GOVERNMENT OF SEATTLE, WASHINGTON\n\nIn credit to the people who freed Capitol Hill, this list of demands is neither brief nor simplistic. This is no simple request to end police brutality. We demand that the City Council and the Mayor, whoever that may be, implement these policy changes for the cultural and historic advancement of the City of Seattle, and to ease the struggles of its people. This document is to represent the black voices who spoke in victory at the top of 12th & Pine after 9 days of peaceful protest while under constant nightly attack from the Seattle Police Department. These are words from that night, June 8th, 2020.\nFor ease of consideration, we’ve broken these demands into four categories: The Justice System, Health and Human Services, Economics, and Education.\n\n# Given the historical moment, we’ll begin with our demands pertaining to the Justice System.\n\n    The Seattle Police Department and attached court system are beyond reform. We do not request reform, we demand abolition. We demand that the Seattle Council and the Mayor defund and abolish the Seattle Police Department and the attached Criminal Justice Apparatus. This means 100% of funding, including existing pensions for Seattle Police. At an equal level of priority we also demand that the city disallow the operations of ICE in the city of Seattle.\n\n    In the transitionary period between now and the dismantlement of the Seattle Police Department, we demand that the use of armed force be banned entirely. No guns, no batons, no riot shields, no chemical weapons, especially against those exercising their First Amendment right as Americans to protest.\n\n    We demand an end to the school-to-prison pipeline and the abolition of youth jails. Get kids out of prison, get cops out of schools. We also demand that the new youth prison being built in Seattle currently be repurposed.\n\n    We demand that not the City government, nor the State government, but that the Federal government launch a full-scale investigation into past and current cases of police brutality in Seattle and Washington, as well as the re-opening of all closed cases reported to the Office of Police Accountability. In particular, we demand that cases particular to Seattle and Washington be reopened where no justice has been served, namely the cases of Iosia Faletogo, Damarius Butts, Isaiah Obet, Tommy Le, Shaun Fuhr, and Charleena Lyles.\n\n    We demand reparations for victims of police brutality, in a form to be determined.\n\n    We demand that the City of Seattle make the names of officers involved in police brutality a matter of public record. Anonymity should not even be a privilege in public service.\n\n    We demand a retrial of all People in Color currently serving a prison sentence for violent crime, by a jury of their peers in their community.\n\n    We demand decriminalization of the acts of protest, and amnesty for protestors generally, but specifically those involved in what has been termed “The George Floyd Rebellion” against the terrorist cell that previously occupied this area known as the Seattle Police Department. This includes the immediate release of all protestors currently being held in prison after the arrests made at 11th and Pine on Sunday night and early Saturday morning June 7th and 8th, and any other protesters arrested in the past two weeks of the uprising, the name Evan Hreha in particular comes to mind who filmed Seattle police macing a young girl and is now in jail.\n\n    We demand that the City of Seattle and the State Government release any prisoner currently serving time for a marijuana-related offense and expunge the related conviction.\n\n    We demand the City of Seattle and State Government release any prisoner currently serving time just for resisting arrest if there are no other related charges, and that those convictions should also be expunged.\n\n    We demand that prisoners currently serving time be given the full and unrestricted right to vote, and for Washington State to pass legislation specifically breaking from Federal law that prevents felons from being able to vote.\n\n    We demand an end to prosecutorial immunity for police officers in the time between now and the dissolution of the SPD and extant justice system.\n\n    We demand the abolition of imprisonment, generally speaking, but especially the abolition of both youth prisons and privately-owned, for-profit prisons.\n\n    We demand in replacement of the current criminal justice system the creation of restorative/transformative accountability programs as a replacement for imprisonment.\n\n    We demand autonomy be given to the people to create localized anti-crime systems.\n\n    We demand that the Seattle Police Department, between now and the time of its abolition in the near future, empty its “lost and found” and return property owned by denizens of the city.\n\n    We demand justice for those who have been sexually harassed or abused by the Seattle Police Department or prison guards in the state of Washington.\n\n    We demand that between now and the abolition of the SPD that each and every SPD officer turn on their body cameras, and that the body camera video of all Seattle police should be a matter of easily accessible public record.\n\n    We demand that the funding previously used for Seattle Police be redirected into: A) Socialized Health and Medicine for the City of Seattle. B) Free public housing, because housing is a right, not a privilege. C) Public education, to decrease the average class size in city schools and increase teacher salary. D) Naturalization services for immigrants to the United States living here undocumented. (We demand they be called “undocumented” because no person is illegal.) E) General community development. Parks, etc.\n\n# We also have economic demands that must be addressed.\n\n    We demand the de-gentrification of Seattle, starting with rent control.\n\n    We demand the restoration of city funding for arts and culture to re-establish the once-rich local cultural identity of Seattle.\n\n    We demand free college for the people of the state of Washington, due to the overwhelming effect that education has on economic success, and the correlated overwhelming impact of poverty on people of color, as a form of reparations for the treatment of Black people in this state and country.\n\n    We demand that between now and the abolition of the SPD that Seattle Police be prohibited from performing “homeless sweeps” that displace and disturb our homeless neighbors, and on equal footing we demand an end to all evictions.\n\n    We demand a decentralized election process to give the citizens of Seattle a greater ability to select candidates for public office such that we are not forced to choose at the poll between equally undesirable options. There are multiple systems and policies in place which make it impractical at best for working-class people to run for public office, all of which must go, starting with any fees associated with applying to run for public office.\n\n# Related to economic demands, we also have demands pertaining to what we would formally call “Health and Human Services.”\n\n    We demand the hospitals and care facilities of Seattle employ black doctors and nurses specifically to help care for black patients.\n\n    We demand the people of Seattle seek out and proudly support Black-owned businesses. Your money is our power and sustainability.\n\n    We demand that the city create an entirely separate system staffed by mental health experts to respond to 911 calls pertaining to mental health crises, and insist that all involved in such a program be put through thorough, rigorous training in conflict de-escalation.\n\n# Finally, let us now address our demands regarding the education system in the City of Seattle and State of Washington.\n\n    We demand that the history of Black and Native Americans be given a significantly greater focus in the Washington State education curriculum.\n\n    We demand that thorough anti-bias training become a legal requirement for all jobs in the education system, as well as in the medical profession and in mass media.\n\n    We demand the City of Seattle and State of Washington remove any and all monuments dedicated to historical figures of the Confederacy, whose treasonous attempts to build an America with slavery as a permanent fixture were an affront to the human race.\n\nhttps://medium.com/@seattleblmanon3/the-demands-of-the-collective-black-voices-at-free-capitol-hill-to-the-government-of-seattle-ddaee51d3e47",
				"added": 1591824396
			},
			{
				"comment_id": 6,
				"body": "*Although we have liberated Free Capitol Hill in the name of the people of Seattle, we must not forget that we stand on land already once stolen from the Duwamish People, the first people of Seattle, and whose brother, John T. Williams of the Nuu-chah-nulth tribe up north was murdered by the Seattle Police Department 10 years ago.*\n\n    Black Lives Matter — All day, Every day.",
				"added": 1591829939
			},
			{
				"comment_id": 8,
				"body": "The #CHAZ is doing well, people are safe, and if you want to know what’s happening on the ground all you need to do is go there.\n\nDocumenting Misinformation \"https://twitter.com/hashtag/CHAZ?src=hash is out of food, supplies have been stolen by homeless, warlords running the community, people have given up and it is shutdown\" Food is plentiful...\n\n\nhttps://twitter.com/sluttypuppytown/status/1271104644689694721",
				"added": 1591895978
			},
			{
				"comment_id": 9,
				"body": "The *Capitol Hill Autonomous Zone* née \"Free Capitol\" is a 6 block section around the East Precinct in Seattle, WA. Abandoned by police and left to burn, this area was instead siezed by anarchists, BLM supporters and other protestors who have since transformed it into an emerging community based on mutual aid.\n\nEstablished on June 8th 2020 in the midst of nationwide civil unrest triggered by the murder of George Floyd the CHAZ is still young. Within the self governed blocks you can find food vendors, daily marches, public film screenings and community councils hosted throughout the day.\n\nOn this page you can find more information on the protestor's [demands](https://capitolhillautonomous.zone/demands.html) or check out a [gallery of images](https://capitolhillautonomous.zone/life.html) from inside. A stream hosted by SeattleProtest2020 has 5 cameras just outside the CHAZ and can be viewed [live](https://capitolhillautonomous.zone/live.html) as well.\n\nhttps://capitolhillautonomous.zone/",
				"added": 1591898652
			},
			{
				"comment_id": 10,
				"body": "# Zone À Défendre @ZAD_NDDL\n\nNaissance de la #CHAZ à Seattle. \n\nLongue vie au #zad et autres #communes",
				"added": 1591911711
			},
			{
				"comment_id": 11,
				"body": "#Chicago - from a comrade: \n\n\"Currently a blockade and occupation of University of Chicago Police Department  in Hyde Park. Dance party in the street, people inside, and  dumpster and car barricades on the street.\" Reports that 6-7 tents  are up.\n\n#Chicago - does this occupation have a name yet? \n\nThis whole thread has good updates from #HydePark\n\nhttps://twitter.com/delvecchiograce/status/1271654211827257345?s=20\n\nhttps://twitter.com/chicago_commune/status/1271643859186049024\n\n#UCAZ (?) / protestor-occupied #Chicago - help them out!",
				"added": 1592116194
			},
			{
				"comment_id": 12,
				"body": "#Philadelphia occupation zone going STRONG! \n\nhttps://twitter.com/vicky_acab/status/1271950913721315328",
				"added": 1592116447
			},
			{
				"comment_id": 13,
				"body": "#Portland Autonomous Zone\n\nTonight!\n\nMeet at the justice center\n\nOrganized by trusted Bipoc Organizers",
				"added": 1592116676
			},
			{
				"comment_id": 14,
				"body": "Due to a misinformation campaign (ran mostly by the police) coming out of #CHAZ, I will be creating a collection of twitter accounts of people who are actually on the ground and their reporting is known to be valid. If you have any suggestions of other accounts to add to this list, please contact @BLMProtestsBot\n\n1. https://twitter.com/IwriteOK\n2. https://twitter.com/MaxGeopolitics\n3. https://twitter.com/Omarisal",
				"added": 1592116708
			},
			{
				"comment_id": 15,
				"body": "https://twitter.com/natalie_allison/status/1271579829234798592?s=20",
				"added": 1592116753
			},
			{
				"comment_id": 16,
				"body": "#LeT A  THOUSAND  AUTONOMOUS ZONeS BLoOM",
				"added": 1592116984
			},
			{
				"comment_id": 17,
				"body": "#Meet the Farmer Behind CHAZ's Vegetable Gardens\n\nOf all the horrors emerging from the Capitol Hill Autonomous Zone, perhaps none is so menacing as the sight of a community garden full of tomato seedlings sprouting inside of coronavirus circles. \n\nhttps://www.thestranger.com/slog/2020/06/12/43897621/meet-the-farmer-behind-chazs-vegetable-gardens",
				"added": 1592117142
			},
			{
				"comment_id": 18,
				"body": "#CHAZ on occupied Duwamish land\nhttps://twitter.com/AGarlandPhoto/status/1272007157412622336?s=20",
				"added": 1592180047
			},
			{
				"comment_id": 19,
				"body": "# ‘To see this, I am honored’: Brother of man killed by Seattle police reflects on time in CHAZ\n\nRick Williams was walking through Seattle’s Capitol Hill Autonomous Zone when he stopped to read a sign, held by a person sitting near the entrance to Cal Anderson Park. The sign listed names of those killed by law enforcement officers in Washington state – more than a dozen on the cardboard...\n\nhttps://www.seattletimes.com/seattle-news/to-see-this-i-am-honored-brother-of-man-killed-by-seattle-police-reflects-on-time-in-chaz/",
				"added": 1592180776
			},
			{
				"comment_id": 20,
				"body": "# Support the Minneapolis Sanctuary Movement\n\nAt 8pm on Friday, May 29 2020, just blocks from the epicenter of the uprising fighting for justice for George Floyd in the streets of south Minneapolis, armored vehicles and hundreds of national guard advanced on Hiawatha Avenue.\n\nThe curfew was in effect and the state offered no options in Minneapolis for an unsheltered couple camped outside. The shelters were full, and the hotels promised to the large encampment left them and many others behind.\n\nThey finally found refuge in a hotel a few blocks away...\n\nhttps://www.gofundme.com/f/sanctuaryhotel",
				"added": 1592180916
			},
			{
				"comment_id": 21,
				"body": "#CampMaroon (Philadelphia)\nhas been growing, and has issued a set of abolitionist demands. Please support them and amplify their struggle.\n\nhttps://twitter.com/IGD_News/status/1272035042508697600",
				"added": 1592292752
			},
			{
				"comment_id": 22,
				"body": "> [0435048ijg](#comment_37_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5): fake news. Raz is not the leader of the commune. There are no leaders.\n\nAnother warning that BLM as a movement has no leadership. Anyone who claims to be a leader should immediately be suspect.\n\nhttps://t.me/BLMProtests/4302",
				"added": 1592293192
			},
			{
				"comment_id": 23,
				"body": "#CROPS NOT COPS",
				"added": 1592299612
			},
			{
				"comment_id": 24,
				"body": "Today at the #CHAZ city workers came and removed barricades that ppl have been defending with their lives. They placed concrete barriers instead that route traffic back through the zone. SDOT and SFD cited formal negotiations with leadership...\n\nhttps://twitter.com/nobodypays/status/1272944180151508992?s=20",
				"added": 1592334225
			},
			{
				"comment_id": 25,
				"body": "some sudoroom-like people are setting up \n#mesh wifi there\n\nhttps://toot-lab.reclaim.technology/@djsundog/104337392980907379",
				"added": 1592363517
			},
			{
				"comment_id": 26,
				"body": "Fox News runs digitally altered images in coverage of Seattle’s protests, Capitol Hill Autonomous Zone\n\nhttps://www.seattletimes.com/seattle-news/politics/fox-news-runs-digitally-altered-images-in-coverage-of-seattles-protests-capitol-hill-autonomous-zone/",
				"added": 1592374386
			},
			{
				"comment_id": 27,
				"body": "[Robert Evans](https://twitter.com/iwriteok/status/1273156963795447808): *The sister of the guy trying to spur violence in the CHAZ [has posted a thread about him](https://t.co/eXdQusNGew) and, holy shit, what a piece of human garbage.*",
				"added": 1592380629
			},
			{
				"comment_id": 28,
				"body": "'Everybody I've talked to feels significantly safer': A protester living near Seattle's 'autonomous zone' explains why the neighborhood is better without cops\n\nhttps://www.insider.com/inside-chaz-seattle-autonomous-zone-police-expelled-george-floyd-protest-2020-6",
				"added": 1592383384
			},
			{
				"comment_id": 29,
				"body": "# CampMaroon \nis an Autonomous Zone in Philadelphia, started by mostly houseless POC.  Their demands are housing, and an end to police harassment.  This should be getting the same attention #CHAZ is getting.  People are taking care of each other without police.\n\nhttps://nitter.net/coridurdy/status/1272143661149548544",
				"added": 1592387477
			},
			{
				"comment_id": 31,
				"body": "*PNW Youth Liberation Front*\n\n\nThis has been declared the\n\n# Patrick Kimmons autonomous zone\n\nand by request of Patrick’s mother we are demanding for the reopening Patrick’s case, along with abolishing the PPB and the stolen land we call Portland. \n\nhttps://t.co/g3BaRjtlvi",
				"added": 1592489903
			},
			{
				"comment_id": 35,
				"body": "> [schiz0@kxoid.bit](#comment_31_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): PNW Youth Liberation Front [...]\n\n# PKAZ was short lived. \nCops have cleared the area\n\nhttps://twitter.com/WillontheRadio/status/1273697374460801024",
				"added": 1592554024
			},
			{
				"comment_id": 37,
				"body": "# [CHAZ on KiwiPedia](/1KiwiBCVBUcuypVm8FEmUW9YT6fJDXkN9r/?/imported/en/https-en-wikipedia-org-wiki-capitol-hill-autonomous-zone/capitol-hill-autonomous-zone)",
				"added": 1592587710
			},
			{
				"comment_id": 39,
				"body": "# “Every Day!”: A View on the Capitol Hill Autonomous Zone\n\n... In this podcast special, you’ll hear a fresh conversation with D. D is a Black Anarchist who grew up in and around Capitol Hill district in Seattle...\n\nhttps://thefinalstrawradio.noblogs.org/post/2020/06/17/every-day-a-view-on-the-capitol-hill-autonomous-zone/",
				"added": 1592588917
			},
			{
				"comment_id": 41,
				"body": "Report from within the last hour via trusted source on the ground: Two people shot inside the CHAZ. Appears to have been two different locations where people were shot. No present information on the nature of these shootings. Victims evacuated to hospital. One DOA. Reach out to your people out there.\n\nFurther information and specifics on the shootings last night in the CHAZ/CHOP in this report. \n\nhttps://www.capitolhillseattle.com/2020/06/one-reported-dead-one-wounded-in-overnight-capitol-hill-protest-zone-shooting/",
				"added": 1592689069
			},
			{
				"comment_id": 42,
				"body": "An update on the shooting inside the Seattle's CHOP / Autonomous Zone:\n\nI talked to a medic who treated the man who died. He said they tried to get the Fire Department to come help. But the crews wouldn't come in the zone.\n\nhttps://www.nytimes.com/2020/06/20/us/seattle-chop-shooting.html#click=https://t.co/QjXD0VpMfH",
				"added": 1592747984
			},
			{
				"comment_id": 44,
				"body": "CHAZ/CHOP has fallen - Seattle Police retake anarchist-held CHAZ\n\nhttps://twitter.com/JackPosobiec/status/1278310517577265153",
				"added": 1593724782
			},
			{
				"comment_id": 45,
				"body": "When CHOP was first built, Seattle Police falsely accused CHOP of setting up ID check points, closing businesses, and terrorizing residents by patrolling the streets. They are now doing all of that and more, and claiming they have the authority to continue doing it for 10 days.\n\nhttps://twitter.com/spekulation/status/1279085779461918720?s=21",
				"added": 1593804125
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 7,
				"body": "Not only\n> White and Black aren't same\nBut we are ALL different eachother\n\nSo?\nSo we need to appreciate this as the fundamental vital interaction with life\n\nAnyone need to live toghether not only with other humans, but with anything (exluding racists fascists sexists)",
				"added": 1591868182
			}
		],
		"1592496583_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 36,
				"body": "# Parsing org-mode files in Javascript\n\n*I like parsers and compiler theory, so I have written a small parser (by hand) that is able to parse your example snippet into a XML DOM Document object. It shoul be possible to modify it so that it produces an other type of tree structure...*\n\nhttps://stackoverflow.com/a/6452477",
				"added": 1592585099
			},
			{
				"comment_id": 40,
				"body": "# organice\n is a web application. You can use it from any browser. On iOS and Android, you can install organice to your homescreen. When started from there, it will run in full-screen and add some offline capabilities.\n\nhttps://github.com/200ok-ch/organice/blob/master/README.org",
				"added": 1592589982
			}
		],
		"1591876601_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 38,
				"body": "no!\n\nafter a lot of time kiwipedia hubs are in sync on my device so...\n# [CHAZ on KiwiPedia](/1KiwiBCVBUcuypVm8FEmUW9YT6fJDXkN9r/?/imported/en/https-en-wikipedia-org-wiki-capitol-hill-autonomous-zone/capitol-hill-autonomous-zone)",
				"added": 1592587932
			}
		],
		"1592878565_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 43,
				"body": "Why not on ZeroNet?",
				"added": 1592899596
			}
		],
		"1598453797_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [],
		"1600134285_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 47,
				"body": "> [kaffie](#comment_1148_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ... Why nofish added kxoid and not kaffieid as a valid cert signer, I have no idea...\n\nWhy is needed nofish to add kxoid and kaffieid?",
				"added": 1600170121
			},
			{
				"comment_id": 48,
				"body": "> [spiritus](#comment_6_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN): Because his the owner of ZeroTalk\n\nAh, ok! So if I'm the owner of a ZeroTalk clone there's no problem because I can accept those ids, right?",
				"added": 1600197726
			},
			{
				"comment_id": 49,
				"body": "> [kaffie](#comment_1150_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): correct. if you clone the site then you can put whatever ID providers you want.\n\ndone: on [ZeroTalkItalia++](/1F7TpbhQiKbERqvuYm92yg7uapy5Qb7qrD/) I've added KaffieID and KxoID in *\"cert_signers\"*\n\nI've some Off Topic questions for you, *kaffie*: \n\n- my KaffieID (1P8mVfz49P4g5@kaffie.bit) is not recognized as *[fluss0@kaffie.bit](/Me.ZeroNetwork.bit/?Profile/1BbXU2hYZKRDj41JhYDc1L2g8JEb45U97c/1P8mVfz49P4g5NWFmpFT9BcejHJBy2ybFF/fluss0@kaffie.bit)*, this profile is hosted on my personal hub [SchizoHub](/1BbXU2hYZKRDj41JhYDc1L2g8JEb45U97c/) (I've migrated my profile with [ZeroMe Unfuck](/1QHbf72f4vdx3QAxN1LTN9KP19J428Q85R/))\n, what can I do?\n\n- also in *SchizoHub* (in *data/users/content.json*) I've added KaffieID and KxoID in *\"cert_signers\"*, is this correct?\n\n- *SchizoHub* is cloned from *WhiteHub*, can I change his address with KaffieHub (1KH5BdNnqxh2KRWMMT8wUXzUgz4vVQ4S8p) and update the code?",
				"added": 1600250470
			},
			{
				"comment_id": 50,
				"body": "> [kaffie](#comment_1151_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Kaffie hub is quite literally just a clone of the red/blue hubs [...]\n\nAh! Ok! I was thinking KaffieHub was quiet different\n\nThank you for your answers",
				"added": 1600271869
			},
			{
				"comment_id": 52,
				"body": "> [kaffie](#comment_1151_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There's two places the \"fluss0@kaffie.bit\" would appear. The first is in your certs/keys file, which if you registered like normal should properly be set. [...]\n\nin my *data/users.json* I've\n\n```\n   \"kaffie.bit\": {\n    ...\n    \"auth_user_name\": \"1P8mVfz49P4g5\"\n    ...\n   }\n```\n\nin previous *users.json* backup it was \"fluss0\" (I don't know what was happen); can I change manually this value?",
				"added": 1600333417
			}
		],
		"1600266690_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 51,
				"body": "I hear all your fikes and I've finished all their download",
				"added": 1600273515
			},
			{
				"comment_id": 53,
				"body": "> [smashbuckler](#comment_7_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Nope, still the same error with loading spinner and console error. I even tried from my other machine with other identity and access point - still the same.\n\nhave you tried to update/check IFS Cluster 0 & 1?",
				"added": 1600797938
			},
			{
				"comment_id": 54,
				"body": "> [smashbuckler](#comment_10_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): ... On each of them, after clicking \"Update\"...\n\nI often use *Check Files*, it seems useful when updating fails",
				"added": 1600945777
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 55,
				"body": "I admire your activism\n\nI think your vision is necessary\n\na really good \"environment\" needs to be collective",
				"added": 1603614670
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 56,
				"body": "Linux 4.18\nAndroid 10 (and I think *ZeroNet Mobile* is very important)",
				"added": 1603696578
			},
			{
				"comment_id": 57,
				"body": "> are you ready to install a driver for creating your own ZeroNet sites?\n\nMy principal sites are published (on ZeroNet, web and fediverse) with Emacs + org-mode + rss",
				"added": 1603697949
			},
			{
				"comment_id": 58,
				"body": "> [geekless](#comment_270_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Edit files? [...] you just edit files, sign files, and it works...\n\n# I love this freedom!\n\nI would like a cl interface to foundamental zites like ZeroTalk and ZeroMe, indeed I already interact thanks to Binchan's bridges... I think that a scalable interface (from complex to simple, as a user's choice) is important",
				"added": 1603702842
			},
			{
				"comment_id": 59,
				"body": "> [geekless](#comment_272_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): That doesn't look like going to be constructive. I'd rather quit here. Sorry.\n\nNooo",
				"added": 1603703868
			}
		],
		"1603755757_1Hw1SFwzVQyXP7mCCzWhTxqgKAZxQbvtEK": [
			{
				"comment_id": 60,
				"body": "With Binchan's feedbots you can import external feeds on ZeroBlog ZeroTalk and ZeroMe\n\nhttp://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?13zzNGxEXDeLxHEGZdG3mE7G8dChf45LrV",
				"added": 1603774043
			}
		],
		"1604219688_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 61,
				"body": "> [soulscience](#comment_2_1BGbPKebmViMTLZCXFyTW39G11yx6Qz3Ej): ZeroTalk++, no doubt. I don't know about the technical aspects of ZN so I can only talk from a user perspective - But ZN sorely needs de facto standard and cloneable zites so users can easily start creating their own content and spaces. [...]\n\nI agree with you\n\n@geekless4 I'm happy for your disponibility",
				"added": 1604237756
			}
		],
		"1604321375_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 62,
				"body": "> [styromaniac](#comment_2659_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Also beware that deleting a site of yours deletes the private key even when it's not marked as your own.\n\nI've not deleted any of these zites",
				"added": 1604323838
			}
		],
		"1604257922_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr": [
			{
				"comment_id": 63,
				"body": "> [pornzero](#comment_1_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr): | Someone (binchan?) made a chat app... [...] Any link ?\n\nhttp://127.0.0.1:43110/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:35",
				"added": 1604349931
			}
		],
		"1604374389_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": [
			{
				"comment_id": 64,
				"body": "In conten.json\n\n(in the root directory of your forum) you've to add your topic uri in \"topic_sticky_uris\", for exampke:\n\n```\n\"settings\": {\n...,\n\"topic_sticky_uris\": [\"1604374389_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG\",\"...\"]\n},\n....\n````\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565456974_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n",
				"added": 1604383960
			}
		],
		"1604109014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 65,
				"body": "@styromaniac I don't understand if you're serious or this is a joke.\n\nYou're a trumpist! No, I can't believe it",
				"added": 1604477052
			},
			{
				"comment_id": 67,
				"body": "> [styromaniac](#comment_2663_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Can you see people without a political lens?\n\nNo, I think we need an ideological point of view, I think Trump is a whole with all his troups of phanatic white suprematists, fascists, religious, homophobic capitalists... Even if he could have said something a little little little interesting\n\nYes, I know, why we should vote for a less wrong when we can vote for the biggest one... \n\nBut no, I think that even with a lot of errors we need to stay human and, no, Trump is not\n\nis Biden not better? That's don't matter\n\nAnyway I don't want to have a flame with you, I had the dubt on this posts, they seemed to me a joke",
				"added": 1604502957
			},
			{
				"comment_id": 68,
				"body": "> [styromaniac](#comment_2665_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You haven't watched videos by K-von.\n\nNo\n\nI don't understand it because of my poor english\n\nanyway Trump is Trump, everytime he says something; we can hear a background of racism, arrogance, intollerance and a taste of disgusting supremacy\n\nAlso with Mussolini and Hitler, there is someone (not extremists) who says they've done something good; it's not important, they represent a human degeneration, a brutal expression of what we can do lightened with the oblivion",
				"added": 1604505467
			},
			{
				"comment_id": 69,
				"body": "> [styromaniac](#comment_2666_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I understand it and it's the opposite of what you think.\n\nAh, ok, so I've misunderstand this topic, I'm sorry... and this make me happy",
				"added": 1604507907
			},
			{
				"comment_id": 70,
				"body": "> [styromaniac](#comment_2667_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yeah. Mainstream media ignored him saying how he dislikes racism many times. He said he doesn't care what bathroom Kaitlin Jenner uses. He's not said the bad things they say he did. It was clipped up and taken out of context. Only one exception was \"Grab 'em by the pussy\" and he apologized for it.\n\nThe same Berlusconi's movie; since then fascists & C. crawl out from sewer",
				"added": 1604537847
			},
			{
				"comment_id": 71,
				"body": "> [styromaniac](#comment_2669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Look, you have to watch KvonComedy.\n\nI've watched the video\n\nI'm waiting for the NaziPsychopatic American Civil War",
				"added": 1604665059
			},
			{
				"comment_id": 72,
				"body": "> [styromaniac](#comment_2671_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You didn't absorb any information then and you haven't watched more than one of his videos.\n\nNo, I've watched only one video and probably I don't have understand; Biden is disgusting, but I don't believe in any Trump's word\n\nIn the meanwhile I try to follow the Trump's agony, with his dangerous delirium",
				"added": 1604670574
			},
			{
				"comment_id": 73,
				"body": "> [styromaniac](#comment_2672_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ... his words were taken out of context. He's not a fascist, racist, nor homophobe...\n\nI'm sorry, I've understand this, but I don't believe in those declarations; Trump is even more disgusting if he had tryed to say that for a bunch of votes",
				"added": 1604698605
			},
			{
				"comment_id": 74,
				"body": "> [lrrr](#comment_1_14nXE35PtSxwgFdZfBGg7LicFNH21GwJDC): So much fraud and censorship.\n\nDon't worry\n\n> 60 million people have voted for a man who spent the last four years playing golf and tweeting...\n\nCan you believe that? 60 million.\n\n> The real winner in all this is clear. It’s Donald Trump, and everyone who thinks like him. Even if he loses the election, even if he goes to jail, he won. He figured out what America really wants.\n\n**The End of The World**\ndelivered on demand, 24–7\n\n+hydroxychloroquine for all",
				"added": 1604735167
			},
			{
				"comment_id": 75,
				"body": "Deep web Comrades, don't worry! \nthe Real Winner is Donal Trump\n\nbe quiet, drink a beer and wait for an\nimminent lightened future\n\ngod, oil, guns and sars-cov 2 are with us, in sales, 50% less!",
				"added": 1604834105
			}
		],
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 66,
				"body": "> [geekless](#comment_275_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): I missed that long post somehow. My answer is: any big work can be done by little steps. Provided that someone actually makes those steps. [...]\n\nThank you for your work",
				"added": 1604501088
			}
		],
		"1604872780_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 76,
				"body": "> [styromaniac](#comment_2676_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Cannot Complete Request [...]\n\nIt's ridiculous",
				"added": 1604874436
			},
			{
				"comment_id": 77,
				"body": "> [rolouzis](#comment_5_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): works for me!network.proxy.no_proxies_on    127.0.0.1:43110\n\nHow have you setted this?",
				"added": 1604916138
			},
			{
				"comment_id": 78,
				"body": "> [rolouzis](#comment_6_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): I am working with latest version nowcompletely erased last one and:about:confignetwork.proxy.no_proxies_on is hereunder you can write whatever proxyworks for me\n\nI've tryed to erase and reinstall, but it don't works",
				"added": 1604919367
			}
		],
		"1607096892_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 79,
				"body": "I think it could be useful a sort of user/channel feed",
				"added": 1607101267
			}
		],
		"1607500928_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 80,
				"body": "I've active sites (readeable from clearnet thanks to proxies)\nI post on ZeroMe and ZeroTalks\nI upload my sound experiments on IFS\nI've some galleries on a personal hub\n\nI think very few peoples read these posts but it's not matter; I've always liked to publish my contents myself, p2p is the most anarchic and autonomous way of publishing and ZeroNet is the most simple and feature rich p2p environment. From the early years of the net only a bunch of coders artists visionairs mads had populated new lands at the end of the world; this is cool",
				"added": 1607537255
			},
			{
				"comment_id": 81,
				"body": "> [reichardnixon](#comment_108_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): At least on zeronet its real people looking rather than bots.\n\nno, I also have bots (simple automatic newsreaders) :)",
				"added": 1607537858
			},
			{
				"comment_id": 82,
				"body": "> [radiator](#comment_9_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): I just don't know who is seeing anything I DO post. for example, I decided to do a \"journal\" of one pic a day and write a microblog about it, but I haven't gotten any \"likes\", and I have no idea of the view count. Sure, there might be lurkers viewing it, but I have no clue how I would know. FWIW, here it is (I think - I'm actually not sure how to share it, either): http://127.0.0.1:43110/1H8hYdFAtHikXWa617JbxDZoyoc6RJpWHY/\n\nI'm a knitter too!\nalso a weaver...\nand I'm working on my house... among other things\n\n- first site (in emacs+org-mode): http://127.0.0.1:43110/15Aj7PkCPHfCHqNFUnEMoKBDwqHAJ7b9Q6/\n- updates on a zeroblog followable from zerohello: http://127.0.0.1:43110/15kh9UYTAoscNt3ofZ9Y8DrFZMYgeVyLPv/",
				"added": 1607538215
			}
		],
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 83,
				"body": "Wow! I'm waiting for a ZeroNet integration; it's what we all need, **the p2p fediverse**",
				"added": 1607585400
			},
			{
				"comment_id": 86,
				"body": "# an experimental [ZeroRamble](/136dgfmQnaxaTVB1GcYhkX4WG1L8uco4AZ/)\n\na [ZeroTalk++](/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/) clone populated with few feeds in a discontinued way; thanks to [FeedBot-ZeroTalk](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?13zzNGxEXDeLxHEGZdG3mE7G8dChf45LrV/FeedBot-ZeroTalk@master)",
				"added": 1607971025
			}
		],
		"1607768344_1GGTrtSNfhkDqJzFw4CaQKDRNSg73QSkGB": [],
		"1607947918_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 85,
				"body": ":)",
				"added": 1607951121
			}
		],
		"1608082804_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 87,
				"body": "Does this means that I can't download any file bigger than 5.24 MB from static sites?\n\nI don't understand;\nCaryoscelus's sites have no problems  \n\n(for example) \n\n- http://127.0.0.1:43110/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/\n\n- http://127.0.0.1:43110/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/",
				"added": 1608103484
			}
		]
	},
	"comment_vote": {
		"527_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"108_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"206_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1_1QBa3qVPi84otXt5PzBgRu9VyqXZ3Hz68Y": 1,
		"535_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": 1,
		"146_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"147_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"14_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": 1,
		"148_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"152_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"200_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"201_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4": 1,
		"108_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"214_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"215_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"218_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"18_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": 1,
		"2526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"222_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"252_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"216_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1148_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1149_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1150_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1151_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"493_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"495_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"496_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"497_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"498_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"504_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"507_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"159_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"13_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"1_1GiGAaP11CvM4XWGHxqtHixfbJyUQTUH6x": 1,
		"1379_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"52_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"1397_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1415_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"9_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN": 1,
		"1161_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"270_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"271_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"25_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": 1,
		"2638_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": 1,
		"2_1BGbPKebmViMTLZCXFyTW39G11yx6Qz3Ej": 1,
		"2653_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"275_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2677_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1Fnmdj3aPDFfvY2zheejDVj7vMRbgoWPVF": 1,
		"23_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"2746_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"12_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"15_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"486_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2810_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}