{
	"next_topic_id": 2,
	"topics": [
		{
			"topic_id": 1,
			"title": "怎樣觀賞中共權鬥大戲",
			"body": "目前上演的中共黨內權鬥大戲，為中共建政六十五年權鬥連續劇中最精彩、最驚心動魄的一集。有道是，外行看熱鬧，內行看門道，除了正在戲中鬥個你死我活的中共領袖們外，我等皆屬看熱鬧的。看熱鬧也得會看，在此我提供一些心得。\n \n　　切勿選邊站\n \n　　過去的戲碼，如：毛澤東鬥劉少奇、林彪，鄧小平鬥華國鋒，江澤民鬥陳希同，胡錦濤鬥陳良宇，雙方力量懸殊，輸贏無懸念，而且大家都把贏者當作正面角色，輸了的都是反角。這次不同了：不但看不出最後誰輸誰贏，而且當人們知道習近平反腐不是為了推行政治改革，最大的目的是鞏固中共貪腐之源的中共一黨專政，是為了清除異己、讓貪腐首惡的中共太子黨永遠掌握最高權力，那麼這齣戲就不再是正義與非正義的主題、也沒有正面角色與反面角色之分了。怎麼分得清習近平與他的對手誰是令狐沖誰是任我行呢？怎麼能斷定到最後習近平一定完勝、他的對手一定嗚呼哀哉呢？別說中國人，就連一向誰上台就看好誰的美國頭號親北京學者沈大偉，這次也捨習近平而去，斷言習近平最後以身敗名裂而謝幕。\n \n　　習近平正全力打擊的所謂「新四人幫」真的怙惡不悛嗎？近日中共的檢察院起訴周永康，有一條說他洩露黨和國家機密罪，如果他洩露的是習近平、溫家寶等權貴家族在海外擁有巨額資產，那不是罪反倒是功勞。最近我聽北京的朋友說：徐才厚是因為主張軍隊國家化、反對黨指揮槍，而受到習近平的整肅，這就可以解釋習近平為什麼一上台便召開新古田會議，比任何時候都強調黨指揮槍了。我又聽北京的另一位朋友說：令計劃是因為與習近平結了私怨才落得今日下場：話說習仲勳二○○二年五月去世，多年之後他一家仍拒絕遷出中南海。其實習仲勳與老伴早已長住深圳，佔用深圳新園迎賓館接待國賓的獨棟小樓。令計劃當上中辦主任，採取行動清理中南海的拒遷戶，收回了包括習家在內的住房，這會不會是習的一個心結？\n \n　　我沒有為周永康、徐才厚、令計劃說好話的意思，我只是說：中共的權鬥，是邪惡對邪惡的爭鬥，你選擇站在任何一邊，都是站在邪惡一邊。他們之間的權力和利益之爭，誰勝誰負，跟中國的民主與人權進步一毛錢關係都沒有，你是看熱鬧的，何必選邊站呢。\n \n　　慎防被忽悠\n \n　　中共的權鬥大戲，的確精彩紛呈、高潮迭起、引人入勝，很容易看得眼花繚亂，被戲中的情節忽悠。我們中的任何人都沒有獲得真實資訊的管道，包括研究中國高層政治的學者，也都與普通網友一樣，主要靠從互聯網上獲得資訊，所謂消息靈通人士，也不過比常人多聽到一些京城耳語。網上資訊之紛亂前所未見，有多少是真實的有價值的消息，有多少是各派政治勢力為抹黑對手而捏造的事實、施放的謠言、編造的故事，都未可知。比如說到周永康，他明明是在政治鬥爭中被打倒，他的對手卻從不講周永康的政治路線錯在什麼地方，人們也不知道作為巨貪他貪了多少。最廣為人知的是他臨到被抓捕的前一天，還開車到一間地下停車場找央視女主播車震。我相信周永康是個淫官，但我不相信周永康大禍臨頭性欲仍旺盛到這種地步。津津樂道於周永康車震，就放過了對周永康踐踏法治與侵害人權罪行的清算，這正是周永康的對手所希望的。又比如說徐才厚，網傳他把幾卡車的人民幣藏在總政治部大樓地下室，讓一位女兵保管，他長期姦污這位女兵卻不兌現答應給女兵的好處，結果被女兵用卡車把人民幣拉走讓他吃了啞巴虧。我相信徐才厚貪污數額巨大，但難以置信他貪的人民幣有幾卡車之多，而且愚蠢到把錢藏在總政治部辦公大樓裡。\n \n　　我們聽到的消息，多數都是權鬥的雙方通過非正式管道散佈出來忽悠民眾的，即使官方媒體發佈的消息也不可信，如今的中共官媒與靠捕風捉影、製作聳人聽聞的標題吸人眼球的低俗網站都在同一個等量級上。如果周永康、徐才厚、令計劃與習近平、王岐山換個位置，污穢的傳言也必然繪聲繪色發生在習、王和任何一位現任當政的正人君子們身上。比如近來胡舒立、郭文貴隔空開戰了，扯出了一個私生子，扯出了王岐山，接著說不定還會扯出什麼人，真真假假、假假真真，真假莫辨。所以我說，觀賞中共權鬥大戲，宜頭腦冷靜清醒、切勿入戲太深，慎防被忽悠。\n \n　　摒棄舊思維\n \n　　要使自己成為真正冷靜的觀察者和思索者，就得讓自己從既有的黨意識慣性思維中解脫出來。多年前，上海芭蕾舞團來美國演出文革八個樣板戲之一《白毛女》，我前去觀看。我竟然如同文革時看這齣戲一樣，差點為戲中的喜兒、楊白勞、大春掬一把同情之淚。坐在我旁邊的是一位美國老太太，散場後問我：做善事、借錢救濟窮人成為罪人，借錢不還、造反殺人反倒有理，中國人是這樣的嗎？我與這位美國老太太的差距在於：我即使已經從中共體制內走了出來，但頭腦中因長期浸淫於黨意識、黨文化中形成的慣性思維仍然作祟，因此我與美國老太太對中國的事情的感受就大不一樣。\n \n　　慣性思維，使我們無法成為中共權鬥大戲的冷眼旁觀者和冷靜思索者，反而在這出醜劇中扮演助紂為虐的角色：我們曾歡呼一九四九年誕生了一個新中國，其實那是千年專制以共產革命的名義，扼殺了一個誕生僅三十八年的民主制度，實現了專制的復辟；我們曾譴責林彪反革命集團，其實他們是中共黨內第一次凝聚的試圖結束毛澤東專制統治的進步力量；我們頌揚在六四屠殺後中國的改革開放，其實鄧小平的改革開放給中國、給中華民族的精神、道德、經濟、社會、生態環境造成的破壞遠超過文革的幾十倍、幾百倍。\n \n　　長期浸淫於中共的黨意識和黨文化而形成慣性思維的中國人，智商低下。中國人唯有摒棄慣性思維，才會具有對中共權鬥冷眼旁觀、冷靜思索的能力。但如果繼續處於中共極權統治之下，中國人獲得高智商幾乎不可能。自中國發生全民被毛澤東驅使為他一人瘋狂的文化大革命，已證明中華民族是個只具有慣性思維的低智民族；自中國出了薄熙來、周永康、徐才厚、令計劃再次證明中共高階領導人的品格與貪婪本性。而我，作為中華民族的一員，對自己並無奢望，什麼時候能像那位美國老太太一樣，一眼看明白中國的一場大戲，就算是沒再繼續糊糊塗塗的活著了。\n ",
			"added": 1429979470
		}
	],
	"next_message_id": 2,
	"comments": {
		"1@141": [
			{
				"comment_id": 1,
				"body": "> [g20](#comment_5_141): ZeroNet还在不断完善中，现在的开发进度可能连20%都还没完成，所以现在来判断ZeroNet的价值可能还太早了。持续关注本项目的进展^_^\n\n期待80%，持续关注。",
				"added": 1430755325
			}
		]
	},
	"topic_votes": {}
}