{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1585070611_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 1,
				"body": "То же самое происходит, кстати, и на основном ZeroTalk.",
				"added": 1585073540
			}
		],
		"1585821873_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 2,
				"body": "What is \"delete any post button\"? You can already delete others' posts if you're an admin of the ZeroTalk. To do this, you hover someone's post or comment, click the pencil at the left and then press \"Delete\" at the bottom.",
				"added": 1585827317
			}
		],
		"1586182941_12UYMtUCFsKMxz7zHCp3zwKuuoyfrXmLWW": [
			{
				"comment_id": 3,
				"body": "Yeah, they can.",
				"added": 1586439074
			}
		],
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 4,
				"body": "Bug: topic groups aren't shown if there are no topics inside them.",
				"added": 1603573787
			}
		],
		"1630769724_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "Uh, just add it. It's simply a JSON file of originals and translations. What's exactly your question?",
				"added": 1630770098
			},
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_9_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Already did and do not see anything changed. For example in the topic list on index is \"0 comments\" which is english not custom language and my question \"how this language thing is working\" remains, for example how admin and user select different language.Update: after on ZeroHello, i click three dots next to ZN logo and select different lang. it changed the wording on my site!\n\nYup. You can configure the language globally via ZeroHello.\n\n> Though ZeroHello does not offer language that i want to use... can be good to force my site to use languages/myfile.json of my choice, but how..\n\nI'm afraid you can't without implementing the translation system yourself.",
				"added": 1630788211
			},
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i see that the index.html has {lang} \"variable\" inside:<script type=\"text/javascript\" src=\"js/all.js?lang={lang}\"></script> [...]\n\nThe `?lang=` query string parameter does not change anything. It's purely for cache invalidation.\n\nZeroNet translates every single file to the language that is controlled globally using ZeroHello.",
				"added": 1630938671
			},
			{
				"comment_id": 8,
				"body": "> UPDATE: i do not see en.json so this may not work\n\nI believe you can add en.json manually and it will work.\n\n> [ssdifnskdjfnsdjk](#comment_11_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): thanks, so only options are:\n\nThe two options you listed are valid. There are two more options. The option C) is to implement the translation mechanism manually via JavaScript. The option D) is very hacky: you could use JS to patch the translation file that ZeroNet reads in runtime, depending on the language chosen on your site.",
				"added": 1631014481
			},
			{
				"comment_id": 9,
				"body": "On a second thought, ssdifnskdjfnsdjk, are you asking about ZeroTalk++ in particular or are you asking about all ZeroNet sites? In the former case there may be a better solution.",
				"added": 1631014969,
				"modified": 1631014977
			},
			{
				"comment_id": 10,
				"body": "What language do you want to add?",
				"added": 1631015783
			}
		]
	},
	"comment_vote": {
		"26_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}