{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565382642_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1526528207_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Only 1% take cats? That can't be real, can it? Cats aren't likely to do all that much damage to a house, same as bunnies.\n\nMaybe you are dealing with minimum management effort management companies. But even then 1% seems too low. Isn't there a chance that you simply imagined it to be too easy to find a cheap home? Try 50+ more times, for your cat.",
				"added": 1526672306
			}
		],
		"1565449551_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "\"Which god?\" - \"Oh, *your* god(s) you got no evidence for other than ancient and modern hearsay, but who still wants various very specific things from you and everyone else. That. None of the others.\" - \"Yea, you got no evidence, so the assertion that this is some specific entities like specific god(s) handing out punishment is absolutely bogus.\"\n\nImmediately boring, not exactly an intellectual pursuit but just talking to people who each want to believe they touched on something special and divine.",
				"added": 1565453180
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 3,
				"body": "There are about a dozen or so developed countries where assisted suicide is legal and it works fine - multiple of them just treat it as a step a patient can choose if other therapeutic options are exhausted. Which arguably can balance the interests of families / society / ... alright with the interest of the person suffering.\n\nI do not believe that it is any kind of solution to the USA's mass shooting and general gun violence issue though. That is best solved by just not handling society (poverty, weapon culture/laws, prisons and metal care and so on) like the USA does - it works for everyone else who is not currently experiencing a civil war with lots of war crimes.",
				"added": 1574517903
			}
		],
		"1583185944_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 4,
				"body": "A ton of money is being printed, and the US government budget doesn't currently act like anything like it wants to repay debts or cover promised retirement, medical and other funds. It is just incurring an even more massive debt and it's really hard to claim that it at least spent all this money on a better future (economic or otherwise). This probably isn't good behavior, but stock markets aren't usually very sensitive to that..\n\nAs far as stock markets are concerned, they probably  just don't see any very serious threat for the economy from a virus that kills around 1% (and mostly the old and weak). Or if they do, they see the threat being less in the USA than in other markets.",
				"added": 1583195727
			}
		],
		"1586479780_1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV": [
			{
				"comment_id": 5,
				"body": "Your labour/contract laws are probably not too dissimilar given employment contract's text. Of course this doesn't usually stop employers to push everyone into being disposable (moving everyone to \"contract\" / \"part-time\" work) or do other things to try and weasel around these laws. And that sucks and certainly shows how they intend to run the company going forward.\n\nI wish you good luck in your fight. But will also remark that from the few examples of this situation I heard of before, usually you can't achieve all that much other than bother your employer. With the difference that the employer might still get paid to defend his decisions on company money/time, whereas you probably don't.\n\nRegardless if your ancestors shed blood in a revolution or just got some labour laws passed the boring way, there generally just isn't anyone willing or in a position to replace such corporate leadership. And if they don't go, you as the \"less important/more replaceable\" staff will go - that you will ever correctly work with each other again is just not likely.",
				"added": 1586491260
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 6,
				"body": "> banned in all western countries\n[X] doubt\nLikely allowed but in some countries that think polygons and lines need protection against rape",
				"added": 1590159406
			},
			{
				"comment_id": 7,
				"body": "> banned in all western countries\n[X] doubt\nLikely allowed but in some countries that think polygons and lines need protection against rape",
				"added": 1590159519
			},
			{
				"comment_id": 8,
				"body": "> banned in all western countries\n[X] doubt\nLikely allowed but in some countries that think polygons and lines need protection against rape",
				"added": 1590159858
			},
			{
				"comment_id": 9,
				"body": "It posted thrice during intermittent connection issues? Interesting. Sorry to y'all though.",
				"added": 1590160082
			}
		],
		"1593220425_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 10,
				"body": "Trackers are optional, you can instead or additionally share a magnet link with DHT.",
				"added": 1593308113
			}
		],
		"1607500928_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 11,
				"body": "I'm interested: Did you want to fork and maintain 0sh.bit but could not? What do you see happening on I2P or IPFS that is very different?\n\n> [reichama](#comment_48_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): reichama\nClearnet mirroring would be excellent but difficult; almost all the popular clearnet services want their exclusivity [and the ability to steal user data and display ads], they obstruct attempts.\n\nAnd it's not an one-off problem: Even Zeronet is not yet excellent at preventing exclusivity of data to specific zites.",
				"added": 1607529612
			}
		],
		"1607575526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "I'm not sure your media are entirely ready for being on zites that can be forked by anyone else. It's an issue with their exclusivity.",
				"added": 1607663291
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 13,
				"body": "If you (let) reforest whatever you cut down without soil erosion and landslides, there is no problem.\n\n100 million barrels of oil a day and then additional coal and more from underground -> atmosphere is. Some region's trees will likely even grow better if it's 2 degrees warmer and the atmosphere has more CO2 and yet we have and will have many more problems.",
				"added": 1608717304
			}
		]
	},
	"comment_vote": {
		"1156_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"46_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1
	}
}