{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "http://127.0.0.1:43110/12Ftc8dLdK1AiQK2CAJTxjgUCxVhM9qpVW/",
			"post_id": 21,
			"date_added": 1517577792
		},
		{
			"comment_id": 2,
			"body": "中国政府正在迫害他的人民，为了转化国内的经济矛盾，他们不惜给自己的老百姓下毒，人为制造禽流感，肺炎，肺纤维化，抑郁症各种疾病，就为了让老百姓进医院花钱，做各种检查和虚假治疗，从而人为制造消费，减轻政府经济压力。保险行业今年减少了健康保险，医院限制了用药，药厂停止了特效药的生产。同时监控和监视自己的人民，打击各种有不同思想的人。不能发动战争，就折磨自己的人民，迫害自己的人民，无法再欺骗下去，手无寸铁的老百姓，这种做法比1938年的国民党还凶残.\n这届政府必将被外来政府推翻，中国必将灭亡，人民必将获胜。\nThe Chinese government is persecuting his people, in order to transform the domestic economic contradictions, they do not hesitate to poison their people, man-made avian influenza, pneumonia, pulmonary fibrosis, depression all kinds of diseases, in order to let the people into the hospital spend money, do a variety of checks and false treatment, thereby artificially manufacturing consumption, reduce the government economic pressure. The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines. At the same time monitor and monitor their own people, to combat all kinds of people with different ideas. Not waging war, torturing their own people, persecuted their own people, can no longer deceive, unarmed civilians, this approach is more brutal than the Kuomintang 1938.\n\nThis government will be overthrown by foreign governments, China will perish, the people will win.\n",
			"post_id": 21,
			"date_added": 1517869361
		},
		{
			"comment_id": 3,
			"body": "世界行将毁灭。\n地狱之花将在中国升起，毁灭武汉，然后蔓延至全世界。星星之火可以燎原，只要广泛宣传然教，反复背诵这六条法则，认真执行这六条法则，就能保你们健康，燃烧这世上所有的罪恶！",
			"post_id": 21,
			"date_added": 1517869375
		},
		{
			"comment_id": 4,
			"body": "以集体对抗集体，以组织对抗组织，不要与人争吵，不要热心事业，不要努力工作，不要有上进心，少交税，多与人交流，有多少钱就花多少钱。\n国内有一群别有用心的人在害人。",
			"post_id": 154,
			"date_added": 1517869432
		},
		{
			"comment_id": 5,
			"body": "世界行将毁灭。\n地狱之花将在中国升起，毁灭武汉，然后蔓延至全世界。星星之火可以燎原，只要广泛宣传然教，反复背诵这六条法则，认真执行这六条法则，就能保你们健康，燃烧这世上所有的罪恶！",
			"post_id": 154,
			"date_added": 1517869447
		},
		{
			"comment_id": 6,
			"body": "中国政府正在迫害他的人民，为了转化国内的经济矛盾，他们不惜给自己的老百姓下毒，人为制造禽流感，肺炎，肺纤维化，抑郁症各种疾病，就为了让老百姓进医院花钱，做各种检查和虚假治疗，从而人为制造消费，减轻政府经济压力。保险行业今年减少了健康保险，医院限制了用药，药厂停止了特效药的生产。同时监控和监视自己的人民，打击各种有不同思想的人。不能发动战争，就折磨自己的人民，迫害自己的人民，无法再欺骗下去，手无寸铁的老百姓，这种做法比1938年的国民党还凶残.\n这届政府必将被外来政府推翻，中国必将灭亡，人民必将获胜。",
			"post_id": 154,
			"date_added": 1517869472
		},
		{
			"comment_id": 7,
			"body": "回教徒做这种事？",
			"post_id": 177,
			"date_added": 1519478679
		},
		{
			"comment_id": 8,
			"body": "http://127.0.0.1:43110/18fvHT5oGbS1KaeedGpQS4wr8eQ1QD36Dn/\n能看到这个",
			"post_id": 185,
			"date_added": 1519801824
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}