{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1616339347,
			"title": "For The USA To Exist The UNO Must DIEZ !!!",
			"body": "I was going in the wrong direction. \n\nStrategic or tactical assassinations in and/or out of the USA wouldn't change a damn thing.\n\nThe choice is in reality very simple : or the UNO lives and the USA dies, or the UNO dies and the USA lives.\n\nAs you can expect, I have a thousand and more complaints about the current USA, however the question isn't about any specific policy issue.\n\nIt's simply for the American People to decide, more exactly the MIIC, do you want the USA to live or die?\n\nIf you want the USA to exist, there is only one easy path : to leave the UNO.\n\nIf not the USA will not survive.\n\nThe second step, once left, is to destroy it (and that's the super easy part).\n\nWhat's fun, or interesting is that ALL NATIONS of the world face the same dilemma. Stay and die, or leave and live !\n\nWhat's really advantageous for the USA is that those responsible for this treason, are in reality, a very tiny minority.  \n\nAnd rather than going full bore assassinations (which is super easy), I would rather find a common ground and reason to leave it !\n\nIt's a peaceful gesture.\n\nI am interested in understanding how in their greed, lust for power, and dream of global hegemony, they found a value superior to the one provided by the constitutional framework of the USA in the UNO?",
			"added": 1616339346
		}
	],
	"topic_vote": {
		"1616339347_1DEsTiJMbpa4RVnszAq66me45KxFxPxvt5": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 5,
				"body": "First serious step would be to match the political rights of arizona, california, colorado, michigan, montana, nevada, north dakota and oregon in florida.\n\n>The seven generally acknowledged forms of direct democracy are the legislatively referred constitutional amendment, the legislatively referred state statute, the initiated state statute (direct or indirect), the initiated constitutional amendment, the veto referendum (sometimes called the citizen referendum or the statute referendum), the statute affirmation (available only in Nevada), and statewide recall.\n\n>Eight states enable the six most common forms of direct democracy. Those states are Arizona, California, Colorado, Michigan, Montana, Nevada (which also has the statute affirmation), North Dakota and Oregon.\n\nhttps://ballotpedia.org/Forms_of_direct_democracy_in_the_American_states\n\nfunny to see how few free states remain... and texas, what a dictatorship.\n\nand the lie : \n\n>\"Silencing Florida voters\n>By Mark Ferrulo - February 19, 2020\n>Since 1968, Floridians have organized, put on the ballot, and voted to pass constitutional amendments to improve our state when the Florida Legislature refused to act. Now, some members of the GOP leadership in the legislature want to make it nearly impossible for anyone other than the legislature or the very wealthy to bring constitutional amendments before Florida voters.\"\n\nhttps://www.progressflorida.org/tags/direct-democracy\n\nthose trumptards, are really really overestimating their collective iqs.\n\n>\"The current leadership of the Florida Legislature is beholden to corporate special interests and partisan gamesmanship. Time and time again citizens have had to use the constitutional amendment process to get around their inaction or indifference. Now, some legislators in positions of power want to rig the process so only they and the super wealthy have the ability to propose constitutional amendments.\n\n>Proposals to amend Florida's Constitution should reflect the will of everyday Floridians, not just those of wealthy special interests. Call your state senator and urge them to oppose SB 1794.\"\n\naka epstein state... no worry again, first UNO... then all of this crap is really easy to solve.",
				"added": 1616341883
			}
		],
		"1616339553_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 2,
				"body": ">UNO Charter : Article  93.1 All Members of the United Nations are ipsofacto  parties  to  the  Statute  of  the  International Court  of Justice.\n\naka israel has been tricked. time to leave this shit behind and take the us with us to the promised land ! \n\n>. Now, a group of Israeli Jews are suing the Netanyahu administration in international court,\n\ngrave mistake ! go to the hills, hillbilies ! \n\nI am not aware their is a mandatory vaxx order, just the vaxxnazis using their proverbial step by step approach to force everyone to comply. \n\nDo you wear your vaxxstar proudly? hitlerians would have loved to see you like this, by your own will...\n\nyou have to move beyond the shoa. it's just a people who tried to massacre another one. a classic. otherwise, some will still have their mind clouded by such shitty concept as \"international court\" or \"it must not happen again\" or \"it's not possible now again\".\n\nI know it may sound a daunting task to leave the UNO, but with nukes... you know... they better shut the fuck up, or be glassed. \n\nlife is simple.\n\non the topic I don't understand why use the word \"vaccines\", it remains to be demonstrated. What if/when there are serious complications resulting from the involuntary medical intervention? \n\nWhat do you do?\n\nit's clear that using \"medical\" is a prefect soft kill weapon, most will be too afraid and stupid to question, and most females woreship \"doctors\" more than God Himself and it stifles all street protests as biocontamination events, and all overt conspiracies to defeat the medical tyrannical hegemonic planetary gov... \n\nGod speed !",
				"added": 1616340122
			}
		],
		"1616340894_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": [
			{
				"comment_id": 3,
				"body": "8) no proof, about the leak. could too have been an injection (aka bioattack against china and the world, to frame china and more importantly eject trump and get the power to the who/uno, part of the strategy of everything to weaken the usa).\n\nanyway most of those who died were already above their life expectancy, furthermore it's not serious to call a bioweapon which you need to be tested to know if you have it... it's an unarmed biovector (load it with crisper with ebola, then we start to talk (using a long term effect bio weapon is optimal to get retaliated upon).",
				"added": 1616341291
			}
		]
	},
	"comment_vote": {}
}