{"cert_user_id": "meticulousCraftman@github", "next_comment_id": 3, "comment": {"1604064801_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "I am unable to post a message in ZeroBoard. Even after waiting for 15 minutes it is not posting my text.\n", "added": 1424413232, "modified": 1424413232, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/51#issuecomment-75209777", "source_type": "github"}], "1604064790_mirrored_meticulousCraftman_github": [{"comment_id": 2, "body": "The website named ZeroBoard and along with another website of a person named Blue coder. It's really annoying to wait for so long and still get no result. I recommend you to display the contents as soon as they arrive along with a progress bar like that of in Youtube (The red colored seek that runs at the top). Another thing is that the ZeroSearch is still not working and could you make any platform that will allow the user's to make dynamic websites without using an external server. For starter's you should provide support for a web framework in python (web.py or webapp2) along with an optional way to make the website  server dependent(for dynamic websites) or server independent(for static website's).\n", "added": 1424789577, "modified": 1424789577, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/52#issuecomment-75808649", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604064790, "title": "Taking a lot of time to load other website's", "body": "Zeronet is taking a lot of time to load other website's like the one's present in the Zeroboards messages. I recommend that you should include a website load progress bar with some data in it so that user's can know how much percent the website has been loaded. It is very annoying to look at the connecting page without any estimate of how much data is left to be downloaded. Along with that the ZeroSearch (The search engine for zeronet) is not working. The page says internal server error. And one last thing is that please give some more documentation so that the developers could help you build it better.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1424413051, "modified": 1435249338, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/52", "source_type": "github"}]}