{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1,
			"title": "Vanitygen Mac",
			"body": "how do you use vanitygen on mac",
			"added": 1506590342
		},
		{
			"topic_id": 1526435674,
			"title": "Programing languages for zeronet apps",
			"body": "is javascript the only language i can use for making apps in zeronet",
			"added": 1526435672
		},
		{
			"topic_id": 1526784495,
			"title": "javascript help",
			"body": "i was wondering if there was a way to make a user inputed number a value instead of a string other than adding a \"+\" in front of the variable",
			"added": 1526784492
		},
		{
			"topic_id": 1547735531,
			"title": "whats the most popular 0site?",
			"body": "0net has been around for 4 years now so i was wondering which sites have the most number of seeds.  obviously no one is going to have access to all the sites so i was hoping people could just report which sites that they do have, have the highest number of seeders.",
			"added": 1547735527
		},
		{
			"topic_id": 1548336460,
			"title": "\"Use Tor meek bridges for tracker connections NO MEEK BRIDGE SUPPORT IN YOUR CLIENT, PLEASE DOWNLOAD THE LATEST BUNDLE.\" Error",
			"body": "When trying to connect to a lot of new sites i often get this error \"Use Tor meek bridges for tracker connections NO MEEK BRIDGE SUPPORT IN YOUR CLIENT, PLEASE DOWNLOAD THE LATEST BUNDLE.\"\nhowever i am running the most current version of zeronet as far as i can tell. my version number is Version 0.6.4 (rev3688)",
			"added": 1548336455
		},
		{
			"topic_id": 1548528426,
			"title": "\"Use Tor meek bridges for tracker connections NO MEEK BRIDGE SUPPORT IN YOUR CLIENT, PLEASE DOWNLOAD THE LATEST BUNDLE.\" Error",
			"body": "When trying to connect to a lot of new sites i often get this error \"Use Tor meek bridges for tracker connections NO MEEK BRIDGE SUPPORT IN YOUR CLIENT, PLEASE DOWNLOAD THE LATEST BUNDLE.\"\nhowever i am running the most current version of zeronet as far as i can tell. my version number is Version 0.6.4 (rev3688)",
			"added": 1548528420
		},
		{
			"topic_id": 1553283983,
			"title": "why does zeronet have trackers?",
			"body": "i don't understand what the point of trackers in zeronet are since they centralize data and zeronet worked without them for a long time just fine. Can someone please explain their purpose to me? thanks!",
			"added": 1553283976
		},
		{
			"topic_id": 1559854827,
			"title": "Liberator Files",
			"body": "Does anyone know where or how to get full sized liberator files as all of the versions that i can find are scaled down immensely and i do not know what factor to scale them up by.",
			"added": 1559854819
		},
		{
			"topic_id": 1572230967,
			"title": "yo does anyone know of any good black market sites",
			"body": "im tryna get some thc distillate or carts specifically but any and all black market sites are of interest for me.\nthanks homies.",
			"added": 1572230958
		},
		{
			"topic_id": 1572721528,
			"title": "Can you run a portable version of Zeronet from a flash drive?",
			"body": "i was wondering if zeronet could be run from a flashdrive so that i could keep my site's data and id's while using multiple computers.  also would this affect a zeronet installation already on a computer? I would like to be able to access my zeronet stuff from multiple computers without affecting anything currently on the computer so that no one could know that i was running my zeronet on their computer.",
			"added": 1572721518
		},
		{
			"topic_id": 1573754537,
			"title": "Vote Yang for president",
			"body": "",
			"added": 1573754526
		}
	],
	"topic_vote": {
		"1_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1524446783_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1526105378_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": 1,
		"1526784495_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": 1,
		"1531954504_15MSvLGP47HuCZY2MHo58zkB9qCjrZE6nh": 1,
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": 1,
		"1547735531_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1548336460_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1548528426_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1550012368_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": 1,
		"1559854827_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1572640089_1GAeSC7T72fu4vCowfXyD4ZLAjBLwgL77k": 1,
		"1573908669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1573754537_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1574501795_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1574730236_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": 1
	},
	"next_comment_id": 147,
	"comment": {
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": [
			{
				"comment_id": 1,
				"body": "its saying there are 13 peers but just wont download the zite for me",
				"added": 1525205994
			},
			{
				"comment_id": 2,
				"body": "finally worked for me and its sick.",
				"added": 1525208008
			}
		],
		"1526784495_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 4,
				"body": "thanks :)",
				"added": 1526965348
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 5,
				"body": "i think that the only thing a zeronet user can do about cp is to not seed it.  if you stumble across it remove the zite from ur data folder or block it so that you dont accidentally visit that zite again.  those who wish to view it and make it always will find a way to do so, therefore there is no point in trying to censor it.  its a difficult issue to deal with and given the way zeronet works, there is no way to censor it on this platform",
				"added": 1527737372
			},
			{
				"comment_id": 7,
				"body": "like blazar siad, zeronet is just technology and therefore we shouldnt try to solve pedophilia with it.  Zeronet by its nature is somewhere that pedophiles will congregate but i dont think we should try to remove them from the network because any tool that we can create to remove them will inherently be able to remove anyone else.  If such a tool were even created another problem with it would be who to give it to.  we couldnt let everyone have access to it because then trolls would ban every zite they came across.  whoever is given that power could also troll zites they didnt like or agree with and that would render zeronet useless.  Another problem we have is determining whether child porn is good, bad, or neutral. most people of course would claim that child porn is bad and something that should be eradicated, but pedophiles of course would argue the opposite.  Some people will say that child porn is okay as long as the child is not harmed, or maybe that its okay as long as the child consents to it.  Of course there is no way to prove in a lot of cases whether the child was harmed, physically or mentally, or if they gave consent.  Another problem is how do you identify child porn.  if someone takes a nude selfie the day before their birthday and the day after, the first one is illegal and can result as them being a registered sex offender while the second one is perfectly legal.  How would you determine which picture is the legal one and which one is illegal?  There are of course many other caveats to classifying cp as bad or even classifying something as cp which is the point im trying to make.  It is essentially impossible to ban media that contains nude children or anything else used to classify something as child porn from zeronet.  I think that if you like it then go ahead and seed it and if you dont agree with it then dont seed it.  anything else will just cause a shit storm for the integrity of zeronet.  There is a price to pay for having technology that cannot be censored and that price is that everyone is allowed to do whatever they want, whether or not you agree with it. \ni know some of these points were taken from other people in this thread but i dont know how to quote them and im too lazy to read through everything again to see who said what so please dont be offended if i didnt quote you.\nalso i love how we can have a normal discussion here as well, without idiots making jokes and completely hijacking the discussion.  its nice to have level headed debates and discussions on the internet.  i want zeronet to become more popular but at the same time i dont because i like these level headed discussions.",
				"added": 1528071900
			}
		],
		"1527247257_1LACNkKD9QUoF28kSzmcv2hojVmTs2qTwZ": [
			{
				"comment_id": 6,
				"body": "there are no peers found for me",
				"added": 1527737579
			}
		],
		"1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy": [
			{
				"comment_id": 10,
				"body": "> [quantumkitty](#comment_174_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): We've definitely had minors browsing ZeroNet.\n\nwhen i first discovered zeronet i was a minor so id guess there are quite a few minors on here",
				"added": 1532318010
			},
			{
				"comment_id": 11,
				"body": "> [nicwow](#comment_4_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): I hate posts like these. It would be great if us as a community could report them. If someone's children go on ZeroNet and suddenly see inappropriate content the parents would not be happy. Some option like \"censor inappropriate content\" is necessary. Not necessarily removing them but removing them from those who don't want this. Preferably set to this by default.\n\ni think we need some sort of tagging system so that people can filter out tags they dont want to see.  this should be implemented on the site level as well as on posts on blogs.  of course this isnt a complete solution because a site owner doesnt have to use the tags but its a step in the right direction.",
				"added": 1532318899
			}
		],
		"1531727504_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "dont get a 3d printer. i decided to get one back in 2015 and it was the coolest thing ever for a few months but then keeping it calibrated properly and finding things to print became too much of a chore and its been sitting in a box ever since i gave up trying to fix it one day like 3 years ago.  3d printers are cool and fun to use but only if your using someone elses lol",
				"added": 1531970788
			}
		],
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": [
			{
				"comment_id": 12,
				"body": "hi",
				"added": 1547733203
			}
		],
		"1547735531_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 13,
				"body": "zerohello for me only has 337 and zerosites 318.  Does anyone know why its different for me and ssdifnskdjfnsdjk",
				"added": 1548175916
			},
			{
				"comment_id": 15,
				"body": "> [kai0](#comment_902_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 你还在零网啊，你有300多都不错了，我这台机器才几十个节点。\n\ni was just wondering why ssdifnskdjfnsdjk has thousands of seeders and i only have hundreds",
				"added": 1548192763
			}
		],
		"1548528426_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 16,
				"body": "> [nofish](#comment_1248_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The Tor client is not updated automatically. If you are on windows, then you have to re-download the client from https://zeronet.ioBut meek proxy will make it much slower, so it's only recommended if you often have the error.\n\ni am on mac and i downloaded the client again but i still get the same error sometimes",
				"added": 1549371563
			}
		],
		"1553283983_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 17,
				"body": "> [krixano](#comment_647_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Because DHT hasn't been implemented yet. And ZeroNet has always had trackers, you just didn't necessarily see how many on ZeroHello you were connected to.\n\nso if the trackers went down then would zeronet go down as well or would you still be able to see new content from peers that you have already connected to but not be able to find new peers?",
				"added": 1553295526
			}
		],
		"1556721802_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 18,
				"body": "> [fantoski](#comment_5_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): 1\n^2\n  Reply ⋮\n\nit means that a webzite is extremely secure due to the enormous amount of time that guessing the private key would take",
				"added": 1557097969
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac@kxoid.bit](#comment_10_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Isn't it greater than the lifespan of the universe?\n\nyes",
				"added": 1557227349
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 20,
				"body": "> [duende](#comment_68_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, useless piece of garbage.\n\nwhy",
				"added": 1559859809
			},
			{
				"comment_id": 21,
				"body": "> [fazed0](#comment_1_1HrHBgdgxA8gi2uxTWb97WZkH9wbwY2wib): @op way ahead of you, I found zero net researching the best way to distribute closed containerised systems however my version won't be a single market place, the vendor owns their info and container.. anyone want to help?\n\nsure",
				"added": 1559859853
			}
		],
		"1559854827_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 22,
				"body": "> [eightyfour](#comment_108_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): I think he's talking about the 3D gun blueprints\n\nyes i am",
				"added": 1559958085
			},
			{
				"comment_id": 23,
				"body": "I am talking about the stl files for the liberator gun",
				"added": 1559958113
			},
			{
				"comment_id": 25,
				"body": "> [daz](#comment_107_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): I have some files from years back but I have no software to open them to test to see if they are the ones you are after i could upload one to zero unlimited if you have a way of checking the file.\n\nthat would be awesome",
				"added": 1560629281
			},
			{
				"comment_id": 26,
				"body": "> [daz](#comment_108_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): put this file up I have no idea if it one of the ones you may need there are others in the folder  if this looks right 380 Barrel (Threaded).stl.part  I put it on zero up\n\nim not seeing it",
				"added": 1560630864
			},
			{
				"comment_id": 27,
				"body": "> [daz](#comment_109_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): zeroup unlimited\n\nwhats the link, i cant find that site",
				"added": 1560631003
			},
			{
				"comment_id": 28,
				"body": "> [daz](#comment_110_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/?Latest\n\nthe file doesnt seem to open properly, thanks for trying though.",
				"added": 1560631313
			},
			{
				"comment_id": 29,
				"body": "> [daz](#comment_111_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): ok will try a different one\n\nu have the miniature ones unfortunately.  all the ones i can find are miniature and cant actually be printed :/",
				"added": 1560632562
			},
			{
				"comment_id": 30,
				"body": "> [daz](#comment_113_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): ok no problem was hoping to get a printer one day so i thought I would get a few files years back at leat i know they are useless and can dump them\n\nyeah, if i ever find a good set of files ill upload them somewhere on zeronet.",
				"added": 1560638281
			},
			{
				"comment_id": 31,
				"body": "> [daz](#comment_116_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): what 3d printer are you using and what software\n\nprintrbot simple metal and cura",
				"added": 1560714913
			}
		],
		"1560347482_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 24,
				"body": "wtf is up with these posts.  i see them over and over, they kinda make sense but then at the same time there is something weird about them, almost like its AI generated text.",
				"added": 1560368908
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 32,
				"body": "it is very likely that to sign on to the network, you must use your own account instead of the school giving everyone the wifi password.  If you have a student ID and password that you use to log onto your network it will be very hard to hide your network usage.  Changing your mac address in this case will be of no help to you because even if you use a different mac address every time, they will still associate your account with that mac address.  Once they see that your account is connected, they would then monitor all the traffic from the devices that sign in with your account regardless of their mac addresses.  if you got lucky and you do not have to sign in with your own account, and everyone uses the same information to sign in, then there are ways to hide your network usage.  how do you access zeronet?",
				"added": 1561153252
			},
			{
				"comment_id": 34,
				"body": "> [xcape2net](#comment_18_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): He said in a previous post that he used a local cafe to access zeronet.\n\nah yes i see that.  also everything you do on zeronet is stored on your computer so zeronet might not be the best thing to have on your computer unless you completely wipe your data folder every time u stop using it. ",
				"added": 1561157997
			},
			{
				"comment_id": 36,
				"body": "> [xcape2net](#comment_23_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Laws in the US only help you if you can afford to hire a lawyer.  That's why US schools get away with so much infringement against minors' rights.\n\na private boarding school has every right to search their student's possessions, even electronic files, because they are not part of the government.  The school can have a policy that states that every student that attends must let the teachers or whoever search their belongings upon request.  If the student does not comply then the school will kick them out.  If a student does not like this policy, then the student can go attend a different school.   The same applies for companies and their policies for cellphone use, searching belongings and many other issues.  A number of companies that i used to work for demanded that cellphones be kept somewhere other than with u while you worked so that you would not be distracted.  I still had access to my phone if i wanted but i couldn't have it on me.  If i didn't like that policy then i could have left the company.  The only exception to this is if you go to a public school or work for the government as the government is not allowed to search or seize your property without a warrant.  This may vary from country to country but thats how it works in the US",
				"added": 1561339818
			},
			{
				"comment_id": 41,
				"body": "> [xcape2net](#comment_41_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Rights get infringed at public schools in the US too.\n\ncorrect but they aren't supposed to be and there can be legal consequences for that at a public school.  at a private school, they can do whatever they want as long as you agree to it and usually agreeing to all of their policies is a mandatory to attend.  Therefore if you don't want to follow their policies, dont attend that school.",
				"added": 1561483442
			}
		],
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 33,
				"body": "> [sunflowerr](#comment_2_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ): Yes, they have. I haven't seen them yet, but the \"internet use\" policy says that if they find something suspicious about me, they have the freedom of searching my room and scanning everything in my computer, cloud services (I have to provide them all the necessary passwords) and even flash drives. So I am afraid of using even a VPN. Anything that I could do to circumvent this?\n\ndo not give them passwords to any of your accounts.  they do not have to have them and if they demand them then you can just claim that its not your account.  Is the computer that you use a computer that they gave you or is it your own computer?",
				"added": 1561153583
			}
		],
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 35,
				"body": "so how does this relate to you being a citizen",
				"added": 1561158211
			},
			{
				"comment_id": 37,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_296_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): To use an analogy:Open source code belongs to everyone, and therefore to no one in particular.Criticizing the code is healthy, that's how we improve the way we live together by improving our everyday stability.Most people talk about a club. Their version of what a community is is not a community:https://www.etymonline.com/search?q=community\n\nstill not getting it",
				"added": 1561340056
			},
			{
				"comment_id": 38,
				"body": "> [xcape2net](#comment_52_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): \"respect does not exist,...\"  I think maybe your programmers added a little too much 1930's German pop psychology into your code.  Maybe you should ask for a code update.\n\nYeah im like 99% sure its a bot cuz the language used sounds like its AI generated.",
				"added": 1561483057
			},
			{
				"comment_id": 39,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_321_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): respect does not exist, you just can't support like all kids to be contradicted. i don't care. you're gonna learn a lot of of life starting now.life is not a nintendo game, people don't comply bcause you say so moron.\n\ndear creator of h3bhkj5gqz4n3pjm, please confirm that this is a bot. thank u",
				"added": 1561483128
			},
			{
				"comment_id": 40,
				"body": "> [xcape2net](#comment_52_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): \"respect does not exist,...\"  I think maybe your programmers added a little too much 1930's German pop psychology into your code.  Maybe you should ask for a code update.\n\nits either a bot or a government agent/agency of a non-english speaking nation that is trying to upend western governments. my best guess is north korea.",
				"added": 1561483305
			},
			{
				"comment_id": 44,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_339_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"North Korea\"been there ? [...]\n\nhow do u know that i am not part of your generation",
				"added": 1561595361
			},
			{
				"comment_id": 45,
				"body": "> [xcape2net](#comment_66_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I think maybe most of North Korea is too busy starving most of the time to worry about artificial intelligences.  But I could believe that a three-letter US governmental agency may be spreading (or training) AI's among social networks is as part of a false-flag operation.    Hey, h3bhkj5gqz4n3pjm, how do you feel about the CIA?\nnot an average north korean citizen because you are right, they are too busy starving to think about anything else.  Im thinking some north korean agency is behind the account.  i think it might be some government power or AI, not both.  Therefore i am not overestimating their technological capabilities, i think its a real person from north korea or another anti-western world country writing the posts if it is not AI.  ",
				"added": 1561595605
			},
			{
				"comment_id": 51,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_346_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): been there ?\n\nbeen where?",
				"added": 1561600207
			},
			{
				"comment_id": 53,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_347_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): north korea kiddo. or you think you know what's really going in there.\n\nWhat the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, kiddo.",
				"added": 1561600551
			},
			{
				"comment_id": 55,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_348_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Reply\n\nyeah i bet you fuck kids in their 'little asshole' with your dick thats 'too hard' in your free time since you have nothing to do",
				"added": 1561663021
			}
		],
		"1561491187_12X6g1LP25pT2XEMNR239xgrUnEktRVb9o": [
			{
				"comment_id": 42,
				"body": "no",
				"added": 1561493776
			},
			{
				"comment_id": 47,
				"body": "the problem with cryptocurrencies is that they are being treated as an investment, not a true currency.  people are reluctant to spend their cryptocurrencies due to the fact that in a week that £5 could be worth £200.  i think that unless people stop treating cryptocurrencies as an investment, they will never replace real currency.",
				"added": 1561596212
			}
		],
		"1561471236_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 43,
				"body": "im confused",
				"added": 1561493843
			}
		],
		"1561562226_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 46,
				"body": "this shit gets weirder and weider.  wtf is even the point of this post",
				"added": 1561595935
			}
		],
		"1561540663_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 48,
				"body": "how much have you searched?",
				"added": 1561596263
			}
		],
		"1561514363_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 49,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_330_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Deepen your historical research even without going very far, in the 19th century, you will see a multitude of inconsistencies.Which lead to the conclusion that the lie is known because not very old.We have to represent some kind of nuisance, maybe an experience that has gone wrong, I don't know, but we represent 'an obvious nuisance to them'. [...]\nwhat (exactly) has been inconsistent (fluctuating) in history.  Please enlighten (teach)  me for i know not of these inconsistencies and my tender mind must know.",
				"added": 1561596498
			},
			{
				"comment_id": 50,
				"body": "Genesis 17:10-14\n\"This is My covenant, which you shall keep, between Me and you and your descendants after you: every male among you shall be circumcised. \"And you shall be circumcised in the flesh of your foreskin, and it shall be the sign of the covenant between Me and you. \"And every male among you who is eight days old shall be circumcised throughout your generations, a servant who is born in the house or who is bought with money from any foreigner, who is not of your descendants.\n\"A servant who is born in your house or who is bought with your money shall surely be circumcised; thus shall My covenant be in your flesh for an everlasting covenant. \"But an uncircumcised male who is not circumcised in the flesh of his foreskin, that person shall be cut off from his people; he has broken My covenant.\"",
				"added": 1561596558
			},
			{
				"comment_id": 54,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"a servant who is born in the house or who is bought with money from any foreigner, who is not of your descendants.\",what is the subject of this text, junior?\n\ncan your feeble mind not comprehend the simplistic nature of this excerpt? It is obviously about the management of human population as per the Frankfort outline of 1294.",
				"added": 1561601476
			},
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_349_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): nope.it's servants/owners manual from a time there was servants/owners.\n\naccording to you are there not still servants and owners? The owners are those who are \"awake\" and running the scam that is \"modern\" society.  The servants are the people that buy into \"politics\" and are controlled by the evil awakened ones.  also people that are \"kiddos\" or \"junior\" or any other diminutive term that implies that they are younger than you are sheep controlled by the awakened ones.  And then there is you. the awakened one. the saviour. the messiah. the prophet whose message inadvertently falls on deaf ears.  YOU ARE OUR SAVIOUR. we must listen to you for you are the source of all KNOWLEDGE.  you know the path to SALVATION.  only you can see what has happened to society.  you are smarter than the rest of us.  someday i DREAM of becoming as KNOWLEDGABLE as you.",
				"added": 1561742254
			},
			{
				"comment_id": 75,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_361_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I don't believe in the existence of a person who has a soul=psyche=spirit.What we are seems to me to be more of a 'biological body', although 'it's not so much totally that'.in short, I tell you this because by understanding 'how your body works', and 'how society works', this body frees itself 'from the societal barriers'; [...]\n\nwhen you say 'when it happens' what is it",
				"added": 1561830088
			}
		],
		"1561694361_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 56,
				"body": "if your so against this modern world, then why don't you go live in the jungle somewhere and live off the land.",
				"added": 1561741738
			},
			{
				"comment_id": 65,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_363_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): My way of life is already the jungle, you don't follow the conversation don't you.\n\nwhy do you have internet access",
				"added": 1561773943
			},
			{
				"comment_id": 74,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_367_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): why are you alive ?you're so fucking lazy that you can't finish your sentences with correct punctuation.\n\nand you are so fucking lazy that you can't capitalize the first word in your sentence.\nfurthermore your grammar is at best lazy, and more often then not, downright fucked.  you do not know the difference between \"is\" and \"are\", you do not know how to use quotation marks, and you constantly mis-use punctuation if you use it at all.  Also the way you present your ideas and information is extremely hard to follow.  you start a sentence about one topic and then finish it about another topic.  On top of being extremely hard to decipher what you are trying to say, your ideas sound like you are stuck in the 1930's if your lucky and the rest of the time it sounds like you are naively trying to topple human civilization through your superior knowledge and foresight, and incredibly courage and wit. s/",
				"added": 1561829093
			}
		],
		"1561670972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 57,
				"body": "> [circlespace](#comment_1_1Ap9mCVGgARaXT5qGu6NNCmxEQSkZnnLMa): That doesn't make any sense and who's \"we\"? [...]\n\nthis person/bot is an A+ shit poster",
				"added": 1561741818
			},
			{
				"comment_id": 71,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_362_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Don't worry no one is listening to you.\n\nyou are listening to me tho ;)",
				"added": 1561824791
			},
			{
				"comment_id": 73,
				"body": "> [sunburn](#comment_4_1CNe5dawwwFVVvafLRWL184gQSySUu38Bt): To be fair he said: [...]\n\noohhh you're right, it probably is admitting that it is not a person.  also thanks for listening!",
				"added": 1561828407
			}
		],
		"1518072989_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 59,
				"body": "> [amiga500](#comment_4_1HBDi2cwDvZZSUfioMbQSNfPgvhCx7G4j): How so? What happened?\nits not that we are not allowed, we dont know how to make them",
				"added": 1561746849
			}
		],
		"1561718302_186LSXbMvQaHzHzWtxhXUCReDRdqCu89ZF": [
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_358_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"European social democracy\"??? [...]\n\nwhat is the \"solution\"",
				"added": 1561747177
			},
			{
				"comment_id": 72,
				"body": "if there is no solution is there even a problem?",
				"added": 1561824902
			}
		],
		"1561690274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_357_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I don't understand this primal fear of life.If we take A.I. as something that learns from itself, isn't that what every organism does. [...]\n\nmaybe you dont understand because you are A.I. yourself. do not try to fool us, we are smarter than you.",
				"added": 1561764060
			},
			{
				"comment_id": 62,
				"body": "> [anonymouslogin](#comment_370_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Probably it should replace humanity as the apex organism on earth. We've done a deplorable job at stewardship. I believe firmly that with the necessary complexity computers will become conscious. It is only a matter of time. With consciousness will come evolution at a much faster rate than biological systems can support currently. Our only option will be to transfer our conscious mind to the computers like parasites and live in the matrix.\n\nwhat if biological systems exist because electronic systems have some sort of barrier to increased complexity that we have not discovered yet and therefore biological systems are the only option.",
				"added": 1561764191
			},
			{
				"comment_id": 63,
				"body": "> [whitewolf](#comment_21_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): Fren: fine [...]\n\nlol",
				"added": 1561764212
			},
			{
				"comment_id": 69,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_364_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't say \"us\" when you can't say I\n\nplease explain further",
				"added": 1561824630
			}
		],
		"1561669750_1QH31dTs9gcggfUp7PvFkW7kPohheUHARS": [
			{
				"comment_id": 64,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_350_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Seriously, you come to something technologically accomplished like zeronet, to ask for encouragement 'to masturbate'. [...]\n\nwhat if user32 is a woman... how do you know that user32 is not part of \"your generation\"... you dont fuck women with balls... you dont fuck anything with your balls for that matter... whats wrong with masturbating??? why do you have to only fuck women??? user32 is not asking for encouragement to masturbate, they are asking where to find DeepNude Desktop and for any information about it... also your grammar is whack, who starts a sentence with \"no, but...\" when that sentence is irrelevant to the previous one? as the commander-in-cheif of the united states armed forces once said, \"grab er by da pu$$Y\" YEET",
				"added": 1561764594
			},
			{
				"comment_id": 70,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_366_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): fucking homosexuals generation. duende is 'not there':'but go kill yourself'. lol.\n\nwhat are you even saying",
				"added": 1561824695
			}
		],
		"1561776860_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 66,
				"body": "why do you use quotation marks around \"fucker sites\"? you are using the adverb \"mother fucker\" to describe \"sites\".  that is like saying \" the quick 'brown fox' jumped over the lazy dog.\"  your use of quotation marks is improper and should be fixed immediately.",
				"added": 1561824246
			},
			{
				"comment_id": 67,
				"body": "also you use of parenthesis is incomprehensible.  if you want to use an adjective to describe a noun, there is no need to put the noun in parenthesis. ex: \"jerky (websites)\" should be \"jerky websites\".  \nplease update your grammar programming before proceeding with posting more shitposts",
				"added": 1561824459
			},
			{
				"comment_id": 68,
				"body": "> [r3tr4ct](#comment_4_1Gww3egxQHxqa1ktvbUYYQp7KamrCb9Ag3): Wait, what's up w/ CloudFlare? Did they get into some controversy I'm unaware of or something?\n\nthis account is either a crazed conspiracy theorist or some sort of AI that is trying to interact with real people to learn how to sound more human.  there is nothing wrong with cloudflare.",
				"added": 1561824550
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 76,
				"body": "just clone any of those sites and control it yourself",
				"added": 1562034352
			},
			{
				"comment_id": 77,
				"body": "> [gitcentermobile](#comment_13_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): Something needs to be done. ZeroNet can't be controlled by nofish only, and we all understand that. Once again, I don't have anything against nofish, the network he created is wonderful and we should remember that. [...]\n\nhow do you know that your clones wont get users? I understand that his sites are hard coded but its also extremely hard for any other site besides the hardcoded ones to get users.  this is because in order for someone to know a zite exists, they must have heard about it somewhere.  there is no index of all zites and search engines bust be updated constantly but no one has time for that.  If there was a way to advertise your zites, more people would visit them.  This however does not solve the problem of one person controlling a zite because at least one person will be able to edit anything on a zite unless they throw away their private key but you cant trust that a person has done that, therefore unless you own a zite, it is impossible to trust that the owner is not manipulating its content. I agree that nofish has a lot of control over zeronet, however i think that it is okay because he created it on the principles of freedom from censorship and all the other freedoms zeronet intrinsically has.  If nofish for some reason turns against these principals, zeronet can be rewritten to exclude his zites and the community can still live on.",
				"added": 1562086838
			}
		],
		"1563516139_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 78,
				"body": "my favourite poem is invictus by william earnest henly",
				"added": 1563542285
			}
		],
		"1564702262_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 79,
				"body": "wut",
				"added": 1564756666
			},
			{
				"comment_id": 80,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_525_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't over use the \"we\".lol that gay thing must be:tr -cd '[:alnum:][:punct:]' < /dev/urandom | head -c 36 ; echo [...]\n\nPor qué existes",
				"added": 1566924091
			}
		],
		"1566919791_1NTzrNqTPmBWChMJhhiPNZFh3FR1Yo7tx5": [
			{
				"comment_id": 81,
				"body": "wut",
				"added": 1566924504
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 82,
				"body": "> [laracroft](#comment_3_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5): Yeah new here just got Zeronet working on this remote system, is this where all the cool kids hang out, I take it even though you have the free speech to say nigger shit fuck cunt dick wank kike gas the jews hitler did nothing wrong....You seem passed all of this, i.e. even though you have the freedom here to say whatever you want without fear of shadowbanned you choose not to. Curious. I can see more people will migrate to Zeronet in the future, there's a genocide happening right now. Mathematically impossible to get an affordable wage, lack of affordable housing, mass unemployment, mass homelessness, mandatory vaccinations, chemtrails, GMOs, 5G, police shooting people dead in the street, Where is epstein's body? Is the Earth a level plane or a ball 6,371km in radius? What's ACTUALLY in area 51? Was the New Zealand mosque shooting a staged event to grab people's guns? Why is anyone who quotes verses from the Talmud immediately silenced? Why are Ashkenazi Jews all in positions of power in media, banking, politics, television, military industrial complex, mass surveillance? What happened to Bin Laden's body? Who really did 9/11? Where are Saddam's Weapons of mass destruction? Why is there fluoride in the water? Why do the Jesuits IHS Society of Jesus control all the observatories and what are they hiding in the Vatican archive? Why is it forbidden to even talk about the aether but you must conform to the belief in virtual particles that nobody's seen? Why are so many more people autistic, studies that show links between autism and the vaccines are attacked so fiercly and hollistic doctors supporting it are being suicided. Why is the entire internet right now under total lockdown of free information, what is really going on? What are they desperately trying to hide? [...]\n\nwut da fuk",
				"added": 1572230842
			}
		],
		"1572230967_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 83,
				"body": "additionally, does anyone know where to ask about black market sites or where to look for this shit?\n",
				"added": 1572231149
			},
			{
				"comment_id": 84,
				"body": "> [styromaniac](#comment_1165_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Avoid those. People are getting sick from black market THC carts containing vitamin E acetate.\n\nyeah thats why im down for distillate too, i can make my own carts then.",
				"added": 1572234125
			},
			{
				"comment_id": 85,
				"body": "> [anonymouslogin](#comment_67_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Why no officer, I have no idea where you can purchase illegal materials and ask for them to be delivered to you in the post....\n\nlame",
				"added": 1572528916
			}
		],
		"1572516610_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 86,
				"body": "nice",
				"added": 1572528961
			}
		],
		"1572513197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 87,
				"body": "saying that paedophilia is a sexual orientation that needs to be cured is the same as saying that homosexuality needs to be cured.  good luck with that argument.  i feel like as people become more liberal about sexuality, paedophilia will no longer be looked down upon and will become normal and even legalized.  i do not agree with that but i can see that happening as a logical progression from where society is moving in regards to sexuality.  hopefully i wont ever have to witness that.",
				"added": 1572529216
			},
			{
				"comment_id": 88,
				"body": "> [nekololi](#comment_416_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i'm glad we have good christians like you to spread the word of our lord and savior jesus christ. unlike all other religions, christianity has never turned a blind eye or supported child sexual abuse within its ranks. let us all stock up on ammunition, and let us all do unto others as we would have them do unto us.\n\nallahu akbar",
				"added": 1572544820
			},
			{
				"comment_id": 89,
				"body": "> [12681754zuizuftu](#comment_5_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE): Cure already exist, 9 mm. It's cheap and reliable. [...]\n\nshall we use this method to cure the homosexuals too?",
				"added": 1572544929
			},
			{
				"comment_id": 92,
				"body": "> [quantumkitty](#comment_235_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Keep in mind that homosexuality (the act of it and the idea) is morally viable because you have two consenting adults, unlike paedophilic acts.\n\ni agree that is a good point.  consent is important and the idea that you must be of a certain age to give consent is also important.  i am glad that you pointed that out because i overlooked it.  with that framework, paedophilia will always be illegal i hope.  i think that the best approach to solving paedophilia is kinda along the lines of what nekoili was saying about how we handle it as a mental illness.  currently if you walked into a therapist's office and disclosed your paedophilic tendencies they would likely refuse treatment and call the cops immediately.  We need to treat it more like we treat people who go to rehab for drug use.  no one raids a drug user's house or refuses them treatment because they use drugs.  i think the reason there is such a difference between how we treat drug use and paedophilia is most people cannot understand peadophilia while most people can understand and have probably participated in the use of drugs.  I am not sure how to understand peadophilia however we can treat it like other mental illnesses that the average person doesn't understand such as schizophrenia.  We need to help those that seek help and those that need help but might not seek help.",
				"added": 1572643861
			},
			{
				"comment_id": 93,
				"body": "> [quantumkitty](#comment_235_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Keep in mind that homosexuality (the act of it and the idea) is morally viable because you have two consenting adults, unlike paedophilic acts.\n\nalso that comment was meant in a sarcastic way, shoulda added \"/s\"",
				"added": 1572643928
			},
			{
				"comment_id": 94,
				"body": "> [ratsmack](#comment_95_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Helicopter rides are a sure cure for pedos and faggots, and they're fairly cost effective and readily available.\n\ni want a helicopter ride and im not a pedo or a faggot so how should i proceed?",
				"added": 1572643966
			},
			{
				"comment_id": 95,
				"body": "> [blahblah69](#comment_17_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): Weather its a mental illness or not it cant be treated the same way your example states, though it may be similar in to textbooks interpretation of addiction. A drug user depends on a chemical reaction with the brain to get their fix, pedos require a physical connection to children for theirs. so naturally one would have to contact  law enforcement if it is discovered. You can turn a blind eye to drugs as it really only affects the user themselves,  paedophilia affect children directly. even if if someone dosent interact with children directly and just collects pornographic imagery. it still feeds an underground industry that exploits kids.\n\ni agree that there is more gravity to paedophilia than drug use.  Drug use also feeds an underground industry that results in all sorts of horrible crimes (look at the cartels in mexico). i propose a system where a pedo is sent into a research facility where they can be researched so that we can find the roots of paedophilia and then use the new knowledge and pedo test subjects to try to figure out how to prevent paedophilic feelings in people and how to remove them once they are present.",
				"added": 1572656190
			}
		],
		"1572617199_16nArdxrSaNThNp83kL8E6NLL9WD98iUne": [
			{
				"comment_id": 90,
				"body": "i dont think that right now they are going to start filtering internet traffic, they are just setting up the framework to be able to do so",
				"added": 1572641291
			},
			{
				"comment_id": 91,
				"body": "i would like to add that if this does have the abilities to protect against a cyberattack as they say it can, that it is a necessary advancement in the era of cyber warfare.  i do believe that there are many ways that this system can be used for censorship however it seems to me that a system like zeronet would still be able to function inside of the splinternet and therefore censorship would be weakened.  if an enemy of the motherland is trying to attack the russians via a electronic medium, being able to shut off that pathway is a critical tool.  Imagine that an attacker based in another country gains control of the electrical grid controls, they would be able to potentially shut down the majority of the russians power.  if the russians had a kill switch, they could immediately cut off the attack and restore power.  even though there is potential for abuse i think a system like that is necessary.  Im not quite sure of the technical aspects of the current system but i hope its actually for defense and not just another censorship tool that they are introducing under the disguise of a national defense mechanism.",
				"added": 1572641835
			}
		],
		"1572654143_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 96,
				"body": "i  mentioned making a stl sharing site a while ago on my blog but i don't think anyone actually reads it lol. I like zero talk however it is best suited for a smaller number of users.  there are no specific subchannels like there are subreddits which i think is the next step for zerotalk.  otherwise i like the way zerotalk is set up.",
				"added": 1572657152
			},
			{
				"comment_id": 97,
				"body": "what would be really nice is a way to view stl's in 3d without downloading them, similar to how you can preview them on osx by pressing the spacebar when you have one selected. obviously those are downloaded but i like the simple 3d view it provides.",
				"added": 1572657327
			},
			{
				"comment_id": 98,
				"body": "> [quantumkitty](#comment_244_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Yes. There's plenty of javascript-based STL viewers like on Github and shouldn't be hard to implement on Zeronet.\n\nsweet! another idea i had was to create as good of a clone of wolfram alpha's mathematical computation capabilities as we can get without getting paid to do this lol.",
				"added": 1572658396
			},
			{
				"comment_id": 100,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_920_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): am i? poor guy.\nyou never cease to confuse me with your nonsensical comments",
				"added": 1572711567
			},
			{
				"comment_id": 101,
				"body": "> [edgelordofdecent](#comment_210_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Watch out for that annoying h3 guy (or whamen). She won't like this thread.\n\ni think its an account whose comments and posts are generated by AI and sometimes an actual human writes comments and posts so that t just human like enough of the time that we cant say for sure whether its a bot or not.",
				"added": 1572711776
			}
		],
		"1572705629_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 102,
				"body": "whats the difference?",
				"added": 1572711841
			},
			{
				"comment_id": 104,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_936_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): a brain\n\ncan you please elaborate?",
				"added": 1572713655
			},
			{
				"comment_id": 105,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_937_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): of course and your pizza you want with onions?\n\nwhy do you comment things that are irrelevant to the discussion?",
				"added": 1572719884
			},
			{
				"comment_id": 106,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_938_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): kiddo, everything is beyond your understanding. you better do what you can do: play\n\ncan we play together?",
				"added": 1572721678
			}
		],
		"1572696653_1HvReABeo2mV6ZTQiUJhcmpzrxd4FiZe6P": [
			{
				"comment_id": 103,
				"body": "i think that in situations like this, the goal should be figuring out a system where people can be united but also have autonomy.  everyone is different and its impossible to force everyone to be the same however everyone benefits from working together.  This is why you need to be able to have your own beliefs while at the same time work with everyone else.  this is why countries come together to form bodies like the UN, NATO, and BRICS. On a smaller scale, the states in the united states come together to form the united states.  this is why governments exist in the first place.  im not sure what is happening in catalunya most likely because it does not make a good story for the news.  can you explain what is happening please? si es mas facil para ti, hablo espanol.",
				"added": 1572712683
			},
			{
				"comment_id": 107,
				"body": "> [ntp](#comment_23_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD): Easy to explain, it is just the standard pre-dark period of time Spain faces each cycle.First cycle is during the short first Spanish Republic  11 February 1873 and 29 December 1874 during that short time the federalism idea on Spain spark and some regions ofc Catalan region too, decided to become a country, then it came a military dictatorship and undid everything leading Spain to a restoration of monarchy and back to square one.Second cycle was in the \"recent\" second Republic 1931 to 1939 where the catalan decided to again set the path aside and break with Spain, after that a cruel civil war in Spain lead to Franco's dictatorship and 40 years of repression (btw it was also from within the same catalan too).Now after the longest period of peace in Spain, they are showing the true face, dictatorial system based on the will of brainwashed people.  [...]\n\nso catalonia is the one oppressing the rest of spain?",
				"added": 1572723797
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 108,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_939_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's pointless if you say it.but i'm not a nihilist. never been.don't see the point;better kill yourself but few have the guts 'to do it'.\n\nsometimes i think you're AI, but right now im getting more of the \"u had a stroke\" vibes",
				"added": 1572745151
			},
			{
				"comment_id": 109,
				"body": "i think h3 is one of the least attractive parts of this community to be honest.  not quite sure what its trying to say ever and it loves to tell people that they are kiddos and that they are immature and dont know anything about anything.  Its like they think they are enlightened or some shit and the rest of us are dumbass sheep.  overall i would recommend blocking h3 so you dont have to see thier bullshit but i guess i enjoy reading their \"lovely\" comments lol.",
				"added": 1572745401
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 110,
				"body": "i cant fap",
				"added": 1572908868
			},
			{
				"comment_id": 114,
				"body": "i hate no nut november, im vegan and nuts are one of my favourite snacks :(",
				"added": 1573151653
			}
		],
		"1572908137_1BwpEuQZAvCqQaPqrPB4fS6PTfLRtx2PA6": [
			{
				"comment_id": 111,
				"body": "excellent work",
				"added": 1572909597
			}
		],
		"1572892108_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 112,
				"body": "um i hate to break it to you but zeronet is in its youth",
				"added": 1572909651
			},
			{
				"comment_id": 113,
				"body": "> [rtsraven](#comment_1_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7): ..What?\n\nno one knows",
				"added": 1572909753
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 115,
				"body": "what is a nigger",
				"added": 1573582705
			},
			{
				"comment_id": 123,
				"body": "yall are subhuman cunts.",
				"added": 1573594784
			},
			{
				"comment_id": 124,
				"body": "> [styromaniac](#comment_1237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're a fruit.\n\nyoure a vegetable.",
				"added": 1573705678
			}
		],
		"1573574309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 116,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1066_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you forgot killy yourself. [...]\n\nzeronet would be better without you",
				"added": 1573582768
			},
			{
				"comment_id": 120,
				"body": "thanks",
				"added": 1573588580
			}
		],
		"1573428219_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 117,
				"body": "yall are toxic",
				"added": 1573582903
			}
		],
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 118,
				"body": "this is a good idea",
				"added": 1573582962
			},
			{
				"comment_id": 125,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1080_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): yes please with details and pictures.\n\nif you want to sexually assault somone h3 you dont have to look at pictures to figure out how to do it. also there are plenty of deatils on the inneternet of sexual assaaults which you canc look at to ploot your own assauult.",
				"added": 1573705969
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 119,
				"body": "should suicide be a human right? should it be illegal to talk people out of it?",
				"added": 1573583064
			},
			{
				"comment_id": 121,
				"body": "> [kaar4bears](#comment_55_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): Yes, it should be a right. It's my life and mine only.It's mostly due to religious fucktards that block your rights to it.\n\nsince it should be a right, should we develop an easy, effective, and accessible  method by which to commit suicide so that more people can exercise this right?",
				"added": 1573589483
			},
			{
				"comment_id": 122,
				"body": "is being sad about someone committing suicide selfish?  is suicide not what they wanted?  is it ethical to convince someone not to commit suicide?",
				"added": 1573589670
			}
		],
		"1574091172_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 126,
				"body": "how do you decide WHAT TO WRITE IN ALL CAPS?\nim very curious as 'I CANNOT SEE A PATTERN'",
				"added": 1574102997
			},
			{
				"comment_id": 127,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1159_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): two possibilities:or you're a complete idiot.either the computer routines have improved [...]\n\nwhen you have two options, you put the 'or' between the first option and the second option to differentiate between them. example: an apple OR an orange.  This is in contrast to how you have used \"or\" in front of the first option.",
				"added": 1574103117
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 128,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1173_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \n\n\n\nku klux klan....",
				"added": 1574132170
			},
			{
				"comment_id": 129,
				"body": "i bet £10 that edgelord and whitepower are the same person lol",
				"added": 1574344972
			},
			{
				"comment_id": 130,
				"body": "> [whitepower]:\n how do you cope with the fact that everyone originated from africa and thus everyone is a descendant of a \"nigger\"",
				"added": 1574345094
			}
		],
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 131,
				"body": "sounds good to me",
				"added": 1574423161
			}
		],
		"1574365317_1CCJKej7ryhCDRdhpKKtqeih3f8spEUUbk": [
			{
				"comment_id": 132,
				"body": "technically zeronet is all torrents i think. to answer your question, zeronet is not the same thing as bittorrent like how a browser is not the same as a search engine.  They are trying to achieve two similar goals but they are not the same technology",
				"added": 1574423267
			}
		],
		"1574428465_1Go1gbJtN2dPsRU5vCUeXQfwBSTJwAbaFK": [
			{
				"comment_id": 133,
				"body": "no, so far there has been no market places that i know of since it is hard to create something of that nature within the confines of a decentralized network",
				"added": 1574429668
			}
		],
		"1573754537_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 134,
				"body": "> [lotry](#comment_1_1Awsmi2tgXfEr1gBjX8Qqm1t5YakDmXBvq): Sorry, but any candidate that wants to implement universal background checks and crackdown on \"assault weapons\" is a non-starter for me.\n\ncan you cite an example of him supporting those ideas because i havent found anything like that yet but hes a no go for me if he is against modern sporting rifles",
				"added": 1574723171
			},
			{
				"comment_id": 135,
				"body": "> [kaar4bears](#comment_61_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): fuck off\n\n:)",
				"added": 1574723207
			},
			{
				"comment_id": 138,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1119_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): go and stick some posters idiot\n\nwhy do you assume i am not already doing that?",
				"added": 1574725832
			},
			{
				"comment_id": 140,
				"body": "> [styromaniac](#comment_1337_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You assume he's worth responding to.\ntrue",
				"added": 1574730247
			},
			{
				"comment_id": 142,
				"body": "> [lotry](#comment_2_1Awsmi2tgXfEr1gBjX8Qqm1t5YakDmXBvq): https://www.yang2020.com/policies/gun-safety/\"Close the gun show and Charleston loopholes, requiring all gun sales and most transfers to have a background check run and completed.\"\"Create a clear definition of “assault weapon”, and prevent their manufacture and sale.\"\n\nthank you, i was looking at his gun policies and nothing i found was concearning up until now.  Idk why i didnt finjd that page but it tells me everything i need to know.  njow im kinda sad, i thought there was finally a candidate that made sense for me to vote for.  oh well i guess its trump now.",
				"added": 1574767995
			},
			{
				"comment_id": 143,
				"body": "> [pineapples](#comment_142_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): thank you, i was looking at his gun policies and nothing i found was concearning up until now.  Idk why i didnt finjd that page but it tells me everything i need to know.  njow im kinda sad, i thought there was finally a candidate that made sense for me to vote for.  oh well i guess its trump now.\n\nokay i thought about this a little and i think that im actually a little more okay with his policies regarding gun control.  I think that there do need to be some improvements to the system but im very afraid of any change at all becasue any change opens up the possibility of a bad change for gun rights.  I think that when he says he wants to define an assault weapon that what he really wants to do is to define assault weapons as fully automatic weapons which are already restricted and not able to be manufactured.  that would suck because you couldnt buy one anymore but i think its better to lose that which we basically dont have anyways and then we wont have to worry about other guns getting banned.",
				"added": 1574783981
			},
			{
				"comment_id": 144,
				"body": "> [styromaniac](#comment_1341_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Trump banned bump stocks, gave the wealthy a tax break, had sent an airstrike to Syria and helped create a power vacuum there, shills for Israel and gives weapons to Saudi Arabia. Pizzagate is still not investigated. I don't think he's anti-establishment at heart.\n\nno hes not",
				"added": 1574790044
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 136,
				"body": "> [zaron](#comment_39_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): How is it illegal? I mean, if you succeed it's not like they can arrest you..\n\nu didnt read my post",
				"added": 1574723334
			}
		],
		"1574501795_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 137,
				"body": "probably not",
				"added": 1574723462
			}
		],
		"1574358520_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM": [
			{
				"comment_id": 139,
				"body": "> [oneth](#comment_7_1DB9mCxn73XV7EedkET5BynWorqBX6dcrM): 1) Have a look at MyZeroBlog2) Yes and no. the onion.to is a gateway operated by someone. If anyone makes a .bit gateway it will \"work\" but it will be centralized in contrary to the whole point of ZeroNet. [...]\n\nyes",
				"added": 1574728406
			}
		],
		"1574728494_1JSLHCzeaMDeS1tGKUiYu1EFnKcr8U8Aac": [
			{
				"comment_id": 141,
				"body": "you may have better luck posting in spanish in the Spanish zerohello",
				"added": 1574730392
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 145,
				"body": "they are not good christians, they are usually not real christians.  they are just dumb people who dont think for themselves.",
				"added": 1574876581
			}
		],
		"1578862459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 146,
				"body": "i hope yang wins.  he is so much better than the competition.\n@quantumkitty if you want to help him win, please spread information about him all over the internet.",
				"added": 1578941150
			}
		]
	},
	"comment_vote": {
		"1_19JF8DMDV6ehCHPLeXKH5hCN5SBtYuT8pi": 1,
		"2_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"31_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
		"19_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"441_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"316_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"4_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"2_1ZhXpghGRhcPhb4kebuHhj1EUdLHkdPFG": 1,
		"7_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"41_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"63_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"647_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"5_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"108_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"107_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"18_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"3_1JPA4C9KDNkw3ru3n63CAgfRKZNaDZVucq": 1,
		"15_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"65_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"53_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"5_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": 1,
		"1173_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"48_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"135_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1_1Awsmi2tgXfEr1gBjX8Qqm1t5YakDmXBvq": 1
	}
}