{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1635188644_1H6E7oCSjVBWLzepwc6BEtMxn4LcdtYSJ9": 1,
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "ZeroNet is far from dead an obsolete. But as with many things, it can be helpful to use many things at once. IPFS, RetroShare, Freenet... There are many other networks out there to play around with. But keep ZeroNet running all the time to contribute, and always use word of mouth to spread it. More people have to know it exists to increase the presence.",
				"added": 1632444661
			}
		],
		"1635050930_143N4eNqa9axJbroSdZfz8RLtPkJeS2HcE": [
			{
				"comment_id": 2,
				"body": "What's your badge number, faggot?",
				"added": 1635583690
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 3,
				"body": "> [planespherev4](#comment_42_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg): Hm it's still useful, even dead, in case there is an attack on the clearnet (DNS attack + major hosting servers attack). Would be a place to exchange information.\n\nTotally agree. We need to keep resources like this available. Same reason I keep SDR and HAM equipment. Things go south, gotta have comms.",
				"added": 1635584122
			}
		],
		"1635188644_1H6E7oCSjVBWLzepwc6BEtMxn4LcdtYSJ9": [
			{
				"comment_id": 4,
				"body": "They exist, but are not aliens, they're demons. They are not interstellar, they are interdimensional. The elite of the world are trying to bring them over from the other side, and also, are literally doing everything the bible said they would. It's comical. The more obscenely obvious it all becomes, the more blind the world is to it. It's written in crayon on a 3 million foot tall sign and people still pretend it's not happening.",
				"added": 1635727175
			}
		],
		"1625319270_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "ZeroNet is amazing. The problem comes from the neo-Neanderthal that inhabits Earth now. Laziness, baby-like lifestyle. Nobody wants to put in the effort to keep ZeroNet alive, and no one wants to be the one to maintain backbones to keep it running right.",
				"added": 1635729075
			}
		]
	},
	"comment_vote": {
		"1_1Cpr9kX9gxHKgmfaGVoxoAdMdYZLVUt2QC": 1,
		"9_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"1_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z": 1,
		"42_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": 1
	}
}