{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 1,
				"body": "Зачем ты поверхностно лезешь в политику? Тебе так нравится всех хуесосить и делать вид, что ты в теме?",
				"added": 1556379439
			},
			{
				"comment_id": 7,
				"body": "> [nononono](#comment_56_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): ...или просто малограмотные мудаки. Этого тоже исключать нельзя.\n\n\"Малограмотные\" говоришь, Мань?",
				"added": 1564733779
			}
		],
		"1_1JAiKS3giLzSw1YQWZPVAct377nyiApDW2": [
			{
				"comment_id": 2,
				"body": "Будем надеяться на лучшее",
				"added": 1556379528
			},
			{
				"comment_id": 8,
				"body": "> [nononono](#comment_45_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Пока путин у власти - нет.\n\nТы скозал?",
				"added": 1564733890
			}
		],
		"1_17pyCvFSCXyYUiEid8Wa1dmchWa1Cr7AcK": [
			{
				"comment_id": 3,
				"body": "Ты на сосач вернуться не хочешь?",
				"added": 1556379604
			}
		],
		"1_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": [
			{
				"comment_id": 4,
				"body": "А почему хохлы тут?",
				"added": 1564730842
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 5,
				"body": "А зачем тебе это нужно? Демократия не нужна России, лол",
				"added": 1564730927
			}
		],
		"3_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": [
			{
				"comment_id": 6,
				"body": "> [pizdahd2](#comment_4_1GNmgfvedwax74FWN2ZK7w8cBR4tDyGaH4): Так вот по поводу чурак, карочи смотрю я дневник хача ахуенная тема и мужики не врут нехуя сколько зарабатывают, как живут все показывают ничего не скрывают, так что ментолитет у хачей вроде нормальный.Может какой то чурка и гнелой но точно не все, я про русских тоже молчу нахуй, половина те еще кидалы а вот эти хохлы вообще пиздец кидать людей любят. Карочи меня бесят именно кидалы, когда человек намеренно             пытается наебать, вот такие люди меня пизда бесят это гнелые уебки которых надо просто нахуй вешать.И само собой все эти уебки сидят в провительстве думают что кидать людей пока они не видят нехуя нормально.Как меня бесят эта ебаная шайка с путином которые сука давно должны были повесится нахуй, я бы их всех ебнул, прогнили полностью уже суки. И какой пример показывают молодому поколению, щяс молодое поколение увидет что такие уебаны на верхушки сидят и тоже будут намеренно наебывать и что в итоге мы получим, гнелую нацию нахуй нам это надо вот вы скажите мне.\n\nЧто же ты творишь, содомитище",
				"added": 1564733094
			}
		]
	},
	"comment_vote": {}
}