{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Neoliberalismo: o capitalismo como terrorismo",
			"body": "As tentativas de compreender e explicar o capitalismo servem ao processo de superá-lo. Está provado que o capitalismo não é justo para a maior parte das pessoas que habitam o mundo porque o acúmulo do capital nas mãos de poucos seres humanos, alguns indivíduos e suas famílias, em detrimento da imensa maioria da população mundial, uma grande parte em estado de inanição, implica processos de exploração do trabalho humano e de apropriação indébita do patrimônio universal, incluso o imaterial, marcados por processos de injustiças sociais e políticas até o extremo da violência.\n\nDe fato, o termo “terrorismo” é complexo. Trata-se de um termo impreciso e até mesmo não recomendável segundo alguns teóricos, pois seu uso implica aspectos emocionais e uma espécie de compulsória acusação ao opositor. Assim, é como se o termo fosse pouco objetivo para tratar de certos fenômenos. Deste modo, o discurso de vários Estados muitas vezes denominarão como “terroristas” os grupos e os atos dos seus opositores, tratarão a esses opositores como inimigos enquanto, ao mesmo tempo, serão capazes de praticar atos que serão definidos como “terrorismo de Estado”, colocando o próprio Estado acusador em uma posição de evidente contradição.\n\nDe qualquer modo, podemos usar uma definição muito básica para seguir com essa exposição. Tomemos por terrorismo a promessa da violência, a ameaça de sua irrupção a qualquer momento, de uma maneira que não poderá ser prevista e nem controlada. O terror é fundamentalmente o domínio do medo gerador de violência em um contexto político. A violência que se realiza a partir dessa promessa, ela mesma geradora de um clima mental e intersubjetivo, é o que podemos denominar terrorismo.\n\nEm um clima de terrorismo, as pessoas se sentem sob ameaça. Na ameaça, elas sentem medo e, ao sentirem medo, sentem também ódio do objeto que seria o “motivador” do medo. O ódio contra o “diferente”, sejam os estrangeiros, os pobres, os “negros”, os “muçulmanos”, os “judeus”, “os comunistas”, os “esquerdistas”, as pessoas fora dos padrões da heterossexualidade compulsória, e até mesmo fora dos padrões da plasticidade corporal (todos os que estiverem fora do paradigma da estética burguesa aplicado ao corpo e às vestimentas) se torna inevitável nesse processo.\n\nEm outras palavras, o ódio é o efeito esperado no clima de medo promovido e administrado pelo sistema que necessita do medo e que impinge o terror para produzir medo. O círculo vicioso é visível. Natural que se promova nesse processo o terror contra as pessoas que se opõem ao sistema que produz a opressão. O terror é a tática de acuamento que tende a funcionar para os fins do poder.\n\nAssim, quem for crítico do sistema do terror já é alvo de ameaças. Em nossa época, há muitos agentes do que podemos chamar de terrorismo voluntário, pessoas que trabalham gratuitamente para a máquina do terrorismo digital da internet, por exemplo. Pessoas que operam tentando fazer com que os críticos desistam de permanecer no fórum digital. A intolerância deve ser uma regra desse terrorismo digital praticado por milícias pagas, bots, voluntários etc. O terrorismo, nesse caso, é aplicado a todos os que pensam. Contra professores, intelectuais e todas pessoas que possam contrapor-se por atos de linguagem ao poder-violência do terrorismo. Há quem esteja com medo de pensar porque pensar reflexivamente se transformou em uma ameaça.\n\nO terror sempre foi uma metodologia política muito eficaz para o controle dos insurgentes e das populações como um todo que costumam, na condição de massa, dar respostas muito fáceis aos seus manipuladores. Também foi utilizado para o controle das “elites”. O exemplo mais conhecido na história é o período do terror na Revolução Francesa no final do século 18, quando a guilhotina se tornou o mecanismo que impunha o medo. O terror foi usado pelos revolucionários, mas logo foi praticado pelos conservadores que governaram depois da queda de Robespierre.\n\nUso esse exemplo para afirmar o seu caráter de metodologia política usada pelo poder. Mas há muitos outros. O que as mulheres viveram na passagem do século 15 para o 16 na Europa, a chamada “caça às bruxas”, também foi um metodologia de terror. A perseguição, as ameaças a indivíduos e, por fim, a ameaça generalizada a tudo e todos é a sua característica.\n\nO terror nem sempre se escancara ou espetaculariza. Por exemplo, podemos dizer que os judeus na Alemanha nazista viviam em um regime de terror, que os críticos da ditadura militar nos países da América Latina viviam controlados pela ameaça, como vivemos hoje no Brasil. O terrorismo é também um clima na imprensa. Jornalistas que trabalham em empresas de comunicação que servem às ditaduras têm medo de ir contra seus patrões, não apenas pela ameaça da perda de emprego, mas muitas vezes por violências muito piores.\n\n#Ideologia e terror\n\nNão é difícil compreender o terror como tecnologia política. O clima mental e concreto de medo, de ameaça de violência serve à manutenção da ideologia do poder vigente. A ideologia é a parte mais sutil do terror, que serve para controlar a sua aceitação em um nível mental e afetivo. Espera-se que as pessoas estejam alinhadas intelectual e emocionalmente à ideologia e, se não estiverem, o terror pode se fazer necessário, como no extremo, a prática real da violência e não apenas a sua ameaça.\nOra, o capitalismo é uma ideologia econômico-política. Para funcionar, ela precisa ser introjetada mentalmente, psiquicamente, também fisioteologicamente.\n\nIntrojetamos essa ideologia por diversos caminhos. Em primeiro lugar, somos seduzidos. Aprendemos a gostar desde crianças do estilo de vida do “consumo” que nos soa prazeroso. O consumismo conta com a eterna infantilização de pessoas que querem ter desejos realizados imediatamente e de maneira mágica. Passar para a crença fácil na “terra plana” e teorias similares é sinal de infantilização cognitiva que contenta muita gente nesse momento.\n\nMais tarde saberemos que há preços a pagar na ideologia da produção e da servidão aos donos dos meios de produção. É a fase em que se tem que trabalhar, colaborar, obedecer. Nessa fase entra em cena o assédio. Quando nossos desejos não podem ser contemplados temos que aprender a aceitar. Somos então assediados diariamente pela publicidade, pela televisão, pelo dever de colaborar, de fazer, de comprar, de lucrar e de gastar. O grande assédio é praticado na base da razão publicitária. Não vemos o processo de assédio porque a presença da propaganda em nossas vidas foi naturalizada. Em todos os lugares somos condenados a ela.\n\nAntes de seguir, gostaria de deixar claro que não estou falando pura e simplesmente contra a propaganda, nem contra a publicidade como área de trabalho, no sentido de sustentar sua eliminação. Também é preciso deixar claro que é possível que pessoas adultas e prevenidas possam até controlar os níveis de presença da publicidade em suas vida. Não podemos esquecer no entanto que nem todos são adultos e muito menos precavidos.\n\nHá um nível que vai além do assédio, é o da intimidação. Quando o gerente do banco liga pedindo que se compre um seguro e sentimos medo de não comprar, medo de perdermos alguma vantagem ou o respeito e a possível ajuda do referido gerente, já estamos avançando na esfera do assédio rumo à intimidação. Bom lembrar também que assédio não é apenas algo sexual. Assédio é toda forma de pressão que não nos deixar outra alternativa senão ceder ou sofrer com as consequências.\n\n#O preço da visão\n\nAqui vou citar o exemplo do cinema: se hoje vamos ao cinema, compramos um ingresso para ver um filme e, antes do filme, somos obrigados a ver propagandas. Somos obrigados a ver, mesmo que não tenhamos pago para ver. No entanto, ela não é de graça como finge ser. Ela cobra o nosso tempo de visualização. No mundo da mídia, o tempo da visualização tem preço. Na televisão a audiência define patamares de investimentos publicitários em programas e horários financializados justamente em função da visualização. Em plataformas como Youtube, a condição de visualização é óbvia para a presença de propaganda. Isso significa que se trata de uma indústria e de um mercado em que a produção e o consumo, bem como o lucro são produzidos por quem parece estar apenas se divertindo. Mas se trata também do fato, nunca divulgado, de que nosso olhar tem preço. De que as horas dedicadas diante de telas envolvem capital. O olho das pessoas está sendo assaltado a todo momento.\n\nO direito de não ser invadido, de não ser assediado pela propaganda é o que está em jogo em nossa época.\n\nEsses mundo da produção visual em seu esquema de apropriação indébita de nossa visão e de nossos corpos nos serve para pensar o todo da produção. Seja a produção digital, dos escravos digitais de nossa época, aqueles que voluntariamente foram “capturados” na grande máquina da internet e das redes (além dos que ganham dinheiro com isso, se aproveitando da máquina), seja a produção analógica, todos estão submetidos aos donos dos meios de produção do capital.\n\nOnde está o terrorismo? No caráter inescapável que lhe configura também como um totalitarismo. No âmbito da vida digital o terrorismo está na ameaça de que seremos apagados, eliminados da vida se não estivermos integrados na internet, no Facebook ou nas redes sociais. No âmbito da vida analógica, o terrorismo está na proibição peremptória de estar em desacordo, de criticar ou de imaginar um outro mundo possível. Usar, portanto, clichês como “comunismo”, “marxismo”, “esquerdismo”, “feminismo”, “ideologia de gênero”, “pedofilia” e outros clichês com conteúdo negativo, como ameaças, como fatores produtores de medo é parte do terrorismo difuso do capitalismo.\n\nA produção de mentiras, de campanhas de difamação por fake news geram uma clima de pavor e de insegurança em pessoas ingênuas – aquelas que acreditam, por exemplo, que comunistas estão prontos para “comer criancinhas” ou outros clichês bizarros – antes de se chegar ao limite de assassinar líderes democráticos indesejáveis tais como indígenas, líderes comunitários ou, para citar o exemplo que emociona o mundo, uma liderança como Marielle Franco.\n\nO terrorismo é parte do caráter totalitário e autoritário do capitalismo que, em sua forma neoliberal, não permite a diferença. Não permite a democracia e, ao mesmo tempo, precisa criar um clima de desnorteio para que ninguém mais seja capaz de se questionar sobre o estado injusto das relações econômicas. O capitalismo é terrorismo como psicopoder em estado puro.\n\n#A natureza\n\nPor fim, é preciso dizer que a exploração destrutiva da natureza também é um aspecto que faz parte da história do capitalismo que devemos colocar no cômputo das ações atuais do neoliberalismo. O neoliberalismo é a forma histórica assumida pelo capitalismo atual como ideologia política de feição terrorista. A destruição da natureza, das florestas pelo desmatamento, dos rios e mares pela poluição, do subsolo pela exploração de metais, do solo pelo abuso de agrotóxicos e das espécies não-humanas por todos os fatores anteriores ameaçam de extinção também, em um efeito bumerangue, toda a espécie humana.\n\nO capitalismo se revela como extremismo no momento em que permite a exploração sem limites e o vale tudo em todas as esferas da ação sob a máscara de um livre mercado. Nada lhe escapa. A natureza sempre foi explorada e a história do capitalismo se confunde com sua destruição. Mas a ameaça contra a natureza – no contexto de tantas catástrofes pontuais e da grande catástrofe climática por vir – é parte das práticas de terror que assolam o mundo hoje e que a todo custo é escondida pelos interessados no puro lucro e no puro capital.\n\nNessa perspectiva, se descarta a natureza diariamente como um fator fundamental de nossas vidas e, todos os governantes que não se responsabilizam por isso, sabem que participam da destruição do mundo.\n\n- Fonte: https://web.archive.org/web/20200326153746/http://revistacult.uol.com.br/home/neoliberalismo-capitalismo-como-terrorismo/",
			"added": 1586618658
		},
		{
			"topic_id": 2,
			"title": "Neoliberalismo e autoritarismo, uma história de amor",
			"body": "Há algo de novo na forma como se exerce o poder em todo o mundo. Paradoxalmente, esse “novo” remete ao passado, na medida em que associado tanto a discursos ultraconservadores e xenófobos quanto a práticas inquisitoriais e oligárquicas. A principal característica dessa nova forma de exercício do poder é a ausência de limites, o que pode ser observado com a emergência de experiências autoritárias a partir da chegada ao poder político de pessoas como Trump, Salvini, Orban, Erdogan e Bolsonaro.\n\nSe entendermos a democracia como um horizonte que aponta para uma sociedade autônoma (em que a pessoas não precisam apostar no autoritarismo por medo de exercer a liberdade), com deliberações coletivas (com efetiva participação popular na tomada das decisões políticas) e voltada à concretização dos direitos e garantias fundamentais (o que só é possível com limites rígidos ao exercício do poder), não é possível afastar a hipótese de que essa deriva autoritária é o resultado da estratégia de culpar a democracia pelos efeitos das políticas neoliberais iniciadas no Chile após o golpe de Estado que derrubou Salvador Allende, e que se expandiram para todo o mundo, com especial destaque para a Inglaterra de Thatcher e os Estados Unidos de Reagan.\n\nSegundo essa hipótese, a destruição do projeto de bem-estar social, bem como a desarticulação dos coletivos que atuavam na vida política (sindicatos, comunidades eclesiais de base etc.), somado ao ressentimento e à cólera produzida pela perda de direitos dos trabalhadores e de prestígio social pela classe média, teria levado à opção por soluções autoritárias. Da mesma maneira que na década de 1930 o fascismo foi apresentado como uma reação ao liberalismo, o ultra-autoritarismo é vendido ao cidadão como uma resposta à atual crise.\n\nEsse autoritarismo, que recorre a soluções que podem ser identificadas como tipicamente fascistas, surge da manipulação de sentimentos compreensíveis e promete o retorno a um passado mítico de paz e segurança. Tem-se nessa ilusão por modelos autoritários uma manifestação do que Bauman chamou de “retrotopia”, a nostalgia por um passado que nunca existiu, mas que permite “resgatar” formas de identidade (nacional, comunitária, raça, classe, gênero etc.) e velhos preconceitos.\n\nO que há de novo, e revela a engenhosidade do modelo, é que essa nova forma de governabilidade que surge da crise produzida pelos efeitos do neoliberalismo (desagregação dos laços sociais, demonização da política, potencialização da concorrência/rivalidade, construção de inimigos, desestruturação dos serviços públicos etc.) promete responder a essa crise com medidas que não interferem no projeto neoliberal e, portanto, não alcançam a causa da cólera e do ressentimento da população. Para iludir e mistificar, criam-se inimigos imaginários (os direitos humanos, a democracia representativa, a degradação moral, a depravação sexual, a diversidade, as minorias, Lula, Kirchner, Sócrates, etc.) que são apresentados como os responsáveis pelos problemas concretos suportados pela população.\n\nDisfarçado, o neoliberalismo revela-se plural e plástico. Pode-se, então, falar em um novo neoliberalismo, “ultra-autoritário”, que não só se alimenta da crise (e gera crises para esse fim), como também fabrica e persegue “culpados” pelos danos causados pela própria lógica neoliberal. Se, por um lado, o novo neoliberalismo (no Brasil, com Bolsonaro; nos EUA, com Trump) surge como uma “resposta” (populista, que manipula afetos produzidos na fronteira entre “nós, os insatisfeitos” e “eles, os causadores da insatisfação”) aos danos perversos gerados pelo neoliberalismo “clássico” (no Brasil de FHC, nos EUA de Clinton), por outro, continua a servir aos mesmos objetivos, mais precisamente: a busca de lucros ilimitados, a “financeirização” do mundo, a destruição dos obstáculos ao poder econômico e o controle dos indesejáveis (pobres e inimigos políticos do neoliberalismo). Em resumo, com ou sem verniz democrático, o neoliberalismo, que se revela adaptável a qualquer ideologia (inclusive ao fascismo), sustenta e atende à lógica do capitalismo global.\n\nNo Brasil, é interessante olhar o exemplo do nacionalismo de Bolsonaro, que não tem qualquer traço de nacionalismo econômico. Se no plano discursivo, o “Brasil (estaria) acima de tudo”, no campo econômico o mercado revela-se um Deus acima de todos. Ainda sobre o fake nacionalism típico desse novo neoliberalismo, basta pensar no que se fez com as reservas brasileiras de pré-sal e na retomada dos processos de privatização. Tem-se, nesse campo, uma estranha combinação de apoio irrestrito ao capitalismo global e discurso nacionalista contra inimigos imaginários (comunistas, bolivarianos, turismo gay, etc.). Em apertada síntese, utiliza-se o discurso nacionalista para reforçar o neoliberalismo e melhor atender aos interesses do poder econômico.\n\nO fascismo, que acompanha esse modelo em diversas partes do mundo, é acidental. Pode não existir em formas neoliberais. Entretanto, existe sempre que necessário para facilitar as coisas (e o lucro) para os detentores do poder econômico. Compreender o que é o neoliberalismo hoje, seu caráter plástico e plural, é importante para não cair na ilusão da falsa oposição entre o neoliberalismo clássico e o neoliberalismo ultra-autoritário, isso porque um só existe em razão do outro, certo que os dois miram os mesmos objetivos e atendem aos mesmos interesses. O “novo” neoliberalismo ultra-autoritário não é a resposta adequada para os danos causados pelo neoliberalismo clássico, da mesma forma que o neoliberalismo clássico não é a reposta adequada ao autoritarismo do novo neoliberalismo.\n\nImportante, portanto, reconhecer que mais do que um conjunto teórico, um modelo econômico ou um modo de governabilidade, hoje, o neoliberalismo é uma racionalidade, uma normatividade (nesse sentido: Christian Laval e Pierre Dardot), que transforma instituições, afasta valores democráticos e condiciona o modo de ver e atuar no mundo, fazendo com que tudo e todos sejam tratados como objetos negociáveis.\n\n#Brasil: o laboratório do ultra-autoritarismo\n\nNo Brasil, mais do que em outros países submetidos à racionalidade neoliberal, o autoritarismo encontra facilidade para se tornar aceito no meio social, o que permite levantar a hipótese de que é o local ideal para servir de laboratório para o novo neoliberalismo ultra-autoritário. Da mesma maneira que o Chile de Pinochet foi o laboratório para as experiências do neoliberalismo clássico, o Brasil de Bolsonaro revela-se o locus ideal para essa nova experiência que une mercado, rentismo, lógica concorrencial, eliminação da democracia e práticas autoritárias.\n\nA ausência de rupturas históricas com um passado de arbítrio, violência, racismo e hierarquização entre pessoas fez com que a sociedade brasileira permaneça lançada em uma tradição autoritária que leva à crença no uso da força, ao medo da liberdade, ao anti-intelectualismo (ódio/inveja do conhecimento), ao convencionalismo (aderência rígida aos valores da classe média mesmo que contrários às conquistas civilizatórias), à tendência à simplificação da realidade (a contentar-se com explicações simplistas e ausência de reflexão), à submissão autoritária (atitude submissa e acrítica diante de autoridades idealizadas), à anti-intracepção (oposição à mentalidade imaginativa e sensível), à preocupação exagerada como a sexualidade alheia, à projetividade (disposição para crer em ameaças no mundo que se originam de fortes impulsos inconscientes), dentre outras distorções típicas do pensamento autoritário. Em um país com essas características, que nunca conseguiu romper com o imaginário (perverso) gerado por fenômenos como a escravidão e a ditadura militar, para citar apenas dois exemplos, não é difícil entender como tanta gente ainda aposta em medidas autoritárias e racistas.\n\nEssa tradição autoritária, que condiciona todo o processo de interpretar o mundo e, em consequência, o modo de ser no mundo, explica muitos desvios e também a naturalização com que distorções autoritárias são encaradas na sociedade. Mortes desnecessárias e prisões ilegais não chocam. A liberdade, por sua vez, deixou de ser um valor inegociável e passou a ser vista como uma ameaça e, ao mesmo tempo, como um obstáculo aos fins repressivos do Estado (como um sintoma de impunidade). A recente negativa estatal de dar efetividade aos dispositivos legais que, em nome do valor democrático “liberdade”, deveriam assegurar a presunção de inocência e a fixação do regime de cumprimento da pena dos condenados após descontado o tempo de prisão provisória (este último dispositivo, aliás, elaborado a partir da sugestão e da contribuição decisiva dos juristas Giane Ambrósio Alvares, Marcelo Semer e Patrick Mariano) só pode ser explicada à luz da tradição autoritária a serviço do projeto neoliberal ou, em outras palavras, a partir da normatividade neoliberal que não conhece limites éticos, legais ou mesmo constitucionais.\n\nEntender o neoliberalismo ultra-autoritário passa necessariamente por reconhecer que essa racionalidade leva à imunização do mercado e dos verdadeiros detentores do poder econômico contra qualquer ameaça ou intervenção externa (e a democracia é vista como uma ameaça). O neoliberalismo, ao mesmo tempo, que faz da ilimitação e da concorrência os modelos normativos a serem seguidos nas relações sociais e nas instituições, produzindo igualmente mudanças na subjetividade, tem também uma “dimensão destrutiva”, como bem percebeu Pierre Sauvêtre.\n\nEssa dimensão destrutiva visa eliminar tudo aquilo que possa representar um risco à propriedade, ao mercado, à livre circulação do capital, ao lucro, enfim, aos interesses dos detentores do poder econômico. E isso pode se dar tanto no que diz respeito à proteção do mercado contra práticas sociais ou políticas democráticas de redistribuição de renda ou regulatórias, quanto na eliminação, inclusive pelo sistema de justiça, dos inimigos do projeto neoliberal através de medidas autoritárias.\n\nHoje, superar o autoritarismo passa necessariamente por superar a racionalidade neoliberal: um sem o outro não se mantêm.\n\nRUBENS R.R. CASARA é juiz de Direito do TJRJ e escritor. Doutor em Direito e mestre em Ciências Penais. É professor convidado do Programa de Pós-graduação da ENSP-Fiocruz. Membro da Associação Juízes para a Democracia e do Corpo Freudiano\n\n- Fonte: https://web.archive.org/web/20200313024351/http://revistacult.uol.com.br/home/neoliberalismo-e-autoritarismo-historia-de-amor/",
			"added": 1586618823
		},
		{
			"topic_id": 3,
			"title": "The Proxy Bay",
			"body": "- https://proxybay.onl/\n- https://proxybay.github.io/\n- https://github.com/proxybay/proxybay.github.io.git\n\nO Pirate Bay foi bloqueado em muitos ISPs ao redor do mundo.\n\nCom um site proxy, você pode desbloquear The Pirate Bay facilmente. O Proxy Bay mantém uma lista atualizada dos sites proxy TPB em funcionamento.",
			"added": 1586631793
		},
		{
			"topic_id": 4,
			"title": "Coronavírus: 3 respiradores para 5 milhões de pessoas: o drama da pandemia na África",
			"body": "#Três respiradores para 5 milhões de pessoas.\nEsse é o número de máquinas de ventilação mecânica, essenciais para pacientes com covid-19 em estado grave, que a República Centro-Africana tem para toda a sua população.\nEm Burkina Faso, a proporção é de 11 respiradores para 19 milhões de cidadãos. Já em Serra Leoa, são 18 para 7,5 milhões.\n\nA pandemia do coronavírus que começou na China e se espalhou pelo mundo chegou ao continente africano, onde especialistas preveem que vai provocar uma tragédia de \"imensas proporções\".\nNa semana passada, o etíope Tedros Adhanom, diretor-geral da Organização Mundial da Saúde (OMS), disse que a África deve se preparar para \"o pior\".\n\"A África deve acordar\", afirmou.\nAlertas semelhantes foram emitidos por autoridades de outras instituições internacionais, que assinalaram que o \"desastre é iminente\" no continente e que pode se transformar em uma \"tempestade brutal\" se medidas urgentes não forem tomadas.\nJá são ao todo 12 mil casos confirmados do novo coronavírus e quase 600 mortes na região até esta quinta-feira (09/04).\nO país mais afetado é a África do Sul, com cerca de 2 mil casos, seguida por Argélia, Egito, Marrocos e Camarões.\nÀ primeira vista, o número é bastante inferior ao de outros continentes e até mesmo países.\nPara se ter uma ideia, o Brasil já tem cerca de 16 mil casos confirmados do vírus.\n\nMas o que causa tanto temor pela pandemia no continente?\n\n\n#Sistema de saúde precário\nSegundo projeções, o contágio na África do Sul está com um atraso de duas a três semanas em relação à Ásia e à Europa.\nConsequentemente, diferentes ONGs e instituições internacionais aconselharam os governos africanos a aplicarem medidas como o confinamento e o fechamento de suas fronteiras.\nAlguns deles seguiram a recomendação. A África do Sul, por exemplo, implementou a quarentena obrigatória e anunciou que começará a fazer milhares de testes de casa em casa.\nA Nigéria confinou os moradores de suas duas cidades mais populosas, enquanto a Gâmbia fechou suas fronteiras. E no Quênia há um toque de recolher.\nNo entanto, nada disso parece ser suficiente.\n\"Os casos estão aumentando muito, muito rapidamente\", diz a nigeriana Mary Stephen, representante da OMS na África.\n\"Temos de quebrar a cadeia de transmissão e, quanto mais casos tivermos, mais difícil será\", diz ele à BBC Mundo.\n\"Devemos impedir que as mortes aumentem e, para isso, precisamos ser mais proativos e implementar medidas preventivas e de controle com urgência\", acrescenta.\n\nA médica explica que um dos grandes problemas que a África tem para enfrentar a pandemia é o seu precário sistema de saúde, com falta de leitos, unidades de terapia intensiva (UTI), médicos especialistas e o restante de equipamento essencial para enfrentar o vírus, como respiradores.\nÉ por isso que, diz Stephen, é tão importante quebrar a cadeia de transmissão \"antes que seja tarde demais\".\nOpinião semelhante é defendida pela epidemiologista Anna Roca, que vive na África há dez anos trabalhando para a Unidade de Gâmbia da Escola de Higiene e Medicina Tropical da Universidade de Londres (LSHTM).\n\"Estratégias para lidar com a pandemia, como achatar a curva de contágio, foram projetadas na Europa ou em países de alta renda e é muito difícil pensar que possam ser implementadas nesses países\" , disse ela à BBC News Mundo, o serviço de notícias em espanhol da BBC.\n\n\"Aqui o sistema ficará saturado muito mais cedo do que nesses países; entrará em colapso muito rapidamente\", acrescenta.\n\n#'Dano colateral'\nComo exemplo, a pesquisadora afirma que na Gâmbia não existem unidades de terapia intensiva.\nAtualmente, cerca de 100 leitos estão sendo criados em todo o país para combater a pandemia, mas estima-se que serão necessários mais de 1 mil.\n\"Ou seja, estamos atrasados em tudo\", diz ela.\nSegundo a ONG Comitê de Resgate Internacional (IRC, na sigla em inglês), a Somália só tem 15 leitos UTI para quase 15 milhões de pessoas, o Malauí, 25 para 17 milhões e a Uganda, 55 para 43 milhões.\nAssim, teme-se que a disseminação da pandemia possa ter efeitos devastadores em um dos sistemas de saúde mais fracos do mundo, colocando em risco também milhões de pacientes que sofrem de outras doenças como tuberculose, aids, malária ou desnutrição.\n\"O dano colateral esperado na África é muito maior do que na Europa\", diz Roca.\n\"Aqui está claro que as mulheres não levarão seus filhos a programas de vacinação, portanto, pode haver surtos de outras doenças\".\n\nE \"também é esperado que os hospitais não sejam capazes de cuidar de outros pacientes; existe até o medo de que as mulheres tenham seus filhos em casa, o que pode levar ao aumento da mortalidade em recém-nascidos\", acrescenta.\n\n\n#Más condições de higiene e falta d'água\nOutro fator a ser levado em conta é que, na África, existem muitas áreas em que falta o básico, como água e sabão, o que impossibilita lavar as mãos, a melhor prevenção contra o novo coronavírus.\nSegundo o Fundo das Nações Unidas para a Infância (Unicef), na região subsaariana, 63% das pessoas que vivem em áreas urbanas (ou 258 milhões de pessoas) não têm acesso à possibilidade de lavar as mãos.\nEnquanto isso, na África Ocidental e Central, mais de um terço de todas as pessoas ainda não têm acesso a água potável.\n\n\nIsso faz com que as condições de higiene sejam extremamente frágeis.\n\"Para obter água na Gâmbia, é preciso sair de casa e coletá-la nas torneiras públicas. Portanto, a higiene não é uma prioridade, porque não há água para lavar as mãos continuamente\", explica Roca.\nAlém disso, a alta densidade populacional de algumas áreas deste continente torna ainda mais difícil conter a pandemia.\nPor exemplo, em Nairóbi, capital do Quênia, existem favelas - como a chamada Mukuru - onde mais de meio milhão de pessoas vivem superlotadas.\nLá, as casas são feitas de papelão ou plástico, não têm ventilação ou drenagem, nem coletam resíduos: a fórmula perfeita para a propagação de doenças.\n\"Não podemos separar uma criança da outra em caso de infecção. Não temos espaço. Não há quartos aqui\", disse à BBC uma das moradoras deste local, Celestine Adhiambo.\nDa mesma forma, existem tradições culturais profundamente enraizadas em algumas sociedades africanas que também não ajudam a impedir o contágio.\n\n\"Aqui os programas da Europa para isolar pessoas vulneráveis são muito difíceis de implementar, pois muitas famílias vivem juntas, na mesma casa e todas comem do mesmo prato\", explica Roca.\nAlém disso, em muitos casos, os governos não estão transmitindo as informações corretas para impedir a transmissão da doença.\n\"Precisamos garantir que as pessoas estejam sendo adequadamente informadas sobre o que está acontecendo em seus países e como elas podem cuidar de si mesmas, por exemplo, por distanciamento social ou como tossir e espirrar, lavar as mãos etc.\", explica Stephen, da OMS.\n\"Há muito pânico e, porque as pessoas estão em pânico, há países que estão agindo sem evidências científicas\", acrescenta.\n\n#Impacto dramático na economia\nA crise do coronavírus expõe outros problemas que assolam muitos países africanos: uma enorme desigualdade social.\n\"Vamos ver a diferença, a divisão entre ricos e pobres\", diz Andrew Harding, correspondente da BBC na África.\n\"Já o vemos na África do Sul, com as diferenças nos sistemas de saúde público e privado. E, como sempre, os pobres serão os que mais sofrerão\" , acrescenta ele à BBC News Mundo.\nE, em economias instáveis como a de muitos países africanos, a possibilidade de criar pacotes econômicos que ajudem as pessoas a lidar com a crise é vista como uma possibilidade muito remota.\n\nConsequentemente, muitas pessoas não serão capazes de parar de trabalhar porque não terão nada para comer.\n\"Em países onde as pessoas ganham o dinheiro do dia, onde não existe possibilidade de poupar, onde a maioria das trocas comerciais é informal, o impacto pode ser muito grande e rápido\", explica Roca.\nNeste sentido, algumas dessas medidas já estão afetando países da região.\nA Gâmbia fechou suas fronteiras com o Senegal, do qual depende fortemente, um duro golpe à sua economia.\nPara o correspondente da BBC Africa Andrew Hardwing, \"não há dúvida de que isso pode se transformar em um desastre\".\n\"O impacto econômico na África será enorme, porque temos economias muito vulneráveis e , mesmo nas mais sofisticadas, como a África do Sul, o golpe será muito forte\", explica ele.\nAlém disso, é muito difícil pensar que países com situações econômicas estáveis serão capazes de ajudá-las porque, desta vez, a crise está atingindo todos.\nEspecialistas acreditam que será difícil obter ajuda de outros países, porque todos estão sendo afetados pela pandemia.\nOutra preocupação é sobre o fim da ajuda humanitária, essencial para muitos países africanos.\n\"Aqui estamos acostumados ao fato de que, quando as catástrofes acontecem, os países de alta renda nos enviam recursos. Mas, no momento, é muito difícil pensar que essa ajuda chegará até nós\", diz Roca.\nPor enquanto, a única esperança que resta é que a pandemia leve tempo para se agravar na África, para que, quando isso acontecer, outros países do mundo, mais desenvolvidos, já tenham superado suas crises e possam enviar os reforços necessários.\n\n\"Os dados indicam que o surto aqui será tão forte quanto na Europa e não estamos preparados. Espero que, quando emergirem da pandemia, eles reajam rapidamente para ajudar a África\", conclui Roca.\n\n\n#'Tsunami de miséria'\nSegundo um estudo da ONU divulgado nesta quinta-feira, até 500 milhões de pessoas poderiam ser empurradas para a pobreza por causa da pandemia do coronavírus.\nOs pesquisadores usaram dados do Banco Mundial para medir os efeitos da redução dos gastos nas economias do mundo em três níveis de pobreza - U$ 1,90 (R$ 9,75), U$ 3,20 (R$ 16,40) e U$ 5,50 (R$ 28,18) por dia.\nDe acordo com o estudo, devido à crise, o nível de pobreza em países em desenvolvimento poderia voltar a um patamar de 30 anos atrás.\nConsiderando o patamar de pobreza de U$ 5,50 (R$ 28,18) por dia, cerca de 40% dos novos pobres estariam concentrados no leste da Ásia e no Pacífico, com cerca de um terço na África Subsaariana e no sul da Ásia. A América Latina responderia por 10% desse aumento global.\nO impacto do novo coronavírus poderia representar, assim, um grande desafio para se atingir o fim da pobreza em 2030, um dos 17 Objetivos de Desenvolvimento Sustentável da ONU.\nCom reportagem de Fernanda Paúl, da BBC News Mundo\n\n- Fonte: https://www.bbc.com/portuguese/internacional-52232601",
			"added": 1586635789
		},
		{
			"topic_id": 5,
			"title": "Coronavírus: como o mundo desperdiçou a chance de produzir vacina para conter a pandemia",
			"body": "#Em 2002, na Província chinesa de Guangzhou, um vírus desconhecido causou o surto de uma doença potencialmente letal. Os cientistas chamaram de Sars (sigla em inglês para síndrome respiratória aguda grave).\nMais tarde, descobriu-se que o patógeno causador da doença é um coronavírus que se originou em um animal e se espalhou entre os seres humanos.\nEm alguns meses, aquele vírus se espalhou por 29 países, infectando mais de 8.000 pessoas e matando cerca de 800.\nEm todo o mundo, havia uma demanda geral para saber quando uma vacina para combater o vírus estaria pronta. Dezenas de cientistas na Ásia, Estados Unidos e Europa começaram a trabalhar freneticamente para criá-la.\nVários protótipos surgiram, alguns dos quais estavam prontos para serem usados em testes clínicos.\nMas a epidemia de Sars foi controlada e o estudo das vacinas contra o coronavírus foi abandonado.\nAnos depois, em 2012, outro coronavírus perigoso, o Mers-Cov, ressurgiu, causando uma doença respiratória grave, a Mers (síndrome respiratória do Oriente Médio), que se originou em camelos e se espalhou para os seres humanos.\nNa época, muitos cientistas reiteraram a necessidade de uma vacina contra esses patógenos.\nHoje, quase 20 anos depois da Sars, quando um novo coronavírus, o Sars-Cov-2, já infectou quase 1,5 milhão de pessoas, o mundo está mais uma vez se perguntando quando uma vacina estará pronta.\nEntão, por que não aprendemos com os coronavírus anteriores a ponto de estarmos mais preparados hoje para a covid-19? E por que as vacinas não foram mais estudadas?\n\n#'Não estamos interessados'\nUma equipe de cientistas na cidade de Houston, nos Estados Unidos, continuou pesquisando e, em 2016, tinha uma vacina pronta contra um coronavírus.\n\"Terminamos os testes e passamos pelo aspecto crítico da criação de um processo de produção em escala piloto para a vacina\", diz Maria Elena Bottazzi, codiretora da Escola Nacional de Medicina Tropical da Faculdade de Medicina Baylor e do Centro de Desenvolvimento de Vacinas do Hospital Infantil do Texas.\n\"Então, fomos ao NIH (Institutos Nacionais de Saúde dos EUA) e perguntamos: 'O que fazemos para transferir rapidamente a vacina para a clínica?' E eles nos disseram: 'Olha, agora não estamos mais interessados'.\"\nA vacina atuava contra o coronavírus que causou a epidemia de Sars em 2002, mas, desde que a epidemia foi controlada, os pesquisadores nunca mais conseguiram financiamento.\nMas essa não foi a única vacina suspensa por falta de dinheiro. Dezenas de cientistas em todo o mundo interromperam seus estudos devido à falta de interesse e fundos para continuar pesquisando.\n\nSegundo Susan Weiss, professora de microbiologia da Universidade da Pensilvânia, quando a epidemia de Sars terminou, depois de oito meses, pessoas, governos e empresas farmacêuticas \"imediatamente perderam o interesse no estudo dos coronavírus. \"\n\"Mas, além disso, a Sars afetou principalmente a Ásia, com alguns casos em Toronto (Canadá), mas não chegou à Europa como esse novo coronavírus\", disse Weiss à BBC News Mundo, serviço em espanhol da BBC\n\"Então, surgiu o Mers, o segundo coronavírus humano virulento, mas ele ficou quase inteiramente confinado ao Oriente Médio\", afirmou.\n\"Aí os coronavírus e o interesse por eles se dissiparam. Até agora. E realmente acho que deveríamos estar mais bem preparados\", afirma a pesquisadora.\n\n#Duas advertências\nSegundo especialistas, a Sars e a Mers foram dois \"avisos importantes\" sobre os perigos dos coronavírus, mas, ainda assim, não houve incentivos para que as pesquisas sobre eles continuassem.\nEmbora a vacina criada pela equipe de Maria Elena Bottazzi fosse para um coronavírus diferente do atual, os especialistas concordam que, se a vacina estivesse pronta, haveria um progresso muito mais rápido no desenvolvimento de outra.\nJason Schwartz, professor da Escola de Saúde Pública da Universidade Yale, diz que a preparação para esta pandemia deveria ter começado logo após o surto de Sars em 2002.\n\"Se não tivéssemos abandonado o programa de pesquisa de vacinas para Sars, teríamos muito mais bases prontas para trabalhar neste novo vírus intimamente relacionado (ao anterior)\", disse ele à revista americana The Atlantic.\nDe fato, o novo coronavírus, chamado Sars-Cov-2, é um \"primo próximo\" do vírus que causou a Sars em 2002.\n\n\"Eles são, geneticamente, 80% semelhantes\", diz Bottazzi. Como a vacina já passou pelos processos necessários para aprovação, ela poderia ter se adaptado mais rapidamente ao novo coronavírus, segundo a pesquisadora.\n\"Nós já teríamos um exemplo de como esses tipos de vacinas se comportam e, embora os vírus não sejam exatamente os mesmos, eles vêm da mesma classe\", explicou.\n\"Já teríamos a experiência de ver onde surgem problemas com a vacina e como resolvê-los. Porque já vimos como a vacina para Sars se comportou pré-clinicamente e esperamos que a nova vacina se comporte relativamente da mesma forma.\"\n\"Poderíamos ter informação sobre a segurança (da vacina) em humanos\", acrescenta Bottazzi. \"E teríamos mais confiança de que essas vacinas podem ser usadas em populações que precisam delas.\"\n\n#'Terrível proposta'\nSe todo esse conhecimento estava disponível, por que a pesquisa da vacina contra o coronavírus foi interrompida?\nSegundo especialistas, tudo se resume ao dinheiro.\n\"Não estávamos pedindo US$ 100 milhões ou US$ 1 bilhão\", diz Bottazzi.\n\"Estávamos falando em três ou quatro milhões de dólares. Com um milhão e meio, poderíamos ter feito um estudo clínico. Mas o financiamento foi encerrado no momento em que tínhamos evidências interessantes\", afirma Bottazzi.\n\nO financiamento acabou porque não havia mercado para a vacina, como explica Peter Kolchinsky, virologista e diretor da empresa de biotecnologia RA Capital.\n\"A realidade é que, quando existe um mercado, existe uma solução\", diz ele. \"Hoje temos centenas de vacinas para os coronavírus, mas são todas para animais: porcos, galinhas, vacas etc.\"\nElas são vacinas para prevenir doenças que podem custar milhões de dólares à indústria avícola e pecuária.\nSegundo ele, pensava-se que os surtos de coronavírus em humanos poderiam ser controlados mais facilmente.\n\"O problema é que, para qualquer empresa, é uma péssima proposta comercial desenvolver um produto que, de acordo com as probabilidades, não será usado em décadas ou talvez nunca.\"\n\"Esse é o tipo de coisa em que os governos devem investir. Se isso fosse uma prioridade, não tenho dúvida de que as agências governamentais teriam financiado o desenvolvimento contínuo de uma vacina para a Sars \", diz Kolchinsky.\n\"E talvez estaríamos mais bem preparados para reagir à covid-19\", acrescenta ele.\n\n#Nova vacina\nA realidade agora é que o mundo precisa de uma vacina contra o novo coronavírus que causa a covid-19.\nE, provavelmente, ela não estará pronta nos próximos meses — talvez isso só ocorra daqui a 12 ou 18 meses.\nAté lá, é possível que a atual pandemia já esteja sob controle.\n\nBottazzi e sua equipe estão trabalhando na atualização da vacina Sars de 2016 e em uma nova para a covid-19.\nEla e seus colegas continuam tentando encontrar financiamento para suas pesquisas.\n\"Alguns doadores nos deram dinheiro para recriar a vacina de 2016 rapidamente. E os Institutos Nacionais de Saúde (dos EUA) nos deram uma pequena doação de US$ 400 mil para iniciar o desenvolvimento da nova vacina contra covid-19. Mas temos que continuar convencendo os doadores a fornecer dinheiro para acelerar o processo\", explica Bottazzi.\nTodo o processo, diz a pesquisadora, é \"muito frustrante\".\n\"Nós, nos laboratórios, queremos desenvolver essas vacinas, mas não há apoio financeiro ou apoio de entidades governamentais que financiam pesquisas\", lamenta Bottazzi.\n\"Isso ocorre porque não temos programas sustentáveis (de fomento à pesquisa), e as prioridades mudam de acordo com o que está acontecendo no momento\".\n\n\n- Fonte: https://www.bbc.co.uk/portuguese/internacional-52238530",
			"added": 1586636101
		},
		{
			"topic_id": 6,
			"title": "Como construir o pós-capitalismo?",
			"body": "- https://web.archive.org/web/20200411202925/https://outraspalavras.net/sem-categoria/teoria-como-construir-o-pos-capitalismo/\n\nPara superar o sistema, não basta protestar. Outras Palavras destacou o pensamento de teóricos que buscam caminhos para transformação social",
			"added": 1586637020
		},
		{
			"topic_id": 7,
			"title": "Para compreender o neoliberalismo além dos clichês",
			"body": "#Que é a ideologia hegemônica no Ocidente. Como surgiu, foi adotada pelas elites e tornou-se difusa e invisível. Quais seus paradoxos\n\nImagine se a população da União Soviética nunca tivesse ouvido falar de comunismo. A ideologia que domina nossas vidas não tem nome, para a maioria das pessoas. Mencione-o numa conversa e você verá que seu interlocutor dá de ombros. Mesmo que tenha ouvido o termo antes, encontrará dificuldade para defini-lo. Neoliberalismo: você sabe o que é isso?\n\nO anonimato é tanto sintoma quanto causa de seu poder. Desempenhou um papel importante numa notável sequência de crises: o derretimento financeiro de 2007-8; o ocultamento de riqueza e poder de que os Panama Papers nos oferecem apenas um vislumbre; a lenta derrocada da saúde e da educação públicas; o ressurgimento da pobreza infantil; a epidemia de solidão; o colapso dos ecossistemas; a ascensão de Donald Trump. Mas respondemos a essas crises como se elas emergissem isoladas, aparentemente inconscientes de que foram todas ou catalisadas ou exacerbadas pela mesma filosofia coerente; uma filosofia que tem – ou tinha – um nome. Pode haver maior poder do que operar anonimamente?\n\nO neoliberalismo tornou-se tão penetrante que raramente o reconhecemos sequer como ideologia. Parecemos aceitar a proposição de que essa fé utópica e milenar descreve uma força neutra; uma espécie de lei biológica, como a teoria da evolução de Darwin. Mas essa filosofia surgiu como a tentativa consciente de remodelar a vida humana e mudar o locus do poder.\n\nO neoliberalismo vê a competição como característica definidora das relações humanas. Ela redefine os cidadãos como consumidores, cujas escolhas democráticas são melhor exercidas ao comprar e vender – um processo que supostamente recompensa o mérito e pune a ineficiência. Sustenta que o “mercado” assegura benefícios que jamais poderiam ser conseguidos pelo planejamento.\n\nTentativas de limitar a competição são tratadas como hostis à liberdade. A ideologia afirma que impostos e regulação deveriam ser reduzidos; serviços públicos, privatizados. A organização do trabalho e a negociação coletiva pelos sindicatos são retratadas como distorções do mercado, que impedem a formação de uma hierarquia natural entre vencedores e perdedores. A desigualdade é requalificada como virtuosa: um prêmio para a utilidade, ela é geradora de uma riqueza que se espalha de cima para baixo, enriquecendo todo mundo. Os esforços para criar uma sociedade mais igualitária seriam ao mesmo tempo contraproducentes e moralmente corrosivos. O mercado asseguraria que todo mundo recebe o que merece.\n\nInternalizamos e reproduzimos estas crenças. Os ricos se convencem de que adquiriram sua riqueza por mérito, ignorando as vantagens – tais como educação, herança e classe social – que podem ter ajudado a lhes garantir isso. Os pobres começam a se culpar por seus fracassos, mesmo quanto pouco podem fazer para mudar as circunstâncias de suas vidas.\n\nEsqueça o desemprego estrutural: se você não tem trabalho é porque não é empreendedor. Esqueça os custos impossíveis da moradia: se seu cartão de crédito está no limite, você é imprudente e imprevidente. Esqueça que seus filhos não têm mais uma quadra de esportes na escola: se ficam gordos, é falha sua. Num mundo governado pela competição, aqueles que ficam para trás passam a ser definidos e a se auto-definir como fracassados.\n\nEntre os resultados, como documenta Paul Verhaeghe no livro What About Me?, estão epidemia de automutilação, distúrbios alimentares, depressão, solidão, ansiedade por desempenho e fobia social. Não surpreende que o Reino Unido, onde a ideologia neoliberal vem sendo aplicada com maior rigor, seja a capital da solidão na Europa.\n\n#Agora somos todos neoliberais\n\nO termo neoliberalismo foi cunhado numa reunião de 1938, em Paris. Entre os participantes, havia dois homens que definiriam a ideologia, Ludwig von Mises e Friedrich Hayek. Ambos exilados da Áustria, eles consideraram a social democracia, caracterizada pelo New Deal de Franklin Roosevelt e o desenvolvimento gradual do Estado de bem-estar social da Grã Bretanha, como manifestações de um coletivismo que ocupava o mesmo espectro do nazismo e do comunismo.\n\nEm The Road to Serfdom (O Caminho da Servidão), publicado em 1944, Hayek argumentava que o planejamento governamental, ao esmagar o individualismo, levaria inexoravelmente ao controle totalitário. Como o livro Bureaucracy, de Mises, The Road to Serfdom foi amplamente lido. Chamou a atenção de algumas pessoas muito ricas, que viram na filosofia a oportunidade para libertar-se de impostos e regulação. Quando, em 1947, Hayek fundou a primeira organização que iria espalhar a doutrina do neoliberalismo – a Sociedade Monte Pelèrin –, ela foi sustentada financeiramente por milionários e suas fundações.\n\nCom tal apoio, ele começou a criar o que Daniel Stedman Jones descreve, em Masters of the Universe, como “uma espécie de Internacional Neoliberal”: uma rede global de acadêmicos, homens de negócios, jornalistas e ativistas. Apoiadores ricos do movimento fundaram uma série de thinktanks que iriam refinar e promover a ideologia. Entre elas estão o American Enterprise Institute, a Heritage Foundation, o Cato Institute, o Institute of Economic Affairs, o Centre for Policy Studies e o Adam Smith Institute. Também financiaram departamentos acadêmicos, particularmente nas universidades de Chicago e Virginia.\n\nConforme evoluiu, o neoliberalismo tornou-se mais estridente. A visão de Hayek de que os governos deveriam regular a competição para prevenir a formação de monopólios deu lugar – entre apóstolos norte-americanos tais como Milton Friedman – à crença de que o poder monopolista poderia ser visto como uma recompensa à eficiência.\n\nUma outra coisa aconteceu durante essa transição: o movimento perdeu o seu nome. Em 1951, Friedman se satisfazia com a descrição de si mesmo como neoliberal. Mas, logo depois disso, o termo começou a desaparecer. Ainda desconhecido, mesmo à medida em que a ideologia tornava-se mais nítida e o movimento mais coerente, o nome perdido não foi substituído por nenhuma alternativa.\n\nNo início, apesar de seu generoso financiamento, o neoliberalismo manteve-se nas margens. O consenso pós-guerra era quase universal: as prescrições econômicas de John Maynard Keynes foram amplamente aplicadas. Pleno emprego e combate à fome eram metas comuns nos EUA e na maior parte da Europa Ocidental. As aliquotas máximas do imposto eram altas e os governos buscavam resultados sociais elevados sem constrangimento, desenvolvendo novos serviços públicos e redes de segurança.\n\nNos anos 1970, contudo, quando as políticas keynesianas começaram a desmoronar e as crises econômicas atingiram EUA e Europa, as ideias neoliberais começaram a entrar no mainstream. Como Friedman ressaltou, “quando chega a hora, é preciso mudar … havia ali uma alternativa pronta para ser agarrada”. Com a ajuda de jornalistas simpáticos à ideia e conselheiros políticos, alguns elementos do neoliberalismo, principalmente suas prescrições de política monetária, foram adotadas pelos governos de Jimmy Carter, nos EUA, e Jim Callaghan, na Grã Bretanha.\n\nDepois que Margaret Thatcher e Ronald Reagan assumiram o poder, o resto do pacote veio a galope: cortes maciços nos impostos dos ricos, esmagamento dos sindicatos, desregulação, privatização, terceirização e competição nos serviços públicos. Por meio do FMI, do Banco Mundial, do Tratado de Maastricht e da Organização Mundial de Comércio, as políticas neoliberais foram impostas – frequentemente sem consenso democrático – em grande parte do mundo. O mais notável é que foram adotadas por partidos que no passado pertenceram à esquerda: Trabalhista, na Inglaterra, e Democrata, nos Estados Unidos, por exemplo. Como observa Stedman Jones, “é difícil pensar em outra utopia que tenha sido realizada tão completamente.”\n\nPode parecer estranho que uma doutrina que promete escolhas e liberdade possa ter sido promovida sob o slogan “não há alternativa”. Mas, como observou Hayek em uma visita ao Chile de Pinochet – uma das primeiras nações em que o programa foi exaustivamente aplicado – “minha preferência pessoal inclina-se na direção de uma ditadura liberal, ao invés de um governo democrático que não pratique o liberalismo”. A liberdade que o neoliberalismo oferece, que soa tão fascinante quando expressa em termos gerais, acaba por significar a liberdade para a elite, não para os peixes pequenos.\n\nLiberdade em relação aos sindicatos e à negociação coletiva significa liberdade para reprimir salários. Liberdade em relação da regulamentação significa liberdade de envenenar rios, colocar em risco os trabalhadores, cobrar taxas iníquas de juros e criar instrumentos financeiros exóticos. Ficar livre de impostos significa ficar livre da distribuição de riqueza que tira as pessoas da pobreza.\n\nComo Naomi Klein documenta em The Shock Doctrine (A Doutrina do Choque), teóricos neoliberais advogam o uso de crises para impor políticas impopulares enquanto as pessoas estavam distraídas: por exemplo, a consequência do golpe de Pinochet, da guerra do Iraque e do Furacão Katrina, que Frieman descreveu como “uma oportunidade para reformar radicalmente o sistema educacional” em New Orleans.\n\nOnde as políticas neoliberais não podem ser impostas domesticamente, elas são impostas internacionalmente, através de tratados comerciais que incorporam os “painéis de disputa estado-investidor”: tribunais globais em que as corporações podem pressionar pela revogação de leis e normas que protegem direitos sociais e ambientais. Quando parlamentares votaram para restringir as vendas de cigarro, proteger reservatórios de água das companhias de mineração, congelar contas de energia ou prevenir empresas farmacêuticas de esfolar o Estado, as empresas entraram com processos, muitas vezes bem sucedidos. A democracia reduz-se a um teatro.\n\nOutro paradoxo do neoliberalismo é que a competição universal apoia-se em comparação e quantificação universal. O resultado é que trabalhadores, desempregados e serviços públicos em geral ficam sujeitos a um sistema de avaliação e monitoramento sufocante e enganador, desenhado para identificar vencedores e punir perdedores. Ao invés de nos libertar do pesadelo burocrático do planejamento central, como propôs Von Mises, ele criou um.\n\nO neoliberalismo não foi concebido como um projeto egoísta, mas rapidamente transformou-se nisso. O crescimento econômico tornou-se visivelmente mais lento na era neoliberal (desde 1980 na Grã Bretanha e nos EUA) do que era nas décadas precedentes; mas não para os ultra ricos. A desigualdade na distribuição de renda e riqueza, depois de 60 anos de queda, aumentou rapidamente na nova era, devido à destruição dos sindicatos, à redução dos impostos, ao aumento dos aluguéis, à privatização e à desregulação.\n\nA privatização ou mercantilização de serviços públicos tais como energia, água, ferrovias, saúde, educação, estradas e prisões habilitou as grandes empresas a colocar uma cabina de pedágio diante de bens essenciais e cobrar rendas, seja dos cidadãos ou do governo, para seu próprio benefício. Renda é um eufemismo para dinheiro ganho sem esforço. Quando você paga um preço inflacionado pelo bilhete de metrô, somente parte da tarifa compensa os operadores por seus custos de combustível, salários e outros gastos. O resto reflete o fato de que você está nas mãos deles.\n\nAs pessoas que possuem e administram os serviços privatizados ou semi privatizados do Reino Unido fazem fortunas tremendas investindo pouco e cobrando muito. Na Rússia e na Índia, os oligarcas adquiriram bens estatais através de leilões. No México, Carlos Slim teve garantido o controle de quase todos os serviços de telefonia fixa e móvel e logo tornou-se o homem mais rico do mundo.\n\nA financeirização, como nota Andrew Sayer em Why We Can’t Afford the Rich, teve impacto semelhante. “Como a renda”, diz ele, “os juros são receita acumulada sem qualquer esforço”. À medida em que os pobres tornam-se mais pobres e os ricos mais ricos, o rico adquire controle crescente sobre outro bem crucial: dinheiro. Pagamentos de juros são, de modo devastador, transferência de dinheiro do pobre para o rico. Os preços dos imóveis e a redução de investimentos estatais sobrecarregam as pessoas com dívidas; mas os bancos e os executivos nadam de braçadas.\n\nSayer argumenta que as últimas quatro décadas caracterizaram-se por uma transferência de riqueza não apenas do pobre para o rico, mas no interior das categorias de riqueza: daqueles que ganham dinheiro produzindo novos bens ou serviços para aqueles que ganham dinheiro assumindo o controle de ativos já existentes e recolhendo rendas, juros ou ganhos de capital. O ganho produtivo foi superado pelo ganho improdutivo.\n\nAs políticas neoliberais estão assoladas por falhas do mercado em todos os lugares. Não apenas os bancos, mas também as corporações encarregadas de entregar os serviços públicos são grandes demais para falir. Como Tony Judt apontou em Ill Fares the Land, Hayek esqueceu-se de que os serviços públicos vitais não podem entrar em colapso, o que significa que a competição não pode determinar seu curso. As empresas levam os lucros, o Estado fica com o risco.\n\nQuanto maior seu fracasso, mais extremada se torna a ideologia. Os governos usam as crises neoliberais tanto como desculpa quanto como oportunidade para baixar impostos, privatizar os serviços públicos restantes, abrir brechas na rede de proteção social, desregular as corporações e re-regular os cidadãos. O Estado que se odeia afunda os dentes em cada órgão do setor público.\n\nTalvez o impacto mais perigoso do neoliberalismo não seja a crise econômica, mas a crise política que causou. Conforme se reduz o domínio do Estado, reduz-se também a possibilidade de mudar o curso de nossas vidas por meio do voto. Ao contrário, assegura a teoria neoliberal, as pessoas podem exercer a escolha pelo consumo. Mas alguns têm mais do que outros para gastar: na grande democracia do consumidor ou do acionista, os votos não são igualmente distribuídos. O resultado é um desempoderamento dos pobres e das classes médiass. Conforme os partidos de direita e a ex-esquerda adotam políticas neoliberais semelhantes, o desempoderamento transforma-se em privação dos direitos civis. Um grande número de pessoas foi varrido da política.\n\nChris Hedges observa que “movimentos fascistas constroem suas bases não entre as pessoas politicamente ativas, mas entre as politicamente inativas, os ‘perdedores’ que sentem, frequentemente de modo correto, que não têm voz ou papel a desempenhar no establishment politico”. Quando o debate político não faz mais sentido para nós, as pessoas tornam-se suscetíveis a slogans, símbolos e sensações. Para os admiradores de Trump, por exemplo, fatos e argumentos parecem irrelevantes.\n\nTony Judt explicou que quando a espessa rede de interações entre as pessoas e o Estado é reduzida a nada, a não ser autoridade e obediência, a única força remanescente a nos unir é o poder estatal. O totalitarismo temido por Hayek tem mais probabilidade de emergir quando os governos, tendo perdido a autoridade moral que emana da garantia de serviços públicos, são reduzidos a “persuadir, ameaçar e em última análise coagir as pessoas a obedecê-los.”\n\nComo o comunismo, o neoliberalismo é o Deus que falhou. Mas esta doutrina zumbi continua sua escalada, e uma das razões para isso é o anonimato. Ou antes, um conjunto de anonimatos.\n\nA doutrina invisível da mão invisível é promovida por investidores invisíveis. Devagar, muito devagar, começamos a descobrir o nome de alguns deles. Descobrimos que o Institute of Economic Affairs , que argumentou fortemente na mídia contra a regulação da indústria do tabaco, foi secretamente fundado, em 1963, pela British American Tobacco. Descobrimos que Charles e David Koch, dois dos homens mais ricos do mundo, fundaram o instituto que criou o movimento Tea Party. Descobrimos que Charles Koch, ao instalar um de seus thinktanks, observou que “para evitar críticas indesejáveis, o modo como a organização é controlada e dirigida não deveria ser amplamente divulgada”.\n\nAs palavras usadas pelo neoliberalismo com frequência mais ocultam do que elucidam. “O mercado” soa como um sistema natural que pode nos pressionar por igual, como fazem a pressão atmosférica ou da gravidade. Mas está carregado de relações de poder. O que “o mercado quer” tende a significar o que as corporações e seus patrões querem. “Investimento”, como nota Sayer, significa duas coisas bem diferentes. Uma é o financiamento de atividades produtivas e socialmente úteis; a outra é a compra de bens existentes para deles extrair rendas, juros, dividendos e ganhos de capital. Ao usar a mesma palavra para atividades diferentes, “camuflam-se as fontes de riqueza”, levando-nos a confundir extração de riqueza com criação de riqueza.\n\nHá um século, os novos ricos eram desprezados por aqueles que tinham herdado seu dinheiro. Empreendedores buscavam aceitação social transformando-se em rentistas. Hoje, a relação foi invertida: os rentistas e herdeiros definem-se como empresários. Eles afirmam ter construído aq riqueza pela qual não trabalharam.\n\nEsse anonimato e essas confusões se misturam com o fato de o capitalismo moderno não ter nem nome nem lugar. O modelo de terceirizações assegura que os trabalhadores não saibam para quem trabalham. As companhias são registradas através de um sistema secreto de rede de offshores, tão complexo que nem mesmo a polícia pode descobrir seus proprietários e beneficiados. Os arranjos fiscais logram os governos. Ninguém entende os “produtos financeiros”.\n\nO anonimato do neoliberalismo é ferozmente salvaguardado. Aqueles que são influenciados por Hayek, Mises e Friedman tendem a rejeitar o termo, sustentando – com alguma justiça – que ele é hoje usado apenas pejorativamente. Mas não nos oferecem substitutos. Alguns descrevem-se como liberais ou ulta-liberais (libertarians) clássicos, mas essas descrições são ambas enganosas e curiosamente autodissipadoras, uma vez que sugerem não haver nada de novo em O Caminho da Servidão (The Road to Serfdom), Bureocracy ou o clássico trabalho de Friedman, Capitalismo e Liberdade (Capitalism and Freedom).\n\nPor tudo isso, há algo admirável sobre o projeto neoliberal, ao menos em seus estágios iniciais. Era uma filosofia distinta e inovadora, promovida por uma rede coerente de pensadores e ativistas com um claro plano de ação. Era paciente e persistente. O Caminho da Servidão (The Road to Serfdom) tornou-se o caminho para o poder.\n\nO triunfo do neoliberalismo reflete também o fracasso da esquerda. Quando a teoria do laissez-faire econômico levou à catástrofe em 1929, Keynes inventou uma extensa teoria econômica para substituí-la. Quando o gerenciamento da demanda keynesiana bateu no teto, nos anos 70, havia, pronta, uma alternativa conservadora. Mas quando o neoliberalismo desmoronou, em 2008, não havia nada. É por isso que o zumbi anda. Em 80 anos, a esquerda e o centro não produziram um novo sistema geral de pensamento econômico.\n\nToda invocação de Lord Keynes é uma admissão de fracasso. Propor soluções keynesianas às crises do século 21 é ignorar três problemas óbvios. É difícil mobilizar as pessoas em torno de velhas ideias; as falhas expostas nos anos 1970 não desapareceram; e, mais importante, o projeto não tem nada a dizer sobre nosso problema mais grave: a crise ambiental. O keynesianismo funciona pelo estímulo da demanda de consumo para promover crescimento econômico. Demanda de consumo e crescimento econômico são os motores da destruição ambiental.\n\n- Fonte: https://web.archive.org/web/20190930145311/https://outraspalavras.net/desigualdades-mundo/para-compreender-o-neoliberalismo-alem-dos-cliches/",
			"added": 1586637880
		}
	],
	"topic_vote": {
		"2_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"1_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"4_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"5_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"6_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"7_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1
	},
	"next_comment_id": 19,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#A uberização sem volta e a pedagogia do socialismo\n- https://web.archive.org/web/20200407234755/https://outraspalavras.net/tecnologiaemdisputa/a-uberizacao-sem-volta-e-a-pedagogia-do-socialismo/\n\nÉ inútil esperar que um rompante ético afaste o capitalismo do ataque aos direitos sociais. História demonstra: só ameaçadas as corporações e os bilionários recuam. É preciso fazê-los temer por seus dedos, para que entreguem anéis",
				"added": 1586618392
			},
			{
				"comment_id": 2,
				"body": "#Contra captura neoliberal, a Revolução dos Comuns\n- https://web.archive.org/web/20200408102817/https://outraspalavras.net/outrasmidias/contra-captura-neoliberal-a-revolucao-dos-comuns/\n\nCorporações transformam pessoas em empresas e apropriam-se da própria rebeldia. Enfrentar tal lógica requer “nova economia psíquica”, que desafie individualismo e transforme radicalmente conceitos de propriedade e preservação",
				"added": 1586618918
			},
			{
				"comment_id": 3,
				"body": "#Luta de classes na era do Uber\n- https://web.archive.org/web/20200411153015/https://outraspalavras.net/trabalhoeprecariado/luta-de-classes-na-era-do-uber/\n\nDistintos entre si, fordismo e toyotismo tinham algo em comum: a oferta, aos trabalhadores, de compensações parciais. O novo arranjo “produtivo” é retrocesso puro",
				"added": 1586619062
			},
			{
				"comment_id": 4,
				"body": "> [vianceas](#comment_3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9): Luta de classes na era do Uber\n> \n> https://web.archive.org/web/20200411153015/https://outraspalavras.net/trabalhoeprecariado/luta-de-classes-na-era-do-uber/\n> \n> Distintos entre si, fordismo e toyotismo tinham algo em comum: a oferta, aos trabalhadores, de compensações parciais. O novo arranjo “produtivo” é retrocesso puro\n\n#Resistir à uberização do mundo\n- https://web.archive.org/web/20200411153239/http://diplomatique.org.br/resistir-a-uberizacao-do-mundo/\n\nAo transformar donos de veículos em choferes eventuais sem nenhuma proteção, o Uber não desperta apenas a fúria de taxistas: seu nome simboliza cada vez mais a ligação entre novas tecnologias e precarização. O sucesso de gigantes do Vale do Silício acompanha uma onda de desregulamentações",
				"added": 1586619242
			},
			{
				"comment_id": 7,
				"body": "#Da teoria econômica do socialismo – Parte I\n- https://web.archive.org/web/20200411154505/https://eleuterioprado.files.wordpress.com/2019/08/da-teoria-econc3b4mica-do-socialismo-parte-i.pdf (SHA-256: c34564b81002138fb86e9c41d1f33a0b95759009283f16c561b5c04cc1d7be1e)\n\n#Da teoria econômica do socialismo – Parte II\n- https://web.archive.org/web/20200411154732/https://eleuterioprado.files.wordpress.com/2019/08/da-teoria-econc3b4mica-do-socialismo-parte-ii.pdf (SHA-256: 9635081ba1eb00971e876dcbe4dde1d938fb0616ab9caa21f9eed4a040c6437f)\n\n#Da teoria econômica do socialismo – III\n- https://web.archive.org/web/20200411155004/https://eleuterioprado.files.wordpress.com/2019/08/da-teoria-econc3b4mica-do-socialismo-parte-iii.pdf (SHA-256: a5b8cdfaaafe7c5671fba59b371d3a2da34c142464c28e5e31547eb5b178f8e6)",
				"added": 1586620258
			},
			{
				"comment_id": 8,
				"body": "#Mises – O socialismo como impossibilidade prática\n- https://web.archive.org/web/20200411155243/https://eleuterioprado.files.wordpress.com/2019/07/mises-o-socialismo-como-impossibilidade-prc3a1tica.pdf (SHA-256: 72f91f2ac787ff43e7d93a35680775ec2807a97dfbcaba3397d3da4bc462ddb5)\n\n#Hayek – A competição e a rivalidade contra o socialismo\n- https://web.archive.org/web/20200411155453/https://eleuterioprado.files.wordpress.com/2019/07/hayek-a-competic3a7c3a3o-e-a-rivalidade-contra-o-socialismo.pdf (SHA-256: ea59d0d13ca154ddd31de6326315fa8cf1c7feb88a2da59bbfbb6adebcbc54fc)\n\n#Morozov – o Big Data e o planejamento democrático\n- https://web.archive.org/web/20200411155630/https://eleuterioprado.files.wordpress.com/2019/09/morozov-o-big-data-e-o-planejamento-democrc3a1tico.pdf (SHA-256: 2448525ba435609872c9389f97c5f44a581a6896a70fd3d31fd6afc5ac24631a)",
				"added": 1586620640
			},
			{
				"comment_id": 9,
				"body": "#Ecossocialismo e planejamento democrático\n- https://web.archive.org/web/20200411160329/https://eleuterioprado.files.wordpress.com/2019/07/ecossocialismo-e-planejamento-democrc3a1tico.pdf (SHA-256: 274c5c188b5ee47e0ae5a873ce604fb4204c03259f1ea0a605d434e50e7b87cb)",
				"added": 1586621061
			},
			{
				"comment_id": 10,
				"body": "#Homs – Breve história do mercado e do Estado\n- https://web.archive.org/web/20200411160618/https://eleuterioprado.files.wordpress.com/2020/03/homs-breve-histc3b3ria-do-mercado-e-do-estado.pdf (SHA-256: d3e61ed3df984df2167490ef49340ce0e86aa9873d620f377d69200cb1fbe511)",
				"added": 1586621232
			},
			{
				"comment_id": 11,
				"body": "#Hudis – Trabalho social direto e indireto\n- https://web.archive.org/web/20200411160820/https://eleuterioprado.files.wordpress.com/2013/03/hudis-trabalho-social-direto-e-indireto.pdf (SHA-256: ebaade809d22e614f0fdfbc6fa5322517b689e85d67c0b354f452cbb626f2968)",
				"added": 1586621468
			},
			{
				"comment_id": 12,
				"body": "#Planificação na idade do algoritmo – Parte I\n- https://web.archive.org/web/20200411161232/https://eleuterioprado.files.wordpress.com/2019/06/planificac3a7c3a3o-na-idade-do-algoritmo-parte-i.pdf (SHA-256: 29648bcce1d75d06a8277411a5ce217e0e8e3ba60fcf41814521cb514d8c3ad5)\n\n#Planificação na idade do algoritmo – Parte II\n- https://web.archive.org/web/20200411161416/https://eleuterioprado.files.wordpress.com/2019/06/planificac3a7c3a3o-na-idade-do-algoritmo-parte-ii.pdf (SHA-256: b1ef15aeb94ee295bb2e90a97c01c06c3f029d0919c02a9c3bf69f197c15fbee)\n\n#Panificação na idade do algoritmo – Parte III\n- https://web.archive.org/web/20200411161548/https://eleuterioprado.files.wordpress.com/2019/06/panificac3a7c3a3o-na-idade-do-algoritmo-parte-iii.pdf (SHA-256: 0f02e9989d133a42e53ac12d7550e5213b39abc0d6514213faf943a4a9a241f0)",
				"added": 1586621793
			},
			{
				"comment_id": 13,
				"body": "#Planejamento na Era da Intermet – Parte I\n- https://web.archive.org/web/20200411161759/https://eleuterioprado.files.wordpress.com/2020/02/planejamento-na-era-da-intermet-parte-i.pdf (SHA-256: fe68df6f783a54435473cfbbd940048e24eeaf142ac184eca06f750ed956a3eb)\n\n#Planejamento na Era da Intermet – Parte II\n- https://web.archive.org/web/20200411161950/https://eleuterioprado.files.wordpress.com/2020/02/planejamento-na-era-da-intermet-parte-ii.pdf (SHA-256: 78e69e130650f5a66e988a45069c4f2aedf0d02ea6639835318acaa6a3e5abf4)",
				"added": 1586622037
			},
			{
				"comment_id": 17,
				"body": "#Para uma história do anticomunismo no Brasil\n- https://web.archive.org/web/20200411210423/https://outraspalavras.net/sem-categoria/para-uma-historia-do-anticomunismo-no-brasil/\n\n“Fake News”. Falso moralismo. Busca da “democracia” por meio de golpes. Como as táticas atuais da propaganda de direita requentam as dos anos 1960",
				"added": 1586639090
			},
			{
				"comment_id": 18,
				"body": "#As ideias perigosas que eles temem\n- https://web.archive.org/web/20200316222945/https://outraspalavras.net/movimentoserebeldias/as-ideias-perigosas-que-eles-temem/\n\nCombate ao marxismo não é delírio, mas medo real de insurgência popular contra tirania. Capitalismo gerou seus coveiros — e, por isso, comunismo é perigoso. História ensina que mesmo fracassos podem ser combustível para novas revoluções",
				"added": 1586639269
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 5,
				"body": "Assim diz o Senhor: \"Não se glorie o sábio em sua sabedoria nem o forte em sua força nem o rico em sua riqueza,\n\nmas quem se gloriar, glorie-se nisto: em compreender-me e conhecer-me, pois eu sou o Senhor, e ajo com lealdade, com justiça e com retidão sobre a terra, pois é dessas coisas que me agrado\", declara o Senhor.\n\n- Jeremias 9:23,24",
				"added": 1586619518
			},
			{
				"comment_id": 6,
				"body": "7 Apressa-te em responder-me, Senhor! O meu espírito se abate. Não escondas de mim o teu rosto, ou serei como os que descem à cova.\n\n8 Faze-me ouvir do teu amor leal pela manhã, pois em ti confio. Mostra-me o caminho que devo seguir, pois a ti elevo a minha alma.\n\n9 Livra-me dos meus inimigos, Senhor, pois em ti eu me abrigo.\n\n10 Ensina-me a fazer a tua vontade, pois tu és o meu Deus; que o teu bondoso Espírito me conduza por terreno plano.\n\n11 Preserva-me a vida, Senhor, por causa do teu nome, por tua justiça, tira-me desta angústia.\n\n12 E no teu amor leal, aniquila os meus inimigos; destrói todos os meus adversários, pois sou teu servo.\n\n- Salmos 143:7-12",
				"added": 1586619750
			}
		],
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": [
			{
				"comment_id": 14,
				"body": "#Alternativas:\n- https://piratebay.center/\n- https://piratebay-proxylist.com/\n- https://proxybay.wtf/\n- https://piratebay-proxylist.net/",
				"added": 1586631917
			},
			{
				"comment_id": 15,
				"body": "#Torrents na ZeroNet:\n- http://127.0.0.1:43110/1ShArE1dJFcHFgTEEAUMXksDZuRckzd3Y/\n- http://127.0.0.1:43110/0play.bit/?Home\n- http://127.0.0.1:43110/1AnimePihDhcbVdK1nvnbSEtH4oKU8RAYG/?Home\n- http://127.0.0.1:43110/BoxHD.bit/index.html\n- http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3/?Home\n- http://127.0.0.1:43110/tvepisodes.bit\n- http://127.0.0.1:43110/zeropub.bit",
				"added": 1586632866
			},
			{
				"comment_id": 16,
				"body": "#Torrent-Paradise, um Pirate Bay descentralizado via IPFS\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu/Torrent+Paradise+um+Pirate+Bay+descentralizado+via+IPFS",
				"added": 1586632887
			}
		]
	},
	"comment_vote": {}
}