{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1518467842,
			"title": "What happens if the owner of a Zite deletes its contents?",
			"body": "If he deletes everything on his Zite and then signs and publish with his private key, when I connect to ZeroNet it will automatically copy the new emptyied Zite deleting the older content right? So, should I make regular backups of the Zites I actually care about?",
			"added": 1518467841
		}
	],
	"topic_vote": {
		"1_14qkCANgpwdN9rLmjeEWyyxEzAjmwFVkom": 1,
		"1518565098_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1518616713_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 22,
	"comment": {
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 1,
				"body": "14/88 \nGas the kikes, race war now!",
				"added": 1490726499
			}
		],
		"1_1KqEJ6jSKyVrgCMUb73LRQuAki7AbHYvL3": [
			{
				"comment_id": 2,
				"body": "No tbh fam",
				"added": 1504217445
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "The jews are the 1% of population but hold 60% of the wealth.",
				"added": 1517759055
			},
			{
				"comment_id": 17,
				"body": "> [4ud10](#comment_2_13g9icCHrAWZ2H3mHhr6XWEXGKtsVhR2dv): The anti-semites are 5% of the population but hold 95% of the ignorance.\n\nDear jew, or useful idiot goyim, you need to learn the reality\n\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx:pol:bbd1cc0f-38c8-45ff-b3fc-affd3979ca46",
				"added": 1519317947
			},
			{
				"comment_id": 19,
				"body": "sdfgsdf",
				"added": 1525540172
			},
			{
				"comment_id": 21,
				"body": "gaskammer",
				"added": 1565102533
			}
		],
		"1_1JnpHQf9rBR1hp2UMj6NNq8KYwV99jLr1f": [
			{
				"comment_id": 4,
				"body": "> [binchan2](#comment_74_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): From @Antilibrary's old ZeroMe profile, s/he said all IPFS nodes for storing books were all down, s/he would try to move all the files to ZeroNet by using bigfile plugin. Coming soon^TM\n\n>s/he\nGet gassed commie nigger",
				"added": 1517759107
			}
		],
		"1517743836_1HsgZpHaZ5BRUK5qr2YMWnubgKyNuSqokH": [
			{
				"comment_id": 5,
				"body": "No. The industry of my country was sold when we joined the EU. Also it's probably the most feminist country in Europe.",
				"added": 1517759222
			}
		],
		"1518231194_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 6,
				"body": "Why would you even want to go to a The Rapist in the first place?",
				"added": 1518265276
			},
			{
				"comment_id": 7,
				"body": "> [helium](#comment_163_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): What do You mean by \"The Rapist\"?Or You believe that a faculty of physics or chemistry or math at an \"atheist\" European university is propaganda and brainwashing?\n\nThe Rapist = therapist",
				"added": 1518273362
			}
		],
		"1518645443_1JpvBGTqs5YP68wSfhv1ZnqY9iAdpFEsU1": [
			{
				"comment_id": 8,
				"body": "Gas the kikes, race war now.",
				"added": 1518645502
			}
		],
		"1518682391_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 9,
				"body": "If guns were used to kill jews like Soros instead of innocent people, the world would become a better place.",
				"added": 1518709436
			},
			{
				"comment_id": 10,
				"body": "> [flappyearz](#comment_156_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): Actually if people with disfunctional brains were shot we would have to miss racist comments like yours (and the world would be definitely a better place).\n\nOr you can kill every nigger so the high crime rate stops and they end shitting impoverished, retarded, future criminal nigglets. Then you would not see racist comments like mine (and the world would _actually_ be a better place).",
				"added": 1518724753
			}
		],
		"1518616574_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 11,
				"body": "Anti pedophilia is a code word for anti male. When feminism started, age of consent laws started to appear to not allow men to form relationships with younger girls. This means that what once was legal was becoming more criminalized reaching to the point were men have to deny that they are even attracted to 15 year old girls. Of course before all this happened, pedophilia was not in the common lexicon.",
				"added": 1518726880
			},
			{
				"comment_id": 12,
				"body": "> [helium](#comment_218_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): You clearly have forgotten Your younger years. Otherwise You would remember, how unpleasant it was, when \"old\" women tried to flirt with You.\n\nOf course, but women never get aimed by antipedophilia, and if they do, they get lighter sentences, or none at all, and her behaviour gets excused by a large part of the public opinion by claiming that the younger boy liked it.",
				"added": 1518727218
			}
		],
		"1518793754_1D8nrvyX1Hwj1FvSvFWZWLsT8R48F3sqpF": [
			{
				"comment_id": 13,
				"body": "It's pretty much dead https://www.reddit.com/r/antilibrary/comments/7pdwud/no_books_can_be_downloaded_all_ipfs_nodes_are_down/\nBut there is http://libgen.io which is great. It has been running for several years but who knows for how much longer? So you better go there and download all the books that matter for you, and if possible get the torrent file for every book and seed them to infinity, at least until these new technologies are more developed and a decentralized page the size of libgen is finally possible.",
				"added": 1518796341
			},
			{
				"comment_id": 14,
				"body": "If you really have an account on bibliotik I don't even know why are you opening this thread. You are clearly deeper into the scene than I'll ever be.\nBut to answer your question, you can upload books on libgen through tor if you worry about being watched.",
				"added": 1518799824
			}
		],
		"1511539827_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": [
			{
				"comment_id": 15,
				"body": "> [kopyjane](#comment_54_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE): Libertarians these days seem divided over whether they want to be ruled by government bureaucrats, or corporate power. I'd say.. bow to neither.\n\nThe real answer is National Socialism",
				"added": 1519317366
			},
			{
				"comment_id": 16,
				"body": "> [severeburns]You talk about \"Anarcho-capitalism\" but seriously, if you're in an anarchist state, why would you bother with an economy? Leave economies to Jews. Socio-Anarchism is the only one that I would want to work.\n\nThe only place for jews is the oven",
				"added": 1519317424
			}
		],
		"1519718894_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 18,
				"body": "Nobody says infiltrated when the left does it. It is because the left is infiltrated everywhere, from every online forum, to our Universities, so people assume it's not infiltration, but the natural state of things. Of course, when the right gets tired of this bullshit and raises its voice, the assimilated left says it is infiltration and propaganda spreading.\n\nAnd BTW, Peterson  is nowhere near alt-right, he is a psyop. Hell, he even has an enormous Lenin painting in his house.",
				"added": 1519751910
			}
		],
		"1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 20,
				"body": "A powerful forum software in the style of vbulletin or phpbb",
				"added": 1525638565
			}
		]
	},
	"comment_vote": {
		"3_14AoE5CZZfcCJiQ4Wru2AQuMVmgMZxBWCt": 1,
		"5_1FnQQkQ4AwjwBhbz61RmqPazDrvdBGy79K": 1,
		"1_1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8o": 1,
		"1_1Mbqod3HqqPByb7q8t2nKNSzGhL1dAuPAV": 1,
		"1_132EBXmznzeTRPJrmLUDjaVQxdECB7gDp3": 1,
		"93_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"39_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"217_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1,
		"1_1GpJ7xYCGgLwb7VHjvKZerCC26b61mcdKe": 1
	}
}