{
	"title": "WoTank Blog",
	"description": "坦克在说话",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1498786747,
	"post": [
		{
			"post_id": 29,
			"title": "残疾学生带母上清华获批2室1厅宿舍：从来没有想过",
			"date_published": 1498786707.845,
			"body": "发现一个好句：**人生实苦，但请你足够相信**\n\n甘肃定西，残疾学生魏祥以648分的成绩被清华录取，因生活不能自理，他写信求助，希望能带着母亲求学。最终，学校给他俩安排了一个两室一厅的套房。\n\n**【事件回顾】**\n\n**高分残疾考生请求带母上清华**\n\n新华社兰州6月28日电（记者张[文静](http://t.qq.com/CCTVwenjing#pref=qqcom.keyword)孙琪）一份“一位甘肃高分（648分）考生的请求”的帖子在网络上引起广泛关注。帖子里的主人公魏祥是甘肃省定西市第一中学的一名学生，刚刚参加完2017年高考，并获得了理科648分的成绩。他所盼望的是：能够带着妈妈一起去梦想已久的清华大学读书。\n\n**对话残疾考生：妈妈最难的是独自养我**\n\n1998年，刚刚出生的魏祥被诊断出患有先天性脊柱裂、椎管内囊肿，下肢丧失运动功能。2005年，魏祥的父亲又因病去世。此后，家里的担子就落在了妈妈一个人的肩上。“妈妈最难的就是一个人抚养我，一个人的话又要忙[工作](http://time.qq.com/baike/deskclean/20170207.htm?pgv_ref=guanjianews_tips&from=guanjia)，又要忙着照顾我，很困难。”魏祥说话时充满了感激。\n\n**清华致甘肃考生魏祥：人生实苦，但请你足够相信**\n\n清华大学第一时间回应称，已为考生母子准备免费住宿，不会让任何一位优秀学生因为经济原因而辍学！并对在求学路上荆棘丛生的学子们说：人生实苦，但请你足够相信！\n\n**魏祥欲就读数理方向专业 甘肃校友会捐资1万余元**\n\n28日上午，甘肃省教育厅官方微博称，清华大学甘肃校友会向魏祥同学资助一万元，这些钱是临时筹集的，都是每个人捐出100元、200元筹集起来的。魏祥的母亲表示，6月26日，魏祥已经正式填报了清华大学的志愿，选择的是数理方向。"
		},
		{
			"post_id": 28,
			"title": "New blog post",
			"date_published": 1497410260.96,
			"body": "Blog post body"
		},
		{
			"post_id": 27,
			"title": "最近翻墙会卡",
			"date_published": 1496246652.227,
			"body": "据说这两天翻墙速度会变慢。这两天搞破坏的又开始鼓动说六四事件如何如何了，中央现在已经不禁止讨论这个话题，但是也不会说去宣传这个话题。那些破坏分子说说就够了哈！"
		},
		{
			"post_id": 26,
			"title": "郭文贵，逼迫中国做出让步的流亡者",
			"date_published": 1496245115.163,
			"body": "中国今年最重大的政治新闻不是发生在北京，甚至也不是发生在中国。它的中心是曼哈顿一套价值6800万美元（约合4.7亿元人民币）的公寓，从那里可以俯瞰中央公园(Central Park)。\n\n在这里，自我流放的亿万富翁郭文贵于过去几个月里向中国共产党发起了政治攻击，把Twitter当作[扩音器](https://twitter.com/KwokMiles)，控诉中国高级领导人的贪腐行径。他升级了这场攻击，声称负责反腐运动的中国二号领导人的家人，秘密拥有中国一个大型企业集团的大量股份。\n\n---\n\n中国政府发动官方媒体列举郭文贵被控的欺诈罪行，以此作为回应。此外，官方还请求国际刑警组织(Interpol)对其发出全球通缉令。\n\n但后来，意想不到的事情发生了。中国做出了让步。\b官方媒体针对他的行动逐渐减弱。5月中旬，郭文贵在Twitter上宣布，之前被禁止离开中国的妻女已获准去纽约看他。\n\n“我们要铲除一些盗国者，”郭文贵本月在其公寓里对两名《纽约时报》记者说。他指的是中国。为了强调这一点，他还用中文把它写在了一个笔记本上。“反对以贪反贪。”\n\n\b郭文贵的指控未经证实，他的一些说法甚至是荒诞的，\b很容易被揭穿。但他那些对中国权贵的接二连三的指控中，有一部分已经被证明是准确的。他的\b前政治靠山曾是中国最高级的情报官员之一，而政府处理郭文贵的方式说明了他可能被严肃地对待，甚至获得了北京某些官员的支持。\n\n郭文贵近期的大部分说法在全中国引起了反响，并在华尔街上引发了对在中国做生意的担忧。如果得到证实，这些说法可能会颠覆这个全球第二大经济体的政治，在中国国家主席习近平和反腐高官王岐山之间挑起不和。\n\n王岐山与华尔街关系密切，对中国金融领域有着巨大的影响力。几个月后，共产党将召开会议，会议将决定王岐山是否留在共产党的领导机构政治局常务委员会里。最近，王岐山备受瞩目，有传言称他可能会出任中国下一任总理。就在此时，郭文贵抛出了相关说法。\n\n郭文贵在Twitter上的抨击还在继续。在国内外，他逼得全世界最强大的威权主义国家让步的能力，突显了围绕他如何获得万贯家财、他知道些什么以及如果有人在支持他的话，这个人是谁的谜团。\n\n**\b无情，还是英雄？**\n\n他性格张扬，志向远大，有时候却令人困惑。他自称有一个计划，可以消除共产党内部的腐败、给中国带来法治，并通过在贸易上结束持续数十年的中国不当行为，让中美关系稳定发展。在其他时候，他又解释说自己的腐败指控，是对很久以前的一起死亡事件的报复。但他可能只是一个感到有压力的人。他在中国国内的资产被冻结，且[不良投资](https://www.lowenstein.com/files/upload/ACEvUBSAmendedComplaint.pdf)和多起官司正在慢慢侵蚀他的财富。\n\n没人能比在国外叫迈尔斯·郭(Miles Kwok)的郭文贵更好地代表共产党与资本的联姻。他利用与中国权力最大的一些官员的关系，帮助建立了一个包括酒店、办公楼和证券经纪的全球投资组合。\n\n规模庞大的中国公司[海航](https://cn.nytimes.com/china/20170510/hna-group-hainan-airlines-china-deals/)在西方收购动作不断。如果给郭文贵看一份列着海航股东的表格，他会飞快说出著名家族成员的名字。他声称，真正持有股份的是这些人。让他画出这些名字的家谱图——这是在中国追踪不义之财的关键——的话，他会凭记忆画出来，具体到姐妹、堂表亲和姑姨。\n\n“关于海航的指控是不真实的，”海航的一位发言人说。\n\n十几年前，中共向商人伸出双臂，打开了加入该党的大门。反过来，这些大亨在帮助中国实现惊人的增长率的同时，也帮助革命的子子孙孙成了富豪。现在，掌握了信息的其中一人脱离了既定轨道。\n\n“这些人掌握着权力、影响力和知识，”哈佛大学商学院(Harvard Business School)的教授柯伟林(William C. Kirby)说。“其中很多人容易控制。但其他人会走到笼外去。”\n\n郭文贵比其他任何人都走得更远。中共报复他时，官方媒体[《新京报》](http://www.china.com.cn/news/2017-04/26/content_40699329.htm)报道称他涉嫌从一家国有银行“骗贷”32亿元。另一家刊物《财新周刊》则参考来自王岐山领导的中央纪律检查委员会的文件，[称](http://china.caixin.com/2017-04-20/101080560.html)郭文贵安排把自己控制的一家证券公司的20.5亿元客户资金，非法转出该公司。\n\n政府最强大的武器，是4月公布的前中国反间谍事务负责人、郭文贵曾经的政治靠山马建的[认罪视频](https://www.youtube.com/watch?v=h-DcwD68V2g)。在视频中，马建说自己收了郭文贵价值逾870万美元的礼物，而郭文贵从他那里换取的好处包括他频繁干预官员的决策，以绕过郭文贵房地产项目遇到的一切障碍。“郭文贵为了讨好我，感谢我，维系和我的关系，也给我输送了大量的利益，”马建在视频中说。\n\n郭文贵人在美国这一点，让正在寻求中国的合作，以控制朝鲜核野心的特朗普政府进退两难。据一名前联邦政府高级官员称，近年来，郭文贵多次拜访北京的使馆官员，为华盛顿洞察中国政治提供了帮助。\n\n身为特朗普总统位于棕榈滩的私人俱乐部马阿拉歌的会员的郭文贵，迫切地想要接近权力在握的人。周二，\b他在Twitter上写道，他飞往华盛顿，去参加在特朗普国际酒店举行的会议。他是前英国首相托尼·布莱尔(Tony Blair)所作慈善工作的捐赠人，布莱尔对他以朋友相称。\n\n《纽约时报》记者4月底造访郭文贵在荷兰雪梨(Sherry-Netherland)酒店公寓里的住所时，他走到另一个房间接了一个电话，开着扬声器。他的助理解释说，电话的另一头是习近平的一个高级助手。这其中的暗示显而易见：尽管前所未有地公开抨击一些最高层官员，但郭文贵仍在和最重要的那个人有联系。\n\n和郭文贵的很多说法一样，外人不可能证实电话另一头是谁，但这件事完全符合郭文贵爱炫耀的个性。一个和他相识已久的人说，擅长引起注意是他的特点。郭文贵曾当着这个人的面接听前情报官员马建的电话。\n\n因为那些公开的抨击，郭文贵被中国很多异见人士和处于官媒体系之外的记者说成了英雄。但一些认识他的人说，他可以很无情。北京的一名副市长曾妨碍他在奥林匹克公园旁边修建一座精美的大厦。后来，在郭文贵拿到一盘这名官员和情妇发生性关系的[录像](http://www.scmp.com/article/656420/sex-video-toppled-vice-mayor-beijing)后，该官员被免职并因受贿被判处死缓。\n\n郭文贵还把目标对准了所写报道有损其形象的新闻机构。2015年，财新撰写了一篇有关其商业和政治人脉的长篇调查性报道。作为回应，郭文贵[声称](http://www.zqholdings.com/gg_53.html)财新总编和他的前生意伙伴有染并育有一子，甚至还公布了他所说的那个孩子的身份证号码。财新正在起诉郭文贵诽谤。\n\n两年前，他逃离中国。他对中国领导人的公开攻击始于1月。通过Twitter和上月在美国之音(Voice of America)上的一个[电视采访](https://cn.nytimes.com/china/20170420/china-guo-wengui-interpol-voice-of-america/)，郭文贵说几年前，中国警界的一名最高官员按习近平的吩咐，让他调查王岐山的家庭财务情况。\n\n加州大学圣迭戈分校(University of California, San Diego)研究中国金融和政治的教授史宗瀚(Victor Shih)认为，当中国政府减少了对郭文贵的攻击，这种态度的大转变表明，在如何处理郭文贵的问题上，其最高领导层可能存在分歧。“如果党内一致反对郭文贵，对他家人的处理应该会严厉得多，”他说。\n\n\b**寻求复仇**\n\n身在国外的郭文贵依然过着豪华的生活。他的Twitter[个人](https://twitter.com/KwokMiles)页面将他描绘成《饥饿游戏》(Hunger Games)系列里嘲笑鸟(Mockingjay)的男版。在Twitter上，他炫耀过自己新买的空客(Airbus)私人飞机。在介绍他在纽约的那套公寓——他和一只比熊犬住在那里——时，他一一指出了Lalique的水晶吊灯、路易十六的家具和一幅中国古画。这套位于18层的公寓每月仅维护费用就高达5.8万美元。\n\n郭文贵号称在全球有多处房产，分布在北京、伦敦、东京、阿布扎比和香港等地。从香港那处坐落在海边的房屋里看出去，浅水湾一览无余。房产记录显示，房屋所在的两个地块为郭文贵之子2011年花8.8亿港币（约合7.7亿元人民币）购得。\n\n他在北京的湖边物业是仿照传统平房庭院建造的，但要精致得多，而且是多层的。一个巨大的衣橱里装着数百套同样的西装，面积达8.6万平方英尺的院落内配有游泳池。据北京的一个房产中介估计，其价值约为2.3亿美元。\n\n2004年，郭文贵把当时在哈佛当系主任的柯伟林带到这个地方，参观了两个小时。一行人被领进一个灯光昏暗的私人影院，当郭文贵用一段事先录好的视频介绍自己打算在北京2008年奥运会场地附近开发的一个项目时，施特劳斯的《拉德斯基进行曲》开始响起。柯伟林回忆说，郭文贵和北京的一名副市长而后请哈佛在该建筑综合体中设置一个分校。\n\n晚餐期间，郭文贵一边观看一个小小电视屏幕上的中国肥皂剧，一边继续阐述自己的想法。“那至今仍是我在中国度过的最离奇的一个晚上，”柯伟林说。（哈佛没有接受郭文贵的邀约。）\n\n郭文贵说，他控诉腐败的动机很简单：他声称政府在1989年枪杀了他的一个弟弟，自从那时起他一直在谋划复仇。不过，像郭文贵的故事中的很多情节一样，关于那起死亡事件的细节含混不清。\n\n郭文贵说，1989年的学生抗议活动期间，他因为给学生运动提供资金而被捕，并坐了两年牢。但一家海外网站援引法庭文件称，郭文贵当初是因为卷入一起跟石油销售有关的诈骗案而被捕的，他弟弟则是在和他一起袭警时被杀的。\n\n他说自己来自中国东部省份山东的一个小镇，生于1970年5月，是家中的十个男孩之一，家里在部队上有些关系。（法律文件显示他生于1967年2月。）郭文贵说，在狱中，只念到初中的他从一些有文化的犯人那里学到了关于中国历史和其他问题的知识。\n\n1991年被释放后，郭文贵认识了一个著名的女商人，她向他介绍了几位富有的投资者。不久后，他在中国中部城市郑州建成了一家酒店，那里成了政府官员的聚会地点。\n\n与这些官员的接触以及后来的关系（包括同间谍机构负责人马建的联系）帮助郭文贵建立起他的帝国。后来他把业务扩大到金融领域，收购了一家证券经纪公司的大量股份。2014年，追踪中国精英财富的《胡润百富》(Hurun Report)估计他的财富为23亿美元。但是，同年，郭文贵控制中国最大券商之一的野心破灭了，他与自己的生意合伙人发生了争执，这位合伙人后来被判入狱。\n\n从那以后，郭文贵一直在国外生活，他在中国的资产——他声称共有1200亿人民币（约合174亿美元）——遭到冻结。郭文贵正面临财务压力。\n\n一家位于香港的对冲基金声称，郭文贵欠该基金8800万元。这家名为太盟亚洲机会基金(Pacific Alliance Asia Opportunity Fund)的公司最近在纽约起诉他，称他从2008年起已经累积拖欠了数百万美元的贷款利息。\n\n去年，郭文贵起诉瑞士银行瑞银，声称他在一系列交易中被误导，造成了5亿美元的损失，但诉讼被驳回。财新上周发表了一篇报道，说布莱尔曾把郭文贵介绍给阿布扎比的王储。郭文贵后来利用阿布扎比的资金资助一家中国证券公司进行失败的收购，从而导致了这场亏损。布莱尔的一位代表没有谈到布莱尔是否向郭文贵介绍过阿布扎比王储。郭文贵则说，这个故事毫无根据。\n\n根据时报4月的报道，郭文贵3月就一个显赫中国家族秘密财富所发表的说法，可以通过公司文件得到证实。然而，调查王岐山是一件格外有风险的事。\n\n这位68岁的官员以擅长解决问题著称，曾与多位美国高管有过密切合作，其中包括前高盛(Goldman Sachs)首席执行官、前美国财政部长亨利·M·保尔森(Henry M. Paulson)。他的嫡系人物在中国政府内身居多个要职。王岐山没有回复传真到位于北京的中央纪律检查委员会的问题。海航集团拒绝置评。\n\n“王岐山一直是清廉能干的典范，几乎是不可战胜的，”中国美国商会主席蔡瑞德(William Zarit)说。“如果他的仕途一落千丈，企业和政府的操盘者也应该关心自身的安全。”\n\n郭文贵没有任何偃旗息鼓的迹象。今年秋天，共产党又要召开会议，选择一批高层领导人，郭文贵打算在这之前发起最具戏剧性的一次攻击，可能是在林肯中心举行一个现场活动，重点谈及中国的腐败问题。\n\n“我想让它成为狂欢节的风格，要有一个大屏幕，”他说。“我们要唱歌，”他补充说。“我们要大喊，我们要谈谈这个世界。”"
		},
		{
			"post_id": 25,
			"title": "小朋友的“大朋友”习近平",
			"date_published": 1496244461.995,
			"body": "又是一年“六一”，孩子们的节日到了！\n\n习近平总书记常说，孩子们成长得更好，是我们最大的心愿。\n\n操场上、教室里、少年宫的活动中……都留下了这位“大朋友”和孩子们的美好回忆。"
		},
		{
			"post_id": 24,
			"title": "今日比特币暴跌疑与扩容协议有关",
			"date_published": 1495879605.113,
			"body": "该协议排除了Core团队。。。。"
		},
		{
			"post_id": 23,
			"title": "李明哲被逮捕 大陆专家：与其是何身份关系不大",
			"date_published": 1495847122.61,
			"body": "（原标题：李明哲被逮捕 大陆专家：体现依法办事原则）\n\n中新社北京5月26日电 多位台湾问题专家26日就李明哲被依法逮捕接受中新社记者采访时指出，大陆司法机关依法办事，查明其涉嫌犯罪的事实；台湾居民只要遵纪守法，其在大陆权益会被依法保护。\n\n当日晚间，国务院台办发言人安峰山应询表示，台湾居民李明哲涉嫌“颠覆国家政权罪”，经检察机关批准，已于近日被湖南省安全机关依法逮捕。\n\n---\n\n北京联合大学台湾研究院院长李维一说，该案被曝光至今已经过了2个月左右的时间，大陆司法机关依法办事，已查明李明哲涉嫌犯罪的事实，相关案件进入司法程序，李明哲经批准已被逮捕。\n\n李维一说，这段时间以来，李明哲家属和台湾媒体在岛内多次发声。现在，李明哲等人涉嫌犯罪的事实已被掌握，“这个事件也不言自明了”。\n\n厦门大学台湾研究院政治研究所所长、两岸关系和平发展协同创新中心教授张文生说，李明哲涉嫌触犯刑法，证据充分，法律面前人人平等。大陆司法机关追究其法律责任，不论在证据收集还是涉案人员权益保护方面，大陆方面都充分体现依法办事的原则。\n\n全国台湾研究会副秘书长兼研究部主任严峻说，李明哲涉嫌犯罪被批捕是大陆的一个司法案件，“与其是何身份关系不大”。台湾居民在大陆工作、生活，只要遵纪守法，其权益仍会被依法保护。\n\n延伸 · 回顾\n\n[国台办:李明哲因涉“颠覆国家政权罪”被依法逮捕](http://news.163.com/17/0526/21/CLD28NC00001899N.html)\n\n新华社北京5月26日消息，国台办发言人安峰山当日应询表示，从国家安全部门获悉，台湾居民李明哲因涉嫌“颠覆国家政权罪”，经检察机关批准，已于近日被湖南省安全机关依法逮捕。"
		},
		{
			"post_id": 22,
			"title": "港珠澳大桥压力测试报告涉造假 廉政公署启动调查",
			"date_published": 1495702453.767,
			"body": "（原标题：港珠澳大桥混凝土测试报告涉嫌造假，港廉政公署启动贪污调查）\n\n5月23日，香港廉政公署发布新闻稿，证实在港珠澳大桥建设中，香港土木工程拓展署的一家承判商涉嫌贪污，并向土木工程拓展署提供虚假混凝土（石屎）压力测试报告。香港廉政公署对21名涉案人员进行拘捕调查。\n\n香港廉政公署早前接获土木工程拓展署转达的贪污投诉，而后展开调查。5月16日，香港廉政公署展开代号“绿田园”的行动，拘捕涉案承判商的2名高层人员、2名高级工地实验室技术员(高级技术员)、12名工地实验室技术员(技术员)及5名实验室服务员(服务员)。\n\n---\n\n香港廉政公署称，所有被捕人员已获准保释，但调查继续进行。\n\n香港土力工程处前处长陈健硕曾对此案表示，需先了解涉嫌造假的阶段及影响范围，才可评估其影响。陈健硕解释，如果一般水泥钢筋一直被香港沿用，供应商会先测试，到工程承办商购买有关建材时，会再测试其化学物质和强度，最后再由工务部门物料测试组验收。如果造假情况涉及新物料入口测试，涉事水泥钢筋或被用于其他工程，牵连更大。\n\n香港土木工程拓展署自2013年1月起雇佣该承判商，对用于港珠澳大桥工程的混凝土样本进行压力测试。每件混凝土样本的测试须在特定时段内进行，但所有混凝土样本(样本砖)均须通过测试。\n\n港珠澳大桥全长12公里，连接香港、珠海、澳门，从2009年起动工建设，预计在今年年底完工通车，建成后将是全球最长的跨海大桥。\n\n香港廉政公署调查显示，部份测试未能按合约要求在特定时段内完成，涉案技术员及服务员涉嫌调整测试器材所显示的时间，以掩饰其违规情况。\n\n此外，香港廉政公署在行动中发现，部分实验室人员涉嫌以金属校准柱及/或强力混凝土砖代替混凝土样本，以伪造测试结果，使测试看似正常进行。上述违规行为怀疑在2015年初以前就已经发生。\n\n香港廉政公署调查发现，涉案的两名高级技术员负责核实有关虚假测试报告，他们涉嫌贪污、并纵容把虚假测试报告呈交给香港土木工程拓展署的行为。\n\n香港土木工程拓展署此前发现混凝土压力测试报告的异常情况，涉案承判商对此事进行了内部调查，但是在呈交给土木工程拓展署的调查报告中，并没有披露有关使用金属校准柱及/或强力混凝土砖进行虚假测试这一问题。香港廉政公署称，有关承判商涉嫌呈交误导性的调查报告诈骗土木工程拓展署。\n\n据星岛日报报道，被捕的21名男子，年龄在20多岁至60多岁。行动由廉署执行处C组负责，共派出50名调查人员采取行动，在各人家中将之拘捕，并向法庭申请了20张搜查令，搜查各人寓所及承判商办公室。"
		},
		{
			"post_id": 21,
			"title": "又一贪官被调查",
			"date_published": 1495501144.285,
			"body": "刚刚在微博得知，陕西人大常委会副主任魏民洲涉嫌眼中违纪，正在接受组织调查！！"
		},
		{
			"post_id": 20,
			"title": "我们也知道共产党不好",
			"date_published": 1495300274.762,
			"body": "在ZERONET上看了太多美分狗咬人啦，真的是快免疫了，跟FB上一样，一来就这个狗那个猪的说，搞的好像他们做着崇高的事业一样，谁知道屏幕前的你是猪还是狗哦？\n\n我们也知道共产党不好，共产党也犯过错误啦，我知道，比如什么文化大革命，一直不敢直接面对的话题，一直在整蛊人民，愚弄人民，堵住人民的嘴，还入党前说要经常进行批评与自我批评，我看没几个党员真的做的到吧。批评自己的都是一些无关紧要的东西，比如自己粗心大意啦~在这一点上，我不喜欢共产党，什么时候我们能光明正大的谈论文革的时候，那我就喜欢你啦！\n\n好吧，我见证了太多你党员了，实际上都不优秀，现在共产党实际上有一半都是没有党性吧？都是为了就业增加优势。这个无可厚非嘛。不能排除的是还是有很大一部分共产党人为了共产主义事业在基层任劳任怨的工作。\n\n我们也知道共产党不好啦，类似很多贪官抓了抓不尽，权利的游戏嘛，有权利就会有腐败了不是？哪个国家没有腐败啊？韩国朴槿惠还直接被撸了不是？有腐败就要抓啊。又不是纵容腐败，允许腐败。今年又抓了好几只大老虎啦，社会评价是极其正面的，哦，美分估计看不到这一点。\n\n好啦！水平不好，随便牢骚下。辣鸡美分去死啦！"
		},
		{
			"post_id": 19,
			"title": "最近玩了几把山寨币",
			"date_published": 1495199657.062,
			"body": "namecoin以及dogecoin都是我入手的重点，主要是一直在涨！有病啊！"
		},
		{
			"post_id": 18,
			"title": "广州国土局原局长一人当官全家腐败 妻姐情妇全判了\n",
			"date_published": 1495069361.607,
			"body": "原标题：广州国土局原局长一人当官全家腐败妻姐情妇全判了\n\n北京大学博士后、曾被称为学者型官员的广州市房管局原局长李俊夫，“一人当官、全家腐败”，妻姐王译伟充当中间人，与商人陈爱民合作，通过李俊夫的职务便利，帮助陈爱民挂靠的公司中标保障房项目，陈爱民将工程转卖获利3200万元，按约定送给王译伟1000万元。\n\n不仅如此，李俊夫的妻子王庆湘是武汉大学的法学博士，两人作案时设下“防火墙”。李俊夫本人很少直接过手财物，都是王庆湘、王译伟来实现受贿。姐妹俩信佛，很多别有用心的老板用大量价值数百万的沉香、天珠、和田玉等“雅贿”来实现承揽工程。\n\n---\n\n李俊夫的情妇黄蕾，从四川跟随他来到广州，也想通过李俊夫干保障房工作挣钱。因为并没有参与工程，却得到150万的好处。\n\n《法制晚报》深读（微信ID:shenduzhongguo）记者了解到，李俊夫曾供述，他妻姐就是一道“防火墙”，受贿后买房曾计划过户到他儿子名下，他儿子已入美国国籍，但国内户籍落在他妻姐家，是“妻姐家的二儿子”。他在广州任上几年，安排人插手工程敛财980万元，只为仕途“进一步”、花钱跑官方便。\n\n《法制晚报》深读（微信ID:shenduzhongguo）记者今天获悉，广东省高院作出终审裁定，维持一审判决，以受贿罪判处李俊夫的妻姐王译伟有期徒刑8年，并处罚金200万。李俊夫的情妇因掩饰、隐瞒犯罪所得罪，终审获刑3年，并处罚金5万元。\n\n**案情：广州国土局原局长 伙同妻姐收千万好处**\n\n被告人王译伟(曾用名王凤湘)，今年53岁，是广州市国土资源和房屋管理局原局长兼广州市住房保障办公室原主任李俊夫的妻姐。\n\n判决书显示，2010年8月24日，李俊夫被任命为广州市国土资源和房产管理局局长、广州市住房保障办公室主任；2011年2月10日起兼任广州市人民政府征用土地办公室、广州市土地开发中心主任；2012年2月28日起兼任广州市“三旧”改造工作办公室常务副主任，2014年2月17日免去该职务。\n\n法院审理查明，2012年间，王译伟与广东达安项目管理股份有限公司项目经理陈爱民（另案处理）商议，由她出面充当中间人与陈爱民合作，由李俊夫利用上述职务便利，帮助陈爱民中标保障房工程，陈爱民中标后不参与施工，而是将中标的工程直接予以转卖，“卖标”后所得收益与被告人王译伟五五分成。\n\n2012年1月至2014年1月间，按上述约定，李俊夫利用职务便利帮助陈爱民挂靠的公司中标了“鸦岗（一期）保障性住房项目前期工程施工总承包”项目、“萝岗中心城区（二期）、石丰路保障性住房项目前期工程施工总承包—石丰路”项目和“萝岗中心城区（一期）保障性住房项目施工总承包（标段六）”项目，陈爱民将中标工程转卖共获取“卖标费”人民币3200多万元，之后分三次将其中的1000万元贿送给王译伟。\n\n**妻姐买两套豪宅 一套拟过户给妹妹儿子**\n\n王译伟收到陈爱民贿送款项后，经与李俊夫夫妇商议，用部分贿赂款购买了汇景新城两套房产，一套自用，一套拟过户至李俊夫儿子名下。案发后，王译伟主动向办案机关投案，并退缴赃款人民币974万元。\n\n法院审理认为，王译伟和李俊夫在侦查阶段的供述高度吻合，且与李某、徐某等人的证言相互印证，均证实王译伟向李俊夫打招呼、传递资料，请李俊夫关照陈爱民，李俊夫也知道王译伟与陈爱民有经济利益输送关系。\n\n**纸箱装550万元赃款 妻姐一审因受贿判8年**\n\n经查，陈爱民通过三个保障房工程共获得“卖标费”3200多万元，其中石丰项目1160万元，鸦岗项目1250万元，萝岗标段六项目800万元。按五五分成的约定，王译伟应得1380万元。\n\n据陈爱民供称，其在扣除相应开支费用后，向王译伟报称三个项目共获利2000万元，故按一半计算，给王译伟的是1000万元。李俊夫的证言亦证实，其曾在家中询问王译伟到底收了陈爱民多少钱，王译伟回答收了1000多万元。\n\n王译伟辩称收取的第二笔款项是300万元，并非550万元，因为用两个纸箱装不下，她也搬不动。法院审理认为，550万元人民币重达60余公斤，通过两三个纸箱装载并非完全不可能。王译伟此前供称，其回家后通过清点发现总数是550万元。\n\n法院认为，被告人王译伟伙同国家工作人员并利用国家工作人员的职务便利，收取他人贿赂，数额特别巨大，其行为已构成受贿罪。被告人王译伟主动退缴赃款人民币974万元，接近全额退赃，可酌情从轻处罚。\n\n2016年11月15日，广州市中院作出一审判决，法院以受贿罪，判处王译伟有期徒刑8年，并处罚金人民币200万元，追缴违法所得人民币1000万元。宣判后，王译伟不服，提出上诉。\n\n一审宣判后，王译伟及其辩护人表示，一审判决认定事实不清，证据不足。他们认为王译伟不构成受贿罪，应认定为利用影响力受贿罪。且一审判决认定涉案数额有误，请求法院发回重审或查明事实后依法改判。\n\n**证言**\n\n**行贿人：与局长妻子是老乡**\n\n**揽工程为避嫌找局长妻姐**\n\n达安公司任项目经理的陈爱民称，他实际上就是挂靠在达安公司名下做业务，项目部自负盈亏。“我跟李俊夫的妻子王庆湘是老乡，是发小。我跟李俊夫的家人来往较多，尤其是与王庆湘的二姐王译伟来往很多。我认识到王译伟是李俊夫家族中是比较厉害的人物，对李俊夫夫妻有比较大的建议权。当我想参与广州市住房保障办公室的工程项目建设时，就联系了王庆湘，王庆湘每次都带她二姐王译伟和我谈事，王庆湘好几次说，以后有什么事情包括想参与广州市国土房管局及其下属单位的工程投标事项，就直接找王译伟，不要直接找她们两口子，王庆湘说这样做事安全点，也是为了避嫌。\n\n此后，陈爱民有事就直接找王译伟，“我意识到王译伟就是李俊夫夫妇对外关系的代言人。2012年上半年，经过几次沟通，王译伟向我提出三个合作条件：一是双方合作项目收益五五分账；二是双方均不投入资金，一次性拿走收益，不具体参与进场施工；三是我本人尽量避免直接出面洽谈工程项目业务。我同意了王译伟提出的要求。”\n\n陈爱民说，后来他通过王译伟的帮助，拿到了住房保障办的三个建设工程项目，“王译伟曾经明确告诉我，她在李俊夫面前帮我说话。我找工程公司承接的这三个项目，都是通过王译伟向李俊夫递交资料和协商解决的。工程项目进入招投标环节前，王译伟就会透露哪个标段可以给我做，我就根据标段的具体情况，通过罗某筛选合适的建筑公司来中标，然后把建筑公司的名称报给王译伟，王译伟再把我报上的建筑公司的名称报给李俊夫，李俊夫指示广州市住房保障办前期处处长徐某等人落实。有时候王译伟也会自己去找徐某等人协调。之后，徐某等人就会跟我说所报建筑公司实力不错，欢迎积极参与，这句话实际上就是说李俊夫已经同意我所报的建筑公司中标，让我去运作确保中标。“\n\n陈爱民说，“鸦岗”和“石丰”两个标段实际收益2000多万元，给王译伟报的获利1600万元，“萝岗”标段实际获益约800万元，给王译伟报的获利400万元。通过承接这几个工程，我先后3次给了王译伟现金人民币1000万元的好处费。第一次是在2013年1月左右，我用一部一次性手机打通王译伟的常用号码，告诉她有事，她挂断电话后，用平时不用的一个号码打回来，我告诉她钱已经到位，她给我一个电话号码，让我联系这个姓吴的把钱给他。我联系吴某，并约好在体育东路金利来大厦后门见面，把300万元现金给了吴某。\n\n2013年4月清明节前，陈爱民打电话跟王译伟说会有一批东西到，王译伟要他把东西带到郴州。陈爱民在收到罗某给他的萝岗六标买标费后，用两个纸箱装了550万元现金开车回到郴州。清明节，王译伟打电话约他在进嘉禾县城的大转盘处见面，他开车到指定位置，把装有550万元现金的两个纸箱搬到王译伟乘坐的车的后备厢里。交接完后，就各自开车离开了。\n\n2014年1月，陈爱民用同样的方式联系王译伟，在天河体育中心主场馆西侧的停车场，把钱交给刘某。陈爱民说，到了交接地点，他发现他认识刘某，就将用旅行袋装的150万元现金交给了刘某。\n\n陈爱民说，“我和李俊夫在汶川期间，没有发生多少经济往来，但是跟他交情还不错。为了避嫌，我没有直接与李俊夫夫妻接触，没有直接跟李俊夫对话。我送1000万元现金给王译伟，归根结底是送给李俊夫和王译伟的好处费。”\n\n**受贿人：局长跑官缺钱**\n\n**插手工程得980万**\n\n证人李某的证言显示，2012年过年后，李俊夫邀请他到广州见面，“李俊夫跟我说，他在这个岗位上干了几年，年龄上是个坎，要继续往上‘进步’，没有大量资金支持是不行的。但他妻子王庆湘不愿意拿太多钱帮他‘进步’。他现在正是进一步提升的关键时期，需要花钱去跑关系。但是由他自己出面操作不是很方便，希望我出面帮他拿些工程赚点钱，这些钱放在我这里，他需要用时我再给他。”\n\n李某说，李俊夫让他打下属市住保办前期处处徐某。李某之后打电话约徐某吃饭，徐某建议李某向陈爱民了解情况，说陈爱民比较熟悉广州建设市场的招投标情况，让李某多和陈爱民沟通。\n\n2012年年底，陈爱民跟李某说萝岗保障房的标段快出来了，让李某跟李俊夫沟通，以李某的名义参与保障房项目，投标工作由他来负责。\n\n2012年12月初，李俊夫通知李某来广州找徐某落实萝岗保障房的项目。一天晚上，李俊夫叫他一起去二沙岛散步，李某建议由陈爱民负责操作工程招投标，李俊夫当即同意，并当即打电话给陈爱民，让他一定要跟李某好好合作，并吩咐陈爱民自己不要出面，怕影响不好。李俊夫要李某和陈爱民谈好合作条件，他会全力支持。\n\n李某说，后来陈爱民通知他，说经和李俊夫协调内定，与他人一起操作投标萝岗中心城区（一期）保障性住房项目施工总承包，到时李某按比例分好处费就可以了。李某希望有15%的利润，后来确定好处费8%，可以提前兑现，不用等到工程结束。\n\n2013年3月陈爱民告诉李某，成功中标萝岗中心城区（一期）保障性住房项目施工总承包（标段六），工程量1.5亿，好处费8%是1200万人民币，扣除投标费等费用支出220万元人民币，李某可以拿到980万元人民币的利润。\n\n2013年2月底、3月初的一天，陈爱民开车到天河喜来登酒店门口送来现金300万元人民币。同年4月，陈爱民与他的司机一起开车到天河希尔顿酒店，把装有680万元人民币的两个纸箱搬到李某酒店房间。\n\n**下属：局长吩咐**\n\n**让相关公司承接工程**\n\n证人徐某称，2010年12月至2012年4月，他在广州市住房保障办公室工程前期部主持全面工作；2012年4月至2013年12月，担任广州市住房保障办公室工程前期处副处长；2013年12月后，担任广州市住房保障办工程前期处处长。\n\n2012年下半年，李俊夫把徐某叫到办公室，指示他关照广州市住宅建设有限公司，让该公司承接石丰基坑标段招投标项目。此后，他将广州市住宅建设有限公司总经理卢某叫到办公室，让卢某与负责招标代理的广州建成工程造价咨询事务所有限公司负责人苏某对接，广州市住宅建设有限公司顺利中标了石丰基坑标段总承包工程合同，至于广州市住宅建设有限公司卢某和苏某怎么协商，就不清楚了。\n\n徐某说，2012年下半年，李俊夫把他叫到办公室，指示他关照广州协安建设工程有限公司，让该公司承接鸦岗（一期）保障性住房项目前期工程。“收到李俊夫的指示后，我马上联系了陈爱民，让他与招标代理广东建设工程监理有限公司负责人刘某对接，后广州协安建设工程有限公司顺利中标石丰基坑标段总承包工程合同。\n\n2012年中，萝岗中心城区（一期）保障性住房项目施工总承包项目招标准备策划阶段，有一次徐某去李俊夫办公室汇报工作，李俊夫说李某之前在汶川援建的项目做得不错，并指示他在萝岗一期保障房项目招投标上关李某中一个标段，并让他对接落实好。徐某不敢怠慢，马上联系陈爱民，传达了李俊夫的指示。陈爱民去找项目招标代理广州建成咨询有限公司苏某协调此事，最后李某中标了其中一个标段。李俊夫当时跟他说，让李某做一个相对小一点的标段，大概1亿多元。\n\n**供述**\n\n**妻姐推荐、传话**\n\n**相当设置一道“防火墙”**\n\n李俊夫供述，陈爱民跟我妻子王庆湘是老乡。1993年，陈爱民到广州找工作时，我通过老婆认识的他。\n\n2008年，李俊夫任广州市政府副秘书长时，去汶川任广州援建汶川县威州镇前线工作组组长。他说当时广州没有几家代建管理公司愿意过去做业务，陈爱民过去考察后，让他开始着手代建工作。回广州后，李俊夫一家与陈爱民来往越来越多，尤其是跟他妻子王庆湘和妻子的二姐王译伟来往很多。他先后伙同王译伟收受陈爱民送的人民币1000万元。\n\n李俊夫说，2010年陈爱民回广州后，还是在住房保障办做代建项目。他所在的达安公司就是广州住房保障办的六家招标代理公司之一。\n\n2011年下半年，陈爱民觉得做代建不赚钱，向李俊夫提出想参与做保障房工程。李俊夫说考虑考虑。之后，市住保办前期处处徐某也不断向他推荐由陈爱民参与工程。后陈爱民又私下找到了王译伟，提出跟王译伟合作赚钱，并让王译伟向李俊夫提出想参与做市住保办建设工程项目。\n\n李俊夫说，妻姐王译伟跟他说了好几回陈爱民的事情，“我经过认真考虑，觉得他之前在汶川做得不错，而且这个人没什么根基，能管得住他，再加上王译伟、徐某等人推荐，就答应了。随后，我找徐某，让他看手头的项目情况分一些工程陈爱民。这样，在徐某的具体操作下，陈爱民顺利拿到了市住房保障办鸦岗项目、石丰项目、萝岗六标工程项目共三个市住保办施工总承包工程项目。\n\n李俊夫说，陈某甲在招投标开始前，会把和他有关系的公司资料直接或通过王译伟交给他，他把材料转交给市住房保障办负责工程项目招投标的前期处经办人员，让他们关注并考察一下这些工程公司，他们一般会去落实。\n\n李俊夫说，表面上王译伟陈爱民关系较好，陈爱民是为了帮朋友，暗地里他知道两人有经济利益。而且王译伟每次向他推陈爱民时，都多次暗示收到钱后会分给他们家一部分，只是没有明说如何分钱，什么时间分。李俊夫没有反对，只是提醒王译伟要谨慎些，注意影响。\n\n李俊夫说，王译伟在他和陈爱民之间起到一个推荐、送资料、传话的作用，也相当于设置了一道“防火墙”。王译伟具体怎么陈爱民谈的分成，他不清楚。\n\n**儿子已入美国国籍**\n\n**国内户籍显示是妻姐二儿子**\n\n2014年初，外界传中央巡视组要来调查李俊夫，有一次在家李俊夫问王译伟到底拿了多少钱，“她支支吾吾说有1000来万元吧。当时我妻子王庆湘说，外面的事情不让我管，让我专心自己的工作就行了。王译伟收钱会告诉我妻子王庆湘，她们两姐妹从中收的钱不会直接给我。王译伟2013年初预定下半年付款在汇景新城买了两套房子，一套是汇景新城东区的，面积约250平方米，总价约800万元，另一套也在这个小区，面积约220平方米，总价约700万元。买了房子后，我和王庆湘去看过，觉得挺不错，王译伟就跟我和王庆湘说，陈爱民帮忙赚了不少钱，可用这些钱买房，一家一套。当时我同意了，并与王译伟商量好，将来把汇景新城的房子过户到我小孩王某名下。王某已加入美国国籍，国内户籍挂在王译伟和她丈夫梁某名下，对外说是王译伟、梁某的二儿子。”\n\n**援建汶川认识朋友**\n\n**安排工程受贿980万**\n\n李俊夫说，他在援建汶川的时候认识的李某。2010年回广州工作后，也和李某一直有联系。后来他和广州方面的一些人到汶川游玩、考察参观，也经常让李某帮忙接待，安排吃饭、用车，给寺庙捐款等，有关费用开支均由李某负责支付，总共约人民币500万元。\n\n2013年3月，他安排李某出面陈爱民合作，并指示徐某从中协调，帮陈爱民以市工程总承包集团名义顺利承接了萝岗六标工程，通过这个工程陈爱民给李某人民币980万元。\n\n李俊夫说，他协调李某、陈爱民中标工程，陈爱民、李某瞒着他私下将工程转给他人承接，也就是俗称“卖标”，这980万元应该是他们之间的卖标利益分成。\n\n**妻姐：收钱不敢存银行**\n\n**买两套房一家一套**\n\n王译伟供述，陈爱民是她老乡。陈爱民和妹夫李俊夫是在四川援建时认识的，关系很好，经常有来往，“当时我妹妹王庆湘担心陈爱民与丈夫李俊夫走得太近，承接工程会被人说闲话而影响李俊夫的仕途，王庆湘多次告诉陈爱民有什么事情就找我，不要直接找她和李俊夫。”\n\n大约2012年5月，陈爱民找王译伟说想托她找李俊夫帮他找些住房保障工程来做，她当时未理会。过了一段时间陈爱民又找她，说市保障办有鸦岗、石丰两个工程项目要招标，他想参与，还说如果李俊夫问起希望她帮忙推荐，拿到工程后项目收益五五分成，以答谢她和李俊夫。她答应帮找李俊夫，让李俊夫尽量帮忙。\n\n后来，陈爱民找来的工程公司顺利拿到了广州市住房保障鸦岗（一期）保障性住房项目前期工程施工总承包、萝岗中心城区（二期）石丰路保障性住房项目前期工程施工总承包两个工程。\n\n王译伟说，她一方面把陈爱民找来参与投标的工程公司的资料交给李俊夫；另一方面向李俊夫推荐陈某甲，希望李俊夫帮陈爱民争取承接保障项目工程。她知道李俊夫应该跟负责招投标的市住房保障办前期处处长徐某打过招呼，关照陈爱民。陈某甲先后三次送了现金1000万元给她和李俊夫。\n\n王译伟说，陈爱民送钱，是因为她和李俊夫帮他操作中标承接工程，感谢她和李俊夫，并争取以后继续有机会赚钱。没有李俊夫的帮忙，陈爱民很难拿到工程。由于李俊夫不方便直接和陈爱民商谈和收受好处费，所以由她做中间人协调和负责收受。\n\n“开始我没有直接跟李俊夫说陈爱民送了多少钱，但在家庭聚会时我向李俊夫暗示。每次收钱，我都会找机会向李俊夫暗示。李俊夫听后会说你自己先处理好，要注意影响。这此钱约400万元用于购买物业了，其中300多万元用于购买股票和个人投资理财，余款个人日常消费了。”王译伟说。\n\n王译伟说，她收300万元不敢存银行，担心长期放在家里不安全，就跟李俊夫商量，“我手上太多现金，考虑买些物业投资升值。李俊夫同意了。”后来，她就和王庆湘一起看中了广州天河汇景新城东区两套房，支付了定金和首期购房款。买房李俊夫和王庆湘没有另外出资。\n\n**终审**\n\n**驳回上诉维持原判**\n\n二审法院审理认为，王译伟伙同国家工作人员并利用国家工作人员的职务便利，为他人谋取利益，收取他人贿赂，其行为已构成受贿罪，数额特别巨大。王译伟主动投案，如实供述自己的主要犯罪事实，构成自首，可减轻处罚。王译伟主动退出绝大部分赃款，可酌情从轻处罚。一审判决认定事实清楚，证据确实、充分，定罪准确，量刑适当，审判程序合法。\n\n2016年12月29日，广东省高院终审裁定，驳回上诉，维持原判。\n\n**相关新闻**\n\n**李俊夫情妇也获刑**\n\n黄蕾，出生地四川省什邡市，2014年7月30日被监视居住（指定居所），同年8月20日被逮捕。\n\n2011年3月间，黄蕾经他人介绍与时任广州市国土资源和房屋管理局局长兼广州市住房保障办公室主任的李俊夫（另案处理）相识，并逐渐发展成不正当的男女关系。\n\n在交往过程中，黄蕾向李俊夫提出，她想承建李俊夫管理的部分保障房工程，李俊夫让她联系广东达安项目管理股份有限公司项目经理陈爱民（另案处理、李俊夫妻子的老乡、发小）。李俊夫同时吩咐陈爱民，要关照一下他的情妇黄蕾。\n\n此外，李俊夫还向下属徐某（另案处理）打招呼，吩咐徐某在保障房鸦岗标段上关照黄蕾，具体让陈爱民帮忙运作。陈爱民答应与黄蕾合作，由他表示，由他负责运作工程，黄蕾直接收取中标工程后的利润分成。\n\n2013年年初，陈爱民和王译伟利用李俊夫的职务便利，在运作承接广州市保障房建设工程项目过程中获得了巨额利益，随后将150万元利润分成送给黄蕾。\n\n广州市检察院在调查李俊夫涉嫌经济犯罪过程中，发现黄蕾有涉案嫌疑，于2014年7月10日对她立案侦查。同年7月30日，黄蕾在广州市纪委的督促下主动到广州市检察院交代了她收受150万元的事实。同年10月31日，黄蕾通过家属退缴了全部赃款。\n\n广州市黄埔区法院2016年6月14日作出一审判决。以洗钱罪判处被告人黄蕾有期徒刑4年，并处罚金7.5万元。一审判决后，黄蕾不服上诉。\n\n二审法院经查，对于黄蕾主观上是否有受贿故意的问题，法院经查，黄蕾、陈爱民、李俊夫、徐某等人在侦查阶段的供述和证言基本吻合，通过相互印证可以证实，黄蕾与李俊夫有不正当的男女关系，黄蕾想利用她与李俊夫的特定关系，利用李俊夫的职务便利承接工程谋利。李俊夫为了关照黄蕾，让她去找陈爱民，并吩咐徐某、陈爱民关照黄蕾。\n\n陈爱民考虑到黄蕾没有工程建设方面的经验，不想让黄蕾直接承接工程，随后以共同承接相关保障房项目为名，劝说黄蕾“直接参与分成、不要出面”。之后，陈爱民将获得的“卖标费”中的150万元送给黄蕾，并称是“李局关照我们的”，等拿到后面的工程款，再给黄蕾150万元。\n\n终审法院审理认为，黄蕾明知是他人犯罪所得，而予以收受，掩饰、隐瞒犯罪所得，情节严重，其行为已构成掩饰、隐瞒犯罪所得罪。黄蕾虽主动投案，但由于在原审法院及终审法院审理过程中，对基本事实均翻供，法院依法其行为不认定其构成自首。\n\n法院考虑到黄蕾主动投案，对破案具有积极作用，且全额退赃，对其酌情从轻处罚。法院终审作出改判：维持黄埔区法院原判决第二项，没收退缴的150万元赃款，上缴国库。撤销黄埔区法院原判第一项，改判上诉人黄蕾犯掩饰、隐瞒犯罪所得罪，判处有期徒刑3年，并处罚金5万元。[![](http://p2.ifengimg.com/a/2016/0810/204c433878d5cf9size1_w16_h16.png)​​​​​​​](http://www.ifeng.com/)"
		},
		{
			"post_id": 17,
			"title": "所以发勒索病毒那团队到底赚了多少？",
			"date_published": 1494983223.449,
			"body": "阿里的某APP上说约合10W人民币。有的媒体说几百万人民币。。。",
			"tag": "钱,tag"
		},
		{
			"post_id": 16,
			"title": "软件开发过程中需求真的占了太多时间了",
			"date_published": 1494899093.859,
			"body": "编码时间仅仅占了30%。\n\n需求却占了50%。\n\n前期需求做好，真的太重要"
		},
		{
			"post_id": 15,
			"title": "最新勒索病毒在国内是没有前途的",
			"date_published": 1494825432.244,
			"body": "支付方式用比特币，这明显就是让我们国人不懂得咋付。\n\n600刀也好，300刀也罢。国人有钱也不知道咋付啊。。。\n\n所以，所谓的勒索病毒，在国内是没有出路的。\n\nTAG:A,B,C"
		},
		{
			"post_id": 14,
			"title": "勒索病毒发生变种",
			"date_published": 1494772831.882,
			"body": "监测发现，在全球范围内爆发的WannaCry 勒索病毒出现了变种：WannaCry 2.0， 与之前版本的不同是，这个变种取消了Kill Switch，不能通过注册某个域名来关闭变种勒索病毒的传播，该变种传播速度可能会更快。请广大网民尽快升级安装Windows操作系统相关补丁，已感染病毒机器请立即断网，避免进一步传播感染。\n\n　5月12日全球多个国家遭受一种勒索软件的攻击。受害者包括中国一些高校和英国多家医院。据了解，这种勒索软件是不法分子利用了美国国家安全局网络武器库中泄漏出的黑客工具。\n\n---\n\n* * *\n\n　　复旦大学美国研究中心副研究员汪晓风在接受澎湃新闻采访时认为，这次袭击属于有组织网络犯罪的范畴，针对的是漏洞，而不是特定对象，随着微软、各网络安全公司和各国政府的重视，并及时提出技术应对措施，网络勒索得手难度会增大，扩张势头应该很快得到抑制。\n\n　　据报道，电脑被这种勒索软件感染后，其中文件会被加密锁住，支付黑客所要求赎金后才能解密恢复。据悉，勒索金额最高达5个比特币，目前价值人民币5万多元。\n\n　　汪晓风表示，此前也不乏有黑客通过网络攻击获利的事情发生，但此前的攻击大多指向中央银行或金融机构之类的大型机构。而这次黑客对单个袭击对象勒索的金额并不大，属于“走量”，通过扩大攻击的规模来保证获利的最大化。\n\n　　新华社13日援引俄罗斯网络安全企业卡巴斯基实验室发布的一份报告说，这次网络攻击所用的黑客工具“永恒之蓝”，来源于美国国家安全局的网络武器库。\n\n　　今年4月14日，一个名为“影子中间人”的黑客组织曾经进入美国国家安全局(NSA)网络，曝光了该局一批档案文件，同时公开了该局旗下的“方程式黑客组织”使用的部分网络武器。据报道，其中包括可以远程攻破全球约70% “视窗”系统(Windows)机器的漏洞利用工具。经紧急验证这些工具真实有效。\n\n　　据了解，这些曝光的文件包含了多个Windows“神洞”的利用工具，不需要用户任何操作，只要联网就可以远程攻击，和多年前的冲击波、震荡波、Conficker等蠕虫一样可以瞬间血洗互联网。\n\n　　据美国有线电视新闻网(CNN)4月15日报道，公开这些网络武器正是这个名为“影子中间人”(Shadow Brokers)的黑客组织。报道称，这批网络武器针对安装有微软公司windows系统的电脑和服务器的安全漏洞，可能会被用于攻击全球银行系统。\n\n　　实际上早在去年，“影子中间人”就已经窃取了美国国家安全局的网络武器。2016年8月13日，黑客组织“影子中间人”通过社交平台称，已攻入美国国家安全局(NSA)的网络“武器库”——“方程式组织”，并泄露了其中部分黑客工具和数据。\n\n　　据CNN报道，该黑客组织曾经尝试在网络上出售这批网络武器，但是未能成功。据报道，该黑客组织曾经宣称如果他们收到100万个比特币(总价值约为5.68亿美元)，就会公布所有工具和数据。\n\n　　美国“截击”网站2016年8月19日证实，根据“棱镜门”事件曝光者、爱德华·斯诺登提供的最新文件，黑客组织此前称要在网上拍卖的强悍“网络武器”携带有美国国家安全局(NSA)的虚拟指纹，因此显然属于该局使用的黑客工具，其中不少可秘密攻击全球计算机。据报道，最重要的证据，来源于斯诺登最新提供的一份绝密文件——美国国家安全局“恶意软件植入操作手册”。\n\n　　汪晓峰表示，很多系统漏洞是由NSA先发现的，但并不告知公众，而是故意利用漏洞来开发网络武器和实施网络攻击。虽然从法律上NSA并没有义务向公众公开自己发现的漏洞，但这至少可以说明美国政府在类似问题上对公众利益不够重视。\n\n　　据媒体报道，“方程式组织”开发机构实际上与美国国家安全局关系密切，是一个该局可能“不愿承认的”部门，这在黑客圈几乎是尽人皆知的秘密。“方程式组织”的开发机构已经活跃近20年，是全球技术“最牛”的黑客组织。"
		},
		{
			"post_id": 13,
			"title": "Windows 10 安装密钥",
			"date_published": 1494756503.976,
			"body": "安装密钥不等于激活密钥\n\n仅用于安装的时候使用，可以让安装程序辨识。\n\n安装之后，还是需要进行正版激活的。\n\nW269N-WFGWX-YVC9B-4J6C9-T83GX\n\n----\n\n具体激活工具，请自行google"
		},
		{
			"post_id": 11,
			"title": "谷歌有哪些使用技巧?",
			"date_published": 1494564984.466,
			"body": "1.搜索指定格式的文档可以输入“filetype:后缀名 文件名”。例如需要搜索java的相关的pdf文档，可以查询“filetype:pdf java”。\n\n2。查询一个单词的解释可以输入“define:word”。例如需要搜索stupid的解释，搜索框输入define:stupid即可出现解释。\n\n3。搜索指定站点的指定内容可以用“site:网址 搜索内容”。比如需要搜索知乎上的关于装逼的内容可以在搜索框内输入“site:[http://zhihu.com](http://zhihu.com) 装逼”。\n\n* * *\n\n4。搜图神器google [images，https://images.google.com/。可以上传图片，搜索结果会返回相似的图片。](http://images，https://images.google.com/。可以上传图片，搜索结果会返回相似的图片。)\n\n谷歌还开发了相同功能的安卓端app，叫google [googles，https://play.google.com/store/apps/details?id=com.google.android.apps.unveil。此app不仅有以图搜图的功能，还能把图片转换成文字，对英语的识别率几近百分之百…](http://googles，https://play.google.com/store/apps/details?id=com.google.android.apps.unveil。此app不仅有以图搜图的功能，还能把图片转换成文字，对英语的识别率几近百分之百…)\n\n5。计算器功能。搜索框内输入任意的数学表达式，会返回计算结果。\n\n6。剔除搜索结果中不相关的内容可以用“搜索内容 -需要剔除的内容”。比如想搜索“开复”，可是不想看到李开复的相关内容，你可以在搜索框内键入“开复 -李”。\n\n7。不知道搜索什么样的关键词的时候，也可以考虑输入你所能想到的最接近的关键词，然后参考页面底部提供的相关搜索里的关键词。\n\n8。输入一个函数，会返回这个函数的图像，例如搜索sqrt(1-(abs(x)-1) 2, arccos(1-abs(x))-pi"
		},
		{
			"post_id": 9,
			"title": "撮鸡鸡狂魔白百合",
			"date_published": 1494319490.131,
			"body": " "
		},
		{
			"post_id": 8,
			"title": "安装WINDOWS office 2010 错误1406解决办法",
			"date_published": 1494249684.528,
			"body": "这个办法是我在网上找的，因为网上说的很不清楚，我现在就用我自己已经成功的来给大家介绍。\n1.打开注册表\n2.编辑-查找-输入:Image File Execution Options\n3.在左边的“Image File Execution Options”选项上点击右键，选择“权限”\n4.出现“Image File Execution Options”权限后，点击”组或用户“下面的“添··-加”或者按\"ALT+D.\"\n\n----\n\n5.在出现的“选择用户和组”窗口中点击“高级”\n6.这时候“选择用户和组”窗口就变大了。我们点击“立即查找”。\n7.在出现的“名称”中选择当前你登陆的账号名称（如果你没改的话一般为：administration）选中后点击确定按钮、\n\n8.这时候窗口就返回到小窗口了。点击确定。\n9.我们返回到了“Image File Execution Options”\n10.我们在权限的选项中“完全“控制打上勾。”读取“也打上勾。\n点击确定"
		},
		{
			"post_id": 7,
			"title": "改样式后，新博文的标题背景为白色，字体也为白色了",
			"date_published": 1494239757.823,
			"body": "妈了个蛋，还真不知道怎么调整回来。。。。"
		},
		{
			"post_id": 5,
			"title": "可用的代理\t",
			"date_published": 1494236458.405,
			"body": "新博客没有代理简直不能访问，一直提示找不到节点。\n\n整理几个刚刚测试可用的代理点：\n\n[http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n](http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n)\n\n这个在Add a new site to the list: 中输入你的完整地址，点击Submi link即可\n\n[https://fuckcf.cf/1Fvbkbw9Dc2SR2irHpQzPtZHqJKfc4tiYp](https://fuckcf.cf/1Fvbkbw9Dc2SR2irHpQzPtZHqJKfc4tiYp)\n\n[推荐]，将/后面的我的博客地址改为你的，然后访问一次即可。\n\n[https://proxy1.zeronet.functor.xyz:10443/1Fvbkbw9Dc2SR2irHpQzPtZHqJKfc4tiYp](https://proxy1.zeronet.functor.xyz:10443/1Fvbkbw9Dc2SR2irHpQzPtZHqJKfc4tiYp)\n\n[https://zeroml.ml/wotank.bit](https://zeroml.ml/wotank.bit)\n\n[https://www.zerogate.tk/wotank.bit](https://www.zerogate.tk/wotank.bit)\n\n[https://zeronet.maxweiss.io/wotank.bit](https://zeronet.maxweiss.io/wotank.bit)\n\nTOR地址：\n\n[http://cvhb5yx2qdclb76m.onion/wotank.bit](http://cvhb5yx2qdclb76m.onion/wotank.bit)\n\n[推荐]，将/后面的我的博客地址改为你的，然后访问一次即可。\n\n更多代理，可以在下面的链接中找到。\n\n[http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies)"
		},
		{
			"post_id": 4,
			"title": "my bitmessage",
			"date_published": 1494234590.359,
			"body": "you can send message for me\n\naddress is: BM-2cSz93vcXZjCceAkEXsEV5CDXpfay5AWD2"
		}
	]
}