{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Авторизация через соцсети",
			"body": "Скажу сразу, я не рассматриваю `ZeroNet` с точки зрения анонимности вообще. Кто хочет анонимности - вам в `I2P` или `FreeNet` (кстати архитектурно очень похожий на ZeroNet, но с совершенно параноидальной ставкой на анонимность). Кроме того, анонимности можно легко добиться и в обычном интернете. У децентрализованных сетей же есть огромные преимущества, не связанные с анонимностью, которые, в том числе, достаточно подробно изложены @shift в одной из его статей на хабре https://habrahabr.ru/post/239225/\n\n## Мотивация\nТак зачем авторизация через соцсети? Основная причина - повышение доверия к аккаунтам. Зарегистрировать аккаунт на ZeroID ужасающе легко, это можно делать скриптом, получать аккаунты пачками. Отсюда отсутствие возможности модерации, отсюда анархия. Благодаря авторизации через соцсети мы по сути делегируем регистрацию аккаунта соцети. Если в соцсети можно регистрировать аккаунты пачками и скриптом, хммм, по крайней мере это уже не наши проблемы. Таким образом, юзеры, авторизованные через доверенные ресурсы (напр. гугл) получают и больше доверия на ресурсах ZeroNet. Это может быть выражено, например, в ограничении дискового пространства.\n\n## Планы реализации\nКак работает авторизация в ZeroNet я описал здесь http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC/+ZeroID\nДля упрощения будем рассматривать только авторизацию через гугл.\nДля авторизации в любом случае нужен внешний ресурс, т.е. обычный сервер и обычный же домен. Далее просто `сервер`. И конечно же нужен ресурс внутри ZeroNet с namecoin доменом. Далее просто `сайт`\n1. Юзер заходит на `сайт`\n2. Так же как на ZeroID, если у юзера не найден сертификат данного сайта, появляется кнопка с предложением регистраци.\n3. Кнопка является прямой ссылкой к accounts.google.com со всеми необходимыми параметрами\n4. Гугл просит юзера подтвердить авторизацию (с этого момента начинается OAuth2, но все равно распишу подробно)\n5. После подтверждения юзер перенаправляется на `сервер`, в URL параметре присутствует код потверждения авториазции\n6. Сервер отправляет код на сервера гугла, подтверждая авторизацию, и получает данные о пользователе. (На данном этапе мы по сути авторизовались через гугл на казалось бы стороннем, не связанным с ZeroNet сайтом)\n7. Здесь у нас откуда-то должен появиться юзернейм. Можно бы взять адрес почты (и снести @gmail.com), но это как-то уж... даже по моим меркам, просто так палить почту... А можно вернуть юзеру форму для указания юзернейма. Тогда придется еще и установить куки.\n8. После получения юзернейма все идет по тривиальной схеме, так же как на ZeroID (читать по ссылке выше).\n\nОстаются некоторые нерешенные вопросы.\n1. Можно ли на один юзернейм вешать несколько ключей? Что если, например, юзер авторизируется с дргуго устройства (с другим ключом)? Может ли юзер заменить сертификат (например, при утере ключа)?\n2. Должен ли сервер хранить сопоставление юзернейма и гугл аккаунта? Очевидно, если он не будет хранить эти данные, какое-либо дальнейшее управление аккаунтом (напр. добалвение ключей) будет невозможным. Если будет, то как он должен их использовать?\n\nДалее, если добавить в схему другие соцсети. Это должны быть разные ресурсы для разных соцсетей, или один ресурс, но в зависимости от соцсети в сертификат будет записывать разный auth_type? Если второй вариант, то получается один неймспейс для всех юзернеймов (непонятно, плюс это или минус). Если юзер авторизируется через несколько соцсетей сразу, можно ли комбинировать auth_type (указывать несколько, через сепаратор)? По идее это немного усложнит регэкспы, но должно работать (надо бы с разрабом ZeroNet'а побазарить по поводу \"стандартизации\" такой мультиавторизации).\n\n#\n\nПредлагаю обсудить все пункты, особенно спорные вопросы. Также я открыт для любых предложений.\n\n#\n\n**UPD1**:\n\nВ общем, изучил, что будет, если выписать себе несколько сертификатов. Это было довольно предсказуемо. Предположим, у юзера был публичный ключ 111, и он выписывает себе новый сертификат для 222 на тот же юзернейм. Соответственно, раньше файлы юзера хранились в data/users/111, теперь будут в data/users/222. ZeroNet-ноде вообще пофигу, что у них одинаковый юзернейм, она будет считать их разными пользователями. Например, лимит занятого пространства будет считаться с нуля. Так что выдавать 2 сертификата никак нельзя. Но что если юзер потерял приватный ключ? Т.е. что получается, гугл аккаунт привязан к чему-то, юзернейм есть, а использовать его нельзя. Отозвать сертификат невозможно: выдан однажды - выдан навсегда.  По-моему потеря ключа - достаточно правдоподобный сценарий. Нужно придумать какую-от схему отзыва сертификата. Естественно, это невозможно без поддержки со стороны ZeroNet. Any ideas?",
			"added": 1457378506
		},
		{
			"topic_id": 2,
			"title": "Кто что скажет о Diaspora?",
			"body": "Слышу о проекте давно, но что-то до сих пор не знаю ничего конкретного. И даже @shift не писал о нем на хабре. Может кто пробовал. Как вам оно?",
			"added": 1488071261
		}
	],
	"topic_vote": {
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": 1,
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": 1,
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1
	},
	"next_comment_id": 282,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "@shift Написал бы что-то вроде дайджеста, что за год произошло в p2p: как там cjroute, twister, поживают, а то год уже тебя на хабре не видать, а тут зеронет вдруг, с чего бы это?",
				"added": 1457219227
			},
			{
				"comment_id": 2,
				"body": "> [nippletwister](#comment_250_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А никто не вникал, этот сайт работает или это просто картинка?http://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHeУ меня показывает пустоту, но может это из-за включенного TOR?\n\nОн делает запрос на внешний сервер из твоего браузера, сервер видит твой ip. Достаточно заблокировать трафик куда-либо кроме локалхоста, или в tor завернуть",
				"added": 1457220211
			},
			{
				"comment_id": 3,
				"body": "Короче, план такой:\n1. Создаем видеостриминговый сервис. По-моему, для этого даже не нужна поддержка ZeroNet'а - можно делить видео на энное количество небольших файлов (по 4 Кб, например) и запрашивать их по надобности\n2. Добавляем в ZeroNet поддержку обычных торрентов (в виде плагина должно покатить)\n3. Интегрируем в ZeroNet что-то вроде torrents-time, т.е. видеоплеер для обычных торрентов\n4. Создаем общую БД по всем существующим трекерам\n5. Запиливаем нормальные инсталляторы \"в один клик\"\n6. О ZeroNet пишут в Times\n7. Прибывают миллионы пользователей\n8. Копирасты плачут кровавыми слезами\n(плюсуйте, если поддерживаете)",
				"added": 1457272525
			},
			{
				"comment_id": 4,
				"body": "WebTorrent - протокол с торрентом несовместимый сам по себе. Для него нежны транзитные ноды (которые умеют и Torrent, и WebTorrent), да и для зеронета это бесполезно. Достаточно залинковать libtorrent и добавить в API несколько функций",
				"added": 1457273860
			},
			{
				"comment_id": 5,
				"body": "> [mangust](#comment_3_1NxrvhVZwz4YsrYp3ZSCs4aDvw2gFud47M): Это можно как-то сделать через плагины?\n\nНе вижу никаких проблем. Мы добавляем таким образом новое API, на затрагивая старое. Плагин как раз то что нужно.",
				"added": 1457274116
			},
			{
				"comment_id": 6,
				"body": "> [splitfire](#comment_29_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): вы вообще про что, какая несовместимость протокола с торрентом? курил что ли, и на страницу не ходил, там джаваскрипт, который ты вставляешь себе на страницу и усё\n\nПросто оставлю это здесь https://habrastorage.org/files/d3c/761/b9e/d3c761b9e79b455c96e8bced53756d64.png",
				"added": 1457275628
			},
			{
				"comment_id": 7,
				"body": "> [splitfire](#comment_30_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): https://webtorrent.io/faq сразу бы сюда посылал\n\nТак кто и что курит-то все-таки?)",
				"added": 1457275759
			},
			{
				"comment_id": 8,
				"body": "Если так подумать, почему закрылся оригинальный Popcorn-time и несколько его форков? Разработчики не были анонимусами, так им либо угрожали, либо закинули бабла. В ZeroNet есть функция удаления сайта. Достаточно закинуть бабла владельцу. Вся неподцензурность сразу ломается",
				"added": 1457278064
			},
			{
				"comment_id": 9,
				"body": "Владелец может удалить сайт, он удалится у всех сидеров",
				"added": 1457280052
			},
			{
				"comment_id": 10,
				"body": "> [mangust](#comment_6_1NxrvhVZwz4YsrYp3ZSCs4aDvw2gFud47M): Как-то странно, что создатель сайта может удалить кеш у всех посетителей. Это точно? Предлагаю провести эксперимент.\n\nТак в FAQ написано. Ну и сам подумай, владелец может модифицировать сайт. Значит он может его в ноль модифицировать, по сути удаление.",
				"added": 1457283534
			},
			{
				"comment_id": 11,
				"body": "Я тут пилю авторизацию через гугл. Вроде @shift что-то вроде этого собирался делать",
				"added": 1457288514
			},
			{
				"comment_id": 12,
				"body": "> [gomzik](#comment_220_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Где о нас написали кроме опеннета?\n\nХабр, ЛОР",
				"added": 1457289337
			},
			{
				"comment_id": 13,
				"body": "https://habrahabr.ru/post/278615/",
				"added": 1457289394
			},
			{
				"comment_id": 14,
				"body": "> [coyc](#comment_1_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): есть вопрос такого характера: мой ip же скрывается тором, ведь так?\n\nТы ведь в браузере сидишь. Сайту достаточно загрузить внешний ресурс, и ip палится.",
				"added": 1457289826
			},
			{
				"comment_id": 15,
				"body": "> [coyc](#comment_3_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): в чем суть тора тогда в данном случае?\n\nЕсли в браузере заблокировать все запросы, кроме локалзоста (т.е. юзать отдельный браузер), палиться не будет",
				"added": 1457289901
			},
			{
				"comment_id": 16,
				"body": "Или Tor Browser просто использовать",
				"added": 1457289950
			},
			{
				"comment_id": 17,
				"body": "Я предлагаю не рассматривать зеронет с точки зрения анонимизации. Кто хочет анонимности, юзайте i2p или вконец параноидальный FreeNet",
				"added": 1457290010
			},
			{
				"comment_id": 18,
				"body": "Я скорее о том, что эта сеть НАКОНЕЦ-ТО может показать другие преимущества децентрализованного веба, кроме анонимности. Про них shift многократно писал на хабре. Вот, например https://habrahabr.ru/post/239225/",
				"added": 1457290228
			},
			{
				"comment_id": 19,
				"body": "> [splitfire](#comment_55_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): причем заметил что соединений по тору больше нежели обычных, видимо это специально\n\nМного людей ставят \"только Tor\", поэтому с ними можно соединиться только так",
				"added": 1457290398
			},
			{
				"comment_id": 20,
				"body": "> [splitfire](#comment_56_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): опция --tor allways или как-то там?\n\nВ ZeroHello справа вверху есть кнопочка. Enable Tor for every connections (slower)",
				"added": 1457290500
			},
			{
				"comment_id": 21,
				"body": "> [splitfire](#comment_58_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): я ее не тестил, что она делает?\n\nZeroNet будет работать только через Tor",
				"added": 1457290568
			},
			{
				"comment_id": 23,
				"body": "Черт, я перечитал и не понял ничерта =D\nЧем эти варианты отличаются вообще? ZeroNet коннектится только через тор, значит только его порт юзается. И все соединения через тор идут. Они не противоречат друг другу",
				"added": 1457290790
			},
			{
				"comment_id": 24,
				"body": "пффф",
				"added": 1457290928
			},
			{
				"comment_id": 25,
				"body": "1. Каждая нода ZeroNet поднимает свой Tor hidden service\n2. Каждая нода ZeroNet соединяется с другими нодами как через Tor hidden service, так и напрямую на хост: порт\n3. Можно отключить то или другое в настройках.\n\nКакие еще вопросы?",
				"added": 1457291006
			},
			{
				"comment_id": 26,
				"body": "По hidden services все. exit-ноды не используются",
				"added": 1457291067
			},
			{
				"comment_id": 28,
				"body": "> [splitfire](#comment_65_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): где отключаются хост:порт?\n\nZeroHello http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/\nПравый верхний угол жмешь, второй пункт",
				"added": 1457291169
			},
			{
				"comment_id": 29,
				"body": "Хехе, можно удалять коммент и писать его заново, таким образом поднимая в истории :)",
				"added": 1457291192
			},
			{
				"comment_id": 30,
				"body": "> [leinariys](#comment_19_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Что это это отключение Даёт?\n\n(facepalm) Все, я сдаюсь",
				"added": 1457291277
			},
			{
				"comment_id": 31,
				"body": "> [splitfire](#comment_69_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): и опять возвращаемся: проверял самостоятельно?\n\nНет, не проверил, я читал блог разрабочик, там так написано.",
				"added": 1457291312
			},
			{
				"comment_id": 32,
				"body": "> [splitfire](#comment_70_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): ссылку не потрудишься прикрепить? :)\n\nСсылка в том же ZeroHello висит http://127.0.0.1:43110/Blog.ZeroNetwork.bit",
				"added": 1457291642
			},
			{
				"comment_id": 34,
				"body": "Ну все, я разобрался, как ZeroId работает (хех, никогда CoffeeScript в глаза не видел, а все довольно понятно). Сейчас будем авторизацию через google acc прикручивать",
				"added": 1457295082
			},
			{
				"comment_id": 35,
				"body": "А можно делать сайты с модерацией и вполне себе классическим баном =)",
				"added": 1457295859
			},
			{
				"comment_id": 37,
				"body": "@shift, даров. Я тут авторизацию через гугл запиливаю. Ты вчера что-то говорил по этому поводу, еще не передумал?)",
				"added": 1457308310
			},
			{
				"comment_id": 38,
				"body": "> [shift](#comment_160_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Всецело за! не говорю что это будет only но как опция для повышения лимита - шикарно, ты как клон zeroid пилишь?\n\nДа. А вообще буду рад лично пообщаться. Мой юзернейм здесь соответствует скайпу, hangouts, и TOX (Ну или 1D6F0445DF17E58DE0392C3BE79CD7C9967CC647B47D7EA7612B21877154A12CB986B463D837)",
				"added": 1457308528
			},
			{
				"comment_id": 39,
				"body": "А вот это уже я не юзаю",
				"added": 1457308757
			},
			{
				"comment_id": 40,
				"body": "Короче самая большая проблема - отсутствие информации. Ничерта не гуглится вообще, приходится по 4 часа дебажить, выясняя потом, что параметр в content.json какой-то неправильно поставил",
				"added": 1457308835
			},
			{
				"comment_id": 41,
				"body": "Весь день сегодня ковыряю) Не сказать, что доволен всем этим",
				"added": 1457308870
			},
			{
				"comment_id": 42,
				"body": "Ну и неймкоин весь день свою базу выкачивает. HDD плавится уже",
				"added": 1457308992
			},
			{
				"comment_id": 43,
				"body": "Кстати, я тут ниже высказывал одну мысль, но мне даже самому уже влом ее искать в этой горе флуда. Запилить в зеронет обычные торренты и онлайн плеер - что-то вроде popcorn-time. Тогда про нас сразу в Times напишут",
				"added": 1457309114
			},
			{
				"comment_id": 45,
				"body": "Короче иду спать в плохом настрении. Решето дырявое этот зеронет=) Засабмитил issue https://github.com/HelloZeroNet/ZeroNet/issues/331\n\nЗавтра буду сайт с демонстрацией уязвимости пилить)",
				"added": 1457318455
			},
			{
				"comment_id": 46,
				"body": "В ZeroHello можно удалить любой сайт. Притом, что это ZeroHello - как бы сторонний сайт сам по себе. Т.е. любой сайт может удалить любой сайт. Меня это не особо беспокоило, т.к. при попытке удаление в правом верхнем углу появится требование подверждения. Мне казалось, это подверждение ядром генерируется, и ни один сайт без подтверждения пользователя ничего не удалит. Ан нет, сайтом оно генерируется. Т.е. скриптом можно удалять без подтверждения пользователя. Решето",
				"added": 1457353971
			},
			{
				"comment_id": 47,
				"body": "Может откроешь ZeroHello и потыкаешь по кнопкам для разнообразия? Тогда может допрет, что означает термин \"удалить\" в данном контексте",
				"added": 1457354511
			},
			{
				"comment_id": 48,
				"body": "Issue не об этом. Это уже следующая хрень =)",
				"added": 1457358011
			},
			{
				"comment_id": 49,
				"body": "Отменяется. Попытался воспроизвести - не воспроизводится. Порылся в исходниках получше, нашел пермишаны/",
				"added": 1457358704
			},
			{
				"comment_id": 50,
				"body": "Сейчас live example допилю",
				"added": 1457358746
			},
			{
				"comment_id": 52,
				"body": "http://127.0.0.1:43110/1G9sW6n1wqhUnoHLKEkycKM8sVgazFvFc",
				"added": 1457360332
			},
			{
				"comment_id": 53,
				"body": "Да и это тоже минорщина так-то. В худшем случае юзеру придется вручную открыть users.json и поудалять оттуда лишние записи",
				"added": 1457360759
			},
			{
				"comment_id": 54,
				"body": "Угу, сертификат должен быть подписан приватным ключем с самого zedoid.bit. Я же не могу этого сделать",
				"added": 1457361956
			},
			{
				"comment_id": 55,
				"body": "> [gomzik](#comment_246_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): ну неплохо все равно, обнови ишью этим примером чтоле\n\nЯ уже не только обновил, но и разраб уже ответил =)",
				"added": 1457362033
			},
			{
				"comment_id": 56,
				"body": "Разметку сообщений запили иерархическую, как на хабре =)",
				"added": 1457362579
			},
			{
				"comment_id": 57,
				"body": "> [shift](#comment_174_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): иии? шо там то?\n\nДа ничего особенного. Как обычно \"и так норм\"\nhttps://github.com/HelloZeroNet/ZeroNet/issues/331",
				"added": 1457363749
			},
			{
				"comment_id": 58,
				"body": "> [splitfire](#comment_92_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): The domain plugin is optional and not restricting it by site domain would allow to recover your ID even if ZeroID site is disappear for some reasons.четне похоже на \"и так норм\"\n\nЭто ответ на мое конкретное предложение (вероятно не самое удачное). А проблема решается в стиле \"и так норм\"",
				"added": 1457364506
			},
			{
				"comment_id": 59,
				"body": "Хотя я и не исключаю, что и правда и так норм",
				"added": 1457364608
			},
			{
				"comment_id": 60,
				"body": "> [splitfire](#comment_93_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): так над каким сайтом то работал?\n\nэээ... чего-чего?",
				"added": 1457364656
			},
			{
				"comment_id": 61,
				"body": "> [splitfire](#comment_94_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): что сделать то хотел на основе зеронета\n\nZeroID, ты хотел сказать? Я авторизацию через гугл пилю. В будущем через все соцсети",
				"added": 1457364714
			},
			{
				"comment_id": 62,
				"body": "Я не рассматриваю эту сеть с точки зрения анонимности вообще. Ищите анонимность в i2p",
				"added": 1457364791
			},
			{
				"comment_id": 63,
				"body": "zeroID централизованный. При регистрации ты отправляешь обычный POST запрос на их сервер. Можно через bitMessage, но сервер от этого никуда не пропадает. Я не считаю, что однократная авторизация мешает дальнейшей децентрализации",
				"added": 1457364920
			},
			{
				"comment_id": 64,
				"body": "Вот я и делаю свой еще один zeroID. С авторизацией через соцсети. Кому не надо может не юзать",
				"added": 1457365105
			},
			{
				"comment_id": 65,
				"body": "Хотя ZeroID - это на самом деле не про авторизацию, а про сопоставление приватного ключа и юзернейма",
				"added": 1457365166
			},
			{
				"comment_id": 66,
				"body": "Ну... приватный ключ можно бы и так юзать, без всякого центрального ресурса",
				"added": 1457365238
			},
			{
				"comment_id": 67,
				"body": "Кхм, публичного, извиняюсь, ключа",
				"added": 1457365291
			},
			{
				"comment_id": 68,
				"body": "Не, нельзя.",
				"added": 1457366823
			},
			{
				"comment_id": 69,
				"body": "У сайтов, оказывается, пермишаны есть. Я, правда, не нашел, где эти пермишаны выдаются (кроме как в конфиге вручную), но по умолчанию стартовой странице (т.е. ZeroHello) выданы все права",
				"added": 1457366894
			},
			{
				"comment_id": 70,
				"body": "> [kostanew](#comment_7_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А можно как-нибудь реализовать вход через соцсети к уже созданным zeroid аккаунтам? Мне было бы это интересно, так как я с самого начала сижу под неанонимным ником, совпадающим с vk.\n\nЗдесь ответ не просто НЕТ, все намного хуже=) Приватный ключ, который генерируется для ZeroID (или любого сайта, в принципе) не покидает недр ZeroNet-ноды. На то он и приватный) Даже если вход через гугл, положим, приватный ключ остается только у тебя на устройстве. Попробуешь зайти с другого - и вот тут начинаются вопросы)",
				"added": 1457367236
			},
			{
				"comment_id": 72,
				"body": "Я пока не знаю, можно ли несколько ключей на один юзернейм вешать, точнее как на это нода отреагирует, будет ли правильно занятое пространство считаться и т.п. (что-то предполагаю, что нельзя вообще так). Но в любом случае, новый ключ - старыми сообщениями уже управлять не сможешь, так что это бредово. Доверять приватный ключ серверу - хехе, не, это не вариант. Так что не сказать что все прекрасно здесь",
				"added": 1457367502
			},
			{
				"comment_id": 73,
				"body": "Кто-нибудь знает, тут можно грузить файлы с другого сайта? Грубо говоря картинку вставить с URL на другой домен внутри ZeroNet? В API что-то не вижу ничего такого.",
				"added": 1457368458
			},
			{
				"comment_id": 74,
				"body": "Хмм, ну картинка, вроде, вставляется. А в API методов для загрузки файлов с другого сайте не видать.",
				"added": 1457368671
			},
			{
				"comment_id": 75,
				"body": "Если все файлы сайта опциональны, то вроде ничего такого",
				"added": 1457368840
			},
			{
				"comment_id": 78,
				"body": "@shift У меня, кстати, тоже место кончается. Подкинь пока тут",
				"added": 1457368953
			},
			{
				"comment_id": 79,
				"body": "У меня редактировалка сообщений что-то сломалась, так что удаляю и посылаю заново",
				"added": 1457368998
			},
			{
				"comment_id": 80,
				"body": "Скоро кто-нибудь напишет скрипт, который будет по очереди создавать и удалять сообщений на свои 30 Кб =D",
				"added": 1457369159
			},
			{
				"comment_id": 81,
				"body": "На 5 пиров за 7 секунд (кажется) отправка идет. Потом на следующие 5. Видно это чтобы сеть не нагружать сильно",
				"added": 1457370218
			},
			{
				"comment_id": 86,
				"body": "Вынес обсуждение авторизации по соцсетям в отдельную тему http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF/",
				"added": 1457382062
			},
			{
				"comment_id": 87,
				"body": "Что-то тут с MarkDown'ом какие-то проблемы. Двойной перенос строки должен интерпретироваться как абзац, Перед заголовком также строка должна быть пропущена (маргин). Поправьте стили там",
				"added": 1457383001
			},
			{
				"comment_id": 88,
				"body": "> [esteban](#comment_58_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот тут биткоин-криптография, а мультисигнатуры возможны в дальнейшем?\n\nТам какие-то заглушки в исходниках стоят на это счет, т.е. да, возможно. Но что-то моей моей фантазии не хватает понять, зачем это может быть нужно",
				"added": 1457390717
			},
			{
				"comment_id": 89,
				"body": "> [esteban](#comment_60_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Чтобы можно было держать сайт сообща. Так допустим если одного прижмут, и потребуют удалить контент, то он один, без согласия других не сможет этого сделать. \n\nА, так это уже сейчас можно, см параметр signers_sign в content.json http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/site_development/content_json/\n\n\n> [esteban](#comment_60_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Другой вариант,  это в дальнейшем, в некоторых приложениях может потребоваться гарант, тогда это тоже могло бы быть на мультисигнатурах реализовано.\n\nА вот это нельзя пока, но опция signs_required (количество необходимых подписей) уже есть, просто пока не используется",
				"added": 1457391041
			},
			{
				"comment_id": 90,
				"body": "Да ёлы палы, не дочитал я твое сообщение до конца=)\nДержать сайт вдвоем с разными подписями по идее можно, но никакого \"согласия других\" пока нет, каждый имеет полные права",
				"added": 1457391264
			},
			{
				"comment_id": 91,
				"body": "В исходниках заглушка http://c2n.me/3vhiUXb.png",
				"added": 1457391362
			},
			{
				"comment_id": 92,
				"body": "А вообще интересное дело. Они бы там хоть комментарий чутка развернутее написали, а то почему заглушка-то, непонятно же ничерта =)",
				"added": 1457391502
			},
			{
				"comment_id": 93,
				"body": "@shift Поправь стили абзацев статьи. all.css:236 .topic .body p, .topic .body h1, .topic .body h2 { margin-top: 0.5em; }\nА то текст сливается, смотрится ужасно",
				"added": 1457404453
			},
			{
				"comment_id": 94,
				"body": "Так, у кого еще были проблемы с в хроме с \"Message wrapper_nonce error, please report!\"? На хабре многие об этом писали. Я нашел причину: это FriGate.",
				"added": 1457408686
			},
			{
				"comment_id": 95,
				"body": "> [vlad20012](#comment_93_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): @shift Поправь стили абзацев статьи. all.css:236 .topic .body p, .topic .body h1, .topic .body h2 { margin-top: 0.5em; }А то текст сливается, смотрится ужасно",
				"added": 1457434170
			},
			{
				"comment_id": 96,
				"body": "@shift И на хабре внизу жаловались на ошибки. Чиркани им, что дело в FriGate (или, возможно, еще каком-то расширении) https://github.com/HelloZeroNet/ZeroNet/issues/306",
				"added": 1457434311
			},
			{
				"comment_id": 100,
				"body": "> [qw](#comment_12_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Как майор может вычислить, что ты раздаёшь запрещённый контент?\n\nЕсли юзать Tor - никак. А так список всех находящихся у тебя файлов публикуется на трекер",
				"added": 1457450371
			},
			{
				"comment_id": 101,
				"body": "> [splitfire](#comment_122_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): какой еще трекер?\n\nВ общем-то на разные. Вот полный список:\n```\n\"zero://boot3rdez4rzn36x.onion:15441\",\n\"zero://boot.zeronet.io#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441\",\n\"udp://tracker.coppersurfer.tk:6969\",\n\"udp://tracker.leechers-paradise.org:6969\",\n\"udp://9.rarbg.com:2710\",\n\"http://tracker.aletorrenty.pl:2710/announce\",\n\"http://explodie.org:6969/announce\",\n\"http://torrent.gresille.org/announce\"\n```",
				"added": 1457451488
			},
			{
				"comment_id": 103,
				"body": "> [esteban](#comment_61_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот, уже есть демонстрация загрузки контента через ipfs. Нужен запущенный демон, чтобы работало. \n> http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:9:Streaming+with+IFPS\n\nТам просто тег <video> стоит на URL локального IPFS или гейта. Не мудрено",
				"added": 1457451809
			},
			{
				"comment_id": 104,
				"body": "> [splitfire](#comment_126_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): погоди-ка, то ест ькаждый раз когда я посчу сообщеньице, оно в первую очередь рассылается на эти хардкоденные трекеры? чет, помоему не так\n\nНе само сообщение, а информация о том, что это сообщение у тебя есть. Т.е. его хэш (или что там в ZeroNet юзается для адресации, точно не знаю) и твой ip:port. Протокол точно такой же как в обычном bittorrent, никаких изменений. Таким образом трекер всегда знает, какие файлы у тебя находятся",
				"added": 1457452339
			},
			{
				"comment_id": 105,
				"body": "> [splitfire](#comment_129_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): ну так трекеры то захардкоденные? или как выбираются?\n\nЗахардкодены, да",
				"added": 1457452600
			},
			{
				"comment_id": 106,
				"body": "> [qw](#comment_14_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): И как этот хэш попадает к предположительному майору?\n\nНаоборот, зная хэш файла можно запросить у трэкера ip адреса юзеров, у которых этот файл имеется. Если юзер юзает тор, тогда вернется .onion адрес, который майору будет бесполезен. Хочешь анонимности - юзай тор.",
				"added": 1457452679
			},
			{
				"comment_id": 107,
				"body": "Обычно для избавления от трекера (торрент по magnet-ссылкам) используется DHT. Благодаря этому исчезает единая точка отказа (собственно трекер), но принцип не меняется - ip адреса публикуются не на трекер, а в DHT =)",
				"added": 1457453118
			},
			{
				"comment_id": 108,
				"body": "> [gomzik](#comment_259_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Там специальные трекеры, которые подмешивают рандомные айпи адреса. Но в целом же не реально сделать нормально соединенную сеть без узла для \"загрузки\\bootstrap\" хотя бы в первый раз и в качестве резервного способа.\n\nЭто да, но речь тут вроде и не об этом, а о том, что майор может узнать адреса юзеров, у которых есть тот или иной файл",
				"added": 1457453758
			},
			{
				"comment_id": 109,
				"body": "> [leinariys](#comment_37_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): *MyAnimeList *WorldArt *Shikimori *RanobeClub *ReadManga\n\nХороший выбор =)",
				"added": 1457461414
			},
			{
				"comment_id": 110,
				"body": "\"Message wrapper_nonce error, please report!\" В хроме исправлено в r957 https://github.com/HelloZeroNet/ZeroNet/issues/306",
				"added": 1457488697
			},
			{
				"comment_id": 112,
				"body": "Интернационализация ZeroTalk https://github.com/HelloZeroNet/ZeroTalk/pull/12",
				"added": 1457507650
			},
			{
				"comment_id": 113,
				"body": "> [shift](#comment_190_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): изменил SQL запрос который отображает сообщения, некоторых (двачеров?) до него я еще по ключевым словам блокировал\n\nХмм, ты же можешь банить точно так же, как лимит высталяешь, в пермишанах. Кроме того своей подписью владелец сайт может (в теории?) изменять данные пользователя. А ты как это делаешь, что-то я не понял",
				"added": 1457508472
			},
			{
				"comment_id": 114,
				"body": "> [shift](#comment_191_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): От того, что я ему поставлю лимит 0 - файлы не удалятся (насколько я тестировал) да и овервайтить контент админ же тоже не может если он с чужой подписью\n\nИз того, что я вычитал из исходников - может. Но я не тестил",
				"added": 1457508617
			},
			{
				"comment_id": 115,
				"body": "@shift На хабр-то напиши, что благодаря их сообщениям ошибка исправлена =)",
				"added": 1457516928
			},
			{
				"comment_id": 116,
				"body": "> [gomzik](#comment_268_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): я вот похвастался, а теперь снова словил. Какой-то мой экст мешает, но я как-то не готов их отрубить. В целом оно не постоянно и терпимо. Плюс наверное можно порновкладку использовать\n\nЭта ошибка уже недели 3, но пока что только я оказался настолько дотошным, чтобы продебажить, побазарить с разработчиками, и докопаться, таким образом, до сути проблемы. Пока остальные посылают жалобы в в пустоту =)\nВозьми и продабж, найди на каком сообщении оно валится, залей логи на гитхаб. Делов-то. У меня после обновления никаких проблем не было",
				"added": 1457518726
			},
			{
				"comment_id": 117,
				"body": "> [splitfire](#comment_141_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): и еще: как помочь руссифицировать zeronet?\n\nЧиркануть что-нибудь здесь, https://github.com/HelloZeroNet/ZeroNet/issues/285, упрашивать разработчика добавить API или запилить и прилать пулреквест.\nВ принципе, главное это API добавить. Это вроде не то что просто, а элементарно, не знаю чего разработчик ждет. Как будет API, любой сможет добавлять трансляции и пулреквесты слать",
				"added": 1457539276
			},
			{
				"comment_id": 118,
				"body": "> [splitfire](#comment_145_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): и везде один и тот же коммент \"ахах, изобрели фидо/фринет\"\n\nЯ юзал фринет. Вкратце юзать его невозможно. Это что-то для совершенно поехавших параноиков. А тут вроде работает, да неплохо (что удивительно, ибо питон же)",
				"added": 1457540016
			},
			{
				"comment_id": 119,
				"body": "> [netflow](#comment_2_1NPh8RCmZGPXpchZrLes9dhcSv5sNoPBiK): Сайты я так понял скачиваются полностью или только просмотренные посетителем страницы?\n\nОт сайта зависит. Можно настроить, какие файлы необходимы (страница не откроется, пока не загрузятся), а какие опциональны, и загружаются по запросу",
				"added": 1457540816
			},
			{
				"comment_id": 120,
				"body": "@shift Можешь попробовать вот что. Занули data.json какого-нибудь забаненного юзера, открой справа управление сайтом, и в самом низу впиши вместо content.json путь к content.json этого юзера. Sign&Publish. По идее ты должен затереть его данные таким образом. Только это надо на версии 966, там исправили что-то по этому поводу",
				"added": 1457541127
			},
			{
				"comment_id": 121,
				"body": "Разработчик предлагает подискутировать на тему локализации сайтов, поддерживаемой со стороны ZeroNet-ноды https://github.com/HelloZeroNet/ZeroTalk/pull/12",
				"added": 1457572900
			},
			{
				"comment_id": 123,
				"body": "> [gomzik](#comment_270_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А чего вы там велосипедите, есть же gettext, в том числе и для js (хоть там чуток сложнее, но в целом)\n\n(facepalm)\n\nДифф коммита глянь, там кода до смешного мало (20 строчек? И то это для загрузки ланг-файлов. А остальное - замены англ текста на ключи и сами лагн-файлы). Какие нах библиотеки... Разработчик ZeroNet просто хочет сделать это уровнем ниже - на самой ZeroNet-ноде, на питоне то есть.",
				"added": 1457593103
			},
			{
				"comment_id": 124,
				"body": "> [gomzik](#comment_272_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): так я все еще спрашиваю, почему для любых локализаций не использовать геттекст?\n\nПотому что можно и без него и сложнее не становится",
				"added": 1457593459
			},
			{
				"comment_id": 125,
				"body": "(По крайней мере в JS, что там на питоне будут юзать я уже не знаю, может и что-то подобное)",
				"added": 1457593520
			},
			{
				"comment_id": 126,
				"body": "> [gomzik](#comment_273_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): ну ну, можно и без него.\n> Посмотрю я на вас, когда вам придется локализировать строки а-ля \"\\d товар(а\\ов) в корзине\" на разные языки\n\nНа более сложный случай будет использована более тяжелая библиотека. В простом случае мудрить незачем. Если они будут писать бэкенд `на_все_случаи_жизни`, я надеюсь, они предусмотрят такой расклад",
				"added": 1457594448
			},
			{
				"comment_id": 127,
				"body": "@kostanew\nШрифт Robotia захардкожен в CSS файлы сайта в Base64 и в нем отсутствуют кириллические символы. Я как раз вчера решал ту же проблему. Нужно добавить кириллические версии Roboto. У меня такие объявления получились http://c2n.me/3vnCG2y.txt\nТ.е. тебе нужно удалить объявления Roboto в css/all.css (у тебя в блоге это 334 и 344 строки) и вписать вместо этого то что по ссылке.\n\nПо поводу опциональных файлов - ну хз, я вопроса тут не видел или не понял что-то. Так ответил бы.",
				"added": 1457616612
			},
			{
				"comment_id": 128,
				"body": "Ах да, в блоге же еще Tinos... Надо его русскую версию тоже вписать просто",
				"added": 1457620545
			},
			{
				"comment_id": 129,
				"body": "infobox.ru?",
				"added": 1457637721
			},
			{
				"comment_id": 130,
				"body": "> [shift](#comment_207_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): .ru сириусли? так он его как VPN сможет его юзать хотя бы\n\nУ них в Амстердаме сервера",
				"added": 1457637803
			},
			{
				"comment_id": 131,
				"body": "Rev986: Dont try to download banned user files\nНу вы поняли",
				"added": 1457697655
			},
			{
				"comment_id": 134,
				"body": "> [splitfire](#comment_150_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): https://github.com/HelloZeroNet/ZeroNet/issues/145 чет как-то тухло\n\nВообще довольно странно, что этим до сих пор никто не озаботился. Как авторизацию через соцсети доделаю (уже скоро), буду копать именно в этом направлении",
				"added": 1457702658
			},
			{
				"comment_id": 135,
				"body": "Ого, у gomzik отличный блог, что-то я раньше не видел. И не влом ему писать столько текста =)",
				"added": 1457709004
			},
			{
				"comment_id": 136,
				"body": "> [kostanew](#comment_61_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Посмотрел, будут банненые юзеры. Это очень здорово! На самом деле получается иерархическая система прав. Думаю что можно будет даже делать модераторов сообществ с разными правами, если немного покурить...\n\nТак это все и раньше было... Просто почему-то никто в интерфейсы добавлять такие функции не торопится. А так можно руками в конфиги вписывать",
				"added": 1457709638
			},
			{
				"comment_id": 137,
				"body": "@shift Это уже сейчас все можно =)",
				"added": 1457709712
			},
			{
				"comment_id": 138,
				"body": "> [kostanew](#comment_62_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Ладно, я еще покурю, видимо я чето не понял тогда...\n\nЧего конкретно? Напиши подробнее, объясню",
				"added": 1457709909
			},
			{
				"comment_id": 139,
				"body": "> [kostanew](#comment_63_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - спасибо, wrewolf! Своим VPS обзаведусь до ПН. \n> Вопрос который меня волнует. Как мне сделать логику аналогичную touch в Linux. То есть как можно потрогать опциональный контент из js, чтобы его начало качать? Это было бы полезно в дальнейшем если делать плейлисты и если делать мою идею с установкой .deb пакетов.\n\nПочитал твои исходники, ты не используешь ZeroFrameAPI, а там есть такие функции. См тут http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/site_development/getting_started/\nи API Reference тут http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/site_development/zeroframe_api_reference/\nТебя интересует fileGet, я так понимаю",
				"added": 1457710319
			},
			{
				"comment_id": 140,
				"body": "> [shift](#comment_225_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Каким образом?\n\nТут иерархическая структура content.json. Через include они наследуются. К каждому можно прикладывать подписи. Чья подпись есть в content.json (или в вышестоящем content.json) может редактировать user_contents, заданный в этом content.json и нижестоящие content.json",
				"added": 1457710475
			},
			{
				"comment_id": 141,
				"body": "@kostanew А еще почитай вот этот коммит. Там я запиливал локализацию как раз на опциональных файлах: https://github.com/vlad20012/ZeroTalk/commit/d5b7ae5bb2c2282b4ead8cd9b2aa2fd26bdbbf2c#diff-5536f1c2a9f04b05bb6f81618a1e2363R53",
				"added": 1457710834
			},
			{
				"comment_id": 142,
				"body": "> [vlad20012](#comment_140_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Тут иерархическая структура content.json. Через include они наследуются. К каждому можно прикладывать подписи. Чья подпись есть в content.json (или одном из вышестоящих content.json) может редактировать user_contents, заданный в этом content.json и нижестоящие content.json\n\nНеверно выразился. Не подписи, а публичные ключи, конечно же. Секция signers или include.signers  в content.json",
				"added": 1457711407
			},
			{
				"comment_id": 143,
				"body": "Хмм, походу я ошибся. Права не наследуются сами собой, и только владелец сайта может подписывать что угодно. Ну, тем не менее, если кто-то может подписать 1 нижестоящий content.json, то значит может вписать туда себя и редактировать еще на уровень ниже.",
				"added": 1457712642
			},
			{
				"comment_id": 144,
				"body": "> [kostanew](#comment_67_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Эмм... А владелец ресурса может в нижестоящий content.json вписать другого человека....\n\nДа не только в нижестоящий, но и в этот, собственно. Можно разрешить другому человеку свой сайт подписывать",
				"added": 1457712883
			},
			{
				"comment_id": 145,
				"body": "@kostanew почитал ссылки, что я кинул? Еще вопросы по опциональным файлам есть?)",
				"added": 1457713108
			},
			{
				"comment_id": 146,
				"body": "О, я еще интересное свойство нашел. В permission_rules (это там где max_size по регэкспам задается) можно также указать signers, т.е. публичные ключи, с которыми можно редактировать данные юзеров, которые под паттерн подпадают. Не совсем понимаю, зачем это может быть нужно... Ну, например можно сделать модераторов, которые могут редактировать только сообщения юзеров, залогиненных через zeroid.bit, а не через более доверенный сервис =)",
				"added": 1457713262
			},
			{
				"comment_id": 147,
				"body": "А ты мой ключик впиши, посмотрим ;)",
				"added": 1457713312
			},
			{
				"comment_id": 148,
				"body": "> [kostanew](#comment_69_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/Stats - че это, это встроено, почему я только сейчас увидел?\n\nПлагин. По умолчанию ставится",
				"added": 1457713424
			},
			{
				"comment_id": 149,
				"body": "* AnnounceZero - по всей видимости обмен информацией о файлах без трекера (без него используется только центральные трекеры по захардкоженным адресам)\n* CryptMessage - добавляет API для шифрования некоторыми алгоритмами (что странно, ибо это и на JavaScript можно реализовать было)\n*  Zeroname-local - используем локальную Namecoin-ноду",
				"added": 1457714250
			},
			{
				"comment_id": 150,
				"body": "> [shift](#comment_232_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): AnnounceZero - звучит как DHT сеть без трекеров которая судя по сбору доната еще не работает\n\nЯ глубоко не копал, но DHT там точно нет",
				"added": 1457714402
			},
			{
				"comment_id": 151,
				"body": "Я тут уже прикладывал список трекеров, в нем было 2 с протоколом zero:// вместо привычных http или udp. Судя по всему, все что делает этот плагин - реализует этот протокол, а он также идет через центральный сервер",
				"added": 1457714532
			},
			{
				"comment_id": 152,
				"body": "> [kostanew](#comment_73_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): У меня не работает стандартный пример из документации. Ошибка: \"Message wrapper_nonce error, please report!\", что делать? Расширения отключены.\n\nСтарый ZeroFrame.coffee взял, возможно с сайта спер какого-то. Скачай из документации актуальный\n\n> И еще я не могу понять как его заставить автоматически компилировать coffee-script на Ubuntu?\n\nОтдельным окном открой js/all.js и обновляй страницу каждый раз",
				"added": 1457731745
			},
			{
				"comment_id": 153,
				"body": "> [kostanew](#comment_74_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Взял актуальный: 127.0.0.1:43110/Blog.ZeroNetwork.bit/data/files/ZeroFrame.coffeeТеперь у меня ошибка с каким то extend в all.js.\n> Вот как я компилирую, ошибка и сам all.js : http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0\n\nХз, такого не видал, дебажить надо. Компиль лучше встроенным в ZeroNet способом, хоть отсечь можно будет проблемы, вызванные этим.",
				"added": 1457736679
			},
			{
				"comment_id": 154,
				"body": "Вот вам и сотая Issue. https://github.com/HelloZeroNet/ZeroNet/issues/352\nНадеюсь, скоро опять будет 99 ;)",
				"added": 1457736707
			},
			{
				"comment_id": 155,
				"body": "> [kostanew](#comment_76_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А это из-за дерьмовой документации... Стандартные примеры не работают. Я потратил 8 часов на первый пример, но он так и не поддался (хотя я никогда не писал под фронтенд). Для плагинов нет описания вообще (напишу сам, если демку сделаю). Нужно улучшать и писать документацию. Срочно, блин, и русскую и английскую...\n\nНу, тут самое сложное - порог входа перешагнуть. У меня это заняло 1 день, при условии что до этого я не видел ни строчки кода ни на Python, ни на CoffeeScript, да и с фронтэндом как-то не особо =)",
				"added": 1457791604
			},
			{
				"comment_id": 156,
				"body": "Эмм, а с каких пор введено понятие \"зайт\"?",
				"added": 1457800440
			},
			{
				"comment_id": 157,
				"body": "Семантическое версионирование. В пределах мажорной версии API меняться не должно. Но вот загвоздка - `0.*` - это начальная разработка, где никакая совместимость не гарантируется и API может меняться хоть каждый день. Подробнее на http://semver.org/\nТак что только когда будет `1.*` можно будет говорить с уверенностью. А так-то да, сайт любой может склонировать, так что вроде не проблема",
				"added": 1457812479
			},
			{
				"comment_id": 158,
				"body": "> [shift](#comment_227_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Желающие пилить админку для стандартныз zero сайтов https://github.com/HelloZeroNet/ZeroNet/issues/354\n\nЯ уж не стал им на гитхабе прямо писать, но по-моему вместо решения фундаментальных вопросов (разделение файлов на блоки, к примеру) разработчики занимаются какой-то фигней вроде админок... Запилили бы уже давно админку для ZeroTalk отдельно, не такая уж это и сложная задача",
				"added": 1457820645
			},
			{
				"comment_id": 159,
				"body": "Ну, я занимаю на этом форуме уже 74 Кб. Это значит, что каждый раз, когда я исправляю в своем сообщении одну букву (а опечатки я делаю часто), я отправляю все 74 Кб по всем нодам. А если бы файл был разделен на блоки размером 4 килобайта, то отправлялись бы только эти 4 Кб, индекс блоков (аналог .torrent-файла) и content.json. Огромная избыточная нагрузка на сеть сейчас идет в этом ZeroNet",
				"added": 1457821010
			},
			{
				"comment_id": 160,
				"body": "> [kostanew](#comment_101_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Разрабы Freenet и i2p тоже пилят фундаментальные вопросы... Уже с 2000 года пилят, запилились просто, а народу все нет и нет...\n\nНемного не в том направлении пилят=) В сторону анонимности, а у нее ниша небольшая в принципе",
				"added": 1457821351
			},
			{
				"comment_id": 161,
				"body": "Хм, круто. Разработчики после единственной моей просьбы стали фичи оформлять отдельными коммитами. Rev1015 выпущена",
				"added": 1457821405
			},
			{
				"comment_id": 162,
				"body": "> [shift](#comment_231_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): разрабов -попросили- и специально для vlad20012 они каждую фичу отдельным комитом пишут\n\nЭто прямо-таки что-то важное? =D",
				"added": 1457821805
			},
			{
				"comment_id": 163,
				"body": "Для меня, например, куда важнее вот этот коммит\nhttps://github.com/HelloZeroNet/ZeroNet/commit/4d7ce1dc1671256c9700029c83485dfab99a9574\nкоторый частично фиксит этот issue (только для Chrome) https://github.com/HelloZeroNet/ZeroNet/issues/352\n\nА то я, блин, ссылки не могу в новом окне открывать, что за дела. (авторизацию через гугл приходится в той же вкладке открывать)",
				"added": 1457821890
			},
			{
				"comment_id": 165,
				"body": "> [gomzik](#comment_283_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А  крутые штуки, это что за штуки? :)\n\nЯ пишу это http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF/\nВ целом уже на достаточно завершающий стадиях. И мне нужно чтоб разрабы редефайнить сертификат разрешили, а то мультиавторизация не будет работать https://github.com/HelloZeroNet/ZeroNet/issues/331",
				"added": 1457822181
			},
			{
				"comment_id": 166,
				"body": "Кстати, фронтенд у меня из говна налеплен. Навряд я буду это менять, как есть на гитхаб залью и буду пуллреквестов ждать =D",
				"added": 1457822315
			},
			{
				"comment_id": 167,
				"body": "Хмм, давно на англ ZeroTalk слева меню со ссылкой сюда?",
				"added": 1457823115
			},
			{
				"comment_id": 175,
				"body": "Хмм, вы не поверите. За расчет тех самых, сука, протеинов платят EmerCoin'ами",
				"added": 1457970068
			},
			{
				"comment_id": 176,
				"body": "Вы не поверите. За расчет тех самых, `с*ка`, пр*теинов платят EmerCoin'ами\n(походу я напоролся на местный фильтр запрещенных слов; боюсь предположить, запрещено первое слово или второе)",
				"added": 1457970154
			},
			{
				"comment_id": 177,
				"body": "> [shift](#comment_256_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): забанено второе конечно же) за боинк начали платить криптовалютой?\n\nЭто Folding@home, не BOINC, как я понимаю http://emerfor.org/folding_home/about_ru.php\n\nНа BOINC'е я пару лет назад \"майнил\" XRP (Ripple). У меня как раз тогда простаивавшая машина была. За 3 месяца, пока они программу выплат не прикрыли, получил 6000 XRP. По текущему курсу - 50$. Вот так выхлоп за 3 месяца-то =) А вообще есть какой-то GridCoin, вроде как специально для BOINC",
				"added": 1457970777
			},
			{
				"comment_id": 179,
				"body": "Нет, но вы ведь понимаете, что будет с вики, если до нее тот протеиновый маньяк доберется?",
				"added": 1457980411
			},
			{
				"comment_id": 180,
				"body": "Нет, но вы ведь понимаете, что будет с вики, если до нее тот пр*теиновый маньяк доберется?",
				"added": 1457980441
			},
			{
				"comment_id": 181,
				"body": "Проголосовал за сайт, но я явно в меньшинстве)",
				"added": 1457984385
			},
			{
				"comment_id": 182,
				"body": "> [nippletwister](#comment_306_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): @vlad20012, ты там поменял что-то в FAQ. А что? Давайте тут писать, а то я пытался разглядеть отличия, но не смог)\n\nJava Scrypt на JavaScript заменил",
				"added": 1457986009
			},
			{
				"comment_id": 183,
				"body": "Дебильная вики. Патчами бы изменения делали. Наверняка есть либа для JS. А так каждый целиком статью копирует при любой правке. Ладно, хотяб изменения чтоб показывались патчами. Нихрена же непонятно, кто что меняет",
				"added": 1457986889
			},
			{
				"comment_id": 184,
				"body": "> [nippletwister](#comment_309_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Не все сразу, мож обновят попозже. А кто знает где смотреть what's new для каждой ревизии? На гитхабе только релизы вижу, а их всего два, тогда как ревизии выходят чуть ли не каждый день. Сейчас уже аж 1015-я.\n\nВ коммитах?",
				"added": 1457989348
			},
			{
				"comment_id": 185,
				"body": "После упоминания тут рекламы я вспомнил, что когда-то давно на хабре писали про децентрализованный обмен рекламными ссылками через блокчейн EmerCoin. На хабре статьи не нашел, зато нашел на крипторе https://cryptor.net/kriptovalyuty/emclnx-piringovaya-set-obmena-reklamnymi-ssylkami\nПосле беглого изучения мой вердикт - эта система применима в ZeroNet.",
				"added": 1458061172
			},
			{
				"comment_id": 187,
				"body": "Я тут побозарил с одним знатным двачером. Говорит, этого чувака называют \"пр*теиновый инсайдер\", и он умудрился вконец затрахать всех на самом (!) дваче. А это еще постараться надо",
				"added": 1458342478
			},
			{
				"comment_id": 188,
				"body": "Знаете, я, пожалуй, поставлю себе телеграм https://geektimes.ru/post/273142/\nЕсли это такая PR-компания, то она определенная удалась",
				"added": 1458711388
			},
			{
				"comment_id": 197,
				"body": "Такс... эээ... Я еще в мае, когда увидел, что в репу коммитов нет, что-то решил, что тут все умерло. А тут во че... хммм...",
				"added": 1476740969
			},
			{
				"comment_id": 217,
				"body": "А тут нигде не ведется разработка нормального форума, с нормальными разделами и нормальной админкой?",
				"added": 1482596501
			},
			{
				"comment_id": 226,
				"body": "Что-то биткоин под Новый Год взлетел опять до 1к$. Обычно если под нг взлетает, то потом резко падает. Как думаете, в этот раз так же будет? И нет уже смысла покупать?",
				"added": 1483061292
			},
			{
				"comment_id": 228,
				"body": "Про биткоин рбк написал. Значит точно пора продавать",
				"added": 1483377039
			},
			{
				"comment_id": 229,
				"body": "> [shift](#comment_331_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну РБК не показатель, прошлый взлет был не из-за России но да, я тоже заметил и тоже думаю, вообще надо в отдельный тред вынести\n\nДа это какой-то известный миллиардер говорил, мол, если обыватели начинают интересоваться биржей, торгами и прочим, то надо как можно скорее оттуда выходить, ибо 100% скоро все рухнет.",
				"added": 1483459214
			},
			{
				"comment_id": 234,
				"body": "> [shift](#comment_338_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Возможно, перед падением по ТВ тоже было много инфы про биткоин. \n> С другой стороны - биткоином изначально пользуются люди которые не финансисты\n\nТаки опять сработало",
				"added": 1484157287
			},
			{
				"comment_id": 238,
				"body": "Китайцы свой ZeroTalk на 10 мегабайт уже выговорили.",
				"added": 1484488470
			},
			{
				"comment_id": 242,
				"body": "> [shift](#comment_351_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Вроде бы или вы сходили в папочку и посмотрели ?)\n\nЯ сходил прям в папочку и посмотрел\n.db 11060224\n.json 10176181\n.js 226364\n.css 162439\n.html 7181\n.png 785\n.gif 723\n\nИтого честно джсоном 10мб, и столько же в БД замиррорено.",
				"added": 1484688348
			},
			{
				"comment_id": 243,
				"body": "Сейчас вас услышит божество этой доски и увеличит пространство до мегабайта",
				"added": 1484727579
			},
			{
				"comment_id": 244,
				"body": "Может надо issue зарепортить? Если это твои фотки, то почему они у тебя удаляются?",
				"added": 1484753908
			},
			{
				"comment_id": 251,
				"body": "А зачем качать прон? Можно ж онлайн смотреть. Мало ль у кого жена/дети, найдут еще.",
				"added": 1487266008
			},
			{
				"comment_id": 252,
				"body": "Шифровать раздел. Так, на всякий. Мало ли",
				"added": 1487359207
			},
			{
				"comment_id": 253,
				"body": "> [avoiddowntime](#comment_11_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Шифрование между пирами? Очевидно, нет.\nШифрование опционально. Пир может решить для себя не шифровать ничего, и все соединения к нему будут незашифрованными. Не уверен, но вроде стандартными средствами так не сделать - надо в коде что-то править (может флажок запуска такой есть). Это было сделано для обратной совместимости со старыми версиями ZN, когда шифрования вообще не было. Сейчас уже пару лет прошло с тех пор, тех версий точно нигде остаться не должно, хз почему до сих пор не выпилили.",
				"added": 1487488513
			}
		],
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 82,
				"body": "1. Для каждого сайта у каждого юзера генерируется пара ключей, они сохраняются в data/users.json\n2. Каждый сайт (в т.ч. zeroid.bit) имеют собственную пару ключей, из которой публичный ключ является адресом сайта\n3. При регистрации на zeroid.bit ты посылаешь свой публичный ключ и желаемый юзернейм к ним на сервер по обычному HTTP POST, либо через BitMessage\n4. Сервер zeroid подписывает своим приватным ключом строку вида `\"твой_публичный_ключ#способ_авторизации/твой_юзернейм\"` (где `способ_авторизации` - любая строка, указанная сервером; на zeroid.bit это либо web, либо bitmsg), получая таким образом сертификат, и записывает его в zeroid.bit/data/users.json\n5. К этому моменту у юзера должна все еще быть открыта страница zeroid.bit. Скрипт этого сайта подписан на обновления файла zeroid.bit/data/users.json, таким образом он ждет, пока там не появится сертификат с твоим публичным ключом.\n6. После нахождения в zeroid.bit/data/users.json твоего публичного ключа, скрипт добавляет найденный сертификат в data/users.json, откуда он становится доступен другим сайтам при их посещении\n7. Сайт, который хочет использовать авторизацию через какой-либо ресурс (zeroid.bit) должен вписать себе в data/users/content.json его публичный ключ.\n8. При публикации контента юзер прикладывает сертификат (полученный юзером от zeroid.bit на 6 пункте)\n9. При приеме контента другого юзера ZeroNet-нода подтверждает, что сертификат корректный и выдан zeroid.bit (или другим ресурсом, сертификаты которого принимает данный сайт). Для этого приложенная подпись проверяется публичным ключом zeroid.bit (приложенного к сайту, как мы помним, в 7 пункте). Если проверка подписи провалилась, файлы этого юзера дропаются и дальше по сети не распространяются.\n\nОбращаю внимание, что с самим zeroid.bit взаимодействует только сам юзер и только один раз - при авторизации. После этого его можно хоть похоронить - выданную подпись назад не возьмешь.\n\nИ все это нужно только чтобы подтвердить, что определенный публичный ключ пользователя соответствует юзернейму@zeroid.bit. А так можно и без юзернеймов жить, по публичным ключам. Тогда и zeroid.bit не нужен.",
				"added": 1457371194
			},
			{
				"comment_id": 84,
				"body": "> [kostanew](#comment_15_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Какие файлы надо сохранять и переносить между компами, что бы не потерять свою учетку? Только data/users.json или нет? \".pem\" файлы нужны?\n\nТолько data/users.json.\n\n.pem используются для TLS шифрования соединений",
				"added": 1457377434
			}
		],
		"1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 97,
				"body": "Читаем первый апдейт",
				"added": 1457443075
			},
			{
				"comment_id": 98,
				"body": "> [shift](#comment_179_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну имхо на 1 юзернейм должна быть возможность вешать много соц-сетей, алгоритм примерно такой -Если пользователь уже авторизован, скажем, через гугл то он может подвязать другие OATH сети для авторизации, ну а если он вышел из аккаунта и подвязывает другую соц-сеть то создавать новый username\n\nТут я имел в виду вот что. На сайте в data/users/content.json прописываются правила в т.ч. для способа авторизации (`auth_type`). Вот пример с этого сайта\n```\n\"bitid/.*@zeroid.bit\": { \"max_size\": 40000 },\n\"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 }\n```\nХз что такое bitid (таких юзеров нет), но вот при авторизации на zeroid через bitmsg к юзеру доверия меньше - меньше и пространства выделяется. У себя я предполагаю ставить `auth_type` в соответствие с соцсетью, через которую юзер регистрируется. google, facebook, twitter и т.п. Но вот вопрос, а что если юзер привязывает к аккаунту несколько соцсетей? Теоретически мне ничто не мешает записать в `auth_type` строку вида `\"google;facebook;twitter\"`, но в связи с этим сильно меняются регэкспы правил. Хотелось бы это дело как-то \"стандартизировать\", обговорить с разрабом ZeroNet то есть.",
				"added": 1457445947
			},
			{
				"comment_id": 99,
				"body": "> [shift](#comment_183_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А приватный ключ получить мы не можем?т.е брать у пользователя его приватный ключ шифруя его у него же и зашифрованный вариант передавать на сервер ну или весь приватный ключ. Да это не очень секурно но существуют же биткоин кошельки в вебе которые хронят у себя приватный ключ, и метод авторизации в сети не единственный....\n\nКак твое сообщение связано с тем, что ты процитировал? =D\nОбычным способом приватный ключ не вытащить. Только если просить пользователя открыть конфиг и скопипастить.",
				"added": 1457447266
			},
			{
				"comment_id": 102,
				"body": "Это никак не решает проблему =)",
				"added": 1457451747
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 122,
				"body": "По поводу поддержки торрентов - есть информация, может кто-то уже разрабатывает такое для ZeroNet? А то задача уж как-то слишком очевидная. (Я не про поддержку больших файлов разделением на блоки, а именно поддержку обычного торрент протокола отдельным модулем)",
				"added": 1457579883
			}
		],
		"2_1Kn7vDfQWK1M5Amu5sFK2EHEBr69Vvm1Ai": [
			{
				"comment_id": 133,
				"body": "Да, вполне. Но на новом хосте нужно хоть раз зайти на zeroid.bit, чтобы сертификат установился",
				"added": 1457702322
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 164,
				"body": "> [kostanew](#comment_104_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А оно не утечет за пределы фрейма? За пределами фрейма шняги с правами админа, через них можно хорошо потроллить пользователя.\n\nВсе предусмотрено ;)",
				"added": 1457822142
			},
			{
				"comment_id": 168,
				"body": "После создания этой темы я впервые заюзал ZeroFeed и обратил внимание, что со шрифтами там те же проблемы. Может им в ядро русские шрифты закоммитить?",
				"added": 1457823240
			},
			{
				"comment_id": 169,
				"body": "А, черт, это же ZeroHello, а не ядро... Ну хз, туда, уверен, они мене охотно будут принимать лишних 30 Кб",
				"added": 1457823543
			},
			{
				"comment_id": 170,
				"body": "> [shift](#comment_237_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): vlad20012, На тему передачи только изменений, вот тут nofish сказал что таки ждите патча совсем скоро http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq/Bitnation+on+ZeroNet\n\nЭто, конечно, круто, но, надо сказать, в выражениях он весьма краток =)\nТ.е. непонятно ничерта, каким образом он там это запиливает. Где RFC, где хоть что-нибудь? =D\nЯ так понял, фундаментальными вопросами здесь только nofish и занимается ",
				"added": 1457826168
			},
			{
				"comment_id": 186,
				"body": "> [kostanew](#comment_144_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Никто так и не ответил по поводу уязвимости проксей к DoS. Просто ппц.\n\nУверен? https://github.com/HelloZeroNet/ZeroNet/commit/fbfa0f37175b15fac40af5952ac175a58bf44bc9",
				"added": 1458089892
			},
			{
				"comment_id": 190,
				"body": "Зачем это из JS делать-то вообще?\nZeroNet такого не умеет, конечно же, но можешь написать плагин.\nИ да, раздачи рутрекера тут только ленивый сюда еще не постил.",
				"added": 1459117226
			},
			{
				"comment_id": 191,
				"body": "Усе, обновления файлов теперь патчами высылаются https://github.com/HelloZeroNet/ZeroNet/issues/395",
				"added": 1460080667
			},
			{
				"comment_id": 199,
				"body": "> [zerro](#comment_78_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): А кто разбирается хорошо в ZeroNet? Фрейм отключается? Чтобы сайт в оригинальном виде отображался, без боковой панели.\n\nНет",
				"added": 1477224395
			},
			{
				"comment_id": 200,
				"body": "> [shift](#comment_296_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А если по прямой ссылке открывать?\n\nТо не будет ZeroFrame API работать",
				"added": 1478260549
			},
			{
				"comment_id": 203,
				"body": "> [mech](#comment_1_18f1UYi8CjGZLhpnjSr4LTDEAUbeiuwHuQ): Приветствую разработчиков ZeroNet от лица разработчиков Emercoin! Прочитали вашу статью на Хабре. Идея и особенно реализация очень понравилась.Скажите пожалуйста, возможна ли поддержка в ZeroNet доменных зон блокчейна Emercoin - *.lib, coin, emc, bazar? А так-же адресов EMC?\n\nЯ так понимаю, вопрос скорее политический чем технический? Т.е. вы хотите в ядре поддержку? Техническую часть я могу пояснить. По сути, поддержка namecoin адресов реализуется плагином, который интегрирован в основной codebase проекта. Плагина собственно 2 - zeroname и zeroname-local. По умолчанию работает zeroname, а zeroname-local отключен. zeroname-local периодически поллит namecon-демон, который должен быть запущен локально, извлекает оттуда записи о zeronet доменах и пишет их в локальное хранилище. Повторюсь, по умолчанию этот плагин выключен и для работы сети не требуется. Работает другой - zeroname. Тут другая тема. Есть где-то какой-то сервер, который хостится, видимо, разработчиком zeronet. Там запущен скрипт, который делает, собственно, то же самое, составляет базу доменов, но после этого выкидывает их в JSON'е на определенном zeronet-адресе. т.е. база доменов распространяется с центрального сервера как обычный zeronet-сайт. Таким образом, все пользуются теми доменами, которые выкидывает нам некий сервер, которому мы типа доверяем. Для тех, кто таки не доверяет, сделали возможность запустить локальный демон и получать домены с него. Плагины, собственно, в лежат в основном репозитории:\nhttps://github.com/HelloZeroNet/ZeroNet/tree/master/plugins/Zeroname\nhttps://github.com/HelloZeroNet/ZeroNet/tree/master/plugins/disabled-Zeroname-local\nСкопипастить, поменять названия и чутка подшаманить под протокол Emercoin, запустить сервер - вот и весь рецепт. Дальше политика - как внести это в ядро. Что-то я предполагаю, что автор ничего об EMC не слышал =)\n~~И flibusta.lib forever~~",
				"added": 1480969450
			},
			{
				"comment_id": 205,
				"body": "> [vladzh](#comment_5_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq): Уф, никак не хватает ума понять, как же создать сайт в Zeronet и привязать к своему домену.Может, где есть пошаговая инструкция \"для тупых\", кто раньше не пользовался биткоинами?\n\nНу, ээ, а этих доков недостаточно? https://zeronet.readthedocs.io/en/latest/faq/\nИли надо типа как купить биткоин, поменять на namecoin, куда там что вписывать? Ну хызы, это надо в отрыве от zeronet уже гуглить, может что нагуглится",
				"added": 1481207313
			},
			{
				"comment_id": 232,
				"body": "Tor",
				"added": 1483732667
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 172,
				"body": "В EmerCoin еще загляни",
				"added": 1457909224
			},
			{
				"comment_id": 173,
				"body": "> [esteban](#comment_69_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Буду тут http://127.0.0.1:43110/1JW3b7yeFG9Y8sXNBh651utgYuwFME1Ahp/ вести бложик про свои попытки создания распределенного мессенджера на блокчейне. Множество \"ключевых инноваций\" и мой взгляд на блокчейн.  Может будет интересно. Может кому-то позволит избавится от мифа: блокчейн -- это гигабайты информации.\n\nНеужели распределенный блокчейн?",
				"added": 1457930522
			},
			{
				"comment_id": 174,
				"body": "nofish в IRC вроде неплохо отвечает https://kiwiirc.com/client/irc.freenode.net/zeronet",
				"added": 1457964906
			},
			{
				"comment_id": 178,
				"body": "> [esteban](#comment_75_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): А кто знает, с какой целью в зеронете была взята биткоин-криптография в чистом виде? Что прям хоть бери адреса и отправляй на них биткоины? Мне вот раньше все больше попадались модифицированные, хотя-бы букву изменять , но всё же. А с другой стороны, теперь думаю, а ведь оно так удобнее, но больше возможности скомпрометировать ключ, в то же время.\n\nМогу предположить, что это наиболее простое решение: 1. Берешь готовую библиотеку 2. PROFIT",
				"added": 1457978815
			},
			{
				"comment_id": 271,
				"body": "Тот самый эффект, когда юзер единолично управляет своими данными. В т.ч. может устанавливать любые даты. В т.ч. в будущее. И, конечно, в прошлое",
				"added": 1488191860
			},
			{
				"comment_id": 276,
				"body": "Отредактировать тоже может",
				"added": 1488394637
			},
			{
				"comment_id": 277,
				"body": "> [mist](#comment_33_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Нет. Разве что подменить на одну из старых версий, наверно.\nВладелец сайта может своим ключом подписывать данные любого юзера. С такой подписью файлы принимаются. Конечно, это будет видно. Но можно.",
				"added": 1488401575
			}
		],
		"1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": [
			{
				"comment_id": 192,
				"body": "Seems like google-translate =)",
				"added": 1460224914
			},
			{
				"comment_id": 193,
				"body": "> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): detective @vlad20012\n\nHehe =) Write in English, we understand",
				"added": 1460225548
			},
			{
				"comment_id": 194,
				"body": "I take advantage of your presence here and ask to read [this post](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF/) (using google-translate =) ). I temporarily stopped development, but I have a working prototype. If you're worried about security, then the hair will stand on end =D",
				"added": 1460226314
			},
			{
				"comment_id": 195,
				"body": "> [erkan](#comment_2_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): OMG, using google as ID provider/me falls from chair\n\nCurrently not only google =) http://c2n.me/3wIh4pw.png",
				"added": 1460227103
			},
			{
				"comment_id": 196,
				"body": "> [erkan](#comment_3_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): can't see, must buy something or have an account there, because file archived\n\nVery strage... It's direct link to PNG, should work...",
				"added": 1460227260
			}
		],
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 201,
				"body": "Я же очень много писал об этом. Вот здесь, как это работает http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC/+ZeroID\n\nА здесь мои предложения по этому поводу (так и не реализовал) http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF/\n\nНет здесь никакой авторизации по сути. Провайдеры  вроде zeroid выдают сертификат на сопоставления юзернейма с публичным ключом. \"локальная авторизация\" - это когда любой юзер действует под любым юзернеймом. В т.ч. несколько юзеров могут занять один и тот же юзернейм. В теории это возможно, но на практике не особо удобно - чтобы различить двух юзеров, придется смотреть на их ключи, что, согласитесь, несколько не практично в сравнении с юзернеймами. А чтобы обеспечить выдачу *уникальных* юзернеймов, необходим централизованный провайдер. Можете запустить свой собственный, это не очень сложно и я это делал. Но по текущей архитектуре в любом случае нужен некий центральный сервер. Иначе можно только через блокчейн. И это весьма геморно. Я так и не понял вот этого прикола твистера, типа валюты нет, а блокчейн есть. Что мешает завалить сеть миллиардом транзакций? Заспамить блокчейн терабайтами регистраций?",
				"added": 1480858046
			},
			{
				"comment_id": 202,
				"body": "Никто не говорит, что технически так нельзя. Вон ниже пример уже приложили. Просто это непопулярное решение. И непопулярно оно в т.ч. потому, что можно нагенерировать миллиард аккаунтов и засрать все долбаным спамом. Правда zeroid тут не сильно помогает. Но, теоретически, именно авторизационный провайдер должен предоставлять некую защиту от подобного.",
				"added": 1480880829
			},
			{
				"comment_id": 204,
				"body": "> [balancer73](#comment_23_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Именно. В итоге у нас ни защиты от спама, ни свободы от единого центра авторизации :)\n\nБлин, я видимо сам забыл немного другой аспект проблемы. Дело не только в юзернеймах. Если авторизацию вынести за скобки, то у нас любой юзер может крепить к любому сайту любые данные. В любом количестве. Отфильтровать невозможно. Забанить невозможно. Ну возьмет и напишет вам кто-то 10 терабайт на форум, что делать-то? Ок, их вроде можно удалить. Завтра напишут 100 терабайт. Нет никакого сервера, который бы принимал решения, какие данные пропускать, а какие нет. Есть тысячи одноранговых клиентов, которые действуют по правилам, заранее запрограммированным в **ядре**, а не на вашем сайте. И авторизация - способ владельцу сайта получит немного контроля. Сначала провайдер выдает сертификат на ключ, потом под этим ключом юзер может запостить на сайт не более X килобайт данных(указывается в content.json, который понимает ядро zeronet). Провайдер авторизации - этот тот самый, мать его, центральный сервер, который вставлен в эту цепочку с двумя целями 1) выдать уникальный юзернейм 2) не пущать кого не надо. Второй пункт zeroid не выполняет, потому что он и не должен. Это забитая на коленке за полчаса демонстрация, собственно, протокола, и предполагается, что люди будут запиливать свои собственные. На zeroid.bit так и написано: \"This is a sample trusted authorization provider\". И по-моему это нормально хоть для каждого сайта запиливать собственного провайдера. Как, в некотором смысле, и работает сейчас в интернете. Это далеко не то же самое, что работать вообще без авторизации. Так что извиняюсь за предыдущие слова. Это не \"непопулярное решение\". Непопулярное решение - это запиливать по провайдеру на каждый сайт (ибо гиморно, нужен сервер, домен, поднимать там ноду zeronet, скрипт какой-то втыкать на прием запросов, да кому это сдалось вообще - вон и zeroid вродь работает, ага). А работать без авторизации - это совершенно безумное решение =) Вероятно по этим причинам оно и не предусмотрено системой из коробки. Как-то так",
				"added": 1480972814
			},
			{
				"comment_id": 218,
				"body": "На 0чане только что запилили \"локальную авторизацию\" http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9\nНо только сделали это в той версии, о которой я писал как о худшем варианте: полная анархия, никто ничего не контролирует. Вот так сертификат выдается:\n```\ncheckCertificates = function() {\n    var addr, cert;\n    if (null === this.siteInfo.cert_user_id || !this.siteInfo.cert_user_id.endsWith(\"@0ch.anonymous\")))\n        return addr = this.siteInfo.auth_address, this.log(addr),\n                cert = bitcoin.message.sign(this.anonKey, addr + \"#web/\" + addr.slice(0, 13)).toString(\"base64\"),\n                this.cmd(\"certAdd\", [\"0ch.anonymous\", \"web\", addr.slice(0, 13), cert])\n}\n```\nЗдесь bitcoin - это из либы bitcoinJS, bitcoin.message.sign - очевидно, подписывает сертификат, а this.anonKey - это приватный ключ, который, как видно, совсем не \"приватный\", т.е. он вписан в клиентский JS:\n```\nanonWIF=\"5JH6tV2QhqMiVh8vSNS4p4HTjBmuYzxrDMVRgvFcBAfo1nA2FJm\"\nthis.anonKey=bitcoin.ECPair.fromWIF(anonWIF)\n```\nТаким образом, можно понавыписывать себе миллион сертификатов и долбить спамом пока у всех лимиты не исчерпаются. После этого на сайт будет невозможно ничего постить, придет злой админ и выпилит эту авторизацию.\nТехнология по сути лютый костыль - чтобы не подписывать сертификат как положено приватным ключом на сервере, а выдадим ка приватный ключ нафиг всем, и пусть сами подписывают.",
				"added": 1482706846
			},
			{
				"comment_id": 219,
				"body": "Заранее отвечу вопросы типа \"а чем ZeroID лучше\" и \"да это ж имиджборда, им пофигу\". На обычные анонимные имиджборды можно постить без авторизации, это верно. Но отличие в том, что на обычных имиджбордах постингом сообщений управляет центральный сервер, а здесь - децентрализованная сеть. Центральный сервер при обилии спама может, к примеру, включить капчу. И как минимум сразу станет проблематично постить скриптами сообщения в любом количестве. \n\nВ зеронете можно постить сообщения скрипами, и в этом вся суть. Но здесь работают лимиты на каждого юзера. Кроме того, юзера можно забанить. Вопрос лишь в том, сколько таких аккаунтов можно создать, и можно ли это делать скриптами. На 0чане теперь, выходит, да, можно. В любых количествах. И никак от этого не защитишься.\n\nЧем ZeroID лучше - тем что это центральный сервер. Если на нем начнет регистрироваться аномально много аккаунтов, то он сломается, ибо те же лимиты будут исчерпаны. Придет админ и, не поверите, запилит капчу.",
				"added": 1482710605
			},
			{
				"comment_id": 220,
				"body": "> [nicolaith](#comment_4_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): кстати, про\n> \n> это как раз хуже неимоверноимхо нормальный даркнет не должен зависеть ни от чего, кроме себя самогону и физических каналов ессно :)\n\nМожет я особо упоротый, но я не рассматриваю зеронет как даркнет. За даркнетом плиз к FreeNet, для вас самое то. ЗероНет - это про доставку контента, про замену CDN, способ сократить расходы на инфраструктуру. Зеронет изначально отлично поддерживает возможность использования центральных серверов (см ZeroBoard, к примеру, не только ZeroID)",
				"added": 1482863150
			},
			{
				"comment_id": 221,
				"body": "Возможно, было бы неплохо, чтобы определенный сайт мог, в качестве дополнительной опции, ни от каких центральных серверов все-таки не зависеть. Вроде этого много кто просит. Посмотрим, может разработчик чего и выкатит",
				"added": 1482863672
			},
			{
				"comment_id": 222,
				"body": "> [zalex](#comment_47_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Если создать (пустой) сайт с нуля, то он не зависит от каких-либо центральных серверов.Разве что, за исключением трекеров, но nofish обещал потом решить этот вопрос (DHT).\n\nDHT тоже нужны bootstrap-сервера",
				"added": 1482943592
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 206,
				"body": "Да тут по-моему вопрос стоит не \"идти ли на выборы\", а скорее \"идти ли к навальному в штаб волонтером\". Пока думаю.",
				"added": 1481741115
			},
			{
				"comment_id": 207,
				"body": "Поймал себя на мысли, что не помню, когда последний раз участвовал в хоть каких-нибудь срачах (холиварах) вообще, а уж тем более о политике. Пожалуй, и в этот раз воздержусь.",
				"added": 1481831370
			},
			{
				"comment_id": 208,
				"body": "> [tolstoevsky](#comment_4_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): идеология, партия с массой сторонников и внятной программой, и, главное, разработанный метод ротации и подготовки элит.\n\nВы только что перечислили все, что имеется у незарегистрированной \"Партии Прогресса\" Алексея Навального. Которую минюст 2 раза ликвидировал видимо именно по этой причине.",
				"added": 1482246115
			},
			{
				"comment_id": 209,
				"body": "> [tolstoevsky](#comment_8_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Серьёзно? Можно вкратце позицию Партии Прогресса по этим пунктам?\n\nВкратце позиция Партии Прогресса по всем пунктам разъясняется здесь https://navalny.com/issues/",
				"added": 1482445309
			},
			{
				"comment_id": 210,
				"body": "Могу только процитировать. Не проще ли Ctrl+F?",
				"added": 1482470150
			},
			{
				"comment_id": 211,
				"body": "Давайте по порядку. Слово \"идеология\" мне не нравится, как видимо и Навальному, ибо оно не используется в его риторике. Внятная программа лежит здесь https://partyprogress.org/media/pdf/%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B0_1.pdf , но т.к. обычно её никто не читает, был написан тот самый FAQ, где как раз тезисно даны ответы на самые часты вопросы к этой самой программе. Про отбор элит видимо это https://navalny.com/issues/%D0%BA%D0%B0%D0%BA-%D0%BE%D1%82%D0%B1%D0%B8%D1%80%D0%B0%D1%82%D1%8C-%D0%B3%D0%BE%D1%81%D1%83%D0%B4%D0%B0%D1%80%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D1%8B%D1%85-%D1%81%D0%BB%D1%83%D0%B6%D0%B0%D1%89%D0%B8%D1%85-%D0%B8-%D1%81%D0%BA%D0%BE%D0%BB%D1%8C%D0%BA%D0%BE-%D0%B8%D0%BC-%D0%BF%D0%BB%D0%B0%D1%82%D0%B8%D1%82%D1%8C-126/\n\nПро ротацию элит уже кажется over 9000 статей написано, тезисно - нужно обеспечить развитие политической конкуренции, будет и ротация. Политическая конкуренция достигается обеспечением свободы слова, равным доступом к СМИ и так далее",
				"added": 1482470608
			},
			{
				"comment_id": 212,
				"body": "Кстати, президентская программа у Навального отдельная. https://2018.navalny.com/platform/",
				"added": 1482471017
			},
			{
				"comment_id": 213,
				"body": "А еще можно писать вопросы прямо на 2018@navalny.com, и на той стороне сидит прям лично Леонид Волков (начальник штаба Навального, был им же на выборах мэра Москвы в 2013 и местное зак. собрание Костромы в 2015) и действительно отвечает на каждое письмо.",
				"added": 1482471312
			},
			{
				"comment_id": 214,
				"body": "> [tolstoevsky](#comment_13_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): почему при наличии хоть чего-то из необходимого, вокруг ПП не объединилось остальные оппозиционеры?\n\nА, для начала, кто у нас остальные оппозиционеры? ЛДПР что ль? Или может Яблоко, которых 13 лет уже в Думе не были, они уже наверное забыли, что такое политика. Может ПАРНАС? Ну там долгая история, Навальный очень долго пытался с ними коалицию собрать, что-то даже вышло, но личные амбиции Касьянова не дали этому случится (Навальный хотел формирования партийных списков на честных конкурентных праймериз, Касьянов хотел себе первое место в списке без всяких конкурентных процедур, про эту ситуацию тоже очень много статей написано). Может, ваш вопрос в том, почему об этой партии и ее программе то сих пор не слышал все и каждый, и таким образом не произошло объединение, методом вытеснения конкурентов, так сказать? Ну так я неспроста сразу указал, что партия-то это **незарегистрированная**, а если точнее, она была зарегистрирована 2 раза и 2 раза незаконно ликвидирована минюстом безо всяких объяснений (тоже гуглится). Т.е. де-юре это вообще не партия, и уж тем более ни в каких выборах она участвовать не может. Как и сам Навальный до последнего времени не имел права участвовать в выборах из-за приговора по делу Кировлеса, отмененного недавно ЕСПЧ. Но дело заворачивают опять, и видимо ему тупо запретят участвовать в президентских выборах таким образом. Думаю, проблема в этом. Тяжело раскрутить партию, которой нельзя  участвовать в выборах.",
				"added": 1482505453
			},
			{
				"comment_id": 215,
				"body": "> [tolstoevsky](#comment_14_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Резюмирую своё бурчание: Навальный проиграет президентские выборы\n\nВот это по-моему вообще бесспорно. Но мое мнение на этот счет (если кому-то вообще интересно мнение анонимуса в зеронете) - лучше делать что-то, чем не делать ничего. По крайней мере это повысит федеральную узнаваемость Навального, и возможно когда-нибудь, когда Путин помрет-таки наконец-то, или по какой-то другой причине в России случится политический кризис, Навальный сможет этим воспользоваться лучше, чем в 2011",
				"added": 1482506067
			},
			{
				"comment_id": 216,
				"body": "Ничего эффективнее пока не придумали значит. Есть предложения?",
				"added": 1482516074
			},
			{
				"comment_id": 227,
				"body": "> [tolstoevsky](#comment_17_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b):\n\nНо это незаконно. Т.е. Навальный, например, не может публично призывать к этому. По сути предложения - сейчас все и так примерно к этому идет. Зарплату все меньше платят по белому, в рублях люди деньги не хранят и т.п. Бюджет все меньше,  фед. резерв также иссякает. Что дальше?",
				"added": 1483198246
			}
		],
		"2_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq": [
			{
				"comment_id": 223,
				"body": "1. ZeroNet работает по тем же технологиям и список раздаваемых сайтов точно так же виден. Но здесь, в отличии от торрента, можно использовать Tor из коробки, с которым вместо ip будет виден бесполезный .onion адрес. Включите режим \"только Tor\", если вы параноик.\n2. Это не является проблемой и вообще это очевидно, если хоть чуток понимать торрент-протокол. Вся его суть в том, чтобы публиковать свой ip на трекере (или в DHT, что не сильно что-то меняет), чтобы потом по этому ip мог подключится другой пир и скачать с тебя определенные данные. Естественно, для этого на трекере публикуется, какие именно данные ты раздаешь. Поэтому \"как качать торренты теперь\" - так же как и раньше",
				"added": 1482990232
			},
			{
				"comment_id": 224,
				"body": "> [voland](#comment_20_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Хеш файлов которые раздаются более не менее известны, в отличие от того что передает zeronet.\n\nВ ZeroNet адрес сайта используется вместо хеша.",
				"added": 1482994156
			},
			{
				"comment_id": 225,
				"body": "Паника, земля круглая, мы все упадем!",
				"added": 1482996513
			}
		],
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 230,
				"body": "1100 уже",
				"added": 1483557898
			},
			{
				"comment_id": 231,
				"body": "Вообще, однажды должен случится кризис типа 2008, и тогда биткоин подлетит раз в 10, сколько бы он на тот момент ни стоил. Так что закупать можно хоть сейчас, в лонг все равно не прогадаешь.\nНо я не буду :3 ",
				"added": 1483558027
			},
			{
				"comment_id": 274,
				"body": "1200$.",
				"added": 1488241661
			},
			{
				"comment_id": 280,
				"body": "> [zirish](#comment_4_12nAx71yE7LFmVAgTnkux3pSA3Wyk3v5vL): 1466\n\nНевероятно...",
				"added": 1494084287
			},
			{
				"comment_id": 281,
				"body": "1800",
				"added": 1494503315
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 233,
				"body": "> [kagari](#comment_3_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Зачем китайцам поддерживать русскоязычный форум? У них же есть свой, китайский)\n\nТыкают по всем ссылкам, чтобы узнать \"а шо там?\", потом не удаляются сайт, он остается сидироваться. Китайцев и правда много, суда по geoIP.",
				"added": 1483947101
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 235,
				"body": "Круто, региональная группа на 50 человек. Давно хотел задать вам несколько вопросов.\n1. Скажите, почему вы уверены, что в вашей региональной группе нет ФСБшников под прикрытием? Или если не уверены, как вы живете с этим? Как вообще вы людей к себе принимаете, по каким критериям?\n2. А людям, которые вступают в такие группы, как понять, что это не специальная группа ФСБшников, созданная для отлова таких вот вступающих?\n3. Что вы там обсуждаете, к чему конкретно готовитесь? \n4. Есть ли оружие? Какое примерно?\n5. Предпринимаете ли вы уже какие-то действия, или только \"не ждете, а готовитесь\"?\n6. Как вы держите связь внутри группы? Собрания? ВК?\n7. Есть ли какое-то взаимодействие с соседними группами? Вообще какая-то коммуникация за пределами группы?\n\nP.S. Я не ФСБшник, честно, местные подтвердят.",
				"added": 1484371423
			},
			{
				"comment_id": 236,
				"body": "Вообще, кроме шуток, это довольно круто. Я бы даже сказал, зрело. А то люди разрозненны, у каждого хата с краю, никакого взаимопонимания. И такое чувство, что в россии всегда так было. Может, что-то постепенно меняется. Поговаривают, что дальнобойщики вертикальную структуру выстроили - понятно, на чьей они будут стороне, если что.",
				"added": 1484403920
			},
			{
				"comment_id": 237,
				"body": "По поводу связи, мне кажется, зеронет вам не особо подходит. Как-то это больше исследовательский гиковый проект, все тут недопиленное. Например, на мобилках как-то с трудом работает (и работает ли вообще?). А пробовали какие-нибудь скрытые форумы в Tor? Mesh-чаты (fireChat?)? Ммм, что-то одна хрень в голову приходит, где все остальные децентрализованные сети-то... @shift, тут что, правда зеронет в прод пошел? В народ, так сказать. Любопытно...",
				"added": 1484404168
			},
			{
				"comment_id": 239,
				"body": "> [get33](#comment_8_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM): Забрали тебя? К тебе зашла подруга, забрала у родных флешку, вставила, включила - весь контент опять существует\n\nКонтент будет существовать и так, не нужно ничего забирать никуда. Единственное, что имеет смысл забрать - это приватный ключ",
				"added": 1484552177
			}
		],
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 240,
				"body": "Чето он сходу больше 10 мб",
				"added": 1484687700
			},
			{
				"comment_id": 241,
				"body": "Если не считать явную недопиленность, то господиэтопревосходно, оно ж прям работает, прям как надо, аааа",
				"added": 1484687906
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 245,
				"body": "Пока что рановато для этого, мне кажется. Слишком мало нод. Пусть лучше все новые ноды пока что будут таки полными.",
				"added": 1484755276
			}
		],
		"2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 246,
				"body": "О, наконец-то эта ветка пришла как раз к тем идеям, к которым я пришел еще полгода назад =)\nНо тут все так радеют за децентрализацию и все такое, что центральный (пусть хоть и анонимный) сервер - это так небезопасно... Мда. Очень многие... прямо скажем, большинство существующих сегодня приложений без центрального сервера создать невозможно. А зеронет - это очень классный CDN.",
				"added": 1485654650
			}
		],
		"1_1789XcRxNBxCsCTWFhhGsbmjrmg4XX4QPL": [
			{
				"comment_id": 247,
				"body": "На битновостях https://bitnovosti.com/2017/02/07/sam-maloney-killed-in-a-police-raid-in-canada/",
				"added": 1486545796
			}
		],
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 248,
				"body": "> блокировкой бложиков по альтернативной истории\n\nА что за бложики такие, и почему их блокируют?",
				"added": 1487059328
			},
			{
				"comment_id": 249,
				"body": "> [balancer73](#comment_66_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я пока даже не брался. Не возникало задач. Да и жду, пока оно устаканится, а то, вот, фотки выложенные и раздаваемые кучей участников со временем пропадают даже у того, кто выкладывал :D\n\nТак то дело в том, что они опциональные. Если не делать опциональных файлов вообще, то и пропадать нечему. (вроде как тут и собираются)",
				"added": 1487092741
			},
			{
				"comment_id": 250,
				"body": "> [dmi](#comment_6_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Подобрал на скорую руку.\n\nЕще интересно узнать, кого конкретно заблокировали. Или с чего кипиш начался, что аж до \"уйти с LJ\" долшло.",
				"added": 1487092854
			},
			{
				"comment_id": 268,
				"body": "> [balancer73](#comment_65_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> Вот, например, в моём ZeroMe в записи от 3 января фото есть, а от 25 декабря и всех более ранних — уже нет.\nВ блоге разработчика есть интересный пункт \"Fix disappearing optional files bug (Thanks l5h5t7 for reporting)\" от 9 февраля. Похоже баг уже пофиксили.\n\nА еще запилили возможность мутить юзеров на уровне ядра (чтоб файлы от них вообще не принимались). Короче http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:104:New+version:+0.5.2",
				"added": 1487961511
			}
		],
		"1_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 254,
				"body": "DHT в ZN нет вообще - используются только трекеры",
				"added": 1487508476
			},
			{
				"comment_id": 255,
				"body": "Может DHT уже добавили, а я проморгал? Надо бы проверить",
				"added": 1487511543
			},
			{
				"comment_id": 256,
				"body": "Порывшись по исходникам, ничего о DHT не нашел. Кроме того, этот таск создан самим разработчиком, и т.к. он еще не закрыт и коммитов прилинкованных нет, значит и никакой работы в этом направлении еще не велось https://github.com/HelloZeroNet/ZeroNet/issues/57\nПодтверждаю, что\n> DHT в ZN нет вообще - используются только трекеры",
				"added": 1487516524
			},
			{
				"comment_id": 265,
				"body": "> [gnome](#comment_13_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): То есть, Tor начинает работать как сервер (по умолчанию работает как клиент для сети)?\nTor всегда работает как hidden service, через exit-ноды тут не проксируется",
				"added": 1487529390
			},
			{
				"comment_id": 266,
				"body": "> [gnome](#comment_14_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): По умолчанию, Tor работает только как клиент, то есть не выполняет никаких серверных функций. Если \"поднимается скрытая нода\", то вероятно Tor переходит в режим сервера. Что может представлять собой уязвимость. Отсюда и вопрос.\nА, я не так выразился. ZN открывает hidden service сразу. Но я хз как оно там настраивается, наверняка разрешается только 1 порт или типа того",
				"added": 1487530924
			},
			{
				"comment_id": 267,
				"body": "Параноик подоспел короче...",
				"added": 1487532673
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 257,
				"body": "> [gnome](#comment_6_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Это результат воздействия конкурентной экономики...\nНо это возведение в абсолют какое-то. Я например, ничего не продаю. И никого небать не пытаюсь. И что-то у меня есть смутное подозрение, что я не один такой.",
				"added": 1487518901
			},
			{
				"comment_id": 258,
				"body": "> [gnome](#comment_7_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Не веришь, почитай любую, или почти любую рекламу.\nА зачем читать *рекламу*? кто ее читает вообще?",
				"added": 1487519559
			},
			{
				"comment_id": 259,
				"body": "> [gnome](#comment_8_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Это дело государства\nЦензуру предлагаешь?\nНу и все-таки я не могу понять связь между лживой рекламой и обозначенной выше проблемой.",
				"added": 1487520485
			},
			{
				"comment_id": 260,
				"body": "> [gnome](#comment_9_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): есть только самый необходимый уровень взаимодействия.\nТак может это оптимизация такая?)",
				"added": 1487520896
			},
			{
				"comment_id": 261,
				"body": "> [gnome](#comment_9_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Тут связь самая что ни на есть прямая - нет доверия, есть только самый необходимый уровень взаимодействия.\nТакс, если серьезно. Твоя мысль в том, что конкуренция окружает нас повсюду, поэтому каждый человек воспринимается как конкурент? И значит любая дополнительная информация, сообщенная конкуренту, воспринимается как какой-то провал, поэтому любое социальное взаимодействие сводится к минимуму? Так что ли?",
				"added": 1487521698
			},
			{
				"comment_id": 262,
				"body": "> [gnome](#comment_10_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu):\nЭэ, в общем, я понял мысль. И в целом согласен. Но я тут наверное должен был оговориться, что я как раз из тех, к кому бесполезно подходить на улице. И на \"привет, как дела\" я отвечу разве что матом. Но я определенно не вижу в других людях конкурентов, не жду небалова и вообще я наивный идиот, который доверяет всем по умолчанию. Я попытался применить эту теорию к себе, но как-то не выходит. Так что я бы не стал утверждать, что все объясняется только этим.",
				"added": 1487523561
			},
			{
				"comment_id": 263,
				"body": "> [gnome](#comment_11_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Но если к тебе подойдет человек и спросит показать дорогу, ты наверняка ответишь вежливо, потому что человек не стремится втесаться в доверие, а подошел по делу.\nНу так да. Если кто по делу обращается, то другое дело. Но что это объясняет?",
				"added": 1487525216
			},
			{
				"comment_id": 264,
				"body": "> [gnome](#comment_12_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Только то, что ты тоже не стремишься к излишнему доверию, хотя и хочешь видеть мир другим. Я же говорю, сама система такая.\nА, ну и если мне пишут \"привет, как дела\" давно знакомые люди, моя реакция остается неизменной. Опять же, не вижу, чтобы в моем случае это было связано с доверием. Просто *обычно* не люблю базарить не по делу. Даже с семьей. Не важно.",
				"added": 1487525617
			}
		],
		"2_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 269,
				"body": "Ясно, спасибо",
				"added": 1488165122
			}
		],
		"1_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk": [
			{
				"comment_id": 272,
				"body": "GPD Pocket - Как на такой клавиатуре вообще писать-то?",
				"added": 1488227895
			},
			{
				"comment_id": 273,
				"body": "8 гб рамы? Любопытно. Я и в огромных ноутах-то все еще периодически 4 вижу",
				"added": 1488228797
			},
			{
				"comment_id": 275,
				"body": "> [zalex](#comment_71_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): В таком случае вставлю ещё свои 5 копеек про PineBook - OpenSource ARM-нетбук, но его пока нет в продаже. Когда деньги будут, планирую взять такой (естественно, с оглядкой на отзывы).\n\nЦенник радует. Но по хар-кам он не сильно отличается от моего смартфона",
				"added": 1488366695
			},
			{
				"comment_id": 278,
				"body": "А с каких пор чтоб пилить нетбуки не нужно быть огромной китайской корпорацией? Что-то смотрю уже кто ни попадя их пилит",
				"added": 1488804636
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 279,
				"body": "Ядро не знает ничего о сообщениях, датах и т.д. Оно знает только, что есть файлы юзера, и их размер можно посчитать.",
				"added": 1489273411
			}
		]
	},
	"comment_vote": {
		"139_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"53_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"4_1NxrvhVZwz4YsrYp3ZSCs4aDvw2gFud47M": 1,
		"82_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"1_1G8AWcSThuDgsNHA5dJxJLD4jR56bgWEoY": 1,
		"12_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": 1
	}
}