{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1,
			"title": "Какое приложение (Сайт?) должен появится в сети",
			"body": "Предлагаю накидать идей (без обсуждения) и голосовать за них (через стандартное голосование)",
			"added": 1455284089
		},
		{
			"topic_id": 2,
			"title": "Оцените идею",
			"body": "Тут в сети есть общий ID провайдер - zeroid, но он занимается только предоставлением ника/ключа, может стоит расширить функционал через впиливание аватаров что бы был аналог gravatar тут?",
			"added": 1455295800
		},
		{
			"topic_id": 3,
			"title": "хмм, в more sites новый сайт появился",
			"body": "Я верно понимаю, что туда могут добавлять сайты только разработчики сети? (выглядит аналогично первому старту когда даже на форум не подписан) сайт собственно 127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/",
			"added": 1455521517
		},
		{
			"topic_id": 4,
			"title": "Закончилось место? - пишем в эту тему",
			"body": "В этой теме писать если не хватает места и нужно повысить.",
			"added": 1455640438
		},
		{
			"topic_id": 5,
			"title": "Пожелания по улучшению форума",
			"body": "Добропожаловать всем новоприбывшим, если есть предложения по улучшению форума - допро пожаловать. \n\nА если вы вдруг дизайнер и готовы сделать красивую тему - тем более.",
			"added": 1457175717
		},
		{
			"topic_id": 7,
			"title": "Кодинг, разработка сайтов и приложений в ZeroNet",
			"body": "Вопросы, best practice. Все вопросы по разработке - сюда. \nПозднее тут будет список ссылок полезный разработчикам.",
			"added": 1457820167
		},
		{
			"topic_id": 9,
			"title": "ZeroMe",
			"body": "Обсуждение",
			"added": 1471207189
		},
		{
			"topic_id": 10,
			"title": "Странное что-то происходит между РФ и Беларусью",
			"body": "http://varlamov.ru/2105591.html",
			"added": 1480493473
		},
		{
			"topic_id": 11,
			"title": "Статистика сети",
			"body": "Собственно статистика ZeroNet за несколько дней\nhttp://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/1481048308 \nНа мой взгляд - не плохо. на данном форуме имеем стабильные 100 пиров",
			"added": 1481048431
		},
		{
			"topic_id": 12,
			"title": "Пойдете на выборы в 2018 ?",
			"body": "Навальный решил участвовать https://www.youtube.com/watch?v=wkN8sSrUbdY\n\nPS Моё скромное имхо - вспоминая мэрские выборы - если мобилизоватся, то процентр набрать можно. \n\nА ваши какие мысли?",
			"added": 1481705799
		},
		{
			"topic_id": 13,
			"title": "Bitcoin опять по 1000$",
			"body": "Был приятно удивлен, что данным фактом интересуют не я один, предлагаю обсудить",
			"added": 1483452888
		},
		{
			"topic_id": 14,
			"title": "Кто-то пилит реддит в ZeroNet",
			"body": "И он выглядит очень неплохо! \nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/\n\nКто знает, кто пилит? я давно говорил - реддит в ZeroNet - win-win это замена сразу и всяким реддитам и пикабу и еще с десяток развлекательных сайтов можно хоронить (в будущем)",
			"added": 1484682661
		},
		{
			"topic_id": 15,
			"title": "Решение проблемы \"тяжести\" сайтов",
			"body": "Пришла мне идея, как победить будущую проблему масштабируемости сети, хочу ваше мнение услышать, ну и если идея норм - оформить в гитхабе.\n\n\nСделать всё аналогично сети биткоин - есть тяжёлые ноды (как мы с вами) которые хранят весь контент который только есть. \n\n\nИ есть лёгкие ноды - они так же подключаются к трекеру, но скачивают себе при открытии сайта очень ограниченный список данных - по сути только костяк сайта без json контента (базы) эту информацию они запрашивают у тяжёлых нод, причем запрос идет в формает SQL запросов на конкретный контент. \n\n\nДа - пострадает распределенность и легкие клиенты будут доверять тяжёлым - причем слепо, но никто не мешает развивать идею дальше придумывая сфеерический HTTPS как гарант да и такой механизм вполне успешно работает в сети биткоин. \n\n\nА ну и да - постинг контента осуществлять традиционным образом, а не проксируя через тяжёлого собрата. \n\n\nНа мой взгляд такое разделение поможет принести сеть на тонкие устройства которые готовы поступится безопастностью ради скорости и возможности работать с сетью. У каждого будет свой выбор - тяжелый клиент и безопасность или легкий и экономия места/трафика.\n\n\nЧто думаете?",
			"added": 1484752539
		},
		{
			"topic_id": 16,
			"title": "Лимит сообщений изменён до 20000K",
			"body": "",
			"added": 1548578974
		}
	],
	"topic_vote": {
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": 1,
		"1_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"4_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": 1,
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": 1,
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"2_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1
	},
	"next_comment_id": 384,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [zalex](#comment_1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Доменъ не помешаетъ.\n\nРаботает, круто, ну можно прикрутить да",
				"added": 1455281151
			},
			{
				"comment_id": 2,
				"body": "я открыл для себя тут прикольную штуку если ноль справа потянуть налево",
				"added": 1455281175
			},
			{
				"comment_id": 3,
				"body": "> [zalex](#comment_3_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Сообщение можно редактировать. Карандашик слева.\n\nне вижу кстати его",
				"added": 1455281358
			},
			{
				"comment_id": 4,
				"body": "> [nippletwister](#comment_2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Он только у своего сообщения появляется. При наведении мышкой на него.\n\nне вижу в упор",
				"added": 1455281445
			},
			{
				"comment_id": 5,
				"body": "модерации тут тоже нет да?",
				"added": 1455281491
			},
			{
				"comment_id": 6,
				"body": "А знаете чего тут не хватает? - wiki прямо что бы можно было редактировать всеми... это идеальное место для лурка который зачах",
				"added": 1455281630
			},
			{
				"comment_id": 7,
				"body": "купить же надо да?",
				"added": 1455281695
			},
			{
				"comment_id": 8,
				"body": "> [zalex](#comment_6_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Могу зарегать\nДавай подождем, если русское сообщество поддержит идею о возможной миграции сюда что бы не засирать англ форум то я только за",
				"added": 1455281748
			},
			{
				"comment_id": 9,
				"body": "> [gomzik](#comment_2_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Я не полностью уверен, что это возможно. Одно дело отдельно взятый комментарий, присвоенный личности, другое дело статья, которая должна редактироваться разными людьми\nНу алгоритм я себе вижу следующий - каждый блок статьи - отдельный кусок который подписывается своей подписью и у него есть timestamp, у которого timestamp самый новый - его и показываем если не указано другого в какой-нибуть таблице в БД (защита от фрода/спама)",
				"added": 1455281831
			},
			{
				"comment_id": 10,
				"body": "> [gomzik](#comment_4_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А если прямо в этом блоке поменять надо?\n\nТы клонируешь старый блок помечая его как не обязательный к загрузке и делаеш новый который и редактируешь",
				"added": 1455281902
			},
			{
				"comment_id": 11,
				"body": "А вот и разметонька:\n# Заголовок\n## Заголовок\n### Заголовок\n<i>Наклончег</i>\n**жирнота**\n~~зачеркивание~~\n\n- список\n- список\n\n1. нумированный\n2. второй\n[ссылонька](http://www.zeronet.io)\n<code>`code`</code>\n--- линия",
				"added": 1455282088
			},
			{
				"comment_id": 12,
				"body": "Вот коды:\n'<li># H1</li>\n  <li>## H2</li>\n  <li>### H3</li>\n  <li><i>_italic_</i></li>\n  <li><b>**bold**</b></li>\n  <li>~~<s>strikethrough</s>~~</li>\n  <li>- Lists</li>\n  <li>1. Numbered lists</li>\n  <li>[Links](http://www.zeronet.io)</li>\n  <li>[References][1]<br>[1]: Can be used</li>\n  <li>![image alt](img/logo.png)</li>\n  <li>Inline <code>`code`</code></li>\n  <li><code>```python<br>print \"Code block\"<br>```</code></li>\n  <li>&gt; Quotes</li>\n  <li>--- Horizontal rule</li>\n'",
				"added": 1455282134
			},
			{
				"comment_id": 13,
				"body": "> [manrus](#comment_9_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Я думаю стоит сообщить. Нужно поставить в коде проверки на время\n\nпилите багрепорт, с другой стороны - а как верифицировать сей баг? кто будет подтверждать время? есть мысль что только пиры которые получили файл, то что время в нем не должно быть сильно меньше того, что пришло",
				"added": 1455282206
			},
			{
				"comment_id": 14,
				"body": "прям как valve time\n\n@manrus каким образом?",
				"added": 1455282317
			},
			{
				"comment_id": 15,
				"body": "но багрепорт стоит запилить в любом случае\nPS Всё еще не нашел это ваше редактирование",
				"added": 1455282339
			},
			{
				"comment_id": 16,
				"body": "> [nippletwister](#comment_5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Глянь тут:http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/?Topic:2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/\n\nможет баг сафари но у меня этого нет\n\nPS Вижу на том ресурсе сделали возможность картинки вставлять, а чего в оригинал не впилили?",
				"added": 1455282684
			},
			{
				"comment_id": 17,
				"body": "> [nippletwister](#comment_6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Вот тут не в курсе, разраб просто ответил, что не планировал эту возможность добавлять на основной форум. Может, за свободное место переживает.\n\nТак а если впиливать не как всегда скачивать а on demand, есть же сейчас такая штука... \nЕще бы и аватары сделали...",
				"added": 1455282840
			},
			{
				"comment_id": 18,
				"body": "> [wrewolf](#comment_1_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Ну работает весьма шустро\n\nо, всё в сборе :D",
				"added": 1455283979
			},
			{
				"comment_id": 20,
				"body": "> [wrewolf](#comment_2_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ага, тусовка криптоанархистов очень узкая )\n\nНу в будущего этого я верю /чуть/ более чем в твистер в данный момент... к сожалению наверное. тк тут тот же твистер можно реализовать...",
				"added": 1455284487
			},
			{
				"comment_id": 21,
				"body": "> [wrewolf](#comment_3_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Надо будет покурить на досуге, как это работает\n\nСоотечественник описывает тут http://127.0.0.1:43110/1CpGZyfbUBBV5uXUoY653wVoqZFRojbEzd",
				"added": 1455284786
			},
			{
				"comment_id": 25,
				"body": "Ну в соседней теме есть пожелалки что все хотят =)\nА из простого - ну наверное файлообменник, gravatar",
				"added": 1455290584
			},
			{
				"comment_id": 26,
				"body": "Надо include проверить да, про файлообменник я имею ввидео картинго-хостинг - ничего тяжелого.",
				"added": 1455291204
			},
			{
				"comment_id": 27,
				"body": "ключи есть - они же ID поидее...",
				"added": 1455295088
			},
			{
				"comment_id": 30,
				"body": "ЛС к чату было бы неплохо прикрутить по средствам ссылки от юзернейма ведущей на местную почту",
				"added": 1455295950
			},
			{
				"comment_id": 37,
				"body": "Пойду курить маны как повысить лимит =)",
				"added": 1455533699
			},
			{
				"comment_id": 38,
				"body": "видел, сейчас попробую разобратся...",
				"added": 1455533779
			},
			{
				"comment_id": 39,
				"body": "[Links](http://www.zeronet.io)",
				"added": 1455533859
			},
			{
				"comment_id": 40,
				"body": "http://pastebin.com/7xLDi1vx\n",
				"added": 1455533864
			},
			{
				"comment_id": 41,
				"body": "> [gomzik](#comment_38_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): этсамое. У меня правда получилось, а потом как-то все откатилось и больше не получается, но копать тебе нужно в <сайт>/data/users/content.json, там поле permissions, туда надо добавить \"nippletwister@zeroid.bit\": {\"max_size\": <новый размер в байтах>}\n\nА глобально нельзя это сделать?",
				"added": 1455534134
			},
			{
				"comment_id": 42,
				"body": "> [gomzik](#comment_40_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): можно,  там еще такая штука есть (или что-то похожее)\n> \"permission_rules\": {\n>    \".*\": {\n>     \"files_allowed\": \"data.json\",\n>     \"max_size\": 500000\n>    }\n>   },max_size надо менять. Только учти, тут есть шанс нарваться на всякий нерегулируемый спам и постоянно привышать квоту у посетителей\n\nПоднял всем на 10 и для gomzik и nippletwister в несколько раз",
				"added": 1455534602
			},
			{
				"comment_id": 44,
				"body": "но что-то оно пока не долетело до всех, судя по всему...",
				"added": 1455535004
			},
			{
				"comment_id": 45,
				"body": "в консоли [SKIPPED] data/users/content.json при подписи",
				"added": 1455538057
			},
			{
				"comment_id": 46,
				"body": "там похоже кривая регулярка или синтаксис\nUPD, по ссылке ниже команда работает, пишет что вроде бы подписал всё. ну ждем...\n",
				"added": 1455538417
			},
			{
				"comment_id": 47,
				"body": "мда, у меня всё еще не получается повысить лимит на форуме...",
				"added": 1455545673
			},
			{
				"comment_id": 48,
				"body": "> [nippletwister](#comment_44_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А не пробовали зеронет отключать насовсем, когда изменения делаете? Затем запускать из командной строки на подпись и публикацию. А затем только снова его запускать. Мне когда-то помог такой вариант. После перезапуска, количество отображаемых сидеров у сайтов падает оч. существенно, кстати.\n\nтак и делаю",
				"added": 1455546601
			},
			{
				"comment_id": 49,
				"body": "Так, попытка номер два выдачи всем места",
				"added": 1455548764
			},
			{
				"comment_id": 50,
				"body": "> [gomzik](#comment_52_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): У нас в Беларуси upnp не разрешен, потому порт у меня закрыт. Если хостишь сайт, то всяко лучше, чтобы порт был открыт. Плюс канал шире будет. Да и необязательно на все девайсы раскидывать users.json. можно через пробрасывание портов входить с компа, планшета, телефона\n\nФишка не в стране, а в NAT =)",
				"added": 1455549086
			},
			{
				"comment_id": 51,
				"body": "> [nippletwister](#comment_45_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Да, теперь место появилось, аж 100Кб! В чем дело-то было?\nНу я изменил дефолтный конфиг - по умолчанию ограничение меньше было",
				"added": 1455552202
			},
			{
				"comment_id": 52,
				"body": "> [gomzik](#comment_55_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): ахерего знает, я не сетевик\n\nНу фишка в том, что у тебя у провайдера NAT, надо его сменить на провайдера который даёт сразу белый динамический IP и будет всё ок. Технология UPNP работае только с твоим роутером, в провайдерскую сеть она не ходит",
				"added": 1455552273
			},
			{
				"comment_id": 53,
				"body": "И че в итоге? кто-то issue повесил на гитхаб? это же near critical bug",
				"added": 1455616255
			},
			{
				"comment_id": 54,
				"body": "> [gomzik](#comment_91_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): он написал вроде, что там допустимый рассинхрон в 1 сутки, но собирается изменить на 1 час. Хз, фикс ли это :)\nмда, по хорошему надо в минутых это ограничивать, если даже не в секундах",
				"added": 1455616337
			},
			{
				"comment_id": 56,
				"body": "> [gomzik](#comment_103_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Вызываем @shift\nТут  я =) Ну насколько я понимаю, этот движок не умеет это",
				"added": 1455633133
			},
			{
				"comment_id": 57,
				"body": "> [gomzik](#comment_105_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Поразмышлял чуток на тему. Это ж получается ZeroNet хорош тем, что по факту его посетители решают, какой контент останется в сети, а какой нет. Ресурс никому не нравится, пропадет через некоторое время или (если опциональные файлы какие) будет существовать частично. Будет нравится, будут и сидеры. Ну короче вроде и на поверхности, а вроде и все равно приятно это осознавать. Правда я так понимаю в скором времени нужно будет резолвить вопрос большого количества коннекшенов. В том плане что рядовой компьютер не может держать их бесчисленное множество. Тогда надо делать какую-то приоритезацию, что в данный момент раздавать\\скачивать, а что нет. Т.е. каждый ресурс у каждого пользователя начнет обрастать каким либо рейтингом (ручным или автоматическим). Думаю этот вот самый рейтинг было бы не плохо как-то и в открытый доступ агрегировать.\n\nВ твистере эти проблемы решены переодической ротацией и вполне успешно",
				"added": 1455633187
			},
			{
				"comment_id": 58,
				"body": "> [gomzik](#comment_112_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): а как оно в оригинальном сделано?\n\n\nА где оно сделано в оригинале?",
				"added": 1455633202
			},
			{
				"comment_id": 59,
				"body": "@gomzik,@nippletwister \nГм, я даже тему создавал о том что хочу саб-топики иметь на основном форуме... интересно как их сделать... Если вдруг кто копатся будет и найдет - скажите плиз =)",
				"added": 1455633323
			},
			{
				"comment_id": 60,
				"body": "Я подумаю что лучше, может дешевле вообще будет за $ взять домен, некоторые сервисы ака регистраторы предлагают, или надо всё по феншую с выкачиванием блокчейна и оригинальным клиентом?",
				"added": 1455634488
			},
			{
				"comment_id": 61,
				"body": "> [nippletwister](#comment_89_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Кстати, мне тут подумалось, что теоретически любой обычный интернет-ресурс может при желании запилить свой гейтвей в Зеронет и иметь здесь сайт. Обычные пользователи могут заходить через гейтвей (слабая безопасность), не видя вообще разницы между обычным интернетом, а продвинутые могут заходить напрямую.\n\nИ каким же образом ты предлагаешь динамику конвертить в статику?",
				"added": 1455637310
			},
			{
				"comment_id": 62,
				"body": "> [gomzik](#comment_137_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Чую я за несколько дней выем свой лимит в 100кб :)\nНу потом поднимим до мегабайта, время у меня и так по NTP подсасывается, странное если расходится",
				"added": 1455637734
			},
			{
				"comment_id": 63,
				"body": "> [gomzik](#comment_138_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Думаю тему \"закончилось место\" имеет смысл закрепить, как на зеротолке.\nКак обычно нигде не написано как это сделать...",
				"added": 1455641966
			},
			{
				"comment_id": 64,
				"body": "По идее прилепил, ждем обновления файлов...",
				"added": 1455642887
			},
			{
				"comment_id": 65,
				"body": "> [nippletwister](#comment_95_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Да, нам бы сюда еще картинки запилить. Небольшие можно для начала.\n\nНасчет картинок - нужно сорцы изучать того форума который уже запилил их к себе [тыц](http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN)",
				"added": 1455643704
			},
			{
				"comment_id": 66,
				"body": "Название придумал?)",
				"added": 1455646184
			},
			{
				"comment_id": 67,
				"body": "Может шире? Технические вопросы по работе сети ? а во второй линии описать твой блог то, что большая часть инфы есть там?",
				"added": 1455646464
			},
			{
				"comment_id": 68,
				"body": "А можно интересно удалять контент если банить пользователя? просто если написать пост на хабр то моментально форум будет засран чем повезет",
				"added": 1455647197
			},
			{
				"comment_id": 69,
				"body": "> [nippletwister](#comment_98_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): @Shift, а не в курсе, можно ли тебе как админу темы закрывать или блокировать/удалять? Или только лимиты выставлять? Я вот на своем клоне Зеротока не смог тему удалить (специально для попробовать сделал клон)UPD: опередил меня)\n\n=) Вот надо как-то подумать и решить что делать, тк тема важная тк спама будем много в будущем\n\nИли может @gomzik возьмется за это гордое дело?)",
				"added": 1455647617
			},
			{
				"comment_id": 70,
				"body": "> [gomzik](#comment_150_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Банить можно. Удалять потенциально не получится, потому что ты не сможешь подписать пользовательский контент\n\nГм, ок, а скрывать? \n\nт.е идея такова - даём при реге минимальный обьем места (ну скажем 10-20 комментов) и если человек не творит хуйни - выделяем больше. Но вообще должна же быть красивая реализация через конфиг т.е что бы при забанивании ключа папка удалялась (у всех)",
				"added": 1455647813
			},
			{
				"comment_id": 71,
				"body": "> [nippletwister](#comment_99_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Может спросить у nofish как лучше банить и удалять неугодных?)\n\n\nМне кажется его мы уже задолбали =)",
				"added": 1455647832
			},
			{
				"comment_id": 72,
				"body": "Просто я так подумал - если без этих функций выйти в свет (хабру?) то засрут в миг, а если не писать про русское коммюнити тут - то многие не оценят",
				"added": 1455648178
			},
			{
				"comment_id": 73,
				"body": "Ну есть БД которая генерится на основе json а он в свою очередь именно то, что мы пишем. Так вот, по идее на этапе генерации БД можно забороть это всё",
				"added": 1455648450
			},
			{
				"comment_id": 74,
				"body": "В соседний русскиф форум вбросил ссылку к нам, надо объединятся",
				"added": 1455791388
			},
			{
				"comment_id": 76,
				"body": "> [nippletwister](#comment_144_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Можно какую-нить фишку придумать, которая будет давать сигнал сидерам, что автор данного сайта не хочет больше его поддерживать. Например, в заголовке писать [deleted by author].\n\nПоздравляю, вы придумали TTL для начала надо что бы его впилили для юзер контента и что бы ментейнер сайта мог изменять этот порог, таким образом можно и модерирование делать (обнуляя TTL) да и много-чего полезного. \n\n> [nippletwister](#comment_145_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): 90% ФАКа переведено.\n\nГде движуха проходит тоо?",
				"added": 1455807768
			},
			{
				"comment_id": 77,
				"body": "желающие топик про TTL могут поддержать апвойтами http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:3_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/TTL+for+everything",
				"added": 1455810170
			},
			{
				"comment_id": 78,
				"body": "новую ревизию выпустили кстати",
				"added": 1455812260
			},
			{
				"comment_id": 79,
				"body": "там для конечных юзеров не интересно, по этому и не запостили видимо",
				"added": 1455816418
			},
			{
				"comment_id": 80,
				"body": "> [nippletwister](#comment_153_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Прикольно, надо будет разузнать про это. Кстати автору Пандоры, могла бы такая возможность понравиться)Ну и вообще общаться на форуме без браузера - это интересно.\n\nЗачем?",
				"added": 1455876562
			},
			{
				"comment_id": 81,
				"body": "ну так вебморда общается через websocket бери этот сокет да и гоняй через него команды, удобно и риалтаймово",
				"added": 1455886244
			},
			{
				"comment_id": 82,
				"body": "Новости про эту сеть начали делать https://torrentfreak.com/play-p2p-impossible-shutdown-160301/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Torrentfreak+%28Torrentfreak%29",
				"added": 1456921817
			},
			{
				"comment_id": 83,
				"body": "> [nippletwister](#comment_197_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Запостили, на торрентфрике статью про здешний сайт Play, мол это - прорыв (что в общем-то правда).\n> Вот этот пост меня веселит: https://habrahabr.ru/post/278325/Неужели ребята на Хабре настолько умные и исключительные, что не могут понять почему это у них трафик падает аж с 2012-2013 года? ППЦ, более закрытого для общества сайта я еще не встречал. Посты только по приглашениям, комменты только по карме. Короче бред полнейший, сообщество их вначале росло, а потом неизбежно выродилось. Стал таким илитным клубом, до которого всем вообще нет дела. Если не исправятся то так и сгинут в туман. Любое сообщество с высоким барьером для вступления новых членов рано или поздно вырождается. Се ля ви. А когда-то хороший был ресурс.\n\nимхо там проблема не в закрытости",
				"added": 1456933227
			},
			{
				"comment_id": 84,
				"body": "не удивительно что завезли http://www.opennet.ru/opennews/art.shtml?num=43975 если есть кто знакомые с  этим сайтом намекните о нашем уютном им",
				"added": 1457006494
			},
			{
				"comment_id": 85,
				"body": "добавил флаг в название что бы в списке искать было легче",
				"added": 1457019422
			},
			{
				"comment_id": 86,
				"body": "пора думать о модерации/блокировках на примере @request",
				"added": 1457105061
			},
			{
				"comment_id": 87,
				"body": "> [esteban](#comment_3_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): У меня такое предложение, если конечно это не сложно реализовать. Можно ввести target(сложность) для открытых адресов новых пользователей. Чтобы создание адреса/id занимало время. Тогда банить будет быстрее, чем создавать новые аккаунты. A target же менять в зависимости от условий. Поднимать во время наплыва. \n> Насчет самой модерации у меня есть тоже идеи, как сделать все более правильно. Но это уже более сложно будет. Хотя в перспективе это дает лучший принцип модерации, чем сейчас популярен в интернете.\n\nРазработчик основной сказал, что он вначале хочет сделать multi user сайты для того, что бы можно было сделать что-то типа твиттера/соц сетей а потом уже допилит существущие сайты фишками типа модерации. \n\nТут же есть свои ограничения - можно в момент наплыва закрыть возможность логина новым пользователям или разрешить только 1 сообщение",
				"added": 1457107812
			},
			{
				"comment_id": 90,
				"body": "> [gomzik](#comment_218_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Предлагаю забанить его по zeroid для начала\n\nЕсли ты о спамере - так уже",
				"added": 1457118489
			},
			{
				"comment_id": 91,
				"body": "> [gomzik](#comment_218_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Предлагаю забанить его по zeroid для начала\n\nЕсли ты о спамере - так уже",
				"added": 1457118499
			},
			{
				"comment_id": 93,
				"body": "> [miklosh](#comment_6_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK): кто решает кого банить а кого нет? как это технически осуществляется?\n\nВ папке с сайтом /data есть файл конфигурации там перечислены лимиты на свободное место для всех или для каждого пользователя уникально, если указать там Zeroid желаемого человека к бану и поставить 0 - он будет забанен и не сможет ничего тот писать. Редактировать файл может обладатель сайта.",
				"added": 1457172807
			},
			{
				"comment_id": 94,
				"body": "> [esteban](#comment_7_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): А так ли надо. Торрентов в интернете хватает. Если всё подряд сюда нести, то, к примеру, база рутрекера более 4 Гб. Другое дело - небольшое и хорошо оформленное, вроде Play. Но это всё равно не интересно. \n> Можешь зайти на zerotorrents и добавить русский торрент туда. Будут тебе в зеронете русские торренты.\n\n\nЛогично было бы такие сайты как рутрекер при переносе сюда дробить на подразделы, таким образом желаемые разделы будут занимать в районе 100 мегабайт что приемлемо (нет правда, мне прям весь рутрекер не нужен я им не пользуюсь целиком)",
				"added": 1457172894
			},
			{
				"comment_id": 97,
				"body": "> [ph](#comment_2_1QH8SFnofdxLUZh5aqy1EgEms1UZAsemVD): Как тут сайты искать?\n\nПоиск как такового тут нет, как некий список есть http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F  \n\nНу и вообще сайтов тут не так много в данный момент, из популярных форума, имиджборда ну и play",
				"added": 1457174510
			},
			{
				"comment_id": 98,
				"body": "> [ph](#comment_3_1QH8SFnofdxLUZh5aqy1EgEms1UZAsemVD): А зеркало сайта, например grani.ru в ZeroNet можно сделать?\n\nНу если тупо статикой без динамики - copy-past в помощь\n\nА вообще  - тут архитектура сайтов другая надо переделывать что бы работало, теоритически за основу можно местные блоги взять",
				"added": 1457175010
			},
			{
				"comment_id": 106,
				"body": "> [esteban](#comment_10_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Да, это самый правильный подход. Вообще, в ближайшее время, как мне кажется, нужно делать такие форумы, но только более узкой тематики. Это удобно, потому-что и объем меньше, и модератор на каждый свой. А так как тут ZeroID везде принимается, то проблем никаких. А блоги больше для персональных страничек. И новостные сайты если и переносить, то лучше в виде блога.\n> Вообще, я бы назвал ZeroNet ещё и как Zero cost network (почти). Пока твой сайт интересен другим пользователям, тебе это ничего не стоит. Не нужно оплачивать содержание сервера, покупать домен. А потом думать как же отбивать траты и монетизировать ресурс через рекламу. Потому, надеюсь, что здесь реклама никогда в том виде, в каком она существует в интернете не появится.\n\nЕсли будут новостны издания - в любом случае будет реклама, зарплату чем-то платить надо. \n\nto splitfire, никак, они не реализовывали этот функционал",
				"added": 1457177854
			},
			{
				"comment_id": 108,
				"body": "> [splitfire](#comment_3_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): esteban: надо отдельный ник мутить и потихоньку магнеты, например, с рутора перетаскивать :)\n\nТы можешь клонировать play и наполнить его русским контентом, если тема интересна готов статью написать",
				"added": 1457178272
			},
			{
				"comment_id": 110,
				"body": "> [splitfire](#comment_4_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): было бы замечательно, пока только официалку читал. еще непонятно: при логине отображается \"select account\" и выбрано \"unique to site\". Это я понимаю уникальный привязанный только к одному сайту логин? И он почему то не прокатывает, только zeroid\n\nПотому, что не реализовали это разработчики и проще везде использовать единый ID, но можно и уникальный для каждого сайта.\n\n> [esteban](#comment_13_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот отсюда все проблемы. Таких новостных изданий не надо. Если человек пишет за зарплату, то лучше бы вообще он ничего не писал. Централизация не на сайтах, она в головах. Вот прямо сейчас здесь вам предлагается возможность держать сайты по принципу, пиши что тебе интересно и читай что тебе интересно. Но нет, надо же сразу стремиться притащить централизованные ресурсы по принципу: хочу общее место через где меня будут кормить информацией.\n\nНе согласен, есть медуза которая торт, грани те же",
				"added": 1457178668
			},
			{
				"comment_id": 111,
				"body": "> [splitfire](#comment_10_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): понятно, кстати интересно почему рутрекер сюда не перебазировался, а начал двигаться в сторону i2p?\n\nВ каком месте он начал двигатся в i2p? А даже если так - что бы переьратся сюда - нужно закопать много капитальных затрат по переписыванию движка и миграции базы и как-то синхронизировать еще всё а i2p/tor - транспорт для существующего http трафика",
				"added": 1457179750
			},
			{
				"comment_id": 113,
				"body": "> [splitfire](#comment_16_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): если пашет тор - то видит беспорядочные соединения с непонятным (для него) содержимым. Если тор не пашет, то видит тоже непонятные сообщения (считай шифрованные) только с другими адресами\n\nК слову - соединения таки шифрованные внутри zeronet так, что установить что передают юзер - нельзя но по идее насчет какого сайта  - можно. Но это не задача этой сети имхо, прятать такую информацию.",
				"added": 1457198518
			},
			{
				"comment_id": 114,
				"body": "> [splitfire](#comment_20_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): каким образом? заголовки, я думаю, тоже шифруются\n\nгм, ты к трекеру должен обратится с инфохэшем для получения пиров, что это за хэш подсказать?",
				"added": 1457199459
			},
			{
				"comment_id": 115,
				"body": "> [82456783](#comment_2_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): очевидно что проект создавался для чего-то. никто не будет тратить месяцы работы ради тупого клона обычного интернета, который умрёт когда всем станет скучно\n\nДве ссылки на github этому господину",
				"added": 1457200370
			},
			{
				"comment_id": 116,
				"body": "Господа теоретики, шифрования в DHT сетях всегда (ВСЕГДА) происходит не на том уровне OSI, а выше т.е при установке соединения в любом случае будет виден IP + инфо хэш \n\nНо его можно скрыть по средствам tor. \n\nНО (!) во время обмена данными уже всё защифрованно следовательно нельзя привязать ник или данные тут к конкретному юзернейму при перехвате. \n\nПри желании полного шифрования стоить его делать на L2/L3 а не выше. \n\nНа мой взгляд следует данную сеть рассматривать как шаг от централизованной архитектуре к распределенной а о том, как скрыть свой IP я описал выше.",
				"added": 1457201518
			},
			{
				"comment_id": 118,
				"body": "> [krokozz](#comment_1_1C2E5FajzUoD1VXMdgmjMCCAABEKoug9QM): Политота набежала на наши форумы. Айайай, теперь то нас всех точно закроют.\n\nУ нас всё патриотично, флаг в названии, можем еще фото главно повесить при входе",
				"added": 1457201933
			},
			{
				"comment_id": 120,
				"body": "> [krokozz](#comment_2_1C2E5FajzUoD1VXMdgmjMCCAABEKoug9QM): Каноническая проблема всех даркнетов. Видно что некто участвует в работе такой сети, но раскрыть его действия одним только зеркалированием на порту сложно.Вопщем кто хочет оппозицию внутри зеронета развести - вэлком, но если прихватят, то из-за ваших же ошибок.\n\nИменно, тем более даже при сильном шифровании если не гонять шум по порту вполне спокойно можно вычеслить поциента. Для опозиций пожалуй лучше i2p",
				"added": 1457202293
			},
			{
				"comment_id": 121,
				"body": "> [esteban](#comment_28_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Это очень ценный совет, с тем условием, что браузеры сейчас очень легко вычислить по их уникальности. В том же торбраузере даже изменение размеров окна уже легче тебя вычислить.\n\nTails в помощь. \n\n> [zeroatom](#comment_8_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Не в этом дело, а в откровенном мнении людей. А этого можно добиться только на полностью анонимном ресурсе для человека, который будет уверен в своей безопасности. Где такой ресурс? С учетом всевозможных  методов дианона...МешСети?\n\nВ чем проблема то, натягиваем VPN до желаемой страны с мнениями которой вы согласны и с вашего уютного уже отправляйте то, что нравится, не вижу проблем.",
				"added": 1457202824
			},
			{
				"comment_id": 123,
				"body": "> [zeroatom](#comment_9_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Проблема в видении будущего, а там надо учитывать, что VPN ,и2п\\фринет, - всё это можно закрыть на уроовне провайдеров к чему и идут рк...я понимаю что здесь и сейчас это актуально, но надо хоть чуть чуть смотреть в будущее тех людей, которые пока что только смотрят сериалы, читают пикабу и потихоньку задают правильные вопросы :)\nУбер решения не сделать, проблема каналов всегда будет, если пойти дальше - то будет только mesh сети, но тоже не панацея тк никто не отменял возможность запретить wi-fi.",
				"added": 1457203641
			},
			{
				"comment_id": 124,
				"body": "Но я и не вижу в этом смысла, запретить можно всё, я к этой сети отношусь судя по всему не так как вы, это скорее новое поколение веба чем 100% защита от цензуры. ИМХО от цензуры могут защитить немного другие методы",
				"added": 1457203718
			},
			{
				"comment_id": 125,
				"body": "> [82456783](#comment_32_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): нет, нетусама его суть, что \"для анонимности пользуйтесь чем-нибудь ещё\" сводит всё на неттак там же я могу и общаться свободно, нахуй мне зеронет тогда?\nНу что за школоло ответ то, открываем модель OSI и смотрим о чем я писал 20+ постов назад о том, что шифрование должно быть на L2/L3 а не на пркладном уровне.",
				"added": 1457214801
			},
			{
				"comment_id": 126,
				"body": "> [zeroatom](#comment_25_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): в уме крутится ответ в стиле: Отвлекают внимание разработчиков от по настоящему эффективных и сверхполезных, сверхпотенциальных проектов на подобие mesh сети.Где появится инет беспроводной,высокоскоростной,бесплатный,анонимный и всё в такой ключе :)\n\nТут половина тусовки из тусовки mesh сетей которые пришли из тусовки твистера, не уверен что ты можешь спорить на том же уровне. Я например, знаю какие проблемы сейчас не дают возможность выстрелить Mesh сетям в мире. Да в идеале нужно комбинировать ZeroNet + Mesh именно такая связка даст то что надо, и анонимность и быстродействие и второе без первого существовать не сможет (адекватно, а не как сеть скорость в которой пару мегабит и 100500 хопов)",
				"added": 1457215102
			},
			{
				"comment_id": 127,
				"body": "Срач то какой получился, я прям удивился, интересно от куда ты 82456783  к нам пришел? хабр? лор? просто интересно",
				"added": 1457215312
			},
			{
				"comment_id": 129,
				"body": "Как я и написал - mesh сети сами по себе бессмыслены из-за большого количества хопов, а вот этот проект может помоч в этом",
				"added": 1457216324
			},
			{
				"comment_id": 130,
				"body": "> [nippletwister](#comment_238_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А хопы - это что такое, прыжки от узла к узлу?\nХопы в трассировке, если мы говорим о Mesh сетях скажем, в рамках страны, и пользователь подключается, во владимире, а сервер стоит в москве, между ним может быть более 1000 участников, каждый добавит свои милисекунды\n\n> [zeroatom](#comment_37_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): как он может помочь и какие проблемы сейчас, или чего не хватает для лучшего развития ? :)\n\nСделай trace route у себя на пк и посмотри сколько узлов отделяет тебя от желаемого ресурса, а тепрь представь, что будет если их там будет 1000+ =) ?",
				"added": 1457217102
			},
			{
				"comment_id": 131,
				"body": "PS Решил что в меню справ будем коллекционировать полезные ресурсы по возможности отечественного производства, кто что думает?",
				"added": 1457217142
			},
			{
				"comment_id": 132,
				"body": "> [nippletwister](#comment_239_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Я думаю что меню - слева).\n\nДа, конечно =) туплю",
				"added": 1457217202
			},
			{
				"comment_id": 133,
				"body": "> [zeroatom](#comment_38_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Удобно, но вот зашел в сеть и сразу хочется почитать или понять зачем я тут.Какие возможности открываются не понятно :)как с нуля сделать блог? нужно ли изучать английский и привыкать к нему как к родному? :)\n\nНу имхо давно пора учить английский, а копирование любого сайта тут - 1 нажатие в графическом интерфейсе\n\n> [nippletwister](#comment_240_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ссылку на ZeroFaq на русском тож можно добавить.\nЧей сайт?",
				"added": 1457217795
			},
			{
				"comment_id": 134,
				"body": "> [nippletwister](#comment_242_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Мой)\n\n\nДоговорились, обновлять будешь?",
				"added": 1457217857
			},
			{
				"comment_id": 135,
				"body": "> [nippletwister](#comment_243_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Не факт, что оперативно, т.к. я с сайтостроением вообще не знаком, но там написано, что внутри директории с сайтом есть ФАК в формате md, т.е. его можно хоть в гитхаб залить при желании.\n\nДобавил",
				"added": 1457218101
			},
			{
				"comment_id": 136,
				"body": "> [esteban](#comment_31_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Скорее всего с сосача, там в это время форсили. Хотя на лоре и опеннете можно встретить похожих. И новость была на опеннете. Вообще он явно за этим и приходил, и может ему ещё тут понравится. С очередным баном по айпи, на своем ресурсе он будет здесь.\nНадо подумать что делать в этом случае, я не стал банить тк это бессмыслено да и он адекватный вроде бы.\n\n> [esteban](#comment_32_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Сслыка на EN-ZER0TALK ведет на FAQ\nПофиксил",
				"added": 1457218707
			},
			{
				"comment_id": 137,
				"body": "> [esteban](#comment_33_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): У меня есть идея насчет этого, но просто так её не применить на текущемо форуме: это модераторские подписки. Как адблок, только на уровне модерации. То есть пользователи сами включают, если хотят.\n\nНе согласен тк одна из целей спама - наполнить форум бессмысленным котнентом утяжелив его. Это было в Osiris - не взлетело",
				"added": 1457218941
			},
			{
				"comment_id": 138,
				"body": "> [esteban](#comment_35_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): но против утяжеление же тут ограничение есть\n\nА кто мешает скриптом менять zeroid регая новые и так до посинения создавая новые темы засирая места у всех?",
				"added": 1457219040
			},
			{
				"comment_id": 139,
				"body": "> [nippletwister](#comment_247_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Остается только моя ненавистная всеми тема - платные сообщения и рейтинги)\nЕсли только proof of burn но это имхо не надо\n\nЯ по другому хочу - разобратся как работает ZeroID и сделать возможность вязать ZeroID к соц-сетям, это позволит повысить авторитетность (да да знаю сейчас меня анонимусы закидают) но тем не менее это позволит индекс доверия учетки повышать автоматически предоставляя больше места или другие плюшки\n\n> [vlad20012](#comment_1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): @shift Написал бы что-то вроде дайджеста, что за год произошло в p2p: как там cjroute, twister, поживают, а то год уже тебя на хабре не видать, а тут зеронет вдруг, с чего бы это?\n\nЯ в посте уложусь =) \nTwister  умирает и аудитория перекочевывает сюда, разработчик зеронета обещал сделать мульти сайты (т.е когда есть один большой аля твитер а лента каждого человека его личный сайт) это позволит запустить соц-сети раньше в твистере было много китайцев, но кого то там посадили в китая, после этого они ушли или их стало мало. \n\ncjdns - разработчик полу закрыл репозиторий и пилит его в узком кругу, довольно давно не слежу из-за одной проблемы - что бы сделать mesh сеть нужно иметь дешевое wi-fi оборудования причем которое может работать в режиме network+ad hock это в лучшем случае малинка но не могу сказать что бюджетно. Так то ждем развития железа и дополивания протокола. \n\nПишу про зеронет потому, что на мой взгляд это единственное на что стоит обратить внимание и это не проект в себе (как твистер) а платформа для многих.",
				"added": 1457219516
			},
			{
				"comment_id": 140,
				"body": "> [esteban](#comment_38_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Неплохо было бы поднять инфраструктуру узлов, чтобы прокинуть ZeroNet в гиперборею, хотя это может быть и не так просто.\n\nЕсли на сервере с гипербореей запустить зеронет то он будет доступен и из неё - ничего делать другого ненадо, никакой настройки, это жу L2 =)",
				"added": 1457219587
			},
			{
				"comment_id": 141,
				"body": "> [esteban](#comment_39_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): А как будет доступ к узлам, которые вне зеронета, нужны же промежуточные узлы.\n\n\nты хотел сказать вне гипербореи? да нужны, если он cjdns only узел то надо городить какую-то систему бриджей но по факту если есть пир который подписан на сайт и имеет доступ к двум сетят то все остальные тоже получат доступ к целевому ресурсу",
				"added": 1457219812
			},
			{
				"comment_id": 143,
				"body": "> [zeroatom](#comment_42_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Ребят это получается:Чтобы видеть ресурс(сайт-визитка например) таким какой он в инете, его следует перенести весь в Zeronet и при этом надо раздать его?а если я единственный раздающий и выключаю пк пока сплю... :)\n\nНа начальных этапах или сервер взять или на любом гейте зайти на него",
				"added": 1457220569
			},
			{
				"comment_id": 145,
				"body": "> [zeroatom](#comment_43_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Так сайт надо будет переносить к себе на пк? и что такое гейте ? :)\nпункт Какие есть гейтвеи (gateways) / прокси в ZeroNet? в FAQ",
				"added": 1457220940
			},
			{
				"comment_id": 146,
				"body": "> [nippletwister](#comment_254_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): есть.\n\nЯ знаю что есть =) это я его туда отправил. Ты бы их сделал анкорами что бы можно было ссылки дават, вообще шик был бы",
				"added": 1457221023
			},
			{
				"comment_id": 147,
				"body": "кстати всех поздравляю, мы осмысленно (временами) нафлудили больше сообщений, чем в теме тест на основном форуме.\n\n> [nippletwister](#comment_255_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Я не знаю как)\nОк, потом напишу тебе как)",
				"added": 1457221085
			},
			{
				"comment_id": 148,
				"body": "> [zeroatom](#comment_44_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): а ссылки тут не принято кидать? или опасно? :)\n\nТак вот же http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke\n\nPS Добил перевод нашего уютненького на великий могучий",
				"added": 1457221472
			},
			{
				"comment_id": 149,
				"body": "> [nippletwister](#comment_257_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Надо еще ZeroBoard переплюнуть))\n\nОн же вроде централизованный и старый",
				"added": 1457221703
			},
			{
				"comment_id": 150,
				"body": "wow wtf? http://127.0.0.1:43110/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg",
				"added": 1457221804
			},
			{
				"comment_id": 151,
				"body": "> [nippletwister](#comment_259_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А что не так там?\nДа я первый раз увидел этот сайт (Чат?) он давно? от куда он? и народу там много",
				"added": 1457222094
			},
			{
				"comment_id": 154,
				"body": "> [kostanew](#comment_1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Запустил первый раз, не могу понять, а почему ни на одном форуме или сайте нет нормальных разделов?\nОни есть и даже можно тут сделать, только пока потребности небыло\n\n> [esteban](#comment_46_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Когда megaupload закрыли, была такая табличка.\n\nНу табличку может любой и любую сделать",
				"added": 1457259989
			},
			{
				"comment_id": 157,
				"body": "> [nippletwister](#comment_264_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): @shift, а куда ты дел ссылки, которые слева были? Вроде прикольно смотрелось.\n\nпри уменьшении окна наплывало одно на другое, я закомментировал временно, на неделе постараюсь разобратся",
				"added": 1457266304
			},
			{
				"comment_id": 159,
				"body": "Нафлудили вы тут без меня, вижу двачеры к нам начали заходить, ну что ж, ожиаемое, у них то там уныло, всех к нам тянет :D \n\nА теперь серьезно, насчет модерации: У нас есть два варианта как можно \n1) Ждать nofish\n2) Прикрутить свою но front-end эдишен. Если кто хочет обмазатся Javascript пару раз - предлагаю поучавствовать =)",
				"added": 1457307505
			},
			{
				"comment_id": 160,
				"body": "> [vlad20012](#comment_37_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): @shift, даров. Я тут авторизацию через гугл запиливаю. Ты вчера что-то говорил по этому поводу, еще не передумал?)\nВсецело за! не говорю что это будет only но как опция для повышения лимита - шикарно, ты как клон zeroid пилишь?",
				"added": 1457308409
			},
			{
				"comment_id": 161,
				"body": "> [vlad20012](#comment_38_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Да. А вообще буду рад лично пообщаться. Мой юзернейм здесь соответствует скайпу, hangouts, и TOX (Ну или 1D6F0445DF17E58DE0392C3BE79CD7C9967CC647B47D7EA7612B21877154A12CB986B463D837)\n\nМожно завтра да. первым не пользуюсь, вторым можно, может рассово неверный telegram?",
				"added": 1457308660
			},
			{
				"comment_id": 162,
				"body": "> [vlad20012](#comment_39_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): А вот это уже я не юзаю\n\nНу ок, давай tox тогда, ну и тут почта тоже вполне работает",
				"added": 1457308814
			},
			{
				"comment_id": 163,
				"body": "> [vlad20012](#comment_41_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Весь день сегодня ковыряю) Не сказать, что доволен всем этим\n\nЯ SQL местый ковыряю, может тоже что рожу",
				"added": 1457308910
			},
			{
				"comment_id": 164,
				"body": "> [vlad20012](#comment_43_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Кстати, я тут ниже высказывал одну мысль, но мне даже самому уже влом ее искать в этой горе флуда. Запилить в зеронет обычные торренты и онлайн плеер - что-то вроде popcorn-time. Тогда про нас сразу в Times напишут\n\nНу есть web torrent его сюда запилить лучше в формате модуля и погнали, но не очень хочется что бы сеть сразу окрестили пиратской",
				"added": 1457309887
			},
			{
				"comment_id": 167,
				"body": "> [gomzik](#comment_231_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Так я ж в процессе. И да, готов принять контрибьютеров.\nхм, может концепт сам обсудим хоть? я в sql тут покопался, вроде всё просто и обыденно\n> [splitfire](#comment_78_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): мне кажется или народу поубавилось?\n\nЯ тут немного порылся в коде и некоторые ключевые слова внес в некоторый список, возможно из-за этого некоторые пропали",
				"added": 1457360850
			},
			{
				"comment_id": 170,
				"body": "> [gomzik](#comment_241_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Так я пока что называется воспроизвожу то, что есть. Надеюсь получится сделать совместимый по данным вариант\n\nгм, у меня проще идея или делаем новую таблицу для бана в которую имею права писать не все а только те которые перечислены в content файла или тему из тела которой забирать эту инфу (криво) после же через sql not in (1,2,3) исключать. \n\nИ главное - сделать даунвойт для сообщений/тем/юзеров",
				"added": 1457361600
			},
			{
				"comment_id": 171,
				"body": "> [gomzik](#comment_242_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ой, подожди. А если туда zeroid.bit вставить? :)\n\n\nв issue пример надо и на общий форум",
				"added": 1457361644
			},
			{
				"comment_id": 172,
				"body": "> [gomzik](#comment_243_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): тут только про даунвойт все говорили, мол пусть сообщество решает\n\nДаунвойт это прекрасно, но тут недавно был набег двача который срал активно, и учти, что никто не мешает устроить им набег и отминусить тебя и/или меня как разновидность тролинга. имхо стоит брать с лепры когда сообщения все есть но они скрыты (если карма низкая) но каждый может их развернуть их",
				"added": 1457361759
			},
			{
				"comment_id": 173,
				"body": "> [gomzik](#comment_248_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): и да, ваши флажки не работают в моих линуксах http://i.imgur.com/E0Q1U0r.png\nСтранно, это стандартный emoji",
				"added": 1457363633
			},
			{
				"comment_id": 174,
				"body": "> [vlad20012](#comment_55_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Я уже не только обновил, но и разраб уже ответил =)\n\n\nиии? шо там то?",
				"added": 1457363666
			},
			{
				"comment_id": 175,
				"body": "> [kostanew](#comment_8_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/zaphods.bit/RM.html - ZeroNet Roadmap. Cписок что есть и чего хочется.http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN - shift, обрати внимание, тут в движок ZeroTalk добавили загрузку картинок (как они сами заявляют, я не тестировал).\n\nКартинки видел, gomzik тут пилит улучшенный форум и активно звал по учавствовать\n\n> [splitfire](#comment_101_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): теперь 30 кб - совсем издевательство\n\nТак у тебя же больше должно было стать\n\n> [vlad20012](#comment_74_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Хмм, ну картинка, вроде, вставляется. А в API методов для загрузки файлов с другого сайте не видать.\n\nРазраб писал что не слишком секурно инлайном вставлять + моральные аспекты тк пользователь будет автоматом грузить сайт B при вставлении картинки с него на А",
				"added": 1457368747
			},
			{
				"comment_id": 176,
				"body": "> [splitfire](#comment_102_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): я про умолчания для новичков\n\nЭто от набегов двачеров защитит. Для повышения лимита я считаю нужно сделать два варианта на выбор - ручное увеличение (как сейчас) или авторизация через соц-сети - оба этих метода отфилтруют лишних. Ну а там глядишь будет новый API который в ZeroMe будет использоватся который позволит лучше работать с ограничериями",
				"added": 1457368950
			},
			{
				"comment_id": 177,
				"body": "> [vlad20012](#comment_79_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): У меня редактировалка сообщений что-то сломалась, так что удаляю и посылаю заново\n\nДобавил места, а редактирование криво работает в safari еще, точнее кнопки вообще не отображаются..",
				"added": 1457369066
			},
			{
				"comment_id": 178,
				"body": "> [splitfire](#comment_113_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): ща заметил что этот сайтик использует базу data/users/zerotalk.db это последствия \"Clone\"?\n\nНу так папка то его, а название БД я не менял",
				"added": 1457433999
			},
			{
				"comment_id": 180,
				"body": "> [splitfire](#comment_120_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): а если сейчас поменяешь? :)\nЕсли отредактировать структуру БД и её имя то она у всех будет пересоздана",
				"added": 1457435078
			},
			{
				"comment_id": 181,
				"body": "Кто помнит как саб-топики делать? помню nofish ссылку давал как-то",
				"added": 1457437451
			},
			{
				"comment_id": 182,
				"body": "> [zeroatom](#comment_53_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Ребят, а почему нельзя клонировать http://127.0.0.1:43110/ZeroPolls.bit ? :)\n\nОбладатель сайта может запретить клонировать",
				"added": 1457447037
			},
			{
				"comment_id": 185,
				"body": "> [qw](#comment_13_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Именно коробочный Tor, или и прикрученного в ZeroNet'е хватит? \n> На какой трекер они публиковаться и как посмотреть? Не совсем понял.\n> И интересует именно сама схема вычисления. Предположим, что ты скачал сайт и он раздаётся другим пирам, как майор может это вычислить? Он один из них же? А как он узнает, что именно ты вот то передал, а не кто-то другой. И ведь файлы не прям вот так,  как я понимаю, один за одним, от тебя к предположительному майору передаются, а от всех понемногу. Поэтому хотелось бы это немного прояснить.\nЗа матчастью тебе лучше в youtube/wiki по поиску торрент/bittorent тут очень похожий/аналогичный механизм",
				"added": 1457450767
			},
			{
				"comment_id": 187,
				"body": "> [splitfire](#comment_133_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): про бутстрап то никто не говорит, та же i2p все равно бутстрапится с хардкод адресов, хотя может и без них, но долго\nРазраб собирает донат на доработку DHT\n\n> [requrequ](#comment_7_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss): ЕЩЕ ОДИН ТРЕКЕР \n> http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3\nПользователь ушел в бан за [1](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/img/upload/1.png) [2](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/img/upload/2.png) [3](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/img/upload/3.png)",
				"added": 1457507861
			},
			{
				"comment_id": 188,
				"body": "> [leinariys](#comment_41_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Более 240000 магнит ссылок РУТРЕКЕРАПополнение продолжается!http://127.0.0.1:43110/1BrodevWLcCZNwcdQK9v2FknSBUhK281oT\nИмхо кино лучше брать с kinozal.tv а не с рутрекера",
				"added": 1457507956
			},
			{
				"comment_id": 190,
				"body": "> [nippletwister](#comment_283_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Все комменты requrequ исчезли? А как это реализовано? Просто лимит ему выставили нулевой, или просто сообщения скрываются от его имени?\nизменил SQL запрос который отображает сообщения, некоторых (двачеров?) до него я еще по ключевым словам блокировал\n\nЛучше варианта пока нет..",
				"added": 1457508241
			},
			{
				"comment_id": 191,
				"body": "> [vlad20012](#comment_113_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Хмм, ты же можешь банить точно также, так лимит высталяешь, в пермишанах. Кроме того своей подписью владелец сайт может (в теории?) изменять данные пользователя. А ты как это делаешь, что-то я не понял\n\nОт того, что я ему поставлю лимит 0 - файлы не удалятся (насколько я тестировал) да и овервайтить контент админ же тоже не может если он с чужой подписью",
				"added": 1457508528
			},
			{
				"comment_id": 193,
				"body": "> [leinariys](#comment_45_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Парни загрузил самый польшой каталог рутрекера 80 мегобайт и это писац) осталось ещё 400 мегабайт загрузить , надо?Оно кому-то надо?\n\nТебе написали\n1) Что бы не всё разом грузилось а on demand\n2) рутрекер не хорош для фильмов - есть кинозал",
				"added": 1457513459
			},
			{
				"comment_id": 197,
				"body": "> [netflow](#comment_2_1NPh8RCmZGPXpchZrLes9dhcSv5sNoPBiK): Сайты я так понял скачиваются полностью или только просмотренные посетителем страницы?\n\nВ зависимости от настроек сайта, этот - полностью и тут нет понятия страницы, тк весь этот сайт - 1 страница набор стилей скриптов и БД. \n\nДругие же - пример - который каталог gif он подгружает только сам контент в момент просмотра, подробнее можешь посмотреть сдвинув иконку 0 в лево",
				"added": 1457540781
			},
			{
				"comment_id": 198,
				"body": "похоже выглядит, но там на nodejs",
				"added": 1457550075
			},
			{
				"comment_id": 200,
				"body": "> [leinariys](#comment_46_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Закончил Админку чисто для своей структуры БД по адресу 1Nepe91gkzrRbPXE1LKaAQm42ERoiAUhhu/dataК PLAY не подойдёт с ходу, надо подкручиватьhttp://127.0.0.1:43110/1Nepe91gkzrRbPXE1LKaAQm42ERoiAUhhu\n\nМануал на хабр/сюда в блог написать не хочешь?",
				"added": 1457599344
			},
			{
				"comment_id": 201,
				"body": "> [nippletwister](#comment_292_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Кстати, спам от requrequ, все еще виден на ZeroHello при включенной кнопке 'Follow in Newsfeed'. А внутри самого форума сообщения не видны. Этот товарищ решил спамить всюду, даже Екатерининому блогу досталось.\nСкоро попробую вариантс с вытиранием его из БД, если не выйдет - буду все SQL запросы модифицировать с возможностью фильтрации...",
				"added": 1457599453
			},
			{
				"comment_id": 205,
				"body": "> [leinariys](#comment_47_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): А чего писать? я хзможешь позвонить в хэнгаутс логин тот жеТут картинки не могу прикрепитьНа хабре нет инвайта\n\nВопрос с хабром решаемый, написал бы про разработку под zero",
				"added": 1457636716
			},
			{
				"comment_id": 206,
				"body": "> [kostanew](#comment_48_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Я тут написал сайтик, он демонстрирует опциональные файлы и игру музыки через audiojs. По идее один файл должен грузиться сразу, а один при запуске плеера. Проверить не смогу еще сутки.Если кому интересно, то можете попробовать запустить сайт сами. Музыка из Public Domain. Лицензия библиотеки MIT ( http://kolber.github.io/audiojs/ ).\n> https://github.com/kostaNew/zeronet-audio-demoАдрес сайта: 1B3MjcF3y7UiSMgevjnso5JVNFMz2ci2ME все уже подписано\n> Если заработает, обещаю написать подробный туториал на русском языке, который включит основную документацию и про опциональные файлы на самом базовом уровне...\n\nNO PEERS FOUND в данный момент, у тебя порт закрыт/nat чтоль?",
				"added": 1457636819
			},
			{
				"comment_id": 207,
				"body": "> [kostanew](#comment_51_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А кто-нибудь может порекомендовать VPS где бы можно было поднять ZeroNet с открытым портом не дорого?\n\nDigitalocean за 5$ тебе еще там отсыпят бонусов при реге, если реферальная\n\n> [vlad20012](#comment_129_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): infobox.ru?\n.ru сириусли? так он его как VPN сможет его юзать хотя бы",
				"added": 1457637759
			},
			{
				"comment_id": 208,
				"body": "> [vlad20012](#comment_130_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): У них в амстердаме сервера\n\nюр лицо и офис в РФ https://infobox.ru/about/career/#rukovoditel-napravleniya-infoboxcloud-i-office24 \nМой внутренний параноик негодуэ",
				"added": 1457637886
			},
			{
				"comment_id": 214,
				"body": "> [kostanew](#comment_53_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Плагины тоже довольно легко писать, как оказалось. Там просто навешивание декоратора на любую функцию ядра. Думаю обвеситься на WebSocket и сделать демку с установкой контента из .deb пакетов или выплевыванием собственного лога в сайт.\nВижу ты неплохо в архитектуре проекта разобался, может поможешь разрабу пилить ядро? можно донат организовать тут ну или другую помощь, я со своей стороны VPS дать могу.",
				"added": 1457648754
			},
			{
				"comment_id": 217,
				"body": "> [kostanew](#comment_57_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/pedoblocker.bit/?Home - появился блоклист для говна. Надо бы пилить плагин с автозаменой файлов. Если файл в папке, перетирать его. Файл будет сломан и не будет раздаваться. Таким образом морально и юридически вы не участвуете в преступлении. Единственно что мне не нравится, это то что список не разделен. Зоофилия не наказуема в некоторых странах. Так же там нет малвари, которая тут обязательно появится скоро. Однако, такие списки палка о двух концах. Я бы просто сделал список плохих сумм по категориям.\n> Еще, конечно, есть проблема, если файл сделан не опциональным, то блокироваться будет весь сайт. Нельзя ни в коем случае повторить ошибку веба с блокировками всего целиком.\n> Список юзается в этом поисковике: http://127.0.0.1:43110/163ZAwi5BcGBm6UEwdJF1pkcejDMCT1kAj\n\nНу если посмотреть шире то вообще не вижу смысла в блоикровках, ЦА которая интересуется педофилией/CP и прочими вещами будет переодически выпиливатся с сайтов и в итоге перейдет на свой личный сайт/форум zerochan, пока со всеми набегами мы тут справляемся",
				"added": 1457687836
			},
			{
				"comment_id": 219,
				"body": "> [kostanew](#comment_58_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Это мне адресовано? Плохо понял кто что пнул, но еще раз и на русском. На самом деле решение по опциональным файлам описано прямо в документации по content.js и оно простое до безобразия...\n> Надо написать шаблон где лежат опциональные файлы, например так: \"optional\": \"audio_optional/.*\",После подписи все файлы отвечающие шаблону переедут в секцию \"files_optional\".Мой пример: https://github.com/kostaNew/zeronet-audio-demo\n> Вопроса остается два:\n> \n> Как делать touch для нужных файлов заранее или как случайно не делать touch из страницы когда они не нужны. От этого например зависит как будет работать тег audio...\n> Пользовательский контент можно класть абсолютно так же, со слов nofish, но надо сделать демку.\n> \n> Времени нет, а идей выше крыш.\nДемо в сети то будет?",
				"added": 1457694956
			},
			{
				"comment_id": 222,
				"body": "Скорость разработки возврасла с наплывом людей как я вижу =)",
				"added": 1457707033
			},
			{
				"comment_id": 226,
				"body": "> [kostanew](#comment_76_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Смотрите на ZeroNet не как на сайты, а как на приложения для Android, iOS. Тут есть прямые аналогии:подпись приложения и публикация в маркете -> siteSign, sitePublish; обновление приложения -> F5 на сайте; получение контента из облака -> опциональные файлы; рутованый доступ -> плагины. Теперь становится очевидно, что ZeroNet предоставляет вам возможности по обновлению приложения, доставки и распространению контента. Причем реализована наиболее сложная логика, которая знимает у разработчиков максимум времени и очень платформозависима.... Очевидным преимуществом для пользователя является БЕСПЛАТНОЕ облако.\n> А теперь посмотрите для чего ZeroNet подходит идеально: музыкальный плеер, а-ля vk.com музыка; референс менеджер, типа Mendeley, Zotero; интернет бибилиотеки - типа http://booksee.org/; распространение приложений и пакетов, по аналогии с PPA и кеширующим репозиториями apt-get и yum....Почему же это всего этого тут нет? Вспомните как Apple платила разработчикам приложений напрямую и какие отчисления получали первые разрабы под iOS. Сразу поймете проблему - нет разработчиков! А это из-за дерьмовой документации... Стандартные примеры не работают. Я потратил 8 часов на первый пример, но он так и не поддался (хотя я никогда не писал под фронтенд). Для плагинов нет описания вообще (напишу сам, если демку сделаю). Нужно улучшать и писать документацию. Срочно, блин, и русскую и английскую...\n\nТак ты не хочешь написать документацию? на русском/английском языке, с демками наприме, разрабу будет полезно - он лучше пусть ядро пилит ну и коммюнити тоже в плюсе. Заодно и на хабр запостишь - еще разработчики подтянутся\n\n[esteban](#comment_66_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Что самое интересное во всём этом, что когда люди приходят в более свободное простанство, будь то анонимный имиджборд, даркнет или вот зеронет, то говорить то особо и не о чем. Потому что все настолько свыклись с теми правилами, которые диктуют мейнстримовые сайты, что не могут вот так просто придти и пользоваться предоставленной свободой, и максимум в чём она выражается -- это в более агрессивных высказываниях и разговорах на самые очевидно противозаконные темы. Потому-что это первое что приходит на ум. И чтобы восстановить способность к свободному общению, нужно тут провести немало времени, восстанавливая его по крупицам.\n\n> Вот есть например зеронет, где прямо сейчас это возможно, но все что тут есть, что в русскоязычном, что в англоязычном сегменте, ограничивается преимущественно разговорами про зеронет сам по себе.\nСамоцензура она такая, отвечу еще на другие твои сообщения ниже - цензура это плохо, а тут все о самом зеронете говорят тк нет никакой острой темы. Если будет _я первый_ создам тред с обсуждением\n\n> [kostanew](#comment_86_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): @eugenere у меня 2 идеи, над которыми я сейчас работаю:\n> Зайт на котором можно будет грузить музыку любому и слушать ее. Для первого milestone нужен плеер, опциональные файлы, загрузка контента и работа с базой (первые две части уже есть). Потом поднимаем сервак с надписью \\\"Это демка. Контент стирается каждые 6 часов, если хотите сохранить музыку, делайте копию сайта\\\", и ждем пока пользователи сами запилят плееры для своих любимых исполнителей.... \n> Плагины для расширения функционала: мастер плагин (включение/отключение плагинов из ui), плагин для вызова некоторых команд из консоли. И главная идея, плагин который ставит пакеты превращая ZeroNet в PPA с графическим интерфейсом и распределенным кэшем.\nКак ты последнее собираешься реализовывать? точнее чем оно отличается от обычного репозитория который клонирован в папку зеронета? там же http вроде бы\n\n> [kostanew](#comment_92_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): @shift как ты думаешь, есть смысл разделить флудилку на темы? Например техническое обсуждение, философия ZeroNet, прочее? Я уже замучался искать советы, которые мне дали 4 дня назад...\n\nМожнно попытатся разделить обсуждения\n\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/+ZeroNet",
				"added": 1457820359
			},
			{
				"comment_id": 227,
				"body": "Желающие пилить админку для стандартныз zero сайтов https://github.com/HelloZeroNet/ZeroNet/issues/354",
				"added": 1457820537
			},
			{
				"comment_id": 228,
				"body": "> [vlad20012](#comment_158_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Я уж не стал им на гитхабе прямо писать, но по-моему вместо решения фундаментальных вопросов (разделение файлов на блоки, к примеру) разработчики занимаются как-то фигней вроде админок... Запилили бы уже давно админку для ZeroTalk отдельно, не такая уж это и сложная задача\n\nФайлы на блоки как я понимаю хотят делить только большие и это же надо делать торрентами.\nЗерно разума в их действиях есть - что бы коммюнити росло дальше - нужны удобные способы администрирования тк сейчас это адъ и следующий набег двача можно не пережить. Но ядро пилить конечно надо, но вангую что сейчас всё время занимает zerome",
				"added": 1457820769
			},
			{
				"comment_id": 229,
				"body": "> [vlad20012](#comment_159_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Ну, я занимаю на этом форуме уже 74 Кб. Это значит, что каждый раз, когда я исправляю в своем сообщении одну букву (а опечатки я делаю часто), я отправляю все 74 Кб по всем нодам. А если бы файл был разделен на блоки размером 4 килобайта, то отправлялись бы только эти 4 Кб, индекс блоков (аналог .torrent-файла) и content.json. Огромная избыточная нагрузка на сеть сейчас идет в этом ZeroNet\n\nСогласен, но разделение уже пробовали в твистере,жрет в районе 100 гб в месяц... \nНо имхо надо делаить эти файлы не на блоки, пока размер не очень велик, да и тяжелый контент будет идти не в data.json а отдельно от него, что должно хорошо сказыватся.",
				"added": 1457821418
			},
			{
				"comment_id": 230,
				"body": "> [kostanew](#comment_102_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Как это начать делать я не понимаю, мне надо форкнуть документацию и править отдельно. Или предложить реквест с какой то правкой, что бы документация стала прямо там двуязычной?\n\n\nНа русском документация вполне сгодится в твоём блоге, я планирую на него ссылку в шапку запилить, пока у нас нет полноценного FAQ по разработке. А в последствии - сделать общий FAQ со ссылками на разные блоги нашего уютненького\n\nА на инглише - да коммиты кидать ",
				"added": 1457821532
			},
			{
				"comment_id": 231,
				"body": "> [gomzik](#comment_282_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): вы тут много понаписывали, есть что важное?\n\n\nКоротко: Технические вопрсы выделяем из флудилки в соседнюю тему, kostanew и vlad20012  пилят крутые штуки и немного доков, разрабов -попросили- и специально для vlad20012 они каждую фичу отдельным комитом пишут\n\n> [kostanew](#comment_103_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Ты не понял, есть большая разница между моим блогом, где 50% отсебятины и перевода документации по API. Блог я конечно продолжу\n\nПереводить документацию имхо бессмыслено, я говорю об отсутствии документации, у тебя же есть демки как я помню",
				"added": 1457821698
			},
			{
				"comment_id": 232,
				"body": "> [kostanew](#comment_107_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): @shift ты что то не то сделал с топиком разработки, он растворился\n\nХотел сделать из него группу - сабфорум по мануалам из тикета, но что-то пошло не так =(",
				"added": 1457822487
			},
			{
				"comment_id": 233,
				"body": "Воскресло вроде http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/+ZeroNet",
				"added": 1457822555
			},
			{
				"comment_id": 235,
				"body": "> [gomzik](#comment_288_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): До этого момента не видел, может и не давно\n\nВнезапно... неплохо",
				"added": 1457823435
			},
			{
				"comment_id": 245,
				"body": "> [nippletwister](#comment_298_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну вот и ZeroWiki подоспела)\n\nwow, чей проект?",
				"added": 1457961271
			},
			{
				"comment_id": 246,
				"body": "имхо только надо все страницы как optional в будущем делать тк вес будет ооочень большой, сам нашел где обсуждения вики идут http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:5_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf",
				"added": 1457961418
			},
			{
				"comment_id": 248,
				"body": "> [nippletwister](#comment_299_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Предлагаю обновить ссылку наш русский FAQ:http://127.0.0.1:43110/13HMY3PTAF7zABaS7wR1Qr4evfMFqqPspf/?Page:home\n> Теперь можно работать сообща. Так как мне уж очень лень одному). Ну или если кто всерьез хочет менять сам движок wiki под FAQ, то может просто склонировать себе свой FAQ, а потом ссылку будут давать на лучший вариант. Просто я точно ничего внутри логики сайта менять не буду, т.к. не представляю вообще как это делается.\n\nОтделятся на свой сайт для FAQ вопрос спорный, имхо стоит использовать основной  ZeroWiki, мы ушли с zerotalk сюда что бы не захламлять первую страницу нашим языком на общем форуме, там же такой проблемы нет.",
				"added": 1457962678
			},
			{
				"comment_id": 249,
				"body": "> [nippletwister](#comment_300_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А как там добавить внутрь русский фак, чтобы ее не захламлять? Я не догадался.\n\n\nПро захломление это я о ZeroTalk, а новую страницу делать там [просто](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:faqru)",
				"added": 1457963073
			},
			{
				"comment_id": 251,
				"body": "> [nippletwister](#comment_301_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну кстати да, хорошая идея.\nПеренесешь часть? я присоединюсь чуть позже =)\n\nТолько не на каждый вопрос по отдельной странице ...",
				"added": 1457963241
			},
			{
				"comment_id": 252,
				"body": "> [nippletwister](#comment_302_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Если все вместе запихивать, то длинная портянка слишком выйдет.\n\nВ старом FAQ именно так, никто не мешает сделать анкоры внутри которые будут к нужному ответу вести",
				"added": 1457963599
			},
			{
				"comment_id": 253,
				"body": "> [nippletwister](#comment_304_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Тогда готово)Ссылку на FAQ можно заменять. 122 килобайта уже израсходовал.\n\nЗаменил, дадеюсь не забьют на вики",
				"added": 1457967028
			},
			{
				"comment_id": 256,
				"body": "> [vlad20012](#comment_176_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вы не поверите. За расчет тех самых, с*ка, пр*теинов платят EmerCoin'ами(походу я напоролся на местный фильтр запрещенных слов; боюсь предположить, запрещено первое слово или второе)\n\nзабанено второе конечно же) за боинк начали платить криптовалютой?",
				"added": 1457970555
			},
			{
				"comment_id": 257,
				"body": "> [vlad20012](#comment_183_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Дебильная вики. Патчами бы изменения делали. Наверняка есть либа для JS. А так каждый целиком статью копирует при любой правке. Ладно, хотяб изменения чтоб показывались патчами. Нихрена же непонятно, кто что меняет\n\nНу я во фичереквесты написал это",
				"added": 1458023597
			},
			{
				"comment_id": 261,
				"body": "> [manruspi](#comment_6_1DvnFi1sTj5Nc4JnSoTPPedmV3uXMcz2p3): Появилась интересная идея. Где-то @shift писал мол надо встроить кравлер в зеронет. А почему бы не вывести в таком случае строку поиска прямо на страницу ZeroHello? Аля google.\n\nЭто тоже можно было бы сделать, но сначала то нужен локальный бот который будет формировать индекс в последствии публиковать в DHT",
				"added": 1458046651
			},
			{
				"comment_id": 266,
				"body": "> [gomzik](#comment_292_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): оно явно в процессе запиливания\n\nПохоже на реддит",
				"added": 1458506191
			},
			{
				"comment_id": 269,
				"body": ")",
				"added": 1459766629
			},
			{
				"comment_id": 271,
				"body": "А мне поиск не завезли",
				"added": 1461075368
			},
			{
				"comment_id": 272,
				"body": "На большом зеротолке говорят, что сейчас более 50% трафика в сети - китай и сеть прошибает фаервол",
				"added": 1461168457
			},
			{
				"comment_id": 273,
				"body": ">да и вообще всего 40 чуловеков осталось на ru-zerotalke\nНа обычном сейчас 200 судя по hello, видели, китай себе огромный форум запилил",
				"added": 1461170014
			},
			{
				"comment_id": 274,
				"body": "> [zerro](#comment_16_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Так и до десктопных зеронет-приложений докатимся. Electron позволяет, а там и Servo подоспеет. И распространияются пусть как зеросайты. Не всю же жизнь в браузере проводить. \n> \n> http://127.0.0.1:43110/gfwtalk.bit/ это, наверно. Не такой уж большой, но очень китайский.\nУ них все по подразделам сделано, на первый взгляд не кажется большим, но если пошарить по веткам...",
				"added": 1461227948
			},
			{
				"comment_id": 275,
				"body": "> [zerro](#comment_17_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Я по количеству пиров сужу. Хотя может вижу не всех. \n> \n> Внешнем относительно чего. Я так понял, это поиск среди уведомлений только. Во всяком случае, у меня пока только так ищет.\n\nЯ читал их некоторые ветки гугл транслейтом и как я понял там много народа через прокси седят а не через нативные клиенты",
				"added": 1461330045
			},
			{
				"comment_id": 277,
				"body": "хм zero me запустили",
				"added": 1471206855
			},
			{
				"comment_id": 279,
				"body": "потестил его, работает годно, теперь осталось форум переписать на такой стиль ну и разнообразить соц-сеть собственно функциями соц-сети и тогда будет годнота",
				"added": 1471207077
			},
			{
				"comment_id": 289,
				"body": "> [subd](#comment_1_1CuyRj4nWcMCJdMtBEx8V1QangHiZS4Fiw): как я понял этот зеронет работает на торе?\n\nнет, но он может работать через тор",
				"added": 1473952103
			},
			{
				"comment_id": 294,
				"body": "> [voland](#comment_4_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): что-то больше похоже, что убыло...\nВсплески тут был после постов на хабре, следующие всплески в сети будут:\n- После добавления возможности публиковать контент (картинки и не только) в ZeroMe\n- Возможность создания закрытых сообществ",
				"added": 1476118182
			},
			{
				"comment_id": 297,
				"body": "Всех поздравляю, теперь в Zerome можно лить фотографии",
				"added": 1479410447
			},
			{
				"comment_id": 298,
				"body": "> [evolution8](#comment_1_1AZ1e6cwJ56kkATXtKJ9JLYGTR1YGumZ2H): Всем привет! А поисковик тут есть?\n\nПривет, по подключенным сайтам",
				"added": 1480355976
			},
			{
				"comment_id": 300,
				"body": "> [jtprogru](#comment_1_1AaNB6c2GVPzwF4mgjFJUHDZ727Sh7vrad): Народ привет! Я так понимаю старая учета автоматически теряется если ты меняешь систему?\n\nЕсли ты не сохранишь файл с ключами - да",
				"added": 1480404608
			},
			{
				"comment_id": 323,
				"body": "> [vlad20012](#comment_217_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): А тут нигде не ведется разработка нормального форума, с нормальными разделами и нормальной админкой?\n\nОсновной разраб обещал админку, раздделы то и в этом форуме есть, но настраивать их - боль",
				"added": 1482610073
			},
			{
				"comment_id": 325,
				"body": "> [johnbyte1221](#comment_4_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR): Есть ли в ZeroNet утилиты для блокировки трафика от определенных пиров (чтобы, например, спам не сохранялся на моем жестком диске)?\nТак не подписывайтесь на сайты со спамом =)",
				"added": 1482773966
			},
			{
				"comment_id": 331,
				"body": "> [vlad20012](#comment_228_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Про биткоин рбк написал. Значит точно пора продавать\n\nНу РБК не показатель, прошлый взлет был не из-за России но да, я тоже заметил и тоже думаю, вообще надо в отдельный тред вынести",
				"added": 1483452693
			},
			{
				"comment_id": 338,
				"body": "> [vlad20012](#comment_229_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Да это какой-то известный миллиардер говорил, мол, если обыватели начинают интересоваться биржей, торгами и прочим, то надо как можно скорее оттуда выходить, ибо 100% скоро все рухнет.\n\nВозможно, перед падением по ТВ тоже было много инфы про биткоин. \n\nС другой стороны - биткоином изначально пользуются люди которые не финансисты",
				"added": 1483462239
			},
			{
				"comment_id": 346,
				"body": "> [vlad20012](#comment_234_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Таки опять сработало\n\nхех, рискнуть что ли в следующий раз?",
				"added": 1484214860
			},
			{
				"comment_id": 348,
				"body": "> [kagari](#comment_7_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Точно, а то денег завались некуда девать.\nНу некоторые биткоины покупали давно и по хорошему курсу...",
				"added": 1484346232
			},
			{
				"comment_id": 349,
				"body": "> [vlad20012](#comment_238_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Китайцы свой ZeroTalk на 10 мегабайт уже выговорили.\n\nМожет тяжелый контент положили в сайт? не верю что текстом набрали",
				"added": 1484681194
			},
			{
				"comment_id": 351,
				"body": "> [antignu](#comment_7_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Вроде именно текстом. А почему нет, китайцев много. У них ещё есть несколько других форумов,  пара борд и куча бложиков.\n\nВроде бы или вы сходили в папочку и посмотрели ?)\n\nНет ну если 10МБ текстом - круто и я их поздравляю, мы потратили только 3 Мегабайта (три, карл!)",
				"added": 1484682011
			},
			{
				"comment_id": 365,
				"body": "> [pumba](#comment_1_1A46oGiyZMuMGGnUcNTBUD1M5JugBzxCWQ): Всем привет!Подскажите, разрабы ничего не говорили о системе оценок тем пользователями и удаления постов с плохим рейтингом?А то сама идея zeronet нравиться, но нет желания хранить тонны мусора\n\nТак а причем тут ZeroNet - разраб же ядро предоставляет сайты могут делать кто угодно =)",
				"added": 1485795496
			},
			{
				"comment_id": 369,
				"body": "> [anonimos](#comment_3_1LkquoMBVFU2LM3ZRTrnDRNt1Uqzvn9FrT): http://127.0.0.1:43110/14Y56yPs63LcpkYYD3YnPjp9ZpHMcD35sh/index.html заценитескоро доделаю\n\nПиров видит, но не коннектит",
				"added": 1485850795
			},
			{
				"comment_id": 370,
				"body": "И не стоит спамить по всем темам, тот тоже существуют баны",
				"added": 1485850958
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 19,
				"body": "wiki подобный движок - будет полезен для создания как минимум лурка в сети",
				"added": 1455284123
			},
			{
				"comment_id": 34,
				"body": "еще вспомнил - pastebin / ezcrypt",
				"added": 1455454895
			},
			{
				"comment_id": 88,
				"body": "> [esteban](#comment_4_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот такая идея, не совсем про конкретный ресурс, но может быть полезно. Нужно подружить ZeroNet с IPFS. То есть создать сайт, который бы реализовывал интерфейс в ZeroNet, был бы достаточно легким, а весь тяжеловесный контент загружался по ссылкам из IPFS. \n> Так как  IPFS пока сырой и не очень хорош для больших файлов, было бы неплохо реализовать, например, сайт для с музыкой. Аналог soundcloud.com или pleer.com, но больше на манер сдешнего Play. Только с размещением музыки в  IPFS и возможности слушать её в браузере.\n\nЗачем IPFS? имхо мертвая идея и на мобиле никак работать не сможет. Подразделы можно делать, а съехали мы на свой форум с основного для удобной модерации и поднятия лимитов для участников",
				"added": 1457107906
			},
			{
				"comment_id": 89,
				"body": "> [esteban](#comment_6_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Сам же просил без обсуждения тут. Говори куда идти. Я новичок, менее дня в ZeroNet. \n> IPFS на мобиле можно через гейты. А вот в ZeroNet приложения хранятся целиком, поднимать отдельное для каждого файла не очень хорошо, как мне видится. А подразделы: даже если можно сделать, по мне очень интерсно иметь возможность имень внешнюю структуру каталогов на свой вкус, этакие умные закладки. Как http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D, только более продвинутое. \n> И раз уж очередное офтоп сообщение, то скажу, что было бы хорошо здесь поднять gitlab или аналоги. Github очень популярный, но всё же централизованный. Пока это не вызывает проблем, но никто не гарантирует таких проблем в будущем. Уже сейчас им нельзя пользоваться без привязки к email,  то есть практически нельзя размещать проекты анонимно.\n\nДа засрали уже, как будет модерация - почищу.... \n\nУ zeronet есть возможность грузить некоторые файлы опционально даже при подписи на сайт. Гонять что-то где-то через гейты - очень плохая идея",
				"added": 1457109923
			},
			{
				"comment_id": 92,
				"body": "Так я не спорю что штука крутая, но без поддержки мобильных платформ - не взлетит",
				"added": 1457172722
			},
			{
				"comment_id": 210,
				"body": "Ну поисковик типа yacy который будет реализован как системный zero плагин звучит лучше всего имхо...",
				"added": 1457638156
			},
			{
				"comment_id": 211,
				"body": "Накидал свои идеи насчет yacy поисковика http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/Thinking+about+search+engine+in+zero+network \n\nимхо лучшей же вариант",
				"added": 1457638617
			},
			{
				"comment_id": 225,
				"body": "> [kostanew](#comment_75_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Я тут сильно завяз с web частью, но зато понял как нафигачить плагин с новыми командами, прямо на методы WebSocket. Будет еще одна маленькая демка. Предложите идеи. Какую бы информацию хотелось получать напрямую с ядра, или какие команды консоли вызвать из зайтов? Сделаю безопасно.\nторренты? но это чуть сложнее ...",
				"added": 1457819934
			},
			{
				"comment_id": 259,
				"body": "> [netchaser](#comment_11_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): У меня есть некий движок на js + mongodb в котором есть некий функционал... понятно что движок отдает динамически html и статику... существует ли некий способ зеркалить сайт в зеронет без написания нового движка? может тупо складывать html на диск и раздавать? )\nСкиптом генерировать статику и обновлять сайт, если только так..",
				"added": 1458036889
			}
		],
		"1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 22,
				"body": "Неплохой движок, сам делал? по второй ссылке js error",
				"added": 1455285605
			},
			{
				"comment_id": 23,
				"body": "упс, в глаза долблюсь",
				"added": 1455285659
			}
		],
		"2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 24,
				"body": "В итоге - ничем, но концепция разная это как почему раньше все любили когда всё в однмо месте vk/fb а потом захотели отдельно - instagram и прочее",
				"added": 1455286213
			},
			{
				"comment_id": 95,
				"body": "> [thunderstorm](#comment_1_1D9ZfDcycS3rQ37QHYixoUKyG8Sgcu9svb): можно подробнее об лимите узнать пожалуйста?\n\nМожно, поле там где ты пишешь коммент - справа от кнопки отправить доступный тебе обьем в килобайтах",
				"added": 1457172947
			},
			{
				"comment_id": 264,
				"body": "> [balancer](#comment_1_16DwBmikRJ5Tw1SCwfRLCGEcdvArWm5Cyj): У меня почему-то ничего такого нет. — а, оно видно после первой отправки. Очень маленький лимит. Получается, что большие дискуссии в ZeroNet невозможны?\n> А возможности игнора тут нет?\n> И ещё — нет ли возможности «перевернуть» комментарии, чтобы новые шли снизу?\n\nВозможны, обладатель сайта выбирает лимит, игнора пока нет, и сортировки тоже, надо или ждать или самим пилить",
				"added": 1458295604
			}
		],
		"3_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 28,
				"body": "А смысл? ботов можно наплодить и умных, а если как метод борьбы со спамом - не поможет есть же отряды ольгино, или 50 cent army",
				"added": 1455295192
			},
			{
				"comment_id": 29,
				"body": "> [nippletwister](#comment_17_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Это метод для создания голосований по типу один человек - один голос.\n\nНу верифицировать сложно, умные боты могут быть + открытый алгоритм работы будет в этой сети. проще OATH авторизацию требовать с несколькими сервисами по типу гугла",
				"added": 1455295558
			},
			{
				"comment_id": 35,
				"body": "ну я не вижу смысла практического в этом, если для последующего голосования то теоритически можно с ЕСИА заморочится (только там будет де-аннонимизация, хотя в случае конфы она так и так будет)",
				"added": 1455485102
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 31,
				"body": "коммиты свежие, интересненько...",
				"added": 1455411578
			},
			{
				"comment_id": 33,
				"body": "Почитал-посмотрел - вроде неплохо у него, где звать будем? на хабре?",
				"added": 1455413530
			},
			{
				"comment_id": 75,
				"body": "Приватные сайты обещали тут...",
				"added": 1455791659
			}
		],
		"2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 32,
				"body": "> [manrus](#comment_15_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): А нельзя прикрутить аватары  к этому форуму?\n\nТеоритически можно, я еще не вникал так глубоко в местные особенности кодинга",
				"added": 1455412091
			}
		],
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 36,
				"body": "ну либо парсить данные в БД",
				"added": 1455520563
			},
			{
				"comment_id": 43,
				"body": "> [zalex](#comment_12_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): На ZeroTorrent уже есть поиск. Может, оттуда выдрать?\n\nчто за ресурс?",
				"added": 1455534662
			},
			{
				"comment_id": 55,
				"body": "ну они же айаксовые все, не уверен что йаси сможет их",
				"added": 1455633013
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 96,
				"body": "Могут, zeroid  это по сути blockchain в котором пишется hash+nickname каждый сайт может поддерживать разное количевство центров авторизации или сделать свой. на zeroid стоить смотреть как на OATH авторизацию через гугл/твиттер",
				"added": 1457173027
			},
			{
				"comment_id": 99,
				"body": "Ну если коммьюнити будет расти неизбежно надо будет делать свой Zero ID тк база оригинального будет очень большой =)",
				"added": 1457175673
			},
			{
				"comment_id": 100,
				"body": "> [esteban](#comment_9_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Да можно и без всякого ID, по открытым ключам. Ники - не обязательное. Их можно и локально давать.\nНет нельзя, тк как вы верифицируете что сейчас и через минуту именно я пишу а не кто-то взял такой же ник",
				"added": 1457175832
			},
			{
				"comment_id": 101,
				"body": "> [ph](#comment_4_1QH8SFnofdxLUZh5aqy1EgEms1UZAsemVD): а где они хранятся?\nПодписи -  у всех, по аналогии с твистером все получают регистрации всех",
				"added": 1457175988
			},
			{
				"comment_id": 102,
				"body": "> [ph](#comment_5_1QH8SFnofdxLUZh5aqy1EgEms1UZAsemVD): а как войти на другом ПК?\n\nПод своей же учеткой?\n/data/users.json копировать ",
				"added": 1457176033
			},
			{
				"comment_id": 103,
				"body": "> [ph](#comment_6_1QH8SFnofdxLUZh5aqy1EgEms1UZAsemVD): А учетка в каком-то файле хранится> shift: Под своей же учеткой?/data/users.json копировать\n> а полный путь на Linux и на Windows?\n\nНу что значит полный пусть, куда вы склонировали репозиторий так он и есть, я написал пусть относительно папки Zeronet",
				"added": 1457176231
			},
			{
				"comment_id": 104,
				"body": "По хорошему надо делать импорт/экспорт профиля, желающих приглашаю https://github.com/HelloZeroNet/ZeroNet/issues/323",
				"added": 1457176348
			},
			{
				"comment_id": 105,
				"body": "> [dude](#comment_7_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Ну вот, беда как с токсом - пока он сам по себе, с нечитаемыми идишниками - все пучком. Но стоит заюзать красивости от @tox.me или как там его, то прощай кошерная децентрализация.И мне кажется у вас путаница, блокчейн каким боком в зероид?\n\nВ чем беда то? ты подписываешься на центр сертификации и получаешь его blockchain т.е всё хорошо нет никакого центра как в токсе предложили к DNS привязатся",
				"added": 1457176892
			},
			{
				"comment_id": 107,
				"body": "> [esteban](#comment_11_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Если id  делать через Namecoin. То будет лучше. Но я за сырые адреса, с ними всегда меньше проблем. И они дают сразу хороший уровень надежности. Даже с Namecoin адресами, без держания полного узла Namecoin  приходится доверять. C именами кругом проблемы.\n\nРаскрой тему о сырых адресах - я не понимаю тебя. Namecoin имхо плохой вариант, слишком большой обьем вычеслений/данных",
				"added": 1457177900
			},
			{
				"comment_id": 109,
				"body": "> [esteban](#comment_12_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): вот так.\n> Вообще, возможно сделать более эффективный аналог Namecoin. По вычислениям уже есть, но и по объему можно сократить, если сделать имена действующими только в течении ограниченного времени, а блоки маленькими, чтобы естественная величина комиссии была достаточно высокой, чтобы не было желания и возможности засирать. Можно получить достаточно хорошую DNS,  но проблемы всё равно будут.\n\nВ DNS я бы не лез, а для всего остального тут нужен  TTL я разработчику писал насчет этого, но он пилит другую крутую штуку",
				"added": 1457178328
			}
		],
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 112,
				"body": "> [esteban](#comment_24_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Да. Чистые торренты для сайтиков плохо подходят, хотя можно статические раздавать, хоть и неудобно. Да оно же вплоть до количества пиров похоже. Пока, как я понял, главное отличи от торрентов, что автор может обновить, а пользователям не нужно перекачивать торрент файл или обновлять magnet-ссылку.\n\nНу если мы про отличия - то в торрентах не подразумивается что кто-то другой может обновлять торрент (если сравнивать с Bittorrent Sync) а тут у каждого своя подпись. Ну и API для взаимодействия с backend для реализации SQL",
				"added": 1457198355
			},
			{
				"comment_id": 302,
				"body": "> [vladzhome](#comment_1_1H1tk1oe1UZ4DAPCKN6FMhV2yCWVoF4pA7): у меня тоже реальный показывает. Как проверить утечки?\n\nЗакрыть доступ браузеру куда либо кроме 127.0.0.1\nтот сайт - тупо тянет внешний контент\n\n> [beez](#comment_3_12qEax5gsEoqUdwb6ZKmfYugwmBae7TNVN): А вообще можно узнать реальный IP адрес сайта в зеронете? При условии что сайт запущен на зеронете через тор. Вообще не совсем понятно, мало информации. В планах есть некоторые серые проекты, которые хотелось бы реализовать в зеронете, но пока совсем непонятно насколько все это анонимно допустим с теме же сайтами onion\n\nВопрос скорее к безопастности тора, при его использовании по идее сохраняется аналогичная анонимность",
				"added": 1480442789
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 117,
				"body": "> [82456783](#comment_8_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): 30 kb - почему так мало? старые посты удаляются хоть? через сколько?\n\nСтарые посты можешь руками тереть, ограничение от набегов сделано, при достижении лимита и однократного сообщения об этом, если поциент адекватен ему устанавливается повышенный лимит",
				"added": 1457201574
			},
			{
				"comment_id": 119,
				"body": "> [82456783](#comment_10_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): оу, а определять адекватность будет админ сайта, который может быть тем ещё отбитым долбоёбом, и если ему ты не понравился - ты идёшь нахуй\n> найсммм, прямо как на оф сайте написано:\"open, free, and uncensored\"\n\nДа именно так, Но никто не мешает тебе клонировать этот форум и сделать свой http://imgur.com/BEzBB16",
				"added": 1457202012
			},
			{
				"comment_id": 122,
				"body": "> [82456783](#comment_12_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): и будет у каждого по бордесоответственно все мёртвые\n> в итоге все так и будут сидеть на самой популярной, подставляя сраку админу самодуру, чтобы он увеличивал им лимиткак же мне печёт от этого зеронета\n\nВсегда есть кнопка delete у сайта",
				"added": 1457202862
			},
			{
				"comment_id": 158,
				"body": "> [authhh](#comment_9_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): ЖДЕМ КОГДА НУЛЬЧАН МОЖНО БУДЕТ КОПИРОВАТЬ\n\nТак в чем проблема то? копируйте он же есть в сети\n\n> [zeroatom](#comment_50_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Присоединяюсь к просьбе :)\nПоднял\n> [splitfire](#comment_68_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): \"золотой рудник скоро иссякнет!\"нужно больше пространства на комментов :D\nПоднял",
				"added": 1457307205
			},
			{
				"comment_id": 199,
				"body": "> [kostanew](#comment_37_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): used: 28.3k/30k - НУ, ПОЖАЛУЙСТА!\n\nПоднял лимит",
				"added": 1457599229
			},
			{
				"comment_id": 282,
				"body": "> [gugenot](#comment_1_1Mw5KWZ1jcoXpafcLV4fUgnjuY4kvVNduX): Как узнать сколько места осталось?\n\nОколо окна комментариев USED:",
				"added": 1471514084
			},
			{
				"comment_id": 287,
				"body": "> [zerro](#comment_58_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): used: 29.2k/30kused: 29.2k/30k\n\nПроверяй",
				"added": 1472850821
			},
			{
				"comment_id": 375,
				"body": "Добавил всем =)",
				"added": 1498486922
			}
		],
		"1_1AhmLuxijDXzgywnHv2W3u8T251msd8G3n": [
			{
				"comment_id": 128,
				"body": "Надо смотреть сколько тут живет почта, она использует протокол Bitmessage со всеми вытикающими",
				"added": 1457215353
			},
			{
				"comment_id": 215,
				"body": "> [gomzik](#comment_223_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Оно не использует протокол BitMessage, оно работает по этим принципам. Т.е. шифрует и отправляет всем, прочитает только тот, кому отправлялось, вот и все.\n\nTTL то какой в итоге?",
				"added": 1457648785
			},
			{
				"comment_id": 301,
				"body": "> [maskas](#comment_6_18YFv8YkcH27FxQh2o6AZmSHKuSZ9GRgc7): письмо будет помечено ка кнедоставлено и будет пытаться еще раз полсаться, если вы оба одновременно будете в сети оно дойдет\n\nПочта тут работает аналогично bitmessage так, что не совсем верно",
				"added": 1480404723
			}
		],
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 142,
				"body": "> [krlf](#comment_1_18RfVGME7R14BmGRcbVbZ1RaHoaeBEKtZ3): что-то с версткой нехорошееhttps://www.dropbox.com/s/vnojc3k2by2wug9/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82%202016-03-06%2002.24.12.png?dl=0\n\nхм, странно, в safari нормально, ок буду править. \n\nа еще я выяснил что кто-то ?? купил домен rutalk.bit",
				"added": 1457220497
			},
			{
				"comment_id": 152,
				"body": "> [krlf](#comment_2_18RfVGME7R14BmGRcbVbZ1RaHoaeBEKtZ3): с монитором все в порядке, да и окно можно не уменьшать, а, например, увеличить масштаб :)\n\nНеа http://imgur.com/jcBdDUH",
				"added": 1457222197
			},
			{
				"comment_id": 153,
				"body": "> [krlf](#comment_3_18RfVGME7R14BmGRcbVbZ1RaHoaeBEKtZ3): а как насчет главной пейджи?\n\nтам всё плохо да, ок, надо переделать...",
				"added": 1457223098
			},
			{
				"comment_id": 155,
				"body": "> [kostanew](#comment_2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Нужны разделы как минимум.\n\nНапример какие?",
				"added": 1457260014
			},
			{
				"comment_id": 156,
				"body": "> [esteban](#comment_47_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Лучше вместо разделов ты бы поднял отдельный форум.\n\nзачем дробить?",
				"added": 1457260611
			},
			{
				"comment_id": 169,
				"body": "> [kostanew](#comment_3_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): В зеронете функционал как у форумов 20 летней давности. Анонимности тут нету, поэтому единственное зачем мне здесь сидеть - общение. Пока что я тут вижу 100500 спамерских сообщений и утопленные темы без возможности поиска по ним. То есть общаться реально можно только про сам zeronet.\n> Я бы сначала сделал так:\n> \n> ZeroNet\n> Другие распределенные технологии (Bitcoin, Ethernium, Torrent, ...)\n> Программирование\n> Новости\n> Юмор\n> Реклама (сюда спихивать весь спам)\n> \n> Я уже видел тут посты про риск \"отбитых модераторов\". Но ни один сайт без них не обходится. Даже сайты с фильтрацией на основе рейтинга: reddit, pikabu, oboobs;) Нуждаются в некотором модерировании. Здесь, я полагаю, как минимум нужно отпихивание рекламы.\n\nСогласен с тобой, на неделе займусь запиливанием разделов только я бы Рекламу переименовал в архив",
				"added": 1457361085
			}
		],
		"1_1DjxkUHNWyzVrESngih4CZy9D844FvrKwM": [
			{
				"comment_id": 144,
				"body": "еще есть safecoin... с safenetwork",
				"added": 1457220628
			}
		],
		"1_1K41NyBL97i49P3nv4RyUMtvBSjYJ9HB6y": [
			{
				"comment_id": 165,
				"body": "тест протеинов",
				"added": 1457310767
			}
		],
		"1_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 166,
				"body": "Как минимум закрытостью сорцов последнего",
				"added": 1457330892
			}
		],
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 168,
				"body": "Да, потеря папки несет потерю авторизации, авторизация по приватному ключу, который живет в /zeronet/data/users.json скопировав его или всю папку data даст возможность использовать учетку на неограниченном количестве устройств.\n\nРядом в теме обсуждают возможность привязки id к соц сервисам типа гугла",
				"added": 1457360995
			}
		],
		"1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 179,
				"body": ">Можно ли на один юзернейм вешать несколько ключей? Что если, например, юзер авторизируется с дргуго устройства (с другим ключом)? Может ли юзер заменить сертификат (например, при утере ключа)?\n\nЯ считаю да, но сделать опциональным, включенным по умолчанию, но можно и отключить для большей безопастности.\n\n>Должен ли сервер хранить сопоставление юзернейма и гугл аккаунта? Очевидно, если он не будет хранить эти данные, какое-либо дальнейшее управление аккаунтом (напр. добалвение ключей) будет невозможным. Если будет, то как он должен их использовать?\n\nНе понял вопроса, но считаю что хранить должен для дальнейшей верификации.\n\nДалее, если добавить в схему другие соцсети. Это должны быть разные ресурсы для разных соцсетей, или один ресурс, но в зависимости от соцсети в сертификат будет записывать разный auth_type? Если второй вариант, то получается один неймспейс для всех юзернеймов (непонятно, плюс это или минус). Если юзер авторизируется через несколько соцсетей сразу, можно ли комбинировать auth_type (указывать несколько, через сепаратор)? По идее это немного усложнит регэкспы, но должно работать (надо бы с разрабом ZeroNet'а побазарить по поводу \"стандартизации\" такой мультиавторизации).\n\nНу имхо на 1 юзернейм должна быть возможность вешать много соц-сетей, алгоритм примерно такой - \nЕсли пользователь уже авторизован, скажем, через гугл то он может подвязать другие OATH сети для авторизации, ну а если он вышел из аккаунта и подвязывает другую соц-сеть то создавать новый username\n\n>gomzik \nТы против соц-авторизации?",
				"added": 1457434526
			},
			{
				"comment_id": 183,
				"body": "> [vlad20012](#comment_98_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Тут я имел в виду вот что. На сайте в data/users/content.json прописываются правила в т.ч. для способа авторизации (auth_type). Вот пример с этого сайта\n> \"bitid/.*@zeroid.bit\": { \"max_size\": 40000 },\n> \"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 }\n> Хз что такое bitid (таких юзеров нет), но вот при авторизации на zeroid через bitmsg к юзеру доверия меньше - меньше и пространства выделяется. У себя я предполагаю ставить auth_type в соответствие с соцсетью, через которую юзер регистрируется. google, facebook, twitter и т.п. Но вот вопрос, а что если юзер привязывает к аккаунту несколько соцсетей? Теоретически мне ничто не мешает записать в auth_type строку вида \"google;facebook;twitter\", но в связи с этим сильно меняются регэкспы правил. Хотелось бы это дело как-то \"стандартизировать\", обговорить с разрабом ZeroNet то есть.\n\nА приватный ключ получить мы не можем?\nт.е брать у пользователя его приватный ключ шифруя его у него же и зашифрованный вариант передавать на сервер ну или весь приватный ключ. Да это не очень секурно но существуют же биткоин кошельки в вебе которые хронят у себя приватный ключ, и метод авторизации в сети не единственный....",
				"added": 1457447194
			},
			{
				"comment_id": 186,
				"body": "> [vlad20012](#comment_99_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Как твое сообщение связано с тем, что ты процитировал? =DОбычным способом приватный ключ не вытащить. Только если просить пользователя открыть конфиг и скопипастить.\n\nГрустно, тогда может стоит делать просто сайт на котором пользователь авторизуется через свой ID (zeroid) или другой а уже он навешивает на него информация о том, что с этим ID асоциирована вот эта запись, получится не как авторизация а как паспорт в вебмани т.е сугубо для повышения доверия. \n\nТаким образом я это вижу так:\n1) Пользователь получает ID на любом zeroid сайте (основной или другие, когда появятся)\n2) Пользователь авторизуется на твоем сайте со своим ID\n3) Если проверка пройдена успешно - пользователю выдается еще один ID - trust_%old_id_name% иаким образом сайты очень просто смогут отличать какой пользователь к ним пришел проверянный или нет.",
				"added": 1457451055
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 184,
				"body": "> [akademic](#comment_4_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D): Запилил за вечер раздел Кино с Рутрекера:http://127.0.0.1:43110/1MoAyNQAaTbMFmTCTMiRz7uHV9KzeEZL8W\n> Пока только 400 фильмов.Понятно, что в таком виде не юзабельно.Надо разбираться с БД и делать поиск.\nИнфу надо показывать во всплывающем окне забирая пост с рутрекера не переходя на него ну и постеры да",
				"added": 1457450699
			},
			{
				"comment_id": 192,
				"body": "> [gomzik](#comment_264_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Текст можно организовать в файлы, которые можно пометить опционально, подгружать чем-то вроде аяксовых запросов. Не совсем уверен в том, как именно это работает, но не думаю, что это невозможно\n\najax+json?",
				"added": 1457511222
			},
			{
				"comment_id": 196,
				"body": "> [cypher](#comment_9_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Я имел в виду нативную поддержку, а не опциональную. Плагин в данном случае - это просто модуль, загляните в папку plugins, это я и имел в виду. Зря я упомянул слово плагин, потому что как это будет реализовано в коде - это технический вопрос и в общем дело десятое.Да и вообще, то, что мы тут теоретизируем никак не повлияет на то, как это будут делать. Надо уж тогда на англоязычной борде об этом писать.\nНу почему же, тут можно собрать или желающих сделать коммит с этим изменением или же людей которые будут лобировать",
				"added": 1457540389
			},
			{
				"comment_id": 204,
				"body": "> [vlad20012](#comment_122_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): По поводу поддержки торрентов - есть информация, может кто-то уже разрабатывает такое для ZeroNet? А то задача уж как-то слишком очевидная. (Я не про поддержку больших файлов разделением на блоки, а именно поддержку обычного торрент протокола отдельным модулем)\n\nА чем nofish собрался большие файлы качать в сети? не торрентами ли случаем?",
				"added": 1457599793
			}
		],
		"1_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq": [
			{
				"comment_id": 189,
				"body": "Надо думать а если ли в этом смысл, тк большинство платформ сейчас шифруют данные на уровне системы, а двойное шифрование - повышеная нагрузка и тормоза",
				"added": 1457508161
			},
			{
				"comment_id": 195,
				"body": "> [kostanew](#comment_23_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Я не очень представляю как сделать это сейчас здесь и как анонимные сайты сюда будут добавлены. Но как вариант можно прицепить данные к сайту как необязательные для загрузки файлы, а расшифровывать в браузере на стороне клиента в js.\nА смысл ? симитричное шифрование будет же так то есть (был?) ezcrypt то, что ты описал для текста",
				"added": 1457540296
			},
			{
				"comment_id": 203,
				"body": "> [boboro](#comment_1_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq): Ну основной посыл такой: лежит, к примеру,тут книга добавленная в список экстремистских материалов. Так вот она открыто будет лежать на всех компах, кто её читал. А значит любой конфискованный комп сходу подставит владельца. Какая же тут защита от цензуры. И сколько же будет пиров для неё?\nСтолько же сколько и для обычной книги, такую штуку можно еще проще в обчном интернете сделать - заливаем фото с CP и делаем страницу, грузим её в iframe с размером 1x1 что бы не было видно, но в кэше браузера у тебя оно будет хранится. \n\nИ не забываем о том, что еще небыло не одного суда против кэширующих/CDN провайдеров у которых на серваках было что-то не то.",
				"added": 1457599673
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 194,
				"body": "Что подразумивается под соседями?",
				"added": 1457523107
			},
			{
				"comment_id": 213,
				"body": "> [jkepeer](#comment_1_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): те у кого тоже стоит зеронет и они в твоей локалке\nЗеронет сейчас не работает не с ретрекерами не с бродкастом следовательно он не может определять локальных пиров",
				"added": 1457638741
			},
			{
				"comment_id": 258,
				"body": "> [zoar](#comment_6_1MxTzBwz6piYDJHHG2TkUZTGqiy2ZUrwNo): Без DHT, кстати, грустно. Я вот пытался на зайт, созданный на одном компе, зайти с другого, стоящего в метре от. Не судьба.\n\nДело не в DHT а в отсутствии пиров, с DHT их больше не станет.",
				"added": 1458023694
			}
		],
		"4_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 202,
				"body": "Ну зеркало репозитория можно тут попрбовать сделать, только все файлы нужно имхо сделать опциональными",
				"added": 1457599568
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 209,
				"body": "ну торренты же, торренты. имхо в идеале должен быть в виде системного (не браузерного!) плагина работа с торрентами через zero api + сам сайт может дополнительно трафик пускать через webtorrent этакий двойной кэш, так можно рассово верный youtube делать",
				"added": 1457638074
			},
			{
				"comment_id": 216,
				"body": "> [kostanew](#comment_56_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А что для этого надо в vlc сделать? Может ли он по очереди запускать файлы как то?\n\nПо очереди - плейлист - m3u",
				"added": 1457687676
			},
			{
				"comment_id": 218,
				"body": "> [kostanew](#comment_59_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А плейлист можно динамически обновлять, как то? Я просто, серьезно, никогда не задавался этим вопросом.\n\nНе надо городить огород с плейлистами, ты же хочешь что бы в браузере работало, я верно понял?",
				"added": 1457694487
			},
			{
				"comment_id": 220,
				"body": "> [jkepeer](#comment_4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): я хочу залить музыку, а потом скачивать или слушать\nЧто бы слушать нужен обычный web audio api который в html5 есть, что бы скачивать - еще проще - генерировать ссылку",
				"added": 1457706869
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 212,
				"body": "Если приложение не будет постоянно рефрешить контент в фоне то жрать ресурсы не должно\n\n> [jkepeer](#comment_3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): есть такая идея, сделать микро клиент к android,iOS который будет подгружать(прокси) контент с компа на котором установлен зеронет, есть смысл заворачиваться или уже есть?\nСмысла делать оболочку для прокси имхо нет, если есть желание можешь покопать в сторону упаковки питона для мобилок",
				"added": 1457638691
			},
			{
				"comment_id": 223,
				"body": "user friendly тип установки приложения =)",
				"added": 1457819680
			},
			{
				"comment_id": 238,
				"body": "> [kostanew](#comment_115_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Совсем не безопасно. Если прокси хакнут, будут пароли прямо из памяти python лить. А учитывая что владельцы прокси даже не озаботились отключением плагинов, они вообще не понимают как ZeroNet работает, неговоря уже о безопасности.\n> Лучше иметь два аккаунта.\n\nНасколько я помню ключ хранится в localstorage и не покидает клиента",
				"added": 1457888857
			}
		],
		"2_1Kn7vDfQWK1M5Amu5sFK2EHEBr69Vvm1Ai": [
			{
				"comment_id": 221,
				"body": "можно, но проще папку перенести",
				"added": 1457706896
			}
		],
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 224,
				"body": "> [kostanew](#comment_91_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А как людей привлекать?\n> @shift, что ты думаешь?\n\nНет клилер фичи для обычных людей, как только будет ZeroMe ака твистер в зеронете  - есть смысл пиарить в рамках \"ваши мемасики никто не потрёт\"",
				"added": 1457819825
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 234,
				"body": "> [vlad20012](#comment_168_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): После создания этой темы я впервые заюзал ZeroFeed и обратил внимание, что со шрифтами там те же проблемы. Может им в ядро русские шрифты закоммитить?\nБыло бы не плохо...",
				"added": 1457823355
			},
			{
				"comment_id": 236,
				"body": "> [vlad20012](#comment_169_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): А, черт, это же ZeroHello, а не ядро... Ну хз, туда, уверен, они мене охотно будут принимать лишних 30 Кб\n\nНу единый шрифт выбрать который поддерживает все языки да и всё...",
				"added": 1457823782
			},
			{
				"comment_id": 237,
				"body": "vlad20012, На тему передачи только изменений, вот тут nofish сказал что таки ждите патча совсем скоро http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq/Bitnation+on+ZeroNet",
				"added": 1457825599
			},
			{
				"comment_id": 239,
				"body": "> [kostanew](#comment_117_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): https://github.com/kostaNew/zeronet-easymetrics - уже точно определился, чем я буду заниматься в ближайшее время в рамках ZeroNet. Это плагин, который пишет статистику по ноде каждую минуту. В общем, Stats с логированием. Он может быть полезен для оценки популярности сообществ и оценки суточных колебаний посещаемости. Пока что пишет только количество пиров по сайтам. Нарисую какой-нибудь график уже завтра утром;) Думаю попозже добавлю все остальное. \n> Жду ваших предложений, какая бы информация была вам интересна в первую очередь? Если не знаете что можно получить, посмотрите http://127.0.0.1:43110/Stats .\n> Если кто то заинтересован в аудиодемке, возмитесь за нее, потому что я к ней вернусь не раньше чем через месяц-другой.\n\nНеплохая идея, данные в БД держать будешь? вижу это как аналог гугл аналитики",
				"added": 1457898688
			},
			{
				"comment_id": 240,
				"body": "> [kostanew](#comment_120_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Нашел вот это issue: https://github.com/HelloZeroNet/ZeroNet/issues/356\n> Если кто хочет, могу рассказать как сделать это в виде плагина и даже с API. Примерно 3-10 часов займет в простейшем варианте, с новым бэкапом каждый раз.\n\nА смысл бэкапа если вдруг обладатель потеряет код сайта его можно же с пиров стянуть",
				"added": 1457940413
			},
			{
				"comment_id": 243,
				"body": "> [kostanew](#comment_123_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Версионность.\nНу для контента за исключением БД хорошо подойдет git",
				"added": 1457946507
			},
			{
				"comment_id": 254,
				"body": "> [kostanew](#comment_134_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Взял сервер на DigitalOcean, как вы мне и рекомендовали. Я правильно понял что платить в конце месяца?\n\nПо факту использования ресурсов, если бы ты использовал реферальные ссылки еще бы и бонусов прилетело",
				"added": 1457967625
			},
			{
				"comment_id": 268,
				"body": "> [evilpartisan](#comment_2_13ZbjhN837WMwU2EY7qneFS58qvEViSQ7N): А как иначе?Плагин не катит, я же не заставлю чего ставить всех пользователей сайта.Я сделаю это лучше всех.\nПарсишь все раздачи создавая БД, конвертируешь БД в формат БД ZeroNet пишешь обработчик для взаимодействия с БД, ???, Profit!",
				"added": 1459437289
			},
			{
				"comment_id": 270,
				"body": "> [vlad20012](#comment_191_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Усе, обновления файлов теперь патчами высылаются https://github.com/HelloZeroNet/ZeroNet/issues/395\n\nнеплохо",
				"added": 1460964972
			},
			{
				"comment_id": 292,
				"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Хочу делать двухсторонний гейт Web <-> ZeroTalk. С забором данных из ZeroTalk никаких вопросов — тянем тупо посты/комменты из SQLite и счастливы. А вот как кошерно постить данные в ZeroTalk? Я, смотрю, данные дублируются и в JSON, и в SQLite. Значит ли это, что данные расходятся по сети в JSON, а SQLite — это их кеш для ускорения локальной работы? Получается, что мне придётся полученную информацию сохранять как в JSON, так и в SQLite? Есть ли какое-то более изящное решение?\n\nТебе стоит работать только с json файлами тк как ты и заметил - SQL - кэширование которое происходит непосредственно у каждого участника сети",
				"added": 1476118035
			},
			{
				"comment_id": 293,
				"body": "> [brom](#comment_2_1NHR4Gdv1dVLZS5HRwY6aJWfngk9jCLF87): Завел не большой бложик: http://127.0.0.1:43110/19bhDQnHTh9Qww3XePT9EHn2AujGB6boFg/Планирую развивать ZeroNet. В данный момент занят портированием приложения на третий python\n\n\nкакого приложения?",
				"added": 1476118107
			},
			{
				"comment_id": 296,
				"body": "> [vlad20012](#comment_199_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Нет\nА если по прямой ссылке открывать?",
				"added": 1478244577
			},
			{
				"comment_id": 304,
				"body": "> [urbis](#comment_1_19Rscvnj7TJnxt98qUdNnH4UGXSNxgnR6K): А как публиковать сами сайты в зеронете?\nОткрываете порт и кидайте ссылку людям, все кто зайдут на него - будут его раздавать\n\n> [cottayson](#comment_1_12WG2wGf3i1pGq6aRSmw4oaC5jkLKPiMyz): Кто пытался создать статический сайт? Пишет в меню справа, что отсутствует один файл content.json, всё сделал как тут http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1 в чём может быть проблема?\nЕли действительно как тут - советую завести issue на гитхабе\n+ в шапке форума есть ссылки на два русских блога про разработку",
				"added": 1480443157
			},
			{
				"comment_id": 320,
				"body": "> [vladzh](#comment_6_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq): Вроде какие-то подвижки с доменом есть: видно ли? http://127.0.0.1:43110/vladz.bit/\n\nДа",
				"added": 1482130310
			},
			{
				"comment_id": 330,
				"body": "Да вот по лучше мануал\n[мануал](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:99:ZeroChat)",
				"added": 1483452396
			},
			{
				"comment_id": 342,
				"body": "> [bios](#comment_6_1LuvJrLS3uKp7ZHUL4aNnckmKpuJ7CtiaU): tor работает но если хоть пол россии начнет торенты через него гонять он будет как i2p\nТак требования то какие?",
				"added": 1483792127
			},
			{
				"comment_id": 363,
				"body": "При публикации контента присходит подсчет хэш суммы контента (статьи, комментария) и она так же отправляется в сеть. по умолчанию отображение идет только тех материалов которые помечены как проверенные модератором. А проверка модератором - добавление чексуммы в белый список. \n\nИзменение контента - изменение хэша, всё просто =)",
				"added": 1485469841
			},
			{
				"comment_id": 366,
				"body": "> [antignu](#comment_21_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Это то да, но модератор модерирует в течении некоторого времени, потом он  может например изменить свое поведение, например. В итоге что? Перекладывать все на владельца сайта? А во вторых, когда контент изменен автором, откуда брать исходный, подтвержденный вариант? Опять же, его нужно бекапить. Все это как-то не есть хорошо.\n\nНе копал в ту сторону, а даже интересно - можно ли запретить изменение уже записанных данных и оставить только добавление?",
				"added": 1485795632
			}
		],
		"7_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 241,
				"body": "По пирам (количество)\nПо регионам (на карте)\nЕсли будет API то от куда пришли\nСколько время провели\nСамые популярные ссылки",
				"added": 1457940606
			},
			{
				"comment_id": 242,
				"body": "> [kostanew](#comment_122_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Вот, первые данные которые я смог получить: https://ipfs.pics/QmVgc83N1w4Pi8ewzYDDxBEMDakRh81MUFh4GBsAMpqZiL\n> Это количество пиров у ZeroTalk и его трех национальных клонов.На графике видны обрывы количества пиров. Писалось раз в минуту. Почему такое может быть? Или это стандартный результат для torrent?\nА какое тут время анонса на трекер? похоже что по таймауту отваливаются пиры иногда",
				"added": 1457940725
			},
			{
				"comment_id": 244,
				"body": "Еще бери статистику zerohello для общего подсчета пиров в сети",
				"added": 1457946648
			},
			{
				"comment_id": 247,
				"body": "> [kostanew](#comment_130_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Переписал запись Stats->Sites на DataFrame, пока что пишу в csv. 5МБ в сутки должно получаться.\n> Не могу понять что лучше считать ключем в Connections: id, ip:port или peerid. Есть у кого идеи?\n\nможет стоит сразу агрегированные данные писать?",
				"added": 1457961784
			},
			{
				"comment_id": 250,
				"body": "> [kostanew](#comment_131_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Нет, нужно писать сырые всегда. Обработка это отдельный этап.Пока для \"домохозяйки\" все равно будет слишком сложно. Для тех кто будет пользоваться, я дам скрипты, выдающую основную статистику по скормленной папке.\n\nгм, а агрегировать ты их в какой момент планируешь?",
				"added": 1457963219
			},
			{
				"comment_id": 255,
				"body": "> [kostanew](#comment_132_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): То что есть на /Stats уже агрегировано. То что лежит в сайтах я пока не хочу по времени писать, очень много будет.\n> Связи между данными буду искать на этапе обработки.\nТак я и думал что ты хочешь /Stats сохранять и рисовать красивые highcharts графики + данные о переходах и страницах",
				"added": 1457967698
			},
			{
				"comment_id": 265,
				"body": "Я на следующей неделе попробую",
				"added": 1458295685
			}
		],
		"1_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": [
			{
				"comment_id": 260,
				"body": "А где можно вообще по эфир почитать и почему такой хайп пошел в сети?",
				"added": 1458036949
			}
		],
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 262,
				"body": "> [pt](#comment_3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N): А тут можно \"пропагандировать\" способы обхода блокировок =)))  Это же не совсем интернет, попробуй тут кого найди)\n\nПусть заблокируют 127.0.0.1 :D",
				"added": 1458150357
			}
		],
		"1_19PZnNkdsW4dBZdjaJYHAZk3151dkfmB6y": [
			{
				"comment_id": 263,
				"body": "Она появляется при наведении в chrome  точно, в safari - нет",
				"added": 1458150397
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 267,
				"body": "А вот если бы был более интригующий заголовок и некое содержание поста, тут могла бы быть дискуссия о будущем некоторой страны",
				"added": 1458568952
			}
		],
		"1_16tWPYFLbad3R8iGcMuetyiwC2q5qXp45T": [
			{
				"comment_id": 276,
				"body": "Hi)",
				"added": 1463136275
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 278,
				"body": "+",
				"added": 1471206925
			},
			{
				"comment_id": 290,
				"body": "> [zveronline](#comment_2_12exjQi1YFrE2E9vz4NBC1QbXEGUBbSFbY): вывалить бы сюда opds каталог\n\nА в чем проблема?",
				"added": 1474910927
			},
			{
				"comment_id": 299,
				"body": "=)",
				"added": 1480356004
			},
			{
				"comment_id": 303,
				"body": "> [silvermadex](#comment_2_1BVc1i4Be8EHyQrYcxMxQiTvFzKCzstuKN): Не плохой NSFW раздел , советую\n\nКакой именно?",
				"added": 1480443045
			},
			{
				"comment_id": 379,
				"body": "> [gomzik](#comment_79_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Начал замечать, что люди пишут тут время от времени что-то вроде \"привет\" и на этом все общение заканчивается, видимо есть мысли, что никто не читает. На самом деле это не так, я регулярно тут нахожусь, подписан на все топики RU-ZeroTalk, каждый день заглядываю в ZeroMe. В общем - смело создавайте топики, заходите на блог, подписывайтесь в ZeroMe, я рад буду помочь и быть участником комьюнити.\n\nДа приложения имхо для мобильных не хватает... это бы подняло интерес",
				"added": 1501269942
			}
		],
		"9_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 280,
				"body": "Релизнулся ZeroMe, предлагаю потестировать и обсудить, давайте добавлять друг друга, у меня там ID'шник такой же",
				"added": 1471207272
			},
			{
				"comment_id": 281,
				"body": "хотеть функции ретвита и атача разного контента... ну и технических спецификаций как это работает (если кто найдет - кидайте)",
				"added": 1471213162
			}
		],
		"1_1EeMB9Y46ra4a3ZDRMqvPVZ3WmP2Dgferj": [
			{
				"comment_id": 283,
				"body": "Как я понял топикстарттер предлагает сделать wayback machine",
				"added": 1471946776
			},
			{
				"comment_id": 285,
				"body": "> [gomzik](#comment_35_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): так и нужно ее делать на уровне зеронета, а не зайтом. Зайт вероятнее всего будет носить централизованный характер:Будет запущенно какое-то ПО, которое будет сохранять копии сайтов на текущий момент времени и публиковать их в качестве зайта(-ов).\n> Думаю, что использование опционального плагина гораздо более хороший выбор для этих целей.\n\nплагином? обьем данных будет большой",
				"added": 1472039383
			},
			{
				"comment_id": 286,
				"body": "> [gomzik](#comment_36_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): опциональным. Возможно создание  снапшотов сделать по запросу, возможно более гибкие варианты шедула, может даже размазать это все дело по сети. Места в любом случае где-то убудет.\n\nну хз, я бы не смешивал системы",
				"added": 1472069352
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 284,
				"body": "> [gomzik](#comment_33_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Смотрите, нас тут много, причем много тех, о ком мы раньше не знали\n\nЭто шпионы, очевидно же =)",
				"added": 1471946793
			},
			{
				"comment_id": 288,
				"body": "> [dude](#comment_17_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Все заходят, потыкают... \"ну да, прикольно, работаид\"... и возвращаются в свой вконтактик.Так и живем. пока\n\nЗарубежные интернеты будут заинтересованы в этой штуке если будет что-то типа реддита но без цензуры. да и наши вообщем то тоже",
				"added": 1473067901
			},
			{
				"comment_id": 305,
				"body": "> [oo7o6y](#comment_2_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr): интересно, написал здесь, видел что опубликовано а теперь исчезло, и здесь цензура?\n\nна этом форуме есть только одно стоп слово - полгода назад было нашествие спамеров, открыв исходный код вы можете его найти =) код же тут может посмотреть каждый",
				"added": 1480451551
			},
			{
				"comment_id": 306,
				"body": "> [ebanator](#comment_2_1B4mGfgJm7xyFCRyaUbLSUwBKxKZRiyb6Q): удивительно, что при подобной простоте запуска я до сих пор не вижу тут комментариев \"аааа, я опечаталась когда [anyfuckingshit], как удалить пост?!\"\n\nтак тут есть и удаление и редактирование",
				"added": 1480491789
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 291,
				"body": "@linxon Единственный код который может исполнить ZeroNet - JavaScript и тот - в браузере, так, что не стоит переживать что ZeroNet что-то вам установит. Если вы зайдете на сфеерический сайт с вирусом.exe - да он его скачает, но запускать естественно не станет",
				"added": 1476117965
			}
		],
		"1_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": [
			{
				"comment_id": 295,
				"body": "На моём не срабатывает -  он же с iOS9/10 проверяет голос владельца",
				"added": 1476118298
			}
		],
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 307,
				"body": "Можно поднять свой zeroid, можно отредактировать настройки сайта - в папке с сайтом, что бы принимать не авторизированных",
				"added": 1480502352
			},
			{
				"comment_id": 308,
				"body": "> [plalghef](#comment_1_1HC69hhiCSP6854LsZGouLAcZW9hKsZCKc): а как войти под другой учеткой? я на двух компах в zeroid сделал две учетки, ибо не понял как делать multiseat...\n\nперенести ключи между пк",
				"added": 1480516164
			},
			{
				"comment_id": 309,
				"body": "> [balancer73](#comment_16_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Как о нём узнают сторонние ресурсы?\n\nЧто бы сайт начал поддерживать другого провайдера авторизации надо его вписать в настройках сайта",
				"added": 1480574047
			},
			{
				"comment_id": 312,
				"body": "> [balancer73](#comment_18_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот поэтому оно и не приживётся.\nПочему же? OATH авторизация в интернете же работает и делают поддержку разных сервисов, тут аналогично",
				"added": 1480665722
			},
			{
				"comment_id": 313,
				"body": "Тем не менее это решение подходит для большинства тут, если вам нужен сайт без единой авторизации - сеть позволяет его создать, хотите стать провайдером авторизации - тоже пожалуйста",
				"added": 1480940718
			},
			{
				"comment_id": 327,
				"body": "> [vlad20012](#comment_222_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): DHT тоже нужны bootstrap-сервера\nЭто уже меньшая проблема чем централизация на трекерах. \n\nZeroNet - не анонимная сеть, а приватная, добавля в цепочку ТОР мы делаем ZeroNet анонимной сетью, но что на мой взгляд правильно - не смешивать слой анонимности и доставки контента как это сделано в I2P",
				"added": 1482952680
			}
		],
		"1_12WG2wGf3i1pGq6aRSmw4oaC5jkLKPiMyz": [
			{
				"comment_id": 310,
				"body": "> [self](#comment_6_1NgG5rUCetqpLmc89mScWGM7DTc2omfnzU): Нажал в ZeroMail кнопку Create mailbox, и заработала отправка )\n\nПоздравляю =) вы создали себе ящик, логично что без этого у вас ничего не работало",
				"added": 1480574137
			},
			{
				"comment_id": 315,
				"body": "> [darthmaster](#comment_2_17b4f79L9HqYH69M44szs437PfN9bS4ToL): Ну-с, проверимся.\n\nУ тебя ящика нет",
				"added": 1481024069
			}
		],
		"1_1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3": [
			{
				"comment_id": 311,
				"body": "> [gomzik](#comment_44_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Отвечу чтоли я, как беларус. Бомбит меня уже давно от всего этого беспредела, что устраивает наша власть. Бомбит меня и от попозиции. Всех повыгонять нахрен надо бы, но как?\n\nИнтересно а какая реальная поддержка власти у народа? реально всех всё устраивает?",
				"added": 1480665502
			},
			{
				"comment_id": 316,
				"body": "Говорят у вас TOR лочить стали, правда?",
				"added": 1481024100
			}
		],
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": [
			{
				"comment_id": 314,
				"body": "хорошая идея, потом всё это обернуть в nginx и выставить в мир -  получится с одной стороны традиционный сайт доступный по стандрным протоколам с урезанной функциональностью и его полноценный аналог.\n\nникто тз/todo написать не хочет?",
				"added": 1481023956
			},
			{
				"comment_id": 317,
				"body": "> [balancer73](#comment_29_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В любом случае намного лучше, чем в ZeroNet :)\n\nА зачем сравнивать P2P и F2F сети ?)",
				"added": 1481048496
			}
		],
		"1_129XgHbFnQQGgBbzVQaKQuusn5s6JsogYe": [
			{
				"comment_id": 318,
				"body": "... но если публиковать сайт через TOR то все вопросы анонимности к сети переходят в вопросы к ТОР'у",
				"added": 1481705593
			}
		],
		"4_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 319,
				"body": "У китайцев свой форум как и у нас, причем процентов 40 сети - китайцы",
				"added": 1481705658
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 321,
				"body": "Имхо стоит выбрать хоть кого-то кроме текущего, тк любая смена - это хорошо, а если и победит нынешний, но если навальный наберет значительный % голосов это позволит выторговать по больше профитов для народа у власти показав что не всё так хорошо с 146%",
				"added": 1482130427
			},
			{
				"comment_id": 322,
				"body": "Моё имхо - есть предел % проголосовавших который невозможно фальсифицировать, 50% или 60%\nХотя если навальный наберет хотя бы 20-30 это будет уже мега круто и его сторонники увидят что они более чем не одни",
				"added": 1482427524
			},
			{
				"comment_id": 324,
				"body": "> [tolstoevsky](#comment_16_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Да, есть несколько. На той неделе постараюсь облечь в читаемую форму.\n\nБыло бы интересно почитать",
				"added": 1482610277
			},
			{
				"comment_id": 326,
				"body": "> [johnbyte1221](#comment_2_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR): Сам я не пойду на выборы, ибо пока большая часть людей не избавится от человеконенавистнических, пуританских идей, в нашей стране ничего по-большому счету к лучшему не изменится как показывает история. А что касается большевистской революции, распада СССР, то радикальные иудеи просто применили сатанинский (от имени Сатан, который у иудеев считается нормальным ангелом смерти который сначала провоцирует, соблазняет жертву, а потом ее же обвиняет на суде за то, к чему он ее подстрекал) метод зомбирования (также такой метод зомбирования называется созданием шизофренических ситуаций) который заключается в следующем: сначала рекламируют обычные, общечеловеческие ценности, а потом их же запрещают. Пока народ не поймет, что СССР развалили не \"проклятые пиндосы со своей дерьмократией\", а те же самые КПСС-ные жиды (которые и закрепощали народ) чтобы внушить населению что свобода и материальные блага - это \"плохо\", то жизнь страны не станет ни на капельку райской...\n\nГде покупаете и осталось ли там еще?",
				"added": 1482774484
			},
			{
				"comment_id": 329,
				"body": "> [johnbyte1221](#comment_7_13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR): Что покупаю?\n\nОт куда я знаю что конкретно, но поток сознаний какой-то /странный/",
				"added": 1482952979
			},
			{
				"comment_id": 336,
				"body": "> [tolstoevsky](#comment_19_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Так \"законными\" методами сместить текущую власть и не получится. Особенно при абсолютной резиновости законов. Это же очевидно. Я заявил, что не могу понять, как из \"незаконности\" эффективных методов люди делают вывод о необходимости тратить ресурсы на действия, заведомо и гарантирванно обречённые на провал. У меня спросили варианты действий, которые сработают. Один привёл.Программа, подстраивающаяся под имещиеся и постоянно меняющиеся законы, не взлетит, при условии, что вы хотите быстрого (то бишь в перспективе меньшей, чему пара поколений) результата.\n\nЯ вижу куда более реалистисный вариант смены - волнения внутри элит, посадки некоторых людей сверху - признак профилактики этих волнений, что на мой взгляд говорит о том, что есть такой вектор",
				"added": 1483453741
			},
			{
				"comment_id": 339,
				"body": "> [tolstoevsky](#comment_20_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): То бишь, выехать на разборках в среде текущей элиты. Это будет просто замена одной группы свиней у кормушки на другую  — строй не изменится, разве что чисто косметически. Можно, конечно, и поучаствовать в надежде, что новые будут больше делиться, но мне думается, что такой вариант не стоит прилагаемых усилий.\n\nгм, нет, если разлад в элитах будет достаточно сильный всё карабль может раскачатся и хорошие могут в нужный момент запрыгнуть на борт",
				"added": 1483462302
			}
		],
		"2_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 328,
				"body": "Обсуждали на гитхабе - основной вопрос - где выводить, если в браузере то это Notification API не везде может работать и разработчику (основному) что то не понравилось, а цеплять это на ядро еще больший идиотизм. На этом обсуждения как реализовать собственно и закончились",
				"added": 1482952847
			},
			{
				"comment_id": 334,
				"body": "Тысячи их https://github.com/HelloZeroNet/ZeroNet/issues?utf8=✓&q=notifications",
				"added": 1483453152
			}
		],
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 332,
				"body": "Собственно график цены, получается, что биткоин отиграл все падения которые были после прошлого резкого роста, кто что думает делать ? продавать/покупать?\n\nhttp://i.imgur.com/2eXoaPA.png",
				"added": 1483452940
			},
			{
				"comment_id": 337,
				"body": "1200 это уже совсем на пике =) хотя мне кажется, что и 1200 мы увидим, говорят в Венесуэле начали преобщатся к прекрасному",
				"added": 1483456273
			},
			{
				"comment_id": 341,
				"body": "> [vlad20012](#comment_231_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вообще, однажды должен случится кризис типа 2008, и тогда биткоин подлетит раз в 10, сколько бы он на тот момент ни стоил. Так что закупать можно хоть сейчас, в лонг все равно не прогадаешь.Но я не буду :3\n\nНу кстати зря, на лонг ране биткоин выглядит очень привлекательно, на мой взгляд он в итоге заменит SWIFT а замена VISA/Mastercard - это к форкам",
				"added": 1483648236
			},
			{
				"comment_id": 344,
				"body": "> [balancer73](#comment_37_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот и снова $850 :)\n> Волатильность радует, от $824 до $990 за сутки.\n\nЕсли будет 650-700 я наверно пойду закупатся",
				"added": 1483792248
			}
		],
		"1_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq": [
			{
				"comment_id": 333,
				"body": "Раньше пробовал BTSYNC, работает хорошо, что сурцы закрыты и за некоторые функции хотят денег, пожалуй нет.",
				"added": 1483453105
			}
		],
		"2_18x9rTnPPV3UdMf5KR1gPy7feMbWQbFgJq": [
			{
				"comment_id": 335,
				"body": "В торрентах кстати это влияет намного хуже чем тут. \nСобственно данный сайт - агрегатор информации с трекеров и DHT - ничего нового, в Германии таким же образом штрафы за нелегальные скачивания приходят.\n\nВ случае с ZeroNet всё интереснее, точно так же можно узнать, что сфеерический вася заходил или читает сайт X но нельзя узнать что он туда пишет или какую коннкретно информацию читает - SSL защитит. \nА факт раздачи/чтения сайта на мой взгляд не показывает ничего интересного, да и много раз говорилось - Zeronet  сеть приватная а не анонимная, хотим анонимности - ставим еще и Tor",
				"added": 1483453372
			}
		],
		"1_19nB39bXLXo8trU1gs1XZPzPq58NGiNLKX": [
			{
				"comment_id": 340,
				"body": "бесплатный сыр бывает только в мышеловке, да и зачем сервера в РФ искать?",
				"added": 1483648153
			},
			{
				"comment_id": 343,
				"body": "> [bios](#comment_5_1LuvJrLS3uKp7ZHUL4aNnckmKpuJ7CtiaU): ну почему же я нр могу предоставить впн. вопрос нужен ли он кому ведь он в россии\n\nТакой вариант - да, я о бесплатных сервисах",
				"added": 1483792175
			},
			{
				"comment_id": 352,
				"body": "> [kagari](#comment_12_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Лучше посоветуйте платные и не в рф для постоянного пользования.\n\nсвой сервер сделайте на любом хостинге в либеральной стране и не качайте через него торренты - всё будет хорошо",
				"added": 1484682072
			}
		],
		"1_1KqSnsduv8iRCWBaLGF8Cz3XszuwHvEr74": [
			{
				"comment_id": 345,
				"body": "это обычная проверка трафика касперского",
				"added": 1484134500
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 347,
				"body": "вангую что тупо ничего не будет",
				"added": 1484346184
			},
			{
				"comment_id": 350,
				"body": "> [vlad20012](#comment_237_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): По поводу связи, мне кажется, зеронет вам не особо подходит. Как-то это больше исследовательский гиковый проект, все тут недопиленное. Например, на мобилках как-то с трудом работает (и работает ли вообще?). А пробовали какие-нибудь скрытые форумы в Tor? Mesh-чаты (fireChat?)? Ммм, что-то одна хрень в голову приходит, где все остальные децентрализованные сети-то... @shift, тут что, правда зеронет в прод пошел? В народ, так сказать. Любопытно...\n\nКруто же =) а я верил, что ZeroNet самая UserFriendly система.\n\n> [get33](#comment_8_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM): Кстати еще момент: мадам, которая зеронет рекомендовала утверждала именно о доступности. Хочешь блог? Клонируешь движок и пиши. Как и форум. Ну и сайт с файлами под скачивание достаточно просто сделать. Основная проблема тора в том, что это просто программный маршрутизатор, придется сервер поднимать и искать движок сайта, который ничего никуда не льет. Ну и если я еще гипотетически смогу это развернуть, больше половины участников не смогут. А основная фишка, по заверениям той тян - легко клонировать. Забрали тебя? К тебе зашла подруга, забрала у родных флешку, вставила, включила - весь контент опять существует\n\nЕсли сайт был создан в ZeroNet - он находится у всех его подписчиков и тут нет сервера вообще, если вы внутри своего сообщества сделаете свой сайт (клонировав блог или форум) и у него будут N пользователей - что бы его закрыть нужно физически удалить его у N пользователей. \n\nПо поводу коммуникаций - если вам нужно супербезопасно - Bitmessage чуть менее безопасно но всё еще охуительно - Tox (есть клиенты на мобилу) готовы использовать централизованные решения - сикрет чаты телеграма и Signal, whats up тоже вполне. \n\nПо поводу защиты информации в ZeroNet - запомните главное - при публикации трафик шифруется, но если вы сделали, скажем, свой сайт и на него подписаны только его фанаты - если условный оперативник подключается к нему и начинает его загружать - он получит все IP участников, а при удачном стечении обстоятельств еще и при постинге - связан имя=ник, я конечно не верю, что там люди умеют пользоватся wireshark и понимают как тут всё устроено, но я предупредил. \nКак возможное решение проблемы выше - сидеть на любом сайте где много подписчиков для размытия IP адресов \n\nА вы навального поддерживаете или вообще как относитесь? ну т,е если 05/11 провалится то в 2018 будите активистами за него? \n(хочу понять логику фанатов мальцева)",
				"added": 1484681915
			}
		],
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 353,
				"body": "> [vlad20012](#comment_241_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Если не считать явную недопиленность, то господиэтопревосходно, оно ж прям работает, прям как надо, аааа\n\nЯ нашел git данного проекта и оно вроде бы родилось месяц назад\n\n> [balancer73](#comment_39_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Фоточки, видимо, потому что.\n\nЗначит криво фоточки реализовали, они должны были быть в option files",
				"added": 1484739285
			},
			{
				"comment_id": 355,
				"body": "сабж https://github.com/zer0net/zerovoat",
				"added": 1484751949
			},
			{
				"comment_id": 359,
				"body": "все кто там учетки сделали  в коммит попали https://github.com/zer0net/zerovoat/commit/c37936a12231c68bc79f0300ab9246a344f187d6",
				"added": 1484831195
			},
			{
				"comment_id": 372,
				"body": "Да и название поменялось",
				"added": 1485993448
			}
		],
		"1_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 354,
				"body": "А если в другом клиенте попровобавать повторить?",
				"added": 1484740365
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 356,
				"body": "> [kagari](#comment_15_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Это необходимо для рационального использования дискового пространства. Каждый хранит только то что ему нравится и имеет прямой доступ к файлам, а не ищет в папках пользователей в папках различных сайтов(иначе когда сеть вырастет это будет помойкой невероятных масштабов от хранения которой пользователям не будет никакого толку, для этого есть frenet хранишь кучу гигов не пойми чего...). Без этого находя музыку или картинку в сети приходится ее дублировать загружая в отдельную папку, при этом дубль ее где то среди папок юзеров зеронета, это бред имхо.\n\nЭтим решили проблеу невохможности раздачи большого количества файлов которая есть в любой торрент сети, т.е идея для каждого файла делать отдельную раздачу - она крутая на бумаге, но к сожалению, не взлетит.\n\nИ текст может много занимать места - вот представим, что википедию EN версию сюда перенесли (только текст) - это гигабайты если не более\n\n> [vlad20012](#comment_245_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Пока что рановато для этого, мне кажется. Слишком мало нод. Пусть лучше все новые ноды пока что будут таки полными.\n\nДа, это понятно, но на мой взгляд думать то можно заранее - накидать архитектуру, а когда придет время - реализуют",
				"added": 1484770742
			},
			{
				"comment_id": 357,
				"body": "Повторюсь - делать торрент на каждый контент - очень затратно в плане поддержки, что бы это работало придётся устраивать ротацию несколько сотен-тысяч торрентов",
				"added": 1484831018
			},
			{
				"comment_id": 360,
				"body": "> [antignu](#comment_9_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Такое решение действительно само напрашивается. Со временем так и будет, по крайней мере с некоторыми сайтами. Куда лучшим примером, чем биткоин является BitShares/Steem, которые изначально сделаны по такому принципу. При правильном решении слепого доверия не будет. \n> Такой подход это уже отход от формата сайтов, в сторону формата приложений. Но мне это кажется даже более лучшим. Так например, можно было бы создавать приложения, где пользователям даже не обязательно знать что они используют ZN или похожую сеть. Они просто ставят легкую версию с плеймаркета, например, которая коннектится и работает через любой доступный полный узел.\n\nТаким образом ZeroNet займет нишу CDN и очень успешно будет эксплуатироватся провайдерами - тут же чистый профит - соблюдения законов по хранению трафика + кэширование (транспорт зашифрован, так что нам данная проблема не категорична)",
				"added": 1484856086
			},
			{
				"comment_id": 361,
				"body": "> [antignu](#comment_10_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Кстати, в новой версии Nxt теперь во время загрузки блокчейна, работа идет в режиме лайт-клиента через случайную удаленную ноду, только с пометкой об этом. Правда в ZN раньше нужно было думать о таком. Но было бы удобно.\n\nРаньше - не надо тк тогда core узлов будет мало",
				"added": 1485275841
			},
			{
				"comment_id": 362,
				"body": "> [antignu](#comment_18_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): я имею ввиду не в целом, а по сайтам, то есть без различия на полный узел и API-шлюз.\n\nТогда я не понял мысли",
				"added": 1485380111
			},
			{
				"comment_id": 364,
				"body": "> [antignu](#comment_19_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Чтобы сайт был разбит на фронтенд и бэкенд, и в том числе можно было пользоваться этим удаленно, запросами к другим узлам. В текущем виде, это пожалуй бы усложнило разработку зайтов, которых и так пока немного.\n\nПонял, ты имеешь ввиду изначальной закладки такой архитектуры. Да тут собственно она и так заложена - JS код (который лёгкий) пытается обратится к базе данных (которая что-то весит) вопрос в том, что сейчас он обращается к 127.0.0.1 и ему отвечает нужный интерпритатор, в случае удаленной реализации - запрос будет пересылаться",
				"added": 1485469958
			}
		],
		"2_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 358,
				"body": "Так проще же - есть кнопка подписки на темы\\форумы\\ответы итд",
				"added": 1484831095
			}
		],
		"2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 367,
				"body": "Звучит как попытка построить GRID систему из буханки хлеба, но зачем?",
				"added": 1485795737
			}
		],
		"1_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N": [
			{
				"comment_id": 368,
				"body": "Нет, никакой серверной части не надо, валидацию можно описать в коде сайта, что бы неверный контент не попадал. Если потом потребуется какая-то более сложная валидация - так это смарт контракты в *coin системах",
				"added": 1485795872
			},
			{
				"comment_id": 371,
				"body": "> [antignu](#comment_31_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Как запретить удаление?\n> \n> Речь про ZeroNet. Не вижу ничего хорошего прикручивать овердофига всяких коинов, и так уже целый неймкоин сбоку. Для децентрализованных приложений будут другие решения, нежели ZN.\nНадо открыть спецификацию dbshema и смотреть, или создать issue на github и спросить",
				"added": 1485851057
			}
		],
		"1_1PAnNhncRpwtUsy82YbLd7iBJHxTadBaUd": [
			{
				"comment_id": 373,
				"body": "тебе нужен ключ, возьми его и тогда да",
				"added": 1486031999
			}
		],
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": [
			{
				"comment_id": 374,
				"body": "> [45green](#comment_7_1HS4QNHtZLYa7cq7h2sWRhwuZSAJMZYi4M): Он функционирует, а форум - нет.\n\nа что с форумом?",
				"added": 1486032061
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 376,
				"body": "в рамках ближайшей блокировки тредик снова актуален",
				"added": 1498487007
			},
			{
				"comment_id": 377,
				"body": "> [rumka](#comment_5_17SJE1VkGz1JN4gBfo5oBhgrt4zbBYY12F): Призыв юзать телегу из принципа? Интересно, сколько вообще отвалится пользователей после блокировки?\n> Вообще я разочарован в телеге, пару лет никаких полезных улучшений в плане безопасности и неблокируемости. Посмотрим, как теперь поведет себя. Впилили звонки, лучше бы впилии регу по e-mail, все равно там ники.\n\nТак телега не про анонимность а про приватность",
				"added": 1498507436
			},
			{
				"comment_id": 378,
				"body": "> [rumka](#comment_7_17SJE1VkGz1JN4gBfo5oBhgrt4zbBYY12F): приватность там тоже так себе\n\nНомер в чатах не палит и это уже достижение по сравнению с остальными",
				"added": 1498680372
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 380,
				"body": "Господа,  а есть то какая версия zerobord с модерацией или еще нет? из проекта на полгода выпал",
				"added": 1549147128
			},
			{
				"comment_id": 381,
				"body": "по поводу обновления ссылок на блоги - согласен, надо будет сделать",
				"added": 1549147394
			},
			{
				"comment_id": 382,
				"body": "> [geekless](#comment_106_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вы хотели сказать, ZeroTalk? Нету, есть только мой todo на будущее.\n\nда, я о zerotalk",
				"added": 1549182916
			},
			{
				"comment_id": 383,
				"body": "> [quirrel](#comment_50_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Самая свежая версия - та, на которой работает ZeroTalk.\n\nи там есть модерация?",
				"added": 1549215022
			}
		]
	},
	"comment_vote": {
		"4_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"19_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"9_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"8_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"244_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"10_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"1_1L6t5QZahvCGf2DaYQC4R2zk76GgSAFha2": 1,
		"5_1Atfgt7nWJaiJZzjRiTwgoPTK24qS6uz2h": 1,
		"4_12WG2wGf3i1pGq6aRSmw4oaC5jkLKPiMyz": 1,
		"1_16wg5jjR6G2CPNKt6CizXcVXuhSJzkfFH1": 1,
		"5_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": 1,
		"10_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": 1,
		"19_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"3_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": 1,
		"38_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"26_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"218_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"1_1BA3KEprzzcMWAS173cqepiJC7pFFFgHdo": 1,
		"17_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b": 1,
		"234_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"1_1EWP7ge5xT5N2qtVww9zY36tJa83W4JHHT": 1,
		"25_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": 1,
		"81_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1
	}
}