{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1522753244,
			"title": "Can we create a timeline mechanism for ZeroNet Sites which will allow a host to host content from a particular time? So that IPFS's goal can also be integrated without integrating their tech.",
			"body": "We want zeronet sites to be scalable, at the same time we want to archive our data, so what if we could create a timeline hosting mode for our sites, which will allow a particular host to host content from a particular time to current time, even if the owner has deleted some content in between. It can also allow new hosts to quickly get up to speed by reducing the overhead. Any thoughts?",
			"added": 1522753243
		}
	],
	"topic_vote": {
		"1522673989_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"1522753244_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"1522698319_1CRjFXJs62yigvAahAzVw1nAxPX8K7Kk5T": 1,
		"1522413230_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1522814572_1CRjFXJs62yigvAahAzVw1nAxPX8K7Kk5T": 1,
		"1522933439_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1523147173_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
		"1523080841_1467X2hmPQP5gAKnh9uhQX6M1DWCHqLbCG": 1
	},
	"next_comment_id": 13,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "hello, is anybody here!",
				"added": 1522692943
			},
			{
				"comment_id": 4,
				"body": "whats the peak no of users on zeronet upto now?",
				"added": 1522772798
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 2,
				"body": "you will be surprised, its going to build history!",
				"added": 1522700951
			}
		],
		"1522753244_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": [
			{
				"comment_id": 5,
				"body": "we will need to merge everything in between particular time and current time, with current time overriding particular time in case of a conflict, what do you think?",
				"added": 1522777681
			}
		],
		"1522814572_1CRjFXJs62yigvAahAzVw1nAxPX8K7Kk5T": [
			{
				"comment_id": 6,
				"body": "thumbs up for UBI!",
				"added": 1522932678
			}
		],
		"1522933439_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 7,
				"body": "no need of credit transactions, you can use always free resources on google cloud or aws, its enough for hosting a zeronet proxy for now!",
				"added": 1522933534
			},
			{
				"comment_id": 8,
				"body": "> [sylvaine](#comment_51_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): zerocat.eu is up and running now. sites will be added per request, and I'll be adding plenty myself as I go Got 450GB storage space for optional bigfiles. (This mainly helps files get seeders. Files with lots of seeders get automatically deleted, i think..) Unlimited bandwith. Gigabit connection. Passes the cloudfail.py penetration test. :) further penetration tests will be conducted against origin IP.. Intercontinental Ballistic Missiles are ready to be uploaded and configured, and only to be used for deterrence purposes. Let this be a warning to governments - don't mess with filesharing sites.. or get ready to be ass-pounded! :)\n\nawesome!",
				"added": 1522999133
			},
			{
				"comment_id": 9,
				"body": "> [sylvaine](#comment_50_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): hmm. I'm not sure I really trust Google or Amazon. We're practically hosting something 'worse' than the Pirate Bay, after all. They could be forced to hand over intelligence. This proxy will be ad-free and cryptocurrency miner free, of course. I'll be setting it up because I need it too, so it benefits me. And because I don't wanna have to host stuff on my PC and expose it to threats. And because they're great places to store and launch nukes. The Netherlands have pretty mint VPS servers, and are torrent-friendly. And they accept Monero for payments. :)\n\nno problem there, as everything from client to the network is already open-source, still they can't do anything because of the decentralized and crypto nature of zeronet!",
				"added": 1522999482
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_309_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @sylvaine I've just found a way to download any site to your proxy. I've downloaded ThunderWave, Git Center and Kiwipedia for test, please check. (of course you may remove them if you want) Where can I send you the fix safely?\n\nis it an security issue?",
				"added": 1523002765
			}
		],
		"1523121756_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": [
			{
				"comment_id": 11,
				"body": "keeping tabs on tech, stocks, companies and governments etc.!",
				"added": 1523256945
			}
		],
		"1523147173_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": []
	},
	"comment_vote": {
		"2_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"42_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1151_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"5_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"4_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"6_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"7_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"51_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"93_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"12_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"37_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1
	}
}