{"cert_user_id": "HulaHoop0@github", "next_comment_id": 3, "comment": {"1604067685_mirrored_adrelanos_github": [{"comment_id": 1, "body": "pip still has no idea about code signing in this day and age. It was conisdered a big leap forward when they implemented fetching over HTTPS and reject plaintext connections which is really sad considering the poor security assumptions that even this would have: \r\n\r\nhttps://github.com/pypa/pip/issues/1167\r\n\r\nHere are two different real world cases of malware snuck into PyPi being executed becuase of pip's non existent security:\r\n\r\nhttps://arstechnica.com/information-technology/2017/09/devs-unknowingly-use-malicious-modules-put-into-official-python-repository/\r\n\r\nThe problem is ultimately the result of developers and administrators who fail to inspect packages thoroughly. Adding to the insecurity, the widely used pip package management system (pictured above), which most Python developers rely on, doesn't require cryptographic signature before executing code when a package is installed. \r\n\r\nhttps://www.zdnet.com/article/twelve-malicious-python-libraries-found-and-removed-from-pypi/\r\n\r\n***\r\n\r\nPlease consider an alternative packaging/installation model that doesn't rely on pip. Either using stuff in Debian backports or just making an AppImage (which includes code that is audited by you beforehand) - Electrum does the latter since their release cycle is far too rapid for it to sync with Debian's.\r\n\r\nWe really love Zeronet and want to include it in our privacy distro by default, but unless we can have a secure installation mechanism, we just can't do it.\r\n\r\nPS. I am only interested in Zeronet dev replies. If you are an enthusiast please express yourself in another thread.", "added": 1575686953, "modified": 1575686953, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2326#issuecomment-562817282", "source_type": "github"}, {"comment_id": 2, "body": "> Cryptographicly signing packages does not prevent their authors to publich malicious packages, which happened in case of npm and pip.\r\n\r\nRight. What we want to do is ensure no one else, but the package author has modified its code.\r\n\r\nThe transport layer security is a nice plus in case the package manger itself has a RCE bug, but this is besides the point for code integrity.\r\n\r\nI guess we are on the same page about AppImage which is a good sign. We know how to deal with those and they suit us.", "added": 1575728377, "modified": 1575728377, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2326#issuecomment-562869707", "source_type": "github"}]}}