{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 1,
				"body": "basicamente siendo un loko miner de criptodivisas...me entere de una moneda que opera en la zeronet (stellite coin) , y me dije, que coño es eso de zero net? el cual le da todavia mas privacidad a una moneda basada en el algoritmo criptonote/criptonight...osea, privacidad sustentada sobre mas privacidad.... en cuanto lei que era una arquitectura de internet descentralizada (punto a punto) ya esta, me ha enamorado.... sera STELLITE la critpo del internet alternativo?\n\nlarga vida a la decentralizacion!!!!",
				"added": 1530449675
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 2,
				"body": "anartzkista, de criptoanarquista!!!!!\n\nanartzkista@zeroid.bit",
				"added": 1530450961
			}
		],
		"1_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": [
			{
				"comment_id": 3,
				"body": "> [seniortriple](#comment_1_1911nAfi1hjzt5Z5q4xcs12yqLeSHjS2Gp): en ejpaña dificil y jajak viven en el puto medievo\n\npero que medievo ni que pollas...no seras casualmente latinoamericano no??? xk si comparamos las economias y las calles, pavimentos, infraestructuras............. lel.... y eso que yo no soy español....",
				"added": 1530451049
			},
			{
				"comment_id": 4,
				"body": "> [anartzkista](#comment_3_1HnRN2pXTDFAMvLyyPz7rJMN41XEyT3Dxq): pero que medievo ni que pollas...no seras casualmente latinoamericano no??? xk si comparamos las economias y las calles, pavimentos, infraestructuras............. lel.... y eso que yo no soy español....\n\ny si nordvpn funciona de cojones en ESPAÑA tambien...madre mia cuanto cavernicola suelto..",
				"added": 1530451090
			}
		],
		"1_1GJgB7aX7gpbN7irqCZHdVGfQHxmmpg851": [
			{
				"comment_id": 5,
				"body": "tor resulta mas encriptado que zeronet? desconozco si tor se basa en servidores centrales o en peer to peer, pero desde luego, no me parece descabellado pregntar por un blackmarket en zeronet...de echo LO HAY.... y para mi es mucho mas privado un puntoapunto, que un server como silkroad...",
				"added": 1530451243
			}
		],
		"1_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh": [
			{
				"comment_id": 6,
				"body": "podemos ser amigos!",
				"added": 1530454804
			},
			{
				"comment_id": 7,
				"body": "> [anartzkista](#comment_6_1HnRN2pXTDFAMvLyyPz7rJMN41XEyT3Dxq): podemos ser amigos!\n\njust kidding... comprate algunos....",
				"added": 1530454821
			}
		],
		"3_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 8,
				"body": "> [4567l](#comment_8_1Lh89nAb4YeizEER15JUcpscy37mZwDUer): La descentralización es la única vía transitable si queremos un Internet incensurable y verdaderamente nuestro. John Perry Barlow, en su breve manifiesto 'A Declaration of the Independence of Cyberspace' (1996), decía lo siguiente: «Governments of the Industrial World, you weary giants of flesh and steel, I come from Cyberspace, the new home of Mind. On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather». \n> Está en nuestras manos.\n\npero donde esta la incensurabilidad del peertopeer si las autoridades pueden cerrar webs de esta naturaleza? lo suyo es, para hablar de incensurabilidad es que a pesar de querer tumbarla x la autoridad, no puedan bajo ningun medio informatico.",
				"added": 1530455346
			}
		]
	},
	"comment_vote": {}
}