{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 1,
				"body": "I'm no expert but I got into it like most people did, to make easy money. lately though I'm way more interested in the tech, I made a DIY hardware wallet for long-term offline storage and I've bought some electronic parts with it",
				"added": 1620659090
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 2,
				"body": "I'm pretty pro vaccine but anytime anyone wants to say things like \"deny science\" or \"believe in science\" it makes me want to beat them over the head with a bat. That kind of terminology is half the problem surrounding the scientific and medical fields today and stems from a gross misunderstanding of both fields and the philosophy underlying them.",
				"added": 1621526088
			},
			{
				"comment_id": 3,
				"body": "> [harbringerofdoom](#comment_4_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d): This is what happens when you really want to follow the crowd and do what everyone else is doing: [...]\n\ncare to share some data showing any of the covid 19 vaccines don't protect?",
				"added": 1622037337
			}
		],
		"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX": [
			{
				"comment_id": 4,
				"body": "> [baconboi](#comment_11_1KBserDE8oownu1aR5REHcC3jf9qNkmQDo): I miss when you could buy fix cars, and they were designed for serviceability. All I have to look forward to is a Mitsubishi mirage. Everything has a stupid jatco CVT that's gonna grenade, or an engine designed in Germany so it uses TORX bolts. at least GM made a straight 6 diesel,  but they're all automatic so I'll have to buy an older NPR if I want a manual truck.\n\nso this is an example of something that bugs me a lot. it stems from the whole idea of maintaining a brand's reputation, so only the brand should fix it, etc. but I think it's a reflection of the idea that people are too stupid to fix their own cars(or phones or laptops or walls or toilets). On the one hand, I'd say the average person is pretty stupid and shouldn't be allowed to fix their own things(otherwise you end up with a house like I'm living in right now), but on the other hand there are people out there who are perfectly capable of taking care of things themselves. But we all get lumped together into one big pot and treated the same. most people benefit from it but a few folks really get the shaft at the end of the day. \n\nIt's like that with everything though, most people are too dumb to manage themselves and need some sort of oversight but some people don't. Unfortunately the people that don't are prevented from managing themselves. It's my biggest beef with most anarchist/libertarian politics actually, I think the majority of humanity is literally too stupid to survive without someone breathing down their neck",
				"added": 1622038172
			}
		]
	},
	"comment_vote": {}
}