{
	"title": "自由人",
	"description": "自由人共和国\n向往自由之人的共同信仰",
	"links": "[自由人聊天室](http://127.0.0.1:43110/1LaXzrgAtsXwdQQdkzFwbLPozoWgTVUQnv)\n*   [管理者的ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/19RJRZnsN9ZcvXSuXFUgpe3S8QHaxBZYHY/estar@zeroid.bit)\n*   [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1500380850,
	"post": [
		{
			"post_id": 8,
			"title": "《自由人信仰法》0.2017.0718.0版",
			"date_published": 1500359910.277,
			"body": "## 第一章 总则\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、信仰是约束自己的，而不是限制别人或惩罚别人的。\n2、任何人不能以自己的信仰为由强迫或干涉他人做事。\n3、任何人不能以自己的信仰为名为自己谋利。\n4、任何信仰不得违反《自由人道德法》</font>\n\n* * *\n\n## 第二章 自由人无神教（需要了解）\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、这个世界没有神（或者上帝、真主等）。\n2、也没有天堂和地狱（或者天庭、极乐世界、火狱等）。\n3、这个世界没有任何有思考能力的东西超脱于世间万物存在。\n4、这个世界只有无思考能力的规则引导着万物的运动变化。\n5、规则是客观的，不会因任何东西的意识而改变，但是可以被利用。\n6、规则是相对的，不同区域的规则不一定相同。\n7、小区域规则的不同可能是同个规则的不同表现。\n8、大区域规则的不同可能是两个本质不同的规则。\n9、人所认为的神迹事件、灵异事件只不过是未被发现的规则或者是别有用心的欺骗。\n10、任何对神的尊崇和维护都是无意义的，凡是人认为是神安排的事件都是无意的巧合或是有意的欺骗。\n11、信仰本教依然可以创造想象力天马行空的作品，依然可以创造世界观各式各样的作品。</font>\n\n## 第三章 人类意识的本质（需要了解）\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">意识也就是俗话所说的灵魂，但是灵魂无法出窍，出窍只是大脑活动产生的想象力信息。\n意识依托于人脑的物理结构，无法独立存在，当人脑组织结构被彻底破坏，人的意识就会同时彻底消散。意识不会变成另一个东西跑到另一个地方。但如果有其他一定复杂程度的合适结构存在，意识才有可能依托于其之上存在。\n人的意识可以分为两块，一块是表意识，块是潜意识。\n潜意识来源于表意识，而又能影响表意识。（表意识所习得的知识和技能经过重复记忆和训练可以储存在潜意识里，微观表现于大脑神经细胞的特定高速神经回路的建立；表意识决策时又会验证和调用潜意识里的信息）\n表意识是慢而精确的，潜意识是快而模糊的。\n表意识单位时间内所能处理的信息量远不及潜意识。\n人类意识所产生的脑电波只有在特定条件下才能被另一个人接收（比如双胞胎间彼此高度相似的脑结构）。\n人类的情绪和梦境是由潜意识主导的，很难由表意识控制；而数学计算与逻辑推理等是由表意识主导的，潜意识能够提供模糊验证和灵感。\n感性只是理性的复杂化，人类只不过很难详细表达出其复杂的推理过程。</font>\n\n## 第四章 世界本源假设（不一定正确，可信可不信）\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">-世界是无中生有的。\n-膜（还可称为“场”、“虚”、“无”等）：我们所生活的宇宙其实是一张庞大的“膜”；\n-弦：“膜”各处的震动便是“弦”，弦（膜）是连续的，无法分割（不过可以通过分割来描述弦更方便理解）；\n-弦能（电磁波）：当某处“弦”没有自转（直线起伏类震动）时，它就是通常所说的“电磁波”，电磁波能够以宇宙间最快速度传播，俗称的光，是电磁波的一种；\n-弦质（微观粒子）：当某处“弦”自转时（原地旋转类震动），无数种不同的自转方式就是无数种不同的“基本粒子”，如“夸克”、“电子”等；弦质正旋就是正弦质（正物质），反旋就是反弦质（反物质），正物质和反物质相撞就是正旋弦和反旋弦的调和，使两股弦合为一体不再旋转震动，宏观表现就是两种物质的湮灭，弦质的震动方式相对比较难受周围其它弦质或弦能的影响，其宏观体现就是“质量”，弦质旋转地越快,其微观粒子质量就越高，就越容易影响周围的弦。\n-温度:弦运动地越剧烈,温度越高\n-时间:弦的运动体现时间的变化\n-“弦”对“弦”的影响宏观上来看就是四种基本力：万有引力、电磁相互作用力、弱相互作用力、强相互作用力。“夸克”的结合又形成了“质子”和“中子”，“质子”、“中子”和“电子”的结合又形成了“原子”，“原子”又可以形成“分子”、“离子”等。就是这些东西，形成了我们能看到的大千世界。</font>"
		},
		{
			"post_id": 7,
			"title": "《自由人婚姻法》0.2017.0717.0版",
			"date_published": 1500281400.534,
			"body": "## 第一章　总则\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、任何人都有权结成婚姻关系，任何人都有权解除婚姻关系。\n2、任何人都有权结成非婚姻关系。除此条外，非婚姻关系的人不受本法保护。\n3、本法所说的婚姻关系仅限于年满15周岁且具有独立思考与交流能力的人。\n4、当一个人正处于一段婚姻关系时，他不能同时进行另一段婚姻关系。\n5、禁止包办、买卖婚姻和其他干涉婚姻自由的行为。\n6、禁止借婚姻索取财物。当事人有拒绝出彩礼、嫁妆的权力，有拒绝举办婚礼的权力。</font>\n\n* * *\n\n## 第二章　结婚\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、结婚对象年龄自由：只要当事人自愿，无论他们有多大年龄差，都有权结婚。\n2、结婚对象种族自由：只要当事人自愿，无论他们是什么种族，都有权结婚。\n3、结婚对象性别自由：只要当事人自愿，无论他们是什么性别，都有权结婚。\n4、结婚对象数量自由：只要当事人自愿，无论他们有几人，都有权结婚。\n5、结婚对象血缘自由：只要当事人自愿，无论有无血缘关系，都有权结婚，但不建议生育。\n6、结婚必须当事人完全自愿，不许任何其他人（包括父母、子女、政府等）对他们加以强迫或干涉。\n7、要求结婚的人必须亲自到婚姻登记机关进行结婚登记。符合本法规定的，予以登记，发给结婚证。取得结婚证，即确立婚姻关系。未办理结婚登记的，应当补办登记。\n8、形成婚姻关系的人有权脱离各自原生家庭独立生存。不应当强迫一方加入另一方的原生家庭。\n9、因胁迫结婚的，受胁迫的一方可以向婚姻登记机关或人民法院请求撤销该婚姻。受胁迫的一方撤销婚姻的请求，应当自结婚登记之日起一年内提出。被非法限制人身自由的当事人请求撤销婚姻的，应当自恢复人身自由之日起一年内提出。\n10、无效或被撤销的婚姻，自始无效。当事人不具有婚姻关系的权利和义务。同居期间所得的财产，由当事人协议处理；协议不成时，由人民法院根据照顾无过错方的原则判决。</font>\n\n## 第三章　家庭\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、家庭中的每个人地位平等，任何一方不能强迫另一方做某事，也不能干涉另一方做某事。\n2、婚后家庭有生育子女的权力，也有拒绝生育子女的权力。\n3、婚姻关系中有能力受孕的人具有拒绝受孕的权力。\n4、婚后家庭有权放弃所生子女的抚养权交给公共抚养院，但是必须支付其子女成年前的最低基本开销。\n5、婚后家庭不得私自遗弃子女。禁止溺婴、弃婴和其他残害婴儿的行为。\n6、具有婚姻关系的人彼此间有互相扶养的义务。一方不履行扶养义务时，需要扶养的一方有要求对方付给扶养费的权利。\n7、父母对子女有抚养教育的义务；子女对父母有赡养扶助的义务。\n父母不履行抚养义务时，未成年的或不能独立生活的子女，有要求父母付给抚养费的权利。\n子女不履行赡养义务时，无劳动能力的或生活困难的父母，有要求子女付给赡养费的权利。\n8、子女的名字在成年前只有名没有姓，其成年后有自由选择姓氏的权力：可以随父姓，也可以随母姓，也可以起其他姓，也可以没有姓。\n9、父母有保护和教育未成年子女的权利和义务。在未成年子女对国家、集体或他人造成损害时，父母有承担民事责任的义务。\n10、婚姻关系外所生的子女，不受本法保护，除非得到婚姻关系内其他人的认可。\n11、亲生子女、继养子女与领养子女有相同的权利和义务。\n12、继父母与继子女间，不得虐待或歧视。继父或继母和继养子女间的权利和义务，适用本法规定。\n13、有负担能力的祖父母、外祖父母，对于父母已经死亡或父母无力抚养的未成年的孙子女、外孙子女，有抚养的义务。有负担能力的孙子女、外孙子女，对于子女已经死亡或子女无力赡养的祖父母、外祖父母，有赡养的义务。\n14、有负担能力的子女，对于父母已经死亡或父母无力抚养的未成年的亲兄弟姐妹，有扶养的义务。\n15、子女应当尊重父母的婚姻权利，不得干涉父母再婚以及婚后的生活。子女对父母的赡养义务，不因父母的婚姻关系变化而终止。</font>\n\n## 第四章 财产\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、婚姻关系中的任何人都有财产独立的权力。\n2、夫妻对共同所有的财产，有平等的处理权。夫妻可以约定婚姻关系存续期间所得的财产以及婚前财产归各自所有、共同所有或部分各自所有、部分共同所有。约定应当采用书面形式。没有约定或约定不明确的，适用本章第3条的规定。\n3、婚姻关系中只属于一方的财产如下：一方的婚前财产；一方因身体受到伤害获得的医疗费、残疾人生活补助费等费用；遗嘱或赠与合同中确定只归夫或妻一方的财产；一方专用的生活用品；其他应当归一方的财产。\n4、婚姻关系中只属于一方的债务另一方没有义务帮忙偿还。且父母的债务子女同样没有义务帮忙偿还。\n5、婚姻关系中具有债务的人不能转移自己的财产给他人。\n6、有婚姻关系的人默认允许相互继承遗产，除非遗嘱另有说明。\n7、父母和子女默认允许相互继承遗产，除非遗嘱另有说明。</font>\n\n## 第五章　离婚\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、婚姻当事人自愿离婚的，准予离婚。双方必须到婚姻登记机关申请离婚。婚姻登记机关查明双方确实是自愿并对子女和财产问题已有适当处理时，发给离婚证。\n2、婚姻中任何一方要求离婚的，可由有关部门进行调解或直接向人民法院提出离婚诉讼。\n3、受孕方在怀孕期间、分娩后一年内或中止妊娠后六个月内，另一方不得提出离婚，并依法行使扶养义务。受孕方提出离婚的，或法院认为确有必要受理男方离婚请求的，不在此限。\n4、离婚后，婚姻双方自愿恢复关系的，必须到婚姻登记机关进行复婚登记。\n5、父母与子女间的关系，不因父母离婚而消除。离婚后，子女无论由父或母直接抚养，仍是父母双方的子女。离婚后，父母对于子女仍有抚养和教育的权利和义务。\n6、离婚后，生育子女的一方有子女的优先抚养权。由人民法院根据子女的权益和双方的具体情况判决。\n7、离婚后，一方抚养的子女，另一方应负担必要的生活费和教育费的一部或全部，负担费用的多少和期限的长短，由双方协议；协议不成时，由人民法院判决。\n8、关于子女生活费和教育费的协议或判决，不妨碍子女在必要时向父母任何一方提出超过协议或判决原定数额的合理要求。\n9、离婚后，不直接抚养子女的父或母，有探望子女的权利，另一方有协助的义务。行使探望权利的方式、时间由当事人协议；协议不成时，由人民法院判决。父或母探望子女，不利于子女身心健康的，由人民法院依法中止探望；中止的事由消失后，应当恢复探望的权利。\n10、离婚时，婚姻双方的共同财产由双方协议处理；协议不成时，由人民法院根据财产的具体情况，照顾子女权益的原则判决。\n11、夫妻书面约定婚姻关系存续期间所得的财产归各自所有，一方因抚育子女、照料老人、协助另一方工作等付出较多义务的，离婚时有权向另一方请求补偿，另一方应当予以补偿。\n12、离婚时，原为夫妻共同生活所负的债务，应当共同偿还。共同财产不足清偿的，或财产归各自所有的，由双方协议清偿；协议不成时，由人民法院判决。\n13、实施家庭暴力、虐待、遗弃家庭成员，受害人有权提出请求，当地政府和公安机关有义务予以劝阻、调解或其他必要帮助。\n14、离婚时，一方隐藏、转移、变卖、毁损共同财产，或伪造债务企图侵占另一方财产的，分割共同财产时，可以对此方少分或不分。离婚后，另一方发现有上述行为的，可以向人民法院提起诉讼，请求再次分割夫妻共同财产。\n15、对拒不执行有关扶养费、抚养费、赡养费、财产分割、遗产继承、探望子女等判决或裁定的，由人民法院依法强制执行。有关个人和单位应负协助执行的责任。\n16、其他法律对有关婚姻家庭的违法行为和法律责任另有规定的，依照其规定。</font>\n\n参考：[《中华人民共和国婚姻法》](http://baike.baidu.com/item/%E4%B8%AD%E5%8D%8E%E4%BA%BA%E6%B0%91%E5%85%B1%E5%92%8C%E5%9B%BD%E5%A9%9A%E5%A7%BB%E6%B3%95/63756?fromtitle=%E5%A9%9A%E5%A7%BB%E6%B3%95&fromid=135901)"
		},
		{
			"post_id": 6,
			"title": "新的名字",
			"date_published": 1500267059.804,
			"body": "起名叫“自由人”的话，怎么样呢？"
		},
		{
			"post_id": 5,
			"title": "《自由人道德法》0.2017.0717.0版",
			"date_published": 1500281554,
			"body": "# ——————最高纲领——————\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">-尊重生命：不残害虐杀任何生命，对从任何生命身上得来的食物、药物、衣物等保持感恩，不得铺张浪费。\n-敢作敢当：为自己所说的任何话、所做的任何事负责，不论是无意的，还是有意的。不得逃避和欺骗。\n-自由为上：若做某件事使自己感到开心快乐，并且能承受它可能带来的负面后果，那就去做。\n-恩怨分明：若有人对我提供了帮助，我就必须对其表达语言和物质上等值的感谢，除非在事前我表达过拒绝接受帮助的意愿。若有人先对我造成了伤害，若他是无意的，我要尽量宽容他；若他是有意的并拒绝道歉和赔偿，则我可以以相同手段报复并不需要承担任何后果。\n-不施人恶：如果我不想别人对我做出我无法接受的事情，那么我就先不要对别人做出这些事情。\n-不责无关：若某人自己的言行或某些人彼此间的言行是其自愿的，且与我无关，那我就无权指责或阻止他们。</font>\n---\n# ——————衍生纲领——————\n\n<font color=\"#2F4F4F\" size=\"3\" face=\"黑体\">1、人生来就是懒惰的，但是人想见识新鲜事物，于是变得勤劳了。我要适当勤劳，为建设、维护人类社会提供力所能及的劳动。极端的懒惰造就贪婪，贪婪引发犯罪与战争。适当的懒惰有益心情愉悦，有益社会进步。\n2、我就是我自己的主宰，我的一辈子不用为别人而活、不用为别人奉献自己。\n3、不要盲目相信权威，要勇于质疑和证实。\n4、不要轻易许诺无法完成的诺言，一旦许诺请务必完成。\n5、无知不是罪，但无知可能引发很多不必要的麻烦，所以最好主动学习。\n6、我不能用虚假的言辞诽谤任何人，毁人清白。\n7、我不能强迫他人实现自己的愿望。\n8、当有人向我求助并承诺报酬，我就有义务尽力所能及的帮助。\n9、我有权与任何人缔结婚姻契约关系，婚姻对象不限年龄、性别、血缘、数量，前提是我们之间所有人都是自愿的。\n10、我要为我所监护的不能正常思考的人的行为负担全部责任。如果此类人没有监护人，则他要为自己的行为负全部责任，责任判定方法与正常人无异。\n11、我要为我养育的后代在其成年之前（也就是拥有独立思考能力之前）的违法行为分担一半责任。</font>"
		},
		{
			"post_id": 4,
			"title": "组织名称征集中",
			"date_published": 1500024363.649,
			"body": "本组织暂用名称：自由人\n\n组织目的：为了中国人的自由、民主而贡献力量\n\n本组织正在征集组织名称，大家来共同想一个更合适的名字吧！"
		},
		{
			"post_id": 3,
			"title": "自由人法律正在编撰中",
			"date_published": 1500020994.774,
			"body": "请在评论处发表您期望添加进自由人法律的条例。"
		},
		{
			"post_id": 1,
			"title": "向往自由之人的共同信仰",
			"date_published": 1500019200,
			"body": "“自由人”今日正式创立。\n\n为了中国人的自由，为了全人类的自由！\n\n站内内容还请大家共同创造与维护。"
		}
	]
}