{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [deadgirlrising](#comment_1_14EvNT4CXZKyHpo4GPaq4YT4zTfumK2WSL): I've let the lizard in the house while I was running for the nearest open store that might sell some type of poison to spray down my house. \n\nI decided to just burn this shitty place down.\n\n>I'd keep it so toxic my grandkids will be born deformed.\n\nFuck me if I ever get grandkids.",
			"post_id": 1,
			"date_added": 1457645692
		},
		{
			"comment_id": 2,
			"body": "> [circle](#comment_1_1XGf6G78ZwZwz4FeZBtmzxtKAsTicgaBN): This story is much better than the last movie I've seen, thanks :)\n\nhahaha That movie must have been really shitty :) Thank you though.",
			"post_id": 1,
			"date_added": 1459274544
		},
		{
			"comment_id": 3,
			"body": "> [crowntuner](#comment_1_1GCULU5MSEFkSXYMAr22W6DszcNzU2vBS9): There are many, many of us who feel that way.  \n> One, two people?  Cool!\n> Frenzied?  Great!Calm?  Wunderbar!Creative? W00T!etc etc...\n\n> [transister](#comment_1_185DbM1bicB5M1wmxkPPVjaUH9mVrHzL8): This is gold.\n\n♥♥♥",
			"post_id": 2,
			"date_added": 1462030567
		},
		{
			"comment_id": 4,
			"body": "> [up4](#comment_1_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): \n\nThat's an interesting perspective, thanks for sharing.\n\nCan you please explain this a little further?:\n\n> And homosexuality (homo as in \"same\") is a better suited form of sexuality to human progress than heterosexuality can ever be.",
			"post_id": 4,
			"date_added": 1462039012
		},
		{
			"comment_id": 5,
			"body": "> [up4](#comment_2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): \n> Feminism understood as valuing behavioral \"complementarity\" is the direct opposite view. Feminism is not a humanism. It is a regressive sexism. Merely homophobia by another name.\n\nI think the truth usually lies somewhere in the middle. Sure, there are some nasty feminists but I know a lot of women who see feminism as a synonym of egalitarianism. I assume they are a big chunk of the feminist movement as well. They think that women are underprivileged and then try to fix it.\n\n> Heterosexual power struggles always have and always will fail. \n\nIsn't that true to all power struggles though? Please don't take this as if I was defending heterosexuality, I'm just trying to expand this idea.\n\n> Progress is homoerotic because that's where it gets its energy. A bunch of drunk dudes will eventually end up saying how much they \"love\" each other, and then change the world (\"bros before hoes\", « Liberté, Égalité, FRATERNITÉ »).\n\nI know what you mean and I agree in principle. But I don't think you are referring specifically to homosexual people, but *reasonable* people. \n\n> Try intelligence on the straight dating scene (\"no homo\") and see what you get.\n\nI think that's just a perception. I have \"dated\" a lot of heteros (that sounded a bit brag-ish), some homos and my conclusion is that what makes people interesting, intelligent and attractive (not physically) is their personality and their attitude.\n\nI agree that some hetero dudes are just [meatheads](https://www.urbandictionary.com/define.php?term=meathead). But I wouldn't be honest with myself if I said that those are the majority.\n\nAll in all, I think this right here is what anarchism is all about. We can have different views but the same principles. We love who we love and fuck who we fuck but in the end, we are all together. Opresive and regressive ideologies have no power when **WE THE BOLD** decide to be together, not the same.\n\n**[How Soon is Now?](https://www.youtube.com/watch?v=pEq8DBxm0J4)** is great. I've never heard it before. Nor *The Smiths* for that matter. Just great.",
			"post_id": 4,
			"date_added": 1462056709
		},
		{
			"comment_id": 6,
			"body": "> [up4](#comment_3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): If so, then why was a synonym to ghettoize and actually exclude people from the struggle for universal equality even needed ?\n\nWas it though? Do you think women want(ed) to be superior to men? If yes then that's your opinion and I politely disagree. If no then feminism is just a movement focusing on bringing women and men to the same level. I think groups are just something that humans do. Black Lives Matter is all about black people but in its essence it is about equality, is it not? I think feminism, at least the silent majority, is the same.\n\n> Look, you could be a lady for all I know. Do you feel that I am intellectually discriminating against you?\n\nNot at all.\n\n> Autists are underprivileged (or are they?) and they don't have \"autistism\". Or it is not as prevalent. Would they too benefit from that synonym?\n\nSure, why not? The names are not the important part, the ideas or goals are. There is nothing wrong with seeking social equality. This, I think, is only a semantics discussion.\n\nAgain, this was the statement I originally replied to:\n\n> Feminism understood as valuing behavioral \"complementarity\" is the direct opposite view. Feminism is not a humanism. It is a regressive sexism. Merely homophobia by another name.\n\nWhich you replied when I asked to clarify *\"And homosexuality (homo as in \"same\") is a better suited form of sexuality to human progress than heterosexuality can ever be.\"* \n\nI don't think you successfully explained those claims.\n\n> Some people say what doesn't kill you makes you underprivileged. Other (usually better) people say it makes you stronger.\n> Occam's Razor tells me that if you think natural selection is immoral, fix biology. You need not come up with God, Man and Patriarchy. Like, at all. If you are honest, that is.\n\nI see what you mean here, but I think you are mistaking biological *underprivilege* with social. I think it's very unlikely that you believe that feminism, or at least the version I described previously, is about biology.\n\n> Evolution is a power struggle, and I agree with Teilhard de Chardin that its teleology is intelligence. So no, I would say that a power struggle that leads to more intelligence (collective, individual) is a success and if it does not, it's a failure. Extinction would be the ultimate failure, here, of course. It happened to genes, it happened to species, it happened to cultures. All this before there was post-colonialist and feminist ethical rethorics. It will continue to happen, because meritocracy and natural selection work.\n\nDo you mean that homosexual power struggles lead to more intelligence? That's a bold statement, I would like to see some proof. I stand by what I said, *\"I don't think you are referring specifically to homosexual people, but reasonable people.\"* Which you replied with:\n\n> Or intelligent people. That being said, « sexual cognitive dimorphism » actually is a thing.\n\nSo you agree with me.\n\n> Again, we are talking about biology, \n\nI wasn't, I was talking about social change. Feminism is not about biological change, I don't think. That's why I mentioned privilege. Male and females are different, that's a fact. Their social *\"privilege\"* is the issue here.\n\n> 9 out of 10 guys I sleep with identify themselves as heterosexuals. They can identify themselves as attack helicopters for all I care. We are talking about attractions and tropisms that lead to meaningful and intelligence-enhancing relationships. \n\nAgain, your initial statement was *\"Try intelligence on the straight dating scene (\"no homo\") and see what you get.\"*. The whole problem here is that you are seeing, from what I understood, homosexuals as inherently superior (at least intellectually) and I can't see how that is true. I again think you are talking about reasonable homosexuals and confirmation bias would hide unreasonable ones.\n\n> Oh no my friend, the almost TOTALITY of hetero dudes are just meatheads. The rest are in some sort of unfortunate closet.\n\nCitation needed.\n\n> **pzmw**: All in all, I think this right here is what anarchism is all about. We can have different views but the same principles. We love who we love and fuck who we fuck but in the end, we are all together. Opresive and regressive ideologies have no power when **WE THE BOLD** decide to be together, not the same.\n\n> **up4**: In principle, who am I to disagree to that ? :D\n\n:D sorry if I sounded a bit weird, I promise nothing at all that I write is meant to mock you. I care a lot about freedom, equality and solidarity (or fraternity if you will) and all the ones that I think are derived from them like privacy, free speech and all the others.\n\nWhen I say stuff like *\"I agree in principle\"* I often mean that I agree with what you mean and not what you said.\n\nSorry for the long-ass delay.",
			"post_id": 4,
			"date_added": 1463966398
		},
		{
			"comment_id": 7,
			"body": "> [up4](#comment_4_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): \n\nThat's ok.\n\n> I'm sure you're a marvellous person. I would just spank you a little bit now. Really works miracles. :D\n\nI like a little bit of spanking. ;D\n\nI'm writing another post about sex. But this time it features sex.\n\nBy the way, do you have a blog?",
			"post_id": 4,
			"date_added": 1463973880
		}
	],
	"comment_vote": {},
	"post_vote": {
		"1": 1
	}
}