{
	"content":"<div name='ad_div' data-link='http://www.chunshuitang.com/' style='border-bottom: 1px solid #dddddd;text-align: center;width:100%;'><div name='imgadv' src='data/imgs/category/gg01.jpg' data-scale='1' style='width:640px;height:202px;margin: 0 auto;'></div><div style='margin: 10px 10px;font-size:14px;color:#888; '>情趣广告位跳转，让商机展开翅膀！</div></div>\r\n\r\n　　女人所喜欢的“坏男人”的坏，不是指人格上的坏。而是，风流却不下流，魅力与风度兼备的“坏”，是让女人又爱又恨又不舍的“坏”，是有情有义懂得适可而止，给女人于一种“坏坏的”感觉。  \r\n其实，这个世界上从不缺少坏人，特别是坏男人。或许他们总会以偷盗抢劫、坑蒙拐骗，泼皮无赖，以及各种人情淡薄的画面出现，也或许以人前君子背后小人的阴险出现。但我们今天所要聊到的，大多数女人所喜欢的“坏男人”，却与此毫不相干。\r\n\r\n<div name='imgcard' style='width:546px;height:345px;background-image:url(data/imgs/category/love01.jpg);box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-moz-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-webkit-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);margin:20px auto;background-size: contain;border-radius:5px;'></div>\r\n\r\n　　那么，大多数女人所喜欢的“坏男人”会是什么样子呢？女人所喜欢的“坏男人”的坏，不是指人格上的坏。而是，风流却不下流，魅力与风度兼备的“坏”，是让女人又爱又恨又不舍的“坏”，是有情有义懂得适可而止，给女人于一种“坏坏的”感觉。最主要的是，它必定与幽默，情调，情感，性趣，浪漫密不可分。  \r\n\r\n　　张爱玲说：“**如果你不调戏女人，她会说你不是男人；如果你调戏了她，她又说你不是一个上等人**”。哈哈哈，那就宁愿先不做上等人，也要先做个男人，哪怕是个“坏”男人。也正因为此，所以男人坏不坏并非关键，而是你能否在“坏”的时候，为女人制造一个她特别爱听的，并且不失为有道德的和素养借口，以一种特别绅士的风度把女人撩得心花怒放。  \r\n\r\n　　不瞒大家说，我曾经做过这样一个梦。  \r\n\r\n　　一个恬静的午后，一间典雅复古的咖啡馆，一个靠近窗户的位置，一位漂亮的姑娘从桌前经过。我以她能恰好听得清的声音叫住她：嘿，你钱掉了！她甩发回头，看了看我：那钱不是我掉的！我不慌不忙：你可以不认它，但钱肯定是你的，因为我亲眼看见它从你口袋里掉出来的！她有些慌乱，但依旧辩解：我身上都没有口袋，钱都放在包里的！我继续不慌不忙：我可不想私吞这样的意外之财。要不这样，你刚喝的是蓝山，我虽的也是蓝山。不如咱们就共用这一百元续杯蓝山，如何？然后她咬了咬嘴唇，从我的对面坐下。  \r\n\r\n　　醒来后，我把梦讲给了我家太太听。太太听后狠批我一顿：你这分明是，在现实生活中不敢坏，只能到梦里坏一把。\r\n\r\n<div name='imgcard' style='width:400px;height:316px;background-image:url(data/imgs/category/love03.jpg);box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-moz-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-webkit-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);margin:20px auto;background-size: contain;border-radius:5px;'></div>\r\n\r\n　　是的，我承认，其实每个男人都想做一个让女人欲拒还迎的坏男人。但为什么坏男人却往往可以“得逞”呢？蔚蓝认为，这必定和女人的喜好有关。女人大都喜欢不受伤害的，被人“惯着”和“宠着”。而懂得分寸，能拿捏得当，甚至有点脸皮厚的“坏男人”，却恰恰更容易做到这一点。他不仅能保留“大男人”的荷尔蒙形象，还总能给女人于出其不意的温暖。  \r\n\r\n　　有太多的事实告诉我们，这类在日常生活中，不坏却性感，还略带痞性的男人，往往更容易给女人于无限美好，他不但会偶尔会在女人面前露怯露短，激发女人的母性成就感，而且还会在女人最无助的时侯瞬间长大，成熟得令你惊叹。总之，若是和这样坏得恰到好处的男人在一起，女人终极一生都会有一个大大的“奢普来”，他会让女人想亲想咬想喊，会让女人身上的每个细胞，总会不断地在母性情怀和小女人之间自由转换，他对女人的杀伤力，甚至会让女人自己都惊奇到无法想象。  \r\n\r\n　　不过，男人的此种“坏”却是需要天性的，他们虽然能用活力、热情和睿智点燃世界，但更多的时候，我们却往往需要，更多务实有担当的好男人去稳定这个世界。  \r\n\r\n　　所以，蔚蓝需要奉劝的是：没有一点天性，或者情商并不高的男人，最好不要随便淌这趟“坏”浑水。否则，“坏”起来了，女人却不认账，甚至把假坏变成了真坏，那就的确有辱于男人身份。\r\n\r\n<div name='imgcard' style='width:544px;height:337px;background-image:url(data/imgs/category/love02.jpg);box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-moz-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);-webkit-box-shadow: 2px 2px 8px rgba(0, 0, 0, 0.5);margin:20px auto;background-size: contain;border-radius:5px;'></div>\r\n\r\n　　不过没关系，既然做不好“坏”男人，咱们就老老实实做个好男人吧！其实，在我们现实生活中，那种有内涵和实力，有责任有担当，既能胸怀宽广于世界，又能心思细腻于自己女人的男人，往往更值得女人交付终身。  \r\n\r\n　　因为在两性的世界里，女人追求所谓的感觉，永远都抵不过真心实意的好更实在。平凡生活里真正的好男人，那份骨子里散发出来的沉着魅力，以及沉稳干练的生活作风，往往更能带给女人于一种来自灵魂深处的安宁，这份安宁是任何状态和“奢普来”都无法比拟的。  \r\n\r\n　　所以，同理，对于女人来说，驾驭“坏”男人对自己是有更高要求的。既然无法同时拥有“坏”男人的巧好情趣，和好男人的心安，那就不如充分发挥自己的灵性之美，做一个既能辨真假李逵，又能看破不点破，既能温柔贤淑，又会“色胆包天”的女子吧！只要你愿意，你便可逗得他在好与坏中自由转换，哪怕他坏得三不像，哪怕他好得不那得勇敢，但你都能找到一个最佳欣赏他的角度。  "
}
