{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1570313405_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": 1,
		"1574206496_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"1575012427_1PTUiAbYfoN76QFKvwtu818EWaT9AwbYvd": 1,
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1
	},
	"next_comment_id": 63,
	"comment": {
		"1572647527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "1) There is no such thing as \"racism.\"\n2) Anti-\"racism\" is just a codeword for anti-white.\n3) The Rothschilds run the world. The Rothschilds are Jews. Jews enjoy superior status everywhere they are, hate goyim, and have a literal supremacist religion.\n4) They are making it illegal to oppose them in any way. They may also elect to just have someone assassinated who they dislike.\n5) Your government (wherever you are) will cover it up because your government is owned by them.\n6) If your government was better, your leader will be attacked and defamed, like Hitler, Gaddafi, Saddam, or anyone else.\n\nI highly suggest you figure things out, because it may already be too late for your kind (NPCs). Politics is irrelevant if your people die, and White people don't know their history. White people have also been victims of nonwhite crime and called a ray ciss for even trying to talk about it. No one with a brain is going to listen or care about the plight of some other group when everyone else is out to get you.\n\nWhen Whites are FREE of this BS, then let us know. Until then, the squabblings of morons who believe in WAYCISM are irrelevant. Any sane person sees all of you as criminals for being complicit anyway.",
				"added": 1572655955
			},
			{
				"comment_id": 16,
				"body": "@styromaniac\nI don't care. The Rottenchilds control world banking and are a major threat and control that belief system. Most of them believe in the holohoax and will actually harm you based on that belief. The idea that protecting your own is hatred is simplistic and does not secure the existence of your people. I don't care what PC Party X believes. Using their terms and discussing their points will prevent you from ever developing other views.\n\nYou can't negotiate with someone at war with you.",
				"added": 1572659970
			}
		],
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "There is no such thing as an \"incel\" or any other dumb term made up recently.",
				"added": 1572656059
			}
		],
		"1570935984_149NKX715zpvjyRaoR7ZdVKMDQ9BQ7kj5s": [
			{
				"comment_id": 3,
				"body": "The first thing to do would be to end the retarded throwing everyone together in the same country experiment. You can't trust people who are nothing like you. Second would come a cleanup of government. Everyone knows that Africans have an insanely high crime rate and that cops cannot be extensively trained because it's too expensive. You can't have a first world country with a third world population.\nIt will never happen\n.com\n.org",
				"added": 1572656295
			}
		],
		"1570659602_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 4,
				"body": "I'm not even going to read Le BBC, but I'm guessing\n>it certainly WASN'T us merchants, goy\nKek",
				"added": 1572656474
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 5,
				"body": "I have never heard a single decent argument for such nihilistic beliefs. Folkish Paganism is superior and the only way to go. PC religions are a joke. The correct move wasn't to give up because you didn't find meaning at Wal-Mart.",
				"added": 1572656563
			}
		],
		"1570831985_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 6,
				"body": "One great future line of work on a moon base will be to put an energy beam station on it and push retrograde on some of these out of service sats to get them to fall out of orbit. I suppose you could do it in deep space, too. There may be more reasons to go with one or the other.> [myriri](#comment_66_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): Reply\n⋮\n\nOne great future line of work on a moon base will be to put an energy beam station on it and push retrograde on some of these out of service sats to get them to fall out of orbit. I suppose you could do it in deep space, too. There may be more reasons to go with one or the other. Either way, we are going to need to build infrastructure in space or die here like the dinosaurs.",
				"added": 1572656790
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 7,
				"body": ">gommunism\nNatSoc is superior. Also, P2P is now /pol/. You're welcome.",
				"added": 1572656959
			}
		],
		"1570425422_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 8,
				"body": "Anyone who really cares would need to break the law over the network in a significant way after they connected to some network in public and just have the place watched and catalog who goes in and out and preferably bug the whole place.\n\nI don't know why people even bother asking questions like this. I mean, if you didn't already think of that, just cuff yourself and walk on in there LOL.",
				"added": 1572657086
			}
		],
		"1570313405_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 9,
				"body": "All hues should experience localized nuking, no matter how hue they are, what hue of hue they are, and no matter their IQ, height, money, etc.",
				"added": 1572657161
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Vaping, like Trump, were purely memes to piss off dumb people. I say we won on both counts by getting retards to take them seriously.",
				"added": 1572657227
			},
			{
				"comment_id": 11,
				"body": "> [myriri](#comment_58_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): Vaping is retarded anyways.Theres a lot of shit coming out now about the damage it does and surprise surprise turns out its worse the regular tobacco.Ban both. Problem solved.\n\nIt would be better to make both MANDATORY and say you're RACIST if you don't do them. We need to accelerate the removal of cucks and alien apologists.",
				"added": 1572657287
			},
			{
				"comment_id": 12,
				"body": "Biden would be touching kids live at his inauguration LMAO.",
				"added": 1572659334
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 13,
				"body": ">muh waycism\nLOL. Maybe you could meet such things in your imagination, or you could actually get redpilled and see for yourself. The klan has been defunct for a long time and they were soft and let in hooknoses, so don't bother with named groups for that stuff. They purely existed to make Celtic culture and Scythian/Aryan traditions look bad.\n\nActual NatSocs are based.\n@noquat\nBecause muh heresy, goy.",
				"added": 1572659560
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 14,
				"body": ">not the jews\n>not the jews\n>not the jews\n>not the jews",
				"added": 1572659672
			}
		],
		"1570222572_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 15,
				"body": "08>mill\nfite me",
				"added": 1572659760
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 17,
				"body": "> [saintdeath](#comment_11_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U): Civilization is over\n\nThis is why you don't worship hooknoses, kids.",
				"added": 1572668297
			},
			{
				"comment_id": 21,
				"body": "Trump was a troll candidate that worked marvelously to reduce stability in the ZOG system in the US. Even though he is controlled op like everyone else, the best thing to do is to elect whomever enrages reckless militant groups like pantyfa because it polarizes (((society))) in order to help bring it down. Gommunists then become /ourusefulidiots/.",
				"added": 1573425619
			}
		],
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 18,
				"body": "I'm pretty sure they watch Gay of Thrones because of (((certain people))) who have a monopoly on mass media. But yes, pretty much. I know I certainly like to fight things. You only missed one thing: the only solution to bad hierarchy is to take control of it yourself--otherwise you can't implement the solutions you want, nor will those solutions have a proper air of finality to them.",
				"added": 1573419012
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 19,
				"body": "Well, yeah, they'll try to talk you out of it. Even going on a killing spree is more sane than only offing yourself. Even if shit sucks, you're far from the only one with life problems, and obviously, it isn't worth it, even if your life DOES suck.",
				"added": 1573420751
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 20,
				"body": "If you're in Yurop, you need to be revolting, fag.",
				"added": 1573420798
			}
		],
		"1573428219_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 22,
				"body": "Christcucks in general need to get rekt. It's like those crackers haven't even realized that:\nA) They're cucks to literal juden\nB) It's not their real religion (Folkish Pagans like Odinism would be correct instead)\nC) They need to stop being house cracker traitors and actually do something besides being culturally pathetic like their OK BOOMER parents",
				"added": 1573429553
			}
		],
		"1573531510_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 23,
				"body": "Are you fags just now figuring out that kike-owned sites are six million percent tyrannical? LMAO, fucking bluepills, not even once.\n\nMarkiplier sounds like a ridiculous soycuck. I remember hearing him once for a half a second and violently closing the tab. That shit was annoying as fuck.",
				"added": 1573532994
			}
		],
		"1573491192_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 24,
				"body": "Well, yeah. It's time for normalfaggots to rise up and stop accepting PC, racemixing, faggotry, etc. Stop accepting jew subversion.",
				"added": 1573535243
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 25,
				"body": "The Rothschilds and other top kikes. They're the ones who benefit from the government that declares war on and mass murders anyone that doesn't want their bank. Oh, and Hitlah was da werst leada evah! (goy)",
				"added": 1574120828
			}
		],
		"1573960157_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 26,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1131_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Donald Trump vs Hillary Clinton? [...]\n\nYou type like a schizo kike.",
				"added": 1574121075
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": ">this faggot again\n[M]ute is our friend",
				"added": 1574121133
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 28,
				"body": "These threads are useful for two things:\n1) Bait threads keep morons out of your good threads\n2) You can find the cucks and filter them\nIt's pretty common knowledge that nogs wouldn't exist without christcucks sending them food.",
				"added": 1574121335
			}
		],
		"1574289293_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 29,
				"body": "It was always time to nuke jewgle friendo.",
				"added": 1574298692
			}
		],
		"1574206496_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 30,
				"body": "> [anonymouslogin]\nBASED",
				"added": 1574300454
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 31,
				"body": ">go to the jew controlled op site\nSure thing goy",
				"added": 1574301425
			}
		],
		"1575818739_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 32,
				"body": "But we can haz turrism breads tho...",
				"added": 1575838058
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 33,
				"body": "You have a point. There is a real issue where hooknoses will spam muh porn to stifle freedom of speech by trying to trick the goyim into reaching for their dicks. Also, (((gabbai))) is controlled opposition anyway. If you posted on it, you're probably on a kill list.",
				"added": 1575838439
			}
		],
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 34,
				"body": "You generally don't want to attract glowniggers to begin with. From the military, I will tell you that the best reaction to interrogators is no reaction. It's better if they can't find you to begin with, since their orgs are dangerous, connected, well-supplied, and they can cover their own ass in illegal activity, meanwhile you are probably just some guy.\n\nI do think shitposting is a relatively decent way to combat glowniggers though. Anons are the real heros, not careerists with Le Badge.",
				"added": 1575838744
			}
		],
		"1575419519_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 35,
				"body": "I'm not reading a wall of literal fag propaganda.",
				"added": 1575838819
			}
		],
		"1575012427_1PTUiAbYfoN76QFKvwtu818EWaT9AwbYvd": [
			{
				"comment_id": 36,
				"body": "[harmonic intro]\ngas gas gas",
				"added": 1575839663
			}
		],
		"1574929776_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 37,
				"body": "I'm White, so I'm an Odinist, not a christcuck.",
				"added": 1575839708
			}
		],
		"1576294690_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 38,
				"body": "I wouldn't look for a \"partner\" because bagel merchant shekelgrabbers introduced that term purely to push faggotry, so no dice. I would only be courting for a wife, just like everyone normal since the dawn of time. I came here to get away from bluepilled BS tbh.",
				"added": 1576469968
			}
		],
		"1576291196_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 39,
				"body": "Top kek. Imagine not being NatSoc in 2019.\n>muh murica muh say-tayn muh rottenchild buy bull\nI wasn't aware that leddit, kiketube, and every other gay clearnet site connected straight to here. Who knew?",
				"added": 1576470020
			}
		],
		"1576282955_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 40,
				"body": "[gas gas gas plays]",
				"added": 1576470089
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 41,
				"body": "There is no such thing as \"satan.\" \"Satya\" is Sanskrit for Truth. Sloped foreheads didn't like it, it seems.",
				"added": 1576470097
			}
		],
		"1576327639_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 42,
				"body": "I'm guessing the based Yamato never should have stopped removing chink.",
				"added": 1576470124
			}
		],
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 43,
				"body": "The rottenchilds would definitely kill upper management to throw the goyim off the scent. +1 upboat",
				"added": 1576470198
			}
		],
		"1576471992_1Du836ay9peD2SD5M1383ApEDJh8CDYYd8": [
			{
				"comment_id": 44,
				"body": "How do I mute the nigger OP?",
				"added": 1576678392
			}
		],
		"1576287725_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 45,
				"body": "> [clearnet15bad](#comment_59_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): Go post on 8chan's pol board they like that stuff there.\n\nHateChan is dead, normalfag. There is only 08 and Mill nao.",
				"added": 1576708448
			},
			{
				"comment_id": 47,
				"body": "> [clearnet15bad]\nHateChan is dead, normalfag. There is only 08 and Mill nao.",
				"added": 1576708629
			}
		],
		"1576246850_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 46,
				"body": "Yup, now I know you're a normalfag, trying to send /pol/ your schizos. If you show up on any /pol/ and you are a schizo, you will be permabanned instantly. Please post your boomerbot leddit qnigger retardation on normalfaggot sites. On behalf of NatSoc shitposters, we don't want schizophrenic retards and the rottenchilds do.\n\nIt really makes you wonder what OP's angle is besides being an obvious kike.",
				"added": 1576708574
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 48,
				"body": "Rottenchild kikels get their power from banking and forcing everyone to bank with them. Killing their gay slope financial power is the most important thing. Getting people to trade in literally anything that isn't run by them would be the best thing. It is difficult to network, however.\n\nEvery war the jewSA fought since the \"civil\" war of northern aggression and genocide was based around kike banking.",
				"added": 1576725531
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 49,
				"body": "The holohoax is complete BS. There is no way that something people are required to believe in by dictatorial governments would ever be true. Truth needs no defense. It certainly doesn't need Orwellian shock troops going around and arresting goyim for wrongthink. The only thing that copes harder than that is the multiposting /leftypol/ fag ITT.",
				"added": 1577079941
			}
		],
		"1576761563_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 50,
				"body": "There is no such thing as intrinsic value. Money should be destroyed. That is the only thing that would really stop the rottenchilds.",
				"added": 1577082315
			}
		],
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 51,
				"body": "> [frosthammer](#comment_21_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): The video literally says that the ban didn't happen.  [...]\n\nThey're dissenting against the filthy goy commoners that dare question their R0thschild kikel overlords, that's what. How dare you filthy goyim try to run your own countries? Also, advice for bluepills and those who are new: the \"alt-right\" is a shill movement to try to get out in front of an organic reaction. It's an old technique of the juden. \"The best way to control the opposition is to lead it,\" as they say. As for the censorship, \"fortunes, like mushrooms, grow best in the dark.\"\n\nAnd yes, if NatSocs weren't 100% right and threatening to global bank slavery under one ethnic group that gets to exploit everyone else, then they wouldn't be banned and shilled against so hard. The NS platform's subtitle is \"For The Abolition of Interest Slavery.\" I'll guarantee you cuccboiis never heard that shit in an institution, and you never ever will. Truth is threatening to the System.\n\nAlso worthy of note is that EVERY public face is sold out. Do not believe in shit based on what people look like or what they claim. If you don't come to an agreement with the masonjew order, you will be shadowbanned, throttled, and have results pushed down to no end. I know people who are legitimate and try to speak out, and they are so totally suppressed that hardly anyone has heard of any of them, despite spending their WHOLE LIVES working to get messages out.\n\nZERO free speech or press freedom is how they are. If you're a dissident and you start talking to e-celebs innocently, you can get yourself killed, and almost certainly on an immediate kill list. Do NOT trust namefags under any circumstances. The System is run by the same people that ran the USSR, and they will do a purge again. Be careful and try to get every clueless dimwit you can on such lists and avoid them yourself. I think it's the only chance we've got for anything.",
				"added": 1577934394
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 52,
				"body": ">muh bigotry\nLel, you fools have no idea of what anything means, nor the finer points of shitposting for freedom of thought. The danker the net, the danker the ideas need to be. Agreeing with governments and billionaires is not revolutionary, and \"geek\" culture was a way for juden to steal nerdery from Whites and rebrand it into politically correct stupidity.\n\nAnyone who doesn't see the point in REBELLING against PC is a lost cause.",
				"added": 1577939059
			}
		],
		"1577932335_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 53,
				"body": "How about avoid getting red flagged then, smart guy?",
				"added": 1577947831
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 54,
				"body": "Terrible advice ITT. Do not talk to the police ever.",
				"added": 1578011799
			}
		],
		"1577743477_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": [
			{
				"comment_id": 55,
				"body": "Daily reminder that Red Ice is a shill group that deplatformed Seana Fenner, the Odinia lady, who is actually qualified to talk about European religion. They have an agreement with the same shady criminal groups that run the lamestream media and are gatekeepers, controlled opposition, etc. They have put up stupid disinfo about the Yule being disgusting and advocated things like drug use for White people. They are classic disinfo, just like those juden decades ago that advocated White Supreeemism openly so they could then rail against it for decades.\n\nThey are always abusing our people. Do NOT help promote these Gods-damned shills or get involved with them in any way. Authentic people who are named are NOT ALLOWED to have platforms. Get it into your heads for your own safety, people.",
				"added": 1578014464
			}
		],
		"1577670809_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv": [
			{
				"comment_id": 56,
				"body": "If anything, there needs to be moar dead christcucks, preferably along the lines of what they did to real European people.",
				"added": 1578014689
			}
		],
		"1577653744_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 57,
				"body": "Double tap that subscribe button, lads!",
				"added": 1578014740
			}
		],
		"1578079566_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 58,
				"body": ">global warming\n>real\n>anything that zealots shriek \"DENIERS\" at anyone who questions their dogma\n>reeeel\n\nM8, I think you get the point. But yes, it is silly to fear some violence. Our biggest problems right now are governments run by cults and retards that think they should have a monopoly on violence when it is the most efficient way to solve problems and built every one of their hypocritical regimes. Use of force is particularly necessary to get rid of idiots and social problems, as well as to maintain the health and order of civilization. This does not mean that every use of force is extreme--indeed, most need not be extreme at all.\n\nAs for the JewSA trying to spread rottenchild ZOG rule over the planet like a cancer, hopefully they are completely broken by the conflict. It will be the duty of anyone living in \"the west\" to ensure that it does not prevail because it is the mechanism of global enslavement.",
				"added": 1578084025
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 59,
				"body": "> [fib](#comment_42_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Americans are the terrorists.There's nothing I can do to stop this.I'm a prisoner of war in my homeland.Our economy is murder.\n\nSomehow you are literally over 100% correct. I am impressed. (((Who))) runs it though?",
				"added": 1578084105
			}
		],
		"1579524634_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 60,
				"body": "It makes no sense, like everything else those creatures have put in place, which is why they were being criticized in the first place.",
				"added": 1579532210
			}
		],
		"1579430150_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 61,
				"body": "Cuck island had to prepare to genocide their own people so the rottenchild bank would be safe. I'm surprised no one over there has contained and built a nuke properly. It would be deserved to the nth degree.",
				"added": 1579532317
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "JewTube is beyond censored and terrible now too.",
				"added": 1579532343
			}
		]
	},
	"comment_vote": {
		"3_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"5_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"11_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"11_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"4_1CAq9Lor26iBmSMSQpXiBJUL6b6Y5WU8UA": 1,
		"4_1CCP6W73N9r9WwjRUvz3yJ9X7zeY5tStFE": 1,
		"23_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"18_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"1278_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"25_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"72_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"99_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"141_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"33_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"462_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"51_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"23_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"21_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"52_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"55_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"56_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"42_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1
	}
}