{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1565466571,
			"title": "Oprah voice: YOU GET A ROM! AND YOU GET A ROM! EVERYBODY GETS A ROM!",
			"body": "1903 ATARI ROMS http://20mm.net/e-000000/000000.zip\n308 SEGA MASTER SYSTEM ROMS http://20mm.net/e-000000/000001.zip\n646 NES ROMS http://20mm.net/e-000000/000002.zip\n163 GBA ROMS http://20mm.net/e-000000/000003.zip\n835 SNES ROMS http://20mm.net/e-000000/000004.zip",
			"added": 1565466570
		},
		{
			"topic_id": 1565577175,
			"title": "Who do I email to get my verified tag?",
			"body": "Hello all, I am a verified poster on twitter and I would like to have the same privileges here so that I can avoid listening to the rabble and lord my status over the peasantry. Please let me know who to email to receive the status appropriate to my station.",
			"added": 1565577173
		},
		{
			"topic_id": 1565586623,
			"title": "Cuckery most foul!",
			"body": "https://twitter.com/Race_Imboden/status/1159988039902466049",
			"added": 1565586620
		},
		{
			"topic_id": 1566216762,
			"title": "FEATURE REQUEST",
			"body": "Can we get a button to order posts in chronological order?",
			"added": 1566216758
		}
	],
	"topic_vote": {
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": 1,
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 1,
				"body": "> [brianhanson2nd](#comment_31_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): YES!!! We finally have the minecraft nine year olds coming to zeronet. [...]\n\nI mean if it's not realistic, wtf is the point you boomer?\n\nI would only ever mine 6 miles into the earth in the most realistic way possible, just like I do in real life.",
				"added": 1565464246
			},
			{
				"comment_id": 4,
				"body": "> [ayylmaolol](#comment_24_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): I will do that too, but just for testing. And then catch on legitimately when i figured out why they commit suicide.\n\nDolphin eggs? Now that's realism baby.",
				"added": 1565466473
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "7000 ATARI ROMS http://20mm.net/e-000000/000000.zip",
				"added": 1565464865
			},
			{
				"comment_id": 3,
				"body": "1903 ATARI ROMS http://20mm.net/e-000000/000000.zip\n308 SEGA MASTER SYSTEM ROMS http://20mm.net/e-000000/000001.zip\n646 NES ROMS http://20mm.net/e-000000/000002.zip\n163 GBA ROMS http://20mm.net/e-000000/000003.zip\n835 SNES ROMS http://20mm.net/e-000000/000004.zip\n\nStaying up for today only! g0g0g0!",
				"added": 1565465413
			},
			{
				"comment_id": 9,
				"body": "> [niggerman69](#comment_1_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM): Am i allowed to say [A TERRIBLE WORD]?\n\nGASP!",
				"added": 1565577227
			},
			{
				"comment_id": 14,
				"body": "> [joalmo](#comment_3_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL): 4chan is down... the great shoah has begun\n\nDoes this mean you filthy weebs are going to invade zeronet now? Is this the end of us?",
				"added": 1565582555
			}
		],
		"1565466571_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 5,
				"body": "> [ayra](#comment_2_15Pwu5qSwuLDbQeJPixgirchJGHcHw4ioT): ROM files hosted inside a weird folder structure on a GoDaddy server that advertises a camera lens. Why do I get the feeling that the owner of this website has no idea that the files are there.\n\nYeah, I thought that was unfortunate too, bad php maybe? Great looking camera lens though.",
				"added": 1565468396
			},
			{
				"comment_id": 6,
				"body": "> [trevorlaneray](#comment_41_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Mmm. Good point. Though I don't know enough about ZeroNet yet to dispute that the button actually exposes real addresses of tor-only users.I'm just weirded out by the relative disparity with most popular packs of ROMs; so many of the most popular ROMs aren't included...Just doesn't feel right... ^u^\n\nHey can we uuencode shit here? Can you post the popular pokemon ones?",
				"added": 1565480140
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 7,
				"body": "> But still, ZeroNet has a very confusing \"account/id\" system\n\nThis is by design anon. There needs to be a small barrier to entry to keep dumb normies out. Communities are better if everyone in them can at least manage to clear at least a little technical hurdle.\n\nThe reason it can use any browser is that it runs very much the same as any bittorrent system does, you are simply connecting to the node that you are running locally. I'm not sure how exactly to run this through the actual TOR browser, but it's no big deal for me particularly.",
				"added": 1565571402
			},
			{
				"comment_id": 8,
				"body": "> [joalmo](#comment_2_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL): Boomerposting has already made it to ZeroNet?\n\nlol, I know right? This is great news.",
				"added": 1565571415
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 10,
				"body": "lol, holy smokes, I posted that strictly tongue in cheek fellows, I was lightly trolling all of you, I expected a storm of \"get f*****d\" comments, apparently I severely misjudged the character of this place. I mean, you guys started the flaming well enough until @trevorlaneray arrived and civility and productive conversation broke out. For the record: I don't want a \"verified\" check, it is the mark of lower intelligence and high aggression over on Twatter and I'll be a monkey's uncle if I get one here...",
				"added": 1565581568
			},
			{
				"comment_id": 11,
				"body": "> [billclay](#comment_1_1QF12w6Tq7BEQhrcvQ9nCPWqGsi5rZjCwP): I almost killed John McClane. If anyone deserves to be verified, it's me.\n\nHans? Hans Gruber is that you?",
				"added": 1565581587
			},
			{
				"comment_id": 12,
				"body": "> [nickwa](#comment_337_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I think you missed the troll bait.\n\nAw, why you gotta go and spoil it man! :D",
				"added": 1565581618
			},
			{
				"comment_id": 13,
				"body": "> [tumbleweed](#comment_3_1HSJXS26WAFxab3etLidavpj5zki3bC1Pm): See, we're the helpful type. Now you can go fuck off..😀\n\nThere we go, that's more like it.",
				"added": 1565581886
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 15,
				"body": "It might be a poor strategic move for the left and big tech to cause everyone to move to zeronet before the 2020 election. They're lucky this doesn't run on phones...",
				"added": 1565583131
			},
			{
				"comment_id": 16,
				"body": "> [memesadler](#comment_31_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Nazis are the real socialists.\n\nReals are the socialist nazis.",
				"added": 1565583173
			},
			{
				"comment_id": 18,
				"body": "> [edgelordofdecent](#comment_48_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It does. I am connecting on my SamSung right now.\n\nWell, they better get ready for 4 more years of racist orangeman then...\n\nAnd your phone is not having its battery drained or data blown through for this app? Seems to me like it would be not-ideal to have zeronet run on the background on these devices.",
				"added": 1565585825
			},
			{
				"comment_id": 19,
				"body": "> [usr0](#comment_2_1A66iTtvyEopuCML2LGYZMN56dUf9ppLYY): Dilate\n\nDilate?",
				"added": 1565585941
			},
			{
				"comment_id": 23,
				"body": "> [dfgdsfgertyrety4](#comment_4_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP): They are welcome to come back, as long as I can ram a Trump 2020 dildo up their ass.\n\nHow would you even know who they are, anyone here might be a journalist just looking around.",
				"added": 1565589989
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 17,
				"body": "Day is over, nothing happened. OP tagged as \"NOSTRADUMBASS\".",
				"added": 1565583650
			},
			{
				"comment_id": 21,
				"body": "> [edgelordofdecent](#comment_47_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Gg, so this information came from watching the simpsons and cherry picking numbers?\n\nPicked lint out of belly button all day for this information.",
				"added": 1565586670
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 20,
				"body": "lol, 4chan is up. 201908121259 EST.",
				"added": 1565586006
			}
		],
		"1565586623_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 22,
				"body": "> [tempofunktron](#comment_3_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81): I mean, America IS a shithole\n\nYes, but he should at least *pretend* goddamit, you gotta fake it till you make it.",
				"added": 1565589628
			}
		],
		"1569840447_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 24,
				"body": "It kinda fucking blows. I thought I would be an awesome replicant hunter or at least a cool replicant, but it turns out the fate of most of us is to be the grimy chinese guy serving noodles to other Morlocks and Epsilons just muddling through while they wait to die. It's fucking shitty tbh. We need a civil war in North America to spice things up.",
				"added": 1569891103
			}
		],
		"1571339336_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": [
			{
				"comment_id": 25,
				"body": "> [latser](#comment_1_1C9SF8vbHqBVYVnqB7zzqZuNjuvXiUVUBv): That \"fbclid\" (?fbclid=IwAR0xXQ9WLHSXl6us4a_qXhcqhtMq74ikd1C2otIJye8RRhJlQbDVX74OP1g) segment is a good way to track down who exactly you are, OP.\n\nI was wondering about that myself, what a fucking boomer.",
				"added": 1571385049
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 26,
				"body": "My default is xubuntu for all around use. Windows for gaming. Ubuntu for servers. Alpine for containers.",
				"added": 1610379531
			},
			{
				"comment_id": 27,
				"body": "> [mfs](#comment_79_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): MacOS but I use Dissenter browser which means I'm not a complete idiot.\n\nhue hue dissenter. Also, no shame in using MacOS, that just BSD behind the pretty there.",
				"added": 1610379871
			}
		],
		"1610369492_1uRiXAhYBVhxWPxZuFH8zDssbSapKHVcW": [
			{
				"comment_id": 28,
				"body": "> [styromaniac](#comment_2859_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No proof of any of this.\n\nThat being said, the military is overwhelmingly for Trump. The establishment is shitting itself.",
				"added": 1610383525
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 29,
				"body": "> [barbados](#comment_10_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): keep shooting up your copium, MAGAt\n\nlol, please please let him do a coup. Please.",
				"added": 1610383945
			},
			{
				"comment_id": 30,
				"body": "> [goodusername](#comment_20_112NAM5jhYWH4egafracJEF92oyeUY3F3T): can you present some evidence that he won?\n\nI don't think there is any evidence he won, but only because off a mountain of circumstantial, statistical, historical, and not-quite-certain evidence that the election was ballot stuffed. So we just have to live with Biden until he croaks, then it's boogaloo time.\n\nDominion machines were blanked before their code could be audited.\n\nBiden lost 16 / 17 bellwhether counties.\n\nAnyway, I think the US needs civil war.",
				"added": 1610384488
			}
		],
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": [
			{
				"comment_id": 31,
				"body": "+1 for this.\nI am looking right now to move all my shit from Godaddy to servers in Russia. If my servers are in russia, they can't do shit. Anyone tells me to take anything down, I can send them a nice letter explaining where to go to fuck themselves.",
				"added": 1610658083
			}
		],
		"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 32,
				"body": "This was expected though, we knew this was coming. Esp. after they got all organs of government.",
				"added": 1611234665
			}
		],
		"1611199036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 33,
				"body": "> [sirlotaplot](#comment_40_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): You can also delete your posts to get more\n\nYou really shouldn't though. Just post normally, the system will take care of the rest. Trust The Plan.",
				"added": 1611235025
			}
		],
		"1617975007_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 34,
				"body": "COMPLETE ARTICLE FOLLOWS:\n\nCan Blood from Young People Slow Aging? Silicon Valley Has Bet Billions It Will\n\nBY ADAM PIORE ON 04/07/21 AT 10:55 AM EDT\n\nThe Spanish firm Grifols helped set off a kerfuffle last year when it, along with other firms, offered nearly double the going price for blood donations for a COVID-19 treatment trial. Brigham Young University in Idaho had to threaten some enterprising students with suspension to keep them from intentionally trying to contract COVID-19. The trial failed, however, and now the Barcelona-based firm is hoping to extract something far more valuable from the plasma of young volunteers: a set of microscopic molecules that could reverse the process of aging itself.\n\nEarlier this year, Grifols closed on a $146 million-deal to buy Alkahest, a company founded by Stanford University neuroscientist Tony Wyss-Coray, who, along with Saul Villeda, revealed in scientific papers published in 2011 and 2014 that the blood from young mice had seemingly miraculous restorative effects on the brains of elderly mice. The discovery adds to a hot area of inquiry called geroscience that \"seeks to understand molecular and cellular mechanisms that make aging a major risk factor and driver of common chronic conditions and diseases of older adulthood,\" according to the National Institutes of Health. In the last six years, Alkahest has identified more than 8,000 proteins in the blood that show potential promise as therapies. Its efforts and those of Grifols have resulted in at least six phase 2 trials completed or underway to treat a wide range of age-related diseases, including Alzheimer's and Parkinson's.\n\nAlkahest and a growing number of other geroscience health startups signal a change in thinking about some of the most intractable diseases facing humankind. Rather than focusing solely on the etiology of individual diseases like heart disease, cancer, Alzheimer's and arthritis—or, for that matter, COVID-19—geroscientists are trying to understand how these diseases relate to the single largest risk factor of all: human aging. Their goal is to hack the process of aging itself and, in the process, delay or stave off the onset of many of the diseases most associated with growing old.\n\nThe idea that aging and illness go hand and hand is, of course, nothing new. What's new is the newfound confidence of scientists that \"aging\" can be measured, reverse-engineered and controlled.\n\nUntil recently, \"people working on diseases did not think that aging was modifiable,\" says Felipe Sierra, who recently retired as director of the Division of Aging Biology at the National Institute on Aging, a part of the NIH. \"That is actually what many medical books say: The main risk factor for cardiovascular disease is aging, but we cannot change aging so let's talk about cholesterol and obesity. For Alzheimer's, aging is the main risk factor—but let's talk about the buildup in the brain of beta-amyloid proteins. Now that is beginning to change.\"\n\nThe result is a flood of investment money, an explosion of research into what precisely goes wrong in our bodies as we get old and the promise of clinical results down the road.\n\nIn the months before the pandemic, investors ponied up billions of dollars to fund biotechs aimed at commercializing the new science. Some biotech firms are developing drugs and infusions designed to clean up zombie-like cells and metabolic junk that accumulate with age. Others hope to infuse new vigor into flagging cellular components, such as stem cells, or spur the body into beneficial actions by adding obscure hormones or proteins, that decrease as we get older. The NIA, under its director, Richard Hodes, recently announced plans to spend about $100 million over the next five years on basic research aimed at understanding \"cellular senescence.\"\n\n\"You have no idea how many people are interested to investing money in longevity,\" said Nir Barzilai, the founding director of the Institute for Aging Research at Albert Einstein College of Medicine of Yeshiva University, and the founder of a company aimed at mitochondrial health. \"There are billions of dollars.\"\n\nAlthough the vast majority of these efforts remain in preclinical development, several have recently entered FDA trials and could potentially hit the market in a few years. Some are already appearing on the gray market, raising concerns that hucksters are peddling anti-aging snake oil. Others, meanwhile, worry what might happen if these drugs actually do deliver on their promise: Will poor young people be coerced into selling their blood to elderly billionaires? Will magical anti-aging pills become the province of the Park Avenue and Hollywood rich, like facelifts, hair plugs and botox injections? Will the rest of us senile peasants be forced to watch them age backwards as we are left to wither and die?\n\nHacking Old Age\nGetting old usually doesn't end well. Despite massive gains in human life expectancy—over the last 150 years, it has almost doubled in many developed nations, though it dipped in the past year due to the pandemic—we still haven't found a way to halt the relentless toll time takes on our bodies.\n\nWhen we grow old, our immune systems begin to break down, creating a state of low-level inflammation that suppresses cellular regeneration and leads to those aches and pains. We may be living longer, but we are hurting. As our mitochondria cease to effectively produce energy for our cells, we spend many of those hard-won extra years taking afternoon naps. As our stem cells grow lethargic and quiescent, our muscle mass shrinks and our bones become increasingly fragile. In short, our bodies fall apart.\n\nThe first hint that hacking the biology of aging might be possible came, improbably enough, from a series of laboratory experiments on a lowly species of roundworm. In the late 1980s and early 1990s, studies of identical twins had already shown that about 30 percent of longevity in humans could be attributed to genetics. But most scientists believed the process of aging was far too complex a phenomenon to modulate simply by tweaking a couple genes or taking a pill.\n\nThen in 1993, Cynthia Kenyon, a biologist at the University of California in San Francisco, doubled the lifespan of a worm from three weeks to six by mutating a single gene. The work suggested the possibility of drugs that could increase longevity without targeting specific diseases. It suggested that the process of aging itself might be manipulated.\n\nAt the time, a fringe group of longevity enthusiasts were, unknowingly, already trying to do what Kenyon did in roundworms through the practice of calorie restriction. This idea took off when gerontologist Roy Walford of UC Los Angeles doubled the lifespan of lab mice by restricting their caloric intake and then became a vocal advocate for the practice in humans. He penned a series of best-selling books in the 1980s and adopted a 1,600-calorie-a-day diet for the last 30 years of his life. Today, his emaciated acolytes can still be spotted at longevity conferences, meticulously measuring out their food during lunch breaks.\n\nEmerging science now explains why there may be something to this method of bio-hacking. In humans, insulin is the hormonal signal that cues our cells to absorb sugar and convert it to energy. Along with a closely related hormone called Insulin like-Growth Factor 1 (IGF1), insulin affects a large number of other cellular processes, including the rate of cellular division, which many believe is directly related to aging. When the insulin and IGF1 in humans or analogous compounds in worms are dialed down—because we are starving, or the genes have been tweaked—a host of cellular repair mechanisms that are normally on standby kick into high-gear.\n\nThe adaptation makes sense from the perspective of evolution. Prehistoric times consisted of long periods of scarcity punctuated by precious windows of abundance. Since there was no telling how long the good times would last, our ancestors evolved the ability to grow and build fat and muscle as quickly as possible. A feast triggered the body to release insulin and IGF1, which allowed our cells to begin absorbing glucose and spurred them to pour energy into cellular reproduction and regeneration for as long as our insulin levels remain high.\n\nWhen calories were no longer easy to come by, our bodies adjusted by lowering insulin and IGF1 levels—a cue for our cells to slow regeneration and reproduction, and instead divert energy into cellular processes most likely to facilitate our survival through cold, lean times. The human body protects cells it already has: it produces more enzymes to ensure proteins don't misfold, it ramps up the machinery designed to repair broken DNA and it breaks down cellular debris and defective cells it might otherwise ignore, scavenging for parts it can use to feed its healthier cells through the lean days. In the process, it cleans up cellular garbage that, particularly as we grow older, likely promotes low-level inflammation.\n\nCurrently there is no FDA-approved indication for drugs that target the process of aging itself. To win approval, drugs must target a specific disease. It's no coincidence that some gerontologists have chosen the popular diabetes drug metformin to serve as the \"template\" for a new class of FDA-approved anti-aging drugs. It works by influencing the body's sensitivity to insulin and can have an effect on the pace of metabolism and energy expenditure. If studies now underway confirm its efficacy and it wins approval, it would create an entirely new regulatory category of drugs that, rather than treating specific diseases, will work to prevent our bodies from deteriorating further once we have already developed one.\n\n\"Aging drives disease,\" says Albert Einstein's Barzilai, who is leading the study. \"That's our point. If we stop aging, it stops driving the diseases.\"\n\nA whole host of other potential anti-aging-drugs might not be far behind. Molecular biologists discovered a second important way to manipulate the aging process in the early 2000s by breeding strains of baker's yeast, fruit flies and worms to live longer. They sequenced the genomes of the hardiest strains and then worked backward to identify the specific genetic variants that seemed be associated with increased longevity. That led them to mTOR, a genetic variant that serves as the target of an anti-aging drug called rapamycin, which is now undergoing clinical trials. Among these scientific efforts is a massive longitudinal study of canine aging at the University of Washington, which has enrolled 30,000 dogs and plans to select 500 lucky pooches to participate in a rapamycin trial.\n\nThe hunt for other \"control knobs\" that might be targeted with drugs continues at research institutions around the world. A third approach would increase the production an enzyme called AMP-Kinase, which modulates cellular processes like growth and metabolism, based on the level of energy available for consumption. It, too, has emerged in recent years as another promising target, along with many other molecules, hormones and proteins that appear to decline with age and that play a key role in cellular repair, regeneration, protection and efficient function.\n\nVera Gorbunova, co-director of the Rochester Aging Research Center at the University of Rochester, and her colleagues compared 18 rodent species, including, beavers, hamsters and mice, sorted them by longevity, and looked for interesting patterns. Significantly, they found that \"more robust\" repair of broken DNA, the molecular-level cellular blueprints found in every one of our cells, seems to coevolve with longevity. In other words, species that live longer have a more robust ability to fix the kind of problems that inevitably occur with age. The research was recently published in the journal Cell.\n\n\"There was a very strong correlation to how long different species live and how well they repaired DNA breaks,\" Gorbunova said. \"We also look at why it's better. We found a protein that is very important in DNA repair and it is more active in long-lived species.\"\n\nGorbunova has done some of her most exciting work on an obscure superstar in the longevity field known as the naked mole rat, a furless, wrinkled rodent with a pair of beaver-like incisors that lives in tunnels in East Africa. The rat, sometimes referred to by its cuddly nickname, \"Sand Puppy,\" has an unusually long-life expectancy—30 years, 10 times longer than its close cousin, the North American field mouse, which rarely makes it past three.\n\nGorbunova traces much of the hardiness of the mole rats to an abundance of hyaluronic acid, a major component of skin that is involved in tissue regeneration. Although mice and humans also have hyaluronic acid, the tissues of naked mole rats are \"saturated with it,\" says Gorbunova. In addition to having strong antioxidant properties, and others that seem to attenuate the destructive consequences of the chronic, widespread inflammation that often accumulates with age, the abundance of hyaluronan also seems to prevent the growth of malignant cancer cells.\n\n\"Hyaluronan is a very nice story because we can see the possibility of translating it to humans,\" Gorbunova says. \"We have it, but we don't have a lot of it, so I think there is room for improvement. We can find ways to increase our own levels of hyaluronan.\"\n\nTo Gorbunova, the differences between the mouse and naked mole rat are easily explained by evolution—their respective adaptations are geared toward increasing their chances of reproductive success. \"For a mouse, the best strategy to have more progeny is to be very, very prolific very quickly because then somebody's going to eat it, and it just doesn't have a chance to live longer,\" she explains. \"The naked mole rat lives underground and has very few predators. And they breed until very late in life. So they would evolve the mechanism to allow them to live longer and to breathe as long as possible just because they can. No one is there to eat them. And the longer they live the more progeny they have.\"\n\nThe same logic applies to humans—and it also explains why our bodies fall apart. Diseases of aging, many gerontologists now argue, are the natural consequence of the advances in modern lifespan, which now extends decades past reproductive age, and thus has not been subject to the same exquisitely efficient evolutionary sculpting that might increase our odds of surviving them. \"If you put this work in an evolutionary perspective, we were not supposed to live that long,\" says Gerard Karsenty, who chairs the Department of Genetics and Development at Columbia University Medical Center. \"Aging is an invention of mankind. No animal species has successfully cheated its own body—cheated nature—except mankind. Elephants may live for 100 years but they lived for 100 years a million years ago. Humans have outsmarted their own body.\"\n\nBut what does any of this have to do with Wyss-Coray and Villeda's young blood?\n\nRegeneration\nSaul Villeda now runs a lab at UCSF on a hill that Over-looks San Francisco's famed Haight-Ashbury. Winding stairs lead to a fluorescent-lit basement hallway and a cramped suite of rooms stacked wall-to-wall with mouse cages. There is something unusual about many of the mice in the room. They are ambulating through their cages, with two heads, two sets of legs and double-wide bodies.\n\nThe doublewide mice are products of a macabre procedure known as \"parabiosis,\" a technique Villeda mastered as a graduate student in the lab of Wyss-Coray for the improbable experiment that led to the founding of Alkahest and the clinical blood trials aimed at treating aging. The procedure, pioneered in the 19th century by the French scientist Paul Bert, merges the circulatory systems of two rodents by cutting open their bodies and sewing their wounds together, so that their bodies fuse as they heal.\n\nTo learn it, Villeda had an expert teacher: Thomas Rando, a neurologist who studies longevity and occupies the office next door to Wyss-Coray. Rando first got the idea to revive the obscure technique back in the early 2000s. He had come to believe that one of the reasons our bodies lose their regenerative powers as we grow older is because our stem cells stop receiving the molecular-level signals needed to activate them. Rando did not know what those signals might be. But he knew where to find them—the blood of younger mice. Enter parabiosis.\n\nTo test out his hypothesis, Rando conjoined elderly mice with younger rodents so that they shared the same circulatory system, then tested their ability to heal small wounds. The results were dramatic. Elderly mice were able to repair small tears in their muscles far faster than their peers not conjoined to younger mice. The younger mice, on the other hand, healed far slower than they normally would.\n\nThe results were exhilarating. They suggested that stem cells could be revitalized simply by reintroducing back into the blood stream the molecules, present in young blood, that could turn them on. The next step was finding the specific youth-promoting factors in the blood responsible for the change. But that would not be easy.\n\n\"It's as big a fishing expedition as you can possibly imagine,\" Rando warned at the time, noting the thousands of proteins, lipids, sugars and other small molecules in the blood serum.\n\nWatching this unfold from next door, Wyss-Coray, who studied Alzheimer's Disease, and then-graduate student Villeda were dubious that they could induce a similar rejuvenation in the brain. Whatever it was in the young blood that spurred the regeneration, it seemed unlikely it would be able to pass the blood-brain barrier, the semipermeable border that keeps circulating blood, and much of the cargo it carries, from entering the central nervous system. \"But we did it anyways, because I was a graduate student at the time, and Tony will always support crazy ideas,\" Villeda recalls.\n\nAfter conjoining elderly and young mice, Villeda sacrificed the elderly mice, cut their brains into tiny slices, and stained them with a special dye that bound to baby neurons. Then he counted up the number of new neurons and compared them to normal levels of neuronal growth in similarly aged mice. The results, when he published them in 2014, shocked the scientific world. The infusion of new blood led to a threefold increase in the number of new nerve cells generated in the brains of the elderly mice. But that was not the only revelation. He had already shown that the young members of the conjoined old-young mouse pairs generated far fewer new nerve cells than young mice left to roam free, untethered to their elderly cousins. And while the old mice grew more energetic, the younger mice suddenly behaved as if they were middle-aged.\n\nSince parabiosis is not an option for human patients, Villeda and Wyss-Coray tried to pull off the same trick with a simple infusion of blood plasma. There, too, the results were better than they expected. On spatial-navigation tasks, such as finding an underwater platform to rest on in a water-filled chamber, the young mice that had received injections of \"old blood\" performed far worse than a group that got injections of plasma from younger mice. Once infused with the blood of young mice, the old-blood mice, meanwhile, were able to locate the platform as easily as their younger brethren.\n\nThe results generated worldwide headlines. And soon Wyss-Coray and his protégé Villeda began receiving many bizarre and at times macabre emails. One chilling missive came from a man who offered to provide all the blood Wyss-Coray might need for such an experiment—he claimed he could obtain it from human children of any age. There was also a flood of heartfelt pleas from Alzheimer's patients and their loved ones inquiring about human trials, desperate to stave off the ruthless march of the incurable, degenerative disease.\n\nThe query that changed Wyss-Coray's life came from the family of recently deceased Chinese billionaire Chen Din-hwa, also known as Hong Kong's \"King of Cotton Yarn,\" for the yarn-supply business he established in 1949.\n\nOn his death bed, suffering from advanced Alzheimer's disease, Din-hwa, 89, received blood plasma infusions for an unrelated medical condition. In the hours that followed, his grandson Vincent would later tell Wyss-Coray, the old man grew surprisingly alert and coherent, allowing his loved ones a few precious final moments of connection. The young blood seemed to have had a remarkably restorative effect on the old man, just as it had for Wyss-Coray's mice.\n\nAfter Din-hwa's death in 2012, Vincent, a molecular biologist from UC Berkeley, tried to explain the bizarre phenomenon. He eventually found Wyss-Coray and Villeda's first paper on the mice.\n\nThe word got to Wyss-Coray via a mutual acquaintance in the biotech industry. \"He said, 'Tony, there's this rich person in Hong Kong',\" Wyss-Coray recalls. \"'He wants to start a company. Are you interested?'\"\n\nVincent and Wyss-Coray formed Alkahest, a San Carlos-based biotech that has raised upward of $150 million from the Din-hwa family company—the Nan-Fung Group—Stanford University, the Michael J. Fox foundation and Grifols, the mammoth Spanish Blood Plasma company that would eventually buy everyone else out.\n\nThe real work of finding out precisely what it was in the blood that caused this remarkable transformation was only just beginning.\n\nAging Chemistry\nIn the years since the initial mice experiments, Villeda, Wyss-Coray and a number of independent investigators have identified an array of proteins that seem to have promising restorative effects—or, in the blood of elderly mice, detrimental effects. Both kinds could prove useful as potential drug targets. If DNA is the body's blueprint, proteins are its building materials. These essential molecules, composed of amino acids, are not only the fundamental material from which we construct bone, skin, muscle and brain cells. They are also the units used to make hormones and other molecular-level signaling agents that carry messages from one part of the body to another. With age, it seems, many of the proteins we need to function efficiently decline, while proteins that aren't good for us accumulate in inconvenient places and gum up the works.\n\nVilleda has isolated a molecule present in mice that blocks the regeneration of brain cells and promotes cognitive decline. The molecule seems to be connected to the gradual, age-related breakdown of the immune system, and when injected into the blood of younger mice, these proinflammatory molecules can impair cognition. And in May 2019, Wyss-Coray demonstrated it was possible to block the activity of another protein that accumulates with age, triggering a powerful restorative effect and vastly improving the performance of elderly mice on tests that measure memory and cognitive abilities.\n\nConversely, Villeda recently discovered a protein that promotes learning and memory in young mice. Columbia's Karsenty has identified a powerful hormone that prevents depression and enhances memory, among other things, but which seems to decline with age. In humans, the hormone drops precipitously after the age of 50.\n\nWhether Alkahest's blood fractions or any other drug will ever make it out of clinical trials remains uncertain. But it does seem likely that the first of a new class of drugs will win approval before too long.\n\nIn 2019, Alkahest presented preliminary results at a medical conference from phase II clinical trials, which are aimed at establishing initial dosing data but can also reveal insights about how and whether a drug is working in a small population of patients. The results suggested blood-plasma infusions slowed cognitive and functional decline in patients suffering from mild-to-moderate Alzheimer's Disease. Mice studies suggest the blood promotes the growth of new brain cells and reduces neuroinflammation. The company also has trials in various phases of development to treat Parkinson's, dementia and post-operative recovery, and has isolated a variety of molecules present in old blood that it plans to modulate with drugs.\n\nIn addition to Alkahest's blood fraction trials, a new class of \"anti-aging\" drugs called \"senolytics,\" which aim to clear out \"zombie-like\" senescent cells that accumulate with age, have entered trials. Senescent cells are those that have stopped dividing and secrete proinflammatory factors that suppress the normal mechanisms of cellular repair and create a toxic environment for their neighbors. The most prominent company to market that mechanism, Unity Biotech, raised more than $220 million and went public on NASDAQ in 2018. Although its drug for osteoarthritis of the knee was halted after disappointing Phase 2 trials, another senolytic drug aimed at treating age-related vision decline is currently underway; results from Phase 1 trials are expected by July.\n\nMany other drugs are in development. In the days before COVID-19 struck, scientists at 14 research institutions across the nation were recruiting 3,000 individuals between the ages of 65-79 to participate in a six-year $50 million study known as the TAME trial (for Targeting Aging with the diabetes drug metformin.) That study aims to demonstrate that metformin can delay the onset of age-related chronic diseases, such as heart disease, cancer and dementia, in those already afflicted. Barzilai, who is coordinating the study, says he and his colleagues are launching the effort not \"so we can have everybody on metformin but because we need the clinical indication approved.\"\n\nOf all the candidates, metformin has perhaps the most established track record in humans—at least in diabetics. \"The cool thing about metformin is we have had it for 60 years,\" says Barzilai. \"It's one of the safest drugs, one of the cheapest drugs.\"\n\nThe Dark Side of Long Life\n\nDespite the excitement, it's too early to celebrate. The data on whether metformin works in healthy people is not definitive. And senolytics and blood plasma fractions have yet to be tested in a large population of patients.\n\nThat probably won't stop people from capitalizing on the buzz to exploit the most vunlerable patients. Some cancer patients desperate for a cure are known to head down to Mexico or obscure tropical islands for dangerous, unproven stem cell treatments.\n\nIn 2016, a former Stanford Medical School student named Jesse Karmazin, opened up Ambrosia, a clinic in Monterey, California, offering to infuse clients with the blood of donors between the ages of 16 and 25 for $8000 a liter. In December 2018, HuffPost published an investigation claiming that the only patient who spoke publicly about Ambrosia's transfusions—treatments he hoped would help him live healthier into old age—died at 65 after going into cardiac arrest.\n\nThe FDA issued an advisory two months later warning elderly consumers that these transfusions \"should not be assumed to be safe or effective\" and consumers should be strongly discouraged from \"pursuing this therapy outside of clinical trials under appropriate institutional review board and regulatory oversight.\"\n\nBusiness Insider reported in August 2019 that Karmazin said he was shutting Ambrosia down. By November, he'd hung a new shingle, Ivy Plasma, offering \"off-label\" treatments with young blood and raising renewed alarms from public health officials and scientists. That's a \"perfect example\" of an intervention that has been shown to work in mice but has yet to be proven in humans, says Matt Kaeberlein, a Professor of Pathology at the University of Washington in Seattle.\n\nKaberlein, who has begun what he hopes will grow into a 100,000-strong longitudinal study on canine aging while also running a large study of rapamycin's effectiveness in extending the lives of elderly dogs, says there is \"a ton of money\" flowing into the field and \"a number of promising trials and interventions.\" But none has yet to clear the high bar set by the FDA: a large phase-3 clinical trial that shows evidence that patients improve significantly and that side effects do not outweigh the potential benefits. When that will happen is difficult to say: the coronavirus pandemic has disrupted trials and diverted attention to COVID-19.\n\nIf scientists are ultimately successful, hacking aging will raise troubling ethical questions, particularly when it comes to young blood. In the wake of those early papers, the popular television series Silicon Valley featured an episode in which a well-heeled dotcom billionaire had his own \"blood boy\" follow him around to provide transfusions. \"The idea that only old, rich people can afford young blood is just uncomfortable,\" Barzilai says.\n\nMost geroscientists advise against self-treatments. It would be unwise, they say, to start popping rapamycin, metformin and other largely unproven supplements on the market that promise big effects. For now, the only proven anti-aging cures remain what they have always been: regular exercise, a good night's sleep and a healthy diet.\n\nCorrection (4/7/21, 9:39 pm EDT): The first sentence was modified to make it clear that Grifols was not the only firm to offer higher than typical prices for blood donations for COVID-19 treatment trials. Also, Tony Wyss-Coray is a neuroscientist, not a neurologist as originally reported.\n\nCorrection: (4/8/21, 1:10 pm EDT): Geroscience is a general inquiry into what makes aging a risk factor and is not specific to the blood, as originally reported.",
				"added": 1618326515
			}
		]
	},
	"comment_vote": {
		"1_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"31_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"48_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"198_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1QF12w6Tq7BEQhrcvQ9nCPWqGsi5rZjCwP": 1,
		"7_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"3_1HSJXS26WAFxab3etLidavpj5zki3bC1Pm": 1,
		"62_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"3_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"54_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1_17dWdrdRfSpDHaQJ4MsGQHQHwX52nrTQWf": 1,
		"50_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"13_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"8_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1111_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"83_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1
	}
}