{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1522423626,
			"title": "What sites should I download to seed?  2tb harddrive",
			"body": "Hello, I've decided to help give back to ZeroNet by using an old hard drive of mine for a seedbox.  Are there any sites that could specifically use a new/fast peer? Perhaps lesser user ones that don't have a lot of seeds?",
			"added": 1522423625
		}
	],
	"topic_vote": {
		"1522433056_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1522601837_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "You don't need an app for most versions of android.  Go to the WiFi settings, then advanced settings.\nYou can set things like static IPs, gateways, DNS addresses, and more per connection.",
				"added": 1522681312
			}
		],
		"1523299159_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": [
			{
				"comment_id": 2,
				"body": "wifite --mac -i wlanX -e NameOfWifiToAttack\n\nThen this will save the handshake to a folder called hs.  You'll need to use Hashcat to crack this.  (You could also try with Pyrite, but its slower.) There's also Cowpatty, but it only uses your CPU, so it's thousands of times slower.\n\nHashcat has a GUI on windows as well that's helpful if you're not used to command line.  Having a fast video card will speed up the attack by a lot.  You'll also need a big password list. Probably List on Github, Skullsecurity, and CrackStation have some.\n\n\n\nYou can do it without wifite by using Aircrack.\nmacchanger -A wlanX\nairmon-ng wlanX start\nairodump-ng -w wificap wlanX\nmdk3 wlanX d\naircrack-ng wificap.cap\n\n\nFirst line spoofs your mac address. Second line start monitor mode.  Third starts capturing packets. Fourth Kicks everything around you offline so you can capture a handshake. Fifth checks if you have captured a handshake.",
				"added": 1523308275
			},
			{
				"comment_id": 3,
				"body": "> [zerohalo](#comment_2_1EEHMnfx6WywteJWp3NqVXrJCm2GEBTkAt): wifite --mac -i wlanX -e NameOfWifiToAttack [...]\n\nAlso there are WPS pin attacks with Reaver and Bully.  \nAlso PixieDust attacks with Reaver, but you'll have to get lucky for it to work.",
				"added": 1523308339
			}
		]
	},
	"comment_vote": {
		"3_1EEHMnfx6WywteJWp3NqVXrJCm2GEBTkAt": 1,
		"2_1EEHMnfx6WywteJWp3NqVXrJCm2GEBTkAt": 1
	}
}