{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Fórum Br",
			"body": "Algum fórum Br por aqui, aos moldes do 0chan?",
			"added": 1482203781
		}
	],
	"topic_vote": {
		"2_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": 1,
		"43_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	},
	"next_comment_id": 9,
	"comment": {
		"2_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": [
			{
				"comment_id": 1,
				"body": "O arquivo irá estar dentro da sua pasta pessoal no linux, e lá terá a pasta ZeroNet-master, o arquivo data/users.json fica solto na pasta. O pessoal do reddit tá aconselhando guardar esse arquivo em um pendrive encriptado, ou encriptando(sendo altamente recomendado encriptar) o arquivo com o truecript ou com o veracript e upar em alguma nuvem. Outros usuários aconselharam a guardar em mais de um lugar. Qualquer coisa to ai.",
				"added": 1469428505
			},
			{
				"comment_id": 2,
				"body": "> [ericksoares3](#comment_5_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK): Procurei (em todas as pastas do programa) e não achei esse arquivo em lugar nenhum.Pode me ajudar no negocio de abrir porta? Quero colocar um blog aqui. Já entrei nas configurações do roteador, o UpNP está aberto mas não consegui arrumar a porta que o ZeroNet pede.Tem alguma forma de colocar um arquivo \"zimaa\" na wiki daqui? É que tenho o Kiwix \"Wikipédia Off\" e gostaria de publicar aqui.\n\nVou olhar no reddit e ver se acho alguma resposta.",
				"added": 1469548227
			},
			{
				"comment_id": 3,
				"body": "Seguinte eu fiz o seguinte para publicar meu site, eu abri a porta 15441 usando o IPtables. O comando para abrir a porta foi este: iptables -I INPUT -p tcp --dport 587 -j ACCEPT\n\nEm seguida segui os passos para criação de site da própria ZeroNet:\n\n1. python zeronet.py siteCreate (Nesta etapa você salva o endereço do site e sua chave privada geradas pela ZeroNet)\n\n2. coloca o seu site dentro da pasta com o nome do endereço gerado pela ZeroNet (conforme passo acima), o local de colocar os arquivos html, css, js e demais estará na seguinte pasta 'usuário do linux/ZeroNet-master/data/endereço gerado pela ZeroNet'\n\n3. Em seguida é só assinar o site com o comando python zeronet.py siteSign, colocando o endereço do seu site afrente do comando separado por espaço, e em seguida ele irá pedir sua chave privada, pronto.\n\n4. Só acessar seu site com o endereço http://127.0.0.1:43110/ seguido pelo endereço do site gerado no passo 1.\n\nMals pela extensão da resposta mas não conheço seu nivel de conhecimento em informática. Qualquer coisa posta ae.",
				"added": 1469589137
			},
			{
				"comment_id": 4,
				"body": "> [ericksoares3](#comment_8_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK): Coloquei esse comando no terminal e deu:\"iptables v1.6.0: can't initialize iptables table `filter': Permission denied (you must be root)Perhaps iptables or your kernel needs to be upgraded.\"\n> Depois coloquei esse comando \"/usr/bin/sudo /bin/su -\" e quando deu root coloquei o do iptables novamente. Não apareceu nenhum aviso de alerta, mas mesmo depois de reiniciar o ZeroNet e o pc a porta não abriu.\n> Não tenho conhecimentos altos de informática, mas posso aprender e a ZeroNet me é muito interessante.\n\nPrimeiro de tudo roda a atualização do seu terminal: sudo apt-get update\n\nApós, copie e cole esse comando no terminal: sudo iptables -I INPUT -p tcp --dport 15441 --syn -j ACCEPT\n\nE em seguida esse: sudo iptables -I INPUT -p udp --dport 15441 -j ACCEPT\n\nEsse 15441 representa a porta que você quer abrir, esqueci de colocá-lo na última explicação. Testa os comandos acima e me diz o que deu.\n\nPra saber se a porta 15441 foi realmente aberta você tem que rodar o comando: sudo iptables -L\n\nSe aparecer esta mensagem:\n\nChain INPUT (policy ACCEPT)\ntarget     prot opt source               destination         \nACCEPT     udp  --  anywhere             anywhere             udp dpt:15441\nACCEPT     tcp  --  anywhere             anywhere             tcp dpt:15441 flag\n\nA porta foi aberta e você conseguirá publicar seu site. Lembrando que para seu site ser publicado você tem que assinar os arquivos html, css, js que você colocou na pasta ericksoares3/ZeroNet/data/seu site, com o comando:\n\npython.py siteSign e o endereço do seu site. Pra rodar este comando você tem que acessar pelo terminal a pasta do zeronet conforme o brkaka ensinou abaixo.\n\nAssim você poderá acessá-lo tanto por proxy's externos, como o proxy https://bit.no.com:43110/seu site, como pela própria zeronet pelo endereço, http://127.0.0.1:43110/seu site. Qualquer erro posta ae.",
				"added": 1469728866
			},
			{
				"comment_id": 5,
				"body": "> [ericksoares3](#comment_9_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK): Fiz o update, coloquei o comenado e foi isso:\n> erick@erick:~$ sudo iptables -I INPUT -p tcp --dport 15441 --syn -j ACCEPT\n> erick@erick:~$ -I INPUT -p udp --dport 15441 -j ACCEPT-I: comando não encontrado\n\nTem como repetir esses passos tirando print? Põe as imagens no imgur para que eu possa ver se esqueci de mencionar algo ou qual o possível motivo de estar dando erro.",
				"added": 1469904491
			}
		],
		"8_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 6,
				"body": "Algum concurseiro por aqui?",
				"added": 1482201589
			}
		],
		"38_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 7,
				"body": "Tenho usado o ProtonMail desde seu lançamento, uma ótima ferramenta.",
				"added": 1482201652
			}
		],
		"1_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh": [
			{
				"comment_id": 8,
				"body": "> [sirenyc](#comment_188_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Acredito que não =/\n\nTá precisando viu...",
				"added": 1482272830
			}
		]
	},
	"comment_vote": {
		"21_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": 1
	}
}