{
	"posts": [
		{
			"id": "b415301a-7387-4fa0-b99a-816d23c12358",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "41fae65e-1972-456c-b5f6-d64e45560986",
			"body": "Testing, give me yous",
			"time": 1565546451542,
			"files": "[]"
		},
		{
			"id": "1f6aa8cc-e35e-4169-846e-d1f0c4ef10f7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "41fae65e-1972-456c-b5f6-d64e45560986",
			"body": ">>1e23061e-2d22-42d6-9959-2cc659f1e08e\nMuch appreciated. Man, this is going to require some getting used to. Is there any news when fullchan is coming back, if ever?",
			"time": 1565546599542,
			"files": "[]"
		},
		{
			"id": "a933bd8f-cb27-4b81-bf07-897b0375c6e6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c461c664-86e1-4933-b221-861bb909957e",
			"body": ">>c461c664-86e1-4933-b221-861bb909957e\nI'm mostly \"forced\" to lurk the shithole because a lot of modders and content creators decided to make it their main hub of activity, so if you want to see how the next update for a project is going or receive some technical help, you're forced to wade through that sewer.",
			"time": 1565553600665,
			"files": "[]"
		},
		{
			"id": "6328d860-1c1a-4b9f-ac16-86060abdbe55",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39ff730b-4508-4872-a27a-905aed2718c5",
			"body": ">Why else would there be so few isekai set in fantasy nippon, fantasy Syria/Libya/Yemen/Afghanistan/Palestine and fantasy Africa?\nBecause most Nips got exposed to fantasy through Dragon Quest, which in turn inspired pretty much every other product that deals with fantasy in Japan. And Dragon Quest is a bastardization, of a bastardization, of a Western product inspired by Tolkien ported over to Japan.\n\nAS for the other cultures, nobody gives a shit about them because they have given nothing to humanity other than inbred rape gangs.\n\n>Meanwhile Koreans keep shitting out faggy \"it's an mmorpg isekai but in the real world xD also Korea has actually enslaved Japan since WW2 and is a major world power ruling from the shadows\"-tier trash\nGooks will be perpetually butthurt Nips dragged them out of the stone age. Also, you forgot how everything they write needs to have NTR.\n\n>as they can't write much about contemporary Chinkland without getting an unannounced visit from local authorities\nOh, they do write those too, but it's usually the same Wuxia chinkshit with a modern veneer with some CHINA STRONK cocksucking of the communist party thrown in so the author doesn't get v&.",
			"time": 1565554278517,
			"files": "[]"
		},
		{
			"id": "bd5ac7b3-0b6d-415a-ba51-e893bdc754ee",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "41fae65e-1972-456c-b5f6-d64e45560986",
			"body": "What does it mean when it says \"Content signing failed\"?",
			"time": 1565554364708,
			"files": "[]"
		},
		{
			"id": "794b8cc2-d647-44c4-ae93-7ad867b0b02b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "65b9878a-d66c-4733-9a09-3ff1fb5429c9",
			"body": ">>5459d2dc-a05a-4305-b2f9-85c34388ba08\nDoes it even matter who did it? They all serve the same masters.",
			"time": 1565599305916,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}