{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1550752346,
			"title": "Identity protection",
			"body": "Identity Protection on the Internet",
			"added": 1550752345,
			"parent_topic_uri": "1589138653_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1540860703_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 1,
				"body": "#A GOOGLE REGISZTRÁCIÓS SZOLGÁLTATÁSAITÓL MARADJATOK A LEHETŐ LEG TÁVOLABB!!!\n\nGmail,You Tube,és a többi GOOGLE regisztrációs szolgáltatást messze kerüljétek el! Ugyan így a facebookot!\n\nEgyénileg tudnak szórakozni veletek úgy hogy telefonszám nélkül be sem engednek. Hiába a helyreállitó E-mail és más lehetőségek! Be sem engednek mással. Teszteltünk egy bizonyos fiókot ami a látótérben van. Más fiókokkal összehasonlítva. Kimutatható hogy hatósági ráhatásra másképp működik! A helyreállító E-maillel el sem fogadja a beírt adatokat hiába helyesek! Várj 2-3 órát a kollegára. A telefonszámmal egy beállítás általuk  és eljátsszák hogy be sem tudsz nélküle lépni! Teszik az IP címre és a böngészőre egyaránt. Felhasználló név/Jelszó páros után minden esetben megállapítja hogy nem tudjuk önt azonosítani .A kétlépcsős azonosításnál szintén megerőszakolja a telefont. EGYÉRTELMŰEN KIMUTATHATÓ HOGY A GOOGLE CÉGNÉL A FIÓKRA VONATKOZÓAN JÁTSZÁK EZT EL.MINDEN KÉTSÉGET KIZÁRÓAN NEM FELHASZNÁLÓI BEÁLÍTÁSRÓL,VAGY RENDSZERHIBÁRÓL VAN SZÓ! Ugyan van benne másik lehetőség is, de akkor is a telefont minden áron el akarja érni! Nincs mód rá hogy ne próbálná kikényszeríteni vagy elérni azt! Ahogy törlőd a böngésző előzményeit és belépsz ugyan arról a böngészőről ugyan avval az IP címmel már nem ismeri fel a fiókot. Kell nekik hogy a telefon minden belépésnél jelezzen,meg hogy véletlen se töröld a böngésződ dolgait. A youtube nél még megint külön megerőszakolnak a telefonnal mert nélküle használhatatlan az egész! Az egész rendszere arra épül hogy a felhasználókat hogy lehet beazonosítani. És nem csak az amerikai de más külföldi hatóságoknak mint a magyarnak csettintésre engedelmeskedik.",
				"added": 1550752220
			}
		],
		"1550752346_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 2,
				"body": "#STAY AWAY FROM THE REGISTRATION REQUIRED SERVICES OF GOOGLE AND FACEBOOK!!!\n\nStay away from Gmail, You Tube, and other GOOGLE registration REQUIRED services! And Facebook too!\n\nThey can individually entertain you with no phone number. In vain for recovery email and other options! They won't let anyone else. We've tested a particular account in the field of view. Compared to other accounts. It can be shown that the goverment observed account it works differently!The recovery email does not accept the data you entered is in vain! Wait 1-3 hours for their colleague. With a phone number, a setting is made by them and played so that you can't go without it! They donot care the IP address and the browser. After every use of a user name / password pairs, he finds that we cannot identify you. He also rapes the phone in two-step identification. WITHOUT DOUBT CLEARLY CAN SEE THAT THE GOOGLE COPANY MAKE THIS SETUP WITH SOME OBSERVED ACCOUNTS.THIS IS NO USER SETTING ISSUE OR SYSTEM FAILURE!There is another recovery options, but you still want to get the phone at all case! There is no way you would not try to force or reach it! As you delete your browser's history and enter the same browser with the same IP address the service no longer recognize the account. You need to let the phone call,SMS every time you log in and not delete your browser history by accident. The youtube is still rape off the phone again, because without it, it is useless! The whole system is based on how users can be identified. And not only the American but other foreign authorities,Google obey the clap,and they do everything for them.",
				"added": 1550753697
			}
		]
	},
	"comment_vote": {}
}