{
	"title": "禁书联播",
	"description": "发现，分享",
	"links": "- [ZeroNet 官网](https://github.com/HelloZeroNet)",
	"next_post_id": 22,
	"demo": false,
	"modified": 1461309725,
	"post": [
		{
			"post_id": 21,
			"title": "《黄祸》17",
			"date_published": 1461309678.547,
			"body": "　　美联社中国福州10月25日电\n　　被中国政府宣布冻结个人储蓄存款而激怒的福州市民今天上午袭击了福建省长的下榻处，和警卫士兵发生了冲突。这场混乱造成九人死亡，其中包括省政府秘书长。刚上任一个月的省长遭市民痛殴侥幸未死，但据医院发言人宣布，即使最终能保住生命，也将终生丧失大脑活动机能并全身瘫痪。\n\n---\n　　今天下午紧急召开的福建省人大常委会会议决定，由原副省长黄士可代理省长。\n　　北京亚太展览中心\n　　“最多的人口与最贪婪的欲望之乘积怎么用最少的资源满足？”\n　　树已经落光最后的残叶，天地一片枯瑟和灰暗，大门外矗立的广告牌被衬托得更加洁白，使上面那个纯绿的绿点显得生机盎然。那是个公认的杰作。广告牌上除了白底和一个绿点什么都没有，却让人们自发地把展览恰如其分地称做“绿展”。每个来访的记者都先把镜头对准它。\n　　陈盼站在入口处，盯着流水般往里走的参观者。购票处排的队足有一公里，还在不断加长。\n　　好几十个工作人员维持秩序还有点吃紧。这声势使“绿协”的众人兴奋不已，陈盼却巴望至少这会儿人少一点，再这么盯一会儿准得眼花。一个拄着手杖的驼背老人从身边走过，摘下眼镜盯她一眼。她觉得那双眼睛很熟，眼光里闪着一种戏谑，跟那个衰老的身姿一点也不相符，可怎么也想不出从哪感觉熟，这一眼意味什么。老头蹒跚的背影顷刻消失在错落的人群中，她没心细琢磨他。\n　　担心多余了，离老远她就发现了石戈。他照旧穿得随随便便，甚至显得邋遢。条绒上衣已磨得发白，裤子肥大，头发刚长到最没型的长度，支楞八翘。别说副总理，与他自称来参观的身份——普通人都差一大块。不过倒有一股飘洒的神仙劲儿，在一个矫揉造作的世界上是种少见的魅力。陈盼发现自己已开始用看男人的眼光看他。\n　　“黑市价高五倍，我本应发一笔小财。”石戈把剩下的七张票还给陈盼。只有两个看上去是警卫的人不引人注目地跟着他。陈盼寄给他十张票。本以为副总理即使装成普通人，跟班的也得成群。\n　　“我宁愿你发这笔财。没有比你也倒票更能给我们的展览增色的了。”\n　　两人见面的感觉有点像老朋友。\n　　“伊万呢？”陈盼问。\n　　“没借出来。”\n　　那次“偶然相遇”以后再没见过。陈盼一直在忙“绿展”。这个“绿色拯救协会”筹备了一年多的项目差点夭折。虽然“绿协”没参与“六四”翻案运动，又是经过正式批准的民间组织，不在新政权上台后大规模镇压和逮捕之列，但是最近成立的“意识形态指导委员会”却把“绿协”视做整肃对象，先是追究接受绿色和平组织国际总部和德国绿党资助一事，“绿展”开幕的当天又勒令停展。本来还可能有接连二三的棍子打下来。也巧，正当陈盼到处找石戈找不到的时候，石戈半夜把电话打到她家。他仍然记着她要求的“实验基地”，并准备和“绿协”头头具体谈一次。听着她快哭出来的声音，他答应设法取消“绿展”的禁令，并且以一个“普通观众”的身份参观展览。\n　　熙熙攘攘往展厅里涌的观众不知道副总理到场。这个轰动的展览目前处境微妙而且敏感，石戈的光临一旦被捅出去，会使他的处境尴尬。这是他一再强调做“普通观众”的原因。陈盼差点发誓向他保证。为了这个“普通”，只有她一个人在门外迎接，“绿协”的五个书记分散在展厅里面等候。\n　　第一个展厅是个高大穹窿。穹顶闪烁宇宙般的光彩，回响着似来自自遥远星系的奇特声音。\n　　厅内有六组造型。代表六种不同的色彩。每组造型由绘画﹑雕塑﹑静物﹑模型及灯光和音响组成。核心是人。许多的人在造型中摆出不同姿势，做出不同动作。红色造型里展现着搏斗﹑战争﹑屠杀。鲜血在大地上蔓延。一颗颗头颅被反复砍下。蓝色造型里全是机器﹑齿轮﹑身着工作服的人毫无表情，关节发出金属响声，像机器人一样僵直地动作。黄色造型里一面是沙漠﹑饥饿﹑瘟疫和赤贫，一面是拜金﹑荒淫﹑色情和艾滋病。黑色造型里是愚昧﹑迷信﹑人与兽为伍，妖魔鬼怪隐隐出没。白色造型由均衡对称的呆板物体和线条堆砌而成，似墓地又似都市的楼群。在成堆的苍白几何体模型中，整齐地按身长降序排列着脸色苍白﹑身裹白布的僵尸。红﹑蓝﹑黄﹑黑﹑白五色造型围绕的中央是绿色造型。绿色造型没用现代派手法，完全是自然的，真实的。真的树，真的草，真的庄稼，真的流水和泥土。一个强壮有力的男人，一个美丽非凡的女人，他们袒露着真实的躯体。一个天使般的幼小孩子在和撒欢的小羊嬉戏。一只小狗瞪着玻璃珠一样的眼睛，粉红色的舌头舔着鼻子。这组造型毫无深奥之处，却能久久吸引人的目光，让人感到绿色生命的美丽，从内心深处产生渴望。\n　　面对这种气势任何人都不可能无动于衷。光是六组造型里的活雕塑就有上百人。他们大多是艺术家，不但义务表演，还为展览提供了许多免费的设计制作。“绿协”在知识分子中受到广泛支持。尽管如此，材料﹑场地﹑雇工﹑灯光等各项花费也是惊人的，因此门票价格高于普通展览十倍。但观众却比平时多十倍也不止，成了轰动北京的一个大热门。直到昨天，已不得不开始限制购票的人数。\n　　然而人们最感兴趣的是什么？陈盼每每带着一种痛心捕捉着观众的视线。黑色造型前面人头攒动，都想看清黑纱后面那个人与猪性交的细节。红色造型里两个衣衫被撕烂的女人在血水泥泞的原野上摔跤。一层又一层围观的人半张着嘴，久久不走。女人一露出大腿那些眼睛就闪光。黄色造型中那些色情象征尽管极含蓄，也吸引了大批观众。而仅有僵尸的白色造型和全是机器人的蓝色造型前面几乎是空的。无怪有些报纸攻击这个展览是变相的色情表演，是利用人的观淫心理赚钱却满嘴人类命运的贞节婊子展览。这是“意识形态指导委员会”关闭这个展览的公开理由之一。\n　　石戈在每组造型前面都默立好一会儿，最后无言地伸出手。陈盼感觉他的握手有力地一摇。\n　　这比任何赞美都使她感动。她听说为了取消禁令，石戈把官司一直打到陆浩然那里。“意指委”名义上归属中共中央，实际由军委控制，直到陆浩然发了脾气才不得不让步。军人们肯定把这笔账记到了石戈头上。展览没使他失望，至少是对他这番苦心的一点报答。\n　　一个叫做“增长的极限”的模型像贝壳一样自动地往复张开，又合成一体。那是一个地球，但地球表面已经没有山峰海洋和土地，全部挤满了人和物质产品——汽车﹑楼房﹑家具﹑电视﹑冰箱……模型张开的时候，可以看到地球里面──一直到地心──也全都是堆挤的人群和产品。绿色哲学一向强调“增长的极限”这个概念。工业主义的辩护人却说陆地资源用完后还有海洋天空和地下，只要科技不断发展，人类总能获得新的财富满足自己不断提高的消费要求。这个模型就是针对这种辩护夸张地显示出最终极限。科技不能突破这个极限，只能使这个极限更快到来。\n　　下一组展览是两个家庭。一个是当代家庭。另一个是五十年前的家庭。两个家庭分别座落在两盘特制的地秤上。秤的指针对着观众。当代家庭堆满了物质: 冰箱﹑电视﹑空调机﹑洗衣机﹑洗碗机﹑微波炉﹑电话﹑录象机﹑音响﹑浴盆﹑桌椅﹑立柜﹑组合柜﹑大大小小的沙发﹑柜橱﹑桌椅﹑种种炊具………地上是地毯，墙上是贴布，门窗是铝合金﹑茶色玻璃，到处是无用的摆设和莫名其妙的奢侈品。一个半米多高的木偶，上面的机关只是为了挤碎核桃。\n　　一把特制的银斧，作用只是把下锅前的牛排敲得松软些。还有自行车﹑摩托车﹑汽车………\n　　餐桌上堆着如山的食物。肥胖的男主人不时地大吃几口，便紧张地量血压﹑吃减肥药，再在健身器上拼命运动一阵，又到餐桌上去吃。女主人在另一间屋里翻腾无数件衣服和鞋子，穿好一套又脱光，再穿下一套。没有一套看得上，又打电话让商店送。孩子则被压在玩具堆下。\n　　指针显示这个家庭拥有的物质总量达一万四千公斤。显示屏分别列出这个三口之家占有木材﹑金属﹑毛纺品﹑化学材料﹑玻璃﹑皮革等各种原料的数量和消耗的能源以及提供这些原料﹑能源所需的石油﹑煤炭﹑矿石﹑森林﹑动植物等的数量。五十年前的家庭四世同堂，睡的是木床，坐的是竹椅，房间里只有必要的物品，因此虽小却显得比当代家庭还宽松，干干净净，人的衣着朴素，食物清淡，烦恼并不比当代人多。人均拥有的物质量仅是当代人的二十五分之一，消耗的原料和能源更是少得多。\n　　“……当前中国有四‘最’”。陈盼说个不停，想尽多表达一些绿色观点。对于石戈，她愿意这样做，也认为会有作用。“第一人口世界最多。国土面积虽然不小，但大半是高原﹑戈壁和沙漠，被最多的人口一平均，人均占有资源就最少，这是第二个最。中国的传统道德在不断的革命和外来文化冲击中被摧毁贻净，新的道德体系却毫无建树，形成全社会的道德真空，这是第三: 道德水准最低下。当代改革家们认识到以信仰为杠杆﹑鼓励无私奉献的共产主义道路已经走绝，便把刺激和纵容个人欲望当成改革的核心。欲望一时能推动经济增长，但穷怕了的中国人一旦瞄准了美国式生活，那种不可能弥补的差距便激发出第四个最──欲望最贪婪。如果说全人类终将被自身欲望所毁的话，拥有这四个最的中国就将第一个毁灭。很简单: 最多的人口与最贪婪的欲望之乘积怎么用最少的资源满足？人无法用劳动向自然资源索取满足，就会转向抢夺别人的资源份额。这种动物式的生存规律在最低下的道德状态中将使人际斗争分外残酷。中国社会已经充满由此产生的内压力。最基本的社会问题: 需求大于供给，通货膨胀，社会腐败，犯罪严重，政治上的不满和动乱全是这四个最综合出来的结果……请看，这是一群电影艺术家对未来世界的描绘。”\n　　一面大型激光屏幕展示出世界毁灭的过程。随着十六世纪的占卜神魔诺查丹玛斯的吟诵，出现一幅幅惊心动魂的画面。\n　　和平被毁，大地摇动，\n　　波河与奇帕鲁河波涛汹涌，蛇群在岸边蠕动。\n　　毒菌潜入硅鱼头中。\n　　它们硕大的身躯在极地陷入绝境。\n　　长时间没有盐，\n　　少女和丑陋凶恶残忍的狼混在一起，\n　　所有人的毛发都从皮肤上脱落，\n　　疯狂争斗，\n　　大地上布满了怪物……\n　　屏幕前设立了一个摄影摄像部。一位著名相声演员给人们做示范。他披起和尚袈裟，一套专用设备把他的影像投射进屏幕，打扮成济公模样的他和那个悲惨世界合为一体。他边走边唱一首打油诗:\n　　天上无飞鸟，\n　　地上无爬虫，\n　　树枝无树叶，\n　　树干无树皮。\n　　济公和尚从屏幕里扭过脸对着观众，旁白一样问: “哪去了？”拍拍肚子，“全吃了。”\n　　东北虎，\n　　华南虎，\n　　一概吃光，\n　　自古虎追人，\n　　今朝人追虎……\n　　\n　　表演可以转制成录像带，也可以拍成单张的照片。只要顾客选中屏幕上的具体画面，自己在那套设备前面做出相应动作，就可以与画面逼真地合成在一起，看上去跟真在那个恐怖世界里拍的照片毫无二致。兴致盎然的观众排起很长队伍。陈盼问石戈是否要拍一张在恐龙嘴里挣扎的照片，对他可以免费，也可以不排队。石戈做出坚定表情拒绝，他不想落到那个地步。\n　　排队录像或照相的人都是图新鲜，但他们到处拿给别人看时必然要讲这个展览的宗旨。这是绿展设立这个项目的主要目的。\n　　石戈看一排翻开陈列的古籍。那些发黄的线装书上记载着历史上历次大饥荒时的惨状。解说员向观众解释，“易子而食”是说将要饿死的人们不忍吃自己亲生孩子，便相互交换孩子吃，而书上标明当时市价远低于羊肉的“两脚羊肉”实际上就是人肉，把人称做两脚羊是一种中国式的文雅。陈盼又看见那个驼背老人。他在仿真温室效应的玻璃罐前向她挥了一下手杖。\n　　那姿态突然使她认出来，邢拓宇！ 她四面看看，没有人注意。“老人”消失在一群嬉笑的中学生身后。他是向她表明实现了诺言吗？他曾表示一定来看这个展览。可那时他是众星捧月的群众领袖，现在则名列当局通辑名单的第二名。全国的电视报纸都上过他的照片。她以为他隐匿在深山老林里，每次想起都为他的安全祈祷。他却竟然还在眼皮底下玩这种游戏！ 她真想骂他一顿！ 可她知道最好的方式就是一眼也别再看他。这种天生爱摸老虎屁股的坯子，只有随他去。\n　　陈盼给石戈介绍了鲁时加和“绿协”另一位女书记。“绿协”是个松散组织，大方向一致，具体观点和行动方式不要求统一。五个书记是五个不同派系的领袖，求同存异，还算默契。\n　　鲁时加一派致力于环境保护，模仿西方绿色和平组织的早期行为，经常搞一些引起轰动效应的抗议活动，吸引国内外新闻媒介的关注。早就有人批评这种当明星出风头的方式浅薄而且廉价。但鲁时加有他的道理，明星方式影响大，传播快，对于环保意识尚未普及的中国最见效。中国政府为吸引外资而放松环保限制的政策也确实受到他们堵塞下水道或拦截垃圾船一类“恐怖活动”的冲击。\n　　“以后也许还会给您添麻烦。”鲁时加话中有话地说。\n　　“欢迎。”石戈倒挺真诚。\n　　为了避免引起注意，仍然由陈盼一个人陪同石戈。有一个厅全是荒诞剧的片段和小品，表现人类的异化和精神世界的荒芜。一男一女同坐在公园一条长椅上，逐渐搭讪，越谈越发现他们有许多共同的事物，最终才明白他们原来是夫妻。陈盼不知道那一对对边看边乐的夫妻是否能意识他们自己也往往对面而不相识。欧阳中华在黑暗中的沉默又像冰一样扩散。她把那股寒气压回心底。浑身锈蚀，啤酒肚胀气的肥胖男人们整日坐在电视机前看几个年轻运动员在花哨的体育场上蹦蹦跳跳，不啻人类最荒唐的行为之一。一出小品表演一个人一辈子生产自己从来用不上也不知怎么用的产品，被不知道的渠道运到不知道的国度，为那天天相伴而又丝毫无缘的“不知道”耗尽自己的生命﹑精力和资源。另一出小品在演现代人任何举动都得受专家指点，未经指点的任何动作都会触响表示错误的警铃。专家发表意见以前要翻遍只有他们才摸得着头绪的无数厚本。他们指点精确到“左脚第三个趾头沿三十八度二十分零九秒移动一点一毫米”，结果警铃又响，行动者出现了千分之一的偏差。\n　　陈盼又向石戈介绍了“老夫子”和另外一个书记。“绿协”的五个书记中只有“老夫子”岁数和石戈差不多。他原来是个搞系统工程的博士，哲学功底相当深，在社会系统的研究上颇有建树，被公认为“绿协”最有学问的理论家。他的一派致力于以改变人类经济生活方式来改变人类的状态。他认为经济是生存根本，任何人类理想都不能脱离这个基础。不是经济本身决定了人类的糟糕状态，而是现行的经济方式。比如工业化大市场所要求的“效率”。许多问题由这两个字产生。它要求越来越多的投资和越来越少的工作者，从而导致失业﹑生产过剩和通货膨胀这类困扰人类的灾害。一体化的国际竞争把效率压力传递到全球每个角落，使穷者愈穷，富者愈富，使人变成机器，把生命变成无意义的忙碌。他主张以复制生态而不干扰生态的科技型小社区自足式经济取代以交换为目的市场型大经济，让复杂艰深的现代经济学回归成朴素的人类生存常识。\n　　欧阳中华最后露面，他好象在两个展厅之间的小卖部前跟石戈偶然碰上。陈盼知道他一向是“见官大三级”，但却不喜欢他对石戈居高临下的姿态。他确实比石戈高得多。漂亮﹑优雅﹑高贵，任何人在他面前都难免感到某种程度的自惭形秽。不过看不出石戈有类似的不安，那股沉稳劲让人想起岩石。岩石不会跟摩天大楼比高低。\n　　“拜读了《涅盘》。”石戈微笑地跟欧阳中华握手。\n　　《涅盘》是欧阳中华从黄河灾区回来后写的书。刚脱稿不久。目前的政治形势下不可能出版，只打印了一些在国内传阅。与石戈密切相联的众多知识界渠道有可能把打印稿传过去，但陈盼没想到他能这么快就读过。\n　　\n　　在《涅盘》中，欧阳中华第一次明确阐述了他对人类如何从物质人社会向精神人社会转化的见解。他认为人类自我矫正和自觉转向是个仁慈但注定绝望的愿望。历代宗教圣者全对人类说: “你们错了，回头吧！ ”然而人类却在物欲的泥沼中越陷越深。教育也不可能让人类迷途知返。对危机和困境的描述早已人人皆知，但把“我”和“现在”视为价值核心的现代人不可能为“他”和“将来”牺牲个人的眼前利益。爱因斯坦那种几近上帝的大人物与几百名世界名流向智力超群的大国首脑们呼吁停止发展毁灭人类的核武器，结果是发展了几万倍。\n　　怎么能指望在把思想家视为穷酸而把棒球手和性感明星奉为偶像的电视时代，让那些只有理解动画片的智力和欣赏大腿舞情操的芸芸众生听进让他们放弃物欲牺牲享受的明智声音呢?\n　　所以世界必将毁灭，任何挽救和延缓的企图都无济于事，是白白浪费，甚至从某种意义讲，是反动。“现实的一切都是合理的”。合乎逻辑的该是如何利用现实。旧世界的毁灭可以加速新世界的到来。让芸芸众生的物质人自食恶果死去而扫清道路远比把他们转化成精神人来得容易，也更有助于彻底改变世界。如果能在毁灭来临前做好理论﹑组织与物质上的准备，在物质人的大灭绝中保留下受过充分教育﹑有高度智力并能自我约束的精神人，使之成为硕果仅存的人类火种，他们就可以在旧世界的废墟上孕育一个全新世界。新世界是缺少感官享受，压抑物质欲望的，所以以往人类变革的手段──以描述美好的未来鼓舞人们奋起追求──已经丧失，只有靠一个灭顶之灾留下的恐怖阴影熔入人类集体潜意识。恐惧将比自觉提供更有力的保证，使人类从繁殖，教育到生产与生活都纳入一个自我控制的体系，并把自我控制化做人类永恒的生存本能。那个社会将是也只能是精神人的社会。人类以此完成从死亡中新生的壮丽过程，化做在烈火焚烧中冲天而起的凤凰。这就是他的书名──《涅盘》的象征。\n　　这本书的观点冲击力很强，书中的激情﹑文采和诗一样的语句令人沉醉，在知识界不胫而走。\n　　但在国外翻译出版后，却没有获得他的前一本书──《精神人》那种普遍的好评，只被当做惊世骇俗的一家之言。这一点从小卖部销售的“生命盒”遭到冷遇也能看出。“生命盒”是欧阳中华根据他对野外生存的研究设计的。盒里装有一个人在无社会供应条件下维持生存的必需品: 猎捕小动物的绳套﹑钓鱼的钩线﹑人体不可缺少的合成盐﹑识别可食或有毒植物的说明书﹑引火用的凸透镜﹑多种用途的组合刀﹑指北针﹑酒精﹑净水剂﹑药膏﹑夜光纸﹑缝衣针线和防风打火机等。只是因为“绿协”那位女书记喜欢欧阳中华，才同意她经营的“绿色企业”做了一批。欧阳中华向她保证能赚钱，但不管广告如何说大崩溃到来时“生命盒”怎样能救命，人们只是一笑。石戈是第一个肯掏钱的买主。\n　　“广告如果把它说成用于探险旅游，我想会有销路。”\n　　陈盼想问石戈自己准备用于干什么。欧阳做出受启发地歪了一下头。\n　　“不堪救药的人类。”他像为此感谢石戈，主动陪他往下参观。\n　　下一个展厅叫“出路”。里面只有无数个门，当人想通过门时，却会发现大多数是假门。有的门是镜子里的投影，许多不同角度的镜子互相反射，随着人的移动门越变越多。有的门看上去很真实。从半开的门缝中，还能看到外面的花园或另一个房间，走过去却会碰了头──那是用超级现实主义手法画在墙上的门，像得可以乱真。观众在展厅里嘻嘻哈哈地转来转去，门越多越找不到出路。\n　　置身于四面碰壁却高兴万分的观众中间，欧阳中华略带嘲讽地挖苦“解决危机”的任何作为。\n　　“……对于他们，”他指指周围的人。“现在唯一能做的也是该做的就是抓紧享乐。中国医生对要死的人总是说: ‘想吃什么就吃吧。’毁灭临头时把人生该享受的都享受过了，他们死得也就会心安理得些。现在让他们自制节俭，结果只是在照样难逃一死时让他们觉得一辈子白活。”\n　　“都想吃什么就吃，毁灭会来得更快。”\n　　“对。”欧阳中华满脸光彩地笑起来。“毁灭来得越早越彻底，历史进程就越完美”。\n　　陈盼刚见欧阳中华就是被他这种笑迷住的，这笑洋溢着顶天立地的自信和豪爽。\n　　“按照你的逻辑，毁灭成了社会进步，那么，促进社会毁灭的破坏活动﹑违法乱纪﹑无道德和所有的堕落也都是高尚的了。”\n　　“正是。”\n　　“每个人都可以心安理得地干坏事？”\n　　“我要是你，就给干坏事最多的人发奖章。”\n　　“但愿别给你发。”石戈的表情看不出赞同﹑调侃，或是不满。\n　　“那可不一定，想发的时候千万别客气。请。”欧阳中华做出一个请先走的手势，想看石戈碰壁的洋相。\n　　“还的跟着你好。”\n　　欧阳中华哈哈一笑，径直走向一个最不引人注意的小门。那门看上去和别的门没有两样，却能毫无阻挡地直入一条幽暗的走廊。走廊通向六色造型的大厅。出口正对着绿色造型。\n　　一进大厅就看见几十个流氓正围着绿色造型起哄。他们向那对男女模特齐声怪叫: “操一个！\n　　操一个！ ……”观众吓得纷纷闪避。造型里的小孩大哭。两个模特哄着孩子，装作没听见。\n　　其它造型也照常表演。\n　　“警卫呢！ ”陈盼问工作人员。\n　　“一个也找不到！ ”\n　　流氓不满足语言的猥亵，开始比赛扔香蕉皮打女模特的隐私部位，打中了就一片怪叫。男模特为同伴挡了一下，扔过来的就成了啤酒瓶。流氓们明显是故意来滋事的。每人的衣服下都鼓着菜刀和匕首。陈盼要冲上去，被欧阳中华拉住。一个西方记者因为拍了张照片被打了个耳光，相机也被砸碎。“绿展”工作人员都呆呆愣着，任何一个人挺身而出都会成为流氓们大打出手的开始，只有欧阳中华一点不紧张。\n　　“副总理……”他安祥地转向石戈。这个称呼第一次被叫出。有一个国家副总理在，难道还有什么值得紧张？他没有说下去，但意思已经很明白。\n　　石戈回头看看他的两个警卫。\n　　“如果你们自己能对付，最好别扩大范围。”他对拿出了对讲机的警卫说。扩大范围肯定要打出副总理的牌子。\n　　陈盼又看见了邢拓宇。他不再伪装驼背老态，正在从后退的人群中挤出来。拐杖拿在手里的样子看上去完全是件凶器，马上就要高高抡起。陈盼大叫一声“别动手！ ”人们目光全转向她。她伸出的手定在半空。邢拓宇眼光和她相遇。只有他知道这喊声冲着谁。流氓们炸了窝一样围向陈盼。石戈的两个警卫分成一左一右。他俩个头都不高，身材单薄，步伐轻得像猫。\n　　没等那帮流氓明白怎么回事，下流的叫骂突然变成一连串惨叫。人们几乎没看清整个过程，已见十多个流氓倒在地上。两个警卫背对背站在一起，置身于流氓群中心。\n　　一个模样和身材都似黑熊的流氓头子怪叫着轮起菜刀，呼呼带风地劈头砍去。与他面对的那个警卫站在原地纹丝不动，却见菜刀向后飞了出去，声音刺耳地在水磨石地上砍出一条白坑，而黑熊捂着肩膀乱跳，五个血窟窿一齐喷血，抡菜刀的胳膊像没了骨头一样垂在身边。同时，另一个警卫飞起一脚，把从旁袭来的流氓踢个满脸开花，仰面昏倒在地上。这两下足够了，所有流氓一下被镇住。几个想跑的小喽罗被一声“站住”的喝令吓趴下。菜刀和匕首全都扔在地上。工作人员找出绳子，把耷拉着脑袋的流氓捆成一串。观众鼓起掌来，连六组造型里的艺术家和模特也一边鼓掌一边欢呼。陈盼看见邢拓宇又弯成驼背，拐杖也恢复成衰老的象征。他被挤上前的人群淹没，没引起任何人注意地消失了。记者们遇上了一个颇有传奇色彩的场面，争先恐后地向两个警卫采访。两个警卫打架行，却没见过这种场面，直往后缩。\n　　“女士们，先生们，我来介绍一下。”欧阳中华用英文说。“这两位是石戈副总理的警卫。”\n　　他微笑着掌心向上，没指警卫，却指向石戈。\n　　陈盼狠狠拉了一把欧阳中华。她顾不上愤怒的神色被外国记者拍进镜头。他怎么能！ 她说了一百遍不能透露石戈的身分！ 她向石戈做出过最庄严的保证！ 这是她的人格！\n　　刚才的场面只是刺激。副总理光临“绿展”才是重大新闻。摄像机﹑照相机全部转向石戈。\n　　录音话筒一下在他嘴边堆成一团。各种发问一股脑甩出来。混合成乱嘈嘈的轰鸣。\n　　这种突如其来的暴露使石戈显得有点狼狈，想躲无处可躲，呆立又不是长久之计。等记者的提问稍微有点顺序，他就得被置于一个答也不是不答也不是的难堪境地。西方记者对中国全面实行法西斯统治之际能举办这种“绿展”深感兴趣，一直想挖出它的后台，把中共新政权的内部斗争曝光于世。\n　　陈盼碰一下石戈，用眼神示意跟她走，一转身走进他们刚从里面出来的那个信道。\n　　石戈从容地跟上她。信道狭窄，立刻阻塞了拥挤的记者。利用这个时机，一拐弯，陈盼抓住他的手跑进已经空无一人的“出路”展厅。挪开一面镜子，后面有一个很小的空间。她把石戈推到里面，自己也随后进去，把镜子拉回原位。这只是几秒钟的事。记者们随即冲入，然而眼前只剩数不清的门，空空如也。\n　　在镜子后面刚定身，陈盼的眼泪就止不住往外流。她使劲想忍住，可是鼻子酸得发疼，泪流得反而更多。镜子结合部的缝隙可以看见外面。记者们东一头西一头地乱撞。好几个人的手摸过他们藏身的镜子，发出手和玻璃摩擦的声音。空间只够他俩紧挨在一起。她怕哭泣引起的颤抖会传递给石戈。石戈不动，和她靠在一起。欧阳那夜也是一动不动地沉默。他俩靠得更近，在一个睡袋里，可连他的躯体都传递着沉默，像冰一样渗进她心里。那个沉默和这个沉默多么不同啊。她那时也流泪，可是没有这样压抑不住。她怕那沉默，更怕那沉默之后滔滔而出的道理。她最终听从了欧阳，打掉了孩子。欧阳有那么多的道理，压得她抬不起头。\n　　她在理性面前惭愧而软弱。怀孕似乎是罪过。然而孩子却在她心里一直活下来。手术后医生告诉她是男孩。那以后她就没有缘由地把那男孩叫成小沙沙。三年多她和儿子天天在一起，无论是做梦还是醒着小沙沙都常在眼前，和她没完没了的戏耍。她经历了抚养和教育儿子的整个过程，一步不缺，细致到换尿布的每个细节，逼真得连她都分不清是幻想还是现实。可是沙沙身边一直没有父亲。她曾多少次试图把欧阳中华插入她和沙沙的世界，那画面却总是无法清晰。即使强插进去一个父亲身影，脸也是虚的，一块空白。偶然几次，她终于把欧阳中华的脸填补在那块空白上，可他的神情冷漠骄横，小沙沙立刻变得畏葸恐慌。合家团聚的欢乐毫无踪影，连母子亲情也变得陌生。她最终放弃了努力，只让她自己和小沙沙在一起吧，就当他是没爸爸的孩子。可是不知为什么，自从上次和石戈相见，父亲的形像竟然自动出现在她和小沙沙的世界。她不敢看那父亲的脸，试图让他离开，却总听见他和孩子拥抱在一起的笑声，那么动听。当她终于抬起眼睛，看到的却是石戈，小沙沙变成了伊万。他们向她张开手臂，等着她投身过去。那景象让她想哭。可在夜深人静时她把眼泪咽了回去，却在这个最不该哭的场合让所有眼泪一齐涌了出来。\n　　记者们终于摸出展厅，往别的方向追踪去了。陈盼想用手绢堵住眼睛，可手绢一会儿就浸透了。\n　　石戈对她的眼泪手足无措，只会反复说“没什么”。重新开始参观的人们陆续进入展厅，他不敢动，说话也只能用耳语。\n　　“他这种做法很聪明。”他终于找到安慰陈盼的理由，口气像是打心眼里佩服欧阳中华。“换了我也会这么干。”\n　　从政治角度，这当然是聪明做法。副总理亲临参观的消息公布出去会鼓舞自己人，会使敌对者顾忌，使国际社会看重，加深中共内部分歧，使求生存的缝隙更为宽阔。如果给这位副总理带来麻烦，造成的影响只能更大。这么多好处如果都埋没在一个女秘书的诺言里岂不可惜。\n　　在政治中，诺言何曾有过约束性?\n　　“不，我不能原谅这种聪明。”\n　　“聪明用不着原谅。”\n　　镜子后面的光线朦朦胧胧。她看到了石戈的笑容，那么宽厚，令人想起土地。她升起一种冲动，想投入那个近在咫尺的胸怀。这只是一闪念，却立刻使她止住了眼泪。她把挤靠在一起的身体尽量分开一点，用最快速度让泪痕在脸上消失，眼睛恢复正常。\n　　“你快离开吧，不要再见面谈话了。”她让自己的声音也拉开距离。\n　　“为什么呢？”\n　　“我们对不起你，所以你答应的见面谈话也可以收回。”“绿协”的头头都指望能从这次会谈中获得一些东西，交给陈盼的任务是千方百计请石戈答应一次会谈。\n　　“跟你们会谈不是我的赏光，是我的荣幸。我有求于你们，不是相反。”\n　　“真的吗？”\n　　石戈认真地点头。陈盼能感觉到他的呼吸。她的眼睛又一次湿了。\n　　他们从镜子后面出来时，观众中一个小伙子问: “出路能这么找吗？”没人认出石戈，只把他们当成一对鬼混者。陈盼的眼睛还有点发胀，但在镜子里看已基本正常，只需补点粉。她突然从镜子中看见欧阳中华在展厅对面一个小门里注视他们，待她回头人又不见。她领石戈走进那个小门，绕过“观众止步”的牌子，一道楼梯直通三楼的贵宾休息室。她不知刚才是错觉还是真地看见了欧阳，他跟别人一样似乎一直在等他们。石戈的两个警卫已经急得团团乱转。见面气氛的颇有点尴尬，只有欧阳中华和石戈两个人显得无所谓。谈话先从他们两个开始。石戈把展览大大夸赞一番。几个书记眉开眼笑，欧阳中华却显得不为所动。\n　　陈盼下意识地看向景泰蓝仿古座钟。又到十点钟了。血液发烧般缓缓加快流速。也许今天没了。刚想到这，好象是故意嘲笑她，不早不晚响起的铃声吓得她一抖。不锈钢托架上的新式电话音色柔润，却使大伙都变得凝重起来。对此莫名其妙的石戈也随众人的视线看向电话。\n　　按照事先的布置，陈盼依次打开接在电话上的反查号码仪器，按下电话录音按键，打开扬声器，拿起话筒。\n　　“您好，亚太展览中心。”她模仿工作人员的标准声调，仪器液晶显示盘上的数码快速跳动变化。\n　　还是那个男人，声音又尖又凉，像条细长的蛇。\n　　“安放在绿展内的炸弹二十分钟内爆炸。”\n　　“喂，你说什么？我没听清，请重复一遍……”陈盼想拖延时间。那边挂断了电话。\n　　对方号码出来了。陈盼在仪器上打了个查询指令，那是个公用电话。可想而知。连续三天都是同一时间同一嗓子同一句话。前两天立刻闭馆，把观众和工作人员疏散到外面，并请公安部门来检查。可是既没爆炸发生也没发现炸弹。展览受的损失很大，不但要给观众退票，还弄得人心惶惶。这几年恐吓电话泛滥，多数出自一种寻求刺激和盲目破坏的流氓心理，并无真的恐怖活动。但随着恐怖事件不断发生，谁也不敢轻视，即便九十九个是假的，有一个是真的呢？大量航班为此延误起飞。许多商店﹑影院中途疏散顾客，进行安全检查。警察对这种事最头痛，既无结果又无法破案，久而久之也就敷衍了事。每年这类恶作剧造成的损失相当可观。\n　　“继续展览！ ”欧阳中华昨天就是这个态度。“我们不能被一个小流氓的恶作剧牵着鼻子跑。\n　　任何人兜里装满了硬币都可以一刻不停地打这种电话，难道展览就不办了？”\n　　昨天多数人不同意欧阳中华，今天反过来了。每次疏散都得大半天不能恢复展览。没有收入，支出却不减。更严重的是再折腾几次，观众就不来了，工作人员也不干了。只有陈盼一个人有异议，她不能认为电话里那个坚定冷酷的声音是出自小流氓之口，然而她不是决策者。\n　　\n　　“……实在不撤观众，至少我们转移到别处去谈。”\n　　几个书记不约而同把目光投向石戈，都知道陈盼为什么提这个建议，毕竟有个副总理在场。\n　　欧阳中华微微一笑。\n　　“如果没有炸弹，不管谁在这都是安全的。如果还有怀疑，就该所有人一块撤。我们走，让观众留下，有点说不过去吧？”\n　　陈盼觉得欧阳中华微笑的眼里冷冰冰，跟刚才展厅镜子里那双看她和石戈的眼睛一样冷。他的话噎得她七窍生烟，直想一巴掌把桌上的茶杯打到地上去。她站起身，只要到门外跟那两个警卫一说，他们马上就得把石戈带走，哪怕架着他，可是石戈已经开口。\n　　“我们继续谈吧。”\n　　谈话转到最实质的问题上──试验基地。陈盼本来是为这个问题才跟石戈接触上的，可是现在却听不进他们在谈什么，精神都集中在座钟的指针上。沉重的钟摆像一条独腿在没心没肺的走动。走到二十分钟时，似乎在场每个人都松了口气。什么事也没发生。可恶的小流氓，竟让人感到他亲切！ 陈盼觉得全身被紧张弄得疲惫不堪，尽管尽量装得自然，脸上也一定很僵硬。她看见欧阳中华嘲弄的神色。不管怎么样，没事就好。\n　　写完《涅盘》以后，欧阳中华需要的基地除了试验精神人的审美生活方式，又加上了一个同样重要而且更为迫切的使命──在注定不可逃脱的大毁灭来临时，成为重建未来世界的精神人的生存基地。一边是芸芸众生的大规模死亡，一边是人类先进分子得以延续，这是人类实现自我革命的两个并列前提，也是获得绿色未来的保证。在欧阳中华眼里，时间已经不多，必须从现在开始就全力以赴投入准备。当这个被技术和分工弄成连锁依赖的脆弱社会崩溃时，精神人怎样才能以个体或小团体的形式因势利导地实现理想社会？这一点和“老夫子”\n　　的“小经济理论”有异曲同工之处，所以很受“老夫子”支持。石戈也表现出特殊兴趣，不过他显然是另外一个思路。他只抓住“生存基地”最实际的内容: 一旦出现社会崩溃，怎样让尽可能多的人维持生存。\n　　鲁时加和女书记各有另外的观点。石戈看上去认真听他们表述，却一直控制谈话节奏，抓紧时间地进入结论。\n　　“是不是可以这样看，”他说。“第一，你们都认为需要建立一种与现在不同的生活方式﹔第二，你们对新生活有不同的设想﹔第三，你们需要通过实践摸索和检验。陈盼跟我谈过你们需要一个试验基地。我觉得一个不够。你们每个人的思路都很可贵。试验需要从不同的方面对比，因此我决定给你们六个试验基地。每人一个。”\n　　在座的人都有点难以置信。鲁时加夸张地揉了揉耳朵。“老夫子”直擦眼镜。女书记几乎惊喜地叫起来。就连一直不冷不热的欧阳中华也泛出真心的笑容。最震动的是陈盼，除了五个书记，在座的只有她是第六个。每人一个！ 难道她也有了一个试验基地?\n　　“现在不是乌托邦时代，试验基地打不出正式招牌。在我的权限之内，我可以任命你们每人担任一个国家自然保护区的管理局局长。对外还得叫自然保护区，原有的职能工作还得做。\n　　但我想那对你们不是负担。绿色本身就有保护自然的职责。其它的完全由你们自己做主，在你们的辖区内尽管自由试验，只是不要向外打什么政治旗号，可以接受吗？”\n　　“太棒了！ ”鲁时加狠狠挥了一下拳头。\n　　几个书记的兴奋情绪溢于言表。\n　　“你说过你对我们有所求。”陈盼的声音倒成了最冷静的。\n　　“是的，有所求。”石戈说。他先看了陈盼一眼，然后环视每一个人。“第一个求是要你们通过试验做好这样一种准备: 一旦到了需要的时候，能把类似的生存基地扩展成六十个，六百个，甚至再多。”\n　　“毫无问题。”欧阳中华说。“这也是我们的求。”\n　　“第二个求可以算我们个人之间的交易。”石戈浮起一丝略带□腆的笑容。“六个试验基地中的五个进行你们的试验，一个进行我的试验。”他的眼光重新落回陈盼身上。\n　　陈盼心跳，他选中她做他的试验主持人?\n　　他的眼光似一片明净的月光，像是肯定她的猜测，向她轻轻点了一下头。\n　　“我的试验……”\n　　就在这时，一声巨响。陈盼从来没听过这样可怕的响声。耳膜剧痛地塌陷。整座建筑都抖起来。那能量使人的五脏六腑都绞成一团。爆炸！ 她立刻意识到。排列整齐的沙发像会跳的青蛙在大厅里东倒西歪。她踉跄着站起。巨响回荡着钻心的嗡鸣。似乎没有人受伤，但是她看见悬在石戈头顶那个金晃晃的大吊灯像撕开胶布一样与天棚分离。她听不见自己的喊声。世界似一片真空，没有地面，没有步伐，也没有时间，但是她已到了石戈身边，只是从推出去的双手才感受到他的反力，把他从直落的吊灯下推出。她看见一个金架的玻璃棺材从头顶笼罩下来，仍没有感觉，只像包围自己的虚幻，和自己一块在瞬间消失……"
		},
		{
			"post_id": 20,
			"title": "《黄祸》16",
			"date_published": 1461240811.342,
			"body": "　　福州\n　　在这个时刻，这个地点，黄士可突然意识到自己一种新的形像，不再仅仅是一个地方势力关系网中的牵线人，而成了一个政治核心，一个旗手。\n\n---\n　　那个年轻的北佬被打得满脸开花，竟能奇迹般地冲出重围，跳过人行道栏杆，奔跑的速度惊人，撞倒好几个拦截者。满街的人都想抓住他，连妇女和儿童都激动得大喊大叫。四面一片闽南方言的吼声和咒骂。无数双脚跺得街道隆隆颤抖。\n　　年轻北佬在黄士可的车旁被一根粗重钢管打倒。隔着密闭的车窗玻璃，黄士可都能听见骨头碎裂的声音。北佬像一团烂布在惯性中翻滚，离车轮只有半米，竟然又晃悠悠地半跪半站挺起身。司机手急眼快，在北佬扑到车门之前按下电磁锁的开关。四个车门全被死锁。北佬血淋淋的脸贴上后门玻璃，跟黄士可的脸只距一尺，虽然只有一瞬，但那张被血糊住了眼睛又在玻璃上压变形的面孔让黄士可差点犯心脏病。\n　　北佬被追上来的人群踩在脚下。司机拼命按着喇叭把汽车开出旋涡中心。黄士可没有回头。\n　　侧面玻璃上那片稠粘的血浆使外面的人影模糊。\n　　总书记被刺身亡一个多月来，南方几省普遍发生排斥北方人的风潮。这原是个积怨已久的问题。南北经济发展和生活水准的不平衡已使累计四千多万北方人流入南方，给就业﹑市政﹑治安﹑供应﹑交通各方面造成日益严重的危机。近来几百万黄河灾民的涌入又进一步加剧了原有矛盾。灾民白天伸手讨，晚上抢和偷。不过使“排北”风潮蔓延升级的直接原因还不在这，而是北京发生的让南方绝望的大转弯。及时认识到“排北”是对北京表达愤怒的人不多，表面看只是南方人对侵犯了自己生活的流民采取的反击，没有政治色彩，跟北京那些搞翻案要民主的运动也不沾边，所以尚未引起重视和镇压。但是黄士可却看得很清楚，北京每颁发一个向左转的法令，排北的浪潮就升高一格。昨天刚公布冻结三百万元以上私人存款和所有外汇存款，人们就发疯一般涌上街头，放火烧北方驻南方的机构，砸北方的汽车，不问青红皂白，见着说北方话的人就打。发展到这种地步再想控制可就不容易了。\n　　闹吧，闹个天翻地覆才好！ 眼前的情景使黄士可感到舒畅和轻松。以往别说乱到这种地步，稍微有点风吹草动就能让他心惊肉跳，现在却变成最怕稳定。稳定就意味着他们赢了。处身在混乱的人群中，如果不是还对自己的安全有些担心，他会像参加节日盛会那样兴奋。\n　　这帮蠢家伙，他们太自信了，以为有了枪杆子就可以为所欲为？人们就全都老老实实任他们宰割？切小手指头也许人们咬咬牙不吭声，捅到心窝人家还不拼命？存折就是人的心窝！ 黄士可知道冻结存款这一招是新政府恢复平均机制的关键措施，除了为最节省资源的军事共产主义铺平道路，也是挽救已近崩溃的经济，遏制野马似的通货膨胀最简便有效的手段，同时国家可以凭空发一笔大财，而早能够和国家力量抗衡的私人资本却一垮到底。新政权自以为算计精明，一举几得却无所失。“杀富济贫”在中国自古得人心。三百万元相当一九八○年的二万元，全国达到这个存款数额的人不到百分之二，有外汇存款的更少。老百姓早对暴发户不满。“打击一小撮”不会影响新政权的稳定。但百分之二只是平均数，集中到沿海几省，比例数就大大提高。银行昨天报上来的数据表明，福州市超过这个存款数额的占人口百分之二十三，占户数百分之八十四。有外币存款的更多。港币﹑美元﹑台币在沿海几省已成为流动货币，多数人都有。由于贪图保值利息，多数闲钱都存在银行，所以这个“冻结法令”无异于一个把福州炸成底朝天的大爆炸。\n　　汽车慢得像爬行。满街都是激动狂暴的人群，跑着﹑挤着﹑相互询问，大声疾呼。每一个银行和储蓄所都被围得水泄不通。黄士可似乎看到广州﹑海口﹑杭州﹑上海正在发生同样的情景。让那些搞政变的人看看，倒退没有好下场！ 银行大楼的镜面玻璃刺耳地破碎，在黄士可心中引起一种快意。至今没摸清中央斗争和变化的内幕。但没人相信总书记真是死得那么偶然和意外。十八个省同时换了省长和第一书记，除了政变还能用什么解释？但在程序上找不出毛病。谁能说“中央”没权力更换地方首脑？哪怕人人心里都明白怎么回事，嘴上也说不出来。\n　　谁不会玩这个呢？嘴上说一套，实际做一套，说的不做，做的不说，这是中国地方官最基本的功夫。新省长上任之时，黄士可率领省政府全体工作人员表态坚决服从中央，做新省长的忠实助手，实际上架空一个外乡佬还不是易如反掌的事！ 一个多月来，新省长了解的情况全经过他的安排﹔新省长的一言一行都被他掌握﹔而新省长的每项命令都被恭敬地接受﹑传达，却没有一个被真正执行。新省长也许很得意，自以为能干，天天钻营﹑拉拢﹑摸底﹑各个击破，得到的却不过是幻想中的胜利。也许他已有觉察，但也只能如堕五里雾中，找不到门路。\n　　有一件事黄士可放心不下，前天的反腐败会上，新省长突然亮出一份他儿子的材料。黄士可知道自己这个儿子不老实，可没想到除了做生意，这个孽种还干拍摄黄色录像的勾当，不光当什么“导演”，还通过地下渠道卖了好几千盒带子。他措手不及，不得不当场同意签发逮捕令。好在儿子在监狱里露底，那套黄色录像的另一个合伙人是主席的孙子，不但分走了一大半利润，还专爱在录像中上镜头——不上脸，专上其它部位的特写。新省长渊源是军队，纵使装成再廉洁的清官，也不敢得罪他们军队系统的太上皇，不得不把儿子放了，并且在黄士可逼迫下，当众宣布反腐败会上的材料是假的。虽然打了个平手，转危为安，但毕竟出了一次危。有第一次危，就预示着以后会接连不断出现危。从新省长歹毒仇恨的眼光里，他明白迟早要兵刃相见。连他自己都不掌握的情况对方怎么会知道呢？口子开在哪？叛徒是谁?\n　　街上汽车堵塞成不见头尾的长龙。人们的情绪越来越疯狂。银行大楼的玻璃转瞬间被砸个精光。防暴警察陆续开来，可在人海之中，仅像几片飘浮的叶子。\n　　欲望使人疯狂，黄士可在内心叹息。虽然这些年社会丑闻比比皆是，然而关系到自己儿子还是使他震惊。他没想到儿子会变得那样无耻，在监狱里也带着下流的笑容。他不想教育儿子，也知道教育不了，只是为了在政治角逐中保住自己的防线，他必须把儿子弄出监狱，儿子便更加有恃无恐。这个社会完了，这意识常常在他脑中出现。每个人都变得那么贪婪﹑卑鄙﹑懦弱和恶毒，全部目标只有如何占便宜，占国家的﹑占集体的﹑占别人的，满足欲望不靠劳动而靠欺诈，人和人之间全是对立﹑相争﹑拆台，一个国家还能有什么希望呢?\n　　车内电话响了。黄士可拿起话筒。\n　　“请用B键。”\n　　话筒里是百灵一本正经的声音，却甜蜜蜜地流进黄士可心里。B键是保密键。黄士可升起与司机座之间的隔音玻璃。汾水关那消魂的一刻之后，他再不让百灵在车上念文件。他们避免一切让别人察觉的蛛丝马迹，两人的联系和幽会全以这种刺激人的秘密方式进行。\n　　然而，换了B键，百灵的声音仍然严肃。\n　　“请看公文包里省计委794号文件第三页。”\n　　黄士可微笑着摇头。怎么这么神秘，用B键还不直说，无非是补一个告别吧。\n　　第三页夹着一个字条，只有潦草的几个字:\n　　别去北京，你会被捕。\n　　“你怎么知道？”他的心悬起来，握着话筒的手顿时汗淋淋。\n　　电话已寂然无声。\n　　今早，中央办公厅打来电话，要他立刻赶赴北京，总书记要与他谈话，给他派的专机已在军用机场等候。本想和百灵告别，无奈忙忙乱乱没有单独在一起的时间，只在临上车前接过她准备好的文件。百灵掌握了什么情况？这样神秘和严肃的警告不会是玩笑。他感到一种凶险，突然明白临行前从新省长眼睛里看到的奇特神情意味着什么。只要他在福建，新省长就别想把持局面，北京新政权的路线也就难以推行，他们能留着他为所欲为地充当绊脚石吗？一到北京他就会被送进“党校”，也许刚登上飞机就成了囚徒。然而百灵是怎么知道的呢?\n　　他做了几个深呼吸，让心脏的跳动稍微平稳一些，拨通杭州的电话。前天浙江副省长被召去北京汇报。那是他的老朋友，在架空新省长方面不比他做得差。接电话的是老友的妻子。她说她丈夫一到北京就失去了联系。黄士可连句安慰的话也没想起来说，木然放下电话。\n　　街上，人群和防暴警察展开冲突。一批暴民砸开银行铁门冲进去，里面只有帐薄卡片和文件，所有钱柜都空空，银行职员也一个不见踪影。警察向暴民发射催泪弹，做为回答，暴民在银行里放起了火，并且从楼顶向警察投掷燃烧瓶。\n　　看得出这批暴民是有组织的，配合默契。他们的目的是把事态扩大，引向暴乱。乱吧！ 也许这就是天意。本来在他的生命中从无造反存身的位置，几十年的道路就是以不变应万变地适应中央。不管上头是个什么样的中央，总能有办法对付和讨好。他一直怀疑地看待耸恿他揭竿而起的人。刘亚基甚至要给他下跪，他也拒不参加他们今天举行的会议。但是现在怨不得他了，除了逼上梁山，还有哪条路能让他走?\n　　司机惊慌地回头看他。前面几辆汽车已经被暴民砸毁。燃烧瓶眼看就要扔到眼前，可满街的汽车一辆挤一辆，谁也不能动。黄士可打开车门，没有任何交代，立刻就消失在惊慌﹑激动﹑失去了理智的人群中。\n　　从一条小巷直插过去，只有几百米，就是澄湖宾馆。这个宾馆包围在一座古树掩映的大花园中。里面只有一栋不太大的三层楼。楼的外表普通，老旧的样式，里面却华丽之极，分成中式﹑西式﹑日本式﹑土耳其式几个不同的部分。这原来是省政府的小招待所，三年前交给刘亚基承包后才装修成现在的样子。刘亚基不指望以它赚钱，而是把它建成一个供各方首脑吃喝玩乐的据点。他贴了数不清的钱，得到的好处却多十倍。最近一段，这里成了福建民间势力政治活动的中心。\n　　刘亚基矮矮胖胖，一脸络腮胡子，刮得再干净也是铁青的颜色。当他看见黄士可突然光临，喜悦使铁青一下变成了黑红。\n　　“黄省长，我要给你磕头！ ”他双手抱拳连连鞠躬。要不是高耸的肚子碍事，脑门定能碰到膝盖。\n　　水晶宫似的西洋厅里围座着三十多个人。一大半是刘亚基一类的工商界人士，个个都是福建数得着的富翁。另一些是政局变化后逃到福建来避风的“温和派”分子。还有几个“民主派”\n　　头头，他们是北京对六四翻案参与者大规模逮捕的幸存者。一见黄士可，全场人像见到领袖一样站起来致敬。在这个时刻，这个地点，黄士可突然意识到自己具有了一种新的形像，不再仅仅是一个地方势力关系网中的玲珑牵线人，而成了一个政治核心，一名旗手，一种生活方式存亡的决定者和众人仰望依赖的带头人。\n　　他没解释为何突然光临。\n　　“你们接着谈吧。”他平淡地说，坐到中间的位置。平淡更增加了他出现的戏剧性。\n　　北京政权发布的一系列法令对福建和沿海几省等于是死亡判决书。其核心在缩减地方权力和打击私人经济，而这正是南方得以发达的两根支柱。首当其冲的是商业，尤其是私营商业。\n　　仅严禁经销进口消费品一项就将使上万家商店倒闭。商业税大幅度提高，明令不许摊入成本﹔规定了一系列限价措施﹔取缔所有私营商业批发业﹔走私者将受到枪决处置﹔震动最大的是对资产在三千万元以上的私人商业企业实行国有化。\n　　“......这帮北佬是要让我们死，而且是光着屁股死！ ”刘亚基充满仇恨和绝望。他是福建最大的私营商业老板，主要经营进口消费品。欧洲﹑北美﹑东南亚﹑港澳都有他的网点。所谓“进口”对他来说只是走私的代名词。谁也弄不清他到底敛了多少钱，虽然有相当可观的一部分换成了硬通货存在外国银行，但冻结存款的法令还是使他损失掉一大半财富，再加上国有化，多年建立起来的王国等于化为乌有。\n　　黄士可主管工商，他最清楚打击商业﹑进口和私营经济对福建意味着什么。福建山多地少，资源贫乏，从过去叮当响的穷省一跃成为举国称羡的宝地，全靠沿海的优越地势。买国货没必要来福建，每年从内地流入福建的几千亿元钞票大部分是冲着进口消费品来的，其中主要目标又是私营商业提供的走私品。只有走私才能价廉，才有竞争力。这条路堵死了，福建的财源就被切断。即使“六四”以后，北京方面控制再紧，地方也一直以种种对策保护走私。\n　　但这次不同，北京新政权完全甩掉了过去那种两个派系平衡出来的瞻前顾后，企图两全其美的立场，豁出来不要经济的发展也要贯彻集权意志，并且以法西斯手段粉碎一切拖延和阻挡。\n　　地方的自我保护已经不可能，而北京对国际舆论又充耳不闻，就连对外资﹑合资企业纷纷被吓退撤离的风潮也无动于衷。这又是福建另一个生死攸关的问题。商业是福建的血，外资是福建的骨头。福建缺乏自己的实业，全靠外资和合资企业奠定福建未来繁荣的基础。现在血干了，骨头再被抽走，福建岂不就只剩一摊烂泥。\n　　面临这种灭顶之灾，在座的工商界巨头全跟刘亚基一样激愤，大喊大叫，不时挥舞双手，敲打桌子。黄士可没有表情地看着他们。商人赔本儿的时候就是这么可笑，刀就要砍在脖子上了，他们还在那算帐。他不说话，不到最后，他不准备有任何表示。\n　　“还是谈下一步吧。”那位前任中央办公厅副主任文静地提醒。他是福建人，北京政局变化时正好在外地出差，便偷偷溜回老家，躲避北京方面的搜捕。\n　　在座的每个人──无论工商界老板还是“温和派”人士，或是民主分子，现在又包括了黄士可──都明白，只要和现在的北京政权联系在一起，只有死路一条，谁也逃不掉。多年以来，民间一直有人鼓吹“和北佬分家”，被北方拽着后腿，南方永远飞不起来。那时只是发牢骚，到底同种同根，不像立陶宛那么有理由。然而现在到了生死存亡之际，脱离北京独立就成了唯一出路。\n　　来避难的政界人士被老板们奉为尊师。他们搞出的方案显示出非凡的政治设计能力。市场经济和自由思想在南方深入人心，群众基础完全具备，连个体户小商贩也会为自身利益挺身而战。福建上有浙江﹑上海﹑江苏，下有广东﹑广西﹑海南，不乏同盟。国际对北京正在严厉抨击，会欢迎中国出现自由阵营。南方虽然缺少军事力量，另一种武器──钱却很充裕。除了让北方省份望尘莫及的地方财政，老板们自己也富可抵国。他们宁可倾家荡产也不能让中国再退回到只让他们当劳改犯的时代。一切都具备，只差一个领袖。\n　　“黄省长，领着我们干吧！ ”刘亚基扑到他面前。“你站出来一挥手，我们福建就得救了！ ”\n　　所有目光都期待地集中在黄士可身上。\n　　“黄省长，不用担心将来，昨天我说的事马上就办，加一倍……”\n　　“放肆！ ”黄士可在鼻子里哼了一声。\n　　刘亚基立刻不说了。但是他一定会办，而且一定会加一倍，甚至更多。也许明天，瑞士银行的存折就会递到他手里。如果他收了，刘亚基会感激涕零。黄士可没做出气愤的样子。生意人会看眼色，一定能看出他不再拒绝那笔“保险金”。别看在场的人一个个彼此打气，把前景说得天花乱坠，实际上谁心里都明白，所谓“独立”谈不到成功的把握，甚至只能用“渺茫”二字形容。这就是他一直缄默的原因。他走到今天这步不容易，一辈子搭进去了，本来绝不该再冒孤注一掷的风险，一切从头开始。不管多么百孔千疮，共产党的力量仍然足以粉碎任何反叛。那架机器那么沉重﹑高大﹑坚不可摧，让人望而生畏。多少个比他更强有力的人都被无声无息地碾碎。刘亚基那群老板准备下二百万美元，只要他答应挑头搞独立就是他的。即便失败，这笔钱可以保证他在西方过上富翁生活。昨天他没接受，人愿意在老路上走，尤其到了现在的年龄。今天，二百万的一倍变成四百万，多少能弥补一点对未卜前途的恐慌，也说明时机有时是多么有价值。\n　　现在，是登场的时机了。\n　　“我不赞成独立。”他缓慢地说。\n　　全场人都变了脸色。\n　　他看着对面那根高大的象牙沉默一会，拖延可以给人更深刻的印象。\n　　“福建是中国的一部分，这是谁也不可改变的历史和现实。我们福建并不要求独立国家的主权，那是对民族的分裂和叛逆。我们只要求保留适合于我们的生活方式和发展道路。在一个国家内部，可以同时并存多种社会模式。邓小平同志生前的天才设计——一国两制为此提供了理论和现实的依据。既然可以有香港的一国两制，台湾的一国两制，为什么不能有福建的一国两制呢？北京是国，福建是制。福建不破坏国家统一，只要求给我们一个制。这个思路应该是我们全部设计的出发点。”\n　　停顿片刻，那位前中央办公厅的副主任最先拍响两只保养很好的手，眼里流露出赞许的笑意。\n　　掌声立刻热烈地扩散。人们全都兴奋地频频点头。\n　　“好！ ”\n　　突然响起一声喝叫，好象京剧里的花脸出台亮相。顿时全场鸦雀无声。这一喝不出自在座任何一个人，而是从厅外传来。镶着铜饰的象牙色厅门打开，一个高大魁梧的身影站在门口。\n　　黄士可脸上剎时失去血色。他无法相信，只能是幻影——新省长！ 这个克星怎么会出现在这里，脸上带着傲慢的狞笑，怎么可能？他瞥一眼别人，不是幻影，每个人都像见到魔鬼一样瞪大眼睛。瞥一眼窗外，院门紧闭，警卫悠闲地晒着太阳。如果他从大门来，警卫肯定先给铃。如果不是，他从哪来?\n　　“好！ ”新省长又吼一声，盯住黄士可。他四十出头，满脸红光，吼起来震得玻璃嗡嗡响。\n　　“黄副省长，我一直等着你的这段话。从我来那天就等着，本来以为你得去北京说了，你倒又自投罗网，没让我白等。哈！ ”\n　　他一个挨一个巡视，不断地发出心满意足愉快的叫喊。“哈！ 副主任先生，中央找你多时了，你的架子不小啊！ ”他认得在场的每一个人，挨个调笑，就像猫在玩一群瘫软的耗子。他可不像黄士可想的那样，对福建情况一无所知。他似乎什么都知道，他有充分的准备，他一直在安排一个大网，现在网收口了。\n　　原来是他！ 黄士可瞥见了在新省长身后缩头缩脑露了半个身子的秘书长，他就是眼前这张网的穿线人。儿子的材料肯定也出自这条狗。黄士可猛然醒悟，地道！ 这座楼下面有一条地道，直通省政府办公大楼。那是文化革命时期挖的防空洞，多年不用，早被人遗忘。黄士可只是依稀记得，在他当秘书长的时候，曾听说过这条信道。钥匙扔在行政处的钥匙箱里。他当时只说了句“我们永远不会用它”，现在才知道还能发掘出如此大的用处。\n　　“秘书长！ ”新省长叫。“给卫戍区打电话，调一个连来。别忘了带囚车！ ”\n　　新省长七十年代当过侦查排长，曾经独身一次俘虏三十多名越南兵，立过一等功。眼前同样是三十多个人，却更不是他的对手。他让刘亚基给每个人发一份笔和纸。\n　　“马上写材料！ 谁写得快，写得细，揭发得多，谁就得到能宽大处理！ ”新省长拍拍腰，不知只是一种兴奋的表示，还是在表示他腰里有枪。“老老实实呆着！”\n　　新省长出去了。也许是去搜查别的房间，也许是太高兴了，得意忘形，反正他这一出去给了黄士可一个决定性的机会。\n　　“把砸银行的人调到这来！ ”他用闽南话低声吩咐刘亚基。“让他们告诉群众省长在这，解决问题得找省长！ ”\n　　“砸银行……？”刘亚基表情不自然，有点不知所措。\n　　“嗨，这时候还要什么花枪，快！ ”黄士可紧皱眉头。刚才在街上，他认出冲进银行的暴民中有刘亚基的司机在指挥。老板们肯定参与了幕后操纵和鼓动。司机的左右有好几个人带着对讲机。街两边也停着配备电话的汽车。对老板们来讲，事端挑得越大，冲突越严重，越有利于下一步。\n　　刘亚基立刻悟到这是摆脱困境的方法，至少能拖延时间。操纵打砸抢的事虽然不适于公开，现在已顾不上了。他迫不及待地拿出对讲机，一头钻进卫生间。\n　　当载着卫戍区士兵的卡车开到时，群众队伍也刚好赶到。人群顷刻间把澄湖宾馆围成一个孤岛。一眼望去，四面全是翻腾的人头。“见省长！ 见省长！ ......”三个字喊得如同山崩地裂。\n　　士兵的任务临时变成保卫，围着宾馆小楼站成一圈儿。他们的姿态引起群众敌意。石块纷纷飞进院子。人群先是从四面院墙往里翻，很快大门被撞开。好象决口的洪流，人群一下挤满了院子，把所有花树踩在脚下，和士兵的警戒圈面对面地对峙起来。院外喊声震天，院内反而静下来。\n　　走廊传来秘书长战战兢兢的声音: “省长，快走吧......”\n　　“走？”新省长的语气毫无怯意，仍是那么骄横自负。“这些人是要试试到底省长怕他们，还是他们怕省长。打开阳台门，我要让他们看看到底谁怕谁！ ”\n　　隔壁传来“光况”一声，院外的喊声也随之停住。黄士可稍微偏一个角度，就能透过窗子看见新省长昂首挺胸地站在楼正中的大阳台上。\n　　“我就是省长。”新省长的声音宏亮悠长，他的笑容真诚动人，尤其是他的勇气，一下就镇住了千千万万的群众。“你们要见我，我也要见你们......”\n　　黄士可向全屋人一挥手。\n　　“跟我走！ ”\n　　三楼东头有条很少用的小楼梯，一直通到地下室。在一套废弃的锅炉后面，一道常年紧闭的铁门打开着。里面是一条水泥信道，亮着一串暗黄的灯，扑出一团团潮湿阴冷的霉气。信道内停着一辆深红色的奔驰车，钥匙插在点火锁上。\n　　“不要动车。”黄士可吩咐众人。“一直走下去就到省政府。”\n　　众人急匆匆地走进信道，都有一种死里逃生的感觉。\n　　“亚基，你跟我回去一趟。”黄士可说。“拿一枝枪”。\n　　刘亚基没装糊涂，马上从一楼日本套间的壁橱夹层里掏出一枝手枪。私藏枪枝违法，但有点钱的人全从黑市上买。黄士可不用问也能知道刘亚基私藏的枪不只这一枝。\n　　“我不会用。”黄士可没接那枝枪。“你上一颗子弹。”\n　　眼前的玻璃被群众刚扔的石块砸了一个洞。黄士可藏在窗帘后面向外看。窗下是士兵的后脑勺。几米开外便是群众的脸，一张挨一张，仰望阳台上的新省长。\n　　新省长的声音像瀑布一样从头顶滔滔泻下。\n　　“......跟国家对抗是没有好处的。你们绝大多数人都是受了挑动和蒙蔽。我已经有确凿的证据，有人在幕后操纵动乱，他们要把你们引向歧途！ 你们跟着他们跑，福建就会被引向灭亡......”\n　　黄士可侧身让开自己的位置，示意身后的刘亚基上前。\n　　“向那开一枪。”他低声说，伸出一个指头指一下窗外的群众。\n　　刘亚基微微变色。\n　　“向上打？”\n　　“不，向人打。”\n　　“这......”\n　　“马上开枪！ ”黄士可的声音冷冰冰。\n　　刘亚基窒息一样地咽了口唾沫，颤抖地把枪口对准玻璃上的洞，闭上眼睛。\n　　头顶的声音还在向下倾泻。\n　　“………做为省长，我决不允许你们破坏自己的家园，也决不会背弃国家给我的命令！ 幕后操纵者逃不脱惩处！ 继续闹事者必将受到镇压……”\n　　“砰”\n　　枪的响声在黄士可耳中变成一道细长的尖叫。他看到正前方人群中一个小伙子惊讶扭曲的脸。一股急速的血流从他胸口高压喷泉般奇异地射出，随着身体扭动浇洒出一道自下而上的轨迹。\n　　刘亚基像受惊的免子窜向地下室。黄士可捡起他扔在地上的手枪。外面是绝对的寂静，连那个会施催眠术的新省长也成了哑巴。当黄士可迈过地下室那道沉重的铁门，外面突然爆发出地震一样的轰鸣。所有的玻璃似乎都在同一时刻破碎。怒潮猛冲进楼房。楼房在咯咯颤抖。\n　　他关上了铁门，把插在门上的钥匙拧了一圈。缺油了，他这样想。"
		},
		{
			"post_id": 19,
			"title": "《黄祸》15",
			"date_published": 1460987304.878,
			"body": "　　山西省仙人村\n　　在那两个乳房之间，汩汩冒出滚烫的血，染红了无边的大地和天空。\n\n---\n　　每扬起一铲谷子，石戈就感觉自己像那些谷粒一样在清风中飞起，均匀地散开，让风吹走碎草﹑糠皮和灰尘，干干净净地落在那堆在阳光下金灿灿闪光的新谷堆上。汗水痒痒地在身上流。太阳暖融融。空气中充满庄稼成熟的香气。他像入了迷一样陶醉在往复的机械动作中，很久没有过这么愉快的感觉了。\n　　干得不错。他审视着扬起的每一铲谷子。三十年前在这个村插队的时候，全体北京知识青年中只有他能干扬谷子的话。谷子轻，扬重了会被风刮进糠堆，扬轻了又不干净。当年为了练这门把式，他跟桂枝爹学了整整一秋。\n　　袖珍收音机里传出的二胡曲优婉回旋。他呼吸着乡间空气，内心深深地叹息。是不是该永远这样生活？在这种明朗安宁之中，连苍蝇的嗡鸣都令人感动。这个问题不是第一次提出了。\n　　离开仙人村二十五年，回来了七次，每次来都问，然而每次又都急匆匆地离开，赶回喧嚣忙乱的都市。忙碌被今天的文明视做判定人生价值的标准，人生追求的进步似乎就是不停的变易。忙来忙去，理想却似乎离得更远。身不由已的忙乱不仅产生异化和邪恶，而且剥夺了人和自己内心独处的美德。所有交流功能都用于对外，看﹑听﹑说﹑读，无穷无尽，永无空闲。\n　　心灵只是一个泵血机器，人生成了一堆事务的堆砌。到头来一片悲哀的空虚，一无所有，只见稀疏的头发落叶般飘零。\n　　他已经是几下几上了。这么多年，虽然尽力油滑和玲珑，可在根本的问题上，他几乎总扮演一个唱反调的角色。那些人都叫他“黑乌鸦”。只要他一叫，就有灾难要临头。当他们欢欣鼓舞的时候，他那不吉的叫声让人分外恼恨，而事实总是证明“黑乌鸦”比他们高一筹时就更令一些人不能容忍。想打发掉他这只“黑乌鸦”的人不是一个两个，这次隔离审查就是一个总攻。本来确实打中了要害，连他手下的小乌鸦也可以一块被拔光毛。可他冷不丁打出个总书记，让他们一下缩回手。审查马上就结束了，只做出一个处理──解散十六号机关。虽然出气不够，主要目的已经达到。他们不往深问，免得明知总书记是后台却对着干，抢在总书记视察回来前处理完，等总书记过问时就演戏──谁也不知道内幕。这正是石戈希望的，是他“唬”出来的，真请示总书记就会糟糕透顶。他没有保住十六号机关的奢望，只要不连累太多的人就是最好结果。他和机关里每个人最后握一次手，便上了最早一班来山西的火车。\n　　和过去一样，这次仍然住在桂枝家。桂枝爹是当年的生产队长，他是北京知识青年集体户的户长，打架打出来的交情，倒成了亲人一样。桂枝爹老了。桂枝妈死了。桂枝以前住在婆家，现在被丈夫赶出了门，回了自己家。这次他住得最长，一晃十几天了。他每天除了帮桂枝家干点农活，就是在附近的田里坡上一个人转，看天，看夕阳，听鸟叫，数南飞的雁。\n　　以往每次下台，用不了多久，上头又会把他召回去。事情往往按照他的预言发展。他所批评的那些喧嚣一时的“热门”方案最终也大都落个难以收拾的结果。许多关口看上去似乎过不去了，所有的办法都使绝了，所有的人都退却了，把他找回来，到最后却总是能解决。这更使他招人恨，但又是不能不重新启用他的原因。他并不期望成为明星，能做别人做不到的事本身就足以使他满意。开始他总是力图做得最好﹑最快﹑最有戏剧性。但逐渐，这种浅薄的虚荣使他厌烦。推动他不得不做下去的是更沉重的责任感。怎么办？不能眼看货币体系垮台，不能静等抢购浪潮席卷全国，不能任凭企业纷纷倒闭，千百万失业者的孩子嗷嗷待哺。然而现在，他觉得这种责任感也是一种虚假，甚至是犯罪。早期的危机好比让社会在泥沼里陷住腿，只是难以行动。然而帮它拔出腿，却没改变它的方向，它便会继续往泥沼深处走。再陷下去就没到腰。每次拉出它都等于促进它不断往下走，越陷越深，直至没顶。这种责任感和谋杀有什么区别呢?\n　　昨天，桂枝爹喝着酒说：“你这么有本事的人，上面保准儿还得让你回去。”\n　　他摇摇头。“这回跟过去不一样。……就算叫我回去，我也说什么不回了。”\n　　桂枝的眼睛亮闪闪。“你现在这么说吧。”\n　　“真的。我回去有什么用？大厦将崩，一木难扶。何况我也不是木，只是根苞米杆。”他觉得自己喝多了，舌头有点硬。\n　　石戈把木铲插在谷堆上。风越来越小，几乎已经静止。收音机里换成了新闻。他靠着谷草堆坐下，卷起一支老旱烟。多年不抽了，一回乡下就开戒。这些天从早到晚，每次报告新闻他都不放过。\n　　播音员一改这些年流行的亲切自然的语调，又像过去那样激昂亢奋起来。头条新闻还是关于暗杀总书记的凶手的。情况已经查清：凶手是三峡工程管理局的公安处副处长李克明。在总书记视察大坝时，凶手从巡逻直升机上用事先藏在机上的手枪杀害了总书记。据调查，凶手是黑龙江省黑河市人，祖父一家六口人当年被日本侵略军杀害。暗杀动机可能是出于对“中日经济合作区”的不满，从凶手逃脱的情况分析，很像是有严密的组织接应。目前已展开全国范围搜捕。举报者可得奖金二千万元。\n　　不在北京，内幕他都不清楚，但是陆浩然能这么顺利地继任总书记，说明这个暗杀不可能像报道的那样简单。“强硬派”路线已经开始全面扭转“温和派”过去的作为。收音机里一条条宣布爆炸性的新决策：废除“中日经济合作区协议”; 暂停偿还欠日本债务; 要求把中国欠日本的债务与中国过去放弃日本战争赔款联系在一起考虑;取消特区和沿海各省的特殊政策; 征收重赋救援黄河灾区﹔地方财政一律上缴国家﹔所有产品实行国家限价﹔农产品恢复统购统销﹔材料和能源实行配给制……\n　　在中央高层的斗争中，石戈不属于任何派系，他的十六号机关也一直保持中间色彩。自打改革开放，中国始终在二元状态之间震荡。经济上崛起了一个现代化部分，它的规模远不能吸收整个经济，然而却以种种优势压迫非现代化部分不断瓦解，又以反弹回来的冲击毒害自身。\n　　政治上，放松控制和加紧控制交替主导，“温和派”和“强硬派”我上你下，斗争不休。这种二元对立的因素互为破坏地起作用，使社会缺乏稳定和连续，常常是进一步退两步，陷入“一放就乱，一统就死”的两难境地。照石戈看，在这种二元状态里打转是永远找不到出路的。要么一元紧，要么一元松，要么一元计划经济，要么一元市场经济，要么一元自力更生，要么一元开放门户，要么一元公有制，要么一元私有制。结合二者优点而去掉其缺点的中间选择是没有的，只能生出集二者缺点之大成的怪胎。而本质上，共产党不可一元松，只可能一元紧。这是它维持自身独裁的根本前提决定的，所以“温和派”不可能彻底温和，也不可能解决矛盾。共产党的最终发展必然是到今天这步，一元紧──即全面的法西斯统治。\n　　桂枝带着空口袋回来了。石戈把扬好的谷子装进口袋。两个人不用说话，谁该干什么都很清楚。桂枝跟他挨得很近，脸不时被她的头发磨得痒痒的。她每一弯腰，半月形向下弯曲的裤腰便微微张开，似乎偏一个角度就能看见里面什么。石戈抬起眼。隔着低洼的平地，远处就是那片山坡。当年那里有茂密的青草，如芬芳软床，有浓密的树荫，遮挡骄阳。现在，无树无草，一片焦黄。水土流失使它变成一片破碎的土林，如无数向天崛起的干枯阳具。\n　　当年就是在那，桂枝给了他第一次。她尚未完成发育的身子倚在垂满绿草的坡坎上，叉着白嫩双腿。她只有十五岁，却充满热狂和期待，紧紧抱住晕眩的他，用粗糙的小手在行地将他们引导在一起。\n　　为当年那些日复一日的姿意欢乐，为那些阳光﹑山坡和树草之间的迷醉，他感谢桂枝。每当他想起仙人村，就有青春的欲望在那里荡漾，就有在他上大学时桂枝那泪如洗面的影子，如同在泉水里波动。他回来七次，每次桂枝都从几十里外的婆家赶回来见上一面，或是相对无语，或是像生人那样一问一答。他不想提过去，他想在脑子里永远留着个十五岁的桂枝。可这次……\n　　“哪个死狗藏在那，还不滚出来！ ”桂枝向谷垛后面喊。\n　　锁柱咧着嘴走出来。\n　　“我看你和石哥干啥哩，别把你们搅了。”\n　　“搅啥？我撕你的狗嘴！ ”\n　　“哎哎，二姐，石哥可是大干部了，看不来粗的……”\n　　当年锁柱还是个抹鼻涕的脏小子，现在又高又壮，满脸黑胡茬。上个月他领头把征粮的乡干部打断了腿，又把前来抓人的县公安局警车翻了个儿，村里老少就选他当了村长。\n　　打闹一阵儿，锁柱做出村长的严肃相。\n　　“二姐啊，你们得抓紧打场，赶快把粮食入库。昨天灾民把八里堡抢了，场院上的粮食一颗不剩。咱们也得防备着。你说呢，石哥？”\n　　“哪来的灾民？”石戈问。\n　　“嘿，也说不上是哪的，叫他们灾民就是了，其实跟土匪没啥两样。哪来的都有，聚起一帮人就抢。仗着人多，谁拿他们也没招。行，你们抓紧，我还得去商量联防的事。”\n　　锁柱走了。为了防止灾民抢劫，周围几个村联合成立了保乡团，由各村青壮男子组成，哪个村有情况就互相支持。这些天各村铁匠炉打了不少大刀长矛。藏了不知多少年的老炮铳子﹑火药枪也找出来。还用粮食在黑市换了几支八八式手枪，锁柱裤腰上就掖着一支。\n　　收音机里正在播送人大常委会刚公布的反囤积法。如此多的法律措施同时出笼，少说也得有半年以上的准备时间，只有军委那套班子有这个能力。虽然迄今为止出头露面的全是文职政府，但石戈却时时能感觉军队的巨大身影站在后面。没有铁腕，想做这样彻底的改变是不可能的。\n　　权威是中国社会几千年用以维系统治的核心。丧失权威就是丧失统治的力量。这种古老结构在现代世界遇到了不可解决的难题：权威越强大社会肌体就越无活力，国家也就越衰弱。现代世界是个经济世界，政治可以靠权威稳定，经济却只能被权威扼杀。世界大潮的驱使和盼望“黄金国”的英雄梦使权威者推行改革，改革的本质却是削弱权威，才能释放活力，刺激经济。晚清朝廷的改革比各朝代的改革加一块还多，却成了它垮台的原因。那次权威的丧失造成了其后数十年军阀割据﹑连年混战。靠着蒋介石﹑毛泽东一类的英才和奸雄，加上几千万条人命才使权威重建。至少从统治的角度来讲，共产党的短视在于它曾把保住权威放在了发展经济之下。不管是出于自大还是出于冒进﹙二者都是它的老病﹚，权威在“改革开放”之中遭到的损害不比满清王朝覆灭前更小。那时只是政权的崩溃，现在则是权威在每个人心理结构中的丧失。前者出了个毛泽东又可以重建万众一心的铁桶江山，而几千年积淀成型的对权威的天然崇拜来难去易，一旦丧失就是覆水难收。这时重新乞灵于权威，除了枪杆子再没有别的。掌握枪杆子的军队就成了唯一的权威。\n　　假如未曾松过的话，紧可能确实会使中国社会维持的时间长一些。然而曾有过的松是瓶里的魔鬼。改革开放在中国产生出的不可控制力量已经太多了，能量太大了。整个社会正在向山下势不可挡地轰轰滚去。阻挡的力量越大，产生的震荡越强，二者势必共同粉碎。如果不阻挡，下面却又是万丈悬崖。看来已经在劫难逃──不管是松是紧，是一元是二元，结果都是一样要灭亡。\n　　那个“大的”越走越近了。这些年，他时常感觉到它。开始只是在梦里，后来白天它也光顾，而且越来越频繁。它无形，但是它巨大，大得没边才无形。它无脚，但是在逼近，近得太近才看不见脚。它一步一步，无声无息，却地动山摇。他觉得它的呼吸像风一样。它无形的眼睛像深长的山洞，里面奔腾着无数龙蛇虎豹，全张着血盆大口。\n　　“石哥，”桂枝摇了他一把。“你咋了？”\n　　“没什么。”“大的”消失了。村庄笼罩着炊烟。\n　　“回去吧，该吃晌饭了。”\n　　“我再干会儿。饭好了喊我一声。”\n　　“我可背不动这袋谷子了。”\n　　石戈看桂枝一眼。平时从未听过她说这种话，年轻时比得上小伙子，现在扛个一二百斤也可以走得跟风一样。和桂枝的眼睛一接触，他心里灼了一下。那眼里的火似能把他烧化。\n　　他要扛起谷子，桂枝又不让。\n　　“你帮我扶着点就行。”她总怕累着他。他只好硬抢过来。\n　　收音机里一个男播音员针对全国性的拒绝交售公粮发表评论。他的口气不容置疑：粮食和空气﹑阳光一样，是全社会所有人生存所必需的。耕种者占有土地﹑生产粮食是社会分工不同。\n　　这种分工不仅不代表权利，而且只能代表义务。所以任何一个耕种者都没有拒绝与社会全体成员分享粮食的权利，只有提供粮食的义务。\n　　被阳光晒热的谷子舒适地压在肩上，桂枝笑盈盈地走在一旁。今年收成还算不错。每家农户都算了又算，尽可能多存一些粮食。这些年连年歉收，搞得人心惶惶。黄河水灾离这上千里，大饥荒的传闻却早就过来了。农民既为将来保全家老小的肚子，也看准了粮价飞涨的势头越来越强。粮食攥在自己手里时间越长，赚的钱就将越多。\n　　在传统社会里，十分之九以上的人民勒紧肚皮，消耗最少的资源供养一个穷奢极欲的上层。\n　　安于“穷命”的底层意识和贫困保证的死亡率使那种社会与资源的关系可以保持相当稳定和平衡的状态。社会主义培养起了全民平等的意识，改革开放又把社会主义的平等贫困变成了商品社会对平等暴发的追求，每人对资源的需求顿时要乘上一个巨大的倍数。当十亿农民全力以赴地投身到这场索取的比赛中时，中国的资源体系就不可避免地敲起了丧钟。虽然已经离开了注视这类宏观问题的位置，可想到这里，石戈心里还是说不出的沉重。\n　　“爹，该吃晌饭了。”路过打寨墙的人们，桂枝向她爹喊。\n　　桂枝爹正在指挥施工。“做好饭再叫我。”他连头也没回。\n　　过去为了防土匪，仙人村有过一道又高又厚的土寨墙。共产党掌权以后，几十年没土匪了，寨墙也塌得差不多。现在，为了防备灾民抢劫，村里各家又派工摊钱地重把寨墙修起来。\n　　村比过去大多了。许多家都搬到了寨墙外面。桂枝家最远，紧靠公路。等寨墙修好，各家都要搬进寨子，至少先把这段风头躲过去。公路上空空荡荡。近来治安越来越乱，几乎没有敢单个跑长途的司机。远处山梁上，一队卡车像玩具模型一样从公路尽头向这边驶来，拖着细小的烟尘。司机们相互结伴壮胆。公路上要么没车，要么一过就是几十辆，甚至上百辆。\n　　桂枝帮石戈把谷袋放下，转身反挂上仓库门。仓房里黑乎乎的，只有通气孔射进一束阳光，照在黄澄澄的玉米上。\n　　“石哥，我可想你了。”桂枝抱住他，把脸靠在他肩上。\n　　桂枝的头发还是那样乌黑，散发着阳光和干草的香气。粗糙的手跟当年一样刺激他，好似电流在神经网络里酥痒地放射。他本来不想再迈过这一步。桂枝已经不是三十年前那个野花一样的小姑娘，而是一个结过三次婚而且现在还有丈夫的农村妇女。可是昨天晚上，可能是酒喝多了，桂枝的眼泪终于融化了他。打来的第一天，他就看出桂枝在等着，从欢乐变成孤苦，变成偷偷哭泣，直到昨夜他抓住她的手，她才捶打着他哭诉：“我恨你，我恨你……”\n　　桂枝结实的双乳像插着红枣的白馍在刚打开的笼屉中散发热量。她的腹部平滑光亮，没有城里女人的脂肪和赘肉。从未生育使她被三个丈夫拋弃，又使她不像其它农村妇女那样早衰。\n　　黑暗的仓房，金黄的玉米，温热的谷袋，正照在桂枝乳房上的那束阳光，这一切都更比软床﹑香水和带流苏的窗帘使石戈沉醉。\n　　是不是该永远这样生活？他又在想。一个遥远的呼唤悠悠回旋，在一片怒海般的激情中，那么纤细，又那么清晰，从最底层飘渺升起，侵入飞扬的灵魂。\n　　当他们最终瘫倒在玉米中间喘息的时候，听到汽车在很近的地方停下。一连串人从卡车上跳下的“扑咚”声，像砸在心上。\n　　“快穿衣服！ ”他低声对桂枝说。\n　　“老乡！ 老乡！ ”外面喊起来。人很多。脚步声走近。“家里没人。”一个声音说。“打开谷仓。”另一个声音命令。\n　　桂枝推开仓房的门。\n　　“你们要干啥？”\n　　门外是十多个穿工作服﹑戴安全盔的工人，每人都持着枪。老式的帆布子弹袋上印着“工人民兵师”字样。卡车一辆接一辆驶来，分别停在不同的农家门口，跳下成群的武装工人。\n　　“大嫂，”戴红头盔的头头说，刚才命令打开谷仓的就是他。“我们是来买粮的。”\n　　“我们的粮不卖。”桂枝用身子挡住仓房门口。\n　　看来头儿知道多费唇舌也没用，他微微叹口气。\n　　“我们知道你们不卖，但是我们一定得买。我们不会让你们吃亏的。”\n　　他摆了一下头。两个工人走上来。\n　　“对不起了，大嫂。”他们一下架起桂枝把她从仓房门口拉开。\n　　“我操你们妈呀！ ”桂枝的两脚乱蹬，在那两个工人手中，像被抓住翅膀的小鸡。其它工人无言地准备进入仓房。\n　　石戈出现在门口。他的目光使工人停下。\n　　“你们是哪个单位的？”\n　　“大同煤矿。”头儿回答，猜测着石戈的身份。\n　　“把她放下。”石戈对抓着桂枝的那两个工人说。工人服从了。桂枝骄傲地挺起胸。\n　　“谁让你们这样做的？”石戈问头儿。\n　　“谁？”头儿在肚子上拍了一巴掌。“谁说话还有它管用？我们全矿三万多家已经一大半没米下锅了。”\n　　石戈在北京时就知道今年秋粮收不上来，黄河水灾以及随之四起的谣言在全国引发了囤积风潮，城里的粮店被抢购一空，国库那点储备无济于事，但他没料到现在已经开始断顿。\n　　“政府会为你们解决。”他说这话时一点也不自信。进口粮食只是杯水车薪。唯一能指望的是今年的新粮，可新粮如何从农民手里拿到国家手里正是最大的难题。公社时期，各级干部可以把农村的每一粒粮都抠出来送进城，而如今，六十年代那种饿死二千万农民保城里人肚子的事再不会有。粮食在农民自己手里，别说政府，天王老子也没法命令他们。\n　　“算了吧，老师傅。”头儿露出轻蔑神色。“说好听的填不了肚子。”\n　　“可也不能抢。”\n　　“我们不想抢。老师傅，我看你也像个城里人，闹不好还是个干部什么的。你倒是帮我问问，他们到底要什么？我们工人不想当什么老大哥，可以叫农民爷爷奶奶，磕头也行，只求让我们妻儿老小能活下去。我们把工厂拆了。我们的卡车上有电机﹑水泵﹑柴油机﹑轮胎……你看这个白金坩锅，他们全村也值不了它。我们把城里财富全给农民，只求换点粮。”\n　　“可是得按法律来。”\n　　“人大常委会公布的反囤积法已经给了我们合法性。”\n　　“法律得通过国家实施而不是你们个人。”\n　　“等国家实施法律的时候，我们早饿死了，国家也亡了！ ”头儿的脸一沉。“没时间废话了，搬粮！ ”\n　　“再听我说一句。”石戈挡住要进仓的工人。“你们想过没有，你们今年抢了农民，农民明年就无法再种粮。过了今年过不了明年，从长远看害了全社会，也害了你们自己。”\n　　“明年饿死也比今年多活一年！ ”头儿的声调已经相当严峻。“让开！ ”\n　　石戈看一眼桂枝。她毫不在乎眼前这群拿着枪的大汉。有她一个石哥在，天塌下来也顶得住。\n　　石哥是中央的大干部，就算下了台，也是瘦死的骆驼比马大，制住这群小工人还不是动动手指头的事。可石戈内心一点抗争的气势也没有，像塞满了乱糟糟的麻线。工人说的话句句是真的。法西斯上台有它的必然性。在这个生死之际，唯有强力能重建分配的平均机制，让每人都得到吃不饱但是饿不死的一份，而不是一些人饱，一些人死。他无法要求快饿死的人遵守法律，也不可能阻挡住他们的行动。他们的女人也跟桂枝一样需要粮，甚至更需要。他们的世界只有煤，而仅仅这几天，他就帮桂枝家埋了六大缸粮食，即使谷仓空了也够她家吃一年。\n　　“桂枝，卖给他们一些吧。”石戈说话的同时身体挪动了一下，几个工人立刻拥进仓房。\n　　桂枝被他这个动作惊呆了，甚至工人来抢粮的事实本身也没让她这样震惊，半天才哇一声哭出来。\n　　“石哥你……你好没良心啊……当年你怎么说的？你说你一辈子为我们农民说话，……现在你当了大干部，你让人家抢我们……”\n　　两个工人把石戈刚扛回来的那袋谷子抬出来。\n　　“我跟你们拚了！ ”桂枝冲上去，整个身子扑在那袋谷子上。谷袋掉在地上，她死死抱住，又咬又踢。好几个工人费了半天劲才把她拽开。撕扯中衣扣掉了，裤带开了。她就势把衣服一脱，全身赤条条，工人反而不敢拽了。另一批工人刚从仓房里搬出小麦，被她追得扔下袋子纷纷乱跑。\n　　石戈看着像母兽一样疯狂的桂枝。那对在奔跑和扭打中甩动的双乳残留着他刚才揉出的红印。结实的大腿之间在阳光下闪着精液的光亮，像永不放弃的标记印在他们刚刚当成欢娱之床的粮袋上。他的心好似刀割一样。他该怎么办？他能怎么办？除了呆呆站着，他什么也想不出。当年当知青时可以只想一面，现在的思维习惯已经成了随时考虑所有方面，而考虑的越全面就越没有办法，就越无法找到一个行动准则。也许这就是他这些年来日益无能为力和灰心丧气的原因吧。\n　　突然听到呼唤：“石戈同志在不在这里？石戈同志在不在这里？”\n　　声音来自天空。不知何时，一架直升飞机悬在头顶，一边缓缓降落，一边用扩音器呼叫。\n　　石戈向直升机透明的机舱挥挥手。他对这突如其来的呼唤已经习以为常。许多假期如此中断，无论他藏在哪都能被找到。然而他今天已没有任何职务，又有什么事找他呢?\n　　飞机降落在五十米外的空地上。灰尘弥漫天空。\n　　“石戈同志，请到飞机上来。总书记要与你通话。”飞机扩音器的声音非常清晰。\n　　工人全用异样的眼光打量石戈。\n　　他走到桂枝身边，给她披上衣服。她嘤嘤哭着，身上全是土。脸上泪和土混成泥水。他没说话，径直走向直升飞机。\n　　机上一个武警少将向他伸出手。\n　　“我叫周驰。”\n　　周驰让通讯军官把机上的电视电话接通北京。电视屏幕上出现陆浩然的秘书，问清情况，屏幕上画面消失，只剩闪烁的光点。突然一亮，陆浩然坐在办公桌后面。\n　　“石戈，”陆浩然从表情到声调都不像前总书记那样骄横，很平等，甚至有些亲切。“有一个职位我想让你担任，不知你是否有兴趣？”\n　　石戈叹了一口气，涌到嘴边的话是“我够了”。他觉得脸上的皱纹无比深密。就像站在桂枝和工人之间一样，那一刻他所感到的无能为力似乎打断了全身筋骨，象征着他的一生。多少年奔波于“职位”两字之间，现在只感觉是那么厌恶。\n　　出口的却是一个提问：“什么职位？”也许只是最后一点好奇，在彻底退出官场前看看自己最后能得到的是什么。\n　　陆浩然的回答轻描淡写。\n　　“副总理。”\n　　心跳骤然加快了。副总理！ 以往只在少年时的梦中出现。如今他已心如死灰了，不再做奢想，却突然飘忽而至，在这么一个最不可能的时刻，最不可能的地点。\n　　周驰微笑地看着他。机舱外的太阳已经西斜，黄色的田野山坡在秋风中起伏。\n　　他够了吗？他疲倦了吗？在此刻，突然感到是血在翻腾地卷起，心灵间充满渴望。够了倦了的只是过去，展现在前面是一个全新末来。再不是招之即来挥之即去的谋士墨客，而是阿基米德撬动地球的支点，如果握到了他的手中，他能不能由此改变中国的历史呢?\n　　“怎么样？”\n　　陆浩然在屏幕中凝视着他。\n　　只要他口中吐出一个字，他的人生就会飞向两个极端。或是在这片被破碎的黄土地上埋葬掉寂寞的雄心和英豪，或是一步迈进轰响的历史，被那车轮带向一日千里的前方或碾做粉尘。\n　　“好。”他的回答听不出任何犹豫。\n　　“马上来吧。”屏幕一闪，缩成一个亮点。陆浩然消失了。\n　　石戈抬起头。他的精神还无法回到眼前。\n　　“副总理，我们马上起飞。”周驰向他说。\n　　“我告一下别。”\n　　“不行，这里要有战事。”\n　　话音刚落，传来一声火枪的轰响。几粒铁砂擦在飞机上，划出尖锐刺耳的声音。桂枝家门口那些工人立刻卧倒。四面传来喊杀的声音。\n　　“我得下去。”石戈伸手拉舱门。\n　　周驰伸出一只手顶在舱门上。石戈用全身力气也摇不动半分。\n　　“总书记命令我负责你的安全。”\n　　飞机已经飞起来了，摇摆着升高。吹起的灰尘纷纷扬扬。石戈看见伏在粮袋上的桂枝突然站起仰望飞机。四面，无数举着锄头铁叉的农民包围了工人车队。锁柱挥着手枪指挥一排持枪的保乡团射击。\n　　桂枝变小了，但她绝望的表情在石戈眼里比什么都清楚。她向上伸出双手。飞机轰鸣使她的呼喊像是无声。披在身上的衣服脱落了。一个工人想拉她卧倒，可她竟跟着飞机跑起来。\n　　石戈大吼一声。\n　　她突然一个踉跄，摔倒在公路上。她挣扎着翻过身，已如模糊白点的脸向着飞机飞走的方向。\n　　她的胸脯上扩散出一片殷红。虽然人的视力已不可及，石戈却清清楚楚看到一个又圆又深的弹孔，在那两个乳房之间，汩汩冒出滚烫的血，染红了无边的大地和天空。"
		},
		{
			"post_id": 18,
			"title": "《黄祸》14",
			"date_published": 1460974637.946,
			"body": "　　北京中央军委总部\n　　这是王锋最满意的一手，在把“温和派”全盘打垮的同时，让“强硬派”也跟着垮台，只剩下陆浩然一个光杆。\n\n---\n　　王锋是中央候补委员。三年前那次代表大会，他只是国防科工委一个年轻主任，给个候补就算照顾了。中央办公厅没通知他参加这次特别会议。他们对他心里没底。“候补”是可以灵活对待的，有的得到通知，有的没得到。但是政治局“二号”亲自给他打过电话摸他的态度。\n　　他代表主席表示军队绝对服从党，谁当选新总书记军队就听谁指挥。为了表示忠诚，他又提出用旅游车把部分军队埋伏在天安门广场以防暴乱和保护会议的建议。建议被“二号”感激地接受了，使包围大会堂的行动变得更加容易和名正言顺。没得到开会通知使王锋免却了寻找借口不参加会议的麻烦，而且他把在京的军队中央委员大部分提前支到外地去，除了几个他本来就想除掉的家伙和投靠了“二等兵”的叛徒，那几个军内异己分子现在已经和阴谋集团一块进高级党校“学习”去了。\n　　王锋满意地微笑，修长的手指弹钢琴般在巨大的褐色办公桌上敲打。得到这种程度的胜利即便是开怀大笑也不会显得轻浮，然而他仅仅是慢慢喝一杯咖啡，稍事休息，品味一下心头的喜悦。\n　　与地球自转同步的大型地球仪在办公室中央缓缓旋转。各色灯光标志的军事目标繁星般分布在凸凹的山峰海谷间。二十二部专线电话直通七大军区﹑三海舰队﹑空军指挥的五中心和七个最重要的导弹基地。\n　　一面防辐射玻璃墙后面矗立着五十六台电视，上下七行，左右八列，展示着整个军委总部的活动。\n　　王锋休息时愿意看这些屏幕。一到军委上任，他就把国防科工委的这套设备搬过来。屏幕还是老屏幕，里面的内容却大不一样了。他在键盘上按了几下，第二行第五列那个画面出现在一个单独的大屏幕上。那是侦听处的接收中心。约有二十名军官正在接收台前忙碌地操作。\n　　这个处是王锋一个月前建立的。七十三名受过德国﹑美国或英国专业部门培训的窃听专家和近二百名助手在那里工作。此刻，大部分专家和助手正隐藏在人民大会堂的杂物间﹑中央党校的地下室﹑中南海的电工房或是各个电话局里，用最先进的设备把对像的任何声音都记录下来，发送到接收中心，由中心整理成音质良好的录音带。\n　　微笑一直挂在王锋嘴边。该满意的事很多，这个侦听中心便是其中之一。有了它，对任何他感兴趣的人就可以像伸着爪子的猫观看蒙着眼的老鼠一样。它制作一盘小小的录音带，就能让一大群中国最有实权的人物束手就范。动用军队当然谁也不能抵抗，但那会落下个政变的名声，国内国外都会惹起一大堆麻烦。然而一盘录音放出来，就可以堂而皇之地让他们去“学习”。坐牢判刑看上去太过火，进党校学习很合适，治病救人嘛。改正了还可以重新工作。\n　　但是在改正之前，党校会比监狱看守得还严。谁为阴谋家说话，谁就是阴谋家的同伙，也一起进去学习！\n　　接收中心正在用密语询问钓鱼台窃听系统的安装情况。那一百四十一个中央委员住在钓鱼台国宾馆。王锋已经指示，他们的录音带也要及时整理出来。\n　　暂时不能让这批人回家了。在一个人人都喊民主的时代，可能随时需要这批会举手的人。他们不会被重兵包围。但为了他们的安全，也得有警卫。不会限制他们的自由，但出门总得有司机﹑保镖，再一人配一个秘书。司机﹑秘书﹑保镖会毕恭毕敬，让他们派头十足，洋洋得意。他们的一举一动都将在监视之下。只要随时让他们象征性地通过一下中央文件，他们就会认为自己成了局势的主人，举手就是了。\n　　王锋一一浏览那五十六个屏幕。他对军委这个机构真是满意非凡。这不是管理军队的班子，足以管理一个国家。能接下这么一个班子，他得感谢当年那位从国家最高领袖主动退居军委主席的“老人家”。不甘寂寞的“老人家”不可能光管一个军队，军委就必然得为他担负起研究和指导国家工作的职能。军队的参政能力从那时起在体制上打下了基础。“老人家”不在了，他的体制却一直在运转。平时似乎是浪费，空耗无数金钱白养那些机构，一到关键时刻，便显示出非凡的能力。\n　　如果没有八室为每个中央委员建立的详细档案，如果没有二十一室几年内对所有中央委员的跟踪调查和分析，如果没有十三处迅速行动和搜寻的能力，他决无可能在如此短的时间内了解清楚每个人的立场﹑背景﹑性格，选出这一百四十一个合作者。也不可能立刻查出每人现在在哪，在干什么。为了不惊动地方党的机关从而使消息传到北京，集合这一百四十一人完全是秘密的，由穿便衣的军人携带伪造的中央办公厅通知在深夜将每个人从家中带出。有的人在出差中途的旅馆，有的人在情妇的被窝，但无一遗漏地被找到。同时就地隔离所有知道消息的人。今晨三时之前，这一百四十一人已经从二十四个省市集中到北京。五时之前，逐个做了“思想工作”。六时之前，听了正在召开的中央紧急特别会议的阴谋交易活动的录音。\n　　七时之前，对全体进行了形势教育。八时之前，布置了行动方案，规定了纪律。然后是精美的早餐，每人都受到国宾般的招待。八时三十分，上车到人民大会堂之前，请他们“检阅”\n　　全副武装的士兵，安排了一辆似乎是偶然碰上的囚车，在他们面前押走企图走漏消息的“奸细”。这一切都进行得如同钟表一样严密，使对精确近乎有“癖”的王锋感到一种审美上的愉快。\n　　蜂音器柔和地响了一下，值班副官通过传声器报告陆浩然来了。王锋敲了一个按键，一行电视屏幕的画面转换成从楼门口到办公室的一路。\n　　车队刚停在楼门口。前后都是军委的警卫车。即使是在军委院里，保卫人员也没放松警惕。\n　　王锋给军委保卫部下了死命令，必须保证陆浩然绝对安全，万无一失。在这个时刻，陆浩然绝不能出意外。\n　　陆浩然从中间的防弹车里出来。士兵们立正敬礼。王锋有点意外，还有一男一女从车里跟出来。他第一眼就不喜欢那个男的，那形像让人想起一只轻手轻脚﹑时刻审视的山猫，全身上下充满精气。相比之下，陆浩然似乎能被那山猫吞掉。王锋也不喜欢女的，虽然她跟在陆浩然身后，却感觉她随时能跟陆浩然手拉手。\n　　“那两个是什么人？”他在这间宽阔无人的办公室里任何一个角落问话，值班副官都会通过传声器随时回答。\n　　“陆浩然说是他的工作人员，坚持要带在身边，实际是陪他练气功的，男的叫周驰……”\n　　王锋没再往下听。他知道这两个人。\n　　陆浩然把两个跑江湖的带在身边干什么呢？王锋看着他们走出第一个屏幕，又进入第二个屏幕。为了壮声势？他的身边助手和秘书这次或多或少都有叛卖言行，大部分都被隔离审查了，即使还剩几个，他这几天受的冷遇也足以使他难以信任。但他不仅仅是图个前呼后拥的派头，军委办公厅提供了不少人供他差遣，他是要表现自己的力量，不甘心成为军委的附庸。弄两个跑江湖的冒名顶替固然可笑，却是一个值得重视的迹象。\n　　后面两个截下，核实一下身份。”\n　　不用多说，下边人会理解。既有礼貌又有威慑地盘问一番，便能使一般人不敢继续再掺和。\n　　二十一室曾就陆浩然对气功的热衷做过一个分析，他有可能把气功当成一种可借用的政治力量。这些年主文化衰落，亚文化泛滥兴起，其中尤以气功为最。全国的气功门徒和爱好者将近一亿。不少人像对宗教一样盲目崇拜气功及其宗师，气功由此有颇强的凝聚力，很容易形成有组织力量。周驰主持的气功学会已经有了道会门的味道，等级和服从都很严格，意识形态的影响也很有力。在陆浩然势单力孤的时候，他有可能想到借助这股势力。\n　　第五个屏幕上，一名微笑的军官把周驰和女演员请进另一个客厅。陆浩然回头看了看，没说出什么。\n　　王锋觉得那分析有点过头。陆浩然没那么丰富的想象力。他毫无个性，软弱，缺乏主见，练气功的大都是这种人。或许，王锋突然闪过一个念头，不是他控制气功，而是气功控制了他。\n　　周驰那两只晶亮的小眼睛随着这个念头在他脑子里一起闪烁。\n　　陆浩然已经走近。王锋握住门把。开门便是会客厅。他回头看着最后一个屏幕。当副官为陆浩然打开会客厅另一端的门时，他同时推开这端的门。\n　　“您好！ ”在会客厅中间，王锋意味深长地握着陆浩然的手。“总书记。”\n　　陆浩然只对这个称呼淡然一笑。\n　　“如果我是真正的总书记，你就不会向我伸手而是该向我敬礼了。”\n　　王锋有点出乎意外，他打了个哈哈：“民主的时代嘛……”\n　　“也不会事先不跟我商量，就塞来这么一堆任免状让我签字。”陆浩然口气并不强硬，却把一迭任免状放在桌上，该他签字的地方全是空白。\n　　“请允许我解释，总书记。”王锋把“总书记”三个字说得非常有节奏。“这十八个省的任命分秒必争。原来的省长和书记虽然被集中到党校学习，毕竟防不胜防。各省都有庞大的驻京机构，耳目众多，关系广泛，万一走漏了消息──我们推断顶多能保密两天──而新任命的省长书记又没有到任采取相应措施，破坏分子就可能在各省制造动乱，惹起麻烦，甚至造成连锁反应。各地驻军已经进入一级战备。十八架专机随时等待起飞，只待任命手续一办完，就载着新省长和书记飞往十八个省会。没有充分时间和您商量完全是形势所迫，请总书记理解。”\n　　“这些人都是谁？”陆浩然用手指敲敲任免状。“我几乎一个也不了解。有的名字甚至从来没听说过！”\n　　王锋心里莞尔。你当然不了解。这是七部苦心经营了多少年的成果。培养和掌握一个随时能推到最前线去委以重任的干部要花多少心血，尤其还得掩饰掉和军队的关系就更不容易。但播种总会有收获，播种这么多年我们才摘取这一次。你怎么会听说呢?\n　　“请您放心，总书记。至少这一点您清楚：原来这十八个省的省长和书记个个都是您的敌人，而现在，即使不熟悉的人也比敌人强。不过我可以向您保证，他们一定会成为您忠诚的下属。”\n　　陆浩然沉吟一会。\n　　“现在应当告诉我了，那份划分阵营的名单是不是你搞的？”\n　　王锋微微一笑。\n　　“只能说我知道。”\n　　“目的是什么？”\n　　“等着您签字的这十八份任免状。”\n　　对于军人，这在战术上叫做“佯动”。在二十一室分析的基础上，由八处拟出那份让对方难以琢磨的名单，由三部安插在“陆浩然办公室”的一个双料耳目做为投靠礼献给“二号”，同时六部组织大量假动作，使对方怀疑自己的力量，抢着把这些省的头头调进北京，增加自己的数量优势，结果正好能够将他们一网打净！如果没有这个佯动造成的调虎离山，即使北京的问题解决了，这帮各据一方的诸侯也不会老实。现在拔掉了这些地方毒头，他们的势力也就成为乌合之众，成不了大气候。\n　　“签字是可以的。”陆浩然隔了很长时间才开口。“但应当有一部分名额由我安排。”\n　　“请说吧，您想安排谁？”\n　　他知道这位新总书记会提哪些人。果然，连说出口的先后顺序都和料想的差不多，全是“强硬派”阵营的老搭档，国务院那些国务委员和部长。谁都知道控制地方的重要，这位新总书记以前就是因为没抓住各省而成为空架子的。\n　　王锋有点夸张地扬起眉。\n　　“总书记，您糊涂啊！这些人刚刚背叛党的原则，加入阴谋集团活动，表现那么恶劣，他们唯一该得到的就是党纪国法的处理，你怎么能让他们去当一方省长？岂不要把国家毁在他们手里吗！ ”\n　　陆浩然一下被噎得满脸通红，说不出话。\n　　王锋表面惊诧，心里却对陆浩然的尴尬忍俊不禁。这是他最满意的一手──在把“温和派”\n　　全盘打垮的同时，让强硬派”也跟着垮台，只剩陆浩然一个光杆。他不让陆浩然进行派系活动的理由很充分：“如果你也搞阴谋，我们怎么反对其它搞阴谋的人呢？这就让“强硬派”\n　　群龙无首。在大变动的当口，每个玩政治的人都要寻找出路和退路，不会老老实实等着就擒，卷进阴谋交易是必然的。陆浩然也许现在省过味来，但即使他想宽恕他们，“党”和“国家”\n　　也会断然拒绝。没有这一招，国务院那帮老奸巨滑的政客迟早是麻烦。陆浩然会有恃无恐，说不定还要分庭抗礼。而现在，就让他去靠气功师吧。\n　　王锋退了一步。不管怎么样，得让总书记面子上过得去。这一点早在考虑之中。\n　　“为了稳定全国的大局，这批任命没时间调整了。马上就该考虑国务院的任命，”王锋微微一顿。“除了总理和国防﹑外交﹑安全﹑公安﹑财政五个部的部长，还有人大常委会委员长由主席指派，其它人选可以先由您拟定，只要不启用那些阴谋家，我们会予以充分尊重的。”\n　　除了已被关在党校的那批政客，他还能找出什么有份量的角色呢？况且，国务院在北京，随时可以伸出手指捏一下。据说捏臭虫时会发出一个响声。王锋还从未见过臭虫呢。\n　　“签字吧，总书记。”\n　　\n　　三峡\n　　“凶手在逃跑中被击毙”，多么圆的句号啊！\n　　李克明用脚尖试探地顶了一下，病房的门从外面反锁了。一块帘子从外面挡住玻璃。看不见走廊，只反射出他自己被纱布包成方形的头和病房窗外明亮的天。\n　　他在门上踢了几脚，踢得不重，只是因为他双臂全被纱布裹满，无法敲门。\n　　帘从外面撩开，露出护士长吃惊的脸。\n　　“我要撒尿。”说话的震动使他从胸腔往上所有部位都剧烈疼痛。\n　　护士长开门进来，连扶带搀地让他回床。\n　　“你怎么能下床！快躺下。我给你拿尿壶”。\n　　护士长四十好几了，大坝一开工就在这个工地职工医院工作。李克明认识她丈夫。可她此刻的神色和声调都有点不对。\n　　“我自己上厕所。我能走。”李克明甩脱她，剧痛使他差点叫出声。几天昏迷后，这是他第一次下床。他上半身几乎没有一块完好皮肤，下半身却没受多少伤。他的恢复速度令医生吃惊。走了这几步路，他感觉扭伤的脚也好了一多半。\n　　“不行。”护士长很紧张。“尿壶……一样。”\n　　“我没法端。”他把手伸给护士长。那是两块纱布包成的板。\n　　“我给你端。”\n　　“我不要女的！ ”他跨出病房。\n　　“我可以给你端。”一个身穿医生白大褂的男人挡住他。\n　　李克明透过纱布上留给眼睛的窟窿打量他。\n　　“我不认识你。”\n　　“端尿壶用不着认识，不是女的，对你就够了。”\n　　“我更不愿意让一个半男半女的人摆弄我的鸡巴！ ”李克明故意放大声音。\n　　那男人不受刺激，宽容地一笑。\n　　“给他屋里放一个电马桶。”他对护士长说。\n　　走廊里还有另外两个男人，都穿白大褂。一个站在楼梯口，另一个站在阳台门前，虽然装成无关的样子，可一眼就能看出是两条狗。\n　　“好吧。”李克明尽量让声调轻松。“用用伺候洋屁股的玩艺儿也不赖。不过得让我手指头能活动。”\n　　护士长看了一眼那男人。\n　　“合理要求。”男人高雅地说。\n　　出了什么问题？他躺在床上一遍又一遍地想。昨天房门还没反锁，玻璃外面没有挂帘，护士长还亲切慈祥，也没有监视的狗，同事和朋友还可以络绎不绝地探望。这一切变化都是在昨晚和老三的谈话之后，难道泄露了?\n　　清醒以后，李克明装得什么都没觉察，对调查人员只谈和凶手搏斗的过程。在沉迪面前装得更傻，无论沉迪怎么绕圈儿套他，他都回忆不起沉迪那些古怪的行为，只对嘉奖的许诺有兴趣。但是他的心里已经雪亮。当他在老三的怀里清醒，知道凶手跑了的时候，他无论如何不能相信。他明明在飞机上看见了搜索队。老三说，搜索队沿北岸走了一半，突然被告知凶手在南岸，命令他们返回，部署的封锁线全部撤掉。从那时起，原来那些孤立的疑点就连成一条明晰的线──沉迪一定是这次暗杀的同谋！ 所有那些无法理解的事都变得那么明白：否定他的保卫方案不是因为他的方案不好，而是他的方案太严密，凶手难以下手和逃脱﹔把公安处人员缴械，弄到外围是因为他们对环境太熟悉﹔让直升机撒纸屑是为了转移人们注意力，给凶手创造时机﹔不让他跟公安处联系是为了一切行动全由沉迪控制，而控制的目的就是给凶手网开一面﹔如果他那时能调来一艘公安处的巡逻艇，就算凶手会飞也他妈的跑不了！ 可叫一个“最高机密”把他吓住了！ 至于不派飞机和巡逻队到北岸，中途调回搜索队以及拖延对公路﹑车站的封锁，目的都再明显不过。但其它人并不容易意识到，沉迪掩饰得很巧妙。\n　　在一片混乱中，很难说哪个决策正确或错误，顶多人们觉得他无能，这正是他最需要的。越狡猾的人越盼着人家说他无能。不过沉迪心里会明白，他骗得了别人，却骗不了李克明。在那个关键时刻，他没有回旋余地，不可能充分伪装。当时骗过了李克明，事一过就会昭然若揭，除非李克明是傻子。李克明当然不是傻子，只要查一下档案，看看那些功劳记录，听听上下级的评价，谁都会知道这个李克明是多么精明，多难欺骗。然而精明的李克明装出在搏斗﹑4?烧﹑飞机爆炸和脑震荡之后变傻了，记忆紊乱甚至丧失，言语迟钝，懵懵懂懂。直到昨晚之前，看来沉迪也有点信了。哪出差错了呢？只能是和老三说的话被沉迪知道了！\n　　窃听器！ 他心里抖了一下。看一眼四面，床栏里，台灯中，桌子后面，椅垫底下，或者就是床头柜上的药丸，或者就是墙上那个黑点，窃听器可能早装了满屋！ 他突然意识到自己犯了个大错误。企业公安处的局限使他从来没有用过窃听器，所以这方面的概念太少，又是在自己的职工医院里，更不容易想到这一层。他和老三的谈话只是防备隔墙有耳，开大电视音量，尽量压低声音，防“耳”够了，却怎么防得了有计算器处理信号的窃听设备呢?\n　　老三怎样了？如果一切顺利的话，他现在应当在开往北京的火车上。如果继续顺利，零点三十七分将在丰台下车，立刻给当年警官学校老校长打电话。老校长现在是安全部五局的局长。\n　　哪怕在梦中惊醒，他也一定会立刻接见老三，因为老三带去的消息将告诉他，这次暗杀的主谋就在国家上层内部，只要揪住沉迪这根线，就能挖个水落石出。如果往下还是顺利，也许就能防止国家的一场大动乱。他李克明就成了民族英雄！\n　　可是，如果不顺利呢？……如果不顺利……他不敢往下想……\n　　老三是公安处刑警队长，和李克明从小光屁股长大，都是黑龙江省黑河人，又是警官学校一个班的同学，亲兄弟的关系也难比得上他俩。\n　　但不管他敢不敢想下去，那预感却始终牢牢地缠住他。直到一辆呼啸开来的救护车引起一楼急救室一片嘈杂忙乱，终于听到一声撕裂人心的哭声隔着低质量的楼板传来，那预感才离去，剩下刀剜一样的事实。\n　　那是老三的妻在哭，边哭边诉，隐隐约约，又像字字雷鸣。\n　　“……三哥呀，你为啥不说话，你为啥要走……你是要回黑河看妈去吗，为啥不叫着我……\n　　他们说你喝多了，我不信，喝酒咱家有，你是想妈了才去坐火车……我也要去，三哥呀，我也让那火车轮子压，就让压你那个轮子压我……”\n　　李克明一动不动地躺在病床上，看上去，好象是个没有知觉的人。\n　　天色已暗得看不清表上指针了。他轻轻下床，藏在窗子后面。\n　　窗外，那辆没拔钥匙的摩托车还停在楼下，似乎它的主人已经把它忘记了。\n　　通到楼下的铁?雨水管距窗子只有一米，可以顺着它爬下楼。虽然上身被纱布缠着不方便，但早上让护士长重新包扎的手已经能活动，下身也足够灵活。窗下是花池，掉下去也没大事，只要骑上摩托车，等他们反应过来，早出去老远了。以他对地形的熟悉和开摩托车的本事，没有人能追上他。\n　　李克明知道自己必须走，不能再耽搁。下午，那两个调查人员已经摆出审问的架势了：他为什么在总书记被害前说出“请总书记看水里”的话？然后又高喊“中华鲟”？据了解他爷爷一家都被日本人残杀，他对日本是不是有仇恨？对总书记去日本签署把他家乡租借给日本有什么看法？他反问他们是不是认为他是杀害总书记的凶手。一个调查人员从公文包里拿出一把带着新锈的手枪。\n　　“据你提供的情况，凶手有一支形状奇特的枪被你踢进水里。我们把那个水湾全部抽干，但只发现了这只八八式手枪。枪号是0503146。”\n　　正是李克明的枪。\n　　李克明惊呆了。那两个人再没往下问，颇有深意地互相看一眼，留下李克明自己发呆。\n　　那时李克明明白了，并不是他能置沉迪于死地，相同的武器也握在沉迪手里，而且威力大得多。他不知道周围有多少人是沉迪同伙，所以一直不敢对调查者揭露沉迪。即便他们全是清白的，他也无法让人相信他们的上司是暗杀同谋。他没有证据。唯一在现场的飞行员死了。\n　　而沈迪把他打成凶手却容易得多。他坚持飞机巡行。不少人能证明他的迫切有点反常。他可以事先在飞机上藏好手枪，躲过检查并不困难。他让总书记看水里是转移人们对空中的注意。\n　　喊“中华鲟”也许是和飞行员之间的暗号。为了灭口，他杀掉飞行员，布置了飞机失事的现场，在火中有意烧伤自己，编了一个惊险的故事。如果沉迪这样说他，让人相信的份量岂不是重得多。更何况他们还“捞”出了一支他的枪！\n　　他们为什么这么蠢呢？如果他们诬陷我是凶手，为什么不等关键时刻突然袭击，却把假证据早早露给我，以使我早有准备呢？在正常的审问中，连真证据也不会轻易地拿出来，何况他们都是一流专家。不，他们不是蠢。他们聪明之极。要想出他们的聪明所在。沉迪此刻在想什么？怎样对他最有利？如果我是他，我会怎么做？……如果我是他，最有利的做法就是让我死！ 如果我不死，用他的势力虽然可以把我打成凶手，可这个暗杀毕竟不等同普通的刑事凶杀，过去就过去了。我绝不会承认，我必定会在每一次审问﹑每一个场合揭穿他。肯定会有人对这类事感兴趣，继续追下去。哪怕他的靠山再硬，我活着也是个后患无穷的麻烦事。\n　　而死人是什么都不会说的，任凭活人说，半点也他妈的不会反驳。是的，他一定会让我死，就像让老三死一样！\n　　怎么让我死最好呢？下毒？饭里﹑水里﹑静脉注射液里？或是干脆给一枪。可那又是一桩谋杀，而且在他们的看管中，难以摆脱干系，也有许多线索可以追下去，说不定又追出麻烦来。\n　　让我自杀？他们突然挑明怀疑我是凶手是指望我走这条道吗？怎么可能！ 我怎么能是那种傻子！ 他们不会相信我的王牌没打出来我就会死。那么，他们的聪明是什么呢?\n　　楼下的摩托车有点怪。怎么这么巧？从下午到天黑，钥匙插在点火锁上，似乎就专等着我去骑。既然认定我是嫌疑犯，不要说是谋杀国家首脑的刺客，就是普通杀人犯也不应戒备如此松懈。窗上没有铁栏。窗下有摩托车。走廊的看守刚被人叫去看电视，大叫大嚷嘻嘻哈哈。\n　　不对。正常的程序应当是立刻派专机把我送到北京，至少一个连的士兵押送，关进国家级大犯的监狱。\n　　一阵小风吹过，李克明用苍蝇拍捅一下窗台上的罐头盒，“啪啦”一声掉在楼下。四﹑五个黑影在不同位置闪了闪，又隐没起来。\n　　是了，这就是沉迪狗头里的聪明。他是想让我逃跑，用“捞”出来的枪压迫我。我只有逃跑才能脱离他的手心，揭穿他和澄清自己。他摸准我会这样干。松懈的戒备和摩托车都是诱饵。\n　　只要我一跑，隐藏在暗中的枪手就会把我射成全身窟窿眼儿。“凶手在逃跑中被击毙”，多么圆的句号啊！ 这就是将来我那从没见过面的儿子从政治课本上看到的历史！ 我儿子的爹是千古罪人，我儿子就永远是罪人的儿子！\n　　他想起了正在黑河老家坐月子的妻子。他庆幸把她送回老家分娩。当时想的只是老家不似这里夏日炎热，也有老人照顾。而现在，如果妻子没走，一定会被害死。即使他没给妻子讲他掌握的秘密，沉迪也会以防万一。\n　　沉迪算得对，他必须逃跑。即使他知道沉迪正盼着他逃跑他也得逃。不逃是没有出路的，沉迪不会因为他不逃就不干掉他。前后左右围得好象铁桶，他往哪逃都注定遇到子弹。沉迪把一切都算得准准，然而他毕竟是个外来人，做梦也不会想到，所有的教科书也不曾讲授，还有那样一条路。\n　　李克明以尽可能轻的动作穿上连裤防水服。鬼差神使，工地警卫队那几个大咧咧的小子来看他时，用这条防水服装了一下子罐头和水果。防水服用最新材料做成，又轻又薄。他把被窝做成人形，攀着暖气管爬上天花板。他的动作很慢。他不担心有人闯进来。当他们盼着他逃跑时，是不会有人打扰他的。这是一栋五十年代盖的老楼。天花板和铺瓦的楼顶之间有一个三角形空间，排列着纵横交错的木架﹑管道和电线，生活着许许多多的老鼠。多亏了这些老鼠时刻发出声响，他的动作才能在窃听器里被掩盖。他顶开一块钉在方形木框上的天花板，爬进三角形空间。全身伤口重新开裂。他觉出血在纱布里面流。痒和痛的感觉尖锐地混合在一起。\n　　上面有许多亮光，是透过天花板裂缝和漏洞从下面房间照上来的。李克明把掀起的天花板重新盖好，小心翼翼踩着木架走向西端。幸好两腿仍然结实有力。\n　　透过天花板缝隙和孔洞，依次看见一个个房间。病人多数已经入睡。值班室里那个半男半女的男人在擦枪。走廊每个拐角都有隐蔽的枪手。而护士宿舍，还跟他上次看见那样亮着雪亮的灯泡。一个年轻女护士脱得光光的在擦澡。乳房随着动作软软地颤动。\n　　两月前他在一个盗卖电缆的电工那发现过一迭照片，全是裸体或半裸体的姑娘。有睡觉的﹑洗澡的﹑看书的或是坐着发呆的。不是一个姑娘，拍摄角度却始终不变，都是自上而下俯拍的。电工一会儿说捡的一会说买的，一看李克明拿出刚充完电的警棍，他就老老实实供出了这条路。\n　　在楼房顶端摸到那个细长的铝梯时，李克明心头浮起一丝喜悦。为了证实电工的供词，他在电工带领下亲自走过一遍。这个小梯子原来藏在楼外的山崖石缝里。那次进来把梯子收到楼里，他们没从原路回去，直接从天棚口下到走廊，对医院的人只说检查电线。既然谁也不知道，他就不想把照片弄到法庭上让姑娘们丢脸，这条秘密通路也没有必要说出去。他当时觉得便宜了电工，在那小子屁股上狠狠踢了两脚，现在却变成了对那小子的满心感激。\n　　顶端墙上有一个正方形的小出口。挪开半朽的木盖，一股阴凉的风吹进来。出口外面相隔六米远，便是一座山崖。黑黝黝的山影衬在暗淡夜空上。\n　　他把头探出去静静倾听，除了风在楼和山崖间穿流，没有别的动静。埋伏者的注意力全在其它三面，这边是立陡的山崖。谁想得到一个“色”字能创造出这样的奇迹呢?\n　　李克明把梯子从出口顺出去，搭到对面石崖一道裂缝下部的凸台上，反复调整，梯子那端的挂钩挂住钉在石头里的一个铁环。再次倾听，远处有隐隐的雷声。他钻出出口，挪回木盖。\n　　每动一下，伤口和纱布之间都如锉刀摩擦。高度紧张在人体内调动的潜能是惊人的。疼痛已经麻木，只要失血不过量，他就可以保持敏捷和平衡。这两个因素对于沿着半尺宽的梯子爬过六米空间至关重要。虽然只是几步的事，当他踩上石崖的凸台时，也几乎瘫倒。\n　　歇了足有五分钟，他把梯子收过来，沿着石崖裂缝立起，再顺梯子爬到顶端。上面已经不是垂直的陡崖，抓住那电工当时安装的一根铁链，就可以一直爬到矗立在石崖顶的高压电塔下。\n　　高压电塔的黑影狰狞古怪。一条小路通向江边。大坝灯光在上游白昼一样照耀。流向下游的江水波涛滚滚，嘶哑地呼啸。\n　　他把防水服上的充气隔层吹鼓，扎死袖口领口和帽子上的绳带。他安慰自己，只要不透水，破裂的伤口就不会感染。等到不需要有这么激烈的动作时，静静躺几天，就会重新愈合。\n　　水的力量很大，刚没过膝盖就难以站住。他知道往下没有太险恶的水情，所以并不担心。再走几步，双脚离地，充气的防水服使他浮起。无法避免浪花打湿脸上的纱布。他尽量高仰着脸。天上星星黯淡无光。水速很快。照这个速度，不久就可以漂到那只小木船的停泊处。上了木船水就不会继续弄湿伤口。往下四十里是水文站的小码头，那几条狗熟悉他，不会纠缠。\n　　他可以开走水文站的摩托艇。天亮之前就能开出去二百多公里，再转汽车﹑火车……\n　　关键是这张烧伤的脸，不管是不是包着纱布，都太引人注目，也太容易被通缉。不过那个真正的凶手也一样被烧伤了脸，他曾向调查者反复讲过这点。既然沉迪不想让真正的凶手落网，在凶手彻底安全以前，他不会通告这一点。也许这反而是最好的掩护，除了脸上的伤和纱布，他还能说出我甚么呢？重要的是得找一个安全的立脚之处，一个可靠的人……"
		},
		{
			"post_id": 17,
			"title": "《黄祸》13",
			"date_published": 1460973512.82,
			"body": "　　长江三峡\n　　总书记的头颅在刺目的阳光下开放了一朵通红的花。\n\n---\n　　Y─8直升机的旋翼怠速旋转，随时准备起飞。李克明坐在驾驶员身后，一肚子窝火。\n　　大坝那边车来车往，人影晃动，一片忙乱的气氛。为迎接总书记前来剪彩，工程局从上到下忙了一个多月。他和他手下的弟兄更是不得安生。为了总书记的安全，比对亲爹还尽心地又设计又部署，折腾出全套保卫手段，忙得废寝忘食。过去从未保卫过这么高级别的大头头，全处都当成一等一的头号大事，生怕出半点纰漏，也个个都想露一手。别看只是一个工程局的公安处，不比那些牛烘烘的保卫专家差。可今天，总书记马上就到了，他们却被集体赶到最外围当跑腿儿的了。\n　　一想到那个姓沉的上校，李克明就禁不住要骂娘。那张细皮嫩肉傲慢的脸，真该使劲扇上去两耳光。那个王八蛋一小时前到现场，十分钟不到就把他们一个月辛辛苦苦的工作全部推翻。\n　　李克明一直认为自己设计的保卫体系无懈可击，除了常规的沿线布岗﹑现场戒严﹑搜检爆炸器﹑审查人员等，他还在库区内部署了两艘摩托艇巡逻，配有潜水员，控制水上所有目标，拦截飘浮物，在河道下游部署了巡逻队。他自己乘公安处的巡逻直升机在空中全面监视。指挥协调。然而姓沈的不加任何解释，先把摩托艇﹑直升机﹑巡逻队一概取消，再收了公安处有关人员的枪，勒令他们不许进入核心现场。\n　　妈的！ 李克明把烟头狠狠吐在脚下那个鼓囊囊的帆布袋上。他恨自己当时没有甩手就走，反而一个劲儿说直升机巡视怎么必要。人家信不着你，还掉这价干啥？说穿了只是怕被弟兄们笑话。别人被赶出现场骂几句也就算了，他是主管这次保卫的副处长，夸下海口要露一手，如果也被赶出去，这张脸往哪放？他几乎成了上赶着求那个姓沉的杂种，竟说出“直升飞机可以表达对总书记的欢迎”这种理由。可恰恰是这个最不成理由的理由打动了姓沉的。那小子歪着头琢磨了半分钟，让他在停机坪待命。十分钟前，汽车送来了脚下这个帆布袋，里面是满满一下子花纸屑。姓沉的通过电台告诉他: 总书记剪彩之时通知他起飞。他的任务是飞到水库上方，把这包花纸屑从空中撒下表示欢迎祝贺。李克明气得发昏，差点把那个来检查飞机上是否藏有武器的警官一脚踢下舱。\n　　总书记的车队到了，前呼后拥，好几十辆。公路扫了又扫，洒了好几遍水，照样扬起一片灰尘。李克明已经毫无兴趣，只是出于职业本能才把望远镜放在眼前。\n　　他实在看不出那个沉迪有什么值得傲慢，也许是小地方的警官看不懂？他怎么也不明白，经过沈迪重新部署，保卫体系反而漏洞百出。大坝入口处围着不少人观看，把拐弯处挤得过于狭窄。车队被迫放慢速度。在李克明眼里这是犯了大忌。尤其那些围观者不是经过组织的欢迎队伍，而是沉迪撤掉了公安处的防卫圈后自发涌进来的。果然，几个人突然打起一副“三峡工程祸国殃民”的标语，引起一阵骚动。如果其中有一个枪手？李克明心跳加快了。\n　　还好，仅仅是几个绿色分子捣乱。李克明对这帮言必谈绿的家伙讨厌透顶。从大坝开工他们就没断过折腾，非说大坝破坏生态，把外债﹑通货膨胀，直到资金紧缺一类的问题都跟大坝联系在一起。大坝花钱确实不少，现在一期工程刚完，全部投资就已经快花光了。可得看多大气派。这是世界奇迹，建成后发电量世界第一！ 光说生态有什么用，到处都是绿草，人也不能变成牛，靠草活！\n　　耳机里传来沈迪纯正的北京口音，一副高高在上不可抗拒的声调。李克明奇怪这么一个老爷竟然亲自指挥他这个撒花纸屑的小飞机。直升机竖直地起飞了。\n　　水库展现在眼前。蓄水时间不长，已是一片汪洋，在阳光下黄澄澄的，无边无际。李克明第一眼发现水下有个黑影，摆动一下就不见了。中华鲟？他没看清。新蓄的水冲下好多泥土，即使从空中垂直向下，也看不透一米深。真有中华鲟可是好兆头。那帮绿色分子嚷嚷大坝会使这种珍奇物种绝迹，它要能在这个时刻现身，给他们当头一棒，可称得上对总书记最隆重的欢迎了。李克明琢磨是否向地面报告，转念又算了，万一是眼花呢。即使真是中华鲟，有直升飞机在头顶，它也绝不会再露头，何必弄出一副拍马屁的样子。他让飞行员放慢速度沿大坝飞行。不管那个姓沉的怎么说，他还是要按自己演习过的方式巡视一遍，哪怕是象征性的，也说明自己不是个摆设。\n　　车队停在大坝中央。一大群地方官员簇拥着总书记。总书记刚剪断红绸子，双手叉腰向水面眺望。随行记者的照相机﹑录象机全对准他。明天各大报的头版﹑电视节目的头条都会出现这副意气风发的雄姿。“高峡出平湖”的中国梦终于变成现实。在黄河水灾震动全国的时候，这项伟业的意义尤其不同寻常。它会让人民看到成绩和光明，得到信心和勇气。工程局那帮头头说得更邪乎:“大坝是中国现代化的脊梁骨！”\n　　沉迪恼火的声音在耳机里非常刺耳:“磨蹭什么，马上飞到指定地点撒花！”\n　　李克明使劲儿忍了忍，没把“你算老几”甩向话筒。飞行员是他的哥们儿，无可奈何地看他一眼，一加速飞到总书记正前方的水面上，将飞机控制成悬停。\n　　李克明心里骂着拉开舱门，把一袋花纸屑一股脑倒出去。顿时天上开了花，成了个五颜六色的大花团。大堤上的人仰面而视，兴致勃勃地议论和鼓掌。花纸屑被旋翼搅得纷纷扬扬，围绕直升机高速旋转，一团团扑进机舱，又旋转着再飞出去，打得李克明脸上麻酥酥，连鼻孔都飞进了纸屑。他瞇着眼透过纸屑空隙看下去。中华鲟！在直升机吹动的水波中，离大坝如此接近，不到三十米，黑乎乎地浮现，正对着总书记。可所有人都仰头看天上的花团。李克明抓起望远镜，对话筒喊:“请总书记看水里。”\n　　话音刚落，总书记的头颅在刺目阳光下开放了一朵通红的花。光闪闪的花瓣从花蕾里绽出，瞬时间怒放地向四面生长，形成一个完美的弧状，便突兀地破碎和凋零。\n　　总书记倒下了。\n　　大坝上的人先是像被魔法定住了，继而嗡地挤成一团，将总书记围在中间。\n　　是做梦吗？是眼睛的错觉吗？是纸屑的干扰吗？不，是真的？总书记倒下了，被围在中间。\n　　他只剩一个身子。脖子上面是血腥的空洞。他的头被炸碎了。他被杀了！ 最高领袖！ 在他李克明的眼皮底下！\n　　“中华鲟！ ”他一声狂叫。\n　　水面黄澄澄，鬼魅般地干净。\n　　李克明立刻冷静下来。他刚满三十岁就当上副处长正是因为他亲手抓过五个杀人凶手。如果被杀的不是总书记，可以说他时刻都在盼望出现杀人案呢。抓获凶手是他最大的乐趣和享受。\n　　坝上的警卫和保镖像受惊的狗一样到处乱窜，却连枪从哪儿打的都不知道，只能呲牙狂吠着团团转。\n　　“凶手在水里。”李克明对话筒讲。“请迅速派人封锁水库两岸。我在空中监视，随时通报情况。”\n　　奇怪的是现在倒没有沉迪的声音了。\n　　飞机升高了，脱离了纸屑的干扰。李克明从舱门探身往下看。心里迅速地判断。大坝所有闸门都关着。导流洞有栅栏，凶手不可能顺水穿过大坝，从下游逃走。他只能在水库里。轻潜呼吸器的空气瓶顶多供气九十分钟。用脚蹼游泳，时速不超过五公里。即使有小型推进器，也不会超过十五公里，那么九十分钟内，凶手一定会在二十二□五公里的范围内现身登陆逃跑。登陆点可以排除大坝。而水库南岸人烟稠密，多是农田。北岸却山峦起伏，林木丛生，所以基本可断定，凶手将在北岸登陆──最大可能性是在距大坝五公里处那片贴水边的灌木林。\n　　李克明让飞机沿北岸来回巡行。飞行高度能同时监视几公里范围。好在水边林木没有太大片的，视线基本清楚。他一边搜索，一边向陆地电台呼叫。一直没有回答，可能是吓懵了，他想。\n　　“换公安处频道。”他吩咐飞行员。\n　　“告诉你们，”耳机里突然出现沉迪的声音，一点没有懵的意思，威严得阴森森。“没有得到我的批准，让任何人知道刚发生的事都以泄露国家最高机密论处。有什么话跟我说。”\n　　在这种紧急时刻，李克明无心计较态度和口气。他迅速讲了他的分析，要求再派一架直升机和两艘摩托艇到北岸，同时派地面人员在北岸拉网，再封锁北岸所能通达的所有公路和车站。\n　　“凶手肯定跑不了！ ”他的眼睛一秒钟也没停止搜巡。“只要按我说的办，抓不着凶手拿我治罪！ ”\n　　耳机里半天没有回答的声音。\n　　“喂喂，”李克明呼叫。“请回答！ 喂喂，请回答！ ”\n　　“听见了。”沉迪的声音变得非常柔和。“你的燃油够飞多长时间？”\n　　李克明一下想起，起飞之前，昨天加满的油被抽出去四分之三。理由是撒花只需几分钟，油太满一旦出事故危害大。他迅速瞥一眼油表，顶多还能坚持半小时。\n　　“十五分钟。”\n　　“你们马上返航。地面搜索队已经派出。各条通路已经封锁。接替你的飞机马上就到，还有巡逻艇。”\n　　“接替飞机来了我再返航。”\n　　对方没再回答。\n　　继续巡行十分钟。飞行员已经有些不安。燃油表的指针接近红色警戒线。如果警报灯一亮，就只剩十分钟。虽然从这里飞回机场只需一分钟，可接替飞机连影也没有。\n　　李克明却不关心这个，一声不吭地用望远镜往下看。\n　　“返回去！”他突然喊。不是返回机场，而是他手指的那片刚飞过的小水湾。\n　　飞机灵巧地转过身，悬停在小水湾上方。\n　　果然，那是一根管。李克明又一次调准望远镜焦点，虽然悬停的飞机抖个不停，但能分辨得清楚。\n　　水湾夹在两侧平缓的山坡之间。坡上布满茂密灌木。水位刚涨到这儿不久。水边有很多荒草露出头。紧贴着一根艾蒿的茎杆，水中伸出一段黑色橡胶管。\n　　正是湿橡胶管的反光引起李克明注意。任何植物也没有这么光滑的表面。当飞机悬停上方，那根管儿蛇一样往里缩，只剩一点点，随着艾蒿在旋翼吹起的水波中摇荡。\n　　会不会只是一段被水冲靠岸的普通胶管？还是从凶手嘴里伸出来？他看看远处，两只摩托艇倒是开出来了，却在南岸巡逻。妈的，姓沉的信不着人！ 南岸不放过，北岸也该派一艘艇过来。只要艇上的人把管一拔，底下是什么就一清二楚了。现在这样吊死鬼似的啥也够不着，地形又不适合降落，别说再有十分钟就得返航，哪怕飞机在这挂上一天，水里有人天一黑也照样溜走！\n　　“接替飞机为什么不来！ ”他对话筒气愤地喊。“接替飞机为什么不来！ ”\n　　可是没有回答。\n　　要不要说胶管的事？万一下面只吊着一个水龙头，岂不成了让那个王八蛋耻笑的材料。他下意识地摸腰，空空枪套使他骂出一串脏字。如果枪不被收掉，他马上就可以见出分晓。他抓起一把扳手扔下去，打在离胶管不远的水里，然而没有任何反应。\n　　他突然灵机一动，拍拍飞行员的肩。\n　　“往下降！ ”\n　　飞行员是个聪明小伙子，马上领会了他的意思。飞机对准胶管向水面慢慢下降。\n　　艾蒿倒伏了。水面被飞机旋翼吹出一个圆形凹陷。飞机离水面越近，凹陷越深，其中的水哗哗旋转。\n　　李克明目不转睛地盯着。他摘掉耳机话筒，双手勾住打开的舱门边沿，全身绷成了弓状。\n　　飞机越降越低，离水面只有七﹑八米了，凹陷越来越深。突然从中露出一个平躺在泥底的人形。那人形两只蟹钳似的手臂傲慢地合扰，挺起一支光亮古怪的家伙，直直地对准飞机。\n　　“快飞！ ”李克明大吼一声，纵身扑出舱门。一股尖锐的风紧贴脖颈擦过。落地前他左脚踢飞那支枪，右脚本应踩上人形的小腹，可头顶爆炸的气浪把他狠狠拍进泥里。剧痛从右脚直刺进脊髓。\n　　轰鸣的水从四面涌来，剎时间淹没他，填平凹陷，并在圆心撞起一个隆起的水峰。正是由于这个激涌的水峰，才使已经顶在他背上的那个膝盖没能压断他的脊骨，而那双铁爪般的双手不由自主地松动。他猛一缩肩转身，顺着浪涌跃起，一瞬间完成一连串解脱和反击的动作。\n　　当他的头露出水面，他将灌了满嘴的泥沙喷向对方。\n　　浪涌只是一跃，立即仅剩余波震荡。水深刚及腰间。李克明第一眼看见的是火，直冲天际。\n　　直升飞机在二十米外的草坡上燃烧。凶手的手掌利刃般砍向他的脖子。橡胶吸管从他的潜水面罩上伸出，像毒蛇信子有弹性地甩动。面罩的玻璃上面古怪地挂着一片草叶。应当说在所有对打中，李克明最擅长的就是徒手格斗，去年还得了湖北省散打比赛第二名，但是受伤的右脚使他失掉支撑和速度，反被几度打倒。要不是凶手潜水衣上那些古怪的鳍片妨碍了动作，说不定他已经被置于死地。凶手并不恋战，只想尽快脱身。然而李克明死抓住不放。他知道自己已经不能追，要擒住凶手只能在原地。\n　　一条火龙从直升机破裂的油箱里爬出，沿着草坡迅速窜进水里，转眼便把整个水面蔓延成一片火海。\n　　他们在火海上下扭成一团，时而摔在水里，时而站在火中。水面上的汽油越来越多。火烧穿了李克明的衣服。他听见皮肉在吱拉做响。疼痛使他疯狂叫喊。可那烧黑的胳膊还是在不停地打。每一次打击都重新变成鲜红。血像落在火炉上一样尖叫着变干，又重新变黑。他感觉到凶手的肋骨在他拳下坍陷断折。如果没有那套犀牛皮般的潜水服，他一定能把里面的心活生生地掏出来。凶手突然改变了打法，不再一个劲儿挣脱，反倒一下死死抱住李克明，站立在火中。一旦身体不在水中搅和，燃烧的汽油马上就贴在身上，像沿着灯捻一样往上爬。这回成了李克明拚命挣扎解脱。他的气力已快耗尽，可对方的双臂如同铁箍。他的脸离那潜水面罩的玻璃只有几寸。里面鳄鱼一样的眼睛恶毒地盯着他。他一下明白，凶手是要用火置他于死地。潜水服怎么也比他的夏季短袖制服挺得时间长。这样抱在一起让火烧，肯定是他先倒下，而凶手就可以逃脱。那块玻璃，眼前的玻璃，在太阳和火焰中倒映着他自己被烧烂了的面容。他用额头往那面罩玻璃上奋力一撞，破碎的玻璃条刺进鼻腔。在对方失去重心倒下的瞬间，他把一捧燃烧的汽油泼进那洞开的面罩。他自己扑倒在水里。水已经接近沸腾，对他却清凉得舒服。他听到一声长啸。当他再次站起来，拨开周围的火，看见凶手正在窜跳着狂奔。那面罩被挣扎着拔下，里面的头发如火炬一般熊熊燃烧。\n　　李克明摇摇晃晃爬上陆地，刚追了几步就一头扑倒在地上。他看见凶手的背影消失在灌木中，头发冒出的烟在绿叶上方升起。跑不了，他在昏迷前想。他记起刚才在飞机上看见搜索队正向这边挺进。该到了，他们早该看到燃烧的飞机。跑不了！ 一定能抓到……\n　　北京天安门广场\n　　九十二辆大客车里，四千六百五十名装备精良风尘仆仆的野战军士兵正在静坐待命。\n　　阴雨绵绵。\n　　天安门前的国旗湿淋淋地垂在旗杆半截。守旗的武警士兵臂带黑纱，雕像般站立四角。\n　　所有的广播﹑电视一遍一遍地反复播放讣告和哀乐。但是三天过去了，讣告内容没有变化，其中那句“国家敌人凶残的暗杀”也没有进一步解释。\n　　人民英雄纪念碑下，几个纸花圈在雨打中凋零，一个鲜花花蓝却更加鲜艳。\n　　民主派组织不知道该怎样对待这个突然死去的人物。他狡猾﹑强大﹑居高临下，他是专制阵营的总司令，是他们矛头所向的主要目标。但正是他给了他们现在得到的一切──组织﹑集会﹑办报﹑包括占领天安门广场。在这方面，他似乎又是他们的合作者。现在，敌手突然没有了，面前成了一个空洞。原本乱挥乱舞的棍子一下无处可打了，而一种隐隐的担忧在蔓延，下一个敌手还会合作吗?\n　　广场四周，巡逻的警察增加了几倍。满目皆是武装摩托车﹑对讲机﹑钢盔和电警棍。国家安全局的便衣遍布人群中，盯着那些唯恐天下不乱的外国记者和躁动不安的外交官，其中不乏真正的间谍。\n　　人民是平静的。所有娱乐场所都关闭了，许多人无处可去，来到天安门广场，但仅仅是看看而已。连“民阵”“人阵”的高音喇叭也不知道该说什么。看看没出什么事，没有什么热闹好看，多数人也就回家了。\n　　很少有人注意到，在历史博物馆和毛泽东纪念堂周围，那种运送外国旅游团的高级大客车比往天多了好几倍，整齐地停着。跟往天不同的是，所有的车都拉着窗帘，静悄悄，没有一个外国旅游者上下，使人感觉全是空车。然而，可数的几个人知道准确数字，九十二辆大客车里，四千六百五十名装备精良风尘仆仆的野战军士兵正在静坐待命。\n　　北京人民大会堂\n　　陆浩然觉得自己处身在一出荒诞剧中，举起的手有点颤抖。\n　　陆浩然忘记把会议卡戴在胸前，被卫兵拦在门口。门里至少有二十名中央办公厅的工作人员，没有一个出来说一声。他在每个口袋和公文包里找，最终想起可能忘在了汽车座位上。\n　　汽车已经开向下面的停车场。他扬了一下手，没喊出声。司机反正听不见，叫出来反而显得更狼狈。那些办公厅的人在发笑。不久前他们还像狗一样对他使劲晃尾巴，生怕他看不见。\n　　现在即使他亲口请他们下去代劳一趟，他们也可能装着听不见。他沿着弧形车道走下去。小雨打在脸上凉丝丝。\n　　以前，他的车可以从专用车道直接开到大会堂底层的电梯门口。那是政治局常委的特权。现在，他的常委头街还在，这次会议开始之前，办公厅却给他发了只能从正门进的会议卡，没有任何解释，保卫规格也降了级。他没有计较，无非是走哪个门的小问题。但他心里清楚，这个小变化是个大展览，是给所有参加这次中央特别会议的与会者一个信息：他陆浩然别说当不了总书记，连政治局常委和总理的位置也完了。\n　　三天前，总书记被暗杀的消息刚到北京，他接到王锋的电话。\n　　“请您要求立即召开政治局扩大会议，吸收在京的中央委员参加，推举中央委员会总书记。”\n　　“现在就提出这个要求？”\n　　“对，马上就提。要显得坚决﹑迫切，强调‘在京的中央委员’。”\n　　他觉得这种做法太拙劣，过于赤裸裸。然而看上去王锋要的就是拙劣和赤裸裸。究竟王锋安排了什么步骤，他一点也不清楚。王锋只说他的身份最好超脱，不做别的解释。他心里确信无疑，这次暗杀跟王锋有关。但他不想问也不想知道。既然到了这一步，王锋怎么说他就怎么做，只有如此。\n　　当天晚上，公安部长带给他一份名单。这是内线从政治局的“二号”手边发现而偷偷复制的。\n　　上面是陆浩然的笔迹。陆浩然带着点惊讶反复看那份他从未见过的名单。名单上划分出在京政治局委员和中央委员的阵营。将有三十三人投自己的票，只有二十七人投政治局“二号”\n　　的票。这种划分不是没有道理。虽然他在政治局五个常委中已经落到了“四号”，“二号”“三号”是已死总书记的左膀右臂，“五号”在中间打晃，但“强硬派”成员主要集中在中央各部委，人在北京，“温和派”的多数则主要是那些从自由经济中获得好处的地方首脑。陆浩然按王锋布置要求开会时，强调特殊时期地方首脑宜留在当地稳定形势，而如果参加会的都是在京中央委员，只要陆浩然做一番活动﹑许诺，搞点交易，这个名单的划分真有可能实现。\n　　不过陆浩然惊讶的是自己从未做任何拉票和组织阵营的工作，王锋特地告诉他什么都不要做，为什么对方会得到这样一份“情报”，而且用的是维妙维肖的他的笔迹呢？事实证明，对方正是根据这份“情报”把各省头头连夜调入北京，以增加他们的票数，开成了现在的中央特别会议。\n　　果然，会议卡掉在车里。司机开车把他从停车场送到大门，一个劲儿道歉。以往他会觉得理所当然，现在却有点感激。这两天，他深深体会到被拋弃的感觉，用“众叛亲离”形容一点也不过份。与他同时进门的财政部长和计委主任原来都是他的亲信，现在连招呼都不打，唯恐和他划不清界限，却用过去对他的笑脸和对方的人拉近乎。\n　　三天时间，他经历了大起大落。总书记死讯一传来，“强硬派”像打了一强心针一样振奋起来。挽回颓势的机会来了，陆浩然行情猛涨。“温和派”的走卒也纷纷做出投靠表示。然而陆浩然除了提出个开会要求，一件该做的事也没做。两天之内他就直落千丈。机会稍纵即逝，机会的丧失并不等于仅仅没有进。在一个投机的世界上，不进则退，抓不住机会的人必然要被拋弃。陆浩然当然明白这一点，阵营不能只依靠从前的惯性，如果不及时输入动力，进行推动，一旦遇见一个“坎”就会土崩瓦解。官场就是这么回事，面临剧变，涉及到每个人自身的命运，如果你不出面组织﹑安抚﹑许诺﹑发挥核心的作用，谁会傻呆呆地跟着你呢？人家必然要自寻出路，尤其在你已经带着会议卡，和他们一样从正门进入会议厅的情况下，可王锋却一再强调这一点：不要活动，听其自然，静静观察，把这个关头当做考验每一个人的时机。\n　　他知道不能指望谁能经受住考验，却没想到原来那些信誓旦旦的心腹会背叛得如此恶毒﹑下流﹑令人发指。如果没有王锋安置在每个角落﹑每台电话﹑每辆汽车﹑每间客厅和卧室里的那些窃听设备，他也许永远也不会想到。但是现在录音带就在他的公文包里。他的心从里到外没有一丝热气。\n　　会议在湖北厅举行。陆浩然坐到标着自己名字的位置。没人注意他，似乎他已然成了死老虎。\n　　一旦发现他不足为敌，而且毫无作为，对方原来严阵以待的阵营又开始互相争起来。一派以“二号”为首，另一派由“三号”联合“五号”，两派目标都是总书记宝座。昨天到今天，一天多的时间，原来的统一阵线就杀成了混战一团的新战场。\n　　开会以来，陆浩然只是默默地听着，一言不发。“温和派”内部互相攻击，用的竟都是“强硬派”早已谈过的理论和问题，连列举的实例都一样。当他们和“强硬派”对垒的时候，这些一概被斥为胡说八道和别有用心，现在又毫不羞耻地捧出来当成法宝。“改革”是什么，他越来越清楚地认识到，冠冕堂皇的那些一概不存在，这两个字实质仅仅是既得利益者的阶梯，野心家的挡箭牌和打倒敌手的大棒而已。\n　　“二号”坐在主席的位置，“三号”和他并排。“五号”与“三号”紧挨一起。陆浩然的座位在右边，离他们挺远，半侧半正，明显是个“冷板凳”。每个座位的排列都是办公厅左掂右量出来的，既得体现现实的阶梯，又得预见未来的发展，还得随时根据阵营变化调整，也难为了他们。\n　　国不可一日无君，尽管斗争相持不下，今天也得把代总书记的归属确定下来。根据党章，总书记只能由中央全会产生。但是这个特别会议此刻推举谁做代总书记，谁在将来也就几乎毫无疑问会被中央全会“选”为总书记。这是决战时刻，每个人都感到弥漫在会场的紧张气氛。\n　　鹿死谁手？与会者的视线只集中在“二号”和“三号”身上。陆浩然已被勾销。\n　　一阵喧嚣引起了人们注意，开始像被捅了窝的马蜂，隐隐约约，含着一种惊慌失措，一种不安的躁动，还有一种不祥的预感。很快，每个人都竖起了耳朵，慷慨激昂的发言者也住了嘴。\n　　中央级的会议上何曾听过这种声音。会场上一片揣揣不安的寂静。\n　　声音来自大会堂内部，由远至近，其中有喝斥声，人体移动碰撞声，还有许多只脚踏在地面的声音，象一股令人心悸的洪水。\n　　终于来了，陆浩然想。\n　　会议厅门“哗”地打开。一群乱了手脚的工作人员先被“洪水”冲进来。喊叫呵斥是他们试图阻挡“洪水”发出的。“洪水”倒沉默不语，那些人衣着整齐，举止文雅，既不是军队，又不是暴民，有老人也有妇女，多数是中年男人，每人手提一个公文包。进入会议厅，他们规规矩矩地站住。\n　　“你们是什么人？”“二号”问，有点变色。\n　　“一百四十一名中国共产党中央委员。”站在最前边一个穿西服的中年胖子回答。陆浩然认出他是包头钢铁公司的总经理。\n　　“你们来干什么？”“二号”的口气严厉起来。\n　　“参加会议。”\n　　“谁让你们来的？”\n　　“党章。”\n　　“搞什么名堂！ ”“二号”拍了一下桌子。茶杯盖震得叮叮铛铛。\n　　“常委同志，”胖子说。“党的领袖被暗杀，国家处于危急关头，每个中央委员都该参加到关于党的前途的讨论中来。为什么只由你们九十五个人──不到中央委员总数的三分之一，来决定党的命运呢？我提议，把你们现在所开的特别会议改为中央全会。我们一百四十一人加在座的九十五人，一共二百三十六人，超过中央委员会总人数的三分之二，根据党章，可以召开全会。同意的举手！ ”\n　　新来的一百四十一个中央委员无一例外地举起手，像一片树林。\n　　在座的，只有陆浩然一人举手。\n　　“一百四十二人同意。”胖子宣布。“超过半数。通过！ ”\n　　“二号”怒气冲冲地站起身。\n　　“我宣布：今天的会到此为止，散会！ ”说罢转身就走。\n　　“等一下”胖子说。“这位常委目无党章，践踏党内民主。我提议：解除他的中央政治局常委职务，同意的举手！ ”\n　　门口一百四十一只手臂又长成树林。陆浩然觉得自己处身在一出荒诞剧中，举起的手有点颤抖。他奇怪王锋如何能让这批人如此一致。像历届中央委员会一样，身任部长或省长一类高级职务的委员才是决策核心，其它委员都是像征性的，代表各行各业﹑少数民族﹑妇女﹑青年等等，无非是跟着决策核心跑。即使党内有分歧，也是先在决策核心斗出个分晓来，他们无条件认可。当王锋昨天告诉他空军的六十架飞机已经飞往全国各地接他们时，他还很难相信他们会有什么作用。可是现在，他却明白，举手就是威力。不管为什么举手，他们是中央委员，每只手就是一票！\n　　“一百四十二人同意。通过！ ”\n　　“二号”盯着陆浩然冷笑一声，转身推开通往中央领导人专用电梯的小门。\n　　电梯门正好打开，里面灯光明亮，辉映着一堆亮闪闪的钢盔。胸前挎着冲锋枪的士兵从里面阴森森地走出。“二号”全身抖了一下，连忙退回。尽管门只打开了一半又重新关上，会议厅里的人却都看到了那幅景象。\n　　每双眼睛都紧盯着小门。士兵没有进来，但是透过玻璃砖的隔墙，能看到外面光线衬托着朦胧可怖的影子，一个挨一个地围住大厅。\n　　“我提议，”胖子的声音打破沉寂。“推举陆浩然同志为中国共产党中央委员会总书记。同意的举手。”\n　　树林齐刷刷地长起。陆浩然举起自己手中的红铅笔。胖子刚想唱出“一百四十二”来，陆浩然向他摇了一下铅笔。\n　　沉默。陆浩然挨个审视那些坐在座位上的呆若木鸡者。公安部长最先举起手来。他一直是自己的铁杆，即使有点变节行为也可以原谅。财政部长连忙跟着举起手，似乎为落在别人后面而懊悔，努力做出发自内心的笑容。这是个投机家，而且靠咬老主子来得新主子欢心。陆浩然决心不原谅他。计委主任﹑外交部长﹑副总理……一个接一个，举手的越来越多。后来，连对立面的人也开始举手。最后，他看向政治局常委的席位。犹豫了很长时间，“五号”举起手来。“三号”叹了一口气，也跟着抬了抬手，像是摸耳朵。只剩“二号”恨恨地扭着头。\n　　陆浩然点了一下手中的红铅笔。\n　　“二百三十五人同意。”胖子宣布。“通过！ ”\n　　胖子带头鼓起掌来。一百四十一人那边，掌声热烈。九十五人这边，掌声勉勉强强，疑虑重重，但也不得不鼓。这是中央全会，通过的已不是代总书记，而是总书记了。\n　　陆浩然站起身。\n　　“国家兴亡，匹夫有责。在此危难之日，大家信任我，我也就当仁不让。但是在我们齐心协力开始工作以前，我先请大家听一盘录音带。”\n　　他抬了一下手。今天早晨，王锋的助手特地叮咛他，会场中有一个打红领结的男服务员随时听他指挥。果然，红领结迈着军人的步伐走上前，接过他手中的录音带。录音机早就准备好了，声音马上在大厅里回荡。\n　　这是一盘剪辑整理过的录音带，由很多片段组成。在座的一个个大惊失色，几乎每个人的声音都在上面，全是他们这两天私下交易﹑计划阴谋和讨价还价的实况。每个片段都精心留下了谈话者的彼此称呼，能清楚地知道每句话是谁说的。那些坑害别人的诡计，赤裸裸的敲诈，毫不掩饰的索价，在密室里说出并不觉得刺耳，一旦在大庭广众下用扩音器放出来，就将其中的下流无耻放大了十倍。每个人彼此面对面，却清楚地听着自己的“同盟者”怎么在出卖自己。自己刚说完的话又怎么被“朋友”向敌人告密。或者是当面向自己点头哈腰的人怎样在背后用最恶毒的语言耻笑自己。\n　　“这就是我们的中央委员会吗？”陆浩然痛心地问。“就是我们的省委书记﹑省长﹑部长和政治局委员﹑常委吗？已经堕落到如此地步了！当国家处在危急关头，每个人却都在为个人和小集团进行图谋私利的宗派活动。这样的人难道能领导国家，能对人民负责吗？……”\n　　“安装窃听器违法！ ”“二号”大声抗议。\n　　“国家在危机关头，为了国家安全，有关部门可以使用一切必要手段！ ”陆浩然说。“即使是违法，跟你的违法比起来也不值一提！现在，我以总书记的名义宣布：刚到的一百四十二名中央委员留在北京履行中央委员会职能，其它人员一律进中央党校集中学习，反省整顿！ ”\n　　说完，他离开会场。办公厅那群工作人员立刻又像狗一样跟在左右，为他开门，替他引路。\n　　无言的士兵挡住那群狗。\n　　只有陆浩然一个人走出来。军委办公厅接替了中央办公厅。一个陌生军官引导他。似乎是胜利了，他却觉得无比孤独。\n　　人民大会堂里塞满了野战军士兵。穿礼服的中央警卫团已被缴械，武警卫队也已调离。通讯联络全部切断，只有外地口音的军官对着步兵电台哇啦哇啦地呼叫。而外面的天安门广场，人们什么也不知道，只当是这个国家平平常常的一天，只不过有点雨，初秋的凉意微微渗在其中。"
		},
		{
			"post_id": 16,
			"title": "《黄祸》12",
			"date_published": 1460900992.813,
			"body": "　　加拿大马尼托巴湖畔\n　　他在水下两米处摆出一非常奇特的姿势，双手持抢，瞄向坝顶。\n\n---\n　　女摄影师快睡着了，忽然听到行走的声音。她的摄影棚架在树顶，离地五﹑六米，伪装得非常隐蔽。她一边轻手轻脚准备好照相机，一边在心里揣测是什么动物。要是那头护林直升机驾驶员看见过的虎就好了，准能在“动物摄影”杂志上卖出好价钱。她已经连着来了三天，动物倒是拍了不少，就是没有能卖好价钱的。\n　　当这只“动物”走出灌木，出现在湖湾那座废弃的水坝上，她差点骂出声来。动物倒不假，而且是最高级的动物，“动物摄影”上却决不刊登这种动物。更糟的是，只要有这种动物在场，别的动物就再不会现身。她本想喊一声，可她知道她等待的动物是多么聪明，它们可能就躲在附近，只要她一暴露自己，那就非得她自己也离开，它们才会重新出现。\n　　然而她马上又产生了兴趣。\n　　那个“动物”一放下背囊，立刻脱光了衣服。他的皮肤是金黄色的，身材不高，体形让人想起像神话里的美少年，匀称完美，好似金子锻打的雕塑。\n　　既然他捣了乱，就拍一套他的裸体照卖给“风流少女”。女摄影师浮起恶作剧的笑容，调准她的高倍率远摄镜头。姑娘们看够了西方式的大力神，也许会愿意换换东方式的丘比特吧。\n　　她只来得及按动一次快门，那个东方人已经穿上了一身古怪的潜水服，开始安装一支形状奇特的枪。这小子要干什么？女摄影师纳闷儿地琢磨。想猎杀大鱼？为什么又把废罐头盒在坝顶挂成一排?\n　　东方人下水了。他的潜水服有几片大小形状不相同的“鳍”，平时收拢，展开后可以使他叉开双腿稳稳当当地“坐”在水中，靠调节一组配重和一个气囊来决定身体在水中悬浮的状态。\n　　这个湖湾的水清见底，能看见他每个动作。他在水下两米处摆出一个奇特姿势，双手持枪，瞄向坝顶。那枪上有一左一右两个小浮筒，配有平衡器，浮在水中可以像依托在支架上。看来这套设备掌握起来不容易，东方人反复调整，才使身体在水中平衡。他长久地保持双手持枪坐在水中的姿势，尽管时而有风浪，他像僵化的黑树根一般随波逐流，模样看上去怪异诡秘。\n　　一层飘浮在水面的黄叶遮盖了水下的身影。女摄影师刚想换口气，突然嗡地响起一声戳破水层和空气的闷响，坝顶一个罐头盒“铛”地飞起，划出一道长长弧线，然后叮叮铛铛从坝的另一面滚落。接着飘浮的树叶下一枪接一枪，一个个罐头盒相继在半空飞起，叮叮铛铛滚下坝。一只兔子被响声惊起，惊慌地横穿废坝，跑向另一侧灌木。水下最后一枪使兔子迸起，化成一片飞扬的肉馅。\n　　女摄影师吓得发抖，抱住全身，生怕发出动静。一旦那个水下魔鬼发现她和她的照相机，下一只兔子就是她！\n　　北京十六号机关\n　　左手打倒独裁专制，右手打倒群众运动。\n　　石戈看见妻子瘦瘦的小脸。她爱拿他日见稀疏的头发开玩笑，笑的时候两只眼睛弯成细细两道，瘦弱的小手一根根梳理他的头发。舒服的感觉通电般传遍全身，使他闭着眼睛，在眼角渗出泪水。可是他知道，这不是妻子，只不过是从窗外吹进的轻风。妻子已经在四年前死了，死在一种被专家们笼统称为“环境污染综合症”的病中。当她知道自己体内长年含着不下十种有毒物质时，她凄楚地笑了: “幸亏我不能。”她没说出她不能什么。他只是无言地握着她的小手。她为自己不能生育暗中哭过无数次，甚至要求他再去找一个年轻的。“我给你们当保姆，给你们带孩子。”她一遍遍地磨着他。\n　　石戈醒了，从办公桌上抬起头。每每想到妻子，他的心就像刀剜一样。十点了。办公室里静悄悄。过去他天天这个时候回家。在他的生活中，妻子似乎永远在等待。有时她说: “颐和园的玉兰花开了。”如果他说: “星期天我们去。”可以想见她那孩子般的脸上会放出何等光彩。可他只说: “是啊，花开了。”像回声一样。\n　　窗口的铁栏杆粗密结实，原来是防人从外边破窗而入，这栋楼每个房间都有太多机密，现在则成了防止里面的人越窗逃跑。楼里每一层都有警卫。从底层到顶层被几部不同的电梯隔成几个部分，进入每部分都要登记检查。这些防止外人进来的措施也可以同样有效地防止里面人出去──保密机关变成监狱，只不过是颠倒一下的事，十六号机关尤其现成。当初为了对付没日没夜的紧急工作，每人都配备了行军床和睡袋。机关食堂也早已惯于把饭菜送进每间办公室，此时把通讯一切断，保险柜和抽屉贴上封条，没收钥匙，换一批新警卫，就成了地地道道“请君入瓮”的牢房。\n　　不锈钢餐盘里的晚餐还没动，在灯光下显得陈旧暗淡。石戈毫无食欲地放进嘴里一块冷牛肉。\n　　促进高产的化学饲养使肉味像塑料，嚼起来让人恶心。妻子死后，他每次吃东西都在脑子里放映人类释放的毒素﹑化学药剂和放射性物质在生物链中富集的过程，通过从微生物到植物动物之间的相互捕食，从生命阶梯的最底层攀回最高层，一点不少地再还给人类。他上街经常屏住呼吸，免得吸进满街汽车喷出的废气，可挺不了一会就得更大口地重新补足刚刚少吸的毒。人类就是这么尴尬，自己毒害自己，每个人都清清楚楚，又只能继续受毒。他咽下牛肉，遏制住那种时时统计体内受毒量的不自觉计算。也许只有陈盼的基地能逃避这个满天满地全是毒的世界。假如电话没被切断，他倒真想听听她的声音，只不过她会失望，他将再没有能力为她搞什么基地。\n　　他很清楚这次是孤注一掷，逃不脱现在的结局，但没想到这么快。调查组名义是中纪委派下来，实际主要成员是政治安全局的秘密警察。隔离审查只不过是传统叫法，用的方式完全是对政治犯的。\n　　逐级递选制的构想在他心里埋藏多年了，有时冬眠，有时苏醒。他这茬经历过红卫兵﹑上山下乡﹑反叛与思考的一代人大都为人类前途的大题目绞过不少脑汁。随着心高气盛的年令段的过去，时间的浪头淘走了大部分改天换地的梦想，却把剩下的星星点点衬出更难泯灭的闪光。近几年，这个构想在他心里苏醒的时间越来越多，已经很少再回到蛰伏的巢穴。年轻时他曾把这个构想称做人类的新纪元，现在已经再没有那种自命不凡的傲气和精力，而是带着一种隐隐伤感，一种对未来心力交瘁的焦急和无能为力，求的只是找到一条穷途末路中的出路。\n　　这么多年，他已经把这个构想琢磨得近乎无懈可击，像颗水晶球一样光滑完美。然而越光滑完美，放在脑子里的时间越长，越成为不堪重负的脑瘤。它时时耸动着要从颅骨的禁锢中脱颖而出，变成一个活生生的大世界。但是它终于被拋到世上时，却可能只是亿万人脚下的一粒沙土。\n　　既然连和他朝夕相处的部下能真心相信逐级递选制的也不到一半，“百字宪法”无人正眼相顾﹑只得到挖苦嘲笑也早就可以预料。为此付出全军覆没的代价是不是太没意义﹑太不负责任？调查组开进的时候，他从不少部下眼里看到这种谴责。\n　　他不是不懂得等待，而是已经没有再容人等待的时间。大多数历史缓慢得与人生不成比例，而在历史倒塌的时刻，却可能变成让每个短暂生命眼花缭乱的旋风。今后的中国只要稳定就没有自由说话的可能，而一旦动乱就会落到人人为生死挣扎的绝境，除了歇斯底里的喊叫，不可能有人认真倾听和思考。这次“翻案运动”是唯一的机会。铁板有了缝隙，社会尚未面临生死危机，而多数人都在听和想。逐级递选制此时不出台，也许就永远不见天日。\n　　《百字宪法》印了五百万份。《详析》印了二百二十万份，超出预期。“书商”们干得挺出色。\n　　他们现在已经带着鼓鼓的钱包四散消失。所谓的“百字宪法社”没有一个“民主战士”，全是商人。搞出版的，搞发行的，搞印刷的，靠出下流小报﹑黄色读物发了财。他们是市场经济的共生物，再严厉的取缔也无法消灭。石戈利用他们庞大的地下出版能力和发行网，以及私有制的惊人效率，让他们赚比出淫秽书刊更多的钱，只要按时按量印出他提供的稿子，散发出去。石戈不吝惜钱，他有一笔“引导群众思想”的特殊宣传经费，几乎可以无限支取。\n　　相对前面攻击民主制花掉的钱，“百字宪法”的花销算不上很高。\n　　窗外分布着一块块灯火。灯火之间是一块块黑暗。电力短缺越来越严重，只有靠分区停电来解决。十六号机关有必保供电的专线，是附近一带唯一光明的建筑。大部分调查都莫名其妙地安排在深夜进行。每个问题由不同的调查者负责。政治安全局的两个处长看样子主要负责挖掘“阴谋”。一个共产党内的高级干部和他领导的重要机构以阴谋方式拋出几百万份“宪法”，不可能没有更深的阴谋。如果不是想另立政权，为什么用“宪法”二字？他们把几十张从录像磁带上转下来的照片放到石戈面前。\n　　“……你以种种理由推托‘制止动乱领导小组’分配的工作。做为处理紧急问题的机构，又不参加‘中央应急指挥部’。可是看上去你很爱去天安门广场。这只是从小部分录像中查出的……”这种查寻很费钱和时间。事先要把他的各种角度的图像输进专用的超巨型计算器，与这几个月天安门广场的自动摄像机摄下的录像带一点点对照搜寻，从浩如烟海的人脸中识别出他的图像。所有照片都是他一个人，只有一张是他扛着伊万，陈盼在一旁侧脸看他。这种场合并没妨碍他内心产生一丝温情。看上去挺美满，他自嘲地想。\n　　“我不参加‘制止动乱领导小组’和‘应急指挥部’的工作是因为有特殊任务，去天安门广场是我的工作，正像你们也去的很频繁一样……”\n　　他的身份究竟有多少层，连他自己都说不清。文化革命的狂热一过，他的内心就离弃了共产党。然而这么多年却从未停止过为共产党的治国奔忙。“六四”开枪使他认识到这个杀人暴政注定灭亡，却又因为未参加任何民主运动而被认定“政治可靠”，得到重用。他在人人过关要写的“效忠书”上，用尽心机把每句话写成顺着念是效忠，反着念是批判。他曾给被枪杀者的家属匿名寄钱，却对眼前的“翻案”毫无兴趣。他既憎恨压迫群众，又憎恨煽动群众。\n　　他厌恶统治者出于内斗需要对民主运动的操纵和利用，想方设法不参与，却又担负“特殊任务”。他被群众组织当做“奸细”，又被政治警察怀疑成利用群众搞颠覆的阴谋份子……这里肯定有他油滑的一面，官场上的八面玲珑既是护身符，又为达到目的提供快捷方式。高明的算计和运筹能把最不相干甚至相反的事物组合成一个合力。但更重要的还在于他的落落寡合。他不属于任何一方，没有自己的阵营，却同时反对对垒的双方。他为“百字宪法社”拟定的口号──“左手打倒独裁专制，右手打倒群众运动”──很说明这种双重性。他对暴政和暴民同样厌恶。在他眼里那是相辅相成互补的两面。压迫引起仇恨和暴烈，而群众运动的盲目和残忍只能由更血腥的镇压收场。他以孤独一身要同时打倒这两个孪生的千年孽种，只能靠“借力打力”──又当奸细又当阴谋份子。\n　　身份多有一个好处，随时可以用一种身份掩盖另一种身份。\n　　“……中央的总体战略是通过这次有控制的动乱给人民上一堂政治课。让他们认识到西方民主制与中国的差距和可能产生的危害。这不仅需要行动上努力，还要有思想领域的引导。制止动乱领导小组和应急指挥部做前一种工作。我做后一种。思想工作要对症下药，去天安门是为摸准所谓的症。”石戈和颜悦色。\n　　“‘百字宪法’就是你所谓的药吗？”调查者可一点不放松。\n　　“‘百字宪法社’一共散发了五十三种小册子和四十九种传单，对揭露西方民主的弊病和稳定人民思想起了有目共睹的作用，不应该只提‘百字宪法’。”\n　　“能不能这样理解: 前面五十二种小册子和四十八种传单都是烟幕，为的是掩护后面这颗炸弹？”\n　　“为什么不是反过来，后面这个才是烟幕？以民间组织身份出现容易接近群众。民主组织不能只攻击民主制而没有自己的纲领。打出的纲领不管真假，至少免得人怀疑。”\n　　“这么纯洁吗？你的纲领为什么不是坚持四项基本原则？”\n　　“做群众工作需要迂回，这是党多年总结的经验。我想你们明白这一点。”\n　　“冠上‘宪法’两个字，大概是另有意义吧，总理阁下？”一直没说话的那个处长突然插进一句。\n　　石戈只有苦笑。\n　　为了能随时提供全国性的紧急对策和运作方案，十六号机关内部建立了仿真中央政府的建制。国务院每个部委这里都相应具备，只不过“国防部”在这叫“国防组”，外交部叫“外交组”，“计划生育委员会”叫“计划生育组”，以次类推。每个“组”的日常工作仿真相应的“部”，掌握“部”的资料﹑文件﹑决策，参加“部”的会议，随时研究“部”管辖范围内的动向﹑问题，做出预测，对可能出现的情况进行估计。这种建制适于处理危机，但也培养了内部的一种自大感，很容易把自己看成是真正的治国者而非仿真的。称呼官职就是这种心态的表现。普通研究人员都是司局长。各组组长被称为相应的部长。石戈与各组组长做最后决策的顶楼被称为内阁。石戈便是顺理成章的总理阁下了。石戈多次严禁这种戏谑。为了避免嫌疑，连仿真政府建制对外都保密。每个组只按房间号区分。但还是被“挖”出来了。\n　　“那是年轻人的玩笑。”他不自然地说。\n　　内部可能已经有人开始“揭发”了。几百人里有几个弃暗投明者并不奇怪。他想到的是另外一种人。除了一个特别小组，手下多数人都不知道他和“百字宪法社”的关系。但他们了解逐级递选制，不少人还参与过研究。一公布《百字宪法》，他们就顿时明白他在其中扮演的角色。做为一种学说，他们即使不赞成也不会反对。然而发现自己一向尊敬的人是破坏民主运动的奸细，那种恼火和失望很可能就会用“揭发”来发泄。\n　　手下人全是他自己挑选的，都算得上难得人才。他常跟他们说，如果知识分子有什么作用，那就是当大众全都诉诸情绪时，知识分子依然应当保持一种冷静的理性。他无法说得再深。\n　　全社会都视独裁专制为敌的时候，重要的已经不是去参加那个合唱，而该把理性用于对人人趋之若□的“民主”的批判。在一个最强调多元的时代，赶时髦却造就出人类有史以来最大的一元。连追求多元也成了一种时髦的一元。全世界从思想方法﹑价值观念到时装歌曲全趋于一致。在时髦的叫喊中，有几个人真正懂得“民主”是什么呢？枪杆子灌输的一元还让人心存反抗，广告灌输的一元却让人自鸣得意地以为就是自己的多元。民主无疑比专制进步，但那不是非此即彼的理由，不能因此就不看到它的缺陷。纳粹也是通过民主的选举手段上台执政并且发展成为血腥的独裁体制的。在当今这个由传播媒介操纵的信息时代，能发出强烈声音的少数比沉默的多数受到更多的注意，而当他们的意志通过无孔不入的媒介转化成时髦，就轻而易举地控制了多数。他不赞成那些专门从事煽动，把未来希望寄托于疾风暴雨式的群众运动的民主派。群众是缺乏理性的，一旦被煽动起来就充满狂暴和血腥。法国大革命及中国文化革命那类疯狂时代留下的恐怖就会重现。动乱能摧毁一个旧社会，却不能建立一个新社会。群众运动的最大受害者是群众自身。而民主制范围越大就越荒诞走样，尤其在中国这样一个缺乏法律传统和丧失了道德结构的特大范围里。\n　　一旦真正实行民主制，中国将遭受比专制更大的苦难。他把大部分力量用于打破民主制的虚幻光晕，因为只有民主制的招牌被推倒，逐级递选制才能从后面显露。这种真实的意图，他对自己人不能讲，对调查者更不能讲。\n　　象前几次一样，他温和地拒绝交代是谁交给他“特殊任务”。“只能告诉你们局长，这是纪律。”\n　　他每次都这么说。两个处长没有追问，彼此看一眼，起身离去。石戈躺到折迭床上，困意又袭上来。这时“左派”像当年在山西插队时那样不敲门进来。他终于露面了，拎着一瓶“五粮液”和一包报纸包的“天府”花生。\n　　这当然是演戏。身为国家政治安全局局长，即使不摆排场，也用不着这么寒酸。可石戈并不反感，至少说明他还知道自己怀念那个年代。\n　　喝掉前半瓶时两人基本没说话，只是每喝完一口像老农一样用手掌擦擦瓶嘴，递给对方。屋里只有捏开花生壳的声音，直到酒意逐渐上升，有点飘飘然，“左派”拿起桌上一本《百字宪法详析》。\n　　“我闭着眼睛翻一页。”他说。\n　　他果真闭上眼睛，随意翻开一页，很快看一遍，一边用红铅笔圈了几段，递给石戈。\n　　那几段分别是:\n　　“马克思主义把全部注意力放在消灭生产资料私有制上，忽略了因而也没有消灭另一种私有──社会权力私有制，甚至在消灭前一种私有制的同时强化了后一种私有制。正是社会权力的私有，成为我们社会种种弊病的根源，也是社会主义从人心所向沦落到穷途末路的原因。”\n　　“社会权力私有制有两种形式: 一种是个人私有，一种是集团私有。配以生产资料的私有或公有，组合出世界上四类基本的社会形态。一类是生产资料私有，社会权力个人私有，如封建社会和某些独裁国家，是最落后的社会形态﹔一类是生产资料私有，社会权力集团私有，如民主制社会，人民只能在有条件参加竞选的人中间挑选统治者﹔一类是生产资料公有，社会权力集团私有，这是随社会主义民主化而出现的新形态，党派统治取代了个人统治﹔还有一类是生产资料公有，社会权力个人私有，这是所有社会形态中最糟糕的一类。人民没有任何权利，统治者没有任何制约。公有财产等于是权力占有者的个人私产。这就是实行这种制度的专制社会主义当前遭到全人类共同摒弃的原因。”\n　　“生产资料私有的社会，社会权力再集中也不能完全限制各经济单位内部事务的自主，整个社会因此还有自动调节的补偿能力。而在共产社会，权力因生产资料的公有侵入社会每个细胞，无所不及，无所不管，很少有分权状态予以缓冲。权力占有者的一切妄想荒谬和愚蠢就能得到最彻底的贯彻，权力私有制的危害比任何时候都严重。”\n　　“共产必须共权，不共权不如不共产。”\n　　“这是我闭着眼睛翻的一页。通篇有多少？”“左派”说，直摇头。“每一句都是冲着根儿来的，轻描淡写的解释很难通得过。”“左派”知心地伸出一个手指头指指上面。\n　　石戈与“左派”交往不多，认识的年头却不短了。当年在北京上一个中学，又一块儿去山西农村插队。那时“左派”是个知名人物，经常上报纸，做“讲用”，下乡没两年就当了公社书记﹑县委委员。“左派”的外号也是那时叫出来的。\n　　“你最近见到过总书记吗？”石戈问。\n　　“他视察去了。”\n　　“他应当告诉你。”\n　　“告诉什么？”“左派”愣了一下。\n　　“我的任务。”\n　　“没有……这一段没见……”\n　　石戈心里有数了。“调查”不是总书记的旨意，也许就有对付的办法。正如他希望的，一涉及总书记，“左派”就不敢往下深问。\n　　石戈半躺在行军床上。酒力使他全身放松，有点回到山西窑洞的感觉。现在需要放开一些，让“左派”认为自己胸有成竹。\n　　“你们认为逐级递选制是反马克思主义的，实际正相反，企业和农庄的老板由选举产生，那种社会只能是共产的。在当今世界纷纷退回资本主义的潮流中，逐级递选制是挽救共产主义的出路。指出弊病不是为了推翻社会，而是为了让社会前进。”\n　　这种说话的方式自然有借用多重身份的油滑，但表达的思想却是真实的。当全世界都以取笑共产主义为时髦的时候，石戈却无论如何也不相信，经过那么多天才头脑思考﹑吸引了人类上千年的伟大理想，百年间席卷全球，激荡起人类最崇高的情感，亿万英烈前仆后继为消灭剥削﹑压迫﹑不公正﹑自私与贪婪所进行的悲壮斗争，全然是一个大误会，一次可耻的自我蒙蔽，一场白白捉弄人的大闹剧，大徒劳！ 在感情上，他属于那些在精神与道德世界中不断憧憬和追求的人，而永远不会亲近那些为理想破灭而得意的庸俗政客﹑商人﹑实用主义者和循规蹈矩的小市民以及他们所信奉的私有制﹑物欲﹑贪婪和竞争。即便是为了让那些为信仰献身的死者们不白死，为主义奋斗终生的先辈们不白活，也该在共产主义的前面而不是后面找到出路。\n　　“说我国的社会权力被个人占有合适吗？”“左派”问。他声调平和，听起来甚至有点软弱。\n　　“我们也进行选举。”\n　　“选举有真有假。区别真假的关键在于参加选举的人彼此是否了解。当今世界的所有选举都超出人们能够相互了解的范围，民主社会因此发展出竞选体制让选民了解候选人。但大范围竞选必须利用昂贵的传播媒介。范围越大，竞选成本越高。这点决定了最后当选者属于占有资源最多的那个集团。社会权力也就为那个集团所私有……”\n　　“我国实行的是人民代表选举制。”\n　　“因此保证权力被个人占有。”石戈明知“左派”在引诱他“暴露”，却毫不回避。“选举所谓人民代表的选区远远超出人们相互了解的范围。我国又不提供也不允许有竞选的权利。如果人人只选自己熟悉的人，选票会分散成一盘选不出任何人的散沙。这就决定了事先提出候选人。问题就在这。在互不了解的范围内，选民也不了解候选人，没有赞成候选人的理由，也没有反对的理由。既然自己了解和赞成的人选不上，除了选举候选人别无选择。结果就是候选人是谁，当选的就是谁。即使有所谓的‘差额’，也只是选民在已经被挑选好了的候选人之间进行的一次纯象征的‘挑选’。那么，当选的‘人民代表’实际并不产生于人民，而是有权提名候选人的当权者任命的。在更高层次的选举中，这些‘人民代表’必然要服从任命他们的人。即使有想按自己意志行事的代表，因为越高层次的代表来自越大的单位，越缺乏横向联系，彼此之间更不可能了解，就更需要提候选人，候选人就更保证当选。而最高层的统治者就是一切选举归根结底的操纵者，一切候选人的最终提名者，除了死亡或政变，他永远‘当选’！ ”\n　　“你的逐级递选制有什么区别？”\n　　“迄今为止的所有选举都是在人们彼此互不了解的范围内进行，因而全是虚假选举。逐级递选制的基本思想是把所有选举都限制在互相了解的范围内。一个生产班组的工人是相互了解的。一个车间的班组长之间配合生产，磋商事务，工作上的横向联系使他们也相互了解。在一块共事的人只要人数不超过n，至少在共事的‘事’上，无论哪个层次的选举都保证在相互了解的范围。大区首脑彼此相距很远，但他们要讨论国家大事，相互协作，他们拥有的通讯手段和信息保证他们可以像朝夕见面那样互相了解。那么，造成选举虚假的关键消除了，社会权力是不是就会从私有制变为公有呢?\n　　“人们很难相信这一点，但主要是心理障碍。他们说既然美国人直接选举总统还没打破权力私有，逐级递选制只让人民选举头顶的芝麻官，怎么倒成了权力公有？问题就在这: 美国社会让人民选举他们根本不知其然的总统，却不让他们选举最切身的头顶芝麻官，因为那一来整个社会就得翻个个儿，难道不说明芝麻官比总统还重要吗？专制社会的独裁者只任命直接下级，如各省省长，但并不因此失去对浩瀚如海的基层官员的约束，反而产生放大效应，上面哼一声，下面变成一片雷。逐级递选制颠倒了以往的任免顺序，让人民用任免芝麻官控制整个社会直到最高统治者。这种以多控制少的权力结构比独裁社会以少控制多的结构应当更有效。\n　　“在最基层的选举中，人们决定选举谁或罢免谁的标准是每个人物质的或精神的切身利益。\n　　每个人都希望自身利益得到最大满足。那么以三分之二多数当选的领导者就是这个互相了解的范围内多数人认为最能代表自身利益的人。他在随时可以被罢免的状态下，必须时刻以大多数人的利益也就是集体利益为根本原则才能保持‘当选’。那么他在参加上一级选举时，他的选举和罢免标准就会是自己所代表的那个集体的利益，谁最有利于自己的集体就选谁。\n　　那么三分之二多数选出的那一级领导者就将是最能代表那个选举范围内多数下属集体利益的人。往上每一级选举都与此相同。这就是逐级递选制的集中过程。乌合之众的个人利益和意志这样一级一级集中上去，越来越明朗﹑准确。当最高领袖向n个大区的首脑负责，受他们约束时，就等于正在向全社会负责，受全社会约束。当他在追随自己的n个选举者的时候，实际上他也就是在追随着全体人民。这个世界才真正由‘民’而‘主’……”\n　　石戈突然打住。\n　　“我一说起来就是长篇大论，其实这些《详析》上都有，你肯定早看过。”\n　　“左派”当然看过。但石戈的长篇大论不是白说。“左派”已经疑惑︰这是在受调查吗？假如是炫耀，石戈可不是个凭空冒傻气的人，除非他心里有底。\n　　“总书记知道‘百字宪法社’吗？”“左派”小心翼翼地问。\n　　“当然，他亲自布置的任务。”\n　　“左派”有点吃惊。\n　　只有石戈心里清楚，总书记只是被他的借群众组织争取群众的构想说动了心。官方身份得不到信任，引导群众远离民主制的追求是“六四”翻案为谁所用的关键，所以总书记给他全权和经费，既是他的后台大老板，也是一颗被他牵着鼻子走的棋子。\n　　“他……看过《百字宪法》？”\n　　“当然。”\n　　“左派”在牙缝间吸了一口气，半天没说话。\n　　总书记确实看过。但“当然”二字表达的意思绝不仅仅是“看过”，到底表达了什么又没有界定，全靠听的人自己琢磨。石戈断定“左派”不敢深问，更不敢去找总书记核查，因而最容易被这个落不下把柄的“当然”吓住。\n　　石戈脸上始终带着笑意，一个字也不多说，只是一个接一个地捏花生。“左派”在屋里转了两圈。一只手习惯地捏着鼻尖。万一把总书记也“调查”出来岂不烫手？调查工作最忌讳摸到“通天”的线，一见露点影聪明的方式就是及时打住。石戈在官场混了这么多年，很清楚这点。\n　　“你在理清群众思想方面是有贡献的。”“左派”说。“大家也知道你这个人一向语出惊人，因此倾向于把所谓《百字宪法》及《详析》当做失误，分寸不当，弄假成真，而不做为非组织活动处理。我再做努力，希望尽早结束调查。”他匆匆离去。警卫从外面把门锁上。\n　　石戈站到窗前。细小的闪电在黑暗远方跳来窜去。烈性酒在体内缓缓燃烧。跟总书记谈话时也是这样，虽然那次滴酒未沾，有冷气，汗水却像现在一样流个不停。逐级递选制比梦境还渺茫，可他拼命地说，想把每个字都送进总书记那副一动不动的耳朵里。他知道自己愚蠢，但那希望实在太诱人。没有任何路比统治者自我转变更为捷近。假如能利用专制制度的强大权力和效率自上而下地推行逐级递选制，将是代价最小，成功希望最大，社会过渡最平稳，而人民最少痛苦的和平革命。如果总书记能去做那个永载史册的伟人，他自己宁愿永远置身于伟人的阴影后面。\n　　假如“左派”刚才不被他的“当然”吓住，而是继续追问下去。他纵有天大的胆子也不敢编造总书记的话。看过是当然，看过之后所说的话只有一句: “我看你有点发疯。”“左派”可以立刻把他扔进真正的监狱。\n　　不能说总书记没有想象力和胆魄，敢把黑龙江省“承包”给日本，连石戈都自叹弗如，因此才指望出现更大的奇迹。然而逐级递选制是使亿人之上的主人变成亿人之下的仆人，使至高无上的权力变得朝不保夕，一危及这个本质，再有想象力的当权者也成了死木头一根。石戈实在看不起这种蹙狭，为了保那点过眼云烟的权位，竟舍得放弃改变人类历史的光荣。匆匆而过的帝王有万千无数，而伟人只有那么几座耸立的山峰。\n　　他不把逐级递选制看成是自己的创造，那是宇宙中本来就存在的一种秩序，一个境界。他只是触摸到它的边缘，还远远没有窥见全貌。在这个穷途末路的世界上，他直觉地感到有出路，不是抽象的希望，也不是老生常谈的必然，而是确确实实地感到逐级递选的逻辑正在通向一个全新世界。那世界是什么，也许根本不必费心揣摩，只要实现了逐级递选，它就会自动降临。\n　　他一直没有找到说服人的方式。人类已经习惯于崇拜复杂的论证和大体系。相对于大千世界，一个选举制太渺小。然而那是一只无形之手。关键不是费尽心机设计一个庞然世界，任何世界都会由盛转衰，而是寻找一种自动设计和调节的机能，让新世界自动产生，让未来流动起来，让盛不断取代衰，让新不断取代旧。逐级递选制提供的就是这样一种机能。它的无形之手一旦操作起来，一个选举制就能像胚芽一样长成一个新世界，而且从此不断地自我更新。\n　　从微生物到宇宙，大自然的一切系统都以自动调节机能建立和谐的平衡。只有人类以为自己能统治宇宙，傲慢地用人为调节取代自动调节。在荣耀一时的飞跃之后，难堪地陷入自己编织的罗网。这时再想靠复杂的人为方案摆脱困境，等于是在罗网上继续结死扣。唯一的出路是向回转，回到自动调节中去。逐级递选制不再靠统治者的大脑决定社会，而是靠亿万个细胞做出的反应控制大脑，这正好是自动调节的基本模式。\n　　关键是开始，只要开始，一切就能自动运转﹑扩展和进化。既不需要推动，也无人能阻拦。\n　　然而最难的就在开始。如何开始?\n　　他已经没有任何办法。\n　　所以他才孤注一掷。\n　　这不是开始，只是为开始而做的渺茫开始。指望人们自觉接受逐级递选制和指望总书记被说服采纳同样幼稚可笑。人已经太聪明了，难以回到简单。唯一能做的只是先说出来，印成白纸黑字，让人们知道有这么个东西。当人们最终走投无路的时候，一切都已试过而全救不了人们，也许终会有人想起试试这个。那时才是开始。\n　　而开始就是一切！\n　　因此，值得。"
		},
		{
			"post_id": 15,
			"title": "《黄祸》11",
			"date_published": 1460900281.467,
			"body": "　　北京中南海\n　　要想拖延他宣布翻案，最好的办法不是在内部阻止他翻案，而是到外面去借民主派之手逼他翻案。\n\n---\n　　“收──”\n　　声音好似发自天际，从彩霞中升起，充满安慰，轻柔地飞近，拖着长长的裙裾，带来飘逸的风，像细密的丝网，把扩散的气体笼罩，像母亲的手，逐渐合在一起……\n　　陆浩然全身流动的气感一点点消退。如果说发功时像甘泉沐浴，收功时就像丝绸擦身。眼前荡漾的金色﹑银色﹑群星﹑仙境般的美景逐渐离去，好象在九霄云上飞了一周，他又回到中南海这片翠竹之间。\n　　“请总理进长廊休息。”周驰的女弟子恭敬地说。她是个电影演员，虽已人过中年，仍然漂亮，嗓音也美。跟刚才那个纯净的“收──”相比，此时语气里夹着一丝焦虑，投向周驰的眼光也有隐隐的不安。\n　　周驰坐在太湖石旁的石凳上，举目望着阴云疾驰的天空，全身纹丝不动，神色凝重，似乎在承受无形重压。陆浩然周围成三角站立的三个男弟子也已收功，关注地看着周驰。\n　　女演员拉着陆浩然的手，刚一迈进湖边长廊，一阵风横着荡过，刮起湖面一片涟漪。周驰在风中长舒一口气，稳稳起身，面色微红。三个男弟子簇拥他走进长廊。\n　　女演员屏住呼吸。当她看见掉在长廊外面青石板上的第一滴雨时，发出惊喜的欢呼。\n　　“总理，你看! ”她指着那滴雨，激动得像得了奥斯卡金像奖。\n　　刚结束的气功使陆浩然眼前亮度提高好几倍，可他怎么看也只是一滴雨。\n　　“要不是大师运气把雨托住，它早就下来了。”女演员的神气好象陆浩然什么都不懂。\n　　说到这，天上真是响起一声雷鸣，接着劈劈啪啪掉起雨点，打得竹叶一片哗哗做响。\n　　“人正在做功的时候不能被雨激，做到半截也不能生停下来，哪一种都会让人生病，全靠大师发功托住了雨。”女演员崇拜地望着周驰向陆浩然解释。“我看见大师身上的光晕从绿色变成红色，直射到天上。这是我第一次亲眼见到大师托雨。您看，大师一收气，这雨就下来了。\n　　听说托雨对内气耗损特别大。大师，您感觉怎么样？”\n　　周驰微微一笑，没回答，似乎不值一提。\n　　陆浩然也没有就这个话题说什么。他已经接受了气功，但是就他受的教育来讲，呼风托雨一类的东西怎么也像是神话。他毕竟是五十年代的留苏副博士，又搞了多年的科技工作。然而眼见的一些事实又由不得他不信。那个脖上有疤的男弟子曾把他亲手写的字条嚼成纸糊，又复原成原样，字条还潮呼呼的。他不会看错那上自己的签名。他有时想这是不是一种高明的戏法？刚才那个托雨也许只是正好在下雨之前他走进了长廊，而不是周驰能让雨在他走进长廊之后才下。虔诚的女演员容易受暗示，周驰可以通过对女演员的暗示进行控制。如果真是戏法，这个周驰想达到什么目的呢?\n　　据说周驰五十多了，看上去就像三十多岁。一双小眼睛亮晶晶，非常有神。皮肤光滑细嫩，几乎连一根皱纹也没有。只是有点驼背，使他显得像个弓身等待扑食的豹。他是全国气功学会理事长。这个学会在全国各地都有分支机构，正式会员二千六百多万，还有好几倍于这个数字的气功爱好者。这么多人全都真心崇拜他，再有权势的政治家也不得不羡幕。他现在每星期来中南海两次，为陆浩然组场发功。所谓“组场”就是让他的三个男弟子围绕陆浩然布成一个气阵，女演员与陆浩然相对补以阴气，在他的总体控制下，集体对陆浩然发功。据说在这种气阵中受功者的修为可以在不知不觉中突飞猛进，身心得到的益处更大。练功者能得到这种扶助的自古便是凤毛麟角，当代也许就再无旁人。\n　　陆浩然练功已有几年历史。开始只当做养身之道，练练停停，没什么长进。自从在政局中冷落，被挤出核心，练功兴趣才逐渐浓起来。可能因为心灰意冷，下意识地需要一个寄托，也是因为难得有了许多空闲时间需要打发，但主要是因为周驰。卫生部部长亲自向他推荐这位“气功宗师”。周驰的气阵使他感到心驰神醉，如升九天，身临仙境。受完功后感到如同换了一个新人，充满活力，全身轻松，精神振奋，而且每经过一次气阵，他的感应就提高一块。\n　　短短两个月，他已觉得今非昔比，气功对他的意义已经变得相当重大。每次做功都好象过节，一做完就开始盼望下一次。\n　　也许这是人类未知的全新领域。既然人类认知没有止境，就不该把原来的观念当做永恒真理。\n　　陆浩然的判断又荡到另一个方向。他总是像钟摆一样在怀疑和相信二者之间摆动。这真是使他烦心。大半生都很明确地走过来了，突然一切又全都变得摸不准。而在摸不准之中，就不免产生出某种敬畏。敬畏什么呢？他瞟了一眼周驰，正和那尖利明亮的目光相遇，不禁一下又把目光闪开，心中不免沮丧，身为一国总理，他倒真是不能看轻这个坐过牢﹑跑过江湖的气功师。\n　　工作人员通报公安部长来接他。他跟周驰握手告辞，没说什么感谢的话。然而和最初的坦然受之不同，心里已经有了一种忐忑不安，越来越想讨好面前这个人。\n　　公安部长直皱眉头，行车时把手伸出车窗，从落在掌心上的雨点判断雨的趋势。行动马上要开始，如果雨大起来，说不定就会落空，至少也影响效果。十七号楼保密室的电视屏幕展现出聚在天安门广场上的人群正纷纷散开避雨，不过外国记者还都留在原地未动，只是在他们的摄像机上打起了伞。\n　　“外国记者在场就行。”公安部长说。“看热闹的人少点无所谓。”\n　　近来陆浩然每天都在这间保密室看一会儿天安门广场。今天比较特殊，公安部长陪着，工作人员未得到指令一律不许入内。\n　　公安部长扳动一个类似游戏机操纵手柄的控制器。电视画面随着手柄扳动方向左右横移，或者前推后拉，还可以变换画面。天安门广场安置了多台自动摄像机，和设在大会堂里的控制中心相联。眼前的屏幕通过保密电话的专用电缆不但可以接受画面，还能指挥那些摄像机动作。\n　　雨不断加大。广场上一片水淋淋。地面被雨打起一层白雾。旗帜湿淋淋地垂成一条条。标语的墨迹开始流淌。到时间了，外国记者纷纷看表。没有任何行动迹像。下雨容易让人改变主意，或者是觉得不适于燃烧，尽管汽油并不怕雨。周驰能不能把雨托住呢？陆浩然想。雷鸣宏亮密集。一个人的肉体之躯难道能与天空的能量相抗衡？气功如果真有这么大能力，人间的一切就都将望尘莫及。然而他没有把握，除了刚才那个“托雨”是真是假，还有周驰是否会用这种能力为他服务。他决定试一试。\n　　“周驰同志，”趁公安部长出去的一会儿，他拨通了近来常拨的那个电话号码。“为了国家利益，我希望你能让天安门广场上的雨停一会儿。”\n　　那边没有声音，也没有听出挂机。电话线路好象突然中断，里面成了真空。公安部长进来，他刚让手下人查问。“气象台说三分钟内雨会停。”他兴高采烈。陆浩然却有点恨他。回过头去看屏幕时，雨果然已经小了，接着出现一束阳光，晃得广场亮堂堂。夏天的雨本来就忽有忽无，不用气象台，也不用气功师，任何人的预言都至少有二分之一的准确概率。陆浩然重新拿起电话听筒，很正常，电流均匀地嗡鸣。这个周驰到底是个什么货色？雨到底是怎么停的？陆浩然什么验证也未得到，反而更加疑惑。\n　　西山谒见“主席”，除了得到支持他出任总书记的许诺，具体步骤一点没向他透露。王锋说他的身份最好超脱些，不适于牵扯进中间环节，只有一点需要他: 在发生根本性变化以前，不能让现任总书记公开为“六四”翻案。\n　　陆浩然乐于“超脱”。如果军方行动失败，他什么都不知道，也未参与，自然没有干系。而阻止为“六四”翻案，没有军方，他也是不遗余力的。他很清楚现任总书记的策略: 既把“六四”翻案做为打垮强硬派﹑收买民心和获得国际支持的武器，又不让这武器被民主派利用，反而要借此搞臭他们。看上去这两个目标不可能同时实现，尤其后一个目标似乎是个悖论，但“二等兵”的狡诈正体现在这里。他利用当年东欧的经验，不是压制民主派，反而让他们一股脑出笼，充分表演。那些人大喊大叫民主，实际一旦有获得权力的可能，就会把主义丢在一边，甚至连廉耻也不要。当他们觉得共产党步步后退，最终会被迫放弃一党专政，而由他们取而代之时，他们的斗争矛头就会立刻转移到彼此之间。“二等兵”正在制造这种“被迫后退”的假像，而且一会儿和这个谈判，不理那个，一会儿让那个占上风，使另一个丢脸，巧妙地挑拨离间，煽动妒心，利用民主派缺乏理性和控制的一面，把“民主斗士”们的野心﹑党争﹑不择手段暴露无遗。人民很快失去了对他们的信任。他们原本在“六四”事件中获得的政治资本也因此化为乌有。同时，当局一方面控制着不发生伤害根本的混乱，却又改变八九年的做法，不再费力不讨好地拼力维持社会运转，而是有意不施加调节，强化表层混乱，让人民生活发生困难。北京市各部门同时大撒手，水﹑电﹑煤气纷纷中断，粮食﹑蔬菜供应不上，交通邮电半死不活，犯罪率大幅度上升。伪装成歹徒的秘密警察在整个北京城抢劫﹑放火﹑制造恐怖，新闻媒介再按统一口径大肆渲染，把一切归于动乱形势。老百姓很快被吓住了，对民主运动从普遍支持变成害怕厌恶，甚至抱怨当局软弱，未采取强硬措施稳定形势。\n　　群众转向之快各方都感到意外。翻案而不动乱的局面已经成熟，既可以把“六四”蓄积的怨气一泄而光，又已让“害群之马”离了群。今后若干年的政治稳定由此有了保证。原来温和派自己预计至少还需一个月才到公开翻案的时机，形势的迅速发展使他们决定提前，明天就宣布。\n　　不管军队能制造出什么变化，只要“二等兵”还在总书记的位置，他宣布的翻案就代表国家和党，不管谁再想往回收都不是一件易事，会引起无数麻烦和灾难性后果。这也是“二等兵”\n　　急于把生米做成熟饭的原因。如果召开中央全会讨论，陆浩然可以动员起相当的反对票，至少能做到议而不决，无法形成决议。然而“二等兵”玩了个花招。他将在明天接见“华盛顿邮报”主编时以“个人身分”表示赞同翻案，那将立刻在国内外引起轰动，再召开中央全会，那时有先声夺人的舆论逼迫，多数中央委员不敢逆潮而动，翻案决议就会在全会上通过。\n　　公安部长出了个主意。在陆浩然左右，他是最有鬼点子的人。“二等兵”要想同时打着“二鸟”，手里那块“翻案”的石头就必须以赐予的形式拋出，而决不能是被逼着扔的。一旦有被逼之嫌，随翻案而来的民心和桂冠就给了逼的一方，动乱分子就有了新的市场，他自己则成了落水狗，所以要想拖延他宣布翻案，最好的方法不是在内部阻止他翻案，而是到外面去借民主派之手逼他翻案。\n　　怎么逼？游行示威已经没人感兴趣了。绝食几起几落。电视播放了绝食者偷吃食物的大量录像后，已经成了玩笑。最后通牒下了无数次，没人再认真。能做的都做了，也都失去了效果。\n　　只剩下一件事有人说过，却至今还没人做──自焚。\n　　自焚不像绝食可以当面绝，背后吃。汽油一燃起来就要经受里里外外每个细胞每根神经每滴鲜血燃烧的过程。在这个利润的时代，这种没有一丝赚头的残酷献身几乎不可能想象。然而公安部长的想象力却不那么悲观。他确实找到了一个，而且通知了外国记者，让他们带着所有记录和传播的工具，赶到天安门广场。\n　　屏幕右侧的人群突然乱起来，一个刚划着火柴点烟的男人被按倒。几个穿便衣的汉子把从他身上搜出的白酒传着闻了一遍，倒在地上。消息显然已经走漏。广场上到处都是便衣，检查所有的瓶子﹑水壶和饮料。西方记者被劝告离开，否则不保证安全。北京公安局效忠总书记。\n　　大批警察陆续赶到。对方意图很明显，只要抓住或吓住自焚者，保证今天不让这个人烧起来，总书记明天就可以按计划“赐予”翻案。\n　　公安部长操纵画面摇来移去。陆浩然看着有点头晕，闭上眼睛。其实他听个结果就是了，没必要目睹现场，只是事关重大，一旦失败，后备方案几乎没有。\n　　“她来了。”公安部长的声音喜忧参半。\n　　画面停在一个年轻女人身上。推成近景，她脸庞瘦削苍白，有点歪斜的眼睛茫然散光，细小牙齿咬着没有血色的嘴唇，牵动下颚向一边扭曲。她一身病态，这么热的天气还穿长袖衣裤，瘦得像个纸人。一对乳房却异乎寻常地丰满，高高撑起胸前的衣服。她孤零零地站在一边。\n　　忙碌的警察没人注意她。公安部长很满意这点。警察的思维模式会自然而然把自焚者想成意志坚强的人，这种病弱女子看上去根本不贴边。这也确实，公安部长对她的意志毫无把握。\n　　她是个癌病患者，两个乳房被挖得干干净净。未婚夫吓跑了，癌细胞扩散到全身，医生断言她只有半年好活。她等不及，自杀过两次，都被家里人及时发现，硬救她活过来。打着“人阵”招牌的公安部人员许诺，只要她用自焚的方式死，就给她家三百万元钱。这世上她唯一爱的只剩父母，能用这早就不想要的生命给他们的贫苦晚年换一笔可观财富无疑吸引了她。\n　　然而自焚毕竟和吃安眠药不一样，太痛苦，太丑陋，太作践自己。她对政治毫无兴趣，不想当烈士，对“名传千古”的开导也无动于衷。她只知自己是一个还未结婚的姑娘，不想烧光衣服，烧掉皮肤，再烧出骨头。她怕疼，超过怕死。最后是一个最简单的许诺使她接受了交易: 事先给她进行全身麻醉处理，她能保持神智和行动能力，但不会感觉疼痛，她将安祥地“在烈火中永生”。\n　　然而她还是临场畏缩了。预定时间已经过了半小时。不少记者正在把摄像机装回箱。她还在发呆。如果她不自己下手，谁也不能上前去烧她。她要是被警察捉住，十分钟内就会供出一切，让人顺藤摸瓜，说不定能一直摸进这间保密室。“得有人促进。”公安部长恼怒地嘀咕。\n　　他的部下没让他恼怒太久。一群带着“人阵”标志的男女横晃着走过去，像一个浪头包住一粒小石子。人太混乱，从大会堂顶层瞄过去的窃听波束分辨不清谁跟她讲了什么，也看不清是否有动作。浪头过去了，小石子重新露出，还是呆呆的。那群人在不远处和警察冲突起来，吸引了广场上的注意力。公安部长把画面景别推到最大。能分辨出一种液体从姑娘的裤脚流出，和地面积的雨水混在一起，难以分辨。“下雨有下雨的好处。”公安部长说。平时他不这么唠叨。汽油是用塑料袋盛装，绑在姑娘胸前，代替挖掉的乳房。高耸的胸脯一点点坍了下去。不知汽油袋口的拉线是“浪头”冲开的还是她自己拽开的。她的外衣里面有好几层内衣，可以充分地吸收汽油。吸收量经过严密计算，保证能把她烧死而不是只烧焦一层皮。\n　　“汽油味! ”有人高喊。公安部长猛拉大画面。警察炸了窝一样乱窜起来，掀起一片骚动。\n　　这也许使姑娘受了惊吓，干枯的小手嗖地从兜里抽出，一个红彤彤的大个打火机握在手里。\n　　旁边正好走过一个金发碧眼的西方女记者，尖叫着一跳躲开，同时把摄像机麻俐地举在眼前。\n　　三条大汉发现了目标，从十多米外鱼跃般地扑了过来。\n　　“六四……”姑娘颤声张开黑洞洞的嘴。交易规定她必须在点火前喊出口号，以证实她是为“六四”翻案而不是为别的事自焚。她背了无数遍拟好的口号，到头来还是没记住。“……\n　　翻案……”只出来两个词。好在也够了。火苗从打火机上窜出。那是事先一试再试绝对保证一打就着的防风打火机。然而就在火苗窜出的同时，一只巨手已经抓住了打火机。\n　　陆浩然几乎要喊出声来，功亏一篑! 火苗没接触到汽油，姑娘没有被点燃。另两个大汉已经抓住她的身体。她再挣扎也敌不过三头大猩猩。何况她半点挣扎的意思也没有，一动不动。\n　　全部过程只有零点几秒。打火机眼看着进了大汉的手。突然轰地一亮，姑娘化做一团火球。\n　　三个大汉被爆发的火焰打翻。火团中发出一声姑娘凄厉的长叫，如同野兽，只分辨出其中两个字: “……骗──我──”她像被飓风刮起一样扑向广场人群。人们轰地四散而逃，跌倒的﹑被踩的﹑喊叫的，乱成一团。西方记者玩命往前冲。警察们抱着灭火器到处追。姑娘扭着﹑跳着，谁也不可想象人的肉体能有这种跑的速度﹑跳的高度﹑扭曲的频度。灭火器在四面堵截，射出粉状﹑雾状﹑泡沫状的喷剂，全被她的奔跑﹑跳跃和扭曲甩在后面。她和火融为一体。衣服一块块脱落，散落在她跑过的地面上燃烧。她的皮肤像飞转的色轮一般变色，转眼间就化成漆黑。一辆敞蓬警车呼啸着追了上来，车上架着形似野战炮的干粉灭火器，在追她的过程中至少撞倒五个人，刮坏一个灯柱的水泥座，从一堆记者的器材上压过，把各种镜头撞得满天乱飞。当发射的大团干粉终于铺天盖地打中她的时候，惨叫声停止了。飞扬的白粉散开，火灭了。她倒在纪念碑的石座之下，两根烧秃了的臂骨僵直地指向天空，身体缩成一块冒烟的焦炭，只有小腹的油脂还像天灯一样燃着不熄的火苗。灭火粉剂烧成一层黑色泡泡，糊在残骸的整个表面。大腿内侧慢慢翻卷，露出一团黄色的淋巴组织。\n　　“这帮家伙真蠢! ”公安部长显得气哼哼的。“灭火器能救活她吗？没等烧死就先窒息而死了。”他似乎完全从职业的角度挑对方的毛病，其实是掩盖自己就像刚看完一场赌赢的球赛一般得意。\n　　成功了。陆浩然却没有振奋的感觉，反而反感公安部长的评论。\n　　“反正她得死，窒息而死还少受点痛苦。”他心里一动。“不是给她做了麻醉处理吗？”\n　　公安部长微笑起来。\n　　“那是安慰性处理，促使她下决心。真做处理怎么会有这种效果？会显得不正常。”\n　　在此之前陆浩然一直把姑娘当做个符号，跟α﹑π﹑ｎ﹑ｘ一样笔划简单，在解题中随意摆弄。不知为什么，他现在却记住她在燃烧中闪露了一下的臀部，虽然那臀部只有一秒钟是白色的，却让他意识到她是一个人。公安部长稍许带点夸耀地透露事先在她身上暗藏了遥控发火器，只要她按下打火机，是不是她自己点着的火就无关紧要了。现在他的手下正在趁乱找回发火器残骸，以防落到调查人员手里。“万无一失。”公安部长保证。\n　　屏幕上，广场的人群含泪默哀。刚发生的一幕虽然惨不忍睹，却无异一剂强心针，使“民主派”原来日趋低沉的士气突然激昂起来。人们互相感染。许多人还不清楚怎么回事就跟着落泪。“人阵”和“民阵”的高音喇叭播放哀乐，紧接着便争相把刚就义的烈士说成是自己的成员。公安部通过内线把材料提供给了“人阵”，“人阵”就占了上风。“民阵”连烈士姓名都叫不出来。整个广场逐渐汇集成一个有节奏的吼声: “六四──翻案! 六四──翻案! ……”这是烈士的最终遗言，以死相许的目标。至于烈士燃烧起来后惨叫的“骗我”是什么含意，人们当然不知道那是疼痛揭穿了假麻醉后的悔恨，而当做对政府欺骗人民的抗议。\n　　人群越聚越多，开始与警察冲突，掀翻汽车，砸碎路灯，踩倒树墙。警察全部撤退，显然不想扩大事态，免得使事件更为轰动，但是发生的一切已经足够了。通往西方的天空已经布满了电波。在打进群众组织内部的公安部人员鼓动下，骚动会继续下去。明天宣布翻案肯定不可能了，要想让这一事件引起的影响平息下去，至少一个月。那时也许就是另外一个局面了。\n　　多么完备的阴谋啊。那声凄厉的惨叫“……骗──我──”始终萦绕在陆浩然耳旁。他不寒而栗。自己会不会有一天也被烧成那样的煤球呢？他能相信军队吗？仅仅就凭着一个许诺?\n　　他闭上眼睛，朦胧中有晃动的图景。他试图看清那是什么，但模模糊糊，总也聚不住焦点。\n　　周驰曾保证可以为他开发出预测和遥感的特异功能。他当时没有说出他要那功能的目的。别的都不重要，他只想识破一切围绕他的阴谋。他还很想问一问周驰，无所不能的气功，能不能穿透时空，不露痕迹地把国家敌人──当然也就是他的敌人──置于死地呢?"
		},
		{
			"post_id": 14,
			"title": "《黄祸》10",
			"date_published": 1460812199.739,
			"body": "　　台北\n　　“我给你六百万，”那个共军上校回答。“但是必须在中国，必须在四十五天之内，必须死! ”\n\n---\n　　整个台湾岛似乎只有一个人对刚刚结束的大选漠不关心。\n　　而对全体台湾人来说，这次大选的意义超过许多最重大的历史事件。\n　　表面上只是执政党的更迭。民进党以52%的多数选票战胜国民党，取得了“中华民国”的执政权。这种更迭在任何一个实行多党制和竞选制的社会里司空见惯。然而对于台湾，其意义不仅在于执政几十年的国民党下台，民进党建党以来第一次执政，更重要的在于这是台湾人民对台湾前途一个转折性的新选择。\n　　一九四九年国民党在大陆被共产党击溃，退守台湾，几十年来奉行与共产党不共戴天的“反共复国”为基本国策。然而某种意义上，国共好象同室操戈的哥儿俩，虽然你死我活，却有割不断的血缘，都认定自己是“室”的主人，把“家室”统一视为己任。\n　　蒋氏政权时代，“反攻大陆”的政治目标和军事准备成为不自量力的侈谈，台湾的经济起飞却令世人瞩目，远远把大陆甩在后面。台湾做为独立力量在国际上生存几十年，政治观念﹑文化意识，生活方式都与大陆发生了根本的歧异。在多数人心目中，自己已无所谓中国人，而仅是台湾人。台湾与中国彻底脱钩，成为一个独立的主权国家的“台独”运动便由此发展起来。\n　　国民党政权曾对“台独”运动进行严厉镇压，然而随蒋经国死前实施的“解除戒严”﹑“开放党禁”两大措施，代表台湾本土意识的民进党顺时而生，“台独”势力也蓬勃崛起。民进党许多成员都是铁杆儿的“台独”分子，曾一度把党的从政宗旨公开放在“台独”上，后来虽然调整了策略，这个目标却一直不变，民进党只有依靠本土意识才能战胜国民党。一九四九年以后出生的台湾人在台湾人口总数中已占绝大多数，隔离半个世纪，中国大陆对他们同大多数外国一样陌生，除了那儿的市场和资源，其它方面引不起他们的兴趣。国民党挂在嘴上的“统一”一直被他们认为是毫无价值的陈词滥调，台湾岛虽然不大，生活起来却很美好，有什么必要和一个随时能吞掉自己的大家伙搞统一呢？不过多数台湾人也担心公开独立会招惹大陆对台湾用武，二者毕竟不成比例，台湾抵挡不住，那样独立谈不上，生存也无法保障。对于一个工商化社会，眼前的利益永远是第一位的，所以多数台湾人也反对赤裸裸的“台独”主张和过激行为，名义不重要，只要能在实际结果上使台湾和大陆永远别弄到一起去就行。民进党接受早期操之过急的教训，实施了一种“无旗战略”──既不谈统一，也不谈独立，只要维持现状，主张与大陆一切正常化，力促两岸贸易往来，就像长大成人分家的两兄弟，互通有无，算帐清楚，其它方面则井水不犯河水。这个正确策略逐年得到越来越多选民的意会和拥戴。国民党后来虽也迎合台湾人之心态软化了坚持统一的立场，搞起“两个中国”\n　　或“一中一台”，但它的“大陆根”毕竟太深，难以弥合与台湾本土的歧异，最终落得这次大选的结果。\n　　整个台湾岛都被选举结果震动，从上到下一片混乱。各国驻台北办事机构忙得不可开交。迟到的记者们更是像蝗虫一样从世界各地飞来，又把无数电波向世界各地发去。这其中，唯有一个人置身于外。他既不看当天的报纸，也不理睬电视和广播，对街头演说﹑两派争论全无兴趣，更不参与公共场所的议论﹑欢呼和冲突。他在阳明山公园一片寂静的小树林里悠然欣赏着一种亚热带球状的琥珀色果实。往日那些闲情逸致的游客，打太极拳的老人，或是谈情说爱的情侣都被外面的热闹吸引去了。但此时若有人能从数米之外看见他的话，一定会对他的姿势感到奇怪。他的眼睛离那串果实未免太近了，而且只盯着一串果实。如果从两米之外一个特定的角度看他，就会发现他原来不是在欣赏果实，而是在欣赏自己。一枚椭圆形的小镜子挂在果实和叶子之间。看他那副专心致志的模样，不时地抹抹嘴唇，弄弄头发，一定会让旁观者觉得他有自恋症一类的怪癖。但是再近一些，而且是从正面观察，就会发现随着手在脸上动作，他正在逐渐从三十岁的年令变成五十岁。仅仅几分钟，当他最后把一撇小胡子贴在嘴上，戴上一副老式金边眼镜时，他便从刚才那个轻松愉快的菲律宾富家子弟变成了一个呆板博学的日本防卫厅学者。原来的皮背包翻过来拼装成一个精致的公文皮箱。而花里胡哨的衬衫翻过来就显得陈旧保守。他的步伐也从轻浮的窜跳变成了军人式的端正。招呼出租车的手势如同敬军礼。当他在中华民国国防部军事情报局资料馆查阅资料时，他的形像﹑语言和证件都没引起任何怀疑。\n　　全世界有关中共政权的资料属台湾最多，台湾又属这里最多。其它国家研究中共政权也许仅仅出于政治或经济利益，或是有备无患，只有台湾是出于生死存亡，而台湾军队又是这生死存亡的首要担负者。所以“中校”──现在叫“小野中二”──索要的资料虽然只是“中共领导人的保卫方式”这样一个极细的题目，从库房里推出来的却是满满一车。这是几十年从不间断地从各种报刊﹑出版物﹑回忆录﹑审讯材料﹑外国人的访问见闻﹑叛逃者的描述以及潜伏在大陆的情报人员的调查一点一滴汇集而成的。即便中共在这方面从来讳莫如深，几十年所露的蛛丝马迹拼凑在一起，整体的形像也差不多一览无余。\n　　“中校”看得很快，再复杂的保安措施他都一目了然。暗杀专家必然是保安专家。他在这方面已经一通百通。何况他刚刚在香港的图书馆坐了十好几天，所有的背景情况已经了如指掌。\n　　他常做出眼神不济的老态，把放大镜举在眼前。放大镜手柄中的照像机就无声地闪动快门。\n　　虽然还会对底片进行深入研究，总的情况已在他脑里清晰地展现。\n　　用他的眼光看，中国的保卫措施没有一处称得上高明，然而却最难下手。他精心研究过近代历史中所有对国家领导人的暗杀，除了有组织的大规模行动，几乎全是在公众场合进行的。\n　　必须见到对像，然后才能瞄准。西方领袖为了获得选票，不能不在在公众场合频繁露面。为了那个美丽的民主程序，他们的日程甚至得公开，几点几分在哪做什么活动，经过哪条大街，参加哪个集会。那么，即使他们的保卫工作再优秀，又如何能在那么多窗子中找出哪一个藏有枪口呢？中国领导人却不同，他们的一切都与社会隔绝──住在隔绝的大院里，坐着隔绝的汽车，开着隔绝的会议，进行着隔绝的旅行。连他们的公开也是隔绝。如果他们需要“和群众在一起”，他们会隔绝地出现在群众中，然后再不隔绝地出现在报纸和电视上。隔绝是保卫工作最好的武器。再平庸的保卫有了它，也近乎于万无一失。\n　　在银座的那家妓院里，他开价五百万美元。假如可以趁总书记访问日本期间下手，他只要三百万。哪下手都比在中国方便。\n　　“我给你六百万。”那个中共上校回答，一根眉毛都不动。“但是必须在中国，必须在四十五天内，必须死。”\n　　昨天晚上，他在香港第一次给上校留下的号码打电话。按照约定，他要求知道旅行社的安排。\n　　对方念了一份冗长的日程表，很精细。当他按照上校交待的规则做了一番复杂整理，便出来一份中共总书记在未来一个月的活动安排。现在，“中校”在脑子里把那安排反复过来过去。\n　　中南海他肯定不想进，那里的兵几乎人挨人。在北京伏击车队也不可能。中共首脑在保护自己方面不惜重金。防弹车的保险系数相当高，炸翻几个跟头也伤不着里面的人。专列车厢也是如此，即使把它从桥上炸进河底，它也能八小时内不渗水，有氧气，与外面保持联络……\n　　不要说这些方法几乎毫无希望，哪怕有一半的成功可能他也不会用。现在唯一的优势就是中共政权的最高领导人从未遭受过任何暗杀，警惕性长期受不到刺激就会麻痹，而这种麻痹是可能成功的唯一保障。一旦打草惊蛇，得手的希望就趋于零。所以不干则已，要干必成。\n　　他把那些北京的活动一股脑甩掉，安排中只剩下将在月底开始的外出视察。只要乌龟走起来，总比趴在窝里露头的机会多。视察范围主要是黄泛区: 开封﹑兰考﹑徐州……黄泛区以外只去一个三峡水库，为刚刚完工的第一期大坝工程剪彩。\n　　视察灾区必然要看望灾民。从昨天起，“中校”一直在这点上动脑筋，但始终没有突破。看完眼前这些材料，更觉得难以把握。第一，他不可能准确知道总书记具体会在开封﹑兰考﹑徐州那些笼统地名中的哪个县，哪个区，哪个乡，哪个村。那些安排都是临时确定的。设在北京的电话即使能知道，那时他身在灾区，上哪儿打长途电话？这类事看着是细节，却是关键，可行与否全取决于这种细节。第二，中国领导人的“和群众见面”都是在被封锁的场合，能接近的人都是“有组织”“有纪律”的。这种名义上的“公众场合”等于是中南海后院的延伸。在无法事先制定出精细方案和安排好退路的条件下，他是不会拔枪的。他做的是生意，生意的第一原则是保本，尤其这种本一丢了可就再也回不来。\n　　就是为了保这个本，他要求中共上校说出他的老板姓名。“没有这么一个名字，我怎么相信你们会履行刚才达成的协议──保证我活着离开中国呢？公布一个没有老板名字的录像不会形成任何威慑。有几个人认识你，上校？”\n　　那一阵儿看上去生意马上就会吹。“中校”要的名字必须货真价实。欺骗没有用，他对中国的情况并不陌生。上校激烈反对，不过争执时间一长就看出那反对更像是卖关子。火候到了差不多的时候，上校收起反对，悠悠然开口。\n　　“如果你得到名字，付在你名下的酬金就不该是六百万，”他打暗号似的挤了一下右眼。“而该是八百万。”\n　　上校把五百万说成六百万的时候，“中校”开始喜欢他，他把六百万说成八百万，“中校”就开始佩服他了。不愧比自己军阶高一级。\n　　“我会给你一个账号。”上校说。“你把多出来的二百万转过去。用句中国话说，那只是‘借花献佛’。你将得到的名字值一个中国。有了这个名字，你就会像被装进保险箱那么安全。”\n　　上校的眼光亲切坦然。钱是老板的，账号却自然是他的。“中校”敢肯定那账号名下已经有了不止一个两个二百万。\n　　“我一个人独吞八百万不更好吗？”“中校”笑嘻嘻，当然是开玩笑。不用上校暗示，他就知道对方也留下了威慑自己的“王牌”。对这样一个人，宁可把他当成同谋，别把他当成对手。\n　　那名字只有两个字: 一百万元是个“王”，一百万元是个“锋”。\n　　中共总书记的视察路线在“中校”脑子里一圈又一圈地流动。怎么流动也不对劲儿，越流动越找不到契机。他终于断定，应当反过来──“守株待兔”。“中校”很喜欢这个中国成语。\n　　兔子到处跑，它必然要撞上的“株”在哪呢？……突然，“中校”把全部灾区也甩掉了。在他的脑海里，出现一道白色的坝。三峡! 白色的坝照亮了他的脑海。\n　　“小姐，长江三峡的，大坝的，资料，有没有？”他用生硬的汉语问女管理员。女管理员在计算器上查找一番。\n　　“对不起，这类工程问题的资料我们这里收得不多。”\n　　“小野中二”刺耳地笑了一声。\n　　“工程问题？台湾军队错了的认识，有战争，大坝十个氢弹的是。”\n　　一个正在查找目录的台湾军官抬起头。\n　　“先生对三峡工程有兴趣，可以去加拿大。加国为了拿到这项工程，做了多年研究。这方面的材料称得上世界之冠。”\n　　“谢谢。”“小野中二”欠身致意。\n　　“同时请先生知道，没有日本防卫厅指教，台湾军队也明白大坝对战争的作用。至少本人就刚在加拿大研究完这个问题。”\n　　“对不起。”“小野中二”露出肃然起敬的神情，立正鞠躬。\n　　一小时四十三分之后，“中校”乘坐的飞机在桃源国际机场起飞，飞往加拿大。“小野中二”\n　　又变成了年轻快活的菲律宾旅游者。\n　　闽粤沿海交界\n　　这次“风灾”必须有广东的联手。\n　　台风过后天气总是晴得要命，一丝风也没有，晒得到处冒油。十七号，十八号，十九号三场台风几乎没有间隙，连在一块儿刮。连续二十多天风雨交加，久别重现的太阳把人眼晃得生疼。秘书在身后举着特制的大伞。黄士可很想把正在一旁速记的百灵拉进伞下，和自己挨在一起。她娇嫩的脸上渗出的香汗让他怜惜。他生平很少有这种想把另外一个人捧在手心里护起来的冲动。可是当着众多记者﹑随从和地方官，他昂着头发花白的硕大头颅，装出眼睛都不往姑娘那转一下。\n　　是严重的，这是他对记者们谈话的核心。做为福建省常务副省长﹑省政府赴灾区视察慰问团的团长，他对巨大损失表现出无比痛心。数十名记者乘坐省里提供的专车跟随他从福州一路深入到这个地处省界的西坑镇，台风造成的破坏有目共睹。他希望记者们如实向全国报道，宣传福建人民抗风救灾的英雄事迹。\n　　“……我们福建决心依靠自己的力量重建灾区，夺回损失，不给国家增加任何负担，不向兄弟省市伸手。这不是希图自力更生的名义，我们十分需要帮助。但是我们知道国家困难，遭受黄河水灾的兄弟省市也需要帮助。福建自力更生是福建对国家和受灾省市所能做的最大支持。请记者朋友们多为福建做做解释。黄河决口时，我们正被十七号台风搞得很紧张。十八号台风紧跟着登陆，造成大伙看到的这场大灾害。随之而来的十九号台风又继续扩大灾情。\n　　不是我们不支持遭受黄灾的兄弟省市，我们实在是力不从心，自救不暇啊……”\n　　这是关键。之所以下大气力请来这么多记者，给他们超规格的接待，送他们大包小包的礼物，就是为了让他们在跟随视察团的流动电台上把这些解释向全国各地发出去。遭受黄灾的省市集体发难，攻击东南沿海诸省见死不救，来势汹汹。福建首当其冲，弄得很被动。仅靠中央责难后临时征集的几车皮旧衣服平息不了四起的攻击，只有把福建自己的受灾状况宣传出去，才能让别人没话可说。这是他此次出行的主要目的。\n　　每个记者身后都有人举伞遮阳。福州的红灯绿酒，厦门的按摩女郎，石狮的走私货和餐餐生猛海鲜使他们对福建产生了不少热爱之心，很有感情地按黄士可的口径争相写稿发稿，深入进灾民家的只剩下黄士可。\n　　诏安县县长跟在身后。黄士可登楼时强忍着不发出肥胖者的喘息。百灵和其它随从人员被留在外面，然而他仍觉得自己体重引起的震动会传进她耳中。必须节食! 还要跑步! 这些天时时下这个决心。一个五十多岁的男人心里突然装进一位美貌姑娘的倩影时，这种焦虑必是第一反应。不管在别的方面多么自信，谁也逃不脱衰老肥胖和皱纹引起的沮丧。\n　　这是一座三层楼的家宅。房主原来是个渔民，靠走私和运送难民发了财，把房子造得又昂贵又难看，非常显眼。位置正在风口上，可房子没受任何破坏，连块玻璃也没碎，只在房檐屋角上，布景似地挂了几块塑料瓦楞板，当做被风吹掉的。对记者讲话时，黄士可正对着这栋上上下下镶满了小镜子的蠢楼，每一眼看见它都止不住冒火。不用多，只要有一个记者进到这里，如果又正好是个穷追猛打的家伙，精心布置的整台大戏就会露馅。福建不但躲不过攻击，连他自己也会就此完蛋。黄士可一走上楼顶，避开众人耳目，就冲着诏安县长的脸狠狠骂了一句最难听的闽南话。\n　　台风损失远不如这次“视察”出来的那么严重。三场台风连得紧，渔业和海洋运输受了影响，如此而已。但正好碰上这个当口，适当转化也就有了必要。坏事变好事。开始只是应付责难，紧接着又有了更大意义，保住福建的腰包全靠这一招。在精心的整体部署之下，十八号台风“刮断”了通讯线路。当福建各地气象站与上级气象局重新恢复联系时，报告上去的台风数据不是从仪器上测的，而是福州通过隐秘渠道摊派下去的，与实际的差距在任何记录上也查不出来，哪怕老天爷亲自来对质。多处地区出现局部“龙卷风”，“破坏”强度非常大。数十个工作小组从福州赶赴“灾区”各地，指导灾情统计，制作报表，在视察团和记者团将要经过的路线上，事先统一好干部和“灾民”描述“损失”的口径，组织人员拉倒路边的树木，推倒电线杆。在预定记者要停留的地方扒掉房顶，敲碎玻璃，扔上满地破烂。夸大灾情虚报损失自古就是多得救济的招数，向基层布置别的事大都阻力重重，这种事却点一下就心领神会，配合默契。黄士可很少对下面视察时能这么满意，这栋楼就更使他格外恼火。\n　　诏安县长唯唯诺诺。黄士可不听解释。在从海上去日本﹑台湾﹑香港﹑印尼﹑南朝鲜──几乎是除中国以外的一切国家──寻找好日子的“难民”越来越多的时候，海边的船老大发财发得已经用皮箱装美元了。这栋楼的主人既然能把一副名贵鹿茸送到黄士可在福州的家，这个“近水楼台先得月”的县长就更不知受了他多少好处，要不怎么那么为他说好话。这种暴发户就是有了金山也丢不掉天生的小农意识，自己的窝连块玻璃也舍不得打，更别说扒房顶。\n　　工作组是带着钱下来的。扒谁的房子付谁钱，只给多不会少。省里虽然为此拿出一笔款，比起中央勒令福建支持黄灾地区的钱物，还不到零头。花这点钱免掉那笔勒索再划算也不过。\n　　可这些小农就是舍不得眼前的坛坛罐罐。\n　　“今晚扒掉房顶，打碎所有朝海的玻璃，还有那些见鬼的镜子! ”黄士可从牙缝里说。“明天中央慰问团到。还是这个样子我扒你的皮! ”\n　　顶楼只有他和诏安县长，连主人一家都没让跟上来。在本省各县县长面前，他说话从来不忌讳。他在福建干了几十年，常务副省长做了八年多。中央对地方的控制只盯住一把手。省长走马灯似地换来换去，他这个副省长却稳坐江山，日益根深叶茂。各县县长几乎全是他的心腹。论实际权力，他比省长说话顶用得多。这出“风灾”的总导演是他。只有他敢对下面进行这种赤裸裸的布置。福建就象握在他手心里一样。\n　　西坑镇是这次视察慰问的最后一站。大队人马由此折返，今晚赶到漳州下榻。黄士可继续西行，到广东境内的柘林会见正在进行同样视察慰问的广东副省长。虽然西坑到柘林只有二十公里，黄士可还是把百灵叫到自己车上。名义上让她利用行车时间给他念文件，这是机要员的职责，实际升起车内的隔音玻璃之后，他俩在后排谈的话题却全然与百灵手中的机密文件无关。\n　　从福州到西坑，他俩这样谈了一路。\n　　出发之前，副秘书长介绍这位新来的机要员，是他第一次见百灵。从那一刻起，百灵就再也离不开他的脑海。百灵吸引他的不光是青春和性感的放射，不光是她乌黑的眼睛，湿润的嘴唇，白里透红的娇嫩皮肤，让人心颤的女性线条和曲面。美貌姑娘他见过太多了，百灵和她们不一样。她穿著朴素，风度端庄拘谨，美丽似乎从未被她意识到是资本。越是这样，她就越显得迷人。她与他正面相对时从来只像一个下级，然而常在他回头侧目之间，突然碰上她凝视的目光，充满让人心醉的热情，又闪着被识破的慌乱而逃离，重新藏进拘谨的盔甲之下。\n　　也许正是这一点使他被诱惑。他见过的女人只会当面讨好卖俏，勾一下小手指就能爬上床。\n　　他不信任也看不起那种女人。但是他也从未想到，到了现在这把年令，自己还能吸引一个美丽姑娘暗中投来的热情目光。正因为在暗中，就不会是装的。可为什么？难道除了权力以外，自己还有别的魅力？还能射出点燃女人心灵的火种？还能再回味年轻时光的辉煌吗？这可太诱惑他了。他不敢相信，又太想证实。他觉得自己像个初恋的小伙，一头栽进一见钟情的情网，又为如何证实苦恼万分。他毕竟不是小伙子了，身份也不一样，内在的冲动再强也不该决口。矜持就像一个面具紧紧贴在脸上，做出隔绝的表情，发出隔绝的声音，只是伸出一些肉眼难辩的蛛丝小心翼翼地试探。一路“念文件”，谈了那么多次，越谈越近，却始终没得到最终的证实。\n　　谈话气氛始终保持在上级对下级﹑长者对晚辈的关怀上。上次谈到百灵的婚事。她已经二十六岁了，连对像还没有，以眼下的社会标准已经快成“老大难”了。黄士可接着这个话题亲切地劝导她: 猜不透她这么好的条件为什么一直不“解决”。不要太挑剔，尽快解决个人问题，有利于个人生活，也有利于为党工作。“要不要我给你介绍一个好小伙？”黄士可半开玩笑，仔细观察她的表情。\n　　百灵试图露出一丝笑容，反而显得悲哀。一双秀眼长久看着汽车窗外掠过的田园房舍，两行眼泪慢慢流下。\n　　百灵，你是不是受过伤？”\n　　“不，不是伤。”她轻轻摇头。“伤能治好，我已经彻底毁了。”\n　　黄士可动情地握住她的手。\n　　“不会的，百灵，告诉我，我会帮助你。”\n　　她的手颤抖，发烫。她终于开口，声音却平静。\n　　“我要的不是帮助，是你的鄙视。我十四岁时，被一个退休飞行员勾引，和他发生了关系。\n　　那时我什么都不懂。他温柔体贴，教我，启发我，让我迷恋上男女之间的事，越来越不能自拔。两年多的时间，谁也不知道，连我的父母也没怀疑。直到有一天，他突然中风死去。我大病一场。从那以后，十年了，我再没有过男人。成群的小伙子追求我，我也试图接触过。\n　　可是我发现我已经厌恶年轻男人，已经形成了一种心态，只喜欢那些成熟的，智能的，像父亲一样慈祥的老年男人。我喜欢灰白的头发，饱经风霜的皱纹。厌恶所有光滑和稚嫩的面孔。\n　　开始我以为是怀念，只是一时的病，会好起来。然而这么多年过去了，却丝毫没有变化。我一直克制自己，生怕给别人带来不幸和罪孽。不过仅仅靠克制太缺乏力量。我需要被鄙视，只有鄙视才能把注定不幸的爱情从人心里拔掉……”她抬起头。“鄙视我吧。”\n　　柘林镇已经在望。黄士可的头脑像晕眩。她爱老年男人! 她有了克制不住的爱情! 她让他鄙视! 难道不是再清楚不过。他怎么会鄙视，他甚至想谢谢那个升了天的飞行员。如果不是柘林就在前面，他会把百灵立刻拥抱在怀里。\n　　一辆军绿色的大型宿营车停在柘林镇外的小树林旁。广东方面的人招手欢迎。百灵迅速擦掉脸上泪痕，又变成念文件的机要员。黄士可内心翻卷着狂喜，抑制不住满脸放光的笑容。迎到车前的广东省副省长把这喜悦理解成“风灾”的成功，摇着他的手一块放声大笑。\n　　这次“风灾”必须有广东的联手。十八号十九号台风都是先从广东登陆再进入福建。如果广东据实呈报台风数据和损失状况，福建的弄虚作假就会被看穿。广东受到的攻击仅次于福建。\n　　中央摊派给它援助黄灾地区的款数比福建高一倍，因而对于假造风灾的热情比福建还高。柘林镇沿街的房子全被掀了顶，龇牙咧嘴一派惨状。相比之下，身为总导演的黄士可倒觉得自己逊色了。\n　　宿营车外表看着简陋，里面却全然像一个小宫殿，连五星级饭店的高级套房才配备的蛋壳型洗澡器这里也有。几个漂亮姑娘魔术般地摆出一桌丰盛酒席，色香味是特级厨师的功夫。随着轻柔音乐，灯光缓慢地变换色彩和亮度。广东副省长有点遗憾地告诉他，这套玩艺儿──包括厨师和姑娘──都是从广州军区租来的，付港币。省政府早想自己弄两套，却顾虑进口限制和廉政纪律，怕被人捅上去惹起查处。军队以军事器材名义进口，花多少外汇没人敢问，也不理海关，直接用军舰运进来。唯一要做的就是把原来内外相符的资本主义外壳罩上一层跟野战﹑救灾﹑下乡等活动相符的中国皮。\n　　话题很快集中到局势上。文化革命之后，中国转上了发展经济﹑改革开放的道路。改革的本质在于扩大市场经济和权力下放。一旦放松中央集权控制，原本蕴于气候﹑地理﹑技术力量﹑工业基础﹑商业传统等各方面的差距便立刻显露出来，在各省之间造成日益扩大的差距。\n　　东南沿海诸省的发展步伐远远超过内地，加上国家的沿海开放战略给了这些省优惠政策，差距更加扩大。内地的人才﹑资金﹑原料纷纷流向沿海，使沿海诸省愈益发达，良性循环，内地各省则越来越不平衡。“六四”以后，重新崛起的强硬派企图改变这种局面，加强计划经济和中央控制，但沿海各省的改革成果已很难逆转。不少县的年度上缴利税超过内地的地区。\n　　只要害怕全国经济陡降，就不可能下决心消灭改革。加上层层都弄花样百出的对策保护自己，尽管政治控制一再加紧，沿海各省的经济大格局却没发生根本变化。内地改革本来就不巩固，计划经济体制的大工业占的比例又高，与沿海的断裂仍然不断扩大。中国已形成分为两大块的格局，被人称为“两个中国”。不同的是，“六四”以前，沿海是主导，内地亦步亦趋地跟随。而现在，内地的政治气势却强硬起来，常对沿海进行攻击。这次借黄河水灾的发难就是又一次较量。为此，沿海各省不能不把“六四”看作一道分水岭，“六四”的案不翻，政治上的被动局面难改变，缚在身上的绳索就去不掉。他们紧锣密鼓地相互串联，出谋划策，给以总书记为首的温和派打气。到了目前这步，最关键的是军队。各省正在分头做自己境内驻军的工作。\n　　广州军区已经基本没问题。多年置身于自由经济最发达的环境，官兵的思想意识很开放。团以上的部队都参与经商，办企业，搞公司。军区本身拥有众多经济实体，算得上一个披军装的大财团，自觉不自觉地已和自由经济融合在一起，你中有我，我中有你。在政治上，这种位置已经预先决定了他们将站在哪边。\n　　面对广东的成果，黄士可自叹弗如。福建驻军属南京军区，照理也身处自由经济地区，然而无论他挖空心思搞出多少政策，有的简直就是明摆着往军队手里塞钱，只要对方肯张开巴掌，可南京军区那只拳头死攥着，每支部队都被抓得牢牢，关在兵营里，不参与经济活动，跟地方也少来往。到现在只拉到一群专门为非作歹的军队高干子弟，让他们个个当上经理总裁。\n　　这当然有用，却远不如把他们的爹拉进来更有用。好在南京军区的现任将领和广州军区的现任将领一样，“六四”事件时都未参与开枪。开不开枪不是偶然。当年有人是被“六四”推着走，有人则是把“六四”当成一步棋，算出深谋远虑的棋局，至少防备一着不慎，影响满盘。不让手上染血，可以看做是为未来留的后手。现在未来已到，后手是什么呢？黄士可请广东副省长协助，南京军区白司令的女婿明天去深圳做一笔交易，一定要让那位女婿捞上一大笔。广东为此亏空的由福建补。摊牌时刻越来越近，这时必须不惜血本。\n　　席上每道菜都做得精致可口。黄士可只是尝尝，酒也只抿几口。广东副省长对这种变化表示惊讶。黄士可的善吃善喝是有名的。他推托血压不好。尽管百灵已经表白她爱白发和皱纹，但无论如何不会爱高耸的肚皮。即使不为年龄苦恼，形像也应当看得过去。至少该比现在减掉十公斤。如果眼前不是这个尖嘴猴腮的广东佬，而是百灵，这个小宫殿该是多么美好啊。\n　　他拒绝了去汕头下榻。那边安排了一位泰国女按摩师在饭店等着为他进行“保健”。\n　　“救灾期间，我应当住在本省。”他说，内心有些反感。广东太不检点，有些过份。\n　　天已经变黑，他发现百灵被副秘书长带去汾水关打前站了，有些悻然。副秘书长平时挺有眼力，这时怎么不问一声就把百灵带走! 汾水关是汕漳公路进入福建的第一个小镇，今晚住地就安排在那里。下午副秘书长提出这个建议时黄士可心中一动，这种僻静之地不是最容易发生什么吗？既不是广东的外人之地，又无本省大队人马的眼睛。他几乎是怀着冲动的热情表示赞同。“对，应当和灾区人民同吃同住! ”然而百灵呢？他在汾水关的黑暗中四处张望，副秘书长却径直把他领进一个破旧的矿泉水浴池。\n　　“这是朱砂泉，冬暖夏凉，全国只有五处，最滋养皮肤，人称‘回春泉’……”副秘书长就像看不出他的烦恼，兴致勃勃地介绍。黄士可刚想张口，副秘书长又道歉他的废话占用了时间，匆匆退了出去。\n　　这个白痴! 黄士可在心里骂。泉水的确很舒服，温度跟体温一样，始终在流动，痒痒地抚摸全身皮肤，像是能自动擦掉每个毛孔里的灰尘和汗渍。只是浴室设施太糟糕，让人想起几十年前的公用澡堂。浴池是水泥的，很粗糙。几条长凳摆在旁边放衣服。墙皮东裂一条西缺一块。房顶露着夜空亮晶晶的星星。整个浴室被一排塑料瓦楞板一分为二，浴池也被那排瓦楞板隔成两个。黄士可用脚探探，滑溜溜的瓦楞板一直插到浴池底。两边流动的水在缝隙之间相通。也许年久失修，瓦楞板被水冲得晃晃悠悠。这一半浴室灯是坏的。透过瓦楞板的绿色塑料，那一侧一个很亮的灯泡倒也使这边什么都看得清。\n　　他听见门响，拖鞋走动，盆碰在浴池上，那边有人进来。是个女人。那一半是女浴室。来人显然不知道隔壁有人。这边黑着灯，没动静。她轻快地哼着歌。传来脱衣服的悉索声。百灵!\n　　他听出来了。心脏开始狂跳。\n　　百灵下水了。这水两边相通，与她的皮肤摩擦后再流到他的皮肤上! 她的身影被对面灯光投到塑料板上，虽然变形，随着瓦楞起伏，却是赤裸的，活动的，从各个角度展现出变化的曲线和轮廓。\n　　浴池里的泉水好象变成酒精，蓝幽幽地越烧越旺。黄士可屏住呼吸，抑制住颤抖，手贴上瓦楞板去轻抚那个影子。逐渐，他的身体与瓦楞板越贴越近，好似全然不受头脑控制，被一种神奇力量牵引。他站起，冲动地把整个身体贴上那影子……\n他没有反应过来，瓦楞板是怎么倒下去的，只见一片光芒洒过来，瓦楞板的平面倾斜，那个影子在上面滑动，好象把黑色影子转换了一下，展现出雪白的胴体。百灵惊恐地瞪大眼睛，两只娇弱的手臂先挡胸脯又挡两腿之间，然而她没有喊叫，当他迈过燃烧的泉水抱住她时，她只是瘫软地闭上了眼睛，发出一声震憾人心的的叹息。"
		},
		{
			"post_id": 13,
			"title": "《黄祸》9",
			"date_published": 1460811751.584,
			"body": "　　北京\n　　仅靠一个“逐级递选”就能改天换地，一百个字符就能把复杂万千的世界重组经纬，怎么也让人有说梦的感觉。\n\n---\n陈盼烦透了，虽然她经常受滋扰，已经练出一套“标准程序”，几句话就让多数纠缠者灰溜溜地走开，可架不住一会儿一个。从十八九岁的小流氓到白了头发的老花花公子，全用不是看正经人的眼光色迷迷地打量她。一个精心打扮的女人独自在公园里盘桓，很难不引起男人的非份之想。陈盼后悔穿这件水绿色的丝绸旗袍，过于柔软合体，衬托出来的东西太多。可欧阳中华教她要打扮得迷人。“这是你的武器。”他说。\n“你让我出卖色相! ”她当时撒娇。\n　　“只有相，没有色。”他搂着她，咬她的耳朵，“你的色只给我……”\n　　天很阴，中山公园里的高大古树在灰色光线中像没有生命的布景，纹丝不动。欧阳中华让她见石戈，却不许专程拜访，只能“偶然相遇”。他常有这种令人费解而且似乎矫情的安排。\n　　不管多古怪，陈盼全都照办。她清楚欧阳中华对身份的注重，尤其和权贵打交道，绝不能有“求”或被“施恩”。秘书也得遵循这个原则，何况她还是他的情人。这使有些原本简单的事复杂了了许多倍。欧阳中华已经走了这么多天，她仍然没见到石戈。这个人似乎永不给人“偶然”，全部活动和程序都在硬梆梆的“必然”中。她在那个没有出入证连苍蝇都飞不进去的十六号机关外边连续等，直到感觉自己像个没人要的妓女，遏制不住地想放一把火把他烧得屁股冒烟跳下楼。他凭什么睡觉吃饭一切全不出来！\n　　“……百字宪法! 请看百字宪法! ……”一个孩子举着传单在人群中钻来钻去，一元钱卖一份。今天一早，北京到处出现这份传单，贴的，撒的，塞在各家信箱里的，还有成千上万孩子到处叫卖的。谁都以为“百字宪法”出笼前会大做一番文章，然而却无半点张扬，突然就无声无息地撒遍全城。\n　　陈盼来的路上已经看过两遍，惦着今天的“偶然相遇”，没往脑子里进。此刻她又买了一份，不知还得等多长时间，也许再看一遍能看出点名堂。传单一面印着“百字宪法”四个隶书体字，另一面用大号字印着正文：\n　　第一条各社会组织各级领导人均以n﹙注﹚为基数逐级递选。以三分之二多数当选。任期不限。可随时罢免。\n　　第二条兼有多种组织身份者在各组织均有选举权。\n　　第三条协助履行公务的权力委让人由领导人任命。\n　　______________________\n　　注: 3≦n ≦9\n　　她一边读一边数字数。所有读的人都做这件事，几乎成了这传单引起的第一反应。人们数出来的结果不一样。正文中的字只有八十三个，加上注释有九十个，如果把所有符号都算上，括号的左右两弧各算一个，连正文与注释之间的一横也在内，才有一百个。人们对这种勉强凑出的一百首先失掉信赖。陈盼倒是对能凑上一百产生不信任。一个与文字游戏相关的东西值得认真对待吗？全文内容淡而无味，不知所云，毫无震动性和冲击力，与原来自觉不自觉被挑起的期待相去甚远，似乎仅仅是一种选举规则，尚未展开，却又加上“三分之二”“3≦n ≦9”这类小气的细则，与“宪法”二字相称的那种堂而皇之的权威性﹑原则性和严肃性全然没有，也缺乏能使人肃然起敬的法律色彩。但就是这个玩艺儿，曾被鼓吹成“根本大法”中的“根本”，“一通百通”中的“第一通”，能发育出一个“全新社会”的“细胞核”，让人翘首以待，结果不免产生被耍弄的感觉。\n　　谁也不会承认自己智商低，然而要是就此而说“百字宪法”的炮制者智商低，陈盼也不能下这个结论。“百字宪法社”处处表现不俗，在这个核心上突然变成低能者不符合逻辑。她不能确定石戈在这里扮演的角色，但她已断定他是个含而不露的人物。“百字宪法”是不是同样外表不打眼，里面却有深意呢？\n　　一个男人在陈盼脚上绊了一下，做出夸张的踉跄。\n　　“我不要你道歉。”男人先发制人地故作豪爽，满嘴酒气，一屁股坐到陈盼身边，紧挨上来。\n　　浓黑的胸毛蔓延到喉头，一看就是个蛮横的家伙。\n　　“该叫你小姐还是太太？你有丈夫我也不在乎，我……”\n　　男人一下噎住。一个警徽在陈盼手里轻巧地转动一下，又同样轻巧地送回银灰色手袋。这个过程只有半秒钟。男人连噎着的那口气都没敢往外呼就逃一般地溜掉。\n　　陈盼很满意。这是个警界朋友送的。她第一次试。周围那些原以为她是个专招外国人的“高等同行”而妒火中烧的暗娼一下消失得无影无踪。她又在高高低低的鱼缸之间转了一圈。这是第五次还是第六次已经记不清，“偶然相遇”仍然没发生。那个混蛋到底会不会来？! 她几乎要骂出“他妈的”。“绿协”的几个义务“侦探”说他今天一定会来看这个鱼展。为了跟他家那个看一切人都像小偷的老保姆套关系，他们可费了不少劲。“他答应一万的事从不会不做数! ”这是老保姆的话，据说那口山西腔调斩钉截铁。她现在饿着肚子继续把“妓女”或是“便衣”当下去全靠这个“一万”，或是“一丸”，也可能是什么见鬼的“一碗”了。\n　　几个孩子争先恐后跑进公园。一人抱一摞小册子，自动按不同方向分散在人群中。“……‘百字宪法详析’，一目了然的分析解释……建立逐级递选制的构想……请看! 请看! 刚出印厂……”清脆喊声此起彼伏，在半死不活的人群中凭添一股生气。陈盼买了一本，十元钱。\n　　她觉得北京这么大的孩子好象全在为“百字宪法社”当小跑腿，把他们的观点术语叫得滚瓜烂熟，动力当然是钱。“百字宪法社”从一开始就把小册子和传单免费发给孩子。孩子们随“行情”自己定价。正值放暑假，赚多赚少都是一份收入，通货膨胀重压下的家庭预算也能得到一份补贴，孩子有干劲儿，家长也支持。看上去让人掏钱会影响传播，实际满街扔的倒不一定有人看，掏钱的却一定不会让钱白花。孩子闲不住的腿和清脆的童音把每份印刷品最充分地散布到所有角落。政治观点和孩子结合在一块，首先就容易争取到同情。“人阵”“民阵”几次想阻截“百字宪法社”的宣传品，却无法对孩子下手。而孩子的父母亲属却由此拐着弯地受了影响。从长远看，孩子是未来，今天为钱，潜移默化留下的政治观点却可能是明天的种子。利用孩子，不能不说是一举几得的天才发明。\n　　陈盼重新在长椅上坐下。两腿累极了。长椅在露天鱼展旁边，随时能发现“偶然相遇”的对像。她没心思从头看那本刚买的《详析》，跳跃着浏览，看看那三条说的到底是什么。\n关键是第一条。“详析”首先阐明“逐级递选”是核心的四个字。\n所谓的“百字宪法”全部意义就在于确立了一个逐级递选制。条文本身为了严密和普遍适用，只考虑逻辑，叙述死板，绕弯较多，不易使人一下想透。\n实际举例说明便显得很简单。比如n名工人组成一个生产班组。他们以三分之二多数选举班长。n 个班组组成一个车间。n个班长以三分之二多数选举车间主任。以此类推，n 个车间主任选举厂长。n 个厂长选举公司经理……这就是逐级递选的过程。n 限制在不少于三人不多于九人的范围内。《详析》解释: 根据人类生理的信息负荷能力，当n 为五至六人时，彼此间可做到信息的完全交换，也就是每个人都能向他人充分表达自己又能充分了解他人，由此构成最佳选举范围，同时构成领导人能够最充分管理直接下级的范围。考虑实际情况复杂万千，不可能把n 定成死数，因而设定一个限制范围。\n　　全社会逐级递选，直到n个大区首脑选出国家最高元首。n 的意义是非常重大的。由于n 的范围比有史以来任何选举范围都小得多，因而就无须规定选举时间，也不必由专门机构召集选举，哪怕驻在各自首府的n 个大区首脑彼此远隔千里，现代通讯手段也可以把他们在几分钟内联系在一起。选举人可随时以三分之二多数选出新领导人，同时罢免原领导人。而只要不被罢免，领导人就可以无限期地在位任职。\n　　如果把选举看做任免，逐级递选制正好把专制社会的任免方向颠倒过来，把每一级下级由上级任免变成每一级上级由下级任免。这是一个奇妙的颠倒，陈盼想。至少在理论上，原来最底层的老百姓站到了过去皇帝的位置，成为赋予和传递权力的源头，任免的起点。然而皇帝任命的是总督﹑巡抚，逐级递选中的老百姓任免的只是班组长﹑村干部，二者能相提并论吗?\n　　第二条一目了然。现代社会几乎每个人都“兼有多种组织身份”。陈盼算了一下自己: 1.中国公民﹔2.北京农业大学生物工程系副教授﹑试验室主任﹔3.中国农业科学学会理事，北京分会副会长﹔4.绿色拯救协会书记处秘书组组长﹔5.中国美术家协会会员﹔6.翠微园居民委员会第17居民组居民﹔7.“灵魂纪念馆”的股份持有者……所有这些组织全实行逐级递选制。\n　　她在每个组织都有选举权和被选举权。够忙的，她想。不过看起来至少有一个好处: 一个人的意志因此可有多条渠道进行表达，更符合人的多面性和立体性。\n　　逐级递选制导致的组织形式是金字塔式组合结构。每层领导人都被赋予他那个小金字塔的全部权力。随着层次提高，金字塔规模扩大，领导人越来越不可能独自完成领导，需要将职能和权力委让给诸如参谋班子﹑职能部门一类的个人与机构协助工作。这种委让实际等于是领导人自身的延伸和扩展，所以第三条把权力委让人与其它社会组织分离，规定他们不能自下而上选举，只能自上而下任命。陈盼已经想到这一点。假如外交部也实行逐级递选制，外交部长由外交部的司局长们选举任免，国家元首的外交政策如何保证执行呢？同理，军队﹑警察部门更不能实行选举。根据这一条，她担任的“绿协”书记处秘书组组长职务也不能由属下的秘书们选举，而须由书记处任命，再由她挑选聘用属下的秘书。但不等于权力委让人就被剥夺了选举权，因为每人还有另外多种身份。这种结构字面来看可以自圆其说，但仅靠一个“逐级递选”就能改天换地，一百个字符就能把大千世界理出头绪，重组经纬，却让人有说梦的感觉。\n　　有人站到长椅边。她故意不抬头，只用余光瞥见一双男人粗糙的脚和变形的凉鞋，裤腿肥肥大大。显然不是个花花公子，但这种人有时更难缠。那人坐到她身边，咳嗽一声，见她不理睬，伸出手指碰碰她正在看的小册子。\n　　陈盼懒得废话，眼睛仍看着《详析》，指尖夹出警徽一亮。\n　　似乎没作用，碰上个不认得警徽的土包子等于白亮。\n　　“冒充警务人员可是重罪。”“土包子”说。\n　　陈盼一惊，抬起头。\n　　一个光头揶揄地看着她。\n　　她愣了好一会儿才认出来。\n　　“你怎么弄了这么个头？”她惊喜地叫，又立刻后悔显露的惊喜有点过份。\n　　“你觉得我留着那个阴阳头更好看？”\n　　她觉得自己的笑像傻笑。这回可是不折不扣的“偶然相遇”!\n　　“你怎么会在这？”石戈摸摸长出半厘米的头发。\n　　“这些玩艺儿是我的本行嘛。”她指指鱼缸，想起手中的《百字宪法详析》和鱼缸扯不上什么关系。\n　　一个小男孩从鱼缸之间摇摇摆摆跑过来，本来对着石戈叽里呱啦地嚷什么，看见陈盼，便停在二米开外转着圆溜溜的眼睛打量她。\n　　陈盼立刻断定不是“一万”﹑“一丸”，也不是“一碗”，而是“伊万”。眼前这孩子虽然是个中国孩儿，却长着一头小黄毛，翘鼻子，大嘴巴，一副鬼精灵的模样。“伊万”的名字和这形像正符合。\n　　伊万揪着石戈的耳朵嘀咕几句。\n　　“他问我应当叫你什么。”石戈传达。\n　　“你叫他什么？”陈盼指着石戈。\n　　“哥! ”伊万响亮地回答，顺势提了一把裤子。\n　　“为什么？”陈盼忍俊不禁。\n　　“他没小弟弟! ”\n　　“没有小弟弟就叫哥？”\n　　“叔叔阿姨家都有小弟弟! 没有小弟弟也有小妹妹! ”\n　　“那……你当然得叫我阿姨。”\n　　“你有小弟弟？”\n　　“有。”\n　　“比我大比我小？”\n　　“你几岁？”\n　　“四岁半。”\n　　“我家小弟弟三岁两个月。”\n　　“好吧，”伊万看看石戈。“你是阿姨。”\n　　石戈摇摇头。\n　　“我一直以为伊万该叫你妹妹呢。”\n　　“没想到比你大一辈？”\n　　“不过伊万的爸爸妈妈叫我叔叔。”\n　　“那对眼前没有用。”陈盼把伊万抱在腿上。“现在的孩子都叫杜勒斯﹑安玛丽之类的美国名，五十年代才兴伊万﹑保尔什么的。”\n　　“他妈是个俄语翻译。”\n　　“怎么把孩子交给你了？”\n　　“我借的。”\n　　“借？”\n　　“我自己没有小弟弟，只好跟邻居借。”\n　　“要不要打借条？”\n　　他们笑起来。伊万一手抓一个，也跟着笑。\n　　在陈盼眼里，这个所谓的“最新变异品种金鱼展”纯属骗人，根本没有什么新品种，连三尾﹑龙睛﹑沙翅﹑望天那些最基本的老品种也只到中档水平。然而有她这个专家现场讲解，却使伊万着了迷。最后石戈只好用冰激凌诱惑才换得他同意结束参观。\n　　石戈竟也能听得津津有味，一直走到冷食店门口还跟伊万不住嘴地讨论。他们选了三份标明用矿泉水做的冰激凌。北京水质污染日益严重，饮食业纷纷标明使用无污染水以提高竞争力。\n　　其实谁知真假。即使在公园里，空气中也弥漫着刺鼻的有毒烟雾。进入提供“过滤空气”的雅座需额外交费，每人每小时一千元。石戈似乎要充大方，搜遍全身才凑够钱。\n　　雅座很安静，只有几对恋人。一个钢琴师边弹边柔声轻唱。一台大屏幕电视无声地播放足球比赛。\n　　“您的慷慨能使我们的寿命延长两分钟吗？”\n　　陈盼有模有样地吸了一口号称新鲜的空气。\n　　“每人两分钟就是六分钟。”\n　　“每分钟五百元？”\n　　“只等于一九八五年的三元。”\n　　“再过几天就只等于三分了。”\n　　冰激凌味道不错，尤其对腹中空空的陈盼。她一口气吃掉一大半，开始把话头往正题上引。\n　　那是“偶然相遇”的目的。\n　　“也许你在休息的时候讨厌严肃话题，不过我还是想问问，你以为你这样操劳的结果如何?\n　　为社会和人谋幸福应该是你的目的，可是你觉得人们幸福了吗？”\n　　石戈用勺把划着桌布。\n　　“幸福的概念太模糊，‘人们’也太宽泛，只能说有人幸福有人不幸福。”\n　　“谁幸福？”\n　　“我看你就挺幸福……”\n　　“别谈我，我不是跟你进行正规的哲学探讨，只谈感觉。幸福这个词是常用的，如果不抬杠，谁都能理解，没必要那么严密。每个人一生都在追求幸福。你们这些社会管理者，除了贪官污吏，也都是在想方设法促进社会幸福。可是每个人努力，全社会努力，努力了几千年，人幸福吗？”\n　　“这种努力使人类的生活水平提高了许多倍……”\n　　“物质生活水平。”\n　　“也许你们绿色人士不认为物质生活水平提高是幸福，但至少因此免除了人迫于饥寒的痛苦。”\n　　“物质匮乏的痛苦存在时，痛苦的缓解或暂时消失会带来幸福感。这是过去那句格言: ‘痛苦是幸福的源泉’的意义。然而物质匮乏一旦彻底消除，人不再受饥寒威胁，幸福感就很少再能从物质获取中产生。幸福不是物质性的有形的东西，不能像冰激凌一样在盘子里堆出一块体积和形状，端过来说，这些幸福属于你，吃进去就会被消化吸收，吃得越多就越幸福。\n　　幸福是精神性的，是情感与心灵的一种感应，产生于无形的精神又作用于无形的精神。物质财富只能使人免于生理痛苦，不能给人提供精神幸福。这就是一旦温饱满足后，人的幸福并不与物质财富成正比的原因。无论物质生活水平如何提高，人并不幸福，甚至有更多的烦恼与不满，面对的危机也比以前更多。”\n　　“理论上我同意。”\n　　“我知道你是搞实际工作的。先别用‘理论’二字划出一条界线。你们这些实践家其实只是在历史惯性下实践。人类的文明开端于与物质匮乏做斗争，你们就认定那是永恒不变的主题，人的幸福只能来源于不停地增加物质财富，不断地提高消费，经济无止境地增长就被你们奉为社会进步的最高目标。资本主义﹑社会主义﹑左中右﹑东西方，全是这个目标，区别只在方法和手段。关于你们在有限的地球上追求无限增长这个悖论造成的危机已经谈得太多了，现在不提那些，也不提自然已经反过来用新的匮乏惩罚人类，只把实践家的近视眼能看见的距离之内的现像拿出来。我们最近刚完成一项调查。调查要求每个被调查者自己评价他的一天生活，把一天经历的所有事和过程都按愉快﹑满意﹑轻松﹑自豪﹑有意思﹑感动和烦恼﹑不满﹑有压力﹑自卑﹑没意思﹑厌恶区分。前一类可以概括为‘幸福’，后一类为‘不幸福’。\n　　回收的调查表有六千多份，来自各阶层各地区，其中国外的有一千四百多份。统计结果连我们都吃惊，'不幸福' 的评价占百分之六十七。这还仅仅是日常生活的浅层评价。深入进去，被各种危机和痛苦纠缠的人比例还要高，所谓‘哪家都有一本难念的经’。而在总体人生意义上的评价，‘没意思’的比例竟高达百分之八十以上。特别值得注意的是，物质生活水平较高的阶层和都市地区，‘不幸福’的评价比能保证温饱但并不十分富足的农村地区高许多，而西方发达国家的调查对像抱怨更多……”\n　　“哥，我还要! ”伊万推开了他的空盘子。这么一会儿没捣乱，鼻子下巴上全是冰激凌，盘子舔得干干净净。\n　　石戈把自己那份给他。陈盼用餐巾纸给他擦嘴。伊万晃着脑袋躲来躲去，觉得挺开心。\n　　“你的意思是我们迄今为止所做的一切努力都错了？”\n　　“不能说全错，但错得很多。最根本的错在于寻求幸福的领域搞错了。既然幸福是精神性的不是物质性的，在免除了物质性的痛苦之后，寻求幸福就应当在精神领域着手，把以往发展经济的努力用于促进人类精神的建设与发展。经济增长有极限，精神却没有。它不消耗资源，反而是精神越繁荣人的物欲越淡漠，从而使人在得到幸福的同时，也使被人类的贪婪毁坏的地球得到拯救。”\n　　“听起来很吸引人。可精神领域看不见摸不着，什么是繁荣的标准，什么是进入的途径，促进的手段，未免对多数人有点太虚。”\n　　“你看过欧阳中华写的‘精神人’吗？”\n　　石戈点点头。\n　　“暂且借用你的全套概念和思维方法，只把经济领域里的物质产品换成‘精神人’里所说的‘美’。‘美’是精神领域生产的产品，可以是许许多多‘科学家’﹑‘设计师’﹑‘工人’﹑‘企业家’共同协作的产物，也可以是个人的‘手工产品’，有‘使用价值’，也能‘流通’﹑‘交换’﹑‘增殖’。全社会的‘美’越多，‘美’的质量越高，精神就越繁荣，社会就越进步。‘经济规律’被‘审美规律’取代，‘生产关系’和‘生产力’为‘美’的生产服务……”\n　　“我无法这样更换概念，物质产品有质量﹑形状﹑硬度﹑颜色﹑温度，‘美’只是一种感觉……”\n　　“质量﹑形状﹑硬度﹑颜色﹑温度同样是感觉。”\n　　“物理性质是能被测量的。”\n　　“测量结果也得通过感觉才能被接受和认识，所以也是一种感觉。”\n　　“……我们进入哲学范畴了。”\n　　“那还是打住吧，那个范畴里只有各执己见。不过我想既然你能感觉到‘美’，就不能说它‘虚’，……”\n　　又一次中断。伊万的肚子装不完第二盘。他把剩下的冰激凌全部抹到了脸上。\n　　“你怎么不往头发上抹？”陈盼一边给他擦一边抱怨。\n　　“幸亏盘里没有了，不然你这么一说他准往头发上抹给你看。”石戈揉一揉伊万的黄毛。“去吧，自己看电视去，戴上架子上那个黑耳机，别捣乱。”\n　　那天在“人阵”总部是欧阳中华第一次见石戈。事后他打听了不少石戈的情况，不知为什么就产生了从石戈手里弄“基地”的想法。可陈盼觉得眼前这个人完全是个务实主义者，满脑子考虑的首先是如何实施，有没有操作性等等。他不直接反对陈盼的理论，然而张口闭口总是“环节”，似乎他的思想只有在一环扣一环的连续性上才能延伸，一个环节不清楚就决不往下前进。这种人不是“精神人”也不是“物质人”，陈盼心里把他称为“权力人”。他的生命力只会用于在权力机器上熟练灵活地运转，但永远脱离不了那呆板的机器框架。无法设想一个只会解决眼前问题的权力部件有什么想象力。哪怕派一个代表团正式请求，也难想象他是否会答应支持这样一个离“实际”十万八千里的“乌托邦”，然而她现在必须按照欧阳中华的意思，用完全“偶然的机会”和纯粹出于“自己的兴趣”向他提出建议。\n　　“……你不能让我们凭空在脑子里把所有的环节都弄清楚。我们需要实践，用实践检验和完善。你给我们一个试验基地，我们就会给你全部答案。怎么样？”\n　　欧阳中华一直挖空心思想弄一个以“美”为生活宗旨的社会试验基地。那不但要搞一块飞地，还要切断外界权力的一切触角，等于建立一个国中之国，完全为所欲为地自行其是。在一个由国家控制一切的社会里，这算得上比登天还难的白日做梦。\n　　“……咱们搞一个合作，”陈盼详细地描述了“基地”的设想后，又巧妙地把它和“权力机器”统一起来。“基地算你属下的一个社会试验区──不仅是名义上的，你肯定会从中得到启发。既然你的工作是研究和解决危机，你也应当搞些试验。这个基地算你的试验之一。也许最终你会发现，只有我们这个试验才能提供彻底解决危机的出路……”\n　　一声叫嚷使他们扭转视线。斜对面是一对吃惊的恋人。两份刚要的冰激凌摆在桌角，其中一份不翼而飞，全部被踮着脚的伊万用手抓到了自己的头发上。石戈和陈盼飞跑过去。伊万眨着眼，对混乱局面十分得意。\n　　石戈连连道歉。恋人中那个姑娘比较厉害，白了陈盼一眼。\n　　“当妈的也不管好! ”\n　　石戈一边在各个兜怎么也摸不出钱，一边赶快声明: “我不是他爸。”\n　　陈盼又好气又好笑: “你应当说我不是他妈! ”一边拿出自己的钱。\n　　“告诉我你们是什么关系就不用赔了。”小伙子到挺大方。“我们刚才猜了半天也猜不出。”\n　　“对对对，我太老了。”石戈直点头，还是摸不出钱。\n　　“少废话! ”陈盼把钱扔到桌上，揪一下石戈衣襟。“快走。”\n　　“他是我哥，她是阿姨! ”伊万接上了茬，伸着粘糊糊的手指头，冰激凌沿着脑瓜转圈向下淌，旁边人全大笑起来。\n　　“我要揍你! ”石戈装出凶狠样子抱起伊万，狼狈地跟在陈盼身后逃到外边，找到一个水龙头，做出要用凉水冲伊万以行惩罚的样子，实际却是小心翼翼地把他洗干净。\n　　然后石戈半天没说话，信步在公园里走。陈盼领着伊万跟在旁边，不让伊万打扰他。不知为什么，刚才那场笨拙的表演倒使她多了一分信任，她觉得他不会像司空见惯的“权力人”那样精明地一口回绝，礼貌而又婉转，否则无需思考什么。\n　　不过细节上仍然显出十足的“权力人”的精确和算计，看上去他是在信步，思考结束时却正好走到公园门口。\n　　“你的建议或许值得一试，我听进去了，也记住了。我的力量不像你想象的那么大，眼下什么都无法答应你。容我琢磨琢磨，我会当件事来考虑的。”\n　　等于什么都没得到。陈盼心里却有一股暖意。任务完成到这一步比预想的要好，没白等他这么多天。\n　　公园门外就是天安门广场。比起一九八九年，聚集的人少多了。老百姓越来越不感兴趣，光顾的也只是看看热闹。当年出现过的一切全都重演，绝食的，住帐篷的，“人阵”和“民阵”　　的高音喇叭互相比赛，民主女神像也立在原来的位置。接受以往的教训，不给当局口实，民主派动员了许多学生维持秩序和疏导交通。长安街上跟往常一样车流不息，充斥着呛人的废气。街对面停着一辆大卡车。货箱上立着一面纸糊的大字牌，一字不少地写着“百字宪法”。\n每个字都跟足球那么大。刑拓宇站在字牌前演说。离得远，加上车流噪音，只能断续听到一点。他在怒斥逐级递选制只给人民选举“伪保长”的权利，是有史以来对特权进行最大垄断的挂羊头卖狗肉的所谓选举制，最后，邢拓宇接过车下人点燃的一支火把，挥动着向那字牌一字挨一字地击去。一击一个窟窿。火焰随之沿着每个窟窿的边缘燃烧扩展。他按顺序击穿每一个字，符号也不放过。这字牌肯定是“人阵”制作的，专门为了进行这番焚烧表演，作为对“百字宪法社”一次算总帐的回击。围聚的人随着每一击叫好，逐渐成为有节奏的集体吼叫。陈盼侧脸看一眼石戈。伊万骑在他肩头兴奋地跟着节奏喊好，小胳膊随着邢拓宇每下击打使劲挥动。字牌的火光似乎横穿街道在石戈脸上隐隐辉映，他的神情像凝结的岩浆。"
		},
		{
			"post_id": 12,
			"title": "《黄祸》8",
			"date_published": 1460809376.757,
			"body": "　　黄泛区\n　　既然终将毁灭，既然只有毁灭才能新生，哪就让毁灭尽早降临吧。\n\n---\n　　夕阳多美啊，欧阳中华疲惫地想。如果不是每个人都衣不蔽体的话，到像是仙境一样美丽呢。\n　　金晃晃的水无边无际地伸展，在扁而柔软的夕阳下如凝结了那样庄重。露在水面的树尖﹑房脊像金棋盘上的棋子，默默排列着神秘阵势，让人感到蕴涵着无限玄机。\n　　他掬起金晃晃的水浸一把脸，又像每天一样开始在天黑前巡视这片“领地”。黑密胡子覆盖了他的下巴和两鬓。长头发粘成一络一络。他光着上身。裤子已看不出原来模样，只有系着疙瘩的皮吊带上露着块法文铭牌。然而高不可攀的尊贵气质却一如既往，使他鹤立鸡群。无论走到哪，人们都恭敬地叫他“城里大哥”。\n　　已经六天没下雨了。大水开始消退。原来这片高地露出水面只有一个蓝球场大，现在快有三个足球场大了。高低起伏，有“半岛”，“山谷”，也有“河湾”。\n　　这片“领土”上共有五十九名男人，三十七名女人，还有十五名儿童。由于这一带决口是在夜间，多数男人直到现在也只能在下身围点东西，而妇女全靠他这些天打捞的衣服才逐渐遮住身体。\n　　人们围到岛子中央去了。一个人跪下，全体就随着跪成一片。傍晚，欧阳中华还没把橡皮艇划靠岸，就看见了那个在最高处用泥巴﹑石头和树枝塑起的形体。人们欢欣地告诉他，那就是他让他们崇拜的“美”。要是几天前，他会一脚踢倒那个虽然没有五官四肢却让人一下就想起土地神阎王爷之类的恶心偶像，今天却连一句话也没说。他想起那个去教导土人吃东西前要说感谢主恩赐食物的传教士，当土人终于学会说这句话时，随之而吃的却是他的肉。他明白这就是头了，试验结果已经出来，从来没有过高期望，以后就什么也不必再想了。\n　　中国的绿色和平思想最初是从西方学到的。以生态灾难的警告为起点，反对追求无限增长的工业主义和沉溺物欲的消费主义，主张人类自我控制，尊重脆弱的地球和其它物种，重新建构人类的生产方式和生活方式。不管在中国还是世界，许多人认为绿色思想指出了人类社会弊病所在，描绘的出路却非常软弱而不明确。一旦放弃有史以来始终如一的创造和消费物质财富的人生主题，是不能用几个空洞的“和平”﹑“灵性”﹑“回到自然”之类的词汇就填补得上的，也不是能用“道德”﹑“克制”﹑“自我约束”一类收敛性词汇就让人满足的。\n　　与之相应的，能取而代之成为永恒未来人生主题的是什么? 除了物欲以外，人类还有没有具有同样张力，能不断激发生命迸发而一代代永不枯竭的新的内驱力源泉呢?\n　　欧阳中华在他的里程碑式的著作《精神人》里指出: 有，那就是“美”。他主张用精神审美取代物质消费的生活主题，把人类内在追求的欲望和潜力从物质世界转投于精神世界。他认为人和动物的区别在于精神，因而从物质人变成精神人﹑从物质型生活转到精神型生活是人类进化发展的必然。与今天的经济型社会相区别，他把未来社会称为文化型社会。精神追求不受资源限制，因而不存在增长极限。未来社会将把人类物质生活保持在一个与生态﹑资源相符合的“温饱”水平，而把永无止境地持续提高人类精神生活水平当做社会的主要目标。人类追求不断进步的需求将在新社会中得到最大的满足。这本书被译成几十种文字，使欧阳中华成为国际名人。\n　　他的理论成为绿色哲学的一块重要基石，也成为国际绿色运动的纲领之一。许多新理论以此为基点产生，向不同的方向发展。尤其在如何从物质人社会向精神人社会过渡的问题上，许多观点截然对立。欧阳中华一直沉默。他的身分已不宜随便发表意见，拿出来的必须一鸣惊人，无懈可击。黄河决口似乎正是他等待的一个时机。他立刻背上橡皮艇，搭上一架救灾直升机。到哪并不重要，只要四面有水，水中间有一群隔绝的人，政治﹑经济﹑社会的手全都伸不到，他一直在寻找这样一个“无菌试验盘。”\n　　有了那个偶像，人们拜起来就对劲儿多了。往日那种面对虚幻的不自在和陌生感一扫而光。\n　　男女老少踏实地跪在偶像周围，热诚地磕头许愿，争相诉说，嗡嗡响成一片。一个老妇人尖声唱着呼唤观音菩萨。偶像前插了许多代表牌位和香烛的树棍。骯脏的脊背起起伏伏。\n　　等待几十亿物质人自发转变成精神人是欧阳中华最不愿接受的观点。那要一千年，甚至一万年。到那时再实现绿色，地球早已被毁掉一百次，连一棵绿芽都剩不下。他也不能容忍一生努力的结果要寄托给茫茫后世。既为一个理想献身，只有亲眼看见结果才有意义。然而“等待”和“后世”却似乎最现实，尤其对中国。谁有办法把精神贫乏物欲横流的芸芸众生在一代之间催化成精神人呢! 他对这种想法虽然蔑视，在另一个极端，却又热切盼望真能一蹴而就。他知道跟老百姓谈哲学根本没门，唯一可以利用的也许只有他们古老的群体潜意识中的宗教渴望。历史证明宗教在建立和改变人类心理结构方面有特殊力量，愚昧的物质人在宗教光晕下确有脱胎换骨为精神人的先例。他试着把绿色生活原则和审美人生主题演化成宗教形式。假如这种“绿教”能以大宗教那样的规模迅速扩展，改造芸芸众生是否可能? 绿色原则大都是古老真理，在所有宗教中几乎都有体现。中国文化传统中的清心寡欲﹑知足而乐﹑分享﹑节俭﹑积德，睦邻和热爱自然等更是再绿不过。宗教意识本身做为审美追求的最高层次之一，再没有比它更适合做为绿色未来与大众百姓之结合点的了。\n　　开始他曾受到鼓舞。在这种生死渺茫的环境里，灾民的宗教情绪一点就燃。然而当他反复说明“绿教”没有神，没有来世，没有升天，不需要仪式﹑和尚道士，也不需要磕头烧香的时候，就怎么也深入不下去。灾民以畏葸献媚的方式与他僵持，终于突破他做为“立教者”的权威，弄出了这个偶像。虽然也用草皮树叶贴成绿色，虽然他们把它叫成“美”，可在狂热的膜拜中，叫的却是从“玉皇大帝”到“关公爷爷”，还有人叫出的竟是“毛主席”。这偶像是最后一块砝码，使天平彻底定位。他明白了，宗教意识虽然是一种复杂的心理机制，但对物质人，最终不会成为精神审美，依然囿于他狭隘的功利愿望，为保佑现世，为死后上天堂，或为来世投好胎得好命。他们懂得眼前的大水是报应，惩罚他们忙于挣钱，忘了敬神。神是明确的，一还一报，赏罚分明。“美”是什么，他们却搞不懂，也无从产生敬畏之心。\n　　太阳被地平线吞没，凉气一下便升起了。白雾从水面上悄然凝聚，精灵一样飘来。欧阳中华想起北京，陈盼那个温暖的小窝。\n　　出发前，陈盼说他一定会成功，他只是淡淡地笑了笑。他从不像陈盼那样把“人民”二字奉若神明。与其说他来求成功，不如说只是求一种证实，以使自己问心无愧。如果物质的“人民”不能转变成精神的“人民”，世界只有毁灭。他做了努力，虽然他早就认为毁灭不可避免。如果说以往这种认识还只是对客观趋势无奈而冷静的推测，那么在黄水包围的此刻，则显露出另一种新的意义。毁灭和绿色未来携起了手，连结着那两只手的是死亡。在死亡中，他看到了把握未来的点……\n　　“城里大哥，该吃饭了。”那怯生生的声音像每天一样来到身边。\n　　姑娘小心地捧着一把出芽的麦粒和一块空投饼干。拜神已经结束。人们排着队从最老的那个男人手里领自己的晚饭。第一份照例先送给欧阳中华。\n　　欧阳中华用草帽接下了。姑娘没有马上离开。她有多大了?他始终没问过。十天前，他从一座快要倒塌的房架上把她救下来，他以为她只有十四五岁。现在，她那对在小背心下鼓起的乳房那么丰满，他相信她总该有十七八了。\n　　“城里大哥……我没跟他们去磕头。我看着太阳……我真地感到了你说的：美，就在我心里……”姑娘眼里泛起泪光，突然扭头跑开。\n　　欧阳中华深吸一口潮湿的空气。一个灵魂尽管只燃起小小的火苗，也能烫得人心头耸动一下。\n　　她能证明什么吗? 他有些不安。证明她的乡亲们能转变? 证明他们不该死亡吗? 不。他无声叹息。她只是黑夜坟山的一星磷火，照亮不了黑夜，只能随黑夜而消失。\n　　他舀了半饭盒水。想起水中飘浮的那些尸体就隐隐作呕。最后一片净水片被捏碎扔进饭盒。\n　　细密的气泡从水底急速升起。他后悔药品和净水片带少了，可即使再多，也不够这么多人，何况还有其它高地上的灾民呢。\n　　他开始机械地咀嚼麦粒。这几天逐渐失去了饥饿感，但他知道必须把这些如同木屑的东西咽进去。每天，他划着橡皮艇在淹没的村庄上飘泊，挨门逐户地潜进水里，从被泥沙掩埋的缸里囤里掏出这些失去了味道的粮食。靠他的野外生存知识、勇气﹑药品，靠他的橡皮艇和一身游过长江﹑黄河﹑莱茵河和大西洋的游泳本领，还靠他的威严，玄若天机的说教，他成了这一带灾民的救星，传说中的神和至高无上的领袖。他建立了“部落”﹑分配制度﹑劳动组织﹑秩序﹑甚至法律。十几天来，他那本厚厚的防水笔记本剩得越来越少。试验重点已逐步从“绿教”转到在毁灭中求生存的组织和方式上了。\n　　他曾是一个颇为走红的小说家，投身绿色运动后便放弃前途无量的文学创作，只写理论著作了。然而文学之火仍然时时在他心中燃烧。无论用多么逻辑性的语言做记录或分析，他眼前出现的却永远是带着颜色和激情的图景。无边的黄水在白色阳光下粘稠地伸展。老鼠在露出水面的大片高粱穗上跳行。抢捞浮财的盗贼枪口冒着青烟。一船船刚剥下的死人衣服。泡胀的尸体白发糕般变软腐烂。今天，他看见一只来游览的船。没遭过水灾的城里人一看见尸体便兴奋地大呼小叫，嚼着口香胶使劲照相。一个小伙子问他撸了多少块表。他咬牙克制着才没有把那混蛋掀下水。他发觉环境刺激使自己有了过多情绪化的东西。每当他划着橡皮艇给各个高地的灾民送去水底捞出的粮食时，那些可怜的人们围着他欢呼甚至跪拜，太平天国的诱惑就不断从脑海里升起。他相信如果他把自己宣布为“绿教”的神，举臂一挥就能拉起一支百万灾民的暴力大军席卷天下。若在一百年前，他会毫不犹豫地揭竿而起。但是现在，他只能在心中感叹。时代已经不需要草莽英雄，那种肚子逼出来的大军只能暴烈一时。在他的生命中，义薄云天的侠客豪情必须让位给为人类挑起指路明灯的哲学思考，唯有把一腔滚烫的血强咽下去。\n　　他只能想，只能写，至少是现在。他不能与那些民主战士去分夺风采。翻案也好，民主也好，谁上谁下，党派宪法，都是“炒锅”里面的事。整个锅都要被砸烂了，都要被烧化了，忙着在锅里去抢几颗豆子又有什么意思呢? 历史要的是在升腾的烈火上安置一口新锅，把人间的一切重新铸炼。他明白，历史已经给了他这个使命，那口新锅将首先产生于他的大脑。毁灭来临之前做不好这口新锅，一切就将在烈火中永恒地化为乌有。\n　　光线已暗淡得看不清笔记本上的字。一弯细细的月牙在水面升起。他看见男人蠕动的脊背，女人高举的腿，东一处西一处在微光下闪烁的皮肤。随着天气好转，体力恢复，这几天男女乱交的行为越来越多。他对此不干涉。在他的笔记本上，详细记载的观察分析表明，乱交有利于目前这种部落生活的融合﹑协作和稳定。相反，凡是夫妻同时在高地而不参与乱交的，都有明显的离心倾向，自私﹑算计，被集体排斥。\n　　他准备好好睡一觉，明天要划一整天的桨。他要回去了。新的理论已经在头脑里燃烧。他要赶回到北京的书斋奋笔疾书，回到陈盼的床上，回到咖啡﹑香水﹑电器与音乐的世界。这里的人将自生自灭。既然终将毁灭，既然只有毁灭才能新生，那就让毁灭尽早降临吧。促进毁灭就是推动历史进步。既然他们终将死，既然只有物质人的大灭绝才能为精神时代开辟道路，这些人的死就有了一种冷冰冰的命定，救他们就成了和历史背道而驰。他打了个哈欠。\n　　“城里大哥! ……”一个女人闷着的喊声从水边坑洼处传来。\n　　他起身迈过迈过各种形态的性交者。\n　　两个男人按着那个送饭姑娘的手脚。另一个光光的男人正在往她身上爬。\n　　“你们放开她。”他说。\n　　三个男人吓得立刻站起。\n　　“如果她不愿意，你们没有权力强迫她。”\n　　中间那男人双腿打颤，阴茎抽得小小的。\n　　“你们走吧。”他挥了一下手。\n　　地上的姑娘抽泣着。赤裸的身体在黑暗中像只白羊，只有两腿中间的三角区朦胧一团。\n　　欧阳中华扶起她。她紧紧抱住欧阳中华。\n　　“……我还是个姑娘……我只给你……”她失声哭诉，像片树叶一样簌簌发抖。热的泪流在他胸上。\n　　他的手沿着她的脊背向下抚摸，停在那圆润滑腻的臀部上。他看向月牙，看向土地上沉溺在交媾中的男男女女。他想，生命死了许多，还将再死更多……\n"
		},
		{
			"post_id": 11,
			"title": "《黄祸》7",
			"date_published": 1460806556.996,
			"body": "　　北京中南海紫光阁1号会议室\n　　把自身命运交到别人手里，与其说是解决危机的办法，不如说办法本身就是危机。\n\n---\n　　娃娃脸的女服务员第三次掀开石戈的茶杯盖，见仍是没动一口，索性换上一杯新茶，随后端上一盘香喷喷的擦脸巾。石戈接了一块擦掉额上汗珠。她像得了奖赏，忙把空调制冷量加大一些。开会前她因为石戈忘记关门“呲儿”了他一句，那声调很像外面公共汽车上的女售票员。这个矮墩墩的光头来得最早。只他一个人，那么普通，丝毫没有掌握权力者的威严，也不像后到的那些头头脑脑，前呼后拥一大帮。所以她把他当成了一个生怕迟到的跟班，第一次能进这里的土老帽。假如他风度翩翩，机智幽默，显得平易近人，也许她会把他当成自己人，可他对人视而不见，一副若有所思沉默寡言的穷酸相。放跑了冷气，温度达不到标准是她的失职，她当然不会对他客气。可是很快发现不像那么回事，陆续到的头头都跟他很熟，连最后入场的总书记和总理也跟他握手。女服务员知道大头头里肯定没有“石戈”这个名字，在对话中只能听出他领导一个什么“十六号机关”。那是个什么机构，她猜不透，但开会中他一发言每个人都竖耳朵，这一点她能看出。她为自己刚才那句“呲儿”害怕极了。虽然他当时连声道歉，可老资格的同事都说大人物整人从来不露声色。\n　　石戈经常来这里，即使来得再多，也很难被服务人员记住。除了模样普通，这回又换了个光头，还有他实际上不能算是一个“官儿”。本质上，他跟坐在后排的那些跟班的一样。他只是一个专家，专门负责处理紧急状态，制定和实施应急方案。所谓紧急状态，就是“危机”的好听一点的别称。不过这些年，紧急状态已经不是一种特殊状态，也难以归到某类分工里，几乎所有工作全被紧急状态牵着鼻子走。他的职权范围因此不断扩大。领导的工作班子也从一个小组发展成现在三百多号人的“国家安全问题研究所”。工作范围从应急扩展到预测，包括事先估计可能发生的危机和储备相应方案。研究所对外只按门牌号称做“十六号机关”。\n　　他以这个神秘身份参加过多次处理危机的指挥，有时权力可以相当于副总理。然而对外几乎从无他的声名。每次危机过后，他就回到研究所。在中国式的等级序列里，只定为不带“长”的“副部级”。\n　　黄河流域大面积暴雨天气近日已转为晴好。洪水减退。救灾组织都已投入全力运转。加上几十万军队的力量，黄河大堤决口处已全部堵死，灾情停止蔓延。大水虽然还淹没着广大地区，随着疏导﹑下渗和蒸发，正在不断消退。政府的当务之急已从抗洪转到安置灾民和重建灾区之上。今天的会议由三个国家级智囊机构拿出各自的方案，互相评价，供最高领导选择。除了十六号机关，还有中央政策研究中心和农村发展委员会。这两个机构的级别﹑资历和规模远超出十六号机关，到会人数也多，但发言最多的是石戈。\n　　对损失程度的估计，三个机构基本认同。遭这次黄泛破坏的城市﹑企业﹑油田﹑水库﹑铁路，居民生活等，以当前的通货膨胀率计算，至少损失十二万亿人民币，相当于全年国民生产总值的8%。对水灾将产生的连锁影响，彼此看法却有很大区别。那两个机构着重经济后果，石戈首先强调的则是流民对社会的冲击。\n　　“……初步估计，这次黄河水灾造成的灾民有一千九百多万。他们的住所﹑土地﹑财产全部被毁，为了解决吃饭问题，必然向未受灾地区流动。但任何地方也不可能供养这样一支乞讨大军，在饥饿逼迫下，灾民很可能采取的行动就是哄抢。现在正值收获季节，哄抢现像已有发生。而被哄抢的对像一旦颗粒无收，无以为生，就只有也加入流民行列，再去哄抢别人。\n　　这种涟漪将会很快地传递……”\n　　“为什么你就断定灾民只会抢，而不是生产自救? 我们过去遭受过多次自然灾害，也都解决得很好嘛! ”说话的是中央政策研究中心副主任。这种评价方案的会议允许当场质疑。能看出副主任对石戈有种不太掩饰的不以为然。\n　　“过去国家有粮食，而现在没有，这就是关键的区别。这些年生态恶化，粮食大幅度减产，农民抗交公粮。我们现有的储备保障城市居民当年供应还有欠缺，不可能再养二千万灾民。\n　　而只要没有粮食吃，生产自救无从谈起。曾国藩总结: ‘民无粮则必从贼，贼无粮则必变流贼，而天下无了日矣’。大规模哄抢不仅破坏当年收成和分配，更严重的威胁是对于下年生产。社会一旦失去秩序，劳动成果失去保障，就成为对生产力的致命打击。下年就将更难，饥民更多，哄抢也就会更严重。如此循环，陷入共振，有可能导致社会产生大动乱……”\n　　“我们不是腐朽的清帝国，现在的灾民也不是太平天国﹑白莲教或者捻军。我们有组织，不会放任自流。”农村发展委员会主任插了一句。\n　　总书记一直没说话，有时起身来回走，有时扶着椅背站一会，偶尔用粗大的红铅笔写几个字。\n　　他脸色阴沉。每个数字都像一颗煞星，三个机构一块往外甩，这么一会就把一个愁云惨惨的天空笼罩在他头顶。相比之下，陆浩然倒显得无所谓，坐在宽大沙发里，两手交叉置于丹田，眼睛向上，像是在调息。\n　　“……引起清朝大动乱的原因除了社会制度不公平和政府腐败之外，还有一个重要的催化剂，就是大量人口过剩。”石戈接着说。“所谓驱人归农无田可耕，驱人归业无技教人，不士不农不工不商之人十将五六，由此使乞丐，僧道等次生社会集团勃兴，帮会组织兴盛，流氓﹑匪盗﹑娼妓等芸芸众生弥漫全社会，形成动乱产生的土壤。这在本质上是人口与资源的失衡，而这种失衡最敏感的表现就是粮食短缺。在这一点上，今天的严重性已超过太平天国时期。至于我们的农村组织，从土地承包﹑公社解体后就等于名存实亡。别说无法阻止饥民流动，更可能的是在两千万黄河灾民的冲击下，引发全国农村的两亿四千万隐性失业人口大流动。最近几个月，仅仅是传闻中的黑龙江中日经济合作区就吸引了一千六百万人向黑龙江流动。正式公布协议后，估计又有三﹑四千万人开始上路，举家迁移。随着黄河水退，被困的灾民可能将有相当一部分加入这个行列。另一个迁移方向是东南沿海各省，尤其是广东﹑福建﹑浙江，几年累计已有四千万人涌入。最近可能马上掀起一个新高潮。以往的流动还带有秩序性，遵守法律，而灾民的流动首先冲击的就是秩序和法律。这种流动就像洪水一样，破坏性非常大，所过之处，法律秩序无存，连锁反应难以预料，搞不好也许就会一发不可收拾……”\n　　“我们这么大一个国家，会像你渲染的那样脆弱，被一个小小黄河打倒在地吗? ”有人不屑的反问。照理在场的都是专家，不该有这种语言和口气，也许这只是为了总书记的脸色而发。\n　　“……不错，我们国家是很大，可是一个巨人走钢丝，一个小拇指就能使他跌下去，钢丝就是我国的人口已经达到了我国国土资源承载极限的临界，而黄河就有可能是那个小拇指。极限之内和极限之外也许只差一个小小的‘1’，却会造成完全相反的结果。这样的逻辑不是没有可能存在的: 黄河水灾造成粮食短缺，流民哄抢造成农业萎缩，农村拒绝交粮造成城市饥荒，最后导致国民经济崩溃，政治动乱接踵而来，社会冲突……”\n　　总书记挥了一下手，打断石戈。\n　　“还是谈解决方案吧。”\n　　虽然总书记的声调没露出什么，却连娃娃脸的女服务员也能看出他的不快。石戈把半截话咽了回去，端起茶一饮而进。这回女服务员可没有马上给他添水。\n　　关键是钱和粮，这一点看法一致。即便对石戈的渲染不以为然，但对控制两千万灾民，防止他们变成流民甚至流匪，也是其它两个机构的共识。做到这点唯一的武器就是粮食。具体办法是对留在家乡的每个灾民，国家每天免费发放三百克到四百克成品粮。这点粮食虽然不多，却能使人活下去，并且逐步重建家园，胜似朝不保夕的流浪。这样保证明年春天恢复生产，秋天就可以收获新粮。也就是说，国家至少要免费供应一年粮食，才能最终稳定住这两千万人。大致算起来，共需六十亿斤粮食。同时，消除水灾损失需十二万亿人民币。如果根治黄河，还需三万五千亿元。那么解决方案归结到一点，其实只是粮食和钱怎么来的问题。\n　　粮食只能靠进口。这些年世界人口爆炸，生态恶化，粮食日益恐慌，能出口大宗粮食的国家只剩美国﹑加拿大和澳大利亚。粮价飞涨，六十亿斤粮食至少需要三十五亿美元。这笔外汇国家无论如何拿不出。重建所需的十二万亿人民币同样毫无来源，除非开动印钞机，那会使通货膨胀率从现在的三位数变成四位数。根治黄河根本别想。可大堤这次被冲得千疮百孔，明年再决一次又怎么收拾? 后年呢……\n　　农业发展委员会主张在日本人身上打主意，很快被否定。“包”出去一个黑龙江，现钱一分拿不到。经营税要等日本接管一年以后才交。转到日本名下的一千四百七十亿美元外债有近一千一百亿是欠日本的。石戈很怀疑这笔债务跟承包黑龙江省之间有一种长久安排的隐秘联系。眼看中国还不上钱却一直慷慨解囊不符合日本式的算计，除非算计的就是让你还不上，最终用日本想要的东西抵押，东西一到手就不会让你再占便宜，这几天日本舆论转向叫嚷吃亏就是得了便宜卖乖，明告诉中国别再伸手了。\n　　冷场片刻，政策研究中心的一个年轻研究员开口，首先一再强调谈的是“个人意见”。这种方式一目了然。政策研究中心的正副主任默不作声。做为一个机构不好说的话让“个人”说，头头不好说的话让下边说，年长的不好说的话让年轻的说，搞这行的人都清楚。\n　　研究员口才相当好，逻辑清晰，论据充分。他从当年的“六四”事件谈起，用大量事实和数据说明，“六四”造成的影响及后果给中国带来了巨大损失。国际投资失去信心，不信任中国前途的局面一直未从根本上扭转，进入中国的外资多数只实行短期战略，随时准备撤脚。\n　　自从东欧剧变和苏联解体之后，中国成了孤独的堡垒，独自承受西方阵营的压力。以美国为首的西方用种种方式对中国进行刁难﹑限制，造成的损失难以估量。海外华人对大陆政权失去信任，巨额华人财富难以调动，常常只能眼看着流入他人之田。香港收回后人才和资金的外流如决堤洪水。最近主张“台独”的民进党取代国民党上台已成难挡之势。台湾资金纷纷转向东南亚。而国内民心因“六四”背离，并未象当初期望的那样“淡忘”，所有敌对势力都把“六四”当成永不过时的挑拨煽动口实。怠工成为侵袭社会肌体每个细胞的癌症。抗上闹事层出不穷。拋弃祖国迁居异邦一直许多青年的最高理想，连出口劳务的工人都把外汇存在外国银行。研究员做了个大致估算，且不说对政治﹑外交﹑社会﹑民族等方面的影响，仅仅经济损失一项，至少就达数千亿美元。\n　　“……假如没这笔损失，我们在政治经济上的困难就远不会到今天的地步。也许还会相反，完全是另一番景像。”研究员把眼前的资料和表格推开。“但是历史不容我们对已经发生的事情进行假设，它只给我们眼前的机会。中央领导告诉我们这些当参谋的没有禁区，什么主意都可以出。现在，什么主意都没有了，就逼出了这最后一个主意。再声明一次，完全是我的个人想法: 我们能不能在因六四而导致的巨大损失里挽回一些，用来对付黄河造成的灾害呢!\n　　怎么挽回? 我是搞经济的，不太从政治角度考虑问题。但我至少知道，如果我们给六四事件公开平反，不光可以换得国际关系的新格局与国内民众拥护，而且能立即兑现成大量金钱援助和物资捐赠。西方国家已经多次表示过这个态度。现在正临我们遭受灾害，更会促使他们全力以赴援助我们。我认为，只剩这一条路能解决我们面临的燃眉之急。至少在钱的方面，再没有别的途径。我的话完了。”\n　　戴上那么大的帽子，实质的话就几句。其实只要一句就够了: 为“六四”平反。这么多年从未有人在正式场合公开提过，然而会场上没人惊讶。在场的人都清楚，这不是爆炸性的，也不具有突破意义，只不过是选择这个时机以“个人意见”的面目拋出一个酝酿已久的最高决策罢了。政策研究中心一直在按总书记旨意秘密筹划实施这个行动。现在只是正式挑出旗来。\n　　如果一切顺利，这个“个人意见”就将按部就班地演变成中央决议，也就成为历史现实。奇怪的倒是陆浩然的超脱，他无动于衷地照旧“调息”。\n　　“我也只从经济角度谈。”石戈打破面临重大时刻的全场静默。“六四平反可以兑现成金钱和物资，问题是有多少? 态度和签署支票之间还相距无数环节。我们不能把希望寄托在态度上。\n　　西方国家给当年的东欧以及后来的独联体许诺也很多，兑现了多少? 说西方会全力以赴援助我们未免天真。就算认可这种天真，中国不是罗马尼亚或保加利亚，也不是乌克兰甚至俄罗斯，全世界加到一块也未见帮得起。尤其我们要的不是计算游戏中那些无形的幻想数字，而是扎扎实实立刻就能摸得着的三十五亿美元粮食，相当于一百六十亿美元的重建物资和四十七亿美元的治黄费用，马上就要，一天也不能耽搁! 我们能把立脚点放在一种等人施舍的一厢情愿上吗? 把自身命运交到别人手中，与其说是解决危机的办法，不如说办法本身就是危机! ”\n　　年轻研究员轻蔑地瞥一眼石戈。\n　　“我以为现在不是谈自力更生原则的时候。问题是除了国际社会，我们从哪能得到这笔钱?\n　　就算国际社会给不了多，国内却一分也拿不出。不管怎么说，少总比无强。”\n　　“石戈同志，谈谈你的方案。”开会以来，陆浩然第一次说话。\n　　女服务员发现，这位一眼不看其它人的总理倒好象对石戈发生了兴趣。她马上给石戈添了一杯水。\n　　“国内有地方出这笔钱。”\n　　人们同时瞪起眼睛。\n　　石戈停顿一下。\n　　“军队。”\n　　眼睛们画出无数问号。\n　　“我们每年的军费开支相当于目前的八万五千亿人民币。其中外汇约合三十亿五千万美元，这笔外汇购买六十亿斤粮食已经差不多。除此之外，挽回水灾损失，再加上根治黄河，两年军费也全够了。而后，每年有这额外的八万五千亿用于发展经济，我们一下就活了，许多难题迎刃而解……”\n　　“等一等，什么叫‘额外’的? 照你这么算，军队花什么钱? ”中央办公厅主任问。\n　　“军队不必花钱了……”石戈看了看吊灯上一个刺目的反光点。“军队解散。”\n　　所有的眼睛都瞪圆了。石戈加快语气，似乎怕人们叫喊起来打断他。\n　　“供养军队的目的是保卫国家，防止侵略，然而对于中国，是不是还真地存在这种威胁? 我们的人口已经饱和，再无别人可以插足的领土，也不存在可供掠夺的剩余资源。我们的十三亿人口﹑拥挤的空间和贫穷本身其实已是最好的防身武器。若有谁想占领这个国家，谁就自己陷入一个无边的沼泽，背上一个能把它压得喘不过气的包袱。我想不出世界上哪个国家能有占领中国的能力，那么我们每年花八万五千亿元的代价，养一支昂贵军队意义是什么，到底值不值得? 尤其在人民生计和国家安定都无法解决的时候。有人会说，南中国海不是正在几国相争，强弱对比全决定于军事力量的大小吗? 不错，越南﹑菲律宾﹑马来西亚什么的可能想占领南沙几个小岛，但那几块珊瑚礁就值得养一支几百万人的常备军吗? 哪怕那下面真有一个大油田，每年用八万五千亿的军费去争夺，算起帐来也是得不偿失。的确，西藏新疆有人在搞分裂，但我们若不是用花费八万五千亿的军队威吓他们，而是用这八万五千亿去搞建设，对防止分裂远可能更有效。何况以国内现有的一百多万警察，已能提供镇压分裂的力量。反过来说，即使真发生了侵略战争，我们组建临时军队，打人民战争不见得不能保卫自己。当年的美国在越南﹑苏联在阿富汗全以焦头烂额的撤退而告终，而中国却是越南﹑阿富汗的一百倍，能让全世界军队都在这十三亿人口的汪洋大海里淹没。实际上，无防卫的防卫可能正是最安全最有效的防卫。比如说，拥有核武器可能恰恰会成为招致核武器打击的原因，庞大的常备军隐藏着政变和军事独裁的隐患。如果我们主动全面放弃军备，销毁全部核武器，宣布永不战争，我们将在世界获得最大的赞扬和尊敬。我们没有失去安全，却每年多得八万五千亿元。有了这笔钱，眼下迫在眉睫的社会问题便可以得到解决，使我们就此摆脱危机，进入良性循环……”\n　　“一向听说石戈同志语惊四座，真是百闻不如一见。”中央办公厅主任突然诙谐地插了一句。\n　　全场哄堂大笑，久久不绝。\n　　总书记没笑，他不发火已经算宽容了。\n　　陆浩然也没笑。他更为仔细地打量窘迫的石戈。\n　　娃娃脸的女服务员表面没笑，心里却乐了。她看得出场上多数人是在嘲笑那个光头，把他当成疯子或傻瓜。别看表面上他们对他亲亲热热，内心原来却是另外一回事。得罪这样一个人没什么了不起，她心里顿时轻松了。"
		},
		{
			"post_id": 10,
			"title": "《黄祸》6",
			"date_published": 1460793581.404,
			"body": "　　山东半岛201海军基地\n　　有效威慑的前提在于秘密性，如果潜艇行踪被敌人掌握，它就无异于一个用黄金堆起来的废物。\n\n---\n　　虽然隧道洞口的值班上尉一眼就认出王锋的通行证是最高级别的，带领全体卫兵立正敬礼，例行检查却一项不少。计算器识别，指纹核对，他的“奔驰560”也和所有汽车一样开到专用地沟上检查有无爆炸物。王锋显出不耐烦的样子，考验上尉是否屈服于大人物的压力而放松检查。最后他很满意。\n　　上次来这已经相隔四十多天。在王锋的记忆里，这是最长的一次。这一段全部时间都花费在西山别墅的接待和谈话上，简直一分钟也离不开。陆浩然是最后一个谈话者。把那位未来的总书记送上汽车不到五分钟，他就开着这辆“奔驰560”登上旋翼已经转动的直升机。飞行途中他美美地睡了两个小时，降落前给北京家中的妻子打了个电话，告诉她两小时以后回家，当然，他没说他正在山东上空降落，看妻子之前先来看一艘潜艇。\n　　汽车在隧道里要走五分钟。一路的岗哨都接到上尉的电话，移开路障敬礼放行。王锋自己开车。除了在正式场合，他很少用司机。隧道里灯火通明，比起它所通达的山洞却又显得黯然。\n　　宏伟的山洞比白昼还亮。千百只灯布满全部空间。隧道直达一座人工建造的码头。码头下面现在无水，是个干涸的巨大的深坑，足有三百米长，二百米宽，从上到下挂满防撞橡胶。坑底是倾斜的。大海被一道巨闸挡在山洞外面，当闸门升起，海水涌进灌满，潜艇就可以从水底驶出山洞，直接在水下出航。现在，坑内只有一艘座落在密集支架上的巨型潜艇，尚未完工。\n　　过去，这里被海军用做秘密行动的码头。王锋费了很大劲才从海军手里抢过来。他上任国防科工委主任不久就开始建造这艘导弹核潜艇。他一直主张军队应从数量型转向质量型，从人力型转向武器型。在他的战略观念中，一艘用现代最新科技装备起来的导弹核潜艇胜过一百万军队。一个国家只要有一艘，就能以它的核威慑保障任何强敌不敢贸然侵犯。当然，有效威慑的前提在于秘密性，如果潜艇行踪被敌人掌握，它就无异一个用黄金堆起来的废物。今天，在布满卫星和红外线的天空下，保密甚至比潜艇工程本身还难。王锋在主席的支持下，占有了这个世界稀有的潜艇码头，将海水排干，改成施工船坞。新修的隧道口伪装成仓库大门。所有的设备﹑原料﹑部件都伪装成入库物资。为了迷惑卫星，有时先把物资运进周围真正的山洞仓库，再假扮各库调运物资倒进这里。光是为了这种障眼法，就有一个汽车营常年不懈地奔忙。那一营士兵直到退役也不知自己忙些什么。这种防范只是为了对付卫星与那些没有生命的光电仪器。王锋知道这是相对容易的。最难防的是人，尤其是自己人。如此一个浩大工程，涉及无数部门和人员，要想让每个人都守口如瓶纯粹是做梦。他用的方法是不让任何人知道全貌，每个部门每个人都只知道有关自己的那一点。至今，连中央军委﹑总参谋长﹑海军司令那一层都不甚清楚这里到底在干什么，干到了哪一步，花了几千亿元最终能造出个什么。\n　　王锋把车停在码头边上。四周堆满了大大小小的箱子。西德的雷达，美国的计算器﹑荷兰的潜望镜﹑丹麦的电机﹑日本的涡轮……这艘潜艇一大半设备是西方国家的产品。为了绕过那些国家政府对尖端设备出口的限制，弄到这些东西费尽周折，价格也高出几倍。王锋对这一点毫不含糊，他认定只有采用西方技术才能在现代军事对抗中立足。\n　　“报告! ”丁大海在车前立正。他穿一身海军便装，没有军衔，没戴军帽，因而不能敬礼。\n　　看得出这使他相当尴尬，手足无措。\n　　“随便吧。”王锋亲切地拍拍他的肩，和他握手。丁大海三十五六岁，一米七左右的个，肩膀宽得吓人。圆圆的脑袋，头发只有半寸长，肤色又黑又红，浑身肌肉把军服撑得圆滚滚，像个典型的胶东船老大，却戴副葡萄酒瓶底那么厚的深度近视眼镜。他是这艘潜艇的监造人。\n　　进入潜艇内部还需经过两道岗。第一道岗是进入外壳。精通潜艇构造的人能发现，从外面看见的庞然大物并不是真正的潜艇，只是一个伪装。还有一艘接近完工的潜艇套在里面，只有持红色通行证的人能进去。那才是这项工程的真正对像。这个花招是王锋的得意计策，专门用于对付内部人。多数参与施工的人都不知道真相，即使他们看得出来是两套壳体，也以为是新式结构呢。王锋知道这项工程不可能永远不让那些自以为有权知道一切的人物光临。自己当军委副秘书长时还可以兼任国防科工委主任，马上就要当秘书长了，兼职必然得放弃。\n　　继任的主任肯定要过问，必须抢在那之前让潜艇完工出海，只留下一个空壳。那时只要几个关键的人守口如瓶，知道内幕的水兵随艇出海，别的人就谁也弄不清怎么回事。当初设想这个“金蝉脱壳”之计主要目的是为了对付西方的情报机关，现在的意义则要深远多了。\n　　他喜欢设计和实施计谋，也许这是天性。儿童时他的理想是做一名优秀的间谍。文化革命中，无论当红卫兵领袖，还是参与暗杀江青的阴谋，或是做为父亲的特使游说高级将领，他在政治方面的天才都得到了最肥沃的土壤，催放了早熟之花。那时他的理想已经是当国家元首了。\n　　与多数军队高干子弟一样，他未成年就进了军队。不同的是，他没有把军队当成暂时栖身的避风港，而从一开始就认定了“枪杆子里面出政权”是千真万确的真理，把军队视做政治生涯的起点。他不赶时髦去搞作战﹑侦察﹑军事研究等，全心全意地投身于尖端武器。他认定未来战争是政治家使用高科技武器进行的，而不是靠士兵的刺刀见红。他为自己设计的每一步几乎都是完美地实现。现在，就快到迈出最后一步的时候了。\n　　他对潜艇每一部位都仔细审视。总设计师﹑总工程师和生产总指挥紧张地跟在他身后。他经常来这里进行这种视察。有多少实际意义他很清楚。尽管他在军事工程学院学过导弹，尽管他对全世界的武器装备如数家珍，可在具体的设计﹑制造和施工问题上，他那点知识对身后这几个老总来说连小拇指都算不上。他并不想指教他们，他只要他们紧张，要所有的工作人员经常看见中将的军衔在这里亮相。他什么都不用说，沉默而专心的审视，再加上几个尖刻的问题，就足以使这些老总身上出汗，使他们像拉车的马一样，不时被眼前无声晃动的鞭影所提醒。其实，当他长久站在刚刚安装完毕的螺旋桨前，他的眼睛看着闪亮的黄铜，脑子里出现的却是黄河在中原大地上旋出的扇面。\n　　他很满意这次黄河救灾的部署。过去每次抢险，军队都是从一开始就在最前线。险过了，没有成灾，人们马上也就忘了。固有的弊病，问题和矛盾依然如故，越过越舒坦。军队的自我牺牲抢了弊病的险，换来了无能者的安全和错误路线继续为所欲为地害国害民。而这次，他先用种种借口拖延军队出动，使形形色色的问题大暴露，同时又不露丝毫破绽，把军队不能及时出动的原因引到地方不配合，中央不创造条件等客观问题上。他看不起有些将领不堪目睹“国家受灾”的婆婆心肠。损失几万个亿算什么，如果不让这场大水冲掉错误路线及其代表人物，别说几万个亿，亡党亡国也就在眼前了。而且，他信奉一个古老的教导──“等人快死的时候再救人”。这次军队出动得最晚，得到的民众感激却最深，新闻媒介的赞誉最高，受灾地区的拥戴最坚决，不就是这个古老真理的体现吗。更重要的是，通过这次救灾，完成了只有几个军方最高领导掌握的行动──重新部署军队。受灾地区如此广大，需要的人力如此之多，情况又如此混乱，恰逢其时地给大规模调兵找到了最好的合法外衣。现在，已经人不知鬼不晓地完成了包围北京﹑控制中原，面向南方的兵力部署。同时以救灾借口调动和囤积了大批物资。可以说，最后一步的一切都已就绪，只差往外迈了。\n　　通过最后一道岗，进入真正的潜艇内部。主体工程已经完成，正在装修内部。王锋对密封条装配质量进行了一番挑剔，命令全部重装。他拨动锁定转轮，很灵活，一个手指就可以带动。\n　　他翻来复去地拨，似乎专心之致，眼前出现的却是一片旋转的子弹。那个人必须死。虽然王锋自己和“六四”没有任何关系，但他深知“六四”是军队不容触动的一个禁区，说它是原则也好，“六四”以后的建军和治军思想全部以它为核心，本质上却更不如说是一个疮疤，坚硬的痂壳一揭开就会让许多最敏感的神经暴露无疑。不错，低层知识军官里不少人讲什么“民主意识”，但那不过是脚趾头的“意识”，仅仅是“讲”。让脚趾头立正它不敢稍息，这就是军队。根本问题在于: 否定“六四”平暴，军队就将染上一个永恒的污点，一大批珍重荣誉胜过生命的高级将领就将被判为历史罪人。为了免于这耻辱，他们宁愿再杀十倍，百倍的人，何况一个人。然而，王锋没跟他们提起。该谁死谁就死，死就是了，怎么死的就让它成为永恒的秘密。一个人的死是最简单的，既不是兵变，也不是政治斗争，只是一个弄不清谜底的偶然。权力自然而然地更迭，谁也说不出什么，谁也找不到借口。国内也好，国际也好，只能接受现实。至于怀疑和猜测，让它们见鬼去吧，反正拿不上桌面。他没拿准事成后该怎么处理沈迪。眼下，他通过复杂的渠道安排沈迪做了总书记的保安负责人，为的是保证杀手安全逃离现场，不管现场在何时何地。除了八百万美元的索价，杀手的附加条件是必须保证他活着。只要他死在中国境内，沈迪和他谈话的录像就会向世界公布。这当然是防止灭口，同时也是逼迫“雇主”尽最大努力提供保护的手法。王锋相信沈迪能做到这一点。而一俟杀手安全出境，隐患就只剩一个沉迪。他知道沈迪不能算一个无限忠诚的部下。他甚至掌握那小子在为他筹措秘密经费倒卖导弹时至少贪污过一百万美元的证据。然而毕竟从小就在一起，当了几十年自己的小兄弟。一想到这，他心里就软软地不愿意把“隐患”一类的问题想下去。\n　　他看了气密监视台的试验。指示板上，纵横排列的光点全是绿色，给人一种安全宽心的感觉。\n　　纯粹而美丽的绿色使他感到舒适，甚至陶醉。丁大海把水密门打开一点，立刻在指示板相应位置上出现一个令人心惊的红点，一闪一闪，像血﹑像火。现在一切顺利，但值得担心之处毕竟很多。医生已经委婉地表示，主席的生命已无太久。老人近来已经瘫痪，许多内脏功能得靠外力维持。这次西山接见靠的是一个专用沙发，藏住那些通入他体内的仪器和管路，并用化妆给衰老得几乎透明的皮肤盖上健康颜色，免得暴露的血管和骨骼给人留下骷髅的印象。对每组被接见的人都用“感冒”做借口，只给几分钟，其余的由王锋继续。即使这样，每一次几分钟都使主席大损，使那些藏在周围房间的抢救班子盯着监测信号焦虑万分。发生过两次需要中途抢救的情况，都被王锋巧妙地遮掩过去。即使对主席最心腹的爱将，也不能让他们知道主席身体的真相。主席的威力是和主席的生命力共存并且成正比的。王锋把这一点视为关键。虽然他自信自己的能力，却十分清楚自己在军队的根底毕竟还浅，还没有足够的时间培植起能够控制全军的羽翼，只能靠主席的生命给自己争取时间。当然，他知道挟天子以令诸侯是权宜之计。时代不同了，现在既没有古代的“忠”，也没有过去的“信仰”。主席的权威是靠长年经营起来的盘根错节的制约，是纯个人的，他无法继承。主席迟早要死，一旦失去了主席那个核心，制约也就没了，各路诸侯就将只受“野心”和“利益”支配。他虽然马上就是军委秘书长，名义上是军队最有实权的人，却除了一个区区军委警卫团，调动一兵一卒都得通过各兵种和各军区那些诸侯。他们不听你的呢? 有什么办法对付他们? 如果没有任何办法，他们凭什么听你的呢? \n&#160; &#160; &#160; &#160;暂时，在共同利益面前，军队会团结一致。“六四”以后，军队地位不断提高。随着参政意识加深，越来越厌烦充当“驯服工具”的角色。新一代军队领导人大都在“文化革命”期间参予过军管，尝过权力的滋味，又学到了管理政权的技巧。那是一种影响深远的经验，使他们总是盼望再次发挥。面对当前社会危机状况，他们早就认为军队该挺身而出了。所以在主席“打招呼”的过程中，他们全都表达了盼望已久的心情，并对主席指定王锋为全权代表的决定表示服从。但是，王锋对表面的笑容和巴结全不相信。多年来，他对“林彪事件”的反复研究和思考提醒他处处居安思危。当时的陆海空三军首脑全部是林的铁杆，关键时刻却不能为林放一枪一炮。使林空握有五百万大军，孤零零地摔死在蒙古沙漠上，今天，他既没有林彪的权威，又没有林彪的体系，为了不落得林彪的下场，他就更不能指望别人。\n　　他环视潜艇指挥舱。所有的精密仪器都兴奋地闪亮。至少，他心爱的这个杰作是属于他的。\n　　他已经逐渐形成一个明确的想法: 这艘潜艇不能交出去。在他现在这种地位上，他会找到一个合适的理由，让这艘潜艇无人知晓地消失在大洋深处。他也会设计一个巧妙的程序，让这艘潜艇只受自己一个人指挥。至于做什么，他不知道，但总会是手里的一张牌吧。只要一年就够了。他相信一年内他就能控制局面。如果一切顺利，这艘潜艇就会正常地交到海军去服役。但愿一切顺利。\n　　他看了看始终用立正姿势站在一旁的丁大海。要保证潜艇服从自己指挥，关键是选择一个合适的艇长。这个艇长不但要有极高的专业水平和实战经验，还必须不被任何部门所掌握。不管是总政治部，还是海军﹑还是舰队司令，都不能对他下命令，甚至连花名册上都没有他。\n　　除此之外，最重要的还是对自己绝对忠诚。王锋从来不相信什么“天意”一类的东西，然而他有时确实对“巧合”的奇妙感到惊讶。同时符合上述三个条件的潜艇艇长可以说永远不会有。一个能指挥战略导弹核潜艇的艇长是被黄金堆出来的，怎么会不在花名册上? 可这个丁大海就是一个。他当年以第一名的成绩从潜艇学院毕业。十年艇长生涯中，档案的评价永远是三个“Ａ”。他是海军潜艇部队最好的艇长之一，仅当了两年常规潜艇艇长就上了核潜艇，后来又当上导弹核潜艇的艇长。他这样的艇长全国仅有十几名。但是谁也没想到，这个品格鉴定一向优良的丁大海，四年前在美国安那波利斯海军学院研究生院进修时，竟为一个美国女人把同班的美国军官打得颅骨开裂，被美国法庭判了两年徒刑。当然，中国军队更不会容纳这种人，等他服完刑回国，海军已经把这个当年的骄子遗忘了。年轻有为的新艇长英才辈出。他默默地回他出生的渔村去打渔。是王锋把他找回来，让他当上代表用户的监造人。那时只是想利用他对核潜艇的使用经验，也是一种一般意义上的搜罗人才。但自从王锋产生了自己掌握这艘潜艇的想法，每当想到“艇长”这个词时，脑子里就会出现丁大海那张永无笑容的脸。\n　　定是忠诚的，王锋想。但如果命令他向他的渔村发射核弹，他会不会执行呢?"
		},
		{
			"post_id": 9,
			"title": "《黄祸》5",
			"date_published": 1460792554.002,
			"body": "　　黄河\n　　现在，以社会主义体制保证的最有效治黄手段──人海战术失灵了。\n\n---\n　　有史记载的二千多年，这条水色幽黄的大河决口一千五百多次。它是世界输沙量最高的河流，每年有四亿吨泥沙淤积在下游河床。年覆一年，下游黄河高出地面，成为“悬河”。远看河中船就像在空中航行。从河南桃花峪到黄河入海口，这浩荡悬河全靠两道大堤约束。共产党执政几十年没决过一次口，举世视为奇迹，也被共产党当做自身治国能力的证明，但是这一次，也许就成了一个反面的证明。\n　　七月二十九日，十七号台风深入黄淮地区。其外围的低空东南气流在黄河中游与一个强大的西风冷槽相遇，三门峡到花园口区间突降百年罕见的特大暴雨。洛河赵堡水文站的观测员只把脸盆往门外伸一下就接了半盆雨水，并且有一只被雨从空中打落的麻雀沉在盆底。伊河﹑洛河﹑沁河等黄河支流相继出现洪峰，与黄河干流洪峰汇合，通过花园口水文站时，流量已达二万一千四百立方米，接近一九四九年以后的最大洪峰。黄河水利委员会立刻向中央﹑国务院和河南﹑山东两省发出紧急警报。\n　　“政治挂帅”是共产党的治国法宝，最能保证政府部门的忠诚。然而另一方面，也导致一旦政治形势不明朗，政府部门的效率就会陡降。“六四”的案翻与不翻，对每个官员都有太大的影响，天大的事相比也变成次要。加上动乱影响了组织﹑信息和物资系统的正常运转，等到抗洪救险好不容易动员起来时，险情已开始层出不穷。\n　　过去，几小时可以动员几百万人上堤。现在，人民公社的解散失掉了最有效的治黄手段──人海战术。村干部在暴雨中喊破了嗓子，农民们却只顾挖自己田地的排水沟，修自家房顶或盖自家柴垛。好不容易凑起来的人懒懒散散，先争价钱，然后计较活的轻重，再想方设法偷懒。城市更组织不起来，人们全在忙于各种游行集会。以往抗洪有一支最强的力量──军队，这次却迟迟调不上来。\n　　降雨面积不断扩大。七月三十日下午，山东省东明县高村堤段突然开始坍塌。三十多公尺宽的堤顶不到一分钟就只剩一层护堤石墙。河务局的徐工程师声嘶力竭地喊: “快投石料! ”\n　　他记得一九五八年，在花园口看到过同样险情。当时上千名解放军战士抢着冲上去扔石块，一会儿就把缺口填住。然而现在，他刚喊完，所有民工却四散逃命。在他痛恨地跺脚时，轰然一声巨响，黄水像昂首的妖龙一样窜向正在低地逃散的人群。徐工程师成了这妖龙吞噬的第一块点心。他喊出最后的三个字是: “解放军……”\n　　这条黄色的巨龙吞噬了一个个村庄，成千上万的性命，咬断了中国南北交通的大动脉──京沪线。无数耕地变为一片泽国。东明﹑菏泽﹑定陶﹑成武﹑金乡﹑鱼台相继被淹。工厂停工，学校停课。大水接着淹及江苏﹑安徽。\n　　七月三十一日，下游暴雨未停，三门峡水库上游又发生特大洪水。本来水库已关闸蓄水，为下游抗洪减轻压力。一天之间，水库满槽。陕西的渭河﹑洛河，山西的汾河﹑涑水河泄洪不畅，全都开始泛滥。河南也担心三门峡水库一旦被冲决或漫决，自己首当其冲。三省联合向中央防汛指挥部施加压力: 山东已经被淹，多淹少淹只是程度问题，保未淹的地区不被淹更重要! 指挥部最终批准三门峡水库开闸泄洪。\n　　五千秒立方米的泄洪流量加入到下游洪水中，使山东拼死拼活刚刚要完成的堵口又一次被冲决。当夜，山东数名村民强渡黄河，在上游河南省长垣县石头庄堤段内，用九十公斤炸药炸开一条老串沟上的民□，使黄河主流改变方向，直扑河南省一侧堤段。加上南风大作，推波助澜，八月一日凌晨，河南省一侧决口。黄龙冲进河南境内，向北扑去。长垣﹑滑县﹑濮阳被淹。安阳被围。河北省也告急。山东方面则河水顿消，在最短时间内修复了高村决口。那几个强悍村民被当地百姓奉为英雄，披红挂彩。\n　　“改革开放”以来，从中央到地方各级政府的眼光都盯在“增长型”项目上，防洪投资持续减少，加上黄河连续十几年枯水，人们已经习惯忘记这个“中国之忧患”。大堤百孔千疮，獾﹑鼠繁殖。几天下来，除了决口处，全线大堤出现几千处裂陷﹑管涌，四面告急。\n　　八月二日，黄河支流伊河上游转成特大暴雨，八小时累计雨量四百五十二毫米。千百条沟壑同时暴发山洪，冲垮陆浑水库。一万七千秒立方米的巨大洪峰直扑黄河，使黄河总流量猛然涨至三万八千五百秒立方米，超过历史上所知的任何一次洪水。京广线铁路大桥顿时被冲垮五孔。洪峰一过郑州，便在南北两岸同时冲开二十八个口子。大水南至徐州，蚌埠，北至德州﹑天津，只在史书上见过的“洪水横流，尸漂四野”又一次重现。\n　　当石戈透过舷窗俯看变成泽国的华北平原时，绝望一重又一重压上心头。视察水灾的专机上每个人都沉着脸，但也许只有他最清楚下面的情景意味着什么。他的班子曾做过黄河水灾的预报分析。那个分析里不包括目前狂躁的政治动荡，不包括去年开始的经济危机，也没考虑升至三位数的通货膨胀率，社会模块已在计算器荧屏上现出无数断裂，接近发散。实际的水灾比理论上构造的大，除了要加上政治动荡，经济危机和脱□般的通货膨胀，还要加上那张轻飘飘的报纸。昨天的《解放军报》用特号字印出“爱国主义是立军之本”的社论标题。文中昂然提到: “卖国主义无论如何改头换面，也会被爱国主义的人民军队彻底粉碎”。虽然没有点名，可昨天是总书记从日本凯旋归来的日子。今日的工人日报﹑科技日报﹑北京日报相继转载《解放军报》这篇社论，人民日报﹑光明日报等却不予理睬。\n　　一处高坡上，许多难民仰面向飞机招手。坡顶用石头摆出“感谢恩人解放军”的大字。他们以为飞机都是军队的。在灾区最危难的时刻，军队终于开进灾区。几十万解放军浩浩荡荡，给灾区送进粮食医药﹑设备物资，开展大规模的救死扶伤，抢救财物，维持治安，筑坝堵口。\n　　灾区的百姓含泪感恩戴德，相比之下，就更加怨恨政府，怨恨那个刚从日本姗姗迟归的总书记。\n　　北京西山\n　　他握住王峰的手使劲摇了几下，有一种蚍蜉撼树的感觉。\n　　前导车通红的尾灯偶而在士兵之间的空隙中显露一下。陆浩然又瘦又小，平时坐自己的车，从不许警卫坐到前面遮挡视线。可在这辆装着隐蔽钢甲的军用车里，他被士兵的人墙紧紧围在中间。每个士兵都紧握武器注视窗外。王锋在电话里强调社会动荡，军队必须绝对保证自己客人的安全。\n　　陆浩然很少与军队之间有直接联系。下午秘书通报军委副秘书长王锋请求通话时他有点意外，尤其还是个通过保密机打来的的电话。王锋只说“主席”想见他，说得很客气，但明确指定在今晚九点十五分，没有询问他是否有空或是否同意。\n　　当然，他同意，而且为此取消了今晚在人民大会堂的一系列外事会见。\n　　细节是两方秘书安排的。见面要求绝对保密。他坐秘书的车从侧门出了中南海。在黑暗中靠到这辆等待已久的车旁。两个车门同时打开，他只迈一步就换了车。\n　　主席只当到军委第一副主席，四年前就退休了，一直住在西山养老，但如同在位的九年一样，他被军内始终不变地尊称为“主席”，即使是现任军委主席的中共总书记也不能让这个称呼转移到自己头上，尤其在高级将领中。\n　　总书记经营军队也有不少年了。“六四”之后，谁都能看出未来只能靠枪了。谁抓住军队，谁就抓住政权。一方面军队地位迅速上升，一方面又要把军队变成党的驯服工具。总书记在军内做了大量工作，也颇有成果。军事院校出身的中层军官对他都有好感，他的意图也大都能畅通无阻地贯彻，然而不能由此认为他就掌握了军队，只能说军队暂时把“自己”退到幕后。军队是最讲“自己”的，不会让一个外人进入核心，表面上一套法定的机制在周密运转，但那并不是真正的军队，只是一层外衣。军队的心脏在西山。\n　　陆浩然从公安部长处得知：近来每天都有各大军区的军用飞机载着将军们在南苑军用机场降落。他们直接被挂着军车牌照的“奔驰”牌轿车接到西山，呆上半天，又匆匆飞回。各总部各兵种首长也纷纷到西山谒见。中国最高级的轿车一时好象都集中到通往西山的僻静路上了。他预感军队正在筹划重大行动。解放军报的文章已表现出明确倾向。他不加犹豫地来见主席，正是因为他现在需要军队，而王锋的电话说明，军队此刻也需要他。\n　　刚登上国务院总理之位时，他即使不能压总书记一头，至少也旗鼓相当。他长期主管国民经济，在国务院系统有雄厚基础和广泛关系，逐渐成为坚持计划经济的代表人物，被几位元老看重，共同推举他出来治理八十年代改革留下的“市场后遗症”，同时也是给被国外称做“温和派”的总书记设下一个牵制。那时“老人家”的绝对权威尚能保持不同派系的平衡。自从“老人家”去见马克思，对立和冲突就日益激化。新的组合，新的阵线，新的交易，新的对比，每天都在纷纭变化。他从攻势变成守势，现在则是步步后退，眼看退到悬崖边上了。\n　　陆浩然总是奇怪自己为什么会被人称为“强硬派”。其实自己太软弱。他虽然主张政治上严厉控制，但是在经济发展和政治控制发生矛盾的时候，做为一个搞经济出身的专家，却总是迁就经济的需要而做政治上的退让。然而这二者似乎永远有矛盾，难道退无止境? 有一个逻辑是谁也玩不明白的: 只有政治安定经济才能发展，只有经济发展政治才能安定。这是多年的口号。字面看上去二者相辅相成，为了政治和经济同时又安定又发展，他做了那么多迁就。\n　　可终于回过味来，当经济原则和政治原则实际上互为悖论的时候，经济不发展政治不会安定，经济发展政治也不会安定，反之一样，政治安定经济不发展，政治不安定经济更不发展。然而“温和”的总书记已经利用怕乱和怕失民心的心理，占领了太多的阵地。现在他又要再玩一把火，企图用为“六四”翻案狠狠捞一把了。\n　　这是危险的一着，却也是很高的一着。陆浩然当然知道这位“温和”的总书记从不是个民主派，他冒这个险为的是他从中看到的可能收益: “六四”积淀的能量也许可以碫造成他手中的大棒，用来砸断“强硬派”的脊梁骨，这是他梦寐以求的。\n　　“六四”造成的问题不在于死了人，损失了财产或弄坏了国际关系，那些没什么了不起，关键在于从此失掉了一种心理结构的平衡。不管表面怎样气壮如牛，执政集团多数人内心深处都暗暗发虚。历史最终将怎样评说? “六四”之后的东欧变化更加深每人的疑问。然而那时有老一辈在上面顶着，这种心理失衡还能撑住。临到自己面对历史的时候，“强硬”的牌子就谁也不再愿意沾边。一个个藏头缩尾，原来的心理颓势很快演变成行为上的虚弱。总书记正是利用这一点。为“六四”翻案是先天属于“温和派”的专利，不谈其中无穷大的政治资本，仅仅激发一下早已倾斜的社会心理，至少在“六四”问题上，人人就全都洗刷自己，唯恐摘不干净。各级当权者拼命做出“温和”甚至“自由”的姿态，这种自下而上的连锁反应，怎能不使“强硬”派不战自败!\n　　其实陆浩然和总书记一样，当时都未进入核心决策圈，对“六四”镇压并无直接责任。然而不同的位置决定了他必然要采取相反立场。用中国官场一句俗话说──“屁股决定脑袋”。\n　　“强硬派”是靠“六四”压倒“自由派”的。就像当年一开枪，即使嘴上仍然喊改革，路线和班子都发生根本变化一样，如果“六四”翻了案，“强硬派”的路线﹑班子也就得完蛋，“温和派”就会把“强硬派”踩扁。\n　　一进入警卫森严的大院，立刻给陆浩然换了一辆最高级的“奔驰”轿车。风景秀丽的玉泉山三步一岗，五步一哨。汽车在曲折的幽径中转了半天，停在一座古树掩映的别墅之前。王锋已经等在门口。\n　　“陆总理，主席本想亲自拜访您，不巧患了感冒，请原谅。”王锋的微笑非常动人，牙齿雪白。\n　　“哪里，年轻的拜见年长的，这是天经地义……”陆浩然比主席年轻近三十岁，比王锋又年长近二十岁，他意识到在王锋面前说“年轻”二字不太合适。“我早想来感谢解放军对灾区的支持了。”他握住王锋的手使劲摇了几下，有一种蚍蜉撼树的感觉。\n　　王锋四十多岁，风华正茂，比他高一头，让他觉得像仰望一座挺拔山峰。那张英俊瘦长的脸上总是一副自信表情，肩膀宽宽，昂首挺胸，尽管夏夜炎热，一身合体的毛料军服却扣得严严实实。\n　　“我们该受批评，到晚了。”\n　　“哪里能这么说，这不怪你们。”\n　　比起以往救灾，这次军队赶到的时间确实晚了不少，然而声势却比哪次都大。到处都是调动的军队，公路﹑铁路﹑满天飞机，军用物资滚滚如河。半个中国都能从早到晚听见“三大纪律﹑八项注意”的行军歌声。晚归晚，这次军队获得的赞誉却比哪次都多，也最热烈。大部分灾区基层政府都已瘫痪甚至消失，全靠军队挑起了主要担子。今天受灾严重的河南﹑山东﹑河北﹑安徽﹑天津，加上受到影响的陕西﹑山西﹑内蒙，分别在各省市自己控制的报刊上发表文章，无限赞扬解放军慷慨无私的救援。同时，陆浩然特别注意，那些文章全都以不同形式不点名地攻击了南方几个富裕省“在全国帮助下富了自己，当国家危难时却袖手旁观”。\n　　这些北方省市彼此矛盾重重，对这个问题却出奇地口径一致，步调统一。耐人寻味的是，江苏虽然也是重灾省，却没有参与这场合唱。陆浩然对此只是旁观，对救灾工作也一直是表面急，心里松。这次黄河泛滥看似天灾，其实却是地地道道的人祸，是错误路线的恶果，他认为只有让恶果充分暴露才能让人们认识。\n　　王锋迈着军人步伐走在陆浩然旁边，不时做出礼貌手势。\n　　五年前就任国防科工委主任的时候，王锋曾是全国最年轻的中将。最近，刚任命他兼任中央军委副秘书长，听说他又将成为全国最年轻的上将。他们传说他并不为此满意，因为现行的军衔制到上将就到了顶头，从而使他永远不能赶上他已故的父亲──五十年代的中国元帅.\n　　“既然不想当元帅的兵不是好兵，没有元帅军衔也就不会再有好兵。”人们说这是他的话。\n　　穿过一间门厅，两条走廊，一个大会客厅，全都空空无人。在一扇黄色皮革包裹的门前，王锋握住把手对陆浩然说: “主席身体不适，医生只给五分钟。”陆浩然屏息凝气地点头。王锋轻轻推开门，做出请进手势。\n　　里面是个小会客厅。一个干瘪的老人端坐在正中沙发上。陆浩然不敢相信自己的眼睛。四年未在公开场合露面，主席的变化竟然如此大。过去那个高大魁梧的形像缩成一具木乃伊，变得又瘦又干。军服好似穿在衣架上。皮肤上一层层折皱。奇怪的是脸色倒显得很好，甚至称得上红光满面。陆浩然趋身问候，碰到那双遮蔽在白翳下的眼睛，不禁心里一抖。那双眼睛仍然射出往日的威严，直视人的心灵深处。\n　　主席只动了一下手指。\n　　“坐。”当年可比洪钟的声音如今苍老沙哑。\n　　这个房间除了沙发茶几和地毯，没有任何多余的摆设。最引人注目的是墙正中悬挂的毛泽东像。下面摆着一扇高大绣屏，那薄如蝉羽的纱绢上绣着龙飞凤舞的毛泽东手迹──《满江红》。\n　　这首词中国人当年曾很熟悉，即使现在瞥上一眼，全部句子也会一字不少地直扑心里:小小寰球，有几个苍蝇碰壁。嗡嗡叫，几声凄厉，几声抽泣。蚂蚁缘槐夸大国，蚍蜉撼树谈何易。正西风落叶下长安，飞鸣镝。\n　　多少事，从来急﹔天地转，光阴迫。一万年太久，只争朝夕。四海翻腾云水怒，五洲震荡风雷激。要扫除一切害人虫，全无敌。\n　　此时此刻，猛然重见这些已似遥远过去的诗句，不禁使人怦然心动。\n　　陆浩然只用半个屁股坐在主席对面的沙发上，两手相握夹在膝盖之间，前倾着身体。\n　　“我们第一次见。”主席说话很慢，“次”和“见”之间隔了好几秒。\n　　“但我了解你。”\n　　陆浩然使劲点点头。他曾很多次见过主席，握过手，说过话。那时他只是机电部长，计委主任一类的头衔，根本不会在主席脑子里留下印象。等他当上总理的时候，主席已经退隐西山不露面了。不过重要的是后面一句话。主席了解任何他想了解的人，然而此刻说出的了解，是一种接受和认可。\n　　“……我知道政治局常委中只有你一个人反对那个丧权辱国的协议，你拒绝以总理身份去日本签字。干得对，有骨气。什么‘经济合作区’，那是日本鬼子又一次占领东北嘛! ”主席的话仍然那么慢，苍老沙哑，但是在陆浩然耳朵里，却有雷霆万钧之势。“我也知道你五次要求召开政治局会议，提出旗帜鲜明地制止动乱，反击翻案风。你做了可贵的斗争，我们感谢你。”\n　　陆浩然不断点头，本想说一句“我辜负了老一辈的期望”，却没有说出来。眼睛在眼镜后面痒痒的，有点湿润。\n　　动乱是那个总书记一手挑起的，他却不时装出一副惊讶模样，又次次都置之不理。陆浩然下令抓的动乱分子全叫他放了。前几天借口陆浩然不执行常委多数会议，宣布由他自己以国家主席身份代行总理职权去日本签字，等于罢了陆浩然的官。连连失利使陆浩然心里积满郁闷，突然知道西山一直在关注和支持他，感动得全身发热。\n　　“那个二等兵忘乎所以了! ”主席脸上的纹路勾勒出一种天然轻蔑。\n　　一直听说军队高层将领私下把从未当过兵却当上军委主席的总书记称为“二等兵”，此刻亲耳听见，又是从主席嘴里说出，陆浩然不禁感到一阵由衷的快感。\n　　“我们不会答应，”那双威严的眼睛在眼皮的折皱里盯着他。“六四是一条界限，永远不许迈过，不管他是什么人! ”\n　　陆浩然凝重地望着主席。\n　　“我也不答应。”他的声音如发誓一般。\n　　主席看他一会儿，难以察觉地点点头，吐了一口气，闭上眼睛休息。他的两条手臂平平地放在沙发扶手上，两腿端端正正，全身始终纹丝不动。不知为什么，莫名其妙地总让人想起假人。这个长征时的红军团长，五十年代的陆军上将，在那些年代也许无足轻重，到“六四”就已是平暴的主要决策者，今天更是毛泽东时代顶天立地的最后一名旗手。\n　　王锋用手绢为主席擦掉嘴角流出的口水，体贴仔细，跟护士一样。\n　　主席当年是王锋父亲的老部下。眼看这“元老派”顶尖人物和“太子派”顶尖人物的默契，陆浩然有一种滋味复杂的感慨。这种血缘和情感上的联盟是自己永远无法得到的，这也是自己一到关键时刻就势单力孤的原因。\n　　主席再度睁开眼睛，已经没了刚才的光彩，仿佛这么一会儿就用光了所有力气，声音也低了一截，更加沙哑。\n　　“王锋是军队的全权代表。”\n　　那双暗淡的眼睛消失在眼皮折皱中。助听器导线沿着细软稀疏的白发无力地垂下。陆浩然不太清楚这句话全部意思是什么。是指王锋一会儿将代表军队与他详细讨论，还是指王锋以后就成为军队的化身呢? 主席没往下解释，谈话看来到此为止了。陆浩然悄悄起身。\n　　“军队，”主席最后一次睁开眼睛。“将支持你出任总书记。”"
		},
		{
			"post_id": 8,
			"title": "《黄祸》4",
			"date_published": 1460784667.042,
			"body": "　　东京银座区\n　　若想做一件不留下任何痕迹的事，最好还是避开系统，系统永远可能出现漏洞。\n\n---\n　　这次是他第七次来这里了。\n　　再来七次，他可能也弄不清这座地下迷宫的结构。到处都有暗道，密门，夹层。走在里面，只记得无数个拐弯和上上下下的小巧电梯，与上头地面那个震耳欲聋，灯红酒绿的世界相比，安静得有点让人不自在。\n　　这次穿和服的老板亲自为他引路，仅仅是因为他每次来都不啬金钱，还是因为今晚那个“少校”终将露面? \n　　沈迪的护照是新加坡的，腋下的手枪是德国的，可他的感觉却是道地中国式的。在那张肥肉成迭的笑脸上，他第一眼就感到老板今夜已把他当成了同路人。\n　　“请。”在最后一条暗道尽头，老板伸出胖嘟嘟的短手，尽最大可能弯了弯球一样的腰。\n　　一扇难以发现的门无声敞开。一个日本姑娘跪在门口向他行礼。姑娘身姿温顺谦恭，像个典型的日本传统女人，下身却光光的一丝不挂。柔弱的双腿在幽暗光线下如粉脂一般细腻光滑。\n　　这个房间沉迪以前从没进过。很大，几乎可以在里面追逐。矮矮的顶。整个房间没有直角，全被软材料包着。连冰箱﹑电视一类的设备也都改装成软表面。进屋就像钻进一个大被窝。\n　　加上那张能供五﹑六个人打滚的大床和满墙日本春宫画，散发出一种淫荡气息。\n　　老板拍一下巴掌。一个高个西方姑娘托着酒盘进来。她只穿一件紧包臀部的黑皮短裤和一双长筒黑皮靴。一对圆滚滚的乳房在齐胸的金发中甩动。她向沉迪挤挤眼睛，一甩头把波动的金发撩到背后。\n　　沈迪的模样讨人喜欢，不高不矮，不胖不瘦，皮肤滋润，穿著讲究。一个四十出头功成业就的东南亚富佬，对女人可是一棵哗哗做响的摇钱树。然而，沈迪对那对乳房和那双粉腿只说一句: “这里不需要人。”\n　　老板按下一个开关。对面一道帷幕徐徐移开，露出后面的玻璃墙。“请随意吩咐。”他把节目单小心地放在沉迪面前的茶几上。“祝你愉快，先生。”\n　　他领着两个姑娘退出。门无声关上。\n　　二十年前，沈迪刚开始出国执行任务的时候，这种场合曾使他长久地着迷。后来，什么都见过了，什么都尝过了，直到八年前，他的一个战友被传染上艾滋病，他从此再也不和外国女人发生性关系。无论那些老板怎么向他出示每个姑娘的体检证明，他也无动于衷。他惜身如玉，理智清醒，而且在他的档案里，每一任上司都写下同样的评语：意志坚强。\n　　他对着粉红色话筒随便念了节目单上一个编号，只当成是来这里少不了的程序。\n　　玻璃墙那边灯亮了，非常亮。一个夏威夷土人细致地表演怎样同时蹂躏两个日本姑娘。他们的每根毛发都清清楚楚。女人在褐色的身体下痛苦地蠕动。呻吟和喊叫在传声器里就像响在耳边。\n　　艾滋病逼迫全球色情业大规模改革。这种转变不但使色情业从困境中解脱，而且以超过以往的势头更加生机勃勃地发展。人肉体上淫的能力从来有限，精神的淫却无止境。如果肉体被恐惧束缚，那么精神的淫欲就更炽烈，消费能力也会更强。玻璃墙那边是一面镜子，看不见这边，有身份的人物会觉得安心。情人可以边看边身体力行。如果有兴致的话，一扇小门相通，尽可以过去近距离观赏，或是戴上胶膜手套动手。如果实在有愿望，也有保险套充足供应。\n　　沈迪已经来了六次，每次五万日元。花费公家的钱干这种事他当然没有意见。但无论是前六次还是这第七次，无论是轮奸﹑兽奸﹑脱衣舞﹑同性恋﹑施虐狂……什么都引不起他的兴致。他默默地来，默默地看，默默地付钱，默默地走。而在所有默默的过程中，他都在默默地等待。那个“少校”传来的信息就是让他来这里等待。他知道“少校”一定就在他身边，观察他﹑跟踪他，也许还用各种花样试探他，但始终不露面。\n　　沈迪懂得耐心是自己最可靠的帮手。迄今为止，他对“少校”知道的只是这个“少校”是自封的，他每杀十个人便给自己升一级。从“列兵”升到“少校”，起码四十条人命垫在他的肩章下了。对这个人，沈迪为空等了六次而满意。凡是不让他运用耐心的人和事都使他不安，尤其是这一次。\n　　玻璃那边一个女人被倒吊起来。另一个女人蜷缩在座椅上。褐色男人同时性交口交。野兽般的叫喊越来越悠长。\n　　沉迪调低传声器音量，用遥控器打开电视机。中国大使馆里的记者招待会还在进行。多数电视台都在进行现场报道。摄像机镜头全对准招待会的主人。那个熟悉的面孔神采飞扬，从头到尾谈笑风生。全世界都在关注北京近来日益扩展的动乱，他竟能悠然自得地在异国他乡开玩笑，跟记者东一句西一句卖弄外语，到底是胸有成竹还是忘乎所以?\n　　今天，日本各大报刊的头版头条都把上午签署的“建立中日经济合作区协议”称为“日中关系新纪元”。日本政府大加庆贺，中国方面也一片振奋。一年前，中日政府间关于这个协议的全面接触刚刚展开，沈迪就被总参情报局单方面指派调查“黑龙会”在这出戏里扮演的角色。历史上，“黑龙会”是日本一些狂热的扩张主义者为占领中国东北和俄国远东地区而成立的组织。传闻它现在仍然秘密存在，并已逐步进入日本的权力核心，形成了一个颇有能量的集团。所谓“中日经济合作区”的内容是把黑龙江省交给日本经营五十年。日本方面为中国偿还一千四百七十亿美元的外债欠款，每年向中国政府缴纳“经营税”，数额是现在黑龙江省年度上缴利税的两倍半，并且年递增20%。协议条文详列了防止日本进行掠夺性经营的细致规定和保护生态环境的严格限制。此刻交出去的黑龙江一片衰败萧条，地力枯竭，森林伐光，污染严重。而五十年后，中国将收回一个由日本资金﹑管理和技术建设起来的崭新的黑龙江。谁都说这对中国是再合算不过的交易。连日本最权威的研究机构算出的结果都是日本最终无利可图。但正是这点令人怀疑。一向精明从不吃亏的日本人对亏本买卖为何如此热衷呢? 日本的空间危机感一直很强。尤其在今天，几个小岛的领土对于世界第一流的经济大国实在是太狭小了。虽然它以震惊世界的方式在各个国家买了无数土地和工厂，但那种用日元砸向世界的钉子仅仅是经济扩张的继续，不能做为建立政治大国和军事大国的基础。“黑龙会”一直认为日本只有在大陆立足，才有民族生存和发展的前途。今天，一边是西伯利亚而另一边是中国大陆的黑龙江省会不会成为这个历史宿愿再次起步的踏板呢? 沈迪对上层的政治斗争不感兴趣，也不看重意识形态原则和民族主义一类的教条。他只按系统下达的命令办事。他知道自己的系统和电视机上这张脸是两股道上的车。如果他的调查有结果，那不会是为了提醒这张脸不要上当，而是说不定哪一刻就会冒着烟扔出的炸弹。调查进行得并不顺利，“黑龙会”似在暗夜的迷雾中若有若无，每次抓上去都只有空空的潮气。近来他刚刚发现一点端倪，却又突然给了他现在这个新任务。\n　　新任务不是来自情报局。情报局现在不知道，将来也永远不会知道。这是王锋直接召见他布置的。系统有能力有效率，但若想做一件不留下任何痕迹的事，最好还是避开系统。系统永远有可能出现漏洞。给他的任务就是寻找一个跟系统没有关系的局外人。“局外人”三个字太含蓄了。局外人有的是，而他要找的局外人必须擅长一种特殊的职业──杀人。\n　　沉迪同时看中国大使馆里的记者招待会和日本女人痉挛的白腿，却没放过脑后一丝轻轻飘动的风。他沉稳地回过头。\n　　门口站着一个瘦小的男人。\n　　那是个典型的东方人，黑头发﹑黄皮肤，凸起的颧骨，两只不大的眼睛，单眼皮。无论在东京﹑北京﹑曼谷﹑汉城或是新加坡，这样的形像都可以立刻消失在街头人群中，和成千上万相似的面孔混在一起。这一点正是沉迪需要的。眼前这人的年龄似乎有点年轻，不过仔细辨认，也可以看出眼角标志阅历的鱼尾纹在浅浅延伸。亚洲人的外貌和实际年龄往往相差很多，沉迪对此不甚奇怪，使他意外的是眼前这个形像如此文弱，挂在嘴角的笑容甚至显得□腆。\n　　当他奔波于世界都市间秘密物色对像时，那些大名鼎鼎的黑社会头目提起这个“少校”都有敬畏之色。但他对这个意外心里叫好。他喜欢外表不像杀手的杀手。\n　　“你好，‘少校’。”他用汉语说。自从跨出国境，这是他第一次说汉语。\n　　“你好。”\n　　只听这两个字，最后一点顾虑就消失了。一个人的汉语怎么样，两个字就足够了。这两个字的回答就像从北京街头得到的，那么平庸，平庸得地道。当“少校”微笑着再说一句汉语时，无论哪方面的信任度都更加提高。\n　　“我已经是‘中校’了。”\n　　沈迪不知道对这种晋升是否该表示祝贺，只做了个请坐的手势，关掉传声器。玻璃墙那边的男女变成无声电影一般虚飘。\n　　入座前，“中校”转动墙上一个旋钮。四壁的调光灯从暗变亮。从这一个动作就可以看出他对这儿相当熟悉。沉迪确信，一架或几架隐藏的自动摄像机已经开始工作。摄像机的开关也许就和灯的开关连在一起。沈迪没动声色。杀手为了保证不被“灭口”，或是干完活不至拿不到全数付款，总是要留些证据做为威慑。如果一切遵守协议，“证据”是绝不会被使用的。\n　　这是杀手行当的“职业道德”和“商业信誉”。何况，亮度提高了，自己的钮扣相机也可以得到更好的底片。\n　　“中校”很舒服地坐到他对面。“我怎么称呼你? ”\n　　“我们以军衔称呼好了，我是上校。”沈迪淡淡地咧咧嘴。\n　　“我应当起立吗? ”“中校”露出顽皮表情。\n　　“不必了，你是你那行的上将。”\n　　“不敢当，我只想干到少将就退休。”\n　　“很荣幸，我还没晚。”\n　　男人之间的寒喧顶多就那么几句。两个人沉默一会儿。“中校”摆弄他的手指。那手像女人的手一样纤细白嫩。天真无邪的眼睛似乎在等着听一段音乐或是什么童话故事。\n　　“人们说，当你出来见面的时候，就说明你同意做生意。”沉迪说得挺慢，有板有眼。“人们还说，只要价钱合适，你不会拒绝客户提出的任何目标，是不是这样? ”\n　　“你想杀谁呢? ”“中校”的表情似乎嫌沉迪转弯抹角。\n　　沈迪明白这个赤裸裸的“杀”是为了使花架后面或是气孔里面的摄像机记录下更明确的证据，不过在那张柔软的嘴里说出来，倒一点没有粗鲁的感觉。\n　　沈迪点上一支烟，深吸一口，似乎被正在电视上发生的场面所吸引。\n　　屏幕上，一个满头大汗刚到场的日本记者抢下话筒大声提问，其中关键的一句是在他看了一下表之后所说的──十五分钟前中国黄河发生大决口。这是个出风头的表演。记者招待会已经开了一个多小时，主人肯定无法知道十五分钟前的事。但若是连这位主人都不知道，公布这条新闻的通讯社就会在电视观众心中留下深刻印象。主人却相应留下一个羞辱。记者话音刚落，翻译还没开口，一个剃着光头的中方人员便把一张字条递到主人面前。看得出主人完全按着字条回答这个问题。分明光头已经先得到黄河决口的消息，又不好中途打扰主人，便做好了防备记者突然袭击的准备。虽然只是一句“决口我们就把它堵上”，却恰到好处，足够了。只要没张口结舌，主人就不失面子。沈迪对那个只露一下就消失了的光头印象颇深。\n　　以往从未在这种场合见过光头，更主要的还在于：这光头是一个标志，拥有这样机敏属下的主人不会仅仅是个“过渡人物”。大概也可以由此得到解释吧，为何非得对他采取现在这种手段。\n　　“认识他吗? ”沈迪指一下变成特写的那张面孔。闪光灯在上面闪成一片。\n　　“中校”的声音淡得像一股青烟。\n　　“中国共产党总书记。”"
		},
		{
			"post_id": 7,
			"title": "《黄祸》3",
			"date_published": 1460733593.823,
			"body": "　　楼里满地是纸，弥漫呛人的烟味﹑汗味﹑厕所味，所有的嗓门都提到最高，混乱到极点。押送者甚至不知道该把石戈交到哪，便让他双手抱头，蹲在楼道角落里。那已经蹲了好几个人。\n\n---\n　　满地废纸，石戈脚边正好扔着一本过期的《掏大粪》。那是眼下北京最流行的一份民间刊物。\n　　自从它在最新一期注销“民主阵线”的头头在国外与妓女鬼混的性照片，销量又猛增一倍。\n　　这份名称不雅的刊物以揭露丑闻为宗旨，起初矛头对准高官和权贵，最近也卷入了“人阵”和“民阵”的内斗。现在，民间的各种政治组织大都以这两个阵线划分立场。刚刚红火了没几天的民主运动日益滑向分裂和敌对。\n　　一九八九年六月四日中共对民主运动的镇压导致了一个“六四结”。那以后的中国政治始终离不开这个“结”。它对某些人是甩不脱的阴影，对某些人是期待中的资本，对某些人又是锋利的双刃剑。这个“结”已是化不开抹不掉的，迟早要摊牌。随着政治元老相继过世，翻案呼声越来越高。当局采取了一种宽容姿态，虽未公开宣布平反，却不太限制有关的政治活动，对以往的大忌──非法组织﹑非法游行﹑非法出版物等也睁一眼闭一眼，而且释放了仍在监狱服刑的“六四暴徒”，允许“六四流亡者”组织的“中国民主阵线”回国，做出了一系列极不寻常的让步。外界压力一小，翻案运动立即扩展，民主派内部也很快势成水火。“人民阵线”的领导人被称为“国内派”。他们六四之后大部分曾被捕受刑，又被关押多年，吃了不少苦。他们认为被称为“留洋派”的“民主阵线”领导人当初暗藏退路，裹挟运动经费，跑到国外出风头，拿“绿卡”，名利双收，享受奢侈生活，把世界对中国民主运动的同情全归为已有，现在又忙不迭地跑回来摘桃，盛气凌人，以当然领袖自居。中国不需要这批挟洋自重脱离中国实际的投机家和新贵族。“人阵”在工人和市民中很有基础，而“民阵”多年活动于国际舞台，已经成为中国民主运动的象征，财力雄厚，声名显赫，文化素质高，有电台报纸等多种宣传渠道，在知识分子和青年学生中影响广泛。“民阵”认为“人阵”缺乏理论，目光短浅，不了解世界潮流，更未曾亲身体会过民主制度，不可能完成改造中国的重任。\n　　两个阵线开始还是在纲领策略上争论，很快就上升到人身攻击。《掏大粪》登性照片，“民阵”刊物则把“人阵”领导人当年被捕后写的“认罪书”和口供全文刊载，公布由于他们的出卖而受牵连者的名单。\n　　楼门大厅的喧嚣突然升高，听上去殴打尖叫和哭诉混成一团。一个在“六四”之后向戒严部队做过举报的居民委员会主任被群众游街送到这里。当年被举报的人早已处决，埋在亲人心中的深仇大恨却一点不被时间磨损。哭诉的妻子要把奸细的舌头拔掉。奸细的女儿跪着向群众求饶。有人在鼓动拿奸细抵命。这种场面近来随处可见。今天下午的“情况通报”统计上来的被群众私刑处死的人已达十三名。虽然看不见，石戈却能清楚地想见门厅中每一个情景。\n　　给他印象最深的是其中一个女人的声音。在一片仇恨的叫嚣中，那个声音温和但是坚定地说服群众，阻止他们的疯狂，保护奸细不被伤害。他想象那女人应该很美，至少使多数男人有好感，因为她能让他们冷静下来，最终听从了她。\n　　“这些人怎么了? ”那女人走到身后。不知是幻觉还是真的，石戈感到这声音有点熟悉。一缕清淡的香味混在雷雨中飘来，挺好闻。\n　　“都是群众扭送来的，还没来得及审查。”听上去陪同者对她十分尊重。\n　　“你们是不是准备自立法庭? ”\n　　“……我们不好打击群众积极性。”\n　　“我以为不应当是群众带着你们，而是你们引导群众。”\n　　陪同者没回答。\n　　“至少别让他们用这种姿势。……这个人怎么全身是血? ”\n　　石戈被允许站起来。蹲得太久，脚麻得站不住，女人伸出手扶他。她果然很美，不是那种无可挑剔因而会显得骄横的美，却更能吸引人的目光，让人内心自然流出温柔的感应，如同她的美属于每个人。她也许超过三十岁了，看上去要年轻得多。长发微微弯曲垂在胸前，一双大眼睛有点朦胧和忧郁，看不出化妆的痕迹，也没有装饰品。淡绿色的丝绸衬衫下摆系在腰间，裤子是墨绿的，朴素，恬淡，唯一给人压迫感的是她有点高。他瞄了一眼她的鞋跟，很平。\n　　他觉得不仅声音熟悉，样子似惚也见过。\n　　她也仔细端详石戈: “如果您不是在这，不是身上有这么多血，我会把您认成另外一个叫石戈的人。”\n　　“叫石戈的不是另外一个人，身上有血而且正好就在这。”\n　　“我叫陈盼。”\n　　石戈没想起来。\n　　“我在沧州找过您，为欧阳中华被捕的事。”\n　　欧阳中华的女秘书! 她那时罩在核防护服里，大半个脸挡着防毒面具。他当时没兴趣注意她。\n　　公安部门介绍她除了当秘书还兼任欧阳中华的情人。他从来讨厌这种混合角色。但他答应了她的请求，说服公安部门释放了欧阳中华。不管怎么样，核电站事故造成了巨大损害，领导当地居民示威不能算犯罪。\n　　欧阳中华是个大名鼎鼎的人物，写过好几本轰动全国的书，又是中国绿色拯救协会的主要领导人。“六四”以后的政治严控时期，这个表面上以生态和环境保护为宗旨的组织成了国内唯一能与政府发出不同声音的来源。他们总是曲踞在不让政府撕破脸皮的边缘，从而保持生存并逐步有了全国性影响，受到国际瞩目。前年的全球绿色和平奖就被授予欧阳中华。\n　　绿色拯救协会在最近的政治大潮中只扮演了一个温和角色。除了宣布支持为“六四”事件平反以外，没做任何引人注目的举动，毫不介意风头被后起者抢尽，只在两个阵线冲突愈演愈烈时才出面充当了调和者。“绿协”的威望受到各方面尊重。刚才石戈就听见满楼人欢呼欧阳中华到来。\n　　“我在后来的一份报告上看到，”石戈对陈盼说。“你从公安局把欧阳中华接出去时，他对欠了我这种人的情很不乐意，当场说过他会按同样方式还账，现在正是机会。”\n　　陈盼笑了。\n　　“他一定很乐意。”\n　　陈盼离开不久，便有人把石戈带进三楼会议室。石戈马上断定坐在邢拓宇旁边的就是欧阳中华。一见面就能理解为什么传闻这个人拥有大批女性崇拜者。他有芭蕾舞王子那种脸型，既有艺术家的潇洒，又有极其冷静坚毅的气质，三十五﹑六的年龄，精心的保养和锻炼使修长身材仍保持少年一般舒展匀称，配上质地高级的进口服装，把身边人全衬得黯然失色。\n　　在场的男人只有邢拓宇跟他还算旗鼓相当。虽然这位“人阵”的一号人物个不高，一脸伤疤，头发乱蓬蓬，看上去比欧阳中华老得多，却全身放射一种力量，让人感到燃烧的激情和不屈不挠的意志，是个能压倒一切的男子汉。他在八九年民主运动中是工人纠察队队长，被捕后受尽折磨，然而始终坚贞不屈。“民阵”宣扬“人阵”领导人在狱中叛卖，唯独找不到他的污点。这使得“人阵”把他从较后名次推为一号人物，并大力宣传他，使他成为群众中有口皆碑的英雄。\n　　邢拓宇盯着石戈。屋里人也全都一言不发，象看一个怪物。没人让他坐，使他有面对法庭的感觉。他很累，两条腿感到身体重极了，身上脸上都有抢救时沾的血迹，衣服皱巴巴，一副惨兮兮的模样。\n　　“我可以走了吗? ”他问。\n　　邢拓宇仍是半天没说话。\n　　“可以，”他终于开口。“我正想见一见你是什么模样，没想到你能自己送上门来。”\n　　“不是我自己……”\n　　“行啦，我已经看够你了。”邢拓宇打断石戈有气无力的声音。“放你走以前，有两句话。第一句，刚才那根钢丝砍掉了十六个民主战士的头，而‘百字宪法社’是要砍掉整个民主运动的头，我相信你跟钢丝没关系，但你是‘百字宪法社’的幕后操纵者，你能否认这一点吗? ”\n　　石戈没做声。他知道否认也没有用，没有确凿的消息来源，邢拓宇是不会凭空向他提出这种问题的。\n　　在形形色色各竖一旗的民间政治组织中，“百字宪法社”被所有组织视为共同敌人。连“人阵”“民阵”这样激烈对立的派系，对“百字宪法社”的态度也完全一致。这个组织专门攻击民主运动和民主制度。它从不上街，全部宣传都通过印刷品。成吨成吨的小册子和一份发行量很大的小报，散发到每一个角落，影响极广。与以往官方反对民主的宣传不一样，它的观点既有理论水平，又生动引人，有说服力，紧紧抓住一般群众求安定怕动乱的心理，所以尽管不见其面，这个组织却争取到相当数量的群众，使他们远离轰轰烈烈的运动。许多人想查清它的内幕。它不搞募捐，无人赞助，却能进行这样大量的印刷和成本高昂的传播。它的办公处狭小冷清，门可罗雀，只有几个守口如瓶无所事事的工作人员，却能进行如此有效的组织和运转。它的理论文章出笼速度跟印刷机那么快，不经长时间的推敲不可能达到那么高的质量，说明它肯定早就在做准备，而且班子规模必定很大。这个“百字宪法社”宣称: 在适当时候，它将公布一个只由一百字构成的宪法，依据这一百个字可以建立一个全新社会。\n　　它不断渲染所谓的“百字宪法”，又不公布内容，不少人因此产生兴趣和期待。“百字宪法社”\n　　自己解释只有先通过对民主制的批判让人们丢掉幻想，放弃对民主制的盲目追求，才到适于公布“百字宪法”的时机。但民主阵营一致认为这只是幌子，一味攻击民主过于赤裸，它有必要打出一个耸人听闻的旗号，真正目的只在于为破坏民主运动做挡箭牌。不少人认为它是当局的特务组织。难怪屋里的人们都要用那种眼光看石戈。\n　　“第二句，转告你的主子，他那一套在开明旗号下搞的诡计我们全清楚。你们当年派女特务在国外勾引流亡者，现在把那时偷拍下的照片捅给人阵，同时又把人阵领导人当年在狱中的口供提供给民阵刊物，让我们互相搞臭，让人民厌恶我们，而你们坐等渔利。今晚的钢丝事件也肯定是你们制造的，你们的特务此时正在到处散布谣言，企图挑起两派的武斗，给你们镇压的借口……”\n　　石戈仍然没说话，但他的心里知道邢拓宇说得不假。虽然他并没有参与任何一件，也不确切地知道什么，然而对他来讲，这种小伎俩无论遮掩得怎样巧妙，都是一眼就能看透的。\n　　“……告诉你的主子，你们不会得逞! 这笔债记在你们头上，血债要用血来还，还帐的日子马上就到! ”邢拓宇是个受过太多折磨的人，又刚刚被街上那满地人头所刺激，眼光里充满仇恨。\n　　“现在，你可以滚了! ”\n　　欧阳中华不引人注意地对石戈晃了一下食指，像是表明了账了。\n　　“还我出入证。”石戈说。\n　　邢拓宇愣了一下。\n　　“你倒是忘不了你的狗牌儿! ”\n　　“如果我带不回这个牌儿，中央警卫局会搜遍这栋楼。”他的口气很温和。\n　　“威胁吗? ”\n　　“不是。”\n　　邢拓宇轻蔑地盯他一会儿，挥了一下手。“给他找! ”\n　　尽管邢拓宇是个极端激烈的人，石戈在他面前并不为安全担心。即使没有欧阳中华的“还账”，自己也不会遭扣留。身为一个组织的负责人，哪怕稍有一点理性，也会知道扣留政府官员会惹来什么麻烦，那和扣留一个无声无息的老百姓完全不一样。但他往外走的时候，面对的却是激愤而全然不考虑后果的普通民阵成员。在楼梯上他还只受到推搡，这么一会儿似乎全楼都知道了他是“百字宪法社”的“黑后台”。在二楼，一个嘴喷酒气的女人连抓带挠地剪掉了他一大块头发。这形像可怎么站在总书记访问日本的随员行列里? 从二楼到一楼他几乎是沿着楼梯滚下来的，只觉得上下左右全是拳头和脚，他护住要害部位，挺住身子不让自己倒下去，免得被人群踩扁。\n　　然而拳头和脚停住了，陈盼站在他面前。她头发乱了，衣服皱了，胸脯上下起伏。\n　　他对着门上玻璃看看自己，嘴角破裂，鼻血流淌，右半个脑袋露出头皮。给他剪头的女人说奸细就要剃“阴阳头”他用手梳理一下左半边头发，好象刚从理发馆的椅子上站起来。从玻璃中，他看到陈盼在背后注视他。灯光下，她被撕开的领口里皮肤雪白，跟门外的黑夜对比，不知为何让人难忘。\n　　他没回头，径直走出“人阵”总部，没入一阵紧似一阵的风雨之中。"
		},
		{
			"post_id": 6,
			"title": "《黄祸》2",
			"date_published": 1460732602.069,
			"body": "　　北京\n　　一九八九年六月四日，中共军队在北京对民主运动进行的镇压形成了一个“六四结”，从那以后，中国的政治始终离不开这个结。\n　　石戈活了近五十年，虽没有经历过战争，也算见过不少死人，但即便是当年的“六四”屠杀，他也未曾面对过令人如此毛骨悚然的场面。\n\n---\n卡车货厢上站立的人竟然没有头! 全部没有! 齐刷刷地一样高! 唯有从一片脖腔里喷出的血高度不一，在第二辆卡车的车灯照耀下红艳艳地跳动。\n　　两辆卡车之间的柏油路上，滚动着散乱的人头。刚砸在他自行车前轮上的那一颗披散长发呲着牙，写在额上的“翻案”二字好象第二对眼睛。血腥气铺天盖地弥漫，冲进肺腑。\n　　一道刺耳的嗡鸣在没开路灯的街道上方扩散，如同在给这个恐怖画面伴奏。那是一根高强度钢丝，横拉在街道上方，绷得紧紧，正好和站在卡车上的人的脖子高度差不多，对着飞驰的卡车，便相当于迎头挥来的砍刀。\n　　据说最锋利的刀在最有腕力的刽子手里，可以砍掉人头而人身不倒，眼前这道钢丝不但超过世上任何刽子手，而且一喝完血便嗡嗡地唱起来。第二辆卡车好歹停得及时，钢丝离车上人的脖子只差几尺。\n　　石戈第一个开始动作，虽然感觉还是像在噩梦里，可本能使他挺身指挥在场的人们进行抢救。\n　　两辆卡车都是“人民阵线”赶去增援天安门广场的，还活着的人全吓傻了，得对他们吼着喊着才有反应。\n　　电视转播车倒比警察来得还快。尽管已是半夜一点，四面还是很快围满了人。街两侧的窗子也纷纷亮灯，伸出脑袋。看见新闻灯左一个右一个打亮。石戈缩回手，准备悄悄撤出现场。\n　　粘在手上的凝血在手心蠕动。\n　　围观人群热闹地议论着。有人说一定是“民主阵线”拉的钢丝，目的是阻挡“人民阵线”的增援队伍。此时两个阵线正在天安门广场抢夺人民英雄纪念碑，谁能占住纪念碑，谁就能成为八九年天安门运动的象征，也就可以成为眼下这场澎湃而起的翻案运动的主导者。电视台记者非常热心地把这个传言收进话筒，到处寻找可能提供证据的人。\n　　石戈就是在从天安门广场回家的路上碰见这事的，本想在出国之前再看看那儿的情况，结果自行车被汹涌的人潮踩变了形，只能推着走。\n　　“这爷们儿离得最近! ”几个光脊梁小伙儿指住石戈。\n　　灯光和摄像机随即转向石戈。“老师傅，请谈谈你看到的情况。”记者立刻盯上来。\n　　石戈闪开脸，用后脑勺对着摄像机。他怕的就是这种尴尬的场面，可偏偏没躲过去。他只是含糊地摆手，想尽快脱身。\n　　“哎，爷们儿，”光脊梁小伙儿拉住他。“跑什么呀? ”\n　　人们里三层外三层围上来。七月雷雨前的闷热把汗味和血腥味混在一起。石戈矮胖的身子像是被埋在人群中，头发稀疏的额头淌着汗，始终转来转去用后脑勺对着镜头。记者连珠炮似的问题似乎都是中性的，可在石戈耳中，却能清楚地听出其中的挑唆味道。他是内幕中人，知道新闻界被某种旨意操纵，正在充当诱导事态发展的工具。当这种血淋淋的场面在电视上播出，只要稍微暗示一下，就会让多数观众认定此事是“民主阵线”干的。不难想象，两派本已不共戴天的局面会怎样火上浇油，而群众又会对眼下的民主运动增添几分厌恶。这些是他无法左右的，但若一会儿就会播放的电视画面里有身上手上都是血的他，他便很难解释清楚了。\n　　一个当贼准是好手的瘦高个小伙儿趁石戈不备，猛夹出他胸前小兜里的硬皮证件。“我来替你回答。”\n　　石戈想抢回来，可小伙儿个那么高，举在手中，他就是跳起来也够不着。“出入证……”小伙把证件转向新闻灯仔细辨认。“中……”他突然叫起来︰“中共中央办公厅的章! ”\n　　人群愕然，这个看上去再普通不过的矮个子怎么会跟中共中央有关系?\n　　电视台记者却立刻不问了，摄像机和新闻灯也不声响地转移。石戈知道上镜头的麻烦没有了，可新的麻烦却更难摆脱。电视台是党的工具，不敢惹跟“中央”沾边的人，而周围这些人却正好相反，与“中央”有关只能引起他们的戒心和敌视。他这回不敢再含混，置身这种场合，任何差错都可能使群众把愤怒发泄在他身上。面对四周越来越严厉的盘问，他拼命解释他是过路的，只不过恰好在钢丝下面修了一会儿自行车。可他既然是个能够出入中央的人，却是一副下夜班工人的打扮，不但不坐小汽车，连自行车都这么破，半夜三更正好停留在出事现场，有想象能力的人立刻就能把他想象成是特务﹑便衣警察或奸细一类的角色，正在执行特殊任务，说不定那根钢丝就是他拉的呢。\n　　“我是炊事员，”他只好信口胡说了。“中央也得有做饭的嘛。”他解释不清自己为什么没有“官儿样”，也不会有人信他解释。此时唯一能做的就是拖时间，等着警察尽快赶到。这种群众私自审问的场合眼下北京到处可见，几乎没有哪个被审者最后不落个皮开肉绽。\n　　但警察的动作异呼寻常地缓慢。风驰电掣般地开来了一队“人民阵线”的汽车。刚才石戈指挥抢救时做的第一件事就是派人给警方打电话，可直到现在仍然听不见有警车的声音。他由此几乎可以断定，那根钢丝并非一根简单的钢丝，它所通之处是能够指挥警察的，甚至也能指挥新闻界。电视转播车赶来快得反常，警察的动作又慢得反常。如果警察赶到得早，现场就要按规程封锁，电视镜头就难以那样贴近地渲染，“人民阵线”指挥部人员也就不能深入现场，受到那么大刺激，甚至当场就疯狂地要去向“民主阵线”讨还血债。\n　　“审问者”们把石戈扔在一边，全去看新的热闹。一个三十多岁的男人高声命令“人阵”成员冷静，并且警告电视记者不要用这种场面恐吓人民，让人民远离民主运动。“这是阴谋! ”\n　　他声音嘶哑地喊着。“为的是挑起人阵和民阵的武斗，让民主运动自相残杀，我们不能上当! ……”\n　　他叫邢拓宇，是人民阵线的总指挥，眼下民主运动最显赫的人物之一。多数报道﹑包括石戈看过的内部材料都把他描绘成一个冲动型人物，真实的他看来还是粗中有细。石戈没有多听下去，他知道自己最好还是趁这个机会脱身，不过必须先要回出入证，凭那个可以进到中南海核心区域，丢了可不是小事。然而这无疑是自投罗网，拿走出入证的小伙儿揪着他连同出入证一块交给了“人阵”的纠察队员。“这老家伙特可疑! ”\n　　当石戈如同一个麻袋被塞进吉普车里，才听见大批警车赶到。吉普车根本不理会警车命令在场车辆接受询问的广播，开足马力扬长而去。\n　　“人民阵线”总部设在一座临街大楼里，从上到下灯火通明。老远就听得见高音喇叭慷慨激昂。楼外贴满印刷品。楼顶垂下的竖幅标语随风翻卷舞动。无数面旗帜扑扑喇喇。\n　　吉普车刚一停下，憋了好久的雨随着一声霹雳倾盆而下。聚在楼外的人蜂拥般挤进楼里躲雨。"
		},
		{
			"post_id": 5,
			"title": "《黄祸》1",
			"date_published": 1460732403.109,
			"body": "　　地球\n　　人在努力营造一个大千世界。\n　　它很小，一半向着光闪闪的太阳，一半向着遥远的恒星。它像一个橙子，橙皮上起伏着山川河流，在没边没沿黑呼呼的宇宙中没着没落地旋转。\n\n---\n　　在这颗橙子亮面与暗面相交的边缘上，太平洋中一头灰鲸玻璃般的眼球射进清晨第一束阳光。它仰浮的躯体被石油和有毒物质所腐烂，最后一丝知觉正沿着阳光去追溯往昔的海洋。\n　　琥珀色赤潮汹涌地覆盖着无际的洋面。\n　　与鲸鱼相对，橙子的另一侧明暗相交处，落日余光正把尼罗河干涸河床上蠕动的饥民照得如同鬼影。大风卷起干燥热土。爬行的沙漠早已掩埋古老光荣。人的脸上只剩盐碱﹑沙粒和一层层剥落的皮肤。\n　　美洲在太阳照亮的一面，倾斜地躺在大洋上。美国被高温和衰退折磨，百业萧条，艾滋病医院却肥皂泡般咕噜噜地越涌越多。突如其来的暴风雪把吊在圣地亚哥街灯上的政变者尸体吹得摇摇摆摆。巴西淘金者的推土机正在铲平亚马逊平原最后一片雨林。加拿大被韩国新一轮贸易攻势搅得举国不宁，政府倒台。而中美洲的将军们又开始乐此不疲地策划第七十八次政变。\n　　背着太阳的一面，白沙瓦的毛拉在清真寺顶高亢地号召穆斯林们奔赴克什米尔战场。一颗定时炸弹把科伦坡的印度使馆炸得血肉横飞。俄国科学家面对温室效应融化南极冰层的试验结果目瞪口呆。上百名枪手护卫的贩毒马帮正趁夜色从缅甸闯进云南。伊朗秘密部队加紧部署核武器。两架巨型客机在悉尼机场上空撞成火团。同一时刻，一个日本破产者与妻子儿女拥抱在一起从东京的摩天楼顶飞身跃下。\n　　而在苏门答腊岛的赤道线上，耸入云霄的钻塔正在夜以继日地轰鸣。这项美国﹑德国和日本合伙投资的研究项目打算把地球钻透一个眼儿。一个男孩听说眼儿的那头将是哥伦比亚，思考着问: 等真把地球钻透的那天，他朝眼儿里撒尿，会不会尿到哥伦比亚人的脑袋上? 他的伙伴一个比他大点的女孩博学地纠正，不会尿到脑袋上，只会尿到两腿之间的“小洞”里。\n　　他们兴奋地得出结论: 两头可以对着尿!\n　　这就是人的星球。它很小，射出织密的纤细电波，环绕着微粒般的人造飞行器，发出蝇蝇嘈杂。可人在努力营造着一个大千世界，索要这颗橙子从橙皮到橙核的一切。有时人觉得它很大，很大。"
		},
		{
			"post_id": 2,
			"title": "《黄祸》简介",
			"date_published": 1460728681.265,
			"body": "&#160; &#160; &#160; &#160;一九九一年出版的《黄祸》被评论界称为极具政治性前瞻性的「政治预言小说」。该书以八九年北京发生流血的「六四事件」，形成无法解开的「六四结」为启端，以对中国社会政治矛盾交织的独特分析为脉络，预示台海两岸冲突走上核子战争，虚构出中国政治势力互相倾轧、国家崩溃、道德沦亡、社会失控、人民大规模外流、「黄祸」危及全球、世界陷入绝境的恐怖情景。作者称该书焦点不在政治，绝无「穷国沙文主义」之意，只想展现一个「中国一旦崩溃，『黄祸』会涌向世界」的事实。\n\n---\n\n**故事梗概**\n\n　　作为处理危机的专家﹐石戈长期在中国政治高层充当“智囊”。在表面的繁荣之下﹐人口爆炸﹑资源枯竭﹑人欲贪婪而且争斗不休的中国社会已是步步危机。他深感无力回天﹐不从追求无限增长之路回头﹐中国迟早将面临崩溃。\n　　急于摆脱困境的中共总书记为了争取民心和西方支持﹐以赢得党内斗争﹐打出了为1989年民主运动翻案的牌。以王锋为代表的军方势力和中共强硬派早对社会动乱和政府无能不满﹐更不容翻案﹐雇佣外国杀手暗杀了总书记﹐接管了政权﹐使中国从改革路线退回全面法西斯化。石戈在各方势力的平衡中﹐当上了没有实权的副总理。\n　　在福建副省长黄士可的带动下﹐经济相对自由发达的东南沿海诸省为维护自身利益宣告实行“一国多制”﹐脱离北京独立。北京政权举行南伐﹐爆发南北战争。\n　　一艘在绝密状态下制造的新型导弹核潜艇下海。艇长丁大海直接听从王锋个人指挥。艇上的40枚核弹头成为王锋手上一张无人知晓的王牌。\n　　由于北方的军事优势和重工业势力﹐南方节节败退﹐注定难逃败局。在福州将被攻克的前夜﹐以美人计成为黄士可情人的台湾女特工百灵促使黄向台湾求援。早为“反攻大陆”做好准备的台湾军队迅即登陆﹐形势逆转﹐内地各省纷纷响应﹐台军长驱直入﹐兵临北京。\n　　在别无选择的生死关头﹐王锋促使中共党政要员一致同意发射核弹摧毁台北。唯一的反对者石戈逃进澳大利亚使馆﹐试图通知台湾﹐但未能成功。台北被摧毁﹐台军攻势瓦解﹐北京重新控制局面。\n　　台湾军队发誓复仇﹐高价购买核武器﹐并派出突击队抢占大陆核基地。南军指挥官李克明不忍北京毁灭﹐在最后一刻打死了他深爱的百灵。占领其它核基地的台湾突击队发射的核导弹出现偏航﹐落在俄罗斯境内爆炸。中国内战逐渐转变成丧失理智的核滥炸。为了保证国际和平与安全﹐在联合国主持下﹐以美国和俄国为主的核大国联合行动﹐以核武器摧毁了全部中国核基地与核武器。\n　　只有王锋知道丁大海的潜艇仍然深藏在海底。在被联合国部队逮捕前﹐他把潜艇官兵家属全部死于美国核弹的电文发了出去。\n　　石戈被推为中国新政府的首脑。在内战﹑自然灾害﹑国际核打击等多重因素作用下﹐中国社会和经济全面崩溃。挽救十三亿中国人的生命成了石戈及其政府的使命。他用高超的政治手段尽多获得国际援助﹐委派绿色组织建立生存基地﹐推广女农学家陈盼培植的基因作物薯瓜﹐同时实行他研究以久的新兴社会制度逐级递选制。\n　　他深知仅靠资源耗尽﹑生态彻底破坏的中国土地绝无维持十三亿生命的可能。难民已经开始自发地突破国境。他领导的中国政府实行了一个秘密计划﹐因势利导﹐组织起人类历史上一场空前的民族大迁移。中国难民从中俄边境突入西伯利亚﹐沿古丝绸之路进入欧洲﹐乘船横跨大洋驶向北美和澳洲。近十亿中国人铺天盖地走向世界。巧妙的外交使穷国让路﹐而富国纵有强大军力﹐在无边无际赤手空拳的难民面前却一筹莫展。\n　　受害最大的首当与中国接壤的俄国。美国以太平洋为屏障﹐乐于看到因民族主义崛起而重具威胁性的俄国被中国难民削弱。石戈利用俄美矛盾﹐秘密会见俄国总统﹐说服其同意开放远东港口﹐提供船队﹐将中国难民送往美国。美国为了保护自己﹐对俄国远东海域实行军事封锁。美俄封锁和反封锁的战争就此展开。\n　　石戈发现了中国核潜艇的线索﹐但为时已晚。充满复仇意志的丁大海抓住美俄冲突最恰当的时机﹐将40枚核弹头打向美国﹐使美国误以为来自俄国﹐仓促对俄进行全面核打击﹐引起俄国全面反击﹐核大战爆发。\n　　核冬天降临﹐全球农作物面临绝收。各国为了挽救自己﹐纷纷出兵抢夺资源﹐混战一团。不同的社会﹑政府﹑边界纷纷崩溃﹐饥饿﹑仇杀和死亡成为全人类的共同处境。但是在工业社会和物质主义全面毁灭的巨大代价之上﹐一种新型社会和生活方式开始萌芽﹐也许那就是一个以毁灭换来的转折。\n　　石戈离开空无一人的北京﹐走遍天涯海角去寻找陈盼。"
		}
	]
}