{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1,
			"title": "R.I.C : Referendum D'Initiative Citoyenne",
			"body": "Pour ou contre et pourquoi? Que pensez-vous de la democratie directe? \n\nIl existe plusieurs types de referendum. \n\na. le referendum legislatif qui permet aux citoyens de soumettre une proposition de loi au parlement ou directement au peuple.\n\nb. le referendum abrogatoire permettant aux citoyens d'annuler une loi du parlement.\n\nc. le referendum revocatoire qui autorise les citoyens de revoquer un elu ou un agent public.\n\nd. le referendum constitutionnel pour modifier la constitution.\n\ne. le referendum financier autorisant le peuple a voter sur certaines depenses.\n\nA votre avis, il y a-t'il une chance que ces possibilites democratiques soient un jour disponible au peuple francais? \n\nAu plaisir de vous lire.\n\n$fallfield$",
			"added": 1588411449
		},
		{
			"topic_id": 2,
			"title": "Quelles sont vos sources d'informations francophones?",
			"body": "",
			"added": 1588656350
		},
		{
			"topic_id": 3,
			"title": "Les cryptomonnaies...",
			"body": "Bitcoin, blockchains alternatives...  ",
			"added": 1588785523
		},
		{
			"topic_id": 4,
			"title": "Vos solutions pour garantir l'impartialite et l'independance des juges.",
			"body": "Que pensez-vous du systeme judiciaire francais?",
			"added": 1588785648
		},
		{
			"topic_id": 5,
			"title": "La taniere des capitalistes...",
			"body": "Economie, finance, argent, impots, CAC40, Livret A, tout pour augmenter ses revenus ou diminuer ses depenses. \n",
			"added": 1588871770
		},
		{
			"topic_id": 6,
			"title": "Que signifie capitaliste ou capitalisme pour vous? ",
			"body": "A lire certaines reponses, je ne suis pas certain de bien comprendre le sens que vous attribuez a ce mot. J'ai l'impression que le probleme n'est pas le marche libre, le libre choix dans l'affectation de ses ressources (temps, argents) ou meme l'idee d'argent. Mais ce que certains appellent le cronie-capitalisme, c'est-a-dire la capture legale (loi) afin de favoriser certains secteurs ou entreprises.\n\nOn peut prendre l exemple des vaccines obligatoires : une industrie, grace a la cooperation du parlement impose ceux-ci au peuple.\n\nOu alors les antennes 5g, l industrie ne publie pas leurs etudes sur la sante, recoive le droit de le faire et tous nous en patissons, sauf ceux qui ramassent le fric :).\n\nJe me trompe ou vous souhaitez une economie centralisee et plannifiee (qui tournera au totalitarisme authoritaire a l'expression de la moindre dissention avec le programme)?\n\n",
			"added": 1588958144
		},
		{
			"topic_id": 7,
			"title": "Tu penses que de Gaulle il aurait aussi sucer la bite à Polanski?",
			"body": "Tu vois sale merde, sous homme de fils de putes et petits laches... c'est ca ta france. \n\noh tu peux me chier de la merde tout le temps, me foutre de la propagande de bas niveau.\n\nmais la realité est la.\n\ntu peux prétendre etre ce que tu veux, t es une merde, par tes gestes, par tes faits, par ta lacheté.\n\noui toi. vas y censures, enerves toi, grognes avec tes petits poigns tout serrés.\n\nmais je me demande votre de gaule, il vous aurait executés comme des chiens, pas seulement pour le viol sous empoisonnement de cette petite americaine, non, pour votre couverture à cette merde?\n\noui polanski est un sous homme, une sous espece, un dechet.\n\nallez vous foutre, sans vie.",
			"added": 1592465714
		},
		{
			"topic_id": 8,
			"title": "Philippe de Villiers, encore une petite raclure...",
			"body": "Alors on met son fiston dans son pa-parc? ahahahahahha. \nC'est tellement comique, carricatural.\ny a tellement rien à faire, c'est la honte, totale.\net puis le Philippe il a dit quoi sur le celebre et fameux polanski qui viole une petite américaine, rien? bon toutou, il aura son paparc. ahahahah.",
			"added": 1592495318
		},
		{
			"topic_id": 9,
			"title": "Ghislaine Maxwell est à Paris !!! Tjrs plus bas, telle devrait être la devise de cette république",
			"body": "Bravo à toute l'équipe du gouvernement de Macron ! Vous êtes les meilleurs, votre orthographe est parfaite, et surtout vous protégez une des pire criminelles internationales. Quelle honte pour cette France que vous prétendez representez et diriger.\n\nApparement, Ghislaine serait à l'avenue Matignon dans le 8ème. \n\nPour ceux qui ne connaissent pas l'affaire, connue sous le nom de pedogate, voici un petit recapitulatif.\n\nLe père de l'Attorney General des Etats Unis d'Amerique (ministre en chef de la justice amérique, Departement of Justice), a nommer comme professeur d'école Jeffrey Epstein, dans une école huppée de Manhattan, New York. Par la suite JE (jeffrey Epstein) s'est lancé dans une vaste opération de viol, meutre et certainement extraction d'organes et de fluides corporelles (adénochrone) sur de jeunes filles américaine blanches (non juives, aka \"causasienne ou europeene\". Il eut également son île privée pour violer et tuer ces enfants, ou il recevait le gratin américain.\n\nGhislaine Maxwell, dont son père à controler une partie de la presse allemande avant de trahir l'angleterre ou profit d'Israel, ou il eut des funerailles d'états, fut la partenaire de crime de JE voir l'éminence grise.\n\nCelle-ci connait depuis son enfance la famille royale britannique, et est une pote du prince andrew (frère du futur roi charles d'angletterre). Suite à l'assassinate de son père sur son yacht celle-ci se dirigeat vers les usa afin d'y créer avec JE le plus important réseau de viol, d'escalavage sexuelle d'enfant américains impliquant des vips (de clinton, a wexner (victory secret, d'autres marques trendy) à dershovitz (un juif qui veux nous vacciner de force) à un premier ministre d'israel).\n\nGhislaine occupait un role de réperage, ie scoot, avec parfois meme l'ancienne femme de donald trump, ivana. Elle se baladait en voiture à nyc, nice, paris, londres et pays de l'est pour réperer des jeunes filles mineurs, qu'elle entrainait et conditionnait progressivement à devenir des esclaves sexuelles d'abord pour jeffrey puis pour ses clients.\n\nCependant derrière cette perversion, il y a un immense réseau de black mail, c'est-à-dire que des gens influents étaient invités par JE usant du prince andrew ou de clinton, puis sur l'ile de les compremettre en utilisant l'armée d'enfant esclave sexuelle pour les compremettre et surtout influencer la politique...\n\nAu début des années 2000 certaines survivantes on réussit à s'échapper de l'enfer d'Epstein et rapporter à la police de palm beach (floride). Les flics en question on été assassinée. Le FBI a essayé d'enqueter puis s'est fait calmer. En france, Epstein aurait kidnapper deux enfants de 8 ans pour son anniversaire, apparement, l'attaque dans le commisserait a Paris utilisant d'armes phsycologique sur le musulman est lié. \n\nEn conclusion on voit que 3 membres du conseil de securité permant de l'ONU sont corrumps (france, gb, usa) et controller par des violeurs d'enfants. De plus les 3 dispose d'armes de destructions massives.\n\nLa bonne nouvelle, ils peuvent échapper à la justice des hommes tant qu'ils peuvent, mais à un moment, le coupret de la mort va tomber... et quand on regarde la magnficience infini de l'univers, on peut logicalement et rationnellement supposer, que quoi que les hommes puissent faire à ces créatures, il n'en ait en rien comparable à la justice eternelle... et sur les fruits de tes fruits pour aussi longtemps que souffrance il en sera, en sera t'il.\n\nJ'espère néanmoins qu'un jour le peuple soumis par la prise de vercingetorix arrivera a nouveau à redresser la tete et se liberer de ces oprobes pour regagner son honneur perdue. Et pour ça, violence il y aura.\n\nPS : je pense pas que les tchetchènnes toléront d'apprendre que leurs enfants sont violés par qui que ce soit, inclus, tous. Quand les lois de l'univers sont avec toi, la réalité même fond. \n\nMORT A CETTE REPUBLIC, mais bon c'est l'ouest.",
			"added": 1592820666
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 1,
				"body": "Bonjour planeshperev4,\n\nJe vous remercie pour votre reponse interessante. Je partage un certains nombres de vos remarques.\n\nA mon avis, il y a plusieurs avantages indeniables a la democratie directe. Le plus important me semble etre le fait qu'apres la votation, au moins 50% des votants sont d'accord avec la decision. Il me semble que cela permet une reelle acceptance du resultat, une plus grand paix et cohesion sociale. Ensuite, comme vous le remarquez, ces differents referendums pourraient permettre de minimiser les decisions les plus absurdes. Il est toujours plus facile de convaincre ou \"corrompre\" un petit nombre de parlementaires qu'une majorite de citoyens. Je partage egalement votre argument sur la responsabilisation des citoyens. En effet, il est souvent facile pour des parlementaires de s'isoler des decisions prises, alors que les citoyens sont les premiers affectes. \n\nDans le details, je trouve que le referendum legislatif et abrogatoire sont des armes democratiques a tres haut rendement. Ils permettent a la fois de proposer des modifications legislatives et surtout de bloquer certaines ambitions parlementaires. Il est structurement difficile pour un parlement d'etre reellement represantatif d un peuple et surtout de faire absraction de leurs interets propres et leurs ideologies. Le referendum revocatoire me semble etre encore plus puissant, permettant d eliminer un elu ou officier d etat ne repondant pas ou plus aux besoins de la population, soit au contraire de confirmer sa legitimite. Pour moi, le referendum constitutionnel, n est pas tellement different d un referendum legislatif, fondamental c est seulement la nature de la loi, texte de loi ou article constitutionnel qui est affectee. Finalement le referendum financier est egalement d'une utilite incontestable, c est les citoyens qui payent, et donc il est logique et juste qu'ils aient un droit de regard sur l'affectation des deniers publics.\n\nConcretement on remarque que l'ensemble de ces droits sont naturelles pour les societes commerciales. En effet les actionnaires peuvent elire les dirigents de l'entreprise et les revoquer (referendum revocatoire). Ils peuvent egalement decider de la politique commerciale de l entreprise, que cela soit au niveau des objectifs (referendum legisalitf et abrogatoire) ainsi que de son existence (referendum constitutionnel) ainsi que de la politique financiere  (investissements, dividendes etc). Qui prendrait part a une entreprise commerciale sans ces droits basiques et fondamentaux? Alors pourquoi nous, en tant que citoyens ne les avons nous pas et pire ne les demandons meme pas.\n\nCela me permet de rebourir sur vos remarques sur la partie mourrante d'une economie de marche libre. Il est sure que la disparition ou regression d un secteur entier du marche peut paraitre choquante voire injuste pour les personnes dependantes de ce secteur. Seulement, comme dans un verger certains arbres (secteur) arrivent a bout de course, le marche ne voulant plus d eux. Pour moi le marche est la forme la plus pure de democratie directe: on veut, on paye. On ne veut pas et personne pour vous forcer a prendre. Alors effectivement cela requiert une certaine force d'abilite et surtout de flexibilite pour s adapter a la demande des acteurs du marche.\n\nEt c'est la ou se situe une difference avec votre point de vue. A mon avis, et je partage votre conclusion sur l etat morribond de la situation, mais c est justement l absence de democratie directe qui perpetue cet etat nauseabond. En effet, il est plus facile de legiferer des protections temporaires a des secteurs voues a la disparation ou d imposer des choix politiques aux acteurs du marche que de s adapter a l evolution des demandes.  Pour reprendre l analogie du verger, a un certain point dans la vie d un arbre, il est plus couteux en temps, argent et efforts de prolonger les derniers espoirs de rendement que de le remplacer. Un peu comme une poule pondeuse...\n\nPour faire simple, la democratie representative a une forte tendance a rentrer dans un systeme de nature de preservation des rentes de marches au lieu d abattre ces secteurs afin de redeployer le capital dans des secteurs porteurs qui eux memes tot ou tard seront voues a la disparition. \n\nPour conclure, je dirais que votre plus grosse erreure theorique est votre absence de comprehension que la production suit la demande, et jamais le contraire. Vous pouvez produire ce que vous voulez et surtout comment vous le voulez, si personne ne le veut (sans etre force a le vouloir, par obligation ou penurie d alternatives), cela ne sert a rien. Et c'est la a mon avis l'avantage structurelle de la democratie directe sur un systeme representatif, elle offre les conditions cadres a l'etablissement, au developpement et a l'evolution d'un marche dynamique repondant aux attentes des acteurs de celui-ci. Cependant, la plus gross faiblesse d'une democratie directe, est qu'il repose sur le bon sens, l'intelligence et la sagesse des citoyens eux-memes: le citoyen-acteur du marche. Pour un etre vulgaire, que l on achete ou vote pour de la merde, c'est seulement de la merde qu on aura.\n\n@anonpos7 l'avenir est donc une economie plannifiee imposee par une dictature autoritaire et totalitaire (appellee poliment technocracie, les \"experts\" ?  Pourquoi placeraient ils vos interets au dessus des leurs? benevolence? bonte naturelle? ce sont des anges?\n",
				"added": 1588489835
			},
			{
				"comment_id": 4,
				"body": "Bonsoir,\n\nJe ne comprends pas en quoi l'UE serait un obstacle a l'introduction de nouveaux droits democratiques? Il ne me semble pas que l'EU ait le pouvoir de decider des droits democratiques de la France. Il y ades referendums en Autriche, Bulgarie, Croatie, referendum constitutionnel au Danemark, Estonie, Grece, Hongrie, Islande, Ireland, Italie, etc... \n\nA ce que je sache Wuhan est Chine... ",
				"added": 1588785172
			}
		],
		"2_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 2,
				"body": "Bonsoir,\nJe vous remercie pour vos reponses, cependant je remarque qu'elles sont toutes anglophones...\n",
				"added": 1588784565
			}
		],
		"1_14ixt7XngjiiqDEqjMdvTLWoJE2s9cV1ZB": [
			{
				"comment_id": 3,
				"body": "Les plages fermees... c'est un peu exagere, non?\n\n> [ludeti](#comment_1_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL): Lorsqu'il faut fermer sa bouche pour ne pas finir en taule; le langage des signes peut-être utile, perso j'aimerai apprendre à neutraliser les humains avides.A l'heure actuelle, j'apprend à comprendre la dictature.\n\nQue souhaiteriez-vous exprimer?",
				"added": 1588784724
			}
		],
		"2_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 5,
				"body": "NON !\n\nf0gxr39100, absolument pas, c'est tout le contraire. \n\nIl va falloir vivre dans des cages de faraday, on en est pas loin d'ailleurs... ou dans les zones blanches. Sinion, la \"moustiqueraire\" tissee en fil d'argent va devenir un accesoire esentiel de toute literie...",
				"added": 1588785360
			},
			{
				"comment_id": 7,
				"body": "> [planespherev4](#comment_14_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg): C'est probablement le plus grand scandale sanitaire depuis le tabac. Et contrairement aux pesticides, on ne peut pas y échapper.\n\nA mon avis, moindre que les technologies nucleaires (tchernobile, fukushima, etc) ou que les technologies de manipulations du vivant (OGM), avec les antennes, il suffit de les eteindre pour contenir les dommages. ",
				"added": 1588872175
			}
		],
		"1_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 6,
				"body": "Fraternite, egalite, mais ou est passe la liberte?",
				"added": 1588785443
			}
		],
		"7_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 8,
				"body": "Ensuite, j'adore comme ces losers de la censure n'arrêtent pas de chier de termes sans sense; la republique, esprit republicain, mode de vie, justice... je me lol tellement cela fait pitié.\n\nque des petits suceurs... c'est une honte.",
				"added": 1592465800
			}
		],
		"6_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 9,
				"body": "> il est logique qu'une classe essaie de dominer et d'asservir l'autre.\n\nbah non... il faut que tu lises les théories du musulmans sur le monde de la périphérie... pour faire simple quand un marché chute comme tu le décris par l'emergence de ces classes (securité, prêts et politiciens, gatekeepers), autour d'eux, emergent naturellement ceux qui vont les massacrés :).\n\npour faire simple, le soldat veux que sa femme et ses enfants puissent aller dans un marché sur, pour echanger de l'argent contre de la nourriture etc. problème quand les corrompus prennent le pvr, le marché se dégrade, et les marchants honnetes partent, à la peripherie d'abord puis vers l'emergence, la ou les soldats peuvent aller manger en sécurité... \n\nil faut que tu comprennes la rélation entre la violence (sécurité du marché) et les marchands... soit on a une relation symbiotic, et la le ciel est la limite... soit on a une relation destructive d'un coté ou de l'autre... mais rappelle toi, les billets de banque, les pieces, les murs, ne peuvent sauver un marché, surtout lorsque les \"vraies\" reconnaissent dans les \"barbares\", les valeurs éternelles de la guerre : les lois de la guerre.\n\n>Abolition de la société de classe\n\nimpossible, y en qui sont doués pour le kung fu, d'autre pour l'écriture (compatibité, écriture, poesie)... et si tu veux bouger 1 million d'hommes, avec chacun tous ce qu'il faut pour vaincre, il faut du monde... \n\n>Définition: Le capitalisme désigne un système politique et économique reposant sur la propriété privée, notamment des moyens de production, le libre échange sur des marchés et la libre concurrence.\n\npour moi un des aspects le plus important est la liberté de volonté, pouvoir choisir, de vendre ou d'acheter, librement, sans violence. \n\net puis tu vois cette notion de propriété comme quelque chose de mal, rappelle, toi, chaque soldat a son épée, la sienne. \n\nsi tu veux voir c'est comme en grèece ou a rome... les corrumpus prennent le pouvoir, essaient tout le cirque qu'ils veulent, se font raser. les grecs par les romains et les romains par les tribus libres... \n\net faut aussi voir que la liberté est une composante essentielle sur un champ de bataille, elle permet la créativité, la surprise, l'adaptation... pour atteindre la victoire, qui signifie simplement le massacre de l'autre, ce camp adverse qui essaya ou préparera d'essayer de reduire l'autre au meme stade que ceux qu'ils dominent.\n\n>Non. Pas une économie centralisée et plannifiée. Pas d'économie du tout. Abolition de l'économie. Abolition de la société de classe. C'est ça, ou on continue le cirque dont tu parle: vaccins, 5G, etc... On continue? \n\njette ton ordi à la poubelle mon bon... c'est le marché qui te le propose... ",
				"added": 1592822537
			}
		]
	},
	"comment_vote": {
		"9_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": 1
	}
}