{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Krixanoschool2",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1557339524,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1557343598,
			"body": "@klu9: \n> You mean in my comment on eightyfour's post where I consistently address him/her with the second person \"you\" before you (krixanoschool2, better make that clear) ever showed up in the thread?\n> My bad!\n.\n> You were posing as/mocking me as if I was speaking to him. \"You\" refers to EightyFour, and the person speaking is supposed to be a mockery of me.\n> \n> Now what does this say?:\n> \n> > you empty headed animal food trough wiper. I fart in your general direction. Your mother was a hamster and your father smelt of elderberries.\n> \n> \"You\" - as you've just admitted, refers to EightyFour. The first half of the post you've just admitted to being a mockery of me. This section is hypothetical me calling EightyFour an \"empty headed animal food through wiper\" (whatever that means), and mentioning their mother/father.\n.\nFirst you say \"You\" refers to EightyFour, then I say You refers to EightyFour... then, here comes the admission:\n> Hence the parody of you back near the start of the thread.\n>\nYour response: \n> To explain the second person form of pronouns? Maybe later.\n\nSo far... you've literally said everything that I said in my post.",
			"date_added": 1557343596
		},
		{
			"post_id": 1557345191,
			"body": "Let's get to what's actually going on here... @klu9's pissed off that I said this:\n> I mean, come on now. Would you like it if I (and others) kept on pestering you about supporting KxoId on your blog, because I think it's really easy and \"all you have to do\" is this and \"Problem Solved\"?\n> Stop being a jerk.\n\nAnd this: \n> of course, klu9 already knew that, but chose not to tell you this (which is a deliberate disservice to you, imo - but of course he probably didn't like that I told him off for being a jerk, lol).\n\nNow, let's compare this for a second to what he's said about me:\n> You are late to the game. And how dare you call it drama?! You thinK poor, brave viktims kourageously and righteously kalling out the shitty behaviour they suffer wherever they find it is all just drama? The real faktor all these incidents share, the kommon denominator if you will, is obviously not drama, it's... that it's all the rest of us here who are jerKs. And if you can't see that, then you're a jerK too. With a capital K J! I can't wait either until it's your turn and some poor brave heroic victim steps up and brings you the pain! The pain of the truth about your shitty behaviour here!\n> .\n> So I don't want to talk to you no more, you empty headed animal food trough wiper. I fart in your general direction. Your mother was a hamster and your father smelt of elderberries.\n.\n> Frankly ZeroNet, indeed, the world needs more people courageous enough to steam into any thread and start calling people \"brainless\" and \"jerk\" and telling them to \"stfu\" (and not meekly hold back from that just because the other people were simply tricky enough not to do it first.) And to take that war into other unrelated threads involving people who've got nothing to do with it. And do it all secure in the knowledge that it's all the other person's fault for their stupidity and their awfulness toward you and they're just getting what they deserve: TRUTH!\n> .\n> You've been doing it in threads long before I came onto ZeroNet. You've been doing it regularly while I've been on ZeroNet. And you'll be doing it long after I'm probably gone from ZeroNet. Keep it up and stay strong!\n> .\n> Poor, brave Krixano / KxoBot / whatever other name you're using beginning with a K.\n\nAnd look here, he tries to act like his \"Parody\" wasn't a harassment towards me:\n> You mean from the comedy insult I directed at eightyfour? Whooosh!\n> You mean in my comment on eightyfour's post where I consistently address him/her with the second person \"you\" before you (krixanoschool2, better make that clear) ever showed up in the thread?\n\nThen later admits to it being so:\n> I know you always feel everything everyone says proves you're right. Hence the parody of you back near the start of the thread.",
			"date_added": 1557345188
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}