{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1523653054,
			"title": "CJDNS aka Гиперборея",
			"body": "Есть участники? Если да, то повысим связность (обменяемся ключами/адресами)?\nНа мой взгляд самая удачная модель оверлейной сети на данный момент.\nНе является сетью распространения данных, как FreeNet или ZeroNet. Поэтому позволяет строить на базе себя полную альтенативу обычному интернету. Адреса, порты - все на месте.\nКуда быстрее i2p. С системой имен (аналог днс) вопрос открытый.",
			"added": 1523653053
		}
	],
	"topic_vote": {
		"1523653054_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1520190095_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 1,
				"body": "Так а что тут делать? Что читать? Где контент?\nzeronet как задумка неплоха. На вид простенько, зато быстро, особенно в сравнении с i2p. Но нет, к примеру, ни темплейта обычного привычного (что-то в стиле phpbb?) форума. Так что и мигрировать сюда смысла нет, если кого вдруг закрывать будут.\nА есть хоть один пост об обходе блокировок сайтов в Украине? Мне не надо, если что. У меня уже всё есть. :)\nСмайлов тоже нет... И что тут делать?",
				"added": 1522975387
			},
			{
				"comment_id": 2,
				"body": "> [zeronetix](#comment_51_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Можна склонувати цей сайт, можна склонувати практично будь-який блоґ. Для інфи є ZeroWiki.Смайли - емоджі, і вони працюють 😃\nНу и смайлы из фонта это не серьезно.\nКлонировать talk? Он ужасен! Для текущего момента пойдёт, но что-то посерьезнее на нем не получится.\nНу и я же спросил прямо. Аналог phpbb. Стандарт на форумы для людей. \nВики для инфы... Посмотрим... Предположим, кто-то решил мигрировать (!!!) сюда. Как есть. Один в один. В доках не написано, как быть. В доках про теймплейты, от которых 0 пользы, поклонировал, поигрался и забыл. Как происходит переезд из внешнего мира сюда обычного сайта на LAMP? Ну, например 0day решит переехать. Или autoua. Или dou. Сохраняя свой оригинальный вид и полную функциональность. Иначе смысл?\nПока что я вижу тут одну большую вики, порезанную по кусочкам/0-сайтам.",
				"added": 1523065668
			}
		],
		"1525090186_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": [
			{
				"comment_id": 3,
				"body": "Переход на субтитры работает. На трекер нет. \nКак-то странно видеть трекер из клеарнета. \nИ вообще, остальное то из клеарнета не убрать.\nПравда вот, что-то есть на эту тему\nhttps://github.com/ZeroNetJS/zeronet-tracker\nПока не разобрался, что там в зн, что в торе, а что как есть.",
				"added": 1536360254
			},
			{
				"comment_id": 4,
				"body": "> [zeronetix](#comment_63_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): І надалі, тут україномовний ZeroTalk, а не московськомовний :)\n\nА теперь о политике? :) У нас многоязычная страна. Де-факто двуязычная. Ну а Киев на 90% русскоязычный. И я как раз из Киева. Мне можно. :)\nИ мне так удобнее. Ты действительно настаиваешь, чтобы я отсюда ушёл?\nПусть замена языка будет эволюционной. А не революционной. Ок? \nМоисей 40 лет по пустыне водил. Подождёшь 40 лет?",
				"added": 1536631817
			},
			{
				"comment_id": 5,
				"body": "> [zeronetix](#comment_64_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Ок. Давайте про політику. А ще краще підіть і українською напишіть в російському сегменті інтернету/зеронету. Прочитаєте що про це і вас скажуть :)Росія привела війну в Україну, і моя реакія до російської мови тому дуже навіть передбачувана. Не треба дивуватись.До речі власних дітей (якщо вони у вас вже є) будете навчати українською? Чи російською? [...]\n\nПлохой пример. На том же российском nonameclub порой бывают релизы на украинском. Никто не бесится по этому поводу. Релиз и релиз. На такой товар тоже покупатель найдется, если образно.\nФарион, Тягныбок, отмена языкового закона. Достаточно многие сходятся на том, что это был старт и повод для событий в Крыму. Если бы вместо отмены их кто-то быстренько заткнул и выступил бы по всем каналам, что давайте все дружить, то случился бы Крым? Может и нет. А может и да, но найти правдоподобный повод было бы однозначно сложнее.\nДети? Учит школа. Язык тот, какая школа по месту прописки. Такой закон. В семье на русском. За пределами семьи - как сами захотят, как им самим будет удобно.\nНу видимо таки придется идти к врагу, дружить там и привыкать, что может там и не враги вовсе. Раз свои же выгоняют.\nЧао.",
				"added": 1536957784
			}
		]
	},
	"comment_vote": {
		"2_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
		"5_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN": 1
	}
}