{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1615639855_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": 1,
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1615371304_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 1,
				"body": "from within country.. thanks @peace001 for making a topic",
				"added": 1615648140
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 2,
				"body": "ar15user1 ... she had her weaknesses also, the bodguard beside her was from XunTa .>.> within the country help please ... internet censored >.<!\nbtw not her fan... just likes the way she doesn't get intimidated..",
				"added": 1615648312
			},
			{
				"comment_id": 3,
				"body": "> [iw2](#comment_4_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): yeah, I understand your current difficulties. the UMM has no choice but to defeat her and those she has manipulated in this whole UNO / global agendas.  [...]\n\nI don't know about others but is not \"Democracy\" but in reality I want is \"Everyone is equal / and no one is above the law, Accountability and Responsibility And Consequenses\" but Xunta.. cant even talk, you talk they shoot.. >.<!",
				"added": 1615650452
			},
			{
				"comment_id": 4,
				"body": "> [iw2](#comment_5_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): Our common dream ! did you read ayn rand Atlas Shrugged? It's a long book, ideal to avoid any flying bullet. [...]\n\nI don't know who \"us\" is but I'm sure we are the same, as of readiness and survival skills... depends what the situation is, but for \"sharing\" I love to share if you don't appreciate \"the share\"  I would not be offended as well, I will go to someone else and \"share\" :) \"Sharing is Caring\" ... \"Come as guest & Stay as Family\"\n... I'm sorry to disappoint you I don't read so many books ... but I'm sure I will get into it... \"Atlas Shrugged\" thanks for the info :)",
				"added": 1615651975
			},
			{
				"comment_id": 6,
				"body": "if \"parasites\" is ment to do harm... I would suggest something like \"vote\" system through decentralized system but as for \"implementation & security &  logical sense\" = no clue :|",
				"added": 1615652701
			},
			{
				"comment_id": 7,
				"body": "> [k175](#comment_6_1Ao77vhtVzHna35Fg6DvaQLqpJHLchHriC): if \"parasites\" is ment to do harm... I would suggest something like \"vote\" system through decentralized system but as for \"implementation & security &  logical sense\" = no clue :|\n\nbut who am I to decide what is \"right or wrong\" just harming / abusing / impunity  / doing thing withou justification for reasoning seems to be wrong for me..",
				"added": 1615652860
			},
			{
				"comment_id": 8,
				"body": "> [iw2](#comment_8_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): I was meaning in your daily life struggle... nothing systemic. [...]\n\nI guess if it becomes to that point share my house for sheltering for those who don't have shelter but if i do that the xunta will kill me and the person i am sheltering becoz of thier harsh mendate law under \"emegency\"\nFor now we are already doing sharing our rice pot with one another, donating what we can to support eachother ... we don't need to buy luxery or want to be better then others... even if we have all that and the place that we live without freedom of choice / speech / information / able to exchange views / ... dunno abt others but its living but for me it is living dead.. or having to live in fear for creativity",
				"added": 1615653823
			},
			{
				"comment_id": 9,
				"body": "> [iw2](#comment_9_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): you already have a computer or cellphone with internet access... not too bad. you don't want, nor can answer/undertsand my question. aka you haven't reached survival yet. see you later :).\n\nI apologize for not being answer to your question..\nI will try harder\nbut very nc talking to you, take care..",
				"added": 1615656417
			},
			{
				"comment_id": 10,
				"body": "> [iw2](#comment_11_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): Yes it was a pleasure, I hope you won't ever experience true survival...\n\nIncase if I am about to, would you give me some useful pointers before going ? It would be a life saver not just for me but for everyone I can share with...",
				"added": 1615656756
			},
			{
				"comment_id": 11,
				"body": "> [iw2](#comment_12_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): search engines are your friends... survival guide, prepping, preppers manual / guide etc. can be overwhelming at first... step by step... first 3 days... 3 weeks, 3 months etc. take care !\n\nThanks for the keyword.. appreciated...\nnow I must (rtfm ^_^)",
				"added": 1615656912
			}
		],
		"1615639855_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": [
			{
				"comment_id": 5,
				"body": "make users aware about decentralized social media ... especially during this time it would work.. I can translate how it can be done, I'm new to this system.. but I'm not a new.. new.. :)",
				"added": 1615652237
			},
			{
				"comment_id": 12,
				"body": "> [iw2](#comment_7_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm): decentralized social media doesn't mean censorship resistant. try bitmessage :).\n\nAlready Using :)",
				"added": 1615665184
			}
		]
	},
	"comment_vote": {
		"2_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX": 1,
		"4_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"5_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"6_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"9_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"11_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"12_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1,
		"7_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": 1
	}
}