{
	"next_post_id": 25,
	"next_comment_id": 31,
	"next_follow_id": 10,
	"avatar": "jpg",
	"user_name": "Jaka Tanker",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Prince of BraveYard Kingdom",
	"post": [
		{
			"post_id": 1,
			"date_added": 1560232300,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1560232634,
			"body": "How I know about zeronet? \n1. User of chocolatey\n2. Yeterday trying to learn about IPFS and IPNS\n3. Stumbled on this\n\nAwesome!",
			"date_added": 1560232632
		},
		{
			"post_id": 1560292656,
			"body": "Archived from zerohedge.com\n\nGoogle Tricks: How to Supercharge Your Searches and Become an Instant Power User\nhttps://archive.fo/R5AXq#selection-953.23-996.0\n\nself.reminder",
			"date_added": 1560292653
		},
		{
			"post_id": 1560293293,
			"body": "Archived from zerohedge.com\nMy favorite journalist\n\nPepe Escobar: The Unipolar Moment Is Over\nhttps://archive.fo/IxoAs\n\nDespite relentless smear campaign against China & Russia in the west. WE KNOW EXACTLY what IMF had done to the world, depriving country from their wealth while reduce their state from sovereign to a mere slave. Still hot in my mind when I'm angry to Greece by smear-campaign-writings in MSM, they said greece = lazy, love vacations and too much debt, but in fact they're back-stabbed by those corrupt EU officials and greedy bankers.\n\nMSM accuse China & Russia of what their crony had done in the world. What the world does is = communism for The Rich (proven by irrational bail-outs), and capitalism for The Poor (proven by forced austerity). And also to accuse China and Russia by the strawman-clothes isn't right, it's just pot calling the kettle black. And also what kind of capitalism today is? Huawei CFO kidnapped for what? Give me a break ...\n\nSmear Campaign will never stop,\nBut the caravan will left them biting the dust",
			"date_added": 1560293289
		},
		{
			"post_id": 1560382422,
			"body": "The Problems with #Technocracy these days: \n\n1. Delete the users/post and wipe out the evidence\n> There's never a 'case-files' left on their sites, at least give one in the censored url. Imagine if twatter.com/truthnews is censored, why not give some '404 notifications' using the reasons why they have been censored.\n\n2. Deleting users and reasons to change policy via post-truth type of truth\n> The reasons is nothing but f4rt, the motive is clear **greed**\n> Proof: youtube case against pedophiles, solution is? banning all the comment and enforce comment filter to the content creator? Is that affect the pedo behavior? none\n> Proof: new case of carloz maza, 1:1 cat fight, turned to be new hate speech policy and demonetized + deleting historical education channel\n> Twitter: deleting peaceful user, rearing violence inciter\n\n3. There's big company who leech from the small creator\n> This is actually huge flaw of content-id-system or content-algorithm, and stealing the term from @jamescorbett, we're desensitized to loathing to this kind bad practices overtime. \n\n4. The funny thing is they can sue you from past content you post, maybe before *a big catastrophe* you should delete all those content, although @byranlunduke said \"the older and the richer data compilation is the more worthy they're, they never delete, they just made it appear to be deleted\"\n\n5. What you host on their services - automatically - become theirs??? again **desensitization** here\n\n6. They do 'vile works' behind your back: \n> changing code\n> collect data\n> exploit permissions\n> expose you to harm (your data)\n\n\nnb: \n- writing with a broken english\n- maybe will be adding more in the future",
			"date_added": 1560382417
		},
		{
			"post_id": 1560406729,
			"body": "The State Department's War On Americans Against War On Iran\nhttps://www.youtube-nocookie.com/embed/EbBaZ0B9uCU?autoplay=1&iv_load_policy=3&loop=1&modestbranding=1&playlist=EbBaZ0B9uCU\n\nThis is what's actually happened, \nI know this might be a conspiracy theory behind but still fresh in my mind that pokemon-go are funded by NSA through proxy investor. Everything 'GREAT' in this world are funded and supported by ruling elites, everything has hideous-scheme behind it. \n\nMaybe what's happening in the world are thoroughly calculated and paved like: censorship of media which clearing the 'ability to fact check' by deleting 'the challenging source'. Fact check is important, you can never justify your 'righteous rage' without freedom of informations. \n\nAlso economical decisions in **the age of recessions nowadays** still remember the case Rothschild who swindle british to sell all of their stocks in the time of winning? http://humansarefree.com/2011/09/history-of-house-of-rothschild-complete.html and \n\nThen PTSD PR in Army Official Twitter which backfired https://www.zerohedge.com/news/2019-05-26/army-virtue-tweet-backfires-1000s-expose-heartbreaking-horrors-war | **war is never good for the people and only profiting elite**\n\n> Socrates said : \"the unexamined life is not worth living\" \n\nBank + Ruling Elites + Media = Hydra\n> Never see them as different entity\n\nThe more informations being censored known, \nThe more you should feel anxious and maybe there's lost information you should get by yourself.\n\nThis is why I support multi polar world order, \nlet those 2 beast fight each other ",
			"date_added": 1560406723
		},
		{
			"post_id": 1560442082,
			"body": "The trends of everything: \n1. Economic Relations \n2. Geopolitical Relations\n3. Free-speech/Free-informations\n> Black Pigeon Speech is now officially censored\n\nAnd still Trump doesn't care\n**Remember how Alex Jones fawning over & over to Trump** and still never get any help until now",
			"date_added": 1560442075,
			"meta": "{\"img\":\"900,504,b66b44eeefffccca44dbbbaa866977933733d88b55a99766,012233333340056423332789AB73332444C99233224444DE233222227F23\"}"
		},
		{
			"post_id": 1560442140,
			"body": "Do you agree? ",
			"date_added": 1560442132,
			"meta": "{\"img\":\"525,700,b84dcacb9edba97985764865953642aaa665776cbabbaba8,0012340045442112666667689654A669BBCBCBBBDDEDEDDEA5FF44D5A54FFFF55555455CCBCCBCCC\"}"
		},
		{
			"post_id": 1560453492,
			"body": "**Say hello to the Russia-China operating system**\n__The US ban on Huawei is pushing it to develop alternative systems that may rival Google and Android__\n\nGoogle cuts Huawei off Android; so Huawei may migrate to Aurora. Call it mobile Eurasia integration; the evolving Russia-China strategic partnership may be on the verge of spawning its own operating system – and that is not a metaphor.\n\nAurora is a mobile operating system currently developed by Russian Open Mobile Platform, based in Moscow. It is based on the Sailfish operating system, designed by Finnish technology company Jolla, which featured a batch of Russians in the development team. Quite a few top coders at Google and Apple also come from the former USSR – exponents of a brilliant scientific academy tradition.\n\nIn 2014, Russian entrepreneur Grigory Berezkin started co-owning Jolla, and from 2016 his Mobile Platform company started developing a Russian version of the operating system. In 2018, Rostelecom, a state company, bought a 75% share in Open Mobile Platform.\n\nAhead of the St Petersburg International Economic Forum last week, Huawei chairman Guo Ping discussed the possibility of adopting Aurora with Russian minister of digital development and communications, Konstantin Noskov. According to Guo, “China is already testing devices with the Aurora pre-installed.”\n\nIn Moscow, before moving to St Petersburg, Presidents Putin and Xi Jinping discussed multiple possible deals; and these include Huawei-Aurora, as well as where to locate some of Huawei’s production lines in Russia.\n\nGoogle, here we come\nAurora could be regarded as part of Huawei’s fast-evolving Plan B. Huawei is now turbo-charging the development and implementation of its own operating system, HongMeng, a process that started no less than seven years ago. Most of the work on an operating system is writing drivers and APIs (application programming interfaces). Huawei would be able to integrate their code to the Russian system in no time.\n\nHongMeng, for its part, is a key project of Huawei 2012 Laboratories, the innovation, research and technological development arm of the Shenzhen colossus.\n\nNo Google? Who cares? Tencent, Xiaomi, Vivo and Oppo are already testing the HongMeng operating system, as part of a batch of one million devices already distributed.\n\nHongMeng’s launch is still a closely guarded secret by Huawei, but according to CEO Richard Yu, it could happen even before the end of 2019 for the Chinese market, running on smartphones, computers, TVs and cars. HongMeng is rumored to be 60% faster than Android.\n\nThe HongMeng system may also harbor functions dedicated to security and protection of users’ data. That’s what’s scaring Google the most; Huawei developing a software impenetrable to hacking attempts. Google is actively lobbying the Trump administration to add another reprieve – or even abandon the Huawei ban altogether.\n\nBy now it’s clear Team Trump has decided to wield a trade war as a geopolitical and geoeconomic weapon. They may have not calculated that other Chinese producers have the power to swing markets. Xiaomi, Oppo and Vivo, for instance, are not (yet) banned in the US market, and combined they sell more than Samsung. They could decide to move to Huawei’s operating system in no time.\n\nBy the end of August, probably at an industry fair in Berlin, Huawei should be announcing its new chip Kirin 985. And by September the first Huawei smartphone equipped with HongMeng could be hitting the market.\n\nWatch that Lineage\nGoogle bought Android in 2005. Android is based on Linux, a free software operating system. There are already similar and better free software systems on the market, such as Lineage, which has a version adapted to at least two Huawei models, the P20 Pro and the Honor View 10.\n\nThe existence of Lineage operating system is proof that Huawei is not facing a lot of hurdles developing HongMeng – which will be compatible with all Android apps. There would be no problem to adopt Aurora as well. Huawei will certainly open is own app store to compete with Google Play.\n\nThe next step for Huawei and other producers is to go for Made in China processing and memory chips, breaking the stranglehold by Intel, Qualcomm, Broadcom, Micron Technology, Western Digital and the British ARM.\n\nAnd then there’s the Holy Grail: 5G. Huawei founder Ren Zhengfei has repeatedly stressed that what really matters is how advanced Huawei is compared to the competition. \n\nTotal tech war is in full effect. Huawei may face a very hard spell ahead. But at the end of a long and winding road there may be a sweet, unbeatable prize; prevailing over Google, Cisco, Microsoft, Qualcomm, and all that with invaluable help from the Trump administration.\n\nBy: Pepe Escobar",
			"date_added": 1560453483
		},
		{
			"post_id": 1560453836,
			"body": "**Hongkong RIOTS rebuttal**\nThis is how the MSM blowing up something towards their enemy (theirs = not ours). \n\nJust remember **how illegally Assange extradited** from Europe to USA despite many protest, listen to me: what Assange done is more relevant compared to the case in HongKong (without reducing the important factors of those two). \n\n\"Don't let them deceive you, see the crux'\n\n>Wikileaks and Assange done many to us, they open the fact about the post-truth propaganda about war. Many collateral damage done by psychopath to ease the desire of their blood-thirsty god.\n\nEurasia is on the move, Dogs will barking hard to the caravan.",
			"date_added": 1560453826,
			"meta": "{\"img\":\"900,450,876988a99b98ba9b87c97ca8a76754a86866555665322222,01233452210124673242012386524204239ABC01C42DE0CFFD\"}"
		},
		{
			"post_id": 1560454233,
			"body": "**Ship torpedoed rebuttal**\n+ There's no need Iran to attack Japanese ship, they anxiously need to fund their nations selling their oil which is sanctioned.\n+  Iran has no good things achieved from attacking ship from japan\n+ There's no evidence houthi rebel funded by Iran, they have relation though. Poor rebels doesn't have submarine to begin with. And they're not claiming.\n+ There's highly likely (70%) it has done by MBS, look how he 'hot-headedly without regards to consequence' killing Kashoggi. Young prince, rampant and never get smacked hard in his lifetime.\n+ As always this is Bolton's plan (war lover) and supported by Pompeo \n+ If there's no green-light from Israel, this would never happened. Of course USA will follow behind her. That's how the things works.\n\nConclusions: 1% chance done by Iran.\n",
			"date_added": 1560454222
		},
		{
			"post_id": 1560502712,
			"body": "There's a writing from Sun Tzu art-of-war, idk how exactly it said: \n\"If you're fighting a war - and on the offensive side - never prolong your battle, win it fast or else it will dwindling all the energies and demoralized all of your troops\"\n\nKeep watching on censorship issue and keep alert all the time will just make us tired and feel weak. Keep **Just In Time** philosophy near your toolbox. \n\n#giletjaunes #activism #fightglobalist\n*Always produce the bullet, sharpening your shoot while maintain your gun but limit the sniping time.",
			"date_added": 1560502700,
			"meta": "{\"img\":\"900,600,eeefffdddbcdcddccc777667556ccbaaa444aab877999,01111111001111111230112145400115678911110AB7C500009DDE999C32EDE959CCD3\"}"
		},
		{
			"post_id": 1560503174,
			"body": "Conclusions for today's economic read:\n**\"ALL THE EVIDENCE POINT TO MR. RECESSIONS\"**\n\n> Every time there's a big financial incident - big war will accompany.",
			"date_added": 1560503161
		},
		{
			"post_id": 1560543297,
			"body": "New material worth your time, still HOT!\n\n*\"Language is a Weapon\"* - by James Corbett\nhttps://invidio.us/watch?v=BHaT1svvz_U\n\n> Magician is real\n> They use chant (fuzzy words - in language)\n> Magic effect based on 'superego' inside you\n> The more is ur ego, it will reduce the magical damage",
			"date_added": 1560543283
		},
		{
			"post_id": 1560566114,
			"body": "Superb creations of crowder\n\n#502 HOW TO BEAT BIG TECH CENSORSHIP! | James O'Keefe Guests | Louder with Crowder\nhttps://www.youtube.com/watch?v=F2Unyh_KaEQ\n\n> Maybe it's just me but I think - the ruling elites - using their puppets, which is \"the left/ weirdos\" to do the tanking in front - take all the damages - while they are enjoying 0 damages privileges and still casting numerous magics to the horde of the *sane peoples* from behind. But sadly because how sissy us becoming are now (*which is supposedly not* to be and should be sensitized again), we can't even hit them straight in the face. They just slander/smear/punching us straight in the face everytime. And even if we hit back, we just hit the scourges/npc/zombie in the front and still giving a time for them to formulate another scheme.\n\nHow to beat them you say? We must at least give them a smack, no mercy",
			"date_added": 1560566099
		},
		{
			"post_id": 1560629872,
			"body": "Weirdest think that technocracy could done to you: \n\nYoutube Has Censored My Video About Censorship, Yes Seriously\nhttps://www.youtube.com/watch?v=N4E5laxlehY\n> Remove the access to appeal from the users\n> There's no TOS written about this\n> So unethical from youtube",
			"date_added": 1560629856
		},
		{
			"post_id": 1560644596,
			"body": "US Gov is more and more like a communist government? Listen to this interview. Attack on Assange is actually attack on a principle. And US Gov 'renowned' of not having a rule to be followed, hypocrite diplomacy. \n\nOn Contact: Kristinn Hrafnsson of WikiLeaks\nhttps://www.youtube.com/watch?v=TLGEfcwQHiY",
			"date_added": 1560644579
		},
		{
			"post_id": 1560795986,
			"body": "With the precedence of gulf-n-tonkin + widespread of informations via internet, the new *false flag* will be annulled. I think DTrump isn't so stupid as propagandized by those mainstream media. As of now, He's focused on elections > governing.\n> Thank God free speech and free informations, still partially reserved. Thanks also to the free market",
			"date_added": 1560795968
		},
		{
			"post_id": 1560796554,
			"body": "The threat of tech monopoly as of today:\n> in remembrance on how rampant youtube (as monopolistic company) has become.\n1. Amazon aws - host services\n2. Google Android (on progress vs huawei)\n3. Chrome engine webrowser\n4. Free blog platform - blogspot\n5. Wordpress  Instalable CMS\nAlready fixed +1: \na. gaming windows platform by using steam\nb. ...\n\n*you can add below via comment",
			"date_added": 1560796535
		},
		{
			"post_id": 1561327982,
			"body": "Some people give an opinion that Trump will really trashes Iran if there's no positive development within 15 days from downing-drone incident. It will be calm before the storm, get the preparations ready and set. WW3 will be across the spectrum: Military, Economy & Informations. All allies maybe given the time to prepare to storage their oil energy in that day.\n\nNo one will left unaffected.\n\nalso read this: https://russia-insider.com/en/politics/shutting-down-gulf-oil-trade-all-iran-needs-do-destroy-world-economy/ri27308#.XQ-yeZCXnYw.facebook",
			"date_added": 1561327962,
			"meta": "{\"img\":\"543,700,543334333445dddbcc898565aaa9aabbc999777666,01222222333333111112222211222222444444444444444567895A8AB766CCD6AA889C6BCD777777\"}"
		},
		{
			"post_id": 1561431980,
			"body": "If Iran war does happens, We're really fucked up. \n+ Russia will eventually smile, but China don't really\n+ Emerging economy might suffer because surging oil prices\n+ Gold and crypto went up kicking anyone mercilessly\n> also fakenews about gold and crypto will be boosted\n+ Bondmarket collapse, US~Dollar will go down and broke\n+ Nothing to lose for Iran - they're suffering now but won't back down AND because of Bolton-Pompeo Donald Trump face will be discounted which is bad for seemingly decline economy.",
			"date_added": 1561431959
		},
		{
			"post_id": 1561433041,
			"body": "<-- The best browser -->\nBefore using firefox watch this - https://youtu.be/UqkeZIPLY5M\n> Also no mention how lag it's\n\nBefore using chrome watch this - https://is.gd/9XyDQ6\n> Even before that news, I'm avoiding the chrome-as-browser, but still use chromium engine = sadly it's still in top\n\nNow I'm using brave as daily driver, might change to dissenter though (there's bat-ledger-process that can't be turned off from brave). \n\nBittube browser works great, it's using firefox engine, no ads, but I don't know about privacy though (still need some research). \n> Although it's still questioned, you can control your own practice on internet to fix that problems.",
			"date_added": 1561433019
		},
		{
			"post_id": 1561501790,
			"body": "NEWS WORTH OF READING\nREAD: GOOGLE IS BUSTED, MAJOR BACKLASH WILL ENSUED!\n\nWE THE PEOPLE: DON'T LET IT SLIDE!",
			"date_added": 1561501767
		},
		{
			"post_id": 1579291449,
			"body": "trends in 2020 by corbet, share your thought \n\nhttps://www.corbettreport.com/the-2020s-a-peek-at-the-decade-ahead/",
			"date_added": 1579291425
		}
	],
	"post_like": {
		"16F2cqiiQWDz8S6ajfUfP5kVfhs64A5CKy_1560070253": 1560241950,
		"1LBW5cq9Cfxw3S9HFYDSy29DheVR2tKBjH_1560067950": 1560241952,
		"1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj_1560049627": 1560241979,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560204433": 1560442594,
		"1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1560708388": 1560721211,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560795171": 1560795700,
		"1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75_1561101146": 1561104903,
		"14JNJcjJNfFc78fvfB4D3HExPZqDBnd7hj_1561079021": 1561104921,
		"1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1561036096": 1561105115,
		"1KsMvqaTPFnpBSuQzHv5BSQ3hQyYfcfXmc_1561033046": 1561105193,
		"1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75_1560932664": 1561105356,
		"1A8vWvRJtzgTv3KHZZJDv2rf4gzzy9yudk_1561175822": 1561186098
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Pexo: hello freedom fighter",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560232634",
			"date_added": 1560291936
		},
		{
			"comment_id": 2,
			"body": "@leftside: hello there",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560232634",
			"date_added": 1560291946
		},
		{
			"comment_id": 3,
			"body": "@Readonly: considering this is still an infant, it might be in the future.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560232634",
			"date_added": 1560292616
		},
		{
			"comment_id": 4,
			"body": "@Readonly: yeah, there's just beast vs beast kind of situations - and we just an ants. But at least it's not monopolized by 'one and only'",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560293293",
			"date_added": 1560293695
		},
		{
			"comment_id": 5,
			"body": "@Readonly: yeah.. that's the dream we want, but don't forget there's also barrack and army who in service of the ruler. If you live and have a bad experience from those, you'll think this is just a wishful thinking *sad*",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560293293",
			"date_added": 1560380817
		},
		{
			"comment_id": 6,
			"body": "@leftside: why would you think Cn and Ru = bloody gang? Every government has their own thuggy behaviour, btw USA also impose sanctions to many countries making their resident live harder. I watch many of Ron Paul's video. *sorry for broken english*",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560293293",
			"date_added": 1560380953
		},
		{
			"comment_id": 7,
			"body": "@Ftyg: thank you mate, let's keep our mind awake. I saw the forthcoming dark times in near future. ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560382422",
			"date_added": 1560405494
		},
		{
			"comment_id": 8,
			"body": "@leftside: haha limit your sarcastic:mode mate",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560293293",
			"date_added": 1560441624
		},
		{
			"comment_id": 9,
			"body": "@Whitewolf: yea.. only know this in 2019 sad!\n@g4us69jk: yes, but it will be prone if ipfs.io got censored though",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560232634",
			"date_added": 1560441714
		},
		{
			"comment_id": 10,
			"body": "@Moor: +1",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560453836",
			"date_added": 1560474279
		},
		{
			"comment_id": 11,
			"body": "@Whitewolf: Mohammed Bin Salman (Saudi), as he's the closest possible suspect. Of course it will always involved them, let's see",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560454233",
			"date_added": 1560480730
		},
		{
			"comment_id": 12,
			"body": "@Eightyfour: yeah... all form of tweets now is about how he's gonna win the near elections",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560442082",
			"date_added": 1560502027
		},
		{
			"comment_id": 13,
			"body": "Update: Black Pigeon Speaks is now reinstated!\n----- People's appeal still works ------",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560442082",
			"date_added": 1560502073
		},
		{
			"comment_id": 14,
			"body": "@leftside: \n+Agree, that might be the purpose of the elite (war as an objective), since they're out of the formation-of-war drinking a lemon tea whilst accompanied by beautiful instagram-maid and reducing potential competitor (wipe out middle class).\n+I never know long siege won great success (consistent yes, as I written in the first post), remember what done by Russia in syria, it's only a moment but total win and wipe out ISIS & saving more Christians. Compared to prolonged war in Afghanistan. ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560502712",
			"date_added": 1560526545
		},
		{
			"comment_id": 15,
			"body": "@leftside: act fully, hope the best :'D",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560503174",
			"date_added": 1560526588
		},
		{
			"comment_id": 16,
			"body": "@leftside: actually to correct you, it's not only them. But also bankster - they has a good tools too keep incognito, by paying msm a lotta money. ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560453492",
			"date_added": 1560533733
		},
		{
			"comment_id": 17,
			"body": "And in free market society, competitions always good for the consumer. As of today, you know how rotten the practice of google-android right? The golden time for android is only peaked at gingerbread ... after that only got worsen.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560453492",
			"date_added": 1560533862
		},
		{
			"comment_id": 18,
			"body": "@Daz: now you get into something, but we need to 'reset the program' though",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560566114",
			"date_added": 1560719050
		},
		{
			"comment_id": 19,
			"body": "@Moor: +1 | there're many good people in US, but the decisions maker are all corrupt. You can't tell them, you're not their Master.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560644596",
			"date_added": 1560719370
		},
		{
			"comment_id": 20,
			"body": "lol Fbook got offended",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1560708388",
			"date_added": 1560721295
		},
		{
			"comment_id": 21,
			"body": "wait till 3 months then assess again, that might not exact number ... I mean you may lost the water but not the fat. Losing weight instantly is just a myth. :D",
			"post_uri": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560795171",
			"date_added": 1560795776
		},
		{
			"comment_id": 22,
			"body": "@Whitewolf +1 almost forgot github, that's crucial and owned by Microcock right now. So scary! ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560796554",
			"date_added": 1560835463
		},
		{
			"comment_id": 23,
			"body": "@Kid Courageous: ahaha... I'm also a bit overweight, but my friends (doctor) always say \"better focus to your healthy way of living, nothing better than feel happy than stressed because of the seemingly constant weight\" ",
			"post_uri": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560795171",
			"date_added": 1560836098
		},
		{
			"comment_id": 24,
			"body": "for supplement search for christian prince / the arabian prophet on youtube. I saw there's caliphate in your picture. Don't fight alone brother.",
			"post_uri": "14JNJcjJNfFc78fvfB4D3HExPZqDBnd7hj_1561079021",
			"date_added": 1561105010
		},
		{
			"comment_id": 25,
			"body": "teach them how to bypass firewall and watch the pron :D",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1561036096",
			"date_added": 1561105157
		},
		{
			"comment_id": 26,
			"body": "will getting more and more soaring high to the moon",
			"post_uri": "1A8vWvRJtzgTv3KHZZJDv2rf4gzzy9yudk_1561175822",
			"date_added": 1561186118
		},
		{
			"comment_id": 27,
			"body": "Why bother? But if any people provide processed one I would pick that.",
			"post_uri": "18xGbkE27VLP7StwAP1GBwZh7RUfJqe5XJ_1561211258",
			"date_added": 1561327348
		},
		{
			"comment_id": 28,
			"body": "@leftside: this is troubling lol, but I'm starting a habbit to not browse without safety assurance.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561433041",
			"date_added": 1561501648
		},
		{
			"comment_id": 29,
			"body": "@SSDifnskdjfnsdjk: yeah firefox is getting better too, I've concern for monopolistic web-engine.",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561433041",
			"date_added": 1561501697
		},
		{
			"comment_id": 30,
			"body": "@Sudongpo: AI has taken the control, look wallstreet now. ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1561431980",
			"date_added": 1561501728
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj",
			"user_name": "Nickwa",
			"date_added": 1560243063
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
			"user_name": "Kid Courageous",
			"date_added": 1560293300
		},
		{
			"follow_id": 3,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4",
			"user_name": "Kopykate",
			"date_added": 1560293303
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "17RgJMZ9wxBZvSyTFnSGkMQVpLrAGYNfba",
			"user_name": "Zero0clock",
			"date_added": 1560293305
		},
		{
			"follow_id": 5,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2",
			"user_name": "Vargink",
			"date_added": 1560293312
		},
		{
			"follow_id": 6,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr",
			"user_name": "kroppt",
			"date_added": 1560293313
		},
		{
			"follow_id": 7,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1AqMPkUTDV5MrtLde9rd4482MSFpPeeuQd",
			"user_name": "Ftyg",
			"date_added": 1560405498
		},
		{
			"follow_id": 8,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ",
			"user_name": "Deliriumgoddesss",
			"date_added": 1560546483
		},
		{
			"follow_id": 9,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr",
			"user_name": "Daz",
			"date_added": 1560721297
		}
	]
}