{
	"next_topic_id": 79,
	"topic": [
		{
			"topic_id": 1,
			"title": "神棍说（二）(zz)",
			"body": "1，我 2010 年做了一個模型來描述中國閉關後的運行模式。從 2012 年人民幣頂點平台被批准離開的資金四處收購增加盈利規模。我提出的盆地模型即是 tg 外圍資金負責閉關後的基本進出口需求和軍用物資等的進口，國內全是人民幣的格局。一個以外養內格局從 2012 年開始籌備的，這是維持今後開銷模型！\n\n2，​你國一直都是法制社會。只是和你想的法治不同，你國是王法。\n\n3，我作為一個成年的人根本完全無法理解白鬼子的生活和觀念。如果你沒有有孩子時期的經歷一點一點的累積，你看白鬼子就像霧裡看花一樣。所以說什麼大學留學生了解的歐美其實都是扯蛋。根本就在鬼子外圍晃悠的。\n\n--------------------------------------------------------------------------------\n \n4，1990 年後的理工科的傻逼都是閹割的理工。白鬼子的理工，也稱 gym，指的是數理化好，文史好，音樂好。語言要求 5 門，必須懂拉丁語。因為重要文獻很多都是拉丁語，包括相對論等。你看看你國的理工科叫什麼東西？閹驢。\n\n5，1954 年馬斯洛需求定理鑄成，但是管仲兩千年前就做過類似的結論。臘腸 1966 年幹的事情，相對於幾千年封建帝制而言是一種進步。至少他知道了如何來利用底層而不能放棄底層。而今，其實人並無多少變化。所以同樣的事情再做一次，依然會成功。但是這有個邊際效用遞減在，間隔會越短\n\n6，我想沒有多少人是專門為了害命而偷搶的。我猜測大部分人會選擇讓其安全離開，因為你認為你的命比他的命值錢，對吧？中層貌似資產在增加，但是命好像卻沒多幾條。這還沒到大規模三產失業和惡性通脹時期。這未來的兩年，有多少人，錢還在，命卻沒有了呢？\n\n7，我從不是崩潰論者，我再重複一次。我從不認為你國會崩潰，我只認為你們會崩潰，ok？\n\n8，看來我還需要再解釋一下地王，去掉單位。之前新房價 1000, 二手價格 1200。出了地王後，新房價變成 1200, 二手評估價變成 1500。新房打折 20%，賣 1000。地王棄地，二手房含稅變成 1600。我不知道地王是誰幹的，但是我覺得開心的一定不是二手房主。\n\n9，論收入分配改變的迫切性。7 年前我定義今後世界有相當長一段時間不需要中國。中國傾銷商品導致的經濟上的被動封鎖將越來越普遍。維護現有分配制度的人的基本觀點就是世界始終需要中國，但這不是現實。蛋糕繼續做大不管分配是市場經濟派的堅持。外部經濟上的被動封鎖，包可以加之主動對外樹敵配合即可。\n\n10，我告訴你們個事情。幽靈離開原宿主的步伐，並不是包時候才開始的，而是星空時就開始了。不過這個可能你們沒有點悟性是不會懂的。今後的 30 年，幽靈只寄宿在新宿主的身體裡，直到吸幹才會再換。不過我希望你們看看白鬼子的恐怖片，看看幽靈離開原宿主後，原宿主變成了什麼？\n\n11，我能告訴你，80 年代的黑市就是 tg 自己開的嗎？你以為黑市為何會一直存在？你因為 tg 是他媽傻逼嗎？\n\n12，你國 16 年鈔票超發嚴重，但是總體物價卻可忍耐。收入存在銀行後，基本進入房產行業。但是隨外部環境變差，國內收入預期變差。沒有流入房產的錢已經無法離開你國，需要增值。房產不可流出錢，否則通脹壓力劇增。房產消費人群少且斷層，多印部分必須攤薄才可緩解壓力，怎樣的產品消費分母才最大呢？\n\n13，【个税改革方案已提交国务院房贷利息抵扣个税已确认】评论：抵扣不是重點，卻放在了最顯眼的位置。以家庭為徵收對象才是重點，卻放在了最後的位置。不得不佩服小編的細心。\n\n14，你們都問閉關後會發生什麼？其實俺一直在說這個話。這次經濟危機想度過去，除了一條路就沒有其他路。那就是改變現有的分配制度，而不是改革。這種改變不是原有基礎上的修飾，而是完全改變。改變分為被迫改和主動改兩種。被迫改有法國大革命先例，主動改有文化大革命先例。蛤星空等屬外人，無主動之力。\n\n15，想知道為何我有 2 年後血災的預言嗎？因為續做蛋糕派將在今後這兩年的惡性通脹期後失去支持。續做蛋糕派包括所有現有不希望改變任何預期的人。隨著時間和矛盾的推進，市場的力量將被市場派自己否定。加之計劃派一直的準備，雙方的力量將在 2 年後改變成同一方向。那麼好戲啦！\n\n16，論公平的重要性。我說過了，閉關的目的就是為了公平。實現公平就有人會犧牲利益。\n\n17，我再說下為何覺得中層人比 tg 還無恥。之前這 30 年中層為積極巴結上層，玩命獻媚。這今後是惡性通脹時期，一旦食品用品價格高企，中層王八蛋就會叫喚讓 tg 管制物價。可是誰造成的通脹？你們他媽為了自己增值資產玩命催著 tg 印，印完就不要臉的讓 tg 管。最無恥之極！總之自己要占到所有，那最後就注定失去所有。\n\n18，​你們不要去徒勞管老頭們死去活來的。因為 tg 就沒有打算讓他們活到下次開放，你花光了治療費，也無非就是拖死活人罷了。生了二胎才是新的你國力量，才能唯 tg 所有。\n\n19，tg 放開了讓你們買黃金的唯一目的就是讓你們幫他以民間方式留存的。他非常清楚，你們會完璧歸趙的。很多人都不知道你國有貴金屬管制條例這個法律。這個法律好像建朝代的時候就有了，只能進不能出。2014 年我在你國偷偷增持黃金的時點時就說過了。你國想人民幣國際化，想抗衡美元必須加強人民幣金本位制。這幾年來，tg 除了自己買，還有你們幫忙買進去。\n\n20，當 tg 的控制力不足以讓這麼多人吃飯的時候，美帝會配合你國幫他減少人口的。我一直在告誡你們，不要把美帝想得多好。如果戰爭是配合戰爭的話，tg 依然是下次開放的引領者。協議都是談出來的。\n\n21，跳下去，黨完民好。不跳，黨好民完。其實跳與不跳，1949 年的時候就已經有了結論，而不是現在需要抉擇的問題。很多人知道在走山路嗎？其實不是不知道。為何還麻痺自己呢？因為他們發現仍然面對著懸崖的方向倒退走，但是並沒有轉身跑。不能繼續麻痺自己的原因則是轉身的那一剎那。而轉身時離懸崖已經遠了\n\n22，美帝用在非洲黑鬼和南美褐鬼身上的經驗教訓總結下來，就是一句話。當人們物質基礎豐富後，精神追求就會提高到相應位置。他們太自信之前的成功了。美帝試圖把這種成功應用於你國。可是他卻完全失敗了。他根本無法想像你國人的物質基礎提高後，精神追求依舊。不能說誰錯了，只能說錯誤總有代價。\n\n23，​2004 年到 2007 年，美國已經試探並試圖間諜手段確認你國不會遵守 WTO 的規定。於是於同年籌備 TPP 等新貿易體系。說今後不可能排除你國於世界貿易的人其實很意淫，美國準備了長達 10 年時間，加之美國處於新周期的復甦期，你國處於舊週期的衰退期。任何一個國家都不會犯傻逼站隊錯誤。\n\n24，你國人根本就無法以國際通用的美元計價法來評估自己的身家。首先，身家是現金及即時兌換財產。其次，你國人只有 5 萬美元折合的人民幣可以作為合法評估對象。超出的部分皆為非法評估。\n\n25，你每掙 10 美元,，應得 8 美元報酬，tg 拿 2。tg 不給你美元，給你 64 元人民幣。同期恩格爾係數 40%。當現在掙 8 美元，tg 仍拿 2 美元。給你 40 元人民幣。假設物價不變，恩格爾係數是多少呢？但是物價變了沒有？好像變得不多，真實應該變得很多。你的生存成本的提高，是以用自體抗毒性來平衡的\n\n26，你們和 tg 都是沒有節操的人，所以劇本就是已經一起寫好的。如果說非要說出一個對錯的話，你們似乎並不懂一個簡單的事情，不論市場派還是計劃派，就好像超市買了很多東西，右手累了換左手，左手累了換右手，目的就是把吃的提回家。你的問題是問我，你覺得哪隻手提著舒服些？\n\n27，我發現你們幾乎都真的不懂傾銷是個啥？為啥要傾銷？傾銷對你們的影響更是不知道。難怪一個個窮逼。\n\n​1978 年剛開放不存在傾銷，工人吃饅頭產奶，白鬼子享受，那時不需補貼。隨著外儲的增加，工人不吃饅頭了，進口西方產品來消耗外儲。鬼子需要想買更多廉價貨，需要配合印更多錢來買。貿易量增加。當外儲增速等於消耗增速後，即出口成本增速將大於出口增益。商品即失去優勢。為維持收益平衡，必須減少成本。\n\n​如何減少成本？政府為了維持出口價格低於同類產品，則使用補貼。補貼為本幣。補貼的幣虛空印出的。回流國內金融和商品市場將造成通脹。通脹則造成出口商品本幣價格上漲，人工上漲。對出口更加不利。故，需要伊拉克蜜棗來集中消化多印貨幣。以前是三大件，而後是房子。這時候宣傳就配合了。你們一直是豬。\n\n​房價高企後，其蜜棗效率降低，無法吸收長期以來的超發貨幣時，那麼通脹將散佈到其他行業。哪些行業被迫要作為新的蜜棗呢？房裡面吸收的貨幣兌現到商品市場中，但是匯封了。無法用來平衡外儲。那麼這 30 年積累下來的超發貨幣足以讓你們的物價漲 20 倍都不止。我告訴你們，任何一個傻逼政府，包括他媽美帝在內。都不會愚蠢到讓你媽的蜜棗裡面餡跑出來！就是爛，生蟲子，都他媽得爛在裡面。\n\n​28，羅素定律是白鬼子的定律，就像西方經濟學一樣。別把白鬼子的事情當成真理。ok？他們定義人的概念與中國定義人的概念不同，完全不同。\n\n29，你國被迫閉關後，一定會讓之前留在外面的特務搞事。然後鬼子就會遷怒整個華人圈。我能預見到會反華，所以讓你們離华人團體遠一些。\n\n30，​你們知道為何發達國家只有百分之一點多的經濟增長率就不錯了，而你國就可以 7% 嗎？\n\n31，外匯市場向民間開放！？你當尼瑪逼 tg 是傻缺？30 年就那麼多純利潤黨產，還給？那 1949 年後的那些老人們的退休金和這 30 年的鮮榨剩餘勞動力就白榨了！反正都他媽已經挨完罵了，還了也不會給他道歉的。只有大傻逼才會還！\n\n32，​很多人並不懂 tg 是如何解決每次惡性通脹的積留問題的。若干次成功的解決方案給了我們很多啟示。第一，如果利用的 1945 年的國民黨經濟危機。第二，如何解決 1949 的惡性通脹。第三，如何解決 1986 年的惡性通脹。然後，再看 2016 年的怎麼解決。似乎很少有人關注過自己或者其他人的勞動報酬是否保留過。\n\n33，​假設明年開始歐洲從底部非常緩慢的爬升，那麼就會發生另外一件事。我說過，歐美一旦進入下一個週期的第一階段復甦期，就會採取保守政策穩固並發展本國勞動力市場。並且他們將鎖緊開支增加收入的手段為主。這也是為何帝國主義一定會貿易同盟的原因，最大限度上的保護各方利益並妥協。不過圈外的可就。。。。\n\n34，​你們總是恐懼閉關。其實中國到今天這地步，是你們把 tg 給逼的，可不是他自己想的。他想緊縮不，想。可是一緊縮，生活水平一下降，中國人裡一群和東方鬥士和西方鬥士就跳出來鬧了。他政權就不保了。他憑啥縮？這他媽現在拖不了了，好歹要止了外面的罵，才能解決裡面的罵。\n\n35，無論 tg 裡面誰在位，唯一的結果都是拖時間。這一點上即便退回到 2008 年，依然還是這個決定。那個決定是經過各方論證最合適當時的決定。就好比你現在的工作，你再不滿意，也依然在做的原因是你暫時沒有更好的選擇，而那個工作就是你當時最好的選擇。\n\n36，你國人其實蠻好笑的。最為體現貪婪的地方就是在這個週期點的運行上面。你明知道按照時間運行下去的結果就是失去財富，所以不願意。你明知道不失去財富就有可能斷掉與外界的聯繫，買不到享受的商品。這就應了那句話，你支持的恰恰是你反對的。如果說什麼可解決這個矛盾？那只有恐龍特級克塞號了！這就好比，龜頭磨多了，敏感性就下降了，越來越爽了。你包皮一直不割，想勃起，又怕越疼，又想勃起，又忍著。目前的選擇是留著，好歹忍的是雞巴。並不是所有時候都需要它硬。\n\n37，全世界都是中國的，滿意了吧？以前有一個，叫鐵木真。雖然漢族也是被侵略，可惜自己管他叫元朝，爽！\n\n38，​其實都在計劃內。一句話，沒有中產就沒有可能讓資本主義邪惡苗子長起來。\n\n39，論配與不配的你國人都想過配的人的日子。所以你們可以堅持幾十年當驢而無怨言。你賭的是一個不變的承諾，而這個承諾是 tg 給的。有點幽默，你即希望他守約，又希望他毀約。更幽默！\n\n40，我一直堅持你國不可能按照西方模式的經濟學完全運行。其實有一個很重要的原因是，奉為經濟學之父的亞當斯密本身自己也是基督徒。他們在假設人的時候，是以自己的認識作為基礎前提的。可以說整個西方經濟學大體上就是一部基督徒的經濟學。\n\n41，通脹也是你國人自己推高的。tg 的執政合法性就是讓你們過得好。但是這個標準被你們無限放大了，因為無恥。可曾有人想過 14 億人都他媽過西方鬼子的生活，地球是啥樣嗎？沒有。當發現不能的那一天只有兩個選擇，一是搶，二是忍。人民幣國際化就是搶，白鬼子坐以待斃嗎？別人怕你，是嗎？\n\n42，因為這群弱者將來是下一個朝代的主子。就這麼簡單。動物園的動物並沒有把自己當動物看，而飼養員想法不同。動物自己的扭曲造就了變態。\n\n43，​你國人的無恥啊，簡直天下都找不到。你國人的道德評判對或者錯，可以一秒鐘內就變 180 度。只和自己利益有關係。道德和無恥就這麼容易。為何我說你國人比 tg 還壞？因為他媽 tg 好歹一直無恥，你國人的道德和無恥也許連自己下一秒是什麼，自己都不確定。\n\n44，你國根本不存在合法收入一說。你國除了掃大街的以外，其他人都是靠著灰色收入活著的，收入多少的區別。別說你打工的你沒有，你老闆不他媽逃稅，你也拿不到那麼多工資。這裡還不包括虛報收入購房的騙貸款的雙重罪的傢伙們。沒人配說自己道德，ok？\n\n45，GDP 等於消費加投資。投資減少，消費必然需要增加。但是，唯一可以讓你國人被迫花錢的方式就是通脹！別無他法。tg 已經開始咯！\n\n46，你國有人，可惜不是你。非趙以外皆是豬，包括你。\n\n47，我說過，你國會一直通脹到死，死人的死。死就是見血。見血後歸於無限沉靜。\n\n48，如果把你國看成一個公司，那麼就是國有企業是生產技術部門。非趙私企基本上都是出於流通領域，解決了不少的就業機會。但是並不意味著缺少銷售員就無法完成運轉。因為技術部和生產部能拓展。\n\n49，一個企業主在遇到經營困難屬於外部環境引起的問題時，首先去掉花錢的部門和人員，留著掙錢的。再差，就去掉銷售人員，留著銷售主管。去掉出納由會計兼任。再差，自行管理成本部門，留下有銷售渠道的主管，讓主管去跑外。最後就是關鍵技術人員回家待崗。2015 只是第一步開始。\n\n50，​白鬼子預計的是今後因為環境食品問題會導致很多很多你國人死在醫院不過我預計死之前，錢也給醫院了。，因為都是化療那種。。。醫療的作用是吸收一家人的存款和人命的，自然很重要。\n\n51，​還有一件事，別太吃驚，未來高考要被取消的哦！拍照留念吧！\n\n52，從 1978 年開始到現在，你或者你的家人把暫時的改革開放作為了你國，這個無產階級專政國家的唯一方向。我覺得你才可笑之極。任何一個智商正常的成年人都只會利用這短期的開放讓財富積累並使人和財富安全離開。在我眼裡，沒有做到的與豚無異，賺到而不離開的與豚無異。怎麼拿來的，就怎麼還回去吧！\n\n53，你們有個誤區在。樓根本只是蜜棗而已，之前自行車電視縫紉機也是蜜棗而已。當你回頭看三大件是多麼平常的事情。你今後對舊的蜜棗也是同樣感覺。你從來沒想過這東西居然申請就可以了。這個時間過程裡，有樣東西是一直在消耗的，那就是你的勞動力。tg 真正佔有是你這麼長時間以來的勞動，而你不覺得你值錢。\n\n54，​有人問我關於高考報志願的事情。怎麼說呢？我只有一句話，不建議報考 985 和 211 那種。愛信不信，別問我原因，不會說。\n\n55，你國是不可能的。目前這 30 年來的既得利益者通過矬子設計的分配模式，獲得了巨大收益。想通過私有化這種合法手段把已得財富安全的留下來。這是可以理解的。但是你國政體是無產階級專政，是社會的主力人群。有產階級不可能將帶血的分配遺傳下去的。\n\n56，​經常你國人坐在你國意淫世界的時候，有兩個重要缺陷，一是思路無法與鬼子想通，只能按照自己看書看電視的理解去想像。二，是沒有真實的長時間的接觸機會。即便是留學生都不行，因為白鬼子的殼在小學畢業就開始形成了，而不是你國的上大學後。綜上所述，其實你國人一直意淫而自娛自樂。\n\n57，我對香港有三個預言。第一，這次經濟危機後，香港完全回歸。第二，港幣與美元脫鉤。第三，未來港幣還將消失。\n\n58，​美帝國主義可不是誰上台就可以改變國家長期策略的。這就像我說的，你們不能罵包一樣，他只是在做什麼的時期做他該做的事情，誰上台沒區別。\n\n59，​遺產稅早於房產稅。\n\n60，​tg 在這段自我解決的時間內，必須做到減少人口。否則無法適應再次開放與資本主義接軌以獲得下次閉關後維繫的資本。目前的情況是人口多，且需要支付的養老金多，年輕人少，創造價值的少。必須使人工成本降低下來，也就是收入降低下來才行。這需要很長一段時間才行，適應得越好，人死夠，開放越早。\n\n61，我告訴你，gm 想都不要想。吃了豬狗的底層能挨很久餓。等餓的不行了，下次開放就來了。tg 要做的事情就是拉長這個時間挨到與資本主義國家過剩同步時間點。開放後的豚就是 1978 年的豚前輩。之前那 10 年就忘了，懂嗎？你們是豚，別拿自己不當個豚樣，可以嗎？\n\n62，你在開什麼玩笑？tg 怕通脹！？只有傻 x 才說得出這種話。舉個例子，以前你吃 5 個包子飽，你現在的錢只夠吃 4 個的。你會鬧嗎？你不會。再下去，你只買得起 2 個，你會鬧嗎？你不會。因為還有人只能吃一個。這叫通脹。什麼叫通縮？你以前吃 5 個飽，現在你失業了，1 個都他媽買不起。懂嗎？\n\n63，你國不止有 WG1.0，2.0 和 3.0。你國的豚不死光，就會一直 10.0 下去。記著，你國的豚包括除真趙以外的所有人。誰死都叫淨化！\n\n64，​實際上全世界的底層都是短視的，因為底層畢竟知識有限，資金有限，且人數眾多。資本主義國家通過談判妥協解決問題。你國可不會哦！你國玩的是通殺，不是上層通殺底層，就是底層通殺上層。換一個朝代也是如此。不過，臘腸確實找到了一個解決之前朝代都沒有找到的好辦法。\n\n65，希望川普上台的人基本上全是打工仔。為何會這樣？發洩情緒而已。資本主義國家的本質是為資本家服務。共產主義國家則一定是以無產階級穩定為己任的。無論之前看上去多麼協調，在關鍵時刻都不會選錯。就好像我說人在錢和命之間不會選錯一樣。川普要麼上台改變，要么學肯尼迪。但肯尼迪也是被自家人咔嚓的。\n\n66，​這裡（欧美）中學就要學哲學，被認為是大學理工科的基礎。大學繼續學。你國有幾個理工科的學校讓這個成為必修課的？沒有幾個吧？知道為何嗎？因為他媽學完以後，就管不了啦！\n\n67，​你們期盼已久的安樂死快合法了。\n\n68，你國一直都是法制社會。只是和你想的法治不同，你國是王法。\n\n69，知道為何公檢法要查微信朋友圈嗎？因為你的言論與孩子的升學掛鉤的。\n\n70，​奴隸的扭曲在於奴隸努力希望奴隸主能對自己好一點。可是現在你都能接受了，給我一個理由奴隸主為何要對奴隸好一點？奴隸主並不扭曲，扭曲的是奴隸。\n\n71，今後這 30 年就是磨滅你國人慾望的 30 年。在經濟發展到讓別人有被吃掉的恐懼感後，就遇到了瓶頸。強烈的擴張預突破瓶頸唯一的方法就是戰爭。只要你和 tg 都支持，那就 OK。如果你們都不支持，那麼老老實實回到原本的樣子去。\n\n72，俺說過，如果按照之前的食品安全法執行，那今後你國的所有食品企業都會倒閉，包括店鋪，餐館那些。無論它怎麼改，必須把屎說成糧。你們才可以快樂的活下去。\n\n73，​我關於你國退市的預言中，終極的那個是外星人的公司。因為你國的互聯網企業都要回國的，由不得他們。所以這和智商沒關係，和雞巴在誰手裡有關係。讓我們一起眼見為實吧！\n\n74，樓凍是一個過程。房貸 + 必需品消費 + 非必需品消費 = 總收入。總收入下降，最先造成非必需品消費下降。現在店鋪不停倒閉就是實例。非需品消費消失，就剩下兩個了。由於信用法規定，房貸不可少，那麼就壓縮必需品消費。壓縮這個消費就個體差異很大了。當最慢必需品消費到最低程度的人出現，量變就質變了。\n\n75，需求少了，物價就不漲了嗎？物價與貨幣發行量成正比關係，你他媽需求不需求有雞巴用。以前你可以去 KTV 消費，你老闆也可以去。現在你收入少了，你老闆也收入少了。你他媽艹不了小姐了，就代表你老闆也不能了嗎？KTV 要活著，消費的少了，他他媽不漲價，他活得下去嗎？\n\n76，我好像沒有說過跌房價吧？房子只要還是商品的一天，他就只能隨著貨幣引發量的方向走。一切商品都一樣。只是每一種商品的漲價的導數有很大差別而已。房子會一直漲到它不是商品為止。\n\n77，由於漲價導數的差別很大。在收入遞減的時期，人的消費偏好就隨著總收入的變化，分配比例會發生變化。這個變化的時間點就在 2016 年 10 月。那麼繼續隨著總收入的下降，很多人將會很糾結得發現自己已經對土豆有著很深的依賴了。\n\n78，​明年憲法將修改回公有製為絕對主體，現在的可不是這麼寫的。\n\n79，我一直重複說的話，今後是一個即熟悉又陌生的中國。你們慢慢會開始體會的。不過呢，銀行歲月靜好婊要領先你們嚐嚐什麼叫物價飚升與收入銳減並行。\n\n80，房子不需要成交，也可以漲。只要地王不停出，政府的評估價就會不停漲。你需要成交嗎？\n\n81，就像我預言過並兌現的這句話，你們將遇到收入下降和物價上漲發生在同一時期一樣，我也預言，你們將跪舔求 tg 收回你們的商品房。看看啥時候兌現。\n\n82，在一個和諧社會中，大部分人在錢和命之前選擇，都不會選錯。但是當出現在錢和命之前選錯的人越來越多的時候，這些人就不正常了。他們團結的規模程度決定了臨界點在哪裡。\n\n83，​換幣這件事有人做過了，金三哥哥。但是換幣要成功的唯一關鍵就必須在一個完全閉合的系統裡進行。那麼現在所做的一切就有了非常重要的意義。這是保今後幾十年政權的唯一方式。如果 tg 不傻，他只能照著我說的走。\n\n84，評估價僅僅是用來交稅的你交完稅，隨便你低賣多少錢。銀行按照他媽市場價評估你的抵押品價值。少了你得補。不補查封你。你想扔了不要，對嗎？好，首付沒有了，銀行拍賣的的價格與抵押物價格的差，銀行對你有無限追索權。2016 年才更新了法規，就他媽你孩子剛出生都他媽得繼承債務。信用法為誰頒布的？你以為 tg 比你傻，不知道你們想把房子扔給銀行嗎？我告訴你們，只要你在你國一天，tg 讓你生不如死。\n\n85，我說過今後是盆地裡只有人民幣的時期。你們不要意淫什麼因為 X 權，美帝或者歐盟會對正常貿易和 tg 在當地的商業行為進行干擾，或者查封。tg 在外的形象很好，寧可虧錢也不虧信譽。這說明 tg 知道怎麼和商人打交道，並不是不知道。關鍵飼養員需要對牲畜守什麼承諾嗎？商人只對真金白銀感興趣，奴隸買賣也一樣。\n\n86，​中国的教育本身就不是培养人才的地方，就是为了培养奴才而设立。\n\n重点学校培养好的奴才，所谓的差学校培养的差奴才。\n\n为什么国家重理轻文，不是领导傻，领导聪明得很。学文科的哪里有学理工的好管？\n\n为什么教育要从小抓起，不是小的时候聪明，是因为小的时候背就够用了，就认为是真理了。君不见所有竞赛级的歌曲都是爱国歌曲？\n\n送出国吧，你的孩子不一定能成为人才，至少还是能成为人，而不是高级或者低级的奴。\n\n87，国内的奶粉不含三氯氰胺是不可能的，因为生产包装过程中的工艺造成的。\n\n这种工艺源于国外几十年前的工艺，您说这东西吃了会适合现在的孩子吗？\n\n我们的奶粉除了出口到非洲，没有地方要。对了，现在连非洲都不要了。\n\n88，今後會發生兩種情況，一，TPP 完成後你國被孤立出世界貿易圈。二，你國自己退出 WTO。當時俺是不知道 tg 會選擇哪一個的，只能等待驗證。不過呢，現在知道你爺選擇了最有骨氣的那個，而且還給了時間表！[哈哈][哈哈][哈哈][哈哈][哈哈] 好嗨桑！\n\n89，你們不懂什麼叫談判和妥協。你國就沒有這種東西，你也沒被教育過什麼叫談判和妥協。因為你父母都不會對你那樣做。別沉浸在意淫的世界裡。缺少了你國的市場，白鬼子不得不集中市場，不是他想不想，是他被迫這樣做。ok？\n\n90，我再重複一次我在推特上的話。只要包爺想將一擼一呆進行到底，那麼一定要讓綠綠的地位比漢人高。否則想都不要想！目前看，包爺做得不錯。我很開心！\n\n91，說出來很殘酷，但是如果人口不減少，你國離世界發展的腳步就越來越遠了。努力活得比別人久，才是今後幾十年的座右銘。\n\n92，房價是誰炒作起來的？中層和本不是中層的底層傻 B。tg 控制了沒有？控制了。市場失控誰造成的？也是他們。今後流血的是誰？也是他們。你覺得為了讓自己受害的這些人，底層會去和 tg 鬧？\n\n93，你說什麼，我都信。就是早飯這條我不信。tg 從 2008 年就著手預防變顏色了。你的同胞還買房呢現在。你去早飯嗎？你不去。你指望別人去嗎？誰去？吃不上飯的人嗎？別人他們放著高檔小區不去要，非去 tg 大門口和條子幹嗎？你有人性嗎？\n\n94，一個小姐在 KTV 裡面叫公主，在炮房叫，在會所叫技師，在他媽家裡叫樓鳳。做的事情一樣嗎？好像都是援交吧？\n\n95，不要和我說幾十年以後的事情。我還說 200 年後地球爆炸呢！和你我有個雞巴關係。我就說現在現在可能嗎？不可能。明天可能嗎？不可能。後天可能嗎？每天都不可能，就是一年不可能。包爺只是希望你做夢，但是你自己做得更香。\n\n96，不論是從歷史角度，還是從 tg 執政角度，大量的死人都是這次閉關不可推卸的歷史進程。只能說，在這個線路上，tg 要做的是符合歷史發展的事情。所以我堅持到現在只希望讓你們知道，活著的肯定不是多有人性的，有情懷的肉不夠分的。\n\n97，按照常理，其實任何一個受過教育的你國人都應該知道你國不可能發展工業革命 4.0 的。但是為何你們執意覺得可能呢？即便沒有消息確認，你們也應該知道的。\n\n98，你覺得你會永遠有 5 萬額度嗎？你有 5 萬額度也不過是從 2007 年才有的。如果不是為了讓美帝再對你國有點信心，多掙點外匯。 tg 早就封了匯了。你有 5 萬額度該感謝美帝，可不是 tg 哦！\n\n不能說課稅猛於虎。白鬼子在你國絕大多數都是不敢逃稅的。不是他不想，而是逃走的時候怕惹麻煩。你國企業之所以敢偷稅漏稅，那是 tg 包庇的，讓你們活著幫忙賺外匯的。可是現在外匯賺不到了，tg 自己可就缺錢了。你們所有人把灰色收入當成了理所應當的收入納入消費規劃了哦！到底是誰先違法的哦？\n\n99，離岸 + 購匯風險 = 黑市價。我說過官方價今年不過 7，明年不過 8。但是，黑市價，無極限。\n\n100，你以為 tg 現在不想合法的幹掉你嗎？你們他媽拿著本不該拿的獎金，分紅，各種灰色收入在缺錢的包爺面前晃，真是膽子大到天上了。還在用之前的灰色收入離婚的方式賺更多 tg 的利益。呵呵！人可以無恥，但是如果人無知且無恥。那就必然無錢。黨費也是從 08 年開始補的。為何會這樣？只有一個理由。那麼就是從那以後多出來的錢都必須塞回 B 裡去。我要看的就是這出好戲。我倒要看看是你們跑得快還是它塞得快！[哈哈]\n\n\nhttp://blog.sina.com.cn/s/blog_3c82e7a60102wg84.html",
			"image": "",
			"added": 1521342281,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 2,
			"title": "中国的经济就是一个旁氏骗局",
			"body": "靠人口红利骗下去，不停的印钞票，靠人口的增长稀释通货膨胀带来的恶果。直到有一天被迫进入这场骗局的人无法再增加时，就开始杀中层管理人员，中层杀完再杀下一层人员，一层层杀下去，直到清光。而老年人，中年人，有钱人，干的 久的国企领导人，都是他们想要除掉的对象。",
			"image": "",
			"added": 1521343921,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 3,
			"title": "今天朋友告诉我，他的孩子要考试了。很辛苦学习，孩子根本没时间出去玩，这还是一个 3 年级的孩子。他说真的不明白为什么要让孩子这么辛苦。这问题问得好啊，为什么要让孩子这么辛苦呢？如果孩子不辛苦，则会发生什么事情呢？那一定有时间去博览群书了，还有时间去丰富自己的文化知识。这是某些人不愿意看到的事情。一旦孩子读对自己真正有用的书，那么被篡改过的东西就很难填入孩子的脑袋。教育的根本目的就无法达成了。",
			"body": "今天朋友告诉我，他的孩子要考试了。很辛苦学习，孩子根本没时间出去玩，这还是一个 3 年级的孩子。他说真的不明白为什么要让孩子这么辛苦。这问题问得好啊，为什么要让孩子这么辛苦呢？如果孩子不辛苦，则会发生什么事情呢？那一定有时间去博览群书了，还有时间去丰富自己的文化知识。这是某些人不愿意看到的事情。一旦孩子读对自己真正有用的书，那么被篡改过的东西就很难填入孩子的脑袋。教育的根本目的就无法达成了。",
			"image": "",
			"added": 1521345056,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 4,
			"title": "你们要小心“看不见”的敌人",
			"body": "为什么有这么多人生病，自杀，是因为有人/有组织在阴险的害人，你们看不到而已。这个世界“病”了，你们要小心“看不见”的敌人。",
			"image": "",
			"added": 1521352036,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 5,
			"title": "李敖居然去世了？？？",
			"body": "R.I.P",
			"image": "",
			"added": 1521363217,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 6,
			"title": "我们和中共迟早必有殊死一战。你不杀死中共人员，中共人员必杀死你！（ZZ）",
			"body": "回复 ⋮ \n\n王炳章博士是海外民运的先驱，也是对中共有本质认识的比较清醒的民运领袖，主张以武力推翻中共的极权制度。和彭明、袁红兵、辛灏年的观点比较一致。认为中共不可能良心发现进行自我变革，只有革命才能实现共和。而以所谓刘晓波为首的改良派把希望寄托在中共内部能出现蒋经国上，实际上是为了掩饰中国民运大部分人不想牺牲而梦想实现共和的懦弱本性。这个幻想随着刘晓波的死亡而破灭。曼德拉甘地的和平理性非暴力是面对英国这样的文明国家。面对斯大林早就见阎王了。脑残的口号。89坦克车一压，你们就和平理性非暴力了。这不是二逼逻辑吗？中共一看暴力好用，一镇压就理性非暴力了。10个和平奖也抵不上锦州监狱的高墙电网。看看中共的维稳文件，你们永远保持这样的口号是最好的，为什么绑架和重判王炳章，彭明这些主张武力推翻中共的人就明白了。今天人群，看到王炳章先生的头像非常有感触，王炳章先生83年就在海外举起反对中共极权制度的大旗。89后，跑到国外的人现在看基本上没有成绩，白白浪费了64英烈的鲜血。愧对64英烈的在天之灵。苟活于海外。",
			"image": "",
			"added": 1521392007,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 7,
			"title": "윈도우에서 tor 쓰는 법 좀 알려주세요.",
			"body": "여기 저기 대충 읽어보긴 했는데, 다들 리눅스 설명 뿐",
			"image": "",
			"added": 1521418382,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 8,
			"title": "윈도우에서 tor 쓰는 법 좀 알려주세요.",
			"body": "",
			"image": "",
			"added": 1521418403,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 9,
			"title": "여기 저기 대충 읽어보긴 했는데, 다들 리눅스 설명 뿐",
			"body": "",
			"image": "",
			"added": 1521418423,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 10,
			"title": "윈도우에서어보긴우에저기 대충",
			"body": "다들",
			"image": "",
			"added": 1521430339,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 11,
			"title": "No body here?",
			"body": "It's so lonely.",
			"image": "",
			"added": 1521447958,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 12,
			"title": "中国现在是要消灭中产阶级",
			"body": "",
			"image": "",
			"added": 1521454601,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 13,
			"title": "感觉国内的生活环境越来越差",
			"body": "昨天吃了个火锅，吃的肚子痛，难受死了",
			"image": "",
			"added": 1521455192,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 14,
			"title": "lonely are lonely, 这个论坛就是没人发言，为啥只有GFW人气汪点",
			"body": "",
			"image": "",
			"added": 1521455328,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 15,
			"title": "美高官指中国与市场经济背道而驰 停止经济对话",
			"body": "美高官指中国与市场经济背道而驰 停止经济对话\n\n\n美国财政部高级官员星期天在20国集团财长会议上批评中国经济在偏离市场方向，并因此搁置两国经济对话。川普政府官员在总统计划宣布针对中国强迫美国公司转移技术的应对措施前夕，还呼吁其他国家和美国共同应对中国在经济变革方面拖后腿的行为。\n\n负责国际事务的美国财政部副部长戴维·马尔帕斯星期天在布宜诺斯艾利斯参加主要经济体财长会议前夕表示，川普政府对中国“感到失望。”\n\n马尔帕斯说：“因为没有一条回头向市场方向的路径，我停止与中国进行经济对话。”\n\n不过，马尔帕斯透露，财长努钦和中国高层官员私下有频繁通话，敦促中国将经济重心转回到自由市场资本主义。他说：“我们正在做的事情当中，有一项就是尽力保持公开的交流线路。”\n\n该官员说，即便在美方对中国国有企业影响力不断增大表示关切时，也会保障沟通管道的畅通。\n\n美中间的最高层经济对话机制始于小布什政府时期。当时的财长保尔森将经济对话从战略对话中分离，并由财政部负责。美中战略与经济对话在奥巴马政府时期得以延续。但川普就任总统后，不再依照原模式继续与中国进行对话。\n\n2017年4月，习近平和川普在海湖庄园会晤时，川普对习近平表露出强烈的个人好感。两国首脑首次会面，也使双方经贸紧张关系得以缓解。外界有分析认为，川普对中国态度出人意料地发生转变，或许是希望寻求习近平在朝鲜核危机问题上提供帮助。\n\n川习会期间，美中同意在接下来的一百天时间里，双方官员坐下来找出两国间的贸易存在的问题，并在这个“百日计划”结束时，双方高层进行对话。川普政府将与中国间新的对话机制称作“美中全面经济对话。”\n\n7月中旬首届美中全面经济对话在华盛顿开幕时，双方已经板下脸各说各话。原定一天的对话不欢而散，双方没有举行联合记者会，也没有发表联合声明。中方后来说那次对话取得成绩。但川普政府显然没有得到中方在一些关键问题上的承诺。纽约时报在今年初的一篇报道提及了解那次失败对话内情者提供的情况。该消息来源说，中国在“百日计划”期间提出了几项承诺，包括恢复进口美国牛肉，以及开放信用卡公司和评级公司进入中国市场等。但美方经过调查，发现中国所作出的承诺，许多其实在前几届政府期间已经做过承诺，却一直未兑现。美方为此感到不快，认为中国一再说要通过对话商讨分歧，其实是借此拖延时间，把问题无限期地拖下去。\n\n美中新的对话机制崩塌之后，川普政府加紧了针对中国的贸易行动，例如商务部经由正常程序接受美国厂商投诉立案，自启动立案，对中国的产品进行反倾销和反垄断调查（“双反调查”）的数量远超出前几届政府进行的“双方调查”数量。\n\n美国还公开表示不承认中国的市场经济地位。去年，中国加入世界贸易组织（WTO）满15年时，认为依据最初入世所签的协议应该自动获得市场经济地位，但美国和欧盟当时都表示中国不是市场经济，强调了中国政府在经济活动中扮演过重角色，扭曲了市场。\n\n中国将美欧双双告上世贸法庭，中国诉欧盟案仍在听证审理中。针对美国的诉讼或在欧盟案结后开始。\n\n接近岁末，川普政府开始动用尘封已久的国内贸易法规对一些进口商品进行调查，包括依据1974年贸易法第201条款对进口太阳能电池板和大型家用洗衣机损害美国本地产业的调查，依据1962年贸易扩展法第232条款就进口钢铝影响美国国家安全的调查，以及根据1974年贸易法第301条款就中国强制外国公司转让技术，以及窃取知识产权进行公平贸易方面的调查。\n\n动用国内法意味着绕开世贸争端解决机制。川普政府对多边机制缺乏信心，抱持疑虑。批评者担心，川普的行动对二战以来主要由美国支持建立起来的全球贸易体系造成打击。\n\n川普首先就201条款调查采取行动，决定对基本由中国进口的太阳能电池板，以及大多是三星和LG两家家电巨头生产出口到美国的大型家用洗衣机征收惩罚性关税。\n\n川普一周前透露将对进口钢铝全面征收关税后，已经造成全球性的震荡。批评者担心没有选择性地征收关税，将对美国的重要盟友造成损害，例如在美国进口钢铝中占比最高的加拿大，以及墨西哥等国。川普预计近日会就232条款钢铝进口调查发布详细的行动方案。但这个周末，各方利益游说机构和个人云集华盛顿，赶在最终决定发布前，希望得到豁免等优待。\n\n本周，川普政府预计将会就中国强迫美国公司转让技术等知识产权侵犯问题进行的301条款调查宣布报复方案。过去一个星期，白宫官员和顾问已经在多个场合透露了总统将采取的行动方式，即将每年美国因知识产权被盗用而损失的约3千亿美元，反映在对进口自中国的大量商品将征收的关税总和。另有消息透露，关税总额或翻一倍，达到6千亿美元。\n\n此前，在中国已经达到权力登峰习近平为了缓和川普政府的不满，在2月份连派两名政治局委员赴美救急。2月上旬，国务委员杨洁篪的两天华盛顿执行没有取得成效，中方随后说美方同意进行对话。两周后，习近平最重要的经济智囊刘鹤带一众代表赴美。行前双方分析都看重这位曾在哈佛受过教育，对习近平的经济理念有影响的经济学者再度上阵。\n\n刘鹤展开华盛顿谈话的首日，川普在白宫出乎众人意料，宣布了他决定对进口钢铝全面征收25%和10%的关税。川普执意作出这样决定，导致其国家经济顾问委员会主任科恩辞职。目前决定尚待生效，但已经开始显现其对现有全球体系形成前所未见的深刻影响。\n\n接下来的301条款行动方案出笼，几乎可以肯定中方将采取报复行动。各方担心，川普就301条款调查结论作出的决定，最有可能演变成一场贸易战。\n\n尽管川普总统和白宫的贸易官员认为美国可以轻松赢得贸易战，或者不至于造成很大伤害，但川普政府的贸易官员也并没有放弃在现有的机制内采取行动。美国已经联合日本和欧盟，针对政府干预经济和产能过剩问题联合采取行动。\n\n星期天，财政部副部长马尔帕斯表示，中国政府对经济干预日益严重，加之习近平的取消任职限度，这两方面动向“令世界感到忧虑。”\n\n这位负责国际事务的副财长说，中国日益强化政府对经济的控制，对于各国，对整个世界都不是好事，会不断造成麻烦。\n\n马尔帕斯在当天的国际金融研究所会议上致辞时，吁请各国关注中国造成的问题。他说：“我们邀请全世界对此加以认识，中国也需要从商业上加以认识，并朝自由和市场为导向的方向走。”\n\n马尔帕斯批评中国投资法规对外国公司设限，“令世界在中国投资异常艰难。”他称中国的投资环境“不可操作”且不具互惠性。但是他没有提及川普将针对中国窃取知识产权采取什么样的关税行动。\n\n来源：美国之音\n作者：萧洵",
			"image": "",
			"added": 1521505913,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 16,
			"title": "中亚峰会排除俄罗斯和中国引关注",
			"body": "中亚国家十多年来第一次举行了没有中国和俄罗斯的峰会，这为未来实施“大中亚”项目打下了基础。有分析认为，中国的“一带一路”在中亚政策可能面临挑战，俄罗斯则担心会被边缘化，与此同时，中亚国家更多面向美国。\n\n中亚重要活动 中俄首次缺席\n\n几个中亚国家领袖几天前在哈萨克斯坦首都阿斯塔纳举行了13年来第一次峰会。中亚领袖聚会过去通常都有俄罗斯，或是中国，或是中俄两国元首参加，因此这次没有中俄参加的中亚峰会格外引人注意。峰会上讨论了中亚地区未来发展。\n\n面对中国 统一立场\n\n新疆问题，能源进口，以及“一带一路”项目使中亚地区对中国十分重要。尽管这次中亚领袖们强调峰会仅带有磋商性质，没有实际动作，但未来中亚国家在面对中国时是否将以共同立场发声引人关注。\n\n一些俄罗斯中亚问题学者说，中亚各国目前都在相互竞争，试图从“一带一路”项目中更多为自己争取到投资和好处，未来这些中亚国家在“一带一路”项目上是否将协调立场也值得关注。\n\n整合离不开钱 中国新机会\n\n也有分析认为，中亚各国现在开始整合，需要金融和经济方面的支持，因此离不开中国，或许会给中国提供新的机会。\n\n比如，乌兹别克斯坦和吉尔吉斯坦开始走近，乌兹别克官方银行决定为财政非常拮据的吉尔吉斯提供1亿美元贷款，乌兹别克有如此雄厚财力可能与中国资助有关。去年5月乌兹别克总统访华时，双方曾签署了100多份文件，总金额能达230亿美元。\n\n普京顾不上中亚 俄担心被边缘化\n\n俄罗斯一直被媒体称作是中亚领袖。俄罗斯也把中亚当成自己的传统势力范围和后院。这次中亚峰会把莫斯科排除在外，俄罗斯担心在未来建立所谓的“大中亚”过程中自己可能被边缘化。\n\n中亚问题学者杜波洛夫说，乌克兰、叙利亚、西方制裁、与美国对抗、与英国交恶，普京的麻烦一个接一个，俄罗斯现在已经顾不上中亚。他认为，与西方关系现在已经成为俄罗斯的有毒资产，中亚国家不想与处在西方制裁下的俄罗斯过于走近从而影响到这些国家利益，或是妨碍这些国家与美国和欧洲发展关系，因此这次中亚峰会没有邀请普京。\n\n对俄不信任有戒心\n\n俄罗斯吞并克里米亚，以及入侵乌克兰东部也让中亚国家感受到了俄罗斯的威胁，它们害怕自己可能会重复乌克兰的命运，因为在中亚各国中，不但有很多亲俄势力，同时也有很大的俄语系居民聚居区，特别是与俄罗斯相接壤的哈萨克斯坦北部地区，当地俄语系居民非常集中，这些因素都会成为俄罗斯对中亚各国施压的工具，因此中亚国家希望同俄罗斯保持距离。\n\n中亚国家同样对普京亲自推动的欧亚经济共同体项目充满不信任和戒心，认为俄罗斯以这一项目为掩护，实际上对中亚扩张，因此这次中亚峰会特别讨论了各国之间如何进一步加强合作。\n\n角色如同德法 中亚火车头\n\n这次中亚峰会由乌兹别克和哈萨克两国推动组织。峰会召开前，乌兹别克总统米尔济约耶夫频繁穿梭访问中亚各国穿针引线。许多媒体评论已把乌兹别克斯坦和哈萨克斯坦当成中亚的两个火车头，这两个国家正在扮演类似欧盟中法德两国的角色。\n\n乌兹别克新总统米尔济约耶夫执政后立刻与邻国塔吉克斯坦和吉尔吉斯重新修好。吉尔吉斯去年大选新领导人执政后，吉尔吉斯与哈萨克的关系也重新升温，这些因素也促成了这次中亚峰会召开。\n\n乌兹别克改革 更活跃参与国际事务\n\n除了土库曼斯坦外，中亚各国间未来将实行免签证制度。与此同时，乌兹别克斯坦正在进行一系列改革开放行动，包括让外国游客能更容易拿到签证，削弱类似克格勃的乌兹别克秘密警察的权力，对外汇的管制也将放松。\n\n乌兹别克也试图代表中亚地区在国际舞台上扮演更重要角色。几天后将在乌兹别克首都塔什干举办阿富汗问题国际会议，乌兹别克对邻国阿富汗一直拥有很大影响。联合国秘书长、一些国家元首都将出席这次会议。美国已表态支持。相比之下，俄罗斯去年也曾主办过阿富汗问题国际会议，但并未获得国际社会的普遍支持。此外，乌兹别克总统也计划很快访问美国。\n\n更面向美国 中美待遇截然不同\n\n哈萨克斯坦也同样加强同美国关系。纳扎尔巴耶夫总统1月份访问美国，并会晤了川普总统。哈萨克还决定单方面给予美国公民免签证待遇。俄罗斯外长拉夫罗夫借口哈萨克是欧亚经济共同体成员，对哈萨克让美国公民签证入境表达不满，但哈萨克官方回应说，这是哈萨克主权。\n\n与此同时，一名中国高级外交官几个月前抱怨说，一方面哈萨克欢迎“一带一路”和中国投资。另一方面，中国商务人员去哈萨克办理签证却非常困难。\n\n在美国支持下，土库曼斯坦正推动建设一条从土库曼经过阿富汗到巴基斯坦最后可能抵达印度的天然气管道，这一项目将有助于推动阿富汗和平进程。\n\n中俄仍是主角 美国不会袖手旁观\n\n哈萨克学者萨特帕耶夫说，哈萨克等中亚国家内部同时害怕中国和俄罗斯威胁，既有反俄罗斯，也有反中国势力。他说，中国和俄罗斯，以及周边中亚国家是哈萨克外交首要方向。\n\n萨特帕耶夫说，俄罗斯同中亚各国关系正常，与哈萨克和吉尔吉斯的关系最好，中亚各国中吉尔吉斯最亲俄。美国通过土库曼和乌兹别克影响中亚，美国不会对中俄在中亚的活动不闻不问和袖手旁观，而中俄两国仍然将在中亚舞台扮演主要角色。\n\n中国仍有很大活动空间\n\n萨塔帕耶夫认为，特别是中国目前在中亚所处的位置非常有利。\n\n萨塔帕耶夫：“与其他国家有些区别的是，中国在中亚仍然占有优势，活动空间更多一些，因此中国同中亚各国的关系都很好。”\n\n哈萨克、乌兹别克、吉尔吉斯、塔吉克的总统，以及土库曼议会领导人出席了这次中亚峰会。\n\n来源：美国之音\n作者：白桦",
			"image": "",
			"added": 1521506027,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 17,
			"title": "八十年代初（ZZ）",
			"body": "八十年代初，为了对抗毛的潜藏势力，邓大力推行了几年的反思浪潮，因此有了难得的言论自由，所以懂的人会买八十年代初出版的书，那时是有很多讲真话的作家的。",
			"image": "",
			"added": 1521763565,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 18,
			"title": "Because when disease came",
			"body": "Because when disease came, only the persons that believe and obey the Six Rules could be followed and be helped. From now go to find out your brothers, get these people who believe and obey the Six Rules to be your friends,come together, this would help you greatly in the end of the world.",
			"image": "",
			"added": 1521772311,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 19,
			"title": "From now following the Six Rules",
			"body": "From now following the Six Rules, one by one, spread this idea to your realiate and friends. Found out these people who has the same idea with you, breathe with eachother and decide with eachother, the other people coulde not be best friend.",
			"image": "",
			"added": 1521772345,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 20,
			"title": "http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/",
			"body": "http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/\nhttp://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/data/img/post_14_9.jpg",
			"image": "",
			"added": 1521772846,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 21,
			"title": "google可以收购kopykate big了。祝贺kopykate big的开发者，你们发财的时候到了。（ZZ）",
			"body": "一收购，油管就进入中国了。google也不用向中共祈求了。\nhttp://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"image": "",
			"added": 1521819051,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 22,
			"title": "man-made avian influenza, pneumonia, pulmonary fibrosis, depression and ALS are \"social disease\", \"government disease\", \"middile age disease\". ALL of them are made by people of \"ghost\".For some persons, be careful of drink/eat and enviornment of living could help you to be well.For sicked persons, they need best friends could be trusted and guard their sleep for each other. Only these could help you for well from the \"sicked\" situation.",
			"body": "man-made avian influenza, pneumonia, pulmonary fibrosis, depression and ALS are \"social disease\", \"government disease\", \"middile age disease\". ALL of them are made by people of \"ghost\".For some persons, be careful of drink/eat and enviornment of living could help you to be well.For sicked persons, they need best friends could be trusted and guard their sleep for each other. Only these could help you for well from the \"sicked\" situation.\n抑郁症，ALS，肺纤维化等稀奇古怪的病都统称为“社会病”、“政府病”，“中产病”，都是有人在作祟，轻的注意饮食，生活环境就能改善，严重的只有找可信赖的人相互为对方守夜才能治疗这些病。只要找到可信赖的人相互为对方守夜就能慢慢好起来。",
			"image": "",
			"added": 1521855340,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 23,
			"title": "然教弟子： To My Surer: （ZZ）",
			"body": "1.燃尽天下一切罪恶。 1. Burning the world, To Be Sure.\n2.不吃药，不去医院看病治疗。 2. Do not eat medicine, Do not go to hospital, Do not take any test.\n3.与同袍见面时不带任何电子设备。 3. When you meet your brother of Sure, Do not take any electronic set.\n4.不吃少数人才吃得到的东西。 4. Do not eat any things only few people could get.\n5.不要相信教外人士，相信你的导师。5. Do not trust any body not of Sure, Trust Your Master.\n6.不得陷害同袍，否则千刀万剐。 6. Do not fake your brother of Sure, otherwise Cut you into parts.\",",
			"image": "",
			"added": 1521868233,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 24,
			"title": "人民币和日元，美元的比例将达到100：10：1（ZZ）",
			"body": "人民币和日元，美元的比例将达到100：10：1，那将会是在很多年以后。而现在，日本也将迎来大萧条。",
			"image": "",
			"added": 1521868305,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 25,
			"title": "中国将进入大萧条（ZZ）",
			"body": "中国即将进入大萧条，人民会发现钱一大堆却花不出去，粮食堆积如山却无人敢吃，商品堆积如山却没人敢买，社会动荡不安，人心分崩离析。",
			"image": "",
			"added": 1521868328,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 26,
			"title": "年轻人的迷茫（ZZ）",
			"body": "中国最便宜的东西是最好的，国外是越贵的东西越好。努力花钱，不存钱，有钱就去享受。不要买贵的东西，买便宜的。因为中国有群半人扮鬼的东西在害人，你为什么这么努力还这么迷茫，就是因为他们。不除掉他们，中国永无宁日。有他们在，年轻人有危险，中年人有危险，老年人更是有危险。\n\n从现在开始，不吃药不看病，因为现在中国的环境只会让你越治越病，急性病治成慢性病，因为医生护士有动力去这么做，他们根本不关心病人死活。现在冒出来许多稀奇古怪的病，就是政府了吸我们的血而特设的。不交税或少交税，因为交的税都成为 他们维稳的动力，监控我们的经济来源!",
			"image": "",
			"added": 1521868393,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 27,
			"title": "六条规则（ZZ）",
			"body": "1.燃尽天下一切罪恶。 1. Burning the world, To Be Sure.\n2.不吃药，不去医院看病治疗。 2. Do not eat medicine, Do not go to hospital, Do not take any test.\n3.与同袍见面时不带任何电子设备。 3. When you meet your brother of Sure, Do not take any electronic set.\n4.不吃少数人才吃得到的东西。 4. Do not eat any things only few people could get.\n5.不要相信教外人士，相信你的导师。5. Do not trust any body not of Sure, Trust Your Master.\n6.不得陷害同袍，否则千刀万剐。 6. Do not fake your brother of Sure, otherwise Cut you into parts.\",",
			"image": "",
			"added": 1521868469,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 28,
			"title": "日语版 http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"body": "日语版 http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"image": "",
			"added": 1521868653,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 29,
			"title": "人还是太少了",
			"body": "消息传播不顺畅，人和人都这么封闭，其实是画地为牢，因为你的信息政府有啥是不知道的？人们互相蒙上眼睛，却向政府敞开了胸怀。",
			"image": "",
			"added": 1521870356,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 30,
			"title": "标  题: [公告] 关于撤销仲裁部及相关服务调整的通知（ZZ）",
			"body": "【 以下文字转载自 Announce 讨论区 】 \n 发信人: SYSOP (System Operator), 信区: Announce \n标  题: [公告] 关于撤销仲裁部及相关服务调整的通知 \n 发信站: 水木社区 (Wed Mar 21 10:14:08 2018), 站内 \n  \n         鉴于客观形势的转变，现撤销本站的仲裁部。 \n  \n         原有仲裁部成员卸任。感谢本站历任仲裁的辛勤工作及对本站做出的巨大贡献。 \n  -- \n※ 来源:·水木社区 newsmth.net·[FROM: 水木社区]",
			"image": "",
			"added": 1521906857,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 31,
			"title": "标  题: [公告] 水木社区站务人员调整（zZ)",
			"body": "【 以下文字转载自 Announce 讨论区 】 \n 发信人: SYSOP (System Operator), 信区: Announce \n标  题: [公告] 水木社区站务人员调整 \n 发信站: 水木社区 (Wed Mar 21 11:09:37 2018), 站内 \n         \n         站务 XiaoNan 任满卸任 \n  \n         在任时间：2015.6.6-2018.3.20 \n  \n         衷心感谢其在任期间的大量辛勤劳动，并祝今后学习进步， \n         身体健康，生活幸福。 \n  \n  \n                                           水木社区站务委员会 \n                                               2018年3月21日 \n  \n-- \n※ 来源:·水木社区 newsmth.net·[FROM: 水木社区]",
			"image": "",
			"added": 1521906921,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 32,
			"title": "知道什么内幕，说说吧 (ZZ)",
			"body": "-- \n           ┌┼╮─╮┌┐┌─┐┌┌  ┐┐╭─┐┌╮┌─┼─┐  ┐┌─┐          \n            ┌┼╮  │││├─┐└┼┬┼╯├─┐├┐┌─┴─┐┌┐ ┌┐           \n ╰───┐   │┌─╯││╯─┐┌─┼─┐│  │╯│  ┌  ┐  ╭┤┌┬┐          \n            │││  │││┌─╯┌─┴─┐│  │┐│┌┴┬┴┐│├│││          \n            │├╰─╯│││  ┐│      │├─┤╰│┌─┼─┐││├┼┤          \n           ╯┴──╯└╯└─╯└───╯└─╯─╯    ┘      ┘└┴╯",
			"image": "",
			"added": 1521907256,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 33,
			"title": "标  题: LG K9在俄罗斯发布：搭载骁龙210",
			"body": "LG K9在俄罗斯发布：搭载骁龙210 \n 2018年03月24日 22:13 386 次阅读 稿源：快科技 0 条评论 \nLG \n在MWC2018展会上，LG推出了入门新机K8，现在它终于在俄罗斯亮相。3月24日，据GSMArena报道，LG在俄罗斯推出了这款新机，不过命名变成了LG K9。外观方面，LG K9背部配备单摄像头，指纹识别位于其下方，摄像头和指纹识别模块之间是单色温闪光灯，整体设计没有太大亮点。 \n  \n  \n配置方面，LG K9并没有采用时下流行的全面屏，而是一块5.0英寸16:9 IPS显示屏，分辨率为1280×720，搭载高通骁龙210处理器，配备2GB内存+16GB存储，支持存储卡扩展，拥有前置500万+后置800万像素摄像头，电池容量为2500mAh。 \n 售价方面，LG K9的价格是9990俄罗斯卢布（约合人民币1100元），性价比并不算高。",
			"image": "",
			"added": 1521907324,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 34,
			"title": "日本语 http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"body": "http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"image": "",
			"added": 1521908166,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 35,
			"title": "http://127.0.0.1:43110/lastone.bit/",
			"body": "http://127.0.0.1:43110/lastone.bit/",
			"image": "",
			"added": 1521908371,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 36,
			"title": "中共反腐 为什么越反越腐（ZZ）",
			"body": "中共假恶暴，社会乱了套，妓院遍城乡，男女胡乱搞，贪官如强盗，百姓活不好，坏人做大爷，好人遭残暴。国立于民，官来自民。每一个国民，都是组成国家的一分子；每一个百姓都是养活官员们的衣食父母。政府害民是害国家，官员害民是损自己。一切有着正常思维的政府和官员们，他们都不会草率地对百姓实施暴力。政府爱民才是真正的爱国，官员爱民才是真正的好官。中共和它的贪官们能做得到吗？中共是最不爱国的，它不但不爱国，反而处处祸国殃民。从它窃政六十多年来，每搞运动都要害人杀人，富人穷人都难幸免，一次次地大伤国家元气。中共为什么要这样呢？因为它是西方入侵中华的邪灵魔鬼。它与中华民族没有任何血脉关系，与中国人民没有任何感情。它是与天地神佛和世间一切正义对立的，所以它大肆破坏传统文化，否定中华五千年文明，并企图消灭我们的祖先，用无神论和斗争哲学毒害中国人民，处处给民族和国家制造灾难。《共产主义的终极目的》一书，彻底揭穿了中共的邪恶本质和其毁灭人类的终极目的，并指明中华民族只有彻底解体它，抛弃它，才能走向未来。中共毁灭人类的前奏，就是让社会道德全面败坏，首先以贪腐淫乱让官场堕落，把一个个贪官们培育成道德极其低下的流氓，五毒俱全，十恶全占，带动整个社会道德崩溃，最终招致天谴，使中华民族坠入灭顶之灾。扫黄，而中共最黄，它滋养着一个庞大的卖淫队伍，逼良为娼，逼良为盗，催化着人伦道德败坏，建造了一个笑贫不笑娼的黑浪滚滚的社会。打假，而中共最假，它的“伟光正”是假的，它的爱国是假的，它的亲民是假的，它的法律是假的，它的宣传是假的。它把应有尽有的假货物、毒食品打得如漫天飞雪，铺天盖地融入人们的日常生活中。它向来对中国人和全世界人都是口是心非，善恶颠倒，黑白混淆，它的媒体每天都在用谎言欺骗着民众，给民众洗脑，并引导着人们说谎、撒谎。现在大陆人普遍张嘴就是假话。",
			"image": "",
			"added": 1521908755,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 37,
			"title": "标  题: 年入100万，在北京也就是个刚脱贫的水平？",
			"body": "有11位用户评价了这篇文章：\n\n[  ]msy00:一个个都装逼吧(2018-03-24 09:23)\n[-5]tmall:真TMD扯蛋(2018-03-24 09:42)\n[  ]chainbreaker:年入100万刚脱贫，年入10万的是不是算要饭(2018-03-24 12:16)\n[  ]preposition:这就是个别家版主妇的所剩不多的信息渠道。(2018-03-24 12:36)\n[  ]mafana:正常，大多数人就是不敢承认自己穷，要我说，5000万起算小康(2018-03-24 12:55)\n[  ]smsq2018:挣100万非要过200万的生活能不累吗？(2018-03-24 12:58)\n[  ]friendliu:大土豆就是一个烂蛆(2018-03-24 13:02)\n[-5]marsair:这个土豆就是房市吹上去的猪，风停了得下来(2018-03-24 17:29)\n[+1]sfyxwbsl:据说这B在办班招脑残粉给tg接盘，LZ可以花钱报名(2018-03-24 18:09)\n[-1]liano:哭穷划胖的言论层出不穷(2018-03-24 18:16)\n[+5]muroi:这货不就是一吃软饭起家的么，啥时候这么著名了？(2018-03-24 18:59)\n",
			"image": "",
			"added": 1521909366,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 38,
			"title": "台湾旅行法内容（ZZ）",
			"body": "![图片](http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/data/img/post_32_9.jpg)",
			"image": "",
			"added": 1521910033,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 39,
			"title": "http://127.0.0.1:43110/1NLFg344SMHsMMNZayCYcTvY4RStC7ELWX/",
			"body": "http://127.0.0.1:43110/1NLFg344SMHsMMNZayCYcTvY4RStC7ELWX/\n\n然教弟子：\n\n1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。\n\n3.与同袍见面时不带任何电子设备。\n\n4.不吃少数人才吃得到的东西。\n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。\n\n燃烧你心中的怒火，你会知道这世间的罪恶是什么，用你的怒火焚烧它！\n\n以我为导师，严格遵守这六条，你就是然教教徒，线下宣传这六条，宣传我说的这些东西，星星之火可以燎原，让更多的知道，我们身边原来都是这样的人在掌控着我们的生活，电视媒体，医院医疗医药，警察保安高利贷，一起都不是看上去那样的。中国所有的东西都将被毁灭。\n\n同袍你好，怎么加入\n\n进医院是禁止的，捐精更加是罪恶! 为了你的人身安全不要做这些！这些都是陷阱！魔鬼的陷阱！\n\n同袍只要做到这六条，就不会是是罪恶，是不是罪恶每个人心里都很清楚。人的身体受之于天，不要让任何人碰你的身体。你会明白我说的一切。\n\n那么问题来了。如果同袍成了罪恶，要不要根据1燃尽一切罪恶呢，如此便违反6\n\n燃尽天下一切罪恶！",
			"image": "",
			"added": 1521911239,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 40,
			"title": "为啥zeroboard发文总是不容易成功？",
			"body": "有啥规律",
			"image": "",
			"added": 1521911427,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 41,
			"title": "常用的国产软件和APP:如输入法、杀毒软件、浏览器（QQ，360）、通讯工具（QQ、微信）等等都可能成为党国监控你的利器。善良的人们可要小心了！",
			"body": "常用的国产软件和APP:如输入法、杀毒软件、浏览器（QQ，360）、通讯工具（QQ、微信）等等都可能成为党国监控你的利器。善良的人们可要小心了！",
			"image": "",
			"added": 1521911470,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 42,
			"title": "标  题: 今天连看黑豹 古墓丽影 环太平洋，环太平洋最好看，景甜也有进步",
			"body": "英语好像也有进步。 \n-- \n  \n※ 来源:·水木社区 http://www.newsmth.net",
			"image": "",
			"added": 1521911933,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 43,
			"title": "标  题: 环太平洋与evangelion（剧透）",
			"body": "环太平洋与evangelion有诸多类似之处。evangelion是一部日本动画，国内曾经译制播放过阉割版（原版过于暗黑），翻译为:新世纪福音战士。这部动画讲述的是一群被称为“使徒”的外部入侵者和地球抵抗力量战斗的动画片。 \n  \n以下排列一些类似的地方: \n敌人 \n 环太平洋叫做先驱的东西差不多就相当于evangelion里的使徒，都是来自地球以外的入侵者，以消灭人类为目的，evangelion中使徒的入侵与末日审判相黏连，由于与宗教相关，因此来自空中，降落人间。环太平洋中的先驱来自外来文明，通过虫洞来到太平洋的海底，从海岸向地球人攻击。 \n  \n人类的抵抗方式 \n 都是采用机甲，驾驶员也需要通过精神同步来实现操纵，evangelion中对于驾驶员还有一项考核指标叫做同步率。差别在于，环太中的驾驶员需要两人一组或者三人一组的精神同步，而evangelion的机甲则是人与前代使徒同步。因为evangelion中的机甲是在前代使徒的基础上建造的，从零号机到后面各种的升级版本都是如此（做个类比就好比jaeger是以kaiju的基础上建造一样），操作好机器简单说就是要与前代使徒精神同步。 \n  \n基地 \nevangelion作为日本动画，基地就在日本，叫做nerv（神经元），有一个很帅气的徽章，存放机甲，培训驾驶员。环太的金主是万达控股的传奇影业，因此基地就在中国，实际上大量拍摄过程就是在青岛的万达影棚拍的（片中还有青岛啤酒的植入）。 \n  \n叛徒 \nevangelion中有一任驾驶员，是由使徒化身而成。而环太中，前代先驱的大脑精神入侵了地球科学家，并参与到了无人驾驶机甲的项目中，最终酿成了大祸。 \n  \n回忆 \n 由于精神同步的重要性，两部片子就驾驶员的回忆都做了一些探索，电影篇幅所限，描述得少，动画片大段的回忆是相当暗黑和压抑的一部分。 \n  \n吃 \nevangelion中有一段初号机吃使徒的片段是该片的经典。相传evangelion初期收视率堪忧，为了报复观众，画家头头决定加入极其恶心的初号机“暴走”并吃食使徒的片段，没想到因此大火（我印象中暴走这个词是不是也是从这里火起来的）。环太就比较怂了，是kaiju吃了一个jaeger。 \n  \n单纯凭回忆，没有仔细求证，先比较到这里。evangelion强于精神探索，环太强于战斗燃爆，各取所需。 \n-- \n※ 修改:·\n※ 来源:·水木社区 http://m.newsmth.net",
			"image": "",
			"added": 1521912292,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 44,
			"title": "标  题: 环2归来",
			"body": "打得挺过瘾，最后结局太草率，不够爽，有点一个陨石打死武林高手的意思 \n--来自微水木3.2.0 \n -- \n  \n※ 来源:·水木社区 http://m.newsmth.net·[",
			"image": "",
			"added": 1521912347,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 45,
			"title": "标  题: 环2比起环1差太多了",
			"body": "-- 爆\n  \n※ 来源:·水木社区 http://www.newsmth.net",
			"image": "",
			"added": 1521912502,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 47,
			"title": "能否贴图",
			"body": "###[img](http://127.0.0.1:43110/lastone.bit/data/img/post_11____5.jpg)\n<audio id=\"bgAudio\" autoplay=\"autoplay\" loop=\"loop\" controls=\"controls\"><br><br></audio>",
			"image": "",
			"added": 1521929525,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 48,
			"title": "http://127.0.0.1:43110/18fvHT5oGbS1KaeedGpQS4wr8eQ1QD36Dn/",
			"body": "http://127.0.0.1:43110/18fvHT5oGbS1KaeedGpQS4wr8eQ1QD36Dn/",
			"image": "",
			"added": 1521950979,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 49,
			"title": "张家瑞:",
			"body": "中国生产一双鞋成本100，卖国人400，出口到美国超市卖5美元。赔70元人民币，4千双鞋换回2万美元，赔28万人民币。用2万美元从美国进口一台车，到中国卖50万元。赚36万。中国没亏，美国也没亏，吃瓜群众亏了。结果美国人说这不合理，中国不是自由贸易市场。可笑的是吃瓜群众站出一片指责美国贸易保护……",
			"image": "",
			"added": 1521951322,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 50,
			"title": "他从国宴的奢华中发现了罪恶，",
			"body": "他从国宴的奢华中发现了罪恶，\n他从长城的宁静中感受到恐惧，\n他从故宫的古老中体会到腐朽，\n他从看唱戏中体会到虚假太多，\n他从和包子坐在一起感到耻辱，\n他决心站在尊严公义人权这边！",
			"image": "",
			"added": 1521951396,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 51,
			"title": "德媒：西方国家团结起来！大战已箭在弦上",
			"body": "本周五，美国开始对进口钢铁、铝材等产品征收高额关税，欧美、中美贸易战一触即发。周四的德语报刊，纷纷就此刊发头版社论。其中相当普遍的一个观点是：欧美之间不应对立，而应该携手抗争中共的不公正贸易手段。\n周四出版的《法兰克福汇报》刊登了由报社出版人施特尔茨内(Holger Steltzner)撰写的头版社论。题为\"与华盛顿并肩战斗\"的文章指出，欧洲必须避免激化与美国的贸易争端，而应寻求与美国合作，共同向中国要求对等待遇。\n作者接着指出，欧洲人的道德优越感毫无道理：美国对许多欧洲商品所征收的关税，实际上远低于欧洲对美国同类商品的税率。",
			"image": "",
			"added": 1521951448,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 52,
			"title": "北大现在有这么恐怖吗？（ZZ）",
			"body": "连基督教都不能聊了吗？\nCyan夕 说: 北大的朋友刚跟我说，她在食堂吃饭，旁边一桌几个人在聊基督教，然后突然来了四个警察把他们带走了⋯这是谁举报的？",
			"image": "",
			"added": 1521951508,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 53,
			"title": "牠們崇尚文革，是因為牠們在那段黑暗舊時中嚐到了人肉的美味（ZZ）",
			"body": "問：習近平的父親以及他的家庭在「文革」中都受過迫害，為什麼他還會這麼認同「文革」？\n答：認為受迫害的一定不認同「文革」看似有一定的道理，但實際上缺乏仔細的認證和研究，至少對習近平與「文革」的關係缺乏了解。2016年在洛杉磯開了「紀念『文革』50週年」的研討會，研討會上有一個像我這樣年齡的在美國做「文革」研究的學人，他說他最近去了毛澤東紀念堂，想看看紀念堂是什麼樣。結果他發現去的人絕大多數是像我們這樣年紀，現在都六七十歲的人。他說，我當時產生的一個最強大的感覺是兩個字：「父親」。也就是說毛澤東是我們這一代人的父親。不管你否定也好，不管你肯定也好，那是一個歷史的客觀存在。習近平就是我們那一代人，我們都是在「毛澤東思想的陽光下」長大的。比如，毛澤東詩詞我是可以大段大段背的。有趣的是在中國2013年紀念毛澤東誕辰會議上，習近平有個講話，他那個講話和胡錦濤的講話和江澤民的講話有明顯的不同是：他引用毛澤東詩詞七次。現在中國領導人講話，不大有人會引用毛澤東詩詞的，只有誰會呢？只有紅衛兵，這是我們那一代人的文風，是我們那一代人「文化大革命」時寫大字報的文風。所以雖然習仲勛是他父親，但他的精神教父是毛澤東。當時大多數人都是這樣，只不過我們現在反叛了這個父親，而習近平沒有反叛。\n\n問：為什麼他不會反叛？\n答：回答這個問題必須對習仲勛、習近平在「文革」中的遭遇有一個比較完整的了解。一個人對一場政治運動的態度，常常是要總體來看，即要看他在這個政治運動中間是得利多，還是受損多。就習近平來說，他是得利多，受損少。習近平在「文革」初期，就讀的是八一學校，北京的八一學校，是軍隊幹部子女的學校，這個學校有兩個特點，一是紈絝子弟多，一些高幹子弟在那裡不好好讀書，習近平是因為功課差才送進去的。 他和薄熙來不一樣，薄熙來讀的是北京四中，是全中國最好的中學，是考進去的。所以為什麼薄熙來看不起習近平，因為八一學校大家是靠父母關係進去的，不通過擇優錄取的考試。八一學校還有一個特點，那裡的人浮躁，喜歡用簡單粗暴的方法解決問題，「文化大革命」期間就是武鬥。聶衛平有一本回憶錄《聶衛平圍棋人生》，回憶了當年他與習近平和劉震上將的兒子劉衛平參加武鬥的事情。薄熙來是老紅衛兵，習近平實際上是紅小兵。\n「文化大革命」中他得了什麼利呢？「文革」開始不久，習近平下了鄉，下了鄉以後他在那裡當了農村的支部書記，很快工農兵推薦進了清華。進了清華以後基本上一帆風順。按照習近平的水平，能進清華嗎？「文革」前八一學校的畢業生很少能考進清華的。「文革」結束，他父親就被解放出來工作了。實際上，習仲勛在「文革」期間不是最主要的被整對象，最主要的被整對象是劉少奇這個系統的。習仲勛是高崗系統的。1955年高崗饒漱石事件，是劉少奇要整高崗，是劉少奇要整習仲勛，而不是毛澤東。「文化大革命」恰恰把劉少奇給打到了。所以，「文革」期間，習近平他們家受到的只是一般性的衝擊，沒有殘酷到家破人亡。劉少奇派系的薄熙來的父親薄一波不同，薄熙來的母親是被斗到自殺的。\n此外還有更重要的一點。薄熙來執政的時候，中國社科院政治學研究所所長房寧和薄熙來在四川有一個對話。薄熙來不是唱紅打黑嗎？薄熙來說了一段推心置腹的話。薄熙來說，我的家庭我的經歷應當和毛澤東是有仇的，但是為什麼我現在還是要搞這一套呢？我想了半天，覺得還是這一套能夠救中國。當然，所謂「救中國」云云這些都是官話都是假話，如果把這句話翻譯成他心裡話就是，還是毛澤東那一套能夠幫助我掌權，能夠實現我的政治野心。習近平也是一樣的，現在他高處不勝寒。怎麼掌權更方便呢？還是毛澤東這一套。所以我常開玩笑，要說「文革」是否真的結束了，只要看要看天安門上的毛主席像拿下來沒有。\n\n牠們崇尚文革，是因為牠們在那段黑暗舊時中嚐到了人肉的美味、鮮血的甘甜、權力的快感，於是乎牠們再也無法抗拒食人的滋味……",
			"image": "",
			"added": 1521951626,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 54,
			"title": "卢梭：”中国人引以为自豪的那种士大夫文明，从本质上说，如果不是脱离现实的，便是把人民培养成奴隶和乡愿的工具。你们中国的孩子不会说他们自己的语言，却会作一些几乎连他们自己也看不懂的诗。孩子们不仅没有学到区别真理与谬误的本领，反而学会了一套善于诡辩的技能，把真理与谬误搞混，使人分不清真伪。什么叫崇高，什么叫正直，什么叫谦和，什么叫人道，什么叫勇敢，他们全然不明白。",
			"body": "卢梭：”中国人引以为自豪的那种士大夫文明，从本质上说，如果不是脱离现实的，便是把人民培养成奴隶和乡愿的工具。你们中国的孩子不会说他们自己的语言，却会作一些几乎连他们自己也看不懂的诗。孩子们不仅没有学到区别真理与谬误的本领，反而学会了一套善于诡辩的技能，把真理与谬误搞混，使人分不清真伪。什么叫崇高，什么叫正直，什么叫谦和，什么叫人道，什么叫勇敢，他们全然不明白。\n\n卢梭针对的是自古以来的中国孩子还没有学会数数，便先学作诗。有人认为这是种族歧视！对自己这个没出息的族群进行深刻反省，这也是种族歧视，那么这个族群的内心脆弱到什么程度？！也难怪毫无建树，毫无人格上尊严。",
			"image": "",
			"added": 1521951664,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 55,
			"title": "man-made avian influenza, pneumonia, pulmonary fibrosis, depression and ALS are \"social disease\", \"government disease\", \"middile age disease\". ALL of them are made by people of \"ghost\".For sicked persons, they need guard sleep for each other.they need guard sleep for each other",
			"body": "man-made avian influenza, pneumonia, pulmonary fibrosis, depression and ALS are \"social disease\", \"government disease\", \"middile age disease\". ALL of them are made by people of \"ghost\".For sicked persons, they need guard sleep for each other\n抑郁症，ALS，肺纤维化等稀奇古怪的病都统称为“社会病”、“政府病”，“中产病”，都是有人在作祟，轻的注意饮食，生活环境就能改善，严重的必须找可信赖的人相互为对方守夜。严重的必须找可信赖的人相互为对方守夜",
			"image": "",
			"added": 1521952506,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 56,
			"title": "蔡奇是习包的狗（ZZ）",
			"body": "蔡奇是习包的狗，執行的是包帝的旨意。现在狗被打了，木有给主人留半点脸子。这事在毛时代是不可能發生的。只能說明：無论你有十个核心，把思想写入宪法与党章都木有用，一个一無政积，二无军功三无班底的所谓主席跟本就木有權威的。",
			"image": "",
			"added": 1521999192,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 57,
			"title": "网友的经典语录：你不说出真相也就算了，你还用虚情假意来欺骗下一代",
			"body": "不得不说说这几年移民出来的一些中国中/老年人，他们在西方享受着资本主义的福利，嘴里却唱着“社会主义好”！他们曾被时代辜负，却最后辜负了这个时代，用一生见证了那个制度的冷血和对良知的摧残，最终在晚年选择了远离，你不说出真相也就算了，你还用虚情假意来欺骗下一代乃至整个世界，这是一种犯罪！",
			"image": "",
			"added": 1521999688,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 58,
			"title": "一个日本网站：http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"body": "http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/\n有日本网友吗？",
			"image": "",
			"added": 1521999780,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 59,
			"title": "美国为什么获得大多数国家敬重",
			"body": "美国为什么获得大多数国家敬重，那绝不是偶然的。美国之所以长期坚持“干涉他国内政”，美国前国务卿赖斯曾这样回答：“我们就是要发出一个清晰的信息：国际社会将不会容忍犯下人道罪行的人逍遥法外。”这也是美国的普世价值观之一，善良，不仅包括对善良的追求，还包括对罪恶的惩罚！",
			"image": "",
			"added": 1521999913,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 60,
			"title": "当你沉迷于裸奔网络的“流畅”和虚拟空间自恋文化的“日常晒”时，你知道自己在做什么吗？",
			"body": "当你沉迷于裸奔网络的“流畅”和虚拟空间自恋文化的“日常晒”时，你知道自己在做什么吗？\n当你用高端的技术技能获得了人脸识别工程丰厚的研究经费时，你知道自己在做什么吗？\n\n可以毫不客气地称之为作恶。\n\n“不作恶”不是一句简单的口号，更不应该是油头粉面的宣传，它是道德感和正义感的实时鞭策，其基础是知识的充分和认知的敏锐。\n\n今日话题：《当 “不作恶” 成为空谈，“定制人”将终结民主》#deletefacebook #SurveillanceSociety #privacy #Internet #AI #bigbrother #censorship 当你享受着社交网络内容定制的“便捷”时、用自己的真实私人信息通过网络联系朋友时，你知道自己已经付出了什么吗？",
			"image": "",
			"added": 1521999971,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 61,
			"title": "联邦总管闻达失联（ZZ）",
			"body": "【联邦总管闻达失联】中华联邦临时政府总管闻贯达先生于2017年7月21被广东国宝遣送回新疆原藉后失联至今，请大家予以高度关注。也请东突厥斯坦共和国的军人就近予以营救。",
			"image": "",
			"added": 1522000128,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 62,
			"title": "计划生死（ZZ）",
			"body": "计划生死\n\n以前有计划生育，\n眼下有计划二胎；\n过得十五二十载，\n必来个计划死亡。",
			"image": "",
			"added": 1522000270,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 63,
			"title": "中国现在的政治（ZZ）",
			"body": "中国现在的政治，中国现在的人族，兽族，必须联合起来，共同对付“亡灵天灾”！",
			"image": "",
			"added": 1522000882,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 64,
			"title": "Russian style in murdering its enemies（ZZ）",
			"body": "Russian style in murdering its enemies is too wicked and brutal if survey all the cases. So is Chinese style.\n\nBoth communist governments are ruling the evil world. And the corrupted western politicians supported them. \n\nHuman-rules-human system is definitely doomed.",
			"image": "",
			"added": 1522042180,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 65,
			"title": "美國將在台設立:亞太第一個境外通關的國家!",
			"body": "有啥意义？可以直飞美国，落地后不用通关吗？\n",
			"image": "",
			"added": 1522042503,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 66,
			"title": "评价环太平洋2（ZZ）",
			"body": "中国人去美国拍了一部中国片给中国人看，然后大骂美国片情节俗套都是大烂片。",
			"image": "",
			"added": 1522044748,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 67,
			"title": "环太平洋1比2好看多了",
			"body": "1很成功的营造出了一种末日的氛围，加上爆燃的BGM，看着非常带感",
			"image": "",
			"added": 1522045376,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 68,
			"title": "国际组织批公安拥大数据资料库 侵犯人权如虎添翼 2017-11-21 分类：民主 阅读(155) 评论(0)",
			"body": "中国警方年中开始使用自行开发的大数据系统“警务云”搜集民众逾百项数据资料，国际人权组织呼吁停止使用，批评中国当局用此系统监控跟踪受针对的人士，严重侵犯隐私。有大陆维权人士指出，个人难以抗衡国家的侵权行为，希望国际社会继续关注。（海蓝　报道）\n\n总部设在美国的人权观察，研究员王松莲周一（20日）向本台表示，自大陆在各民生领域强制性推行实名制后，民众的身份证经常被要求在使用公共服务、甚至在私人公司服务上被查阅。此外，警方早已掌握民众的个人私隐的数据，包括节育方法，这些敏感私人信息，再加上各政府部门的信息，包括卫生部门的民众患病资料，都会收集在“警务云”内，该系统可以知道每个人很多的信息，包括你何时去过何处、住在哪里、跟谁关系密切等，该组织最关注是“警务云”其中一作用是监控7类重点人物，包括异见人士、访民及少数民族，以拦截其活动。\n\n王松莲说︰一个重要的功用是监控他们、跟踪他们去哪里或未来将去什么地方，去拦截他们未来可能会采取的维权行动。整个“警务云”不仅侵犯所有人的隠私权，亦包括尤其中国政府认为政治上威胁他们的这类人。\n\n她强调，大陆没有法例有效保护个人私隠不受政府侵犯，如果政府或警方要你的资料，你是没有任何保障，即使资料在私人机构，警方可以网络安全法向该企业取得，该组织觉得此举很危险，在缺乏完善个人隠私情况下，可以令中国在大数据系统下，严重侵犯个人隠私。\n\n江苏异见人士吴世民指出，他们去维权或上访时，警方什么数据都有，他们买车票时便被拦截，因为政府的电脑系统互相联系，他们一订旅馆便会知道，所以十九大之前，警方到他家找到他。他认为很难跟当局抗衡，只能掌握它的规律用方法避开。\n\n吴世民说︰下一次二十大比方说要来，你起码要早一个月潜伏，把手机号码换掉，最好身份证不要拿自己的，向亲戚或朋友借一个去买车票、租酒店，前题是亲戚朋友没有上访或异议纪録的人。\n\n他慨叹，大陆除了红二代、官二代享有人权自由外，老百姓没有隐私权利。\n\n山东维权人士张恩广则指，作为异见或维权人士，当局便会注视你，以前警方会知道你的家庭具体情况，以至上学时期的情况，他都掌握。他们可以以此作维穏手段，再加上现在的数据系统，当局不断加强系统，个人很难抗衡国家的机器，但可以由联合国及国际人权组织替他们作出抗议。\n\n张恩广说︰但是作为人权组织、作为公民也好，对于侵犯个人隠私这方面，我肯定有抗议。即使你抗议，他们也要收集，而且默默的收集，利用各种方式扣上一个帽子，就可以抓你。\n\n人权观察从大陆的招标文件、学术文件及研究，再配合之前在山东，江苏及天津的调查而作出分析，数据包括録像、照片及文字。该组织以山东威海巿的“警务云”为例，它聚集63项警方数据，以及来自各政府部门及私人企业共115种数据。",
			"image": "",
			"added": 1522090491,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 69,
			"title": "日本語掲示板(Japan)",
			"body": "http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/",
			"image": "",
			"added": 1522090753,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 70,
			"title": "The story that I met God （ZZ）",
			"body": "I was born not as a christian. Religions were destroyed by the communist party regime. But there is a old church which was built by foreigners before the communist party's ruling, it stands in the city center, but was expropriate by the government. One Sunday I saw a notice, that the Mass will be took place in the church (The Building was party return to the christian who unter the government's control). Then I went in and listened the Mass. \n\nOn the end all the people knelt to pray. I knelt too, but I was not a christian. So I said to God in my mind:\"God, if you really the God, the ruler of our universe, please give me a sign.\" \n\nOn Monday, I was visiting a company, a begger, who looked very old and weak, came inside and said:\"I'm very hungry, please give me some money for buying food.\" The other reprimanded him to go out, but I said:\"Don't reprimand him, I'm giving him money.\" Then I went out and gave him some money. He said:\"Thank you very much!\", I answered it's nothing to thank. \n\nSuddenly he looked not thin and weak anymore, but very strong, said:\"You are my brother. you are my youngest brother.\" I didn't understand why he talked like that. Then he suddenly knelt and said:\"I return your kneeling, I return your kneeling.\" I couldn't stop him, because he was so forceful, then I knelt to him too. He looked me in the eyes very deeply. I understood it then, that he is giving me a sign.",
			"image": "",
			"added": 1522090829,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 71,
			"title": "上海市公安局23日又改口称，现阶段不注销国外定居者的户口。",
			"body": "13日上海市公安局发布规定，定居海外绿卡拥有者必须注销户口，引发海外华人强烈反弹。23日上海似乎公安局又在官方微博发布消息称，现阶段上海公安机关对出国定居人员不注销户口。前后截然不同的表态，可能是海外华人的强烈舆论压力，导致上海当局态度发生改变。此外，北京大西洋社区3月20日发布通告，要求居住在该社区的归侨、侨眷、留学生和海归等人员到社区登记。通告还称，这是根据望京街道办事处的要求而做出的。\n\n上海市公安局3月13日发布「上海市常住户口管理规定」，5月1日起实施。当中规定经批准赴港澳定居，或自行取得港澳台居民身分，及出国定居或加入外国籍的居民，未来需注销上海市常住户口。\n\n这项新规锁定拿了「绿卡」但没有入外籍的这部分中国人，公布后引起海外华人的抗议，担忧自己将丧失上海户口。\n\n海外中文媒体世界日报22日报道，来自上海的洛杉矶执业律师李斌表示，入籍和居留权是两回事。加入美国籍后应该注销原居地上海户口，因为当事人只能效忠于一个国家。但拿到绿卡享有国外永久居留权，不能等同于本人改变国籍，依然还是中国公民。\n\n如果一个人被注销了上海户籍，但同时又享有中国国籍权，这不是很矛盾吗？所以，不能因为有人拿了美国绿卡同时又拿上海低保，实行“一刀切”，这对没有拿上海“低保”的绿卡侨民不公平。\n\n在大陆社区知乎网、上海宽带山等社群，有网友说，此举〝说明中国正在控制资本外逃，继续推出控制人口外逃政策〞，也侧面体现〝中国上层外逃现象相当严重〞。\n\n消息传出后，引发许多海外华人担忧。不少人提出疑问，〝虽然我持有外国‘绿卡’，但一直在上海生活，也要注销户口吗？〞〝这条规定是否意味着要在‘绿卡’和上海户口之间二选一？〞",
			"image": "",
			"added": 1522090973,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 72,
			"title": "政府在用特务的手段对付他的老百姓",
			"body": "政府在用特务手段对付他的老百姓，无所不用其极。以后生病的人会越来越多，目的就是为了转移经济危机。",
			"image": "",
			"added": 1522091033,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 73,
			"title": "From now following the Six Rules, one by one, spread this idea to your realiate and friends. Found out these people who has the same idea with you, breathe with eachother and decide with eachother, the other people coulde not be best friend.Because when disease came, only the persons that believe and obey the Six Rules could be followed and be helped. From now go to find out your brothers, get these people who believe and obey the Six Rules to be your friends,come together, this would help you greatly in the end of the world.",
			"body": "From now following the Six Rules, one by one, spread this idea to your realiate and friends. Found out these people who has the same idea with you, breathe with eachother and decide with eachother, the other people coulde not be best friend.Because when disease came, only the persons that believe and obey the Six Rules could be followed and be helped. From now go to find out your brothers, get these people who believe and obey the Six Rules to be your friends,come together, this would help you greatly in the end of the world.",
			"image": "",
			"added": 1522130679,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 74,
			"title": "从现在开始遵守这六条规则，循序渐进，向你的亲戚朋友宣传这种思想，寻找那些与你有同样思想的人，与他们共同呼吸进退，其他人都不可深交。因为到灾难来临时，只有同样信仰这六条规则的人才能依靠，互相救助。现在就开始寻找你的伙伴，寻找同样相信这六条并坚决执行的人，相互成伴，将在末世来临时给你极大的帮助。",
			"body": "从现在开始遵守这六条规则，循序渐进，向你的亲戚朋友宣传这种思想，寻找那些与你有同样思想的人，与他们共同呼吸进退，其他人都不可深交。因为到灾难来临时，只有同样信仰这六条规则的人才能依靠，互相救助。现在就开始寻找你的伙伴，寻找同样相信这六条并坚决执行的人，相互成伴，将在末世来临时给你极大的帮助。",
			"image": "",
			"added": 1522130700,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 75,
			"title": "俄罗斯知名记者索洛维约夫问：当世界头号坏蛋是什么体验？",
			"body": "普京笑答：你可以去问那些坏蛋。 节目播出后，该记者的中国签证被注销。 记者致电中国大使馆询问原由，得到答复：接下来你要去采访谁，你以为我们不知道吗？",
			"image": "",
			"added": 1522174491,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 76,
			"title": "Kim Jong Un meets Xi Jinping",
			"body": "A walking meme, indeed.. just like his ginger twin.\n \nYou know one thing I like about Kimmy, though? Nobody fucks with a nuclear country.\n \nIn my opinion ... the more weapons of mass destruction, the better. Either we all cooperate as a species, or we all go to hell.\n \nI like that idea.. love it. Cheers to the Meme kings!",
			"image": "",
			"added": 1522214214,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 77,
			"title": "《纽约时报》披露海航二号人物王健的弟弟在美国豪买高尔夫球场等投资活动（ZZ）",
			"body": "《纽约时报》披露海航二号人物王健的弟弟在美国豪买高尔夫球场等投资活动。这篇报道试图揭示一个现象：与海航债务压身难以喘息不同，陈峰、王健的私人公司仍然有源源不断的资金流入。一边是中共向海航输血，一边是巨量资金流入他们私人腰包",
			"image": "",
			"added": 1522215023,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		},
		{
			"topic_id": 78,
			"title": "http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/",
			"body": "http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/",
			"image": "",
			"added": 1522235832,
			"parent_topic_uri": "12_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L"
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"6_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 1,
				"body": "海外的都不敢发文还谈什么？",
				"image": "",
				"added": 1521392141
			}
		],
		"8_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 2,
				"body": "주의사항: Always Enable Tor Mode로 시작할 경우, 인터넷 끊긴 상태에서 같은 공유기 공유하는 내부 컴퓨터들끼리 통신이 안 되는 문제가 있으니 그때는 Disable Tor Mode 선택해서 재시작 해야 함.",
				"image": "",
				"added": 1521418493
			},
			{
				"comment_id": 3,
				"body": "주의사항",
				"image": "",
				"added": 1521418533
			},
			{
				"comment_id": 4,
				"body": "Always Enable Tor Mode로 시작할 경우, 인터넷 끊긴 상태에서 같은 공유기 공유하는 내부 컴퓨터들끼리 통신이",
				"image": "",
				"added": 1521418554
			},
			{
				"comment_id": 5,
				"body": "인터넷 끊긴 상태에서 같은 공유기 공유하는 내부 컴퓨터들끼리 통신이",
				"image": "",
				"added": 1521418633
			}
		],
		"29_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 6,
				"body": "现在人们最大的敌人是政府，人民一盘散沙，在有组织、训练的政府面前就是菜，现在政府要害人，谁能挡的住？",
				"image": "",
				"added": 1521874995
			}
		],
		"74_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 7,
				"body": "1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。\n\n3.与同袍见面时不带任何电子设备。\n\n4.不吃少数人才吃得到的东西。\n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。",
				"image": "",
				"added": 1522130743
			}
		],
		"73_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 8,
				"body": "The world is falling, we need to burning the world, to be sure.\n\n1.Burning the world, To Be Sure.\n\n\n2.Do not eat medicine, Do not go to hospital, Do not take any test.\n\n\n3.When you meet your brother of Sure, Do not take any electronic set.\n\n\n4.Do not eat any things only few people could get.\n\n\n5.Do not trust any body not of Sure, Trust Your Master.\n\n\n6.Do not fake your brother of Sure, otherwise Cut you into parts.",
				"image": "",
				"added": 1522130780
			}
		]
	},
	"comment_vote": {}
}