{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1573768564_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "just because the file is hosted there doesn't mean they are endorsing it... this particular file is from the files recovered during the bin ladin raid.",
				"added": 1573768804
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1258_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Heh? That demands a story.\n\nNot at all. There were alot of crazy files in that archive. I've gone through most of them a couple of years ago.",
				"added": 1573768913
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_1259_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Well, we need better context. Point out solid evidence for it coming from the Bin Ladin raid. [...]\n\nhttps://www.cia.gov/news-information/press-releases-statements/2017-press-releases-statements/cia-releases-additional-files-recovered-in-ubl-compound-raid.html",
				"added": 1573769355
			},
			{
				"comment_id": 4,
				"body": "oh did it throw you off kilter that you and OBL agreed on something",
				"added": 1573769726
			}
		],
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "you're on to something -- we are always looking for meaning and if we don't find that we get its opposite\n\nWhat is the opposite of meaning?",
				"added": 1573771895
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "Individuals don't \"live\" on their own. Quarks don't \"live\" on their own. Atoms don't \"live\" on their own. It's the nature of life to coagulate into higher order structures -- molecules, family units, plants, solar systems, etc.... Fractal through and through\n\nNow -- it helps to pretend they exist as a mental exercise as a unit of analysis. Our brain can chew on smaller bites like that. But if you get hung up on the trees, then you're no longer a balanced individual.",
				"added": 1574002338
			},
			{
				"comment_id": 7,
				"body": "you're right but you're not right.\n\nto see the particulars and not see the universals is a form of lop-sided thinking that only our universities are capable of producing\n\nto see the universals and not the particulars is a form of lop-sided thinking that many religious conservatives fall into\n\nnow -- try opening both eyes at the same time to get binocular vision. To put everything in its rightful place",
				"added": 1574003835
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1137_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you can't be either one of them.either one or the other [...]\n\nThis is what I'm trying to explain to you. You are trying to say square root of -1 is invalid. I'm telling you that you're  right in one sense, but completely wrong in another. \n\nUnderstand!",
				"added": 1574019231
			}
		]
	},
	"comment_vote": {}
}