{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 1,
				"body": "Salut salut!\nHeureux de voir des contrib t411 ici =D\nNous en train de relancer t411 sur ZeroNet. Nous sommes plusieurs modos et gros contributeur de t411 à nous rassembler sur Wire pour en discuter. Je travail à commencer la base du site. Tout aide est la bien venu! Vous pouvez nous rejoindre sur Wire m'ajoutant: @pokapow\nJe vous ajouterais alors au groupe de discussion en question.\nSinon nous somme aussi sur l'irc t411 qui est revenu: https://search.mibbit.com/channels/t411\n#reloading",
				"added": 1498905538
			},
			{
				"comment_id": 3,
				"body": "On verra pour le système de ratio, le tracker sera bien sûre san pub et publique",
				"added": 1498921118
			},
			{
				"comment_id": 4,
				"body": "> [tested](#comment_4_18ts75nBNcXqWm6edB8pzn6Hr34JVUCrfx): Sauf que t411 c'est pas seulement un site, c'est aussi - et surtout - un tracker BitTorrent... Y'a déjà des sites de torrent anglophone sur le ZN, et c'est souvent des annuaire de fichier torrent, qui doivent de toute façon se connecter à un tracker bien centralisé. Si vous voulez du bon décentralisé, faut se tourner vers les magnet et/ou des trackers publiques, mais j'ai des doutes qu'on puisse surveiller le ratio des utilisateurs du coup.\n> En fait, le problème du ratio, c'est que ça impose du centralisé... Sauf mauvaise compréhension du protocole BitTorrent de ma part.\n\nOui on a monté un nouveau tracker, centralisé mais sous Tor.\nOn travail principalement sur yggtorrent.com, hébergé au canada.\nDès qu'il sera partie (dans quelques jours max) on attaque le dev sur ZeroNet. \nPour le ratio, c'est le tracker qui gère ça. Rien à voir avec ZN ;)",
				"added": 1499173229
			},
			{
				"comment_id": 6,
				"body": "> [sickgamer2](#comment_8_1LExHAGduhvTgxYjDCJT6rMYi2zAuuWDju): pour me contacter posé une question :::: sick@toxme.io\n\n\"Undelivered Mail Returned to Sender\" ...",
				"added": 1499421277
			},
			{
				"comment_id": 7,
				"body": "> [zerozombu](#comment_1_1M21Fj6zgNXWPJseasJL5uiVKGbDADQcwP): Ouin faudrait commencer par refaire des trackers decentralisés\n\nSi vous avez une solution VIABLE pour un tracker décentralisé, n'hésitez pas à nous le faire savoir :)\nEn attendant, on taf sur yggtorrent",
				"added": 1499423724
			}
		],
		"4_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": [
			{
				"comment_id": 2,
				"body": "Salut salut!\nHeureux de voir des contrib t411 ici =D\nNous en train de relancer t411 sur ZeroNet. Nous sommes plusieurs modos et gros contributeur de t411 à nous rassembler sur Wire pour en discuter. Je travail à commencer la base du site. Tout aide est la bien venu! Vous pouvez nous rejoindre sur Wire m'ajoutant: https://app.wire.com/\nPseudo:  pokapow\nJe vous ajouterais alors au groupe de discussion en question.\nSinon nous somme aussi sur l'irc t411 qui est revenu: https://search.mibbit.com/channels/t411\n\n # reloading",
				"added": 1498905861
			}
		],
		"3_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 5,
				"body": "Yes, sur ZeroNet, c'est prévu. Notre priorité est pour le moment de relancer le tracker sur YggTorrent. Ensuite, C411 sur ZeroNet, avec le même tracker ;)",
				"added": 1499421064
			}
		]
	},
	"comment_vote": {}
}