{"cert_user_id": "japzone1@github", "next_comment_id": 7, "comment": {"1604064736_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": " @antilibrary\r\n> Couldn't a native implementation of IPFS be of help?\r\n\r\nRead @leycec s above post:\r\n\r\n> Integrating IPFS into ZeroNet is strictly off-the-table for all of the obvious reasons, including:\r\n\r\n    nofish ━ on Jun 10, 2017\r\n    It [integrating IPFS] could be possible, but then we need to run separate daemon which would reduce portability, more memory usage, probably no full tor support, more connections and probably other problems.\r\n\r\n    skwerlman ━ on Jun 11, 2017\r\n    I hadn't thought about tor support, which is probably a deal breaker since IPFS is UDP-only atm.\r\n    That CoC [Code of Conduct] is pretty spooky, since it seems to apply US law globally, and, assuming it's enforceable, it means the IPFS devs are susceptible to state coercion.\r\n    I think you're right that IPFS isn't the right solution here.\r\n\r\n", "added": 1503105525, "modified": 1503105525, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/7#issuecomment-323499247", "source_type": "github"}, {"comment_id": 2, "body": "@antilibrary \r\n1. They're thinking about it, which isn't something we can wait for. \r\n2. They're working on it but it isn't ready, which is something we can't wait for.\r\n3. I won't get into that right now, (I'm literally walking out the door at the moment)\r\n\r\nBasically we can't wait for critical features, and we don't want the extra overhead.\r\n\r\n@linkerlin People are already trying that, but the critical flaw that we've found is getting people to Seed. People either have to leave a tab open, or download a special client. Neither is practical for most people. Plus there's no easy way to hide people's identity with Webtorrents.", "added": 1503489660, "modified": 1503489660, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/7#issuecomment-324364096", "source_type": "github"}], "1604065760_mirrored_japzone1_github": [{"comment_id": 3, "body": "I tracked down the issue. It appears to be some kind of conflict in NoScript's \"ABE\" advanced function with Firefox's e10s multi-process feature. I can't tell if it was caused by an update to NoScript or Firefox though. \r\n\r\nI operate NoScript in a Blacklist mode, so only certain sites are supposed to be affected by it, which is why I missed it when tracking down the issue the first time round. After cloning my Firefox profile and removing things one by one I tracked it down.\r\n\r\nThe issue does seem to be directly related to Firefox's e10s, as disabling it fixes the issue as well. I guess I'll just have to leave that NoScript function disabled for now. Not sure exactly how to report the issue to NoScript though, as I haven't seen it affect anything besides ZeroNet yet, but I'm also not sure if it's worth looking into yourself for such a niche issue\r\n\r\nPS: This isn't important to this issue, but in Firefox Dev-Edition's version number the date is also important, as new builds are released almost daily. So just because you have say v53.0a2, doesn't necessarily mean it's the same as someone else's. Just pointing it out just in case you didn't notice.", "added": 1486660008, "modified": 1486660383, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/815#issuecomment-278757188", "source_type": "github"}], "1604066310_mirrored_April93_github": [{"comment_id": 4, "body": "Looking for similar errors, looks like it might be related to a bug that was fixed in Python 2.7.9. Maybe try updating it?", "added": 1516416077, "modified": 1516416077, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1252#issuecomment-359147625", "source_type": "github"}, {"comment_id": 5, "body": "My ZeroNet on Windows is running off of Python 2.7.9(pure coincidence) and didn't encounter this. So it probably is related to that old bug I mentioned.", "added": 1516417129, "modified": 1516417129, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1252#issuecomment-359148344", "source_type": "github"}, {"comment_id": 6, "body": "Yeah, looks like this was a bug in Python <=2.7.8, which was fixed in 2.7.9.\r\n\r\n[This answer](https://stackoverflow.com/a/41368813) on that Stackoverflow page you linked explains it.", "added": 1516424538, "modified": 1516424538, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1252#issuecomment-359154356", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604065760, "title": "Blank Pages with Firefox Multi-process enabled", "body": "This just started happening, but for some reason no Zeronet pages will load past the Zeronet wrapper in Firefox with multi-process enabled. If I load ZeroHello for example, I'm greeted with a white page and the Zeronet button/sidebar. However, if I open a new window using the menu option \"New Non-e10s Window\" and then try to visit ZeroHello, the page loads like it's supposed to.\r\n\r\nThis issue just started happening and I'm not sure what exactly the cause is besides that it seems to be tied to Firefox's new Multi-process feature that's in testing still. I'm guessing a recent update introduced this bug, as Zeronet pages worked fine before even with Multi-process enabled.\r\n\r\nNo error messages appear in the Dev Console.\r\n\r\nI'm not sure if there's anything you can do on your end as it might just be a bug in the Firefox's Dev channel, but I thought I should let you know.\r\n\r\nSpecs:\r\nWindows 10 Home\r\nFirefox Dev Edition v53.0a2 (2017-02-07) (64-bit)", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1486513222, "modified": 1561985866, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/815", "source_type": "github"}]}