{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1Pr9VbYQky3wwQRTv7o1SaNaAXJJPJvwRZ": [
			{
				"comment_id": 1,
				"body": "Протеин инсайдера, надеюсь.",
				"added": 1549459453
			}
		],
		"2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 2,
				"body": "Биржа криптовалют должна взаимодействовать с блокчейном. Причем даже со всеми блокчейнами для поддерживаемых валют. Либо напрямую, либо через промежуточный сервер. Уже это делает недостаточным, одно только ZeroNet. Ещё момент, нужно как-то обеспечивать завершение сделок, в текущей модели ZeroNet, когда каждый может изменить свои данные в любое время, это трудная задача. Но тут, как и в любой DEX, можно обойтись контрактами на блокчейнах. Но что остается для ZeroNet? Только хостинг и дистрибьюция графического интерфейса биржи. Но и для этого ZeroNet плохо подходит, потому что сильно увеличивает поверхность атаки.\nПри этом, существующие децентрализованные биржи уже имеют фронтенды в виде приложений, так что, ZeroNet тут будет лишней сущностью.\n\nТак то, хоть сейчас можно запилить тот же BitShares GUI как зайт, с внешними запросами к шлюзам. Для удобства, чтобы не ставить приложение на электроне. Но каков будет уровень доверия в такому зайту? Допустим, я сделаю такой зайт. И в любой момент смогу подменить приложение на модифицированное, чтобы увести средства пользователей. Кто будет этим пользоваться?",
				"added": 1549577345
			},
			{
				"comment_id": 3,
				"body": "> [quirrel](#comment_67_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Так и владельцы крупных клирнетовских бирж точно так же могут увести средства пользователей, от этого никто не застрахован. Помните Mt.Gox?Всё держится на честном слове и репутации.\n\nМогут, конечно. Другое дело, как здесь, в ZeroNet это честное слово и репутацию создавать. Можно, конечно, зарегистрировать юридическую организацию, которая будет от своего лица управлять работой такой биржи. Или просто вести такую деятельность от реального имени. Тогда, в случае мошенничества будет грозить преследование по закону, в цивилизованном мире такое уже происходит в отношении владельцев бирж при экзит скаме. В России, в общем-то тоже должно. Но будет ли такой подход соответствовать духу ZeroNet, как довольно таки независимой от законов в настоящее время?\n\nЛибо же, без раскрытия, нужно довольно долго нарабатывать репутацию тут на некоторый ник. Но вот взять BitShares,  Есть официальный клиент на электроне от разработчиков, есть сайты управляемые Openledger, GDEX, RuDEX и другими. Сайт в ZeroNet будет плестись где-то в конце по репутации. Но впринципе, да, можно. Только главный вопрос: зачем? Пересечение между пользователями ZeroNet и BitShares околонулевое, создание и поддержание шлюза стоит времени и денег, а заинтересованные и так могут скачать официальный клиент.\n\nДа тут вообще, всего пользователей криптовалют, можно по пальцам руки пересчитать они уже пользуются биржами, в том числе децентрализованными, если заинтересованы в последних.",
				"added": 1549583380
			},
			{
				"comment_id": 4,
				"body": "> [quirrel](#comment_69_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Децентрализованнаябиржа - это как? Что-то типа WAVES?\n\nДа, сейчас только несколько типов бирж, которые можно назвать децентрализованными. \n1. Те, что целиком на блокчейне, предусматривающем фукнционал биржи, или подобный может быть реализован благодаря контрактам. Другие криптовалюты в них предствленны 1 к 1 обеспеченными токенами, обмениваемыми через централизованные шлюзы. Это **Waves, BitShares, Etherdelta, Stellar**, и прочие.\n2. Атомарные свопы между блокчейнами, как в **Bisq**. Этот путь более децентрализованный, так как не требует сторонних шлюзов, а каждая криптовалюта представленна непосредственно. Но такой подход ещё более сложный, медленный и требует обменов сразу на крупные суммы, чтобы покрыть издержки комиссий.\n3. Атомарные свопы на платежных каналах. В настоящее время даже ещё их нет, кроме как в разработке. Должно быть то же, что и 2, но с более быстрым обменом и сильно меньшими комиссиями. Но такие биржи потребуют обмена сообщениями между клиентами в реальном времени, что опять же, в текущей модели ZeroNet неосуществимо без привлечения сторонних костылей.",
				"added": 1549647966
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 5,
				"body": "Пользуюсь веб версией Riot, в основном через браузер из-за удобства. Сервера чужие.\n\nСвой поднимал с 1GB OЗУ, что мало, но если для себя и не участвовать в паре особо тяжелых комнат, то достаточно. Но это было ещё до перехода на третий питон, сейчас ситуация должна быть лучше.\n\nПо альтернативным клиентам, пользовался Nheko (QML), сейчас заброшенным и недавно возрожденным. Но он несколько тормозной. Spectral (QML) быстрее, хотя он в несколько более сыром виде. Немного Fractal (GTK), который уже неплох вполне, но падуч. Есть ещё консольный gomuks, но он был довольно тормозной, когда я его пробовал.\n\nе2е шифровние сейчас в таком виде, что им лучше не пользоваться, по крайней мере в многопользовательских комнатах. Для личный сообщений можно, при согласовании с собеседником, подтверждении ключей и запрете недоверенных в настройках. Шифрование есть только в Riot: Web и Mobile. В Nheko его автор не допилил, до того как забросил и оно полурабочее.",
				"added": 1549727119
			},
			{
				"comment_id": 6,
				"body": "> [mistalero](#comment_32_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что за Matrix?\n\nФедеративный мессенджер с приоритетом на групчаты. Анонимность он вообще в целях не преследует, хотя никто не запрещает не раскрывать личность. Для регистрации не требуется номер телефона или e-mail, использовать можно через Tor.",
				"added": 1549923944
			}
		],
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 7,
				"body": "Нет никакого разделения на сообщества, при этом проект имеет свой CoC. Потому, скорее это не соцсеть, а сообщество с собственным инструментом коммуникации.",
				"added": 1549924203
			}
		]
	},
	"comment_vote": {}
}