{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566264907,
			"title": "Starter Zite seed share",
			"body": "Hey y'all, got a zite with low seed? lets start a group to help share each others stuff\n\nI'll start with my new blog, dedicated to relentless pursuit of truth and the will to share it.\nhttp://127.0.0.1:43110/1HgYttao1u8u9cbqykf4euQKJH6NXZLprE/",
			"added": 1566264906
		}
	],
	"topic_vote": {
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1566264907_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X": [
			{
				"comment_id": 1,
				"body": "> [nickwa](#comment_409_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Your solution is already here: http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/ This site lets users post new Zites that are low in seeders to auto-seed. This is also a ZeroTalk clone for new sites: http://127.0.0.1:43110/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/\n\nThanks a bunch, that is super helpful!",
				"added": 1566350513
			},
			{
				"comment_id": 2,
				"body": "> [anshorei](#comment_29_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): ZeroNet in the Eyes of the Media\n\nseeded!",
				"added": 1566350527
			}
		],
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": [
			{
				"comment_id": 3,
				"body": "On it OP, I have negotiated a portion of my wage to be denominated in crypto.\nMy first house will be bought in BTC\nno need to buy clothes with cash anymore\nKeenly awaiting grocery payments",
				"added": 1566400895
			},
			{
				"comment_id": 4,
				"body": "> [numismatist](#comment_50_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): precious metals > crypto [...]\n\nnice name, I'm not saying crypto > precious metals, I believe their co-existence is optimal. But, my biggest qualm with precious metals is how fast paper markets spring up around them.  Next thing you know everyone is trading gold certificates and the vault holders are fractionally reserve lending.  As the wealth inequality piles up as a consequence of giving a select few a printing presses, the wealthy invest in personal power games and take the gold part of the certificate away.  Cryptocurrency has a distinct advantage of being immutable both in the object (the gold) and the law around that surrounds the object (revolving-door legislatures that pass unconstitutional laws) while gold is only immutable as an object.",
				"added": 1566513377
			}
		],
		"1566944519_1587xjW5S4aJd1JKmLEsv1WRruZoWXokX9": [
			{
				"comment_id": 5,
				"body": "HaCha!~",
				"added": 1566947646
			}
		],
		"1567131012_1BXEpDnqmAicgL8QvAVh6erxpVZY3cRu39": [
			{
				"comment_id": 6,
				"body": "> [moor](#comment_196_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): we aren't free. you see, i am just as destined as you were to write what we wrote. there is not free will, we are just observers inside our own bodies, we are driverless cars that can only experience the trip. blah blah blah!\n\nI do not believe that the future is written, aye i do not see written in any physical law that even the past is (was) fully written.",
				"added": 1567139377
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "Call me a script kitty, but why not just fork zeronet into an organization repo yourself, i'd think most contributors given the choice would push there instead of a centralized, one-owner repo",
				"added": 1567288763
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 8,
				"body": "> [kidcourageous](#comment_78_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): What the fuck kind of cult ass term is \"glownigger\"?\n\nI believe the term is slang for an unfriendly intelligence operative, coined by a cults dissatisfaction with 'nigger' and Temple OS creator Terry Davis",
				"added": 1567299179
			}
		]
	},
	"comment_vote": {
		"29_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"409_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"6_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X": 1,
		"19_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ": 1
	}
}