{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1525692962_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 1,
				"body": "В этой виртуальной общей юрисдикции как решается вопрос взаимодействия с традиционными государствами?\n\nОбычное государство обещает мне защищать мой дом и мое имущество от посягательств. Если внезапно под твоим  домом и 10 гектарами земли обнаружатся локальные но богатые залежи лития алмазов и чистого плутония пригодного для прямой загрузки в реактор. \nБудут ли и если до то как эти ресурсы будут делится между гражданами меганезии? \n\nЕсли внезапно про это узнают хищные капиталисты и возжелают всеми силами отобрать твою землю. Введут в Ильмень озеро шестой флот ВМС США, высадят десант, начнут бомбить СНТ - какую защиту твоей собственности предложит Меганезия ?\n\nПосещение и проживание на территории других государств - как решаются юридические вопросы визовых разрешений? \n\nПри постоянном проживании там как решаются вопросы налогов? \nНапример - твой участок земли с домом рядом с Ильмень озером - налог за землю и дом платить:\n1) только в бюджет РФ.\n2) только в бюджет Меганезии. \n3) и туда и сюда. \n\nКак осуществляется юридическая поддержка, если их полиция решит необоснованно обвинить тебя в преступлении ? \n(например в азии за пакетик с наркотиками расстрел и конфискация твоего имущества (вкусной земли с полезными ископаемыми, сто миллионов наличными) в их пользу) \n\nВ случае стихийного бедствия, как и какую поддержку окажет государство Меганезия своим гражданам?  \n(США и РФ вывозят из азии своих граждан чартерами а кому нужна мед помощь самолетами МЧС) \n\nЯ так понимаю что самоуправляющееся сообщество подразумевает что ВСЕ граждане будут участвовать так же и в судебных делах, общим голосованием выносить вердикт.\nНа примере \"#metoo\"  когда обвинение \"50 лет назад он держал меня за коленку, а я не хотела - это жесткое ИЗНАСИЛОВАНИЕ\" при соответствующем освещении в СМИ приведет в Меганезии к пятикратному четвертованию в кипящем масле. \nКакую защиту может предлагает Меганезия, для вынесения вердикта адекватному деянию? \n(пусть теперь она, старая и противная, подержит меня за коленку против моей воли, на том и разойдемся)",
				"added": 1539151049
			}
		]
	},
	"comment_vote": {}
}