{
	"title": "zeropro.xyz",
	"description": "The official blog of the zeropro.xyz (formerly ClassCoder) ZeroProxy\nWritten by zmccorkle@zeroid.bit",
	"links": "- [Proxy](https://www.zeropro.xyz)\n- Donate: [Patreon](https://patreon.com/zeroproxy) or [Bitcoin](https://btc.blockr.io/address/info/14gok1um1bDCsTL51odELYzz1oysU4us5Z)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1458252736,
	"post": [
		{
			"post_id": 2,
			"title": "What's next?",
			"date_published": 1458252310.764,
			"body": "I legitimately have no idea.\n\nWhat _is_ next for ZeroProxy? What could I do to make it better? Heck, what could I do to make _ZeroNet_ better? I'd love some ideas on what to do next in the comments."
		},
		{
			"post_id": 1,
			"title": "Change has arrived.",
			"date_published": 1458240598.924,
			"body": "Today, there have been some major changes to the ClassCoder proxy. The most evident one is that it has been renamed to zeropro.xyz (see the domain hack there?), and one that you'll immediately see after navigating to zeropro.xyz: the fact that we are now using ZeroHello. There are also some other changes, such as loosening of the rules, which will be stated later in this post.\n\nFirst, the rebranding. Yesterday, I got an email from my (old) registrar GoDaddy telling me that classcoder.com, the domain that used to host the proxy, was about to expire. I put out a plea for help on ZeroTalk, /r/zeronet, and the proxy's homepage with a Patreon (which is still going: [patreon.com/zeroproxy](https://patreon.com/zeroproxy)) and Bitcoin address (`17Ao9xowNyJrPXfGFqHa8xSzqB9ctfkCss`) and [someone donated **$50** at 7:54PM](https://btc.blockr.io/tx/info/4f230258c62981ae0e7bb2307ed86b66df1d20b959bab84b1953574ab3dbdccd). With this money, the proxy should be live for a good long time on its new domain, and I might be able to afford adding some new improvements.\n\nNext, ZeroHello. I used to use [a very ugly homepage](/14RoVxhTqLAZn1nTyvTyCM6FrNWaDv5d62/) that was hacked together in about 15 minutes. It did the job, but I felt that with the new rebranding and funding I should do better. I've [lightly modified New ZeroHello](/164cmcdrNnUjJeyjqamtmXeugTshT7AbCc/) to not show sensitive information like connected sites (I will be removing the `ADMIN` permission from it soon, most likely), but still show the newsfeed. I feel this is a huge upgrade from the multiple-month-old hack that is the old landing page.\n\nFinally, the rules. These used to be the rules:\n\n1. Don't do illegal stuff.\n2. If you've got a problem with something we're seeding, please state the EXACT URL of each item in an email to zmccorkle@classcoder.com and we'll take a look and probably delete it. (sorta like a DMCA complaint)\n3. I'd prefer if you don't visit NSFW content on the proxy, I'd prefer not to seed it.\n4. Don't fiddle around with admin sites. If you don't know what I'm talking about, you probably aren't doing it.\n5. Rule breakage may result in an IP ban.\n6. I have the right to deny service to anyone for any reason. Don't make me use that right.\n\nThese are the new rules:\n\n1. Do not utilize sites that may affect the experience of other users (e.g. sites with `ADMIN`)\n2. This proxy operates under the laws of the State of Texas. Law enforcement is not the job of the proxy, but if federal or state law enforcement requests information or removal of information, the proxy is required by law to comply. We will post requests to [Lumen](https://lumendatabase.org/) if possible by law.\n3. This proxy is not responsible for any content hosted, as it is all user-made.\n4. Complaints requesting the take-down of copyrighted data can be sent to [abuse@zeropro.xyz](mailto:abuse@zeropro.xyz). Complaints will be reported to [Lumen](https://lumendatabase.org/) with sensitive information removed.\n5. Rule breakage may result in an IP ban.\n6. This proxy has the right to deny service to anyone for any reason. This right will not normally be exercised, unless there is abuse from the target.\n\nAs you can see, I'm quite a bit more lenient on the rules. _I_ won't enforce anything other than abuse. I can't prevent law enforcement from doing anything though, unfortunately.\n\nI hope everyone likes the new changes to the proxy, I believe they help everyone access and enjoy ZeroNet the way it was meant to be."
		}
	]
}