{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1623961112,
			"title": "Truth and God",
			"body": "I thought that the meaning of life was for humanity to become God.\nAll seeing, all knowing, all present, all powerful.\nAre the aspects of God but also the aspects which humanity grow into.\nSo in a way I thought that the physical world is the body of god,\nall of humanities consciences put together is the conscience of god.\nThe more people believe the more unified the will of god is.\nOur goal as people is to become god by growing into those 4 aspects of god.\nThe next step was when I was researching human nature, \nI'm the type who likes to figure things out for myself so I was trying to draw a diagram. \nI had the overwhelming sense I saw this type of information organized in a similar manner before. \nwhich led me to image related the Jewish kabbalah.\n\nhttps://ibb.co/rpKhJ3h\n\nIn the Kabballah it explains what I thought to be the body of god to be gods creation and the mind of god to be the \ninfinite incomprehensible god.\nGod is both already and not yet, we are creating and becoming god, \nbut since god is timeless he also exist complete outside of his creation.\nThe incomprehensible god, the infinite is the far future of humanity what we will look like when \nwe are finished becoming god. quite possible recreating heaven with science and technology.\n\nHow ever I believe the Tree of Life is incomplete;\n\n\tRevelation 22:2, NIV: \n\t\tdown the middle of the great street of the city. On each side of the river stood the tree of life,\n\t\tbearing twelve crops of fruit, yielding its fruit every month.\n\t\tAnd the leaves of the tree are for the healing of the nations.\n\nThe image above does not show it but there is an 11th fruit in the center of the tree that is empty because it changes depending on what emotion/aspect of seraphim you are experiencing.\nso this begs the question what is the 12th fruit?\n\nMy theory is that the parts of the kabbalah at the bottom that represent man and woman are incorrect.\nMan attaches more easily to the left pillar of strength and judgement, while woman more easily connect to the right pillar of loving-kindness.\n\nWhich means the 12th missing fruit is concepts relating around family, children and what they symbolize.\n\nSo with the observable establishment of our destiny to become God comes something I like to refer to as the lens of truth.\nWe can now look at any decision or system and see if it is moral, if it serves one of those 4 goals/aspects of becoming God.\nThe decision or system has to build on humanities presence, power, knowledge or sight. Anything that goes against this\nis evil anything that supports this is good and things that don't effect it are irrelevant.\nHow ever the scope for things that are irrelevant is much smaller then one might think at first glance, for many\nthings that don't go against these goals do in a round about way because of wasted time. Most modern fiction/entertainment\ncan be seen this way.\n\n\nSo if I were to graph out our journey to God it would look like an exponential function where God is a point\nwe can never actually get to but grow infinity close to.\n\nhttps://ibb.co/fdc6FZC\n\nThis means we will watch society get as close to God as possible on earth and in the universe. But the only way to pass that point on the graph to actually get to God is by dying and being resurrected in heaven with a perfect body through Science. Science is not nihilistic Science is the path to God.\nNot ever being able to actually reach God may seem like a problem, but its a disguised blessing. For those new souls yet to be born there will always be an ever expanding universe to explore. To forever live in Gods glory serving those 4 aspects. In life and in death.\n\nMy philosophy is not yet complete, I just seek to grow it.",
			"added": 1623961111
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 1,
				"body": "> [orien3242](#comment_85_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): so what you are telling me is that you are the reason why suffering and evil exists today and will continue to flourish?\n\nI've been doing more research and I think I was misguided. I should not have said become God I should have said become like God. \"On earth as it is in Heaven\" is what I meant",
				"added": 1624141655
			},
			{
				"comment_id": 2,
				"body": "> [theopolus01](#comment_8_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S): I'm not a theologian, but wasn't that the desire of Lucifer to \"Become God\"?  How do you overcome the corruption issue, or are you just ignoring it?\n\nAfter posting this and reading the comments I become aware of how close this is to the desire of lucifer. Honestly fuck boys not my intention here at all. But you are all correct. I guess this why they say the only path to God is through the prophets else satan is there to tempt us\n\nSo my only bit of redemption here is to say that it is impossible for humans to actually hit the level of God as shown in the graph(https://ibb.co/fdc6FZC). We will forever become like but never actually able to become.",
				"added": 1624225095
			},
			{
				"comment_id": 3,
				"body": "> [theopolus01](#comment_8_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S): I'm not a theologian, but wasn't that the desire of Lucifer to \"Become God\"?  How do you overcome the corruption issue, or are you just ignoring it?\n\nForgot to mention, I don't have the answer to the corruption issue. I just wanted to share my thoughts and I feel like some valuable information was pointed out to me.",
				"added": 1624225200
			},
			{
				"comment_id": 4,
				"body": "> [zerolady](#comment_25_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p): The Infinite Search Of Universe Another site to display the photos.Gate of Heaven … Please check, which site can display the photos more smoothly?\n\nhttps://imgur.com/Rhw3TTl\n\nhttps://imgur.com/f6B5C9s",
				"added": 1624282449
			},
			{
				"comment_id": 5,
				"body": "> [orien3242](#comment_86_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): like and is are both states of active being. You are still taking responsibility for all the evil things out there.\n\nIf we are to become like God and God is able to stop all evil why would God stop all evil if this history led to his creation. which means in all possible universes that were able to be created this was either the only or best one to becoming like God/bringing his kingdom. Also perhaps this means that no total evil exist in the universe if this path leads us to heaven.\n\nThis was an answer I had to the evil question before. The more I'm looking at it... did I just reinvent the wheel that is Luciferianism?\n\nOr maybe this is the path of God the only difference is one is becoming like while always keeping God above and the other is trying to become equal or above God. The latter being lucifer's great lie.",
				"added": 1624324645
			}
		]
	},
	"comment_vote": {
		"6_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": 1,
		"86_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"25_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": 1,
		"8_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": 1,
		"85_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1
	}
}