{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1586627246_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1586627246_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "Bug report: please add a LICENSE file to the repository. Thank You.\n\nA sidecomment: the dependence on Ruby 2.3.1 is a nice joke, referring to the blunder that the Ruby core developers did with the Integer/Fixnum/Bignum related change in Ruby 2.4.0.",
				"added": 1586709264
			}
		],
		"1587103405_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 2,
				"body": "Under censorship the quality tends to go down, but different supermafias/states censor different things, so jointly the issue with the centralized web is not so much the material, what is on there or missing from there, but rather the possibility to find \"high quality\"(quotes due to the subjectivity of the term) content. The issue is the lack of a proper implementation of something like the YaCy \n\nhttps://yacy.net/\n\nThe problem with the YaCy is its horribly poor implementation quality, but the idea there is exactly the right thing that, if extended, will probably solve the search issue.",
				"added": 1587167900
			},
			{
				"comment_id": 3,
				"body": "> [blurhy](#comment_434_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Some extended Steemit mechanism would be needed.\n\nAnd how will the services be available to people, who do not have an \"average Western income\"? It costs to store and transmit data, but to make everyone always pay is certainly not in spirit of the open source movement. One idiot created a ZeroNet fork for mobiles and added advertisements to it. The idea of open source is that anyone can do whatever it wants with the source, including totally stupid or malicious things, but the classical WWW as we know it was not the first of its kind. An example of a proprietary system that preceded the WWW/HTML is the Apple HyperCard\nhttps://en.wikipedia.org/wiki/HyperCard\nbut the proprietary systems failed to get massively adopted despite being profitable to their creators. It was the free, nonproprietary, nature of the WWW/HTML combined with a decent implementation that made it a success. Pay-per-use and pay-for-access systems do not scale, but a P2P-search engine needs to scale. Besides, there already existed a closed source, money-scheme-encumbered P2P-search engine, \nhttps://en.wikipedia.org/wiki/FAROO\nbut it clearly failed from adoption point of view. On the other hand, people are willing to bear the cost of hosting and transmitting data that interests them, as described at the following paper:\n https://www.cl.cam.ac.uk/~rja14/Papers/redblue.pdf\n\nI sometimes wonder, where do people get the idea that money can solve everything? Some money is necessary, but to make everything always attached to money gives wrong incentives, because the world is full of halve-baked, shoddy, implementations of various things and the various start-up-companeis keep on creating the various \"minimum viable products\" by using/wasting the millions of dollars of investors' money, but if we look at the history of technically successful projects, not just monetarily sucessful projects, then the most successful projects like GCC, like LLVM, like KDE, like Gnome, like Vim, like Emacs, like Apache server, in some sense even the Mozilla web browser, with the exception of its predecessor, the Netscape, there can be some money at the start of the project to get it going, but all in all the long term development is not for money, but for technical results. LLVM is heavily financed by Apple and GCC was  financed by Apple before the LLVM, but those are products that are for quality, not as something that need to earn money to their creators. Imagine, if You had to pay cryptocurrency for executing GCC? The GCC would be dumped pretty quickly.",
				"added": 1587212243
			},
			{
				"comment_id": 5,
				"body": "> [blurhy](#comment_435_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): There won't be enough voluntary search service providers for the whole network,\n>...\n> In case we don't use blockchain, we can try Proof of Human Work against bots,\n\nPlease read the paper that I referenced at my previous post. I mean the one with the title \n\"The Economics of Censorship Resistance\"\nhttps://www.cl.cam.ac.uk/~rja14/Papers/redblue.pdf\n\nBefore going to the idiotic proof-of-work path (energy consumption without beating spammers that have good hardware, FPGA-boards, other accelerator-boards), please read the\nhttp://fouryears.eu/2017/07/09/the-blockchain-consensus-problem/\n\nYou may want to add to the mix of ideas the thought that if people are willing to freely host material that they are self interested in and that there are papers about how to conduct searches from multiple specialized search engines\n\n\"Multilingual Federated Searching Across Heterogeneous Collections\"\nhttp://www.dlib.org/dlib/september98/powell/09powell.html\n\nthen those 2 classes of papers should pretty much solve the quality of search and economic incentive problems at a scalable manner, provided that the text analysis and search side is OK, which it won't be without having good language analysis combined with end user specific context. For example, if a truck driver enters the search term \"porn\" to the search engine, then the results should be different from the results that are returned to a psychologists, who is doing sexuality related psychology research. So plain language analysis will not be enough. Nor are the most popular results always the most useful ones, specially, when searching scientific papers. So there are kind of 2 sides to the story: server side and client side, where the client side must provide the server side data about the context and the server side should give some \"standardized\" result that depends on all of the query parameters. As the ZeroNet is essentially linked local document storage with automated document download, a distributed ZeroNet search engine can not be a zite, but some P2P-system that uses realtime connections. The realtime connections may be over Tor network, but they may also be over some P2P-messaging system network like the \nhttps://matrix.org/\nhttps://tox.chat/\nplus the anonymity part of the whole story. The documents that are being indexed should reside, where the search engine node is, which is the case with zites, as the zites are already stored locally. Each search engine node indexes only the zites that are locally available, no crawling on ZeroNet. Historically libraries have been using a distributed search engine idea with standardized query interface/protocol, the Z39.50\n\nhttps://www.loc.gov/z3950/agency/\n\nbut that's too primitive for the ZeroNet case. The Z39.50 can be one of the sources of inspiration, a material for learning.\nPlease keep in mind that the data volume of document indices can be greater than the data volume of the original documents themselves, because the indices can contain additonal data about the documents. For example, an image of a building can contain references to events or companies at the building, may be links to documents that are related to that type of building, etc. A poem with just a few short lines may have various historic data about that poem as part of the index that has the poem as its entry. It's a long story. You may also want to read \n\n\"Search Engines Information Retrieval in Practice\"\nhttps://ciir.cs.umass.edu/downloads/SEIRiP.pdf\nhttp://www.search-engines-book.com/\n\nThe very first index that the P2P-search engine might implement might be something very primitive, like a plain string search with string frequency parameters and a list of strings that are forbidden at the documents that are referenced at the search results. On the client side people might want to re-use sub-parts of their queries, for example, lists of words that the referenced documents at the query results must not contain. The internet is full of halve-baked projects, so the only point of doing yet-another-P2P-search-engine is to do it really well. Do less, but do it really well, both, implementation wise and specification wise. A way to ruin a project implementation is to cobble together whatever components without taking to account the ease of installation and future availability of the dependencies of the components and the future availability and portability of the dependencies of the dependencies of the dependencies. A positive example of a primitive, but very effective P2P-search engine is the built-in search-engine of various Mule (eMule, aMule, ...) file sharing applications. Not fancy, but does its job really well.\n\nThank You.",
				"added": 1587247397
			}
		],
		"1587107506_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 4,
				"body": "https://www.youtube.com/watch?v=zoqbhO_UeA4",
				"added": 1587214077
			}
		],
		"1585090638_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3": [
			{
				"comment_id": 6,
				"body": "You may think of the ZeroNet as ThePirateBay founders' answer to the call by the founder of The Internet Archive. The original 2015. presentation video titled \"Brewster Kahle - Lock The Web Open\":\nhttps://archive.org/details/bresterkahlenetgain\n\nThe same video on ZeroNet:\nhttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1588030719_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx\n\nAs with all properly free mediums, the content depends on what the users of that medium publish. The early adopters of  new tech tend to have technical background, so they tend to publish development related materials. As the set of users broadens, so does the content. At some point You get the lizard-alien-illuminati-bigfoot-people to publish the materials they want to publish and they're not even the worst bunch in my opinion, because probably the worst bunch is the murderous Islamists, ISIS or whatever they want to call themselves. The various Christian nuts are somewhere between the murderous Islamists and illuminati-bigfoot-people. So, expect to see quite a mixture. \n\nThe biggest problem with the ZeroNet right now is that its mainstream, Python 3 based, implementation tends to be crap, hard to install, unstable, but some old, Python 2, versions work fine. The second biggest problem with the ZeroNet is the lack of proper search engines, which can not possibly be accessed from any ZeroNet site, a \"zite\", because unlike Tor and matrix.org the ZeroNet architecture does not support real-time communication. ZeroNet is based on the idea that composite documents like PDF-files or Microsoft Word files, are copied between ZeroNet nodes/servers. In the case of the ZeroNet the composite documents are implemented in HTML+CSS+JavaScript+someconfigfiles. Some of those composite documents, \"zites\", are link-collections that have a JavaScript based search-line for convenience. \n\nhttp://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF/\nhttp://127.0.0.1:43110/1CjMsvhJ2JsV4B5qo3FDHnF3mvRCcHuxBn/\nhttp://127.0.0.1:43110/13EYKqmPpwzBU4iaQq9Y4vfVMgj8dHeLkc/\nhttp://127.0.0.1:43110/13eFkhbXXQcJqd729zRLL9tMxxhz9d4UA6/\nhttp://127.0.0.1:43110/1SearchPd3khzLtsxTxKYhYUohk7c1QYd/\nhttp://127.0.0.1:43110/1SiTEs2D3rCBxeMoLHXei2UYqFcxctdwB/\nhttp://127.0.0.1:43110/0hub.bit\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:list-of-zites\nhttp://127.0.0.1:43110/kaffiene.bit\n\nA forum like the one You are reading here is a collectively editable composite document. The access rights are handled by using cryptographic signatures.",
				"added": 1588031190
			}
		],
		"1588071062_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 7,
				"body": "I do not know right now, but You may try Your luck with the ZeroDevTalk forum at\nhttp://127.0.0.1:43110/142jqssVAj2iRxMACJg2dzipB5oicZYz5w/",
				"added": 1588080332
			}
		],
		"1588077237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "May be it is easier for the new people to start using the ZeroNet if they first use the\nhttps://sourceforge.net/projects/mmmv-repackaging-projects-t1/files/repackaging_projects/repackaged_ZeroNet/",
				"added": 1588080560
			},
			{
				"comment_id": 10,
				"body": "> [cexy](#comment_42_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Do you have any experience with using of this zn mod?\n\nWorks fine for me. It is a very old version of the ZeroNet, but I'm posting this message here by using its t2 version.",
				"added": 1588103546
			}
		],
		"1588088871_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "You seem to be writing about a client side video-remixer and a video as a whole is like an HTML-page, where the end user experience consists of multiple sub-components. I think that what You describe is totally doable with the current HTML5 and JavaScript and alike. I also think that it makes perfect sense to divide a larger task to smaller ones, smaller components that can be assembled in multiple configurations. The main feature of the WebM video format\nhttps://www.webmproject.org/\nis that the whole video does not need to be downloaded to display part of the video. Therefore WebM-video files should be particularly easy to remix. That's what YouTube uses by default. Basically, Your proposition is nice and all, but it's just a regular web software project, nothing that requires some extra video encoder or container format. Given that ZeroNet zites are stored locally by default, the client-side video re-mixing should work even better, faster, with ZeroNet than with the classical WWW.",
				"added": 1588101114
			}
		],
		"1588110604_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 11,
				"body": "> [tnytuqsgqnywmecj](#comment_9_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): What part will you take to improve the problems you see other then simply loosing your composure!\n\nWell said. Yelling with signs will not offer proper business competition to anybody, except may be Washington lobby companies, but building the equipment and selling it to people, who might want to have those automated farms might make a difference. Please do not expect everyone to start soldering electronics themselves just like You do not expect to be a master at everything Yourself. However, delivering open source software and electronics schematics to local consultants, who have similar interests, might give good results at helping the people, who have other skills. You're probably not as good as the Elton John on stage and please do not expect the Elton John to be as good at software development and hardware development as You are. People do specialize. (I do not have a clue, whether the Elton John would be interested of running any garden, even if it were an automated one.)",
				"added": 1588193696
			}
		],
		"1588766786_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 12,
				"body": "synthwave, retrowave",
				"added": 1588891769
			}
		],
		"1588862308_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 13,
				"body": "How about You displaying some code first and then people can evaluate, whether that project is even worth joining. Good software developers do not want to just work for free for someone else. You have to offer something in return and that something that GOOD software developers accept tends to be something other than social interaction and \"grand vision\". Sorry, no free work for You or for anybody else! We've got our own projects to work on already.",
				"added": 1588891957
			},
			{
				"comment_id": 14,
				"body": "> [zeroseed](#comment_71_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): very often medical images have a low resolution and are difficult to interpreter, i want try to resolve also this problem with this idea\n\nLook for the image processing algorithms that physicists use for assembling images of single excited atoms by using a series of images. That's what they have been using in the drug screening industry for years and the idea is that a drug candidate molecule is attached to a marker molecule that is visible only at a certain laser wavelength and if different molecules that the researchers want to observe in a cell are attached with different kind of marker molecules that are visible at different laser light colors (different wavelengths), then it is possible to determine the location of those marker molecules in a cell under a microscope. \n\nThe general scheme is that first one set of markers \"paints\" the cell outer walls. That way it is possible to see, where the cells are on the image by illuminating the sample with one laser. Another set of images of the same sample is done under a different laser light, for example, in a laser light that lights up the drug candidate molecule markers, so it is possible to get an overview, where the drug candidate went in the cell. A third marker is used for \"painting\" some other sub-part of the cell, for example, the nucleus. Image processing can be then used to calculate the percentage of cells in the sample that received the drug candidate at the desired amount and at a desired location within the cell. \n\nSome physicists are developing the methods, how to refine those techniques. There are  even competitions between physics institutes/teams, who gets finer resolution from a given data set or who can come up with new schemes for locating the individual molecules in a solution. You may try to look for buzzwords by starting at \n\nhttps://en.wikipedia.org/wiki/Fluorescence_microscope",
				"added": 1588892734
			},
			{
				"comment_id": 15,
				"body": "> [robione](#comment_524_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): There is a startup in CA that is doing research and innovation in this space, bringing medical imaging from 2D and 2.5D to 3D and beyond.\n\nI know from personal experience that this problem has been solved at the top pharma laboratories, who can afford anything, at least 10 years ago. I know it FOR A FACT. Just go and study, what the top-notch labs use for confocal microscope image analysis software, the most expensive proprietary options, not what the universities can usually afford. Think of like 10k$ per one workstation license and N times as much for an image analysis cluster with N nodes. Really old story. But, well, I guess there is always some stupid money laying around for start-ups that do not offer anything technically new. On the other hand, there are those free, open source, options:\n\nhttps://itk.org/\nhttps://opencv.org/\nhttp://diderot-language.cs.uchicago.edu/\n",
				"added": 1588893279
			},
			{
				"comment_id": 16,
				"body": "> [zeroseed](#comment_73_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): Only take these free data, use it and told me if that tech can be useful for you, sharing what you see to help me to understand what Im seeding on medical images elaborated in the same manner. (you can also take my free data and do all you want with them). Why Im doing this? Only for curiosità and to help società in general (the same motivation that bring me to create zeronet seedboxes and proxy). Not always good tech can create Money and not always what dont bring to personal gain is useful to society\n\nWhat are You looking for from those medical images? What type of images are they? What's the purpose of the analysis? Please be more specific.",
				"added": 1588960706
			},
			{
				"comment_id": 23,
				"body": "> [zeroseed](#comment_76_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): the main problem with radiomics is that\n\nThank You for the answer. I suggest You start with assembling a very PRECISE data set of sample images. It's OK for the data set to be small, if non-statistical methods are used, but precision is of utmost importance. Once You've got that, then the rest can be manually programmed. The typical mainstream \"AI\" is using statistics for clustering samples, but there are also other, so to speak, \"logic based\", options that are non-mainstream, but can give better results at image analysis. In the case of pharmaceutics development labs the labs (think of literally all the major pharma companies with money to burn) used an approach that they sent very precisely documented sample images to a specialist image algorithm development team, a subcontractor, which then manually encoded an image analysis script from just a few samples (think of like 3 positive case images and a few negative case samples) and that worked in practice. Statistical methods were not used at the image analysis step, but only for summarizing the findings of the image analysis, like, which % of cells received the drug candidate and how fast the drug reached the target region of the cells at sufficient quantities.\n\nWriting those image processing algorithms takes some skill and it takes about 1 year of working at the very specialized team to obtain the fluency of thinking in those image processing terms, a lot like finding integrals or doing some other mathematical operations takes practice, not just theoretical understanding and a list of formulas. But, if You really want to work on this, then plan it to be about 3 year project, where You develop a Python or Ruby library that wraps C or C++ code. The C or C++ does the speed optimized image processing parts and the Python or Ruby is for rearranging the image processing steps. I suggest that You study the following project for ideas \nhttp://diderot-language.cs.uchicago.edu/\nand look for libraries that utilize graphics card for some more common operations like smoothing. You may want to study \nhttps://www.khronos.org/opencl/\nbut only to an extent that Your code will not get so cluttered with it that You are not able to throw it out once the OpenCL as a technology gets dumped. I suggest You first write a generic C++ version and then by using the simpler, C++ version, as a template, write an optional OpenCL version of the same image processing module. In the grand scheme of things You will probably end up using data parallelism anyway, meaning, You'll do most of the image analysis steps on a single image and only occasionally combine image analysis sub-results, which means that You can use a compute cluster that runs a mixture of different operating systems and has a mixture of graphics hardware.\n\nHere are the two key ideas for speed optimization of mask operations: \n\nKEY_IDEA_1: To change the color of a text at a web browser the text rendering engine needs to overwrite/repaint only the pixels that are those of the letters, not all of the pixels in the window. If a window is a rectangular area like an image and its pixel addresses are encoded as if all of the image pixels were stored in a single array of pixels, then the coordinates of the pixels of the letters, which are part of the picture, are marked/listed at a separate array, a 2. array. A 3. array can be used for marking the borders of the 2. array, so that it is possible to know, where in the 2. array one letter starts and another one ends. This way it is possible to change the color of a single letter in the browser window by repainting only the pixels of that single letter.\n\nThere are also some additional fields like image with and height.\n\nKEY_IDEA_2: The different letters in the browser window can be seen as single NON-OVERLAPPING masks, which can be numbered. The numbering of such nonoverlapping masks, subregions of a rectangular image, can be encoded as brightness values of a grayscale image. For example, a grayscale image that has only one byte for describing pixel brightness may contain at most 255 masks, because one of the 2^8=256 values must be assigned to the background value that describes the region of the image that is not covered by any of the masks.\n\nWith those 2 ideas You can get very far, if combined with script based description of the image processing algorithm substeps(thresholding, smoothing, erosion of masks, dilation of masks, and-or-inversion of masks, multiplication of the intensities of 2 grayscale images, addition and substraction of the intensities of 2 grayscale images, grayscale image intensity gradient based thresholding/creation of masks, splitting disjoint regions of a thresholding result to separate masks, etc.)\n\nIt's a lot of work, but that's how things were done \"under the hood\" of the solutions that the top-notch pharmaceutical companies used about 10 years ago, ~2010. You should really hire a few students to work on that problem for at least 4 years. Do not expect to get good results easy and forget about getting by with any quick-and-dirty \"proof-of-concepts\".  The beauty of this kind of a solution is that You do not have to worry about statistical equivalence, because You use firm definitions of what constitutes a tumor and what is not a tumor _according_to_your_definitions_. Obviously You'll get the definitions wrong, but that's where the scripting comes to play: You will update the image processing algorithms without needing to do any lowlevel, C++, coding.\n\nThat should get You going, if You are serious about Your project.",
				"added": 1589344301
			}
		],
		"1588854141_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "Thanks for the nice text.",
				"added": 1589001089
			},
			{
				"comment_id": 19,
				"body": "> [ransbits](#comment_3_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Individualized Targeted Advertising with political messaged based on residential location and social media habits as seen with Cambridge Analytica.\n\nThat's not a problem, because people have the possibility to study, what each of the candidates actually promises and what kind of delivery records the candidates have. If people do not do their homework and just make their choices according to whatever superficial nonsense that is fed to them, then it is fair that the people suffer by making wrong choices. \n\nWith freedom comes responsibility.\n\nIt is OK for irresponsible idiots to suffer due to their misuse of their freedoms. That's also part of the freedom package. Imagine, how direct democracy would work, if the majority of voters did not do their homework. That in turn leads to the \"free\" tuition topic. Tuition is never free, because fine lecturers need good salary and good opportunities for doing their research to stay in shape, but it is not just the communists, who can pay for tuition. Christian religious sects have been able to finance their brainwashing operations for centuries, but for some reason the atheists, who think that it is the realia that should be the bases for decisions, get rich by founding Google, Microsoft, Facebook, Tesla, IBM, Apple, Intel, AMD, etc. and do not finance the tuition of realia students. And then the Christians and Communists, at some point may be even Islamists, win and the super-ritch high-tech company ex-founders wonder, why doesn't democracy work, why people make stupid choices. \n\nAs the people are literally stupid, because they can not afford university level education and social mobility is also inhibited, the rich resort to various \"electoral colleges\" and other measures that move the political system further from democracy and closer to a committee run dictatorship. At some point the rich even loose their riches, because why should they have their riches, if there is no way to protect them and the dictatorship committee can do anything. The entrepreneurs, who financed Hitler, did not do so well in the end. At least not financially, given that their real estate in Germany was literally bombed to rubble, if the entrepreneurs survived the WW2 at all. Usually at some point a committee chooses a chairman and if that committee is a dictatorship committee, then their chairman will be a true dictator.\n\nNot voting in a situation, when there is no suitable candidates, is fine, because it also sends a message to whoever gets voted that they do not really have the mandate, but the avoidance of voting must be backed up by some way to enforce one's interests, if the inaugurated set of people cross the line. Yelling with signs is certainly not a way to enforce oneself. Prisoners in a prison or an extermination camp can yell all they want, until they are dead. Violence should be the very last step of conflict escalation and before resorting to violence, multiple other steps can be taken, like refusing to pay taxes, obscuring the activities of the dictatorship committee through means that they themselves do not consider illegal, but that slow their actions down and buy time for preparations and wear them down before the violent conflict. That is not a game for emotional people. A lot of calm thinking, thorough planning and cold calculation is needed.\n\n",
				"added": 1589067940
			}
		],
		"1589055412_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 18,
				"body": "In addition to the changes in political regimes, for example, the Soviet Communists considered business owners literally \"enemies of the people\" and executed them, usually by exploiting them for slave labor at labor camps first, there is the aspect that meaning depends on a context. An apparently innocent data can have a much more revealing effect, if combined with some other apparently innocent data.  What precisely, take Your pick. For example, in addition to the state actors, more precisely called supermafia actors, there can be smaller scale extortioners and just plain weird people like serial killers, who may do things just for fun. Think of Italian small-scale mafia trying to extort money from some rich person by kidnapping their children or some serial killer planning its act so that it does not get caught or other things of that nature. Basically the serial killers have to act the same way professional spies act and the professional spies do get away with their acts without getting caught, but the key for that is to know a lot about the target and to have spare plans for literally everything that can possibly \"go wrong\". \n\nI guess the assassination preparation period that Russian intelligence assassins used was about 2 years or so. Observation, documenting. Keep in mind that when the Russian intelligence assassins kill a political activist in Russia, they have the risk that the U.S. intelligence service acts as a forensic team and collects provable/usable evidence that connects the murder to the current Russian top leadership. The proof might be useless to save any dissidents, but it can be used for various other purposes. The proof might also be a secret bargaining chip between diplomats, where one side says, look, if You do not agree X, we will reveal the world that Your bosses did Y, and then the official contract text that is then publicly signed and published is much different than it would otherwise be or there might not even be any agreements to sign at all.\n\nI guess the most usual form of data analysis based harassment that people may experience in their day-to-day lives is with banks and potential employers. Banks use correlation analysis of online data, including that of the social media accounts, to give a risk assessment about whether to open an account to a small company that is run by a given person or whether to give a loan to that person. The same kind of automatic analysis, including that of social media accounts, is nowadays done by human resource departments, who legally are forbidden from doing that, but who can \"buy a service from 3. party\".  That \"3. party\" does not have to report, how exactly the risk assessment is carried out. That is to say, the salary offer that You get at some big corporation, when applying for a job, is pretty much based on the assessment of the human resource department's understanding of how badly, how quickly You need the money and that assessment is done by statistical analysis of \"innocent\" data. \n\nOnce upon a time they called that field \"applied statistics\", but the modern marketing hype name for the same thing is \"data science\". On top of that there are the learning algorithms, which often time is a mixture of classical statistical analysis and neural networks and various clustering algorithms. The whole idea behind the \"deep learning\" is that one algorithm is used for analyzing the whole data set and selecting a subset of data, which is then in turn analyzed with another algorithm that selects in turn some subsets of data, which in turn is then analyzed with yet another algorithm. It's like, one algorithm detects a face, another one searches for the eyes, another one studies the eyes for eye color, except that the idea can be used generally on general data sets and at every step there might be more than one subsets that get analyzed and the subsets may even have common elements and the subsequent analysis steps can take to account the parameters/results of previous steps.\n\nBasically, You never now, what innocent data can be used against You in very clever ways. The less data You give away, the better for You. On the other hand You also have to take some choices and risks in life and \"exist on the Internet\", specially if You are running Your own business. Choose wisely, what You publish. Upload only the bare minimum that You have to convey to Your potential clients. That is to say, no photos from homes, no photos from parties, no back office photos.\n\nIronically the commercial data analysis has come a long way since the Edward Snowden published his leaks about the NSA mass surveillance projects. You can also bet that the Chinese and the Russian intelligence services use any data analysis methods that they know, both, for their own population and for foreign populations. It's just a matter of time, till someone leaks new clever ways, how the Washington supermafia is analyzing all data that they are capable of collecting.\n\nhttps://theintercept.com/a-conversation-about-privacy/\n\nOn the positive note though, thanks to the PornHub Community at least in the West sex videos have been eliminated from the cultural taboos, which means that sex videos can not be used as an extortion material in the West. In Arab regions, where gay sex is punishable by death and sex outside of an officially registered marriage can also come with a death sentence, specially for women, sex videos can probably still be used for extortion.",
				"added": 1589062384
			},
			{
				"comment_id": 20,
				"body": "> [thorburn](#comment_60_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): In fact Western governments are worse to some extent as they hide behind a facade or free democracies, and have and continue to commit the greatest crimes against humanity. The difference is they do it with a smile and distraction.\n\nI've been thinking about what's the difference between the Russian oligarchs, the Russian rich elite in general, and the U.S. super-rich exploiters. There is one very important difference in favor of the West totally regardless of how Kremlin or Washington is politically organized: the Russian rich are lazy and start enjoying life with vodka and nice women and fancy real estate, but the U.S. super-rich exploiters may have evil plans and awful wishes, but THEY ARE NOT LAZY. That in turn means that the U.S. super-rich will attempt to compete against each other regardless of the political system, but the Russian super-rich elite lets things be the way things are. That laziness makes a BIG difference and that is why the West will always be better than Russia, even if the West were Communist and Russia were totally democratic. \n\nRich people in a communist country sounds like an oxymoron, but the rich in a communist society tend to be factory managers and other managers of big enterprises, who formally do not own that much, but in practice command the resources of the enterprise. They do not even need to somehow steal the resources. The resources are officially, totally publicly, up to them to manage. For example, in the Soviet Union different state companies, factories included, had company real estate for summer vacations and the higher management had higher priority at using that real estate. Company cleaners worked as maids there, because it is \"company property\". Or think of the Cuban dictator(s): the dictator does not really need to classically \"own\" the palaces, yet the palaces are only at the dictator's disposal. From that point of view \"super-rich\" people at a Communist West is not an oxymoron and the same kind of people, who are rich at a capitalist West would be also materialistically \"rich\" at a Communist west, just in a different manner.\n\nThere is the saying that bad men get to rule, if good men do nothing. But if the \"good men\" are lazy, then the \"bad men\" will rule even in a totally democratic political system. In the West there is at least some remote chance that at least some \"good men\" are both, rich and not lazy, but that is not the case in Russia. Otherwise whoever is the Russian Czar, would be executed the moment any of the political dissidents get executed. The way the Putin currently(2019, 2020) is making an effort to retire without being killed or thrown to prison is quite a set of events to observe and chances are that he will retire from the Czar profession like many of his predecessors: \"works\" till he dies of old age related illnesses. Think of Stalin. Think of Brezhnev. Think of some of the other Soviet leaders, who left office feet first. General laziness combined with horribly old top-leadership in a very top-down society and the result is quite depressing. The West will outperform that totally regardless of what happens at Washington. \n\nHowever, there is at least one thing that can take down the West: CENSORSHIP. If the West will have the kind of censorship that the East (Russia, China, Arab regions) have, then it's Game Over for the West, because the wish to get something done, even if the wishes are pure evil, depend on the intellectual capabilities, training, of the actors and that in turn depends on free access to information. Lack of access to university level education is a big problem in the West, but that's kind of compensated by the free access to university level study materials, like the \nhttps://arxiv.org/\nand the university lecture videos so that the brightest have the possibility to study even if they do not earn a formal degree. Software like the ZeroNet are the tools to enforce the availability of those study materials. The Western censorship tends to be in the form of \"hate speech restrictions\", \"copyright\", \"patent rights\", \"intellectual property\" in general. Think of the absurdity of the \nhttps://archive.org/details/nationalemergencylibrary\nwhere really old books, who's authors are probably dead for decades, can not be freely distributed.\n\nThat is to say, Yes, the West can be even worse at various forms of extortion and exploitation and repression than Russia and China, but there are nuances that make the West different and as long as the West can retain true free speech, the kind of free speech that as of 2020 Tor and ZeroNet aim to offer, the West will always be at least slightly better place to live than the East, even if the West were Communist and the East were Capitalist. To avoid the situation, where bad men rule due to the inactivity of the good men, people like us have to TECHNICALLY ENFORCE the free speech in the West. The technically enforced free speech is not for everyone, only for the brightest, who, like the Neo in the Matrix, care for the truth, but the technically enforced free speech must be available for that small minority of the population that is bright enough to need free speech and university level study materials.\n\n\"Blue Pill or Red Pill - The Matrix (2/9) Movie CLIP (1999) HD\"\nhttps://www.youtube.com/watch?v=zE7PKRjrid4\n",
				"added": 1589072412
			},
			{
				"comment_id": 26,
				"body": "> [mlm](#comment_1_13TBjWrxuFUr9ePoPEeo5SiZRw1DBi12VL): What is the \"west\" ? Make a country list.\n\n> [randname666](#comment_29_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): When we talking about \"west\" we usually mean non-communism countries\n\nArab countries like the Saudi Arabia are not classically communist, but they are not The West either. By The West I meant regions that have cultural values, where certain individual rights are more important than the interests of the community as a whole. For example, an individual's right to own property even if the rest of the community is dirt-poor. Given the real-estate taxes in the U.S. I'm not totally sure that the U.S. even qualifies as \"The West\" any more, because taxation of real-estate is a form of nationalization. With the New York city 10% real estate tax the whole city is nationalized in 10 years, which is clearly a very communist approach. The same with slavery that is generally called as conscription. A truly western country does not have the conscription form of slavery. The list goes on and on.",
				"added": 1589346222
			},
			{
				"comment_id": 27,
				"body": "> [merithtk](#comment_18_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): this is Why services such as Tor and ZeroNet exist, to make sure you are hidden from your government. \n\nPlease keep in mind that the ZeroNet was NOT designed for anonymity. The design goal of the ZeroNet was to allow people to publish \"pirated content\" without the censors being able to take the \"illegal content\" down. In stead of offering anonymity the social scheme of the ZeroNet is that if enough people publish/host/mirror the \"illegal content\", then the supermafiosi/governments cannot place everybody in jail, because they run out of jail space. To get anonymity with the ZeroNet, the ZeroNet server has to be placed fully behind a Tor proxy and the LAN/localhost web browser for viewing ZeroNet pages, zites, must also be fully behind the Tor proxy, because zites can contain 1-pixel images that are loaded from censored net and the download of those 1-pixel images or just plain CSS-files can be tracked, which effectively breaks the anonymity. Just using the torsocks IS NOT ENOUGH to place the ZeroNet server/node properly behind a Tor proxy. An operating system firewall based approach can work, provided that the operating system has not been \"too compromized\".",
				"added": 1589518302
			},
			{
				"comment_id": 28,
				"body": "> [thorburn](#comment_71_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Freedom and Privacy are dead and that was and is the plan https://www.bitchute.com/video/1JLBXfKDbbI/\n\nPlease define Freedom? Something like the one described at this video?\n https://www.c-span.org/video/?170214-1/how-found-freedom-unfree-world\nIn regard to Your reference at bitchute.com, it is a typical American exaggeration that lacks explanations about causal relations. It's just blabber about some options that people might take.",
				"added": 1589556404
			},
			{
				"comment_id": 30,
				"body": "> [thorburn](#comment_74_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): @a2llfd I cant reply as @Nofish hasn't increased my data limit \n\nYou can just generate a new identity, if the limit does not get increased automatically.",
				"added": 1589577287
			}
		],
		"1589315867_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 21,
				"body": "You may want to take a look at \nhttps://www.homebrewcpuring.org/ringhome.html",
				"added": 1589339816
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 22,
				"body": "I think it is time to take a step forward and use robots for firing the guns in stead of manually holding them. Besides, gun's aren't necessarily the most efficient weapons for political assassinations. The sub-goal of a political assassination is to kill the target and there is nothing that says there that it has to be done quickly or with a gun. \nSearch for \"killer drones\". Add poison arrows or poison-airgun-bullets to the mix and the weapon becomes much lighter and therefore much more drone-worthy than some heavy barrel. If the barrel does not need to withstand heat for long periods of time, then titan inner side of the barrel combined with carbon fiber for strength might be an option to create a drone-suitable version of some sort of a gun. Use Your imagination, don't stick to the old ideas, create Your own ideas.",
				"added": 1589340223
			}
		],
		"1585101196_1Ahyyr1tEzvP9hZC2iocNTZfEp7zfJwbCJ": [
			{
				"comment_id": 24,
				"body": "What about a ZeroNet server that is tunneled through Tor?",
				"added": 1589345286
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 25,
				"body": "All IT-entrepreneurs get excited about pandemic related increase of dependence on IT. About Bill Gates being evil, I think that he is not evil, but a thought that he shouldn't act like a bastard does not occur to him in time. It's nice that it occurs to him at least with a great delay, which may partly explain his Foundation based charity work on medical matters and education topics.",
				"added": 1589345605
			}
		],
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 29,
				"body": "> [blahblah69](#comment_85_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): fuck networks like this from any mainstream adoption.\n\nIs there any particular reason, why pigeons on the street suddenly start to find PDF-files of books or porn videos interesting? The moment ZeroNet goes mainstream, many of th mainstream problems come with it.",
				"added": 1589557055
			}
		]
	},
	"comment_vote": {
		"2144_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"59_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1
	}
}