{
	"title": "末世之花",
	"description": "随便写点。\n百合小说，\n荤素不忌。",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1506607902,
	"post": [
		{
			"post_id": 4,
			"title": "逆徒",
			"date_published": 1499059780.314,
			"body": "　　\n\n　　锁链牵引着她的四肢，头枷控制了她的脖颈，视野中仅有的，就是一堵光秃秃的、发霉的墙壁。\n　　三天了，墙上的灰泥又剥落了一块。这时，她听见身后有脚步声，越来越近。\n　　是行动的时候了。\n　　一旦下了决心之后，事情就变得出奇的容易。\n　　反正她身上的衣服早已因为连日刑罚折磨变得褴褛。就算手脚都被锁链所制，只能四肢着地，用一个屈辱的姿势跪在地面上，但是只要适当的摆动腰肢，那些守护她尊严的布片就会坠落下来。\n　　如果是平时，她死也不会这么做的。\n　　但她已别无选择。那份重要的军情，如果不在今天送出去，就再也没有机会。\n　　那军情只有一份——在她心里。而狼牙军还不知情，只以为她是个普通的唐门女子。可是如果还不能离开狼牙军的地牢，那么三天以后，毫无疑问，大唐的军队将一败涂地。\n　　现在的她，被灌了软筋之药，武功全失。唯一的倚仗的，就只有她的脸，她的肉体。\n\n　　身后那脚步声，在距离她一丈远的地方停下来了。\n　　理应如此。\n　　因为她几乎已全身赤裸，唯一的附着物，就只有束发的头绳，和脚上的高底靴。\n　　更何况因为锁链和头枷的束缚，她只能维持着双膝跪地，臀部高翘，趴在那里的姿势。\n　　——这无疑是所有男人看一眼都会发狂的姿势。\n　　但她并不了解自己的身体在男人眼中是什么模样——如果她了解，自然就不会这样忐忑了。到了她这个年纪，还从未对男子动过芳心，听上去也许有些可笑吧。然而这么多年，她全副心思都扑在研习本门技艺上。之后就有了战事。在这战火之中，哪有她谈情说爱的地方呢。\n　　不过还在唐家堡习武时，洗浴都是和其他女弟子一起的。从浴室中众多低垂的、隐含嫉妒的目光，她猜测自己的身材或许不错。\n　　并且，因为她从不荒废武功，那包裹在高底长靴里的双腿也一直浑圆，修长，结实，饱满。\n　　又因为不曾生育的缘故，她的小腹也平坦、光滑，没有一丝赘肉痕迹。\n　　这样的身子，今夜究竟要交付给谁呢？\n　　因为脖颈上套着的沉重头枷，她没办法回头，但是听着刚才脚步声的轻重，她判断，来的应该是个瘦小的男子。\n　　但愿他不会太粗暴——这念头刚一出现，连她自己都觉得可怜又可笑。\n　　但这毕竟是她人生第一次。如果世上没有狼牙军，本不该是这样。罢了，把这件事忘了吧。现在，她要用在唐门里学到的技艺，假装成一个风情万种、阅人无数的女子。\n　　她不仅要让那狱卒恣意，还要让他怜惜，让他着迷，只有这样，她才有逃出去的希望。\n　　只是……为什么过了那么久，那个狼牙狱卒还是不动？\n　　是在发怔，还是正肆意窥看她的身子？\n　　生怕那人离去，她赶紧水蛇般扭动自己的腰肢。\n　　【大爷……奴家的衣服……都破了……】\n　　这嗔怪委屈的娇媚声音，着实让她费了些力气。\n　　好在这力气没有白费，那人的呼吸果然迟滞了片刻，接着，双脚又靠近了一步。\n　　她相信这人是绝对不会再离开的了。\n　　她正打算一鼓作气，再说上两句，忽然听见那人低低的咳嗽声。\n　　她一听到这声音，心中就是一惊。\n　　那声音相当稚嫩……难道还是个少年？\n　　她生怕这人离去，于是又道：【大爷，行行好……替奴家、拿件……蔽体的东西……】\n　　笑声。\n　　那狱卒居然低声笑了起来，然后清清嗓子，开了口：\n　　【衣服破了？依我看，是你这淫妇自己扯下来的吧。】\n　　——这少年年纪轻轻，居然说得出这样的话……！\n　　但现在不是倔强的时候。她只好假作委屈道：【这地牢里蚊虫太多，咬得奴家全身痒，忍不住就想乱动，谁知道……会破成这样呢……】\n　　【痒？哪里痒？——是红红的乳尖儿，还是白白的屁股沟儿？】\n　　【哎呀~大爷真会取笑奴家……大爷说得奴家好羞，又不肯帮奴家解痒……】\n　　若是她再年轻十岁，让她对一个乳臭味干的少年说出这样的话……大概是会羞死当场罢。\n　　所幸话刚说了一半，她就听见身后一阵钥匙响，之后，牢门的锁孔里就传来了机括转动的声音。\n　　牢门吱呦一声开了。\n　　脚步近了。\n　　她的心跳一下子变快。\n　　一阵气流。是那狱卒朝她凑过来。\n　　因为头枷太紧，她不能回头看那狱卒的模样。\n　　但那人竟将唇凑近了她的耳畔。因为她甚至可以听见那人温热的呼吸……\n　　【你这淫妇，想让我怎么帮你解痒啊？】\n　　她的耳朵【嗡】地响了一声，好像鼓膜都要破了，即便如此，她还是尽力挤出声音道：\n　　【用你的……插……】\n　　【什么？】\n　　【用你的……那话儿……插我……下面……】\n　　她假装着急不可耐的模样，又一次扭动了自己的腰肢。\n　　与此同时，一股从未有过的强烈羞耻感，从她的下体蔓延开来，直烧到她的耳根。\n　　这寥寥几个字，几乎耗尽了她所有的精神。\n　　更让她想不到的是，这几个字刚一脱口，她就感觉到身体里自己酝酿出了一股温热的溪流……\n　　据说这样，进入的时候就会顺畅一些，她的痛苦也可以少一些。\n　　但是这是敌人的挑逗，为何也会起反应？而且听那人的声音，多半还是个小屁孩儿……\n　　她想：【但愿这一切能快点结束！】\n　　他的年纪并不大，也许会心急，也许经验不足，也许，要不了多久……\n\n　　她想错了。\n　　就好像看穿她心思似的。身后那人并没有急切地脱下自己的裤子。没有。\n　　他只是伸出右手，轻轻触碰了她浑圆雪白的右臀。\n　　那只手并不怎么粗糙，骨节也纤细。大概因为还年轻吧。\n　　手有点凉。她忍不住打了个颤。\n　　【冷么？】\n　　她还没回答，就感觉搭在臀部上的那只手变热了。这是怎么回事？难道这狱卒也是习武之人，为了让手热起来，竟运起内力来？\n　　还没等她明白过来，另一只手也落在了她身上。温热的指尖在她光滑的脊梁上抚摸着，从尾骨往上滑，再重新滑下去，然后，两只手在她臀部两侧，熟稔地揉捏着……\n　　她突然觉得想要呕吐。\n　　比起预想的粗暴插入，这抚摸反而让她觉得更加难以忍受。\n　　因为这抚摸，正提醒她，她正在做这狱卒手中的玩物……\n　　【哎呀。硬起来了。】狱卒说着，手忽然停下了。\n　　——什么？\n　　她脸上一热，声音也不禁变高：【那就别摸了，快进来……】\n　　【说什么呢。】\n　　少年的声音虽然稚嫩，却好没有一点怜惜之心。\n　　那双手又沿着她腰侧滑上来，滑到了她的胸部，在她的乳尖上，轻轻捏了捏。\n　　……！\n　　强烈的羞耻又一次袭来了。\n　　原来那少年说的【硬起来】，并不是他身上的某物，而是她的乳尖。\n　　头枷挡住了她下窥的视线，她看不见自己身体被玩弄成什么模样。一切就只能靠身体的感觉……\n　　【真美啊……】\n　　狱卒推了一把她的臀部，逼得她不得不将上身挺立起来，然后右臂一把绕到前面，搂定了她的腰肢，左臂却从她腋下穿过，玩弄起她的左乳。\n　　那是靠近心脏的位置。她的呼吸一下子凝滞了。她实在害怕这人会从她急促的心跳里猜出她的计划。\n　　还有，这姿势也太难为情了。\n　　她的上身挺立着。虽然明知前面只有一堵灰墙，虽然视线也被脖子上挂的头枷遮挡，但是一丝不挂的她，仍然觉得自己的身体，一览无余……\n　　呼。\n　　温热的气流，吹向她的耳垂。\n　　然后就是狱卒低低的笑意。\n　　【真想让你看看啊。】狱卒轻轻托起她的左乳，【只揉了几下，就比右边大了一圈儿呢。】\n　　她恨不能将这畜生撕碎。\n　　但说出口的，却只能是娇媚的喘息：\n　　【大爷……右边这个，也想被你疼呢。】\n　　那少年的狱卒又笑了。\n　　但他并没有去揉她的右乳，反而撒开了手臂。\n　　身体突然失去支撑，沉重的头枷猛地一坠，她又跌回了最初的姿势。\n　　四肢着地，臀部翘起的姿势。\n　　这是打算做什么？她正想着，那双手又落在了她的臀上。这一次没有揉弄，而是往两边轻轻推开了。\n　　她身子一僵，闭上双眼，等着东西插进来……\n　　【哎……】\n　　有点诧异的呼声。\n　　那狱卒口中温热的气息，轻轻扑在她的臀部上。\n　　——不要看！\n　　她几乎要喊出来。\n　　如果被发现自己还是个姑娘，她的计划就全完了。她伪装的急不可耐轻易就会被识破。剩下的也会变成一场没有必要的侮辱……\n　　这人还年轻，也许还看不出这些——这根细小的稻草，究竟能不能抓在手里？\n　　她听见狱卒吸了一口气。\n　　【真是……美极了……】\n　　有点硬的巨物，终于顶上了她的玉门。\n　　她的全身都僵硬着。接下来将是她从未有过的体验。她期盼那狱卒，千万不要发觉……\n　　可是那巨物仅仅探进一点点，就立刻抽离出来。\n　　难道还是被发现了？\n　　她赶紧扭了扭身子，努力想要转身过去：【大爷……不要戏弄人家……快点……】\n　　她话还没说完，就停住了。\n　　一只有点柔嫩的手举在她眼前，中指上布满了亮晶晶的汁液，沿着手指淌下，一直流到了指缝。五指张开，中指和无名指间就牵出了亮晶晶的丝线。\n　　她一瞬有些懵，好一会儿才明白——她以为探进自己身体的巨物，其实仅仅是一节纤细的指尖而已。\n　　这亮晶晶的丝线，大概就是……\n　　她实在不敢相信，自己居然已经湿到了这个地步。\n　　【舔干净。】\n　　她忍着屈辱，伸出了舌头。\n　　【滋味如何？】\n　　她张开嘴，不知该如何回答，下身就又是一紧。\n　　又有东西探进了她的身体。\n　　这是狱卒的另一根手指。因为之前的抽送牵出了不少汁液，这一次变得有些干涩。但是很快，溪水的上游又涌来了新的融雪。就好像已适应了这外来的侵犯似的，汁水越来越多，静静的地牢里，竟然渐渐可以听到水声……\n　　她猛然觉得不妙。\n　　这狱卒怎么一直玩弄她的身体，却迟迟不肯进正题？\n　　想到这里，她忍不住催促道：【别……别玩了！快给我……】\n　　狱卒【嗤】的笑了。\n　　【给你什么，给你停下？】\n　　【给我……你那话儿。】\n　　【那话儿？小淫妇，你不是只要有东西在这里抽插，就湿得稀里哗啦么？】\n　　她忍住心底的愤怒，强颜媚笑道：【大爷，别戏弄奴家。奴家也想让大爷爽一回啊。不然奴家心里，也没什么乐趣。】\n　　她听见那狱卒忽地站了起来。\n　　紧接着，又是钥匙响。\n　　这一次，钥匙从她的正后方，插进了头枷的锁孔里，轻轻转动。然后咔蹦一声，那沉重的头枷竟也打开了。\n　　头枷移走之后，她的头终于可以自由转动，也可以转个身了。这意外的举措让她有些迷茫。她猜测这恶毒的少年，或许正打算用那肮脏的东西侮辱她的嘴……\n　　【淫妇，别盯着墙发春了。——转过来，看着我！】\n　　她强忍着屈辱，慢慢回过头，终于看到了这人身上狼牙士卒的衣装。\n　　这人个子并不矮，但很瘦。那衣装似乎尺码有些偏大。头上还扣着一顶大帽子，几乎将脸完全遮住。\n　　大概是看出她对自己长相的好奇，那人伸出手来，摘下了头上的帽子，丢开了，顺势甩了甩头发。\n　　那竟然是一头乌黑的长发。\n　　而且，和她一样，那些头发高高的竖起一个马尾。\n　　更奇特的是，连头绳的绑法都完全相同……\n　　当马尾终于在眼前静止之时，她胸口突然一股气血急涌……\n　　【——别来无恙啊。我的好师父。】\n　　那狱卒坐下来，扬起秀气的脸孔，朝她微微一笑。\n\n　　她从来没有收过男徒。准确说，她的徒弟从来就只有一个，是个女徒。\n　　这唯一的女徒，是她二十岁时，师姐硬塞给她的。刚满十岁、干净、聪明、又有点孤僻的小姑娘，据说是个弃儿。四年之后，她没有可以教那女徒的东西了，那女徒便拜别了她，离了唐家堡，往远方历练。\n　　不想之后，便是天下大乱，音信断绝。\n　　更想不到的，是今日这般的重逢……\n　　【你……竟投了狼牙军……你这逆徒！】\n　　她忍不住破口大骂，泪水上涌。\n　　没想到，那逆徒竟笑了起来。\n　　【彼此彼此啊，师父，刚才狼牙军操你的时候，你不是也哼得很舒服么？】\n\n　　——我的身子……竟然被徒弟玩弄了？\n　　——徒弟……是狼牙军？\n　　——我……居然还哼得……很舒服？\n　　她呆呆跪在地上，脑中一片空白……\n　　那逆徒凑近了她，紧紧从背后搂住了她赤裸的身子。\n　　【别碰我！】\n　　她竭力喊着，却几乎发不出声音。\n　　那人身上粗糙的狼牙军服在她身上磨蹭，她不觉得痛，只觉得恶心。她想挣扎。但是内功尽失的她，根本使不出一点力气。她越动，那人搂得越紧，两手托着她丰满的乳房，鼻尖嗅着她的脖颈。她拼命摇着身上的铁链，希望能引来其他人，可是那人却毫不在意，反更加肆无忌惮，用舌尖在她的脖颈一侧来回舔着，又凑近她耳畔，低声道：\n　　【这里是狼窝，狼都饿极了。想被分了吃，就闹吧。】\n　　她听见【分了吃】三字，下体猛地收紧了。那逆徒却好像真要吃了她似的，用唇咬住了她的耳垂，轻轻品咂着。那正是她身上一处极敏感的地方，她只有咬紧牙，才能不让自己呻吟出来。即便如此，她仍从牙关中恨恨挤出声：【你……唐门待你不薄，你怎能做出这等事来！】\n　　那人微微一笑，松开了她的耳垂，道：【徒儿早就说过，徒儿学了武艺，只想在衙门里谋个铁饭碗……是唐军，是狼牙，也顾不了那么多了。】\n　　【你……你也是个女人啊！你怎能对为师……】\n　　那人听到这里，突然纵情大笑起来。她听到这笑，便不敢再说下去。那人猛地将她翻过身来，按在地上，却不再有其他动作，两眼灼灼，似有火光，凝视着她的眼睛，很久才说：\n　　【看来你真的不明白……你身上每一分，每一寸，都美得销魂。】\n　　看着徒弟认真的眼神，她忽然觉得自己两颊火热起来。\n　　逆徒的脸上忽又变作诡秘一笑：\n　　【而且，我早已是狼牙军啊。这伤天害理，有悖人伦的事，我不干，还轮的上谁？】\n　　【你……你这欺师灭祖的畜生！你……唔……】\n　　她的话被堵住了。逆徒扳住了她的下巴，强硬地吻着她。她拼命紧闭着双唇，却还是被逆徒的舌尖撬开。她撑不住，只好张开嘴喘气，却不料被这人的舌尖卷进了牙关。她刚想用牙齿咬断这逆徒的舌头，却不料下巴的关节被一直强横的手制住了，牙关根本无法合拢，只能任由这人的舌尖在嘴里肆虐……\n　　【哈……哈……】\n　　唾液顺着唇边垂下，挂出一条晶亮的丝线，流淌到了胸脯上。逆徒低下头，将她胸口垂落的唾液舔去，顺势用舌尖挑逗她的乳尖。她扭着双腿体想要避开，却被两只手强行将双膝打开。\n　　【别……别这样！】\n　　她哀求着，眼中多了一丝惊恐。\n　　【为什么？刚才不是还求我求得不得了吗？】\n　　【刚才我以为是别人！】\n　　【陌生人就可以随便抽插，认识的人反而不行么？……师父你啊，真是徒儿想不到的淫乱……】\n　　说话的时节，那温热的手又伸到她两股间，轻轻挑逗。和逆徒说出的污言秽语不相符，这挑逗灵活又轻柔，只在玉门外逡巡，却没有挥师直入的意思。忽然奇兵一转，捏住了她的蕊珠儿，她身体便猛地一颤，两股间又湿润了。\n　　【怎么会……】\n　　【‘怎么会’？自己看，都快湿成大瀑布了——师父，你真是不坦率。】\n　　——不坦率……什么意思？\n　　【你装成一副淫娃荡妇的样子，其实已寂寞了二十八年了吧？何不早点坦率些，也早点知晓这人间的快乐……】\n　　逆徒说着，忽然撩起上衣，解起腰带来。\n　　【你这逆徒……又想做什么！】\n　　今日让她震惊的事实在太多，她甚至觉得，那腰带若解开，会出现什么了不得的东西。\n　　逆徒坏笑起来。\n　　【刚才说的话，现在就忘了？你不是说，‘也想让大爷爽一回’吗？】\n　　宽松的裤子褪了下来，露出了一样修长赤裸的双腿。抽出的腰带在手上挽了挽，随后如鞭子飞起，抽落在她大腿的内侧。雪白的肌肤上立刻多出了一道红印。\n　　她绝望地转过头，面对着墙壁。那人却有意绕到她面前，背靠着墙，和她面对面坐在地上，然后，长舒一口气，握住起了她的头发，强行将她的头抬起。\n　　【舔我。】\n　　【你这孽障……！】\n　　谁知逆徒笑得更欢了。\n　　【师父，这就不对了。你不是曾教我，唐门好儿女，要言出必行么？何况……】\n　　逆徒回过头，瞥了一眼落在地上的那条腰带。\n　　她也忍不住往那裤子上看去，不禁心中一动。\n　　那一大串锈迹斑斑的钥匙，就拴在那条腰带上。\n　　可惜那腰带被丢得太远，即便把胳膊伸到最长，也是无法触及。\n　　【你的目的，就是这串东西吧。不然以师父的品性，怎么会轻易糟践自己的身体？】\n　　逆徒说的正是她心中所想。她只能沉默不语。\n　　逆徒又道：【等到了五更天，就是地牢看守防备最弱的时候。钥匙就在这儿，能不能拿到手，就要看师父的本事了。】\n　　她沉默片刻，低声问：【你……你想要我怎么做？】\n　　【怎么做？哈。】逆徒勾起了她的下巴，【大美人儿，你是我师父，难道要我反过来教你不成？】\n　　说完就在墙边伸了个懒腰，将两条长腿抬起，钩上了女囚的玉肩。\n　　女囚下意识闭上了眼睛，好容易平静了呼吸，才慢慢睁开来，低垂着目光，微微侧过脑袋，试着朝眼前人大腿内侧亲吻了一下。\n　　这吻刚松开，她就听见了一声甜美的呻吟。抬起目光，她看见这人的目光居然迷离起来。\n　　会有这么享受么？她忍着心里的厌恶，沿着大腿内侧，慢慢往下吻。有时还在吻的间隙试着用舌尖触碰一下。有一点淡淡的盐味。等到那吻落到大腿根部附近时，她听见这人的声音很明显的急促了。\n　　于是她弃了这一侧的大腿，又从另一侧膝盖内侧吻起。那人的呼吸又平缓了。然后又急促。\n　　接下来，就是最重要的部分了。\n　　她吃力地挪动了锁链牵引下的身子，像可怜的小猫一样弓起后背，用冰冷的十指分开了那茂盛的毛丛，强忍着泪水，埋首在逆徒的两股之间，用自己的嘴侍奉她。\n　　多年以前，看着面前那个十岁的孤女，她怎么会想到还有今天？究竟是哪里出了差错？\n　　出乎她意料，逆徒这一次既没有用言语侮辱她，也没有呻吟和喘息。好像乐器上一根安静的弦，明明紧紧绷在那里，却始终没有声音。她已分不清了，自己对这逆徒是怨还是恨，还是别的什么。可是这冤家给她的承诺，她还记得。钥匙，一切只是为了那串钥匙。她的唇舌已麻木得不像自己的，不知是唾液还是什么的东西淌了一地。但她还是没有停。哪怕那个人依然静，静得可怕，像雷雨前的天空，爆发前的火山……\n　　【……够了！】\n　　那人突然剧烈喘息起来，揪住了她的头发，提起了她的头。她挣脱不了，只能倔强地和那人对视，却在那双眼里看见了欲念的火光。于是她干脆用带锁链的手往那人衣服里探，还没触到胸口，就被那人抓住了手腕，紧接着，再一次被吻住了双唇，再一次被压在了身下。那人好似中了邪，亲吻与十指不知疲倦地在她身体上时而温柔，时而肆虐。这嘴，是曾一声声叫她师父的嘴；这手，是习武时她几次摸过的手……完了，一切都完了。信念，忠诚，记忆……海水倒灌进河床，摧垮了两岸的庙宇，化作碎片，与波涛一道喷涌迸飞……\n　　【我要……杀了你！】\n　　竭力弓起身子，喊出这一句之后，她便失去气力，颓然倒下，没过多久就闭上了眼睛……\n　　她倒在逆徒的臂弯里。\n　　逆徒俯下身，脱下军服盖在她身上，轻轻吻掉她的泪水。\n　　【师父你啊，真是幼稚。】\n　　她将师父轻轻靠在墙边，把地上拴着腰带的那串钥匙拾起来，放在了师父两股之间。之后轻轻起身，打开牢门，再轻轻虚掩上。\n　　月光从地牢的气窗照进来，把她的腰肢照成一段冰雪。\n　　地牢长廊寂静，囚犯也已睡着。她半裸着，走出了地牢的梯子，走上地面，走到溪水边，坐在溪水边上，一边摆弄着千机匣，一边回望着一面面夜风中飘扬的大旗。\n　　启明星出来了。一个狼牙兵卒匆匆逃出了营帐，偷了一匹马，一路狂奔。她举起千机匣，瞄准兵卒的后背，看着那兵卒越走越远，直到天的尽头，她看不见的地方。\n　　然后她微微一笑，将千机匣倒转过来，扣动了扳机。"
		},
		{
			"post_id": 3,
			"title": "題解",
			"date_published": 1498799032,
			"body": "一直都是壞消息。走在路上。聽說網路小說將經受審查。聽說同性戀將不能在任何影視作品中展現。直疑所在非是人間。\n\n這一年裡我失去了很多，也得到了很多。往昔的樂園，今天忽然被冠上了索多瑪的名號。在淤泥中行走，又能保持多久的潔白。\n\n末世之花，不是DOD3的寄生植物‘[滅世之花]，它只是一朵小野花，不知從何而來，不知到何處去，不知憂，亦不知死。但它終究要開放。即便不能開放，即便凋謝，仍然是花。\n\n而愛花的人，也只是想給它找一個開花的地方。\n\n是爲解。\n\n06-30-2017"
		},
		{
			"post_id": 2,
			"title": "女王的XX 01",
			"date_published": 1499058110.918,
			"body": "女王的XX\n\n0\n这是一个虚构的故事。\n\n1\n如果N市是罪恶的大都会，而A就是这所有罪恶中最平凡的一种。\n她健康，性感，有火腿般的肌肉和果冻似的脂肪。但绝不美丽。一个性感的女人未必就是漂亮的女人，而漂亮的女人又未必是美丽的女人。\n而她根本连女人都不是。\n她是【女王】。\n\n女王不一定挥着皮鞭，穿着皮衣，脸上化着冷酷的浓妆。\n虽然A也经常是如此。\n而且也确实有奇怪的男人，付着每小时三千元的价码，让她穿着19cm的高跟鞋，在地毯上一遍又一遍求她踩踏。从头到脚，最后狠狠地踏向他的老二。\n而且也确实有更奇怪的男人，把形状奇怪的钥匙和地址寄到她的住所，等着她按照地址找过来，用那把钥匙打开更奇怪的笼子。\n但她并不是那种女王。\n因为这些事情做完之后，皮条客会把钞票甩到她的脸上。\n【喏，你可以走了。】\n衣服是从夜总会借来的。连那手里的鞭子也是借的。\nA只是一个普通的钢管舞女，所有罪恶中最平凡的一种。\n她会很多奇怪的本事。小偷小摸。吹口哨。还有各种东洋流绳结的打法。所以暂时饿不着。\n但也没什么大用。\n\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	],
	"tag": [
		{
			"value": "非虚构",
			"post_id": 3
		},
		{
			"value": "剑网3,",
			"post_id": 4
		},
		{
			"value": "短篇,",
			"post_id": 4
		},
		{
			"value": "百合,",
			"post_id": 4
		},
		{
			"value": "古代",
			"post_id": 4
		},
		{
			"value": "女王的XX,",
			"post_id": 2
		},
		{
			"value": "现代,",
			"post_id": 2
		},
		{
			"value": "百合,",
			"post_id": 2
		},
		{
			"value": "伦理,",
			"post_id": 2
		},
		{
			"value": "科幻",
			"post_id": 2
		}
	]
}