{
	"title": "Villoldos Notizen",
	"description": "Kunst & Philosophie",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1496905894,
	"post": [
		{
			"post_id": 3,
			"title": "Lebenszeichen",
			"date_published": 1496905666,
			"body": "Ich habe über ein Jahr keinen neuen Post veröffentlicht. Der Grund dafür ist einfach. Ich habe viel zu tun und schreibe auch auf anderen Plattformen. Ich beobachte die Entwicklung von ZeroNet und werde hier weiterhin aktiv sein."
		},
		{
			"post_id": 2,
			"title": "P2P – die Krönung des Kapitalismus?",
			"date_published": 1461218480.368,
			"body": "Im Zusammenhang mit Bitcoin wurde schon mehrfach darauf hingewiesen, dass die neue elektronische Währung vor allem zu Spekulationszwecken genutzt wird, letztlich also bloß libertäre, kapitalistische Interessen bedient. Wer im Internet nach den Begriffen ›Anarchocapitalism‹ oder ›Venture Capital‹ im Zusammenhang mit Bitcoin sucht, wird schnell fündig. Bitcoin wird immer wieder als ein Musterbeispiel für eine Peer-to-Peer-Anwendung zitiert. Ist P2P vielleicht nicht die erhoffte Lösung, sondern der krönende Abschluss des Kapitalismus?\n\n## Schillernder Begriff\n\nDer englische Begriff ›peer‹ wurde in ganz unterschiedlichen Zusammenhängen gebraucht. Er bezeichnet den Kollegen, den Gleichaltrigen und den Ebenbürtigen. In der letzten Wortbedeutung bezeichnet ›peer‹ auch ein Mitglied des Hochadels. Im Kreis des Hochadels ist der Adelige, der sonst streng auf die Standesunterschiede achten muss, unter seinesgleichen. In jeder der aufgeführten Wortbedeutungen bezeichnet der Begriff ›peer‹ das Mitglied einer Gruppe aus Menschen, die sich in einem bestimmten Hinblick gleichen. Sie arbeiten im gleichen Fach, sie sind gleichen Alters, sie sind alle gleich blaublütig. Das, worin sie sich gleichen, ist jedoch auch das Kriterium, in dem sich die ›peers‹ von den anderen, den Nicht-Gleichgestellten, unterscheiden. Nur in einer Gesellschaft mit streng voneinander abgegrenzten Gruppen kann man von ›peers‹ sprechen. Wer sich als ›peer‹ bezeichnet, betont also die Grenze, die ihn von den Nicht-Gleichrangigen trennt. Zum ›peer-review‹ in der Wissenschaft sind nur Fachkollegen zugelassen. Wer sich als ›peer‹ bezeichnet, besteht auf einem Rangunterschied. Das sollte man sich in Erinnerung rufen, da der Begriff in der P2P-Diskussion häufig in einer naiven egalitären Bedeutung benutzt wird.\n\n## Was ist ein ›peer‹, wenn alle ›peer‹ sind?\n\nWenn von P2P-Technologie, von einer P2P-Wirtschaft oder gar einer P2P-Gesellschaft die Rede ist, bekommt man den Eindruck, dass in der P2P-Welt alle Menschen zu ›peers‹ werden. Die Kommunikation mit Hilfe von P2P-Technologien läuft im Prinzip so ab wie ein Gespräch auf einem offenen Marktplatz. Jeder spricht mit jedem, ohne Vermittlung durch Dritte. Und genauso soll die P2P-Wirtschaft funktionieren. Jeder handelt direkt mit jedem ohne Zwischenhändler. Im Grunde haben wir es hier mit der anarchokapitalistischen Vision einer völlig freien Marktwirtschaft zu tun, in der alle Marktteilnehmer als einzelne, freie Individuen agieren. Wenn auch die Vision utopisch erscheint, so scheint sie, was die Individuen betrifft, der Realität schon sehr nahe zu kommen. In unserer neoliberalistischen Gesellschaft sind wir alle zu vereinzelten Akteuren atomisiert worden, die auf einem anonymisierten Markt miteinander konkurrieren und gegen die Macht des Kapitals nicht die geringste Chance haben. Nahezu alle Institutionen, die dem Kapital etwas entgegensetzen könnten und in denen wir uns früher – freiwillig oder aufgrund gesellschaftlicher Traditionen (aka Zwänge) – organisiert haben, wurden marginalisiert: die Kirchen, die Gewerkschaften, die Territorialstaaten. Die Kirchen, die früher das gesamte gesellschaftliche Leben regelten, können heutzutage nicht einmal mehr die Ladenöffnungszeiten an einem einzigen Tag in der Woche bestimmen. Die Gewerkschaften, die einmal landesweit gültige Flächentarifverträge für ganze Branchen aushandelten, in denen Löhne und Gehälter festgeschrieben waren, die ein halbwegs menschenwürdiges Leben garantierten, haben sich durch Flatrate-Tarife im Puff korrumpieren lassen und spielen wirtschaftlich keine Rolle mehr. Und die Territorialstaaten sehen dem Treiben des globalisierten Kapitals, das ganze Staaten ins Elend stürzt, bloß noch hilflos zu. Kirchenfürsten, Gewerkschaftsbosse und Präsidenten sind simulieren bloß noch ihre Macht wie die Darsteller in einer Opera buffa. \n\nUnd in dieser Situation will man uns weismachen, dass Peer-to-Peer unsere Rettung sei? Wir sind auch ohne P2P schon alle gleich, nämlich gleich machtlos und marginal. Die Unterschiede, die es noch gibt, und die darüber entscheiden können, ob man als Flüchtling im Mittelmeer ertrinkt oder in der ostdeutschen Provinz seinen Frust in sich hineinfrisst, sind zufällig. Und sie werden in der ostdeutschen Provinz auch so wahrgenommen. Denn die hässliche Verbissenheit, mit der die rassistischen und nationalen Bewegungen ihre Privilegien verteidigen, die ihnen rein zufällig durch die Gnade der Geburt am richtigen Breiten- und Längengrad zugefallen sind, zeigt, dass sie keine Hoffnung haben, durch ehrliche Arbeit und gesellschaftliche Solidarität ihren Wohlstand zu halten oder zu verbessern. Acht Milliarden ›peers‹ auf der Welt konkurrieren mit ihnen um die Brosamen des Kapitals. Nichts und niemand kann ihnen beistehen – kein Sozialstaat, keine Gewerkschaft, keine Kirche. \n\n## Kein P2P ohne Commons\n\nP2P steht also zunächst einmal ganz in der Tradition des Liberalismus, der das Individuum von allen traditionellen Bindungen an Staat, Kirche und Milieu befreit hat, um es als bindungslose, zählbare Monade der Verfügungsgewalt des Kapitals zu unterwerfen. Und diese problematische Tradition gestehen sich viele Vertreter der P2P-Bewegung nicht ein. Wie der Gründer der [P2P-Foundation](http://p2pfoundation.net/), Michel Bauwens, verwenden viele den Begriff ›P2P‹ synonym zu dem Begriff ›Commons‹. Sie skizzieren umfangreiche [Utopien](https://youtu.be/sO-QJLDpHQ0) rund um den Begriff ›P2P‹, ohne auf die Probleme des dauervernetzten und gleichzeitig isolierten Individuums in der digitalen, neoliberalen Gesellschaft einzugehen. \n\nVielleicht sind die ›peers‹ des neuen Zeitalters nichts anderes sind als die Hippies des 21. Jahrhunderts, [die ein Stück Urwald in Besitz nehmen, das ihnen nicht gehört](https://kaluyala.com/), um sich ›auszuprobieren‹. Sie reisen zwar nicht mit Sprengstoff und schwerem Gerät an wie eine internationale Minengesellschaft, aber sie okkupieren mit der Arroganz von Kolonialherren ein Areal, in dem sie schlicht und einfach nichts zu suchen haben. \n\nDie Produktivkräfte der Digitalisierung und der P2P-Produktion sollten nicht unterschätzt werden. Die Utopien eines Michel Bauwens könnten sehr schnell als Dystopie Realität werden. Die P2P-Revolution wird auch Verlierer zurücklassen."
		},
		{
			"post_id": 1,
			"title": "Das Tanztheater als Disneyland",
			"date_published": 1457971403,
			"body": "Die große [Pina-Bausch-Ausstellung](http://www.bundeskunsthalle.de/ausstellungen/pina-bausch.html) in der Bundeskunsthalle in Bonn hat begonnen. Bis zum 24. Juli läuft ein Programm, das es so wohl noch nicht gegeben hat. Kernstück der Ausstellung ist eine Kopie der Lichtburg, dem legendären und Außenstehenden verschlossenen Probenraum des Tanztheaters Wuppertal. In diesem Nachbau sollen die Besucher sich wie Tänzer von Pina Bausch fühlen und zum Beispiel die berühmte [Nelken-Line](http://concert.arte.tv/de/nelkenline) nachspielen. Unter Anleitung von Tänzerinnen und Tänzern des Ensembles soll der Zuschauer einen Einblick in die Arbeitsweise des Tanztheaters Wuppertal bekommen. Ob dies gelingt, kann ich aus der Ferne nicht beurteilen. Aber es liegt durchaus im Trend der erlebnisorientierten Museumskultur, für die die Bundeskunsthalle bekannt ist.\nIst die Ausstellung ein tanztheatralisches Disneyland? Müssen wir die Menschen, deren Empfindungsfähigkeit durch Reality-TV verkümmert ist, mitten in das Geschehen hineinholen, damit wir sie überhaupt noch erreichen? Ist es nicht absurd, die Bühne – und wenn es auch nur die Probenbühne ist, die überdies noch existiert – in die künstliche Wirklichkeit eines Museums zu versetzen, während doch Pina Bausch in ihren Stücken oft die bis dahin vernachlässigte Wirklichkeit des Lebens auf die Bühne holte? \nVielleicht ist es gut, dass eine solche Ausstellung mehr Fragen aufwirft, als sie beantwortet. Allerdings kommt die Ausstellung damit dem Nachahmungstrieb entgegen, der jeden befällt, der sich mit den Stücken von Pina Bausch intensiver beschäftigt. Ich weiß noch, wie ich mit Freunden nach einer Vorstellung die Nelken-Line nachspielte. Und auch die Bewegungen, die man heute als typisch für Pinas persönlichen Tanzstil empfindet und die mit den Adjektiven ›autistisch‹, ›selbstbezogen‹ oder ›selbstvergewissernd‹ halbwegs angemessen bezeichnet sind, ließen uns nicht mehr los. Wir ahmten sie nach wie Kinder. Die Besucher der Ausstellung, von denen viele diesen kindlichen Nachahmungstrieb schon unterdrückt haben werden, können ihn nun in der Bundeskunsthalle programmgemäß, in einer das Kindische akzeptierenden Situation und in fast authentischer Umgebung ausleben.\nDie faszinierendste Rolle in dem Spektakel spielt jedoch Rolf-Salomon Bausch, der Sohn von Pina Bausch, dem durch ihren plötzlichen Tod eine Lebensaufgabe vor die Füße gefallen ist, um die ich ihn nicht beneide. Salomon Bausch, der sich als studierter Jurist, so weit es eben ging, von dem künstlerischen Millieu, in das er hineingeboren wurde, befreite und ein eigenes Leben lebte, wurde nach ihrem Tod zum Verwalter eines unüberschaubaren Erbes. Was wird er damit machen, möchte man mit Bulwer-Lytton fragen. Mit der sicheren Hand des Juristen gründete er, zusammen mit seinem Vater, dem chilenischen Dichter Ronald Kay, die Pina Bausch Foundation und gab der Verwaltung des Erbes damit einen institutionellen Rahmen. Doch wenn es um die Sache selbst geht, so experimentiert er wie seine Mutter. Denn neben den umfangreichen Archivierungsarbeiten, es müssen Hunderte von Videobändern digitalisiert werden und ein voluminöser Nachlass aus Zeichnungen, Notizen und Fotos geordnet und zugänglich gemacht werden, probiert er auch andere Dinge aus, mit denen er das Andenken an Pina Bausch am Leben erhalten möchte. Die Aktion [YOU AND PINA](http://www.pinabausch.org/en/projects/you-and-pina) gehört dazu und die bereits angesprochene [Nelken-Line-Aktion](http://www.pinabausch.org/en/projects/the-nelken-line), bei der Menschen in aller Welt aufgefordert werden, die Nelken-Line zu tanzen. Es ist durchaus möglich, dass diese Aktionen, und nun die große Ausstellung in Bonn, vor allem den Zweck haben, öffentliche Aufmerksamkeit zu erzeugen, denn der Aufbau des [Pina Bausch Archivs](http://www.pinabausch.org/en/archive) ist aufwändig und verschlingt sehr viel Geld. Und wenn man weiß, wie desaströs die Kulturpolitik in Deutschland ist, dann kann man sich vorstellen, dass Salomon Bausch dringend andere Geldquellen als Bund, Land und Kommune anzapfen muss. Nachlassverwaltung ist eine mühsame und langweilige Aufgabe, die aber vor allem im Interesse der Wissenschaft – ebenfalls ein Stiefkind Deutschland, wenn es nicht um Maschinen und Motoren geht – getan werden muss. Mit Sicherheit ist dafür ein Jurist besser geeignet als ein Künstler. Und Salomon Bausch ist noch jung genug, um diese Aufgabe auch richtig zu Ende zu bringen.\n\n"
		}
	]
}