{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1573781265,
			"title": "ZERONET NO THANKS: 4 months work wiped out !! ... for the twelfth time !",
			"body": "!! When I checked with a ZeroNet client to see if my files were reachable, none of my files I uploaded to IFS in the last 4 months (!!) were more available! My complete IFS account disappeared with all the files, although my ZeroNet Cliend pretended to me !! I've tried it with all the tricks, such as: with and without Tor Proxy, Ultrasurf Proxy, port sharing & forwarding rules in the (Fritz Box) Hardware / Rooter, VPN (IKEv2 / LPT / OpenVPN ...) with port release (as UDP or TCP connection) and various DynDNS providers !! IFS is now the twelfth (!) Absolutely unreliable ZeroNet project for me! All of the twelve ZeroNet projects I've tested so far proved to be utterly useless garbage !! ZeroNet projects always seem to be extremely intelligent, useful, functional and intelligent, but in reality they are just unstable, flawed, useless deceptions (joke / cheating) of a very, very small group of developers and supporters who have no real use to have !! The ZeroNet is just a pre-alpha concept, a ridiculous experiment purporting to be useful!",
			"added": 1573781264
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1573689881_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/15fDN4wasXuyS8krtKvrxEVmWWLz6Qh518/",
				"added": 1573717396
			},
			{
				"comment_id": 2,
				"body": "!!! OH SHIT !!!!\nNow I know what you mean! With another ZeroNet client, none of my files that I uploaded to IFS in the last 4 months (!!) are more available! My complete IFS account disappeared with all the files, although my ZeroNet-Cliend pretends that to me !! I've tried it with all the tricks, such as: with and without Tor Proxy, Ultrasurf Proxy, port sharing & forwarding rules in the (Fritz Box) Hardware / Rooter, VPN (IKEv2 / LPT / OpenVPN ...) with port release (as UDP or TCP connection) and various DynDNS providers !! IFS is now the twelfth (!) Absolutely unreliable ZeroNet project for me! All of the twelve ZeroNet projects I've tested so far proved to be utterly useless garbage !! ZeroNet projects always seem to be extremely intelligent, useful, functional and intelligent, but in reality they are just unstable, flawed, useless deceptions (joke / cheating) of a very, very small group of developers and supporters who have no real use to have !! The ZeroNet is just a pre-alpha concept, an experiment that pretends to be useful!\n\n                       !! 4 months of my life, wiped out !! I absolutely hate you ZeroNet! FUCK OF AND DIE !!",
				"added": 1573779973
			},
			{
				"comment_id": 3,
				"body": "... OH EXTREMELY END-SHIT !!\nNow I know what you mean !!!! With another ZeroNet client, none of my files uploaded to IFS in the last 4 months (!!) are available anymore! My complete IFS-Accont disappeared with all files in the other Z.N. client, although my ZeroNet-Cliend fakes me that !! I've tried it with all the tricks as for example: with and without Tor proxy, Ultrasurf proxy, port release & forwarding rules in the (Fritz Box) Hardware / Rooter, VPN (IKEv2 / LPT / OpenVPN ...) with port release (as UDP or TCP connection) and different DynDNS providers !! IFS is now the twelfth (!) absolutely unreliable ZeroNet project for me !! all twelve ZeroNet projects that I have tested so far proved to be absolutely useless garbage !! ZeroNet project always seem to be extremely smart, useful, functional and smart, but in reality they are just unstable, faulty useless deceptions (joke / cheating) of a very, very small group of developers & supporters that has no real use !! The ZeroNet is just a pre-alpha stage concept, an experiment that pretends to be useful ! \n\n... FUCK OF ALL ! I HATE YOU \"ZeroNet\" FAKERS !!!",
				"added": 1573783280
			}
		]
	},
	"comment_vote": {}
}