{
	"next_comment_id": 11,
	"comment": [
		{
			"comment_id": 1,
			"body": "Well, I think I managed to register a zeroverse account. I go to the site and it says authorized. And when I browse sites it pops up in the sign-in list. However, it's greyed out and I can't select it. When I do the other option (going in the sidebar and hitting 'change') it pops up and is selectable. But when I try to send something, it error's out and can't publish.\n\nHelp? Did I do the bitmsg stuff right? I've never used it before. I just downloaded the mac client, let it run, and sent a message to the address with a blank subject and with the appropriate body text. I'm not sure what I'm doing wrong...",
			"post_id": 15,
			"date_added": 1457670081
		},
		{
			"comment_id": 2,
			"body": "> [erkan](#comment_10_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Thanks for trying out. You are in total 1 of 3 trying this out. Your bitmessage looks fine in the users.json here. You can verify when you go to ZeroVerse.bit again, then it should show you \"Authorized...\"\n\nYea, everything *looks* okay. It just won't let me sign in and do stuff.\n\n> [erkan](#comment_11_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): \"errors out and can't publish\": was one of those sites the chatrooms? because me and another tester had it working on those, for sure.\n> Perhaps for the other sites the site admins need to add Zeroverse.bit also? (I added above now a section called: \"II. site admins: how to enable ZeroVerse.bit for your site\")\n> I'd be happy about any kind of feedback.Thanks for trying\n\nYea, I tried ZeroMedia.bit, which is the site listed in the article. I figured you'd have to add support manually, which is why I didn't even bother with ZeroTalk or anything.\n\n> [erkan](#comment_12_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): @kaffie could you tell me those sites with problems? Then I could check it out. Here's (1) some experience for ZeroMail. (1) http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf/yourID+ZeroVerse+bit+make+yourself+another+ZeroID\n\nI could try ZeroMail if you'd like. I actually arrived from that ZeroTalk thread. Figured I might as well reserve my username. As I said, trying to log in 'normally', has it greyed out (there's 'default for this site', 'zeroid', and a greyed out 'zeroverse'). Manually hitting 'change' in the side bar lets me select it, and it logs in as it should. But it gives 'problem publishing content' or something like that.",
			"post_id": 15,
			"date_added": 1457670924
		},
		{
			"comment_id": 3,
			"body": "I went ahead and took some screenshots to demonstrate. All uploaded to imgur/clearnet, sorry.\n\nNormal sign in. This happens on every site: http://i.imgur.com/BPSPfDj.png\n\nWhen I use the sidebar (only tested on ZeroMedia): http://i.imgur.com/rGt8rM6.png\n\nIt logged in! http://i.imgur.com/29NTba9.png\n\nBut then fails to send anything: http://i.imgur.com/PV5zGgB.png",
			"post_id": 15,
			"date_added": 1457671179
		},
		{
			"comment_id": 4,
			"body": "> [erkan](#comment_13_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Thank you. \n> I have now specifically added you to the users.json of (1). \n> Can you try, if it works now?Perhaps do before the real test, a select of the zeroid.bit, and then select the other ID. Thanks. \n> (1) http://127.0.0.1:43110/zeromedia.bit\n\nNope. Still greyed out.",
			"post_id": 15,
			"date_added": 1457671247
		},
		{
			"comment_id": 5,
			"body": "> [erkan](#comment_14_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): OK, I see. I hope this (1) goes away with the previous reply of mine. (1) http://i.imgur.com/PV5zGgB.png\n\nNope. Forcing the login through the side bar still results in that issue.",
			"post_id": 15,
			"date_added": 1457671307
		},
		{
			"comment_id": 6,
			"body": "I've obviously looked into it. In reality, there's no real reason to have two competing account systems at the moment. There's only ~5000 users, and ~600 websites. All of those websites have default innate ZeroID support (most are cloned zeroblogs, zerotalks, etc.). And a majority are now unmanaged and just sitting there left to rot. Anyone who'd bother visiting those sites already has a ZeroID.\n\nAnyone who's creating a site now can obviously opt to have both systems in place. Doesn't harm anything. And, from what I can tell, it's pretty simple. But the fact of the matter is that no one has any incentive to make a ZeroVerse ID, and as such, no one has any incentive to support it. A real chicken&egg problem.\n\nIt's a bit like trying to start a social website. You need users for a platform to be attractive. But to get users your platform has to be attractive. And on top of all that, ZeroVerse *only* supports registration through bitmessage, rather than ZeroID's web registration. I don't think that's a problem in the long run, but it definitely doesn't help the user count.\n\nThough, I can definitely see alternative account systems being used in more localized instances (a group of social networks), or perhaps in a physically localized case, like with meshnets.",
			"post_id": 29,
			"date_added": 1458123783
		},
		{
			"comment_id": 7,
			"body": "They've already taken down [a ZeroNet site!](http://127.0.0.1:43110/1FqhRosMouo37Z8iDpLTEPvfznBq1b4N4w) It's the end, I tell ya.\n\nNah, but really. I doubt ZeroNet is popular enough for them to even look at it. It's not like they're banned from using it, and if they care, they can clearly see what's on here. If anything, they'd be more worried about the various meshnets popping up, since those *have* been used to get around government surveillance and censorship.",
			"post_id": 32,
			"date_added": 1458175907
		},
		{
			"comment_id": 8,
			"body": ">With me came 2 other twister buddies (the \"twister gang\": ks, musickiller) \n\nI was wondering what was up with that. I wasn't sure if you guys knew each other coming in, or if you simply happened to be some of the more active ZeroNet users.",
			"post_id": 35,
			"date_added": 1458326581
		},
		{
			"comment_id": 9,
			"body": "> [nofish](#comment_16_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The main problem with relative urls: it's not future proof and compatible with direct domains (http://127.0.0.1:43110/ less)If you type <a href=\"/zerotalk.bit \"> the browser does not able to know if you want to access the site zerotalk.bit or http://yourblog.bit/zerotalk.bit, so please never use that format. + It's not working outside of zeronet and because of that unique string is also a bad idea. (eg. http://127.0.0.1:43110/siteaddress also works on twitter if we add a custom http://zero/seaddress, then its not.)\n\nThe main problem with absolute URLs is that they don't work with proxies. And, as you mentioned, the 'conversion' is handled 'by the site'. This isn't a proper solution. Requiring every ZeroNet site to automatically resolve and convert URLs is a huge problem and will result in links continually being broken for certain users.\n\nThere needs to be a proper fix in ZeroNet itself. Relative links *are* the proper way to link to a page on the same site. And it's also easier on the browser. A relative link will always point to the proper location.\n\nThe chrome extension in particular has problems with relative links. This is the fault of the extension, as it fails to correctly resolve links. Kaffiene gets around this problem by specifically checking for those edge cases, as they diverge from literally every other way of accessing ZeroNet.\n\nThe extension also allows for localhost links, as you mention. But this is not a proper fix. It's a bug. The extension should *not* rely on localhost links, given the whole point is to mask the URL. And with localhost absolute links, proxies break unless you write code to automatically change the link depending on the host. Again, a hacky solution.\n\nThis is literally the code used in kaffiene to resolve urls:\n```\nvar url = '/'\nif(window.location.hostname == \"search.kaffie.bit\" || window.location.hostname == \"kaffiene.bit\")\n  url = \"http://zero/\"\nvar linkhref = url+ziteaddress\n```\n\nThis snippet uses relative urls appropriately, with the exception of the chrome extension accessing the site with an improper url of just the domain name. This is not a legal way of accessing the site in any proxy nor any possible configuration of zeronet, meaning that in order to correctly resolve links, you need a special edge case that does an absolute link to 'Zero/' And given the nature of the extension, there's no way to know what the port/local address is, meaning we must support the extension specifically. Again, a hacky solution.\n\nThe resolving of the main url itself should happen automatically. Sites should only need to refer to the ZeroNet site address itself. Not localhost, as not every user *uses* localhost.\n\nI'd also like to interject and say it'd be welcome to have ZeroNet officially specify a protocol, and have users migrate that way. Having 'localhost:43110', TBH, looks tacky and makes urls less readable. I realize it's an inevitability due to the way ZeroNet currently works, but fixing the URL problem will certainly help with adoption and ease of use.\n\nI know firefox in particular has a way of specifying custom protocols. I have personally mapped my browser to accepted zero:/kaffiene.bit with any amount of '/' up to 2. And the domain name can be the direct site address as well. I think this method works best, as it cleans up the URL, specifies that the site is zeronet specifically (rather than just saying kaffiene.bit, which may be a non-zeronet .bit site), and can easily be pointed to whatever path I want. The downside is, obviously, that it's just a redirect, rather than a direct masking like the chrome extension. And this trick only works in firefox and maybe opera, chrome requires web+ in front of the protocol name.\n\nI think having a way of setting up ZeroNet to automatically catch and resolve the zero:/ protocol (it's possible in all webbrowsers, it just has to be an external app instead of a web redirect) would fix any and all problems. The official way would be to simply use the zero:/ protocol, and that'd correctly point to the site. Relative URLs would no longer be needed, and if used would still work appropriately. The only thing I could see being a problem would be proxies, which could be tweaked to automatically resolve URLs to their specific domain.",
			"post_id": 71,
			"date_added": 1461977849
		},
		{
			"comment_id": 10,
			"body": "> [up4](#comment_3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz) The ZeroFrame: no matter what functionality it provides, I think it is a serious implementation mistake (hopefully not an architectural one). The sandboxing breaks rich content in every possible way conceivable and it being mandatory (why not a optional javascript include or at least an option to turn it off in content.json ?) is an unacceptable constraint for content producer (and the most plausible reason why most content on ZeroNet is ABOUT ZeroNet).\n\nAgreed. The ZeroFrame is incredibly frustrating while doing dev work. I always end up keep bumping up against it. I'm not really sure what a good solution would be, as I *do* like the embedded sidebar/home button.\n\n> Incompatibility with big files: I mean in 2016 you don't support files larger than 1MB (have had problems with files <200K as well)?!?!? If this comes from the « streaming on Tor makes infant Jesus cry » excuse from 2010, I say: ZeroNet is about first-world problems, baby. Kademlia works over TCP and over Socks and not just UDP. There is no valid technical excuse that convinced me so far. ZeroNet needs a better content distribution strategy (including a UI , such as Freenet's, to help users manage large file downloads).\n\nThe big issue here is that users *only* store and seed stuff they've viewed and visited. Meaning that having them store a bunch of large files could easily become problematic. And doing something like FreeNet could turn off a lot of users who like the current lightweight model. I think integrating another service would work well. Perhaps WebTorrent or IPFS? At the very least ZeroNet could switch how it sends files to gather one from multiple users rather than having an entire file sent by a single user.\n\n> Shady anonymity/p2p: Namecoin support is the best I've seen so far but it also could be made better by not having to trust one specifically hardcoded ZeroSite for resolution. I would want builds that work only with Tor and not still check or even mention the public port. Of course, that excludes connections that are handled by the browser itself and require proper Tor proxy configuration.\n\nThis is already a thing. You can change the DNS resolver in the config stuff. There's also an option to enable local Namecoin lookups, rather than use a ZeroNet Site.\n\n> Python: I think any other language (Swift, Go, Rust, C, C++) is a better idea. I don't want to fix the above things in Python. I use Python as some sort of in-application scripting for pre-Javascript superexpensive commercial 3D packages like Houdini. Never, never, never for a daemon. If I'm ever motivated enough to do this I think I would port ZeroNet to Swift and only support macOS/iOS/Linux/FreeBSD and then and only then would I contribute core functionality.\n\nI don't think this will change. A lot of work has already been done in Python. And it's multiplat so that anything that can run python can run ZeroNet, rather than just a couple of preselected OS's. Switching to Swift and only supporting mac/linux would cut out a huge portion of users who use windows. We're trying to increase adoption, not reduce it.\n",
			"post_id": 71,
			"date_added": 1462059240
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}