{
	"title": "深网小透明",
	"description": "国际共运搬运站以及其它",
	"links": "*   **本站没源码**\n*   如有疑问，请[来函](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=uvw)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1538548404,
	"post": [
		{
			"post_id": 9,
			"title": "用搭建了一个KindleEar推送服务器",
			"date_published": 1538548300.278,
			"body": "每天定时推送华盛顿邮报，纽约时报和BBC中文的内容到Kindle上。整个过程还挺复杂的。目前的定时推送效果如何还不得而知。"
		},
		{
			"post_id": 8,
			"title": "斯威士兰工人反对非洲最后君主国的英勇斗争",
			"date_published": 1538537527.591,
			"body": "![](https://irn.proletar.ink/wp-content/uploads/2018/10/18092501-1.jpg)\n\n## 斯威士兰共产党祝贺斯威士兰工人反对撒哈拉以南非洲最后的绝对君主国的英勇行动\n\n**（2018年8月30日）**\n\n2018年，我们见证了斯威士兰工人反对撒哈拉以南非洲最后的绝对君主国的一系列英勇行动。工人们提出的一些要求都与不民主的廷克汉德拉（tinkhundla）制度有关。最近的抗议活动是由斯威士兰全国教师协会（Swaziland National Association of Teachers）和斯威士兰民主护士联盟（Swaziland Democratic Nurses’ Union）领导的。\n\n2018年8月24日星期五，斯威士兰曼齐尼（Manzini）市的教师们举行和平抗议，要求获得赶得上物价的收入。姆斯瓦蒂（Mswat，斯威士兰国王）的警察向抗议者们开枪，打了五发子弹。一名教师被子弹击中。如果不是另一名教师马克斯韦尔·穆萨·米尼（Maxwell Musa Myeni）勇敢地夺走警察的枪，制止警察的杀人行为，就将会有更多的教师被子弹击中。紧接着在2018年8月26日星期日，米尼被臭名昭著的警察部队绑架。2018年8月28日星期二，工人和其他人权活动者们勇敢地行动了起来。他们涌入曼齐尼地方法院，要求姆斯瓦蒂政权同意保释米尼。他们要求政府，要么释放米尼，要么逮捕他们所有人。\n\n在星期五（24日）举行和平抗议之前，教师们还发动了星期四（23日）夜间的抗议和星期五（24日）上午的集会。必须承认，姆斯瓦蒂禁止教师们在8月24日和25日的一切行动，是为了迫使人民参加傀儡议会的虚假选举。\n\n昨天，2018年8月29日星期三，工人们在斯威士兰民主护士联盟的领导下走上街头，要求为斯威士兰人民提供优质的医疗服务，要求获得赶得上物价的收入。在斯威士兰，每天都有人像苍蝇一样死去，因为公立诊所和医院的重要药物和设备已经耗尽，包括艾滋病毒检测试剂盒。而政府却在推卸责任。这就是不民主的廷克汉德拉制度的直接后果。\n\n在最近这些抗议之前，斯威士兰工会大会（TUCOSWA）在4月和6月还曾有过其他行动。2018年6月29日，警方在姆巴巴内（Mbabane）街头袭击了和平抗议的工人，还禁止受伤者获得急需的医疗服务。\n\n姆斯瓦蒂政权将其所有错误归咎于脆弱的经济状况。但我们记得在今年早些时候，为庆祝姆斯瓦蒂生日就耗费了超过10亿里兰吉尼（当时约合7500万美元）。姆斯瓦蒂给自己购买了价值5亿里兰吉尼（当时约合4030万美元）的第二架私人飞机、一块价值2100万里兰吉尼（当时约合160万美元）的腕表，并用从国民那里盗窃的亿万财富给他的庞大的家族和朋友们置办礼物。\n\n姆斯瓦蒂的喉舌《斯威士兰观察报》（Swazi Observer）最近评论说，姆斯瓦蒂政府将花费“不低于1500万欧元（110万美元）”为总理建造一个豪华的养老院。\n\n斯威士兰共产党坚定地站在斯威士兰工人一边，支持他们反抗残酷的姆斯瓦蒂政权的英勇斗争。我们还支持护士们从9月5日下周三开始为期七天的罢工，支持斯威士兰工会大会在9月第二轮选举前举行为期两周的抗议。我们党将继续在这些工人斗争中发挥先锋作用。\n\n令人鼓舞的是，绝大多数斯威士兰人已经意识到，当前的廷克德拉选举是不民主的。由此产生的廷克德拉议会，将成为撒哈拉以南非洲最后的绝对君主姆斯瓦蒂的傀儡议会。这个议会只执行姆斯瓦蒂的单方面决定——掠夺公共资源，使国民进一步陷入贫困。\n\n人民一定能推翻姆斯瓦蒂政权。斯威士兰共产党邀请斯威士兰的工人和所有人权活动家尽快参加我们全国范围内的自由讨论论坛（Freedom Discussion Forums），共同商讨推翻可恨的王室政权的实际办法。\n\n**斯威士兰共产党**\n\n> 转载请注明出处：国际红色通讯\n> 来源：SolidNet\n> 译者：思思\n> 原文链接：[http://solidnet.org/article/CP-of-Swaziland-Communist-Party-of-Swaziland-congratulates-workers-of-Swaziland-on-militant-actions-against-sub-Saharan-Africas-last-absolute-monarch/](http://solidnet.org/article/CP-of-Swaziland-Communist-Party-of-Swaziland-congratulates-workers-of-Swaziland-on-militant-actions-against-sub-Saharan-Africas-last-absolute-monarch/)"
		},
		{
			"post_id": 7,
			"title": "好了今天把之前几篇搬运过来",
			"date_published": 1538537385.362,
			"body": "要是能自动搬运就好了。"
		},
		{
			"post_id": 6,
			"title": "伊拉克工人在斗争",
			"date_published": 1538456939.367,
			"body": "<div class=\"entry-content\">\n![](https://irn.proletar.ink/wp-content/uploads/2018/10/18093001-1.jpg)\n\n</div>\n\n**Lobelog网站[美国]，2018年7月31日**\n\n伊拉克5月12日大选的结果仍然存在不确定性，社会服务的日益恶化导致了行走者联盟（译者注：Sairoon coalition，什叶派宗教领袖穆克塔达·萨德尔领导的选举联盟）的胜利，成千上万生活条件日益艰难的人被迫上街抗议。\n\n整个7月，成千上万人示威游行、封锁道路、搭建帐篷开展占领活动以及控制油田。伊拉克全境，尤其是富含石油的南部地区局势震动。9月上旬，在至少8起抗议活动中，有超过13人丧生，47人受伤，其中包括两名遭到枪击的儿童和一名遭到枪托殴打的儿童。伊拉克多地持续几天被政府断网，组织抗议活动变得更加困难，相关镇压消息传播受阻。\n\n抗议活动于7月8日在西谷尔纳2号油田（West Qurna 2 oilfield）开始，并蔓延到该地区其他油田，包括巨大的鲁迈拉油田（Rumaila field），以及巴士拉市。抗议活动又从那里传播到其他省市，包括巴格达、库特、阿马拉、卡尔巴拉、纳杰夫、巴比尔、达卡、米桑和穆萨纳（Baghdad, Kut, Amarah, Karbala, Najaf, Babil, Dhi Kar, Missan, Muthanna）。石油工人穆罕默德告诉人权观察组织的调查员，他看到一名男子在高速公路上竖起的帐篷中被子弹打死。之后，占领公路的活动持续了数天，而在巴士拉其他街道上的占领活动也遭到了警察的攻击。\n\n以上次大选中的总统候选人哈迪·阿米里（Hadi al-Amiri）为首的巴德尔旅（Badr Brigade）是向示威者开火的部队之一。抗议者在巴德尔旅位于巴士拉的总部外示威，结果巴德尔旅向人群开枪，造成两名儿童受伤。\n\n视频和照片揭露了其他对枪击事件负有责任的政府部队的身份，包括联邦防暴警察以及油田警察。他们用棍棒和钢管攻击人群。有些人在被拘留后也遭到了殴打。他们在悍马军车上开枪击中了一个人。除子弹外，军队还使用了催泪瓦斯和水炮。\n\n至少有81人被捕，截至7月底，没有人被释放或被起诉。要求释放抗议活动被捕者的律师贾巴尔·穆罕默德·卡拉姆·巴哈德利（Jabbar Mohammed Karam al-Bahadli）7月23日在巴士拉被汽车里的袭击者开枪打死。\n\n**停电**\n\n7月27日，在包括巴士拉、石卡尔（ShiQar）和米桑（Missan）在内的几个省份，特别是在尼尼微（Nineveh）和基尔库克（Kirkuk）的部分地区，电力供给完全崩溃，示威活动逐渐升级。当气温达到了在伊拉克夏季并不罕见的120华氏度（约49摄氏度）时，人们却无法使用空调或其他制冷设备。政府的南方电力输送部门将此次停电归咎为“周四下午纳西里耶（Nassiriya）热电站的技术故障导致了南部地区电力输送中断，发电站和高压线无法正常运转。”\n\n7月中旬，政府谈判代表承诺回应示威者的要求，抗议浪潮暂时平息。但电力故障，再加上当局对抗议者的暴力行为，引发了新一轮的示威活动。南方电力输送部门在周四的声明中表示：“预计电力网络将在未来一段时间内恢复正常状态。”然而，在伊拉克南部，“正常”的24小时电力服务基本上是不存在的。\n\n在西古尔纳2号油田，示威者在高速公路上静坐示威。起初，地方官员似乎愿意与他们谈判，但安全部队随后赶到，拆除了抗议营地。之后，一名伊拉克准将与经营该油田的俄罗斯卢克（Lukoil）石油公司达成了一项协议，为Azal-Din Saleem的居民提供200个工作岗位。尽管如此，西古尔纳2号油田和祖贝尔（Zubair）油田的示威者仍宣布将继续抗议。\n\n**工会在其中的作用**\n\n伊拉克的工会，特别是石油工人工会，在组织示威活动中发挥了核心作用。伊拉克石油工会联合会（Federation of Oil Unions in Iraq）主席哈桑·古玛·阿瓦德·阿萨迪（HassanGomaa Awad Asadi）在电子邮件采访中解释了抗议活动的起因：\n\n“伊拉克南部的示威活动并非偶然。民众们积累了16年的怒火，特别是在被历届政府忽视的南部地区。尽管这些地区是伊拉克最富有的地区，产出了全国75%的石油，然而工人们一直受到歧视和贫困的折磨。\n\n现任政府和前任政府应当对电力和水资源不断恶化的供给状况负责。伊拉克人民没有最基本的公民权利。他们的要求很简单，只是让政府提供最基本的服务。人民拥有享受公共服务的合法权利，例如电力和供水。政府必须为失业者提供就业机会，他们在伊拉克社会中占很大比例。\n\n不幸的是，我们没有收到任何回应。相反，国家威胁要逮捕示威者，甚至向他们开枪。这激怒了公众，于是他们今天在巴士拉举行了示威。示威者已经开始提出更多要求，包括解散现政府。参加示威是人民的合法权利，这些示威者都是伊拉克的儿女。\n\n石油工会联合会广泛而深入地参与这些示威游行。从最早的巴士拉示威开始，我们的工会一直扮演着关键角色。我们不会放弃捍卫国家和人民的立场。我们相信人民有权获得石油带来的财富。这也是伊拉克宪法所说的。我们对人民负责，所以我们正在努力改善他们的处境。\n\n示威活动已经蔓延到油田，特别是在巴士拉北部，在西古尔纳1号和西古尔纳2号油田。受这场危机影响最严重的人就住在油田附近。这是愤怒的群众向政府传递的信息。我们能够并愿意去任何地方要求我们的合法权利。”\n\n**环境危机**\n\n一个来自珈玛（Garma）的小组也参与了抗议，该小组指责运营油田的那些石油公司污染水源和土地，并要求“处理那些杀死树木和其他植物并摧毁我们土地的高盐度的水。”由巴士拉省12个部落组成的Al-Jazaeer联盟（Al-Jazaeer Coalition）在一份声明中说，他们经历了“烟雾造成的环境污染”和“农田被破坏以及水污染。”埃克森美孚（Exxon Mobil）和俄罗斯卢克石油公司经营西古尔纳2号油田，英国石油公司（BP）经营鲁迈拉油田，马来西亚国家石油公司（Malaysian Petronas）经营加拉夫油田，意大利埃尼集团（Italian ENI）经营al-Burjisiya油田。\n\n水盐度的上升是影响广泛并日益严重的环境危机的一部分。伊拉克政府未能有效地抵制土耳其和伊朗在底格里斯河上修建水坝的行动。流入伊拉克的水流减少，加剧了这场危机。由于缺水，今年政府甚至禁止种植大米和玉米。伊拉克公民社会团结倡议（Iraq Civil Society Solidarity Initiative）预计，成千上万的人可能因缺水而流离失所。\n\n巴士拉工会联合会（Basra Trade Union Federation）主席兼电工工会（electrical workers’ union）主席哈什米亚·阿尔萨达维（Hashmeya Alsaadawe）在伊拉克国家电视台问道：“这些军队和武器是针对谁的？针对要求有尊严生活的、提出合法要求的手无寸铁的公民！他们只是需要水、电和工作机会。我们应该向谁提出我们的要求？当地政府没有回应！”\n\n阿尔萨达维和其他工会活动家支持行走者联盟。参加5月12日全国大选的这一政治联盟赢得了130万票，获得了最多的议会席位。排在其后的是哈迪·阿米里的法塔赫联盟，其基础是与伊朗有联系的民兵。然而，阿米里领导的巴德尔旅被指控在7月的抗议活动中向示威者开枪。没有任何党派能够组建一个受大多数议员支持的联盟，从而组建新政府。此外，几个省的计票工作也出现了问题。随之而来的政治瘫痪加剧了伊拉克人对电力、供水和就业状况恶化的失望情绪，而政府对此负有责任。\n\n行走者联盟本身就是由这些问题导致的多年街头抗议活动的产物。2011年春天，伊拉克至少有45人死亡，数百人被捕。2015年，伊拉克人每周五开始示威，谴责宗派主义政党的腐败，让他们对电力、供水和就业危机负责。\n\n行走者联盟就是从这些集会中成长起来的。它呼吁结束以宗派路线划分政治立场的体制，这是美国占领伊拉克后2011年开始实施的体制。基于宗派政党的政府结构，催生了一种任人唯亲和“瓜分战利品”的制度，从而导致了巨大的腐败。该联盟的口号是“建立公民国家——基于公民和社会公正的国家”。\n\n伊拉克石油工会联合会主席哈桑·古玛·阿瓦德·阿萨迪将伊拉克问题的根源归咎于美国：\n\n“我们伊拉克的问题根源是美国政府。在占领之后，它不停向我们这些平民百姓施压。美国政府施加的压力，以及国际金融机构对国家政府的干预，都导致了当前的危机。在16年多的时间里，国家行政部门的所有政党，包括逊尼派和什叶派政党都失败了。\n\n我认为示威并不是选举的结果，尽管人们确实受到了选举制度的影响。相反，这些示威运动是国家系统中政府忽视管理和金融腐败的必然结果。伊拉克的议会制度是失败和腐败的，充斥着政客们为加强自身利益而通过的法律。这是政治配额制度不可避免的结果，它给我们带来了巨大的伤害。\n\n腐败的制度是大规模公共资金失窃的原因。而卑鄙的盗窃让穷人成为了受害者。没有问责制度监督这些资金的使用。自2003年以来，政府单单在电网建设上就浪费了超过480亿美元，而这个国家却依然生活在黑暗之中。”\n\n> **相关资料：**\n> \n> 2018年8月19日，伊拉克联邦最高法院决定批准5月12日举行的国民议会选举最终结果，伊拉克新一届议会和政府组建工作正式提上日程。\n> \n> 伊拉克5月12日举行新一届国民议会选举。5月19日公布的结果显示，“行走者联盟”“法塔赫联盟”和“胜利联盟”分列前三，各自赢得54、47和42个席位。多个政治派别随后投诉称选举中出现舞弊等违规行为，伊独立高等选举委员会7月份开始重新统计涉嫌违规的选票。8月9日，独立高等选举委员会在完成重新计票后公布大选最终结果，“法塔赫联盟”在巴格达省多赢得一个席位，最终获得48席，原本赢得4席的“巴格达联盟”减少一个席位。其他政治联盟席位无变化。\n> \n> 转载请注明出处：国际红色通讯\n> 来源：Lobelog网站\n> 译者：一匹年轻的下等马\n> 原文链接：[https://fpif.org/iraqs-oil-union-defends-protesters/](https://fpif.org/iraqs-oil-union-defends-protesters/)"
		},
		{
			"post_id": 5,
			"title": "孟加拉国学生运动的最新消息",
			"date_published": 1538456720.273,
			"body": "<div class=\"entry-content\">\n\n![](https://irn.proletar.ink/wp-content/uploads/2018/10/18100101-1.jpg)\n\n**孟加拉国共产党关于当前学生运动最新情况的报告**\n\n**（2018年8月29日）**\n\n正如我们之前所说，学生抗议仍在继续，但形式有所改变。学生们提出了在宰牲节（Eid day，2018年8月22日）前立即释放学生积极分子的要求。控制着下级法院的政府了解形势后，满足了抗议学生的部分要求。在宰牲节前，绝大部分的学生积极分子都获得了下级法院的保释。但虚假的警察案件尚未撤销，政府仍然可以随时骚扰学生。\n\n现在，学生们还没有占领街道，但他们已经愤怒了。甚至在宰牲节，首都也发生了一些抗议，但规模比较小。随着今年12月全国选举临近，政治上的紧张局势已经引起了全国的关注。现在人民明白了，政治运动在不民主的环境下十分重要。孟加拉国共产党领导的左翼民主联盟现在提出了在中立政府管理下举行选举的要求。这是因为专制的现政府及选举委员会，已经让人民和各政党对其丧失信心，不相信它能安排一场有最起码的自由和公平的选举。\n\n谢谢。\n\n孟加拉国共产党国际部成员\n卡比亚（Md Kibria）\n\n7月29日，在首都达卡，两名大学生在公交车超速导致的事故中遇难。航运部长（Shipping minister）兼孟加拉国公路运输工人联合会执行主席（Bangladesh road transport workers’ Federation）沙贾汗·可汗（Shajahan Khan）对此不负责任的言论激怒了成千上万的孟加拉国学生，他们起来抗议，涌上街头。示威者基本都是十几岁的学生，他们批评政府执行交通法规不力，并高呼“我们要正义”的口号。在游行期间，一些学生甚至自发地组织起来维持道路秩序。抗议者对政府提出了一系列要求：严格执行交通法规，保证道路安全，消灭交通部门的腐败，罢免航运部长。此外，他们要求严惩交通肇事者，包括那些鲁莽的司机。孟加拉国学生联盟（Bangladesh Students’ Union）的领导人和积极分子在达卡各区和全国各地参加了这次抗议，以表达他们的声援。\n\n为了支持全国学生争取道路安全的抗议活动，孟加拉国共产党和左翼民主联盟也提出了要求：为交通事故死难者讨回公道，整顿交通部门，罢免航运部长沙贾汗·可汗，将黑帮从内阁中赶出去。\n\n在多次声援大会和演讲中，孟加拉国共产党警告政府，如果用武力驱散学生，压制其九点要求，孟加拉就会陷入无政府状态。孟共声明，年轻的示威者们已经展示了一条能将交通部门从公共财产掠夺者专制下的无政府、无法律状态下解放出来的路线。学生们已经证明，交通部门的无政府状态不应再继续下去。\n\n学生运动超出了政府的控制，孟加拉国教育部被迫关闭高中和大学，努力制止骚乱。政府还对抗议学生承诺，将会考虑学生关于重建道路安全的要求。但怒火并没有平息。在此前抗议政府岗位配额改革的学生运动中，政府用空洞承诺安抚学生，这已经透支了人民对他们的信任。随着运动继续，公立和私立大学的学生都加入到运动中来，政府开始动用武力破坏运动。执政党的学生和青年组织，跟着警察一起攻击抗议人群。许多孟共党员和孟加拉国学生联盟（Bangladesh Students union）的积极分子在首都的多起冲突中受伤。\n\n此外，警方和执政党立案30余件，指控学生搞破坏和散布谣言。现在，那些在社交媒体上声援抗议和要求抗议的同学，正在被警方和执政党的学生组织宝伞联盟（Chattra league）骚扰。宝伞联盟的干部正在继续攻击和骚扰参与抗议活动的普通学生。\n\n截至目前，已有22名私立大学学生被警方逮捕，许多学生被宝伞联盟攻击。警方还逮捕了知名摄影师、社会活动家夏伊都尔·阿兰姆（Shahidul Alam），并在拘留期间对其进行肉体折磨。因为他发布了声援抗议活动的视频，并在半岛电视台（Al Jazeera）的采访中抨击政府的行为和政策。政府部门和执政党的干部们正在威胁政治和社会活动家，阻止他们声援学生。\n\n孟加拉国共产党及其领导的左翼民主联盟正在抗议政府当局用野蛮手段阻止学生自发运动的行径。孟共要求尽快释放夏伊都尔·阿兰姆和被捕学生，并拘留攻击普通学生和记者的执政党干部。孟共要求政府停止镇压学生，立即落实学生提出的要求。\n\n转载请注明出处：国际红色通讯\n来源：ICOR网站\n译者：AS\n原文链接：[https://www.icor.info/2018-1/update-about-student-movement-in-bangladesh](https://www.icor.info/2018-1/update-about-student-movement-in-bangladesh)\n\n</div>"
		},
		{
			"post_id": 4,
			"title": "叙利亚战争与“新丝绸之路”",
			"date_published": 1538456582.931,
			"body": "**《红旗新闻》[德国]，2018年5月10日**\n\n德国马列主义党（MLPD）分析当今世界帝国主义战争的总体趋势发现，中国和其他所有帝国主义势力一样正在为帝国主义战争做准备。同时，中国还在经济方面推行大国政治。这二者并不相互对立，它们都是中国争夺世界统治权的行动。\n\n中国果断地在经济上支持叙利亚、伊朗的战事，同时为它们提供全面的各类武器系统。中国的军事顾问也在当地训练叙利亚士兵。\n\n在“新丝绸之路”项目中，叙利亚和伊朗都有重要的战略意义。中国希望通过这一项目改变全球范围内的经济和政治平衡，获得更多利益。伊朗是中国在中东最紧密的盟友，两国在军事与能源方面都有重要的合作。而叙利亚有望成为中国与欧洲之间主要的交通与运输枢纽，发挥中转站的作用。\n\n“新丝绸之路”由两条路线组成。北方的陆上丝绸之路从中国出发，经中亚、伊朗、叙利亚、土耳其到达俄罗斯与欧洲。南方的海上丝绸之路旨在将中国与东南亚、东非、中亚、欧洲连接起来。\n\n中国企业已经在伊朗建设了高速公路、铁路、水坝和发电厂。新建成的管道将确保中国有能力从中东获得石油和天然气资源。截至目前，中国政府已经向伊朗提供了100亿美元的贷款。可以预计，在未来10年，两国之间的贸易额将从现在的520亿美元增长到6000亿美元以上。伊朗有大约60%的石油出口到亚洲国家，而中国是最大的买家。在世界最大油气田——伊朗南帕斯油气田（South-Pars-Gasfelds）的开发过程中，中国石油天然气集团 （CNPC）做出了约30%的贡献。伊朗还作为观察员参加了中国和俄罗斯领导的“上海合作组织”。\n\n中国企业已经在多国竞相投资的叙利亚投资了20亿美元。叙利亚政府与中国1000多家投资开发公司签订了高达2700亿美元的重建工程合同。现在，叙利亚政府已经为150家中国公司建设了一个工业区。中国占叙利亚对外贸易总额的80%。通过伊朗和叙利亚，中国可以直接进入地中海沿岸的叙利亚港口拉塔基亚（Latakia）和塔尔图斯（Tartus）；在那里，海上丝绸之路将与陆上丝绸之路的一条分支相连，那里将成为新丝绸之路规划中的枢纽站。\n\n土耳其有意同俄罗斯-伊朗-叙利亚集团接触，其原因之一是它对新丝绸之路项目感兴趣。因此，中国希望为土耳其扩建长达12000公里的铁路网，供特快列车通行。土耳其阿纳多卢通讯社（Die Presseagentur Anadolu）这样写道：“将来，货物到达伦敦，只需要10至12天，而不是8个星期。特快列车将取代笨重的船只……土耳其也将在全球占据重要地位。”\n\n然而，为了落实计划，中国必须应对美国在中东地区的主导影响力——这就是中国在叙利亚战争中支持俄罗斯-伊朗-叙利亚集团的原因。为了维持并扩大在中东地区的霸权，美帝国主义、以色列和沙特甚至想在将来控制叙利亚。如果可能，它们将在叙利亚煽动“政权更迭”，必要时不惜采取军事手段。在新丝绸之路项目方面，美国智库“外交关系协会”（Council on Foreign Relations）指出，美国必须采取强有力的措施，反对中国企业的所有国际化进程。\n\n由于帝国主义势力之间的矛盾，目前我们还无法确定，中国帝国主义者的浮华梦想能否成真。如果在下一次世界经济和金融危机爆发时，全球性资本主义再生产过程中的矛盾进一步激化、撕裂，那么新丝绸之路可能会成为巨大废墟。\n\n另外，现在许多国家的民众大规模抵制新丝绸之路项目。哈萨克斯坦发生抗议，反对中国企业大肆购买土地。在临近的吉尔吉斯斯坦，在大规模群众示威之后，政府与中国公司签订的采矿特许权合同被撤销，因为这一合同意味着剥削进一步加深。\n\n> 转载请注明出处：国际红色通讯\n> 来源：红旗新闻[德国]\n> 译者：太行云泽\n> 原文链接：[https://www.rf-news.de/rote-fahne/2018/nr10/der-syrien-krieg-und-die-neue-seidenstrasse](https://www.rf-news.de/rote-fahne/2018/nr10/der-syrien-krieg-und-die-neue-seidenstrasse)"
		},
		{
			"post_id": 3,
			"title": "内容介绍",
			"date_published": 1538456464.107,
			"body": "本站会时不时搬运国际共运和IRN的帖子，希望向更多人宣传无产阶级工人运动。因为IRN的表网网站和微信公众号太容易被封了。"
		},
		{
			"post_id": 2,
			"title": "本站所有者是个共运爱好者",
			"date_published": 1538456110.656,
			"body": "同时也比较拥护**共产党**的统治。"
		},
		{
			"post_id": 1,
			"title": "恭喜恭喜!",
			"date_published": 1433033779,
			"body": "我的第一个Zite已经创建成功了！"
		}
	]
}