{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1615970209,
			"title": "if someone tells you : you are racists, antisemitic, homophoe, transphobe, xenophic...",
			"body": "kill it. and use the head for polo ! it will stop fast.\n\nviolence.\n\nover matching.\n\nnothing else.\n\nnot ignore\n\nkill.",
			"added": 1615970208
		},
		{
			"topic_id": 1615970780,
			"title": "and my message to the fucking fbi : muller, mcabe, and all the traitors",
			"body": "at least conclude your coup ! because now you are full on pedos. you overthrow pedo trump fine.\n\nbut I guess your coup is being thwarted now, isn't it? \n\nstill no pedo inquiry? the flight log? nothing\n\naka enemy combatant !!\n\nand you are so dumb taht you don't understand nor like the dod than a TOTAL WAR against PLA isn't the thing you can even dream off.\n\nfurthermore the problem isn't if PLA will win, but how and if the UNO / global agenda take over by china can be stopped... in the sense that the UNO / global agenda wants to bait china in taking it over...\n\nand as always baits it must be interesting...\n\nthat's the REAL WAR going on...\n\nnationalist/patriots aka true ccp\nand the internationalists seeking a global framework rather than bi.multilateral TRADE agreement...\n\nand my opinion is that CCP by going full bore interntionalists will receive what is sow... war.",
			"added": 1615970778
		},
		{
			"topic_id": 1615974610,
			"title": "for me the key objectives in a riot (which I always find stupid)",
			"body": "is to target with fire bombs (cocktail molotof and acid bombs) the female cops ! frak them... then for there whole worhtless lives they will carry the mark of their collaboration !\n\nI have 100% doctrine of engament against female now !!!! prime targets !\n\nI can always discuss later with the men... but those : prime.\n\nas such the new training... make them wear veils if you find yourself more accustomed to this type of targets... but that's low skill. I want bikinis ! why? the frame, the frame...",
			"added": 1615974607
		},
		{
			"topic_id": 1615979560,
			"title": "I hope prince philipe is suffering prehell...",
			"body": "so this shit gave us andrew, jimmy saville, adenochrone harvesting in native population in north america, child rape by the pakiwaste(aka those they would kill themselves if in pakistan)...\n\nbut that's nothing :\n\n>Queen Elizabeth's husband Prince Philip has made a series of remarks during his life in which he states his desire to be reincarnated as a \"deadly virus\" to wreak havoc in the world and reduce global population levels.\n\nhttps://newspunch.com/prince-philip-tempted-ask-reincarnation-deadly-virus-reduce-world-population/\n\nWhat I didn't knew about this shit, is that he is greek !!!! yes !!! you hear it there ! so this explained the fuckery of the bbc with greece...\n\nwhat a treason\n\nif rome was there...",
			"added": 1615979556
		}
	],
	"topic_vote": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": 1
	},
	"next_comment_id": 36,
	"comment": {
		"1615967547_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": [
			{
				"comment_id": 1,
				"body": "the question is how not :).",
				"added": 1615970227
			}
		],
		"1615970209_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 2,
				"body": "you think those fucking shit go to cicero and bash insult the natives/locals? nope... why? heheheh.",
				"added": 1615970283
			},
			{
				"comment_id": 3,
				"body": "and kill them. don't ask the cops, too low iq like gretha... nope . do it yourself.",
				"added": 1615970315
			},
			{
				"comment_id": 4,
				"body": "you think those who roamed the plains moving the herds, would have tolerated this? you think the \"line\" breakers and other raiders would have tolerated this? you think in the whale/rhum trade they tolerated this? nope. and the fucking muppets knew it... always in need of bait...",
				"added": 1615970380
			},
			{
				"comment_id": 5,
				"body": "you don't beat them, you kill them. aim, punch, and more, pulp.",
				"added": 1615970415
			},
			{
				"comment_id": 6,
				"body": "but all this weakness culture is by design... fucking females.",
				"added": 1615970437
			},
			{
				"comment_id": 7,
				"body": "personally I would explode clariss ward or ana navajo to fucking pulp.... nothing but mesh,",
				"added": 1615970567
			},
			{
				"comment_id": 17,
				"body": "> [reflektion](#comment_11_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): normally theses sorts of insults mean you have won whatever discussion you were having and they can no longer refute your arguments and resulted to attacking you as a person.\n\nyes ! and then they move to violence ... like the man in canada against puberty blockers for children. In most sane country (not following the UNO / global agenda used by the depopulationist to achieve their worldwide extermination to save the planet #iwanttoberebornasavirus... those filths wouln't be left alive, and they could cry as much as they want transphobe from the rooftop of buildings while falling to the ground or being exeuted in line so wide that you can't see the last one :).\n\nso rather than waiting to be killed by them... like in the infowars funny clip :\n\nthere is a man in the corner of a field, sniping... and at the other end the america flag... he is asked, what are you doing lying low aiming and he answered : baiting :).",
				"added": 1615977637
			},
			{
				"comment_id": 18,
				"body": "some people do that... they put a girl in the street.... and wait for some savages to aggress her, then fight :) as always said, it's always hard to find counter part for fights :).",
				"added": 1615977680
			},
			{
				"comment_id": 19,
				"body": "the core problem of the west, is that men are whimps who can't say fuck off to all those bimbos with their \"warm hearth\"... fuck you, hypergamist of hell, that I don't care, but their nation west wide destruction due to their stupidity, weakness and fear of violence... is really tragic... like in rome, like in constantinopolis, like everywhere, as explained by great scholars of war worldwide. same patttern : strong victorious men > mega markets > luxury and co leading to female \"voices\" > feminization + corruptions > gay army, powned by the strong victorious men and again to the downfall... on and on and on and on...\n\nuntil some got it!",
				"added": 1615977871
			},
			{
				"comment_id": 20,
				"body": "airwing suits for pregnant women? just lol... already female pilots? what the fuck with their low iq, low phyz, low endurance, weak communication, and even weaker moral... and that's only in the cockpit... when they touch down due to modern SAM they are just pickers to be killed... I don't say men have more chance, but still a little to survive the POW camps and or avoid them completly.\n\nit's easy to stand on the shoulder of men, show your boobs and pretend to be equal... then comes the stormfront...\n\nremember some of the men in the stormfronts are wimps... they bring others qualities ! the whimp skinny cook? a beloved soldier, by all ! meat!!! MEAT !!! MMMMMMEEEEEEEEEEEAAAAAAAAAAAAAATTTTTTTTTTTTTTT!\n\nand he says ; cooking wait, but if you want it raw, let me slice it for you, but you should wait it will be better later...\n\nMEAT\n\nMEAT \n\nMEAT !!\n\nand there we have the fucking female her salad... what teh fuck ! and now she bitch that everyone isn't ready. FUCKING WAIT FOR THE MEAT MEAT MEAT !",
				"added": 1615978090
			},
			{
				"comment_id": 21,
				"body": "how many females in assad frontlines? 0.",
				"added": 1615978119
			},
			{
				"comment_id": 22,
				"body": "how long female kurds so called show case last IRL? not with western/russia support? I mean fair fight, both the djhadis and them equipped same standard? 1 fight? 1 day? 1 week? 1 month? 1 year? 10 year? ahh with russians and americans air wings ... they can drink coconut milk worryless... now let's say that covid19 was a real bioweapon 90% death rate... no more air wings over syria... how long? not even one fight...",
				"added": 1615978446
			}
		],
		"1615970780_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 8,
				"body": "and as always war is the goal of the population reductionists, not skirmishes like in syria, iraq or afghanistan... war.",
				"added": 1615970862
			},
			{
				"comment_id": 9,
				"body": "war where the whole state of israel is a \"clip\". nothing else...",
				"added": 1615970884
			},
			{
				"comment_id": 10,
				"body": "where a man can say to his men, in a few days we will be a thousand miles forward. let's do it.",
				"added": 1615970919
			},
			{
				"comment_id": 11,
				"body": "and you cops and fbiers and all this leo filths will be nothing more than civilians... dust in the winds of the storm front... ask the polnish cops when wehrmacht moved... goyim.",
				"added": 1615970971
			}
		],
		"1615974610_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 12,
				"body": "as if the fucking psychatrist could win wars... pfff... noobies ! it's so disgusting to use those worthless breeding walking machine in front line... such a classical new tactic of the UNO / global agenda.\n\nremember unrestricted war.",
				"added": 1615974685
			},
			{
				"comment_id": 13,
				"body": "let me tell you a true story : so there was this jackie and his buddies near a car in the middle of place... not a car park... nope... a place... a square as you say...\n\nso the jacky and his cronies loved to hear some music and pimp their ride...\n\nso 2 females cops arrived... boasting their little boobs, hands on their belt... \n\nof course the kekes weren't armed...\n\nbut the cops girl yes\n\nthe jackies didn't give a damn about those bitches\n\nof course a few sec later a police car with men arrived\n\nthe bimbo backed down\n\nand all went in order...\n\nthe car moved and hte jackie got a fine...\n\nbut bimbo girls were lucky... that those jackie weren't baiting...\n\npersonally there would have been aks on the side...\n\nand pop pop pop\n\ncool ! dead cops !\n\nacab\n\nprove me wrong.",
				"added": 1615975460
			},
			{
				"comment_id": 14,
				"body": "I am a cop girl they won't frag me... there are safer beliefs bitchz.",
				"added": 1615975522
			},
			{
				"comment_id": 15,
				"body": "prime.",
				"added": 1615975528
			},
			{
				"comment_id": 16,
				"body": "what's the tactical difference between a war and a skirmish?\nin a skirmish females aren't targeted as primes.",
				"added": 1615975625
			}
		],
		"1615979560_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 23,
				"body": "I guess the organ farming to feed his dying corpse must going full speed in the pedodungeon where serfs are harvested to feed the will and ubris of the nobles...",
				"added": 1615979597
			},
			{
				"comment_id": 24,
				"body": "and now the pedo of the mi5/6 are going full hasbara and cringing... the west deserve truely a total war...",
				"added": 1615979646
			},
			{
				"comment_id": 25,
				"body": ">Prince Philip, Duke of Edinburgh, Consort of the British monarch (1952-present) Prince Philip on growing human population: \"If it isn't controlled voluntarily, it will be controlled involuntarily...\"\n\nhttps://nwo.fandom.com/wiki/Prince_Philip_-_%E2%80%9CIf_I_were_reincarnated_I_would...be...as_a_killer_virus...%22\n\nso you want to nuke china? cool, unrestricted /on. there is really nothing I wish to save in the UK. nothing.",
				"added": 1615979744
			},
			{
				"comment_id": 26,
				"body": "but the weather, and that will remain, until the pole shift :D.",
				"added": 1615979789
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 27,
				"body": "ahhahaha... there will be soon many ak17 in russia hands (post nuke phaze ;D). \n\njust passing by to say ; what ever the child rapists feodalists says is just source of anger to me, 0 trust.\n\nI am curious who is aiming for russia' maybe time to tsarify their land for eternity? maybe a little early...\n\naerial nuke test... you know this 100m project... why drop it? when it can be installed safely :)\n\nanyway.\n\nmy point? there is no peace possible as long as the kidrapistsfeodalists are in power in the west. to wipe their stronghold all those western low stamina IQ females have to be shredded, and then it's possible again to discuss...\n\notherwise as the great lavrov, said : ... in russian it's even better :D!\n\nformer cold warriors of the usa, must have a little emotion when they heard it in the national language...",
				"added": 1615983216
			},
			{
				"comment_id": 28,
				"body": "pedos always say they come in peace, and then the van door closes...",
				"added": 1615983286
			},
			{
				"comment_id": 29,
				"body": "sometimes they even have candies...",
				"added": 1615983302
			},
			{
				"comment_id": 30,
				"body": "it's a classical story... a predatory group (western pedo feodalists) seek to take over russia. They believe like many before them that it will easy... and then strike back? why not preventive war for once? maybe it works... just saying...",
				"added": 1615983361
			},
			{
				"comment_id": 31,
				"body": "the \"humans right cowboys\" is just a narrative for the pedofeodalists to conquer... nothing else.",
				"added": 1615983432
			},
			{
				"comment_id": 32,
				"body": "and for me the most freightening thing is that the DoD doesn't seem to understand how their pedoposture is interpreted... some do prepare total under great shields :)...",
				"added": 1615983486
			},
			{
				"comment_id": 33,
				"body": "when american arms investors and mfgs will see the stormfront closing in, they will realize that it wasn't worth it... not before. sadly. they have forgotten, and this memory shall not become a weakness, because all weakness, all they could, will they exploit.\n\nthey are afterall, human predators...",
				"added": 1615983572
			},
			{
				"comment_id": 34,
				"body": "and as some said in chinese history if you army is 100x time more lethal than the one of the other side... anyway... another front, antoher victory, and the tradition keeps on going... poor them, to have need to die, to understand. so is life.",
				"added": 1615983680
			},
			{
				"comment_id": 35,
				"body": "on the other hand while they say big bad putin, big bad xi etc, what is going in the new little st james remain well covered, I guess the pedogen love it that way... they should be careful, they can rape with impunity american kids, as proofed, however their end of history narrative... compromised :).",
				"added": 1615983787
			}
		]
	},
	"comment_vote": {}
}