{
	"title": "33⅓ Hip Hop",
	"description": "嘻哈文章+资源\n规避机械审查和版权\n部分内容发布于此",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1485616093,
	"post": [
		{
			"post_id": 3,
			"title": "美国黑人中的毛主义思潮：红色中国与黑色革命",
			"date_published": 1485248769,
			"body": "译/2NBBD 原载于哥伦比亚大学期刊（1999, p.6-41.），作者为 Robin D.G. Kelley 和 Betsy Esch。\n\n(这只是一个最初的、语义不甚通畅的版本，还在继续继续改进)\n\n* * *\n\n# 前言（译者）\n\n1994 年的 Public Enemy 的境遇并不算好。除了之前的 Great Misses 这样一张全新概念的「精选集」被证明是一次失败，Def Jam、Polygram 和索尼之间的商业问题也将 PE 牵涉其中。这让 1994 年的新专辑『Muse Sick-n-Hour Mess Age』在发售前就蒙上了阴影。对 Chuck D 来说，他用别样的方式发泄了自己的怒火——通常意义上我们所讲的“隐藏歌曲”都出现在最后一首歌之后（会有一段时间的空白）。而 PE 则把一首「Ferocious Soul」放在了第一首歌之前。『混蛋们将怒火中烧，那又如何。（_Motherfuckers are gonna be mad so the fuck what?_）』这是对于 PE 失势的一次重要预言。不过这依旧算是「正史」，毕竟，你尽管不是那个年代的经历者，你还是可以在 PE 的自传中或者因特网上找到这些故事。但有些故事是被人们，甚至是拉塞尔•麦里（Russell Myrie，PE 自传的作者）所忽视的。所谓历史之外的历史，那就是关于那首「Mao Tse Tung」的复杂背景。\n\n![Mao Tse Tung Single 12\"](data/img/post_3_112.jpg)\n\n收录于单曲「What Kind of Power We Got」中，「Mao Tse Tung」——世界无产阶级革命的领导者之一毛泽东的英译写法——按理说是 1994 年的专辑中的一部分。这首厚重而带着一些恐怖的色彩的歌曲——阴冷的钢琴和低沉的贝斯——实际上是将毛泽东当作了一种意象：无畏的革命者。从某种意义上来说，Chuck D 在这一年以及专辑『Muse Sick-n-Hour Mess Age』中的怨气其实是很深的。一方面从 1986 年就开始打基础的帮派饶舌终于在 Dr. Dre 和 Snoop Dogg 的杰作之下开始兴盛，一方面又是唱片公司在玩弄政治。于是 Chuck D 的态度自然是和这些东西抗争到底。「Mao Tse Tung」在内涵上的表达和历经苦难才得以发行的第一支单曲「Give It Up」确实有着异曲同工之妙。\n\n但为什么是毛泽东？对于仅仅是听音乐而不了解历史的人们来说，毛泽东之于黑人解放运动、文化大革命之于黑人文化运动，可能更像是天方夜谭。但事实是，这其中有着千丝万缕的联系。这将是一个漫长的故事……\n\n* * *\n\n> _这是一个属于毛泽东的时代，这是一个全世界革命的年代，非裔美国人为获得解放所做的斗争正是这场无法阻挡的世界性运动的一部分。其中，毛主席是第一位将我们的人民抗争上升到全世界人民革命的领导人。_\n> ——罗伯特•威廉姆斯（Robert Williams），于 1967 年\n\n即便仅仅从象征的层面上来看，毛主席似乎也正在年轻人中开始复兴。他的形象和思想始终在数不清的文化和政治现象中出现着。The Coup，这支来自旧金山湾区的嘻哈队伍，将毛泽东请进了黑人激进革命者的名人堂中，同时也把黑人解放斗争置于一个国际化的大背景中。在这首歌名简单的「Dig It」一曲中，The Coup 称其成员是「这片土壤上不幸的人」，他们告诫听众去研读《共产党宣言》，并召来了那些革命的代表者：毛泽东、胡志明、克瓦米•恩克鲁玛、休伊•布朗、肯尼亚的茅茅党运动和格洛尼莫•普拉特。以经典的毛主义的方式，队伍领会了毛泽东最为著名的名言并学以致用：「我们认识到权力应当是镀镍的。（_We realized that power is nickel-plated._）」（源自「枪杆子里出政权。」）即便 The Coup 的成员甚至不是出生于黑人毛主义的鼎盛时期，「Dig It」还是抓住了毛主义与那巨大的殖民世界——一个囊括了非裔美国人的世界之间的关联的本质。在二十世纪六十年代晚期到七十年代早期的哈勒姆区，那里就好像人人手中都有一本《毛泽东》语录，即我们熟知的「小红书」。时不时地，你就能在街角看见那些通过贩卖小红书来筹得党费的黑豹党支持者。你要是在大街上看到穿着打扮像是中国农民的年轻黑人，也绝不要感到惊奇——当然了，爆炸头和太阳眼镜还是少不了的。\n\n就像非洲一样，中国正处于发展之中，而且人们普遍都感觉中国人民对黑人斗争是支持的。事实上，这绝非臆想：现实生活中，确有黑人以毛泽东，还有马克思以及列宁的名义呼吁革命的。数之不尽的那个时代的黑人激进分子都很看重中国，事实上，中国并不像古巴、加纳那样，也不比巴黎，那里不是一个真正意义上的自由国度。中国不是完美的，但相比困兽之笼还是要好的多了。在黑豹党党魁伊莱恩•布朗（Elaine Brown）在 1970 年秋访问中国期间，她对于中国革命在改善人民生活方面感到很是惊喜：「老人和年轻人都情不自禁地发出对社会主义荣光的由衷赞美，他们的虔诚就好像是浸信会教徒一般。」一年后，她和另一位黑豹党的创建者休伊•牛顿（Huey Newton）一起故地重游，后者称他在中国的经历是一种「自由的感觉——就好像压在灵魂上的沉重忽然被卸掉了似的，我可以重新做回自己，不再需要辩解、戒心和伪装。我在我的人生中第一次感到了彻头彻尾的自由——在我的同胞中，我感到了解放。」\n\n在布朗和牛顿踏上中国的大地的十余年前，W.E.B. 杜波依斯（W.E.B. Du Bois）就将中国视为将要领导全世界有色人种对抗帝国主义的沉睡的巨人。他第一次访问中国是在 1936 年——在战争和革命爆发之前——作为他的苏联之行的延伸。1959 年的第二次访问正值禁访中国期间，杜波依斯在那里发现了一个崭新的国度。他被中国人民进行的大改造所震撼，确切地说，是被他所理解的中国妇女的解放所震撼，他还确信中国将会领导不发达国家走上社会主义的道路。「在历经数个漫长的百年后的中国，」他在他的九十岁大寿庆典上告诉一位出席的中共党员说，「她已经抬起了一只脚，身体前倾，准备起步。起来吧，阿非利加！站直了，大声宣告，积极思考！行动起来！从西方持续了半个世纪的奴役和羞辱中振作起来，面对初升的朝阳吧！」\n\n黑人激进分子将中国视为引导第三世界革命的灯塔，并将毛泽东思想看作是行动指南的做法，是一个囊括了数个组织、涵盖了大半个地球的复杂而奇妙的故事——从北美的贫民窟到非洲的乡间。因而接下来的描述，绝非是强词夺理。不过，我们的写作是为了探索毛主义思想的影响力，以及更为普遍地，从二十世纪五十年代到差不多七十年代中期之间，中华人民共和国对于黑人激进运动的影响。我们还探寻了激进黑人民族主义是怎样在美国的毛主义或「反修正主义」组织中产生帮助的。我们的争论在于，究竟是中国，还是第三世界或者马克思主义者为黑人激进分子提供了一个能够来让他们去挑战白人和西方价值观下的阶级斗争的「有色」模式——一个他们能塑造并重构来适应他们自身文化和政治现实的模式。尽管在许多方面，中国所扮演的角色都是富有争议且充满问题的，但中国的农民阶层，作为欧洲无产阶级的反面形象，他们发动了一场社会主义的革命并以更为深刻的革命重视度和权力，建立了与苏联和美国黑人激进分子阵营截然不同的世界地位。最终，毛泽东不仅向黑肤色的人民证明了这个世界不需要他们等待「客观条件」的成熟来发动革命，他对于文化层面的斗争的预估更是深刻地推动了黑人艺术和政治的发展。\n\n# 长征\n\n任何一个熟悉毛主义的人都知道，这从未成为一个发展成熟的、可以取代马列主义的意识形态。相反，如果说两者之间有什么区别的话，前者应该代表了对后斯大林时期，苏联的「修正主义」模式的对抗。毛泽东对于马克思主义的贡献与发展直接导致了 1949 年的中国大革命。毛泽东所坚持的农民的革命能力而不是依靠城市的无产阶级的思想，尤其吸引了那些对于“他们需要等待客观条件成熟来发动革命”这一想法感到怀疑的黑人激进分子。毛泽东思想的中心在于马克思主义能够（必须）根据时间、地点和运动中的人民大众所产生的实际工作、思想和领导来重塑的，而不是一个在抽象中诞生的，或是脱离了斗争本身的理论。在实践中，这意味着真正的革命者必须拥有必胜的革命信念。革命信念的概念是不能被低估的，尤其是对于那些在运动中被全方位孤立、攻击的人来说。革命者在武装了合适的理论、拥有正确的道德行为并保持着信念之后，用毛泽东的话来说，是可以“移山”的。也许这就是为什么中国共产党的领导之一，林彪会在《毛主席语录》的前言中写到：「毛泽东思想为广大群众所掌握，就会变成无穷无尽的力量，变成威力无比的精神原子弹。」\n\n毛泽东和林彪都认识到，这「原子弹」的源泉可以从第三世界民族主义者的斗争中找到。冷战的日子促进了不合作运动的开展，1955 年，有色人种的领导人们在印度尼西亚的万隆聚集在一起，尝试开辟一条通向发展的道路，而中国人民想要率领着前殖民地走向社会主义。中国人民（在林彪的理论“新民主革命”的支持下）不仅生来了解革命价值观的民族主义斗争，他们还特别对非洲和非洲血统的人民伸出援助之手。在历史性的象征了不合作运动的万隆会议过去两年后，中国建立了亚非人民团结组织（Afro-Asian People's Solidarity Organization，简称 AAPSO）。毛泽东不仅在杜波依斯被美国宣布为全民公敌之后邀请了他前往中国庆祝他的九十大寿，他还在 1963 年盛大的华盛顿游行的三周前发表了一次讲话，批评了美国的种族主义并将非裔美国人的解放运动视作全世界范围内的反帝国主义斗争的一部分。「万恶的殖民主义、帝国主义制度，”毛泽东说道，“是随着奴役和贩卖黑人而兴盛起来的，它也必将随着黑色人种的彻底解放而告终。」十年后，许多的小说家约翰•奥利弗•基伦斯（John Oliver Killens）著的书，以及其他黑人作者的作品都被翻译成了中文，许许多多的学生都在读那些书，基伦斯对此感到非常震惊。他每去到一个地方，基伦斯似乎都能遇到一些年轻的知识分子和工人「对黑人运动以及黑人民主的艺术和文学影响黑人运动的方式极其地感兴趣。」\n\n![1.jpeg (1200x892)](data/img/post_3_1.jpeg)\n\n他们那有色人种的身份作为一种强有力的政治工具，流动地支持着非洲人和非裔人。在 1963 年，中国大使在坦桑尼亚的墨西镇（Moshi）发表讲话，称俄罗斯人不应插手非洲事务，因为他们是白人。在另一方面，人们都确信中国人不仅是有色人种世界的一份子，而且从未在奴隶贩卖当中充当过不好的角色。当然了，大部分的这类宣言都是为了构建良好的同盟关系。事实上，在二十世纪的广州亦可以找到黑人奴隶，一些非洲学生在中国也抱怨过种族主义。（事实是，在毛泽东过世后，种族冲突的发生变得非常频繁，尤其在 1979 年的上海、1980 年的南京和 1986 年的天津）此外，中国对黑人世界的外交政策也更多地是基于策略上的考虑，而非对第三世界革命的承诺，这在中苏关系破裂之后尤为明显。中国的反苏态度使得外交政策决定也最终损坏了她和某些非洲解放运动的关系。比如在南非，中国支持的运动同时也获得了种族隔离统治派的支持。\n\n然而，毛泽东思想依旧在黑人激进分子中占有一席之地。尽管，毛主义的相关事物在美国从未获得像苏维埃式的共产主义政党在二十世纪三十年代所得到的信仰程度，但它确实植根在了这个国家。它们百花齐放，好似令人眼花缭乱的嵌花图案的激进声音们就像是打仗似地互相争吵着。无需感到惊奇，在他们有关美国的阶级斗争特点的争论的中心是「黑人问题」：黑人在世界革命中将扮演一个怎样的角色？\n\n# 全世界黑人革命\n\n> _全世界人民团结起来，打败美国侵略者及其一切走狗！全世界人民要有勇气，敢于战斗，不怕困难，前赴后继。那么整个世界度将会属于人民。各色妖魔鬼怪都会被摧毁。_\n> ——毛泽东，于 1964 年，《关于支持刚果人民反抗美帝国压迫的讲话》\n> \n> _非洲、亚洲、南美、黑人和中美，一场革命正在席卷而过。_\n> ——革命行动运动（Revolutionary Action Movement，RAM），《全世界黑人革命》\n\n美国的毛主义并非是从中国出口而来的。要说两者有什么区别的话，那么那些马克思主义的老左派的源头可能要追溯到 1956 年召开的第二十次苏联共产党大会上，赫鲁晓夫所支持的反修正主义运动对于支持斯大林的左派的批判。由于在美国共产党（Communist Party USA，CPUSA）内部的争论中，好几个组织都倾向于让共产党重回斯大林主义时期，这其中就包括了临时组织大会（Provisional Organizing Committe，POC，1958 年）、锤子与钢铁组织（Hammer and Steel，1960）和进步劳动党（Progressive Labor Party，PLP，1965）。\n\nPLP 是三年前进步劳动运动的产物，它最初由深信中国有着正确立场的前共产党员所领导的。PLP 坚持黑人工人是无产阶级革命中的“中坚革命力量”，他们由此吸收了一群杰出的黑人活动家，如来自洛杉矶的约翰•哈里斯（John Harris）和来自哈勒姆区的比尔•艾普顿（Bill Epton）。艾普顿在 1964 年期间的暴乱中因被指控犯下“无政府主义罪”而遭到逮捕后，可谓是闹得满城风雨。两年之后，PLP 组织了一次学生罢课行动，以此在旧金山州立大学建立起了一个黑人学习课程，学校的解放黑人委员会（Black Liberation Commission，BLC）则出版了一份名为《解放黑人，就是现在！》（Black Liberation Now!）的小册子，试着把城市之中的这些反抗者置于一个全球的巨大背景下。但是，在 1968 年的前夕，PLP 放弃了它对于“革命的”民族主义的支持，并断言一切形式的民族主义都是反动的。基于其坚定不移的反民族主义态度，PLP 不仅反对平权运动，还反对那些黑人和拉丁裔的贸易高层会议——那些中伤了 PLP 与黑人社区中的活动家之间的关系的组织。总之，事实上 PLP 与新左派的联系也由于它对于黑豹党和黑人学社个运动的诋毁而部分损毁了。1969 年，在一些激进民族主义者团体的协助下，PLP 的成员被逐出了学生争取民主社会组织（Students for a Democratic Society，SDS），这其中就包括了黑豹党、洛德党（Young Lord）和褐色贝雷帽（Brown Berets）。\n\n尽管如此，具有广泛影响力的“马-列-毛”主义政党并不是受到毛主义启迪的黑人激进分子的首要传播媒介。多数生活在二十世纪五十年代晚期到六十年代早期的黑人激进分子是通过在非洲和古巴的反殖民斗争认识了中国。加纳于 1957 年的独立让人们欢呼雀跃，而中情局暗中支持的对刚果领导人帕特里斯•卢蒙巴（Patrice Lumumba）的暗杀则激起了所有黑人活动家圈子的抗议。古巴革命和菲德尔•卡斯特罗那次联合国大会期间入住的著名的特蕾莎旅馆（Hotel Theresa），都使得黑人开始直面现实：坚定的社会主义者将象征团结的手伸向了有色人种的世界。许多黑人激进分子不仅公开为古巴革命作辩护，还随公正对待古巴委员会（Fair Play for Cuba Committee，FPCC）前往古巴访问。在这其中之一便是哈罗德•克鲁斯（Harold Cruse），一个坚持信仰马克思主义的前共产党员。他认为古巴人、中国人和非洲人的歌名可以使激进思潮复苏，因为他们展现了民族主义的革命潜能。在 1962 年他发表于《新领导》（New Leader）上的一篇极具煽动性的文章中，克鲁斯认为新世代正在求助于之前殖民地世界的领导人和智慧，这其中就包含了毛泽东：\n\n> _万神殿中已经有了众多现代的英雄——非洲的卢蒙巴、夸梅•恩克鲁玛（Kwame Nkrumah）、艾哈迈德•塞古•杜尔（Ahmed Sékou Touré）；纽约的穆斯林领导人马尔科姆•X；南美的罗伯特•威廉姆斯和中国的毛泽东。这些人对于美国黑人来说是英雄般的存在，但这并非是由于他们的政治哲学，而是因为他们要么是领导殖民地完成独立的伟人，要么是因为他们是像马尔科姆•X这样的人，敢于直面白人社区，大声说出：“我么不认为你们的文明值得任何一名黑人努力去融入。”这样的、在美国黑人眼里有些轻蔑的举动是真正革命的行为。_\n\n在另一篇发表于 1962 年的《左派研究》（Studies on the Left）上的文章中，克鲁斯对于革命的民族主义在全球所扮演的角色的陈述更为直言不讳。他认为身处美国的黑人生活在举国体制的殖民主义之下，他们的斗争应该被视为是世界反殖民运动的一个部分。他在文中写道：「美国马克思主义者没能理解黑人和世界殖民地居民之间的纽带，使得他们没能推论出对于身处美国的黑人有价值的理论。」在他看来，古巴和中国这两个前殖民地是革命的先锋集团和新社会主义革命的前沿阵地。\n\n发生在古巴、非洲和中国的革命对于阿米里•巴拉卡（Amiri Baraka），这位在十五年后将会创建受到毛泽东启迪的组织革命共产主义联盟（Revolutionary Communist League，RCL）的人都有着相似的影响。巴拉卡受到古巴之行和卢蒙巴被暗杀的触动，他开始在阿尔及利亚民族主义领导人本•贝拉（Ben Bella）主编的杂志《非洲革命》（Africa Revolution）上贡献新的文章。正如巴拉卡所解释的：\n\n> _印度和中国在五十年代到来之前就完成了正式的独立。而到了五十年代来到之时，已经出现了许多独立的非洲国家（尽管很多还处于不同程度的新殖民主义之下）。加纳的夸梅•恩克鲁玛将黑色的五角星挂到了位于阿卡拉（Acara）的州政府办公室外，恩克鲁玛的讲话和他的种种行为背后的深意使得勇气洋溢在全世界有色人种的身上。当中国人引爆了他们的第一颗核弹时，我为此写了首诗，事实上，一个有色人种的时代已经开始了。_\n\n「加纳-中国」模型在维奇•加文（Vicki Garvin）的活动家生涯中体现的最为完美。她是一名坚定的激进分子，在战后的哈勒姆黑左圈子中四处游荡。加文成长在一个纽约的工人阶层家庭中，她的夏天在服饰加工厂中赚取家用度过。早在大学时期，她就在黑人抗议活动中冲锋陷阵，力挺亚当•克雷顿•鲍威尔（Adam Clayton Powell Jr.）所做的给予哈勒姆区的非裔美国人报酬更好的工作以及建立致力于馆藏图书资源的历史博物馆的双重努力。在她于亨特大学（Hunter University）和史密斯大学（Smith University）分别取得政治科学文学位和经济学硕士后，她在战争期间为全国战争劳动会（National War Labor Board，NWLB）工作，并在联合办公室及美国职业工作者协会（United Office and Professional Workers of America，UOPWA）和产业工业联合会（Congress of Industrial Organization）担任组织者，在雇用职工公平做法委员会（Fair Employment Practices Committee，FEPC）担任全国研究主任和联合主席。在战后的对 CIO 内部的左派清除中，加文成为了抗议中的一股强有力的声音，以及对于 CIO 未能在南部形成有效组织的尖锐抨击者。作为全国黑人劳动委员会（National Negro Labor Council，NNLC）的纽约分部执行秘书和全国总部副主席，加文和马尔科姆•X 建立了密切的联系，并为他张罗了非洲之行的一部分。\n\n加文加入了黑人知识分子出逃恩克鲁玛领导的加纳的计划，她在那里先是和诗人玛雅•安吉路（Maya Angelou）同住一屋，然后搬到了杜波依斯的隔壁。她在阿卡拉待了有两年，身边都是一些重要的黑人知识分子和艺术家，包括朱利安•梅菲尔德（Julian Mayfield）、艺术家汤姆•菲林斯（Tom Feelings）和漫画家奥利•哈灵顿（Ollie Harrington）。作为一名向加纳的古巴、阿尔及利亚和中国的外交中心传授口语英语的激进分子，她并没有在形成国际主义的观点上遇到困难：在杜波依斯最后的日子里，加文成为了《北京周报》的英语翻译的“润色人”和上海外语研究所（Shanghai Foreign Language Institute）的教学者。她在 1964 年到 1970 年之间留在中国，期间为黑人的解放抗争、非洲独立和中国大革命构筑起了联系的桥梁。\n\n对休伊•牛顿这位未来的黑豹党建立者来说，非洲的革命甚至还比不上发生在古巴和中国的革命。作为二十世纪六十年代早期的梅里特学院（Merrit College）的学生，他读了一些存在主义的著作，然后开始参加进步劳动党资助的集会并支持古巴革命。不出意料，牛顿借此开始贪婪地阅读其马克思主义的著作。其中，尤其是毛泽东的作品给了他深刻的影响：「在我读了毛泽东的四卷书并从中学习了有关中国革命的知识后，我的人生完整了。」由此，早在他建立黑豹党之前，牛顿就已经涉足了毛泽东得到思想，还有切•格瓦拉和弗朗茨•法农（Frantz Fanon）的作品。「毛和法农还有格瓦拉都清楚地认识到，人们被剥夺了他们生来就有的权力和尊严的原因，并非是因为某种哲学或是几句话，而是因为黑洞洞的枪口。他们被暴徒用枪指着脑袋，被强暴；对他们来说，唯一的赢得自由的方法，便是以暴制暴。」\n\n中国人们和古巴人们所发动的「以暴制暴」让他们的革命吸引了那些身处于非暴力革命时期的黑人激进分子。当然了，这个年代依旧有着武装斗争：在南部，就有像防御与正义执事（Deacons of Defense and Justice）这样的团体和格洛丽亚•理查德森（Gloria Richardson）的危急时刻出手保护为暴力运动的“剑桥”运动。但最好地呈现了黑人传统的武装自卫运动的人物还是罗伯特•威廉姆斯，这位黑人国际主义新浪潮的英雄的影响力甚至比得上马尔科姆•X。作为以前参与过大量美国海军的军事训练的士兵，威廉姆斯在 1957 年时建立起了他的名声。这一年，他在北卡罗来纳的门罗市（Monroe）建立了自卫团体来抗争三K党。两年之后，威廉姆的讲话，即用“以暴制暴”作为唯一方法来结束南部的不公正的言论使得他被美国全国有色人种协进会（National Association for the Advancement of Colored People，NAACP）的门罗分部撤职。\n\n威廉姆斯和 NAACP 的间隙以及他对武装自卫的公开支持将他推向了左倾的极端，进入了社会主义工人党（Socialist Workers Party）、工人世界党（Workers World Party）和旧 CPUSA 的一些成员的圈子里。1961 年前夕，因为伪造的绑架罪指控和联邦政府对于他的逮捕令，威廉姆斯和全家不得不逃离美国并在古巴寻求政治庇护。在之后的四年中，古巴成为了威廉姆斯宣传黑人世界革命的大本营，他在那里大肆宣扬国际主义的意识形态，呼吁黑人民族主义和第三世界忠诚。\n\n# 革命行动运动\n\n威廉姆斯在古巴的奋斗一定程度上启发了革命行动运动（Revolutionary Action Movement，RAM）的建立。在 1961 年前后的俄亥俄，隶属 SDS 以及学生非暴力协调委员会（Student Nonviolent Coordinating Committee，SNCC）和种族平等大会（Congress of Racial Equality，CORE）的黑人成员组成了小团体探讨威廉姆斯的作品的重要性和他被放逐一事。由唐纳德•弗里曼，这名克里夫兰凯斯西储大学（Case Western Reserve University）的黑人学生领导，这个小团体的核心内容包括了在威尔伯福斯镇（Wilberforce）建立由凯斯西储大学学生组成的全新的组织“挑战”。「挑战」的成员尤其对哈罗德•克鲁斯的文章《革命的民族主义和美国黑人》（Revolutionary Nationalism and Afro-American）着迷，这篇文章后来在年轻的黑人武斗派中流传甚广。受到克鲁斯的黑人解放斗争在全球范围的重要性的话语的影响，弗里曼希望能将“挑战”转变为一个革命的民族主义运动，和伊斯兰民族组织类似，区别仅在于直接使用 SNCC 的战术。经过漫长的辩论后，“挑战”的成员在 1962 年的春天决定解散组织，并成立 RAM（原来是“改革行动运动”，即 Reform Action Movement，以便不至于惊动大学管理层），主要领导者有弗里曼、马克思•斯坦福德（Max Stanford）和万达•马绍尔（Wanda Marshall）。几个月后他们将根据地迁到了费城；他们开始出版一个叫《黑人美国》（Black America）的双月刊和单页的时事通讯《革命谈话》（RAM Speaks）；他们开始计划一个面向革命民族主义、青年组织和武装自卫的全国性运动；他们还开始为队伍招募一些费城活动家，包括了埃瑟尔•约翰逊（Ethel Johnson，曾在门罗市和罗伯特•威廉姆斯共事过）、斯坦•丹尼尔斯（Stan Daniels）和普莱瑟尔•本杰明（Playthell Benjamin）。\n\n![v2-d559011ae73125c0d81f4ce8091365eb_r.jpg (1189x900)](data/img/post_3_v2-d559011ae73125c0d81f4ce8091365eb_r.jpg)\n\nRAM 代表了战后时期最初的严肃且持续的尝试，它联姻马克思主义、黑人民族主义和第三世界国际主义，并将它们置于一个一气呵成的革命计划中。在马克思•斯坦福德看来，RAM 「试着应用马列主义的毛泽东思想」于黑人身上，并「进一步发展理论：美国的黑人解放运动是世界社会主义革命的先锋队。」除了向看齐罗伯特•威廉姆斯看齐外，年轻的 RAM 武斗派还在向许多要么是因为“极左主义”被开除，要么是“资本家民族主义”，要么是因为「修正主义」而逐渐脱离党派的前共产党员黑人寻求指导。这些长者之中就包括了哈罗德•克鲁斯、哈利•黒伍德（Harry Haywood）、阿伯那•贝里（Abner Berry）和“母后”奥德蕾•摩尔（Abner Berry）。摩尔此后成为了 RAM 在东海岸最为重要的精神导师，为其成员提供了黑人民族主义思想和马克思主义的训讲。被她深情地称作是阿迪斯•阿巴巴山（Mount Addis Ababa）的她本人的家，被当作是新一代年轻的黑人激进分子的学校使用。她在 1963 年建立了非裔美国人民族解放党（African-American Party of National Liberation），该组织成立了一个分支政府，并推选罗伯特•威廉姆斯为流放中的总理。RAM 成员还求助于底特律的传奇人物，前托洛茨基主义者詹姆斯•李•博格斯和格雷斯•李•博格斯兄弟（James and Grace Lee Boggs）、前者的伙伴 C.L.R.詹姆斯（C.L.R. James），他们的马克思主义和泛非主义文章深刻地影响了 RAM 成员和其他新左派活动家。\n\n随着 RAM 的壮大，它在美国的其他地区吸引了追随者，尽管组织本身还处于半地下状态且组织相当松散。RAM 很像是二十世纪二十年代的非洲血盟兄弟（African Blood Brotherhood，ABB）以及出版了《左派研究》的激进知识分子们，他们对更多还是停留在理论上而尚未付诸实践的抗争做出了相当贡献。在南方，RAM 在菲斯克大学（Fisk University），这个锻炼出了许多 SNCC 活动家的地方建立了规模小却有影响力的追随者组织。比如在 1964 年的五月，RAM 成员就在菲斯克大学的校园里举办了第一次美国黑人学生。在北卡罗来纳，RAM 主要依靠美国黑人协会（Afro-American Association）壮大。美国黑人协会由唐纳德•瓦登（Donald Warden）建立于 1962 年，由位于伯克利的加利福尼亚大学（California University）和梅里特大学的学生组成——他们中的很多，比如蕾斯莱和吉姆•雷茜姐妹（Leslie and Jim Lacy）、塞德里克•罗宾逊（Cedric Robinson）、恩内斯特•艾伦（Ernest Allen）和休伊•牛顿都在后来成为了重要的人物，比如社会活动家和知识分子。在洛杉矶，美国黑人协会的主席是个叫罗恩•埃弗雷特（Ron Everett）的年轻人，他后来改名为罗恩•卡楞加（Ron Karenga），并建立了美国组织（US Organization）。美国黑人协会很快作为一个乐意与任何人辩论的好斗知识分子群体而获取了名声。通过挑战教授、同一些组织，如青年社会主义联合（Young Socialist Alliance）大辩论，以及举行有关黑人历史和文化的公共演讲，这些年轻人对年纪相仿的学生和黑人社区都留下了极深的印象。在传统的临时演讲台早已经于二十世纪三十年代就逝去了的东湾（East Bay），除了五十年代早期共产主义领导的个人演讲外，只有美国黑人协会所巡讲的那生动、实在的武斗派知识分子文化存在。\n\n于此同时，PLP 开始资助古巴之行并独自在东湾招募了许多激进的黑人学生。在他们其中，恩内斯特•艾伦，这位从梅里特学院转到加州大学伯克利分校的学生被强制退出了美国黑人协会。艾伦是一名来自奥克兰的工薪家庭的孩子，他是这不满于民权斗争世代的非暴力不抵抗政策的激进黑人世代，这使得他们愈发接近马尔科姆•X 和第三世界解放运动。不足为奇的是，他通过 1964 年的古巴之旅发现了 RAM。艾伦同行的伙伴包括了一队来自底特律的黑人武斗派：鲁克•崔普（Luke Tripp）、查尔斯•毛·约翰逊（Charles\"Mao\"Johnson）、查尔斯•西蒙斯（Charles Simmons）和杰纳勒尔•贝克（General Baker）。他们全都是学生团体“乌乎鲁”（Uhuru）的成员，后来都在巧妙革命联合运动（Dodge Revolutionary Union Movement，DRUM）和革命黑人工人联盟（League of Revolutionary Black Workers，LRBW）中担任重要角色。难以置信的是，马克思•斯坦福德已经在道上和罗伯特•威廉姆斯进行过了会面。当他们准备返航的时候，艾伦和底特律的队伍已经决心要投身于 RAM 了。艾伦在横跨美国的返回克利夫兰的大巴旅途中，于克里夫兰暂停，和 RAM 成员进行了会面。艾伦身背罗伯特•威廉姆斯的《巡弋者》（Crusader）杂志和相关的 RAM 材料，当他回到奥克兰时，他决心要让 RAM 出现在东湾。寥寥数人——艾萨克•摩尔（Issac Moore）、肯•弗里曼（Kenn Freeman，即 Mamadou Lumumba）、博比•希尔（Bobby Seale，后来的黑豹党建立者之一）和道格•艾伦（Doug Allen，恩内斯特的兄长）——这支队伍通过灵魂学生议案委员会（Soul Students Advisory Council）在梅里特学院建立了根据地。不过，队伍的知识和文化展示却让人深有体会。艾伦、弗里曼和其他人一起建立了报刊《灵魂之书：黑人世界的革命刊物》（Soulbook: The Revolutionary Journal of the Black World），其中的散文和诗歌都是左派民族主义的最好表现。特别是弗里曼，他深受 RAM 活动家的尊崇，其作品也为人广泛阅览。他常常督促 RAM 成员从全球的角度去思考黑人革命。《灵魂之书》的编辑们同时还和老左派的黑人激进分子进行了联系，其中最为著名的便是前共产党员哈利•黒伍德，他的作品在刊物的早期版本上曾出版过。\n\n尽管 RAM 作为一场运动从未获得过黑豹党那样的荣耀和公众赞誉，其影响确实是远远溢出其成员之间的——和四十年前的 ABB 非常相似。确实，他们就像 ABB 一样，，RAM 很大程度上都只是地下组织，更多时间里都在做着宣传鼓动的工作而不是真正的组织工作。像马克思•斯坦福德这样的领导者在其中效仿了领导了共产党走向胜利的中国农民起义军。他们领会了毛泽东的一句名言：“敌进我退，敌驻我扰，敌疲我打，敌退我追。”他们精确再现了毛的语句，支持武装暴动，并从罗伯特•威廉姆斯的美国游击战理论中直接汲取灵感和思想。RAM 领导人确信这样的战争不仅仅是一种可能，他们确实能在九十天之内解决战斗。巨大的混乱和革命性的训练有素的结合将会是胜利的关键。1964 年秋天的《黑人美国》预言了善恶大决战（Armageddon）的到来：\n\n> _武装起来的黑人男性和女性将叛变并聚集起来，参与到黑人解放力量中。那些声称将会帮助革命的白人将会被派往白人社区进行分裂活动、对抗法西斯主义者并挫败反革命势力的努力。到处都将是一片混沌，随着大众传媒的崩塌，压迫者政府的方方面面都将出现兵变。证券市场会溃倒；华尔街将停止运转；华盛顿特区将被暴动撕裂。各地的官员四散奔逃——为了生存而奔逃。洛克菲勒家族、肯尼迪家族、范德比尔特家族（Vanderbilt）、亨特家族（Hunt）、约翰逊家族、华莱士家族、巴奈特家族（Barnett）等等……都将率先逃走。革命将进行「夜间攻击，不留活口。」……黑人革命将破坏城市，先破坏电网系统，再捣毁南部乡间的交通和游击力量。城市一旦衰败，压迫者也自然会无助。_\n\n革命清楚被看作是男性的工作，女性在其中少有能见到同等的作用。确实，有关反修正主义历史的一个惊人事实便是男性长期占据着统治地位。尽管万达•马绍尔是 RAM 的建立者之一，她在 1964 年并没有全国的领导地位。除了宣传“妇女联盟”的建立，这个意图是“组织黑人妇女在白人家庭中工作”的组织以外，RAM 对于女性解放基本上是闭口不谈。\n\nRAM 的大男子主义倾向很大程度上和领导人将他们自己视为城市游击队的事实有关，他们认为自己就好像是毛的红军的黑人版。并非全部 RAM 的成员都这样认为，但那些有着这样的想法的成员却深深地相信着毛泽东为他的人民军队高层和成员所铺设的革命伦理。我们可以在 RAM 的「干部守则」中很清晰地看到，他们需要遵守一系列高度说教化的管理成员的规则。以下是一些例子：\n\n*   一名革命的民族主义者必须对党内的权威保持最高程度的尊敬。\n*   一名革命的民族主义者不允许因为金钱、荣誉或其他个人所得而腐化。\n*   一名革命的民族主义者必须毫不犹豫地将他的个人利益置于先锋事业之下。\n*   一名革命的民族主义者必须维持最高程度的道德感，不拿群众一针一线——兄弟姐妹们互相之间要有着最高的敬意，不得误用或利用他人来获取个人所得——不得以任何借口误读革命民族主义的指导思想。\n\n这与《毛主席语录》的高度相似性是让人震惊的。最后一条直接来自毛泽东的「三大纪律」，这项督促了干部「不拿群众一针一线。」无私和一心奉献群众是占据了《语录》的另一大主题。显然，这样的比较是有价值的：「共产党员无论何时何地都不应以个人利益为第一位，而应以个人利益服从于民族的和人民群众的利益。」毛泽东说道，「因此，自私自利，消极怠工，贪污腐化，风头主义等等，是最可鄙的；而大公无私，积极努力，克己奉公，埋头苦干的精神，才是可尊敬的。」\n\n毛主义强调革命伦理和道德改造，最起码从理论上与黑人的宗教传统产生了共鸣（同样地还有美国的新教），其他包括了伊斯兰民族组织、黑人毛主义都布道自制、秩序和纪律。在反文化的化身，即享乐主义和毒品滥用的浪潮中心，新一波的学生和工人阶级的激进分子发掘毛主义的道德很可能是有效果的。当罗伯特•威廉姆斯从中国返回之时，这位各方面来说的 RAM 之父简直所有的年轻的黑人知识分子「接受个人和道德上的改造。我们需要道德上的严苛革命法典。革命者是正义的手段。」对黑人革命者来说，毛泽东思想的道德和伦理的层面注重个人改造的观念。这样的过程是熟悉的，比如马尔科姆•X和（后来的）乔治•杰克逊（George Jackson）：通过一个人所拥有的革命思想来进行自我改造的思想。（浙西说法几乎都是只针对男性的，尽管黑人妇女激进分子的回忆录数量也在不断增加）不管 RAM 的成员是否按照「干部守则」生活，毛主义的道德最终确实强化了马尔科姆作为革命楷模的地位。\n\nRAM 的十二项计划要求发展解放学校、全国黑人学生组织、枪支俱乐部、黑人农夫联盟——并不局限于经济发展，还要着眼于保持「社区和游击队继续运转」——以及一支由年轻人和失业者组成的解放游击队。RAM 尤其关注国际主义，许诺对亚非拉的民族解放运动进行支持，并采用「泛非社会主义」。与克鲁斯那篇重要的文章《革命的民族主义和美国黑人》一致，RAM 成员认为他们自己是殖民主体，「在家园同殖民战争」作斗争。一如斯坦福德在一篇内部的文档《革命运动的项目和问题》（_Projects and Problems of the Revolutionary Movement_）中所写的那样，「RAM 的意见是，美国黑人不是美利坚合众国的公民，这个国家剥夺了他们的人权，黑人只是殖民主体罢了。这样的观点表明了，美国的黑人是被俘虏了的受压迫的民族。他们的解放斗争不是为了融入白人社会，而是要完成全国范围内的解放。」\n\n正因为殖民主体亦有自决的权力，RAM 认为美国黑人是确确实实的不结盟民族的一员。RAM 成员甚至认为他们是「万隆世界」的一部分，他们甚至于在 1964 年的十一月在纳什维尔举办了名为「黑人革命与万隆世界」（The Black Revolution's Relationship to the Bandung World）的会议。在1965 年发表于 RAM 的刊物《黑人美国》上的文章中，RAM 的成员们开始形成一种「万隆人道主义」或者叫「革命黑人国际主义」的思想，他们认为西方帝国主义和第三世界之间的斗争——更甚于劳动和资本之间的斗争——代表了我们这个时代最为基本的矛盾。他们联系非裔美国人的解放斗争和发生在中国、赞比亚、古巴、越南、印度尼西亚和阿尔及利亚所发生的事件，并将他们的工作描述为毛泽东的包围西方国家并挑战帝国主义的国际化战略。1966 年后，「万隆人道主义」一词彻底被丢弃，取而代之的是「黑人国际主义」。\n\n「黑人国际主义」的细致含义在 RAM 于 1966 年出版的胆大包天的三十六页小册子中呈现。这本名为《世界黑人革命》（_The World Black Revolution_）的小册子，粗略地效仿了《共产党宣言》，有着强烈的对抗资本主义的西方和苏维埃帝国的中国特色。「革命的中国的出现极化了这世上的社会地位和阶级矛盾，这既出现在资本主义的帝国主义西方阵营中，又出现在欧洲的中产阶级共产主义-社会主义阵营中。」换句话说，中国是那个使得殖民地和西方宗主国之间的矛盾扩大的契机。RAM 反对后来在西方发达国家兴起的社会主义革命思想，他们坚持唯一的革命出路是“通过世界黑人革命，由底层黑人来对世界进行专政。”当然，作者并非从今天的定义出发；RAM 所使用的“底层”一词包含了所有有色的人民，包括亚洲、拉丁美洲、非洲和其他地方的人民；「底层黑人」只不过是殖民世界的一个形容罢了。中国彼时正处于保卫独立核解放成果的斗争当中。现在，在那以外的「黑人」世界必须紧随其后：\n\n> _底层黑人民众只有一种方法，能让他们从殖民主义、帝国主义、资本主义和新殖民主义中解脱；那就是通过一场世界黑人革命完全地摧毁西方（资本主义）文明（世界上的城市），并建立一个革命的世界黑人专政，以此结束人对人的剥削，然后，一个新的革命的世界将会诞生。_\n\n为了和革命相协调，RAM 提议建立一个黑人国际组织以及「世界规模的人民解放军队」。\n\n为了说明其尖锐的民族主义，《世界黑人革命》称黑人民族主义「是真正的国际主义」、仅仅摧毁白人民族主义/白人权力就能够达到每一个人的自由。然而，不仅民族的界限不会因为「底层黑人的专政」而被消灭，连「民族主义需求的进步形式也会随之湮灭。」这写说法都是 RAM 的社会和意识形态的确凿根基。不过，这并未代表了统一的意见，反倒是反应了整个 RAM 历史上的意见分歧。一方面，民族主义者们感觉革命者应当先为黑人民族奋斗，而后建立一个仅立足于美国之上的社会主义。另一方面，像是詹姆斯和格雷斯•博格斯兄弟这样的社会主义者则想要直到谁将会统治“白人”民族，以及这样的局面对于黑人自由又意味着什么。他们同样反对复兴“黑人州”的论调——老派共产主义者所连结的南方黑人聚居的乡间（”黑人带“）有权利从联邦中脱离。博格斯兄弟认为真正的权力依托于城市，而非黑人带的乡村地带。在 1965 年一月，詹姆斯•博格斯辞去了他的意识形态主席职位。\n\n在保持地下组织的身份多年后，RAM 被《生活杂志》（_Life_）和《绅士》（_Esquire_）进行了一系列的揭发，他们被认为是密谋了对「白佬」的战争的主要极端团体之一。”北京支持「的队伍被认为不仅仅是有武装的且有威胁的，更是”熟读革命书籍——从马拉（Jean-Paul Marat）到列宁到毛泽东、切•格瓦拉，以及弗兰兹•法农。」（进步劳动党的哈勒姆分部对这些文章用一本叫《对抗黑人美国的阴谋》［_The Plot Against Black America_］的小册子进行回应，其中认为中国并非是经济革命，他们只是通过决绝的反帝国主义设定了一个革命的榜样。小册子中认为黑人革命的真正起因可以从贫民窟的生活条件中找到）让人不感到惊奇的是，这些高度宣传的文章带来了一系列的警察对于位于费城和纽约的 RAM成员的搜捕。在 1967 年的七月，RAM 的成员被围捕并被指控密谋教唆暴动、使用氰化钾给警察下毒以及暗杀罗伊•威尔金斯（Roy Wilkins）和惠特尼•杨（Whitney Young）。一年后，在中情局反间谍计划（COINTELPRO）空前的压力之下，RAM 自我转型为了黑人解放党（Black Liberation Party）。或者被称为是非裔美国人民族解放党（African-American Party of National Liberation）。到了 1969 年，RAM 差不多已经名存实亡了，尽管如此，其成员还是选择”将成员融入社区之中并渗透到现有的黑人组织中去“，以此继续推行十二项计划并发展致力于「黑人国际主义的科学和罗伯特•威廉姆斯主席的思想」。\n\n反间谍计划仅仅是部分解释了 RAM 的解散。一些成员移籍到了其他组织，比如新非洲共和国（Republic of New Africa）和黑豹党。但 RAM 逐渐减少的成员数和最终的死亡可以部分归于其策略上的错误。确实，其成员对于当时贫民窟情形的理解和特定战术的灵活性表明了他们确实不是优秀的毛主义者。毛泽东提出的维护革命本质的思想并没有被他们牢记在心中；一度 RAM 甚至认为只需要九十天就能完成争取解放的战争。又因为 RAM 的领导人疲于对付政府对黑人领导人的正面进攻，他们改良主义的行动未能在黑人城市社区中建立起强有力的根据地。此外，尽管他们坚持要发展国际主义，他们却没有触及到其他受压迫的美国境内的「民族」。然而，RAM 和罗伯特•威廉姆斯的确将革命的黑人民族主义上升到了通常意义上反修正主义的辩证的理论层面上的地位。他们为哈罗德•克鲁斯、弗兰茨•法农、马尔科姆•X 极力在写作和演说中试着去发展的事物提供了组织上和实际中的例子。更重要的是，尤其是在中国的文化大革命爆发之后，他们为革命的黑人民族主义在毛泽东思想中找到了理论上的依托。\n\n# 黑人带回归\n\n不管人们是怎样看待文革的，它确实将影响投射到了整个世界——特别是那些大体上对中国和革命运动怀抱同情心的人们——那是一个有权者和无权者的分界线被模糊、身份和特权并不能从人民中选出领导者的社会光景。社会主义者保尔•斯维齐（Paul Sweezey）和里欧•休伯曼（Leo Huberman）作为独立社会主义刊物《每月回顾》（Monthly Review），他们认识到这样一场革命对于美国的城市贫民来说是有着巨大影响的：“想象一下这个国家的总统，强调尤其是让这个国家的劳苦大众，去自力更生地战胜贫困，并许诺他们军队的保护，以免受到打击报复。”当然了，美国根本不把黑人当作是「人民」。他们面临的问题在于这个社会有一个无底洞，他们的暴动是无疾而终的，革命团体是春风吹又生的，黑人贫民根本无从获取足够的同情。\n\n对于许多新左派来说，非裔美国人不仅仅是「人民」，他们更是工人阶级中最为革命的一环。文革对于消除社会阶层并赋权于被压迫者的强调，加强了黑人解放运动是新美利坚革命的中心的思想。毛泽东他自己也在他广为流传的 1968 年的讲话《对美国黑人抵抗暴力压迫的支持》（In Support of Afro-American Struggle Against Violent Repression）中也确认了这一观点。这场讲话在中国为抗议马丁•路德•金遭到暗杀而举行的大型游行示威活动中进行，其中罗伯特•威廉姆斯和维奇•加文是特邀演讲人。据加文回忆，“数以千万的中国民众”在瓢泼大雨中游行，谴责美国的种族主义。作为对深受马丁•路德•金遭遇暗杀的触动的反抗者的回应，毛泽东将这些城市中的起义描述为“呼吁全体被剥削和压迫的美国人民反抗垄断资本主义阶层的登高一呼。”这更甚于他在 1963 年发表的讲话，毛泽东的话语给予了城市暴动以世界革命起义中的历史性地位。\n\n# 黑豹党\n\n正是在包括了 RAM 的各种黑人激进组织的汇流融合之下，以自我防卫为目标的黑豹党在加州的奥克兰诞生了。他们也许是显眼的传播毛泽东思想的黑人组织，但从某些意义上来说，他们也是在阅读马克思主义、列宁主义和毛泽东思想的著作并形成革命的意识形态上最不严谨的组织。黑豹党由休伊•牛顿和 RAM 的前成员博比•希尔创建，其影响力已经远远超出梅里特学院，同时还大量召集流氓无产阶级者。参与其中的人和事都表明了他们更多地只是在打口号而没有做其他事。他们的圣经就是「小红书」。\n\n![MTE5NTU2MzE2MzAzNjg5MjI3.jpg (1500x992)](data/img/post_3_MTE5NTU2MzE2MzAzNjg5MjI3.jpg)\n\n黑豹党，至少从说辞和大纲上来说，是以马克思主义作为来源之一，来辩驳罗恩•卡楞加的美国组织和其他那些被他们轻蔑地诋毁为文化民族主义者的组织。其实，黑豹党自身不仅仅有着他们自己的文化民族主义议程，而且那些所谓的文化民族主义者并非是孤立的或者一致亲资本主义的。并且这其中的分歧被反间谍计划加以利用挑拨。尽管如此，在黑豹党所进化出的社会主义思想和阶级斗争以及黑人民族主义团体之间有着基础性的差异，即便是对于左派来说亦是如此。一如博比•希尔在 1969 年三月的采访中说的：\n\n> _我们在谈论社会主义。文化民族主义者认为社会主义对我们来说毫无用处。而这是在老的社会主义和新的社会主义之间的矛盾。黑人没有时间去实施黑人种族主义，黑人民主也并非只是因为白人的肤色而仇恨他们……我们不是要傻乎乎地宣称我们与一些正义的白人革命者或者这个国家中其他贫困的或是受到压迫的人民不可能形成联盟，他们完全可以认识到我们必须摆脱资本主义系统的事实。_\n\n黑豹党形成这一观点的方式，以及党内立场的分裂是一个复杂漫长到我们无法在这里叙述的故事。我们打算的，是简要地写清黑豹党对毛泽东思想的拥护和与之相对的黑人自决。对于为黑豹党贡献了对抗埃尔德里奇•克莱弗（Eldridge Cleaver）和乔治•杰克逊（George Jackson）的意识形态的休伊•牛顿来说，他的黑豹党的马克思主义源于中国和古巴的革命，这恰恰是因为他们的分析来自各自的历史，而非《资本论》的内容。中国和古巴的例子，根据牛顿的意思，使得黑豹党形成了自己独特的计划并抛弃了马克思和列宁的那些很少能够运用到黑人面对的现实上的理论层面观点。事实上，马尔科姆•X 无疑对黑豹党形成了巨大的意识形态影响。\n\n埃尔德里奇•克莱弗对于毛主义和朝鲜共产主义领导人金日成在重塑马列主义对第三世界人民的民族解放斗争中的角色表现得更为直言不讳。在 1968 年的一册名为《论黑豹党意识形态观之一》（On the Ideology of the Black Panther Party Part I），克莱弗解释称，黑豹党是一个马列主义的政党，但他又同时补充说马克思、恩格斯、列宁现在的追随者都没有提供足够的见解来理解种族主义并与其作斗争。书中的教诲要求取精华而去糟粕。克莱弗这样写道：\n\n> _伴随着 1948 年朝鲜人民民主共和国和 1949 年中华人民共和国的建立，一些新的事物被植入了马列主义的内部，它不再只是一种狭隘的、专门的欧罗巴现象。金日成同志和毛泽东同志应用马列主义的古典理论于各自国家的具体情形中，并由此使得意识形态成了对人民有益的事物。但他们反对那部分对他们自身无益的、仅有关欧洲福祉的分析。_\n\n在克莱弗看来，对于西方马克思主义的盲目无知的最为犀利的批评来自弗兰茨•法农对于种族的看法。\n\n黑豹党将他们自己看作是全球解放运动的一部分，他们还作为一个拥有与生俱来的自决权的殖民地来为黑人社区发声。然而，他们与许多其它的黑人或跨种族的毛主义团体不同，他们从不支持脱离美国或者建立一个独立的州。更确切地说，将黑人描述为殖民主体是刻画种族主义的物质本性的一种方式；这更像是一种比喻而非分析得出的概念。自决被理解为是在城市环境中而不一定是在黑人民族的构建之上的社区控制手段。在一份由 1968 年的和平与自由党（Peace and Freedom Party）在其成立大会上发布的文件中，克莱弗试着理清美国革命中跨种族的联合体与「黑人殖民地的民族解放斗争」之间的联系。基本上，他需要两种方式来探寻这一问题。其一，他认为需要黑人和白人一起致力于建立一个革命组织的联合，并形成政治和军事上的计策来推翻资本主义和帝国主义；其二，他认为需要一场联合国支持的全民公投来允许黑人自己来决定到底是希望维持统一还是决定分裂。正像是曾经非洲的第一波独立运动曾决定过的，究竟是维持某种再次被统治的形式还是获得完全的独立一样，他认为这样的公投将会让黑人看清掩盖着自觉这一命题的迷雾。\n\n克莱弗代表了党内那些相对于重建社会或者努力兴建草根组织，更有兴趣致力于游击战争的那一派。毛泽东、金日成、切•格瓦拉的吸引力则让法农开始撰写关于他们的革命暴力和人民战争的文章。许多自成一派的黑豹党理论家都极力致力于开发维持固有的革命的策略，以至于他们都没有读过许许多多毛泽东的著作。牛顿发现了这一问题，他开始寻找方法，来让黑豹党将注意力从游击战和暴力中转移到一个更为深刻、丰富的对于政党的未来所需的讨论中。在他于 1970 年八月被释放后不久，他便打算建立一个“意识形态学会”，在那里参与者可以学习领会到他口中的那些「经典」——马克思、毛泽东和列宁，以及亚里士多德、柏拉图、罗素、康德、克尔凯郭尔和尼采。不幸的是，意识形态学会并没有开花结果；极少有党员看到了抽象理论或者其中一些有关革命的文章的关联性的用途。事实是党员们对于《毛主席语录》的阅读或多或少更像是一本没有太大帮助的游击队手册。即便是法农的阅读也是有选择性的，他的所写的章节《有关革命》（_Concerning Revolution_）成为了武斗派的最爱。而乔治•杰克逊，由于他的许多文章，从《孤独兄弟》（_Soledad Brother_）到《我眼中的血》（_Blood in My Eye_）都主要借鉴了毛泽东的思想并讨论了武装抵抗法西斯主义，所以他对黑豹党的贡献都专注于战争上。对于马克思、列宁和毛泽东的著作的阅读，一旦超出了武装斗争的范畴，在黑豹党党员中就很难找到听众。席德•勒梅尔（Sid Lemelle），这位当时的就读于洛杉矶的加州州大的激进活动家在回忆起和一些加入了由加州共产主义者联盟（California Communists League）资助的学习小组的黑豹党党员进行交谈的时候表示，对于阅读像是毛泽东的《四篇哲学论文》（_Four Essays on Philosophy_）和列宁选集中的长篇的时候，结果最终表明它们太难了，最后只会让整个小组陷入一片混乱的辩论之中。\n\n也许《毛主席语录》中被读的最少部分，至少从男性的角度来说，应该是由五页组成的有关女性的章节。那时，黑人解放运动的代名词越发变得大男子主义，参与到运动中的男性不仅无视了妇女为解放所做的斗争，甚至还强化了性别压迫，即便是最为马克思主义者的黑人民族主义运动也只是渺小的“妇女问题”。黑豹党自然也不例外。事实上，事情就发生在 1969 年 SDS 的历史性会晤期间。会上，黑豹党引用了马克思、列宁、毛泽东来在民族问题上要求驱逐 PLP。其中，黑豹党的信息部长鲁福斯•沃斯（Rufus Walls）发表了那篇臭名昭著的演讲，即革命需要女性的原因在于她们拥有“阴道的力量”。显然，这是对于毛泽东的那句话的具体应（滥）用：「中国的妇女是巨大的人力资源……为了建设一个伟大的社会主义国家而奋斗。」沃斯的言论被证明是反对女性参与革命的极度反女性注意行径。\n\n尽管中国自身对女妇女问题的历史也是糟糕的。毛泽东那句「妇女能顶半边天」，以及他在女性平等和对革命的参与问题上的短文，赋予了女性解放以某些左派的革命正统性。当然，毛主义并没有引发革命：事实是，妇女的斗争在新左派的重塑左派运动中的女性议程，或者说，至少是将女性主义摆上议程之中扮演了重要的角色。不过对于黑豹党中的对“白人女性主义”持怀疑态度的黑人妇女来说，毛有关女性平等的话语在党内开辟出了最初的黑人女性主义议程的空间。用 1971 年访华回归后不久便在媒体发布会上发表讲话的新任信息部长，黑豹党党员伊莱恩•布朗（Elaine Brown）的话来说，就是：「黑豹党承认中国同志在革命的所有领域中对于我们的先进领导。尤其是，我们了解到中国在于女性地位和男性地位是平等的这件事上的认识是正确的。」\n\n无需花言巧语，黑豹党中的黑人女性，如林•弗伦奇（Lynn French）、凯瑟琳•克莱弗（Kathleen Cleaver）、艾丽卡•霍金斯（Erica Huggins）、阿夸•恩杰（Akua Njere）和阿萨塔•沙库尔（Assata Shakur，原名乔安妮•切西玛德），她们继续了在现有的男性主导的组织中开疆拓土并向各种日常的对于黑人女性工人阶级的剥削进行质疑。比如，通过黑豹党的免费早餐和教育计划，黑人女性从各个方面设计了战略，来质疑资本主义、种族歧视和父权主义。一些非裔美国人女性的激进分子晋升到了显赫的地位，其中一些还提出了武斗派的、阶级意识的黑人女性主义观点。\n\n在某些例子中，由一些所谓的针对女性问题的毛主义口号作为支持，黑人左派女性主义观点观点的力量的持续增长形成了后来的黑人毛主义结构。其中一个显著的例子即是黑人先锋党（Black Vanguard Party），其他则有活跃于二十世纪七十年代中期至晚期的湾区毛主义组织；其出版物《自主！》（_Juche!_）持有坚实的「社会主义-女性主义」观点。米歇尔•吉布斯（Michelle Gibbs，婚后名为 Michelle Russell），作为来自底特律的革命黑人工人联盟（League of Revolutionary Black Workers）的支持者以及黑人工人大会（Black Workers Congress）的一员，她推动了黑人女性主义的意识形态。“共产主义接班人”（red diaper baby，意指父母都是美国共产党的孩子）泰德•吉布斯（Tedd Gibbs）的父亲在西班牙内战中作战，她成长在一个常客是保罗•罗布森（Paul Robeson）和艺术家伊丽莎白•卡特莱特（Elizabeth Catlett）的家庭中，她的黑人社会主义-女性主义观点来源于政坛生涯；黑人女性主义者的作品；以及马尔科姆、法农、阿缪卡•卡布饶（Amilcar Cabral），以及马克思、列宁和毛泽东这些激进者的熏陶。而相反地，占据主导地位的白人激进女性主义组织“红色长筒袜”（Redstockings）并非受到毛主义的影响，她们在某种程度上是通过黑人权力运动塑造了自身，其中尤其受到运动中的分裂主义策略和第三世界身份认同的影响。\n\n讽刺的是，黑豹党对于中国产生最大的认同的时候，正是中国在全世界左派中的地位开始降低的时候。毛泽东希望尼克松访华以及中国对于巴基斯坦和斯里兰卡镇压执政府的支持，让很多美国和其他地方的毛主义者感到幻灭。尽管如此，牛顿和伊莱恩•布朗不仅在尼克松访华的前夕访问了中国，他们还声明参与到选举政治当中是受到了中国向美国敞开大门的举动的启发。牛顿认为黑豹党向改良主义的转变、对竞选政治的参与并不抵触“中国倾覆美帝国主义的目标，也不是对于革命原理的摒弃。这是一种社会主义革命的战术。”更为让人难以置信的是牛顿对于黑人自决的完全舍弃，他解释称这是由于世界经济的发展造成的。1971 年，他颇有先见之明地得到了结论：资本的全球化将使得国家主权变得模糊不清，即便是在社会主义国家当中也是如此。因此，黑人对于自决的需求不再与黑豹党有关联；唯一可行的战略就是全球化的革命。「当下，美国的黑人比过去任何时候都更有一种特殊的责任去对社区提出要求。美国从不是我们的国家；现实是我们没有一寸可以主张的土地。在全世界受压迫的人中，我们占据了发起革命的最佳位置。」\n\n从许多方面来看，对于民族问题，牛顿都比大多数于二十世纪七十年代末期兴起的自称是拥护毛主义的组织都更接近毛泽东的思想。尽管他自称支持民族解放运动，也认同林彪的“民主革命理论”，毛泽东在民族主义阵线上却并没有支持过独立的组织。对他来说，黑人民族主义看上去就像是民族/种族的特殊主义。他毕竟是一个试着联合农民和无产阶级者并在自己的国度中消灭道德分裂的中国民族主义者。我们可以回忆起他在 1957 年的讲话，其中他要求中国的先进分子们“联合各民族的人民……而不是拆散他们。”因而，尽管毛泽东认识到种族主义是殖民主义和帝国主义的产物，他在 1968 年发表的讲话中依旧坚持“美国广大黑人同美国统治集团之间的矛盾，是阶级矛盾……美国广大黑人同美国白人中的广大劳动人民，有着共同的利益和共同的斗争目标。”换句话说，黑人的斗争注定要和工人阶级运动融为一体，并推翻资本主义。\n\n# 黑人民族\n\n然而，在黑人解放的问题上，多数建立于七十年代中期的美国的毛主义组织都以斯大林作为领袖，而非毛泽东。美国的黑人不是单纯的黑皮肤的无产者，他们是一个民族，或者就像斯大林所说的，“民族是人们在历史上形成的一个有共同语言、共同地域、共同经济生活以及表现在共同文化上的共同心理素质的稳定的共同体。”用户斯大林对于民族的定义的反修正主义团体，比如共产主义劳动党（Communist Labor Party，CLP）和十月联盟（October League）还复兴了老共产主义党的想法，即黑人地带乡间的非裔美国人组成一个国家，同时有权决定是否脱离美国。另一方面，像是进步劳动党这样的团体——一度支持“革命民族主义”的团体——通过文化大革命的发动，开始愈发呈现出否认一切形式的民族主义的思想。\n\nCLP 或许是在反修正主义运动中对于黑人自决的支持最为决绝的党派。CLP 建立于 1968 年，大多数建立者都是非裔美国人和拉丁裔，他们的根源可以追溯到陈旧的临时组织委员会（Provisional Organizing Committee，POC）——它自己也是 1956 年 CPUSA 那次建立了锤子和钢铁以及进步劳动运动的分裂的产物。POC 在经历了十多年的内部分裂的摧残后，终于分裂到洛杉矶和纽约，成为了各自的占据主导地位的黑人和拉丁裔组织。1968 年，纽约分部的领导人驱逐了他们洛杉矶的同志，因为他们拒绝否定斯大林和毛泽东。作为回应，洛杉矶的组织在经验丰富的黑人马克思主义者内尔森•皮里（Nelson Peery）的指挥下，于同年建立了加州共产主义联盟（California Communist League），并开始招募年轻黑人、其卡诺激进工人和知识分子。皮里位于南洛杉矶的家在某种意义上，在瓦茨（Watts）起义后就已经成为了青年黑人激进分子的聚会场所；他组织起非正式的团体来学习历史、政治经济和马克思-列宁-毛泽东主义/思想的经典作品，还为各种活动家们提供娱乐，包括黑豹党和来自加州洛杉矶和洛杉矶社区大学的学生们。后来，在 1970 年，加州共产主义联盟和一个 SDS 的、自称是马列主义工人协会（Marxist-Leninist Workers Association）武斗派合并，建立了共产主义联盟（Communist League）。两年后，他们再次改名，成为了共产主义劳动党。\n\n除了或许是哈利•黒伍德所著的长篇论文《黑人问题上对革命的态度》（_Toward a Revolutionary Position on the Negro Question_，在 1957 年首度发表，并在六十年代到七十年代之间广泛流传），内尔森•皮里的小册子《尼格罗民族殖民问题》（_Negro National Colonial Question_，1972）可能是在当时的马-列-毛圈子中对于黑人自决的最为充分的辩护。皮里犀利地批判了他对于「尼格罗」一词的辩护，这可能是在黑人权力运动的漩涡中最难站住脚的观点。但是皮里有着自己的见解：民族认同与肤色无关。对他来说，尼格罗民族是一个久经年月演变而来的、坚实的社群，他们有着自己独特的文化、语言（或者说是方言）和领地——黑人带乡间和附近的地区，或者说是大体上的曾经的旧联邦的十三个州。因为南方的白人们和非裔美国人享有共同的领土，且就他的话来说还有共同的语言和文化，他们也会被当作是“尼格罗民族”的一部分。更准确地说，南部白人在黑人民族之下组成了「盎格鲁-美利坚少数民族」。正如灵歌、圣歌和摇滚中所呈现出的，皮里认为这些南方发展出的音乐形式都有着强烈的非洲根源的混血儿，其形式都源于奴隶民谣故事和妇女的头巾（？）。皮里引用了吉米•亨缀克斯和 Sly 以及 Family Stone，还有白人先驱 Al Jolson、猫王和汤姆•琼斯（Tom Jones）作为文化共享的例子。他甚至认为“灵魂乐”文化是被嵌在「吃猪脚、头颈骨、黑眼豌豆、劣质大麻、甘薯和猪小肠这些和南方宗教，尤其是尼格罗民族有关的东西」上的。\n\n皮里将南方的白人视作尼格罗民族的一部分的看法，尤其是他对于消除种族隔阂的打算，是绝对的灵光一现。然而，他对于斯大林对民族的定义的坚信不移弱化了他的看法。当那时的人口转移和城市化最终使得南方乡间田野的黑人人群耗尽元气后，皮里依然坚持认为黑人带是黑人天然的家园。他甚至还尝试要证明黑人农民和稳定的乡村无产者依旧存在于黑人带。因为土地问题是对他对于自决的建立的理解的基础，他甚至紧张到以至于忘记了工业的民族化和社会化生产的存在。因此，他在 1972 年写道：「尼格罗民族殖民问题只能通过将土地返还给那些在上面幸苦劳作了几个世纪的人来实现。在尼格罗民族中，这一土地的再分配将要求州的农场和联合企业进行合并，以此来最好地应对那些处于现代机械农业形式之下的人民的需求。」\n\n共产党（马列主义）（CP［ML］）也提出了黑人带论点的一种视角，他们认为这是像是十月联盟这样的组织的化身。1972 年，CP（ML）ML 在以洛杉矶为据点的十月联盟和佐治亚州共产联盟之间完成了合并。许多其初创成员都来自于第二次革命青年运动（Revolutionary Youth Movement II）（一个 SDS 的分支），还有一些是老左派的叛变者，比如哈利•黒伍德和奥提斯•海德（Otis Hyde）。黒伍德在 CP（ML）中的地位是显赫的，因为他被认为是基于 1928 年的共产国际第六次代表大会上的原版黑人带理论的主要规划者之一。根据改进后的 CP（ML）思想来看，美国黑人有权利分裂出“他们在南方黑人带的历史性家园”。但文件也显示了，对于中止对自决权利的认识并不意味着他们就相信分裂会是最恰当的解决方案。这还要引入宗教自治的思想（比如非裔美国人的城市集中也可以使得他们能在自己的社区中施行自决）和眼神自决的口号到其卡诺人、波多黎各人、亚裔美国人、印第安人和美属殖民地的原住民中（太平洋群岛、夏威夷、阿拉斯加等等）。对于他们自己应当支持哪种民族主义运动，他们的做法是有选择性的，保证了只对革命民族主义进行支持，并抵制反动的民族主义。\n\n革命联盟（Revolution League）是湾区革命联盟（Bay Area Revolutionary Union，BARU）的产物，在访问过中国、并认为黑人需要组成「一种新型的受压迫民族」的前 CPUSA 成员的支持下，他们于 1969 年成立。由于黑人主要都是聚集在市中心、工业区（被 BARU 称作是一个「畸形的阶级结构」）的工人，他们相信自决不应该以分离的形式视线。取而代之的，应该是去通过对抗城市中的歧视、剥削和警察暴力来实现。1975 年，当革命联盟转型为革命共产党（Revolutionary Communist Party，RCP）后，它继续拥护了黑人组建一个新型民族的观点，但他们开始支持「黑人重新主张他们对于家园的权利」。在矛盾之中，RCP 的领导人选择不是去支持其中一个，而是以站不住脚的观点来为黑人自决进行辩护，这并不让人感到惊奇。两年后，他们就像 PLP 一样，彻底抛弃了自决的权力，开始全力对付各种形式的「狭隘」民族主义。\n\n和之前提到的所有毛主义主导的组织都不同，革命共产联盟（Revolutionary Communist League）——由阿米里•巴拉卡建立并领导——是二十世纪六十年代末期的文化大革命的直接产物。要理解 RCL（及其先驱）在黑人解放运动中态度的转变，我们需要回到 1966 年，那一年巴拉卡在当地活动家和在位于哈勒姆的黑人艺术储备剧院（Black Arts Repertory Theater）中工作过的人们的帮助下，于泽西州的纽瓦克建立了“精神屋”（Spirit House）。尽管精神屋的艺术家从一开始便参与到了当地的政治组织中，警察对巴拉卡和其他数名活动家在 1967 年的纽瓦克起义中的殴打，让他们的政治化脚步加快了。起义爆发后，纽瓦克吸引了一些全国的黑人领袖前来，包括了黑豹党的斯托克利•卡迈克尔（Stokely Carmichael）、H•布朗和休伊•牛顿和新兴的新非洲共和（Republic of New Africa）的艾玛莉•欧巴德蕾（Imari Obadele），巴拉卡一行人在这一时期促成了黑人权力会议的成立。没多久之后，精神屋就成为了统一的纽瓦克委员会（Committee of Unified Newark，CFUN）的根据地，这个新组织由联合兄弟（United Brothers）、黑人社区防御发展组织（Black Community Defense and Development）和黑人文化姐妹（Sisters of Black Culture）组成，加之他们吸引了黑人民族主义者、穆斯林，甚至还有一些马-列-毛主义者，CFUN 孕育了罗恩•卡楞加的美国组织的痕迹。CFUN 采用了卡楞加对文化民族主义的观点并和他并肩工作。尽管在于他对于女性的态度和从美国组织出口而来的过度集中的领导力解构上，卡楞加和一些纽瓦克活动家之间产生了紧张感，但是革命还在继续。1970 年，巴拉卡将 CFUN 重新命名为非洲人民大会（Congress of African People，CAP），将组织改造为了一个全国组织，并在初创大会上和卡楞加决裂。CAP 领袖犀利地批判了卡楞加的文化民族主义，并通过了象征重回左派的决议——包括了募集资金来促进建立跨坦桑尼亚-赞比亚铁路的提案。\n\n这一时期，一些因素促成了巴拉卡的左倾。其中之一便是他在黑人「卑鄙的中产阶级」政治家身上学习到的惨痛教训。在 1970 年纽瓦克的第一位黑人市长肯内瑟•吉布森（Kenneth Gibson）的选举中扮演重要角色后，巴拉卡见证了警察暴力的增长（包括对 CAP 示威者的镇压）和吉布森对于他对黑人社区所做的承诺的出尔反尔。他感觉受到了背叛，他幻灭了，于是巴拉卡在 1974 年和吉布森决裂，尽管他在选举之路上也并非时刻出力。他在 1972 年的全国黑人政治集会中扮演了组织的角色，这加强了他脑海中对于黑人独立政治的力量和黑人联合阵线的潜在力量的想法。\n\n一个对巴拉卡产生巨大影响的因素是 CLP 东岸分部的宗教协调者威廉姆斯•瓦特金斯（Williams Watkins）。瓦特金斯出生并成长在哈勒姆区，他投身于后来帮助建立了共产联盟的黑人学生激进组织“加州洛城”（Cal State Los Angeles）中。1974 年，他结识了巴拉卡，「我会在他的办公室待上好几个小时，」瓦特金斯回忆道，「讨论基础问题——比如剩余理论。」大概有三个月的时间里，巴拉卡常常和瓦特金斯会面，后者教给了巴拉卡政治经济的基础原理，并试着告诉他文化民族主义的局限性。这些会面确实地影响了巴拉卡思想的左倾，但当瓦特金斯和内尔森•皮里要求巴拉卡加入 CLP 时，他拒绝了。尽管他开始欣赏马克思主义-列宁主义-毛泽东思想，但他不打算加入一个多种族的组织。黑人斗争才是首要的。\n\n确实，巴拉卡的激进主义的多数重要来源都是非洲。1960 年，在他刚刚开始左倾的时候，他就是受到了古巴革命的激励，而南非的抗争则促成了他在七十年代的彻底转型为左派。其中最为关键的事件是 1971 年，非洲解放支持委员会（Africa Liberation Support Committee，ALSC）的建立。奥乌苏•萨多凯（Owusu Sadaukai），这位位于北卡罗来纳的格林斯郡（Greensboro）的马尔科姆•X 解放大学（Malcolm X Liberation Uniersity）的主管带领了一群黑人民族主义者建立了这个组织，他还在解放莫桑比克阵线（Front for the Liberation of Mozambique，FRELIMO）的护卫下游历了莫桑比克。FRELIMO 的主席萨莫拉•马谢尔（Samora Machel）（巧合的是，他和休伊•牛顿在同一时间都身处中国）和其他武斗派都追随萨多凯和他的同事，后者，这群 ALSC 的人在支持反殖民主义中尽了最大的努力，从内部对抗美国资本主义，并让全世界了解到有关 FRELIMO 的真相，即发动战争对抗葡萄牙的殖民统治。\n\nALSC 反映了葡属非洲的解放运动的激进指向。在 1972 年的五月二十七日（非洲联合组织的建立周年纪念日），ALSC 组织了第一场非洲解放日（Africa Liberation Day，ALD）的示威游行，在华盛顿吸引了大约三万名示威者，以及全美各地超过三万的示威者。ALD 协同委员会由各种民族主义者和黑人左派组织组成，后者包括了黑人联合青年组织（Youth Organization for Black Unity，YOBU）、斯托克利•卡迈克尔为首的全体非洲人民革命党（All People's Revolutionary Party，AAPRP）、泛非人民族织（Pan-African People's Organization）和受到毛主义影响的黑人工人大会。由于 ALSC 聚集了这样一个广泛的黑人活动家群体，会场变成了探讨黑人激进主义议程安排的创设的场所。虽说多数 ALSC 的组织者都是鲜明的反帝国主义者，但黑人马克思主义者占领导地位的人数却最终成为了争论的焦点。除去萨多凯——因为他要在毛主义为主导的革命工人联盟（Revolutionary Workers League，RWL）中担任重要角色——ALSC 的主要领导人包括了内尔森•约翰逊（Nelson Johnson，后来的共产主义工人党领袖）和阿卜杜•阿尔卡利马（Abudu Alkalimat，杰出的作家以及革命联盟的创立者之一）。\n\n早在 1973 年，ALSC 内部就出现了分裂。内部的口角和宗派主义表明了 ALSC 已经无法掌控局势，而中国的外交政策给予了他们最后一击。在 1975 年间的安哥拉内战中，中国对于 UNITA（争取安哥拉彻底独立全国联盟）的支持和副主席李先念和白人南非政府进行交谈的建议，比武装暴动更加糟糕地将 ALSC 中的黑人毛主义者置于一个不利的境地中。仅仅三年，ALSC 便坍塌了，这个也许是十年间最为活跃的反帝国主义组织就这样不幸地终结了。\n\n尽管如此，巴拉卡在 ALSC 中的经历最终改变了他的思想。正如他在自传中所回忆的那样，在 1972 年第一次非洲解放日游行的时候，他正在「左倾，我正在阅读恩克鲁玛、科布拉（Amílcar Cabral）和毛泽东的作品。」两年间，他要求 CAP 的成员检测“国际革命的经验（换句话说就是俄国和中国的革命），并将它们同非洲革命的实践相结合。”他们的研究单一直要延伸到毛泽东的作品，如《四篇哲学论文》、斯大林的《列宁主义的基础》（_Foundations of Leninism_）以及《苏联共产党党史（缩写版）》（_History of the Communist Party Soviet Union (Short Course)_）。到了 1976 年，CAP 已经消除了所有民族主义的残余，改名为革命共产联盟（RCL），并试着将自身重新塑造为一场多民族的马克思主义-列宁主义-毛思想的运动。也许这是 RCL 作为一种建立其反修正主义运动的意识形态的锚点，他们又谈到了复兴黑人带这一有着优良传统的论点。1977 年，RCL 出版了论文“黑人民族”（\"The Black Nation\"），其中他们分析了源于马克思主义-列宁主义-毛思想的黑人解放运动，并总结认为南方的黑人和大城市里的黑人应该组建一个有着固有的自决权的民族。尽管他们反对「中产阶级联合」，在文章中他们还是声称为黑人政治权力所做的奋斗是为自决所做的斗争的中心。\n\n巴拉卡作为一个在黑人艺术运动中深深植根的彻头彻尾的艺术家，他坚持将自己的艺术和政治目光集中于身处资本主义、帝国主义和种族主义之下的黑人生活的矛盾上。对于巴拉卡，也是对这里探讨到的许许多多人来说，这不仅仅是一个有关狭隘的民族主义的问题。相反，在资本主义和帝国主义的大背景之下理解种族压迫和黑人革命的处境，对于人类的将来是至关重要的。传承了杜波依斯、法农和克鲁斯，巴拉卡坚持认为黑人（受殖民的）无产者是世界革命的先锋“并非因为一些神秘的沙文主义，而是由于我们在客观历史中的处境……我们是先锋，因为我们处于底层，大概我们站起来的时候，所有堆积在我们头上的事物都将崩塌。”此外，尽管他沉浸于马-列-毛的文学作品中，他个人的文化工作依旧表明了他也像大多黑人激进分子一样，了解黑人是否应该组建一个民族的问题并不能通过阅读列宁或者斯大林的作品，或是让路易（M.N. Roy）复活来解决的。如果这一问题被解决了，那么战争就会在艺术的土壤上取而代之。尽管黑人艺术运动是美国黑人文化革命的主要载体，也很难想像，要是没有中国的存在，革命将会变成什么样子。黑人激进分子不畏艰险地领悟了伟大的无产阶级革命，并学以致用。\n\n# 伟大的（黑人）无产阶级革命\n\n> _为艺术的艺术，超阶级的艺术和政治并行或互相独立的艺术，实际上是不存在的。_\n> ——毛泽东，《在延安文艺座谈会上的讲话》，1942 年五月\n> 在文化大革命爆发不到一年的时间里，罗伯特•威廉姆斯就在《巡弋者》上出版了一篇名为「重建美国黑人的艺术来铸就黑人灵魂」（_Reconstitute Afro-American Art to Remold Black Souls_）的文章。然而，毛泽东发动文化大革命的意图在于摆脱陈旧的行动指令的残余（文化和其他方面的），而威廉姆斯——和美国的其他文化运动不同——他在谈论的是净化黑人文化的「奴隶心态」。尽管他采用了一些中国共产党（Chinese Communist Party，CCP）宣言（即 1966 年八月十二日在《北京周报》上刊登的「中国共产党中央委员会关于无产阶级文化大革命的决定」）的话语，威廉姆斯却发现他的文章其实是建立在文化大革命的思想上而非是意识形态上的。一如毛泽东，他呼吁黑人艺术家摆脱旧传统的桎梏，单纯地为革命创作艺术：\n> 美国黑人艺术家必须做出果决和自觉的努力，来重建我们的艺术形式，以此来铸就新的骄傲的黑人和革命的灵魂……新的理论和指向必须被创造出来，使得我们的人民能准备好面对的更为艰苦、血腥和漫长的对抗种族主义暴政和剥削。黑人艺术必须为了全体黑人民众的利益服务。艺术必须作为黑人革命弹药库中的有力武器。\n> RAM 的领袖出现了。一份 1967 年左右的 RAM 内部档案，「当下的一些相关问题」（_Some Questions Concerning the Present Period_）提出全方位的美国文化大革命，其目的在于摧毁有条件的白人压迫的多数人、态度、方式、风俗、哲学、习惯等等。这意味着新的革命文化。这也意味着将头发弄直、把肤色漂白等等的主导文化的残余的终结。实际上，革命的目标不只在于消弭中产阶级尼格罗民族，还在于根除美发师和理容师。\n> 艺术的意识宣传作为黑人解放中的武器并不算新鲜；就近我们至少也可以追溯到哈勒姆复兴的左翼阵营中。美国的黑人艺术运动，几乎每一次当代民族解放运动，都非常严肃地采用了这一思想。法农在《地球的可悲者》（_The Wretched of the Earth_）一书中已经谈论了许多，这本书的英译本在这一时期就像野火一般地扩散着。然而，中国的文化大革命依旧非常引人瞩目。毕竟，就算多数黑人民族主义者都不对中国很熟悉并且没阅读过毛泽东的作品，甚至，要是他们没有承认过或者直截地说明他们对于毛主义思想在他们为革命艺术或者为文化革命所绘制的本质上的需求，就算如此，这一平行的革命也是惊人的。看看罗恩•卡楞加 1968 年发表的宣言「黑人文化民族主义」（_Black Cultural Nationalism_）。这篇文章首次发表在《尼格罗文摘》（Negro Digest）上，文章的许多思想都源自于毛泽东的《在延安文艺座谈会上的讲话》。他像毛泽东一样，认为所有艺术都必须用两个标准来评判——「艺术性」和「社会性」（「政治性」）；革命的艺术必须是为了群众创作的；并且，用卡楞加自己的话来说，艺术「必须是功能性的，即是有用处的，正如我们不能接受错误的学说『为了艺术而艺术』。」人们无法否认毛主义对于卡楞加在创造另一种革命文化上做出的努力的影响。确实，宽扎节（一个非裔美国人的节日，由卡楞加发明，并于 1967 年第一次庆祝）的七戒律，即团结、自决、共同工作、责任、共有经济（社会主义）、创造力、目标和平等的信任，和毛泽东的思想，以及「传统」的非洲文化都是相符的。也许这并非巧合，因为这七戒律是 1964 年朱利叶斯•尼雷尔（Julius Nyerere）总统的坦桑尼亚阿鲁沙宣言（_Arusha Declaration_）的基础——坦桑尼亚是中国最早也是作重要的非洲盟友。\n\n尽管卡楞加对于毛泽东的借鉴未经证实，进步劳动党还是做了相关记录。PLP 的报纸《挑战》（The Challenge）以一篇标题为《琼斯-卡楞加的欺诈：文化“反抗者”耽误了我们》（_Jones-Karenga Hustle: Cultural 'Rebels' Foul Us Up_，注：琼斯是阿米里•巴拉卡的原名）中伤了所有的黑人艺术运动及其理论家，文章称卡楞加是「伪知识分子」，他「通读了毛泽东有关艺术和文学的谈话，」文章继续批判道，「『文化民族主义』不仅是在崇拜非洲文化中最为反动的一面，它更是在通过他们身着的衣物来衡量一个人的革命意志！这竟是“黑人意识”的一部分。」\n\n当然，革命确实成为了一种艺术，或者，更准确地说，一种独特的风格。不管是非洲爆炸头，还是大喜吉装（dashikis），或是皮革夹克衫和贝雷帽，大多数美国的黑人革命者都发展出了他们自己的美学标准。在出版业界，毛泽东的“小红书”对黑人激进圈子的文学风格产生了极其巨大的影响。口袋书中干练的引述、格言可以涵盖各种主题，包括道德行为、革命思想和实践、经济发展和哲学，这一主意对不同政治联盟的黑人活动家都产生了吸引力。「小红书」促成了一个精致的迷你书产业，让黑人武斗派能够清晰地表达他们的想法。由厄尔•欧法里•哈钦森（Earl Ofari Hutchinson，在朱迪•戴维斯的协助下）编辑的《黑人书》（_The Black Book_）正是一个很好的例子。《黑人书》由激进教育计划（Radical Education Project）出版（1970 年左右），涵盖了来自 W.E.B. 杜波依斯、马尔科姆•X 和弗兰茨•法农的引述，涉及了广泛的话题，从国内革命到世界革命。其与《毛主席语录》的相似性是让人感到震惊的：章节标题包括有「黑人文化和艺术」、「政治」、「帝国主义」、「社会主义」、「资本主义」、「青年」、「第三世界」、「非洲」、「在美利坚」和「黑人团结」。欧法里的引言将黑人斗争置于全球的大背景下，并呼吁革命道德和「如同第三世界的物质联合一般的精神」。「真正的黑色，」他补充道，「应该是一种共同的生活方式，一个共同的价值观和一个共有的世界观」，三者皆来自于我们在西方的独特经历。《黑人书》不是为了抵抗毛主义的入侵而防卫黑人民族主义而写成的。正相反，欧法里在引言中这样结尾：「各地的自由战士们啊，继续阅读你手上的小红书，但别忘了在一旁摆上革命的《黑人书》。为了在接下来的战争中取得胜利，两者不可缺一。」\n\n![freedom-is-a-state-of-mind.jpg (1116x900)](data/img/post_3_freedom-is-a-state-of-mind.jpg)\n\n在这一风潮中，还有一个流行的文本是《克瓦米•恩克鲁玛箴言：自由斗士版》（_Axioms of Kwame Nkrumah: Freedom Fighters Edtion_），这本书大约在 1969 年出现——在中国的外文出版社推出第一版英语版《毛主席语录》后一年。这本书外包装为黑色，款式为镶金边，卷头插画下有一行表明了革命意志的重要性的话：“生命的秘密在于无所畏惧。”除去非洲的相关内容，其他章节和「小红书」简直别无二致。主题包含了「非洲革命」、「军队」、「黑人权力」、「资本主义」、「帝国主义」、「人民武装」、「人民」、「宣传」、「社会主义」和「妇女」。大多数的引述都很模糊，或者只是明显的喊口号（「人所创造的最糟糕的知识垃圾就是种族优劣」或者「革命者只有投降了才是失败」等等。）然而，许多恩克鲁玛的深刻见解其实都本可以是毛泽东的成品，尤其是那些关于人民流动性的需求、思想和行动之间辨证联系和有关战争与和平的问题以及帝国主义的引述。\n\n在文化问题上，美国的多数毛主义和反修正主义团体都不太关心建立一个新的、革命的文化，他们更愿意摧毁旧的残余、攻击那些被认为是倒退的、中产阶级资本主义的商业文化。在这个方面，他们和伟大的无产阶级文化大革命是一致的。在 CP（ML）的报纸《呼吁》（_The Call_）对于电影《超级飞》（_Superfly_，俚语，含义为一级棒）所做的令人惊叹的影评中，报纸抓住了评述反文化的良机，并谈到了资本主义在推动黑人社区的毒品交易中所扮演的角色。「看看那些嗑药过度的人们，他们在自己人当中被残杀、在工厂事故中因为嗨大而被碾碎，事实很清楚，那就是毒品的杀伤力比武装的警察要大得多。」为什么一部面向黑人的电影要美化毒品文化呢？因为「帝国主义统治者直到一个简单的真相——一旦你染上了毒品，你就没时间考虑革命了——你光忙着担忧哪里会有子弹飞过来了！」影评还带来了一些中国的历史：\n\n> _英国竭尽所能地让中国人民沉醉于鸦片之上。工人用一部分工资买鸦片是很常见的，这让他们加速成为瘾君子。只有革命才让他们摆脱了这种苦难。通过夺回他们的国家，并将社会转变为一个真心为人民服务的家园，人们才不再需要躲避毒品。_\n\n毛主义者的攻击不局限于大众商业文化的多数反动面。黑人艺术运动——讽刺意味的一场受到中国和古巴的发展的启发的运动——也在反修正主义的左派的目光下接受了严厉的审查。像 PLP 和 CP（ML）这样的团体，尽管他们在民族问题上有矛盾，也都认同黑人艺术运动和其对于黑人文化的吸引力是有失偏颇的，否则便是彻底的反革命。PLP 指责黑人文化民族主义者是将最为退步的非洲文化面兜售给大众，并「以『非洲文化』和『革命』的名义剥削黑人女性」的卑鄙的中产阶级资本主义商人。同样，PLP 的社论苛评了黑人艺术运动，称其「教授了非洲国王和女皇，还有非洲『帝国』。不应该有阶级的途径——别说国王这些东西，来压迫非洲人民大众。」同样地，一篇 1973 年刊登于《呼吁》的社论犀利地批判了黑人艺术运动，称其「否定了美国黑人真实的民族抱负……替代了非洲反文化以反帝国主义斗争。」\n\n尽管这些攻击大体上都是不公正的，准确地说是通过聚集其一干黑人艺术家，一群第黑人艺术运动有着相似看法的黑人艺术家来诋毁这一运动的。就小说家约翰•奥利弗•基伦斯（John Oliver Killens）而言，中国的文化大革命提供了一种将黑人民族主义改造为革命力量的模型。这致使他在二十世纪七十年代早期前去中国游历，他在《黑人书》上出版了一篇文章赞扬文化大革命的出现，在他看来，这是一场惊人的胜利。事实上，他自称去中国寻找中国革命成功的原因，而“自己的在六十年代绽放出耀眼光芒的黑人文化现在却在生命线上挣扎？”当他准备返回美国时，关于黑人革命的局限和毛主义模型的力量，他已经得到了相当的结论。首先，他认为一切成功的革命都必须是持续的——永久且延伸的。其次，文化行动主义和政治激进主义必须联合起来进行。再次，一场革命运动必须依赖自己；必须要有一个自我维持的文化学术研究。当然，黑人文化运动中多数激进的民族主义者都独立地领悟出了道理，基伦斯的文章无非是加强了这些经验教训。但中国还教会了基伦斯另一课，几乎没有男性运动活跃分子在当时注意到的：「妇女顶起半边天。」「在黑人文化运动中某些重要的、武斗的部分，黑人女性需要有喻意地‘坐在公交车后座’……这是后知后觉的、分裂的想法。许多女性徒步前去投票，她们走进妇女图书馆。然后一些兄弟们感到很沮丧和震惊。这是我们驱使他们去做的。」\n\n其他主要的对于黑人文化运动的文化民族主义的评论家，则有最终选择拥护毛主义的阿米里•巴拉卡，他自己在黑人文化运动中就是重要的角色，也是早期滥用毛主义的人物。作为 CAP 和后来的 RCL 的创立者和领导人，巴拉卡提出的不止是批判；他建立了一场运动，试着将黑人艺术运动和马克思主义-列宁主义-毛思想的思想和实践相结合。就像是他从垮掉的一代到万隆世界的遨游为他提供的对于毛泽东在美国之于黑人激进主义的见解一样，也正如巴拉卡从文化民族主义者到信仰共产主义的转变一样。在将伟大的无产阶级文化大革命带到美国的城市内部和将其改造为一种可以向黑人工人阶级叙说的方式上，巴拉卡和 RCL 比任何其他的毛主义者和反修正主义者都要来的自觉和煞费苦心。\n\n巴拉卡毕竟出身于哈勒姆的黑人艺术运动和纽瓦克的精神屋，他首先是一名文化工作者。在他和非洲人民大会从文化民族主义转变为马克思主义后，这一复杂的意识形态的转变通过文化实践上的改变证明了自身。巴拉卡谴责「黑人可鄙的中产者”是不崇尚科学和形而上学的人，他要求他的同志对抗“可能让我们重回奴隶贸易之前的黑非洲和浪漫的联邦主义的文化偏见」。CAP 把出版物的名字从《黑人纽瓦克》（_Black Newark_）改为了《团结和斗争》（_Unity and Struggle_），以此表明其从文化民族主义的观点过渡为了对于「地方对于革命的需求」的更为深刻的认识。精神屋原动力（组织的剧院班子）现在被称为是黑非洲革命原动力（Afrika Revolutionary Movers，ARM），此外，一个和精神屋有关的文化工作者团体建立了一个叫“反帝国主义歌唱家”的乐队。他们抛弃了非洲装束，以及「被认为是『非洲传统主义』一部分的大男子主义行为，比如对男性和女性实施分离的政治教育课堂。」并且，CAP 的官方节假日，被称作是「里欧•巴拉卡」（Leo Baraka），意为庆祝巴拉卡的生日，成为了完全为了诵读马克思主义-列宁主义-毛泽东思想、妇女问题和干部发展问题的日子。\n\n到了 1976 年，这一 CAP 重新以革命共产联盟现身的年份，巴拉卡自打和罗恩•卡楞加结盟已经有很长的日子了。在他的文选《艰难的事实》（_Hard Facts_）中有一首名为「今日」（_Today_）的诗，巴拉卡将文化民族主义和阶级斗争相对比的观点是不言而喻的：\n\n> _欺诈披着狼皮，包着掮客的外皮\n> 非法勾当者，有色资本主义者，尼格罗剥削者，美国黑人大使馆的博弈者\n> 他们隐匿了黑非洲大使馆的努力\n> 争取飞机票，接纳游击队，他们\n> 和党的唯一联系是弗兰基•克鲁克那样的人（似乎是指这位 DJ 在同年采访中透露的金钱和毒品问题）\n> 革命的兄弟姐妹何在？\n> 受到进步的工人阶级\n> 领导流动的流动人口何在？\n> 团结，批判的团结何在？\n> 自我批判和批判？工作和学习何在？\n> 意识形态的透明？为什么只有造作和主观的单边非理论\n> 只有描述了你那卑鄙的中产阶级的教养\n> 黑人的话语让你有机会演说，「聪明人」\n> 但绝不会带来革命_\n\n人们也许会认为《艰难的事实》是对于革命艺术的一种马克思主义-列宁主义-毛思想的宣言。而巴拉卡，一如他的前精神导师卡楞加一样，尽管目的不同，但是确实是在毛泽东经常被引用的《在延安文艺座谈会上的讲话》构建语言的。在书的引言中，巴拉卡认为革命的艺术家必须学习马列主义；为服务人民而非剥削者而进行生产工作；抛弃可鄙的中产阶级资本主义看法，向人民学习，讨教想法和经验并通过他们重现马列主义。他确信，没有哪个艺术家应该脱离社会主义奋斗而制造他/她的思想。一如毛泽东所言：「人民生活中的文学艺术的原料，经过革命艺术家和作家的创造性的劳动而形成观念形态上的为人民大众的文学艺术。」\n\n巴拉卡试着将这一宣言通过基于社区的文化工作来投入实践。其中一个 RCL 最为成功的项目就是反帝国主义文化联盟（Anti-Imperialism Cultural Union，AICU），这是一个在二十世纪七十年代末期建立于纽约的多民族文化工作者组织。在 1978 年的十一月，AICU 资助了人民文化节（Festival of People's Culture）的举办，他们吸引了超过五百人来聆听阿斯基亚•图雷（Askia Toure）、米格尔•阿尔加林（Miguel Algarin）和西尔维娅•琼斯（Sylvia Jone）的诗歌，以及 RCL 建立的名为无产者集合（Proletarian Ensemble）的乐队的音乐表演。通过无产者集合和先进工人（Advanced Workers，另一个 RCL 建立的乐队），RCL 将它的无产阶级革命和黑人自决以及其对于资本主义的批评传达给了整个纽瓦克、纽约和东海岸其他城市的社会团体和在校学生。\n\n剧院似乎是巴拉卡的黑人无产阶文化革命的主干道。在 AICU 的众多项目中，延安剧院工作室显然是投射出了毛泽东对于革命艺术的看法。延安剧院出品了许多巴拉卡的戏剧，包括表演让人印象深刻的《孤胆侠客和生产方式的关系是什么？》（_What Was the Lone Ranger's Relationship to the Means of Production?_）在 1975 年到 1976 年间，巴拉卡写了两出新戏，《历史的车轮》（_The Motion of History_）和《S-1》，用他的话说，这也许代表了他的信仰转变的最为清晰的说辞，「从可鄙的中产阶级激进主义（和其低端的中产文化民族主义）到最终领会了革命的科学，马列主义-毛泽东思想。」\n\n《历史的车轮》是长篇史诗戏剧，触及了一切可以触及的，从奴隶制到奴隶反抗、工业资本主义、民权运动和黑人权力、爱尔兰移民和白人种族主义。事实上，几乎每一个对黑人自由斗争有关的革命者或者修正主义者都有露脸，包括约翰•布朗（John Brown）、H•布朗、列宁、卡楞加、哈列特•塔布曼（Harriet Tubman）、丹麦•维西（Denmark Vesey）和奈特•特纳（Nat Turner）。通过工人在商店里或是马克思主义学习小组中讨论政治的场景，观众学习到了奴隶制的历史、工业资本主义的兴起、帝国主义、剩余价值理论、生产相对过剩和以非裔美国人及拉丁裔为主体的没日没夜的种族主义暴力。本着无产阶级文学的精神，《历史的车轮》展现了他们誓言建立起一个基于马克思主义-列宁主义-毛泽东思想上的革命的多种族、多民族的工人阶级政党的兴旺而积极的会面。\n\n《S-1》则和《历史的车轮》有很多的共同点，尽管它更多地注重于巴拉卡和 RCL 对于美国的法西斯主义的兴起的看法。这是一部有关一个马克思主义-列宁主义-毛泽东思想的团体抗争反游行示威立法的戏剧，由巴拉卡编写，戏剧是对于参议院法案《刑事司法编篡，修订和改革法案》，即《S-1》的回应。《S-1》使得政府得以采取极端的镇压手段来对付激进运动，它给予了警察和联邦调查局更大的自由去对一些激进团体进行搜查取证，并允许了在没有法庭许可的情况下对嫌疑人进行四十八小时的窃听；它还试图对特定的犯罪施行强制死刑；法案还复兴了《史密斯法案》（Smith Act），这一法案使得任何被认为是“破坏政府”的组织或个人都会受到十五年的监禁和至少十万美元的罚款。该法案最为臭名昭著的一方面是“领导暴动”的规定，这意味着法庭可以基于任何有着对“财产的巨大破坏”意图而聚集人数超过五人的任何人处以三年监禁和十万美元罚款。\n\n我们并不知道活动家和工人对于巴拉卡在这 AICU 和 RCL 极端激进的时期内的戏剧的评价，多数文化评论的态度则是它们不值一提。不管人们认为这是艺术，还是宣传鼓动，还是两者皆是，在二十世纪七十年代末期，想像一下，有一群纽瓦克城市中心的孩子们能够有机会进行促进美国革命并揭发资本主义的贪婪的表演，这是非常不凡的事情。这一切都是在那个据称没人谈论激进左派的时期，在一场名为自我革命的风暴中心发生的。（事实上，里根在 1980 年的当选就被引述为是政治上缺乏左派挑战的证据，同样地，这也是 1980 年到 1985 年间美国的马克思主义党派短暂复兴的原因）\n\n# 告别毛主席，党派终结？\n\n基于你的政治立场和政治派别，你可以很简单地总结出，随着毛泽东于 1976 年逝世，美国的毛主义也消亡了。但要说毛主义在某种程度上夭折了，那也是过度夸大的表述。毛主义组织在美国依旧存在。毛主义国际运动（Maoist International Movement）维护着一个网站，进步劳动党（尽管时至今日他们很难再被称为是「毛主义」了）和 RCP 依旧无处不在。事实上，一些证据表明 RCP 在帮助起草血帮和瘸子帮（Bloods and Crips）的后洛杉矶反抗宣言中扮演了重要角色，「给我们锤子和钉子，我们将重建这座城市。」之前的 CLP，即现在的革命者联盟（League of Revolutionaries），在芝加哥有着很多信徒，包括了长期以来的激进分子杰纳勒尔•贝克和阿卜杜•阿尔卡利马。更重要的是，即便我们承认他们的人数从七十年代中期开始就在不断减少，活动家们，即便他们的策略和战术被证明是无意义的或者方向错误的，他们依旧置身于运动中。任何了解政治的人都知道 1984 年杰西•杰克逊的总统竞选在毛主义者率领的彩虹联盟的支持下势头凶猛，各色毛主义组织都在黑人独立政党会议（Black Independent Political Party）上出席。换句话说，由于如此之多的美国自由派要么是以行动，要么是通过保持缄默，来极力抗拒穷困的黑人和平权运动，一些自诩的革命者依旧期盼能通过“移山”来造福黑人民众。最悲剧，也是最英雄主义的例子来自北卡罗来纳的格林斯郡，五名共产主义工人党（前工人观点组织，即 Workers Viewpoint Organization）在 1979 年十一月三日在反三K党游行示威期间被三K党和纳粹分子谋杀。\n\n![CR-309.jpg (1200x759)](data/img/post_3_CR-309.jpg)\n\n然而，事实是黑人毛主义的鼎盛时期已经过去了。理由有很多，和整个黑人激进主义的衰弱有关、宗派政治自毁的本性还有中国对非洲和第三世界毁灭性的外交政策。此外，多数我们的故事中自称是毛主义者的人们——至少最最为诚实的人们——很可能都在对杜波依斯、法农、马尔科姆、格瓦拉和克鲁斯欠了一笔知识的债务。但毛泽东和文革给黑人激进政治留下的是不可磨灭的印记——这一印记的影响，我们在文章中也只是浅尝辄止。当一群不结盟国家试图要挑战冷战政治所定下的政治二分法时，当非洲民族主义者试着为后殖民主义的未来制定计划时，当菲德尔•卡斯特罗和一众疲惫不堪的武装分子完成不可能的任务时，当南方的午餐柜台和北方的贫民窟成为新革命的剧场时，他们都支持着中国——这个世界上最强大的「有色」国家。\n\n毛泽东的中国，同古巴革命和非洲民族主义一道，以复杂的方式国际化了黑人革命。毛给予了黑人激进分子一个非西方的马克思主义模型：更注重地方情况和历史情况，而不是公认的标准。中国的大跃进挑战了进入社会主义必须耐心地等待合适的客观物质条件允许才能实现的说法。对许多以学生为基础的社会民主派的年轻激进分子们来说，在种族主义政治、女性主义和所有的那些「对于自觉的唤醒」上，毛主义风格批判/自我批判都是中产阶级资本主义民主的有力替代品。但对自觉的唤醒远不是宣传工作那么简单的；这是在革命实践背景下的一项智力劳动。“一切真知都是从直接经验发源的。”毛泽东在他广为阅读的文章《论实践》（1937）中这样说道。知识来源于地方实践和理论的思想让激进分子能够去质疑那些通常对贫困和种族主义的源头满口胡诌却少受质疑的社会学、心理学和经济学精英们。由此，在这个自由派的技术统治论时期，毛主义者——从黑人激进圈子到女性解放运动——都在试着扭转中产阶级资本主义的精英观念。他们进行分析；讨论；并出版杂志、报纸、意见书、小册子甚至是书籍，尽管他们之间很少达成一致，他们都将自己视作知识的生产者。他们相信，一如毛泽东所言「这些思想会变成改造社会、改造世界的物质力量。」\n\n然而，仅有思想是不能改造世界的。有意愿和力量去改变世界还要求不仅仅是正确的分析和直接的参与：人们还需要信念和意志。在这方面，毛主义者和一些非常老派的黑人圣经传统是共通的。要知道，如果大卫可以用一支弹弓打倒哥利亚，那么同样地，「星星之火可以燎原」。"
		}
	]
}