{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1613867258,
			"title": "KIlka pytan na temat KoronaDebilizmu",
			"body": "34 PYTANIA DLA WIERZĄCYCH W PANDEMIĘ”\n 1. Dlaczego nie słyszymy syren pojazdów ratowniczych bez przerwy w dzień iw nocy?\n 2. Dlaczego domy pogrzebowe nie są tak zajęte jak w poprzednich latach?\n 3. Dlaczego na cmentarzach nie widzimy niekończących się rzędów ludzi grzebujących bliskich?\n 4. Dlaczego statystyki mówią, że śmiertelność nie wzrosła w 2020 roku?\n 5. Gdzie poszły zgony na grypę?\n 6. Jeśli pierwsza blokada zadziałała, po co ją powtarzać?\n 7. Jeśli blokady nie działają, dlaczego je powtarzamy?\n 8. Dlaczego rząd słucha tylko bardzo małej grupy tych samych ekspertów, a nie uznanych głosów znawców nauki?\n 9. Dlaczego w telewizji widzimy przepełnione oddziały intensywnej terapii, skoro w rzeczywistości nie są one przepełnione?\n 10. Dlaczego wyszkolone pielęgniarki nie mają pracy i dlaczego przychodnie są zamykane z powodu niepełnego wykorzystania?\n 11. Dlaczego rządy na całym świecie zamówiły test PCR w 2018 roku?\n 12. Jeśli maski są skażone wysoce zaraźliwym wirusem, dlaczego widzimy je na każdym rogu ulicy?\n 13. Dlaczego w poszczególnych krajach obowiązują różne zasady dotyczące odległości?\n 14. Jeśli wirus nie jest przenoszony przez dzieci, dlaczego szkoły są zamknięte?\n 15. Jeśli maski działają, dlaczego nie używamy ich od lat przeciwko grypie?\n 16. Dlaczego nie widzimy, jak ludzie umierają na ulicy?\n 17. Dlaczego duże sklepy spożywcze są otwarte, a setki osób robi zakupy w tym samym czasie, podczas gdy małe sklepy w centrum miasta, które mogą pomieścić tylko dwie lub trzy osoby, są zamknięte?\n 18. Dlaczego osoby, które uzyskały wynik pozytywny w teście PCR, nazywają się „przypadkami koronowymi”, a nie tylko ci, którzy uzyskali wynik pozytywny.\n 19. Dlaczego zapominasz poinformować ludzi, że WHO przyznała, że ​​test PCR nie jest miarodajny?\n 20. Jeśli kichnięcie może sięgać nawet dwóch metrów, dlaczego zachowujemy odległość półtora metra?\n 21. Dlaczego można dezynfekować ręce dziesięć razy dziennie, jeśli powoduje to znaczne uszkodzenie skóry?\n 22. Dlaczego potrzebujemy eksperymentalnej szczepionki przeciwko wirusowi z 99,9% współczynnikiem przeżycia?\n 23. Jeśli szczepionka działa, dlaczego nadal możesz przenosić wirusa?\n 24. Jeśli jesteś zaszczepiony, dlaczego nadal musisz nosić maskę i zachowywać dystans?\n 25. Ile znasz osobiście osób, które zmarły na koronę, ile znasz, którzy cierpią z powodu uszkodzeń spowodowanych szczepieniami?\n 26. Dlaczego wartość częstotliwości jest używana jako punkt odniesienia, skoro jest zmieniana całkowicie arbitralnie?\n 27. Dlaczego nic nie jest publikowane na temat tysięcy uszkodzeń spowodowanych szczepieniami i zgonów?\n 28. Dlaczego istnieje komisja odpowiedzialna za szkody spowodowane szczepieniami?\n 29. Dlaczego nie wszystko jest całkowicie zamknięte, skoro wirus jest tak śmiertelny i może być przenoszony przez każdego?\n 30. Dlaczego możemy żyć na wolności z tysiącami wirusów, ale nie z koronawirusem?\n 31. Dlaczego w niektórych krajach (Tanzania, Białoruś, Szwecja) środki są niewielkie lub nie ma ich wcale i dlaczego nie umiera tam więcej ludzi?\n 32. Dlaczego musisz być testowany 20-centymetrowymi wacikami przed mózgiem, kiedy rozpylona ślina jest tak zaraźliwa?\n 33. Jeśli wirus jest śmiertelny, dlaczego około połowa może go mieć, a druga połowa nie?;\n 34. Dlaczego osoby, które zostały zaszczepione, umierają tylko z powodu wcześniejszych chorób?",
			"added": 1613867257
		},
		{
			"topic_id": 1624109559,
			"title": "UK pelne martwych pilotow.",
			"body": "Po szczepionkach na vidavida 4 pilotow odeszloz tego swiata. Tutaj macie info z BA: https://twitter.com/British_Airways/status/1405606519631007748?s=20\n\nNastpenie rzeka info o innych przypadkach: https://twitter.com/GaarmP/status/1405616637865234442/photo/1\n\nOczywiscie BA juz naparza z rzadem Borisa zeby to wszystko nie wyszlo na jaw wiec temat zastepczy:\nhttps://news.sky.com/story/british-airways-plane-damaged-after-it-tips-onto-its-nose-at-heathrow-airport-12335610\n\nDopinajcie wiecej jak macie.",
			"added": 1624109557
		}
	],
	"topic_vote": {
		"1624109559_1JaCh1fv2Bhik1mTnzXWaNknaWvTewPAx7": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1613302394_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Ogolnie jedno wielkie gowno. Najlatwiej bylo by zrobic liste tych decydentow i do wora z nimi. Potem wywalic \"pseudo\" rzad i postawic wigwam.",
				"added": 1613509551
			}
		],
		"1614797718_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 2,
				"body": "Jesli chodzi tobie o krypto to juz dzisiaj mozna smialo zyc bez bankow. DeFi pozwala na trzymanie krypto w postaci stable coins(dai/usdt/busd/usdc/xusd) i zarabianie na nich w odpowiednich miejsciach. \n\nWydawanie jak i zarabianie tez nie jest problemem. Banki to wiedza wiec lrobuja pchac swoja agende i banowac albo utrudniac wszystko co z krypto powiazane. \n\nWezmy takie DeFi ktore pozwala zarabiac na porzyczaniu swojego krypto. Wszystko z poziomu swojego portfela i z wlasnymi kluczami prywatnymi. Dzisiaj na usdc/dai mozna smialo wyciagnac 8% bez jakiegokolwiek trudu. \n\nWyplata na zasadzie LP tokenow a cala reszta to jak bylo juz to dawno. \nDo tego dochodzi chowanie/ukrywanie wlasnosci w postaci Xusd(haven) i nikt nie bedzie wstanie udowdnic ze masz gdzie kolwiek jakies krypto. \n\nJak wiadomo blockchain to taki notatnik gdzie wszystko jest czytelne i odrobina pracy pozwoli na sutalenie gdzie sie waluta znajduje. Powyzej projekt pozwala na kompletny brak kontroli. \"Grade Monero\" pozwala zapewnic ze nikt i nic nie jest w stanie udowdnic gdzie fundusze i w jakiej ilosci sie znajduja. \n\nPrfzyszlosc nie jest taka straszna.",
				"added": 1614802970
			},
			{
				"comment_id": 3,
				"body": "> [klempa](#comment_14_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC): A brak prądu ?A awaria interneciku ?A rozładowany smartfonik? [...]\n\nSpokojnie. Juz tearaz mozna sie bawic krypto bez internetu. Juz teraz masz starlink gdzie wystawaisz antene i nawet na pustyni masz internet. Mesh takze dziala. To co podales to jakies extremy. Jesli by tak bylo co napisales to kazdy jeden systme dzisiejszego swiata byly jak to siara powiedzial kiedys DED. \n\nA co do Haven to sie mylisz bardzo. Widze ze trolujesz na 1100 level. Po co wogole odpowiadzasz na temat jak juz masz wszystkie problemy na tacy? Skoro uwazasz ze brak pradu jest problemem, skoro uwazasz ze brak internetu jest problemem, albo rozladowany telefon, potem producent win/linux/android/ios tez jest problemem, a na koncu sprzet lub producent procesora jest beee. To najlepiej bedzie jak skasujesz sobie wszystko z hdd , wywalisz telefon, i wywalisz caly sprzet jaki masz w hacie to wtedy napewno bedzie lepiej. Pewnie jestes ten typ co na wszystko choruje i widzi wszystko w szaryuch kolorach?\n\nProponuje troche wiecej optymizmu. Ja wszystko napisalem co mialem napisac. Kto chce to se wyszuka na kazdy jeden poruszomny temat wiedze. A trollo lololo dziekuje. Szkoda czasu na was.",
				"added": 1614893956
			},
			{
				"comment_id": 4,
				"body": "> [driud](#comment_247_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Kto tutaj tak naprawdę Troluje???  \n\nO czym to piszesz? Widze ze masz duzo do poczytania. Jaka piramida? Nie pisal by o tym gdybym tak nie zyl juz od dobrych kilku lat bez udzialu bankow. \nJest 2021 i czas dinozaurow minely. Skoro nie masz wiedzy na jakis temat nie bombarduj odrazu tematu. \nJak czytam o piramidach, jak czytam o betonach nierozumiejacych jak cos dziala ale wypowiadaja sie jak by byli expertami to mnie smiech ogarnia. \n\nJesli uwazasz ze to co napisalem to bzdury albo niebezpieczne i niepowazne podejscie, poczekaj na CBDC z bankow centralnych. Zobaczymy co wtedy napiszesz.\n\nWedlug ciebie krypto jest 100% kontrolowane i ja moge smialo powiedziec ze nie masz pojecia o czym piszesz. \nNiby chcecie pomoc a jednak pchacie w jakies zloto,srebor czy inne muszelki a konkretne wyjscia z sytuacji dyskredujecie tylko z powodu braku zorzumienia tematu. \n\nWez poczytaj, zainteresuj sie i nie powtarzaj bzdet z onetu czy innych pudelkow. Bo juz dzisiaj jest wiele firm ktore dzialaja w 100% w krypto. I jakos to idzie. Pracownicy dostaja wyplaty w krypto. I jakos to dziala. No ale wedlug ciebie to piramida.",
				"added": 1615329861
			}
		],
		"1623792988_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 5,
				"body": "meh.",
				"added": 1623873563
			}
		],
		"1625871045_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 6,
				"body": "lista jest. potrzeba kogos silnego i heja z nimi. Jak kilka sie zamknie z powodu covid-19 to bedzie git. Moze tez tak maly pozarek, albo sprej na scianie?\n\nIn-vivo\n\n85-048 Bydgoszcz. NIP 9671397087, KRS 0000693760. Badania kliniczne Piotr Piasecki - dyrektor ośrodka telefon: +48 501 109 918 mail: piotr.piasecki@in-vivo.pl Katarzyna Cisewska - koordynator ośrodka badań klinicznych telefon: +48 668 328 045 mail: katarzyna.cisewska@in-vivo.pl. Pacjenci (wizyty prywatne) RECEPCJA telefon: +48 691 307 193 mail: kontakt@in-vivo.pl.\n\nJCI:\n\nCentrum Badań Klinicznych JCI\n\nJagiellońskie Centrum Innowacji Sp. z o.o.\nLife Science Park, budynek C\nul. Bobrzyńskiego 14\n30 - 348 Kraków\nT: +48 12 340 24 02\nK: +48 512 047 678\nE-mail: cbk@jci.pl\n\n\n AppleTreeClinics\nul. ks. bp. Wincentego Tymienieckiego 20, 90-349 - Łódź\t\nTELEFON:\n426638932\n\nGravita:\n\n Gravita\n\n(+48) 42 651 90 10\noffice@gravita.info.pl\nKniaziewicza 20a\nŁódź 91-347",
				"added": 1626125074
			}
		]
	},
	"comment_vote": {
		"9_1JBU6gqPYoNmpeTw9JMurELPAFxCQ3CsmC": 1,
		"51_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"2_1JaCh1fv2Bhik1mTnzXWaNknaWvTewPAx7": 1
	}
}