{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1557652782,
			"title": "Files failing to update for common sites",
			"body": "Is anyone else getting this? Between 1 and 9 files will fail for a number of sites: ZeroUP, ZeroMail, Git Center, ZeroTalk, etc.",
			"added": 1557652781
		}
	],
	"topic_vote": {
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1557931963_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"1564432849_18mRDDhmboxDUDkecw7Vo87J6FPvDHoryc": 1,
		"1567466763_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1,
		"1578439030_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 26,
	"comment": {
		"1557618716_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 1,
				"body": "Credit where credit's due... Steven Crowder",
				"added": 1557696423
			}
		],
		"1557064345_1GqfwGz2U6QVTSE4LxuudaJcnap92nPzHY": [
			{
				"comment_id": 2,
				"body": "It's possible that when your PC broke, it wasn't the hard drive that broke, in which case you can plug the hard drive into your new PC and recover the relevant file. If you still have your PC, check if the hard drive is working.",
				"added": 1557705356
			}
		],
		"1557105928_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 3,
				"body": "I also like the story on that site titled \"Trump Takes DNA Enhancement Used By Satanic Elites! This Is 'Mark Of The Beast' Technology!\"  LOL",
				"added": 1557707105
			}
		],
		"1557808432_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 4,
				"body": "Will it just switch our codebase to the py3 branch? Will this work on all platforms? Will zites break? Are the peers different? Will we lose data?",
				"added": 1557810600
			}
		],
		"1557536353_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "> [atomiserxenolith](#comment_75_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): It's a problem because centralizing power diminishes freedom.\n\nI know it's cliché, but...\n\"Power tends to corrupt, and absolute power corrupts absolutely.\" - Lord Acton",
				"added": 1557810910
			},
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_302_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): If there is a problem with globalism, it is the imperialist US not wanting the rest of the world to share in the resources they have hoarded. There can't be huge differentials of wealth and living conditions in a global society.\n\nHow is it then that there are Americans who are against globalism? Is it for the good of other countries or a different reason?\n\nHow is the USA imperialist?\n\nI don't think global wealth disparity is something we should actively avoid.",
				"added": 1557868878
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "I believe that no matter how bad things get, people will always overcome, because it is in their self interest. Even when they deny reality to themselves, some part of them realizes the truth when faced with impending doom, which is needed for them to act rationally and thus survive. While not everyone may survive, an amount will.",
				"added": 1557869591
			}
		],
		"1557880052_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": [
			{
				"comment_id": 8,
				"body": "I can't get it to load, unfortunately.",
				"added": 1557887142
			}
		],
		"1557931963_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": [
			{
				"comment_id": 9,
				"body": "> [duck0](#comment_67_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): This is a fully functional Linux distribution? Does it utilize systemd or what is the general working environment?  [...]\n\nIt looks like it's not based on another OS or something. From the website it says:\n\"Can't decide which Linux distribution you prefer? Still need that one Windows program for work? With Qubes, you're not limited to just one OS. Learn more\"\n\nHard to tell based on their GitHub...",
				"added": 1558009879
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 10,
				"body": "I think GIFs are bad... they take up so much space and take a long time, even with bigger networks, to download. Allowing videos instead of GIFs would be a good move I think. I think Imgur implemented something like this to cut down on GIF sizes.",
				"added": 1558011338
			},
			{
				"comment_id": 12,
				"body": "@klu9 I was thinking that perhaps banning would be useful. On another note, they would also be downvoted more if they take forever to load for people, getting down-ranked, and filesizes could be shown before opting to download (when implemented). So while I think banning is an option, there are others, too.",
				"added": 1558030178
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 11,
				"body": "> [blazingeye](#comment_19_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Christianity is judaism sect. There is no much difference between christianity and judaism (jews religion). The main book of christianity is even torah (aka old testament).\n\nI think the Christian focus on Jesus makes for a pretty important difference, along with the New Testament.",
				"added": 1558012947
			}
		],
		"1558041340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 13,
				"body": "Jews antagonized them in the same way rape victims antagonized rapists, right?",
				"added": 1558049088
			},
			{
				"comment_id": 14,
				"body": "@h3bhkj5gqz4n3pjm Being uncivilized and poor is natural. This does not mean that being uncivilized is good or justified.",
				"added": 1558052356
			},
			{
				"comment_id": 16,
				"body": "> [blazingeye](#comment_22_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Another funny fact: christains fight each other, as well as jews, muslims, etc. There is no even need to call it different and change a bit.\n\nAtheists fight each other. This is no insight.",
				"added": 1558089105
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 15,
				"body": "> [nickwa](#comment_130_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Bad and good are perspectives. There is no such thing as good or bad. I can say your good, someone can say it is bad, but what constitutes as good or bad? Society? Whoever answers this is already putting in their perspective, and not grounded in truth.\n\nWell, there's such a thing as ethical philosophy, which I doubt you have training in. But hey, whatever floats your boat.",
				"added": 1558070585
			},
			{
				"comment_id": 17,
				"body": "> [nickwa](#comment_134_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): So no counter to my claim? Also, your \"training\" does not make you more smart than somebody else. If you mean college, then I have news for you: Your Education Does Not Make You Smart https://youtu.be/iZWHOLnZKAw\n\nIf you are implying that you are more smart than I, that would be an ad hominem, which is not an argument. It was unfair of me, though to comment as I did, because I know there is a section of philosophy dedicated to such ideas, one which is surprisingly popular among intellectuals. After all, how can our eyes be real, if mirrors aren't real?",
				"added": 1558089332
			}
		],
		"1558266064_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": [
			{
				"comment_id": 18,
				"body": "I think one problem with it is how users have to manage their space. Typically, sites are downloaded and stored temporarily, but with ZeroNet it's permanent unless you say otherwise for that specific site. Default options are notoriously popular among typical users, so we can't really say, \"they should just delete zites they don't use durr,\" because I think we all know they won't.",
				"added": 1558306625
			},
			{
				"comment_id": 19,
				"body": "> [insurgo](#comment_20_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): From what I get, an optional file you downloaded will be shared as the zite, by default. Most of the platforms ...\n\n> [styromaniac@kxoid.bit](#comment_44_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Optional files are automatically managed. Pin what you need.\n\nI understand how it works. I am sitting at 600-700 MB with no optional files and deleting zites I don't want to share. Now imagine if a whole bunch of people got on this net, and there was all that content. My comments are basically addressed on behalf of the noobs, who would flood this place if it got more popular. It seems to me, based the way it is designed, it is still in development to some degree. It can't scale. If I am a company planning for the future, why would I develop an app for a network that can't scale?\n\nedit: I looked at my stats, only 250 MB from zites according to stats page, the rest is something else...",
				"added": 1558362171
			}
		],
		"1558529155_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 20,
				"body": "Why does it need to stop? I'm sure we all prefer that certain things not be said, but in what way do we need that? It seems like a necessary trade-off; spend a bit of time blocking people in exchange for free use of the platform. If you want it so badly, maybe you should come up with the great idea yourself.",
				"added": 1558540680
			}
		],
		"1558615472_1Hm7PoX61WaiT2txsZJLSiG5guAJr3SHhV": [
			{
				"comment_id": 21,
				"body": "I looked it up, and I saw one that links to ZeroNet: http://127.0.0.1:43110/17SWVnHoujG92yYGSZvCzPgZEpGVfRF8wi\n\nI have no idea whether it is trustworthy, but that's the URL that f2ko has linked to. The zite requires more data than a typical zite, so you'll have to allow it in order to use it.",
				"added": 1558625912
			}
		],
		"1559028625_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 22,
				"body": "If you use a video editing software or video conversion software, chances are, it's using `ffmpeg` in the background. I recommend HandBrake for converting videos, available on all platforms.",
				"added": 1559045244
			}
		],
		"1559069408_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY": [
			{
				"comment_id": 23,
				"body": "> [sypperpit](#comment_5_1KcivDv72kAwXmY2Pqm3NbyzHWUgG835C8): may create local network like hamachi ?\n\nHe means a way of staying anonymous online. Besides, ZeroTier is better than Hamachi for network tunneling.",
				"added": 1559130206
			},
			{
				"comment_id": 24,
				"body": "> [purplebarndoor](#comment_3_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY): @kropptyler https://www.zerotier.com I read it over and it looks good, the code is open source, but I worry about registering my network on their site, to create the encrypted WAN for all devices. Have you used ZeroTier before?\n\nI use it frequently for gaming. I can't say anything about how they run their servers, but I only use it for low-risk stuff anyhow.",
				"added": 1559364215
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 25,
				"body": "In what way is it out of hand?",
				"added": 1562533794
			}
		]
	},
	"comment_vote": {
		"4_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"236_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2_1KDopZdzm9GLunEmGTZzdhfHBauzzV1uo1": 1,
		"51_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"4_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1
	}
}