{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1,
			"title": "По поводу децентрализованной SQL-базы ZeroNet",
			"body": "Если я правильно понимаю, то у каждого сайта есть свой файл базы.\n\nВопрос в том, что если, к примеру, этот форум перерастёт за 1000 пользователей, а сообщения перерастут за несколько миллионов, то этот файл будет у всех локально храниться. Он может весить гигабайты. При этом я не знаю по каким алгоритмам работает эта база, но если это что-то типа SQLite, то такие объёмы будут жестко жрать ресурсы компа при выборке информации из базы и прочих манипуляциях.\n\nПо сути, ZeroNet потащит только небольшие веб-приложения? Серьёзные сервисы в таком контексте реализовать не получится?\n\nХотелось бы прояснить этот момент.",
			"added": 1584209862
		},
		{
			"topic_id": 1584288639,
			"title": "Так чисто момент по поводу сортировки комментариев в этих конференциях",
			"body": "Мне крайне неудобно, что комментарии идут от новых к старым. Т. е. по сути - я хочу увидеть начало диалога, от чего началась суть вопроса. Вместо этого я вижу ответы и просто не понимаю о чём они, потому, что тема начинается на несколько страниц ниже. Если тема бурно обсуждаемая, то, чтобы понять смысл, мне нужно пролистать до самого конца, чтобы найти начало мысли человека. Предпочитаю читать не в обратном, а в прямом хронологическом порядке. Чтобы понять откуда пошло обсуждение и к чему оно пришло, а не как сейчас - от следствия к причине.\n\nКнопки переключения сортировки я не вижу. Понимаю, что динамическую функцию сортировки, ввиду особенностей ZeroNet API, сделать немного сложнее, но можно так-то делать сортировку блоков сообщений по дате публикации на-лету посредством JavaScript.\n\nМне прямо попо-боль доставляет данная ситуация.",
			"added": 1584288637
		},
		{
			"topic_id": 1584457808,
			"title": "База знаний ZeroNet",
			"body": "Создаётся knowledge base для русскоязычных пользователей.\nПредлагаю администраторам форума прилепить эту тему, чтобы не сваливалась вниз.\n\nЗайт будет не в формате wiki, а просто static HTML с категориями и разделами по всем вопросам. Может быть в дальнейшем будет поисковая система по сгенереному индексу, но пока не планирую.\n\nПользователям предлагаю присылать сюда вопросы и ответы, ссылки и всякое такое по вопросам ZeroNet. Можно делиться и англоязычными ссылками по интересным вопросам. Будем переводить.\n\nПрошу не писать малозначительные сообщения, не засорять тему и вопросы задавать развёрнуто а не вида \"почему так, я ваще не понял\".",
			"added": 1584457805
		},
		{
			"topic_id": 1584458801,
			"title": "Как мне сделать PR в Ru-ZeroTalk V2",
			"body": "Как мне сделать PR в Ru-ZeroTalk V2, чтобы сделать .topic-sticky сворачиваемыми и разворачиваемыми и никто не ныл про большие прилепленные темы сверху и всякое такое?",
			"added": 1584458797
		},
		{
			"topic_id": 1584548291,
			"title": "Надо ли раздавать сайты, которые не нужны лично тебе?",
			"body": "Я полазил тут по ZeroSites и нашел много просто не нужного мне. Нашел и какой-то заброшенный The Pirate Bay с запрещённой литературой типа Майн Камфа А. Гитлера и Поваренную книгу анархиста, которая считается экстремистской. Да пофигу. Запрещённый контент или нет. Просто полазил по зайтам. Видел просьбы типа \"Помогите раздавать этот контент\" и всякое такое.\n\nС одной стороны, я понимаю, что места у меня ещё пара терабайт и исходящий у меня безлимитный Гигабит. Могу раздавать что угодно в любых объёмах. Просто вот не знаю... Надо мне им помогать? Это помогает сообществу в целом? Это полезно? Мне хостить у себя весь \"мусор\", который для меня бесполезная хрень?\n\nА как вы к этому относитесь?",
			"added": 1584548286
		},
		{
			"topic_id": 1584552124,
			"title": "Кто и откуда?",
			"body": "Не, деанонимизировать не хочу. Просто мне хочется узнать у людей какой у них часовой пояс, чтобы понять когда они общаются. У меня GMT+7.",
			"added": 1584552118
		},
		{
			"topic_id": 1584632781,
			"title": "А надо ли пиарить?",
			"body": "Вот я про ZeroNet вообще молчу и никому не говорю. А надо или нет? Вот начну пиарить и понаедет долбойобов отовсюду. Может нахер? Или надо пиарить? У меня есть некоторые каналы, я сюда человек 50 может затащить могу. Только нахер они нужны? Из них полезных будет пара человек, остальные просто обыватели, которым интересно, что тут какой-то свой интернет и можно запрещёнку найти или размещать.\n\nТут не хватает людей для генерации контента. Чтобы была большая инфраструктура и всякое такое. Но и всяких оленей не хочется сюда звать. Там какой-то у Балансера в талке бегает русскиесосут или типа того. Придурок - во всех темах пишет, чтобы русские сосали и ебались в жопу. Дебил. Но нам люди таки нужны, только адекватные. И вот не понять как пиарить ZeroNet. Дебилы же подкатят сюда.",
			"added": 1584632774
		},
		{
			"topic_id": 1585382861,
			"title": "Всех ВВшников с прошедшим!",
			"body": "Поздравляю всех, кто служил в ВВ и ветеранов чеченских войн. Я так как вчера не бухал уже давно. Даже свадьбы скромнее. Айе!",
			"added": 1585382853
		},
		{
			"topic_id": 1586628993,
			"title": "Человек не согласен. Все мудаки. Какую ему децентрализацию надо?",
			"body": "here is \"decentralized\" ecosystem without \"single point of failture\", which can not exist without some fucking servers running trackers (operate by WHO ???) which collect and log all info about users of this \"system\"\n\nARE YOU FUCKING SERIOUS?\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL",
			"added": 1586628984
		},
		{
			"topic_id": 1587837330,
			"title": "Петра Баталова прижимают к ногтю за критику власти",
			"body": "Подробности тут:\nhttps://www.youtube.com/watch?v=Zp_xQg_HReU\n\nЯ его не защищаю, не пропагандирую, да и вообще не хочу что-то там такое особенное сказать. Просто оставлю это тут.\nДумайте сами, решайте сами, иметь или не иметь (с)",
			"added": 1587837320
		},
		{
			"topic_id": 1590655214,
			"title": "Как создаётся новая история Украины",
			"body": "История, краеугольным камнем которой является русофобия и всякого рода \"ненависть к москалям\".\n\nhttps://www.youtube.com/watch?v=pp1vb2J9qds\n\nТеперь понятно, почему с многими молодыми украинцами невозможно разговаривать. Они повторяют свои заученные мантры и если у тебя другое мнение, то ты просто свинья. Аргументации, конечно, никакой, просто, если ты не согласен, значит ты мудак. Им же со школы вгружают альтернативную историю. Параллельная реальность как она есть.",
			"added": 1590655203
		},
		{
			"topic_id": 1590855043,
			"title": "У нас есть пользователь jk7 - шизофреник",
			"body": "Человек не отвечает ни на один пост. Ничего полезного не пишет. Вообще адекватно ни на что не реагирует. Никакого диалога или аргументации с ним невозможно провести.\nОн не отвечает адекватно на обсуждения и не может ничего сказать.\nВсе его посты: - Кругом менты. Кругом пиздец. Кругом всех обули и обманули. Все мудаки, кто против Украины. Везде предатели и ментовские твари.\nЧто происходит? Да ничего не происходит. У нас просто прикольный шизик появился.",
			"added": 1590855031
		}
	],
	"topic_vote": {
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": 1,
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"1584714965_16yCk4uqPmSvaqoZoFJhvBgyaRWMeVe7Sv": 1,
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1584929162_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1584987798_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1584452427_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"1584283661_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1585191373_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1585680407_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1585691293_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": 1,
		"1587107391_15zutMkc1LGBS6ntJdYxyYkXbnM7t3BJ43": 1,
		"1588557585_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1590837476_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N": 1,
		"1590350740_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": 1,
		"1590598686_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": 1,
		"1590353253_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": 1,
		"1590352777_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": 1,
		"1589484353_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": 1,
		"1589998528_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1588766031_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": 1,
		"1589810453_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"1589887638_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"1589897543_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"1589801857_1NmPc7YPtwCotNPJt7CXcHmcEP6s37L18z": 1,
		"1587408020_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1589026483_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"1590978173_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1591016723_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": 1,
		"1591279603_1B6Dst2LKNmG3yPZXnXc73c3qgiJzmLVNW": 1,
		"1594730531_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv": 1,
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"1611429057_12Lwi45PLwYpZHFJ2NdQNE1G1PeraTopV7": 1,
		"1612183359_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"1612635629_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1
	},
	"next_comment_id": 162,
	"comment": {
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": [
			{
				"comment_id": 1,
				"body": "Приветствую! Тоже вот только сегодня поставил. Знал довольно давно, просто читал статьи, но как-то попробовать только сегодня руки дошли. Теперь хочу попробовать написать какой-нибудь русскоязычный сайт в ZeroNet. Опять же, не знаю когда дойдут руки.",
				"added": 1584183084
			}
		],
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 2,
				"body": "Mint 18.3 (Ubuntu 16.04):\nCryptBitcoin:\n- hdPrivatekey x 10..........0.085s [x8.21: Insane!!]\n- sign x 10..........0.116s [x3.01: WOW]\n- btctools verify x 100..........0.794s [x0.47: Ehh]\n+ Loaded lib: <CDLL '../runtime/lib/libcrypto.so.1.1', handle 56186afe3420 at 0x7fca1027a438>\n- openssl verify x 100..........0.060s [x6.16: Insane!!]\n+ Loaded lib: CompiledLib\n- libsecp256k1 verify x 100..........0.019s [x19.12: Insane!!]\n\nCryptHash:\n- sha256 5M x 10..........0.128s [x4.70: Insane!!]\n- sha512 5M x 10..........0.083s [x7.27: Insane!!]\n- os.urandom(256) x 1000..........0.020s [x0.33: Ehh]\n\nMsgpack: (version: 0.6.1)\n- pack 5K x 10 000..........0.017s [x46.41: Insane!!]\n- unpack 5K x 10 000..........0.032s [x37.69: Insane!!]\n- streaming unpack 5K x 10 000 (fallback: True)..........0.227s [x6.18: Insane!!]\n- streaming unpack 5K x 10 000 (fallback: False)..........0.019s [x73.29: Insane!!]\n\nDb: (version: 3.29.0, API: 2.6.0)\n- Open x 10..........0.323s [x0.40: Ehh]\n- Insert x 10 x 1000..........0.207s [x4.82: Insane!!]\n- Buffered insert x 100 x 100..........0.243s [x5.36: Insane!!]\n+ Total rows in db: 20000\n- Indexed query x 1000..........0.043s [x5.76: Insane!!]\n- Not indexed query x 100..........0.094s [x6.38: Insane!!]\n- Like query x 100..........0.214s [x8.40: Insane!!]\n\nCompression:\n- Zip pack x 10..........0.081s [x1.48: Fine]\n- Zip unpack x 10..........0.072s [x2.77: WOW]\n- Tar.gz pack x 10..........0.086s [x3.50: Insane!!]\n- Tar.gz unpack (1.55kB) x 10..........0.073s [x2.73: WOW]\n- Tar.bz2 pack x 10..........0.829s [x2.41: Fast]\n- Tar.bz2 unpack (0.53kB) x 10..........0.200s [x2.50: Fast]\n- Tar.xz pack x 10..........0.216s [x6.47: Insane!!]\n- Tar.xz unpack (0.67kB) x 10..........0.066s [x3.02: WOW]\n\nDone. Total: 4.88s\nBenchmarking ZeroNet 0.7.1 (rev4206) Python 3.7.3 (default, Mar 27 2019, 22:11:17) \n[GCC 7.3.0] on: linux...",
				"added": 1584209523
			}
		],
		"1_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_253_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Уже давно:\n> $ ls 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n> 6006\n> \n> До миллиона еще далеко:\n> $ grep -r '\"body\":' 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n> 59105\n> \n> Это она и есть. Надо решать проблемы по мере их появления. Пока еще SQLite тянет нагрузку.\n> \n> Надо просто не класть все яйца в одну корзину. Вместо 50 подразделов на крупном форуме, в ZeroNet можно сделать просто 50 форумов.\n\nСпасибо за ответ. Всё понятно.\n\nЯ имел ввиду 1000 активных пользователей, а не просто зарегистрированных. У меня на форуме 5902 пользователя, только из них постоянно общается только около 20 человек.\n\nПро \"все яйца в одну корзину\" - форум был приведён просто как пример. В самом сообщении я пишу вообще о некоем абстрактном сервисе.\n\nЧто касается решения проблем по мере их поступления, то в какой-то мере я с вами согласен, но в разработке далеко не всегда такой подход полезен. Желательно изначально продумывать архитектуру с запасом масштабируемости. Ибо, в противном случае, оказывается, что разработчик создавал проект \"да ладно, там разберёмся, пока и так нормально\" и проект начинает обрастать костылями и велосипедами. Что в итоге приводит к тому, что дальнейшая разработка и управление становится лютым геморроем и лучше убить кучу времени, но переписать всё с ноля. А можно было бы избежать этой ситуации. Я как бы не критикую, посмотрим как оно дальше, но просто есть у меня небольшие опасения, что SQLite может стать узким местом.",
				"added": 1584254804
			},
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_257_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Думаю, проблема больше в движках сайтов, чем в ядре. Добавить поддержку внешней СУБД в ядро возможно. Я так понимаю, что сейчас все пишут sql запросы, исходя из того, что под капотом точно SQLite. Так что старые сайты так и останутся на SQLite, ну а поддерживаемым движкам придётся добавить слой абстракции над конкретным диалектом. [...]\n\nТут нет никаких движков сайтов. Тут по сути приложения на JavaScript, которые работают в браузере. Никакого бэкэнда нет. Всё ложится именно на компьютер (браузер) пользователя. Добавить поддержку внешней СУБД в ядро - да хоть чего вы туда добавьте - это не меняет ситуации. БД должна быть децентрализованной. Для больших БД тогда нужны всё равно серверы, а это уже уничтожает децентрализованность. Или каждому пользователю запустить у себя сервер серьёзной СУБД с репликацией и балансировкой нагрузки? Вообще-то вроде ZeroNet как раз убегает от этих сложностей и нужен запуск в один клик для любого человека.\n\nВот в том и прикол, что если будет огромная база, то надо будет как-то её делить и надо будет иметь механизм, чтобы один узел, у которого нет какого-то абстрактного 3085 Мбайта базы у себя, как-то у мел сделать запрос к нему. Также умел делать подсчёт всех записей в базе, сортировку по базе, сложные запросы, связи с другими таблицами и т. д. А как он может сделать такие SQL-запросы, если его система в принципе не знает о существовании других данных, пока не скачает себе все гигабайты это базы и полностью все индексы там не построит для выполнения запросов (в современных SQL базах типа MySQL, PostgreSQL, Oracle запросы делаются не просто так, там специальный \"ИИ\" придумывает как правильно выполнить определённый запрос, основываясь на анализе текущего состояния базы и структуре запроса)?\n\nА ещё, думаю, можно было бы добавить поддержку NoSQL баз. Для небольших проектов они даже лучше и быстрее.\n\nЧто касается актуальности проблемы - я уже сказал, я не критикую, а предполагаю и ввожу тему для обсуждения. Как оно там будет в дальнейшем - увидим. Но обсудить это вполне интересно.",
				"added": 1584289477
			}
		],
		"1584283661_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 4,
				"body": "Да сколько вас уже?\nhttp://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Home\n\nТеперь тут? Мне за всеми следить?",
				"added": 1584287700
			},
			{
				"comment_id": 6,
				"body": "> [geekless](#comment_260_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вини @gitcenter, он подал идею) [...]\n\nНу плохо, что так много. Это просто по-человечески неудобно.\nСпасибо, что перетащил сообщения сюда.\nПредлагаю быть тут. Всем. Нужна общая точка координации.\nИ ответь мне в ZeroMail.",
				"added": 1584292184
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_54_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Люди жаловались на количество форумов.\n\nДа, слишком много и ничего не понятно. Конкретику бы какую-нибудь.",
				"added": 1584453578
			},
			{
				"comment_id": 23,
				"body": "> [geekless](#comment_293_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Очень не нравится вёртска форума, как в мелких деталях, так и в целом построение шаблона HTML. Нужно будет многое переделывать. [...]\n\nДа, мне вообще не нравится как работает этот форум. Это что-то из 90-х. Напоминает Guest Book для старых сайтов на Perl. Движок надо усиленно пилить. Делать категории и всякое такое. Одним потоком сообщения - плохо.",
				"added": 1584548971
			},
			{
				"comment_id": 29,
				"body": "> [gitcenter](#comment_64_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А что конкретно не нравится? Минимализм :)\n\nДа почему минимализм? Нет. Просто неудобно длинную линию сообщений читать по разным темам. Как @geekless сказал - надо категории. В одном месте про разработку, в другом про баб, в третьем про железо, в четвёртом про мотоциклы, в пятом про бухло. Флудилка отдельно, программисты отдельно, знакомства отдельно, самогоноварение и травокурение отдельно и всякое такое. В том плане, чтобы не было всё в куче и человек мог зайти в категорию тем, которая ему интересна. А так у нас всё лентой валится как в Guest Book для маленького сайтика в 90-х. Где про старые видокарты, там же и про прошивку PS, про Путина и про то, как готовить бобра в условиях Крайнего Севера.",
				"added": 1584553022
			},
			{
				"comment_id": 31,
				"body": "> [geekless](#comment_302_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Тем, что они скрывают контент как таковой. [...]\n\nДа, именно. То, что у нас на главной, на нормальном форуме является отдельной страницей \"Recent Posts\". Это просто то, что вот недавно навалили.\nА я, может быть, хочу зайти в определённый раздел и посмотреть там пост месячной давности и я знаю, что он точно в определённой категории, а не среди всего этого хлама.\nВот общаются у нас на форуме анимешники, к примеру, и очень активно. А я вот не смотрю аниме. А они мне всю ленту завалят. А так - у них там своя категория Anime и они там сидят, а я про них и знать не знаю, я смотрю свою ветку про технологии, про ZeroNet или вообще во флудилку за приколами пошел.",
				"added": 1584553907
			},
			{
				"comment_id": 34,
				"body": "> [geekless](#comment_304_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Часто на форумах просят добавить фильтры, заточенные под особенности конкретного форума и сформировавшиеся там группы пользователей с частично конфликтующими интересами. [...]\n\nМы преследуем цель именно продвинутых пользователей?\nНе, ну я понимаю, типа - а нахер нам тут всякие нубы и прочий шлак. Но блин, удобство даже простых пользователей мы должны учитывать обязательно.",
				"added": 1584554981
			},
			{
				"comment_id": 40,
				"body": "> [geekless](#comment_316_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Нет, конечно. [...]\n\nТогда вообще не понимаю проблемы. Сейчас же всё так и происходит?",
				"added": 1584632267
			},
			{
				"comment_id": 45,
				"body": "> [geekless](#comment_323_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Это всегда было. [...]\n\nДа, я реально не заметил этих изменений. Хорошо. Спасибо.",
				"added": 1584803816
			},
			{
				"comment_id": 47,
				"body": "> [geekless](#comment_327_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я тут заметил, самое плохое даже не это. Самое плохое, что теперь я вижу, как в 2-3 прохода перерисовывается страница по мере загрузки шрифтов.\n\nГде это можно наблюдать?",
				"added": 1584807256
			},
			{
				"comment_id": 48,
				"body": "> [geekless](#comment_335_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Здесь, на странице. [...]\n\nНе могу воспроизвести.\nMint 18.3 64-bit, Chrome 80.0.3987.149.\nОткрывается за доли секунды. Видяха GeForce 1050ti 4Gb, Xorg, дрова проприетарные nVidia.\nНикаких проблем не наблюдаю. Всё ровно и мгновенно. Мерцаний не наблюдаю, задержек тоже. \n\nЛокальные веб-шрифты вообще должны грузиться моментально. Если же удалённые, так они кэшируются и тоже быстро работают. Попробовал отрубить кэширование в Developer Tools - задержка появилась, но она буквально там в 0,1 секунды. Всё нормально работает.\n\nТеперь попробовал в Firefox 74 на той же конфигурации. Оказалось ещё быстрее, чем в Chrome. Вообще мгновенно рендерится. Практически как фотографию открыл. Какие-то доли секунды и сразу на экране этот форум.\n\nМожет я чего не понял. Но я пока никакой проблемы не наблюдаю.",
				"added": 1584811326
			},
			{
				"comment_id": 52,
				"body": "> [geekless](#comment_339_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): У меня запущено 4 копии ZeroNet, 3 браузера, занято почти 8 гигов оперативы... короче, лагает маленько. [...]\n\nУ меня занято около 10 Гб оперативы. Браузер один, но три окна и около 70 вкладок. Норм вроде работает. Хотя, малость вру - многие вкладки не инициализированы, так как не заходил на них с предыдущего сеанса. Roboto в системе не стоит, но знаком с этим шрифтом - использовал для сайта одной стоматологической клиники. Проблем не наблюдаю. Но если у тебя лагает вообще, то лагать должно и на других сайтах. Это же не проблема конкретно здесь.\n\nА зачем 4 копии ZeroNet запускать?",
				"added": 1584815013
			},
			{
				"comment_id": 55,
				"body": "> [geekless](#comment_346_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Хочу сделать единый сайт, на который выгрузить кучу шрифтов, и все копии ZT++ (на самом деле любые сайты) будут подключать его.\n\nАга. Хорошая тема.",
				"added": 1585051734
			},
			{
				"comment_id": 56,
				"body": "А у меня на мобиле почему-то ZeroHello не обновляет ленту уведомлений. Сюда захожу - ага, вижу, новые сообщения появились. В ZeroHello их нет. Сижу через Tor под одним users.json с компа и с мобилы. Смотрю на монитор - есть уведомления в ленте. Смотрю на мобилу - нет их в ZeroHello. Странно.\nСам этот форум обновляется нормально, если прямо на него перейти. А в ZeroHello нет. Но не совсем нет, а они обновляются как-то поздно. Завтра вот утром встану - будут уведомления от сегодня. При этом комп по локалке, мобила в этой же локалке по WiFi.",
				"added": 1585070242
			},
			{
				"comment_id": 58,
				"body": "> [geekless](#comment_351_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если совсем нет, значит подписка на уведомления слетела или не настроена. [...]\n\nДа, вот прошло несколько часов. Уведомление на мобиле из данной темы появилось только сейчас. На компе появляется моментально.",
				"added": 1585147761
			},
			{
				"comment_id": 59,
				"body": "Хех. А вот то, что я написал пару минут назад (предыдущий мой ответ) появилось сразу. Ну да, локально же.",
				"added": 1585147934
			},
			{
				"comment_id": 63,
				"body": "> [jixuucix](#comment_31_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Нужно выбрать какой-то шрифт, который не разрабатывался с расчётом на то, что его будут размыливать, скрывая уродские заусенцы. Я из таких знаю, в основном, стандартные шрифты из MS Core Fonts — Arial, Tahoma, Verdana; есть ещё PT Sans. [...]\n\nБлин. Объясните суть проблемы. Скиньте скрин. У меня всё ровно. Где размытость?",
				"added": 1585382546
			},
			{
				"comment_id": 153,
				"body": "> [katelinlis2](#comment_5_12Lwi45PLwYpZHFJ2NdQNE1G1PeraTopV7): Привет всем! я за долгое время вернулась сюда\n\nПривет!",
				"added": 1611132792
			}
		],
		"1584288639_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_259_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да мне тоже, честно говоря. Это была одна из причин начать пилить движок. [...]\n\nКуда pull request делать-то если что? Где git? Я пока тут второй день. На Git Center посмотрел, но не вникал. Он доступен извне или как? Как мне стандартными средствами IDE просто сделать это сюда? Или тут как-то хитро это устроено?",
				"added": 1584292465
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_261_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Форумный движок тут: http://127.0.0.1:43110/1H3qtUJRrghDHpY89CBeueVAZw8xbHuDLr/ [...]\n\nЛадно, я как-нибудь сам разберусь. Будут вопросы - напишу в почту ZeroMail.",
				"added": 1584293986
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_262_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А это принципиальный момент - в почту? Во-первых, от почты я не получу уведомлений, в отличие от форумного поста. Во-вторых, там очень мало места.\n\nНу блин. Если я сюда буду писать, то это всеобщее обозрение, а я как-то не очень хочу нашу переписку всем светить.",
				"added": 1584294135
			},
			{
				"comment_id": 60,
				"body": "> [geekless](#comment_363_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Народ в личке спрашивает про фичу. Надо что-то делать...\n\nВащеее :-)",
				"added": 1585158452
			}
		],
		"1584452427_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 11,
				"body": "Интересно, сколько будет последователей мало популярного языка для и так мало популярного проекта. Посмотрим.",
				"added": 1584453853
			},
			{
				"comment_id": 12,
				"body": "> [geekless](#comment_282_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Смотря как внедрять. Вот CoffeeScript тут внедрён добровольно-принудительным методом)\n\nАга. При этом мне это не совсем нравится. Мне тогда уж по душе TypeScript. В любом случае используется транспилер и всё хреначится в JS. Почему не писать на современном JS тогда? Как таковой проблемы для программиста нет, любой разберётся, но просто зачем?",
				"added": 1584457250
			},
			{
				"comment_id": 78,
				"body": "> [elvecent](#comment_1_1L285jqLFxf6R2LRTXnuYvbtdbLkM1RkhP): Но ведь Elm не нужен, лучше Haskell/Reflex или хотя бы PureScript, иначе честное слово на JS приятнее писать\n\nТут вопрос не в том, что лучше или хуже. Человеку просто очень нравится Elm и он решил заняться вот таким делом. Это его решение и каким бы странным оно не казалось для нас это всё равно интересно. Почему бы и нет. Хорошо, что что-то происходит и что-то делается.",
				"added": 1586444995
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 13,
				"body": "Вот тут вот я =)",
				"added": 1584457337
			}
		],
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 14,
				"body": "Сразу сам предлагаю информационные ресурсы, с которых уже имею информацию:\nhttp://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\nhttp://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/\nhttp://127.0.0.1:43110/1CpGZyfbUBBV5uXUoY653wVoqZFRojbEzd",
				"added": 1584458053
			},
			{
				"comment_id": 15,
				"body": "> [geekless](#comment_283_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Хорошее дело. [...]\n\nХорошо.",
				"added": 1584458076
			},
			{
				"comment_id": 16,
				"body": "Для чего ZeroNet использует UPnP? Зачем открывать порт?\nВот сам же в теме и первый вопрос задаю. И да, наверное, ответ уже был, но я не все доки прочитал или не нашел ответ.\nПоясните, пожалуйста.",
				"added": 1584459073
			},
			{
				"comment_id": 17,
				"body": "> [gitcenter](#comment_55_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): :) [...]\n\nНу всё понятно. В общем, чтобы быстрее происходил поиск пиров и быстрее происходило обновление информации.\n\nУ меня роутер от провайдера, они удалённо управляют им и я сделать ничего не мог. Потом позвонил знакомому админу у них, он мне дал данные для администрирования роутера. Врубил UPnP, пробросил порт. Но не работает. На localhost нормально netcat на ZeroNet на порт откликается, на роутере Connection refused, ну и ZeroNet тоже говорит, что порт закрыт. Firewall в порядке в обе стороны со всех интерфейсов и протоколов. Завтра попробую ещё поразбираться, пока не уделял этому много внимания.",
				"added": 1584471714
			},
			{
				"comment_id": 18,
				"body": "> [geekless](#comment_284_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати говоря, более бесполезного изобретения в наше время, когда все сидят за NAT провайдера, сложно себе представить. [...]\nНу у меня раньше был белый IP, чтобы работать в одной конторе за рубежом, а потом надобность отпала и я отключил. Просто в РосТелеком оно было всего 20 рублей в месяц, а у моего нового провайдера теперь 400 рублей. Я отказался от этого. Сейчас просто они так подорожали. Раньше копейки стоило, а теперь я лучше на это пивка возьму =)",
				"added": 1584471919
			},
			{
				"comment_id": 19,
				"body": "> [geekless](#comment_286_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я к тому времени как раз на пенсию выйду, когда его внедрят на последней миле повсеместно)Например, мой провайдер не поддерживает IPv6 вообще никак.\n\nАналогично. Мой провайдер вообще никак IPv6 не поддерживает, а его админы говорят, что даже не умеют и ни разу не пробовали и нигде не видели как это делать.",
				"added": 1584472044
			},
			{
				"comment_id": 20,
				"body": "Тут про разработку для ZeroNet на Elm:\nhttp://127.0.0.1:43110/blog.gomzik.bit/?Post:20:Elm-ZeroNet",
				"added": 1584548475
			},
			{
				"comment_id": 21,
				"body": "> [geekless](#comment_289_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @cra: [...]\n\nСпасибо. База создаётся пока локально. Использую Metalsmith. Мой любимый. На выходных постараюсь уже что-нибудь выложить. Пока даже зайт не создал для этого. Будет контент - будет зайт. Пока всё в режиме подготовки.\nПотом сразу в начальный пост добавлю ссылку.",
				"added": 1584548621
			},
			{
				"comment_id": 22,
				"body": "> [geekless](#comment_297_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Wiki на русском: [...]\n\nОфигеть! Как много информации! Круто! Спасибо! Буду переваривать, сортировать и размещать.",
				"added": 1584548728
			},
			{
				"comment_id": 25,
				"body": "> [geekless](#comment_298_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати, в копилку -- если там будет список того, на чем можно делать сайты для ZN. Вспомнил про движок @caryoscelus-а: [...]\n\nJekyll это же генератор HTML-сайтов на Ruby, который в GitPages юзается? Я о том подумал?",
				"added": 1584549333
			},
			{
				"comment_id": 26,
				"body": "Кстати, народ. Попользую ваши мозги.\nНу-ка накидайте категории для документации.\nКак назовём корневые узлы дерева?",
				"added": 1584549469
			},
			{
				"comment_id": 28,
				"body": "> [gitcenter](#comment_62_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Какого дерева? Которое content.json или что-то другое?\n\nНет, дерево категорий. Накидайте просто как распределить документацию. Банально \"Общее\", \"Для разработчиков\", \"Ресурсы\", \"Вопросы\" и вот у меня с фантазией плохо. Чего там накидать? Разделы документации для народа грубо говоря.",
				"added": 1584552510
			},
			{
				"comment_id": 30,
				"body": "> [gitcenter](#comment_65_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Можно \"Для читателей\", \"Для создателей простых сайтов\", \"Для разработчиков\" (только названия получше) -- в первом про то, как добавить поддержку Tor, про основные сайты и т.п., во втором -- про клонирование ZeroBlog, про поиск пиров и т.п., в третьем -- всякие детали вроде ZeroFrame API и хитрой подписи content.json (вроде того, что сейчас на этом форуме).\n\nХорошо, услышал. Подумаю. Уже даже мысль подкинул, спасибо!",
				"added": 1584553223
			},
			{
				"comment_id": 97,
				"body": "> [esperantisto](#comment_1_132t6wB6XyESsiGVNkmTcvaa7KnShXcGQz): Как зарегистрировать доменное имя example.bit?\n\nВот здесь ответ на этот вопрос:\nhttp://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke/",
				"added": 1590388983
			},
			{
				"comment_id": 147,
				"body": "> [geekless](#comment_387_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @cra: [...]\n\nЯ не потерял интерес. К сожалению у меня некоторые проблемы в жизни возникли и я пока не могу этим заниматься. Думаю, через пару месяцев всё разрешится.",
				"added": 1608534347
			}
		],
		"1584542139_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 24,
				"body": "Не знал и не мог знать.",
				"added": 1584549122
			}
		],
		"1584551115_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 27,
				"body": "Я может чего не понимаю, но сам сайт ZeroNet давно предлагает установить на Android, если зайти с телефона. Только я на мобиле столько хостить и раздавать не могу и не хочу. При этом users.json там будет другой и не получится синхронизировать всё с компом. Так нахрен оно надо?",
				"added": 1584551860
			},
			{
				"comment_id": 49,
				"body": "> [topnet](#comment_42_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Вы дали ссылку не на то приложение https://github.com/canewsin/ZeroNet/releases вот приложение о котором идет речь в данной теме [...]\n\nЯ вообще не вникал. Просто зашел с мобильного на zeronet.io и он сразу определил платформу и предложил установить для Android. При клике на кнопку перенаправляет на Google Play Market. Оттуда поставил приложение - оно сырое, некоторые функции не работают. Ну там и написано, что оно экспериментальное и не закончено.",
				"added": 1584811677
			}
		],
		"1584552124_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 32,
				"body": "> [geekless](#comment_303_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Но кто мы и откуда, когда от этих лет остались пересуды, а нас на свете нет? [...]\n\nЯ никогда не тусил на ЛОР. Но был в трёх LUGах и в 2000-х был в команде RTK (Russian Trinux Kit). В общем я был веб-девом LinuxSecurity.ru. Я тоже Сибирь.",
				"added": 1584554108
			},
			{
				"comment_id": 33,
				"body": "> [gomzik](#comment_135_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): У меня все симметрично с @geekless, сам из Беларуси, UTC+3\nДа, я твой блог по Vue прочитал весь. Понял, что из Беларуси.",
				"added": 1584554632
			},
			{
				"comment_id": 107,
				"body": "> [jk7](#comment_71_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Товмайор хочет повышения - все дружненько встали и напечатали дяде бумажечку. Явку с повиной.\n\nТебе к психиатру надо. У тебя симптомы параноидальной шизофрении. Тем более весна, у ваших сезонное обострение.",
				"added": 1590821078
			},
			{
				"comment_id": 110,
				"body": "> [jk7](#comment_76_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Совет тем, кто в этой ветке отписАлся - даркнет и анонимность не про вас.  Сидите во вконтактиках с привязкой к номеру с привязкой к паспорту - так хоть не будет ложного ощущения анонимности и безнаказанности.\n\nZeroNet это не даркнет и это не анонимность. Если ты думал иначе, то ты ошибся.\nСпециально для альтернативно одарённых даже в документации ZeroNet это написано.\n\nА так - ты думаешь здесь в тёплое и уютное место попал? 100% здесь сидят и читают всё это сотрудники спецслужб, ибо в этом нет ничего сложного. Сидят и молча почитывают. Смотрят кого можно вычислить и кто спалился, а кто нет. Скажи что-нибудь \"интересное\" и они уже за тобой присматривают. Не будь наивным.\nКак минимум - после установки (после скачивания архива) ZeroNet сразу же конфигурируй Tor (в Windows оно вроде в комплекте, но я под Linux и тут надо руками чуть-чуть пошевелить) и делай всё через Tor. Сам же ZeroNet в ZeroHello рекомендует для анонимности вообще везде ходить через Tor Browser. Я забил, мне как-то неудобно. Хожу через Chrome, чем палю в принципе себя. Но я не параноик настолько, чтобы уж совсем всё через Tor юзать. Да и вроде ничего такого не делаю, чтобы очковать. Но... Смотря на происходящее сейчас, всё больше возникает мысль, что прятаться надо уже сейчас, а не когда уже поздно будет.\nКогда вышел ебаный закон об оскорблении власти и об оскорблении верующих и там начали в ВК напрягать за это я малость ссыканул. Всю \"стену\" в ВК нельзя просто сразу вниз промотать до 2008 года (я регался в то время). Я воткнул спичку в клавиатуру на Page Down и пошел заниматься своими делами. Других идей как промотать до самого начала у меня не было. Только потом до меня дошло, что я мог бы написать для этого простой JavaScript и запустить в Developer Tools. Но похер. Часа через 4 оно промоталось до конца. И потом около 3 часов я мотал вверх и вычищал всю ржаку про Путина и Патриарха Кирилла и прочих ебантяев от власти. Я реально ссыканул, когда знакомым начали приходить предупреждения, якобы от ФСБ, типа если не удалите контент такой-то, то бля будут проблемы по такой-то статье. В общем я вычистил всю стену со смешными и всякими мерзкими и поносными картинками про Путина и верующих. Верующих я конкретно оскорбить не хотел и не хочу, у меня есть друзья верующие - хуй с ними, их дело. Я всегда охуеваю с РПЦ - это же пиздец... Но, в общем почистил нахер. Реально ссыканул, ибо там уже начали судить, ловить, дрочить. Ну его нахер такие концерты...\n\nА так - пока мне как-то комфорт ещё пока нужен, поэтому я пока ещё палю данные всяким трекерам и полностью в Tor Browser не ухожу. Стоит AdBlock Plus и NoScript. Но NoScript почти никогда не работает. Только выборочно его врубаю. Пока я ещё не осознаю насколько хреново может быть то, что обо мне собирают данные. Просто если совсем отгородиться, то это очень не комфортно в плане работы сайтов.\n\nХер его знает. Пока как-то так. Но вот из ВК, ОК и FB решил валить. Twitter ещё пока оставил - мне там реально нравится.\n\nZeroNet - это далеко не полная анонимность. Всегда помните об этом. В логах ZeroNet написаны ваши IP-адреса. В браузере хранится история, cookies, localStorage и т. д. Скрипты аналитики и трекеры работают. А (з)сайты ZeroNet не обязательно добрые и хорошие - они тоже могут собирать информацию. Не всё так идеально, как хотелось бы.",
				"added": 1590865060
			},
			{
				"comment_id": 119,
				"body": "> [jk7](#comment_79_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): ZeroNet анонимен и безопасен примерно настолько, сколько и вцелом протокол битторрент. Идею выпиливаться с попсовых соцсетей поддерживаю полностью, можно перейти на всякие fediverse, mastodon (аналог твиттера), diaspora с федеративным устройством, но даже для такого считаю безсерверный зиронэт лучше, да и интерфейс просто удобен. А вот полезной инфы пока тут мало, одно время balancer73 сильно рулил, но...\n\nПроблема в том, что социальные сети вроде как и существуют для того, чтобы там можно было общаться с друзьями, поддерживать связь с интересными людьми, участвовать в сообществах и т. д. но в этих альтернативных (не попсовых) социальных сетях делать это затруднительно. Вот в Diaspora я уже лет 10, так сказать с самого основания. И что? А ничего. У меня там парочка друзей, мы особо не генерируем контент (я и в обычных социальных сетях почти ничего не публиковал, разве что чужое репостил) и делать мне там особо нечего. Там не тех сообществ, которые есть в попсовых соцсетях. Туда не затащить многих моих друзей и знакомых, которые просто не понимают нахрен им это надо, ведь во вконтактике тепло и уютно и там девки, котики и родственники. По этой причине пользоваться этими \"альтернативными\" соцсетями не комфортно - нет нужного контента, нет нужных людей, нет возможности подписаться на аккаунт какого-то интересного человека или компании просто потому, что у них там нет аккаунтов.\n\nБезопасно, анонимно, децентрализовано, без слежки и т. д. и т. п. - только делать в этих сервисах зачастую просто нечего, а русскоязычное сообщество обычно ничего из себя не представляет.",
				"added": 1590917057
			}
		],
		"1584554479_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 35,
				"body": "Не пробовал. А где его предлагают? Я замечал где-то, но уже забыл. Надо попробовать.",
				"added": 1584555202
			},
			{
				"comment_id": 36,
				"body": "Да, пока не работает. Was not able to register an id at the moment.",
				"added": 1584598797
			}
		],
		"1584563412_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 37,
				"body": "Здравия желаю, товарищи! Доложите обстановку! :D",
				"added": 1584599520
			}
		],
		"1584599632_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 38,
				"body": "Пиры не найдены...",
				"added": 1584599746
			},
			{
				"comment_id": 39,
				"body": "> [geekless](#comment_312_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Tor\n\nOk. Врубил Tor.",
				"added": 1584603366
			},
			{
				"comment_id": 61,
				"body": "> [geekless](#comment_364_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Апну тему, может кто не видел еще. [...]\n\nДа не до них сейчас совсем. Дел выше крыши.",
				"added": 1585158556
			}
		],
		"1584632781_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 41,
				"body": "> [geekless](#comment_317_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Люди всё портят.\n\nАга, люди вообще говно :D",
				"added": 1584633137
			},
			{
				"comment_id": 44,
				"body": "> [xandanyesm](#comment_28_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): если бы за последние лет 5 мне каждый раз,  когда zn для себя открывают юные восторженные \"пиарщики\", \"генераторы контента\" и \"затаскиватели 50-ти человек\" выдавали бы по одной медицинской маске, то я бы сейчас озолотился уже...\n\nЯ бы тоже сейчас озолотился, если бы мне выдавали по медицинской маске каждый раз, когда я читаю в комментариях чьи-то фантазии и прочие домыслы про незнакомых людей.",
				"added": 1584792997
			},
			{
				"comment_id": 53,
				"body": "> [topnet](#comment_43_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Проверял удоли в настройках все трекеры он все равно работает это первое второе каждый пользователь может стать трекером https://www.youtube.com/watch?v=3IBHKr_SGl8 [...]\n\nЧто случилось с запятыми?\nМожно мозг сломать, пока прочитаешь то, что вы пишете.",
				"added": 1584947473
			},
			{
				"comment_id": 54,
				"body": "> [geekless](#comment_343_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Они удолились :)\n\nЯ им соболезную...",
				"added": 1584974892
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 42,
				"body": "> [xandanyesm](#comment_14_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): какие олигархи? потерялся в нулевых? давно фсб всем рулит\n\nДа ничё мы не рулим. Если бы мы рулили, такой хуйни бы не было.",
				"added": 1584694713
			},
			{
				"comment_id": 43,
				"body": "> [xandanyesm](#comment_26_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): именно поэтому и такая хуйня что вы рулите )\n\nА лучше, чтобы олигархи рулили?",
				"added": 1584699248
			},
			{
				"comment_id": 50,
				"body": "> [xandanyesm](#comment_27_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): что-то у вас опции сильно сокращены - либо туберкулез, либо диабетхотелось бы и без одного и без другого, хотелось бы здоровым пожить...\n\nНе, ну там была тема, что рулят олигархи. Ответили, что нифига и спецслужбы рулят. Собственно, в контексте данного саркастического момента выбор был только из двух вариантов. Не болейте.",
				"added": 1584811858
			},
			{
				"comment_id": 51,
				"body": "> [geekless](#comment_336_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Включил сегодня случайно телевизор на НТВ. Хватило меня на 15 минут:короновирус, Евросоюз, Украина, Донбасс, Украина, короновирус, Порошенко, Испания, Евросоюз, Украина... и так кругами, и бред на бреде, какие-то абсолютно безумные истории, которые в 90-е только в самой желтой прессе можно было найти. Срыв покровов с загнивающего запада. [...]\n\nНе включай! Особенно НТВ :D\nОпасно для психического здоровья. Даже если оно у тебя крепкое - вдруг окружающие будут рядом и пострадают. Особенно пенсионеры.",
				"added": 1584811987
			}
		],
		"1584803286_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC": [],
		"1584548291_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 57,
				"body": "> [jk7](#comment_51_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Да я вообще зеронет у себя держу,  ненужный лично мне.\n\nЗачем?",
				"added": 1585121280
			}
		],
		"1585191373_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 62,
				"body": "Ыть =)",
				"added": 1585238184
			},
			{
				"comment_id": 69,
				"body": "Читаю siliks'a и это прикольно. Жаль, что в блоге похерены комментарии.",
				"added": 1586024975
			}
		],
		"1585382861_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 64,
				"body": "> [xandanyesm](#comment_32_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): продолжай держать сообщество в курсе своего бухания, пожалуйста, ведь это очень важно для нас...\n\nКак пожелаете.",
				"added": 1585930422
			}
		],
		"1585691293_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 65,
				"body": "Нормально. Уже видел его. Он в списке на:\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zite-list-searches\nЕму не хватает ещё функции \"скрыть похожие результаты\". Иногда бывает по 5-7 одинаковых выдаёт.",
				"added": 1585931310
			}
		],
		"1585683200_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 66,
				"body": "На этот счёт есть довольно много разных мнений.\n\nЕсть мнение, что это типа такой способ \"переиграть\" Трампа. Типа показать, что вот Россия-то какая, помогает. А на самом деле это опять же свои геополитические интересы. Такая же тема и в Италии.\nПри этом сама помощь США по сути там ничтожна. Ну как слону дробина. Так что это чисто такой пиар ход. Чтобы засветить сам факт и чтобы об этом говорили СМИ. В Европе множество различных СМИ опубликовали эту информацию, что вот - Путин направил помощь. Типа точно также он делал и в Украине и в Сирии. Просто чтобы все видели сам факт и потом можно было бы использовать это в своих интересах.",
				"added": 1585932141
			}
		],
		"1585597315_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 67,
				"body": "По этому индексу у меня в городе вообще где-нибудь около 2. Город небольшой, на карте его индекс не показывается.\nВесна. Погода хорошая. Народу вообще дома не сидится. Всякие клубы, рестораны, кинотеатры и подобное закрыты. Просто все гуляют по улицам, в парках и т. д. Кто на шашлыки поехал, кто просто к друзьям и всякое такое. У нас в регионе пока не зарегистрировано не одного заболевшего и на вирус вообще всем глубоко пофигу.\nУчитывая то, сколько к нам валит туристов - это наблюдение мне не очень нравится. Люди карантин воспринимают как праздник - месяц оплачиваемого отпуска весной для всех. Давайте отдыхать и веселиться...",
				"added": 1585932794
			}
		],
		"1585772185_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 68,
				"body": "> [vialemar](#comment_3_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu): буэ windows клиент тока\n\nСолидарен. Этакое у них упущение.",
				"added": 1585933649
			}
		],
		"1586030691_1QKthGzNypqBm38Z4CCCqxxMnfm1KT8KX5": [
			{
				"comment_id": 70,
				"body": "> [vialemar](#comment_4_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu): водники?\n\nможно через кальян",
				"added": 1586066606
			},
			{
				"comment_id": 76,
				"body": "> [pygmalion](#comment_1_1QKthGzNypqBm38Z4CCCqxxMnfm1KT8KX5): Никаких наркотиков, всё по чистоте.\n\nА кто про наркотики вообще говорил?",
				"added": 1586276200
			}
		],
		"1586039346_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": [
			{
				"comment_id": 71,
				"body": "По-моему это параноидальная шизофрения",
				"added": 1586066698
			},
			{
				"comment_id": 72,
				"body": "> [vialemar](#comment_7_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu): есть и военное применение 5ghttps://ntp.niehs.nih.gov/ntp/about_ntp/trpanel/2018/march/presentations/15devra_508.pdf\n\nМало данных. Можно и в микроволновку голову засунуть =)\nВы что конкретно хотите сказать-то?",
				"added": 1586095135
			},
			{
				"comment_id": 73,
				"body": "> [vialemar](#comment_8_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu): да все норм так-то, всегда когда что-то внедряют, начинают появляться люди с загонами, просто интересно что каждый думает\n\nПомню был прикол. Тогда ещё только 2G было. В общем - американцы некоторые начали типа болеть \"непереносимостью радиоволн\" (вообще-то они повсюду так или иначе), т. н. радиофобией. И вот есть у них городок, забыл как он называется... В общем там стоят радиотелескопы, поэтому в городке нет WiFi и сотовой связи. Вот все радиофобы там и поселились. Прям вот у них от радиоволн то понос, то голова болит и вообще жить невозможно.\nПриехали к ним журналисты и начали проверять. Прямо во время интервью пользовались радиотелефонами. На микроавтобусе антенна передавала в эфир всё. Журналист стебал-стебал. Прямо при женщине какой-то выходил в интернет и отправлял электронную почту. Но самим жителям не говорили, что это происходит.\nИ вот жителям вообще ничего не было, пока им не сказали, что на самом деле у них ретранслятор работает и тут везде сейчас WiFi работает. Как только им сказали - так они за головы начали хвататься.\n\nЕсть и ещё другой прикол. Баян тоже. Не знаю правда или нет, но старый баян:\nВ общем в деревне приехали монтажники МТС и установили вышку сотовой связи. Антенн понавешали и всё такое. Жители деревни взбунтовались. Всё! Пиздец! У нас коровы плохо доятся! Собаки лают! Голова болит! Бабка из-за вас до 100-летия не дожила! Уходите-уходите! Мудаки!\nАдминистрация вызвала руководителя подразделения МТС - решайте вопрос!\nЖители жалуются - всё, пиздец! Умрём! Вы нас своей этой антенной всех просвечиваете и радиацией заражаете! У нас урожая нет! Коровы дохнут!\nРуководитель говорит: - Мдааа... Реально пиздец. А представьте, что будет, когда мы её подключим?",
				"added": 1586101919
			},
			{
				"comment_id": 74,
				"body": "> [talknow](#comment_4_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn): На самом деле почти все т.н. \"теории заговора\" правда (кроме нло, рептилоидов и различного рода БОГИ). Просто вас дурят как лохов (стригут как овец).\n\nЧто вы имеете против рептилоидов?",
				"added": 1586274320
			}
		],
		"1586252709_1GgRL2KMburXFTdTD2oxkeXpuwBH3heDQa": [
			{
				"comment_id": 75,
				"body": "Быстро скопировать в ZeroNet можно только статичный контент. Личные кабинеты и чаты не получится. Это надо отдельно реализовывать.",
				"added": 1586275110
			}
		],
		"1586185241_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": [
			{
				"comment_id": 77,
				"body": "Мда... Наркомания это такое...",
				"added": 1586276302
			},
			{
				"comment_id": 79,
				"body": "> [topnet](#comment_58_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): чипы для России уже готовы добро пожаловать в электронный концлагерь - новый мировой порядок https://www.youtube.com/watch?v=0BTrvXglf3w\n\nКак это видео к чипам и вообще вашему комментарию относится? Насрали?",
				"added": 1586626374
			},
			{
				"comment_id": 80,
				"body": "> [xandanyesm](#comment_35_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): а еще так бывает что диванные иксперты не умеющие и не знающие ни медицины, ни эпидемиологии или вирусологии,  ни статистики, ни даже азов математики (не верхней головой и не нижней) влажно рассказывают о конспирологии и мировой закулисе... редко, конечно, но бывает и такое\n\nПолностью солидарен с вами (только не \"не\", а \"ни\") =)\n",
				"added": 1586626580
			},
			{
				"comment_id": 81,
				"body": "> [ujas](#comment_2_184TqgKDDxfGApMM6yEt9TkgzAkaPGJS4h): И да, забыл: Для понимания данной ситуации необязательно быть медиком. Достаточно мнения тех кому доверяешь. И прибегаем к этому мы во всем. Идем к мастерам если не шарим в чем либо, обращаемся к преподавателям...  В школе и институте нас чему-то учили. Не так ли? А кто сказал что всё это правда?Так вот, чтобы понять что этот \"вирус\" не так опасен как его описывают не нужно быть медиком. И то что этот \"вирус\" не больше чем очередная сезонная эпидемия грипаподобного вируса, которые мы видим каждый год. До этого паники же не было. А что случилось сейчас? И если я это как-то понял то я вижу что мне навязывают \"карантины\", и в купе с ними заключают в \"цифровой концлагерь\". В некоторых странах переходят на онлайн обучение, работу. На улицу выходят по рвзрешению полученному через сеть или смс. На улицах штрафуют. Штрафовать то зачем? Если я вышел то мне это нужно. А если заболею то сам виноват. Из этого не сложно понять что мне это всё навязывают, причем без веской причины. Это и есть \"концлагерь\"...\n\nВы не тот же человек, который тут topnet?",
				"added": 1586627017
			},
			{
				"comment_id": 86,
				"body": "> [spudro](#comment_2_1JY6yAbyYZhop19BQAxYe3niwz7ByZxkoX): Всем ставили \"манту\", так что мы все здес чипированы!\n\nАга. По несколько раз. Прошивку чипа обновляли.",
				"added": 1586668027
			},
			{
				"comment_id": 87,
				"body": "> [ujas](#comment_4_184TqgKDDxfGApMM6yEt9TkgzAkaPGJS4h): Нет. С чего ты взял.?)\n\nПросто у него волшебным образом исчезают запятые. =) У вас с этим лучше, но тоже пропадают. Вот и закралось подозрение, что один человек под разными id пишет. :)",
				"added": 1586786314
			},
			{
				"comment_id": 90,
				"body": "> [xandanyesm](#comment_36_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): откуда все это повылезало? весна?\n\nНу не без этого, 100%. В межсезонье (осенью и весной) происходят обострения у людей с отклонениями. Весной это особенно ярко выражено. Отделы техподдержки в знакомых конторах весной просто охреневают. Неадекватные люди несут лютую дичь и ведут себя как полные психи. Вот недавно чувак звонил провайдеру, угрожал, что покончит жизнь самоубийством, если ему не включат интернет, а в итоге оказалось, что у него роутер сдох. При этом летом и зимой такого нет, а вот весной прямо как прорывает. Шизофреники активизируются и даже те, которые вроде тихие и не привлекали внимание, весной могут чем-нибудь отличиться.",
				"added": 1587636334
			}
		],
		"1586599468_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 82,
				"body": "Настоятельно рекомендую вам этот материал. Подчеркнёте для себя много нового и заполните пробелы:\nhttp://gramota.ru/class/coach/punct/",
				"added": 1586628603
			}
		],
		"1586628993_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 83,
				"body": "Мля, ну а он мля как вообще хотел? В любом случае какая-то инфа о пользователях должна где-то храниться. Как вообще тогда существовать самой сети-то? Псих?",
				"added": 1586629115
			},
			{
				"comment_id": 84,
				"body": "Объясните чуваку про то, кто может быть трекерами.",
				"added": 1586629460
			}
		],
		"1586627364_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 85,
				"body": "Прикольно. Но это децентрализованный файлообменник. Тут уже писали про LYBR, типа децентрализованный YouTube. Контента мало и всё на \"неславянских\" языках.",
				"added": 1586630317
			}
		],
		"1586902024_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC": [
			{
				"comment_id": 88,
				"body": "Это программы для рисования на экране.\nВот что-нибудь типа такого:\nhttps://epic-pen.com/\nhttps://soft.mydiv.net/win/download-Screen-Marker.html",
				"added": 1586937411
			},
			{
				"comment_id": 89,
				"body": "> [jixuucix](#comment_34_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Спасибо — то, что нужно!\n\nНу могут быть и проблемы. Просто эти экранные рисовалки работают по-разному. Одни перед началом рисования просто делают скриншот всего экрана и на нём рисуют. В таком случае можно рисовать только на статичном экране и не получится рисовать поверх видео. Но точно знаю, что есть и другие, которые реально рисуют прямо на экране, а не на скриншоте и во время рисования на экране может происходить всё, что угодно. Т. е. можно даже нарисовать что-нибудь поверх всех окон, а потом продолжить работать с другими программами, открывать и закрывать окна и т. д. а рисунок так и останется поверх всего этого висеть, пока не удалишь. Увы, но не могу вспомнить как называлась именно та софтина, которой я пользовался. Просто давно это было, да и Windows я практически не пользуюсь, посему виндовый софт из памяти уходит. Надо гуглить и пробовать.\n\nUPD: Ну вот Screen Marker вроде как раз умеет в реальном времени на экране рисовать, а не на скриншотах.",
				"added": 1586946929
			}
		],
		"1587837330_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 91,
				"body": "> [ptnpnx](#comment_8_1E3o28BmawAEP5vzkCyfk1FyAwQbQUxsHR): и пральна! Нех вступаться - не для русских это, и уж тем более не для россиян. У них обычно тока своя рубашка, которая ближе.....да и то часто - последняя ;) [...]\n\nДело не в этом. За всех бездумно заступаться это признак клинической тупости.\n\nМного таких кричащих - ааа, меня власть прессует, меня закрыть хотят, меня преследуют по политическим мотивам! Помогите, братцы! Что же такое творится-то! Беспредел! А когда начинаешь разбираться, то бывает выясняется, что человек так-то сам косячил и прессуют его за вполне себе конкретные преступления, а политическая сторона если и присутствует, то уже как второстепенный момент. Типа наркоманил или по пьяни хату с братвой грабанули, но при этом ещё и дохрена оппозиционный. Ну и кричать, что дело возбуждено из-за оппозиционной политической деятельности конечно куда удобнее.\n\nТак и с Баталовым всё не совсем однозначно. Поэтому и разместил это тут, чтобы просто была информация к размышлению. Видео создало общественный резонанс и появилось много ответных видео, как в защиту, так и с критикой. Ибо некоторые действия Баталова выглядят странно.",
				"added": 1588492167
			},
			{
				"comment_id": 108,
				"body": "> [jk7](#comment_72_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Походу, нормальные люди засели где-то в самых глубоких даркнетах. Тут прям мусорильней попахивает.\n\nА как пахнет мусорильня? Ты свой параноидальный бред будешь хоть иногда аргументировать или просто будешь дальше нести ахинею?\nСможешь аргументировать или балабол?",
				"added": 1590821261
			}
		],
		"1588753510_1NNo6r1xQxfifhxSegwnPGvzXNJHD5vrAj": [
			{
				"comment_id": 92,
				"body": "Вообще-то он не будет, а уже есть. При этом во всём мире.",
				"added": 1588840820
			}
		],
		"1589484353_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 93,
				"body": "> [exhumator](#comment_24_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): А как же?! Будет ещё Covid-20 Pro и Covid-20 Pro Plus :)\n\nИ Covid-20 Collector's Edition",
				"added": 1589782699
			}
		],
		"1589801857_1NmPc7YPtwCotNPJt7CXcHmcEP6s37L18z": [
			{
				"comment_id": 94,
				"body": "Ок. Ясно. Понятно.",
				"added": 1589884295
			}
		],
		"1589810453_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 95,
				"body": "Ок. Спасибо. Даже и не знал про anon.fm",
				"added": 1589884487
			}
		],
		"1590353253_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 96,
				"body": "Да =)",
				"added": 1590387380
			}
		],
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 98,
				"body": "Не знаю. Я ничего не заметил, кроме масок на людях и постоянных статей в лентах новостей по всему интернету.",
				"added": 1590472802
			},
			{
				"comment_id": 99,
				"body": "> [dira](#comment_5_1Hh3pN2ZTwF9x9D7JHREcLev52TzauX7BF): Ну я еще заметил как люди отупели,  маски никого не спасут, а отдают за них по дохуя за штуку ибо наценка\n\nПо этому я и говорю, что ничего не заметил. Люди не отупели, они не изменились.",
				"added": 1590513863
			}
		],
		"1585388893_149RCNaRcGLevbZcMLdhsixwQarCZga6WT": [
			{
				"comment_id": 100,
				"body": "Забыли один пункт:\n0) Автору данного текста выучить русский язык.\n\nЕсли человек даже не может просто грамотно составить предложение, то что у него в голове? Значит он и не умеет структурно мыслить.",
				"added": 1590560102
			},
			{
				"comment_id": 101,
				"body": "> [topnet](#comment_52_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): я лутьше писю подрачю а потом в штаты уеду в россии проблема не во власти а в людях умных людей в рф осталось не более 5 процентов так о каком захвате может идти речь ? рожденные ползать летать не могут\n\nДа, а ещё грамотных даже на уровне начальной школы уже почти не осталось.",
				"added": 1590560312
			},
			{
				"comment_id": 102,
				"body": "Самый прикол в том, что у тупых мамкиных революционеров нет никакой программы.\n\nВот не нравится им власть. Ок. Надо её типа свергнуть и всё такое. Всех убрать, посадить, расстрелять, наказать и т. д. Ок. Вот совершили вы переворот, а дальше что?\n\nДолжна же быть конкретная политическая программа. Как организовать жизнь в дальнейшем? Кто будет управлять социальными и экономическими сферами, международной политикой и т. д. и т. п.\n\nПосле переворота скорее всего начнётся гражданская война. Различные криминальные группировки начнут бороться за власть, чтобы отхапать кусок пирога и чем больше, тем лучше. В данной ситуации нахлынет поток криминала из других стран. Многие опытные военные командиры бывшей армии РФ также начнут бороться за власть.\nРазные группы людей будут по-разному видеть как надо управлять страной и войдут в конфронтацию.\nИнвестиции уйдут. Производства встанут. Наступит глубокий экономический кризис. Начнётся тотальное разворовывание всего, что только можно.\nРегионы начнут бороться за независимость. Республики в составе РФ начнут требовать независимости. Везде будут свои лидеры, которые будут бороться за власть. Прольётся много крови. Тотальная неразбериха и экономический коллапс.\nВвиду того, что страна будет в полной жопе и никакой международной политики не будет - тут же прибегут агенты влияния и управленцы из других стран. Из тех же США, Великобритании и т. д. Они будут пытаться поставить везде у власти лояльных к своим государствам управленцев, будут консультировать их, если будет нужно - будут оказывать военную помощь в подавлении неугодных. При этом регионы, которые и сейчас дотационные и ничего не производят окажутся на полном дне - нищета, воровство, убийства, мародёрство. А регионы, которые имеют какие-либо ресурсы (лес, дерево, алмазы, нефть, металлы, важные промышленные производства и т. д.) будут захапаны новыми правительствами, которые конфликтуют между собой в борьбе за всё это богатство.\n\nОбычно после революций в странах наступает большая затяжная жопа и внешнее управление. При этом к власти приходят опять хрен пойми кто, а народ так и не доволен и опять требует революции. В африканских странах до сих пор революции происходят каждые 10 лет (образно говоря), одни убивают других, а потом третьи убивают этих и т. д. И нихрена хорошего не происходит. Постоянная жопа. Постоянные революции ради новой жопы. Просто вечно все борются за власть, а простому стадному народу обещают лучшую жизнь. А пипл, как говорится, хавает.\n\nПри этом совершить переворот в России это совсем не одинаково, как если бы совершить революцию на каком-нибудь острове в Карибском море или в какой-нибудь африканской республике.\n\nНо мамкиных революционеров не остановить.  У молодых кровь горячая и любые горы по плечу. Мозгов нет ещё нихрена, но очень активная позиция. Как говорится - похрен кого свергать, лишь бы свергать. Стремление ради самого процесса стремления. Помню, сам таким был лет 20-25 назад. Тоже с флагами на митинги ходил и тоже нихрена не понимал в происходящем. Какой-нибудь условный Навальный заливал нам в уши и мы хавали, что боремся за светлое будущее. Только тот заливальщик был от КПРФ и то были 90-е годы.\n\nЕсли и делать революцию, то тут должны быть грамотные люди, всё это должно быть продумано и организовано, нужно финансирование и т. д. Это как минимум снизит уровень хаоса, разрухи и кровопролития, но не гарантирует вообще ничего - после у власти будут собственно те, кто и финансировал весь сабантуй.\n\nА вот такие призывы - ааа, время пришло, давайте соберёмся и ёбнем проклятых мудаков у власти! Так это просто тупые призывы долбойобов, либо эти призывы проплачены заинтересованной стороной, которая хочет ввергнуть страну в хаос и нажиться на этом.",
				"added": 1590562641
			},
			{
				"comment_id": 105,
				"body": "> [monarchonline](#comment_2_1NBNERTBMdF2rXDuRJGNtn14Jh5RthCDRN): Хохлы пидоры!\n\nВы так любую тему будете превращать в срач без аргументов?\nСколько знаю лично украинцев - все нормальные чуваки.\nЭто просто jk7 с обострениями - у него любая критика Украины вызывает взрыв негативных эмоций. Ведь про Украину можно либо хорошо, либо ничего. Но это же не значит, что все украинцы такие же как jk7.\nНе уподобляйтесь ему и не обращайте внимания. С такими людьми невозможно вести конструктивный диалог.",
				"added": 1590734184
			},
			{
				"comment_id": 106,
				"body": "> [jk7](#comment_70_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): И кому нужен захват первобытного пропитого дерьма? Только чтоб руки лишний раз помыть и от вируса защититься.\n\nКакой же ты глупый первобытный школьник.",
				"added": 1590820998
			},
			{
				"comment_id": 120,
				"body": "> [nahnah](#comment_1_1AQtV1XianG3vV9WkPhoMg8UQCevHFrpHr): Долбаеб ебаный, мы и так все отдает ебучим пидорам которые все захватили, Люди нехуя не получает.У нас нету денег не с нефти не с лисов которые мы китайцам отдаем, даже когда газ продавали Украине Люди нехуя не получили. И ты тут что то зачесываешь что революция не нужна, иди ты нахуй терпила.\n\nВот ты типичный представитель неадекватных дебилов.\nГде я говорил, что революция не нужна? Ты клинический идиот? Видимо, да.\nЯ говорил, что революция, сделанная такими дебилами как ты, ни к чему хорошему не приведёт.\nРеволюцию должны делать грамотные люди, а не стадо баранов типа тебя.",
				"added": 1590917247
			},
			{
				"comment_id": 121,
				"body": "> [nahnah](#comment_2_1AQtV1XianG3vV9WkPhoMg8UQCevHFrpHr): Мне поебать кто захватит власть, главное что бы кусок урвать хоть как кой то чем терпилой быть в этой помойки ебучай.России той благородной уже нету, люди друг друга кидают на бабки, одни машенники круго, всем похуй друг на друга. И все потому что люди голодают они не могут помогать друг другу, и за всем стоит ЭТА МРАЗЬ ПУТИН!!!\n\nТы хоть русский язык выучи для начала. В каждом посте по несколько ошибок. Мамкин революционер, лол.",
				"added": 1590917307
			},
			{
				"comment_id": 122,
				"body": "> [nahnah](#comment_3_1AQtV1XianG3vV9WkPhoMg8UQCevHFrpHr): Пока ты терпила будешь планировать революцию тебя застрелят нахуй как долбаеба.\n\nА тебя просто застрелят более умные люди, когда ты там революционировать будешь.",
				"added": 1590917417
			},
			{
				"comment_id": 123,
				"body": "> [nahnah](#comment_4_1AQtV1XianG3vV9WkPhoMg8UQCevHFrpHr): Хуй соси хачик\n\nНу вот, видишь - тебе нечего сказать аргументированного. Это последняя стадия - когда ты обосрался и тебя ткнули мордочкой в твоё же дерьмо, тебе нечего сказать и ты просто высераешь рандомное оскорбление. Поздравляю, ты слился перед неопровержимым фактом.",
				"added": 1590917537
			},
			{
				"comment_id": 124,
				"body": "> [nahnah](#comment_3_1AQtV1XianG3vV9WkPhoMg8UQCevHFrpHr): Пока ты терпила будешь планировать революцию тебя застрелят нахуй как долбаеба.\n\nКогда ты говоришь про революцию, то ты говоришь о ней именно в контексте выгоды для себя. Не в контексте какого-то благого дела, не в контексте высоких идеалов по построению новой страны и нового общества. Тебе просто обидно, что там чинуши жируют, а ты хуй без соли доедаешь.\n\nПроблема России в том, что в ней много таких вот как ты - эгоистичных и обиженных. В том числе и у власти. Когда такие как ты дорываются до власти - становится ни чем не лучше, а только хуже. Ведь ты ничем не лучше того же Путина и всех этих наворовавшихся чиновников. Ты такой же. Такой же гнойник на теле страны и общества. Если бы ты дорвался до власти, то был бы таким же казнокрадом и также бы обворовывал страну и народ. Революция тебе нужна не для благих дел, не для созидания, а для того, чтобы урвать себе кусок, пока все будут разворовывать и разрушать то, что ещё осталось.\n\nПоэтому я и говорю, что такая революция не нужна. Нужна та, которая позволит сделать общество созидающим и справедливым, а не та, которую хочешь ты - плевать что и как и сколько и кого погибнет, лишь бы тебе урвать свой кусок от наворованного, а там хоть трава не расти, да и вообще пусть хоть вообще вся страна погрязнет в войнах и хаосе, ты просто свалишь за бугор в тёплое местечко.",
				"added": 1590918697
			},
			{
				"comment_id": 125,
				"body": "> [fireinside](#comment_1_1K6GgFxLQ5n1U2oAsrkVoGqmr2K8C2egJ4): Заставляя абсолютно всех носить маски\n\nБабуля чрезмерно ответственно подошла к приказу властей носить маски:\nhttps://www.youtube.com/watch?v=G5Wz_Cb8RzA",
				"added": 1590941176
			}
		],
		"1590598686_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 103,
				"body": "Что такое \"Обсуждение в разделе «Ваши проекты.», начал(-а) Bo0oM, 6.09.2019.\"?\nЧто уже настолько лень, что даже название здесь нормально написать никак нельзя?",
				"added": 1590605808
			}
		],
		"1590655214_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 104,
				"body": "> [jk7](#comment_68_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Уже и в даркнетах кроме путисосов никого не осталось?\n\nГде вы там видели путисосов?\nВы видео вообще смотрели? Если не смотрели, так зачем позоритесь и несёте ахинею какую-то?\nАвтор видео вообще-то из оппозиции и даже близко не поддерживает Путина и российскую власть.\nОн просто историк и разложил всё по полочкам. У него есть такое же видео (даже два) и про российскую пропаганду в учебниках по истории. В этом видео он неоднократно об этом говорит. Кроме того, во многих моментах я с автором не согласен и далеко не со всеми его видео я разделяю точку зрения. Просто это видео весьма интересное и стоит его посмотреть даже для общего ознакомления с представленной информацией.\n\nВот вы типичный представитель тех, про кого я написал в основном сообщении этой темы. Если кто-то что-то про Украину говорит отрицательное, значит сразу мудак и путисос. А что, про Украину можно либо хорошо, либо ничего? Хорошие и умные только те, кто говорят то, что вам приятно? Вы сами осознаёте насколько эту тупо и маразматично? Адекватно воспринимать критику - признак наличия у человека зрелого интеллекта.",
				"added": 1590733847
			},
			{
				"comment_id": 109,
				"body": "> [jk7](#comment_69_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Пиздец - проебали зеронет!Сука, влажная рука товмайора везде доползёт - расходимся! Пора штудировать уроки.\n\nПока не проебали, но скоро можем проебать, если такие неадекваты как ты тут начнут плодиться.\nПовторюсь - ты просто балаболишь и несёшь ахинею или можешь аргументировать?\nПо теме-то можешь что-нибудь сказать? Что-нибудь, пусть хоть не очень умное, но хоть немного адекватное есть в твоей голове? Пока твои комментарии больше похожи на бред параноидального шизофреника.",
				"added": 1590821593
			},
			{
				"comment_id": 132,
				"body": "> [tomoki](#comment_15_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX): Зі своїм північним \"братом\" розмовляю тільки  матом.Вибачай \"родной народ\" заєбали, хуй вам в рот!\"\n\nКак это относится к теме видео о лжи и пропаганде в учебниках истории?",
				"added": 1591172386
			},
			{
				"comment_id": 138,
				"body": "> [manyfaces](#comment_5_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81): Русь-Украина)Окраина Русиможет хоть так?\n\nНе знаю. Там нет такой информации. И если и звучит и пишется похоже, то это совсем не значит, что Украина === Окраина.",
				"added": 1591442161
			},
			{
				"comment_id": 140,
				"body": "> [eoeo](#comment_1_142FMMWp3EWtvPhh3n7DfaJikCxcRcKUKP): Что тебя не устраивает? хороший кацап - мёртвый кацап.\n\nКак это относится к теме видео о лжи и пропаганде в учебниках истории?",
				"added": 1591952183
			},
			{
				"comment_id": 146,
				"body": "> [pc98](#comment_1_13d7Bjb673ucbRsZjrYTyVNfnCiDFu8wSN): Свинособакі живуть у багнюці, а плачуться на те, що вільна Україна існує й розвивається. Дебіли, ... (с)\n\nКак это относится к теме видео о лжи и пропаганде в учебниках истории?",
				"added": 1595005331
			}
		],
		"1590350740_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 111,
				"body": "А что в этом хорошего вообще может быть?\nСтранный вопрос вообще... В любом случае это плохо во всех отношениях и со всех сторон.",
				"added": 1590865606
			},
			{
				"comment_id": 139,
				"body": "> [manyfaces](#comment_4_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81): а собственно, что плохо?ведь так гораздо удобнее? нет?\n\nУх, походу опыта у вас плохого не было.\nНаличка она и есть наличка. Карта - это какие-то виртуальные деньги, которых у вас нет.\nК примеру, сбой в базе данных и приплыли. Банки и государство видят сколько вам поступило и где и на что вы потратили. Банки говорят, что они типа ничего не отслеживают, но вот буквально на днях в интернете гулял пост, где видно, что банк даже знает, что вы покупали. Может быть бутылку пива, хоть огромное дилдо в секс-шопе. Они собирают аналитику и всё сохраняют в базе данных. Они видят как вы зарабатываете и как вы тратите. Создают ваш виртуальный портрет - ваши привычки, ваши любимые вещи, ваш образ жизни.\nИли вот был прикол несколько лет назад - пожилая женщина решила сыну на свадьбу подарок сделать. Пошла в банкомат снять 50 тыс. рублей с карты. Сбербанк посчитал, что снятие денег очень подозрительно. Карту заблокировали. Ведь раньше женщина никогда не снимала такие суммы с карты. По-любому какая-то подозрительная активность. Ну ладно, хорошо, банк вот такой молодец - пресёк подозрительную активность. Ну так женщина же обратилась, подтвердила, что это она - дайте человеку деньги и разблокируйте карту. Но нет, там у них расследование, подозрение на отмывание денег, финансирование терроризма и всякое подобное. В итоге женщина осталась без денег и карты на месяц. Только через месяц карту разблокировали. При этом весь этот месяц Сбербанк пользовался деньгами этой женщины и никакой ответственности не понёс. А свадьба у сына прошла, да. Только мама на свадьбе у сына обломилась.\nА сколько было историй, когда судебные приставы блокируют счёт или списывают с карты деньги за несуществующие штрафы? И ты потом несколько месяцев будешь через суд доказывать, что они охренели.\n\nУдобно да? Одни плюсы? Тебя имеют как хотят и власть может использовать это даже как инструмент давления - не нравишься ты им - заблокировать все твои карты под любым предлогом и всё.\nЯ не спорю, что это удобно, только не для людей, а для власти, чтобы управлять людьми и держать рабов в узде. Очень удобно.",
				"added": 1591442918
			}
		],
		"1590837476_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N": [
			{
				"comment_id": 112,
				"body": "> [zombibi](#comment_6_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): https://collapseos.org/ отакое надо!\n\nЭто вообще не к этой теме =)",
				"added": 1590865744
			},
			{
				"comment_id": 113,
				"body": "> [zombibi](#comment_8_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): медленно(не очень то и медленно) и уверенно микрософт переходит от продажи товаров (програмного обеспечения) к продаже услуг - облако, да хотя бы тот же оффис365. от ие уже отказались в пользу прямого конкурента, хрома. ну и кому спрашивается нужен клон, когда оригинал не очень то востребован.\n\nНу, поверьте, ещё рано хоронить десктопные ОС. Правда ReactOS ну... такое себе...",
				"added": 1590865860
			},
			{
				"comment_id": 114,
				"body": "Моё личное мнение:\nНе думаю, что ReactOS действительно нужная ОС. В чём смысл? Старую винду и так пиратят, а ReactOS до каких-то особых высот современной винды так и не дошла. Для чего?\nТакже и про HaikuOS. Обожаю BeOS, мечта и легенда. Но то было в 2000 году. А теперь это просто проект для энтузиастов. Реально жить на HaikuOS невозможно. Сам пробовал. Ну просто реально никак.\nЕсли не Windows, тогда уж Linux какой-нибудь комфортный юзать и всё. Ну, MacOS как бы типа не рассматриваем как обособленную ось для обособленных устройств.\n\nСам более 20 лет использую Linux и около 15 лет это моя основная ОС. Мне нравится. Комфортно. Полёт нормальный. У жены Windows 10. Мне в Windows неудобно. Ну это просто как-то отвык. В Linux можно всё делать как-то быстро и привычно, а в Windows надо какие-нибудь специальные утилиты устанавливать для разных \"недомохозяйских задач\". Но, при этом люди, которым привычнее Windows, говорят, что Linux это пиздец как неудобно и вообще говно. Дело привычки, квалификации и области деятельности, наверное.\n\nА ReactOS что даёт? Вот реально для чего? Очередной проект энтузиастов, но, в отличие от Menuet, Kolibri, Syllable, Haiku, Icaros и прочих всяких, имеет преимущество в виде \"дохренища старого софта для Windows\". Но вот реально то оно ведь такое себе... Организации использовать не будут, а дома тоже будут только энтузиасты и использовать. Реально как Haiku - проект ради того, чтобы был проект. Просто людям прикольно, людям нравится. Практического смысла никакого.",
				"added": 1590866736
			},
			{
				"comment_id": 115,
				"body": "> [zombibi](#comment_9_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): в смысле пользователя. что дает виндовс?(массово) оффис, приложения с ним связанные, таже самая бухгалтерия, игры.  в текущий момент - хорошо или плохо реализовано на андроид (оффисные приложения), игры - не хуже.задачи не массового использования системы - кад, сапр. программирование - понятное дело, связанные именно платформой виндовс. можно придумать кучу задач весьма специфических. т.е. что то типа aix - до сих пор живет в узком кругу. какую то узкую нишу виндовс возможно и будет занимать, но то что было раньше - уже не будет. а реактос - клон виндовс, с вытекающими из этого.\n\nНу так последние 10 лет и идут эксперименты по созданию универсальных ОС. Вон 8-ку как замучили тоже. Да и Windows 10 идёт с намёком на использование на планшетах. Операционные системы просто будут работать как на десктопе, так и на мобильном устройстве - универсально.\n\nА что касается ReactOS - так там главное - это ядро и подсистемы для работы с железом. Интерактивную оболочку для общения с пользователем всегда можно поменять и под сенсорные экраны на всяких там планшетах.\n\nПомню в конце 90-х выходило много альтернативных графических окружений для Windows 98. Просто в реестре прописываешь вместо explorer.exe какую-нибудь другую программу my-desktop.exe и всё, у тебя совсем другой рабочий стол и т. д. Прикольно было, баловался. То какой-нибудь типа Mac сделаешь, то какой-нибудь Unix, то вообще ещё что-нибудь дизайнерское с какими-то непонятными панелями, выезжающими от краёв экрана и никаких там кнопок \"Пуск\" не было. Уже точно не помню как называлась тогда система окружения рабочего стола, но она поддерживала всякие разные скины и скрипты с плагинами. Там можно было такое вытворять из Windows 98, что просто жесть. При этом оно не тормозило и память особо не жрало.\n\nЯ не очень углублялся как там у них в ReactOS дела с архитектурой, но, может быть они там и на ARM допилят и сборку сделают. В этом плане я не думаю, что есть большая проблема. Вопрос в другом - а нахрена это всё? Нахрена вообще ReactOS, даже если она сможет и в десктоп и в мобайл?",
				"added": 1590870177
			},
			{
				"comment_id": 116,
				"body": "> [zombibi](#comment_12_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): прямо скажем - попытки сесть в уехавший паравоз очень сильно напоминают перенос виндовс на мобильные платформы. что касается виндовс. если взять мануал программирования по vms/openvms,то к удивлению набор ioctl по названиям совпадает с виндовс. и разрабатывался виндовс NT под процессоры alpha2 конторой под названием диджитал (давно уже там). после развала вышеуказанной, билли очень удачно перекупил подразделение которое занималось разработкой ос. родное микрософт - винд 3.11, от NT - как небо от земли. в дальнейшем, уже в микрософт перенесли NT на x86. т.е. к чему это я - виндовс новизной не блещет, идеями тоже. максимум нишевое существование. реактос... смысл в нем? совместимость? тогда с чем?\n\nНу, Windows 3.11 это не полноценная ОС, это оболочка для DOS. При этом были и другие такие оболочки, просто они всеми давно забыты. Если поинтересуетесь - найдёте как минимум штук 5 альтернатив Windows 3.x даже с более красивым графическим интерфейсом и для них тоже был набор стандартного офисного софта и прочей шелухи. Просто у мелкософтов были возможности вывести Windows 3.x в народ, а остальные безвременно почили. Сравнивать это с NT это просто как сравнивать санки с японским снегоходом.\n\nА в плане ReactOS - а зачем вы мне задаёте этот вопрос? Я же сам написал его изначально - в чём смысл ReactOS? Не знаю. С самого первого своего поста в этой теме я говорю, что это проект для того, чтобы увлечённые энтузиасты и студенты баловались. Никакого практического смысла в нём нет.",
				"added": 1590871725
			},
			{
				"comment_id": 117,
				"body": "> [zombibi](#comment_13_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): м$ dos, cp/m, os/2 - это полноценные ос:). многозадачности в них в полном смысле слова не было. но на 64кб оно и не сильно было нужно. в 3.11 в виде эмуляции присутсвовала многозадачность. а про реактос - я полностью согласен. как способ убить личное лишее время - может быть. но практического смысла система не имеет.\n\nНу не обижайте OS/2 Warp 4. Очень неплохая система была. Куда лучше, чем Windows 95. Хоть и намного сложнее.",
				"added": 1590873152
			},
			{
				"comment_id": 118,
				"body": "> [jk7](#comment_78_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): ReactOS дает нам wine, что очень хорошо и годно.\n\nЗдесь речь немного не об этом. Речь о том, что десктопный сегмент плавно вымирает. Соответственно и в wine не будет никакого смысла. Но на данный момент да, хорошо и годно.",
				"added": 1590916034
			},
			{
				"comment_id": 127,
				"body": "> [undyingfirewall](#comment_16_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Не Talisman случайно? Всё думаю что-то такое поставить, но на XP с семёркой и опенсорсное.А то в последней Explorer.exe уж больно нестабильный какой-то стал. XP - так, за компанию ради винды-Франкенштейна, в которой всё, что можно, заменено опенсорсом (помнится, Haiku так и делали, IMHO поэтому дальше ушли). Emerge Desktop, вроде, норм, LXDE напоминает... [...]\n\nTalisman я помню. Но нет. Та, про которую я говорю как-то на букву \"L\" вроде бы называлась. У меня был целый диск с разными, поэтому много в то время перепробовал. Но, это было так давно. Около 20 лет прошло, поэтому уже и не вспомню.\n\nЧто вы сказали про Haiku я не понял.\n\nEmerge Desktop никогда не видел. Это уже относительно новое. Уже более 15 лет как на Linux и мне это всё для Windows как-то без надобности. Но посмотрел на SourceForge - выглядит вроде интересно и модулями расширяется.\n\nИнтересно, почему http://emergedesktop.org/ заблокирован Роскомнадзором? Там-то чего криминального они нашли? :D\n> Доступ к информационному ресурсу ограничен на основании Федерального закона от 27 июля 2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации».\n\nЧто? =)",
				"added": 1591033144
			},
			{
				"comment_id": 128,
				"body": "> [zombibi](#comment_17_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): http://emergedesktop.org/ выдает 404, заходил через tor. https://en.wikipedia.org/wiki/Emerge_Desktop и выгрузка с sourceforge работает. последние обновления - 5 лет назад. издохло по той же причине что и реактос. не успели за обновлениями виндовс.\n\nДа, там 404. Так я и не говорил, что сайт работает, а говорил, что он заблокирован Роскомнадзором.\n\nНе вижу никакой связи с тем, что они сдохли по той же причине, что и ReactOS. За какими обновлениями Windows им вообще нужно было успевать? Им в принципе не надо ни за какими обновлениями успевать. Это просто оболочка и она ни от каких обновлений Windows не зависит. Это просто такая альтернативная среда со всякими плюхами и свисто-перделками и успевать за Windows им нужно ровно столько же, сколько любой обычной программе для Windows - т. е. вообще никак не надо никуда и ни за чем успевать.\n\nДругой вопрос - возможно, в Windows 10 уже нельзя выпилить системный Desktop и заменить его своим. Но это я не проверял, ибо мне как-то безразлично по самой сути отсутствия у меня Windows.",
				"added": 1591090172
			},
			{
				"comment_id": 130,
				"body": "> [zombibi](#comment_19_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): ну как раз связно, слегка так. попробуй убери дефендер из виндовс. тоже самое и с плиточным гуи.\n\nНет. Никак это не связано. Причём тут \"Emerge Desktop не успевает за обновлением Windows\"? Проблема тогда не в том, что он не успевает, а проблема в том, что Microsoft заблокировали эту возможность, в связи с чем существование альтернативных оболочек стало бессмысленным. Проблема ведь не в успеваемости. Вопрос успеваемости подразумевает, что вот в данный момент ещё не успели, но можно догнать попозже, а здесь уже совсем другая история. В ReactOS связано, а в Emerge Desktop нет. Emerge Desktop это обычная программа как Firefox, Total Commander, AbiWord и т. д. - им не надо никуда особо успевать - они и 10-летней давности работают сейчас точно также как работали тогда и ничего не изменилось.",
				"added": 1591171661
			},
			{
				"comment_id": 134,
				"body": "> [zombibi](#comment_23_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): менеджер завязан на системе, интересно запустить explorer.exe с xp в windows 10\n\nНет, никак вообще не завязан даже близко. Точнее не обязательно и в большинстве случаев вообще никак не завязан. Это explorer.exe часть системы и если его заменить на explorer.exe из другой винды, то могут быть проблемы, а мы говорим об альтернативных оболочках - это обычные программы без претензий.\nВместо explorer.exe можно было запустить любую программу, хоть Notepad и он загружался вместо интерфейса винды. Блокнот на системе завязан? Нет. Так и вот эти альтернативные оболочки - это обычные программы и ни на чём они завязаны не были и по прошествии 10 лет так же как обычная программа запускались они и работали. Другой вопрос, что некоторые компоненты/модули бывают берут какие-то данные из системы для более глубокой интеграции и они могут не работать в более новой винде. Но это далеко не во всех оболочках так. При этом оно никакого отношения не имеет к тому, что \"они не успевают за обновлением винды\". Там им не надо успевать. Им не надо реверсинжиниринг делать как для ReactOS. Всё, чем эти менеджеры пользуются, это стандартные документированные функции, они есть в документации разработчика, за ними не надо успевать и куда-то бежать. Microsoft их сами тебе дают бесплатно.\n\nНо, как я уже говорил, речь про Windows 95, 98, Me, XP, Vista, 7. Возможно, в Windows 10 уже просто нельзя заменить окружение рабочего стола на альтернативное (я не знаю, не пробовал, у меня Windows только у жены на компе). Может быть там оно глубоко интегрировано в систему и поэтому обычные альтернативные оболочки просто потеряли смысл. Но дело ведь не в том, что они не успели, а в том, что они теперь просто не работают в принципе.",
				"added": 1591256099
			},
			{
				"comment_id": 137,
				"body": "> [zombibi](#comment_24_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): та я понимаю, что менеджер выполняется в контексте пользователя а не ядра;). но как бы есть ньюансы. и чтоб оно запустилось эти ньюансы надо всунуть в \\windows\\system32*.dll . что так бы нарушит работу остальной части системы (скорее всего так произойдет). ставить в эмуляторе xp а потом переносить explorer.exe в 10-ку;))... я еще не перешел на этот уровень;))).\n\nВы уходите от темы. Мы не говорим об explorer.exe, а, напротив, говорим об альтернативных вещах, которые внутренне не связаны с системой вообще никак. Вы же постоянно зачем-то продолжаете про explorer.exe говорить снова и снова. Забудьте уже об этом. Мы не об этом говорим.",
				"added": 1591380286
			},
			{
				"comment_id": 144,
				"body": "> [undyingfirewall](#comment_17_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Тогда LiteStep... LDE(X)... Интересно, если честно. [...]\n\nКажется LiteStep. Вроде бы оно.",
				"added": 1592160132
			}
		],
		"1591001587_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 126,
				"body": "У них, конечно, жесть, но что-то я не уверен, что хорошо в России.",
				"added": 1591014734
			},
			{
				"comment_id": 143,
				"body": "> [sasf](#comment_2_14J86cXBPiTz2SNcdCJRNkEYFTd59SCRCc): Где ты там мясо увидел долбаеб, они живут как люди а ты как раб на галерах.Даже рабы раньше в США лучше жили, ну или так же работали за еду.\n\nВо-первых, откуда вы знаете как живёт ваш незнакомый собеседник? Вы шизофреник или ясновидящий?\nВо-вторых, откуда вы знаете как в США жили рабы? Вы были рабом в США?",
				"added": 1591978725
			}
		],
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 129,
				"body": "Типа чисто как рация чтобы? (Сорян, давно не видел Zello - последний раз лет 7 назад оно было как рация).",
				"added": 1591090405
			},
			{
				"comment_id": 131,
				"body": "> [satoxyn1](#comment_23_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Да, вроде, практически любой такое позволяет: WhatsApp, Viber, Telegram, Conversations. Интересует что-то конкретное?\n\nНу человек хочет:\n> опенсоурс\n\nПоэтому WhatsApp и Viber сразу не подходят. А Conversations разве умеет в голосовые сообщения?\n\n> p2p интересует а не ватсап с телеграмом\nНу тогда тем более =)",
				"added": 1591172147
			},
			{
				"comment_id": 133,
				"body": "Open Source, так понимаю, это принципиально?",
				"added": 1591172451
			}
		],
		"1591279603_1B6Dst2LKNmG3yPZXnXc73c3qgiJzmLVNW": [
			{
				"comment_id": 135,
				"body": "> Но без тебя вас не сможем этого сделать.\n\nШта?\n\nИ вообще, кто писал этот текст? Это же ужас какой-то.",
				"added": 1591338307
			}
		],
		"1591016723_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 136,
				"body": "> [diomas](#comment_11_1PAnNhncRpwtUsy82YbLd7iBJHxTadBaUd): это еще зачем?\n\nВы сами осознаёте странность вашего вопроса?\nЭто разработка Siderus. Зачем же разработчику не включать в свои разработки свои разработки, да?",
				"added": 1591339126
			}
		],
		"1591860854_1HHNSMVnDWhbMLHohUAQnh4kjF9ZYwdiUc": [
			{
				"comment_id": 141,
				"body": "Наркоманы?",
				"added": 1591952848
			},
			{
				"comment_id": 142,
				"body": "> [sasf](#comment_1_14J86cXBPiTz2SNcdCJRNkEYFTd59SCRCc): А причем тут регистрация или какие то юридические действия?Народ грабят мы живем в памойки а вы верите в эти бумажки, уже всем должно быть похуй, идите жопу подотрите этой бумагой и конституцией РФ\n\nЕсли вы живёте \"в памойки\" (кстати, а что это?), то соболезную. А так - чтобы говорить про бумажки, вы сначала научитесь писать по-русски. И что вам не нравится в конституции РФ? Можно аргументировать?",
				"added": 1591978520
			}
		],
		"1594971941_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 145,
				"body": "Так боян же уже? Они это ещё в прошлом году предлагали. Что-то ажиотажа за столько времени так и нет.",
				"added": 1595005200
			}
		],
		"1608113656_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": [
			{
				"comment_id": 148,
				"body": "> [dsfsdfsefcxvxcvc](#comment_19_16JByxcaVSnx4QiPAXHjuV6hzi44uNoWCD): Если это не клевета или лож то -Дмитрий Вяткин видимо не в курсе что Конституция РФ ст.2  ст.3п.1 п.2  позволяют прямо указывать и тыкать носом депутатов, меров,губеров..http://www.consultant.ru/document/cons_doc_LAW_28399/249eba46b69e162f87771713b6e37fb0780f2c40/Статья 3  [...]\n\nНе понял. А в каком месте Дмитрий Вяткин попадает под статью?",
				"added": 1610234295
			}
		],
		"1610194627_1P9CEmiWGKNCTWpqJvugcYtuNF4WPQheQ6": [
			{
				"comment_id": 149,
				"body": "Вы у них паспорт спрашиваете?",
				"added": 1610235499
			}
		],
		"1609441034_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 150,
				"body": "> [topnet](#comment_120_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Вы ставите этот плагин а он отправляет статистику о недоступных сайтах на которые вы не смогли попамть а проверяет правомерность блокировки и борится\n\nНичего не понял. Кто проверяет правомерность блокировки? Кто с кем борется?\nЧеловек спросил можно ли поподробнее что за сотрудничество с мусорами из ФСБ у Роскомсвободы, а у вас очень сумбурный комментарий по которому вообще не понятно о чём речь.",
				"added": 1610287305
			}
		],
		"1610089549_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": [],
		"1599993973_1LBxgBiCcnTFh4mEyaF3ycmPY2ciC3c3Kj": [
			{
				"comment_id": 152,
				"body": "> [ufsyrsd](#comment_1_1NAKLn9xzrNZmRPA97wsxipCSZFddj2SE9): Попробовал. Никакой инфы. Как и все российские разработки пытались украсть дизайн с аськи. Мне так кажется, что фигня... Ждём статей по \"экстремизму\" от пользователей этой \"утопи'и\"\n\nВсе российские разработки пытались украсть дизайн с аськи? Шито?",
				"added": 1610988068
			}
		],
		"1611429057_12Lwi45PLwYpZHFJ2NdQNE1G1PeraTopV7": [],
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 156,
				"body": "> [praid256](#comment_2_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg): А может давай забаним jk7, шизик он какой-то\n\nВообще, я как бы не в теме, не вникал, но вроде как тут нет функционала модерирования и бана. Т. е. как бы \"нет цензуре\" же. Или я неправ?",
				"added": 1612267573
			}
		],
		"1_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": [
			{
				"comment_id": 157,
				"body": "> [topnet](#comment_122_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Есть еще лутше альтернатива Snappy Driver Installer Origin  https://www.snappy-driver-installer.org/\n\n\"лутше\" будет когда ты писать научишься\nА потом ещё лучше будет, когда ты поймёшь, что это всё одна херня.",
				"added": 1612637913
			}
		],
		"1612183359_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 158,
				"body": "> [topnet](#comment_124_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Да гавно они все сделаны по принципу разделяй и властвуй\n\nТы умнее? У тебя есть варианты? Ты создал что-то лучше?",
				"added": 1612638253
			}
		],
		"1612510082_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 159,
				"body": "А где и кто запретил скачивать видео? Автор, если запретил, то почему он выкладывает его на публичный доступный ресурс, где скачать может кто угодно? Автор идиот или держит других людей за идиотов?\nИ кто такой Ордин? Знакомый ваш?",
				"added": 1612639264
			}
		],
		"1612171411_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 160,
				"body": "> [praid256](#comment_8_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg): Не всегда же мне держать ПК включенным. Да и айпи меняется постоянно, с перезагрузкой роутера.\n\nВ чём проблема сделать, чтобы IP не менялся?",
				"added": 1612639528
			}
		],
		"1612616752_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 161,
				"body": "О, ништяк, у нас ещё один наркоман. Теперь jk7 не одинок. Веселее будет.",
				"added": 1612639922
			}
		]
	},
	"comment_vote": {
		"261_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"55_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"133_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"289_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"294_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"293_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"307_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"49_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"3_1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv": 1,
		"137_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"2_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": 1,
		"3_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": 1,
		"4_1PTQGb5VUyuPnY2i9fah56KowV2gpEHzBu": 1,
		"35_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": 1,
		"16_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X": 1,
		"19_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": 1,
		"24_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": 1,
		"42_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"1_1NBNERTBMdF2rXDuRJGNtn14Jh5RthCDRN": 1,
		"70_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"6_1NBNERTBMdF2rXDuRJGNtn14Jh5RthCDRN": 1,
		"14_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": 1,
		"40_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": 1,
		"1_1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC": 1,
		"25_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"4_1P49qK814LXkWtXWu9PvWEwDQC7iDagpGV": 1,
		"2_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": 1
	}
}