{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 47,
	"comment": {
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "+ЛОР-овца. Бе-е-е-е! :D",
				"added": 1515203248
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_160_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тупая первоапрельская шутка сегодня на ЛОРе. «Ваша ОС не поддерживается» и невозможно ответить :)\n\nШутка боянистая, когда-то с Opera Mini постинг не работал... Правда, только тредов.",
				"added": 1522593046
			}
		],
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": [
			{
				"comment_id": 2,
				"body": ">Периодически нужно\nНе нужно.",
				"added": 1515204089
			},
			{
				"comment_id": 3,
				"body": "> [tsubame](#comment_3_1AnHAaYBr8QjiCxL3ZYnYHKxL9Wd18zgdH): пруф или конформист\n\nПруфать надо нужность. По умолчанию всё ненужно.",
				"added": 1515278506
			}
		],
		"2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 4,
				"body": "При выгрузке файла побить его на чанки, посчитать чексуммы и хранить у себя; периодически запрашивать рандомный чанк, если пришла какая-то фигня — накладываем санкции ☺",
				"added": 1521053646
			},
			{
				"comment_id": 5,
				"body": "Упс, не заметил, что в комментах такое уже есть/",
				"added": 1521053769
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 6,
				"body": "> [ozzeransky](#comment_9_1B5yLEudL6QUA9XmLTuc24QKXPYcCDmb7K): Однажды сняли 10 скора за эту аватарку: https://www.linux.org.ru/photos/121269:1377994879.jpg . Т.е. то что у многих на аватарках всякий треш и непотребщина, это норм.\n\nНо не цопэ (по российским законам). Я не удивлюсь, если скоро за фоточки голых младенцев в соцсетях начнут сроки впаивать. Не зря суеверные бабки не одобряют сие, ой не зря... И с \"писающим мальчиком\" будет то же, что с произведениями, упоминающими свастику.",
				"added": 1521054215
			},
			{
				"comment_id": 7,
				"body": "> [intervi](#comment_1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk): много трафика идёт с поисковиков\n\nУвы, форумы как формат уходят в прошлое. В рунете этот формат изрядно закрепился благодаря длительному преобладанию городских локалок с местными форумами и дорогим трафиком \"наружу\" — и даже несмотря на это, начал тоже уходить на покой. На моих глазах ресурсы досоцсетевой эпохи умирают один за другим — кто превращается в архив без активности, кто вообще отключается. Массы всё больше тяготеют к централизации, андерграунд наоборот — растекается постепенно по чатикам и даркнету. Такими темпами лет через 10 из поисковиков некуда будет приходить, заходишь — а там пустырь, на котором по новым вопросам никто уже не поможет.",
				"added": 1521054741
			},
			{
				"comment_id": 8,
				"body": "> [promusik](#comment_8_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): ЛОРовцы жопу вообще редко отрывают. Одни орут социалочки не нужны, а другие жрут все в подряд. Ни тем ни другим ZeroNet не нужен. Вот в этом вся и проблема.\n\nНу почему же, я к первым отношусь, и вот он я.",
				"added": 1521928077
			},
			{
				"comment_id": 10,
				"body": "> [pozya](#comment_15_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Потому что не социалочка?)\n\nИменно!",
				"added": 1522594786
			}
		],
		"1537644529_161s6hKbhaHsCo96nivkFpAQ1Ff2SDTEUk": [
			{
				"comment_id": 11,
				"body": "> [blazingeye](#comment_1_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Полная приватность за неимением нормальной поддержки JS.\n\nРазмечтались, ага ;-) https://www.opennet.ru/opennews/art.shtml?num=47902 Правда, там и поддержка CSS такая убогая, что многое из описанного работать не будет.\n\n> [blazingeye](#comment_1_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Firefox и Chrome всё равно держать придётся, так как можешь наткнуться на сайт, который без них не работает.\n\nА что, есть сайты, которые не работают в Chrome, но работают в Firefox? IMHO, одно звено тут лишнее. Скорее IE под Wine вдобавок нужно держать, ибо на ActiveX нарваться можно, если знать, где искать, да и просто писанные под специфические JS-методы IE скрипты, которые нигде больше не работают, кроме, возможно, старых Opera. И хоть какой-нибудь браузер с поддержкой NPAPI-плагинов — точно не Firefox Quantum, потому что из него поддержку плагинов выкинули, и не NetSurf, потому что её там и не было.",
				"added": 1553880585
			},
			{
				"comment_id": 12,
				"body": "> [blazingeye](#comment_2_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): в текущем виде веб сам небезопасен\nЖить вообще страшно — мало ли, кирпич на голову упадёт или маньяк ножом пырнёт.;-) А ещё сервер пишет IP-адрес в логи, без всяких там JS, CSS и даже HTML, достаточно курлой ткнуть — ужас-то какой!\n\n// Чего этот ваш зеронет вдруг начал данные гонять активно? Придётся вырубать, а то того и гляди — ядро ронять начнёт.",
				"added": 1554315027
			},
			{
				"comment_id": 13,
				"body": "> [blazingeye](#comment_3_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): пытаются идентифицировать конкретного пользователя, когда он не даёт на это явного разрешения\n\nЭто не техническая проблема, а юридическая. Даже без технических средств для слежки может завестись какой-нибудь нетсталкер, который будет ходить за тобой по пятам и насобирает инфу по любым зацепкам, как ни скрывайcя. И решит её только скорейший переход к открытому обществу. Приватность — не нечто естественное для человека, в мелких деревнях никакой приватности нет, односельчане знают о тебе всё и следят почти круглые сутки.",
				"added": 1555276685
			},
			{
				"comment_id": 14,
				"body": "> [blazingeye](#comment_5_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): где кто угодно может завестись\nИнформационная эра как раз способствует тому, что всякие прохиндеи могут быть вычислены и получают общественное порицание независимо от размера сообщества. Информация распространяется в Интернете с бешенной скоростью; всякие \"права на забвение\" технически нереализуемы. Внедряются уже и более целенаправленные решения для искоренения общественной заразы, типа системы кармы в Китае.\n>Приватность - это естественная особенность\nНет, приватность — следствие комплексов, а комплексы — психологическое расстройство. В открытом обществе скрывать нечего. Если человек делает что-то, в чём стыдится признаться другим — значит, сознательно делает что-то неправильно. Защитники приватности часто аргументируют паролями, закрытыми шторами и подобными вещами. Но пароли, токены и прочие внешние средства авторизации/аутентификации — временная техническая мира, которая нужна по причине отсутствия надёжного способа передать машине и защитить от подделок волевое усилие человека. Да и сами подделки имеют смысл до тех пор, пока мошенник может незаметно что-то совершить (с повсеместным внедрением блокчейна это станет нереальным). В мелких организациях начальники часто дают подчинённым доступ к своим аккаунтам, рабочим телефонам и т. п. — потому что злоупотребления легко выявить, и информационная эпоха, повторяю, позволяет отмасштабировать эту практику до мировых масштабов. Закрытые шторы — что за ними прятать? Награбленные ценности? Безнравственное поведение (мастурбацию и т. п.)? Сама возможность спрятаться за какими-то шторами — привилегия \"развитых\" обществ, где люди живут порознь; в бедных странах по десятку-другому человек на хибару, негде прятаться, человек всё делает на виду у других. \"Персональные данные\" — это вообще новомодная выдумка, всего 30 лет назад все адреса, ФИО, номера телефонов — издавались в телефонных справочниках, люди без колебаний публиковали свои домашние адреса для доставки почтовой переписки.",
				"added": 1555778147
			},
			{
				"comment_id": 15,
				"body": "> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Вот только почему-то именно прохиндеи так стараются нападать на нормальных людей.\n\nИ огребают в итоге. А лучше и вовсе предотвращать.\n\n> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Право на забвение - это то, что к приватности очень посредственное отношение имеет.\n\nГде грань между ними в условиях открытого общества?\n\n> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): И какую общественную заразу они истребляют?\n\nОчевидно, преступников.\n\n> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Это ведь настоящее психическое расстройство\n\nА нудистские пляжи — филиалы дурки?\n\n> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): двери/замки — временная техническая мера\n\nИменно так, турель с системой «свой/чужой» всяко эффективнее дверей и замков. Просто замки дешевле и проблем с легализацией у них меньше.\n\n> [blazingeye](#comment_6_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Копипаста нечегоскрывальщика.\n\nПук ярлыковешальщика.",
				"added": 1556262050
			},
			{
				"comment_id": 16,
				"body": "> [blazingeye](#comment_7_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Вот зачем ты врёшь?\n\nПочему вдруг? Ну кто не огребли — те либо мафия, либо вопрос времени.\n\n> [blazingeye](#comment_7_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Кури матчасть.\n\nМатчасть в студию, матчасть матчасти рознь.\n\n> [blazingeye](#comment_7_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Неочевидно.\n\nА кто ещё нарушает общественный порядок?\n\n> [blazingeye](#comment_7_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): там нет врачебного коллектива\n\nКто ж его туда пустит? Частная территория.\n\n> [blazingeye](#comment_7_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): турель превращает тебя в мясной дуршлаг\n\nОт упавшего кирпича содержимому башки тоже не поздоровится. Вот только сколько раз, например, AI успел угробить людей, а сколько живые водятлы? Автоматика не то чтобы шибко ненадёжная вещь, по сравнению с человеческим фактором, даже если при её разработке этот самый человеческий фактор фигурировал повсеместно.",
				"added": 1556729360
			},
			{
				"comment_id": 44,
				"body": "> [dimka511](#comment_1_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH): https://sphere.tenebris.cc/\n\nМда, то на LOR-NG эту мутную проприетарщину рекламировали, теперь и сюда добрались.",
				"added": 1576764461
			}
		],
		"1556782524_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": [
			{
				"comment_id": 17,
				"body": "Второго чебурнета не будет, ибо его негде будет устраивать.\n\nВ современном мире чрезмерная компьютерная грамотность уверенно становится преступлением. За что защитники исконного значения слова «хакер» борются, на то и напорются — всех загребут под одну гребёнку, не разбираясь — кто там банки взламывает, а кто просто готовые кастомы на мобилку накатывать любит. Пока этого не делают лишь потому, что айтишники слишком полезны и на них завязаны многие экономически важные вещи — но развитие информационных технологий наверняка приведёт к тому, что лишнее обслуживающее звено уйдёт: информационные системы обретут самочинимость и научатся воплощать в реальность даже мысленный понос в голове не умеющего формулировать требования гуманитария.\n\nВ таком будущем нет места не то что альтернативным компьютерным сетям (их попросту некому станет поддерживать), но и андерграунду в широком смысле слова. Инакомыслие станет выявлять и истреблять невообразимо просто, подавая это массам под соусом защиты свободы, как с лёгкостью проехал 9/11. Общество воспитывается в эту сторону: хомяки боятся высовываться за пределы уютненьких соцсетей, ибо там мошенники и вирусы; мода на пиратство ушла; трудноотслеживаемая наличка уходит в прошлое. Таким образом, за инакомыслящими не нужно высылать мифические газенвагены, достаточно сделать их «белыми воронами», которых изводит окружение. Это происходит уже сейчас, дальше будет только хуже. Криптоанархист 00-х — «компьютерный бог», криптоанархист 10-х — «нитакакойкакфсе фрик» с непонятными заёбами по поводу технологий.",
				"added": 1557077949
			},
			{
				"comment_id": 18,
				"body": "> [iormungard](#comment_1_18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk): школота и неадекаты возможно придут сюда когда-нибудь\n\nЯ уже здесь.",
				"added": 1557077996
			},
			{
				"comment_id": 19,
				"body": "> [iormungard](#comment_2_18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk): вот это поворот :)\n\nА что, кто-то ещё сомневается в моей неадекватности? Ну или, скажем так, в ограниченности ресурса моей адекватности?\n\n> [sathe5ae1ieche](#comment_2_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S): чтобы они не мешали обычным людям\n\nЯ об этом и говорю, компьютерная элита больше не имеет влияния на «обычных людей». Бабло в очередной раз победило зло в лице зацикленных лишь на социально-технических аспектах вещей истинных хакеров, шатающих своими заумными поделиями мировой порядок. Крипта уже сдулась путём пиара изначально ущербного и нежизнеспособного прототипа-биткоина и затмевания им более развитых криптовалют. Делайте ставки, что дискредитируют следующим. Торренты? Васянские бинарные патчи? Открытые стандарты типа USB (ибо допускают, например, флешки-убийцы)? Открытый Web? А может, на идею СПО как такового замахнутся?",
				"added": 1557240639
			},
			{
				"comment_id": 20,
				"body": "> [caryoscelus](#comment_6_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А есть такие, у кого этот ресурс неограничен?\n\nПо крайней мере, такие, кто умеет его исчерпание скрывать.",
				"added": 1557485398
			},
			{
				"comment_id": 21,
				"body": "> [sathe5ae1ieche](#comment_3_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S): Я надеюсь, ты хоть сейчас понимаешь, насколько глупо звучит прочтение твоего поста сейчас? Или нужно, чтобы биток вырос обязательно до 200 т. кусков зелени, чтобы звучало убедительно?\n\nНужно, чтобы этот изначально ущербный Proof-of-Concept, неустойчивый к централизации майнинга (то есть противоречащий идеологической сути криптовалют) закопали и дали дорогу более развитым. Собственно, он сам себя закапывал много раз, но каждый раз его обмазывали костылями и ехали дальше, в том числе ценой хардфорков.",
				"added": 1557837340
			}
		],
		"1525371830_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 22,
				"body": "> [calmaquesse](#comment_12_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Да, на основном десктопе, конечно. Понятно, что настройка сервера через консоль делается.\n\nА в чём принципиальная разница между сервером и десктопом? Особенно у разработчиков, где один и тот же софт сначала разрабатывается на десктопе, а потом деплоится на сервер?",
				"added": 1560941348
			},
			{
				"comment_id": 23,
				"body": "> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): удобочитаемыми настраивыми шрифтами\n\nfbterm.\n\n> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): современный браузер\n\nhttp://brow.sh",
				"added": 1560941427
			},
			{
				"comment_id": 24,
				"body": "> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): mpv\n\nРаботает во фреймбуфере.\n\n> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): sxiv\n\nfim\n\n> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): mupdf\n\nfimgs. Медленный, правда, зараза.",
				"added": 1560941521
			},
			{
				"comment_id": 27,
				"body": "> [if0](#comment_21_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): На сервере никогда не будет десктопных приложений и подавляющего большинства либ ими используемых\n\nЭто почему вдруг не будет? У меня стоят же. И, например, автоматическое тестирование в графических браузерах в рамках CI/CD — довольно распространённый кейс.",
				"added": 1561130824
			}
		],
		"1524945156_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 25,
				"body": "> [if0](#comment_17_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): знающим как поднять и настроить клиент Tor\n\nА чего там настраивать-то? `apt install tor` — и оно само прописывается в сервисы и запускается на стандартном 9050-м порту ;-)",
				"added": 1560942603
			},
			{
				"comment_id": 26,
				"body": "> [if0](#comment_23_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Или вы позволите этой бидонятине неизвесного происхождения свободно крутиться на вашей основной машине?\n\nА почему нет? Я к зондоозабоченным не отношусь, ставлю всё нужное подряд.\n\n> [if0](#comment_23_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Расскажите про apt обычным ползователям винды.\n\nВиндузятникам ещё проще — в установщик сразу запакована графическая конфигурялка (Vidalia, или как там её) и настроенная сборочка FF.\n\n> [mistalero](#comment_13_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что такого страшного содержит ZeroNet, что пугает ставить его на основной комп?\n\nНагружает систему, гоняет много трафика (в том числе исходящего, что может спровоцировать баг: https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=915416).\n\n> [if0](#comment_29_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Все неприменно обязаны использовать убунточку \"или страдать\"...\n\nЧего сразу убунточку-то? Во многих других дистрибутивах, в том числе не deb-совместимых, бинарные пакеты из репозитория тоже ставятся одной командой. Страдают только гентушники и любители обмазываться маргинальщиной.\n\n> [if0](#comment_29_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): То что не работают анкера при переходе другую на страницу и возврат на предыдущую страницу, что делает сайт полностью не работоспособным - для вас \"не серьезный аргумент\" не заслуживающий даже внимания. Приехали!\n\nДык написано же, что проблемы решаются помещением в подпапку `/raw`. Из чего проблему-то раздувать? Зайты изначально задуманы с определёнными техническими особенностями, отличающими их от клирнетовских HTML-сайтов; сфига они вообще должны быть с ними совместимы?",
				"added": 1561130671
			},
			{
				"comment_id": 28,
				"body": "> [if0](#comment_30_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И от такого размещения сразу станут работать абсолютные пути? [...]\n\nА сфига они вообще должны работать при переносе куда-либо? Они и при переносе с одного клирнетовского домена на другой клирнетовский домен работать не будут. На то и абсолютные. Аргумент уровня дополуторалетнего ребёнка, который наступил на коврик и не может понять, почему его с места сдвинуть не может.\n\n> [if0](#comment_30_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): поломать всю возможную совместимость со всем, что существовало до ихнего проекта\n\nЕсли в новую технологию закладываются принципы (децентрализация, в данном случае), которых в старых не было — лучше совместимость и не делать, потому что к старым технологиям их придётся прикручивать костылями, и где-то эти костыли непременно отпадут. Яркий пример — монопольный доступ к файлам POSIX и в Windows NT. В Windows NT он заложен изначально, а в POSIX нашлёпан костылями поверх: любая программа может обратиться к низкоуровневым вызовам и лок проигнорировать.\n\nHTML в ZeroNet используется просто потому, что его решено ради переносимости сделать браузерным (в отличие от, например, RetroShare, где куча нативных клиентов, а веб-морда до сих пор убогая) — поэтому приходится использовать браузерные технологии. Так же, как, например, в WhatsApp и HipChat взяли за основу протокола XMPP — просто для ускорения разработки, из этого никак не следует, что они обязаны обеспечивать S2S и даже совместимость с Jabber-клиентами. Могли бы даже не основывать и навелосипедить свою разметку и свой рендеринг поверх WebGL — но это заняло бы куда больше времени, а время не ждёт.\n\n> [if0](#comment_30_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Обычно программа делается для пользователей, а не ради некой \"гениальной концепции\"\n\nЭтот подход нельзя возводить в абсолют и устраивать охлократию, иначе пользователи будут продолжать хотеть более быстрого коня и развитие застопорится. Учитывать мнение пользователей важно, но не менее важно и доносить пользователям, где и почему они неправы, и почему хотят фигню. Это целое мастерство.\n\n> [mistalero](#comment_14_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): децентрализованная сеть с поддержкой PHP\n\nШерето получится.\n\n> [if0](#comment_31_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): если применить классическую схему полного создания страниц на серверной стороне\n\nКакие в децентрализованной сети сервера? И зачем упираться в убогий голый HTML? Под означенные требования уже есть TOR. Вот только он не обеспечивает репликацию сайтов по сети, а с серверными скриптами она превратится в кошмар. Придётся обеспечивать огромное окружение с точными версиями софта — а носители далеко не у всех резиновые, не говоря уж о вычислительных ресурсах. ZeroNet по умолчанию отводит 10 (20?) МБ на сайт, один только интерпретатор PHP больше весит. Можно реализовать легковесный серверный язычок нативно в ZeroNet, но это очередной велосипед получится.\n\n> [if0](#comment_31_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сетевая доступность полной копии ресурса лежит на плечах его создателя.\n\nНу точно TOR.\n\n> [if0](#comment_32_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для пользователей, которые не использует Go для разработки, он является как раз таким \"ненужно\" - лишней зависимостью\n\nПо такой логике пользователям, которые не занимаются программированием, любые компиляторы — лишняя зависимость. Чем сурсы-то собирать?",
				"added": 1561295627
			},
			{
				"comment_id": 31,
				"body": "> [blazingeye](#comment_28_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): карнавале педерастии\n\nТы про PyCon? Ну да, приличные негры сидят и пишут код, а не по конвентам шляются.",
				"added": 1563147872
			},
			{
				"comment_id": 32,
				"body": "> [if0](#comment_37_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Речь идет об абсолютных путях от корня сайта, без доменного имени: /css/style.css\n\nЭто уже не абсолютные пути, а относительные. И клирнетовским сайтам такая проблема тоже присуща. Не всегда есть возможность установить сайт в корень, нередко их ставят в поддиректорию. И у всяких наколеночных поделий нередко возникают с этим проблемы. В простом случае они решаются банальным указанием <base href=\"...\">.\n\n> [if0](#comment_41_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Программа может напрямую обратиться к железу\n\nНе может, если прав нету.\n\n> [if0](#comment_41_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): в обход механизмов, предоставляемых ОС?\n\nЭто не обход, а использование штатного fcntl.h.\n\n> [if0](#comment_45_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Трекров в Tor сейчас - нет\n\nА на хрена вообще в 2k19-м нужны трекеры, когда есть поиск по DHT? Я вижу только три кейса: 1) параноики, которые боятся засветить свой IP и при этом почему-то не прячут его за туннелем; 2) закрытые трекеры (на которых ещё и по головке настучать могут, если засветить раздачу в DHT); 3) дико огороженный NAT, опять-таки, без туннелей, в котором ко внешним хостам хрен пробьёшься, и можно принимать только входящие соединения. 1)-й странный; 2)-й — ССЗБ и ненужно, пускай в RetroShare сидят, раз хотят закрытости; 3)-й — в таких условиях всё равно к раздаче присоединиться не выйдет, максимум стянуть с трекера метаданные раздачи, а не ждать появления пира с поддержкой исходящих соединений.\n\n> [if0](#comment_52_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Не думаю, что пользователи далекие от программирования будут целенаправленно и осознанно использовать сурсные дистры для работы или повседневного использования компа\n\nНа практике именно так и есть, это основная целевая аудитория source-based. Ещё одна — настройщики высокопроизводительных серверов и создатели дистрибутивов. Программистам как раз выгоднее писать и тестить на мейнстримных дистрибутивах, чтобы заранее исключить проблемы своей специфичной системы.\n\n> [if0](#comment_53_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тот самый, который отдает страничку вашему браузеру при запросе\n\nОтдаётся — статика. Сайты на серверных ЯП не «отдают» страницу, а формируют. Отдавать они могут только из кэша, если на странице не было изменений.\n\n> [if0](#comment_53_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Так почему бы вместо тотального SPA прибитого гвоздями, в котором страница рендереится в браузере, из данных запрашиваемых с сервера, рендерить ее из тех же данных, но на стороне сервера, и отдавать в готовом виде клиенту - как происходит в классических фреймворках?\n\nЗатем, что зайты отображаются в рамках интерфейса ZN. А интерфейс ZN — SPA с вебсокетами. Не хотите SPA — перепишите интерфейс ZN на дубовый HTML с фреймами, делов-то. Только не нойте потом, когда какую-то функциональность реализовать не выйдет.",
				"added": 1563187421
			},
			{
				"comment_id": 35,
				"body": "> [if0](#comment_90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Буду на каждой странице сайта писать в красной рамочке: \"для правильного отображения данной страницы используйте мой дубовый интерфейс, вместо стандартного\"?\n\nИменно так: некрофилы, держащиеся за Gopher/Finger, тоже вынуждены это делать. Да даже и ссылки в ZeroNet нельзя просто так открыт, если не установлен локальный клиент. Сами выдумываете себе ограничения — сами и страдайте :P\n\n> [if0](#comment_90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Это не ко мне, а к любителям SPA во все дыры с вебсокетами в придачу на сайтиках\n\nТы какой-то неправильный SPA-фоб — позёр, видимо; у настоящих SPA-фобов JS вырублен наглухо, посему ZeroNet у них не заработает и комменты они сюда не напишут, разве что курлой :D\n\n> [if0](#comment_90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Так речь о ней и идет\n\nНе-а:\n\n> [if0](#comment_31_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): если применить классическую схему полного создания страниц на серверной стороне\n\nЧем их создавать без серверного ЯП или хотя бы SSI/прочего шаблонизатора? Статика не «создаётся», она единожды заливается на сервер и потом «отдаётся».\n\n> [if0](#comment_90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Особенно, когда происходит ошибка компиляции\n\nПроблемы из-за специфичных конфигураций возникают и на source-based. Один хрен придётся ковыряться, почему программа глючит или не запускается — либо забить. И в то же время генточку вполне себе можно тупо накатить по хэндбуку, история acidpink тому пример.\n\n> [if0](#comment_90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): когда и зачем такое может понадобится, если можно настроить веб-сервер?\n\nСтеснённые условия (хостинги, контейнера и пр.) Не все таки буржуи, чтобы содержать целый независимый сервер, да ещё и учиться его администрировать или нанимать админа, знаешь ли.\n\nЕщё бывает, что уже куплены HTTPS-сертификаты без wildcard, а надо бы ещё сайт для технических нужд впихнуть с HTTPS — почему бы не в поддиректорию? Вон PMA и прочие админки поголовно в поддиректорию ставятся, при том, что реализованы отдельными сайтам, по сути.\n\n> [geekless](#comment_188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В ZeroNet нет \"сайтиков\" со статикой\n\nА спрос на них есть :P И в TOR они вполне себе живут.\n\n> [blazingeye](#comment_31_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): чтобы приличные люди встречались в реальности\n\nТак а толк с этого какой? Я ещё понимаю какие-нибудь LUG, где люди притаскивают свои пеки и помогают друг другу настраивать. Или фестивали ретрокомпьютинга. А питонистам на хрена съезжаться в одну точку, кроме потрындеть и побухать? Конференции с фидбеком? вместо них вебинар можно устроить.",
				"added": 1563449039
			},
			{
				"comment_id": 39,
				"body": "> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тот дядька чешет за ухом пальцами ноги, а я то чем хуже его?!\n\nКак раз дед таким и хвалился — что в его-то годы ребята ноги под голову подкладывали. А нонешня молодёжь, видать, разжирела, раз таким не занимается.\n\n> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Существуют же серверные фреймворки на том же Питоне?\n\nКроме Django всё «стильное-модное-молодёжное».\n\n> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): в таком явно избыточном функционале не нуждаются\n\nДа ладно, ты просто не знаешь, куда его впихнуть. Я вон в KOI-то веки статью на Швабру запостил, смотрю — а рейтинг-то с кармой сами не обновляются! Надо страницу обновлять! И в профиле то же самое. А могло бы через вебсокеты обновляться без проблем.\n\n> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): но при подходе: \"везде SPА\", выбора нет,\n\nА ещё выбора «читать без браузера» нет. Вот же ж уроды, заставляют об разметку глаза ломать! Да ещё и тормозной питон ставить заставляют вместо того, чтобы написать на б-жественной Сишечке! Косорукие говнокодеры, не иначе!\n\n> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Так извращатся приходится при невозможности конфигурирования веб-сервера\n\nА в Зеронете, чтоль, юзеры должны его конфигурировать, чтобы просто зайти на зайт? Копия-то у каждого своя будет.\n\n> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Откуда возмется спрос, если они не поддерживаются? :D\n\nНаличие спроса никак не означает наличие предложения. Спрос на машину времени и на разумных какающих бабочками поней IRL определённо есть, но где они?\n\n> [if0](#comment_113_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): что позволит с минимальными изменениями использовать сайт в других сетях\n\nЧего ж в Retroshare возможности переиспользовать сайты из других сетей нет? Я вновь повторяю: браузерные технологии в ZeroNet — просто бэкенд, использование которого упрощает переносимость интерфейса и разработку зайтов. Из этого никак не следует обязательство обеспечивать совместимость с чем-то другим, что тоже можно открывать в браузерах — по аналогии с проприетарными форками XMPP.",
				"added": 1563482859
			},
			{
				"comment_id": 40,
				"body": "> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): это не правильно\n\nПочему же? Братья наши меньшие именно так и чешутся обычно: задней лапой.\n\n> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): считается нормальным и естественным явлением - хеловорды на электроне...\n\nЯвление само по себе не ново: MSHTA придуман ещё в конце 90-х. Вес же электроноподелок на виндузячий взгляд вполне приемлем: им ввиду засилья статической сборки чужда возможность поставить несколько мегабайт библиотек, и поверх них — несколько пакетов прикладных программ меньше мегабайта каждый: статический билд каждой такой программы для них и так весит десятки мегабайт. А ещё виндузятники играют в проприетарные игры, которые издревле весят гигабайты, и как-то научились с этим жить. В линуксячий мир же, конечно, вторжение всяких электронов и прочих снапов/флатпаков с огромными билдами выглядит дико, но против ленивых техноиндифферентных хомячков не попрёшь, можно только убегать от них дальше в манямирок (примером коего является и Зеронет).\n\n> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А может не надо придумывать \"куда впихивать\"\n\nОкей, не буду придумывать тебе колесо, луддит; таскай на спине дальше :P\n\n> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Слишком большая цена реализации на серверной стороне такого функционала\n\nВсяко проще, чем извращения поверх AJAX.\n\n> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Они не \"заходят\" на сайт а смотрят его локальную копию\n\nДак ведь не получится просто смотреть, если надо ещё веб-сервер конфигурять, потому что кому-то не нравятся технологии зайтов и приспичило зачем-то в P2P-сеть засунуть серверные языки программирования.\n\n> [if0](#comment_114_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): и бедные пользователи просматривающие такие сайты окажутся лишенными его свисто-пердельного функционала!\n\nИменно так, ты плохо знаком с UX юзверья: оно попросту потеряется, если вдруг пропадёт интерфейс ZeroNet на какой-то странице. Вот яркий пример: https://www.linux.org.ru/forum/linux-org-ru/11355874 Задумайся заодно, почему на хомячиных сайтах нередко выдаётся предупреждение при переходе по внешним ссылкам.",
				"added": 1563651031
			},
			{
				"comment_id": 41,
				"body": "> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): сколько эта программа будет памяти жрать после загрузки\n\nА как ты думаешь, зачем в винде своп автоматически расширяется? :D\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сжигать их напалмом!\n\nВместе с пользователями? Вон пристанища убунтят типа webupd8 уже давно такими поделками завалены.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): тскающим колесо\n\nКакое колесо, если его не придумали?\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): не предназначенные для этого самим естеством\n\nЛьвы так не считают.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): что протокол не предоставляет возможности проверить целостность соединения после подключения\n\nЯ в курсе, и как опытный пользователь GPRS — даже жертва.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): не развалилось ли соединение\n\nВебсокеты нужны примерно для тех задач, для которых во вневебном мире используется UDP. Если отвал соединений является проблемой — кто-то просто не в то место пытается засунуть вебсокеты :P Кстати, ZeroNet разрывы вполне уже отслеживает, и это ещё одна причина встраивать зайты во фрейм: с какой-то отдельной страницей юзер может просто прозевать разрыв.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): недостаточного качества канала связи\n\nZeroNet для запуска на локалхосте предназначен, откуда проблемы с каналом связи?\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): при отправке нескольких последовательных запросов, ответы на них могут прийти в произвольной последовательности\n\nА бывает, что говнокодеры сделали AJAX-запросы по интервалу, без контроля завершения предыдущего запроса. В результате на узком канале запросы накапливаются и вызывают бесконечную загрузку страницы с ростом незавершённых запросов.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): каждому запросу надо присваивать id, который в последствии использовать для идентификации ответа\n\nНу я ж говорю: байка стара, как мир ;-) У тех, кто пытается ради скорости использовать вместо TCP UDP, а потом жалуются, что UDP им не обеспечивает всего того же, что TCP — ровно та же проблема. Вполне резонно, что при таком раскладе нужно больше низкоуровневых деталей реализовывать самостоятельно. Вон Bittorrent и поверх UDP неплохо работает, потому что нумерация чанков и контроль их прихода в произвольном порядке уже реализованы в более высокоуровневом протоколе.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Как будто Питона там еще нет...\n\nОн используется не в качестве серверного ЯП.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): не обязательно что-то к чему-то прибивать гвоздями\n\nНо ведь речь именно о том, чтобы прибивать гвоздями к зайту интерпретатор серверного ЯП.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сеть p2p должна обеспчитвать только транспортные функции\n\nОна их обеспечивает — ничто не мешает выложить архив с исходниками сайта. А запускать у клиентов кучу непонятного плохо ограничиваемого кода при заходе на зайт она не обязана.\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Нельзя его тыкнуть мордочкой в отдельную страницу управления\n\nНельзя, ибо некудой. Лучше встраивать скрипты на сами зайты, как всякие Пчелайны и Интертелекомы делают?\n\n> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): пик удобства современного UI\n\nО каком пике речь, если мажорная версия до сих пор 0?",
				"added": 1564226209
			},
			{
				"comment_id": 43,
				"body": "> [blazingeye](#comment_32_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): так как такими поделками загаживают всё и делают видимость своей важности\n\nЕсли этим кто-то пользуется — значит, это кому-то нужно.\n\n> [blazingeye](#comment_32_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): из-за чего не особо разбирающиеся разработчики начинают думать, что на них придётся ориентироваться\n\nА на кого им ориентироваться? На тех, кто не делает новых поделок, не допиливает старые, и из-за этого проиграет рыночную конкуренцию? Я вон коньками, например, не пользуюсь, потому что там вырвиглазный рендеринг шрифтов из прошлого века — при том, что штука, казалось бы, довольно популярная. И могу понять тех, кто вместо них обмазывается всякими электроноподелками. Мне лично хватает текстового отчёта на xfce4-panel, но если графические индикаторы выводить — тут уж надо что-то посерьёзнее, типа виндузятного RainMeter.",
				"added": 1565629059
			}
		],
		"1561197102_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 29,
				"body": ">Посещая интересные мне ресурсы, создаю локальную копию посещаемого сегмента сети.\n\nZeroNet именно так и работает. Ещё Freenet.",
				"added": 1561295958
			},
			{
				"comment_id": 33,
				"body": "> [if0](#comment_35_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): кроме помечегого, как опциональный\n\nНу так это уже на совести разработчика зайта, выходит. По-хорошему, неопциональными должны быть файлы, отвечающие за движок сайта, а весь контент — опциональным.",
				"added": 1563188171
			},
			{
				"comment_id": 34,
				"body": "> [if0](#comment_35_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): пока не заполнится весь свободный объем, отведенный под их хранеие\n\nНу дык хранилища-то не резиновые. ZeroNet тоже ругаться начинает, когда место кончается.",
				"added": 1563188327
			},
			{
				"comment_id": 36,
				"body": "> [if0](#comment_91_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): существовала древняя, давно забытая технология в которой каждая страница являлась отдельным фалом\n\nИ при глобальных обновлениях требовала патчить все страницы, ага. У меня по этой причине сайт уже лет семь как заброшен: со статикой возиться не хочу, а движок писать некогда. Причём изначально были планы и возможность сделать сайт динамическим, но поскольку делался он для narod.ru, где динамики нет — затея обломалась.",
				"added": 1563449917
			},
			{
				"comment_id": 37,
				"body": "> [geekless](#comment_186_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): По той же причине биткойн обречен.\n\nЯ вот тоже ору «биткоин обречён» чуть ли не с момента узнавания о нём, но что-то он всё живёт и здравствует, при том, что несколько хардфорков пережил. Если «обречён» в плане соответствия изначальной идеологии децентрализованности, то тут он давным-давно умер; я ещё в начале 2012-го пробовал майнить его на ноутбучной карточке в пуле, и за неделю каких-то 20 копеек намайнил :D\n\nСуть ведь в том, что это особо и не нужно. В мире криптовалют устаканилось многообразие для разных задач, даже среди популярных — нет какой-то явно превалирующей. Для крупных капиталовложений и спекуляций — Bitcoin, то же для «рыбы» помельче — Litecoin, мелкие расчёты — Dogecoin и Bitcoin Cash, смарт-контракты — Ethereum, анонимные транзакции — Monero, межбанк — Ripple... Всякому своё, чтобы никто не остался обиженным. И вряд ли в ближайшие годы стоит ожидать отмираний или слияний — это ж не компании, которые тяготеют продаваться и объединяться.",
				"added": 1563451017
			},
			{
				"comment_id": 38,
				"body": "> [geekless](#comment_186_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): — Подождите 10-15 минут, он должен подумать о жизни.\n\nА, собственно, зачем делать PoW для приёма контента? Только для распространения нельзя, что ли? Пострадают разве что чатики, и те не сильно, если сделать время PoW пропорциональным объёму контента.\n\n> [if0](#comment_99_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): когда уведут приватный ключ у нофиша и почистят все файлы ZeroID...\n\nПо поводу добавления версионирования зайтов он что-нибудь говорил?",
				"added": 1563451225
			}
		],
		"1562829485_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": [
			{
				"comment_id": 30,
				"body": "А ти сам хто? Чому вузькощелепий?",
				"added": 1563147656
			}
		],
		"1576816508_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": [
			{
				"comment_id": 45,
				"body": "А нафиг нужен ещё один NIH, когда уже есть по меньшей мере ФИДО, NetSukuku, DeadDrops и Scuttlebutt? Лишь бы ещё больше разброда и несовместимости посеять в и без того тяжёлые времена, когда поднимать альтернативные сети придётся полутора географически удалённым энтузиастам?",
				"added": 1577023333
			},
			{
				"comment_id": 46,
				"body": "> [geekless](#comment_201_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вот это извращение, конечно.\n\nЗато полная независимость от интырьнетов этих ваших, и вообще компьютерных сетей.",
				"added": 1617312802
			}
		]
	},
	"comment_vote": {}
}