{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Як створити другий ZeroId?",
			"body": "Чи можна це зробити і яким чином якщо можна?",
			"added": 1491141794,
			"parent_topic_uri": "1_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2"
		},
		{
			"topic_id": 2,
			"title": "Блокування соц мережі ВКонтакті",
			"body": "Як думаєте, додасться українських користувачів в зеронет  в зв'язку з цією подією?",
			"added": 1495082983
		},
		{
			"topic_id": 3,
			"title": "Bitcoin",
			"body": "Чи варто користуватись цією криптовалютою?",
			"added": 1498768739
		},
		{
			"topic_id": 4,
			"title": "Чи можна якось скопіювати зайт Play?",
			"body": "Цей зайт не клонується, та в просторах зеронету я десь знаходив його копію, там по мангам вроді торент був...",
			"added": 1508268463,
			"parent_topic_uri": "1_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2"
		},
		{
			"topic_id": 5,
			"title": "Перекличка",
			"body": "Є ще хтось в Українському сегменті?",
			"added": 1509136037
		},
		{
			"topic_id": 1516822487,
			"title": "Універсальні сервіси по відстеженню посилок з Китаю",
			"body": "Підскажіть, будь ласка сервіс для відстеження посилок з Китаю.\nСам користуюсь \"gdeposylka\" і спробував 17track.\nЦікавить саме відстеження посилок з подібним номером: SA012345678EE",
			"added": 1516822481
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_1nqdBSrhCPJwj7v3gAHvjUFyeoQzwPH84": [
			{
				"comment_id": 1,
				"body": "> [zeronetix](#comment_11_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): все працює? Давайте якісь пропозиції будемо давати - що будемо робити в нашому кмпюніті :)\n\nДумаю, для початку треба розібратись, для чого ми сюди прийшли)",
				"added": 1491128305
			},
			{
				"comment_id": 3,
				"body": "> [zeronetix](#comment_13_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Розібратись треба, я от за розподілений, безпечний і швидкий інтернет. Зеронет для цього підходить. Вже розібрались як створювати і клонувати сайти? Якщо ні - то гайда на мій блог http://127.0.0.1:43110/1CVbkJs7TZYKjTyTQNdFNCTbtLCCjPATjS/.Я зараз рідко пишу, рідко з'являюсь тут, але все-ж... Скоро буду мати більше часу.Питайте що цікавить :)\n\nТак, з цими базовими питаннями все зрозуміло. Дякую за блог, почерпнув корисної інформації з нього)",
				"added": 1492715317
			},
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/193psz3yGj7EH39nyKb4A2KKBXEHT49Csf/?Topic:1_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR/+ZeroId",
				"added": 1493319046
			}
		],
		"1_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": [
			{
				"comment_id": 2,
				"body": "Всім привіт!\nЄ хто не будь в ZeroMe ?",
				"added": 1491156544
			}
		],
		"1_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 5,
				"body": "> [zeronetix](#comment_14_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Знайшов відповідь розробника:\n> \n> Загалом треба перейменувати плагін в каталозі plugins із disabled-Multiuser  на MultiuserАле чомусь сказано зберігати приватні ключі, які відображаються для кожного нового акаунту на першому вході в верхньому правому кутку, вигляду dsf34f4vewdsx24r3x4c345ct1d3rx\n\nДякую за відповідь)\nЯ так розумію, що є деякий ризик втратити теперішній акаунт.",
				"added": 1493925437
			}
		],
		"2_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 6,
				"body": "> [zeronetix](#comment_17_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Сумніваюсь, більше прийде в Facebook. Все таки ZeroNet то не є власне соціальна мережа...Всі ті хто музику слухають перейдуть на Soundcloud чи Deezer.. Щоб користувачі прийшли - треба рекламувати власне ZeroNet і його особливості. Якщо соціалку то ZeroME, але воно досить сире....http://127.0.0.1:43110/Me.ZeroNetwork.bit/\n\nТеж так думаю. Зараз є стільки альтернатив контакту, що думаю з часом усі пристосуються. А ZeroNet можливо з часом займе свою нішу.",
				"added": 1495375999
			},
			{
				"comment_id": 10,
				"body": "Як це визначили?",
				"added": 1504888392
			},
			{
				"comment_id": 11,
				"body": "> [zeronetix](#comment_29_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): пальцем в небо, або через пріоритетну мову в браузері\n\nДумаю швидше перше)",
				"added": 1505848653
			},
			{
				"comment_id": 12,
				"body": "Я не заходив в контакт з часів блокування, зараз мені достатньо месенджерів. Хтось може сказати, там щось змінилось з тих часів?)",
				"added": 1509135882
			}
		],
		"1_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b": [
			{
				"comment_id": 7,
				"body": "Ну, Linux користувач є, а от на рахунок будівництва нової платформи можна по детальніше?",
				"added": 1495511268
			},
			{
				"comment_id": 8,
				"body": "Підскакать будь ласка, чи можна перенести вінчестер з встановленою обунтою з одного ПК на інший з іншою конфігурацією?",
				"added": 1496897254
			},
			{
				"comment_id": 9,
				"body": "floppydrive0, дякую за відповідь) буду тоді пробувати.",
				"added": 1497027660
			}
		],
		"1513329382_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": [
			{
				"comment_id": 13,
				"body": "Я не сильний в англійській та програмуванні, не підкажете як там перевірити наявність своїх паролів в списку",
				"added": 1513436764
			}
		],
		"3_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 14,
				"body": "> [putsan](#comment_3_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT): Також можете спробувати Карбованець - українську криптовалюту, яка показує стрімкий ріст\n\nБудь ласка розкажіть про нього)",
				"added": 1513443298
			},
			{
				"comment_id": 15,
				"body": "> [bodqhrohro]\nДякую вам за відповідь. Мені завжди здавалось, що рано чи пізно майнерам буде вкрай невигідно тримати свої ферми і безтолковий перебір хешів, як на мене, марна трата ресурсів.",
				"added": 1515600506
			},
			{
				"comment_id": 16,
				"body": "Підкажіть будь ласка, де я можу віддати біткоіни на благодійність? Хотів вікіпедії віддати та так зрозумів, що зараз їм непотрібна фінансова допомога.",
				"added": 1515600633
			}
		]
	},
	"comment_vote": {
		"1_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck": 1
	}
}