{
	"posts": [
		{
			"id": "d1e5f94e-9f33-4f18-8432-9d0a6641eacc",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "start posting news articles",
			"body": "theres seems to be alot of information thats being removed, lets contribute to being properly informed",
			"time": 1598034601910,
			"files": "[]"
		},
		{
			"id": "9fdc002b-7b84-4a7c-95f4-e97fc306d077",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "Amazon removes vulgar anti-Biden and Harris shirts",
			"body": "https://edition.cnn.com/2020/08/19/tech/amazon-removes-anti-biden-products/index.html\n\nNew York (CNN Business)Amazon has removed merchandise sold by third parties with a vulgar anti-Joe Biden and Kamala Harris slogan, and says it may take action against sellers listing them.\nTwitter users on Tuesday started pointing attention to shirts with various versions of the phrase \"Joe and the Ho,\" referring to the Democratic nominees for President and Vice President, former Vice President Biden and US Senator Harris.\nSeveral such shirts were still listed on the site Wednesday morning, but links to the products are no longer active. As of around 12:30 p.m. ET on Wednesday, an Amazon (AMZN) spokesperson said the products had all been removed for violating selling guidelines.\n\n\"All sellers must follow our selling guidelines and those who do not will be subject to action including potential removal of their account,\" the spokesperson said in a statement. \"These products have been removed.\"\nIn addition to selling its own products on its website, Amazon also acts as a marketplace where third party, independent sellers can list items for sale.\n\nDemetria Edwards, an Arkansas attorney, on Tuesday sent an email to Amazon CEO Jeff Bezos asking for the removal of the products. Edwards, who shared that email with CNN Business, called the items \"racist, sexist and offensive merchandise,\" and a \"reprehensible attempt to demean, devalue, denigrate and degrade\" Biden and Harris. Edwards said she did not receive a direct response from Amazon, and it's not clear whether Edwards' letter led to the products' removal.\nIt's not the first time Amazon has had to remove inappropriate products. Earlier this month, Amazon removed shoes for sale by a third party seller that featured a racial slur from its website after being called out by a British lawmaker. And in March, Amazon said it had pulled more than 1 million products off its site for price gouging or false advertising during the pandemic.",
			"time": 1598034884910,
			"files": "[{\"name\":\"200820161145-amazon-offensive-biden-harris-tshirt---screenshot-exlarge-169.jpg\",\"thumb\":\"c39e2b27b06c815c1351d4519daeb447f1386aa9-thumb.jpg\",\"size\":32472,\"type\":\"image/jpeg\",\"original\":\"c39e2b27b06c815c1351d4519daeb447f1386aa9.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"}]"
		},
		{
			"id": "1dd6ec7b-0006-498a-ba47-6433acca047f",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "California Fusion Center Tracked Anti-Police Protests, Sent Info To 14,000 Police Officers",
			"body": "https://www.techdirt.com/articles/20200819/16572045148/california-fusion-center-tracked-anti-police-protests-sent-info-to-14000-police-officers.shtml\n\nAs anti-police brutality protests have spread across the country in the wake of the yet another killing of an unarmed Black man by a white police officer, so has surveillance. Another set of documents found in the \"Blue Leaks\" stash shows a California-based \"fusion center\" spreading information about First Amendment-protected activities to hundreds of local law enforcement agencies. Pulling in information from all over -- including apparent keyword searches of social media accounts -- the Northern California Regional Intelligence Center (NCRIC) distributed info on protests and protesters to officers across the state.\n\n    One way that NCRIC shares information is by sending bulk emails to its partners. Since the protests began, these have included vague, fear-inducing memos from the Department of Homeland Security and the FBI about the threat of violent civil unrest, as well as more specific information, including emails sent at 10 a.m. and 6 p.m. every day to more than 14,000 police officers across Northern California with updated lists of Black Lives Matter protests. During the 13-day period covered in the hacked files, over half of the bulk emails NCRIC sent were related to monitoring and policing the largely peaceful protests.\n\nThe information flowed both ways, with law enforcement recipients sending in their own tips in the form of \"Suspicious Activity Reports.\" Everything gathered is combined to form the basis of the NCRIC's daily email blasts -- several of which included information about upcoming protests.\n\nAccording to the documents in the Blue Leaks stash, NCRIC sent out updated lists of protests every day between May 31 and June 6. (The exfiltration of law enforcement documents occurred around June 6th, terminating this chain of correspondence.) These covered everything from anti-police violence protests to peace marches to remembrance events for victims of COVID-19. These were accompanied with notes from the NCRIC saying these updates would arrive twice a day and were for \"situational awareness only.\" Even so, the focus on First Amendment activity is concerning.\n\n    “The fact that fusion centers are sending out lists of protests and other activities that are protected by the First Amendment is constitutionally suspect,” Vasudha Talla, a senior staff attorney with the American Civil Liberties Union of Northern California, told The Intercept. “They may try to justify it by attaching text alluding to the potentiality of certain criminal activity, but it’s clear from the documents that you showed me that there is no reasonable suspicions attached to any of these events.” She added, “Really what we have here is overbroad collection and dissemination of people’s protected First Amendment activity, and it’s untethered to any basis in the law.”\n\nThat's just one problem. The NCRIC says it's no longer doing this, but unless someone exfiltrates some more documents, it's kind of tough to tell whether the fusion center is telling the truth. And a hacking might be what it's going to take, because the NCRIC unilaterally declared the documents exempt from California public records laws. The boilerplate attached to each email blast probably won't hold up in court, but it at least forces records requesters to go to court to have any chance of obtaining them through less-illicit means.\n\nThe NCRIC -- with the input of the FBI -- also sent out blasts detailing supposed threats from social media users. The screenshots of tweets deprived of context were treated as threats against law enforcement, including one that said nothing more than \"see a blue lives matter flag, destroy a blue lives matter flag.\" This tweet formed the basis of an FBI Situational Information Report that declared this a threat to \"law enforcement supporters.\"\n\nThe NCRIC also forwarded dubious information from the Department of Homeland Security to these 14,000 officers. An uptick in downloads of police scanner apps prompted the DHS to claim \"well-coordinated groups\" had \"potentially compromised\" law enforcement communications, ignoring the fact police scanners have been used by citizens for years to listen in on law enforcement activity. Snagging a publicly available signal doesn't \"compromise\" anything.\n\nAnother document suggested \"violent opportunists\" were traveling to protests with \"milk or other liquids\" to mitigate the effects of crowd control chemicals. Again, this ignores the fact that many peaceful protesters also do the same thing for the same reason -- not just \"violent opportunists.\" Pitching it this way makes it appear as though anyone trying to defend themselves against tear gas is a potential criminal, rather than someone just trying to exercise their First Amendment rights.",
			"time": 1598035017210,
			"files": "[]"
		},
		{
			"id": "77fc8c4e-595a-47d0-8ac5-6cb8bb8c93bb",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "Uber's former security chief charged for allegedly concealing data breach",
			"body": "https://www.cnn.com/2020/08/20/tech/uber-security-chief-charged/index.html\n\n (CNN Business)Uber's former chief security officer has been charged with trying to conceal from federal investigators a 2016 data breach that exposed the information of 57 million users to hackers.\nA complaint filed Thursday in the US District Court in San Francisco alleges that Joe Sullivan, who led Uber's security team for more than two years until November 2017, \"engaged in a scheme to withhold and conceal\" both the hack and the amount of data that was exposed from the US Federal Trade Commission.\nThe complaint alleges that Sullivan and Uber (UBER) arranged to pay the hackers $100,000 in exchange for signing a non-disclosure agreement about the hack, which falsely stated that they had not accessed or stored any company data. Uber didn't disclose the breach or the payment until late 2017.\n\"Silicon Valley is not the Wild West,\" US Attorney David Anderson said in a statement announcing the charges. \"We will not tolerate illegal hush money payments.\"\n\nSullivan, a former Assistant US Attorney, joined Uber in 2015 from Facebook, where he served as chief security officer for more than five years after stints at eBay and PayPal. He is currently the chief security officer of internet infrastructure company CloudFlare.\nBradford Williams, a spokesperson for Sullivan, said in a statement that the charges — which include obstruction of justice — are without merit.\n\"This case centers on a data security investigation at Uber by a large, cross-functional team made up of some of the world's foremost security experts, Mr. Sullivan included,\" Williams said in the statement. \"If not for Mr. Sullivan's and his team's efforts, it's likely that the individuals responsible for this incident never would have been identified at all.\"\nWilliams added: \"From the outset, Mr. Sullivan and his team collaborated closely with legal, communications and other relevant teams at Uber, in accordance with the company's written policies. Those policies made clear that Uber's legal department -- and not Mr. Sullivan or his group -- was responsible for deciding whether, and to whom, the matter should be disclosed.\"\nAn Uber spokesperson said the company continues to \"cooperate fully\" with the investigation from the Justice Department. The data breach prompted scrutiny from regulators in the United States as well as other countries, including the United Kingdom, Australia, Italy and the Philippines.\n\"Our decision in 2017 to disclose the incident was not only the right thing to do, it embodies the principles by which we are running our business today: transparency, integrity, and accountability,\" Uber said in a statement.\nIn September 2018, Uber agreed to pay $148 million to settle an investigation into the 2016 data breach that the company was accused of intentionally concealing. The settlement, with attorneys general for all 50 states and Washington, DC, was the largest ever multi-state data breach settlement, according to the New York attorney general at the time.\nAs part of the settlement, Uber agreed to develop and implement a corporate integrity program for employees to report unethical behavior. It also agreed to adopt model data breach notification and data security practices, as well as hire an independent third party to assess its data security practices.\n\nThe investigation was called to look into allegations that the ride-share company violated state-level notification laws by intentionally withholding that the breach occurred.\nUber also previously settled a case with the FTC, which was investigating claims that Uber deceived customers over this breach.",
			"time": 1598064193642,
			"files": "[]"
		},
		{
			"id": "df9c1e80-fb32-4f9f-8dc0-4cc7b5da80d6",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "‘It’s a Telegram revolution’: Messaging app proves crucial to Belarus protests",
			"body": "https://www.latimes.com/world-nation/story/2020-08-21/telegram-messaging-app-crucial-belarus-protests\n\nMOSCOW — \n\nEvery day, like clockwork, to-do lists for those protesting against Belarus’ authoritarian leader appear in the popular Telegram messaging app. They lay out goals, give times and locations of rallies with business-like precision, and offer spirited encouragement.\n\n“Today will be one more important day in the fight for our freedom. Tectonic shifts are happening on all fronts, so it’s important not to slow down,” a message in one of Telegram’s so-called channels read Tuesday. “Morning. Expanding the strike … 11:00. Supporting the Kupala [theater] ... 19:00. Gathering at the Independence Square.”\n\nThe app has become an indispensable tool in coordinating the unprecedented mass protests that have rocked Belarus since Aug. 9, when election officials announced that President Alexander Lukashenko — whom some call “Europe’s last dictator” — had won a landslide victory to extend his 26-year rule in a vote widely seen as rigged.\n\nPeaceful protesters who poured onto the streets of the capital, Minsk, and other cities were met with stun grenades, rubber bullets and beatings from police. The opposition candidate, schoolteacher Sviatlana Tsikhanouskaya, left for Lithuania — under duress, her campaign said — and authorities shut off the internet, leaving Belarusians with almost no access to independent online news outlets or social media and protesters seemingly without a leader.\n\nThat’s where Telegram — which often remains available despite internet outages, touts the security of messages shared in the app and has been used in other protest movements — came in. Some of its channels helped unconnected, scattered rallies mature into well-coordinated action.\n\nThe people who run the channels, which used to offer political news, now post updates, videos and photos of the turmoil sent in from users, locations of heavy police presence, contacts of human rights activists and calls for new demonstrations — something Belarusian opposition leaders have refrained from doing publicly themselves. Tens of thousands of people all across the country have responded to those calls. \n\nIn a matter of days, the channels — NEXTA, NEXTA Live and Belarus of the Brain are the most popular — have become the main method for facilitating the protests, said Franak Viacorka, a Belarusian analyst and nonresident fellow at the Atlantic Council.\n\n“The fate of the country has never depended so much on one [piece] of technology,” Viacorka said.\n\nIn the days following the vote and the subsequent internet outage, NEXTA Live’s audience shot from several hundred thousand followers to over 2 million. Its sister channel NEXTA has more than 700,000 followers. Belarus of the Brain’s following grew from almost 170,000 users in late June to over 470,000 this week.\n\nTheir influence in a nation of 9.5 million is hard to overestimate, including by the authorities who have taken notice and are pursuing those behind the channels. \n\nLast week, officials opened a criminal probe into NEXTA and its founder, 22-year-old blogger Stepan Putilo, on charges of fomenting mass riots — an offense punishable by up to 15 years in prison. Blogger Igor Losik, who founded Belarus of the Brain, was arrested before the election, but the channel continues to operate.\n\n“We have indeed become the bullhorn of the situation that is unfolding in Belarus right now,” Putilo, who is Belarusian but lives in Warsaw, said in a recent interview with Lithuanian news outlet Delfi. “We have become the voice of this revolution, but by no will of our own. It just happened.”\n\nPutilo first created NEXTA — which is pronounced NEKH-ta and means “somebody” in Belarusian — as a YouTube channel in 2015, when he was just 17. His profile rose last year when his 30-minute video about the country’s iron-fisted leader, “Lukashenko. Criminal Records,” was viewed almost 3 million times. A court in Belarus declared the film extremist, but it is still available on YouTube.\n\nPutilo turned to Telegram in 2018. His two channels focused mostly on Belarusian politics. His team received thousands of messages from users sending in photos, videos and news items each day and posted the most newsworthy, taking pride in often sharing information from sources inside the government or law enforcement. \n\nAfter the demonstrations began, thousands of messages turned into hundreds of thousands, and the underground operation now appears inundated. In response to a request from the Associated Press for an interview, NEXTA editor in chief Roman Protsevich wrote: “Sure, it’s possible, but the question is when. …” He then stopped responding.\n\nPutilo hasn’t responded to requests for comment.\n\nWhen the protests began, the NEXTA channels were often the first places anywhere on the internet to carry grisly pictures of police violently clashing with demonstrators. This week, they were filled with videos of workers protesting at industrial",
			"time": 1598064369742,
			"files": "[]"
		},
		{
			"id": "7c83f7dd-fa7a-488b-8bf1-28fc335e9e1d",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "Even With a Strong Crop This Year, U.S. Farmers Are Suffering ",
			"body": "https://www.wsj.com/articles/even-with-a-strong-crop-this-year-u-s-farmers-are-suffering-11598088601\n\nMany Midwestern states are recording abundant crop yields, but the economic picture for U.S. farmers remains fragile\n\nFollowing a growing season last year filled with battering rainfall and bitter trade wars, U.S. farmers hoped 2020 would provide them an opportunity to make up some ground. Instead, the situation has grown worse for many as prices remain depressed.\n\nDespite a wind storm tearing through Midwestern farms last week and drought conditions in isolated areas, a bumper crop of both corn and soybeans is still expected this year.\n\n“Overall, the trade seems to be coming to the conclusion that...there is still going to be an oversupply of corn in the U.S. and the world,” said Tomm Pfitzenmaier, an analyst with Des Moines, Iowa-based Summit Commodity Brokerage, in a research note Friday.\n\nThat case was bolstered Friday when Pro Farmer, following a weeklong tour of farmland across seven states, assessed the national corn yield at 177.5 bushels per acre, and the national soybean yield at 52.5. That is slightly lower than earlier U.S. Department of Agriculture estimates but higher than 2019’s waterlogged crop.\n\nFor many U.S. farmers, the prospect of grain prices staying low is untenable. “It’s almost a day-to-day struggle to decide what to do next year,” said Doug Sombke, president of the South Dakota Farmers Union and a farmer of 3,000 acres of corn and soybeans in Brown County, S.D.\n\nMr. Sombke says his local grain elevator is paying $2.87 for a bushel of corn. That is nearly a dollar lower than what he would need to collect to break even. The same is true for his soybeans, for which the elevator is willing to pay roughly $8.50 a bushel.\n\nPrices for corn and soybeans haven’t risen since the start of the year, when the signing of the U.S.-China phase-one trade agreement stipulating China would purchase $36.5 billion of agricultural goods from the U.S. gave farmers hope that export demand from China would buoy prices. Instead, most-active corn futures on the Chicago Board of Trade are down 16% since the start of the year, while wheat has fallen nearly 6% and soybeans have shed nearly 5%.\n\nChinese exports of U.S. corn, soybeans and wheat are 144% higher than they were at this point last year, according to data from the USDA’s Foreign Agricultural Service. But the onset of the coronavirus pandemic in the U.S. in March hobbled domestic demand for grains as restaurants and other institutions nationwide shut down.\n\nIf the situation doesn’t quickly improve, Mr. Sombke said he may be forced out of farming. “We’ve got some choices to make,” he said. “The last three years, we’ve lost equity on our farm. Do we want to keep doing that?”\n\nBankruptcies are high in farm country. Roughly 580 farmers filed for chapter 12 bankruptcy protection through the year ended June 30, according to federal data. More recent data from the Federal Reserve Bank of Kansas City shows farm loan repayments are expected to fall precipitously in the next three months.\n\n“We entered Covid with a lot of operations being in distress,” said Brian Philpot, CEO of Lakeland, Fla.-based AgAmerica Lending. Most bankruptcies being reported are by small family farms, while larger agricultural operations are taking the opportunity to purchase land from distressed farmers, Mr. Philpot said.\n\n“The large producers are doing fine and they’re acquiring,” said Mr. Philpot.\n\nGovernment aid in the form of assistance from the USDA and the $19 billion Coronavirus Food Assistance Program have helped mitigate the financial damage of low commodity prices, but farmers say it is only a Band-Aid.\n\n“We in the ag economy really appreciate the assistance we got from the federal government,” said Richard Guebert Jr., president of the Illinois Farm Bureau and a farmer of corn, soybeans and wheat in southeast Illinois. “But we really wish to get our revenue from the market.”\n\nWhile the weather in the Midwest has been more supportive for growing a strong crop than last year, this year’s growing season hasn’t been without weather issues.\n\nEarlier this month, a powerful storm packing winds over 100 miles an hour swept through much of the Corn Belt, causing widespread property and crop damage. Wind snapped a lot of Iowan corn off its stalks and destroyed grain bins containing corn farmers were saving to sell once prices rise.\n\nFarmers affected by the storm are now in a rush to harvest and store the corn before it rots. “They had a very good crop before the wind storm,” said Brian Grete, an editor with Pro Farmer leading the eastern leg of the crop tour. “Now it’s a race to see how much they can get into the bin before they run out of time.”\n\nWhen grain prices are low, farmers often try to grow larger crops to sell more and cover costs. “If you have low commodity prices and low yields, it’s extremely hard,” Mr. Guebert said.",
			"time": 1598113233275,
			"files": "[]"
		},
		{
			"id": "67a6eed1-d364-40c2-87dc-1cb5d404ebcc",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "Belarus blocks over 50 news websites but protests continue",
			"body": "https://apnews.com/7d92cfccbc7cbed1aaab40fd6f0b6e0b\n\n1 of 19\nA woman kneels on the ground as people create a human chain during a protest in Minsk, Belarus, Saturday, Aug. 22, 2020. Demonstrators are taking to the streets of the Belarusian capital and other cities, keeping up their push for the resignation of the nation's authoritarian leader. President Alexander Lukashenko has extended his 26-year rule in a vote the opposition saw as rigged. (AP Photo/Dmitri Lovetsky)\n\nMINSK, Belarus (AP) — Authorities in Belarus blocked more than 50 news media websites that were covering weeks of protests demanding that authoritarian President Alexander Lukashenko resign but protesters still turned out again Saturday, some forming a chain of solidarity in the capital.\n\nThe Belarusian Association of Journalists reported the shutdowns Saturday, which included sites for the U.S.-funded Radio Liberty and Belsat, a Polish-funded satellite TV channel focusing on neighboring Belarus. The state publishing house has also stopped printing two top independent newspapers, the Narodnaya Volya and Komsomolskaya Pravda, citing an equipment malfunction.\n\nProtests unprecedented in Belarus for their size and duration broke out after the Aug. 9 presidential election, in which election officials say Lukashenko won a sixth term in a landslide. Protesters allege the officials results are fraudulent and are calling for Lukashenko to resign after 26 years in power.\n\nPolice responded harshly to the protests at first, arresting 7,000 people and beating many of them. But the police crackdown only widened the scope of the protests, and now anti-government strikes have been called at some of the country’s main factories, former bases of support for Lukashenko. Some police have posted videos of themselves burning their uniforms and quitting in disgust at the government’s response.\n\nIn an enormous show of defiance, an estimated 200,000 protesters rallied Aug. 16 in the capital, Minsk. Lukashenko’s main election challenger, Sviatlana Tsikhanouskaya, has called for another massive show of opposition this Sunday.\n\n“We are closer than ever to our dream,” she said in a video message from Lithuania, where she took refuge after the election, knowing that some previous presidential challengers in Belarus had been jailed for years.\n\nPublic shows of support for Lukashenko, who has ruled Belarus with an iron fist since 1994, have been comparatively modest. A pro-government rally in Minsk on Aug. 16 attracted about a quarter as many people as the protest march. On Saturday, only about 25 people showed up for a bicycle ride to support the president.\n\nOn Saturday, hundreds of women dressed in white formed a human chain in Minsk as sign of protest. Another demonstration in the evening was attended by 3,000 people.\n\n“Threats, intimidation, blocking no longer work. Hundreds of thousands of Belarusians are telling him ’go away″ from all corners and squares,” said Anna Skuratovich, one of the women in the chain.\n\n1 of 19\nA woman kneels on the ground as people create a human chain during a protest in Minsk, Belarus, Saturday, Aug. 22, 2020. Demonstrators are taking to the streets of the Belarusian capital and other cities, keeping up their push for the resignation of the nation's authoritarian leader. President Alexander Lukashenko has extended his 26-year rule in a vote the opposition saw as rigged. (AP Photo/Dmitri Lovetsky)\n\nMINSK, Belarus (AP) — Authorities in Belarus blocked more than 50 news media websites that were covering weeks of protests demanding that authoritarian President Alexander Lukashenko resign but protesters still turned out again Saturday, some forming a chain of solidarity in the capital.\n\nThe Belarusian Association of Journalists reported the shutdowns Saturday, which included sites for the U.S.-funded Radio Liberty and Belsat, a Polish-funded satellite TV channel focusing on neighboring Belarus. The state publishing house has also stopped printing two top independent newspapers, the Narodnaya Volya and Komsomolskaya Pravda, citing an equipment malfunction.\nADVERTISEMENT\n\nProtests unprecedented in Belarus for their size and duration broke out after the Aug. 9 presidential election, in which election officials say Lukashenko won a sixth term in a landslide. Protesters allege the officials results are fraudulent and are calling for Lukashenko to resign after 26 years in power.\n\nPolice responded harshly to the protests at first, arresting 7,000 people and beating many of them. But the police crackdown only widened the scope of the protests, and now anti-government strikes have been called at some of the country’s main factories, former bases of support for Lukashenko. Some police have posted videos of themselves burning their uniforms and quitting in disgust at the government’s response.\n\nIn an enormous show of defiance, an estimated 200,000 protesters rallied Aug. 16 in the capital, Minsk. Lukashenko’s main election challenger, Sviatlana Tsikhanouska",
			"time": 1598158460576,
			"files": "[{\"name\":\"800.jpeg\",\"thumb\":\"737fc377b90ae58e12934d0ecef29366d6bb5525-thumb.jpg\",\"size\":82686,\"type\":\"image/jpeg\",\"original\":\"737fc377b90ae58e12934d0ecef29366d6bb5525.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"}]"
		},
		{
			"id": "46a157db-e752-4bdf-8f16-76a408a0d00c",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "Court rules NSA phone snooping illegal — after 7-year delay",
			"body": "The National Security Agency program that swept up details on billions of Americans' phone calls was illegal and possibly unconstitutional, a federal appeals court ruled Wednesday.\n\nHowever, the unanimous three-judge panel of the 9th Circuit Court of Appeals said the role the so-called telephone metadata program played in a criminal terror-fundraising case against four Somali immigrants was so minor that it did not undermine their convictions.\n\nThe long-awaited decision is a victory for prosecutors, but some language in the court's opinion could be viewed as a rebuke of sorts to officials who defended the snooping by pointing to the case involving Basaaly Moalin and three other men found guilty by a San Diego jury in 2013 on charges of fundraising for Al-Shabaab.\n\nJudge Marsha Berzon's opinion, which contains a half-dozen references to the role of former NSA contractor and whistleblower Edward Snowden in disclosing the NSA metadata program, concludes that the \"bulk collection\" of such data violated the Foreign Intelligence Surveillance Act.\n\nThe call-tracking effort began without court authorization under President George W. Bush following the Sept. 11, 2001, terrorist attacks. A similar program was approved by the secretive FISA Court beginning in 2006 and renewed numerous times, but the 9th Circuit panel said those rulings were legally flawed.\n\nThe appeals court stopped just short of saying that the snooping was definitely unconstitutional, but rejected the Justice Department's arguments that collecting the metadata did not amount to a search under a 40-year-old legal precedent because customers voluntarily share such info with telephone providers.\n\n\"Here the NSA collected Moalin’s (and millions of other Americans’) telephony metadata on an ongoing, daily basis for years,\" wrote Berzon, an appointee of President Bill Clinton. \"Moalin likely had a reasonable expectation of privacy in his telephony metadata — at the very least, it is a close question.\"\n\nBerzon's opinion was jointed by Judge Jacqueline Nguyen, an appointee of President Barack Obama and Judge Jack Zouhary, who was appointed by President George W. Bush.\n\nThe 9th Circuit panel essentially endorsed a 2015 ruling from the New York-based 2nd Circuit that found the mass surveillance was not sufficiently tied to any specific investigation, as Congress appeared to require.\n\nBerzon said the defendants were entitled to notice that the foreign-intelligence-related surveillance contributed to the case, but not necessarily the details of how. But she said even if Moalin and his co-defendants had clear notice of that, it wouldn't have helped their defense.\n\n\"Based on our careful review of the classified record, we are satisfied that any lack of notice, assuming such notice was required, did not prejudice defendants,\" she wrote. \"Having carefully reviewed the classified FISA applications and all related classified information, we are convinced that under established Fourth Amendment standards, the metadata collection, even if unconstitutional, did not taint the evidence introduced by the government at trial.\"\n\nDuring the public debate over the program — triggered, as the opinion notes in half a dozen places, by disclosures from Snowden — numerous officials pointed to the Moalin prosecution as concrete evidence that the program was contributing to U.S. prosecutions for terrorism. Other examples cited by officials were primarily overseas. And the Moalin case was not about any plans for attacks in the U.S., but in Somalia.\n\nThe new 9th Circuit opinion cites congressional testimony by former FBI official Sean Joyce that the metadata program gave agents a break that led to them reopening the investigation into Moalin. But Berzon goes on to suggest that the public claims by Joyce or others were inaccurate because the metadata program did not play a pivotal role.\n\n\"To the extent the public statements of government officials created a contrary impression, that impression is inconsistent with the contents of the classified record,\" she wrote.\n\nJoyce, who retired from the FBI several years ago, did not immediately respond to a message seeking comment.\n\nThe metadata program was officially shut down in 2015 after Congress passed the USA FREEDOM Act, which provided a new mechanism where phone providers retained their data instead of turning it over to the government. The revamped system appears to have been abandoned by the NSA in 2018 or 2019.\n\nThe release of the 59-page opinion Wednesday is another reminder of the exceedingly slow pace of some 9th Circuit appeals, particularly those involving classified information or FISA surveillance. The court took almost seven years to render its legal judgment on Moalin's appeal, filed in November 2013. The case was argued in November 2016, two days after Donald Trump's surprise victory in the presidential race.\n\nhttps://www.politico.com/news/2020/09/02/court-rules-nsa-phone-snooping-illegal-407727",
			"time": 1599161557514,
			"files": "[{\"name\":\"campus.jpg\",\"thumb\":\"12cc70dc3dd49c3ef0beb4436407883bca759595-thumb.jpg\",\"size\":292733,\"type\":\"image/jpeg\",\"original\":\"12cc70dc3dd49c3ef0beb4436407883bca759595.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"}]"
		},
		{
			"id": "cf3972e2-8d8e-4ac5-98c1-6d8e6519d85c",
			"directory": "users/1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8",
			"uri": "en_news",
			"subject": "trump rally 11.14.2020",
			"body": "history in the making",
			"time": 1605384506058,
			"files": "[{\"name\":\"BdAAMon.png\",\"thumb\":\"52013b3fb38f55d5aa39cfa3a88d4916dbbb1593-thumb.png\",\"size\":22427489,\"type\":\"image/png\",\"original\":\"52013b3fb38f55d5aa39cfa3a88d4916dbbb1593.png\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"},{\"name\":\"tOMDzxiD.jpeg\",\"thumb\":\"0a15dfb3a567187ee58347d4ae286415f85da794-thumb.jpg\",\"size\":469126,\"type\":\"image/jpeg\",\"original\":\"0a15dfb3a567187ee58347d4ae286415f85da794.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"},{\"name\":\"O9s1UsEE.jpeg\",\"thumb\":\"d87e49307013f598cfaf217ec01a4244bf557998-thumb.jpg\",\"size\":308767,\"type\":\"image/jpeg\",\"original\":\"d87e49307013f598cfaf217ec01a4244bf557998.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"},{\"name\":\"TKYLI9bS.jpeg\",\"thumb\":\"e310d9ed97f688be0ae180d6c9a872c6817cf6e5-thumb.jpg\",\"size\":384593,\"type\":\"image/jpeg\",\"original\":\"e310d9ed97f688be0ae180d6c9a872c6817cf6e5.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"},{\"name\":\"eM9f84Yd.jpeg\",\"thumb\":\"7ed7febdae8a7a4a07d21de582ee899c574fe4be-thumb.jpg\",\"size\":483469,\"type\":\"image/jpeg\",\"original\":\"7ed7febdae8a7a4a07d21de582ee899c574fe4be.jpg\",\"directory\":\"1BBC2D76roBqVcKh58X7V1ZBW2AUY1WEe8\"}]"
		}
	],
	"boards": [
		{
			"uri": "en_news",
			"title": "english news",
			"config": null,
			"description": "Be Informed"
		}
	],
	"modlogs": []
}