{
	"next_post_id": 9,
	"next_comment_id": 1,
	"next_follow_id": 6,
	"avatar": "jpg",
	"user_name": "Topnet",
	"hub": "16bNGdxFkGWGnCEfVue3w4CSp3Ew2hcyBB",
	"intro": "*   [p2p software](http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/)\n\n    [My YouTube - ZeroNet Channel](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?My)\n\n*   [p2p blog](http://127.0.0.1:43110/1N3KuCTPnU4gWmHpJKfv6kLJV4xuYiaeGP)\n\n*   [Полезные статьи](http://127.0.0.1:43110/1Mv6N3tZD8txahjwRCKXWe5U86wWYzfnLB/)\n\n\n\n",
	"post": [
		{
			"post_id": 1585541376,
			"body": "ZeroMeHubList 3\nhttp://127.0.0.1:43110/0hub.bit",
			"date_added": 1585541374
		},
		{
			"post_id": 1586627767,
			"body": "Xorro P2P How we built a BitTorrent-like P2P network from scratch\n\nXorro P2P is a BitTorrent-like peer-to-peer file sharing network built by software engineers Ken Chen, David Kurutz, and Terry Lee.\n\nInterested in P2P networks and distributed systems, we set out to build our own from scratch. The version available today is our alpha release, providing a working proof-of-concept. We want to continue improving upon Xorro — upcoming features are listed further down this page.\n\nThis site outlines our journey building Xorro P2P. We hope that readers leave with a better understanding of the P2P problem space.\n\nResearch\n\nAs strictly end users of P2P systems, we started our journey facing a very large learning curve. Much research was needed for us to understand the history and internals of these systems. We collectively read up on P2P networks, old and new: Napster, Gnutella, Freenet, BitTorrent, IPFS…\nCentralized vs Decentralized\n\nAn important concept to understand is the difference between centralized and decentralized systems. A comparison of first and second generation networks helps to illustrate the difference.\nNapster: Centralized\n\nNapster was a P2P file sharing service that was mostly used to transfer music files, and was popular from 1999-2001, It’s estimated that there were about 80 million registered users at its peak. Napster worked by having all nodes connect to a central index server that contained all the information about who was in possession of which files.\n\nDue to its centralized nature, Napster was vulnerable to attacks and lawsuits and Napster was shut down by court order after about 2 years of service. In addition to those vulnerabilities, the central index meant there was a single point of failure, as well as a lack of scalability.\nBitTorrent, Gnutella, Freenet: Decentralized\n\nThe next generation of P2P networks were able to escape the same fate as Napster by moving to a distributed model.\n\nIn a decentralized system like BitTorrent, every computer/node acts as a client and server, maintaining its own segment of a file lookup index. Nodes can find out about the locations of files through other nodes, removing the reliance on a central server.\n\nFocusing on P2P File Sharing Systems\n\nKnowing the advantages of newer P2P systems, we went down the path of investigating their features more deeply. Luckily P2P networks have been around for a while so there were many resources available. White papers about distributed hash tables (DHTs) proved to be the most critical, as DHTs are the foundation of current P2P networks. Countless hours were spent reading and digesting white papers, specification documents, blog posts, and StackOverflow answers. We made sure to have a good understanding of DHTs before we started any coding.\n\nKademlia\n\nA Kademlia network consists of many Nodes.\n\nEach node:\n\nHas a unique 160 bit ID.\nMaintains a routing table containing contact information for other nodes.\nMaintains its own segment of the larger distributed hash table.\nCommunicates with other nodes via 4 remote procedure calls.\n\nEach node’s routing table is divided into ‘buckets’ — each bucket contains contact information for nodes of a specific ‘distance’ from the current node. We will discuss the concept of distance in more detail shortly.\n\nEach contact contains the ID, IP address, and port number of the other node.\n\nBecause Xorro is a file sharing application, the DHT segment will contain key/value pairs where each key is a file id, and the corresponding value is the file location.\n\nhttps://github.com/xorro-p2p/xorro\nhttps://xorro-p2p.github.io/",
			"date_added": 1586627764,
			"meta": "{\"img\":\"900,506,99aeeeddedee88989a,011111112001311111300111111130011111113045555555544444444444\"}"
		},
		{
			"post_id": 1589954503,
			"body": "Brief: Open source painting application MyPaint 2.0 has been released with new features and improvements. Check out what’s new and how to get the latest MyPaint on Linux.\n\nhttp://mypaint.org/",
			"date_added": 1589954499
		},
		{
			"post_id": 1593636820,
			"body": "Privately Access Censorship Resistant Websites\n\nhttps://lokinet.org/\n\nhttps://github.com/loki-project/loki-network/releases\n\nhttps://github.com/moshest/p2p-index\n\n#lokinet #p2p #opensource #privacy #Decentralize #Decentralized #foss\n",
			"date_added": 1593636815
		},
		{
			"post_id": 1594229885,
			"body": "\n\nεxodus\nThe privacy audit platform for Android applications\n\nExodus Privacy is an Android application. Exodus Privacy application let you know what trackers are embedded in apps installed on your smartphone. It let you also know the permissions required by any apps on your smartphone. It helps you to take your privacy back!\n\nhttps://reports.exodus-privacy.eu.org/\n\nhttps://github.com/Exodus-Privacy/exodus-android-app\n\n#privacy #android\n",
			"date_added": 1594229879
		},
		{
			"post_id": 1612553340,
			"body": "\n\nSolus\n\nSolus is an operating system that is designed for home computing. Every tweak enables us to deliver a cohesive computing experience.\nBuilt for people like you, by people like you\n\nSolus is empowered by the shared vision of a strong community working for a common goal. All developments and improvements to Solus are by people who want to use their computers just like you do. Solus stands strong on an open platform, powered by industry-proven technologies, including GNU/Linux*.\n\nhttps://getsol.us/home/\n\n#linux #foss #opensource\n",
			"date_added": 1612553333,
			"meta": "{\"img\":\"900,607,98a678557667323333788769545444a99322554dcb111877,00012231100002452613777849A549882B4CDBE4EE55451FF5EE55544588EE44444444\"}"
		},
		{
			"post_id": 1636208492,
			"body": null,
			"date_added": 1636208484,
			"meta": "{\"img\":\"900,654,ccccc8a9b767ba8a886778aaed9888bbac76966a85657c98,0011010023141405456714841597AA844BC97AA71DD57AA7761AD49799E31A7F595222\"}"
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1MpUdwe28gwynzoKg9ziFCRWcQK2FqNunb",
			"user_name": "火犬",
			"date_added": 1584621705
		},
		{
			"follow_id": 2,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ",
			"user_name": "P2P",
			"date_added": 1584643855
		},
		{
			"follow_id": 3,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "157VksPLxufKMy8U344wPhayVY3RhkL8SK",
			"user_name": "怡红院",
			"date_added": 1584643858
		},
		{
			"follow_id": 4,
			"hub": "16bNGdxFkGWGnCEfVue3w4CSp3Ew2hcyBB",
			"auth_address": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd",
			"user_name": "Topnet",
			"date_added": 1593457872
		},
		{
			"follow_id": 5,
			"hub": "1ARSTRDgMSH2E81pcZCbaEq28TZ72Levxh",
			"auth_address": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd",
			"user_name": "Topnet",
			"date_added": 1593459148
		}
	]
}