{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1528080237,
			"title": "How about integrated IPFS ?",
			"body": "Why not consider integrating IPFS into ZeroNet to solve the problem of uploading and sharing large files?",
			"added": 1528080236
		},
		{
			"topic_id": 1529144547,
			"title": "Is there a way to create a mirror ZBlogs using RSS?",
			"body": "",
			"added": 1529144545
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1524414787_19zcg1P4bhHh2EaMAKYKJGWXQ53bxAq3Pw": [
			{
				"comment_id": 1,
				"body": "禁止儿童色情的原因是，你每一次看儿童色情，都要有一个小孩子要被侵犯人身自由。\n而人身安全的自由显然高于你的言论自由。\n这也是为什么即便不禁止色情的西方国家也要禁止儿童色情的原因。",
				"added": 1526724058
			}
		],
		"1526846299_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 2,
				"body": "How can I install the P2P plugin in macOS？",
				"added": 1526882627
			}
		],
		"1528080237_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": [
			{
				"comment_id": 3,
				"body": "The problem with ZeroNet is that there is no sound economic system, and nodes have only two options: distribute content for free or not. \nThis may not be a problem for the average website, but imagine sharing a 100 gigabyte Blu-ray movie file. At this point, if the seeder has no interest, the user deletes the file immediately after watching.",
				"added": 1528119037
			},
			{
				"comment_id": 4,
				"body": "> [matso](#comment_3_1H3f2Q8pxbSVy9MuifHryzGQ9i4mmSuRsd): I think some incentive to share would be great, but I would stay away from greedy ICO scams like IPFS' filecoin. Some sort of automatic bitcoin payments for sharing certain files could work.\n\nI don't think all digitally encrypted currency is a hoax, and in fact ZeroNet uses NameCoin as its domain system.",
				"added": 1528119130
			}
		],
		"1533076540_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "As a person who works in mainland China, I can answer this question. \nGenerally speaking, you can't install Telegram or Telegram in China. This is achieved by two types of blocking. \nFirst, the government asked Apple to remove the Telegram client from the App Store China, while Google Play was blocked in China, and other Android App Stores in mainland China were asked to remove Telegram. \nOn the other hand, all of Telegram's server IP is blocked, even if you successfully install the client on your Android phone via the APK file. \nOf course, the web version is also unusable. \nHowever, as we all know, there are a large number of users in China using VPN, so you can see Chinese in many Telegram groups, especially those related to encrypted digital currency.",
				"added": 1533271309
			}
		],
		"1540055841_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 6,
				"body": "You can become a domain name registrar or help others build websites.\nJust like in the early days of the Internet.",
				"added": 1540091334
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 7,
				"body": "ZeroNet is a purer decentralized project. \nTo put it simply, many people in the zeronet community hate decentralized projects that offering encrypted digital currencies.\nThe use of legal tender transactions in a network environment that is not legally recognized (ZeroNet) is itself a security risk.\nSo at this stage ZeroNet can only stay away from business.\nIn fact, you can post product information in ZeroTalk, ZeroMe or any other ZeroSite. But how to pay and how to logistics, you need to solve it yourself.",
				"added": 1558671042
			}
		],
		"1602987903_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 8,
				"body": "Great, As a member of beta, I've had this interface for a long time, and it looks great.",
				"added": 1603010811
			}
		]
	},
	"comment_vote": {
		"1181_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"7_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": 1
	}
}