{
	"title": "Россия, 1990-е",
	"description": "В основном фотографии. Чтобы не забывалось.",
	"links": "*   [СССР-Россия. 1988-2018](/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/) — как менялась страна\n*   [Мемуары Balancer'а](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/) — там тоже много из этого периода.\n*   [Tanzpol.Org Blog](/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/)\n*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)",
	"next_post_id": 6,
	"demo": false,
	"footer": "Powered by [ZeroNet](https://zeronet.io) [open, free, and uncensored]",
	"modified": 1540379417,
	"post": [
		{
			"post_id": 5,
			"title": "«Волыны»",
			"date_published": 1540378728.359,
			"body": "Нельзя сказать, что оружие в этот период было у большинства людей. Но практически у каждого в окружении были те, кто им обладал :) Источников возникло множество, от распродаж с разворованных воинских частей до стволов Великой отечественной, восстановленных «чёрными следопытами». Пару раз друзья и мне предлагали приобрести, при чём по относительно подъёмным для меня деньгам, но я всё равно не стал связываться и «как лох» ходил с газовым балончиком :) Под окнами общежития, в Алёшкинском лесу (Тушино) практически еженедельно проходили перестрелки. Хотя результат разборки, убитого бизнесмена, сам я видел лишь однажды.\n\n![rubric_issue_event_971443.jpg (638x338)](data/img/post_5_rubric_issue_event_971443.jpg)\n\n---\n\nКстати, огромную популярность приобрели в России бесбольные биты. Тогда шутили, что Россия занимает в мире одно из последних мест по популярности бейсбола, но одно из первых по количеству бейсбольных бит :) У нас в комнате в общаге бейсбольная бита лежала. Хотя как играют в бейсбол я не знаю до сих пор :D\n\n![7341237c7df20eca.jpg (632x501)](data/img/post_5_7341237c7df20eca.jpg)"
		},
		{
			"post_id": 4,
			"title": "Токсикомания",
			"date_published": 1540377888.72,
			"body": "Это был ад, на который всем было наплевать. Корни уходили ещё в конец 1980-х, мы уже тогда слышали истории про «Момент» или ацетон, но тогда это было что-то очень далёкое. У нас до такого не опускались даже очень запущенные подростки. В 1990-х плотину прорвало… Особенно сильно под эту волну затянуло детей, в первую очередь — беспризорных.\n\n![07aa6ba9-30d3-4e7c-9daf-9b6341ad5595.jpg (1200x800)](data/img/post_4_07aa6ba9-30d3-4e7c-9daf-9b6341ad5595.jpg)\n\n---\n\n![9.JPG (1020x680)](data/img/post_4_9.JPG)\n\n![bcbb1d89694f70bc08ec731aa5b93e0e.jpg (798x411)](data/img/post_4_bcbb1d89694f70bc08ec731aa5b93e0e.jpg)\n\n![toxikomaniya.jpg (720x490)](data/img/post_4_toxikomaniya.jpg)\n\n![7c09edc8-0ec0-4997-86fa-16d0d933d794.jpg (813x540)](data/img/post_4_7c09edc8-0ec0-4997-86fa-16d0d933d794.jpg)"
		},
		{
			"post_id": 3,
			"title": "Бизнес",
			"date_published": 1540377052.109,
			"body": "Славный период массового бизнеса. Я не ручаюсь утверждать, что торговлей с рук тогда занимались все или даже большинство, но ручаюсь, что это затронуло всех :)\n\n![437964_original.jpg (1200x784)](data/img/post_3_437964_original.jpg)\n\nСам я торговать начал сразу же после приезда в Москву, в 1990-м. Как-то удалось урвать дефицитных батареек 3337 («квадратных»), взял десяток и поехал с ними на тогда ещё Тушинский рынок, продавать вдвое дороже :) Продавал без разрешения и меня повязала охрана, конфисковав остаток. Но всё равно я остался в каком-то копеечном, но плюсе. И начало было положено. Потом я немного спекулировал радиодеталями, пока мне товарищ не предложил перейти в более высокую лигу — торговлю аудиоаппаратурой :D Мы покупали на неделе в «центрах оптовой торговли» (типа Отон(?) или Белый ветер(?) — названия уже вылетели из головы) по какой-нибудь «балалайке», начиная с простых магнитол, шли на радиорынок, продавали с наценкой процентов 30-50, на эту наценку на неделе жили и брали что-то покруче, снова шли продавать :) Каждую неделю у нас была новая крутая аудиотехника, но чем она была круче, тем сложнее было продать — у людей банально не было денег. Кончилась эпопея тем, что он купил два видеомагнитофона ВМ-12, а продать их так  не смог. У нас в общаге появилось два халявных видака, а бизнес накрылся, потому что мне одному было лениво. Но тогда мы с другим товарищем начали копировать и продавать дискеты с компьютерными играми. Наступала эпоха доступных персональных компов :)\n\n![rynok.jpg (1200x675)](data/img/post_3_rynok.jpg)\n\n---\n\n![trade-90-2.jpg (1050x699)](data/img/post_3_trade-90-2.jpg)\n\n![trade-90.jpg (1050x697)](data/img/post_3_trade-90.jpg)"
		},
		{
			"post_id": 2,
			"title": "Обменники",
			"date_published": 1540376251.832,
			"body": "![krizis_1998_goda.jpg (1245x955)](data/img/post_2_krizis_1998_goda.jpg)\n\nВесь постсоветский период до середины нулевых все цены в стране измерялись в долларах. Да и как иначе, если цена в рублях даже на хлеб могла за пару лет вырасти в 100 раз? Начиная с какого-то момента указывать цены в валюте запретили и магазины поголовно перешли на У.Е. — «условные единицы», которые чудесным образом совпадали с биржевым курсом USDRUB :)\n\nВ условиях гиперинфляции единственным способом как-то сохранить деньги была покупка валюты. Народна тропа к обменникам не зарастала. Стояли, порой, подолгу, особенно в кризисные времена. Часто обменивались с рук тут же в очереди, те, кто сдавал валюту и те, кто покупал. Разница покупки/продажи была большая, так что всем было выгодно, кроме владельцев обменников. Нас на этом несколько раз жёстко гоняла охрана :)\n\n* * *\n\n![9e0ff4db8.jpeg (1200x702)](data/img/post_2_9e0ff4db8.jpeg)\n\nЗарплаты тоже, как правило, или платились сразу в долларах, или договаривались на У.Е., а получали в рублях по курсу на день выдачи. Моя первая чисто рублёвая зарплата, по-моему, началась с 2004 года. А вот за аренду квартиры валютой я платил аж до 2014 года :)\n\n![59.jpg (1100x750)](data/img/post_2_59.jpg)\n\n(СКВ = _свободно конвертируемая валюта_ — дожили… Сегодня не все знают этот термин!)"
		},
		{
			"post_id": 1,
			"title": "Россия, которую мы потеряли © Версия 199x",
			"date_published": 3875671653,
			"body": "Вокруг 1990-х годов стала складываться новая мифология. Чаще в сторону приукрашательства. Это, в общем, нормальная реакция человеческой психики, больше помнить хорошее, чем плохое — «раньше трава была зеленее, а вода — мокрее». Но всё чаще звучат мнения, даже от живших в тот период, что, мол, сейчас мы живём не принципиально лучше. По-моему, чтобы такое утверждать, нужно очень сильно оторваться от реальности и совсем запамятовать, как оно было. Поэтому завожу небольшой сайт-напоминалку. Благо, ZeroNet позволяет контенту жить если не вечно, то очень долго :)\n\nТакже сошлюсь на параллельный сайт «[СССР-Россия. 1988-2018](/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/)». Но тот касается именно сравнений, а тут я буду размещать информацию о том периоде без сравнений. Это проще, а сравнить уже каждый сам сможет :)\n\nУже когда начал делать этот сайт, обратил внимание, что он получается местами мемуарный. Ну, что делать, если на этот период пришлась бурная юность и молодость :D\n\n## Смотри также:\n\n- [СССР-Россия. 1988-2018](/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/) — как менялась страна\n- [Мемуары Balancer'а](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/) — там тоже много из этого периода.\n"
		}
	]
}