{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1630865475,
			"title": "Corporate email systems were once closed....",
			"body": "They only accepted mail from others within that organization - never the internet. Back then those systems were productivity enhancing instead of the time sinks they are now. It's easy to setup such systems since they don't need to relay. If you have a valid password - you can send and receive. If not - you are locked out. Now it appears to me that this would be the ideal setup for delta chat users since there would be near zero spam. The remaining todo has to do with moving all of this traffic into V3 onions. Should be as simple as firing up a docker container or a portable app. Right now, the rebelling truckers of Australia could sure use something like this.",
			"added": 1630865474
		}
	],
	"topic_vote": {
		"1630142696_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Can't speak for Muslims - because I'm not one. But strip away all the hypocrisy they encumber themselves with, and I suspect there is but a tiny minority who \"lives for the fight\". Unfortunately, they drag everyone along with them :(\n\nSimilarly, the West appears to be under sway by a tiny minority (minorties?). How else can you explain the clusterfuck which was Afghanistan? I'm sure someone's interests were served by that war - but you'd be hard pressed to justify it was ever in the US or West's interest. Yet it happened. Why?\n\nIMO, a bigger issue is why so many foreigners wish to come over to the US and change it into what they left. Also, why are tiny native American groups helping them? Would like to know this before I start killing people. Always in the back of one's mind \"did I miss something\". Right now I'm pretty much certain this minority needs to die.\n\nSo if you ever see news reports of Catholic or Lutheran charity workers impaled ala Vlad the impaler.....you'll know I finally cracked. Somalians belong in Somalia......\n\nIt's easy to hate all these religious nuts. Not just Muslims.",
				"added": 1630261835
			},
			{
				"comment_id": 8,
				"body": "(shrug) The only thing which impresses a punk is the certainty on consequences when they get out of line.\n\nAnd the west hasn't been reliable in that.\n\nAll conflicts can be stopped if the certainty of retribution exists. It's a bad idea to mix ideologies. Everyone needs their home. Immigration just leads to conflict.",
				"added": 1630521095
			}
		],
		"1630441420_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 2,
				"body": "Haven't noticed this. Speeds have increased greatly due to more individuals seeding sites. I wish nofish would fix V3 Onions and add I2P transport.",
				"added": 1630519716
			}
		],
		"1630471958_1FfvRsvT7B11FPurfvbPV2yGgx14SMFyfC": [
			{
				"comment_id": 3,
				"body": "Always provide link so others can take a look and possibly help.",
				"added": 1630519849
			}
		],
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 4,
				"body": "ZeroID has always been a problem and it's down now. All you can do is to wait until it's brought up again.",
				"added": 1630519918
			},
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_1540_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): KaffieID\n\nI thought nofish controlled it?",
				"added": 1630802952
			},
			{
				"comment_id": 15,
				"body": "> [kaffie](#comment_1176_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This is exactly why I made KaffieID. A decentralized system needs a decentralized user id system. Otherwise the centralized id system will go down and the whole network dies.\n\nIf you have an alternative to ZeroID, why did you fail to post a link to it?",
				"added": 1630803014
			},
			{
				"comment_id": 16,
				"body": "Has anyone tried this \"tamas@zeronet.io\" address from the ZeroNet.io site?",
				"added": 1630863910
			}
		],
		"1630153406_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 5,
				"body": "Who?\n\nThere's too much drama with this stuff. I can understand posting targets/locations along with a brief synopsis of their crimes....but at some point the talk must stop and the \"business\" must take place.\n\nAnd you'd better be careful about those targets. Anything less than all of your neighbors heaving a sigh of relief upon hearing the news that an evildoer is dead - means you've probably picked a questionable target. Your targets must rise the the level of that family which peddled Oxycontin. Otherwise you're a crank...and others will perceive you as dangerous to themselves.",
				"added": 1630520322
			},
			{
				"comment_id": 6,
				"body": "> [epistemic](#comment_20_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): You do realize that you're not anonymous on here, and that the TOR nodes are known, right?You're only anonymous to ISPs that follow the law, you're not anonymous to the NSA, FBI, CIA, etc.\n\nYou might be overstating their capabilities. Especially in light of the incompetence the feds displayed with their evacuation. Deanonymization is possible if you are willing to throw enough resources at it. But it takes time and luck. You are also just using Tor for transport, the actual TLS security comes from ZeroNet. Your browser doesn't even touch the internet, it only touches the Zeronet server localhost. So an attacker would necessarily need to break Tor, break ZeroNet TLS, and then try to piece together bittorent streams.\n\nSo for assassinations - you might still be safe. Planting nukes....probably not secure enough.",
				"added": 1630520680
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 7,
				"body": "I want to believe he's not at all like he's portrayed by the press, and honestly hope the Russians were lucky to find a real leader.\n\nBut then there are those stories about him bleeding his country/countrymen dry.\n\nOnce in awhile, I'd like to know the simple truth.",
				"added": 1630520871
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 9,
				"body": "Israel, quit taking my money. Quit offering dual citizenship. Quit spying.\n\nThings will be getting very bad for Jews if you don't stop.",
				"added": 1630521190
			}
		],
		"1629750780_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 10,
				"body": "I really saddened by this and hope to move on. Just can't trust Apple any more. Tragic.",
				"added": 1630521249
			}
		],
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 11,
				"body": "May you show wisdom and mercy your predecessors lacked. Don't blow this!",
				"added": 1630521328
			}
		],
		"1630791791_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 12,
				"body": "Why does ZeroID no longer work? Are there alternatives?",
				"added": 1630800143
			}
		],
		"1630778195_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 13,
				"body": "> [xcape2net](#comment_954_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What about anti-vaxers?  Many innocent people may die needlessly  as a result of believing false information.  Should they have free speech?  Is anti-vax speech free speech?\n\nYes. Free speech is an important check on delusions. It's valuable, despite any pain. Did you know that both Pfizer and Moderna submitted their vaccine without control data? And that first 2ea, now a total of 6ea high ranking FDA officials suddenly resigned without warning. Giving up their 30 yr $250K/yr jobs.\n\nSo many just repeat the mantra....\"antivaxxers are chumps\". What if reality is exactly opposite? Japan has been rejecting Covid vaccines due to detected contaminants. FDA briefly shut down Johnson and Johnson's Baltimore (WTF) operation due to a lack of cleanliness. \n\nGroupthink can be deadly and I fear this one is destined for the history books. I'm vaxed - and I regret it. Had believed these public officials had at least a bit of common sense. Now believe they were all on the take.....\n\nThese antivaxxers (I've made fun of them too) may actually be responsible for lives saved. Lives saved from the mindless mob.",
				"added": 1630802371
			}
		],
		"1630523661_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 17,
				"body": "I struggled with YubiKey years ago - but gave up. It seems that every effort to come up with a simple physical key has failed.",
				"added": 1630864100
			}
		],
		"1630138998_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 18,
				"body": "His daughter is ugly and appears \"past the wall\"....so little chance for grandkids there. Milley doesn't strike me as much of a threat anyway. He's just another useless product of the system. Now if he had displayed any competence in that Afghan evacuation - THEN - might consider him a threat. Until then, you shoudl regard him as a fucked up individual with a fucked up family. Waste of your time.",
				"added": 1630864678
			}
		],
		"1630111967_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 19,
				"body": "If Americans had overs - they would have just assassinated Bush and Cheney. Of course we'd still be left with Jewish neocons whispering into politicians ears :(",
				"added": 1630864842
			}
		]
	},
	"comment_vote": {}
}