{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Gtreat program but i found a big problem. I made several zites and files.I’ts need too much resources too keep them alive. A simple missig function was causing the problem.If the zite in the current time nobody share.The program does not try it keeping download! The same problem with file sharing in the system! When a user try to download a zite.And the current time does not have  peers.A simple function will be very useful, give a option to keep it try do download or cancel the process.On files add files to the download list, even if does not have  peers in the current time.\n\n\nThe problem yet, less visited or larger zites, and files, crashes fast with the current setup in the 0Net system.\n\nThe biggest problem in larger zites or unstable connetction the file transfer are half finished.Transmission is interrupted and not contiune.Check files or Update are does not help!The pages some times are not correctly loading.A stable transmission system with file priority 1: High html 2: medium pictures and page files 3: low: attachmens and big files.It would be useful.The system will start the transfer but will not finish it.It is impossible to share larger pages this way.",
			"post_id": 130,
			"date_added": 1525289790
		},
		{
			"comment_id": 2,
			"body": "Mivel magyar fejlesztésű a program,ezért magyarúl szeretném leírni a rendszer legnagyobb hibáját.Különböző nagyméretű fájlokkal, és oldalakkal kísérleteztem.Az eredmény az volt hogy napi 3-6 órás visszatöltéssel a feltöltött fájlok és oldalak kivétel nélkül összeomlanak! \n\nEvvel a rendszerrel két nagyon nagy baj van.Így viszont egy átlag felhasználó weboldalánál a rendszer önmagát dönti be.Saját tapasztalat.Normál számítógép használat mellet.Amit feltöltesz fájlt, vagy beüzemelsz weboldalt igen gyorsan összeomlasztja önmagát! Ennek oka meg az hogy akik le szeretnék tölteni a fájlokat hozzájuk nem jut el megfelelőképp.\n\n LEGNAGYOBB: A rendszer elvárja ha valaki egy oldalt be akar tölteni,ott mindjárt valaki online legyen.Ha éppen nem online senki az adott időpontban később a rendszer meg se próbálja letölteni.A fájloknál ugyan ez van.A fejlesztő nem várhatja komolyan el, hogy valaki 24 órán keresztül futtassa a számítógépet!\n\n2.Opcionális fájlok átvitele: Jó esetben félig meddig elkezdi és be sem fejezi.Vagy el sem kezdi.Szintén elvárja a rendszer hogy az adott pillanatban valakitől le lehessen tölteni.Ha ez nem valósul meg később nem kísérli meg letölteni.\n\nAz oldalak fájlok kisebb látogatottságú és nem folyamatosan seedelt oldalak esetén el sem tudnak terjedni.A látogatók nagy része meg sem kapja a fájlokat.Akiknek sikerül letölteni, velük meg az egész rendszer hamar összeomlik.\n\nA fejlesztő elvárja egy P2P hálózaton hogy non stop valaki töltse vissza a dolgokat.Ez átlag felhasználók esetén meg működésképtelen! Ha meg aki lekérte előzőleg a fájlt online lenne később, nem kapja meg az adott fájlt.Így rengeteg erőforrást elpazarol a rendszer.Az oldalak fenntartása túl sok felesleges erőforrás elpazarlásával jár.Ez átlagos internet felhasználóknak így nem megoldás!\n\nJAVASLAT:\n\n1.: Ha valalaki lekér valamit.Legyen az egy oldal, vagy más fájlok.De az azt kiszolgálló személy a lekérés pillanatában épp nem aktív.De később a két számítógép egyidejűleg elérhető lesz.A rendszer (A) pontból (B) be vigye át a fájlokat.Különböző torrent klienseknél ez így működik.Enélkül a kevésbé népszerű torrent fájlok mind összeomlanának.Sajnos a ZeroNet rendszerében ez nem valósul meg.\n\n\n2.: Ha valaki elkezd egy nagyobb fájlt letölteni a rendszer azt fejezze is be.Ne várja el a rendszer hogy abban a pillanatban azt a fájlt pont valaki visszatöltse.Mert lehet aznap akár órákkal később vagy éppen másnap lesz akitől le lehet tölteni.Ugyan így oldalaknál ne várja el a rendszer hogy azok non stop aktívak legyenek.\n\nSokat torrentezek, feltöltőként is.Tapasztalat hogy ezen fájlok nagyrészénél kevés a le és feltöltő.Nem ritka eset hogy aki vagy akik visszatölti vagy töltik a fájlt később válik vagy válnak aktívvá.Akár órákkal később!A torrentek nagyrésze torrent oldalakon ebbe a kategóriába sorolható! A torrent programok evvel a jelenséggel tökéletesen megbírkóznak.A ZeroNet rendszerében a fent emített problémák végett meg jelenleg így nem működik.\n",
			"post_id": 130,
			"date_added": 1527956244
		},
		{
			"comment_id": 3,
			"body": "Two important thing are missing for many people.But about loong time ago. Forget the content json failed error. I do not understand why 0Net does not try download zites later if nobody seed them the current time.Make a notification on zero hello if it finished.The same problem with large files. In a good-developed system its a serious bug. It's a major problem for website administrators.And people who share larger files.While this is not fixed, it is not worth to operate smaller pages with larger files.",
			"post_id": 132,
			"date_added": 1531304293
		},
		{
			"comment_id": 4,
			"body": "The system is better from day to day. :)\n\nSome positive feedback:\n\n1.The tracker system: fast connection, the users quickly find each other.\n2. Some zites finaly downloaded later the next day what i want too see.I do not have to try again and again.Once it appears in the zite list. This is a huge step positive forward.\n3. Big files transmission are much better.\n\nWhat I find functionally the most important in this system as website administrator. If a user want a file or zite download. And the user who have the file or zite are not online. But later will be online. At this point the downloader automatically get the file or zite. But especially with zites. I see great progress in this area. The most important if someone wants to download something, all the same its a zite or file. If someone starts seed the content in this case the user get this content.And  do not have to constantly attempt to unsuccessfully try to get the files and zites.The cost of maintaining the website,bandwidth,zite uptime (without 24/7 run my PC),the users successfully get  or not what they like,the number of users and seeders,In short, the most important thing.",
			"post_id": 135,
			"date_added": 1536017778
		},
		{
			"comment_id": 5,
			"body": "[Major problem what makes 0Net unusable for users and webmasters](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1579445364_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W/Major+problem+what+makes+0Net+unusable+for+users+and+webmasters)",
			"post_id": 152,
			"date_added": 1579445410
		},
		{
			"comment_id": 6,
			"body": "No software update for a year. Everyone is waiting for one developper team. The community is incapable of making major improvements on its own. Disaster from a business point of view for content creators, website owners. Most of the files are inaccessible, unenjoyable to dowload a larger file, or watch a movie. The project should be taken over by different development teams. Need to build a business model where developers, content creators, who help seed the content they get anonymous way money. And we need a working anonymous decentralized system where content is available non-stop for unlimited time until the owner delete it. Just have to copy the working projects, and integrate the working protocolls. And all of this won’t happen until the entire project is in the hands of one development team. ",
			"post_id": 152,
			"date_added": 1630136737
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}