{
	"title": "The Blockchain News",
	"description": "Read articles about cryptocurrencies, P2P technology and more without leaving ZeroNet ;)\n\nDisclaimer: All articles reposted here are distributed under the Creative Commons license.",
	"links": "### Recent posts\n\n[Youtuber sued over Stanley Kubrick movies analysis](http://127.0.0.1:43110/bcnews.bit/?Post:22:Youtuber+sued+over+Stanley+Kubrick+movies+analysis)\n\n[Movie companies want to destroy massive pirate communities](http://127.0.0.1:43110/bcnews.bit/?Post:21:Movie+companies+want+to+destroy+massive+pirate+communities)\n\n[Paramount cracks down on \"The Godfather\" pirates, after 44 years](http://127.0.0.1:43110/bcnews.bit/?Post:20:Paramount+cracks+down+on+%22The+Godfather%22+pirates,+after+44+years)\n\n[Youtube threatens legal action against video downloader](http://127.0.0.1:43110/bcnews.bit/?Post:19:Youtube+threatens+legal+action+against+video+downloader)\n\n[Fan-created movie subtitle site operator facing prison](http://127.0.0.1:43110/bcnews.bit/?Post:18:New+blog+post)\n\n[Prince gave a file-hosting site a personal 30 min piracy lecture](http://127.0.0.1:43110/bcnews.bit/?Post:17:Prince+gave+a+file-hosting+site+a+personal+30+min+piracy+lecture)\n\n[ISP vows to protect users from a piracy witch hunt](http://127.0.0.1:43110/bcnews.bit/?Post:16:ISP+vows+to+protect+users+from+a+piracy+witch+hunt)\n\n[Opera browser adds free and unlimited VPN](http://127.0.0.1:43110/bcnews.bit/?Post:15:New+blog+post)\n\n[More ->](http://127.0.0.1:43110/bcnews.bit)",
	"next_post_id": 23,
	"demo": false,
	"modified": 1465318210,
	"post": [
		{
			"post_id": 22,
			"title": "Youtuber sued over Stanley Kubrick movies analysis",
			"date_published": 1465317382,
			"body": "##### [Original post](https://torrentfreak.com/youtuber-sued-stanley-kubrick-movies-analysis-160606/&utm_medium=zeronet&utm_campaign=http://127.0.0.1:43110/bcnews.bit) by [Andy](https://torrentfreak.com/author/andy/) on June 6, 2016 - [TorrentFreak](https://torrentfreak.com)\n\n<center>![clockwork](https://ipfs.pics/ipfs/QmPvyNKBtpqvTbysAZMK7uAhcKmaDGoTcYxEPM5zNWuqxT)</center>\n\n*A YouTube user who creates video essays has been hit with a punishing lawsuit after selecting Stanley Kubrick as a subject matter and uploading his work to YouTube. UK-based Lewis Bond from Channel Criswell is being targeted by the music publishers behind the 1971 classic 'A Clockwork Orange' who want huge damages for willful infringement.*\n\n---\n\nUndoubtedly the lion’s share of copyright infringement lawsuits filed in the United States concern file-sharing activity, something which inevitably pits large entertainment corporations against Joe Public. David versus Goliath, it now seems, is heading to YouTube channel near you.\n\nLate Friday, TorrentFreak received a tip linking us to a YouTube video posted on [Channel Criswell]([Channel Criswell](https://www.youtube.com/channel/UCL5kBJmBUVFLYBDiSiK1VDw)). In it a visibly shaken and somewhat bewildered young man tries to keep his composure while delivering what is clearly upsetting news.\n\n“A couple of hours ago I received a court summons in the post. The reason I’m being sued is for the Stanley Kubrick video that I uploaded in February. I don’t know what to do,” said Channel Criswell operator Lewis Bond.\n\n<center><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/U9Ev22Ixxws\" frameborder=\"0\" allowfullscreen></iframe></center>\n\n“I thought all this was over and done with and we could move on and no-one would have to take any legal action. But apparently I am being sued for copyright infringement and the people that have filed this lawsuit against me are after the maximum damages, which if I’ve read it correctly can be up to $150,000. And this….this would ruin me,” he choked.\n\nTo understand the nature of this case it’s first necessary to examine Lewis’ work. Watching just a couple of minutes of the video embedded below should leave readers in no doubt that his work is documentary in nature, with masses of commentary and criticism throughout. Lewis Bond is a talented man.\n\n<center><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WFxPkhLNrcc\" frameborder=\"0\" allowfullscreen></iframe></center>\n\nThroughout the five minute [video](https://www.youtube.com/watch?v=U9Ev22Ixxws&app=desktop) in which Bond reports his plight, the young filmmaker never refers to the people behind the lawsuit by name. However, we have ascertained that the claimants are US-based Serendip LLC and their claim has nothing to do with Kubrick himself.\n\nIn a complaint filed in a New York District Court back in March, Serendip LLC explain that they own the copyrights to music created by composer Wendy Carlos. Among other works, Carlos wrote the soundtracks for both A Clockwork Orange (1971) and The Shining (1980). The complaint involves the former.\n\n“The three pieces of music at issue in this action were used in the soundtrack of the motion picture ‘A Clockwork Orange’, entitled ‘Title Music From A Clockwork Orange’, ‘March From A Clockwork Orange’ and ‘William Tell Overture’,” the company explains.\n\n“Unbeknownst to, and without permission or license from, Serendip, Defendant Lewis Bond made derivative works of music and sound recording works by Wendy Carlos in the soundtrack of a video, entitled ‘Stanley Kubrick – The Cinematic Experience.’\n\n“On or about February 20, 2016, with the purpose, inter alia, of monetizing the video for his own benefit, Defendant uploaded the video with user name Channel Criswell to YouTube.com and linked to the YouTube video on Twitter.com and Patreon.com.”\n\nSerendip describe the video (embedded above) as a “mélange of brief snippets taken from Stanley Kubrick’s motion pictures” alongside an “aggregate of about 3 minutes of music taken from the three tracks listed in the complaint.\n\nThe publisher says that the music used by Bond represents “substantial portions” of the tracks “ranging from 18% of a piece of 7 minutes duration to 45% of a piece of 2 minutes 20 seconds duration.”\n\n<center>\n**LEWIS IN HAPPIER TIMES**\n![lewesbond](https://ipfs.pics/ipfs/QmP9PsdayBBrqedAUuGM1HChRuAazM7bZQUR6gUvDFWb2e)\n</center>\n\nThere is absolutely no mention of a fair use exception in the lawsuit filed by Serendip however there is a subtle hint that the company might believe that Bond’s commentary on Kubrick’s work not only stopped short of musical analysis, but also presented Carlos’ work out of context.\n\n“With the exception of about 5 seconds of the ‘William Tell Overture’, the music is not synced to picture as in the soundtrack of ‘A Clockwork Orange’, but instead is used behind many unrelated snippets from various Kubrick movies and the video shorts. At no time, does the video commentary discuss the music or its context as displayed in the video,” the lawsuit reads.\n\nAccording to the publisher it sent a takedown notice to YouTube back in February and the platform responded by disabling the video. In response, Bond reportedly filed a counter-notice, which YouTube passed on with a note that “Serendip must file a federal court action within 10 business days or YouTube may reinstate the video to YouTube.com.”\n\nFrom this point it’s clear that Bond felt that Serendip had overstepped the mark and according to the publisher he expressed those concerns several times in public. In summary, however, Serendip feel they are absolutely entitled to sue the YouTuber, describing his actions as “willful, intentional, and purposeful, in disregard of and indifferent to Serendip’s rights.”\n\nIn addition to an injunction the publisher is also pressing for statutory damages of up to $150,000 per infringement plus attorneys fees.\n\nOnly time will tell how this case will play out, but by picking on the easiest of soft targets Serendip is unlikely to endear itself with the Internet masses. The [Ludovico technique](https://en.wikipedia.org/wiki/Ludovico_technique) sickened Alex whenever he heard his beloved Beethoven. This lawsuit might sadly do the same for fans of the brilliant Clockwork Orange."
		},
		{
			"post_id": 21,
			"title": "Movie companies want to destroy massive pirate communities",
			"date_published": 1464892636.78,
			"body": "##### [Original post](https://torrentfreak.com/movie-companies-want-to-destroy-massive-pirate-communities-160602/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Torrentfreak+%28Torrentfreak%29) by [Andy](https://torrentfreak.com/author/andy/) on June 2, 2016 - [TorrentFreak](https://torrentfreak.com)\n\n<center>![bomb](https://ipfs.pics/ipfs/QmdHUDuC4Tad6UYJPpG1VgGYTX6n64UNfnRFiV1AUp7HaP)</center>\n\n*Social networks are increasingly being used to spread copyrighted content but rather than take down infringing items individually, entertainment companies would like to take a broader approach. Should copyright holders be allowed to wipe out communities with millions of members to protect copyright?*\n\n---\n\nVKontakte (or Russia’s Facebook as it’s often known) is the largest European social network with 300 million registered users, around a third of which are active. Due to the way it hosts user content largely without question, VK carries huge amounts of infringing movies, music, TV shows.\n\nLike similar sites, vKontakte has groups dedicated to endless regular topics. It also has groups dedicated to movie and TV show piracy inhabited by those looking to obtain content for free. Of course, copyright holders have the ability to take this content down via regular takedown notices, but like their counterparts in the West they’re [tired of playing whac-a-mole](https://torrentfreak.com/riaa-ceo-piracy-notices-are-costly-increasingly-pointless-150924/).\n\nTo this end, copyright holders are now teaming up to put vKontakte under pressure to remove entire groups from where infringing content is being made available. Under the immediate spotlight are the ten largest groups specializing in movies and TV shows. They are huge.\n\nAlexei Byrdin of the Internet Video Association informs Russia’s [Izvestia](http://izvestia.ru/news/616233) that each group has a minimum of one million members while the largest has more than seven million. As a result the rightsholders’ anti-piracy group wants vKontakte to completely take them down.\n\n“We have repeatedly appealed to the groups themselves to remove the content, but the complaints were not satisfied and content continued to be active,” says [WebKontrol](http://webkontrol.com/en/) CEO Olga Valigurskaya, adding that if vKontakte wants to do the right thing it should either delete all the content or remove the groups altogether.\n\nHowever, vKontakte’s owners over at [Mail.ru](https://en.wikipedia.org/wiki/Mail.Ru) (who own all three top social networking platforms in the country) see the situation somewhat differently, as do vKontakte themselves.\n\n“In most cases we refuse to block communities specializing in video content as we consider this measure excessive,” a vKontakte spokesperson explained.\n\n“Instead, we remove specific videos that violate the rights of a particular copyright holder, provided that the rightsholder has provided all the necessary documents. And managers of these communities are sent a notification about the inadmissibility of posting illegal content.”\n\nRightsholders wanting broad anti-piracy action and tech platforms demanding a precision approach is a common and growing theme online today. A similar war of words is playing out in both the United States and Europe, where whole sites are being censored and entertainment companies are demanding a “takedown, staydown” approach to copyright enforcement.\n\nWhether they will get their way remains to be seen, but in the meantime the battle lines are being drawn in Russia – and unsurprisingly it’s copyright versus tech all over again.\n\n“The platform should stop IP violations. If they cannot stop the violation in any other way, except to remove a whole group, then it is necessary to remove the group,” National Federation of the Music Industry (Sony, Universal, Warner, EMI) chief Leonid Agronov told Izvestia.\n\nAgronov’s stance was predictably rejected by Sergey Grebennikov, director of the Regional Public Center of Internet Technologies ([ROCIT](http://rocit.ru/)), a non-profit with a mission to popularize the Internet.\n\n“Deleting whole groups is unlawful,” he said. “Removals should concern only the videos, for which rightsholders have rights.”\n\nThere can be little doubt that the issue of infringing online content is largely descending into a worldwide battle not between copyright holders and actual pirates, but between entertainment companies and Internet platforms such as vKontakte, YouTube and Google. It won’t be settled any time soon.\n"
		},
		{
			"post_id": 20,
			"title": "Paramount cracks down on \"The Godfather\" pirates, after 44 years",
			"date_published": 1464730327.985,
			"body": "##### [Original post](https://torrentfreak.com/paramount-cracks-godfather-pirates-44-years-160529/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on May 29, 2016 - ([TorrentFreak](https://torrentfreak.com))\n\n<center>![paramount1](https://ipfs.pics/ipfs/QmWtSNjXfhqqquPg7Z4T7RqurDMoN7wXdiSxC25sYEW8zu)</center>\n\n*The all-time classic The Godfather is not too far away from its 50 year anniversary, but that doesn't mean Paramount Pictures is letting people pirate the movie without consequences. Over the past several months the movie studio has sent warnings targeting alleged pirates, including a mention of a potential lawsuit.*\n\n---\n\nLike many other Hollywood studios, Paramount Pictures sees online piracy as a major threat to its revenues.\n\nTorrent sites such as The Pirate Bay and KickassTorrents represent a thorn in the side and the company is doing everything in its power to limit the damage.\n\nFor Paramount this includes tracking down and warning individual users of these sites. Generally speaking, rightsholders monitor people who share recent blockbusters or TV-shows, but there are exceptions.\n\nTorrentFreak has learned that the Hollywood studio started sending takedown notices targeting Internet subscribers whose accounts were used to download and share the 1972 classic The Godfather.\n\nWith help from its anti-piracy partner IP-Echelon the studio is contacting ISPs, asking the companies to “disable” the copyright infringements and make sure that their subscribers stop sharing the film.\n\n“We are requesting your immediate assistance in removing and disabling access to the infringing material from your network. We also ask that you ensure the user and/or IP address owner refrains from future use and sharing of Paramount materials and property,” the letter reads, listing the technical details.\n\n<center>![godfatherwarn](https://ipfs.pics/ipfs/QmTekWzxTdRYqUwEo8wuf8NT5oGykXf8fWxeWqaxicmJuC)</center>\n\nIn addition, Paramount urges the ISP not to destroy any data such as IP-address logs, even if the retention period has expired. The movie studio mentions that this data may be required if a lawsuit is filed at a later stage.\n\n“In complying with this notice, [ISP] should not destroy any evidence, which may be relevant in a lawsuit, relating to the infringement alleged, including all associated electronic documents and data relating to the presence of infringing items on your network, which shall be preserved while disabling public access, irrespective of any document retention or corporate policy to the contrary.”\n\nThe lawsuit mention may cause some file-sharers to panic, but is likely little more than a mafia-inspired threat. Paramount is generally not known to file cases against individual file-sharers, even though it has sent out many similar takedown notices in the past.\n\nIn fact, many Hollywood studios and other rightsholders send out similar letters, [such as HBO](https://torrentfreak.com/hbo-warns-game-of-thrones-pirates-removes-torrents-160507/) with recent episodes of Game of Thrones. That said, the Godfather notice is by far the “oldest” we have seen, which makes it record-worthy."
		},
		{
			"post_id": 19,
			"title": "Youtube threatens legal action against video downloader",
			"date_published": 1464649452.299,
			"body": "##### [Original post](https://torrentfreak.com/youtube-threatens-legal-action-video-downloader-160530/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on May 30, 2016 - ([TorrentFreak](https://torrentfreak.com))\n\n<center>![yt](https://ipfs.pics/ipfs/QmQdiYc36kCusXh4uAp9Qu1TxSDsTAZqDfHP8unYb5ZKxn)</center>\n\n*YouTube continues to crack down on sites and services that allow people to download videos from the site. Most recently, YouTube urged the operator of TubeNinja to cease his activities, or face potential legal action instead. For now, however, the video download service has no plans to change its course.*\n\n---\n\nWith over a billion users YouTube is the largest video portal on the Internet.\n\nEvery day users watch hundreds of millions of hours of video on the site, and for many it’s a prime source to enjoy music as well.\n\nWhile YouTube is a blessing to thousands of content creators, there are also concerns among rightsholders. Music labels in particular are not happy with the fact that music videos can be easily downloaded from the site with help from external services.\n\nTo address the problem YouTube is contacting these third party sites, urging them to shut down this functionality. Most recently, YouTube’s legal team contacted the popular download service [TubeNinja](http://en.tubeninja.net/).\n\n“It appears from your website and other marketing materials that TubeNinja is designed to allow users to download content from YouTube,” the email from YouTube’s legal team reads.\n\nAccording to YouTube the video downloader violates the terms of service (ToS) of both the site and the API. Among other things, YouTube’s ToS prohibits the downloading of any video that doesn’t have a download link listed on the site.\n\nLater, Google’s video service adds that if the site owner continues to operate the service this “may result in legal consequences.”\n\n<center>![youlett2](https://ipfs.pics/ipfs/QmetLhHtKnToytNPUzcukjaBf62MPzXE2rTwpTVT4HEmGj)</center>\n\nDespite the threatening language, TubeNinja owner Nathan doesn’t plan to take the functionality offline. He informed YouTube that his service doesn’t use YouTube’s API and says that it’s the responsibility of his users to ensure that they don’t violate the ToS of YouTube and TubeNinja.\n\n“Our own ToS clearly states that the user is responsible for the legitimacy of the content they use our service for,” Nathan tells us.\n\nTubeNinja doesn’t believe that YouTube has a very strong case and Nathan has asked the company for clarification. He also mentions that Google’s very own Chrome service lists many plugins that offer the exact same functionality.\n\n“They don’t even seem to enforce removal of Chrome plugins that enable users to do the exact same thing,” Nathan says.\n\n“Also the fact that services like Savefrom, Keepvid, clipconverter etc have been around since 2008, we find it hard to believe that there is any legal case at all. Kind of like suing a maker of VHS-recorders for users taping the television broadcast,” he adds.\n\nThis isn’t the first time that YouTube has taken action against download services. The site has gone after similar sites in the past\n\nIn 2012 Google [went after](https://torrentfreak.com/google-threatens-to-sue-huge-youtube-mp3-conversion-site-120619/) Youtube-mp3.org with a message similar to the one TubeNinja received, but despite these efforts the site remains one of the most used conversion tools with millions of visitors per day.\n"
		},
		{
			"post_id": 18,
			"title": "Fan-created movie subtitle site operator facing prison",
			"date_published": 1464380444.029,
			"body": "##### [Original post](https://torrentfreak.com/fan-created-movie-subtitle-site-operator-facing-prison-160525/) by [Andy](https://torrentfreak.com/author/andy/) on May 25, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![uk-flag](https://ipfs.pics/ipfs/QmXMKD2AoRzgeuh4qi5ePG7JabbZMkfGNp9gUjs1Qcm2wu)</center>\n\n*The operator of a site that hosted fan-made translated movie subtitles has been prosecuted in Sweden. Undertexter.se was raided by police in the summer of 2013, despite many feeling that the site had done nothing wrong. That is disputed by the prosecutor who says that the crimes committed are worthy of imprisonment.*\n\n---\n\nRunning a site offering or even linking to pirated movies and TV shows can be a hazardous occupation. It attracts the attention of copyright holders, the police, and in some cases even governments. For those running them these perils represent an occupational hazard.\n\nBut what if a site creates its own content and distributes that online, should that be a crime? That question is about to be answered in a unique case featuring fan-populated subtitling site Undertexter.se.\n\nFor ten years Undertexter (‘subtitles’ in Swedish) provided a somewhat useful service. Faced with what they perceived as a dearth of subtitling in local language, members of the site made their own translated subtitles for movies and TV shows. These were made available to all via the site.\n\nHowever, in the summer of 2013 everything came crashing down. Under pressure from powerful Hollywood-based movie companies, police [raided](https://torrentfreak.com/fan-created-subtitle-site-raided-by-swedish-police-130710/) the site and seized its servers.\n\n“The people who work on the site don’t consider their own interpretation of dialog to be something illegal, especially when we’re handing out these interpretations for free,” site founder Eugen Archy said at the time.\n\nThe authorities firmly disagreed, Archy was arrested, and the investigation into his site continued. Now, almost three years later, the Undertexter founder has been prosecuted for distributing infringing subtitles.\n\n“I have indicted the person I say is behind the site Undertexter.se which made the dialogue from 74 films available to the public,” [says](http://sverigesradio.se/sida/artikel.aspx?programid=83&artikel=6438501) prosecutor Henrik Rasmusson.\n\nOf particular interest is the nature of the 74 movies referenced by the prosecution. Rather than tackle all of the subtitles on the site, the prosecution appears to have hand-picked a few dozen that gives them the strongest case, i.e those that relate to movies that weren’t commercially available in Sweden at the time.\n\nThe underlying suggestion is that those who created the subtitles either managed to legally view them in other regions or more likely carried out their translation work from pirate copies available online. Also, since the majority of Undertexter’s traffic came from Sweden, it’s likely that users of the site married the subtitles up with pirate copies.\n\nArchy does not deny that he founded and operated the site, nor does he refute claims that he made some money from his activities, largely through on-site advertising. However, he does believe that offering fan-created subtitles is not a crime.\n\nUnsurprisingly, Rasmusson strongly disagrees and even suggests that a prison sentence could be a possible outcome of this prosecution.\n\n“This particular type of case, with pirate subtitles for pirate movies, has not been tried before. But the scale is at such a level that the penalty does not stop at fines, but imprisonment. It could be a suspended sentence,” Rasmusson [says](http://www.idg.se/2.1085/1.658930/domstol-undertexter-pirat).\n\nSoon it will be up to the court to decide whether distributing fan-created subtitles is a crime in Sweden. Experts have already weighed in on the case with Sanna Wolk, an associate professor of civil law at Uppsala University, noting that the devil could be in the detail.\n\n“The core issue is whether the lyrics count as independent works or pure translations. If they follow the script, it’s a copyright violation to distribute them without permission, but if they’re self-published, it is not,” Wolk [noted](https://torrentfreak.com/raided-subtitle-site-crowdfunds-grand-relaunch-130712/) earlier.\n\n“It is difficult to say where the exact line is. Subtitles need to be considered on their own merits to make an assessment.”"
		},
		{
			"post_id": 17,
			"title": "Prince gave a file-hosting site a personal 30 min piracy lecture",
			"date_published": 1461343321,
			"body": "##### [Original post](https://torrentfreak.com/prince-gave-a-file-hosting-site-a-personal-30-min-piracy-lecture-160422/) by [Andy](https://torrentfreak.com/author/andy/) on April 22, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![uk-flag](https://ipfs.pics/ipfs/Qmd31yzj6Z1S3vBSBWhTYbdYDcVoFEHJEvngRjH8EcnZ4X)</center>\n\n*After the sad passing of Prince yesterday, people have been paying tribute to the superstar musician. According to the operator of a file-hosting site that was hosting unauthorized copies of his tracks, Prince once personally called him on his cellphone and gave him a 30 minute talk on the perils of piracy.*\n\n---\n\nYesterday the world had to come to terms with the fact that one of the greatest musicians of the modern age was no longer with us. As first [reported](http://www.tmz.com/2016/04/21/prince-dead-at-57/) by TMZ, Prince passed away at Paisley Park, aged just 57.\n\nWhile undoubtedly a musical genius, Prince’s relationship with the Internet was often a difficult one, with the entertainer even [withdrawing](http://www.theguardian.com/music/2015/jul/02/prince-pulls-music-from-all-streaming-services-except-tidal) all of his music from the major streaming services last year, leaving it only on Tidal.\n\nBut in file-sharing circles Prince was probably best known for his efforts to bring Internet piracy to an end. Almost nine years ago as part of an initiative to “reclaim the Internet”, Prince [hired](https://torrentfreak.com/prince-hires-web-sheriff-t0-take-on-the-pirate-bay-070914/) controversial anti-piracy outfit Web Sheriff to hit sites including YouTube, eBay, and of course, The Pirate Bay. The letter the site received on his behalf [was ‘unique’](https://torrentfreak.com//images/sheriffletter.gif) to say the least.\n\n“Well, ‘way to go on losing all your fans’,” Pirate Bay’s Peter Sunde told TF at the time. “I truly respect the son of a king’s work as a musician but he seems like he has some kind of problem in getting to deal with his fans.”\n\nIn the end that particular threat of legal action came to nothing but Prince’s fight against piracy never ended and sometimes pushed the boundaries of sensible. In 2014 Prince shocked almost everyone by threatening to sue 22 fans who posted links to videos of his concerts on Facebook.\n\n“Prince has suffered and is continuing to suffer damages in an amount according to proof, but no less than $1 million per Defendant,” the lawsuit [read](https://torrentfreak.com/prince-hits-music-pirates-with-22m-lawsuit-140127/).\n\nJust a day later the lawsuit was withdrawn, adding yet another mystery to Prince’s life.\n\nBut whatever one might think of the man’s attitude towards the Internet and indeed piracy, one had to admire his commitment. While obviously keen to protect his own interests, Prince seemed to truly care about artists’ welfare. Interestingly, an extraordinary story that surfaced last night underlines just that.\n\nWhen unauthorized content appears online, most artists and their labels rely on a chain of middle men to do the work for them, including taking content down and/or issuing legal threats. Indeed, Prince has relied on this mechanism himself many times in the past.\n\nHowever, according to the operator of music hosting site [YourListen](http://yourlisten.com/), Prince wasn’t averse to dealing with things personally. After allowing only Tidal to stream his music, Prince discovered unauthorized music on YourListen – and decided to do something about it.\n\n“I never thought in my life I would get a call on my cell phone from Prince,” Scott Goodman [told](http://www.scpr.org/programs/the-frame/2016/04/21/48190/prince-s-music-movies-mentorship-and-fight-against/) The Frame.\n\n“We never had the artist decide to physically call us and ask us to take that music down,” he said, noting that function was mostly carried out by automated bots.\n\nAmazingly, Goodman says that Prince stayed on the line for almost 30 minutes to explain why he was determined to protect his music.\n\n“His big picture and his goal and battle he’s been fighting for decades is stopping piracy. He truly believed that piracy could come to an end with people like him, who obviously had power and money. He told me, ‘Scott, we need to fight piracy. We cannot have musicians having their music stolen’,” Goodman says.\n\nHaving someone like Prince make a personal call to any kind of file-sharing site is absolutely unprecedented and it certainly appears to have had an impact on Goodman. Of course, one phone call is unlikely to change the world, but the thought that someone as reclusive as Prince believed in a cause enough to make that call himself is quite something.\n\n“Prince fought the music industry, but also the internet (sued me at least once),” Pirate Bay co-founder Peter Sunde [said](https://twitter.com/brokep/status/723222302276489217) last night.\n\n“He was a creative genius, deserves so much respect. RIP.”"
		},
		{
			"post_id": 16,
			"title": "ISP vows to protect users from a piracy witch hunt",
			"date_published": 1461342998.517,
			"body": "##### [Original post](https://torrentfreak.com/isp-vows-to-prevent-users-from-a-piracy-witch-hunt-160422/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on April 22, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![trollssign](https://ipfs.pics/ipfs/QmZ92k7dCrpLkAtQ2HWWd8K3XnfgUfAvejVyiH6dGKSCq8)</center>\n\n*Swedish Internet service provider Bahnhof says it will do everything in its power to prevent copyright holders from threatening its subscribers. The provider is responding to a recent case in which a competing ISP was ordered to expose alleged BitTorrent pirates, reportedly without any thorough evidence.*\n\n---\n\nIn recent years file-sharers all across Europe have been threatened with lawsuits, if they don’t pay a significant settlement fee.\n\nThe process was pioneered in [Germany](https://torrentfreak.com/lawyers-sent-109000-piracy-threats-in-germany-during-2013-140304/) where it turned into an industry by itself, but copyright holders have also targeted alleged pirates in the UK, Finland and elsewhere.\n\nSweden is one of the latest countries where these so-called “copyright trolls” have landed. At the birth ground of The Pirate Bay, media outfit [Crystalis Entertainment](http://www.crystalis-entertainment.com/) received permission from the court to identify several BitTorrent users, based on their IP-addresses.\n\nThe case, which could be the first of many, was filed against the local ISP TeliaSonera who handed over the requested information without putting up much of a fight.\n\nThis prompted the competing Internet provider [Bahnhof](https://www.bahnhof.se/) to issue a warning. The company notes that the copyright holder in question doesn’t have a very strong case, and it criticizes Telia for caving in too easily.\n\n“The Stockholm district court did not even see any evidence showing that these IP addresses were actually used for file sharing. It could basically be one of these Nigerian mail scams,” Bahnhof CEO Jon Karlung says.\n\n“I think that Telia folded caved in too easily. Although Crystal Entertainment properly represents certain copyright holders, at Bahnhof we would choose to appeal,” he adds.\n\nThe ISP says that they will not hand over any data without urging for a proper review of the evidence.\n\nThis is no surprise for a company that’s heavily focused on user privacy. Bahnhof’s tagline is “Internet with privacy” and two years ago the ISP was one of the first to launch a [free VPN](https://torrentfreak.com/isp-provides-free-vpn-to-protect-customer-privacy-141117/), responding to a legal requirement that required it to log subscriber activities.\n\nIn a press release Bahnhof explains how these extortion-like demands from copyright holders have become commonplace in Germany. It’s exactly this type of witch hunt is something they hope to prevent in Sweden.\n\nThis means that if copyright holders demand the same info from Bahnhof, they will fight this in court.\n\n“We have to follow the law and no one can predict the future, but one thing I can guarantee, we’re on the side if our users. We will do everything in our power to prevent the German situation from spreading,” Karlung says.\n\nBahnhof’s CEO also has some advice for the media companies that are affected by piracy. They should invest their time and money in offering great content, instead of taking their customers to court.\n\n“It is better for copyright holders to put their money into developing services that people want to pay for, like Netflix and Spotify, instead of becoming entrenched in the 1900s,” he concludes.\n"
		},
		{
			"post_id": 15,
			"title": "Opera browser adds free and unlimited VPN",
			"date_published": 1461342396.51,
			"body": "##### [Original post](https://torrentfreak.com/opera-browser-adds-free-and-unlimited-vpn-160421/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on April 21, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![vpnon](https://ipfs.pics/ipfs/QmSAwzLbcg8eLttppUakS3igG3oWxrbwCB2XhcuhuMjewb)</center>\n\n*Opera has become the first major browser to add a free VPN client to its web browser. The VPN offers AES-256 encryption and allows users to browse the Internet privately. In addition, the free VPN also helps to circumvent website blockades, a feature many torrent users will appreciate.*\n\n---\n\nBack in 2006 Opera was the first major browser to include BitTorrent support, and today it releases another feature that will appeal to millions of users.\n\nThe company has added a free and unlimited VPN to the [developer version](http://www.opera.com/developer) of its browser. This means that users can browse the web securely at the [flick of a switch](https://torrentfreak.com/images/operavpn.jpg).\n\nPrivacy aside, the built-in VPN is also an ideal tool to circumvent website blockades. This may come in handy for the aforementioned BitTorrent users as well, as sites such as The Pirate Bay are blocked in many countries.\n\nThe VPN connection is provided by the Canadian VPN service SurfEasy, which like many other [VPNs](https://torrentfreak.com/vpn-anonymous-review-160220/) keeps no logs. SurfEasy was acquired by Opera last year and VP of Marketing Steve Kelly tells TorrentFreak that privacy and censorship were the main reasons to add the free VPN to Opera.\n\n“Everyone deserves to surf privately online if they want to. Today, it is too difficult to maintain privacy when using the web, and way too many people experience roadblocks online, like blocked content,” Kelly says.\n\n“By releasing an integrated, free and unlimited VPN in the browser, we make it simple for people to enhance their privacy and access the content they want,” he adds.\n\nIt is worth highlighting that the VPN connection is limited to the web browser. This means that any content shared outside the browser, through traditional torrent clients for example, is not private.\n\nOpera’s in-browser VPN uses AES-256 encryption and SurfEasy says that the initial response has been very strong. The network is prepared to handle hundreds of thousands of simultaneous connections without any problems.\n\nWith the addition of a VPN feature Opera hopes to set a new standard for modern browsers. Earlier, it was already the first major browser to include an ad-blocker.\n\n“This is the first VPN option integrated into a major browser. Also, it’s delivered from a company you can trust, with an extensive history of providing reliable and trustworthy internet products,” Kelly told us.\n\nMore details about the built-in VPN are available at the [Opera blog](https://www.opera.com/blogs/desktop/2016/04/free-vpn-integrated-opera-for-windows-mac/). People who want to give it a spin should download the latest developer release, as the feature is not available in the regular version yet.\n"
		},
		{
			"post_id": 14,
			"title": "UK govt pushes 10 years jail for online pirates",
			"date_published": 1461259583.459,
			"body": "##### [Original post](https://torrentfreak.com/uk-govt-pushes-10-years-jail-for-online-pirates-160421/) by [Andy](https://torrentfreak.com/author/andy/) on April 21, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![uk-flag](https://ipfs.pics/ipfs/QmPZnkHo3crrngVcNZ3p65mPfbKMnTes8dFn28WQ4ydPY5)</center>\n\n*The UK government has published its conclusions following a consultation into punishments for online copyright infringement offenses. At the earliest opportunity Parliament will be asked to increase custodial sentences up to a maximum of 10 years while ensuring that unwitting pirates are protected.*\n\n---\n\nIn early 2015 a [study](https://torrentfreak.com/is-10-years-in-jail-the-answer-to-online-pirates-150307/) commissioned by the UK Intellectual Property Office (IPO) concluded that criminal sanctions for copyright infringement under the Copyright, Designs and Patents Act 1988 (CDPA 1988) should be amended to bring them into line with offenses such as counterfeiting.\n\nThe report triggered a proposal from the UK government that the maximum prison sentence for online copyright infringement should be increased to ten years. The current maximum of two years is not enough of a deterrent, it was argued.\n\nIn July 2015 the government [launched a consultation](https://torrentfreak.com/uk-wants-10-year-prison-sentence-for-online-pirates-150718/) aiming to gauge opinion on boosting penalties to ensure that online piracy is considered as “no less serious” than offline infringements.\n\nThis morning the government released its conclusions while confirming it will indeed be asking Parliament for a ten year maximum sentence.\n\nIn a published statement, Minister for Intellectual Property Baroness Neville-Rolfe says that more than a thousand responses ([pdf](https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/517797/summary_responses_on_online_copyright_infringement.pdf)) helped to shape the government’s decision to stand by its earlier calls for increased penalties. Demands for additional clarity will also be addressed.\n\n“As a result we are now proposing changes that include increasing the maximum sentence, but at the same time addressing concerns about the scope of the offense,” Neville-Rolfe says.\n\n“The revised provisions will help protect rights holders, while making the boundaries of the offense clearer, so that everyone can understand how the rules should be applied.”\n\nThe minister says that a number of safeguards are already in place to “limit the risk” that a “very low level” infringer could be subjected to a high penalty, including that infringement must be proven to the criminal standard of beyond reasonable doubt.\n\nAddressing concerns raised by the consultation that unwitting infringers might find themselves subjected to draconian sentences when they had no intent to cause any harm, the government references a system that has been in place for some time at the Police Intellectual Property Crime Unit (PIPCU).\n\nWithout mentioning them by name, the report notes that “enforcement agencies and private prosecutors have a staged response system, encompassing education, ‘cease and desist’ notices, and [domain suspension](https://torrentfreak.com/uk-piracy-police-asked-domain-registrars-to-shut-down-317-sites-150821/).”\n\nIn other words, those likely to be targeted by the ten year sentence are given [advance warning](https://torrentfreak.com/uk-police-launch-campaign-to-shut-down-torrent-sites-130604/) by the likes of PIPCU, FACT and the BPI, that they’re treading on thin ice.\n\nThe government also addresses concerns that the term “affect prejudicially” is too vague when used to describe the extent to which a copyright holder needs to be affected before an offense is committed.\n\n“It was argued that a single infringing file could fulfil this requirement in some circumstances (if widely shared subsequent to the infringement for example) therefore setting an unacceptably low threshold for committing the offense,” the government explains.\n\nThe government’s position is that minor infringement does not lead to a criminal prosecution but it does concede that the term “affect prejudicially” has the potential to “give rise to an element of ambiguity.”\n\nPerhaps predictably the consultation raised concerns that a maximum sentence of ten years would place infringement alongside serious offenses such as rape, firearms offenses and child cruelty.\n\nNevertheless, the government feels the sentence is warranted and uses the case brought against [several release group members](https://torrentfreak.com/how-hollywood-caught-the-uks-most-prolific-movie-pirates-151227/) last year as an indicator that while ten years is a maximum, it would only be utilized in the rarest of cases.\n\n“The Government believes that a maximum sentence of 10 years allows the courts to apply an appropriate sentence to reflect the scale of the offending. An example where copyright infringement was deemed to warrant longer than a 2 year sentence is where five defendants received sentences [totaling 17 years](https://torrentfreak.com/uk-movie-pirates-sentenced-to-a-total-of-17-years-151218/) for releasing more than 2,500 of the latest films onto the internet,” the government writes.\n\n“They were prosecuted under the Fraud Act, where the highest sentence was four and a half years. Capping the maximum available sentence at a lower level would unnecessarily limit the ability of the courts to apply appropriate sentences in the more serious cases of copyright infringement.”\n\nThe government [says](https://www.gov.uk/government/consultations/changes-to-penalties-for-online-copyright-infringement) it will now introduce its re-drafted offense provisions to Parliament at the “earliest available legislative opportunity.”"
		},
		{
			"post_id": 13,
			"title": "Kim Dotcom warns Mega users to backup their files",
			"date_published": 1461257258.994,
			"body": "##### [Original post](https://torrentfreak.com/kim-dotcom-warns-mega-users-to-backup-their-files-160421/) by [Andy](https://torrentfreak.com/author/andy/) on April 21, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmbhPjd2Mi4hy4LUYxYgzj7uHuHsjrVWWT94rPv1NthiXg)</center>\n\n*Kim Dotcom is warning users of Mega, the cloud storage company he founded in 2013, to back up their files. According to the entrepreneur, Mega is now under the control of Bill Liu, a New Zealand-based Chinese national that is currently fifth on China's most-wanted criminal list.*\n\n---\n\nIn 2012, a combined effort by the United States and New Zealand governments brought Kim Dotcom’s Megaupload empire to its knees. Coordinated raids in multiple locations carried out by heavily armed officers ensured that a clear message was sent to copyright infringers.\n\nBut despite the overwhelming show of force, Dotcom refused to lie down and just a year later he launched a brand new file-hosting service. Known simply as ‘Mega’, the platform [launched to great fanfare](https://torrentfreak.com/dotcoms-mega-launches-to-unprecedented-demand-130120/) in 2013.\n\nMega quickly became a force to be reckoned with in the hosting market, with Dotcom promoting the platform at every turn. Nevertheless, controversy was never far away.\n\nIn September 2014, Mega was branded a “piracy haven” in a Digital Citizens Alliance report into the activities of “[shadowy cyberlockers](https://torrentfreak.com/report-brands-dotcoms-mega-a-piracy-haven-140918/).”\n\nAs a direct consequence and under pressure from the U.S. government, in early 2015 PayPal stopped [processing payments](https://torrentfreak.com/under-u-s-pressure-paypal-nukes-mega-for-encrypting-files-150227/) for Mega. There can be little doubt that hurt the site.\n\nBut behind the scenes other matters were becoming a distraction. In May 2015, Mega’s bid for a stock listing [fell through](https://torrentfreak.com/megas-bid-for-stock-exchange-listing-falls-through-150506/) and just two months later Dotcom’s earlier praise for the company turned sour.\n\n“Mega has experienced a hostile takeover and is no longer in the control of people who care about Internet Freedom. The New Zealand Government and Hollywood have seized a significant share of the company,” Dotcom told TorrentFreak.\n\n“The combined shares seized by the NZ government and Hollywood were significant enough to stop our listing on the New Zealand stock exchange.”\n\nDotcom had already [resigned](https://torrentfreak.com/kim-dotcom-resigns-as-mega-director-to-focus-on-music-venture-130904/) as a director of Mega in September 2013 but now he was publicly warning people against using the site.\n\nToday Dotcom repeated those calls, warning users of Mega over what he sees as the precarious position of the company.\n\n“Mega had to survive without a credit card payment processor for almost 2 years now. The air is getting thin. Backup your Mega files,” he [told](https://twitter.com/KimDotcom/status/722942842193055745) users via Twitter.\n\nBut while a lack of payment processing options certainly won’t be helping Mega, Dotcom sees more danger in the reported controller of Mega, Chinese national and New Zealand citizen Bill Liu.\n\nBack in 2009, Liu made headlines when it was revealed that despite being wanted for fraud in China, he was [granted citizenship](http://www.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=10554388) in New Zealand. Now it’s been revealed by kiwi Prime Minister John Key that Liu is ranked number five on China’s “Top 100” extradition list.\n\n“I haven’t seen the list, but there is a list,” Key [said](http://www.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=11626012).\n\n“They’ve also put out a list worldwide of the Top 100. Bill Liu is number five on it,” he said of the Chinese government.\n\nNew Zealand police have already seized millions of dollars of assets that are believed to belong to Liu, including some held in Mega, although Liu denies all wrong doing. Dotcom, however, remains unconvinced.\n\n“The 5th most wanted criminal in China is in control of Mega and he wants to float the business in HK? Good luck,” he [said](https://twitter.com/KimDotcom/status/722941208444547073) this morning.\n\nAs these situations go, the short history of Mega is utterly unique. Never before has a platform in the file-sharing space had two entrepreneurs each worth millions of dollars being pursued for extradition by two of the world’s most powerful governments for entirely different reasons.\n\nIt’s currently very late evening in New Zealand so we’re not expecting an immediate response from Mega to our requests for comment. We’ll add them here as soon as they arrive.\n\nUpdate: Statement from Mega chairman Stephen Hall\n\n“Mega has significant funding and strong support from shareholders so its financial position is certainly not precarious. Dotcom’s comment is factually incorrect and the motive is unknown,” Hall informs TF.\n\n“Mega continues to experience strong growth which illustrates the global appreciation of the quality of its services. Mr Liu has a shareholding interest but has no management or board position so he certainly doesn’t control Mega.”"
		},
		{
			"post_id": 12,
			"title": "Pirate Bay founder : Streaming model could ignite new piracy war",
			"date_published": 1461169832.669,
			"body": "##### [Original post]() by [Andy](https://torrentfreak.com/author/andy/) on April 20, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmYCFF5EeqmCiV8miSm3fua2D1iPKSSxKo3A9bECi9iYkr)</center>\n\n*As streaming services such as Netflix and Spotify gain even greater traction, so does the centralization of online content that consumers no longer own. According to Pirate Bay founder Peter Sunde this business model holds subscribers to ransom, with the threat of content being suddenly taken away now a constant threat.*\n\n---\n\nAfter signing up to Spotify several years ago one of my first tasks was to begin hand-crafting playlists of the thousands of 1980s and 1990s dance tracks I had previously bought on vinyl.\n\nOnce lovingly stacked and indexed in a spare room, these much-loved relics of a bygone era are now gathering dust in the attic, probably never to be played again. Or at least that’s what I thought.\n\nSlowly but surely, tracks have been disappearing from my Spotify playlists with no explanation, including a rare Prodigy remix of a Praga Khan [track](https://www.youtube.com/watch?v=FT6ivFnbgbY) that finally triggered me to sign up to Spotify in the first place. If Spotify had that they must have everything, I assured myself at the time.\n\nWhile the disappearance of some music from the service is to be expected, it doesn’t make it any less of a disappointment when it happens. It also undermines confidence in the product. After all, if one had bought the track instead of streaming it, it would still be here today. It’s a situation that’s familiar to The Pirate Bay co-founder Peter Sunde who in a new interview with Germany’s [FutureZone](http://futurezone.at/netzpolitik/pirate-bay-gruender-facebook-gehoert-aus-europa-verbannt/193.947.977) recalls similar experiences.\n\n“I stopped using Spotify when suddenly overnight several titles disappeared from my playlist because the licenses for them were revoked. Someone else had decided which music I could listen to and which I could not. I had no backup, so I lost the music. I do not want that,” Sunde says.\n\nTo hear that Peter Sunde (by all accounts one of the world’s most infamous pirates) had placed his trust and his money with a legitimate content provider indicates that at its core Spotify had something good to offer. After all, it’s hardly an argument that Sunde was unable to obtain the music from elsewhere.\n\nBut what is perhaps most remarkable is that Sunde actually patronized a service which at its very core is the complete opposite of what The Pirate Bay stood for. Forget for a moment the notion of paying or not paying for media, that’s a distraction.\n\nWhat the Pirate Bay did was empower its users to participate in a somewhat decentralized communications infrastructure which allowed them to build archives of music, movies, TV shows and software in their own homes. Not only did they ‘own’ that content but much more importantly they exercised complete, physical control over it. Licenses getting revoked? Not a chance.\n\nFor all their great qualities (and they have them by the bucket load), Spotify and other streaming services such as Netflix offer something quite different – total centralization and a complete lack of user control over the content they’re buying renting.\n\n“When we look at the development of Netflix it is exactly the same as a Spotify for movies,” Sunde says. “What streaming has done is centralize the ownership of culture.”\n\nAnd of course Sunde is absolutely right. At any point Spotify, Netflix and any other streaming service has the power to remove content, modify it, [restrict access](https://torrentfreak.com/tens-of-thousands-protest-netflixs-vpn-blockade-160226/) to it geographically or – heaven forbid – go bankrupt, shut down, and deny access to it altogether.\n\nHowever unlikely, it is possible that people invested in these services could be blasted back to a world without music and movies in an instant, should economic (or Internet disaster) circumstances dictate it. Unless people have physical access to that content they are done. Sunde wonders whether people will continue to put up with this scenario in the future.\n\n“Maybe in five years time we’ll have a new file-sharing fight because anyone who uses these services will consider that while having access to the content is good, it is not so great having no control and actually owning none of it,” Sunde says.\n\nSo the big question remains: what can be done about it?\n\nIn keeping with Sunde’s previous assertion that he believes that torrent technology has stagnated, the Pirate Bay co-founder doesn’t really offer much hope for those inclined to obtain their content from unofficial sources.\n\n“I have more interesting things to do. One can not eat indefinitely a cake. It may be the best cake in the world, but at some point you have to throw up,” he says.\n\n“I do not know how to fight it. Perhaps with better streaming piracy.”\n\nWith that an unlikely prospect, at least in music, legitimate streaming consumption will continue to grow, and with it the pitfalls of borrowing rather than buying music."
		},
		{
			"post_id": 11,
			"title": "Pirate site blocking boosts interest in VPNs, research shows",
			"date_published": 1461169024.178,
			"body": "##### [Original post](https://torrentfreak.com/pirate-site-blocking-boosts-interest-in-vpns-research-shows-200416/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on April 20, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmWoTbs9Q4gVJ2r9FBuyiTVNyDcFPYCcPVwYXNiqYxeQSJ)</center>\n\n*New research from Carnegie Mellon University shows that UK pirate site blocks increase people's interest in VPN services. However, the blocks also decrease the overall numbers of visits to pirate sites, while boosting the use of legal services such as BBC's iPlayer and Netflix.*\n\n---\n\nFollowing a series of High Court orders, six of the UK’s major ISPs are required to block access to dozens of the world’s most popular ‘pirate’ sites.\n\nThe measures were supposed to make it harder for UK Internet subscribers to access these sites, but the effects on actual behavior are widely debated.\n\nA new [study](http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2766795) published by Carnegie Mellon University and Wellesley College researchers aims to provide some empirical evidence on this issue.\n\nThe researchers investigated the effects of a 2014 court order that required ISPs to block an additional 53 pirate sites. Using data from a panel of 58,809 UK Internet users, they then reviewed the changes in browsing patterns among these users.\n\nNot surprisingly, visits to the blocked sites dropped dramatically, 90% in this case. However, the researchers didn’t observe an increase in visitors to pirate sites that remained unblocked.\n\n“We found that these blocks caused a 90% drop in visits to the blocked sites while causing no increase in usage of unblocked sites. This led to a 22% decrease in total piracy for all users affected by the blocks”\n\nThis suggests that the pirate site blockades are indeed effective to a certain degree. However, as anecdotal evidence has shown in the past, they also boost the interest in circumvention tools such as VPNs.\n\n“Some users of the blocked sites, however, did seem to employ technical workarounds to continue usage of the blocked sites,” the researchers reveal.\n\nThe data show a marginally significant effect which indicates that “for every 10 additional visits to blocked sites before the blocks, a consumer increased their visits to VPN sites after the blocks by an additional 30%.”\n\nIn other words, while some pirates may drop out, there are also those who actively try to circumvent the blockades.\n\nOverall, however, the researchers conclude that there’s a decrease in piracy and an increase in use of legal services. This effect is most pronounced for ad supported streaming services, and to a lesser degree (and only a 75% confidence level) for paid services.\n\n“We also found that these blocks caused a 6% increase in visits to paid legal streaming sites like Netflix and a 10% increase in videos viewed on legal ad supported streaming sites like BBC and Channel 5.”\n\nOne should take into account that the results are based on data from 2014, after several large pirate sites were blocked already. This means that other pirates may have already dropped out after earlier blocks, while the more persistent pirates remain.\n\nThis may also explain why there was a stronger effect on visits to legal services in a [previous study](https://torrentfreak.com/pirate-bay-block-doesnt-boost-sales-research-shows-150604/). That said, the additional blocking measures still change people’s behavior.\n\n“The evidence suggests that blocking large numbers of sites can still ‘move the dial’ in terms of consumer behavior, but that there may be diminishing returns as remaining pirates may be more dispersed or else have lower willingness to pay for legal content.\n\n“Nonetheless, such blocks can serve to mitigate the possibility of a long-term return to the prior status quo,” the researchers add.\n\nThe research was carried out as part of Carnegie Mellon University’s Initiative for Digital Entertainment Analytics, which received a generous donation from the MPAA. However, the researchers suggest that their work is carried out independently.\n\nThat said, the results are likely to be used by the entertainment industries to justify additional blocks around the world."
		},
		{
			"post_id": 9,
			"title": "Microsoft's Azure awarded FACT anti-piracy seal of approval",
			"date_published": 1461082958.688,
			"body": "##### [Original post](https://torrentfreak.com/microsofts-azure-awarded-fact-anti-piracy-seal-of-approval-160419/) by [Andy](https://torrentfreak.com/author/andy/) on April 19, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmZssrkD8s6d6CDkZfsy9WnuCA4o26LDod36CEHts7R6vG)</center>\n\n*Azure, the cloud computing platform created by Microsoft, has become the first service of its type to gain certification from anti-piracy group Federation Against Copyright Theft. The accreditation means that Microsoft has implemented many physical and digital processes designed to thwart online pirates.*\n\n\n---\n\nThe UK’s Federation Against Copyright Theft (FACT) is probably best known for activities aimed at tracking down the operators of pirate sites and the release groups who frequent them.\n\nFinanced by the film industry, over the years FACT has forged partnerships with law enforcement agencies, including the Police Intellectual Property Crime Unit (PIPCU). But while in many instances FACT’s work is reactive, the group also works in precautionary roles.\n\nIn addition to preventing individuals from recording movies in theaters, for example, FACT also runs an accreditation system that aims to hold businesses providing services to the movie and TV sector to a set of high standards. The overall aim is to protect the intellectual property owned by FACT’s members.\n\nThe latest company to achieve FACT certification is Microsoft with its cloud computing platform&nbsp;[Azure](https://azure.microsoft.com/en-gb/). Launched in 2010, Azure provides PaaS (Platform as a service) and along with Amazon Web Services is considered a market leader in Iaas (Infrastructure as a service).\n\n“Microsoft is quite familiar with global anti-piracy efforts, and we believe that extending this attention to our customers’ environments is just as important as safeguarding our own intellectual property,” says Alice Rison, Senior Director, Microsoft Azure.\n\n“That’s why I’m excited to announce Azure’s certification by the Federation Against Copyright Theft (FACT), making Azure the first public cloud to gain this accreditation.”\n\nTo get a flavor of what FACT is trying to achieve with its certification system one only has to look at the&nbsp;[list of companies](http://www.factcertification.com/?page_id=11)&nbsp;that have already gone through the process.\n\nThere are currently 110 businesses with FACT accreditation, such as those offering subtitling services. These might not immediately sound like piracy hotspots but TV shows have been leaked at this point in the chain before, such as the&nbsp;[high-profile pre-release](https://torrentfreak.com/third-unreleased-doctor-episode-leaks-online-140818/)&nbsp;of several Doctor Who episodes in 2014.\n\nOthers, such as companies and hotels involved in pre-release screenings of movies present more obvious security holes, as do those providing courier, logistics, transport and storage services. All of these processes have been exploited in the past to get pre-release content onto the Internet and now FACT is determined to regulate them all.\n\nA handful are a little more obscure. Alchemy Metals Ltd&nbsp;[proudly display](http://www.alchemymetals.com/secure-destruction)&nbsp;its FACT accreditation online, noting that the company utilizes “a variety of methods to ensure your sensitive product has been damaged beyond repair and re-use.” Precisely what Alchemy Metals destroys for the industry is unclear, but operations similar to theirs have been previously been used for the “granulation” of seized computer and video games hardware.\n\nThe inclusion of registered charity&nbsp;[His Church](http://www.bbc.co.uk/news/uk-16058275)&nbsp;for re-use, thus avoiding landfill.\n\nFor Microsoft, however, it is all about keeping those involved in the movie making and distribution process safe from hackers, pirates and other ne’er do wells. Accreditation means an independent security survey and both physical and digital tests, to include security of buildings, alarms systems and CCTV, access control systems, digital security, audit trails plus staff vetting.\n\nAll of this combined establishes whether an organization meets the high standards set by FACT partners such as Universal, Disney, Sony, The Premier League and TV giant BSkyB.\n\n“The FACT certification is yet another demonstration of the investments we’re making in not only ensuring the security of your data, but in gaining your trust as a business partner,” says Microsoft’s Alice Rison.\n\nOf course, all of this comes at a cost. The FACT Certification Fee for each UK site is £2,100 per year. For those outside the UK the fee is the same, plus travel and accommodation expenses.\n\nEarlier this year Microsoft met the standards required by the Motion Picture Association of America’s (MPAA)&nbsp;[cloud security guidelines](http://www.mpaa.org/content-security-program/).\n"
		},
		{
			"post_id": 8,
			"title": "Kickasstorrents next target for Aussie piracy blocklist",
			"date_published": 1461078691.719,
			"body": "##### [Original post](https://torrentfreak.com/kickasstorrents-next-target-for-aussie-piracy-blocklist-180416/) by [Andy](https://torrentfreak.com/author/andy/) on April 18, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmNb1S9x6sq9MqqASWgLzn7ezoiiLYpGo9RA3r2Gujb8QK)</center>\n\n*Record labels Universal, Warner, Sony, and Albert & Son have filed an application at the Federal Court of Australia to have KickassTorrents and associated proxy sites blocked at the ISP level. The action follows a complaint filed by Foxtel to block sites including The Pirate Bay.*\n\n---\n\nAfter years of attempting to clamp down on piracy in 2015 entertainment industry companies in Australia finally had progress to report.\n\n[New legislation](https://torrentfreak.com/australia-passes-pirate-site-blocking-law-150622/) passed last year allowed copyright holders to apply to the Federal Court to have infringing sites blocked at the ISP level.\n\nWhile previous applications have been made on behalf of the movie and TV industries, until now the music sector has remained quiet. That changed today when members of the Australian Recording Industry Association [(ARIA)](http://www.aria.com.au/) and Australasian collecting society [APRA AMCOS](http://apraamcos.com.au/) teamed up to file their first application.\n\nFiled at the Federal Court under section 115A of the Copyright Act 1968, member labels Universal Music Australia Pty Limited, Warner Music Australia Pty. Limited, Sony Music Entertainment Australia Pty Ltd and J Albert & Son Pty Ltd, demanded that leading torrent site KickassTorrents (KAT) be blocked by the country’s ISPs.\n\nCiting a government comment that KAT and others like it are the “worst of the worst” who exploit the “creativity of others” without giving anything back, the industry groups claim that millions of dollars are being made in illegal advertising revenues.\n\n“Online infringement continues to be a major threat to the sustainability of the Australian music industry. Illegal offshore sites like Kickass Torrents show a complete disrespect for music creators and the value of music,” said Jenny Morris OAM, Chair of the APRA Board.\n\n“Australian music fans already have access – for free if they choose – to the world’s repertoire of music via more than 20 legitimate licensed online music services. Blocking access to sites like Kickass Torrents is all about supporting those services and allowing the writers whose songs are available on them to be paid for their work.”\n\nIn addition to blocking KickassTorrents the labels have also applied to have related proxy sites blocked. This means that quick workarounds will be more tricky for the casual pirate. It’s a strategy already employed in the UK and one which has become a feature of two other cases previously filed by the audio-visual industries in Australia.\n\nThose cases feature the movie division of Village Roadshow, Roadshow Films, taking on streaming portal [Solarmovie](https://torrentfreak.com/pirate-site-targeted-by-aussie-blockade-refutes-studio-claims-160219/). TV giant Foxtel is [targeting](https://torrentfreak.com/aussie-pirate-bay-blocking-process-begins-in-federal-court-160315/) The Pirate Bay, Torrentz, isoHunt and TorrentHound.\n\nDue to the sheer number of proxies, mirrors and clones that are facilitating access to those sites, the studios had to contact 61 third-party sites to inform them of the action. None responded. No numbers have yet been published but there are dozens of KickassTorrents variants so a similar process will have to be undertaken in this case too.\n\nAlso potentially muddying the waters is KickassTorrents’ claim that they take down copyright-infringing content following complaints from rightsholders.\n\nThe site’s users will be familiar with thousands of torrents disappearing from the platform but whether that will be enough to differentiate it under section 115a from a site whose “primary purpose to infringe” is unlikely in a non-adversarial process.\n\n“Last year ARIA welcomed the Federal Government’s passing of section 115A as a critical element in supporting the legitimate digital content market in Australia,” said ARIA CEO Dan Rosen.\n\n“ARIA and its members believe that this case will be an important step to ensure Australians are accessing their music from sites which contribute to our local industry, so that we can continue investing in talent to make the music we all love.”\n\nThe video cases are due back in court during early May following discussions with ISPs over the technicalities of blocking. While those negotiations appear to have been somewhat drawn out, future cases should prove much smoother to handle."
		},
		{
			"post_id": 7,
			"title": "Netflix: VPN blockade backlash doesn't hurt us",
			"date_published": 1461077943.366,
			"body": "##### [Original post](https://torrentfreak.com/netflix-vpn-blockade-backlash-doesnt-hurt-us-190416/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on April 19, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![img](https://ipfs.pics/ipfs/QmNetVWyoqS661EWg9dPrVK1hNkYWH6zsVae8TfUEetUhD)</center>\n\n*Netflix CEO Reed Hastings says that the recent crackdown on VPN and proxy users hasn't hurt the company's results. The VPN blockade only affects a small but vocal minority, according to Hastings, and there are no signs that hordes of subscribers are abandoning ship.*\n\n---\n\nEarlier this year Netflix announced that it would increase its efforts to [block customers](https://torrentfreak.com/netflix-announces-crackdown-on-vpn-and-proxy-pirates-160114/) who circumvent geo-blockades.\n\nAs a result it has become harder to use VPN services and proxies to access Netflix content from other countries, something various movie studios have [repeatedly called](https://torrentfreak.com/why-netflix-vpn-pirates-shouldnt-terrify-hollywood-160116/) for.\n\nWith the application of commercial blacklist data, Netflix already blocks IP-addresses that are linked to such services, something which also affects well-intentioned customers who merely use a [VPN to protect their privacy](https://torrentfreak.com/anonymous-vpn-service-provider-review-2015-150228/).\n\nThis has resulted in a lot of complaints from users with over 40,000 people signing [a petition](https://act.openmedia.org/netflix) to lift the VPN ban. In addition, several people claim to have [ended their Netflix](https://twitter.com/sihuimoos/status/702039381377314816) subscriptions due to the restrictive policies, while others have suggested [a return](https://twitter.com/ConArtCritic/status/702292958792568832?ref_src=twsrc%5Etfw) to their old pirate ways.\n\nSome analysts predicted that the outrage might have an effect on the company’s results, but this doesn’t appear to be the case. During the presentation on the first quarter results yesterday, the VPN issue was just a small footnote.\n\nWhen asked about the impact of the VPN changes on the results, Netflix CEO Reed Hastings brushed the issue aside as a minor detail that doesn’t impact the bigger picture in any way.\n\n“It’s a very small but quite vocal minority. So it’s really inconsequential to us, as you could see in the Q1 results,” Hastings said during the [earnings call](https://www.youtube.com/watch?v=5wAlIVtgBz0).\n\nJumping in, Netflix CFO David Wells stressed that Netflix enjoyed very strong growth in the United States, as well as a successful global expansion. So, overall there is no sign that VPN users are abandoning ship en masse.\n\nWhile the impact on the company’s revenue turns out to be insignificant, there is of course also a user satisfaction angle which could create a possible PR backlash in the longer term.\n\nNetflix’s management doesn’t address these issues directly. However, it’s clear that hundreds of thousands of people are affected and Netflix can’t be happy with the outpouring of complaints that continues day after day.\n\nNonetheless, Netflix continues to address the VPN piracy issue. TorrentFreak has spoken to several VPN service providers who have seen an increase in blocking efforts over the past several weeks.\n\nInitially Netflix used static addresses for the geo-blocking checks. As a result, proxy and VPN operators could easily bypass these checks by forwarding this traffic to a ‘clean’ IP-address. However, Netflix recently updated its detection methods and now uses hundreds of regularly changing domains.\n\n“They are now coming from a few hundred different possible subdomains” one VPN operator told us.\n\n“This makes it much more expensive for us to circumvent because we would basically need to forward all Netflix traffic through our servers instead of just the packets that do the geolocation.”\n\nNetflix previously said that, ultimately, it wants to make VPN banning obsolete by licensing all content globally. However, as long as the company still has to block access to [some of its own content](https://torrentfreak.com/netflix-cant-stream-house-of-cards-globally-blames-licensing-deals-160312/) including House of Cards, there’s still a long way to go."
		},
		{
			"post_id": 6,
			"title": "Harry Potter publisher goes on a bizarre anti-piracy rampage",
			"date_published": 1461003723,
			"body": "##### [Original post](https://torrentfreak.com/harry-potter-publisher-goes-on-a-bizarre-anti-piracy-rampage-160414/) by [Andy](https://torrentfreak.com/author/andy/) on April 14, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![harry](https://ipfs.pics/ipfs/QmQH58Kje4dHU5PoEm7wczqngu54Awepd5Bv6PDL88ju8x)</center>\n\n*The publishing platform responsible for marketing J.K. Rowling's Harry Potter series has gone on a bizarre anti-piracy rampage. Pottermore and its anti-piracy partners told Google that J.K. Rowling's Wikipedia page was infringing, but sadly that's just the tip of a ridiculous DMCA notice iceberg.*\n\n---\n\nThe issue of removing infringing content and links from the Internet is perhaps the hottest topic in copyright today, with a U.S. Copyright Office consultation generating opinions from stakeholders of all kinds.\n\nThe aim of the consultation is to measure whether the DMCA is fit for purpose or whether it needs to be tweaked to handle an Internet that has developed massively in the past twenty years. Generally speaking, copyright holders want the DMCA tightened up dramatically, with many calling for regime that would see pirate content being taken down and remaining down forever.\n\nWhile in some respects its easy to have sympathy with that stance, copyright holders can’t be trusted to get it right all of the time. In fact, sometimes mistakes are made that are so absurd that they deserve highlighting in public.\n\nHarperCollins, Random House, Simon and Schuster, Reed Elsevier, Scholastic and J.K.Rowling’s Pottermore are some of the most recognizable publishers in the world and like many in their position, all have a bit of a piracy problem. Every year through their anti-piracy partners they send millions of takedown notices directly to ‘pirate’ sites and to Google, who are expected to take down content on demand.\n\nIt’s fortunate that Google does not do so without due consideration. It’s also fortunate that there’s no takedown-and-staydown system in place.\n\n[Pottermore](https://www.pottermore.com/) is a digital publishing and e-commerce platform from J.K. Rowling, the author of the world famous Harry Potter series. Through anti-piracy company Digimarc the company has sent more than 260,000 takedown notices to Google with the majority raising few alarm bells. Recently, however, something appears to have gone terribly wrong.\n\nOn March 8, Pottermore sent a [notice to Google](https://www.lumendatabase.org/notices/11931332) complaining that several sites were infringing on the rights of, among other things, Harry Potter and the Order of the Phoenix. Inexplicably, one of those complaints was leveled at J.K. Rowling’s own page on Wikipedia. The same mistake was [made again](https://www.lumendatabase.org/notices/12022568) on April 1.\n\n![img](https://ipfs.pics/ipfs/QmSMBKjhGcUevQUvyAum1L9VD5EqHGB8ShmATVZUFRjcmt)\nFortunately Google refused to remove the page but Pottermore were undeterred and later that day sent an even worse notice that targeted a [further 20 Wikipedia pages](https://www.lumendatabase.org/notices/11932249).\n\nIn addition to targeting several pages dedicated to Harry Potter movies, soundtracks and videos games, the [notice casts its net far and wide](https://www.lumendatabase.org/notices/11932249#) with demands to remove pages detailing ancient Egyptian literature, ethnic groups in Central America, the attacks of 9-11, IEC standards, U.S. soldier Joshua Casteel and the NATO phonetic alphabet.\n\n![img](https://ipfs.pics/ipfs/QmbU3eyvbUG1kVUmbvxwsmbWTFYnU2MotCQ8F8AEvb4gM9)\n\nBut Pottermore aren’t the only ones contributing to this Wikipedia mess. In early March, HarperCollins sent notices to Google, again through Digimarc, aiming to protect its own content. Instead, however, the company put its name to a whole bunch of bogus takedowns.\n\nInstead of protecting the book ‘The Longest Trip Home’, the publisher [tried to takedown](https://www.lumendatabase.org/notices/11919974) the Wikipedia pages for Beverley Hills 90210 and Silver Spring, Maryland. Shortly after [another notice](https://www.lumendatabase.org/notices/11919951) targeted Wikipedia pages on the topics of BitTorrent, Carson in California, and the identity of [Mexican Americans](https://en.wikipedia.org/wiki/Chicano).\n\n![img](https://ipfs.pics/ipfs/QmZo2JCMi5n8EYaCHPavXkcTQYNPg83k5pCeNvysjAPmUT)\n\nWe won’t detail every single request here but there are dozen of bogus claims against Wikipedia, all of which Google (fortunately) denied. Those interested can find them in Google’s report where [dozens are listed](https://www.google.com/transparencyreport/removals/copyright/owners/28989/HarperCollins/) as rejected..\n\nSimon and Schuster don’t have much to brag about either. In an effort to protect a handful of books they also targeted Wikipedia on [dozens](https://www.lumendatabase.org/notices/12038879) of occasions. With no apparent checking mechanism in place we can see the kinds of abuses shown below.\n\nPoor Janice Galloway is actually a [Simon and Schuster](http://authors.simonandschuster.com/Janice-Galloway/1867871) author, yet they want her Wikipedia page removed. Heaven knows what copyright crimes the speed limits in Romania have committed.\n\n![img](https://ipfs.pics/ipfs/QmbnkUPGymVcbS5u68w1RcFLEvvAu5ZGiTHruNwmgzEsm2)\n\nFinally, a couple of choice takedowns, the first from Reed Elsevier. In an effort to protect Mandell, Douglas, and Bennett’s Principles and Practice of Infectious Diseases, the publisher [attempted](https://www.lumendatabase.org/notices/11930670) to takedown the Wikipedia page detailing Mega, the file-hosting site previously associated with Kim Dotcom.\n\nAnd Random House must have a real grudge against deceased U.S. writer Gore Vidal. On several occasions the company ordered Google to [remove his Wikipedia page](https://www.lumendatabase.org/notices/11927737) and links [to his books](https://en.wikipedia.org/wiki/Hollywood_%28Vidal_novel%29), despite them being his publisher.\n\nTakedown and staydown? Perhaps copyright holders want to think this through…..\n\nThe full catalog of Wikipedia takedown abuses can be found [here](https://www.google.com/transparencyreport/removals/copyright/domains/wikipedia.org/?p=4).\n"
		},
		{
			"post_id": 5,
			"title": "Obama's a coward for not hitting Google over piracy, filmmaker says",
			"date_published": 1460999883.753,
			"body": "##### [Original post](https://torrentfreak.com/obamas-a-coward-for-not-hitting-google-over-piracy-filmmaker-says-160418/) by [Andy](https://torrentfreak.com/author/andy/) on April 18, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![google-bay](https://ipfs.pics/ipfs/QmeKYaa9k78dUgKAhJrgqk1cBSLpQGPimKDmCV2qM8ncNU)</center>\n\n*The producer of dozens of movies including The Expendables trilogy and London Has Fallen has branded Barack Obama a \"coward\" for failing to take on Google over piracy. Avi Lerner says that the government is scared of the search giant and anyone not helping to stop piracy \"should go to jail.\"*\n\n---\n\nWith the recent Copyright Office [consultation](https://torrentfreak.com/50000-people-protest-dmca-abuse-crash-government-server-160401/) on the efficacy of the Digital Millennium Copyright Act ringing in the ears of many significant stakeholders, we’re informed that much is at stake in the online marketplace.\n\nWhat began with opinions from a wide range of interested parties has now morphed into a battle of opposing forces, with annoyed copyright holders leading the charge on one side and Google and its supporters on the other.\n\nDespite engaging in no infringement itself and [doing everything](https://torrentfreak.com/google-asked-to-remove-100000-pirate-links-every-hour-160306/) the law requires, on a daily basis Google is now being described as the world’s greatest piracy facilitator. It’s getting pretty ugly.\n\nThe latest to weigh-in with a controversial opinion is veteran film producer Avi Lerner. Perhaps best known for bringing The Expendables trilogy to the silver screen, Lerner is pulling no punches when it comes to the blame game. In fact, he’s taken it right to the very top.\n\n“The government, the president, is such a coward. He’s scared of Google so we are losing millions,” he told [AFP](https://www.yahoo.com/news/hollywood-mogul-blasts-obama-google-over-piracy-075802678.html).\n\nAs the founder of production companies Nu Image and Millennium Films, Lerner is of course no stranger to piracy. In 2014, a pristine copy of The Expendables 3 [was leaked](https://torrentfreak.com/expendables-3-leaks-online-100k-copies-down-in-hours-140725/) onto the Internet, much to the company’s dismay.\n\nWhile police in the UK [arrested two men](https://torrentfreak.com/piracy-police-arrest-two-for-the-expendables-3-movie-leak-141125/) in connection with the leak later that year, [followed by a third](https://torrentfreak.com/stallone-thanks-police-for-new-expendables-3-arrest-150410/) in 2015, thus far no culprits have surfaced in the United States. So, in the absence of a direct bogeyman, Google – and the President – will have to do.\n\n“It’s a major problem and it’s something that I don’t know if anyone can stop, because the government, the president, Congress are all scared of Google,” Lerner said.\n\nThe film producer says he feels that Google has no incentive to stop piracy because it generates revenue from it, but this kind of blame game is nothing new and largely misses the point. All piracy takes place outside Google’s ecosystem and would continue even if Google disappeared into thin air. Still, Lerner thinks he has the solution.\n\n“They should tell Google to stop piracy. They should make a law that anyone helping piracy — and not helping to stop piracy — should go to jail or get penalized or whatever,” he said.\n\nIt’s not clear whether Lerner was just angry when he made these comments or whether he really doesn’t understand how the whole piracy thing works, but the notion of throwing people in jail for simply not helping to stop piracy is certainly food for thought.\n\nOnly time will tell if that kind of punishment should also extend to the President himself but he’ll be long out of office before anything (if anything) is done to tune-up the DMCA. Jailing Google executives is presumably much more distant on the horizon."
		},
		{
			"post_id": 4,
			"title": "Norwegian authorities sued over Popcorn time domain seizure",
			"date_published": 1460989351.731,
			"body": "##### [Original post](https://torrentfreak.com/norwegian-authorities-sued-over-popcorn-time-domain-seizure-160418/) by [Ernesto Van der Sar](https://torrentfreak.com/author/ernesto/) on April 18, 2016 ([TorrentFreak](https://torrentfreak.com))\n\n<center>![popcorn](https://ipfs.pics/ipfs/QmUerpEQYesebNMYLA8dmDAWqg8jQvyZvFcAeiYbfiTKGT)</center>\n\n*Two digital rights groups have filed a lawsuit to challenge the Government's seizure of a Popcorn-Time related domain name. The groups believe that the website, which offered information and links to the popular streaming software, did nothing wrong. In any case, a domain name seizure is seen as a disproportionate measure.*\n\n---\n\nIn recent years the [Popcorn Time](https://en.wikipedia.org/wiki/Popcorn_Time) application has gained popularity worldwide, mostly thanks to its ability to stream torrent files in a Netflix-style interface.\n\nThis development raised concern among many movie industry companies, who have been working hard to contain the threat by going after several forks and their developers.\n\nMost recently, Norwegian rightholders reported a local Popcorn Time site to the local economic crime police. Responding to this referral, the authorities [seized](https://torrentfreak.com/norwegian-police-seize-popcorn-time-information-site-160308/) the Popcorn-Time.no domain name.\n\nUnlike the name suggests, the site didn’t host the application itself but instead posted news articles, as well as links to sites that offered the application.\n\nMany were surprised by the action and legal experts including Professor [Olav Torvund](http://blogg.torvund.net/2016/03/09/okokrims-beslag-i-domenet-popcorn-time-no/) of the Norwegian Research Center for Computers and Law openly voiced their concerns.\n\nNot only is the legality of the site debated, but also the use of a far-reaching measure without a proper judicial review.\n\nResponding to these concerns, two digital rights groups have now filed a lawsuit against the authorities. Electronic Frontier Norway [(EFN)](https://efn.no/) and the Norwegian Unix User Group [(NUUG)](http://www.nuug.no/) want the court to decide whether the domain seizure was appropriate.\n\n“We feel that this is an important case that addresses the limits of free speech,” EFN’s managing director Tom Fredrik Blenning tells TorrentFreak.\n\n“If this procedure is found to be legal, domain name seizures will make it possible for the police to shut down a forum based on mere suspicion that a site discusses potential illegal actions.”\n\nAs far as the digital rights groups are concerned the Popcorn-Time information site was operating legally.\n\nBut even if there are legitimate legal concerns, they believe that domain name seizures should only be applied in extreme cases where lives are at stake. This was certainly not the case here.\n\n“The decision to seize the domain name was made by a low-ranking lawyer employed by the police,” Blenning says.\n\n“Our position is that this decision may very well be wrong, but even if it is a correct decision, it is one that should be made by a judge in a court of law.”\n\nThrough the lawsuit the groups hope to answer two main questions. Firstly, was Popcorn-Time.no violating the law even though it only offered links to and information about the application.\n\nSecondly, is a domain name seizure proportionate when it’s not obvious whether a website is actually breaking the law?\n\nAccording to the two digital rights groups, the authorities clearly went too far. They hope that the court will agree and that similar broad enforcement measures can be prevented in the future."
		},
		{
			"post_id": 3,
			"title": "Welcome to The Blockchain News",
			"date_published": 1460989233.144,
			"body": "Read articles about cryptocurrencies, P2P technology and more without leaving the ZeroNet network. ;)"
		}
	]
}