{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1576403647,
			"title": "zbookdb, five books, every week",
			"body": "I have a huge library of ebooks, so I thought I'd just create a zite that lists five of them every week: http://127.0.0.1:43110/14r4f8nQVr4jBuX2PxLJmjbSHF9pTyeieS/\n\nHave fun :)",
			"added": 1576403646
		}
	],
	"topic_vote": {
		"1576403647_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1576403647_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": [
			{
				"comment_id": 1,
				"body": "mg0: Thanks for your comments. The goal of the website is indeed to have five books each week, with the books of the week before unlisted. For the file names, I had to decide between making them easy to save (the right name) or easy on ZeroNet. I'm not sure yet, I'll look more deeply into my options. Also, I totally forgot I could have multiple content.json files. Thanks for bringing that up :)\n\nAs for the book \"The Mastermind\" 404ing, I can't offer any help. The link works fine locally and on a (private) ZeroNet proxy running on a VPS. You may want to increase the size limit for the zite (it is currently 23MB, with \"The Mastermind\" taking 13MB of that)",
				"added": 1576441563
			},
			{
				"comment_id": 2,
				"body": "Thinking of it, it might have 404ed because the file is larger than 10MB. I've gone ahead and made the \"books/\" directory optional, so ZN should now send the file around as expected! (due to big files/torrent support for optional files)",
				"added": 1576442387
			},
			{
				"comment_id": 3,
				"body": "> [mg0](#comment_197_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): It's downloading now, it's rather big.\n\nEbooks can get quite big indeed. I even have 60-70MB epub files...",
				"added": 1576442464
			},
			{
				"comment_id": 4,
				"body": "New books released! :)",
				"added": 1576922279
			},
			{
				"comment_id": 5,
				"body": "> [randomshits](#comment_328_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Thanks for marking them as optional.\n\nMy pleasure! Have a nice time reading :)",
				"added": 1576958915
			},
			{
				"comment_id": 6,
				"body": "New books released! :)",
				"added": 1577726528
			},
			{
				"comment_id": 7,
				"body": "> [randomshits](#comment_375_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It seems zbookdb.bit is finally working.\n\nI tried to register the domain a few days ago, and wondered why someone took it. Tried it a few days before that, and it wasn't registered yet. I needed some time to acquire some NameCoin.\n\nIf the owner would be so kind, I wouldn't be against a transfer of d/zbookdb to NEZBvkDnT1VB7hQc3RtxSg4QqT8cAsxVzb (my wallet)",
				"added": 1577828753
			},
			{
				"comment_id": 8,
				"body": "> [draugrdeathlord](#comment_121_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Im looking for a book called [...]\n\nSadly, I do not appear to have that book",
				"added": 1577829275
			},
			{
				"comment_id": 9,
				"body": "> [randomshits](#comment_378_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): sent\n\nReceived! Thanks.",
				"added": 1577881719
			},
			{
				"comment_id": 10,
				"body": "> [draugrdeathlord](#comment_135_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): ??\n\nBecause we're at it, the tracker they most likely refer to is [MyAnonamouse](https://www.myanonamouse.net/), also one of my most reliable sources of content.",
				"added": 1577912198
			},
			{
				"comment_id": 12,
				"body": "New books released! :)",
				"added": 1578340058
			}
		],
		"1577908716_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "My recommendation: get yourself a pair of 6 to 10TB drives, then configure them as mirrored drives. If you don't want to have an entire system to put the disks in, you can get away with a Raspberry 4 and 2x USB to SATA converters. It will last a decade.\n\nIf that's above your budget, a Google Business account with unlimited storage costs 50$ a month. Other online storage providers include all S3 compatible ones, like Scaleway ($.01 per GB per month) or Wasabi ($.0059 per GB per month, 3 month minimum file retention).\n\nThere are plenty of options.",
				"added": 1577912736
			}
		]
	},
	"comment_vote": {}
}