{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Présentation ZeroNet à Montréal (Canada) le lundi 11 juillet 2016",
			"body": "Salut les loulous ici votre [up4/poubelle](/up4.bit/) préféré qui présentera ZeroNet et [libzeronet](/libzeronet.bit/) le lundi 11 juillet à Montréal au Canada. Il y a un [événement FB](https://www.facebook.com/events/952775564841700/) et un [site sur le vieux web](https://montreal.safenetwork.org/events/decentralized-web-meetup/). C'est un événement bilingue, mais ma présentation sera en français, bien entendu. Idéalement, personne ne viendra et je garderai ZeroNet à moi tout seul pour toujours merci beaucoup. xoxoxo",
			"added": 1467669886
		}
	],
	"topic_vote": {
		"1_1J4j9zrg5qitbELP3tpkRiReyDaWQLkG2P": 1
	},
	"next_comment_id": 9,
	"comment": {
		"3_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 1,
				"body": ">  1. Selon vous quelles-sont les règles qu'il faudrait adopter sur un forum francophone? \n\nUne et une seule: les messages et les commentaires sont rédigés en français. Si quelqu'un contrevient à cette règle, on lui indique gentiment les forums dans les autres langues. C'est tout. C'est inutile de régler un problème qui n'est pas encore arrivé.\n\n> 2. Il y a-t-il quelqu'un qui puisse être légitime pour administrer ce forum?\n\nRéponse simple: non. C'est le problème avec l'architecture d'un site multi-usager dans un contexte qui fétichise l'anonymat. La gouvernance d'un Wikipedia est extrêmement complexe pour cette raison. Les luttes de pouvoir sont fréquentes et ça n'est pas intéressant. Je tends à favoriser le système de blogues qui se répondent entre eux pour cette raison.\n\nRéponse longue: s'il faut faire avec, mes choix dans l'ordre seraient: 1) les admins actuels 2) le créateur de ZeroNet, 3) quelqu'un qui renoncerait à l'anonymat et qui a un passé documenté de médiation non-interventionniste dans un contexte similaire 4) un vétéran de ZeroNet qui s'engage à respecter la ou les règles qui font consensus.\n\n> 3. Jusqu’où va la liberté d'expression sur le forum ?\n\nIl se _doit_ d'être absolu et total sinon il se distingue en _rien_ des offres sur le web commercial. \n\n> [openuser](#comment_18_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): Il y a toutefois des sujets que j'aimerais à tout prix ne jamais voir sur ce forum, surtout des sujets liés à la pédophilie.\n\n\nLol. C'est TELLEMENT une position rafraîchissante sur le sujet.\n\nEt pour te répondre afin d'être parfaitement clair: ma définition de liberté d'expression inclut _en particulier_ les sujets tabous comme la pédophilie et ce qu'on appelle les \"discours haineux\". C'est non-négociable pour moi. Point final. Sinon, que ceux qui ne sont pas d'accord se partent un ZeroTalk CleanSafeSpace FR. ZeroNet n'a _aucun_ intérêt avec les mêmes interdits que le web commercial.\n\nEt pour être honnête et rigoureux pour interdire la pédophilie, il faudrait aussi que ceux qui n'ont pas l'âge de consentement soient clairement identifiés pour ne pas être \"accidentellement\" victimes du flirt des adultes. Et selon quelle jurisdiction ? Au Canada, c'est 16 en temps normal et 18 quand il y a une relation d'autorité. En France, c'est autre chose. En Italie, c'est encore plus jeune et au USA, c'est 21 ANS!!!!!!! C'est carrément BigBrother, ce que tu proposes.\n\nPar exemple: dans [l'échange entre toi et elnormand sur ZeroChat que j'ai cité pour d'autres raisons sur l'autre thread](/15tTDgqJa8vBKo5757rfXdsACvrLx3C2nX/), elnormand dit à un moment donné \"Bon allé, je vais me pioter et me laisser porter à la recherche du trou noir\". C'est clairement une référence sexuelle. Tu as quel âge ? Il a quel âge ? Est-ce que c'est une tentative de détournement de mineur ? Tu veux qu'on commence l'inquisition partout?!?! Limiter la liberté d'expression ce n'est _pas_ la liberté d'expression. C'est tout ou c'est rien.\n\nAutre exemple: moi je pense que si tu as commencé à désirer sexuellement les adultes seulement après avoir passé l'âge de consentement sexuel, tu as un problème d'ordre psychiatrique qui requiert des soins _URGENTS_. Et à l'inverse être précoce sexuellement implique un développement plus rapide qui devrait être _encouragé_. J'ai le droit d'être de cet avis parce que j'ai été un enfant précoce moi-même et que j'ai énormément souffert dans mes relations avec les adultes dû aux interdits sexuels qui étaient là supposément pour protéger ceux qui à l'époque étaient les plus lents à se développer et qui sont aujourd'hui les moins intelligents, les plus cons. L'hystérie autour de la sexualité en enfance est très récente et je suis convaincu que ça sera un jour considéré comme le plus destructeur des puritanismes de toute l'histoire de l'humanité à cause de son action antagoniste sur l'intelligence collective. Est-ce que tu considères que ce genre de propos n'a pas sa place ici? Si tel est le cas, je n'ai pas envie de faire partie des mêmes groupes de discussions que toi et je crois que tu ne mérites pas d'avoir accès au contenu d'opinion que je publie ici. Tu n'y comprendrais rien de toute façon et je n'ai pas de temps à perdre avec les réactions des imbéciles.\n",
				"added": 1464916103
			},
			{
				"comment_id": 3,
				"body": "> [openuser](#comment_19_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): des sujets incitant aux abus sexuels sur mineurs non-consentants ou au viol d'enfants\n\nParce qu'abuser ou violer des adultes, c'est plus acceptable pour toi ??!?!?!\n\nLe viol et l'abus, c'est une chose et la pédophilie en est une autre. Il faut utiliser les bons mots.\n\nMême si je suis personnellement contre le viol et l'abus, je peux facilement imaginer des débats contradictoires intelligents sur le sujet et je n'ai pas à décider de le bannir _a priori_.\n\n> Après, les questions que tu soulèves ont plus rapport avec la majorité sexuelle qui selon moi est un sujet comme un autre sauf qu'il ne me passionne pas plus que ça et que je suis loin d'avoir un avis sur tout d'ailleurs.\n\nOf _course_. Premièrement je doute que la sexualité t'intéresse aussi peu (de notre première conversation sur ZeroChat). Mais, en plus il me semble évident que je disais ça pour illustrer que c'est impossible à trancher pour de la \"bonne censure\". Ça n'a pas rapport avec ton intérêt ou non pour le sujet. À moins que tu penses qu'il faille aussi interdire les sujets \"inintéressants\". \n\n> Ensuite pour ma part je pense qu'une liberté d'expression totale est souhaitable et bienvenue si elle à pour but d'exposer un point de vue, une pensée, une réflexion, une idée. Mais il s'agit d'un outil comme un autre, selon comme on l'utilise on peut également attiser la haine, discriminer, injurier, agresser... dans ce cas je trouve cet outil moins salutaire.\n\nPour moi, l'idée qu'un _discours_ puisse être considéré comme une \"aggression\" ou de la \"violence\" est un sophisme d'une rare stupidité.\n\nUne liberté n'est pas un \"outil\" que tu \"utilises\" quand ça t'arrange et que tu suspens quand quelqu'un est offensé. C'est quoi cette idée ?!?!\n\nEt puis là, c'est déprimant. J'étais content de participer à ce mini-sondage parce qu'il met en cause la nature même de ZeroNet. Mais je suis trop vieux pour ne pas exiger de mes interlocuteurs un minimum de culture sur le sujet dont il est question. Et je ne vais pas faire un cours de science politique ici.\n\n> Si ta façon de débattre passe par le travestissement des pensées de ton interlocuteur alors je comprends mieux d’où provient ton sentiment de grandeur.\n\nok thanks bye",
				"added": 1464954090
			},
			{
				"comment_id": 4,
				"body": "> Je vais bientôt t'insulter \n\nNon, tu ne vas pas _bientôt_ m'insulter. Tu vas _encore_ m'insulter. Mais vas-y… J'A-DO-RE !!!!!! Puisque je crois que ça en dit plus long sur toi que sur moi, pourquoi est-ce que priverais-je les futurs zéronautes de la joie de mieux te connaître en exigeant de toi que tu te censures?\n\n> même si ce n'est pas très intelligent\n\nT'inquiète, j'ai fait ce même diagnostique depuis un moment déjà. Tu es plus dans le spectre autistique que dans la débilité. Mais par écrit, c'est indistingable, je te l'accorde. Je vais moi aussi me faire plaisir par la présente. On continue…\n\n> ARRETE DE MENTIR\n\nJ'aime trop ça. Ma vie en dépend. Sorry. Get used to it, maman.\n\n> ARRETE DE MENTIR\n\nOu plutôt: le mensonge devrait être interdit et systématiquement censuré. On devrait brûler les menteurs sur le bûcher comme au temps de l'inquisition. Ça devrait être toi l'unique juge. Avec le virginal petit enfant jésus bien sûr. C'est un péché mortel, d'ailleurs, le mensonge, si on est pour citer des pédophiles. En gros, c'est ça ?\n\n> Tu peux ne pas comprendre ma phrase\n\nC'est une langue belle. Bien sûr que _bon allé, je vais me pioter_ ce n'est pas une référence sexuelle. Où avais-je la tête ?!??!?! C'est une dissertation d'astrophysique qui va révolutionner notre conception topologique de l'espace-temps.\n\n > tu dois me demandé des explications avant de balancer des affirmations étranges trouvées dans ton cerveau bisar\n\nÉcoute ça, tu vas te marrer: 1) _toutes_ les personnes que j'admire se sont fait reprocher d'avoir un cerveau bizarre (b-i-z-a-r-r-e: c'est comme ça que ça s'écrit ô maître es french) 2) _aucune_ des personnes que j'admire n'aurait apprécié se faire dire qu'elle a un cerveau normal. C'est fou, hein ?",
				"added": 1464988064
			},
			{
				"comment_id": 5,
				"body": "> [elnormand](#comment_58_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w): Encore ??\n\nOh darling, _Till death do us part._\n\n> Je ne te juge pas et tu m'analyse.\n\nTu es un chef-d'œuvre de perspicacité.\n\n> Ne pas utiliser les insultes est considérer comme du RESPECT.\n\nOh wait…\n\n> Un nouveau topic sur ta passion pour le menssonge éclairera peut être ma lanterne.\n\nEh bè, juste ça.\n\n> Tu pars trop loin avec ton histoire de juge... :-)\n\nJe vais trop loin pour toi. Tout le temps. On a tous très bien compris.\n\n> PS : Je trouve que tu pouri le zerotalk FR avec tes conneries et cela ne va pas aider les nouveaux à venir ...\n\nL'argument moraliste encore. Je vais m'en aller d'ici pour te faire plaisir peut-être ? Si les _nouveaux_ sont aussi terrorisés que toi par la liberté d'expression, qu'ils en restent à Facebook.\n\nJe vais dire ce que je veux, c'est clair ? Et je vais répondre _aggressivement_ aux dames-surveillantes comme toi qui essaient de me faire taire. _À mort_. Ou jusqu'à ce que ça m'ennuie de répondre. Ou jusqu'à ce que tout le monde ait fui ce forum. C'est moi qui décide de mes actions et de ce que je dis. Pas toi, pas Jésus, pas openuser, pas les _nouveaux_.",
				"added": 1465001504
			}
		],
		"1_1J4j9zrg5qitbELP3tpkRiReyDaWQLkG2P": [
			{
				"comment_id": 6,
				"body": "> [chezsick](#comment_10_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC): hé ben tu te dévoile up4 avec ton prenon et nom\n\n… et visage !!\n\nT'imagines !?? Et je ne suis pas mort.\n\nEt ça fait longtemps en plus.\n\n> moi je me suis récemment dévoiler\n\nC'est bien. Mais fallait pas mettre de filtre sur la photo !",
				"added": 1467738890
			},
			{
				"comment_id": 8,
				"body": "La présentation était en deux volets: 1) survol technico-pratique et 2) contexte historique, culturel et politique.\n\nEn ~45 minutes, j'ai passé rapidement sur le point #1 et je me suis concentré sur le point #2 qui, à me fier à sur le contenu qu'on retrouve en ce moment sur ZeroNet et sur le peu d'intérêt que suscite tout ce qui en diverge, ne risque pas de passionner les petits garçons vierges de tout qui constituent 99.99% des utilisateurs ici présents.\n\nD'ailleurs il y avait peut-être une douzaine de personnes dans l'assistance, tous des gars entre 24 et 60 ans. Aucun d'entre eux, comme ici d'ailleurs, ne semblait comprendre la nécessité des libertés de conscience et d'expression que je défends, moi, radicalement et sans compromis.\n\nMais oui, j'ai filmé et je vais peut-être le publier (sur Youtube ? c'est une blague ?) mais si je le fais, ça sera dans le cadre de [mon contenu d'opinion](/bloccoq.bit/) et pas autrement. Mais non, je ne suis aucunement pressé. Certainement pas par une communauté de gens qui ne manifestent aucune excitation, aucune envie, aucune intention de se connaître mutuellement.",
				"added": 1469640165
			}
		],
		"6_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC": [
			{
				"comment_id": 7,
				"body": "[ZeroName](/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/), babe ;-)",
				"added": 1468022342
			}
		]
	},
	"comment_vote": {}
}