{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1549168166_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "I have yet to see any spam related problems on Zeronet. I think that starting up something like this before there is allot of users on this system is a total complete waste of time. I already see the socialist group think philosophy of power and ego control happening over others happening. This is p2p and not some centralized thought control model system designed to suck people into a mental masturbation hour of theoretical problems that have not yet existed nor would they ever without a solid user base.  This kind of mindset will detract any possible users who would want to be involved in the development of Zeronet as a viable alternative to clear-net. I have seen this very exact same thing happen on two other open source projects. They all failed miserably into a he said she said oh I am so offended by ______ , everyone eventually blocked those users from there Victim back stabbing rants of power and control over others.  Anyway I am not interested in creating a though control group that shames others users into a socialist mindset of offensive behavior. Good luck with your centralized structure..  IM OUT!!!!",
				"added": 1549442153
			},
			{
				"comment_id": 2,
				"body": "> [kaffie](#comment_3_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): haha no, as amusing as that'd be. nofish is still the primary developer of zeronet, and runs pretty much all of the major sites for it (zeroid, zerotalk, zeroboard, zeromail, parts of zerome, etc.). I'm just a particularly well known person, as I was here early on and caught some popularity due to my search engine. I'm not anyone special haha. I just like ZeroNet and wish to see it grow. [...]\n\nFor the record I have been in every political party in the U.S. They all basically suck. I am now a capitalist but with a \nsocialist design for software development. I think there can be a model of both being made that could produce a prophet for programmers in open source. I hate copyright work because it to me is counter productive to the materiel and artist that is involved in there work. However a new model needs to be made that will allow both systems to mutually benefit from each other.  So this is my core views currently. Politically, I don't care where you are at. However new software/hardware design ideas are always being explored for the open source community that would make things a better place for everyone. We can move faster than any corporation when a clear goal is desired for any program model of creation is made. This is why I think that Zeronet is possibly the greatest software/network invention possibly ever made by man. (And I am not trying to kiss anyone's ass here either..) Its just that good from my limited understanding right now. Zeronet will take off. I am wondering how well this will scale when it does.?",
				"added": 1549446691
			},
			{
				"comment_id": 3,
				"body": "I think some one needs to create a zeronet snapshot system for all zites that would be a big torrent program that everyone would p2p share. Did I just blow everyone's mind or was that just mine. Btw: am a program concept engineer and I am sure this has already been thought of. Right? !",
				"added": 1549447669
			}
		],
		"1549045300_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 4,
				"body": "How do you keep the secondary key from overriding the primary key if there was a malicious attack from one of the parties that had the key?",
				"added": 1549450745
			},
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Not sure, what you mean. The secondary key can sign the data in the appropriate subfolder only. It cannot be used to sign content.json of the parent folder.\n\nOh, Never mind..  Sorry I was thinking they were all in the same folder. Ok this is good..",
				"added": 1549452213
			}
		]
	},
	"comment_vote": {}
}