{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1589201882,
			"title": "So...... can i get a FUD (Full Undetectable) Trojan anywhere?",
			"body": "It's been a while since i've been playing with trojans and viruses, but recently a company executive stole some very important info from my company and i want to get it back. So... i thought of infecting him with a trojan to see what he's up to. Can i get any help here?\nJust point me in the right direction, and you'll make me very happy :)",
			"added": 1589201881
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1587547948_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1": [
			{
				"comment_id": 1,
				"body": "What is that exactly?",
				"added": 1587554925
			}
		],
		"1587891915_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2084_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Reminds me of Warsow, but not twitchy, which is good.\n\nTrue! Very simillar to Warsow.",
				"added": 1587931903
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 3,
				"body": "Jeeeezzz Politics suck!",
				"added": 1588001806
			}
		],
		"1588692906_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 4,
				"body": "Jeez. This is the moment where we should be trying to merge these technologies so we can create a world decentralized solution, so we can finally stop using privacy data theft, etc",
				"added": 1588852310
			}
		],
		"1589201882_17v2UBGNSMncMni3XDXFAJa8HtwGuEdQyB": [
			{
				"comment_id": 5,
				"body": "> [1bfqutudhtexlka](#comment_171_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): sleep early you have a school tomorrow\n\nNice. But believe it or not, i'm not that young. I just don't have the time to make one.",
				"added": 1589217770
			},
			{
				"comment_id": 6,
				"body": "> [nesselon](#comment_14_15wHfknPYGm91ZDyofsrYnhHzW4zH6xpXU): No offense but if you don't know where to find what you're looking for and are short on time, this operation is probably a really bad idea that might backfire very fast. I suggest you contact a lawyer and press charges against the executive. [...]\n\nUnfortunately i can't present evidence. But i thank you for your input.",
				"added": 1589224497
			},
			{
				"comment_id": 7,
				"body": "> [ransbits](#comment_4_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Your comment reeks of ignorance on a magnitude of levels... [...]\n\nI understand what i'm proposing here, no need for insults. And it's not even my idea. If i knew another way, i would resort to another solution.",
				"added": 1589224973
			},
			{
				"comment_id": 8,
				"body": "> [tnytuqsgqnywmecj](#comment_18_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): Think you are looking for a root kit you can drop...    Try https://www.kali.org/downloads/   ...  https://www.youtube.com/watch?v=J36yzsCLPNg\n\nThanks for the tip. A Rootkit should suffice. ;)",
				"added": 1589464442
			}
		]
	},
	"comment_vote": {}
}