{
	"title": "muerdo的博客",
	"description": "##[嗨！你看小龙吃毒菜](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/12pBgpsDjuPWf7JVJcKDf3Dvuc7QTSECXn/muerdo@zeroid.bit)\n　　\n##[咚咚招呼左派朋友](http://127.0.0.1:43110/1JxBspELVZZ11KobxeCqA56t5v2WBDG8QG/)\n　　",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1505916175,
	"post": [
		{
			"post_id": 4,
			"title": "[转教程]通过Tor网络匿名使用ZeroNet",
			"date_published": 1504978557.854,
			"body": "[如何匿名使用zeronet](http://127.0.0.1:43110/1t6o5BVyJrSAtFGoXUkjfjCNyhyH8VcfT/?Post:4:%E5%A6%82%E4%BD%95%E9%80%9A%E8%BF%87Tor%E7%BD%91%E7%BB%9C%E5%8C%BF%E5%90%8D%E4%BD%BF%E7%94%A8ZeroNet%EF%BC%9F)"
		},
		{
			"post_id": 3,
			"title": "[转载自微思客]当我在说我是法左的时候，我在说什么",
			"date_published": 1504786154,
			"body": "## **宋迈克‖**\n\n【[摘要](https://mp.weixin.qq.com/s?src=3&timestamp=1504783587&ver=1&signature=DdndH4zhmaUkFGWqE-0Bh02eth5rctaNrG2qsQobbBCon2F*5iEPUaxOsFY0u-d6pVfnQNrXfLGEHBoDJtjjjR6aqDhoHsXRhT2w8Ns65PBl5LTlWH*CMyjPu9aS3*ZNiraWUv6hEfgjsGUfkG6VS0x8Q0GGH00vYgyol7k1Qqg=)】革命的神话是当前社会的对立面：在一种对完美的苛求下，当前社会所孕育的缺陷与不幸显得无可忍受。革命理想控诉着那些使人类难以构想自身解放的可见或隐匿的束缚。即使是如此虚幻与不切实际，革命通过她所引发的恐惧，仍在刺激着国家的掌控者们。\n\n在当代中国语境下，“左”与“右”是时常被提起的词汇。“左”与“右”似乎大体被等同于“威权政治”“计划经济”与“自由主义”“市场经济”，甚至有时被用来形容对当局的态度。事实上，左右分野是刻画法国乃至欧洲政治的根本特征，曲折的历史给左翼和右翼以丰富的思想资源。中国语境下说起“左”与“右”时，往往是对这些丰富内容的过分简化与想象。\n\n诚然，简化与想象是思想传播过程中必经的道路。但我想，把左右分野的完整面貌展示出来仍是一项值得做的工作。为此，对作为左右分野的历史来源和重要舞台的法国的政治史的回顾与反思必不可少。我自己对政治史有一些了解，个人是个左派，所以今天想就我自己的了解跟大家谈一下法国左翼从大革命开始到冷战结束的两个世纪间的历史，并从中试着提出一些左翼的思想内核与内部张力。个人水平、倾向和讲座形式所限，请大家不要把这些挂一漏万的介绍与分析视为参考资料，我希望它们能成为引起你去就某些内容查找资料的起点。\n\n* * *\n\n**一、左翼历史回顾**\n\n左右分野起源于法国大革命：1789年9月，国民制宪议会就国王是否对国民议会通过的法令有绝对否决权进行投票。倾向于保留国王地位、实行君主立宪的人位于主席台右侧，而倾向于反对王权的、主要来自三级议会的人位于主席台左侧。当时，“左派”以673票对325票获胜，国王的否决权受到了限制。\n\n**1\\. 左翼与共和国**\n\n直到19世纪初，左右分野这种说法并没有流行。在波旁王朝复辟时代（Restauration），支持巩固王权和教会势力的力量在议会与支持一个更自由的社会的力量针锋相对，这时期左右分野才渐渐成为刻画议会政治的主要特征。经历了拿破仑帝国以及白色恐怖时期之后，当时真正的共和派——支持废除王权而建立共和国的——都转入了地下活动。\n\n而在当时的议会中可以被归为左派的议员主要是一些君主立宪制的支持者。对一个保障自由——特别是媒体自由——的制度、一个权力受限制的政府的争取是当时左翼的主要特征。这一时期的左翼政治人物中，不乏像基佐（François Guizot）、贡斯当（Benjamin Constant）这样为后世留下了丰厚的学术遗产的人。\n\n而1830年的七月革命后，共和制的支持者才渐渐浮出水面。30年代中，共和派人士不断借各种机会试图发起运动，不断遭到打压。而复辟时期的中左翼如基佐也都成为了相对更加开明的奥尔良王朝时期的多数派。在“七月王朝”期间，奥尔良王朝延续了王权，但极端保皇派已经被更加温和的君主立宪制取代，王权的维系与纳税选举制愈发显得不合时宜。\n\n对基佐政府的不满在1848年2月爆发出来。“二月革命”发生几天之后，国王路易·菲利浦（Louis-Philippe）逃出法国。共和派人士没有再犯1830年的错误，站在了起义一边——温和共和派的诗人拉马丁（Alphonse de Lamartine）宣布建立共和国。\n\n第二共和的开端十分美好，各个阶层在全新的共和国中显得无比团结。可这个短命的共和国只维系了几年，便在1851年12月由民选总统路易·波拿巴（Louis-Napoléon Bonaparte）发动的政变中结束了。在政变发生后的几天，那个最初曾是君主立宪制的支持者的、后来被共和理想吸引、与保守势力在议会上针锋相对的维克多·雨果（Victor Hugo）和一群共和主义者一道，冒着被逮捕乃至被军队杀害的风险走上街头，号召民众拿起武器捍卫共和国。随后雨果被迫流亡，直到1870年第三共和宣布建立，雨果才终于结束流亡回到巴黎，并在回巴黎的火车经停的每一站都受到了民众热烈的拥戴。到达巴黎北站时，他对前来欢迎的民众这样说：“公民们，我曾说过：‘共和国回来的那天，我会回来。’现在，我在这里了。”（« Citoyens, j’avais dit : « Lejour où la république rentrera, je rentrerai. » Me voici. »）\n\n在第二帝国期间，共和派人士重新凝聚力量，而其中的领军人物莱昂·甘比大（Léon Gambetta）和儒勒·费里（Jules Ferry）开始把注意力从发动革命、筑起街垒转向了深入民众、宣传共和理念。当拿破仑三世在色当战役（Bataille de Sedan）中战败被俘、第三共和建立之后，他们是议会里最积极地与保守派论战、捍卫共和制的人。1877年的宪法危机中，总统麦克马洪（Patrice de Mac Mahon）与共和派对峙，情形十分胶着。在共和派接连的选举获后，1879年麦克马洪被迫下台。从此，共和制得到确立，保皇党人开始渐渐被边缘化。![](data:image/gif;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVQImWNgYGBgAAAABQABh6FO1AAAAABJRU5ErkJggg==)\n\n在共和制最终确立的第三共和里，原先的温和共和主义者——当时也被称为“机会主义者”（Les républicains opportunistes）——渐渐从政治光谱上从左翼移向中间。而主张彻底执行共和主义理想的“激进党人”（Les radicaux）逐渐成为共和国议会的核心力量。\n\n这个党派的“激进”指的是针对于它诞生之初的环境而言：他们对共和制的要求最为坚定，对君主制的批评最为激烈。第三共和的奠基者之一莱昂•甘必大在1869年提出的《贝尔维尔纲领》（programme de Belleville）可以被视作是具有代表性的激进党人宣言。这份纲领中的主要诉求包括实施普选、取消审查制度与彻底的媒体自由、集会自由、政教分离、废除常备军等等。其中许多内容如今早已被视为政治基础而不必再被提起，但在十九世纪中叶，为这些目标付出了艰辛努力的激进党人在政治光谱上是毋庸置疑的左翼。\n\n**2\\. 共和派与社会主义者**\n\n让我们把历史拉回到1848年：二月革命后第二共和的头几个月是共和制历史上最富浪漫色彩的年岁。（面向成年男性的）普选、言论自由、废除奴隶制……似乎大革命的承诺终于被落实，而大革命的恐怖统治则被放弃，全国上下各个阶层在全新的共和国中显得无比团结。获得了言论自由、结社自由的社会上一下涌现出大量各种思想各种阶层的出版物，全社会——至少是巴黎似乎洋溢着大革命的美好理想已经实现的欢乐气氛。\n\n然而这终究是一个革命后建立的临时政府，政见截然不同的人士在其中共事：从温和的共和主义诗人拉马丁（Alphonse de Lamartine）到激进主义者勒德鲁-罗兰（Alexandre Ledru-Rollin）到社会主义理论家路易·布朗（Louis Blanc）。路易·布朗希望能在当时的政府中设立劳动部，但并没能获得通过。为了解决当时的社会问题，社会主义者与反对者们达成妥协，建立“国立工厂”（Ateliers nationaux），让失业工人在其中从事公共工程的劳动。\n\n作为第二共和全国团结的代表，作为“博爱”的象征，国立工厂的命运却在第二共和的第一次普选后发生了转折。1848年4月的议会选举后，温和共和派和凭借农村选票当选的正统派（légitimistes）议员在反对国立工厂的问题上渐渐打成一片，在这些保守主义者看来，国立工厂安置着一群随时可能爆发骚乱的下层人，他们开始试图废除这一由国家干预经济、调整雇主与雇员关系的“怪物”。6月21日，议会投票废除国立工厂。第二天，巴黎便爆发了持续一周的史称“六月起义”（Journées de juin）的暴动，遭到了残酷镇压。共和国随后转入保守期。\n\n1848年底的总统选举中，秩序党的候选人路易-拿破仑·波拿巴（Louis-NapoléonBonaparte）靠着大量农民的选票（他们中许多人并不认识候选人，只知道波拿巴的名字）成为总统。1851年12月1日他发动政变，建立第二帝国。共和制的理想再次流产。而民选总统发动政变称帝的噩梦，使得法国左翼在今后的一个多世纪中对总统制深恶痛绝。1964年，当时的密特朗在一本名叫“永恒的政变”（ « Le Coup d'État permanent »）的书中，将重新建立了总统制并通过公投将总统选举改为直选的戴高乐抨击为是“披着路易-菲利普一世的资产阶级美德的路易·波拿巴”。\n\n第二共和的经历第一次展现出了当时左翼的两个面向或者派别：共和派和社会主义者。在推翻王权的革命中，两者站在同一阵营中。然而在第二共和一开始发生的一个场景便极富象征意义：当时，激动的革命群众冲向巴黎市政厅，要求将象征革命与乌托邦的红色旗帜作为新诞生的共和国的旗帜。而浪漫主义诗人拉马丁则向人群呼喊，靠他的口才说服了人们保留蓝白红三色旗做为国旗。\n\n这个序曲似乎已经预示了后来的六月起义和随之而来的血腥镇压，或者说得更远一些，也预示了第三共和初期对巴黎公社的镇压。对于当时为底层工人的命运改善着想的社会主义者来说，共和国不仅应该是一个保障政治自由的制度，更应该是一个可以切实改善工人权益、保障他们的生计、消除对它们的剥削的制度。然而从七月王朝里走来的大多数共和主义者们，即使不都是大资产阶级出身，也很少真正了解底层人民的生活。\n\n在第二共和遭到镇压的社会主义终于在第三共和确立了共和制之后真正兴起，有了政治反响。社会主义者第一次在议会选举中获得显著突破是1893年——各个流派的社会主义者加起来共有49人当选议员，其中包括后来成为领军人物的让·饶勒斯（Jean Jaurès）和茹尔·盖得（Jules Guesde）。他们与激进党人的分别也渐渐展现出来。\n\n对于第三共和的激进党人来说，“小人物”与“强者”“大人物”的对立的确是他们常用的话语，但并没有社会主义者那种严格的阶级区分和阶级斗争观；以小资产者、农民为基础的激进党人的目标之一是废除工资制，通过结社让劳动者获得产权与自由，而从工业社会中发展起来的社会主义则主张工人掌握国家机器，进而实现劳动的解放；激进党人坚信国家应当大力推行财政、社会政策，但他们坚定地捍卫私有产权，而改变所有权制度是所有社会主义者的共识。——别忘了青年马克思曾一度十分欣赏的思想家蒲鲁东（Pierre-Joseph Proudhon）的口号：“所有权就是盗窃。”（« La propriété, c'est le vol. »）\n\n应该说，从共和派到激进党人所延续的为共和制的努力是建立在个人主义的基础上的，他们拒绝将自己定义成某一个社会阶级的传声筒；而当时社会主义者们强调工人整体的阶级性，毫不犹豫地将自己定位为无产阶级的代言人。\n\n如今，国家推行社会政策以促进公正、推动进步，这些由当时的激进党人奠定的共和国的基本理念在法国早已成为超越左右的共识。而这两种倾向的分别在左翼内部仍有体现。阶级斗争的话语已经不再流行，但将劳动者和雇主对立起来，强调自己始终站在劳动者一方仍是许多左翼政客到民众的心态。最近关于劳动法改革的一系列争论与抗议中，这种对立再次成为主题。\n\n**3\\. 社会主义的崛起与分裂**\n\n回到二十世纪初，随着1905年政教分离法案的通过，激进党人价值观中最重要内容之一——反教权主义已经从国家层面得到落实。他们的形象渐渐开始从为了推进共和制在法国扎根而奔走呼吁的甘比大、费里变成了一个个在议会混迹多年、脱离民众、只靠共济会等固有结构与组织和反教权大旗来维系权力的政治精英。而同样在1905年，法国的社会主义者终于达成了团结，成立了“工人国际法国支部”（SFIO，以下用“社会党”代称，事实上，社会党——Parti Socialiste这个名字从1969年才取代SFIO）。\n\n而在此之前，饶勒斯、盖得等为首的几个社会主义政党在许多问题上都有重大分歧，而其中一件事情就是“米勒兰问题”（Le cas « Millerand »）。1899年，在德雷福斯事件的背景下，面对民族主义的反动力量的威胁，瓦尔德克-卢梭（Pierre Waldeck-Rousseau）为首的激进党人希望组建一个德雷福斯派的大团结政府。而此前在议会选举中获得了一些席次的社会主义者是否支持米勒兰作为代表进入政府，便成了摆在社会党面前的重要选择。社会主义者原则上当然是反对保守势力的，但是否应该加入一个包括加利费将军（Gaston de Galliffet）——参与了对巴黎公社的血腥镇压的军官——在内的资产阶级政府呢？\n\n1900年，盖得和饶勒斯作为当时最有影响力的两位社会主义者展开了一场被后世成为“两种方法”的公开辩论。饶勒斯支持米勒兰进入政府，他认为这是一种可以解决具体问题的策略，他强调在面对封建残余、教会权力时，社会主义者应该加入捍卫共和制的阵营。而在盖得那里，社会主义应该只围绕阶级斗争展开：“同志们，当社会党，当无产阶级将阶级斗争理解和实践为与资产阶级分享政治权力的那一天，就不再有社会主义了。\n\n”而在政党政治之外，十九世纪末二十世纪初的法国还有不可忽视的另一股左翼力量——工团主义（syndicalisme）。在同一时期的德国，社会民主党（SPD）全面领导工人运动，而在法国，情况截然相反：无论是饶勒斯还是盖得，都并不能控制工团主义的力量。它的代表——全国总工会（CGT）也在1906年的亚眠大会上达成了“亚眠宪章”（Charte d’Amiens），确立了他们与社会主义政党不同的路线——他们在追求根本社会变革的同时，注重眼前的快速的改善：减少工时、提高工资等等；他们将罢工视为主要斗争手段；他们以工人组成的工会为组织基础，拒绝任何政党或政府的领导。![](data:image/gif;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVQImWNgYGBgAAAABQABh6FO1AAAAABJRU5ErkJggg==)\n\n法国社会主义运动初期的独特历史情况，为后来社会主义政党在法国的发展造成了深远影响。19世纪末20世纪初左翼从“米勒兰”问题上开始的论战在今天仍然可以看到回响：面对政策上逐渐右倾的奥朗德政府，绿党以及激进左翼政党应该采取怎样的态度？他们的议员到底还算不算是在“总统多数”（majorité présidentielle）里？这样的争论已经导致绿党在去年发生了分裂。而工团主义的力量在68年社会运动中强有力地登场，让从左翼政党到工会的政治力量无所适从之后似乎逐渐销声匿迹，但就在一个多月前兴起的“站立的夜”（Nuit Debout）运动中，这种在政治空间之外寻求左翼理想的力量似乎又一次进入人们视野。\n\n**4\\. 看守“老房子”**\n\n让我们再回到二十年代——惨烈的一战已经过去，而一战前夕工人国际并未能促成各国社会党团结起来向政府施压以阻止战争，战争打响后，各国社会党都几乎立刻与政府一道，投入了战争中。战争的惨烈结局让这些拥抱爱国主义的社会主义者与第二国际一道失信不少。而战争孕育出的革命——俄国革命以及随之而来的第三国际则吸引了许多目光。\n\n在法国，随着第三国际的建立以及国内工人运动的兴盛与被镇压，社会党面临着极大压力。党内左派呼吁加入第三国际，而另一部分则无法接受加入第三国际的“二十一条”（包括建立秘密组织、民主集中制、与改良派决裂、定期清党等等）。在1920年的图尔大会（Congrès de Tours）上，社会党——也就是“工人国际法国支部”——正式分裂：多会上数成员决议成立法国共产党，加入共产国际；剩下部分成员则留在原来的第二国际中。\n\n作为后一部分成员的领军人物，莱昂·布鲁姆（Léon Blum）在图尔大会上的演讲在一个世纪后看来显得极富预见性。从党组织结构上的集权到对革命手段与目的的认识再到发动群众搞革命的路线，布鲁姆对共产国际给出了全面的批判。然而在演讲结尾处，布鲁姆仍然充满温情地说：“我们从内心最深处坚信，当你们奔向冒险之旅的时候，需要有人留下来看着这幢老房子……你们和我们即使分道扬镳，仍然都是社会主义者。”\n\n自此之后，看守“老房子”的社会党与“奔向冒险之旅”的共产党之间的合作与斗争，描绘了大半个世纪的法国左翼政治史。\n\n1936年到1938年间的人民阵线政府（Gouvernementdu Front populaire）便是左翼政党合作写就的佳话。由这个社会党领导、激进党人参与、共产党人支持的左翼联盟政府推动的诸多社会立法，成为了法国左翼史上最重要的成果之一。在规模前所未有的全国大罢工、占领工厂运动的推动下，资方代表被迫与全国总工会（CGT）在人民阵线政府的主持下进行谈判，达成马提尼翁协定（Accord de Matignon）。自此，工会权的确认、集体协议制正式成为劳动者的“既得社会权益”（acquis social），政府立法通过了带薪假（法国是世界上第一个就此立法的国家，当时的带薪假是15天）、40小时工作制等等。\n\n莱昂·布鲁姆与人民阵线这段法国左翼记忆中的光辉一页之所以得以完成，不能不说是得益于几个左翼政党在当时的团结。的确，法国政治史似乎表明，只有左翼团结起来的时候才能掌握政权。\n\n如果我们把20世纪里左翼力量团结起来的时期清点一下——1902年到1905年间以反教权运动为主轴的“左翼集团”、1936年到1938年间昙花一现却成就巨大的人民阵线政府、1981年到1984年密特朗第一任期中共产党人也在政府中的时段以及1997年到2002年“多元左翼”支持下的若斯潘政府时期——便会发现，在剩下的更长的时期中，左翼一直处在分裂乃至互相攻击的状态。\n\n而造成左翼分裂的一个主轴便是改良与激进的分别了。左翼中总有希望改善现状的和希望全部重来的，追求渐进变化的和追求整体变革的。社会党与共产党在1920年的分道扬镳是其中一个典型的例子。在二十年代，如果说共产党相对于社会党来说，是跟随着十月革命的热潮而一心要用全新的方法进行彻底的社会改造的激进派，那么社会党相对与当时已只是中左翼、很开就将成为人民阵线政府的终结者的激进党来说，也毫无疑问是更加激进的。\n\n决意看守社会党这幢“老房子”的布鲁姆在描述社会党和激进党区别时曾写道：“我们想建立一个新社会。他们（激进党）的角色则是修正、改善目前的社会。”而一个半世纪以前的大革命时期，罗伯斯庇尔（Maximilien de Robespierre）在阐述“革命政府”的职能时说：“宪制政府的目的是保卫共和国；而革命政府的目的是建立它。”\n\n在社会党内部，这种改良与激进的分歧在饶勒斯与盖得的争论中已经有体现。但即使是饶勒斯，也并没有真正放弃革命的立场。而在布鲁姆这个被后世许多人视为改良主义代表的人眼中：阶级矛盾已经不再注定是不可调和的，国家并不一定是统治阶级意志的表达——这点已经被以普选为基础的民主制度改变。但社会党作为一个革命性的政党，一个要最终实现社会主义——也就是所有制的改变——的政党的性质，至少在党内官方的立场表达中一直存在到80年代密特朗当选总统时。\n\n**5\\. “共产党人不在左翼，他们在东方。”**\n\n时间到了二战之后。共产党因为在战争中的巨大牺牲而获得了几乎和戴高乐将军（Le Général De Gaulle）一样高的地位。但冷战序幕的渐渐拉开，法国自然属于西方阵营，而仍然紧跟苏联的法国共产党在政坛上日渐被孤立。整个第四共和期间，主导政坛的“第三力量”（Troisième Force）——由左翼社会党、中间派激进党和中右翼共和人民运动等几个更靠近中间的政治力量组成的执政联盟——将左侧的共产党和右侧的戴高乐主义一直挡在政府门外。\n\n在外交政策上，“第三力量”坚定地站在西方阵营中。当时的社会党总书记年吉·莫莱（Guy Mollet）曾经这样评价法国共产党：“共产党人不在左翼，他们在东方。”几十年后，当苏联大规模部署SS20导弹时，社会党总统密特朗（François Mitterrand）针对左翼内部试图淡化这一事件的说法指出：“和平主义在西方，但导弹在东方。”\n\n1946年成为社会党总书记的吉·莫莱在当时代表着一种对更加正统的阶级斗争路线的回归——在法国语境下，更准确的说法应该是盖得主义——和对三十年代以来莱昂·布鲁姆所代表的改良主义路线的抛弃。然而在吉·莫莱领导社会党的长达二十多年时间里，他在理论上的毫无建树、在现实政策中的机会主义让社会党声望大幅下跌。在整个第四共和期间，苏伊士运河战争、阿尔及利亚问题等议题上，社会党的官方立场清晰地站在殖民者一边，让当时大量知识分子和社会党选民失望。到六十年代初，社会党几乎失去了大半的党员和一半以上的选民。那时在左翼内部的力量对比上，共产党占有绝对优势。一直到密特朗的出现。\n\n1958年，随着第四共和在阿尔及利亚战争的危局下终结，戴高乐重新出山，开启了第五共和。1962年的公投结果将总统改为直接普选，标志着第五共和总统制的开始。总统大选投票的两轮制——第一轮如无人得票过半，则得票数最高二人进入第二轮——在形式上促进了政治上的二元对立：进入第二轮以后，各个政党需要实施联合，团结在两个候选人中的一个周围。这对习惯了议会制传统的法国政坛来说是一个巨大的变化。\n\n1965年的第一次总统普选，戴高乐毫无悬念地当选。然而左翼推出的唯一候选人、当时年仅49岁的一位戴高乐主义的坚定批判者成功把戴高乐拖进了第二轮。这个年轻人就是弗朗索瓦·密特朗。\n\n在1965年总统选举取得优异战绩后，密特朗自然地获得了所有非共产党的左翼政党组成的联盟“民主与社会主义左翼联盟”（FGDS）主席的地位。他开始与共产党接触，推进左翼团结的事宜。经历了68年五月风暴的短暂间隙后，左翼的联合最终在1972年结出了花朵——密特朗与共产党和左翼激进党一道签署了《共同纲领》（Programme commun），并将其作为1974年乃至1981年竞选总统的基础文件。此前一直与共产党互相攻击、似乎逐渐走向中间的社会党再次调头，开始向左翼汲取力量。\n\n1978年议会选举中，社会党的得票率第一次超过共产党。而1981年的总统选举中，密特朗再次面对老对手吉斯卡尔·德斯坦，这次他赢了，成为了第五共和的第一位左翼总统。第一位左翼总统的出现给当时的法国社会带来了久违的欣喜，几乎所有大城市都出现了自发的庆祝游行。一个月后的议会选举中，社会党独自获得了过半的席位——按照莱昂·布鲁姆的说法，他们已经“夺取权力”了。\n\n密特朗上任以后，开始落实共同纲领中的部分内容，按照竞选承诺实施了一些左倾政策：对工业、银行业等的大规模国有化、法定每周工作时间缩短到39小时、带薪假增加到5周、行政去中心化（Décentralisation）等等。这些政策给左翼民众带来了巨大的期待。然而大规模的国有化并没有真正提高生活水平，而糟糕的国际经济走向使得需求侧的刺激并无效果，增加社会福利的政策花销巨大，通胀、财政赤字、失业率……1981年10月起，法郎第一次贬值，到1983年3月，法郎第三次贬值，资本已经大规模外逃的时候，紧缩政策终于呼之欲出。在这次史称“紧缩转向”（« Tournant dela rigueur »）的大调头之后，先前国有化的企业开始再度被私有化，金融市场开始自由化，增加税收，削减公共开支……执政的社会党从此刻开始彻底——至少在实践上——进入了市场经济的轨道，放下了“与资本主义决裂”的决心。\n\n此后的社会党政府确认了这一趋势：市场被正名，企业开始得到重视……《共同纲领》没有被最终落实，而法国社会党渐渐开始像欧洲其他国家的社会民主党（social-démocratie）一样，开始在欧洲一体化——这个密特朗曾全力推动的进程——和全球化背景下的市场经济体中成为一个管理者，而不是革命者。\n\n可以说，是密特朗几乎是凭借一己之力，将社会党带到执政舞台；又凭借自己的控制力，让社会党比较平稳地完成了实践中向一个市场经济体制下的执政党的转型；但同时，也是密特朗的存在，使得社会党并未从理论上彻底肯定并展示自己的社会民主主义路线，正是密特朗用一次次高超或是功利的政治手段处理问题，而回避了真实的改革与反思，给他身后的社会党留下了大量积弊，至今都不能说已经解决。在一个共产党早已被边缘化，社会党成为主要执政党之一的今天，实践中的改良主义和话语中不时出现的激进口号仍然并存于社会党的日常之中。\n\n奥朗德2012年当选时，仍把“金融界”当作是“最大敌人”。在当选之后一年，他也渐渐开始了密特朗式的“紧缩转向”——即使幅度已经远远不如当年。被问及是否已经成为社会民主主义者时，奥朗德在2013年仍拒绝承认，坚称自己是社会主义者。直到2014年，他才终于明白无误地说出社会民主主义这个词。\n\n可以说从盖得、饶勒斯开始，到布鲁姆，再到莫莱，似乎社会党总是在面对执政实践的同时，不放弃革命话语。而这两者之间的裂痕，要么是靠布鲁姆略显生硬的理论发明（布鲁姆发明了“夺取权力”与“行使权力”的区别，用来说明一个革命性的政党可以在资产阶级社会中执政）来弥补，要么就是像莫莱时期那样更直接地展现出来。一直到90年代初，法国社会党都迟迟未能像德国社会民主党在哥德斯堡纲领（Programme de Bad Godesberg）里那样完成自己的修正主义转型。\n\n**二、左翼的价值观内核**\n\n如果说左翼有什么价值内核的话，我觉得比较重要的一个是正义，一个是进步。而正义相对比较好理解，我想主要说一下进步这个概念。\n\n**1\\. 进步——启蒙理性的光辉与反思**\n\n继承了启蒙思想家对理性的崇尚，从大革命以来的左翼对理性所能推动的进步抱有最坚定的信心。科技进步促进物质水平提高，物质水平提高带来人类道德水准的提升。大革命时期，孔多塞（Nicolas de Condorcet）就为这种理念给出了热情的表述。从此以后，对进步的追求一直是贯穿所有左翼斗争的核心内容。\n\n进步的理念至少在两个层面上是不平凡的。它预设了人可以被改进、提升的前提。它与右翼、或者说保守主义的观念相反：在后者看来，人性亘古不变，只是在每个时代不断显现而已，遵从人性设计制度即是最好的可能。它隐含了一种有方向的历史哲学：历史即使在某一时期会迂回乃至倒退，但总会或者至少是总应该向一个方向前进，而在这一前进的道路上被丢在后方的制度、人物、激情、思潮，便都已经是过去时了，而当下决不是它们的重复。\n\n在进步如何落实的问题上，激进党人坚信：实施积极的社会政策（征收所得税、公共建设）、摆脱教权的蒙蔽、实施全民义务教育是推动进步的必经之路。而在社会主义者看来，生产关系的改变才是把科技进步最终转变为人民福祉的途径。在圣西门那里，对进步的足够信仰使他认为进步几乎可以自发进行；而在马克思那里，进步的推动须经由一个团体——无产阶级——领导的革命运动才可以实现。\n\n在今天这个科技进步速度比以前任何一个时期都快的情况下，人们对进步的概念反而抱有着前所未有的怀疑。一方面，理性是否是替代上帝的终极拯救者？二十世纪的纳粹大屠杀让理性的信奉者不得不重新反思理性的局限与危险。另一方面，随着科技进步及随之而来的工业化对社会和自然的改造的不断深入，人们开始反思技术对生活的“侵入”、对环境的破坏，生态主义作为一种回应日渐壮大起来。在生态主义这种如今多被归为左翼的意识形态中，对自然的“保存”成了核心，而往往与“进步”联系着的“增长”则成了被质疑的对象。新形势下，左翼需要面对这个变化。\n\n**2\\. 秩序与运动——左与右的根本分野**\n\n说到最后，我们可以回到这个更根本的问题上来：分别左与右的到底是什么？如果让我给这个不可能有满意答案、但无数人都曾尝试回答的问题给出看法的话，那么我会说：左翼，至少在历史上的左翼，是一个提出革新、引领社会变革的力量；左与右的分野，从根本上说出现在对秩序（ordre）的态度上。\n\n共和派最初处在政治光谱的极左端，在王权秩序还笼罩着法国，保守反动的力量从当权到逐渐衰落、淡出的十九世纪里，他们为共和制的建立付出了巨大的努力。然而在共和制逐步确立、主要敌人——君主制不复存在、政治自由被落实并被全社会大多数人认可后，温和的共和派在政治光谱上渐渐向中间靠拢，把中左的位置留给了激进党人。而随着工业革命、社会主义思潮涌现出的社会主义者占据了光谱的左翼。\n\n社会主义政党在法国从诞生开始就在自己的左翼受到工会力量的压力。后者不相信政党政治，要求更直接的行动以促进更具体的工人权益的落实。1920年图尔会议后，社会主义者又面临着共产党这个在自己左侧的兄弟的竞争，在这个曾拥有庞大组织和惊人动员力的政党面前，社会党也曾一度不占上风。\n\n当社会福利制度已经稳固，人民生活水平稳固提高的黄金三十年末期，来自青年人和理论家的种种思潮又将共产主义视为是保守与僵化的代名词，六七十年代里，无政府主义、托派、情景主义（situationisme）这些或旧或新的意识形态在当时从更左的侧翼撼动了法共的地位。\n\n我们看到，每个时代的新兴团体、以激烈改造现有秩序的为动机而出场的力量都是以极左翼的姿态出现在政治舞台上，而随着社会秩序被切实改变，乃至当旧制度已经不再，改变已成为共识的时候，之前的左翼政党便会走向政治光谱中间移动，并被新兴的要求新的变革的力量取代。\n\n**3\\. 右翼保存传统，左翼输出想象力**\n\n如果说右翼通过对秩序的理解与维护，为人类保留乃至揭示了传统中存在的智慧与光芒的话，那么左翼则通过追求变革为人类贡献了更多的想象（imaginaire）。可能有人注意到了——对于大革命、巴黎公社和68年五月风暴这几个左翼史上最重要的革命时刻，我都完全没有展开。因为这都是太复杂的题目，这里我只是想在最后谈一下“革命想象”。\n\n请不要轻视想象。我在这里引用政治史家米歇尔·维诺克（Michel Winock）的一段话，从一种近乎功能主义的方式来说明“革命想象”的社会效用：“革命的神话是当前社会的对立面：在一种对完美的苛求下，当前社会所孕育的缺陷与不幸显得无可忍受。［…］革命理想控诉着那些使人类难以构想自身解放的可见或隐匿的束缚。即使是如此虚幻与不切实际，革命通过她所引发的恐惧，仍在刺激着国家的掌控者们，揭露着让人沉睡的意识形态，促使有产者们保持警觉，使他们明白为了保存自身利益，没有改革只用镇压注定会一无是处。于是，革命者的无力可能只是一种表象：他们的存在即是在为改造世界做出贡献。”\n\n我想在结尾处说的是，我乐意介绍法国而不是别处的政治史，最主要的原因当然是因为我对法国比较了解，但同时我们也应该注意到：法国的确是一个输出概念的国家，而法国左翼在历史上一直是一个为全人类贡献想象的力量。\n\n请不要轻视想象的传播。就像我在一开始说的：“简化与想象是思想传播过程中必经的道路”。在风平浪静的时代与社会中，现实控制力、镇压机器、资本似乎可以尽情嘲笑这些遥远的、来自异域的想象，对它们不以为然。但历史一次次地向我们展现着它们的生命力。为了巩固法美友谊、同时也为了表达第二帝国之下自由派人士对共和制的向往，法国雕塑家巴特勒迪（Frédéric Auguste Bartholdi）制作的自由女神像成为美国的象征，给一代又一代奔向新大陆的移民以无限憧憬；1989年，北京艺术院校的大学生们又模仿它制成了民主女神像，在广场中心与毛像相对。而1918年1月，在十月革命后的第73天，列宁在下着雪的克里姆林宫里跳起了舞步——因为布尔什维克政权已经比巴黎公社多存活了一天！\n\n（本文作者宋迈克：生活在巴黎，本职为电力电子工程师，空余时间关心时政，钻研政治史。参与鸡鸣时——巴黎文化沙龙的组织工作。原文发表于世界说，经世界说编辑及作者授权微思客后推送，原文链接[http://dwz.cn/3wxnXg。）（本文转载自微思客。仅代表作者个人观点，不代表本网站立场）](http://dwz.cn/3wxnXg。）（本文转载自微思客。仅代表作者个人观点，不代表本网站立场）)"
		}
	]
}