{
	"title": "p2p software",
	"description": "open source",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1550423360,
	"post": [
		{
			"post_id": 29,
			"title": "Сделать из глобальной сети локальную – депутаты Госдумы приняли в первом чтении закон о «суверенном интернете»",
			"date_published": 1550423283.325,
			"body": "Мечта властей РФ – интернет как гостелевиденье. Сегодня депутаты сделали еще один шаг к цензуре информационного пространства – в первом чтении принят законопроект об автономной работе Рунете. Вот антиутопия на глазах становится реальностью. Изоляция, усиление контроля и подавление инакомыслия в сети – основная цель репрессивного новшества скандально известного сенатора-часоносца Клишаса. Чтобы обезопасить себя от критики, а население оградить от достоверной информации, власти готовы поставит под угрозу само функционирование глобальной сети на территории РФ. Заодно – истратить на это дело миллиарды миллиардов рублей.\n\nАвторы проекта — сенаторы Андрей Клишас и Людмила Бокова, а также депутат Госдумы Андрей Луговой. Они предлагают поправки в закон «О связи» и «Об информации», разумеется, как меру защиты от внешних врагов, жаждущих нарушить работу глобальной сети именно в России.\n\nДля «целостности, устойчивости и безопасности функционирования» российского сегмента интернета власти планируют установить на сетях связи технических средств, определяющих источник передаваемого трафика. При этом «Технические средства должны будут обладать возможностью ограничить доступ к ресурсам с запрещенной информацией не только по сетевым адресам, но и путем запрета пропуска проходящего трафика».\n\nДругая мечта чиновников, порожденная их ниевежеством – единый центр управления и регулирования интернета. Как отмечали ранее эксперты из организации «Цифровая экономика», проект предлагает предоставить Роскомнадзору полную карту точек обмена трафиком, благодаря чему интернет-цензоры без труда смогут блокировать каналы доступа к любому сайту. Но эксперты опасаются, что попытка реализации этого проекта создаст в системе маршрутизации трафика критическую точку, которая вообще может привести к сбоям всей национальной системы связи.\n\nПри внесении законопроекта авторы утверждали, что на его реализацию не нужны дополнительные бюджетные деньги. Позднее Клишас заявил, что в рамках проекта «Информационная безопасность» на создание «железного занавеса» в интернете все-таки заложено более 20 млрд рублей. При этом эксперты оценивают возможные затраты на реализацию проекта сетевой цензуры в пределах сотни миллиардов рублей.\n\nТем временем, флагманы российской IT-отрасли - представители компаний «Яндекс» и «Mail Group», которой принадлежит «ВКонтакте», ранее поддержали скандальную инициативу о создании автономного интернета в РФ. Теперь операторы связи проведут учения, чтобы найти слабые места в проекте и понять, как их исправить.\n\nПлатить за новую порцию цензуры придется, конечно, жителям страны. Это признают даже чиновники Счетной палаты, в отзыве которой сказано, «реализация законопроекта приведёт к росту стоимости товаров и услуг на российском рынке, что содержит риск увеличения расходов бюджетов всех уровней бюджетной системы РФ на их оплату».\n\nЧем все это чревато для простых пользователей? В случае реализации законопроекта у Роскомнадзора будет возможность более эффективной блокировки неугодных ресурсов. Соответственно, тем же мессенджером Телеграм пользоваться станет невозможно. Еще есть вероятность, что в целом интернет станет работать медленнее. И, разумеется, вырастут цены на услуги связи и доступ в сеть. Вот только многие эксперты уверены, в том, что суверенный интернет — вещь в принципе «технически невозможная» и построить ее пытаться могут только «клинические идиоты»."
		},
		{
			"post_id": 28,
			"title": "Tor Bridge Node Relay Debian",
			"date_published": 1550267187.188,
			"body": "# Помочь заблокированным пользователям Tor Bridge Node Relay создание Tor маста\n\nВидео [https://www.youtube.com/watch?v=h-ppzJ3mZhQ](https://www.youtube.com/watch?v=h-ppzJ3mZhQ)\n\nConfig\n\n```\nSocksPort 0\nORPort 9001\nBridgeRelay 1\nNickname RusTorBridge\nContactInfo none <gpl@sd.com>\nRelayBandwidthRate 32 MBits\nRelayBandwidthBurst 42 MBits\nExitPolicy reject *:*\n```"
		},
		{
			"post_id": 27,
			"title": "My Debian Server",
			"date_published": 1550266071.882,
			"body": "Мой сервачок в кладовке\n\n![IMG_20190216_002612_1_.jpg (675x900)](data/img/post_27_IMG_20190216_002612_1_.jpg)![IMG_20190216_002515.jpg (1200x900)](data/img/post_27_IMG_20190216_002515.jpg)"
		},
		{
			"post_id": 26,
			"title": "Snappy Driver Installer open source driver pack",
			"date_published": 1550265389.252,
			"body": "<div class=\"download_background\">\n\n![1519203003_sdi.jpg (965x570)](data/img/post_26_1519203003_sdi.jpg)\n\n<span class=\"title\">Установи нужные драйверы и обнови старые</span>\n\n<div class=\"content\">Потерял диск с драйверами? Не можешь найти нужный драйвер на сайте производителя? Windows Update ничего не находит? Тогда эта программа для тебя!\n\nЕсли ты занимаешься ремонтом и наладкой, то можешь использовать программу с флешки, устанавливая драйверы даже при отсутствии Интернета. Программа способна работать сразу же после установки Windows.\n\n[https://sdi-tool.org/?lang=ru](https://sdi-tool.org/?lang=ru)\n\n</div>\n\n</div>"
		},
		{
			"post_id": 24,
			"title": "Книги для радиолюбителей",
			"date_published": 1550264452.718,
			"body": "![______.JPG (504x663)](data/img/post_24_______.JPG)\n\n[http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGLe311PAqQm63B2A1MnFctPm8W25XC1i/1550264438-%20%20.zip](http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGLe311PAqQm63B2A1MnFctPm8W25XC1i/1550264438-%20%20.zip)"
		},
		{
			"post_id": 23,
			"title": "NanoRing",
			"date_published": 1550262826.413,
			"body": "![20171215_2_2._750.jpg (750x293)](data/img/post_23_20171215_2_2._750.jpg)\n\nВо всей современной электронике используются транзисторы. Несмотря на бурное развитие технологий, сам принцип работы транзистора за последнее время мало изменился, но вскоре благодаря компании Qualcomm нас может ждать небольшая техническая революция из-за появления транзистора абсолютно нового типа под названием NanoRing.\n\nРанее в этом году специалисты Qualcomm, совместно со своими коллегами из Applied Materials и Synopsys, провели расчеты математических моделей пяти новых типов транзисторов следующего поколения. В отличие от современных электронных транзисторов, в которых основным элементом является кремниевое «ребро», пропускающее ток во включенном состоянии, NanoRing работают иначе. Они представляют собой «сэндвич» из трех кремниевых прямоугольных каналов. Каждый такой канал окружен слоем диэлектрика, покрытого металлическим слоем управляющего электрода — затвора. Подача электричества на затвор изменяет напряженность электрического поля в кремнии, что позволяет току течь через него.\n\nНесмотря на отличные результаты, полученные в ходе расчетов математических моделей, о полноценном успехе говорить пока рано. Первые испытания NanoRing должны состояться в 2018 году, и если они пройдут успешно — Qualcomm собирается разработать смартфон на основе новых транзисторов. В случае успеха это будет телефон, который для своей работы будет потреблять в несколько раз меньше энергии, чем существующие модели при сохранении той же производительности."
		},
		{
			"post_id": 22,
			"title": "Конституция РФ 1993-2016",
			"date_published": 1550212113.419,
			"body": "Конституция РФ 1993-2016\n\n![f66c06892f081524502a.jpg (604x394)](data/img/post_22_f66c06892f081524502a.jpg)"
		},
		{
			"post_id": 21,
			"title": "Otter Browser",
			"date_published": 1550157768.091,
			"body": "![Otter_Browser__Breeze_style_.jpg (1200x675)](data/img/post_21_Otter_Browser__Breeze_style_.jpg)\n\nOtter Browser — свободный интернет-браузер с открытым исходным кодом на основе движков Qt и QtWebKit. Разработчики стремятся создать браузер максимально похожий на последнюю «классическую» версию браузера Opera 12.x. Пользовательский интерфейс написан на базе Qt5 что является одной из широко освещаемых особенностей.\n\nOtter Browser aims to recreate the best aspects of the classic Opera (12.x) UI using Qt5.\n\n[https://otter-browser.org/](https://otter-browser.org/)"
		},
		{
			"post_id": 20,
			"title": "Open source search  server",
			"date_published": 1550145411.009,
			"body": "![991f1d5acc8c12baec07.jpg (750x420)](data/img/post_20_991f1d5acc8c12baec07.jpg)\n\nOpen source search server система полнотекстового поиска\nпоисковый движок Sphinx который используется в таких крупных проектах как авито\n\n[http://sphinxsearch.com/](http://sphinxsearch.com/)\n[http://sphinxsearch.com/downloads/current/](http://sphinxsearch.com/downloads/current/)"
		},
		{
			"post_id": 18,
			"title": "Scuttlebutt – непривязанная к серверу безопасная социальная сеть",
			"date_published": 1550145026,
			"body": "![screenshot.jpg (1152x900)](data/img/post_18_screenshot.jpg)\n\nБезопасность переписки обеспечивается с помощью шифрования. Чтобы отправить кому-либо сообщение, нужно записать его в своем дневнике, который будет храниться на вашем компьютере\n\nПредставьте, что вы можете переписываться с друзьями без Интернета, а все посты хранятся на вашем компьютере, а не на сервере. А еще ваше общение полностью безопасно. По такому принципу работает социальная сеть _**Scuttlebutt**_. Корреспондент [Теплицы](https://te-st.ru) разбирался, как устроена сеть.\n\nScuttlebutt создал разработчик программной платформы Node.js _**Доминик Тар**_р (Dominic Tarr) из Новой Зеландии. Дело в том, что Тарр часто путешествовал и был в офлайне. По этой причине он решил разработать социальную сеть, которая не требует подключения к Интернету, а значит, не зависит от него.\n\nИх называют peer-to-peer сети (P2P, пиринговые файлообменные) – они обеспечивают интернет-пользователям возможность обмениваться файлами напрямую, без участия сервера.\n\nОна работает на основе уникальной сети сообщений _**Secure Scuttlebutt**_ (SSB), что делает ее полностью децентрализованной. Например, как Bitcoin или BitTorrent. В отличие от централизованных систем, как PayPal или Dropbox, у нее нет единого веб-сайта или сервиса для подключения. То есть никакая компания или посредник не смогут проконтролировать сеть.\n\n[https://www.scuttlebutt.nz/](https://www.scuttlebutt.nz/)\n[https://ahdinosaur.github.io/patchwork-downloader/](https://ahdinosaur.github.io/patchwork-downloader/)\n[https://github.com/ssbc/ssb-server/wiki/Pub-Servers](https://github.com/ssbc/ssb-server/wiki/Pub-Servers)\n[https://github.com/ssbc/patchwork](https://github.com/ssbc/patchwork)\n\nManyverse версия для adndroid [https://www.manyver.se/](https://www.manyver.se/)\n\nПубличьный паб [https://ssb.organicdesign.pub/](https://ssb.organicdesign.pub/)"
		},
		{
			"post_id": 17,
			"title": "emule p2p file sharing",
			"date_published": 1550144489.195,
			"body": "![peersemule-1024x579.jpg (1024x579)](data/img/post_17_peersemule-1024x579.jpg)\n\n**eMule is a free peer-to-peer file sharing application for Microsoft Windows. Started in May 2002 as an alternative to eDonkey2000, eMule now connects to both the eDonkey network and the Kad network. Often used by clients looking for extremely rare content, the distinguishing features of eMule are the direct exchange of sources between client nodes, fast recovery of corrupted downloads, and the use of a credit system to reward frequent uploaders. Furthermore, eMule transmits data in zlib-compressed form to save bandwidth.** \n\n**eMule is coded in C++ using the Microsoft Foundation Classes. Since July 2002 eMule has been free software, released under the GNU General Public License; its popularity has led to eMule's codebase being used as the basis of cross-platform clients aMule, JMule, xMule, along with the release of many eMule mods (modifications of the original eMule) on the Internet.**\n\n**https://www.emule-project.net**\n\n**http://upd.emule-security.org/nodes.dat nodes.dat**"
		},
		{
			"post_id": 16,
			"title": "Вся правда о контроле за информацией",
			"date_published": 1550144409.303,
			"body": "**https://www.youtube.com/watch?v=4Kl3LBoBp44**"
		},
		{
			"post_id": 15,
			"title": "Лекция - шифрование, анонимность и альтернативные сети ч.1",
			"date_published": 1550144363.812,
			"body": "**https://www.youtube.com/watch?v=etMZNrtlpBw**"
		},
		{
			"post_id": 14,
			"title": "Шифрование информации и обеспечение анонимности в интернете&#187; лекция И.И. Чертова 20.11.2015 20",
			"date_published": 1550144319.595,
			"body": "https://www.youtube.com/watch?v=oKOVxgjvi9Y"
		},
		{
			"post_id": 13,
			"title": "Шифрование информации и обеспечение анонимности в интернете.Практикум Лекция И.И.Чертова",
			"date_published": 1550144217.903,
			"body": "**Шифрование информации и обеспечение анонимности в интернете.Практикум»Лекция И.И.Чертова** \n\n**https://www.youtube.com/watch?v=1jWNkQ4up1E**"
		},
		{
			"post_id": 11,
			"title": "Лекция. Ричард Столлман",
			"date_published": 1550144089.164,
			"body": "**https://www.youtube.com/watch?v=SIvSgFhUA_k**"
		},
		{
			"post_id": 10,
			"title": "perfect dark 1.23 p2p японская файлообменная сеть с шифрованием ",
			"date_published": 1550143878.455,
			"body": "![0f.JPG (1200x646)](data/img/post_10_0f.JPG)\n\n**perfect dark 1.23 японская файлообменная сеть с шифрованием** \n\n**[http://perfectdark.org/pd_clients/](http://perfectdark.org/pd_clients/)\n[https://perfectdark.benri-tool.net/init/install.html](https://perfectdark.benri-tool.net/init/install.html)\n[https://perfectdark.benri-tool.net/node/](https://perfectdark.benri-tool.net/node/) nodes**"
		},
		{
			"post_id": 9,
			"title": "diaspora Nodes list diaspora pod server list",
			"date_published": 1550143759.279,
			"body": "**Федеративная социальная сеть**\n\n[https://the-federation.info/](https://the-federation.info/)"
		},
		{
			"post_id": 8,
			"title": "Поисковик торрентов Torrent搜索引擎 dht Torrent search Rats on The Boat",
			"date_published": 1550143319,
			"body": "# ![34.jpg (1200x675)](data/img/post_8_34.jpg)Децентрализованный поисковик который невозможно заблокировать так как он собирает информацию о торрентах прямо из трафика в этом поисковике 90 процентов раздач со всего мира\n\n**BitTorrent search program for desktop and web. Collect and navigate over base of torrents statistic, categories, and give easy access to it. Work over p2p network and support Windows, Linux, Mac OS platforms.**\n\n**Внимание самая стабильная версия по ка что это 1.1.1**\n\n**the most stable version of 1.1.1**\n\n[https://github.com/DEgITx/rats-search/releases/download/v1.1.1/rats-search-1.1.1-portable.win.x64.zip](https://github.com/DEgITx/rats-search/releases/download/v1.1.1/rats-search-1.1.1-portable.win.x64.zip)\n\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGLe311PAqQm63B2A1MnFctPm8W25XC1i/Rats%20on%20The%20Boat%20linux%20windows.zip\n\n[https://github.com/DEgITx/rats-search/releases](https://github.com/DEgITx/rats-search/releases)"
		},
		{
			"post_id": 7,
			"title": " Twister цензура устойчивая социальная сеть Peer-to-peer microblogging\n",
			"date_published": 1550142731,
			"body": "<div class=\"article-content entry-content\" itemprop=\"articleBody\">\n![twister.JPG (1211x859)](data/img/post_7_twister.JPG)\n**Twister цензура устойчивая социальная сеть работающая по принципу bittorrent с поддержкой dht** \n\n<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">\n\n<div style=\"text-align: center;\">**при создании профиля в этой сети придется подождать 20-40 минут пока данные вашего профиля сохраняться в dht навсегда при повторных входаж ждать уже не придется**</div>\n\n<div style=\"text-align: center;\"> **Peer-to-peer microblogging\ntwister is the fully decentralized P2P microblogging platform leveraging from the free software implementations of Bitcoin and BitTorrent protocols.** </div>\n\n**[](http://twister.net.co/)** \n\n<div style=\"text-align: center;\">**[http://twister.net.co/](http://twister.net.co/)**</div>\n\n<div style=\"text-align: center;\">**[https://github.com/dryabov/twister-webkit/releases](https://github.com/dryabov/twister-webkit/releases)**</div>\n\n[](https://github.com/dryabov/twister-webkit/releases)\n\n</div>\n\n</div>"
		},
		{
			"post_id": 6,
			"title": "Jami",
			"date_published": 1550142198,
			"body": "Jami is a free and universal communication platform which preserves the user's privacy and freedoms.\n\n![couverture-jami-iphone.png (412x828)](data/img/post_6_couverture-jami-iphone.png)\n\n<div class=\"text\">\n\nThe application uses distributed hash tables (DHT) to establish communications. This technology eliminates the use of centralized registers and the retention of personal data. Jami is based on a distributed network technology, allowing it to not use servers that require dependency and that facilitate mass surveillance.\n\nJami stores your secrets (private keys for encryption and identity) only on the machine that executes it, which belongs to you. Your device is therefore the sole holder of your information.\n\n</div>\n\nJami offers a digital identity with accounts that do not require anyone exposing their personal identity. All of the communications are encrypted with no exception with the most advanced current techniques. As a free software, Jami is underpinned by an essential objective: to be a distributed communication system that respects the privacy of its users, thanks to its design without infrastructures or centralized servers.\n\n<div class=\"text\">\n\nJami is proud to be and use only free software. Jami is under GPLv3+ license. This founding principle makes it possible to attract as many people as possible from all horizons, to make all the executed code verifiable and therefore provide a healthy community development model.\n\nJami is also officially a GNU package and a high priority project as a result of its integration as a GNU project of the Free Software Foundation.\n\n</div>\n\nJami has a multitude of uses. Whether sending text messages, making secure, reliable audio and video calls, or sharing documents and files, Jami provides high-quality communication and data exchange.\n\nWhether interacting with your family on the other side of the world or sharing documents securely with your employees, Jami offers a complete range of possibilities for your communication needs.\n\n<div class=\"text\">\n\nEveryone must be able to use modern communication technologies without being / becoming experts in the field. Jami is concerned with making these technologies intelligible and accessible, but at the same time keeping them open to expert adjustments. The 100% free and open source development model ensures high quality standards.\n\nThe use of protocols, development methods and portable languages, all proven and recognized by experts in the field, allow Jami to maintain a long-term development while meeting the needs of both professionals and individuals.\n\nhttps://jami.net/\n\n</div>"
		}
	]
}