{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Приглашаем в Jabber (XMPP) чаты про распределённые сети",
			"body": "Также в этой теме можно делиться ссылками на другие jabber и не только сообщества\n\nru@c.cpunks.moe CA - Криптоанархизм, шифропанк, практическая информационная безопасность\n\nnetwhood@c.xmpp.netwhood.online Network Neighborhood - Подключение и пиринг к распределённым сетям и системное администрирование\n\nru.meshnet@conference.a3.pm Meshnet and Crypto-Anarchy - Обсуждаем меш-сети p2p и криптовалюту",
			"added": 1579329336
		}
	],
	"topic_vote": {
		"1_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 1,
				"body": "> [awpav4knuc](#comment_4_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk): Лично я уверен в том, что люди могут защитить самих себя, когда их большинство.\nВ одном аниме девушка со своей зверушкой путешествует по миру и находит странный город, в котором правит большинство. По законам этого города после каждого голосования тех, кто оставался в меньшинстве убивали. Так что постепенно осталось в живых только 3 человека, которым приходилось голосовать одинаково, чтобы выжить. Это была семейная пара, у которой должен был родиться ребёнок и еще один мужчина. Дальше не очень помню, что произошло, но остался только один житель. И в последнем голосовании девушка и её животное проголосовали одинаково, так что они победили. А оставшемуся горожанину по закону оставалось лишь самоубиться (хотя для кого соблюдать этот дурацкий закон, если ты остался один? вопрос японской чести)",
				"added": 1573323773
			},
			{
				"comment_id": 2,
				"body": "if0, надо тогда писать явно: \"при отказе от Х я получу то-то\" или \"вместо Х используйте Y и тогда получите преимущество Z\". Иначе какой смысл отказываться, если ты только теряешь. Никто не будет тебя слушать в таком случае.",
				"added": 1573413890
			},
			{
				"comment_id": 3,
				"body": "if0, ты хочешь чтобы все резко вдруг отказались. Так не пойдет. Наметь план из шагов (некоторые из которых опциональны) иначе тебя действительно никто не будет слушать.",
				"added": 1573588828
			},
			{
				"comment_id": 5,
				"body": "if0, надо объяснить в чем заключается свобода, чтобы мы могли как лакмусовой бумажкой определить: это свобода или нет. А то написать всякий может на своём сайте или программе, что он радеет обо всём человечестве. Надо отличать добро от зла.",
				"added": 1573756405
			}
		],
		"1_1DMpDMVvaeUTgC6WjCqav9CRGedc3opwkF": [
			{
				"comment_id": 4,
				"body": "> Пользователи ряда онлайн-площадок, включая Twitter, Reddit и форум Google, активно обсуждают нововведение. \nВ твиттери и реддите цензура ещё хуже вообще-то.",
				"added": 1573667134
			}
		],
		"1_1KiZLn2abH473fG7uan8mFgBkAndAahppK": [
			{
				"comment_id": 6,
				"body": "Нет, это просто количество нод, с которыми есть соединение. А траффик проходит обычно через 3 ноды",
				"added": 1574964833
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 7,
				"body": "Я думаю, нужен сайт новой социалистической революции, несущий мир и добро.",
				"added": 1574964978
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 8,
				"body": "Fidonet - самая популярная, наиболее развитая, лёгкая для установки, по сравнению с другими, mesh-сеть. А Ygg - только POC",
				"added": 1576268722
			},
			{
				"comment_id": 9,
				"body": "А чем тебе фидонет не меш? можно передавать почту хоть по интернету, хоть по телефону или радио - любыми способами.",
				"added": 1576340286
			}
		],
		"1_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": [
			{
				"comment_id": 10,
				"body": "Что делать - свободно распространять запрещённую информацию и не бояться. Всех не пересажают.",
				"added": 1577126511
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 11,
				"body": "Ахахах, просто взял и удалил контент. И где хваленая распределённость зиронета? всё один фейк. И из телеграма удалил весь контент своих аудиокниг, так что не надо говорить, что проблема чисто техническая",
				"added": 1577737468
			}
		],
		"1_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m": [
			{
				"comment_id": 12,
				"body": "> [dimka511](#comment_23_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH): А как подключиться ?\nДля андройда лучший джаббер-клиент Conversations. Но он платный в Гугл-сторе. Можно бесплатно скачать здесь: https://f-droid.org/ru/packages/eu.siacs.conversations/\nF-droid как Гугл-стор, только с open source приложениями.\nДля iphone используйте джаббер-клиент ChatSecure\nДля компьютера Psi или Gajim\nНадо будет зарегиться на любом джаббер сервере, вот список:\nhttps://xmpp.net/directory.php",
				"added": 1579370033
			},
			{
				"comment_id": 13,
				"body": "> [dude](#comment_80_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): В матриксе они же?\nПервый чат - только в джаббере\nВторой чат имеет связь с телеграммом и irc через бридж\nТретий связан с matrix и телеграммом аналогичным образом.\nУчастие через джаббер имеет преимущество в том, что те кто желают анонимности могут не светить свой номер телефона",
				"added": 1579370246
			}
		]
	},
	"comment_vote": {
		"4_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk": 1,
		"11_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m": 1,
		"49_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	}
}