{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "J'ai reinstallé ZeroNet et j'ai un bug graphique",
			"body": "J'ai du reinstallé ZeroNet car je me suis trompé en faisant mon backup lors du formatage de mon ordinateur (une option automatique ça serait vraiment cool)\nDu coup vous savez la petite cloche sur ZeroHello qui indique qu'il y a eu une erreur sur la mise à jour d'un site, et bien moi j'ai un carré à la place. Je vois pas d'ou cela viens... Une police d'écriture manquante ? Mais laquel ?\nMerci d'avance",
			"added": 1479192954
		},
		{
			"topic_id": 2,
			"title": "Créer un logiciel de gestion de DAO sur zeronet, possible ?",
			"body": "Pensez vous que ce genre de logiciel APSO puisse être reproduit sur ZeroNet, et être fiable ?\nhttps://www.youtube.com/watch?v=BMHTjiNTG8Y\nhttps://github.com/williamtheaux/APSO\nC'est un débat qui m'intéresse beaucoup :D",
			"added": 1486141524
		}
	],
	"topic_vote": {
		"2_1HcPSuDPs7L5wAAkBpzjt5QTvZfBxMKSoe": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 1,
				"body": "> [natanahu](#comment_1_1Ew1snYjtrxZufVn1D8tYGDwDSi7V5v3G8): Le Talmud est le livre juif sacré.Vous pouvez être seulement les juifs ou les animaux:Un non-juif est comme un chien. Les écritures nous apprennent qu'un chien mérite plus de respect qu'un non-juif.(Talmud, Ereget Rashi Erod.22 30)Les juifs ont droit à être appelés hommes ,pas les non-juifs.(Talmud, Lebhammoth 61a)Il faut remplacer les serviteurs non-juif morts, comme les vaches, ou les ânes perdus et il ne faut pas montrer de sympathie pour le juif qui les emploie.(Talmud, Iore Dea 377, 1)Les juifs sont des humains, non les non-juifs, ce sont des animaux.(Talmud, Kerithuth 6b p. 78)\n\nil ne faut pas que tu confondes le talmud et la Torah, ce qui n'a aucun rapport.\n\nLa Torah sont les 5 Livres de Moïse (Genèse Exode Lévitique Nombres Deutéronome) donnée par Elohim.\n\nLe talmud sont des ouvrages écrits par la main des religieux Juifs longtemps après La Torah.\n\nTu trouveras dans le talmud de tout, des lois qui n'en sont pas et même qui sont contraires avec La Torah et des fois tu peut y trouver des légendes.\n\nEn gros le talmud ne vaut pas mieux que les dire de Daech ou des extrémistes chrétiens. \nLe problème c'est les extrêmes de tout bord, visé vous même le juste milieux et vous pourrez vous faire un avis concret et sans jugement sur le monde et la réalité.\n\nPaix et vérité.",
				"added": 1479193607
			}
		],
		"1_1HcPSuDPs7L5wAAkBpzjt5QTvZfBxMKSoe": [
			{
				"comment_id": 2,
				"body": "0citizen pourquoi ?",
				"added": 1479361317
			}
		],
		"8_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 3,
				"body": "Tu as commencé une ébauche de site ?",
				"added": 1486143103
			}
		],
		"2_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": [
			{
				"comment_id": 4,
				"body": "Si tu n'a pas l'option Cloner sur un site en particulier, c'est que le site en question ne désire par être cloner et l'option n'est pas activé.\nAprès si tu souhaite récupéré le contenu quand même, tu peux créer un site vierge via ZeroHello, option \"Create New, Empty Site\"\nEnsuite tu va dans le répertoire du site que tu désire copier, puis tu copier toutes les données sauf le content.json dans ton nouveau site.\nPuis tu va sur ton site via ZeroNet, tu tire le tiroir en haut à droite, et tu fait :\n-Database \"Rebuild\"\n-Tout en bas tu fait \"Sign\"\n-Puis tu remonte un peu et tu fait \"Update\" vers Site Control\n\nEt voila tu as copier ton site et il est prêt à être seeder, et tu veux qu'il soit copiable, dans content.json tu rajoute ceci :  \"cloneable\": true, vers la 5eme ligne.\n\nVoilà ;)",
				"added": 1486195849
			}
		],
		"2_1HcPSuDPs7L5wAAkBpzjt5QTvZfBxMKSoe": [
			{
				"comment_id": 5,
				"body": "Je précise qu'une DAO ça veut dire Decentralized Autonomous Organization, on peut créer une démocratie direct, ou holacratie, hiérarchie via ce système ",
				"added": 1486195914
			}
		]
	},
	"comment_vote": {}
}