{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1537986126,
			"title": "Völkerrechtssubjekt \"Deutsches Reich\"",
			"body": "Auswärtiges/Antwort - 30.06.2015 (hib 340/2015)\n\nBerlin: (hib/AHE) Das Bundesverfassungsgericht hat in ständiger Rechtsprechung festgestellt, dass das Völkerrechtssubjekt \"Deutsches Reich\" nicht untergegangen und die Bundesrepublik Deutschland nicht sein Rechtsnachfolger, sondern mit ihm als Völkerrechtssubjekt identisch ist. Darauf verweist die Bundesregierung in ihrer Antwort (18/5178) auf eine Kleine Anfrage der Fraktion Die Linke zum Potsdamer Abkommen von 1945 (18/5033). Die Abgeordneten hatten sich unter anderem nach der \"These von der Fortexistenz des Deutschen Reiches\" erkundigt und gefragt, ob die Bundesregierung diese als öffentlich als unhaltbar zurückweisen werde, \"damit diese Behauptung nicht von Neonazis und der so genannten Reichsbürgerbewegung für ihren Gebietsrevisionismus gegenüber den EU-Nachbarländern instrumentalisiert werden kann\". \nhttps://www.bundestag.de/presse/hib/2015_06/-/380964",
			"added": 1537986125
		},
		{
			"topic_id": 1537986532,
			"title": "Praktikum PLUS Direkteinstieg - Paketzusteller/in",
			"body": "Zur Stelle\nAchtung: Nur für ANERKANNTE FLÜCHTLINGE; keine EU-Bürger oder Drittstaatler oder\nDeutsche Paketzusteller (m/w) Sie krempeln gerne die Ärmel hoch? Wir haben einen\nArbeitsplatz für Sie! Willkommen im Unternehmensbereich Post - eCommerce - Parcel\n(PeP) von Deutsche Post DHL Group. Wir sind die Post für Deutschland, Paketdienstleister\nfür Europa und weltweiter Logistikdienstleister für den Online-Handel. Die DHL Delivery\nBayreuth GmbH bietet anerkannten Asylbewerberinnen und Asylbewerbern aktuell am\nStandort Oberkotzau die Chance auf ein Praktikum mit anschließendem Arbeitsvertrag.\nDas Praktikum dauert je nach individuellem Kenntnisstand maximal 6 Monate, wobei die\nFinanzierung anfangs über die Bundesagentur für Arbeit und später über die DHL Delivery\nBayreuth GmbH erfolgt. Während dieser Zeit besuchen Sie parallel zu Ihrer Tätigkeit bei\nder DHL Delivery Bayreuth GmbH verpflichtende Deutsch-Sprachkurse.\ncon.arbeitsagentur.de/prod/jobboerse/jobsuche-ui\n--------------------------------\nich habe gerade auf dieser seite gesehen , das , das angebot gelöscht ist . ich verbürge mich das es dort zu finden war , wer weiterlesen will , bitte melden , habe die gesamte pdf da !",
			"added": 1537986530
		},
		{
			"topic_id": 1537986906,
			"title": "DAS NEUE SYRIEN KOMMT AUS WILMERSDORF",
			"body": "https://sladisworld.wordpress.com/2012/07/25/das-neue-syrien-kommt-aus-wilmersdorf/",
			"added": 1537986903
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}