{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Você pode ajudar a encontrar relíquias arqueológicas pela internet",
			"body": "Por meio de imagens de satélite é possível descobrir (e ajudar a preservar) sítios arqueológicos de grande relevância histórica\n- https://www.globalxplorer.org/",
			"added": 1573945942
		},
		{
			"topic_id": 2,
			"title": "Voyager é uma mídia a favor do desenvolvimento humano",
			"body": "Surge a Voyager, uma mídia independente que se propõe a contribuir com a melhora do debate público, bem como combater a desinformação existente na net e em suas redes sociais.\n- https://avoyager.net/\n- Páginas arquivadas: https://archive.md/avoyager.net",
			"added": 1573946267
		}
	],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Gravity Spy\nAjude os cientistas do LIGO a procurar [ondas gravitacionais](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Gravitational_wave.html), as ondulações indescritíveis do espaço-tempo.\n- https://www.zooniverse.org/projects/zooniverse/gravity-spy",
				"added": 1573945816
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#O que pode tornar a inteligência artificial realmente inteligente?\n\n#Estupidez automatizada\n\nApesar das muitas preocupações com a inteligência artificial e seu crescente papel na sociedade, o fato é que a geração atual de programas de inteligência artificial não é nem um pouco inteligente.\n\nExistem basicamente dois tipos de aprendizado de máquina: as redes neurais profundas, as responsáveis pelo famoso \"aprendizado profundo\", e as redes de aprendizado por reforço. Ambos são baseados no treinamento do sistema, usando quantidades enormes de dados, para executar uma tarefa específica, por exemplo tomar uma decisão.\n\nDurante o treinamento, o resultado desejado é fornecido juntamente com a tarefa. Com o tempo, o programa aprende a resolver a tarefa com precisão cada vez mais rápida, embora ninguém entenda exatamente como o programa funciona - é a chamada \"caixa preta\" da inteligência artificial.\n\n\"O problema com esses processos de aprendizado de máquina é que eles são basicamente completamente burros,\" comenta o professor Laurenz Wiskott, da Universidade Ruhr, na Alemanha. \"As técnicas subjacentes datam da década de 1980. A única razão para o sucesso atual é que hoje temos mais capacidade de computação e mais dados à nossa disposição\".\n\nMas a equipe do professor Wiskott é uma das que estão tentando eliminar a estupidez da inteligência artificial e torná-la realmente esperta.\n\n#Inteligência artificial não supervisionada\n\nHoje, a inteligência artificial pode ser superior aos humanos especificamente na única tarefa para a qual cada programa foi treinado - ela não consegue generalizar ou transferir seu conhecimento nem mesmo para tarefas similares.\n\n\"O que queremos saber é: como podemos evitar todo esse treinamento absurdo e longo? E acima de tudo: como podemos tornar o aprendizado de máquina mais flexível?\" disse Wiskott.\n\nA estratégia consiste em ajudar as máquinas a descobrir estruturas nos dados de forma autônoma. As tarefas podem incluir, por exemplo, a formação de categorias ou a detecção de alterações graduais em vídeos. A ideia é que esse aprendizado não supervisionado permita que os computadores explorem o mundo autonomamente e realizem tarefas para as quais não foram treinados em detalhes.\n\n\"Uma tarefa pode ser, por exemplo, formar agrupamentos,\" explica Wiskott. Para isso, o computador é instruído a agrupar dados semelhantes, em busca, por exemplo, de um rosto em uma foto. Transformando os píxeis em pontos em um espaço tridimensional, isso significa agrupar pontos cujas coordenadas estão próximas umas das outras. Se a distância entre as coordenadas for maior, elas serão alocadas para diferentes grupos. Isso dispensa a enormidade de fotos e suas descrições, como é usado hoje.\n\nEsse método oferece mais flexibilidade porque essa formação de aglomerados é aplicável não apenas a fotos de pessoas, mas também a carros, plantas, casas ou outros objetos.\n\n#Princípio da lentidão\n\nOutra abordagem adotada pela equipe é o princípio da lentidão. Neste caso, não são as fotos que constituem o sinal de entrada, mas imagens em movimento: Se todas as características que mudam muito lentamente são extraídas de um vídeo, surgem estruturas que ajudam a construir uma representação abstrata do ambiente. \"Aqui, também, o objetivo é pré-estruturar os dados de entrada,\" destaca Wiskott.\n\nEventualmente, os pesquisadores combinam as duas abordagens de maneira modular com os métodos de aprendizado supervisionado, a fim de criar aplicativos mais flexíveis e, no entanto, muito mais precisos.\n\n\"Maior flexibilidade naturalmente resulta em perda de desempenho,\" admite o pesquisador. \"Mas, a longo prazo, a flexibilidade é indispensável se quisermos desenvolver robôs capazes de lidar com situações novas.\"\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=tornar-inteligencia-artificial-realmente-inteligente&id=010150191114",
				"added": 1573946630
			},
			{
				"comment_id": 3,
				"body": "#MIT 6.034 Inteligência Artificial, Outono 2010\nNestas palestras, o professor Patrick Winston apresenta o material 6.034 de uma perspectiva conceitual e abrangente. Os tópicos incluem raciocínio, pesquisa, restrições, aprendizado, representações, arquiteturas e inferência probabilística.\n- https://invidio.us/playlist?list=PLUl4u3cNGP63gFHB6xb-kVBiQHYe_4hSi",
				"added": 1573946823
			},
			{
				"comment_id": 4,
				"body": "#A história da Inteligência Artificial - TecMundo \n- https://invidio.us/Lhu8bdmkMCM",
				"added": 1573947229
			},
			{
				"comment_id": 5,
				"body": "#Machine Learning: como ensinar uma máquina a aprender | Nerdologia Tech\n- https://invidio.us/watch?v=mhe5e2B9bL8\n\n#Redes Neurais e Machine Learning | Nerdologia Tech\n- https://invidio.us/watch?v=1_c_MA1F-vU\n\n#Ultron e a revolução da inteligência artificial | Nerdologia\n- https://invidio.us/watch?v=CRy2g_-SqKY\n\n#Computadores têm alma? | Nerdologia\n- https://invidio.us/watch?v=mfIenNIAedw\n\n#Robôs vão tomar o seu emprego? Automatização do trabalho | Nerdologia Tech\n- https://invidio.us/watch?v=OEo14_iw7ho\n\n#Chatbots | Nerdologia Tech\n- https://invidio.us/watch?v=VhC_wAsw2-c\n\n#Singularidade humana e Ghost in the Shell | Nerdologia \n- https://invidio.us/watch?v=Bpas8YUlXTA",
				"added": 1573947375
			},
			{
				"comment_id": 6,
				"body": "#Discovery Brasil | Inteligência Artificial - IBM \n- https://invidio.us/W95YlM5-iPk",
				"added": 1573947442
			},
			{
				"comment_id": 7,
				"body": "#Inteligência Artificial e a singularidade tecnológica com Prof. Jose Tavares \n\nEntrevista com o Professor Jose Carlos Tavares ao programa Ciência em Movimento do dia 07 de fevereiro de 2017. Na pauta a Inteligência Artificial e projetos científicos na área de realidade aumentada, realidade virtual e inteligência computacional.\n\n- https://invidio.us/GekerL3tqOU",
				"added": 1573948079
			},
			{
				"comment_id": 12,
				"body": "#Singularidade tecnológica\nSingularidade tecnológica é a denominação dada a um evento histórico previsto para o futuro, no qual a humanidade atravessará um estágio de colossal avanço tecnológico em um curtíssimo espaço de tempo, quando a inteligência artificial terá superado a inteligência humana, alterando radicalmente a civilização e a natureza humana.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Technological_singularity.html",
				"added": 1573948510
			},
			{
				"comment_id": 13,
				"body": "#Tudo O Que Você Precisa Saber Sobre O AlphaZero\n- https://webcache.googleusercontent.com/search?q=cache:https://rafaelleitao.com/alphazero/\n\n#IA do Google derrota jogadores profissionais de StarCraft\nA inteligência artificial foi treinada com base em reprises de jogadas realizadas por humanos.\n- https://web.archive.org/web/20190205152248/https://tecnoblog.net/276587/ai-google-derrota-jogadores-starcraft/\n\n#Inteligência artificial derrota equipe de jogadores de Dota 2\n- https://web.archive.org/web/20180807112158/https://tecnoblog.net/254596/ia-derrota-jogadores-de-dota-2/\n\n#Inteligência artificial do Google derrota campeão mundial de Go e entra para a história\n- https://web.archive.org/web/20160603004334/https://gizmodo.uol.com.br/google-alphago-vence-torneio/\n- https://web.archive.org/web/20190514225625/https://brasil.elpais.com/brasil/2017/10/17/tecnologia/1508235763_015093.html\n\n#Inteligência artificial do Google aprende a jogar 49 videogames de Atari; veja-a em ação\n- https://web.archive.org/web/20160614115948/https://gizmodo.uol.com.br/video-inteligencia-artificial-google/\n\n#A máquina que vence os mestres do pôquer e na qual o Pentágono e o Facebook apostam\n- https://web.archive.org/web/20190713154710/https://brasil.elpais.com/brasil/2019/07/09/tecnologia/1562694287_387829.html",
				"added": 1573949645
			},
			{
				"comment_id": 14,
				"body": "#Estupidez artificial: o problema que ninguém anteviu\nFalhas na criação dos algoritmos impactam a vida de milhões de pessoas\n- https://web.archive.org/web/20190406205836/https://brasil.elpais.com/brasil/2018/11/15/ciencia/1542314780_296201.html",
				"added": 1573949744
			},
			{
				"comment_id": 15,
				"body": "#Máquinas espertas, mas sem bom senso\nOs computadores não aprendem como os humanos. Na verdade, apenas conseguem reconhecer padrões a partir de dados\n- https://webcache.googleusercontent.com/search?q=cache:https://brasil.elpais.com/brasil/2018/03/16/tecnologia/1521204836_317670.html",
				"added": 1573949805
			},
			{
				"comment_id": 16,
				"body": "#“Precisamos da inteligência artificial para sobreviver como espécie”\nSeis especialistas refletem sobre como voltar essa ferramenta para o nosso benefício\n- https://web.archive.org/web/20190404214057/https://brasil.elpais.com/brasil/2018/11/12/tecnologia/1542038734_872245.html",
				"added": 1573949887
			},
			{
				"comment_id": 18,
				"body": "#Por que a falta de diversidade é um obstáculo à inteligência artificial\nUma forma de minimizar os riscos da IA é aumentar a diversidade das equipes envolvidas em seu desenvolvimento\n\n- https://web.archive.org/web/20190914220106/https://brasil.elpais.com/brasil/2019/08/19/tecnologia/1566205434_091529.html",
				"added": 1573950018
			},
			{
				"comment_id": 19,
				"body": "#“Nossos engenheiros no Google não estudaram filosofia, temos que ajudá-los”\nÉtica e tecnologia devem estar mais juntas do que nunca, diz esta engenheira irlandesa. E essa é sua missão no Google: garantir que a inovação não seja sinônimo de transgressão\n\n- https://web.archive.org/web/20190203153804/https://brasil.elpais.com/brasil/2019/01/28/eps/1548684447_982945.html",
				"added": 1573950077
			},
			{
				"comment_id": 20,
				"body": "#Surgirá uma inteligência maior do que a humana?\nExiste um cenário no qual nem mesmo o aprendizado contínuo seria suficiente para garantir os postos de trabalho: o da singularidade tecnológica\n- https://web.archive.org/web/20190826030316/https://brasil.elpais.com/brasil/2019/07/29/tecnologia/1564354846_969018.html",
				"added": 1573950131
			},
			{
				"comment_id": 21,
				"body": "#Robôs com remorso?\nUma nova geração de autômatos será capaz de prever as consequências de suas ações\n\n\n- https://web.archive.org/web/20190826024131/https://brasil.elpais.com//brasil/2019/03/22/tecnologia/1553257793_329599.html",
				"added": 1573950246
			},
			{
				"comment_id": 22,
				"body": "#A era em que os robôs influenciam humanos\nAumentam no Instagram os seguidores de contas protagonizadas por humanoides\n\n- https://web.archive.org/web/20190408024720/https://brasil.elpais.com/brasil/2018/08/07/tecnologia/1533637654_599392.html",
				"added": 1573950329
			},
			{
				"comment_id": 23,
				"body": "#[Teste de Turing](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Turing_test.html)\n\nAlan Turing  (1912-1954) foi um matemático e cientista da computação, intitulado por muitos o ''pai da informática''.  Criou a  máquina de  Turing,  na qual  reformulou os  conceitos  sobre  algoritmos. Ficou   principalmente  conhecido  por  ter  trabalhado no  serviço  secreto  britânico  incumbido de desvendar e quebrar os códigos  alemães,  usando entre  outras técnicas,  o método  Bombe, uma máquina  electromecânica  de criptografia com motores, utilizada tanto para criptografar como para descriptografar mensagens  secretas,  usada  em várias formas na Europa a partir dos anos 1920). Após a guerra, trabalhou no Laboratório Nacional  de  Física  do  Reino Unido,  onde  criou um dos primeiros projectos para um computador de programa armazenado, o ACE.\n\nO teste de Turing    funciona da  seguinte forma:  um  interrogador  (humano) fará perguntas a duas entidades   ocultas;  uma delas  é um  humano e  outra é  um  computador.  A comunicação entre o interrogador e as entidades é feita de modo indirecto,  pelo teclado, por  exemplo. O interrogador tentará,  através do “diálogo“  realizado entre ele e as entidades, decidir qual dos dois é o humano. O computador será programado para se  passar por humano,  e o humano  responderá de  forma a confirmar  a sua  condição.  Se  no final do  teste  o interrogador  não  conseguir  distinguir quem é o   humano, então conclui-se que o computador pode pensar, segundo o teste de Turing.\n\n São feitas perguntas como: têm passatempos,  conseguem responder a uma pergunta geral sobre a configuração do xadrez? O problema foi: no teste de Turing, a fim de conseguir um bom resultado,  não se pode apenas concentrar em programação inteligente. É necessário focar-se em pontos como: não falar demasiado bem, os seres humanos não fazem isso. Cria-se uma espécie de erro e se perguntarem sobre a raiz quadrada de trinta e cinco, é melhor não ter uma resposta. Tenta-se assim imitar aspectos a que provavelmente não damos valor no ser humano.\n\n- Fonte: https://sites.google.com/site/inteligenciaartificialist/o-que-e-a-inteligencia-artificial/teste-de-turing",
				"added": 1573951218
			},
			{
				"comment_id": 24,
				"body": "> [voyager1](#comment_23_16rweQ3kpW62uqTDffBcUBLhg7GHvA6Agx): Teste de Turing\n> Alan Turing  (1912-1954) foi um matemático e cientista da computação, intitulado por muitos o ''pai da informática''.  Criou a  máquina de  Turing,  na qual  reformulou os  conceitos  sobre  algoritmos. Ficou   principalmente  conhecido  por  ter  trabalhado no  serviço  secreto  britânico  incumbido de desvendar e quebrar os códigos  alemães,  usando entre  outras técnicas,  o método  Bombe, uma máquina  electromecânica  de criptografia com motores, utilizada tanto para criptografar como para descriptografar mensagens  secretas,  usada  em várias formas na Europa a partir dos anos 1920). Após a guerra, trabalhou no Laboratório Nacional  de  Física  do  Reino Unido,  onde  criou um dos primeiros projectos para um computador de programa armazenado, o ACE.\n> O teste de Turing    funciona da  seguinte forma:  um  interrogador  (humano) fará perguntas a duas entidades   ocultas;  uma delas  é um  humano e  outra é  um  computador.  A comunicação entre o interrogador e as entidades é feita de modo indirecto,  pelo teclado, por  exemplo. O interrogador tentará,  através do “diálogo“  realizado entre ele e as entidades, decidir qual dos dois é o humano. O computador será programado para se  passar por humano,  e o humano  responderá de  forma a confirmar  a sua  condição.  Se  no final do  teste  o interrogador  não  conseguir  distinguir quem é o   humano, então conclui-se que o computador pode pensar, segundo o teste de Turing.\n>  São feitas perguntas como: têm passatempos,  conseguem responder a uma pergunta geral sobre a configuração do xadrez? O problema foi: no teste de Turing, a fim de conseguir um bom resultado,  não se pode apenas concentrar em programação inteligente. É necessário focar-se em pontos como: não falar demasiado bem, os seres humanos não fazem isso. Cria-se uma espécie de erro e se perguntarem sobre a raiz quadrada de trinta e cinco, é melhor não ter uma resposta. Tenta-se assim imitar aspectos a que provavelmente não damos valor no ser humano.\n> \n> Fonte: https://sites.google.com/site/inteligenciaartificialist/o-que-e-a-inteligencia-artificial/teste-de-turing\n\n#Com o  avanço  da  tecnologia, em  2012, numa  competição em  honra  do centenário de Alan Turing, uma máquina conseguiu o feito de ser aprovada no teste de Turing. Segue o link da notícia: \n- https://web.archive.org/web/20170408001942/http://tecnologia.terra.com.br/robos/robo-confunde-humanos-e-passa-no-teste-de-turing-pela-1-vez,95188947c52ea310VgnCLD200000bbcceb0aRCRD.html",
				"added": 1573951398
			}
		],
		"4_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": [
			{
				"comment_id": 8,
				"body": "#Xadrez - As melhores partidas\n- https://invidio.us/playlist?list=PLQOUppER7ZJFgrkBiuKBTtyTkD8vwhGEe",
				"added": 1573948254
			},
			{
				"comment_id": 9,
				"body": "#Curso Completo de FINAIS\n- https://invidio.us/playlist?list=PLQOUppER7ZJFAgurkWufa0tO9E-LELiCq",
				"added": 1573948310
			},
			{
				"comment_id": 10,
				"body": "#Partidas de Mikhail Tal\nMikhail Nekhemievich Tal, Riga, 9 de novembro de 1936 — Moscou, 28 de junho de 1992 foi um enxadrista soviético conhecido pelo seu estilo agressivo de jogo, tendo sido o oitavo Campeão Mundial de Xadrez, de 1960 a 1961.\n\n- https://invidio.us/playlist?list=PLQOUppER7ZJFJv3hOwP2LP9ZBQPdXpizI",
				"added": 1573948350
			},
			{
				"comment_id": 11,
				"body": "#ZeroStockfishChess\n- https://github.com/vtr0n/ZeroStockfishChess.git",
				"added": 1573948386
			}
		]
	},
	"comment_vote": {}
}