{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Questions by Amateur Enthusiasts",
			"body": "There’re some other question. \nIs there any Forum Site on Zeronet that allows to upload .RAR file easiy? \n\n**The Unlimited Talk,**\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/ \nI don’t know how to upload files, either image file or RAR file not allowed. \n\nAnother site (Liberate HongKong):\nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/ \nImage files can be uploaded. But RAR files are not allowed. \n\nAs the Liberate HongKong site is run by some Christian associates, so if the functions to add RAR file can be added easily onto the site, I’d learn to settle this issue then. \n\nSo the question is \n**How to add functions that allow \nRAR file upload on a forum site ?  **\n\nIf there’re many steps, it’d be better that there’s already a site that has such functions, then I can learn directly on that site, so as to reduce the frequencies of some silly questions. \n\nThe goal to add the new functions is simple, as shown in the below url (in Chinese, the general is message that quite many Chinese people like to get some softwares to circumvent the GFW)  \nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:3_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/+V2Ray+ShadowSocks+Psiphon \nThose softwares often launch updated versions every few months. \nSo to add the functions of uploading .RAR files will help solve it.\n\n",
			"added": 1598259088
		},
		{
			"topic_id": 2,
			"title": "Communist China and the Free World’s Future",
			"body": "Remarks at the Richard Nixon Presidential Library and Museum:\nGOVERNOR WILSON:  Well, thank you very much, Chris.  Most generous.  I’m not sure your grandfather would have recognized me. \n\nI have the great pleasure – in addition to welcoming all of you to the Nixon birthplace and library, I have the great pleasure of introducing to you an extraordinary American who is here at an extraordinary time.  But the fun of it is in introducing our honored guest, I also am welcoming him not just to the Nixon Library, but I’m welcoming him back home to Orange County.  (Applause.)  That’s right.  Mike Pompeo was born in Orange.  (Applause.)\n\nHe attended Los Amigos High School in Fountain Valley, where he was an outstanding student and athlete.  In fact, I have it on good authority that among the fans of glory days of Lobo basketball, a reverent hush descends upon the crowd whenever the name “Pompeo” is mentioned.  (Laughter.)\n\nThe Secretary was first in his class at West Point.  He won the award as the most distinguished cadet.  He won another award for the highest achievement in engineering management.  He spent his active duty years, his Army years, in West Germany, and as he put it, **patrolling the Iron Curtain before the fall of the Berlin Wall. **\n\nIn 1988 – excuse me – retiring with a rank of captain, he went on to Harvard Law School, where he was an editor of the Law Review.  In 1988, he returned to his mother’s home state of Kansas and began a stunningly successful business career.  He was elected to the House of Representatives from Kansas in 2011, where he soon gained great respect for a reputation as one of the most diligent and astute members of the House Arms – excuse me, the House Intelligence Committee.\n\nIn 2017, President Trump nominated him to be the director of Central Intelligence.  And in 2018, he was confirmed as our 70th Secretary of State.\n\nYou have to admit, that’s quite an impressive resume.  So it’s sad there’s only one thing missing, prevents it from being perfect.  If only Mike had been a Marine.  (Laughter.)  Don’t worry, he’ll get even.\n\nMike Pompeo is a man devoted to his family.  He is a man of faith, of the greatest patriotism and the highest principle.  One of his most important initiatives at the State Department has been the creation of a Commission on Unalienable Rights where academicians, philosophers, and ethicists advise him on human rights grounded in America’s founding principles and the principles of the 1948 Universal Declaration of Rights.\n\nHe is here today for a very special reason.  The epitaph on President Nixon’s gravestone is a sentence from his first inaugural address.  It says, quote, “The greatest honor history can bestow is the title of peacemaker.”  Richard Nixon received that title.  He won that honor not only because he was acknowledged even by his critics to be a brilliant foreign policy strategist, but it was far more because he earned it.  He learned as congressman, senator, president, and every day thereafter as a private citizen ambassador that peace is not achieved by signing documents and declaring the job done.  To the contrary, he knew that peace is always a work in progress.  He knew that peace must be fought for and won anew in every generation.\n\nIt was President Nixon’s vision, determination, and courage that opened China to America and to the Western world.  As president and for the rest of his life, Richard Nixon worked to build a relationship with China based upon mutual benefits and obligations that respected America’s bedrock national interests.\n\nToday, we in America are obliged to assess whether or not President Nixon’s labors and his hopes for such a relationship have been met or whether they are being undermined.\n\nThat is why it is of such great significance that our honored guest, Secretary Pompeo, has chosen the Nixon Library from which to deliver a major China policy statement.  It will, I promise you, be a statement of complete clarity delivered with force and with belief because it is of critical importance.\n\nLadies and gentlemen, it is my great honor and pleasure to welcome to this podium and to this audience our honored guest, the Secretary of State of the United States of America, the honorable and really quite remarkable – honorable Michael R. Pompeo.  (Applause.)\n\nSECRETARY POMPEO:  Thank you.  Thank you all.  Thank you, Governor, for that very, very generous introduction.  It is true:  When you walk in that gym and you say the name “Pompeo,” there is a whisper.  I had a brother, Mark, who was really good – a really good basketball player.\n\nAnd how about another round of applause for the Blue Eagles Honor Guard and Senior Airman Kayla Highsmith, and her wonderful rendition of the national anthem?  (Applause.)\n\nThank you, too, to Pastor Laurie for that moving prayer, and I want to thank Hugh Hewitt and the Nixon Foundation for your invitation to speak at this important American institution.  It was great to be sung to by an Air Force person, introduced by a Marine, and they let the Army guy in in front of the Navy guy’s house.  (Laughter.)  It’s all good.\n\nIt’s an honor to be here in Yorba Linda, where Nixon’s father built the house in which he was born and raised.\n\nTo all the Nixon Center board and staff who made today possible – it’s difficult in these times – thanks for making this day possible for me and for my team.\n\nWe are blessed to have some incredibly special people in the audience, including Chris, who I’ve gotten to know – Chris Nixon.  I also want to thank Tricia Nixon and Julie Nixon Eisenhower for their support of this visit as well.\n\nI want to recognize several courageous Chinese dissidents who have joined us here today and made a long trip.\n\nAnd to all the other distinguished guests – (applause) – to all the other distinguished guests, thank you for being here.  For those of you who got under the tent, you must have paid extra.\n\nAnd those of you watching live, thank you for tuning in.\n\nAnd finally, as the governor mentioned, I was born here in Santa Ana, not very far from here.  I’ve got my sister and her husband in the audience today.  Thank you all for coming out.  I bet you never thought that I’d be standing up here.\n\nMy remarks today are the fourth set of remarks in a series of China speeches that I asked National Security Advisor Robert O’Brien, FBI Director Chris Wray, and the Attorney General Barr to deliver alongside me.\n\nWe had a very clear purpose, a real mission.  It was to explain the different facets of America’s relationship with China, the massive imbalances in that relationship that have built up over decades, and the Chinese Communist Party’s designs for hegemony.\n\nOur goal was to make clear that the threats to Americans that President Trump’s China policy aims to address are clear and our strategy for securing those freedoms established.\n\nAmbassador O’Brien spoke about ideology.  FBI Director Wray talked about espionage. Attorney General Barr spoke about economics.  And now my goal today is to put it all together for the American people and detail what the China threat means for our economy, for our liberty, and indeed for the future of free democracies around the world.\n\nNext year marks half a century since Dr. Kissinger’s secret mission to China, and the 50th anniversary of President Nixon’s trip isn’t too far away in 2022.\n\nThe world was much different then.\n\nWe imagined engagement with China would produce a future with bright promise of comity and cooperation.\n\nBut today – today we’re all still wearing masks and watching \n###the pandemic’s body count rise because the CCP failed in its promises to the world.  \nWe’re reading every morning new headlines of repression in Hong Kong and in Xinjiang.\n\nWe’re seeing staggering statistics of Chinese trade abuses that cost American jobs and strike enormous blows to the economies all across America, including here in southern California.  And we’re watching a Chinese military that grows stronger and stronger, and indeed more menacing.\n\nI’ll echo the questions ringing in the hearts and minds of Americans from here in California to my home state of Kansas and beyond:\n\nWhat do the American people have to show now 50 years on from engagement with China? \n\nDid the theories of our leaders that proposed a Chinese evolution towards freedom and democracy prove to be true?\n\nIs this China’s definition of a win-win situation? \n\nAnd indeed, centrally, from the Secretary of State’s perspective, is America safer?  Do we have a greater likelihood of peace for ourselves and peace for the generations which will follow us?\n\nLook, we have to admit a hard truth.  We must admit a hard truth that should guide us in the years and decades to come, that if we want to have a free 21st century, and not the Chinese century of which Xi Jinping dreams, the old paradigm of blind engagement with China simply won’t get it done.  We must not continue it and we must not return to it. \n\nAs President Trump has made very clear, we need a strategy that protects the American economy, and indeed our way of life.  The free world must triumph over this new tyranny.\n\nNow, before I seem too eager to tear down President Nixon’s legacy, I want to be clear that he did what he believed was best for the American people at the time, and he may well have been right.\n\nHe was a brilliant student of China, a fierce cold warrior, and a tremendous admirer of the Chinese people, just as I think we all are. \n\nHe deserves enormous credit for realizing that China was too important to be ignored, even when the nation was weakened because of its own self-inflicted communist brutality.\n\nIn 1967, in a very famous Foreign Affairs article, Nixon explained his future strategy.  Here’s what he said:\n\nHe said, “Taking the long view, we simply cannot afford to leave China forever outside of the family of nations…The world cannot be safe until China changes.  Thus, our aim – to the extent we can, we must influence events.  Our goal should be to induce change.”\n\nAnd I think that’s the key phrase from the entire article: “to induce change.”\n\nSo, with that historic trip to Beijing, President Nixon kicked off our engagement strategy.  He nobly sought a freer and safer world, and he hoped that the Chinese Communist Party would return that commitment. \n\nAs time went on, American policymakers increasingly presumed that as China became more prosperous, it would open up, it would become freer at home, and indeed present less of a threat abroad, it’d be friendlier.  It all seemed, I am sure, so inevitable.\n\nBut that age of inevitability is over.  The kind of engagement we have been pursuing has not brought the kind of change inside of China that President Nixon had hoped to induce.\n\nThe truth is that our policies – and those of other free nations – resurrected China’s failing economy, only to see Beijing bite the international hands that were feeding it.\n\nWe opened our arms to Chinese citizens, only to see the Chinese Communist Party exploit our free and open society.  China sent propagandists into our press conferences, our research centers, our high-schools, our colleges, and even into our PTA meetings.\n\nWe marginalized our friends in Taiwan, which later blossomed into a vigorous democracy.\n\nWe gave the Chinese Communist Party and the regime itself special economic treatment, only to see the CCP insist on silence over its human rights abuses as the price of admission for Western companies entering China.\n\nAmbassador O’Brien ticked off a few examples just the other day: Marriott, American Airlines, Delta, United all removed references to Taiwan from their corporate websites, so as not to anger Beijing.\n\nIn Hollywood, not too far from here – the epicenter of American creative freedom, and self-appointed arbiters of social justice – self-censors even the most mildly unfavorable reference to China.\n\nThis corporate acquiescence to the CCP happens all over the world, too.\n\nAnd how has this corporate fealty worked?  Is its flattery rewarded?  I’ll give you a quote from the speech that General Barr gave, Attorney General Barr.  In a speech last week, he said that “The ultimate ambition of China’s rulers isn’t to trade with the United States.  It is to raid the United States.”\n\nChina ripped off our prized intellectual property and trade secrets, causing millions of jobs[1] all across America.  \n\nIt sucked supply chains away from America, and then added a widget made of slave labor.\n\nIt made the world’s key waterways less safe for international commerce.\n\nPresident Nixon once said he feared he had created a “Frankenstein” by opening the world to the CCP, and here we are.\n\nNow, people of good faith can debate why free nations allowed these bad things to happen for all these years.  Perhaps we were naive about China’s virulent strain of communism, or triumphalist after our victory in the Cold War, or cravenly capitalist, or hoodwinked by Beijing’s talk of a “peaceful rise.”\n\nWhatever the reason – whatever the reason, today China is increasingly authoritarian at home, and more aggressive in its hostility to freedom everywhere else.\n\nAnd President Trump has said: enough.\n\nI don’t think many people on either side of the aisle dispute the facts that I have laid out today.  But even now, some are insisting that we preserve the model of dialogue for dialogue’s sake.\n\nNow, to be clear, we’ll keep on talking.  But the conversations are different these days.  I traveled to Honolulu now just a few weeks back to meet with Yang Jiechi.\n\nIt was the same old story – plenty of words, but literally no offer to change any of the behaviors.\n\nYang’s promises, like so many the CCP made before him, were empty.  His expectations, I surmise, were that I’d cave to their demands, because frankly this is what too many prior administrations have done.  I didn’t, and President Trump will not either. \n\nAs Ambassador O’Brien explained so well, we have to keep in mind that the CCP regime is a Marxist-Leninist regime.  General Secretary Xi Jinping is a true believer in a bankrupt totalitarian ideology. \n\nIt’s this ideology, it’s this ideology that informs his decades-long desire for global hegemony of Chinese communism.  America can no longer ignore the fundamental political and ideological differences between our countries, just as the CCP has never ignored them. \n\nMy experience in the House Intelligence Committee, and then as director of the Central Intelligence Agency, and my now two-plus years as America’s Secretary of State have led me to this central understanding:\n\nThat the only way – the only way to truly change communist China is to act not on the basis of what Chinese leaders say, but how they behave.  And you can see American policy responding to this conclusion.  President Reagan said that he dealt with the Soviet Union on the basis of “trust but verify.”  When it comes to the CCP, I say we must distrust and verify.  (Applause.)\n\nWe, the freedom-loving nations of the world, must induce China to change, just as President Nixon wanted.  We must induce China to change in more creative and assertive ways, because Beijing’s actions threaten our people and our prosperity.\n\nWe must start by changing how our people and our partners perceive the Chinese Communist Party.  We have to tell the truth.  We can’t treat this incarnation of China as a normal country, just like any other. \n\nWe know that trading with China is not like trading with a normal, law-abiding nation.  Beijing threatens international agreements as – treats international suggestions as – or agreements as suggestions, as conduits for global dominance. \n\nBut by insisting on fair terms, as our trade representative did when he secured our phase one trade deal, we can force China to reckon with its intellectual property theft and policies that harmed American workers.\n\nWe know too that doing business with a CCP-backed company is not the same as doing business with, say, a Canadian company.  They don’t answer to independent boards, and many of them are state-sponsored and so have no need to pursue profits. \n\nA good example is Huawei.  We stopped pretending Huawei is an innocent telecommunications company that’s just showing up to make sure you can talk to your friends.  We’ve called it what it is – a true national security threat – and we’ve taken action accordingly.\n\nWe know too that if our companies invest in China, **they may wittingly or unwittingly support the Communist Party’s gross human rights violations**. \n\nOur Departments of Treasury and Commerce have thus sanctioned and blacklisted Chinese leaders and entities that are harming and abusing the most basic rights for people all across the world.  Several agencies have worked together on a business advisory to make certain our CEOs are informed of how their supply chains are behaving inside of China. \n\nWe know too, we know too that not all Chinese students and employees are just normal students and workers that are coming here to make a little bit of money and to garner themselves some knowledge.  Too many of them come here to steal our intellectual property and to take this back to their country. \n\nThe Department of Justice and other agencies have vigorously pursued punishment for these crimes.\n\nWe know that the People’s Liberation Army is not a normal army, too.  Its purpose is to uphold the absolute rule of the Chinese Communist Party elites and expand a Chinese empire, not to protect the Chinese people. \n\nAnd so our Department of Defense has ramped up its efforts, freedom of navigation operations out and throughout the East and South China Seas, and in the Taiwan Strait as well.  And we’ve created a Space Force to help deter China from aggression on that final frontier. \n\nAnd so too, frankly, we’ve built out a new set of policies at the State Department dealing with China, pushing President Trump’s goals for fairness and reciprocity, to rewrite the imbalances that have grown over decades. \n\nJust this week, we announced the closure of the Chinese consulate in Houston because it was a hub of spying and intellectual property theft.  (Applause.)\n\nWe reversed, two weeks ago, eight years of cheek-turning with respect to international law in the South China Sea.\n\nWe’ve called on China to conform its nuclear capabilities to the strategic realities of our time. \n\nAnd the State Department – at every level, all across the world – has engaged with our Chinese counterparts simply to demand fairness and reciprocity. \n\nBut our approach can’t just be about getting tough.  That’s unlikely to achieve the outcome that we desire.  We must also engage and empower the Chinese people – a dynamic, freedom-loving people who are completely distinct from the Chinese Communist Party. \n\nThat begins with in-person diplomacy.  (Applause.)  I’ve met Chinese men and women of great talent and diligence wherever I go. \n\nI’ve met with Uyghurs and ethnic Kazakhs who escaped Xinjiang’s concentration camps.  I’ve talked with Hong Kong’s democracy leaders, from Cardinal Zen to Jimmy Lai.  Two days ago in London, I met with Hong Kong freedom fighter Nathan Law. \n\nAnd last month in my office, I heard the stories of Tiananmen Square survivors.  One of them is here today. \n\nWang Dan was a key student who has never stopped fighting for freedom for the Chinese people.  Mr. Wang, will you please stand so that we may recognize you?  (Applause.)\n\nAlso with us today is the father of the Chinese democracy movement, Wei Jingsheng.  He spent decades in Chinese labor camps for his advocacy.  Mr. Wei, will you please stand?  (Applause.)\n\nI grew up and served my time in the Army during the Cold War.  And if there is one thing I learned, communists almost always lie.  The biggest lie that they tell is to think that they speak for 1.4 billion people who are surveilled, oppressed, and scared to speak out. \n\nQuite the contrary.  The CCP fears the Chinese people’s honest opinions more than any foe, and save for losing their own grip on power, they have reason – no reason to.\n\nJust think how much better off the world would be – not to mention the people inside of China – if we had been able to hear from the doctors in Wuhan and they’d been allowed to raise the alarm about the outbreak of a new and novel virus.\n\nFor too many decades, our leaders have ignored, downplayed the words of brave Chinese dissidents who warned us about the nature of the regime we’re facing.\n\nAnd we can’t ignore it any longer.  They know as well as anyone that we can never go back to the status quo.\n\n###**But changing the CCP’s behavior cannot be the mission of the Chinese people alone.**\n  Free nations have to work to defend freedom.  It’s the furthest thing from easy.  \n\nBut I have faith we can do it.  I have faith because we’ve done it before.  We know how this goes.\n\nI have faith because the CCP is repeating some of the same mistakes that the Soviet Union made – alienating potential allies, breaking trust at home and abroad, rejecting property rights and predictable rule of law.\n\nI have faith.  I have faith because of the awakening I see among other nations that know we can’t go back to the past in the same way that we do here in America.  I’ve heard this from Brussels, to Sydney, to Hanoi.\n\nAnd most of all, I have faith we can defend freedom because of the sweet appeal of freedom itself.\n\nLook at the Hong Kongers clamoring to emigrate abroad as the CCP tightens its grip on that proud city.  They wave American flags.\n\nIt’s true, there are differences.  Unlike the Soviet Union, China is deeply integrated into the global economy.  But Beijing is more dependent on us than we are on them.  (Applause.)\n\nLook, I reject the notion that we’re living in an age of inevitability, that some trap is pre-ordained, that CCP supremacy is the future.  Our approach isn’t destined to fail because America is in decline.  As I said in Munich earlier this year, the free world is still winning.  We just need to believe it and know it and be proud of it.  People from all over the world still want to come to open societies.  They come here to study, they come here to work, they come here to build a life for their families.  They’re not desperate to settle in China.\n\nIt’s time.  It’s great to be here today.  The timing is perfect.  It’s time for free nations to act.  Not every nation will approach China in the same way, nor should they.  Every nation will have to come to its own understanding of how to protect its own sovereignty, how to protect its own economic prosperity, and how to protect its ideals from the tentacles of the Chinese Communist Party.\n\nBut I call on every leader of every nation to start by doing what America has done – to simply insist on reciprocity, to insist on transparency and accountability from the Chinese Communist Party.  It’s a cadre of rulers that are far from homogeneous.\n\nAnd these simple and powerful standards will achieve a great deal.  For too long we let the CCP set the terms of engagement, but no longer.  Free nations must set the tone.  We must operate on the same principles.\n\nWe have to draw common lines in the sand that cannot be washed away by the CCP’s bargains or their blandishments.  Indeed, this is what the United States did recently when we rejected China’s unlawful claims in the South China Sea once and for all, as we have urged countries to become Clean Countries so that their citizens’ private information doesn’t end up in the hand of the Chinese Communist Party.  We did it by setting standards.\n\nNow, it’s true, it’s difficult.  It’s difficult for some small countries.  They fear being picked off.  Some of them for that reason simply don’t have the ability, the courage to stand with us for the moment.\n\nIndeed, we have a NATO ally of ours that hasn’t stood up in the way that it needs to with respect to Hong Kong because they fear Beijing will restrict access to China’s market.  This is the kind of timidity that will lead to historic failure, and we can’t repeat it.\n\nWe cannot repeat the mistakes of these past years.  The challenge of China demands exertion, energy from democracies – those in Europe, those in Africa, those in South America, and especially those in the Indo-Pacific region.\n\nAnd if we don’t act now, ultimately the CCP will erode our freedoms and subvert the rules-based order that our societies have worked so hard to build.  If we bend the knee now, our children’s children may be at the mercy of the Chinese Communist Party, whose actions are the primary challenge today in the free world.\n\nGeneral Secretary Xi is not destined to tyrannize inside and outside of China forever, unless we allow it.\n\nNow, this isn’t about containment.  Don’t buy that.  It’s about a complex new challenge that we’ve never faced before.  The USSR was closed off from the free world.  Communist China is already within our borders.\n\nSo we can’t face this challenge alone.  The United Nations, NATO, the G7 countries, the G20, our combined economic, diplomatic, and military power is surely enough to meet this challenge if we direct it clearly and with great courage.\n\nMaybe it’s time for a new grouping of like-minded nations, a new alliance of democracies.\n\nWe have the tools.  I know we can do it.  Now we need the will.  To quote scripture, I ask is “our spirit willing but our flesh weak?”\n\nIf the free world doesn’t change – doesn’t change, communist China will surely change us.  There can’t be a return to the past practices because they’re comfortable or because they’re convenient.\n\nSecuring our freedoms from the Chinese Communist Party is the mission of our time, and America is perfectly positioned to lead it because our founding principles give us that opportunity. \n\nAs I explained in Philadelphia last week, standing, staring at Independence Hall, our nation was founded on the premise that all human beings possess certain rights that are unalienable.\n\nAnd it’s our government’s job to secure those rights.  It is a simple and powerful truth.  It’s made us a beacon of freedom for people all around the world, including people inside of China.\n\nIndeed, Richard Nixon was right when he wrote in 1967 that “the world cannot be safe until China changes.”  Now it’s up to us to heed his words. \n\n###Today the danger is clear.\n\nAnd today the awakening is happening.\n\nToday the free world must respond.\n\nWe can never go back to the past.\n\nMay God bless each of you.\n\nMay God bless the Chinese people.\n\nAnd may God bless the people of the United States of America.\n\nThank you all.\n\n(Applause.)\n\n###Dialogue Section\nMR HEWITT:  Thank you, Mr. Secretary.  Please be seated.  I’m Hugh Hewitt, the president of the library, and Secretary Pompeo graciously invited some questions as I was listening.  Thank you for joining us, Mr. Secretary, at the Nixon Library.\n\nMy first question has to do with the context of the president’s visit in 1972.  You mentioned the Soviet Union was isolated, but it was dangerous.  He went to the People’s Republic of China in 1972 to try and ally and combine interests with them against the Soviet Union; it was successful.\n\nDoes Russia present an opportunity now to the United States to coax them into the battle to be relentlessly candid about the Chinese Communist Party?\n\nSECRETARY POMPEO:  So I do think there’s that opportunity.  That opportunity is born of the relationship, the natural relationship between Russia and China, and we can do something as well.  There are places where we need to work with Russia.  Today – or tomorrow, I guess it is, our teams will be on the ground with the Russians working on a strategic dialogue to hopefully create the next generation of arms control agreements like Reagan did.  It’s in our interest, it’s in Russia’s interest.  We’ve asked the Chinese to participate.  They’ve declined to date.  We hope they’ll change their mind.\n\nIt’s these kind of things – these proliferation issues, these big strategic challenges – that if we work alongside Russia, I’m convinced we can make the world safer.  And so there – I think there is a place for us to work with the Russians to achieve a more likely outcome of peace not only for the United States but for the world.\n\nMR HEWITT:  President Nixon also put quite a lot of store in personal relationships over many years with individuals.  That can lead wrong.  President Bush famously misjudged Vladimir Putin and said so afterwards.  You have met President Xi often.  Is the general secretary of the Chinese Communist Party someone with whom we can deal on a transparent and reliable basis, in your opinion, based on your personal diplomacy with him?\n\nSECRETARY POMPEO:  So the meetings that I’ve had and the meeting that the President – we’ve had – they’ve been good, frank conversations.  He is the most powerful leader of China since Mao.  He has also in many ways deinstitutionalized the Chinese Communist Party, thus giving him even more capacity and more power. \n\nBut Hugh, I think the way to think about it is how I spoke about this today:  It’s about actions.  And so how one evaluates one’s counterparts sitting across the table from them – it’s important to think about how you can find common understandings and make progress.  But in the end, it’s not about what someone says or the agreement that they sign, but are they prepared to lead, to do the things that they committed to?  Are they prepared to fulfill their promises? \n\nAnd we’ve watched – we’ve watched this China walk away from their promises to the world on Hong Kong, we watched their – General Secretary Xi promised President Obama in the Rose Garden in 2015 that he wouldn’t militarize the South China Sea.  And Google the South China Sea and arms; you’ll see another promise broken. \n\nSo in the end, from my perspective, it’s much more important to watch how leaders behave and how they lead than what it is you think when you have a chance to talk to them on the phone or meet them in person.\n\nMR HEWITT:  Mr. Secretary, you said this is not containment.  I heard that very clearly.  I have read the three previous speeches by Ambassador O’Brien, Director Wray, Attorney General Barr, and now listened to you very closely.  It isn’t containment, but it is a fairly comprehensive, multidimensional, relentlessly objective candor.  Is that dangerous in a world that’s not used to speaking clearly about delicate subjects?\n\nSECRETARY POMPEO:  My experience, and I think President Trump’s experience too in his life as a businessman, is the best policy is always true candor, identifying the places that you have a redline, identifying places that you have a real interest, making clear if there’s places where you don’t, and there’s things that you can work on alongside each other. \n\nI think the real danger comes from misunderstandings and miscommunication and the failure to be honest about the things that matter to you, because others will move into that space and then conflict arises.  I think the world is a heck of a lot safer when you have leaders who are prepared to be honest about the things that matter and prepared to talk about the things their nation is prepared to do to secure those interests.  And you can reduce risk by these conversations so long as you’re honest about it. \n\nSo I – no, I don’t think it’s dangerous.  I think it’s just the opposite of that.\n\nMR HEWITT:  You also said – and I’m sure the speech will be known as the “distrust but verify” speech – when you distrust but verify, that still premises verification is possible.  It is still possible to do agreements and to verify them; correct?\n\nSECRETARY POMPEO:  It is, yeah, you can still do it.  Each nation’s got to be prepared for a certain amount of intrusiveness connected to that.  And it is not in the nature of communist regimes to allow transparency inside of their country.  And so it’s been done before.  We’ve had – we had arms control agreements with the Soviet Union that we got verification that was sufficient to ensure that we protected American interests.  I believe we can do it again.  I hope that we can do this on these – I mean, the Chinese Communist Party has several hundred nuclear warheads.  This is a serious global power.  And to the extent we can find common ground, a common set of understandings to reduce risk that there’s ever a really bad day for the world, we ought to do it, and it’s going to require agreement and verification.\n\nMR HEWITT:  Ambassador Richard Haass, who is now chairman of the Council on Foreign Relations, said very recently – it may have been yesterday, it might have been this morning; I saw it this morning preparing – quote, “Secretary Pompeo doesn’t speak of China but of the Chinese Communist Party as if there were a China apart from the party.  This is meant to antagonize and make diplomacy impossible.  Quite a stance for America’s chief diplomat to take unless his goal is to ensure diplomacy fails.”  Is that your goal?\n\nSECRETARY POMPEO:  (Laughter.)  Ah, goodness.  Hard to begin.  Here’s where I’ll begin:  It’s a bit patronizing to the people of China to make such an assertion that they are not free-thinking beings, that they’re not rational people who were given – I mean, they too were made in the image of God, right.  They have all the capacity that anybody in the world does.  So to somehow think that we ought to ignore the voices of the people of China seems to me the wrong approach.  It is true the Chinese Communist Party is a one-party rule.  And so we will deal with the Chinese Communist Party as the head of state for China, and we need to, and we need to engage in dialogue.  But it seems to me we would dishonor ourselves and the people of China if we ignored them.\n\nMR HEWITT:  Now, Ambassador O’Brien, whose speech you referenced, put heavy emphasis on the ideology of Marxist-Leninism.  It was almost quaint to hear that conversation again; it’s gone from our vocabulary.  Does the American people, and especially American media, need to reacquaint itself with what Marxist-Leninists believe, because the CCP genuinely does believe it?\n\nSECRETARY POMPEO:  I always get in trouble, Hugh, when I comment on the media.  So I’ll say this much:  For those of us who have lived and seen and observed, there are other Marxist-Leninist nations today as well – and have seen – they believe – they have an understanding, a central understanding of how people interact and how societies ought to interact.  And it is certainly the case today that the leadership in China believes that. \n\nWe should acknowledge that, and we should make sure that we don’t for a moment think that they don’t believe it.  It’s what Ambassador O’Brien’s speech was about.  It was the fact – it was acknowledging that they believe it and recognizing that we have to respond in a way that reflects our understanding of the way they view the world.\n\nMR HEWITT:  Let’s not talk about the American media.  I want to talk about the Chinese media for a moment.  They are aggressive, to say the least, and right now they are aggressively defending, for example, TikTok.  A small question within a large question:  Is TikTok capable of being weaponized?  Is that an example of what’s going on?  And generally, Chinese media has become far more aggressive than I’ve seen in 30 years since I was at the library the first time of watching it.  Is that something you’ve noticed as well?\n\nSECRETARY POMPEO:  Yes, they’re very aggressive.  Two pieces to this, one you hit upon.  One is I’ll describe as their technology medium.  Without singling out any particular business, our view of these companies is we’re neither for or against the company; we’re about making sure that we protect the information that belongs to each of you – your health records, your face if it’s a facial recognition software, your address.  All the things that you care that you want to make sure the Chinese Communist Party doesn’t have, we have a responsibility to make sure that the systems that you’re using don’t give them access to that.  And so whether it’s the efforts we’ve made against Huawei or the work that we’re doing on other software firms, the American task is to protect the American people and their information.\n\nThe second piece of this has to do with their – what I’ll call the state-sponsored media of China and their disinformation.  You should know – and this is where I am concerned about the American media, too – these are state-sponsored media organizations that take their messaging from the Chinese Communist Party each day.  \n###When American institutions pick up those storylines and carry them forward, they are, in fact, propagating Chinese propaganda, and we all ought to be wise to that. \n\nThere was an editorial in The New York Times yesterday by someone who had a clear view that was antithetical to the American way of life.  The New York Times ran it straight-up without comment, forwarding – although albeit in the opinion section, but propagating Chinese propaganda.  That is certainly not instructive when they’re telling senators from Arkansas they can’t simply talk about America and American freedom in that same media outlet.\n\nMR HEWITT:  You mentioned that a lot of corporate America – and you mentioned specifically Hollywood – have got deep intertwinement with the Chinese economy.  So I don’t want to talk about soft power; I want to talk about soft appeasement.  One of my favorite sports figures, LeBron James, falls silent when China comes up.  In the new Top Gun movie, the Taiwan and Japanese patches are taken off Maverick’s jacket.  They’re not going to be in Top Gun 2; they were in Top Gun 1.  What do you say not to those individuals, but to everyone who has an American spotlight about their responsibility to be candid about the People’s Republic of China?\n\nSECRETARY POMPEO:  Here’s our ask:  Our ask is if you claim that you care about human rights or social justice or these things, if you make that part of your corporate theology, then you ought to be consistent.  And you can’t be consistent if you’re operating there in China without talking about and acknowledging what the Chinese Communist Party is doing in certain parts of their country – the oppression that’s taking place.  Look, every business leader has got to make decisions for themselves.  They’ve got to be able to live with the decisions that they make.  You highlighted a few. \n\nI’d simply ask this:  If you run an entity and the United States Government were to tell you you couldn’t do something, put a particular symbol in your movie or put a particular name on your menu – if we were to tell you that, you’d say nope, that’s not appropriate, and it, of course, would not be appropriate.  It seems to me that if you permit the Chinese Communist Party to limit you in that way, it’s got to be difficult for you to go home at night.\n\nMR HEWITT:  Two more questions, Mr. Secretary.  (Applause.)  Because it is hot and it is warm, and everyone out here has been in the sun for a while.  You’re a West Point graduate, and as Governor Wilson noted, number one, so this might be tough for you.  But we are an, like Athens was, a naval power.  America is a naval power.  And as like Sparta is, China is a land power.  Do we not have to change how we approach defense spending to put more emphasis on our naval resources than on our Army resources?\n\nSECRETARY POMPEO:  Oh, that’s tough for an Army guy to say.  (Laughter.)\n\nMR HEWITT:  I know.\n\nSECRETARY POMPEO:  You’re killing me.  Look, I’ll leave to Secretary Esper the details of this, but I can – here’s what I can say.  When President Trump set out our National Security Strategy early on in the administration, for the first time we identified China in a way that was fundamentally different than we had done – this isn’t partisan – for decades. \n\nThat was important because that was a signal to all of us, whether it’s the State Department or the Defense Department, that we needed to reoriented our – reorient our assets.  And so yes, you’ve seen the Department of Defense begin to do that.  These are big things to turn.  These budgets are multiyear.  It takes a while. \n\nBut if you look at how Secretary Esper and President Trump are positioning our military capabilities – not just the tactical, operational, and strategic capabilities, but our cyber capabilities, our space capabilities – if you look at how we’re thinking about this and spending resources in year two, three, four, and five, I think you’ll see that our focus has shifted pretty dramatically. \n\nIt’s not to say that our efforts to protect America from terrorism are behind us.  We still have work to do there.  But I think this great power challenge that presents itself is something that we have recognized and we begin to make sure that we allocate your money – our taxpayer resources that we have – to the appropriate ends to achieve American security. \n\nMR HEWITT:  My last question has to do with a former secretary of state who was also an Army man, George Marshall.  He gave a speech in 1947 at your alma mater, Harvard, in which he called on all the nations of the world to recognize that the world was in crisis and to choose a side.  And he assured them in that famous address that if you chose the American side in (inaudible) Europe, you could count on America. \n\nSo as you make the appeal you did today, not just to Europe, where it’s relatively easy to be outspoken, though Norway has found it not to be outspoken, but to Taiwan and Japan and Vietnam and all of the – Australia, all of the nations of that region – can they rely on America in the way that people opposing the Soviet Union could rely on George Marshall’s assurance in 1947?\n\nSECRETARY POMPEO:  Undoubtedly, undoubtedly, Hugh.  The only thing I’ll say is when – this language of “pick a side” does make sense to me, but I think about picking a side differently than picking America or picking China.  I think the sides, the division – the shirts and skins, if you will – is between freedom and tyranny.  I think that’s the decision that we’re asking each of these nations to make.  (Applause.)\n\nAnd here’s the good news of this.  The good news is it does take American leadership often in these cases.  To your point, they need to know that America will be there for them.  I’ve seen the tide turn.  In just – in just these three and half years of our administration, I’ve watched other nations have less timidity, become more prepared to stand up for their freedoms and for the freedoms of their people.  We don’t ask them to do this for America.  We ask them to do it for their country and for their nation – the freedom and the independence and to protect the rights of their people.\n\nAnd when we do that and we tell them that America will be there, I am very confident in the end that \n## this is a world that with the hard work applied will become one that is governed by a rules-based order, \nand the freedom of the American people will be secured.\n\nMR HEWITT:  Mr. Secretary, thank you for joining us here today. \n\nSECRETARY POMPEO:  Thank you.\n\nMR HEWITT:  Please join me in thanking the Secretary.  (Applause.)\n\nSECRETARY POMPEO:  Thank you all.\n\nRelevant URL:\nhttps://mn.usembassy.gov/speech-secretary-pompeo-07-23-2020/",
			"added": 1598511704
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_197jsoB6dvq3kKxENBre1AfZhG5JbhXrRF": [
			{
				"comment_id": 1,
				"body": "At the era of coronavirus, timely access to the truth of facts data may help some people save their lives!",
				"added": 1598260218
			},
			{
				"comment_id": 2,
				"body": "Thanks for your fast response. There’re many things to learn …",
				"added": 1598261260
			}
		]
	},
	"comment_vote": {}
}