{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "说说你们为什么要反共",
			"body": "我不明白这里的人的三观，我也不清楚你们对中国共产党为什么有那么大的敌意，对中国政府有那么大的敌意。\n要知道是谁将中国从一穷二白到现在进入小康\n要知道是谁将中国从东亚病夫到现在奥运强国\n要知道是谁将中国从八国联军到现在八方来贺\n不是你们所谓的美国，也不是你们所谓的国军，更不是躲在电脑后面只想着怎么煽动网上暴动\n现在中国存在问题但是你们这样不是解决问题而是制造更大的问题\n我来告诉你们，你们口中万恶的共产党在外国势力动荡的情况下，接回来多少人\n2006年4月，中方包机将侨胞分四批从所罗门群岛撤至巴布亚新几内亚，再由国内起飞的政府包机专程将310名侨胞撤回广东。\n2006年4月，中国驻东帝汶使馆安排200多名侨胞进入使馆避难。5月29日，中国政府两架包机顺利接回243名侨胞。\n2006年7月，外交部和驻黎巴嫩、叙利亚、塞浦路斯等使馆密切配合，分批安全撤离在黎中国公民共计167人。\n2006年11月，中国政府派包机协助193名老弱妇孺侨胞离汤加经斐济回国，并进行妥善安置。\n2008年1月，在驻乍得使馆的协助下，300多名中资机构人员和侨胞分两批自乍得边境安全撤至喀麦隆、加蓬境内。\n2009年1月，48名滞留海地的中国公民搭乘政府包机平安抵达北京。\n2010年6月从6月15日凌晨4时25分首架撤侨包机抵达乌鲁木齐开始，到17日凌晨1时30分，中国政府派往吉尔吉斯斯坦的第九架撤侨包机安全返抵乌鲁木齐国际机场。至此，中国从吉尔吉斯斯坦的撤侨行动基本结束，共计1299名在吉中国公民搭乘包机返回国内。\n2011年1月31日上午11时30分，中国国际航空公司派遣的一架空客A330-200型客机从北京起飞赴埃及首都开罗执行撤侨任务。中午12时，海南航空公司也将派一架A330-200型客机从北京起飞赴开罗撤侨。\n2011年2月，中国派紧急包机飞埃及撤侨 埃及局势紧张,开罗机场500多中国人滞留;国航海航包机预计2.8可回到北京\n2011年2月，中国政府通过海、陆、空三种方式从利比亚撤离我国驻利比亚人员；“徐州”号护卫舰赴利比亚执行保护任务，中国首次动用军事力量撤侨。空军派出4架伊尔-76飞机，于2月28日飞赴利比亚执行接运中国在利比亚人员的任务。这是我国空军首次海外撤侨。\n2015年2月28日，也门萨那，沙特空袭行动持续。中国驻也门大使田琦透露，现在也门的中国公民总计590人。中国外交部发言人此前表示，中国政府高度重视也非常关心在也门中国公民和机构的安危，将根据也门形势发展和需要，及时采取行动，确保中方有关人员安全。一艘中国战舰29日停靠也门港口亚丁，准备撤离中国公民。我们的同胞很快就会安全地踏上他们的归途。\n你们还想要知道那些地方，我来告诉你们。\n我也承认中国存在问题，你让我罗列问题我也能罗列出来，但这不是你们到处宣扬汉奸行径的理由",
			"added": 1502109586
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1GafskHujd8mxBfad2r2STsymDXbqoySoi": [
			{
				"comment_id": 1,
				"body": "> [kai0](#comment_29_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 傻逼滚远点好吧，这里不是提高智商的地方，智商太低的问题我不回答的，再发这种脑残东西就屏蔽你了。\n\n说好的自由言论呢？？？",
				"added": 1502148080
			},
			{
				"comment_id": 2,
				"body": "> [kai0](#comment_31_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 你发这么无知的东西，把自己表现的像白痴一样，真的不感到难为情？要是我不小心发一个如此荒唐的贴，我会马上删除的，太难为情了，把自己表现的跟白痴一样。\n\n> [kai0](#comment_31_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 你发这么无知的东西，把自己表现的像白痴一样，真的不感到难为情？要是我不小心发一个如此荒唐的贴，我会马上删除的，太难为情了，把自己表现的跟白痴一样。\n\n我着实不明白了那里无知了？也不知道哪里荒唐了？",
				"added": 1502191042
			}
		],
		"617_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 3,
				"body": "我觉得小伙的三观挺正的，你们的三观不怎么地",
				"added": 1502279196
			}
		]
	},
	"comment_vote": {}
}