{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1615101046,
			"title": "Putin Fan's Club !",
			"body": "Isn't he the greatest of all time of all russians to have ever lived?",
			"added": 1615101045
		},
		{
			"topic_id": 1615113147,
			"title": "In irak before 1945, I could be...",
			"body": "jewish\nsunni\nshia\nyazidis\nkurds (shia special)\nsuffi\nchristian\nand all domestically based and that for most since the death of PBUH !\n\nimpressive and I may forget some (those in the white dress in the rivers?)\n\nmeanwhile in the vatican controlled area\n\nonly one faith and jewish if I could keep low.\neverything else destroyed, razed, memory holled.\n\ndo you still want the UNO / global agenda / catholic ambition of the vatican organization?\n\nme no.",
			"added": 1615113145
		},
		{
			"topic_id": 1615131460,
			"title": "KILL LISTS : Where do CNN personals live?",
			"body": "Let's build !",
			"added": 1615131457
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1614944690_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 1,
				"body": "why not kill his daughter? while he will be mourning and at her funeral he won't mess with OUR BODIES ! if the chief of the police of new york oppose, kill his family, and to all that oppose kill their children UNTIL THEY GET :\n\nOUR BODIES OUR CHOICES.\n\nhas anyone a counter argument to offer, of course as always all of this is only theoretical... I prefer to nuke.",
				"added": 1615100626
			}
		],
		"1615080461_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "you are gonna get your brain colonized by the fungi and die like the amazon ants :).\n\nso :D. at least you don't force me to take your wisky with psychedelic marinated mushrooms :)...\n\nbe aware > danger ;D.",
				"added": 1615100911
			},
			{
				"comment_id": 7,
				"body": "fungi seed themselves :).",
				"added": 1615103529
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 3,
				"body": "> [papull](#comment_35_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): day 3 after taking the vaccine... [...]\n\nlol, i hope you die :).",
				"added": 1615100944
			}
		],
		"1614861650_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 4,
				"body": "ercot? where is the most wanted list? ahh no... texans are pussies... they talk big, they drive big, they carry big, but they ain't strong enough for a cold snap...\n\nand this believed to have won against SU ? lol...",
				"added": 1615101000
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 5,
				"body": "or maybe it's yuri... I would still have sent yuri :)",
				"added": 1615101634
			},
			{
				"comment_id": 6,
				"body": "where is youri going? earth :) we hope.",
				"added": 1615101651
			},
			{
				"comment_id": 8,
				"body": "No, don't worry about the Central Chinese Administrative State (CCAS) we need to have already the extension of the term possible in case of emergency. all needed to be setup even in advance, aka before it's needed. Xijing Ping Is a Great Comrade ! \n\nModi? who knows... I won't eat beef in india. no way, but wish to use ganjah as they call it...\n\nahhh... our greatest ever leader ! the 1st tsar... We will build him a mount like the Khan far in the motherland for him for eternity to watch the heavens :) or not... depends on his will. but for now he is alive and well ! so all is good ! let's enjoy the good times while they last, we will have enough to worry once they don't.\n\nmy biggest worry and problem is the globalist / uno agenda having taken over the west following an ideology of childrape/pedophila cleptocratic hegemonist authoritarian totalitarian feodalist wannabe aristocrats.\n\nFurthermore the real deeds of the vatican church is the extermination of all competiting faith (roman gods? gone, greek panetheon? gone, animist? gone, spiritualism etc gone). \n\nand as you can see western leader follow the same path... right now their new religion is UNO / global agenda aka the biggest treason on the most people on the largest surface of the world in history.\n\nMaybe democracies, parlementary. direct. representative etc, can't survive as soon as free speech is censored. \n\nthe problem is that often the troops when losing on the foreign fronts refuse to discuss it and start to censor... and it creeps....\n\nwho was on little st james island? why only 2 arrests\n\nxi would have solved it as fast as light\nputin would have killed them all in covert op\nmodhi would have faced the yugest protests in the history of india (which tehy did many time) I hope he won't sell the farm land to bill gates and his transhumanism dnamodding inferno project...\n\nanyway ! \n\nthanks for your reply !",
				"added": 1615107934
			},
			{
				"comment_id": 9,
				"body": "And our dream is that one day, a tiger will return to the mount putin and maybe seat on top... who knows, if putin is reincarnated it should in a tiger, so to the russian tigers the future will belong :) !!!\n\nhow are the human poacher hunting blooding training going on? play with them, like cats :D. killing them in one shot is too kind... progressively... to train the tracking too ! but aimed... first the bag or this tree next... why? to make the exercize more interesting :). \n\nand the funny thing we just have to raise the prices of tiger parts in asia, to get more supply of volontary participants to russian armies training ! win - win (/sunglasses).",
				"added": 1615108526
			},
			{
				"comment_id": 10,
				"body": "and for me conscreation of the tiger defense training camp, is when a tiger comes toward a murderer, and \"says\" so you think you protect me, leaving arrogantly, but still smiling... thanks... firmament for eternity.\n\neach of those kills is one tiger less (at least) killed.\n\ntraining etc... silent killing, shadow warfare etc... so cool... very real. pragmatistic.\n\nhow could i value your life, if your life is a threat to a single tiger? \n\nsorry I can't.\n\nyou are feed, target practice, blooding biobag what ever... kill it, but play and learn first, aka train ! it will be useful... rest assured.\n\nit's real... live ammunitions as they say :) in a safe and controlled environnement :), aka home.",
				"added": 1615108870
			}
		],
		"1615113147_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 11,
				"body": "but to the one guest status has been given to return will he, to die and see his empire crumble from his throne... soon.",
				"added": 1615113292
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 12,
				"body": "if we don't bring death to their homes, they will to ours.",
				"added": 1615131591
			}
		]
	},
	"comment_vote": {}
}