{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565321865,
			"title": "Methods for Disseminating Content/Conversations?",
			"body": "I think it's obvious by now that the main point of contention regarding ZeroNet among the media and tech illiterate currently is the perceived possibility of unwittingly becoming a distributor of illegal content. What are some ways that the threat can be mitigated, while still maintaining the freedom of the zeronet? How can discussion be grouped and shared?\n\nI think that the solution to the CP problem is a site creator's voluntary restriction of posting to text-only communication, the easiest of which appears to be cloning ZeroTalk and sharing the site link. Cloning and sharing millchan or 08chan is obviously a bad idea on that front. How should we go about organizing topical discussions, if at all?  More importantly, how do we make it easier for individuals with a lack of web design/programming knowledge to get involved and share grouped discussions? Is this even a desirable goal?\n\nCurrently the only method i can think of for grouping content safely is creating new sites with a basic HTML template that a user can index links on, which can then be linked to on the main ZeroTalk page.\n\nThoughts?",
			"added": 1565321864
		}
	],
	"topic_vote": {},
	"next_comment_id": 30,
	"comment": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 1,
				"body": "> [removeboomer](#comment_8_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): Is the spammer a schizo? Who would have thunk.Can you automatically generate zeroid ID's? If not then enforcing usage of those might be an idea until we can get smarter on filtering and blocking.\n\nat this point i'm basically convinced that this guy is either retarded or blackpilled to shit",
				"added": 1565322794
			},
			{
				"comment_id": 7,
				"body": "> [tinktinktink](#comment_2_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): The thing about decentralization and allowing everyone to host shit is that you can't prevent me from just deleting my identification and telling everyone I'm a new user. That's what I'm doing, I delete my identification after every single post. [...]\nthere's basically no difference between that and posting as an anon, except here there's no site to shutdown or IP to track",
				"added": 1565325915
			},
			{
				"comment_id": 12,
				"body": "> [theosis](#comment_45_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): If your app has user-submitted content and accepts self-signed certificates, it can and will be spammed. I don't see a way to stop it.\n\nwhat about giving each newly created site its own genesis block, then drawing captchas to canvas from the last few characters of random hashes?",
				"added": 1565379671
			}
		],
		"1565321865_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": [
			{
				"comment_id": 2,
				"body": "so the trouble is you can't implement anything that could be used as censorship to restrict you, or any sort of registration system tied to a real identity, yeah? I think for the purposes of conversations in a cloned ZeroTalk group, the current mute function would suffice.\n\nMy knowledge of any actual programming is extremely limited. As far as a \"listing\" method goes, I mean something like this. The trouble is, the index still has to be manually edited:\nhttp://127.0.0.1:43110/189XoF67jE7nohNS4rsminjRC2ZaBsaff8\n\n\n\n@zeronetanon4:\n\"It's.... the web. The same as the regular web. Regular joes won't know how to make websites. But they can clone existing sites easily. For instance cloning zerotalk to make their own private forum. No programming needed.\"\n\nthis is what I'm getting at. my real concern is that there may quickly come a time when communication over a network like ZeroNet is the only option for individuals to avoid surveillance or being thrown in jail, and the level of knowledge required to build a full functional website is prohibitive to the 'regular joe'.",
				"added": 1565324829
			},
			{
				"comment_id": 13,
				"body": "> [qf2ss4t5y3365](#comment_11_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): [...]\ncould just meme it as FreedomNet honestly",
				"added": 1565379818
			},
			{
				"comment_id": 24,
				"body": "a purely text-based version of millchan would be ideal.",
				"added": 1565383189
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 3,
				"body": "honestly the only immediate protection that I see against CP is not using any site that allows randos to upload images",
				"added": 1565325021
			},
			{
				"comment_id": 4,
				"body": "if you really want a successful anti-pedo action movement, i recommend 9mm",
				"added": 1565325359
			},
			{
				"comment_id": 9,
				"body": "> [aspidochelone](#comment_19_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The Section 230 argument is interesting:  if people are hosting and transferring other people's files, that should make them service providers who are not responsible for user content.  Provided, of course, that they aren't knowingly transmitting that content.  And I certainly assume most non-pedoes are basically worried about this software somehow putting the files on their disk and serving them without them knowing. [...]\n\na centralized government gets literally zero benefit from something they can't control existing, which means they're going to do everything they can to interrupt a service like zeronet",
				"added": 1565326242
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 5,
				"body": "the only thing that is \"yours\" is what you can defend by force against an aggressor.",
				"added": 1565325507
			},
			{
				"comment_id": 10,
				"body": "> [bigbadbob](#comment_92_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): if i wondered into someones house...  i could literally except bad things to happen to me.  it would make sense with the status quo\n\nyeah if somebody wanders in to my house, they're at the very least getting a rifle pointed at them. I really don't understand how someone can argue any other scenario",
				"added": 1565326380
			},
			{
				"comment_id": 14,
				"body": "what the fuck am i reading",
				"added": 1565380561
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 6,
				"body": "I think the only way people outside of 8chan and 4chan will use zeronet is if they're afraid of government censorship, and very few of those people weren't on the chans to begin with. The foundation of someone using the chans is probably some sort of understanding and interest in political reality anyway",
				"added": 1565325780
			}
		],
		"1565324173_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": [
			{
				"comment_id": 8,
				"body": "> [lauriea](#comment_2_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC): Alex Jones is fighting an information war[...]\nthen tell that faggot to plug ZeroNet on his show",
				"added": 1565326091
			}
		],
		"1565326773_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 11,
				"body": "i suppose box cutters are covered under the 2nd",
				"added": 1565327192
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 15,
				"body": "> [aspidochelone](#comment_28_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Truth is, they are you and you are them\n\nyeah, so are wild pigs and rabbits. we still kill them and eat them.",
				"added": 1565380949
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 16,
				"body": "> [bigbadbob](#comment_100_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj):  They say 08chan but i suspect those numbers represent are all of zeronet.  \n\nlast I checked, 08chan alone had something like 1700 seeders",
				"added": 1565381259
			},
			{
				"comment_id": 19,
				"body": "If you've been to /pol/ on 4chan or 8chan you've really seen it all. just keep in mind that what happened to 8chan is likely going to happen to 4chan soon.",
				"added": 1565382222
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_916_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm afraid it already happened.\n\n4chan is still accessible on the clearnet, and there's still decent, relatively free discussion. at some point a \"manifesto\" is going to get posted to it and their providers will pull support just like 8chan",
				"added": 1565382546
			},
			{
				"comment_id": 21,
				"body": "> [bigbadbob](#comment_102_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): might aswell go chat with a bot at a certain point when its just the same shit over and over.   I like 4chan but would never post.\n\nhonestly it gets to the point that most people there are just killing time until open conflict starts",
				"added": 1565382789
			},
			{
				"comment_id": 23,
				"body": "> [bigbadbob](#comment_103_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): its all such bullshit.  how much illegal shit happens on clearnet social media sites that only get promoted by the empire.   All the big ones have lots of the worst of the worst with no mention.\n\nlike the calls for killing whites that are made constantly on twitter? yeah",
				"added": 1565382977
			},
			{
				"comment_id": 25,
				"body": "> [bigbadbob](#comment_105_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so its progressed beyond white shaming?  I dont use it.   Been think of trying to set up anon account but they dont make it easy\n\nthe straight up \"kill white trump supporters\" people are obviously still a minority, but you have big accounts saying how \"white supremacy needs to be eradicated\", as well as big news sites conflating white supremacy with AR15's and shit.",
				"added": 1565383342
			},
			{
				"comment_id": 28,
				"body": "> [bigbadbob](#comment_108_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Would seem the staus quo really needs a war to happen.   Sad to see people being played like this\n\nthe way i see it going down is as follows:\n\n1. Shootings continue with \"white nationalist\" manifestos being released on whatever chans are available\n2. chans get shut down\n3. white supremacy/domestic terrorism definitions are passed in to statute at the federal level\n3.1 red flag laws are passed in to statute at the federal level. they may remain only state but there's not really a difference.\n4. vocal opposition to anything not deemed 'acceptable' to the establishment regarding immigration/race/guns will get you put on a domestic terror list, or a red flag warrant served to you\n5. over time, eventual loss of political power of the majority due to immigration/propaganda\n\nbasically if democrats win majority in the legislative and executive branch - and they eventually will, as it's purely a numbers game - they will give the illegals in the US amnesty and secure an eternal voter base.",
				"added": 1565384057
			},
			{
				"comment_id": 29,
				"body": "> [bigbadbob](#comment_110_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): over time.. every system fails to the benefit of some greedy group.\n\nand no rebellion will ever be sanctioned by the controlling powers",
				"added": 1565384684
			}
		],
		"1565229380_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 17,
				"body": "> [aspidochelone](#comment_33_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  Gratitude is not one of the satanic virtues.\n\ngratitude for daddy government dick maybe lmao",
				"added": 1565381321
			},
			{
				"comment_id": 18,
				"body": "> [bober](#comment_33_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): we should censor NYT first\n\nunnecessary, they end up making themselves look ridiculous to anyone with active brain cells anyway",
				"added": 1565381706
			}
		],
		"1565382642_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": [
			{
				"comment_id": 22,
				"body": "8chan onion or 08chan bunker?",
				"added": 1565382839
			},
			{
				"comment_id": 27,
				"body": "> [kristallnacht](#comment_2_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw): nah didn't work cheers for the help though, gonna see if i can connect to it on tor\n\nI personally wouldn't risk connecting to anything here without tor",
				"added": 1565383534
			}
		],
		"1565373995_1PLaPnEwcMKPkfSJxta8vHr7kXjN7GR82V": [
			{
				"comment_id": 26,
				"body": "you have to be 18 to post here",
				"added": 1565383475
			}
		]
	},
	"comment_vote": {}
}