{"cert_user_id": "Guedez@github", "next_topic_id": 2, "topic": [{"topic_id": 1604067422, "title": "CP can be automatically downloaded to your PC", "body": "If a troll starts spamming a chat, that enables images, with child pornography, your computer will download and host those images, no?\r\n\r\nCould it be possible to enable some fractional image mode? Where your computer never saves a whole image, so no matter what's posted, you never host a whole image, so you are never \"hosting child porn\".\r\n\r\nThis is the only reason I am not using this yet, some countries have some pretty draconian laws about that", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1565369594, "modified": 1566518147, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2133", "source_type": "github"}], "next_comment_id": 3, "comment": {"1604067422_mirrored_Guedez_github": [{"comment_id": 1, "body": "Hmmm, I understand why they can't be partially stored\r\nIs there an easy way to delete only images from the cache? Like the browsers have a \"clear cache\" button, maybe zeronet could have a \"delete images and don't download those again\" to quickly get rid of those unwanted images.\r\nFor instance, if you go to a chan board catalog, you will be download a whole lot of images that you don't see if you don't go through the effort of actually checking all of them manually. If I could just purge all images from my cache easily, would solve a lot of problems. Especially if this could be somehow automated. Maybe set some sites as \"delete all 1-day old images\"", "added": 1565428456, "modified": 1565428456, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2133#issuecomment-520144304", "source_type": "github"}, {"comment_id": 2, "body": "At first I was asking to be able to only partially host a image, like torrent files are hosted in pieces. But it was explained that it's not possible.\r\nBut now, #2138 probably solves all issues, as it's easy to quickly delete a image if you really don't want it on your pc, even on your cache, and you can even disable file hosting, so you can be pretty much safe, since it becomes just as dangerous as normal sites that might download things to your cache. If you are never hosting files, then it's the same as any other site", "added": 1565604824, "modified": 1565604824, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2133#issuecomment-520419439", "source_type": "github"}]}}