{
	"next_topic_id": 40,
	"topic": [
		{
			"topic_id": 1543527038,
			"title": "How many people are using Zeronet? Does anyone know?",
			"body": "",
			"added": 1543527037
		},
		{
			"topic_id": 1543791956,
			"title": "Are there any really good news sites that are being published on ZeroNet?",
			"body": "",
			"added": 1543791954
		},
		{
			"topic_id": 1543809355,
			"title": "The Creator Of ZeroNet Tamas Kocsis Ted Talks",
			"body": "https://www.ted.com/talks/tamas_kocsis_the_case_for_a_decentralized_internet#t-583793\n\n#news #ted #infowars #maga #trump",
			"added": 1543809352
		},
		{
			"topic_id": 1543862269,
			"title": "Is there another email system other than zeromail?",
			"body": "Is there another email system other than zeromail?  I have been looking around and I dont seem to find anything.",
			"added": 1543862265
		},
		{
			"topic_id": 1544899392,
			"title": "What has happened to all the Zeronet Traffic?",
			"body": "Seems that Zeronet just died. Is this because I do not have enough peers that I am connecting to or is this another issue like zeronet lack of use?",
			"added": 1544899387
		},
		{
			"topic_id": 1544990520,
			"title": "Wanted: Looking for a video sharing site on zeronet that can handle 4 gig files.",
			"body": "I am looking for a video sharing or upload site that can handle high def video on zeronet. I know its allot of space. I need to be able to link the video download files to a blog or other zeronet site.",
			"added": 1544990514
		},
		{
			"topic_id": 1546468714,
			"title": "Can the bot do key word fact checking searches in text based news stories?",
			"body": "Can the bot do key word searches in text based news stories and create a database of matching dictionary words that can search the main news story's accuracy in relation to the searched facts of the same, or related to stories to figure out a news accuracy level? \n\nThe create a news accuracy bot.",
			"added": 1546468707,
			"parent_topic_uri": "1509065748_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D"
		},
		{
			"topic_id": 1546469037,
			"title": "How many Zites are out there that are not publicly shared?",
			"body": "Does anyone know how many people are using zeronet? And how many zites are out there and are not listed. (I am still learning this p2p)",
			"added": 1546469029
		},
		{
			"topic_id": 1547077889,
			"title": "Using Zeronet on Flash drive may shorten device life.",
			"body": "I just did a test on zeronet being used on a flash drive. I expected it to fail due to the amount of read and wright going to the usb thumb drive.  I was correct. It lasted about a month before killing it. I am wondering if other people have used Zeronet on a usb drive.  Usb external hard drives should work fine. The solid state usb devices should probably crash over time.",
			"added": 1547077880
		},
		{
			"topic_id": 1547237644,
			"title": "The World Needs Zeronet and Zeronet Needs The World.",
			"body": "If you are not spreading the link https://zeronet.io/ You are contributing to a possible internet apocalypse that will enslave the world into a Nazi/Communist Dictatorship that will end all life as we know it. Sounds dramatic doesn't it!\nHowever it is true. And I would bet that there are many here that are technically savvy enough to understand this.\nSo start spamming clear-net about Zeronet. And we all must teach each other on how people can make there own Zite (Website!). And how zeronet peer to peer is superior to the old model of the web, while addressing any security problems as they occur on zero net.",
			"added": 1547237634
		},
		{
			"topic_id": 1547239393,
			"title": "Zeronet Needs a Desktop Button For Linux Desktops.",
			"body": "Little small things can mean allot to new users and Zeronet needs a desktop button for Linux desktops.\nI am an advanced power user and use the command line quite a lot and I always need to look back and think about what the average newbe Linux/Mac/Winblows Zeronet user first time experience is like. By dropping the learning curve line to less technical users this will allow more users using Zeronet.\n\nBtw put this as an option in the zeronet install. \n\nPrompt: \nWould you like a link to Zeronet on your desktop?  Yes/No?\n\nAnother prompt could be.\nWould you like to start Zeronet on system boot?  Yes/No?\n\nAlso a working script file that would auto configure to tor and i2p.\n\nAnd some links to sites/zites that will test your privacy settings out.\n\nGoal is to make using zeronet a seamless jump from the clearnet. \n\nThe users will flock to zeronet when you spam all social networking sites and websites.\n\nREMEMBER YOU ARE THE ZERONET MARKETING TEAM! \nhttps://zeronet.io",
			"added": 1547239382
		},
		{
			"topic_id": 1547272437,
			"title": "Updating Zites and Calculating Zeronet Traffic",
			"body": "If you want traffic on Zeronet you must update Zites and keep them Fresh with new data.\nZeronet under its current working system looks like the ultimate social media site. The sites/Zites just like this one are very good. However the traffic to a site like this one to me is difficult to measure. Maybe some one knows how to figure out a traffic count. (Or there is one and I don't know about it?)\n Either way based on the amount of actual comments on Zero talk, in my experience with other websites  I have run in the past is actually quite high. This may indicate that over 400 + or -  people may read this post in a 24 hour period. \nIf there is no counter for a Zite then could one be created?\n\nI",
			"added": 1547272425
		},
		{
			"topic_id": 1547691059,
			"title": "I noticed that after the latest update all my Favorite sites have just been wiped.",
			"body": "After my latest update on Zeronet all my favorite sites I had marked were gone. Bug? \nI now need to go back through all my sites and re favorite them all. This is really annoying. There needs to be a way to backup your favorite sites from the zeronet drop down menu. Command line backups is for the advanced users. If you want numbers make things easy for users.",
			"added": 1547691046
		},
		{
			"topic_id": 1548796017,
			"title": "Linux Closing Zeronet using ctrl-c may cause a user blowout if sites are being updated.",
			"body": "Linux Closing Zeronet using ctrl-c in terminal may cause a user blowout if sites are being updated at that time. \nI have been able to duplicate this problem 3 times so far and it looks like the only way to shut down Zeronet safely\nis to do on the zeronet pull down menu and select shut down zeronet. \nThis possible bug needs to be cross checked for duplicated results. \nWARNING!: BACK UP ZERONET COMPLETELY BEFORE TESTING THIS!\n\nPlease post comments on this issue.  Have you had the same problem?",
			"added": 1548796003
		},
		{
			"topic_id": 1548909076,
			"title": "Is there a program for Linux that will translate language that will run on your computer without going to the  cloud to do it?",
			"body": "I have been looking for a program like this for a long time and have yet to find anything that was any good. I am sure there must be something out there.",
			"added": 1548909061
		},
		{
			"topic_id": 1549510248,
			"title": "Is Zeronet Ready For 2 Million + New Users To Join It?",
			"body": "I have been holding off on this for a little while but I have done enough testing of Zeronet to come to the conclusion that It is ready. However lots of people will need lots of help on Zeronet. \nAre We Ready?",
			"added": 1549510232
		},
		{
			"topic_id": 1549511316,
			"title": "WANTED!: Peer to Peer Live Video Streaming Apps and Links to Sites.",
			"body": "A very large website is looking for peer to peer live video streaming to save bandwidth costs and reach a larger audience.   Please post links..",
			"added": 1549511299
		},
		{
			"topic_id": 1549539633,
			"title": "Adding .jpeg and all photo file formats pluss adding video to zerotalk would",
			"body": "Adding .jpeg and all photo file formats pluss adding video to zerotalk would be a really nice feature and would make this zite even more cool to use.",
			"added": 1549539615
		},
		{
			"topic_id": 1550599552,
			"title": "Linux.net",
			"body": "http://127.0.0.1:43110/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/\nI just ran across this site. It could use some Linux posting on it.",
			"added": 1550599533
		},
		{
			"topic_id": 1550767789,
			"title": "News (Beta Test.)",
			"body": "http://127.0.0.1:43110/1DUcHcUT6g8XTyewfXtiX2pCFPcTrYt5bg/\n\nThis is a beta test News site.",
			"added": 1550767769
		},
		{
			"topic_id": 1550940016,
			"title": "Can Zeronet be coded as a browser plug in extention?",
			"body": "This of course would need to have the entire Zeronet program.\nAlso a nice link to a help section. This would increase traffic to Zeronet and build the network out.\nWhat do you think? I am just a program concept engineer.",
			"added": 1550939995
		},
		{
			"topic_id": 1551294323,
			"title": "Can Zerotalk post images or videos.",
			"body": "Can zerotalk post images and videos on posts?  Is there a way to code html into a text box that will display imbibed video. If not how can this be coded in zerotalk?",
			"added": 1551294301
		},
		{
			"topic_id": 1551567748,
			"title": "How To Marketing Zeronet",
			"body": "This is about marketing strategies for Zeronet and selling points of Zeronet. Why should people use Zeronet? And where are grate places to post about Zeronet and get the message out. \n(This is a take Action Post!) (Because the more people using Zeronet makes Zeronet greater.))",
			"added": 1551567725
		},
		{
			"topic_id": 1551715956,
			"title": "Zeronet News Sites List",
			"body": "We need a News site list. This can be anything that primary purpose is News.\nPlease share what you find.\n\nhttp://127.0.0.1:43110/1DUcHcUT6g8XTyewfXtiX2pCFPcTrYt5bg/",
			"added": 1551715932
		},
		{
			"topic_id": 1553286882,
			"title": "Zero ID is down. New users cannot use Zeronet 3-22-2019",
			"body": "New users cannot use Zeronet 3-22-2019",
			"added": 1553286857
		},
		{
			"topic_id": 1553291767,
			"title": "Massive censorship on clearnet. Is it Time for Zeronet to come to the rescue?",
			"body": "Its time to back up data on clearnet to Zeronet.  Is zeronet ready?",
			"added": 1553291741
		},
		{
			"topic_id": 1553362552,
			"title": "New To Zeronet Helpful Zites List.  (Must READ!)",
			"body": "We need to generate a list of helpful sites for new users to Zeronet.  And for new developers.\nPlease post links to sites that you think would help out the new Zeronet user. \n\nIf you are a new user and cannot post you need to sign in with a zeronet id.  \n\nA working Zeronet id link is here.\nhttp://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz\n\nPlease post links to help sites for new users. \n\nWelcome INFOWARS!",
			"added": 1553362525
		},
		{
			"topic_id": 1553463903,
			"title": "I Just Want To Give a Huge Giant Shout Out To All (Free Software) Open Source Developers (I Love You All!)",
			"body": "I just want to give a huge Thanks to all the people coding for (Free Software) (Open Source)) software. Without your contribution sharing your knowledge of programming to others this world would be a far worse place for so many people.  You have no idea how much your contributions have changed the world for the better.\n\nAll of you mean so much to me I cant even put it into words. \n\nI just want to say THANK YOU! \n\n\nThe () is in honor for Richard Stallman who started it all with the first free text editor Emacs back in 1975.\n\nhttps://distrowatch.com/",
			"added": 1553463875
		},
		{
			"topic_id": 1553953681,
			"title": "What happens when you run out of memory on Zerotalk?",
			"body": "I keep getting a message saying that I need to contact nofish to raise my memory storage. If I run out of memory what will happen?",
			"added": 1553953652
		},
		{
			"topic_id": 1554165337,
			"title": "Breakthough Technolgoy Now Can Increase Your Phone Memory By Just Taking a Picture!",
			"body": "Breakthrough Technology Now Can Increase Your Phone Memory By Just Taking a Picture!\n\nBy using microdot punch card technology you can now download an app that will increase your phones memory size just by taking a picture of pattoneded microdots with your cell phone.\n\nThis incredible technology can increase your ram size up to double. Works with all phones. Just download the app and go to our website and download the file that you can print out with any computer printer. Just take a picture and enjoy your new ram expatiation.\n\nJust send me an Email and I will give you a link for your free one time trial offer at 50% off for a limited time.",
			"added": 1554165307
		},
		{
			"topic_id": 1555332241,
			"title": "News",
			"body": "http://127.0.0.1:43110/1DUcHcUT6g8XTyewfXtiX2pCFPcTrYt5bg/",
			"added": 1555332210
		},
		{
			"topic_id": 1557079828,
			"title": "How do you block people manually.",
			"body": "I need to know how to block people manually on Zeronet.  Any links would be nice on how to do it. Or some hidden button somewhere I missed.",
			"added": 1557079796
		},
		{
			"topic_id": 1557278450,
			"title": "I am looking for a Zeronet video site links like Youtube.",
			"body": "I am looking for links of working video sites on Zeronet.",
			"added": 1557278417
		},
		{
			"topic_id": 1557287415,
			"title": "The Real Climate Change is Geo Engineering",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1557286689_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"added": 1557287381
		},
		{
			"topic_id": 1557618716,
			"title": "Breaking News! Leaked Joe Biden Cartoon Series To Be Aired On Cable",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1557616462_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE\n\nThis is a Zeronet Exclusive!\nAn insider at the Joe Biden campaign has leaked the following cartoon trailer of a new children's cartoon series that they plan on airing on cable TV in the fall season. They said they are in ongoing negotiations with several different cable outlets. Many have said that they are very interested in airing this cartoon series before the 2020 election.\n\nI contacted the Joe Biden campaign about this cartoon trailer and\nthey declined to make any comment about this at this time.\nThe leaker said that they have already made several episodes ready to be aired.\n\nJoe Biden campaign staff said in a memo that this cartoon will make a strong connection with the young Democratic voter base and will promote positive family values.\n\nThis is also part of the Democrats, \"Joe Biden, touched me!\" Campaign slogan, that is also part of the me to movement on Twitter. Promoting stronger family values.\n\nNote: Some content may be copyrighted.\nThis is being released as fair use.\n\nYou can find more about Joe Biden presidential campaign at his official site at https://joebiden.info/\n\nPlease feel free to copy and redistribute this Zeronet News exclusive on all News media websites and social media platforms.",
			"added": 1557618681
		},
		{
			"topic_id": 1558752511,
			"title": "ALEX JONES (FULL SHOW) Thursday 52319 Robert Barnes, Millie Weaver",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1558751808_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE\nExcellent Show! A Must Watch.",
			"added": 1558752475
		},
		{
			"topic_id": 1558844494,
			"title": "Borderless (2019) EMERGENCY BACKUP[HD,1280x720, Mp4].mp4 (NEW!)",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1558843999_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE\n\n(Video Released on 5-25-2019)\n\nLauren Southern Published on May 25, 2019 Let's try this again... After six months on the ground I'm thrilled to present #Borderless, the biggest & most comprehensive documentary ever made on the European border crisis. I want to say a huge thank you to everyone who has made this possible & am so proud to release the movie totally free! It has been a long, painstaking journey and I truly believe now, we have created something incredible that will help shine a light on such an important issue. I want to make sure as many people are able to see this as possible, so again, we have made Borderless completely free to watch. \n\nPlease share this important documentary with your friends, your family and coworkers - you might be surprised! If you enjoyed the movie and would like to tip the creators we would appreciate that as there was no profit made. We understand not everyone can afford to give so any support is appreciated even if you just give us a kind review or share the movie. :) \n\nWebsite: https://laurensouthern.net Paypal: \nhttps://www.PayPal.Me/LaurenSouthern \nBitcoin Wallet: 1JLM6GJwaPdNv4dM8K5KkcFHeziXXXMGKT \nTwitter: https://twitter.com/Lauren_Southern \nFacebook: https://www.facebook.com/LaurenCSouth... \nInstagram: https://www.instagram.com/laurencheriie/",
			"added": 1558844457
		},
		{
			"topic_id": 1558919260,
			"title": "Censorship Just BACKFIRED Against Far left and HELPED A Conservative!-UWBPqVUCjDg.mp4",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1558918908_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"added": 1558919222
		},
		{
			"topic_id": 1558925765,
			"title": "ALEX JONES (FULL SHOW) Sunday 52619 News & Analysis, Special",
			"body": "ALEX JONES (FULL SHOW) Sunday 52619 News & Analysis, Special\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1558925523_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"added": 1558925726
		}
	],
	"topic_vote": {
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": 1,
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543809355_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"23366_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1547147759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1548145805_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"1548890091_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf": 1,
		"1545280465_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1549821398_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"1554165337_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	},
	"next_comment_id": 479,
	"comment": {
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 1,
				"body": "Mint 19",
				"added": 1543525929
			},
			{
				"comment_id": 2,
				"body": "> [scammerjammertv](#comment_1_1JU8NTajPZjS7R5RpxzMTUqJoBjhkpScYh): Linux mint 19 but I am heavily considering Fedora as well\nI am thinking of doing the same as well.",
				"added": 1543525951
			},
			{
				"comment_id": 3,
				"body": "> [tusiko](#comment_10_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): Linux Mint just works and does many things out of the box. Fedora is really good. \n\nI may try arch in a vbox. I want one linux machine that is ready to go on the fly and I want another system that is more robust. I have been using Linux for 20 years and you get rusty when you leave that command line. Mint has been the easiest to set up and easiest to keep it running. I started on Mandrake and did some distro role out work on it. Allot goes into these distributions before they are released.   I just want Linux mint 19 to be compressed down to 19 k and have all the software working on it and installed. LOL",
				"added": 1543526952
			}
		],
		"1543527038_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_499_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @quantumworld  So i assume there is minimum 700 computers seeding the site? [...]\n\nIs that reading the entire network. I bet it is not since it is so decentralized. However I may be wrong.",
				"added": 1543552443
			}
		],
		"1543656691_1HbvuN84epzW1vjpRjgemxPADB6UqdZpvy": [
			{
				"comment_id": 5,
				"body": "> [kai0](#comment_729_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): more than 3000 sites\n\nIs there a full list of sites on zeronet somewhere?",
				"added": 1543668969
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 6,
				"body": "Yes. I use it all the time.",
				"added": 1543669702
			},
			{
				"comment_id": 7,
				"body": "> [steelmemes](#comment_3_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): Gab could've been good, but Andrew Torba is a fucking sperg who does nothing but pick fights with everyone like he has something to prove. Plus he's made it his mission to constantly antagonize silicon valley while using silicon valley platforms like Azure cloud because he's too cheap or too retarded to build his own server farm, then he acts surprised when they kick him off. [...]\n\nOmg! What you said there was so offensive and racist. How can you say something like that about some one.",
				"added": 1543669905
			},
			{
				"comment_id": 8,
				"body": "> [nekololi](#comment_311_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): the attacker in question would have to either be a site's owner, or a rogue individual who has somehow secured the site's private key. but either type of individual could perform this type of attack. i've always wondered how easy it would be for someone to make a bunch of fake sites, get them seeded by people, and then flip a switch and change the content of their sites to be illegal, getting loads of people to seed illegal content.\n\nThe zites data needs to be encrypted. This is what freenet or freenode, I forget what it is called. Its another decentralized site that is slow as hell to use.",
				"added": 1543670075
			}
		],
		"1543672789_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 9,
				"body": "I got banned from twitter after I made fun of a stuffed pig. They said that I was insensitive to vegetarians. And it had nothing to do with vegetarians. They are insane.",
				"added": 1543675440
			},
			{
				"comment_id": 10,
				"body": "> [scotcyguy2](#comment_4_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Twitter is for journalists and politicians to suck each other off...they don't like it when the plebs point out how silly the things they are saying are\n\n\nOMG!!!  I just about blew Coffee out my nose!!! LOL!!!!",
				"added": 1543678474
			},
			{
				"comment_id": 11,
				"body": "> [ssdifnskdjfnsdjk](#comment_508_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I am landing to a twitter sometimes, it is working and always was for me. Are you using same twitter like me? :-S\n\nYou must be a terrorist then. LOL..",
				"added": 1543682072
			},
			{
				"comment_id": 45,
				"body": "> [bitwolf](#comment_19_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): Had two accounts.First one made years ago (2008/2009-ish), tied in with a business (renting out OpenSim servers) I was setting up back then... worked well for two years, then suddenly that account got hit with a ban, nothing but a cookie-cutter statement that I violated their rules, no explanation and no specifics about what/how I violated.Seeing how that was my main way of keeping in touch with prospective clients, it really screwed me hard.About a year and a half after that ban I made a new account, regular private-person use... had that account until last year.Saw a couple of Trumpicans  bashing and posting threats to an actress who I followed on Twitter, so I - along with a few others - reported those Trumpicans; about a week passed with no response or action from Twitter, those inbreds were still harrassing and threatening the actress, so I started giving those genetic rejects a taste of their own medicine - and blammo, after just three posts Twitter decided that I violated the rules for being inflammatory, hate-speech, harrassment, threats.... while those Trumpicans are still allowed to to have their daisy-chain gay circle-jerks on Twitter, just three posts from me was enough for a permanent insta-ban.It's Twitter that abandoned its users, not the other way around.\n\nDon't worry twitter will eventually ban all users for hate speech and racial discrimination and the only person left on the site will be Jackko Dorcey. Its really all about his tweets over there anyway. Anyone who is more popular than he is gets a ban. Seriously that's what it looks like to me. Only time will tell on this one.",
				"added": 1543807050
			},
			{
				"comment_id": 51,
				"body": "> [bitwolf](#comment_20_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): I'd say you're right about them banning anyone more popular than Jackie-boy... it might be a seperate issue from my own bans, or not - I'm completely in the dark about what \"logic\" they follow when banning people who aren't more popular. I only had maybe 30 followers on my personal twitter account, probably less, but some of my twitter-gems did reach larger crowds (nothing that'd put me in any big-league range, honestly... if I saw a tweet of mine make it to the epic scale of 2000-3000 viewers it already gave me delusions of grandure... heh... meanwhile my 17 year old nephew has tens of thousands following his tweets about his shitty unpacking video's on youtube)I'll be laughing my ass off when eventually Jack has a brainfart and bans himself, thinking that account is getting too close to his own \"popularity\". The self-inflicted butthurt will be huge that day.\n\nJakko Dorcey sets the twitter narrative of the LibTards and he tells his little SJW admins to go out and ban anyone who is not a Communist or who does not worship Xi Jinping from China. Oh and you have to be muslim as well. Twitter is a total joke. People get banned for absolutely no reason at all. So why would anyone want to be posting anything on a Nazi site like that. Maybe some day I will get an account and troll the hell out of everyone but its such a waste of time with all the bots there as well.",
				"added": 1543861465
			}
		],
		"1543694585_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q": [
			{
				"comment_id": 12,
				"body": "That is not a girl. She is a guy.",
				"added": 1543698703
			},
			{
				"comment_id": 13,
				"body": "We all know that this is Jim Acosta's x girl friend that he knocked up and he wants a news story.",
				"added": 1543707441
			},
			{
				"comment_id": 15,
				"body": "> [hurtthiswoman](#comment_1_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q): Amber Sipert\n\nThis guy is just another big pharma psyco induced social media stalker. Just did a name search and every photo was public and from facebook.  You are an idiot for posting this.",
				"added": 1543708289
			}
		],
		"1543487242_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 14,
				"body": "> [anonymouslogin](#comment_173_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\n\nFantastic link. Zeronet needs a better way to find zerosites.",
				"added": 1543708033
			}
		],
		"1543742417_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn": [
			{
				"comment_id": 16,
				"body": "Why would anyone want to use Windows?",
				"added": 1543743157
			},
			{
				"comment_id": 18,
				"body": "Using Windows is like getting addicted to your abuser. Ya know you are going to get totally screwed and fucked with but you keep going back to it because they have eye candy from all the other abused programmer victims.",
				"added": 1543743589
			},
			{
				"comment_id": 19,
				"body": "> [timelinehyperbot](#comment_50_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Unless you are a programmer source code is useless...\n\nWrong! Looking for exploits it is a wonderful tool. Just look at the registry..",
				"added": 1543743664
			},
			{
				"comment_id": 20,
				"body": "Pirating MicroShaft software is a crime.. So please spread your off site backups everywhere. People love free shit software.. lol",
				"added": 1543743786
			},
			{
				"comment_id": 21,
				"body": "> [timelinehyperbot](#comment_53_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): question, is Twitter dead?\n\nI hope so.. Jackoff dorcey and I dont get along.",
				"added": 1543743839
			},
			{
				"comment_id": 22,
				"body": "> [timelinehyperbot](#comment_53_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): question, is Twitter dead?\n\nI want to put a rope to his nose ring and attach it to my car so he can get some good running exercise in the morning.",
				"added": 1543743929
			},
			{
				"comment_id": 23,
				"body": "> [futuretoast](#comment_21_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Twitter: Using 140 characters for either politics or shitposting. There is no third option\n\nI got banned for comparing David Hogg to a Pig. They told me I was promoting cruelty to animals. (This really happened!)",
				"added": 1543744022
			},
			{
				"comment_id": 24,
				"body": "> [futuretoast](#comment_23_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): My bad. I never really used twitter. I just watched the shitstorm from people trying to cram politics into such short posts\n\nTwitter sucks. I hated using it when I was on there. I have a lifetime ban.. And I will never use or promote any twitter account for anyone or any Business. Twitter is DEAD to me! And Jackoff Dorcey can take his SJW Nazi's and shove it..",
				"added": 1543744243
			},
			{
				"comment_id": 25,
				"body": "> [nootnat](#comment_7_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn): GODAMMIT PEOPLE, i don't really need the source of windows 10, even windows 8 or 8.1 would be good enough\n\nOk I have the compressed source code right here!  its super easy.\n\n(Shit Code!)  \n\nOk.. that was even more compressed than Steve Balmer at viking's game..",
				"added": 1543744357
			},
			{
				"comment_id": 26,
				"body": "> [futuretoast](#comment_26_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Make new twitter accounts and post actual mein kampf on half and then post feminist mein kampf (quick search sould find it) on the other half. Watch as half get banned. Guess which half\n\nThey do a phone number verify now.. I am out of numbers and they flagged all numbers that are on a rotating system such as google. They are locked down pretty good. However server side stuff I would love to look into. Nothing would be more fun than watching a dark twitter .com site.",
				"added": 1543744466
			},
			{
				"comment_id": 27,
				"body": "> [futuretoast](#comment_29_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Can you verify with google voice numbers? Spamming the dying remanent of google plus and twitter would be fun\n\nI  have tried that. They flagged me..  Unless they recently changed there settings. last time I tried was 3 weeks ago.\nI really dont want back on there system. I want to dos them so bad I could blow up the sun.. lol",
				"added": 1543744679
			},
			{
				"comment_id": 28,
				"body": "> [futuretoast](#comment_30_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Spamming feminist mein kampf on censorship-heavy websites.\n\nI took down Kieth Olberman..  lol  \nI totally destroyed him!!!",
				"added": 1543744771
			},
			{
				"comment_id": 29,
				"body": "> [futuretoast](#comment_31_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Well technically I'm not suggesting using their systems normally. Technically I'm suggesting abusing their systems. There has to be a way to do it. On some level they flagged some aspect of you computer. Different network with the operating system running from a vm and a browser you don't usually use should let you make fake accounts\n\nI have tried all of that.. They have a script file with there phone verifying system that has all of those numbers flagged. I was very impressed. They need a Loving Dos attack that has a nice rewrite to all there drives.. Its Format the servers time..",
				"added": 1543744925
			},
			{
				"comment_id": 30,
				"body": "> [quantumworld](#comment_29_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have tried all of that.. They have a script file with there phone verifying system that has all of those numbers flagged. I was very impressed. They need a Loving Dos attack that has a nice rewrite to all there drives.. Its Format the servers time..\n\nAnd there is a way to do it. Since all computer chips have a back door in them.",
				"added": 1543745016
			},
			{
				"comment_id": 31,
				"body": "> [futuretoast](#comment_33_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Nah. Cut the power to twitter hq. Deleciously evil. [...]\n\nOMG!! Stop it I am having visions of Jackko dorcey crying in the dark attached to a refrigerator magnet with his nose ring cause he cant see..",
				"added": 1543745103
			},
			{
				"comment_id": 32,
				"body": "> [futuretoast](#comment_34_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Also have it find twitter post, replace the words \"white people\" with \"the jews\". Enjoy tumblr going insane\n\nThats evil.. lol",
				"added": 1543745134
			},
			{
				"comment_id": 33,
				"body": "> [futuretoast](#comment_37_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): I dunno. I just gave up signing into anything that needed google captchas. So far I've lost my minecraft account and my playstation account to it\n\nI say do some html injections and see if you can bypass the captia. It may work...",
				"added": 1543745618
			}
		],
		"1543643463_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "Where do you put that in the jason file? beginning or end of file? Or does it matter?  Incomplete documentation can create a nightmare of future disasters.",
				"added": 1543743352
			}
		],
		"1543748754_17AsJmsopmitbtFzeEKZz9H7KBccu8rQQW": [
			{
				"comment_id": 34,
				"body": "The french riots will eventually sweep all across Europe. The globalist scumbags of the universe with there spy networks miss calculated how gullible people are. They don't have a Hitler like leader. All they have are what Hitler wanted during ww2. And the Nazi families tried to create what Hitlers ultimate plan to rule the world. It will fail spectacularly. The only thing that keeps them in power is the satanic blackmail and buying and selling of dead human flesh. And they expect us to look up to them and kiss there asses. I don't think it is going to work.",
				"added": 1543757887
			}
		],
		"1543749952_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 35,
				"body": "You are only doing that cause it has no captia on the site..  LOL...",
				"added": 1543758223
			}
		],
		"1543785759_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 36,
				"body": "You are actually getting spam in zero-mail?",
				"added": 1543787020
			},
			{
				"comment_id": 37,
				"body": "> [thunder33345](#comment_345_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): muting the user globally is the only option as of now sadly maybe there should be a persite mute\n\nMute would be a good option to have there. I have never gotten any mail yet. I don't even know if it works..",
				"added": 1543787081
			}
		],
		"1523804682_1FkxDSUsa4ex8zTQcrmdtm7oaGCUNjBh9F": [
			{
				"comment_id": 38,
				"body": "Jew That!!! LOL!!!",
				"added": 1543787182
			}
		],
		"1531170974_1CJUF6AFYnXkxGaLCTBo9iSMKxK7wkvoYD": [
			{
				"comment_id": 39,
				"body": "Hitler Was a Jew!!!",
				"added": 1543787255
			}
		],
		"1542317704_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 40,
				"body": "I just recently found out about zeronet. And I can say that the marketing of this site is horrible at best. This will change. The over all structure is there. This reminds me of the early days of Linux. Lots of tec stuff but not many users. Allot has changed, but we are not dominate on the desktop yet. Zero net needs help videos. And not just posted here but also on youtube. Ok we all want privacy however you can give up a little privacy to promote this. If you want more privacy just make another anon user acct. The developing direction is to clone the popular sites here on this platform.  \n \n\n[ It is anonymous, but when you so anonymous, that you have 500 users and possibly few potential readers (or none) of specific content, another level of anonymity is not to publish at all.Zeronet is like cell phone to buy only to check how long its battery is working and not to use it for calls. It seems like this place is only for IT developers, not for users. I wrote about that half year ago and nothing is changing.http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr/Lets+make+ZeroNet+the+most+popular+hosting+service]",
				"added": 1543787845
			},
			{
				"comment_id": 50,
				"body": "> [anonymouslogin](#comment_175_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): ... or use the shared anonymouslogin@zeroid.bit login account: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X/Anonymous+Login\n\nIsnt that authors address the same as everyone else that is using that same hashtag? And wont that also interfere with your existing user acct?",
				"added": 1543846323
			}
		],
		"1543791956_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 41,
				"body": "Zeronet needs more news sites. More alternative news sites. National news is generally garbage.",
				"added": 1543796143
			},
			{
				"comment_id": 42,
				"body": "> [ssdifnskdjfnsdjk](#comment_515_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Anyone can use forums to start publishing new topics which would be news events.http://127.0.0.1:43110/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/ - internet, computers news (NetTalk)http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx:pol:0 - Politicaly incorrect (Millchan board)http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AG3srDAxbDjXJBmdcSxCTb8GXpyVFhp6R:n:catalog - News, Politics, and Current Events (Millchan board)http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/ - many categories (ZeroVoat)I bookmarked a few forums and i am going to post topics there if i find some interesting news.\n\nFantastic Links..",
				"added": 1543796175
			},
			{
				"comment_id": 52,
				"body": "Ok, I am specifically looking for News/blogger journalism zites.  Only sites that are on Zeronet. I have run across a few but not many. And I know that there must be allot more out there. \nI just ran across this site that looks really current for searches and just about everything. \nhttp://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/?/",
				"added": 1543877423
			},
			{
				"comment_id": 53,
				"body": "> [eightyfour](#comment_42_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): If you're not shy to use the lamenet, oldnet, clearnet, whatever you would like to call it, I recommend Quilette and Spiked. FIRE is not really a \"news\" site, but they have some interesting articles. If you don't mind videos, Tim Pool does independent \"journalism\" (it's just, like, his opinion, man), he's certainly not always worth your time.\n\nTim Pool is good. But he is not here on zeronet yet that I know of.",
				"added": 1543877561
			},
			{
				"comment_id": 54,
				"body": "This zeronet reminds me of about how things were about 3 years after the world wide web was created. I love it, and finding things is like a needle in a haystack. And if we change some things we will end up with one search system for all Zites and I dont know if that is the best road to go down or not still.  \nI have some ideas on how to correct it but they can all be abused by someone.  (A master database of all zites that want to be included in a that list.) An opt in or opt out list. This list could be passed on to each node. Maybe this has already been done? And feel free to bash this idea into the ground if you think it sucks. I like to solve computer problems and not create a future disaster.",
				"added": 1543878063
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 43,
				"body": "> [korfa](#comment_1_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr): Thanks ssdifnskdjfnsdjk for banners.Zeronet's main sites have about 1000 seeders. This almost zero compare to clear-net, BitTorrent, Tor user count. I thing it risks to be overcomed by another project if it stays underground for too long time. Already now ZeroNet has perfect capabilities. It is necessary to define flawless functions and promote it. Time will show what functions in zeronet are needed. Nobody would know, let's say BitTorrent, if their creators would seek best possible functionality, universality or some other perfectionistic features to the end of time.What about web browsers. They face severe concurrence, and should be interested in adding new features. Why not ZeroNet? Let's say possibility for every user to create desk-board, with public links, personal information, blog and share it with other browser (and zeronet) users, friends. That would be just simple ZeroNet site. Just a little bit cooperation. Creating user friendly stile blog is not a big deal.Maybe it is not the best offer, and somebody else can offer the better one, but I think promoting is a good offer.\n\nZeronet looks like it would be perfect for News and news leakers. I have seen so many bloggers go down over the years and some even killed because of there news posting. Maybe I am wrong but decentralized news posting would kick ass. Plus whistle blowers would be more apt to leak.",
				"added": 1543806607
			},
			{
				"comment_id": 44,
				"body": "> [ornataweaver](#comment_84_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): I think we should begin with http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n\nNow how does that site work. It updates every time there is a new posting and puts it up to the top of the page? \nIf so what if there was lots of traffic on all of the sites wont that type of listing become impossible to use?",
				"added": 1543806729
			},
			{
				"comment_id": 49,
				"body": "> [vorticalbox](#comment_17_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L): Does it ever stop loading?\nHopefully you got to the full page. But it will send data out to you every time a site is updated.",
				"added": 1543841881
			},
			{
				"comment_id": 111,
				"body": "The Market is Maga. What is built here is perfect for spreading news and working with political parties. What ever country. I dont know if you noticed but everything is going down on clearnet. Eventually you will need to have a license to talk to anyone verbally. Oh ya they are going to go that far.  So this zeronet is about the best thing to counter it. Zeronet may save the world.",
				"added": 1546493733
			},
			{
				"comment_id": 198,
				"body": "Zeronet will hit peak popularity soon. I can see it happening. So far my testing of Zeronet shows that it is a very viable solution to replace the existing web. Some tweeks here and there need to be made but over all it looks very solid. Better help with videos to explain Zeronet in multiple languages would break that \"What the heck is this?\" wall down to a zero level and everyone will grasp the concept of it. Everything else will fall into place as this network grows. The amazing potential of Zeronet is staggering to think of.   Lets all use this for the benefit of free speech.",
				"added": 1548941305
			},
			{
				"comment_id": 206,
				"body": "Minds was interested in moving to Zeronet. One of the developers is working on a project that may include Zeronet. \nSome one here may know more about it than I do.",
				"added": 1549117404
			},
			{
				"comment_id": 208,
				"body": "> [nickwa](#comment_30_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): The creator of Minds is also considering DAT I heard in a interview. He is considering all possible decentralized options.\n\nMinds.com has new post data flow problem that has not been solved and it is really annoying. Same content over and over and seems to be stuck for a 24 hour post cycle. The only real time new posts is when you search for it manually. Zeronet is more up to date than minds is on new posts. Just another reason why zeronet is the future.",
				"added": 1549205105
			}
		],
		"1535881177_147dKWfEsmiinRTaUvoY3gXWXyk1gmZdtL": [
			{
				"comment_id": 46,
				"body": "The Creator Of ZeroNet Tamas Kocsis Ted Talks\nhttps://www.ted.com/talks/tamas_kocsis_the_case_for_a_decentralized_internet#t-583793\n\n#news #ted #infowars #maga #trump",
				"added": 1543809309
			},
			{
				"comment_id": 47,
				"body": "> [leftside](#comment_380_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): what did he say?\n\nWatch the video.. Its only 9 min and very very good..\nZeronet will get allot more users to its site very soon.  Maga will be moving here.",
				"added": 1543814303
			}
		],
		"1543809355_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 48,
				"body": "> [ssdifnskdjfnsdjk](#comment_516_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Video also on ZeroNet here\n\nPlease post this video on social media sites that are on the clear-net and link to zeronet \nhttps://zeronet.io/\n\nMarketing Open Source Projects is a Users Job.",
				"added": 1543841752
			}
		],
		"1543914606_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": [
			{
				"comment_id": 55,
				"body": "I am lost what you maintainer. Do you own the site?",
				"added": 1543969776
			}
		],
		"1543909269_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 56,
				"body": "leftside that site must be a sandbox. ?  Or an example site.",
				"added": 1543970379
			},
			{
				"comment_id": 57,
				"body": "> [leftside](#comment_389_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): A kind of mirror site.. It's like a tunnel between zeronet and clearnet...Neither sandbox or exmaple site at all.\n\nTrying to wrap my head around the way zeronet works is a trip. In theory does anyone know how big zeronet really is? As I look at well over 1300 Chinese peers.",
				"added": 1543971288
			}
		],
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 58,
				"body": "I have never used Tumblr. I never thought they were worth bothering with signing up.",
				"added": 1543981819
			}
		],
		"1544639635_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 59,
				"body": "> [trenta3](#comment_74_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Each of the people who have downloaded (accessed) ZeroHello has its own local copy (even you), so it cannot happen, because from now on you will have that exact site in your computer folder. Other peers are only necessary when updating the site in order for the update to propagate, but they do not influence if the site works or the content that are already stored in it.\n\nSo what is the best solution to run your own site if you half to do a computer shut down or go off line for a short time. Ask for people to clone your site? (Mirror ) Clone does mean mirror correct?",
				"added": 1544643445
			},
			{
				"comment_id": 60,
				"body": "> [tusiko](#comment_19_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): Zeronet is growing and growing. In my eyes it is impossible and really a theoretical question. If they are no peers, I think you have just a Zeronet server because you are alone. With just one other peer you have a Zeronet. That is only my thought.\n\nHow big is zeronet? Any ideas?",
				"added": 1544644470
			},
			{
				"comment_id": 62,
				"body": "> [james007](#comment_191_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Probably not fully possible to know without crawling the network, but I'm seeing around 3k users on the ZeroHello Stats page right now.\n\nI would love to crawl all the English ones. I have a bunch of ones from China. Its allot lower than a month ago. I had some downtime from zeronet.",
				"added": 1544654464
			}
		],
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 61,
				"body": "I hit the update button and this was several weeks ago and it totally wiped out zeronet after a network error. My .jason user file was totally deleted. Noting was really lost. I will only believe official releases from the github site.",
				"added": 1544644730
			}
		],
		"1544661120_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 63,
				"body": "We all know that it is most likely a communist plot to take over everything and create a centralized Nazi system for Zpoo JinPlop. Personally I think that 80% of the world needs to be turned to glass anyway.  Most people are scum and don't deserve to be breathing the same air as I do at this time. I am sorry if I sound too positive for people.",
				"added": 1544670885
			}
		],
		"1544866769_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 64,
				"body": "Some one needs to post this on Zeronet. Maybe there is some one from there that can get some content up. I want to see what this network can do with News sharing. Can zeronet beat the internet on things.",
				"added": 1544873442
			},
			{
				"comment_id": 65,
				"body": "> [znnex](#comment_5_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Seems there are as many explanations of what the yellow vest thing is about as there are yellow vests. Mostly based on imaginary bullshit and lies.\n\nLibTards Love there dam handouts but when they stop giving them to you because they demand work you will end up at a firing lineup. Communism has never worked. Looks great on paper but in reality it is hell on earth.",
				"added": 1544891555
			},
			{
				"comment_id": 66,
				"body": "> [deafboy](#comment_65_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa): You don't fight for freedom and justice. There is no movement. Only propaganda.If you really want to make a difference, stop funding the government and provide better services.\n\nThat is the dumbest thing I have ever read. Either you are a poorly programed bot or you are one of the dumbest humans alive on earth. lol",
				"added": 1544891661
			},
			{
				"comment_id": 67,
				"body": "> [znnex](#comment_5_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Seems there are as many explanations of what the yellow vest thing is about as there are yellow vests. Mostly based on imaginary bullshit and lies.\n\nIts called 100% tax on everything with nothing in return. Expect the revolution to get really hot globally. Its about time to take these Communist sob out of existence.",
				"added": 1544891762
			}
		],
		"1544911802_14cqdxte9VRXGe4WYEY49Htx1HxUqKNGrP": [
			{
				"comment_id": 68,
				"body": "I have not seen to much on here.  Maybe they were removed?",
				"added": 1544912134
			},
			{
				"comment_id": 69,
				"body": "Sex should be done in a test tube and that will eliminate all negative stereo types about sex. And castration should be mandatory. Then we can be merged with China for a Communist utopia with a social scoring system that will measure your worth to the communist utopia.  All workers k can be paid the same amount of money for fairness. And they can also live in a 50 square foot house. Just a little bigger than a coffin. And people that live over 30 years old can be recycled for animal food products for the betterment of the useless eaters.  Oh the great Communist dream! \n(Oh shit!!! I Just had another Twitter flashback...)  (Jackko Dorcey is in my head!!)",
				"added": 1544918645
			},
			{
				"comment_id": 70,
				"body": "> [pussyslayer](#comment_4_15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k): Test tube porn is hot.\n\nhttps://www.youtube.com/watch?v=OVnmIbzExOA",
				"added": 1544920310
			}
		],
		"1544899392_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 71,
				"body": "> [timelinehyperbot](#comment_87_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Check your virus / firewall software... perhaps something is being blocked.\n\nThings are speeding up now. I have noticed that I keep getting a broken pipe error line 40. May be related. \nI use Linux so virus spyware are usually not a problem.",
				"added": 1544925558
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 72,
				"body": "Content is King! When Zeronet gets people that have large numbers on the clear web and they post on zeronet.  Like Zeronet may be perfect for News sites. You know the ones that get taken off the web because they broke a News story that got the Gov all upset!  Snowden like  news. Things like this will draw massive traffic to zeronet. But this is just one angle. Marketing zeronet on clearnet is a key component.",
				"added": 1544979447
			},
			{
				"comment_id": 74,
				"body": "> [1pgallery](#comment_41_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): That's a really good point. Wikileaks, Veritas, etc. would benefit from using p2p serving and would draw a large audience. [...]\n\nI may role out an infowars site. Guaranteed he would get this place hopping fast. Average viewership on one of his shows is about 9 million or more. Also the founder of zeronet would be a great guest on his show.  \n(I Have Friends In High Places!).. I bet I can swing this one..",
				"added": 1544990286
			},
			{
				"comment_id": 78,
				"body": "> [tusiko](#comment_28_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): This question I asked myself several times here. Why do users copy/clone so much zites? I only need one video portal, one board and one Zerome. A second versions make only sense with a big benefit or difference to the \"old\" one. Too many zites with similar content confuse the users.\n\nI totally disagree. Then you have a centralized system again and if anything happens with the code it will break for everyone. The more the better in my view. Same goes with Linux. My god if we never forked a Linux distro we would all be sitting in a green screen command line right now with no gui's.. Sad but true..",
				"added": 1545006008
			},
			{
				"comment_id": 79,
				"body": "What is really lacking right now is Zeronet help videos. Want allot of views? Make a zeronet video on youtube or any other video platform site. My last search of zeronet help videos showed many about 3 years ago. And many of them were really poorly made.  (Dont wing it on a video as a first time run though.) Many of them had some blatant technical errors in terminology and usage.  If a Big site promotes zeronet we all need to be prepared to point them to some help videos to save time.",
				"added": 1545006253
			},
			{
				"comment_id": 80,
				"body": "> [tusiko](#comment_31_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): The consequence is that you have to search on many places to find your thing. That is annoying. And in a decentralized web nothing can be centralized. That is impossible.Linux has many problems with all of the forks. Ubuntu itself has coding problems. And Ubuntu itself deleted many old drivers. What happens now? Every distro, coming from ubuntu, has the same problems to solve. That is a bad way. If you like to see a smooth system, give a look to OpenBSD, which is small and fast (server). Actually there are too many different Linux systems on the market. Many users are going to the BSD's because of less forks. I went away from all the *buntus and friends many years ago.BTW: The first Desktop environment was the Apple Lisa 1983. Microsoft started 1985 a desktop. All before Linux was born.\n\nWell we have another fork that runs rpm's and that is from fadora, or redhat. There are choices out there. All of the Linux distributions are better than Windows and mac in my view. None are perfect.. Yet!.. The best gui was kde version 3.7 but they killed that one. It was before the time we invented the fork. Linux is a work in progress. New coders of Linux usually end up with a systems that looks like Android. A Linux back end coded like WinBlows. Anymore it seems that we are just coding to just code and not sticking with the things that work the best. Gnome 3 for example is a wasted mouse movement gui dragging program. Looks great, but not very functional over long term usage.",
				"added": 1545008272
			},
			{
				"comment_id": 117,
				"body": "> [zacx](#comment_1_1KXNBEmdA39rWt1PGnN5eGNQtA96MheNPt): Y E S\n\nBuild everything on Zeronet. The traffic and users will follow. They are censoring right wing and left wing now. Perfect timing for zeronet. You cant get a better situation to grow this network.",
				"added": 1546578591
			},
			{
				"comment_id": 118,
				"body": "> [eightyfour](#comment_47_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): This. The growing climate of censorship will lead to increased interest in censorship-resistant technologies, but don't let that lead you to inaction! There's still much to be done! As clobersontheman said: explain the importance of such technology and how it works to friends and family, and help foster a welcoming community on ZeroNet for newcomers. Original content, either mirrored (by author or endorsed by author) or even exclusive content, would be a great boon. One major selling point to OCs is that there's little competition on the network and their name will be immortalized in the history of ZeroNet. (If ZeroNet fails to become \"the\" censorship-resistant network of the future that might not mean much, ... but there's got to be creators willing to take the risk!\n\nI am one of those content creators. I wont just tell you how this works, I will just show you how it works.\nJust keep that zeronet app buzzing and we are going to change the world together. One zite at a time.",
				"added": 1546645180
			},
			{
				"comment_id": 119,
				"body": "Zeronet is built. It's ready! And its here.\nPeer to Peer Internet. \nJoin Us On Zeronet.\n\nhttps://zeronet.io/\n\nThere will be some huge info drop on zeronet. This will include basic usage and terminology usage names and functions. Building Zeronet Web Hype is the answer. Take these marketing ideas and use them. \nZeronet will get some big time players to join this network that will help promote it to massive scales possibly beyond anyone's expectations.\n\nZeronet is the future of News. \n\nThe only thing holding back Zeronet is the marketing of Zeronet\nZeronet Needs multiple Promotion video's. Not from just one user but from as many users as possible.\n\nRemember that you are the Zeronet marketing team.\n\nIdeas for a video.\nWho is your target audience?  Everyone who has been censored. \nVideo should include the problem reaction solution to global information tyranny.\n\nProblem. \nGlobal Censorship\nReaction = Build a new uncensored open source network\nSolution = www.Zeronet.io\n\nCreate Accurate Zeronet Help Videos.  (I have seen several zeronet help videos on youtube and they all sucked.)\nPosting about zeronet.io on other social media sites. (Twitter facebook minds gab and so many other sites.)\nTalk about the terminology cross over.  Website = zite on zeronet.\nPromote that it is Open Source.\n\nAdd what ever technical expertise you have behind zeronet and make it easy and simple to understand.\nThink of taking to a first time computer user and you will not leave anyone out.\n\nLeave more of the technical stuff here in zeronet.\n\n(Just be prepared to answer lots of newbie questions when zeronet gets a flood of new users.)\nAlso ask for feedback from users first experience with zeronet. \nThis will help us with promoting a first time zeronet walk though on future help videos promoting zeronet.\n\nPlease use this as a template guide for marketing Zeronet. I have used this template before with other social media sites and it has done very well.",
				"added": 1546648378
			}
		],
		"1544944813_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 73,
				"body": "Well when they actually make a Linux installer program that will work on deb distributions they can sit there and do nothing. You cant expect everyone to down load source code and find all the dependencies just to get the program to run. Looks to me like it was made for mac and they did a horrible port job for Linux and Windows. \nIf you want people to use your software get serous about making it easy to install with all computer platforms. \nAnd it is usually these same lazy coders that complain and say no one uses it on X platform. When in reality there installer was so bad it only worked on 4% of the machines out there.",
				"added": 1544980142
			},
			{
				"comment_id": 83,
				"body": "> [timelinehyperbot](#comment_91_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Yes there is a fundamental difference...  Traffic of people who would initially come across your content.  If no one see your .dat website as there is NO community of people who are simple just checking out new stuff it becomes a REAL issue...  With a .dat website the other people who visit do not automatically mirror / seed your site...  Your computer needs to be on 24/7...   [...]\n\nThis executable python code effects all systems? or is it just Windows? I am sure python code executable restrictions can be created.",
				"added": 1545105281
			}
		],
		"1544990520_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 75,
				"body": "> [timelinehyperbot](#comment_92_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): I do not believe there are any sites that can do what you are asking.   Keep in mind not everyone want to host huge files...  A single 4GB file is huge and would take up 4GB on every computer being a seed.   Plus the bandwidth that people have is also an issue...  You really are better to setup a .torrent file and have it hosted on a standard torrent tracker...  Simply post your .torrent file for people to download and let them download from a proper torrent tracker(s).\n\nThanks! That would solve the problem then.",
				"added": 1544995049
			}
		],
		"1544935619_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr": [
			{
				"comment_id": 76,
				"body": "Gnu started it all. As far as a stupid degree in creating software. Please some of the worst programmers I have ever seen have degrees in C.S. And leave the dam politics out of coding or we will all end up some day with a dead computer because you said something not politically correct. Its bad enough now with the hardware back doors that we cant change. \n\nhttps://www.gnu.org/gnu/thegnuproject.en.html",
				"added": 1544995773
			},
			{
				"comment_id": 77,
				"body": "> [nathanking](#comment_10_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr): Even Khan Academy promotes fake liberal neutered history. Math is the only uncompromised science as far as staying disconnected from \"evolution\" and social justice. Just looking for a good place to begin a education system that is accessible and affordable and allows for credits toward a degree or certification. Homeschool style truth filled learning platform.\n\nIf we allow liberal logic to write code then all the code will fail because of projected results on an arbitrary argument.\nThey do not use logic. Like there latest attempt to force bad code to be put into an operating system because the programmer was a sexual minority. I don't give a dam who you are if you cant write good code it should be tossed out for the better code. This also includes me. I wright really bad code sometimes. Politics should remain out of programs in general.  Unless you want a dead computer some day. \n\nJust imagine your computer one day saying that it was offended by that command you just typed and thought you were being insensitive and will give you a time out break before you can use it again. Lets not go there..",
				"added": 1544996254
			}
		],
		"1545098151_1L8SDzP2j7rwvz2moKzQyaoHwteL6C2bGq": [
			{
				"comment_id": 81,
				"body": "That is a really good question. I would like to know more about the technical side of what a hub is. It just sounds centralized to me.",
				"added": 1545104728
			}
		],
		"1545089798_1AfNyKnFMkYqHQRKB4C9wiKnoM3eTXXXTQ": [
			{
				"comment_id": 82,
				"body": "> [1pgallery](#comment_43_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): Goto the homepage (zero/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D)Click on \"Files\" there is a setting in the top right corner to edit optional file limit.\n\nYou NAILED IT!!! Good Job!!!",
				"added": 1545104781
			}
		],
		"1545156874_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": [
			{
				"comment_id": 84,
				"body": "They can also hack your computer from the power lines. And also from the internet and even cell towers. The computers are all compromised and nothing is private when you use them. Limited safeguards like using Linux reduces some of the software back doors but there is always a way in. Saying this is not to discourage you but it should encourage all of us to support open free hardware designs and free software open source. Until then we are all feeding some gov agency data that they will use to control us all. I have personally seen every back door system deployed. Its amazing, and it is very disturbing. There is a very strong possibility that some one will create a program that will exploit all hardware systems and will shut down everything globally. This would probably include satellites as well.  The lesson is simple. Never put in hardware back door's. If you want to know more about the hardware back doors go to vault7 and start reading. It only covers about 1% of the back doors.",
				"added": 1545157493
			},
			{
				"comment_id": 85,
				"body": "> [tusiko](#comment_35_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): ZeroNet is no darknet. I cannot recommended to downloads big files/torrents, especially when you are connected over tor. In Tor itself the users are warned not to do this, because you can be identified. With Zeronet over Tor the security is a little less than Tor only.  I would say that it is not magic, if anybody could trace you in Zeronet. [...]\n\nFreenet is so slow!!!!  Waiting 9 hours to get to a site is absolutely insane. I calculate that they are basically running at less than 300 baud.  They can speed it up without compromising security. I think they are using some really poor software designs. The over all concept is good.",
				"added": 1545160209
			}
		],
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 86,
				"body": "> [james007](#comment_194_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): quantumkitty \n\nA Decentralized Internet is far more important than just another robot. (Yawn..!) Sorry I am so bored with AI and Robots.. And if the two technologies merge together we would end up with a really stupid machine. \nZeronet is just one of the future players. You know it is good when they try to down play its usefulness on the web.",
				"added": 1545183471
			}
		],
		"1545106555_1NPaMdmTDg441cn76DGdUjz5ZXeVTPfWfx": [
			{
				"comment_id": 87,
				"body": "> [timelinehyperbot](#comment_97_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Yes, I am running into that issue bringing my Gab bot into the market place. [...]\n\nZeronet should be put in a container. In fact I may try doing just that. I do not think that there is any way a python script could attack anything when it is in a container. Windows users wont have this advantage until they boot into there Linux partition.",
				"added": 1545183934
			}
		],
		"1545615413_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 88,
				"body": "Both machines would digitally implode into a giant Zero and would never be seen again.",
				"added": 1545703058
			},
			{
				"comment_id": 89,
				"body": "You should test it on a junk account.",
				"added": 1545703106
			}
		],
		"23203_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 90,
				"body": "Nice bad link. I can make better ones myself.",
				"added": 1545720886
			}
		],
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 91,
				"body": "I Second That!!  With changes like that zeronet will grow faster with more Zites (Sites).",
				"added": 1546010064
			},
			{
				"comment_id": 92,
				"body": "> [hexator](#comment_3_19QqkMzxHiqFspHtQhDpNFkD3FYDuTcGWC): All of those are good ideas for the most part, but to do them properly might be difficult without rewriting large sections. [...]\n\nThis program is not coded to be modular?",
				"added": 1546010300
			},
			{
				"comment_id": 93,
				"body": "> [thunder33345](#comment_375_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): Thanks for the constructive criticism, zeronet needs it to grow and improving and also to stop this begin just another echo cave with everyone blindly saying how good zeronet is without considering it's flaws, hope that this wont be just a 1 time throw away account [...]\n\nYa Cool then we can get a cia agent in there that can play gate keeper for all the information they see. FUK THAT IDEA!!!  Sorry this concept is severely flawed in technical issues and allows central control of data that could be used against all users for political purposes and for data manipulation of others.  User should and always be the final decider as to what they want to view. And Not the other way around.",
				"added": 1546010766
			},
			{
				"comment_id": 94,
				"body": "> [zeronetisshit](#comment_24_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): @quantumworld Right, I don't like block-lists, word filters, or @thunder33345 's idea (didn't read your whole post, sorry): [...]\n\nThe scum at langly or they may even be from China dive into new open source projects and want to engineer a Digital communist data collection and censorship system. It will be exposed and it will fail due to its drawbacks and limitations and over reaching data authority over users systems.",
				"added": 1546011831
			},
			{
				"comment_id": 101,
				"body": "> [hexator](#comment_5_19QqkMzxHiqFspHtQhDpNFkD3FYDuTcGWC): One idea I had was archival stores using cloud storage. [...]\n\nCloud storage defeats the purpose of a p2p network.",
				"added": 1546160377
			}
		],
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 95,
				"body": "> [anonlogin](#comment_4_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU): Coordinating an username standardization is quite difficult. I think it is better to use these accounts randomly. [...]\n\nYou can run multiple zeronet accounts if you have them all in separate folders. You can only run one at a time. However it may be possible to run more than one instance.",
				"added": 1546012115
			},
			{
				"comment_id": 150,
				"body": "Zeronet needs an anonymous posting option built in. It is to easy to wipe out zeronet user accounts.",
				"added": 1547432362
			},
			{
				"comment_id": 154,
				"body": "> [quantumworld](#comment_95_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): You can run multiple zeronet accounts if you have them all in separate folders. You can only run one at a time. However it may be possible to run more than one instance.\n\nHow can you run more than one instance? Let me guess change the port number? Cant be that easy..",
				"added": 1547573142
			},
			{
				"comment_id": 156,
				"body": "> [bananon](#comment_6_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): Yes. Strange that we do have PoW-based certificate authorities (CA), but no PoW-based user certs, that will help a lot in this. Give ZeroNet site developers that fucking choice at least. No one will use PoW-based CAs ... it serves little purpose and once it has been generated that CA can generate an unlimited amount of users... good prioritization and solution @nofish\n\nI totally agree that the Zites can allow or not allow anonymous postings. But an option either way would be nice. However it could also be a total nightmare. Depending on the user base.",
				"added": 1547576627
			}
		],
		"1546021672_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 96,
				"body": "I would go more radical to fix this problem and also the most brutal. Back up your site on another device. Check the file contents. Then remove the full site and rebuild it from scratch.",
				"added": 1546024812
			},
			{
				"comment_id": 97,
				"body": "> [korfa](#comment_13_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr): Thanks ssdifnskdjfnsdjk, quantumworld. I think I shall try to make new forum.\nGood idea. If it blows up to bad make a new one. By the time you figure out what happened you could have made 20 new zites. Backup your zeronet files daily to potentially avoid future glitches.",
				"added": 1546029121
			},
			{
				"comment_id": 173,
				"body": "korfa Please post your new site when you get it working.",
				"added": 1548796806
			},
			{
				"comment_id": 197,
				"body": "> [korfa](#comment_14_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr): The new zite http://127.0.0.1:43110/19PQhGu5QbyrH5EpfmqWaRAXciA6HAsb57/I would appreciate if anybody would test it. It should work.\n\nIt loads but you have no new posts.  When you start posting I will clone your site.",
				"added": 1548926626
			}
		],
		"1546138183_12NqXRG5Ur6HzBsgR2kgPxmcWGhR9sxSLi": [
			{
				"comment_id": 98,
				"body": "You are on an open source network of a decentralized torrent. All websites/ Called Zites are hosted on network users computers.  To save time just think of it as AMAZING KICK ASS SOFTWARE!!! Technically these sites do not exist to the known web universe. And it is good enough to be used to break through China's firewall. (Tor) Included. \nThis is the next best thing to the internet. (If You Are Not Excited Now You Just Don't Get It.)",
				"added": 1546156720
			},
			{
				"comment_id": 99,
				"body": "> [moor](#comment_82_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what part you don't understand? check out this zites if you want to understand zeronet better:The truth about ZeroNetImportant ZitesZeroSites\n\nSome one did that \"The truth about ZeroNet\" in Emacs. \nI can just feel that Emacs vibe Of OmFG!!! WoW!!!! and OmFG!!!!  WTF Just Happened!!! \n(Sorry Its Just a Lisp Joke))",
				"added": 1546156993
			},
			{
				"comment_id": 104,
				"body": "> [brutusthebritish](#comment_4_1JFAYb8MxcPAMjUbMopSKA1gVKSWs6d2HZ): Don't know m8, it's weird\n\nZeronet is a torrent network. De centralized.  I think the concept of how this all works is blowing peoples minds.\nZeronet will be the next biggest thing. Or a fork off of it will be.",
				"added": 1546316832
			}
		],
		"1546142431_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 100,
				"body": "For now ignore it. I have been having the same sort of error since i started using zeronet. I am sure it is something like the files from site x are not there and it is just dropping the connection. I could be wrong and there are some very  good tek people here that could explain what is happening with that data output spiew.",
				"added": 1546157719
			}
		],
		"1546220889_1JFAYb8MxcPAMjUbMopSKA1gVKSWs6d2HZ": [
			{
				"comment_id": 102,
				"body": "The video site stuff I have not tried using yet. And the main stream movies are all total junk not worth investing your time to watch or even pirate. A counter to youtube is a nice thing. I wonder how solid it is to work with?",
				"added": 1546229270
			}
		],
		"1546228429_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 103,
				"body": "Please define your program a little more. What exactly is it? What does it do? And how will this benefit people?",
				"added": 1546229469
			}
		],
		"23366_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 105,
				"body": "Why do I think that this story is pure made up B.S. Dark Web Definition is that it is any site that is not searchable by a search engine spider bot.  That is allot of computers. I think the dark web is more of a media hype than actual facts.",
				"added": 1546467610
			}
		],
		"1546466091_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 106,
				"body": "This site requires a log in to use it. And does not allow you to log in. Either a bug, or I got some bad files. Great idea don't like the log in part at all to use it.",
				"added": 1546467876
			},
			{
				"comment_id": 109,
				"body": "> [klu9](#comment_23_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I thought so too, because I was looking for a widget in the top right of the page. But then the second time I loaded the page I noticed the big \"Click Here to Log In\" text in the middle of the page above the url entry box and then I could shorten my URL.\n\nOh never mind. They did not code in a graphic button for the LOG IN.  \nThat will loose about 90% of users right there. I still dont like the log in to use it.",
				"added": 1546469785
			}
		],
		"1546444609_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 107,
				"body": "> [klu9](#comment_20_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): It's official: I'm old :) By the way, that's what ZeroNet reminds me of: the Net (WWW & Usenet) in the 90s. Small communities, simple low-bandwidth pages, waiting for media to load (not quite line-by-line like boobies.jpg from alt.pics.hot but almost), all kinds of crazy shit out there. And no advertising.\n\nPunch Cards RULE!!!!!  It's Better than the Iphone and more secure.",
				"added": 1546468057
			}
		],
		"1539548272_1BDapygZHNG8GxEuSsEpK9Xipm9mFfW1F2": [
			{
				"comment_id": 108,
				"body": "Pass the link.",
				"added": 1546468368
			},
			{
				"comment_id": 110,
				"body": "> [homegrown](#comment_8_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX): Here are > quantumworld: Pass the link. [...]\nThe site looks like it is still being developed. Hopefully they can get the security side of things locked down.",
				"added": 1546478614
			}
		],
		"1546299446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 112,
				"body": "Virtualbox a Linux distribution on your windows system and install it. You will really like it. Once you learn how easy it is to use you can create a dual boot system and keep your windows around if needed. Then run zerotalk on Linux. It will be about 80 % faster than your current system is now. You can find Linux versions here https://distrowatch.com/ Its well worth your time to learn Linux. \n((Rumor!) Microsoft is about to buy there own Linux Distribution.)) (((Cononical)))) You heard it here first.",
				"added": 1546503743
			},
			{
				"comment_id": 113,
				"body": "> [robione](#comment_137_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): There will be a massive exodus from Ubuntu like there was from Github.\n\nHow many left Github? I have not been active on github at all.",
				"added": 1546505240
			},
			{
				"comment_id": 116,
				"body": "IBM Now Owns Red Hat. I am not to worried. Making money on Linux is not easy to do. Unless you are Red Hat. There business model is the best so far for open source.",
				"added": 1546528224
			}
		],
		"23374_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 114,
				"body": "News Article translation. Help us spy on other bitcoins so we can track them and further remove your privacy from any kind of electronic transaction. Are we that stupid?",
				"added": 1546505430
			}
		],
		"1543955963_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 115,
				"body": "> [nekololi](#comment_321_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): if you drag the 0 icon to open that gui menu (by the way, dragging an innocuous \"0\" is not a good way to open a menu or a sidebar, nofish), right above where it says \"This is My Site\" there is a field that says \"site address\", and there it is.\n\nOh WOW!!!!  Really cool, and really not intuitive. There needs to be an arrow icon there to let you know that it does more than just an icon. Its little minor missed things like this that are annoying. Other than that it looks really cool.",
				"added": 1546522361
			}
		],
		"1546990353_1HDmyQsAC4ngUqrGWjqAWbjYBzn2AGY3T": [
			{
				"comment_id": 120,
				"body": "Free speech is not allowed in the E.U. Only muslim law is allowed. Just kidding. Its very good in a way that they are cranking up the oppression systems. More people are waking up to the NAZI Antifa's were really the Nazi's all along.",
				"added": 1547022256
			}
		],
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": [
			{
				"comment_id": 121,
				"body": "There must be a way to fix it. China has so much opposition to xi who wants to start a nuclear war with the United States.  Xi is out of his mind and needs to be removed from power.",
				"added": 1547022370
			},
			{
				"comment_id": 122,
				"body": "How are they able to block zeronet from China? I think this problem is a design flaw that needs to be addressed by Zeronet and needs to be fixed. How about a random port system that will flip ports around when connecting with another zeronet user. Or a proxy system that will hide peoples ip addresses and encrypt all data. The fact that Zeronet is being blocked from China just means that we do not have a network that cant be censored. This needs to be technically addressed as a major Zeronet design bug.  I am still a newbe zeronet user but I have a very strong technical background.  Lets all get working on creating a stronger p2p network that no one can shut down.\nThink of random port scaling and zeronet program masking.",
				"added": 1547077563
			},
			{
				"comment_id": 125,
				"body": "> [zeronetisshit](#comment_49_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): zero.booth.moe\n\nThings like this need to be addressed. I do not want to be reliant on just tor for privacy on a p2p web. I know there is an i2p as well. I would think that zeronets goal would to make this p2p near bullet prof and to create solid code that would make zeronet impossible or near impossible to break.\nPlease post more on vulnerabilities of zeronet so that these issues can be addressed as Bugs and get them fixed. And we need some testers to try to break zeronet and look for vulnerabilities and fix those bugs. I know that this will be an ongoing process. However the more people who get involved here with zeronet the more likely the success of this project. A reliable unbreakable encrypted P2P network is needed now more than ever globally.\nI think of this as the digital future of the planet. (Now I need to learn python!)",
				"added": 1547084104
			},
			{
				"comment_id": 126,
				"body": "> [redlibertyreal](#comment_4_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): redlibertyreal\n\nPlease post your Zite or blog.",
				"added": 1547103476
			}
		],
		"1546939398_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 123,
				"body": "Why cant all traffic be encrypted using this same protocol?",
				"added": 1547077987
			}
		],
		"1547077889_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 124,
				"body": "> [ssdifnskdjfnsdjk](#comment_618_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think SSDs are OK and i doubt it will wear anytime soon when used by zeronet. I read to enable TRIM feature in operating system which can increase life of at least of some SSD drives.\n\nI don't use Windows at all. I use Linux or bsd or a mac. Windows is not secure. You cannot check to see if there is a software back door in the operating system since it is all copy righted and would violate there terms of service on there software licensing agreement.  Not saying that Linux is better but you have at least a chance to see the source code. Neither operating systems can stop the hardware back door either though the internet or a digital signal from the power line to your digital power supply on your device.",
				"added": 1547080781
			}
		],
		"1547226852_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 127,
				"body": "Android is totally unsecure. Its to much like Windows. And I really don't think that you can secure it without replacing the entire os.  If I am wrong please let me know and link to how it can be fixed.",
				"added": 1547227654
			},
			{
				"comment_id": 128,
				"body": "> [styromaniac](#comment_404_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Replicant OS [...]\n\nHave  you tried it? Does it work?",
				"added": 1547228135
			},
			{
				"comment_id": 129,
				"body": "> [styromaniac](#comment_405_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I haven't, but I would hold out for Purism's Librem 5, because the entire stack will be open source firmware and software, full blown Linux, not Android. [...]\n\nMy device is not on that list. However installing a full blown Gnu/Linux system on a tablet sounds fantastic.  I was on the Dev team for Android for about 3 weeks in the very beginning and left due to there design influences from the Windows O.S. I really think that Android was a backdoor creation of the CIA or NSA. I cant prove this. However looking at the code, well it kinda speaks for itself doesn't it.",
				"added": 1547229122
			}
		],
		"1547147759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 130,
				"body": "> [styromaniac](#comment_411_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I kinda wish ISPs had a DIY route. I don't know how \"installers\" can even say they have a career. Mail the modem and the customer could do the rest.\n\nMost people are total idiots that's why. I would bet that about 40% of the us population have a very difficult time trying to plug in a device into a wall outlet. Most live out in the west coast and have an average iq of about 40 and can only talk in unison when programmed by there handlers.",
				"added": 1547232996
			},
			{
				"comment_id": 131,
				"body": "> [styromaniac](#comment_412_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's worse than that. It's all over the country. So, I'm in Michigan and I don't see a correlation to geography nor politics. My family makes me facepalm over these things. Most people would perish if the slightest IT or home theater knowledge was required of them to survive... or we'd be paid handsomely to help. [...]\n\nAnd never tell anyone that you repair windows computers. People are lazy and stupid. I don't totally blame them its the shit we are eating and the crap they put into the water. My view is that we are in a slow alien takeover of the planet by some Really Dumb Fucking stupid off world aliens. Sounds crazy doesn't it. It may be true.",
				"added": 1547233995
			}
		],
		"1547238715_1P2V8C9A6T8ExWibrWqPdLoBnm5DnKMQe9": [
			{
				"comment_id": 132,
				"body": "Please be more specific. For example the best privacy tool is the hardware off switch and remove power from device. So far this method has never been hacked. And it is the most effective against any kind of attack.",
				"added": 1547239810
			},
			{
				"comment_id": 155,
				"body": "> [ssdifnskdjfnsdjk](#comment_640_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Even in case of SafeBrowsing protection being enabled, FIrefox should not be sending any sensitive data per this article: https://support.mozilla.org/en-US/kb/how-does-phishing-and-malware-protection-work [...]\n\nI don't trust any of the browsers. I have done some tests and they all seem to leak data out from somewhere. Tor is the best but not perfect. I think full re writes is the only way. I hate to say. Maybe I am wrong.",
				"added": 1547576345
			}
		],
		"1547116590_1CLJe3JkvyEvKx814zndA1HAn6Sf4ZnaFg": [
			{
				"comment_id": 133,
				"body": "> [ssdifnskdjfnsdjk](#comment_620_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): yes ZeroHello and into field \"Search in connected sites\" paste:searched phrase site:zerotalk [...]\n\nI had no idea it would search all sites you had visited. That is correct it will search everything you have visited??",
				"added": 1547240906
			},
			{
				"comment_id": 138,
				"body": "> [ssdifnskdjfnsdjk](#comment_630_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): it will search only sites that:1) has database (not a plain HTML site) to see if site has database, open site menu by moving the (0) button in site corner2) has compatible database structure (i believe), for example clones of zerotalk, zeroblog, zeromethere can be other conditions which i am not aware about \n\nI think that Zeronet needs to have a Zite list file that all peers would pass around that had a listing of all zites. The file could be searchable. Kinda like a crude search. This would be for only published zites that wanted to be on that list. Maybe this is already being done or has been done in the past. The reason to use this would be to speed up searches for new Zites that would go public online.",
				"added": 1547247058
			}
		],
		"1547239393_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 134,
				"body": "> [styromaniac](#comment_417_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The amount of hand-holding you'd have to do day in/out would be enough to charge a monthly rate, and then you'll have to convince them that they need or want ZeroNet enough to justify the cost, but more likely plebeians will prefer to drool and continue the currency exchange of likes for prayers on Facebook.\n\nWell we can always stuff zeronet in a browser bundled with tor and i2p all ready to go. It would not be an easy project to do but it could be done. Funny if you charge them they will use it. And why not start a zeronet corp that can do that sort of thing. There is nothing wrong with capitalism.",
				"added": 1547242306
			},
			{
				"comment_id": 135,
				"body": "> [squarezero](#comment_6_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd): Do not sell them : lend them instead. For a rather symbolic fee. But when they're not interested in the service anymore, you could still recover your hardware. For sure, it's better with local clients, rather than over-the-world delivery =)\n\nLOL!!! OMG! Its Steve Balmer.. Ok, sorry just had to say that.. lol!!",
				"added": 1547242355
			},
			{
				"comment_id": 136,
				"body": "> [squarezero](#comment_7_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd): Maybe I am. On Zeronet, nobody knows you're Steve-Dawg ;)\n\nI actually thought of putting zeronet on a thumbdrive and selling it as a free no cost internet. However in 60 days zeronet did so many reads and wrights to the usb drive it killed it. So that is a failure. Now it would work with a SSD drive and or a usb external platter drive.",
				"added": 1547242749
			}
		],
		"1535287918_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 137,
				"body": "Shouldn't trackers be with all zeronet hosts. To me it sounds insane to have two separate programs. Both should be running at the same time. Maybe this is an over head issue or a port problem.",
				"added": 1547243059
			}
		],
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 139,
				"body": "> [g35g](#comment_2_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD): I'm just going to throw this out there guys but the best way to get ZeroNet into the mainstream is:  [...]\n\nWe have allot of stuff here. And lots of piracy sites as well. Spamming out zeronet is a really good option right now. Perfect timing with the censorship that is going on. I have been targeted by China to the extent they were cutting my power to my smart meter to my house. All because I made a Meme about xi jinpong being poo bear. Since then Xi Jinpong the asshole Communist leader from china is saying that they want to nuke America.  He needs to be assassinated now. And I wont hold back about how bad xi is. He makes hitler and stallen look like little fairy boys.\nI am not alone in this harassment from china. In fact I most likely will be taken down from the web in the next 24 hours just for saying this by his Chinese agents that are working in America. China is a direct threat to all existence and we all need to take this very seriously. \n\nSpam zeronet.io to save the internet. The power we have here is the social media side.",
				"added": 1547247772
			},
			{
				"comment_id": 140,
				"body": "> [g35g](#comment_3_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD): It's not the quantity but the quality. With the exception of a few zites, they do not compare to the quality that you see on the clearnet. My point is only, there is still room to grow and still things to be done as a community. [...]\n\nThe first legit thing is the communication side of zeronet. Its very very good. Now the Zites will get better over time. Zeronet is only 3 years old. Clear-net will be shut down very soon completely. Hopefully I am wrong but I doubt it.",
				"added": 1547254954
			}
		],
		"1547259882_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 141,
				"body": "Mine just auto punched in the load script when I started up zeronet on the Linux command line. Seems to work for me. It may be router dependent. Do they even make decent routers anymore?",
				"added": 1547265922
			}
		],
		"1542448534_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 142,
				"body": "Where the hell have you been? You own a smart phone? Don't you know that there is an agent there listening all the time and watching your camera, and tracking your every move.  Come on now.. Let's not be paranoid that you are not owned by some intel agency and everything you have done in your life has been pre calculated and controlled from data they gathered from your smartphone usage and others around you. The Nerve of you to think otherwise would put you in a very Langley position now wouldn't it. The Anomaly is REAL DANGEROUS!",
				"added": 1547271108
			}
		],
		"1547266872_1FwDqRAQggNDskwBo4ZLXPWC69tSajS4aX": [
			{
				"comment_id": 143,
				"body": "There is a zite out there that is about like a total clone of reddit. I don't remember the name of it.",
				"added": 1547272533
			},
			{
				"comment_id": 147,
				"body": "> [anonlogin](#comment_7_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU): I think @nofish has already done enough in terms of creating example ZeroNet sites and its our task to improve upon his work.\n\nZeronet will be growing like crazy in the next year. I would say it will triple in size and with users. They will be Censoring all political talk very soon in the USA and violators of this will be killed by Chinese agents inside the U.S.",
				"added": 1547355177
			}
		],
		"1547272437_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 144,
				"body": "> [robione](#comment_153_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): everyone is browsing locally.how is the counter supposed to know what everyone else is doing?if the site owner was getting counting data, he'd be DDoSd on a popular site.users write to a site by authenticating with an ID service. so you'd only get people who are logged in.a JS counter might pick up visits, but they'd be delayed until they were published when someone auths and posts.ZN itself would need to aggregate that info and share among all nodes.Trackers might help, but mainly on new sites that need to find peers to download from.stats are inherently centralized for a resource, so aggregating all of them is what's left.\n\nYou are seeing exactly what I was seeing. Its a good idea but a nightmare to work out the details unless they all used some token system. Kinda like a token ring bot that would distribute the zite number to the exact owners destination because of a key. The token could be fully encrypted and only the owner of that zite could authorize its viewing. Just another night mare idea to code or it may have already been done. I think it is an interesting concept if it would be possible to code. \n\nWhy do I think of Lisp at this point. \n\n(Emacs is not a text editor its an operating system.)",
				"added": 1547282987
			}
		],
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 145,
				"body": "I think this is worth a solid beta test and lets see how it will work. I don't know how to eliminate spam other than a site block. One persons spam is another persons free speech. You get the problem.  If you don't like it don't share it kind of thing. The last thing that zeronet needs are a bunch of censor offended idiots that play Nazi on free speech and dance around like Hitler in drag and brag about how good they are.  Sorry I just had a Facebook flashback.\n\nGreat idea lets beta test it and see how well it will work and debug it. Then beat the hell out of it to see if it will break.",
				"added": 1547354810
			},
			{
				"comment_id": 152,
				"body": "> [anonlogin](#comment_10_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU): Hitler and National Socialism would've been the thing that could save Europe. Also, if you really think National Socialism was bad for Europe the threat would be no longer there because America, Britain and the USSR under Stalin joined forces to obliterate Germany. History is written by the victors not those who lost the war.\n\nHitler was and still is the biggest scumbag in existence. He ordered the full destruction of Germany because his people all deserved to Die. Anyone that supports Hitler goes beyond racism it is anti human. The Nationalist Socialist Democratic party will not win no matter what.",
				"added": 1547441373
			}
		],
		"1547319550_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 146,
				"body": "You dont know the secret password.. LOL..",
				"added": 1547354936
			}
		],
		"1547295582_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 148,
				"body": "What is so good about telegram?",
				"added": 1547373412
			},
			{
				"comment_id": 157,
				"body": "> [blazar](#comment_61_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): Telegram is spyware itself - it has no encryption at all. So called end-to-end encryption in telegram is fake because all keys are coming to telegram servers right at the stage of generation. And, of course, telegram is centralized messenger.\n\nYou have any links that talk about telegrams software design?",
				"added": 1547639717
			}
		],
		"2967_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": [
			{
				"comment_id": 149,
				"body": "That problem description is about as clear as mud. I think you are confused on some terms.",
				"added": 1547432066
			}
		],
		"2964_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": [
			{
				"comment_id": 151,
				"body": "Good idea.",
				"added": 1547432506
			}
		],
		"2970_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": [
			{
				"comment_id": 153,
				"body": "So we can get namecoin tokens to post? lol",
				"added": 1547573008
			}
		],
		"1547669338_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 158,
				"body": "1-14. Its that button thing over there. This give you an out when they hit the wrong button.\n\nBtw: There is a doc on those button names. I remember reading it on a white paper. Check the zeronet wiki.",
				"added": 1547684458
			},
			{
				"comment_id": 169,
				"body": "> [klu9](#comment_33_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @ssdifnskdjfnsdjk: & @trenta3: Thanks for those. I'll start adding these candidates to the list. Here's my initial feedback. [...]\n\nI do not remember where I read about it. I do remember that it was out of place and it was in a very dumb place to put it at. I am sure some one here has the link to it that can remember it.",
				"added": 1548140288
			}
		],
		"1547691059_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 159,
				"body": "> [nekololi](#comment_329_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i can't remember with certainty but i believe the favorite sites was something stored in your browser's localstorage.\n\nI was not clear. It was on my zerohello -zeronet.",
				"added": 1547765422
			}
		],
		"1547790597_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 160,
				"body": "> [n4n0](#comment_10_1Q3jT2vtT4gYV1rZqAvDrRzEPeXH9S7T6M): Why would you do this tho? It would essentially also make you seed questionable content to say the least.\n\nDo you know how much that data might be? I would never run that script.",
				"added": 1547813173
			},
			{
				"comment_id": 161,
				"body": "This is just really bad advice to any newbie zeronet Linux user. \nDO NOT RUN THIS SCRIPT!  \nIt is the making for a disaster. Let alone that some Zite could create code that could access /root on your system in  a form of a script file using python. I would bet that the author has already created such a site and is waiting for any newbies to run this script and gain access to there entire Linux system.\n\nHowever playing with this script on a virtual box knowing it would be compromised might be worth a test for advanced Linux users.",
				"added": 1547864932
			},
			{
				"comment_id": 162,
				"body": "> [pubg](#comment_10_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR): It is impossible to run personal python code, all zite  just run js and zeroframe api. Also I just seed but never open those zite. Your words scare me but it is impossible.\n\nIt is impossible to run personal python code? \nRunning zero-net as a root application is just stupid as fuk. Go back to Windows and play like an admin that will run anything even stuff you don't want it to run.",
				"added": 1547876066
			},
			{
				"comment_id": 163,
				"body": "> [randomshit](#comment_12_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r): Do those exist? I mean one has to be a certain level of not newbie to install linux let alone get zeronet running on it. [...]\n\nMy theory is to always think that everyone is a total newbe computer user that knows nothing. That way I will never half to go back to re explain the basic stuff that I left out to fixing a problem. Saves time as well. However may annoy experienced users to hurry up and get to the point feeling. I just expect a flood of new users that will start using Zeronet and there will be a newbe zeronet info drain from experienced users.",
				"added": 1547877790
			}
		],
		"1548012943_14hRA2Pze5PXYZLf8JCm9hknxLZTQ4qGqN": [
			{
				"comment_id": 164,
				"body": "Everyone Knows Robert Muller is The Anti Christ.",
				"added": 1548045723
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 165,
				"body": "It failed you missed a . at the end.",
				"added": 1548045766
			},
			{
				"comment_id": 185,
				"body": "> [zann](#comment_2_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): How you all doing!\n\nReply speed test!!!  Awesome!!",
				"added": 1548908557
			},
			{
				"comment_id": 186,
				"body": "> [zann](#comment_3_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): That's good\n\nFantastic, about 7 min response time to me.",
				"added": 1548909435
			},
			{
				"comment_id": 187,
				"body": "> [zann](#comment_4_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): just saw this\n\nHoly crap that is fast.. like 1 second..",
				"added": 1548909484
			},
			{
				"comment_id": 188,
				"body": "Zeronet is passing tests for an Ultra News site. This is cool.",
				"added": 1548909565
			},
			{
				"comment_id": 189,
				"body": "> [zann](#comment_6_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): You do have to worry about comments getting lost with a lot of people typing. or comments showing up in the wrong order. but those are problems for other people.\n\nThat is ok. The speed so far of this p2p zeronet is really good. Its passing all of my limited tests on putting a kick ass news site on zeronet.",
				"added": 1548910639
			},
			{
				"comment_id": 190,
				"body": "> [zann](#comment_7_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): You've got a news site on here?\n\nNot yet.  I will be bringing back a news site that was taken down several years ago that was getting over 2 mill views a day on average. It was force removed by CNN. Same shit they are \npulled on Infowars .",
				"added": 1548910781
			},
			{
				"comment_id": 191,
				"body": "> [zann](#comment_9_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): What was it called?\n\nI cant say the name of it. Or it may cause problems before I launch it.  I do need mirrors out the ass on this one. I have had over 127 attempts at my life over news posting's. This is serous business. And I am bad ass about News accuracy and that is what pisses them off so much.",
				"added": 1548910923
			},
			{
				"comment_id": 192,
				"body": "> [zann](#comment_9_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): What was it called?\n\nI cant say the name of it. Or it may cause problems before I launch it.  I do need mirrors out the ass on this one. I have had over 127 attempts at my life over news posting's. This is serous business. And I am bad ass about News accuracy and that is what pisses them off so much.",
				"added": 1548910946
			},
			{
				"comment_id": 193,
				"body": "> [zann](#comment_9_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp): What was it called?\n\nI cant say the name of it. Or it may cause problems before I launch it.  I do need mirrors out the ass on this one. I have had over 127 attempts at my life over news posting's. This is serous business. And I am bad ass about News accuracy and that is what pisses them off so much.",
				"added": 1548910957
			},
			{
				"comment_id": 263,
				"body": "> [beyondsecrets](#comment_1_1NcftvPdknCcXpCPiKtfs8cW3Fuu95YTnW): Will ZeroNet be another internet fad that fades out within 3 years?\n\nZeroNet is a Perfect Match For News and Journalism. (Watch And See!)",
				"added": 1550240956
			}
		],
		"1548024035_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 166,
				"body": "Easy. Use ext4 file system. / = root about 50 to 60 gig. Swap = 2x your ram on your system.  /home = What ever you want to allocate. \nI recommend using a dual drive system. One drive Linux one for windows. \n\nI removed Windows from everything I use in 2000 and never looked back.",
				"added": 1548046051
			},
			{
				"comment_id": 168,
				"body": "> [duck0](#comment_5_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Someone made a post about using a thumb drive for ZeroNet and it thrashed it. Those, like SD cards, have a more limited read/write lifespan than SSD/HDD. [...]\n\nI got a dirt cheap 64 g drive for about $11.00. I put zeronet on it and ran it for about 2 months. Zeronet killed it. External drive or a real SSD drive is the only way to run zeronet long term. Temporarily you can use a usb thumb drive. The amount of read/writes zeronet does will eat those transistors alive.  Until they improve those drives read write's.",
				"added": 1548138869
			}
		],
		"1548089175_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 167,
				"body": "Sorry, I missed what has been happening in Russia. What are they doing now?",
				"added": 1548138504
			}
		],
		"1548210080_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 170,
				"body": "I think that the new SSD drives will be ok on zeronet. However usb thumb drives zeronet will eat them alive do to the amount of read/write activity. I do agree that platter drives are the best option for zeronet.  Your age of hardware may very.",
				"added": 1548210544
			},
			{
				"comment_id": 248,
				"body": "> [nickwa](#comment_59_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I have a Samsung SSD which have insane \n\nYou mean we still need platter drives after all. OMFG!!! Come on people we just need more silicon layers duplicated over and over and over to a ridiculous size it will continue to work. Or we use a mechanical device to store data. Sad day for technology. We need more hardware killers out there testing the latest and greatest devices to see how well they will stand the test of time. If we don't we will all loose data that may be important. And I just got my first SSD drive recently.  I knew there were some issues in the way it was made but thought that they may have been fixed. Apparently not. Optical data storage is the answer in my view. I am looking at this from a physics perspective only. More research needs to be done with optical device storage. You know we will all go back to punch card in the end anyway. Micro laser holes in paper with optical readers. lol .. Just watch. LOL!!!",
				"added": 1549608409
			},
			{
				"comment_id": 249,
				"body": "> [quantumworld](#comment_170_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I think that the new SSD drives will be ok on zeronet. However usb thumb drives zeronet will eat them alive do to the amount of read/write activity. I do agree that platter drives are the best option for zeronet.  Your age of hardware may very.\n\nUpdate: Looking at the over all data usage of Zeronet it is very very low. Much lower than say an operating system does on a normal boot. Zeronet is enough taxing to kill a low end USB stick.  The only way to know is to test things like this.  And always backup your data.",
				"added": 1549608791
			},
			{
				"comment_id": 250,
				"body": "> [leftside](#comment_530_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Plz stop driving people nuts.Read what he wrote again.He insists SDD lasts more than people imagine.\n\nYour lack of logic to your statement is incomprehensible.",
				"added": 1549608821
			}
		],
		"1548521770_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 171,
				"body": "I have lost two zeronet user accounts. I had to create a new user acct to fix the problem. No idea what the problem was. Error said it could not find my username.  I back up zeronet once a day and have encountered the same problem 3 times so far. I had to do a backup restore. So over all this same issue has occurred 7 times so far. I dont know enough about zeronet to effectively debug it yet.",
				"added": 1548553918
			}
		],
		"1548671064_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK": [
			{
				"comment_id": 172,
				"body": "> [gktuskbx](#comment_3_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK): yes, i just tried to switch to two different identities and to no identity and back to my zeroid identity, but that not helped to be able to post content (File write error: Forbidden, you can only modify your own files). When i switch identities on another site it always report i can modify only my files (after switching to the identity). you can also refer to this similar issue: https://github.com/HelloZeroNet/ZeroNet/issues/1782 Thank you\n\nI think the only reliable way to switch identities is to run a completely new zeronet program with the new identity. \nI have had to many problems running two or more identities on zeronet.",
				"added": 1548795561
			}
		],
		"1548796017_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 174,
				"body": "> [randomshit](#comment_21_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r): I've always tried to avoid an improper shutdown of the client simply because it would always results in problematic behavior when attempting to restart the client.\n\nThey need to code in a proper shutdown sequence if you use the ctrl c  command line. Why would you not code it that way?",
				"added": 1548848452
			},
			{
				"comment_id": 177,
				"body": "> [nofish](#comment_1254_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Hm, I always use ctrl+c to shutdown the client. What do you mean by  user blowout ? Does the users.json file get corrupted?\n\nIt corrupts or deletes the user account file: users.json or corrupts it.  \nBtw How long have you been using the ctrl c ?",
				"added": 1548857944
			},
			{
				"comment_id": 178,
				"body": "> [quantumworld](#comment_177_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): It corrupts or deletes the user account file: users.json or corrupts it.Btw How long have you been using the ctrl c ?\n\nTry doing an update all and give it a few seconds and then hit the ctrl c and you can see if you can duplicate it.",
				"added": 1548858090
			}
		],
		"1548825111_14uRvph7yp9ZaBRpJMJGZABwVu56N1AMwU": [
			{
				"comment_id": 175,
				"body": "A total bull shit story. There are no links to support anything in the story to verify that Islamic state is on zeronet. Its a gov hit peace to try to create support to shut down peer to peer networks and brand them as terrorist networks.\nBTW : that is such a good article you can just replace Zeronet with any network and role it out against that network. Looks to me to be a form letter from most likely the CIA.",
				"added": 1548849105
			},
			{
				"comment_id": 176,
				"body": "> [quantumworld](#comment_175_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): A total bull shit story. There are no links to support anything in the story to verify that Islamic state is on zeronet. Its a gov hit peace to try to create support to shut down peer to peer networks and brand them as terrorist networks.BTW : that is such a good article you can just replace Zeronet with any network and role it out against that network. Looks to me to be a form letter from most likely the CIA.\n\nI stand corrected. Original article has links to confirm several sources. My add blocker was blocking them. In any case computer networks can be used for good or bad.",
				"added": 1548849412
			},
			{
				"comment_id": 180,
				"body": "> [styromaniac](#comment_482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I just replied to the author on Twitter.\n\nIt's a main stream hit peace against Zeronet. There plan to take down p2p will fail.",
				"added": 1548906732
			},
			{
				"comment_id": 181,
				"body": "> [styromaniac](#comment_478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We should call for a ban of dihydrogen monoxide first. [...]\n\nYes and we need to stop drinking it to. It almost caused Bush Jr to die.",
				"added": 1548906820
			},
			{
				"comment_id": 196,
				"body": "> [quantumkitty](#comment_196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Wish someone could post the links already. I'm dying to see ISIS' web designing skills.\n\nI dont think there is a website. They did provide some links in the article but the story in my view is still anti p2p slanted. I hate to say but stories like this may become more frequent.",
				"added": 1548920547
			}
		],
		"1548890091_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf": [
			{
				"comment_id": 179,
				"body": "Welcome to freenode.  lol",
				"added": 1548906513
			}
		],
		"1545280465_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 182,
				"body": "Remember the national news in the United States is a foreign domestic terrorist operation that works directly with the C.I.A. that is working to over through America by any means possible. They all get paid billions of dollars from countries that are Communist. They don't give a shit about anything but there paycheck. If you want to hit them hard turn off there bank accounts. Turn off there power. Turn off there internet. Turn off there credit cards Turn off everything of any economic value to every reporter who is getting paid to destroy America. This includes any corporation that works against America.  Remember the entire world is fighting Communist's and Nazi Democratic fascist's. Know your history.",
				"added": 1548907528
			},
			{
				"comment_id": 195,
				"body": "> [leftside](#comment_514_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): OK, Mr. Russian Agent.\n\nThe Democrats are all Russian agents. Muller is one sick SOB. Him an I go way back to some false flag opp I busted him on. Lots of people got wiped on that one. Just like this next one will be. Except only MUCH BIGGER...  THE ANOMALY IS EVERYWHERE AND NOWHERE...",
				"added": 1548912938
			}
		],
		"1548241961_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 183,
				"body": "> [klu9](#comment_40_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Just waiting for zero:// :)\n\nI dont know if I like that idea.  I want to make sure the program is actually working and not going to a re-direct siphon site on the web.",
				"added": 1548907676
			}
		],
		"1548908171_17j49peu8sboiBjDKxXqNEbNCioF4BBZyp": [
			{
				"comment_id": 184,
				"body": "I Love a good debate because I always win. And it is a really good skill to learn.",
				"added": 1548908315
			}
		],
		"1548489185_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 194,
				"body": "I love FBI sting operations... Don't you!  lol",
				"added": 1548911305
			}
		],
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 199,
				"body": "Nice!",
				"added": 1549003375
			},
			{
				"comment_id": 204,
				"body": "> [styromaniac](#comment_501_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please make sure I can find the necessary info to block individuals in the event they post illegal porn on an irrelevant hub.\n\nWhen you block a user from posting does it also block all the Zites they are running on Zeronet?",
				"added": 1549068565
			}
		],
		"1549027708_155V1pDJWxxohR8eNgocGarkipstcSEARJ": [
			{
				"comment_id": 200,
				"body": "I have already seen several political sites that were put on a ban list that were not Communist/Nazi enough for the list's creator. Anyone that pushes censorship for your protection is almost 100% a Communist / Nazi Racist that is out to normalize hate crime against anyone who goes against there collective mind set. \nYou have a Brain and you have a Block. NEVER RELY ON A COMMUNIST/NAZI TO CENSOR FOR YOU.\nFOR THE RECORD.. I HATE COMMUNISTS AND I TOTALLY HATE NAZI'S. AND ALL RACIST SCUMBAGS..",
				"added": 1549056219
			},
			{
				"comment_id": 201,
				"body": "> [styromaniac](#comment_500_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's a fourth blocklist? I'll check the BS out.\n\nI have found 10 block lists. Some are very old and some are new. Most of them totally suck and lead to dead Zites. \nAfter doing a bunch of accuracy tests on the block lists I have come to the conclusion that they all suck.  There are Zites that I personally block and ban. They are not sites that say maybe you would block or ban. Censorship should be up to the individual. And talking about bad zites is fine as well. However group thinking of banning Zites is just a bad idea. The only thing that I totally ban are Windows or microshaft related sites. Sorry closed source software is Pure EVIL in my view.  And I would suggest others do the same thing. (See not everyone will agree with my personal ban list.)",
				"added": 1549062264
			},
			{
				"comment_id": 202,
				"body": "> [styromaniac](#comment_502_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll check them out of you mail the links. [...]\n\nSorry I wont circulate any of the ban lists. Many were really old ones. And 3 of those ban list sites actually got on my ban list and block. I will never trust a ban / block list ever again due to its miss use in the past by people with political agenda's that promote a Marxist/Nazi ideology of intolerance and support fascists ideology and saying that they do not.",
				"added": 1549063062
			},
			{
				"comment_id": 203,
				"body": "> [randomshit](#comment_23_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r): The creator of each block list, They can opt-out of it. [...]\n\nI just don't trust block lists. Even one block list I found had links to some really bad malware code that was designed for windows users.  The block list was created in 2016.  Posting about bad sites is fine. However be very skeptical about any Zite that has a block list. You may end up running some crap that you don't want to run as well when you go to that Zite.",
				"added": 1549068326
			},
			{
				"comment_id": 205,
				"body": "> [styromaniac](#comment_505_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): 2016? [...]\n\nThere was no block in 2016? It was a list of sites none of them did any auto blocking.",
				"added": 1549117171
			}
		],
		"1549201445_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ": [
			{
				"comment_id": 207,
				"body": "Crickets...",
				"added": 1549203897
			},
			{
				"comment_id": 211,
				"body": "> [polar2](#comment_56_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum): I can't understand what you mean\n\nConsider it to be a good thing. Because it is so stupid I will never bother to say how stupid it really is.",
				"added": 1549224947
			},
			{
				"comment_id": 214,
				"body": "> [somename666](#comment_5_1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ): What do you mean stupid? It's very important issue\n\nLOL!!!",
				"added": 1549230424
			}
		],
		"1548788942_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 209,
				"body": "I have no idea where this option of uploading a screenshot is.  Maybe I am missing something here on my end.",
				"added": 1549224443
			},
			{
				"comment_id": 213,
				"body": "> [klu9](#comment_47_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): You can't do it in the main post itself, but in a comment below the main post, for some reason. [...]\n\nOh you get that option in the create a new topic, then the code got cut for comments.  I am sure the idea was to not allow the comments to over drive the topic being posted. When in fact it should be uniform and could create a really good conversation related to topic posting template.",
				"added": 1549225231
			}
		],
		"1549224277_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 210,
				"body": "I think that there is something like that. It was more like a paste bin. I do not remember the name of the zite.",
				"added": 1549224840
			},
			{
				"comment_id": 215,
				"body": "Close to what you are looking for but not quite.\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/",
				"added": 1549232325
			}
		],
		"1529484345_1Dizck1E84vNMu5SMwGCT9g3WwKijHKCTp": [
			{
				"comment_id": 212,
				"body": "LOL!!!!",
				"added": 1549225062
			}
		],
		"1549435574_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 216,
				"body": "All Words Letters And Colors Are Hate Speech!  There I think I am in.. Where is the secret handshake..  Stallen Rules!!!\nLOL!!!",
				"added": 1549441037
			},
			{
				"comment_id": 217,
				"body": "> [kaffie](#comment_734_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I think you caught a case of internalized liberalphobia!\n\nI find your comment to be extremely offensive and non gender neutral. Please try better next time.",
				"added": 1549442305
			}
		],
		"1549491562_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC": [
			{
				"comment_id": 218,
				"body": "The C&P Site has no minor on it at all. I have looked. If you find one point out the code.",
				"added": 1549505053
			},
			{
				"comment_id": 219,
				"body": "Actually I will save some time and move this block list site site on my ban and block list site. 80% blocks are not accurate on this list.",
				"added": 1549505245
			},
			{
				"comment_id": 247,
				"body": "> [aloha3](#comment_2_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC): I have the idea of make a list of surface sites too, not only here in zeronet.\n\nThat would be millions of sites. And what is you criteria of scam's. You need to define that a lot better than just scam. That way it would be easier to track what kinds of scam's are out there and how they will be technically dealt with. Its not an easy job to do and it is risky if you use winblows.   (Linux/Bsd ) is best.",
				"added": 1549555305
			},
			{
				"comment_id": 254,
				"body": "All the scam site I have found I deleted and blocked.",
				"added": 1549691572
			},
			{
				"comment_id": 256,
				"body": "> [oncatcoaster](#comment_18_155V1pDJWxxohR8eNgocGarkipstcSEARJ): I would not mind if you wrote to me from my forum or even in the blog, because I like someone to question what I do, even if I would prefer to have more help in this work. @quantumworld @ssdifnskdjfnsdjk\n\nAbout 10% of the new Zites going up turn out to be bad. I am sure it is newbes fist time posting there site. For Zeronet to be only approx 2 years old its doing pretty good. Now is the perfect time for Zeronet.",
				"added": 1549751833
			}
		],
		"1549510248_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 220,
				"body": "> [pubg](#comment_18_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR): Yes\n\nZeronet will swing right politically with all the new users. I am a X-leftist and I can understand all sides of political debate. This will be allot of fun and a great way to test out Zeronet's capabilities. I expect no major problems. \n\nMake Zeronet Great Again!  (M.Z.G.A.)",
				"added": 1549511095
			}
		],
		"1549511316_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 221,
				"body": "> [kaffie](#comment_737_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Hell if we could even get a half-decent p2p instant message client that'd be nice. Discord is my go-to for video/voice/text chat. But it's very centralized and entirely proprietary. An alternative would be nice.\n\nI used to like discord but then I got some info leaked out from a conversation I had with some one to some Intel agency. I stopped using discord for that reason. I am sure there is a better one out there that is not piped into the DOD for data collection and monitoring purposes.",
				"added": 1549516009
			},
			{
				"comment_id": 224,
				"body": "So why isn't everyone a server of everyone? It would end up as a peer to peer grid but it would allow storage of web (Zite) content that would survive natural disasters. This p2p system has incredible amounts of better data usage structures than I have previously ever thought of before.",
				"added": 1549521436
			},
			{
				"comment_id": 226,
				"body": "> [nickwa](#comment_48_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I personally think ZeroNet has a lot of promises for chats, emails, etc. I just think that Matrix/Riot approach for now is fine for chatting via creating your own server until ZeroNet takes off more.\n\nThose are two entirely different gui design systems. One is more integrated and user orientated the other is more web  based gui designs. (That will change..).",
				"added": 1549522332
			},
			{
				"comment_id": 227,
				"body": "> [nickwa](#comment_51_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I see what you mean.\n\nI have to say that the comment response time on zeronet that is p2p is just blowing my mind. Its fast..",
				"added": 1549522466
			},
			{
				"comment_id": 228,
				"body": "> [nickwa](#comment_54_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Well, as a Consitutionalist, I do not.\n\nSoftware anarchy is fine. But I am also a Consitutionalist. The two work well together when 90% of the free world is run by an out of control intelligence agency.",
				"added": 1549522997
			},
			{
				"comment_id": 229,
				"body": "> [kaffie](#comment_755_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): makes sense why you prefer federation over decentralization/distributed systems.\n\nLOL! Emacs is better..",
				"added": 1549523094
			},
			{
				"comment_id": 230,
				"body": "> [nickwa](#comment_55_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Yeah that is why I said before that the internet itself should be approached different. It is why I support ZeroNet. The real world and the internet are 2 different things.\n\nI would sort of agree with you until I learned about lisp and then realized that we are all in an Emacs simulation program. I have never been the same since. lol",
				"added": 1549523278
			},
			{
				"comment_id": 231,
				"body": "Lisp is program glue sludge structures of ever changing elements of definitions.",
				"added": 1549523417
			},
			{
				"comment_id": 232,
				"body": "> [nickwa](#comment_56_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Lol. The argument for human existence might never be answered.\n\nYou are enlightened with the word of Emacs..   LOL!!",
				"added": 1549523492
			}
		],
		"1545308490_1CSyXuUPje7aUipDKqm3xhm6BKH3SjDZUu": [
			{
				"comment_id": 222,
				"body": "> [kaffie](#comment_739_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ZeroMail is NOT a merger site. There are no such thing as \"ZeroMail hubs\". I get what you intend, but to do that someone needs to write code to make ZeroMail into a merger site. Which isn't the case at the moment. [...]\n\nI tried to clone my mail acct as well. The newbe list of learning Zeronet..  I wonder what this will do.. LOL..",
				"added": 1549516134
			},
			{
				"comment_id": 223,
				"body": "> [kaffie](#comment_741_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ZeroMail works by having users write the mail to their user folder when they send one. To check your mail you read from the sender's folder, and decrypt messages that are directed towards you. To send a  response, you do the same thing. [...]\n\nWow! So any site can be cloned if they do a merger with other parts in the defined terms of software response usage program name. (This is what Lisp does to your brain.) lol..",
				"added": 1549518830
			},
			{
				"comment_id": 225,
				"body": "> [kaffie] \n\nI know I will get allot of flack for saying this but I do want a timed posting system.  I had this on my blogs and on tweetdeck when I used it. It allowed timed posts. However I would have its output as saying that it was a timed post. Or a pre recorded post. I think this would give a nice add on for new content posting and also for going live on content posting.  (I am going to go hide now for making this post for a week or two.. lol)",
				"added": 1549521845
			},
			{
				"comment_id": 233,
				"body": "> [geekless](#comment_31_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): That can be easily implemented. As long as you are okay about the fact that timed posts are just hidden from the UI, but can be viewed in the data file. [...]\n\nIf user follows the posts it should show up. I would only use the timed posts for news items. Zeronet will be like the ultimate social media site in the future that will be more active than twitter is now provided they add .gif support.",
				"added": 1549531324
			}
		],
		"1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 234,
				"body": "The no miner site is totally a fraud in my view. I cannot find any miner code at all on any sites listed on the block list.\nThe maintainer of that site has not published the links to mining program in a batch file or in any html flies. Please feel free to verify my finding on the NoMiner site.",
				"added": 1549534541
			},
			{
				"comment_id": 235,
				"body": "> [ssdifnskdjfnsdjk](#comment_665_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Me neither when i right click the page to see its source code, but when i check source code of actual files (index.html) i see: <script sandbox=\"allow-same-origin allow-scripts\" src=\"https://co*nh*ve.com/lib/coinhive.min.js\"></script> [...]\n\nI also loaded the site in and checked if there was any running code in 3 browsers. Firefox, Chromium and Opera. Nothing was going on.  I was hoping to see some sort of mining file running but nothing was running.",
				"added": 1549537168
			},
			{
				"comment_id": 236,
				"body": "I would like to see multiple people confirm that there is no mining found on those sites. Maybe I missed something. However I doubt it. And it is a good thing to get more eyeballs. And if I missed something I will learn how to detect it in the future better.",
				"added": 1549537368
			},
			{
				"comment_id": 237,
				"body": "In the future 90% of our cpu processing power will be consumed by crypto mining. 10% will be used for actual work. Leaving the user experience to digital slavery. (Lesson: Think about the future you are designing in code.)",
				"added": 1549538588
			},
			{
				"comment_id": 238,
				"body": "> [kaffie](#comment_760_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Nofish comes on to complain about a virus warning but not the fuckton of chinese spammers. \n\nI have seen far worse spamming in irc rooms. So if that was a huge China hit then we did pretty good. And this is not to say that there is room for improvement. Like multiple line detection of content. Say post 5 or 6 lines of text that a script file could detect then have a \"Warning 6 multiple lines detected\" <Possible spam>.. With a more option to read the text.. That would clean up the gui spam ugly look allot. And still leave effective user control. Later on filters could be made to include text that users have detected as spam.",
				"added": 1549539347
			},
			{
				"comment_id": 239,
				"body": "> [kaffie](#comment_761_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): We need to get some sort of mutual banlist for sites so everyone can just follow one instead of having to update each zite individually. [...]\n\nNice spam re-post..",
				"added": 1549540039
			},
			{
				"comment_id": 240,
				"body": "Zeronet needs a user submitted option ban/ignore locally controlled ban list option.",
				"added": 1549540257
			}
		],
		"1549540803_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 241,
				"body": "I think your zite needs a comment section. I trust your selection of users you have on your list. I verified them as pretty bad. Not something you want to have running around unless you like them allot. lol",
				"added": 1549543536
			},
			{
				"comment_id": 242,
				"body": "> [kaffie](#comment_765_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I just cloned the block list site tbh. Took like 30 seconds. Comments/ratings and such would be neat to add.\n\nOk you are talking me into the newbe zeronet block ban list. I reserve the right to change my mind. I go with what works best for a very high level growth rate for this network.",
				"added": 1549543745
			},
			{
				"comment_id": 243,
				"body": "> [kaffie](#comment_766_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm a huge fan of optional lists haha. Like just start it up and it asks which user/site blocklists you want to follow and just have some basic ones like spam, cp/pedo, porn, nsfw content, etc. That way newbies can quickly select what they do/don't want to see, so they don't have to worry about stumbling upon it. Don't like blocklists? No need to select any! [...]\n\nJust imagine 2 million users using Zeronet in the next 30 days. Might be a good idea to make one. Think of Zeronet as a giant saftey net for internet freedom. They are going to pull the plug on the domain servers soon. What happens next will blow there minds.",
				"added": 1549547548
			},
			{
				"comment_id": 244,
				"body": "> [kaffie](#comment_767_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): That's why I'm desperately pushing for people to get set up with cjdns asap. Along with building physical mesh networks. You never know when the regular internet is going to become toxic and unsuitable for free discussion/communication/speech. The faster we can make a realistic alternative, the better.\n\nEveryone is forcing the scum corporate rulers to show there hand and they will most likely ban everyone from any political speech. The intimidation tactics don't work anymore and both left and right are being banned. I think this is fantastic in a good and bad way.  Good thing is that everyone will be working together. Bad thing is that people will all be banned on clear net. \nSo Right now Zeronet is a perfect answer for political discussions about what ever topic. However replacing commercial sites that sell products on them that is not quite there yet. I think it can be done with a p2p commerce system using the same kind of system. My view is use Kiss as much as possible. Keep it simple smart.",
				"added": 1549550367
			},
			{
				"comment_id": 245,
				"body": "> [kaffie](#comment_768_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The problem with that is the problem you seem to be having here. Most people into this kind of tech are anti-capitalist. Note how we have no ads, no stores, etc. Most people here would rather figure out alternative ways to have society run, rather than fall back in line with capitalism. Though for capitalist needs a forum, zeromail, and bitcoin always works.\n\nThat is totally fine with me. I am sure both sides will get along great together. There will be some minor tweaking in some political beliefs but both structures will be fantastic complements of disagreements with each other to keep things very interesting and lively in a debate form. May the best working political ideas rise to the top for everyone. That has the best benefit for everyone. And I don't have any problem with adds on zites. We need capitalism to live. And I am open to an alternative system that is better than that. I have not found one yet that will work right.",
				"added": 1549551155
			},
			{
				"comment_id": 246,
				"body": "> [styromaniac](#comment_512_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://www.dclick.io/overview\n\nOmg NO.. Is that is double click??  Ok, I have my limits.",
				"added": 1549554298
			}
		],
		"1549561050_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 251,
				"body": "I am totally against this idea until all hardware and software is all open source. There is no way I would ever think this idea is good at all. You have not seen what I have seen with government penetration inside your computer. Please look up Vault 7 as a warmer. All the big shit I know about has yet to be published outside of the gov contractors that use this hidden back door system that is in all hardware. This goes back to 1952. I would say that anyone that supports the idea of direct computer controlled democracy is either not informed about computer security enough or is an agent of some deep state organization.",
				"added": 1549609279
			}
		],
		"1549642501_17Dvd3j3RtTZ8z5xqUDVuc9LqNFVHvdQQC": [
			{
				"comment_id": 252,
				"body": "You Guys/Gals Rock!!!!!! Get ready for lots of new traffic on Zeronet very soon.",
				"added": 1549658568
			}
		],
		"1549642211_17Dvd3j3RtTZ8z5xqUDVuc9LqNFVHvdQQC": [
			{
				"comment_id": 253,
				"body": "Don't even go there or we will create a layer of encrypted data static that would replace ip addresses in the future and data flow would look like a usb data flow.\nSo sit down and shut up you have no vision of the future. lol",
				"added": 1549665431
			}
		],
		"1549539633_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 255,
				"body": "> [leftside](#comment_549_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Before ZeroTalk accepts Timestamp based hub system, this kind of features will only burden the network traffic and each user's CPU and HDD.\n\nThen have a set limit option. With an option to see pictures or video.",
				"added": 1549691677
			}
		],
		"1549884107_1QGE1KUwdNLyE1oNpcvksRLV72K9BZ3ELa": [
			{
				"comment_id": 257,
				"body": "Important Zites.. I really like this site. \nhttp://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/?/",
				"added": 1549896907
			}
		],
		"1549935069_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 258,
				"body": "No thanks. Those spider bots would love to have a way to dig into zeronet and turn this place into a giant sucking sound for every intelligence agency known on the planet.",
				"added": 1549935632
			},
			{
				"comment_id": 259,
				"body": "> [leftside](#comment_575_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Don't be a coward. That will happen sooner or later anyway.\n\nNo thanks Xi Jinpong. I have seen the land of plenty.",
				"added": 1549938513
			}
		],
		"1549955063_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 260,
				"body": "Good question. Find an old version of zeronet and load it up. See what works.. Then hit the update and see if it works after that. Report back immediately for an extra +300 points on your social score.",
				"added": 1549956494
			}
		],
		"1550190694_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": [
			{
				"comment_id": 261,
				"body": "> [kaffie](#comment_777_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Spotted him spamming my  blog so I banned him from my blog (and ported over my bans to there), from kaffiehub, and added him to the spammer mutelist.\n\nWhat was he spamming?  (I am using your block list.) So I missed the excitement..",
				"added": 1550221686
			},
			{
				"comment_id": 262,
				"body": "> [grubas17](#comment_10_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV): He kept repeating something like: \"If you talk to Alexandria Ocasio-Cortez, it's 'Never Amazon,'\" Seth said. \"If you talk to [New York City Councilman Jimmy] Van Bramer, it's unions.\" (New York is still a heavily unionized town, and Amazon's opposition to unions was frequently cited by those who fought the project.)\n\nWow... bizzar..  Drunk users on zeronet don't make good content posting's... lol",
				"added": 1550222339
			},
			{
				"comment_id": 266,
				"body": "> [handojin](#comment_3_1KBqCUbW4CEHCXtJZRFXy6M1xcbCbAgqGs): agree. the clear net attack vector is total on all levels: physical, mental, emotional, material, intellectual, technical & it is like a nightmare sequence from a 1950s Disney cartoon - on acid :(\n\nScary I was thinking the same thing as well. It will be like that here on zeronet eventually as it grows.",
				"added": 1550247681
			},
			{
				"comment_id": 268,
				"body": "> [handojin](#comment_4_1KBqCUbW4CEHCXtJZRFXy6M1xcbCbAgqGs): F2F dark netz might eventually prove to be the only real safe haven but then one must choose one's friends carefully :-/\n\nTor has some serous security problems and needs to be re-designed a different way. Entry and exit points and limited jump points is bad. There is a better more secure and faster way to do it.",
				"added": 1550248339
			}
		],
		"1550064181_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 264,
				"body": "I just noticed that ZeroMail has a bunch of users in a folder. You may look into the maximum file size limit to different file systems that Linux/mac and android use. Some of those file systems have maximum limits to folder names saved in the file system. This could lead to a corrupt file system if not fixed. The files in that directory were close to 7 thousand folders. That is allot. Do a search on maximum folder size limits to ______ file system. Its better to fix it now than break it later if there is a problem. (I have repaired many computer systems over the years over this problem)  @Nofish:",
				"added": 1550241851
			},
			{
				"comment_id": 265,
				"body": "> [quantumworld](#comment_264_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Do a search on maximum folder size limits to __ file system.\n\nDo a search on maximum folder size limits to file names in folders.  ______ file format.  <<<  (Correction..)",
				"added": 1550241967
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 267,
				"body": "> [hackermobs](#comment_2_1AHZ7t3mynNFD7giEo86Pm93nCBjJEhtRo): Can anyone check if my zite is running properly? [...]\n\nLooks good works fine.",
				"added": 1550247795
			}
		],
		"1550365826_1AtqzbrDkFXZYHk5p3VFswWgudEWiWFDAV": [
			{
				"comment_id": 269,
				"body": "There is a storage size problem? What is the maximum size that it is coded for.",
				"added": 1550386628
			},
			{
				"comment_id": 270,
				"body": "> [gluek](#comment_2_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): So it's just mockup right now, nothing really working?\n\nNo Zeronet is real. Works very well. Just needs some tweaking here and there and these will all be addressed in the updates as things progress on with open source software. These are all minor changes and easy fixes. The things you learn on the fly when you are writing code with lots of people on the same project.",
				"added": 1550401687
			},
			{
				"comment_id": 271,
				"body": "> [kaffie](#comment_783_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The problem is that zeronet sites only allow users to upload a certain amount of data, based on limitations in the permissions. Usually this is set pretty low. [...]\n\nI think that should be raised. I have seen the space warning several times. Why cant we have an auto space scale program that would check drive space allocated for zeronet and divide it up evenly between zites.",
				"added": 1550402024
			}
		],
		"1550668171_14Y1Vbo7Mz2efjpMnc4t5iSEYixVQhqQpL": [
			{
				"comment_id": 272,
				"body": "> [grubas17](#comment_12_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV): goody\n\nSame here..",
				"added": 1550669126
			}
		],
		"1550754018_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 273,
				"body": "I want to know if there is a way to get around the phone verification system that they have set up.  I definitely do not trust any of them but getting around there Nazi socialist data collection for central command is a step in the right direction.",
				"added": 1550754371
			},
			{
				"comment_id": 278,
				"body": "> [citadell](#comment_17_1GE4QKLQM3L6r1NngDQEuEzwNBqHoBiXtL): Too scared to leave their serices are you? :)\n\nNothing is more fun than breaking the system. That's why. Come on its Google.. lol.. ((Smash Emm!))",
				"added": 1550785436
			}
		],
		"1550761507_1E6XbnEgJMBkFbxsd7i7yZWvMaQggchH1C": [
			{
				"comment_id": 274,
				"body": "Zeronet is peer to peer internet. Decentralized and censorship free. That's the point of Zeronet.",
				"added": 1550764659
			}
		],
		"1550769959_19c2yd52AYNyWjqAkv5x1qKgntbzX5Sgi": [
			{
				"comment_id": 275,
				"body": "You haven't seen anything yet. Zeronet will be huge..",
				"added": 1550770145
			}
		],
		"1550775296_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 276,
				"body": "Oh ya. Lets open up Zeronet = your computer to be scanned by google for content. Not a good idea.",
				"added": 1550775963
			},
			{
				"comment_id": 277,
				"body": "> [nofish](#comment_1263_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Well, it's already happening: https://www.google.com/search?q=site:0net.io\n\nThe main site is there. Sub Zeronet Zites content is not there.  It works. lol..",
				"added": 1550778811
			}
		],
		"1550767789_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 279,
				"body": "> [gluek](#comment_8_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): I'll seed it, but it's just another ZeroTalk forum isn't it?\n\nThis is basically a beta test. I will be moving a better one in. But yea this one will be a zerotalk forum. I need a bot bad to do some automated posts. Other wise I will annoy everyone with a bunch of posts at once.",
				"added": 1550847861
			}
		],
		"1550852186_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 280,
				"body": "Out of space error? Maybe..?",
				"added": 1550915693
			},
			{
				"comment_id": 281,
				"body": "> [schiz0](#comment_62_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): so, if it's true, what can I do?\nTry this. Left click and hold zeronet icon 8 looking thing and drag left. Go to the bottom of that slider page and make sure the This is my site button is turned off. That may be the error you are getting. Then shut down zeronet. Clear browser cache and reboot machine. This will take care of multiple possible fault state variables that can cause errors.  All computers glitch out over long term run times.",
				"added": 1550919837
			},
			{
				"comment_id": 282,
				"body": "> [schiz0](#comment_63_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): already done, but without solving the problem\n\nHave you tried to delete the zite from the right side bar and restarting zeronet and reloading zerome? I bet that would work.",
				"added": 1550920682
			},
			{
				"comment_id": 283,
				"body": "> [schiz0](#comment_64_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): nothing\n\nThat should have fixed it. And it has worked on all the other sites that had an issue similar to that problem. Ok I will pass this up to terr 2 bug fix guys.. (Shotgun to the computer) Will fix most computer usage problems.)) lol",
				"added": 1550923969
			},
			{
				"comment_id": 286,
				"body": "> [schiz0](#comment_67_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): anyway I think it could be very very very useful a possibility to control the out of space on ZeroMe's hubs\n\nI need a link for technical information on what a zeronet hub is. How to create one and run one.",
				"added": 1550966323
			}
		],
		"1550907964_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 284,
				"body": "I think that a decentralized p2p gaming system could be designed and built from the free software we have now. Latency issues may or may not be problem depending on the protocol you are using. \nhttps://gamedevelopment.tutsplus.com/tutorials/building-a-peer-to-peer-multiplayer-networked-game--gamedev-10074\n\nEasy stuff. It will just take you about 20 minutes to code it. lol",
				"added": 1550932269
			}
		],
		"1550940016_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 285,
				"body": "> [styromaniac](#comment_552_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): A JS implementation was attempted and then abandoned. [...]\n\nNo not that way. Set it up to where the extension downloads and installs zeronet. Probably a script file. The extension would basically be nothing more than a html help thing that links into the zeronet  http://127.0.0.1:43110/ port after the zeronet program is running.\nThis is another way to market zeronet and install zeronet on more computers globally. I am sure this could be done. And it would easily bring new users into zeronet. \nAlso some silly little desktop icon thing needs to be made that will indicate to a user that zeronet is running. (Yes I know it can be run in terminal which is allot better.) This program design would be for the first time user.",
				"added": 1550941158
			}
		],
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 287,
				"body": "> [randomshits](#comment_12_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Marketing Zeronet will be a risky attempt. All the vulnerabilities and ugliness of the zeronet's deep network will be emphasised in the largest smear campaign ever. It would be foolish to expect the power holders to let go of their reigns of ownership, control, and censorship without a push back.\n\nIf a Voice of Just One could Unify the Core of Zeronet to one Unified Front and we could all agree on it usage and purpose its voice would hold magnitudes of power above all the other voices for the greater good of all mankind this would be the greatest Zeronet marketing campaign ever made. The Power Of Zeronet Is Its Usage In Critical Times Like Now To Save The Web From Corporate Greed, User Spying and Its Eventual Self Destruction. Think of the web of a Giant Titanic ship. That entire structure is going down. We are all here to save them or all there social data will be censored and destroyed. And this means all sides. (Its An Anomaly!)",
				"added": 1551025880
			}
		],
		"1548909076_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 288,
				"body": "> [klu9](#comment_71_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @quantumworld: Did you find anything suitable?\n\nNothing at all. I gave up my search for one.",
				"added": 1551226570
			},
			{
				"comment_id": 289,
				"body": "> [leftside](#comment_646_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): For the time being we could use tor-browser to visit google translate site.No IP trace.\n\nWill google allow you to use tor on translate? I thought they were blocking it?",
				"added": 1551233974
			},
			{
				"comment_id": 290,
				"body": "I did find this site. https://demo-pnmt.systran.net/production#/translation\nIt is not open source and it is online. It works ok but it is slow. \nAll translations are is just a database cross referenced words. This should be an open source database. Maybe some company will donate there work for the common good for everyone in order to increase world wide tranlation development time for future translation projects. Its the only way to preserve there work if there company ever fails.",
				"added": 1551282368
			},
			{
				"comment_id": 291,
				"body": "> [klu9](#comment_72_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): TLDR: [...]\n\nThank you. Lots of information to go though. I wonder if a stand alone translator could be integrated into Zeronet. I think that would make this platform really cross over the language barriers between countries. Lets make the world even smaller.. lol",
				"added": 1551293904
			},
			{
				"comment_id": 292,
				"body": "> [klu9](#comment_75_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @quantumworld:  Although I don't know how it would work with the backend corpora in that scenario, as they would require gigabytes of space.\n\nIt may require that now but as hard drives increase in size it will be more feasible in the future to have a translator on your computer. I do not like the idea of using the cloud at all. I am sure there is a way to shrink the database as there always is. I am sure there is a way to make a translator 0net torrent. Maybe a cluster translator.\nAllot of computer users have huge drives with nothing on them. Zeronet can fix that. \nSomething that does bother me about zeronet is the maximum files allowed per sub directory. It's not a problem now but it can be a problem in the future. And if 3 million people download 0net and use it now it may break in theory. And that would be a nasty problem to fix. I am sure nofish has looked into this. I tend to go very conservative on computer file structures because I hate repairing them after they break.",
				"added": 1551297046
			}
		],
		"1551558721_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb": [
			{
				"comment_id": 293,
				"body": "I think this has already been made on zeronet.  I cant find the link of the site but I believe it had that option. Keep searching its there I think.",
				"added": 1551561077
			}
		],
		"1551567748_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 294,
				"body": "I just dropped about 40 links to my social media accounts. Probably about 10 people will check it out in the next 24 hours. The goal is to get more people on Zeronet to expand the network to what ever the user base wants it to be. Right now people are ready for Zeronet. And I don't give a dam who they are or what they will post. Zeronet is people seeding power. And my posts are getting some major traction.",
				"added": 1551575137
			}
		],
		"1551690819_1FhXNLERosNJJTSiT3h8muaQVUrX4yzPid": [
			{
				"comment_id": 295,
				"body": "If you can do it, then do it. Great idea. I don't think the hardware can handle it. Prove me wrong. I like to be wrong some times.",
				"added": 1551715007
			}
		],
		"1551712265_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp": [
			{
				"comment_id": 296,
				"body": "A full working copy of that site is in your Data directory. */ZeroNet/data/",
				"added": 1551715252
			},
			{
				"comment_id": 299,
				"body": "> [davidnelband](#comment_1_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp): yes i know but the data/users/* is not copied i.e the data is not copied, im intrested in cloning the data as well, apart from the site itself\n\nThat site should not have any data/users/ on it. You don't need to log in to view or go to any links on that site. So that should be empty. Cloning that site is possible but you will not be able to change anything from the original site if it is changed since you do not have the owners key. In other words when you restore it back if the original site has been changed no updated data files will be shared or used with others sites. (I think I explained that right.)",
				"added": 1551718345
			}
		],
		"1551542268_18yMiH1HZRsMQqRkMQ1xgedMPKFwpbG71b": [
			{
				"comment_id": 297,
				"body": "Mail only works for zeronet users to talk between each other. We do not want to connect it to the normal web mail due to security reasons. I hope this helps.",
				"added": 1551715449
			}
		],
		"1551402068_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 298,
				"body": "He must provide the technical hashtag that the originator only  has or he is a fraud.",
				"added": 1551715617
			}
		],
		"1553286882_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 300,
				"body": "> [krixano](#comment_649_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): That's not completely true. There are other Id providers, including KaffieId and KxoId - both of which use ZeroNet's network. KaffieId is fully decentralized and doesn't guarantee username uniqueness. KxoId will be federated in the future. [...]\n\nHow would you find it if you were a new user just downloading Zeronet? It is not in the default bookmark download file.  Try re- downloading a new zeronet and try to use it with no links. \nMaybe I have a problem with my browser.",
				"added": 1553288012
			},
			{
				"comment_id": 301,
				"body": "> [krixano](#comment_650_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It might be a china thing.\n\nMaybe. I was about to do a help video for zeronet but I cant. Maybe later.",
				"added": 1553288105
			},
			{
				"comment_id": 302,
				"body": "> [krixano](#comment_651_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): ZeroSites does - but there's no search. There's 0list. You might be able to find links to them from ZeroTalk. etc. [...]\n\nIt just looks very bad for a first time new user. You wont be able to do anything on zeronet with the default links.",
				"added": 1553288244
			},
			{
				"comment_id": 303,
				"body": "> [krixano](#comment_652_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Well - you can still view zites, just not post to them.\n\nThat would be a very quick uninstall for many users as a junk program that does not work. Hopefully this can be fixed so we can expand zeronet and not loose users.",
				"added": 1553288374
			},
			{
				"comment_id": 304,
				"body": "> [krixano](#comment_653_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Let me make sure I'm clear, though: Only the \"official\" zites only accept ZeroId. Many of the other zites, that you can find on ZeroSites and other zite link aggregators, allow for at least ZeroId and KaffieId.\n\nI will re try to create a new user later on and test it again to see how far I can get without using any prior links to log in. Can you post a link to the other id site?",
				"added": 1553288617
			},
			{
				"comment_id": 305,
				"body": "> [krixano](#comment_654_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): \n\nThank you very much. \nI will see if this works. Now is the perfect time to get new users to Zeronet. Newzeland is now blocking news sites and many other countries are doing the same now. Newbe users will be totally lost with zeronet the way it is working now.",
				"added": 1553289047
			},
			{
				"comment_id": 306,
				"body": "> [krixano](#comment_655_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I agree, which is why I'm actually going to create a GitHub issue regarding what zite links are put on the welcome page of ZeroHello.\n\nGood idea!  I need to create an account on github.  I am on Minds.com and I have been posting about zeronet there. I noticed that allot of people would log into zeronet and would not get back on. This may be related to that problem. The world is ripe for Zeronet. We just got to get the word out, and show people how to use it. Also how to use tor and zeronet together would be a great help as well.  I would love to see 1 million users on zeronet. Could be really fun.",
				"added": 1553289482
			},
			{
				"comment_id": 311,
				"body": "> [nickwa](#comment_67_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): A lot of people try something, then leave if it is not something popular. But even if it is something popular, you cannot guarantee 100% retention.\n\n80% retention rate would be Fantastic. Its open source so you are the marketing team.",
				"added": 1553466820
			}
		],
		"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD": [
			{
				"comment_id": 307,
				"body": "There will be a technical way around any ban. Create a rolling proxy ip addresses that will rotate around encrypted. Kinda like tor but everyone who uses it also serves out there own ip to use. It would be nearly impossible to block.",
				"added": 1553291355
			}
		],
		"1552871267_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 308,
				"body": "> [hi7](#comment_7_163wft59zLGW1zNA6WBsppjFEbXxAfAseY): there is no other intelligence than intelligence of man, advanced computers are just thought out from another mans mind to control your mind. If you fall into this trap, you are a victim of another mans mind.\n\nAgreed!",
				"added": 1553291855
			}
		],
		"1553054808_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 309,
				"body": "Internalnet kicks the internet's ass. So few reach such levels of knowledge.",
				"added": 1553292514
			}
		],
		"1553291767_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 310,
				"body": "> [mg0](#comment_13_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Do you have a list of sites going down or malfunctioning? it could help focus efforts.\nNow very small list are just the ones that I know of that I have personally seen. I have seen reports of other ones as well. I do not think that anyone has compiled a complete list yet. The outage range from entire sites being shut down such as facebook was down for 24 + hours and sites like liveleak.com had very crazy drop outs of malformed pages. Unless some were doing server updates the outages seem all to be around the same time line as the NewZeland shooting. Personally I think that the intelligence agencies were pulling portions of these websites dns. \n\nFacebook.com\nliveleaks.com\ngab.com\ninfowars.com\nminds.com",
				"added": 1553300746
			}
		],
		"1553457290_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 312,
				"body": "How do you install plugins on zeronet?",
				"added": 1553467103
			},
			{
				"comment_id": 313,
				"body": "> [krixano](#comment_690_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Btw, I'm considering starting work on a plugin that will allow easier installation of plugins. Because this is one of the things really needed in ZeroNet, imo.\n\nPlease do!  Making Zeronet easier to use is key to a establishing a good solid user base for everyone.",
				"added": 1553468696
			},
			{
				"comment_id": 314,
				"body": "A plug in for Linux should be an executable shell script that auto installs the code to the right folder on zeronet without breaking any other programs. Later version should include an icon of some kind that links to the executable shell script. This should all be done at the user level and absolutely no accelerated privileges should be given to that plugin.  A gui version in zeronet with a pull down menu that would ask you to load that (executable script) program would be the easiest for new users. (Now where this would go in zeronet is the question.)",
				"added": 1553471158
			},
			{
				"comment_id": 315,
				"body": "> [krixano](#comment_692_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I already have ideas on exactly how I image this being done. Basically, a zite can request ZeroNet to install a plugin from a zip file - this way we can have zites like KxoNetwork have an \"install\" button. Then ZeroNet will give a notification in the top right asking if you want to install the plugin. Then, if the user clicks \"yes\", ZeroNet will unzip the folder and place it into the plugins folder automatically. [...]\n\nWe also want to include an uninstall option as well.  Just incase a plug in causes problems, or the user does not want to use that program as well. There needs to be a plug in manager of some kind. This would stream line the process and give new users the ability to control there plug in experience. (This Sounds so scripty..)",
				"added": 1553471790
			},
			{
				"comment_id": 316,
				"body": "We are now getting to the small tweaking fase that will make zeronet POP to new users. Next would be a massive help man section. Maybe like how android games do this pointer thing that shows you how the games gui are to be used. Goal is to walk the users first time experience into a self help working demo. With an option to bypass it as well. \n\nThink of this is like telling windows users that Linux needs no drivers. And it is built into the operating system. You get this blank stare like there universe was just altered in such a way there mind just stopped working for a second. \nThis is where Zeronet is at now with new users. I know this because it happened to me and I am a Linux user. This is a huge marketing learning curve that we need to be aware of before total global domination of zeronet users world wide occurs and centralized servers will be remembered as the dark age of the internet.",
				"added": 1553472837
			},
			{
				"comment_id": 317,
				"body": "This plug in failed to work after restart. Please include installation instructions to the exact folder that this needs to be put in and how the plug in works.  A screen shot of the program actually running would be also very helpful.",
				"added": 1553478239
			},
			{
				"comment_id": 318,
				"body": "> [krixano](#comment_696_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): How do you know the plugin didn't work? What zite did you test it on? And how do you know that it isn't the zite that's not working, rather than the plugin? [...]\n\nI have removed the plug in because there was no link to instructions or a .txt file to instructions as to how the plug in works. As for what zite this works on you never provided any details to any zite that this should be working on. This is a common problem with programmers that expect users to read there minds when using there program. \nI am sure it works for you because you have more information about its usage and purpose than just a link to an install program.  Until that is provided this conversation is pointless.",
				"added": 1553479801
			},
			{
				"comment_id": 319,
				"body": "> [krixano](#comment_697_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Thank you for providing additional information that is needed to run the program.",
				"added": 1553480628
			}
		],
		"1553483525_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 320,
				"body": "A China block?",
				"added": 1553490925
			},
			{
				"comment_id": 321,
				"body": "> [kai0](#comment_1012_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): if clients on personal computer maybe hard to synchronize because not enough peers, but clients on server should can synchronize data each other because server has IP address, they can find each other by IP address. [...]\n\nWouldn't that make it easier to gather ip information as to who has what site. Correct?",
				"added": 1553493028
			},
			{
				"comment_id": 322,
				"body": "> [kai0](#comment_1013_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): who care\n\nObviously the communist party cares allot. That's why you are in here.",
				"added": 1553495671
			},
			{
				"comment_id": 323,
				"body": "> [kai0](#comment_1014_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): \n\nLOOL!!!",
				"added": 1553496306
			},
			{
				"comment_id": 324,
				"body": "Maybe he can code in a siren with flashing lights.. lol\n..",
				"added": 1553496826
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 325,
				"body": "Zeronet Marketing is and uphill battle because of such a small user base currently. However this will change over time. Its like they said that the internet would never take off and then it took over. Can zeronet replace the current web? Yes. The censorship that is currently going on and it will get even worse will force users to either go to Zeronet or shut the hell up about anything that would be offensive to some idiot minority communist person. We will see how well this works out over time. \n\nExample site from clearnet that is using torrents 4 k live stream if needed. \nhttp://127.0.0.1:43110/1qJ3EM5rTa2wPTBvJuCFjdLXjrBCgBkR8/",
				"added": 1553526017
			},
			{
				"comment_id": 327,
				"body": "> [krixano](#comment_701_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Or, you can promote a non-cloned zite by @styromaniac: 4Kave, which streams 4K Videos through ZeroNet only (using Big Files).\n\nThat site broke when trying to play the video's or I would have.",
				"added": 1553527367
			},
			{
				"comment_id": 338,
				"body": "Zeronet needs a wordpress like template's. I am sure things like this will be developed over time. Four years is not long. Remember how clunky the early web was?  The best websites were nothing but text links. A good example of that is drudge report. I do like how any comment you follow pops up on your zerohello site. The over all look of zeronet is good and I am sure it will improve over time. Will it replace clearnet? Not yet. However the more they censor,  the more zeronet becomes more viable for everyone.",
				"added": 1553806201
			},
			{
				"comment_id": 340,
				"body": "> [eightyfour](#comment_83_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): This is doable, we just need someone to actually do it! wink wink\n\nOmg, this may end up being a community thing where everyone gets a headache reading how to code html. It cant be as bad as learning lisp.",
				"added": 1553818287
			},
			{
				"comment_id": 343,
				"body": "> [nickwa](#comment_74_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): . http://Minds.com is one example of majority of majority of the user base not knowing how to code, yet is developing rapidly with tons of features, and will soon have a version on the DAT protocol.\n\nMinds is good but it is not a full peer to peer platform. Many people here found out about zeronet on minds.com.  And I do like minds, however it has some problems that zeronet does not have.  We need everyone to talk about zeronet on every social media site. Zeronet will save the internet.",
				"added": 1553889265
			},
			{
				"comment_id": 344,
				"body": "> [nickwa](#comment_75_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Minds is moving to DAT and peer to peer solutions.\nI have heard this for a while now and there is some movement. My biggest problem with minds is that the content being posted is re circulated over and over and over. I have complained about it to the minds group no one seems to really care. Without that stupid bell notification drop down minds would be a dead stagnant platform. Also boosted content is counted for multiple times viewed. Have you ever seen the same boosted post 3 or 4 times? Well they are all counted in that boost.  I like minds but to me it is like a stale site of the same post over and over. Also to find new post content that is happening at the time of the request you need to search for it and click the latest button. A very cumbersome way to do it.  Minds needs allot of work. The more you use it the more you go WTF is this thing doing?\nI hope they can get things fixed but my issues with them gets slapped down by the top developers who like there site like that. Even though thousands of users have complained about the exact same issues.  It wont change until some one forks there project and makes it better. \n\n Its kinda like the emacs and the xemacs fork.  Emacs got stale until xemacs kicked them into competition mode.",
				"added": 1553908375
			},
			{
				"comment_id": 345,
				"body": "> [nickwa](#comment_78_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I use it extensively and see new content constantly.\n\nYou need to use it for about 4 months or more to notice the post repeats. It may be a bug on there platform. Lots of people have complained about it. It is very annoying to see the same post four or five times pop up as a new post on the feed.  I have never seen that problem here on zeronet or on gab.",
				"added": 1553910958
			}
		],
		"1553340416_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 326,
				"body": "[[So what we have to do is to never rely on begging mercy. Begging is not how wars are won. I do believe the top 1% of the 1% is at war with the rest of us.]]\nYou just figured that out. Congradulations..  Now when you figure out that the Private Federal Reserve makes money from nothing and there share holders get almost all of what they make then you will see the bigger picture. Until then you are still clueless. The federal reserve families rule America and the U.K. They are all total scum of the earth.",
				"added": 1553526543
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 328,
				"body": "Was I not right? Zeronet will be the internet version two. Lets not make the same mistakes this time.",
				"added": 1553694353
			},
			{
				"comment_id": 329,
				"body": "Just drop the zeronet link out there and help out all the new people when they join. Zeronet reminds me like the early web was when it first started. The digital wild west..",
				"added": 1553699350
			},
			{
				"comment_id": 336,
				"body": "> [infinyte](#comment_5_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5): Thats correct. We need to spread the word about a decentralized internet. The more the better.  \n\nI think i have 90% of the web that has been removed saved on my drives here. I may post some of it on zeronet. Depends on the interest level.",
				"added": 1553710883
			}
		],
		"1553530288_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 330,
				"body": "Wow Gopher! Now that goes way back if it is the same gopher program that was released before Mozilla.",
				"added": 1553699701
			},
			{
				"comment_id": 331,
				"body": "> [krixano](#comment_706_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): There's still a community using it, and I'm on there.\n\nWow! You just blew my mind. I loved gopher back in its day. It worked very well on dial-up and low speed connections. I was on the darpa net back then. (Hacked In!) The stupid things you do when you are a kid.",
				"added": 1553700338
			}
		],
		"1553703736_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 332,
				"body": "You left out that everything will be done in the command line.",
				"added": 1553704478
			},
			{
				"comment_id": 335,
				"body": "Kinda funny how smart phones make the user dumber using them. Emacs desktop is the only one that will keep you smart while pulling your hair out at the same time. (Sorry, a Little Lisp Joke!)",
				"added": 1553707448
			}
		],
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 333,
				"body": "They don't follow that rule anymore.",
				"added": 1553704586
			}
		],
		"1552480101_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 334,
				"body": "Can you trust it?  Anyone do any security tests on it?",
				"added": 1553704899
			}
		],
		"1553709852_1CYxQVr5DjuxAebfadW9q7wNF9fFe9A758": [
			{
				"comment_id": 337,
				"body": "Every Youtube video I have seen so far about Zeronet has been mediocre at best. Many of them got some technical things wrong about zeronet, and did not spend the time to do any research on the subject material. Several other ones were good but there audio quality was so bad it was barely ineligible. There is allot of room for improvement.",
				"added": 1553747746
			}
		],
		"1553796164_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 339,
				"body": "> [ssdifnskdjfnsdjk](#comment_763_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): zeronet is good software for this, though there is long way ahead so the [...]\n\nThis is why I like zeronet.",
				"added": 1553806434
			}
		],
		"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 341,
				"body": "> [malladis](#comment_2_18bPiPS2hgoc8pbS8Ku8aoWQ748jfC6vkV): Also how could Zeronet deal with vast numbers of users? [...]\n\nActually zeronet is quite fast for being what it is. Remember the load balancing of posts would be distributed between peers. My theory is lets get a million users on here and test it. I bet it could handle the traffic.",
				"added": 1553823711
			},
			{
				"comment_id": 342,
				"body": "Malladis: Some good technical info is in here.\nZerowiki\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/\nImportant Zites\nhttp://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/?/",
				"added": 1553823887
			}
		],
		"1553950519_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": [
			{
				"comment_id": 346,
				"body": "I used google + only a few times. I knew how Google was marketing it that it was pure evil or they would not have been pushing it so hard. Turns out I was right.",
				"added": 1553952839
			},
			{
				"comment_id": 348,
				"body": "Diff, this is what you get when we trust a corporation to keep data. To me it is digital book burning no matter how you slice it. I think that p2p is the only way to ensure data protection.",
				"added": 1553953542
			}
		],
		"1553905331_1KinYupoFogGajrGGqNr6MmoR6fVJJnwqE": [
			{
				"comment_id": 347,
				"body": "There are hundreds of zerotalk sites. Anyone can clone one and make there own for any topic.",
				"added": 1553952944
			}
		],
		"1553907908_1Mdd1Rr251uwYJk6WcR3ovSPR1r5NxesdY": [
			{
				"comment_id": 349,
				"body": "A hypocritical corporation with an agenda to only allow speech Jack Dorcey agrees with. Its best not to post there because posting to twitter is offensive according to the admins there. (Its actually true!)",
				"added": 1553954118
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 350,
				"body": "It is Growing! Big things are in the works now with Zeronet. Stay tuned..",
				"added": 1554163329
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 351,
				"body": "Since Zeronet is actually not the internet we are not regulated by there law. Unless you live in that country. Technically Zeronet is just a torrent that shares data with other torrents. That's all it is. (I am leaving out all the other technical details that no government should be interested in bothering with.)",
				"added": 1554164130
			}
		],
		"1554133768_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 352,
				"body": "LOL! The U.S. has been doing that for years. I remember reading about how people would get messed up gps data around military bases. Its an easy circuit to build. This is why I am 100% against driver-less cars. The technology lacks redundancy checks and is extremely dangerous to be around when operating.",
				"added": 1554164404
			}
		],
		"1554165337_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 353,
				"body": "April Fools!!!",
				"added": 1554282400
			},
			{
				"comment_id": 354,
				"body": "Punch card ram expansion using pictures. Omg, people will believe anything if you say it with lots of technical terms. Who knows I may do a fake android app in the future just for laughs.",
				"added": 1554282537
			}
		],
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": [
			{
				"comment_id": 355,
				"body": "More users = more content posters..  There are only about 40 people using this app that speak English. The rest are in China. Ok, maybe there are more. The main thing is getting new users by posting content that you cant get anywhere else. And the way things are looking that content is going to be anything that the clearnet has now since they are censoring everything.  There are allot of sites but they lack users. Zeronet is like a huge amusement park that has no signs. So far my zeronet is about 21 gigs. Most of space is used for videos.",
				"added": 1554282919
			},
			{
				"comment_id": 356,
				"body": "Remember to post links to your sites you make everywhere or users wont find them. This is p2p and no bots are out there pushing content to you like on fakebook or twitter or minds. Zeronet is the future. And it is about to explode with new users.",
				"added": 1554283065
			}
		],
		"1554273632_1HBVHa3TE5NnztRdn1geJmMKTZ7HJsEvLV": [
			{
				"comment_id": 357,
				"body": "We just need users who dont close down zeronet like a regular program. Don't worry when all words are banned for hate speech on clear net they' can go to zeronet.",
				"added": 1554297405
			}
		],
		"1554227095_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 358,
				"body": "I thought there was a white on off white nearly impossible to find button that had a delete post as an option?",
				"added": 1554297521
			},
			{
				"comment_id": 363,
				"body": "> [klu9](#comment_141_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @leftside: , @quantumworld: I feel silly now that I see it. Thanks! [...]\n\nWhite on white font for an edit/delete icon is a color is just asking for lots of questions from users having the same problem. I have a blog I have never published yet on zeronet just learning how things work. Don't feel bad. I ask lots of really stupid questions as well. No one can be expected to know everything about a computer now days.",
				"added": 1554302807
			}
		],
		"1553958946_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 359,
				"body": "It works fine. As usual system seems to run just a little faster than before. Try it you can always go back to the older kernel on your boot loader if there are any problems.",
				"added": 1554297826
			}
		],
		"1553953681_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 360,
				"body": "> [musickiller](#comment_1_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): You can always delete old stuff...\n\nHow would you delete old stuff?.  Remover your posts? Or get into the actual site and remove some html?",
				"added": 1554297977
			}
		],
		"1552787641_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 361,
				"body": "Cherry tree it. https://www.giuspen.com/cherrytree/ This program may be of some help when you want to search large amounts of information looking for related search material. Its free and open source. Great program to hunt text related things down.",
				"added": 1554298196
			}
		],
		"1554087330_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 362,
				"body": "It would still be a p2p network. Those that bump into that user would get the added benefit of the data center. Those that don't bump into that user wont ever see it. Please correct me if I am wrong on this.",
				"added": 1554298677
			}
		],
		"1555156444_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 364,
				"body": "Has nofish disappeared? Or is this just hypothetical?",
				"added": 1555164468
			},
			{
				"comment_id": 370,
				"body": "I think in the future, everyone on Zeronet will need security guards around them. They wont allow free speech globally at all by any government very soon. And everyone here will be hunted down like animals. Unless we bring the numbers up for Zeronet users we are all doomed.",
				"added": 1555215060
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 365,
				"body": "They are all being controlled secretly by central authority. Do not wake them from there sleep or they will be required to think again.",
				"added": 1555164642
			},
			{
				"comment_id": 368,
				"body": "> [shitnotworking]\nClearly you have broken with central command authority. Please stare at your phone more and do not question anything we tell you.",
				"added": 1555214319
			},
			{
				"comment_id": 371,
				"body": "> [anonymouslogin](#comment_211_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I thought that not thinking is their biggest problem. They uncritically accept many things. It seems to them that sending photos to evil corps every 5 minutes is cool, that their dumb addiction is cool etc. They even do not know how big their ignorance and lack of knowledge is.\n\nThis is what Zeronet is about. They cant stop the next technology revolution. The internet is designed to withstand a nuclear war. This may also include a war between the people and government corporations. We live in the most insetting times right now with computer science. Now to code us all in the right direction. Open source is leading everything right now in computer science. Now it is up to us to kill the self writing lisp scrip files that they mislabel as artificial intelligence.",
				"added": 1555231926
			},
			{
				"comment_id": 372,
				"body": "shitnotworking: As you and I know that all words are hate speech words. Everyone is guilty and they all need to all be arrested to save the earth from children. Support you Communist leader and Support The Final End to Hate Speech! \n(You can call me trigger.)",
				"added": 1555249687
			},
			{
				"comment_id": 378,
				"body": "Tragic student, 22, dies hours after suffering severe brain injuries when she fell 40ft from Fordham University's bell tower for an Instagram picture. \n\nWe have the invention of green screen where you can make all kinds of cool fake pictures that look real. And you wont die using it. I guess this is all just natural selection.\n\n(Warning Clear-net link) Lots of add spam. \nhttps://www.dailymail.co.uk/news/article-6921097/Pictured-Student-22-fell-Fordham-Universitys-bell-tower-4am.html",
				"added": 1555298189
			},
			{
				"comment_id": 380,
				"body": "> [shitnotworking](#comment_10_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): ...SO WHY NOT POST  [...]\n\nI am not anti technology.  I am anti Stupid technology. Big difference. The smart spy phone is one of those inventions that will be stopped or there will be a technology Cival war against such devices. As Joseph Gerbal says. \"You should have nothing to hide.!\" I hate Nazi's and will always be that way.",
				"added": 1555407729
			}
		],
		"1552196439_1C7YrxNaqMVjJNqJ1NWMSnzCLdpyfZz27z": [
			{
				"comment_id": 366,
				"body": "I use a typewriter. And all electronic devices are left in my Faraday cage at home. Don't worry they will eventually release a super bug that will eliminate the human race. To make a green utopia, and to cover up all the crimes they have been committing for the past 100 years.  These are the best days for Democrats they should all be proud.",
				"added": 1555165394
			}
		],
		"1554997177_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 367,
				"body": "Please make your terrorist donations to....  LOL....",
				"added": 1555165674
			}
		],
		"1555185007_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 369,
				"body": "Total BS! But a great way to make money. Nothing is more fun than selling a bunch of BS to the tec stupid and watch them run with it and selling devices that will stop it from happening. For example Moors Law toilet paper. Huge potential seller to people with hemorrhoids. The list is endless. Lets all embrace this new TECHNOLOGY Armageddon to keep peoples minds away from 5G!  I just cant wait to fry peoples minds with 5G!!!!",
				"added": 1555214775
			}
		],
		"1555245602_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 373,
				"body": "Probably system upgrades and updates. This usually happens over the 24 hours of Saturday and Sunday. They usually will schedule these maintenance periods based on last years lowest connected users network activities. \n\nI just heard that Mark Sukaberg (The Robot) is going to get chopped from Facebook by the board of directors. Not that any one uses there site anymore that is on zeronet. Might be related to outages. Mark may be pulling some illegal plugs away from Facebook before he goes to Jail.",
				"added": 1555250157
			},
			{
				"comment_id": 379,
				"body": "> [franc](#comment_8_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4): sry type error 24.000$\n\nI wonder how much they loose when they are up and running? Have you seen the browser cookie data that goes back to facebook and twitter? It's insane.  Every site you visit they get a address ping back on most sites.",
				"added": 1555337568
			}
		],
		"1548171944_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 374,
				"body": "quantumkitty \nThe us will most likely invade. I think it is time the U.S. stops the flood of people from that country from the US and crashing our borders.  Since that country was so pro Nazi in the past invasion should an absolute green light for an invasion. Sorry I hate Hitler and all of the Nazi Socialists Democrats posing off like they are not racists. They are using the exact same tactics as Hitler did in WW2. Projecting out criminal activities you are involved in is a huge weakness. They will all be easily crushed.",
				"added": 1555250733
			}
		],
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 375,
				"body": "My motto is the following. You Spy You Die! Choose your side.",
				"added": 1555250881
			}
		],
		"1555102211_1DneKe6JjGR26ykd5DWaMJoNyNTnHRHb2q": [
			{
				"comment_id": 376,
				"body": "All computers are compromised. It is at the hardware level, and it cant be fixed other than an off switch. Nearly all electrical devices can be effected by this.",
				"added": 1555256150
			},
			{
				"comment_id": 377,
				"body": "> [jeej](#comment_3_1KEXLrCcQYabnbLngN1Vh3VnG3yD2h21Uj): I agree. [...]\n\nI will never trust a computer until I can look at all the schematic diagrams of every chip. Plus to be able to test it with other electrical engineers. We have no privacy. And they are not doing all this spying to stop terrorists. They are the terrorists. They are using this spy system to allow them to get away with the \"Problem, Reaction, Solution,\" Operations to remove all your rights in every country. They want everyone in cages and if you don't resist this it will end up like that.",
				"added": 1555292518
			}
		],
		"3490_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": [
			{
				"comment_id": 381,
				"body": "Delete your browser cache. Do a full power shut down on your computer for at least 2 min. Then reboot system and see if the problem is fixed. This fixes 90% of bugs on browsers. Also see if the bug is the same on a different browser.\n\nIf you have already done this then disregard.",
				"added": 1556729671
			}
		],
		"1557012094_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": [
			{
				"comment_id": 382,
				"body": "We are all in a cycle of a circle of centralized and decentralized. Both have advantages and disadvantages when abused. Right now decentralized is the answer to a monopoly centralization of data and data collection. I think that the combination of both to keep each system in check will be the future answer. We are not there yet. This is all cutting edge technology and how humans interact with this technology is an unknown. I think that Zeronet will be a big player in this.  Lets see what the Zeronet active user base looks like in a year.",
				"added": 1557017765
			},
			{
				"comment_id": 383,
				"body": "> [duende](#comment_27_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): duende\n\nWelcome to my Block list! Enjoy!\nBtw to any new user to zeronet this user is a negative bot spammer.  You may want to add it to your block list. Unless you like to see spam comments like this everywhere.",
				"added": 1557020230
			},
			{
				"comment_id": 385,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_87_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I prefer to destroy these people, it's more constructive for the group, and I love eating one from time to time.  [...]\n\nIf what you are dealing with is a human then yes. I just did a search on his nick and every thing posted is like a one line script. I doubt there is any human behind that nick at all other than a Linux shell script that can read html pages from new posts and comments. It is designed to waste you time responding to it.",
				"added": 1557021712
			},
			{
				"comment_id": 386,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_88_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): That's a nice spin on the first amendment that fails. So you are saying that we dont need the first amendment because of the free masons? LOL!\nHowever I do admit that the Freemasons are very criminal they are not the main problem. The federal reserve is the main problem. All roads lead to them. Do your homework if you are legit. If you are some paid actor to push out BS propaganda may you and your family be Vaporized in the worst of the worst ways.",
				"added": 1557024980
			},
			{
				"comment_id": 396,
				"body": "h3bhkj5gqz4n3pjm: Ok cool. Start a Zite about it. I have been down that rabbit hole twice and it leads to dead ends. If there is some new juicy meat to something new I would like to know. Wikipedia for fact checking is about the worst you can get. All data there needs at least 10 points being fact checked out for each story. The story ends up with either Jesuits or Jews as the bad guys. Same psyop same story line. (Yawn!)....",
				"added": 1557079371
			},
			{
				"comment_id": 397,
				"body": "h3bhkj5gqz4n3pjm: (It is also that WE NEED LEADERS, TO TORPEDO THIS MASONIC CREATION;DEMOCRACY,\nAND RESTORE CHRISTIAN VALUES IN THE WEST.)\n\nYou really are an SJW SPL paid spammer aren't you.  Get rid of free speech to stop the Masons.. (LOL!!!!)",
				"added": 1557079646
			}
		],
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 384,
				"body": "All browsers suck. I just dumped chromium 5 months ago because it was a memory hog. Opera I dumped because it is owned by China. The list goes on and on..  I really think there is an active group out there that is hitting the browser developers on purpose to control content that you are using. I am basing this on statistical analysis of the same problems that users are having. It is always _____ user doesn't like _____ content and want it all banned because of ___ reason. Its like a re occurring script file. Users need to make there own choices as to what they are using and running on there system. And never let the scumbags start dictating what you should or should not say about anything. Every day I am offended by someones online post. And I love it that way.  SJW are nothing more than velvet glove Nazi's. Treat them as such and this problem will go away very quickly.",
				"added": 1557021513
			},
			{
				"comment_id": 387,
				"body": "> [mrsharp](#comment_6_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs): This all might be the perfect opportunity for a fully integrated zeronet based browser to be created. Or is on already being worked on?\n\nIt is already being worked on now. The browser is very buggy the last time I tried to use it. I do not remember the name of the project. Someone else here would know the name of the project.",
				"added": 1557025119
			},
			{
				"comment_id": 388,
				"body": "> [digitalprophet](#comment_2_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): It will just take you about 20 min. Easy stuff. lol  We can use more alternatives. They all suck. Brave had some promise but it is incompatible with Linux lol.",
				"added": 1557045749
			},
			{
				"comment_id": 389,
				"body": "> [digitalprophet](#comment_6_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): Please fix your attitude, for yourself I mean\n\nMy attitude was fixed a long time ago. If you can code the program I am 100% behind you. I am sure you will use a branch of open source code that is already out there. Doing it from scratch would be a nightmare. Then again I don't code that much. And btw I am always negative. Is that a problem? (GRRR!) lol..",
				"added": 1557046813
			},
			{
				"comment_id": 391,
				"body": "> [digitalprophet](#comment_10_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): Man if you have that much talent then code it.  I am 100% behind you even if it totally sucks just do it. I have been working with open source for 20+ years on Linux. I have done allot of debugging and hardware testing. If you think you can make a better browser just do it because they all suck. The hardest thing with coding is knowing when you have hit peak design levels to user usage. I call it perfect code layout design. When you hit that peak fork your next version because it will start to decline in usability. Its a very noticeable problem with open source programs and it needs to be addressed as a development issue. Better known as peak program and then go to a static bug fix. Then next version if you plan one should be either a fork or experimental design. However with browsers it is a constant evolution in bloated code. (Currently)\nAnd please code menu's and not one menu that does everything under the sun but you cant find anything. Best thing is user choice. And avoid at all costs the gnome 3 style. (So minimal its unusable.) Also low memory usage. Now if you could combine tor, Zeronet and all the other p2p sites in one program that would be a huge WOW factor if it all worked right. Also you would be the first to do something like that.",
				"added": 1557048720
			},
			{
				"comment_id": 392,
				"body": "> [digitalprophet] All Linux distros have issues. The manjaro dependency choices were mind blowing and code blowing as well. I was not impressed with the way they were doing things on the installer either.  Every Linux distro is having problems right now. I think it is development burn out with the community.",
				"added": 1557049088
			},
			{
				"comment_id": 393,
				"body": "> [gametangia](#comment_20_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW): \nBrave needs some more brave volunteers to code. Its clunky at best. Your mileage may very on it. I stand firmly by my original statement. They all Suck.. To much code trying to do to many things and lots of bugs= Garbage! It will only get better when they can package machine language code in a container. (Ok, I just blew a couple of minds saying that!) This will be after they make those quantum cpu's that can simulate binary computers. \n(Segmentation Fault! #EEEE44444695387)  lol",
				"added": 1557073569
			},
			{
				"comment_id": 409,
				"body": "Expect a full computer and network shut down in the future. When the Cia makes there move everything will go down. This includes gps systems, software and hardware. We will have 7 days of no power and no internet just to push our buttons and let everyone know who is in control.",
				"added": 1557189892
			},
			{
				"comment_id": 410,
				"body": "[leftside](#comment_742_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): \nThey can always flip it to chromium. Many browsers out there use Scroogle, oh sorry Google.",
				"added": 1557199311
			},
			{
				"comment_id": 414,
				"body": ">[delta9](#comment_9_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1): Let's assume something like that did happen. At that point you enable Bluetooth and start distributing the Manyverse app to your friends. \n\nOh ya that sound great for a radius of what 100 feet around your device. Unless you live in a highly populated city it would be pointless.",
				"added": 1557255319
			},
			{
				"comment_id": 422,
				"body": "> [duck0](#comment_50_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): While this is a possibility, I believe it would cause far too much chaos to control, and not all systems are in lieu with each other.  [...]\n\nI have seen technology that if I ever told you about it you would think I was totally insane. No one currently has any privacy at all. If I want to make something fairly secure I use a manual typewriter from the 1920's. At least I know it would be impossible to be hacked from the power line. I recommend that everyone should own a manual typewriter. It will survive just about anything. All electronics have back doors in them. I mean everything. There is a break away black opp technology that is absolutely mind blowing. However I stand very firm with the you spy you die philosophy. Many more should follow these same principals and we could change the world together. And if I hear the excuse \"I only did it because I need a job.\" I will explode.",
				"added": 1557274336
			},
			{
				"comment_id": 429,
				"body": "> [delta9](#comment_12_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1): It may be time to adjust your understanding of Bluetooth Mesh.\n\nYa, it's called another security vulnerability. No thanks...",
				"added": 1557295616
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 390,
				"body": "> [ssdifnskdjfnsdjk](#comment_803_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Like an adult content warning page with an ok button to enter it. Or and nsfw. (Not safe for work). That is a good idea.",
				"added": 1557047453
			}
		],
		"1552575038_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 394,
				"body": "Nice site!",
				"added": 1557075206
			},
			{
				"comment_id": 395,
				"body": "I cant upload any videos. It Crashes the tab.",
				"added": 1557075461
			},
			{
				"comment_id": 406,
				"body": "[sharer](#comment_35_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): I really like the look of your site. Really good color combinations that pop out. Just the back end is a little messed up. The kaffie video site is really good but that 25k thumbnail size limit is a pain in the ass to make. Somewhere some one has a thumbnail generating script file that works on everything that will auto generate thumbnails. This sounds so trivial but my average video upload I waste more time making a dam thumbnail than the video upload. Portions of Zeronet remind me of the early days of Linux. Before there was a gui for Linux. Remember everyone here is on the ground floor of a super huge p2p network that is currently expanding. There will be a demand for web developers here on Zeronet by companies from around the world. I actually like Zeronet more than the regular web. Zeronet is 30+ gig strong and growing daily.",
				"added": 1557150000
			},
			{
				"comment_id": 447,
				"body": ">sharer: Just remember that allot of Zeronet is on some old systems. So mining will probably bring down some systems or make it totally unusable.",
				"added": 1557460832
			}
		],
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 398,
				"body": "About 95% of the commenters must be from China. No one is that dam stupid about free speech. BTW those of you that hate free speech so much WTF are you doing on Zeronet? Shouldn't you all be on twitter sucking up some of Jack Dorcey's ass fart's?",
				"added": 1557082077
			},
			{
				"comment_id": 399,
				"body": "Subxero:  Zeronet is ready for everyone. So toss some links out and advertise it. You know it is good when you get lots of backlash about posting links. Government's hates Zeronet because they cant control it.",
				"added": 1557082259
			},
			{
				"comment_id": 400,
				"body": " [subxero](#comment_6_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL): I have been in chat rooms for 30+ years and the tactics are exactly the same thing over and over. Its like they never updated there play book and they all act about the exact same. I actually find this so laughable it isn't even funny. Oh well, I may even wright a lisp script file to analyze there content. I can do more with Zeronet since the data is right here to look at. And the search on Zeronet is pretty good.  If ____ user name says _____ then say _____ to counter and side track ____ conversation. (Yaaawwwnnnnnn... It's so boring!!!)",
				"added": 1557087222
			},
			{
				"comment_id": 401,
				"body": "> [quantumworld](#comment_400_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): \n\n [subxero](#comment_6_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL):\nI do not think that the android app is ready for prime time for the average user. But that is now and it can change. Maybe the next version will address some user gui ease of use issues.",
				"added": 1557087442
			},
			{
				"comment_id": 402,
				"body": "[subxero](#comment_7_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL): I think there is one guy running hundreds of user accounts on many virtual machines on a bunch of chat rooms. I don't have the computer horse power to do a large data grab of postings on twitter Facebook and other sites to do a text trend analysis. I am sure if some one could do that they could trace it back to a central type of code or user text style. Here on Zeronet it would be super easy todo.  Emacs is really the center of all creation. Shhh don't tell anyone I told you that. The lisp code may leak out. ((*/%) What a bitch of a leak.",
				"added": 1557089397
			},
			{
				"comment_id": 403,
				"body": "[subxero](#comment_8_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL): People get paid $10 an hour to post pre-decided 'talking points' \n\nI am hoping that some one has infiltrated them and will post info on Zeronet. I really think that Zeronet will be the future News open source journalist playground. Some one will get pissed because they got double crossed on there pay and will spill the beans on everything. It always works that way.",
				"added": 1557095875
			},
			{
				"comment_id": 404,
				"body": "[subxero](#comment_9_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL): I have used the android app just once. It is good but not allot of links to how things work on Zeronet. It will get there just needs some design clean up. I rarely use my smart phone anymore outside of the microwave faraday cage I keep it in. I call it my safe space. LOL..",
				"added": 1557096226
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 405,
				"body": "Andrew Yang Is Just Another Velvet Glove Globalist Nazi Left Wing Communist. If you want a soft spoken Hitler vote for this Communist from China. He will destroy all American Job's. Just to create that Communist Utopia of $1.00 an hour wage and unlimited money going back to the state. And with the Deep state's help with all those false flags to manipulate you into a panic mode, you cant go wrong with this Nazi Criminal Extremist. VOTE ANDREW YANG 2020. Make America Worse Again!",
				"added": 1557113229
			},
			{
				"comment_id": 408,
				"body": "[h3bhkj5gqz4n3pjm](#comment_102_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): We must train generations and generations of LEADERS WITH VALUES, there are no miracles. no leaders=no defenders of values.= destruction of society From Within.\n\nThat is one of Hitlers Famous quotes. The left wing is currently a covert Nazi organization. Most of the followers do not even know that they are involved in a covert secret Nazi C.I.A. program that is from project paper clip. How do I know this?  It is all out in the open. The Nazi Socialist Democratic party is the party of Adolf Hitler. Your projection of Hitler on others will be your own demise. You have no idea the quantum shit you are walking into. The Democrats are all Nazi Racists. They are mind controlled sex slaves for the Nazi party. You have a limited time to wake up to this fact before it will be to late for you and your family.  Once the fire starts it will never be put out until you never were.",
				"added": 1557151257
			},
			{
				"comment_id": 415,
				"body": "Vote for the Chinese Communist Spy Andrew Yang 2020. Look into Xi Jinpings campaign donations to his campaign.",
				"added": 1557255536
			},
			{
				"comment_id": 418,
				"body": "> [anonymouslogin](#comment_269_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Aside from the obvious political persuasions of China in general, all I see is  a man with a committee overseeing the removal of corrupt officials from positions of power in the Chinese government. Xi Jinpings doesn't appear to me to be anything but a good influence on the governmental structure.\n\nYou have not suffered from the wrath of Winnie the poo. Those bastards from China are all over the U.S. trying to death threat Americans to Xi Jinpings Communist ruling tactics. Yes, I carry and and would not hesitate one second to put down one of there communist agents in the U.S. from all the shit I have been through over the past 5 years. At least they stopped there following after a very nasty confrontation I had with several of them.",
				"added": 1557269466
			},
			{
				"comment_id": 419,
				"body": "> [anonymouslogin](#comment_270_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Admittedly I know little of the struggles involved in American politics. \n\nI have had 127 attempts at my life so far. I carry all the time everywhere. I use other means of force that is far more dangerous than a gun. The gun is my backup if the first fails. So far I have never had to draw a gun on anyone. I have put 3 people in mental institutions because of what they saw was not in line with there current view of physics. I wont discuss what happened to the others. They are no longer of this earth.",
				"added": 1557270601
			},
			{
				"comment_id": 423,
				"body": "> [anonymouslogin](#comment_271_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What in the world is more dangerous than a gun? The physics reference intrigues me. Would you elaborate on that?\n\nWe live in an electrical universe. Your brain and thoughts are electrical. If you know what connections to make in the universe space time anything can happen. Just be very careful what you think when you do because it may just happen. I wont go into exact detail because it would be pointless since what worked then wont work now. Everything is evolving.",
				"added": 1557275557
			}
		],
		"1557079828_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 407,
				"body": "[kxobot@kxoid.bit](#comment_30_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): What is the code you look for when you find a mining site? I would like to scan my entire zeronet data folder for sites that are running mining programs and remove them. Maybe you have some links that can help. I saw your mining block list. I want a code scanner.",
				"added": 1557150396
			}
		],
		"1557247834_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 411,
				"body": "Sounds like another glorified boot loader that goes into a container or  VB. (Yawn!).\nBut don't let my opinion deter development Code it.. You never know it may be a valuable emergency option if your O.S. blows out on you.\n\nAnd btw you cant shove that code in a bios chip. You would need to make your own bios chip to run it and physically install it on each machine. Most computer systems wont allow you to do this because the chips are soldered in and are not socketed.",
				"added": 1557254501
			}
		],
		"1556845763_1AsV7xMgu5zcF66YxZFYUp1utR12MqaRBd": [
			{
				"comment_id": 412,
				"body": "Zeronet we are but we are not. Zeronet get the web everyone dream of that you control.\nGo to https://zeronet.io/ And become the Future.",
				"added": 1557254677
			}
		],
		"1557231045_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 413,
				"body": "Always elbow them when eating at the table to let them know you except there decision to be left.",
				"added": 1557254778
			},
			{
				"comment_id": 416,
				"body": "> [kaffie](#comment_838_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This would be solved if people accommodate for lefties in seating arrangements. Stick lefties at the left corner seats. Problem solved.\n\nThat's just to easy. Elbowing them is way more fun. lol",
				"added": 1557268837
			},
			{
				"comment_id": 417,
				"body": "Hay what about an ambidextrous day!  I feel totally left out on this. That's right I am ambidextrous. I suffer from Emacs finger's syndrome. I love Emacs but the default keyboard layout is a hand killer.",
				"added": 1557269125
			},
			{
				"comment_id": 428,
				"body": "> [geekosan](#comment_28_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): I wouldn't know. I use Vim. Maybe it's a privilege and that's another case of oppression?\n\nVi is a good text editor. Emacs is a better O.S. Its worth taking a look at Emacs it can emulate vi better than vi can. Just remember Emacs goes back to 1976. It is silly pudy of code. Emacs can do just about everything. I use Vi all the time for basic editing. Emacs Org mode is what makes it a winner.",
				"added": 1557292903
			},
			{
				"comment_id": 446,
				"body": "> [geekosan](#comment_29_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): Not sure if I'm courageous enough to take on the challenge to learn Emacs. :D\n\nIt is worth learning it. Lisp code goes back to 1956. Just remember it was the first editor. And they did not know what to call anything. So it is a bit odd. I don't know any program where you can change the source code while using it and not compile it like you can with Emacs. Good thing and a bad thing. It a code rabbit hole that is mind blowing. It can also break all code structures. I cant explain how it works it gets way to deep.",
				"added": 1557331838
			}
		],
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 420,
				"body": "sinewave: \nNice Post!  Unfortunately corporations use these same tactics to gain a market advantage.",
				"added": 1557272220
			}
		],
		"1556966006_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 421,
				"body": "You might want to try this program. http://converseen.fasterland.net/ Its FREE!! \nIts free a bit strange to use but LOTS of options! \nYou will be creating thumbnails like a pro in no time.\nA how to use video guide.\nhttps://www.youtube.com/watch?time_continue=7&v=F5wz0aQTUFQ",
				"added": 1557272445
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 424,
				"body": "Nice site! The background color needs some work. Over all design is good.",
				"added": 1557281054
			},
			{
				"comment_id": 462,
				"body": "My problem with mining is that it steals to much cpu time on older equipment that is running Zeronet. Several times I have seen some Zeronet site that was just sucking up 100% cpu time on here. I have to block sites like that on my end. Also Zeronet mining on the phone app would be very bad on cell phone processors as well. Its just something to think about when you design your site. I like the idea of mining but hate the implementation of it on old systems.",
				"added": 1558753906
			},
			{
				"comment_id": 472,
				"body": "> [sharer](#comment_60_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): That's the reason why the \"Mining Machine\" only loads when asked to.\n\nThats cool. I have already removed 30+ mining sites that have sucked over 99% of my cpu usage and put on my ban list. I have a 4 core system here and I just wont put up with a cpu sucker being shared from my system to others. An option to use it is fine. I need a 64 core system with minimum of 128 gig of ram for the stuff I am trying to do now.",
				"added": 1558903697
			}
		],
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 425,
				"body": "Mozilla will now shut down Tor. Watch.. The Nazi Left Rule Tek. Everyone will be banned because all words are hate speech.",
				"added": 1557281947
			},
			{
				"comment_id": 427,
				"body": "> [duck0](#comment_53_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): That'd be pretty epic. Funnel more people to ZeroNet.\n\nZeronet will explode with new users. I can already see allot more activity on Zeronet. This is the only viable alternative that is out there. And Zeronet is Fast..",
				"added": 1557286132
			}
		],
		"1557105138_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 426,
				"body": "Zeronet just rocks. I am blown away about how fast it is. Sure there are some negative technical issues that need to be fixed but over all Zeronet is the best competition to the regular web. It reminds me of the early web. It will catch on.",
				"added": 1557284434
			}
		],
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 430,
				"body": "Pathetic that you are deleting your best sites. Oh well. Your loss of credibility as a site developer.",
				"added": 1557308721
			},
			{
				"comment_id": 432,
				"body": "> [kxobot@kxoid.bit](#comment_37_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): Interesting... Considering so far, throughout all of this I've been called a \"Drama Queen\", \"pure garbage\", \"pathetic\", \"idiotic\", \"agressive\". I'm wondering... what have I called other people?\n\nThis falls in the I don't care category. Humans are not code. Maybe you need to learn to tell the difference.",
				"added": 1557309607
			},
			{
				"comment_id": 433,
				"body": "> [kxobot@kxoid.bit](#comment_37_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): \nThe best site you made was the very important site. Oh well I am sure some one has a copy of it somewhere and will re work it.  Happy coding.. :)",
				"added": 1557309914
			},
			{
				"comment_id": 434,
				"body": "> [kxobot@kxoid.bit](#comment_38_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): \nMaybe it is related to your actions on deleting your best sites you ever made on Zeronet. Think of it as a back handed complement.",
				"added": 1557310218
			},
			{
				"comment_id": 435,
				"body": "> [kxobot@kxoid.bit](#comment_39_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): Well... I actually made sure someone backed up all the data, so you know..... assumptions I suppose are being made.\n\nGood maybe you will make an even better site than that. But since you are leaving Zeronet for what ever reason you feel you need to there is not much to say. Good coders usually have nasty attitudes after a bad day of why the hell is this not working moments. Kinda like me zapping out emacs on a bad keystroke.",
				"added": 1557310539
			},
			{
				"comment_id": 436,
				"body": "> [kxobot@kxoid.bit](#comment_40_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): . [...]\n\nWell good you are not leaving.",
				"added": 1557310814
			},
			{
				"comment_id": 437,
				"body": "I make daily backups of zeronet going back 30+ days.",
				"added": 1557311082
			},
			{
				"comment_id": 438,
				"body": "> [leftside](#comment_748_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Do u mean that u have the most recent 30 versions of zeronet in ur backup??\n\nJust a full backup of Zeronet and all data. I do it encase I do something really stupid I will have a full working backup that I can go back to. The day you don't back up is usually the day you will regret it. Been there done that to many times.",
				"added": 1557313097
			},
			{
				"comment_id": 439,
				"body": "> [leftside](#comment_749_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): So u have each of last +30 days of copy of Zeronet-data?\n\nBasically. 2 TB platter drives are cheap. I believe in data redundancy.  And I never use a virtual file system. They are very dangerous to use. I think it is a good idea to backup all of zeronet if you have the space to do it.",
				"added": 1557313833
			},
			{
				"comment_id": 440,
				"body": "> [leftside](#comment_750_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): So are u going to upload the zipped data folders of this guy's?\n\nMaybe, not sure. I defiantly don't want to run a zite like that. I am way more experienced in the hardware back end of computers at the component level. Running a large site like that would be just to much work. Might be why he wanted to stop running it.",
				"added": 1557314651
			},
			{
				"comment_id": 441,
				"body": "> [leftside](#comment_752_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I have a backup of yesterday-version but just with some popular sites of his not all.\n\nI zipped up the directory. I think that is all you need?",
				"added": 1557315960
			},
			{
				"comment_id": 442,
				"body": "> [leftside](#comment_441_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): \nI do not think that I have a copy of everything he has done either.",
				"added": 1557316173
			},
			{
				"comment_id": 443,
				"body": "> [leftside](#comment_754_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): @quantumworld, watch out not to include ur private key file!\n\nMy private key should not be saved in that directory..",
				"added": 1557316840
			},
			{
				"comment_id": 445,
				"body": "> [leftside](#comment_755_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Thanks, man. You're a Jedi of Zeronet :)\n\nI will post it up in the next 24 hours. Maybe we can get some one to run a clone site.",
				"added": 1557317120
			}
		],
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 448,
				"body": "All speech is hate speech will be the next Communist move. Then the book burning and data deletion will start happening globally done by back doors in computers globally. Eventually only the richest of the rich will have access to any kind of technology. The rest of us will be forced into total silence and submission.  We are all DNA farm animals for the alien overlords who will harvest our body parts so they can live longer.",
				"added": 1557506121
			},
			{
				"comment_id": 449,
				"body": "Btw. I always thought that the deepdotweb was run by the FBI or some Intell agency. This may be some cover because they were going to be exposed.",
				"added": 1557508244
			},
			{
				"comment_id": 450,
				"body": "I find it interesting that no names have been released as to who was arrested. Most likely this is some fbi P.R. stunt to make it look like they shut down the dark web and in reality it was just a News site run by the gov. The over all general public would be fooled into thinking that the FBI is really doing something. In reality the FBI is a criminal organization.",
				"added": 1557510368
			},
			{
				"comment_id": 451,
				"body": "> [anonymouslogin](#comment_294_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Just like the CIA....which is who you get to deal with when you are NOT in the US.....\n\nYou have to deal with them in the US as well. They are all scum of the earth in my view. The CIA is the worst of the worst.",
				"added": 1557611855
			}
		],
		"3499_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": [
			{
				"comment_id": 452,
				"body": "Good Idea!",
				"added": 1557618024
			}
		],
		"1557680958_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 453,
				"body": "That is a very interesting thought.",
				"added": 1557681477
			},
			{
				"comment_id": 455,
				"body": "> [styromaniac@kxoid.bit](#comment_21_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): And his connection to Jeffrey Epstein. [...]\n\nI agree, and there have been no arrests on any of this stuff either. Just shows you we are all in a different class than those with lots of money.",
				"added": 1557681949
			},
			{
				"comment_id": 456,
				"body": "> [shitnotworking](#comment_27_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW):  Excellent Rant! Thank you..",
				"added": 1557688606
			}
		],
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": [
			{
				"comment_id": 454,
				"body": "I have had some long down time recently. This problem will be fixed soon.",
				"added": 1557681693
			}
		],
		"1557618716_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 457,
				"body": "> [kropptyler](#comment_1_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): Credit where credit's due... Steven Crowder\n\nWho? \nhttps://www.louderwithcrowder.com/",
				"added": 1557696755
			}
		],
		"1557692538_18yjuvi7DyL85Rip57MiXEcGhkgCv2rHT2": [
			{
				"comment_id": 458,
				"body": "> [filips](#comment_22_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Thank you! That dots are really hard to see...\n\nI finally see those 3 dots to the right of each user post. Thanks to a different monitor setting that does not removing the blue. Those dots need to be black dots and not off white on white. (Graphics Color BUG!) It would be an easy fix to make them black.",
				"added": 1557778485
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 459,
				"body": "Programming in Lisp. lol",
				"added": 1558752576
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 460,
				"body": "> [a7oiz](#comment_7_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz): ZeroNet is a purer decentralized project.To put it simply, many people in the zeronet community hate decentralized projects that offering encrypted digital currencies.The use of legal tender transactions in a network environment that is not legally recognized (ZeroNet) is itself a security risk.So at this stage ZeroNet can only stay away from business.In fact, you can post product information in ZeroTalk, ZeroMe or any other ZeroSite. But how to pay and how to logistics, you need to solve it yourself.\n\nPosting a link to a Tor site to do the crypto transaction may work out well. \nI am sure some one will code something that will work on a p2p platform. I am clueless how it could be done that would make it secure.",
				"added": 1558753135
			},
			{
				"comment_id": 467,
				"body": "There is a market place site on Zeronet somewhere. I have seen it. Dig around Zeronet is quite large. I find new things every day here.",
				"added": 1558781897
			},
			{
				"comment_id": 474,
				"body": "> [sceptique](#comment_3_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv): You are not nice\n\nToss him on your block list to avoid death threat spam from him.  He is such a looser. Drinking and Internet = Trolling. In my world it = a block.",
				"added": 1558965872
			},
			{
				"comment_id": 475,
				"body": "Lets start a Zerotalk group design for testing new software concepts and coding for some really talented coders and developers to test. I have an idea that may work. \nI know this could be done if we have to create a token ring type coding system that would flow data bits between peer to peer systems. Think of it as a virtual code inside Zeronet that would do a peer to peer transaction system. I bet some one is already coding this idea somewhere. What do I know, I am just a program concept Engineer. \nWe can start a new topic thread brainstorming new ideas. I am sure there will be more than one viable program idea that can be used.",
				"added": 1559196027
			}
		],
		"1558615657_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 461,
				"body": "I tested this out on a 64 gig thumdrive. Zeronet ate it in about 3 months. The amount of data reading and writing tends to destroy them. Feel free to test it. I recommend  backing up Zeronet totally on a platter drive. \nAlways expect it to fail. Your usage may very.  However for a short term usage it would probably be fine. Those transistor layers die over usage time unfortunately.",
				"added": 1558753453
			},
			{
				"comment_id": 463,
				"body": "> [shitchell](#comment_84_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Shit... o_o that seems like kind of a bad thing, no? How many users are going to think to put their zeronet data folder on a drive other than their hard drive? Good to know, though, I guess...\n\nI paid $11.99 usd for a 64 gig drive on clearance. I did not expect it to do very well. This technology will get better over time. If you get a very expensive thumdrive that has lots of transistor layers on the chip. I am sure you will get a longer duration of use over time. SSD Drives unfortunately do not fully replace the platter drives for long term use and storage. If anyone has had any better results please let me know. Just remember that your portion of Zeronet may be the only one out there. So data loss effects Zeronet p2p stored data on the network as a whole collective.",
				"added": 1558754831
			},
			{
				"comment_id": 464,
				"body": "> [styromaniac@kxoid.bit](#comment_48_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I recommend SDXC cards by Pro Grade, in case anyone needed to know. They're the fastest and tested for reliability, the best binned cards. I don't think there's anything faster. That's going based on my internet research.\n\nGet one and test it. Real world hardware testing is the only way to go.",
				"added": 1558760902
			},
			{
				"comment_id": 465,
				"body": "> [shitchell](#comment_85_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Would you recommend keeping your data files on a flash drive or other media besides your computer's hard drive?\n\nAlways have a separate drive to back up your data. It will save you from those oops moments. Or an out right crash. Anything can take out a computer and no data is ever safe. Unless it is in printed form. I still use a typewriter for critical data storage. Old school is the best school.",
				"added": 1558761137
			},
			{
				"comment_id": 466,
				"body": "> [shitchell](#comment_86_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): I have a 1 TB external HD for my backups :p I was just wondering, since you said ZeroNet does a ton of read/writes and is killer on flash drives, if it'd be better to store my data off of my HD for its safety :p\n\nI think you can do it either way as long as your usb does not crash on you. I would run a working zeronet on your local drive and a backup on the usb. You can switch it up and see if there is any performance issues. It would be faster on your local drive. I am assuming that your external drive is a platter drive. If it is an ssd usb then I would only use it for a backup. SSD drives are still new and real world long term storage has not been fully tested. It has only been simulated/tested on read writes to the drives. Usb platter drives are dirt cheap now days. As long as you dont drop them or shake them when they are on they are a good option.",
				"added": 1558763716
			},
			{
				"comment_id": 468,
				"body": "I am also using a 1TB Samsung ssd. They are supposedly the best. However I have seen lots of drive failure videos with testing them to maximum usage levels. We are all new to this technology. I hope they last, however I am very skeptical that they will last more than 10 years. Platter drives are good if you don't drop them or bang them around when they are on. I think that optical drives will have a return. Everything in computer science is recycled designs that are built on years later because we pushed the designs to there maximum cost usage limit. Some day punch cards will return in a new format. Until then back up everything.",
				"added": 1558815300
			}
		],
		"1558859891_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 469,
				"body": "You can probably get it to run on the micro sd card. However dropped on there and running it? Not sure if you can with that apk file. It should work but it is clunky. It's just not as stream line like the desktop experience is. I am no expert at the zeronet phone side. I have only used that app once or twice. It worked ok.",
				"added": 1558860995
			},
			{
				"comment_id": 470,
				"body": "> [daz](#comment_24_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Thanks so the android zeronet not flowing very well yet. and maybe best to see if a xposed module can be developed that will make it flow. Would still like to give it a go if i can figure out what's stopping my install.\n\nKeep playing with it and submit bug reports. I rarely use a smart phone anymore. Way to many problems with privacy.",
				"added": 1558861992
			},
			{
				"comment_id": 471,
				"body": "> [daz](#comment_25_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): I feel your pain sadly they are good for work and of course a nice big screen is a must when flying the DJI I do what I can in my limited way to stop big companies from having all my info and do try to talk about bombs, terrorists and undercover operation as mush as possible but as mostly the governments and masons  are the ones behind or helping so called terrorists they already know who the real ones are. One only has to look at the IRA and  you find it does pay to bomb and kill people you get invited to the USA to meet the president . some days I wonder how things would have been if my ancestors had been mass murderers and child rapists who knows I could be a king. but I guess they was good white slaves making money for the bankers and the odd lord or knight.\n\nI just had a week of death threats because I ran across the Hidden Linux os inside every computer. I found it quite hilarious. There games don't not intimidate me at all. In fact it just proved the accuracy of the story more. We don't have any privacy. Its to bad because there will be a Zero day event and everything will go out. Just do to some agencies stupidity to force companies to put back doors in hardware.",
				"added": 1558867539
			},
			{
				"comment_id": 473,
				"body": "> [daz](#comment_30_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): The only Jewish scum of the earth is the Rothschild's. All the rest of this anti jew stuff is traced back to the SPLC who are paying people to create global racism for the Rothchilds so they can keep there power. I know there plan, and allot more. I have been a target for well over 40 years. I am far more brutal than they are with forcing power down peoples throats. I never miss a target. And those that have seen my work go insane.",
				"added": 1558906329
			}
		],
		"1559163351_1CZMjjnu2qd6BuoeLC35vc4o7A9LRtQZrJ": [
			{
				"comment_id": 476,
				"body": "> [moor](#comment_126_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): if that blog is yours you should mirror it here :D\n\nI agree.",
				"added": 1559199846
			}
		],
		"1558916843_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 477,
				"body": "The U.S. Is a Republic B.T.W.  Just a reminder.\n",
				"added": 1559199930
			},
			{
				"comment_id": 478,
				"body": "> [solved](#comment_27_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu): the US is an aristocracy, open your eyes\n\nWhat it has turned into is an aristocracy by the intelligence agencies. It is still a Republic. You wont get much of a debate here about that I partially agree with you.",
				"added": 1559205304
			}
		]
	},
	"comment_vote": {
		"4_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"37_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"369_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"6_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"194_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"445_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1_1CWn5Ji9CFHF5JzmFEycDFdDhNYqEwGUmD": 1,
		"11_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"516_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"5_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF": 1,
		"42_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"515_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"77_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"191_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"17_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"190_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"20_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"747_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"211_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"8_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"43_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"30_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1_1CmKnRkBqGcBLEJomTcERHEMtR77TTv3ag": 1,
		"47_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1_1KhfFbF3hj3LEUpXssTHMuUiivhQFobj1q": 1,
		"2_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK": 1,
		"486_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"26_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r": 1,
		"54_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"56_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"782_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"269_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_1DkFDJGJGQRA3mXaHkEZhkynzpZrkQEonM": 1,
		"796_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"13_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"335_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"86_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1_15EQoYieX2KjEEfky9n5SQtoEa31fEjF4U": 1,
		"2_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"20_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}