{
	"posts": [
		{
			"id": "fbafca37-ccb2-47d8-8338-d8efad1cfad6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>6b64e43c-9239-40c7-a322-3361bc977c5f\nGet a good vpn like Express, PIA, Nord, and use it with Tor if you're paranoid and you won't get busted if you stumble on or seed CP",
			"time": 1566778014467,
			"files": "[]"
		},
		{
			"id": "1f49e1d8-5faa-4a25-b5d6-879304551b72",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>5f6e9cf8-1c5b-4be3-96b9-5c50fdd31589\nPeople usually get busted for CP when they get caught by another person usually a family member, stranger, or friend. Stumbling on it your first is not going to attract the attention of your ISP what will is if you keep going at it without a VPN and/or Tor.\n\nCases involving Tor are rare, and even moreso with VPNs. \n\nWith Tor there is a small chance to get busted if you visit hidden services without disabling javascript due to scripts that can deanonymize your exit node. Using Tor in a workplace is also an easy way to get in trouble since the computers themselves are monitored. Zeronet has no scripts since its decentralized.\n\nFor vpns, Pure VPN was one of the few rare cases where someone with a vpn got busted but their rep was already bad to begin with and tanked with that.",
			"time": 1566778663932,
			"files": "[]"
		},
		{
			"id": "723615d6-f333-4e34-b6ca-5f2b8fc341e3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "dd9949af-25a9-45d2-934f-59ce4de4af91",
			"body": "The need for Zero ID killed it for normies who can't be bothered with creating one to post on here. Also most surface 8channers did not use a VPN or Tor Browser cause they didn't care if their ISP knew everything they did.",
			"time": 1566779573427,
			"files": "[]",
			"last_edited": 1566779600927,
			"subject": null,
			"capcode": null
		},
		{
			"id": "fca818e6-c5b3-4244-89b8-f192d0e336f9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>fbafca37-ccb2-47d8-8338-d8efad1cfad6\nAssuming they managed to get Acid's private keys think the chance of that happening is very remote unlikely to happen.\n\nDoubt this website is priority for the feds.",
			"time": 1566780704327,
			"files": "[]",
			"last_edited": 1566780755527,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}