{
	"title": "Let's Talk About Hentai",
	"description": "A blog about porn.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1519334818,
	"post": [
		{
			"post_id": 6,
			"title": "The Mainstream Success of HuniePop",
			"date_published": 1498171787.4,
			"body": "![vlcsnap-2017-06-22-15h50m38s268.jpg (1200x899)](data/img/post_6_vlcsnap-2017-06-22-15h50m38s268.jpg)\n\nFew things surprised me more than the relative mainstream success of the pornographic game, _HuniePop_. Porn and video games have gone together since at least the age of the Atari VCS, but where porn games like _Custer’s Revenge_ were hallmarks of just how mainstream Atari and video games were becoming in the broader culture, _HuniePop_ is more indicative of how the stigma against porn has slowly eroded. More specifically, it’s speaks to how hentai has become one of the mainstays of everyday porn.\n\n* * *\n\nThe goal of _HuniePop_ is to sleep with all of the girls in the game. To accomplish this, the player must go through some pretty straightforward dating sim mechanics. You have to learn things about each potential partner by talking with them. You can give gifts to them, as well as take them on dates. The dating part of the game consists of a Bejeweled style puzzle, where points are earned by matching three or more of the same token piece in a row. After a successful date, the Heart meter fills up, and after the fourth date, it is possible to have sex.\n\n![vlcsnap-2017-06-22-16h12m42s507.jpg (1198x900)](data/img/post_6_vlcsnap-2017-06-22-16h12m42s507.jpg)\n\nFor such a straightforward goal, there’s actually quite a bit to unpack. What’s most impressive about this game is that each component of it is interconnected, meaning that all of the features in the game are pretty much required in order to play through it successfully. Some mechanics which might seem superfluous actually become quite integral to success, especially if you hit a brick wall in the difficulty curve. The major mechanics are talking with the girls, giving gifts, and going on dates. Talking with girls earns you Hunie Points, which can be used to level up your stats, absolutely crucial as each date you go on becomes increasingly difficult. Giving gifts to girls unlocks other gifts which you can give to girls on dates which can make the date easier on you by altering the properties of the game (such as clearing all tokens of a certain type from the board, or giving the player more moves). Going on dates, of course, requires the player to earn a certain number of points within a certain number of moves in a token matching game.\n\n![vlcsnap-2017-06-22-16h00m06s531.jpg (1200x900)](data/img/post_6_vlcsnap-2017-06-22-16h00m06s531.jpg)\n\nThe three main mechanics have a straightforward relationship with one another, which isn’t so spectacular in itself. It’s really the more tertiary stuff that I find interesting. For instance, completing a date successfully not only earns you a higher rating with the girl you went on the date with (and thus getting you one step closer to bone zoning), but you also earn money with which to buy items that help you in the rest of the game. Gifts, of course, cost money, but so does food. Food allows you to spend more time talking with a girl, as each time you do talk with them, their hunger meter depletes.\n\nAlong the same lines, although significantly less wholesome, is that meeting a girl at night allows you to buy drinks for her. Giving her drinks has two effects: the first is that it gives you significantly more Hunie Points when you talk with them. Second, it provides you with Sentiment, which is what allows you to use the gifts you have specifically for dates. While I do like that you can make the game a bit easier by doing this, I can’t say I like it thematically. It’s certainly appropriate, but a little gross. I guess that’s a strange complaint to make in a game where the goal is to have sex with animated ladies, but it still feels like it crosses a line that wasn’t completely necessary.\n\nNow, all of the integrated mechanics are great, but all of those mechanics would go to waste if the core of the experience wasn’t compelling. Fortunately, the puzzle game component is extremely satisfying. It has a basic in practically every matching game ever made (though it is probably most similar to Bejeweled), but it adds some really interesting elements that make it far more complex and interesting. My favorite part is how the tokens that you match correspond to the girls themselves. Each one has an inherent trait meaning: Sexuality, Flirtation, Romance, and Talent. Different girls prefer different traits in a hierarchy of effectiveness. This gives players the incentive to try to match certain token types rather than others, which can add a lot of variety to the strategies employed on each date.\n\n![vlcsnap-2017-06-22-15h58m30s428.jpg (1198x900)](data/img/post_6_vlcsnap-2017-06-22-15h58m30s428.jpg)\n\nI also found the gifts that you can give your dates offer a lot of versatility to the game. You can only hold six at a time, so managing which gifts you want to take with you gives the game a bit of an RPG feel to it. Generally, I would use gifts that would either help increase the number of turns I could take, or reduce the number of Broken Heart tokens on the board, since matching those tokens drastically reduces your score. Those can get you through the majority of the game, but you can choose to use more specific gifts which tailor to the traits that your particular date prefers.\n\nWhen it comes to incentives, _HuniePop_ is quite direct, and falls in line with so many other hentai games. If you complete a date successfully, your date will send you a sexy pic of themselves the next day. They start out mild, of course, and increase in titillation with each subsequent date. Of course, once you get to the sex, the game returns to the puzzle game, but with a twist. Gone are the move limits, the Broken Heart Tokens, and the gifts. Instead, all you have to do is keep matching up tokens until your meter maxes out. It will decrease over time, but you can’t lose, so while it might feel a bit stressful up front to keep the combo chains going, it’s much better to just relax and enjoy yourself...which is surprisingly apt. After you complete that, you get the most explicit picture of that character available, and they are pretty great.\n\n![2017-06-22_16_09_34-HuniePop.jpg (1200x900)](data/img/post_6_2017-06-22_16_09_34-HuniePop.jpg)\n\nPorn games have quite the uphill battle to climb when it comes to finding an audience. Adult entertainment is pretty ubiquitous, of course, but the audience for any particular product is probably going to be quite small. As of this writing, the Steam sales numbers for HuniePop were around a half million sales. That’s pretty incredible. That success has a few factors responsible. The first is simply that it is a slick production. The art, voice acting, and overall presentation are far above what can often be expected out of either dating simulators or puzzle games. It has a healthy level of juice to it that makes a game very appealing. The second factor is the incredible word of mouth, partially at the hands of it being played by a lot of popular YouTubers. That’s how I found out about it, after all. For people who make their living off of playing video games to use _HuniePop_ in that endeavor is quite an endorsement, even if it was mostly for the surprise, shock, or novelty factor. The third factor, is simply that it’s a really good game. The puzzle element is fun, challenging, and satisfying. The characters are fun and interesting. It’s a game that manages to become more than the sum of its parts. And you get to look at boobies, too.\n\n![2017-06-22_16_11_05-HuniePop.jpg (1200x900)](data/img/post_6_2017-06-22_16_11_05-HuniePop.jpg)"
		},
		{
			"post_id": 5,
			"title": "Judging By the Cover",
			"date_published": 1496799537.166,
			"body": "![doit-01.jpg (568x800)](data/img/post_5_doit-01.jpg)\n\nSince they entered the publishing game, I have been a huge fan of FAKKU books. Being such a large repository of digital and digitized manga, their transition from user sourced uploads to more traditional publishing house has been interesting to watch. At the forefront of their shift in business model were, of course, the books that they were publishing. What was a surprise was that they opted not only for digital books, but printed versions as well. My curiosity was piqued upon learning this, so naturally I decided to peruse their selection. There weren’t a ton of books for sale early on, but what was available did look incredibly interesting. Suddenly, I was faced with a dilemma, which brings me to the topic of this essay. Which book was I going to buy? How on earth was I going to make my decision with so many appealing choices?\n\n* * *\n\nThe classic adage to never judge a book by a cover certainly hasn’t stopped book, movie, or game publishers from putting a lot of stock in their cover designs. That’s why so many books carry the idiot tag “A novel” on them. It’s also why movie posters feature people walking away from exploding fireballs and video game boxes depict some dude with a gun. People start to form expectations from the very first thing they see regarding what they are about to consume. This is certainly true in the case of visual media, like manga. As such, manga tend to have some pretty striking covers. Hentai manga, then, has to feature some pretty spectacular stuff.\n\nWith regard to FAKKU’s books, especially, the covers have been a strong selling point. There is basically no book they sell that I looked at the cover for and thought, “Nope, I don’t want to look at that”. The opposite has been true, and I’ve had to resort to locking my credit card away for long periods of time in order to resist purchasing everything and losing myself in a forest’s worth of printed pornography. While many of the covers simply feature one of the book’s characters in an inhumanly sexy pose, some of them give you a pretty good idea of what the whole thing is going to be about. This is important since the titles often aren’t the most descriptive. As a non-Japanese speaker, for instance, _Renai Sample,_ doesn’t exactly give me much of an impression. It’s cover, however, provides a hint, subtle though it may be.\n\n![_Homunculus__Renai_Sample_-_001__x3200___FAKKU__.jpg (629x900)](data/img/post_5__Homunculus__Renai_Sample_-_001__x3200___FAKKU__.jpg)\n_It's something about tits, isn't it?_\n\nOthers are even more obvious. _Kogals, Slut, and Whatever_ is one of the more active covers. There are four girls present, all of whom are characters in the stories therein. It also provides the setting of a classroom, making it clear that at least some of the work will feature schoolgirls.\n\n![001.jpg (633x900)](data/img/post_5_001.jpg)\n\nAn interesting feature of the _Kogals_ cover is that the characters almost don’t seem to be drawn for the cover specifically. The characters are interacting with objects in the classroom to varying degrees, but their gazes are all focused at the reader, seemingly unaware of the other girls in the scene. It’s an interesting touch, and I’m not sure if it’s intentional or not. If it is, it’s a wonderful attention to detail, and provides a subtle hint that these characters don’t all exist in the same story.\n\nIf you contrast that cover with the one for _The Job of a Service Committee Member_, you get a very different tone.\n\n![FAK10.jpg (718x1015)](data/img/post_5_FAK10.jpg)\n\nKiyoshiro Inoue’s cover work appears as if it were a scene directly lifted from one of the stories. Many of these books are simple collections of unrelated stories that are tied together around very tenuous themes. _Let Loose With Lewd Boobs_, is predictably focused on depictions of breasts, as the cover so wonderfully articulates:\n\n![mojarin-01.jpg (640x960)](data/img/post_5_mojarin-01.jpg)\n\nThe stories, themselves, don’t really have anything to do with boobs in particular, they just feature prominently in much of the art. _The Job of a Service Committee Member_, on the other hand, has much more of a narrative thread, making it considerably more cohesive, if not exactly novelesque. In fact, a lot of the books on offer are titled after the longest single stories in the book. This is the case for titles such as _Excursion Day 99_ and _Summer Love Geek Girl_. On some level, familiarity with the material is going to be expected. If you are at all familiar with how comic books and manga (hell, even poetry and short stories) have been sold throughout their histories, the anthology format will be nothing new.\n\nWhile there are certainly various nuances that can be pulled out of the various covers that can be perused, the main thing that is going to attract us is the art style. Since these books all feature a single author, it’s nice that there is no worry about the covers misleading readers or misrepresenting the artist. What you see is essentially what you get, only maybe a bit more detailed and in full color. Even the full color isn’t particularly misleading as these books feature a great number of high quality pages that really showcase the artists’ talents. With that in mind, picking a book can be a simple as picking your favorite cover.\n\n![meltymaiden-01.jpg (651x900)](data/img/post_5_meltymaiden-01.jpg)\n_My personal favorite as of this writing._\n\nAs the FAKKU library grows, picking a favorite is almost certainly going to become a more challenging task, but art has always been about suiting one’s taste. The artists create that which appeals to them and which they think might appeal to others. For those of us who just consume, all we really have to do is take a look and decide for ourselves."
		},
		{
			"post_id": 4,
			"title": "Failing to Understand La Blue Girl",
			"date_published": 1495835746.621,
			"body": "![La_Blue_Girl_-_Chapter_1Volume_1_000.jpg (1019x1471)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_000.jpg)\n\nThe trend for me, with regard to hentai manga, has been that the fetishes they appeal to do not generally appeal to me directly. I find myself much more interested in the art styles and compositions than the subject matter. This was true with my introduction to the medium in _Super Taboo_, which features incest as the central story component. It is even more true with the first hentai anime series I ever encountered, _La Blue Girl._\n\n* * *\n\nI won’t be talking about the anime version just yet, but instead will take a look at its manga source material, as that is relatively new to me. What first stood out to me is just how dark _La Blue Girl_ is. I don’t mean that in the sense of the manga’s tone. A story about supernatural beings that rape women is plenty dark, despite the numerous attempts at lightheartedness peppered throughout. No, I’m talking about how darkly its drawn. There is some extreme shading going on. Toshio Maeda, the series creator, uses shading as the primary method of adding detail and definition.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_039.jpg (611x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_039.jpg)\n\nIf you look at this beast here, the muscular definition is create almost entirely by various amounts of shading. You get a good sense of depth created by the alternating sections of deep black and hashed lines, making the image pop out at the reader a bit. This particular image reminds me more of American superhero style drawing than manga. Maeda also masterfully uses shading to obfuscate or eliminate details altogether.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_059.jpg (993x1458)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_059.jpg)\n\nOn this page, the beast’s face lacks any detail outside of its eyes and teeth. There is a suggestion of shape based on how the teeth are drawn, but the inability to see the face clearly is a common and effective way to evoke fear. Being an erotic horror manga, _La Blue Girl_ features a great deal of this hidden horror, and fits well alongside the more detailed use of shading. The arms of the beast have the amount of definition similar to the beast from earlier, showing how both techniques can be used together to create some striking imagery.\n\nAside from aiding in the conveyance of details, panels depicting the setting are often portrayed mostly in blacks.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_041.jpg (611x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_041.jpg)\n\nOn this page, the panel depicting the shrine is mostly cast in shadow. The stairs are hard to make out individually, while the sky is completely devoid of color, giving the sense that the scene takes place in the late afternoon. Night scenes are taken to the absolute extreme.\n\n![La_Blue_Girl_-_Chapter_2Volume_2_050.jpg (576x854)](data/img/post_4_La_Blue_Girl_-_Chapter_2Volume_2_050.jpg)\n\nThe left panel from this page is mostly black, outside of a few areas that would produce or reflect what little light there is in the scene. I really love this technique. My first introduction to using black backgrounds came from _Batman: The Animated Series_, which would often use them to achieve the desired look that became so iconic to that show. Maeda uses them to a similar effect. While they aren’t exclusive to settings, the establishing shots are where the technique is most impactful, since the details of the scene are less relevant than imparting how dark it is.\n\nOne of the more curious aspects of the page layout is how so many of them are cut diagonally. You can see in the previously shown page how the outdoor shot and the indoor bathroom panel are divided into triangular sections rather than being simple rectangles. This type of page division is all over the place. In some sequences, it is used to convey motion. In this early scene where Miko is swinging down to the street from her balcony, the angle that the panel is cut at illustrates the direction Miko is moving.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_019.jpg (613x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_019.jpg)\n\nThese panel designs are used primarily in action sequences or where there is a build up.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_128.jpg (586x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_128.jpg)\n\nOn this page, Miko attempts to enter the Shikima world by masturbating. At the top of the page, the three panels are angled to the right, indicating that she is becoming more and more aroused. A few pages later, once the warp to the Shikima world has begun, the panels are divided vertically to help make the _Alice’s Adventures in Wonderland_ style journey feel disorienting and strange.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_131.jpg (613x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_131.jpg)\n\nThe variations of purpose to the diagonal page layouts was one of the more difficult style choices for me to get used to. I found myself often times having trouble making sense of what was happening. In many areas, that was probably the intended response, whereas I’m not so sure it was in others. Thankfully, the learning curve wasn’t so long that it felt like a chore to read, and there were a few areas where it really enhanced the storytelling.\n\nAlright, so let’s go ahead and talk about tentacles. _La Blue Girl_ features a lot of them. The series is a pioneer in the erotic horror genre, so it’s no surprise that it features plenty of monsters raping women with phallic tentacles. It was interesting to learn that the use of tentacles was an effort, at least in part, to avoid censors. This is something that has always confused me about Japanese pornography in general. Mainstream Japanese porn is well known for pixelating genitalia, despite the entire purpose of pornography being to depict sexual acts.\n\n![file.png (400x259)](data/img/post_4_file.png)\n_There's a vagina there somewhere._\n\nWhat I find both interesting and bewildering is that placing such restrictions on the erotic industry seems to have pushed creators of pornographic materials into much more extreme ideas in order to get around depicting something as benign as two people having sex.\n\nI certainly don’t believe that what we fantasize about informs our real world intentions or actions, and the truth of the matter is that people have been combining sex and horror for storytelling purposes for a long time. Perhaps tentacle rape, then, shouldn’t be quite so shocking to me as it is. Maybe it’s the supernatural element having a deeper impact on me than I usually give it credit for. Maybe even though it is a fictional work, I’m just put off by the idea of women being forced into sexual servitude and/or torture.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_029.jpg (613x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_029.jpg)\n\nThe confusion regarding how one is “supposed” to react to work like this does not appear lost on Maeda. There are several instances where characters openly talk about how they are reacting versus how they think they should be acting. In a scene where Miko is being attacked, her companion, Nin-Nin, comments directly about how he is aroused by the scenario despite knowing inherently that it should be disgusting to him. Perhaps the most interesting scene from the first book is where Miko’s kidnapped professor, Shiratori, rationalizes what is happening to her.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_161.jpg (586x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_161.jpg)\n\nShe recognizes that she did nothing wrong in being the victim of the Shikima (an important point to make), but she can’t really justify to herself that she had an orgasm during the ordeal. The sense of the body betraying one’s will is really at the heart of the story here, and it’s the cause of a great deal of frustration and confusion for me as a reader.\n\n_La Blue Girl_ is a manga series obviously created for men. There is a reason the women are pretty much exclusively the victims in this story. I think being aware of that is important. Sure, Miko murders the demons that rape her, but there’s no doubt we are ultimately supposed to be aroused by the situations. Many of the situations that Miko finds herself are more mundane, so there is a sense that the series kind of lulls its readers into enjoying the more straightforward erotic aspects, then hammers them with the more outlandish scenarios. Ultimately, I can’t really come to any kind of conclusion on this series. The artwork impresses me constantly, and the individual scenes make my stomach turn at times. Maybe this state of confusion is exactly why stuff like this exists, to just push boundaries so that we have to face things we find completely uncomfortable, gross, and maybe just a little bit fascinating. Of course, you could just read it to enjoy Maeda's art.\n\n![La_Blue_Girl_-_Chapter_1Volume_1_005.jpg (613x900)](data/img/post_4_La_Blue_Girl_-_Chapter_1Volume_1_005.jpg)​​​​​​​"
		},
		{
			"post_id": 3,
			"title": "White Angel's Heavenly Bodies",
			"date_published": 1495347770.313,
			"body": "![white-angel-www.hentairules.net-001.jpg (655x900)](data/img/post_3_white-angel-www.hentairules.net-001.jpg)\n\nI can’t say that the nurse fetish ever appealed to me that much. The idea of someone being there to take care of you during recovery is nice, and the outfits can be appealing, but the necessity of taking place in hospital never sat right with me. Hospitals are about the least sexy places that could exist. They are cold, fixed with uncomfortable furniture and populated by people who are ill. I can’t really imagine a faster way to kill arousal than to think about being in a hospital.\n\n* * *\n\nThanks to artist O.RI, I have been able to suspend my aversion to the genre of nurse porn long enough to enjoy _White Angel_. The series chronicles the adventures of a group of nurses. Basically, each chapter follows a particular nurse as they satisfy their sexual needs via the various patients. It’s a humorous series, but what really draws me to this title is O.RI’s art. Like all of O.RI’s work, _White Angel_ features some stunning character designs. What’s most compelling is how soft the women look.\n\n![white-angel-www.hentairules.net-174.png (792x1132)](data/img/post_3_white-angel-www.hentairules.net-174.png)\n\nThis look is accomplished by using curved lines almost exclusively. Whereas some artists will stylize their character with very angular jaws, or simplify clothing detail by a few straight lines, O.RI makes a point to draw very curvy women. Breasts are very round, but also respond in a very natural way to gravity and movement.\n\n![2017-05-19_13_27_11-White_Angel_white-angel-www.hentairules.net-104.png.png (404x575)](data/img/post_3_2017-05-19_13_27_11-White_Angel_white-angel-www.hentairules.net-104.png.png)\n\n![2017-05-19_13_26_52-White_Angel_white-angel-www.hentairules.net-105.png.png (406x733)](data/img/post_3_2017-05-19_13_26_52-White_Angel_white-angel-www.hentairules.net-105.png.png)\n\nIn the above panels, you can see how the force of the hand reshapes the breast. Rather than simply compressing, the tissue is displaced in a way the mimics reality a much more convincing way than a lot of manga.\n\nThe overall figure design uses this approach:\n\n![2017-05-19_13_33_11-White_Angel_white-angel-www.hentairules.net-022.png.png (664x711)](data/img/post_3_2017-05-19_13_33_11-White_Angel_white-angel-www.hentairules.net-022.png.png)\n\nHere, Miho’s breasts are shown to be sagging to the side slightly in response to gravity. With two simple lines, O.RI also demonstrates her arching up and how that forces her midsection to fold a bit. This is one of my favorite panels of the book. It’s amazing how effective the technique here is, despite not having an overwhelming amount of detail. The most important features are present, with essentially no wasted effort.\n\nThe realism of the character’s bodies doesn’t extend to every detail, of course. In fact, there is an interesting lack of detail regarding the more explicit depictions of intercourse. In the above shot, the point at which the copulation commences lacks definitive lines. I think it’s supposed to be assumed that the dripping fluids are obscuring the view. In the panel below, the genitals are similarly lacking detail, presumably blocked by the suggestion of pubic hair on the male character’s behalf.\n\n![2017-05-19_13_43_57-White_Angel_white-angel-www.hentairules.net-080.png.png (447x675)](data/img/post_3_2017-05-19_13_43_57-White_Angel_white-angel-www.hentairules.net-080.png.png)\n\nThat isn’t to say there aren’t more explicit shots in the story. There certainly are, such as this one below:\n\n![2017-05-19_13_40_45-White_Angel_white-angel-www.hentairules.net-042.png.png (439x637)](data/img/post_3_2017-05-19_13_40_45-White_Angel_white-angel-www.hentairules.net-042.png.png)\n\nThis is about as much detail as we get. There are a number of shots like this, though there is a nice balance of the suggestive and explicit. It’s never so detailed that you’d mistake it for something mirroring reality, it’s more like an idealized version. Similar is the way the women are both soft looking, yet surrealistically firm as well. They look plump in the most perfect way. That carries over to some of the explicit panels as well.\n\n![2017-05-19_13_41_41-White_Angel_white-angel-www.hentairules.net-081.png.png (345x513)](data/img/post_3_2017-05-19_13_41_41-White_Angel_white-angel-www.hentairules.net-081.png.png)\n\nThis panel shows one of the more extreme examples. You can see how the vagina forms around the penis in a way that suggests she is being completely reshaped by it. It’s certainly pleasing from a visual standpoint, though it suggests something about women’s bodies that I certainly don’t subscribe to in life. There are far more drastic examples of this style of art, where the female form is taken to extremes of plumpness. _White Angel_’s nurses are kind of in a happy medium, the perfect meeting of give and resistance.\n\nOne of the things you may have noticed is how there is almost no significant detail to the background of these panels. Most of the time, backgrounds are completely eliminated in favor of blank backgrounds or shading effects. Usually, the details of the setting are included shots that set up the situation, but then quickly fade away as the focus shifts to the interactions between the characters. I like this style of presentation as it makes sense to forego including details that readers are very unlikely to pay attention to as they become more invested in the action.\n\nThis image below depicting the nurse coming into the patient’s room from behind a curtain is really all that is needed to establish the scene.\n\n![1.png (446x441)](data/img/post_3_1.png)\n\nOccasionally, the patient’s bed will be included, or a hallways as a nurse makes her way to where the patient is, but it’s amazing how few of these details are really necessary in order to establish the setting.\n\nIt’s unlikely that I’ll develop a true fetish for nurses any time soon, but _White Angel_ manages to transcend being centered on that aspect. As with nearly any adult manga, it’s full of character tropes and incredibly simple story lines, but what makes it really stand to me is its design. As with all of O.RI’s work, there is incredible talent portrayed in each panel, so even if you aren’t way into nurses, you should find something to enjoy about it. And hey, if you are into nurses, well what could be better than this?\n\n![white-angel-www.hentairules.net-006.png (792x1132)](data/img/post_3_white-angel-www.hentairules.net-006.png)"
		},
		{
			"post_id": 2,
			"title": "What is up with all the Wendy's porn?",
			"date_published": 1495140157,
			"body": "![e7e.jpg (680x661)](data/img/post_2_e7e.jpg)\n\nI spend quite a bit of time trolling the rule34 subreddit for kicks. As such, I have come across some unusual, but not surprising fanart. Rule 34 exists for a reason, of course, but I was still quite surprised at a recent trend I’ve noticed. There is a whole heck of a lot of Wendy’s porn. Manga, anime, and video game characters all make perfect sense to me with regard to erotic fanart. I can’t say I ever would have expected fast food restaurant mascots would join the fray. I guess that just goes to show how naive I really am sometimes. With the sudden influx of images depicting Wendy engaged in all sorts of lewd acts, I couldn’t help but wonder: why now?\n\n* * *\n\nThe internet being what it is, I suppose it was only a matter of time before the longtime female mascot became a porn icon, but the suddenness and sheer amount of NSFW content featuring Wendy must have sparked from something. The Wendy’s twitter account seems to have been the main spark of inspiration. Between feuding with Hardee’s, dragging out a bizarre romance with Game Grump Arin Hanson, and generally just taking full advantage of social media platform’s to promote itself, Wendy’s just seems to be glued into the trends of the internet in a way that few businesses manage to do. For more on that, check out the Know Your Meme article about [Smug Wendy’s](http://knowyourmeme.com/memes/smug-wendys). I can’t say whether or not this kind of social engagement has helped the fast food chain reach more sales, but it sure has produced a heck of a lot of porn.\n\nLet's take a look at some of it:\n\n![2EwFJfc.jpg (635x900)](data/img/post_2_2EwFJfc.jpg)\n\nThis image by Tofuubear is pretty straight forward, depicting Wendy sans clothes in a suggestive position. Standard fair for fanart, and nicely drawn.\n\n![9u3vsLn.jpg (594x900)](data/img/post_2_9u3vsLn.jpg)\n\nThis image by DarkerEve of what is being called \"Smug Wendy\". Though not pornographic, it provides some key context for the meme. One great thing about the modern internet is its self-referential nature. Combine that with porn and you have the makings of something interesting.\n\n![tumblr_opuex0rDfc1uu5ygeo1_1280.jpg (653x900)](data/img/post_2_tumblr_opuex0rDfc1uu5ygeo1_1280.jpg)\n\nThis one, by Bluebreed, is what makes me think the Game Grumps had something to do with the rising popularity of Wendy nudes. The reference to pre-ing, a noted set of jokes performed by the Grumps, seems too timely to be coincidental. Like the image above, this helps tie these images to a specific moment in time. It will certainly date this trend, but considering the transient nature of internet interests, looking dated isn’t something to really shy away from, in my opinion.\n\n![2183312_-_Ero_Waifu_Wendy_Wendy_s_mascots.jpg (578x900)](data/img/post_2_2183312_-_Ero_Waifu_Wendy_Wendy_s_mascots.jpg)\n\nWendy is drawn in as many style are there are images. Ero Waifu’s piece, called “Wendy’s burger” shows a slightly more innocent version of Wendy, drawn in an obviously manga style. It’s a nice take on the character.\n\n![tumblr_op3z1atHS21s7buwbo1_500.png (500x336)](data/img/post_2_tumblr_op3z1atHS21s7buwbo1_500.png)\n\n![tumblr_op3z1atHS21s7buwbo2_500.png (500x336)](data/img/post_2_tumblr_op3z1atHS21s7buwbo2_500.png)\n\nThis pair of images called “Smug girl”, by EroHua, is really one of my favorites. It’s a lot more explicit, for one, but the look of determination on her face really gives Wendy a lot of character. I always like it when characters in manga enjoy the sex they engage in. Wendy certainly seems to be enjoying herself, perhaps at the expense of whomever she is engaged with. Since we only get to see her expression, we can only guess.\n\n![OTU8zeq.jpg (900x900)](data/img/post_2_OTU8zeq.jpg)Finally, we have “Buns with mayo”, by nisetanaqa. This is easily the most graphic of the selections I’ve included. To be honest, it borders on being a bit gross simply due to the vascular nature of the penises, but I do think it is important to highlight the extent of what people are coming up with for fanart, and to highlight some work that is of high quality. Though some of the details are a little more than I care for, the level of detail is admirable. Again, Wendy’s expression indicates genuine enjoyment, something I always appreciate.\n\nWhile it certainly seems to have come out of left field, the Wendy’s porn meme is best explained as a congruence of factors all occurring at the same time. While not necessarily predictable, it does feel as if it was inevitable. Maybe the Wendy’s tweets were the catalyst, perhaps the rise of Rule 34 guaranteed that the character would have her moment in the porno spotlight eventually. In any event, I thought it was worth documenting. I can’t say Wendy would be my first choice of a character to receive a boost in popularity, but now that it’s here, I’m enjoying it."
		},
		{
			"post_id": 1,
			"title": "What's there to talk about?",
			"date_published": 1495068979,
			"body": "![01.jpg (652x918)](data/img/post_1_01.jpg)\n\nHow I first discovered hentai I can't quite remember. Those were still sort of the early days of home internet, long before sites like FAKKU made browsing through adult manga one of the easiest things one could possible do with their computer. Once I had learned what anime was, naturally, my interest in finding porn versions of this new phenomenon was next on my list. I remember browsing poorly laid out pages loaded with images of poorly scanned manga pages. I must have looked through hundreds of images, amazed that the stuff even existed.\n\nOut of all the comics I must have looked through, one series really stood out to me: Super Taboo, by Wolf Ogami. While incest storylines aren't my particular fancy, really, the quality of the art was unlike any comic of any kind that I had seen before. The way the various women's lips were shaded, the precise line work, the way much of the action was still out of frame, it was really incredible.\n\nIt's safe to say that Super Taboo is the reason I enjoy hentai, and as part of that enjoyment, I wanted to discuss it. Hopefully some of you want to discuss it, too."
		}
	]
}