{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1615572045,
			"title": "When do you think Fragging will resume against DoD brasses?",
			"body": "I guess soon... disarm, censor, protect pedos, wage useless unwinnable war (unless using nukes on such a scale, aka afghanistan that it won't be tolerated)... soon, I guess.\n\nIs there another way?\n\nremember it's way easier to mass frag at the Pentagon that fight the Chinese War Machine :), ask the korean and others south east asia vets :).",
			"added": 1615572044
		},
		{
			"topic_id": 1615580474,
			"title": "read bitches !",
			"body": "https://www.un.org/en/development/desa/population/migration/generalassembly/docs/globalcompact/A_RES_70_1_E.pdf\n\nhow can I share this shit here?",
			"added": 1615580472
		}
	],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 1,
				"body": "> [vmtpdsauqc6xryh2](#comment_3_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG): The pro-censorship crowd will just become more extreme...and they won't face much opposition.\n\nI can't agree more ! those people are dangerous ! ignore where they rule (digital goolags) is a necessary first step ! promote decentalized censorship resistant open source software like zeronet by inviting friends to join. Finally when you met IRL one of their zealots aka family member, friends etc, bash to hell and leave ! Don't let them tell you the election wasn't stolen or that xx can become male... just say no. fucking bs.",
				"added": 1615567849
			}
		],
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_260_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): You helped make my point here, killing your host as a pathogen is a spread limiter. Virulence has actually saved the entire world from any number of pandemics. Perhaps this will be the same and the vaccine...perhaps the vaccine is for something else entirely. Here is food for thought. Promiscuous DNA or RNA strands integrated into your cellular replication can cause literally anything to be true for your physiology. By flipping an epigenetic switch people could be made deathly allergic to any common rare chemical....spray the metropolitan areas with that chemical over a vaccinated population and guess what? Game over. Now do what they tell you to do or else.\n\nbinary weapon 101 ! bill gates now wants to have RNAm virus contaminated mosquitoes ! and no one says no to this fucker? what a shame, what money can buy...",
				"added": 1615567934
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 3,
				"body": "> [anonymouslogin](#comment_264_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): A real world network resiliency test, happening at the same time an invasion of extremist people are testing all of our wits and the censorship resiliency of the network.... one test down, one to go.  :-/\n\nthat's the spirit ! technologically superior solution ! to really even the cyberbattlespace !",
				"added": 1615567991
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 4,
				"body": "> [sword00000](#comment_42_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): The idea of kill lists for Social Marxists certainly has merit. They ended the possibility for civil discussion long ago. Though, I don't believe it will be effective at changing our current course. \n\nat least it's worth the try, read further you will understand better why ! \n\n> [sword00000](#comment_42_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): There are too many degenerate, fat, and brainwashed people sloshing around in the masses. Unfortunately, a \"Great Reset\" is needed, and a lot of these worthless/spineless people need to die. Self hating Whites. Self hating men. Children without fathers, being chemically castrated by their single mother. Society cheering as violent Blacks have \"Mostly Peaceful\" arson and destruction of private property, theft and looting during a \"pandemic\"? [...]\n\nI think your discourse is the most dangerous ever ! \n\nI believe that each life and even things was created by God himself. However like plants certain humans lack proper nutrition to really flourish ! As such, rather than see them for what they have become, and there I don't disagree with your assessment, it's more interesting to find the causes, and then wipe them, in the hope, like for a dehydrated plant, to recover them and then let them flourish to their maximum potential ! \n\nit's clear that the msn keep fostering the denutrional state by design. They will have to pay with their dares lives and assets ! \n\nI have kill lists long enough to not need to kill victims of a system designed to reduce them to this state to foster an un-natural competitive hedge for the feodalist rulers. For example I don't believe pedos, like the buddies of epstein deserve to live. I don't see that as a rupture of my first argument but as a complement, some have gone so badly, that their only hope, and for the others \"plants\" is to terminate them.\n\n\n> [sword00000](#comment_42_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): Don't throw away your life invain to try to save a crumbling civilization.\n\nI disagree, Rome was saved many time, until it couldn't be anymore ! and that's the part I find despicable in your argument. By doing nothing MAO wouldn't have launched the biggest transition in all human televised history ! There is always hope ! and isolation doesn't work when the barbarians invade... be ready to see your little walled garden of eden to burn like the trash parts.\n\n\n> [sword00000](#comment_42_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S):  Instead, be prepared. Exercise. Eat right. Study and learn something new everyday. Get your health and mind in 100% condition! Encourage everyone you love to do the same, and be an example to them. \n\nThose are great advices ! thanks for sharing them.\n\n\n> [sword00000](#comment_42_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): All empires collapse, and the sooner it does, the sooner we can rebuild. The stuff will eventually \"hit the fan\", and when it does, it's going to be the Armageddon of our nightmares. Those who are prepared will survive.\n\nThe problem is the invasions following collapses ! For me the best preparation is to leave, at least temporarly aka going John Galt :) ! \n\nWho i$ John Galt?\n\nthanks for your post !",
				"added": 1615568655
			},
			{
				"comment_id": 6,
				"body": "I am still unsure, if all their attacks against trump were to hide what the regime was really doing. Did you hear anything from cnn regarding the GMO feasts that trump unleashed? no. Anything else geopolitically? no. Anything about pedogate and only 2 arrests? no.  However now it seems their new strategy is everything but bidet !",
				"added": 1615568987
			},
			{
				"comment_id": 14,
				"body": "btw cnn doesn't give a shit about anything they say they do, always ulterior motives, agendas etc. Did they seek to know more about pedogate? no. end. aka enemy combatants.",
				"added": 1615571716
			},
			{
				"comment_id": 15,
				"body": "for me it's one of the propaganda wing of the enemy forces... both ways, all ways, they will perish, I would just prefer it to be done by real american armed forces. but don't worry it will done otherwise.",
				"added": 1615571792
			}
		],
		"1615515631_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc": [
			{
				"comment_id": 5,
				"body": "> [sword00000](#comment_38_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): Go to http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/ [...]\n\nWhy? it's a good question... did you hear any of them or were they all to happy to collaborate with the feodalist order by promoting george flyod to cover for pedogate? I believe so. Intentionally. And no need to look up all the rapes done by so called nfl and nba (of all skin colors)...",
				"added": 1615568850
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 7,
				"body": "I plead the 5A \n\n>Amendment V\n\n>No person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a grand jury, except in cases arising in the land or naval forces, or in the militia, when in actual service in time of war or public danger; nor shall any person be subject for the same offense to be twice put in jeopardy of life or limb; nor shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation.\n\nHowever I already forgot what was in it ! poor me... what are you talking about already? too much emf, 5g, mercury, sodium fluoride, and ionizing radiation, and I feel hungry... do you have something to eat gmo free? no sugar please :D.",
				"added": 1615569190
			},
			{
				"comment_id": 11,
				"body": "> [lordfirefox](#comment_13_1Ec11mGe5joBoboUH2s2idKHp1YVbzaepq): I lost all of mine in a boating accident in the Atlantic. Lost the boat too.\n\nWasn't it stolen by a fox earlier? So you did recover them to lose them again?",
				"added": 1615570705
			}
		],
		"1615237176_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 8,
				"body": "> [reflektion](#comment_4_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): so? if the news of late has shown us anything its that pedophilia is far more common than anyone thought, and if something is the rule rather than the exception trying to stop it is never going to work. Just look at the gay timeline and you'll see its the same.\n\nI know... they have to destroy dads and moms first ! which they are doing. There is no peaceful or political solution here anymore. only military but not of the usa... sadly.\n\n> [anonymouslogin](#comment_251_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Pedophilia is a mental illness, defined as sexual attraction to children. \n\nwrong, people can think what ever they want and it's impossible to find or arrests. I know they are degenerate irrecoverably made to be killed, however now ACTS is all that matter !  \n\n> [anonymouslogin](#comment_251_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): There is a chasm between pedophilia and child molesters. Child molesters are always pedophiles or sexual predators, but pedophiles are rarely child molesters. It seems to me it's the latest witch hunt, a classification we all can hate and be afraid of so we fear our fellow human. A house divided cannot stand you know....\n\ndon't classify, kill, for example all those who raped (ACT) kids in Britain, and the judges who covered for them. clean the house.",
				"added": 1615569469
			}
		],
		"1615440077_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 9,
				"body": "the sad part is that andrew, the prince, with jimmy saville (from the BBC where no one was held accountable) could have raped miss middeltown, and no one would have cared, as long as she wasn't the next queen...\nit's what makes me hate this form of gov. for example if the little charlotte was kidnapped and raped by angry waste from pakistan, there would be war to get her back alive. for all the non nobles girls, it's almost as if it's great that they were raped... more for social workers, more work for the press to cover it all up, fear in the society, white genocide ideal weapon, etc. disgusting.\n\nall pedos are against death penalty.",
				"added": 1615569628
			}
		],
		"1615569545_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": [
			{
				"comment_id": 10,
				"body": "big fan of Dr. Sherri Tenpenny ! she is cool !",
				"added": 1615569692
			}
		],
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": [
			{
				"comment_id": 12,
				"body": "> [hgbugcr](#comment_2_1EnYmaGWU5qxZi23fcPQtzJgcd7gxMCU5C): no one seems to mention there is somethign called an 'ecological limit'. Once an organism or species reaches a maximum capacity that the earth can handle it needs to be partially wiped out to make room. Organisms will either commit suicide or something happens that causes it to die rapidly. So if covid-19 was really deadly, even if we were to prevent it from spreading and save lives nature will find another way to wipe us out and it will probably be a lot more painful than what nature intended since now we humans have put it into our hands. Im guessing mass starvation, war or genocide due to lockdowns and unrest created from it.\n\nahh I see, @sword00000 you support the guidestone agenda? I don't believe that to be true ! we can each individually do so much better ! And remember help your self, and the sky will help you ! and no need to have cornering food tech like gmo for it. The universe is infinite. However poor designs can't even reach the stars.",
				"added": 1615571084
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 13,
				"body": "> [sword00000](#comment_43_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): The good news to come out of the virus scare: Free Speech made illegal...\n\nit was already the case. It started with Obama for his second term election theft. since then it only got worse. Think tea party...",
				"added": 1615571134
			}
		],
		"1615572045_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk": [
			{
				"comment_id": 16,
				"body": "i see already pedogen Honoré serving his master, planning his gun grab... pop pop... what? there is splash in the room... at least one DE less.",
				"added": 1615572086
			},
			{
				"comment_id": 17,
				"body": "fragging comes from the concept of when a commanding officers say to you and your buddy to go to jungle, you take one of your grenade and put it near this CO... it's fun, it works, it's pefect... then you have a few days of peace ! otherwise you would be dead, soon :). hehehe.\n\nfragging is the way of liberty and peace !\n\nvery common in vietnam :D.",
				"added": 1615572200
			}
		],
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": [
			{
				"comment_id": 18,
				"body": "> [calmdownholden](#comment_28_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Your conspiracy theory is lacking in citations and is just a dumb narrative.Into the trash your opinion goes.\n\nlet's settle all of this with some Enhanced interrogatory Techniques aka waterboarding, however after queuing all the friends of epstein /dreamin !",
				"added": 1615578666
			},
			{
				"comment_id": 19,
				"body": "but of course with a live feed backed by a national defense authorisation act (NDAA) on all msn... the truth, hardcore, gloves removed !",
				"added": 1615578762
			},
			{
				"comment_id": 20,
				"body": "btw how is the witch deborah brix going? traitors have no genders.",
				"added": 1615579023
			},
			{
				"comment_id": 21,
				"body": "nor ages.",
				"added": 1615579036
			},
			{
				"comment_id": 22,
				"body": "ahhh I like the censors are lost here ! add redstone (cdc) to the EIT... who transfered this virusdna mesh to china to be able to later release it and frame china? who launched the pork attack ealier? little heads at the cia going boom boom ! there own parents dead !",
				"added": 1615579589
			}
		],
		"1615580474_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk": [
			{
				"comment_id": 23,
				"body": "3.5  Strengthen the prevention and treatment of substance abuse, including narcotic drug abuse and harmful use of alcohol",
				"added": 1615580527
			},
			{
				"comment_id": 24,
				"body": "total war !",
				"added": 1615580533
			}
		]
	},
	"comment_vote": {
		"17_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1
	}
}