{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566051166,
			"title": "ZERO TALK MIGHT BE COMPROMISED",
			"body": "I created a thread stating how 08chan is compromised. I am not sure if it is a bug on my end, however the topic has completely disappeared from ZeroTalk. Take note that once the ZeroTalk admins see this, they might restore it for the dumb goyim.\n\nHere is the supposed link:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD/08CHAN+is+compromised\n\nAnd here is what I wrote: \n\nThe international jews are not idiots. They have already prophesiced that we will migrate to a decentralized option once 8chan shut down. \n\nSo instead of letting an unknown person whom they cannot control start a decentralized website, they have decided to create their own, albeit an inferior version in order to prevent collaboration.\n\n1) The website should use a very old, buggy and outdated engine (the millchan engine is around 2 years back from master) if the goyim requests for an update, explain to them we are not programmers.\n\n2) If the goyim STILL collaborates in our dummy website, fake a spam attack and require them to create a certificate from a clear net third party. It was during THIS time that the site population went down because the BO gave very vague instructions on how to create a certificate. (hmmm)\n\nI have absolutely no proof that 08chan is compromised. However \n- The peak concurrent population was around 4500 peers, now its less than 900. \n- I also cant help but notice how artificial the first 10 threads were, and most of them were (((shooter))) threads.\n- Even if 08chan is not compromised, the BO is irresponsible and has not taken any steps to update the millchan engine nor he has he implemented solutions to the declining population count or the numerous bugs present.\n\nThe BO might look legitimate and use anime avatars but that is because he is paid to act as one of us.\n\nSomeone must create a new image board soon.",
			"added": 1566051165
		}
	],
	"topic_vote": {
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1,
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1566178230_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 1,
				"body": "They are not idiots. They know this place cannot be shutdown and will avoid any kind of publicity. Should they decide to report it to the masses, expect them to mix \"Zeronet is for pedophiles\" or \"We found 300 i.p addresses because its p2p\".\n\nThe best way to increase publicity is to ease the installation and usage. For fucks sake the Zeronet windows exe file is buried deep within the Github page's readme along with the super bad hacky instructions. Normies hate this.",
				"added": 1566179884
			}
		]
	},
	"comment_vote": {
		"7_1PxkuTN6oZst8Q7inUZb6xqGJrtkHTGkDq": 1
	}
}