{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Markinformer",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1628428486,
			"body": "Tennessee health chief says children's hospitals will fill up as the Delta variant surges - “All of them”\n\nPushing the #covid #panic\nPushing a #vaccine that does not protect in a timeframe that won't protect at all. They've even created a new panic condition they are calling respiratory syncytial virus [bronchiolitus](https://www.cdc.gov/rsv/index.html) \n\nhttps://www.usatoday.com/story/news/nation/2021/08/06/tennessee-health-chief-childrens-hospitals-could-fill-delta-covid/5510382001/ https://www.newser.com/story/309534/childrens-hospitals-worry-state.html"
		},
		{
			"post_id": 1628428496,
			"body": "Is a new Worldwide lockdown envisaged as a means to combating the “dangerous” Covid variant entitled “Delta”?\nThe fear campaign has once more gone into high gear.\nLet's review the history of this crisis.\nThere is a sequence of outright lies and fabrications used to justify far-reaching policy decisions in the course of the last 18 months.\nThe biggest lie, which is firmly acknowledged both by scientific opinion and the WHO is that the RT-PCR test used to “detect” the spread of the virus/variants is not only flawed but TOTALLY INVALID.\nFrom the outset in January 2020, all far-reaching policy decisions upheld and presented to the public as a “means to saving lives” were based on flawed and invalid RT-PCR case positives coupled with false mortality data pertaining to Covid-19 related deaths.\nThese estimates were used to justify confinement, social distancing, the face mask, the prohibition of social gatherings, cultural and sports events, the closure of economic activity.\nhttps://www.globalresearch.ca/the-fake-delta-variant-and-the-fourth-wave-another-lockdown-upcoming-financial-crash-worldwide-economic-and-social-sabotage/5751819\n",
			"date_added": 1628428494
		},
		{
			"post_id": 1628428698,
			"body": "It's about time. Republican Calling On GOP To Impeach Beijing Biden And Head Of DHS Over Latest Border Disaster http://thetruereporter.com/top-republican-calling-on-gop-to-impeach-biden-and-head-of-dhs-over-latest-border-disaster/\n\n",
			"date_added": 1628428695
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}