{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "\"Лабиринт отражений\"? :3",
			"post_id": 1,
			"date_added": 1525025327
		},
		{
			"comment_id": 2,
			"body": "Очень серьёзные рекомендации. На самом деле тут большинство уровня защиты от ЦРУ. В реальной жизни вполне достаточно TOR+VPN, на мой взгляд. ",
			"post_id": 4,
			"date_added": 1525119501
		},
		{
			"comment_id": 3,
			"body": "Большое спасибо, Стрелок. Восхитительная статья. И радует, что всё расписано именно под Линукс. ",
			"post_id": 5,
			"date_added": 1525206423
		},
		{
			"comment_id": 4,
			"body": "Небольшой вопрос по Telegram - разве сквозное шифрование в MTProto не применяется в любых чатах? ",
			"post_id": 6,
			"date_added": 1525630662
		},
		{
			"comment_id": 5,
			"body": "> [deepstrelok](#comment_4_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Только в secret чатах\n\nА обычные что, просто плейнтекстом передаются? \n\nКстати, а насколько вообще анонимна регистрация через СМС-сервис? Остаются ли какие-либо следы?",
			"post_id": 6,
			"date_added": 1525631047
		},
		{
			"comment_id": 6,
			"body": "> [deepstrelok](#comment_5_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Через обычный ssl до сервера.\n> Непонятно какие следы имеются ввиду. След регистрации с вышки провайдера, т.е местоположение сим-банка сервиса, который использован. Следовательно если дело кому-то очень интересно могут прижать владельца сервиса.  А так в telegram перепривязка следующим смс и вот ты уже не владелец этого аккаунта. Не очень мягко говоря. И все обычные чаты, переписка в каналах доступна новому владельцу. Часто одноразовые смс симки дохнут и потом старый номер может получить новый человек.\n\nДля предупреждения похищения аккаунта через номер в Телеграме есть двухфакторная аутентификация. \nНо вообще, меня всегда удивляло, что в десктоп-версии по какой-то причине так и не завезли анонимные чаты. ",
			"post_id": 6,
			"date_added": 1525632023
		},
		{
			"comment_id": 7,
			"body": "Кстати, небольшой request, Леонид: можно в ближайшее время гайд по безопасным DNS и их настройке?",
			"post_id": 6,
			"date_added": 1525783803
		},
		{
			"comment_id": 8,
			"body": "Вы действительно пондяли достаточно важную тему, Леонид. Пожалй, выскажу, что думаю по этому поводу я.\n\nСколько бы редким оно не было, доверие в отношениях между людьми - по сути, в ЛЮБЫХ отношениях - необходимо. Вопрос лишь в уровне доверия, который может различаться. \n\nПо этой причине именно доверие является самым ценным ресурсом в обществе. Те общества, в которых доверие между членами выше (по данным социологической науки это, если не ошибаюсь, скандинавские страны - около 60% населения считают, что их окружают хорошие люди, которым можно безусловно доверять - для сравнения, по данным социологии в Москве таких всего 1%) более успешны, чем те, в которых оно минимально. \n\nТаким образом, сама по себе постановка вопроса \"не доверять никому\" предполагает полную изоляцию от любых посторонних людей, которые в этом сценарии непременно являются источником непредсказуемых угроз. Что, само по себе, действительности не соответствует. Сам факт того, что мы живем в обществе, говорит о том, что оправданное доверие существует. Быть может, его немного - ценный ресурс - но оно несомненно существует. ",
			"post_id": 7,
			"date_added": 1525813790
		},
		{
			"comment_id": 9,
			"body": "> [zeroout](#comment_3_1CF4nUiqsa2mxwzjnW98vGfi8n55Lz1VtQ): Очень интересно почему так? Провайдеру же, максимум известен сервер к которому обращаетесь. ДНС и остальное скрыто.\n\nХостера VPN, не провайдера вашего интернета..",
			"post_id": 4,
			"date_added": 1525938421
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"6": 1
	}
}