{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet крутится вокруг одного человека. И это нужно исправить",
			"body": "> Многие решили, что речь о том, чтобы отжать кое-что у кое-кого. Я имел в виду не это. Но если меня поняли так, и на меня со всех сторон гонят со словами \"ах ты ж негодяй\", я отступлюсь. Если все считают, что то, что сейчас представляет собой ZeroNet таким и должно остаться, я пойму.\n>\n> Значит, будем чинить централизацию по-другому. Напишем свой ZeroNet, на другом языке, с нуля. Тогда разработка не остановится.\n>\n> Спасибо за объективные обвинения.\n\n---\n\nВсем известно, что @nofish -- создатель ZeroNet. Чтобы не было недопониманий, сразу скажу, что я благодарен ему за созданную сеть.\n\nТем не менее, есть проблема: на данный момент @nofish -- единственный человек, у которого есть доступ к:\n\n- ZeroTalk'у, ZeroMe, и т.п., и к остальным сайтам\n- ZeroHello\n- Репозиторий GitHub и ZeroUpdate\n\nЧто приводит к парочке проблем.\n\n### Социальные сети\n\nВ ZeroNet любой сайт, который содержит пользовательский контент, не может работать без вмешательство его владельца. Чтобы можно было пользоваться ZeroTalk'ом, nofish должен следить за ограничениями размеров data.json. nofish поддерживает список хабов на ZeroMe. Не стоит и говорить, что есть nofish перестанет управлять всем, нам придется выкручиваться со старыми версиями зайтов без новых фич.\n\n### ZeroHello\n\nДомашняя страница ZeroNet'а приветствует нас каждый день. Однако, это не все, что она может делать -- ей даны права админа на ноде. То есть, если nofish'а взломают (честно говоря, я бы не удивился), код ZeroHello может быть изменен так, чтобы уничтожить всю сеть. Еще страшнее то, что изменения бы распространились по ZeroNet'у мгновенно, уничтожая все за пару минут.\n\n### Репозиторий GitHub и ZeroUpdate\n\nВ этих двух местах ZeroNet хранит свои исходники. И именно эти источники он использует для обновления. Из-за этого возникают сразу 2 проблемы:\n\n- Изменение кода. Это мы уже обсудили, поэтому пропустим\n- Остановка обновлений. Что может быть еще опаснее в долгосрочной перспективе\n\nZeroNet нацелен на децентрализацию. Все его сайты децентрализованы, поэтому в сети ничего не может отказать. В сети. Но вне ZeroNet'а все еще есть централизация. И это nofish.\n\nВ любой момент из-за проблем у nofish'а разработка ZeroNet'а может просто встать. Большинство пользователей получают обновления через GitHub и ZeroUpdate. Но если они перестанут обновляться, нельзя будет синхронизировать код пиров.\n\nКонечно, можно сказать: форкни сеть, репозиторий-то публичен. Сделай свою SuperNet. Ага. SuperNet. А не ZeroNet. Не все переключатся на *мой* форк. Или еще чей-нибудь форк. ZeroNet разделится на кучу маленьких кусочков, которые даже не смогут общаться друг с другом: какие-то форки перестанут обновляться, какие-то будут применять устревшие решения. Сообщество ZeroNet'а просто уничтожится. В одну секунду.\n\n---\n\nЕсть ли вообще решение?\n\nОдин из возможных вариантов -- помочь nofish'у работать над проектом. Один владелец -- это плохо. Несколько владельцев -- лучшее, что можно сделать сейчас.\n\nВот что нужно сделать *прямо сейчас*:\n\n- (возможно) Создать организацию на GitHub -- это поможет общению над ZeroNet'ом и работе над плагинами\n- Добавить других пользователей как collaborator'ов на GitHub\n- Поделиться ключами от ZeroHello, ZeroUpdate, ZeroMe, ZeroTalk и, возможно, каких-то других сайтов с доверенными пирами\n\nПосле этого, мы вместе сможем улучшить это решение:\n\n- Аккуратно настроить репозиторий на GitHub:\n  - Разрешать мержить pull request'ы, если есть хотя бы трое из пяти согласны (конечно, в случае, если добавятся 4 человека)\n  - Запретить изменения на ветках `py3` и `master` без pull request'ов -- это станет еще одной защитой от внесения вредоносного кода\n  - Разрешить изменение списка доверенных пользователей, если сообщество ZeroNet за это проголосует\n    - Это можно реализовать, сделав некоторых доверенных пользователей владельцами организации\n- Улучшить поддержку мультиподписи\n  - Если мы решим, что что-то нужно изменить, и мы достигнем консенсуса, сайты должны обновляться автоматически\n  - Если консенсуса достичь не получается, никаких изменения вносить нельзя\n\n---\n\nНаконец, стоит обсудить, кому, собственно, дадут права управлять сетью. Вот лучшее решение, которое я смог придумать:\n\n1. nofish'а добавляем автоматически\n2. Вы можете проголосовать за любого пользователя (включая) себя, прокомментировав [на английском ZeroTalk'е](/Talk.ZeroNetwork.bit/?Topic:1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di). Объясните, почему Вы решили проголосовать так (или почему нужно выбрать именно Вас), чтобы мы были уверены, что вы не бот и что мы понимаем, чем человек может быть полезен сети -- будет ли он разрабатывать ядро сети, плагины, зайти, или он \"генератор *хороших* идей\", или он силен в теории, и т.д.\n3. Если Вы кого-то поддерживаете, либо опубликуйте свой комментарий (на английском ZeroTalk), либо просто лайкните чей-то еще комментарий. (если A своим комментарием голосует за B, и Вы лайкаете этот комментарий, то голос уходит к B, а не к A)\n4. Голосовать можно за нескольких человек\n5. По прошествии какого-то времени, несколько пользователей с наибольшим количеством голосов будут избраны\n  - Период времени нужно обсудить. Я не уверен, как лучше сделать, поэтому буду рад предложениям\n  - Количество выбранных пользователей тоже нужно обсудить. Я бы выбрал лучших 4 человек, а если у\n  участвовать будет мало людей, то из них тех 4х, за кого больше 20% голосов\n  - Голоса тех, у кого нет *хороших* комментариев (т.е. ничего кроме спама) на ZeroTalk'е (ну или на русской версии) до 1 июля, не будут учитываться. Но если они прокомментируют (с каким-то объяснением, а не просто лайкнут), их голоса *будут* учитываться\n\n---\n\nЖдем ответа от @nofish.",
			"added": 1562003605
		},
		{
			"topic_id": 2,
			"title": "ZeroNet на Heroku",
			"body": "Недавно начал пользоваться Heroku, хорошая вещь. Решил попробовать поднять там ZeroNet py3. Старый ZeroNet кто-то уже поднимал (HeroNet), но он у меня не заработал, да и py2 версия устарела.\n\nВстречайте [awesome-zeronet.herokuapp.com](https://awesome-zeronet.herokuapp.com)!\n\nПрокси уходит в сон после 30 минут неактивности и сбрасывается каждые 24 часа, так что это больше прокси, чем bootstrap-нода.\n\nЕсли найдете уязвимости или захотите сами поднять прокси -- я готов обсудить.",
			"added": 1565968690
		},
		{
			"topic_id": 3,
			"title": "Name.YO -- DNS для ZeroNet",
			"body": "Знакомьтесь, [Name.YO](/1NAMEz7stUPZErkV1d3yLkVWQFa4PTqDNv) -- новый DNS для ZeroNet.\n\n## Чем Name.YO лучше ZeroName?\n\n- Он бесплатен! Для регистрации домена не нужны ни деньги, ни майнинг;\n- Регистрация в один клик. Не нужно ставить клиент Namecoin, ждать пока скачается блокчейн и думать, как купить Namecoin;\n- Поддерживается несколько TLD: .yo, .yu, .of, .inf, .zn и .list. В будущем этот список может увеличиться. .bit домены не поддерживаются для совместимости с доменами Namecoin;\n- Поддерживаются поддомены и wildcard-домены;\n- Легко найти владельца домена.\n\n## Где подвох?\n\n- Для использования Name.YO-доменов нужно установить плагин Name.YO (нажмите `Install` на странице Name.YO);\n- Name.YO централизован примерно так же, как и ZeroID -- не всем это нравится, но это единственный способ сделать Name.YO бесплатным.\n\n## Будет ли Name.YO работать без интернета?\n\nДа. Список доменов хранится децентрализованно.\n\n## Круто! Как начать его использовать?\n\nОткройте сайт [Name.YO](/1NAMEz7stUPZErkV1d3yLkVWQFa4PTqDNv). Нажмите `Install`, чтобы установить плагин. Появится запрос о перезагрузке ZeroNet, согласитесь. Теперь должны заработать домены Name.YO, например [name.yo](/name.yo), [kiwipedia.yo](/kiwipedia.yo) и другие.\n\nЕсли вы хотите зарегистрировать домен, промотайте до \"Register domain\". Убедитесь, что домен и TLD указаны правильно, удалить домен нельзя.",
			"added": 1566671425
		}
	],
	"topic_vote": {
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": 1,
		"5_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_1D5T43r4Ty2RDUa5a99WDyzvB4juRthkbH": 1,
		"1_1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ": 1,
		"1_1DM1Nn2JXHmDfr7zHtszmjJwQeX4j4QoYv": 1,
		"11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 45,
	"comment": {
		"2_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 1,
				"body": "У меня так же было. Изучал, буквально читая исходники на питоне. Зато теперь обжился :)",
				"added": 1530973787
			}
		],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_420_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Зато многим имеет важность невмешательство администрации в игровой процесс, публичность внутриигровых операций, независимость от серверных проблем и т.п. :)\n> \n> Я так понял, это просто демка технологий :D\n\nНужен плагин [PeerMessage](https://github.com/HelloZeroNet/Plugin-PeerMessage). То, что вы скачали сайт без плагина немного уменьшило вероятность того, что точки будут доходить до других пиров, кстати.",
				"added": 1537202537
			}
		],
		"2_1Fhc5yWswf5Rqu6HoCJTesRHoniQLcx7aT": [
			{
				"comment_id": 3,
				"body": "> [bvn13](#comment_19_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): RTFM! It is NOT proxy. It is somebody's zeronet (maybe yours?).User: 13tcH..qab5User's private uniq: 058fbbbd6ed13511a78aee9283491f0ed40dd8fd497129f263ed1425f9ccb7ad\n\nWhat?.. That's *your* private key, that was made when *you* entered the proxy.",
				"added": 1555525253
			}
		],
		"1_1Fhc5yWswf5Rqu6HoCJTesRHoniQLcx7aT": [
			{
				"comment_id": 4,
				"body": "> [syntia](#comment_53_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Сколько существует Вселенная, примерно  - 13,5 млрд. лет.  :)\n\nДействительно, примерно так. Если не удалит владелец хаба -- будут храниться вечно.",
				"added": 1555525353
			}
		],
		"1_1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ": [
			{
				"comment_id": 5,
				"body": "Конкретно с этой репой бага, которую непонятно как исправить.\n\nРешается так:\n\n```\nmkdir /home/user/ZeroBundle/ZeroNet/data/1KVD7PxZVke1iq4DKb4LNwuiHS4UzEAdAv/silent-uefiinsecureboot-disk.git/refs\ngit clone /home/user/ZeroBundle/ZeroNet/data/1KVD7PxZVke1iq4DKb4LNwuiHS4UzEAdAv/silent-uefiinsecureboot-disk.git\n```\n\nСмысл в том, что ZeroNet игнорирует пустые папки, и это до сих пор ни на что не влияло, а вот git'у обязательно нужна папка refs. В этом репозитории все refы лежат в файле packed-refs, поэтому директории refs нет.",
				"added": 1555602498
			}
		],
		"1_1D5T43r4Ty2RDUa5a99WDyzvB4juRthkbH": [
			{
				"comment_id": 6,
				"body": "Hola, CMS моя. Так-то она относительно заброшена, но постараюсь в ближайшее время закончить. Пока, в принципе, можно использовать ZeroBlog.",
				"added": 1555602801
			}
		],
		"1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq": [
			{
				"comment_id": 7,
				"body": "> [if0](#comment_22_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сам факт использования Питона в неком проекте способен сказать слишком многое о нем. Как минимум, что он никогда не будет доведен до своего финала и в нем постоянно будут вылазить \"совершенно неожиданные\" баги в изрядном количестве.\n> Почему? Подсказка: проект так и останется работающим прототипом, созданным в спешке ради как можно более быстрого демонстрирования базовых возможностей. Тесты? Нет времени на написание тестов, у нас еще не все обещанные в роадмапе фитчи зарелижены и критческие баги не пофикшены...\n\nНу, тесты есть, так-то.\n\n> [zerousernode](#comment_1_1A2cA3zYAtrhuHpTCLaKbDUZvUTP4y7yy8): Все разобрался я в чем причина при больших количествах подписок происходит какой то глюк связанный с блокчейном зеронета решение проблемы сменить айпи адрес\n\nВ ZN нет блокчейна. Вообще.",
				"added": 1558537810
			}
		],
		"6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 8,
				"body": "> [ultraviolet](#comment_49_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Личное скорее всего что то.  Жаль не застал. Может родные заебали мол какой фигнё страдаешь. Нужно бабло поднимать а ты тут творчеством занялся. Может испугался чего. А может быть решил начать летом новую здоровую жизнь:-)\n\nНе, не личное (знаком с ним). Скорее взбесило то, что юзеры постоянно чего-то требуют, мол -- раз open source, то давай работай, при этом не вникая, что никто никому ничего не обязан.\n\nКстати, не первый раз он уходит... В прошлый раз тоже ушел, надолго не хватило :) Так что, может быть, вернется.",
				"added": 1561801702
			},
			{
				"comment_id": 9,
				"body": "> [anonymouslogin](#comment_17_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Если новой драмы не произошло, то в ZeroMe есть её начало, середина наполовину удалена, пафосный конец остался, каталог-блоклистов вроде релизнулся. У Kaffie есть архивные копии закрытых сайтов, тоже в ZeroMe ищите.\n\nНовой драмы быть и не могло -- старая не закончилась :)",
				"added": 1561801751
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_182_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Давай так: ты готов поддерживать дистрибутив ZeroNet, который будет лучше официального?\n\nДавай так: сделать такой дистрибутив в одиночку не получится. Сделать вместе, ускорить разработку сейчас, не застревая из-за мелочей -- да.\n\n> [geekless](#comment_182_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Альтернативный дистрибутив, которому половина сети доверят так же как nofish-евскому - это реальное повышение надежности сети. Заведение бюрократии - нет.\n\nГде здесь бюрократия-то? Естественно, что-то добавляя, приходится аккуратно разруливать возможные ситуации. И уж лучше все обговорить заранее, чем решать на ходу.\n\nЯ был совсем не против того, куда движется ZeroNet. Но когда, блин, оказывается, что это решето, поневоле начинаешь задумываться. И просить nofish'а придумать решение. А он молчит. Вот что с этим делать?\n\n> [geekless](#comment_183_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Git Center ты разрабатываешь где-то локально, и это намного хуже, чем то, как идет разработка py3 ветки.\n\nНу, py3 разрабатывается несколько месяцев, GC я начал переделывать 5 дней назад.\n\n> Почему нет объявлений о тестинге?\n\nНу дык, рано еще, пока там не так много вещей, которые я сам не могу целиком протестить. Когда догонит по функциональности текущую версию (ожидается сегодня-завтра), тогда выложу.\n\n> Почему нет сорцов?\n\nЕсть xD на локалке. Я решил, что на GitHub публиковать не буду, будет self-hosted решение. Залью на тот же GC (точнее, уже залил).\n\n> Куда слать пул-реквесты?\n\nНа GC.\n\n> Ты скажешь, что тебе так удобнее, но и nofish так удобнее. Он уехал в отпуск, и пошло оно всё на. Он не платной работе.\n\nЭто две большие разницы. Новый GC -- проект, который даже не опубликован. Им никто не пользуется. Если я его не буду доделывать, никто не умрет. А вот ZeroNet'ом люди пользуются, и дыры закрывать нужно оперативнее. В этом и проблема.\n\n> Вопрос в том, как ты подходишь к делу, как это оценят другие. Насколько они будут тебе доверять, и насколько ты оправдаешь доверие. Я херовый программист, ты херовый программист, nofish программист получше.\n\nНуууу... почему-то дыры оставляет именно он, причем там, где их оставить сложно.\n\n> Именно в этом суть: тут нечего улучшать, кроме самого себя. Если бы я был лучшим мной, у меня был бы свой дистрибутив ZeroNet с моими плагинами и 4 готовых движка сайтов. Но я херовый программист, поэтому у меня этого нет, и нет никакой пользы обществу от меня. Есть 2 недоделанных движка и 4 стаба на плагины. Это не то, с чем можно выходить к людям.\n\nЯ сделал то, чем пользуются люди. Kiwipedia, старый Git Center, еще куча всего. Я написал PeerMessage и BackgroundProcessing, без которых сейчас не было бы KxoID. И прямо сейчас пилю что-то еще. Я расчищаю issues на гитхабе, фикшу какие-то баги. Трачу свое время на то, чтобы найти уязвимости, сделать PoC, и их закрыть. Я не продаю их в дарк нете. С этим выйти к людям можно.",
				"added": 1562051385
			},
			{
				"comment_id": 12,
				"body": "> [fant](#comment_2_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Обсуждение в английской версии \"обфрикилось\" и вообще свернуло не туда.\n\nДа. Ибо что делать -- вообще непонятно. Хоть какого-то консенсуса достичь не получилось. А nofish молчит. Я не знаю, что делать.",
				"added": 1562092632
			},
			{
				"comment_id": 13,
				"body": "> [geekless](#comment_187_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вообще, реализация с нуля по спеке и набору тестов — было бы круто. Но на текущем этапе не вижу в ней большого смысла. Довести до ума уже наимплементированный ворох API представляется гораздо более полезной идеей.\n\nВсе же, лучше раньше, чем позже. Потому что пока этот ворох API понятен (лично мне), а как станет потом -- не очень ясно. И уж добавлять новые фичи, следя за официальной реализацией, гораздо проще, чем потом писать все с нуля.",
				"added": 1562094703
			},
			{
				"comment_id": 14,
				"body": "> [geekless](#comment_187_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вообще, реализация с нуля по спеке и набору тестов — было бы круто. Но на текущем этапе не вижу в ней большого смысла. Довести до ума уже наимплементированный ворох API представляется гораздо более полезной идеей.\n\nПроблема в том, что спеки-то и нет :) А то, что задокументировано, хочется, наоборот, переделать. Избавиться от iframe'а, например.",
				"added": 1562094851
			},
			{
				"comment_id": 15,
				"body": "> [geekless](#comment_191_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ситуация как с самим питоном. Видать, заразно.\n\nУ питона хоть доки есть.\n\n> Как?\n\nЗачем нам вообще iframe? Чтобы никто никуда не вылез. Звучит как хак.\n\nУ нас в JS есть Proxy. Через него можно отключить кучу всего, если заинжектить свой код где-то в начале. А с этим проблем не будет.",
				"added": 1562095300
			},
			{
				"comment_id": 16,
				"body": "Проблема в том, что эта песочница, мягко говоря, сильно ограничена. Посмотри, сколько на github issues с вопросами \"а добавьте presentation api\", \"а почему не работает localstorage\", \"а мне нужно pointer lock api использовать\", etc.",
				"added": 1562095744
			},
			{
				"comment_id": 17,
				"body": "И начинаются пляски с бубном: для localstorage используйте ZeroFrame (а он, внезапно, асинхронный), для fullscreen -- тоже, и т.д.",
				"added": 1562095776
			},
			{
				"comment_id": 18,
				"body": "> [geekless](#comment_193_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А мы можем обращение к врапперу завернуть в те же прокси, а асинхронность спрятать от выполняемого кода, чтобы синтаксически он выглядел синхронным? Или в такие хаскель-подобные приколы JS не умеет?\n\nВ принципе, так можно сделать, но будет *очень* криво, и далеко не ясно, будет ли так работать, например, full screen.",
				"added": 1562096212
			},
			{
				"comment_id": 19,
				"body": "> [fant](#comment_4_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): <off>Слушайте, вы же все и всех тут знаете )ZeroLSTN ушел? Он же потрясающую штуку так и не допилил до конца ((</off>\n\nНу в чате он вчера был :) Видимо, времени не хватает. Он еще и над matrix работает.",
				"added": 1562096570
			},
			{
				"comment_id": 20,
				"body": "Задумался, что понятия не имею, как ZeroNet скачивает пользовательские файлы. Списка директорий-то нет в content.json...",
				"added": 1562096638
			},
			{
				"comment_id": 21,
				"body": "> [geekless](#comment_194_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если API соблюдается, ничего кривого. Имхо, самый прямой способ: сначала ограничить крупноблочной ограничивалкой, а недостающее прокинуть отдельно. Так что суть как раз в том, будет ли работать.\n> Вот еще что меня интересует - возможность запустить код другого сайта как сервис и дергать там методы асинхронно. В принципе, с iframe-ами не вижу принципиальной сложности: по команде ядра, враппер открывает еще один (скрытый) ifame, в котором грузит сайт, и организует канал связи между обоими ограниченными ifame-ами.\n\nВ принципе, можно реализовать.",
				"added": 1562096666
			},
			{
				"comment_id": 22,
				"body": "> [geekless](#comment_195_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Его так и звать ZeroLSTN, или у него есть более человеческий пользовательский сертификат?\n\nЕсть некий amorgan@zeroid.bit, но я не знаю, он это или не он.",
				"added": 1562096822
			},
			{
				"comment_id": 23,
				"body": "> [geekless](#comment_196_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В смысле нет, там полные пути указаны.\n\ndata/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json\n\nНу и где это указано? :)",
				"added": 1562096841
			},
			{
				"comment_id": 24,
				"body": "> [geekless](#comment_197_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там обычно только data.json, а путь считается от каталога, где content.json лежит, поэтому явного пути нет. Открой корневой content.json, там полные пути для всякой всячины.\n\nРечь о том, что \"1GooUE19488nDwG3TdkM8seYAHct4gjkq4\" нигде не захардкожено. Поэтому какие адреса пробовать -- непонятно.",
				"added": 1562097081
			},
			{
				"comment_id": 25,
				"body": "Вроде разобрался. Есть некая команда listModified ~~(которую еще предстоит реализовать)~~, которая возвращает список файлов и дату их изменения (в определенном временном интервале). Поэтому если спросить у кучи пиров listModified, там будет и список пользовательских директорий.",
				"added": 1562097181
			},
			{
				"comment_id": 26,
				"body": "А лежит этот inner_path где? Правильно, в директории с именем 1GooUE19488nDwG3TdkM8seYAHct4gjkq4.",
				"added": 1562097258
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 11,
				"body": "> Имеет смысл делать под py2 или py3?\n\npy3 однозначно, nofish сказал, что на py2 будут только хотфиксы.\n\n> Переработать плагин целиком и делать PR на всё сразу, или PR-ить в апстрим мелкими кусочками?\n\nЕсли делать по кусочкам, больше вероятность того, что смерджат.",
				"added": 1562081533
			},
			{
				"comment_id": 27,
				"body": "> [geekless](#comment_202_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Придумал, как объехать проблему. :D\n>     def getSupportedProtocols(self):\n>         if not self.site_announcer:\n>             return None\n> \n>         supported_trackers = self.site_announcer.getSupportedTrackers()\n> \n>         protocols = {}\n>         for tracker_address in supported_trackers:\n>             protocol = self.getNormalizedTrackerProtocol(tracker_address)\n>             if not protocol:\n>                 continue\n>             protocols[protocol] = True\n> \n>         protocols = list(protocols.keys())\n> \n>         self.log.debug(\"Supported tracker protocols: %s\" % protocols)\n> \n>         return protocols\n\nВ Python вроде есть set, должно покрасивее получиться\n\n```python\ndef getSupportedProtocols(self):\n    if not self.site_announcer:\n        return None\n\n    supported_trackers = self.site_announcer.getSupportedTrackers()\n\n    protocols = set()\n    for tracker_address in supported_trackers:\n        protocol = self.getNormalizedTrackerProtocol(tracker_address)\n        if not protocol:\n            continue\n        protocols.add(protocol)\n\n    self.log.debug(\"Supported tracker protocols: %s\" % protocols)\n\n    return list(protocols)\n```",
				"added": 1562144547
			}
		],
		"2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 28,
				"body": "Сложности? Сложностей не было вообще.\n\n- Создаем инстанс на Heroku\n- Пишем тупой Procfile `web: python3 start.py --ui_ip '*' --ui_port $PORT --ui_host awesome-zeronet.herokuapp.com`\n- Включаем Multiuser\n- Радуемся жизни",
				"added": 1566070911
			}
		],
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 29,
				"body": "> [fant](#comment_30_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): А почему-то у меня ссылки открываются в виде:\n> Not Found/kiwipedia.yo\n> Плагин поставлен. Включен. ZN перезагружена много раз.\n\nПопробуйте обновить ZeroNet (если у Вас не последняя версия, конечно). Нужна версия rev4181 или выше.",
				"added": 1566802292
			},
			{
				"comment_id": 30,
				"body": "> [fant](#comment_32_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Трудно сказать что это было, но помогла полная переустановка плагина.\n\nКажется, где-то рядом с версией rev1481 есть коммит с названием \"Fix update of plugins\". Возможно, это оно.",
				"added": 1566885167
			},
			{
				"comment_id": 32,
				"body": "> [fant](#comment_39_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Напишите инструкцию \"для чайников\" как добавить кнопку и сам плагин на собственные зайты.Я бы поставил себе, к примеру...\n> Проблема подлинности плагина только будет... да?\n\nЕсть тупой способ -- просто дать ссылку на name.yo, тогда проблем с подлинностью не будет. Сейчас пилю.",
				"added": 1567186150
			},
			{
				"comment_id": 33,
				"body": "> [fant](#comment_39_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Напишите инструкцию \"для чайников\" как добавить кнопку и сам плагин на собственные зайты.Я бы поставил себе, к примеру...\n> Проблема подлинности плагина только будет... да?\n\nСделал. [Вот пост на ZeroMe](/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/1567187939). Еще на сайте Name.YO добавил раздел \"Support Name.YO\".",
				"added": 1567188044
			}
		],
		"6_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 31,
				"body": "> [7heaven](#comment_24_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Спасибо. Теперь стало намного лучше. У меня такой еще вопрос возник: а есть ли в сети зеронет зайты, которые собирают список трекеров и ты просто на него заходишь потом нажимаешь кнопку \"apply\" и оно автоматически добавляет новые трекеры. Тип как с зайтами с блоклистами.\n\n[Syncronite](/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/) примерно это и делает.",
				"added": 1567154539
			}
		],
		"1_1DM1Nn2JXHmDfr7zHtszmjJwQeX4j4QoYv": [
			{
				"comment_id": 34,
				"body": "На английском ZeroTalk есть proposal \"Rethinking ZeroNet Reddit\", но его еще нужно реализовать :)",
				"added": 1567800987
			}
		],
		"2_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 35,
				"body": "Ну так страница называется \"Create new profile\", не нужно создавать профиль каждый раз. Если один раз вошел -- больше не нужно.",
				"added": 1568296547
			},
			{
				"comment_id": 36,
				"body": "Offtopic: Интересно, у меня Chrome скрин отображает, а Firefox ругается. У остальных так же?",
				"added": 1568296581
			}
		],
		"11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 37,
				"body": "> Но сомневаюсь, что его примут.\n\nПочему бы нет? Можно попробовать перенести посты со старого форума на новый (e.g. в подпапку), правда, юзернеймы слетят, но тогда может и примут.",
				"added": 1584268978
			},
			{
				"comment_id": 38,
				"body": "> [geekless](#comment_262_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Также, кому дать права админа на новом форуме? @gitcenter? @caryoscelus?\n\nНе откажусь. Новый форум надо продвигать, только не до конца понятно, как. ZeroMe это, конечно, хорошо, но большая база пользователей все равно не заметит, а пиры набирать нужно.",
				"added": 1584372352
			},
			{
				"comment_id": 40,
				"body": "up",
				"added": 1584863822
			},
			{
				"comment_id": 41,
				"body": "up",
				"added": 1602952204
			},
			{
				"comment_id": 42,
				"body": "> [jk7](#comment_61_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Наплодили сущностей!\n\nТакое случается, когда форум забрасывают, с китайским было то же самое. Но там со старого форума всех удалось выгнать на новый, а этот, русский, еще живет.",
				"added": 1603020651
			},
			{
				"comment_id": 43,
				"body": "> [jk7](#comment_62_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Тут, похоже, удалить вообще ничего технически нельзя. Только методом потери всех пиров. Может договоримся и удалим данный форум дружно из закладок? Только чтоб в верху на срочке выбора языковой ветки была ссылка по-умолчанию на 2-ю версию форума.\n\nНа en-ZeroTalk сейчас ссылка правильная. Идея-то хорошая, только пиры все равно не останутся. Предложение получше -- просто ничего здесь не писать, кроме как в эту тему.",
				"added": 1603367777
			},
			{
				"comment_id": 44,
				"body": "up",
				"added": 1609432888
			}
		]
	},
	"comment_vote": {
		"5_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"2_1PS34S4Rnz9kyBEicX1nGsARnwmDQniHYH": 1,
		"127_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1LEJdA2fYe9wWCXUcg8fEipndWGNFWxnpb": 1,
		"195_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"262_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}