{
	"title": "deen's  Blog",
	"description": "我的私人幻想乐园",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1490961891,
	"post": [
		{
			"post_id": 5,
			"title": "门外汉对于数字货币的一些无知幻想",
			"date_published": 1469681898.949,
			"body": "上一篇跟大佬们汇报了我正在学习数字货币，这一篇算是这几天看了各种文章和资料后产生的一些无知的想法，有9成9的几率通篇廖误，大佬们就当茶余看笑话也是可以的，如果能够指导我，那小弟肯定是万分感谢！\n这两天我业余时间一直都在网上搜索相关的内容查看，关于数字货币，个人感觉像是限量发行的虚拟股，大多数字币初期都是开发人员及少部分专业人士以及行业大佬在支持和推广，很多新闻里都有提到某某币至今为止还有多少已经挖出的货币从来没动过，然后目前大多数数字币的出产量都是设计为在一个时间段以后进行调低出产量，这势必就造成挖矿难度越来越高，那就会有更多的人只是进入交易池，甚至于连这款数字货币的钱包都没有下载过，只是在某些网站上直接生成了一个钱包地址，我想这对于一个数字货币来说不能说是好事，越来越少的人下载钱包，就意味着这个数字币的安全性越来越低，到最后就是这个数字币价值很高，但是却不能流通、离不开实物货币的兑换，大多数人只是把它当做类似股票的东西，少数人承担着整个账本，这应该不是数字币的初衷吧。\n然后，我就以自己普通人的想法，思考了一下如果是我，我会希望数字币怎么运行，怎么生存下去甚至于接管整个金融系统呢？从最初的设计就应该有所准备，数字货币越多普通人用就越安全，要是开始就做好尽可能的平衡会不会更好？就拿挖矿来说吧，这几天看下来，我的理解是，挖矿就是挖到了一个有奖的交易记录块并记录了下来，然后从这条记录中可以获得一定的数字币奖励，在这里可不可以这样做，就是当这个节点挖到了记录并获得了奖励时，同时向普通用户进行二次分发，这个奖励分发是从这个块里分割的，所以对于总量没有影响，但是对普通用户来说挖矿可以变得容易，那就是在线同步账本就可以挖到二次矿，具体普通用户如何定义，二次分发如何定义，获得二次分发的规则如何，我无能为力，或许几年后我可以想想，23333，降低普通人挖矿的难度，觉得还有一个好处，那就是可以让数字货币更像一个有情怀的未来货币，怎么说呢，就像初中历史上学过的，货币是因为人们要更加方便的交易，定义价值，同时又要遵循多劳多得、少牢少得、不劳不得的社会之基本而产生的，但是未来的话，我想一个完美的社会应该保障每个人基本的生存，就是他存在就是贡献，就可以获得基本的生存保障，这点数字货币就可以，只要他在线同步了账本，按照二次分发具体的规则，他就会有大概能维持生计的收益，当然如果他想要更好的生活，依然要去工作要去奋斗，这时就可以促进数字货币更像货币甚至真正超越传统货币，就是让货币也有了情怀，当普通人有了使用数字币的需求，那么通过挖矿获得了不少数字币的大佬们，才真正有可能把数字币像货币一样去使用，而不是现在这样就是为了套现，套现完了就去升级矿机和算力，然后再挖再套现，到最后只能是走向一潭死水。\n数字币还有一点就是无法主动适应市场，就像银行会为了调节市场可以灵活的增加或者缩减货币发行量，我想是不是可以引入一个投票机制，就是整个系统可以自动检测并汇总所有人一定时间内单笔交易的最低金额形成一个指数，这样应该能得出整个数字币系统的通胀通缩情况，当出现不正常的波动时，会由整个数字币网络自动向全体使用者发起投票机制，通过投票来决定是否调整货币发行量，也就是出块难度。\n写到这，我的脑瓜子突然宕机了，下面想说啥一下子就空白了，估计是她觉得我在犯傻拦住了我，好吧，这篇胡扯就到这里了。。。。。。"
		},
		{
			"post_id": 4,
			"title": "初尝虚拟币的感受",
			"date_published": 1469638960.9,
			"body": "起初是为了招代理软件无意间撞到了零网，然后从零网知道了去中心化这个词，又从去中心化后知后觉的发现了区块链这个词，然后又从区块链更加后知后觉的发现，原来还是虚拟货币啊！然后就凭着好奇心决定学习一下，可想啊，一个小白中的小小白，研究学习了好多天才搞懂名词解释，剩下的路还很长，突然觉得浪费了好多时间，都没有好好学习进步啊！"
		},
		{
			"post_id": 3,
			"title": "感谢domains4free大佬，本博客成功绑定.bit域名",
			"date_published": 1469500839.96,
			"body": "感谢domains4free提供的无私帮助，昨天下午发的申请邮件，今天早上就收到了回复，太感谢了！同时，还要感谢mcjiffy大佬的教程，让我顺利完成了域名绑定，祝愿大家每天都能开心愉快！"
		},
		{
			"post_id": 2,
			"title": "在0网的第一篇",
			"date_published": 1469434841.414,
			"body": "做为一个萌新，来到这个崭新的世界，其实我是有点瑟瑟发抖的，抱着一颗学习进步的心，我会慢慢熟悉和用好这个平台的，也希望大佬能多多的帮助我，最后，希望我们期许的未来能够快点到来！"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}