{
	"title": "The wandering Nexus\n",
	"description": "A Nexus blog",
	"links": "*   [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1547814605,
	"post": [
		{
			"post_id": 4,
			"title": "Stabbing emotions",
			"date_published": 1547736623.413,
			"body": "The motion of our daily lives leads to a very bland experience of the world. Perhaps that is why we don't really pay attention to anything and small observations can feel like a Big Bang of personal revelation.\n\nHuh,I have a feeling this will turn in to a very emo entry...Fuck it. It's been a decade, I can pass this as retro, right? Cool :)\n\nRecently I had such a moment. I figured out what was missing from my life. I was.\n\nIt wasn't that I was just standing in a corner not doing anything, but I was no longer engaged by anything I couldn't. It kinda makes sense to feel this way, this can come from anything, or so I noticed, the more meaningful the event, the deeper the impact and probably more long lasting.\n\nI have not insight on this one, and honestly I think it's the sort of deal where you make your own recipe and you roll with it. \nBut the \"fix\" seems always the same from the outside; you are \"well\" again. Sure, I tell them, I'm well just like you are..a well of knowledge and wisdom :D\n\nMy own takeaway on this state would be: go through it, and fuck anyone who tries to bring on any sort of negative connotation to you through it. They either were there and repressing it, or they haven't gone through it yet, so they are really talking about something they know nothing about.\nRide that shit out and own it, only then can you make sense of it. When you made it your own.\n\n\n\"Why do people cut themselves? They want to drown out all the crap with the nearest liquid available :)\" ~ Some douche"
		},
		{
			"post_id": 3,
			"title": "It's growing on me",
			"date_published": 1547047513.666,
			"body": "I don't know how it's for other people, but for me starting a new thing--one that I like-- is always a mixed bag of emotions.\n\"Will I be any good? Will I understand it? Will there be people there? Will they be nice?\"\n\nMost of the time it's a bit overwhelming to have such a complex net of thoughts and emotions lived in a second--my brain decided not to wait and just brick wall me with them to get it over with. Age of speed my ass!-- but there are special occasions where this doesn't happen. Finding Zeronet was one of them.\n\nThis wasn't my first foray into the decentralized zone, and I do like the concept it stands on--it's why I believe Mastodon is a must in the near future if not now. Feel free to check it out, if you want out of the sanctioned and albeit \"safe\" social media-- Freedom! No more. No less.\n\nIf I'd have to compare it as an experience, I'd have to say it looks and feels like having your training wheels taken off your bicycle, only online. \nJust like the Fedivers, It shows you the basics and then it gives you unrestricted, UNTAILORED access to all the internet and it dwellers have to offer. \nIt assumes that if you are here, you are capable of doing your own filtering and that you won't run scared at the sight of some things that are deemed NSWF or some other label that the current internet establishment deems unacceptable! --Insert Lemongrab reference here, to show how cool I am! :D--\n\nYou can find almost anything here, from the horrible to the really dumb to the wonderful and amazing. And I think that this is the signal that more and more people are zeroing --see what I did there? :D-- in on. Unknown potential, we want to know that's it's still there waiting for us, not something cut out just for me because your profile told you to.\n\nPeople don't know what to expect, or better yet, this place teaches you that your expectations are irrelevant, and that you should just explore to your heart's content without fear that one day it will be used against you or sold back to you.\n\nI think the point I wanted to make was that: I missed all aspects of freedom, even the dangers that come with it. It feels really good to have a choice again, evem if it's on a screen.\n\n“If you can't take a little bloody nose, maybe you ought to go back home, and crawl under your bed. It's not safe out here! It's wondrous...with treasures to satiate desires both subtle and gross; but it's not for the timid.” ~Q, Star Trek The Next Generation"
		},
		{
			"post_id": 2,
			"title": "The first Hello",
			"date_published": 1546798172.9,
			"body": "For my first entry all I'll say is this: navigation is impossible when all maps are confiscated and all compasses broken.\n\nMore to come. Not just mere opinions and conclusions, but even the dreaded judgement, that calling the kettle black when it is, naming shit when shit get's done!\n\nWhat's the counter to a blind fold?"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}