{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": 1,
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_18iNiFsd2V5Xkzf9B1QoAgvqsnHe8EGBam": 1,
		"1_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": 1,
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": 1,
		"2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 1,
				"body": "> [geekless](#comment_129_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если кто-то в среднем продвинутее своего окружения, он будет более приспособлен к жизни и активен. А будучи таким, он в столкнётся с теми, кто ему равен по прогрессу, и между ними развернётся борьба на равных. Это, мать её, эволюция. :)\n\nБиологические особенности человеческого организма уже давно играют меньшую роль в вопросах успешности индивида, чем его социальная роль и место в иерархии, а так как место в иерархии вполне передаётся \"по наследству\" то возникает иллюзия действия эволюционных сил в обществе.  Но это именно иллюзия, скорость эволюции много меньше скорости социальных изменений.",
				"added": 1561380001
			}
		],
		"1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 2,
				"body": "Спасибо.  Начало мне уже нравится! Всё я знаю что буду читать в ближайшии дни по вечерам:-)",
				"added": 1561538039
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 3,
				"body": "> [if0](#comment_77_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Хорошая идея. Только при использовании подписи в случае хищения приватного ключа у нерадивого пользователя возникнет еще больше проблем, учитывая то, что отозвать подпись будет невозможно и уже ничего не докажешь, если злоумышленник захочет что-либо опубликовать используя вашу подпись.\n\nА есть ли способ отзыва своего ключа в случае его хищения?",
				"added": 1561538137
			},
			{
				"comment_id": 4,
				"body": "> [geekless](#comment_159_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Нету.\n\nВот и идея. Зейт с списком отозванных ключей. Запросы на отзыв подписываются закрытым ключём. Из проблем вижу возможность отозвать учётку если украдёшь чужой ключь,  вопрос как гарантировать что время направления запроса корректно и то, что этот список в техническом плане не будет ни на что влиять.",
				"added": 1561539885
			},
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_160_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Технически неосуществимо в текущей архитектуре.\n\nДа нет вроде ничего сложного. Просто форум на котором каждый может написать - я отзываю свой ключь.",
				"added": 1561540279
			},
			{
				"comment_id": 6,
				"body": "> [geekless](#comment_161_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Написать при помощи отозванного ключа?\n\nДо момента публикации ключь формально действующий, после нет. Собственно именно так и работает отзыв сертификатов в PKI",
				"added": 1561543486
			},
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_162_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Лицорука! Вы по какой причине его отзываете? По причине компроментации приватного ключа. И этим же приватным ключом подписываете отзыв? Ну прикольно, злоумышленник следом просто сотрёт ваш отзыв, все дела.\n> \n> Отзыв сертификатов происходит ключом, выдавшим сертификат. Это вам надо на поклон к @nofish идти, на личную встречу с паспортом, чтобы он написал \"отзываю сертификат stainlessrat\" и подписал эту строчку своим мастер-ключом ZeroID. Вы так себе анонимную сеть представляете?\n\nЗначит предусматриваем логику согласно которой отправить сообщение на форум можно только раз, после он с тем же ключём сообщения не примет.",
				"added": 1561544895
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_163_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В ZeroNet технически неосуществимо.\n\nя специально не разбирался, но мне сложно представить, чтобы это было принципиально нереализуемо.",
				"added": 1561545077
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_164_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Можно, конечно, предположить такой протокол передачи апдейтов, в котором некоторые сущности разрешено только дописывать, а не редактировать. И узлы откажутся принимать апдейт файла, если в нём неперезаписываемая часть изменилась. Но на данный момент ничего подобного не реализовано.\n> Так что для такой фичи потребуется либо переделка логики ядра ZeroNet, либо отказ от децентрализации в пользу выделенного сервера.\n\nЗначит я не прав.",
				"added": 1561553818
			}
		],
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 10,
				"body": "Всё верно. Даркнет нужен нам для защиты наших прав!",
				"added": 1561726191
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 11,
				"body": "> [cetpysits](#comment_1_16XJNg87s4qSWzCqAQgmM6QpDbgFjnJ2ct): что угрожает любому грязному рынку?в первую очередь тот сигмент рынка в котором мы сидим, а также криптовалюты.Сейчас создают либру, она по сути не криптовалюта, вся надежда на Дурова.\n\nКриптовалюты никак не угрожают рынку.",
				"added": 1562059819
			},
			{
				"comment_id": 15,
				"body": "Кто читал Лебского - Новый русский капитализм?\n\nhttps://vk.com/id147287167",
				"added": 1563201490
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 12,
				"body": "Спасибо!",
				"added": 1562059850
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 13,
				"body": "> [if0](#comment_111_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Наверное, исходя из статистики лечения.\n> \n> Свобода и власть - очень не четкие и растяжимые понятия.\n> Свобода в чем? У рабов тоже была полная свобода: хочешь служи хозяину, хочешь - беги, хочешь - восстань, а ничего не хочешь - покончи с собой. Жить по законам, устанавливаемыми меньшинством и терпимыми  большинством - свобода?\n> Власть какого объема? Объявлять войну, заключать мир, утверждать налоги и бюджет или выносить приговоры - казнить, помиловать?\n> \n> А как же коммунизм?\n\nНу начинаете словесный понос.  Давате отрежим вам ноги и вы поймёте что такое свобода.  В армии служили?  Жаль что нет. Нет я не поклонник идеи что армия \"делает мужиком\", но власть там даже у сержанта или ротного старшины не абстракция а суровая реальность.",
				"added": 1562592314
			},
			{
				"comment_id": 14,
				"body": "> [if0](#comment_115_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я спросил: что такое свобода и власть, а вы начали про понос, аримю и ноги.\n> Свобода - пустой звук, человек, как живое существо не может быть свободным, потому что, как минимум зависит от своего тела - вынужден его содержать: кормить, предоставлять отдых, одевать, лечить, обеспечивать условия проживания. К тому же человек живет не один в глухой тайге, в обществе, с которым приходится взаимодействовать, опять же не по своей свободной воле, а по жизненной необходимости, которая наклавдывает еще больше ограничений, чем физиология. В результате от свободы остается - пшик, пустое место. Тот, кто рассказывает про свободу - либо лицемерный демагог, либо инфантильный мечтатель, оторванный от реальности.\n> Вы предлагаете отрезать ноги, а сами попробуйте прожить без еды на улице хотя бы три дня и ощутете в полной мере, что такое \"свобода\".\n> Власть не может быть у всех в равной мере, точно также, как не может быть одинаковым благостояние - это утопия. Обязательно произойдет ее перераспределение - от слабых, глупых, безвольных, ленивых к сильным, наглым, волевым и деятельным.\n\nЕсли бы физики рассуждали также как вы то они сказали бы что нет законов термодинамики потому что нет идеального газа.  \n\nЗаконов гидродинамики тоже они не нашли бы.  Идеальной жидкости в природе нет\n\nИ с механникой были бы проблемы, потому что нет идеально твёрого тела\n\nПо счастью нормальные люди живут в реальностиа не в вымышленных мирах, используя последнии только как удобные модели",
				"added": 1562667790
			},
			{
				"comment_id": 18,
				"body": "> [alie](#comment_1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV): Идут перемены\n\nВ Москве народ протестует против незаконного снятия кандидатов в депутаты московской думы. В  Санкт-Питербурге волнения назревают, Шиес, Екатиренбург даже Ингушетия.  В Приморье выборы пошли не так как планировали единорасты и в Хакасии главой республике стал чел из КПРФ а не от пидоров из ЕР",
				"added": 1564486703
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 16,
				"body": "Готов скинуться ему деньгами. Есть счёт?",
				"added": 1563270126
			}
		],
		"1_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": [
			{
				"comment_id": 17,
				"body": "> [ngc](#comment_5_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L): Значит если в настройках стоит TOR olways значит весь траф всегда через тор идет?\n\nЕсли я правильно понимаю то Tor броузер нужен скорее против случайной утечки ip при открытии ссылки ведущей в clearnet\n\nСама настройка ZeroNet для работы через tor не связана с броузером, tor может просто работать без связи с броузером",
				"added": 1564476736
			}
		],
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": [
			{
				"comment_id": 19,
				"body": "что меньше памяти ест. Так вроде Palemon ничего",
				"added": 1564502866
			}
		]
	},
	"comment_vote": {
		"157_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"5_1JXt6o6VHCEur5cAv2P3tmywxCz36r5u8q": 1,
		"111_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_194pDo3F76iy7UnsyuXVdgtH3BVM1Ai1dg": 1,
		"31_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"239_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"8_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"5_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy": 1,
		"8_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"4_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": 1,
		"141_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"28_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"87_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"5_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": 1,
		"78_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": 1,
		"70_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"104_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"103_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1
	}
}