{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1578266563,
			"title": "Organizing New Resources to Fix & Grow Zeronet",
			"body": "There's a lot that needs to be fixed on here, apparently. I'm new to Zeronet - and Freenet, Tor, I2P, and other Offnets, but am engaged in an intensive survey of their statuses and capabilities. So much of it is either \"Half Baked or Half Broken\". I am establishing a company, ://DeltaNova.Media , which will specialize in fixing and utilizing the Offnets, to make Alternative Media Inherently Uncensorable. The first interconnect between them will be known as AMPTONOCX. It will have a 'Zite portal up shortly.  I would love any input, suggestions or advice from anyone in the community. \n\n presstodigitate@ctemplar.com",
			"added": 1578266562
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 1,
				"body": "There's a lot that needs to be fixed on here, apparently.  I'm new to Zeronet - and Freent, Tor, I2P, and other Offnets, but am engaged in an intensive survey of their statuses and capabilities.  So much of it is either \"Half Baked or Half Broken\".  I am establishing a company, ://DeltaNova.Media , which will specialize in fixing and utilizing the Offnets, to make Alternative Media *Inherently Uncensorable*.  The first interconnect between them will be known as AMPTONOCX.  It will have a 'Zite portal up shortly.",
				"added": 1578266181
			},
			{
				"comment_id": 3,
				"body": "@quantumkitty  I agree, that's the first thing we're going to fix.",
				"added": 1578268604
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 2,
				"body": "That general was engaging in state-sponsored terrorism.  He should have been taken out long ago, but Obama and Bush were too spineless to do so.  Getting the Iraqis to ask us to leave is Brilliant - we get \"Peace with Honor\" and bring our boys (& cash) home.  This is almost as shrewd as sticking Putin with the mess in Syria that Trump palmed off on the Russians.  Trump is getting us out of these quagmires that Obama left festering.",
				"added": 1578266983
			}
		]
	},
	"comment_vote": {}
}