{
	"title": "行动派",
	"description": "终生成长者的行动日志",
	"links": "[ZeroME](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1BXKLNgP3eSyvsLdttzEHHCxkpD4XPt7CA/guixiang@zeroid.bit)\n\n[链接](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:6:%E9%93%BE%E6%8E%A5)\n\n[归档](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:7:%E5%BD%92%E6%A1%A3)\n\n[小财神的奋斗](http://caisixiang.com)",
	"next_post_id": 47,
	"demo": false,
	"modified": 1499523238,
	"post": [
		{
			"post_id": 46,
			"title": "CHOICE",
			"date_published": 1499523073.009,
			"body": "为节约自己的注意力，会优先每天更新在公网的博客，毕竟一篇文章发几处没有意义。\n\n**零网这里主要是琢磨如何应用更有趣方面了。**\n\n欢迎大家访问我的博客：[小财神的奋斗](http://caisixiang.com/)"
		},
		{
			"post_id": 45,
			"title": "Love what you do",
			"date_published": 1499263855.005,
			"body": "”人们很难喜欢自己做不好的事情“，因为自己做不好一件事，所以很难去喜欢它。\n\n* * *\n\n我对此有无比心酸的领悟，并将此事和正在上中学的儿子讲过几次。只有勇敢坚定地去打破它，自己才能获得新生。\n\n高中时因为做不好英语课上”中文译英文“，不喜欢英语，进而高考英语仅仅60分，哪怕自己喜欢的数学分数很高也无济于事，只能进入了中专学校学习。虽然在90年代初还算不错，但当初的幼稚行为，让自己用了很长的时间才弥补回来。\n\n与之鲜明对比的，就是我学习并从事会计专业一事。由于父亲是村里会计，每到大年三十都在收账，儿时的我很不理解，加上经常看到父亲那么晚还在打算盘结账，遂宣称长大绝对不当”会计“。人生处处都精彩，因为英语考砸被中专学校录取，竟然是会计专业。学校第一次的专业测试，由于高中学习惯性，我竟然考了个满分。让自己突然喜欢上会计，并一直做会计到今天，可能还会继续做下去。\n\n多年后回想起高中英语和中专会计的学习，仍然让自己感慨，早一点有人给自己讲清”干一行爱一行“的学习道理多好啊。这也是我在开始时说反复和自己的儿子说的原因。\n\n这个学习道理就是：\n\n> 先把它做好，不需要做到完美，只能能够让你感受到自己在这件事上的进步 ，你就已经可以爱上这件事了。\n\n做日常工作，学一项技能，先做好它，或许我们就会爱上它。"
		},
		{
			"post_id": 44,
			"title": "Mathematics",
			"date_published": 1499175046.388,
			"body": "我们最宝贵的财富是自己的注意力，《通往财富自由之路》教我们通过比较或者说选择，来呵护我们的注意力，让我们实现注意力使用的自由。\n\n* * *\n\n注意力>时间>金钱，注意力的自由，让我们能够确保在对自己重要事情上的投入，进而带来更好的产出，最终实现时间或金钱的自由。\n\n在长期的目标上，可以用”什么更重要？什么最重要？“这把”刀“来把握住方向。从终极一生到10年、5年，再到当下，不断地用这把”刀“ 来帮助自己将不利于实现目标的障碍都砍掉，从而自己能进一步看清通往目的地的路。\n\n在日常学习、工作、生活当中，一个技能的学习，一段时间的安排，一项工作的处理，都可以用这把”刀“来抓住其中的关键，找到最短最关键路径，从而更有效更有质量地完成相应计划，让自己在实现长期目标的路上走得更坚实。\n\n非常期待专栏下一步的探讨，我需要结合自己的实际情况，不断地向自己提问，总结形成更多的在面对不同情形的”套路“。"
		},
		{
			"post_id": 43,
			"title": "How will you measure your life?",
			"date_published": 1499000972.923,
			"body": "[你要如何衡量你的人生？](http://caisixiang.com/how-will-you-measure-your-life/)\n\n更有意义的终极问题，一直认为是：\n人为（wei四声）什么活着？\n或者说：\n人活着是为了什么？\n\n* * *\n\n这是要求自己至少在每个年中、年末时拷问自己的问题。\n我活着是为了什么？\n中学时看到《苏菲的世界》后，一直痴迷“我是谁？”以及“世界从哪里来？“。人到中年，年少的问题仍然是谜，觉得仍然值得自己探索的谜。只是也渐渐知道，人生只此一辈子，无论如何努力，也就这一辈子。\n儿子小时候，陪他看蚂蚁，忙忙碌碌、进进出出地，扔一小粒饭就立即来一大堆蚂蚁，齐心协力运回去。突然想到自己，为了一张嘴，不也是一样？面对时间、面对历史，何尝不是蚂蚁？少时的问题不期而至，”我是谁？“、“我为什么活着？”，加上之前身体健康、性格开朗的父亲因车祸突然离我们而去，当夜竟彻夜未眠。\n就这一辈子，我为什么活着？\n思来想去，买了不少书，在互联网上搜索答案，最后决心：努力成为自己想成为的样子。\n自己想成为什么样子呢？\n\n读书时羡慕古时君子：读万卷书、行万里路。那就读书、行路。作为一个偏远小镇上国企员工，来回要坐近6个小时车去城里买书，每月要求自己都去一次。买书读书过程中，竟然得知可以有出国工作的机会，通过找人推荐和笔试，竟然得到了去非洲苏丹的机会。在苏丹一呆三年四个月，这一次的“行万里路”，认识到自己的狭窄。非洲的同事认为：你来我们国家打工，是因为你们国家穷。将家里的照片给他们看，竟然有点将信将疑。\n\n非洲之行，让自己明白，不是自己想成为什么样子，而且自己必须活成什么样子，或许可能因为自己活成的样子，让这个世界变得更好一点点。\n\n或许因为自己的努力，可以让更多的人活成他们想活成的样子。\n\n这也是非洲之行后，当有机会选择北京工作时，毅然选择北京奋斗，而没有回自己舒适安逸的家乡的缘由。\n\n就这一辈子，我为什么活着？\n\n到北京后看书方便多了，视野更加开阔，看到了GTD方面的书，竟然遇到了“和时间做朋友”、“做最好的自己”，让自己的行动拥有了思想基础和实践指南。为什么活着的问题似乎已经不是问题。\n\n一直幸福地生活着，直到，七年就是一辈子。\n\n虽然笑来在专栏一直不让大家谢谢他，但在这里我还是要说：谢谢！\n\n谢谢你让我明白自己可以活很多辈子，看到了自己更多的可能。更多的活成样子的可能，达成想活成样子的更多方法。\n\n我活着是为了什么？成为一个新的问题，但它不再困扰自己，而是成为一个方向。\n\n指引着我，告诉我：继续成长，耐心成长。\n\n今天感触较多，竟然写了这些，期待和战友们多多交流。"
		},
		{
			"post_id": 42,
			"title": "Keep growth",
			"date_published": 1498916819.174,
			"body": "一个没有音频的专栏，竟然是我每篇必读、反复读，留言次数和文字最多的，而且计划长期连续留言的。\n\n* * *\n\n主要原因是：在这里收获了许多“不知道自己不知道”到”知道了自己不知道“的转变，让我知道了许多概念后还指出了变不知道为知道，而后不断成长的方向。\n\n每天留言，倒逼自己加深对文章的理解；看战友们留言，体会文章理解的各个角度。这哪里是一个人每天阅读的孤单，这分明是一群挣扎成长的人的狂欢！“\n\n有人说“一个人走得快，一群人走得远”，一段时间过后，这群人早已经将无数人抛在身后，同样的时间，更远的距离，更高的价值，正如今天文章中所说“间接延长了自己的寿命”。\n\n经过近一年的学习，自己突然感觉很多方面“开窍”了，头脑中有正确的“概念”真的很重要，期待笑来多给大家更新一些概念和方法论，自己下来还是要反复阅读专栏之前的文章，巩固这些概念的认识。\n\n什么是财富自由？\n\n最宝贵的财富是什么？\n\n付费就是捡便宜\n\n活在当下VS活在未来\n\n万能钥匙\n\n……\n\n个人商业模式\n\n不管怎么样，有了这些概念，自己清楚的知道：回不去了！抓住了自己生活的重心，掌控自己的感觉真好。\n\n今天是2017下半年的第一天，持续留言，持续成长。\n\n相信复利的力量！"
		},
		{
			"post_id": 41,
			"title": "The most important",
			"date_published": 1498829010.832,
			"body": "这里不会断，因为我会关注零网的变化，期待能发现新的机遇。所以同学们欢迎继续留种关注。我的文章每天都会在自己的博客“[小财神的奋斗](http://caisixiang.com)”上更新。毕竟公网是主战场，且我CMA7月底考试后，会在写微信公众号“财思享”，无法连接至零网的。所以也欢迎大家关注我的公众号哟。\n\n因为白天一直忙碌，虽然知道晚上在专栏留言不会上精选了，但为了践行自己“每日留言”的承诺，还是在专栏后写下自己的收获。\n\n* * *\n\n这一周的阅读与思考，让自己头脑中拥有了“最高级的个人商业模式”的概念。知道了自己不知道，这就是收获。下来需要经常不断地算自己的时间买卖账，让这个概念真正的来指导自己的生活，从而从中收益。\n\n综合三种形式个人商业模式，自己要坚决地避免“**一份时间出售一次**”，要确保“**同一份时间出售很多次**”，挣扎地实践“**购买他人的时间之后再卖出去**”，最终的目标是让自己实现时间上的自由。\n\n时刻算账。通过不算问自己“什么更重要？”，“什么最重要？”，来算自己的时间买卖账，让自己始终盯住长期目标，将注意力放在成长上。”付费就是捡便宜“，通过付费来呵护自己的注意力，让自己的注意力得到集中，从而更好地实现更有质量的产出。"
		},
		{
			"post_id": 40,
			"title": "Win-win-strategy",
			"date_published": 1498664053.814,
			"body": "文章已经更新，请移步：[http://caisixiang.com/win-win-strategy/](http://caisixiang.com/win-win-strategy/)"
		},
		{
			"post_id": 39,
			"title": "Real reckoning",
			"date_published": 1498572137.668,
			"body": "个人商业模式升级的根本就是能算得清时间买卖的账。\n财务专业毕业的我自觉很会算账，回头看来很多时候都是如笑来说的“算小账”，没有能从更长的时间上“算大账”，即：算成长账，算注意力账。\n\n* * *\n\n在专栏学习后，知道要经常问自己：“什么最重要？什么更重要？”这些问题，时刻关注自己的注意力是否花费在最重要方面，但一天下来，发现自己并不能真正做到。现有通过记时间手账来慢慢控制自己的注意力消耗，发现自己的问题，算好注意力的投入与产出账， 逐步真正用好自己的注意力，让自己的注意力投资到更有价值的事情上去。\n\n今天老师的提醒：“我们买别人的时间，并不是为了自己什么都不做，而是为了我们用这部分省下的时间来创造更多的价值。”，这个非常重要，对自己也是点醒，这个问题发现自己还是经常存在的，如坐专车尽和专车司机聊天了，买了别人的时间，但自己并没有利用这段时间去为自己创造价值。今后可以听课、听书、阅读或者哪怕休息一下，让自己这一段买来的时间至少别亏本。\n\n成为一个主动的时间买卖人，清楚自己时间的收支比，让自己真正精明起来，是下步的目标。"
		},
		{
			"post_id": 38,
			"title": "The best business model",
			"date_published": 1498482701.686,
			"body": "订阅专栏近一年，通过订阅专栏后概念的更新，进而行动的改变，已经成长为一个新的物种，并且还将一直进化下去。这一年的变化，让身边很多人都特别惊讶，原来一个人的成长可以这么快！很开心。\n\n* * *\n\n说实话，专栏很多概念自己这么多年摸爬滚打过程都有所体会， 但在阅读专栏过程中，每次的更新都给我新的思考，使自己头脑中的概念更加清晰。\n\n成长是我们每个人永恒的刚需。所有概念更新、知识学习、思考行动，都是为了自己的成长。\n\n一年来对我影响最大的概念就是”付费就是捡便宜“！\n\n我们最宝贵的财富是”注意力“，注意力>时间>金钱，用钱可以换到我们宝贵的注意力，只有自己想通这个道理后，才会发现自己占了多大的便宜。\n\n说一个自己亲身经历吧。\n\n由于儿子上学原因，我租住在北京金融街附近的一个老旧小区。小区没有足够的停车位，回来晚点铁定是没有位置的；停在外面路边，则一边禁停，一边是收费的车位，而且收费的价格是至少2元/小时。由于车辆的众多和车位的严重缺乏，而且觉得停车费太贵 ，大家都找学校周边的小街道或直接停在路边。搬家过来后，我也有样学样，和大家一起玩起了现实版的抢车位游戏。每天如此，运气极好转一圈就有位置，5分钟搞定；运气不佳，转上两圈花上30分钟还没位置；如果运气爆棚，还会发现车上被贴条，没有一个月，我的车就幸运地被贴一次。被贴条还都算好的。一次车限行时停在路边，被警察叔叔拖走了，前后各种努力，花了7个多小时才将车取回。不想付费停车，于是付出了平均每天至少30分钟的时间去抢车位，付出了更多的时间去解决停车路边出现的问题（如常见的车被刮擦、贴条和拖走），每天考虑如何停车，无奈地花了无数的注意力在这方面。\n\n《通往财富自由之路》栏目“付费就是捡便宜”这个概念的一周学习，我开始找寻那些能通过付费而获取时间和注意力的事情。开始不断琢磨：\n\n> 凡是能用钱买来的时间就是便宜的；凡是能用时间换来的注意力持续就是有价值的。\n\n第一个想到的就是停车，这个自己因不愿付费而花费自己大量时间和注意力的事情。\n\n我从那天起，至今都记得，2016年8月9日，回家后直接将车停在路边画好的停车位上。路边的收费员过来，问清我是小区的住户，得知我第二天一早上班就走，收了我10元钱，并在我收起倒车镜时告诉我：不需要收的，这边都有人看着，肯定不会碰到的，放心吧。\n\n从此以后，下班停车的事不再困扰我，到小区就停车位，熄车交费回家，5分钟搞定。原来感觉和媳妇、儿子一起的时间少，现在时间充裕多了，竟然可以全家一起在空气好的时侯出去锻炼一下，可以全家一起慢慢地享受晚餐，还有时间自己读书、学习，生活竟然变得慢了……\n\n花10元钱，买自己30分钟的生命，而且是每天都可以，我先乐一会儿……\n\n停车付费一事，让我们全家尝到了甜头，于是全家开始了：占便宜行动。手机和PAD上的APP，总是出现烦人广告的，付费！电脑软件跳广告的，付费！视频网站弹广告的，付费！印象笔记、网盘，付费！学习课程，付费！\n\n会员、正版、付费，成了全家开始“占便宜 ”的目标；对于不需要付费的东东，我们也学会去选择，因为我们知道，那些可能是需要我们支付更贵的东西–也就是我们的注意力的。我们的注意力，是应该花在那些对我们来说重要的事情上去的。\n\n实际上，这一切花的那些钱，仅占目前的家庭支出极小的一部分，但却让我们家庭全体收获了太多。何况，专栏中介绍的GAFATA我跟进后，及时买了，现在已经远远超过我付费的这些支出了。我只投了腾讯港股，目前收益率42.8%。\n\n今天的专栏文章告诉我们：**我们自己的时间是有限的，因此购买他人的时间最起码可以突破“时间总量的限制”。一个商业模式的共通之处是“低买高卖”，因此能用钱来换时间的时候尽量用钱换时间，把省下来的时间全都“投资”到自己持续进化上去！**"
		},
		{
			"post_id": 37,
			"title": "Build a better business model",
			"date_published": 1498397789.296,
			"body": "个人商业模式的三个级别：\n\n1.  一份时间出售一次\n2.  同一份时间售出很多次\n3.  购买他人的时间之后再卖出去。\n\n* * *\n\n三种模式可能人人都在用，但绝对大多数人只是无意识地用已。在实现财富自由路上，如何清楚理解这三种模式，找到合适的路径，不断让自己的商业升级到最高阶段，是需要集中精力去解决的问题。\n\n上一周谈到“做精明的时间买卖人”，这周购买他人时间再卖出去，是“一对多”的模式下，升级到“多对多”，即购买他人相对便宜的时间，通过自己的升级改造、重组整合，再将同一份时间售出很多次、很多份。\n\n日常生活中，“付费就是捡便宜”，由于自己的时间更有价值，我们购买别人更便宜的时间，如：订快餐节约做饭的时间，付费停车节约自己找停车位的时间，聘请便宜的助理节约自己打理日常事务的时间等等。当然，做各种生意，其实就是倒卖时间，可以是采购再批发，也可以是批发再零售，目标都是赚取财富吧。\n\n“我们都是卖时间的人”，同时我们也是时间的消费者，重点是消费时间后，能否创造新的价值，让时间更值钱，可以再卖出去，从而在时间买卖中实现财富自由。"
		},
		{
			"post_id": 36,
			"title": "Become better with each passing day",
			"date_published": 1498314741.654,
			"body": "今天是周六，又是收获满满的一天。听CMA串讲课，听晚上天天用英语的分享，阅读得到中订阅的专栏文章，和老婆、儿子开心的交流，这些都让自己感受到自己的成长。\n\n* * *\n\n今天按照之前的计划阅读思考了之前本周的留言，感受自己一周来的思考变化，盘点收获并计划下步行动，让自己保持持续的成长。\n\n**今日留言：**\n\n周六的公布获奖名单的文章也是非常值得看。\n\n不是为了看自己是否中奖，而是名单前面的内容依然很有启发性。这周主题是如何做精明的时间买卖人。我们去满足需求，无论是“以为的刚需”还是“真正的刚需”，需要我们不断发现身边的刚需，然后通过自己的努力去满足它，在满足它的过程中实现我们自己的真正的刚需--个人商业模式的升级，实现财富自由、个人成长。\n\n在发现刚需的过程中，要防止“睁眼瞎”。今天文章中说的“每个人都需要鼓励”，就是一个现在普遍的“睁眼瞎”例子。无论他人，还是自己，都刚需“被鼓励”，我们都忽视掉了。从今天起，不仅仅是不抱怨，而且保持鼓励身边人，鼓励自己，让生活变得更积极起来。或许，这也是让我们发现其他被“睁眼瞎”刚需的途径。\n\n另外一个，关于如何在文章后留言，连续5天的留言我都是在手机上手写或语音留言后，再备份到印象笔记整理的。由于自己普通话原因，语音识别效率不是特别高；手写输入也不够快。\n\n发现转换思路，在PC版印象笔记上写完留言，同步到手机上去，然后复制到文章后，感觉效率提升很多。\n\n手机输入不快的朋友们可以试试。印象笔记、有道云笔记等能够PC、手机同步的软件都可以尝试，看个人喜好了。\n\n**思考和行动：**\n\n突然发现每天可写的内容很多，下步思考如何结合每日留言来[调整博客](http://caisixiang.com)的栏目安排或者专门标签。要在持续留言的基础上，逼自己有更多的输出，促进成长的速度。\n\n本周专栏让我重新认识了“精明的时间买卖”。所有人都在出售自己的时间，获得更高学历、学习更多技能，是为了提高单位时间售价。想成为精明的“时间买卖人”，就要学会把“同一份时间出售许多次”，使用“产品思维”去考虑，满足“消费者的刚需”，即便是“消费者以为的刚需”。\n\n结合自己的情况，可以按如下方法进行“个人商业模式”的升级：\n\n1、**提高单位时间售价。**[即打造个人核心竞争力，提高下面方面的能力](http://caisixiang.com/whatever-we-do-is-the-demand-of-the-public/)：\n\n**专业领域的技能。**目前CMA的考试并向公司同仁讲课就是打磨自己这方面的技能，需要持续做。\n\n**跨领域的技能。**计划通过提高英语、写作和PPT制作能力来提高自己跨领域的技能，其他技能等CMA考试后再行增加。\n\n**学习能力，持续的学习能力。**应该说自己这一点是做到的，而且保持得很好，继续保持。但需要注意进一步提高自己的学习能力，如阅读这方面专门的书籍，学习订阅的得到专栏。\n\n**2、同一份时间出售许多次。**思考自己身边人的刚需，甚至以为的刚需。\n\n[之前计划](http://caisixiang.com/what-do-you-study-for/)通过微信社群、公众号和微课等多种方式，先向财务同仁、机关管理团队，再到海外管理团队，最后到所有海外员工，分制度、分业务等不同主题来总结分享相应知识内容。讲是最好的学，通过给大家讲，和大家沟通，让自己所学得以想清楚、说明白，将知识变得更有活力，进而或许会更有生命力。\n\n这些就是针对他们刚需采取的行动，下一步还要进一步思考琢磨，看看还有什么更大范围的我可以满足的刚需。\n\n当然，发现其他未被满足的刚需，自己可以积极去做，不能受现有情况局限。\n\n同时需要注意的是，一定要对自己的前途有信心，甚至盲目笃信：我的未来会越来越好！\n\n如果咱自己都不相信自己，还能指望别人相信我们吗？\n\n未来不远，未来已经到来！"
		},
		{
			"post_id": 35,
			"title": "I would be a smart businessman",
			"date_published": 1498227606.936,
			"body": "成为一个精明的商人，精明的时间买卖人，是我的通往财富自由之路上GET的又一技能。\n\n* * *\n\n这一周重新认识了“精明的时间买卖”，明白了如何采取行动来成为一个精明的时间买卖人，需要结合自己的现有情况进行系统思考，不再等待，立即投入到个人商业模式的升级中去。\n\n贵祥留言：\n\n这周重新认识了精明的时间买卖。财富自由之前，我们每个人都在出售自己的时间，我们学习更多技能就是为了提高自己单位时间的售价。这一周专栏引导我们思考：如何实现个人商业模式的升级？思考成为一个将同一时间售出很多次的“精明的时间来的人”。\n\n如何实现“把同一份时间出售很多次，越多次越好”，笑来老师用自己的例子告诉我们，除了写书之外，还有其他一切极度依赖创意的内容和产品，可能成本极为低廉，受众极为广泛。只有人制造这类东西的人，最终才能实现个人商业模式的升级。\n\n如何能够找到这类东西，文章进一步提供给大家一个可行的思路，就是做老师，把自己所学的知识传授给别人，一方面可以多次出售，更重要的是可以倒逼自己得到提升。\n\n就个人而言，理解并运用老师说的方法去提升自己，重要的是：\n\n**行动起来！！**"
		},
		{
			"post_id": 34,
			"title": "Self-encouragement",
			"date_published": 1498141120.783,
			"body": "今天在专栏第四天连续留言，严格按昨天的既定方案在执行，逐渐养成习惯，相信会不断成长。\n\n* * *\n\n今天的主题是在个人商业模式升级过程中的自我激励，笑来提醒：别急着给自己泼冷水。这个世界对我们的打击已经够多了，为什么我们自己还要加入进去呢？关于留言方面：\n\n> 希望你的留言能够体现自己的思考，因为只有真正有价值的东西，才会被战友们看到并真正接受。\n\n**贵祥留言：**\n\n“心灵鸡汤”从长期来看，必须是刚需，更重要的是需要自己为自己熬制的专属鸡汤。\n\n我们必须相信：我们肯定有美好的前程！这一点甚至应该盲目相信！正如文中所说“对你的打击还不够多吗？为什么要让自己也加入进去呢？”\n\n个人商业模式升级，本就不是一蹴而就，更需要我们不断前行，不断鼓励自己、推动自己去向自己的目标前进。\n\n通过输出倒逼输入，是个好的学习方法。在文后的留言，正是倒逼自己去更好的理会当日的文章，竟然以前没有认识到，回首专栏竟然一年己过大半，感慨！好在终于走上了正确的路。\n\n这是贵祥连续留言的第四天，一起思考、一起成长。\n\n**思考与行动：**\n\n今天的留言在公交车上写的，没有更深的思考，也没有更好地站在“别人的刚需”角度，主要还是写了自己的感受。今后这方面应加以调整，更深入地思考。\n\n今天围绕自己的成长目标，听了CMA串讲课，打印了真题；听了一本书《每天最重要的两小时》；英语听课文一小时。"
		},
		{
			"post_id": 33,
			"title": "Whatever we do is the demand of the public",
			"date_published": 1498054271.492,
			"body": "请允许我骄傲地说一下：我的留言连续三天上《通往财富自由之路》专栏的精选留言了。开心！\n\n关于留言昨天也说过，笑来老师可能是出于鼓励大家的目的让更多的留言者上墙，但我本人来说，不管上不上，都将连续留言，想通过留言见证自己的成长。\n\n* * *\n\n**今后自己会严格按下面的节奏来做好这项自我认识提升的行动：**\n\n1.早晨：阅读思考并留言。\n\n2.中午：锻炼身体后再次看文章，并看文章后的留言，思考自己的留言，根据情况来决定是否再次留言。\n\n3.晚上：将全天留言汇总思考，在博客上形成博文。注意将每步改进都记录下来。\n\n4.每周六：总结一周来的留言，形成汇总文字。\n\n**学习摘要：**\n\n> 每个人做事的时候，都需要一种自我驱动力 ，不然很容易就会半途而废。\n> \n> 如何让自己保持动力，如何让自己不轻易放弃，我在之前的文章中提到过一个方法：\n> \n> 给这件事情赋予重大的意义，甚至多重重大的意义 。\n> \n> 一个需求也许在我的眼里没有那么重要，至少不是最重要的，但是这并不妨碍它成为别人的刚需，或者说“以为的刚需”。这个时候，我选择去满足这个需求，那我需要给它赋予什么样的意义呢？\n> \n> 第一，有需求就会有供给，而我看到市面上大部分的供给都不够好。我如果能够提供更好的产品，其实是帮助大家节省了不少的时间和精力。\n> \n> 第二，有些需求只有满足之后，你才会关注其他更重要的部分。与其劝说一个人背单词不重要，不如直接拿出一套不错的解决方案，帮他迈过单词这个门槛。等到他真正搞定了单词之后，才会注意到原来真正重要的是其他方面。\n> \n> 最后，满足了大众的刚需能够让我尽快实现财富自由。而不为了金钱而出卖时间之后，我能做的事情明显会多很多，而且能够帮助到更多的人，这也是很重要的一个“重大意义”。\n> \n> 拿股票投资来说，其实这本来是一种非常好的投资模式，你把自己的钱投给优秀的企业，本质上就是雇用了顶尖的企业为你打工，是产生“睡后收入”的很好的方法。\n> \n> 但是如果你观察周围绝大多数的人是如何操作的，就会知道股票对他们来说，往往是最差的一种投资途径。因为他们事前不做功课，盲目选择股票，买入了之后又不停地查看波动，然后频繁交易。最终导致的结果通常是在牛市里也赚不到钱 。\n> \n> 所以说，我们在关注个人商业模式的时候，一定要仅仅抓住一个问题：\n> \n> 我的单位时间到底卖出了多少钱 ？\n> \n> 而单位时间的总价可以用“单价”乘以“份数”来计算。在单价上你能提高多少？在份数上你能想到什么方法？把这些问题一层层分析完之后，自然就会知道自己该如何选择未来成长的方向了。\n> \n> 把自己所学的知识传授给别人，其实是对于个人商业模式的双重升级过程。\n> \n> 一方面，你可以把传授的知识通过写文章，录视频等方式传播出去，只要选择的领域是大众的刚需，而且产品也足够优秀的话，就能够极大程度解决财务上的问题。\n> \n> 另一方面，即便你暂时没有办法拿出这样的作品，你的个人能力也会在这样倒逼输出的过程中，获得极大的提升。即便你还停留在第一种模式下，这样的方法也会对你增加自己的价值有很大的帮助。\n> \n> 所以有时候，用更高的标准去要求自己其实没什么不好的。虽然压力大了一些，但是做完之后就会发现，哪怕没有完成既定的目标，我们也能够成长不少。\n\n**贵祥留言：**\n\n“别人以为的刚需”和“自己以为的别人的刚需”是有巨大差异的，要注意区分到这一点，从而找到自己需要关注、可以发展个人商业模式的方面。\n\n思考了一下自己的身边，的确也存在这些方面。自己一直以为，那些别人应该知道的，却是大家一直想知道的，涉及到自己专业的问题。今后我将从他人的需要出发，看看可以将哪些专业知识以简单的方式给别人传达清楚，让别人有收获。\n\n通过给别人讲授自己专业相关的“别人以为刚需”，让自己对专业有更多的了解，提高自己的专业水平，倒逼实现个人成长。\n\n**思考和行动：**\n\n实现个人成长，打造个人核心竞争力，是我的刚需。从哪些方面来做呢？\n\n1.专业领域的技能。目前CMA的考试并向公司同仁讲课就是打磨自己这方面的技能，需要持续做。\n\n2.跨领域的技能。计划通过提高英语、写作和PPT制作能力来提高自己跨领域的技能，其他技能等CMA考试后再行增加。\n\n3.学习能力，持续的学习能力。应该说自己这一点是做到的，而且保持得很好，继续保持。但需要注意进一步提高自己的学习能力，如阅读这方面专门的书籍，学习订阅的得到专栏。\n\n充实的一天，晚安。"
		},
		{
			"post_id": 32,
			"title": "Encourage everyone",
			"date_published": 1497967602.409,
			"body": "从上周在《通往财富自由之路》留言被列精选后，很少在专栏留言的我连续两天留言都入了精选。阅读思考其他留言后发现自己的留言仍然有许多需要再提高的方面，估计笑来是出于鼓励留言而选择的，无比感谢。\n\n* * *\n\n作为一个立志于终身成长者，不停地学习新知，这是常态，但学习之后的行动，其实才是更重要的。上周末决定从现在起每天留言，并将留言贴到博客，让时间来见证自已的成长。\n\n今天学习了《升级个人商业模式的一个捷径》，其中提供的给我们集中注意力的方法是：\n\n> 我们做每件事之前，都要首先明确一个问题：\n> \n> 我做这件事的目的是什么 ？\n> \n> 这其实就是我们建立标准和规则的一个过程。没有判断的依据，在之后的选择过程中你将遇到各种各样的困难。这就像那句话一样，**对于一艘没有目标的船来说，任何风都是逆风。**\n> \n> 我们的终极目的，是为了能够让自己的时间卖出更多份。而之所以选择刚需，就是为了让更多人去购买我们的这份时间。所以我们追求的目标应该是“刚需×数量”的最大化。\n\n贵祥留言：\n\n终生学习的年代，我们终生是学生。同时我们可以终生做老师，用教来促进我们的学。虽然叫帮助了别人，但更重要的是会让我们对我们所学的东西有更深刻的理解。从这一点上来说是利人利己的。\n\n但是要注意不能好为人师，而是要通过学习通过提高自己，成为那个配得上的人。\n\n做事情之前始终问自己：什么更重要？什么最重要？使自己保持正确的方向，紧紧围绕自己长期目标。\n\n最近发现专栏文章后的评论也非常值得去学习去思考，说实话之前自己没怎么注意，经过几天的仔细阅读和思考，发现评论结合文章的内容有更多的启发性。\n\n有战友真好。\n\n思考和行动：\n\n1.自己今后做任何事时，多问问自己上面的问题，将这些问题写在便签纸贴在电脑上，可以时刻看到从而提醒自己。\n\n2.思考自己的个人商业模式。这两天考虑网课模式，还要进一步去完善，可以充分调动大家的积极性和智慧，实现共同成长。"
		},
		{
			"post_id": 31,
			"title": "What do you study for？",
			"date_published": 1497878847.628,
			"body": "学习是为了什么？\n\n今天下午其实写了一篇3000字左右的学习反思，总结了一年多来自己对于学习的态度和行动上的彻底改变，进而得到了许多意想不到的收获。由于涉及许多公司数据，不在博客上公开了。\n\n* * *\n\n通过持续的、终身的学习，实现终身成长，这是我的基本价值观。成长是我们永恒的刚需，而学习是实现这一刚需的唯一途径。学习学习方法，提高学习能力，让自己更有效率，更加有成果。学习各种理论，使头脑中有更多正确的概念，让自己能活得更明白。通过学习，明白前进的方向，不迷茫不退却，沿着自己的向往前进。\n\n自己学习的同时，带动身边团队学习，从而更加巩固自己的学习成果。下来计划通过微信社群、公众号和微课等多种方式，先向财务同仁、机关管理团队，再到海外管理团队，最后到所有海外员工，分制度、分业务等不同主题来总结分享相应知识内容。讲是最好的学，通过给大家讲，和大家沟通，让自己所学得以想清楚、说明白，将知识变得更有活力，进而或许会更有生命力。\n\n不管如何，加强学习，围绕目标持续长期学习，这需要自己的坚守。对于能否实现最初的目标，或许，旅途比结果更重要。"
		},
		{
			"post_id": 30,
			"title": "Father",
			"date_published": 1497793336.596,
			"body": "今天是父亲节，我却无法对父亲说声：节日快乐。\n\n* * *\n\n父亲去世14个年头了，每每看到或听到父亲相关的内容时，我总是莫名感伤。好渴望父亲还在，哪怕一句话都不说、不理睬我，甚至有时想哪怕父亲跳出来骂我打我一顿。\n\n生活中遇到有人不去陪伴父母的时候，总觉得好遗憾，生活中还有其他比这更重要的事吗？\n\n世事无常，生命无常，谁也不知道各自的生命会什么时间结束，相逢即是缘分，何况父母子女一场，请珍惜。\n\n龙应台《目送》中说：\n\n> 我慢慢地、慢慢地了解到，所谓父女母子一场，只不过意味着，你和他的缘分就是今生今世不断地在目送他的背影渐行渐远。你站立在小路的这一端，看着他逐渐消失在小路转弯的地方，而且，他用背影告诉你：不必追。\n\n明白了这仅有的一场关系，或许要好好调整一下自己和父母，以及自己和子女的态度，做让父母感到温暖的子女，做让子女感到温暖的父母。\n\n值此父亲节，怀念那总给我带来温暖的父亲，也立志做一个让儿子感到温暖的父亲。\n\n我会加油的，爸！"
		},
		{
			"post_id": 29,
			"title": "Stay with me",
			"date_published": 1497708495.246,
			"body": "今天大姑一家和小姑几个人来京，陪伴了一天，现在非常累，洗了个澡，仍然没有恢复多少。可能是因为今天天气太热，陪他们逛了天安门和故宫，下午在北海公园划船游览了一个小时，晚上全部集中到老舍茶馆吃北京菜，发现大家都很疲惫，就很快都回来休息了。\n\n虽然身体累，但心情很愉快。家人们在一起，其实玩不玩不重要，关键是一起聊聊天，互相关心了解一下情况，交流人生很多方面事情各自看法，心又更近了很多。这种相互陪伴，也是人生的意义吧。\n\n早点休息了，为了不断更，仅仅写一下今天的感受，情感加油，继续朝更好的自己努力。"
		},
		{
			"post_id": 28,
			"title": "Look for the key",
			"date_published": 1497618438.759,
			"body": "日常遇到问题，学会把自己的注意力从问题本身移开，解决方案就在那其他地方。\n\n* * *\n\n要抓住成长的契机。生活总是起起伏伏，遇到问题和困难，坚定地去接受、承担，同时积极去找寻那钥匙，将一次次看起来的坎，改变成继续进步的垫脚石，在越来越高的基础上，实现我们渴望的成长。\n\n“绿灯思维”给自己更多的可能。要抓住成长的机会，需要我们面对不同环境时，开启自己的“绿灯思维”。首先肯定出现的现状的合理性，必须主动找几个理由来告诉自己这种合理性，让自己能不抱怨、不激动地平静面对出现的状况，从而可以更好地找到解决问题的方法。\n\n抓住关键，动起来。找到了方法，还要立刻行动起来，只要抓住关键：让自己利用这个机会得到成长，动起来就有机会实现。想法变成现实，路径唯有那一步步坚实的、不松懈的行动。即使会有不同的声音，或嘲讽、或悲叹，可不能因此停止我们行动的脚步，要知道这只是因为我们自己远远不够强大、成长度远远不够的缘故，等我们经过行动走过千山万水后，自然会有另一番天地。或许没有鲜花和掌声，但至少我们自己不后悔。\n\n遇到危机，转危为机，抓住机会，创造更多可能，立即动起来，实现自己的成长。待回首，相信都会感谢这一次次锤炼，感谢这一块块垫脚石，送我们越走越高，让我们终于长成自己的样子，一个始终在进步的终身成长者的样子。\n\n文章同步发在外网：[http://caisixiang.com/look-for-the-key/](http://caisixiang.com/look-for-the-key/)"
		},
		{
			"post_id": 27,
			"title": "Sunk Cost",
			"date_published": 1497536160.567,
			"body": "关于福祸，老子云：祸兮，福之所倚，福兮，祸之所伏。老人家告诉我们指福与祸相互依存、互相转化的关系。另一个熟知的成语故事：“塞翁失马，焉知非福”，也是告诉我们面对祸福应有的态度。\n\n昨天遇到了一件比较难的事，也是从业以来遇到的对自己和团队专业的挑战，成功地用绿灯思维调整好了自己，今天带着财务同事们进行反思总结，提出新的改进计划，努力地将一件不好的事变成一件促进我们成长的好事。"
		},
		{
			"post_id": 26,
			"title": "READ and WRITE",
			"date_published": 1497448100.887,
			"body": "读和写，生来就是一对孪生兄弟。有可靠的、一定数量的阅读输入，才可能有一些写作输出。今天的阅读让自己有很多思考，计划都将作为自己主题阅读的内容，让自己在这些方面有系统的输出。\n\n* * *\n\n**主题一：像经营公司一样经营自己**\n\n我们已经被卷入一个“一个人就是一家公司”的时代，需要像经营公司一样经营我们自己。我们需要具备这样四种能力：\n\n*   > 产品能力：把自己的能力封装成产品，打造成品牌的能力。\n\n*   > 战略能力：战略就是取舍，就是对终局的判断力。\n\n*   > 营销能力：成为行走的广告牌，把自己的能力卖出去的能力。\n\n*   > 运营能力：自我管理、持续学习的能力。保持创造力的能力。\n\n**主题二：执行力**\n\n不论遇到什么不尽人意的事情，不要抱怨，要主动去想是否有更好的办法，然后行动起来。\n\n对着自己的目标，我们需要的是只争朝夕地行动起来。\n\n**主题三：写作**\n\n如何锻炼写作能力？要给自己先定一个小目标，这个小目标就是：用简单的白话文将一件小事说清楚。写作的起手式是：\n\n-每一自然段的第一句话都必须是这一段的中心思想。\n\n-每一段的几个论据之间必须有逻辑关系。\n\n-上一段和下一段的第一句话之间，必须要有逻辑关系。不管是递进，还是转折；不管是并列，还是对比，必须要有一个清晰的逻辑关系。\n\n近期将围绕这些主题进行思考和写作，对包括写作自己如何学习写作的。\n\n习作会在我的博客《**[小财神的奋斗](http://caisixiang.com)**》上发布，并选择一部分在我的财思享微信公众号上发布。期待朋友们多多交流，多提竟见。\n\n我知道，这方面我是个残疾，目前写得不好，我会努力让自己成长的。"
		},
		{
			"post_id": 25,
			"title": "How to increase the probability of success",
			"date_published": 1497364431.733,
			"body": "如何提高成功的可能性？这是大家都非常渴望知道的一个问题.\n\n其实，无论是中国古代先贤，还是国外的智者们，都反复在给我们讲述同一个道理。做对取得成功可能性更大的事，是提高成功可能的根本途径。\n\n* * *\n\n古语有云：但行好事，莫问前程。可以浅显地理解为教人向善，只做好事，前程自然会好，更为重要的是告诉我们：始终坚持做更有利于成功的事情，成功自然不会太远。\n\n查理.芒格在谈我们中国人的问题时，认为我们相信运气。他认为应该相信概率而不是运气，好赌其实是一种缺陷。要做到：相信概率，不要相信运气。这和咱们中国的老话恰恰是一致的。我们坚持做概率大的有利于成功的事情，自然会有更好的可能。\n\n虽然做了概率大的好事，仍然有可能不成功；但是可以肯定的是，不做概率大的事，那成功的概率更低，更可能不成功。人工智能AlphaGo在围棋赛中打败了人类顶尖棋手，最重要的一点是，因为它掌握了一种概率算法，它在下每一步棋的时候，始终计算在当前局面下的赢棋概率，然后按大概率赢的下法去走。阿老师在围棋教了我们很多匪这或许就是我们人类要向人工智能学习的方面，坚持按概率做事。\n\n这个道理也是告诉我们，制订了各种目标，就要始终围绕着实现目标概率更大的事情去做。相信这对我们每个人都有指导意义。\n\n关于概率与我们的生活的关联，还有很多值得思考的方面，下一步继续学习体会。"
		},
		{
			"post_id": 24,
			"title": "Make hard things simple",
			"date_published": 1497277298.96,
			"body": "今天在得到听到罗胖介绍埃隆·马斯克的火星殖民计划的任务分解，感到非常的震憾。其中中的每一个计划听起来都特别的科幻。但是，在埃隆·马斯克的拆解后，却感觉到没有我们想象的那么遥不可及。只要拆成具体的步骤，一点一点地想办法，还是有实现的可能的。\n\n* * *\n\n这就是强大的工作能力吧。罗胖曾经说过，所谓工作能力，本质上就是把一个大目标，分解成小任务的能力。判断一个人的工作能力，其实很简单。不是他的学历有多高，本事有多大。而是遇到一个大难题，他的第一反应不是有畏难情绪和抱怨情绪，是不管这个难题有多大，第一反应要分解问题，把大难题变成小难题，或者是马上就可以做的动作。\n\n结合到我们的生活之中，这种化繁为简的能力也是非常值得我们学习。有一个目标，不等待不退缩，踏踏实实地拆解成一个个可以执行的行动，这样目标的实现会更有可能吧。\n\n就如何分解目标，目标管理概念之一----**SMART原则**可以帮助我们解决问题。 无论是确定团队的目标，还是我们个人的目标，无论是大项目的目标，还是小任务的目标，都不妨用一用SMART原则。Smart这个词是什么意思，敏捷的，灵活地，善于整合，要完成工作目标，将会更为灵活，更为快速。\n\n**所谓SMART原则，即：**\n\n1\\. 目标必须是具体的（Specific）\n\n2\\. 目标必须是可以衡量的（Measurable）\n\n3\\. 目标必须是可以达到的（Attainable）\n\n4\\. 目标必须和其他目标具有相关性（Relevant）\n\n5\\. 目标必须具有明确的截止期限（Time-based）\n\n详细的应用介绍网络上到处都是，下来我要根据这一原则对自己的几个目标都进行详细的分解，从而让这些目标的实际成为可能。"
		},
		{
			"post_id": 23,
			"title": "Make Flash Cards",
			"date_published": 1497192616.989,
			"body": "学习总是让人感到快乐，这种积极的力量也让自己感到更加幸福。瞄准自己确立的方向前进，每天的哪怕点滴努力都会越来越接近目标。\n\n* * *\n\n今天全力复习CMAP2知识，做了第五章一节的习题，正确率极低，认识到距离真正的掌握还有不小的差距。在昨天用ANKI记忆单词的基础上，今天边复习边整理P2第一章财务报表分析的内容，形成纸卡片6张，很有成就感。既方便了今后的随时记忆，又复习了一遍，感觉记得很快，明天用习题验证，同时需要注意不定期的拿出来巩固。\n\n随着自己学习内容的丰富，进一步提升学习能力也是刻不容缓的。改善目标是：提升学习效率。即用同样的时间实现更好的效果。以教促学、多途径学等都是好方法，自己要通过各种方法来实践。\n\n以教促学方面。在学习过程中，就思考知识点如何给他人讲授清楚，就是切换到老师模式来理解书本。目前在白纸上画思维导图来梳理全书内容，一步一步地给自己讲授所学到的知识点。下步计划在小鹅通上开直播，将其中的知识点制作成相应的专题，给大家讲授。在自己学习的同时带领大家学习，在教大家的同时巩固自己的理解，一举两得。\n\n多途径学习方面。阅读教材、听老师视频、整理讲义、做习题，更重要的是总结重练错题。目前利用ANKI和纸卡片整理知识点，先整理重点内容，然后再扩大到全部知识点，日常公共交通、等待会议、电梯停留等时间都可以拿出使用。对于需要记忆的重点内容，下来自己录成音频，在每天锻炼时或开车时可以听听。\n\n相信通过这些方面的努力，会让自己全面理解掌握管理会计师中的财务决策知识，顺便将考试通过了。\n\n继续加油。"
		},
		{
			"post_id": 22,
			"title": "On the right track ",
			"date_published": 1497103895,
			"body": "今天周六，室外天气燥热。白天全家除了我一早出去买菜，都没有出门，猫在家中。傍晚全家锻炼身体，去了南礼士公园和月坛公司，走了近两个小时的路，非常凉快，感觉棒极了。\n\n* * *\n\nCMA学习在顺利进行中，目前就是怎么让自己更熟练完成练习题了，没有其他办法，就是看讲义、整笔记、做习题了，继续加油，7月底肯定通过了。\n\n英语学习今天和儿子一起听了知乎关于语法的LIVE，收获不错，下步计划再听两遍，关键还是要自己边学边用边思考，才会将知识真正变成自己的。另外，开始用ANKI背诵高频词汇，计划下来用它来整理CMA的学习要点和日常收集的内容。\n\n今天在京东订了纸卡片，用来进行CMA要点整理、日常素材收集和单词背诵，希望能通过自己的摸索，让儿子也体会到使用的好处。\n\n由于周一汇报需要，昨天晚上到现在，还要抽出精力关注材料准备情况，刚才还发现有需要补充的资料，严惩影响了注意力，要思考今后怎么改进。\n\n明天要抓住重点，安排好自己的注意力使用，将有效的财富用在重要的事情上。"
		},
		{
			"post_id": 21,
			"title": "You play,you pay",
			"date_published": 1497018372.118,
			"body": "**出来混，迟早要还的。**\n\n多么痛的领悟！特别是在多年后才明白这个道理，好在多年后自己终于明白这个道理。\n\n* * *\n\n今天在ZeroMe上发状态说早起读书时，一个肯定比我小得多的网友说：\n\n> 你真他妈的有钱有闲，清早起来就读书，不用上班的啊\n\n不是他话语的直白，而是这触动起了我之前对于读书及学习的思考。\n\n今天自己的许多努力，正是在还以前那些没有抓紧提高自己的债。无论生活中的得失如何，都是我们过去时间如何花费的结果。\n\n由于之前的生活不注意健康，后来身体不好或者要花大量的时间去提高自己的健康水平；由于之前的学习不够刻苦，后来错过机会或者要花大量的时间去提高自己的文化层次；由于之前的工作不够细致，后来没有升职或者要花大量的时间去弥补自己的过失......\n\n相信每个人都可以用“由于之前.....,后来....或者要花大量的时间......”造出自己“Pay for Play”的例子吧。\n\n好在可以通过自我反思，调整自己的思维，让自己了解到自己长处与不足，然后能立即行动起来。通过过改变自己现在时间的使用，来慢慢地积累出一个我们自己期待的未来。\n\n未来的自己，不需要为现在的耗费来买单。将注意力立即投资到自己的长期目标上，虽然不一定就一定能达到目标，但相差应不会太远。"
		},
		{
			"post_id": 20,
			"title": "Study or not",
			"date_published": 1496931197.072,
			"body": "提到学习，几乎所有的人都肯定学习的重要和必要，认为是好事。可是，有多少人做了这件好事呢？\n\n当然，不光是学习，还有锻炼身体、早点睡觉、多读点书、不要生气......,太多了。\n\n知道，还要做到。做不到，知道又有什么用呢？\n\n* * *\n\n月初时在得到APP栏目“每天听本书”买了VIP，现在可以听到很好优秀的图书的解读，真是非常开心和有收获。其中听了有机会的一些书，也买了其纸质书，开始进行一定精读，也在印象笔记中写一个小的体会，有了更多的输入，输出自然多了起来，计划未来将这些体会都整理出来，发表在自己的微信公众号上。\n\n现在学习方面，最重要的是今年的目标CMA学习，P1阶段已经于四月份通过了，现在正在进行P2阶段的学习，这周日计划完成全书的第一遍学习。虽然自己感觉不错，但是思想上不能疏忽，行动上必须保证每天都进行相应的练习和整理，让自己在7月底顺利通过考试。其他方面的计划都必须为此让路。\n\n英语天天用，天天用英语，从元旦到现在，自己是完全做到了，无意中发现自己在阅读方面还是有不小进步，原来有一定难度的英文书，现在感觉没那么难了。每天除CMA学习外，保证英语的使用时间，让自己不断积累英语方面的能力。\n\n还有22天半年就过去了，时间过得很快也很充实，继续前进，目标更好的自己。"
		},
		{
			"post_id": 19,
			"title": " The secret of success ",
			"date_published": 1496846211.047,
			"body": "这几天由于工作汇报会准备，各方面工作推进都比较紧，处于相对紧张的状态。工作任务多时，基础工作质量的水平就显得非常重要了。随着人工智能的发展，财务机器人的已经实现了真实工作场景的应用，机器人工作的效率和质量都将对现有财务人员带来更多冲击，转型要求越来越迫切了。\n\n* * *\n\n转型为管理会计，最为基本的是就是能写好**一份财务分析**，而好的财务分析的标准是什么呢？不是数据罗列，也不是什么观点主张，**根本原则应是“决策有用”。**那些无关于决策而充字数的描述说明，浪费纸张，更是浪费使用者的生命，不要也罢。“决策有用”，无外乎“**反映清楚，分析明白，观点有针对性**”。这就对财务人员提出更高的要求，既懂财务，又懂业务，还要能表达清楚，而这样的人在当下并不多见，这也是每个对自己有要求的财务人员的一次难得的机会吧。经过今天和财务同仁们交流，就将这个主题作为近期的一个重点，计划通过写文章和直播的方式和大家交流一下。\n\n古语有云：但行好事，莫问前程。其实，这就是我们做事做人的成功的秘密啊。我们始终做那些有助于自己目标的事，做那些对自己成功帮助更大的事，自然会有更大的概率获得想要的收获。\n\n坚持坚定做自己已经确定正确的事，让自己走在通往财富自由的路上，这是自己要每天去自省和贯彻的，加油。"
		},
		{
			"post_id": 18,
			"title": "The cycle repeats itself",
			"date_published": 1496758299.682,
			"body": "昨天的忙碌让自己的CMA学习有些耽误，内心有些焦灼，进而在家庭生活中处理和儿子、媳妇沟通上耐心不够，更重要的是影响了自己的注意力使用，恰好今天笑来在专栏中讲到周期，愕然发现----是不是我也处于一定压力周期之中。好在自己明白要面对真实的自我，及时进行调整，终于晚上满血复活，竟然学习状态大幅提高了。\n\n* * *\n\n长期地投资于自己，让自己成长，从容地去面对生活中的起起伏伏，把握 住关键即可，**无论周期如何，不断成长，即使是底部，也可能是过去时间里仰望不到的顶峰。**\n\n这两天在京东活动时，又购进了几本在得到APP中听过电子解释的新书，这两周安排时间全部读完。自己最近连续每天写总结思考，深刻的体会到，**当天输入越多、思考越深入，晚上的文章就越容易写，**这或许也是大牛们爱读书而又写得一手好的文章的秘诀吧。\n\n晚上听了关于区域链的讲座，突然发现讲述的内容和之前看的几本书的联系，多读书多思考，才会产生更多的联结，进而产生更多的火花，加深自己已有知识的感悟。\n\n保持现有的好的习惯，关注自己的大节点，持续成长。"
		},
		{
			"post_id": 17,
			"title": "How to grow together",
			"date_published": 1496672022.268,
			"body": "今天是星期一，由于公司准备工作汇报，财务分析是其中重要的一部分，但上周已经改了两遍，上班发现仍然很糟糕，需要反思一下自己的管理了。\n\n* * *\n\n这两年公司的氛围越发不同，自己放松了对下面财务人员学习的要求。觉得学习是每个人自己的事，别人不愿意学习，我凭什么去要求他人呢？由他去吧，每个人对自己的生命、对自己的时间负责，每个人浪费的只是他自己。但是，近期很多工作出现问题，思来想去，都是业务人员不学习的结果。\n\n如何能够既抓紧自己的时间，保持个人成长，又能够让身边的团队有所提高呢？或许，将我目前所学的CMA知识给大学去讲授，让自己对CMA的知识有更清楚的了解，同时又实现对财务团队的培训，这应该是一举两得的事情吧。"
		},
		{
			"post_id": 16,
			"title": "Lifelong growth",
			"date_published": 1496585911,
			"body": "今天晚上陪儿子一起讨论了目前学习主科的预习、笔记、复习和改错，计划期末前的一个月每天都关注一下儿子的学习情况，让儿子的学习方法得到调整，真正走上让自己轻松学习的轨道。\n\n除了具体讲学习事项，还给儿子介绍了自己这一年来的学习收获，特别是学习能力提高方面的成果。其实，**最简单的一点就是：将自己从学生转成老师的角度！对，学习时就考虑自己下来如何给他人讲明白目前所学习的内容。**在自己学习CMA和其他方面利用这个方法，我能够更清晰地了解所学知识的体系，多去思考文字背后的逻辑等等，实战效果非常好。\n\n* * *\n\n过去，由于自己学习并从事的会计专业，不断调整变化的法律法规和财务准则，逼得对自己有些专业要求的我不断学习，无意中形成了终生学习的观念。经过一年多的阅读、学习和思考，充分认识到自己原来终生学习理念的不足。原来的终生学习，只是要求自己及时地根据专业变化进行学习，而现在终于明白，这样的学习是远远不够的。说到底，这样的学习还是被动的、应付的。\n\n真正能够让自己提高的学习，应该是自己的主动出击。当然主动出击要和自己的愿景目标结合起来，更好地服务于自己的未来。思想的转变，给自己带来了巨大的空间和新的激情。制订自己新一辈子“成为更专业管理会计师”目标，立即投入行动，虽然真正行动不到一年时间，但已经取得了很好的成果，离目标近了很多。三个月的复习，通过了MBA联考并被录取；4月通过了CMAP1阶段考试；目前在备考CMAP2的7月考试，非常有信心通过。更重要的成果是，自己的学习感觉开挂了，学习新识总是很轻松，相信自己通过不断提高，会成长为更为强大的自己的。\n\n从现在起，通过学习，持续迭代，让自己成为一个终生成长者。"
		},
		{
			"post_id": 15,
			"title": "Slowly come faster",
			"date_published": 1496499486.795,
			"body": "慢慢来，比较快。\n\n这是近年学习过程中的一个收获，也是今天和儿子一起学习时交流的主题。\n\n很多时候，我们或许是急于成功、害怕落后他人，遇到事情就急急忙忙地往前赶，完全忽略了中途的风景，到头来却是“竹篮打水一场空”。\n\n* * *\n\n大到如何度过一生、如何教育子女，小到日常学习、工作点滴，莫不如是。\n\n时钟滴答，不停向前，我们追逐着生活，蓦然回首却已经老去。自己如此，面对自己的孩子，害怕其输在起跑线上，报上种种课外班，使其直接跑步进入少年、青年、中年.....然后一直生活在后悔之中。\n\n日常学习，也是不停地向前赶，期待有好的结果，可是，由于没有沉稳的步伐，没有打好基础，收获的只能是苦果。\n\n工作之中，常见不同年龄层次的人接到任务就干，简单思考快速进展，效果却常怡笑大方。写一篇文章，语句不通顺，错别字、标点错误连篇，完全不知道在写什么。\n\n很多人，连“一字不拉地阅读”一篇500字的文章都做不到！\n\n人就这一辈子，赶着、追着，或许只是早已腐朽多年、晚埋一些而已。\n\n或许可以让自己慢下来，享受活着的每一天、让孩子自由生长、只字不差地读读文章，生命的风景相信会更美好。\n\n梁静茹的《[慢慢来比较快](http://music.baidu.com/song/5440941)》值得回味。"
		},
		{
			"post_id": 14,
			"title": "Learn how to learn and then start learning",
			"date_published": 1496397820.091,
			"body": "这周重新认识了“学习能力”，了解到学习能力的三个阶段区分，明白了学习的重要方法：面对“学习”这件事的时候，不能仅仅满足于“学会”，而是要**在学习的过程中始终想着“未来要将它教给其他人”**，通过改变学习目标来提高学习的效率和效果。\n\n* * *\n\n更重要的是，要努力让自己过渡到学习的第三个阶段，即“能学会没有人能教授的技能......”，笑来给的可行的路径是：\n\n> 确定自己有强烈的欲望搞定这个技能；\n> \n> 寻找最少必要知识，反复问自己：这事儿最关键的地方在哪里？\n> \n> 马上开始运用、马上开始践行；\n> \n> 相信自己一定能够学会，相信自己一定会通过践行而进步；\n> \n> 通过记录，量化自己的刻意练习进程；\n> \n> 不断总结，不断整理，不断让那些新技能、新概念，在自己的脑子里有清晰的组织与关联；\n> \n> 绝对不能跟笨蛋斗气，要珍惜自己的时间与生命……\n\n这条路径只能说现在自己**知道**了，要通过对目前学习情况的梳理，明确自己如何**做到**的方法。这个作为自己周末和下周的思考主题。\n\n今天是自己坚持“三件事”打卡新的100天的开始，通过每天梳理最重要的三件事和一个小确幸，让自己的注意力更加集中在自己的长期目标、集中在那些重要的事情上，的确非常有效果，继续严格按既定的方针做，做更好的自己。"
		},
		{
			"post_id": 13,
			"title": "You are what you love",
			"date_published": 1496320191.365,
			"body": "今天在Zeronet上的时间，严格按照昨天的计划，明天继续遵照执行。\n\n由于家里这两天进行网络切换，这一篇记录是通过手机写的，算是不让自己断更吧。\n\n之前曾说过：我们的现在是自己过去时间花费的结果，我们的未来取决于我们现在的时间花费；我们对时间的态度，决定着我们的一切。\n\n* * *\n\n其实，准确的说法应是：我们的注意力在哪里，我们的未来就在哪里。用好我们有限的注意力，是让我们取得更大收获的关键。我们的注意力现在都花在哪里呢？又应该花在哪里呢？需要我们自己去不断总结和提高，记录自己注意力消耗日志或许是一个好的方法。今天自己翻看这一年多的记录，非常感慨，有很多的注意力被自己白白浪费了！在无关自己长期目标的事情上，在一些即时反馈、短时满足的事情上，自己浪费了不少注意力。好在坚持记录，常常反思，让自己没有离目标太远，从而现在在自己的长期目标上还是有不小的进步，而这些进步也让自己突然感觉到更多的激情。\n\n今天做财务管理分析，根据公司业务遍及全球近40个国家的情况，就从同类型企业中选了一家国际公司对标分析。由于自己坚持每天用英语和学习CMA管理知识，经过搜索在其公司网站（英文）上找到相关财务报告，顺利地阅读使用了报告数据。同时发现，身边相关人员在我告知后竟然找不到、看不懂，何谈去分析应用呢？\n\n不积跬步，无以致千里。有时我们需要让自己先动起来，管理好自己的注意力，围绕着让自己有激情的事情，一步步去走，每天哪怕只是进步一点点，日积月累，有一天会感受到可怕的变化的。\n\n继续努力，致挣扎着成长的自己，加油！"
		},
		{
			"post_id": 12,
			"title": "ZeroNet have my attention",
			"date_published": 1496237970.997,
			"body": "晚上回来才发现，今天在Zeronet上投入的注意力有些太多了。回头再看接触到Zeronet的这一周，和当初接触网络一样，迷上了。没有具体的时间统计，但可以肯定的是，这会影响到我个人的长期目标的实现，从明天开始要好好地调整。\n\n* * *\n\n关于Zeronet的前景，可能是由于是门外汉，没有看到什么很好的机会。现在其中的博客和交流其实在公网上都能实现，那我们为什么还需要去中心化的Zeronet呢？肯定不是要目前上面很多的一些阴暗负面的东东吧，相信什么时候那也不会是主流。从2015年Zeronet产生至今天，目前用户不到一万，其主站的连接数也就1000左右，前途在哪里？或许这是大家一直在找寻的吧。对于新事物，积极去拥抱它，这肯定是没有坏处的，但还是需要自己去更多的补充自己这方面的专业知识，除了听李笑来在一块听听上将开的公开课外，计划再阅读这方面书籍，期待有更多火花出现。\n\n自己的长期目标已经确定，而注意力是有限的，虽然每天早点五点半起床学习CMA课程一小时，但在英语和其他方面投入是不够的，需要对自己的注意力进行分配。**基本原则是：优先满足长期目标，适度投入近期新知。**如Zeronet上的内容可以中午休息时、晚上在家时各花15分钟到半小时处理。当然，晚上写日记这个时间属于并行处理了，必须保证。_Zeronet是个新的领域，允许自己“乱打乱撞”一阵子，先看看会有什么样的机遇和挑战，其“最重要的事”是什么？然后自己再去有重点地征服吧。_\n\n今天得到中，李翔提到了一本英文书《获得智慧：如何像成功人士一样思考》。书里指出:\n\n> **成功者的两种思维方式：长期思维和缓慢思维。** 长期思维指的是未来导向。 哈佛大学一项有关经济流动性的研究表明，时间观很重要。处在最低社会经济水平的阶层，时间观通常只有几个小时甚至几分钟，比如酗酒的人只考虑下一杯喝多少。在最高层次，那些第二代或者第三代富人，他们的时间观是未来几年、几十年，甚至几代人。 成功的人是强烈的未来导向， 他们大部分时间都会考虑未来。作者建议，多考虑你的决定和行动的后果，可能会发生什么，之后又会发生什么，然后还会如何？以此练习自律和自我控制。 缓慢思维的意思是说，你要知道这个决定是需要快速思考，还是缓慢思考。 比如，买牙膏是个可以快速做出的决定，但如果进行投资就要慎重考虑。\n\n自己在分配自己注意力的过程中，就是要应用长期思维和缓慢思维两种方式，让自己的注意力发挥更大的更长久的效用。"
		},
		{
			"post_id": 11,
			"title": "Nice day",
			"date_published": 1496149227.429,
			"body": "感觉用英语的文章名在地址栏中显示更舒服些，呵呵。\n\n今天又是美好的一天，节日放假，自己可以完全自主地安排个人时间，一天下来又学习了不少东西。\n\n“[Serendipity](http://dict.youdao.com/search?q=serendipity)”这个英文单词，我第一次从笑来的文章中听说，没想到现在可以自由准确拼写和理解，这本身就是“惊喜”吧。《通往财富自由之路》本周话题就是“**学习，从来都是创造惊喜、创造好运的最优路径**”，今天教我们的是“创造好运”的方法-那就是学习。**通过学习，反复打磨我们头脑中的概念和方法论，惊喜就会注定地发生。**而这一方法，也是我们普通人实现成长的唯一可行的路径吧。\n\n* * *\n\n将健康、家庭和个人成长真正的放在首位，这些是不惑之年的我通过学习后才调整过来，并确定地落实到行动上的。现在的自己，知道自己有缺点，相信通过不断的学习，会让自己不断成长。或许这才是真正活明白了。这是学习带来的最大收获吧。\n\n今天学习了CMAP2财务决策中第四章风险管理的一部分，了解到从内控管理到风险管理的变迁。突发奇想，虽然过去的90年代初，单位没有互联网，自己并没有及时了解到内控方面的知识，走了不少弯路，但根本还是由于英语学习不够。现在，要不断学习和使用好英语，让自己一方面关注最新的财务管理动态，保持学习和思考；另一方面，可以研究感兴趣的财务共享或管理共享的主题，让自己的知识不断产生各种链接，创造出更多惊喜来。\n\n通过这一年多的持续学习，清晰地感受到了自己学习能力的提高。除了刚才说的CMA的学习，更重要是就是能更好管理自己的注意力了。将注意力放在自己的身上，的确能给自己更多的改变。现在家里，和儿子的交流更加顺畅，这是自己将注意力自己身上的实践，并期待通过自己的改变和影响，让儿子也有更多的自我觉醒，那样的小伙，相信会更有活力吧。\n\n保持学习，多问自己**“什么更重要？什么最重要？”**，让自己的注意力始终聚集到自己身上，每天都会是美好的一天！"
		},
		{
			"post_id": 10,
			"title": "总有一款适合我",
			"date_published": 1496064968.074,
			"body": "突然发现，零网上的站点非常多样，虽然感觉没有太多高质量的内容，好好搜索下，总会有一款适合我，这或许就是去中心化的优势吧。\n\n* * *\n\n今天CMA学习听了两课，感觉很有收获，下来需要通过习题来巩固了。\n\n零网的博客今天主要是加链接和调整一些细节了，自己慢慢摸索，期待自己能探索出零网的新路。\n\n零网的世界很杂，这或许是我们真实世界的客观反映吧，我们作为个体，做自己想做的吧！\n\n今天和友人出去吃鱼，非常开心，云南的铜锅鱼不错，以后可以继续去。\n\n今天全家都非常开心 ，是近期幸福指数较高的一天，人生不过如此！就这一辈子，Enjoy!\n\n得到APP中，今天看了笑来的文章，笑来给了大家一个外挂，真是没想到！"
		},
		{
			"post_id": 9,
			"title": "折腾的一天",
			"date_published": 1495979564.581,
			"body": "什么情况，写了快完成了，到浏览器另一个标签页找一下资料，竟然全部丢失了，奇怪！下来是要我及时保存吗？\n\n今天上午更改了博客LOGO，增加了链接和归档；意外开心的是，申请的免费域名竟然成功了，十分感谢 @domains4free 帮注册 guixiang.bit。现在已经绑定在本博客，大家可以通过 [http://127.0.0.1:43110/guixiang.bit](http://127.0.0.1:43110/guixiang.bit)访问了。\n\n* * *\n\n今天的CMA学习，听了两节课，学习了关于定价策略事宜，由于家里空间原因，易受干扰，感觉效果不是非常好，下来自己要注意调整。\n\n今天读书方面，继续看了成甲的《好好学习》，琢磨其中的黄金思维法则，同时听了得到APP中西蒙·斯涅克《从“为什么”开始》的有声书，其因发现“黄金圈法则”而成名。他在 TEDx 上的演讲“[伟大的领袖如何激励行动](西蒙·斯涅克)”，是 TED 大会被观看最多的视频的第 7 名。\n\n> 什么是黄金圈法则？\n> \n> 这是一种思维模式，它把思考和认识问题画成三个圈：最外面的圈层是 What 层，也就是做什么，指的是事情的表象；中间的圈层是 How 层面，也就是怎么做，是实现目标的途径；最里边的圈层是 Why 层面，就是为什么做一件事。\n> \n> 绝大多数人的思考、行动和交流的方式，都是在最外面的 What 圈层，也就是从做什么的圈层开始。\n> \n> 黄金圈法则的思考顺序是“从内向外”，也就是按 Why—How—What 的顺序思考。\n\n多学习，多思考，掌握更多的临界知识，让自己一天天成长。"
		},
		{
			"post_id": 8,
			"title": "注册使用guixiang.bit",
			"date_published": 1495967529.018,
			"body": "非常开心，按照论坛上的攻略试着联系了免费域名提供者domains4free，竟然在今天收到回复，已经帮忙注册成功了，感动！\n\n欢迎大家今后用域名访问我的博客啊。[http://127.0.0.1:43110/guixiang.bit](http://127.0.0.1:43110/guixiang.bit)\n\n在绑定了域名后，发现博客代码升级提示，随即升级了，但~~发现LOGO变成原来的图~~（已经调整），~~而且之前大家的留言也不见了~~，(重新留言一条，测试后恢复)奇怪。\n\n继续学习调整吧。欢迎大家多多指点！"
		},
		{
			"post_id": 7,
			"title": "归档",
			"date_published": 1495965263.044,
			"body": "手工按发布时间倒序归档，可能有延迟，呵呵\n\n* * *\n\n[Learn how to learn and then start learning](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:14:Learn+how+to+learn+and+then+start+learning)\n\n[You are what you love](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:13:You+are+what+you+love)\n\n[ZeroNet have my attention](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:12:ZeroNet+have+my+attention)\n\n[Nice day](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:11:Nice+day)\n\n[总有一款适合我](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:10:%E6%80%BB%E6%9C%89%E4%B8%80%E6%AC%BE%E9%80%82%E5%90%88%E6%88%91)\n\n[折腾的一天](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:9:%E6%8A%98%E8%85%BE%E7%9A%84%E4%B8%80%E5%A4%A9)\n\n​​​​​​​[注册使用guixiang.bit](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:8:%E6%B3%A8%E5%86%8C%E4%BD%BF%E7%94%A8guixiang.bit)\n\n[一个新想法](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:5:%E4%B8%80%E4%B8%AA%E6%96%B0%E6%83%B3%E6%B3%95)\n\n[持续迭代，做终生成长者](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:4:%E6%8C%81%E7%BB%AD%E8%BF%AD%E4%BB%A3%EF%BC%8C%E5%81%9A%E7%BB%88%E7%94%9F%E6%88%90%E9%95%BF%E8%80%85)\n\n[上次觉得来不及是什么时间？](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:3:%E4%B8%8A%E6%AC%A1%E8%A7%89%E5%BE%97%E6%9D%A5%E4%B8%8D%E5%8F%8A%E6%98%AF%E4%BB%80%E4%B9%88%E6%97%B6%E9%97%B4%EF%BC%9F)\n\n[据说这是“永不消失的电波”](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:2:%E6%8D%AE%E8%AF%B4%E8%BF%99%E6%98%AF%E2%80%9C%E6%B0%B8%E4%B8%8D%E6%B6%88%E5%A4%B1%E7%9A%84%E7%94%B5%E6%B3%A2%E2%80%9D)\n\n[博客更新记录](http://127.0.0.1:43110/18V36iHwsqA1qRTb7HhW8X6oo64rKK9waT/?Post:1:%E5%8D%9A%E5%AE%A2%E6%9B%B4%E6%96%B0%E8%AE%B0%E5%BD%95)"
		},
		{
			"post_id": 6,
			"title": "链接",
			"date_published": 1495965061.611,
			"body": "<span style=\"color: rgb(0, 0, 0); text-transform: none; text-indent: 0px; letter-spacing: normal; font-family: Tinos; font-size: 16px; font-style: normal; font-weight: 300; word-spacing: 0px; float: none; display: inline !important; white-space: normal; orphans: 2; widows: 2; background-color: rgb(255, 255, 255); font-variant-ligatures: normal; font-variant-caps: normal; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">每个 ZeroNet 网站都需要 Peer ，访客越多 Peer 也越多，Peer 多了网站越快，访客体验才会越好。</span>\n\n<span style=\"color: rgb(0, 0, 0); text-transform: none; text-indent: 0px; letter-spacing: normal; font-family: Tinos; font-size: 16px; font-style: normal; font-weight: 300; word-spacing: 0px; float: none; display: inline !important; white-space: normal; orphans: 2; widows: 2; background-color: rgb(255, 255, 255); font-variant-ligatures: normal; font-variant-caps: normal; -webkit-text-stroke-width: 0px; text-decoration-style: initial; text-decoration-color: initial;\">欢迎链接本站，欢迎互链（**仅限 ZeroNet 网站**）。</span>\n\n**请先加好我的博客，谢谢。**\n\n> 博客名：行动派\n> 网址：[http://127.0.0.1:43110/guixiang.bit](http://127.0.0.1:43110/guixiang.bit)\n> 简介：每日更新的终生成长者的行动日志！\n\n* * *\n\n[Shutdown-t](http://127.0.0.1:43110/shutdown-t.bit)：关于网赚等等。\n\n[Shutdown-z](http://127.0.0.1:43110/shutdown-z.bit):国外博客One Mile at a Time上有用的教程机器翻译。\n\n[金融诈骗追踪](http://127.0.0.1:43110/1E88Q8MqNQmbms5bLGe3sek1YxSYUYucZ3/)：跟踪一些金融诈骗案例。\n\n[陈佳的博客](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/?Home)\n\n[The World of Codegass](http://127.0.0.1:43110/1HotJMoS9Z1v8UwDCmv3VDG3q88c5na8cZ/?Home)：少数派少数低产作者。[](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/?Home)"
		},
		{
			"post_id": 5,
			"title": "一个新想法",
			"date_published": 1495893119.289,
			"body": "最近一直在思考：如何更新自己的微信公众号，保持稳定的文章输出，让自己的公众号活跃起来？\n\n现在每天的工作、CMA-P2的学习、每天的用英语，加上每天的读书任务，过得非常充实，总想着能静下心来，好好写些文章，整理自己的思考，然后再分享出去。通过学习笑来和古典两位老师的文章，需要根据自己的实际情况进行一些调整。\n\n**首先，利用行动派进行每天写作。**写作的目的是沟通，自己一直以来定位于帮助更多人拥有财务管理思维，但由于写作少的原因，如何更准确地表达自己的想法，一直是需要提高的方面。解决方案就是继续做自己目前计划的事情，但都进行整理，形成相应笔记，多做一些思考，让自己形成稳定输出的习惯。\n\n* * *\n\n由于现在每天丰富的内容，其实自己可以输出的内容很多，如：\n\nCMA的学习思考及在公司管理中的应用\n\n读书心得\n\n订阅的得到专栏的收获\n\n工作过程中的思考\n\n英语学习的收获\n\n......\n\n通过这些方面的输出尝试，自己探索出适应我个人的写作方式和内容。\n\n**其次，保持微信公众号的稳定更新。**让自己有一个稳定输出的平台，并保持相应的活跃度，更是给自己一个前进的动力和鼓励，对创立自己的个人品牌具有重要的作用。通过微信平台，我要不断展示自己践行“**持续迭代，成为终生成长者**”的成果，通过教大家来让自己思想上想清人生目标，边行动边思考，边思考边调整行动，真正实现自己的成长。\n\n每周自己根据行动派中和印象笔记中 自己整理的内容，进一步梳理出在公众号分享的内容，这样内容的稳定性有了保障，也进而让自己能长期做下去。\n\n明天开始过节了，很开心又有大段的时间做自己爱做的事情了，节日快乐！"
		},
		{
			"post_id": 4,
			"title": "持续迭代，做终生成长者",
			"date_published": 1495781513.986,
			"body": "本周《通往财富自由之路》栏目笑来带我们更新了“做到”的概念。\n\n通过几个月的时间，更新了很多概念，但如果仅仅是每天去阅读知道了这些概念，而没有去思考、行动、反思、改进，自己就无法成长，更不要谈什么迭代了。\n\n成长，就是知道、想到之后，通过学习，去做到！**碰到自己必须要做的事，最有效率的方式就是：做起来！**用行动来带动思考，用思考改进我们的行动，这样才能让我们持续升级。\n\n* * *\n\n订阅这个专栏花了199元，我每天会在上班前在公交车上或早到办公室的时间里完成阅读；白天会花些时间去琢磨琢磨，中午出去锻炼时也拿出来思考；晚上会在印象笔记中记下自己的思考。仅仅从专栏上看到GATAFA的投资策略，经过自己对这个投资策略的思考，立即跟进买了些的腾讯港股，现己盈利40%以上。\n\n可是这点钱的收益和自己思想观念进而行动上的改变比，根本不值一提！\n\n通过将注意力集中到自己身上这一年，家庭更幸福了，自己激发了新的活力，成功考上了MBA，CMA已经过了P1阶段，新一辈子的一年如此美好！\n\n我知道，看了，学了，边思考边行动，未来定会成为更好的自己。"
		},
		{
			"post_id": 3,
			"title": "上次觉得来不及是什么时间？",
			"date_published": 1495703325.659,
			"body": "这是今天笑来文章的标题，客观地面对自己，我常有这样的感受。已经40多了，现在再学习MBA是不是来不及了？腾讯股票开始只买了几百股，现在涨了40%了，是不是来不及了？......\n\n幸运的是，经过一年多的认识升级，自己已经明白了应该如何去面对，明白了让自己今后尽量不再出现这样的情绪？\n\n* * *\n\n现在知道得晚不晚不是关键，重要的是知道后自己的行动，发现了问题，就立即着手去改进。譬如自己现在整体已经能够将注意力集中的自己身上，但每天个别时候还是会有松懈，如何改进呢？今天笑来在文章中提到的“每天定时问自己几次：什么更重要？什么最重要？”是个好方法，立即下载一个定时闹钟，定时提醒自己，让自己即使偶尔注意力转移了也可以很快转回来，让自己始终将注意力放在重要的事情上。\n\n**近期重要事情盘点：**\n\n1、学习CMA考试的第二部分---财务决策，确保7月底通过考试，完成CMA取证，进而进一步梳理个人的管理会计知识体系。\n\n2、着手计划两年的MBA学习，在搭建管理知识体系的同时，对工作中财务共享、海外税务筹划和财务管理事宜展开研究，并形成研究成果。\n\n3、持续的阅读和用英语。"
		},
		{
			"post_id": 2,
			"title": "据说这是“永不消失的电波”",
			"date_published": 1495588483.653,
			"body": "有多少人是通过李笑来的微信公众号“学习学习再学习”了解到Zeronet的呢？\n\n我是！\n\n其实自己需要这样的电台吗？不知道。但可以肯定的是，我需要了解新的知识，跟上这个变化不断的新时代。\n\n**如何跟上时代，让自己保持成长呢？**\n\n只是知道了，没有行动，和不知道又有什么区别呢？\n\n立即行动起来，虽然可能或许是一定会走弯路，正如开车在路上，不怕慢只怕站，动起来，总会离目标越来越近。不是吗？"
		},
		{
			"post_id": 1,
			"title": "博客更新记录",
			"date_published": 1495587379,
			"body": "将第一篇欢迎文章改为自己博客调整的记录，以方便今后查询。\n\n20170529设置了公网访问地址，增加了友链\n\n20170528增加“链接、归档”\n\n20170528 设置了一个LOGO\n\n20170528调整现有文章，设置“Read more”\n\n* * *\n\n具体说明网址：\n\n[http://127.0.0.1:43110/mosen.bit/?Post:5:ZeroBlog+%E6%96%B0%E6%89%8B%E6%8C%87%E5%AF%BC](http://127.0.0.1:43110/mosen.bit/?Post:5:ZeroBlog+%E6%96%B0%E6%89%8B%E6%8C%87%E5%AF%BC)\n\n[在Zeronet注册并绑定.bit域名全攻略](http://127.0.0.1:43110/mcjiffy.bit/?Post:13:%E5%9C%A8Zeronet%E6%B3%A8%E5%86%8C%E5%B9%B6%E7%BB%91%E5%AE%9A.bit%E5%9F%9F%E5%90%8D%E5%85%A8%E6%94%BB%E7%95%A5)"
		}
	]
}