{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1527284773,
			"title": "Botnet is closing in on all sides, Zeronet will be under attack soon.",
			"body": "0chan was OK for a little while but the whole thing is filled with illegal content now. What a shame. Tragedy of the commons.\n\nAt least Elon Musk is doing something about it.",
			"added": 1527284772
		},
		{
			"topic_id": 1565584272,
			"title": "Chans are down!",
			"body": ">4chan down\n>8ch down\n>endchan down\n>other chans down\nGet out your disco balls, people, it's party time!",
			"added": 1565584270
		},
		{
			"topic_id": 1565677270,
			"title": "Argentina just imploded.",
			"body": "Second highest one day stock market loss in history. Finance talk and intelligence thread?",
			"added": 1565677267
		},
		{
			"topic_id": 1566455555,
			"title": "ZweoNet version",
			"body": "I have version 3863 (6.5) but I see no fish just released a much newer version. Is this OK?",
			"added": 1566455551
		},
		{
			"topic_id": 1566980845,
			"title": "I think that Russian accident was more serious than anybody is saying.",
			"body": "My gamma meter is showing activity and I can literally smell the ions, tonight is the first time. Anybody who has been around certain materials knows the smell.",
			"added": 1566980840
		},
		{
			"topic_id": 1567664493,
			"title": "Hurricane Dorian watch thread...",
			"body": "https://www.youtube.com/embed/m93JX62l3i4\n\nApparently half of Abaco's gone, who knows how many killed.",
			"added": 1567664487
		}
	],
	"topic_vote": {
		"1565070314_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1566289473_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"1566980845_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1
	},
	"next_comment_id": 94,
	"comment": {
		"1527176149_1D1DTxbngBSkKe6BfHPyuudBrB8ZapNjoV": [
			{
				"comment_id": 1,
				"body": "Democracy has failed and the idea of equal rights has just been weaponized by communists and other assorted malefactors. In short, you should go back to Reddit if you want to hang with your own kind.",
				"added": 1527284584
			}
		],
		"1527284582_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 2,
				"body": "Great troll, 8/10.",
				"added": 1527284668
			},
			{
				"comment_id": 3,
				"body": "> [nzrcbotnet001](#comment_2_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f): No, we don't fuck around. Go live in your mommy's basement, while the rest of us evolve.\n\nI own my own home, no mortgage or anything. I paid cash.",
				"added": 1527284936
			},
			{
				"comment_id": 4,
				"body": "Who's going to build your robot for you, your mum?\n\nJust saying, your plan isn't terrible but it honestly reads like a troll attempt. What will you do for income to pay back mom or will you just stiff her?",
				"added": 1527285026
			},
			{
				"comment_id": 7,
				"body": "How old are you anyway? Just curious.",
				"added": 1527285234
			},
			{
				"comment_id": 8,
				"body": "Well best of luck, let us all know how it turns out. Good luck getting any good property out of the hands of the Chinese anyway.",
				"added": 1527285421
			}
		],
		"1527202748_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "Talks are back on now, Kim only took a few hours to fold.",
				"added": 1527285123
			}
		],
		"1526166631_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": ">not using Devuan",
				"added": 1527285165
			}
		],
		"1536108085_1PQsn3szA7oEsuHo8soafCHFRZnEKskUDi": [
			{
				"comment_id": 9,
				"body": "Now that people figured out the cock.li scam it's time to try again eh?",
				"added": 1536358873
			}
		],
		"1535890275_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": [
			{
				"comment_id": 10,
				"body": ">using \"smart\" things\nJust shoot the botnet into your veins.",
				"added": 1536359543
			}
		],
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 11,
				"body": "This is great, this censorship was supposed to be rolled out invisibly under Hillary, along with quelling dissent on social media. She was never supposed to lose, now they are having to hurry plans along without executive support.\n\nTwitter and Facebook are finished, both will be declared utilities.",
				"added": 1536436796
			}
		],
		"1533525335_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "This is exactly how you communist Chinese are attacking the US.",
				"added": 1536437200
			}
		],
		"1530777929_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": [
			{
				"comment_id": 13,
				"body": "CCC has bent over backwards to kiss Merkel's ass and support her hare brained schemes and THIS is how she repays them?",
				"added": 1536437573
			}
		],
		"1536467661_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 14,
				"body": "It's spam though.",
				"added": 1536512260
			}
		],
		"1534470841_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer": [
			{
				"comment_id": 15,
				"body": "> [pwnedbymarcus](#comment_6_148qBJuGc35jMvGc2rePkDvYwgdGgCJxKt): You sound like a huge conspiracy theorist. \"every PC and phone since 2011 has a built in HARDWARE backdoor\"? Yeah sure, I very highly doubt that. You also claim that data gets deleted from your PC reguarly, without your knowledge/permission, false. The TOR network was built BY the US government, sure, but they don't control all the exit nodes. ZeroNet isn't fully ready to take over, it still has it's bugs and flaws.\n\nIt's true, and has been news for years now. Intel's Management Engine and AMD's Platform Secure Processor as both perfect hardware backdoors and we now know they've been remotely exploitable since they were put in to computers.\n\nGet with the times grandpa.",
				"added": 1536514257
			}
		],
		"1539742216_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": [
			{
				"comment_id": 16,
				"body": "> [adotham](#comment_1_1P8TFEmsFJruqWErsBLpTxmpczHFW3raWF): The whole crash because Pakistan wanted to censor videos...smh\n\nThat's what they said but I'm not sure if I believe them.",
				"added": 1540561517
			}
		],
		"1555844108_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": [
			{
				"comment_id": 17,
				"body": "(((Merchants))) sell your credit card transaction information to data brokers, who then pool their resources to create broader profiles of you which are then sold to companies and governments around the world.",
				"added": 1556146409
			}
		],
		"1565070314_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 18,
				"body": "So it sounds like they're going directly to the device makers and social media platforms and various communications apps, to get them to put in monitoring capabilities, basically a CALEA for web sites and OS's.",
				"added": 1565076630
			}
		],
		"1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU": [
			{
				"comment_id": 19,
				"body": "http://127.0.0.1:43110/1dPHedr5Tz55tQWxqvsbEXPdc4uCVi9D/ \"8\" is showing up on ZeroSites as 'new' but it doesn't load.",
				"added": 1565077623
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 20,
				"body": "In order to route information to your node it's necessary to have an 'address.' One way around this would be a protocol which sends everything to everybody all the time, and users would rely on somehow parsing this data stream to pick out messages intended for or interesting to them. But the amount of bandwidth would be enormous.",
				"added": 1565375348
			}
		],
		"1565527640_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 21,
				"body": "Buy silver.",
				"added": 1565546983
			},
			{
				"comment_id": 32,
				"body": "> [watteau](#comment_63_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Business news. Verizon Media Group has sold Tumblr to Automattic Inc, the owner of WordPress. Incidentally Tumblr's unique visits per month have shrunk by nearly 40% since 2016; could it be that Automattic will use the purchase to persuade Tumblr's customers to migrate to one of its other brands?\n\nThey paid 1 billion for Tumblr and sold it for 3 million.",
				"added": 1565721743
			},
			{
				"comment_id": 42,
				"body": "> [watteau](#comment_84_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Gold is at a six year high.\n\nGold and silver are going to invert soon. Less silver has been pulled out of the ground since people started liking shiny rocks and it's very rarely recovered from industrial uses, unlike gold which is almost always recycled.\n\nThe only reason that silver is cheap right now is because big banks are suppressing the price, as whistleblowers have recently claimed.",
				"added": 1566276082
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 22,
				"body": "This reminds me of the time the Clinton mansion caught on fire, remember that one?",
				"added": 1565549701
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 23,
				"body": "4 just came back for me too.",
				"added": 1565584707
			},
			{
				"comment_id": 24,
				"body": "> [bigbadbob](#comment_205_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Would be a sad day for humanity if 4chan ever did get axed.  I cannot see it happening.It would signify total censorship... In my opinion\n\nWell it happened already, modern 4chan is completely fake and overridden with chat bots, glowniggers, and a host of angry fags all of whom have permission of the site’s owner (Google) to wreck it as much as possible. Zeronet has a much better future.",
				"added": 1565589683
			},
			{
				"comment_id": 25,
				"body": "> [joalmo](#comment_6_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL): 4chan has never allowed vpn or tor posting, I'm not sure about 8chan\n\nIn the old days there wasn’t a constantly updated list of Tor exit nodes available, so you could refresh your circuit and sometimes get a clear one to post on. Same with VPN’s. These days IIRC the Tor project makes available a list of exit node IP addresses.",
				"added": 1565589822
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 26,
				"body": "> [wejehteman2](#comment_8_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): If someone with a botnet with thousands or tens of thousands of IPs started connecting to everyone and not sharing any data thus making 95% of the peers you are connected to non functional and requesting data and throwing it out there by clogging the few remaining legitimate seeders ability to distribute files to real people... that would be a tough nut to crack.\n\nIt seems obvious that 8ch’s getting knocked offline and the migration of at least part of its user base to Zeronet has caused some parties to step up attacks and I hope weaknesses are exposed and dealt with. It would be nice to be able to use i2p as a back end as well as Tor.",
				"added": 1565590229
			},
			{
				"comment_id": 27,
				"body": "> [toyata](#comment_92_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Isnt there a drawback running Multiple Tor in the same network?\n\nIs there?",
				"added": 1565591677
			}
		],
		"1565427459_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 28,
				"body": "> [gary2018](#comment_7_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C): with the app \"Mycelium Bitcoin Wallet\" android you can buy and sell cryptos in cash in every city. just open the app go to the market place and look if someone in your city or near your city are sell/buy cryptos for cash then contact him over the app\n\nAlso make sure to bring your gun because the other chap(s) might have the wrong idea.",
				"added": 1565593862
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 29,
				"body": "Why do you need a full desktop environment? Just use a window manager.",
				"added": 1565595147
			}
		],
		"1565677270_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 30,
				"body": "If I was you I’d buy gold and silver. It’s also a known fact that they crash the market during election years if they want a party change. Protect your wealth fellow people.",
				"added": 1565677357
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 31,
				"body": "> [wejehteman2](#comment_9_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Whats with having to build zeronet from source? I never used to have to do that. Why no Linux binaries any more?\n\nWhat do you mean binaries? It’s a Python program.",
				"added": 1565678560
			}
		],
		"1565805956_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 33,
				"body": "Google has become a problem.",
				"added": 1565856622
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 34,
				"body": "This is great work, thanks a lot.",
				"added": 1566029307
			}
		],
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 35,
				"body": ">unarmed\nI love how they always mention this as if it somehow excuses the crime.",
				"added": 1566029587
			}
		],
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 36,
				"body": "> [redlibertyreal](#comment_59_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): You won't catch me dead with one of those things. A raspberry pi with a camera running a live feed over a server I control is the only viable option. I do not trust Amazon not to spy on me. I do not trust Amazon not to spy on anyone. I especially do not trust the government not to spy on me or anyone for that matter.\n\nI don’t have a smartphone but I’m sure I’m still incidentally spied on by those owned by others. Recently I went to stay in another town and the VRBO had a Ring.",
				"added": 1566029796
			}
		],
		"1565915969_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 37,
				"body": "It wasn't the flu that killed so many people, it was the fact that the doctors of the day were prescribing 4 aspirin every 4 hours, people ended up bleeding to death internally after a few days straight of this treatment.",
				"added": 1566061866
			}
		],
		"1565819093_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv": [
			{
				"comment_id": 38,
				"body": "I really like Pictures At An Exhibition, I own a half dozen performances of that one.",
				"added": 1566065265
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 39,
				"body": "> The limit for anonymous precious metals purchases has been lowered drastically in almost every EU country\nHm interesting. What is the limit these days?",
				"added": 1566108811
			}
		],
		"1566241449_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 40,
				"body": "It'll be like TrueCrypt where some known good prior version is adopted until somebody forks it and then starts fixing or changing it.\n\nAfter all you're running the source code right on your drive, right now, nobody can take that away from you. Except your mom maybe.",
				"added": 1566247008
			}
		],
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 41,
				"body": "We should be able to choose threaded, chronological, even per-user.",
				"added": 1566253264
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 43,
				"body": "> [watteau](#comment_81_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Twitter closes 936+ accounts created in China to upset Hong Kong's citizens\n\nSo wait, now Twitter’s banning accounts which they deem upsetting? Are HK residents so fragile that they can’t take some Twitter bantz? I thought these people were supposed to be Internet savvy. Anyway it seems like a useless gesture unless Twitter is going to stop new accounts from being created in China or ban Chinese accounts from tweeting at Hong Kongers. Too much of this and Twitter pisses China off and they just cut off Twitter in China AND Hong Kong.",
				"added": 1566280827
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 44,
				"body": "Must have some way to control which images are downloaded and seeded. More than one way ideally. It’s evident that just showing thumbnails is bad mojo. MOAB already banned 08chan as well as 0chan for this.",
				"added": 1566288032
			},
			{
				"comment_id": 45,
				"body": "OK I found the right combination of settings, spoiler thumbnails and always spoiler seems to just give me an icon depicting the file type, and no thumbnail. I’m hoping this means that I’m not downloading the actual thumbnails or images too. Thanks and sorry for my confusion.",
				"added": 1566288365
			},
			{
				"comment_id": 69,
				"body": "Trying to upload a large PDF to /pdfs/ (450 MB or so) and I have this Processing post... message that’s been up for a good while now.",
				"added": 1566889858
			},
			{
				"comment_id": 75,
				"body": "After much whirring and chugging it finally uploaded my file. I guess it just takes a while with large files.",
				"added": 1566896886
			}
		],
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 46,
				"body": "A classical education like Francis Bacon or our founding fathers had was basically the erection of a framework teaching a person how to learn, using the seven liberal arts and sciences. Once you had a basic knowledge of these, plus Latin, Greek, French, and German, you could use books and dictionaries to explore the various avenues of knowledge which interested you. The whole world was open to you.\n\nCompare it with today’s world where history professors at places like Harvard, Yale, Oxford, and so on don’t even need to know Latin or Greek, let alone both.",
				"added": 1566291869
			},
			{
				"comment_id": 48,
				"body": "> [watteau](#comment_88_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): It was a 'thing' recently, a lot of Generation Y turned around in their mid-thirties and realised their jobs were actually pointless.\n\nDon’t worry they have Occupational Therapy now where if you don’t like your job and life some fellow white person will convince you that you wouldn’t be any happier doing anything else so why not stick it out until you drop dead.",
				"added": 1566332782
			}
		],
		"1566256283_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 47,
				"body": "In your own words please describe the difference between rap and trap, without resorting to any sources first.",
				"added": 1566292138
			}
		],
		"1566395604_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 49,
				"body": "Play stupid games, win stupid prizes.",
				"added": 1566410911
			}
		],
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": [
			{
				"comment_id": 50,
				"body": "precious metals > crypto\ncrypto = fiat",
				"added": 1566410971
			}
		],
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 51,
				"body": "Time to start muting users then.\n\nI've noticed it too. It's called poisoning the well but it's not going to be effective here.",
				"added": 1566411128
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 52,
				"body": "44 net just went offline.",
				"added": 1566437349
			},
			{
				"comment_id": 55,
				"body": "Radio hams have had their own TCP/IP networks working over radio for decades. They already inter operate with the Internet. Mesh net will never make it for long haul data transmission.",
				"added": 1566452503
			}
		],
		"1566427613_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 53,
				"body": "Trudeau's taking after his Chinese patrons, if it's a one party system...",
				"added": 1566437422
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 54,
				"body": "Crypto is too fragile to destroy fiat. You’re looking at this the wrong way. What is the point of fiat? It’s to decouple the money creation, lending, and yes even destruction process from resources with value.\n\nTo destroy fiat, institute gold and silver coin. It’s universal, durable, valuable, portable, works without the Internet, and doesn’t require exchanges or third parties.",
				"added": 1566452314
			},
			{
				"comment_id": 56,
				"body": "> [0nullz](#comment_5_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz): How fragile is speech? When you open source code you turn it into speech. Why do you think the first thing nations attack is free speech? Due to it's power.\n\nPassing around complicated little mathematical messages which require a network consensus and a big block chain or whatever is too fragile.\n\nA coin can be mailed or passed on without a word, or a record, or an ISP.",
				"added": 1566452785
			},
			{
				"comment_id": 58,
				"body": "> [0nullz](#comment_6_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz): little mathematical messages? you mean encryption? when nation state militaries abandon the use of it them then we can agree.\n\nBlockchain based crypto is inherently fragile and we’re on the cusp of everything but OTP being obsolete with quantum computing. Perhaps we’re already there.",
				"added": 1566453229
			},
			{
				"comment_id": 60,
				"body": "> [0nullz](#comment_7_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz): without even understanding i\n\nYou’re quick to accuse but I bet I know more than most people. I’ve been programming the IBM Q machine for a year now.",
				"added": 1566454210
			},
			{
				"comment_id": 61,
				"body": "I don’t personally mind if you invest in crypto. I’m just not doing it myself. If you got in early and mines some Btc that’s great, otherwise it’s a very risky investment.",
				"added": 1566454772
			}
		],
		"1550241221_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 57,
				"body": "Neither sender or receiver should have to connect to the Internet to send or receive crypto. This is the weakness of all current crypto currencies.",
				"added": 1566452991
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 59,
				"body": "Puke and vomit are banned?\n\nAnyway everybody stop looking at porn. It’s designed to sap your vital essences.",
				"added": 1566453333
			}
		],
		"1566455555_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 62,
				"body": "Aha thanks.",
				"added": 1566457192
			}
		],
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 63,
				"body": "I de-Googled a while back but plebs with their Android phones are still providing Google with plenty of telemetry on me when I leave the house.",
				"added": 1566623271
			},
			{
				"comment_id": 65,
				"body": "> [funman](#comment_3_12nYWrJ4WfemBx1sC1w3wTUJsX7iSkTv4c): never ever use google - they are NOT your friend, duckduckgo is better for clearnet but I am finding that I use clearnet less and less all the time\n\nThe clear net is just designed to suck marketing data from you. I do almost all my browsing over Tor now, basically I only do online banking and bill pay and shopping in the clear net any more. I don’t even do anything illegal, I just don’t want the weirdos running the tech industry to learn any more about me.",
				"added": 1566625792
			}
		],
		"1566566417_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 64,
				"body": "Fake news can often be just a way to spread a coded message to those who have eyes to see and ears to hear.",
				"added": 1566623524
			}
		],
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 66,
				"body": "I found some extra special berries out on a mountain with my lovely wife.",
				"added": 1566625842
			}
		],
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 67,
				"body": "> [aspidochelone](#comment_147_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The Russian government gave their agents false papers and sent them on a plane with nerve gas to go kill someone in Britain, leading to the poisoning of a policeman who was forced to give up his house and literally everything in it due to potential contamination, and the deaths of other civilians afterward.  If that doesn't get a government listed as a terrorist organization, what will?\n\nNone of that really happened though. Those Novichok attacks were done by Brits right next to their leading secret chem/bio weapons facility. And nobody believed their sob story either.",
				"added": 1566764550
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 68,
				"body": "Earlier this year a whistle blower from Chase Bank came forward to the Feds with evidence that his bank as well as several other large banks had been suppressing the price of silver for almost a decade.",
				"added": 1566846405
			}
		],
		"1566815498_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 70,
				"body": "The stock market is rigged and “political” and other news is often coded to reveal more information than the profane would understand.",
				"added": 1566889988
			}
		],
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 71,
				"body": "Good, I hope YouTube goes all the way and bans milquetoast right wingers next. The more people they drive away from their platform the better. Anyway TRS and Metokur are Mossad ops.",
				"added": 1566890918
			},
			{
				"comment_id": 81,
				"body": "> [memesadler](#comment_106_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Mossad ops don't signal boost Kevin MacDonald and Ryan Dawson.\n\nDid they get shoahed too?",
				"added": 1566981095
			}
		],
		"1566891933_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG": [
			{
				"comment_id": 72,
				"body": "I own my home outright, I pay about $2k a year in property taxes.",
				"added": 1566892887
			},
			{
				"comment_id": 73,
				"body": "> [fuckthegov](#comment_2_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG): why do someone has to pay for something that he/she supposedly owns ?\n\n[M]\n\nGo bait on cuck chan.",
				"added": 1566893768
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 74,
				"body": "I don’t really understand why DNS is even necessary on ZeroNet, once you open a zite it shows up on the ZeroHello sidebar. Can somebody enlighten me about this?",
				"added": 1566893996
			},
			{
				"comment_id": 78,
				"body": "> [gitcenter](#comment_787_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Many of us still type URLs instead of clicking links; [...]\n\nOK, that makes sense. Thanks for your work on your zite, too.",
				"added": 1566929316
			}
		],
		"1566899547_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 76,
				"body": ">grains\n>legumes\nBest be soaking those first, as per Weston Price.",
				"added": 1566899719
			},
			{
				"comment_id": 77,
				"body": "> [holeyhouseofair](#comment_72_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): Phytic acid is reduced by sprouting, you can also mix in raw mushroom into your final food which contains phytase which apparently can help break it down.\n\nIt’s not necessary to sprout, I don’t have any links on me now but one short 20 or 30 minute soak and rinse reduces phytates by a lot, overnight soaking practically to nil. Interesting note with the mushrooms. However I’d be careful eating raw mushrooms, the commercial ones are grown on poop, and no raw mushroom can be digested so they often give severe intestinal distress.",
				"added": 1566900207
			},
			{
				"comment_id": 79,
				"body": "> [cldude](#comment_7_1DV5mvcvwtjyRiQpuNuXv9hwdYj27C3oob): The manure used for commercial mushrooms is pasturized so is safe to eat raw.\n\nIt’s not safe to eat raw after it’s been watered and fermenting for weeks as the mushrooms develop.",
				"added": 1566967042
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 80,
				"body": "We should use US silver dimes, pre-1967. They are anonymous, have intrinsic value, and can be mailed easily.",
				"added": 1566980984
			},
			{
				"comment_id": 82,
				"body": "> [theecollector](#comment_42_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): Everyone is talking about using privacy coins... you know using privacy coins is not really necessary unless you plan on withdrawing your \"illegal\" crypto into fiat... If you just keep your crypto in crypto like we all should be doing anyways since the usd, euro, yen are all going to shit anyways then then any coin is ultimately a privacy as to they are just Letters n Numbers in a line of code. It has not information about you personally...\n\nI don’t trust crypto or the internet service providers. Deep packet inspection is already in widespread use, do you think it’s not being used to figure out who uses crypto? It’s literally just another type of fiat, controlled by whoever mined a shit ton of it at the start of each coin’s boom cycle.\n\nI’m sticking with precious metals.",
				"added": 1566983971
			}
		],
		"1566980845_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 83,
				"body": "> [atomiserxenolith](#comment_126_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Where are you reporting from?\n\nAlaska.\n\n> [xcape2net](#comment_367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Are you talking about the Russian nuclear-powered missile accident?\n\nWell or whatever it was that flubbed on them.",
				"added": 1567002224
			}
		],
		"1567124913_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 84,
				"body": "ZeroTalk seems to be a pretty basic generic site designed to get people up and running by cloning. As you can see there is the ability here to make sub-folders and so on too, look at the 'Chinese Language Topics' folder for instance.",
				"added": 1567127861
			}
		],
		"1567232126_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 85,
				"body": "Fascinating.",
				"added": 1567398136
			}
		],
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 86,
				"body": "You may not like 08 but a federated peer to peer and ideally anonymous infrastructure is what's clearly needed here, and so far 08 seems to be it.",
				"added": 1567580733
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 87,
				"body": "Look I'll do anything to improve my social credit score comrade. Hook me up to the snitching botnet. I want a bigger telescreen and this is one way to get one.",
				"added": 1567580891
			},
			{
				"comment_id": 88,
				"body": "> [bigbadbob](#comment_572_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I have to wonder if snitching would actually improves ones social score.  I doubt snitches earn much respect... Even from those who encourage it.  They might find the info useful and possibly get you a bigger telescreen if its valuable info.  But I doubt it would Improve the social credit score..  maybe even loose a point or two for being a snitch.  I guess it would depend on the info.\n\nOh on the contrary snitching is seen as good by the authorities. In both the USSR and Nazi Germany children were taught to snitch on adults, it was a way to integrate snitch culture with the young generation.",
				"added": 1567647909
			},
			{
				"comment_id": 92,
				"body": "> [bigbadbob](#comment_588_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I can proudly say that zeronet is the closest thing to social media i have ever partaken in:) I was thinking about making a fake twitter account.  It getting ridiculous though.  There is an actual expectation within society to have a facebook.  I've managed to go without one to date, but im actually feeling the heat of not having one.  People just expect you to be online so they can snoop ya. Potential employers.  Literally fall off the face of the earth without one.\n\nSocial media's dead. Nobody uses it any more except for snapchat. I know a teacher and the kids have given up on social media nearly completely. Some still use TikTok but that fad is dying off quicker than it launched.",
				"added": 1567796061
			},
			{
				"comment_id": 93,
				"body": "Https://news.yahoo.com/amphtml/amazons-ring-camera-raises-civil-211456191.html\n\nIn an attempt to move this thread forward in an on-topic direction, Amazon's Ring (Amazon complies with many thousands of law enforcement requests for ring and Alexa data each year) is now being declared to be racist in that it catches a ''disproportionate'' number of minorities engaged in property crime and that's racist because then people put videos of thieves and vandals on Facebook where people are exposed to possibly racially biased footage, or something.\n\nHow can we, as a progressive society, move forward with a possibly racist surveillance state apparatus? I propose teams of AI censors who edit out any racially identifying visual data from surveillance camera footage.",
				"added": 1567796579
			}
		],
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 89,
				"body": "I'm actually pretty impressed with the amount of rare music that people have put on Youtube and the authorities don't seem very eager to take most of it down. You can use youtube-dl to download audio files directly, even whole playlists. The files still have to be id3 tagged, no good way to automate that.\n\nOn the other hand I have more CDs than a person can count, closer to ten thousand than five, and if I like music enough to listen to it twice I usually start looking for a CD or vinyl of it which are both very very cheap used.",
				"added": 1567648173
			},
			{
				"comment_id": 90,
				"body": "> [peerco](#comment_31_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): it can be sure made automated [...]\n\nI've looked into taking the video title with Python and sticking it in the tag but the problem is most videos aren't tagged properly according to my specific mode of autism so I'd have to redo them anyway.",
				"added": 1567650430
			},
			{
				"comment_id": 91,
				"body": "> [peerco](#comment_30_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): attenzione (italiano)YT DL -> YT USER (!!!anon dl via tor does it too!!! perfect tracking of anonymous tor users) [...]\n\nIf you have pop3 / imap on your phone hooked to gmail, Google knows your real ip address at all times anyway even on mobile.",
				"added": 1567650515
			}
		]
	},
	"comment_vote": {}
}