{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1610720324,
			"title": "23 people died of the side effect of American vaccine in Norway?!!!",
			"body": "Chinese health experts called on Norway and other countries to suspend the use of mRNA-based COVID-19 vaccines produced by companies such as Pfizer, especially among elderly people, due to the vaccines' safety uncertainties following the deaths of 23 elderly Norwegian people who received the vaccine. \n\nThe new mRNA vaccine was developed in haste and had never been used on a large scale for the prevention of infectious disease, and its safety had not been confirmed for large-scale use in humans, a Chinese immunologist said. \n\nThe death incidents in Norway also proved that the mRNA COVID-19 vaccines' efficacy was not as good as expected, experts said. ",
			"added": 1610720323
		},
		{
			"topic_id": 1610987594,
			"title": "England super virus was detected in 2020.9 in England, but reported in 2020.12 by England Government, Fuck England!",
			"body": "",
			"added": 1610987592
		},
		{
			"topic_id": 1618323031,
			"title": "Prevent Japan from polluting the sea of all human !\n\nJapan announces decision to dump nuclear wastewater into sea",
			"body": "We should shout loudlly!!! Stop Japan!!!\n\n\nJapanese Prime Minister Yoshihide Suga said on Tuesday that his government has decided to discharge contaminated radioactive wastewater in Fukushima Prefecture into the sea amid domestic and international opposition.\n\nSuga made the announcement after convening a meeting of relevant ministers to formalize plans to release the radioactive water accumulated at the plant into the Pacific Ocean.\n\nThe Fukushima Daiichi nuclear plant has been generating massive amount of radiation-tainted water since the accident triggered by the massive 2011 earthquake and tsunami as it needs water to cool the reactors.\n\nThe plant's operator Tokyo Electric Power Company Holdings Inc. said it will take around two years for the release to start.\n\nThe water, according to reports, has been treated using an advanced liquid processing system (ALPS) to remove most contaminants. However, things like tritium, a radioactive byproduct of nuclear reactors, are hard to filter out.\n\nThe decision comes about three months ahead of the postponed Tokyo Olympic Games, with some events to be held at venues as close as 60 kilometers from the wrecked plant, which has been struggling to store 1.25 million tonnes of contaminated water. The space of the containing tanks is expected to reach capacity next year.\n\nJapan had considered evaporating or storing underground tritium-laced water from the plant as an alternative. However, from the perspective of cost and technical feasibility, the Japanese government decided to dilute the contaminated water and discharge it into the sea.\n\nThe plan not only faces strong opposition from the Japanese fishery industry and the public, but also raises concerns and doubts from neighboring countries about possible negative impact on people's health and fishery businesses.\n\nSouth Korea on Monday voiced \"grave concerns,\" with foreign ministry spokesman Choi Young-sam saying, \"It will be difficult to accept if the Japanese side decides to release the contaminated water from the Fukushima nuclear power plant without sufficient consultations.\"",
			"added": 1618323028
		},
		{
			"topic_id": 1618367645,
			"title": "If we want to eat safe seafood and donot want to get cancer, we must shout loudly for stopping Japan Government from dumping the nuclearwaste into the our sea!!!",
			"body": "If we want to eat safe seafood and donot want to get cancer, we must shout loudly for stopping Japan Government from dumping the nuclearwaste into the our sea!!!",
			"added": 1618367640
		}
	],
	"topic_vote": {
		"1610507385_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1610611550_1ASwoyvUC5DBAECJFQ7WqZVazYdo1HKiDp": 1,
		"1610987594_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": 1,
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1618367645_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1610507385_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": [
			{
				"comment_id": 1,
				"body": "Zeronet can be a big net, if some company host a super zeronet node and provides a UI that everyone can visit it.",
				"added": 1610546379
			}
		],
		"1610611550_1ASwoyvUC5DBAECJFQ7WqZVazYdo1HKiDp": [
			{
				"comment_id": 2,
				"body": "I hope the ZeroTalk can have search bar like this site:\nhttp://127.0.0.1:43110/14Famoc8KJoS5T9WCSbzxGAmA6TfXcdSPD/",
				"added": 1610721081
			}
		],
		"1610987594_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 3,
				"body": "> [tommykakashi](#comment_17_1rYi49f3DNfJntyt2EV3H1xjpVobJMoLz): Blame China.China China China\n\nstupid!",
				"added": 1611058947
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 4,
				"body": "I donnot like british government, because they are liars.",
				"added": 1615524781
			}
		]
	},
	"comment_vote": {
		"2864_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1
	}
}