{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "США отказались от принципа «сетевого нейтралитета»",
			"body": "Федеральная комиссия по коммуникациям одобрила план, смягчающий правила для провайдеров\n\nСША в четверг отменили введенный два года назад принцип «сетевого нейтралитета», гарантировавший равный доступ к Интернету, заменив его на меры, смягчающие ограничения для крупных интернет-провайдеров и дающие им широкие полномочия в определении того, к какому контенту могут получить доступ их клиенты.\nФедеральная комиссия по коммуникациям тремя голосами против двух приняла план, предложенный ее председателем Аджитом Паи, которого на эту должность назначил президент Трамп. План предусматривает смягчение правил для телекоммуникационных компаний и ограничение контроля федерального правительства над интернет-сферой.\n\nНезадолго до голосования заседание было прервано по соображениям безопасности. На видеозаписи из зала, где проводилось заседание, видно, как в помещение вошли двое сотрудников правоохранительных органов с собаками. О причинах перерыва пока не сообщается.\n\nПредложение Паи, вызывающее неоднозначную реакцию в США, отменяет политику «сетевого нейтралитета», которую продвигал экс-президент Барак Обама. Отмена правил, гарантирующих равное отношение ко всем видам трафика, спровоцировало сотни протестов и более миллиона звонков членам Конгресса со стороны противников плана. Некоторые организации потребителей пообещали обжаловать новые правила в суде.\n\nПлан устраняет ограничения, не позволявшие таким крупным провайдерам, как Comcast, Verizon и AT&T, блокировать определенные виды трафика или взимать за них дополнительную плату, и лишает штаты возможности вводить собственные правила.\n\nПо словам Паи, его план позволит устранить ненужные ограничения и позволит большему количеству американцев получить доступ к интернету. Он даст крупным интернет-провайдерам право блокировать приложения конкурентов, замедлять доступ к определенным услугам и ускорять соединение с ресурсами компаний, которые готовы за это платить.\n\n«До 2015 года, когда были введены эти правила, у нас был открытый и свободный интернет, – заявил Паи в интервью NBC перед голосованием. Так будет и в будущем благодаря упрощенным правилам и рыночному подходу. Выиграют и потребители, и предприниматели. Всем участникам интернет-экономики будет лучше при рыночном подходе».\n\nБританский инженер и создатель Всемирной паутины Тим Бернерс-Ли, выступил против изменений американской политики в Интернете. На этой неделе он заявил на онлайн-платформе Medium: «Сетевой нейтралитет – принцип, при котором интернет-провайдеры не отдают предпочтения одним видам трафика перед другими, является фундаментом интернета, каким мы его знаем сегодня».\n\nПо словам Бернерса-Ли, правила Паи позволят провайдерам «решать, к каким сайтам вы можете получить доступ и с какой скоростью они будут загружаться». «Иными словами, они смогут определять, какие компании будут преуспевать в интернете, чьи голоса будут услышаны, а чьи – заглушены».\n\nОднако лоббист крупных телекоммуникационных компаний Джонатан Сполтер, глава торговой группы USTelecom, отмахивается от опасений противников изменений: «Я с нетерпением жду предстоящих недель, месяцев и лет, когда окажется, что ни одно из этих мрачных предсказаний не сбылось».\nИсточник: https://www.golos-ameriki.ru/a/us-internet-neutrality-/4164182.html",
			"added": 1513340295
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Тест",
				"added": 1513312625
			}
		]
	},
	"comment_vote": {}
}