{
	"posts": [
		{
			"id": "5177c9c3-199d-4300-b1a1-7fc6db4a932e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7fae6bba-7d04-4440-8090-75b369c7ed1a",
			"body": ">>dac27405-97ae-4633-9920-136e3fceeea6\nIf you are distributing a ZeroNet installation in the first place, you could integrate the Tor fix and even the Millchan update.\nThen it'd be plug and play except for the ZeroID stuff. Nobody's going to do all that shit just to be able to post here.",
			"time": 1565897299441,
			"files": "[]"
		},
		{
			"id": "a59e53e7-f11b-4060-8570-4c11478d2dbe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>9ebe3559-cc86-4a15-b2e0-05215816aa0a\n800 million jews!",
			"time": 1565899389377,
			"files": "[]"
		},
		{
			"id": "fdacf2ff-eb78-4d2b-9539-46cd3eb52b6b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ee112132-7bdf-4120-8d25-c45258913cec",
			"body": "Actually, inflation is defined as the increase in prices. It doesn't matter what the increase in productivity is (and thus how much money the Fed needs to keep shitting out in order to actually cause inflation).\nBut that said, you have a point in that consumer goods do not necessarily reflect productivity increases across the board. The productivity of consumer goods might increase faster or slower than other types of goods. But that is mitigated by the fact that, at least theoretically, the prices of every other type of capital good used to produce consumer goods is already integrated into the price of consumer goods, because an increase or decrease in the price of capital goods causes an increase or decrease in the price of consumer goods, at least in the medium and long term.",
			"time": 1565900374822,
			"files": "[]",
			"last_edited": 1565900440022,
			"subject": null,
			"capcode": null
		},
		{
			"id": "6fd68294-1294-4550-a8be-78eef9d40713",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "425586cf-3f0e-4c6d-beed-9a36783ea81e",
			"body": "Just a heads up.\nWith the latest Millchan update plus setting trackers to Tor, I haven't needed the hack to go through Tor Browser bridges so far (I'm testing since yesterday). I haven't needed the extra trackers either, the default ones work fine.\nMaybe there was a bug in the old version of Millchan that spammed unnecessary connections.",
			"time": 1565900565261,
			"files": "[]"
		},
		{
			"id": "256434b2-6cf6-49f9-a0e4-49768648c0b6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ee112132-7bdf-4120-8d25-c45258913cec",
			"body": ">>ca9470a9-e384-4912-97b4-809aac58689a\n>Yes, the definition of inflation is \"increase in prices\", but which prices?\nIn any asset class you choose to look at.\n>As I demonstrated, consumer goods do not have a stable value\nIf something had a stable value, then by definition it wouldn't show inflation nor deflation. But that doesn't matter anyway, because nothing in the economy has a stable real value.\n>they reduce in value over time.\nWhat kind of value, though? If you mean nominal value, then that's obviously not true (because the government prints money). If you mean real value, then it's kinda true only because some asset classes (like land) you just can't create more of, and the amount of people grows slower than productivity, so consumer goods are going to become cheaper in terms of those, but not necessarily in terms of, for instance, capital goods, since capital goods are produced more efficiently as time goes on too.\n>There are many asset classes which could have been chosen instead of consumer goods to track inflation. For instance stocks, commodities, and real estate.\nThere are two reasons consumer goods are chosen, the first one is that consumer goods (maybe along with real state) is the asset class that has the biggest impact on people's quality of life, and the second one is that it also is a good indicator of how capital goods are doing, because as I've mentioned if the price of capital goods fluctuate, then the output of those (consumer goods) are going to fluctuate in more or less the same way. I agree it's not a complete picture, and maybe an index tracking consumer goods and real state along with maybe services would be better.\n>For instance stocks, commodities, and real estate.\nStocks aren't a good way of tracking inflation, because then it would show inflation no matter what (even if the prices of goods and services were becoming cheaper) unless you're in a recession. Stocks track how valuable companies are, not inflation of real goods.\nCommodities is too big of a category to be useful. You have oil, metals, food, all kinds of different things. If you tracked grains and animals I imagine you'd get more or less the same as the CPI. If you tracked oil and metals then I imagine you'd get something that's affected by all kidns of geopolitical and industrial conditions and not necessarily has any correlation with prices consumers care about.\nReal estate by itself has the problem that (again) they always more or less rise unless you're in pretty much a depression just because there are always more and more people (and thus more demand), even if the central bank doesn't print any money and the price of consumer goods are actually decreasing.\n>The choice to use consumer goods for the main inflation metric of the Federal Reserve was done on purpose to pull wool over the public's eyes.\nThat's highly possible.\n>Remember that we moved off valuing the dollar on silver, so this isn't some magical idea. We went from valuing the dollar on silver to basically valuing it on food plus a compounding 2.5% per year.\nDo you have any sources for that? If you mean the Nixon shock, I don't think that's what it was about.\n>That was done on purpose because they knew most people wouldn't understand the concept and would accept getting poorer over time if it meant they had a similar lifestyle.\nYeah, central banks do anything they can to make the system impossible to understand by the average person (and heavily promote the keynesian dogma to give it a justification for those who do understand it). Ask anyone on the street what causes inflation and only like 1% of people will be able to give you the correct answer.",
			"time": 1565903046901,
			"files": "[]"
		},
		{
			"id": "71ca3be2-c613-4ad6-9d6d-b498a1d82c8f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ee112132-7bdf-4120-8d25-c45258913cec",
			"body": ">>51254e4f-3dc3-4aa1-b755-a3c5442ddcfc\n>That's not true unless you also consider the USD to have a set value, which it does not.\nI was thinking more about inflation in exchange value with respect to another real good, but that's probably not a correct usage of the word \"inflation\".\n>The USD's value is constantly dropping even versus consumer goods, so its inflation versus other asset classes that are more stable is greater. By more stable, what I mean is assets with more fixed supply and demand.\nWhat good has a more fixed supply and demand than consumer goods? Medical goods have more or less fixed demand but variable supply, and real estate has a more or less fixed supply but variable demand. And when I hear \"inflation\" I expect they're talking about something more general than just real estate or medical goods or [insert asset class here].\n>The global equity market actually has somewhat fixed supply and demand because it is the valuation of the profit on global production. \nNo. Machines are always being added to factories. Technologies are always being improved. Products created. Etc. It has an ever growing supply compared to the increase in the demand (which population growth nonetheless, is slower than the growth of companies).\n>That global production is derived from the number of workers times their productivity.\nProductivity increases, plus there are more workers.\n>The workers' products may devalue over time, but the profits per worker do not. Profits tend to go up with new technological discoveries, but settle and stabilize as competition increases.\nI disagree. So far stock prices haven't settled, and I don't think they will at least in the next couple thousand years.\n>Stop and think about your assumption on why stocks always increase in value. What is the mechanism for that?\nTechnological improvements and capital accumulation (aka investment).\n>Maybe your assumption is based on USD being stable when in fact it is not. Maybe stocks are actually the stable asset and USD is the asset that is artificially falling in relation to them.\nIf that was the case we'd expect equity to grow at the same rate that, say, precious metals or real estate. But it grows faster than those two.",
			"time": 1565905132357,
			"files": "[]",
			"last_edited": 1565905175157,
			"subject": null,
			"capcode": null
		},
		{
			"id": "ef9fdac7-08bd-4521-ab03-5062614ecec4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "206cc6ad-869b-4405-b3cf-238173996eeb",
			"body": ">>206cc6ad-869b-4405-b3cf-238173996eeb\nThe posts don't get deleted if he uses the official blacklist feature, you can still see them if you disable the blacklist. If he does some hacky shit with the site's files he might be able to actually shoah the posts, the way you'd find that would be by diffing the users\\content.json and js\\all.js files over time.",
			"time": 1565906843163,
			"files": "[]"
		},
		{
			"id": "be0a0b33-c195-43e9-aa2e-f822437c8dc4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "206cc6ad-869b-4405-b3cf-238173996eeb",
			"body": ">>b1cbdbb0-f9ff-4ce0-8b90-57db7f905c6a\nMaybe.",
			"time": 1565907002602,
			"files": "[]"
		},
		{
			"id": "ab9e2577-9644-47e0-8df7-1e6bf1314782",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "3e20f065-7ca2-448a-8245-a00a7d2de3ec",
			"body": ">>96b9bc8b-dff5-4690-a46f-bef19beee853\n>Yes you're adding an extra overhead of parsing MBs of JS that will not be there in the production build.\nHow's that? Do you mean because the libraries aren't stripped of whatever's not needed? I think the extra weight could easily be because of a lack of minification.",
			"time": 1565917414045,
			"files": "[]"
		},
		{
			"id": "8fcdcef5-ef5c-4880-b110-02a28898dece",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "7849a398-81c7-4ec5-b081-54b86982864a",
			"body": ">>a7fbca2e-56bf-4b77-ae6e-2a7a64fe43c0\nMaybe try increasing the thread limit in the options?",
			"time": 1565917551487,
			"files": "[]"
		},
		{
			"id": "bbfca80f-8e9c-4fd2-a3a7-75b9135cdcb9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>33fc4c48-9121-4c61-ac59-73b2ad1168e4\nYeah sometimes the page locks forever for some reason.",
			"time": 1565918196942,
			"files": "[]"
		},
		{
			"id": "4f8bc12e-d56f-40da-9ca7-a31874ac0da3",
			"directory": "users/1KFWBExA8G3RA6DqUPsVg6NR9Jy2wrQhz6",
			"uri": "monster",
			"thread": "09ac6071-759e-4861-9a69-49406d08760d",
			"body": ">>d606fb85-cc77-4d84-8fbc-4f75b0222895\nMarking the site as yours doesn't do anything except enabling the publish button. If the files didn't have the read-only property they'd be overwritten anyway.",
			"time": 1565919890634,
			"files": "[]"
		},
		{
			"id": "3371586e-ecc4-4056-9d85-3451e7274bf5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>bec2369b-f27b-4493-bc77-d671118d4499\n>The people who own how laptops are made are the 1% you autist.\nNo you fucking nigger. Your bait and switch tactics won't work here. You don't get to make a claim, be called out on your bullshit and then pretend you were making a different claim.\nYou claimed 99% of people can't acquire the necessary parts and put them together for anything other than \"autistic mud pies or some shit\". I showed you how most people already own the \"means of production\" for making software. You don't get to do the switcheroo and pretend you were claiming 99% of people don't have the means of production to make computers. You claimed 99% of people don't have the means of production to make anything else than \"autistic mud pies or some shit\". You were proven wrong. End of the story.\n\n>The people who actually build things of utility are the ones who should own them\n<Again, on what basis? Because you want it to be so doesn't mean they \"should\".\n>My self interest.\nJust because you want something doesn't mean you're entitled to it. I mean come on. This is a 3 year old's level of argument.\n\n>so might makes right? Ok.\nDepends on your morality. Under some moral systems (I would say under the majority), yes, building the means of production (or being voluntarily given the means of production by somebody else) makes you morally entitled to decide how those goods should be used, and to receive a voluntarily pre-accorded (by both parties) portion of the production by whoever uses those goods to produce other goods.\n\n>Again so might makes right, ok.\nMaybe, under some moral systems. But under most moral systems the fact that makes that person's control over those goods legitimate is not just the de-fact control but whether they were the ones who built them or whether they received those goods as part of a contract that both parties entered voluntarily (which could mean an inheritance, a gift, a payment in exchange for labor or goods, or profits from the usage of other goods owned by that person as long as the workers were paid a voluntarily pre-accorded amount).\n\n>>4d194415-d4df-40bb-82de-2507e7fda383\nSuuuure, of course the owner of a commie forum that comes from another forum made by a mentally ill cuck sucking trannie would never arbitrarily delete messages he doesn't like. Of course not, censorship is unheard of in those places.",
			"time": 1565922072416,
			"files": "[]"
		},
		{
			"id": "19c8ffed-d42a-40df-85ec-ca60da6131e0",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "79db4600-c2df-49ef-ba59-dc4897faf295",
			"body": ">>79db4600-c2df-49ef-ba59-dc4897faf295\nJust set your trackers to go through Tor in the settings and update to latest MC. Haven't had any issues after that.",
			"time": 1565922244193,
			"files": "[]"
		},
		{
			"id": "119cea39-bd43-45ab-aab8-462bc1346e4b",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "87a1623b-2a1e-4635-bac2-0f09a5b73977",
			"body": ">>e06d4420-4fda-448e-811d-6c93e0d27890\nSo he's calling for \"easing\". Does he mean \"quantitative easing\"? You know that's \"printing money\" by another name, right?\nAnd interest rates don't matter for shit. What actually matters is how much money they create (M0, the monetary base).\nSo he's calling out the Fed for the wrong reasons to plant misinformation so everybody is confused about '''why''' the Fed is actually so insidious and is one of the most important issues of our time. Pro tip: **it's not because of interest rates**.",
			"time": 1565922984901,
			"files": "[]"
		},
		{
			"id": "68b4a3be-dac9-4f20-816a-e530a9e69335",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "History of computing thread",
			"body": "== History of computing thread ==\nWhat milestones do you think were the most interesting or important and not so well known in the field of computers?\nI'm currently watching https://www.youtube.com/watch?v=Wp7GAKLSGnI\nThe Computer History Museum has many nice interviews videos like that one that are pretty interesting and kind of in-depth in a way that you don't find anywhere else except maybe some obscure books.",
			"time": 1565925918815,
			"files": "[{\"name\":\"5072c7d205faea498608fc0607840cb8.jpg\",\"thumb\":\"db29b7677a37f626c0d0f715f5868912ed0d7aad-thumb.jpg\",\"size\":105010,\"type\":\"image/jpeg\",\"original\":\"db29b7677a37f626c0d0f715f5868912ed0d7aad.jpg\",\"directory\":\"1CoL1XUSobU1H7RPzCbHpfqwHWuNcG2WVg\"}]"
		},
		{
			"id": "c57880c4-3522-415e-a86e-6ab239bd00e3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>bf303783-a9a9-4938-8cb7-69410ba5df2c\n>But if you really want to go there I can always point out that most of the rest of the world that isn't full of crackers like you could be considered not part of the 1%, so, fuck yourself white boi.\nIt's not my fault niggers like you are retarded. Communism is certainly not goign to bring up your IQ above the sub-human level.\n>At any-rate, of course you Neo Nazi larpers aren't going to argue honestly, but; The thing about laptops is they are dependent upon an already existing mode of production to provide commodities which are useful for exchange.\nSo your argument for people not being able to produce things is that in a commie country the government would steal those things from people before they can even be sold? Wow, that's actually a great argument.\n>If we lived in an economy where that wasn't the case the exchangability of code would cease to exist and people would code as needed. Laptops and other toasters are not the general rule that is the means of production being places by which we produce the things we need \nYeah, your right. In a commie world code wouldn't be needed, because we wouldn't have computers in the first place.",
			"time": 1565930273352,
			"files": "[]"
		},
		{
			"id": "14a422b7-d935-47c8-9d94-5ff0a909bfca",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>6617e290-6b4a-4bce-a0bc-243a919557de\nTouched a nerve, huh?\nKill yourself nigger. You'll never be white.",
			"time": 1565932109952,
			"files": "[]"
		},
		{
			"id": "a40dd428-887e-4de2-8fda-5f4998e1d27f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9a7bb255-9eaf-4814-a8ed-159296cc53b3",
			"body": ">>44e97b8e-9138-4cbf-8d32-b4109abdddd8\nKill yourself nigger. You aren't welcome here.",
			"time": 1565933072345,
			"files": "[]"
		},
		{
			"id": "ec1f5c82-540b-4d06-9329-bdcd970720f7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e4ec0eed-e962-4e77-9943-a7ec20406765",
			"body": ">>841627e2-bc6e-48e4-bf58-34550841fdde\nKill yourself nigger. You aren't welcome here.",
			"time": 1565933157245,
			"files": "[]"
		},
		{
			"id": "304f220e-dfdb-473b-89cc-8b4ff6f31aa8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4d81b316-b044-4247-bb86-60b2369237ee",
			"body": ">>800b6c5a-9fac-49c8-9bc0-33b2aba6eaa0\n>normies\nKill yourself nigger. You aren't welcome here.",
			"time": 1565933208904,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}