{
	"title": "BussDee",
	"description": "Are you interested in  music, cartoons, videos, politics and other cool content created by my family? ",
	"links": "*   **www - Links:**\n\n*   [Shop EU](https://www.spreadshirt.de/user/bussdee)\n*   [Shop US](https://www.spreadshirt.com/user/BussDee)",
	"next_post_id": 4,
	"demo": false,
	"footer": "... back to [HOME](http://127.0.0.1:43110/1Pgd98eF8yySD9yBRpjhsYAo1SMjzfrW4/)",
	"modified": 1538150707,
	"post": [
		{
			"post_id": 3,
			"title": "My Zite is online !",
			"date_published": 1538150471.698,
			"body": "My Zite is online. Still in beta and under construction, but you can visit it now. Please \"download & share\" if you like it, we need more peers. Just visit the Zite and DRAG the \"0\" in the upper right corner to the left. A sidebar will appear. Search for the activation to share this content to show some support. With growing peers we will add more content every day/week/...\n\nhttp://127.0.0.1:43110/1CvtJKNdcjX14d1WzuZNGcR6BtqYaa36ww/"
		},
		{
			"post_id": 2,
			"title": "\"The BussToons\"",
			"date_published": 1537806520.967,
			"body": "Welcome ZeroNet users. I am very proud to welcome you at my new uncensored blog. I will do my best to release everything in english. Please dont be too harsh with me if my english sucks, i will do my best. ;) I am creating some cool characters right now. I will try to release some animated short movies in future with those characters. I will try to learn now, how to add images to my posts in this ZeroBlog. \"Stay tooned\" for some really cool character image releases."
		},
		{
			"post_id": 1,
			"title": "HELLO WORLD",
			"date_published": 1537740213,
			"body": "**_\"Your zeronet blog has been successfully created!\"_**\n\n_... and i will start adding more links, features and content. Follow me, if you like to support this project. With raising followers this project will grow._"
		}
	],
	"tag": [
		{
			"value": "#BussToons",
			"post_id": 2
		},
		{
			"value": "ZeroNet",
			"post_id": 1
		},
		{
			"value": "#ZeroNet",
			"post_id": 3
		}
	],
	"links2": "[Shop EU](https://www.spreadshirt.de/user/bussdee)\n\n*   [Shop US](https://www.spreadshirt.com/user/BussDee)"
}