{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Not a bug but yeah it is annoying. You are supposed to contact the site admin to raise your data limit. I don't know yet what is a good default limit, on my sites I use 30 kb at the moment. On ZeroTalk I already had to ask nofish for a raise just a week or two ago, he raised it to 100k and now I'm at over 90kb again and it tells me I will hit the limit soon, so I will have to ask for another few kb added to my limit or I won't be able to post on ZeroTalk anymore.\n\nNow, the reason for this is twofold.\n\n1) Spam. I don't think that's a good reason. Even 10k is still a lot of spam, and you can easily block spam accounts and remove everything they posted anyhow.\n\n2) When you make a comment or vote on something, on any ZeroNet site, your whole data file for that site needs to be uploaded/downloaded. So if the file was really big, that would waste a lot of bandwidth for you and for everyone else using the site. Nofish said adding the ability to send just the changes instead of the whole file is on his priority todo list for ZeroNet, so hopefully this whole data usage limit will be a thing of the past very soon.",
			"post_id": 24,
			"date_added": 1457953481
		},
		{
			"comment_id": 2,
			"body": "> [erkan](#comment_25_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): @ekaterina thanks for the explanation. I perceive this as an unnecessary burden for us (trusted) users. Because as you say, we all will hit the limit, sooner or later. And, we would all have to go through this bottleneck step (also @nofish has to do this manual task always).\n\nYou're welcome ;)\n\nExactly, my thoughts as well, but since the necessary feature to get rid of it isn't implemented yet there really isn't anything that can be done about it for now. 1) is about trust, but 2) is just a technical reality, would waste too much bandwidth if data files got too big and this way you make people a bit less wasteful with their data. But yeah I think raising the default limit to 50 or even 100k would still be okay.\n\nBut he really did say it has the highest priority so I'm sure we won't have to wait long, thankfully ZeroNet development even with just one developer is very active, there were so many cool updates over the last few months, really inspiring how much work he  puts into it :)",
			"post_id": 24,
			"date_added": 1457954237
		},
		{
			"comment_id": 3,
			"body": "Thanks for sharing, I always miss those articles! I guess I should start reading crypto related websites :)",
			"post_id": 56,
			"date_added": 1459514082
		}
	],
	"comment_vote": {},
	"post_vote": {
		"15": 1,
		"25": 1,
		"56": 1
	}
}