{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Greetings From \"New Normal\" Germany!",
			"body": "\"On April 1, 1933, shortly after Hitler was appointed chancellor, the Nazis staged a boycott of Jewish businesses in Germany. Members of the Storm Troopers (“die Sturmabteilung,” or the “Storm Department,” as I like to think of them) stood around outside of Jewish-owned stores with Gothic-lettered placards reading “Germans! Defend yourselves! Do not buy from Jews!”\n\nThe boycott itself was a total disaster — most Germans ignored it and just went on with their lives — but it was the beginning of the official persecution of the Jews and totalitarianism in Nazi Germany.\n\nLast week, here in “New Normal” Germany, the government (which, it goes without saying, bears no resemblance to the Nazi regime, or any other totalitarian regime) implemented a social-segregation system that bans anyone who refuses to publicly conform to the official “New Normal” ideology from participating in German society. From now on, only those who have an official “vaccination pass” or proof of a negative PCR test are allowed to sit down and eat at restaurants, shop at a “non-essential” stores, or go to bars, or the cinema, or wherever.\n\nHere’s a notice from the website of Prater, a popular beer garden in Berlin:\n\nOf course, there is absolutely no valid comparison to be made between these two events, or between Nazi Germany and “New Normal” Germany, nor would I ever imply that there was. That would be illegal in “New Normal” Germany, as it would be considered “relativizing the Holocaust,” not to mention being “anti-democratic and/or delegitimizing the state in a way that endangers security,” or whatever. Plus, it’s not like there are SA goons standing outside shops and restaurants with signs reading “Germans! Defend yourselves! Don’t sell to the Unvaccinated and Untested!” It’s just that it’s now illegal to do that, i.e., sell anything to those of us whom the media and the government have systematically stigmatized as “Covid deniers” because we haven’t converted to the new official ideology and submitted to being “vaccinated” or “tested.”\n\nProtesting the new official ideology is also illegal in “New Normal” Germany. OK, I think I should probably rephrase that. I certainly don’t want to misinform anyone. Protesting the “New Normal” isn’t outlawed per se. You’re totally allowed to apply for a permit to protest against the “Covid restrictions” on the condition that everyone taking part in your protest wears a medical-looking N95 mask and maintains a distance of 1.5 meters from every other medical-masked protester … which is kind of like permitting anti-racism protests as long as the protesters all wear Ku Klux Klan robes and perform a choreographed karaoke of Lynyrd Skynyrd’s Sweet Home Alabama.\n\nWho says the Germans don’t have a sense of humor?\n\nI don’t mean to single out the Germans. There is nothing inherently totalitarian, or fascist, or robotically authoritarian and hyper-conformist about the Germans, as a people. The fact that the vast majority of Germans clicked their heels and started mindlessly following orders, like they did in Nazi Germany, the moment the “New Normal” was introduced last year doesn’t mean that all Germans are fascists by nature. Most Americans did the same thing. So did the British, the Australians, the Spanish, the French, the Canadians, and a long list of others. It’s just that, well, I happen to live here, so I’ve watched as Germany has been transformed into “New Normal Germany” up close and personal, and it has definitely made an impression on me.\n\nThe ease with which the German authorities implemented the new official ideology, and how fanatically it has been embraced by the majority of Germans, came as something of a shock. I had naively believed that, in light of their history, the Germans would be among the first to recognize a nascent totalitarian movement predicated on textbook Goebbelsian Big Lies (i.e., manipulated Covid “case” and “death” statistics), and would resist it en masse, or at least take a moment to question the lies their leaders were hysterically barking at them.\n\nI couldn’t have been more wrong.\n\nHere we are, over a year later, and waiters and shop clerks are “checking papers” to enforce compliance with the new official ideology. (And, yes, the “New Normal” is an official ideology. When you strip away the illusion of an apocalyptic plague, there isn’t any other description for it). Perfectly healthy, medical-masked people are lining up in the streets to be experimentally “vaccinated.” Lockdown-bankrupted shops and restaurants have been converted into walk-in “PCR-test stations.” The government is debating mandatory “vaccination” of children in kindergarten. Goon squads are arresting octogenarians for picnicking on the sidewalk without permission. And so on. At this point, I’m just sitting here waiting for the news that mass “disinfection camps” are being set up to solve the “Unvaccinated Question.”\n\nWhoops … there I go again, “relativizing the Holocaust.” I really need to stop doing that. The Germans take this stuff very seriously, especially with Israel under relentless attack by the desperately impoverished people it has locked inside an enormous walled ghetto, and is self-defensively ethnically cleansing.\n\nBut, seriously, there is no similarity whatsoever between Nazi Germany and “New Normal” Germany.\n\nSure, both systems suspended the constitution, declared a national “state of emergency” enabling the government to rule by decree, inundated the masses with insane propaganda and manipulated “scientific facts,” outlawed protests, criminalized dissent, implemented a variety of public rituals, and symbols, and a social segregation system, to enforce compliance with their official ideologies, and demonized anyone who refused to comply … but, other than that, there’s no similarity, and anyone who suggests there is is a dangerous social-deviant extremist who probably needs to be quarantined somewhere, or perhaps dealt with in some other “special” way.\n\nPlus, the two ideologies are completely different.\n\nOne was a fanatical totalitarian ideology based on imaginary racial superiority and the other is a fanatical totalitarian ideology based on an imaginary “apocalyptic plague” … so what the hell am I even talking about? On top of which, no swastikas, right? No swastikas, no totalitarianism! And nobody’s mass murdering the Jews, that I know of, and that’s the critical thing, after all!\n\nSo, never mind. Just ignore all that crazy stuff I just told you about “New Normal” Germany. Don’t worry about “New Normal” America, either. Or “New Normal” Great Britain. Or “New Normal” wherever.\n\nGet experimentally “vaccinated.” Experimentally “vaccinate” your kids. Prove your loyalty to the Reich … sorry, I meant to global capitalism. Ignore those reports of people dying and suffering horrible adverse effects. Wear your mask. Wear it forever. God knows what other viruses are out there, just waiting to defile your bodily fluids and cause you to experience a flu-like illness, or cut you down in the prime of your seventies or eighties … and, Jesus, I almost forgot “long Covid.” That in itself is certainly enough to justify radically restructuring society so that it resembles an upscale hospital theme park staffed by paranoid, smiley-faced fascists in fanciful designer Hazmat suits.\n\nOh, and keep your “vaccination papers” in order. You never know when you’re going to have to show them to some official at the airport, or a shop, or restaurant, or to your boss, or your landlord, or the police, or your bank, or your ISP, or your Tinder date … or some other “New Normal” authority figure.\n\nI mean, you don’t want to be mistaken for a “Covid denier,” or an “anti-vaxxer,” or a “conspiracy theorist,” or some other type of ideological deviant, and be banished from society, do you?\"\n\nhttps://consentfactory.org/2021/05/25/greetings-from-new-normal-germany/",
			"added": 1622005775
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}