{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1590041703,
			"title": "UNDER AGE CONTENT, WTF...   Why so much on Russian XXX websites ???",
			"body": "Russia has laws so why does there appear to be an underground market in the surface and deep web?\n\nI can understand a 17 year old who simply does not fully understand their actions posting a couple of pictures or perhaps a web cam video...    But even that is very questionable as web hosts and law enforcement in Russia should have protections in place.    Individuals will post regardless so trying to stop everything at the sources is next to impossible.   Commercial content on the other hand usually has restrictions and from what I understand local law enforcement verify ages of individuals.    So WHY does Russia have so many openly illegal websites!?  \n\nWhat is the purpose of posting illegal content as no one can use such for marketing.   Meaning you can not convert any traffic to these sources and only a picture or two of a person will be displayed.\n\nNon stop blind links that make content look illegal but actually only will run you in circles is really a strange concept to me...   Going to what appears to be an 18 - 19 year old xxx site and seeing underage content is bad enough BUT when you click on what seems legal and you are sent to underage content mixed together with legal is really not a good feeling.\n\nSo are these websites ran by hackers who are simply trying to scam buyers of underage content? ... Actual companies who are operating with permission or with a government looking the other way? ... Or is the social norms regarding protection of youth in Russia simply just a fake image of normal behaviors?\n\nGoogle and Duckduckgo tend to over filter and when you turn off SAFE MODE for browsing there is a LOT of surface content that is VERY questionable.   I can kind of understand completely closed groups or networks, but this stuff is on the surface web or can be linked to very easily.\n\nSo can someone give me a little context?\n\nThanks,",
			"added": 1590041702
		}
	],
	"topic_vote": {},
	"next_comment_id": 35,
	"comment": {
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 1,
				"body": "Trump has been telling the truth, it is the FAR left political parties who are using propaganda to undermine him.   WTF is going on... YEA RIGHT... look at this \"Wtf is wrong with Trump supporters\" ...  That Iranian general should have died a long time ago...  Good for the USA for hunting him down!",
				"added": 1587246927
			}
		],
		"1587103405_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 2,
				"body": "Part of the problem is that one regions laws and social norms that allow content might NOT be allowed in another region.   For the most part most western governments are fairly relaxed on what you can post.   The problem is that the majority of social media platforms had too loose of a restriction on content posted...    For example Youtube 10 years ago had all bunch of BS and propaganda videos posted and very low quality content...   There was conspiracy theory posts that populated the entire online service...   Then after that instead of quality content people started to post highly political content expecting to convert on traffic.   Youtube has responsibilities to the corporations that buy advertisement spaces to keep videos where their ads will display as neutral as possible.\n\nUnrestricted internet sounds fair until you you cannot find anything or have to listen or read tuns of propaganda!",
				"added": 1587247537
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "An alternative to Facebook is https://www.minds.com/",
				"added": 1587336376
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2064_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): A social network that pays you is a strange concept to me. I'm not sure they would want that.\n\nYou want a completely free open source social media solution that is decentralized... Zeronet is basically the ONLY example that fits that requirement...  Zeronet is NOT perfect and has no regulations to ban illegal content...   The ability to post content and to create a website (zeronet version) that is very hard to take down is why people come to Zeronet...   Even if you create a .onion website such can be attacked by hackers or governments as such a website / service is centralized.    Zeronet is not exactly user friendly and tends to have adult and content that is objectionable to a great many...   Can't have a free and open service without giving up some rights.   There are plenty of content that people from China would object to, such was the reason why China BANNED Zeronet!   ...   Minds.com does NOT pay you, rather the service has a credit system that it uses to promote internally content...    Do not understand why  you would think they would pay you money...   You got the wrong idea about minds.com",
				"added": 1587423829
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_2069_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): BTW, you guys won't want my family here. They'll be low-quality posters. I'm not gonna start explaining the bullshit they telephone each other.\n\nAre you or your family and friends computer / technology literate !?",
				"added": 1587427471
			}
		],
		"1587305852_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 5,
				"body": "Socialism depends on an open market to produce a living wage for all, even those who do not work.   It gets more complex when governments that are socialist  function closer to a democratic system because outside sources can influence their economies.    The USA is an example how a Socialistic government (Democrats) fight with the Republicans that are actually closer to being real democrats.    The Democratic party is actually closer to a Socialistic government structure NOT a true democratic system...   The Republic government is closer to what a Democratic government would function as...    Neither are truly a Democrat system, rather a Republic with an open market place that resembles a democratic system.   Just happens the Republican system of government  is more aligned to that idea of trade.    The Republicans and the Democrats over the years sold out their people.   Jobs shipped away caused a lot of harm...   So without work or real opportunities those states that identify as Democrats had to create policies closer to a Socialistic / republic simply to manage their own people...   On the other hand the Republicans being on the right wing tended to be overly aggressive with the assets they do or did have prompting the left wing to criticize and demand indirect payments to off set their expenses via taxes and special considerations by their governments actions.",
				"added": 1587424979
			}
		],
		"1587407952_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 6,
				"body": "MuWire does NOT seem to work...  simply just keeps loading and after a couple of minutes I had stopped running it.   What is it a virus or scanner to con people?",
				"added": 1587425666
			},
			{
				"comment_id": 7,
				"body": "When MuWire did start after several minutes such was basically useless...   With .torrents files you have a much larger choice of files.  MuWire might have been a good idea in the 90s and early 2000s but in current times such is completely useless!",
				"added": 1587426411
			}
		],
		"1588110604_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 9,
				"body": "What part will you take to improve the problems you see other then simply loosing your composure!",
				"added": 1588189757
			}
		],
		"1588435080_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 10,
				"body": "Zeronet sets up Tor automatically...   If you want to setup Tor as a service use the developer bundle for windows.",
				"added": 1588479928
			}
		],
		"1588376339_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 11,
				"body": "Canada is NOT under siege, that is TOTAL BS...",
				"added": 1588480026
			},
			{
				"comment_id": 13,
				"body": "I live in Canada and that title is simply incorrect and very misleading!  ...  There was a mass shooting of an individual who killed many people about a week ago using assault / military grade weapons.   It was all over the national news, so our  Prime Minister banned assault weapons...   Even legally owned assault style firearms must be handed over, however the Canadian government are buying them back and not simply leaving owners with nothing.",
				"added": 1588534485
			},
			{
				"comment_id": 14,
				"body": "> [blahblah69](#comment_65_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): I  live in Canada too, and i stand behind the title, tragic yes, the Nova Scotia shooting was horrific in every conceivable way, the fact the the guy had everything he needed to look like a cop was sick, That said...This is still the liberal government doing what it does best, screwing the majority of law abiding people for the actions of a hand full of nut jobs (no difference whatsoever than the democratic party to the south). All the liberals want to do is reign in socialism and regulate the crap out of everyone's life, and the majority of Canadians are STILL to stupid to see it. Under siege may sound a bit harsh, but its not as far fetched as one might think, I mean we have just had a two month (so far) trial run of socialism lite where the government has told us we cant work, cant go out, cant see family, encouraged neighborhood spying and has tested the basic income scenario. in fact, the only thing missing is a curfew  and military check points. They have also seen first hand just how fast they can shut down the country with little to no resistance). [...]\n\nYour title saying \"Canada under siege\" is BS and VERY misleading...   Amounts to propaganda!",
				"added": 1588672717
			},
			{
				"comment_id": 15,
				"body": "> [blahblah69](#comment_70_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): So be it, I'm not arguing with an idiot.\n\nI have read your posts making statements that are simply wrong! ...  You make claims without any proof and when you do actually speak to a Canadian on the subject you call them / me an idiot.\n\nYou are nothing more than a TROLL.",
				"added": 1588745719
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 12,
				"body": "Zeronet is mostly Left Wing.",
				"added": 1588480184
			}
		],
		"1588494290_1LsxokXjHhAjgc7eh1eYPEBXzvyv5EYVwJ": [
			{
				"comment_id": 16,
				"body": "Technically the CIA functions outside of the continental USA.  It is the FBI that functions within the USA.   This is not to say supports are not in place rather the actual hands on work in the field is outside of the USA.   This is not counting the analysts located within the USA.   Google how to find CIA if you REALLY want to find them fast!  ;)",
				"added": 1588746214
			}
		],
		"1588888253_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 17,
				"body": "Create a new zeronet id",
				"added": 1589108655
			}
		],
		"1589201882_17v2UBGNSMncMni3XDXFAJa8HtwGuEdQyB": [
			{
				"comment_id": 18,
				"body": "Think you are looking for a root kit you can drop...    Try https://www.kali.org/downloads/   ...  https://www.youtube.com/watch?v=J36yzsCLPNg",
				"added": 1589252723
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 19,
				"body": "Promoting web services online is actually really hard...  Simply because you need to go where there is traffic, namely using social media.   The problem is those social media companies have strict rules about promoting and most of the time actions will be labeled SPAM.     The social aspect of Zeronet is a real good thing but most people have not taken to using Zeronet to justify advertising on the network.      Downloadable apps for Cellphones or for PC plus already created social media is what most people use.   I like the idea of Zeronet   BUT  it is VERY limiting, however such needs to have those limits for safety and ease of use.      A problem that has been an issue is that cellphones have a hard time running Zeronet so many login using their PC.",
				"added": 1589985416
			}
		],
		"1589915224_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 20,
				"body": "People need to SEED your content...  Even with several people SEEDING they have to be online with available copies PLUS there needs to be enough people for your node / client to pick up other locations hosting your files.",
				"added": 1590020918
			},
			{
				"comment_id": 21,
				"body": "I do understand your comment, however the PINNED content is only for 24 hours and such is NOT permanent! ...  You will need to re pin the content.    The Intergalatic File System on Zeronet is a way to host files, but again some one needs to keep a fair amount of SEEDS running so your node can have enough sources.    I have PINNED content in the past and such is temporary cached on the network but is not actually a seed.    Look at BEAKER BROWSER, there is a free seed...     Even with a couple seeds it is possible that individuals still could not get your content even if those seeders are online as your node might not be seeing them online due to networking of the IFS.",
				"added": 1590040342
			},
			{
				"comment_id": 30,
				"body": "> [ransbits](#comment_25_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): You are incorrect, a file is pinned will last indefinitely... I have shared titles from over two years ago and their status is still pinned. [...]\n\nIPFS only allows pinned content for a short time, 24 hours...   If your content is being mirrored then such is because someone is hosting it elsewhere.  You can re pin content if such is being updated.",
				"added": 1590106576
			},
			{
				"comment_id": 34,
				"body": "> [ransbits](#comment_27_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): IFS is not IPFS, Pinning a file is based on your Zeronet client, not IPFS. My files have never unpinned themselves by themselves...\n\nI think you are missing something...   Zeronet is purely a point to point file share system, those files need to be hosted and if there is no hosts then viewers cannot get to them...   IPFS is simply a ledger that points to who has those files, the digital ledger does NOT hold much data.    Intergalactic File System is NOT a server rather the implementation of IPFS...    For example you can post content via IFS and view such via IPFS.\n\nPinning content does NOT last, Zeronet is a P2P ... AND... IPFS does not allow content to be pinned more then 48 hours...  a server is required.     IFS does not pin content, rather that is done on the IPFS end / ledger.   Such then points to the server...    You can point for example an IPFS address to a standard web server.\n\n There seems to be a lot of confusion on the subject.",
				"added": 1590219292
			}
		],
		"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": [
			{
				"comment_id": 22,
				"body": "> [satoxyn1](#comment_118_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Can you name a few? I don't remember seeing CP on Russian websites like in a 10 years. Russia now have pretty strict laws regarding information on the internet, especially pornography, which is prohibited for creation and distribution. [...]\n\nThank you for answering my question, seems strange to me!",
				"added": 1590102878
			},
			{
				"comment_id": 23,
				"body": "> [satoxyn1](#comment_118_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Can you name a few? I don't remember seeing CP on Russian websites like in a 10 years. Russia now have pretty strict laws regarding information on the internet, especially pornography, which is prohibited for creation and distribution. [...]\n\nUse DUCKDUCKGO with safe search off and type teen, 18, young, or lola.    A lot of surface websites don't typically post content as it will get pulled fast, such seems true in the western world...   But you can go to what appears to be a 18+ website thinking such is legal but get nothing but blind links.   Or you can simply use an English to Russian translator and convert basic search terms and do a search using DUCKDUCKGO with safe search off...   These pages still get indexed so saying they are a part of the deep web seems somewhat wrong...   Saying they are a part of the Darknet is also wrong...    So why is criminal content if organized allowed on the surface web?\n\nIt is one thing for an individual to post content and be underage, such can be excused to some extent...  But still should be pulled and the person should be checked on for their safety...  But what I am seeing is content that is closer to professionally made images trying to get viewers to buy using Bitcoin.     Would expect that the Russian government would keep out of bedrooms but when children are involved they should step in and secure children from harm.     I tend to think there are laws in Russia regarding this subject and with their resources should have the ability to enforce such.   Even people who are 18+ should be regulated simply because of all the unlawful and illegal semi commercial content posted.",
				"added": 1590103545
			},
			{
				"comment_id": 24,
				"body": "> [satoxyn1](#comment_118_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Can you name a few? I don't remember seeing CP on Russian websites like in a 10 years. Russia now have pretty strict laws regarding information on the internet, especially pornography, which is prohibited for creation and distribution. [...]\n\nI do NOT want to post links to these sites just on principle!",
				"added": 1590103883
			},
			{
				"comment_id": 25,
				"body": "> [cexy](#comment_10_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): More bullshit about Russians. More distractions. If a woman a teacher has sex with a 17 year old student she gets arrested. However if a married person has an affair with 100 people and it breaks the family with children USA calls it middle age crisis. Sick hypocrites! Twisted minds!  [...]\n\nI do NOT hate the Russian people!  ...   There seems to be social norms that are allowed in Russia that would be illegal and unlawful in the majority of the western world.   If a social norm that children can be seen as sex objects within Russia then perhaps criticism is warranted!",
				"added": 1590104140
			},
			{
				"comment_id": 26,
				"body": "> [driud](#comment_52_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Jesteś zablokowany emocjonalnie. Masz blokadę, założoną przez watykan.  Aby zrozumieć Rosjan, którzy są wolni. I nie podlegają Watykanowi. Aby to zrozumieć, musisz tam pomieszkać z Rosjanami. Piszę tylko o Rosjanach. Tam też są inne narody, i one też są inne. Ale też są przyjaźnie nastawione do świata.Cały czas nas się uczy, że Rosja to zły kraj. Wystarczy pojechać i samemu sprawdzić. Wbrew temu co piszesz, tam niema Cenzury na materiały naukowe i społeczne. Jest bardzo duża swoboda osobista;Większa niż myślisz. Była próba zaorania Rosji, ale się nie powiodła.Teraz to naprawiają, to co parę koniokradów w myckach próbowało popsuć. I to  im się udaje zrobić, ( naprawić )..Piszę w dwóch językach, bo tłumacz Fałszywie tłumaczy;Zadaj pytanie? Dlaczego to on robi?.You are emotionally blocked. You've got a blockade by the Vatican. To understand the Russians who are free. And they are not subject to the Vatican. To understand this, you must live with the Russians. I write only about the Russians. There are other nations there, and they are different too. But they are also friendly to the world.We are constantly learning that Russia is a bad country. Just go and check it out for yourself. Contrary to what you write, there is no Censorship for scientific and social materials. There is a lot of personal freedom;Bigger than you think. There was an attempt to plow Russia, but it failed.Now they fix it, what a couple of thieves' thieves tried to spoil. And they manage to do (fix)..I write in two languages because the translator translates falsely;Ask a question Why is he doing this?\n\nI have NO association with the Church or Vatican and think that the Russian people are for the most part decent! ...  I have no ill will to Russia as a country nor do I have issues with the Russian people.    I don't care much for politics as such can be very misleading and have seen what appears to be corruption and or incompetence!   ...   I live in Canada and have seen the mess within the USA in regards to politics...   Everyone comments for certain and post what is mostly propaganda and such is typical...    The western word does not like Communism, but at the other end Capitalism and the free and open market place is VERY predatory and can be very harmful.\n\nMy original post was about under age people being taken advantaged of and why the Russian government does not step in more to protect children...  If they are protecting and enforcing their laws then their problems are much worse then what people think, in my opinion.",
				"added": 1590104819
			},
			{
				"comment_id": 27,
				"body": "> [nekololi](#comment_463_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): organized crime, i think. supposedly the mafia own a lot of these servers and will rent space out to anyone. law enforcement might be paid off, or maybe doesn't take this stuff very seriously.\n\nVery little goes on within Russia without the governments knowledge so if content is posted and not pulled when needed it is the Russian government say!  ...  We are talking about Russia which is a Communist government who has a lot of resources, if anything is going on even organized crime they know about it !!!",
				"added": 1590105383
			},
			{
				"comment_id": 31,
				"body": "> [satoxyn1](#comment_119_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Well, that's just a satellite/doorway website without real pornography, but with lots of small thumbnails which redirect you to another website, and then to another, then to another. SEO spam and exploit execution chain.\n\nWell that ok is really not!  ...   Those links point to underage content or a mixed of legal and illegal.   Your last sentence is pointless regarding the subject.    Those thumbnails are often of children.",
				"added": 1590115477
			},
			{
				"comment_id": 33,
				"body": "> [pithos](#comment_2_1H2JaH7T4HYEWqRc9beyTuEpbqW1EBdeL7): Given that it's russia we're talking about probably the government just looking the other way.\n\nYou would expect illegal content to be on  the DARKNET, yet you can find search engines linking to such!  ...\n\nThe surface web and deep web (non indexed webpages, but legal) have illegal content continually being pointed to, so why doesn't governments simply block ISPs hosting these websites?   ...   Google and DuckDuckGo might not directly index illegal webpages but fake websites that look legal act as portals to content...   So with all the computing power and AI does the western world have REAL issue with blocking ISPs or web servers hosting content?\n\nWas under the impression President Trump spoke to the Russian President on the subject trying to do something about illegal stuff...   Reading lips when officials speak to others officials on TV is really NOT that hard to do!",
				"added": 1590188672
			}
		],
		"1590076293_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 28,
				"body": "\"The FBI regularly weeds out anyone with intelligence.\"  That is actually a really funny sentence!\n\nJaywalkers, white nationalism, Arabs, intelligence, FBI, and blow themselves up ...  WOW! that will get EVERYONE to notice, could you also include something that would make you look more prone to violence!?",
				"added": 1590105724
			}
		],
		"1590015602_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 29,
				"body": "Zeronet does not seem to be growing!",
				"added": 1590105886
			},
			{
				"comment_id": 32,
				"body": "> [aassddff](#comment_57_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Seems to have stalled a bit.\n\nBeaker Browser almost seems a better solution!",
				"added": 1590187815
			}
		]
	},
	"comment_vote": {
		"2071_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx": 1,
		"8_17v2UBGNSMncMni3XDXFAJa8HtwGuEdQyB": 1,
		"463_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"53_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	}
}