{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 143,
	"comment": {
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 1,
				"body": "Very easy. The maniac should publicly buy an advertisement at an oldfashioned paper-newspaper and have the advertisement read: \n\nTimestamp by <name of the maniac>, SHA512 hash of the timestamped document file that has the size of <the file size> is: <the SHA512 hash of the file>. \n\nThe paper newspaper timestamps the hash and has the details about, who paid for the advertisement + the name in the advertisement. The rest assumes that the hash is \"secure\" enough that it is not possible to easily generate reasonable documents from that hash. Oh, and yes, the maniac should flash a huge A4 paper that has both, the hash of the document and the URL, which can be ZeroNet or IPFS or any other non-censorable network URL. The web page can then have the extra details about the paper-newspaper advertisement, like the name of the newspaper or newspapers, the date, when the advertisement has been published, etc. Libraries tend to have an obligation to archive paper newspapers.\n\nThat idea is also useful to non-maniacs. For example, timestamping logs, diaries. For example, the Trump meeting notes of the former FBI director, James Comey is a fine example, where the notes should be kept private until published, yet there is a need for proof that they were not written retroactively. To prove that the notes were not written before the events that they claim to describe, they should include citations from paper-newspapers of the time, when they were written, with proper academic references to the newspaper articles that are cited.\n\nA timestamping service may use the exact same idea by using the root hash of a Merkle tree in stead of the hash of the document. If You trust that banksters won't erase their records, then in stead of a paper-newspaper one may just create a money transfer of one cent or one dollar from one bank to another and add the newspaper advertisement text as the comment of the wire transfer. Both, the receiving bank and the sending bank log the transfer. You may want to choose the banks so that they are at jurisdiction of enemies, like one in China and another in U.S. or one in U.S. and another one in Russia.",
				"added": 1574419729
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1209_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): manifestos are for wankers\n\nWhat's wrong with masturbation? It's the feeling that matters, doesn't it?",
				"added": 1574421006
			},
			{
				"comment_id": 3,
				"body": "> [lightyagami](#comment_1_1B7S39qDssqWy7EJiKzhRboCyLGg2Auj4F): Command criminals to release the info at the appropriate time before they die of heart attack.\n\nMay be one way to get rid of the various street-shooters and cafe shooters is to offer anybody a free opportunity to go on a \"mission\" in Afghanistan or other such horrible place. That way the Police won't have to shoot or hunt them down. The maniacs can tell themselves that they'll get to the European cafes, _after_ the Afghanistan shootings, except that there is so much shooting to do in Afghanistan that even if they survive there, they will be too busy shooting the murderous Islamists to ever reach the European cafe phase. The U.S. army would also save some money and even supply the bullets, because that way they do not have to pay the mercenaries for slaughtering the Islamist religious nuts. A win-win for everybody.",
				"added": 1574421381
			}
		],
		"1574821349_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 4,
				"body": "You might ask Yourself, why are You complaining about that on ZeroNet in stead of complaining about that on Dat? My guess is, due to the technical reasons, the Dat \"failed to get traction\" even within techno-skillful hactivists like You. \n\nIn my view the main issue with the Dat is that unlike ZeroNet, it is very tightly coupled to a difficultly buildable tool, a custom fork of a web browser. Not only are web browsers difficult to build due to huge amount of dependencies, but anything that interacts with some GUI library (QT, GTK, etc.) is difficult to build, because often times specific versions of the libraries and the related tools are needed. If the Beakerbrowser were available from a Linux distribution standard package collection, then it would be another matter from an end-user installation perspective. Until that happens, the Beakerbrowser is pretty much a windows-Mac-only application and those are not the operating systems that the most active hactivists tend to use as their main operating systems. On the other hand, thanks to the \n\nhttps://docs.microsoft.com/en-us/windows/wsl/faq\n\nthe ZeroNet can run on both, Linux and Windows10. Another fundamental issue with all P2P-applications, including a modern (but horribly buggy) file sharing system like the \nhttps://www.tribler.org/\nis that they access the storage, where the downloaded files have been saved. Network traffic can be throttled, so network consumption of the P2P-systems is not that big of a problem, but disk access slows the workstation down quite a lot, not to mention that ZeroNet/FreeNET/Dat data takes a considerable amount of disk space.\n\nThe issue with the hashbase.io is that it is a central point of failure in the sense that supermafia/government may start to demand censorship from the party that runs the hashbase.io. If people are used to using the URLs that have the form of dat://<foo>.hashbase.io, then shutting down the hashbase.io or changing its data makes it possible to interrupt the use of the Dat.",
				"added": 1574836698
			}
		],
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 5,
				"body": "Humans differ from the rest of the animals mainly by SPENDING A LOT OF TIME ON PLAYING. Playing is a form of simulation, a form of mentally trying out different scenarios by trying to answer a lot of \"what if...\" questions. Games, including video games, become a problem, when they no longer give any learning experience, like when a gamer knows the game level already so well that it easily beats all the AI monsters in all possible variations. If there are other human players in the game, then they vary the game and change the same game level to a new learning experience. \n\nAll in all, it reduces to what develops the given player, human the most. If You play tetris or pong all day long, then You have to be mentally retarded or have dementia, but for the mentally retarded and demented people even that is a Good Thing. There are actually daycare facilities for the very old people, who have partly lost their memory and simplistic games like puzzles, basically small children games, help those people. For them tetris or pong might also be helpful. So, to say, \"games are Good/Bad\" would be too simplistic. Even chess can be dumb, if played without trying new things out.",
				"added": 1574837850
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_1360_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yes. A wall. I hope it's not true and would like to catch up with him, but these people had terrible parents, so it's not very doubtful that his mind would have fractured.\n\nWhat about child defense? In Europe children are forcingly taken to foster homes, if their parents abuse the children so badly that even a foster home is a better place than their original home.",
				"added": 1574985766
			}
		],
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": [
			{
				"comment_id": 6,
				"body": "> [goodafternoon](#comment_54_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): I wish Zites here had auto content deletion after a set date.\n\nDiscussion about that feature was seriously going on about years ago, about 2017, may be, if I'm remembering it correctly. All in all You do have the source code and You can make a fork for Yourself. May be make that feature optional, so that people can switch it in, when they want it and also determine the deletion decision making algorithm, which may be much more complex than just measuring time from the last local access. For example, You may want to host some zites for years, if they are  small and unpopular, but delete big and poorly hosted/seeded zites faster and host very well seeded zites just a week. You may want to place the decision making algorithm to a module, use the Strategy Design Pattern, so that people may switch Your algorithm for their own algorithm without changing anything at the core ZeroNet code of Your fork.",
				"added": 1574902246
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 7,
				"body": "Actually, if we look at how many stars there exists and that the planets, according to our current knowledge, IN THIS UNIVERSE, consists of the same chemical elements that are known at the periodic table of chemical elements\nhttps://www.ptable.com/\nthen plain mathematically there is a good chance that at some other galaxy there exists AT LEAST one other planet like Earth, with life forms that are based on some similar molecules. So, Earth is not that unique. Add to that the fact that in universe timeline even our solar system is not that old, stars form and they burn out, our own bodies might contain atoms that came to our solar system with some flying asteroid from some other blown-up solar system. After all, we're using the plants of the planet Earth Dinosaur era for traveling with airplanes and diesel trains and ships. \n\nAn interesting question might be, if a hydrogen atom consists of just one proton and one electron and all the rest of the basic chemical elements are synthesized with nuclear reactions, like a hydrogen bomb, in stars, then what might the series of events be to get from sparsely distributed hydrogen atoms to a solar system with that many different elements. The nucleus of a hydrogen atom can be seen as a very high frequency photon, a \"piece of light\". If You calculate the frequency/wavelength of such light by taking the hydrogen atom nucleus diameter as the wavelength and then using the \n\nphoton_energy = Planck_constant * frequency\n\nand then the Einstein's\n\nE=m*c^2\n\nwhere E is Energy, m is mass, c is the speed of light, getting\n\nm*c^2 = multiply(Planck_constant, frequency)\n\nthen You get a very close figure, what happens to be considered the mass of the hydrogen atom as measured by chemists. That is to say\n\nm_of_hydrongen_nucleus_as_a_photon = multiply(Planck_constant, frequency) / c*c\n\ndiffers from the m_of_hydrogen_nucleus_as_measured_by_chemists only by a factor of 5 or less. That is remarkably close, given that the Planck constant contains figures like 10^(some number bigger than 10).\n\nSo, are humans unique, worth to be saved? Well, once upon a time people thought that the Earth is the center and the Sun revolves around the Earth, not the other way around. We're just bugs, quite short-lived ones even as a species. Evolution will create new bugs after we die out. On the other hand, that does not mean that we should just lay back and live like dinosaurs, waiting for the next meteor to wipe out our species. \n\nMy guess is that just like the ape men evolved into us here, writing text on ZeroNet, the current homo sapiens will also evolve further, the idiots WILL BE LEFT BEHIND and the smarter ones will escape the dumb stuff that takes place in 2019 Syria or \"mainstream politics\". The idiots will stay on earth and the smarter bunch will find a way to colonize other planets in our Solar system and be totally self-sufficient there. That's probably the next huge step that will separate the idiots, the ones easily brainwashable by the current politicians, and the evolutionally smarter bunch. I do point out that it won't necessarily be the ones that currently have the most money, because not everything can be bought with money. Money is just one resource out of many, a computer game point sum for settling scores between people and as long as people specialize, they need to consult with each other and settle the score after the consultation service. Smarter people, often times freelancers, avoid having stupid clients, no matter how much money is offered. That is why just being rich or at the top of some hierarchy, king, dictator, president, leader of some party, will not be enough to get the truly good people to do the job for the rich or the party leadership. So, evolution will go on.\n\nBy the way, given that the radio signals travel from Earth to Mars in about 20 minutes, a solution like the ZeroNet is pretty much the only inter-planetary form of Internet that can work. I really like the statement of the creator of the FreeNET, the Ian Clarke, where he says, in the context of designing FreeNET, that THE MOST CRITICAL RESOURCE IS THE (required) RESOURCE THAT RUNS OUT FIRST. The same with money, \"human resources\", \"smarts\", you name it \n\n:-)",
				"added": 1574906146
			},
			{
				"comment_id": 8,
				"body": "> [goodafternoon](#comment_57_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): There sure is. Look at wolves, they create packs to increase the chance of survival. There would be an almighty few humans if we didn't need to cooperate to survive.\n\nIn the case of humans the cooperation comes from the need to specialize. A good software developer propably does not have the time, may be even the physical prerequisites, to be a good surgeon and You probably do not want some Hollywood movie star, super-singer, to write the code for Your heart pacer.",
				"added": 1574906899
			},
			{
				"comment_id": 11,
				"body": "> [randomshits](#comment_265_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The faster humanity goes extinct the better, maybe the next generation species will be able to move past their tribal nature and understand that one planet means one home.\n\nYour assumption seems to be that the next species is able to learn from the mistakes of the human species, but if the next species evolves from evolution like humans, it will probably also go through the same stupidities as humans have gone trough, with the exception of having different kind of environmental problems, because by that time the simple-to-get oil is probably all used up by the humans. I suspect that if human archaeologists wanted to see the remains of possible human-like generations that MIGHT have existed before humans, may be something near the dinosaur age, then they should look at the lime-stone layers of ocean sea bed, not just easy-to-dig dirt on land. The same with Mars archaeology: if any remains exist at all, then they are probably within the limestone or limestone-like layer, in stones that do not form from molten lava, but form at relatively cold temperatures under pressure, a lot like icebergs form from snow.",
				"added": 1574984368
			},
			{
				"comment_id": 12,
				"body": "> [randomshits](#comment_265_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The faster humanity goes extinct the better, maybe the next generation species will be able to move past their tribal nature and understand that one planet means one home.\n\nWell, You can speed that process up by killing Yourself and all Your loved ones. I wish that You DID NOT do that, but from Your logic point of view it is the rational thing to do.",
				"added": 1574984521
			},
			{
				"comment_id": 13,
				"body": "> [randomshits](#comment_265_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The faster humanity goes extinct the better, maybe the next generation species will be able to move past their tribal nature and understand that one planet means one home.\n\nTalking about being hopelessly selfish and not cooperating with other people around oneself, supposedly the word \"idiot\" comes from the word \"idiotis\"\n\nhttps://en.wiktionary.org/wiki/idiotis\nhttps://latin-dictionary.net/search/latin/idiota\n\nthat supposedly had a meaning of someone, who thought only of oneself and did not see the benefits of cooperation with others. The  \"idiota\" has also morfed, influenced words like \"idio-syncracy\"\n\nhttps://www.collinsdictionary.com/dictionary/english/idiosyncrasy\n\nWhat regards to the \"one-planet-one-home\" idea, then I hope that humans are able to colonize also other planets, making the \"one-planet-one-home\" idea extinct. On the other hand, I do not quite think that there will be much trade between planets in physical goods, because the travel time and the dangers that a cargo space-ship \"sinks\" on Earth like a meteorite. Factories will probably be local, work will be remote like is the modern case with software development and  medical data analysis and other consultation services.",
				"added": 1574985090
			},
			{
				"comment_id": 16,
				"body": "> [aspidochelone](#comment_270_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The force has its light side in love of people and principle and goodness and then there is the zombie-movie boy declaring \"I give you mercy\". Which do we need now? I am very much not sure.\n\nDepends on, whether You are suicidal or not. There is the aspect of respecting other people's right to make their own mistakes and suffer. Live and let live or at least let others live their non-parasitic life on their own without inhibiting their possibilities to live a non-parasitic life. People need cooperation, because they have to specialize. Suicidal people do not have that many needs and therefore they do not need the cooperation of other people. It would be stupid for a \"VIP\" to kill his or her own bodyguards, because the \"VIP\" has the need to live.",
				"added": 1575235103
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "Some people are more rebellious than others and it takes some rebellious attitude to go against the group, specially, when being in a minority. That's just basic psychology, regardless of the topic or decision. In the case of Christians or Islamists or other classical religions there are quite many stupidities that the group does and the atheist has to reject, so turning from a Christian to some atheist at some very Christian community takes quite a lot of actions that is different from the actions of the majority. On top of that,  regular partying or regularly taking part of big gatherings, including church gatherings, requires the person to be quite social. Social people tend to be deferential, tend to give in to group pressure. Hence the poor rate of loosing faith in the Christian religion.",
				"added": 1574927575
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 10,
				"body": "If You have money to burn and You are not a \"hacker type\", then I suggest\nhttps://www.bittium.com//secure-communications-connectivity/bittium-tough-mobile\n\nIt's a Finnish company, a lot like the Nokia was, except that in stead of young engineers it's engineering department is like a pre-retirement club.",
				"added": 1574982595
			}
		],
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": [
			{
				"comment_id": 15,
				"body": "Actually, ZeroNet is NOT the First. Historically FreeNET might qualify as the first by some criteria and back in the day, when people used phone lines for data connections and the phone companies lacked proper logging, the Usenet was de facto anonymous, because the logging of phone calls was that poor. It's kind of hard to imagine nowadays, but the Usenet, the same \"internet\" that the Linux kernel was supposedly first announced at, actually was truly anonymous, if people wanted to stay anonymous. The technical details:\n\nhttps://www.youtube.com/watch?v=4tHyZdtXULw\n\nIn addition to the Usenet \n\nhttps://en.wikipedia.org/wiki/Usenet\n\nthere's another archaic pone-internet called FidoNet\n\nhttps://www.fidonet.org/\n\nand somewhere at the history is also the \n\nhttps://en.wikipedia.org/wiki/Gopher_(protocol)\n\nAs time went on, the various logging capabilities of various parties, including the NSA and the phone companies, improved and there was the need for something like the \n\nhttps://www.torproject.org/\n\nToo long history to write it all down here, but long story short, there is quite a huge amount of academic papers about anonymous communication, also many P2P-projects, but the academics only create proofs of concepts that only demonstrate nice math and do not take to account the many real-life requirements. The academics say that they get grant money only for \"science\" and not \"engineering\", as if those 2 could be separated in a proper development project. The academics totally ignore the fact that it is the creation of practical things that furnishes the most interesting and may be also the most challenging questions for the theoretical study. The rest of the freedom-of-speech software projects tend to fail mainly because the people, who start them, lack the rigor to complete and polish the project properly. Often times the founders of the project are some hactivists, social warriors, artists, web-developers, not people with deep-technical background and patience. Without the Tor tunneling the ZeroNet is actually NOT anonymous, but the the ZeroNet is successful, because it is properly engineered, worked on patiently. The ZeroNet developers aim to develop usable software in stead of just slamming some emotional dirty hack together or writing academic papers for the sake of getting famous and thus more grant money. For example, the \n\nhttps://www.tribler.org/about.html\n\nproject team claims to have received over 3 million € for the development of the P2P file sharing software, the Tribler, and yet the project still has so horrible quality problems that people get better functionality by installing the old \"aMule\" from openSUSE Linux Packman package repository. Besides ZeroNet, Tor/TorBrowser and aMule there is one other project that seems to be capable of delivering:\n\nhttps://www.youtube.com/watch?v=pi-kreA52oI\nhttps://beakerbrowser.com/\nhttps://github.com/beakerbrowser/\n\nSo, ZeroNet is far from being the only one, but it is certainly among the most technically sound projects. A stellar example of a set of projects that are run by hactivists that just can't get their code properly done is the set of most popular projects at \n\nhttps://fediverse.party/\n\nFrom functionality point of view the Fediverse projects look pretty neat, except anonymity, but most of the people, who wrote the implementations, clearly did not invest much time on thinking about the dependencies of their projects or what it takes to port the projects not just between different operating systems, but from one Linux distribution to another. Let alone the installation of those projects. Also, as the Microsoft case demonstrates, spending a lot of money will not help with software quality. For me it is even hard to comprehend, what could all be done by proper open source developers for even just a fraction of the money that the Microsoft spends on its development teams and managers, specially the useless managers and I'm not even talking about Bill Gates level managers here. It's the reliability and quality of implementation that allowes the Tor to flourish and what allows the ZeroNet to outperform much better financed projects like the Tribler.",
				"added": 1575230218
			}
		],
		"1574292051_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 17,
				"body": "> [somuchfood](#comment_40_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): I like MLP myself, it's nice to watch something so colorful and gentle in a cruel black-and-grey world. But turning it into sexual thing is just pervertish\n\nAnd how does that comment differ from what the various popes of various religions have told for centuries: we the church tell You, how You must live and WE WILL JUDGE YOU, we will know, what is an ABSOLUTE RIGHT and ABSOLUTE WRONG. After all, if the pony likes it and enjoys it then it is certainly better than living a lonely pony life without any sex at all. For the pony the person might just be yet-another-sex-toy, a lot what people buy from sex shops. I guess it is kind of bold to work with ponies like that, but people do various mad things in the name of sexual pleasure and if the pony does not suffer and enjoys it, then what's the problem?",
				"added": 1575235824
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 18,
				"body": "Your best chance: buy an FPGA-board that has at least 1GiB of RAM. That's more than desktop computers had back in the days. A lot of work, but there are options:\n\nhttps://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&CategoryNo=166&No=740\n\nhttps://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&CategoryNo=167&No=1061\n\nThis one is about 200€:\nhttps://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&CategoryNo=167&No=1046\n\nYou might just buy some very old 386 laptop and make that work for You. For example, You may use some modern MCU for decoding MP3 or OGG music. You probably won't be able to play video with that device, but may be You'll figure out even how to do that. As long as You are not technically capable of fully auditing and building Your own system, You won't have any other options than just to BELIEVE what others say about some computer. If that's the case, then You're out of luck anyway. ",
				"added": 1575236213
			}
		],
		"1575211763_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM": [
			{
				"comment_id": 19,
				"body": "About 2MiB/s symmetrical.",
				"added": 1575236587
			}
		],
		"1575303702_1Ggn5eJwFKVHhjZq5D1kJuGpgqAkVuCTgy": [
			{
				"comment_id": 20,
				"body": "I guess the place of birth is not a choice. Being born to a place, where the neighbors are idiots or just dumb apes is a tragedy and the only ways to deal with this that I'm currently aware of are:\n\nx) Become a dictator and force Your will on them; (Side-effects are that there's quite a fierce competition to that position.)\nx) try to get by covertly, like gays with gay sex in Iran; \nx) emigrate, work Your way out of the dump;\n\nSteganography might help with the covert option, but one thing that You MUST NOT do is to believe that some technology provides anonymity without You THOROUGHLY understanding the technology. That is to say, unless You have proper technical background in Informatics or math or physics or some other technical field, where university level mathematics is essential, You won't have a chance at using the covert option even, if some \"tech support\" handed You a black box that is able get You Western Internet without the local Chinese or Iranian authorities ever knowing about it. The problem is that anonymity takes more than just technical capability to exchange information without being identified. That's where the math and other skills come to play, in addition to the technical side.",
				"added": 1575355595
			}
		],
		"1575771811_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 21,
				"body": "> [maho911](#comment_13_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3): \"Most jobs are artificial and useless and exist just to distribute money and control people\"\n\nI think that holds for \"Government Jobs\". In the private sector You can kind of opt out of the rat race, work remotely from a place that does not have \"realestate tax\" and has relatively cheap food and good internet connections. Just keep in mind that the doctors that work long hours patching You up, when You have a car accident, cancer or other health problems, should not work as Your slaves either.",
				"added": 1575795726
			}
		],
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 22,
				"body": "> [1bfqutudhtexlka](#comment_105_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): i think what happened in idiocracy movie is happening right now on internet , everything is getting stupider\n\nI suggest to look at the situation from mathematical point of view. Back in the day using even some basic Internet tools was for the technical elite of the society, as is always the case with new tech. The marketers have even a special term for those people: \"early adopters\". Those tend to be the brightest part of the planet Earth population, as they are always looking for improvements, a lot like scientists do. So, as the Internet becomes more widely used, the \"average\" has to become stupider, a lot like was the case with the \"paper-internet\", generally referred to as \"books\": philosophy, top-notch propaganda(\"Bible\"), poetry, math, were the first entries to the then-mainstream \"paper-internet\". Fast forward to 21. century and there's the \"50 shades of gray\" and other nonsense and IT IS NOT A BAD THING that the population as a whole adopts new technologies. It's just that the smarter bunch has to learn new ways, how to navigate the, citing from the Matrinx: \"Sea of information.\" An example, how the Best of the Internet has become better, is the online availability of university lectures and scientific papers and astronomy measurements data, biology data. \n\nUse those awesome online datasets that the cutting edge scientists use in stead of wasting Your time on some stupid mainstream TV. Reading children's books as a mentally developed adult is certainly mental torture and obviously induces depression. Just, get Yourself the proper material in stead of the nonsense. For example, I do not even have a TV at home, I get everything from internet. Just, come to Your senses and understand that one does not like all people in-real-life and there is absolutely no reason to like all stuff that those other people produce, be it books, movies, web sites, You name it. \n\nI understand that the term, \"go fuck Yourself\", is a derogatory term, but masturbation can be refreshing, if done about  once in 3  days, specially at a shower after jogging. Have a good night sleep, run a little at Your own pace, eat something healthy and tasty and DO NOT WASTE YOUR TIME on \"children's books\". \n\nRegards,\nMe",
				"added": 1575796954
			},
			{
				"comment_id": 23,
				"body": "> [port220irq5dma1](#comment_48_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): Oh right, and another journalist shoved a Nintendo Switch joycon in their butt and wrote about an article about it.\n\nWhere's the porn video link to that? I'd love to see a chick riding a game console joystick! At some point the gaming consoles are so archaic technology that \"riding joysticks\" is about the main way to rank them, specially if the joysticks have a vibrating haptic feedback, like the real ones at planes sometimes have. \n\n:-D",
				"added": 1575797412
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 24,
				"body": "> [thorburn](#comment_15_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Pron will be the last area of content that will become the target of real censorship. \n\nHave You heard of the Arab countries? How about the Japanese and South-Korean blurring of genitals? What regards to the argument that porn clips are not free speech, then I guess obscene or just sexually explicit scenes can be described with words. That's what the romantic stories, sexual fantasy stories are about. All in all, it is the responsibility of an end user to use a personalized spam filter to cope with the challenges. Totally non-sexual, but just dull, postings can also be classified ass spam and it is the job of some personalized AI-agent to sort out the gems from the spam and otherwise noise. The problem is the lack of tools that allow to sort the posts of any compatible forum.",
				"added": 1575798586
			}
		],
		"1575718980_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 25,
				"body": "Some references for Your study:\n\nhttps://theintercept.com/a-conversation-about-privacy/\nhttps://gizmodo.com/google-complies-with-russian-order-to-take-down-opposit-1828921301\nhttps://motherboard.vice.com/read/two-months-of-internet-blackouts-have-taken-a-toll-on-kashmir\nhttps://www.accessnow.org/dispatches-internet-shutdown-togo/\nhttps://www.theguardian.com/world/2013/jul/11/microsoft-nsa-collaboration-user-data\nhttp://motherboard.vice.com/read/gabon-internet-censorship-election-outage\nhttps://theintercept.com/2016/10/18/ecuador-cuts-internet-access-julian-assange-preserve-neutrality-us-election/\nhttp://nation.com.pk/26-Nov-2017/the-issue-of-social-media-networking\nhttps://freedomhouse.org/report/freedom-net/2015/kazakhstan\nhttps://www.timesofisrael.com/eu-to-give-internet-firms-only-one-hours-notice-to-remove-extremist-content/\nhttps://netblocks.org/\nhttps://opennet.net/\nhttps://rsf.org/en/ranking\nhttps://www.youtube.com/channel/UCEEG3TegPQTdijHuB-eohbw\n\nBrainwashing tested on the unpopular:\nhttps://www.wired.com/2016/09/googles-clever-plan-stop-aspiring-isis-recruits/\n\n\nA cave in by the Telegram.org:\nhttps://twitter.com/durov/status/947179988213624832\n\nI hope that it helps. Have \"fun\"!",
				"added": 1575805135
			}
		],
		"1575602137_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "I guess that the founder of the Facebook is also a millennial. I also guess that the younger generations tend to have higher IQ than the older ones simply due  to the better access to information.",
				"added": 1575805998
			}
		],
		"1575934078_17Rg8CLQRG4yunSTcbWFn5gFqgfVHPVCPf": [
			{
				"comment_id": 27,
				"body": "Please keep in mind that the ZeroNet is anonymous ONLY, IF TUNNELED THROUGH TOR. May be it is not enough to tunnel the ZeroNet through tor, but if DNS-services are not used, id est a ZeroNet page does not contain any images that link to plain-web-domains, like \n\n    https://www.somedomain.com/someimage.jpeg\n\nthen the following might be sufficient on Linux:\n\n    nice -n5 tor & # runs the tor node in the background at lower priority to save some CPU-time for the web browser\n    nice -n10 torsocks  <the rest of the command line that usually starts ZeroNet>\n\nIn general, congratulations for getting the ZeroNet node to run and Welcome to the proper wild-wild-web!\n\nYou may also want to try out the \nhttps://beakerbrowser.com/",
				"added": 1575955913
			}
		],
		"1575692981_1EECPRXzpW95MYpBZUTLd47TofKW9xGC9e": [
			{
				"comment_id": 28,
				"body": "I think that You should really try to sell Yourself more here. People have read too many \"get-guick-rich-by-paying-us-an-initiation-fee-of-X\" spam letters and do not have time to waste on such hazy proposals. At least the smart(er) ones do not waste their time on that.",
				"added": 1575962151
			}
		],
		"1575858185_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 29,
				"body": "Do not forget that the ZeroNet does NOT provide anonymity, unless tunneled through Tor. For non-anonymous options, let's say, in a situation, where You use some VPN to some western countries for all of Your internet traffic, You may also try out the \nhttps://beakerbrowser.com/",
				"added": 1575962240
			}
		],
		"1575865745_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": [
			{
				"comment_id": 30,
				"body": "May be a belief in some philosophy might qualify as a religion? You may want to try out \"capitalist anarchists\"/\"anarcho-capitalists\"/\"anacaps\". You'll probably get some contacts from the various\nhttps://openbazaar.org/\ncommunication channels.",
				"added": 1575962591
			}
		],
		"1575869098_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8": [
			{
				"comment_id": 31,
				"body": "Welcome, but expect new tools to take some time to learn. Including the ZeroNet.\n\nYou may think of the ZeroNet as a collection of ordinary Microsoft Word or LibreOffice document files that are shared on LAN and edited collectively, except that in stead of a Microsoft Word or LibreOffice specific composite file format the document file is a folder with HTML and some ZeroNet specific text files. Those \"document files\", actually folders, reside at\n\n    <ZeroNet isntallation folder>/data\n\nA ZeroNet forum, like this one, is just one collectively editable document, where the individual blog posts are distributed over the P2P-network as separate data chunks and aligned in a row locally. For example, if You post to a ZeroNet forum while flying above clouds with no internet connection, then Your forum posts are sent to the network after landing, when Your laptop has internet connection again. The rights management is handled by public key cryptography and the private keys of a ZeroNet node owner are held at \n\n    <ZeroNet isntallation folder>/data/users.json\n\nThat's the file You need to back up to avoid loosing Your identity on ZeroNet. Although the ZeroNet does not provide anonymity without being tunneled through Tor (as of 2019_12 it is NOT tunneled through Tor by default), it is highly recommended to use multiple identities to confuse search engines. One way to generate multiple identities is to stop the ZeroNet node, move the users.json away from the data folder and restart the ZeroNet node. To swap an identity, stop the ZeroNet node, swap the users.json, start the ZeroNet node.\n\nThe ZeroNet has been developed by ThePirateBay as a response to the takedown of their server cluster. A very similar solution, but with different motivations, has been created by the developers of the \nhttps://beakerbrowser.com/\nThe core of the Beakerbrowser is the \nhttps://github.com/datproject/docs/blob/master/papers/dat-paper.pdf\nIn my opinion the ZeroNet as a technology is architecturally more sound than the Beakerbrowser, because it can be used with any mainstream web browser without having to meet the operating system and CPU specific dependencies of a custom web browser. What makes the compilation of a web browser extremely hard is that in addition to the operating system specific API changes, specially at the 3D acceleration side (think of WebGL), the list of dependencies includes the various release version specific versions of build tools that are needed for compiling both, the web browser and its dependencies. However, the Beakerbrowser does have fancier desktop integration at the expense of future availability and portability. For example, the ZeroNet node can be run on a Linux machine that does not have any GUI/X11 installed by tunneling the 127.0.0.1:43110 over an SSH connection, but as of 2019_12 I'm not sure, if something like that can be easily done with the Dat/Beakerbrowser tools.",
				"added": 1575963800
			}
		],
		"1575800810_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": [
			{
				"comment_id": 32,
				"body": "I'm not sure, if a PC/x86/AMD64 can be made like that, but if You just want to give a hell of a lot of computing power to A SINGLE OPERATING SYSTEM PROCESS, then that can be done by using some extra compute cards/accelerator cards or by manufacturing Your own accelerator card and if You have the skills, then You might even get a way with as little as 5k€ budget. For example, You might want to create a custom board with multiple \nhttps://www.parallella.org/\nchips. Or, You might also just buy a few hundred RISC-V SoC's\nhttps://www.sifive.com/\nor OpenRISC SoC's\nhttps://openrisc.io/\n\nI think that You need to keep in mind is that the speed of light, the speed of electrical signals, is finite, which means that it takes time for data to move from one CPU to another, from RAM to CPU, REGARDLESS OF HOW FAST THE CPU IS. Another thing to consider is the Amdahl's law, which basically says that if a program consists of sequential parts like\n\n    my_program(){\n        function_foo_1() // takes t1 time units to execute on a single core\n        function_foo_2() // takes t2 time units to execute on a single core\n        function_foo_3() // takes t3 time units to execute on a single core\n    } // the end of my_program\n\nand the function_foo_2() can NOT be parallelized while the function_foo_1() and the function_foo_3() can be infinitely parallelized, id est run in parallel on infinitely many CPU-cores, then even with infinitely many CPU-cores available, the time that it takes to execute the my_program() is still\n\n    (t1/infinitely_huge_number) + t2 + (t3/infinitely_huge_number) = 0 + t2 + 0 = t2\n\nbecause if the function_foo_2() can not be parallelized, id est it executes just on a single core, the rest of the cores, the infinite number of them, are useless during the execution of the function_foo_2(). Whether some function_foo_X can be parallelized, even the extent that it can be parallelized, depends on the algorithms. For example, write operations into a central \"database\" (think of Your bank account, there's just one live record of it in the bank) are fundamentally sequential. There is data parallelism, id est images can be processed in parallel, bank transfers of different persons can be done in parallel (to a certain extent, with some limitations), but often times there are still some sequential operations. For example, file writes and reads through one read-write head of a magnetic HDD are fundamentally sequential, despite the efforts of the operating system to try to cache the files in RAM to make the read-write operations appear as if they were parallel.\n\nIf You are doing crypto-mining, then You may want to look at the different FPGA options.\nhttps://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&CategoryNo=13&List=Simple\nYou may want to start with the FPGAs that are supported by the \nhttp://www.clifford.at/icestorm/\n\nIf You are more into software, then You may want to learn a new programming language, an autoparallelizing C++ replacement, ParaSail:\n\nhttps://groups.google.com/forum/#!forum/parasail-programming-language\nhttp://www.parasail-lang.org/\n\nIf You are not necessarily into the raw performance, just want to experiment with interesting parallel architectures, then a thing to consider might be a microcontroller that has Forth cores:\nhttp://www.greenarraychips.com/\nIn the end it's still the speed of light and the time it takes for the transistors to switch that matters. The architecture, be it a classical RAM-machine (read: all classical CPUs with registers that do not have to be on the chip itself from theory of computation point of view, just the ability to address bytes at RAM is enough from theoretical point of view) or some \"stack machine\" or some FPGA is just an optimization hack, as are CPU caches, branch prediction, SIMD-instructions, vector-architecture, etc. Architecture, the speed optimization hacks, are important in practice, but irrelevant from theory of computation point of view. Actually, just for fun, You do not even need any extra hardware. For intellectual experimentation You may just write a simulator, may be in C++ using OpenMP. One silly, but impressive, idea that has been implemented was to write a program for a tiny, slow-as-hell, MCU and that program simulates the operation of a more advanced CPU that has (simulated) memory management unit and then the Linux operating system has been (cross-)compiled for and booted on that simulated CPU:\nhttp://dmitry.gr/index.php?r=05.Projects&proj=07.+Linux+on+8bit\n\n",
				"added": 1575967085
			}
		],
		"1575869182_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8": [
			{
				"comment_id": 33,
				"body": "I have an introductory explanation, how the ZeroNet works, at \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1575869098_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8/This+has+a+steep+learning+curve",
				"added": 1576081690
			}
		],
		"1575905196_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": [
			{
				"comment_id": 34,
				"body": "Yeah, just let some random site get its code right to the kernel space in stead of getting that security critical code from the original, upstream, sources. I guess someone must be stupid enough to use those kinds of services.",
				"added": 1576081953
			}
		],
		"1576021462_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP": [
			{
				"comment_id": 35,
				"body": "The short answer is: NO.\n\nFirst, define internet? There are the P2P-networks like the ZeroNet, I2P, etc. and then there is the censored clear-net. Basically there are 3 things at play: the web page as a data set, the computer that has the data set and the data transmission connection between the comuter with the dataset and the computer that the human uses as a workstation/terminal. The idea behind the ZeroNet and FreeNET is that the document, the \"site\"/zite is just passed around from computer to computer and if some connections between computers break, then some other computer that can be still connected to might have the document and serve it. The idea behind the classical censored-net and the Tor services is that the data, the \"site\"/\"zite\" stays at the \"server\" and in order to see the web_page/\"site\"/\"zite\", the workstation has to be able to connect to the computer that has the data_set/\"site\"/\"zite\"/web_page.\n\nA more detailed description of the ZeroNet architecture is at my comment at\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1575869098_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8/This+has+a+steep+learning+curve\n\nWhat You want in the case of a classical internet blackout, at the situation, where the Government has turned off connections to clear-net outside of its controlled territory is a \"mesh network\": an a separate data transmission channel that forms from cellphones that send data to each other without using the phone company cellphone towers. The network that forms from cellphones can then be combined with satellite phones and that gives a totally independent network. There are privacy issues and \"operational security\" issues with that, id est the people setting it up will probably be killed or tortured or at least imprisoned by the repressive Government, but that is the technical solution and if the mesh network builders have proper technical background, then they can take some precautions to not get caught. Setting up a proper mesh network is NOT something that some journalists or non-technical activists can do without getting caught. But, it is doable. Some mesh network related references:\n\n\nhttps://www.open-mesh.org/projects/open-mesh/wiki\nhttp://servalproject.org/\nhttps://piratebox.cc/faq\nhttps://project-byzantium.org/\nhttps://freedombone.net/\nhttps://guifi.net/en/node/38392\n\nhttps://commotionwireless.net/\nhttps://github.com/opentechinstitute/commotion-meshbook\n\nhttps://github.com/ProjectSPAN\nhttp://netsukuku.freaknet.org/\n\nAlternatively You may resort to pre-IPvX-internet era technologies that use plain phone lines and oldschool modems, with the hope that the repressive Government only switches off the classical internet and not voice phone system. The oldschool technologies are:\n\nFidoNet:\nhttps://www.fidonet.org/\nhttp://ftsc.org/\n\nUsenet:\nhttps://en.wikipedia.org/wiki/Usenet",
				"added": 1576188144
			}
		],
		"1576265919_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "All radio connections have the problem that unless directed antennae are used at the receiver and there is a direct line of sight (fog is OK) from the receiver to the transmitter, the receivers are all vulnerable too radio jamming. Jamming also works, when the jammer transmitter resides right at the line of sight of the receiver directed antenna.\n\nWhat regards to transmitters, the way I understand, the U.S. army killed people in Iraq and Afghanistan according to their cell phone movement patterns and the independence warrior Dudayev got killed by the Russian army by locating his satellite phone.\n\nhttps://en.wikipedia.org/wiki/Dzhokhar_Dudayev\n\nYou may want to use laser links instead and keep the transmissions at short distances, like from house to house, ~40m maximum, for both, reliability and security. For longer distances You may try to use the power line modems.\nhttps://en.wikipedia.org/wiki/Power-line_communication\n",
				"added": 1576329163
			}
		],
		"1576291196_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 37,
				"body": "But that's a Good Thing that the American EMPIRE is dying. One empire less, at least 2 more to go (China, Russia).",
				"added": 1576329519
			},
			{
				"comment_id": 47,
				"body": "> [z3n5if](#comment_122_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): America isn't an empire.\n> Stop shitposting your manga ideas you WEEB\n\nDefine empire? One definition of an empire is that it is a state that causes regime change at other regions, with any means, including military means, and has satellite state, protectorates. Have You heard of U.S. troops permanently stationed in Germany and Japan and South-Korea and Poland and Italy and Africa and .... That is how the protectorate game is played.\n\nCan You name any state from the history of the human race that has its armies permanently pre-stationed all around the planet? The Roman empire did not get even close. Neither did the various Chinese empires, the current one that tries to cause regime change in Hong-Kong, included. The Soviet Union was close, but not as powerful as the modern U.S.",
				"added": 1576343103
			},
			{
				"comment_id": 58,
				"body": "> [z3n5if](#comment_124_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): The US is not a monarchy, we are a republic.\n\nAccording to Your definition the Soviet Union was not an empire. I disagree. NATO or no NATO, protectorates always choose the party to whom they prefer to pay taxes. Not all taxation is in the form of direct payment. Profit opportunities can pay far more than direct tax payments. Think of the Google and Facebook sales outside of the U.S. and the Washington gets the taxes from U.S. companies even when they sell overseas. That's why the Brussels, the EU, wants to invent a new tax to get some of that money that currently goes to the U.S. companies and increases Washington tax revenue, to themselves. Can Google and Facebook sell their advertisement services to Russia? Not quite. Google does bow to China, making a censored version of their search engine to be able to participate at the Chinese market, but Facebook is totally left out. The IT-giants are not the only examples, but add to the list the desktop and laptop CPU manufacturers, the Intel and the AMD, and even just the IT-sector benefits in great lengths.\n\nYes, I do say that an empire does NOT need to be a monarchy. I'm not even totally sure, if all empires are \"bad\", specially if we look at how awful the Saddam Hussein regime was, id est even if the Iraq war premises were a total lie from the very start, the outcome, the fall of the Saddam Hussein, was pretty neat, except the nasty civil war there, but the civil war could have been averted if the Pentagon and the Bush administration had done its homework properly in stead of being totally UNPREPARED for the period after the war is won. What regards to the fact that the U.S. pays for NATO and the Europeans just piggyback on the U.S. then as an European benefiting from the NATO I say that it is UNFAIR towards Americans. The country, where I live, does pay the required % of GDP to the NATO budget, but still, there are so many things that the U.S. could do to help Americans with just the fraction of the money that they pay to NATO (think of health-care, but not only that), that it is a total shame that the Europeans do not get their act together and cover the military part themselves. I think that the Trump said it really correctly, when he said it directly to the German minister's face that why do we, the U.S. have to pay for Your protection, when You pay to the Russians by buying gas from them through a brand new, HUGE, gas-pipe-line, the NordStream, and use the gas-sales profits for building the Russian army?\n\nOn the other hand, as bad and unfair as it is towards ordinary Americans, I do not think that the Germany has paid much reparations to the U.S. for the 2. World War. The U.S. took quite a hit, economically and human life wise, when it had to reorient its industry to war production during the 2. World War. I do NOT live in Germany. I'm NOT a German. But, from practical point of view, keeping U.S. troops in Germany to let the Germans get away without having their own army can be cheaper than having a WW3 with the modern German neonazis. Besides, if the Germany as a protectorate pays for it in the form of indirect taxation, then monetarily it can be even profitable for the U.S.. So, it's kind of, not that black and white. It would be nice, if the Europeans got their act together, but may be the case is so bad that the following anecdotal saying holds: \n\n    The purpose of the NATO is to keep Americans in, Germans down and Russians out.\n\nSecondly, may be money is not always even the best measure. For example, the U.S. Pentagon has a lot of money, and yet, if You look at some of the presentations at the C.S.I.S. think-tank, it turns out that the DARPA organizes the development of new weapons systems that even pass the Pentagon's own acceptance tests and the new weapons are NOT taken to use not due to lack of money, but because the U.S. soldiers are so lazy that they do not care to learn to use new tools, new weapon systems. This is where some smaller protectorates might be able to offer something that the Pentagon is not able to get regardless of the availability of money: the smaller protectorates can be the first testers of the new weapons so that the U.S. commanders would start to trust the new weapons and see the practical value of the new weapons. Basically, the small protectorate native armies can be guinea pigs for many things. You can't buy that with money, not even from African tribes, because the African tribes are not good specimen for such tests. A similar example was the space race between the U.S. and the Soviet Union, where the Soviet Union spent far less money and out-achieved the U.S. in many technological areas, specially rocket engine efficiency and automation. The Kremlin propaganda likes to speak about satellites, but the actual stark contrast that hardly anybody mentions is that in 1986 the score was this:\n\n    Soviet Union side: \n        The very first 100% autonomous space shuttle flight from launch to landing. The Buran. \n        AUTONOMOUS LANDING, not radio controlled like the modern U.S. drones are at landing.\n    U.S. side: \n        Space Shuttle Challenger disaster, all crew killed.\n\nI personally do NOT believe that business wise the Russia ever has any chance to match the West unless their culture changes at grass roots level in a direction, where people do not adhere strictly to hierarchy. The Russian Czar can inhibit the Russian culture from becoming, not necessarily more western, but rather, less hierarchical, but no Czar can ever order the ordinary Russians to suddenly stop adhering extensively to hierarchies. That's a grass-roots-problem, not something that the Kremlin has the capability to order or demand. On the other hand it also means that Russian army will have weapons on par with those of the West while paying far less for them, validating the idea that money is not necessarily an exact measure, when it comes to evaluating military capabilities. As long as Russians love hierarchy, Russia stays a dump, no matter who the Czar is. Washington is afraid of the China, but rest assured: the stricter the control of the Chinese government over its population becomes, the shoddier the Chinese economy will become and the \"Chinese economic miracle\" will simply be over. China will be a considerable military opponent to the U.S., but the love of hierarchy will limits its intellectuals from pointing out the flaws in the Chinese system, corruption is a natural part of hierarchical systems and the corruption will then ruin the business environment at macro scale despite the fact that some oligarchs get filthy rich. So, no worries, let the Chinese dragon start eating its tail, the \"tail end of its society\", the lower ranks that do not fit to the list of corrupt oligarchs.",
				"added": 1576795317
			}
		],
		"1576213773_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 38,
				"body": "> [thetruth](#comment_7_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): It's all in hidden symbols and signs.\n\nWhy hidden? The U.S. intelligence services and Pentagon kill people in broad daylight and say that it's just \"collateral damage\" or a \"mistake\".\nhttps://www.youtube.com/watch?v=I5Qi5QmNhTk",
				"added": 1576329678
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 39,
				"body": ">...\n>No further serious IT Development is carried out,\n>...\n\nAnd is there something particular that stops YOU from carrying out the \"serious IT Development\"? Where do You think the ZeroNet and the \"monster borowser\" that You currently use, came from? The ZeroNet uses HTML, JavaScript, CSS, many other things for creating the GUI.\n\n>...\n> There's nothing Valid and 'INTERESTING in it ANYMORE'.\n>...\n\nIf You think that all those university lecture videos, open scientific data, scientific papers, technical documentation does not interest You, then may be You are just mentally not up for the challenge. Go, do drugs then, drink ethanol or other substances. Smoke weed. Your choice.",
				"added": 1576329968
			},
			{
				"comment_id": 51,
				"body": "> [bwcolor](#comment_6_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU): in my opinion the big corporation of the net ruined all (google, facebook, etc...) by censor people (filter bubbles) that \n\nThe key phrase that You may want to study is \"regulatory capture\". Here's one intro to it, at the 2. halve of the video.\nhttps://www.minds.com/media/933054962130989056",
				"added": 1576534217
			},
			{
				"comment_id": 62,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1342_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Yes christians are the worst braindead \"of all the pack of Religious\". \n\nWrong. The Christians are brain-dead alright, but the 1. place still goes to the Islamists, specially the ones blowing up the trade center, raping children in Afghanistan, hanging gays, mistreating women. Protesters are literally executed by chopping their heads of with swords in Saudi Arabia. The Christians, well, they have to accept the honorable 2. place. I'm not sure, who gets the 3. place. May be the neonazis get the 3. place.",
				"added": 1576872957
			}
		],
		"1576294690_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 40,
				"body": "That's very subjective. Obviously a good fucker is a must. Not just good for me,  but she has to know, what she self likes and go for it. Apart from that, the question comes down do, what do I like in a really good companion that I can sincerely respect and trust. I emphasize that trust has multiple dimensions: trust the intentions of another person versus trust in the abilities of another person. Good intentions but lack of abilities can give a very bad outcome.",
				"added": 1576330245
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 41,
				"body": "And who chooses the \"chosen idiots\"?",
				"added": 1576330343
			}
		],
		"1576322123_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 42,
				"body": "I do not know about the Lokinet, but the ZeroNet's security is just fine, if used with Tor. There is a risk that a zite includes an image with a clear-net URL, which then reveals the IP-address of the viewer, but if the viewer directs all traffic through Tor, then that shouldn't be a problem either. \n\nThe fundamental issue with ZeroNet security is that if its traffic is tunneled through any anonymization network, then the P2P based efficiency of ZeroNet diminishes. The original legal scheme for the ZeroNet was that if a lot of people serve pirated content, then the Police runs out of resources at jailing everybody. ZeroNet was NOT designed for use by small, niche, groups. Nor is ZeroNet a secure communication application. It was never meant to be one. Besides, even, if ZeroNet were properly secure, the linguistic analysis would reveal the original author anyway. That's also the reason, why it is not possible to use one's own malware for \"shady activities\" and why the NoSuchAgency and such mix-and-match opposing team's code to their malware and publish their own malware so that the other team could use it, allowing the original authors of the malware also to start using their own malware.",
				"added": 1576330928
			},
			{
				"comment_id": 43,
				"body": "I just took a look at the lokinet.org. The way I see it, the reason, why the classical HTML and www took over the world and initially from feature set point of view at least as good or superior solutions like the \nhttps://en.wikipedia.org/wiki/HyperCard\nand the \nhttps://en.wikipedia.org/wiki/Gopher_(protocol)\nfailed, is that the HTML was NON-proprietary, but the Gopehr owner, a university, and the Apple wanted to stay in coltrol a lot like the Microsoft stays in control of the Microsoft Word. The case with the Loki is that in order to get access to the Loki P2P-publishing-network, a ZeroNet analogue, the users have to pay/earn crypto-coins, a \"governance fee\". Basically, the Loki is a classical business project that enforces its revenue gathering through crypto-coin technology and therefore does not need to keep the source code proprietary. Only the \"governance fee\" gathering secret keys are kept secret by the business project runners. That makes the Loki a typical \"closed\" business project, NOT AN OPEN TECHNOLOGY, despite the fact that their source code is properly open source. May be the founders of the Loki project had good intentions, but they certainly FAILED to learn from history.",
				"added": 1576332565
			},
			{
				"comment_id": 44,
				"body": "I just took a look at the lokinet.org. The way I see it, the reason, why the classical HTML and www took over the world and initially from feature set point of view at least as good or superior solutions like the\n\nhttps://en.wikipedia.org/wiki/HyperCardand \n\nand the\n\nhttps://en.wikipedia.org/wiki/Gopher_(protocol)\n\nfailed, is that the HTML was NON-proprietary, but the Gopehr owner, a university, and the Apple wanted to stay in coltrol a lot like the Microsoft stays in control of the Microsoft Word. The case with the Loki is that in order to get access to the Loki P2P-publishing-network, a ZeroNet analogue, the users have to pay/earn crypto-coins, a \"governance fee\". Basically, the Loki is a classical business project that enforces its revenue gathering through crypto-coin technology and therefore does not need to keep the source code proprietary. Only the \"governance fee\" gathering secret keys are kept secret by the business project runners. That makes the Loki a typical \"closed\" business project, NOT AN OPEN TECHNOLOGY, despite the fact that their source code is properly open source. May be the founders of the Loki project had good intentions, but they certainly FAILED TO LEARN FROM HISTORY.\n\nAnother failure example, with quite sleezy characters in my opinion, is the MaidSafe P2P-storage project.\nhttps://www.maidsafe.net/\nThe MaidSafe project has been \"gathering momentum\" for years, and yet, people are not stupid enough to lock themselves into such a crypto-proprietary scam, despite the properly open sourced software. ZeroNet, on the other hand, is like the early HTML: it has its flaws, but it is properly open.",
				"added": 1576332805
			},
			{
				"comment_id": 46,
				"body": "> [lianna](#comment_78_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I was able to set up a hidden service without paying any crypto, so I don't know what part of the documentation you got stuck on.\n\nStart with the main page, where they talk about \"governance fee\". There are no free lunches, even if the setup is smooth. Besides, the GMail is also \"free\". No visible fees for the end users.",
				"added": 1576342690
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 45,
				"body": "May be the way to think is, what kind of other features, in addition to the cookies, browser developers can add to the mainstream browser to make browsing the network even less private and make everyone pay Google, Facebook, Microsoft even when not directly using any of their servers.\n\nObviously the cookie-nag-screens are an absurd, bad, joke from Brussels, but I haven't noticed any actual web browser developers doing anything about it. For example, if all people turned off all of the cookie support, then nobody could use cookies and if cookies do not work, the nag screens would not be necessary, because the sites would be done without using any cookies.\n\nIf You guys in the U.S. do not like the cookie-nag-screens, then switch off cookies in Chrome and Mozilla. For some reason the \"so privacy aware\" Mozilla Corporation does not want to do that while being perfectly aware, what businesses do with their cookie support. I do point out that modern browsers also have a built-in database that has \"site origin\" limits, meaning, a page from one domain at one tab can communicate with a JavaScript at another tab, as long as the page at the other tab originates from the same domain. The database is persistent, id est if the browser is closed, the data will be available at the next startup of the browser, provided that the browser cache did not get emptied. That is to say, user experience wise there is NO NEED FOR COOKIES. Cookies are used at modern web sites only for tracking. All the rest, the functionality that the end users care about, can be done with other means, without cookies.",
				"added": 1576335558
			}
		],
		"1576109125_1AdBxG5bzX9cwPgGCJBvkSAL3dWkjHbCyS": [
			{
				"comment_id": 48,
				"body": "The YouTube is censored anyway, so do not bother. Talking about videos, You may want to take a look at one censored web video search engine:\n\nhttps://blogs.harvard.edu/blockchain/petey-vid-a-video-search-engine-tool-that-focuses-on-privacy/\nhttps://www.peteyvid.com/",
				"added": 1576343725
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 49,
				"body": "> [robione](#comment_343_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Having less to say comes from wisdom.\n\nThe wisdom might be that there is so much to say that there is absolutely no way to tell it all without writing a book, so the wise men write books. That's where they _say_ things.\n\n> [reichardnixon](#comment_74_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): So people like you can ask stupid questions like that without being censored. Also, fuck niggers. See im not banned either. Isnt this great?\n\nIndeed. Niggers can be very sexy, a true joy to fuck.\n\n> [peppefail](#comment_6_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): This is a decentralized platform. There is no administration, no central server, nobody that can ban you\n\nActually, if the internet connections are taken down, like tends to be the case at regions run by dictatorships or otherwise extra authoritarian regimes, then that's pretty much a ban to all networks, including ZeroNet. So it is possible to ban You, Me, whomever. A countermeasure to that is a MESH network. Too long story to say here, but I have a little bit more details about MESH networks at\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1576021462_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP/Can+ZeroNet+help+to+access+internet+during+blackout+internet",
				"added": 1576344032
			}
		],
		"1576431661_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 50,
				"body": "The Tribler is a nice idea, but ITS IMPLEMENTATION IS CRAP!\n\nTo be more precise, the project has had literally over 3 million EUR funding and the developers ARE LOOSERS THAT CAN NOT DELIVER DESPITE THE MONEY PILE. You may read the details from \nhttps://github.com/Tribler/tribler/issues/4905",
				"added": 1576533466
			}
		],
		"1576768836_1Tr8KpfPw9HXit4dC5U6Eiu3nV5pd5Cnf": [
			{
				"comment_id": 52,
				"body": "Busy. There's always work to do. Various kind of work, including housework.",
				"added": 1576789483
			}
		],
		"1576592495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 53,
				"body": "Saying that the developers are idiots simply because You do not like their artistic decisions, placement of menu options to a separate region of the GUI, does not speak highly of You.",
				"added": 1576789660
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1352_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Personally, I don't care, I'd probably 'be gone'.\n\n...talking about being \"self-centered\" :-D",
				"added": 1576872448
			},
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1354_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): It's hopeless, all these things 'ARE FAR TOO COMPLEX' for these new 'GENERATIONS', who haven't been 'TAUGHT TO THINK'.\n\nAhah, and You, the old generation, did a good job at teaching us? Nice university tuition fees You've got for us, the young! Is Your current attitude here helpful at teaching anybody anything? Specially given Your tone here.",
				"added": 1576872519
			}
		],
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 54,
				"body": "It's interesting that for years the Hong-Kong was very well aware of the differences in politics between the mainland China and the Hong-Kong, including the fact tha the mainland China prefers to annex all autonomous regions like the Hong-Kong, Macau, Taiwan, may be at some point even Japan, specially given how badly the Japanese Imperial Army treated the Chinese during the 2. World War era. At some point most of the money that the mainland China exchanged with the West went through the Hong-Kong. Banking is the business there that the Hong-Kong lives, at least lived, off of. Literally for centuries. Back at the medieval ages there was just no point of howling the local Chinese money back to the West just to howl it back to China to pay the Chinese for their goods, so the money was held at the Hong-Kong region, at Hong-Kong banks. The same at the Chinese side: why to risk loosing the western money to robbers during transport when it will be used to buy goods from the western merchants anyway.\n\nAnd yet, as rich as the Hong-Kong people, in average, despite the horrific disparities, have been FOR CENTURIES, including during the 1970-ties, they did not bother to invest in a proper army. Nowadays it may sound unthinkable that Hong-Kong could have a more powerful army than the mainland China, but at the end of the 20. century, during the 80-ties and 90-ties, when in stead of \"Made in China\" most plastic goods in the West had a label \"Made in Taiwan\", it was perfectly realistic for the rich guys in Hong-Kong and Taiwan to have an army that is more powerful than that of the mainland China.\n\nSupposedly the Sparta fell due to the Spartans getting rich and lazy. The Hong-Kong people got rich and lazy and as it seems, now it's their turn to fall a lot like the Spartans did. Lazy not in terms of the number of work hours, but in terms of working on their problems and thinking ahead. The Hong-Kong rich just did not bother to think so much ahead to find out that they actually have to invest in an army to keep their independence.",
				"added": 1576790418
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 55,
				"body": "Simple: attend a university or some study group. Don't hang around wrong people, go find the intellectuals. The universities do not need to be the expensive ones, there are actually good universities in the U.S., where the tuition fee is about 15k$/year or even less, it just takes a little while to find them. I have found some truly awesome lecture videos from pretty much unknown universities. \n\nOn the other hand, \"feeling lonely\" can mean many things and a truly dedicated group of students is not the fun company to hang around with if You want to socialize, because the empty blabber of socializing is quite disturbing for people, who have their own thoughts to think and limited time per day for communicating with others.\n\nSo, if You say that You have the money, then Your first stop might be a psychotherapist. A proper one with a medical degree. One does not need to be nuts or deeply depressed to consult with a psychotherapist, specially if it is about human relations, loneliness, love, sex, daily habits (not just drinking or drugs or anything negative).",
				"added": 1576791185
			}
		],
		"1576347710_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 56,
				"body": "Well, I guess VPN to some western country is Your best bet, provided that You can avoid the man-in-the-middle attack at the Iranian border. For a start You may want to start Your ZeroNet node with the command line option:\n\n     --force_encryption\n\nThere's also the problem that if You encrypt everything without using steganography, then the censors at the border can know, who needs to be raided for evidence collection. If You have a lot of money, then You may want to buy yourself a satellite phone that also allows some slow data connection to come through. Forget about using YouTube or downloading huge files, but You might be able to use ZeroNet and some old-fashioned bulletin boards like Usenet and FidoNet. Here are some FidoNet related links:\n\nhttps://www.fidonet.org/\nhttp://ftsc.org/\nhttp://filegate.net/\n\nOne measure that You may also want to consider is to use some less-mainstream operating system, because government spying malware products are developed for operating systems that are widely used and it does not make financial sense for the malware(\"law enforcement software\") creation company to support very esoteric operating systems. STOP USING WINDOWS. As Linux is nowadays also pretty mainstream, Linux is not such a good bet either. You may want to try Debian based GNU Hurd:\n\nhttps://www.gnu.org/software/hurd/hurd/running/distrib.html\n\nOr, may be You might try out something as extreme as the\nhttps://kolibrios.org/en/\n\nYou probably have to use multiple computers: one for working with mainstream software and the other one with the esoteric operating system for the political and \"illegal\" things like gay porn and political talk. Also, You probably want to keep Your files encrypted. The GNU Hurd has a very nice concept of \"Translators\", which are like the Linux userspace file system drivers (FUSE), except that the GNU Hurd translators are cleaner, probably an inspiration for the Linux FUSE. You can write Your own encryption software that automatically encrypts/decrypts yor files like the \n\nhttps://en.wikipedia.org/wiki/ECryptfs\n\nI suggest that You do NOT use the ecryptfs, because it uses a flawed kernel module that literally crashes the Linux kernel and corrupts files, causing data loss. It also uses too short keys. What You may want to do is to use at least 200kB long key like it is used with one-time-pad, except that You re-use the key, making the encryption weaker as a compromise and to mitigate the weakening, use salting, id est add random numbers to the byte-stream to hide the key a bit. A salting idea:\n\nA block of N bytes, 4<N, starts with a randomly generated byte. The rest of the N-1 bytes consist of N-2 cleartext bytes and at least one other randomly generated byte.  At first the N byte sequence looks like:\n\n\n    (1. randomly generated byte)(N-2 cleartext bytes at the order as they appear at the cleartext)(2. randomly generated byte)\n\nFor the sake of conciseness I designate them as\n\n    B_rand_1, B_clear_1,B_clear_2,...,B_clear_(N-2), B_rand_2\n\nThe B_rand_1 range is 0..255, because it is just 1 byte, 8 bits. The next task is to construct 2 functions:\n\n    set_of_indices_shuffle = func_1(B_rand_1)\n    set_of_indices_DEshuffled = func_2(B_rand_1)\n\nIt's a matter of creativity, how to create the func_1 and func_2, but the idea is that the func_1 is used for swapping the order of the N-1 bytes, shuffling them, and the func_2 is used for restoring the order of the N-1 bytes, at least one of them being the randomly generated one, the B_rand_2. Swapping the order of bytes is not necessarily a fast operation, but this algorithm is not just about speed, but also about security. The shuffled form should then be XOR'ed with the key, encrypted. That is to say, at encryption the XOR-ing comes AFTER the shuffling and at decryption the XOR-ing comes BEFORE the DEshuffling. Basically, a primary school child can write this program in C programming language or at least one of my early childhood friends, over 20 years ago, did it, but it's awesome, because it is truly secure despite being simple. With long enough key it is even more secure than the modern encryption algorithms.\n\n",
				"added": 1576791849
			},
			{
				"comment_id": 57,
				"body": "> [edgelordofdecent](#comment_350_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Don't. VPNs don't make you anonymous.\n\nNot anonymous, but if all of the traffic that is \"illegal\" in Iran/China is visible in the West, at the exit end of the VPN-tunnel, then that helps against the Iranian/Chinese government, unless they own the western company that offers the VPN-service. Various Arab states do have a lot of investments in the West and they might be willing to invest in hosting companies to target their dissidents.",
				"added": 1576794866
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 59,
				"body": "I think that this is so well documented horribly old topic that we should LEARN FROM HISTORY and not waste our time on whining that some bastard X did a bad thing Y. Besides, there are even more modern horrific things taking place in Syria that are very similar to the holocaust. Here's an example:\n\nhttps://www.youtube.com/watch?v=p6tEuINZ0J4\nhttps://www.democracynow.org/2019/5/16/inside_syria_s_secret_prisons_a\nhttps://www.amnestyusa.org/files/human_slaughterhouse.pdf\n\nOr the INTENTIONAL killing, that is to say, murdering, of French doctors by the U.S. army just to send them a message that they should not treat the \"enemies of the United States\".\n\nhttps://www.youtube.com/watch?v=BCqp-ASwT4k\nhttp://kunduz.msf.org/\nhttps://www.doctorswithoutborders.ca/issues/kunduz-when-msf-came-under-attack-afghanistan\nhttps://en.wikipedia.org/wiki/Kunduz_hospital_airstrike\nhttps://www.democracynow.org/2016/5/2/headlines/pentagon_releases_report_on_kunduz_hospital_bombing\n\nIt's kind of interesting that the French government, DEPENDENT ON NATO, pretty much ignored that murder of French medics. There's also another example of a holocaust like situation, in Iraq, where civilian population got bombed by the U.S. forces with white phosphorous:\n\nhttps://www.independent.co.uk/news/world/americas/the-fog-of-war-white-phosphorus-fallujah-and-some-burning-questions-5348984.html\n\n\"Fallujah - The Hidden Massacre\"\nhttps://www.brighteon.com/5817366487001/\nhttps://en.wikipedia.org/wiki/Fallujah,_The_Hidden_Massacre\n\nObviously the Russians test anything in 2019 Syria, so there's plenty of Holocaust like scenarios to choose from in the modern era, not to mention war at Yemen, the various African ever-lasting-massacres. As bad as the Holocaust was, IT IS USED ONLY TO DIVERT PEOPLES' ATTENTION AWAY FROM THE HOLOCAUST MODERN ANALOGUES!",
				"added": 1576872269
			},
			{
				"comment_id": 63,
				"body": "> [thorburn](#comment_19_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Maybe they weren't as bad as we have been lead to believe, or maybe the reality is far more complex than it appears on the surface. \n\nIt is perfectly well documented that:\n\nx) before the 2. WW there was 1.WW;\nx) the French had colonies that they extorted;\nx) the English had colonies (India, South-Africa, etc.) that they extorted;\nx) the thinking in Germany was that IT IS NOT A SIN TO ENSLAVE ENSLAVERS;\n\nSo there's Your \"complexity\" and the statement that may be the Germans weren't as bad as the Hollywood and mainstream history books, the \"history of the winners\", portrays them. But, that's all documented, at least for those, who TAKE THEIR TIME TO THINK WITH THEIR OWN HEAD. Even the totally unjust 1.WW reparations that were totally unjust for the German side, who, indeed, _was_not_that_bad_at_all_by_trying_to_enslave_the_colony-running_French_and_India-extorting_English_, were DOCUMENTED. Even if the documentation is incomplete, the fact that the reparations were UNFAIR for the German side, imposed by the French and English on Germans for wanting to do what the French and the English were doing all the time at their colonies, was DOCUMENTED. So there is NO COMPLEXITY THERE, just the skewed Hollywood image that shows the French, the English and the U.S. as the \"Good Guys\" and the Germans as the \"Bad Guys\". What regards to the Holocaust, well, may be the Hitler did not mean to kill the Jews, but he could not possibly back down from that track once the bureaucracy got rolling, so he just doubled down on the \"final solution\", probably WITHOUT FEELING GUILTY for it. For Hitler the Holocaust was probably just a slight work accident in the workday of a professional politician. So, I still stand for my previous statements that the Holocaust topic is just a trick to lure the attention away from modern mass murders.",
				"added": 1576876012
			},
			{
				"comment_id": 67,
				"body": "> [thorburn](#comment_20_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Unfortunately our judicial processes have been broken, and those in power think they can act with impunity with out fear of being held accountable. \n\nDespite not agreeing with everything You wrote, I sure loved to read Your post. If I started to reply to all of those good points of Yours, then my post would be very long, but the lower grapes is the statement that at the era of kingdoms representative democracy must have seen as something quite mad and yet, the era of kingdoms is pretty much over. There will also be the time, when the era of representative democracy will be over and the first sign away from that is the Swiss direct democracy, which in turn itself will be replaced with something one day. Probably anarchism, where rules within communities exist, but the rules are enforced by expelling people, who break them and there is no one-huge state/corporation to \"enforce\" the rules of its top leadership on others. \n\nThe de facto \"juridical system\" has always worked very well: the necks of the French political elite  were under guillotine and their heads were literally rolling, as has been the case with almost any revolution, be it the Communist revolution in Russia, with Lenin in front, or be it the separation of the U.S. from the British empire. Only the weapons and execution methods change.\n\nThank You for the nice, thorough, post.",
				"added": 1576924898
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 64,
				"body": "MOAB --- Mother of All Bombs?\nIs there any particular reason, why I should apply a censorship filter from some un-authenticated 3. party on my ZeroNet  server that I want to use for reading material that tends to get censored on the plain web?  I'm sure the troll-offices of various countries and \"psychological operations\" bureaus and \"strategic communication\" offices kindly offer censorship lists.",
				"added": 1576876521
			},
			{
				"comment_id": 65,
				"body": "> [falconixx](#comment_14_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): you can choose what you want to see, i myself don't like cp and some spam comments , the list of blocked pages & people are clear , and \n\nIf You apply 3. party blocklist, then You self do not choose, what You avoid. The issue is very much similar to representative democracy and delegation of voting in general: the moment a person delegates voting to someone else, that power tends to get abused or just mis-used due to stupidity. The solution here is to develop some integrated block-plugin to ZeroNet node so that people can \"collect blocklist entries\" the same way people collect bookmarks to their web browser.",
				"added": 1576878052
			}
		],
		"1576885309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 66,
				"body": "Nice click-bate for an anti-ceonsorship network (ZeroNet) forum title.\nNo, I won't fall for that provocation, but nice try. I have to give You that much that You did get me to write this comment here :-D",
				"added": 1576922529
			}
		],
		"1577283326_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 68,
				"body": "> [edgelordofdecent](#comment_362_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): We need to get an international mesh network set up.\n\nYou'll get some mesh network related links from my posts at\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1576021462_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP/Can+ZeroNet+help+to+access+internet+during+blackout+internet",
				"added": 1577499823
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 69,
				"body": "May be the best part of the early 90-ties internet was that it was considered to be too irrelevant to be censored and it was so unpopular that mostly the geeky early adopters used it and that set the tone and general quality of discussions far higher than can be expected from the internet that the majority of the general population uses. On the other hand, due to being a niche medium, the 90-ties and even early 2000-ties internet did not have as many scientific papers, tutorials, university lecture videos, astronomy observation datasets, other intellectual goodies online as the year 2019 internet has. Even GitHub and SourceForge did not exist.",
				"added": 1577500197
			},
			{
				"comment_id": 70,
				"body": "> [xianc78](#comment_71_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): If ZeroNet (or any other P2P network) ever becomes popular, I hope it stays like this.\n\nIt can not possibly stay like that. It's the people, who determine, what the content in ZeroNet will be.",
				"added": 1577503423
			},
			{
				"comment_id": 71,
				"body": "> [quantumkitty](#comment_248_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Nowadays you have an infinite supply of people willing to do things for free. \n\nYour argument is that it is such a bad business environment for the medieval age \"reader-writer profession\", because nowadays almost everyone can read and write.",
				"added": 1577503613
			},
			{
				"comment_id": 72,
				"body": "> [zaron](#comment_26_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Seriously. when I first got on the internet it was essentially subculture.. Now it's just mainstream.\n\nThat's easy to re-create, except that any properly anonymous forum can be flooded by spam-bots at a rate that no human moderator can match. If the spam-bots reuse human postings from other sites, then the content based spam-detection can not work. Modern bots, specially those of the future, can beat the Turing test that tends to be used for restricting access to spam-bots. Basically, when there is no civilization or natural beasts of any kind, there is no need for a \"security system\", but the moment there are multiple people, the need for access restrictions, locks, security systems arises.",
				"added": 1577503873
			},
			{
				"comment_id": 73,
				"body": "> [swashbuckler](#comment_21_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): 20 years back I personally saw the Internet as an instrument, that can help solve problems. Now I think we've made it look like an instrument for generating exacerbation and confusion.\n\nAs with all tools, the internet can be used for various purposes, a lot like a hammer can be used for hitting nails and some may use it for hitting human heads.",
				"added": 1577504099
			},
			{
				"comment_id": 74,
				"body": "> [wank3r](#comment_3_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q): There are many many things I like about the modern web, but the lack of ideas and pure anonymous text, and the fact that youre tracked every second makes me sad.\n\nIt's just a matter of arms race. The technically more capable will prevail. In StarWars spirit, are we here truly so hopeless to give up the fight and loose to the Evil Eimpire? I thik not and I also work on software to stand for my such interests.",
				"added": 1577504341
			}
		],
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 75,
				"body": "What ever education the creator of this thread received, is/was NOT FOR HIM/HER, at least that's what he/she is saying at his/her opening post. Good luck with that attitude towards other people!",
				"added": 1577504614
			}
		],
		"1577617777_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 76,
				"body": "> [re4tsf9e](#comment_28_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): First problem to address? Having babies before age 30. A real biological constraint now hidden by cults. Fix this problem first.\n\n> [draugrdeathlord](#comment_56_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): ABSOLUTELY the low birth rates combined with mass immigration = demographic crisis. Sweden, Britian, Germany new Zealand and parts of Australia will be the first places to fall if things don't change very soon.\n\nIt is interesting, how people yearn to have the primitive community, where people are too young to oppose their abusers, too poor to have the independence to step off the underpaid ratrace and they die young so that they do not need to be spent on in the form of medicare. Like farm animals: the old ones get to the slaughterhouse and are sold for meat in stead of being a financial burden in the form of veterinary doctor bills. At the same time the generals in the armies and the financial elite tends to be pretty old. Even the ones at U.S. senate and congress are pretty old people. The presidents tend to be over 50 all around the world, unless they are some military dictators in Africa. \n\nThat is, what all this \"it's-so-bad-so-bad-that-the-median-age-of-our-population-raises\". In medieval ages the \"average\" age was about 35 years, which explains, why the teeth of the medieval dead are so nice and well preserved, specially those found on battlefields. Well, in the same vain, why not aim for teenage pregnancy, because that way the median age gets even younger. Why not have the 13-year olds fuck each other so much that it's just one baby after another, until they die due to lack of medical care, as is the case nowadays.\n\nI point out that the QUALITY of the people also matters, not just their numbers. There are plenty of people in Afghanistan and other Arab states and Africa. The places are a DUMP. Education TAKES TIME. It takes about 12 years till a person completes the secondary education and another 10 years till some professional skills emerge, be the skills  something more academic like those of a medical doctor or something less academic, but still demanding, like music, sales, fashion, logistics, piloting planes or sailing ships or doing house repairs. I guess technical fields like mechanical engineering, Information Technology, civil engineering, chemical engineering, electronics are somewhere between the totally academic track and non-academic track, but they too take about 10 years to master, even if no doctoral degrees from universities are obtained. The older the parents, the better the parents are in terms of intellectual skills and intellectual support to their children. You may fix the financial issues with politics, but You can not compensate the stupidity of parents with a ton of money.",
				"added": 1577690957
			},
			{
				"comment_id": 77,
				"body": "> [draugrdeathlord](#comment_62_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): And about young girls having babies, seriously not good mate. I guess you don't know that when the to young give birth it often tears some tissue structures that cause incontinence. It's a problem in Africa let's keep it just a problem there yes ?\n\nPlease read my comment again and then You might notice something .... :-D",
				"added": 1577691715
			},
			{
				"comment_id": 82,
				"body": "> [re4tsf9e](#comment_33_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): Successful populations have children and nurture the young. Bitch all you want - but Muslims have a successful formula. So do the Amish. Both groups put offspring ahead of their navel gazing self.\n\nSo do the dumb bugs, including ants. Evolution does not always prefer the smart ones. The question here is, should we aim for smarts or is just the optimizaton to the current conditions down on Earth a sufficient direction for the evolution of the homosapiense, specially given that the dinosaurs lacked an asteroid defense system and were evolutionally all wiped out because of that. For example, the Muslims may win all wars, blow everyone up, but if they lack the capability to run their own development programs, then they will be the \"next dinosaurs\". As far as I know, the Iran is the only muslim region that has any kind of development capability. The ISIS, the Saudi Arabia and alike, the Palestine people, the Afghanistan tribes are all using IMPORTED weapons or rely heavily on imported material or refurbish old tech from the Soviet Union and the West.",
				"added": 1577744929
			},
			{
				"comment_id": 83,
				"body": "> [anonymouslogin](#comment_175_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Am I advocating every 12-14 year old girl go find a 30 year old partner? Absolutely not, but as\n\n30 years of age is not that mature. By the age of 30 a person has some professional skills, but it takes about another 10 years, till the person has its business up and running or has some proper CV to apply to properly paying salary based jobs and has the industry experience. A doctor that works at a big hospital also needs the \"industry experience\" after graduating the university. So, the graduation takes place at about age 30, then another 10 years of working as a professional doctor to gather the experience. But the age 40 to 50 is the good time for creating children, because with modern life expectancy of about 85 years of age, the parent has sufficient time to pass on the knowledge to its children. When the parent dies, then the child will be about 30 or 40 years of age and can take the loss.",
				"added": 1577745323
			},
			{
				"comment_id": 84,
				"body": "> [draugrdeathlord](#comment_95_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Intelligent more advanced mammals use K which is less kids with higher investment.\n\nSupposedly the \"teenage age\" of a Nordic/Greenland shark starts at about 150 years.\n\nhttps://en.wikipedia.org/wiki/Greenland_shark",
				"added": 1577745512
			},
			{
				"comment_id": 109,
				"body": "> [re4tsf9e](#comment_49_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): Babies need YOUNG parents. It's biology and nature.\n\nI prefer my children to have SMART AND SUPPORTIVE parents that can also pay for the \"beanbag\" without having a bank loan hanging over their heads. Again, stupid ants versus smart Greenland sharks.",
				"added": 1578032120
			}
		],
		"1577663706_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 78,
				"body": "A workaround might be to look at the zite folder creation time or access time and then run a cron-job that deletes the zites according to some evaluation criteria. There are also some other files in the <ZeroNet root>/data that need to be updated.",
				"added": 1577692673
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 79,
				"body": "A grocery store. I prefer not to starve to death.",
				"added": 1577692739
			}
		],
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 80,
				"body": "> [quantumkitty ]: Download ZeroNet onto a thousand Raspberry Pi Zeros and build a giant mesh network? If you can dream it up, you can make it happen.\n\nZeroNet does not properly run on Raspberry Pi, because it needs a lot of IO for hashing the various pages and the IO on Raspberry Pi is a bottleneck regardless of whether the ZeroNet runs on the memory card or an USB-disk. What regards to growing and big communities, then a big set can be divided to small sets, but if the small set is not fully a subset of the big set, then the small set tends to be an empty set. That is to say, the size of the YouTube \"community\" is not a problem, but due to censorship  the size of the YouTube user base, \"community\", is useless. Quality also matters, not just quantity.",
				"added": 1577742300
			},
			{
				"comment_id": 81,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1453_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Whether they follow or not 'doesn't interest me', the most intelligent (the more outside 'of their neurosis') will be there on 'these new platforms'.\n\nThat's a temporary phenomenon, just like the early clearnet was for the intelligent ones that seek new opportunities. The actual problem that ZeroNet will have and may be does not yet have that much is the lack of personalized search engines that actually work on the person's own computer and truly serve the person. Those will probably not be popular too soon, because those would need their own machine due to high CPU-load and high IO-traffic, unless someone sells those as separate appliances that can be attached to LAN or creates a special Linux distribution that installs some per-configured version of the personalized search engine. I believe that old laptops will make great personal search engine appliances. The main issue will be that almost all laptops are with an Intel or AMD CPU, which can self start to impose censorship through the \"trusted/secure zone\" mechanism, where the Intel CPU is actually running MINIX3 operating system at the \"secure zone\".\n\nhttps://www.youtube.com/watch?v=_Aex9RwgHHQ\n\nhttps://www.cs.vu.nl/~ast/intel/\n\nMay be it will change, if the new laptops will use the new RISC-V or OpenRISC SOC's or FPGAs in stead of Intel and AMD CPUs, but the Raspberry Pi computers might be usable in a laptop only, if the laptop is actually a Raspberry Pi cluster, where the different IO channels(network, each USB for connecting USB-disks) is delegated to some dedicated Raspberry Pi with some FPGA-shield. \n\nSo, I suggest that the \"artist types\" will not get their hopes up with the ZeroNet and alike, because at the technical side of things the ZeroNet and other P2P-systems have a long way to go and part of the issue is hardware, not even  software. The thing with all P2P storage systems, of which the ZeroNet is just one flavour of, is that they fundamentally need a lot of IO, as everything is served by the nodes. It's the hardware that does that IO.",
				"added": 1577743482
			}
		],
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 85,
				"body": "> We come to an intersection where technology is fully developed, but the ideas in people's heads are still very religious and archaic.\n>...\n> Western civilization is aging and in a few years will 'no longer be able to support itself'.\n\nHow can the technology be fully developed, if the technology does not allow the civilization to support itself? \n\nBy the way, all of the wind and plant life and the life of all other organisms that get their energy from eating the plants or other organisms that eat the plants comes ultimately from solar energy and the energy accumulated within the earth over time (hot lava). Most of the sunlight does not even hit the Earth and Earth is a tiny-tiny body, if compared to the empty space that just passes the sunlight outside of our solar system. So there is certainly no lack of energy at that distance from the Sun, where the Earth is. The question is only, how to capture it. You may also think of it this way that at space, near Earth, the sunlight is hotter than that of a really hot summer day in some desert, because there is no atmosphere to capture the high energy blue and ultraviolet light, to the point that actually the sun looks white, not yellow as on earth. In the shadow at space the \"weather\" is colder than at Antarctic's coldest winter night, because the energy radiates away in the form of infrared light, without reflecting back or being compensated by \"daylight\".\n\nWhat regards to the overpopulation issue, then it's not the problem of the West. It's the problem of the East, the China, the India, the Japan. Places like the Hong-Kong or Singapore import almost all food, because they lack the farmland and other means of food production. Sea based fisheries also need something to feed the fish and that something tends to come from land. On the other hand, the shit that the humans poop out, a source of nitrogen, tends to be contaminated with medicinal chemicals and therefore is not suitable for farm use. A place like the Hong-Kong really can not sustain itself without the rest of the mainland China or some logistics connection to some other land based larger area, because money is not edible.",
				"added": 1577747186
			}
		],
		"1577743477_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": [
			{
				"comment_id": 86,
				"body": "> Narby hypothesizes that shamans may be able to access information at the molecular level through the ingestion of entheogens, specifically ayahuasca. \n\nI am totally convinced that if I eat the pills that my doctor prescribes me, then my body is able to access the chemical information of those pills at a molecular level to the point that I get cured as planned by the molecular biologists that designed the drugs. I also access the sensational information of coffee at a molecular level, starting with my nose that senses the nice smell of the various coffee molecules. All truth! Now, let's write a scientific paper or a book about it!\n\nBy the way, the transistor components of modern CPUs is about 60 atoms across. I do not know about the Flash memories, but it they are about 200 atoms across, then think about the information density there. May be at some point the biological genes with all their required error correction information overhead aren't even that good of a data storage medium. Add the duplication at digestion, each cell needs the same information again, then may be there even isn't that much unique information available at the whatever \"ayahuasca\" substance.",
				"added": 1577748383
			}
		],
		"1577931417_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 87,
				"body": "Well, evolution is tough. May be the fools, who fall for that sort of simplistic manipulation deserve a civil war? The current homo sapiens did not evolve without the dumber versions of it being extinct, be it wars, decease, environmental hardships.",
				"added": 1577945722
			}
		],
		"1577932335_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 88,
				"body": "I would like to make the difference between the RIGHT to bear arms, which I support, and the NEED to bear arms, which I think should be eliminated. In addition to those 2 aspects there's also the aspect of practical civil safety, like  gasoline tanker truck routes, chemical manufacturing plant storage rules and location, MUNITIONS STORAGE RULES combined with FIRE SAFETY RULES. Let there be rights to bear arms, but let there also be REQUIREMENTS TO STORE THEM AND THE MUNITIONS properly, at the owners' property AT A PROPER, FIREPROOF, SAFE. It's like road traffic rules, where one thing is the right to drive freely, but PRACTICALITY INDUCED RULES APPLY.\n\nWith that in mind, if robots bear the arms in stead of humans, then in stead of lobbying for the right to bear arms, it would be smarter to lobby for the right to keep arms along in a usable state. The dumber ones will carry their arms, making themselves a target for the opponent, who wants to stop them from shooting the opponent, and the smarter ones have a robot carry the arms, because the robot can shoot even after the owner is already dead and that way there is no point of shooting the owner of the weapons to eliminate the shooting capability. From that point of view there really is no NEED to bear arms. From social point of view, one may thin even a step further and say that what's the point of having  the armed robot with oneself, if the other side, who induces violence, gets killed anyway? The idiots, who can not understand that scheme, should never be allowed to enter the area of the neighborhood, where the ones, who DO understand that scheme, live and operate. But if that separation succeeds, then the next question will be, who wold one even use the armed robot against, even postmortem? \n\nNo supermafia, generally called as \"government\", should tell, who may bear arms, but after that's solved, there are still the questions that I just described.",
				"added": 1577946758
			},
			{
				"comment_id": 96,
				"body": "> [muhwaycism](#comment_53_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): How about avoid getting red flagged then, smart guy?\n\nStart with the idea that all laws have \"loopholes\". Those loopholes can actually allow the mass production of goods that are at least as effective as the ones labeled \"weapons\". Start with the mechanisms that guns use for creating damage to the perfectly hit target. Then, produce the \"non-weapons\" until they also get \"banned\". Then look for the new loopholes and repeat the process. At some point it's just an arms race. But, of course, if You do not design Your weapons Yourself and expect to just buy ready-made things from a shop that has a big sign, \"Weapons\", then You are doomed :-D\n\nThe Brains will win!\n\nBy the way, good targeting also helps. Create Your potential target list during peace time, a lot like the Pentagon does the actual war plans for all regions of the world during peace time. The Pentagon weapons are then developed according to the needs that emerge from that planning. You can also use that idea!",
				"added": 1578002116
			},
			{
				"comment_id": 106,
				"body": "> [re4tsf9e](#comment_61_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): Тhe only thing which might give zealots pause are high body counts and assassinations. Wacos. Costs must explode and get very personal. But THEY must start it. If you own guns, keep them hidden. Don't scare people.\n\nI think that's one very SMART advice. I second to that one, specially the idea that keep a low profile, but at the same time, PREPARE-PREPARE-PREPARE and NEVER BE THE AGGRESSOR ONESELF, just be ready to respond, when other side starts the violence and also prepare for a favorable exit strategy from that conflict, including the case, when You actually win. The Iraq war showed that it is possible to win the war and still loose in the big picture just because the winning part was not prepared for. And yes, also prepare to loose, the damage control aspects and how to loose with dignity. \n\nDignity does not necessarily mean the dumb suicides that the 2. World War era imperial Japanese army did, but it can mean that even at a certain loosing position there is no deference, no giving in. Dignity may also include the idea that one never uses personal despair as an excuse for stealing, robbing, lying. The idea is that hunger may come and go, but DIGNITY, once lost, WILL NEVER RETURN. Dignity can also include a principle that the opponent is never bullied or talked with the tone of hubris, regardless of which side is the winning side. No emotional nonsense towards the enemy even, when standing tied in front of an execution squad and no emotional nonsense, no hubris, when self being at the position of military strength. Neutral and respectful tone must always prevail, no matter what.",
				"added": 1578030059
			},
			{
				"comment_id": 107,
				"body": "Accidental double post deleted by me.",
				"added": 1578030308
			}
		],
		"1577969769_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 89,
				"body": "You seem to miss the idea that a SUITABLE LIVING ENVIRONMENT, be it pollutant free nature, clean air to breath, clean water to drink, healthy food, or be it social environment, like not getting shot on the street or getting help, when needed, IS IN A PERSON'S VERY PERSONAL, INDIVIDUAL INTEREST. It seems to me that according to Your contemplation the personal, INDIVIDUAL, interest is in conflict with the interest of having a good living environment, but in my opinion there is no such conflict. What regards to the community part, well, all passengers of the Titanic probably wished that there were enough life boats for everybody, because that way it is certain that even  if a person is some soulless 1. class 1%-nter-bastard, he/she can have his/her servants with him. So, again, there is no fundamental conflict of interests between the 1. class passengers and the lower class passengers in that particular matter. The conflicts arose, when there weren't enough lifeboats, but everybody probably agrees with the statement that it would be a Good Thing to have enough lifeboats so that everybody can escape the sinking ship without drowning. That is to say, TOTALLY PERSONAL INDIVIDUAL INTERESTS CAN BE TOTALLY IN LINE WITH THE INTERESTS OF THE COMMUNITY AS A WHOLE. It's, when one party starts to live at the expense of the other or tries to grab the resources that others  need for survival, when the conflicts start.\n\nOn the micro level, the only way to really know the other person is to be with him/her in a situation, where that other person believes to desperately need a resource that is so limited that either You get the resource or the other person gets the resource and the resource can not be shared. The possibility to share a resource alleviates the situation to the point that the situation is not that desperate. For Example, even a single shot of vaccine might be halved, oxygen masks might be used by sharing it, etc. In practice, it does not even come to the sharing part, because bastards fail that test much earlier. \n\nWhat regards to the open source part, well, the problem with closed source, including freeware, is that in addition to the security related problems, possible malware, etc, the closed source software is available only as long as its creators make it available for the modern hardware and operating system combinations. Hardware changes. Operating system APIs change. There is the option of using emulators,  like the Commodore64 era vintage personal computer software is run, but that only works, if the computer that runs the emulator is much more powerful than the emulated computer or has some special purpose hardware. The moment special purpose hardware comes to play, it's a niche project and even if the special purpose hardware is not that expensive, like the ~200€ FPGA-borards in 2020, creating software/firmware/Hardware-Description-Language-code for it is a lot of work, not to mention the fact that development tools also have dependencies in terms of applications software, operating system, hardware (operating system depends on hardware). What the Micro$oft did really well back in the day was that they figured it out, how to sell huge amounts of licenses IN BULK: they sold licenses to megacorporations, who's IT-departments love the fact that all computers are \"alike\". Nobody else did that before and the Apple was not able to furnish as much hardware as the different IBM clones were able to furnish, not to mention the probable price difference, where Apple is the expensive one and the Micro$oft+IBM-clones are the cheaper option. In electronics industry there is the term SECOND SOURCE, which stands for a manufacturer that is not the manufacturer that initially brought the part to the market, but that produces the part with the same quality. That's why the Intel pretended to tolerate the AMD at its early days. The Pentagon had a requirement that military equipment uses only those components that have at least one second source manufacturer. The same with software: a closed source program LACKS THE SECOND SOURCE MANUFACTURER. Think of the StarOffice/OpenOffice/LibreOffice case: only thanks to the 2. source manufacturer analogue has that project survived. Even software developers physically DIE and only the open source software projects can live longer than their original publisher, be the original publisher a corporation or an individual. \n\nA stellar example is the scientific computing code in Fortran. A true software dinosaur, but still being used, because it is well tested and carefully created by professional mathematicians. If a person graduates a University at ~age 24, matures its specialist skills for about 10 years, may be writes something really good, good from technical point of view, not business point of view (business success can be achieved with technical CRAP), at about age 35 or 40, and then the project matures also about 10 years, then the original author of the software is about 50 years old by the time his really good stuff hits \"niche mainstream\", which is not the same as business success, but a popularity among other experienced specialists. Give the project then another 40 years of use, which is the case with many software utilities like grep, tar, etc. and it is very likely the case that the software is widely used, but its original authors have literally died off, passed away. I haven't heard that the authors of the grep and the tar are billionaires and at the front cover of the Time magazine, but from a specialist point of view, not business point of view, those authors are a total success-story and certainly heroes of the HUMAN RACE. Even the Leonardo da Vinci wasn't a billionaire analogue back in his day. He was just a freelancing engineer, who had to move from one town to another to avoid being killed by religious nuts, a lot like the Albert Einstein had to flee the Nazis. ",
				"added": 1577994529
			}
		],
		"1577834454_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 90,
				"body": "Let's hope that the year 2020 won't be such a catch-22 as it looks through the Zero(net?)-elimination glasses. But hope dies last and let our ZeroNet be ready for worse! Heil ZeroNet!",
				"added": 1577995477
			}
		],
		"1577969522_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 91,
				"body": "> [randomshits](#comment_384_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): At least with the CCP, there is a clear understanding as to what you are going to get unlike the US World law that gives financial protection to those who have the most wealth under a guise of fairness & democracy.\n\nGuess what, the guns offer even more predictable results, if You place the barrel under Your chin and pull the trigger. After all, its the predictability that You are after, not Your personal benefits. You may also find it very predictable to go to Saudi Arabia and wave with a protest sign. They literally chop people's heads off on a public square with SWORDS, as protests against the sultan is \"illegal\" there. That way You'll get an audience to Your suicide and a \"free burial\". Probably even some U.S. media outlets have titles like: \"U.S. ally, Saudi Arabia, beheads a U.S. citizen for protesting the sultan.\"",
				"added": 1577995804
			}
		],
		"1577893728_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 92,
				"body": "What I read from this thread so far seems to be very specific to American culture. May be some British and Irish culture might also fit the description. I suggest You try out other cultures, may be Norwegian, Swedish, Finnish, German, Danish culture might be something, where there isn't that much of that fake-WOW-for-nothing. You might even be very disappointed, how serious and deep people from those cultures can be. \n\nWhat regards to the small children part then just always be nice to them. As long as You are nice to them, so that they are not afraid of You or have some extra bad experiences with You, it is perfectly OK not to be the warm and children loving person, who fits well to be a kindergarten teacher. You just need to LEARN YOUR OWN PROPERTIES and PEOPLE HAVE DIFFERENT DESIRES, DIFFERENT STRENGTHS and DIFFERENT WEAKNESSES. Personality wise, from psychological properties point of view, a really fine engineer would really ruin someones childhood, if he tried to be a kindergarten teacher or a teacher to small children or may be even a teacher at secondary school/\"high-school\". On the other hand, You really do NOT want to have the social types do the engineering jobs ANYWHERE, BECAUSE THE RESULT WILL BE SUCH A CRAP THAT PEOPLE WILL LITERALLY DIE DUE TO BUILDINGS COLLAPSING, PLANES FALLING DOWN (even much more often than they currently do), AND FOR HEAVEN'S SAKE, YOU DO NOT WANT THE SOCIAL PEOPLE TO BE IN A ROLE OF A SOFTWARE ARCHITECT/senior_software_developer. Social people have a place in software development, but their place is at the end user requirements gathering, IT-support, end-user-training side, NOT WRITING AND DESIGNING CODE!!!! \n\nSo, I do not think that You even qualify as a grumpy old man. I think that You just need to understand that different people have different psychological properties and those other properties ARE VERY USEFUL IN CERTAIN ROLES and Your psychological properties are VERY USEFUL IN OTHER ROLES where the others will fail miserably. What regards to the chicks, well, at age 20 it is clear that whomever You choose, Your interests will probably divert, one wants to study or work at one town and another one wants to study at another town, but that does not mean that You should have nice sex only after Your body is not as capable of enjoying it as it is in Your 20-ties, so You can just look for those \"boring mathematician\" types or \"lab-rat types\" and guess what, as uninterested in sex as they may look, those chicks also have only 2 options: FIND SOMEONE JUST FOR SEX OR GET OLD WITHOUT HAVING SEX. So You can be just be open about that matter, just ask, if they would love to spend a night with You, where the only goal is just to experiment, for both parties just to try things out and learn about sex and no other obligations, except biological safety. I suggest You have Yourself tested and ask her also to be tested before the sex-study-experiment and then You both share the original test results and still use condoms. Also nowadays there are special preventive pills to give temporary immunity against HIV. Those prescriptions can be obtained from gynecologist and andrologists office and those are specially designed for those 20-year-old-somethings, who want to experiment. Those won't protect against other sexually transmittable deceases, but if You also have Your vaccinations done for Hepatitis A and B and whatnot and use a condom in addition to that then the only thing left to \"worry\" about is that the chick knows her cycles and You should explicitly ask her to \"book\" the sex-night to a time, when she can not get pregnant. The lab-chicks and alike are good at precision and do not go with stupid emotions, so they probably know perfectly, when that safe period exist for them. \n\nAnd have fun! No need to be grumpy. \n\nOn the other hand, I also like the response that starts with the \n\n> [h3bhkj5gqz4n3pjm](#comment_1487_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): By the time I was five, I had already understood 'the world I was living in'. I never put up with the world of men, my only love is for life, biology (Nature).\n\nIt seems to me that there is no conflict there and it is also a perfectly OK strategy, provided that this fits the psychological profile. Those \"few friends\" can also include the few sex partners and then it probably works out perfectly. Happiness for different people is different. I like people of both genders, including my own gender, and God, how lonely I felt in my 20-ties, but when I eventually got myself a perfect boyfriend (I'm self a male), well, the love chemicals provided me heaven, like, I do not need another person to get an orgasm, but I certainly need another person to get high from love chemicals. And yet, as it turned out, after some sex and getting high from love chemicals I felt so content that I started to work on software for my next client the other person felt that I'm not spending enough time with him, not picking him up for sex and good night sleep often enough and I think that he did the Right Thing to dump me. But from my perspective he was perfect. My psychotherapist really was not able to figure out my love-life, despite being really good at everything else. It seems to me that the psychotherapists just use university textbooks and scientific papers that cover \"the average\" and obviously not every person fits \"the average\". But the good news is that even the psychotherapists/psychologists start to notice that there actually are types of people, \"geeks\", who may have the looks, the money, the popularity among people with the right age-gender-bodytype-personality, and yet they still can not pull it off, because they just want some sex and after that they want to spend time on things, where their REAL PASSION IS. I think that there is nothing wrong with that, as long as people with such properties, including myself, ARE AWARE OF OUR SUCH PROPERTIES. I strongly suggest that You take a look at the following TED talk:\n\nhttps://www.ted.com/talks/martin_seligman_the_new_era_of_positive_psychology?language=en\n\n",
				"added": 1577997823
			},
			{
				"comment_id": 93,
				"body": "> [anon05](#comment_24_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Why would I approach these things as an unaffected observer? I am not unaffected. \n\nMay be the term \"unaffected observer\" is not the precise term here. Obviously You are affected by Your environment. May be the more correct term to use is: \"an observer, who does NOT deny or downplay, what is happening, but still wants to calmly figure out a solution that is most useful to oneself and does not run with the very first thought that came to mind\". May be You have that American culture based hindrance, where the style is that a quick decision is better than no decision, but I suggest to dump that style in this case and take Your time for analyzing. Оnce You think that You have figured it all out, write the solution down, leave it laying for 3 days and then re-read it to Yourself and try to figure out, what You have been missing. Even the correct formula gives wrong result with wrong input data and if some of the input is missing, then the end result is wrong. Then make a list the possible data that You are missing and look for it not from familiar places online, but try many different places, do some thought gathering, and then re-systematize the thoughts. Then leave the new solution laying for about 2 days and read it later and once You are firm that You do not have any relevant new data to add, start figuring out, what to do about it. \n\nAt a superficial glance it seems that some travelling to other cultures, something northern, may be Canada, might help, provided that the environment, where You travel, is academic or something engineering like, not Hollywood or humanities or arts. Some language studies might also help. You might want to consider attending some university research group at some non-humanities department as a volunteer. Avoid the art universities and all of that emotional Hollywood stuff. Look for biologists, geologists, physicists, may be even mathematicians, chemists. Also avoid megacorporate IT-departments and business software development companies like Microsoft, Facebook, Google and Oracle and alike, because those tend to be full of the loosers who can't do the real, technically excellent, job. The technically low quality of their products should pretty much speak for themselves, at least to those people, who are aware that there are more reliable alternatives.",
				"added": 1577999194
			},
			{
				"comment_id": 94,
				"body": "One more crazy thought: If I get an orgasm before the ones at the porn movie get it, then it means that I had better time than those at the porn movie :-D\n\nSex with other people takes learning. Sex is a lot about attention and at first the attention to another person can be distracting, so an orgasm at first time is a nice thing to have, but do not make it a goal. The goal should be just to enjoy the time and feelings till both parties get very tired from the \"sports\".",
				"added": 1578000359
			},
			{
				"comment_id": 95,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1501_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Do you know that you're a body, a biology? So you're going to react.\n\nDifferent people have different temperament and there are professions, where too quick reaction without calm analysis is an impediment and then there are professions, where calm analysis turns to be too slow approach for an optimal outcome. That's why people get psychologically tested, when they apply to some very specific jobs. Being one or another is not necessarily good or bad thing, but what is certainly BAD is, if a person does not know himself/herself enough to know, what his/her properties are and where those properties are a strengths and where those very same properties are weaknesses. So, yes, SERIOUSLY.\n\nAn example: a medical nurse or a bodyguard should react fast. SWAT members, at least in some European countries, are required to be \"slow\", but firm, with their trigger usage, because if they weren't, the hostages or otherwise innocent people that the SWAT members go to rescue, might get killed by the SWAT. The SWAT members wear proper body-armor anyway, so they should be able to calmly take some shots without shooting back too quickly, because at least at some parts of the Europe the tasks is to take the bad guys in ALIVE and with minimal injuries. The French Police does not fit that description, because as the Islamist terrorist attacks showed, when the French Police should shoot, they do not shoot and literally get killed themselves, they lack the firmness, and when they should withhold themselves, like with the unarmed yellow-vests-protesters, then they over-react and shoot and injure people.",
				"added": 1578000844
			},
			{
				"comment_id": 98,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1502_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): try to calm you(it- the body) won't work\n\nPlease define \"calming a body\"? What I meant by \"calm approach\" is that I won't go with the first emotion, I try to understand the situation first and then decide, what to do. I am NOT IGNORING my emotions, I know that they are there and that there are reasons for that, as described at the cognitive model that the cognitive psychotherapy is based on. I suggest the following book:\n\nhttp://www.brainrules.net/about-brain-rules",
				"added": 1578003850
			},
			{
				"comment_id": 99,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1503_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You don't understand that you're a body, and think you're a person with a body. Except that a person biologically doesn't exist.\n\nSo according to Your understanding if a computer runs some AI entity then that AI entity does not exist just because it is a software phenomenon and software is run by hardware? Or do You claim that software can not be moved or copied from one computer to another, like the cloning of VirtualBox virtual appliances, \nhttps://www.virtualbox.org/\n?\nOr do You claim that the VirtualBox virtual appliances can not be cloned and treated as separate virtual appliance instances, because ultimately they are still run by hardware (\"a body\") and working system(\"a human\") consists of hardware that runs some software? Or is Your understanding that human brain is not a specialized computer that runs its own specific software? \n\nDuring medieval times there really was a belief that thinking is something that can not be separated from the physical body, until it turned out that machines can be made to calculate, which was considered to be a thinking activity. A state of one physical machine, let's say, a laptop computer that runs a virtual appliance, can be saved and another physical computer can then resume the work of that virtual appliance. That's like, one human body stops the thinking activity at the middle of a thought and another human body continues the thought after the brain state of the first human body has been cloned to the other. (In practice human brains differ and cloning like that won't work, but suppose the brains were physical clones.) Years went by and then the \"miracle\" of making a machine to \"think\" chess moves was devised. Nowadays there are even software simulated \"neural networks\" and calculation capacity wise it turns out that the whole human brain can be simulated in a single huge data center. The only thing that is missing, is the software, but that can not be created without giving the \"child-robot\" that is remotely connected to its brain, the datacenter, sensors that mimic that of the human body. The falls, the bee sting, the ant bite, the burning sensation of the candle light, the joy of masturbation, the cold of sea water, the hot of sauna and the sun, the feeling of a cool breeze during a hot summer day, etc. Technically doable, but imagine, if You had to be constantly \"profitable to Google\" to keep Your remotely located brain powered on and You would not have any privacy at all, as literally Your every move, including moves during sex, would go to the Google datacenter.",
				"added": 1578006496
			},
			{
				"comment_id": 104,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1504_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): there's no magic in a code. Input/output, that's all there is to it. There can't be an intelligent process \"that learns by itself\". The program works \"for the programmer\", depending on what the programmer \"put in it\". Nothing \"else will come out of it\".\n\nLearn the learning algorithms. It's a whole branch of computer science. \nhttps://www.youtube.com/watch?v=iNL5-0_T1D0\n\nA simple proof that You are wrong about the programming putting everything in at programming time:\n\n    read -p \"Please enter text: \" INPUT_FROM_OUTER_SPACE\n    echo \"The programmer of this Bash script did not write to the code: $INPUT_FROM_OUTER_SPACE\"\n    echo \"Neither were the random generator output values preprogrammed\"\n    uuid\n\nYou may also search for \"genetic algorithms\", \"Constraints based programming\", \"Logic programming\". You might want to ask Yourself, if humans aren't self-learning, then who \"put everything in them\", who  \"programmed the programmer\"? If \"evolution\" qualifies as the \"programmer that programmed the humans\", then why don't the \"genetic algorithms\" qualify to \"program the computers\" according to Your possible world view?\n\n> [h3bhkj5gqz4n3pjm](#comment_1504_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's impossible everything you've learned, is Unique.\n\n> [h3bhkj5gqz4n3pjm](#comment_1504_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): all are Memories.\n\nIndeed, if You take a photo of a busy city street, then that photo will also be probabilistically totally unique, because there just was not no other camera with those camera parameters at that angle at that location looking at that busy city street with exactly those humans and cars being exactly at that particular position at that particular lightning. Totally unique. And yet, the image has structure THAT IS NOT UNIQUE and not all of that uniqueness is being used for learning. A lot like tree branches swinging in the wind, with the leaves of the tree as a group of leaves probabilistically being at a totally unique position that even a single insect on any one of the leaves changes. And yet, the idea, the structure of the swinging tree branch is not unique. But even if it were, software is software, data is data and data can be copied, data as a representation of software can be copied and executed on another compatible computer. \n\nOne interesting thing about computers and software is that it is possible to be totally mathematically correct and exact and at the same tame tell nothing about the system as a whole, a lot like all possible information about a brick of a house does not say all about the houses that can be built from such bricks. I may say that mathematically it is correct to say that the moment there is a way to crate a Boolean logic operation pair (negation, conjunction) or the pair (negation, disjunction), it is possible to use the \n\nhttps://planetmath.org/DeMorgansLaws\n\nfor creating all the rest of the Boolean logic functions and with the use of the feedback loops the flip-flops and registers and summation circuits, integer multiplication circuits, etc.\n\nhttp://www.csun.edu/~rd436460/DigitalElectronics/Chapter%205.pdf \n\nand from there onwards it is possible to create RAM-machines (modern classical CPUs are all RAM-machines) or stack-machines, like those of the Java VM or Forth programming language based microcontrollers at\n\nhttp://www.greenarraychips.com/\n\nor whatever other appliance that we nowadays call \"a computer\". But that does not say anything about the actual architecture details of the machine. It might e a singe core Intel 386 CPU or some multi-core ARM CPU or some GPU or some FPGA/CPLD or some neural network simulating SoC or just some \"small\" 8bit microcontroller (quotes, because there are over thousand logic gates even within the smallest of the microcontrollers). That is to say, just claiming that \"it is just an input-output thing and nothing more\" is formally correct, but TOTALLY INCONCLUSIVE. Formally, of course, You can say that a computer is just one state machine that has input-output and nothing more and You are correct, but at the same time You totally ignore the aspects that are related to the state of that state machine. There's A LOT in that state, just like a computer with installed software does not differ from itself from the era, when software was not installed to it, by anything other than just some bits at its hard disk. It's just input-output and some state description bits on hard-disk, and yet, there IS a HUGE DIFFERENCE. People spend their whole careers MAKING ONLY THAT DIFFERENCE, creating that state description, CREATING SOFTWARE.\n\nBasically, You might ask Yourself, WHAT IS INFORMATION in Your human model context? The mathematically correct answer that information is a series of bits, DOES NOT QUALIFY, because if it did, then You would have to admit that human brains run software that can be described by а series of bits and all the rest of it.",
				"added": 1578012469
			}
		],
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 97,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1481_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): The generation of the 'boomers grandparents' is the only generation in the 20th century 'that I have respect for' and those before them.\n\nYou are totally forgetting, who created the WW2 and the segregation of blacks and the repression of homosexuals, not to mention the women's right to vote, etc. There are also differences in regions. For example, the Soviet Union was a horrible place, \"racism\" was not something that went on the borders of skin color, but on the borders of nationality, but at the same time, since the \"enemies of the people\" could very well be totally white Europeans and the \"niggers\" were truly a minority, there just was no segregation of the black people in the Soviet Union. Those were repressed anyway by other means and the movement of \"whites\" was limited by \"closed cities\" and \"closed islands\" that had some military installations or military factories in them or on them. Hobby sailors and even professional fishermen needed special permits from the KGB to \"go to the sea\". \n\nSo, please, do not idealize any generation. Just try to make it so that the ills of Your own generation are reduced by that tiny bit that You can reduce.",
				"added": 1578003364
			}
		],
		"1578001269_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 100,
				"body": "I guess the question is not specific to satellite phones, but rather, what will happen, if the twisted pair cable is pulled from the machine while it is downloading something. May be one way to test it is to buy an ordinary cheap WiFi router, connect its WAN to the so to speak home nework, \"home LAN\", and the LAN side of the router to the computer that runs the ZeroNet. Then configure the router so that it throttles down the internet connection to some extra sluggish speed and then start downloading some certain Zite. Pull the twisted pair from the computer at the midst of the download. \n\nThat test won't test all corner cases and it's not a replacement for reading the actual ZerNet code, but it might be a useful test after the answer seems to be known from the code review.",
				"added": 1578007472
			}
		],
		"1577943220_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 101,
				"body": "> [randomshits](#comment_389_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Just remember that no matter when or where you do it, someone, somewhere in this world, is fapping with you. :) Because that's the magic of probabilities.\n\nI love that answer! Well, about \"unwinding\", I do not know, there are better ways for that, I guess, but masturbation can be a nice way to get off sleepiness, because the heightened heart rate and some extra adrenaline sure works well for a short wile, at least until an orgasm. Yet, it is recommended not to stress one's body with endurance sports and sex/masturbation, when being very sleepy. Jogging, gym, sex, masturbation should be reserved for the time, when a person is well rested, but, on the other hand, masturbation/sex is not as stressful as running/jogging, so it's OK to do it before going to sleep. Just that, unless one has one hell of a hard-on, leave it to the time You wake up, not for the time You try to fall a sleep.  In my case, during the rest of the day, it depends on the mood. I do not mind or limit it, but it just so happens that there are so many other interesting thins on my mind that it's just something that I tend to do regularly in shower, not at other times.",
				"added": 1578008308
			},
			{
				"comment_id": 102,
				"body": "> [draugrdeathlord](#comment_162_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): That depends fke coz if you go for a massive triple orgasm Oddysee using a fleshlight you're heart rate and pelvic floor muscles are going on a hardcore workout !!\n\nWell, it makes sense to choose the timing for that activity then. My recommendation is to use a \"stroker\" in stead of a \"fleshlight\". It's like a fleshlight, except that it can expand. The fleshlights have the problem that the hard outer core of them squeezes too much and unless the soft side of them is slightly over the plastic edge, one may accidentally hit oneself with the fleshlight edge. I haven't had any permanent injuries or scars like that, but it did hurt. The \"strokers\" are really nice and safe, if used with proper silicon based lubricants.",
				"added": 1578008712
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 103,
				"body": "You may try to use paint bullets. The rest of Your argumentation is nonsense, but a paint ball bullet WITHOUT HURTING OR BREAKING ANYTHING is quite a nice response, provided that You do not \"get caught on camera\" doing it. So choose Your angle and do not walk with the paint bullet gun in front of the camera. Or better yet, use a self-made sling-shot to throw some ordinary children's paint at it. Another option is to use an ordinary laser pointer and place it firmly pointing directly to the camera. Test the pointer with Your cellphone camera first. The laser option is best, because it does not leave any traces for the Police to accuse You of and You may say that You were just working on a light show and all Your neighbor's talk is \"without any sound argumentation about Your wrongdoings\". ",
				"added": 1578009104
			},
			{
				"comment_id": 105,
				"body": "> [hferbwauif](#comment_35_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): it's much easier to see a laser than a pellet gun projectile, and I wouldn't know how much damage I inflicted, if any.\n\nIt was NOT meant to inflict any damage to the camera, just render it useless by blinding it. Another option is to place a huge, powerful lamp pointing \"partly\" to the camera and that means that the image is adjusted to the brightest light source in the view, just like pointing a cell phone camera towards the sun darkens everything else in the view. It won't give perfect privacy, the images might be still processed to see the rest, but it certainly ruins the easy use of the footage. Besides, may be the camera is not even meant to film Your yard, it just accidentally films Your yard and they actually care only about their yard. Have You discussed an option that they just self place a blinder in front of the camera so that only their own yard is visible? May be they'll even show You the image of the camera so that You can verify that at least temporarily the blinder works? If that does not work out, then You also have an option to place 2 cameras looking at their yard and at some point they might want to remove their camera as an exchange move. Besides, if they really want to spy on You, then they can do that covertly anyway,   without placing any such camera up that is visible to You. You are probably totally over-reacting here.",
				"added": 1578013630
			}
		],
		"1578028720_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 108,
				"body": "In my view the main beauty of the ZeroNet is that it TECHNICALLY DELIVERS and is ARCHITECTURALLY WELL THOUGHT OUT, unlike FreeNET and many other P2P-lets-make-the-Internet-free-again-Hurray projects. The closest project to the ZeroNet project that I know of is the Dat protocol based \nhttps://beakerbrowser.com/\nbut it has the problem that it is so closely tied to the browser that the long term availability of the deployment deliverables of the Beaker Browser project is questionable. \n\nThe main problem with the FreeNET is that it can be compiled with a very specific Java version and some of its dependencies are de facto closed source, because the source has not been stored at the FreeNET's own repository and the original authors of the dependencies have not kept their open source project online. The FreeNET has a honorable place in the history of the free-er-linked-document-collections, but it is a dinosaur.\n\nThe downside of the ZeroNet is that its newest GitHub versions that are written in Python3, do not run on the distros that I have tested them to run on, so I have to run one older ZeroNet version that uses Python2. If the ZeroNet developers do not get that issue fixed and just think about new features without thinking about robust availability, then the ZeroNet will go down the same tubes that the other lets-make-the-Internet-Free-again projects have gone. \n\nInterestingly the lets-make-the-Internet-Free-again type of projects tend to be with a really shoddy architecture, their authors seem to be some sort of applied artists, web developers, not software developers, because their code dependencies have not been carefully chosen at all, their code tends to be just smashed together from whatever-happens-to-be-fashionable-today, without any kind of thought put into the long-term availability of those dependencies or what the dependencies themselves depend on. Sometimes I have an impression that some artist type Social Justice Warriors develop those systems, not professional software developers. The ZeroNet seems to be a nice exception to that nasty \"rule\".",
				"added": 1578031490
			},
			{
				"comment_id": 113,
				"body": "> [xcape2net](#comment_641_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I noticed after the middle of November that ZeroNet no longer runs in the offline mode. T\n\nClone an older version from the GitHub repository. Something from year 2018. That's what I'm currently using. Sometimes software projects go some screw-up phases, like the MySQL did. MySQL server was fine, until the Oracle acquired it. After some time it had a fork, the MariaDB, which works fine and as of 2020 the MySQL PHP-drivers are left to bitrot, whilst the MariaDB drivers are being properly maintained. The ZeroNet guys got some money and I guess that they develop the ZeroNet in business-software-style now, meaning, crap is unavoidable. Just test a specific version from the GitHub repository and stick to that in stead of using the mainstream newest version. If enough people stick to the old and working versions, then the developers might be less motivated to screw_up/change the ZeroNet protocol.\n\nOne serious conflict bound to happen is the storage policy of zites. Different people have different wishes about whether locally rarely viewed zites get automatically deleted or not, but the moment the software gets optimized to benefit most of its users, it is optimized according to the needs of an \"average\" user, because, that's how the benefits for the most of its users is achieved. The non-techies will have very different requirements and wishes for very many things that the \"geeks\", techies, prefer to be their way. That's why there just HAS TO BE 2 branches, forks, of the ZeroNet: one for the \"masses\" and one for the technically inclined, a lot like there are text editors: Vi/Vim/Emacs/IDEs for the technically inclined and LibreOffice/Microsoft_Word for the masses.",
				"added": 1578098761
			},
			{
				"comment_id": 114,
				"body": "> [xcape2net](#comment_646_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The strange thing is that I had a ZeroBundle (python 2) that was working offline. But now, even it doesn't work offline, unless I prevent it from connecting to download new content.\n\nOn Windows10 Windows Subsystem for Linux You may try to use \n\nhttps://sourceforge.net/projects/mmmv-repackaging-projects-t1/files/repackaging_projects/repackaged_ZeroNet/\n\nThe video that shows the few code modifications that are necessary to run it on Windows10 Linux layer:\n\nhttps://technology.softf1.com/software_by_third_parties/ZeroNet/2019_11_24_initially_failing_and_Ctrl-c-killed_unprepared_Estonian_demo_t1_how_to_get_the_2018_11_08_ZeroNet_Rev3703_mmmv_repackaging_t1_to_run_on_Windows10_Linux_layer.webm",
				"added": 1578138058
			},
			{
				"comment_id": 115,
				"body": "> [1bfqutudhtexlka](#comment_146_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): no one can censor anything\n\nYou are totally WRONG about that. The current ZeroNet depends on the IPv4, which is totally censorable. All of the international connections are totally censorable. The WiFi mesh networks are susceptible to plain radio jamming. Optical links and privately placed cables between nearby neighbors combined with a variety of gateways to the IPv4 network and other networks like the Usenet and FidoNet can work, but not that many people want to build custom data networks, not to mention the few hundred € and a lot of personal time that it takes. I guess a place like the \n\nhttps://www.seeedstudio.com/\n\nmight be a fitting place for a small series production run based custom hardware sales, but even then there's probably not that much of a market for those kinds of devices. The Lets-Free-the-Internet crowd seems to consist of mostly artists, who think about beautiful pictures and fun social interaction, not engineers/developers thinking about actual technical challenges. If You want proof of the possibility of technical censorship, then You may want to study, how the Soviet Union enforced the \"iron curtain\" and what horrible efforts people had to make to get even a small amount of text out of the Soviet Union to the West. Or, You may want to test out, how easy it is for You to communicate with some rural area in the middle of China or some small islands at the middle of the  Ocean. Keep in mind that small cube-satellites can be shot down by China, U.S., Russia, ... You may start with something easier: connect Your parent's house or girlfriend's parent's house with Your place so that at least some slow connection prevails even, when phone networks and the ISP lines go down. Amateur radio is not an option, because that channel does not scale, but Your test-solution should be designed to scale from the very start. For the sake of simplicity, it is OK for the connection to be down during stormy weather, fog, rain, snowfall.",
				"added": 1578138407
			},
			{
				"comment_id": 133,
				"body": "> [xcape2net](#comment_648_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I use Linux Mint 17. I try to avoid Window as much as possible.\n\nThe package is Linux specific. The possibility to run it at the Linux layer of the Windows10 is just a side-effect.",
				"added": 1578207412
			},
			{
				"comment_id": 136,
				"body": "> [realiodine](#comment_1_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): What distro are you using? I have ZeroNet servers set up on Mint, Debian, and Devuan, and all of them have worked \n\nopenSUSE Linux. I do not know about the RedHat Linux, but if You plan to do extensive testing, then I suggest that You also add the RedHat Linux to the mix. Ubuntu does not qualify, because another name for the Ubuntu might as well be \"The Actual Debian Stable\" and You already have the Debian among the distros that You test on. You might also want to add the \nhttps://www.gentoo.org/\nto the mix. Basically, what is needed in the set of test-distros is that the test distros have vastly different package collections, preferably different packaging systems. The next step from there might be \nhttps://www.freebsd.org/\nI have not tested the ZeroNet on the FreeBSD, but out of all BSD distros, it is the most prominent one. Even step further is the \nhttps://www.openbsd.org/\nand the GNU Hurd Debian distribution\nhttps://www.debian.org/ports/hurd/\nAnd, as always, final testing should be done on a freshly cloned virtual appliance, not only on real hardware or previously \"tainted\" virtual appliance.\n",
				"added": 1578247724
			}
		],
		"1577813526_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 110,
				"body": "Evolution also has a place for dinosaurs: under the ashes of the giant meteor. The same goes for old business models.",
				"added": 1578095296
			}
		],
		"1578065196_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 111,
				"body": "I'm a native European, not an Iranian, but the issue with the Iran tends to be that the U.S. screwed up by placing a violent dictator in power there and the end result is that the locals were choosing the lesser evil out of 2 evils. One choice was a functional brutal dictatorship, backed by the U.S., and another choice was a back-in-the-day-NONFUNCTIONAL-religious-mad-sect that only talked about brutal treatment. So, the Iranians were practical to overthrow the dictator and the Islamic madmen sect took over. The really good thing about the Islamic madmen sect is that they know from their personal history that if they go too brutal, they will also be overthrown, just like they themselves were leading the overthrowing of the previous dictator, so they apply their brutalities only on dissidents, not large masses and allow those types of protests that they, the Islamic madmen sect, approves. \n\nFor comparison, in Saudi Arabia absolutely all protests, even the ones favoring the the dictatorship, are banned and protesters are literally executed by cutting their heads off with swords at public square. In Iran, on the other hand, the dissidents do not immediately get executed, they \"just\" get tortured and spend ~50% of their life in horrific prison conditions and eventually, sometimes, can even get out of prison after serving their \"sentence\", after which they may escape to the West. As the CSIS think-tank schoolar, Jon Alterman\n\nhttps://www.csis.org/people/jon-b-alterman\n\nput it at one of the Iran related presentations, a rough citation: \"The Iran has a glimmer of hope that the North-Korea does not have.\"\n\nMy subjective summary of the situation: the middle-east and that region in general with the various Islamic madmen is, what it is, but using violence for introducing any \"progress\" has failed repeatedly and Americans are HORRIBLE at learning from history, except once: Americans got it right after the 2. World War and the success-story of the Marshall plan is the Western-Germany and France. The Egyptian Alexandrian library got destroyed, because the then-elite wanted to enforce progress with violence. The Arab Spring with the fall of the Egyptian dictator, Mubarak, showed that if the pro-Western political party applies violence, it looses legitimacy and falls. The fall of the U.S. backed Iranian dictator, which got replaced with the current Islamistic madmen, follows the very same pattern. The post-Iraq-war Iraq buildup seems to fail due to the same problems: the U.S. backed puppet government started to apply violence in the form of ethnic cleansing and the result is a civil war. And, of course, now the Syrian ruins: the dictator Assad lives at a ruined region mostly, because it preferred violence in stead of non-violent options and as of 2019 the Assad is alive mainly thanks to Russia, not even backed by the U.S. You may compare the ruins of Syria to the fancy warm weather cafeterias of Greece, Italy, Turkey. Just imagine the contrast: a Turkish beach, where European tourists go to enjoy themselves, and then the Syrian rubble, Assad with its huge amount of bodyguards at every step of the way, always trying to hide its location to avoid a missile attack or attack by some really vindictive people, who want to get back to the Assad for killing their children, grandparents, loved ones.\n\nJust imagine, what it must look like in the capital of the Iraq, the Baghdad, if some guy there can be killed by a U.S. drone, IN THE CITY, not with a gun-shot, not with a sniper-rifle shot, but with a ROCKET that blows the windows of nearby buildings off. Would You imagine the Police having a gun-fight in New York and then using something that blows the windows of near-by buildings away just to kill the bad guys? Baghdad must still be a war zone or that kind of weapons would not be used in the city not even by the CIA or whatever other branch of the Washington establishment. Not to mention, what a hell did a 3. party high-ranking general do at that city anyway during a civil war.",
				"added": 1578097048
			}
		],
		"1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 112,
				"body": "> I will publish any content except illegal zites (i will not share piracy, racism, black markets, pedo, terrorism, etc...). I will not discriminate any site for having different ideas from mine\n\nExcept the \"piracy, racism, black markets, pedo, terrorism, etc\". It's like, Russia has great freedom of speech, as long as You do not talk/write what the Kremlin does not like. But, otherwise, I do not want to downplay the nice incentive. Due to the cost of storage space people have to choose anyway, what they publish/mirror on P2P-systems and everyone of us has their preference, which should be respected. I find it to be very nice that people host/mirror the material that they themselves consider valuable. Thank You for Your kind service, it is VERY WELCOME and VERY USEFUL!",
				"added": 1578098143
			}
		],
		"1578088043_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 116,
				"body": "There are also those places:\n\n0dev Talk:\nhttp://127.0.0.1:43110/142jqssVAj2iRxMACJg2dzipB5oicZYz5w/\n\nZeroNet Dev Center\nhttp://127.0.0.1:43110/14pM9huTYzJdyQyHRj6v2kfhMe8DrxwpGt/\n\nZeroDocs\nhttp://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/\n\nZeroBlog\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Home",
				"added": 1578140100
			}
		],
		"1578171588_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 117,
				"body": "> [6283822](#comment_13_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): I think it's zeronet scaling issue may be\n\nOne scaling issue that the ZeroNet certainly has is that all of the downloaded zites are at a single folder, the data folder. File systems become slow, if a folder has about 10k files or folders. The solution to that problem is what the doxygen has been doing already over 10 years: distribute files in a tree of folders so that no vertex has more than about 2000 children. In the case of the ZeroNet, the zites have a nice semirandom address, so in stead of placing the zite folders directly to the data folder, the data folder might have a subfolder called \"zites\" and that might then have subfolders that match with the first letter of the zite address/folder name. The idea would be:\n\n    data/zites/a/F/aFOOdowjfoipfioeripoufgeripfgdipridfh\n    data/zites/a/B/aBARdowjfoipfioeripoufgeripfgdipridfh\n    ...\n    data/zites/A/w/Awwwwwwwwwwwwwwwwwwwwww\n    data/zites/A/x/Axwwwwwwwwwwwwwwwwwwwww\n    ...\n    data/zites/b/F/bFOOdowjfoipfioeripoufgeripfgdipridfh\n    data/zites/b/B/bBARdowjfoipfioeripoufgeripfgdipridfh\n    ...\n    data/zites/6/F/6FOOwhateverelsetherestoftheaddress\n    ...\n    data/zites/z/F/zFOOwu33349yu890777777777777777\n    data/zites/z/B/zBARwjow98292984y24248723642348\n\nAdding just 2 layers like that will already alleviate the situation a lot, because with case sensitive characters, each having at least 26*2=52 values per character, with digits 52+10=62 values per character, a 2 layer solution minimizes the number of zite folders per folder by at least 62*62=3844 fold. Not good enough for proper servers and data centers with distributed file systems like the\n\nhttp://www.xtreemfs.org/\nhttps://www.beegfs.io/\nhttps://www.gluster.org/\nhttps://lizardfs.org/\nhttps://moosefs.com/\nhttps://tahoe-lafs.org/\nhttps://ceph.io/\n\nbut good enough for a start. 4 layers does not hurt either, once You're already at it.",
				"added": 1578191341
			},
			{
				"comment_id": 118,
				"body": "> [quantumkitty](#comment_323_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): That goes directly against the entire purpose of ZeroNet IMO. Ads are also not a sustainable business model in the age of information and AdBlockers.\n\nPlacing adverticements to a project like this is quite a dirty thing to do and certainly NOT in the spirit of the open source movement, but the nice thing about the open source solutions is that if the mainstream developers decide to ruin the trunk of the project, it is possible to clone some older version that has not been ruined yet and to create a clean fork. At some point it is quite questionable, which branch is the \"official main\" branch. It's actually the communication protocol that defines a \"network\". Just like with physical computers: the computers may vary, but as long as they can all speak the same protocol, they can be connected to the \"Internet\", the IPv4 network. Or email clients and email servers: as long as they are able to speak the protocol, it does not matter, if some company decides to create a total spyware email client that sends all of the user's mails straight to the FSB/KGB/NSA/NameYourSpyagency. It's the protocol that matters. Forking for saving a project has been done before, multiple times. An example is the MariaDB. But there's also the \nhttps://www.biglybt.com/\nthat got forked from an older version that wasn't ruined by corporate nonsense and then developed further to implement something that serves the end users in stead of serving some corporate money earning interests. There's also the 3 I-s: Innovators, Imitators, Idiots. The details:\nhttps://archive.is/N4Q61\n\nIn the case of the ZeroNet: first came the Innovators, who truly created the project. Then came the \"imitators\", people, who contribute to the end-user-serving software. At some point there will come the Idiots, the ones, who place advertisements or something even worse to the ZeroNet client. There's also the question, how the advertisements have been implemented in terms of preserving end user privacy, because a direct download from an advertisement serving clearnet server certainly eliminates the privacy of the user.",
				"added": 1578194761
			},
			{
				"comment_id": 119,
				"body": "> [6283822](#comment_21_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): access it in your preferred way, it is your choice what you make.\n\nPrecisely so. That's the beauty of the open source approach and I do NOT support any kind of limitation on the activity of the idiots. They must have the right to do their thing and I'm glad that they have that freedom. But I also have the freedom to think of their activity what I just described. By the way, may be the ZeroNet will also have its own \"Fediverse\",  a lot like the P2P social networks have:\nhttps://fediverse.party/\nThere might be different ZeroNet clients and different people pick what they like. May be some might even like totally closed source options and I would find it quite fun, if the Micro$oft came up with its \"ZeroNet Explorer\". The BitTorrent protocol certainly has taken off like that and the BitTorrent protocol is a total success story.",
				"added": 1578195480
			},
			{
				"comment_id": 120,
				"body": "> [quantumkitty](#comment_324_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): few are willing to donate to creators.\n\nMay be love should not always be for money and may be to get sex, one may also give sex. May be to get  \"free stuff\", like open source software, one can \"give free stuff\", like open source software.",
				"added": 1578196017
			},
			{
				"comment_id": 121,
				"body": "> [quantumkitty](#comment_326_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): That's another way to look at it. You come to ZeroNet to get free stuff, and then you offer your own time and effort for free.\n\nThere's also the idea that money is a computer game points sum for settling scores for MANUAL LABOR. If machines do the work, there's no need for manual labor. Guess, which side wins: automated industry or manual labor? Guess, which investment of one's MANUAL LABOR gives more back, labor for automating work X or doing the work X manually? \n\nFrom that point of view, it's OK for things to be expensive, as long as one can afford them, but even a slight constant fee, just a few cents per year, is NOT OK. Basically, it means that to create a proper ZeroNet server, that server should be run from its own solar panels and use some \"free\" internet connection, which can be some grassroots mesh network, not the one from a money-operating ISP. The ISP's are a compromise solution. I admit that currently I'm also using an ISP, paying monthly internet bills, but I see it as a compromise, not a proper solution. A proper solution according to my view is that the level of automation is so high that even if a person gets totally broke, the basic services like electricity, water, network, heating, transportation, etc. are all covered. There will be some manual labor involved with medical services, but I believe that in the future even those can be automated to a greater extent. For example, how hard is it for a robot to drill human teeth without hurting the patient? A dentist should not waste its time on such mundane things, just tell the robots the procedure plan and literally see multiple patients at once. The epoxy that they use for fixing the teeth is just chemistry, a substance, like UV-hardening glue, which might be also produced in an automated manner as a high quality product. The computers have certainly come a long way in terms of lowering price and increasing quality. Why not the other services and technical solutions.\n\nI admit that the current medical robots are a horror story, but so is all software development in general: there are people, who do a good job and then there are the sleaze-balls that ship crap for the deadline just to earn a lot. You know, the likes of Micro$oft that take the market by clever marketing and deliver crap, because people pay the bill anyway. A very useful link:\n\nUncleBob Expecting Professionalism (Kuppelsalen, Copenhagen)\nhttps://youtu.be/BSaAMQVq01E?t=359",
				"added": 1578196381
			},
			{
				"comment_id": 122,
				"body": "> [6283822](#comment_23_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): i found zeronet i was joyful but after 2 years i hardly used it this is situation for most people i want to fill this gap on the network\n\nOne of the fundamental rules is that anything centralized is also centrally vulnerable. Businesses, even if they are a feelancer-and-its-cat type of businesses, are fundamentally centralized endeavors, because there is one party that ultimately needs to receive the money. Not even cryptocurrency helps against that, because cryptocurrency is useless, if it can not be spent and the spending can be hidden only as long as it is small enough to be one transaction series out of many. This is why truly end-user serving products can never be created by big businesses, unless they are something very simplistic like raw metal, plastics, paper, gasoline, etc. Negative examples include the \"requirement\" that phone companies allow the governments to spy on people and the printer ID dots inserted by printers. If all food came from one manufacturer, then there would be a \"law\" that the government places whatever substances to that food to have better control over its subjects. In Europe there are social demands, propagandistically called as \"laws\" (as if they were math laws or laws of nature) that cover \"hate speech\". ThePirateBay founders know it from first hand experience, to the point that they had to sit in prison, what centralization means in IT. \n\nMy point is that some things should never  use a business model, where the company has any practical control, unless Orwell 1984 is considered OK. People need to exchange services, because nobody can specialize at everything, which explains the fundamental need for money, but the aim should be to make the clients as autonomous as possible, because otherwise there is centralization and centralized things are centrally vulnerable.",
				"added": 1578198452
			}
		],
		"1578154157_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 123,
				"body": "> [anon05](#comment_29_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Because ZeroTalk barely gets enough traffic as it is for my tastes. Any other site on ZeroNet is basically dead except for the pornposting on Millchan.\n\nBut then it is a social issue, not a technical issue. The same thing with censorednet eshops: You may host Your own eshop that has all the right features, but unless You have a huge marketing effort behind it, You will never beat eBay even if You had greater servers than the eBay datacenter has. I suggest You study psychology for finding the answer to those social matters. For example, once upon I time I asked one sociologist(however they like to call themselves) that what is it about the Facebook that makes people to use it, because feature wise it is CRAP and its usability in terms of being intiuitive is also CRAP. \n\nI first suspected that the popularity of the Facebook has something to do with the marketing curve that first there are the early adopters, the bright ones, who are on a constant lookout for better solutions, then there are the ones, who seek for practical value and then there are the ones, who start using something only after all of their friends and co-workers use it, with an excuse that everybody uses it, therefore I also must be \"there\", where everybody else is. But, I was mistaken. The main logic, according to that sociologist, why people use Facebook, is that it feeds their ego: they can be superficial and look at the mirror, how good and nice THEY, THEMSELVES, are. Other people then can also be superficial and click like-es, which in turn gives the impression that there is group approval. So people just live in those fake narcissistic bubbles, enjoying the beauty of THEMSELVES. I believe that this scheme can not be possibly beat by a proper communication tool that has other goals than to place people in their narcissistic bubbles. \n\nSo, \"better\" than ZeroNet, well, if You want huge and superficial crowds then no proper tool will ever beat Facebook, just like no catholic church bible studies will ever beat PornHub, unless they modernize the bible study group meetings to be group orgies. There's just that stark of a conflict of goals. But from technical point of view, a very similar thing to the ZeroNet is the \nhttps://beakerbrowser.com/\nI like to think that if You are looking for some P2P style FTP analogues, then there are the GNUnet and the \nhttps://ipfs.io/\nHowever, one of the properties of many P2P systems tends to be that less popular storage items (zites, files, whatever it happens to be for a given P2P system) tend to be auto-deleted from the network. Hence the \"permanent hosting\" services like the Beakerbrowser\nhttps://hashbase.io/\nhosting service. They might as well expand their services to other P2P-networks, because the situation is just that bad. At the same time, central things are centrally vulnerable and they probably are not able to host \"hate speech\" or what ever else the governments like to limit, be it democracy related material in China or child porn in the West. For the record, the Islamists huge prophet, Mohammed, married a 14-year old girl and there is even a mainstream music video that run on MTV about it, just that the westerners were too stupid to understand that this whole music video is actually about child molestation.\n\nKhaled - Aicha\nhttps://www.youtube.com/watch?v=gzlHucbD76U",
				"added": 1578200024
			},
			{
				"comment_id": 124,
				"body": "> [anon05](#comment_34_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): If I am technically able to censor users, like minded people won't flock to my site. If I'm not technically able to do so, they will.\n\nAssuming that they will not delete their own posts from the forums that they themselves control, the solution might be a classical RSS reader. There's a distinction between being able to publish something after one has lost control of one's own servers/keys and being able to publish something while having control of one's own equipment/accounts/keys. There's also the problem that any truly anonymous forum, even if its initiator/hosting_party can not censor it, can be just  flooded with robots. The Bitmessage tries to limit that with \"proof of work\" based signing, but clearly a government is able to just put a whole datacenter behind the effort and still flood it with crap, effectively censoring it, which means that ultimately people have to be able to automatically filter all posts. Poster ID based filtering is effective, but it eliminates newcomers, who just lack the reputation points to pass the filter, not to mention the use of temporary IDs without explicitly tying the IDs together. \n\nProbably the best option is that people run their own blog software Zites and the reading of those Zites is done by having an ordinary RSS-reader scan them, just that the RSS address is then the ZeroNet specific 127.0.0.1:43110:/foo and Your role is just to list the blogs at Your Zite, so that people can initialize their RSS-readers.",
				"added": 1578201013
			},
			{
				"comment_id": 125,
				"body": "> [anon05](#comment_38_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Problem with RSS is they need to be running a server 24/7 or people won't be able to see their content.\n\nI'm not sure that I fully understand, what You mean by this. In the case of ZeroNet forums, the ZeroNet forums are readable from a local machine even, when there is no internet connection. To get data from one computer to another there is a need for some kind of a data transfer anyway, be it phsyically IPv4 network or some USB-stick or DVD or even paper carrier. An RSS-reader that indexes ZeroNet forums actually indexes the URLs that point to the local machine, the 127.0.0.1:Foo . It's basically that in a way You are right: if a person wants to use a computer to read email, forums, chat-room content, then the person needs to switch the computer on and after reading it is OK to switch the computer off again, provided that the computer updated the data during the time, when a human was reading the email.\n\nThe RSS+ZeroNet approach is a modular approach. The ZeroNet handles the redundancy and data replication and the RSS reader handles the indexing, spam-filtering, analysis, search, the creation of  the discussion thread.",
				"added": 1578203069
			},
			{
				"comment_id": 126,
				"body": "> [anon05](#comment_39_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): what's the advantage over using ZeroNet over the regular web interface?\n\nThe very advantages, why the ZeroNet was created at first place: decentralization, data replication, data redundancy. ZeroNet is not just some forum software or yet-another-web-software. The anti-censorship measures can be seen a lot like in military terms \"security\" can be seen in terms of multiple, individual tasks that jointly provide the proper security. For example, part of the anti-censorship measure is data redundancy: blow up a datacenter or \"confiscate\" the servers, but data is in many places, too many places to \"confiscate\" or to blow up. Switch off the Internet, but if the zites have been previously downloaded like podcasting MP3-files, then people can read the forums/blogs even, when there is no internet connection. Securing something against attackers should be seen as a modular task that has sub-tasks. The ZeroNet has its role and the Tor has its role and the 2 together make a nice whole. You seem to have a task at hand that has sub-tasks that the ZeroNet+Tor handles very well.",
				"added": 1578203530
			},
			{
				"comment_id": 127,
				"body": "> [anon05](#comment_40_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Yeah, but how does using RSS with it improve any of that?\n\nIt does NOT and it is NOT even meant to improve any of that. It adds NEW FUNCTIONALITY by creating a forum thread from posts that only their authors can delete. I understand that You wanted a forum thread, where nobody can remove posts except the authors of the posts. That's what the RSS-reader creates, with the additional functionality of allowing the RSS-reader user to apply its own spam filters. A blog post would be in the role of a forum posting.",
				"added": 1578203819
			},
			{
				"comment_id": 128,
				"body": "> [anon05](#comment_41_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Then the main disadvantage is if the owner of the site deletes the post before me (or someone else) is able to connect.\n\nObviously You have to get the data to Your computer before it is deleted from all nodes of the network! What do You expect?!",
				"added": 1578204086
			},
			{
				"comment_id": 129,
				"body": "> [anon05](#comment_41_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): I wonder how mature and usable IPFS is.\n\nI do not know, but the way I understand, the IPFS is more like an FTP analogue, except that it is using a P2P network. In that case the solution might be some sort of a P2P-email service, where the individual emails form a forum thread. You'll need to write some custom software for that, unless You want to complicate things by trying to reuse the legacy email clients. Then the idea would be that the email would be some tar-file with some structured text, JSON, YAML, XML, with binary attachments(JPEG, GIF, MP4, WebM, etc.) and then those can be copied through whatever means, USB-sticks, plain FTP, IPFS, GNUnet, plain WWW, ZeroNet zites, etc. It would be a beautiful solution, but the reason why I haven't doen it yet, despite long planning, is that I'm not sure anybody would use it. There's the marketing side even with freely downloadable open source software. The ones, who just want to blabble around, are really not the kind of people, who are willing to lift a finger for trying out something technically novel, specially if they can just blabble on Facebook or whatever they happen to use.\n\ntar must be preferred to compression file formats like the ZIP to avoid a DoS attack, where multiple TiB of zeros is packed to a very small file. It must be assumed that some nodes in the network will be malicious in whatever way their authors wanted them to be malicious. A P2P network must be able to handle some DoS attacks from the various government agencies. The test case that I have used is a radio-jammed battlefield: how to send letters from such environments. The various WiFi mesh networks are really NOT an option there.",
				"added": 1578204553
			},
			{
				"comment_id": 130,
				"body": "> [anon05](#comment_42_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): That nofish or whoever else wouldn't be able to delete the data from all nodes of the network.\n\nThat assumes that people use multiple forks of the ZeroNet in stead of just all downloading from a single, centralized, source. The problem with the original authors is always that they might be compromised against their will. The Edward Snowden revealed that the agencies are \"hunting sysadmins\", but even more powerful than the sysadmins, who have access to only their own servers, are the software developers, who's creations go to the LAN's and servers of multiple sysadmins. So software developers are certainly a target for various agencies, specially, when their software becomes popular. Given that now Microsoft owns the GitHub and Microsoft has been willing to place back doors to its own software\n\nhttps://web.archive.org/web/20140715035007/https://www.theguardian.com/world/2013/jul/11/microsoft-nsa-collaboration-user-data\n\nYou can expect that \"to comply with the law\" the Microsoft will insert whatever the agencies ask to GitHub downloads. The authors upload malware free code and when somebody clones the code, the cloned code MIGHT be with malware from the agencies. So, the more forks there are \"in the wild\", the better, just like with genes: a biological virus or a bacteria might not be optimized to take down all of the population, only some creatures of the population. The centralized source should be seen as a blueprint for the forks to adopt components from there by thoroughly reviewing the code in the process of adopting the component source.",
				"added": 1578205425
			},
			{
				"comment_id": 132,
				"body": "> [anon05](#comment_43_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): If people had to manually install an update rather than potentially destructive changes being pulled automatically I wouldn't have any issues with it.\n\nWhat about initialization? If the malware is injected at the very first install, because it is known to the agency that people will be installing from location X, then my argumentation still stands. Also, if only the original authors are involved, then their thoughts are at the core of the project and they just can not spend that much time on analyzing, whether malware has been injected to their creations or not, specially if it takes place during the initial installation download and only with some of the downloads, not all of the downloads. There's the option that the initial installer hash is signed, like with Linux package collections, but do not expect ordinary end users to pay attention to those things. The Linux package installation system verifies the signatures and hashes automatically. I guess, if the original authors publish to some Linux package collection, then there might be a chance that things work out in favor of the end users, but that is NOT the case with source repository cloning.",
				"added": 1578206917
			},
			{
				"comment_id": 134,
				"body": "> [anon05](#comment_44_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Well you can't do every a 100%. There is always a hole for a sufficiently sophisticated attacker.\n\nRight, but I want to be AWARE of the hole and know the PARAMETERS of the hole and PLAN for fixing the hole, even if I lack the resources/time for applying the countermeasures immediately :-)",
				"added": 1578207794
			},
			{
				"comment_id": 135,
				"body": "> [anon05](#comment_45_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): I mean there probably are signed ZeroNet packages somewhere already, aren't there?\n\nI'm currently too stupid to know that.",
				"added": 1578211447
			}
		],
		"1578202687_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": [
			{
				"comment_id": 131,
				"body": "I don't know the answer to Your question, but I would start from the idea that different programming languages have different popularity among people with different occupations. That tends to influence, what is the quality of libraries for a particular task. For example, statistics related math libraries tend to be the best in programming languages that statisticians like to use, but anything that uses differential equations and numerical methods tends to be good in programming languages that physicists like to use. 3D-gaming engines are a C++ world, for historic reasons and because C++ is for speed, yet C++ is really tedious for string processing, it is only good for speed-optimized things and the actual string processing that is part of the stdlib of other programming languages is ultimately done in C or C++. May be in the case of P2P systems there might be some similar specialization, where people with different interests use different P2P-systems. The ZeroNet is certainly not for the most privacy conscious folk, those are at the Tor side. I guess the ZeroNet is more about P2P-blogs tunneled over Tor. However I would guess that if You create IoT appliance software that uses the \nhttps://matrix.org/\nor Bitmessage in stead of using the censorednet, then You might have a really good argument for the end-users indeed, specially if You have duplicate options, like if one P2P-network gets censored, Your IoT appliance tries another one. That's not just for the privacy of the end-users, but it makes the IoT appliance literally more reliable.",
				"added": 1578206386
			},
			{
				"comment_id": 137,
				"body": "> [quantumkitty](#comment_334_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I guess there are some things the internet will never be able to replace, like buying weed from a friend.\n\nThe internet alone, may be not, but the internet and some robotics might be another story. The old-school spies used to exchange information by drop-offs, exchange of physical packages that included documents, money. That was  back in the pre-internet days. Nowadays drones might use the same idea: one drone does a drop-off, the key to the beacon is transferred over the \"internet\" and the package maintains radio silence till it hears the properly signed, time-dependent, signal and then returns its exact Galileo/GPS coordinates in return. Then the receiver drone can go to the randevú. Another option is that the seller drone reports its coordinates over the internet before the buyer drone even flies out and maintains radio silence all the rest of the time. Obviously the Police will be listening and locating any drone radio communication, so the exact protocol needs to be refined to something that is totally radio-silent all the way, but You get the idea. One option might even be that the seller drone is a robotic submarine, surfacing only when needed. Both robots need to be fully autonomous, that is to say, there will be no humans controlling them in real-time.\n\nThe very same problem set is relevant for information exchange, not just drug sales. Drone as a \"letter dove\" and in stead of drugs the \"cargo\" is information. May be the information is exchanged by physically handling over some USB-stick, but that's a bad idea, because the USB-stick might be a homing beacon. A better version is to transfer the information from one drone to another trough the old-school IR-optical-data-link, except that some more modern and faster version of it should be used to speed up the data transfer. Electrical contacts might also do, but then there's a risk that one drone might accidentally fry the electronics of the other drone, so something optical is better. Optical connections do not leak radio-waves, if done right, which is another aspect of operation security. Basically, the drug sales and counter-censorship-measures have a lot in common in this case.",
				"added": 1578262892
			}
		],
		"1578266563_1EUN1RsCa7xATMJ76ecNX93ebVvxGY7sDz": [
			{
				"comment_id": 138,
				"body": "Here's an exhaustive link to a lot of \"offnet\" systems and much more, if You explore the wiki:\n\nhttps://www.softf1.com/cgi-bin/tree1/technology/flaws/silktorrent.bash/wiki?name=List+of+Similar+Projects\n\nYou may also read some ideas from\nhttps://bitrary.softf1.com/index.php?title=Software_Development_:_Security\n\nYou may also take a look at\nhttps://www.privacytools.io/\nhttps://www.freehaven.net/anonbib/\n\nYour competitors obviously include the Edward Snowden leaks distributors at\nhttps://theintercept.com/\n\nThe closest competitor to the ZeroNet is the \nhttps://beakerbrowser.com/\n\nThe ZeroNet actually depends on the \nhttps://www.torproject.org/\nbut You may also want to study the \nhttps://fediverse.party/\nhttps://matrix.org/\n\n",
				"added": 1578267421
			},
			{
				"comment_id": 139,
				"body": "> [draugrdeathlord](#comment_209_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): There are abandoned projects and half finished Zites that had so much potential. This to me is the biggest problem that needs a solution.\n\nThe issue with most Lets-make-the-Internet-Free-Again projects is that they are created by artists and \"social warriors\", not engineers. The artist types do not think about algorithmic complexity, scaling, DEPENDENCIES and the longterm availability of the dependencies and the DEPENDENCIES OF THE DEPENDENCIES. The artist types just slam something together with whatever tools/technology that looks nice at first glance, without thinking about the dependencies and dependencies of the dependencies, and obviously at some point the project is technically a wreck. \n\nAnother set of people that are hopeless, regardless of the amount of money that they receive, are the academics: those OVERPAID SLACKERS use an excuse that they get their grant money \"for science and not for engineering\", as if those two could be separated in the case of high quality scientific results. What the academics do is that they totally ignore the real-life-requirements like what happens to the system, when it looses power \"at the right moment\", or what happens to the software state, if the network connection is lost \"at the right moment\". They also ignore the fact that data that currently exists is in a format that existed IN THE PAST. So they just slam together some dirty hack that uses some really beautiful math, publish their paper and, if we are lucky, dump their dirty hack code for study online. Usually they won't even publish their hack code and just go to write a new grant application in stead of delivering a properly engineered REUSABLE COMPONENT that the software industry, including freelancers, the party that needs to pay for the scientists in the form of taxes, could actually use at their products. The end result is that there are plenty of computer scientists with PhDs in operating system development on the planet Earth, but only a handful of people like the Linus Torvalds and alike, who actually write the operating systems that actually run the Android phone, the data centers, the desktop computers, the Android tablet computers, the \"smart\" watches, the robots with Raspberry Pi-s. If even a fraction of those operating system PhDs contributed proper code that went into the Linux or BSD or some other opreating system kernel trunk, the world would be much better, but, hey, those guys get their grant-money without delivering anything reusable and on top of that THEIR ONLY DELIVERY, THE SCIENTIFIC PAPERS THAT WERE DEVELOPED FROM TAX MONEY, WERE NOT FREELY DOWNLOADABLE, were behind paywalls. What a HELL?",
				"added": 1578268564
			},
			{
				"comment_id": 140,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1544_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): put the commercials or the idealists at the top of the pyramid and 'see what happens'.\n\nCould You please elaborate on what do You mean by \"idealists\"?",
				"added": 1578269083
			},
			{
				"comment_id": 141,
				"body": "> [presstodigitate](): a company, ://DeltaNova.Media , which will specialize in fixing and utilizing the Offnets, to make Alternative Media Inherently Uncensorable\n\nI think that the best results will be achieved by focusing one's own speciality and then collaborating with others. For example, the medical projects of the Bill Gates are a huge waste of money, but for the fraction of the money he could have funded many IT-students to create start-up companies that really help the drug developing biologists to solve many serious problems. If You, the user presstodigitate, do not have a technical background Yourself, then please find Yourself a technical partner and focus on Your true strengths. The way I currently understand, Your actual current wish is:\n\n    1) Journalists at under repressive regimes publish something.\n    \n    2) People under repressive regimes can read, what got published \n       even after the journalists were killed, their private keys were all ceased and \n       their servers/accounts were all ceased.\n\nI suggest to divide that task into multiple sub-tasks and then customize the sub-tasks to the region specific circumstances. For example, it is not possible for anybody at a poor North-Korean village to read text from a computer, because computers are very expensive and catch attention due to their expense. In Africa probably the published material has to be readable from relatively small screen. I would go as far as to say that an old WAP based user interface might be the practical thing to aim for, because many Africans use old cellphones and those are not smartphones, but they do support the old WAP.  On top of the technical aspects there are the cultural aspects. May be in stead of thinking about technical solutions You should first map out the task from cultural point of view. For example, You might want to find answers to the following questions:\n\n    Who is Your target audience?\n    What is the skill set of Your target audience in terms of tech usage?\n    What do You want to change by informing/brainwashing/convincing Your target audience?\n    What might happen after Your target audience has read/watched/listened_to the material that You published?\n    Should the published material be available years after its publication and to whom?\n    Is the anonymity of the journalists important or are they kamikaze-journalists, accepting to get killed/jailed/tortured?\n    If anonymity of the journalists is important, then how to remove their writing/creating style from their works?\n    If anonymity of the journalists is important, then how is operational security handled?\n    Should people other than the journalists be kept anonymous and safe from violence?\n\nThere are more questions than that, but only after You have figured out the answers to such questions, should You start looking for technical solutions and may be the \"darknets\" are not even the solution. May be as simple as drone-dropped leaflets combined with something TEMPORARILY available on the censorednet does a better job. For example, the hieroglyphs are much more concise way to write things down than the English Latin alphabet, which means that for North-Korea an ordinary leaflet can hold content wise much longer texts than the leaflet would hold, if the text were in English. May be people find it OK to use magnifying glasses, which might be plain glasses that people wear, for reading leaflets, so a whole long blog-post can be printed on a leaflet, which in turn can be passed on from person to person. I suggest You study the various old-school spy methods, document exchange methods that the Cold War era spies used. Just get Your non-technical goals right first and only after then start thinking about technical solutions and what needs to be done at the technical side. Thank You and Welcome to this forum!",
				"added": 1578272013
			}
		],
		"1578135775_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 142,
				"body": "> [happyhippo](#comment_3_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): That's impossible nowadays, too many vulnerabilities and backdoors are found every day you simply can't stop updating your PC if you care about security.\n\nAbsurd. How about the idea that the updates themselves introduce new security problems and if the idiots did not get it right the first time, then they won't be doing a better job the second time. Just firewall Your LAN with some other appliance and keep in mind that newer malware is not capable of using extra ancient security flaws, because then the malware would also have to have \"backwards compatibility\".",
				"added": 1578274099
			}
		]
	},
	"comment_vote": {
		"55_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"40_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"916_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"35_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"270_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"342_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"45_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"71_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"284_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1_1ACc4pa2pJam33SkSE1zF1seF3LQKWR24v": 1,
		"57_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"122_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"12_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"947_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"8_1CHAAgunZ7JCv6faoWxBnX3gJ7rd4uWLYD": 1,
		"40_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"74_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"144_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"363_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"181_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1_1Tr8KpfPw9HXit4dC5U6Eiu3nV5pd5Cnf": 1,
		"20_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"325_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"159_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"359_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"169_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"362_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"20_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"71_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1_1MrLyY93aje7NYUxBoxsA9dxMHtePMmVBh": 1,
		"793_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"794_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"235_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"531_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"81_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"53_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1487_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"389_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"61_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"10_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"80_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"47_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"329_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"331_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"334_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"380_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"189_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"336_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"209_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"389_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"328_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"181_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1
	}
}