{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1583690170_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw": [
			{
				"comment_id": 1,
				"body": "> [xplosive](#comment_31_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Fuck Islam, fuck Koran? Killing the innocent? What are you talking about? Islam is just/only a religion, and some people in Europe change their religion to Islam without any force. They are free to do so, because there is freedom of religion. And many people has been killed by Christians too (the majority during the Crusades between 1095-1495), so Christianity is not better in this aspect. Religions are not bad. Certain people are.\n\nNo ist Is Not \"Just a Religion\" It is a fascist ideology with a long blood trail and it eradicated bruttally many cultures, that we're more advanced than this absurd death cult. And if you want to leave this cult the quran wants that you geht Müller - this ist Islam. Just talk to people who live in Islam states and you will See what Islam really ist: Not Just a Religion but a threat to Liberty, Progress and tolerance!",
				"added": 1583709782
			},
			{
				"comment_id": 2,
				"body": "> [xplosive](#comment_31_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Fuck Islam, fuck Koran? Killing the innocent? What are you talking about? Islam is just/only a religion, and some people in Europe change their religion to Islam without any force. They are free to do so, because there is freedom of religion. And many people has been killed by Christians too (the majority during the Crusades between 1095-1495), so Christianity is not better in this aspect. Religions are not bad. Certain people are.\n\nReligions are the reason for many bloody wars, surpression of other belief systems and killings (in so called ISIS state you get killed for the wrong belief). But still you don't dare to talk against Religion because as a child you get beaten up by your quran teacher when you started to think Independent. Sad but true.",
				"added": 1583710598
			}
		]
	},
	"comment_vote": {
		"14_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1
	}
}