{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566796194,
			"title": "The Vendetta Project",
			"body": "The Vendetta Project\nTaking back control\nSilver has been used as money since the dawn of civilization, now the precious metal has a plethora of industrial uses from Smartphones to medical devices. The modern world can not exist without it, and The Vendetta Project is our plan for seizing control.\nThis isn't nearly as difficult as it sounds. The world's yearly silver supply is 1,004,000,000. The world's physical demand is 1,033,000,000. At the current spot price of around $17 dollar an ounce this means one person or group of people could buy out a years supply of silver for a little over 17 billion dollars. The Vendetta Project is working on recruiting one million members who will each buy 100 ounces of silver over a year's time which adds up to one billion ounces. This will create a huge shortage of silver and cause prices to skyrocket. The banksters will no longer be able to keep the price suppressed. The financial institutions won't be able to cover all the paper silver they've sold. The markets will be thrown into chaos. People will once again see silver as not only a valuable commodity but also money. Meanwhile The Vendetta Project members will collectively hold great wealth and power. Imagine one million anons controlling a year's supply of one of world's most important resources. The reason this will work is because it's decentralized and completely anonymous. No one will know which people are holding the silver or where they've hidden it, not even you're fellow members. \nAnyone can become a member, here are the rules             \nBuy: Buy at least 100 ounces of silver a year.\nHold: Hold the silver don't sell it. The idea is too remove it from the market.\nSpread: Spread this message through out the internet. We need at least one million members. \nLinks\nhttps://www.silverinstitute.org/silver-supply-demand/ \nhttp://demonocracy.info/infographics/world/silver/silver.html",
			"added": 1566796193
		}
	],
	"topic_vote": {
		"1574745926_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}