{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1600266690,
			"title": "IFS sync problem?",
			"body": "Could you tell me if you can listen my last mp3s? Some reported to me that my last audio files cannot be seen on IFS or streamed, but i see almost 4-5 seeds for any file. Maybe some portions of zeronet network are isolated? Someone know how to fix this problem?\n\nmy new channel musicz3:\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1oyBwMh85JeqD7GHkqeQZYFb511ER98oU_item_48+type:audio\n\nmy previous channel musicz2:\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1Q2qKCMd4BMDFsdHEsXzRspod6hS5duMHF_item_471+type:audio\n\nan older mp3 of the same channel:\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1Q2qKCMd4BMDFsdHEsXzRspod6hS5duMHF_item_272+type:audio",
			"added": 1600266689
		},
		{
			"topic_id": 1600281891,
			"title": "Cuties (2020) the most discussed movie on IFS!",
			"body": "Here none can censor it! In my opinion i don't see any sexualized child in this movie...many scenes, also where girks dance, are very dramatic instead!\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1oyBwMh85JeqD7GHkqeQZYFb511ER98oU_item_94+type:video",
			"added": 1600281889
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 1,
				"body": "> [109389839](#comment_13_1J5eDu2ErJf5hq2rc52AvLR6QqK4723uj7): Zeronet may be the most fun darknet, and great for small files, but let's face it, it doesn't handle large files like videos well. If the video is not popular it never gets seeded. Here is a fun challenge. See if someone could post Red Dead Redemption, or the Lord of the Rings trilogy [in one video] on Zeronet and have it work. I dare you! [...]\n\nif you want i will upload them on IFS! :D",
				"added": 1600266914
			},
			{
				"comment_id": 2,
				"body": "> [j4s0f](#comment_1_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): I dare you to try. Most likely wont work. Remember he said 'in one video'. That means you have to video edit it into one long seamless video. You can get a copy of Red Dead Redemption here https://torlook.info/EDIT. None of 'caropc1v22' links work for me.\n\n1 link for the 3 movies will not work due to my remote machine limits, but single movies yes i'm sure :D",
				"added": 1600324969
			},
			{
				"comment_id": 5,
				"body": "> [j4s0f](#comment_3_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): Try posting Red Dead Redemption on IFS Mobile (an improvement to IFS)\n\ndo you want the xbox360 or the ps3 version?",
				"added": 1600425270
			},
			{
				"comment_id": 8,
				"body": "> [j4s0f](#comment_8_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): Reply back once you think it's available on zn..\n\nred dead redemption 1 exist only for ps3 and xbox 360, you mean red dead redemption 2?",
				"added": 1600672052
			}
		],
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 3,
				"body": "i accidentally deleted my zeronet folder. i'm trying to re-download the movie but i have some problems.  my remote seed are working, you can start the stream? i see 100 peers but 0 seeds in my machine.\n\nEDIT: my seedbox see 4 active seeds \n\nEDIT2: also the file in my seedbox seems to be corrupted (only first minutes are played). i reup the movie to a new link (i changed it in the first post). tell me if you have any problem.\n\nTo all: you have watched to movie before judge it or you are repeating only what you read online or only watched the netflix poster? i will watch the entire movie and AFTER i will talk about this movie...",
				"added": 1600330445
			},
			{
				"comment_id": 6,
				"body": "I saw the entire movie and this is my opinion:\n\nThis movie is not pedo stuff for some simple facts:\n\n1)there isn't any nude or sex scene on it with childrens or adults\n2) all \"twerking\" scenes are very dramatic: for example in the first scene in the movie where Amy spy the others girls while dancing ,the girls spot her and launch a stone to her face by using racist insults. Other good examples is one of the last scenes during the contest where Amy begin to cry during the dance thinking about her mother while the spectators disapprove the exibition and continuing to look at it (some of them pleasured);  Another  example is represented in the netflix poster; in this scene the girls was happy because bought some gift, but using  the money stolen to Amy's mother.\n\nIn conclusion: this movie show all negative aspect of two societies: the traditional society of the Amy's family that enslave women (the mother must celebrate the polygamous marriage of her husband) and our society where women are forced to show her bodies to make success, expecially in social networks that for this reason are heavily criticized in this movie, and maybe appears not so different from the traditionalist machist society (the inplicit scene where Amy use the phone stolen from her cousin to take a photo of her vagina to post on a social is very difficult to look, as the previous scene where she try to seduce the same man to keep the stolen phone).\n\nThis is not an easy film to watch (i used 2 days to complete it) because of these reasons and in my opinion all accusations of \"pedopornography\" are moved only to censor this movie, because with a very \"violent\" approch (directed to the spectators minds and consciences) it explain how our reality is cruel with childrens but also with adults, attacking some of the strongest industries nowdays:  the social networks and all the machist managers that move the world and that are present in all cultures and nations.",
				"added": 1600458418
			}
		],
		"1600266690_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2543_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe Syncronite can help. [...]\n\ni'm already using Syncronite. Maybe this service can be more effective if it updates every hour instead every 24 hours? By doing this zeronet instances that  turn off and on many times in a day (for example mobile phones used to play music) will be better indexed?",
				"added": 1600348459
			}
		],
		"1600648926_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": [
			{
				"comment_id": 7,
				"body": "i will  upload this author on IFS, i will very pleasured by this!",
				"added": 1600671933
			}
		],
		"1606822195_1P1QujGaphcq6h6V8UijMEAe1R8Xvfacyu": [
			{
				"comment_id": 9,
				"body": "I found this:  http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1LtgGHptWLiFxTaazbZ3K8HnbKRjRoD5BN_item_123+type:archive",
				"added": 1606852317
			}
		]
	},
	"comment_vote": {}
}