{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1613527594_1CBMLtV7FJruhSwGXEuwYznMU2SDi5Tcmn": [
			{
				"comment_id": 1,
				"body": "Когда человек регистрирует свой идентификатор на ZeroID, то запрос выполняется во внешнем интернете. То есть мимо Tor, через стандартный 443 порт. В результате получается, что человек, во вроде как защищенной с помощью Tor сети, использует идентификатор, привязанный к его настоящему IP-адресу. :D\nА если настроить браузер через Tor для вышеуказанной регистрации, то не факт, что вообще что-то получится.",
				"added": 1613582281
			}
		],
		"1586675181_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 2,
				"body": ">поступило предложение заменить протокол TCP/IP на новый — New IP.\n\nTCP/IP - это не один протокол. Это вообще разные уровни на модели OSI. :D",
				"added": 1613584289
			}
		],
		"1610194627_1P9CEmiWGKNCTWpqJvugcYtuNF4WPQheQ6": [
			{
				"comment_id": 3,
				"body": "Они точно также, как и все люди, разные. Просто надо понимать, которых следует опасаться. У них в самой религии заложена идея, что евреи над всеми, а выше них только бог. Соответственно, надо опасаться религиозных, и совсем обходить стороной ортодоксально религиозных.",
				"added": 1613748551
			}
		],
		"1598358733_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 4,
				"body": "А что тут думать? Отравление происходит как раз в то время, когда в Беларуси происходят волнения. Отравлен он оказывается вроде как каким-то боевым веществом. Когда на самом деле отравителю было бы куда проще отыскать какое-нибудь сильнодействующее снотворное в аптеке, или еще что-нибудь менее обращающее на себя внимание.\nЧистейшей воды пиар.",
				"added": 1614597602
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 5,
				"body": "Zeronet хоть и не совсем скрытосеть, но все же на какую-то долю конфиденциальности претендует. А использовать скрытосети из под Windows - это издевательство над здравым смыслом, так как прямо в лицензии Windows написано, что они за пользователем следят.\nGentoo.",
				"added": 1615389132
			}
		],
		"1615456715_1Fb5iVeVmyT53woPjVQ4vc86oxYmN6sfTK": [
			{
				"comment_id": 6,
				"body": "С гораздо большей опаской относятся.  Если вам доведется увидеть реального психопата (не того, кого так называют офисные девочки-психологини, а настоящего), то вы поймете почему.",
				"added": 1615477700
			}
		],
		"1616908801_13RFu1n9Bc3vCg8vWLtYhWux6WEoXvayxA": [
			{
				"comment_id": 7,
				"body": "> [zombibi](#comment_111_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): так я ж вообще ничего не делал! ничего не комментировал, ничего не заявлял;). просто читал;). правда не помню когда поcледний раз заходил туда не через tor. единственное предположение, что эти уроды не смогли идентифицировать кто читает. а зачем им это?;)\n\nВы - это не только то, что вы пишете, но и то, что вы читаете. Круг ваших интересов таких образом определяется.  Если нет привязки к уникальному ID (вы же через Tor читаете), то сложно составить и профиль ваших интересов. Соответственно и сложно подсовывать вам контекстную рекламу. А без оной вы им и не нужны. Раз заблокировали, то вероятно вы слишком хорошо прятаться научились.",
				"added": 1617631628
			},
			{
				"comment_id": 8,
				"body": ">т.е. смысл этой хрени - всунуть контекстную рекламу?;) проще некуда - бабло?;)\n\nНу да. Вот так вот все банально.",
				"added": 1618054308
			},
			{
				"comment_id": 9,
				"body": ">т.е. мы пришли к простому выводу - все разговоры про свободу слова, какую то демократию и дальнейший набор букв - это просто туфта, ширма, за которой стоит банальное бабло. не так ли?;)\n\nЗдрасьте, приехали. Тот же Марк Цукенберг, или там, например, Павел Дуров, на паперти, что ли, миллиарды прибыли поимели? :D",
				"added": 1618098633,
				"modified": 1618098705
			}
		]
	},
	"comment_vote": {}
}