{
	"next_channel_id": 2,
	"channel": [
		{
			"channel_address": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP",
			"channel_name": "Bücherecke",
			"channel_description": "Ein kleine Auswahl deutschsprachiger Bücher",
			"cluster_id": "15fDN4wasXuyS8krtKvrxEVmWWLz6Qh518",
			"date_added": 1545345299039
		}
	],
	"next_item_id": 4,
	"item": [
		{
			"category": 4,
			"subcategory": 20,
			"title": "Pyton von Kopf bis Fuss - Barry, Paul",
			"file_type": "epub",
			"file_name": "Pyton_von_Kopf_bis_Fuss_-_Barryd_Paul.epub",
			"json_id": 2210,
			"inner_file": null,
			"content_type": "book",
			"file_size": 22762264,
			"item_id": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP_item_1",
			"date_added": 1545345395981,
			"poster_file": null,
			"is_associated": null,
			"channel": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP",
			"description": "Was lernen Sie in diesem Buch?\nHaben Sie sich schon einmal gewünscht, Sie könnten mit nur einem Buch Python richtig lernen? Mit Python von Kopf bis Fuß schaffen Sie es! Durch die ausgefeilte Von-Kopf-bis-Fuß-Didaktik, die viel mehr als die bloße Syntax und typische How-to-Erklärungen bietet, wird es sogar zum Vergnügen. Python-Grundlagen wie Datenstrukturen und Funktionen verstehen Sie hier schnell, und dann geht es auch schon weiter: Sie programmieren Ihre eigene Web-App, erkunden Datenbank-Management, Ausnahmebehandlung und die Verarbeitung von Daten. \nWieso sieht dieses Buch so anders aus?\nIn diesem Buch sind die neuesten Erkenntnisse der Kognitionswissenschaft und der Lerntheorie eingeflossen, um Ihnen das Lernen so einfach wie möglich zu machen. Statt einschläfernder Bleiwüsten verwendet dieses Buch eine Vielzahl von Abbildungen und Textstilen, die Ihnen das Wissen direkt ins Hirn spielen – und zwar so, dass es sitzt."
		},
		{
			"category": 4,
			"subcategory": 20,
			"title": "Der Insasse - Fitzek, Sebastian",
			"file_type": "epub",
			"file_name": "Der_Insasse_-_Fitzekz_Sebastian.epub",
			"json_id": 2210,
			"inner_file": null,
			"content_type": "book",
			"file_size": 422779,
			"item_id": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP_item_2",
			"date_added": 1545345398623,
			"poster_file": null,
			"is_associated": null,
			"channel": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP",
			"description": "\"Sebastian Fitzek, Deutschlands prominentester Autor von Psychothrillern, mit seinem neuen Bestseller aus dem Inneren der Psychiatrie!\n\n​Um die Wahrheit zu finden, muss er seinen Verstand verlieren. DER INSASSE\n\nVor einem Jahr verschwand der kleine Max Ber​k​hoff. Nur der Täter weiß, was mit ihm geschah. Doch der sitzt im Hochsicherheitstrakt der Psychiatrie und schweigt. Max’ Vater bleibt nur ein Weg, um endlich Gewissheit zu haben: Er muss selbst zum Insassen werden. \"\n\n**\n\n### Pressestimmen\n\n\"Deutschlands Thrillermeister Fitzek mit gewohntem Pageturnereffekt passend zur dunklen Jahreszeit.\" t-online.de , 09.07.2018\n\n"
		},
		{
			"category": 4,
			"subcategory": 20,
			"title": "Nebelkind - Schepp, Emelie",
			"file_type": "epub",
			"file_name": "Nebelkind_-_ScheppY_Emelie.epub",
			"json_id": 2210,
			"inner_file": null,
			"content_type": "book",
			"file_size": 630393,
			"item_id": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP_item_3",
			"date_added": 1545345401273,
			"poster_file": null,
			"is_associated": null,
			"channel": "15f1_1HKRMpLv3X67VpGLo5wUNxSmc8J8cJGrjP",
			"description": "ER wurde gezeichnet. ER tötet. ER ist neun Jahre alt.\n\nDie Staatsanwältin Jana Berzelius wird bei einem spektakulären Fall hinzugezogen: Ein Mann wurde erschossen – die Hinweise verdichten sich, dass die Tat von einem Kind begangen wurde. Dann taucht die Leiche eines Jungen an der schwedischen Küste auf. Seine Fingerabdrücke passen zu jenen des Tatorts, doch warum sollte ein Kind einen Mord begehen? Während die Ermittler im Dunkeln tappen, ermittelt Jana auf eigene Faust. Denn der Junge, der das Wort »Thanatos« als Narbe im Genick trägt, hat ein Geheimnis, das nur Jana kennt: Auch ihr Genick ziert der Name einer Todesgottheit, und nun setzt sie alles daran, herauszufinden, warum. "
		}
	]
}