{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [sirlotaplot](#comment_1_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): Saw your thread on ZeroTalks and decided to check it out. Not enough here yet to make up my mind, but looking forward to more.\n\nThank you. I just started it up and am developing my ideas and where I want to take it. More content to come. Any suggestions for content?",
			"post_id": 2,
			"date_added": 1554341510
		},
		{
			"comment_id": 2,
			"body": "Here's the onion link to the article I'm basing this off of. http://tinhat233xymse34.onion/blog/thoughts/slantwise-resistance.html",
			"post_id": 6,
			"date_added": 1554869352
		},
		{
			"comment_id": 3,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I don't know if ends up overall good or bad, but when the users don't know the stuff they're using, they are still under control: their apps' developers (and whoever can influence them). Well, to a degree that's unavoidable; but i'm not seeing any benefits in trying to build a wall between developers and users: it did enough harm already.\n> In particular i don't like how many free software developers these days (including e.g. aforementioned Signal) don't even put a link to source code from their \"landing page\"\n\nI agree, I'd like to see more source code from popular applications. Building a wall was just a suggestion, even though we've seen that walls don't usually help. They just seperate. I think it's important to get some buy in to holding security as more important from the general public.\n\nThe question is how to make people aware of the surveillance and the dangers of connectedness.",
			"post_id": 6,
			"date_added": 1554909184
		},
		{
			"comment_id": 4,
			"body": "> [moor](#comment_1_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): is there a reason to be quiet about it? i think someone just has to make it, which is not easy.\n\nThat's a personal decision. I think it's useful to stay quiet so that the movement or resistance can gain strength before it's under public scrutiny and is obvious to the both the general public and the government that we are resisting.",
			"post_id": 6,
			"date_added": 1554931956
		},
		{
			"comment_id": 5,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): regarding christianity, it is the way how people should act, on Zeronet i try not to escallate bad discussion and try to be positive, but no one is perfect, i think the overal world atmosphere rather tend to promote oposite of the yours mentioned humility and maybe even opposite of love, so it is not easy to create such atmosphere. but i am for it to be tried. Your article suggested me that i am aware about my bad habits/patterns and i need guidance which for me i think should be the christianity.\n\nTo limit it to one religion or train of thought takes away from the core idea. All religions teach love in some way be it Islam, Judiasm, Christianity, Daoism, Baha'i, etc. It's often seen religiously, but appears to be part of human nature. So everyone sources it differently and has different reasons for it, but it's there.",
			"post_id": 9,
			"date_added": 1555600603
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}