{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1622035274_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 1,
				"body": "Wow, I flushed my bazooka along with my atomic bomb down the toilet while I was taking a shit... what bad luck!",
				"added": 1615527344
			}
		],
		"1616163145_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 2,
				"body": "A bunch of tools blaming the US for the doings of an *international* cult that has been in existence for *millennia*. See any flaws in your logic yet?",
				"added": 1616232407
			}
		],
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [
			{
				"comment_id": 3,
				"body": "Anything will be a dumpster fire if no one posts anything of value to it. There are good resources here if you bother to look.",
				"added": 1616232658
			}
		],
		"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 4,
				"body": "I find this hard to believe, a source would be nice.",
				"added": 1616813887
			},
			{
				"comment_id": 5,
				"body": "> [captain404](#comment_27_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): USED: 1.6K/50KUSED: 1.6K/50K\n\n\nI'm not referring to the Intel variant, I'm referring to the AMD variant.",
				"added": 1617004867
			},
			{
				"comment_id": 6,
				"body": "> [aplayer](#comment_5_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM): I just know amd is baddest company at architecture design. I have 2 amd expensive graphics that are not usable.\n\nYou'll find very few informed people agree with that, especially with how they're doing in the CPU market.",
				"added": 1617332241
			}
		],
		"1618016820_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 7,
				"body": "I have fairly elaborate 10 Gbps node that hosts a fair amount of content. There's still alot of the files I'm still trying to gather though",
				"added": 1618018270
			}
		],
		"1618045065_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 8,
				"body": "It sounds like your computer is going into sleep mode",
				"added": 1618076621
			}
		],
		"1618386482_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 9,
				"body": "Yeah, shitberg sounds about right.",
				"added": 1618396883
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 10,
				"body": "Ah, yet another sheltered soul that has yet to realize this is part of problem that spans the entire globe. If it hasn't already, it will be coming to your country to tear it down too.",
				"added": 1619056400
			},
			{
				"comment_id": 11,
				"body": "Well, if you're so sure your nations have what it takes to take on the NWO sympathizers you might want to stop talking and start acting. They have immense wealth and technology that's about 30 years beyond what the public has access to. Time is wasting away...",
				"added": 1619081579
			},
			{
				"comment_id": 12,
				"body": "> [captaincoom](#comment_5_1F5H5zYxjS7G4C66ajhZLjkD8yvBHCwBJG): is this like that time a fed samefagged on 8chan for 60 fucking posts trying to get someone to say something illegal? what the kek\n\nWhat's funny about that is that they've actually convinced themselves that they're doing a world a favor doing that kind of BS.",
				"added": 1619468426
			}
		],
		"1621101030_1NLAutFbgr1X7A1ugoxD5dvCgBhymnUMuM": [
			{
				"comment_id": 13,
				"body": "This is why we can't have nice things.",
				"added": 1621112179
			}
		],
		"1621239876_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 14,
				"body": "It's good to see people willing to help, Zeronet needs updated and keeping an alternative to the traditional Internet is vital to keeping it free and open, since we can't rely on the politicians not to lock it down for people using whatever reason they can think of... as they already have in some countries.",
				"added": 1621300794
			}
		],
		"1621542671_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 15,
				"body": "All I have to say is, shut up and watch.",
				"added": 1621555090
			},
			{
				"comment_id": 16,
				"body": "> [calmdownholden](#comment_67_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Again... Every year you losers make claims.\n\nOkay, how about you answer some questions.\n- How old are you?\n- What do you know about the depths of cruelty in human beings?\n- Do you think the mainstream media tells you the truth all the time?\n- Do you think that high-ranking officials in the government care that you exist?\n- Have you studied or even looked into anything at all about the mentality of the most eccentric of the top 1%?\n- Do you know anything about \"conspiracy theorists\" outside of claims of aliens and \"gay frogs\"?",
				"added": 1621559973
			}
		],
		"1621828480_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 17,
				"body": "No, seriously, this shitposter needs to back to 4chan.",
				"added": 1621970696
			}
		],
		"1622105491_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 18,
				"body": "Alex's problem is that he is constantly trying to maintain the pacifist routine. These people aren't going down without direct action. \"God gave his angels weapons because even the almighty knew that you can't fight evil with love and tolerance.\"",
				"added": 1622145280
			},
			{
				"comment_id": 19,
				"body": "Great, another addition to my mute list. Epistemic will serve his masters well.",
				"added": 1622285706
			}
		]
	},
	"comment_vote": {}
}