{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1576185412_16VNPV97D22nLggFssEwQXScnyUGX2cHjq": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1577307519_1C3TWkttX6aKrtboutxzVktZzncWyyfyUQ": [
			{
				"comment_id": 1,
				"body": "کلا برای اینکه بعنوان ترکر کارکنی باید کلاینتش رو نصب کنی. لینک github کلاینت ترکر رو دیدم(دانلود نکردم)  ولی چون آی پی استاتیک هستم تمی خوام ازش استفاده کنم. اگه اطلاعات بیشتری می خوای با ای دی haxxer تماس بگیر. احتمالا کمکت کنه.",
				"added": 1577309603
			},
			{
				"comment_id": 3,
				"body": "یه راه ساده تر برای ترکر شدن Enable کردن پلاگین bootstrapper از منوی تنظیمات هستش. \nبرای ارتباط با هرکسی در شبکه ی زیرونت از zeromail استفاده کن. کار باهاش خیلی راحته!",
				"added": 1577311023
			},
			{
				"comment_id": 4,
				"body": "اگه نتونستی پلاگینو پیداش کنی همینجا بگو تا راهنماییت کنم. یادتون باشه این شبکه برای ناشناس موندن استفاده کننده ها طراحی شده، اطلاعات شخصیتون رو با هیچکس به اشتراک نزارید.",
				"added": 1577311155
			},
			{
				"comment_id": 5,
				"body": "> [naader](#comment_1_1NeAUJvhFKihh3diPSPoYiA7pd2HV7BrJ7): چی هع؟\n\nهمین حالا که اینو می خونی، بالا سمت راست، ایکون زیرونت هست. روش کلیک کن تا به صفحه ی اول زیرونت بری. حالا بالا سمت چپ که نوشته zeronet ، جولوش سه تا نقطه هست که با کلیک روش یه منو باز میشه. از منو گزینه plugins رو انتخاب کن. از بین لیستی که برات نشون می ده bootstrapper رو enable کن.",
				"added": 1577313166
			},
			{
				"comment_id": 6,
				"body": "> [naader](#comment_2_1NeAUJvhFKihh3diPSPoYiA7pd2HV7BrJ7): ترکر چیه؟\n\nبا استفاده از ترکر یا tracker ، بقیه ی افرادی که تو شبکه ی زیرونت هستن رو میشه پیدا کرد و بهشون وصل شد. به این طریق، شبکه ی زیرونت تشکیل میشه. البته این کار اتوماتیک هستش و کاربر دخالتی توش نداره.",
				"added": 1577313568
			}
		],
		"1576534065_12JSvAFeDbmti4wKcQGguUMEQNFA2CWX4k": [
			{
				"comment_id": 2,
				"body": "دوست من! برای استفاده از زیرونت نیازی به اینترنت بین الملل نیست و مثل ابانماه اگه فقط شبکه ی داخلی برقرار باشه، زیرونت کار خواهد کرد. تنها مشکل این خواهد بود که ترکرهای بین المللی کار نخواهند کرد و این باعث کند شدن نسبی شبکه می شه. لازم می دونم یاداوری کنم که از وجود ترکرهای ایرانی اطلاعی ندارم و اگه فقط یک نفر کلاینتش رو نصب و تنظیم کنه(متاسفانه بلد نیستم) عملا مشکل ترکر و افت سرعت هم در زمان قطع اینترنت مرتفع می شه. \nتوضیح اضافه برای دوستانی که تازه به جمع ما پیوستن: زیرونت وسیله ی دسترسی به اینترنت در زمان قطع اینترنت نیست. زیرونت بستر ارتباط امن و غیرقابل رهگیری در زمان قطع اینترنت هست.",
				"added": 1577310052
			}
		]
	},
	"comment_vote": {
		"3_19auC98Nvg4jXwZpKzvs3UdDazi4kUappa": 1,
		"3_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP": 1,
		"4_1C3TWkttX6aKrtboutxzVktZzncWyyfyUQ": 1
	}
}