{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "great post! just two things, don't say 'zeronet has no moderation', you did mention blocklists later but they should be mentioned first, and we can contrast blocklists with clearnet moderation, actually blocklists can be faster since only one maintainer with access can \"block\" a post immediately.\n\nsecond zerotalk needs moderation just as much, even if you don't see a picture or video anyone can share a link.",
			"post_id": 5,
			"date_added": 1565300033
		},
		{
			"comment_id": 2,
			"body": "> [anshorei@zeroid.bit](#comment_1_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): EDIT: @moor: I've added a little paragraph mentioning blocklists and moderation before I delve into the scaremongering article. I still think the original was clear enough, but it can't hurt to mention one more time.I'm not convinced ZeroTalk needs moderation. Although from the “front page of ZeroNet” perspective I do understand it could be a good idea. It's one of the first zites any newcomer will visit, and having it plastered from top to bottom with profanities could be detrimental to platform growth. But in principle I think ZeroTalk is the type of zite that can function with no moderation at all. A link is just text, even if it leads somewhere we'd rather not go. I understand that some governments consider links to copyrighted content to be grounds for legal action in themselves these days, but by that metric Facebook, Twitter, Youtube, etc. are some of the most illegal sites on the internet.\n\nok, imagine that every once in a while someone posts a new topic titled \"very messed up thing, download link\". for *at least* a couple of minutes that post will be visible on your zerohello, and for hours or days on that board.\n\nzerotalk may not need much but it does need moderation imo.",
			"post_id": 5,
			"date_added": 1565306502
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"4": 1,
		"5": 1,
		"6": 1,
		"8": 1,
		"10": 1
	}
}