{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1613142391,
			"title": "The Great Reset has Begun",
			"body": "New executive order signed by POTUS Joe Biden now gives banks the ability to base loans and account possession on social credit scores. This is a plan for the big banks to team up with big tech to start putting Trump supporters in Ghettos, maybe not physical but digital.  You might not be able to have a plastic credit or debt card, these are controlled by Mastercard and Visa.  Understand if you posted a pro-Trump or pro conservative message on social media, you will be the target.  The great reset is to begin implementing U.N. Agenda 2021, essentially reducing world population to less that half of what it is now by 2032.  Hidden under the \"Green Agenda\", life will start getting much harder for those who are opposed to the elites. \n\nI intend to start a zite to document these issues.  Be aware, your social media is already graded by A.I. determining how likely you are to vote for conservatives, who are now deemed to be enemies of the state.\n\nFeel free to leave comments, this is a discussion.",
			"added": 1613142390
		},
		{
			"topic_id": 1613222411,
			"title": "What is wrong with the world today?",
			"body": "A discussion on the problems with the world, what do you think the worst problems are with the world, and how would you fix them?  You go first, I just want to listen.",
			"added": 1613222409
		},
		{
			"topic_id": 1623537761,
			"title": "Has McDonalds become slow food?",
			"body": "So, a few nights ago I was delivering for Uber eats and I got an order at McDonalds.   When I got there... The line was down the street.  Because I knew the lobby was closed because it was after 9PM... I waited... and decided to set a stop watch, sat back and listened to some music. I stayed because... well it's fast food. It was 45 minutes before I got up to the order screen.  It was another 10 minutes until I got to the pickup window. Is this some kind of new policy that McDonald's is implementing, or are the employees actually working as slow as they can to make the orders?  When I asked the employee at the window what took so long... she said there is a food shortage.  I had to laugh, they don't really give a damn.",
			"added": 1623537758
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1612901550_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 1,
				"body": "yes it works...  can you read this?",
				"added": 1613182630
			}
		],
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": [
			{
				"comment_id": 2,
				"body": "> [lol69420](#comment_3_1NAU3T4B9DxPjPssPvtrg8fDSzYi7CxGPf): it's ok...  Trump will be pres again in 2024.\n\nTrump will be lucky to be alive in 4 years.  They are out to destroy him and wipe him off the face of the earth, along with his children.  The trials today are just a sham, I expect to see an assignation attempt in the next few months.",
				"added": 1613184920
			},
			{
				"comment_id": 3,
				"body": "The NGFS has been around for some time, it's entire goal is to implement the Paris accords by force -> check out website https://www.ngfs.net/en",
				"added": 1613185890
			},
			{
				"comment_id": 4,
				"body": "> [radiator](#comment_60_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): ok, i'm interested.  [...]\n\nI'm with you brother, this place isn't my home, I'm just a passing through",
				"added": 1613225141
			}
		],
		"1614571088_17uXQ7MMjiHb2YJR8DrWCZas6B5S1Hq8mX": [
			{
				"comment_id": 5,
				"body": "You do You! I don't think any man's hot.",
				"added": 1614622274
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 6,
				"body": "Send me 0.0013 in BTC and I will say your name 3 times, and turn around.  Who knows, maybe it will even stop global warming and the overtake of our international banking systems.",
				"added": 1614622658
			}
		],
		"1623537761_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 7,
				"body": "> [anonymouslogin](#comment_315_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Is McDonalds food?! Sadly it is what an increasing number of families can afford to eat.\n\nYea, right...  When I was I kid I didn't know what McDonald's was until I was in 3rd grade, and my teacher took us there for a party.  We had one right down the street, I just never knew or cared.   With Uber eats, It's also sad how many parents order happy meals, that's it, just two or three happy meals.",
				"added": 1623615603
			}
		],
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 8,
				"body": "I'm not a theologian, but wasn't that the desire of Lucifer to \"Become God\"?  How do you overcome the corruption issue, or are you just ignoring it?",
				"added": 1624191482
			},
			{
				"comment_id": 9,
				"body": "> [adherent](#comment_2_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA): After posting this and reading the comments I become aware of how close this is to the desire of lucifer. Honestly fuck boys not my intention here at all. But you are all correct. I guess this why they say the only path to God is through the prophets else satan is there to tempt us [...]\n\nAs the Bible says, the Fear of God is the beginning of wisdom.  The one thing that Lucifer lacked was humility, I mean, he was the biggest and most beautiful of all the angelic creation.  But the one thing all angelic kind lack is a form of redemption.  Thank God for His grace and mercy that he would consider a person as vile as me a member of His kingdom.",
				"added": 1624832430
			},
			{
				"comment_id": 10,
				"body": "> [adherent](#comment_2_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA): After posting this and reading the comments I become aware of how close this is to the desire of lucifer. Honestly fuck boys not my intention here at all. But you are all correct. I guess this why they say the only path to God is through the prophets else satan is there to tempt us [...]\n\nAs the Bible says, the Fear of God is the beginning of wisdom.  The one thing that Lucifer lacked was humility, I mean, he was the biggest and most beautiful of all the angelic creation.  But the one thing all angelic kind lack is a form of redemption.  Thank God for His grace and mercy that he would consider a person as vile as me a member of His kingdom.",
				"added": 1624832453
			}
		]
	},
	"comment_vote": {
		"29_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"15_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"7_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": 1,
		"60_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"3_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"1250_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_15qVru57g2Gpumhby7UkDWuS3qKnmGSqG8": 1,
		"659_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"315_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_15THkxz3XcVanmjENJyUBegXgvDbbn9Rq1": 1,
		"8_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": 1
	}
}