{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 2,
			"title": "Teste de firewall da China",
			"body": "#Teste se algum site está bloqueado pelo Great Firewall of China em tempo real.\n- http://www.chinafirewalltest.com/",
			"added": 1543706423
		}
	],
	"topic_vote": {
		"1_12DmbMA1K9H3zAyBLDyrf38KhSG7GkD9Va": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1PqwSiizFr8j1LRqegXwZPixWiQEntzc3c": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_12DmbMA1K9H3zAyBLDyrf38KhSG7GkD9Va": 1
	},
	"next_comment_id": 8,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Os estranhos números da teoria de cordas\n\nQUANDO CRIANÇAS, TODOS APRENDEMOS os números. Começamos com a contagem, seguida da adição, subtração, multiplicação e divisão. Mas os matemáticos sabem que o sistema numérico que aprendemos na escola é apenas uma de muitas possibilidades. Outros tipos de números são importantes para entender geometria e física. Entre as mais estranhas alternativas estão os octônios. Muito negligenciados desde sua descoberta, em 1843, eles têm assumido uma curiosa importância na teoria de cordas. E, certamente, se a teoria de cordas for uma representação correta do Cosmo, eles podem explicar por que o Universo tem um número surpreendente de dimensões.\n\nOs octônios não seriam o primeiro pedaço da matemática pura mais tarde usada para melhorar nosso entendimento do Cosmos. Nem seria o primeiro sistema numérico alternativo que mostraria ter usos práticos. Para entender por que, primeiro temos de olhar o caso mais simples de números – o sistema numérico que aprendemos na escola – que os matemáticos chamam de números reais. O conjunto de todos os números reais forma uma linha, de modo que dizemos que a coleção de números reais é unidimensional. Também poderíamos dizer que: a linha é unidimensional porque especificar um ponto sobre ela requer um número real.\n\nAntes de 1500, os números reais eram os únicos disponíveis. Então, durante a Renascença, matemáticos ambiciosos tentavam resolver formas de equações cada vez mais complexas, e até chegavam a fazer competições para ver quem conseguiria resolver os problemas mais difíceis. A raiz quadrada de -1 foi introduzida como uma espécie de arma secreta pelo matemático, físico, jogador e astrólogo italiano Gerolamo Cardano. Onde outros reclamavam, ele se permitia usar esse misterioso número como parte de cálculos mais longos nos quais as respostas eram números reais convencionais. Ele não estava certo da razão de esse truque funcionar; tudo que sabia era que fornecia as respostas corretas. Ele publicou suas ideias em 1545, deflagrando uma controvérsia que duraria séculos: a raiz quadrada de -1 existia mesmo ou era apenas um truque matemático? Aproximadamente 100 anos depois, o grande pensador René Descartes apresentou seu veredicto quando deu a esse número o depreciativo nome “imaginário”, agora abreviado por i.\n\nApesar disso, os matemáticos seguiram os passos de Cardano e começaram a trabalhar com números complexos – números da forma a + bi, onde a e b são números reais convencionais. Por volta de 1806, Jean-Robert Argand popularizou a ideia de que números complexos descrevem pontos em um plano. Como a + bi descreve um ponto em um plano? Simples: o número a nos diz a que distância para a esquerda ou para a direita o ponto está, enquanto b nos diz a distância do ponto para cima ou para baixo.\n\nDesse modo, podemos pensar que qualquer número complexo é um ponto em um plano, mas Argand deu um passo a mais: mostrou que podemos fazer operações com esses números – adição, subtração, multiplicação e divisão – como manipulações geométricas no plano (ver o quadro inferior na página oposta).\n\nUm aquecimento para entender como essas operações podem ser pensadas como manipulações geométricas é pensar, primeiramente, sobre os números reais. Adicione ou subtraia quaisquer números reais, e o resultado será como um deslizamento da linha real para a esquerda ou para a direita; e se você multiplicar ou dividir, o resultado será como esticar ou encolher a linha real. A multiplicação por 2, por exemplo, estica a linha por um fator 2; enquanto dividir por 2 a encolhe, movendo todos os pontos para duas vezes mais perto do que estavam antes. Multiplicar por -1 significa inverter a linha dos números reais.\nO mesmo funciona para os números complexos, com apenas algumas modificações extras. Adicionar qualquer número complexo a + bi a um ponto no plano desliza aquele ponto por uma quantidade a para a esquerda ou para a direita e para cima ou para baixo por uma quantidade b. Multiplicar por um número complexo não só estica ou encolhe, mas também rotaciona o plano complexo. Em particular, multiplicar por i rotaciona o plano em um quarto de volta. Assim, se multiplicarmos 1 por i duas vezes, giramos o plano em meia-volta, chegando ao número -1. A divisão é o oposto da multiplicação, de modo que para dividir apenas encolhemos em vez de esticar, ou vice-versa, e então giramos o plano na direção oposta.\n\nQuase tudo que podemos fazer com os números reais vale para números complexos. Na verdade, a maioria das coisas funciona melhor, como Cardano sabia, porque podemos resolver mais equações com números complexos do que com números reais. Mas se um sistema de números bidimensional fornece ao usuário um poder de cálculo superior, o que dizer de sistemas com dimensão mais elevada? Infelizmente, uma extensão simples mostrou-se impossível. Um matemático irlandês descobriria o segredo de sistemas numéricos de dimensão mais alta décadas depois. E apenas agora estamos começando a entender como eles podem ser poderosos.\n\nA ALQUIMIA DE HAMILTON\nEM 1835, COM 30 ANOS, O FÍSICO-MATEMÁTICO William Rowan Hamilton descobriu como tratar números complexos como pares de números reais. À época os matemáticos escreviam os números complexos na forma a + bi que Argand popularizou, mas Hamilton notou que somos livres para pensar no número a + bi como apenas um jeito peculiar de escrever dois números reais – como (a, b).\n\nEssa notação torna fácil adicionar ou subtrair números complexos – apenas adicione ou subtraia os números reais correspondentes dos pares. Hamilton também veio com regras um pouco mais complicadas para a multiplicação e para a divisão, e assim ambas as operações mantivessem o belo significado geométrico descoberto por Argand.\n\nDepois de Hamilton inventar esse sistema algébrico para números complexos, com significado geométrico, ele tentou, por muitos anos, inventar uma álgebra maior de tripletos que tivesse um papel semelhante em uma geometria tridimensional, um esforço que rendeu a ele apenas frustrações. Uma vez ele escreveu ao filho: “Toda manhã... em minha descida para o café da manhã, você e o seu então irmão menor, William Edwin, me perguntavam: ‘Bem, papai, você já consegue multiplicar tripletos?’, e eu era obrigado a responder negativamente com um triste aceno com a cabeça: ‘Não, eu posso apenas adicioná-los e subtraí-los’”. Embora ele não pudesse saber, a tarefa que ele se deu era matematicamente \nimpossível.\n\nHamilton estava procurando um sistema numérico tridimensional no qual pudesse adicionar, subtrair, multiplicar e dividir. A divisão é a parte difícil: um sistema numérico em que se pode dividir é chamado álgebra de divisão. Não foi antes de 1958 que três matemáticos provaram um fato incrível de que se suspeitava havia décadas: qualquer álgebra de divisão deve ter uma dimensão (os números reais), duas dimensões (os números complexos), quatro ou oito. Para ter sucesso, Hamilton teria de mudar as regras do jogo.\n\nO próprio Hamilton descobriu uma solução em 16 de outubro de 1843. Ele estava caminhando com a esposa pelo Royal Canal para uma reunião na Royal Irish Academy em Dublin quando teve uma súbita revelação. Em três dimensões, as rotações, a distensão e o encolhimento não poderiam ser descritos com apenas três números. Ele precisava de um quarto número, gerando, assim, um conjunto quadridimensional chamado quaternions, que tomam a forma a + bi + cj + dk. Aqui, os números i, j e k são três diferentes raízes quadradas de -1.\nHamilton escreveria mais tarde: “Naquele momento senti o circuito galvânico do pensamento se fechando; e as fagulhas que saíam dele eram as equações fundamentais entre i, j e k; exatamente como as que usei desde sempre”. E em um significativo ato de vandalismo matemático, ele esculpiu essas equações nas pedras da Brougham Bridge. Embora elas estejam agora enterradas sob grafitagem, uma placa foi \ncolocada lá para comemorar a descoberta.\n\nPode parecer estranho que precisemos de pontos em um espaço quadridimensional para descrever mudanças num espaço tridimensional, mas é verdade. Três dos números devem descrever rotações, o que podemos ver rapidamente se imaginarmos um avião decolando. Para orientar o avião precisamos descrever o ângulo com a horizontal. Também precisaremos ajustar o curso, virando à esquerda ou à direita, assim como dirigir um carro. Finalmente, precisaremos ajustar o balanço: o ângulo das asas do avião. O quarto número de que precisamos é necessário para descrever a distensão ou contração.\n\n\nHamilton passou o resto de sua vida obcecado pelos quaternions e encontrou muitos usos práticos para eles. Hoje, em muitas dessas aplicações, os quaternions têm sido substituídos pelos seus primos mais simples, os vetores, que podem ser pensados como bi + cj + dk (o primeiro número, a, sendo igual a zero). Ainda assim, os quaternions têm seu nicho: permitem um modo eficiente de representar rotações tridimensionais em um computador e aparecem em todos os lugares onde são necessários: orientação de \numa espaçonave a um videogame.\n\nIMAGINÁRIOS SEM FIM\nAPESAR DESSAS APLICAÇÕES, poderíamos nos perguntar o que, exatamente, são j e k se já definimos a raiz quadrada de -1 como i. Essas raízes quadradas de -1 realmente existem? Podemos inventar raízes quadradas de -1 a nosso critério?\n\nEssas questões foram levantadas por um colega de Hamilton, um advogado de nome John Graves, cujo interesse em álgebra levou Hamilton a pensar sobre os números complexos e tripletos em primeiro lugar. No dia seguinte à fatídica caminhada, no outono de 1843, Hamilton enviou a Graves uma carta descrevendo a descoberta. Graves respondeu nove dias depois, cumprimentando Hamilton pela ousadia da ideia, mas adicionando: “Ainda há algo no sistema que me atormenta. Eu ainda não tenho uma clara visão de até que ponto temos a liberdade de criar imaginários e dotá-los de propriedades sobrenaturais”. Ele perguntou: “Se com sua alquimia você pode fazer três potes de ouro, por que parar por aí?”.\n\nAssim como Cardano antes dele, Graves pôs suas preocupações de lado tempo suficiente para conjurar algum louro para si mesmo. Em 26 de dezembro ele escreveu novamente a Hamilton, descrevendo um novo sistema numérico octodimensional que hoje é conhecido como octônios. Entretanto, Graves não foi capaz de fazer Hamilton se interessar por suas ideias. Hamilton prometeu falar sobre os octônios de Graves na Irish Royal Society, maneira como os resultados matemáticos eram tornados públicos na época. Mas Hamilton continuou deixando isso de fora e, em 1845, o jovem gênio chamado Arthur Cayley redescobriu os octônios e publicou os resultados antes de Graves. Por essa razão os octônios são, às vezes, conhecidos como números de Cayley.\n\nPor que Hamilton não gostou dos octônios? Por um lado, ele estava obcecado com a pesquisa de sua própria descoberta, os quaternions. Mas ele também tinha uma razão puramente matemática: os octônios quebram algumas leis da aritmética.\nOs quaternions já eram um pouco estranhos. Quando você multiplica números reais, não importa em qual ordem o faz: 2 vezes 3 é igual a 3 vezes 2, por exemplo. Dizemos que a multiplicação comuta. O mesmo vale para números complexos. Mas os quaternions são não comutativos, ou seja, a ordem da multiplicação interfere no resultado final.\n\nOrdem é importante porque os quaternions descrevem rotações em três dimensões e, para essas rotações, a ordem faz diferença para o resultado final. Você mesmo pode checar isso (ver quadro abaixo). Pegue um livro, vire-o de cabeça para baixo, de modo que você agora veja a capa de trás, e depois gire um quarto de volta no sentido do relógio (faça esse giro vendo o livro de cima). Agora troque a ordem dessas operações: primeiro gire um quarto de volta, e depois vire o livro. A posição final é diferente. Porque o resultado depende da ordem, as rotações não comutam.\n\nOs octônios são muito mais estranhos. Não apenas eles são não comutativos como quebram outra familiar lei da aritmética: a lei associativa (xy)z=x(yz). Todos nós vimos uma operação não associativa em nosso estudo em matemática: a subtração. Por exemplo, (3 - 2) -1 é diferente de 3 - (2 - 1). Mas estamos acostumados com a multiplicação sendo associativa, e a maioria dos matemáticos ainda pensa desse modo, mesmo acostumados com operações não comutativas. Rotações são associativas, embora não sejam comutativas.\n\nMas talvez o mais importante: na época de Hamilton não estava clara a utilidade dos octônios. Eles estão intimamente relacionados com a geometria de sete e oito dimensões, e podemos descrever rotações usando multiplicação de octônios. Mas por mais de um século isso foi um exercício puramente intelectual. Levaria tempo até o desenvolvimento da física de partículas – e da teoria de cordas, em particular – para demonstrar a utilidade dos octônios. \n\nSIMETRIA E CORDAS\nNOS ANOS DE 1970 E 1980, físicos teóricos desenvolveram uma belíssima ideia chamada supersimetria. (Mais tarde os pesquisadores aprenderiam que a teoria de cordas exige a supersimetria.) Ela afirma que nos níveis mais fundamentais, o Universo exibe uma simetria entre a matéria e as forças da Natureza. Cada partícula de matéria, como um elétron, tem uma partícula parceira que carrega a força. E cada partícula de força, como um fóton (o transmissor da força eletromagnética), tem uma partícula de matéria como gêmea. \n\nA supersimetria também engloba a ideia de que as leis da física permaneceriam imutáveis se trocássemos todas as partículas de matéria e força. Imagine ver o Universo em um estranho espelho que, em vez de trocar o lado esquerdo pelo direito, trocasse cada partícula de força por uma de matéria e vice- versa. Se a supersimetria for verdadeira, se ela realmente descreve o Universo, esse universo espelho funcionaria do mesmo modo que o nosso. Mesmo que os físicos ainda não tenham encontrado qualquer evidência experimental que suporte a supersimetria, a teoria é tão bela e tem conduzido a tão encantadora matemática que muitos físicos acreditam que ela seja real. \n\nUma coisa que sabemos ser real, entretanto, é a mecânica quântica, e, de acordo com ela, as partículas são, também, ondas. Na versão padrão tridimensional da mecânica quântica, que os físicos usam no dia a dia, um tipo de número, chamado espinor, descreve o movimento ondulatório de partículas de matéria. Outro tipo de número, os vetores, descreve o movimento ondulatório de partículas de força. Se quisermos \nentender as interações entre as partículas, temos de combinar esses dois tipos usando uma imitação remendada da multiplicação. Embora o sistema que usamos agora pareça funcionar bem, ele não é muito elegante.\nComo alternativa, imagine um estranho universo desprovido de tempo, contendo apenas o espaço. Se esse universo tem dimensão um, dois, quatro ou oito, então ambas, partículas de matéria e força, seriam ondas descritas por um único tipo de número – ou seja, um número em uma álgebra de divisão, o único tipo de sistema que permite a adição, subtração, multiplicação e divisão. Em outras palavras, nessas dimensões os vetores e os espinores coincidiriam: eles seriam, cada um, apenas números reais, números complexos, quaternions ou octônios, respectivamente. A supersimetria emerge naturalmente, provendo uma descrição unifi cada da matéria e das forças. Uma simples multiplicação descreve as interações, e todas as partículas – não importa o tipo – usam o mesmo sistema numérico.\n\nAinda assim, nosso universo de brinquedo não poderia ser real porque precisamos levar em conta o tempo. Na teoria de cordas, essa consideração tem um efeito intrigante. Em qualquer momento no tempo, uma corda é um objeto unidimensional, como uma curva ou linha. Mas essa corda traça uma superfície bidimensional conforme o tempo passa (ver ilustração acima). Essa evolução muda as dimensões nas quais a supersimetria aparece, ao adicionar duas – uma para a corda e uma para o tempo. Em vez da supersimetria em dimensão um, dois, quatro ou oito, temos, com essa adição, a supersimetria em dimensão três, quatro, seis ou dez. \n\nCoincidentemente, os teóricos de cordas vêm dizendo, há anos, que apenas as versões com dez dimensões (decadimensionais) são autoconsistentes. As demais sofrem de anomalias, nas quais o mesmo cálculo, quando efetuado de duas maneiras diferentes, dão resultados diferentes. Em qualquer outra versão que não a decadimensional a teoria de cordas falha.\n\nMas a decadimensional é, como acabamos de ver, a versão da teoria que usa octônios. Assim, se a teoria de cordas estiver correta, os octônios não são uma curiosidade inútil; pelo contrário, eles fornecem uma razão profunda por que o Universo deve ter dez dimensões: em dez dimensões, partículas de matéria e força estão embebidas no mesmo tipo de números – os octônios. Mas esse não é o fim da história. Recentemente os físicos começaram a ir além das cordas para considerar as membranas. Uma membrana bidimensional, por exemplo, ou 2-brana, parece com uma folha a cada instante. Conforme o tempo passa, ela traça um volume tridimensional no espaço-tempo. \n\nEnquanto na teoria de cordas tínhamos de adicionar duas dimensões à nossa coleção padrão de uma, duas, quatro ou oito, agora temos de adicionar três. Assim, quando lidamos com membranas, esperaríamos que a supersimetria emergisse naturalmente em dimensão quatro, cinco, sete e onze. E, como na teoria de cordas, temos uma surpresa na história: pesquisadores nos dizem que a teoria-M (o “M” geralmente significa membrana) requer 11 dimensões – o que implica que ela deveria fazer, naturalmente, uso dos octônios. Infelizmente, ninguém entende a teoria-M bem o suficiente até mesmo para escrever suas equações básicas (de onde poderíamos pensar que “M” significa misteriosa). É difícil dizer precisamente que forma ela deve tomar no futuro.\n\nNesse ponto devemos enfatizar que a teoria de cordas e a teoria- M não fi zeram nenhuma predição experimentalmente testável. Elas são belos sonhos – mas até agora apenas sonhos. O Universo em que vivemos não parece ter 10 ou 11 dimensões, e ainda não vimos qualquer simetria entre partículas de matéria e de força. David Gross, um dos maiores especialistas em teoria de cordas, colocou as estatísticas de detectar alguma evidência de supersimetria no LHC do Cern em 50%. Céticos dizem que é muito menos que isso. Apenas o tempo dirá.\n\nDevido a essa incerteza ainda estamos distantes de saber se os estranhos octônios são imprescindíveis para o entendimento do mundo que vemos ou se são apenas um ramo da matemática. É claro que a beleza matemática compensa por si só, mas seria melhor se os octônios estivessem, de fato, incorporados ao tecido da Natureza.",
				"added": 1543686666
			},
			{
				"comment_id": 2,
				"body": "#O conceito de uma teoria de tudo é arraigada em uma velha ideia de causalidade, famosa expressão de Laplace:\n\nUm intelecto que em um certo momento pudesse conhecer todas as forças que estabelecem a natureza em movimento, e todas as posições de todos os temas que essa natureza compõe, se esse intelecto fosse também tão suficiente para apresentar esses dados em uma análise, que pudesse unir em uma simples fórmula os movimentos dos grandes corpos do universo e o muito pequeno do átomo; para esse tipo de intelecto nada será incerto e o futuro como o passado seria o presente para esses olhos\n— Essai philosophique sur les probabilités, introdução. 1814",
				"added": 1543686802
			},
			{
				"comment_id": 5,
				"body": "-0.083333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333...",
				"added": 1543700664
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 3,
				"body": "#Proteína gp120 do Envelope de HIV: Proteína do envelope externo do vírus da imunodeficiência humana que é codificada pelo gene env do HIV. Tem um peso molecular de 120 kD e contém numerosos sítios de glicosilação. A gp120 liga-se a células que expressam antígenos CD4 na superfície celular, mais notavelmente os linfócitos T4 e monócitos/macrófagos. Verificou-se que a gp120 interfere com o funcionamento normal do CD4 e é pelo menos parcialmente responsável pelo efeito citopático do HIV.",
				"added": 1543693045
			},
			{
				"comment_id": 4,
				"body": "#Candidato à vacina contra gripe universal protege contra múltiplas cepas\n- https://sci-hub.tw/10.1038/s41467-018-05482-0",
				"added": 1543693778
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 6,
				"body": "-0.083333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333333...",
				"added": 1543700696
			},
			{
				"comment_id": 7,
				"body": "#Qual o tamanho do infinito?\nVeja a lição completa: http://ed.ted.com/lessons/how-big-is-infinity Utilizando fundamentos de teoria dos conjuntos, explore o conceito intrigante do \"infinito dos infinitos\" — e como ele levou matemáticos à conclusão de que na matemática há perguntas para as quais não há respostas. Lição por Dennis Wildfogel, animação por Augenblick Studios.\n\n\n- https://www.ted.com/talks/dennis_wildfogel_how_big_is_infinity?language=pt-br&utm_campaign=tedspread&utm_medium=referral&utm_source=tedcomshare",
				"added": 1543701097
			}
		]
	},
	"comment_vote": {}
}