{
	"title": "CAFFEINE\nLUNCH",
	"description": "",
	"links": "- [Source code](http://127.0.0.1:43110/15u2FYH7eVQPKLuyfX4AA8sjB3775kbN2W/)",
	"next_post_id": 6,
	"demo": false,
	"footer": "I like chocolate",
	"modified": 1556280876,
	"post": [
		{
			"post_id": 5,
			"title": "How to choose: Linux distribution",
			"date_published": 1556279093.322,
			"body": "<span class=\"tlid-translation translation\" lang=\"en\">By now there are hundreds of distributions based on the linux kernel that can satisfy every kind of need.\nSo how to choose one?\nMainly we must consider its future use: will it be used to listen to amateur radio or to program?\nIf you are a common user you will have to choose a more generic distro, such as ubuntu, fedora ..., if you are instead a user with more specialized intent you will have to search for and choose a distro with particular characteristics, or change a basic distro.\nOnce identified its use, all software and compatibility, such as the package manager or video drivers, will have to be evaluated (generally these things are already verified and working on most common distro).\nIf you consider yourself an expert user of the linux world, you can try to create your own installation of Linux Arch or more difficultly Gentoo.\nIf no version can satisfy you, you can create it using Linux from Scratch (very well documented).\nBut with all these distributions you can't always choose the right one right away, so the only solution is to choose one and try, if you don't like it choose another and try it, until you find one that suits your needs.\nIt should also be noted that the various installations allow you to create a separate home partition so that by changing distro you don't lose your documents and configurations.</span> <span data-cke-bookmark=\"1\" style=\"display: none;\"></span>"
		},
		{
			"post_id": 4,
			"title": "How to choose",
			"date_published": 1556278936.247,
			"body": "Here I will open a small series of posts in which I will write about my thoughts on the choice of almost everything, from programming languages to hardware components.\nI hope to be interesting and to satisfy the questions that many people ask themselves and which are difficult to find answers."
		},
		{
			"post_id": 1,
			"title": "CAFFEINE LUNCH",
			"date_published": 1525442036,
			"body": "<span class=\"tlid-translation translation\" lang=\"en\"><span title=\"\">I always wanted to create a blog.</span>\n<span title=\"\" class=\"\">So here I am, talking about technology and programming on zeronet :)</span></span>"
		}
	],
	"tag": [
		{
			"value": "creation\n",
			"post_id": 1
		},
		{
			"value": "how-to-choose",
			"post_id": 4
		},
		{
			"value": "how-to-choose",
			"post_id": 5
		}
	]
}