{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1584726498,
			"title": "Please seed my eroge channel!",
			"body": "Have fun with my erotic games! My node broke some days ago and my last games was not shared, please seed!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:15f1_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF",
			"added": 1584726497
		},
		{
			"topic_id": 1589536277,
			"title": "Porn will make zeronet great!",
			"body": "I'm trying to upload some compressed porn clips on IFS. Go to my channel!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
			"added": 1589536275
		},
		{
			"topic_id": 1589830520,
			"title": "There is a zite to upload big files >1 GB other than IFS?",
			"body": "My eroge games was deleted from IFS. I tried zeroup unlimited but don't upload big files. There is another good alternative on zeronet?",
			"added": 1589830517
		},
		{
			"topic_id": 1589899830,
			"title": "RapeLay&PlayHome. An historical eroge banned from clearweb and its sequel now on ZeroNet!",
			"body": "RapeLay is an eroge created by Illusion in 2006 and banned in all western countries. I find a rare english-translated version of this game and uploaded it on IFS with its sequel (IFS is the only zite that allow files bigger than 1 GB). The sequel of this game, also developed by Illusion, is Playhome. The 2 games are hentai rape-simulators and have a similar gameplay, but the latter is more advanced (improved graphics and plot, custom characters, mod, etc...)\n\nI hope that this network will guarantee long life to these rare gems!. Please download and seed these 2 files. These files are very big and i have a slow connection under TOR, please be patient, all the seeding process will require many days to be completed.\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1PmagXPm9EpReQTJrrsgBYignpgeGzCrZ6_item_21+type:archive\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1PmagXPm9EpReQTJrrsgBYignpgeGzCrZ6_item_19+type:archive",
			"added": 1589899826
		}
	],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 1,
				"body": "> [a2llfd](#comment_29_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx): Is there any particular reason, why pigeons on the street suddenly start to find PDF-files of books or porn videos interesting? The moment ZeroNet goes mainstream, many of th mainstream problems come with it.\n\nthat is true, but more nodes =more bandwidth and storage for all! Just now we can seed little videos files well!\n\nI see that porn files that are less than 10 MB are now well seeded, but bigger files don't have other seeds other mine. Can you help me to seed also these files? Can be a good idea divide big files videos in high compressed parts to make this more easy? My video bitrate now is around 400k...very similar to original porn sites where i taken the clips, because of this zeronet can be a very good alternativeto these sites if there are more nodes online",
				"added": 1589623362
			},
			{
				"comment_id": 3,
				"body": "> [aassddff](#comment_4_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Oh wow, degeneracy in video! Exactly what we needed. After all, this is something rare that you can't find anywhere.\n\nThis is only the beginning....in future i will post more rare material! :D",
				"added": 1589647815
			},
			{
				"comment_id": 4,
				"body": "> [aassddff](#comment_5_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I don't even want to think about what that would be.\n\nif you don't like it don't share it. you can also ban me if you want; the difference from clearnet is that here your opinion have no value for who want to follow me. Here you decide, in clearnet you don't decide at all!",
				"added": 1589652897
			},
			{
				"comment_id": 5,
				"body": "> [blurhy](#comment_492_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Porn is a significant part of internet, and you have no right to censor people from watching porn.The very first step to take over the centralized web is to have porn.\n\n> [blurhy](#comment_492_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Porn is a significant part of internet, and you have no right to censor people from watching porn.The very first step to take over the centralized web is to have porn.\n\ni'll do my best! :D help me sharing my stuff!",
				"added": 1589652967
			},
			{
				"comment_id": 6,
				"body": "> [aassddff](#comment_6_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I don't remember trying to censor you. You have as much freedom to share porn as I do to say that it's bullshit and you shouldn't.And it's not just a matter of me not sharing it. Pornography is dangerous in general and nobody should share or see it.Not through censorship, but through understanding that pornography and masturbation are much like having cocaine on you all the time.If I know this and keep quiet, shame on me for my omission\n\nOnly different point of views. Here anyone can censor anyone locally in his PC :D . Zeronet respect your decision as respect mine, and because of this i like this network. Personally i banned some users because i don't want to host their content, maybe others disagree with me, but what is in your PC is only your responsability, not mine.",
				"added": 1589660773
			},
			{
				"comment_id": 7,
				"body": "My clips are 100% legal, filmed with celebs and taken from mainstream movies (very often not-porn ones).\nMaybe are taken from the same movie that you watched with your wife yesterday, anyway almost all my clips are well seeded now; because someone are interested! (but here you almost all are \"against\" my material, hypocrites!)",
				"added": 1589689863
			},
			{
				"comment_id": 8,
				"body": "IFS banned my channel? is that zite still alive? why i can't post porn?",
				"added": 1589745849
			},
			{
				"comment_id": 10,
				"body": "All my stuff is now on MillChan! Have fun!!!\n\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF:eroge:0",
				"added": 1589810328
			},
			{
				"comment_id": 17,
				"body": "> [k297rf](#comment_6_15wyZrQv2HaQQD7usbZ6iXTxY7DKAChnGP): Rape scenes and other abuse scenes are certainly not my taste, but I guess a collection of mainstream movie production clips that are such a taboo nowadays that they are censored, does make sense. Including the rape scenes of various Hollywood creations. So, that site is not really a porn site in the 2020 sense. It's more like a historic archive of mainstream movie clips that should be preserved for historical culture studies purposes. Unpleasant clips, but so are wars and concentration camp photos. Worth archiving.\n\nTotally agree! Anyway rape scenes are also filmed in many modern movies that also won prizes like the Stockholm International Film Festival's award for best film, won by Irréversible (2002). I uploaded also the brutal rape scene of this film on ZeroNet.",
				"added": 1589879909
			}
		],
		"1573689881_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 2,
				"body": "I'm loading some porn vids on it and seems to work! Great platform!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\n\nplease seed and have fun! :D\n\n",
				"added": 1589636660
			}
		],
		"1589783095_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 9,
				"body": "i repeat here what i've already told. My files are 100% legal, taken from mainstream movies. I'm against illegal porn. Rape fantasies are very common also in normal people and for me are lecit until don't become real and are used to harm. You can ban me if you don't like my porn files, but i'm not committing any crime. On zeronet you're free to share what you want and don't share what you hate, but was necessary to remove also the file pointers to IFS?\n\nMy files disappeared yesterday from IFS and i don't know why. Also the last modify to the IFS site was done yesterday. Probably the IFS owner deleted my channel. (is still online?)\n\nThe only way that allow my files to go on your seedbox is because someone access it and download them. Normally only the pointers of the files are shared automatically between the nodes of the network (you can see if that files are online in IFS home page, but to download them on your computer you must click on it). I never enter in your seedbox.",
				"added": 1589797144
			}
		],
		"1589830520_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 11,
				"body": "Here my small files on zeroup unlimited:\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/1589829961-THE_Sleeping_Rape.zip\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/Night%20Attack%20on%20Little%20Sis%20Ver.1.13.zip\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/1589830027-NightHigh_4.rar\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/MILF_Next_Door_-_Saeko__The_Room.rar\n\n",
				"added": 1589830665
			},
			{
				"comment_id": 12,
				"body": "http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/Particular%20Grope%20Train[Ver.1.01].rar\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/1589830071-SoldGirlTown.rar\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF/1589830097-NightHighSeries.zip",
				"added": 1589830735
			},
			{
				"comment_id": 13,
				"body": "> [mg0](#comment_315_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): You could make sliced .zip files each below 1000000000B and upload those. I think you may have a better audience (and possibly storage allowances) at millchan, but I haven't tried uploading big files there so I don't really know the limits.\n\ni'm using millchan for vids, but don't allow hosting of compressed files. i will split my files",
				"added": 1589833942
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_2182_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I can see why people would delete your material. It's probably disturbing if the acting is any good.\n\nyes, my files is disturbing but is totally legal. Many of my clips are taken by \"rape and revenge films\" a subgenre very popolar in '70s but also nowdays\n\nhttps://en.wikipedia.org/wiki/Rape_and_revenge_film\n\nFor example the file cited in a previous post \"Michael_Caine_with_a_young_girl___Watch_online.mp4\"   is a scene from Quills:  https://en.wikipedia.org/wiki/Quills\n\nThis movie garnered numerous accolades for Rush, including nominations for an Oscar, BAFTA and a Golden Globe, but are not allowed on a platform created to avoid censorship like zeronet...it's ridiculous.",
				"added": 1589834636
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_2185_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's not disallowed on ZeroNet. The few takedowns you've experienced don't speak for the whole network. You'll find a place to put them and ZeroUp Unlimited might be just that.\n\ni love this network because the users have the power. If i can't post on a zite i can find another one without problem. For me this is also a test...not only for this software :)",
				"added": 1589835745
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2187_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My advice is to make your titles less sketchy. \"young girl\" sets off alarm bells. On top of that, not everyone will figure out that it's acting from seeing \"Michael Caine\" in the title.\n\ni downloaded the vid from a site on clearnet with an automatic tool and don't renamed it. i will rename it the next time",
				"added": 1589836866
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 18,
				"body": "> [aassddff](#comment_43_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): There are some things that are not meant to be archived, do no good in being archived, and should not be archived.Not every information is good and worth protecting, and I recommend you look for help about this rape obsession of yours.\n\nI totally agree with you about not every information is good and worth protecting. I'm not a rapist and i respect women. I want only to preserve these vids and games because our hypocritical society wants to ban them! (for me our society are very violent and dominated by machismo and false feminism). These files are our history in cinema and eroge, who burns the ancient books for me is a criminal.\n\nAnyway some hours ago i found on IFS a really disturbing probably real snuff video where a woman are raped and killed, and i'm stll vomiting after i see this! (i don't want to link this vid here) I banned this asshole, but why the IFS admin don't delete this shit? He is doing a real mess now.",
				"added": 1589967448
			},
			{
				"comment_id": 19,
				"body": "> [xerog](#comment_42_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv): Either report this to somebody who has admin control so this person can ban the user or stop raising alarms and make accusations in public! So far you are the only one who makes wreckless things and a mess on other people's zites. #metoobs\n\nYou know who is the IFS admin? maybe all these files disappeared because a bug not because an human. i'm doing only hypothesis.",
				"added": 1589972072
			}
		]
	},
	"comment_vote": {
		"492_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	}
}