{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 2,
			"title": "ZEROUP não sobe arquivo, aguem está com este problema?",
			"body": "Internet de 10/100 mais os arquivo não vai, da erro de assinatura.\nAlguém aqui intende de php, html, C++, vamos abrir o código fonte desta bagaça, pra ver o que está acontecendo.",
			"added": 1541163243
		},
		{
			"topic_id": 3,
			"title": "Não lembro qual programa criptografou o arquivo, muito menos a senha!",
			"body": "Tenho um HD de 160 GB, nele tem um arquivo de 120 GB que está criptografado, está guardado a mais de anos, este arquivo são projetos eletrônicos e do autocad.\nA algum programa que consiga descobrir a senha, ou eu posso esquecer, porque se depender de mim, não faço a mínima ideia que senha usei, e muito menos o programa que criou o arquivo criptografado.\n\nQualquer ajuda será bem vinda, agradecerei muito.",
			"added": 1548735020
		},
		{
			"topic_id": 4,
			"title": "COVID-19, INFORMAÇÕES DECENTRALIZADA.",
			"body": "",
			"added": 1593352523
		},
		{
			"topic_id": 5,
			"title": "Site (youtube)",
			"body": "Alguns arquivos do site youtube faz tempo que estão parado, será que o site foi mudado para um outro nome, ou endereço?",
			"added": 1605257012
		},
		{
			"topic_id": 6,
			"title": "PROBLEMA EM BAIXAR ARQUIVOS.",
			"body": "O grande problema que as pessoa encontra em baixar arquivos no (Zeronet), é que a maioria ainda estão engatilhando, e não sabe o mínimo de como enviar um arquivo para um determinado site, um exemplo disso é os arquivo do site (youtube) é o (Big Kopy Kate), a maioria dos arquivos postados lá, não tem (Seed), o que acontece é que alguns usuários menos informado, quando enviam um arquivo,  ao receber a informação de (upload concluído), imaginam que o arquivo já foi enviado, e simplesmente sai do (Zeronet), e só voltam 3 meses depois.\n\nMinha gente, a informação de (upload concluído), é a apenas a geração do link referente ao arquivo, e o envio do mesmo para rede (p2p). Para  que as pessoas possam baixar o arquivo que está na sua maquina, no banco de dados da sua (Zeronet) e compartilhar com os outros, é preciso que você fique logado, no momento após o (Upload concluído), você é o único que tem este arquivo , é preciso que fique logado por pelo menos uma, ou 2 horas por dia, dependendo do tamanho do arquivo e de sua velocidade de (upload).\n\nVamos nos ajudar.",
			"added": 1605711615
		}
	],
	"topic_vote": {},
	"next_comment_id": 27,
	"comment": {
		"1_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": [
			{
				"comment_id": 1,
				"body": "Fala Mario Nunes\nEu tenho alguns conhecimentos, e um monte de maquinas, seu eu servir, estou pronto para inverter a rotação da terra.",
				"added": 1535255472
			}
		],
		"1_1PCYHhrL3dQCiB3cSHU2xk2M7rKk7Y6mUd": [
			{
				"comment_id": 2,
				"body": "Entendo sua revolta.",
				"added": 1535258444
			}
		],
		"1_13EGPekwj4ircZgQNA7tgrhyTMkLTrQ2DL": [
			{
				"comment_id": 3,
				"body": "Muito bom!\nAgora para navegar a todo vapor, maquina virtual tem perda de desempenho para conteúdo de multe media em 1080 e 4K.\nNeste caso só com firewall particular a base de script.\nPara quem não manja de firewall a base de script,  a sua sugestão está perfeita, agora para se livrar da perda de desempenho da maquina virtual, é muito simples. ai vai:\n\n1-  monta um pc simples qualquer um serve, coloca mais uma placa de rede GB 1000/100, a placa de rede on borde se tiver, nesta entra a internet que vem do modem, configurado sem servidor DHCP. \n\n2 Instala o Honix nesta maquina, configura o bicho direitinho, escraviza a danada da placa GB para ser  a saída da internet que o honix criou.\n\n3 Agora compra um roteador TPLINK  conecta ele na placa GB  onde está instalado o Nonix, configura o servidor DHCP do mesmo, as vezes nem precisa.\n\n4 conecta todos os teus equipamento que usa internet no roteador, ele tem de 4 ~ 6 e saida LAN e WIFI para teu celular, se tu precisar de mais, compra uma HUB. \n       \nPronto filho,(a) o mundo é teu, usa qualquer sistema que tu quiseres, windows 3.1, 95,98,ME,XP, até a mãé de pantanha.\nGrande abraços.\nPetolomeu: Adm de sistema a 20 anos.",
				"added": 1535261095
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 4,
				"body": "Parabéns.",
				"added": 1535261680
			}
		],
		"1_1GGJYF2LseYo5GAiw6BisisHkUjC1DkAxa": [
			{
				"comment_id": 5,
				"body": "As vezes este problema é com o seu navegador, use o (Chrome).",
				"added": 1535261899
			},
			{
				"comment_id": 8,
				"body": "> [marionunes](#comment_1_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Eu estou fora do zeronet há algum tempo, retornando agora.Mas o que vejo é a dificuldade de se manter um site, a forma de desenvolvimento dele ainda não é clara para o usuário normal de computadores.\n> Vi que houve algumas melhorias que me fizeram ver novamente a rede Zeronet com bons olhos.\n\nPara se criar o site no zeronet  com recursos avançados  precisa ser programador em pelo menos 3 linguagem de programação: php html e python,  a opção que o zeronet oferece de criar um novo site, é apenas para criar um endereço inerente ao usuário, uma página em branco com apenas os recursos minimos.\n\nPara o usuário final que apenas deseja usufruir e navegar, melhor expressar o site que desejaria em algum blogue relacionado,  que certamente a galera vai criar, mas isso não que dizer que não possa tentar, livros e dicas é o que não falta  aqui.",
				"added": 1541489200
			}
		],
		"1_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 6,
				"body": "> [moor](#comment_5_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): ultima vez que verifiquei era 200mb, melhor perguntar em no zerotalk em ingles.\n\nValeu.",
				"added": 1540195942
			}
		],
		"2_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 7,
				"body": "> [moor](#comment_6_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): qual o tamanho do arquivo?\nMenos do 200m, que é o limite máximo permitido.\n\nTem um monte de arquivo meus na fila de up,",
				"added": 1541248917
			}
		],
		"1_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": [
			{
				"comment_id": 9,
				"body": "Mano,.. Se fosse você eu voltava pra mim.",
				"added": 1554617791
			}
		],
		"1_1FAjgFhx96FDLwnL2JCMYDjuT9QcGneETU": [
			{
				"comment_id": 10,
				"body": "Todos os meus sonhos se passam nos anos 20, e eu sou uma fantasma, porque ninguém me nota.",
				"added": 1554618050
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 11,
				"body": "Filho, acho que você está equivocado, você não precisa de internet, para ter acesso aos seus arquivos, ou site que você usa no seu (zeronet), se você perdeu seus arquivos, sinto muito por você, mas o fato é que você cometeu algum ero na sua maquina, e afetou o banco de dados do seu 0NT.\nMeu 0NT está com 350G, nuca perdi 1Kbps de dados.",
				"added": 1574497746
			},
			{
				"comment_id": 12,
				"body": "> [caropc10](#comment_1_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL): bem vindo ao mundo real meu filho, e ficar reclamando vai melhorar a zeronet ?\n> NÃO, tem que TU mesmo criar um site seu, clone o site e deixe ele sob TOTAL dominio TEU, este é um dos principios da zeronet, assim tu GARANTE que NINGUÉM vai deletar o TEU material .\n> Eu estou ajustando algumas coisas por exemplo no site big kopy kate, e estou fazendo uma versão 2 do mesmo, com suporte a mp3 e login DESCENTRALIZADO, pois a versão 1, só dá suporte ao zeroid que já deu pau mês passado e NÃO posso correr o risco de depender de algo CENTRALIZADO.\n> Fora que quero aumentar o tamanho de arquivos por usuários para uns 4Terabytes.\n> Quero aumentar o tamanho de 2GB atuais para uns 5GB por video e etc.\n> Tipo eu pelo menos não tive problemas até agora com o site big kopy kate tirando este problema do sistema login centralizado que usam.\n> Fora que acho que falta também sistema de playlist e suporte a audio, quero adicionar mp3 e deixar as thumnails como fundo enquanto toca a musica ou podcast\n> Espero conseguir terminar estas melhorias este ano ainda.\n\nUse o Editor (Atom) é muito bom",
				"added": 1574498233
			}
		],
		"1_1NMiZdtd3ht5fRxUVLndtGXSvqyH6BzD7": [
			{
				"comment_id": 13,
				"body": "> [duende](#comment_19_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Se mate, brasileiro de merda, cancer do mundo.\n\nQUE TÁ PEGANDO PEQUENO?",
				"added": 1577291260
			}
		],
		"3_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 14,
				"body": "> [olhador](#comment_16_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me): Se fodeu.\n\nAcho mesmo, tens razão",
				"added": 1594708986
			},
			{
				"comment_id": 15,
				"body": "> [marionunes](#comment_6_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Genial! Ai tu não ajuda muito!\n> Tenta ajudar ai, diz qual a extensão, qual sistema operacional usou para isso!\n\nA extensão é : .DDD\n\nNa época usava windows xp 32 bit.",
				"added": 1594709243
			},
			{
				"comment_id": 26,
				"body": "> [sfnerdragon](#comment_1_17ePSkSw2Vy5R8EkHeb6PtMWsQYvkMKqrh): já tentou usar o comando file dos *nix para tentar achar algum cabeçalho de arquivo que indique a natureza do conteúdo? Se for um formato conhecido de algum algoritmo fraco que PCs de hoje quebram a senha em questão de dias, pode ser seu dia de sorte.\n\nBem lembrado.",
				"added": 1615186249
			}
		],
		"1_1Ew86XmYg67eqxLWsQaXBhuzpcT55MhD3t": [
			{
				"comment_id": 16,
				"body": "É, sem tu fazer nada, agora se queres reforçar mais, o limite é o teu conhecimento filho.",
				"added": 1598249335
			}
		],
		"2_1FWvwLsD6jLUmYYhjsrLAhKrgGF1dR3yDR": [
			{
				"comment_id": 17,
				"body": "Cria teu proprio site, aqui tem tutoriais: como criar um site.",
				"added": 1603073046
			}
		],
		"1_1NapcyFaDgMx3T8eR7wpMmuSza3acwT9wA": [
			{
				"comment_id": 18,
				"body": "Iniciante em que?",
				"added": 1603073421
			}
		],
		"1_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F": [
			{
				"comment_id": 19,
				"body": "Vamos em frente.",
				"added": 1603074207
			}
		],
		"6_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": [
			{
				"comment_id": 20,
				"body": "> [caropc1v25](#comment_2_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU): já aviso a tempos, parem de usar serviços CENTRALIZADOS, serem serem respeitados AJUDEM a manter serviços DESCENTRALIZADOS, comprem hd's maiores 1 ou 2 , hd's de 2 tera e ou ajudem pelo menos a manter alguns sites , doando bitcoins ou mantendo os conteudos aqui na zeronet.\n> Pois está putaria na mainnet, é normal.\n> Tem upar e manter material DE INTERESSE das massas  AQUI na zeronet, e mostrar que por exemplo filmes, aqui é melhor que youtube, pois NÃO TEM PROPAGANDA , pelo menos não vi ainda e acho que quem desenvolveu o site que uso mais , que é o big kopy kate 2, não deve colocar propaganda no mesmo.\n> exemplo de material nele :\n> Homem de Ferro 3 (Iron Man) 2013 Dub\n> http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1603611127_1JE8S4ttASQABNBq1cW5BhCzxo76kEUKnM\n> Sinopse: Depois de um inimigo reduzir o mundo de Tony Stark a destroços, o Homem de Ferro precisa aprender a confiar em seus instintos para proteger aqueles que ama, especialmente sua namorada, e lutar contra seu maior medo: o fracasso.\n\nTamo colado",
				"added": 1605021861
			}
		],
		"1_1Bp9Yvnrx9dvJty9quB5d8h18FoPJTdjVT": [
			{
				"comment_id": 21,
				"body": "Como você usa um dispositivo móvel, seu banco de dados é minúsculo, neste caso basta só que faça uma cópia do seu arquivo (users.Json), que por sinal é muito pequeno, pode ser salvo até no seu email. \n\nAgora se usa (Zeronet) em uma máquina, e seu banco de dados já ultrapassa (1 TB),\na coisa muda de senário.\n\nJá viu esta msg, asim que você entra no Zero: \n   \"Faça backup do arquivo users.json para manter sua identidade e dados seguros.\"\nè isso que tens que fazer.",
				"added": 1607759926
			}
		],
		"5_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 22,
				"body": "> [nekros](#comment_1_1AT3eHbfX6wkZk4sPPEhgUJ9K7Lji8mBvi): Até onde eu sei não\n\ncerto",
				"added": 1607805776
			}
		],
		"4_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 23,
				"body": "O imunologista fala uma linguagem simples: a vacinação Corona é um experimento humano sem escrúpulos\nhttps://www.anonymousnews.ru/2020/12/08/corona-impfung-menschenexperiment/",
				"added": 1610671483
			}
		],
		"1_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 24,
				"body": "Como vamos reverter! se 75% é analfabeto digital, e o próprio governo é conivente,  A maldita 5G está chegando, em alguns estados BR, e imagina, a empresa que vai implantar a tal, é proibida em quase toda a Europa.",
				"added": 1612335810
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 25,
				"body": "Alguém aqui curte gogumelo?",
				"added": 1614114461
			}
		]
	},
	"comment_vote": {
		"1_16VZqzJJxYj83xyaHopnqjeusETxLTf3PS": 1,
		"4_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1
	}
}