{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Сборка Telegram+I2Pd - все настроено и работает \"из коробки\"",
			"body": "http://127.0.0.1:43110/1MvaFoTB34pxWBn9LCm5H1kXAVtZGRKWLt/data/users/1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu/1524399798-TelegramI2Pd.zip\n\nВинда.\nЗапуск исключительно батником. Работает через выходную ноду i2p.\nАвтор сборки предупреждает о том, что если нет базовых знаний i2p, то не стоит играть с предустановленными настройками.\n\n(с) http://meeh.i2p",
			"added": 1524400119
		}
	],
	"topic_vote": {},
	"next_comment_id": 31,
	"comment": {
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [],
		"1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT": [
			{
				"comment_id": 2,
				"body": "Нет. Просто твой клиент \"узнал\" новые пиры, которые тут давно.",
				"added": 1519922157
			},
			{
				"comment_id": 3,
				"body": "20-40 тыс.  из которых процентов 50 или больше - Китай - это далеко не \"весь мир\" ) Да и пиры тут считаются, похоже, \"с накоплением\", т.е. \"все за весь период\", а не \"активные\"...",
				"added": 1520167565
			}
		],
		"2_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 4,
				"body": "В блокчейне (пока в большинстве случаев,  но за известными исключениями) тебе нужно иметь всю цепочку у себя. Тут тебе не нужно иметь все зайты у себя, а только интересные тебе. Так что описанный предел сильно отодвигается. \nЗато тут есть дизайн-проблема с потенциально неограниченным количеством мелких файлов, которые будут хранится у тебя на винте, сильно отравляя жизнь, особенно на \"среднеслабых\" системах.",
				"added": 1520252491
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 5,
				"body": "Не слушайте всяких некомпетентных мудаков на зарплате у других еще менее компетентных мудаков.",
				"added": 1520337812
			},
			{
				"comment_id": 8,
				"body": "Кроме того, мешы подразумевают открытые вай-фай споты, причем чтобы они \"выходили\" за пределы квартиры. Это напрямую нарушает закон. Почти любой вай-фай роутер нарушает этот закон прямо сейчас. Просто сейчас все понимают что так это работает и всем наплевать, но если будут именно меши - начнут сажать. Никакие законы даже менять не надо.",
				"added": 1520943878
			},
			{
				"comment_id": 9,
				"body": "> [zorg13](#comment_8_1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2): что это за закон, наказывающий за wifi? покрайней мере в РФ и снг вайфайная частота является открытой и гражданской, мосты на вафле и тд допускаются без всяких доп разрешений. хотспоты тоже \"пока\" можно создавать без лецензии и гемороя. Есть некие ограничения на мощность сигнала, но это точно не про бытовые роутеры и имеющееся на рынке антенны.\n\nБез разрешения на использование частот можно работать только внутри зданий/помещений или обособленных территорий. Если на \"общую улицу\" выходит - получай разрешение. Оно получается по упрощенке, но сам факт. Все экранируют домашний wifi чтобы во дворе не ловилось? Нет? ))\nПо мощности тоже вопросы есть. Положенные по закону жалкие 100 мВт в большинстве роутеров легко превышаются в настройках чтобы \"в туалет добивало\".\n\"Сажать\" - это я, конечно, нагнетаю, но административка...",
				"added": 1521020893
			},
			{
				"comment_id": 10,
				"body": "> [paps](#comment_3_141e9kefECcifpcxtoyviANQw4fJRfq4jh):  пиндосы грозились заблокировать нам корневой ДНС в Калифорнии\n\nГде это вы прочитали такое?",
				"added": 1521020963
			}
		],
		"1_1HV141A2vZRjYcjAhoGhnmsdD9mfHAAr5e": [
			{
				"comment_id": 6,
				"body": "> [n425r](#comment_1_1B57aRn1xzgutYNsePjHeqm94vdnrB34nj): Пока от старости не загнётся. А там новый царёк и новое говно.\n\nСтволовые клетки, нанороботы, лучшие китайские генетики и геронтологи. Долго ему еще загибаться. Впрочем, новое говно тоже не отменяется.",
				"added": 1520848330
			},
			{
				"comment_id": 7,
				"body": "> [jzt](#comment_26_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u): Зачем это здесь? И так всеь интернет политотой засрали...\n\nОйой, как же так у тебя не спросили-то сначала... Вот люди.",
				"added": 1520862214
			}
		],
		"2_1J97bEwqapAhZf6vaTevvthB5awi7Fi9vS": [
			{
				"comment_id": 11,
				"body": "СЕрверЫ.",
				"added": 1521915399
			}
		],
		"1_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": [
			{
				"comment_id": 12,
				"body": "Woop-woop! That's the sound of da police!",
				"added": 1523441120
			}
		],
		"5_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 13,
				"body": "https://telegramproxy.com/",
				"added": 1523985435
			}
		],
		"1_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": [
			{
				"comment_id": 14,
				"body": "> [strelok](#comment_4_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): И нахера оно ненужно? Любой пользователь zeronet вполне способен поднять это все и сам, без мокропись и тем более не на винде.\n\nСпасибо  что высказал свою точку зрения, лично мне очень важно ее знать (нет), но все немного проще. \nТебе не надо  - ты не качаешь. \nКому-то надо - кто-то скачал. Пусть лучше оно здесь будет и не пригодится, чем наоборот.\n\nВ любом случае, говорить сразу за всех довольно самоуверенно...",
				"added": 1524424171
			},
			{
				"comment_id": 15,
				"body": "Нет-нет, клиент оригинальный. Просто с заранее прописанными настройками прокси.\nТут \"изюминка\" скорее в специально под это дело сконфигурированном i2pd-роутере и в запуске всей связки одним кликом для ленивых/непонимающих.",
				"added": 1524469529
			},
			{
				"comment_id": 16,
				"body": "> [sangokas](#comment_16_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb): Вот если бы звонки шли через i2p как торрент, не выходя в клиарнет, было бы круто. А так, нах,?\n\nУ звонков и так е2е-шифрование. Зачем их еще и через i2p пропускать, и что в этом крутого?\n\nЕще раз: \n- сборка не для \"заворачивания всего телеграма\" в i2p (это и невозможно в существующем виде, и не нужно);\n- сборка для тех, кто хотел бы одним кликом обойти текущую блокировку без использования платных или бесплатных прокси-сервисов, используя только лишь i2p-outproxy (что, имхо, довольно изящно).",
				"added": 1524481858
			},
			{
				"comment_id": 18,
				"body": "> [deepstrelok](#comment_3_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Будет очень медленно. Выходных нод считай нет.\n\nВыходные ноды, конечно, есть, и работает быстрее чем ожидаешь. \nНе идеально. Но работает. \nИ это лучше чем когда вовсе НЕ работает.",
				"added": 1525253360
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 17,
				"body": "> [dd6587](#comment_1_1FMwgiSBx4y4nrpmACn8fvWYaGtyhPBRoY): Драсьте, я тоже русскоговорящий.А вообще тут как-то мало народу, печально это. Хотя это может быть даже хорошо, чем меньше народу знает про это место, тем медленнее про него узнают бляди из кремля.\n\nБляди из кремля уже всё прекрасно знают. Просто ЭТО не представляет для них никакого интереса СЕЙЧАС.",
				"added": 1524668996
			}
		],
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": [
			{
				"comment_id": 19,
				"body": "> [calmaquesse](#comment_4_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): А смысл? 86%, дорогие мои. 86%. \n\nЕрунда. Прекратите повторять эту идиотскую мантру. Их нет.",
				"added": 1525253668
			},
			{
				"comment_id": 20,
				"body": "> [calmaquesse](#comment_15_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Да? 77% на недавних выборах \"нарисовали\"? Ну 5% можно накинуть, ну 10, но не столько же.Если бы их не было, мы бы сейчас жили в другом обществе и других условиях, не находите?\n\nИз ПРИШЕДШИХ(!!!) голосовать. Явку натягивали как никогда.",
				"added": 1525266829
			},
			{
				"comment_id": 21,
				"body": "> [calmaquesse](#comment_27_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Но всё равно тотальное большинство поддерживает Путина.\n\nКонечно, нет. У тотального большинства фига в кармане.",
				"added": 1525267860
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 22,
				"body": "Зачем заполитотили годную тему?\n\n> [strellok](#comment_18_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): В соседнем треде я вот тоже спрашиваю, — если не Путин, то кот? В ответ слышу только мы люди мира, нам вождь не нужен.\n> В целом Путин — не худшее, что могло случиться с Россией, учитывая исторический контекст...\n\nВот на таких вот долбоебических утверждениях все и держится. \nВедь швабра всунута в жопу всего на 10 см, а могли бы и на 20 задвинуть. Спасибо большое. Ура...\n\nС другой стороны, очередной хороший \"тест на мудака\".",
				"added": 1525289202
			}
		],
		"1_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 23,
				"body": "В помощь:\n\"ЛСД — Мой трудный ребёнок\", Альберт Хофман\n\"ДМТ —  Молекула Духа\", Рик Страссман \nСтанислав Гроф - Всё\n\"PiHKAL\", Александр Шульгин \n\"TiHKAL\", Александр Шульгин",
				"added": 1530779676
			},
			{
				"comment_id": 25,
				"body": "Ну и Кастанеда, конечно (как-то я забыл старика). \nНо с пониманием того, что процентов 90 им написанного - художественный свист.",
				"added": 1531728402
			}
		],
		"2_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 24,
				"body": "Смотря что надо. Если общение и обмен файлами, то RetroShare (если не пугают интерфейсы из 2000-х...) \nЕсли именно эмуляция локалки, то хз что тут может быть п2п.",
				"added": 1531728136
			}
		],
		"2_1JBcoMArHbt3S8kMXG4YcR88q8HYfwb3x5": [
			{
				"comment_id": 26,
				"body": "FYI: РШара хороша только в двух случаях (и то с понятными оговорками). \nВы соединяетесь напрямую с реальными проверенными друзьями через клирнет, и понимаете что делаете.\nВы соединяетесь с кем попало, но через тор/i2p, и понимаете что делаете.\n\nВ случае клирнета с обменом с кем попало РШ штука непростая в плане безопасности.\n\nВаш Капитан.",
				"added": 1531728686
			}
		],
		"1_15GqdBvcxgrSodxpe5QUridX85E9hjmLAW": [
			{
				"comment_id": 27,
				"body": "Много таких сервисов. Вы бы поизучали рынок сначала...",
				"added": 1543260524
			}
		],
		"1_16xnUKegknnxfYJn3Lrj9pq62DHenkVDmQ": [
			{
				"comment_id": 28,
				"body": "\"Трекер\" вообще не проблема хоть на чем... проблема - КОНТЕНТ.\nЕго тут, как и во многих других \"альтерсетях\" нет от слова \"совсем\".",
				"added": 1543501214
			}
		],
		"2_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": [
			{
				"comment_id": 29,
				"body": "Хикканы кооперируются... теперь я видел все...",
				"added": 1544025561
			}
		],
		"1_16qgVeyTjMzd6NFZzT8xjWn6KT47hpXdVe": [
			{
				"comment_id": 30,
				"body": "Если вселенную ждет тепловая смерть, то 0net умрет от юзерфайлов на популярных зайтах. Попомните...",
				"added": 1544025751
			}
		]
	},
	"comment_vote": {
		"10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_1JcVE5ueqWZZyajzuQxNPCged5iHmPDCt3": 1,
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"31_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"7_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": 1,
		"1_1NeWTdnBvzZfX98RFr9CFardLk5C6V8fL5": 1,
		"26_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": 1,
		"5_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu": 1,
		"5_1JBcoMArHbt3S8kMXG4YcR88q8HYfwb3x5": 1,
		"1_1MQqqyhzHNpasgGk6wwQLc2QnSUsaocdRA": 1,
		"1_1Et3v4E6aSymbSuoM8X77jDLpWrrfV42qh": 1
	}
}