{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Dowbor: Um novo modo de produção?",
			"body": "Autor lança, em novo livro, hipótese ousada. Estaríamos vivendo transição do capitalismo para outro sistema — baseado não na indústria, mas no conhecimento. Ele pode suscitar um mundo muito mais democrático e igualitário quanto o oposto\n\n- Live com interpretação em Libras: https://siasky.net/AAAvduQ7eVIrIhERgxPlLAmLusQjNK-b5a9w29mr0SJ7eg\n\n#A versão digital do livro O Capitalismo se Desloca, de Ladislau Dowbor, publicado pela Editora Sesc, está disponível [aqui](https://ipfs.infura.io/ipfs/QmaG5ALLAAam2acU5aq3PjsXGAqXFyV6Ns9Z9tQ9qFPSGX).\n\nVivemos um tempo de sobressaltos, incertezas e esperanças (tênues, porém reais). Ao traçar um vasto panorama deste período – e ao enxergá-lo com a ousadia dos que não desistiram de transformar o mundo – O Capitalismo se Desloca, de [Ladislau Dowbor](http://lattes.cnpq.br/8932283826603150), é um roteiro indispensável a quem quer que situar-se sem a fleugma dos indiferentes. Portanto, assumindo posições.\n\nEm obra anterior, [A Era do Capital Improdutivo](https://ipfs.infura.io/ipfs/QmV4WuxzsQgS1rTsqKdXWJP3Lch7bhdYfEFdTi6NJQX8a2), o autor havia se debruçado sobre uma regressão central do sistema. Para acumular riquezas, já não é preciso produzir nada: basta ter recursos para aplicar no cassino financeiro global – que suga trabalho e recursos de toda a sociedade. Esta distorção cria uma “nova classe: o 0,1% que, apartado dos dramas do planeta despreza os serviços públicos, os direitos sociais e a preservação da natureza.\n\nNo novo livro, Dowbor vai além. Investiga o que está por trás da financeirização. Revela uma metamorfose mais ampla– capaz diz ele, de levar a um novo modo de produção. Assim como o feudalismo baseava-se na terra e o capitalismo na fábrica, o novo sistema terá como base o conhecimento. Um dos grandes méritos do trabalho que você tem em mãos é apresentar o conjunto de autores que têm refletido a respeito, e suas ideias: de Jeremy Rifkin a Joseph Siiglitz; de Shoshana Zuboff a David Harvey, Eric Toussaint e Zygmunt Bauman; de Alvin Tofler a Manuel Castells e Immanuel Wallerstein.\n\nDowbor dá um passo a mais. Ele demonstra que o novo sistema – que chama, provisoriamente, de “informacional” –, poderá tanto suscitar um mundo muito mais democrático, igualitário e capaz de rever as relações entre humanidade e natureza quanto seu oposto. Para onde caminhamos? Está presente, argumenta o livro, a ameaça distópica de uma lógica em que a liquidez é o valor maior e permite, a uma ínfima minoria, capturar a riqueza coletiva. Mas abriu-se, também, uma brecha para que a produção de riquezas baseie-se em redes de compartilhamento, apoiadas na lógica do conhecimento livre e no acesso de todos ao Comum; a serviços públicos (Saúde, Educação, Habitação e Transporte de excelência); a livros, trabalhos científicos, filmes, músicas, obras culturais de todo tipo. Em especial, há a possibilidade de uma nova democracia, que combine informação de profundidade para todos com processos de decisão distribuída, como os orçamentos participativos digitais.\n\nA obra de Ladislau instiga por mostrar que o futuro está em aberto. O declínio do capitalismo não assegura nada. Pode vir um sistema muito mais – ou menos – democrático, equânime e capaz de interagir com a natureza. Cabe a cada um posicionar-se. Nada melhor que fazê-lo com consciência do que está em jogo.\n\n- Fonte: https://outraspalavras.net/videos/dowbor-um-novo-modo-de-producao/",
			"added": 1599236897
		}
	],
	"topic_vote": {},
	"next_comment_id": 43,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "> [otp](#comment_59_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): Thomas Sankara: O líder visionário\n> \n> https://ipfs.infura.io/ipfs/QmZetuD6GmzsqPcSq1X2Lyr5iynKcGGbXtVR4szmztP2Jo\n> \n> O \"Che Guevara africano\", como é conhecido, liderou a revolução de 4 de agosto de 1983 no Burkina Faso. Os ideais de Thomas Sankara, assassinado em outubro de 1987, continuam ainda hoje a orientar muitos africanos.\n\n#...E Naquele Dia Mataram a Felicidade\n- https://siasky.net/CAAitRVcH9iW9xMcKlVmoARqKRk80_wvk4TXMffb7EZHGg\n\nDocumentário sobre a vida de [Thomas Sankara](https://everipedia.org/wiki/lang_en/Thomas_Sankara), líder revolucionário de [Burquina Faso](https://everipedia.org/wiki/lang_en/Burkina_Faso).",
				"added": 1597174706
			},
			{
				"comment_id": 34,
				"body": "#Crise do socialismo e ofensiva neoliberal - José Paulo Netto\n- https://ipfs.infura.io/ipfs/QmSWLtEDB2n34d95fqqHAFehAzwFqTALK6hd9q7JppUtXT\n\nSocialismo e neoliberalismo são, sem dúvida, duas das maiores questões da nossa época. Neste volume, os temas são tratados sob uma perspectiva fortemente crítica. A crise do socialismo é abordada não como signo do 'fim da história', mas como esgotamento de um padrão da transição social que se revelou incapaz de realizar a dupla socialização que compete ao período pós-revolucionário: a socialização do poder político e a socialização da economia. Já a ofensiva neoliberal é enfocada como expressão da incompatibilidade entre o capitalismo contemporâneo e as instituições democráticas. Uma tese fundamental articula os dois ensaios deste livro: enquanto a sociedade estiver subordinada ao capital, a história continuará mobilizada pelas lutas dos trabalhadores na direção de uma ordem societária sem exploração, sem opressão e sem alienações.",
				"added": 1599238494
			},
			{
				"comment_id": 35,
				"body": "#Neoliberalismo como destruição criativa - David Harvey\n- https://ipfs.infura.io/ipfs/QmXbCNqwjVWETjqKo6qAq57qjQst2haBUw5wYzs96VsDU1\n\nO neoliberalismo atingiu o mundo como uma violenta maré de reformas institucionais e ajustamento discursivo, impondo muita destruição, não somente para as estruturas e poderes institucionais existentes, mas também para a estrutura da força de trabalho, relações sociais, políticas de bem-estar social, arranjos tecnológicos, modos de vida, pertencimento à terra, hábitos afetivos, modos de pensar e outros mais. Para voltar a retórica neoliberal contra si mesma, deveríamos nos perguntar: a que interesses particulares serve o Estado quando adota uma postura neoliberal e de que modo esses interesses particulares utilizaram-se do neoliberalismo para beneficiar a si próprios, em vez de beneficiar a todos, como se proclama? O neoliberalismo gerou um leque de movimentos de oposição. Quanto mais claramente os movimentos oposicionistas reconheçam que o seu objetivo central deve ser enfrentar o poder de classe que foi tão efetivamente restaurado sob o neoliberalismo, tanto maior será a coesão entre eles.",
				"added": 1599238672
			},
			{
				"comment_id": 39,
				"body": "#COMUNISMO PARA INICIANTES | Indicações\n- https://siasky.net/AABk_mYoWZAWq54x-jQFwqOt5vieVChfosnGPPIrq9KUQw\n\n#Indicações de leitura pra se iniciar nos textos comunistas:\n- [ABCs do Socialismo - O Minhocário](https://web.archive.org/web/20200614231650/https://ominhocario.wordpress.com/os-abcs-do-socialismo/)\n\n- [Crítica do Programa de Gotha – Karl Marx](https://ipfs.infura.io/ipfs/QmTeeAacL67mnkTaJonxkccReLphvNwz5yoR1bXdH1Jkqs)\n\n- [Afinidades Revolucionárias - Olivier Besancenot & Michael Löwy](https://ipfs.infura.io/ipfs/QmQKhdfRZFZZYn4sXy5YFtoV3zkh747K7d2Z9Q3zojR5wY)\n\n- [17 contradições e o fim do capitalismo - David Harvey](https://gateway.pinata.cloud/ipfs/QmWoaar8AETk4UC5LaJQfpspfU93LDzG3dm5hPctknrkRA)\n\n- [Reforma ou Revolução - Rosa Luxemburgo](https://web.archive.org/web/20191031215819/https://www.marxists.org/portugues/luxemburgo/1900/ref_rev/index.htm)\n\n- [Selected Writings Of Alexandra Kollontai](https://ipfs.infura.io/ipfs/QmYW8JHyDrBDiMxKe3wkuVPxhSEfMRsdbFaw6Hsb47ogeu)",
				"added": 1599338257
			},
			{
				"comment_id": 40,
				"body": "#Como ser anticapitalista no século XXI? - Erik Olin Wright\n- https://ipfs.infura.io/ipfs/QmXejCcDhRMk4R9HArCbqFQcpE9UAduk15ddwW5SLpTi9B\n\nWright norteia sua crítica ao capitalismo pelos conceitos de igualdade e justiça; democracia e liberdade; comunidade e solidariedade. Esses conceitos permitem a conexão entre noções abstratas em sua sociologia e sua experiência comunitária, com leitores, pesquisadores, estudantes e militantes. Não perde de vista a crítica da exploração e do poder econômico, além de destacar a destruição ambiental associada ao funcionamento do capitalismo.Como ser anticapitalista no século XXI? é um livro com forte ênfase no ativismo e na militância, pouco afeito a academicismos e voltado para os problemas reais da construção de uma alternativa anticapitalista hoje. Nele, o anticapitalismo é possível como uma defesa moral contra as injustiças e como uma instância prática e alternativa para um maior desabrochar de talentos humanos.Nos primeiros capítulos, Wright elabora um diagnóstico crítico do capitalismo para atender à proposta e ao título do livro; nos demais, ele apresenta propostas sobre o experimento que ele entende serem socialistas em nichos do sistema capitalista dominante. Com otimismo e clareza analítica, apresenta a viabilidade de arranjos institucionais alternativos. Baseado na compreensão híbrida dos modos de organizar a economia e a vida social, inova na conceituação e crítica da transformação social.A edição brasileira traz um prefácio de João Alexandre Peschanski, sociólogo que trabalhou com Wright no Departamento de Sociologia da Universidade de Wisconsin-Madison. Também completa a obra um posfácio escrito pelo eminente sociólogo Michael Burawoy, grande amigo de Wright, que rememora a biografia e as valiosas contribuições do autor do livro.Neste Como ser anticapitalista no século XXI?, um dos mais importantes pensadores das teorias sociais do mundo contemporâneo convida o leitor a transpor os caminhos pedregosos e, às vezes, proibitivos de obras desse teor, num texto fluído que surpreende por seu didatismo analítico e seu otimismo audaz.",
				"added": 1599339457
			},
			{
				"comment_id": 42,
				"body": "#KIM KATAGUIRI | Amar o capitalismo interessa mais\n- https://siasky.net/AADu039tZZjccTeOckccmoFwxJJ9NJFiwt3MNkWBoZq4YA\n\n\"Reagimos e comentamos ao [vídeo](https://siasky.net/AADSFy050QqGZpyqL_nrXj0fNOWZYBgEnc-6_trr0-uksA) de [Kim Kataguiri](https://pt.wikipedia.org/wiki/Kim_Kataguiri) do [MBL](https://mbl.org.br/) em que ele explica que devemos amar o capitalismo, afinal, tudo que é produzido na sociedade capitalista é produzido na sociedade capitalista. Logo, quem vive no capitalismo e não gosta do capitalismo é um hipócrita.\"",
				"added": 1599342956
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#...E Naquele Dia Mataram a Felicidade\n- https://siasky.net/CAAitRVcH9iW9xMcKlVmoARqKRk80_wvk4TXMffb7EZHGg\n\nDocumentário sobre a vida de [Thomas Sankara](https://everipedia.org/wiki/lang_en/Thomas_Sankara), líder revolucionário de [Burquina Faso](https://everipedia.org/wiki/lang_en/Burkina_Faso).",
				"added": 1597174738
			},
			{
				"comment_id": 7,
				"body": "#Muito Além do Cidadão Kane\n- https://libreflix.org/i/muito-alem-do-cidadao-kane\n- https://siasky.net/CACA8nkMJ77TNmgn6pQyre_oMQb7LW6Uj9C-12GhK5jqlw\n\n[Beyond Citizen Kane](https://everipedia.org/wiki/lang_en/Beyond_Citizen_Kane) (Muito Além do Cidadão Kane, no Brasil) é um documentário televisivo britânico de Simon Hartog exibido em 1993 pelo Channel 4, emissora pública do Reino Unido. O documentário mostra as relações entre a mídia e o poder do Brasil, focando na análise da figura de Roberto Marinho.",
				"added": 1597352756
			},
			{
				"comment_id": 10,
				"body": "#COM VANDALISMO - documentário completo\n- https://siasky.net/AAAxNodKcwGfs62z5OdJM-nSigmolL4WaoIMKK4P07OXCQ\n\nSinope: \"SEM VANDALISMO!\" repetiam gritando parte dos manifestantes que ocuparam as ruas de Fortaleza. Mas na [multidão das manifestações, que explodiram no Brasil em junho de 2013](https://web.archive.org/web/20200630204353/https://teseonze.com.br/?p=398), outros grupos empregaram métodos mais diretos. Tachados de \"vândalos\", foram criminalizados por parte da grande mídia, antes mesmo de serem ouvidos. Este documentário vai à \"linha de frente\" para registrar os confrontos e entrevistar os manifestantes para mostrar as motivações dos atos de desobediência civil.",
				"added": 1597354742
			},
			{
				"comment_id": 14,
				"body": "#Valhalla: A Lenda de Thor (2019)\n- https://gateway.pinata.cloud/ipfs/QmQ2rajuMnzyYzHeBJkGEDabfuQp5aVJJ673orPU1mgkXR\n\nAs crianças [Vikings](https://everipedia.org/wiki/lang_en/vikings) Røskva e Tjalfe embarcam em uma viagem de aventura de [Midgard](https://everipedia.org/wiki/lang_en/Midgard) a [Valhalla](https://everipedia.org/wiki/lang_en/Valhalla) com os deuses [Thor](https://en.wikipedia.org/wiki/Thor) e [Loki](https://en.wikipedia.org/wiki/Loki). A vida em Valhalla, no entanto, acaba por ser ameaçada pelo temido lobo [Fenrir](https://everipedia.org/wiki/lang_en/Fenrir) e pelos arqui-inimigos bárbaros do deus, o [Jotnar](https://everipedia.org/wiki/lang_en/J%C3%B6tunn). Lado a lado com os deuses, os dois filhos devem lutar para salvar Valhalla do fim do mundo – [Ragnarok](https://pt.wikipedia.org/wiki/Ragnar%C3%B6k).",
				"added": 1597375917
			},
			{
				"comment_id": 36,
				"body": "#Fenômeno (1996)\n- https://siasky.net/AADh212-jgbFPb0pGnG-EgeW8XAMkY6O5cv0yiQbBXiQSg\n\nNo dia do seu 37º aniversário um mecânico (John Travolta) vê uma luz muito intensa e sente um impacto que o leva ao chão, fazendo com que ele imediatamente se torne uma pessoa extraordinariamente inteligente. No início ele não descobre este seu novo dom, mas o fato de não mais dormir, ler alguns livros por dia, prever um terremoto, aprender português em vinte minutos, decifrar códigos militares, entre outras coisas, chamam a atenção de muita gente, inclusive do governo, que deseja utilizar esta inteligência no Serviço Secreto e não em benefício da comunidade, que é o sonho dele.\n\n#Fenômeno 2 (2003)\n- https://siasky.net/AACQnZNnbr8IduzRmFaUtGSA8PLzl46xBgBJppxk7qP67Q\n\n“O Fenômeno 2” conta-nos a história de um homem vulgar, George Malley (Christopher Shyer), que vê uma estranha luz a brilhar no céu no dia do seu aniversário e acorda no dia seguinte com um QI muito mais elevado e corpo com superpoderes. George deseja colocar os seus novos dons ao serviço de boas causas, para a mãe, Nora (Jill Clayburgh) e a sua pequena cidade. Mas quando a notícia se espalha, no entanto, ele passa a ser tratado como um anormal e um rebelde. O governo quer usar o talento de George com outros fins, mas ele teme que seja usado apenas como uma cobaia.",
				"added": 1599335405
			}
		],
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 3,
				"body": "O [limite de Bremermann](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Bremermann's_limit.html), em homenagem a Hans-Joachim Bremermann, é a velocidade computacional máxima de um sistema autocontido no universo material. É derivado da equivalência massa-energia de Einstein e do princípio da incerteza de Heisenberg, e é c^2/h ≈ 1,36 × 10^50 bits por segundo por quilograma. Esse valor é importante ao projetar algoritmos criptográficos, pois pode ser usado para determinar o tamanho mínimo das chaves de criptografia ou valores de hash necessários para criar um algoritmo que nunca poderia ser quebrado por uma busca de força bruta.\n\n- https://everipedia.org/wiki/lang_en/Bremermann%2527s_limit",
				"added": 1597175450
			},
			{
				"comment_id": 8,
				"body": "#Como criptografar arquivos com [GnuPG](https://www.gnupg.org/index.html) no Linux\nhttps://siasky.net/AABZYLpEp88BLbpnRUktIWqMdRw6z1R-_4WFIJ9UhshxzQ",
				"added": 1597352836
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#Axiomas de Wightman\n- https://everipedia.org/wiki/lang_en/Wightman_axioms\n\nEm física, os [Axiomas de Wightman](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Wightman_axioms.html) foram uma tentativa de obter uma formulação matemática rigorosa da teoria quântica de campos.",
				"added": 1597175591
			},
			{
				"comment_id": 5,
				"body": "#Uma estratégia euclidiana para o estudo do [efeito Unruh](https://everipedia.org/wiki/lang_en/Unruh_effect)\n- https://ipfs.infura.io/ipfs/QmcnduHECmQUjVwwjKBBv2xTeMMbnWGXvJJsoVw3ZDb8hd\n\n\"Neste trabalho nós propomos uma estratégia Euclidiana para entender o efeito Unruh. Com este objetivo, nós inicialmente o estudamos para campos livres escalares sem massa, numa forma que é normalmente apresentada aos físicos e que é mais próxima ao trabalho original de Unruh I321| . Logo em seguida, deduzimos o efeito de um ponto de vista algébrico. Com este objetivo, estudamos as propriedades e as definições de estados KMS para compreender como um estado de equilíbrio é descrito na abordagem algébrica. Apresentamos os axiomas de Wightman para campos escalares assim como os de Osterwalder-Schrader. Usamos, então, o Teorema de Bisognano-Wichmann para estes campos e concluímos, baseados no trabalho de Sewell [27], que um observador uniformemente acelerado vê o estado de vácuo dos observadores inerciais como um estado KMS, e portanto, como um estado de equilíbrio. Novamente, concluímos a existência do efeito Unruh. Finalmente estudamos algumas relações entre probabilidade e análise funcional. Este estudo é fundamental para o entendimento do trabalho de Klein e Landau [15] e de Gérard e Jakel [7]. Estes trabalhos afirmam que existe uma relação biunívoca entre certos estados KMS e certos processos estocásticos (Klein e Landau) e uma relação entre certos processos estocásticos e espaços de trajetórias generalizados (Gérard e Jakel). Usando estes trabalhos e as funções de Schwinger para campos escalares, deduzimos o efeito Unruh de uma nova maneira. Acreditamos que este trabalho mostra um ponto de vista interessante do efeito Unruh e ilustra o uso do formalismo Euclidiano em teorias quânticas dos campos. Mesmo que algumas demonstrações para uma prova completa do efeito, usando técnicas Euclidianas, não são obtidas, devido às dificuldades técnicas encontradas, acreditamos que o material apresentado neste trabalho fornece, no mínimo, uma boa estratégia para a compreensão completa deste fenômeno físico. Além disto, as técnicas que são mostradas podem ser usadas em diversos problemas, como a construção de campos interagentes a uma temperatura finita, que permanecem atuais e promissores.\"",
				"added": 1597175844
			},
			{
				"comment_id": 19,
				"body": "#Físicos lançam dúvida sobre existência dos neutrinos estéreis\n\nNão é todo dia que se vê um grupo de cientistas questionando suas próprias teorias - menos ainda quando eles estão envolvidos em projetos de milhões de dólares para tentar comprovar essas teorias.\n\nE isso não é de hoje. Max Planck, o homem que tirou Einstein de um emprego de funcionário público e o levou para a universidade, costumava dizer que não é possível convencer opositores de uma nova teoria: Uma nova teoria só triunfa, dizia Planck, quando esses opositores finalmente morrem e cresce uma nova geração acostumada com a nova teoria.\n\nMas a equipe de três grandes projetos internacionais - Experimento Reator de Neutrinos Daya Bay, MINOS+ (Injetor Principal para Busca da Oscilação de Neutrinos) e Experimento Bugey-3 - estão derrubando essa tradição.\n\nEm um artigo publicado na principal revista de física do mundo, a Physical Review Letters, a equipe está levantando dúvidas sobre a existência de uma partícula subatômica longamente teorizada, mas que não apareceu em nenhum dos experimentos.\n\n#Neutrino estéril\n\nEssa partícula é conhecida como \"[neutrino estéril](https://everipedia.org/wiki/lang_en/Sterile_neutrino)\", um hipotético quarto \"sabor\" de neutrino que se juntaria aos neutrinos do múon, do tau e do elétron como partículas elementares que compõem o universo conhecido.\n\nO esforço parecia valer a pena, já que a verificação experimental da existência de um quarto tipo de neutrino poderia redefinir a compreensão das partículas elementares e suas interações, sacudindo o que é conhecido como Modelo Padrão da física.\n\nOcorre que o Modelo Padrão não está completo: além de não se conectar à Relatividade de Einstein, os físicos já observaram várias anomalias em experimentos para as quais eles não têm explicações.\n\n\"Nossos resultados são incompatíveis com a interpretação das anomalias [como responsabilidade] dos neutrinos estéreis. Portanto, esses experimentos eliminam a possibilidade - a possibilidade principal - de que somente as oscilações de neutrinos estéreis expliquem essas anomalias,\" disse o professor Alexandre Sousa, da Universidade de Cincinnati, nos EUA, e membro das colaborações Daya Bay e MINOS+\n\n\"Nós aparentemente não vimos nenhuma evidência deles,\" completou seu colega Adam Aurisano.\n\n#Neutrinos\n\nOs [neutrinos](https://everipedia.org/wiki/lang_en/Neutrino) são minúsculos, tão minúsculos que não podem ser divididos em algo menor. Eles são tão pequenos que passam por praticamente tudo - nosso corpo, montanhas e até hipotéticos cubos de chumbo com um ano-luz de aresta - e fazem isso aos trilhões a cada segundo, virtualmente na velocidade da luz.\n\nOs neutrinos são criados pelas reações de fusão nuclear que alimentam as estrelas, pelos decaimentos radioativos em reatores nucleares ou no núcleo da Terra e em laboratórios de aceleradores de partículas, entre outras fontes.\n\nE, à medida que viajam, costumam fazer transições de um tipo (tau, elétron, múon) para outro e vice-versa.\n\nMas os físicos teóricos sugeriram que poderia haver um quarto neutrino que interage apenas com a gravidade, tornando-o muito mais difícil de detectar do que os outros três sabores, que também interagem com a matéria por meio da força nuclear fraca.\n\n\"Todos nós ficaríamos absolutamente emocionados em encontrar evidências dos neutrinos estéreis, mas os dados que coletamos até agora não apoiam nenhum tipo de oscilação de neutrino estéril,\" sentenciou o professor Pedro Ricoux, da Universidade da Califórnia em Irvine, também envolvido nos experimentos.\n\n#Artigo: [Improved Constraints on Sterile Neutrino Mixing from Disappearance Searches in the MINOS, MINOS+, Daya Bay, and Bugey-3 Experiments](https://ipfs.infura.io/ipfs/QmWm54JL2x3zovKC27SZBf1uRSRk3jZ8j4v7cjQ2mxSycx)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=fisicos-lancam-duvida-sobre-existencia-neutrinos-estereis&id=010130200814",
				"added": 1599145301
			},
			{
				"comment_id": 20,
				"body": "#Astrônomos agora dizem que buracos negros expulsam mais matéria que engolem\n\nA ciência dos buracos negros parece cada dia mais confusa, com estudos publicados indo do tradicional \"aspirador de pó cósmico\", em que nada, nem mesmo a luz, consegue escapar da singularidade, e dos cinematográficos [buracos negros podem ser janelas para universos paralelos](https://web.archive.org/web/20191015052556/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=buracos-negros-janelas-universos-paralelos&id=010130151223), até os contestadores [buracos negros não existem](https://web.archive.org/web/20191015052339/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=buracos-negros-nao-existem-stephen-hawking&id=010130140129) e versões mais recentes, como [buracos negros podem ser hologramas](https://web.archive.org/web/20200821044729/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=buracos-negros-hologramas&id=010130200629).\n\nAstrofísicos brasileiros participaram agora de mais uma proposta que também contesta a visão mais difundida pelos cientistas sobre o que seriam esses aglomerados extremos de matéria: Segundo eles, os buracos negros podem expulsar mil vezes mais matéria do que capturam.\n\nO mecanismo que rege tanto a expulsão quanto a captura de matéria por um buraco negro é o \"disco de acreção\", constituído por uma grande quantidade de gás e poeira que espirala em torno do buraco negro, alcança velocidades extremamente elevadas, se aquece e emite luz e outras formas de radiação eletromagnética.\n\nUma parte do material em movimento orbital é puxada em direção ao centro, desaparecendo atrás do chamado \"horizonte de eventos\", a fronteira a partir da qual nem a matéria e nem a luz conseguem escapar. Mas outra parte, e muito maior, é empurrada para fora e para longe pela própria pressão da radiação emitida pelo disco, defendem Daniel May, do Instituto de Astronomia da USP, e seus colegas.\n\nOs cientistas acreditam que no centro de todas as galáxias existe um buraco negro supermassivo. Mas nem todas as galáxias têm ou tiveram discos de acreção. As que têm são chamadas de galáxias de núcleos ativos. O modelo tradicional distingue duas fases no material acumulado na região central das galáxias de núcleos ativos: uma parte formada por gás ionizado em alta velocidade, composta pelo material ejetado pelo núcleo, e outra formada por moléculas, com velocidade menor, que pode vir a alimentar o núcleo.\n\n\"Verificamos que a fase molecular, que parece ter uma dinâmica completamente diferente da fase ionizada, também faz parte [do fluxo de ejeção]. Isso significa que há muito mais matéria sendo soprada para longe do centro. E que o núcleo ativo tem um papel muito mais importante na estruturação da galáxia como um todo,\" explica Daniel.\n\n#Fluxo de ejeção do buraco negro\n\nOs exemplos de buracos negros ejetando mais matéria que engolindo foi identificado por Daniel a partir do estudo de duas galáxias de núcleos ativos: a NGC 1068, investigada por ele em 2017, e a NGC 4151, investigada em 2020 - a sigla NGC refere-se ao New General Catalogue of Nebulae and Clusters of Stars (Novo Catálogo Geral de Nebulosas e Aglomerados de Estrelas), estabelecido no final do século 19.\n\n\"Usando uma metodologia de tratamento de imagem muito meticulosa, identificamos o mesmo padrão em duas galáxias bastante diferentes. Hoje em dia, a maioria dos astrônomos está interessada em estudar amostras muito grandes de dados. Nosso trabalho seguiu o caminho oposto. Investigamos de forma quase artesanal as características individuais desses dois objetos.\n\n\"Nosso estudo sugere que, inicialmente, uma nuvem de gás molecular na região central da galáxia colapse e ative o seu núcleo, formando o disco de acreção. Os fótons emitidos pelo disco, que alcança um patamar de temperatura da ordem do milhão de graus, empurram a maior parte do gás para fora e para longe, enquanto uma parte menor é incorporada pelo próprio disco e, eventualmente, imerge no buraco negro.\n\nÀ medida que essa nuvem vai sendo soprada pelo disco, formam-se as duas fases distintas: a ionizada, devido à exposição ao disco; e a molecular, que fica à sombra da sua radiação. O que descobrimos foi que a parte molecular está totalmente vinculada à parte ionizada que compõe o [fluxo de ejeção]. Conseguimos relacionar as duas fases do gás, que antes eram concebidas como desconexas, e encaixar suas morfologias em um único cenário,\" resume o pesquisador.\n\n#Efeitos do buraco negro\n\nDaniel explica que o gás ionizado surge da fragmentação desse gás molecular. Enquanto se fragmenta, este vai sendo empurrado para fora, formando uma bolha quente em expansão, que atinge raios da ordem de 300 anos-luz. Para efeito de comparação, vale lembrar que esse raio é quase 70 vezes maior do que a distância da Terra a Próxima Centauri, a estrela que está mais perto do Sistema Solar.\n\n\"Quando observamos a região central dessas duas galáxias, enxergamos essa enorme bolha de perfil, delineada por suas paredes de moléculas. Vemos essas paredes se fragmentando e o gás ionizado sendo empurrado para fora. O disco de acreção aparece como um ponto extremamente brilhante. Mas toda a informação que nos chega dele cai dentro de um píxel, de modo que não temos resolução suficiente para diferenciar suas possíveis partes. O buraco negro é conhecido apenas por meio de seus efeitos,\" explica o pesquisador.\n\nDaniel ressalta que, no Universo antigo, havia muito mais gás disponível, de modo que o efeito de um processo como o descrito por ele era bem mais intenso. O que o pesquisador observou em galáxias relativamente próximas, como a NGC 1068 e a NGC 4151, é uma forma branda do que ocorreu em galáxias muito distantes, cujos núcleos ativos no passado remoto são detectados hoje na forma de quasares.\n\n#Artigo: [The nuclear architecture of NGC-4151: on the path toward a universal outflow mechanism in light of NGC 1068](https://ipfs.infura.io/ipfs/QmQhRBRkPtf1xZmDgXJc1Xys2rCxyqjGUhwuuesdenZvNa)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=astronomos-agora-dizem-buracos-negros-expulsam-mais-materia-engolem&id=010130200831",
				"added": 1599145790
			},
			{
				"comment_id": 21,
				"body": "#Novo paradoxo quântico revela contradições em nossa visão do Universo\n\nNós nos acostumamos com as explicações que a ciência nos dá sobre a natureza, frequentemente considerando-as como explicações definitivas.\n\nMas não seja enganado pelas aparências: Poucas das nossas teorias - se é que alguma delas - pode ser considerada \"definitiva\". Afinal, além de extremamente jovem, a ciência é um edifício em permanente construção, e nossa compreensão da natureza está constantemente sendo \"ajustada\" para dar conta dos novos saberes.\n\nKok-Wei Bong e colegas da Universidade Griffith, na Austrália, acabam de nos dar mais exemplo cabal dessa \"insustentável fluidez do saber\": Eles demonstraram que, quando se trata de certas teorias longamente aceitas sobre a natureza, \"alguma coisa tem que ceder\".\n\nA equipe de físicos descobriu um novo [paradoxo envolvendo a mecânica quântica](https://web.archive.org/web/20170913175559/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=menor-coisa-existe-universo&id=010130130726) que estabelece que, entre três \"crenças\", deveremos abrir mão de pelo menos uma delas porque, juntas, elas não se sustentam.\n\n#Pressupostos fundamentais sobre a natureza\n\nApesar de excepcionalmente eficaz para predizer o que observamos em objetos minúsculos, como átomos, a aplicação da teoria quântica em escalas muito maiores do que os átomos - em particular para os observadores que fazem as medições - levanta questões conceituais difíceis.\n\nQuem começa explicando a situação e o paradoxo que ela engendra é o professor Eric Cavalcanti, um dos descobridores do novo paradoxo.\n\n\"O paradoxo significa que, se a teoria quântica funcionar para descrever os observadores, os cientistas terão que desistir de uma de três suposições muito estimadas sobre o mundo.\n\n\"A primeira hipótese é que, quando é feita uma medição, o resultado observado é um evento real e único no mundo. Essa suposição exclui, por exemplo, a ideia de que o Universo possa se dividir, com [diferentes resultados sendo observados em diferentes universos paralelos](https://web.archive.org/web/20191117113737/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=quatro-maneiras-voce-observar-multiverso&id=010130141114).\n\n\"O segundo pressuposto é que os cenários experimentais podem ser escolhidos livremente, permitindo-nos [realizar testes aleatórios](https://web.archive.org/web/20180810081413/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=eventos-quanticos-independem-espaco-tempo&id=010130130201). E o terceiro pressuposto é que, uma vez que tal escolha é feita, [sua influência não pode se espalhar no Universo mais rápido do que a luz](https://web.archive.org/web/20170223113043/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=supere-velocidade-luz-voce-perdera-seus-dados&id=010150140605).\n\n\"Cada uma dessas suposições fundamentais parece inteiramente razoável e é amplamente aceita. No entanto, também é amplamente aceito que os experimentos quânticos podem ser escalonados para sistemas maiores, até mesmo ao nível de observadores. Mas nós demonstramos que uma dessas crenças amplamente aceitas deve estar errada! E abandonar qualquer uma delas tem consequências de longo alcance para nossa compreensão do mundo,\" disse Cavalcanti.\n\n#Paradoxo quântico-filosófico\n\nA equipe estabeleceu o paradoxo analisando um cenário com partículas quânticas entrelaçadas bem separadas, combinadas com um \"observador\" quântico - um sistema quântico que pode ser manipulado e medido de fora, mas que pode ele mesmo fazer medições em uma partícula.\n\nQuem explica o experimento é professora Nora Tischler.\n\n\"Com base nas três hipóteses fundamentais, nós determinamos matematicamente os limites de quais resultados experimentais são possíveis nesse cenário. Mas a teoria quântica, quando aplicada aos observadores, prevê resultados que violam esses limites. Na verdade, nós já fizemos um experimento de prova de conceito usando fótons entrelaçados (partículas de luz). E encontramos uma violação exatamente como a teoria quântica previu.\n\n\"Mas nosso 'observador' tinha um cérebro muito pequeno, por assim dizer. Ele tem apenas dois estados de memória, que são implementados como dois caminhos diferentes para um fóton. É por isso que o chamamos de experimento de prova de princípio, não de uma demonstração conclusiva de que um dos três pressupostos fundamentais em nosso paradoxo deve estar errado,\" ponderou Tischler.\n\n\"Para uma implementação mais definitiva do paradoxo, nosso experimento onírico [experimento mental] é aquele em que o observador quântico é um programa de inteligência artificial de nível humano rodando em um computador quântico gigantesco.\n\n\"Esse seria um teste bastante convincente para saber se a teoria quântica falha para os observadores ou se uma das três suposições fundamentais é falsa. Mas isso provavelmente está a décadas de distância [de poder ser realizado experimentalmente]\", acrescentou o professor Howard Wiseman.\n\n#Problemas filosóficos\n\nMas o que são algumas poucas décadas de espera para esclarecer questões que vão muito além de um problema estrito de mecânica quântica, alcançando debates feitos há milênios em nossa tradição cultural?\n\nAfinal, quem não se interessa em saber se existem mesmo universos paralelos, com outros \"nós\" seguindo histórias pessoais totalmente diferentes, e com novas histórias emergindo a cada vez que tomamos uma decisão? Ou se [nossa capacidade de influenciar a realidade](https://web.archive.org/web/20180927005519/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=efeito-observador-efeito-zeno-quantico&id=010165151103) é tamanha que podemos mudar as coisas por simplesmente observá-las, deixando o efeito borboleta no chinelo? Ou ainda, se nossas decisões se espalham pela realidade instantaneamente, como parece acontecer com as influências instantâneas compartilhadas pelas partículas ligadas pelo entrelaçamento quântico?\n\n\"Há muito se reconhece que os [computadores quânticos](https://everipedia.org/wiki/lang_en/Quantum_computing) irão revolucionar nossa capacidade de resolver problemas computacionais difíceis.\n\n\"O que não percebemos até começarmos esta pesquisa é que eles também podem ajudar a responder complicados problemas filosóficos - a natureza do mundo físico, o mundo mental e seu relacionamento,\" disse o professor Wiseman.\n\n#Artigo: [A strong no-go theorem on the Wigner’s friend paradox](https://ipfs.infura.io/ipfs/QmdzV58Hb78aFDx3aa7biKtQtpKoon6sKF5ySUgBvPmBty)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=novo-paradoxo-quantico-revela-contradicoes-nossa-visao-universo&id=010130200824",
				"added": 1599146493
			},
			{
				"comment_id": 38,
				"body": "#Física Conceitual - Paul G. Hewitt\n- https://siasky.net/AAA_q7xD2PB0Br__1CtLDO5U05LXbOIngqK1DAOnSvFGOA\n\nCom um texto atraente, bem humorado e repleto de ilustrações, Paul Hewitt torna o estudo da física interessante, compreensível e relevante, mesmo para quem não é da área. A estratégia pedagógica permanece a mesma das edições anteriores: conceitos primeiro, cálculos depois. Física Conceitual utiliza analogias, narrativas acessíveis, representações simples das relações matemáticas subjacentes e imagens da vida real para construir um sólido conhecimento conceitual dos princípios da física.",
				"added": 1599335916
			},
			{
				"comment_id": 41,
				"body": "#Sensor de diamante dirá se gravidade é quântica ou não\nUm grupo de físicos estava trabalhando em uma forma de descobrir se a gravidade é um fenômeno quântico ou não - se existe alguma coisa como um [gráviton](https://everipedia.org/wiki/lang_en/Graviton), uma \"partícula\" de gravidade, ou se a força da gravidade pode ser quantizada.\n\nAcontece que eles atiraram no que ninguém até agora conseguiu ver - as tais partículas de gravidade -, mas acertaram no que já conseguimos ver: as [ondas gravitacionais](https://everipedia.org/wiki/lang_en/Gravitational_wave).\n\nO resultado do trabalho é um projeto de um detector de ondas gravitacionais que promete substituir os observatórios quilométricos, como o LIGO e o VIRGO, por um aparelho que cabe em cima de uma mesa.\n\nAlém disso, este sensor será sensível a frequências mais baixas do que os detectores atuais e ainda será fácil apontá-lo para partes específicas do céu - os detectores atuais só \"enxergam\" um ponto fixo.\n\nNa verdade, o sensor será tão sensível que será possível usá-lo para o objetivo inicial dos físicos: Saber se a gravidade é quântica ou não.\n\n#Sensor de gravidade\n\nO coração do novo detector é a conhecida \"vacância de nitrogênio\", um defeito no diamante que já está sendo explorado como [sensor para monitorar condições extremas](https://web.archive.org/web/20200315150526/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=defeitos-diamante-viram-sensores-monitorar-materiais-sob-pressao&id=010165200116) e até mesmo com [qubit de computador quântico](https://web.archive.org/web/20180715013109/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=diamante-guarda-informacao-quantica-horas&id=010150180312).\n\nNo diamante, eventualmente um átomo de carbono é substituído por um átomo de nitrogênio. Esse nitrogênio introduz um espaço livre na banda de valência, que pode ser preenchido com um elétron extra. Quando esse elétron recebe energia, de um laser, por exemplo, ele pode absorver ou não a energia do fóton - se ele absorver, isso altera seu spin, um momento magnético que pode ser \"para cima\" ou \"para baixo\".\n\n\"Exatamente como o [gato de Schrodinger](https://en.wikipedia.org/wiki/Schr%C3%B6dinger%27s_cat), que está vivo e morto ao mesmo tempo, esse spin do elétron absorve e não absorve a energia do fóton, de modo que seu spin é para cima e para baixo. Este fenômeno é chamado de superposição quântica. Como o elétron é parte do diamante, o objeto inteiro - com uma massa de cerca de 10^-17 quilogramas, o que é enorme para fenômenos quânticos, está em superposição quântica,\" explica o professor Anupam Mazumdar, da Universidade de Groningen, na Alemanha.\n\nMas o que isso tem a ver com as ondas de gravidade, que são essencialmente contrações do espaço-tempo?\n\nQuem explica é o próprio professor Mazumdar: \"Temos um diamante que tem spin para cima e para baixo ao mesmo tempo. Aplicando um campo magnético, é possível separar os dois estados quânticos. Quando esses estados quânticos são reunidos novamente, desligando o campo magnético, eles criarão um padrão de interferência. A natureza dessa interferência depende da distância que os dois estados quânticos separados viajaram. E isso pode ser usado para medir ondas de gravidade. Essas ondas são contrações do espaço, de modo que sua passagem afeta a distância entre os dois estados separados e, portanto, o padrão de interferência.\"\n\n#Desafios tecnológicos\n\nNa verdade, quando construído e devidamente controlado, esse sensor atômico de diamante poderá fazer muito mais do que isso: Se essa superposição quântica, em escala mesoscópica, puder ser mantida por tempo suficiente, ela permitirá medir uma infinidade de coisas, incluindo ajudar os físicos a resolver seu problema original: descobrir se a gravidade é um fenômeno quântico ou não.\n\nO conceito é que, como o entrelaçamento é um fenômeno quântico, se dois objetos que interagem apenas por meio da gravidade apresentarem entrelaçamento, isso provará que a gravidade é um fenômeno quântico.\n\nAgora começa a parte difícil da empreitada, já que, para funcionar, esse sensor precisará estar o mais próximo possível do zero absoluto, para se livrar de qualquer interferência, e ainda estar dentro de um vácuo de 10^-15 Pascal.\n\n\"A tecnologia para construir esses sistemas pode levar algumas décadas para ser desenvolvida,\" reconhece Mazumdar. \"Já existe tecnologia para atingir alto vácuo ou baixa temperatura, mas precisamos da tecnologia para alcançar ambos ao mesmo tempo. Além disso, o campo magnético deve ser constante. Qualquer flutuação derrubaria a superposição quântica.\"\n\n#Artigo: [Mesoscopic interference for metric and curvature & gravitational wave detection](https://ipfs.infura.io/ipfs/QmUxji4R5KA6gWe8jA6FBjAurFNfxSqgdMKAWYwt2gA6oD)\n#Artigo: [Relative Acceleration Noise Mitigation for Entangling Masses via Quantum Gravity](https://ipfs.infura.io/ipfs/QmPYtin28Lw8roj1QcdJbPUkpatiUt7jYDtpuGyCbf3JAz)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=sensor-diamante-dira-se-gravidade-quantica-ou-nao&id=010130200904",
				"added": 1599341521
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 6,
				"body": "#O Que é Violência?\n- https://skydrain.net/AABBSOFIQTWV9wKwzjbfiiNCUUJkP1G3YgFKQIHXEllZUQ\n- https://swarm-gateways.net/bzz:/bcc297a96f0e6d21db9011cf7fb4a6590966dcecbff154b4da60b75aac4b195d/O_Que_é_Violência.mp4\n\nAs nossas sociedades são altamente dependentes da violência para funcionar. Enquanto os Estados irão tentar manter um monopólio da violência e constantemente buscar novas formas de legitimar o seu uso da força, as pessoas que lutam contra a dominação podem também usar a violência para confrontar os sistemas hierárquicos que as oprimem. Embora os debates sobre violência e táticas ressurjam toda vez que alguém decide revidar, a necessidade de ataques físicos ao poder não pode ser ignorada. Então, o que exatamente é violência, e como ela funciona no mundo?\n\n- Fonte: https://antimidia.noblogs.org/o-que-e-violencia/\n\n#O Fim da Polícia\n- https://skydrain.net/AAC6xf2H4lqGHImeg5LoO-YOuImCv7tVel-8HOj0urN5gQ\n- https://swarm-gateways.net/bzz:/9a08b123bd21302c447467abb06cf61af72f8c9682b361d51994d0299da13840/O_Fim_da_Polícia.mp4\n\nOs levantes pela [morte de George Floyd](https://en.wikipedia.org/wiki/Killing_of_George_Floyd) nos Estados Unidos, em 2020, trouxeram à tona o debate pela abolição da polícia. Mas é possível viver sem polícia? Afinal para que foi criada a polícia e qual papel ela cumpre no mundo de hoje?\n\n- Fonte: https://antimidia.noblogs.org/o-fim-da-policia/",
				"added": 1597267181
			},
			{
				"comment_id": 11,
				"body": "#COM VANDALISMO - documentário completo\n- https://siasky.net/AAAxNodKcwGfs62z5OdJM-nSigmolL4WaoIMKK4P07OXCQ\n\nSinope: \"SEM VANDALISMO!\" repetiam gritando parte dos manifestantes que ocuparam as ruas de Fortaleza. Mas na [multidão das manifestações, que explodiram no Brasil em junho de 2013](https://web.archive.org/web/20200630204353/https://teseonze.com.br/?p=398), outros grupos empregaram métodos mais diretos. Tachados de \"vândalos\", foram criminalizados por parte da grande mídia, antes mesmo de serem ouvidos. Este documentário vai à \"linha de frente\" para registrar os confrontos e entrevistar os manifestantes para mostrar as motivações dos atos de desobediência civil.",
				"added": 1597354759
			},
			{
				"comment_id": 27,
				"body": "#Você é Anarquista? A resposta pode surpreender você! - David Graeber\nhttps://ipfs.infura.io/ipfs/QmWUoVzQNCP7DCLyNYP16UCkKncAEvMmnEUerLn3CuPWue",
				"added": 1599163438
			},
			{
				"comment_id": 28,
				"body": "#Biblioteca Anarquista Lusófona | Biblioteca Anarquista\n- https://bibliotecaanarquista.org/\n\nA Biblioteca Anarquista Lusófona é um local de armazenamento de textos anarquistas e textos de interesse para anarquistas. Baseia-se no projeto [The Anarchist Library](https://theanarchistlibrary.org/), tendo a mesma estrutura do site em inglês.",
				"added": 1599163939
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 9,
				"body": "#A Lagoa Azul - [Henry De Vere Stacpoole](https://everipedia.org/wiki/lang_en/Henry_De_Vere_Stacpoole)\n- https://ipfs.infura.io/ipfs/QmQUCSYXvQa891oo2GzmYWe5by2khVX6DzUG9qRPPCzT9p\n\nDepois de um naufrágio, duas crianças aprendem a sobreviver numa ilha deserta nos mares do Sul. Este é o argumento base de um dos romances mais vendidos da literatura inglesa. Desde que apareceu em 1908, esta obra tem tido edições sucessivas no Reino Unido e Estados Unidos.\nA adaptação ao cinema, no filme que lançou [Brooke Shields](https://everipedia.org/wiki/lang_en/Brooke_Shields), celebrizou ainda mais o livro. Uma obra que é um excelente romance de viagens e aventuras transforma-se num clássico.",
				"added": 1597353395
			},
			{
				"comment_id": 12,
				"body": "#A Finança Digitalizada: Capitalismo Financeiro e Revolução Informacional\n- https://siasky.net/AAAFnjHyN90wcsZtDb7WzU558eZjbKBUV9eLH6Qk0cIR9w\n- https://ipfs.infura.io/ipfs/QmcH1jv9rH8xebkEzZQUW9JwxWPPPVu1usQPsYpRDneCsM\n\nEdemilson Paraná oferece ao leitor um rico panorama das transformações impostas ao mundo pela globalização financeira. Esse setor, líder na atual ‘Era do Neoliberalismo’, controla a alocação de recursos a nível intertemporal (as relações entre consumo e investimento), intersetorial (a composição do produto e do emprego) e internacional (os padrões de especialização entre os países). A [finança digitalizada](https://web.archive.org/web/20200430044322/http://www.ihu.unisinos.br/159-noticias/entrevistas/559390-financa-digitalizada-interacao-entre-tecnologia-e-economia-esta-reestruturando-o-sistema-financeiro-entrevista-especial-com-edemilson-parana) é produto do avanço da técnica aplicada à expansão desregrada da lógica financeira: a busca de lucros ínfimos em milhões de transações durando milissegundos, por vezes revertidas quase instantaneamente, sem nenhum impacto real além do enriquecimento de poucos.",
				"added": 1597358074
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 13,
				"body": "#Lista de mitologias\n\nEsta é uma lista de mitologias do mundo, por cultura e região.\n\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/List_of_mythologies.html",
				"added": 1597360813
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 15,
				"body": "Mas agora assim diz o Senhor, aquele que o criou, ó Jacó, aquele que o formou, ó Israel: \"Não tema, pois eu o resgatei; eu o chamei pelo nome; você é meu.\nQuando você atravessar as águas, eu estarei com você; e, quando você atravessar os rios, eles não o encobrirão. Quando você andar através do fogo, você não se queimará; as chamas não o deixarão em brasas.\nPois eu sou o Senhor, o seu Deus, o Santo de Israel, o seu Salvador; dou o Egito como resgate por você, a Etiópia e Sebá em troca de você.\nVisto que você é precioso e honrado à minha vista, e porque eu o amo, darei homens em seu lugar, e nações em troca de sua vida.\nNão tenha medo, pois eu estou com você, do oriente trarei seus filhos e do ocidente ajuntarei você.\nDirei ao norte ‘Entregue-os! ’ e ao sul ‘Não os retenha’. De longe tragam os meus filhos, e dos confins da terra as minhas filhas;\ntodo o que é chamado pelo meu nome, a quem criei para a minha glória, a quem formei e fiz\".\nTraga o povo que tem olhos, mas é cego, que tem ouvidos, mas é surdo.\nTodas as nações se reúnem, e os povos se ajuntam. Qual deles predisse isto e anunciou as coisas passadas? Que eles façam entrar suas testemunhas, para provarem que estavam certos, para que outros ouçam e digam: \"É verdade\".\n\"Vocês são minhas testemunhas\", declara o Senhor, \"e meu servo, a quem escolhi, para que vocês saibam e creiam em mim e entendam que eu sou Deus. Antes de mim nenhum deus se formou, nem haverá algum depois de mim.\nEu, eu mesmo, sou o Senhor, e além de mim não há salvador algum.\nEu revelei, salvei e anunciei; eu, e não um deus estrangeiro entre vocês. Vocês são testemunhas de que eu sou Deus\", declara o Senhor.\n\" Desde os dias mais antigos eu o sou. Não há quem possa livrar alguém de minha mão. Agindo eu quem pode desfazer? \"\nAssim diz o Senhor, o seu Redentor, o Santo de Israel: \"Por amor de vocês mandarei inimigos para a Babilônia e farei todos os babilônios descerem como fugitivos, nos navios de que se orgulhavam.\nEu sou o Senhor, o Santo de vocês, o Criador de Israel e o seu Rei\".\nAssim diz o Senhor, aquele que fez um caminho pelo mar, uma vereda pelas águas violentas,\nque fez saírem juntos os carros e cavalos, o exército e seus reforços, e eles jazem ali, para nunca mais se levantarem, exterminados, apagados como um pavio:\n\"Esqueçam o que se foi; não vivam no passado.\nVejam, estou fazendo uma coisa nova! Ela já está surgindo! Vocês não o percebem? Até no deserto vou abrir um caminho e riachos no ermo.\nOs animais do campo me honrarão, os chacais e as corujas, porque fornecerei água no deserto e riachos no ermo, para dar de beber a meu povo, meu escolhido,\nao povo que formei para mim mesmo a fim de que proclamasse o meu louvor\".\n\"Contudo você não me invocou, ó Jacó, embora você tenha ficado exausto por minha causa, ó Israel.\nNão foi para mim que você trouxe ovelhas para holocaustos, nem me honrou com seus sacrifícios. Não o sobrecarreguei com ofertas de cereal nem o deixei exausto com exigências de incenso.\nVocê não me comprou qualquer cana aromática, nem me encheu com a gordura de seus sacrifícios. Mas você me sobrecarregou com os seus pecados e me deixou exausto com suas ofensas. \"\n\"Sou eu, eu mesmo, aquele que apaga suas transgressões, por amor de mim, e que não se lembra mais de seus pecados.\nRelembre o passado para mim, vamos discutir a sua causa; apresente o caso para provar sua inocência.\nSeu primeiro pai pecou; seus porta-vozes se rebelaram contra mim.\nPor isso envergonharei os líderes do templo, e entregarei Jacó à destruição e Israel à zombaria.\n\n- Isaías 43:1-28",
				"added": 1597377405
			},
			{
				"comment_id": 16,
				"body": "De onde vêm as guerras e contendas que há entre vocês? Não vêm das paixões que guerreiam dentro de vocês?\nVocês cobiçam coisas, e não as têm; matam e invejam, mas não conseguem obter o que desejam. Vocês vivem a lutar e a fazer guerras. Não têm, porque não pedem.\nQuando pedem, não recebem, pois pedem por motivos errados, para gastar em seus prazeres.\nAdúlteros, vocês não sabem que a amizade com o mundo é inimizade com Deus? Quem quer ser amigo do mundo faz-se inimigo de Deus.\nOu vocês acham que é sem razão que a Escritura diz que o Espírito que ele fez habitar em nós tem fortes ciúmes?\nMas ele nos concede graça maior. Por isso diz a Escritura: \"Deus se opõe aos orgulhosos, mas concede graça aos humildes\".\nPortanto, submetam-se a Deus. Resistam ao diabo, e ele fugirá de vocês.\nAproximem-se de Deus, e ele se aproximará de vocês! Pecadores, limpem as mãos, e vocês, que têm a mente dividida, purifiquem o coração.\nEntristeçam-se, lamentem e chorem. Troquem o riso por lamento e a alegria por tristeza.\nHumilhem-se diante do Senhor, e ele os exaltará.\nIrmãos, não falem mal uns dos outros. Quem fala contra o seu irmão ou julga o seu irmão, fala contra a Lei e a julga. Quando você julga a Lei, não a está cumprindo, mas está se colocando como juiz.\nHá apenas um Legislador e Juiz, aquele que pode salvar e destruir. Mas quem é você para julgar o seu próximo?\nOuçam agora, vocês que dizem: \"Hoje ou amanhã iremos para esta ou aquela cidade, passaremos um ano ali, faremos negócios e ganharemos dinheiro\".\nVocês nem sabem o que lhes acontecerá amanhã! Que é a sua vida? Vocês são como a neblina que aparece por um pouco de tempo e depois se dissipa.\nAo invés disso, deveriam dizer: \"Se o Senhor quiser, viveremos e faremos isto ou aquilo\".\nAgora, porém, vocês se vangloriam das suas pretensões. Toda vanglória como essa é maligna.\nPensem nisto, pois: Quem sabe que deve fazer o bem e não o faz, comete pecado.\n\n- Tiago 4:1-17",
				"added": 1597378091
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 17,
				"body": "#Seminário de Coisas Legais: Hipótese de Riemann\n- https://gateway.pinata.cloud/ipfs/QmZ59AnTqJnk5arcJJt6pt3zBVefs1EpWEnjwiWeJYvHrs\n\nEm matemática, a [hipótese de Riemann](https://everipedia.org/wiki/lang_en/Riemann_hypothesis) é uma conjectura de que a [função zeta de Riemann](https://everipedia.org/wiki/lang_en/Riemann_zeta_function) tem seus [zeros](https://everipedia.org/wiki/lang_en/Zero_of_a_function) apenas nos inteiros pares negativos e números complexos com parte real 1/2. Muitos consideram ser o problema não resolvido mais importante em matemática pura ([Bombieri 2000](https://web.archive.org/web/20200812132309/http://www.claymath.org/sites/default/files/official_problem_description.pdf)). É de grande interesse na teoria dos números porque implica em resultados sobre a distribuição de [números primos](https://everipedia.org/wiki/lang_en/Prime_number). Foi proposto por [Bernhard Riemann](https://everipedia.org/wiki/lang_en/Bernhard_Riemann) ([1859](https://web.archive.org/web/20190411005811/http://www.maths.tcd.ie/pub/HistMath/People/Riemann/Zeta/)), de quem recebeu o nome.\n\n#A Conjectura BSD: mistérios de um milhão de dólares\n- https://gateway.pinata.cloud/ipfs/QmNjbeqhGd51Q9mcHqppFmDbqXDf5BabwirnMAoZ2pkyUz\n\nAs [curvas elípticas](https://everipedia.org/wiki/lang_en/Elliptic_curve) têm atraído o interesse dos matemáticos nas últimas décadas: podendo ser observadas a partir de diferentes pontos de vista (algébrico, geométrico e analítico), as curvas elípticas estão relacionadas com áreas da Matemática que, à primeira vista, parecem não ter qualquer conexão com elas, como a Teoria dos Números. Apesar de esta multifacetada natureza ser sua idiossincrasia mais notável, a compreensão de aspectos até mesmo elementares destes objetos ainda está nublada por diversos mistérios.\n\nA [Conjectura de Birch e Swinnerton-Dyer (BSD)](https://everipedia.org/wiki/lang_en/Birch_and_Swinnerton-Dyer_conjecture), um dos [7 Problemas do Milênio](https://everipedia.org/wiki/lang_en/Millennium_Prize_Problems) escolhidos pelo Clay Mathematics Institute por serem altamente relevantes para suas áreas (e bastante complicados), traz, além de um prêmio de um milhão de dólares para quem resolvê-lo, o esclarecimento de alguns dos mistérios mais fundamentais da natureza das curvas elípticas, bem como a solução de outros problemas em aberto da Teoria dos Números.\n\n#Ganhar 1 milhão de dólares só jogando Mario\n- https://gateway.pinata.cloud/ipfs/QmbzWmcj54NmGswJYhvnrmNSsB3YVcZ84yNXUKb4Li175u\n\nVamos falar sobre um [artigo](https://gateway.pinata.cloud/ipfs/QmV5KfwBAXYz31K8b2MbbBmuZCNiaW8zQ7E6gDiQWx5sP3) de 2012 que prova que passar de fase no [Super Mario World](https://everipedia.org/wiki/lang_en/Super_Mario_World) e em outros jogos de plataforma é computacionalmente uma tarefa do tipo mais difícil que existe, que em tese poderia ser usada para resolver [um dos 7 Problemas do Milênio](https://everipedia.org/wiki/lang_en/P_versus_NP_problem).",
				"added": 1597503071
			},
			{
				"comment_id": 25,
				"body": "#Aula Magna 2019 - Marcelo Viana - A matemática brasileira: dos anos 1950 aos anos 2020\n- https://siasky.net/CABpmsZ_hu-7DW7a5CmwkWOVGQRc5-Wl2ORixgHqyE065w\n\nAula Magna do [Instituto de Ciências Matemáticas e de Computação da USP de São Carlos](https://www.icmc.usp.br/), 2019. Realizada.\n\nMais informações em https://web.archive.org/web/20200903160621/https://www.icmc.usp.br/noticias/4618-marcelo-viana-explica-o-sucesso-brasileiro-na-pesquisa-matematica-em-aula-magna-no-icmc",
				"added": 1599151458
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 18,
				"body": "#Coleção – Generais em Guerra\n\nSinopse: Esta série interessante produzida pela National Geographic explora sob uma nova perspectiva as grandes batalhas da [Segunda Guerra Mundial](https://everipedia.org/wiki/lang_en/World_War_II), analisando as decisões, os dilemas e os desastres dos grandes generais de ambos os lados do conflito.\n\n- Episódio 1 - [A Batalha de Singapura](https://everipedia.org/wiki/lang_en/Battle_of_Singapore): https://siasky.net/AAC0UqGme0LZlDmQEpSYW2a505sTccuulvov3GWY4PQDHg\n\n- Episódio 2 - [A Batalha de Midway](https://everipedia.org/wiki/lang_en/Battle_of_Midway): https://siasky.net/AACCjR4lfc2wOMeuDgflmHT2egHd7lgNuG1GYltvAWMuIA\n\n- Episódio 3 - [A Batalha de El Alamein](https://everipedia.org/wiki/lang_en/Second_Battle_of_El_Alamein): https://siasky.net/AACusiRn_TAXp8KH7r31tTEshUZsqU_-J94GJviRY1jhgg\n\n- Episódio 4 - [A Batalha de Stalingrado](https://everipedia.org/wiki/lang_en/Battle_of_Stalingrad): https://siasky.net/AAB3FBFvbm7XdwPn4t0IW0YGxQHPO4GG2BhSOTA9ZkbSKA\n\n- Episódio 5 - [A Batalha de Bulge](https://everipedia.org/wiki/lang_en/Battle_of_the_Bulge): https://siasky.net/AAB0OvZaEZdMoqWS4snKGyW43PuggEimdUOhw91gbZD8Lg\n\n- Episódio 6 - [A Batalha de Kursk](https://everipedia.org/wiki/lang_en/Battle_of_Kursk): https://siasky.net/AADLB0FZQk6FhXyRGMyfoKSDXh2-nWuc92Pk8UiBV0MoaQ",
				"added": 1599144819
			},
			{
				"comment_id": 22,
				"body": "#Guerras Híbridas: a abordagem adaptativa indireta com vistas à troca de regime - Andrew Korybko\n- https://ipfs.infura.io/ipfs/QmP3bEfds8nKFF9C3EU8M4SibW5sczZeBAPNyCovD8CfL4\n\nHá mais de dois mil anos, o estrategista militar da China antiga Sun Tzu já se dava conta de que a guerra indireta é uma das formas mais eficazes de combater um inimigo. Ela permite que um oponente derrote o adversário sem enfrentá-lo diretamente, economizando assim os recursos que seriam despendidos em um confronto direto. Atacar um inimigo indiretamente também pode atrasá-lo e colocá-lo na defensiva, deixando-o assim vulnerável a outras formas de ataque. A guerra indireta também impõe certo custo de oportunidade ao lado defensor, visto que o tempo e os recursos que ele acaba tendo que empreender para lidar com o ataque indireto poderiam, não fosse o caso, ser colocados em melhor uso em outras áreas. Além das vantagens táticas, há também as estratégicas. Pode ser que existam certas restrições (por exemplo, alianças, paridade militar etc.) que previnam uma parte de lançar hostilidades diretamente contra a outra. Neste caso, a guerra indireta é a única opção para desestabilizar o adversário.",
				"added": 1599148358
			},
			{
				"comment_id": 23,
				"body": "#A Arte da Guerra - 2009\n- https://siasky.net/AADs7Nqr3jnRG2U3a-hn7mJwg95heXGlIiR6fmss8v5zdA\n\nDocumentário sobre os principais ensinamentos de [Sun Tzu](https://everipedia.org/wiki/lang_en/Sun_Tzu): \"A Arte da Guerra\", ilustrado com exemplos da [Segunda Guerra Mundial](https://everipedia.org/wiki/lang_en/World_War_II), a [guerra do Vietnã](https://everipedia.org/wiki/lang_en/Vietnam_War) e a [guerra civil americana](https://everipedia.org/wiki/lang_en/American_Civil_War).",
				"added": 1599148401
			},
			{
				"comment_id": 24,
				"body": "#Guerras Híbridas: das Revoluções Coloridas aos Golpes\n- https://ipfs.infura.io/ipfs/QmeaSDHS4VrLbEXDwBpQBpa4HN1vLxJP5qc4kX7snTJnqh\n\nNeste livro, Andrew Korybko constrói um novo conceito para explicar as novas táticas dos [Estados Unidos](https://everipedia.org/wiki/lang_en/United_States) para derrubar governos. A Guerra Híbrida é a combinação de revoluções coloridas e guerras não convencionais para substituir governos. Partindo do estudo de caso da Síria e da Ucrânia, o autor constrói um novo conceito, cujo modo de operação pode ser facilmente identificado em outros conflitos no Oriente Médio e na América Latina. A Guerra Híbrida é o modelo de intervenção para o século XXI. “Se o padrão que os EUA vêm aplicando atualmente na Síria e na Ucrânia for indicativo de algo, no futuro a guerra indireta será marcada por “manifestantes” e insurgentes. As quintas-colunas serão compostas menos por agentes secretos e sabotadores ocultos e mais por protagonistas desvinculados do Estado que comportam-se publicamente como civis. As mídias sociais e tecnologias afins substituirão as munições guiadas como armas de ‘ataque cirúrgico’ da parte agressora, e as salas de bate-papo online e páginas no Facebook tornar-se-ão o novo ‘covil dos militantes’. Em vez de confrontar diretamente os alvos em seu próprio território, conflitos por procuração serão promovidos na vizinhança dos alvos para desestabilizar a periferia dos mesmos. As tradicionais ocupações militares podem dar lugar a golpes e operações indiretas para troca de regime, que são muito mais econômicos e menos sensíveis do ponto de vista político”.",
				"added": 1599148691
			},
			{
				"comment_id": 26,
				"body": "#Estratégias Militares: Defesa em Profundidade\n- https://siasky.net/AAAREalioM23wEKAQsOjHi-lVVktk9x7WMSlmXWHwXZ6iA\n\n#Estratégias Militares: O Assalto Aéreo e a revolução da guerra móvel moderna\n- https://siasky.net/AABvnWb-HOifK9gPlupHccfutXTdY6zMA-S86BKj2jbCtw\n\n#Estratégias Militares: Terra Arrasada, a mais desesperada das defesas\n- https://siasky.net/AACz0wHJdphfl0I9j4NTBLyL2U8m72w4adh6-bPhti0pKA\n\n#Estratégias Militares: O desembarque anfíbio\n- https://siasky.net/AACVak2CUq53wmdw9vKofcZd-LRtycdkJ0jAFLuqxSE-xQ\n\n#Estratégias Militares: A superioridade aérea\n- https://siasky.net/AAAIwyJkf6u8RQv19KwbOuwT135itmEltdZ2cABagcpx4g\n\n#Estratégias Militares: A Guerrilha e o \"vale tudo\" na guerra\n- https://siasky.net/AAAL86s6dQsjcma8B0DayEl7jaxdBRiZ2quGrZmn3zdUtQ\n\n#Estratégias Militares: A estratégia \"fabiana\"\n- https://siasky.net/AABmzkUC3aCrwhkz1YkGRaPO3f2lkcUpKskDAXnTt7CzaA\n\n#Reconhecimento, a difícil tarefa de conhecer o inimigo\n- https://siasky.net/AABhNe4xgQO3UqJwhl6PhQ8YH2QZu50r-OxbA0-cwqO7AA\n\n#Ataque com ondas humanas - Desespero ou despreparo?\n- https://siasky.net/AAB3BAHBW97p443-KWHPlncJxY4yi4lREZEHY1e0wQ3A0Q\n\n#Estratégias Militares: Dividir e Conquistar\n- https://siasky.net/AACJwNLUlF5smime2vi9TufWjE_Ld9k54IqybpFBtKoakQ\n\n#False Flag, quando aquilo que parece... não é!\n- https://siasky.net/AABxMlB8Rh1Mzf56qKkeARAOnpCLo2rgBZxCbwTABIWpyw\n\n#A Estratégia Militar realmente funciona?\n- https://siasky.net/AACN_hv5B1zymLT5G2XJrXMzOrthFKraDiY3doWNcqPHwg\n\n#\"Será que estão aqui... ou será que estão ali?\" A arte de ludibriar o adversário\n- https://siasky.net/AADpjEzAV-x7FPKtPhGNooKEmGkAEsuPrjdedwlqoGYUCQ\n\n#Atrair, Enganar e Sangrar – A arte de fazer os seus adversários lutarem por você!\n- https://siasky.net/AADFJd4MyR11flrRKB83uRR_VnZTPNLw2a4IOM16ba5LKA",
				"added": 1599155750
			},
			{
				"comment_id": 29,
				"body": "#Como sobreviver no campo de batalha?\nhttps://siasky.net/AAAH0WwjuvN4s181DxEIgZ8U5sTJlTz4EeQAPRitf9brnw",
				"added": 1599166781
			},
			{
				"comment_id": 30,
				"body": "#O combate urbano, quando as regras deixam de valer\nhttps://siasky.net/AADsSBVWX39SMesJCIh_RY2AbUQvGi-8Wv65KrgNQJ4X9Q",
				"added": 1599166805
			},
			{
				"comment_id": 31,
				"body": "#Atiradores furtivos de elite\nhttps://siasky.net/AAAucI6ZUyZ51AeXM21qKHk9aPbrZL0IuGoKFksJ9cAl7g",
				"added": 1599167737
			},
			{
				"comment_id": 32,
				"body": "#Rússia libera imagens de testes com a mais potente bomba nuclear já criada\n\nNo último dia 20 de agosto a Rússia liberou imagens até então sigilosas do teste feito em 1961 com a [Tsar-Bomba](https://everipedia.org/wiki/lang_en/Tsar_Bomba), bomba de hidrogênio RDS 220 e a mais potente bomba nuclear já criada no mundo.\n\nA bomba foi detonada em outubro de 1961 e liberou uma energia estimada em cerca de 57 milhões de toneladas de TNT (dinamite convencional). Ela foi desenvolvida entre os anos de 1950 e 1960, durante a corrida armamentista entre EUA e União Soviética.\n\nAgora, a Rússia liberou 40 minutos de imagens inéditas do teste realizado. A filmagem aberta ao público tem 40 minutos, sendo que a primeira meia hora do vídeo faz na verdade uma propaganda do programa nuclear soviético, da construção à detonação da bomba.\n\nA bomba foi lançada na costa da Ilha Severny, perto do Oceano Ártico, e explodiu 4.000 metros acima do solo.\n\nAssista abaixo ao vídeo liberado pela Rússia:\nhttps://siasky.net/AAC-orRVAiEyBkIETuPEGB-waXOqx6HsEVZkV9tDJ_aWdQ\n\n- Fonte: https://noticias.uol.com.br/internacional/ultimas-noticias/2020/08/25/russia-libera-videos-da-bomba-nuclear-mais-potente-ja-criada.htm",
				"added": 1599236113
			}
		],
		"1_1NKhVExf7KNJCNLtN8DSncJtawDgw9HHyW": [
			{
				"comment_id": 33,
				"body": "#Dowbor vislumbra o pós-pandemia\n- https://siasky.net/AAAeNWd_2QCm6dkX5h1X-lJMr4Tu3GIr19mHdBqLUWgUNw\n\nNos grandes desastres, as possíveis rupturas. Para o autor de “A Era do Capital Improdutivo”, só há duas alternativas: ou o capital financeiro nos subjuga de todo, ou surgirão, das lições do desastre, novas relações sociais. Ele oferece algumas pistas\n\nLadislau Dowbor, entrevistado por Antonio Martins",
				"added": 1599237905
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 37,
				"body": "#Filosofia da ciência: Introdução ao jogo e a suas regras - Rubem Alves\n- https://ipfs.infura.io/ipfs/QmUKJRwozHM8GJHCWuARVh4wHDCdtN8S42ayt8kj2JzaCX\n\nFilosofia da ciência - introdução ao jogo e suas regras foi escrito para acabar com o mito de que o cientista pensa melhor que os outros. Este é um mito perigoso, que inibe o pensamento e induz comportamentos, dando ao comum dos mortais a impressão de os cientistas pensarão por todos. Rubem Alves disseca todos os riscos dessa atitude, num livro que não é apenas para ser lido, mas para ser assimilado. Fundamental para o autor é que os leitores de Filosofia da ciência - introdução ao jogo e suas regras passem a buscar soluções pessoais a partir de uma nova compreensão das noções de ciência e de senso comum, a fim de viver melhor e sobreviver num mundo em que a supervalorização das especializações apresenta sérias ameaças à independência de pensamento e à autonomia pessoal.",
				"added": 1599335733
			}
		]
	},
	"comment_vote": {}
}