{
	"posts": [
		{
			"id": "218eaa00-86f8-48ae-9b8a-9d7b1ce181fe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>7e3aec62-7605-42b1-8d22-366bb1844dba\nCP being on here is a good thing though. It keeps boomers, newfags, and corporate shills away while actual anons continue to not give a fuck.",
			"time": 1566287496649,
			"files": "[]"
		},
		{
			"id": "a49416b8-2aa7-409d-94e3-329c7de20746",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>e448e013-fae7-4258-824c-00de6fac4d28\n>he thinks (((public perception))) matters\n>he thinks a hentai game coding IRC chatroom can compete against literal trillions of dollars in media and literally every corporation in the world with more than 100 employees\n>being this naive\nAnon, there's nothing that can be done about those who aren't already redpilled. All that's left to do is to get comfy and wait for it to play out. The ones that can be redpilled already are. The ones that aren't will die and that'll be it.\nPeople who avoid coming here because of a few pictures of naked children are close minded/brainwashed enough that even if they came here they would still vaccinate their children (that's the way the jews will make White people infertile once they decide it's time for them to die off).\n>I bet the FBI is planning a javascript exploit on this fucker as we speak. \nHow would that even work? Even if they manage an XSS, I normally browse through Tor, so all they would see is Tor exit node's IP.\nThey would need to perform an XSS exploit AND a sandbox escape exploit. This would be such a valuable 0day that they absolutely would not waste it on a lowly imageboard user.\nIf anything the one who should be worried is Acid. He has posted on Twatter (probably with his real IP) and uses just a VPN, not Tor. CIA nigs could swat him and get his private key, which would be useful to modify the site's javascript without needing an XSS, and also could be used to literally shut the zite down with about 5 minutes of work including booting up the computer.",
			"time": 1566294665700,
			"files": "[]"
		},
		{
			"id": "fbe62775-09eb-4d2c-8d46-e441e1648038",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>acd46066-c459-43f0-80a6-964df37a9ce3\nDo you have any idea why large files can be posted at all when max_size is theoretically set to 5 megs?",
			"time": 1566295017600,
			"files": "[]"
		},
		{
			"id": "aaec724d-e4e2-411e-a2bd-90cce2f7529b",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "27151099-f982-4d55-8fac-565c8b51a7bc",
			"body": ">>ea53a377-3dc0-4aa4-a4cd-dcd28a870e5c\nProbably Twatter, since boomers are too retarded to understand digital signatures.",
			"time": 1566295086134,
			"files": "[]"
		},
		{
			"id": "730e8f4e-9b16-4990-b1a8-758ae1915d9b",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "3e20f065-7ca2-448a-8245-a00a7d2de3ec",
			"body": ">>89f8c93c-1540-49f5-9c56-5a5019435de5\nadmin banned them after a spam wave\nonly the self-signed IDs from before the spam were grandfathered in to the new system",
			"time": 1566295481140,
			"files": "[]"
		},
		{
			"id": "eeee391e-330b-47fb-84cb-fd1a562d118b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>ce9491f6-04ee-4f20-87e4-dad6f17ee044\n>Learn your fucking history faggot; The FEDS have de-anonymized users before. Play-Pen was busted exactly that way; Via JavaScript exploitation.\nThe only reason they were able to do this was because they seized the site owner's private keys, which allowed them to modify the site. Exactly what I warned about in the post you responded to.\nWhile they might have used a sandbox escape exploit in Tor Browser, or they might just have been catching people who connected with straight up Firefox proxied through Tor (remember, this was pre-2015, early on Tor used to be paired with regular browsers until Tor Browser became popular), in which case it'd be much easier to find some kind of IP leak, they didn't have (or need) an XSS. And they didn't use it on imageboard users, it was a straight up CP distribution site, not just a couple pics scattered here and there. In any case, Tor Browser has been worked on for at least four years since that happened, and quite a couple of bugs have been caught in that period, so the number of possible exploits should be lower than back then. There is also another important difference. That was a simple .onion site, this is a p2p site. This means that the exploit used for the attack would have a higher likelihood of remaining in somebody's computer, for example if somebody connected to the zite with a spare install and didn't use it anymore (so they couldn't remove the exploit from the javascript). Another difference is this board is (at least currently) running on a debug build of an open source project. Any changes to the code would be extremely easy to detect, isolate and analyze. I've ran the current code through diff and I can attest it's exactly the same as the build I made of the official Millchan sources. In any case any security minded person has the board's files set to read only like I do, as does anybody else that updated using the .zip I published. Being able to do this is another important difference with just a vanilla .onion hidden service. I also sniff ZeroNet's and the browser's connections once in a while to make sure it's not phoning home, and I encourage anybody else to do the same.\n>You have no idea what the fuck you are talking about.\nI do though.\n>There are ways to make computers ping home you fucking idiot\nAs I said, they'd first need to find an XSS, and second need to escape out of Tor Browser's sandbox. And then they'd need a VM escape for anyone using Whonix, Qubes or any of the other VM based OSes, or a Firewall/user permissions local exploit for anyone running through a user firewalled to only use Tor like Tails does, or a remote IP stack/Tor daemon exploit if you sport a two machine setup. That or correlation attacks for Tor. But all that is old news. Security goes as far as you're willing to take it. There is always a way to break things, the question is how many resources you're willing to spend on both on offense and defense. I estimate the agencies wouldn't burn an 0day on a mongolian knitting forum, I might be wrong, but in any case I'm comfortable enough with my setup and the balance between risk and resources spent. You do you. Admin already said early on he wouldn't appoint mods. If you don't like it you're welcome to fork the board, but don't come in here pretending you know better what's good for everybody else.\n>unless you are using tor as your default DNS resolution service and routing all your traffic through a bridge relay on the network you're fucked numb nuts\nDo you think we're just figuring this stuff out? The whole point of Tor Browser is to prevent things like DNS leaks. Everything is routed through a Tor relay (not a \"bridge relay\", you're confusing things, that's just a special type of entry node). If something isn't then it's because somebody found an exploit, not because the developers haven't worked to prevent it.\n>i really love when faggots like you try and save face by spouting off a bunch of computer science related jargon\nI'm not trying to save face. I'm just trying to educate you and prevent you from spreading misinformation.\n>You have no idea what you are talking about you fucking nigger.\nI do though.\n>Hell ANY ANON could push an \"update packet\" that was infected with malicious content and we'd never be the wiser.\nNo they couldn't lol. If you think they could you're fucking retarded and don't even know what digital signatures are.\n>They have done it before and they will do it again, ESPECIALLY, when Child porn is involved.\nWhat, seize a site owner's private key and push exploits? Yes, that's why I specifically warned about it you moron.",
			"time": 1566297580663,
			"files": "[]",
			"last_edited": 1566298727508,
			"subject": null,
			"capcode": null
		},
		{
			"id": "29ad5bba-5b1c-419f-a227-006f88c761a1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>ce9491f6-04ee-4f20-87e4-dad6f17ee044\n(cont)\n>The feds don't fucking play with that shit you fucking snitch jacketing glowin the dark.\nYou sound like a low IQ nigger. Have you tried killing yourself?",
			"time": 1566298755608,
			"files": "[]",
			"last_edited": 1566298791208,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}