{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "Hi Erkan. Is \"erkan@zeroverse.bit\" just an echo test ? I'm trying to send you a message… I've only succeeded in sending message to echo bots on ZeroNet and I want to see if I can graduate to humans. ;)",
			"post_id": 56,
			"date_added": 1459608228
		},
		{
			"comment_id": 2,
			"body": "@erkan yes and got your other email will reply to it in a few seconds thanks !",
			"post_id": 56,
			"date_added": 1459608894
		},
		{
			"comment_id": 3,
			"body": "First and foremost I want to say that I know ZeroNet, Tor, IPFS, I2P, Freenet and I find ZeroNet to be the best project around so far for many reasons. That being said, it certainly is perfectible (I have submitted a couple of issues on Github myself). Not only that, but it being open source makes it your right (and obligation) to fork it and fix it yourself. Worst case scenario, a couple of ZeroNet clones are going to be running at the same time serving incompatible content for a while and eventually one implementation will emerge as a winner and that will be it. Something like the browser war back  in the days but for the anonymous and distributed web stack.\n\nMy biggest concerns with ZeroNet so far are:\n\n- The ZeroFrame: no matter what functionality it provides, I think it is a serious implementation mistake (hopefully not an architectural one). The sandboxing breaks rich content in every possible way conceivable and it being mandatory (why not a optional javascript include or at least an option to turn it off in content.json ?) is an unacceptable constraint for content producer (and the most plausible reason why most content on ZeroNet is ABOUT ZeroNet).\n\n- Incompatibility with big files: I mean in 2016 you don't support files larger than 1MB (have had problems with files <200K as well)?!?!? If this comes from the « streaming on Tor makes infant Jesus cry » excuse from 2010, I say: ZeroNet is about first-world problems, baby. Kademlia works over TCP and over Socks and not just UDP. There is no valid technical excuse that convinced me so far. ZeroNet needs a better content distribution strategy (including a UI , such as Freenet's, to help users manage large file downloads).\n\n- Shady anonymity/p2p: Namecoin support is the best I've seen so far but it also could be made better by not having to trust one specifically hardcoded ZeroSite for resolution. I would want builds that work only with Tor and not still check or even mention the public port. Of course, that excludes connections that are handled by the browser itself and require proper Tor proxy configuration.\n\n- Python: I think any other language (Swift, Go, Rust, C, C++) is a better idea. I don't want to fix the above things in Python. I use Python as some sort of in-application scripting for pre-Javascript superexpensive commercial 3D packages like Houdini. Never, never, never for a daemon. If I'm ever motivated enough to do this I think I would port ZeroNet to Swift and only support macOS/iOS/Linux/FreeBSD and then and only then would I contribute core functionality.\n\nBut again, I think ZeroNet is the best thing I've seen so far and for now, its superiority is what matters most to me so: THANKS NOFISH (and other contributors). I just wanted this to be somewhere.",
			"post_id": 71,
			"date_added": 1462025217
		},
		{
			"comment_id": 4,
			"body": "> [kaffie](#comment_10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Agreed. The ZeroFrame is incredibly frustrating while doing dev work. I always end up keep bumping up against it. I'm not really sure what a good solution would be, as I do like the embedded sidebar/home button.\n\nYou could have the sidebar/home button by injecting javascript (for example) with a user over-writable option (in the daemon).\n\n> The big issue here is that users only store and seed stuff they've viewed and visited. Meaning that having them store a bunch of large files could easily become problematic. And doing something like FreeNet could turn off a lot of users who like the current lightweight model. I think integrating another service would work well. Perhaps WebTorrent or IPFS? At the very least ZeroNet could switch how it sends files to gather one from multiple users rather than having an entire file sent by a single user.\n\n\nIPFS has the same problem right now. No meaningful way of having control over what's downloaded or even monitor it. Same thing with bandwith. Freenet is better in that regard.\n\n\n> This is already a thing. You can change the DNS resolver in the config stuff. There's also an option to enable local Namecoin lookups, rather than use a ZeroNet Site.\n\n\nIt doesn't work and it's not default behavior (last time I checked). It should look for a namecoind running locally and resolve through it if available. Plus it needs lighter, redundant solutions that don't involve downloading the whole blockchain. \n\n\n> I don't think this will change. A lot of work has already been done in Python. And it's multiplat so that anything that can run python can run ZeroNet, rather than just a couple of preselected OS's. Switching to Swift and only supporting mac/linux would cut out a huge portion of users who use windows. We're trying to increase adoption, not reduce it.\n\nI'm not asking you guys to rewrite the \"reference\" implementation (I would advise the coredevs actually NOT to do that - but please help anyone who wants do invest time to do that-). I'm just saying because if I (or any other aspiring -non-core- dev) am ever going to contribute solutions (especially for the DHT, the large files, etc.) I would fork and rewrite first. I don't know if it's even going to happen at all (my involvement). But if ZeroNet is to have any future in the long term, I think a rewrite fork (such as bitcoin-legacy vs bitcoin-core) is inevitable.",
			"post_id": 71,
			"date_added": 1462061389
		},
		{
			"comment_id": 5,
			"body": "> [redacted](#comment_12_1QQggeZo72jptq7AvVQbrQKXZetKzF5kj): There is no secure way to allow JavaScript without the frame. XSS galore. Maybe if ZeroNet were implemented using a proxy so different sites show up as different origins.\n\nlol\n\n\n> As for Python, that is simply a nonsense criticism. If you aren't willing to contribute because it's Python, you're probably not someone who should be contributing anyway.\n\nlol\n\nI'm out of this convo now. Thanks for all the fish.\n\n",
			"post_id": 71,
			"date_added": 1462065365
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}