{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1568662536,
			"title": "Liquid Exchange: upcoming IEO Roobee platform",
			"body": "Liquid Exchange announced IEO for Roobee investment platform.\nI plan to invest $100 and make x10 on hype with a moderate risk.\n\nAt the same time Liquid offers the refferal program and gives $10 for registration to you and $10 to me.\nIEO starts in 1D 12H 30M. Details about Roobee platform with my refferal code https://app.liquid.com/ieo-market/ROOBEE?affiliate=c2sSL_l5706969",
			"added": 1568662535
		},
		{
			"topic_id": 1568918753,
			"title": "About new reality for yourself",
			"body": "Some people live all their life with strong beliefs what Exist and what is only fantasy/delusion/bullshit, then they die with those beliefs. And some people realize there are another scenarios could be developed. And these scenarios really happen for them.\n\nHow often this happens to you? Under what circumstances? What had you felt that time?",
			"added": 1568918751
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1568662536_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": [
			{
				"comment_id": 1,
				"body": "> [jeff](#comment_11_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): ah, the old pump and dump, eh\n\nYes, this is it. Anyway looks like it's worth a try.",
				"added": 1568747920
			}
		],
		"1568918753_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": [
			{
				"comment_id": 2,
				"body": "> [cactusdragon](#comment_18_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): please clarify 'there are another scenarios could be developed'\n\nSomething you not believed until it happened with you, for example. Anyway terms definition up to you. Subjectivity and this all :-)",
				"added": 1568919525
			},
			{
				"comment_id": 3,
				"body": "> [cactusdragon](#comment_19_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): I thought my eyes where alright and that all people could see just as good as me; then I got tested... I was so wrong\n\nAre you still OK with your eyes?",
				"added": 1568919808
			},
			{
				"comment_id": 4,
				"body": "> [cactusdragon](#comment_19_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): I thought my eyes where alright and that all people could see just as good as me; then I got tested... I was so wrong\n\nMaybe one more case?",
				"added": 1568919886
			},
			{
				"comment_id": 5,
				"body": "> [aspidochelone](#comment_196_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Concept: this reality is one of a large series of Days of Creation, parallel universes in which there \"are\"/\"were\" parallel versions of ourselves.  Causality violations in our universe lead to multiple potential solutions, of which conscious beings select one based on the perpendicular time with these other universes.  Question: in dreams, in fantasy, in recollection, can people access their parallel universe memories, including in some cases technologies and philosophies not presently known in this universe?  Do there exist transdimensional organizations, of which some of ourselves may already be associated, which can infiltrate and project to this universe? [...]\n\nOk, nice philosophy concept. Why not to start another thread for it?",
				"added": 1568922980
			},
			{
				"comment_id": 6,
				"body": "> [xcape2net](#comment_399_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): My beliefs are constantly changing.  I think that's a good thing. \n\nYou should tell us about couple of changes or maybe dozen :-)",
				"added": 1568993211
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_1048_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You don't want to know what I know, and I might not want you to know.\n\nAnd at the same time you're participant of the discussion, right?",
				"added": 1568993311
			},
			{
				"comment_id": 9,
				"body": "> [applebrainz](#comment_4_1QKBw5pHsSUokVZXrvLmo4PiPytto86CMu): People live with the thoughts that someone else controls the world around them, and that those people are evil.  The elite are where they are for a reason, and by saying they are bad, and should be killed, you are advocating for anarchy, and the downfall of western civilization.  You also show yourself to be a massive pussy, and have a victim's mentality.\n\nso, what's your case? Have you become the elite or…?",
				"added": 1569153729
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1054_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Some of them don't belong. That's certain. They corrupt democracy and give nothing for the damage they do.\n\nhah, politics in the answers to self experience discussion? really?",
				"added": 1569153875
			},
			{
				"comment_id": 11,
				"body": "Hey, folks! This discussion is about your discovering and your feelings when you find something new in this world.",
				"added": 1569154225
			},
			{
				"comment_id": 12,
				"body": "> [xcape2net](#comment_405_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): things like near-death experiences, out-of-body experiences… …then there is no reason that you would trust me…\n\nYes, I get your point here. At the same time personally I'm more interested in experience which you can prove. If we talk about near-death experiences or say UFO invasion it's ok until you can prove it, tell how your life changed after that, with obvious result.",
				"added": 1569252683
			},
			{
				"comment_id": 13,
				"body": "> [xcape2net](#comment_409_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): including the \"fact\" that you and I exist\n\nI'm done.",
				"added": 1569274565
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "I do think those who think about probability that we're living in a simulation should get a life.",
				"added": 1569090910
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 14,
				"body": "Basically there are two categories to describe web users: gear and age. Then let's form typical groups of web users:\n1 desktop and old\n2 desktop and young\n3 mobile and old\n4 mobile and young\n\nAssume these people not working now and using their gear for recreational/entertainment needs.\nThen Group#1 consists of conservatives who don't even bother about such things as p2p networks. Yes, there could be ~1% of old school nerds among them who already use 0net. Anyway this group not very populated.\n\nGroup#2 Entertaining young on desktop, really? I believe it less populated even than Group#1. But they could use 0net, geeks.\nGroup#3 0net lacks mobile support (I'd say by design). Anyway such people not into idea of p2p and not tech savvy overall.\nGroup#4 The most active and populated group nowadays. They could be interested in 0net. But 0net lacks mobile support.\n\nNo fuel — no movement.",
				"added": 1569622399
			},
			{
				"comment_id": 16,
				"body": "> [kusoneko](#comment_63_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5):\n> Incorrect, there exists a mobile 0net app\n> The problem is that it currently runs a full Zeronet node on your mobile device\n> you need to know some about networking to properly set it up to be accessible for your phone from outside the local network if you intend to use it on the go\n\nSo, there is no any adequate Zeronet solution for mobile user.\nAnd yes, I do know about zeronet-kivy.",
				"added": 1569661484
			},
			{
				"comment_id": 17,
				"body": "Okay, we should go further. Because technical drawbacks never were the main cause of lacking popularity. What's the point of Zeronet? It avoided from censorship. And how are YOU apply this feature? \nWhile in censored facebook people plan to storm Area 51 what are WE up to here in 0nets? Nagging about ToS of clearnet services and about lying government? Really?",
				"added": 1569663183
			},
			{
				"comment_id": 18,
				"body": "> [robinofdeath](#comment_12_1367VTupfj886Uk39iT4RjiSmrakiDYTga): well i dug out my laptop just to get on zeronet.\n\nMe too. So what?",
				"added": 1569667597
			}
		],
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 15,
				"body": "Zeronet itself as a service accept donations.",
				"added": 1569622767
			}
		]
	},
	"comment_vote": {
		"19_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"399_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"402_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"21_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"148_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"187_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}