{
	"pversion": 2,
	"private_messages": [],
	"messages": [
		{
			"body": "Witam; teraz i ja dołączyłem.",
			"date_added": 1545800374535,
			"key": "fd5241f1-1a5e-9237-9ac4-1328624dfda4"
		},
		{
			"body": "Witam; Co myślicie na temat ; KxoVid - Połączenie z gogle i z clearnet? Czy to nie sprowadzenie do starej dystrybucji informacji, tylko w nowym wydaniu? Stara kurwa, w nowej jesionce,płaszczu?Jak słyszę,że coś będzie ze starego rozdawnictwa; to mnie zapala się czerwona lampka. Jakie macie zdanie na ten temat?",
			"date_added": 1552857029761,
			"key": "bb6035a3-5b8c-f7a6-4ea7-d73fe336677d"
		},
		{
			"body": "No to pytaj bardziej konkretnie, w czym problem;wtedy może ktoś odpowie. Ja też odpowiem o ile będę wiedział.Pzdr.",
			"date_added": 1553725528998,
			"key": "e3c0887a-2202-a5d4-08b3-5b383e6c73af"
		},
		{
			"body": "golbot@zeroid.bit chyba zaskoczyłem o co tobie chodzi;daj znać jak jeszcze tam jesteś.Przeczytaj ZeroTalkPolska - ostatnie wpisy. Albo pisz do mnie na pocztę,spróbuję jakoś tobie pomóc i wyjaśnić.pozdr.",
			"date_added": 1554170475455,
			"key": "3b4eb775-145c-b77c-48fd-6058f2832049"
		},
		{
			"body": "Niestety nic takiego niema, musiałby być wtedy pośrednik, który by przechowywał i dalej kolportował. Ja po prostu sprawdzam, czy niema jakiejś wiadomości. To samo dotyczy tutejszej poczty. Wiadomość pokawałkowana wisi gdzieś w sieci i czeka aż ty ją odbierzesz .",
			"date_added": 1554752117882,
			"key": "a77a973b-2699-33f2-bb22-eb2ddfd25f86"
		},
		{
			"body": "Witam; ustawiłem według wskazówki, chyba działa. Dzięki. Znowu coś się douczyłem.",
			"date_added": 1554769069776,
			"key": "185aa58c-2c0a-8199-4476-ff3ec5dec1f9"
		},
		{
			"body": "Witam;kasiarzyna@zeroid.bit\n\nJa napiszę, myślę że powinno działać. U mnie się wyświetliło na głównej stronie Zero Talku. Więc zobaczymy czy do ciebie też dojdzie te powiadomienie. Pozdr.",
			"date_added": 1554824366526,
			"key": "2640c59c-ab6e-1b40-608b-e2c4c7c5dbbb"
		},
		{
			"body": "Witam; zbieram materiały, żeby były - było to - ( ciekawe ), coś co będzie można pokazać na J-T-PL. Niestety trzeba dużo przerzucić, żeby coś znaleźć. Pozdr.",
			"date_added": 1555025310744,
			"key": "920081c1-ac94-8d43-054f-b766ea98ef6f"
		},
		{
			"body": "Skrót od nazwy - YouTubePL. przepraszam za błąd, miało być Y - zamiast -J. Brak kontaktu między głową a palcami które piszą.",
			"date_added": 1555097619564,
			"key": "063baad4-daa0-3133-2674-86e9b72d9ca0"
		},
		{
			"body": "Witam;Wesołych Świąt; wszystkim ludziom dobrej woli, smacznego jajka i mokrego dyngusa życzy     @tomasz21",
			"date_added": 1555800359071,
			"key": "fb4faf93-a4a0-15cc-54fc-a0140acb03f3"
		},
		{
			"body": "Witam; Na ZeroPolska, jest wrzucone parę nowych artykułów. ( text ). I jest parę nowych pod rozdziałów zrobionych. Zajrzyjcie - Miłej lektury. Pozdr.",
			"date_added": 1556090680006,
			"key": "9e3235c8-f5fb-2e01-bdb8-d711c24b6c13"
		},
		{
			"body": "Ey2xjpdx@ Witam; Chodzi o film na YouTubePL. 2018.[PL]-L.Zebrowski Czy przetrwamy grabież majątku narodowego. Plik jest uszkodzony. Zamiast wgrać się - 249MB - To tylko wgrało się - 200MB -. Na dwóch Pc-tach. Tylko po 200MB. Na trzeci już nie wgrywałem. Trzeba jeszcze raz od nowa wgrać ten sam film, to się nałoży na siebie i się uzupełni. Ze starych filmów też jest jeszcze jeden, który tylko - 3MB- się wgrał. Nazwa jego to jest. 07.03.2019.[PL]-zamknij-mordę-polko-antypolska konferencja-. To tyle w temacie nie działających filmów. Pozdr.",
			"date_added": 1556094100057,
			"key": "b7416e66-d8b0-1604-c1f0-ba3966e4bd9c"
		},
		{
			"body": "Witam; Zainstalowały się, \"Tablice\". Ale tylko na jednym Pc-cie. Pytanie? do czego to jest przeznaczone? Co tam można umieścić? Jakie duże pliki? Dlaczego na innych Pc-tach. Tego niema? Krótka instrukcja obsługi, jest mile widziana. Nie chcę znowu, niechcący coś zniszczyć. A mam do tego smykałkę, czego się dotknę, to przestaje działać. Taki bystry jestem. Jakieś wprowadzenie, przynajmniej dla mnie. Dzięki i pozdrawiam.",
			"date_added": 1556095016449,
			"key": "6f4ca1ef-24cb-0ebe-aaed-faeca640ec30"
		},
		{
			"body": "Może by tak te \"TABLICE\" dodać do \"Zero Sites\" To można by było je łatwiej zainstalować? I były by dla wszystkich dobrze widziane. Pozdr.",
			"date_added": 1556095443227,
			"key": "f4962630-1090-bc88-6cb5-62d50aa9da80"
		},
		{
			"body": "Nowy blog założony przez,Ey2xjpdx@ - Link był podany,na Zero Talk Polska. Ale coś tam",
			"date_added": 1556099650151,
			"key": "856584f9-33ab-2de8-6d3b-7e4deedd58c1"
		},
		{
			"body": "Nie bardzo wszystko grało i został chyba poprawiony; bo u mnie się otworzył. Za chwilę go poszukam, to go podeślę.",
			"date_added": 1556099731246,
			"key": "76f3a1c0-a7f0-ab40-58f2-c500c97d0dc6"
		},
		{
			"body": "http://127.0.0.1:43110/16to1UyQzxdQY8cPau9SSiJJwAiKff2An2/",
			"date_added": 1556099865849,
			"key": "c47ef6ae-a3a3-0f9c-6437-c675cbe09144"
		},
		{
			"body": "Jeszcze jeden pomysł mi przyszedł do głowy; A jakby do napisu \"Tablice\" dodać PL  - To byłby wyraźny akcent, że to jest nasze krajowe. Byłby to znaczący wyróżnik z pośród innych tytułów. To jest wskazane dla nowych osób.Pozdr.",
			"date_added": 1556100324338,
			"key": "ba79c933-1c04-73f8-bf82-b7943a080a5a"
		},
		{
			"body": "Witam;W tej chwili - 14/16.  na drugim - 12/16.",
			"date_added": 1557741112918,
			"key": "d644ee60-ed3f-6024-dbfd-49c451346c50"
		},
		{
			"body": "Grzebią w internecie, to się nazywa modernizacja; zablokowali nagrywanie filmów na Y-Tubie.Tylko można przez pośrednika. Ograniczają, nasze możliwości.Chcą kontrolować wszystko;łącznie z naszym myśleniem. Router zablokowali, nie moŻna ustawić portów.Sprawdź router.Przechodzimy w stan pogotowia wojennego.",
			"date_added": 1557741668897,
			"key": "23523c5e-a0b9-5b3b-742d-ff5e775bd4b4"
		},
		{
			"body": "Dzięki za uwagę; Szkołę dawno temu skończyłem. Do niczego mnie się nie przydała. Dopiero jak zacząłem zdobywać wiedzę, zrozumiałem swój błąd.Różnica po miedzy szkołą a wiedzą jest ,jak pięść i oko; jak uderzysz to boli. Po za tym nikt nie musi słuchać moich wypowiedzi. Tutaj panuje wolno-amerykanka. Pozdrawiam.",
			"date_added": 1557749489729,
			"key": "192c8b2e-4efe-a49b-5fb3-1805a7b986ee"
		},
		{
			"body": "Śmierć, żony. Oraz kontrolne badania gdzie lekarz się zapytał? A pani jeszcze żyje?Było to trzy lata temu. Zastanowiło mnie pytanie lekarza. I zacząłem szukać na własną rękę.Najpierw mocno się zdziwiłem, a potem od tematu do tematu, i poszło z górki.Najpierw temat zdrowia, a potem inne tematy. Ta wiedza nas otacza, tylko my jej nie widzimy; tak jesteśmy zajęci różnymi głupotami. Dlatego próbuję, małą cząstkę przekazać dalej.Pozdr.",
			"date_added": 1558347932363,
			"key": "ca4318e6-84e3-f559-5a65-86c9fbfb5531"
		},
		{
			"body": "Witam;do @Kasiarzyna- Już drugi film który ostatnio wrzuciłaś,na YouTubePL- się nie chce otworzyć; Pytanie? Od czego to zależy i co jest tego przyczyną? Czy mogłabyś sprawdzić, czy u innych się otwiera? I czy mogą go, ten film obejrzeć?Bo u ciebie to na pewno się otwiera. Pytanie-nr.2. Czy moje filmy możesz obejrzeć? Czy się otwierają?Z góry dzięki za sprawdzenie; Pozdrawiam.",
			"date_added": 1568730310990,
			"key": "541fa9b7-1083-564a-7f55-4d8efc28d039"
		},
		{
			"body": "Witam; do @Kasiarzyna- Dzięki; zobaczymy czy to coś da, i pomoże. Moje podejrzenia idą w innym kierunku. W zasadzie chodzi o to czy inni mają problem z odtwarzaniem, czy też nie. Chodzi o zasady. Czy wszystko działa prawidłowo, tak jak należy. Ja film obejrzałem na podstawie linka; zresztą nie było problemu go znaleźć, odnaleźć. W tym momencie chodzi o innych użytkowników. Jak poprawisz daj znać, może być na pocztę,ja ją sprawdzam i używam.Jeszcze raz dzięki i pozdrawiam.",
			"date_added": 1568754603450,
			"key": "8097ae99-df6a-db50-def5-86670540a6ec"
		},
		{
			"body": "Witam;Do@Kasiarzyna.Wszystko śmiga jak należy, dzięki.Pozdrawiam",
			"date_added": 1568936136291,
			"key": "326dd1b9-c898-ca9f-7fb4-9d3c11b12c34"
		}
	],
	"images": [],
	"group_messages": [],
	"settings": [
		{
			"feed_notifications": 2,
			"bot_welcomemsg": true,
			"parse_profile_links": true,
			"parse_quotes": true,
			"user_mention_badge": true,
			"show_timestamps": true,
			"avatar_type": 1,
			"avatar_size": 64,
			"message_design_type": 2,
			"theme_body_light": false,
			"theme_message_dark": false,
			"theme_navbar_light": false,
			"disable_emojis": false,
			"seed_all_emojis": false,
			"delete_all_emojis": "Delete",
			"reset_options_to_default": "Reset"
		},
		{
			"optsV": 29
		}
	],
	"extra_data": [
		{
			"last_seen": 1568936136379,
			"avatar_file_name": "",
			"auth_address": "1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw",
			"avatar_type": 0,
			"public_key": "AzAC4F4Q5OA1mVXkMoyjs2CXzf6OJXg6P73qwedj9NlK"
		}
	]
}