{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "I would recommend looking into creating uncensorable networks  via cheep 3d printable computers to mass produce cheep digital archives.. With cheep archives of zetabites  of data scattered it's much harder for the powers that be to censor and in turn steal from the populous.. The core of our current problem is a distribution one. \n\n\nHope these help\n--------------------------------------------------------------------------------------------------------------------------------------\ndisk space costs less than bandwidth, and both cost less than time\nhttps://www.mail-archive.com/kragen-tol@canonical.org/msg00258.html\n\nultraslow radio for decentralized global digital communication\nhttps://www.mail-archive.com/kragen-tol@canonical.org/msg00303.html\n\nfreedom of communication will stop wars\nhttps://www.mail-archive.com/kragen-tol@canonical.org/msg00211.html\n--------------------------------------------------------------------------------------------------------------------------------------\n\nmechanical computation: with Merkle gates, height fields, and thread\nhttps://www.mail-archive.com/kragen-tol@canonical.org/msg00249.html\n\nKragen Javier Sitaker Mon, 28 Jun 2010 00:37:07 -0700\n\nOne of the reasons I’m excited about automated fabrication\n(e.g. f...@home, tabletop CNC mills, RepRap, inkjet-printing of\ncircuits, fused deposition modeling) is that I expect it will make it\npossible to build computers from raw materials with minimal capital.\nIt will be some time before those computers are as cheap or as fast as\nmass-produced microcontrollers, so they will start out as curiosities.\nBut how far away is the prospect of automatically building a working\ncomputer from raw materials with minimal capital?  I think it’s\nalready possible.\n\nThis post considers three kinds of mechanical computers: one using\nMerkle’s [buckling logic] [Merkle 1990], one using mechanical\nheight fields, and one using pulling of threads.\n\nOrganic semiconductors, nonlinear acoustic devices, fluidic logic, or\nsomething more exotic, might turn out to be the form that computers\nmade by 3-D printers eventually take; but I’m pretty sure Merkle’s\napproach is workable.  So I’m going to consider that first. And I want\nto describe some ideas of my own.\n\nUnfortunately, I don’t know shit about mechanical engineering.  If any\nactual mechanical engineer is annoyed at my ignorant speculations when\nthey read this, I’d be delighted to hear about all the things I’m\ngetting wrong.\n--------------------------------------------------------------------------------------------------------------------------------------\n~ message truncated \n--------------------------------------------------------------------------------------------------------------------------------------\n\nOther concepts to consider...\nFluidics  ( fluid based logic / computers ) \nConlangs (constructed languages for information obfuscation much like encryption, laguage can be obscured by self defining your own. The trade off comes with broadcasting it [teaching and learning]  )\nDNA computers and information storage\nPhotonics computers ( computes working off of light, and mirrors etched in glass chips )\n\nQuantum networking (experimental and expensive point to point network based on quantum entanglement that's uncensorable because theirs no intermediate data handler. ) \nGravitational wave networking (experimental and expensive point to point network based on the fact that gravitational waves pass through matter and thus are also uncensorable as they would be point to point but not as fast as quantum netorking wich is instantaneous )  ",
			"post_id": 5,
			"date_added": 1535862011
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}