{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1577103091,
			"title": "ZeroSeed: a 24h 7d ALWAYS ONLINE node for ZeroNet!",
			"body": "Feel free to publish here your new zite! I will help you to share with all the network with an always online node! I hope this will help the zeronet community to grow! :)  I will publish any content except illegal zites (i will not share piracy, racism, black markets, pedo, terrorism, etc...). I will not discriminate any site for having different ideas from mine\n\nIf you will see an illegal site posted here feel free to report it in this forum, i will remove it from my node.\n\nThis service is designed for zites that have few nodes online to help them to collect more nodes; when your zite will be well seeded i will remove it from the service.\n\nThis service is FOR FREE!!! :) ...What are you waiting for? :)\n\nhttp://127.0.0.1:43110/16S6TbXHQQzpBy1qjW3cspKeCxUfhWnheD/",
			"added": 1577103090
		},
		{
			"topic_id": 1580122330,
			"title": "make a proxy for zeronet",
			"body": "I want to configure also a read-only proxy in my vps for clearnet for the zites that i'm seeding but i need some help to configure it:\n\n-there are written instructions anywere to make a public zeronet proxy?\n-i want to share more than 10 MB per zite. is that possible?\n-i want to share only legit zites (i must choose the zites to proxy and block all others, users must not access any zite that i don't want)\n-anyone must not be able to create users on the proxy or block anyone using zeroid\n-anyone must not be allowed to post any content from the proxy \n\nis possible to make all these things?",
			"added": 1580122328
		},
		{
			"topic_id": 1580925973,
			"title": "there are working music streaming zites on zeronet",
			"body": "i tried zeromusic and zerolstn...but i can't upload any mp3 in any service! there are other working music streaming zites on zeronet?",
			"added": 1580925970
		},
		{
			"topic_id": 1581083700,
			"title": "IFS streaming test from my seedbox!",
			"body": "I create a channel on IFS to test streaming with my VPS, uploading some copyleft material on it!\n\nTo begin i uploaded a CC music album created by various artists around the world on Jamendo some years ago: In This World by Babel Sin Fronteras! It should work also by using TOR! Try it! Is very fast!\n\nThere is a way to auto-seed an entire channel on IFS instead the entire zite?\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:15f1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g",
			"added": 1581083696
		},
		{
			"topic_id": 1581976802,
			"title": "New HTTPS ZeroNet proxy now online!",
			"body": "https://0net-preview.duckdns.org/\n\nThe old HTTP proxy on the .tk domain will be deactivated soon. Enjoy!",
			"added": 1581976795
		},
		{
			"topic_id": 1584777793,
			"title": "Zeronet against internet overload due to coronavirus",
			"body": "Due to coronavirus quarantine, many people are staying at home and are overusing internet; because of this the entire network could collape due to high traffic. As countermeasure some clearnet sites like youtube and netflix are stopping streaming HD definition videos. \n\nhttps://edition.cnn.com/2020/03/19/tech/netflix-internet-overload-eu/index.html\n\n...but probably the easist thing will be allow users to save videos in their local disk instead download every time! :D (but by allowing this also piracy will be easies and none will see my banners...because of this internet must die and people use a downgraded service!)\n\nThe alternative is Zeronet! On IFS (and in all other zites) every peer download content only one time and seed it to the entire network distributing the overload more properly! There are many movies on IFS right now! (Also HD videos! :D ) What do you waiting for? Begin to seed and having fun!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
			"added": 1584777785
		},
		{
			"topic_id": 1586074982,
			"title": "Dictatorship in Hungary and the future of ZeroNet",
			"body": "Orbàn received full power to fight against coronavirus from the hungarian parliament. This might be a danger for the hungarian zeronet developer?",
			"added": 1586074973
		},
		{
			"topic_id": 1587567790,
			"title": "StreamZ test under TOR",
			"body": "I'd doing a streaming test with StreamZ over TOR with a very low resolution (144p) and it works! \n\nDoing this with TOR for me is a great result! If we can stream audio very probably we can create anonymous radio in ZeroNet!\n\nhttp://127.0.0.1:43110/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/watch/1D15kTr44qdACPNLAgAnatTmDY2CW1MCpQ/xttahpt3hi/streaming%20test%20under%20TOR",
			"added": 1587567779
		},
		{
			"topic_id": 1587637861,
			"title": "StreamZ test without TOR 240p",
			"body": "Works for me in my local connection! Try it!\n\nhttp://127.0.0.1:43110/1BTZh5pymEKzMYr3qgDtgr4dMmap77QvEs/?/watch/1H2N6dZVCZ4rD4ZQsmQjJPWTq2BCipV2Hq/2e7s8covfhq/test%20without%20TOR",
			"added": 1587637849
		},
		{
			"topic_id": 1587651983,
			"title": "StreanZ test results: WE NEED AUDIO SUPPORT!!!",
			"body": "In my tests, by using a 20 Mb ADSL connection, i successfully did a 144p stream behind TOR and a 240p stream without TOR (by using an higher bitrate the zite didn't work). \n\nI used a 10 s delay in all tests.\n\n144p = 256x144 bitrate: 110 kbps\n240p = 426x240 bitrate: 245 kbps\n\nAs we know StreamZ actually don't support audio streaming, but these tests show that audio streaming will be possible also under TOR by using  an ADSL connection like mine (in Italy ADSL is very slow, higher performances can be reached in the rest of the world)\n\nBy using a VPS or a small dedicated server the zite don't work because require also a lot of CPU.\n\nWE SHOULD IMPLEMENT AUDIO STREAMING ON STREAMZ! This will allow anyone to stream anonymously a private radio and can be very useful in some country like China for real-time communications",
			"added": 1587651970
		},
		{
			"topic_id": 1588684126,
			"title": "Zeronet over LAN, Bluetooth and WiFi networks. The example from Briar",
			"body": "Recently i tried Briar, a P2P software capable to send messages over TOR, WiFi and Bluetooth. This approach have great advantages instead using only clearnet and TOR connections:\n\n- more fast sync from local devices (useful if you connect on zeronet from different devices in your home)\n- less use of resources of global network to create local copies because local peers can connect directly each others without use external nodes\n- zeronet will sync with local peers also during internet blackouts\n- more anonymous if zeronet is used to communicate locally because nothing go on internet\n\nThis is a good idea? What do you think?",
			"added": 1588684112
		},
		{
			"topic_id": 1588692906,
			"title": "Topics about ZeroNet is banned on clearnet",
			"body": "I tried to talk to ZeroNet on various sites on clearnet but almost all times my topics are banned for a reason (spam , dangerous links, etc...). Maybe centralized systems are feared by the competition given by decentralized ones?  (for example paid/ads services vs decentralized free services) Or people are feared by this uncontrolled anarchy? This censor happens only to me?",
			"added": 1588692891
		},
		{
			"topic_id": 1588766786,
			"title": "Tell me what gendre of music you want on IFS!",
			"body": "I'm uploading on IFS many mp3 of CC music! Tell me what you want! :)",
			"added": 1588766770
		},
		{
			"topic_id": 1588862308,
			"title": "someone interested on image analisys or astronomy here?",
			"body": "I want to start a little project about image elaboration. anyone want to join?",
			"added": 1588862291
		},
		{
			"topic_id": 1588888253,
			"title": "i'm reaching the size limit on zerotalk",
			"body": "can we ask to nofish to rise that limit to infinite or to a very big value?",
			"added": 1588888235
		},
		{
			"topic_id": 1598564669,
			"title": "New .com URL for my zeronet proxy!",
			"body": "https://0net-preview.com",
			"added": 1598564650
		}
	],
	"topic_vote": {
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": 1
	},
	"next_comment_id": 86,
	"comment": {
		"1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 1,
				"body": "> [no112358](#comment_3_1JbZKtuFZMRTCgBjhpnD4pCXwi5gniQsKZ): Racism is illegal? So I take it your don't support free speech and you support hate speech laws? If people wanna be racist it's their right. It makes them assholes, but that's still their right. [...]\n\nI'm not a racist, but i disagree with the idea that censoring them is the right way to combat them (if something is illegal sometimes it takes charm...). anyway in my country publish racist content is a crime and i don't want to go in prison for this, sorry.",
				"added": 1577106780
			},
			{
				"comment_id": 2,
				"body": "> [no112358](#comment_6_1JbZKtuFZMRTCgBjhpnD4pCXwi5gniQsKZ): I get it, I agree with you, if you make things taboo or illegal the wound will fester and soon there will be more bad people around. I'm not a racist, but punishing publishing of racist material, your country is a fascist country. May I ask where you're from?\n\nItaly. XII disposizione transitoria e finale of italian constitutional law (punish who want to recreate the fascist party) + Scelba Law (n° 645 6/20/1952) (punish who spread fascist ideas)",
				"added": 1577221588
			},
			{
				"comment_id": 4,
				"body": "> [draugrdeathlord](#comment_138_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): remove \"1Dressx5G2Cew5gTSUWRvNSDe2Q2GRs49D\" its a 3GB or so git repo lol [...]\n\ni never seeded this zite. Pleaase could you report any issue to my zite? In that way i can't lost any message",
				"added": 1578074244
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [],
		"1579301889_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [],
		"1580538058_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "This not-peer reviewed article is garbage!\n\nhttps://www.biorxiv.org/content/10.1101/2020.01.30.927871v1",
				"added": 1580576432
			}
		],
		"1580861368_15yEW1sNBQdenjxaA84qPwp4taxXUnfkXG": [],
		"1581097195_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 8,
				"body": "> [schiz0](#comment_98_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): Registrazioni Ambientali\n\nnon funziona il link...",
				"added": 1581231570
			}
		],
		"1581100642_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1581447935_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 12,
				"body": "> [kanade](#comment_66_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): It's better if you take down this proxy altogether, it's an awful idea that's been discussed on many other threads before. It's not even that hard to connect to zeronet in the first place so what's the point?\n\npeople are lazy...",
				"added": 1581498483
			},
			{
				"comment_id": 14,
				"body": "> [bwcolor](#comment_2_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU): i turned off the machine and i'm trying to implement SSL.\n\nbwcolor stop to annoy...give me time! :)",
				"added": 1581517342
			},
			{
				"comment_id": 17,
				"body": "i successfully registered my domain and added my site to cloudfare. now i changed freenom nameservers with cloudfare ones...maybe the site will be active again within 24 h",
				"added": 1581664507
			}
		],
		"1581384962_1FmC53ZDqp15korLaKkB5XENMJguuxrzLT": [],
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 18,
				"body": "because is the only network where anyone could see the things you want to public without filter bubbles and because here anyone could publish what he want without creating a facebook/gmail account with his cellphone",
				"added": 1581955435
			}
		],
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 19,
				"body": "I copy here the rules for hosting your zite on my new proxy (the same as the previous):\n\nThis is a preview with selected zites (all official zerotalks plus some other zites) created to show zeronet to the public. This is a read-only proxy and addictional zites cannot be added by users. Also ZeroID and login zites are blocked (you can't comment any zite by using the proxy, you should install zeronet in your pc/phone to do this). Private content zites like zeromail are also blocked.\n\nIf you want your zite added to this proxy it must respect these conditions, if this is the case post your link in a comment below:\n\nlegal content (no pedo, black markets, malware, piracy, racism, etc... the same rules of my seedbox are valid also here) no javascript cryptominers\nno image previews of user generated content (example: Millchan) \nno big files, no videos/audio files (this files use a large amount of bandwidth and can block the proxy)\nno private content (zites like zeromail) , cannot be managed by using the proxy. \nNo zites that allow user login in their code without using a third part service like ZeroID (example: Millchan)\n\nI will not discriminate any site for having different ideas from mine.\n\nIf you will see an illegal site in the proxy feel free to report it in this forum, i will remove it from the site.\n\nI'm doing this because i LOVE the philosophy described by zeronet creator in this video: https://www.ted.com/talks/tamas_kocsis_the_case_for_a_decentralized_internet\n\nI will do as possible i can to realize this dream!",
				"added": 1582062494
			},
			{
				"comment_id": 32,
				"body": "all zites listed below seeded",
				"added": 1584736568
			},
			{
				"comment_id": 36,
				"body": "> [xerog](#comment_12_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv): Hi guys!How actually needed and beneficial is this proxy server? Wouldn't it hurt zeronet more than build it up?What are your opinions?\n\nin my opinion a proxy will help the network because is a seedbox always-online and also becaose allow other people to know zeronet",
				"added": 1585332673
			},
			{
				"comment_id": 37,
				"body": "> [dimka511](#comment_1_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH): @zeroseed please add this site, it contains information that will help new users to get used to and understand how ZeroNet works.http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\n\nadded!",
				"added": 1585513905
			},
			{
				"comment_id": 38,
				"body": "> [geekless](#comment_187_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @zeroseed, could you consider adding these sites? [...]\n\nall added!",
				"added": 1585513918
			}
		],
		"1583512099_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 20,
				"body": "> [rannulfr](#comment_48_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): We are looking for developers to implement new features in a fork of the project as the original Dev is mia. Help us build this into a central point of Zeronet for content. [...]\n\nif you want to add thumbnails please make it optional and not the default choose because thumbnails can be a legal problem if it will show frame of illegal files. If you make thumbnails the default you will force all users to use TOR (and this will slow the entire network also for legal files)",
				"added": 1583529842
			},
			{
				"comment_id": 21,
				"body": "> [rannulfr](#comment_50_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Good point. A thumbnail toggle at the top, with it being off by default could be a good way to do it?\n\nyes. this will prevent any problem (this should work also for pics)",
				"added": 1583531520
			},
			{
				"comment_id": 22,
				"body": "i see in my last test that my HD vid streams very fast with only 1 seed. There is a seedbox active managed by someone? The VPS that i'm using for seeding many zites on zeronet don't have enough disk space for big files, but maybe i can rent a dedicated server for this purpose (only legal files)\n\nI suggest also to allow users to \"subscribe\" to channels to auto-seed all files in chosen channels. Seding an entire cluster is dangerous without using TOR (by using TOR some bandwidth is also wasted)",
				"added": 1583619177
			},
			{
				"comment_id": 24,
				"body": "i created a seedbox for IFS on a dedicated server with 100 Mb/s bandwidth. Try this movie!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g_item_29+type:video\n\nIf anyone want to publish some legal files call me and stay online",
				"added": 1584085075
			},
			{
				"comment_id": 25,
				"body": "> [hagen](#comment_10_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX): I made a channel for rare videos of American philosopher-mystic Franklin Merrell-Wolff.He had lots of Buddhism style ideas. Arriving at them independently, he still help popularise them in America at a time when most americans hadn't heard of them.He does this all while still remaining intellectually rigorous and without falling into stupid new age nonsense. [...]\n\nStay online and i will seed these files!",
				"added": 1584085143
			},
			{
				"comment_id": 27,
				"body": "> [xplosive](#comment_56_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): You wrote \"If anyone want to publish some legal files call me and stay online\". What about some illegal files? For example cracked expensive computer software (including video games), full movies, full music albums, complete concert recordings, eBooks and other things.\n\ni cannot seed these things. sorry but the server hosting company have my name.",
				"added": 1584100630
			},
			{
				"comment_id": 28,
				"body": "> [rannulfr](#comment_54_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): I understand. You should a paid VPN in addition to TOR.\n\nthe server hosting company will always see what i'm seeding. Also TOR + VPN will slow the connection and will not allow an HD streaming. And i don't want to share anything illegal...i want to show how zeronet can allow internet to be better and free...not only an house for fascist and alt-right groups banned by youtube",
				"added": 1584220522
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1584244208_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [],
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 33,
				"body": "> [sheendocks](#comment_70_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): That would be a solution to Youtube or Netflix becoming burdened for sure but when we are talking about the ISPs being burdened by the traffic then zeronet, torrents etc will all be affected too.\n\ntrue. but with IFS you download content only one time...this will reduce traffic and maybe ISP will be saved? :D",
				"added": 1585038370
			},
			{
				"comment_id": 35,
				"body": "> [schiz0](#comment_110_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): It could be fantastic a lot of audio and video of this moment [...]\n\n...immaginavo fosse tuo! :D",
				"added": 1585056672
			}
		],
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": [
			{
				"comment_id": 39,
				"body": "10 years ago i was in contact with Jamendo italian moderation staff (a site that allow publishing music on CC licenses for free and manage incomes from CC music). This sites worked great (with millions of mp3 listened for some my friend musicians) but in 2011 the owner decide to bypass the merit of these artist by promoting guys that paid the platform to go in home page. This damnen the site and many musician with millions of views to the underground. At that time i tried to create with some others a new site similar to jamendo on Osiris - Serverless Portal System (an old P2P web hosting similar to zeronet) a site where anyone can bypass the merit, but i failed because the dev of the software abandoned the project.\n\nActually i'm posting some music created by these artists in 2011 on my IFS channel...but it will be great if we create all together a new community like the old Jamendo here!",
				"added": 1586253620
			},
			{
				"comment_id": 40,
				"body": "> [tajny2z](#comment_11_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): I feel your pain! If you are into retro art, here is zlink:RETROELEKTRO [...]\n\ni love this music. thanks! i will add these sites to my proxy as soon as i can!",
				"added": 1586253941
			},
			{
				"comment_id": 48,
				"body": "> [tajny2z](#comment_19_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): What a story! I can try to help you. My skills are basic image, video and advanced music production and intermediate programming. If it's to do with computer and music I am in.  [...]\n\ngreat! My idea is to create a new zerotalk for promoting new artists and upload music and other CC stuff on IFS for streaming and downloading. This should be simple and the zerotalk can be showed to the public by using the proxy. We can use Zerotalk++ instead the official zerotalk. What do you think?\n\nI'm also a doctor. In my opinion the actual lockdown in Italy is the only way to stop the virus...if we don't lock all we will have more and more death/infected like in US and Sweden. Is a difficult time but i totally agree with the gov in this decision (many friends are working in intensive care unit... and are telling to me that here is the hell)\n\nFor 5G question... i'm a nuclear medicine physician and i can guarantee that EM antennas can't do any damage to human body except \"maybe\" excessive heating in some cases where the source is very near to critical organs like genitalia (for example keeping the phone in a pocket near testicles), but for now we don't have strong evidences of this. I can't express an opinion about the economical question because i'm not an economist",
				"added": 1586364231
			},
			{
				"comment_id": 49,
				"body": "> [astrav](#comment_13_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Your profession is really interesting. Quick question: Are able to watch videos in English comfortably?\n\nyes",
				"added": 1586379452
			}
		],
		"1586280679_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [],
		"1585256129_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [],
		"1587415105_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT": [],
		"1587567790_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 57,
				"body": "if you have problem with the link above search for the streaming directly on the search page of streamz or await a moment",
				"added": 1587569597
			},
			{
				"comment_id": 58,
				"body": "i'm stopping the test now.  i will do a similar test without TOR. Definitively we need an audio streaming service like this! The devs of StreamZ are on zeronet now or abandoned?",
				"added": 1587576523
			},
			{
				"comment_id": 60,
				"body": "> [anshorei](#comment_86_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): The devs are still active in the Matrix chatrooms, not as active on ZeroNet itself though.\n\ni'm trying to install riot but for now i failed. someone can contact the devs?",
				"added": 1588176205
			},
			{
				"comment_id": 61,
				"body": "> [gitcenter](#comment_1366_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hello @zeroseed, I'm one of StreamZ devs. I'm not working on any of ZeroNet sites right now, but perhaps adding audio support wouldn't be difficult. Actually StreamZ is open-source, so it'd be cool if you managed to add audio support yourself. Currently I have another project I'm trying to work on full-time, but when I finish it I'll try adding audio support myself if no one else will have done it yet.\n\nUnfortunately i'm not able to manage code. Anyway thanks for the answer! I'm awaiting for you or someone else for this task...",
				"added": 1588445710
			},
			{
				"comment_id": 63,
				"body": "> [gitcenter](#comment_1369_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I thought I've published it already but it looks like I was mistaken. I can't add the repo right now but it'd be fine if someone else created the mirror.\n\ngive me the link and i will do it. why don't publish it on zeronet?",
				"added": 1588665668
			},
			{
				"comment_id": 64,
				"body": "already published on IFS! :) (only needs some time for seeding...now i'm seeding a great amount of CC music)\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g_item_262+type:archive",
				"added": 1588683577
			}
		],
		"1587637861_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 59,
				"body": "ok. test terminated.",
				"added": 1587651044
			}
		],
		"1588107464_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 62,
				"body": "this is a bad reality.... closed hardware in health caring bring to this and also to an hateful programmed obsolescence. You can't run for example an updated software on an older machine, instead you must buy newer ones all time! I see that things many times when i worked some years ago in some nuclear medicine departments. In theory you can use newer software also on old hardware to improve diagnosis accuracy...but you can't because all in these workstations is closed source and heavily protected,  can't be in-deep managed by users.",
				"added": 1588446541
			}
		],
		"1588684126_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 65,
				"body": "> [arione](#comment_6_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Could you provide a link to it?\n\nthis is a proposal for devs. this thing for now don't exist",
				"added": 1588684452
			},
			{
				"comment_id": 66,
				"body": "> [filips](#comment_447_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): ZeroNet is implemented in higher levels of network OSI model. It can work (almost) everywhere where TCP and UDP are supported. How it is implemented in lower/physical layers is not about ZeroNet but device or more low-level network programs. [...]\n\nok. how i can obtain this? there is a simple tool?",
				"added": 1588692258
			},
			{
				"comment_id": 69,
				"body": "> [styromaniac](#comment_2123_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Rispondi\n\nok. that means that the software can sync locally? i'm ignorant",
				"added": 1588755714
			}
		],
		"1588692906_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 67,
				"body": "> [sdfsdgasdew](#comment_58_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du): They r stupid .Once they saw the link 127.0.0.1 they considered it to be a torjan.\n\nvery ofter also only the link to zeronet.io cause fear :D",
				"added": 1588703040
			},
			{
				"comment_id": 68,
				"body": "> [edgelordofdecent](#comment_515_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Depends on where you discuss it.\n\ni discussed about IFS on famous piracy group forums... these people should be our \"allies\"...",
				"added": 1588708546
			}
		],
		"1588766786_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 70,
				"body": "> [littlepaw](#comment_43_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): Any sort of electronic music would do! Thanks~\n\nok. i'm uploading! Please anyone share your music on IFS! Make this network big!",
				"added": 1588771616
			},
			{
				"comment_id": 75,
				"body": "> [jesuschrist](#comment_6_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): What is the zite address? Is IFS the zite name or technology?\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:15f1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g",
				"added": 1589098278
			}
		],
		"1588862308_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 71,
				"body": "> [cexy](#comment_65_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): You are not serious. I was thinking that astronomers are needed here over last few days. What do you want to do and what do you need?\n\n:D :D :D For many years i analyzed medical images by using some software to find \"hidden informations\" in them. I want to try to do the same with images taken in other fields (very often medical images have a low resolution and are difficult to interpreter, i want try to resolve also this problem with this idea). more informations about these techniques here: https://en.wikipedia.org/wiki/Radiomics\n\nNone that i know on clearnet and real life are really interested and want to spent time on this...maybe here someone exist?",
				"added": 1588864399
			},
			{
				"comment_id": 72,
				"body": "> [astrav](#comment_57_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Do you have some photographs to share on zn?\n\ni think to use public domain pics like NASA ones...because of this i told astronomy. i can elaborate thse pics...but someone should tell what he see...i'm not an astronomer. any other public domain pic should be ok. i will upload thet with my elaborations on IFS",
				"added": 1588888147
			},
			{
				"comment_id": 73,
				"body": "> [a2llfd](#comment_13_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx): How about You displaying some code first and then people can evaluate, whether that project is even worth joining. Good software developers do not want to just work for free for someone else. You have to offer something in return and that something that GOOD software developers accept tends to be something other than social interaction and \"grand vision\". Sorry, no free work for You or for anybody else! We've got our own projects to work on already.\n\nMaybe i dont explain well. I dont write any code and i dont want to sell anything. I want only to try a software that i m using on medical images with non medical ones and publish result for free. You dont do anything... Only take these free data, use it and told me if that tech can be useful for you, sharing what you see to help me to understand what Im seeding on medical images elaborated in the same manner. (you can also take my free data and do all you want with them). Why Im doing this? Only for curiosità and to help società in general (the same motivation that bring me to create zeronet seedboxes and proxy). Not always good tech can create Money and not always what dont bring to personal gain is useful to society",
				"added": 1588932937
			},
			{
				"comment_id": 76,
				"body": "> [a2llfd](#comment_16_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx): What are You looking for from those medical images? What type of images are they? What's the purpose of the analysis? Please be more specific.\n\nthe main problem with radiomics is that we don't understand what all indicators that extrapolate from images \"means\". We call all these indicators \"inhomogeneity\" because \"inhomogeneity\" of tumor lesions correlate with prognosis (if a tumor is inhomogeneous is probably more aggressive) but standard deviation (SD) for example is totally different from entropy. These 2 indicators are both \"inhomogeneity\" indicators...but are totally different and we don't know how! To resolve that problem scientists now are using AI systems to correlate all these indicators (100+ variables calculated with different methods) to prognosis instead using the scientific method. Nowdays these  clinical studies have a very simple design: \ncollect data- > put in AI -> publish result! \n\ninstead  scientific method should:\ncollect data -> do an hypothesis -> create an experiment to confirm or reject it -> conclusions\n\nIf we don't know how an image with \"high entropy\" differs from another one with \"high SD\"...we can't do a proper hypothesis! (these hypothesis should be done by LOOKING IMAGES BEFORE CREATING THE EXPERIMENT!) Without a proper design all studies are failing when applied to specific patient, also because very often the sample used to extract data or train AI are biased and not homogeneous (different diseases included, different stages, low numerosity...you can see AI studies DONE WITH 10 (TEN) PATIENT published on journals with high impact factor!)\n\nMy proposal is to create parametric images where the distributions of this indicators are mapped to try to understand how these variables appears on common non-medical images and in known medical ones (free archives of astronomers are the best for doing this) to try to understand VISUALLY how indicators are affected from the appearance of the images used as input. Parametric images can be done pixel by pixel for example calculating SD from an area surrounding every pixel within a certain diameter (kernel). Obviously i can't analyze non medical images because i'm not a specialist of that images...but with the help of someone we can share the data and maybe i can answer my questions and who will help me can find novel data from the images that we will use that our methods will bring to the surface. all we can gain something by doing this!",
				"added": 1589100103
			},
			{
				"comment_id": 77,
				"body": "> [cexy](#comment_66_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): If you want I have ideas for a blog article or video about mars and earth secrets that most people don't know.\n\n...you can explain to me your ideas if you want and link me some images to analyze. use zeromail if you want to contact me in private",
				"added": 1589100166
			},
			{
				"comment_id": 81,
				"body": "Thanks for the answer. i'm happy to find people  that want to help me. thanks to zeronet this now is possible.\n\nAnyway as i told before i'm a doctor, not a programmer (and during the COVID emergency i must help patients before doing anything, i don't have time and energy to follow a too big project). I'm not able toi write code, but instead i learned during years of direct experience to use software already done by others in other fields to analyze medical data. I'm in contact with a medical department and maybe i can return to use its data or i can use also open data... these databases are HUGE but because of this have also a great amount of noise and covariates; i used for years statistical aproaches on these datasets, but to make them work i learned to use very clean samples taken by these big data. I can assure you that by doing this is possible to obtain very interesting results that average people don't see because are too lazy to create proper samples and design proper experiments. A statistical algorithm that i used very often to analyze brain imaging data was Statistical Parametric Mapping (SPM)\n\nhttps://www.fil.ion.ucl.ac.uk/spm/\n\nWhy we must re-invent the wheel when we already have it? Very important developers teams already working on this software and i can assure you that their commercial counterparts (also FDA approved) are often less efficient in clinical practise and also very expensive. For example NEUROSTAT and BRASS are commercial counterpart of SPM, the three softwares performs in the same way, but SPM is open source and can be \"modded\" also to perform other tasks with some hacking skills, ofter is sufficient to use non-standard datasets and templates, i did this for years.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19142712\n\nWith some \"hacking skills\" (not only on code, with \"hacking skills\" i mean any \"out of line\" idea) you can open new universes in image analisys without write a single line of code (or writing some few with little scripts that use API and functions from this softwares)\n\nFor example to do radiomics you can use a very simple software with an easy GUI called LifeX...or if you are able you can use also MATLAB equipped with a free library:\n\nhttps://lifexsoft.org/\n\nhttps://github.com/mvallieres/radiomics/tree/master/TextureToolbox",
				"added": 1589362512
			}
		],
		"1588888253_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 74,
				"body": "Ok. There is another International Version of zerotalk where i can continue to post after reaching the limit?",
				"added": 1588934373
			},
			{
				"comment_id": 78,
				"body": "> [zenanon](#comment_83_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Basically I can delete individual posts and it frees up some of my 50k: my used stat goes back down. If I could find all of my old posts on ZeroTalk I could delete them. Thought there might be an easy way to mass delete my posts to free room.\n\ni deleted all my oldest post. thanks! But the option to delete content should be more visible on zerotalk",
				"added": 1589102347
			}
		],
		"1579271298_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 79,
				"body": "use IFS:\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
				"added": 1589125896
			}
		],
		"1589122966_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 80,
				"body": "58% unitary (the central governament should have more power to local to improve local wellness and regulate foreign affairs)\n67% democratic (direct democracy is the best form of governament, but who have merit should guide a nation)\n72% globalist (we are citizens of the world but with different cultures that should be respected individually. sometimes \"globalism\" become \"colonialism\")\n60% pacifist (sometimes the force must be used to protect liberty and fight criminals)\n65% freedom (you're free when you allow the others to be free...the state must guarantee this without be a dictatorship)\n87% equality (private monopoly are the anti-chamber for dictatorship, expecially if manage natural monopolies like water, that should be public, but some market is useful to improve services and goods quality)\n60% secular (science make our society to progress, but science cannot exclude that don't exist anything \"bigger\" above our universe..if you think the contrary set up an experiment to demostrate this!. also some religious people are helping other people when some ateist are very egoistic)\n57% progress (good science canot be done without a good experiment design and good hypothesis, that are based on previous data. who use only inductive approaches are not a scientist)",
				"added": 1589131207
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 82,
				"body": "why you want to kill yourself? maybe talking with us could help you",
				"added": 1591185136
			}
		],
		"1598564669_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 83,
				"body": "> [kapec](#comment_42_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): It meant that I like his selection of sites on his proxy. And was wandering if he is taking submissions for new sites (for example a blog or WebLabel) to be featured on his proxy.\n\nI copy here the rules for hosting your zite on my new proxy (the same as the previous):\n\nThis is a preview with selected zites (all official zerotalks plus some other zites) created to show zeronet to the public. This is a read-only proxy and addictional zites cannot be added by users. Also ZeroID and login zites are blocked (you can't comment any zite by using the proxy, you should install zeronet in your pc/phone to do this). Private content zites like zeromail are also blocked.\n\nIf you want your zite added to this proxy it must respect these conditions, if this is the case post your link in a comment below:\n\nlegal content (no pedo, black markets, malware, piracy, racism, etc... the same rules of my seedbox are valid also here) no javascript cryptominers\nno image previews of user generated content (example: Millchan)\nno big files, no videos/audio files (this files use a large amount of bandwidth and can block the proxy)\nno private content (zites like zeromail) , cannot be managed by using the proxy.\nNo zites that allow user login in their code without using a third part service like ZeroID (example: Millchan)\n\nI will not discriminate any site for having different ideas from mine.\n\nIf you will see an illegal site in the proxy feel free to report it in this forum, i will remove it from the site.",
				"added": 1599127005
			},
			{
				"comment_id": 84,
				"body": "> [caropc1v22](#comment_3_1Mk11Va4hvFzWgfAhvyRJR4m6buvWENcBZ): add http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD\n\ni cannot add video sharing sites because this will saturate the proxy bandwidth",
				"added": 1599127110
			}
		],
		"1598385884_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa": [
			{
				"comment_id": 85,
				"body": "IFS (Intergalactic File Server) http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\nIFS Mobile (maintained by Storymaniac): http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/ :",
				"added": 1599127527
			}
		]
	},
	"comment_vote": {
		"91_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"26_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"4_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": 1
	}
}