{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565490001,
			"title": "Difference Millchan Merger and Millchan",
			"body": "So basically I found Millchan (http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/) and Millchan Merger (http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/).\n\nApparantly I need to find the boards for Millchan Merger myself but Millchan has them all already.\n\nAnother difference I found is that the boards aren't the same, the content that gets posted on them is different. Also, Millchan seems waaaay slower than Millchan Merger.\n\nWhich is the right one I should be using?",
			"added": 1565490000
		},
		{
			"topic_id": 1566174527,
			"title": "What kind of alcoholic beverage do you like?",
			"body": "Personally I really like whiskey (of course I started with Jack Daniels but recently I bought Monkey Shoulders, which is really good and not so expensive imo), beer and vodka (though I mostly only shot or mix it with orange juice for example).",
			"added": 1566174525
		}
	],
	"topic_vote": {
		"1558277346_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1558286606_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": 1,
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": 1,
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 26,
	"comment": {
		"1557652782_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": [
			{
				"comment_id": 1,
				"body": "yep same",
				"added": 1557679914
			}
		],
		"1557421253_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_298_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm curious about Qubes. What do people think about that OS?\n\nreally good regarding privacy but if you want to use resource-heavy things (e.g. gaming or stuff like that) you can basically forget about it",
				"added": 1557762167
			},
			{
				"comment_id": 3,
				"body": "> [insurgo](#comment_8_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Or dedicate a compatible graphic card (forget about nvidia) to a game qube and game on.https://www.qubes-os.org/faq/#can-i-run-applications-like-games-which-require-3d-support\n\ntrue but that means that you would need to get a second graphics card",
				"added": 1557762917
			}
		],
		"1558266064_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": [
			{
				"comment_id": 4,
				"body": "It's kinda like Tor and shit\n\nIt scares people off..\n\"Oh no Tor is that thing where you guys buy drugs and rape children!!\"\nYeah... humans are ignorant and stupid\n\nI think the worst argument I've ever heard is \"why would I use Tor / ZeroNet if I don't have anything to hide\"\n\nThis is exactly why we have such a bad image just because we actually have a brain and don't behave like these NPCs",
				"added": 1558279171
			},
			{
				"comment_id": 6,
				"body": "> [necrophcodr](#comment_1_1Mcuc9PBJGnBgYr2SMeLePxipeuETyzkLg): Using this does not make you any smarter than anyone else. People are not NPCs, and viewing them as such sure isn't helping furthering anyones cause here.\n\nMy point still stands though\nI know plenty of people with such an attitude and the way the media portrays Tor or any other \"Darknet\" is ridiculous and stupid.\n\nWhy would anybody use Tor / ZeroNet / i2p if the clearnet \"just werks\"? It's the same discussion with Linux vs Windows..\n\"Why would I want to install / learn Linux if Windows just werks and has all my games on it?\" \"They are selling my data to [insert advertisement company here]? Well I don't care, I have nothing to hide and I can just install an adblocker.\"\n\nAnd I know that the comparison between the ZeroNet discussion and the OS discussion doesn't really fit that well but I hope you understand what I'm saying. It's not that I don't want to bring people to use this network and stuff like that but I'm getting sick of the arguments they sometimes give",
				"added": 1558288754
			}
		],
		"1558168145_17TtMnYrVFMh1z7Bvn8QYPUyJ4zL9bhJk9": [
			{
				"comment_id": 5,
				"body": "You can do that or you can use another ID service\n\nThough not every zite allows other providers, ZeroTalk appearantly also supports kxoid.bit",
				"added": 1558279604
			}
		],
		"1558286606_1DUHekDkg6jJxQKGvAY2Hni5yNdTQwHuku": [
			{
				"comment_id": 7,
				"body": "Two possibilities:\n1. Make a backup of data/users.json and delete it. That way you can create a new ID but won't be able to use both at the same time (unless it's possible to manually add the lines back in)\n2. Create the new ID on a different \"ID zite\", like kxoid.bit. That way you can use both at the same time.",
				"added": 1558289009
			}
		],
		"1558362080_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY": [
			{
				"comment_id": 8,
				"body": "duckduck and startpage are both pretty good\n\nI think startpage uses google results, if you are more familiar with them..",
				"added": 1558368911
			}
		],
		"1558550634_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 9,
				"body": "I guess you could set Tor as the default browser",
				"added": 1558550678
			}
		],
		"1558942506_13BhjZ5yg4qJgM8EAtfTzjggoBkfKa5537": [
			{
				"comment_id": 10,
				"body": "7sd5rjd56ks4447kr5k7rs75k5rdk7",
				"added": 1558966980
			}
		],
		"1560002823_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs": [
			{
				"comment_id": 11,
				"body": "rip instantly snacked away",
				"added": 1560087132
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 12,
				"body": "> [anshorei](#comment_13_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): If you make a board, it's probably best to make a Millchan Engine board. [...]\n\n> Using Tor is probably your best option. I'm not using Tor Always mode, but I tend to stick to ZeroTalk, ZeroMe and people's blogs and I'm not too worried about doxxing. If you're hosting a zite that could make you a target for internet vigilantes it's probably best to enforce Tor and maybe disallow 3rd party scripts (or use TBB, though you'll have the white image bug on some zites like ZeroMe).\n\nDoes using Tor Always also make using a normal browser with Zeronet anonymous or does it only work with the TBB?",
				"added": 1565371926
			},
			{
				"comment_id": 13,
				"body": "> [anshorei](#comment_17_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Tor Always anonymizes all connections made by ZeroNet, there's a couple of deanonymization techniques that could still be used: [...]\n\nThanks! So basically TBB has some methods of preventing the 2nd and 3rd point (the first can't be fixed I assume as Zeronet needs JS).\n\nToo bad though, TBB always had issues with unifont characters which some zites often use :/",
				"added": 1565373202
			},
			{
				"comment_id": 14,
				"body": "> [nickwa](#comment_274_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): What's TBB?\n\nTor Browser Bundle",
				"added": 1565373870
			}
		],
		"1565373491_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 15,
				"body": "The programmers of that kind depend on either donations or on one-time-jobs they get from their own contacts.\nOr they just have a normal job.",
				"added": 1565373976
			},
			{
				"comment_id": 16,
				"body": "> [xlk](#comment_9_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Actually, I'm just curious how much it would cost to hire programmers to make an app like Fopnu or Zeronet for me.\n\nI'm not as experienced as they are but this whole Zeronet thing looks like really much work.\n\nYou could for example go to Zeronet's Github and look how long it took to get to a stable version and divide that into hours and give _at least_ minimum wage per hour.\n\nThis would be a really really rough calculation and you'd have to consider the breaks Zeronet had in the commit history, etc.\n\nBut in the end I have to agree with \n> [xcape2net](#comment_222_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Software engineers working for big companies generally earn somewhere between about $70,000 US and $150,000 US.  There are some earning less and some earning more.\nit depends on what area of software development (frontend, backend, blabla)",
				"added": 1565374938
			}
		],
		"1565490001_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 17,
				"body": "UPDATE:\nFound this topic http://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7/Millchan+merger+site\n\nApparantly the dev decided to keep both for now and Millchan is the \"original\" version with Millchan Merger using the new merging concept.",
				"added": 1565490453
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 18,
				"body": "https://dark.fail/\n\nIt's not that hard man",
				"added": 1566129647
			}
		],
		"1566174527_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 19,
				"body": "> [223556](#comment_169_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Waste of money and braincells tbh\n\nWell that may be true but I don't care enough to not buy alcohol. I DON'T drink every second day until I puke my brains out, it's just something I do a couple of times a month when I meet with friends. Or in the case of whiskey I sometimes drink a small amount in the evening to relax.\n\nOn the other hand I smoke too so yeah whatever",
				"added": 1566176381
			},
			{
				"comment_id": 20,
				"body": "> [sirlotaplot](#comment_4_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): Red wine, the proper drink for a knight in cum-stained armor.\n\nlol at least red wine. White wine tastes so disgusting to me..",
				"added": 1566176438
			}
		],
		"1566375802_1C7X6AtuFz4ARoxZAj1XaEjPprGoz6o2Vn": [
			{
				"comment_id": 21,
				"body": "Well first of all more corporations need to accept cryptos..\n\nWould also be nice if we had one really good developed crypto (e.g. not these huge transaction fees like on bitcoin, more privacy based like monero, etc.) that *everybody* agrees on to use.",
				"added": 1566416371
			},
			{
				"comment_id": 22,
				"body": "> [bigbadbob](#comment_391_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I would love to see some big corporations implode as well :)\n\nTrue but I was rather thinking about corporations that you buy things from\ne.g. Valve, Apple or even where you buy your groceries from\n\nOtherwise we simply can't use the cryptos without converting them back to fiat",
				"added": 1566487602
			}
		],
		"1569427205_1A1k72VXvb6h2eST6JV2kLS55PeEB6X5Eh": [
			{
				"comment_id": 23,
				"body": "Nice post. Upvoted!",
				"added": 1569450327
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 24,
				"body": "4chan",
				"added": 1569770516
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 25,
				"body": "pussy / ass\n\ntits are nice too, though I like them smaller rather than big\nthere's just something special about small tits",
				"added": 1570819730
			}
		]
	},
	"comment_vote": {}
}