{
	"next_post_id": 14,
	"next_comment_id": 3,
	"next_follow_id": 5,
	"avatar": "jpg",
	"user_name": "Space Punk",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Sex, Anarchy & Robots",
	"post": [
		{
			"post_id": 1572939537,
			"body": "Если вдруг кто-то хочет занять себя лонгридом, то держите пост с dtf который подробно описывает как мы должны были жить сейчас по версии классики киберпанка. Да, ноябрь 2019 года наступил, а репликантов мы к сожалению еще не научились делать, но ничего, подождем тогда уже 2049.\n\nhttps://dtf.ru/37794",
			"date_added": 1572939535
		},
		{
			"post_id": 1573401549,
			"body": "Специальный искусственный интеллект для анализа массивов научных данных был протестирован на астрономических объектах — Солнце и Марсе. Только на основе информации об их движении по небесной сфере Земли, нейросеть построила гелиоцентрическую модель Солнечной системы. Таким образом компьютерный алгоритм за несколько минут повторил достижения великих ученых прошлого, которые в течение всей своей жизни формулировали законы астрономии.\n\nКак пишет [Nature](https://www.nature.com/articles/d41586-019-03332-7), во время одного из тестов ИИ ему «скормили» информацию о том, как на небосводе движутся некоторые небесные тела. Это было аналогично тому, как астрономы и математики прошлого, используя доступные им примитивные инструменты пытались понять вселенную. Программа смогла построить гелиоцентрическую модель Солнечной системы без каких-либо подсказок или модификаций данных со стороны человека.",
			"date_added": 1573401546
		},
		{
			"post_id": 1573994328,
			"body": "https://www.youtube.com/watch?v=RD3zRxRUSoQ\nМетоды РЭБ в области космической навигации и обеспечение безопасности КА.",
			"date_added": 1573994324
		},
		{
			"post_id": 1574838854,
			"body": "Однажды Илон Маск пукнул в переговорной, так появился аромат Шанель номер 5.\nОднажды ракета Илона Маска вместо неба угодила в химзавод. Два дня полыхал очень красивый пожар, все фоткались и делали селфи на фоне огня. Одна пара даже поженилась и родила дочь Илону.\nОднажды Илон Маск приделал китайский аккумулятор к заднице пакистанского осла. Так появился первый Тесла-кроссовер. Миллион предзаказов в первые сутки!\nОднажды Илон Маск ударил женщину, и все феминистки закричали: так ее, Илон, заслужила, сучка!!\nОднажды Илон Маск прислал смску участникам «Синергии», и все, кто был в зале, даже Стивен Сигал, плакали от счастья.\nОднажды Илон Маск ел стейк из говядины, а рядом умилялись веганы и индусы: Илону можно.\nОднажды Илон Маск напился и зажал девушку в углу. И все начали ему писать в соцсетях: Илон, metoo, зажми меня тоже!\nОднажды Илон Маск запустил с ледяной горки мусорный контейнер, и все человечество взвыло! У него получилось! Запуск прошел успешно, космический туризм не за горами!\nОднажды Илон Маск отобрал у ребенка булку и съел ее сам. И все плакали от умиления и кричали: ешь, Илон, тебе нужны силы для новых свершений!\nОднажды Илон Маск повесил логотип Теслы на «Запорожец» и весь мир взвыл: багажник спереди, компактный размер, изысканный горбатый профиль – Илон, ты – гений!",
			"date_added": 1574838849
		},
		{
			"post_id": 1574849656,
			"body": "https://m.habr.com/ru/news/t/477556/\n\nРоссийский суд разрешил слежку за населением с использованием системы распознавания лиц.",
			"date_added": 1574849650
		},
		{
			"post_id": 1576064014,
			"body": "Вот сидишь такой, думаешь «Я офигенный программист, зарабатываю овер 100500к в секунду, сейчас напишу программу и все грузчики и таксисты потеряют работу и пойдут на биржу труда». Как внезапно, оказывается что ИИ в первую очередь займет высокооплачиваемые профессии, в которых заняты белые и азиатские мужчины. Об этом пишут в новом [исследовании](http://www.mercurynews.com/ai-to-affect-high-paying-jobs-held-by-bay-area-workers-the-most-studies-say) Брукингского института. Вот подстава, да? А вообще мысль не новая, попробуйте заменить всех работающих за гроши таксистов на авто-пилотируемые машины, это же как долго окупаться  будет? А вот всякие рыночные аналитики, менеджеры по продажам, программисты и просят за свой труд больше и работают зачастую за компьютером, так что работодатель заменит их на роботов при первой же возможности.",
			"date_added": 1576064007
		},
		{
			"post_id": 1576220668,
			"body": "[Рамблер решил присвоить веб-сервер nginx](https://www.ixbt.com/news/2019/12/12/rambler-reshil-prisvoit-vebserver-nginx.html)\n\nИсточники подтверждают, что в московском офисе разработчиков nginx проводят обыски в рамках возбужденного 4 декабря уголовного дела по статье 146 УК РФ «Нарушение авторских и смежных прав». Суть претензий сводится к тому, что Игорь Сысоев создавал nginx, работая в Рамблере, а когда инструмент стал популярен, он основал отдельную компанию nginx. Весной 2019 года её купила американская компания F5 Networks за 670 млн долларов.\n\nПо неподтверждённой информации, основатели компании nginx Игорь Сысоев и Максим Коновалов задержаны, остальные члены команды — нет.\n\nnginx — производительный веб-сервер (программа), способный обслуживать сайты с очень высокой нагрузкой и требующий меньше ресурсов, чем, например, Apache. По данным Netcraft, в августе 2019 nginx обслуживал 26% из миллиона самых популярных сайтов Сети.",
			"date_added": 1576220660
		},
		{
			"post_id": 1576576655,
			"body": "ИИ не может скрафтить алмаз в майнкрафте. Еще нужны доказательства что это игра для сверхразумов или иллюминатов?? Участникам конкурса [MineRL competition](http://minerl.io/competition/) поставили задание создать нейронку, которая сама должна обучаться тому чем занимается большинство школьников после уроков. И вот сюрприз, из 660 работ, ни один алгоритм не смог справиться с заданием в полной мере. И как многие заметили, такие результаты действительно удивляют на фоне ИИ который уже победил человека в шахматах, го и даже доте. Но дело в том что в конкурсе по майнкрафту участвовали в основном независимые команды и разработчики. У них не было столько данных и столько мощного железа как у гугловского DeepMind при тренировке того же AlphaGo, так что все еще упираемся в развитие железяк. \n\nhttps://www.theverge.com/2019/12/13/21020230/ai-minecraft-minerl-diamond-challenge-microsoft-reinforcement-learning",
			"date_added": 1576576646
		},
		{
			"post_id": 1578161674,
			"body": "Пару дней назад на медиуме бывший глава отдела международных отношений в Google написал свою историю работы в компании, о том как «приверженность правам человека» стоила ему карьеры. На протяжении всей статьи автор сетует на то как корпорация изменилась, мол раньше были «свобода, равенство, братство», а сейчас булинг и контракты с Китаем и Сауди. Интересная история получилась, почитайте. Если он искренен, то вырисовывается захватывающая драма: «столкновение принципиального человека верящего в хьюман райтс с ужасным корпоративным миром». Но я все таки оставляю возможность того что это просто предвыборная агитация, все таки из гугла уволили, вот человек и решил пойти на выборы от демократов. \n\nhttp://habr.com/ru/post/482860",
			"date_added": 1578161664
		},
		{
			"post_id": 1583918282,
			"body": "Роскомнадзор будет блокировать mesh-сети, I2P, TOR, TON, Freenet, Zeronet, anoNet. Купол окончательно захлопывается господа.\n\nКак следует из размещённого на сайте госзакупок контракта, подведомственный Роскомнадзору «Главный радиочастотный центр» заключил сделку с Российской академии наук на выполнение ряда работ стоимостью более 9 миллионов рублей.\n\nПри проведении работ должны быть разработаны комплексные рекомендации по ограничению доступа к запрещенной информации с использованием mesh-сетей (в контракте указаны Yggdrasill, cjDNS, Briar, Signal Offline, FireChat), I2P, TOR, Telegram Open Network, Freenet, Zeronet, anoNet, а также технологий и протоколов IoT\n\nОкончание работ – 30 июня 2020 года.\n\nhttps://zakupki.gov.ru/223/purchase/public/purchase/info/common-info.html?regNumber=32008950175",
			"date_added": 1583918271
		},
		{
			"post_id": 1586806716,
			"body": "В Wired неожиданная и мало кем замеченная программная статья нового мира: «Blind spots in location-tracking data can threaten both public health and human rights». Выключенная геолокация, то есть, нарушает права человека. Тут интересен не термин – «нарушение прав человека» это всегда эвфемизм для «опять меньшинствам не дали что-нибудь очень им нужное» –  а осторожные заходы в сторону будущего общественного отношения к большим данным. Не хочешь, чтобы за тобой следили? Как тебе не стыдно, разносчик чумы, убийца детей и бабушек! Аноним хуже Гитлера («When you ride untracked, you ride with Hitler»); государство, бедное, и так утомилось управлять гражданином, чтобы он не дай Бог не нанёс вреда себе и другим, а он еще и прячется, не хочет в статистику попадать. Не хочется ничего пророчить, но мы, по ходу, по аналогии с гибридной войной (государства модерна сообразили что для войны не требуется состояния войны) и гибридным поражением (это когда одна сверхдержава проиграла мировую войну другой, но формализованного поражения не было, поэтому платить репарации полагается вечно) наблюдаем рождение режима гибридного военного положения (когда состояния войны не требуется даже для введения военного положения со всеми его удобными фишками вроде усиления контроля и «как ты смеешь заикаться о своих интересах в такое тяжелое для страны время»). Предыдущий раунд был про борьбу с human trafficking и sexual abuse of minors – но заходы про «прайваси надо упразднить потому что прайваси позволяет педофилам измываться над детьми» мало кого убедили даже в Америке, стране деревенских пуритан-фетишистов. Вирус другое дело. Вирус это реально страшно, это очень глубоко прошитый ужас перед эпидемией. Теперь электронные пропуска для выхода в магазин и отказ от кэша ни у кого не вызывают особенных вопросов, наконец случилась полная и мгновенная легитимизация систем распознавания лиц, и вот выключенная геолокация в айфоне уже нарушает права человека. Ради всего святого, подумайте о детях и стариках! К сожалению, телефон можно пока оставить дома, но военно-рекламный комплекс и системообразующие предприятия (Facebook, Alphabet) наверняка уже работают над исправлением этой досадной оплошности. \n\nВ старом киберпанковом сеттинге Shadowrun люди, лишенные персонального номера и никак не включённые таким образом в систему больших данных, считались париями и были обречены в лучшем случае на полукриминальное существование. Наблюдать, как сбывается фикшен, забавно. Причём сбываются, что всегда приятно, не прогнозы «футурологов» с научными степенями, а веселый трешовый палп из 80-х. Burn your SINs.\n\nhttps://www.wired.com/story/big-data-could-undermine-the-covid-19-response/",
			"date_added": 1586806704
		},
		{
			"post_id": 1586888950,
			"body": "Алгоритмы могут захватить власть даже в предположительно свободных обществах, поскольку мы на личном опыте научимся доверять им все больше и больше дел, постепенно утрачивая способность самостоятельно принимать решения. Задумайтесь: всего за два десятка лет миллиарды людей научились доверять алгоритму Google решение одной из самых важных задач: поиска достоверной информации.\n\nМы больше не ищем информацию – мы «гуглим». И пока мы раз за разом полагаемся на Google, наша способность к самостоятельному поиску информации ослабевает. Уже сегодня «правдой» считается то, что попадает в верхние строки поисковой выдачи Google.\n\nНечто подобное происходит и с физическими возможностями, в частности с ориентацией на местности. Люди спрашивают дорогу у Google. Например, интуиция подсказывает водителю повернуть на перекрестке налево, но навигатор в Google Maps говорит: «Поверните направо». Поначалу водитель прислушивается к интуиции, поворачивает налево, попадает в пробку и пропускает важную встречу. В следующий раз он следует указанию Google, поворачивает направо и приезжает вовремя. Опыт приучает его доверять Google. Через год или два он уже слепо выполняет любые рекомендации Google Maps, а при поломке смартфона становится совершенно беспомощным.\n\nВ марте 2012 года в Австралии три японских туриста решили осмотреть маленький остров недалеко от берега и заехали на машине прямо в Тихий океан. Водитель, двадцатиоднолетний Юдзу Нода, впоследствии объяснил, что просто следовал указаниям системы GPS: «Она сказала нам, что мы можем ехать прямо туда. Навигатор говорил, что покажет нам дорогу. Мы чуть не утонули».\n\nВ нескольких аналогичных случаях люди въезжали в озеро или падали с разрушенного моста – вероятно, следуя инструкциям GPS-навигатора. Способность ориентироваться в пространстве подобна мышце – без тренировки она атрофируется. То же относится и к способности выбирать супруга или профессию.\n\nОтрывок из книги \"21 урок для XXI века\", Юваль Ной Харари",
			"date_added": 1586888937
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "А еще можно свой почтовый сервер поднять. Proton / Tutanota - код открытый.",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1576475983",
			"date_added": 1576576489
		},
		{
			"comment_id": 2,
			"body": "Есть стикеры, гифки, эмодзи, звонки и... видео-звонки. Правда не во всех мессенджерах.",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1576476076",
			"date_added": 1576576567
		}
	],
	"follow": [
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3",
			"user_name": "Maho911",
			"date_added": 1574933544
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "12ytyx8zmYMn58UavemioxPnMwaDNND3Ww",
			"user_name": "N3uronmaster",
			"date_added": 1576222612
		}
	]
}