{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1598581805,
			"title": "Something seems fishy here - Conspiracy afoot!",
			"body": "So, I have spent this evening bored out of my mind until I stumbled across this post: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb/Who+was+talking+shit+about+us+again\n\nAfter spending the past 2-3 hours analyzing all the related info and such it would seem there is definitely something fishy about zaron, kapec, geekless, and otbtechh22f4wcuo going on right now. It seems to me that these four IDs are playing a game of good cop bad cop in order to attract more business for otbtechh22f4wcuo. It is somewhat difficult to tell who is who, but I will say that it does seem that geekless and zaron have made posts indicating that they are very close with the ZeroTalk admin No fish, and otbtechh22f4wcuo seems to be using multiple IDs in an attempt to spread information regarding the Illuminati which in and of itself is a conspiracy theory.\n\nMy belief is that zaron/kapec/geekless are closely tied with ZeroNet's admin (NoFish,) and also I think that otbtechh22f4wcuo is an identity that they created as a sort of strawman to attack Donald Trump's campaign and also to convince ZeroTalk users that there is a need for censorship here. This is not acceptable whatsoever in my eyes since this is an abuse of the privilege of being so closely tied to a free speech platform's administration.\n\nYou will notice that after otbtechh22f4wcuo came around, there began talk of censorship here on a platform that was originally intended to be censorship resistant. This further adds to my belief that otbtechh22f4wcuo is being used as a way for NoFish/Kapec/Zaron/Geekless to manipulate the truth about what is happening. Zaron and Geekless claim the censorship is only to prevent \"spam\" and CP, but its funny how there was no mention of it until this otbtechh22f4wcuo character showed up on ZeroTalk. This makes me think they are simply trying to find ways to regulate information to skew the public opinion so as to influence their voting decisions just like other platforms such as Twitter and Facebook have been doing this past few months. \n\nIt seems to me as if all of these individuals may even conspiring to remove the freedom of speech aspect from ZeroTalk and simultaneously using otbtechh22f4wcuo as a strawman to influence public opinion and boost his sales since they are all likely close friends. Again, this is pretty much what Twitter and Facebook as well as all other mainstream media platforms are doing to influence voter opinion in America right now. Its just how politics seems to work anymore really!\n\nThese are just my thoughts after a few hours of reading up on what has transpired so far. I am very interested in what will come of this especially since most recently kapec threatened to essentially doxx otbtechh22f4wcuo. That's either a low blow or again as I said this is an attempt to convince their audience that censorship is needed on ZeroTalk.",
			"added": 1598581804
		}
	],
	"topic_vote": {
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"1598587925_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": 1,
		"1599173288_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1599727900_1MLMJkrjAE8msexWjjjTnQPcSAZvoCanSJ": 1,
		"1599735028_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1601562719_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1601719510_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR": 1,
		"1603350468_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh": 1,
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": 1
	},
	"next_comment_id": 67,
	"comment": {
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 1,
				"body": "> [kapec](#comment_36_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): And all sentences in all 5 previous posts ended in \"...\" or emoticon. But it's not the same person. It's purely coincidental.\n\nStfu kid. The guy clearly gives no shit about anonymity and all you are doing is feeding into his using this platform for free marketing. He literally acknowledges the fact that he doesn't care about his anonymity in his posts by prompting the readers to inquire with the FBI about him. So, he seems well aware that he is not fully anonymous. This seems more like he is performing an IQ test which you essentially failed miserably. \n\nYou literally just posted a link proving he has a business which you talked shit about, yet the majority of his customers are very please with him and his product. Stop being an arrogant fuck.\n\nAgain, take a step back and realized he just coaxed you into performing free advertising for his product through the use of psychology with which you are clearly not very well versed. Or maybe you are one of otbtechh22f4wcuo's alter egos? \n\nAt this point that kind of makes sense actually since you have taken the time to attack and threaten him in almost every post he has made here. You have the same temperament as he seems to have too, and so I think you are just otbtechh22f4wcuo in disguise to be honest.\n\nNice try, but I am not buying it.\nBetter luck next time.\n\n> [zaron](#comment_185_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Communists fight socialists, socialists fight capitalists. Who are you?\n\nObviously, you too are another one of otbtechh22f4wcuo's accounts. He seems to be using the tactic of having some of his accounts be extremely left-winged and the others extremely far-right in political views. This is likely being done to divide public opinion of him and make uncertain which side he actually stands on.\n\nAgain, nice try but I am not buying it.",
				"added": 1598577310
			}
		],
		"1598551981_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 2,
				"body": "Onionshare is good. It has been ported to the BSDs also and since more and more attacks are being designed to target the ever increasing number of linux users this is great news! ",
				"added": 1598577448
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 3,
				"body": "> [nekololi](#comment_480_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): you live in a much more fantastical world than the one i live in. also please include me in your theory.\n\nYou are new here as far as I am aware, but if your ID can be linked in any way to the others I most certainly will. I am going to begin running stylometric analysis on all future posts that seem suspect as is the case with otbtechh22f4wcuo, zaron, geekless, and kapec. Thugalicious mentioned it as a method to deanonymize persons. It is a largely ignored aspect of anonymity which has actually led to the ID of JK Rowling as the author of a previously anonymous work of literature she had written according to what I found after some research.\n\nGotta love technology huh?",
				"added": 1598586467
			},
			{
				"comment_id": 4,
				"body": "> [kapec](#comment_37_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'm flattered by your dedication, but why would a new user that started to post just yesterday would even care about some random drama on internet forum that happens all the time? Please explain.\n\nLol, looks like kapec decided to rope you into the conspiracy theory nekololi!! Guess you lucked out!",
				"added": 1598588061
			},
			{
				"comment_id": 6,
				"body": "> [thorburn](#comment_118_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): You also appear to be attempting to use ZN as a surveillance platform, with the intent to use that data to influence contributions and opinions of others. That in itself could be construed as a form of manipulation with a potential for a form of censorship. [...]\n\nSo, you mean to tell me that you are in support of the censorship of individuals who are skilled in psychological manipulation because these individuals are exceptionally talented at convincing weak minded individuals to take their side or otherwise perform actions against their own will? Its strange though since you say that moderation is also not censorship, but yet I feel that your statements prove the contrary to be true. You would be taking the same stance as the US Government who is now labeling conspiracy theorists as potential domestic threats. \n\n\"Moderating content\" of persons who have strong opinions that do not share your core beliefs is immoral and is actually a worse form of psychological manipulation because it takes no special skill to accomplish such a feat. At least the persons you seek to \"moderate\" have enough wits about them to bring people to their side as opposed to the rest of the people who are often refered to as \"sheep.\" \n\nYour \"moderation\" of such things indicates to me that you fear your opposition may gain the power that your group currently has and since power is addictive you will do what you must to maintain said power even if that means to infringe upon your opposition's right to freedom of speech and freedom of opinion. Both of which by the way are in fact covered by the Universal Declaration of Human Rights as inalienable rights. To \"moderate\" such content would be a violation of these basic human rights.",
				"added": 1598618865
			},
			{
				"comment_id": 8,
				"body": "> [thorburn](#comment_119_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): @krombopulusmike  [...]\n\nCash me outside.\n\nHow bout dat?",
				"added": 1598635514
			},
			{
				"comment_id": 10,
				"body": "> [nekololi](#comment_482_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): friend, i assure you my involvement in this conspiracy dates back to 2016 around the time i first came here. you'd be able to see this clearly if they didn't have sufficient time to cover up all the tracks leading to this otherwise obvious conclusion. you might have to dig a little deeper.\n\nI will do some digging as soon as possible. I am currently in the process of making a social network analysis chart for the purpose of collecting evidence. If your name comes up it will be added to the chart accordingly.\n \n> [zaron](#comment_186_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): hey! how did my name get in the middle of this?\n\nDon't do the crime if you can't do the time.\n\n> [xcape2net](#comment_784_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I have been a ZeroNet user for over a year now.  During that time, I've seen many, many users advocating censorship.  Fortunately, the power to change the ZeroNet code rests solely in the hands of nofish.  And, as far as I can tell, he has shown not the slightest sign of listening to any of them.  So, I really don't think any of us should be worried about facing any kind of censorship an time soon.\n\nI sure do hope not. But, either way I will be assembling (as I mentioned prior) a chart for the purpose of collecting evidence against the conspirators for future reference. The evil must be stopped from even being given a chance!\n\nThe chart will circulate and it will prevent all future oppressed people from ever having to do such investigative work in the future should something such as this come up again.\n\nIt is a shame this even has to be done.",
				"added": 1598678743
			},
			{
				"comment_id": 14,
				"body": "> [freemankind](#comment_29_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): otbtechh22f4wcuo lay off the crack\n\nLol, poor otbtechh22f4wcuo. Guy seriously comes on here trying to defend his and everyone else's rights to freedom of press/speech/expression, and all everyone does is attack him in as many ways as they can think.\n\nBunch of assholes on ZeroNet if you ask me. Makes me feel like less of an asshole myself, so I guess I can't complain too much about it. I just wonder how the rest of you sleep at night after attacking someone who is begging for help fighting injustice in the United States which we all know is far too rampant.",
				"added": 1599154031
			},
			{
				"comment_id": 16,
				"body": "> [freemankind](#comment_30_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): this guy is really on some serious drugs if he thinks satoshi and this Qanon nonsense is linked lol\n\nEither that or he's losing his mind of boredom due to the ongoing coronavirus restrictions that limit human interaction. The lockdown has caused a spike in mental health crises from what I understand. That's also possible, but either way I do agree with you that it is pretty obvious that Q and Satoshi are not the same individual and probably not even linked in anyway. It just doesn't add up.",
				"added": 1599231810
			},
			{
				"comment_id": 20,
				"body": "> [kaffie](#comment_1137_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): If you're so concerned about censorship on zerotalk then just clone it and post on your cloned zite.\n\nI suppose that would work.\n\nDon't see why not.\n\nUnless the lemmings show up.\n\nStupid fucking lemmings.\n\nSigh. Oh well. Lol.",
				"added": 1599529177
			},
			{
				"comment_id": 56,
				"body": "> [peppermintswirl](#comment_24_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx): The nature-- and beauty-- of ZeroNet means that It'll be extremely hard to do just that. Sure, if you're the owner of the site you could just take it down, but then there are thousands of clones out there from users already seeding or using their own version of this site. He could just get rid of the download link to the ZeroNet application but there'll be plenty of people with the application already installed on their desktop, so they can just distribute it around.\n\nLOL! We just went full circle...\n\nThanks for taking part in my PsyOp those who did!!! :) :) :)",
				"added": 1602993058
			}
		],
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": [
			{
				"comment_id": 5,
				"body": "> [nekololi](#comment_479_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): everyone has those bro they aren't rare\n\nLol!",
				"added": 1598594754
			}
		],
		"1598564669_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 7,
				"body": "Nice!",
				"added": 1598619170
			},
			{
				"comment_id": 9,
				"body": "> [kapec](#comment_40_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Nice list of safe sites you have there.Do you take submissions?\n\nThe hell this means?\n\nBeligerant internet thug talking shit again lol!",
				"added": 1598640065
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 11,
				"body": "I will.make sure full take down does not occur.\n\nThank you for advising me.",
				"added": 1598684962
			},
			{
				"comment_id": 12,
				"body": "> [thorburn](#comment_121_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Maybe the fediverse folk should establish a presence on F-droid and mount a massive awareness campaign to promote de-googling of android devices, and/or Linux phones? What we really need is a mass boycott of anything associated with google and the ABC cartel.\n\nAgreed",
				"added": 1598699663
			}
		],
		"1598893256_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": [
			{
				"comment_id": 13,
				"body": "> [marcusfinch](#comment_35_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): Another retard coming out of the cloud of CS gas.  I so wish they were using Zyklon B on you scumbags.\n\nI hear that Zyklon B cures COVID19.\n\nKek. ;-)",
				"added": 1599143157
			}
		],
		"1599173288_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 15,
				"body": "Doesn't mean the US NSA is going to stop breaking the law; just look at what happened between the NSA's earlier programs that were designed to protect human rights and privacy while still providing the necessary security for their country and what is happening with such surveillance today. The only thing that changes is the surveillance programs get less humane, and the consequences for whistleblowers become even worse everytime someone comes forward to expose the corruption they have identified.",
				"added": 1599231628
			},
			{
				"comment_id": 17,
				"body": "> [localghos](#comment_3_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj): Snowden showed incredible bravery in what he did, at extreme personal cost.\n\nMost Americans (especially those who had friends or family in the military) typically already had figured out most of what Snowden supposedly leaked. The only thing Snowden did was provide specifics for each program that was ongoing at the time. At the time of the Snowden leaks I was already 3 years into learning Information Security because I had enough information regarding the surveillance to know the importance of such things. Most Americans have been too lazy to have bothered to learn such things even until now, but it can be seen that more and more are realizing the need than ever before in the past few years or so. \nStill lacking though.\n\nAnyway. What I was getting at is that all Snowden's leaks did was threaten the safety of the United States as a whole which is generally seen as bad by a country's citizens, but good for its opposition. Unfortunately, due to brainwashing of the American youth by the far left, the younger generations see these leaks as \"good\" and they fail to understand how National Security works. Scary to the adults in the US right now that the youth is so clueless to the fact that they are literally rooting for America's opposing nation's success and simultaneously encouraging the failure of America as a country. Smh. \n\nThis has implications worldwide due to the fact that USA is such a powerful nation and global influence. **EXTRA EXTRA READ ALL ABT IT!!**",
				"added": 1599306195
			},
			{
				"comment_id": 19,
				"body": "> [anon45672997](#comment_4_1H5Hj9Q9RXFAWXaFvAAMLuQurxUmExxgci): Please stop confusing National Socialists with Communism. There is a big difference. Communists are the ones that want the surveillance state. The Nazis are all dead.Other than that, I agree 100%!Snowden is a Patriot!!!\n\nI support these statements! :)\n\nHowever, I believe we should go back to ThinThread type surveillance.... Much better than modern methods of mass surveillance. Required a judge to grant permission to decrypt logged data. As I said, it isn't totally wrong of the NSA to have done what they did, but their methods had been convoluted due to the influence of Israel and other Deep State actors of course. So, in that sense, yes Snowden is a Patriot indeed! \n\nBut, we will certainly have to, as Trump says, \"Drain the Swamp\" before this can effectively be done. Its only a matter of time though. We are close now!",
				"added": 1599527882
			},
			{
				"comment_id": 23,
				"body": "> [953gwpudtmsxjq4a](#comment_17_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp): Agreed. But does this matter? Will you ever trust your government again? [...]\n\nGood points.",
				"added": 1599559017
			},
			{
				"comment_id": 24,
				"body": "> [953gwpudtmsxjq4a](#comment_21_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp): I'm tired of giving a surveillance pass to left or right. The ONLY thing exceptional in US government is our Bill of Rights. Otherwise, our rascals are the same as anyone's rascals. Why I'm concerned at our failure. Our failure to identify these pricks and kill them - whatever the cost. Did you notice than former general Alexander just joined the board of directors at Amazon? Why are he and Clapper still alive?\n\nRight right. No, I did not but that is peculiar and noteworthy at very least. I see again where you are coming from here, but what to do. What to do?",
				"added": 1599728982
			}
		],
		"1599385493_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 18,
				"body": "So its similar to SearX except oriented for laymen who do not have the technical skills to actually be server administrators?",
				"added": 1599390395
			},
			{
				"comment_id": 21,
				"body": "> [thorburn](#comment_126_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I wouldn't say it's specifically aimed at laymen as it has some advanced functionality. Having said that it does seem to be aimed at a broad user base. I'm not familiar with SearX and YaCy is new to me so my opinion isn't worth a great deal to be honest.  [...]\n\nOk. I'll see what I can do to promote it. Thanks!\n\n> [bats](#comment_22_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): As a layman, here's my verdict:  The cpu consumption during crawling is too much! Seems a little presumptious for a piece of software to be that aggressive. Could be a bug of course. Guess I'll have another look in a year or two. [...]\n\nNice! Can't wait to have my own up and running just to be safe and certain of things! I <3 SearX!",
				"added": 1599529347
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 25,
				"body": "VPN #1 -> TOR -> Anonymous VPN -> Anonymous and Elite SOCKS5 Proxy (if necessary for task at hand.)\n\nWhy do people not understand how this works in 2020 still? Lol! Catch up! Haha.\n\nIf you are just using Tor in 2020, then you are most definitely not anonymous. If you are using VPN with Tor in 2020, then you are not very anonymous. If you use the VPN -> TOR --> VPN method I mentioned above in 2020, then you are as smart as the average bear. If you can use your own brain to figure out how International Law and Information Security works to prevent surveillance past these simple techniques, then you are smarter than the average bear. \n\nIf you can make money utilizing all of the above in 2020, then you are an absolute fucking genius.\n\nGood luck!",
				"added": 1599866948
			},
			{
				"comment_id": 26,
				"body": "> [fkdkuehilhf](#comment_4_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD): mmmh... yes! right! but would an additional or 2 additional VPN help against the ReCaptcha harassment? Probably not...\n\nWorks fine for me everyday for past 3 years now. If the second Anonymous VPN (paid for with Anonymous Cryptocurrency and No PII whatsoever) does not work, then you use the Anonymous Elite SOCKS5 Proxy and success should be around 99% or better as long as the proxy is clean and not blacklisted. If that fails, then purchase an Anonymous (use the same method as I recommend to purchase the second VPN account) VPS or RDP that has a clean IP and hosted in a friendly country with no Intelligence Sharing Agreement and it will be 99.9% success rate or above with 100% anonymity.\n\n> [fkdkuehilhf](#comment_5_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD): Another thing that struck me is that you have to register for every bullshit. Mostly with a \"recaptcha protected\" form with as much information as possible with subsequent confirmation by email or SMS\n\nYes, true. Anonymous Gmail Accounts and cell phone numbers can be obtained for such things if you have the right connections. The most difficult to obtain is anonymous SMS now though as Google Voice numbers no longer work in most cases. Where there is a will there is a way.> [driud](#comment_119_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): This is called total surveillance.They slowly get us used to it, and we agree to it, a little unknowingly and not consciously. A few people talk about it, and billions don't see any problem with it. They don't even know there's such a problem.Societies are messy, chemically. They are dull.This is a deliberate activity..To się nazywa totalna inwigilacja.Pomału nas przyzwyczajają, a my się na to zgadzamy, trochę bezwiednie i nie świadomie. Parę osób o tym mówi, a miliardy nie widzą żadnego w tym problemu. Oni nawet nie wiedzą że jest taki problem.Społeczeństwa są zaczadziałe, chemicznie.  Są przytępione.To jest celowa działalność.\n\nCorrect. They are attempting to slowly introduce what will be, in a sense, a unified world government of sorts which will largely be controlled by big businesses/corporations.",
				"added": 1599915647
			},
			{
				"comment_id": 27,
				"body": "> [driud](#comment_121_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): No, don't be the enemy; You just ignore them.Totally oil their distribution and services.The world is beautiful and kind.Live there..Nie, nie bądź wrogiem; Ty ich po prostu zignoruj.Totalnie olej ich dystrybucje i usługi.Świat jest piękny i życzliwy.Zamieszkaj Tam.\n\nAgree. Promote the alternatives. Kill them with kindness. Fire only makes more fire. Use Water, Earth, or Air to win with this fight. Special tactics are required against an adversary so technologically sophisticated. Be the good. Good always wins!\n\nIts _elementary_ My Dear Watson! :)",
				"added": 1599937993
			},
			{
				"comment_id": 28,
				"body": "> [driud](#comment_122_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): No, don't be good; Be painful to the pain.Always get your way. Let them know you are not a Lemming.Polite and courteous; -FUCK YOURSELF IN THE ASS-Choose that option that's good for-YOU-, not THEM..Nie, nie bądź dobry; Bądź upierdliwy do bólu.Zawsze postaw na swoim. Niech wiedzą, że nie jesteś Lemingiem.Grzecznie i uprzejmie; -WALCIE SIĘ SAMI W DUPĘ-Wybieraj tą opcję, dobrą dla -CIEBIE-, a nie dla NICH.\n\nAs I always say, in business there _is_ in fact a polite way of saying, \"fuck you.\" And, if you say \"fuck you\" politely, then you will likely here back a polite \"fuck you too!\" :)",
				"added": 1599945820
			},
			{
				"comment_id": 29,
				"body": "> [zeronetuser101](#comment_2_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD): the vpn at the end is pretty useless, especially if you use a sock.\n\nIt would be nice to explain your reasoning here seeing as you are objecting to some pretty well studied methods to obtain complete and total anonymity which are even rumored to be in use by government agencies right now. Lol, just saying.",
				"added": 1600625376
			},
			{
				"comment_id": 30,
				"body": "> [otbtechh22f4wcuo](#comment_25_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb): Probably just a kid who thinks he knows better than the experts lol [...]\n\nChildren shouldn't be on these sites...\n\nWhere are the parents? Smh.",
				"added": 1600635264
			},
			{
				"comment_id": 33,
				"body": "> [claude](#comment_15_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): Probably advocating for censorship like that one dude from a few days ago who wanted a default blocklist in ZeroNet and got dunked on in his thread. (The thread seems to have disappeared.)\n\nHeh. Sad, but true.",
				"added": 1600657486
			},
			{
				"comment_id": 38,
				"body": "> [kapec](#comment_60_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): We should have kid friendly sites. Just to promote content diversity so that one day zeronet can become a 1:1 internet replacement. Without generational change this place will die within single generation.\n\nDoubt it will die just like that with proper promotion, but proper promotion would incorporate those ideas so thank you!",
				"added": 1600722729
			}
		],
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 31,
				"body": "SearX...\n\nProblem solved...\n\nDDG in US Jurisdiction.\n\nUS Gov highly corrupt.\n\nThink 4 Self.\n\n+1 to driud.",
				"added": 1600650627
			}
		],
		"1600650663_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 32,
				"body": "Copy and paste.\n\nWhatcha tryna ask?\n\nRephrase that to make sense.\n\nPlz && Thanks.",
				"added": 1600650728
			},
			{
				"comment_id": 34,
				"body": "> [claude](#comment_14_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): The question was simple enough to understand.\n\nApologies. I was being a bit of a jackass there.\n\nI was in a bad mood earlier and was grumpy.\n\nNeeded food. \n\nI like your response though.",
				"added": 1600657932
			}
		],
		"1599735028_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 35,
				"body": "> [nonendoxic](#comment_2_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): Good. The world doesn't need hate or secrets. Out with the snakes I say.\n\nI'm about to come find you and transport you to the covid lockdown facilities in New Zealand and see how the fuck you feel about this topic after that; what in the absolute fuck is wrong with you?\n\nDo you by chance live in China where the CCP promotes such ways of thinking?",
				"added": 1600658197
			},
			{
				"comment_id": 39,
				"body": "> [anshorei](#comment_167_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Given enough data they can. Over time as you keep posting on ZeroNet you will reveal your speech patterns and bits of personal information (e.g. \"It's election time in my country again, fuck politicians\", \"It's raining outside\" or \"Friends took me to the movies yesterday, turns out movies are still shit.\"), with AI these can be correlated with data from other sources e.g. weather information, election dates, mobile phone coordinates, posts on other social media etc.\n\nThis user uses their brains! How rare! :)",
				"added": 1600995617
			},
			{
				"comment_id": 41,
				"body": "> [nonendoxic](#comment_7_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): Crackpots are the one's that shoot up places while screaming about conspiracies. Calm down.\n\nRight like the BLM supporters and BLM itself who seem to think there is racism toward blacks in America while promoting racism against whites. This is in spite of the fact that racism in America (at least the type BLM claims exists) has been virtually non-existent for decades now. Now, it is back BECAUSE OF the Black Lives Matter crowd.\n\nYet they seem to be protected under the law, soooo why shouldn't people have equal rights?\n\nYet another troll... Probably sent by Israel... Meh.\n\nShit like this is getting old.",
				"added": 1601144615
			}
		],
		"1600648926_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": [
			{
				"comment_id": 36,
				"body": "Anarchy was popular in the pop punk culture of the 1980s. So, that probably has a lot to do with it I am sure.",
				"added": 1600658355
			}
		],
		"1598301398_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 37,
				"body": "> [thorburn](#comment_117_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Gates needs a mental health check asap in the public interest. The level of his insanity is off the fucking charts! He clearly watched far too many James Bond and bad Sci-fi 'B' movies as a child.\n\nPsychopathy is found at greater rates in those at the top levels of an organization/company; Bill Gates just makes himself obvious to people such as ourselves. The problem is widespread throughout Corporate America though more hidden from the public's eye.\n\n> [nonendoxic](#comment_6_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): How is it that people still don't grasp what a quarantine is?\n\nA quarantine is defined as restricting the travel/movement of persons that have a contagious disease.\n\nMedical Tyranny is defined as controlling/manipulation entire civilizations under the guise that it is in the interest of public safety.",
				"added": 1600702466
			}
		],
		"1601060514_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 40,
				"body": "> [nonendoxic](#comment_8_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): There is no such thing as the illuminati you jackass.Originally it was a Bavarian society that promoted critical thinking and science that planned on infiltrating other fraternal orders with the intent of pushing them from nonsensical beliefs in the supernatural to reason and logic per the Age of Enlightenment, hence the name which means enlightened ones.It was outlawed in late in late 1700s because Bavaria banned all private fraternal organizations, most because of the crap private fraternal organizations were trying to pull with manipulating elections.It only got a bad rap because George Washington, the only religious extremist among the founding fathers (Google \"Ascension of George Washing\"), had a panic attack about atheism coming to America, and he wrote a shitty letter about the prospects of the Illuminati being among the ranks of his organization, the Freemasons.The only possible Illuminati member would have been Benjamin Franklin, but he wasn't an atheist, he was a Deist, and thought the Universe or Mathematics was \"God in Expression\".-Black Lives Matter is an organization that seeks to draw attention to racism issues in America.They are not part of the White, European Freemasons or Illuminati.As far as discussing Western Values, you're acting as if they're thousands of years old and any attempt to criticize Western Values is tantamount to evil intentions.Plenty of Western Philosopher have criticized Western ways of life, from Socrates and Diogenes to Descartes and Popper. In fact, almost any educated mind is aware of the flaws in Western Value Philsophy. [...]\n\nThis dude is either a troll (most likely) or genuinely retarded. Either way, my sympathies to those affected by his affliction.",
				"added": 1601076489
			}
		],
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 42,
				"body": "The NSA has been trying to identify the users of cryptocurrency since 2010 or so. Problem is that it isn't feasible to do this because non-government white hat hackers are smarter than the NSA and said hackers have a very good moral compass when put side by side with the NSA/CIA. \n\nThe IRS is even now as of last year asking about whether or not one has any dealings in cryptocurrency at all, but that seems to be a total invasion of privacy to many.\n\nLol, just my two cents.\n\nhttps://chipmixer.io/\nhttps://getmonero.org",
				"added": 1601577501
			}
		],
		"1601719510_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR": [
			{
				"comment_id": 43,
				"body": "Could be. Or maybe its Americans proxying through China knowing the current administration is not on good terms with them when means absolutely no cooperation between the two nation's intelligence agencies right now.\n\nI mean the CCP seems to want war with the US from what I have noticed, but they won't win it with bombs or anything and they know it. So, instead I have seen a trend of their country sending our people propaganda, drugs, and then blackmailing politicians to bring communist values into this country through the Democratic Party which is actually proving very effective in many regards. Sad to say.",
				"added": 1601749843
			},
			{
				"comment_id": 48,
				"body": "> [gandhi](#comment_8_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR): Do you know a single proxy in China? I dont!\n\nPlenty. I have been doing this longer than most people though, so there's that fact too. With a little effort it is possible to find totally anonymous proxies in China. Just have to use your noodle a lit man haha.",
				"added": 1601765379
			}
		],
		"1601724367_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 44,
				"body": "Thorburn: https://itnj.org/",
				"added": 1601750445
			},
			{
				"comment_id": 45,
				"body": "> [thorburn](#comment_157_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): @krombopulusmike thanks for that. I was a ware of the tribunal but hadn't seen their website. That's the kind of thing I mean. But it would be a central location for the public and reporters to post their evidence, naming and shaming as they go. That might give the traitors something to think about and inform the wider public.\n\nAhhh ok. I like that idea. I know a guy who was working on something like that last year actually now that I am thinking about it in the way you had in mind. It was pretty cool. Using a bulletin board software on the I2P network. The person explained I2P is way more secure than Tor, but also had the site available through the Tor Network until enough people found the site switched over. Explained how the server would be located in another country, Curacao maybe? \n\nSaid they have much stricter privacy laws than any other jurisdiction on Earth. Haven't verified that yet though.\n\nHis end goal was to allow the various people of the world a way to get together to bring massive social progress about in a rapid manner. He said something about how it would cause a massive uprising perhaps, but that once things calmed down society as a whole would begin to come together more and work toward fixing the corruption you are trying to bring light to as well.\n\nI love meeting people like that haha.\n\nAbstract thinkers.",
				"added": 1601756137
			}
		],
		"1601749775_19J2Ft42BgLYFGnSsSxHAzkHb2Uv8ZtCky": [
			{
				"comment_id": 46,
				"body": "> [ksnde](#comment_1_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Why do you ask it here with all of your regalies? And why do you live at the expense of your parents but you are a scientist and a specialist. Do you work for free? strange topic\n\nYeah, this sounds like a troll post to me.",
				"added": 1601759026
			},
			{
				"comment_id": 50,
				"body": "> [blkdissident](#comment_11_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): 3/10 troll post, could be more engaging\n\nLOL! xD",
				"added": 1601772219
			},
			{
				"comment_id": 52,
				"body": "> [kakasoleed](#comment_10_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR): his \"accomplice\" thing, let me a little bit dubious... what does he means... [...]\n\nThat was my initial thought lmfao!\n\n\n> [kakasoleed](#comment_10_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR): maybe his uncle is a prince :).\n\nOnly makes sense right? Lol!",
				"added": 1601810309
			}
		],
		"1601745437_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 47,
				"body": "Interesting",
				"added": 1601760196
			}
		],
		"1601047977_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 51,
				"body": "> [kapec](#comment_63_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Wear a face mask in public, thanks to a pandemic it's not considered weird anymore.\n\nTalked to a guy who used to work to develop the technologies that the AI uses to ID people. Says that a mask doesn't work; long story short.",
				"added": 1601773854
			}
		],
		"1601801657_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": [
			{
				"comment_id": 53,
				"body": "> [thorburn](#comment_160_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): There is the main factor \"the devaluation of truth\" and these Atlantic contributors are part of that movement to devalue the truth, as is the vast majority of the establishment media. [...]\n\nAgreed.",
				"added": 1601810379
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 54,
				"body": "> [ryuyu5](#comment_19_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS): May be because it sells?\n\nAnything that produces strong emotion sells.\n\nFear, lust, love, anger, happiness.",
				"added": 1602551202
			},
			{
				"comment_id": 58,
				"body": "> [qarmy](#comment_18_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Great. So now I am part of the stupid krombopulusmike conspiracy theory? [...]\n\nLOL!",
				"added": 1603370188
			}
		],
		"1602432068_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 55,
				"body": "> [apollyon094](#comment_4_18RcKVHULk9ctAGksWLPjqzqbFFvgp1t3P): The Democratic party is nowhere near socialist\n\nTheir candidate is sponsored by the Communist Party of America. Let's start there.\n\n> [ksnde](#comment_8_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): Socialism is not the point. Point is war policy, destructive foreign policy, pandemic, WHO sponsoring, the action of the elite for the elite, pedophilia, abortion. The world is tired of the Democrats and this bunch of people in power for 30 years, doing everything to destroy the world.\n\nCorrect.",
				"added": 1602551325
			}
		],
		"1603368333_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 57,
				"body": "New to me and I have been around a while.\n\nIt remotely rings a bell for some reason, but I am almost 100% certain I am thinking of another older rat with a similar name not the one you have mentioned here anyway.\n\nYou should reverse engineer it for us and provide a nice write up; or, just a link to the file in question so someone else can do so.",
				"added": 1603370155
			}
		],
		"1603368158_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 59,
				"body": "Learn to do things yourself. No one would be likely to help you do that for free since its kind of a dumb reason to hack someone bro.",
				"added": 1603370290
			}
		],
		"1603147210_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 60,
				"body": "> [ksnde](#comment_20_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): I can't to sent message to you in ZeroMail, but I have an one idea.Read this please first (Pubmed): https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2597487/And remeber about lection of Bill Gates for Pentagon about God gene. VideoAnd that the point! They want to impact to God gene for making people zombies. Nanoparticles used for transfer genes connecting to neurons! = Controlled consciousness.(sorry for my english)\n\nWhat the fuck does this have to do with Biden's connection to the Chinese Communist Party?",
				"added": 1603370360
			}
		],
		"1602235576_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 61,
				"body": "> [transcode001](#comment_1_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh): it'd appear they wish to unchain their moneyprinting. runaway hyperinflation may be on the horizon\n\nI heard talk of this back in March when the economy tanked. Bigger concern is privacy since cash is relatively anonymous and fungible, but these digital euros will not be so.",
				"added": 1603370460
			}
		],
		"1601914818_1HtdMXVRbEqpADNig6MvbCLQjuNzwDZHYg": [
			{
				"comment_id": 62,
				"body": "> [sh3d0w](#comment_3_1HtdMXVRbEqpADNig6MvbCLQjuNzwDZHYg): i wrote about finishing off relationships. If the guy odnt want to finish off i finish it.\n\nWtf?!?!",
				"added": 1603739960
			}
		],
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 63,
				"body": "Most very well connected people knew something bad was coming, but we didn't know that it would be catalyzed by COVID-19. One would almost have to choose to ignore all the signs indicating a very bad thing was coming, and even more blind to not realize a massive shift in powers was underway prior to covid-19. The biggest indicator was the massive loss of freedoms in the United States as well as the increasing surveillance state. Now, with the widespread use of anonymity networks, it is very easy to obtain information from abroad which can give great insight into things going on external to the US that would serve as indicators of how deep the corruption goes around the world.\n\nOccupy Movement\nPanama Papers\nWikileaks\nSnowden Revelations\n\nAll just signs that the times were changing very rapidly... Not to mention the massive amount of disinformation, propaganda, and PsyOps that were going on more and more prevalently than ever before just prior to covid-19 which failed to adequately mask the corruption.\n\nWe knew something was going to give eventually, and the elites were going to try to find a way to cover it all up and maintain some sense of order and control. Their response was a staged pandemic; whether or not you believe in this theory is up to you, but for most of us on here I feel that it is pretty cut and dry.",
				"added": 1605556877
			}
		],
		"1605530541_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 64,
				"body": "> [anonynous38883](#comment_11_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): use whonix and all pass by tor to use zeronet and whonix say No ip leak possible ... you can add Router vpn , and take out of your computer Wlan card to have wifi , Mic and camera .. use only cable network to multiple Device to pass your internet over vpn ,tor etc.\n\nExactly. The rest of the discussion is relatively pointless these things factored in. Just practice good operational security and you'll be fine.\n\nInstructions are on https://whonix.org on how to practice good operational security. I do appreciate your insight on the newer Tor Alternatives though as such are long overdue!",
				"added": 1605558945
			},
			{
				"comment_id": 65,
				"body": "> [diurpagissa](#comment_9_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): I post this for debate and improvement not for being called names!\n\nRight right. Thank you Again as you have given me some thoughts too. Can we set up a ZeroNet to operate over I2P for example? I like where you are coming from, just please ignore those calling names. It will be okay. There are mean people everywhere of course, but the wise will listen.",
				"added": 1605561033
			},
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_2704_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Think twice about the info you spread, then.\n\nFake news can be detrimental to our cause, but censoring fake news or attempting to censor fake news is equally detrimental. Its a two way street here: diurpagissa can speak his mind and styromaniac can provide CONSTRUCTIVE criticism. We are all adults here (I hope.)\n\nIt is very obvious ZeroNet is not a HoneyPot. But, rather, uneducated users of ZeroNet have fallen prey to intelligence agencies. Happens on the clearweb and DeepWeb alllll the time!!",
				"added": 1605562883
			}
		]
	},
	"comment_vote": {
		"14_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": 1,
		"121_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"35_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"7_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"21_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"4_1H5Hj9Q9RXFAWXaFvAAMLuQurxUmExxgci": 1,
		"126_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"22_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"18_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"117_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"5_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"6_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"17_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"19_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp": 1,
		"486_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"119_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"120_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"4_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"5_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"7_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"54_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"121_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"133_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"135_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"25_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": 1,
		"130_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"5_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": 1,
		"15_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"6_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": 1,
		"60_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"165_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"167_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"654_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"144_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"50_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"2_1EqTcHCX5RGK35NgnwXPcCHjKF6o3MGzA1": 1,
		"9_1GmeqFDH3CreaouRZZeg3WuC3JY1mRmXmr": 1,
		"13_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"134_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"133_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"791_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"12_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"600_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"147_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"135_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"29_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"149_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR": 1,
		"150_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"154_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"155_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"156_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"157_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"158_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"11_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN": 1,
		"1_14R8NGXDuP5koiN9SV1cnkRFx4fqorAS4g": 1,
		"13_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"159_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"14_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": 1,
		"10_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR": 1,
		"160_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"161_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"4_116EQBujbsogJRh72LXNtMSmLbUK2Y3V57": 1,
		"62_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"19_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS": 1,
		"8_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"103_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"7_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"36_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"1402_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh": 1,
		"71_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"2669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"33_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"2_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib": 1,
		"11_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"10_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2": 1,
		"3_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": 1
	}
}