{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1544934587,
			"title": "Jesus Christ of Nazareth is the Son of God",
			"body": "The Plan of Salvation\nby Wayne D. Turner\nFrom BibleTrack\nCopyright 2013\n\nSalvation is the supernatural act of God whereby we are born again (spiritually) into the Body of Christ. Salvation is not acquired through good deeds as so many believe, but rather through faith in the finished work of Jesus Christ on the cross.\n\nIn John 3, a very religious leader of the Jews came to Jesus to inquire. Jesus told this man in John 3:3, “Most assuredly, I say to you, unless one is born again, he cannot see the kingdom of God.” There, Jesus described the process one must undergo to acquire eternal life as being \"born again.\" So, salvation is not acquired through being good or going to church—or even giving to the church. Salvation (eternal life) is all about being \"born again.\"\n\nWith that overview, let's fill in some detail. Before one can be \"born again,\" it is necessary for that person to recognize the need for salvation. That need is defined in scripture—in Romans 3. There, in verse 10, we are told, \"There is none righteous, no, not one.\" Down in verse 23 we read, \"for all have sinned and fall short of the glory of God.\" Here it is in a nutshell: We are all sinners in need of salvation.\n\nHaving established that we are all sinners, what's the big deal? The big deal is found in Romans 6:23 where we are told, \"For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\" Now you might say, \"Well, everyone dies!\" Yes, but this is talking about spiritual death, not merely physical death. We know that to be the case because of the reference to \"eternal life\" (spiritual life) in the remainder of that verse. So, because of our sin, we deserve eternal spiritual death.\n\n\"What's the remedy?\" you might ask. It's found in Romans 5:8, \"But God demonstrates His own love toward us, in that while we were still sinners, Christ died for us.\" II Corinthians 5:21 says it like this, \"For He made Him who knew no sin to be sin for us, that we might become the righteousness of God in Him.\" In other words, Jesus Christ was born and lived as the perfect man—a man who had no sin—a man who had no need to pay the penalty of sin…spiritual death. Yet, Jesus died a sacrificial death on the cross on our behalf. Because of this sacrificial death on the cross, we can be exempted from the penalty of sin—spiritual death.\n\nThat brings us to the action item: How does one appropriate this eternal life for oneself? Jesus said in John 6:44, \"No one can come to Me unless the Father who sent Me draws him; and I will raise him up at the last day.\" The Holy Spirit of God draws people to Jesus Christ upon hearing a presentation of God's Word regarding salvation. Romans 10:17 says, \"So then faith comes by hearing, and hearing by the word of God.\"\n\nSo, if you understand that you are a sinner and have no ability to save yourself from eternal death, and if you understand that Jesus Christ paid your penalty for sin, then you are a candidate for salvation. If the Holy Spirit is convicting you of your need to be saved as you read this, Here's the action item in Romans 10:13, \"For whoever calls on the name of the LORD shall be saved.\" In prayer, receive Jesus Christ as your personal savior—your only means to eternal life. In so doing, you are \"born again\" by the Holy Spirit and become part of God's family. We often refer to that as being \"saved\" or \"becoming a Christian.\"\n\nFrom time to time I meet someone who tells me that they do that frequently. Well, that's missing the point. Once a person has been born again, they become part of God's family. It's a one-time induction into God's family—no need to continually rejoin God's family. Jesus explained it this way in John 5:24, \"Most assuredly, I say to you, he who hears My word and believes in Him who sent Me has everlasting life, and shall not come into judgment, but has passed from death into life.\" Eternal life is eternal. Having been \"born again,\" you have eternally become part of God's family.\nAnd that's what the Bible defines as the means to eternal life.",
			"added": 1544934586
		},
		{
			"topic_id": 1544935619,
			"title": "Open source education system",
			"body": "Any truly free, high quality certification/degree training as a university system overhaul/replacement? Tired of liberal/jesuit indoctrination of wide eyed college students. We need a free, open source, accredited education platform. We have the entire world at our finger tips. Let's take advantage of it. I am a Mathematics/Engineering high school teacher.",
			"added": 1544935617
		}
	],
	"topic_vote": {
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": 1,
		"1544934587_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr": 1
	},
	"next_comment_id": 11,
	"comment": {
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 1,
				"body": "Hello world",
				"added": 1544932074
			},
			{
				"comment_id": 2,
				"body": "Hello world",
				"added": 1544932081
			},
			{
				"comment_id": 3,
				"body": "Hello world",
				"added": 1544932095
			},
			{
				"comment_id": 4,
				"body": "Using Samsung note8. Great so far",
				"added": 1544932163
			}
		],
		"1544866769_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 5,
				"body": "What is up with the witch stuff? Red hoods? What is the point of the yellow vests now? A goal in mind? American here just looking to pray for the people of Europe. Satanic suppression and Islamic infiltration has run rampant. Jesus Christ of Nazareth is the only true path to eternal freedom.",
				"added": 1544932647
			}
		],
		"1544560849_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 6,
				"body": "I am Nathanking on gab\nAll 4 of my twitter accounts have been suspended.\nFor posting this...\nhttps://www.bitchute.com/video/dEZgzABhjXsJ",
				"added": 1544932748
			},
			{
				"comment_id": 7,
				"body": "> [pussyslayer](#comment_1_15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k): Gab is dying, and it's owner is an abject grifter.\n\nDisagree. Gab is rocking it right now. It all depends on who you follow. Btw torba is an amazing leader.",
				"added": 1544932830
			},
			{
				"comment_id": 8,
				"body": "> [psybin](#comment_7_1FEureQqgUD5PLLxvaMWajQUzfzRAwJ4UE): That's a good vid, so I guess it's to be expected at this point.. still gotta try though. I still use Twatter but I'm getting sick of it. I'm mainly on Minds but I do have a Gab account. I need to be more active there. If anyone wants to add me, I'm Psybin on both sites.\n\nSee you at gab. I am Nathanking there.",
				"added": 1544934200
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 9,
				"body": "My username on gab is NathanKing\nI welcome any zeronet users... Like minded\nLet's not waste our chance to speak freely on zeronet this is a gift from the God of heaven to humanity.",
				"added": 1544934816
			}
		],
		"1544935619_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr": [
			{
				"comment_id": 10,
				"body": "Even Khan Academy promotes fake liberal neutered history. Math is the only uncompromised science as far as staying disconnected from \"evolution\" and social justice. Just looking for a good place to begin a education system that is accessible and affordable and allows for credits toward a degree or certification. Homeschool style truth filled learning platform.",
				"added": 1544995054
			}
		]
	},
	"comment_vote": {}
}