{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Lacement d'un ZeroBlog",
			"body": "Voici un petit zeroblog afin d'enrichir avec modestie la communauté francophone.\nhttp://127.0.0.1:43110/1spiRicHqpAridfD6cRm2VVanD6SGZvzY/\nAu programme :\nSpiritualité, informatique et pourquoi les deux fusionnent.",
			"added": 1598276081
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 1,
				"body": "Il ne faut pas avoir une vision trop étriquée non plus...\nJ'étais souffrant, bourré de medocs légaux mais qui pourtant me collaient le cerveau en vrac, me coupaient toute capacité à faire quelque-chose de ma vie, me rendaient méchant et petit à petit complètement à côté de la plaque; m'en sevrer prennait des mois !\nJ'ai tout viré, ayant remplacé tout ça uniquement par du cannabis, de très grosses doses, car se soigner avec de la weed ce n'est pas si facile et simple, tout l'enjeu réside dans le fait de pouvoir en prendre des doses assez conséquentes pour être efficaces quand on souffre beaucoup et donc de concentrer les principes actifs et en consommer par tous les moyens possibles et les plus sains possibles.\nQuand enfin la médecine (incapable médecine occidentale) à trouvé ce que j'avais après plus de 20 ans de calvaire, il m'a fallu seulement 3 semaines pour arrêter le cannabis...\nEt avant ça j'avais réussi à retrouver de l'activité avec ma famille et j'étais redevenu quelqu'un de bon et agréable.\nAlors il y a peut-être les drogués, mais il y a aussi surtout tous ceux qui utilisent le cannabis comme moyen thérapeuthique, il ne faut surtout pas les oublier !\nLe cannabis n'a presque que des vertus si on le compare à la pharmacopé occidentale, composée de drogues, certes légales, mais toutes plus mauvaises les unes que les autres pour l'organisme et la psychée.",
				"added": 1598211816
			},
			{
				"comment_id": 6,
				"body": "D'où l'intérêt de séparer usage du cannabis récréatif et usage thérapeutique.\nLe premier usage peut détruire des vies, le second en sauver.\nTu ne connais rien de mon discours car tu ne me connais pas et visiblement tu ne prends même pas le temps de regarder le vécu que j'expose rapidement et qui ne fait qu'un avec celui-ci.\nSans le cannabis je ne serais plus là aujourd'hui !\nAttention aux amalgames et aux raccourcis quand même.\nJe ne peux que dissuader quelqu'un de prendre du cannabis de manière récréative s'il ne sait pas exactement dans quoi il s'embarque et s'il peut gérer.\nPar contre niveau médical je ne peux qu'encourager ceux qui prennent des antalgique à forte dose, des antidépresseur, calmants ou qui galère avec des sclérose en plaque, spasmes musculaires et bien d'autres maladies merdiques à essayer et voir si cela leur convient ou pas.\nBien sûr avec toutes les précautions qui vont avec, car tout le monde ne supporte pas.\nTout ce que je peux dire c'est que si j'avais continué les opiacés, la codéïne, la morphine et autres merdes prescrites en masse par les médecins je serais mort ou dans tous les cas encore dedans jusqu'au cou.\nAlors que le cannabis j'en suis sortie en 3 semaines.\nMais encore une fois je parle d'un usage thérapeutique face à des douleurs énormes et des spasmes musculaires à foison, à tel point que je ne dormais plus.\nLe cerveau ne construit pas du tout les mêmes choses dans une telle situation.\nD'ailleurs dès que les problèmes de santé se sont atténués j'ai du arrêter rapidement car les effets étaient violents et mon psychisme ne supportait pas. Alors que lorsque j'en avais besoin pour lutter contre la maladie je pouvais prendre des doses que même les gros consommateurs récréatifs ne prennent pas.\nC'est vraiment deux mondes différents.\nMes messages visent uniquement à ce que l'amalgame ne soit pas fait.\nPour avoir bossé à fond le sujet, il faut savoir que dans de nombreux pays de nombreux chercheurs et médecins réclament le droit d'utiliser cette plante, parlant même du médicament du 21eme siècle.\nCar comparé à ce qu'ils ont le droit d'utiliser sans restriction il n'y a pas photo sur les effets indésirables ni sur les capacité à soigner de nombreuses pathologies.\nFaut quand même se rendre compte qu'en occident on drogue les gens à tout va avec des drogues très dures vendues en pharmacie !!!\nAujourd'hui dès que t'as un peu mal on te colle une pompe à morphine à l'hopitale, c'est quand même grave...",
				"added": 1598232343
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 2,
				"body": "Salut,\nSi je comprends bien on est une douzaine alors maintenant. ;)\nune hausse de 20% c'est ENORME ! :P",
				"added": 1598212728
			}
		],
		"2_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 3,
				"body": "Je regarde par la fenêtre, je vais me promener en méditant, je discute avec tout le monde.\nSinon sur youtube : Médiapart de temps à autre, LeMedia un peu plus régulièrement pour les invités principalement, thinkerview qu'il ne faut surtout pas louper ! Troublefait aussi, car le petit gars à des couilles et une analyse assez bonne, de plus il fait un sacré boulot.\nEt plus généralement tout ce qui accroche le regard, à tendence anarchiste si possible, avec toujours un esprit le plus critique possible.",
				"added": 1598213369
			}
		],
		"1_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 4,
				"body": "Bonjour,\nPour, c'est le minimum pour pouvoir parler de démocratie.\nEn attendant personnellement je suis devenu conseiller dans ma commune, vu que c'est un petit village il faut bien que quelqu'un s'y colle et au moins c'est déjà un commencement pour prendre les décisions de manière démocratique (vote au sein du conseil), au moins au niveau de notre commune, en faisant du mieux possible avec toutes les contraintes imposées par le gouvernement et l'administration.\nL'autre moyen d'agir maintenant c'est tout simplement notre consommation.",
				"added": 1598214369
			}
		],
		"2_1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u": [
			{
				"comment_id": 5,
				"body": "Bonjour,\nCe sont des hackers à la base.\nTrès bonne initiative à suivre absolument, leurs interviews sont excellentes.",
				"added": 1598215317
			}
		],
		"1_13AndTmoYPyXyvsNHk5QftQL96jpqa8d3Q": [
			{
				"comment_id": 7,
				"body": "> [xerthes](#comment_1_13AndTmoYPyXyvsNHk5QftQL96jpqa8d3Q): Bien vu ! J'ai fouiller sur leur Github pour l'instant sa fonctionne bien j'ai l'impression mais j'ai omis de dire que j'avais iOS... On attendra\n\nPersonne n'est parfait. ;P",
				"added": 1598281036
			},
			{
				"comment_id": 8,
				"body": "> [garage472](#comment_1_1HQ1FF2MHpdagL73jjmeGarYAG78XqPJBP): Moi pour ma part j'utilise raspberry pi 4 8GB . Le nouvelle version . Et je dois dire honnetement que je suis surpris . ça me donne le gout d'augmenté la mémoire pour en faire un proxy permanent .\n\nSalut, tu n'as pas assez avec 8Go de ram ?! Je n'en ai pas autant sur mon ordi et pourtant c'est mon outil de travail en plus du reste, c'est surprenant...",
				"added": 1599329071
			},
			{
				"comment_id": 9,
				"body": "Sur mobile android ça fonctionne bien, sauf pour le faire fonctionner avec tor browser mobile, pas moyen de trouver comment configurer le browser convenablement...",
				"added": 1599329147
			}
		],
		"4_18QJHpnhj9ZPt6Un23MaZH8MGmzbt9ffaw": [
			{
				"comment_id": 10,
				"body": "Il est tellement mou qu'il te sort même par la bouche...",
				"added": 1600493944
			}
		]
	},
	"comment_vote": {}
}