{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 37,
	"comment": {
		"1579524634_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 1,
				"body": "I think that viking rape culture should be annihilated from the surface of the earth and mankind memory.",
				"added": 1579524773
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "why and how did it promulgated the viking rape culture recently?",
				"added": 1579524825
			}
		],
		"1583559326_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 3,
				"body": "1:1 In the beginning God created the heaven and the earth.\n\n1:2 And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon the face of the waters.\n\n1:3 And God said, Let there be light: and there was light.\n\n1:4 And God saw the light, that it was good: and God divided the light from the darkness.\n\n1:5 And God called the light Day, and the darkness he called Night. And the evening and the morning were the first day.\n\n1:6 And God said, Let there be a firmament in the midst of the waters, and let it divide the waters from the waters.\n\n1:7 And God made the firmament, and divided the waters which were under the firmament from the waters which were above the firmament: and it was so.\n\n1:8 And God called the firmament Heaven. And the evening and the morning were the second day.\n\n1:9 And God said, Let the waters under the heaven be gathered together unto one place, and let the dry land appear: and it was so.\n\n1:10 And God called the dry land Earth; and the gathering together of the waters called he Seas: and God saw that it was good.\n\n1:11 And God said, Let the earth bring forth grass, the herb yielding seed, and the fruit tree yielding fruit after his kind, whose seed is in itself, upon the earth: and it was so.\n\n1:12 And the earth brought forth grass, and herb yielding seed after his kind, and the tree yielding fruit, whose seed was in itself, after his kind: and God saw that it was good.\n\n1:13 And the evening and the morning were the third day.\n\n1:14 And God said, Let there be lights in the firmament of the heaven to divide the day from the night; and let them be for signs, and for seasons, and for days, and years: 1:15 And let them be for lights in the firmament of the heaven to give light upon the earth: and it was so.\n\n1:16 And God made two great lights; the greater light to rule the day, and the lesser light to rule the night: he made the stars also.\n\n1:17 And God set them in the firmament of the heaven to give light upon the earth, 1:18 And to rule over the day and over the night, and to divide the light from the darkness: and God saw that it was good.\n\n1:19 And the evening and the morning were the fourth day.\n\n1:20 And God said, Let the waters bring forth abundantly the moving creature that hath life, and fowl that may fly above the earth in the open firmament of heaven.\n\n1:21 And God created great whales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind: and God saw that it was good.\n\n1:22 And God blessed them, saying, Be fruitful, and multiply, and fill the waters in the seas, and let fowl multiply in the earth.\n\n1:23 And the evening and the morning were the fifth day.\n\n1:24 And God said, Let the earth bring forth the living creature after his kind, cattle, and creeping thing, and beast of the earth after his kind: and it was so.\n\n1:25 And God made the beast of the earth after his kind, and cattle after their kind, and every thing that creepeth upon the earth after his kind: and God saw that it was good.\n\n1:26 And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\n\n1:27 So God created man in his own image, in the image of God created he him; male and female created he them.\n\n1:28 And God blessed them, and God said unto them, Be fruitful, and multiply, and replenish the earth, and subdue it: and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.\n\n1:29 And God said, Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree, in the which is the fruit of a tree yielding seed; to you it shall be for meat.\n\n1:30 And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, wherein there is life, I have given every green herb for meat: and it was so.\n\n1:31 And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.\n\n2:1 Thus the heavens and the earth were finished, and all the host of them.\n\n2:2 And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made.\n\n2:3 And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.\n\n2:4 These are the generations of the heavens and of the earth when they were created, in the day that the LORD God made the earth and the heavens, 2:5 And every plant of the field before it was in the earth, and every herb of the field before it grew: for the LORD God had not caused it to rain upon the earth, and there was not a man to till the ground.\n\n2:6 But there went up a mist from the earth, and watered the whole face of the ground.",
				"added": 1583603510
			}
		],
		"1586237062_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": [
			{
				"comment_id": 4,
				"body": "> [pineapplehead](#comment_1_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes): Just published the video above on KopyKat.Not everyone wants to leave zeronet and anyway youtube can remove the video.I don't know why not everyone does the same with external sites. [...]\n\nyep, you are right !",
				"added": 1586278936
			},
			{
				"comment_id": 10,
				"body": "align with God. be ready to die (or try).",
				"added": 1586420899
			},
			{
				"comment_id": 13,
				"body": "> [astrav](#comment_19_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Romans thought they will never be able to enslave people who care not about death\n\nthat's still the light weights, it's when you get to those seeking death that the real fight begins...",
				"added": 1586425313
			}
		],
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": [
			{
				"comment_id": 5,
				"body": "Financial markets will not allow such a move. The economy attempting to do that is done.",
				"added": 1586279200
			}
		],
		"1586334718_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 6,
				"body": "why people still post on youtube or twitter? I don't get it...",
				"added": 1586340337
			},
			{
				"comment_id": 7,
				"body": "> [mg0](#comment_261_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): It's still a reliable way of getting to a lot of people quickly.\n\nbut it exposes you to censorship, meaning that when it's \"mission critical\", those channels will fail you...",
				"added": 1586372021
			},
			{
				"comment_id": 8,
				"body": "> [aspidochelone](#comment_398_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): From the day I first heard the word, \"streaming\" never made me think of anything but some guy in a suit, a little dehydrated, spraying his sticky yellow piss all over your face.  While the masses, mouths open, wait in line beneath, catching the manna, chanting Thank you Thank you! [...]\n\ngreat post ! thx !",
				"added": 1586372102
			},
			{
				"comment_id": 9,
				"body": "youtube (alphabet) and twitter are two of the most dangerous corporations in the usa.\ndon't use them.\nboycott.\n\nand let them die.\n\nthey don't deserve to call themselves american.\n\nthey censor people, they oppose frontally the first Amendment of the Bill of Rights, they are a disgrace to the united states of america.\n\nthe thing with bitchute, brighteon and all those centralized system is that the initial flaw or surface attack is well known...\n\ndecentralize...\n\nlike planespherev4 used, LBRY here, torrents... many ways to monetize contents... like explained by aspidochelone.\n\nbut believing that being a good little slaves on a platform controlled by others men is a good way to publish is just exposing oneself to the same story as with youtube, today it's those who are censored (ie patriots, pro americana, maga) but tomorrow? \n\np2p decentralized uncensorable, anonymous, rulez...",
				"added": 1586420447
			}
		],
		"1586288287_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 11,
				"body": "very true. it's their new trend... to play with dna using rna / crispr 9 and others system of dna recombination.\n\nthey speak about the man 2.0...\n\nbut don't forget they fear death beyond all, and that's why they try to be immortal, the only thing they will achieve is to create eternal hell for themselves...\n\nwe are born to die. then it starts.",
				"added": 1586421011
			},
			{
				"comment_id": 12,
				"body": "> [pineapplehead](#comment_2_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes): With the vaccines you say?\n\neverything vaccines, rna > virus , gmo food dna leaks... what ever they can. remember pedogate, who went in jail?",
				"added": 1586421057
			}
		],
		"1586537374_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 14,
				"body": "you know all the little suckers of the united natons agendas (who, agenda 2020, 2030, co2 scam, taking the guns, destroying free speech, etc) are just domestic enemies and of course they push for mandatory vaccinations. just say no (A1) and back it (A2).",
				"added": 1586591011
			}
		],
		"1586435262_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 15,
				"body": "> [astrav](#comment_21_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Those people get screwed by and lied by their government who sends them on chemo fucks up their immune system and spends their tax money on faulty testers for millions, apparently can't keep hi-gene and causes cv-19 infection that apparrently kills two elderly and this man still tells us to follow the government guidelines. [...]\n\nthat's a good point, how the pharma industry with the help of many other industries created condition to maximize their revenues streams... medications designed to create chronic illness, food with pesticides and or made of gmo with the same intentions... the problem is that healthy life style is mostly preemptive, and then you can get fucked by a seagul shitting a load full of shit full of fukushima fallouts...",
				"added": 1586591204
			},
			{
				"comment_id": 16,
				"body": "> [astrav](#comment_24_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Face mask? They are good for 30 minutes. How effective are they anyway? To protect others against me or vice versa?\n\nboth way... you aren't in an astronaut suit of course, but still most droplets will get stopped, and you will touch your face less with one. then the problem is when they get wet...",
				"added": 1586591291
			},
			{
				"comment_id": 17,
				"body": "> [996998](#comment_2_16YRnK3dYV8BNFHnQ7oCakWdoDjqY3f6m9): keep sport , be thin , take face mask\n\nand eat healthy nutritious natural organic food and smile :).",
				"added": 1586591331
			},
			{
				"comment_id": 18,
				"body": "> [xcape2net](#comment_720_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You have my sympathy.  Remember, a hospital or doctor's waiting room is the absolute last place you ever want to be during an epidemic!\n\nunless you are sick :).",
				"added": 1586591359
			},
			{
				"comment_id": 19,
				"body": "> [ranshit](#comment_127_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): The best advise one can give during this crisis is don't get sick, nor injured.\n\n:)",
				"added": 1586591378
			},
			{
				"comment_id": 20,
				"body": "> [astrav](#comment_23_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): I'm just second time reading 'flatten the curve' and I am laughing my head off. It could be meaning flatten the tombstone on the grave of our freedom.\n\nsay no to forced / mandatory vaccinations... write to your representative, let it be heard.",
				"added": 1586591431
			}
		],
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": [
			{
				"comment_id": 21,
				"body": "> [tajny2z](#comment_19_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): What a story! I can try to help you. My skills are basic image, video and advanced music production and intermediate programming. If it's to do with computer and music I am in.  [...]\n\nyes this is a prison camp, when a plant like weed is made illegal, you know you live in a jail. another aspect about your comment on italy is that there were two successive campaign of non mandatory vaccination in the area, and as you know most european people are totally unaware of the concept of liberty as such if the medias tell them to go vaccinate themselves, they do it, as they love to obey and conform.",
				"added": 1586591602
			},
			{
				"comment_id": 22,
				"body": "> [zeroseed](#comment_48_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): great! My idea is to create a new zerotalk for promoting new artists and upload music and other CC stuff on IFS for streaming and downloading. This should be simple and the zerotalk can be showed to the public by using the proxy. We can use Zerotalk++ instead the official zerotalk. What do you think? [...]\n\nlol, what a crook, you can't understand the difference between radioactive radiation and electromagnetic field ultra high frequence pulsing stream, and how it affects everything in the body, from your adn and the one of the bacteria living with you to the rna of virus in your corpse... \n\nthe thing is that we understand that you are a low iq, and of course go live under a 5g antenna... white zone will rule the world :).",
				"added": 1586591713
			}
		],
		"1518072989_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 23,
				"body": "> [deepfake](#comment_10_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1): Halex when the apocalypse come (Banning of dpfak.com and /v/deepfake), zeronet will be deepfake's last stand brother.\n\nthere are many others already :).",
				"added": 1586591790
			}
		],
		"1586517971_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 24,
				"body": "electromagnetic fields, nasty nasty, specially the artificial ones... \n\njust don't forget the children of the police state aren't immune to emf pollution nor have special bodies to digest safely gmos or process vaccine toxins...",
				"added": 1586591963
			}
		],
		"1586463960_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 25,
				"body": "the nuclear plant (built by russia) will reveal itself in due time as the worst decision ever taken on hungarian soil... wait & see...",
				"added": 1586592062
			}
		],
		"1585525602_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 26,
				"body": "booohhhooo no more selfie !!! how to rotate tinder dates in such condition, booohoooo",
				"added": 1586592107
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "retroshare",
				"added": 1587287848
			},
			{
				"comment_id": 28,
				"body": "> [vikingharvester](#comment_27_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav): retroshare\n\nbitmessage as backup (who knows what is coming) and encrypted emails.\n\ngood luck...",
				"added": 1587287918
			},
			{
				"comment_id": 29,
				"body": "> [cexy](#comment_9_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): CEO: Mark Weinstein [...]\n\nnot all Weinstein's are in the family of the Weinstein...",
				"added": 1587313209
			},
			{
				"comment_id": 34,
				"body": "I hope you understood : forget centralized, not open sourced, not encrypted software... retroshare fits the perfectly your mission... https://retroshare.cc/",
				"added": 1587663298
			}
		],
		"1587581309_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 30,
				"body": "or when the malware got your cpu voltage up and fried it...",
				"added": 1587663032
			}
		],
		"1586878140_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": [
			{
				"comment_id": 31,
				"body": "> [tvax](#comment_28_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): Bisq uses an escrow and a multisig contract. The contract is not closed until the two peers have successfully validated it by sending each other the crypto. If one on them doesn't validate, the contract is cancelled. Depending on the situation the guy being \"scammed\" get his funds back + the deposit of the other peer.\n\nyeah, there could be a plugin to integrate the bisq api... would be nice. otherwise there is https://openbazaar.org/  it's nice too...",
				"added": 1587663123
			}
		],
		"1587403903_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 32,
				"body": "> [cexy](#comment_24_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): 60 GHz interferes with oxygen gas molecule and can lead to asphyxiation. I've been warned. Thnx\n\nthink too about the satellites of elon musk... they beam too...",
				"added": 1587663165
			}
		],
		"1587357990_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 33,
				"body": "smoking is unhealthy... for the rest, it's just a plant, eat it, drink tea... what ever.",
				"added": 1587663203
			}
		],
		"1587103405_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 35,
				"body": "censorship is the main problem affecting the centralized web.",
				"added": 1587663331
			}
		],
		"1587303560_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 36,
				"body": "> [styromaniac](#comment_2061_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Great... I hope plants don't absorb radioactive elements, because that could go airborne.\n\nthey do... bio accumulation... the \"gift\" that never stop giving... until it has concentrated in a bio sink, ie a species that will concentrate it in an accumulation pool with no cycling back to the wider biosphere... \n\nthe cycle of radioactive elements, like the cycle of water or co2... it's in the food chain.",
				"added": 1587663491
			}
		]
	},
	"comment_vote": {
		"1_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes": 1,
		"398_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"4_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": 1,
		"2_16YRnK3dYV8BNFHnQ7oCakWdoDjqY3f6m9": 1,
		"21_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1
	}
}