{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Backup do conteúdo do canal do Marinho",
			"body": "O Canal do Marinho (https://www.invidio.us/channel/UCoDdNmrcsMjfRSpgj1aMo2Q) foi deletado do youtube há um tempo atrás.\nCriei um canal no KopyKate, estarei reupando os vídeos. Não tenho conta no youtube, por favor avisem no  novo canal dele por mim.\nhttp://127.0.0.1:43110/big.kopykate.bit/?Channel=aassddff@zeroid.bit",
			"added": 1578624771
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 1,
				"body": ">caropc1v6\nÉ uma fork? O Dev do KopyKate parece meio desorganizado. Além de usar o Cryptoid,  há alguma outra vantagem?",
				"added": 1578628589
			},
			{
				"comment_id": 2,
				"body": "Há alguma forma de migrar os Vídeos, ou eu precisaria repostar?",
				"added": 1578664413
			},
			{
				"comment_id": 3,
				"body": "E onde está o código fonte da fork? Não encontrei. O botão de source code leva ao original.",
				"added": 1578665042
			},
			{
				"comment_id": 4,
				"body": "Vou manter um mirror na fork. O fato do original ter um domínio torna mais atrativo. Mas ter o mirror facilita para quem não quer usar o zeroid.",
				"added": 1578693168
			},
			{
				"comment_id": 5,
				"body": "> [caropc1v6](#comment_19_14mqeC9JkKTrWmaR1X4LdtdAuB8qaAhbNB): outra vantagem do clone, ele NÃO VAI deletar NEM UM TIPO DE VIDEO.\n> Isto acho até mais importante que as outras coisas que gostaria de ver, pois liberdade não existe pela metade a kitty, dona do site original , disse que iria deletar porno, videos destes tiroteios tipo o lá do pais dela, do covarde que atirou em uns mulçumanos pacificos NESTE CASO,  ela está com medo sei lá eu do que.\n> No brasil nos parecemos ter mais liberdade na internet que nos EUA e muitos outros lugares do mundo.\n> Isto é bom :)\n\nSim, nem se compara. Não se pode fazer nada nos outros países. O Reino Unido é a China da Europa. \nO Brasil tem muito problema pra se dar ao luxo de investir pesadamente em espionagem e restringir a computação.\nSou feliz por ter nascido aqui.\n\nOutra coisa, sabe me dizer se algum deles suporta legendas? Queria colocar múltiplas legendas para português e inglês, mas não gosto de queimar a legenda no vídeo.",
				"added": 1578750776
			}
		],
		"1_1D3Ajdot2hkUyDUdb6SxMcjEU9zprycc4E": [
			{
				"comment_id": 6,
				"body": "Mesmo de sempre.",
				"added": 1585148816
			}
		],
		"1_12r4aMRZLpvVZhhY7SQJxprTzqpocp8rYo": [
			{
				"comment_id": 7,
				"body": "A plataforma que funciona melhor é o [Kopykate](http://127.0.0.1:43110/big.kopykate.bit/). O Caropc também tem um, mas estou sem o link.\nMas algumas pessoas (como eu) também postam em blogs próprios. Recomendo procurar no Zerosites, ou ver anúncios no Zerome.\n[Meu blog](http://127.0.0.1:43110/157WDHELkDXEiejUonxka3UjetaMJi9bsK/)\n[Zerosites](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/)\n[Outro blog](http://127.0.0.1:43110/1BUk8jGHn2wX2dnSmbfy8psmJoUf7aiRR8/)",
				"added": 1586356833
			}
		],
		"1_1AwMDXohxCRMUrJKgsgYhFos7LRSLuSoaX": [
			{
				"comment_id": 8,
				"body": "Meu apoio é da [FIB.](https://www.integralismo.org.br/)",
				"added": 1586892320
			}
		],
		"7_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 9,
				"body": "Não tem nada aqui não, senhor Jornalista. Vai ter que fazer pescaria pra sua matéria em outro lugar.",
				"added": 1589169571
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 10,
				"body": "\\>dando atenção pra esse claro Jornalista ou agente da PF infiltrado\nIgnorem. Ninguém aqui faz nada disso não, Pereira.",
				"added": 1589951008
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 11,
				"body": "\\>um site deu pau\n\\>talvez tenha sido erro seu\n\\>culpa a Zeronet\nVai reclamar com os desenvolvedores do IFS, depois de confirmar que não foi burrada sua.",
				"added": 1590197703
			}
		]
	},
	"comment_vote": {}
}