{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Gens du pays",
			"body": "Personnes du Québec, manifestez-vous !!!",
			"added": 1462735286
		},
		{
			"topic_id": 2,
			"title": "SVP GARDEZ XAVIER DOLAN CHEZ VOUS MERCI !!!",
			"body": "Ô vous français qui l'aimez tant, pouvez-vous garder Xavier Dolan dans vos frontières et ainsi m'éviter qu'il vienne tourner sa prochaine cochonnerie dans ma cour et en entendre parler 365 jours par année. De la part de 8 millions de personnes de l'autre côté de l'Atlantique. Merci.",
			"added": 1463942828
		},
		{
			"topic_id": 3,
			"title": "Lettre à un jeune techno-puceau",
			"body": "Salut.\n\nDans les prochaines semaines, je mettrai les touches finales à mes archives personnelles que j'entends publier sur ZeroNet et dans d'autres réseaux dits \"incensurables\". Le point d'entrée est [ici](/bloccoq.bit/). Je le fais parce que j'ai été l'objet de censure à plusieurs reprises pour mes opinions philosophiques et artistiques.\n\nJe simplifie le corpus dans son ensemble au cas où ça ne serait pas immédiatement évident: puisque je fais un lien entre les précocités sexuelles et intellectuelles de l'individu, je constate que les milieux qui ont un impact durable sur la culture et le progrès humain carburent à un certain type de comportement social s'apparentant fortement à l'homosexualité masculine. Vous vivez d'ailleurs en plein cœur d'un exemple probant de ce phénomène. Je vous laisse faire la démonstration des caractéristiques démographiques de ZeroNet par vous-mêmes.\n\nCeci dit, je constate sur ZeroNet ce que j'ai été désolé de voir depuis les débuts du mouvement Occupy (et ses origines marxistes/altermondialistes): une immaturité sociale et sexuelle des plus déprimante. Je dis tout ça parce que je me retire de ce petit jeu conversationnel ridicule qui consiste à l'étalement du peu de vos connaissances en CSS. Partez-vous un blogue, mettez-y du contenu qui est la raison d'être de ce réseau, c'est-à-dire qui vous mériterait la censure sur le web commercial. Soyez ouverts à des échanges intelligents sur des sujets dangereux.\n\nAu plaisir,\n\nVincent",
			"added": 1464390679
		}
	],
	"topic_vote": {
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": 1,
		"1_1JGsW6FQa6CRSGwBqrZoUWhw1SEjs2P88": 1,
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": 1,
		"1_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1,
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": 1,
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": 1,
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1,
		"1_1J4j9zrg5qitbELP3tpkRiReyDaWQLkG2P": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 1,
				"body": "Bonjour à tous. Je suis Vincent,  humain, 35 ans, du Canada. Programmeur et cinéaste. Je cherche, ici et sur Freenet, à publier du contenu vidéo (fiction, opinion) en français que j'ai produit ces dernières années parce que sur le web commercial, c'est la zombie apocalypse totale. Mais j'aimerais tester les interactions humaines sur ces réseaux un peu avant. Donc au plaisir (ayez plus de 18 ans si vous voulez qu'on se parle SVP).",
				"added": 1459608581
			}
		],
		"1_1JGsW6FQa6CRSGwBqrZoUWhw1SEjs2P88": [
			{
				"comment_id": 2,
				"body": "Historiquement, par contre, je crois voir une tendance à l'autonomie et la dissociation paisible chez ceux qui survivent et même prospèrent dans ce genre de conjoncture. La stupidité n'a pas besoin d'aide pour échouer à la sélection naturelle.",
				"added": 1459631165
			}
		],
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": [
			{
				"comment_id": 3,
				"body": "salut ! bravo pour ce post . quelques pistes:\n\n1) https://github.com/HelloZeroNet/ZeroNet/issues/57\n2) https://github.com/HelloZeroNet/ZeroNet/issues/407\n3) il y a des alternatives comme mail.zeroverse.bit qui font du progrès à ce niveau-là mais ce n'est pas la responsabilité de ZeroNet en tant que plateforme de fournir un système intégré de messagerie\n4) ZeroNet ne repose pas sur ZeroID du tout (zeroverse.bit est un clone et mail.zeroverse.bit permet l'interaction entre les ids zeroverse et zeroid)",
				"added": 1459694980
			},
			{
				"comment_id": 4,
				"body": "j'apprécie la critique constructive, mais je rejette sans équivoque l'esclavagisme que tu proposes. je suis programmeur moi-même et je suis à l'aise avec l'idée que ZeroNet soit hermétique. quand c'est un projet qui est porté à bout de bras par des gens qui travaillent gratuitement c'est normal que leurs besoins et leurs cas d'usage soient la priorité. un utilisateur est au centre d'un projet informatique s'il contribue de l'argent et/ou du code. c'est comme ça que les directions s'établissent. tu as le droit de critiquer et exiger ce que tu veux, ils ont le droit de t'ignorer et même te bannir s'ils le jugent nécessaire.",
				"added": 1459726928
			},
			{
				"comment_id": 5,
				"body": "Il n'appartient qu'à eux de déterminer la nature de leur intérêts. L'argument moraliste est absolument et universellement irrecevable.",
				"added": 1459784276
			}
		],
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": [
			{
				"comment_id": 6,
				"body": "salut ! tu veux te partir un zéroblogue et mettre l'adresse ici ? j'irai voir pour sûr. à+",
				"added": 1463585206
			},
			{
				"comment_id": 25,
				"body": "> [weedcoder](#comment_11_151xfrGz3zugtqCT51AStxjJNTHa6harBb): Le meilleur endroit pour les faire plier, c'est de l’intérieur.\n\nSi j'avais un seul exemple de gars qui n'a pas éventuellement trahi ses propres principes en pensant faire plier le pouvoir en se mêlant à lui… Un seul.\n\n",
				"added": 1464613547
			}
		],
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 7,
				"body": "Moi je me lance: je crois que le futur de l'hétérosexualité en général et de la femme en particulier est dans un bocal de formol au musée d'histoire naturelle. C'est essentiellement là-dessus que je me fait censurer dans le monde et le web commercial. Comme se sont fait censurer Michel Foucault, les proto-moines pâcomiens et à peu près tous les philosophes depuis l'invention de l'écriture. Merci de votre compréhension.",
				"added": 1463667150
			},
			{
				"comment_id": 8,
				"body": "> ça m'a fait penser à la manif pour tous\n\nEt moi la manif pour tous m'a fait penser qu'étant par ailleurs pour l'égalité en droit (et donc pour le mariage gay, entre autres), je rejette radicalement le mariage et toutes les formes de domestication mutuelle, y compris l'état en tant que contrat social qui revient à un mariage forcé tout aussi castrant entre tous les citoyens. Une surveillance perpétuelle qui passe pour de la bienveillance.\n\n> la majorité des drames que l'humanité a connu sont pas mal liés à cette entêtement à vouloir différencier les êtres\n\nJe suis d'accord. D'où que \"homo\" veut dire pareil, égal. D'où qu'hétéro veut dire différent, inégal. D'où que le futur de l'humanité est dans le dépassement de l'hétérosexualité.\n\n> Ok, merci les sexistes.\n\nJe suis sexiste. Tu es sexiste. Nous sommes sexistes. Parce que nous sommes sexués. Est-ce qu'une libido asexuée est possible ? Je ne sais pas. Mais je sais que l'intelligence humaine n'existerait pas sans la libido. Je suis donc hétérophobe.\n\n> Vivement le jour où l'homme et la femme seront considéré comme simples humains.\n\nVivement le jour où l'homme transcendera le genre binaire vestigial qui lui est imparti. Cette transcendance est une ascèse très documentée. Il y a des drag queens dans la Bible. Mais entre temps, il y a aussi l'intelligence artificielle, le cancer et les changements climatiques. Entre temps, il y a la sélection naturelle. Ces phénomènes auxquels l'humanité fait face nécessitent de maximiser les potentiels cognitifs individuels et collectifs. Et depuis les vénus préhistoriques, on sait que le féminisme est un antagoniste au progrès et qu'à l'inverse, l'homosexualité masculine est partout et de tout temps le lieu de toutes les innovations. C'est choquant mais c'est comme ça: la presque totalité des garçons meurent vierges de l'anus et d'avoir contribuer à l'Histoire, malgré le fait qu'ils ont tous la prostate au même endroit.",
				"added": 1463676322
			},
			{
				"comment_id": 9,
				"body": "> [mederic](#comment_1_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb): Je rêve des chaînes de télévision qui aurait le courage d'avoir dans les effectifs 1 femme ou même plusieurs particulièrement pulpeux avec des gros nichons qui représenteraient 1 plaisir abyssal de bonne facture.\n\nC'est dans ta liste d'une bonne quarantaine de sujets qui fâchent ? En souhaitant que ce soit partagé avec au moins une autre personne de sexe pulpeux sur la planète pour des échanges virils et constructifs. ;-)\n",
				"added": 1463685709
			},
			{
				"comment_id": 10,
				"body": "> [mederic](#comment_2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb): LIRE PULPEUSE LOL\n\nah… un sexe pulpeux c'est pas bien ? les courbes ce n'est pas pour toi ? tu n'aimes pas les vraies femmes ? ;-)",
				"added": 1463693514
			},
			{
				"comment_id": 11,
				"body": "> [mederic](#comment_3_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb): Si justement .......\n\nMmmmd'accord darling. Sujet fâchant s'il en est.",
				"added": 1463704549
			}
		],
		"2_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 12,
				"body": "J'ai téléchargé. J'ai mal lu ce que tu as dit hier sur ZeroChat. Je croyais que tu avais participé à l'émission.\n\nJe vais répondre à tous vos élans technorévolutionnaires (et vous dire pourquoi ils sont voués à l'échec) prochainement. Je fairai signe sur ZeroTalk FR et d'autre zérosites francophones quand ça sera prêt.\n\nD'ici-là, mes chers petits puceaux sociopathes préférés, essayez de ne pas trop vous ridiculiser avec des concepts trop compliqué pour vous.\n\nXOXO votre trollbot préféré",
				"added": 1463750716
			}
		],
		"3_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 13,
				"body": "lol. J'écris ce billet à partir de Mac OS X 10.11.5 qui roule sur un PC normal. Mais pour voir des sexes pulpeux sur AOL, Windows 98 te seras amplement suffisant.",
				"added": 1463752451
			},
			{
				"comment_id": 14,
				"body": "qu'ils mangent de la brioche\n\n– fier riche pd trollbot up4",
				"added": 1463758487
			}
		],
		"1_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 15,
				"body": "bonsoir à vous 2… prêts… party !!!!",
				"added": 1463833849
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 16,
				"body": "> [openuser](#comment_7_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): Il est plus chiant qu'une course d’escargots ce mec! :D\n\nC'est encore trop gentil. Les escargots apprêtés de la bonne façon sont appétissants, eux.",
				"added": 1463950970
			},
			{
				"comment_id": 20,
				"body": "Merci pour rien: http://www.lapresse.ca/cinema/festivals-de-cinema/festival-de-cannes/201605/23/01-4984227-xavier-dolan-je-nai-pas-besoin-de-la-palme-dor-dans-ma-vie.php",
				"added": 1464036947
			},
			{
				"comment_id": 21,
				"body": "Oui mais c'est comme les pigeons: il ne faut pas lui donner de l'attention si on ne veut pas qu'il revienne avec pire.",
				"added": 1464117265
			},
			{
				"comment_id": 22,
				"body": "> [vixa](#comment_11_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM): Du coup, si on lui lance des caillou dans la tête, il s'envole ailleurs?\n\nBe.my.guest.\n",
				"added": 1464178653
			}
		],
		"1_1DeV6mYFwyYhQSrFbXgjFD2WX6pzUwLYdJ": [
			{
				"comment_id": 17,
				"body": "ZeroNet expose un service sqlite3 via JavaScript. Donc oui, une base de données relationnelle distribuée comme le reste du contenu est disponible pour chaque zerosite. Docu ici: https://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/",
				"added": 1464020483
			},
			{
				"comment_id": 18,
				"body": "Tu ne peux pas utiliser PHP mais si tu as des bases en SQLite3 tu vas t'y retrouver. Ceci dit ZeroNet EST une monnaie virtuelle aussi. Chaque adresse ZeroNet est une adresse bitcoin. Je suggère que tu regarde l'aspect devise de ZeroNet de plus près.",
				"added": 1464021116
			},
			{
				"comment_id": 19,
				"body": "Bon. C'est bien alors. Ton offre est là. En te souhaitant de recontrer des intéressés.",
				"added": 1464021842
			}
		],
		"1_1MEFyQ6EisGzSQ8VL8ZwQ7aug4x1iVvv9L": [
			{
				"comment_id": 23,
				"body": "> [elnormand](#comment_15_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w): Great. J'espère qu'il est assez protecteur contre ceux qui essayeront d'y inscrire de la merde.\n\nSVP, définis « merde », question de m'assurer que je n'en suis pas une à tes yeux, ce qui briserait mon cœur à tout jamais.",
				"added": 1464390884
			}
		],
		"12_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 24,
				"body": "Qui est responsable de ce ZeroTalk ? Qui a la clé ?",
				"added": 1464544521
			},
			{
				"comment_id": 26,
				"body": "Même si un million de personnes sont \"pour\". Si vous faites un nouveau ZeroTalk FR sans d'abord essayer de contacter les admins de celui-ci, votre démarche ne vaut pas grand chose. Vous allez aussi devoir convaincre les admins du ZeroTalk en anglais de changer le lien vers votre zérosite ou de créer un \"FR2\".",
				"added": 1464613882
			},
			{
				"comment_id": 27,
				"body": "> [openuser](#comment_13_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): oui mais les pull sa gratte!\n\noui mais mon tout petit chou en sucre… laisse-faire les grands\n",
				"added": 1464636266
			},
			{
				"comment_id": 28,
				"body": "Il y a de cela quelque temps, je [demandais à elnormand des précisions sur ce qui me laissait présumer de son penchant pour la censure](/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET/?Topic:1_1MEFyQ6EisGzSQ8VL8ZwQ7aug4x1iVvv9L/ZEROWIKI+en+Fran+ais+en+cours). Pour rester poli, je dirais qu'il n'a pas répondu à la question.\n\nPuis, je vois aujourd'hui que dans une conversation avec openuser sur ZeroChat, il [récidive](/15tTDgqJa8vBKo5757rfXdsACvrLx3C2nX/). Je ne crois pas que la communauté francophone de ZeroNet devrait faire confiance à elnormand pour l'administration d'un forum de discussion car il fait preuve d'une partialité propre à discréditer un réseau qui se veut idéologiquement neutre.",
				"added": 1464658889
			},
			{
				"comment_id": 32,
				"body": "> [openuser](#comment_14_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): mdr :D moi non plus je ne me ferai pas confiance ^^ \n\nVoilà une chose de réglée.\n\n> N'y aurait-it pas un moyen de créer un site sans que personne ne possède de clef privée? Par exemple que l'utilisateur et sa clef privée s'auto-effacent dès la création du site c'est possible ? Comme ça il n'y aurait pas de problème de censure !\n\nJe ne pense pas que ce soit une bonne idée.\n\nLa clé ne se supprime pas seule. On ne peut qu'espérer que son créateur l'a bel et bien détruite.\n\nDe plus, une fois la clé détruite, plus possible de mettre le code à jour.\n\n> Mais sinon, la question sur la neutralité est assez bonne. Que ce soit @elnormand ou n'importe qui d'autre d'ailleurs.\n\nCertains sont nettement plus dignes de confiance que d'autres. Je reproche à elnormand non seulement son recours éventuel à la censure, mais aussi un flou absolu sur sa ligne éditoriale.\n\nQuelles-sont les règles pour un forum francophone? Ça serait un contrat de base entre l'admin et les utilisateurs. Mais c'est un sujet pour un autre topic. Je te fais assez confiance pour en créer un. Vas-y fort, openuser.",
				"added": 1464699224
			},
			{
				"comment_id": 34,
				"body": "> [elnormand](#comment_30_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w): @up4 J'ai du prendre un trou noir car je ne comprend rien.\n\nC'est sûr que de regarder un trou noir dans les yeux tout en se pieutant avec openuser, ça peut avoir cet effet. J'espère de tout cœur qu'il en ressort du bon et pas que cette culpabilité confuse. Vous êtes deux grands garçons majeurs et consentants après tout.",
				"added": 1464728253
			},
			{
				"comment_id": 35,
				"body": "Et moi j'ai la certitude d'avoir [eu raison](/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET/?Topic:3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz/Lettre+un+jeune+techno+puceau) sur elnormand (après lui avoir parlé en privé) : je ne crois pas que ce soit de la mauvaise foi ou de la stupidité, mais assurément de l'immaturité. Et entre avoir un forum en désuétude et devoir confier du contenu à quelqu'un de démonstrativement immature, je préfère le statu quo. Je fais des démarches pour demander aux admins actuels de faire une mise à jour. Mais sinon, c'est un dossier clos pour moi pour le moment. ",
				"added": 1464781752
			},
			{
				"comment_id": 37,
				"body": "Je dépose [ça](/1Nxd1KQjZmTiC6vy83Cj1v4Fd8iDRryRpe/) ici. En espérant que ce sera tout.",
				"added": 1464903935
			},
			{
				"comment_id": 38,
				"body": "> [openuser](#comment_17_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): @poubelle = @up4 ? ^_^j'y comprends plus rien moi :)\n\nOkay, mais moi je ne me sens pas du tout confus. Je suis à l'aise avec ce que j'ai dit et je suis absolument confiant dans ma position.\n\n> La question de la censure reste ouverte, peut-être qu'on devrait effectivement faire un NewTopic pour en parler.\n\nComme je te l'ai déjà dit, si ça t'intéresse, vas-y. C'est certain que je vais participer. Il y a tant à dire que je vais peut-être dépasser ma limite avec \"poubelle\" et devoir me créer un autre usager juste pour ce thread. À ce point-ci je commence à douter de ZeroTalk d'un point de vue architectural, justement. C'est peut-être mieux d'investir ce sujet sur ton blogue et seulement de l'annoncer ici. Je sais où c'est, t'inquiète.\n",
				"added": 1464913453
			}
		],
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 36,
				"body": "> [weedcoder](#comment_12_151xfrGz3zugtqCT51AStxjJNTHa6harBb): A-t-il [Michel Foucault] fabriqué une théorie explicative de ce phénomène?\n\nPas aussi explicitement que je le fais, mais il a été le premier à tenter un lien aussi fort entre la sexualité et la politique. Plus d'un point de vu moral, comme Sade. Mais c'est certain que son travail reste la base.\n\n> Est-ce la résultante d'une civilisation qui détruit l'hétérosexualité? Que penses-tu des femmes?\n\nDans les deux cas, je te dis: blâme la biologie, pas la civilisation. Les hétérosexuels, et à plus forte raison les femmes, se sont de tout temps vantés d'être du «bon» côté de la nature sans jamais se poser la question de la fonction de l'homosexualité masculine. Vous chantiez ? j'en suis fort aise. Eh bien : dansez maintenant. Ou plutôt: inventez-vous la «mafia gay» et le «patriarcat» pour vous expliquez l'inévitable: votre futur est dans un bocal de formol au muséum d'histoire naturelle. La règle du jeu de la sélection naturelle demeure inchangée: «que le meilleur gagne»\n\nQue le meilleur gagne.",
				"added": 1464781937
			}
		]
	},
	"comment_vote": {
		"1_17GqyGwVtGCVNaF5C3pQbBE7XP2WQWo8ge": 1,
		"1_17GrTAmBGZTRwYDzSWr9hyKv6We2iEz38c": 1,
		"1_1LnCm1Q1WbFSmooZqALJCAramTcbmhRdjE": 1,
		"2_17GqyGwVtGCVNaF5C3pQbBE7XP2WQWo8ge": 1,
		"17_1iKwsLs3AWyou1MY2jCTXn7Mc6L1VDiCL": 1
	}
}