{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"5_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": 1,
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"3_18agLWk9sz7piVCZ3nDhTvBB1YrBdbxuDF": 1,
		"4_18agLWk9sz7piVCZ3nDhTvBB1YrBdbxuDF": 1,
		"1_136d658NYQsvMuyFwvc2sbrwe56nZ9F4TM": 1
	},
	"next_comment_id": 45,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "O Soldado do Futuro 1998 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576627220_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1576628013
			},
			{
				"comment_id": 3,
				"body": "Terra dos Mortos 2005 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576765734_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1576769272
			},
			{
				"comment_id": 6,
				"body": "Star Wars Episode IV A New Hope 1977 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576956736_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1576961916
			},
			{
				"comment_id": 7,
				"body": "Terminator Salvation DIRECTORS CUT (O Exterminador do Futuro - A Salvação) 2009 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576998184_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1576999061
			},
			{
				"comment_id": 8,
				"body": "O Expresso da Meia-Noite 1978 Dub (Dublagem Clássica)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577007186_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1577009391
			},
			{
				"comment_id": 9,
				"body": "Big Stan – Arrebentando na Prisão 2008 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577039061_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse:Ao ser sentenciado por fraude, o insignificante trambiqueiro Stan (Rob Schneider) entra em pânico com a perspectiva nada agradável do que o aguarda na prisão, principalmente a idéia de se tornar o “namorado” de algum condenado grandalhão. Aproveitando seus últimos meses de liberdade, busca a ajuda de um misterioso guru das artes marciais, conhecido apenas como O Mestre (David Carradine), que milagrosamente consegue tranformar o atrapalhado malandro num especialista em kung fu. O Que ninguém poderia imaginar era que este inesperado talento de Stan acabaria com os conflitos entre várias gangues rivais provocando muitas gargalhadas, momentos constrangedoramente românticos e uma pilha de confusões dentro das paredes de pedra.",
				"added": 1577041403
			},
			{
				"comment_id": 10,
				"body": "03 - Alien 3 1992 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577072154_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1577077189
			},
			{
				"comment_id": 11,
				"body": "Star Wars Episode V The Empire Strikes Back 1980 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577143890_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1577145304
			},
			{
				"comment_id": 13,
				"body": "Duro de Matar 1988 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577177645_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: John McClane (Bruce Willis) é um detetive de Nova York que está indo a Los Angeles para se encontrar com sua esposa (Bonnie Bedelia), que trabalha em uma empresa japonesa. Porém, ao chegar no prédio onde ela trabalha, percebe que o edifício está sendo assaltado por um bando de terroristas e decide atrapalhar seus planos para resgatar sua mulher.",
				"added": 1577177966
			},
			{
				"comment_id": 14,
				"body": "Day of the Dead (Dia dos Mortos) 1985 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577187656_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse:\n\nOs Estados Unidos foram tomados por mortos-vivos , exceto um bunker na Flórida que abriga militares e uma equipe de cientistas . Um cientista conhecido como Dr.Frankenstein realiza experimentos com os zumbis para tentar civilizá-los .\nUm dos soldados perde o controle e os zumbis invadem a base .\nA única chance de sobreviverem aos zumbis é conseguir chegar até o helicóptero e fugir .",
				"added": 1577188255
			},
			{
				"comment_id": 15,
				"body": "Trocando As Bolas 1983 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577213793_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Inspirado no livro O Príncipe e o Mendigo, de Mark Twain, o filme conta a história de o esperto mendigo Billy Ray Valentine (Eddie Murphy) se torna um investidor em Wall Street, depois que dois irmãos milionários apostam se seria possível um morador de rua trocar de identidade com seu empregado magnata Louis Winthorpe III (Dan Aykroyd).",
				"added": 1577214207
			},
			{
				"comment_id": 19,
				"body": "Os Fantasmas Contra-Atacam (Scrooged) 1988 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577251010_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Nos dias atuais, Frank Cross (Bill Murray) é um diretor de uma rede de televisão que é frio e só pensa na audiência. Ele encontra com Lew Hayward (John Forsythe), um falecido amigo, que o avisa sobre três fantasmas (o do Natal Passado, Presente e Futuro) que irão visitá-lo e diz para ele estar atento a tudo que eles mostrarem, pois esta é a única oportunidade de Frank se salvar.",
				"added": 1577253882
			},
			{
				"comment_id": 22,
				"body": "28 days later (Extermínio 1) 2002 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577268881_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Após invadirem um laboratório de pesquisas em macacos, um grupo de ativistas encontra chimpanzés presos em gaiolas diante de telas que exibem continuamente cenas de extrema violência. Ignorando os avisos de um cientista que trabalha no local de que os macacos estariam infectos, os ativistas decidem libertá-los. Assim que são soltos os macacos atacam todos aqueles à sua volta, em verdadeiros ataques ensandecidos. 28 dias após este acontecimento desperta do coma em um hospital de Londres Jim (Cillian Murphy). Completamente confuso e estranhando a ausência de pessoas nas ruas, Jim nada sabe sobre o ocorrido e se esconde após encontrar diversos cadáveres e seres monstruosos, infectados pelo vírus disseminado. Após uma explosão Jim encontra outros sobreviventes, Selena (Naomi Harris) e Mark (Noah Huntley), que o levam a um local seguro e lhe explicam a situação atual. Decidido a reencontrar seus pais, Jim decide partir e é acompanhado pela dupla de novos companheiros. Até que, ao se refugiarem em um prédio, ouvem uma transmissão pelo rádio de que um grupo de soldados comandados pelo major Henry West (Christopher Eccleston) está se reunindo e diz ter a solução para a cura da infecção provocada pelo vírus. Sem outra alternativa, Jim, Selena e Mark decidem se juntar aos soldados em sua batalha.",
				"added": 1577269107
			},
			{
				"comment_id": 25,
				"body": "Event Horizon (O Enigma do Horizonte) 1997 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577502217_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Em 2047, uma missão de resgate é mandada para encontrar a “Event Horizon”, uma nave que desapareceu misteriosamente sete anos atrás, quando explorava os limites do sistema solar. Mas ao encontrá-la os astronautas que integram a missão de resgate vão gradativamente tomando consciência do terrível mistério que os cerca.",
				"added": 1577503260
			},
			{
				"comment_id": 26,
				"body": "Crocodilo Dundee 1 1986 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577503939_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse : Comédia de sucesso nas bilheterias estrelada pelo australiano Paul Hogan. Ele interpreta Michael J. \"Crocodilo\" Dundee, um criativo e pacato guia de safáris na Austrália, que caça crocodilos com as próprias mãos, derruba búfalos, bebe muito e está sempre metido em encrencas. Na selva, ele vira guia da bela e rica jornalista americana Sue Charlton (Linda Koslowski), que acaba se apaixonando pelo caçador e decide levá-lo a Nova York. Lá, ele causa espanto com seu jeito caipira, enfrenta um verdadeiro teste de tortura e coloca Nova York de pernas para o ar.",
				"added": 1577504077
			},
			{
				"comment_id": 28,
				"body": "Maquina Quase Mortifera 1993 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577648255_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Colt e Luger são uma dupla de policiais que não combinam em nada. Mas vão ter que se unir de um jeito ou de outro para resolver um caso muito arriscado e tirar uma gangue de criminosos das ruas da cidade. Depois do assassinato de sua parceira, o sargento Wes Luger (Samuel L.Jackson ) acaba fazendo uma explosiva parceria com o policial esquentadinho Jack Colt (Emilio Estevez ) para impedir que um grupo de bandidos liderado pelo General Curtis Mortars (William Shatner) consiga a tão sonhada fórmula que transforma cocaína em... biscoitos! \nMuitas cenas de humor pastelão e paródias de vários filmes",
				"added": 1577649999
			},
			{
				"comment_id": 29,
				"body": "Comando Para Matar 1985 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577761364_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: John Matrix, é um coronel aposentado há dez anos, que vive para Jenny Matrix, sua filha. Repentinamente ela é sequestrada por Arius, um ex-ditador latino-americano que espera recuperar o poder, e que para isto chantageia Matrix, ordenando-o que mate o presidente Velasquez, o atual mandatário. Mas John, foge do avião e tem só 11 horas para resgatar Jenny, antes que descubram que escapou e não pretende cometer nenhum assassinato. Na sua tentativa só encontra obstáculos pelo caminho e a única pessoa que fica do seu lado é Cindy, uma aeromoça.",
				"added": 1577762396
			},
			{
				"comment_id": 34,
				"body": "Rambo Até o Fim 2019 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577826205_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSINOPSE: Rambo: Até o Fim Torrent – O tempo passou para Rambo (Sylvester Stallone), agora ele vive recluso e trabalha em um rancho que fica na fronteira entre os Estados Unidos e o México. Sua vida antiga marcada por lutas violentas, mas quase sempre vitoriosas, ficou no passado. No entanto, quando a filha de um amigo é sequestrada, Rambo não consegue controlar seu ímpeto por justiça e resolve enfrentar um dos mais perigosos cartéis do México.",
				"added": 1577827460
			},
			{
				"comment_id": 36,
				"body": "Fúria De Titãs 1 2010 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577856531_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Perseu (Sam Worthington) descobre que é o filho mortal de Zeus (Liam Neeson), mas recusa-se a aceitar tal condição. Contudo, para salvar a cidade de Argos da fúria dos deuses do olimpo e da vingança de seu tio Hades (Ralph Fiennes), ele vai ter que enfrentar uma perigosa jornada contra terríveis criaturas como a Medusa para salvar os simples mortais e a bela Andrômeda (Alexa Davalos) do sacrifício para o monstro Kraken.",
				"added": 1577856993
			},
			{
				"comment_id": 38,
				"body": "Fúria de Titãs 2 2012 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577857903_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Dez anos depois, o semideus Perseus (Sam Worthington) leva uma vida pacata de pescador enquanto cria seu filho, Hélio (John Bell). Os deuses estão enfraquecidos, já que os humanos não estão mais rezando para eles. Esta situação permite que Hades (Ralph Fiennes) e Ares (Édgar Ramírez) elaborem um plano para libertar Cronos, o pai de Hades, Zeus (Liam Neeson) e Poseidon (Danny Huston), que está aprisionado no tártaro. Para que o plano funcione Hades e Ares capturam Zeus, o que faz com que Perseus parta para salvá-lo.",
				"added": 1577858424
			},
			{
				"comment_id": 39,
				"body": "Mississippi Burning (Mississipi Em Chamas) 1988 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577867866_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Mississipi, 1964. Rupert Anderson (Gene Hackman) e Alan Ward (Willem Dafoe) são dois agentes do FBI que estão investigando a morte de três militantes dos direitos civis. As vítimas viviam em uma pequena cidade onde a segregação divide a população em brancos e pretos e a violência contra os negros é uma tônica constante.",
				"added": 1577868096
			},
			{
				"comment_id": 41,
				"body": "28 weeks later (Extermínio 2) 2007 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1577940194_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Um vírus mortal aniquilou a Grã-Bretanha há 6 meses. Os Estados Unidos anunciam que a guerra contra a contaminação foi vencida, com a reconstrução do país tendo início. A 1ª leva de refugiados retorna ao país, o que faz com que uma família seja mais uma vez reunida. Porém um de seus integrantes carrega consigo uma variação do vírus, ainda mais mortífero que o original.",
				"added": 1577940739
			},
			{
				"comment_id": 42,
				"body": "Johnny Mnemonic O Cyborg do Futuro 1995 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578000128_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSINOPSE: Em 2021, o mundo inteiro está conectado através de uma gigantesca Internet. Metade da população é afetada pela NAS, uma espécie de AIDS do século XXI, que consiste em ter uma alergia fatal às ondas eletromagnéticas. No entanto, um mensageiro cibernético (Keanu Reeves) é contratado para transportar 320 gigabytes que contêm a cura para este mal em um chip implantado no seu cérebro. Entretanto, seu cérebro está saturado e um grupo planeja impedi-lo de levar esta informação. Deste modo, ele tem apenas um dia para salvar a si e ao mundo.",
				"added": 1578000412
			},
			{
				"comment_id": 43,
				"body": "Condenação Brutal 1989 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578121108_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Faltam apenas seis meses para Frank Leone (Sylvester Stallone), um prisioneiro modelo, terminar de cumprir sua pena por um crime menor, em uma prisão de segurança mínima. Até que, repentinamente, ele é transferido para uma prisão de segurança máxima que é administrada pelo diretor Drumgoole (Donald Sutherland), que nutre um imenso ódio por Leone e vai fazer de tudo para que ele nunca mais seja solto, pois transformará o que resta da sua pena em um inferno. Drumgoole espera que fazendo isto Leone irá se descontrolar, justificando uma ação violenta dos guardas ou mesmo dos detentos, que provocam Leone para conseguir algum favor de Drumgoole.",
				"added": 1578121470
			},
			{
				"comment_id": 44,
				"body": "Duro de Matar 2 1990 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578169694_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ\n\nSinopse: Terroristas assumem o controle do aeroporto de Washington, visando libertar um preso político (Franco Nero) que está sendo extraditado, e ameaçam destruir várias aeronaves se as exigências deles não forem cumpridas. Mas a esposa (Bonnie Bedelia) de John McClane (Bruce Willis), um detetive de Nova York, se encontra em um dos aviões, assim o marido resolve enfrentar a quadrilha.",
				"added": 1578170989
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 2,
				"body": "Naruto Classico 18 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576738630_17E2WyhgXXbZL7esDfLjk9CBED4jD5FgAJ",
				"added": 1576738677
			}
		],
		"5_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": [
			{
				"comment_id": 4,
				"body": "não sabia disto, mas quando vejo noticias como está, só lembro da ZERONET e de redes como a mesh e basicamente , redes que tu usa um roteador ou algo do tipo para enviar os dados do TEU pc , celular para outro e outro e outro.\n\nQuero ver a choradeira , quando nego começar a usar este tipo de tecnologia, vai ser bem engraçado, pois dai acabou, nunca mais vão conseguir parar a internet/comunição das pessoas.",
				"added": 1576774763
			}
		],
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": [
			{
				"comment_id": 5,
				"body": "descentralizados, sei, acredito.\n\nVelho se o conteudo NÃO FOR tu mesmo mantendo, e depois OS OUTROS que gostarem ajudando a manter no ar, NÃO É DESCENTRALIZADO.\n\nChamar de descentralizado NÃO TORNA algo descentralizado.\n\nVou dar uma lida sobre este treco, mas DUVIDO, que seja descentralizado.\n\nPois se for, vai ser como é a zeronet, basicamente :) , como já uso ela, fico nela :)",
				"added": 1576890422
			}
		],
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": [
			{
				"comment_id": 16,
				"body": "bom, como já venho avisando o povo , é só usar plataformas REALMENTE descentralizadas, das que li sobre como funcionava a unica qu vi ser descentralizada é a zeronet.\n\nPois o mesmo usa o poder do protocolo torrent , bitcoin, tor e etc, para pertmir CADA UM MANTER uma cópia do que gostar e o unico que tem 100% de controle sobre o site que postou é o DONO.\n\nIsto se o mesmo não deletar a private key para tornar IMPOSSIVEL, tirarem do ar o site :)\n\nSe alguém souber de outras redes que os USUÁRIOS, são quem mantem os conteudos, por favor postem aqui, pois as que li sobre, se dizendo descentralizadas, tinham sites na main net, e isto já é centralização.\n\nFora que o conteudo era mantido sabe-se deus por quem, pois o povo tem que lembrar que TUDO tem um custo e liberdade , o custo é este , que temos na zeronet, que é de nós mesmos gastar um pouquinho do nosso espaço em disco para manter coisas que REALMENTE gostamos.",
				"added": 1577218911
			},
			{
				"comment_id": 18,
				"body": "> [parebrun](#comment_6_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg): Mas, se não quiser utilizar o DTube, pode ficar somente com o IPFS.\n\nvi agora de tarde que tinham adicionado suporte ao ifps, bom.\n\nAinda acho +- , por causa do site centralizado e tal, mas .... ficou melhor, show.\n\nSe continuarem melhorando, vai ficar BOM, pelo visto , eles REALMENTE querem descentralizar a coisa. bom",
				"added": 1577250985
			},
			{
				"comment_id": 20,
				"body": "> [inulfrio](#comment_3_13jWqWVhKktQ3SeXRgDMYXczJWCDhLTuuU): O que acha de integrar o \"Big Kopy Kate 2\" com o IPFS? Poderia fornecer uma opção de upar o vídeo diretamente na ZeroNet, e outra de upar no IPFS e exibir no \"Big Kopy Kate 2\".\n> Veja estes projetos: \n> \n> https://github.com/anarkrypto/upload-files-to-ipfs-from-browser-panel.git\n> https://github.com/download13/ipfstube.git\n\né uma boa, mas não devo ter capacidade técnica ainda e tempo para estudar para fazer isto.\n\nMinha prioridade no momento é tentar adicionar botão de block user e playlist.\n\n:)",
				"added": 1577269017
			}
		],
		"3_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": [
			{
				"comment_id": 17,
				"body": "uhé, é só tu mesmo  manter as coisas que TU ACHA importantes, ou tu quer OBRIGAR os outros a manter o que TU acha importante.\n\nEu estou fazendo isto :)\n\nBem vindo a zeronet e ao mundo descentralizado :D",
				"added": 1577224701
			}
		],
		"3_18agLWk9sz7piVCZ3nDhTvBB1YrBdbxuDF": [
			{
				"comment_id": 23,
				"body": "seria bom criar um site  deixar tudo isto dentro da própria rede zeronet :)",
				"added": 1577309223
			}
		],
		"2_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": [
			{
				"comment_id": 27,
				"body": "Cuidado com o estatismo! (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1556016441_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577644426
			}
		],
		"3_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 30,
				"body": "Cuidado com o estatismo! (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1556016441_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577811013
			}
		],
		"4_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 31,
				"body": "Cuidado com o estatismo! (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1556016441_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577811032
			}
		],
		"2_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 32,
				"body": "Cuidado com o estatismo! (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1556016441_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577811048
			}
		],
		"1_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 33,
				"body": "Cuidado com o estatismo! (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1556016441_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577811769
			}
		],
		"11_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 35,
				"body": "Anarcocapitalismo_ o futuro (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1548066354_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577856981
			}
		],
		"10_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 37,
				"body": "Anarcocapitalismo_ o futuro (daniel fraga)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1548066354_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS",
				"added": 1577857503
			}
		],
		"12_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 40,
				"body": "Violência é sempre mais fácil que qualidade (ANCAPSU)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1569776216_1BW8U38xw9YUTWxJDQp6m5zKrehq83iQ3X",
				"added": 1577895144
			}
		]
	},
	"comment_vote": {
		"3_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": 1,
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"6_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"3_13jWqWVhKktQ3SeXRgDMYXczJWCDhLTuuU": 1
	}
}