{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ipfs и  zeronet",
			"body": "виденл тестовый сайт http://127.0.0.1:43110/1Anxiq4y8oJUBisB7igP8jKQNK1DPGiSR1/?Post:3\nв котором сайт находится в зеронете, а видео в ипфс .\nобъясняется подобная конструкция тем что в ипфс нельзя делать многопользовательские сайты, а в зеронет плохо работает с тяжелым контентом.\n\nполучается по сути проекты делают одно дело, но в обном реализованно лучше одно, а в другом - другое\nвот думаю не соль.тсяли эти 2 проеката?",
			"added": 1496917807
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1Anoh6Rexrn9FDhBgntUXUx3CYatV2LPZY": [
			{
				"comment_id": 1,
				"body": "пишете в зеронете про централизованный аналог скайпа - как то стьранно\nписали бы про tox или ring  - они как зеронет децентрализованные, ещё про какой то матрикс слышал но непонял что это есть, но вроде что то, выполняющее функции им с видеозвонками",
				"added": 1496778749
			}
		],
		"1_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828": [
			{
				"comment_id": 2,
				"body": "да и вообще почему то про ipfs очень мало информации и в зеронете и в интеренете",
				"added": 1496917977
			},
			{
				"comment_id": 4,
				"body": "> [murka](#comment_25_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Нет. IPFS — это только P2P файлообмен и перманентная адресация. ZN ничего особого в этом плане не представляет.\n> \n> Не сольются. На IPFS завязано довольно много проектов в разработке. Нет никакой необходимости сливаться именно с ZN, да и вообще с чем-либо.\n\nнадо, ненадо\nа если по факту то зеронет - это  аналог ипфс, только чуток более кривой, с надстройкой для более навороченного публикования контента -точне сайтоав\n\nвон какой то зеромукс появился http://127.0.0.1:43110/1CiDoBP8RiWziqiBGEd8tQMy66A6fmnw2V/big/docs/\nдля видео\nтак тчо думаю что зеронет имеет смысл перевести на работу поверх ипфс",
				"added": 1497264290
			},
			{
				"comment_id": 5,
				"body": "> [murka](#comment_25_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Нет. IPFS — это только P2P файлообмен и перманентная адресация. ZN ничего особого в этом плане не представляет.\n\nи насчёт файлообмена почему ипфс не может раздавать,например, видео файлы с файловой системы как торенты? - ну ведь глупо же сделали - чтобы смотерть фильм он должен быть в фс, стобы раздавать он должен быть в бд ипфс  в итоге занимает в 2 раза больше места",
				"added": 1497264719
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 3,
				"body": "вон уже попадаются сайты с хостингом картинок и видео а ipfs\nа текаст тоже можно разбить на кучу хтмл файлов",
				"added": 1497260871
			}
		]
	},
	"comment_vote": {}
}