{
	"title": "Sans3 Blog FR",
	"description": "Pour votre santé:\nPirater jusqu’à 5 ordinateurs et téléphones par jours !   ",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n*   [Mon ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1KkQmWnbZatijrNzgs4qtyyYcAXyEt3qgr/sans3@zeroid.bit)\n*   Désolé mais le mode sombre ne marche pas encore.\n\nUn jour je corrigerai mais fautes d'orthographes :)\n\n02/03/19\n\nRegardez mon ZeroMe j'enverrai des captures d'écrans de ce que je fait pour le prochaine article...",
	"next_post_id": 5,
	"demo": false,
	"modified": 1551524238,
	"post": [
		{
			"post_id": 4,
			"title": "Sécuriser son Debian 9",
			"date_published": 1551278283.694,
			"body": "![295290_282554781818571_126894987384552_649255_648415263_n.jpg (450x380)](data/img/post_4_295290_282554781818571_126894987384552_649255_648415263_n.jpg)\n\nAujourd'hui, puisque qu'est j'ai encore des soucis avec VirtualBox, je vais vous montrer comment je sécurise mes systèmes d'exploitations. En l’occurrence, Debian Stretch.\n\n* * *\n\n## Comment sécurisé un Debian ?\n\nPour vous expliquer, je possède un ordinateur portable équipées d'un Debian Stretch.\n\nDebian est l'une des distributions linux les plus stables aux mondes. Cependant, le développeurs ne peuvent résoudre chaque failles de sécurité en un temps record. C'est pour cela qu'il est essentielle de configurer son Debian pour éviter l'infection ou prévenir le vol de données.\n\nIl existe un document officiel français complet qui vous apprend comment sécurisé votre debian : **[https://www.debian.org/doc/manuals/securing-debian-howto/securing-debian-howto.fr.pdf](https://www.debian.org/doc/manuals/securing-debian-howto/securing-debian-howto.fr.pdf)**\n\n### **>> les mesures évidentes :**\n\nIl y a bien évidement des mesures évidentes à prendre,\n\n*   Premièrement, Chiffrer votre disque dur ! Il est important de chiffrer ses données, en cas de vol de votre disque dur, vos données resteront saines et sauves. Pour cela choisissez lors de l'installation, de créer un volume chiffrée.\n\n*   Deuxièmement, choisissez un mot de passe fort !\n\n_Lecteur : Merci, sans blague je savais pas_.\n\nNon mais, choisissez un mot de passe d'au moins 10 caractère avec des chiffres et des lettres minuscule et majuscules pour votre compte root et votre compte user. Et grand minimum 15 caractères pour votre clé de chiffrement. Une technique que j'apprécie particulièrement est d'écrire une phrase avant transformer en language SMS, ensuite on lui remplace des lettres par des chiffres et des caractères spéciaux. Ex :\n\n_Phrase normale :_ **Zeronet c'est vraiment un réseau super bien !**\n\n_Mot de passe :_ **ZE50n4t_/CeSt--75AiMent_11_Rze4u/\\sUp5r=B1eN**\n\nC'est déja meilleur :D\n\n### **>> les mesures pas évidentes :**\n\nPour sécuriser notre debian voila ce qu'il nous faut :\n\n*   SELinux activé avec AppArmor\n\n*   Grsec-base\n\n*   ClamAV et Firejail\n\n## SELINUX ET APPARMOR\n\nSELinux est un programme de contrôle d'accès initialement conçu par la NSA. Heureusement pour nous, il à était rendu public avec son code source. C'est de l'isolation à l'état pur !\n\nAvant tout, je vais vous demander d'ajouter à votre Debian le repository backports :\n\n`sudo apt-get install apt-transport-https`\n\n`sudo cat \"deb http://ftp.fr.debian.org/debian/ stretch-backports main contrib non-free\" > /etc/apt/sources.list`\n\n`sudo apt-get update`\n\n`sudo apt-get upgrade`\n\nNous venons d'ajouter le repository backports à notre Debian stretch, ce repository contient des retroportages ou des paquets en plus. A présent nous allons installer SELinux :\n\n`sudo apt-get install selinux*`\n\nNous venons tout juste de télécharger SELinux et ses polices. Effectivement, SELinux possède un système de polices qui permet de gérer les permissions de chaque applications. Une fois l'installation terminer nous devons activer SELinux dans le kernel :\n\n`sudo selinux-activate /* tout simplement */`\n\nMaintenant nous allons installer AppArmor par dessus, qui lui aussi a était crée dans le même but, ça nous rajoutera une protection supplémentaire :\n\n`sudo apt-get install apparmor*`\n\n`sudo mkdir -p /etc/default/grub.d`\n\n`echo 'GRUB_CMDLINE_LINUX_DEFAULT=\"$GRUB_CMDLINE_LINUX_DEFAULT apparmor=1 security=apparmor\"' \\ | sudo tee /etc/default/grub.d/apparmor.cfg`\n\n`sudo update-grub`\n\nEt voila ! Il nous suffit de redémarrer pour activer SELinux et AppArmor, ils isoleront les ressources de l'application et empêcheront d'éventuelles atttaques buffer overflow.\n\n## GRSEC-BASE :\n\nGrsec-base est un paquet debian contenant les programmes open-sources du patch de sécurité Grsecurity. Grsecurity est pour l'instant le seul et unique équivalent d'un antivirus sur linux. Il va crée un _Hardened Kernel._ Ce noyau linux patché sera extrêmement stricte sur l'isolation des ressources et l'accès aux fichiers. Certaines failles Zero-Day peuvent ne plus fonctionner avec ce kernel... Malheureusement pour nous, nous n'allons pas télécharger le patch entier car il faut payer pour l'avoir, Nous allons uniquement télécharger ces programmes les plus importants.\n\n`sudo apt-get install linux-grsec-base pax-utils paxctl paxctld`\n\nNormalement apt va directement installer le patch dans le kernel via dkms.\n\nVous pouvez redémarrer votre ordinateur pour appliquer les corrections :)\n\n## CLAM AV ET FIREJAIL\n\nCes deux derniers programmes sont vraiment peu importants. Clam AV est un moteur d'antivirus open-source utilisé uniquement pour du scan de fichier. Firejail est juste un logiciel de sandbox SUID.\n\n`sudo apt-get install firejail* clamav clamtk`\n\nTout simplement. Cependant, attention ! Firejail utilise des polices spécifiques à chaque applications, il se peut qu'il vous bloque l'accès à certains fichiers. Ex:\n\n*   Firefox et Chromium n'ont accès qu'au dossier _Téléchargements,_ vous ne pouvez pas déposer ou aller chercher un fichier dans un autre dossier\n\n*   Audacity n'a accès qu'au dossier _Musique_.\n\n*   Documents de Gnome n'a accès qu'au dossier _Documents_.\n\nPour ClamAV, utilisez son interface graphique _clamtk_ pour planifier un scan de fichier quotidien.\n\n## CONCLUSION:\n\nOui, cette article était très ennuyeux mais je pense un minimum instructif. J'ai écris cet article en attendant de réparer mes bugs sur VirtualBox, pour la prochaine fois on apprendra à effectuer des attaques en buffer overflow.\n\nLes programmes que je vous est présenté ici ne sont pas l'unique et seul moyen de se défendre, vous pouvez créer des containers virtuels LXC, qui seront entièrement virtualisé, ou alors utilisé QubesOS pour les plus courageux d'entres vous :D\n\nPour finir, sur Debian Sid, il existe un paquet qui contient absolument toute la suite Grsecurity, ainsi qu'un programme virt-sandbox, qui permet de créer rapidement des containers LXC pour une application.\n\nMorale : Ne négligez jamais la sécurité d'un système.\n\n### Les références :\n\n[https://packages.debian.org/stretch-backports/linux-grsec-base](https://packages.debian.org/stretch-backports/linux-grsec-base)\n\n[https://www.debian.org/doc/manuals/securing-debian-howto/securing-debian-howto.fr.pdf](https://www.debian.org/doc/manuals/securing-debian-howto/securing-debian-howto.fr.pdf)\n\n[https://wiki.debian.org/AppArmor](https://wiki.debian.org/AppArmor)\n\n[https://wiki.debian.org/SELinux](https://wiki.debian.org/SELinux)\n\n[https://grsecurity.net/](https://grsecurity.net/)\n\n[https://www.clamav.net/](https://www.clamav.net/)\n\n[https://firejail.wordpress.com/](https://firejail.wordpress.com/)\n\nA+ pour d'autres articles, Bises !"
		},
		{
			"post_id": 2,
			"title": "Un peu de lecture ça vous dit ? ",
			"date_published": 1551128305,
			"body": "<center>![934b82427712b4e94d9c52a7e0b1a02c--library-humor-library-quotes.jpg (498x380)](data/img/post_2_934b82427712b4e94d9c52a7e0b1a02c--library-humor-library-quotes.jpg)</center>\n\nÇa vous dit un peu de lecture ? Ça tombe bien j'ai justement dans la poche trois livres sur le piratage qui pourrait vous intéresser...\n\n* * *\n\nEn effet, contrairement à se sacré Ass5mbler (qui vous passe le bonjour d'ailleurs), j'ai pu lire des livres pour améliorer mes connaissances sur le sujet et approfondir ma pratique. J'en ai lu trois :\n\n<center>![41IYVukKTeL._SX352_BO1_204_203_200_.jpg (354x499)](data/img/post_2_41IYVukKTeL._SX352_BO1_204_203_200_.jpg)</center>\n\n*   **Les bases du hacking**, de Patrick Engebretson. Ce livre de 211 page de savoir vous permettra d'apprendre a utiliser des programmes pour le pentesting, ce n'est vraiment pas du hacking a l’état pur, mais c'est tout de même très utile d'avoir ce livre qui peut servir de dictionnaire à programme.\n\n<center>![51umj-whaeL._SX352_BO1_204_203_200_.jpg (354x499)](data/img/post_2_51umj-whaeL._SX352_BO1_204_203_200_.jpg)</center>\n\n*   **Hacking, Sécurité et tests d'intrusion avec Metasploit**, de David Kennedy, Jim O'Gorman, Devon Kearns et Mati Aharoni. Le guide absolu à suivre pour apprendre à utilisé Metasploit Framework, une pur merveille, ce livre de 377 page est un recueil de lignes de commandes en tout genres.\n\n<center>![51jVkNPEXFL._SX352_BO1_204_203_200_.jpg (354x499)](data/img/post_2_51jVkNPEXFL._SX352_BO1_204_203_200_.jpg)​​​​​​​</center>\n\n*   **Techniques de hacking**, Jon Erickson. Le seul et l'unique, 498 pages de savoir ancestraux qui se transmettent de hacker en hacker :D Ce livre vous apprendra comment réellement hacker ! Vous apprendrez le language C et comprendrais comment exploiter des failles de buffer overflow, utiliser des library de sniffing réseau et mêmes les bases de la cryptographie moderne !"
		},
		{
			"post_id": 1,
			"title": "Bienvenue tout le monde !",
			"date_published": 1433033779.604,
			"body": "### **Qui es-tu ?**\n\nSalut à tous, je m'appelle effectivement \"Sans3\" en l'honneur de ce vieux squelette fan de ketchup du jeu Undertale. Je suis français d'origine toulousain, et comme \"Ass5mbler\", j'ai décidé de faire un blog sur le piratage. Puisque que nous sommes amis j'ai le droit de le faire chier... :D\n\nPuis de toutes façon, il n'a même pas continué son ZeroBlog. Et je doute qu'il se reconnecte un jour à son compte. A se demander si il n'a pas perdu sa clé privée se con, il refuse de me dire pourquoi il ne revient pas.\n\nEnfin... J’espère pouvoir palier ces torts et produire un ZeroBlog digne de ce nom, j'ai trouvé l'idée drôle et amusante alors je me lance !\n\n* * *\n\n### **Que vas tu faire sur ce blog ?**\n\nJe ne vais pas passer par quatre chemins :\n\n*   Ce blog à pour but de partager mes progrès en matières de piratage, pour ceux qui veulent en apprendre de plus. Qui sais ? Peut-être que je vous apprendrais quelque chose après tout.\n*   De plus, je fournirai certains conseils sur comment mieux sécuriser vos appareils et bien choisir vos logiciels.\n*   Nous vivons dans un monde dur et froid, dans le quelle des crackers et des multinationales affamés veulent nous faire la peau ! Alors attention...\n\n### **Pourquoi ZeroNet et pas un Blog WordPress ?**\n\n**Pour ce qui ne serai pas au courant:**\n\nLe 21 mars 2019, une Loi va être voté pour empêcher la diffusion en ligne de contenu jugée terroriste par les GAFAM. Comme notre centre d’intérêt est celui du piratage, il est évident de s'installer sur un réseau difficilement censurable.\n\n**Pourquoi pas Tor, i2p ou Freenet ?**\n\nTout simplement parce que :\n\n*   Tor est lent et il me faut un serveur centrale que je n'ai pas la capacité d'acquérir personnellement, loué chez un hébergeur me rendrez contraint d'obéir à cette censure automatisé malgré le réseau Tor.\n\n*   i2p c'est la même chose, de plus il n'est pas aussi facile à mettre en route que le navigateur Tor ou ZeroNet par exemple...\n\n*   Freenet est malheureusement aurait été une solution parfaite si il n'était pas aussi lent et contraignant, ne pas posséder de JavaScript sur ça page est juste chiant, littéralement...\n\nLa solution idéal a ce problème aurait été IPFS pour InterPlanetaryFileSystem. Mais il n'est pas accessible au plus grand nombre.\n\n**Et donc du coup ?**\n\nEt donc du coup Zeronet est ma seule échappatoire pour pouvoir proposer une plateforme de partage confidentiel et anonyme qui sera accessible au plus grand nombre.\n\n### **Pour me contacter ?**\n\nPour discuter d'un article n'hésitait pas à me poser des questions ou a rectifier dans la partie commentaire. Si c'est un sujet important ou autres, utilisé mon ZeroMail : sans3@zeroid.bit\n\n### Voila... Tout est dit sur moi ! je vous souhaite une bonne lecture sur mon blog, Bise :D"
		}
	]
}