{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_134H6j2WD4eNs419dmJEtZryr3NrsEuvFP": 1
	},
	"next_comment_id": 11,
	"comment": {
		"4_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 1,
				"body": "Попробуй поискать информацию в [Хроникусе](http://127.0.0.1:43110/12SLt41uPQUYVY1GR6SPWyNYnHWAvG1neC/tech/radionics/it/text/001.html), вбив запрос `ZeroID`.",
				"added": 1553422525
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 2,
				"body": "> [skrimix](#comment_2_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU): Насчет глушилок сомнительно...\n\nДля начала чиновники усложнят работу OneWeb в России. Например, постановлением от 21 февраля правительство внесло изменения в Правила использования на территории страны спутниковых сетей связи, находящихся под юрисдикцией иностранных государств: https://www.rbc.ru/technology_and_media/26/02/2019/5c73f8109a79470cf4ea49c2",
				"added": 1555250804
			}
		],
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": [
			{
				"comment_id": 3,
				"body": "Вернулся из Португалии: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:146",
				"added": 1559785655
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 4,
				"body": "Волчья любовь к «Яндексу» (цитата Волкова из публикации https://www.znak.com/2019-12-25/pochemu_rossiyskim_vlastyam_vazhno_nauchitsya_tochechno_otklyuchat_internet_k_2021_godu):\n\n> \"Я «Яндекс» люблю, и уважаю, и считаю, что это отличная компания с хорошей корпоративной культурой, которая делает офигенные штуки. <...> В попытках сохранить самостоятельность и не допустить недружественное поглощение государством «Яндекс» сторговался на что-то ещё\"",
				"added": 1577437100
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 5,
				"body": "=^.^=",
				"added": 1585267337
			}
		],
		"1608920071_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 6,
				"body": "Писать русскими буквами на зайте рука не позволяет? Или \"Viva America\"?",
				"added": 1609839520
			},
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_152_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): сократить аудиторию в ~6 раз? хорошенькое предложение . в следующий раз, когда мне это будет интересно, попробую так и сделать\n\nКакую «аудиторию»? Англоязычную? Это как раз и есть «хорошенькое предложение», чтобы развивать русскоязычное сообщество в ZeroNet, и не плакать потом, что русском zero-сегменте мало качественного контента. Если «интересно», то попробуй «так и сделать».",
				"added": 1609894889
			},
			{
				"comment_id": 8,
				"body": "> [smashbuckler](#comment_16_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Выучи английский...\n\nАнглийский я знаю. Здесь дело совсем в другом (если ещё не понял).",
				"added": 1610069413
			}
		],
		"1612510082_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 9,
				"body": "> [cra](#comment_159_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): ...Автор идиот или держит других людей за идиотов?..\n\nАвтор — Сергей Финько — держит других за идиотов. В том видео некий Инсайдер, голосом страдающего запорами, ничего не сказал по существу, одни понты типа: «имеющий уши, да услышит». Пустое около двухчасовое видео, причём с отключенными комментариями.\n\nВ другом видео с названием «Меня хотели убить.Встреча с Инсайдером.О чем я молчал целый год» (https://youtu.be/bZMlKZ6udlQ) Сергей Финько рассказывает, как по прошествии некоторого времени после встречи с Инсайдером, он, в гостях у своих знакомых (в районе Бруклина), лёг спать, а потом его разбудило «нечто» и он увидел двух челобреков с конусообразными плафонами вместо головы. Сами челобреки были метр с кепкой. Внезапно один из челобреков выпустил щупальца-трубки и подсоединил их к голове Финько, чтобы выкачать из него великую и тайную информацию. Но Финько стал сопротивляться — он вышел в астрал и стал биться с челобреками «не на жизнь, а на смерть». К рассвету всё кончилось — наш герой одержал победу и не дал высасать из себя информацию. После этого прошла неделя, потом он уехал в Лос-Анжелес, а после — в Москву. В Москве Финько пошёл к «своему» парикмахеру, который обнаружил у него на голове выженный круг — в аккурат в том месте, куда подсоединялась трубка для выкачки информации (в это время на экране нам показывают фотографию затылка, где вместо выженного круга виден овальный участок выстреженных волос). Причём сам Финько, когда чесал свою голову, почему-то не замечал отсутствующий клок волос.\n\nСергей Финько таким образом зарабатывает, поставив на поток и коммерсализировав эзотерические материалы — курсы, книги и прочие поделия Финько стоят денег. Люди, которые несут «просветлённую» информацию за деньги, не вызывают доверия, чем те, кто делает это открыто и от души. Отсюда возникает парадоксальный вопрос: разве может Инсайдер и Орден Хранителей, которые «борятся» с капитализмом, обратиться к коммерсанту Финько? Ответ: может. Заходим на сайт Хранителей (https://www.evolution-simple.com/insiderorder), сделанный некоей «бизнесменшой» Надеждой Воробьёвой (https://www.evolution-simple.com/), и видим ту же маркетинговую схему, но слегка завулированную. Чтобы вступить в Орден Хранителей, нужно сделать взнос — это называется «Утилизация денег»; если нет денег — занимайся распространением материалов (причём на вражеском капиталистическом YouTube'е).\n\n**Да здравствует вождь Ордена Хранителей — пробуждённый Иосиф Сталин!**",
				"added": 1612671960
			}
		],
		"1615652099_15JFnMnQDvpoERDBankFjwVSpiaLSsTTxq": [
			{
				"comment_id": 10,
				"body": "> [higgsbozon](#comment_13_193YCP9moB9iMgASvyoy89d8J4YHr51xS1): Какое разрешение требует этот сайт [Grant&Add]\n\nСпрашивает разрешение на добавление сторонних медиафайлов с других ресурсов ZeroNet. Например, на этой странице спрашивается разрешение на добавление файлов из [ZeroUp Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/) — если разрешишь, то загрузятся две картинки и отобразятся в тексте выше.",
				"added": 1615941428
			}
		]
	},
	"comment_vote": {
		"23_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"32_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": 1,
		"157_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1
	}
}