{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1570206751,
			"title": "The Pirate Bay http://uj3wazyk5u4hnvtk.onion/ , Is it down for you too?",
			"body": "I'm unable to reach TBP's hidden service as of this morning. Other onions are reachable for me. \n\nCan someone check to see if it's also down for them? \n\nhttp://uj3wazyk5u4hnvtk.onion/",
			"added": 1570206750
		},
		{
			"topic_id": 1570208803,
			"title": "How can an American assist Chinese users in circumventing the GFW?",
			"body": "What practical measures can an American take to assist Chinese users to continue to have access to ZN? \n\nI'm finding that the technical information about the various technologies that the CCP is using are often very vague and the information seems to change all the time. This is reasonable, since technology changes all the time. \n\nI know that the GFW targets commercial VPN providers like PIA and Nord in the sense that they just block all the known entry points, poison DNS table , and that in some cases when they're unable to spy on the data stream due to whatever encryption, they'll kill your connection. I think that this would make it unproductive to set up a US based VPS that my Chinese friends could just tunnel into, since I can expect the GFW to catch it fairly quickly. \n\nGiven the unknown, ever changing nature of the GFW, and the dedication to destroying the global internet that various governments have shown, what can a layman possibly due to help?\n\nI don't have 15,000 miles of cat5 laying around, and I don't own any satellites. I do have friends in China that need to be able to reliably reach me and others in the US using some service that is anonymous and hidden. \n\nMy sense is that ZN is reasonably reliable, but I see many Chinese language pages that appear to have been updated for a long period, and then were abandoned. Is the Chinese ZN just so isolated that it exists separately from us in a kind of balkanized way? Or is this the result of Chinese government countermeasures?",
			"added": 1570208801
		}
	],
	"topic_vote": {},
	"next_comment_id": 23,
	"comment": {
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 1,
				"body": "> [fartknocker](#comment_15_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E): LMFAO, WHAT THE FUCK IS A GLOWNIGGER?\n\nSon you need to get learned on some Terry A. Davis.",
				"added": 1570076462
			}
		],
		"1570142685_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": [
			{
				"comment_id": 2,
				"body": "but there are only like 10 people on ZN, would we each get our own category?",
				"added": 1570152640
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 3,
				"body": "> [ratsmack](#comment_83_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): It's because no one wants to contribute to the network, because it takes resources such as hardware and bandwidth. Also, people fear that illicit content may cause them to be subject to scrutiny. The majority just wants to be a leach and there is no incentive to do otherwise.\n\nIt cost me $100. I bought a used business pc for 50, slapped in a cheap 500g ssd and some $12 cheapo amazon ram and now i'm hosting a few hundered zites. it's easy.",
				"added": 1570153043
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_184_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Let's take a fun scenario of probabilities to see why zeronet has so few users. [...]\n\nI've been thinking about how to lower the entry bar. I'm not sure it would be a wise thing to do, but I still think it deserves thought. \n\nThe only way I can come up with that would even be mildly practical to make ZN more widespread and user friendly would be for someone to start selling old model (cheap, probably used) raspberry pi boards in rudimentary (cheap) cases for protection and to increase the robustness. These would be preloaded and ready to run with debian, tor, ZN w/ all plugins, ui password and ui ip already configured. On the casing would be the default IP of the device. All the purchaser would need to do is plug it into their router, and connect to power. Boom. \n\nA raspberry pi zero is $5 on amazon and cheaper in bulk, we'd need maybe $10-20 in other supplies, again, less in bulk. 30 minutes assy time assuming the cases were preformed injection molded. Purchases in bulk these would be inexpensive. \n\nTo make the entire thing worth it (break even, pay ourselves, pay the assemblers, etc.)  we'd need to move somewhere around 5000-10000 units. I don't think this is unmanageable. \n\nAnyone with a pulse can purchase and connect a $50-70, pre-configured ZN node. Each person who does builds and strengthens the network. \n\nThe primary issue I see is marketing.",
				"added": 1570153836
			},
			{
				"comment_id": 12,
				"body": "> [kusoneko](#comment_82_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I think the 1pgallery posts on there nail it, you can advertise 0net as much as you want, but if there's still very little content like there is now, you might get users visiting but no one's gonna stay. User retention is as much a problem as user count.\n\nI think users expect to be entertained. In fact, I think most people have been somewhat conditioned to expect to be entertained. ZN doesn't cater to those people very well. (should it?)",
				"added": 1570234569
			},
			{
				"comment_id": 13,
				"body": "> [reichardnixon](#comment_20_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): I havent looked into how easy it is to make website on zeronet but if there was a weebly type version of website creation that would be amazing. Also, making sites like FB and Youtube on here but without the censorship.\n\nSites like youtube exist already on ZN, they just aren't popular.",
				"added": 1570245084
			},
			{
				"comment_id": 15,
				"body": "> [reichardnixon](#comment_21_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Well we need to find one that has good features and without censorship and promote that on clearnet and on here. People wont leave their island unless they think the grass is greener on the other side.  [...]\n\n\nHere is the official location for zites. \nhttp://127.0.0.10:43110/Sites.ZeroNetwork.bit/\n\nHere is a nice fat list of zites snagged from ZeroSites (Courtesy of RandomShits) \nhttp://192.168.0.10:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1567130023_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY/+1839+zeronet+sites+from+ZeroSites+Last+Scrape+Aug+29+2019\n\nGifs\nhttp://192.168.0.10:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/\n\nSomething like youtube\nhttp://192.168.0.10:43110/big.kopykate.bit/\n\nI'm eating to much of my quota. Just get started on these.",
				"added": 1570275633
			},
			{
				"comment_id": 17,
				"body": "> [caryoscelus](#comment_266_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Does that actually work for you?\nMy ZN box lives on my home network. When I'm on that network, I access it by it's local IP. I never run ZN on my laptop because I spends most of it's time out of the house with me, and I don't want ZN eating my entire mobile data package. \n\nI find that the ZN client UI server automatically changes most 127.0.0.1to what I need them to be. Sometimes it doesn't but I haven't spent the time to dig into why.",
				"added": 1570316030
			}
		],
		"1570196788_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "I've saved a couple of tired honey bees that I found on the ground by giving them water with dissolved sugar. You just dip a q-tip into the end of the solution and hold it near their face. I found that with a bit of sugar, hydration, and being placed in a shaded area, they're usually ready to get moving again after a little while. Not sure exactly what causes them to end up in this state. Perhaps they went to far from home? Bad food? High summer temperatures?",
				"added": 1570206585
			}
		],
		"1570206751_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 6,
				"body": "> [saintian](#comment_10_1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC): It was down on one union circuit but when I renewed identity it worked.\n\nThanks for checking. It's working for me now.",
				"added": 1570207431
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 7,
				"body": "> [kai0](#comment_1085_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): Turn technical issues into complexity issues. [...]\n\nSo just grab Chinese language content from clearnet and move it into ZN. Easy.\n\nWhat the the most populated chinese language zites where I can provide content and take requests?",
				"added": 1570211374
			},
			{
				"comment_id": 8,
				"body": "> [kai0](#comment_1086_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): Actually, there are no active Chinese websites in the zeronet, because the Chinese have not yet recognized the difference between technical and complex problems. [...]\n\n> [kai0](#comment_1086_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): Actually, there are no active Chinese websites in the zeronet, because the Chinese have not yet recognized the difference between technical and complex problems. [...]\n\nI'm going to send you a message in ZeroMail",
				"added": 1570213278
			},
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_425_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I have a related (maybe dumb) question.  Is the GFW filtering DNS queries to block websites, or are they blocking some other way?  So, if you type the IP address of the website, instead of the domain name of the website, will you get through?\n\nOne of the many techniques they use is called DNS poisoning. You make a request for an IP using the human readable name, and they intentionally send you garbage. Alternatively, it you just use the IP, they just kill the connection and send you to garbage.",
				"added": 1570215443
			},
			{
				"comment_id": 11,
				"body": "> [xcape2net](#comment_426_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): OK.  Then having a big list of IP addresses on ZeroNet for domain names wouldn't help.\n\nTo access disallowed sites they either have to use VPN, or something like ZN that they can't block or censor. Not sure it tor is effective for getting out of china.",
				"added": 1570216001
			},
			{
				"comment_id": 14,
				"body": "> [ssdwb](#comment_2_1BvoHeSKWGSUrNxhDXg8Sj5mLqsCoQDcn): Is the friend you said just yourself?\n\nWe'll never know.",
				"added": 1570245172
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 9,
				"body": "> [petrina](#comment_24_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): Glad you think so, would not want to share a mail server with a moron like you.\n\nAre you still on ZeroNet? You seem like a real cunt.",
				"added": 1570213777
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "I've burned 1/5th of my limit, but I'll bite. Keep in mind, I ask in good faith, and to find out what your underlying thinking is. I have no dog in the fight on vapes, so I'd like to ask someone who appears to. \n\nWhy should vapes not be banned for the sake of public safety, when they appear to pose a clear and present danger to young people? \n\nWhat is the utility of vaping, such that it should be protected and allowed to occur? \n\nWhy shouldn't we penalize large tobacco companies by eliminating their ability to push flavored vape products to young people? After all, it is large tobacco companies that largely own and operate the various vape product manufacturers. \n\nThe gov't can, and does ban things for various reasons. Sometimes for frivolous reasons, usually because there is a good reason to do so. I am not making an argument for trusting the gov't, merely asking why banning flavored vape products does not fall under the category or government fulfilling its proper function in your opinion.",
				"added": 1570294399
			},
			{
				"comment_id": 18,
				"body": "> [edgelordofdecent](#comment_137_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): @noquatKeep sucking the tobacco companies dicks that you claim you are fighting against.\n\nYou either didn't read, or didn't understand what I wrote. If you had you'd see why what you wrote makes no sense in this context.",
				"added": 1570449822
			}
		],
		"1570424918_1E8arVz12goVNFdsniWbQGnGBA4KT2aYZG": [
			{
				"comment_id": 19,
				"body": "either it doesn't have any peers seeding it, or you aren't able to connect to the peers that have it.",
				"added": 1570449948
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 20,
				"body": "Easy.\n\n\"You will say you are a communist, you will act like a communist, you will support this communist govt. You will either do this, or I will throw you, your wife, and your young children into work camps where they will be worked to death.\"\n\nIf you have the manpower and resources to back up this statement, you can force tens of millions of people to conduct themselves just about any way you want them too. \n\nRepeat above statement for most violent historical political moments, or some variation thereof.",
				"added": 1570463934
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 21,
				"body": "I recognize that different races have different characteristics stemming from different genetics. These differences can extend to average intelligence of the group and other factors. Does this make me a racist? Does noticing things make me a racist? If so, why should I care?",
				"added": 1570542817
			}
		],
		"1570496389_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 22,
				"body": "Just use your real one. If you have useful skills then you just need to freelance for a few years to build up your rep. Honestly, as long as your useful most people don't give a shit about your past. Freelance, make money, resist the temptation to soil your real identity.",
				"added": 1570544974
			}
		]
	},
	"comment_vote": {
		"83_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"2_1HHdE1Y1sreeMDp9zmUdVDtGMJhNVn8c3e": 1,
		"34_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	}
}