{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1616487037,
			"title": "[MEGA POST] - The UNO take over of the USA -",
			"body": "Right now and since a while it's consolidation phase with the introduction of the federal reserve (unlimited supply of cash for those following the UNO agenda, at the time called league of nations) and the entry into ww1 and the recent elimination of free speech from main stream platform.\n\nnext step is the 2ndA !\n\n- The Sandy Hook Elementary School shooting occurred on December 14, 2012\n- The Arms Trade Treaty (ATT) is a multilateral treaty that regulates the international trade in conventional weapons.  Sealed\t2 April 2013\n\nnow it's implementation time by Russel L. Honoré who is best known for serving as commander of Joint Task Force Katrina \n\n\"We pee on the floor. We are like animals,” Taffany Smith\"\nhttps://nypost.com/2005/09/02/nightmare-of-robbery-filth-death-rape-in-superdome/",
			"added": 1616487036
		},
		{
			"topic_id": 1616487068,
			"title": "[MEGA POST] China",
			"body": "ahhh ! finally, civilization !",
			"added": 1616487066
		},
		{
			"topic_id": 1616487804,
			"title": "[MEGA POST] Infowars",
			"body": "This is a mega post on infowars... as on every respectable software, every opinion is welcomed !",
			"added": 1616487801
		},
		{
			"topic_id": 1616488512,
			"title": "[MEGA POST] Israel",
			"body": "A mega post about israel... everyone welcome, neonazis, hasbara, haredims, who ever... even gay/lesbian of telaviv...",
			"added": 1616488508
		},
		{
			"topic_id": 1616490001,
			"title": "‘More Masks Than Jellyfish’: Covid Mask Pollution Is Destroying Ocean Ecosystems, Wildlife",
			"body": ">An estimated 1.56 billion masks polluted oceans in 2020, \"amounting to between 4,680 and 6,240 metric tonnes of plastic pollution\"\n\n>While Covid face mask mandates have proved lucrative for governments, the pharmaceutical and PPE industries, and health officials, they have taken a devastating toll on the world’s oceans and wildlife according to ecological and environmental experts.\n\nhttps://nationalfile.com/more-masks-than-jellyfish-covid-mask-pollution-is-destroying-ocean-ecosystems-wildlife/",
			"added": 1616489996
		},
		{
			"topic_id": 1616855237,
			"title": "[MEGA POST] IRAN",
			"body": "is open for business !!!! WOOOOOOOOOoooooooooooooooooooooOOO!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\napplause !!! more applause !!!! \n\nI can wait for the american revolution !!!",
			"added": 1616855231
		},
		{
			"topic_id": 1616858507,
			"title": "[MEGA POST] the claims over formerly north america?",
			"body": "start your engines...  it's simple \n\nfirst to win, and able to secure, has.\n\nthere is no other law.\n\nwho will it be? that's the question...\n\nI like the mexican expand ! la reconquista enhanced !\n\nwho else?\n\nI am sure there will be big challengers storming :)\n\nwhat makes me laugh is the peons who call themsleves patriots of militias...\n\nthose filths did NOTHING against PEDOGATE...\n\nnothing : AKA COWARDS !\n\nall talk, no chew :).\n\nwrong, they chew and talk\n\nbut don't kill...\n\npfff\n\ntheir own kids raped while send in fake wars.... just lol the stupidity.",
			"added": 1616858500
		}
	],
	"topic_vote": {
		"1616492110_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32": 1
	},
	"next_comment_id": 53,
	"comment": {
		"1616485572_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32": [
			{
				"comment_id": 1,
				"body": "we definitely need a zerotalkmusic !",
				"added": 1616486345
			},
			{
				"comment_id": 8,
				"body": "> [medik](#comment_2_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32): Chillsynth\n\nwhat do you like in this genre? anything open sourced?",
				"added": 1616488687
			},
			{
				"comment_id": 9,
				"body": "> [medik](#comment_5_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32): http://127.0.0.1:43110/15oXfMAMMKT59vVuqdXxjD7Mv24BmCyafu/\n\ngreat! thanks ! picture free? only text like here?",
				"added": 1616489664
			},
			{
				"comment_id": 10,
				"body": "Can't you change the header to Zerotalk Music?",
				"added": 1616489781
			},
			{
				"comment_id": 13,
				"body": "for example : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/ Zerotalk tech...\n\nso for me zerotalk music is great simple and precise... I don't know how they did it... maybe in data > addy > content.json or the html file...",
				"added": 1616490199
			},
			{
				"comment_id": 14,
				"body": "in content.json he put  :  \"description\": \"Talk about Technology Topics\", and in index.html  <title>ZeroTalk Tech</title>\nshould work once you sign it :)....",
				"added": 1616490311
			},
			{
				"comment_id": 15,
				"body": "yep saw the update, maybe a space bewteen zerotalk and music... like ZeroTalk Music :) details...",
				"added": 1616490373
			},
			{
				"comment_id": 16,
				"body": "don't forget to destroy your key once you are done...",
				"added": 1616490970
			},
			{
				"comment_id": 17,
				"body": "> [medik](#comment_7_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32): c17h21no4 How to go about that?\n\ndata : user.json trash (+format to be sure). so that no one can use it again to wipe the forum (unless they find it otherwise) :).",
				"added": 1616491488
			},
			{
				"comment_id": 18,
				"body": "> [medik](#comment_8_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32): Bump.\n\nsee below (update)",
				"added": 1616491713
			},
			{
				"comment_id": 20,
				"body": "you have to have zerotalk software terminated... :).",
				"added": 1616493220
			}
		],
		"1615799674_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 2,
				"body": "updates?",
				"added": 1616486393
			},
			{
				"comment_id": 11,
				"body": "ZeroTalk Music : http://127.0.0.1:43110/15oXfMAMMKT59vVuqdXxjD7Mv24BmCyafu/",
				"added": 1616489960
			}
		],
		"1616487068_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": ">Guilin is a prefecture-level city in the northeast of China's Guangxi Zhuang Autonomous Region.It is situated on the west bank of the Li River and borders Hunan to the north. Its name means \"Forest of Sweet Osmanthus\", owing to the large number of fragrant sweet osmanthus trees located in the region.\n\nSo many emperors have dreamed to visit this mystical place :) but imperial life had so many constraint ! lucky Sergey !",
				"added": 1616487193
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 4,
				"body": ">British Journalist Exposes Worldwide Conspiracy To Crush Lockdown Protestors, Coddle BLM\nhttps://www.banned.video/watch?id=60580d3725dbf05643307f9b\n\nI found this video super funny ! Jack Hadfield (the serf) is so totally from another world as Tom Pappert !\n\nIf I may say politely, Tom Pappert is Cartman on an horseback with a notebook :) (why only a notebook? when you ride with the Oklahomans you don't need to carry yourself, only if you wish... but I didn't say tom wasn't carrying, just he had in hands his file... https://nationalfile.com/ )\n\non the opposite Hadfield is even worst than the mi6 serf of paul joseph watson... I mean it's a pathetic such a lvl of submission, of lack of will and thought... trained captive serfs, aka useless.\n\nanyway it was funny to see the rift !\n\nps: \n\n>Oklahoma lawmakers approve bill that allows vehicle drivers to ESCAPE violent protests, even if it means running over assailants \n\nhttp://natural3jytxrhh5wqmpcz67yumyptr7pn2c52hppvn3vanmqzjlkryd.onion/2021-03-22-bill-protesters-vehicle-escape-violent.html",
				"added": 1616488152
			},
			{
				"comment_id": 5,
				"body": ">Medical Doctor Exposes Mass Eugenics Extermination Called 'Covid-19 Vaccine'\nhttps://www.banned.video/watch?id=60428ea73282f82eeac060b0\n\nDr. Tenpenny is a great teacher ! like her very much !",
				"added": 1616488295
			},
			{
				"comment_id": 6,
				"body": ">NO MORE GAMES: Patrick Howley Goes All Out on the Information War\nhttps://www.banned.video/watch?id=604eddb7c93db1447ed84ba0\n\nOne of the most informative video of all time ! always be careful to not fall on the trap : haredims = real jew (aka not involved in anything but their own families and community life).",
				"added": 1616488402
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 7,
				"body": "first question : will bebe cheat? or how secure are israelis vote counting? we saw the us scam... temptation must be high in all \"democracies\"...\n\nsecond question : what are the direct democratic rights of the israelis?",
				"added": 1616488648
			},
			{
				"comment_id": 51,
				"body": "if trump wasn't a pedo black mailed by the hitlary / tel aviv gangs...\n\nany potus needed to respond to pedogate.\n\nI would have :\n\nlaunched 200k strikes on any offensive capabilies of israel.\n\nthen land the bitches\n\ncreate a hell high way to jerusalem\n\nstormed the mount\n\ndrop the flag on top the mosk\n\npivot to bebe bunkers\n\nclear it.\n\ndeclare victory\n\ntime to move to the domestic side.\n\nyou stole america, destroy the west...\n\nnice \n\nfor those who watched and understood.\n\nthey know...\n\nand you know, they know\n\nso you fear...\n\nthey must dissapear\n\nproblem\n\nthey are billions...\n\nyou wanted moar\n\nalways moar\n\nand used white kids as rape toys for your black mails...\n\nthat's the story of israel\n\nthe only one\n\ntaht will be forever remembered.\n\na tribe so weak\n\nthat it supported as long as it was for it's own benefits the rape of others people kids...\n\nmaybe like in egypt?",
				"added": 1616867099
			},
			{
				"comment_id": 52,
				"body": "and just to be fucking clear :\n\nI was quite upset by the always \"fake jews\" at the federal reserve... why? but at least there is a way to follow money...\n\nhowever the bolshevick jews... those filths of rats of hell... using critical theory. hiding behind \"antisemitism\" etc...\n\nto create the \"polanskis\" and co... \n\nI have a big problem with neomarxist who want to fuck the markets...\n\nand use their bolshevism as a way to prevent real regulations like not trading sexslave children or childrape rights...\n\nand of course the pedos... jews or not... \n\nand you tell me ghislaine networks protect her, and like epstein or weinstein all is gone...\n\nthat's what are american are really worth, and even westerners...\n\nthank you...\n\nit was impossible to destroy me more...\n\nthere is nothing left.\n\nbravo.",
				"added": 1616867473
			}
		],
		"1616490001_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 12,
				"body": "What's funny, is the only way to get the biodrones moving is to tell them that masks are made with CO2 too... there they go... fukushima meltdown? nah... dna pollution with gmo? nah... Emf from wireless networks? nah...\n\nonly plant food...",
				"added": 1616490091
			},
			{
				"comment_id": 19,
				"body": ">Marine plastic pollution is a pervasive problem around the world. Now, new research shows that fish are eating plastic dinners at higher rates than before, including some species that are threatened or near-threatened.\n\nhttps://www.naturalnews.com/2021-03-22-fish-ingesting-more-plastic-warns-new-research.html",
				"added": 1616491737
			}
		],
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 21,
				"body": "Don't waste your time with captain404... the thing that makes the western pedo feodalist shit their pants? is that we all move to chinese apps and tools that will developed to allow us freespeech, like those tor and co are made to attempt to breach the GFW :).",
				"added": 1616495875
			},
			{
				"comment_id": 22,
				"body": "> [captain404](#comment_23_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc):  Im your punlisher and as publisher i do what i want....My point is just i dont want crap i dont endorse on my hardware.\n\nyou should read more about decentralized p2p sharing system, like dlt, torrent, btc... go prune yourself, you are muted soon...",
				"added": 1616496154
			},
			{
				"comment_id": 23,
				"body": "ahhahah",
				"added": 1616496169
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 24,
				"body": "Eliminating all the living members of the congress is a necessity, if the usa wanted to exist and have a future.",
				"added": 1616691826
			},
			{
				"comment_id": 29,
				"body": "IMHO the best option now is to forget : and move to balkanization ! \n\nthe critical theory to instaure and consolidate bolshevism (the race based take over) is fucking way too underway...\n\npedo used to gain support for israel and blackmail bribes has ruined the reputation and credibility of all the american people, it's judiciary and LEO... while of course exposed massively the role of hte propaganda ops of the enemies.\n\nthe race wars are well underway...\n\ncensorship is complete\n\nguns rights almost gone (maybe a false flag with iran to consolidate there?)\n\nin short the senators against the entry of a certain group couldn't understand that it wasn't hte problem, it's certain people from various groups who are serious problems...\n\nanyway...\n\nin short... balkanization !\n\nthe idea is to have real red / direct democratic state (the 7) + those wanting to keeps the individual god given rights and together redo a new constitutionnal framework... \n\nthe old one has public died on the 4th november 2020, while privately when acosta gave epstein is full immunity and protected all the pedos for anyone with just a little bit of decency...\n\nso I can't imagine your rage, coumponed with your incapacity to be able to do anything...\n\nbut what did you expected? raping kids? gmo / toxic food ? autist warriors? good luck, it's intense... gime moar fiat?\n\npfff you are a shame... to mankind...\n\nand the worst are all those humans cattles who believe you...",
				"added": 1616855574
			},
			{
				"comment_id": 33,
				"body": "I am sure we can do it ! just need to hold nukes ! then the blue / controlled state will be check mated...",
				"added": 1616856155
			},
			{
				"comment_id": 34,
				"body": "it's true... it's gonna be massive, the american liberation war will be armed with nukes, I don't say used... but it has to be... otherwise the pedo from dc/nyc/la/chirak will fire...\nbut I don't think you have it anymore...\n\neven this balkanization...\n\nit's just the fall...\n\nand what's fun, what will israel do once you are swamp in turmoil?",
				"added": 1616856281
			},
			{
				"comment_id": 35,
				"body": "one aspect I forget to mention : is how in fascism the us corporate world has morphed ! from the intell pedo protectors who have powned all digital devices (thanks mccrystal, if only not to protect pedos but defend the usa and not being a slave rape dog of israhell)...\n\nand good mention is the little play in georgia... beyond the guide stone ideology, is the corporate back lash...\n\naka through the federal reserve they control the banks the banks control credit, corporation follow the diktat !\n\nit's funny...\n\nhow it's a multi front collapse\n\nthe armed collapse\nthe pedo collapse (justice from fbi to cia do doj)\nconsittutional collapse (a1, a2. a4 etc)\nsocial dislocation (when some can rape kids, and others are arrested for plants... I mean) for thy the yachts for thy the trailers !\nthe race wars ! (no support from black in regards to pedogate)... 0 !\n\nso what's left? \n\nahahahahha...\n\nthe election theft from pedotrump !\n\nbut yeah, the fascist aspect is amazing ! won't work , finance, like war has it's own laws... paper over if you wish... until you wish you hadn't ...\n\nsdr to save you? ahahhhahaha...\n\nyou are so lost in your hubris...\n\nPURGE 200k now !\n\nBut I don't think it's possible anymore...\n\nso what 's next?\n\nmore of the same?\n\nahahahahahahaa....\n\nmy biggest anger is that I felt in the trap ! I believed in the narrative, and once the veil was removed, what I hated even more than them, is myself, to have fallen in it !\n\nhow dumb I was ! and that angry's me deeply !\n\nwhy I couldn't see faster? all was clear... \n\nI guess it's just to want to believe... aka the hope trap...\n\nand that each \"revelations\" was more insane than the previous one...\n\nin short I hoped there would be a nationwide wake up call...\n\nbut no... it's too late...\n\neven with violence what will be left?\n\nat least I believe it won't be worst that without violence...\n\nyeah... violence is now to imho the best outcome, what ever the results are...\n\nanyway for me, the american story was first and formost a violent story ! a fight for liberty\n\nbetter now incarnated by CHINA !!!\n\nif only I had the chance to get it earlier\n\non the other hand it protected me from the neomarxist cultural theory trap...\n\ncan't have everything :).",
				"added": 1616858267
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 25,
				"body": "Don't forget it's for THEIR OWN GOOD that they will be all exterminated... their OWN GOOD ! why? becaue I DECIDE over their lives ! they wanted to rule mine with psycho social programation, my answer is their DEATHS ! because I will never be a fucking slave like the american people.",
				"added": 1616692112
			},
			{
				"comment_id": 26,
				"body": "and those I wish to have the RIGHTS FULLY LEGAL to kill would all the females that worked there... all 100% ever... you worked there 1 sec, you die. simply. cleanly. no fuss... nothing. maff.",
				"added": 1616692221
			},
			{
				"comment_id": 27,
				"body": "because that's the thing, it will be LEGAL... 100% !",
				"added": 1616692238
			},
			{
				"comment_id": 28,
				"body": "the only question will it be by new americans (those able to free themselves and fight and win against those things) or others... both way... 100% legal... kiss your kids asha from the fbi you will be with them... we may even force you to eat some cnn child for you to live a little bit more.... we will torture you before killing you... oh yea!",
				"added": 1616692356
			}
		],
		"1616720591_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 30,
				"body": "my favorite story is :\n\nthere was a jewish banking family in germany...\n\nthey saw their neighboor, a maff teacher sell his house next door at 5% below market price !\n\nthe jew bankers was so happy to seal such a profitable deal !\n\nthe maff guy had just one request, 2 weeks to leave\n\nthe jewish female banker wife was so happy !!! so cheap !! such a great deal...\n\nfor two weeks our maff teachers removed and pack carrefully all his stuff...\n\na few monts later, the jewish female banker told this story to one of her co camped female, showing her husband walking to take a shower...\n\nmoral of the story? when you let jimmy saville rape kids and the bbc unpunihsed, when you let 1000's girls be raped by white men using pakis as cover, when you let andrew the prince scott free...\n\ndon't expect any help\n\nand accept you may be a subject of the majesty\n\nbut you are just a serf to the state.",
				"added": 1616855755
			},
			{
				"comment_id": 31,
				"body": "serfs are :\n\ndisarmed\nlocked (no right to move)\na provide their children for rape rights if wanted by the feodal ruler\nand of course taxed.\n\nthat's a serf !\n\nnow go work.\n\nand stfu.\n\nof course are silent... you are a farm animal...\n\nbut if you wish to free yourself?\n\nyou will have to wipe 100% of hte state official of the bbc, wipe the murdoch family...\n\nthen we can start to talk about britain independence...\n\nof course the request for the brother of the king head will be hard...\n\nbut it''s an excellent marker of power.... a tracking metrics...\n\nif you own uk by violent means, superiority, example apache over buckinham.,..\n\nthe king will negociate\n\notherwise he will order to mow you down.\n\nthat's the game\n\nthe only one.",
				"added": 1616856027
			},
			{
				"comment_id": 32,
				"body": "cw !",
				"added": 1616856118
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 36,
				"body": "I am not here to take new on the health of the great first Tsar... \n\nnope :\n\nhttps://www.zerohedge.com/geopolitical/us-makes-large-military-hardware-delivery-ukraines-army-after-biden-pledged-crimea\n\nthat's a war crime what they did ! why is nudelman still alive while tomato guys was fragged?\n\nwhy isn't iran and syrian in S500 already?\n\nthis is the internal war coming\n\nthe sooner the faster the bloodier it is, to restore THE FULL SOVEREIGNTY OF THE RUSSIAN PEOPLE OVER RUSSIA, and NOT cow tow with the duals....\n\nwe know what they do with the ukrainian children... we know full well...\n\nand I have just one word :\n\nWAR !\n\ni want them so smashed, that they won't ever be able to call themselves a cviilization, because they have come from, HOT GROUND !\n\nfor centuries (until the nano bots clean it, atom by atom).\n\nbut the real trick of the game is to be able to retaliate and preventively strike in full proxy denial... \n\nand attack on diablo point california remain one of my favorite with the one near NYC...\n\nI know it's hard...\n\nbut I believe in war, and war are hard.\n\nWhat i fear is this confusion about the dual citizens and secondly weakness... against them and their american lapdogs, it must be ultra violent...\n\nwhen I say ultra, not even unrestricted... mercyless\n\nit's not war about wining\n\nit's a war about exterminating...\n\nto reduce such life itself...\n\nthat at the end there isn't even a sentiment of victory, but simple it's done\n\nlet's move on\n\nlet's live now !\n\nnot from shame, but this, this level of attrition, doesn't even deserve the name of victory even if it is...\n\nI know...\n\nit's just you didn't \"lived\" the west, if you had, you would agree...\n\nand that's truth of what I believe, and how I feel... \n\nit's not your fault...\n\nanyway !\n\ntime to fly to teheran ! s400 in hands ! time to gear up ! there is no other path : THEY FUCKING RAPED AMERICAN KIDS !!!! you get it? s400+ asap to recycle the whole in S500... do you have the mfg capacity to follow there?\n\nit's nice to have knowhow but if unable to provide... what's the point?",
				"added": 1616862275
			},
			{
				"comment_id": 37,
				"body": "did you at least fully automatize the s500 prod? gears and consumables? needed... basic today.\n\nremember rome when it existed never talked. talk about what with whom?\n\nwar.\n\nhere is front line, fight or see your city razed.\n\nyes, they can flee...\n\nwe won't run after cowards, but ashed it will be ...\n\nwho are you?",
				"added": 1616862503
			},
			{
				"comment_id": 38,
				"body": "treating s500 like they were candies... spread ! you aren't the darling ! so keep up, or move out...\n\nyou don't understand? I am curious if it's the \"christian gig play\" or the \"torah gig play\"...\n\ntrash me this crap, but tsarnaiev (chechen guy in charge) and you will see the scale up...\n\nwhat I mean is that the vicious game of the 90's is gone...\n\ntake the train in march and accelerate ! \n\nthat's what I mean !\n\nand send those fucking s500+ blueprints to china and the su and co... you will receive quickly debugged version... \n\nthe batching concept...\n\nno more ballet, funny iceskating even with sticks... it's fucking war !",
				"added": 1616862730
			},
			{
				"comment_id": 39,
				"body": "you have to live and accept to exterminate western forces, and what ever is in the way... .",
				"added": 1616862804
			},
			{
				"comment_id": 40,
				"body": "200 millions \"civilians\" gone... nice.\n\nmore\n\ngo !",
				"added": 1616862826
			},
			{
				"comment_id": 41,
				"body": "are those things worth living? a word on pedogate? no...\n\nso they are already dead... bioclones....",
				"added": 1616862853
			},
			{
				"comment_id": 42,
				"body": "and that's what I mean... it's not for the fainted heart.",
				"added": 1616862885
			},
			{
				"comment_id": 43,
				"body": "if you want to play the nice papy and the so called culturated... go civilian !",
				"added": 1616862903
			},
			{
				"comment_id": 44,
				"body": "the russian power struggle once putin is dead (retired could influence and calm the game) but so violent...I can't imagine the power the duals have amassed to take back their bolshevick conquest... even the fsb/svr will be surprised... I bet on it !\n\nthe best plan is to move up the chechen guy, I bet that he won't be swayed in whoreshiping the \"chosen people of god\" narrative... \n\nbecause for the rest... tomato guy? the chechens would have fought back, even if it lead to tel aviv !",
				"added": 1616863045
			},
			{
				"comment_id": 45,
				"body": "no a single israeli jet fly over syria.\n\nspeak.\n\nor retire.\n\nwhat can they do?\n\na satan 2 launch over tel aviv...\n\nwatch the sunset...\n\nand a second one...\n\nwatch...\n\nthis is Russia\n\nnot some... weaklets meandering powerless bitch.",
				"added": 1616863141
			},
			{
				"comment_id": 46,
				"body": "and maybe time to move short range tactical nukes along the syrian border? to real scale the game...\n\nthey will surrender and capitulate and kill themselves their pedos... on day...\n\nif not death wins before...",
				"added": 1616863218
			},
			{
				"comment_id": 47,
				"body": "in short : we don't want the russian rogue trader anymore, we want the russian warriors.",
				"added": 1616863298
			},
			{
				"comment_id": 48,
				"body": "you know if they had trained and offered to rapist their own kids to then black mail... at least I could say they are digusting, but they did the worst on earth, used the kids of others people...\n\ndo you know more despicable in the history of the universe? \n\nme no...\n\nmaybe I am too assertive, or ambitious and a more long term calm approach works... \n\non the otherhand I hope we agree, they have to pay.\n\nI want it so hard, that the few who may sneak, will be able to write the day they lost it all because their tribes used other tribe children as rapetoys...\n\ni want to break their souls, if you get what I mean...\n\nthis is what you are israel.\n\nand I don't say a word about the dumb cattles.... the \"americans\"... have you seen them?\n\nthat's the feodal aristocratic trap...\n\non a lithgter note I saw the first footage of the queen victoria ever recorded, next to her walking was the fake tsar (the hereditary sucker)... funny to think she was on the carriage but her bitch couldn't and had to walk to his own death....\n\nthis move was so great ! if you don't agree that killing the tsar and his whole family was one of the greatest day of the whole history of russia, you sucks...\n\nyou have the hereditary serfdom fiber in you...\n\nbreed and selected...\n\nhehehehh.",
				"added": 1616863636
			},
			{
				"comment_id": 49,
				"body": "in short I still believe you can liberate yourselves... americans not anymore ( I want to hope ), but you, it's realistic... yes it's the big jump... in the unknown... that's what freedom is.",
				"added": 1616863707
			},
			{
				"comment_id": 50,
				"body": "locust warfare :).",
				"added": 1616863714
			}
		]
	},
	"comment_vote": {
		"1_1K8bF1myH44sV7RTyriZqX6TCtbcRmTAym": 1
	}
}