{
	"posts": [
		{
			"id": "55a5cba8-08d3-44a3-bb0c-f20fd42cc41e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "50197b9d-58b7-45c8-8b8c-6c366bb065e7",
			"subject": "love",
			"body": "I still love you",
			"time": 1571451824668,
			"files": "[]"
		},
		{
			"id": "9f3c603e-4fe4-4227-8801-7127557dce9f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "1389f464-697f-47e9-a60d-448f053a6430",
			"subject": "HW Retribution",
			"body": "HW may have called in the feds on KiwiFarms as well. 20 hrs ago, Null confirmed that the site canary is dead. Even tweeted a pic of a cat with a canary feather.\nWe can debate probable cause while Tyrone is jamming a 12\" dick in your ass.\nGood luck.",
			"time": 1571452109874,
			"files": "[]"
		},
		{
			"id": "5fe2df63-3578-4082-9d44-e8da84e963aa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "50197b9d-58b7-45c8-8b8c-6c366bb065e7",
			"subject": "to be fair",
			"body": "Nobody said that this would be the thread posted in...",
			"time": 1571452215604,
			"files": "[]"
		},
		{
			"id": "0f318b4a-fcd7-4936-a6c7-e96679493ff4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "50197b9d-58b7-45c8-8b8c-6c366bb065e7",
			"body": ">>691a800e-c848-4195-afd9-fa651101e7d2\nmmmhhhaaaaa\nWho said this is a hate machine?",
			"time": 1571709939411,
			"files": "[]"
		},
		{
			"id": "c32bd010-37cb-41e7-9630-21f200f5d94a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "d1dc8867-35bb-4935-b12a-cb012d78894b",
			"body": ">>d1dc8867-35bb-4935-b12a-cb012d78894b\nThank you for all your efforts and hard work.\nI don't think HW will be fucking with 08chan.\n\nThat's either a sign of zeronet strength or weakness.",
			"time": 1571710078600,
			"files": "[]"
		},
		{
			"id": "91c2e469-db23-40cb-b0ba-94a2388959f5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "26e54f93-d288-4c77-81e6-a8636d45beff",
			"body": ">>26e54f93-d288-4c77-81e6-a8636d45beff\nHW got 8kun kicked off the Alibaba hosting service. Fucking asshole.",
			"time": 1571710392872,
			"files": "[]"
		},
		{
			"id": "3dcafebf-bdd5-4f30-9726-72bff75d85be",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Atomwaffen Raided, firearms seized.",
			"body": "https://www.king5.com/article/news/investigations/police-seize-guns-from-avowed-neo-nazi-snohomish-county/281-400146c7-5c81-4c8d-80d6-78f877977340\n\nPolice seize guns from avowed neo-Nazi in Snohomish County\nAccording to court documents, Kaleb Cole is the leader of a small, but dangerous white supremacist group called \"Atomwaffen.\"\n\nAuthor: Chris Ingalls\nPublished: 6:51 PM PDT October 17, 2019\nUpdated: 8:28 AM PDT October 18, 2019\n\nSEATTLE — Police seized military-style firearms from an avowed neo-Nazi in Snohomish County in what is believed to be a first-of-its-kind case in Washington state.\n“We actually, I firmly believe, prevented a massacre,” said Seattle City Attorney Pete Holmes, whose office was involved in the investigation.\nRecords filed in King County court show officers from the Arlington and Seattle police departments seized five military-style rifles, three pistols, and other gun parts from a residence on Jordan Trails Road in Arlington.\nAccording to court documents, the weapons belong to Kaleb J. Cole, who is the suspected leader of The Atomwaffen Division in Washington state.\nAuthorities claim Cole has been amassing firearms and training with weapons in western Washington. Online videos show Atomwaffen members firing guns and moving through rooms at “devils tower,” a graffiti-scarred building at an abandoned cement plant near the City of Concrete.\n“This is a hate-filled human being but one who, unfortunately, possesses a large number of weapons,” Holmes said.\nCole is not charged with a crime but is named in an Extreme Risk Protection Order (ERPO) filed earlier this month in King County court. In the civil paperwork, prosecutors and the FBI convinced a judge that “Kaleb Cole poses a serious threat to public safety by having access and possession to firearms and a concealed pistol license.”\nThe judge issued an order requiring Cole to surrender all firearms to the police.\nAtomwaffen, which is a German for “atomic weapon,” is a small but extreme organization that seeks inspiration from Adolph Hitler and Charles Manson, who ordered mass murders to attempt to trigger a race war.\nIts white supremacist members claim they will not start the war, but they are arming themselves in preparation.\nAtomwaffen members have been charged in five murders in other states.\nThe FBI has clearly been watching Cole, although a spokesperson for the bureau’s Seattle office declined to comment.\nDocuments filed in court show that Cole traveled to Eastern Europe in December of 2018 on a trip to honor the sites of some of World War II’s most horrific scenes.\nCell phone photos retrieved by Customs and Border Patrol agents when Cole re-entered the U.S. show him posing in front of the Nazi death camp Auschwitz. In the photos, Cole is holding up the Atomwaffen flag at other locations, and other photos show him holding guns.\n“Cole has been permanently banned from entry into Canada as a result of his [admitted] membership/affiliation with the Atomwaffen Division,” the Border Patrol report stated.\nEarlier this year, the Seattle FBI approached Seattle/King County’s Regional Firearms Enforcement Unit operated by the Seattle City Attorney, King County Prosecutor, and Seattle police.\nAgents sought an ERPO to disarm Cole, but the federal government has no such tool.\n“The fact is the federal government came to us. There’s no other mechanism like our firearms unit that’s in existence. There’s no one else in the state that’s doing this,” said Holmes.\nIt’s the first time the Feds have sought an ERPO in Washington state, and it’s believed to be one of the first instances in the nation.\nKing County Prosecutor Dan Satterberg, whose deputy prosecutor Kim Wyatt argued the ERPO case before the judge, said the order to surrender guns is the right tool when law enforcement does not have enough evidence to file a criminal charge.\n“In this case, the joint terrorism task force had assessed Mr. Cole and said he was somebody who was doing more than thinking and talking about his extremist, violent beliefs, but that he was actually acting on it,” Satterberg said.\nHolmes said the case marks an important milestone since he started working with his domestic violence prosecutor, Chris Anderson, on the pilot project that formed the firearms enforcement unit.\nThat unit has now seized nearly 1,100 firearms since 2017, mostly from accused domestic abusers.\nThe fact the FBI recognized an ERPO’s ability to stop a threat is significant.\n“We can actually prevent some of these massacres,” said Holmes.\nKING 5 has been unable to reach Cole for comment. The order that he does not possess any firearms remains in effect for one year.\n\nRemember: This US Citizen was not charged and committed no crime.",
			"time": 1571710663300,
			"files": "[]",
			"last_edited": 1571710799900,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}