{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 1,
				"body": "Well, there are plenty of \"niggers\" working in the tech sector and in academia, whilst your dumb ass is posting bollocks. Also, chavs are dumber than bricks and many of them are white.\n\nPeople deserve equal treatment because they have the capacity to feel pleasure and suffering. Be good to innocent people.",
				"added": 1574170497
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 2,
				"body": "I met a \"nigger\" at the train station yesterday and she was lovely. Shame you're missing out on fulfilling human interaction.",
				"added": 1574170718
			}
		],
		"1574115241_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "Hating people for shit they can't control is just pointless and feels horrible. If you're going to hate someone, you should hate them for what they do.",
				"added": 1574170946
			}
		],
		"1573772721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "I'm here because the idea of corporate gatekeeping scares me. I hate the bigotry on these kinds of sites, but seeing it makes me happy because it's great that people can say what they really think without being arrested or having their lives destroyed. It's nice to see stupid people being honest so I know to laugh at them.",
				"added": 1574171168
			}
		],
		"1573908669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 5,
				"body": "I'd stand with Hong Kong, but I'm shit at archery. Liberate Hong Kong!",
				"added": 1574171234
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 6,
				"body": "You have to be so careful who you talk to about it. There are many people though online who will sympathise with you though. Most people just panic and default to their programming. \"Life is good. You are loved. Get help.\" Yawn.",
				"added": 1574171448
			}
		]
	},
	"comment_vote": {
		"65_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1
	}
}