{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Un blog de plus",
			"body": "Je viens de me lancer dans un blog sur ZeroNet (un nouveau parmi tant d'autres) dans lequel je compte me plaindre d'à peu près tout. Donc si vous voulez suivre un gars qui passe des journées pires que les vôtres n'hésitez pas !\n127.0.0.1:43110/1iNZgS2PcybodGQrrBwgcSR2TvGtoobzx",
			"added": 1501068783
		},
		{
			"topic_id": 2,
			"title": "Suivre ZeroTalk FR",
			"body": "Pourquoi il est possible de suivre le flux principal de ZeroTalk mais pas celui de ZeroTalk FR, quelqu'un sait pourquoi ce choix ?",
			"added": 1502871770
		}
	],
	"topic_vote": {
		"2_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": 1,
		"1_1Aqzrn9MJnftKMJyU9mVviE5WZdTwJnkFr": 1
	},
	"next_comment_id": 8,
	"comment": {
		"2_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 1,
				"body": "Balance le lien dès que c'est en place ;)",
				"added": 1501068832
			}
		],
		"1_1Aqzrn9MJnftKMJyU9mVviE5WZdTwJnkFr": [
			{
				"comment_id": 2,
				"body": "> [padtrique](#comment_5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): salut! Heureux de t'avoir parmi nous! Je n'arrive pas à accéder à ton blog, il n'ya pas assez de sources ;)\n\nça devrait aller maintenant ! Je l'ai partagé un peu et les pairs sont arrivés ;) C'est gentil d'avoir fait la démarche en tout cas ! :D",
				"added": 1501143703
			},
			{
				"comment_id": 3,
				"body": "> [padtrique](#comment_6_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): c'est bon ça marche ;)\n\nHéhé merci ;)",
				"added": 1501229920
			}
		],
		"1_1MVGeztRHXx3PFzRYL7E41mop1SeRkdrxb": [
			{
				"comment_id": 4,
				"body": "Il suffit d'en recréer un [ici](http://127.0.0.1:43110/zeroid.bit) si je dis pas de bêtise.\nEnregistre tes 3 `.json` de ton dossier ZeroNet, met les à part pour conserver cet utilisateur et ensuite recrée en. Et ensuite en fonction de celui que tu veux utiliser tu mets les bons fichiers dans le dossier ZeroNet\n",
				"added": 1501241513
			}
		],
		"14_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 5,
				"body": "J'arrive pas à y accéder",
				"added": 1502376216
			}
		],
		"1_175kecRirgDT2ZfHkUYwYz34Gph5SA3fZo": [
			{
				"comment_id": 6,
				"body": "Les enfants ne sont pas débiles, et si c'est le votre et que vous devez le frapper pour l'éduquer c'est que vous ne comprenez pas votre propre gosse et que c'est à vous de vous remettre en question. Mais ce n'est que mon avis.",
				"added": 1503473464
			}
		],
		"19_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 7,
				"body": "> [padtrique](#comment_20_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): C'est marrant, on ferait un site pour dénoncer le racisme contre les noirs ou autres populations, personne ne voudrait le blacklister et tout le monde le défendrait.... Tu défends la France, tu dénonces les injustices subies par la population Française, tu es facho, raciste, xénophobe... C'est bien l'état d'esprit des bobos, qui refusent de voir la réalité en face. Je ne mords pas, j'insulte personne, j'exprime simplement mon point de vue, de ce que je vois et ressens au quotidien..\n\nMoi je blacklist juste parce que ça me saoule de te voir faire ta pub partout. Tu crées un cancer sur ZeroNet et tu le propages beaucoup trop pour être pris au sérieux. Laisse les personnes intéressées venir au lieu de faire un tel bourrage de crâne. Ton idée est bonne, pas l’exécution.\n\nBonne continuation à toi.",
				"added": 1505037240
			}
		]
	},
	"comment_vote": {
		"5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": 1,
		"6_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": 1
	}
}