{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"32_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"33_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"30_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"27_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"26_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"25_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"12_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"11_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"8_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"7_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"6_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"5_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 1,
				"body": "p2p это программная сеть работающая в интернете\n\nMesh сеть это физическая сеть то бишь радиоканал для построения альтернативного интернета",
				"added": 1550738900
			}
		],
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 2,
				"body": "> [promusik](#comment_59_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): не открывается даже через VPN в Европе.\n\nдля нее порты нужно открывать",
				"added": 1550749715
			}
		],
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 3,
				"body": "\n\nПервый в России уголовный процесс над «пиратами», семьей Лопуховых,  длился более 5 лет. Супругов Андрея и Надежду обвинили в том, что они незаконно разместили на трекере произведения, защищенные авторским правом, и довели объекты, находящиеся под копирайтом, до всеобщего сведения посредством размещения файлов в сети Интернет на сайтах www.interfilm.ru  и www.puzkarapuz.com. Суммы ущерба выставленные представителями западных и российских правообладателей фантастические, а методы расчета этого ущерба абсолютно непрозрачны.\n\n15 октября 2013 г. супруги были приговорены к 4 годам лишения свободы.  Несмотря на достаточно гуманное решение Тимирязевского суда г. Москвы, в котором Лопуховым наказание было назначено условно,  приговор содежит множество неоднозначных выводов, которые могут  в дальнейшем использоваться в правоприменительной практике для уголовного преследования владельцев сайтов и пользователей, которые используют современные средства передачи информации для личного некоммерческого использования: торрент трекеры, варезы, магнеты, файлообменные и социальные сети.\n\nОчевидно, что судебный процесс, совершающийся над ними являлся показательным, ангажированным крупнейшими транснациональными медиа компаниями, имеющим целью создать прецедент и запугать пользователей интернета, которые имеют абсолютное, закрепленное в Основном законе право свободно получать и распространять информацию. Стоимость нарушенных прав на 29 фильмов в размере 750 000 000 рублей, не имеют никакого отношения к реальности и основываются лишь на жадности, наглости и тщеславии производителей контента далеко не всегда высокого качества. Изначально ущерб был оценен в 38 миллиардов рублей (!), но в процессе удалось снизить эту сумму в 50 раз! Наибольшее количество вопросов вызвала сама методика определения стоимости нарушенных прав, т.к. именно она влияла на квалификацию инкриминируемого деяния. \n\n Следствие никаким образом не проверяло заявленную стоимость, и оценило ущерб лишь со слов самих представителей правообладателей. \n\nКаждый потерпевший правообладатель продемонстрировал удивительную смекалку по оценке нарушенных прав. Так,представители РАПО вывели среднюю стоимость произведения, путем деления общей стоимости каталога правообладателя от американского правообладталея на кол-о фильмов из каталога. Например, средняя стоимость права на фильм, принадлежащего Paramount, составляет 4 814 814, 815 долларов США. Компания Парадиз, также признанная потерпевшим, вообще, судя по всему, не обладала Интернет правами на территории РФ, но также оценила свои права на фильм «Предчувствие» взяв с потолка сумму в размере 250 000 рублей, а Юнайтед Медиа Проджектс, облдающая правами на фильм «Бабка Ежка и другие», посчитала стоимость прав должна высчитываться так: стоимость просмотра одного кинофильма по платному кабельному телевидению ( VideoOnDemand) составляет 40 рублей. Для расчета стоимости сумма снижена до 10 рублей. Учитывая потенциальную аудиторию в 550 000 человек (где же только в России сидит эта аудитория для платного заказа фильма на телик?!) стоимость прав составила бы 5 500 000 рублей. \n\nВсе ходатайства защиты во время судебного разбирательства о назначении финансово-экономичсеской экспертизы были отклонены. Суд посчитал, что следствием в надлежащем порядке проведена оценка стоимости прав.\n\nДовольно интересным был также и вывод обвинения, с которым согласился суд, что доходы на электронных кошельках от донейтов, VIP аккаунтов и баннерной рекламы были признаны доходом от преступной деятельности за доведение до всеобщего сведения 29 фильмов, не смотря на то, что на сайте находилось около 20 000 торрентов. \n\nНесомненно, этот показательный процесс необходим для того, чтобы продемонстрировать  всем российским пользователям Интернета, что может случиться с каждым, кто решил заниматься «противоправным файлообменом.\n\nВ приговоре судьи Акановой сделан ряд других важных правовых выводов, которые могут стать очень опасными при становлении дальнейшей правоприменительной уголовной практики:\n1. Размещение торрент-файла или ссылки на файл является нарушением авторского права, как если бы лицом был выложен в сеть сам объект авторского права;\n2. Правообладатель вправе сам устанавливать стоимость прав на свое произведение в рамках уголовного дела. \n\n Если сложить эти два вывода суда, то очевидно можно сделать следующее заключение — в отношении любого пользователя за размещение даже одного торрент-файла или ссылки, может быть возбуждено уголовное дело по факту нарушения авторских прав третьего лица в особо крупном\n\nГражданское судопроизводство по вопросу возмещения ущерба потерпевших медиа корорпаций в связи с совершенным преступлением  еще впереди. \n\nНо правообладатели уже радуются, федеральные каналы показывают поимку международных злодеев, обокравших Голливуд, а сотрудники РАПО заявляют, что будут готовить методички о том, как посадить за торренты и налаживать практику возбуждения уголовных дел. И это вполне в духе последних тенденций по применению «антипиратского закона» и массовой блокировки торрент-трекеров, которые сегодня планируются  руководителями Министерства культуры и Министерства связи.\n\nПравообладатели прекрасно понимают, что безработные, не имеющие никаких активов Лопуховы, с двумя маленькими детьми на руках, вряд ли смогут удовлетворить имущественные притязания компаний по выплате многомиллионных компенсаций за нарушение исключительных прав и возмещению ущерба правообладателям. \n\nПодобный приговор в купе с принятым в первом чтении скандальным «антипиратским законом» — показатели изменения  внутренней политики российской власти, которая явно стремится к защите экономических интересов крупнейших транснациональных  правообладателей в ущерб прав граждан, которые осуществляют некоммерческий обмен объектами культуры и знаний. Судебный прецедент способен открыть медиакомпаниям и  другим участникам контент мафии возможность начать более агрессивное наступление на торрент-трекеры теперь и в России, требуя оптовой блокировки раздач под страхом уголовного наказания.\n\nВ настоящее время нами готовиться апелляционная жалоба на решение Тимирязевского суда.",
				"added": 1550757758
			}
		]
	},
	"comment_vote": {}
}