{
	"next_topic_id": 19,
	"topic": [
		{
			"topic_id": 1611956543,
			"title": "Never mind. Investing in stocks is .. probably a bad idea",
			"body": "https://www.reddit.com/r/SuicideWatch/comments/l7esmw/lost_70k_in_stock_market_should_i_kill_myself/\n\nJust a reminder that it's not just elites who will be left without a chair when the music stops, though I guess you should only put in what you're mentally prepared to throw away for the shits and giggles.\n\nThe house always wins in the end. Although in the case of the crash of 1929.. it pretty much led to WW2.\n\nBetter to just create and produce things that have value, instead of manipulating the prices of things that have value. Capital in and of itself does not create value.\n\nhttps://www.youtube.com/watch?v=qlSxPouPCIM",
			"added": 1611956542
		},
		{
			"topic_id": 1611968483,
			"title": "World Economic Forum needs to stop scaring the kids",
			"body": "Seems like they're just asking for world-wide riots and violence at this point with their tactless use of words i.e. The Great Reset.\n\nJust give people a UBI and call it a day. I don't care about the environment, I just need cash. Maybe then I'll start to care",
			"added": 1611968481
		},
		{
			"topic_id": 1612007867,
			"title": "How to tell Facts from Opinions.. for Dummies:",
			"body": "1. Ask yourself.. what is more likely to be the truth? e.g. That Mark Zuckerberg is secretly a lizard.. or that he's just a really socially awkward guy high on Modafinil?\n2. If we're talking about an interpretation of a recent world event.. How many verified sources support this claim? Is it just 1-2 articles from the Daily Wire and The Sun.... or 100-200 articles and blog posts from **actual journalists** and people from a variety of different political leanings?\n3. Again, if we're talking about an unusual interpretation of a recent event.. Does the person possess convincing video footage, or photographs? Is there ANY evidence that the footage has been tampered with? Is there ANY evidence that the video footage is.. something else entirely, and nothing to do with the event at hand?\n4. Is the person giving out their opinion, truly open minded and serious about wanting to discover the truth.. or are they motivated by a political agenda, money or a desire for fame?\n5. If we're talking about a scientific fact.. how many scientists actually support this opinion? e.g. How many actual, qualified scientists support Flat Earth theory vs. how many don't.\n6. Again, If we're talking about something being claimed to be a scientific fact.. can this 'theory' be validated using the Scientific Method?\n7. Most importantly, just remember that a lot of the times, reality is just boring and predictable. Not everything is as exciting and mysterious as it is in Movies, comic books and film. Sometimes, the mainstream opinion is what is most likely to be right.\n\nOtherwise, we'd all be fighting over whose reality is the Real reality.. and we'd never have a functioning society ever again.",
			"added": 1612007864
		},
		{
			"topic_id": 1612099044,
			"title": "Graham Stephan's unbiased take on The Great Reset",
			"body": "https://www.youtube.com/watch?v=k21SuhGx7xA\n\nGotta love capitalists explaining economics.\n\nI also find it funny how both fascists and socialists harbor the same hatred for Mr. Porky. Except for the fascists, it's somehow all just a Jewish conspiracy.\n\n..Either way, I don't trust socialists. Their shitty infighting, their constant back-stabbing. Some even go full-blown team switching and become outright fascists.. then they become socialists again.\n\nPolitics is the domain of losers. You only live once.. so don't throw it all away in the name of these autistic, shitpost-fueled cults. Go make money.. that's the only way to defeat Porky.",
			"added": 1612099040
		},
		{
			"topic_id": 1612217578,
			"title": "Will being Human one day be considered a Mental Illness?",
			"body": "Being unsatisfied with the bare minimum, having a desire to live a more exciting life than just the 9-5 grind, having individuality, being rowdy and obnoxious, having unpopular political beliefs, speaking your mind, loving motorcycles, booze, guns and explosions, etc.\n\nPretty sure all of these things will be considered a mental illness some day, and will be engineered out of the human DNA so that societies can operate more efficiently. Or you can just give people highly advanced anti-depressants to get them to be happy with owning nothing.\n\nSometimes I have the feeling that Trump supporters had valid concerns about governments infringing on individual liberty and freedoms, especially with our new worldwide coronavirus surveillance state.\n\nOf course, I don't see how Trump isn't just a different side of the same coin. Maybe they just saw an opportunity to stick it to the institutions that looked down on them, at the risk of inviting more government tyranny and political opportunists into their lives.\n\nLike, when I was watching the videos on All Gas No Brakes, many people in the comments accused the interviewees of being 'mentally ill'.. simply because they're rowdy and obnoxious Trumpers.\n\nBut don't we all say stupid shit every now and then? Should all those people be forcefully detained and medicated against their will for the betterment of society?\n\nIs modern life making us mentally ill? Or could it be that a lot of what we call 'mental illness' is just normal human behavior that is now considered pathological and detrimental to the development of a more technologically advanced and 'perfect' society?",
			"added": 1612217573
		},
		{
			"topic_id": 1612320343,
			"title": "Well Played r/WallStreetBets",
			"body": "Read a lot of stories about the Redditors donating their wins to charity, etc.\n\nGuess it's not all just nihilistic chaos and machiavellianism, after all.\n\nWish I could join in and buy some GameStop stocks, but unfortunately, all my ID's and legal documents have expired. And I'm too broke to renew them right now.. so I can't get an account on any trading app whatsoever. lol",
			"added": 1612320337
		},
		{
			"topic_id": 1612396651,
			"title": "If Kurt Cobain had been born today",
			"body": "He'd be a Redditor/YouTuber/Twitch streamer",
			"added": 1612396644
		},
		{
			"topic_id": 1612401936,
			"title": "Sputnik V coronavirus vaccine 91.6% effective",
			"body": "https://en.wikipedia.org/wiki/Sputnik_V_COVID-19_vaccine\n\nI don't particularly care for the politics of Russia, only whether or not they can produce good shit.\n\np.s.\nUnrelated, but .. just so you know, Navalny is a conservative nationalist. Would he be an improvement over Putin? Nobody knows. Is his detention unjustified? Yes.",
			"added": 1612401928
		},
		{
			"topic_id": 1612481231,
			"title": "Seatbelts, Helmets and Safety Harnesses",
			"body": "Are tools of government control.",
			"added": 1612481222
		},
		{
			"topic_id": 1612516347,
			"title": "I'd happily get Elon Musk to microchip my Brain.",
			"body": "He can tattoo his name on my butt, too. Because he likes memes and Dogecoin",
			"added": 1612516337
		},
		{
			"topic_id": 1612644621,
			"title": "Nevada bill would allow Corporations to create their own Governments",
			"body": "https://apnews.com/article/legislature-legislation-local-governments-nevada-economy-2fa79128a7bf41073c1e9102e8a0e5f0\n\nPeople get the governments they deserve and voted for.",
			"added": 1612644610
		},
		{
			"topic_id": 1613181782,
			"title": "Is the U.S. running out of People?",
			"body": "https://www.youtube.com/watch?v=Hc00FCtwHZc\n\nThe best alternative to suicide is to never have been born in the first place. Death leaves behind pain and devastation, whereas not having children is a net neutral. \n\nI vote against this world by not bringing any more life to it.",
			"added": 1613181770
		},
		{
			"topic_id": 1632948938,
			"title": "Censorship is getting way out of hand.",
			"body": "Everyday life is starting to feel like the scene out of this tv show:\nhttps://www.youtube.com/watch?v=_dXqugxU1sk",
			"added": 1632948925
		},
		{
			"topic_id": 1633231545,
			"title": "Anyone experiencing potential Vaccine side-effects?",
			"body": "https://youtu.be/yd5tV-SoCeo\n\nWoke up at 2am this morning with severe shortness of breath, a headache and a hurting throat. Had a nightmare about Earth running out of oxygen - with me suffocating to death at the end. All the walls in my bedroom were glowing upon waking up.\n\nHave had 1x shot of Pfizer. 7th of September. (New Zealand). 28 yr old F.",
			"added": 1633231531
		},
		{
			"topic_id": 1634963804,
			"title": "The Game Theory problem of Social Media alternatives.",
			"body": "With the rise in political polarization and platforms such as Truth Social, Parler, Bitchute, etc. there seems to be an emerging pattern:\n\n- As nationwide political polarization and animosity rises, so does censorship.\n- As people are censored from mainstream spaces, they go underground.\n- As they go underground, those platforms end up becoming 'ban-evasion refugee camps'\n- The 'ban-evasion refugee camps' may initially just be filled with the far-right and white supremacists.\n- But as even worse types of offenders (pedophiles, actual terrorists, scammers, etc.) are banned from mainstream platforms, they wind up populating the 'ban-evasion refugee camps'.\n- You end up with a platform exclusively filled with the worst types of people imaginable.\n- Newcomers are put off when they see a forum full of nazis and pedophiles.\n- Mainstream platforms then get away with their rampant censorship and authoritarianism because it's better than the alternatives. Everything on the internet just starts to suck. And then all that shittiness spills over into the real world.\n- Everyone goes batsh*t crazy and you end up with a Mad Max clown world.\n\nSolutions:\n- Create social media platforms with 'common sense' levels of censorship, similar to what YouTube back in 2005-2010 used to be. Ban kiddie porn, explicitly violent videos of e.g. massacres and rampages, etc. \n- Create an AI algorithm that gradually exposes people to different types of political opinions, rather than just allowing them to live in a bubble surrounded by people who agree with them.\n- Have a 60 second delay e.g. when Tweeting, allow people to edit and think about what they're about to tweet.\n- Democratically elected moderators.\n- Stop creating new 'Decentralized Internets'. Instead, revive the old ones and carry on working on them. Otherwise, you'll have your userbase scattered all over.\n- Use well-maintained web proxies in order to encourage the use of ZeroNet (last time I tried to create one using a Google VPS, I failed, but I'll try again on my own computer first see if there's something wrong with the new version of ZeroNet that stops this from happening.)",
			"added": 1634963789
		},
		{
			"topic_id": 1636071087,
			"title": "We need a non-partisan battle against pandemic Tyranny",
			"body": "https://www.youtube.com/watch?v=MxwtlV2eCz4\n\nSo it turns out, Israel is still facing surges in Covid19 infections despite the high rates in vaccination compliance. Which means we have a big problem on our hands.\n\nPeople are inviting a regime of terror, surveillance and totalitarian control for a small amount of comfort. The comfort that they won't face the tiny chance of dying at the hands of a respiratory infection, despite the numerous other things that could kill us at any given moment.. like obesity, addiction, diabetes, heart disease, etc.\n\nLockdowns have led to a rise in homicides and of course supply chain shortages, economic devastation and political turmoil.\n\nDespite wearing masks and social distancing, And receiving the vaccine - I'm still forced to quarantine right now. I put in all that effort just to end up penniless and locked up in my room anyway. \n\nWe need a non-partisan battle against covid19 restrictions. With an emphasis on non-partisan, as lockdown protestors frequently push other agendas such as White nationalism, right-wing populism, etc.\n\nIt's time to open up. But even if we open up people are still going to be paranoid and drenched in fear, especially family members. This is a mess and I can't see myself taking another day of it.",
			"added": 1636071071
		},
		{
			"topic_id": 1636759226,
			"title": "We need a Class War, not a Culture War: An Essay on Real Revolution (VIDEO)",
			"body": "https://www.youtube.com/watch?v=XXw7ETOLlTY\nhttp://127.0.0.1:43110/kopy.bit/?Video=1636758768_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu\n\nIn this video I talk about the need for unity among the populist Left and the Right, in order to overthrow the ruling class and defeat the Great Reset.\n\nAmong the topics included are discussions of the Boogaloo boys featuring Jimmy Dore.\n\nGoing to be backing up my whole channel on ZeroNet before it gets nuked. :)\n\np.s.\nVideo size limit for KopyKate changed to 10,000mb / 10gb",
			"added": 1636759209
		},
		{
			"topic_id": 1636765653,
			"title": "I was wrong about Politics for the past 10 years",
			"body": "The global elite and feudalist orchestrators of the Great Reset are laughing all the way to be bank right now.. for the people have been successfully divided and conquered by culture wars and identity politics.\n\nWe need a Class War.",
			"added": 1636765635
		}
	],
	"topic_vote": {
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": 1,
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1611947064_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1611850021_1N6HArdCgfF7zK7vWNR5UEPBDSXAbv2WEN": 1,
		"1612074323_18MUc7bD3LDUQobuKHzmVeDeS4qE7wtoDe": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 1,
				"body": "Yeah, don't take the vaccines kiddos. Some dude on Bitchute told me not to",
				"added": 1611955201
			},
			{
				"comment_id": 2,
				"body": "> [getoutofthis](#comment_9_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): @quantumkitty is a NPC that truly believes that whenever someone  has another opinion than itself, the reason is always that the other person must be stupid. It can not believe that other people do genuinely have another worldview than itself based on experience, knowledge, logic and true facts.\n\nYes, but opinions aren't facts",
				"added": 1611955873
			},
			{
				"comment_id": 3,
				"body": "> [getoutofthis](#comment_10_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): How do you tell opinions apart from facts?\n\nWell, a lot of the times it's just basic common sense.\n\nIf a car accident happens while I'm driving to work. What's the most likely explanation: Shit happens, or the government deliberately tried to assassinate the driver?",
				"added": 1611956079
			},
			{
				"comment_id": 4,
				"body": "> [grouch0](#comment_32_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): Common sense? That analogy doesn't make sense, unless everyone involved in car accidents is insignificant and represents no threat to any other interested party. There are plenty of examples which demonstrate that death resulting from car accidents have been instigated by governments or third-parties. Dianna Spencer and Dodi Al-fayed would be but one of many examples, which contradict your analogy.  [...]\n\nYes, because ->\n\nYou can't just go around making shit up. You need concrete, solid, irrefutable evidence of something before you claim it as a fact.. like saying Earth is flat.\n\nLike, say, if you wanted to prove that 9/11 was an inside job.. it would require a minimum of actual video footage of somebody planting bombs in the twin tower in order for your theory to be proven true and correct. And it has to be verified by multiple sources, not just fucking Daily Wire.. because video falsification technology is getting a lot better these days.\n\nAnd until that strong piece of evidence is found, you're out of luck. The mainstream story is what is probably true.\n\nI swear.. One of these days someone is going to claim that Trump is secretly antifa.. and then all of those right-wingers are going to go to his house and beat the crap out of him. Because they're borderline friggen retarded.. lol",
				"added": 1612006448
			}
		],
		"1611920431_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": [
			{
				"comment_id": 5,
				"body": "From what I've gathered, r/Wallstreetbets is a strictly non-political group.\n\nIt's all about having fun, not about being an activist. As much as people wish they could co-opt this movement.. at the end of the day, it's their own victory, and nobody else's.",
				"added": 1612008811
			}
		],
		"1611277411_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 6,
				"body": "Either way, the Great Reset is probably not going to happen. Most of what is presented in their ads and promo videos is just empty virtue signaling and wishful thinking. Boring, I know.",
				"added": 1612010941
			}
		],
		"1612161964_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 7,
				"body": "Start a Youtube channel and have Patreon.\n\nCan't think of anything to make videos about? Do political commentary. lol",
				"added": 1612237430
			}
		],
		"1612217578_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "https://en.wikipedia.org/wiki/Political_abuse_of_psychiatry",
				"added": 1612320771
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "I hear Sputnik-V is dank",
				"added": 1612401487
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 10,
				"body": "Dying in a car accident comes down to driving skills. If you're a good driver, you won't need a seatbelt, and you won't die if you crash. You just drive defensively and you'll be fine!",
				"added": 1612473634
			}
		],
		"1612644621_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "Reddit mods won't even allow actual stories like this to be discussed on r/Politics. lol\n\nBunch of impotent cocksuckers with power fantasies.",
				"added": 1612645006
			}
		],
		"1613213110_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": [
			{
				"comment_id": 12,
				"body": "I'm happy to go back to the days when Britney Spears antics were the most shocking things in the news.",
				"added": 1613256747
			}
		],
		"1632343427_1NceP4NFjHrUbHM7dLUxyLtXbTCrgmgRda": [
			{
				"comment_id": 13,
				"body": "Just post content. There's no need for further updates at this time. Projects get abandoned due to lack of users",
				"added": 1632949972
			}
		],
		"1630944991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 14,
				"body": "Eventually yeah. Just focus on posting and drawing in more users for now",
				"added": 1632951222
			}
		],
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "> [shadowelf37](#comment_1_15pcVCGkzEyxPGPPNC5H7RzTBZ9RsHtWFC): Another solution: government prevents large social media platforms from banning users or removing content unless it breaks the law. Pipe dream that congress would ever do that, but then again, where are the alternative platforms??\n\nThey're here and all over the place. People just aren't using them for reasons I listed above",
				"added": 1634964316
			}
		],
		"1636121680_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 16,
				"body": "I'll just use them all at once. fuck it",
				"added": 1636760505
			}
		],
		"1636751716_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 17,
				"body": "Works fine here. Thanks",
				"added": 1636763845
			}
		]
	},
	"comment_vote": {
		"1_1N6HArdCgfF7zK7vWNR5UEPBDSXAbv2WEN": 1,
		"19_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY": 1,
		"2_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": 1,
		"1_1B7RVZS2wUTChismz6p5FxN2TmT4qnPZNm": 1,
		"1_1MSraqjv7AM5qP8YieJsDqtAgzpEoixanY": 1,
		"13_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": 1,
		"28_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1111_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1206_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"967_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"45_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"343_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"37_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1,
		"1_16Jbmd4Spvzg3AvepHZpD7qPx54sj2A6dF": 1,
		"8_14NiXkEXrFAHokAohyiCv5PCAXLcEsvEUp": 1,
		"1_15pcVCGkzEyxPGPPNC5H7RzTBZ9RsHtWFC": 1
	}
}