{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1524432615_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "Это же не ноды Tor, они на карту не попадают?",
				"added": 1525396336
			}
		],
		"4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_35_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тут пока не за что бить :D Да и инструментов таких нет, максимум можно в игнор занести :D\n\nЕще можно забанить :D",
				"added": 1535967522
			},
			{
				"comment_id": 3,
				"body": "> [valentinnn](#comment_1_18vnhKJaJ1BK4Teoj1ijbjZsg9Mm7Qej1f): [Осторожно озираясь]кто здесь? :)ну и чего тут делать? как себе аватарку прицепить, а то я без аватарки себя прям голым очучаю\n\nНа этом форуме никак. Вот так и выясняется неготовность ZeroNet-а к реальным пользователям. Прям как Линукс в начале 00-х.",
				"added": 1535967614
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_37_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Это не будет честный привычный бан. Писать-то автор сможет и дальше :) Ну, если не считать принудительную блокировку записей владельцем сайта.\n\nЕсть и привычный бан. max_size = 0 для идентификатора пользователя, и все хосты удалят его данные. Писать он не сможет - будет ошибка при постинге.\n\nКстати, немного поизвращавшись, можно на существующем API и классический бан без удаления данных реализовать, с простой блокировкой.",
				"added": 1535974473
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_36_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Пока никак. Это изначально слишком анонимная система :D Но буквально вчера мне в голову пришла идея, что можно придумать что-то типа gravatar.com — отдельный сайт для ZeroNet, где можно выкладывать свой аватар, а другие сайты смогут его использовать :) Надо будет подумать, как лучше сделать.\n\nМожно ZeroMe подключить в качестве источника:\n\n* Поля About.\n* Аватарки.\n* И просто ссылки на соцсеть а ля \"больше об этом пользователе смотри здесь\".\n\nКрутится такая идея несколько дней.\n\nВозможности по интеграции в ZN одного в другое - гигантские. :) Когда это всё устаканится, обычная связность веба будет казаться каменным веком. Блин, идей в сотню раз больше, чем времени. Тут поле непаханное, столько возможностей заложено в архитектуру, для которых еще не успели UI сделать...",
				"added": 1535974821
			},
			{
				"comment_id": 6,
				"body": "> [geekless](#comment_4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): max_size = 0 для идентификатора пользователя, и все хосты удалят его данные\n\nИли `max_size = false`. Что-то такое, не помню точно.",
				"added": 1535975023
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_39_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Зная один только ZeroID/хеш юзера невозможно узнать, на каком хабе ZeroMe хранятся данные. И поэтому ссылку по ним не сгенерировать. [...]\n\nЕсли бы это было невозможно, сам ZeroID не мог бы делать поиск пользователей по имени, а там можно искать пользователя по имени, не зная его хаб. Там применён реестр: http://127.0.0.1:43110/1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV/\n\nВот если у пользователя нестандартный ID-провайдер, тогда будут проблемы. Но тогда и у сервиса аватаров будут проблемы.",
				"added": 1535976208
			},
			{
				"comment_id": 8,
				"body": "> [balancer73](#comment_38_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Разве удалят? ИМХО, только новые не сможет. Хотя не проверял.\n\nИнтересный вопрос. Я сейчас не нашел команды удаления файла в сорцах. Но при обновлении content.json в родительской директории, должна запуститься ревалидация всего дерева. content.json в каталоге пользователя не пройдёт валидацию, следовательно все файлы в нём будут проигнорированы, следовательно, обновляльщик БД будет считать, что файлов нет - а значит удалит из БД записи.\n\nКак-то так получается.\n\n> [balancer73](#comment_38_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А так — да, я отмечал, «если не считать принудительную блокировку записей владельцем сайта».\n\nЯ просто не распарсил сначала. :)",
				"added": 1535976500
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_40_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Зная только идентификатор — нельзя. Нужно ещё дёргать базу реестра. И задачу уже нельзя решить статическим вызовом, только через запросы к БД. В результате простая косметика превращается в активное программирование :)\n\nЧерез БД не надо — тогда каждый блогофорум будет строить копию базы данных ZeroMe, здоровущую. :) Там проще всё. Сначала через кроссайтовый запрос напрямую читаем `1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV/data/userdb/<ID>/content.json`, потом сразу подставляем в `<img>` кроссайтовую ссылку на аватар. Если хаб на локалхосте есть, картинка прогрузится. По желанию можно в явном виде запросить кроссайтовый доступ, аналогично как я для картинок в блоге делал.",
				"added": 1535976920
			},
			{
				"comment_id": 10,
				"body": "> [oob0imah](#comment_5_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): там, в обсуждении этого обомах-бага человек привел пример пути, содержащего и кириллицу и пробелы.\n\nЧеловек - это я. :D\n\nСтранно это, какой-то непостоянный баг...",
				"added": 1536039103
			},
			{
				"comment_id": 11,
				"body": "> [oob0imah](#comment_5_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): \n\nКстати, на Лингвофоруме вы не бываете? Ваш предыдущий ник в этой теме мне напомнил пользователя оттуда.",
				"added": 1536039415
			},
			{
				"comment_id": 13,
				"body": "@oob0imah:\n\n> Интересно, а если Гоги какой-нибудь негодяй напишет простейший скрипт, который будет регистрировать юзеров с тупым перебором всего алфавита, то скоро ваш зеронет закончится? \n\nЯ думаю, это вопросы роста. То же самое было в интернете, когда сайтам не нужна была защита от спама за отсутствием спамеров. Будет проблема - будет решение. Просто пока нет смысла этим заниматься.\n\n> Толку от этого gTjbK5EaK9j, если к нему даже Аватарки не прилагается? Как его отличить от gTjbK5EАK9j? \n\nАга, это интерфейсная задача. Если gTjbK5EaK9j — френд пользователя, а gTjbK5EАK9j — непонятный хрен с горы, значит надо как-то визуально выделять френдов в интерфейсе сайта. Может быть, даже подписать, что gTjbK5EaK9j — это, условно, «Вася».\n\nВопросы правильные, на самом деле я сам об этом же думаю. Вот сейчас пытаюсь реализовать часть необходимых интерфейсов — профили пользователей с расширенной инфой, в частности.",
				"added": 1536077018
			},
			{
				"comment_id": 14,
				"body": "> [balancer73](#comment_45_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ну, вот вам и черновые аватарки для теста :)\n\nКласс!",
				"added": 1536109125
			}
		]
	},
	"comment_vote": {
		"45_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}