{"cert_user_id": "jeff-hykin@github", "next_topic_id": 2, "topic": [{"topic_id": 1604067764, "title": "Sharable Links via traditionally hosted redirect server", "body": "## **Is your feature request related to a problem? Please describe.**\r\nEven if I specify that ZeroNet is needed, people still complain that the link doesn't work.\r\nI can't really blame them, I'm busy too.\r\nI'd like to make ZeroNet sites slightly more friendly for sharing on mainstream outlets (where people may or may not have ZeroNet installed).\r\n\r\n## **Describe the behavior you'd like**\r\nAs a Zite dev, I'd like to generate a shareable link (different from the Zite url), such that, when people visit that link, if they don't have Zeronet installed, they receive an explanation that they need ZeroNet, with directions/references on installation. (And if they do have Zeronet installed, they are redirected to the actual Zite)\r\n\r\n## **Describe a possible implementation**\r\nI could set this up for proof of concept\r\n- Setup a traditionally hosted server \r\n- Externally shareable links are actually just a link that directs to that traditionally hosted server\r\n- The externally shareable link contains the Zite URL as a parameter\r\n- The traditionally hosted server checks if ZeroNet is installed through a kind of localhost ping (unsure on the feasibility of this)\r\n- If ZeroNet is installed it immediately redirects to the Zite URL\r\n- If not it displays the installation explanation\r\n\r\n## **Describe alternatives you've considered**\r\n- Each Zite could designate its own traditionally-hosted backup server that could be shared externally\r\n- The ZeroNet app not being a required dependency (obviously unrealistic)\r\n\r\n## **Additional context**\r\nZeroNet is an incredible hidden gem, but it seems like its staying hidden. As a web dev ZeroNet has some of the most well designed interfaces I've seen on the entire internet. I'd love this to become more common, as I have several must-be-zeronet apps I'd like develop. \r\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1579813350, "modified": 1581261820, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406", "source_type": "github"}], "next_comment_id": 7, "comment": {"1604067764_mirrored_jeff-hykin_github": [{"comment_id": 1, "body": "Wow, well thank you @HelloZeroNet, @krzysztof113, and @filips123 for responding so quickly, I'm used to waiting a few weeks before hearing anything on my issues.\r\n\r\n> Part of it is implemented in zeronet.link\r\nhttps://github.com/krzysztof113/ZeronetLink\r\nI've seen that people use the same technique for their sites specifically.\r\n@krzysztof113 that repo \r\n\r\nThis is great, it is exactly the kind of thing I had in mind. Thank you!\r\n\r\n> It's a good idea, but I'm not sure about the automatically redirection: I think it would be a more clean solution to let the user decide if wants to open the link in the local client or via a proxy.\r\n\r\nThats a good consideration, I had not considered proxies as I didn't set one up myself. The redirect website could have an option similar to Android's option of \"Open ___ link with __ app [Always] [Just this one Time]\" But instead of ___ app it would be local network or via a proxy and it could save the user's preference to localStorage.\r\n\r\n> Maybe it would be even better to use https://go.zeronet.io/#[Siteaddress] as url, so the site address would not be sent to the server\r\n\r\nI'm not sure what you mean by this. Won't the server need the site address in order to perform the redirect?\r\n\r\n> I'm not fan of the \"default, official proxy\" idea as it would lead to centralization\r\n\r\nWhile I'm not so sure about a central proxy, I do think having `https://go.zeronet.io/#[Siteaddress]` as an official redirect service would be good. For all I know, krzysztof113 could add a commit tomorrow that redirects all my users into a phishing attack. (No offence @krzysztof113, I'm sure your server is great and I'll probably use it in the meantime). I have already trusted the ZeroNet repo enough to install it's app on my computer so it makes sense to trust it a little bit more as a redirect service (in comparison to some random 3rd party service). For those who may be concerned, there could even be a redirect-verification-tool built into the ZeroNet app that performs verification checks at random intervals to make sure the https://zeronet.io/ (or any site) is correctly performing redirects.\r\n\r\nWith that said about a central redirect service, I agree there should always be an ability to switch to an alternative. However, as per https://github.com/krzysztof113/ZeronetLink we already have that alternative.\r\n", "added": 1580088674, "modified": 1580090643, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-578587769", "source_type": "github"}, {"comment_id": 2, "body": "Hi @ghost,\r\n\r\nIf you're reading this, why not use your GPLv2-given-right and just clone the repo? You can\r\n- make it 100% uncensored\r\n- Give yourself all the credit you'd like to\r\n- Upgrade GLPv2 to v3 as described [here](https://www.gnu.org/licenses/gpl-faq.html#v3HowToUpgrade)\r\n\r\nThe beauty of open source, is you never have to tell someone what to do because you can always do it yourself. So why not take advantage of that, and stop disrupting a conversation between people who would like to work together.", "added": 1580090750, "modified": 1580090750, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-578592989", "source_type": "github"}, {"comment_id": 3, "body": "> Redirect could be performed by JavaScript. And because URL fragments (after #) are not sent to server, it shouldn't be able to track them.\r\n\r\nInteresting, I wasn't aware of that functionality. From a security standpoint, on the downside the client could still send the data back to the server, but on the (stronger) upside: everyone can see what the client is doing and if they see it send data back to the server would be incredibly suspicious. So that sounds like a fantastic idea to me. Now that I think about it, the redirect service could easily be hosted as a GitHub pages site.\r\n\r\n> He actually can't publicly relicense ZeroNet as it is licensed as GPLv2-only and this means that he needs agreement from all ZeroNet contributors to relicense their work. He won't need agreement if ZeroNet would be licensed as GPLv2-or-later, but it is not. That page from GNU is just for relicesing your own work, but since ZeroNet includes contributions from other users, he needs agreement from them.\r\n\r\nAh, but you see @ghost has contributed vast amounts of code so clearly he can just fill in the gaps and then upgrade the license 😄 \r\n\r\n(thank you for the info though, it was unclear to me how that would have been handled)\r\n", "added": 1580096648, "modified": 1580096648, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-578612615", "source_type": "github"}, {"comment_id": 4, "body": "This is great, and I think there's just one addition I'd like to request. Can there be a split between local and proxy with a url? Otherwise I'm going to need to give a little mini-tutorial with every post explaining to users what to expect (that the link doesn't actually go to my site) and option to pick which is kind of what I was trying to avoid in the first place.\r\n\r\nIf there are two urls:\r\n[https://go.zeronet.io/local/#1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8](https://go.zeronet.io/local/#1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8)\r\n[https://go.zeronet.io/proxy/#1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8](https://go.zeronet.io/proxy/#1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8)\r\n\r\nI can say:\r\nHey non-zeronet users, test out my site: *proxy-url* and consider getting Zeronet!\r\nZeronet users, here's the fast version of the site: *local-url*\r\n\r\nThat way once any user clicks the link they're greeted with what they expected instead of a 404-looking page even when they have Zeronet installed.", "added": 1581128121, "modified": 1581128211, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-583704212", "source_type": "github"}, {"comment_id": 5, "body": "> Can there be a split between local and proxy with a url?\r\n\r\nI'm dumb, please ignore that^ last message. I could literally just use the local client url or proxy url.\r\n\r\n> @jeff-hykin it shouldn't be working like this as using proxy promotes centralization. So it shouldn't be recommended, rather last resort.\r\n\r\nOh I agree, my original request I was assuming proxy wasn't even going to be an option.", "added": 1581255804, "modified": 1581255804, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-583866396", "source_type": "github"}, {"comment_id": 6, "body": "> You should only use it for non-ZeroNet users. There is no reason to use this page if you expect that the user already have ZeroNet installed.\r\n\r\nThe reason I opened the issue is **because** I expect a mixed audience (some have ZeroNet, some don't, and I have no way of knowing the difference).\r\n\r\nI think an example will illustrate the situation, so lets assume we're trying to make KopyKate go mainstream \r\n1. For KopyKate to \"take-off\" in a way similar to the early days of YouTube, it needs to be accessible by a non-technical audience. An audience that probably doesn't know what localhost or proxy is or the difference between them.\r\n2. KopyKate has a high data requirement, if a significant number of users are using proxies (I believe) the service isn't going to be capable of scaling to a larger audience. It will simply become slow and people will stop using it. \r\n\r\nIts hard enough to get people interested in a regular site when all they have to do is click the link. Adding a technical question like \"Using a proxy or using a local client?\" is going to act as a deterrent. Users will say \"yeah, I was curious, but not curious enough to do research on proxies\".\r\n\r\nThink of the days of FlashPlayer; people couldn't even tell you if they had FlashPlayer installed, they just installed it if they were told they needed it and then they would reload the page. (This isn't in support of FlashPlayer, it just shows what non-technical users are capable of and how they behave) \r\n\r\nNeeding to install ZeroNet is also a deterrent, but I believe its a necessary step for the scaleability of a mainstream site (KopyKate wouldn't work without P2P). And FlashPlayer has proven that installation is not too heavy of a burden for non-technical users.\r\n\r\nIf I'm presenting my site to a group of people, or if friends-of-friends are sharing my link on forums, I need the service to be as accessible as possible. I can't afford for it to inconvenience or confuse non-technical people who may or may not have ZeroNet installed & running, and the site itself can't afford for many people to be using proxies because of how much it would degrade performance/experience.\r\n\r\n", "added": 1581260656, "modified": 1581261820, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2406#issuecomment-583874703", "source_type": "github"}]}}