{
	"title": "100ant创业研究",
	"description": "My ZeroBlog.",
	"links": "- [100ant](http://127.0.0.1:43110/1DVV8GAnVqQXSYsZnmqahMdvKWBCyoohzk/)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1467944937,
	"post": [
		{
			"post_id": 8,
			"title": "Bots need a personality, not a brain like a vending machine",
			"date_published": 1467944932.895,
			"body": "Blog post body"
		},
		{
			"post_id": 7,
			"title": "荒唐逻辑 - 社交取代搜索成为移动第一入口，linkedin262亿美元不算离谱",
			"date_published": 1466339244.322,
			"body": "社交取代搜索成为移动第一入口，linkedin262亿美元不算离谱\n\n　　首先，这个价不算离谱，因为linkedin战略卡位了全球包括中国在内的职场社交超级入口。\n\n　　在PC互联网时代，搜索引擎是毫无争议的流量第一入口。但在移动互联网时代，以超文本链接为核心的Link模式已经完全失效，所以出现了“web已死”的说法。这导致了移动流量的三个剧变：碎片化、场景化、实时化。\n\n　　随着移动互联网和智能设备的双重爆发，人实际上成了最大的场景和流量枢纽。现在，这个趋势从未如此显著：社交网络取代搜索引擎，成了移动互联网时代的第一入口。\n\n　　你可以看到，在全球范围内，移动流量都高度向社交网络集中。在这样的大趋势下，百度的产业地位受到了严重冲击，微信成了超级APP，微博的市值轻松突破50亿美元。而在海外，Facebook也已经公认成为Google最大的敌人。\n\n　　但是，社交产品的分类很多，看看美国人的社交网络产品，Facebook、LinkedIn、Twitter、Instagram、Snapshot、Tumblr、Google+、Quora、Tagged、Yearbook、MyLife等等实在太多了，两只巴掌都数不完。这是因为人有着多重社交属性，熟人、生人、兴趣、职场等等，所以硅谷是非常热衷于做社交网站的。LinkedIn上市前微软有机会20亿美元收购，如今花了262亿美元，真是“活久见”——关键在正确的方向上坚持。\n\n　　而在这么多社交网络中，LinkedIn的市值仅次于Facebook。如果拓宽业务顺利，LinkedIn远期市值突破500亿美元应该没多大问题，这个价格不贵。全现金收购也许是因为微软账面现金太多，也许是因为团队可以部分套现，不要苛求一个创业了14年的公司。\n\n　　这是因为，职场社交的流量含金量极高，可以延伸出招聘、培训、知识分享等一系列成熟的商业模式。中国目前的移动社交网络其实主要是微信/QQ、微博、陌陌等，这其中职场社交蕴藏着很大的机会。\n"
		},
		{
			"post_id": 6,
			"title": "Data Dreamland与买方达成股权交易协议，Data Dreamland将以每股1.90港元的价格，出售公司11%的股份，交易金额为10.47亿港元",
			"date_published": 1466339032.688,
			"body": "6月17日晚，酷派集团发布公告称，宣布公司第一大股东Data Dreamland与买方达成股权交易协议，Data Dreamland将以每股1.90港元的价格，出售公司11%的股份，交易金额为10.47亿港元。\n\n　　早在2015年6月底，乐视旗下 Leview Mobile HK Limited（乐视移动）曾以27.4亿港币（约21.8亿元人民币）的价格收购了Data手中持有的18%的酷派股份。本次公告虽未明确指出买方身份，但根据“交易完成后，买方将成为单一最大股东”的说法，可以推测出这个买方应该是乐视。\n\n　　此次Data Dreamland将11%出售给酷派后，其在酷派的持股将由20.23%降至9.23%。收购完成后，乐视移动持有酷派集团的股票约占28.90%，成为单一控股股东。\n\n　　在上一次酷派的引资中，还曾引起了360公司的不满，而随着此次资本变动，酷派、360、乐视之间的纠葛也将告一段落。\n\n　　有分析表示，乐视入主酷派的原因，一是能够获的酷派的手机研发能力和在手机通讯领域的技术专利积累，据资料显示，酷派目前累计已持有7000多项专利，并在全球拥有七个研发中心，其次还能拥稳定的供应链和线下渠道。也有业内人士估计，乐视+酷派2016年智能手机总销量在5000万-6000万，2017年销售量有望突破1亿，成为销量最大的手机公司之一。\n\n　　此外，酷派征战多年的海外市场，也是乐视看中的。酷派是中国最早进入海外市场的手机品牌之一，曾在欧洲、美洲、东南亚等地经营，2014年酷派海外销售额达到20亿，在今年MWC上酷派宣称海外销量较上一年翻番。该公司与欧洲、北美和东南亚的运营商渠道均有合作，而乐视也正在布局美国市场，乐视在美国的公关主管Todd Witkemper曾对媒体表示：“公司正在美国掀起一波员工聘用狂潮，准备于今年秋天大举进军美国市场。”\n\n　　目前乐视在美国已经拥有400余名员工，他们的目标是到年底以前扩大至1000人，这些员工将分布在该公司旗下位于美国西海岸地区的四个办事处。\n\n　　此前，乐视已在中国和印度市场上提供视频流媒体服务，并面向全球市场出售手机。\n\n　　对于酷派来说，乐视成为第一大股东后，将对其通过“平台+内容+终端+应用”的的模式推动酷派手机转型成互联网硬件公司，有很大的帮助。\n\n　　此外，有媒体报道称，原华为荣耀负责人刘江峰将出任酷派CEO，而Fiil耳机（汪峰参股的那家耳机公司）CEO彭锦洲等前华为人也将跟随刘江峰进入酷派。\n\n　　这个消息其实也有迹可循，工商登记资料显示，主营智能硬件领域的产品研发和销售的深圳众思科技法定代表人是乐视控股战略副总裁阿不力克木·阿不力米提，在今年5月初，刘江峰曾以众思科技CEO的身份出席过一家乐视投资的游戏公司的硬件发布会。\n\n　　据36氪报道，众思科技内部员工证实了刘江峰的任职，并称目前团队成员主要来自于华为，曾帮乐视移动承接过手机ODM业务。在今年4月底，刘江峰已经参与到公司的经营决策中。\n\n　　刘江峰曾担任华为全球技术服务部总裁、亚太区副总裁、南太平洋(601099,股吧)地区部总裁兼澳大利亚公司董事等职位，2014年初出任华为荣耀总裁，并在同年将荣耀销量带动到2000万部左右。\n\n　　不过，彭锦洲向腾讯科技否认了这一消息，称并未离开与汪峰一起创办的Fiil耳机公司加盟酷派，但表示Fiil此前的确与乐视有深度合作关系\n"
		},
		{
			"post_id": 5,
			"title": "Webvan",
			"date_published": 1466040339.101,
			"body": "硅谷创业，永远不缺神话般的主角。名校、辍学、车库……这些关键词在一次次膜拜中逐渐演变成创业的时髦标配。\n\n　　一直以来，尤其是2000年互联网泡沫前的沸腾年代，前赴后继的创业者都在做一个梦——仅凭灵感和好点子就可以当上CEO，上市融资，一夜暴富。\n\n　　也是在那样一个时间点，远在大洋彼岸的美国就出现了一家时髦的创业公司——Webvan。作为一家O2O网上生鲜零售商，Webvan整整比我们如今所熟知的O2O模式领先了20年。\n\n　　Webvan在2000年的互联网泡沫中存活下来，却猝不及防阵亡在了2001年。甚至于成为了美国创业历史上，乃至是美国互联网历史上最为灾难深重的一次失败。\n\n　　一飞冲天的火箭式创业\n\n　　Webvan，这个1996年成立的的网上杂货零售商，在头三年，一个客户都没有的情况下，一心一意闭门造仓库，野心勃勃酝酿生鲜行业的风暴。\n\n　　三年后，这个仓库总算出世了。从硬件的4000万美元到软件的1600万美元，这是一个全副武装的仓储系统，围绕这个仓库还有专门配送的队伍。\n\n　　1999年，Webvan正式公布了他们的线上销售、线下送货的O2O模式，用户只需要点击鼠标,看中的货物就可以在30分钟内送货上门。用当时流行的一句话来形容：\n\n　　“用户在网络上订购一杯豆浆，可以在豆浆变坏前送到用户手中。”\n\n　　这种前所未闻的购物方式瞬间火遍美国。你可以想象的到的牛逼投资人和投资机构都跑上门来疯狂送钱。红杉、软银、高盛、雅虎……融资金额超过8亿美元，以及组建了超豪华的管理“梦之队”。\n\n　　Webvan的发展充分印证了当时美国互联网创业的“火箭速度”。\n\n　　从5月仓库开始运行，6月接到第一个订单，到8月IPO。哪怕公司实际营收只有400万美元，但Webvan首次公开募股筹集达到4亿美元，市值甚至冲到150亿美元。\n\n　　拿到钱后，Webvan干的“正经事”就是建仓库，在全美15个地区疯狂的建设成本3000-4000万美元的仓库。\n\n　　不仅建立起覆盖60英里范围的居民服务配套系统，还有专门的仓储机器人，甚至有用机器人来实现全自动配送的势头。Webvan完全可以称得上当时全世界最时髦的O2O生鲜零售商。\n\n　　疯狂烧钱12亿美元\n\n　　暂时先把估值这些放一边，替Webvan算算账。\n\n　　还没开张，一个客户都没有，也就是收入为0时，Webvan建仓库烧掉了4000万美元。还有开发仓库系统软件的1600万美元，仓库电线的500万美元，以及拿到融资和上市后在其他15个城市建仓库的扩张需求。\n\n　　Webvan走的本来就是零售商的路，这是一个利润空间很狭窄的行业，靠的就是薄利多销。由于Webvan的直接竞争对手还是传统超市零售商，因此只能尽可能放低价格迎战竞争对手。\n\n　　能否实现线上盈利还是悬而未决的催命符，线下的运费人工费又都是一笔巨额开支。不仅如此，号称自己物种齐全的Webvan，在无法满足顾客的要求时，会摘掉胸前的Webvan牌子，走进附近的杂货店和超市采购，再以自己平台上的低价卖给顾客。\n\n　　据分析师估计，从第一个订单到最后一个订单，Webvan每接一个订单就亏损大约130美元。\n\n　　Webvan根本做的就是赔本生意，盈利尚不可期，仓库和人工费用却还在烧钱。从1999年仓库投入应用后，从未达到过盈亏平衡，数据上始终都没有达到它所需要的订单数和用户数。\n\n　　在还是信奉流量为王的电商1.0时代，这些隐藏危机全被不约而同的忽略了。烧钱算什么，46%的市场占有率，超过三大生鲜杂货零售商市值总和的优秀成绩单，足以说服投资人和华尔街。\n\n　　1999年上市的Webvan，在之后的两年时间里烧掉了12亿美元。2001年，Webvan正式进入破产程序，并裁减2000名员工。\n\n　　CEO鲍德斯在Webvan破产后仍坚持：\n\n　　“我不认为我们做错了什么，做公司就像发射火箭一样。发射之前，你需要把可能想到、可能遇到的每一件事都想清楚，你不可能在火箭升空的过程中再去给它添加燃料。”\n\n　　事实上，整个硅谷开始对“火箭式创业”进行反思。\n\n　　伴随着Webvan的破产，美国的风投们对生鲜行业的信心，也随之破产了。美国早在96年就开始的O2O生鲜杂货行业，因此滞后了10年。\n"
		},
		{
			"post_id": 4,
			"title": "towards a universial system for all users",
			"date_published": 1465951468.834,
			"body": "100ant canbe and should have a similar college34 system, as do all businesses and organizaitons. the key features are - \n\n- university registration\n- fast, reliable, safe\n- you are the center of the world.\n"
		},
		{
			"post_id": 3,
			"title": "创业研究内容",
			"date_published": 1465890469.078,
			"body": "•创业新闻\n•创业尝试和常识\n•创业研究\n•创业融资\n•创业吐槽\n•向传统挑战\n•小企业生存的世界\n"
		},
		{
			"post_id": 2,
			"title": "100ant homepage",
			"date_published": 1465890284.382,
			"body": "http://127.0.0.1:43110/1DVV8GAnVqQXSYsZnmqahMdvKWBCyoohzk/"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "感谢本栏目的赞助和冠名商： 100ant.\n请访问网址：\nhttp://100ant.com"
		}
	]
}