{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1620570497,
			"title": "（脑补迪化流",
			"body": "全世界只有我不知道我是高人\n全世界都以为我会修仙\n《我师兄实在太稳健了》",
			"added": 1620570496,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1620612638,
			"title": "移动互联网的各种“入口梦”彻底破灭",
			"body": "互联网时代，“入口论”特别流行，其中搜索引擎和浏览器是比较有代表性的，搜索引擎号称是互联网的入口，而浏览器则号称是用户上网的入口。到移动互联网初期，各种“入口论”并未消失，大部分人还停留在PC的大潮流中没有转身。手机搜索、手机浏览器、应用商店、微信都曾被冠以“移动互联网入口”的头衔。今天，估计再也没人用“入口”来形容这些手机搜索、手机浏览器、应用商店、微信了。\n\n去中心化的移动互联网现状，让任何一个有“入口梦”的人都无法实现。首先，各个App都是“各自为政”，即使开发者的App从App Store、应用宝、百度手机助手、360手机助手、华为应用市场、小米应用商店、vivo应用商店这些应用商店里走，但内容仍旧是独立的，只是单纯渠道的话，价值并不大，或者说其能薅走的羊毛有限。\n\n其次，手机搜索、手机浏览器、应用商店都有多个友商在竞争，并非像PC时代一样一家独大，分散会打破各种“入口梦”。而微信固然是一个非常大的超级App，可移动互联网的诸多内容仍旧要依靠其他渠道才能实现，微信主要还是社交功能。\n\n最后，巨头们的彼此对立，也不可能让“入口”出现。创业型公司要成长为新巨头完全有可能，但要想脱离BAT等传统互联网巨头的视野，建立一个新的“入口”，建立一套新的游戏规则，这些巨头们肯定不给创业公司这个机会，而如果是巨头自己想做“入口”，另外的巨头，也不会主动参与的，残缺，会让用户主动去找寻其他实用的平台。\n\n第三方应用商店的这种“入口梦”显然是没戏了，能够维持现状就已经很不容易。\n\n2.手机厂商自带的应用商店会取代第三方应用商店吗？\n\n华为应用市场、小米应用商店、vivo应用商店、OPPO软件商店们最有可能的情况是，直接取代应用宝、百度手机助手、360手机助手、PP助手、豌豆荚等第三方应用商店，但是，这有可能吗？\n\n第三方应用商店跟手机厂商自带的应用商店相比，其优势在于：\n\n第一，功能性比手机厂商自带应用商店功能强。除了能够容纳海量应用外，第三方应用商店所具备的功能要比手机自带应用商店功能多得多，比如手机垃圾清理、手机文件夹管理、手机加速、安全扫描等，虽然其他应用也会提供这些功能，但第三方应用商店的优势是做了聚合，只需要下一款应用，而不是多款。\n\n第二，据郭静的互联网圈了解，第三方应用商店新应用的更新速度比手机厂商自带的应用商店要快，而且有些App明明第三方应用商店已经更新好几天了，手机厂商的应用商店才逐渐跟上更新速度。用扫描的形式也会发现，第三方应用商店里待更新的应用数量比手机厂商应用商店待更新应用多。\n\n第三，应用数量要比手机厂商自带应用数多。目前厂商和第三方应用商店公布的数据中，比较常见的是用户覆盖量、累计下载量以及日下载次数，实际上这些数据参考价值并不大，比如头部的某些应用可能就占据了下载量的大部分，而大量中尾部的应用下载量却很低，当然，某应用商店公布的日打开率10次以上的数据我是不信的。真正对用户有价值的是所涵盖的应用数，直白的说就是当用户在应用商店里搜索某应用，是否能够搜到。就目前来看，第三方应用商店通过多年的累计，其积攒的应用数要比手机厂商多，手机厂商更爱赚直接预装应用的钱，应用商店里收纳某头部应用，并无实际价值。\n\n最为明显的，是第三方应用商店里推广的游戏应用更多，用户能够享受到的好处也越多，这在手机厂商的应用商店里是是看不到的。\n\n第四，更加活络。手机厂商的应用商店本身还是比较落后的，而第三方应用商店用起来更为活络，比如用户登录、应用更新、应用的相关性，以及相关应用专题等。\n\n\n总的来说，第三方应用商店走在了手机厂商应用商店的前面，而这对于用户来说是有价值的，所以，一定时间内来看，手机厂商的应用商店是无法取代第三方应用商店的。除非将来某天手机厂商的相关功能、特性、优势已经跟第三方应用商店平齐了，第三方应用商店就有可能日渐沦落，否则的话，用户还是会主动去使用第三方应用商店，手机厂商做的应用商店，委实差太多。\n\n3.第三方应用商店离死亡还有多远？\n\n如果非要用一种所有的产品最终都会死亡的论调，那么，第三方应用商店最终肯定也会死亡的。但就目前跟手机厂商的竞争来看，第三方应用商店离死亡还早的很，只能说第三方应用商店目前的日子略显艰难。\n\n首先，手机厂商不再对第三方应用商店开放。早期的手机厂商并未发现应用商店里的商机，所以，第三方应用商店能很快跟底层系统接入，但现在手机厂商都在加紧布局自己的应用商店，手机厂商不再对第三方应用商店开放，主要表现在：\n\n1.WiFi环境下自动安装更新应用功能，系统底层不予支持，用户只能通过手机厂商自己的应用商店才能使用该功能；\n\n2.手机厂商的应用商店里无法搜索到应用宝、百度手机助手、360手机助手第三方应用商店。当初豌豆荚因为在百度手机助手内无法搜索到豌豆荚而发表了公开信，而现在手机厂商默认就是搜不到主流的第三方应用商店。\n\n仅仅是搜不到的话，还能通过手机搜索继续找到，而WiFi环境下自动安装更新应用，对用户来说却是非常实用的功能，否则，每次打开应用都会跳出来更新，会比较讨人嫌。\n\n这种不开放，可能会导致用户主动向手机厂商自带的应用商店迁移。\n\n其次，其优势能持续多久？当前的状况是，第三方应用商店比手机厂商的应用商店仍旧有些许优势，可问题是这种优势又能持续多久呢？要知道手机厂商的软件层面也会逐渐进步，手机厂商也会逐渐加码应用商店，随着时间的迁移，这种优势会被逐渐缩小直至拉平，除非，第三方应用商店能一直保持这种优势。\n\n最后，盈利过于依赖游戏。豌豆荚还是蛮幸运的，跟PP助手联合起来增强了阿里系的分发能力，特别是在盈利能力上，UC游戏的能量也被注入到豌豆荚里，“小清新”豌豆荚的变现能力亦强了不少。\n\n第三方应用商店主要的盈利模式有两种，广告和游戏联运，前者自然有各类广告主买单（比如创业公司、金融公司），而后者则是基于自身对用户的数据分析，跟游戏厂商合作，共同分享手游的果实。广告卖的是流量，只要有流量，就有广告收入，但第三方应用商店当前的流量已经比不上曾经的巅峰时期了。第三方应用商店的盈利点主要还是靠游戏，甚至华为应用市场、小米应用商店、vivo应用商店们也学会了靠游戏赚钱。\n\n经过几年的发展，应用商店能讲的故事都差不多讲完了，比如豌豆荚心心念念的应用内搜索，最终证明这条路行不通后，又被应用宝给拾起来了，目前看也未走通。而百度手机助手则是直接看中当前的商机，在今年的ChinaJoy大会上表示要发力游戏领域。手游所带来的现金流，让第三方应用商店很快就转变了角色，大力布局游戏领域。\n\n实际上最初第三方应用商店还是蛮有创新精神的，比如LBS分发、社交分发，可惜，这些创新最终都无疾而终，而且，游戏所带来的诱惑也很难让人抵挡，赚钱，活下去才是最重要的，其他皆是空。第三方应用商店之于游戏，靠的是渠道能力、运营能力，而这个是“内核”，手机厂商就算再强，第三方应用商店积攒的渠道能力、运营能力，是抢不走的。\n\n至于死不死，还是得看自己，够强就够硬。",
			"added": 1620612636,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620612776,
			"title": "如何评价夸克浏览器？",
			"body": "QQ浏览器和小众浏览器也比较好用",
			"added": 1620612773,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620613069,
			"title": "野蛮生长之后，未来还会留下哪几个超级APP？",
			"body": "关于APP市场发展趋势以及各类APP未来走向的争论一直没有停过，APP市场也前赴后继的出现各类应用，不过，如今的APP市场已经趋于饱和，一些推陈出新的应用也不过是新瓶装旧酒罢了。\n\n这个行业经过几番野蛮生长之后，用户们的好奇心正如潮水般急流褪去，小众类APP还能苟延残喘，大众类APP开始日渐式微，而超级APP正在吞噬市场。自去年开始，关于Native App与Web App谁才是未来的争论愈发激烈，这主要是因为几家巨头暗中不断向市场施压，试图打造超级APP来控制移动互联网市场。\n\n当然，大环境市场上肯定还是众多APP百花齐放的局面，但从用户使用率来看，已经开始出现了超级APP的趋势。那么，哪些应用会成为超级APP？从艾瑞最新发布的数据来看，即时通讯、浏览器、应用商店成为覆盖用户最广的三类工具（事实上，排在第三的是系统工具，只是暂时还不具备成为超级APP的可能，所以略过了，不好意思），分别覆盖2.57亿、2.14亿和1.61亿人，排在后面的依次是网络购物、在线音乐、安全、在线视频、支付以及优惠比价类应用。\n\n1\n\n从产品功能特点来看，排在“前三”的即时通讯、浏览器和应用商店最具备成为超级APP的可能，对应的应用分别为微信、UC浏览器和豌豆荚。\n\n即时通讯\n\n大家都看得到，在即时通讯中，微信正一步步成为一个超级APP，社交、资讯、游戏、邮箱、音乐、地图、购物、支付、理财、生活服务等各种功能一应俱全，而且微信有6亿用户，用户规模仅次于同门应用手机QQ，不过微信的用户比手Q更活跃，业界也更看好微信。\n\n微信已经不可逆的走上了超级APP的路，腾讯给予微信厚望，不断为微信增添各种功能。起初业界普遍不看好腾讯通过微信做社交以外的其他服务，但微信一点点证明它增添的各项新功能都能引起业界的轰动，公众平台如此、移动游戏如此、移动支付亦是如此。\n\n现在的微信很是自信，新年红包、滴滴打车更是让微信收获了一个风生水起的开年，接下来说不准微信还会增添什么新功能，通讯录功能早在计划之内，微信做搜索被给予厚望，另外，近期微信已经接入广点通开始测试广告项目了。要说微信再增添个天气、日历、记事本等这类工具功能也根本不是难事，只要有这个必要随时都可以推进。\n\n有舆论认为，微信越来越臃肿了，这点无法否认，超级APP很美好，但必然也会有一些新的负担出现，产品的发展不就是始终处在出现问题解决问题的状态嘛。\n\n手机浏览器\n\n目前来看，与微信同样具备成为超级APP实力的还有UC浏览器，这家早在Symbian系统时代就在移动互联网领域打拼的公司，终于在android和ios时代壮大起来。根据艾瑞最新发布的《2013年中国手机浏览器行业分析报告》内的数据显示，从2012年11月到2013年11月，手机浏览器行业月度平均覆盖人数达1.7亿，UC手机浏览器、QQ手机浏览器、百度手机浏览器分列行业前三位，用户渗透率分别为65.9%、32.5%、10.4%。\n\n2\n\n《报告》内数据还显示，从2012年11月到2013年11月，手机浏览器的用户规模以月均4%的增长率持续增长，用户有效使用时长也保持持续上升趋势，2013年11月比2012年同期增长了97%，这表明手机浏览器做为移动互联网入口的作用越来越强。同时，用户人均使用手机浏览器的个数呈现下降趋势，2012年11月为1.42个，2013年11月为1.29个，与之对应的数据还有PC浏览器人均使用2.46个，这表明用户在移动端逐渐对单一浏览器形成依赖。\n\n在过去移动互联网最热的两年，曾有一段时间舆论开始唱衰手机浏览器的市场价值，认为移动互联网是APP百花齐放的时代。不过，时至今日，这种声音近乎销声匿迹了，渐渐的手机浏览器又成为公认的移动互联网入口之一，甚至出现了是超级APP的呼声。\n\n可想而知，在PC互联网上，大部分的操作都是通过浏览器完成的，虽然在移动互联网时代对浏览器的依赖下降，但各式各样五花八门的使用需求最终还都将集合在一款应用上来实现，它必然是手机浏览器。要说真有所谓的超级APP的话，手机浏览器天生就是超级APP的料。\n\nUC浏览器深耕多年，终于等到了自己的出头之日，超级APP之争算是有UC的立足之地了。不过腾讯在手机浏览器市场也很威猛，QQ浏览器也够体量与UC拼一拼，而百度更是将手机浏览器作为未来的核心之一，没有浏览器支撑，百度移动搜索就要弱一大截了。\n\n应用商店\n\n应用商店已成手机的必备应用之一，过去它只是用户下载应用的工具，谁曾想到它居然也有成为超级APP的潜质。在1月初，豌豆荚完成1.2亿美元融资之后宣布将从应用分发渠道转型为移动内容搜索，如今豌豆荚的搜索内容不再局限于手机应用和游戏，已经扩展到了音乐、图片、小说、电影、电视剧、手机主题等多个类目。\n\n成为超级APP最基本的要求就是：经常用，功能多，用途广。虽然，目前豌豆荚还称不上是一款超级APP，但我们已经可以看到一些超级APP的影子了。对豌豆荚类应用商店来讲，常用不是问题，需要解决的则是功能多和用途广，从音乐、图片、小说、电影、电视剧、手机主题等内容的搜索做起算是一个不错的切入点。事实上，百度和360也已经开始在应用分发渠道上出手了。\n\n结\n\n并不是说有了超级APP就不需要其他APP了，超级APP可以解决更多的问题，用户使用时长也就会越长，当用户将更多精力集中在几款超级APP上，意味着其他APP的市场价值就会打折扣。\n\n谁能最终成为超级APP？目前微信和UC浏览器算是领先其他人，豌豆荚只能算是有潜质。\n\n\n-----------------------------------------------------------\n\n浏览器和应用商店都能做社交，B站做了游戏社区",
			"added": 1620613065,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620613977,
			"title": "区块链会取代互联网成为新一代基础设施吗？",
			"body": "Web 3.0+IPFS/Filecoin",
			"added": 1620613972,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620830416,
			"title": "建国后不许成精",
			"body": "杠精\n戏精",
			"added": 1620830410,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620916504,
			"title": "对于老鼠乌托邦实验是什么看法？",
			"body": "不过老鼠乌托邦崩溃在于空间有限\n\n导致面对竞争失败的老鼠无处可逃\n\n三和大神\n\n内卷",
			"added": 1620916567,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1620917238,
			"title": "为什么说现在是末法时代，有什么特征？",
			"body": "真正的末法时代就是赛博朋克那种社会，科技技术发展水平很高，但是贫富差距巨大，犯罪率高，底层人民生活无比苦难，且没有翻身的机会。",
			"added": 1620917229,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1621368343,
			"title": "修仙界移民",
			"body": "简介：　　　　 \n穿越？重生？不不，这只是最普通的一次修仙界移民\n\nhttps://www.ihuaben.com/book/5225438/33791104.html",
			"added": 1621370769,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1621370447,
			"title": "修仙游戏满级后",
			"body": "对于一款游戏的资深玩家而言，把游戏全部能够玩的都以完美姿态玩了个遍后，似乎退游成了最终归宿。\n\n资深玩家叶抚玩了快十年的《仙路漫漫》，当他脱坑退游，选择卸载游戏时，突然就穿越了。\n\n他很快就发现，他似乎是带着游戏的满级属性穿越的……（注：轻松日常养成是主旋律，体验异世界的人生百态是真滋味）",
			"added": 1621370436,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1621371709,
			"title": "我靠装逼，当隐世宗门掌教",
			"body": "江北辰穿越到玄幻世界，偶然得到最强掌教系统，成立“仙道门”。宗门初期，他只得靠拐骗气运之子来升级宗门。每天都要装高人风范，唬骗一众仰慕自己的天骄弟子。慢慢的，江北辰发现，自己的小宗门，还真成为了最顶尖的隐世宗门！",
			"added": 1621371697,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1622245366,
			"title": "随机惩罚一名幸运观众",
			"body": "系统：“请宿主尽快完成任务—活捉一条龙、”\n\n李文强：“就不！”\n\n系统：“检测到宿主态度极其不端正，判定任务 失败，将随机打死一名幸运观众。”\n\n“……”\n\n千里之外，某大乘期老祖惊恐的抬起头来，看着天空中的天罚雷云，崩溃哭喊：\n\n“李文强完不成任务，关我什么事，不！”\n\n“还好有三个时辰的时间限制，我应该可以去帮他捉一条龙吧？”\n\n“……”\n\n若干年后，李文强终于飞升仙界。整个修真界所有人瘫坐在了地上：“这个扫把星终于走了。”\n\n“……”\n\n这是一个没有灵根的超级无敌废柴，在整个修真界的“帮助”下，成为牛大佬的故事。",
			"added": 1622245352,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1622246451,
			"title": "CPUFetch——一款在 Linux 中查看 CPU 信息的简单工具",
			"body": "",
			"added": 1622246436,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1622691692,
			"title": "大圣直播间",
			"body": "相信我，你之前看过的只是一本假《西游记》，央视六小龄童版本更只不过是哄孩子的童话而已。 　　小小的监狱人民警察崔石，无意中闯入真实的西游世界，卷入那场暗流涌动的取经漩涡之中……　　为什么要取经？　　你以为是为了天下清平人心向善？那为什么从取回真经到今天，这个尘世却越发喧嚣浮躁？ 　　吴承恩：别压着老子的棺材板，放我出去！　　剑西来：安息吧，创世神。",
			"added": 1622691676,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1622968801,
			"title": "【潘嘎之交】这里的水太深，你把握不住，让叔来，叔是长江",
			"body": "最近潘嘎之交是彻彻底底的火了一把，事情起因简单来说如下:\n\n嘎子（谢孟伟）因直播卖假酒被新闻点名批评，遂与潘长江连麦，被潘长江苦口婆心的批评\n\n“孩子，你听叔的不，网上的东西都是虚拟的，这里面水很深，你把握不住” 嘎子痛哭流涕决定痛改前非。\n\n后来潘长江也开始直播疯狂带货，比嘎子带货更加生猛，这段佳话也被热心网友称为“潘嘎之交”\n\n在网友们的二次创作下，潘嘎之交获得了两开花的局面，令众网友啼笑皆非",
			"added": 1622968784,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1623040818,
			"title": "我这么天才为何还要收徒弟",
			"body": "陆萧然穿越到玄幻世界，奈何狗系统迟迟没有激活。\n\n    没有办法的陆萧然，只能自己低调修炼，稳健发育。\n\n    然而，等到陆萧然已经成为整个宗门最强的存在之后，狗系统突然激活。\n\n    陆萧然：狗系统，我已经靠自己修炼成一个顶级高手了，你可以滚蛋了。\n\n    系统：顶级高手？你成大帝了？你成至高了？你成仙了？还是成圣了？还是变成创世至尊了？\n\n    陆萧然：...。",
			"added": 1623040800,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1623040879,
			"title": "我在魔法世界开创互联网时代 白天太白 著",
			"body": "神的力量来自众生。\n追随者越多，神的力量越强大！\n意外获得契约神格的余生安，嗤笑道：“嘁，别整那些虚头巴脑，不就是互联网抢夺用户流量那一套吗？”\n看我：\n社交平台收割流量；\n短视频用户下沉；\n知识问答吸纳铁粉；\n异界直播转化信徒；\n电商利益拉拢所有人；\n再来一波第四天灾，平推尔等（众神）歪门邪道！",
			"added": 1623040860,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1620862183_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta": [],
		"1620830416_12YVGdGHpzdfEjeuJZEhfA8j8X6s3fiVck": [
			{
				"comment_id": 2,
				"body": "墨茶Official（1998年4月5日-2021年1月10日） ，姓陈，男，四川凉山人，B站UP主。 2021年1月10日10时许，“墨茶official”在会理县出租屋内被发现死亡。 经会理县公安局勘查，确定其为因病死亡，在会理县殡仪馆火化后，其骨灰由母亲带回西昌，于1月12日安葬。",
				"added": 1620912805
			},
			{
				"comment_id": 5,
				"body": "土坯房_百度百科\n由于我国广大农村还存在数量巨大的土坯房，因而在现阶段依然有必要研究土坯房的性能，作为建筑结构的补充，土坯房依然有其适用性的一面。",
				"added": 1620915637
			},
			{
				"comment_id": 6,
				"body": "新中国成立前，村子里很穷，到处是破烂不堪的稻草房，房基是泥巴块，屋顶是稻草，夏天像蒸炉，冬天像地窖。一到下雨天，房子处处滴水，真是“屋外下大雨，屋里下小雨”啊！根本没法住，经常看到头顶着盆睡觉的怪现象。",
				"added": 1620915773
			}
		],
		"1620570497_12YVGdGHpzdfEjeuJZEhfA8j8X6s3fiVck": [],
		"1620913049_12YVGdGHpzdfEjeuJZEhfA8j8X6s3fiVck": [
			{
				"comment_id": 4,
				"body": "陈安之一边说着，一边走过去，将院门打开。\n\n    只是，当他看到来者时，顿时愣住了。\n\n    此刻，站在小院门外的，是一名黑衣青年。\n\n    青年怀中抱着一把剑，脑袋微低，头发随意披散着，随风轻轻摆动，看不全他的面庞。\n\n    但是，却有一股浓浓的逼~味，迎面扑来。\n\n    “好强的逼~压！”\n\n    陈安之心惊。",
				"added": 1620913929
			}
		],
		"1620917238_12YVGdGHpzdfEjeuJZEhfA8j8X6s3fiVck": [
			{
				"comment_id": 7,
				"body": "房租，压垮年轻人的第一根稻草，吸干了北上广漂的血 \n\n那些满怀憧憬留在北京的年轻人，还未体会到求职、求婚、为子求学、求医等接踵而来的人生压力，就先感受到了来自真实世界和经济学原理的第一轮恶意。\n\n北京房租仍在上涨，并且有赶超收入涨幅的趋势。在可以预见的未来，房租涨势或许会越来越凶猛。\n\n房租，或将成压垮年轻人的第一根稻草。\n\n房租收入比高达58.6%！买不起也租不起？",
				"added": 1620918795
			},
			{
				"comment_id": 8,
				"body": "为什么都说现在生产力过剩了还是活得那么累挣钱那么难呢，过剩的东西都到哪儿去了？\n\n资本主义下的过剩，是生产的结构性过剩，和需求的不足。\n\n简单解释就是，赚钱的项目，资本蜂拥而入，造成过剩。不赚钱的项目，根本没人投钱，严重缺乏。",
				"added": 1620919236
			}
		]
	},
	"comment_vote": {}
}