{
	"next_topic_id": 40,
	"topic": [
		{
			"topic_id": 1565811747,
			"title": "The alt-right of today are not Nazis.",
			"body": "My SS great grandpa would disagree strongly with that label and for good reason. The alt right supports Trump who A) legitimized Israel's claim to Jerusalem by putting the embassy there and B) loves slavs like Putin. Neither of those things are compatible with the Nazis, primarily because jews and slavs are simply not human. If you are alt right, you are mentally subnormal.",
			"added": 1565811746
		},
		{
			"topic_id": 1566171789,
			"title": "Listen guys, if you think about it...",
			"body": "ISIS is pretty fucking metal. They behead people, they're going to fuckin' war, and they get people to go blow themselves up. Take away the fact that they've clearly cooked their heads with the desert heat and the fact that they worship a faceless pedophile for a prophet and they're basically the most fucking metal thing to come out of the middle east since someone realized you can stone people AND burn them alive.",
			"added": 1566171786
		},
		{
			"topic_id": 1566178418,
			"title": "What's more plausable?",
			"body": "Two completely separate, poorly understood/unexplainable medical conditions exist where people see shadow people and one where young men just die in their sleep? Or there's a hidden threat of shadow people killing you at night?",
			"added": 1566178414
		},
		{
			"topic_id": 1566580217,
			"title": "Why are you happy, today?",
			"body": "For me it's because my niece has been having a great week as a third grader : )",
			"added": 1566580212
		},
		{
			"topic_id": 1566887761,
			"title": "How have you sinned today?",
			"body": "Hail Satan, it's that time again! \n\nI'll start!\n\nToday I called over some jehova's witnesses and tried to convert them to Satanism. I also went online and took away a so-called safe-space from emotional abuse victims. It's not a lot but if we sin together we can make the world a little worse with each passing day :D",
			"added": 1566887755
		},
		{
			"topic_id": 1566887989,
			"title": "/HG/ - Hemovores General Thread",
			"body": "The thirst is real edition :D\n\nAnyone else dry today? I always finish my bags a few days early and it sucks. Can't be an American with what they give you, you know?",
			"added": 1566887982
		},
		{
			"topic_id": 1566926087,
			"title": "Cipher is the worst x-man, change my mind",
			"body": "think about it:\nCyclops? Shoots you with his lazer eyes. Totally bitchin.\nRogue? Bitch can literally off you with a handjob. 10/10 would let steal my power.\nBut Cipher? What is he gonna do in a fight? Speak Spanish at the bad guy?\nHe's totally lame!",
			"added": 1566926079
		},
		{
			"topic_id": 1567003987,
			"title": "Not to be antisemitic but someone needs to jail Epstein's associates.",
			"body": "",
			"added": 1567003978
		},
		{
			"topic_id": 1567289115,
			"title": "How is everyone doing today?",
			"body": "I hope you're all having a good day!",
			"added": 1567289105
		},
		{
			"topic_id": 1567289433,
			"title": "IFL my niece so much",
			"body": "she's my entire world and I wanna protect her smile",
			"added": 1567289422
		},
		{
			"topic_id": 1567374583,
			"title": "I have become high",
			"body": "Perhaps the highest ever.",
			"added": 1567374571
		},
		{
			"topic_id": 1568042136,
			"title": "Friendly reminder",
			"body": "You can mute trolls by hitting those three little dots by their name",
			"added": 1568042118
		},
		{
			"topic_id": 1568042578,
			"title": "DO you ever just look up at the stars and think",
			"body": "Man, there must be so much alien space pussy out there",
			"added": 1568042559
		},
		{
			"topic_id": 1568042910,
			"title": "Getting Zeronet on IOS",
			"body": "So this isn't 100% perfect but I managed to get Zeronet on iphone by downloading iSH from the test-flight app and running Zeronet on it. So far it works pretty ok. Just need to backup my identity to it and find a way to minimize battery drain.",
			"added": 1568042890
		},
		{
			"topic_id": 1568044121,
			"title": "Nature walks",
			"body": "Do you ever just get up and walk through the woods? I've been making it a habit whenever I get stuck coding and I gotta say it's pretty dope for clearing your head a little.",
			"added": 1568044100
		},
		{
			"topic_id": 1568044815,
			"title": "Daily cuteness thread",
			"body": "What's the cutest thing you ever saw? One of my nieces hugged her blankie and kissed it and I literally just ASHGFJHSHSUHGD",
			"added": 1568044793
		},
		{
			"topic_id": 1568045324,
			"title": "SOMEONE HELP PLEASE",
			"body": "I killed a dude's dog and now he's coming after me and he's already killed like a dozen of my colleagues in under ten minutes and I know I'm n",
			"added": 1568045301
		},
		{
			"topic_id": 1568069228,
			"title": "Nobody Lives On Australia",
			"body": "They'd fall off bc it's on the bottom of the planet. And I know what you're thinking. What about South America? How do they stay on the planet. Simple. Trees make air and that air pushes people up while they'd normally fall down and these forces equalize to make it so they don't fall off the bottom half of the planet. Australia has no rainforest so there's no air being made by the trees to push them upwards.",
			"added": 1568069201
		},
		{
			"topic_id": 1568081655,
			"title": "A good cause",
			"body": "Hi. I'm Kid Courageous. Did you know every year millions of dogs die without ever once having sex? For just 26 cents a day you can help get dogs laid. #CanineVirginityCrisis #EndTheStruggle #GetThemLaid",
			"added": 1568081627
		},
		{
			"topic_id": 1568136294,
			"title": "Why does zeronet not have a spambot issue the way Mastodon does?",
			"body": "",
			"added": 1568136265
		},
		{
			"topic_id": 1568139206,
			"title": "Onii-chaaaaaan",
			"body": "Mom says let me watch minecraft videos on the big tv",
			"added": 1568139176
		},
		{
			"topic_id": 1568221970,
			"title": "Wholesome Posting General",
			"body": "Let's be wholesome and happy! Post something good that happened to you or whatever makes you smile! I'll start!  I'm sitting my nieces and the youngest gave her blankie a big hug and a kiss and it was so adorable it made my heart go HHHHHNNNNNGGGGGGHHHH",
			"added": 1568221938
		},
		{
			"topic_id": 1568224054,
			"title": "Is anyone in the Skull & Bones Society?",
			"body": "I don't wanna join or be president I just wanna go in the cum coffin you guys!",
			"added": 1568224021
		},
		{
			"topic_id": 1568229967,
			"title": "Let's talk bigfoot encounters",
			"body": "Is he real? Does he really try to eat ass?",
			"added": 1568229933
		},
		{
			"topic_id": 1568254064,
			"title": "Oy vey!",
			"body": "https://www.nytimes.com/2001/09/14/us/after-attacks-investigation-authorities-have-learned-identities-18-hijackers.html\n\nhttps://www.wrmea.org/002-january-february/did-israel-have-advance-warning-of-9/11-attacks.html",
			"added": 1568254029
		},
		{
			"topic_id": 1568305901,
			"title": "Why is she so cute?",
			"body": "My youngest niecey and I are playing with her Duplo trains and I made them explode and she giggled so hard and then I put on electronic music and she was so happy and dancing and ASGDHDHFG",
			"added": 1568305865
		},
		{
			"topic_id": 1568675236,
			"title": "Real shitposter hours who up",
			"body": "",
			"added": 1568675199
		},
		{
			"topic_id": 1568831967,
			"title": "It's not just the preists",
			"body": "Jews fuck young boys too\n\nhttps://www.npr.org/templates/story/story.php?storyId=99913807",
			"added": 1568831929
		},
		{
			"topic_id": 1568832207,
			"title": "How long until someone posts a manifesto",
			"body": "And do you think they'll go for the high score?",
			"added": 1568832168
		}
	],
	"topic_vote": {
		"1566424243_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1
	},
	"next_comment_id": 260,
	"comment": {
		"1565669207_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 1,
				"body": "Desoxyn, since I have ADD.",
				"added": 1565675408
			},
			{
				"comment_id": 73,
				"body": "> [publicality](#comment_11_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): oh :odoes it helps?\n\nIt does but only because it's not being abused. If you were to take desoxyn without having ADD you'd probably end up reliant on it for productivity which is kinda the catch 22. My advice is to try other means of staying productive before going to get diagnosed. As for me I already did and there was definitely an imalance chemically. I'm normal now but without my meds? Totally different person. Lazy, unfocused, and unmotivated... and none of that by choice!",
				"added": 1567287534
			},
			{
				"comment_id": 74,
				"body": "Not that it has much abuse potential tbh. I shared it with street meth users once just to see if I could make some extra cash selling it. Nah. They prefer the dirty stuff. Turns out when you're used to smoking 50 mgs of street crank every few hours 5 to 10 mgs of pure meth is about as stimulating as a cup of tea.",
				"added": 1567288157
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 2,
				"body": "You're all wrong. Everything you listed also can apply to white trash. And that's why it's class that matters, not race.",
				"added": 1565691730
			},
			{
				"comment_id": 4,
				"body": "> [arckat](#comment_3_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi): What did you mean by saying \"white trash\"?\n\nI mean people who are a disgrace to the master race. I mean degenerate, low class rubes who should be leading a better example.",
				"added": 1565694468
			}
		],
		"1565644143_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": [
			{
				"comment_id": 3,
				"body": "GET. THAT. NUT.",
				"added": 1565691852
			},
			{
				"comment_id": 7,
				"body": "> [kristallnacht](#comment_5_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw): GOT THAT NUT BROTHER, I CAME SO HARD THAT IT BLEW A HOLE IN MY WALL\n\nHELL YEAH BROTHER WHAT'RE YOU GONNA DO WHEN THAT HULKAMANIA COMES TO YOU",
				"added": 1565723146
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 5,
				"body": "> [watteau](#comment_65_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): God doesn't love us?\n\nNo of course he fucking doesn't. Hail satan, faggot",
				"added": 1565722976
			},
			{
				"comment_id": 6,
				"body": "Because your \"god\" wrote down that eating shrimp is a ticket to hell and that if you pay the father of the girl you rape you own her. That's not a loving god. Meanwhile, Satan says: No rape. Period.\n\nJust saying, you're praying to the wrong guy.",
				"added": 1565723060
			}
		],
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 8,
				"body": "No. Also go home boomer",
				"added": 1565811858
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's a really bad idea, because they'll create new account the moment they're notified to continue pestering you. [...]\n\nThat's what makes it fun. And we can tell just by the way you don't reply. Usually I just run a new instance under a different VPN and go around messing with that person.",
				"added": 1565812839
			}
		],
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 10,
				"body": "See? You're arguing over stupid shit because you are all mentally subnormal. I rest my case.",
				"added": 1565824922
			}
		],
		"1565855060_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 11,
				"body": "It's just vague enough to work",
				"added": 1565862230
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 12,
				"body": "K. Bye.",
				"added": 1566047614
			}
		],
		"1566074416_1PGDKdsYUcJajEbqqgb91pJp1rUzznwGvU": [
			{
				"comment_id": 13,
				"body": "Thanks to nepotism I work for an NSA contractor. We get a lot of traffic across government sites and since my relative owns the business he trusts me to lock up and tcob at the end of the day. Sometimes he's there late with me and we're coding through the night, sometimes I'm alone. When it's the latter I sometimes take the liberty to check out some of the documents we have stored for the agency proper. Most of it is mundane bureaucratic stuff. Spreadsheets, pdfs, etc etc. But then there's the cool stuff. You hear about the way the CIA, NSA, and the DOD experimented with psychics? Yeah that hasn't stopped. There's a huge document that's got the name of anyone in the agency with matrilinial jewish ancestry. There's a video from what I think is somewhere in Afghanistan (?) around either sun-up or sun-down that shows the soldier confronting this guy who's in this really creepily lit apartment thing like IDK where it takes place but he's hunched into his knees in a corner and you can see the soldier reach a hand out, I guess he thinks the guy is drunk or mentally ill? I dunno, but he does look filthy and suspicious (like hiding in a cave for ten years filthy) and it lifts it's head up and the footage gets all glitchy and you can't see the guy through the heavy artifacts and corruption but you see the camera just drop and this guy's filthy feet (no more glitching, I think bc his head is out of sight again) and it's pretty fucking clear whoever this soldier was he's dead.\n\nThat isn't even a quarter of the shit I've seen either. Very little media, but PDFs will have screengrabs from videos sometimes. Also when I open some of the documents on my work from home machine I get this weird Atari-like glitching sound coming from my speakers occasionally. Like an atari explosion sound.",
				"added": 1566082049
			},
			{
				"comment_id": 14,
				"body": "Also my great grandpa was in the ahnenerbe, got swept up in operation paperclip, aaaaand apparently a lot of the people in my family (myself included) are psychics and witches.",
				"added": 1566082648
			},
			{
				"comment_id": 15,
				"body": "The nazis? Definitely had UFOs. Dunno how they work. Don't know anything else but that my great grandpa saw one (but wasn't supposed to). The Americans have them now thanks to Paperclip and complete luck regarding where the krauts stored the majority of them. The russians did have one, to the best of his knowledge, but no one knows if they still do because supposedly one of his contacts in Khabarovsk said that after the collapse of the soviet union the russian mobs had basically taken over everything and that the last they knew, one of the mobs had it. It's been MIA ever since.",
				"added": 1566083096
			},
			{
				"comment_id": 16,
				"body": "The working theory is Putin has it and that's his ace in the hole, but that's just speculation at this point. He knows America is run by Nazis (not Trump, I mean post-Paperclip boomers raised on old-school nazi teachings) but chances are equally likely some Ukranian billionaire has it sitting in a barn somewhere. Who really knows?",
				"added": 1566083384
			},
			{
				"comment_id": 17,
				"body": "Oh and it turns out the hebrew god? Capitol G? Yeah he's actually the devil which makes sense if you've ever read a word of the bibble or any abrahamic book. And Lucifer? Satan? Baphomet? Macroscale quantum mechanical beings. You call them angels. Turns out they're the good ones. Satan is rational. Understood that Y--H's influence on man was harmful for us so he made a wager with him but the guy was so hard for god he nearly cleaved his baby in half and Satan was banished for making H-m look bad. Lucifer? Refused to bow because he was right. We're not superior. He's a macroscale quantum being. And an extremely powerful one at that. He could turn you into a puff of hydrogen with pure willpower. And the reason Baphomet showed themselves to witches, mostly, was because we're typically well educated (communing with Lucifer and Caim has it's perks) and open minded to the truth.  Nowadays it's more mainstream to be satanist or luciferian or a thaumaturge because humanity as a whole is experiencing an awakening or rather a reawakening of things that were lost or hidden to us.\n\nAnd if you don't believe me, well. the bible says a woman's rapist can legally own her by paying her father two pieces of silver. Satan says fuck no rape is bad and you should be fucking imprisoned for doing it.",
				"added": 1566083882
			},
			{
				"comment_id": 18,
				"body": "Also there was a great flood, technically because Earth got ass-raped by a fuckton of comets. Atlantis and Mu were flooded because the comets hit the ice caps melting them and ending an ice age which resulted in a great flood myth throughout the world. Egyptian gods were refugees from Atlantis, Thule and Hy-Brasil (both of which are safe, now) and actually they were Thaumaturges. Potent ones at that. More like gods than the watered down stuff you see from our kind today.",
				"added": 1566084078
			},
			{
				"comment_id": 19,
				"body": "> [12345679](#comment_19_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): Where?\n\nhttps://en.wikipedia.org/wiki/LaVeyan_Satanism",
				"added": 1566084782
			},
			{
				"comment_id": 20,
				"body": "Although he's always been pretty rational about that. Witches were mostly women and tended to be pretty favorable towards the angel saying \"no rape!\" vs the guy preaching \"sell your raped daughters!\"",
				"added": 1566084857
			},
			{
				"comment_id": 21,
				"body": "Plus doing magic is cool as fuck.",
				"added": 1566084876
			},
			{
				"comment_id": 23,
				"body": "> [bigbadbob](#comment_317_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): what kinda magic tricks you know?\n\n127.0.0.1:43110/MyZlog.bit/post.html?id=62",
				"added": 1566086245
			},
			{
				"comment_id": 24,
				"body": "> [ntp](#comment_16_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD): Man, you are a cool person to talk to! Thanks for being around this net\n\nThanks homie",
				"added": 1566164156
			},
			{
				"comment_id": 28,
				"body": "> [a7eec](#comment_6_19nmLTEGX8iQPtCSwQ9TnSDVJRxCBgFpSy): Okay commie fag, putin is a shit leader that manages to lead the slavs into poverty\n\nFirst, you assume I'm communist. And when you assume you make an ass of yourself.\n\nSecond, I don't care about the slavs. They're not white, they're not true aryans, and honestly even if they were the vast majority are so low class we really don't want them.",
				"added": 1566170667
			},
			{
				"comment_id": 30,
				"body": "-> [a7eec](#comment_6_19nmLTEGX8iQPtCSwQ9TnSDVJRxCBgFpSy): Okay commie fag, putin is a shit leader that manages to lead the slavs into poverty\n\nNow stop being mentally subnormal and try to go about your day doing something productive for the master race. Or keep being a kike shill that actually cares about slavs. Either way, blocking.",
				"added": 1566171031
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 25,
				"body": "> [almostsoul](#comment_21_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): I was thinking about Seth Rich earlier today, and how sadly he died for nothing. The DNC leaks have affected absolutely nothing, and their party has not changed in the slightest even after the revelations. It's at least a lesson in the futility of political change.\n\nthat's what Uncle Fester's Home Workshop Explosives book is for",
				"added": 1566166570
			},
			{
				"comment_id": 33,
				"body": "> [crazylime](#comment_136_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): To my knowledge, the Seth story started with Kim Dot Com suggested he had conversations with Seth where Seth shared that he copied the files onto a flash drive and was trying to get them to wikileaks.  KDC tweeted about it as well, and offered to testify in the US.\n\nIt started when the news media reported he was mugged. Nobody took anything off his person and he was shot in the back. Mugging that ain't.",
				"added": 1566172661
			},
			{
				"comment_id": 45,
				"body": "> [undisclosed](#comment_55_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Be sure to add some magnesium powder (not the vitamin supplement) to your ingredient mix, unless you just want flash and smoke.\n\nBased on which of his recipes? ",
				"added": 1566232511
			},
			{
				"comment_id": 46,
				"body": "I'm not surprised. Probably some big gubbment thing.",
				"added": 1566253440
			}
		],
		"1566165386_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 26,
				"body": "weeb trash\n\nno I'm just fucking with you. Try archive.",
				"added": 1566166600
			}
		],
		"1566168798_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [],
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 31,
				"body": ">the international jews are not idiots\n\nHoly shit my sides",
				"added": 1566171085
			}
		],
		"1566159714_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 32,
				"body": "First, get off the amphetamines or take something for your mania.\n\nSecond, this isn't the 50s. If you're this much of a sperglord about communism I'd hate to be the people who have to put up with you once you learn about literally anything pertaining to the modern world.",
				"added": 1566172504
			}
		],
		"1566178418_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 34,
				"body": "> [bigbadbob](#comment_347_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Do you see shadow people at night? Are you dead? Do they gangstalk you?\n\nNah I just think it's weird lol\n\nActually, I don't think in the 14+ years I've been leaving my body I've ever seen another person or entity who could see me. Althouuuugh a neighbor's kid said his little brother saw me the other night. I told him I usually walk around at night (not untrue) and he said his brother saw me walking through a wall. ",
				"added": 1566179722
			},
			{
				"comment_id": 35,
				"body": "Did see a gnome once tho! It was funny because it wasn't wearing a hat or anything (actually, it was more like a knobby, creepy little man with a disproportionately large dick) but it was funny watching it waddle across the street.",
				"added": 1566179940
			},
			{
				"comment_id": 38,
				"body": "Mostly to just kill time. I feel just as rested if I'm dreaming as if I don't dream and sit up without my body.",
				"added": 1566180682
			},
			{
				"comment_id": 39,
				"body": "> [bigbadbob](#comment_351_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): should get more creative and really have fun with it\n\nI mean other than listen in on private conversations or watch people watch tv / fuck / sleep there's not much to do. I can't physically move anything or interact with shit. Talking to anyone is just wasting breath, trust me, I thought I had died and become a ghost the first time it happened.",
				"added": 1566184490
			},
			{
				"comment_id": 40,
				"body": "Also it's not like Stranger Things. I can't just be anywhere, it seems to be tethered to wherever I lie down at. But the good news is there doesn't seem to be a limit distance or time wise. ",
				"added": 1566184903
			},
			{
				"comment_id": 41,
				"body": "> [bigbadbob](#comment_353_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): What kind of drugs do you do... sounds pretty far out\n\nIt's just how my brain is man. I feel really good like my brain is swelling and then it's like sitting up but I can see myself if I turn around.",
				"added": 1566189118
			},
			{
				"comment_id": 42,
				"body": "I think the closest thing I could describe it to as far as how it feels is being in a float tank. It's like there's nothing but me and everything around me. This weird state of zen. And everyone's kinda echo-ey and there's this blue white haze to everything and you just float there and will yourself into movement. It's so fucking beautiful.",
				"added": 1566189335
			},
			{
				"comment_id": 43,
				"body": "> [bigbadbob](#comment_354_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Im not one to deny someones own experience.  I certainly cannot do any of that.  So long as you are enjoying yourself:)\n\nI appreciate that homie. Hopefully MRIs become less expensive so I can prove *something* is going on. Ideally what I wanna do is have a locked room, myself in an MRI in the room adjacent to the locked room, and in the locked room a computer with a random number gen, a random shape gen, and a random simple picture gen. And an independent 3rd party to verify no funny business. The MRI would likely show a change in conscious activity once I leave my body and then once I read what's in the locked room from outside my body I end the OBE and tell the independent 3rd party what I saw. Then they unlock the room and verify that I'm correct and hopefully that proves *something* spoopy is happening.",
				"added": 1566232369
			},
			{
				"comment_id": 44,
				"body": "> [aspidochelone](#comment_107_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Testing... OK something is odd here.  I posted this shaggy dog story about parallel universes, electrostatic propulsion, and transdimensional organizations here a short time ago.  I thought it posted normally.  Now I don't see it here or on the ZeroTalk index.  I found it in my folder as Comment #106, added 1566188048 - I backed up a copy to see if it disappears, but so far it's still there anyway.  Why doesn't it show up?\n\nIs your internet on the fritz?",
				"added": 1566232395
			}
		],
		"1566171789_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 36,
				"body": "> [bigbadbob](#comment_345_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): But how is that metal?  I can only imagine if a metal band actually played for isis... they would firebomb the stage.  That is if they existed.\n\nTHAT'S EVEN MORE METAL!",
				"added": 1566180061
			},
			{
				"comment_id": 37,
				"body": "> [bigbadbob](#comment_349_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): yea...  i guess ur right lol.   But i bet they listen to some weird music that does not resemble metal.\n\nWhatever it is I imagine it sounds like the bar in star wars",
				"added": 1566180552
			}
		],
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 47,
				"body": "With a good teacher school can be a gateway drug to curiousity. My science teachers were the bomb and my math teachers were the reason I always finished the book early.\n\nIf someone you know is like \"why bother?\" about math, my old Algebra I teacher runs the yt channel Fort Bend Tutoring. You should check him out and get those arrows popping!",
				"added": 1566323626
			}
		],
		"1566400778_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 48,
				"body": "My good man I am an equal opportunity serial killer",
				"added": 1566412727
			}
		],
		"1566424243_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 49,
				"body": "Best time? Any time.\n\nFavorite time? That's subjective as fuck my guy.\n\nMine is for sure right after I wake up. Sleep refreshed my receptors just for me to ass blast them with that sticky icky herb.",
				"added": 1566429314
			}
		],
		"1566472754_1CAq9Lor26iBmSMSQpXiBJUL6b6Y5WU8UA": [],
		"1566524350_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 52,
				"body": "Oh for sure. I found this mutated fungus that was so profoundly bright by comparison to the others around it and another time a white lizard that I wanted to breed",
				"added": 1566527914
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 53,
				"body": "Religion is hella gay. Suck dick, smoke weed, and hail Satan bitches.",
				"added": 1566580105
			},
			{
				"comment_id": 57,
				"body": "> [kaffie](#comment_1070_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): That's actually capitalism. [...]\n\nWhat's more he assumes the other two siblings aren't working. I love capitalism personally but even I know that socialism is the way to go.",
				"added": 1566600837
			},
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_856_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): there is no fondamental proof, all that is a scam or a cargo cult, the ancient civilisation destroyed who knows how the last hundred years, left the architecture we have worlwide; this one is there to harvest energy. people don't get the whole picture. these people were way way way brighter than we are. and as i said decades and decades ago sacred manuals are the so called religious books. people just don't get anything sometimes i feel like an alien in this world not getting anything, not understanding anything.\n\nNah man, Enki is real and he tried to succ my nutt sticc",
				"added": 1566601178
			},
			{
				"comment_id": 59,
				"body": "That's the beauty of it. We get to learn what they knew. To rediscover lost knowledge.",
				"added": 1566602663
			},
			{
				"comment_id": 156,
				"body": "Hail Satan!",
				"added": 1568138466
			}
		],
		"1566566417_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 54,
				"body": "Yeah that was a huge problem for me when I was vacationing in the antarctic empire. I thought I was gonna get away from the summer heat but boy did I get more winter than I bargained for :D",
				"added": 1566580394
			}
		],
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 55,
				"body": "> [littlepaw](#comment_21_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): I'm going to spend the weekend out of town with a good friend swimming, biking and getting high ^ω^\n\nMy man!",
				"added": 1566596861
			},
			{
				"comment_id": 56,
				"body": "> [goyim](#comment_5_155YW8Qn715edvfqPMrsPscUHqut4JCphb): I can't recall the last time I was happy\n\nIt gets better man. Are you seeing a doctor about it?",
				"added": 1566596901
			},
			{
				"comment_id": 62,
				"body": "> [fuckthegov](#comment_4_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG): when your kids tell you to watch Tom and Jerry and Road Runner with them and you simply cannot say no :D\n\nFuck yeah man!",
				"added": 1566925428
			},
			{
				"comment_id": 63,
				"body": "> [myriri](#comment_52_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): I am not happy.\n\nAww man, you good now tho?",
				"added": 1566925440
			},
			{
				"comment_id": 64,
				"body": "> [holeyhouseofair](#comment_71_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): I've stopped coveting women and found it really liberating, the craving to masturbate has subsided and I am enjoying life a lot more.\n\nFuck yeah! I wouldn't refer to it as coveting but I'm glad you're happier not rubbing one out :D",
				"added": 1566925473
			}
		],
		"1566920820_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 60,
				"body": "Kowalski, analysis.",
				"added": 1566925138
			}
		],
		"1566634528_1JaHtdmFGhdNVCzJquH7hFpsKbF7cffYpp": [
			{
				"comment_id": 61,
				"body": "> [rtea](#comment_7_16mjGDQRQUf6K53LZCeSu87NzxUC5R1n1N): Gyms are simply efficient ways of exercising.\n\nThis. OP just sounds bitter. Exercise how you want, OP, but never bash others for getting fit and bettering themselves. We need to work together, fool.",
				"added": 1566925345
			}
		],
		"1566892977_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 65,
				"body": "Don't piss (((them))) off bro.",
				"added": 1566925513
			},
			{
				"comment_id": 66,
				"body": "Also look up Uncle Fester's book: Homemade Explosives Workshop. \nOr if you'd rather not go after the juden making the laws that fuck my ancestral homelands over and would rather poison the muzzies directly, try: Silent Death",
				"added": 1566925616
			}
		],
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 67,
				"body": "> [randomshits](#comment_61_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Reply\n\n\nThanks homie. Figured it out right as you posted it lol",
				"added": 1566926314
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 68,
				"body": ">using windows\nXD",
				"added": 1567003418
			}
		],
		"1567001589_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 69,
				"body": "Fun! Look up Uncle Fester's Homemade Explosives Workshop! He also has other books on poisons, cop killing bullets, and more :D",
				"added": 1567003480
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 70,
				"body": "Look, I think the flood of 8chan refugees was a bad thing but in all honesty someone needs to track that journalist down, drag his ass to the middle of the desert, drug him with a fuckton of acid, and ass-rape him for a couple days before abandoning him Crowley-style.",
				"added": 1567003593
			}
		],
		"1566887761_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 71,
				"body": "> [nekololi](#comment_383_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i took the lords name in vain a few times and then had some sinful thoughts.\n\nThat's the spirit!",
				"added": 1567019849
			}
		],
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 72,
				"body": "Who cares? Brown people be killing brown people. It's nothing new.",
				"added": 1567284783
			},
			{
				"comment_id": 76,
				"body": "> [aspidochelone](#comment_163_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Sigh... this is why I get crap about how being anti-Islamic is \"bigotry\". [...]\n\nOr Satanism, which is pretty anti-rape.",
				"added": 1567290147
			},
			{
				"comment_id": 77,
				"body": "But being anti-islam isn't bigotry the way being anti-zionist isn't anti-jew. It's all a part of a plan to normalize brown people raping your innocent little girls. HOW DARE YOU CRITICIZE THE DECISION OF THE COURT TO RELEASE THE MEN WHO RAPED YOUR NIECE? Oh, you're gonna try to deck them for it? Now YOU go to jail, whitey! Bigot! How dare you criticize their Allah-given right to rape a child. After all, why did she not wear her burka? They were enriching her culturally, obviously.",
				"added": 1567290292
			}
		],
		"1567289433_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 78,
				"body": "What the fuck kind of cult ass term is \"glownigger\"?",
				"added": 1567297632
			},
			{
				"comment_id": 79,
				"body": "> [ratsmack](#comment_50_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): It's a chan thing... it came from a statement that Terry A Davis made about the CIA. He had severe schizophrenia and would ramble on about the CIA spooks being \"glow in the dark niggers\".\n\nThe Temple OS guy?",
				"added": 1567300064
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 80,
				"body": "I bet you're the kind of person who likes to brag about all the sex you don't get.",
				"added": 1567306961
			}
		],
		"1567352662_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 81,
				"body": "Works",
				"added": 1567374426
			},
			{
				"comment_id": 90,
				"body": "> [alternedleanings](#comment_2_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): I wonder why i'm unable to access. would you kindly provide the onion link?\n\nI haz no onions",
				"added": 1567448541
			}
		],
		"1567374583_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 82,
				"body": "> [bigbadbob](#comment_515_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): contact cement?\n\nOnly if I hold on to something heavy",
				"added": 1567375484
			},
			{
				"comment_id": 83,
				"body": "How do you contact cement?",
				"added": 1567380617
			},
			{
				"comment_id": 84,
				"body": "Does it have a phone number?",
				"added": 1567380632
			},
			{
				"comment_id": 85,
				"body": "> [bigbadbob](#comment_518_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): yes it does.  There are a few ways to contact cement but im not convinced you are seriously interested in doing so.cement is very serious.\n\nI'm ALL ABOUT serious my dude",
				"added": 1567391573
			},
			{
				"comment_id": 86,
				"body": "Serious XM. Serious the star. You name it.",
				"added": 1567391600
			}
		],
		"1567221625_1BZPUaxGQ5E3ubsMW5tCDrhXYVM5MNkrEj": [
			{
				"comment_id": 87,
				"body": "I consider myself pretty chill",
				"added": 1567393570
			}
		],
		"1567260460_16DbWkBAVbyCmc5wcwQLAQ1rGELh6X7y6P": [
			{
				"comment_id": 88,
				"body": "Fool. Expending sexual energy impedes the thaumaturge from performing at his or her peak.",
				"added": 1567393637
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 89,
				"body": "I mean obviously it has to but chances are they don't give a shit about us. I mean look at our species, man. We can't even get along.",
				"added": 1567414755
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 91,
				"body": "False reporting ftw",
				"added": 1567457720
			},
			{
				"comment_id": 92,
				"body": "Use it to spy on the police\nlet the public see the abuse",
				"added": 1567530791
			}
		],
		"1567523795_1LceLY5i4tVUVtPn9ZQGRbr5W75LjfchfN": [
			{
				"comment_id": 93,
				"body": "what",
				"added": 1567530810
			}
		],
		"1567541468_1FgxurbLKzsfP2arYX7xVG4akjCdMs3uEQ": [
			{
				"comment_id": 96,
				"body": "> [suitandtie](#comment_4_1FgxurbLKzsfP2arYX7xVG4akjCdMs3uEQ): Trust me, this or selling drugs. So i stick with smaller crime. As i just unlocking them.\n\nThen sell drugs you low-class piece of shit.  I don't agree with the mudslimes normally but damn do they do good work lobbing off the hands of problems like you.",
				"added": 1567549816
			}
		],
		"1567536043_15yACUjRkanC9AeFyo7RQSBiZLWmmNvddW": [
			{
				"comment_id": 95,
				"body": "Great! Gave my niece a piggyback ride and played Switch with her <3",
				"added": 1567549734
			}
		],
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 97,
				"body": "Voat",
				"added": 1567570741
			},
			{
				"comment_id": 98,
				"body": "If you want I can make a board for /pol/ or /altright/ on my i2p imageboard/chan",
				"added": 1567570768
			},
			{
				"comment_id": 99,
				"body": "My only rule is no CP.",
				"added": 1567570780
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 101,
				"body": "Look man, I'm not gonna tell you it's selfish because it isn't. Your life belongs to you. Whether or not you want to cut suffering short you have the right if not the privilege. I did it successfully four years ago. I saw heaven. Dead for ten minutes, there for several months. Some people say it's a DMT dream and I think that might be true too. A way to get closure. To have the time to accept death. It's nice but the funny thing is? Coming back I don't wanna die anymore. Did for a while but I found a reason to live and the right combo of meds to take the depression away. But I get how it seems hopeless. I get wanting to turn the pain and suffering and misery and boredom off. I get it. A world of idiots is a shitty world. I won't say I hope you do it because I don't. Instead I hope you find an option that ends the suffering - whether it's medication and therapy or the business end of a .12 gague. Nobody should suffer if they have the means and the will to fight on. Good luck, brother.",
				"added": 1567916323
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 103,
				"body": "Did Larry King die? Das Juden take care of their own.",
				"added": 1567916653
			}
		],
		"1567878918_114mSgWDZpRknb492fpx91DL6jSNgRRXba": [],
		"1567919694_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 112,
				"body": "> [redlibertyreal](#comment_14_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Pretty sure they have markets for that stuff in onionland.\n\nI require reliable and ongoing bulk supply.",
				"added": 1567920153
			},
			{
				"comment_id": 113,
				"body": "If onionland can meet these requirements, please direct message my tox with the appropriate address/addresses.",
				"added": 1567920173
			},
			{
				"comment_id": 114,
				"body": "> [redlibertyreal](#comment_15_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Was going to drop a link but your ZeroMe says \" I have to risk everything for her. I don't care how many bodies it takes. Without ethical violations there would be no modern medicine.\" [...]\n\nI've been doing genetic treatments on mice. I'm trying to cure her. I don't want her to die.",
				"added": 1567923097
			},
			{
				"comment_id": 115,
				"body": "And it's ok. I found markets before in my youth. The fact that you still recommend them implies they're still there. I can take it from here.",
				"added": 1567923143
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 116,
				"body": "I have talked my way out of it in the past. Although coming from money and having a good legal team does wonders.",
				"added": 1567964222
			},
			{
				"comment_id": 142,
				"body": "> [alternedleanings](#comment_5_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): When the law is bullshit, There is every reason to ignore it.\n\nHear hear!",
				"added": 1568053904
			}
		],
		"1567851023_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 117,
				"body": "Dumb. Everyone knows sudoku is the inferior suicide method when compared to driving off the grand canyon in a rented convertable with a bottle of jack in one hand and a joint in the other. You're blasting Kid Rock and right as you go over the edge the fireworks spring out the trunk. 'Murrica.",
				"added": 1567964337
			}
		],
		"1567724707_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 118,
				"body": "You guys are dumb. Nazis. Commies. Why would you be either when Rasputin was the dopest motherfucker out there. In a world of little hitlers and mini stalins be a Rasputin.",
				"added": 1567964673
			},
			{
				"comment_id": 122,
				"body": "> [memesadler](#comment_118_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Vermin Supreme for president. [...]\n\nSolidarity? How fucking dare you, you racist! You should be castrated so you can't contribute to the glorious zionist agenda! You should be executed, goyim!",
				"added": 1567990223
			},
			{
				"comment_id": 123,
				"body": "No but FR Vermin Supreme all the way.",
				"added": 1567990234
			},
			{
				"comment_id": 124,
				"body": "Anyone is better than that kike-loving embarrassment in office right now. I mean you think Trump is your guy but he's got Kushner cucking him and he's sucking that fucking slav Putin's cock hard enough that even Israel made him their bitch when he put the embassy there. Fuck Trump I hope he gets aids raped.",
				"added": 1567990338
			},
			{
				"comment_id": 125,
				"body": "My great grandpa would have taken one look at Trump and sent him off to the showers in a red cross truck for being so mentally subnormal.",
				"added": 1567990447
			},
			{
				"comment_id": 126,
				"body": "> [redlibertyreal](#comment_16_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Is everyone an anti-semite on here? God damn it\n\nI have my reasons. I used to have jewish \"friends\". I learned fast they're ALL self-obsessed, hypocritical, rapists hiding their toxicity behind a smokescreen of drugs and lies. My great grandpa was right. They are cancer. Just like the gypsies.",
				"added": 1567992757
			},
			{
				"comment_id": 127,
				"body": "You know this gyppo cunt was begging for change. She had her kid with her. I felt for them. I offered them all the  change I had plus the ten bucks I carry in my sock at any given time. You know what she said? \"Is that it? Can't you get more?\" Now I tried to hold my tongue because she had a child. I apologized and further offered a job to her. Even reduced cost child care (ten a day for anyone who needs it. It takes a villaige and I care about kids) You know what she said? \"No. Can you go to the bank? It's right there. Why are you here? Go get more.\"  So I just laughed and walked away from her.\n\nEdit: I also let her keep the money but only because if she really was homeless then her kid needs help. But if it were up to me that kid would go to someone who wants a job. Who wants to be a decent human being. The problem isn't race it's low class. You can overcome your racial handicap if you commit to contributing to our great society. To bettering it. You may not believe me but the majority of my political views are quite socialist. I do have my convictions on right wing issues as well and I will be holding to them until I am certain that enough evidence is present to seek an alternative point of view. But as it stands, the two decent black people in my life also have class, education, and a desire to do better every day. In the perfect world, they would stand among the aristocracy as credits to their race. Something to aspire to. But I doubt it would make a difference.",
				"added": 1567992922
			},
			{
				"comment_id": 128,
				"body": "Oh and this gaggle of low-class niggers. My favorite. They catcalled my friend. SHe's tiny and there were several of them approaching her. I gave them the finger and told them to fuck off she's not interested. One of them approached the car. He threw open the door. And like a coward, Like a pussy ass bitch. He saw my knife and the look on my face that just screamed \"Give me a fucking reason to carve you up good\" and then he walked away. Oh and he did it with that \"man it's not fucking worth it\" like have some balls you dumb ape. You had the conviction to defend you and your fellow spearchuckers' actions when y'all were being misogynistic pigs. But what, you see a knife and suddenly you decide \"it's not worth it\". Fuck. You. Coward. \n\nIf we ever meet again I hope it escalates. I hope he punches me so that I can take my knives and feel that fucking orgasmic feeling of lacerating and perforating his body before slitting his throat.",
				"added": 1567993238
			},
			{
				"comment_id": 129,
				"body": "@redlibertyreal\nStereotypes exist for a reason, friend.",
				"added": 1567993284
			},
			{
				"comment_id": 130,
				"body": "And don't think it's just jews and brown people. I have an issue with low class white people too. You are the master race how fucking dare you abuse methamphetamine, benzodiazepines, and opiates. How dare you not set an example for your children. How dare you deny the climate change that is ruining the world our children will inherit. You are just as bad as every example I have given and there is no excuse. Get better or expect the Fifth Reich to cleanse you as well. White trash is still trash and like all trash it'll be tossed into a pile before being shoveled into an incinerator.",
				"added": 1567993970
			},
			{
				"comment_id": 131,
				"body": "It honestly disgusts me to see the sorry fucking state of this world and it's inhabitants. Being human used to be a point of pride. A way to look upon our towering skyscrapers and show our beaming, starry-eyed youth that we saw the mountains of the gods and raised them gleaming spires. Extraordinary feats of innovation and design - but so much more. Of cooperation. Unity. Harmony between brothers as equals working for the benefit and betterment of every man. To lift those of low class out of the toxicity inherent to their socioeconomic position and be as equals. Educated, mindful, aesthetically pleasing, and capable of taking humanity far beyond the future we are already living in.",
				"added": 1567994250
			},
			{
				"comment_id": 132,
				"body": "@redlibertyreal: truth be told, it's why I admire you. Your commitment to the idea of socialism and communism? That dream of a utopia where we're all proud of what small role we play and how it collectively adds up to a better world. I wish instead of catcalling those men would have instead focused on work. To remember that in paving these streets and improving this infrastructure they're helping the city as a whole to both improve traffic flow and thus reduce stress as well as to prevent future lives from being ruined/made more difficult by natural disasters. Fuck, just typing that makes me wanna go out there and help them do their job. Not even for compensation. Fuck that 10 an hour. I just want to pitch in so it gets done faster. THAT'S the attitude they should have had. Not \"oh look there's someone who we can make visibly uncomfortable with toxic masculinity\".",
				"added": 1567994654
			}
		],
		"1567744014_12JZvHCxC5hToab5bzTvA8pdTYJTP21QGU": [
			{
				"comment_id": 119,
				"body": "Hey man. I'm nowhere near as old but I'm happy to talk. I think the PC term these days is Hemovore but for all I know it's changed. I'll HYU.",
				"added": 1567989892
			},
			{
				"comment_id": 120,
				"body": "> [brahman](#comment_15_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb): I always thought vampires doesnt exists...\n\nI mean humanity has been saying otherwise for thousands of years but no yeah",
				"added": 1567989940
			},
			{
				"comment_id": 121,
				"body": "Here, message me @ CC600FD102F8EA55E0AC69645639CF0D262D403BA796FD9A2C18A2D96E94060E16A51D31EA35 and I'll send you the deets for a couple group chats.",
				"added": 1567990097
			}
		],
		"1567995549_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 133,
				"body": "> [12345679](#comment_27_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): literally who?\n\nhuh?",
				"added": 1568000965
			}
		],
		"1568002955_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 134,
				"body": "I actually do take LSD quite regularly. I even get test kits to go with it.",
				"added": 1568042372
			},
			{
				"comment_id": 143,
				"body": "> [reichardnixon](#comment_9_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Hi Im Joe Rogan and if you havent done DMT you should because MAN IM SO SMART CUZ IVE DONE DMT. DMT equals world peace everyone!  Do drugs it makes you smart like ME JOE ROGAN. CUZ IM SMART AND INTELLECTUAL because of all the DMT and PSYCHEDELICS.\n\nwhy you so salty tho?",
				"added": 1568059924
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 135,
				"body": "> [xcape2net](#comment_372_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): That's an idea, but there are a lot of idiots to block.  And, I sort of have a problem limiting free speech on a platform that is designed not to limit free speech.  Maybe I should get over that.  I'm also afraid that I might block people like Kidcourageous for one of his many obnoxious comments and miss all of his other good comments.\n\nYou can't make an omelette without breaking a few eggs. I appreciate any feedback on what's obnoxious because really I'm just trying to be a better shitposter here guys",
				"added": 1568042497
			},
			{
				"comment_id": 136,
				"body": "> [ratsmack](#comment_59_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): I have a problem with people looking for a safe space. This is life... deal with it.\n\nYou must have many friends.",
				"added": 1568042768
			}
		],
		"1567999355_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 137,
				"body": "I do this every now and again. Especially with my nieces. Like they're always screaming \"kill it! Squish it!\" and I'm just like \"it's a bug it doesn't know better\" and cup it in my hands. Like worst case scenario it stings me and I'm uncomfortable for an hour or two. Best case it remembers my kindness and I become it's new master. Just me and my army of saved insects fighting crime and shit",
				"added": 1568044269
			}
		],
		"1567965844_1DBk3rE3epbvNVqNzqknuBm5w7hNTehxhv": [
			{
				"comment_id": 138,
				"body": "Sucks man. Have you tried talking to her about it? Like explaining it was an accident? Sometimes all you can do is just let her work through it man.",
				"added": 1568044540
			}
		],
		"1568049053_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 139,
				"body": "Found the incel!",
				"added": 1568049398
			},
			{
				"comment_id": 141,
				"body": "Porn and sex work make girls money. That's why you're bitter. I've appeared in a number of films with friends and we fuck all the time. You're just upset because you're a shit person and people don't wanna put out for people like you.",
				"added": 1568053849
			},
			{
				"comment_id": 148,
				"body": "> [atomiserxenolith](#comment_128_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): How would you 'assault the porn industry'?\n\n>implying anyone could even get close",
				"added": 1568072137
			},
			{
				"comment_id": 199,
				"body": "> [moodswing](#comment_3_1F8RgqojbeyvDmM4m2U1ALv6vvMSA4LsSF): Wow, you care so much about women that you'd like them to get used up and thrown in trash. I guess you'd do the same to your daughter too? You're fucking trash.\n\noh no some incel called me trash what am I gonna do?",
				"added": 1568304683
			}
		],
		"1568044815_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 140,
				"body": "> [styromaniac@kxoid.bit](#comment_168_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): A momma red fox and her litter crossing the road in front of my car.\n\nOMFG that's literally so adorable! Did you give them cute names? Like Star Fox, Hot Rod, Benny G, and \"The Tank\"?",
				"added": 1568049607
			}
		],
		"1568062329_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 144,
				"body": "Why do you have such a hard-on for hate?",
				"added": 1568063062
			},
			{
				"comment_id": 145,
				"body": "It's so cringy. Like when anons make personal army posts.",
				"added": 1568063352
			},
			{
				"comment_id": 149,
				"body": "> [alternedleanings](#comment_10_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): How does this work? What if it's your enemies that are defining \"hate\"? How do you win then?\n\nBy ignoring it. Who says their definition is any more valid? If you don't care what people think you always win.",
				"added": 1568076370
			}
		],
		"1568044121_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 146,
				"body": "I actually haven't seen that but I'll check it out! I love nature stuff and slime mold so that sounds cool AF",
				"added": 1568066072
			}
		],
		"1568042910_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 147,
				"body": "> [styromaniac@kxoid.bit](#comment_170_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Are you going to put instructions anywhere?\n\ntl;dr instructions:\n\nSign up for test flight, download ish (it's an alpine distro (CLI only) for ios) and clone the zeronet git. Then run the ZeroNet.sh thingy. You should be able to open safari / your browser of choice and navigate to 127.0.0.1:43110/",
				"added": 1568067694
			},
			{
				"comment_id": 152,
				"body": "> [subs](#comment_1_18UpBFob1JoJhLuQgA4Z4pmvHXm3PMAEqR): It looks like iSh is emulating x86, which has got to be horribly inefficient. I don't see a way of it running without horrible battery drain.\n\nYeah that's why I was a little reluctant to post a guide. It's also not fully functional but like if you just need an emergency way to access a zeronet site and all you have is an iphone (and all the zeronet proxies are down) I guess this works?",
				"added": 1568093191
			},
			{
				"comment_id": 155,
				"body": "> [gitcenter](#comment_975_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You're missing the fact that Python can't run on iOS [natively], mostly due to Apple guidelines.\n\nIt does if you jb",
				"added": 1568134162
			},
			{
				"comment_id": 158,
				"body": "> [alexu](#comment_1_1Ai5o3Y7Lpn5VZt9thmATzMwqYa1D4qRam): What about Android?\n\nIIRC, D14NA does a good app for Android. \nCheck out: \nhttps://zeronetexplorer.com/",
				"added": 1568149894
			},
			{
				"comment_id": 159,
				"body": "Oh wow it has an IOS version XD",
				"added": 1568149928
			}
		],
		"1567601358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 150,
				"body": "Voat is really taking it's time loading lately. So is ED",
				"added": 1568081645
			}
		],
		"1568042578_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 153,
				"body": "> [robione](#comment_301_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): No, but, there's likely more assholes than that considering androgynous and combined function orifices.\n\nLike a cloaca? I'm totally down to smash some space cloaca",
				"added": 1568115407
			},
			{
				"comment_id": 160,
				"body": "> [trotski](#comment_17_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): If we ever discover intelligent life that is peaceful, the very next thing we NEED to know is how they fuck and how we can participate\n\nHear hear!",
				"added": 1568219842
			},
			{
				"comment_id": 161,
				"body": "> [bigbadbob](#comment_646_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Nope, that thought has never crossed my mind.  The closet thing would be looking up at the stars while balls deep in an illegal alien. ;)\n\nMan that's the shit I live for. Just balls deep in a smuggled-in Croatian broad while high on Peyote out in the Mojave",
				"added": 1568219888
			},
			{
				"comment_id": 164,
				"body": "> [dtek](#comment_22_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ): humans are truly the most degenerate of species in the universe.\n\n>Unironically using the word degenerate\n\nI bet you're \"saving yourself\" you fucking virgin XD",
				"added": 1568220250
			},
			{
				"comment_id": 174,
				"body": "> [bigbadbob](#comment_676_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Naw, was just an American sloot up on vacation.  Not exactly illegal.. i don't think.  She liked the band I was in and wanted to \"go to the beach\".  It was funny at the time cause I was fairly uninterested. I kept running into her and would ditch just to run into her at another establishment. happened like three times and she was latched on by the end and wanted to go skinny dipping.  fuck it.. so I did.  She was hard to shake.  looking back she was not bad but acted like a fool.\n\nYeah American women are way too horny. I think it's all the estrogen in the water. Like, nobody expected that side effect we just wanted more gay frogs",
				"added": 1568229256
			},
			{
				"comment_id": 178,
				"body": "> [bigbadbob](#comment_677_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): They were much friendlier than Canadian women i must say.  San Fran was a lot of fun for me back then... Im not sure why, but i got lots of female attention. Maybe a straight guy was in high demand, i don't know,  It was extraordinary.sureal\n\nNah it's always been that way across the world. Much as people might clutch their pearls it's a fact that humans like to fuck. We're basically bonobos with big brains and bigger tits.",
				"added": 1568230774
			},
			{
				"comment_id": 180,
				"body": "> [aspidochelone](#comment_178_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): There are a lot of different Earth species that have independently evolved \"intromittent organs\", so your odds of finding a hole in space are better than average.  The situation for women is trickier because so many Earth species have spines and other nastiness adorning their flagstaffs.\n\nHumans are designed to fuck. It's what we do. And it's the one thing I admire about china - they just fuck until they have enough bodies to toss at a problem",
				"added": 1568234046
			},
			{
				"comment_id": 203,
				"body": "> [bigbadbob](#comment_685_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): What if alien space pussy had sharp teeth?\n\nIf it means being the first person to beat them alien cheeks I'll happily sacrifice my schlong",
				"added": 1568307452
			}
		],
		"1568112876_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 154,
				"body": "You can't talk about brain-rotting crap without mentioning Maury",
				"added": 1568116734
			}
		],
		"1568139498_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 157,
				"body": "Sucks to be them",
				"added": 1568139551
			},
			{
				"comment_id": 196,
				"body": "Streisand effect is real y'all\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1568251133_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
				"added": 1568250113
			}
		],
		"1568204751_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 162,
				"body": "Only if they consent. Otherwise it's just fucked up",
				"added": 1568219961
			},
			{
				"comment_id": 163,
				"body": "Like there was this one girl I fucked who used to love getting her giant ass tits beaten and she used to brag about the bruises I'd leave on her jaw. She was a fucking freak lol",
				"added": 1568220024
			},
			{
				"comment_id": 193,
				"body": "> [almostsoul](#comment_24_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): You watch pornography, that's why.\n\nAnd what do you suggest OP jerk it to? An extra curvy piece of driftwood?",
				"added": 1568238693
			}
		],
		"1568220374_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 165,
				"body": "Listen to youtube works so it might just be your plugin",
				"added": 1568220435
			},
			{
				"comment_id": 166,
				"body": "> [randomshits](#comment_99_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It's not a pluginhttps://github.com/ytdl-org/youtube-dl/ [...]\n\nI'll try installing it now and see what's good\n\nWorst case scenario you can always use a screen-recorder and just select that area of the screen  + the audio stream",
				"added": 1568220607
			}
		],
		"1568221970_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 167,
				"body": "> [katian](#comment_41_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx): today I meditated, I felt peace\n\nHell yeah!",
				"added": 1568222332
			},
			{
				"comment_id": 168,
				"body": "> [bigbadbob](#comment_667_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): duende told me to \"kys\" :D\n\nYou aren't officially a 0Net user until Duende tells you to kys XD",
				"added": 1568222474
			},
			{
				"comment_id": 169,
				"body": "It's like a fucked up welcome wagon lol",
				"added": 1568222495
			},
			{
				"comment_id": 170,
				"body": "> [pexo](#comment_150_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I don't think he told me to kill myself, yet :. (\n\nWhat? Outrageous! I expect better from him! lol",
				"added": 1568228214
			}
		],
		"1567252251_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": [
			{
				"comment_id": 173,
				"body": "I muted h3 a long time ago lmao",
				"added": 1568229076
			},
			{
				"comment_id": 201,
				"body": "> [bigbadbob](#comment_681_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): That's too bad.  He wrote something hilarious in one of your threads.\n\nAwwhe. How do I unblock?",
				"added": 1568306930
			},
			{
				"comment_id": 205,
				"body": "> [bigbadbob](#comment_686_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): configuration,  actually right above it\n\nIll do it later. I'm gonna go bring my niecey some surprise mcdonalds for lunch <3",
				"added": 1568307972
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 175,
				"body": "The only place someone should be shooting is inside. Or on some fat tits.",
				"added": 1568229384
			}
		],
		"1567889398_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 176,
				"body": "The best defense is to have all five Exodia in your deck.",
				"added": 1568229535
			},
			{
				"comment_id": 179,
				"body": "> [bigbadbob](#comment_678_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): had to research that... looks promising.\n\nThose killbots won't know what hit them. #SendThemToTheShadowRealm",
				"added": 1568232011
			}
		],
		"1568146233_1GPkUgE87GmWs35PmsUKA9CUFW8L8SMTX5": [
			{
				"comment_id": 177,
				"body": "u guys I just found the biggest security flaw in linux! If u run sudo rm -rf / it nukes ur system with a virus!!",
				"added": 1568230066
			}
		],
		"1568224054_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 181,
				"body": "> [aspidochelone](#comment_180_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Got me to look at a more interesting news story though: https://observer.com/2001/04/at-skull-and-bones-bushs-secret-club-initiates-ream-gore-2/  Ancient times.  These \"observers\" would be in Guantanamo Bay if they tried that kind of radical sousveillance today. [...]\n\nSee that's why shame is overrated. I'd just be like you can't blackmail me! I'm *proud* of the cumcoffin! Hell I'll do it again and I don't even have to! Like and if it's so embarrassing that it's blackmail material than doesn't that make y'all equally gay for cumming on the coffin with me?",
				"added": 1568234149
			},
			{
				"comment_id": 182,
				"body": "The way I see it, the cum coffin should be a reward. Not a requirement.",
				"added": 1568234174
			},
			{
				"comment_id": 183,
				"body": "And what, if it just sexual history then so what? I say ramp it up. Brag about it. What are you ashamed you fucked dubya in the ass? Well then that's your fault for being a conservative gay bashing politician. Just own up to it, Pence. Say you sucked Bush off. Honestly I'd be more likely to vote for Trump if they did just come clean about how much boy pussy he's sprayed with his dick frosting. Like we all saw the video of you getting pissed on. Just own it, man. Be like \"Yeah I got a porn star to pee on me. That's just how much of an hombre I am.\" But instead he's all \"Fake news\" like bitch stfu we all know you're a freak. Own that shit and nobody has dick on you.",
				"added": 1568234503
			},
			{
				"comment_id": 184,
				"body": "Look, man, if you're a republican politician you should just come clean. We all know you like to go to motel rooms with some tight twink hoes and make them sign NDAs so you can keep pushing gay conversion therapy so nobody suspects you're an undercover queer. And what happens? They get blackmailed. Like just stop being ashamed of it man. Own your sexuality like a fucking man.",
				"added": 1568234706
			},
			{
				"comment_id": 185,
				"body": "Hell if it were up to me I'd make it a contest. Like Ninja Warrior but for ass sex. Heeere's John Kerry back on the competition for the fourth year running. He's taken five dicks up his ass at once now let's watch him go for six! It'd be so dope! Like just watching Steve Bannon run an obstacle course but instead of testing his athletic prowess (or lack thereof) he has to clear a hallway full of glory holes by blowing each one. And then he hits the big red button Ninja Warrior style. Like who can make these men cream the fastest? Who can beat the record Nixon set? Find out next time on American Senate Warrior!",
				"added": 1568235011
			},
			{
				"comment_id": 186,
				"body": "Okay but can you imagine if Gambit was the governor of Florida or something because he sucked the most dicks?",
				"added": 1568235456
			},
			{
				"comment_id": 187,
				"body": "I am 100 percent behind Taylor Kitsch joining the Skull and Bones. I would go all Alex Jones on them like Alex Jones went all Alex Jones on the Bohemian Grove. I'd be out there with night vision goggles tryna catch a peek at George Bush and Gambit 69ing. I'm not even gay I just wanna see if they'll finish in each other's mouths or pussy out and blow a load on the ground.",
				"added": 1568235574
			},
			{
				"comment_id": 188,
				"body": "Like you know why I won't vote Sanders? Because he thinks swallowing is for the one percent like nah brah that's just a common courtesy.",
				"added": 1568235640
			},
			{
				"comment_id": 204,
				"body": "> [bigbadbob](#comment_687_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Why exactly would you want to go in the \"cum coffin\"?\n\nWhy would you not? The cum coffin is great!",
				"added": 1568307835
			},
			{
				"comment_id": 206,
				"body": "> [bigbadbob](#comment_691_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): More reasons than I have time to list, but a couple that stand out would be eye infections and the smell?\n\nno no no no it's a glass coffin and you lie in it and after telling the society your sexual history they close the glass coffin and they all cum on top of it.",
				"added": 1568310590
			}
		],
		"1568081655_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 189,
				"body": "> [nekololi](#comment_387_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): do i have to get in line behind the dogs?\n\nYou know what? No. Because you're a bro I'm making an entirely new charity to help you get laid. #GetTheNekoLoliSomePusPus #RespectNekoLoli'sConstitutionalRightToSmash",
				"added": 1568235728
			}
		],
		"1568233309_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 192,
				"body": "Row row row your butt\nGently down my peen\nMerrily merrily merrily \nI am gonna cream",
				"added": 1568238490
			}
		],
		"1568136294_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 198,
				"body": "> [lianna](#comment_11_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): spambots on mastodon are relatively easy: just hook up some shell scripts to madonctl or some other CLI fediverse client, and away you go [...]\n\nScript kiddies need to step their game up.",
				"added": 1568255154
			}
		],
		"1568305901_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 200,
				"body": "> [mg0](#comment_130_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Watch it man, that amount of happiness is dangerous, if your bodily fluids become colorful you may be really close to bursting some capillary veins.\n\nToo late. I got too happy and had a brain aneurysm. Currently I'm posting this from hell's 56k innernet connection.",
				"added": 1568306663
			}
		],
		"1568229967_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 202,
				"body": "> [bigbadbob](#comment_682_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): yes and most certainly.\n\nI MUST FIND HIM! HE WILL EAT MY ASS GODDAMNIT!",
				"added": 1568306954
			},
			{
				"comment_id": 207,
				"body": "I'll take it!",
				"added": 1568310855
			},
			{
				"comment_id": 210,
				"body": "> [bigbadbob](#comment_700_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Maybe take some pocket change or shiny rocks or something organic and smelly... hippys like to barter.\n\nMy plan in it's entirety is to lure a pair of junkies to a secluded area with the promise of heroin, pull a gun, give them a five minute head start, and go all Most Dangerous Game on them",
				"added": 1568335865
			},
			{
				"comment_id": 211,
				"body": "> [bigbadbob](#comment_702_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): before or after they eat your ass?\n\nAfter, obviously. I never hunt on an uneaten ass.",
				"added": 1568336098
			}
		],
		"1568325376_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 208,
				"body": "Because we already know about Dolphins.",
				"added": 1568335606
			}
		],
		"1566944519_1587xjW5S4aJd1JKmLEsv1WRruZoWXokX9": [
			{
				"comment_id": 209,
				"body": "Hell yeah brother!",
				"added": 1568335649
			}
		],
		"1568341095_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 212,
				"body": "It was clearly contagious. We must terminate anyone who has had contact with these individuals to prevent a suicide pandemic",
				"added": 1568341430
			}
		],
		"1568332187_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 213,
				"body": "> [bigbadbob](#comment_704_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I'm talking about the biggest, greediest, most psychopathic corporations that eliminate all competition and hold monopolies.  Funny might not be the appropriate word.  Do you work for a corporation or something?\n\nThe solution is to put a bullet through their ceo's head. You can't make money if you're dead.",
				"added": 1568341483
			}
		],
		"1568365739_13H2jvnzHfDrYvfTzK1SjXfScJ4UrWRvGb": [
			{
				"comment_id": 214,
				"body": "See what",
				"added": 1568380249
			}
		],
		"1568373932_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 215,
				"body": "يمارس الجنس مع اليهود",
				"added": 1568380403
			}
		],
		"1568378060_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 216,
				"body": "Do jou need a bombmaker? I can be on flight in few hour",
				"added": 1568380434
			},
			{
				"comment_id": 217,
				"body": "> [lavaphox](#comment_27_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): BOOM! damn u r fast\n\nthat was my penis. It's the bomb, but it's not a bomb",
				"added": 1568382163
			},
			{
				"comment_id": 218,
				"body": "> [pyromisanthrope](#comment_2_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): I need to track down a guy who raped my girlfriend and destroy him\n\nLook up Uncle Fester's Silent Death, Homemade Explosives Workshop, & Vest Busters",
				"added": 1568382203
			},
			{
				"comment_id": 220,
				"body": "> [pyromisanthrope](#comment_4_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): I am not physically present in Germany, otherwise i would ve done the job myself. BUT FUCKING WOW MAN\n\nDamn it man your woman was raped by a sand nigger. Get your ass over there and flay him like a fucking perch",
				"added": 1568385600
			},
			{
				"comment_id": 221,
				"body": "> [pyromisanthrope](#comment_5_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): I FUCKING WOULD. EXCEPT THAT IT WOULD TAKE ME AGES TO GET A VISA, I AM NOT GERMAN. I WOULD FUCKING BURN IT DOWN\n\nWhat country are you in? I have family in the senate I can probably do something :/",
				"added": 1568386049
			},
			{
				"comment_id": 223,
				"body": "> [pyromisanthrope](#comment_7_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): How do i contact you man?\n\nDownload qTox or uTox and add me @ CC600FD102F8EA55E0AC69645639CF0D262D403BA796FD9A2C18A2D96E94060E16A51D31EA35",
				"added": 1568428618
			}
		],
		"1568376825_1HJBy9QCcwpNF7NGJKuQxiXBUqQra9amwN": [
			{
				"comment_id": 219,
				"body": "Doesn't work for you either?",
				"added": 1568382273
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 224,
				"body": "Oy vey, the same president that moved the embassy to kikestan and sucks slav cock is a pussy-ass dipshit? Go figure!",
				"added": 1568428676
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 225,
				"body": ">and I can prove it mathematically\n\nbruh just look at anywhere in Africa they prove it themselves",
				"added": 1568488404
			},
			{
				"comment_id": 236,
				"body": "> [kreiger1488](#comment_3_18934Fqdj4oJZMmXZ6EnAsD52U3YamtP5Z): This is entirely untrue, you forgot about aboriginals.\n\nAbos don't count they're too distant a species from humans.",
				"added": 1568665612
			},
			{
				"comment_id": 252,
				"body": "> [hardee](#comment_39_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H): how scientists thought plants had emotions\n\nBruh. Plants do have emotions. Put your hand on a tree sometime and tell me you don't feel the soul of the earth itself flowing through you.",
				"added": 1568843795
			}
		],
		"1568493746_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 226,
				"body": "The metric system is a jewish system of measurement just like nickel is a jew metal and if I don't use jew metals I damn sure won't use jew measurements.",
				"added": 1568502249
			},
			{
				"comment_id": 227,
				"body": "> [436sdwd](#comment_13_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): Here I thought that Jews used base 6... With some extra zeroes.\n\nAllegedly. But according to intel I received from the homeless man on 46th and Main the Jews are all undercover queers trying to convert the world to Islam to summon Belial and create a globalist paradise that uses the fucking Metric system.",
				"added": 1568504285
			},
			{
				"comment_id": 228,
				"body": "He's wise. His hat is soaked in urine to keep the Mossad from reading his mind.",
				"added": 1568504320
			}
		],
		"1568442422_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 229,
				"body": "Hope you guess my name :^)",
				"added": 1568508671
			},
			{
				"comment_id": 231,
				"body": "> [raaron773](#comment_1_15r56UHicKBnyAayhxJzT4XhpVuyStyKoU): I don't care about the world. Just give me that magic pill which can kill me without any pain and i am all set.\n\nI can assist you!\nFreemail me!",
				"added": 1568519757
			},
			{
				"comment_id": 232,
				"body": "> [pyromisanthrope](#comment_10_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): I did lol\n\nWELL YOU GUESSED WRONG. GAWSH.",
				"added": 1568520526
			},
			{
				"comment_id": 233,
				"body": "> [pyromisanthrope](#comment_13_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH): Nitrogen asphyxiation\n\nHelium",
				"added": 1568548524
			}
		],
		"1568583688_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 234,
				"body": "Are you kidding? You know who did it and where to find him. Get fucking angry. kill him before you kill yourself",
				"added": 1568585398
			}
		],
		"1568652007_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 235,
				"body": "What the fuck do you mean I can't smoke weed and lewd my loli?! I want to speak to your manager!",
				"added": 1568654016
			},
			{
				"comment_id": 242,
				"body": "> [bigbadbob](#comment_759_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Wow.  I would have assumed you were from china or something but that is just ridiculous.  They charge a license fee for the BBC and come inspect... For the CBC state media they just take it from taxes... 40 some dollars per Canadian with no inspections.  I wonder how much inspections cost.  sounds very much overstepping to say the least.\n\njust get a gun\nthis kinda shit happens when you let your government disarm you",
				"added": 1568779324
			},
			{
				"comment_id": 243,
				"body": "> [bigbadbob](#comment_761_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I envy the Americans for their constitution. They are by far the most free country on this planet. In Canada guns are fairly useless, especially handguns.  To have a restricted license they could potentially inspect to see they are stored properly, thus consenting to searches.  Self defense is equal force so if someone broke into your house and got shot they better also have a gun or you will be criminally charged. Even if they had a gun you will have to defend yourself in court.  But none of that will be an issue because your guns will be legally locked up properly, no chance you would have the time to access them for self defense.  Not properly storing the firearms could land you in jail for 10 years and earn a lifetime ban.  Owning guns in Canada is risky business and useless for self defense.  They could decide to take the guns away at any time like the other cucked and disarmed countries. They could not do that in the states.\n\nThat's hella gay. You should have the right to cap a nigga in self defense.",
				"added": 1568783742
			},
			{
				"comment_id": 244,
				"body": "See this is why I'm worried though. Trump is too friendly with the kikes. He gave them Jerusalem and he let one of those freaks marry his daughter (who admittedly is a slav so she doesn't count but still it's bad form) and honestly I wouldn't be surprised if he helped them disarm us the way they disarm most other places.",
				"added": 1568783895
			},
			{
				"comment_id": 245,
				"body": "> [robinofdeath](#comment_3_1367VTupfj886Uk39iT4RjiSmrakiDYTga): and shoot the tv licence guy? im never in when he comes round...\n\nThat's why you strap a knife to your roomba",
				"added": 1568820578
			},
			{
				"comment_id": 248,
				"body": "> [cactusdragon](#comment_8_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): Having more guns in circulation means having more people who could point a gun at you. If that happens, there is no running away from a fight anymore. Also the police would have to be more armed than you (machineguns in the USA). All in all there is more killing potential. On the other hand, if someone breaks in my house, I would like to have the means to protect me (; armed robberies are not unheard of here). All in all advanced weapons are a doubleedged sword.\n\nnot having any guns just means you're unarmed and I bought a gun off the black market now sit there while I rob your home and rape your wife. If you move I shoot your dick because I'm Europe's infamous Dick-Shooting Bandit! ",
				"added": 1568830749
			},
			{
				"comment_id": 251,
				"body": "> [cactusdragon](#comment_12_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): Yeah, I thoght about the blackmarket too. If it works with drugs, it works with guns too. If someone wants to kill me, I am sure he could do it. But isn't that in your case true too? (maybe someone comes with some firends and fully prepared?)(the difference is that in an 'unarmed' country one is more easily discoverd, as one is doing a major-illegal and risky thing [buying a gun] in the preparations for the crime)We all want to have the same thing: security and freedom. Allowing guns makes people more free but leads objectively to more deadly encounters (less security)?freedom vs security\n\nConsider this: some nigger tried to fight me because I gave him the middle finger for catcalling my friend. He walked up to the car and threw open the door. He stopped as soon as he saw that I had drawn my knife and I was smiling. He walked away muttering to himself. In that situation having a weapon may have saved my life. Stay armed. Never relax.",
				"added": 1568835903
			}
		],
		"1568598141_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [],
		"1568675236_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 238,
				"body": "What are we having for dinner?",
				"added": 1568676910
			},
			{
				"comment_id": 239,
				"body": "> [whitewolf](#comment_41_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): spinach ravioli with marinara. ice cream for desert. twas good.\n\nI had ass.",
				"added": 1568726292
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 240,
				"body": "Because I enjoy the novelty!",
				"added": 1568753997
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 241,
				"body": ">gas the jews\nReal talk, I'm all for excising the cancer from humanity but let's not forget their potential usefulness as human experiments and slaves. Why gas what you can exploit until it collapses from overwork and malnutrition and you put one between it's eyes for being of no further use?",
				"added": 1568778259
			},
			{
				"comment_id": 247,
				"body": "> [saintdeath](#comment_7_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U): by the law of bullshit false science...\n\nit's classic leftist cult mentality where they redefine terms. Like no that's not what natural selection means. Go apologize to your science teacher.",
				"added": 1568830638
			},
			{
				"comment_id": 257,
				"body": "> [isrealdeep](#comment_1_19SijwYmFDFhDxadRJ7WRyhHi15V539ck9): This is white weakness.\n\nNo this is Patrick",
				"added": 1568921196
			}
		],
		"1568823307_1B7S39qDssqWy7EJiKzhRboCyLGg2Auj4F": [
			{
				"comment_id": 246,
				"body": "this is hilarious",
				"added": 1568823409
			}
		],
		"1568832207_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 249,
				"body": "https://encyclopediadramatica.rs/High_Score",
				"added": 1568833023
			},
			{
				"comment_id": 250,
				"body": "Enjoy :D",
				"added": 1568833029
			},
			{
				"comment_id": 255,
				"body": "They're gonna blame vidya gaems one way or another. We should at least be allowed to joke about it.",
				"added": 1568904643
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 253,
				"body": "The difference is I can get away with everything",
				"added": 1568904474
			},
			{
				"comment_id": 256,
				"body": "> [sperg](#comment_13_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ): Yeah, that's what you think...right before some three letter agency kicks in your door. :)\n\nIt would be career suicide.",
				"added": 1568907055
			}
		],
		"1568831967_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 254,
				"body": "> [k0hlr4bi](#comment_8_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): Celibacy, including prohibition of masturbation, is mentally harmful to a human. What I don't understand is why priests are so attracted to kids, and not just fuck with each other, or nuns.\n\nif they're both married to fake god why don't they all real 3-way?",
				"added": 1568904568
			}
		],
		"1567786547_1BumxHqxXBHScLoq1wAJqiFZXJ4c1DcewG": [
			{
				"comment_id": 258,
				"body": "Always do your best to be anon, but always assume you are not.",
				"added": 1568921501
			}
		],
		"1568942181_1KJWLBhkwmtbUH2zhcbfWinQK9kJ4Kosfb": [
			{
				"comment_id": 259,
				"body": "Screw the rules, I have money.",
				"added": 1569078469
			}
		]
	},
	"comment_vote": {
		"5_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": 1,
		"983_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"27_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"15_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD": 1,
		"107_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"16_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD": 1,
		"21_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": 1,
		"42_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"60_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"7_16mjGDQRQUf6K53LZCeSu87NzxUC5R1n1N": 1,
		"4_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG": 1,
		"1_15uNGZadKcTYa3i81WxBn82XTMGqSTv9FP": 1,
		"383_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1019_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"6_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"156_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"103_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"5_15dh9yJTSgewL53B9uMW7TTkJF7wHp1tge": 1,
		"14_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"15_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"118_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"7_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"630_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"36_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"168_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"5_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": 1,
		"167_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"129_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"2_122cT23A74FNNmg5xYhY5YBqFghdg4yKFY": 1,
		"169_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"170_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"128_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"1_18UpBFob1JoJhLuQgA4Z4pmvHXm3PMAEqR": 1,
		"1_1Ai5o3Y7Lpn5VZt9thmATzMwqYa1D4qRam": 1,
		"17_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"647_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"17_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"99_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"102_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1023_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"41_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"667_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"671_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"676_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"677_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"178_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"180_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"181_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"388_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"389_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"16_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"182_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"11_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"122_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"133_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"123_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"9_16mjGDQRQUf6K53LZCeSu87NzxUC5R1n1N": 1,
		"130_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"682_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"42_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": 1,
		"685_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"687_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"686_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"690_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"699_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"700_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"702_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"13_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm": 1,
		"717_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"10_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"127_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"41_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"12_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"13_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"242_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"20_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"24_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"397_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}