{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Vous parlez de quoi la journée, hormis du virus?",
			"body": "Ras-le-bol du corona.. Quel est votre sujet de conversation principal dans la journée?\n",
			"added": 1602794676
		},
		{
			"topic_id": 2,
			"title": "Hold-Up dispo sur Zeronet!",
			"body": "Le documentaire Hold Up en français est dispo sur ZeroUp Unlimited ! http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/?Latest",
			"added": 1605627704
		},
		{
			"topic_id": 3,
			"title": "Des plateformes open-source et décentralisées",
			"body": "Salut tout le monde! \nVidéos: On entend parler de Odysée mais il y 'a aussi Peertube. Ce dernier permet de télécharger les vidéos en plusieurs qualités mais aussi par torrent ou bien par téléchargement direct. Evidemment, préférez les torrents pour ne pas surcharger les serveurs ;)\n\nMusique: On a le système Funkwhale pour partager de la musique. Le principe est toujours le même. On installe le service sur son serveur et on y met sa musique. \n\nRéseau social: On peut se retrouver tranquillement sur Mastodon. Le nombre de caractères pour écrire un pouet (un message public ou privé) est de 500 voire 1000 selon les instances (les serveurs). Il y a des instances pour presque tous les sujets (manga, prise de photos etc...) et ça, c'est plaisant. Le système de hashtag est cool aussi, on peut retrouver des utilisateurs juste avec un dièse et établir un contact !\n\nVoilà, j'ajouterai peut être d'autres services pour vous montrer que, y compris ZeroNet, on peut avoir des alternatives crédibles pour remplacer les GAFAM ;)",
			"added": 1605790145
		},
		{
			"topic_id": 4,
			"title": "Hacking dans un terminal, sous Linux",
			"body": "Si vous avez toujours rêvé de vous la jouer comme dans un film de hackers, voici une application qui devrait vous faire plaisir, surtout si vous êtes vous-même réalisateur.\n\nIl s’agit d’Hollywood, un programme qui a été développé par le Chef de Produit de la solution de Cloud proposée par Canonical et qui simule un genre de centre de contrôle affichant des logs qui défilent, des lignes de commandes et du binaire façon Matrix.\n\nPour l’installer, rien de plus simple. Il suffit d’entrer les lignes de commande suivantes dans votre terminal :\n\n    sudo apt-add-repository ppa:hollywood/ppa\n\n    sudo apt-get update\n\n    sudo apt-get install hollywood\n\nTapez maintenant hollywood dans le terminal. Vous voici dans les films!",
			"added": 1611843693
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"5_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 1,
				"body": "essaye via PirateBay ;) Même s'il n y a pas beaucoup de contenus FR, on ne sait jamais ;)",
				"added": 1602502033
			}
		],
		"2_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": [
			{
				"comment_id": 2,
				"body": "Voilà en quoi ce réseau ZeroNet est utile! Ce documentaire ne pourra jamais être supprimé, tellement il est partagé ;)",
				"added": 1606036841
			},
			{
				"comment_id": 3,
				"body": "J'ai vu un message sur Mastodon d'un utilisateur qui remerciait la personne qui avait mis le documentaire ici. Il ne comprenait pas pourquoi tous les gens qui parlent de censure ne se retrouvent pas sur une plateforme décentralisée (comme celle-ci) pour partager des contenus qui sont souvent censurés...\nDéjà, merci à cette personne! Concernant le documentaire, on peut en penser ce qu'on veut mais j'estime que l'on peut critiquer seulement après l'avoir visionné. Je ne partage le point de vue du journaliste à 100 % mais je peux dire que tout le début du film reflète la réalité, ce sont les mensonges qu'on nous a balancés à la TV.. La fin, quant à elle, est plus subjective, c'est une hypothèse..",
				"added": 1606037200
			}
		],
		"4_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 4,
				"body": "C'est quoi la prochaine étape?? Les coups de feu à balles réelles sur la foule..?",
				"added": 1606037329
			}
		],
		"1_1PHWyPQhyUEDGcxFRQYeUK7kwqETvLhsjj": [
			{
				"comment_id": 5,
				"body": "Il dit souvent la vérité",
				"added": 1606938555
			}
		],
		"3_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": [
			{
				"comment_id": 6,
				"body": "Comment on fait pour télécharger les vidéos de Odysee ? merci ;)",
				"added": 1609184257
			}
		],
		"2_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH": [
			{
				"comment_id": 7,
				"body": "Les gens n'ont qu'à pas confier leur vie à ces plateformes de merde! C'est aussi simple que ça lol",
				"added": 1611605306
			}
		]
	},
	"comment_vote": {}
}