{
	"title": "jkne",
	"description": "Check out my P2P blog!\nWords, music, posts.",
	"links": "- [twitter](https://twitter.com/jkne)\n\n- [soundcloud](https://soundcloud.com/jkne)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1457148618,
	"post": [
		{
			"post_id": 8,
			"title": "jkne - jamdruchacelmenorrolstoandamp9",
			"date_published": 1457148233.146,
			"body": "[play instantly](img/jkne-jamdruchacelmenorrolstoandamp9.mp3)\n\nMusic in a P2P world.\n\n[soundcloud](https://soundcloud.com/jkne/jamdruchacelmenorrolstoandamp9)\n\n"
		},
		{
			"post_id": 6,
			"title": "jkne - jamdruchaceljamdruchacelmenorrolstoandamp9",
			"date_published": null,
			"body": "[Instant play/download](img/jkne-jamdruchacelmenorrolstoandamp9.mp3)\n\n[listen on soundcloud](https://soundcloud.com/jkne/jamdruchacelmenorrolstoandamp9)\n"
		},
		{
			"post_id": 5,
			"title": "UK government looks like it wants to kill us.",
			"date_published": 1456975782.71,
			"body": "Fracking is a great way to poison freshwater supply. Water is our most valuable resource.\n\n![Global salt water and freshwater estimates](img/globalwater.jpeg)\n"
		},
		{
			"post_id": 4,
			"title": "jkne - leg trick",
			"date_published": 1456795945.042,
			"body": "[listen](https://soundcloud.com/jkne/i-dont-see-how26)"
		},
		{
			"post_id": 2,
			"title": "No more censorship",
			"date_published": 1456788799.599,
			"body": "Remember how the media industry tried to shut down sites like The Pirate Bay?Courts issued orders in many countries to ISPs to block these websites. Then the community, not fond of being blocked out, routed around the problem by creating proxies. Then courts ordered to block proxies too, but for each one they blocked 10 more would pop up.\n\nNOW, imagine a world where you are free to not be told what you can and can't look at! \n\nA world where you are free to publish information on your own website that is distributed as soon as it is viewed by someone, where your computer can be shut down but the website lives on; making court orders useless and censorship from your would-be overlords very difficult if not impossible.\n\nWelcome to the world of torrenting, but for websites, made super simple! You'd never have to know how it works, just the advantage that P2P websites bring.\n\nTo mark the occasion of this incredible platform I installed about 30 minutes ago actually becoming a real thing that many were imagining just a few years ago, I made my first decentralised website, it's a blog, it was easy, and you're reading the first post! Thank you ZeroNet! :)"
		}
	]
}