{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1556618720,
			"title": "Are tor users able to access only tor zites?",
			"body": "Hello all. This is my first question here and I have been on zeronet for a couple of days only.\n\nI have been using zeronet with tor through tor browser till now, and i have started setting a personal blog in here. However i have read in a redit post, a comment i haven't been able to verify. According to it, zites that are seeded by tor users in zeronet, can only be accessed by other zeronet users that also use tor.\n\nIs this true? I mean, if i set up my site, the only ones that can read it are the people that use tor or have i terribly misunderstood the reddit comment?\n\nAnyway, thanks for your time",
			"added": 1556618719
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1556618720_16WUTDjmD5j8EznVUgLiksh4Eg2SbFnX35": [
			{
				"comment_id": 1,
				"body": "> [gluek](#comment_19_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): NO. You need at least one peer with real ip to seed (bootstrap) your content, it could be even some open proxy.\n\nThank you for your reply\n\nDo you know any such proxy, or can you point me to some documentation regarding this?",
				"added": 1556622115
			},
			{
				"comment_id": 2,
				"body": "Thank you all for your replies. I think i understand now how it works. Thank you for your time",
				"added": 1556708961
			}
		],
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 3,
				"body": "1. Mainstream internet is now -thank GOD- a pretty Christian place. Like, Medieval-Holy-Inquisition-Kill-All-The-Infidels Christian place. Why were your files taken down?\n\n2. Do you plan to create a complimentary site with Nazi content to preserve a genetically superior internet at least?",
				"added": 1560192433
			}
		],
		"1560001040_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 4,
				"body": "I am really interested in this. But I wonder, why would the \"REDS\" construct such a lie? What do they have to gain?",
				"added": 1560193275
			},
			{
				"comment_id": 5,
				"body": "I see. But why should i really care? Socialist regime, capitalist regime, what difference would it make to my daily life? If climate change is a lie, all the better. No need to do anything at all.",
				"added": 1560195237
			},
			{
				"comment_id": 7,
				"body": "I am sorry man, but the anchorman in this video is... Well... I think that no country can go 100% renewable energy in 10 years as well. But i believe so, because of the redesign in a free market industry and the cost it would entail. Not because \"jobs will be lost\". Jobs will also be created. Sorry, no offense to you, but this guy is just not bright enough.\n\nBut that was not my question. My question had to do with why should i give a fuck about the \"RED lies\". RED lies, BLUE lies, what does it matter in the end?",
				"added": 1560204116
			},
			{
				"comment_id": 8,
				"body": "@frodolf: No no, don't get me wrong. I am willing to see the lie. Heck, I actually see the lie. It's just that I don't care. I have already paid this month rent and this is pretty much the only bill I can pay for this month.\n\nNow you say, there are some REDS trying to push a Green deal. I say let them. I even say let them bring communism. I have even heard they give free houses. I want shit like that. If a communist would tell me that in communism i will have free housing and free electricity, I would say I am sold. No need for \"green deal\" lies.",
				"added": 1560205358
			},
			{
				"comment_id": 9,
				"body": "It's not that i dont care about anything. Its just that i dont care about your bolsheviks phobias. People have real problems you know.",
				"added": 1560209378
			},
			{
				"comment_id": 10,
				"body": "Lol dude. Grow up.",
				"added": 1560210922
			},
			{
				"comment_id": 11,
				"body": "All this anger because you just cant explain the \"REDS\" threat. You kids are losing it very easily nowadays.",
				"added": 1560212397
			}
		],
		"1560195090_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "So? Politics are diverted all the time.",
				"added": 1560195932
			}
		]
	},
	"comment_vote": {
		"19_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"700_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"460_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_19AjK43a3DvLCEfmcrLx9XBpTQg1Kc6BS4": 1,
		"20_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"66_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"810_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}