{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1563985981_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "API is always better than any shitty *UI, if so.\nYou will still have enough craps like locale-specific behavior, though.",
				"added": 1564147137
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 3,
				"body": "Open-source CPU manufacturer... Like Loongson? (I hope their toolchain can work smoothly someday...)",
				"added": 1564147470
			}
		],
		"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": [
			{
				"comment_id": 4,
				"body": "> [baduser](#comment_16_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): On desktop, every program has full access to all user's files. I hope it will change one day to something more secure like what Android does. Can't say anything about Windows but on Linux there are plenty of sandboxing options such as containers, chroots, AppArmor/SELinux/TOMOYO and even full VMs. But it's not mainstream yet and mostly used only to reduce the damage if the program is hacked.\n\nWindows can use Sandboxies and VMs as well. It also comes with built-in container support in recent versions.\n\nThe problem is relying on the unreasonable security model (tolerating sharing all persistent resources in the host by default) which can't be fixed by _adding_ some more unreasonable. All additional separation/integrity-level suffers from the cost should not have been there.\n\nIn fact, UNIX is way worse in this sense, due to deliberately abuse of filesystems.\n\nAndroid does not do much more right. Processes running on Android still share at least one global namespace (i.e. the VFS) by default. The resources are assumed existed via some predictable paths in the global namespace protected by some additional permission checks. Apps can reject to work if the user doesn't grant the permissions, and nothing can stop those monopolistic malwares to have the assumption that the user will finally accept the request. Ironically, most users have no root access because they are not trusted by the manufacturer, so do the apps they run. Thus, the potential damages reduce. But what if there is a hole, or worse, a backdoor?",
				"added": 1611655179
			}
		]
	},
	"comment_vote": {
		"9_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh": 1,
		"36_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"67_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"212_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	}
}