{
	"title": "经济收藏",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1485783153,
	"post": [
		{
			"post_id": 2,
			"title": "大萧条真正的发酵，会是在 2017 春节后吗？",
			"date_published": 1485783041.253,
			"body": "作者：neo anderson\n链接：https://www.zhihu.com/question/51450660/answer/143370675\n来源：知乎\n著作权归作者所有，转载请联系作者获得授权。\n\n作者：neo anderson\n链接：[知乎专栏](https://zhuanlan.zhihu.com/p/25037807)\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n首先给大家拜年，然后说点个人看法。\n\n去年下半年以来，经济形势变化很快。\n\n前途茫茫，人心惶惶。\n\n大家不知道会发生什么，许多人私信我，征求我的意见。\n\n我一直想写点东西，分享自己的看法，提出一些建议，仅供大家参考。\n\n************************************************************\n\n在写自己的看法之前，先给大家推荐几部电影，对经济问题，尤其是金融危机，有一个比较直观的认识。\n\n1、[监守自盗 (豆瓣)](//link.zhihu.com/?target=https%3A//movie.douban.com/subject/4843480/)\n\n2、[大空头 (豆瓣)](//link.zhihu.com/?target=https%3A//movie.douban.com/subject/26303622/)\n\n3、[大而不倒 (豆瓣)](//link.zhihu.com/?target=https%3A//movie.douban.com/subject/6013501/)\n\n4、[商海通牒 (豆瓣)](//link.zhihu.com/?target=https%3A//movie.douban.com/subject/4888853/)\n\n还有几本书，也推荐大家看看：\n\n1、[美国金融危机调查报告 (豆瓣)](//link.zhihu.com/?target=https%3A//book.douban.com/subject/10566145/)、\n\n2、[资本论(第三卷) (豆瓣)](//link.zhihu.com/?target=https%3A//book.douban.com/subject/1150703/)\n\n3、拙作 [纸牌大厦 (豆瓣)](//link.zhihu.com/?target=https%3A//book.douban.com/subject/26391828/)\n\n4、[泥鸽靶 (豆瓣)](//link.zhihu.com/?target=https%3A//book.douban.com/subject/1011772/)\n\n5、[中国通货膨胀史 (豆瓣)](//link.zhihu.com/?target=https%3A//book.douban.com/subject/7007734/)\n\n有时间看看这些电影和书，对经济危机有其是金融危机的部分有一个直观的了解。\n\n************************************************************\n\n市场经济必然有周期性的经济危机，所谓经济危机其实就是全社会大规模债务清算的行为。清算过程中，不良债权与债务湮灭，实物和资产的所有权发生转移——欠债还钱，还不上就以物和股权抵债，还不够的部分就债务就作废。\n\n市场经济每运行一段时间，就会出现债权和债务同步堆积的现象，这时就面临清算。因为马太效应，债权和债务的堆积，稳步集中在相对固定的社会成员和企业上。\n\n实际操作中，可以通过不断扩大债务规模的方式避免清算，也就是让无力偿还的负债者背上更多的债务。俗称加杠杆。\n\n但是，这种方式并不是一劳永逸的。与之对应的必然是债务和债权继续迅速堆积。\n\n不加杠杆，就要危机，加杠杆，日后酝酿更大的危机。再说，杠杆加到一定幅度，必然出现巨大的资产泡沫或恶性通货膨胀的苗头。\n\n要去杠杆，就要面临清算，也就是危机。要避免清算，或者说金融危机，就只能加杠杆。去杠杆失败的原因，不言自明。\n\n这方面比较系统的理论基本是空白。西方经济学和马克思主义政治经济学，基本都没有。西方经济学的目的是为资本主义辩护，自然没有资本主义注定发生危机的内容。《资本论》第三卷谈了很多金融危机的内容，但是因为马克思死得早，所以没有分析垄断资本主义时代 “滞涨沫崩”之间的艰难选择。\n\n***********************************************************************\n\n![](https://pic4.zhimg.com/v2-58e089e09c8db8e1443087d6bd77e363_b.jpg)危机其实是贫富差距造成的。贫富差距越大，危机越严重。危机其实是全社会以货币进行结算过程（恶性通胀是大家以商品进行结算的过程）。\n\n资本主义，必然有贫富差距，不然怎么有资本家和无产者？有资产者和无产者，就必然有悬殊的贫富差距，也就必然有经济危机。\n\n提出让一部分人先富起来的时候，就是要培养资本家，拉大贫富差距。做出利改税、拨改贷决定的时候，就决定了国有企业也必然是为了利润而运转。\n\n现在，我们回过头来看这个问题，中国的贫富差距是不是越来越大？国有企业是不是也要以利润为考核指标？\n\n考虑到这两点，我们有什么理由认为我们能避免危机呢？\n\n***********************************************************************\n\n现在的情况是，2008年发生次贷危机以来，我们一直试图使用增加货币供应，让无力负债者不断负债的方式，避免大规模的债务和债权清算。\n\n原因很简单，一旦发生清算，就是经济巨震。不仅如此，经济基础巨震，必然威胁上层建筑。\n\n2008年放出的天量贷款，在2013年前后陆续到期。这些贷款基本还不上。当时为了避免出现日后更大规模的危机，曾经试图去杠杆，结果闹出了钱荒。其实，钱荒是经济危机的第一步，放手不管的话，经济很容易进入全面结算状态，也就是金融危机。于是，再次大规模开闸放水。\n\n由前一届的大水漫灌，变成了洪水泛滥。不放水就是危机，放水规模必然几何级数增长。\n\n洪水暂时掩盖了危机。\n\n大笔的热钱没有出路，各种骗局特别多。\n\n<u>**当实体经济萎缩的时候，不断放水产生的热钱，2015年冲进股市，2016年冲进了楼市。因为闲钱多，所以互联网、高新科技为噱头的圈钱项目也特别容易。**</u>\n\n另一方面，债务也多。更多的债务，意味着需要更大规模的放水。\n\n这是恶性循环。这种循环终于在2014年开始，在实体经济上表现出来。直接表现就是地租、人工和原材料成本迅速上升，不断挤压实体产业的利润空间——这是大量热钱投机的必然结果。\n\n比如这个：\n\n![](https://pic2.zhimg.com/v2-f7369af6a9ae609a9d4af39c26ab8e15_b.jpg)这种情况下就是想继续灌水，掩盖危机，也很难了。因为很容易出现恶性通胀。那时，整个经济循环停摆。\n\n这时，政府就要面临艰难的选择，是继续冒恶性通胀的危险继续放水，还是停止放水让经济着陆。或者说，是选择“涨沫”，还是“滞崩”。\n\n不管是谁，都想维持现状，问题是形势比人强。\n\n[2016财政收入增速4.5%创28年新低 受政策性减收较多等影响](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/roll/2017-01-24/doc-ifxzutkf2450745.shtml)\n\n> 昨日（1月23日），财政部公布<u>**2016年财政收支情况，当年全国一般公共预算收入159552亿元，比上年增长4.5%，延续了增幅逐年回落的走势，为自1988年以来我国财政收入最低增速。**</u>\n> \n> 受经济下行压力影响，财政收支矛盾凸显。2016年，全国一般公共预算支出187841亿元，同比增6.4%。\n> \n> 中国人民大学财政金融学院副院长赵锡军告诉《每日经济新闻》记者，<u>**经济增速放缓，企业利润下降是财政收入增速持续下降的主要原因。此外，还与企业成本增加**</u>，营改增等税制改革，政府为企业减税降费等举措有关。\n\n长期以来，我们都是财政收入增长快于GDP。相比GDP，财政收入更真实。今年财政收入慢于GDP，是真的慢于GDP，还是……再说，财政收入增长下降，意味国家控制社会总产品分配的能力下降，这意味国家在关键时刻很可能拿不出钱来解决火烧眉毛的事情。再考虑一步，如果没有去年的楼市疯狂，财政收入能达到这个水平吗？如果再减去通货膨胀呢？\n\n[去年贷款增12.65万亿 今年货币突出中性](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/roll/2017-01-13/doc-ifxzqhka2845090.shtml)\n\n> 央行昨日公布的数据显示，<u>**2016年12月人民币贷款增加1.04万亿元，同比多增4466亿元，远超市场预期。全年人民币贷款增加12.65万亿元，同比多增9257亿元。**</u>\n> \n> 2016年12月末，广义货币（M2）余额155.01万亿元，同比增长11.3%，增速分别比上月末和上年同期低0.1个和2个百分点；<u>**狭义货币（M1）余额48.66万亿元，同比增长21.4%，增速比上月末低1.3个百分点，比上年同期高6.2个百分点。**</u>\n\n在这样灌水的情况下，还仅仅是个经济增长差强人意，物价蠢蠢欲动的效果。如果要达到更积极的经济指标，大水漫灌、洪水泛滥，都已经不够了。必须像《圣经》里那样洪水滔天了。问题是，物价已经随时可能突破临界区了——<u>**M1高速增长是非常危险的，意味着货币流动性增高，潜在流速加快，热钱迅速增加，到处乱撞。**</u>\n\n凯恩斯主义是饮鸩止渴，如同吸毒，初期很爽，越到后期，刺激效果越差，需要的剂量越大，副作用越大，那时就离吸毒导致的意外猝死不远了。\n\n所以，今年年前出了一件值得关注的事情。\n\n[央行MLF利率首次上调 等同近六年来首次加息](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/roll/2017-01-25/doc-ifxzuswq3415551.shtml)\n\n> 1月24日下午，央行宣布开展一年期中期借贷便利（MLF）操作，利率3.1%，较上次操作提高10BP。<u>**这是MLF操作历史上首次上调利率，也是政策利率近六年来首次上调，其意义等同于加息。**</u>\n> \n> 中金固收团队认为，此次加息主要是PPI上涨引发货币当局对通胀压力的担心以及年底年初信贷投放过快，货币当局希望释放一些收紧信号来对信贷增速和金融杠杆进行调控。\n> \n> 中信证券(16.480, 0.09, 0.55%)固收首席分析师明明表示，<u>**随着利率市场化完成，存贷款基准利率限制取消，MLF操作利率逐渐成为政策目标利率。**</u>\n> \n> 24日，债市再次暴跌，国债期货尾盘跳水，10年主力T1706收盘收跌0.82%，创2016年12月19日以来最大跌幅；银行间现券收益率大幅上行，10年期国债和国开收益率均创逾1个月新高。新一轮债券熊市或将开启。\n\n这是不得已而为之。\n\n**************************************************\n\n从国际上看，也不省心。美国加息，大量热钱认识到中国金融危机的潜在威胁，开始撤退。那些拥有巨资的富豪，有些早就走了，有些虽然没全走，但是也在搞狡兔三窟。资本家无祖国，他们要做的只是让自己的资本不断增殖。\n\n[人民日报：没必要通过缩减购汇额度来减少外汇流出](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/review/2017-01-16/doc-ifxzqhka3125137.shtml)\n\n[国务院：扩大对外开放积极利用外资](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/roll/2017-01-17/doc-ifxzqhka3326280.shtml)\n\n[外汇局：没有强制结汇 不要轻信传言](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/china/2017-01-19/doc-ifxzunxf1450993.shtml)\n\n[外汇局规范企业外汇收支业务：谁出口谁收汇 谁进口谁付汇](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/roll/2017-01-27/doc-ifxzyxmu8133539.shtml)\n\n[外汇局：加强境外直接投资真实性合规性审核](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/china/gncj/2017-01-26/doc-ifxzyxmt1325291.shtml)\n\n仔细读读，无非三重意思，安抚人心、限制外汇流出、使用一切手段要求外汇流入。\n\n> 一家钱庄滥发银票。有人用银票提银子。\n> \n> 钱庄开始说，我的银子多得很，有库银4万两，每年还能收入4千两。于是，照样滥发银票，同时敞开供应银子。很快，库存4万两库银，变成3万两。\n> \n> 结果，这家钱庄开始限制提取银子。不仅如此，还要强制储户存入银子。这样一来，等于公开宣称自己快挺不住了。\n> \n> 于是，有能力的储户开始加速提取银子，有了银子也不存进来。现在，问题来了，这样的钱庄还能挺多久？\n\n资本管制，必然搬起石头砸自己的脚。尤其是存在大量进出口贸易，存在自贸区和离岸金融中心的时候。（某人当年力排众议推动自贸区，现在后悔不？）\n\n<u>**目前看，从刺激效果下降、物价失控压力和本币贬值压力的三重的角度看，加息都是难以避免的事情。**</u>\n\n******************************************************\n\n下一步可能出现的情况，包括并不限于：\n\n[如果2016 年中国经济增速持续下滑，政府会怎么应对？](https://www.zhihu.com/question/39477607/answer/84504759)\n\n> 1、人民币加息、贬值；\n> \n> 2、清理三角债，大量债转股，让一部分中、小型金融机构（包括小型银行）破产；\n> \n> 3、国有企业大规模裁员，事业单位压缩编制、公务员机构改革（也就是裁员）；\n> \n> 4、地方政府减持持有的国有资产；\n> \n> 5、增加对社会中下层的税收，严查偷税漏税；\n> \n> 6、削减社会福利；\n> \n> 7、出让一部分国家经济主权，吸引外来投资；\n> \n> 8、推动农村土地流转，促进资本扩张，撵农民进城，压低工资；\n> \n> 9、增加军费开支和维稳开支，备战。\n\n<u>**这些政策中的大多数，当年都采取过，当时采取这些政策的原因，无非是经过权衡，没有更好的选择而已。牺牲社会中下层的利益，满足社会中上层的收益。**</u>\n\n现在依然如此。本质上没有变化，仍然是经济危机。如果有变化的话，就是现在的贫富差距更大，危机的潜在风险更大。中美关系更恶劣，美国要把中国开除出其主导的经济圈。\n\n如果说，还有可能的政策的话，就是出现类似美国次贷危机中由美国财政部担保的“大而不倒”的金融机构。得到担保，就意味着不会被挤兑，得不到，就难说。\n\n究竟是谁，大家心里清楚，我不指出。\n\n***********************************************\n\n大势已定，不可逆转，但是在发展的过程中仍然充满变数。\n\n<u>**关于现实情况，要少看分析，多走基层。**</u>许多时候，所谓的分析，其实就站台，或者为了政绩，或者为了舆论操纵。\n\n[民生宏观：经济数据打假是2017一个不可忽视的变数](//link.zhihu.com/?target=http%3A//finance.sina.com.cn/china/2017-01-24/doc-ifxzusws0152798.shtml)\n\n> （一）常见的数据造假方法\n> \n> 1、假外资\n> \n> 招商引资一直以来是地方政府重点关注的指标，因为外资的引入往往还伴随着国外先进技术、管理、设备等，容易成为地方政绩的亮点。主要造假方法有两种：\n> \n> 一是通过资金出入境。地方政府将人民币汇到香港（或其他境外），注册成立壳公司，然后将人民币转成港币（其他外币）后，再汇回本地作为外资进行投资，其中的汇兑损失则由地方财政局负责。有些地方政府甚至成立引资专项基金，实际上是应对汇兑风险的资金池。\n> \n> 二是直接买外资。政府花钱请外商注册成立壳公司，一段时间后把资金转走。江苏淮安市曾连续多年“利用外资增速”居全省第一，后调查发现该市多个县区都在花钱买外资：每100万美元外资，政府给17万人民币，注册纯粹的空壳公司，一周后再把资金抽走。\n> \n> 2、假出口\n> \n> 在国内内需不足、产能过剩情况下，出口的拉动作用再次显现。除了粉饰数据、假造政绩外，骗取出口退税、获取灰色收入也是很多出口企业的造假动机。\n> \n> 主要做法是出口企业让物流公司的货柜车不停变换牌照，反复进出关，同一批货物多次报关通关，虚增出口额，同时骗取出口退税。尤其是在保税区，由于区内关外的政策优惠，这种做法实施起来更是简化便利。某些地方的物流公司甚至已形成成套的业务模式。另外，进出口数据造假可以为资本外逃和假外资流入提供便捷的管道，为金融安全埋下隐患。\n\n当然，这种操纵未必一定来自官方，许多时候也来自机构——左手控制消息（各种分析报告），右手浑水摸鱼。\n\n> 一个同行，法国留学硕士，作宏观分析的，各种新闻、数据、分析等等文字材料没少看，各种研讨会、峰会没少参加，他自己在股市上套得一塌糊涂。\n> \n> 看过《大空头》吗？知道评级机构的报告怎么来的吧。\n> \n> 放过贷款吗？知道不能只看客户经理提供的材料吧。\n> \n> 报告也好，材料也好，分析资料也好，所有的文字材料都是人写的。人写的，就难免有夸大、漠视和扭曲，尤其是涉及巨大的私人利益在其中的时候。\n> \n> 何况，写这些材料的，很多时候就是人云亦云的懒虫和蠢货。\n> \n> 多去基层走走，比坐办公室看各种文字材料有用。\n> \n> 《大空头》之中，团队之一，亲临现场调查房地产市场情况，一条鳄鱼从闲置的房屋的游泳池中窜出来，从那一刻他们就坚定做空了。\n\n没有条件亲临一线的朋友，可以多关注经济类的新闻，尤其是各类政策和一些深度报道。数据也许有问题，分析一般不靠谱。但是，<u>**经济政策都不是空穴来风，都是有原因、有针对性的。深度报道，尤其是报道一些行业的问题，通篇造假的可能性并不大。要善于从侧面听新闻，听出弦外之音。**</u>\n\n******************************************************\n\n<u>**一般来说，每次危机之后，都是实体产业的复苏期。**</u>\n\n不过，很多企业未必能熬到这一天，尤其是大量使用银行贷款作为流动资金，被上下游大量挤占资金的企业。会有一大批中小企业在危机中死掉，存活下来的迅速兼并，廉价获得对方的市场、技术、劳动力。\n\n对出口型企业来说，出口局面必然好转，但是以人民币计算的原料价格上涨，可能要挤掉他们大量的利润空间。\n\n总体来说，危机都是价格体系重新构建的过程。在构建过程中，中小企业的博弈能力差，往往吃亏。\n\n具体行业情况，还是要经常和该行业从业者打交道，与他们交谈、了解。\n\n******************************************************\n\n<u>**一般来说，危机之中，房产的价格都会下跌。**</u>\n\n至少几方面原因：\n\n<u>**第一、随着加息，大量房奴不堪重负，或主动或被动断供。第二、资金链紧张的开发商会主动抛盘。第三、大量企业破产清算，拥有房产的小老板们被迫出售房产抵债。第四、随着失业率增加，很多人无力支付月供。一部分人甚至可能卖掉比较大的房产，购买较小的房产套现一部分现金。第五、出现高抛低吸的跟风抛盘，和移民海外清理国内资产的清算抛盘。**</u>\n\n地方政府在初期可能采取限制土地供应的方式托盘。但是，地方政府财力如何，决定其托盘能力。显然，除了北、上、广、深，其他地区的地方政府，如果不是绝大多数的话，也是大多数陷入财政危机之中，无力托盘。\n\n**<u>当发现自己</u><u>彻底</u><u>无力托盘以后，地方政府很可能转手做空，也就是开征房产税。</u>**地方政府必须要有财源，这是最根本的原则，做多或做空，都要服务于这个原则。\n\n但是，需要注意的几点：\n\n第一、中国正处于城市化进程中，大量人口正在从内陆涌入北、上、广、深。所以，可以预期的是，<u>**北、上、广、深房产价格下跌的幅度，要远远低于内陆二、三、四线城市。**</u>\n\n第二、城市中心区、小户型，尤其是<u>**北、上、广、深的中心区小户型，往往非常扛跌。**</u>尤其是在全国经济萧条，大批无业游民失去固定职业的时候，他们会进入就业机会相对较多的北、上、广、深的中心区，好歹找一个落脚的地方，哪怕群租、混租，甚至两个人租一个铺位，只要能睡觉就行，然后去寻找临时短工，努力糊口。所以，<u>**这种城市的中心区小户型，完全可能因为供不应求，而逆市上涨。相比之下，因为部分富豪破产，有资格的接盘者很少的原因，豪宅的价格的下跌幅度往往比较大。**</u>\n\n第三、不出意外的话，这些城市会出现贫民窟。<u>**那些外来人口聚居地地区，流动人口多，犯罪机会成本低，会出现治安下降，中高收入阶层流出，低收入阶层涌入的情况。最终，老住户们想不走也不行。**</u>这些地区的房价很可能长期低迷——因为大批老住户的陆续搬走，而愿意接手的人并不多——自住，不安全；收房租，不刺龙刺虎，对付不了那些租户。当老住户们大批搬走以后，房价反弹——此时的房屋所有权，往往已经高度垄断到那些刺龙刺虎的房东的手中了。没有两下子，是当不了《功夫》之中猪笼城寨的包租公和包租婆的。<u>**对普通人来讲，买到这样的房子，只能自认倒霉。**</u>\n\n第四、出现贫民窟地区。目前看，一是支柱产业破灭的地区，类似美国的底特律。这种贫民窟，是鬼城型贫民窟。二是外来人口大量涌入的交通发达、房屋老旧的三不管，类似美国纽约的布鲁克林。这样的三不管肯定会出现，具体在哪里，不好说。一旦出现，就会出现聚集效应，大量流动人口，向该处流动。\n\n******************************************************\n\n<u>**一般来收，本国发生金融危机的时候，都会伴随本币贬值。因为大量资产在迅速外逃，避免在危机中受损。**</u>\n\n外汇管制，并不能解决问题。\n\n第一、考虑到市场经济中，10%甚至1%人口拥有90%的权限，就会知道，限制购汇也好，强制结汇也好，只会给极少数人创造发财的机会，并不能解决根本问题，而且使问题恶化。\n\n第二、资本管制限制了外汇流出，也吓阻了投资和利润汇回。如果没有经常项的贸易盈余，那么外汇储备可能下降更快。\n\n第三、在大规模进出口的时代，坚持本币坚挺，同时国内物价不断上涨，必然引起商品倒灌和经常项贸易盈余迅速下降。这显然不是外汇管制能解决的问题。\n\n强制结汇更不可取，不过并不能完全排除外管局的官僚们能干出国民党末期强制收缴外汇的事情。当然，如果这样干，要支付什么样的代价，大家也都明白。\n\n<u>**从各国的经验看，在某一时间节点，突然宣布本币加息、大幅贬值，是权衡之后，比较可取的选择。**</u>\n\n*******************************************************\n\n<u>**当就业恶化的时候，治安下降几乎是不可避免的。对此，大家要有思想准备。**</u>\n\n*******************************************************\n\n<u>**在经济动荡的时代，就业困难，对年轻人来说，是挑战，也是磨练。机遇总是给有准备的人的。**</u>\n\n看不到前途的时候，与其迷惘，不如不断增强自己的实力——勤学、勤业、勤交友。行万里路，读万卷书。\n\n当然，这里面说的行万里路和勤交友，不是去洗澡都不方便青藏高原洗涤心灵，也不是去古城找炮友。而是深入社会，调查研究，开拓眼界。\n\n曾经有两位伟人和你们一样，遇到类似的困境，但是他们没有迷惘，没有失落，没有挥霍青春，没有怨天尤人，没有恣意行乐，而是选择了自强自立，奋斗不息。\n\n<u>**迷惘的时候，可以去读读两位伟人的传记。**</u>\n\n> 独立寒秋，湘江北去，橘子洲头。看万山红遍，层林尽染；漫江碧透，百舸争流。鹰击长空，鱼翔浅底，万类霜天竞自由。怅寥廓，问苍茫大地，谁主沉浮？携来百侣曾游，忆往昔峥嵘岁月稠。恰同学少年，风华正茂；书生意气，挥斥方遒。指点江山，激扬文字，粪土当年万户侯。曾记否，到中流击水，浪遏飞舟？\n\n> 大江歌罢掉头东，邃密群科济世穷。面壁十年图破壁，难酬蹈海亦英雄。\n\n![](https://pic2.zhimg.com/v2-f04cb5d37f34536438c6eca9e7a6a0c1_b.png)​​​​​​​"
		},
		{
			"post_id": 1,
			"title": "经济分析类文章的收藏",
			"date_published": 1433033779.604,
			"body": "只是用来防止被删除，保存些帖子。"
		}
	]
}