{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "поддержка i2p в zeronet???",
			"body": "когда можно ожидать??????",
			"added": 1502730907
		}
	],
	"topic_vote": {
		"1_1An9UNrB7u4qRJkvjSAh5tASddLFYhB6Zk": 1,
		"1_12GT1osXqqpRv4XDNn8MVeftZG8Tndxs8U": 1,
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1,
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1An9UNrB7u4qRJkvjSAh5tASddLFYhB6Zk": [
			{
				"comment_id": 1,
				"body": "для тех кто не в курсе\n\nhttp://lurkmore.to/I2P\n\nI2P (айтупи, рус. «Проект Невидимый Интернет») — средство, позволяющее ежедневно водить копирастам, спецслужбам и прочим пидорам хуём по губам. Одно лишь упоминание этого чудо-средства заставляет их срать кровавыми кирпичами в количествах, достаточных для постройки новой дурки для РАО, RIAA & MPAA сотоварищи.\nПредставляет собой анонимную, самоорганизующуюся, распределённую и опенсорсную децентрализованную сеть. Конечно, за этими красивыми словами скрывается всего лишь связка туннелей, передающих данные через Интернет.\n\nКак и подобает любой анонимной сети, I2P децентрализована. В сети нет DNS, вместо них используют так называемые адресные книги, которые, подобно торренту, постоянно автоматически обновляются у всех клиентов от других клиентов. В них идёт сопоставление названия сайта или другого ресурса, известного как «http://имя_сайта.i2p», с его фактическим адресом (открытым криптографическим ключом). Вместо IP-адресов во всей сети используются открытые криптографические ключи, не имеющие абсолютно никакой логической связи с реальными компьютерами. Свой открытый криптографический ключ можно даже отослать заказным письмом всем копирастам, не забыв при этом распечатать в цвете немытый хер формата А1 и вложить в конверт, так как даже зная эти ключи, невозможно определить местоположение не только пользователей, но и серверов. ВООБЩЕ. Именно поэтому I2P нельзя отключить, отфильтровать или заблокировать. Она способна работать, даже если в сети останется всего 3,5 анонимуса.\n\nСеть проектировалась с расчетом на то, что каждый компьютер в ней принадлежит копирастам и следит за вами, собирая все пакеты снифферами и прочими примочками, поэтому для противодействия был введен ряд активных мер (например, таких как: Чесночная маршрутизация, многослойное шифрование, односторонние туннели, расхождение шифрованных пакетов по нескольким разным туннелям и так далее). Для дополнительной защиты каждый пакет шифруется по самое нехочу. В каждый пакет дописывается рандомное количество рандомных байт, после чего пакет подвергается сквозному, чесночному, туннельному, а также шифрованию транспортного уровня с использованием over 9000 алгоритмов:\n256 бит AES усиленный режим CBC с PKCS#5;\n2048 бит Схема Эль-Гамаля;\n1024 бит DSA;\n2048 бит Алгоритм Диффи — Хеллмана;\n256 бит HMAC — алгоритм проверки целостности сообщений;\nХэширование SHA256.\nШифрование всего твоего прона с лолями происходит на начальном компьютере, а расшифровка на конечном, и наоборот — всё, что ты качаешь, шифруется на сервере, а расшифровывается у тебя, поэтому всякие кулхацкеры не в состоянии перехватить незашифрованную информацию, как это почти всегда делают в TORе. К тому же даже перехваченный и расшифрованый пакет не несет почти никакой полезной информации, так как хуй поймешь, чей он и кому предназначается. До кучи, входящие и исходящие данные идут по разным туннелям, а данные одного типа дополнительно разделяются по нескольким туннелям. Криптологический пиздец, короче.\nВесь трафик идёт по специальным шифрованным туннелям, направление которых через каждые десять минут рандомно меняется. Обычно создаётся несколько односторонних шифрованных туннелей, и пакеты расходятся по ним в произвольном порядке (исходящие через одну группу туннелей, а входящие через другую), направление туннелей же самое разнообразное.\n\nТеперь все аноны, параноики, и лично ты могут спать спокойно: наконец-то создана сеть, где никто никого и никогда не найдёт. Однако, мой маленький друг, даже I2P не гарантирует АБСОЛЮТНОЙ защиты. Java, JavaScript, Silverlight и Flash ещё никто не отменял. Для Фуррифокса юзаем QuickJava (иногда приходится вырубать жабу вручную), Java Script Options, FlashBlock и NoScript.",
				"added": 1502731024
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "watashi ga",
				"added": 1502731137
			}
		],
		"1_1897Z18vn3cNX8RPzCSyg5ffqDRTbuCwty": [
			{
				"comment_id": 3,
				"body": "+",
				"added": 1502731155
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 4,
				"body": "baka   > [murka](#comment_23_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Чтобы тебя позлить. Фан без причины уныл, а значимых причин в этом мире нет. Смирись.",
				"added": 1502731441
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 5,
				"body": "> [grimi](#comment_1_1NgtYwuvjdzBhq5pCg9mTzo63APBBS6V46): главное что детские порно сайты еще пашут\n\nlink?",
				"added": 1502801233
			}
		]
	},
	"comment_vote": {
		"1_1An9UNrB7u4qRJkvjSAh5tASddLFYhB6Zk": 1,
		"3_1An9UNrB7u4qRJkvjSAh5tASddLFYhB6Zk": 1
	}
}