{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1580479193_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 1,
				"body": "Ciekawy tekst, przeczytałem wszystkie. Super napisane. Masz moje poparcie. Trzymam kciuki.",
				"added": 1580683545
			}
		],
		"1581827701_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 2,
				"body": "Dokładam, swoją pomoc. Nie-wiedziałem, że to pomaga. Ok. Jest już zrobione. Faktycznie to lepiej działa.",
				"added": 1581998409
			}
		],
		"1577974129_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 3,
				"body": "To jest dobru pomysł; Ta poczta jest dobra. Warta zwiększenia limitu. \nTylko trochę mało kontaktów.",
				"added": 1582874526
			}
		],
		"1595401739_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 4,
				"body": "Trzeba to sprawdzić? Co to za ustrojstwo? I jakie ma haki?",
				"added": 1595403951
			},
			{
				"comment_id": 5,
				"body": "To nie jest alternatywa dla ZeroNeta. Dlaczego? Bo posiada serwer i chce moje dane ; Adres poczty mailowej. Kolego wypchaj się tym wynalazkiem. Ja chciałbym być w miarę anonimowy + wrzucone materiały / nieśmiertelne /. Nie wiem kim jesteś? ale propozycja jest wypaczona. Ja nie skorzystam z tego wynalazku; pozostanę przy ZeroNecie. Inwalida, bo inwalida; ale wolny od Cenzury. / no może sobie cenzura poczytać w w wolnych chwilach z pożytkiem dla siebie /.",
				"added": 1595405099
			},
			{
				"comment_id": 6,
				"body": "Panie kolego, nie jest ważne co znamy czy nie znamy? Ważne jest doświadczenie życiowe; a to tylko oznacza, że koniokrady zawsze takie byli. To znaczy, moje jest dobre; a twoje już nie koniecznie. Przecież nie o to chodzi. powinna być wolność wypowiedzi. Nie można pozwolić na monopol na prawdę. Zero, jest dobrą odskocznią od tego zakłamania. ( czytaj usmańskiego ).  jest to dobre określenie na ten typ urody. A temat google, jest dawno skazany na banicję. Nikt rozsądny tego już nie używa. A jeśli używa? to znaczy coś z nim jest nie tak. Google szpieguje; jeśli je używasz? A jeśli nie używasz to nie może ciebie szpiegować. Dla googli są alternatywy, i to całkiem poważne. Jeśli o tym nic nie wiesz? To raczej ty musisz popatrzeć w lustro. Tworzenie czegoś przez ludzi, nie upoważnia że to jest dobre? Przykład; \"UBUNTU\"- stworzyli ludzie, drudzy ludzie kupili, \" Firma - Canonikal. I z dobrego produktu mamy replikę  widowsa. Jak widzę, to kolega w informatyce, też nie jest Orzeł.",
				"added": 1595505800
			}
		],
		"1611351944_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 7,
				"body": "Dawno mnie tutaj nie było, widzę duże zmiany na forum i zeronecie. Gdzie się podziało to całe towarzystwo? Ja byłem na wyjeździe, komputer w domu pozostał, więc nie zaglądałem dość długo. Widzę, że tematyka się zmieniła, nareszcie jakieś konkrety. Sporo tego się zebrało, muszę to wszystko przeczytać.\nSiema.",
				"added": 1611475910
			}
		],
		"1612224384_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 8,
				"body": "To jest jedna wielka  rodzina malwersantów. KONIOKRADY-  jak ktoś tutaj zauważył.",
				"added": 1612270483
			},
			{
				"comment_id": 10,
				"body": "Jest olbrzymie zacofanie w samodzielnym myśleniu; to jest przyczyną , że mogą tak działać. Żeby to zmienić? to trzeba ludzi przestawić na inny tor myślowy. A to trudna sprawa, prawie , że niemożliwa.",
				"added": 1613580181
			}
		],
		"1613302394_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 9,
				"body": "Niezależne media nie istnieją; wszystkie są zależne, i przekupione. Wysługują się komuś.",
				"added": 1613494267
			}
		],
		"1621774948_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 11,
				"body": "Protest song.",
				"added": 1621788730
			}
		],
		"1621674323_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 12,
				"body": "Dobre, słusznie im się to należało, za ich pychę wobec ludności miejscowej.\ntrzymać się.",
				"added": 1622405453
			}
		],
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 13,
				"body": "To jest prawda, podaj dalej.",
				"added": 1622832116
			}
		]
	},
	"comment_vote": {
		"9_1JBU6gqPYoNmpeTw9JMurELPAFxCQ3CsmC": 1
	}
}