{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Para ver os erros na zeronet este é o caminho para acessar o console de erros.",
			"body": "para ver os erros na zeronet este é o caminho para acessar o console de erros. http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Home#ZeroNet:Console",
			"added": 1575124056
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "> [caropc10](#comment_14_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL): The Patriot Extended Cut(O Patriota) 2000 Leghttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1574776617_18QeVKqxoh2nh8HK83T44dyTQ7YACNfNaU\n> Sinopse: Benjamin Martin (Mel Gibson) foi o herói de um violento conflito. Desde o término da guerra ele renunciou à luta, vivendo em paz com sua família. Quando os ingleses levam a guerra da independência americana para dentro de sua casa, Benjamin não vê outra saída a não ser pegar nas armas novamente, desta vez acompanhado por seu filho idealista (Heath Ledger), e liderar uma brava rebelião em uma batalha contra o implacável e equipado exército britânico.\n\neste aqui está funcionando o outro usuário onde estava este filme eu deletei TODOS os arquivos, pois tinha deixado a configuração do site de uma forma, que ficou ruim e o arquivo data.json do usuário ficou maior que 2 mega e poucos vinham os arquivos, dai preferi voltar a trás e desfazer está configuração e deixar limitado a 2mega este arquivo, para TODOS poderem ver o, e dai vou ter que fazer mais usuários, mas o mais importante é que vai ficar visivel os arquivos.\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1575069925_1JHioSuWMGxzyyZCWtapbQjBH8kpaq6kGM\n\nUSem o site, NÃO VOU DELETAR, conteudo de ninguém e nem administrar nada neste sentido, só vou tentar implementar melhorias no mesmo para que CADA UM possa moderar o seu próprio conteudo e bloquear usuários e conteudos indesejados.\n\nTudo individualmente.",
				"added": 1575123709
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "The fantastic Mr Feynman (O Fantástico Sr Feynman) Leg (fisica) (richard feynman)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1567815268_19PrRuQdMAHo7D4LxXSCER4FxHrsyYJes",
				"added": 1575123776
			}
		]
	},
	"comment_vote": {}
}