{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 1,
				"body": "> [steelmemes](#comment_26_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): What version of Zeronet are you guys running? I had nothing but problems when I updated to 0.7 (first version to use python 3) from the Zeronet site for a few hours. I downgraded back to 0.6.5 (uses python 2) and everything's been working smoothly since. I even had a clean transition to a ZeroID. Downgrading might be worth trying if you've exhausted all other options.\n\nI'm on 0.6.5 and experiencing the same issue",
				"added": 1565398146
			},
			{
				"comment_id": 2,
				"body": "try clicking on \"Check files\" on the right hand side of 08chan's listing in the Sites section of your ZeroHello sidebar.  Seems to have forced an update for me - 'updating' number refreshed, reduced greatly and went down to 0 over a couple of mins.",
				"added": 1565401374
			},
			{
				"comment_id": 3,
				"body": "> [undisclosed](#comment_8_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Test posting is only showing \"Processing post... Please wait.\"  It does appear functioning for some anons though.  Catalog seems way to minimal with seven threads and a total of 36 replies.  That would be over the past 20+ hours now.  Suppose there are only a fraction of legitimate peers, out of a large number induced during the spam attack?  If I can only connect with five at a time, how can I tell with each attempt if these are changing?\n\nSorry - not much to add beyond what I posted...I don't have much in the catalog either, but really don't understand enough about zeronet to give an informed reply.",
				"added": 1565403321
			}
		],
		"1565404786_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 4,
				"body": "wut?",
				"added": 1565404814
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 5,
				"body": "I think there's 2 things that will hold ZeroNet back from wide adoption (apart from the propoganda):\n\n1. Bit of learning cliff for most to get it running\n2. The storage space to keep it running if/once it really takes off\n\nI've only been kicking the tires here for a couple of days, but in my limited understanding, to make ZeroNet robust most users need to maintain full copies of the sites...probably not really a big problem with text based sites, but for image boards or video sites it will quickly get pretty large...",
				"added": 1565405036
			},
			{
				"comment_id": 6,
				"body": "> [bustooni](#comment_5_13v3xsu1y5pTbf3ZydiKYCZUhCFqdAs2NY): I think there's 2 things that will hold ZeroNet back from wide adoption (apart from the propoganda): [...]\n\nShould have added - love the idea and principle though.  Need to find ways to get this out to a wider audience and lessen the leap to get up and running for most.",
				"added": 1565405079
			}
		]
	},
	"comment_vote": {
		"18_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"16_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1
	}
}