{
	"next_quote_id": 12,
	"quote": [
		{
			"quote_id": 1,
			"body": "Well nothing’s 100% effective, that’s why teenagers have babies.",
			"by": "Gaby",
			"work": "Just Between Us",
			"date_added": 1457021971308
		},
		{
			"quote_id": 2,
			"body": "Necrophilia would be my second choice for what should be done with my corpse, the first being scientific or medical use.\nOnce my dead body is no longer of any use to me, it may as well be of some use to someone.",
			"by": "Richard Stallman",
			"work": "",
			"date_added": 1458035768424
		},
		{
			"quote_id": 3,
			"body": "The Adobe flash plug-in is non-free software, and people should not install it, or suggest installing it, or even tell people it exists. ",
			"by": "Richard Matthew Stallman",
			"work": "",
			"date_added": 1458035954168
		},
		{
			"quote_id": 4,
			"body": "Friends share music with each other, they don't allow themselves to be divided by a system that says that nobody is supposed to have copies. ",
			"by": "Richard Matthew Stallman",
			"work": "",
			"date_added": 1458036001366
		},
		{
			"quote_id": 5,
			"body": "Why is it bad to use an unauthorized copy of a proprietary program? Because it’s proprietary! So an unauthorized copy is almost as nasty as an authorized copy of the same program. They are both nasty because they are proprietary.",
			"by": "Richard Matthew Stallman",
			"work": "",
			"date_added": 1458036057485
		},
		{
			"quote_id": 6,
			"body": "I don't ask for money. I don't ask for sexual favors. I don't ask for access to the hardware you design and sell. I just ask for the thing I gave you: source code that I can use myself. ",
			"by": "Linus Benedict Torvalds",
			"work": "",
			"date_added": 1458036327809
		},
		{
			"quote_id": 7,
			"body": "EFI is this other Intel brain-damage (the first one being ACPI). ",
			"by": "Linus Benedict Torvalds",
			"work": "",
			"date_added": 1458036544114
		},
		{
			"quote_id": 8,
			"body": "You know you're brilliant, but maybe you'd like to understand what you did 2 weeks from now. ",
			"by": "Linus Benedict Torvalds",
			"work": "",
			"date_added": 1458036632908
		},
		{
			"quote_id": 9,
			"body": "If you still don't like it, that's OK: that's why I'm boss. I simply know better than you do. ",
			"by": "Linus Benedict Torvalds",
			"work": "",
			"date_added": 1458036766141
		},
		{
			"quote_id": 10,
			"body": " Their decision to make software proprietary is a decision to stay out of our community. Being in our community means joining in cooperation with us; we cannot \"bring them into our community\" if they don't want to join.",
			"by": "Richard Matthew Stallman",
			"work": "",
			"date_added": 1458037484041
		},
		{
			"quote_id": 11,
			"body": "Let's put it this way: if you need to ask a lawyer whether what you do is \"right\" or not, you are morally corrupt. Let's not go there. We don't base our morality on law. ",
			"by": "Linus Benedict Torvalds",
			"work": "",
			"date_added": 1458037552598
		}
	],
	"quote_vote": {
		"1-1CkbnawyTYqS8nWx3nFgK4go6H3kAJ3AWz": 1,
		"3-17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": 1,
		"13-13KqD3BoaRMudEG5QU2fnGLkSVx8qDXKof": 1,
		"16-13KqD3BoaRMudEG5QU2fnGLkSVx8qDXKof": 1,
		"23-13KqD3BoaRMudEG5QU2fnGLkSVx8qDXKof": 1,
		"3-13KqD3BoaRMudEG5QU2fnGLkSVx8qDXKof": 1,
		"1-12Zch2rTKPeMTfUdUUfxeFxYFptJYqLr85": 1
	}
}