{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1571930824,
			"title": "BBC fights censorship by launching news site on the dark web.",
			"body": "The BBC is fighting back against such restrictions by making a mirror of its international news website available on the dark web, where it can be viewed using the Tor browser.\n\nThe BBC says its content available on the Tor site includes foreign language services such as BBC Arabic, BBC Persian and BBC Russian, but does not include access to the BBC iPlayer streaming service.\n\nIn its announcement, the organization specifically named China, Iran and Vietnam as countries in which BBC News content has been blocked. It also said that providing a way for audiences to access its content even where it was restricted was \"in line with the BBC World Service mission to provide trusted news around the world.\"\n\nTor users can visit the URL bbcnewsv2vjtpsuy.onion\n\nSource: BBC",
			"added": 1571930823
		}
	],
	"topic_vote": {
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 1,
				"body": "cp?",
				"added": 1571933759
			}
		],
		"1575523101_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": "looks like none of the apps are safe, it shows that they are able to break in to the other apps as well.\n\nCIA hackers are able to bypass encryption of applications including WhatsApp, Signal, Telegram and Confide by breaking into smartphones “that they run on and collecting audio and message traffic before encryption is applied,” WikiLeaks said in its analysis of the material.",
				"added": 1575559235
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 3,
				"body": "GoG... DRM Free and Linux support on some games.",
				"added": 1582903236
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 4,
				"body": "For the love of money is the root of all evil...",
				"added": 1582903591
			}
		]
	},
	"comment_vote": {}
}