{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "http://schaebel.de/allgemein/peter-scholl-latour-das-ende-der-weissen-weltherrschaft-teil-1-nostalgie-und-hoehenflug/009257/",
			"post_id": 4,
			"date_added": 1538496831
		},
		{
			"comment_id": 2,
			"body": "Erstes Urteil für die Privatsphäre der Unterschriftengeber\n\nDiese Frage kann viele Aspekte beinhalten:\n\n    Ist die Webseite auf der ich unterschreibe sicher (z.B. gegenüber dem \"Gegner der Petition\")?\n    Gibt sie meine Daten an Unternehmen zu Werbezwecken weiter?\n    Werden die Unterschriften bei der Übergabe der Petition übergeben oder nur eine notarielle Bestätigung über die Anzahl?\n    Können Sicherheitsbehörden oder sogar der \"Gegner der Petition\" Zugang zu den Daten der Unterschreibenden erlangen?\n\nDie ersten drei Punkte sollte man vor einer Unterschrift mit den Datenschutzhinweisen auf den jeweiligen Webseiten zu klären versuchen. Zu dem letzten Punkt gibt es seit letzter Woche ein positives Gerichtsurteil. Monsanto hatte vor einem New Yorker Gericht gegen eine Petition von Avaaz geklagt und die  Herausgabe aller Daten von Avaaz verlangt, also alle Unterschriften und die dazu gehörenden E-Mail Adressen und weitere Kommunikation zwischen Avaaz und den Unterstützern der Petition. Dazu schreibt Avaaz:\n\nDiese gerichtliche Anordnung hatte uns einen richtigen Schrecken eingejagt. Es hätte uns Monate Arbeit und eine Unmenge an Geld gekostet, alles herauszusuchen und auszuhändigen, was unser Team JEMALS über Monsanto geschrieben oder gesagt hat -- einschließlich der E-Mail-Adressen und Identitäten unserer Mitglieder, die im Rahmen von Aktionen Nachrichten an Regierungsvertreterinnen zum Thema Monsanto geschrieben haben.\n\nDas Problem bei US-Gerichten ist, dass solche Gesuche normalerweise automatsich bewilligt werden, weil angenommen wird, dass der Zugang zu mehr Informationen gleich mehr Gerechtigkeit bedeutet. Um eine solche Anordnung also zu stoppen sind in den USA erstmal ein Haufen Dollars auf den Tisch zu legen, um einen guten Anwalt zu finden.\n\nDank der Spendenbereitschaft der Avaaz Community gelang es 200.000 Spenden einzuwerben und damit den besten Anwalt auf diesem Gebiet anzuheuern. Andrew Celli hatte solche Fälle schon früher angenommen und meist gewonnen. Sein Argumentation hat die gerichtliche Anordnung von Monsanto auf großartige Art und Weise zunichte gemacht. Das Dokument ist hier (in englisch) zu lesen. Auch Monsanto hat Top-Anwälte eingeflogen und Avaaz schreibt dazu:\n\nMonsanto hat einen Top-Anwalt eingeflogen: Einer, der vor Gericht schon alles verteidigt hat -- von Asbest über Blei bis hin zu Arsen. Aber dank unseren Darstellungen und den starken mündlichen Argumenten war der Richter überzeugt und ging den unglaublich seltenen Schritt: Er hat die GESAMTE gerichtliche Anordnung abgewiesen!!! Normalerweise wird eine Anordnung auf einige begründete Punkte eingeschränkt -- aber der Richter konnte in Monsantos Behauptungen über Avaaz keine vernünftigen Punkte finden!\n\nDie Argumentation des Richters ist beeindruckend und deckt sich (erstaunlicherweise) mit dem europäischen Verständnis von Privatsphäre und Datenschutz. Er sagte, dass die von Monsanto verlangte gerichtliche Anordnung eine \"gewaltig abschreckende Wirkung\" hätte, und erklärte: \"Kein Mitglied [Unterstützer der Petition] möchte, dass seine Privatsphäre verletzt und seine Aktivitäten öffentlich gemacht werden\". Er hielt Monsanto einen Vortrag über Demokratie und freie Meinungsäußerung.\n\nDiese Argumente mögen für uns selbstverständlich sein, sind aber ein Novum in Streitigkeiten unter Beteiligung von großen Konzernen, denn dort wird in der Regel versucht jeglichen Bezug zu gesellschaftlichen Fragen oder der Politik herauszuhalten und nur formal juristisch argumentiert. Der Streit ist mit diesem Urteil nicht beendet, denn Monsanto kann immer noch in Berufung gehen.\n\nMehr dazu bei https://secure.avaaz.org/Avaaz_vs_Monsanto",
			"post_id": 4,
			"date_added": 1538496938
		},
		{
			"comment_id": 3,
			"body": "> [swastika](#comment_1_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): Wo ist das \"Infos und News\"?\n\nsCHAU NOCH MAL REIN . DIE ERSTEN SIND DA !",
			"post_id": 4,
			"date_added": 1538497090
		},
		{
			"comment_id": 4,
			"body": "Kirche ist eingetragene Firma. Hier habe ich ein ganz dramtisches Beispiel entdeckt !\nhttp://127.0.0.1:43110/1EvWgmT2VkgN5wK4BrktHYTxKkZqVWtwA1/\n",
			"post_id": 4,
			"date_added": 1538498109
		},
		{
			"comment_id": 5,
			"body": "Ueberwachsstaat BRD Technik\nMan muss nur Siri überreden\n\nZumindest kann man Zugriff auf Fotos und Kontakte bekommen, obwohl die Geräte eigentlich gesperrt sind. Man ann nicht damit telefonieren oder chatten aber die persönlichen Daten betrachten. Der Youtuber Jose Rodriguez zeigt in zwei Videos wie es geht.\n\nInsgesamt sind 37 Schritte notwendig, um an die Daten zu kommen und sollte Apples biometrische Anmeldeoption Face ID aktiviert sein, dann muss auch noch die Kamera abgeklebt werden. Für den Angriff muss man natürlich das Gerät in der Hand halten. Erstaunlicherweise funktioniert der Angriff auch mit Apples neuestem iPhone XS sowie dem aktuellen Betriebssystem iOS 12 und der Betaversion von iOS 12.1.\n\nAber es gibt einen Schutz , man sollte die (neugierige) Sprachassistentin Siri bei gesperrtem Bildschirm deaktiviert haben. Aber mit Siri funktioniert es immer noch, obwohl Rodriguez bereits 2016 die Sprachasasistentin Siri dazu brachte ihm Zugriff auf Fotos von Apple Geräten zu gewähren.\n",
			"post_id": 4,
			"date_added": 1538498215
		},
		{
			"comment_id": 6,
			"body": "\nNach Berliner Zirkus wenigstens in NRW zurückgestutzt\n\nNach rotem Teppich, militärischer Ehrenbezeugung und Gala-Dinner in Berlin wurde der Besuch des Despoten aus der Türkei wenigstens in NRW auf ein kleineres Maß zurückgestutzt. Bei seinem Besuch in Köln sollte es einen Empfang durch die NRW Landesregierung, namentlich Ministerpräsident Laschet, geben.\n\nMit Freude haben wir von der Absage des Treffens im Schloss Wahn gehört, welches zur Universität Köln gehört. Der AStA der Uni Köln schrieb uns dazu gestern Abend:\nKölner AStA erleichtert über geplatztes Treffen von Erdoğan und Laschet im  Schloss Wahn\n\nDer Allgemeine Studierendenausschuss der Universität zu  Köln (AStA) ist über die Absage des Treffens zwischen Ministerpräsident  Armin Laschet und dem türkischen Präsidenten Recep Tayyip Erdoğan im  Schloss Wahn erleichtert. Medienberichten zufolge sollte das Treffen im  Schloss Wahn stattfinden, das der Universität zur Nutzung überlassen wurde.  \n\nDazu sagte der AStA-Vorsitzende Theodor Jost: “Ich war geschockt als ich  erfuhr, dass das Treffen im Schloss Wahn stattfinden sollte. Es ist  enttäuschend, dass die Universität dabei dem Wunsch des Landes anscheinend  kommentarlos gefolgt ist, das Schloss zur Verfügung zu stellen.” \n\nEiner unserer Kölner Wissenschaftler, Sharo Garip, wurde monatelang in der Türkei  festgehalten, da er den Aufruf “Akademiker für den Frieden” unterzeichnet  hatte. Der Aufruf wendet sich gegen Menschenrechts- und  Völkerrechtsverletzungen durch das militärische Vorgehen der türkischen  Regierung in den kurdischen Gebieten. Der Senat der Universität zu Köln  hatte die kurzzeitige Inhaftierung und die Ausreisesperre verurteilt und  Druck auf das Auswärtige Amt aufgebaut, damit Garip ausreisen kann. \n\n“Es ist ein Schlag ins Gesicht aller von diesem Regime Verfolgten, dass die  Universität Erdoğan in ihre Räumlichkeiten einlädt. Zu den Menschen an der Uni Köln zählt auch  Sharo Garip, über dessen Rückkehr hier jeder erleichtert war. Es ist ein  Hohn, dass ausgerechnet derjenige, auf dessen Betreiben hin Sharo Garip  verhaftet wurde, nun auf Einladung der NRW-Landesregierung in der  Universität zu Köln eine Plattform bekommen sollte.\n\nNicht nur Garip,  sondern viele Wissenschaftler*innen und Journalist*innen leiden unter  Erdoğan, zahlreiche sind noch heute inhaftiert. Wenn Erdoğan die  Universität zu Köln schon besucht, sollte er Vorträge zu Ethik und  Demokratie hören, anstatt den roten Teppich eines Schlosses ausgerollt zu  bekommen.” schließt Theodor Jost ab. \n\nWir können die Studierenden der Uni Köln zu dieser Entwicklung nur gratulieren. \n\nMehr dazu bei http://www.asta.uni-koeln.de/",
			"post_id": 4,
			"date_added": 1538498456
		},
		{
			"comment_id": 7,
			"body": "Der amerikansiche Botschter bestaetigt BRD ist Besatzungsverwaltung !\nhttps://www.youtube.com/watch?v=N3Y5ktKqDiw",
			"post_id": 4,
			"date_added": 1538498744
		},
		{
			"comment_id": 8,
			"body": "Osnabruecker Lutherkirche fuer Islam !  https://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n",
			"post_id": 4,
			"date_added": 1538499007
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}