{
	"title": "Tanzpol.Org\n",
	"description": "Политика, экономика, социум. Филиал  форумов Tanzpol.Org\n",
	"links": "*   [Tanzpol.Org](http://www.tanzpol.org)\n*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n- [СССР-Россия. 1988-2018](/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/)",
	"next_post_id": 34,
	"demo": false,
	"modified": 1543989661,
	"post": [
		{
			"post_id": 33,
			"title": "Ещё немного закручивания гаек",
			"date_published": 1543989322.288,
			"body": "Казалось бы, при чём тут политика?\n\n![soap-advertisement-1949.jpg (640x850)](data/img/post_33_soap-advertisement-1949.jpg)\n\n_Реклама мыла, 1949\\. Фото Ruzzie Green._\n\nУвы, уже и в Tumblr такие фотки банят. Оно нарушает новое правило ToS.\n\nДальше [форвард из Телеграма](https://t.me/NiiBeth/1077):\n\n---\n\n_[Переслано из Женская логика]_\n\nЯ сейчас в растрепанных чувствах, не ожидала, что на меня это так повлияет, но мне правда очень грустно и тревожно. Вчера тамблер объявил о своей новой политике.\n\nИстория такая. Некоторое время приложение Тамблера выкинули из Эпп-стора, потому что они нашли среди контента детское порно. И вот Тамблер думал-думал, что делать (реагировать, блин, на многолетние жалобы? Нанять людей? Хммм, нет) и придумал.\n\nОни запретили весь adult контент вообще. С 17 декабря запрет вступает в действие. Со вчерашнего дня роботы начали помечать посты как \"деликатное содержимое\" (слово-то какое).\n\nВыглядит это так. На почту тебе не пишут, ты просто листаешь блог и обнаруживаешь, что твоя коллекция минералов, фото котика, рисунок одетого человека, не занимающегося сексом, помечены красной плашкой, под удаление. Почему так происходит? Потому что секс ищут роботы. Это реально какое-то восстание машин, люди уже коллекции составляют, у кого роботы отметили более бредовую и менее относящуюся к сексу запись.\n\nКонечно, отметку можно оспорить (сначала ее надо заметить). В своих новых правилах Тамблер уже успел накосячить, так что одни абзацы противоречат другим. Плюс они там ввернули потрясающий оборот female-presenting nipple! То есть соски, подающиеся как женские. Вот такие соски нельзя показывать. Что тоже, конечно, породило и тонну юмора, и массу вопросов.\n\nПаралелльно юзеры стали замечать эффект шедоубана. Шедоубан - это ограничение контента, о котором тебе вообще не сообщают, просто френды не видят твои записи, даже если заходят непосредственно на твою страницу. Раньше уже были подозрения, что Тамблер банит таким образом записи, например, с тегом \"хронические заболевания\". Ну, не нравится им что-то.\n\nЧто происходит в данный момент? В данный момент, если в поиске тамблера набрать слово sex, вам напишут, что ничего нет и предложат поискать чего другого. Но если вы, например, захотите найти нацистскую пропаганду и напишите какое-нибудь там White Power - это на здоровье, это Эппл и Яху (собственники Тамблера), видимо,\n\nЧто происходит конкретно со мной? Ну, у меня процентов 80 с трудом собранных англоязычных подписчиков разбегаются, кто куда. Кто в твиттер, кто в дримвидз.\n\nЭто было моим реально большим достижением - начать писать по-английски, общаться, сочинять рассказы - и я вижу как это все рассыпается на моих глазах. Офигенно позитивная и дружелюбная среда! А ведь именно это Тамблер обещал в своих новых правилах - мол, запретим порно и будет у нас позитивно и дружелюбно. А любители порно-контента могут валить, таких сайтов полно, написали они.\n\nПолно - да не очень. Сразу ясно, что о собственной аудитории они ничего не знают. Это уникальное место, где как раз можно было свалить от навязанного порно-стандарта, от фэтфобии, лукизма, дискриминации ЛГБТ+ людей.\n\nЭто было уникальное культурное явление. Я печально добавляю старых френдов на твиттере, в инстаграме. Но я не знаю другой такой социальной сети, где можно написать свою идею, а потом в реблоге ее превратят в рассказ, а кто-то еще нарисует иллюстацию, сделает фотоколлаж, добавит видео, список песен, сцену из лего, гифсет, бог знает еще, какие творческие формы, которым и названия раньше не было...\n\nБудет очень смешно, конечно, если в аппстор их в итоге не вернут. Потому что реально справиться с детским порно и порноботами они никогда не могли. А прилетает почему-то людям с ограниченным здоровьем, небинарным, нищим, людям с психическими заболеваниями и сторонникам секс-просвещения.\n\nОсобенно меня поразило название их объявления - \"Более позитивный Тамблер\". Видимо, женские сиськи очень негативны, да.\n\n(Отдельные проклятья Эпплу)."
		},
		{
			"post_id": 32,
			"title": "Доля нищих по странам мира",
			"date_published": 1542124841.255,
			"body": "![poverty-world-map-874a.jpg (1200x743)](data/img/post_32_poverty-world-map-874a.jpg)\n\nПроцент людей, живущих менее чем на 1,9$ в день. Такой уровень трат Всемирный банк оценивает как «крайнюю степень нищеты». \n\nИсточник: https://howmuch.net/articles/people-living-in-extreme-poverty-2018"
		},
		{
			"post_id": 31,
			"title": "Космический рынок",
			"date_published": 1542116515.776,
			"body": "Рынок спутников на ближайшее десятилетие должен составить 3300 штук и сумму в $284 млрд – об этом пишет консалтинговая фирма Euroconsult в 21-й версии своей отчёта.\n\nСогласно их оценкам 330 спутников с весом более 50 кг будет запускаться ежегодно в период 2018-2027 годов. Предполагается что за этот период будет запущено 40 спутниковых созвездий на 2300 спутников на низкие и средние орбиты для выполнения задач связи, навигации, дистанционного зондирования Земли, метеорологии и сбора данных с наземных датчиков.\n\nВсего 3300 спутников должны будут создать рынок в $284 млрд – на 25% больше, чем за предыдущее десятилетие. В плане денежного потока государства должны остаться главным заказчиком, хотя по числу спутников они должны уступить коммерческому рынку – по оценкам, около 70 государств создадут заказ на более чем 1300 спутников. При этом 85% от этого рынка должна создать десятка лидирующих стран: США, Россия, Китай, Япония, Индия и 5 ведущих стран Европы.\n\nНа коммерческом рынке, по их мнению, должно работать около 50 компаний, с общим рынком на 2 тысячи спутников. При этом 1700 из них должны приходиться на 22 коммерческих созвездия, из которых целых 70% спутников должно прийтись всего на одно созвездие.\n\nРынок геостационарных спутников связи и радиовещания должен остаться весьма большим: на него должно приходиться почти 50% от коммерческого рынка, который составит $70 млрд. Спутники связи должны составить 25%, а дистанционного зондирования – ещё 11% от общей цифры в $284 млрд.\n\n- http://www.balancer.ru/g/p6865069"
		},
		{
			"post_id": 30,
			"title": "В Британии оскорбления в соцсетях могут признать уголовным преступлением",
			"date_published": 1542115523.305,
			"body": "_2 ноября, 11:53, [Дарья Бердникова, Хайтек+](https://hightech.plus/2018/11/02/v-britaniya-oskorbleniya-v-socsetyah-mogut-priznat-ugolovnim-prestupleniem)._\n\nСитуацию с онлайн-оскорблениями авторы [доклада](https://www.lawcom.gov.uk/reform-of-the-criminal-law-needed-to-protect-victims-from-online-abuse-says-law-commission/) сравнивают с проблемой домашнего насилия в 1980-е годы. Тогда считалось, что муж и жена должны разрешить свои конфликты между собой, и понадобилось изменить общественное мнение, чтобы этими вопросами занялись суды.\n\nБританское законодательство не успевает за все новыми и новыми вызовами, которые возникают в цифровую эпоху. Например, закон должен защитить людей от [дипфейков](https://hightech.plus/2018/09/03/avtori-uznayushego-dipfeiki-s-tochnostyu-95-algoritma-rasskazali-kak-on-rabotaet), где ИИ заменяет лицо актера в порно на лицо любого человека.\n\nОднако еще больше экспертов волнует тема оскорблений в интернете. Правовая система до сих пор не выработала четкие термины для описания проблем интернет-общения, [отмечает](https://www.theguardian.com/society/2018/nov/01/criminal-law-not-keeping-pace-with-digital-world-report) Guardian. При этом в Великобритании 66% взрослого населения пользуется соцсетями, а среди молодежи доля еще выше — 96%.\n\n> Законодательная комиссия Англии и Уэльса призывает приравнять оскорбления в Сети к оскорблениям в реальной жизни и ввести за это уголовное наказание.\n\nВ то же время надо отразить в законодательстве особенность интернет-общения, в частности — организованную травлю. На это обратила внимание одна из жертв такого поведения: «На единичное оскорбление можно не обращать внимание, но если у вас 500 таких сообщений, 500 человек, которые говорят одно и то же, то вы будете думать по-другому».\n\nВ Великобритании пока только 3% жалоб на злоупотребления в интернете доходят до суда. Не всегда можно определить, когда рассматриваемое выражение — это непопулярная точка зрения или дурная шутка, поясняют эксперты.\n\nТакже современное законодательство должно найти способ защитить тех людей, которые обнаруживают в свободном доступе информацию о своем здоровье или о своем сексуальном поведении.\n\n> Возможно, следует ввести наказания также за опасные онлайн-советы о здоровье и безопасности человека, говорят эксперты.\n\nАмериканский конгрессмен Ро Ханна составил [билль об интернет-правах](https://hightech.plus/2018/10/08/v-ssha-predstavili-pervii-bill-ob-internet-pravah), в котором рассмотрел другие опасности, исходящие от соцсетей. В первую очередь в документе речь идет о необходимости предотвращения утечки информации.\n\nВ ближайшие 20 лет в связи с развитием технологий появятся новые виды преступлений, которые сейчас трудно себе представить. Например, кража сознания, несанкционированное клонирование, нарушение прав нейросети и [другие](https://hightech.plus/2018/10/10/ubiistvennii-seks-s-robotom-i-klonirovanie-na-organi-kakie-prestupleniya-poyavyatsya-v-2040)."
		},
		{
			"post_id": 29,
			"title": "Американского разработчика уволили без ведома начальства. Это сделал робот — и люди не смогли его остановить",
			"date_published": 1542115122.479,
			"body": "_<time>15:00, 20 июня 2018,</time> [Meduza](https://meduza.io/feature/2018/06/20/amerikanskogo-razrabotchika-uvolili-bez-vedoma-nachalstva-eto-sdelal-robot-i-lyudi-ne-smogli-ego-pobedit)._\n\n![Разработчик Ибрагим Диалло и предприниматель Крис Шенг рассказывают о своем стартапе Renly на конференции TechCrunch. 16 мая 2017 года (1280x732)](data/img/post_29_3NcI5kakQsNHyfxY-5rNfg.jpg)\n\n_Разработчик Ибрагим Диалло и предприниматель Крис Шенг рассказывают о своем стартапе Renly на конференции TechCrunch. 16 мая 2017 года. Noam Galai / Tech Crunch / Getty Images_\n\nРазработчик из Калифорнии и сооснователь стартапа Renly Ибрагим Диалло [рассказал](https://idiallo.com/blog/when-a-machine-fired-me) в своем блоге о том, как год назад лишился работы. К тому моменту Диалло, который родился в Египте, а затем выучился на программиста в США, уже восемь месяцев работал в крупной компании (ее название он не разглашает), где с ним заключили контракт на три года. Мужчина пишет, что занимался разработкой программного обеспечения, его работу постоянно хвалили, и все шло отлично — пока однажды утром он не получил странное сообщение от начальника: «Боже мой, с тобой все в порядке?»\n\nДиалло решил, что начальник ошибся адресатом — и не стал перезванивать. В тот же день он не смог попасть на работу: его пропуск на вход в здание не работал. Это мужчину не слишком насторожило, тем более, знакомый охранник впустил его в здание по своей карточке. Диалло обратился в отдел кадров, чтобы выяснить, что случилось — там ему сказали, что «получили странное письмо» по его поводу и пообещали разобраться. Никто не перезвонил, а его рабочий день прошел как обычно.\n\nНа следующий день Диалло не смог попасть на парковку у офиса, пропуск в здание по-прежнему не работал, и программисту снова пришлось просить охранников его впустить. В отделе кадров мужчине пообещали сделать новый пропуск — а пока попросили пользоваться временным. После этого Диалло постепенно стал терять доступ к рабочим программам на компьютере, а его менеджер в панике сообщил, что его учетная запись в системе дезактивирована.\n\nНикто, включая руководство, не понимал, что происходит: мужчину не планировали увольнять и не отдавали такого распоряжения. Дело дошло до главы организации: она велела службе поддержки все починить, заверила Диалло, что все в порядке, но в ответ сама получила письмо с пометкой «Важно», где говорилось, что контракт с Диалло расторгнут.\n\nНа следующий день охрана велела Диалло собрать вещи и покинуть офис; он сидел дома, переписываясь с сотрудниками компании, пытавшимися разобраться в его ситуации. В итоге выяснилось, что его предыдущий менеджер должен был перезаключить контракт с Диалло, когда компанию, где он работал, купила более крупная организация. Так его старый договор истек, а заключить второй все забыли. Система решила, что Диалло больше не работает в компании — и начала блокировать все его аккаунты.\n\nПроблему смогли решить только через три недели — заключив с Диалло абсолютно новый договор и настроив ему все уровни доступа заново. Все это время он не мог работать над многомиллионным проектом, которым занимался, и не получал зарплату. «Система безопасности на работе оказалась всего лишь иллюзией, — пишет разработчик. — Представляю себе, что случилось бы, если бы я допустил в этой компании какой-нибудь настоящий промах. Автоматика может сильно упрощать жизнь в компании, но должны быть способы найти управу на робота, если он ошибется»."
		},
		{
			"post_id": 28,
			"title": "Крупнейшие банки Европы помогли клиентам украсть $63 млрд",
			"date_published": 1540154105,
			"body": "**Крупнейшие банки Европы помогли богатейшим клиентам по всему континенту украсть 55 млрд евро у налогоплательщиков, помогая получать на самом деле не полагающиеся им налоговые вычеты, сообщила группа работавших под прикрытием журналистов.**\n\nИсследование 37 внедренных журналистов из 12-ти стран раскрыло крупнейшую мошенническую схему Европейских банков, которая работала вокруг продажи акций, вовлекая хедж-фонды и крупнейшие международные фирмы, занимающиеся корпоративным правом. В схеме участвовали банки многих европейский стран, как Италия, Франция, Норвегия, Испания, Швеция и Швейцария, но более всего пострадали Бельгия, Дания и Германия.\n\nВ рамках работы под прикрытием группа Cumex Files, журналисты проанализировали более 180 000 документов банков, трейдеров и юридических компаний, а также получили доступ к дополнительной информации от индивидуальных лиц:\n\n* * *\n\n> «Они [секретные документы] показали масштаб, с которым банки и инвесторы могли оформлять возвраты налогов на сделки с акциями, которых на самом деле не было»\n\nТакие финансовые схемы называются «cum-cum», где «cum» означает дивиденды, поясняют журналисты:\n\n> «Местный банк помогает зарубежному инвестору получить налоговый возврат, который им на самом деле не положен. Прибыль делится между участниками»\n\nРазновидностью схемы является также схема «cum-ex» (без дивидендов), при которой трейдеры получают налоговый возврат дважды, а иногда даже и больше раз. Такие схема не просто обнаружить из-за сложной структуры и большого количества участников, а также разниц в регулировании между европейскими странами.\n\nРаботавшие под прикрытием во время расследования журналисты назвали схему «крупнейшим налоговым мошенничеством в истории Европы»:\n\n> «Группа организаторов превратила это в целую кустарную индустрию, от Дубая до Лондона, от Нью-йорка до Дублина, забирая миллиарды евро из карманов европейских налогоплательщиков»\n\nВ расследовании фигурируют имена таких банков, как UBS, BNP Paribas, Barclays, JPMorgan, Meryll Lynch, Banco Santander, Morgan Stanley, Deutsche Bank и SEB.\n\nТакже журналисты отметили, что такие схемы получили распространение во время глобального финансового кризиса 2007-го года, «когда государства спасали банки, снова с помощью средств налогоплательщиков».\n\nПравоохранительные органы Европы начали расследование этого дела, а члены Европейского парламента отметили в заявлении:\n\n> «Налоговое мошенничество – это преступление против общества. Европа не должна и не может допускать такое»\n\n_Источник: [BitNovosti](https://bitnovosti.com/2018/10/21/krupnejshie-banki-evropy-pomogli-klientam-ukrast-63-mlrd/)_"
		},
		{
			"post_id": 27,
			"title": "Гражданство Антарктиды",
			"date_published": 1536778179.737,
			"body": "Многие не знают, что с 2008 года существует ~~международно принятое гражданство~~ Антарктиды. Хотя получить его сложно :)\n\n[https://posobieguru.ru/grazhdanstvo/strany-mira/grazhdanstvo-antarktidy/](https://posobieguru.ru/grazhdanstvo/strany-mira/grazhdanstvo-antarktidy/)\n\n**Update**: **на самом деле, нет.** После выражения сомнений и изучения вопроса, вынужден признать, что это явление уровня «гражданства Асгардии» и продажи участков на Луне :) Не смотря на растиражированность и отсылки на официальность, это частная инициатива.\n\n![photo_2018-09-12_21-36-12.jpg (0x0)](data/img/post_27_photo_2018-09-12_21-36-12.jpg)![photo_2017-02-26_11-14-03.jpg (0x0)](data/img/post_27_photo_2017-02-26_11-14-03.jpg)​​​​​​​"
		},
		{
			"post_id": 26,
			"title": "Старые газеты. «Правда», 29 сентября 1939 г.",
			"date_published": 1536008403.866,
			"body": "_Сохранение из ЖЖ. Оригинал: [https://kojemyakin.livejournal.com/585819.html](https://kojemyakin.livejournal.com/585819.html)_\n\n**Уважаемые друзья!**\n\nНа днях я рассказал о намерении оцифровать наиболее интересные из хранящихся у меня советских газет 1930-60-х годов.\n\nСегодня - первая запись. Передо мной - **номер \"Правды\" за 29 сентября 1939 года.** Номер очень интересный с исторической точки зрения.\n\nВо-первых, в нем дана официальная информация о заключенном днем ранее **Советско-германском договоре о дружбе и границе**, причем с _подробной картой раздела сфер влияния в Польше._ Во-вторых... Впрочем, все по-порядку.\n\n![1939 001](https://ic.pics.livejournal.com/kojemyakin/13959840/220139/220139_original.jpg \"1939 001\")\n\n* * *\n\nДля начала - информационное сообщение о переговорах и текст самого договора:\n\n![Копия 1939 007](https://ic.pics.livejournal.com/kojemyakin/13959840/220349/220349_original.jpg \"Копия 1939 007\")\n\n![1939 007](https://ic.pics.livejournal.com/kojemyakin/13959840/220509/220509_original.jpg \"1939 007\")\n\nА вот и весьма любопытное фото: момент подписания договора. Обратите внимание на хитрую улыбку Сталина. Он словно уже понимает, что в выигрыше останется СССР\n\n![1939 004](https://ic.pics.livejournal.com/kojemyakin/13959840/220845/220845_original.jpg \"1939 004\")\n\nСообщение об обеде у Молотова в честь Риббентропа:\n\n![Копия 1939 002](https://ic.pics.livejournal.com/kojemyakin/13959840/221066/221066_original.jpg \"Копия 1939 002\")\n\nСовместное заявление:\n\n![1939 009](https://ic.pics.livejournal.com/kojemyakin/13959840/221224/221224_original.jpg \"1939 009\")\n\nПисьмо Молотова по поводу советско-германского экономического сотрудничества:\n\n![1939 012](https://ic.pics.livejournal.com/kojemyakin/13959840/221503/221503_original.jpg \"1939 012\")\n\nИ, наконец, карта Польши с линией раздела сфер влияния. А ведь нам твердили антисоветчики, что от советского народа это якобы скрывали!\n\n![1939 015](https://ic.pics.livejournal.com/kojemyakin/13959840/221874/221874_original.jpg \"1939 015\")\n\n_В следующий раз я продолжу выкладывать материалы этого номера \"Правды\". Они будут касаться освобождения Красной Армией Западной Белоруссии и Западной Украины._\n\nTags: [СССР](https://kojemyakin.livejournal.com/tag/%D0%A1%D0%A1%D0%A1%D0%A0), [Сталин](https://kojemyakin.livejournal.com/tag/%D0%A1%D1%82%D0%B0%D0%BB%D0%B8%D0%BD), [Старые газеты](https://kojemyakin.livejournal.com/tag/%D0%A1%D1%82%D0%B0%D1%80%D1%8B%D0%B5%20%D0%B3%D0%B0%D0%B7%D0%B5%D1%82%D1%8B)\n\n![Москва](https://l-userpic.livejournal.com/115949462/13959840)\n\n[![](https://l-stat.livejournal.net/img/userinfo_v8.svg?v=17080?v=271)](https://kojemyakin.livejournal.com/profile)[**kojemyakin**](https://kojemyakin.livejournal.com/)\n\n<abbr title=\"2013-07-19T00:35:00+03:00\">July 19th, 2013</abbr>"
		},
		{
			"post_id": 25,
			"title": "В настоящее время сразу три государственных ведомства активно работают над созданием новой системы блокировки запрещенных ресурсов",
			"date_published": 1535869894.582,
			"body": "По [данным Reuters](https://ru.reuters.com/article/topNews/idRUKCN1LF201-ORUTP), межведомственная комиссия, которая включает представителей ФСБ, Роскомнадзора, Министерства цифрового развития, связи и массовых коммуникаций, с начала этого месяца проводит проверку работоспособности российских систем анализа и фильтрации трафика на сети Ростелекома. Испытания проводятся в городе Реутов. \n\nУ журналистов Reuters есть протокол заседания комиссии с докладом о результатах тестирования новых технологий. Так вот, испытание достаточно масштабное, в Реутове испытывается не одна, а сразу несколько систем фильтрации трафика, включая продукты РДП.РУ, АДМ Системы, НТЦ Протей, DDoS-Guard, Napa Labs, Vas Experts и Концерна Автоматика, который входит в госкорпорацию Ростех. \n<a data-cke-saved-name=\"habracut\" name=\"habracut\"></a>\n\n![550ba420f18bbd9b7863d6754b815b55.jpg (0x0)](data/img/post_25_550ba420f18bbd9b7863d6754b815b55.jpg)\n\nСвой комментарий относительно реальности происходящего дал Антон Пинчук, совладелец одной из компаний, которая отказалась от участия в разработке системы фильтрации трафика: «Задача была поставлена масштабная, а сроки для подготовки совсем небольшие. В рамках испытаний на сети Ростелекома от DPI хотели распознавания и возможности блокировки практически всех известных сетевых протоколов на канале более чем в 1 Тбит/с. Наша DPI успешно работает на сетях многих операторов связи, но под более конкретные задачи».\n\n---\n\nОн также заявил, что компания не получала конкретных коммерческих предложений от Роскомнадзора. Тем не менее, Пинчук знает основную идею, которая лежит в основе текущего проекта. Она заключается в том, чтобы найти максимально эффективное решение для анализа, фильтрации и блокировки трафика, которым можно было бы оснастить сети операторов по всей стране. \n\nЧто касается Ростелекома, то госкорпорация отказалась от комментариев: “Пресс-служба Роскомнадзора не располагает информацией по данному вопросу”.\n\nИсточники, которые в курсе происходящего, утверждают, что по итогам испытаний Роскомнадзор и ФСБ планируют выбрать лучшую систему. После этого будет дана задача по ее доработке, если это будет нужно. После начнется внедрение системы в инфраструктуре всех операторов связи в России. Цель — максимально эффективно блокировать запрещенный контент в интернете. \n\nИспытания изначально должны были закончиться еще 20-го августа, но сроки тестирования были увеличены. Как оказалось, первые системы не смогли пройти тесты, а сроки испытания других были перенесены. Тесты оказались неудачными потому, что для блокирования мессенджера разработчики пытались блокировать протокол MTProto, используемый для шифрования сообщений в мессенджере Telegram, и SOCKS. Но в результате оказалось, что при блокировке закрывается доступ к весьма популярным в РФ ресурсам, например, сервису Сбербанк Онлайн. \n\nДело в том, что Telegram для передачи одного сообщения хватает всего одного сетевого пакета. Но ни одна из протестированных систем не в состоянии распознать пакет, идентифицировав по нему мессенджер. Сам пакет «маскируется» то под https, то под данные антивируса, поэтому системы фильтрации трафика просто не в состоянии блокировать именно мессенджер, не затрагивая каналы других ресурсов и сервисов. \n\n“Вопросы про сам факт тестирования мы оставим без ответа, в рамках взаимодействия с Роскомнадзором мы выполняем целый ряд тестирований и по части некоторых не имеем право раскрывать информацию”, — сообщил заместитель гендиректора Vas Experts Алексей Алексеенко. Он также добавил, что блокирование связанных с Telegram протоколов нарушает работу банковских клиентов. \n\nПо словам Алексеенко, решение его компании, СКАТ, позволяет выделить и блокировать не только Telegram, но и другие мессенджеры, включая Whatsapp, Viber, Facebook Messenger. Но поскольку мессенджеры стали использовать технологии MTProto и SOCKS сервера, блокировать их затруднительно. Причина в том, что блокирование общих протоколов связи приводит к нарушению работы широкого спектра приложений, включая «белые». \n\nСтоит напомнить, что Telegram попал в реестр запрещенных ресурсов в России в апреле 2018 года. Тогда компания заявила об отказе предоставить ФСБ ключи для дешифрования переписки своих пользователей. После этого Роскомнадзор обратился в Таганский суд Москвы с иском о блокировании сервиса сообщений. Этот иск вскоре был удовлетворен, после чего Роскомнадзор начал работу по блокированию мессенджера. \n\nОператоры связи несколько недель пытались блокировать подсети IP-адресов, так либо иначе связанные с Telegram. В результате общий объем заблокированных IP достиг 17 млн, но своей цели Роскомнадзор не достиг. Более того, после начала блокировки мессенджера перестали нормально работать многие сайты и сервисы, которые работали на основе облачных платформ Google, Amazon и других.\n\n- Источник: [https://habr.com/post/421835/](https://habr.com/post/421835/)\n- via http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM/"
		},
		{
			"post_id": 24,
			"title": "Мёртвых не хули",
			"date_published": 1535299600.766,
			"body": "Вот перечень основных предписаний Хилона:\n\n*   сдерживай язык, особенно в застолье;\n*   не злословь о ближнем, чтобы не услышать того, чему сам не порадуешься;\n*   не грозись, это дело бабье;\n*   к друзьям спеши проворнее в несчастье, чем в счастье;\n*   брак справляй без пышности;\n*   мертвых не хули;\n*   старость чти;\n*   береги себя сам;\n*   лучше потеря, чем дурная прибыль: от одной только горе на раз, от другой навсегда;\n*   чужой беде не смейся;\n*   кто силен, тот будь и добр, чтобы тебя уважали, а не боялись;\n*   хорошо начальствовать учись на своем доме;\n*   языком не упреждай мысль;\n*   обуздывай гнев;\n*   гадательству не перечь;\n*   на непосильное не посягай;\n*   не спеши в пути;\n*   когда говоришь, руками не размахивай - это знак безумства;\n*   законам потворствуй;\n*   покоем пользуйся."
		},
		{
			"post_id": 23,
			"title": "Свобода слова в России",
			"date_published": 1533547069.365,
			"body": "Ну, в общем, свобода слова в России _лично для меня_ закончилась сегодня. В свете всех последних тенденций я перелистал свой блог в одной популярной соцсети, который, как мне казалось, совершенно аполитичен. И… удалил десять постов. Два из которых однозначно нарушали 282-ю в её широком трактовании и ещё 8 — где-то на грани.\n\nЧто делать с форумами Авиабазы — вообще непонятно. Там материалов по всем юзерам за все годы на десятки дел.\n\nЧто же касается основных блогов и форумов политической тематики впредь — пожалуй, что в Клирнете я оставлю теперь только «котиков и цветочки», а с политикой перейду в ZeroNet целиком. При чём как-нибудь неперсонифицированно… А то ни в России, ни на Западе писать в соцсетях свободно больше нельзя."
		},
		{
			"post_id": 21,
			"title": "Пенсии",
			"date_published": 1529067440.236,
			"body": "> **[Kotyara3](retroshare://forum?name=Re%3A%20%D0%96%D0%B8%D1%80%D0%BD%D0%BE%2C%20%D0%B3%D1%80%D0%B0%D0%B6%D0%B4%D0%B0%D0%BD%D0%B8%D0%BD%20%D0%96%D0%B8%D1%80%D0%B8%D0%BD%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9&id=a7ece12344fc979761e2be0137a513df&msgid=9fe3f2c355060748ac53b74019d376828d57a90a)**@RetroShare\n> Система - отработал и умер, делает абсолютно бесполезными пенсионные программы, как таковые.\n\nЕсли не закапываться в динамику численности и сложности различия средней продолжительности жизни и средней продолжительностью жизни после достижения пенсионного возраста, то по факту на данный момент мы имеем:\n\n*   Число пенсионеров = 43 миллиона.\n*   Число работающих = 72 миллиона.\n\nТо есть при средней пенсии в 14 тысяч рублей при нулевых попилах каждый работающий в стране должен отдавать пенсионерам 8300 рублей. Или 23% средней зарплаты.\n\n...\n\nПродолжительность жизни в стране реально растёт.\n\n![b_graf04.jpg (0x0)](data/img/post_21_b_graf04.jpg)\n\nПри чём, даже если не верить в официальную статистику по ней, то не отвертеться от роста числа пенсионеров:\n\n*   Сейчас — 43.2 млн.\n*   2013 — 41.0 млн.\n*   2010 — 39.7 млн.\n*   2000 — 38.4 млн.\n*   1990 — 32.8 млн.\n\nА при росте доли пенсионеров нужно или уменьшать пенсии, или увеличивать пенсионные налоги, или увеличивать пенсионный возраст. Четвёртого не дано."
		},
		{
			"post_id": 20,
			"title": "Бабченко",
			"date_published": 1527703483.63,
			"body": "Надо отметить, что на Западе его «смерть» прошла почти незамеченной. На двух из трёх американских форумов, что я периодически почитываю, про Бабченко ни слова не было. На одном была короткая тема на 2-3 сообщения, при чём без обвинений России, вполне нейтрально. Максимум:\n\n> После написания о разбившемся российском военном самолете в 2016 году, г-н Бабченко сказал, что он получил угрозы смерти и покинул свою родину.\n> \n> Сначала он переехал в Прагу, а затем в столицу Украины. Он был откровенным критиком Кремля.\n> \n> Бывший военный корреспондент, он работал в Киеве в качестве ведущего на украинском канале ATR TV.\n\nВот после «воскрешения» постов было больше :)\n\n> Это наверняка сбило с толку многих людей, но на самом деле, это очень умно, если вы думаете об этом. Если они немедленно арестовали парня, который приказал убийство поддельному убийце, у них было бы меньше доказательств, чем сейчас.\n\n...\n\n> Путин опять забивает гол.\n\n...\n\n> Почему это происходит прямо перед кубком мира в России?\n\n* * *\n\nА, вообще, он сейчас круто в информационном плане поднимется. Сторонников будет больше. А прежние сторонники стали относиться ещё лучше (сужу по комментам).\n\nЭта история — фантастический пиар для него. Его уже почти забыли, а сейчас снова будет на слуху."
		},
		{
			"post_id": 19,
			"title": "РКП как средство IT-образования населения",
			"date_published": 1525609465.636,
			"body": "Динамика популярности VPN и прокси в Гуглотренде на последние 90 дней :)\n\n![2018-05-06_15-22-45.png (0x0)](data/img/post_19_2018-05-06_15-22-45.png)"
		},
		{
			"post_id": 18,
			"title": "Все совпадения случайны",
			"date_published": 1524393220.751,
			"body": "Фирма Samura делает кухонные ножи, которыми в прошлом году убили несколько человек. Власти предержащие потребовали от Samura добавить в ножи уникальные идентификаторы и ввести обязательную регистрацию покупателей. Samura отказалась, сославшись на техническую невозможность. Тогда Роспотребнадзор потребовал запретить продажи Samura в России. Но, поскольку сделать это оказалось технически сложно, сейчас идёт процедура запрета работы сталеплавильных заводов по всем миру.\n\n![samura.jpg (0x0)](data/img/post_18_samura.jpg)"
		},
		{
			"post_id": 17,
			"title": "Gmail в бане",
			"date_published": 1524378527.6,
			"body": "Gmail.com заблокирован. Это ещё круче. Потому что для поиска google.ru работает (или Яндекс на худой конец), а вот до гуглопочты теперь без прокси/VPN не достучаться никак. Это эпик! :)\n\n**Update 09:33**: О! Gmail только что разблокировали. Видно, провайдера сразу порвали на британский флаг пользователи :) Или РКН сдал назад.\n\n**Update 09:42**: google.com тоже только что разбанили. Возможно, была проверка реакции сообщества. Судя по точечным блокировкам по 3-5 IP, банили целенаправленно, а не случайно зацепили.\n\n**Update 09:45**: А, может, и не проверка реакции сообщество. А просто:\n\n![gzHenK0o9g8.jpg (0x0)](data/img/post_17_gzHenK0o9g8.jpg)"
		},
		{
			"post_id": 16,
			"title": "Телеграмахия 0422-0859",
			"date_published": 1524376748.089,
			"body": "Самое фиговое во всей этой телеграмахии не сами блокировки, обойти их не проблема, а в том, что хрен поймёшь, сайты глючат и тормозят из-за их проблем, из-за локальных проблем или из-за дебоша РКН.\n\nРаньше было понятно, Авиабаза тормозит, LOR летает, значит проблема на Авиабазе и нужно разбираться с причинами. А теперь всё чаще сайт тормозит, лезешь разбираться, а на нём всё ок, всё шустренько, нагрузка небольшая. Проверяешь — а тормозит и многое другое, за чем никогда проблем не было. Зайдёшь через удалённый сервер за границей — опаньки, а оттуда всё моментом открывается…\n\nТак снова начинает привлекать ZeroNet. Он-то работает с твоей локальной машиной только и ему глубоко пофиг на проблемы внешних соединений, на комфорте работы скорость не сказывается (конечно, если речь не о просмотре видео в онлайне) :)"
		},
		{
			"post_id": 15,
			"title": "Телеграмахия",
			"date_published": 1524372825.49,
			"body": "Поздравляю всех! В России заблокирован google.com :)\n\n**Update:** Кстати, по Гуглу — это не случайно зацепили. Это точечный целенаправленный удар. Как-то реально странно. Очень странно:\n\n![2018-04-22_08-31-49.png (0x0)](data/img/post_15_2018-04-22_08-31-49.png)\n\n**Update 2018-0422 08:47:**\n\nИнтрига нарастает. Ещё одна точечная блокировка Гугла и 4 IP-адреса Microsoft. Интересно, какие это будут адреса :)\n\n![2018-04-22_08-45-49.png (0x0)](data/img/post_15_2018-04-22_08-45-49.png)"
		},
		{
			"post_id": 14,
			"title": "СМИ: обнаруженная «Лабораторией Касперского» кампания Slingshot — антитеррористическая операция США",
			"date_published": 1521712757.974,
			"body": "_Это пока больше опять просто тест копипасты. ([Как скопировать статью из Clearnet в ZeroNet](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:6:Как+скопировать+статью+из+Clearnet+в+ZeroNet+(черновик)))_\n\nНа прошедшей недавно конференции Kaspersky Security Analyst Summit (SAS) эксперты «Лаборатории Касперского» рассказали об изощренной [шпионской кампании Slingshot](https://xakep.ru/2018/03/15/slingshot/). Оказалось, что данная кампания активна как минимум с 2012 года, но обнаружить ее удалось лишь недавно. К тому же преступники атаковали жертв весьма оригинальным способом --- через скомпрометированные роутеры компании MikroTik.\n\nЭксперты сообщали, что за шесть лет активности от Slingshot пострадали около 100 частных лиц, но также атакам подвергались правительственные учреждения и организации из стран Ближнего Востока и Африки. При этом Slingshot назвали крайне сложной платформой для атак, в разработку которой было вложено огромное количество сил, времени и денег. По словам аналитиков, по степени сложности Slingshot может затмить даже Project Sauron и Regin, а значит, речь идет о кибершпионаже высшего уровня и «правительственных хакерах».\n\n[![](https://xakep.ru/wp-content/uploads/2018/03/161265/Slingshot-3-1040x638.png)](https://xakep.ru/wp-content/uploads/2018/03/161265/Slingshot-3.png)\n\nКарта атак\n\nСудя по всему, теория о «правительственных хакерах» оказалась близкой к правде. Журналисты издания [CyberScoop](https://www.cyberscoop.com/kaspersky-slingshot-isis-operation-socom-five-eyes/), ссылаясь на анонимных сотрудников американских разведслужб (как отставных, так и ныне действующих), пишут, что кампания Slingshot на самом деле представляет собой операцию Совместного командования специальных операций США (Joint Special Operations Command, JSOC), которое является частью Главного управления войск специального назначения Министерства обороны США (Special Operations Command, SOCOM).\n\n---\n\nПо информации CyberScoop, операция была направлена против членов запрещенной в России организации ИГИЛ, Аль-Каиды и других террористически групп, действующих на территории Афганистана, Йемена, Ирака, Иордании, Турции, Ливии, Судана, Сомали, Кении, Танзании и республики Конго. Если точнее, атаки якобы были направлены против интернет-кафе, из которых террористы связывались со своим «руководством». Стоит сказать, то SOCOM действительно часто проводит контртеррористические операции, в том числе и с приставкой кибер-.\n\nИсточники CyberScoop выразили обеспокоенность тем фактом, что кампания Slingshot была публично разоблачена, так как, по их мнению, это могло привести не только к потере ценной для военных программы наблюдения, но и поставить под угрозу жизни солдат. После компрометации инфраструктура Slingshot, вероятнее всего, была заброшена и уничтожена, как предписывают правила.\n\nСтоит отметить, что в своих отчетах «Лаборатория Касперского» не связывала Slingshot с конкретными странами, аналитики лишь отмечали, что хакеры, вероятно, говорят по-английски. Также исследователи писали, что методы, которые использует Slingshot, похожи на «почерк» таких группировок, как Longhorn и The Lamberts, чьи имена [давно связывают](https://xakep.ru/2017/04/11/cia-is-longhorn/) с ЦРУ. Кроме того, на связь Slingshot с американскими военными может указывать использование инструментов и строк кода с отсылками к персонажам «Властелина Колец». В частности, хакеры использовали имя Голлум (Gollum), и точно такое же имя носил имплант АНБ, «засветившийся» еще в [документах](https://search.edwardsnowden.com/docs/CNEPresenceinCT10StatusReport2015-01-17_nsadocs_snowden_doc) Эдварда Сноудена.\n\nЖурналисты CyberScoop и их источники полагают, что специалисты «Лаборатории Касперского» не могли знать точно, но подозревали, что за Slingshot стоит одна из стран-участниц альянса спецслужб Five Eyes (в него входят США, Великобритания, Канада, Австралия, Новая Зеландия).\n\nПредставители «Лаборатории Касперского» уже прокомментировали ситуацию журналистам издания [SecurityWeek](https://www.securityweek.com/slingshot-us-government-operation-targeting-terrorists-report):\n\n> «\"Лаборатория Касперского\" неизвестны личности атакующих, стоящих за Slingshot APT, равно как и личности пострадавших. Так как данные анонимизированы, мы не имеем возможности узнать, кем были конкретные цели. Наша компания лишь может утверждать, что наши пользователи защищены от вредоносного ПО, которое способно шпионить, воровать или повреждать данные на их компьютерах.\n> \n> \"Лаборатория Касперского\" всегда открыто описывала свою позицию, относительно обнаружения малвари: мы обнаруживаем и устраняем все виды вредоносных программ, безотносительно их проихождения и предназначения. Более того, компания не заносит в \"белые списки\" никакие образчики малвари, даже такие, которые используются для так называемого \"легального наблюдения\". Легко представить себе ситуацию, когда подобная малварь попадает не в те руки и может использоваться для атак на правоохранительные органы или рядовых пользователей».\n\n*   [Мария Нефёдова](https://xakep.ru/ \"Записи Мария Нефёдова\")\n*   [СМИ: обнаруженная «Лабораторией Касперского» кампания Slingshot -- антитеррористическая операция США](https://xakep.ru/2018/03/22/slingshot-antiterror-operation/)"
		},
		{
			"post_id": 13,
			"title": "Образ врага на Западе и в России",
			"date_published": 1521609043.295,
			"body": "Черновик для сбора материалов. Затравка — свежая картинка из The Guardian:\n\nЯ уже не первый раз сталкиваюсь с утверждением, что в России намеренно постоянно создаётся образ Запада как врага. А вот на Западе образ России обозначается вражеским намного реже. Я такой тенденции не вижу. Более того, постоянно читая/смотря как русские, так и западные источники, вижу обратное. Но мне интересно докопаться до истины, поэтому я решил завести отдельную тему со сравнением образа Запада в России и образа России на Западе.\n\nПоскольку тема заранее не готовилась как статья для публикации, я буду просто размещать тут материалы подходящие по теме. По тем причинам, что я гораздо чаще сталкиваюсь с тем, что Россию изображают злым противникам, очевидно, что я чаще буду размещать именно такие образы.\n\nВот для затравки картинка из свежего The Guardian, которая сейчас стала очень известна в России. Собственно, из-за неё я и решил открыть эту тему:\n\n![661.jpg (661x397)](data/img/post_13_661.jpg)\n\nИсточник: [https://www.theguardian.com/commentisfree/picture/2018/mar/14/steve-bell-may-putin-spy-poisoning-cartoon](https://www.theguardian.com/commentisfree/picture/2018/mar/14/steve-bell-may-putin-spy-poisoning-cartoon)\n\nИнтересно, что эта картинка — не оригинал. А совсем мало переделанный пропагандистский фашистский плакат («Große antibolschewistische Schau») 1940/1941 годов.\n\nЗаранее могу заметить, что именно Запад очень активно формирует образ себя как врага внутри России. С точки зрения русских появление такой карикатуры сразу ставит автора на одну полку с нацистами.\n\n![photo_2018-03-20_03-38-03.jpg (413x595)](data/img/post_13_photo_2018-03-20_03-38-03.jpg)\n\n* * *\n\nАга, вот тут по плакату больше информации: [http://www.moonofalabama.org/2018/03/guardian-rips-off-goebbels-uses-fascist-propaganda-for-better-anti-russian-smears.html](http://www.moonofalabama.org/2018/03/guardian-rips-off-goebbels-uses-fascist-propaganda-for-better-anti-russian-smears.html)\n\n![54143.jpg (1155x855)](data/img/post_13_54143.jpg)\n\n![1389852915_345564439.jpg (675x900)](data/img/post_13_1389852915_345564439.jpg)\n\n![photo_2018-03-21_14-16-20.jpg (555x647)](data/img/post_13_photo_2018-03-21_14-16-20.jpg)\n\nЕщё немного школьной жизни. Британский школьный портал:\n\n![2018-03-21_09-37-27.jpg (700x894)](data/img/post_13_2018-03-21_09-37-27.jpg)![2018-03-21_09-37-53.png (700x693)](data/img/post_13_2018-03-21_09-37-53.png)​​​​​​​"
		},
		{
			"post_id": 12,
			"title": "СССР-Россия. 1988-2018",
			"date_published": 1516464534.69,
			"body": "Затеял тут проект. Начал публиковать фотки на американском форуме, потом стал всё это причёсывать, решил и оригинальные описания  на русском выложить в виде отдельного ZeroBlog:\n\n[http://127.0.0.1:43110/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/](http://127.0.0.1:43110/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/)\n\nПодробное описание там же, первым постом. Вкратце — фотки «как было» и, иногда, «как стало» :)\n\n![20121221103319316.jpg (700x465)](data/img/post_12_20121221103319316.jpg)"
		},
		{
			"post_id": 11,
			"title": "Уголок конспиролога",
			"date_published": 1515120124.166,
			"body": "Интересный пазл в свете новой уязвимости. Даже удивительно, почему конспирологи не проснулись. Так что я сам наброшу:\n\n### [Крис Касперски обнаружил уязвимость в процессорах Intel](https://www.securitylab.ru/news/355981.php)\n\nРоссийский хакер, известный как Крис Касперски, обнаружил уязвимость в процессорах Intel, которая позволяет совершить удаленный взлом системы **при помощи скрипта на JavaScript** или TCP/IP-пакета **вне зависимости от операционной системы**.\n\nХакер намерен в октябре продемонстрировать свою методику на конференции Hack In The Box в малайзийском Куала-Лумпуре. Касперски заявил, что намерен показать работающий код и сделать его общедоступным. Он добавил, что ошибки в микропроцессорах становятся все более серьезной угрозой, так как уже пишутся использующие их зловредные программы.\n\n### [Интервью с Крисом Касперски](https://xakep.ru/2012/12/30/kris-kasperski/)\n\nС весны 2010 года проживает и трудится в США.\n\n### [Sky diver injured in DeLand remains hospitalized](http://www.news-journalonline.com/news/20170213/sky-diver-injured-in-deland-remains-hospitalized)\n\nПарашютист, совершивший жесткую посадку в Skydive DeLand, остается в реанимации и не может общаться, сообщила в понедельник медсестра медицинского центра Halifax Health Medical.\n\nСкайдайвер, 40-летний Николай Лихачев, перенес сложный перелом левой ноги и травму головы, говорится в отчете об инциденте, опубликованном в понедельник полицией штата Деленд. В докладе говорится, что Лихачев выполнил 200 прыжков, большинство из них - в «Скайдиве ДеЛанд».\n\n### [Российский хакер Касперски погиб, прыгая с парашютом](https://life.ru/t/технологии/982228/rossiiskii_khakier_kaspierski_poghib_pryghaia_s_parashiutom)\n\nИзвестный хакер, программист и специалист по информационной безопасности Николай Лихачёв, прославившийся под псевдонимом Крис Касперски, был отключён от аппарата жизнеобеспечения в больнице Halifax Center в Калифорнии.\n\n### [CPU сдаст вас с потрохами: самая серьезная дыра в безопасности за всю историю наблюдений?](https://habrahabr.ru/post/346026/)\n\nИсследователи Google опубликовали исследование «Reading privileged memory with a side-channel», в котором они описывают найденную ими аппаратную уязвимость, которая затрагивает практически все современные и устаревшие процессоры **вне зависимости от операционной системы**.\n\nАтака позволяет получить доступ к защищенной памяти из кода, который не обладает соответствующими правами.\n\nПожалуй, самое вероятное и неприятное применение на данный момент — получение дампа системной памяти **во время выполнения JavaScript**.\n\n![10502116.jpg (550x412)](data/img/post_11_10502116.jpg)​​​​​​​"
		},
		{
			"post_id": 10,
			"title": "Суд постановил взыскать с 95-летней участницы ВОВ 572 000 рублей за обвалившуюся на иномарки стену ее дома",
			"date_published": 1512301275.163,
			"body": "В Курске автовладельцы засудили почти на 600 тысяч рублей 95-летнюю ветерана ВОВ. Частично обрушившийся дом женщины повредил припаркованные рядом автомобили, после чего пострадавшие обратились в суд и выиграли дело. При этом сама пенсионерка уверена, что обрушение произошло строительства по соседству торгового центра. После того, как об истории узнали местные СМИ, помочь ветерану с выплатой непосильной компенсации взялись общественники.\n\n![babushka-pic4_zoom-1500x1500-96108_1_.jpg (1200x649)](data/img/post_10_babushka-pic4_zoom-1500x1500-96108_1_.jpg)\n\n* * *\n\n*   [Петиция на Change.Org: Требую справедливого пересмотра дела 95-летней участницы ВОВ Любови Козинец](https://www.change.org/p/требую-справедливого-пересмотра-дела-95-летней-участницы-вов-любови-козинец)\n*   [Ветерана осудили за разбитые машины](https://www.gazeta.ru/auto/2017/11/29_a_11014358.shtml)\n*   [\"Бессмертный полк\" поможет ветерану Любови Козинец, которую суд обязал уплатить полмиллиона за обрушение стены ветхого дома](https://www.newsru.com/russia/26nov2017/kozinets.html)\n*   [СПЧ попросил курские власти помочь ветерану с выплатой 500 тыс. руб. автомобилистам](http://www.interfax.ru/russia/589562)\n*   [СК проверит дело проигравшей суд Любови Козинец](http://vkurske.com/incidents/138614/)\n*   [Тема на tanzpol.org](http://www.tanzpol.org/2017/12/t101049--sud-postanovil-vzyskat-s-95-letnej-uchastnitsy-vov-572-000-r.257.html)"
		},
		{
			"post_id": 9,
			"title": "«Король Салман вытряхнул из кармана мелочь и дал Порошенко»",
			"date_published": 1512300441.657,
			"body": "Саудовская Аравия вложит в Украину меньше $4 млн, тогда как в Штаты — $380 млрд, в Россию - $1 млрд\n\n![3_main_1_.jpeg (751x422)](data/img/post_9_3_main_1_.jpeg)\n\n*   [https://strana.ua/articles/analysis/102503-ofitsialnyj-vizit-poroshenko-v-saudovskuju-araviju-prines-4-milliona-dollarov-investitsij.html](https://strana.ua/articles/analysis/102503-ofitsialnyj-vizit-poroshenko-v-saudovskuju-araviju-prines-4-milliona-dollarov-investitsij.html)\n*   [http://www.balancer.ru/g/p5566641](http://www.balancer.ru/g/p5566641)"
		},
		{
			"post_id": 7,
			"title": "Старая притча",
			"date_published": 1492940382.399,
			"body": "Баян, но актуальный...\n\n> Когда человек был ещё ребенком, бабушка всегда говорила ему: «Внучек, вот вырастешь ты большой, станет тебе на душе плохо — ты иди в храм, тебе всегда там легче будет».\n\n> Вырос человек. И стало ему жить как-то совсем невыносимо. Вспомнил он совет бабушки и пошел в храм. И тут к нему подходит кто-то: «Не так руки держишь!». Вторая подбегает: «Не там стоишь!». Третья ворчит: «Не так одет!». Сзади одергивают: «Неправильно крестишься!». А тут подошла одна женщина и говорит ему: \n\n> — Вы бы вышли из храма, купили себе книжку о том, как себя здесь вести надо, потом бы и заходили.\n\n> Вышел человек из храма, сел на скамейку и горько заплакал. И вдруг слышит он голос: \n\n> — Что ты, дитя мое, плачешь? \n\n> Поднял человек свое заплаканное лицо и увидел Христа. Говорит: \n\n> — Господи! Меня в храм не пускают! \n\n> Обнял его Иисус: \n\n> — Не плачь, они и меня давно туда не пускают.\n\n// [О религии с юмором](http://www.balancer.ru/g/p3548873)#3548873"
		},
		{
			"post_id": 6,
			"title": "Житель Красноярска оштрафован за попытку продать GPS-трекер через интернет",
			"date_published": 1492938243.983,
			"body": "> Штраф в 20 тысяч рублей пришлось заплатить красноярцу, которого правоохранители обвинили в нарушении ст. 138.1 УК РФ (незаконный оборот специальных технических средств, предназначенных для негласного получения информации). Согласно материалам дела, красноярец приобрел через интернет-магазин AliExpress GPS-трекер (устройство приема-передачи данных для спутникового контроля автомобилей), чтобы в дальнейшем продать дороже в Красноярске через интернет-аукцион. \n\n>«Важно знать, что такие незаменимые вещи для автовладельцев, как видеорегистратор или GPS-трекер, относятся к специальным техническим средствам, предназначенным для негласного получения акустической и визуальной информации. В соответствии с действующим законодательством реализация таких средств, а также ввоз и вывоз за пределы РФ может производиться только при наличии соответствующей лицензии», — пояснили в прокуратуре.\n\nhttps://rublacklist.net/27879/\n"
		},
		{
			"post_id": 5,
			"title": "Жителя Сургута оштрафуют за покупку PS4 в Германии",
			"date_published": 1492937981.566,
			"body": ">Молодой человек из Сургута решил заказать консоль PlayStation 4 в Германии, чтобы сэкономить деньги. Однако, не трудно представить, каково было его разочарование, когда таможенники Югры не только конфисковали приставку, но и сообщили о незаконности покупки. \n\n---\n\n>По законам Российской Федерации, PlayStation 4 относится к классу товаров, определяемых как криптографические (шифровальные) средства. Завозить в нашу страну такие устройства без специальных документов с указанием технических и криптографических характеристик запрещено.\n\n>«Игровая приставка данной модели являлась устройством, содержащим в себе встроенное оборудование с различными техническими характеристиками (встроенный жесткий диск 500 GB, основной (графический) процессор, оптический дисковод), в том числе имеет выход в телекоммуникационную сеть «Интернет» и, в соответствии с требованиями таможенного законодательства, ввоз и вывоз таких товаров, относящихся к шифровальным (криптографическим) средствам, осуществляется при наличии нотификации – уведомлении изготовителя товаров о технических и криптографических характеристиках», – сообщает пресс-служба таможни ХМАО-Югры.\n\nhttp://www.ferra.ru/ru/games/news/2017/04/23/ps4-fine-germany-surgut/\n\nПоходу, за львиную долю заказов в том же Китае штрафовать таким способом можно. От телефонов и флешек с шифрованием до микроконтроллеров и Wi-Fi свистков...\n\nЗа телефоны, кстати, по целой куче статей. Там ещё и негласное фото/видео, звукозапись, нелицензированное использование радиочастот и т.д.\n\n*«Если Вы ещё не оштрафованы — это не ваша заслуга, а отсутствие необходимости Вас штрафовать немедленно»...*\n"
		},
		{
			"post_id": 4,
			"title": "Аресты владельцев Tor-exit-нод",
			"date_published": 1492711511.735,
			"body": "> [anoninonelon](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS/+Tor+Exit+node#comment_2_17UbJJoiUJF9DHWLUnGYjfw82i5tdb4oqP): Боюсь, что это только начало.\n\nЭто не начало, это продолжение. Начало было, когда в Германии в 2007 оператора exit-ноды арестовали:\n\n**[Tor node operator after run-in with police: “I can’t do this any more”](https://arstechnica.com/tech-policy/2007/09/tor-node-operator-after-run-in-with-police-i-cant-do-this-any-more/)**\n\nЕго, правда, в результате освободили, но тренд уже стал ясен.\n\n- [Couple hosting Tor exit node raided by cops investigating child abuse](https://nakedsecurity.sophos.com/2016/04/07/couple-hosting-tor-exit-node-raided-by-cops-investigating-child-abuse/)\n- [Tor exit node operator convicted of abetting spread of child porn](http://www.pcworld.com/article/2452320/tor-exit-node-operator-convicted-of-abetting-spread-of-child-porn.html)\n- [Austrian man raided for operating TOR exit node](http://www.zdnet.com/article/austrian-man-raided-for-operating-tor-exit-node/)\n\nТаких случаев уже слишком много, чтобы держать у себя Tor-ноду. Даже без учёта российского законодательства. «Хакнет» кто-нибудь с твоего компа через Tor почту очередного американского кандидата в президенты, поедешь в отпуск за границу и повяжут тебя. Разъясняй потом, что не верблюд... :)"
		},
		{
			"post_id": 3,
			"title": "«Патриот» от «Несчастного случая»",
			"date_published": 1480090905.241,
			"body": "<video controls style=\"max-width: 100%\"><source src=\"http://gateway.ipfs.io/ipfs/QmYHyTUEfmTKatnareketQw2YvaLKS7Sbccy58wPikmLWA/Патриот-KNlS4YwlUEQ.mp4\" type=\"video/mp4\">Your browser does not support the video element.</video>\n\n([файл в IPFS](http://gateway.ipfs.io/ipfs/QmYHyTUEfmTKatnareketQw2YvaLKS7Sbccy58wPikmLWA/Патриот-KNlS4YwlUEQ.mp4))"
		},
		{
			"post_id": 2,
			"title": "Кто святее?",
			"date_published": 1480090451.117,
			"body": "_ Найдено на http://anime.66.ru/blog/1928120/ через http://juick.com/stanislavv/2854212 _\n\nСразу после отречения, когда ещё не было никаких большевиков, русская православная церковь и её святые высказывались например так:\n\n«**...Наступило наше страдное время в правление императора Николая II. Всеми чувствовалось, что уже отжил свою пору бывший доселе государственный строй и порядки. При нынешних условиях жизни самодержавному царю невозможно было успешно управлять столь великим государством. Нужно было, чтобы сам народ, в лице избранных им представителей, принял участие в управлении. Но царь не сделал этого. Царский престол окружали враги народа тайные и явные. Происходило страшное нечестие. Началась великая европейская война, и открыто обнаружились многие государственные недостатки, а от них военные неудачи. Народные избранники слезно умоляли царя удалить вредных людей и сделать необходимые исправления. Но царь не внял голосу народному. И последовал государственный переворот. Неустранимый ход жизни вынудил императора Николая II отказаться от престола, что он исполнил за себя и за наследного сына 2 марта сего 1917 г. Так совершился суд Божий над бывшим нашим царем Николаем II, как в древности над Саулом**» © епископ Омский и Павлодарский Сильвестр (канонизирован и признан святым)\n\nСравнение с Саулом это на самом деле край, дальше можно сравнивать только дьяволом."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}