{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "VPN & Recherche achats via Darknet",
			"body": "Bonjour,question VPN j ai trouvé mon bonheurs . Téléchargez la version d'essai, et profitez d'1 mois de protection VPN gratuit\n\nPour utiliser Drakker, il vous suffit de télécharger la version d'essai, puis de créer un compte depuis le logiciel Drakker sur votre PC. Avec les identifiants de votre compte, vous pourrez acheter une licence directement depuis le logiciel ou depuis le site.\n\nWindows toutes plateformes\n\nDrakker peut etre copié sur clef  USB pour l'utiliser partout en tout anonymat avec vos identifiants. Aucune trace sur l'ordinateur hôte.\n\nEnglish versions click here\n\nPourquoi utiliser Drakker ?\nParce que, pour quelque raison qui vous appartient, vous souhaitez garantir votre anonymat sur le web.\nUne de ces raisons peut être :\nVous échangez des données sensibles, telles que des échanges financiers ou des données personnelles\nVous résidez dans un pays qui pratique la censure du Net\nVous ne souhaitez pas être tracés ni répertoriés par les moteurs commerciaux\nVous considérez votre vie privée comme privée\nEncryptage des données par OpenVPN (SSL 2048 bits)\nAu lancement du client Drakker s'effectue un échange de certificats entre votre machine et le réseau Drakker. Les certificats échangés sont uniques et privés pour chacun de nos utilisateurs. Dés la sortie de votre ordinateur, vos données sont encryptées et indéchiffrables. Le contenu de vos communications est donc invisible, que ce soit par une tierce partie ou par le réseau Drakker lui-même.\n\nModification de l'adresse IP\nAprès avoir rendu vos communications indéchiffrables, Drakker effectue la modification de votre adresse IP, afin de rendre impossible la localisation de votre ordinateur. Pour cela, le réseau Drakker vous affecte aléatoirement les adresses des serveurs Drakker à travers le monde. Vous n'êtes jamais visible : seul le réseau Drakker est visible.\n\nConfidentialité\nLe réseau Drakker ne recueille et ne possède aucune donnée personnelle concernant ses utilisateurs. A l'intérieur du réseau Drakker, chaque utilisateur n'est connu que par son login/mot de passe et par la signature numérique de ses certificats. Le mot de passe est encrypté et inconnu de Drakker. Les certificats privés sont uniques et utilisables uniquement par leur propriétaire. Si une tierce personne tentait d'utiliser un certificat dérobé sans posséder les identifiants du compte, le certificat est alors immédiatement révoqué et inutilisable. Dans ce cas, seule la personne détentrice du compte peut régénérer ses certificats en utilisant l'option \"Recovery\".\n\nPortabilité\nLe client Drakker peut être téléchargé où que vous soyez. Les identifiants de votre compte sont utilisables partout. Que vous utilisiez votre ordinateur personnel ou celui d'un ami, que vous soyez dans un hotspot ou au bureau, aucun logiciel n'est installé sur l'ordinateur, aucune trace n'est conservée. Si vous sauvegardez le client Drakker sur un support USB, il vous suffit alors de lancer le client depuis la clé USB, et vous pourrez l'utiliser partout dans le monde sans qu'aucune trace n'apparaisse sur les machines utilisées : tout est dans la clé. Utorrent  y est intégré . https://www.drakker.com/                                                                              Vos avis et conseils sur les services Darkenet et achats Bitcoin . De mon cotés je vais cherché et a très bientôt Amicalement M71\n",
			"added": 1463329600
		}
	],
	"topic_vote": {
		"4_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1
	},
	"next_comment_id": 2,
	"comment": {
		"4_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 1,
				"body": "cool Merci \n",
				"added": 1463441196
			}
		]
	},
	"comment_vote": {}
}