{
	"title": "SkiaZeroNews",
	"description": "Skia's Zero News\nkaixiang.ren00@gmail.com",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1514344556,
	"post": [
		{
			"post_id": 10,
			"title": "Julian Assange's \"Death\" is proved to be rumor",
			"date_published": 1477576454.1,
			"body": "[Julian Assange's 'Alive' After conference](http://www.express.co.uk/news/world/725803/Julian-Assange-alive-Wikileaks-Argentina-computer-conference)"
		},
		{
			"post_id": 9,
			"title": "Switch to Machine Learning For FYP",
			"date_published": 1477575926.725,
			"body": "From this blog and on, I will switch my Major focus onto the Machine Learning stuff majorly because of my Final Year Project."
		},
		{
			"post_id": 8,
			"title": "German initiates a brand new civil defense plan",
			"date_published": 1471915685.416,
			"body": "By [BBC news](http://www.bbc.com/news/world-europe-37155060), German is initiating new civil defense plan first time since the cold war. It's a start against the rebelling of refugees."
		},
		{
			"post_id": 7,
			"title": "Let's talk about the refugees.",
			"date_published": 1468859190.494,
			"body": "By the word of Oxfam, [Only 9% of refugees in the world is hosted by the top 6 most financially powerful countries](https://www.theguardian.com/world/2016/jul/18/refugees-us-china-japan-germany-france-uk-host-9-per-cent). I believe we need to take a look at the distribution of the refugees. What are they?\nIt says, by the [UN](http://www.un.org/en/globalissues/briefingpapers/refugees/index.shtml), the refugees is not the correct definition. It uses the words \"forcibly displaced as a result of conflict and persecution\". There are seriously **65.3 MILLION PEOPLE** are forcibly displaced by UNHCR, **21.3 million refugees**, and **10 million stateless people**.[References][1],\nThis would be series question that we need to talk about it in depth.\n\n[1]http://www.unhcr.org/en-us/figures-at-a-glance.html"
		},
		{
			"post_id": 6,
			"title": "China holds combat drill",
			"date_published": 1468037087.589,
			"body": "As we known previously, China holds the combat drill in the South China Sea. Just three days before the PCA, it release a signal that China will never give in in this dispute. \n[China holds combat drill in the South China Sea](http://www.reuters.com/article/us-southchinasea-china-navy-idUSKCN0ZP036?feedType=RSS&feedName=topNews) This Reuters news seems hold a objective perspective. However, the international social trending is not positive towards China. Just like the words expressed in [China Will Never Respect the U.S. Over the South China Sea. Here’s Why](http://time.com/4397808/south-china-sea-us-unclos/) from Time news."
		},
		{
			"post_id": 4,
			"title": "These days news headings seems to be torrified\t",
			"date_published": 1467818023.494,
			"body": "It seems that these days news headings are all about the terrorism or terrorism related. Although we have mostly eliminates the area conflics or traditional wars by the end of Colombia and FARC ceasefire agreement last month. However, the counter terrorism war is still on going. [Bombing, burning, now mourning.](http://www.cnn.com/2016/07/04/middleeast/iraq-baghdad-death-knocks/index.html) The world is tremble under the fire of terrorism. The counter terrorism may not be able to face an end, as long as there is no an extra threat to human beings."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}