{
	"next_comment_id": 27,
	"user_name": "Realjohndoe",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi_1529446940": 1529635833,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1530592002": 1530596788,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1530791481": 1530804306,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1530791358": 1530804335,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1531154817": 1531179338,
		"1GAWwPWreQXo1CwcefCgL6w5wYPkNFWbsj_1531165313": 1531179433,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1531329605": 1531341551,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532034284": 1532038338,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1532130781": 1532132033,
		"1PX5yoNxvKjLifHPuAVRw8EKwM9gpqHK6n_1": 1532358526,
		"1B8e7Pz1Y7HzJqcj3jFTTZMdVvtbBaHb6v_1": 1533430952,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532729580": 1533431528,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532881232": 1533431533,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532881331": 1533431536,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532729518": 1533431546,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1532717296": 1533431549,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1533321775": 1533445796,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1533489701": 1533490612,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1533489624": 1533490619,
		"1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi_1534003627": 1534043508,
		"1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi_1534096277": 1534100342,
		"1LeqWgNKQHKdYdy8AREoHprsCEU6cPrTTC_1536600053": 1536604561,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1537456728": 1537462849,
		"1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw_1540979421": 1541021628,
		"1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd_1547240587": 1547246050,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208": 1549236882,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549323740": 1549343088,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1553385489": 1553387112,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1555282599": 1555282838,
		"14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx_1555614897": 1555616889,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1556309955": 1556324203,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1557334793": 1557339004,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1558224485": 1558225518,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1563704720": 1563726090,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1565197703": 1565213324,
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1565194392": 1565213654,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1565800642": 1565816810,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1578799116": 1578801484,
		"1JE6djoBJfroS1y5DnwpMWRRcMkruPpkyv_1579964935": 1579968370,
		"16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN_1587478199": 1587547812,
		"1JqceAjQkTEgFmQ7GtnLkwf4XfXWZ21EoJ_1591685574": 1591739763,
		"1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1628079073": 1628298447
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Stay on it 👍",
			"post_uri": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi_1529446940",
			"date_added": 1529635867
		},
		{
			"comment_id": 2,
			"body": "Tim Berners-Lee is a two-faced hypocrite and a sell-out. He forced embedding #DRM in the so-called Open web standards. Against Everyone's! objections, including the United Nations, @EFF and the @FSF.  w3c..👎👊",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1530592002",
			"date_added": 1530596779
		},
		{
			"comment_id": 3,
			"body": "Pass the word..👎👊",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1530592002",
			"date_added": 1530597025
		},
		{
			"comment_id": 4,
			"body": "How about #Israel get the #Fuck! out of #Palestine and the Middle East.. ",
			"post_uri": "1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK_1535323064",
			"date_added": 1535326599
		},
		{
			"comment_id": 5,
			"body": "I thought so. :)",
			"post_uri": "1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK_1535323064",
			"date_added": 1535331534
		},
		{
			"comment_id": 6,
			"body": "Well, most people don't have a clue about that #Bullshit in #Israel and historic #Palestine. Because #Jews have had a strangle hold on all the major media. We don't learn anything about whats going on there until we get blown up (#911), stabbed or shot in the back, or run over by cars. Even then people have a hard time making the true connection, because the #Jew media misrepresents and lies to us. But things have been changing because of the internet. It's really hard to keep trying to suppress the truth in the age of the internet. But the #Jews are giving it a good try lol. It will end horribly for them, again. :(",
			"post_uri": "1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK_1535323064",
			"date_added": 1535340153
		},
		{
			"comment_id": 7,
			"body": "@Akiraforsaken: I agree. Plus I'm getting old and tired. I've done my part, protect life. I hope it was enough. :)",
			"post_uri": "1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK_1535323064",
			"date_added": 1535342212
		},
		{
			"comment_id": 8,
			"body": "@Akiraforsaken: Yep, everyone has to do their part. But I'm good, very fortunate. I can't complain. God has been very good to me. Though I'm not sure why. ;-)",
			"post_uri": "1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK_1535323064",
			"date_added": 1535344760
		},
		{
			"comment_id": 9,
			"body": "The Patriarchy is why we eat animals, instead of animals eating us. The more you know.. ;-)",
			"post_uri": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi_1537279527",
			"date_added": 1537291200
		},
		{
			"comment_id": 10,
			"body": "@Freeperson: Hay! could you see if you can run Freenet and Retroshare with Termux. Because that would be awesome, and should be easy to do for you. :-)",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1542272306",
			"date_added": 1545071255
		},
		{
			"comment_id": 11,
			"body": "<pre>\n\nI think the best way to answer your question is with a question.\n\nWhat is free speech and freedom of expression good for?\n\nThe answer is that free speech and freedom of expression is critical to the survival and evolution of the human race.\n\nFor example, early man learned through the exercise of free speech that's some wild berries were safe to eat, while others were poisonous. That's some snakes are non venomous, while others were deadly.\n\nToday, humanity is drowning in bullshit and fake news. Not only what you see and hear, but more importantly, what you don't see or hear about. Most popular social media sites are little more than captive portals, walled gardens and echo chambers of pure bullshit and fake news. It's so bad that it has even corrupted the very internet itself.\n\nZeronet and similar technologies hold the promise of solving this critical, and often deadly and expensive problem of modern society. You can do everything with Zeronet that you can do on the internet today, and a lot more. I think Zeronet Etc is the next step. The Holy Grail.\n\nZeronet's development and function is much like that of the early internet, and we all know what happened there..😊 Technology tends to develop exponentially. I think you will see the same with Zeronet.\n\nJust knowing that I can say what I want to say. All without some jackass arbitrarily and completely removing me. Just knowing that I can have an online presence that no one can capriciously delete. No matter how far up somebody's ass I've got my dick..😈\n\nZeronet is excellent. And It will become more user friendly and accessible. Which in turn will improve it's  popularity. In my opinion Zeronet needs a more robust social media mode. Zeronet's current social media mode seems somewhat neutered.\n\nUser timelines need to be more complete and comprehensive. Containing all of a users post and comments. And user timelines need to be easier to scan and review. Twitter does this well. As did the old Statusnet, which Twitter descends from.\n\nFor example, I'v answered your question many times. You should be able to just easily scan my timeline and discover that. But all of our comments aren't in our timelines, yet. \n\nI think eventually this will come, along with a lot of other apparently planned user customizations. Like the way we used to be able to customize our MySpace profile or sites. I really liked that. Centralized social media is about controlling you. That's why you aren't allowed much customization. You're their bitch.\n\nAnd now with Zeronet you can have all that, plus a site that can't be taken down. That doesn't need permission, or a tech guru like me to keep it running for a fee.\n\nMy hope Is that technologies like Zeronet will evolve into a global public forum. Where all the important topics of the day can be discussed. Out in the open. Without any place to hide. So that truth can be discovered, and consensus formed..👍😀🎉🎊🎆🗽\n\n</pre>",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549129097",
			"date_added": 1549166029
		},
		{
			"comment_id": 12,
			"body": "@Quantumworld: Zeronet China, true..👍😀",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1549236975
		},
		{
			"comment_id": 13,
			"body": "@Quantumworld: We also need a more robust social media mode.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549226208",
			"date_added": 1549237181
		},
		{
			"comment_id": 14,
			"body": "<pre>\n\nViolet Blue, I miss that girl.. She's a wonderful writer. As I've said many times, censorship is a slippery slope. Your terrorist is my freedom fighter. Your Nazi is my (((**Nasi**))).\n\nI truly miss the sex workers and pornstars I used to follow on Twitter. They were such a pleasure, and so much more than I had any idea they were. Smart, substantial women you would want to know and have a relationship with. Regardless of sex.\n\nThey're pornographic sexuality was just delicious icing on a delicious cake. Though I did get sugar overload, and have some earth-shattering falls and fried power grids, ( when the birds fell from the skies, and the fish washed up from the waters and the seas, Everywhere!).\n\nAlas, after 9 years Twitter suddenly and arbitrarily banned me. I begged for the benefit of my followers for Twitter to take me back, and promised I would be good. Something I would ordinarily never do. But I never heard back from Twitter. \n\nConservatives say I'm a liberal, and liberals say I'm a conservative. (((**Nasi**))) say I'm a Nazi. Of course I'm all of those things, and none of those things.\n\n“In a time of deceit, telling the truth is a revolutionary act.”   G. Orwell\n\nI managed to conceal my true identity lol, just long enough (9 years) to gain a better insight into the sex industry and its impact on women. I truly feel like I have a much better understanding and appreciation of sex work and sex workers now.\n\nFor many women it can be quite lucrative. But for many others it can be quite cruel and exploitive. These so-called survival sex workers are the ones I and many others are most concerned, and worried about.\n\nI support amnesty International's recommendations that sex work should be decriminalized. But I fear it will be a long time before we ever see that in the United States. In the meantime providing sex workers with some measure of mobile food security could go a long way in helping provide some level of harm reduction.\n\nOne of the primary vulnerabilities and tools of exploitation of survival sex workers is hunger, and food insecurity. I think that if we could provide sex workers and other wemon with mobile food security (city, state, national) they would be less vulnerable to abuse and exploitation. And better able to flee abusive situations.\n\nRelatively speaking, it wouldn't cost much. The hard part is just figuring out how to administer it. While sidestepping all the assholes who try to sabotage an exploit these type of social programs for the needy.\n\nMy hope is that in the next few years we will see true Universal Health Care. And a modern version of the old campaign promise of two chickens in every pot on Sunday. Basically some kind of grocery card redeemable at any store for a monthly allotment of groceries.\n\nThe United States gives wealthy people over 500 billion dollars in interest payments on borrowed money. Borrowed money used to avoid  wealthy people's fair share of taxes. While most Americans receive nothing but a 22 trillion debt liability.\n\nYou could provide every US man and woman two hundred a month grocery allotment for 440 years. For the 500 billion interest each year you could provide every US man and woman 200 a month grocery allotment for 10 years.\n\nI think the American people are going to demand this, along with demanding universal healthcare as a human right..😊\n\n</pre>",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549323740",
			"date_added": 1549343129
		},
		{
			"comment_id": 15,
			"body": "He's a **fraud**. If he was who he says he is it would be easy to prove. He's not even in the same **universe** of abilities as Satoshi Nakamoto. Wright and his deceased cohort are frauds and attempted thieves..👎😏",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1551402300",
			"date_added": 1551402934
		},
		{
			"comment_id": 16,
			"body": "<pre>\n\nCensorship allows the other guilty parties to hide their **(((complicity)))** in these tragedies.\n\nCorrupted, compromised and disloyal **(((Western! governments)))** around the world, have criminally and irresponsibly mismanaged their country's immigration for decades.\n\nNow the chickens are coming home to roost. The west will have to severely limit immigration for decades to try and repair the damage.\n\nChrist Church shooter http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1552627778_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M \n\n</pre>",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1552839233",
			"date_added": 1552840375
		},
		{
			"comment_id": 17,
			"body": "The critical issue is that **dictators** can't be allowed to have **nuclear weapons**. North Korea must get rid of its nuclear weapons and its nuclear weapon capabilities immediately. Or the World! will be forced to **bounty** and publicly **eviscerate** and **double tap** Kim Jong-un, and disarm North Korea. The clock is **ticking**..🔫⏳😶 ",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1552840717",
			"date_added": 1552846358
		},
		{
			"comment_id": 18,
			"body": "<pre>\n\n@Polar🍀☘️🌿🌾🌴: It's very big and powerful. But no match for progress and technology, and never will be. Personal power continues to grow exponentially, and with it **freedom**, **liberty** and **human rights**.\n\nA big part of the motivation behind governments support and disloyalty with respect to their irresponsible mismanagement of immigration and the migration invasion, is to dilute the growing personal power of the citizenry of western democracies. And by extension, their power over their governments.\n\nBut they failed. **#YellowVest** 🇫🇷👍😀\n\n</pre>",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1552839233",
			"date_added": 1552849635
		},
		{
			"comment_id": 19,
			"body": "Yes, sooner than you think. ;-)",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1553706057",
			"date_added": 1553706369
		},
		{
			"comment_id": 20,
			"body": "You could also use Keepass and attach the users.json as a file. Then sync your Keepass data base in the cloud. Use 2FA, like a password and a key file. Keep the keyfile on your phone. Lock your phone.. Duh! Good luck. :-)",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1554306299",
			"date_added": 1554310553
		},
		{
			"comment_id": 21,
			"body": "<pre>\n\nProbably a **(((Jew!)))** and Macron conspiracy. To try and distract from the **Yellow Vest** movement that's kicking their ass. \n\nThe **(((Jews!)))** and Bush were behind 911 in the US. They destroyed a national icon in the US. The World Trade Centers.\n\nAnd then the **(((Jews!)))** turned the area into **(((Jewvill)))**. The Saudis are just the Jews **(((bitches)))**.\n\nWhen it finally goes down, the Jews are going to pay a horrific price, again..😀\n\n</pre>",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1555380640",
			"date_added": 1555384911
		},
		{
			"comment_id": 22,
			"body": "<pre>\n\n@Eightyfour: I haven't looked at any of these so-called block list. I only block spammers, and mute works very well for me.\n\nThese so-called block list seem like a kind of slimy, fraudulent attempt at tricking people into surrendering their freedom, and taking it up the ass.\n\nThe kind of thing that **Greasy**, **(((HOmo))** **(((Jew!)))** **Faggots** are into.\n\n\"Squeal like a pig\" - https://youtu.be/9gLN3QoN-q8 😀\n\n</pre>",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557304107",
			"date_added": 1557314683
		},
		{
			"comment_id": 23,
			"body": "I think everyone should speak at least two languages, English and something else..😀",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1558488051",
			"date_added": 1558493914
		},
		{
			"comment_id": 24,
			"body": "**Jews!** **HOmo's** and **(((HIV/AIDS)))** is a much bigger global threat.  [This](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/18FheQ1v3bz4iv5yx8hr9hg5W5BJ8WNJ8d/1CeWedJ7nyWLbL1bCT6zsZU23fAnqEsi9h/1553308945 \"HOmo\") 👺🇮🇱🏳️‍🌈👎🤮",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1579866229",
			"date_added": 1579877919
		},
		{
			"comment_id": 25,
			"body": "<pre>\n\nChina is doing the right thing. You have to try to contain the contagion until you can get on top of it.\n\nWe should be locking up the **(((HIV/AIDS)))** Jew! HOmo's too. Before they infect and murder another 30 million men, women and children.\n\n</pre>",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1579866229",
			"date_added": 1579899256
		},
		{
			"comment_id": 26,
			"body": "<pre>\n\nI think there's also an Android app called island that does this too. I don't know much about either. But I like the concept.\n\nI run Linux, Tor, Bitcoin core, Monero core, Zeronet, Freenet etc. In the background through the Android Userland app. Very sandboxed. Very smooth and fast. No battery problems..😊\n\n</pre>",
			"post_uri": "1JE6djoBJfroS1y5DnwpMWRRcMkruPpkyv_1579964935",
			"date_added": 1580013487
		}
	]
}