{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1571803065,
			"title": "help develop dex (kopy kate) more logins id",
			"body": "I am developing an improved and more decentralized big kopy kate site, I want to add more logins options, besides zeroid, I am putting CryptoID, which alias I tried to change leaving only CryptoID and is giving an error trying to save.\n\ndoes anyone have somewhere explaining how to add new logins to the big kopy site for example\n=======================\noriginal pt-br\n\nestou desenvolvendo um site do big kopy kate melhorado e mais descentralizado, quero adicionar mais opções de logins, alem do zeroid, estou colocando o CryptoID , que alias testei trocar deixando somente o CryptoID  e está dando um erro ao tentar salvar.\n\nalguém tem algum lugar explicando como adicionar novos logins ao site big kopy por exemplo",
			"added": 1571803064
		},
		{
			"topic_id": 1574322103,
			"title": "How to use Zeronet in Tor Browser (tutorial/faq)",
			"body": "http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/#how-to-use-zeronet-in-tor-browser\n\nHow to Port Forward_Open Ports on a Wireless Router - Techneek TV\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1574321640_18QeVKqxoh2nh8HK83T44dyTQ7YACNfNaU\n\nnofish I added the video that was on youtube on zeronet on Big Kopy Kate 2 site, because I think EVERYTHING that can be related to zeronet, even more of tutorials, has to be inside it, to AVOID censorship, because I know that in china youtube is blocked already.\n\nI know it is not much help, but it helps those who needed to see this video and could not access or did not want to access youtube, please if possible add it to the tutorial, this should help people who are suffering censorship around the world.\n\nThank you for your work.\n\n========================================\noriginal pt-br\n\nhttp://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/#how-to-use-zeronet-in-tor-browser\n\nnofish Eu adicionei o video que estava no youtube na zeronet, no site Big Kopy Kate 2, pois acho que TUDO que puder que seja relacionado a zeronet, ainda mais de tutorais, tem que estar dentro da mesma, para EVITAR a censura, pois sei que na china o youtube é bloqueado já.\n\nSei que não é muito está ajuda, mas já ajuda quem precisava ver este video e não tinha como acessar ou não queria acessar o youtube, por favor se possivel adicione ele ao tutorial, isto deve ajudar pessoas que estão sofrendo censura pelo mundo.\n\nObrigado pelo seu trabalho.",
			"added": 1574322101
		},
		{
			"topic_id": 1574925072,
			"title": "does data.json from the users folder have any limits?  Because mine is not being downloaded by others on the site http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest",
			"body": "does data.json from the users folder have any limits?\n\nBecause mine is not being downloaded by others on the site http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest\n\n????? \nZeroNet-win-dist\\data\\15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD\\data\\users\\18QeVKqxoh2nh8HK83T44dyTQ7YACNfNaU\\data.json\n\n\n\n362/5000\nDoes anyone know if the data.json file in a site's users folder has any limits.\n\nBecause I increased the previous limit of the site kopy kate big and now I realize that my uploaded files are NOT visible.\n\nThe limit of this file seems to be less than 2 mega in the previous version of kopy kate big mine.\n\nDoes anyone know anything about it.\n\nThanks in advance for your help",
			"added": 1574925068
		}
	],
	"topic_vote": {
		"1571571783_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": 1,
		"1572101168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1568826985_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"1573322616_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1574065256_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1574277651_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1574310770_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"1572293998_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK": 1,
		"1574529308_1MFJwynRwEkS2vHr8BH21DjDBEXcbiVZko": 1,
		"1574566358_13ak56mPXaCQC7oXYz8YWKfnkU1rRhnXuB": 1
	},
	"next_comment_id": 40,
	"comment": {
		"1571803065_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 1,
				"body": "Changing ID certificate in ZeroTalk forum http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1539971733_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb",
				"added": 1571803489
			},
			{
				"comment_id": 2,
				"body": "CryptoID\nhttp://127.0.0.1:43110/cryptoid.bit/",
				"added": 1571803505
			},
			{
				"comment_id": 3,
				"body": "What happen if one username have multi identity address? http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:7_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6",
				"added": 1571803524
			},
			{
				"comment_id": 4,
				"body": "I also wanted to add the merge system to this version of big kopy kate, would it have to change a lot?\n\n=======================================\noriginal pt-br\nqueria também adicionar o sistema de merge nesta versão do big kopy kate, será que teria que mudar muita coisa ?",
				"added": 1571803696
			}
		],
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": [
			{
				"comment_id": 5,
				"body": "good :)",
				"added": 1571936372
			},
			{
				"comment_id": 8,
				"body": "> [quac](#comment_3_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61): The BBC has been overrun by far-right conservatives. We need a communist revolution.\n\nkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk\n\n\nSince you like communism, I'll help you, just send half your money to my bitcoin wallet 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85 \n\n\n============================\n\noriginal pt-br\n\njá que tu gosta de comunismo, vou te ajudar , manda só metade do teu dinheiro para minha carteira bitcoin 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85",
				"added": 1572351423
			}
		],
		"1572101168_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 6,
				"body": "ok",
				"added": 1572137283
			},
			{
				"comment_id": 7,
				"body": "(upload = styromaniac )\ntorbrowser-9-all-OS\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd/1572103710-torbrowser-9-all-OS.zip",
				"added": 1572137449
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 9,
				"body": "Play\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1572651057
			}
		],
		"1572732591_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "zeronet is decentralized, she win",
				"added": 1572750733
			}
		],
		"1573322616_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 11,
				"body": "I turned his seed, congratulations for the initiative.\n\n=============================\noriginal pt-br\n\nvirei seed dele, parabéns pela iniciativa.",
				"added": 1573324503
			}
		],
		"1573400773_1LHXWgiFAN5D88F111t6xRHpHRQryf5WB1": [
			{
				"comment_id": 12,
				"body": "X:\\ZeroNet-win-dist\\data\\users.json",
				"added": 1573417094
			}
		],
		"1573781265_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 13,
				"body": "welcome to the real world my son, and complaining will improve zeronet?\n\nNO, you have to create your own website, clone the website and leave it under TOTAL domain YOUR, this is one of the principles of zeronet, so you GUARANTEE that NO ONE will delete your material.\n\nI'm tweaking a few things for example on the big kopy kate site, and I'm doing a version 2 of it, with mp3 support and decentralized login, because version 1 only supports the zeroid that already crashed last month and I can't run the risk of relying on something CENTRALIZED.\n\nOther than that I want to increase the file size by users to about 4Terabytes.\n\nI want to increase the current 2GB size to about 5GB per video and so on.\n\nLike I have at least had no problems so far with the big kopy kate site taking this problem out of the centralized login system they use.\n\nOther than that I think there is also a lack of playlist and audio support, I want to add mp3 and leave thumnails as background while playing the song or podcast\n\nI hope to be able to finish these improvements this year yet.\n\n==============================================================\noriginal - pt-br\n\n\nbem vindo ao mundo real meu filho, e ficar reclamando vai melhorar a zeronet ?\n\nNÃO, tem que TU mesmo criar um site seu, clone o site e deixe ele sob TOTAL dominio TEU, este é um dos principios da zeronet, assim tu GARANTE que NINGUÉM vai deletar o TEU material .\n\nEu estou ajustando algumas coisas por exemplo no site big kopy kate, e estou fazendo uma versão 2 do mesmo, com suporte a mp3 e login DESCENTRALIZADO, pois a versão 1, só dá suporte ao zeroid que já deu pau mês passado e NÃO posso correr o risco de depender de algo CENTRALIZADO.\n\nFora que quero aumentar o tamanho de arquivos por usuários para uns 4Terabytes.\n\nQuero aumentar o tamanho de 2GB atuais para uns 5GB por video e etc.\n\nTipo  eu pelo menos não tive problemas até agora com o site big kopy kate tirando este problema do sistema login centralizado que usam.\n\nFora que acho que falta também sistema de playlist e suporte a audio, quero adicionar mp3 e deixar as thumnails como fundo enquanto toca a musica ou podcast\n\nEspero conseguir terminar estas melhorias este ano ainda.",
				"added": 1573785348
			},
			{
				"comment_id": 15,
				"body": "Big Kopy Kate 2  http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\nsupported login cryptoid and zeroid",
				"added": 1574059231
			}
		],
		"1574042302_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 14,
				"body": "use this Big Kopy Kate 2\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\nadded support mkv , mp3 files now\n==========================================\nand added more space for user and unique files",
				"added": 1574054018
			},
			{
				"comment_id": 26,
				"body": "> [merithtk](#comment_101_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): new person spamming kopykate2\n\nI am going added button mute in big kopy kate 2  :)",
				"added": 1574128543
			},
			{
				"comment_id": 31,
				"body": "> [fractalzoomer](#comment_17_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): He has been spamming Big Kopy Kate 2 with dreamraffle@cryptoid.bit\n\nI saw, but I will not block anyone on big kopy kate 2, I will add the block / mute user option to the site, which is better than myself to censor ANY\n===================================\noriginal pt-br\neu vi, mas não vou bloquear ninguém no big kopy kate 2, vou adicionar a opção de block/mute user no site, que é melhor do que eu mesmo censurar QUALQUER um",
				"added": 1574374119
			}
		],
		"1574065256_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 16,
				"body": "yes, that's why Big Kopy Kate 2 I used cryptoid (decentralized) and also left it with zeroid support despite being centralized\n\nBig Kopy Kate 2\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\n================================================\ntradução pt-br\nsim, por isto Big Kopy Kate 2 eu usei o cryptoid(descentralizado) e também deixei com suporte ao zeroid apesar de ser centralizado",
				"added": 1574066144
			},
			{
				"comment_id": 17,
				"body": "http://127.0.0.1:43110/kxonet.bit/?/kxoid\n\nDifferences From Other Id Providers\nZeroId accesses a clearnet server to ensure usernames are always unique. This server handles detecting of existing users as well as the signing of the user ids. Due to this, the server is easily inaccessible by blocking its IP address (China has already done this multiple times).\n\nKaffieId is a fully decentralized Id Provider - Id Signature creation happens locally, on the computer doing the registration. Because of this, KaffieId does not ensure unique usernames.\n\nKxoId uses a collection of Trusted Peer servers. Requests are given to and sent from these servers by broadcasting over the ZeroNet network using the PeerMessage plugin.",
				"added": 1574068031
			},
			{
				"comment_id": 18,
				"body": "> [caropc10](#comment_17_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL): http://127.0.0.1:43110/kxonet.bit/?/kxoid [...]\n\nCryptoid is a fully decentralized Id Provider - Id Signature creation happens locally, on the computer doing the registration. Because of this, KaffieId does not ensure unique usernames.\nhttp://127.0.0.1:43110/cryptoid.bit/",
				"added": 1574068115
			},
			{
				"comment_id": 19,
				"body": "> [1bfqutudhtexlka](#comment_41_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): but can't this be spammed because of decentralized cert ?\n\nI don't think this is the price of decentralization terms, I added support for cryptoid login myself, knowing this, that you can use this, but I will put the mute option on Big Kopy Kate 2, to minimize this, outside of which you can block the guy manually too\n\n================================\noriginal pt-br\n\neu não acho que este é o preço de termos DESCENTRALIZAÇÃO , eu mesmo adicionei suporte ao login cryptoid , sabendo disto, que podem usar isto, mas vou colocar a opção de mute no Big Kopy Kate 2 , para minimizar isto, fora que tu pode bloquear o cara manualmente também\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home",
				"added": 1574069054
			},
			{
				"comment_id": 20,
				"body": "> [1bfqutudhtexlka](#comment_42_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): if you add the mute function that would be a lot easierbtw , can you add support for different qualities ? like pushing a script to autoconvert file while uploading using ffmpeg or vlc ?that would attract a lot of low speed internet users like me :Dthanks for your effort  btw\n\nThanks for your support, this conversion using the browser is not a priority for me: /, as I advise people to use Format Factory, which I think would be faster to convert like this.\n\nMy priority will be to add the option to mute and seed the entire content of a channel, because I think this is missing, to help anyone who wants to help maintain the content of a specific channel without having to seed all files on the channel.\n\nBut thanks for trying to help.\n\n========================================\noriginal pt-br\n\nObrigado por seu apoio, está questão da conversão usando o navegador não é uma prioridade para mim :/ , pois aconselho o pessoal usar o Format Factory, que acho que seria mais rapido converter assim.\n\nMinha prioridade vai ser adicionar a opção de mute e ser seed do conteudo todo de um canal, pois acho que falta isto, para ajudar quem quer ajudar a manter o conteudo de um canal especifico sem precisar ficar dando seed em TODOS os arquivos do canal.\n\nMas obrigado por tentar ajudar.",
				"added": 1574070241
			},
			{
				"comment_id": 21,
				"body": "> [1bfqutudhtexlka](#comment_43_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): that would be great , best of luck\n\n\n\nthanks: D and use it, I do not intend to censor anything and no one on it, so I will try to implement the mute option on it as soon as possible, it will be my priority\n\n====================\n\noriginal pt-br\n\nobrigado :D e use-o , eu não prentendo censurar nada e ninguém nele, por isto vou tentar implementar a opção de mute nele o quanto antes, vai ser minha prioridade",
				"added": 1574070711
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_1284_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You have a name.yo address?\n\nI do not have, and I think it is better to use the public address of bitcoin directly, I find it simpler, because if not later maybe you may have a problem using other things besides this, and I prefer to make as safe as possible and MAINLY as functional and durable as possible .\n\nBut thanks for asking my friend :) and use the site, I'm seeing here how to add the option to mute the site, because I do not want to remove any content, I'll just mute the user, as we have in zerome\n\n=================================================================\noriginal pt-br\n\nnão  tenho, e acho melhor usar direto o endereço publico do bitcoin, acho mais simples, pois se não depois talvez possa vir a ter problema usando outras coisas alem disto, e prefiro fazer do modo mais seguro possivel e PRINCIPALMENTE o mais funcional e duravel possivel.\n\nMas obrigado por perguntar meu amigo :) e use o site, estou vendo aqui como adicionar a opção de mute no site , pois não quero tirar o conteudo algum, vou apenas dar mute no usuário, como temos no zerome\n\nBig Kopy Kate 2 (decentralized youtube)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home",
				"added": 1574103400
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 22,
				"body": "Big Kopy Kate 2\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/\n\nlogin support cryptoid and zeroid now",
				"added": 1574078705
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 23,
				"body": "> [chiflatuki](#comment_1_15rjty4P3sNtrd9GsiVTSzanKNfyZpYqrK): there's a Q in the FAQ about this, I'm using the latest Tor Browser thanks to that. You need to go to \"about:config\" and set \"no_proxy_on\" to \"127.0.0.1\". Then you'll need to trust javascript from localhost in the noscript button. [...]\n\nthank you.  \n\nBig Kopy Kate 2\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/",
				"added": 1574078973
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 25,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1169_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): mute is your only friend. we don't care about your life or no life. go get lost who cares.\n\nexatamente.\nexactly  not democratic space , used MUTE.\n\nI am implement mute in the big kopy kate 2 is soon\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home",
				"added": 1574127625
			}
		],
		"1574210107_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "music player and video here :)   INXS - New Sensation\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1573981506_1DsvHAuPjKTAS4zPnE8Qk3oYXY1XQsMgDb",
				"added": 1574217492
			}
		],
		"1574291818_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 29,
				"body": "used jdownloader :)",
				"added": 1574309710
			}
		],
		"1574322103_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 30,
				"body": "> [fractalzoomer](#comment_18_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): Tor browser recently removed the \"No proxy for\" setting in about:preferences, and the docs still haven't updated to provide working instructions. See this thread for how to get around it.\n\nyes, thank you for updated :)",
				"added": 1574350630
			}
		],
		"1574380537_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 32,
				"body": "use Big Kopy Kate 2,  \n\nINXS - New Sensation\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1573981506_1DsvHAuPjKTAS4zPnE8Qk3oYXY1XQsMgDb\n\nSevendust - Enemy\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1573981768_1PuHtY462fXHRc2p1kPGKowJumoE8R2o3z",
				"added": 1574381810
			},
			{
				"comment_id": 33,
				"body": "> [somuchfood](#comment_18_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): I am sceptical about your link, since the official kopykate url is \n\nyes this is unofficial mine, I clone and improved the site, added support for cryptoid login (decentralized), added support mp3, mkv (doesn't work on firefox), support for sending single 15gb files, support for a 2 terabyte limit per user account so far, I added support for thumbnails up to 250kb.\n\n===============================================\noriginal pt-br\nsim este meu é NÃO OFICIAL, eu clonei e  melhorei o site, adicionei suporte ao login cryptoid (descentralizado) , adicionei suporte mp3, mkv (não funciona no firefox), suporte a enviar arquivos unicos de 15gb , suporte a uns 2 terabytes de limite por conta de usuário até o momento, adicionei suporte a thumbnails de até 250kb.",
				"added": 1574460968
			},
			{
				"comment_id": 35,
				"body": "> [somuchfood](#comment_18_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): I am sceptical about your link, since the official kopykate url is http://127.0.0.1:43110/big.kopykate.bit/\n\nthere, I also made myself update or clone the site, because the original owner didn't update the site, and I want to add the mute user, playlist and etc option to big kopy kate 2\n\n======================================\noriginal pt-br\nhá, eu também me obriguei a atualizar ou clonar o site, porque o dono original não atualizava o site, e eu quero adicionar a opção de mute user, playlist e etc no big kopy kate 2",
				"added": 1574478900
			}
		],
		"1574259710_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 34,
				"body": "They Live (Eles Vivem) 1988 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1563873211_1AuxFfYUeKuSqqtkUCRRfJDKj5S8BnStjo\n\ngreat film :)",
				"added": 1574475507
			}
		],
		"1574777872_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 36,
				"body": "someone is managing to download this video ????\n====================================\n\noriginal pt-br \nalguém está conseguindo baixar este video  ???",
				"added": 1574835350
			},
			{
				"comment_id": 37,
				"body": "> [1bfqutudhtexlka](#comment_72_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): please upload movies in english with no spanish translation , also with a lower quality like 360p , not all of us have high speed internet\n\n\n\nblz, I will try to send the films in the original qualities that I have here, for now, probably, I will continue to send more or less as I am in the audio issue, which in this case, many are voiced in Brazilian Portuguese\n\n======================\noriginal pt-br\n\nblz, vou tentar enviar os filmes nas qualidades originais que tenho aqui, por enquanto, provavelmente , vou continuar enviando mais ou menos  como estou na questão de audio , que no caso , muitos estão dublado em portugues brasileiro",
				"added": 1574844813
			},
			{
				"comment_id": 38,
				"body": "> [1bfqutudhtexlka](#comment_73_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): can't you just upload(seed) both dubbed (spanish or watever) and original english and lower quality ?\nyou upload good films but unfortunately i can't understand anything :D\n\nyes i will try to fix this when i was able to add subtitle support and two audios or more in the big kopy kate 2 player.\n\nFirst I am studying to add the option to lock a channel.\n\nThen I will probably try to add the playlist function and then I should run after this function, at the moment, I can even upload files with more audios, but they will not be selectable in the normal browser player, I want to create a player as soon as I finish study javascript and etc\n\n============================================\noriginal pt-br\n\nsim, eu vou tentar resolver isto, quando consegui adicionar suporte a legenda e a dois audios ou mais  no player do big kopy kate 2.\n\nPrimeiro estou estudando para adicionar a opção de bloquear um canal.\n\nDepois provavelmente vou tentar adicionar a função de playlist e depois devo correr atrás desta função , no momento, eu até posso enviar arquivos com mais audios, mas não vão ficar selecionaveis no player normal dos navegadores, eu quero criar um player assim que eu terminar de estudar javascript e etc",
				"added": 1574851245
			}
		],
		"1574925072_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 39,
				"body": "> [randomshits](#comment_264_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Kopy.Kate.Big has a hard coded file limit on the number of uploads a user can preform.You can meet your file limit at KK and not be able to publish any more,  but still be able to post comments at other places. [...]\n\nBig Kopy Kate 2  http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home",
				"added": 1575006710
			}
		]
	},
	"comment_vote": {
		"1148_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1149_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1150_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"258_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"169_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"257_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"3_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1145_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"2_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1139_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"168_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"1155_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"22_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1124_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"19_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": 1,
		"1271_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"36_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1120_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"35_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"41_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"42_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"43_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"16_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"1_15rjty4P3sNtrd9GsiVTSzanKNfyZpYqrK": 1,
		"1284_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1169_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1292_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"18_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"320_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"18_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"62_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"11_14Py1jF6kNycrGV9LBhLEbYvupJWNAcPd3": 1,
		"72_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"73_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1
	}
}