{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1557305222_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1553407395_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 1,
				"body": "You need to copy configs from data/ directory. Usually its' users.json (your ID) and sites.json (your \"subscriptions\").",
				"added": 1553504833
			}
		],
		"1553340416_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "Google already replaced \"don't be evil\" to \"do right things\".",
				"added": 1553504981
			}
		],
		"1553710396_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 3,
				"body": "There are no accurate stats. The only stats you can see are on sidebar.",
				"added": 1553834668
			}
		],
		"1554091689_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 4,
				"body": "Traditional e-mail is decentralized itself.",
				"added": 1554097929
			},
			{
				"comment_id": 5,
				"body": "> [d14na](#comment_90_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @snax email seems so \"legacy\"; why not use matrix? offers integrations (video link) to irc, telegram, slack, and so many others.\n\nemail forever\n\nMatrix is full of web 3.0 crap. It's good for fighting against new proprietary services like discord but it's not good solution in general.",
				"added": 1554190199
			}
		],
		"1554327160_12x9LSYMyy5B7Dgy2LviuD5B2TkJRwRNd6": [
			{
				"comment_id": 6,
				"body": "Yes. But if you want to follow easy way you should use your zite as main source of information.",
				"added": 1554362630
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 7,
				"body": "Not us",
				"added": 1554957475
			},
			{
				"comment_id": 9,
				"body": "> [deliriumgoddess6](#comment_22_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): ...and being lost in past...\n\nIf so called \"future\" gone wrong it's better to go to past and choose different way.",
				"added": 1555059538
			},
			{
				"comment_id": 10,
				"body": "> [shitnotworking](#comment_3_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Doomed to repeat the failures of the past because you're stuck in it...\n\nNope. Because it's not repeating - it's different way.\n\n> [shitnotworking](#comment_3_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): ALSO : for people so against the MEDIUM (phone) you sure as hell don't have any issue being here on Zeronet using a COMPUTER (which your phone is anyway). Back to the Sheep-papers with you hypocritical, contradictory lot...\n\nDo you read what people write here? It's not about \"let's go to live in cave as primal society\". It's about wrong ways. Nobody here claimed computer or phone is bad.",
				"added": 1555313181
			},
			{
				"comment_id": 12,
				"body": "> [shitnotworking](#comment_6_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Sad = bad. Get real, dude. And yes, I clearly have read anything anyone else has said here because at least half of them automatically attributed people being in their phones as a sign of degeneracy...ya know, BAD.\n\nThen you are trying to substitude words just to blame everyone for nothing.\n\n> [shitnotworking](#comment_6_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Don't forget you suggested it yourself...\n\nYou are liar.",
				"added": 1555388834
			},
			{
				"comment_id": 14,
				"body": "> [shitnotworking](#comment_8_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): So I'm a liar because you don't know how to assert context to your own empty usage of a word?\n\nNo. Because you are trying to attribute me the words i didn't say.\n\n> [shitnotworking](#comment_8_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): You're not even using \"lair\" correctly...\n\nReally? I see you don't use your head correctly.\n\n> [shitnotworking](#comment_8_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): how about you take your ass to these books and paper sheets you're so gungho about and learn what \"context\" and \"critical thinking\" are before you start asserting that people being enamored with something more interesting than what you like are sheep...\n\nSay that to yourself, you moronic dickhead. ^_^",
				"added": 1555478824
			},
			{
				"comment_id": 15,
				"body": "> [shitnotworking](#comment_11_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): 1 - Has nothing to do with Nazi's\n\nIndiscriminate surevillance is fascist/nazi principle.\n\n> [shitnotworking](#comment_11_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): 2 - There is no difference...you're still sitting butt-clinched on the notion that the phone by default is stupid simply because you can't figure out how to prevent it from having the ability to spy on you\n\nYou said that as if it's something good.\n\n> [shitnotworking](#comment_11_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Phones aren't stupid, the people using them to relay sensitive information are stupid.\n\nModern \"phones\" (so called smartphones) are designed for stupid usage way.",
				"added": 1555479351
			}
		],
		"1554989632_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 8,
				"body": "> [deadfwd2018](#comment_9_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr): Well he did divulge the secrets of an entire nation. Flip it around, what if he did that to Russia? He would have been dead now.\n\nAnyway this is wrong. He isn't even US citizen. The fact that government can grab citizen of other country just because they want is one of the greatest modern world falws. And, of course, i wouldn't say government is nation.",
				"added": 1555057244
			}
		],
		"1555185007_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 11,
				"body": "Moore's law is just another marketing bullshit.",
				"added": 1555313555
			},
			{
				"comment_id": 13,
				"body": "> [krixano](#comment_748_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Moore's law is not BS, it's an actual thing - but don't let the word \"law\" confuse you (It's not an actual law, it's just a statistical observation). The person who created moore's law didn't think it would even last as long as it had, which is why people, for some odd reason, think that it will continue - that computers will continue to get faster (in the way described by moore's law) - which makes absolutely no sense imo considering that we're already doing stuff at an atomical level and electricity requires electrons which are part of atoms. [...]\n\nIt's not even about computer performance - it's about doubling amount of transistors in IC. This is why Moore's law flawed. The right way to develop computer tech is to reject electronics in favor of photonics because silicon technology was already achieved its limits about 8 years ago. Transistor size in so called 7nm is almost same as in 22nm.",
				"added": 1555392756
			}
		],
		"1556607688_1H5wGKGegeLwa9YFW2u9o63SonLabbPLyr": [
			{
				"comment_id": 16,
				"body": "ZeroNet is not anonymous network.",
				"added": 1556611376
			}
		],
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 17,
				"body": "Zeronet is not market and it's not for market.",
				"added": 1556993930
			},
			{
				"comment_id": 18,
				"body": "> [subxero](#comment_3_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL): By mass market I mean the internet at large. Is it ready for the mainstream and tens of thousands (or more) users. Same way that a physical product is moved from development to mass market/ global deployment.\n\nAny conscious thing isn't ready for mainstream by its nature. Mainstream is always dumb and anti-community.",
				"added": 1557057677
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 19,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_122_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): not sure about muslims,Historically, the Arab people, and we have seen it in the Middle East for decades, even for more than a century, are used by Jews (at least the millienarist freak fringe) to destroy Christianity. [...]\n\nChristianity is judaism sect. There is no much difference between christianity and judaism (jews religion). The main book of christianity is even torah (aka old testament).",
				"added": 1557980743
			},
			{
				"comment_id": 20,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_134_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Christianity is judaism sect.\" lolFor people (Jews) who do not recognize Christ's act of redemption,to say that Christianity is a Jewish sect,is either coming from a totally ignorant person, or a totally mad man, or both, because the two usually work together.\n\nLooks like you don't know the definition of sect. The ignorant person is you are.",
				"added": 1558081836
			}
		],
		"1558041340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 21,
				"body": ">I am a Christian, therefore not Jewish\n\nChristianity is branch of judaism. It's same religion.",
				"added": 1558084332
			},
			{
				"comment_id": 22,
				"body": "> [nickwa](#comment_135_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): This is why I find it funny when Christians, and Jewish people fight. You just change a little bit, and call it something else.\n\nAnother funny fact: christains fight each other, as well as jews, muslims, etc. There is no even need to call it different and change a bit.",
				"added": 1558086094
			},
			{
				"comment_id": 24,
				"body": "> [kropptyler](#comment_16_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): Atheists fight each other. This is no insight.\n\nUnlike others atheists fight each other not for religious reason.",
				"added": 1558420719
			},
			{
				"comment_id": 25,
				"body": "> [zeron2](#comment_3_1CBD6Wmq8KBDMFRXb5Bz5DFjcZgc42a59S): Nope [...]\n\nNazism has nothing to do with socialism. At the same time christianity is a branch of judaism. Conclusion from title is oftenly wrong.",
				"added": 1558420876
			}
		],
		"1558288311_17TtMnYrVFMh1z7Bvn8QYPUyJ4zL9bhJk9": [
			{
				"comment_id": 23,
				"body": "What do you mean? Do you want to delete your zite completely?",
				"added": 1558414185
			}
		],
		"1560304454_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "Christianity == church. Another statement is heresy.",
				"added": 1560755185
			}
		],
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 27,
				"body": "> [anonymouslogin](#comment_341_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): It seems to be the case that criminals are the first to adopt and abuse unregulated technology. Unfortunately it often gives the technology a bad reputation in polite society.\n\nThe only and one digital platform for criminals is clearnet. Darknets don't have suitable audience for illegal things.",
				"added": 1560755319
			}
		],
		"1561935650_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 28,
				"body": "You could use ascii-art. In current state your post is pathetic.",
				"added": 1561971276
			}
		],
		"1561776860_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 29,
				"body": "Actually so called \"mother fucker sites\" are social media accounts.",
				"added": 1561975894
			}
		],
		"1562445173_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 30,
				"body": "> [mg0](#comment_75_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I think old P4 are CPUs free of infamous intel ME, that could be a use for them but their cpu power is not great anymore, don't expect smooth W10 on them even with good mobos and SSDs. If avoiding ME is the goal at hand, AMD processors didn't include PSP until late 2013 models afaik so there are more recent CPUs from AMD.\n\nMost of intel CPUs have meltdown/spectre backdoor since Pentium Pro. P4 was total crap even in 00's.",
				"added": 1562578254
			}
		],
		"1564865132_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 31,
				"body": "However, Bob Lazar is much more inaccurate.",
				"added": 1564921719
			}
		]
	},
	"comment_vote": {
		"11_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"10_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1,
		"346_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"24_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"9_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr": 1,
		"1_12aP9VpiXhkCuYDpT7jpK5qbSMBt8m2jb8": 1,
		"40_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"211_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"4_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"105_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"253_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"252_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"9_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"133_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"135_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"3_16WUTDjmD5j8EznVUgLiksh4Eg2SbFnX35": 1
	}
}