{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1552607359_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1551158338_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 1,
				"body": "http://thehomegunsmith.com/ < this guy has published several guides on making guns from stuff you could find at a hardware store. Very interesting stuff",
				"added": 1551215609
			}
		],
		"1552607359_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "This is one of the reasons I'm shit terrified of things like auto-correct. I'm not a programmer, but I know enough about programming to know that making it possible to undo auto-correct is extra work that the devs can undo if it behooves them. I doubt it would be difficult to add a hook that scans messages and \"corrects\" them right before they send, making it impossible to undo. God I can't wait till the Librem 5 ships.",
				"added": 1552675243
			}
		],
		"1588888253_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 3,
				"body": "The size limit on every zite is set by the user. You can do things on your own you know, you don't need to wait for someone else to do it for you.",
				"added": 1588894815
			},
			{
				"comment_id": 4,
				"body": "> [zenanon](#comment_82_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): But this isn't the zite size limit. This is the \"USED: ??k/50K\" indicator to the bottom right in the text entry areas for ZeroTalk.\n\nAh, my apologies. ZeroTalk is a very old zite and I'm not sure how it stores and shares posts on it, there may have to be a major rewrite of its code in order to make it economical to raise to data limit. In the early days people used to do some weird stuff to get zites to work. There was one zite, which I can't remember the name of, that you had to connect to a server in order to post messages to it, though the messages were shared over ZNet.",
				"added": 1588909663
			}
		],
		"1588835683_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 5,
				"body": "8ch:\nMillchan http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\n08chan http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/\nYoutube:\nKopyKate http://127.0.0.1:43110/big.kopykate.bit/",
				"added": 1588909981
			}
		]
	},
	"comment_vote": {}
}