{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1549299548,
			"title": "/GAFAM/ board at Millchan",
			"body": "There is a /GAFAM/ board at ZeroNet's 4Chan, aka Millchan. \nIf you also love to hate Google, Apple, Facebook, Amazon, Microsoft and the surveillance capitalism they represent, then that's your place to casually discuss your nightmares and share your memes about them.\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X:GAFAM:0 ",
			"added": 1549299546
		},
		{
			"topic_id": 1559028625,
			"title": "How should I convert a .avi file to .webm using ffmpeg before uploading it to KopyKate?",
			"body": "I have an .avi file that I should convert before uploading it to KopyKate. \nI have basically no experience in converting video files. \n\nAll I know that command ```ffmpeg -i input.avi output.webm``` converts it but I don't know anything about converting parameters.  Do you have any recommendation which extra parameters would be good to set?",
			"added": 1559028622
		},
		{
			"topic_id": 1559644878,
			"title": "Allen Carr's famous video - Easyway to Stop Smoking is shared on ZeroNet",
			"body": "I'm not a smoker but I know that lots of people are trapped by the cigarette industry and cannot escape.\n\nI have herd a lot about Allen Carr's method and its amazing effectiveness. Allen Carr has a 1 hour video that has a good success rate to make people stop smoking immediately after watching it. \n\nI have seen it on YouTube and it is believable that it can help to quit smoking instantly. \nIt is also useful to be watched by nonsmokers because they can learn why it is so difficult to escape from the smoking trap.\n\nSince then it has been deleted from YouTube  and it was extremely difficult to get it, but now I have it and I have shared it on KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Video=1559642472_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW\n(please help seeding it)\n\nI have also created a poll for asking how many people in ZeroNet are struggling with escaping the smoking trap:\nhttp://127.0.0.1:43110/ZeroPolls.bit/?Poll:1-1HEBittLV8ADkGMhNehgZKsciCokp1RhUW\n\nPlease, comment bellow if you have any experience or opinion about that video or about quitting smoking.",
			"added": 1559644874
		}
	],
	"topic_vote": {
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1549299548_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1,
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1559028625_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1,
		"1559644878_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 1,
				"body": "```\n    \"certs\": {\n      \"zeroid.bit\": {\n        \"auth_address\": \"1HEBittLV8ADkGMhNehgZKsciCokp1RhUW\", \n        \"auth_privatekey\": \"5JFUusZvmVPwibYfXHKakMUQoVETGjiYfsGZEPbQXjwmNwjwHbi\", \n        \"auth_type\": \"web\", \n        \"auth_user_name\": \"bananon\", \n        \"cert_sign\": \"G93PUopNEVVBwVEptnwQ2RNKQOXESgStrtqDWs0TmXPrH7ji3iOBnT6oRZDmYAPF6eG388S2N74JG1lxGDFkonI=\"\n      }\n    }, \n    \"master_seed\": \"5a9e3a5040ad8ed8891e8740b3c88707b8aa288b7048e8e42ba72dcacb826b94\", \n```",
				"added": 1545663195
			},
			{
				"comment_id": 2,
				"body": "The main reason for using [anonymouslogin@zeroid.bit](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X/Anonymous+Login) or any other shared ZeroID is probably to stay anyonymous (keep the identity is completely unknown) and not just pseudonymous (not using the legal name to identify oneself). For that I see no better solution than using these accounts and/or changing the ZeroID frequently. Both solutions have some difficulties, but what can we do until someone comes up with a better solution..",
				"added": 1546034502
			},
			{
				"comment_id": 3,
				"body": "@zeronetisshit: Wouldn't be better to drop shared@zeroid.bit from the list until its master_seed is also shared?",
				"added": 1546198075
			},
			{
				"comment_id": 4,
				"body": "I'm not sure that a ZeroTalk thread is the best place for this SharedID list because new ZeroNet users will hardly learn about this option. Unless we BUMP it frequently.",
				"added": 1546862216
			},
			{
				"comment_id": 6,
				"body": "> [quantumworld](#comment_150_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Zeronet needs an anonymous posting option built in\n\nYes. Strange that we do have PoW-based certificate authorities (CA), but no PoW-based user certs, that will help a lot in this. Give ZeroNet site developers that ~~fucking~~ choice at least. No one will use PoW-based CAs ... it serves little purpose and once it has been generated that CA can generate an unlimited amount of users... good prioritization and solution @nofish",
				"added": 1547524952
			},
			{
				"comment_id": 10,
				"body": "Could someone, please, write a script that randomly chooses from these accounts before running ZeroNet?",
				"added": 1554313329
			},
			{
				"comment_id": 11,
				"body": "> [anonymouslogin](#comment_204_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): --multiuser-local\n\nSounds good, but how to use that? \nThe obvious guess: ```./ZeroNet.sh --multiuser-local``` does not work...",
				"added": 1554905847
			},
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_206_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): You have to enable multiuser plugin. In your ZN instalation there is a folder named plugins. Go there and find a folder called disabled-Multiuser and rename it to Multiuser. Back up your users.json from data folder first (for example by copying it to the desktop)\n\nThanks!",
				"added": 1554929583
			},
			{
				"comment_id": 21,
				"body": "Why do you use these shared IDs?\n\nMy main reason is to avoid the potential tracking and profiling which is simpler than you might think: [Methodology -- Find someone's trace in ZeroNet](http://127.0.0.1:43110/hackertalk.bit/?Topic:2_1HK5C3Uf8zvbbSb92ZP6EsfHKC59MXDcK9/Methodology+Find+someone+s+trace+in+ZeroNet)",
				"added": 1561443986
			}
		],
		"1547351886_1FwDqRAQggNDskwBo4ZLXPWC69tSajS4aX": [
			{
				"comment_id": 5,
				"body": "I think you need to use `@nofish` next time,  I don't think `@Nofish` will trigger a notification for him.",
				"added": 1547524609
			}
		],
		"1549299548_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 7,
				"body": "Wow. No reaction? I was expecting that there are plenty of anti-G.A.F.A.M. people here on ZeroNet.",
				"added": 1549755131
			},
			{
				"comment_id": 8,
				"body": "> [eightyfour](#comment_70_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Hey, totally am! Not sure what you're expecting though...\n\nNothing particular. Just be active there: comment, start threads about GAFAM related thoughts and news, post your favorite memes, etc.  \n\nMillchan is a theme oriented discussion boards. It is based on us which themes will prosper and which will die out. \n\nAlso Millchan is one of the top seeded Zites on ZeroNet. So our activity/inactivity there counts how attractive ZeroNet is for newcomers. I guess the surprisingly low and stagnating popularity of ZeroNet is mainly due to lack of content. On Millchan it is easy to add content without the ability to create a new Zite.",
				"added": 1549961303
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 9,
				"body": "I think it is growing and improving, but very very slowly (unfortunately).",
				"added": 1554213900
			}
		],
		"1557968684_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 13,
				"body": "> [sharer](#comment_54_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P):     anal: WTF there are ads on it ? What kindda server cost do you need to cover ??\n> It is a small personal profit as I am the one doing the maintenance of this zite, fixing bugs and stuff. Only a clock works for free in this world.\n\nI haven't spotted the adds before because of my add and script blockers. \n\nAdds led to surveillance capitalism, which may lead to police states and tyranny.  So, sorry but I cannot accept your excuse for adds. I have stopped seeding your zite. I'm really sorry because it was a nice one. \n\nWhy don't you try asking for donation and/or add an opt-in mining script? \nThose are noninvasive ways to collect some funding.",
				"added": 1558124216
			},
			{
				"comment_id": 14,
				"body": "> [sharer](#comment_55_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): OK then. Next time I update it I'll set a mining script to be included by Javascript if the user wishes to contribute and remove those ads. When I tried the optional mining script for donations on my ShareTube Project, I've been accused of spreading malwares even though the script was engaged only if the user clicks in \"donate CPU\" at the bottom-left corner of the page.\n\nCool! \nI'm seeding the Zite again. \nI don't mind donating some CPU time if it is not invasive.",
				"added": 1558521359
			}
		],
		"1559028625_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 15,
				"body": "Thanx for the comments. I used satoxyn1's method. It worked perfectly: \nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1559642472_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW",
				"added": 1559643085
			}
		],
		"1559829157_14MHxcFsxWxxJzBAGwHjoP38625Pv7FaeB": [
			{
				"comment_id": 16,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_193_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): everything is cyclical.\n\nYes. And the current changes in climate are mostly due to variations in solar output among other factors, we're in a grand solar minimum right now.\n\nhttp://www.spaceweather.com/",
				"added": 1559946941
			}
		],
		"1559682182_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "> [anonymouslogin](#comment_324_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Why do you put problem in quotations\n\nDo you know why it's called a \"greenhouse gas\"? Well it's used in greenhouses to promote plant growth, also CO2 consist of Carbon (C) and Oxygen (O2), plants absorb C and emit O2. It's pretty much the gas of life. It only makes up 0.04% of the atmosphere and water vapor has a far greater effect on trapping heat on earth. CO2 levels were far greater in history and plants did very well in these periods of higher CO2 concentrations.\n\nSorry no citations.",
				"added": 1559947606
			},
			{
				"comment_id": 18,
				"body": "> [anonymouslogin](#comment_318_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What Green New Deal? They are led by Major Bullshit\n\nIt's gonna happen, I've yet to see good opposition to the ~~Green~~ Red New Deal.\n\nhttps://en.wikipedia.org/wiki/Green_New_Deal#Supporters",
				"added": 1559947728
			}
		],
		"1559937565_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 19,
				"body": "Love? Nothing. Well okay, I love the fact that it just works.",
				"added": 1559947841
			}
		],
		"3_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 20,
				"body": "> [ssdifnskdjfnsdjk](#comment_843_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): currently active zeronet proxies: [...]\n\nThanks, almost no one visits the wiki I suppose",
				"added": 1559947950
			}
		]
	},
	"comment_vote": {
		"150_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"154_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"348_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"206_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"55_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"2_1KGEnPA49Rg9ZRfptt1aRHea9xjSWGqiTD": 1
	}
}