{"cert_user_id": "nomagics@github", "next_comment_id": 9, "comment": {"1604068014_mirrored_slrslr_github": [{"comment_id": 1, "body": "For what you using latin-1? Use **utf8**. Change it back how it was and it will work. ", "added": 1587973966, "modified": 1587973966, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2538#issuecomment-619902811", "source_type": "github"}], "1604067958_mirrored_filips123_github": [{"comment_id": 2, "body": "don't waste your time @filips123 I for example don't even ever used merger. For that matter the plugin is disabled and removed completely in my fork. (Not public yet)", "added": 1587973857, "modified": 1587973857, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2540#issuecomment-619901763", "source_type": "github"}], "1604067926_mirrored_anmol26s_github": [{"comment_id": 3, "body": "Well, first of all hello. \r\n\r\nYou should use Python3 instead of Python2 for that system service. I can share with you my system service and if needed than configuration for Apache2. I don't use nginx. \r\n\r\nAlso you could try to proxy to 127.0.0.1:43110/**raw**/bitcoinaddress instead of trying to proxy to the frame. ", "added": 1587973638, "modified": 1587973680, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2541#issuecomment-619899659", "source_type": "github"}, {"comment_id": 4, "body": "I'm more than sure that if you set https://github.com/YunoHost-Apps/zeronet_ynh/blob/master/conf/nginx.conf.template to proxy requests for 127.0.0.1:43110/**RAW**/bitcoinaddress will work. \r\n\r\nYour config should first UNSET headers on the back-end which shipped with ZeroNet (see UiRequest.py) and than SET new headers on the front-end. ", "added": 1587974404, "modified": 1587974501, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2541#issuecomment-619907077", "source_type": "github"}, {"comment_id": 5, "body": "@HelloZeroNet The nginx config has nothing to do with the version of python! I told him to use version 3 of python because @anmol26s's system service was clearly used python2 to start ZeroNet. In the other hand the headers should be unset on the back-end servers (where zeronet is running) before adding new headers on the front-end. \r\n\r\nProxypass should point to 127.0.0.1:43110/**RAW**/bitcoinaddress and not the framed version! (Frames can't be read by search engines, or at minimum they will penalize the website owner...)\r\n\r\nThanks @filips123 ", "added": 1587994049, "modified": 1587994049, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2541#issuecomment-620092824", "source_type": "github"}], "1604067927_mirrored_nomagics_github": [{"comment_id": 6, "body": "How you host dynamic websites if the content is not even available for the general public because of your frame? So fucking stupid! If the config setup good you can run dynamic websites without frames because you UNSETTING HEADERS on the back-end which will pass the data to front-end over firewall. The frame only presented to the server running ZeroNet locally but you can escape the frame with reverse proxy in anyway. If you don't escape the frame **YOU WILL BE PENALIZED!!!** @filips123 @imachug Are this guy is really this retarded? Fuck you Tamas, you are disgustingly stupid.", "added": 1587995764, "modified": 1587995786, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2542#issuecomment-620108148", "source_type": "github"}, {"comment_id": 7, "body": "I know @filips123 that is why I kept the frame in my fork. But for a reverse proxy which want to display the site on example.com don't need frame! Why would? \r\n\r\nThe back-end is loaded in frame but the front-end is not and should not if you don't wanna be penalized.", "added": 1587997081, "modified": 1587997081, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2542#issuecomment-620119970", "source_type": "github"}, {"comment_id": 8, "body": "There is some misunderstanding I see. @filips123 \r\n\r\nThere is two server;\r\n\r\n- one with zeronet and some web server on the back-end. (reverse proxy)\r\n- other on a front-end with a web server and config for example.com\r\n\r\nfront-end over firewall connect to xxx.xxx.xxx.xxx:80 (which is the back-end)\r\nthe reverse proxy pass from port 80 to port 43110 for **RAW** or for frame and back.\r\n\r\nThe back-end is not exposed to the public at all! It is sitting behind a firewall (actually two firewalls)\r\n\r\nRegarding the headers. \r\nZeronet send headers using UiRequest.py which can be unset or changed on the back-end, if you send other headers using the web server which is the reverse proxy than you send from both UiRequest.py and from the web server MIXED headers. \r\n\r\nIf you pass the data to front-end and the front-end has a web server (which facing publicly) than you will end up with headers supplied from 3 different place. The better is to unset headers on the web server running on back-end and add the necessary headers on the front-end.\r\n\r\nFrames are not needed and useless on the public Internet. You will be 100% going to be penalized by search engines!\r\n\r\n\r\n\r\n\r\n", "added": 1587997789, "modified": 1587997985, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2542#issuecomment-620126002", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604067927, "title": "Wrong configuration for Nginx reverse proxy on zeronet.io", "body": "Hello,\r\n\r\nAlways need to open new issues because the maniac Tamas Kocsis closing issues without any useful contribution to solve those issues. He not even reading them. \r\n\r\nThe problem is that on zeronet.io (https://zeronet.io/docs/faq/#how-to-configure-nginx-reverse-proxy-for-zeronet) which linked by @HelloZeroNet here https://github.com/HelloZeroNet/ZeroNet/issues/2541#issuecomment-619966957 is wrong! \r\n\r\nIf someone want to set-up a reverse proxy Proxypass should point to 127.0.0.1:43110/**RAW**/bitcoinaddress or the search engines will not able to index the site, if by some magic some robot do index it than the **entire website will be penalized**!\r\n\r\nFrames are not for search engines so stop recommending bullshit to people! Also as I said here https://github.com/HelloZeroNet/ZeroNet/issues/2541#issuecomment-620092824 the headers what you wrote to the config file you unfortunately recommend SHOULD NOT contain headers at all because in a reverse proxy the headers are sent by the front-end and not the back-end! If you send the headers with the back-end you will mess up things you never even imagined and as a programmer I can tell there is no logic behind that because you sending other headers with UiRequest.py as well. \r\n\r\nProviding different headers in the core, back-end and on the front-end is irresponsible and stupid. Headers should be only presented at the publicly facing front-end and as I said proxypass SHOULD point to 127.0.0.1:43110/**RAW**/bitcoinaddress because your fcking ZeroFrame are not needed and useless on the public internet!", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1587994969, "modified": 1588002425, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2542", "source_type": "github"}]}