{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1616048739,
			"title": "Australia, prison-continent?",
			"body": ">Half of Austrians fear stating opinions publicly, citing over-the-top political correctness & fear of being branded ‘alt right’ \n>Just over one third of respondents believe it is only possible to speak freely in private, while 29 percent consider the internet a place where one can “speak one’s mind freely.” A striking 60 percent said it’s not possible to speak freely online.\n\nhttps://www.rt.com/news/518404-austria-political-correctness-public-opinions/\n\n>Australian spy chief dumps ‘right-wing’ & 'Islamic’ extremism terms – that’s woke nonsense and denial of reality\n\n>“We want to be clear about who poses a terrorist or violent extremist threat and why ASIO is interested in them,” he said. “Australians should not think that their security service is looking into them because of their political or religious views.”\n\nhttps://www.rt.com/op-ed/518411-australia-spy-islamic-extremism-rightwing/\n\nWhen the2ndA back?",
			"added": 1616048738
		},
		{
			"topic_id": 1616087567,
			"title": "I had my first covid \"vaxx\" nightmare...",
			"body": "It was strange... I had a sort of syringe but it was more like a pen, and those vaxxbottle... and you know very strange, but at the end, I didn't inject it but drank it... I mean !?!?!?!\n\nI guess, as they believe we are cattles they prepared forced aerosol injection...\n\nbad bad ! \n\nI need to watch something else... my mind is being hacked !!!",
			"added": 1616087565
		},
		{
			"topic_id": 1616087739,
			"title": "The words \"community\" to replace the word citizens is a tell sign of propaganda operations of the UNO / global agenda...",
			"body": "introduced by the pedo demonic administration of the mullato 44.\n\nI like too that their is the idea of commune in community... in the sense of propriety. the community belongs to it's owners.\n\nsadly for westerners, their owners are pedo feodalists seeking planetary serfdom...",
			"added": 1616087736
		},
		{
			"topic_id": 1616091369,
			"title": "50 years of jail for daniel portley-hanks !",
			"body": "go go go ! ahhahaha.",
			"added": 1616091365
		},
		{
			"topic_id": 1616102046,
			"title": "Do you think the american patriots are still enough in control to be able to deploy a (counter)-normalization plan?",
			"body": "\nthe real question, is were they ever? asking... but already asking is betraying the premise :). What amuses me the most is this idea of shadow empire, or as pedogen mattis refeered as strategic depth. \n\nfor me it looks like crambeling scale... it may look wide and strong, but in reality it's to me shattering glass... it's so full of underlying structural already exposed weaknesses, I am curious how long the illusion will last... specially with the unknown one, as already the known are unaddressed :).\n\nthe real underlying there? that's it's so long ago, as the unraveling of the whole american scams, only really ask to which to stop. a myth gone, to let only a factual basic and cold history in an analytical sense. \n\nit was a cool narrative if I may say ! I guess I really liked the roman reference... sadly if I may say rome walls may have been narrative (marble decoy) but not the narrative ! because it's the narrative that build the walls (behind the plasters).\n\nTo reformulate, Rome was a narrative that build a civilization, while the USA was a conquest who took a narrative. A conquering lie... or a vicious large scale armed scam :), a stream of lie.\n\nit's the idea of planetary that wrapped you, this illusion of control because of being able to apprehend the idea of planet. A planet... nothing fancy... galaxies, universes etc etc. But in the concrete... there is a big difference in being able to conceive an idea and being able to rule it, specially if ruling means dictating...\n\nthe funniest things with social science backed herding? or the application of systemic and methodical behavioral, comportmental and others form of subversive overt and covert form of manipulation, is the critical failure !\n\nand there is to me two main approach ; a naturalist universalist based... the path of God ! In the creation, from the creation, to the creation, at least... some parts :). It's really AXES on liberty !\n\nand the others a pseudo, \"i am god\" I know what's right for you, obey or else...\n\nay ay ay it's an invitation to... certain forces of the universe...  you know there is action and reaction... I don't say those forces need action to react, aka they can be action too, but again... find your own truth, there is enough truth in the whole universe for all. why? hehehe.\n\nconclusion : proudness is a sin... or as the fox said to the crow...",
			"added": 1616102041
		},
		{
			"topic_id": 1616103694,
			"title": "Forced Involuntary Medical Intervention (aka covaxxnazi protocol) on us troops...",
			"body": "ohhhh... interesting... at one point, it will be the most noobish defeat in the entire history of warfare ! \n\nyour combat structure, is not working, kiddies...\n\nnot at all.\n\nanyway, only God knows what the future is made off, but still...\n\nlet's say the vaxx is safe, okay, but you took the risk of it not being...\n\nwhat does it tell?\n\nanyway...\n\nwhat difference does it make at this point?\n\nor submit to the uno or fight it.\n\nand don't fuck with china, you will get smashed faster than with involuntary medical intervention :)... dead. assured.\n\nbut I learned something cool, is that all those who had fragged the first emperor rome were fragged later :). \n\ncounter fragging...\n\nthe shit news? the imperial pull will be later at the uno later consolidation stage (worst...)... \n\nbut as said, who knows what the future hold...\n\nthe new religion will morphed so fast to the \"god king\" narrative...\n\nbut at a planetary scale... it's quite annoying when the king sleeps...\n\nwhy have trashed america for the uno... \n\nand before the society of nations...\n\nwhat the fuck ! it wasn't the project !\n\nand it makes no sense without ending the red coats first !\n\nnote they are the only to have had and will have the privilege to wear red coat... today, they have vests...\n\nnazis had the leathers coats :D...\n\nbut the mantel...\n\nI end on this :D.\n\nit would be nice that at least the moon landing is true... there should be still footsteps... who can walk on the moon without leaving a trail?",
			"added": 1616103688
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "What Bidet doesn't understand, is that Putin is still front-line, russians :).",
				"added": 1616027904
			},
			{
				"comment_id": 4,
				"body": "How \"suicidal\" are the americans? Hard to tell, they may want to kill their worthless pedos protectors so called soldiers soon... but as always can't do it themselves and so will involved others... some in the west believe they have a divine right to be planetary managers...",
				"added": 1616048245
			},
			{
				"comment_id": 10,
				"body": ">President Donald Trump told G7 leaders that Crimea is Russian because everyone who lives there speaks Russian, according to two diplomatic sources. Trump made the remarks over dinner last Friday during a discussion on foreign affairs at the G7 summit in Quebec, Canada, one of the diplomats told BuzzFeed News.\n\nhttps://www.buzzfeednews.com/article/albertonardelli/trump-russia-crimea\n\nI guess a little birdie told me that the human rights cowboys have yet not understood the reality on the ground...\n\n>Water supplies problem in Crimea to be resolved by summer, authorities say \nhttps://tass.com/economy/1267321\n\nother subjects : \n\n>FSB foils terror attack in Russia’s Adygea republic \nhttps://tass.com/emergencies/1266783\n\n>Roscosmos is more interested in creating a national orbital station, says CEO \nhttps://tass.com/science/1267017\n\nMir2.0 is back !",
				"added": 1616057770
			}
		],
		"1615964839_1CVe9cCruLHfk9DvG79pUbeLBqdMR9i4FZ": [
			{
				"comment_id": 2,
				"body": "The \"revisionist\" meme is back ! awesome ! what do the human rights cowboy raping kids on islands while china build defense systems means with it?\n\nThey mean that china is opposing the natural world order that the childrapist feodalist cleptocratcs have created : aka they want to keep occupying HK, Taiwan, Tibet, Xinjiang, but what I don't get, is : why not Beijing or Shenzen? \n\nanyway... as said we can't stop the american pedos protectors (DoD) and co to come to die, rest assured they will be fought again.",
				"added": 1616047915
			},
			{
				"comment_id": 7,
				"body": "I am curious what Trudeau did (black mail material) to have captured Meng... \n\nFurthermore I don't believe the americans will want to discuss this topic, I guess it's \"revisionist\" too? do the americans believe they can capture any single chinese they want for any reason they want furthermore worldwide? But impossible for them to arrest more than 2 POIs in pedogate and 1 in weinstein case?\n\nto not be able to tell if the MAD armed adversary is rational is quite a frightening though, for anyone who still can.",
				"added": 1616049968
			},
			{
				"comment_id": 9,
				"body": ">EU To Sanction China For First Time in 3 Decades Over Uighur 'Genocide'\n\nhttps://www.zerohedge.com/geopolitical/eu-sanction-china-first-time-3-decades-over-uighur-abuses\n\nRemember it's not the EU, it's the UNO / global agenda using the EU. Furthermore, the EU track record in genociding / replacing it's NATIVE population is unsurpassed... \n\nanyway, what does it changes? nothing the internal domestic market, aka raising the next tier is such a challenge... I guess for the western childrapist feodalist the development of china is over... they don't understand the word \"rejuvenation\" :) or quality sustainable harmonious growth, china wide !",
				"added": 1616054078
			}
		],
		"1615970780_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 3,
				"body": "> [zeronet121](#comment_2_16QitMWmQHjZbYmEL1xp9AnNeykEFPCzy2): I can't seem to catch up. Can you give us some link please?\n\nyou will have to DYOR... how much do you pay? nothing, so go fuck yourself.",
				"added": 1616047994
			}
		],
		"1616048962_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 5,
				"body": "zerotechtalk : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/",
				"added": 1616049011
			}
		],
		"1615446906_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 6,
				"body": ">Twitter defends its child sex trafficking users, cites Section 230 immunity protection for pedophiles\n\n>A new lawsuit alleges that Twitter is aiding and abetting child sex traffickers and pedophiles by allowing them to buy and sell children, as well as spread child pornography, on its platform. Twitter, in its own defense, says the immunity protections outlined in Section 230 of the Communications Decency Act (CDA) do not require the social media service to act on behalf of innocent children who are being exploited. If it was Donald Trump attempting to tweet about the fraudulent 2020 election from a separate account – Trump's personal account was banned by Twitter several months ago – you can be sure Twitter would immediately flag and remove the \"offending\" tweet, as well as the account used. Since we are talking about children being raped and abused, however, Twitter is not at all concerned. According to Jack Dorsey and Co., the lawsuit should be dismissed because Twitter bears no responsibility in removing child pornography and those who create and spread it from its platform.\n...\n>The Epoch Times reported back in January that Twitter \"knowingly\" benefits from the child sex trade. By failing to act against the dissemination of sexual abuse material when reported, Twitter is telling the world that it supports the sexual exploitation of innocent children, even as it generates witch hunt after witch hunt against conservatives and Trump supporters who use the platform. According to the suit, Twitter routinely fails to report child sex abuse content in a timely fashion. In at least one instance, the company allowed child pornography to be viewed 167,000 times and re-tweeted 2,200 times before it was eventually removed from the platform, seemingly reluctantly. If it were up to Twitter, the entire platform would probably be dedicated to child pornography, seeing as how its predominantly leftist user base seems to enjoy that kind of thing.\n...\n> Twitter had no problem immediately censoring Trump, however, because his words are \"mean\" and some people get really angry whenever they read them. Getting rid of Trump was obviously a much bigger priority for Twitter than protecting the innocent against vile exploitation. And people wonder why America is on the fast-track to hell?\n\nhttp://natural3jytxrhh5wqmpcz67yumyptr7pn2c52hppvn3vanmqzjlkryd.onion/2021-03-17-twitter-defends-child-trafficking-pedophiles.html",
				"added": 1616049210
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 8,
				"body": "Seriously what did they do erin burnet? I mean have you seen her closing her eyes all the time like someone with difficulties? or maybe it's morse code to try to tell the world she is held hostage by the americans occupants? who knows...",
				"added": 1616050041
			}
		],
		"1616048739_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 11,
				"body": "> [draugrdeathlord](#comment_558_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): what a snowflake that burgess dude is\n\nhey thanks for your reply. No, I don't think so. It's smart not to fall in the language traps of the adversaries. However I would even remove this demonic word : terrorists. terrorism is just a tactic. nothing else, nothing more. And would replace it by VIOLENT ACTS. For example I consider (terrorists) or violent actors those who banned Milo Yiannopoulos for entering Australia for WORDS as the VIOLENT INDIVIDUALS deserving arrests.\n\nhttps://www.rt.com/news/454009-milo-banned-australia-christchurch-comments/\n\nHowever amd that's where I think you are dangerously wrong this Burgess, knows full well that he serves the UNO / Global Agenda... and so has committed TREASON and all his little narratives are just designed to hide this.\n\nWhen the2ndA back? until then Australia is occupied.",
				"added": 1616087249
			},
			{
				"comment_id": 13,
				"body": "best word for terrorists is enemy combatants.",
				"added": 1616088862
			},
			{
				"comment_id": 14,
				"body": "some add marked or unmarked before, but that's it... nothing else, nothing more.",
				"added": 1616088932
			},
			{
				"comment_id": 15,
				"body": "For example : Burgess is an enemy combatants using a false coat. why? he arrests people for plants of the creation using violence. as such he is an enemy and he combats, but his coat is false, as he should wear the blue helmet with white letter : UN.\n\nof course mr Burgess doesn't agree and can launch his propaganda operations to discredit this simple reality...",
				"added": 1616089150
			},
			{
				"comment_id": 16,
				"body": "other examples :\n\nthe guy in canada beaten for prozelitizing against the pedo transgender nazi (in the sense of seeking to create a new social regime) is to them a marked enemy non combatant (because he had fliers on him)\n\non the other side those who attacked him are unmarked enemy combatant... self explanatory.\n\nyes, marked doesn't have to refer to a recognized by the UNO / global agenda entity.\n\nfor example talibans are clearly marked !",
				"added": 1616089870
			}
		],
		"1616087739_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 12,
				"body": "Furthermore, I guess it was introduced and amplified with the movie : \"lord of the ring\" where a lot of weak minded individuals lost their self esteem and sense of reality.\n\nI would even add that the word \"community\" implies to me a sense of lawlessness... like in obama original tribe.\n\nfor me a community can work for hobbies, work associations etc... I guess it's a key word of the frankfurtrer critical theory to splinter population before using each minority group perviously used to destroy the majority in self canabilization.\n\nI guess the normalization protocol of the frankfurt critical school is very violent...",
				"added": 1616088206
			},
			{
				"comment_id": 17,
				"body": "For example the French Prime Minister just used the word : \"concitizen\"... citizen with, aka we the french people. clear, precise, just, traditional, orginal. nothing else to say. the nazi in the pedo feodal admin use : folks or community, aka undetermined term, but not by mistake, by design, to follow the UNO / global agenda in their drive to establish a planetary serfdom.",
				"added": 1616090561
			}
		],
		"1616091369_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 18,
				"body": "+ full asset ceazure... nothing... sewer ! you want LA? you get LA.",
				"added": 1616091404
			},
			{
				"comment_id": 19,
				"body": "then he can smile and die :) I DON'T GIVE A SHIT !",
				"added": 1616091434
			},
			{
				"comment_id": 20,
				"body": "unauthorized access to a data base not using hacking, terrible crime... very very very bad ! lucky to escape death sentence !",
				"added": 1616091474
			}
		]
	},
	"comment_vote": {}
}