{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1HVJvkzPdXDEtsjBSzFLyx6KsG8Tg2nnr5": [
			{
				"comment_id": 1,
				"body": "Hello Magyarok ! Szeretnék valahogy részt venni a projektben és minden anyagi ellenszolgáltatás nélkül segíteni fordítani debuggolni tesztelni designolni vagy egyszerűen terjeszteni a jónép felé. Még azt se tudom hogy egyáltalán jó helyre irom e a hirtelen felindulásból jött örömöm, de sebaj még 0 day user vagyok, lesz ez még így se. Nem motivál a pénz kereset, sőt kifejezetten ellne munkálkodom eddig nagy sikerrel :(se bankszámla, se tisztességes fizetés). Amin jelenleg dolgozom egyedül egy olyan hálózati kommunikáció amihez nem kell se szolgáltató, se harmadik fél. (hálózati hidak loopback-el Wan-Man-Lan-Pan) Jelenleg a jógvédő az egyetlen állatfaj aki megfertőzi még a kormányzati portálokat is csak azért begyüjtse rólad az infókat. illetve a tárolt tartalmaidról. Peergurdian szerü kis alkalmazással anno lehetett figyelni hány robot érkezik a gépedre jelentést tenni >>hozzávetőlegessen 1-2 millió kérés/óra<<. Vannak az életbe olyan dolgok amik megilletnek MINDEN embert ám nagyon kevesen közülünk megpróbálják ezt csírájában elfolytani és visszaterelni a \"tökéletes\" fogyasztási mederbe. Én egy olyan előadó is vagyok akit többek között a saját műveiért is megbüntet a mahasz, az ifpi az asva és még a tököm tudja mennyi újjonnan alakult civil emberekből álló \"besugói gárda\". Cserháti Zsuzsa életét anno egy Erdős Péter nevü zsiráf tette tönkre aki egyszemélyben volt a hazai zeneipar cenzÚrája. Megannyi tehetséget küldött a levesbe. Na az ilyen patkányok ellen harcolok, mert van öröksége mai napig is, és nem tétlenkednek beköpik még a pickszalámit is:) szóval pörgessük a tekervényeinket és alkossuk már meg azt aminek már a kezdetek óta létezni kellene. Üdv.",
				"added": 1588668130
			}
		],
		"1_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": [
			{
				"comment_id": 2,
				"body": "Sziasztok! Ezt kerestem vagy 15 éve. Kicsit lassú a böngészöm is meg a gép se mai:)",
				"added": 1588668738
			}
		],
		"1_1LoSnDfaYjrwHLzXDPgxW81doTMnVq19hg": [
			{
				"comment_id": 3,
				"body": "Szevasztok egy multi webkonf ötlete a közeljövőben felmerült valakibe? youtube élő+ minden",
				"added": 1588673705
			}
		]
	},
	"comment_vote": {
		"3_1DTAhpf3ehXs9f3z21gxQ77ddow9NPVtZS": 1,
		"1_1QJfYNUSTtMUJ7tqTyR5QUPtAHqFQcmseo": 1
	}
}