{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 1,
				"body": "Угу, а из-за рубежа будут вещать вражеские длинноволновые станции, передавая апдейты зарубежных зайтов на модемных скоростях. Back to USSR.",
				"added": 1525250369
			},
			{
				"comment_id": 2,
				"body": "> [calmaquesse](#comment_9_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Ну, если так рассуждать, то смысла нет вообще сопротивляться и мутить какие-то там диджитал резистансы.\n\nЕсли диджитал резистансы сводятся к мечтам о незасекаемых каналах связи, то смысла реально нет. СССР развалился не от самиздата и не от подпольных записей рок-музыки.",
				"added": 1525251703
			},
			{
				"comment_id": 3,
				"body": "> [strelok](#comment_14_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Обнаружить или задавить лазерную линию без точной информации о месторасположении (вплоть до сантиметра) нереально.\n\nНепонятно, кто всё это счастье будет оплачивать.",
				"added": 1525251770
			},
			{
				"comment_id": 9,
				"body": "> [calmaquesse](#comment_23_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Основной трафик идёт через вай-фай по системе \"роутер-роутер\" внутри города.\n\nМы гипотетически рассуждаем про сегодняшнюю Росиию или про full--КНДР mode? Во втором случае никакой \"роутер-роутер\" сети не будет. Будет по улицам ездить патруль и выявлять шпионов и вредителей с Запада, занимающихся несертифицированным предоставлением услуг связи.",
				"added": 1525261488
			},
			{
				"comment_id": 10,
				"body": "> [calmaquesse](#comment_24_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): И всё же, однозначно, чисто умозрительно возможность засечь всё и вся невелика. Это затраты времени и средств, а укрыться можно, просто выключив на время излучатель.\n\nРади чего человек будет рисковать свободой, даже при условии, что возможность засечь невелика?\n\n> [calmaquesse](#comment_25_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Почему вы настолько уверены в тотальном всесилии и всеохватности нашего государства?\n\nПотому что на другой стороне вообще ничего нет. Житель мегаполиса с двумя детьми и тремя кредитами и без каких-то претензий к государству, выходящих за пределы \"заблокировали рутрекер, нипокачать\".",
				"added": 1525266187
			},
			{
				"comment_id": 12,
				"body": "> Лично я подвергаю сомнению некоторые методы ее обхода.\n\n+1",
				"added": 1525267132
			},
			{
				"comment_id": 14,
				"body": "> [balancer73](#comment_355_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Таких везде достаточно много. А для того, чтобы шла связь в том же ZeroNet достаточно единичных гейтов в «большой внешний Интернет» :)\n\nКонкретно для меш-сети надо не просто много, а очень много. Мы не гейты обсуждали, а \"локалку\", если так можно выразиться.\n\nВообще, вся эта романтика \"цифрового сопротивления\" хороша, когда КНДР-режим существует лишь в воображении. А на практике она закончится с парой показательно выбитых ОМОНом дверей, смачно показанных в вечерних новостях, с последующими судами и реальным сроком. И все романтики сразу рассосутся.\n\nПотому что исходная постановка вопроса о цифровом или еще каком сопротивлении кривая. Проблема Кремля в том, что он не может объяснить населению, зачем он нужен, — но ровно такая же проблема и у любой оппозиции в стране. В России ни у кого нет ни политической программы, ни идеологии, ни видения будущего, ради которых люди готовы были реально оказывать неповиновение государству и нести ущерб.\n\nНадо бы задуматься о не том, что Путин заручивает болты, а о том, что он их закручивает в сливочное масло, а не в титан.  Иначе надорвался бы.",
				"added": 1525267905
			},
			{
				"comment_id": 17,
				"body": "> [balancer73](#comment_357_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А когда у нас в России было без идиотизма?\n\nЛол, да. Вроде, какому-то из Александров (2-му?) приписывают слова: «Управлять Россией несложно, но совершенно бессмысленно».",
				"added": 1525269960
			},
			{
				"comment_id": 18,
				"body": "> [balancer73](#comment_357_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): политики, при которых станет лучше? Можно имена? :)\n\nВ соседнем треде я вот тоже спрашиваю, — если не Путин, то кот? В ответ слышу только мы люди мира, нам вождь не нужен.\n\nВ целом Путин — не худшее, что могло случиться с Россией, учитывая исторический контекст. Менталитет завхоза не соответствует масштабу страны? Шизофреническая внешняя политика? Вертикаль власти не способна управиться с собственными губернаторами? Ну по крайней мере, человек прилично выглядит, не пьёт, способен связно выступать перед аудиторией — на фоне иных отечественных деятелей это реально достижение.\n\nЯ понимаю, что многим хочется жить с уровнем свобод как в США, но почему-то они не хотят принять тот факт, что сейчас США — столица мира, а Россия — территория на задворках цивилизации, на десятилетия отстающая что в технологическом, что в культурном отношении. И как всегда на периферии, исторические процессы здесь порой принимают самые извращенные формы. А для формирования адекватной власти нужна адекватная элита, способная сама для себя объяснить смысл своего существования и управления страной.\n\nЕсли считать, что Путин — это какой-то колдовской морок, наваждение над великой-прекрасной Россией, и стоит ему рассеяться, как вокруг обнаружатся образованные, замечательные, культурные люди, которые сразу всё исправят — то жить, наверное, легче. Вот только что же эти люди не могут взять и всё исправить прямо сейчас? Не будет этого Путина, появится еще один \"Путин\", и дай бог, чтобы он не был умственно неполноценным, как некоторая наша \"оппозиция\". Другой элиты в стране нет.",
				"added": 1525272271
			},
			{
				"comment_id": 19,
				"body": "> [balancer73](#comment_359_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот «флоппинет» прекрасно справляется с задачей связывания таких локалок :) Мы это в середине 1990-х проходили уже :)\n\nС зеронетовской автоматизацией рассылки обновлений это будет даже удобно, хоть и медленно.",
				"added": 1525272379
			},
			{
				"comment_id": 20,
				"body": "> [strelok](#comment_20_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Лол.\n\nАргументировано.",
				"added": 1525280708
			},
			{
				"comment_id": 21,
				"body": "> [strelok](#comment_21_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): А их зачистка даже будет благом.\n\nЗачистим и выберем Навального в президенты. Или нет, лучше сразу нанести по самим себе ядерный удар — помирать, так с музыкой.",
				"added": 1525280993
			},
			{
				"comment_id": 22,
				"body": "> [strelok](#comment_22_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Сегодняшний уровень жизни имеется не благодаря действующей власти а скорее вопреки. Единственная их заслуга - они не сильно мешали развитию, по крайней мере года до 12.\n\nПонимаешь, всё это никак не отвечает на вопрос, а в чем альтернатива. Ну свергите вы правительство , и дальше, что? Скатываться в Украину?\n\nЭто ж слава богу, что они нам не сильно мешали. Потому что будь в Кремле такие молодцы со взором горячим, как вы предлагаете, — мешали бы будь здоров.",
				"added": 1525281233
			},
			{
				"comment_id": 23,
				"body": "> [balancer73](#comment_362_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Образование мало что даёт без идеологии. А вот тут у нас, действительно, большой прокол. Советскую идеологию разрушили. Новую не построили. Вариант «учиться, чтобы потом жить по-кайфу» в школьные годы не прокатывает. Да и в результате строится та же структура власти, что мы и наблюдаем. Труд учителя совершенно не престижен. Средств воздействия на трудных детей нет. А на что всё это менять — х.з.\n\nНужна идеология, объединяющая в себе все исторические периоды России в единое целое. Это доставшаяся нам в наследство проблема советского мышления — обвинять предшественников во всех грехах, чтобы объяснить, почему было так плохо. Или шире — шаблон мышления левых течений, закрепившийся на уровне всей страны после революции. Пока государство считает слово \"русский\" поводом для статьи за экстремизм, русские националисты считают советских дегенератами, а либералы считают и тех и других людьми второго сорта, «учиться, чтобы потом жить по-кайфу» так и остаётся наименьшим возможным знаменателем. Совершенно непонятно, ради чего стоит жить посреди этого клубка копошащихся змей.",
				"added": 1525312284
			},
			{
				"comment_id": 24,
				"body": "> [sgushennayavoda](#comment_22_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu): Зачем заполитотили годную тему?\n\nНе думаю, что она годняя была, но, в любом случае, замечание верное, пойду создам другую. За одно и с новым user ID-ом.",
				"added": 1525312414
			}
		],
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": [
			{
				"comment_id": 4,
				"body": "> [calmaquesse](#comment_15_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Да? 77% на недавних выборах \"нарисовали\"? Ну 5% можно накинуть, ну 10, но не столько же.Если бы их не было, мы бы сейчас жили в другом обществе и других условиях, не находите?\n\nЗа Собчачку что ли голосовать?",
				"added": 1525256162
			},
			{
				"comment_id": 5,
				"body": "> [calmaquesse](#comment_18_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Лол.\n\nНу точно, если на выборы никто не придёт, то Путин расстроится, зарыдает и убежит.",
				"added": 1525256970
			},
			{
				"comment_id": 6,
				"body": "> [calmaquesse](#comment_19_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Я намекаю на то, что вам вообще не приходит в голову существовать в отрыве от государственных институтов и т.н. \"выборов\".Вы даже не понимаете, что Путин - он не в Кремле, он в головах.\n\nВоу, воу, палехчи. Телепаты через ZN определяют, чего я не понимаю, вместе с IP адресом. xD\n\nОкей, тогда я тоже намекаю:\n\nВам в голову не приходит, что даже если вы хотите \"существовать в отрыве от государственных институтов\", то у государства на этот счёт иное мнение? И у него есть возможности, чтобы своё мнение навязать, не спрашивая, чего кто там хочет.",
				"added": 1525257339
			},
			{
				"comment_id": 7,
				"body": "> [calmaquesse](#comment_20_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Поэтому голосовать за Собчачку просто бесполезно, да даже за Михаила Светова бесполезно. Все это части одного целого.\n\nЯсно-понятно.\n\n> [calmaquesse](#comment_20_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Ну, знаете, ни одно государство пока еще не может тотально прозомбировать всех. Только тех, кто к этому готов и хочет этого.\n\nБольшинство людей выбирают из того, что видят. Создавать позитивную программу — это задача интеллектуальной элиты общества. Не надо никого зомбировать даже, если выбор — между Путиным и \"либералами\".",
				"added": 1525258360
			},
			{
				"comment_id": 8,
				"body": "> [calmaquesse](#comment_22_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Не думаю, что посты в Одноклассниках или смехуечки на Пикабу нужно как-то шифровать.\n\nКстати, не факт. Сегодня смехуечки, а завтра — нарушение УК.",
				"added": 1525260598
			},
			{
				"comment_id": 13,
				"body": "> [calmaquesse](#comment_27_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Но всё равно тотальное большинство поддерживает Путина. \n\nВы так и не пояснили, кого им поддерживать, если не Путина.",
				"added": 1525267206
			},
			{
				"comment_id": 15,
				"body": "> [calmaquesse](#comment_29_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Я просто не могу спорить с человеком в парадигме \"хороший вождь - плохой вождь\".\n\nВы сами её предложили, подняв тему процента на выборах, а теперь спорить не можете.",
				"added": 1525268131
			},
			{
				"comment_id": 16,
				"body": "> [calmaquesse](#comment_30_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): А вы спрашиваете \"Кто, если не Путин?\"\n\nОчевидно, что людям, сходившим на выборы, не чужда парадигма \"хороший вождь - плохой вождь\". Так что если мы хотим поразмыслить о будущем России, этот факт не стоит сбрасывать со счетов.\n\n> [calmaquesse](#comment_30_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Да потому что я подразумевал, что лезть в государственные институции вообще не стоит.\n\nПо моему мнению, наоборот. Лезть в государственные институции — в любой форме, начиная от мирных выборов и заканчивая военными действиями, — это единственный способ влиять на политическую ситуацию. Ну не нашими же разговорами на неё влиять?",
				"added": 1525269076
			}
		]
	},
	"comment_vote": {
		"64_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"11_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": 1,
		"360_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"362_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}