{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1578251555,
			"title": "ZeroNet Mobile Feature Request",
			"body": "I was working on ZeroNet Mobile app for Android with Latest py3 branch from scratch.\nIf you're interested you can download latest version at \nhttps://github.com/canewsin/ZeroNet/releases/latest\n\nIf you want some specific feature request post as a comment if i think it is neccessary or if your comment gets more upvotes i will add that feature in the app.\n\nAlready Planned :\n- Windowless Background Operation\n- Autorun feature\n- Users.json backup or restore\n- ZeroNet Code Patching until changes got merged into official\n- Custom Data Folder Location\n- Tor Support if Possible (no gurantee ðŸ˜›)\n\n\nrelated content :\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1578171588_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd",
			"added": 1578251554
		},
		{
			"topic_id": 1579466164,
			"title": "Just Performed Flutter Clock Challege.",
			"body": "Digital Clock\nFlutter Clock is an implementation of a digital clock in Flutter. It has a light theme and a dark theme.\n\nIt has 3 Types Clock in it.\n\nDigital Clock.\nBinary Clock.\nText Clock.\nDigital Clock will show time as normal clock, but it does not end there, digital clock has circles on it, these shows numbers in binary format, and another clock is text clock, which shows time in text format, not just that. it wishes every minute, just like other digital clocks it has weather and day details. If you are a techy, you will like the clock with binary language. It has ticker in the middle, ticker seems like climbing dots or snake animation, but they are implemented using binary digits, for unknown people they seems like an animation but for known people it will entertain meaningfully. Weather details update every 20 secs covering Avg, Min, Max temperatures as well as weather condition.\n\nBenifits :\n\nIts code is optimised for smart clocks which have less powerful chips and ram resources.\nContains both light and dark themes.\nSimple and modern design.\ndesign is familiar to most smart clocks.\n\nVideo : https://www.youtube.com/watch?v=Lk-fFNvEX1E\nRepo : https://github.com/canewsin/flutter_clock/tree/master/digital_clock",
			"added": 1579466161
		},
		{
			"topic_id": 1596100807,
			"title": "Lost Zerome Profile, Accidentally Pressed Join in ZeroMe while downloading MoonHub",
			"body": "It created new profile, How can i get my previous posts back ??.",
			"added": 1596100803
		},
		{
			"topic_id": 1597198574,
			"title": "ZeroNet Mobile is an Android App which has py3 support",
			"body": "Download link to PlayStore.\nhttps://play.google.com/store/apps/details?id=in.canews.zeronetmobile\n\nGithub Releases Page\nhttps://github.com/canewsin/zeronet_mobile/releases\n\nOlder Version Releases are available at\nhttps://github.com/canewsin/ZeroNet/releases\n\nApkPure Link\nhttps://apkpure.com/p/in.canews.zeronet\n\nApkFiles.com Link\nhttps://www.apkfiles.com/apk-604585/zeronet-mobile\n\n\n\nApp is OpenSource Now, Source code is Available at\nhttps://github.com/canewsin/zeronet_mobile\n\nReport your Issues, feedback and post your feature requests here.\nZeroNet Mobile\nhttp://127.0.0.1:43110/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk/",
			"added": 1597198569
		},
		{
			"topic_id": 1602987903,
			"title": "ZeroNet Mobile with modern ui released to Google Play Store.",
			"body": "ZeroNet Mobile with modern ui released to Google Play Store.\nhttps://play.google.com/store/apps/details?id=in.canews.zeronet\n\nGithub releases at https://github.com/canewsin/zeronet_mobile/releases\n\nTry and give your feedback. ðŸ˜ƒðŸ˜˜\n\nIf you want to help zeronet to grow more, just translate this post to your local language repost this in local language forum.",
			"added": 1602987897
		},
		{
			"topic_id": 1607188641,
			"title": "Video About Your Data on  Google.",
			"body": "https://youtu.be/hLjht9uJWgw",
			"added": 1607188634
		},
		{
			"topic_id": 1607189377,
			"title": "Why Facebook is Dying - And How it's Trying to Survive",
			"body": "https://www.youtube.com/watch?v=Oh6iX6gDU6k",
			"added": 1607189369
		},
		{
			"topic_id": 1615311419,
			"title": "ZeroNet Mobile with modern ui released to Google Play Store.",
			"body": "ZeroNet Mobile with modern ui released to Google Play Store.\nhttps://play.google.com/store/apps/details?id=in.canews.zeronetmobile\n\nApkPure : \nhttps://apkpure.com/p/in.canews.zeronetmobile\n\nGithub releases at \nhttps://github.com/canewsin/zeronet_mobile/releases\n\nFor Reporting Issues about the App Link for Support forum\n[ZeroNet Mobile](/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk) \n\nZeroNet is a p2p network that BitTorrent network and uses bitcoin cryptography.\nIt has built in tor support for privacy and anonymity.\nMore about ZeroNet at https://zeronet.io\nTry and give your feedback. ðŸ˜ƒðŸ˜˜",
			"added": 1615311410
		},
		{
			"topic_id": 1628310919,
			"title": "Had an Idea about creating fork of ZeroNet for ZeroNet Mobile.",
			"body": "As you may all know, I was developing zeronet mobile for several months, i was carefully watching the pull request increase for ZeroNet core, but nofish is out of communication for several months, i was planning to make a fork to speed up development process, as a pilot project, i will create a fork for ZeroNet Mobile, and give an option to use what repo they prefer in ZeroNet Mobile App to use. during this process i will consider the active developers of repo to accept the pull requests. if this makes difference in quality of the app further, i can proceed further to release the Desktop runner for other platforms.\n\nAs a community, i want all of your opinions to move further.",
			"added": 1628310909
		},
		{
			"topic_id": 1628411219,
			"title": "Promote ZeroNet in Other Platforms.",
			"body": "This is the right time to save our community, we need to educate others, why free speech is necessary, \nif we discuss our self in ZeroNet about future of it, it makes no difference, so put your leg outside and promote in most user reaching platforms.\n\nUse your own words use tags like #FreeSpeech #ZeroNet #ZeroNetMobile or you may retweet at https://twitter.com/PramukeshVenky/status/1424282897742139394, it doesn't matter which platform you use, it's only matters how much you made the difference.\n\ntranslate this post to other language forums, so that all our community members will support us.",
			"added": 1628411208
		},
		{
			"topic_id": 1628958951,
			"title": "Post Known ZeroNet Proxy Sites here.",
			"body": "Sites I Know:\nhttps://0net-preview.com/",
			"added": 1628958939
		},
		{
			"topic_id": 1629038529,
			"title": "Crypto Naming System - DNS Like Proof of Work Naming System",
			"body": "DNS is successful due to human readable naming system and their records liking with their servers in centralised source. But for decentralised network accessing, outside the network is not preferable by its users, namecoin systems exists for a reason with blockchain, which is no go users because we have store namecoin blockchain, since it is not just related to zeronet, it is huge in size and sharing huge amount of namecoin full blockchain data is not feasible. Also few services like domain data stores exists eg: name.yo etc, but outside the zeronet, we cannot verify the integrity of the domain. Other services like vanitygen exists for semi readable names, we should have DNS like Name System for cryptography area. Thus I drafted a solution for this problem, and made a software CryptoNS-gen, currently it's just a prototype, but for testing it works for now for you to test it, main idea is bitcoin addresses are random, we can produce as many as we want possibly millions in seconds if we use GPUs, user has to give a domain name. Program has predefined patterns, the goal of program is to create a bitcoin address which satisfies one of the predefined patterns, currently program runs on cpu instructions only thus is very slow but you can have 5 letter domain names, but once GPU computing is involved, speed will increase up to 100X, thus we can produce longer domain names, program will output bitcoin address and private key, pattern, domain, since we can reproduce domain from address and pattern, we will have an integrity of address. Currently like vanitygen, CryptoNS-gen is just a address gen thus it doesn't store domain names and addresses, so don't expect it store your domain linking, since domain names are verifiable we can just store in database like ZeroName like sites and retrive them, POW in this context is longer the domain, longer it can take to generate, \"DNS like\" here refers to we have to store these values by linking address and domain or username with a pattern at some place. Since domain and address are linked with pattern, we can ensure there can be only one unique domain is registered across such service provider.\n\nProgram is written using rust, if you're interested, you can hack into source code.\nSource Code : https://github.com/decentnetwork/CryptoNS-Gen\nBinary Release : https://github.com/decentnetwork/CryptoNS-Gen/releases/tag/0.0.1\n\nExample :\nwindows : \n> cryptons_gen.exe zero\n\n```\nresult : zero took : 56 secs, pattern: P\npattern : P\npublic key : 1KZeRrzouETELHti43jtCT2Xi4pqxgB6Su\nprivate key : 5KPZpcXvz3QkCAzPJM5fVapB677aTAkJM3BBFQibahTRiu8V7SM\n```\n\nv 0.0.2\n```\nresult : zero took : 1 secs, pattern: NF\nelapsed time in secs 1\npattern : NF\npublic key : 1Ld6Z5eRYoUeVinrAcrbxBZUmLCG9F88c9\nprivate key : KwsWGb7ASba8ZmNexrbuhdEtUFTH4bG212d7vneHfrzog6cgmywL\n```\n\nYour feedback is appreciated.",
			"added": 1629038516
		},
		{
			"topic_id": 1634612688,
			"title": "MrWhoseTheBoss Presented Some Future Concerns with his YT Video.",
			"body": "https://www.youtube.com/watch?v=FZvee3-PEzo",
			"added": 1634612674
		},
		{
			"topic_id": 1636121010,
			"title": "No Tor == No ZeroNet Connections for New Installs",
			"body": "I recently found that all the default trackers provided in the ZeroNet bundle are not working.\nwithout working trackers, users cannot get/download peers data and initial sites.",
			"added": 1636120995
		},
		{
			"topic_id": 1636121680,
			"title": "Testers Needed For New Decentralised Network in Coming Days.",
			"body": "As I previously said about drafting new Decentralized Network, Currently Implementing that. In coming days, I will test communication protocol for that. If you're interested let me know. If implementation is successful, communication layer for zeronet will be replaced by this new transport layer.\nContribute : If you are able provide a VPS server to me, it will be helpful for more peers. VPS is required until network gets some considerable active peers at initial stage. After that we can avoid VPS in later communication.",
			"added": 1636121664
		},
		{
			"topic_id": 1636751716,
			"title": "Try Zerolink.ml A New Proxy for ZeroNet",
			"body": "http://zerolink.ml/",
			"added": 1636751699
		},
		{
			"topic_id": 1636911670,
			"title": "How to Contribute to ZeroNet via VPS at $5 per Month or Free for 60 Days.",
			"body": "I currently working on Decentralized Protocol for Next Generation P2P Services and Apps. While exploring resources to that project, I came across a VPS Provider Digital Oceans, which offers VPS at as low as $5/month, which is negligible when compared to others and you can host full linux server for that money. You will get 1vCPU/1GB Ram/25GB Hard Disk Space. You can also get $100 Free Credit to use within 60 days, so that you don't have to pay for first 60 days. Service needs a credit card/paypal a/c with $5, paypal users have to pay on signup, credit card users need not to pay upfront. So try your self, ping me if you have any doubts.",
			"added": 1636911652
		},
		{
			"topic_id": 1637504933,
			"title": "ZeroNet Forking in Progress, Any Objections ?",
			"body": "Hello Guys, I held enough to get reply from @nofish but didn't get any. Most of the ZeroNet installations are disconnecting from the network, they either don't know how to make code changes to core or loosing interest in the project. What's you thoughts on this.\n\nFirst Plans:\nFork ZeroNet, Add TOR patch.\nEducate New Users about new source.\nAllow Modified Pull Requests which are not accepted to Original Repo.\nEnable Existing Plugins which support to strengthen the network by default.\n\nFurther Improvements :\nPlugin Store to host plugins submitted by Users for Better Extension of App.\nTranslation Service Providers to provide translations for all languages. Translation Stores similar to above.\nImproved Versions of Default Sites.\nAttract more content creators into the platform.\n\n\nFuture:\nImprove Core.\nPortability to more Platforms.\n\nThese TODOs are planned few months back, but hesitated to post, there are more like these. \n@nofish @styromaniac@kxoid.bit @ssdifnskdjfnsdjk @GitCenter @geekless @lola\nI will tag more people, tag more known developers, users or contributors you know.",
			"added": 1637504914
		}
	],
	"topic_vote": {
		"1578171588_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1597198574_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1602120041_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1616552733_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	},
	"next_comment_id": 144,
	"comment": {
		"1578171588_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> the lock is solved\ni mean lock file issue is solved",
				"added": 1578181506
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_1553_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Running ..\n\nSo you mean Pi Android Version ?",
				"added": 1578185825
			},
			{
				"comment_id": 15,
				"body": ">  Pie ..\nWhat do you mean by Pie in this ?",
				"added": 1578186712
			},
			{
				"comment_id": 16,
				"body": "So you get infinite initialising status in app ? Even though zeronet is running ?",
				"added": 1578188282
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_1560_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Correct.\n\nNoted for next version",
				"added": 1578188690
			},
			{
				"comment_id": 19,
				"body": "> [quantumkitty](#comment_324_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I would happily donate to you...\n\nThanks for your support either mentally or financially both are helpful",
				"added": 1578193295
			},
			{
				"comment_id": 26,
				"body": "If you want i will publish a branch with those chages",
				"added": 1578222059
			},
			{
				"comment_id": 27,
				"body": "@styromaniac\ndid you update the zeronet repo ? or facing error with plane app ?",
				"added": 1578233302
			},
			{
				"comment_id": 28,
				"body": "> [styromaniac](#comment_1565_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've updated to the latest revision.\n\nthat is why you're facing the issue it will be fixed in a while, i just have to change bins on github release. soon i will push changes to official repo hope they will merge those so that coming versions doesn't have to be patched in this way",
				"added": 1578244766
			},
			{
				"comment_id": 31,
				"body": "if you have any feature requests out them here\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe/ZeroNet+Mobile+Feature+Request",
				"added": 1578251646
			},
			{
				"comment_id": 32,
				"body": "> [styromaniac](#comment_1583_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Neither release is downloading the initial files. [...]\n\nYeah I Just realised the same i will check log and report back soon...",
				"added": 1578326510
			},
			{
				"comment_id": 34,
				"body": "> [realiodine](#comment_16_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): You're ...\ni already said it is not open sourced",
				"added": 1578343970
			},
			{
				"comment_id": 35,
				"body": "> [realiodine](#comment_16_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): You're ...\n\ni dont even starts this talk  when i just testing my app i found styromaniac opened thread i continued the discussion here FYI",
				"added": 1578344100
			},
			{
				"comment_id": 36,
				"body": "> [realiodine](#comment_18_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): Then ...\n\nrepo is to put app patches in python code only and to serve the binaries",
				"added": 1578346799
			},
			{
				"comment_id": 37,
				"body": "@styromaniac did you work with ws api in past",
				"added": 1578347769
			},
			{
				"comment_id": 38,
				"body": "@styromaniac\ndo you code python",
				"added": 1578352444
			},
			{
				"comment_id": 40,
				"body": "i had an issue with ws api",
				"added": 1578353768
			},
			{
				"comment_id": 41,
				"body": "https://zeronet.io/docs/site_development/zeroframe_api_reference/#servershutdown\nhere it stated that it will return none but i was getting confirm message response",
				"added": 1578353879
			},
			{
				"comment_id": 42,
				"body": "@styromaniac do know anyone that can help me",
				"added": 1578353914
			},
			{
				"comment_id": 43,
				"body": "this is what i was getting as response\n> {\"cmd\": \"confirm\", \"params\": [\"Shut down <b>ZeroNet client</b>?\", \"Shut down\"], \"id\": 1}",
				"added": 1578353960
			},
			{
				"comment_id": 44,
				"body": "> [styromaniac](#comment_1608_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I shared this link in the ZeroNet chatroom on Riot.im\n\nhow can i see the discussion in chat room",
				"added": 1578354309
			},
			{
				"comment_id": 45,
				"body": "i gona opensource ws api in dart language",
				"added": 1578354430
			},
			{
				"comment_id": 46,
				"body": "this is what i was coding now",
				"added": 1578354449
			},
			{
				"comment_id": 47,
				"body": "> [styromaniac](#comment_1609_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You ...\n\ni linked paypal account but there is an issue until issue is resolved i cannot receive funds thus i didnt post any link",
				"added": 1578354558
			},
			{
				"comment_id": 48,
				"body": "there are only 2 options to me stripe i already filled details for this but some details are remaing and paypal i will try stripe account soon hope it works",
				"added": 1578354789
			},
			{
				"comment_id": 49,
				"body": "donation link\nhttps://liberapay.com/canews.in\ni never used liberapay, i think i filled all required details",
				"added": 1578355952
			},
			{
				"comment_id": 51,
				"body": "> [styromaniac](#comment_1613_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That ...\nwill do",
				"added": 1578357175
			},
			{
				"comment_id": 52,
				"body": "@styromaniac\nput this link on main post so that other people can add their feature requests\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1578251555_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe/ZeroNet+Mobile+Feature+Request",
				"added": 1578357472
			},
			{
				"comment_id": 54,
				"body": "> [styromaniac](#comment_1614_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I ...\n\nthanks for your concern and what is your timezone in your place",
				"added": 1578358391
			},
			{
				"comment_id": 57,
				"body": "> [realiodine](#comment_21_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): Then...\n\nwill do",
				"added": 1578363737
			},
			{
				"comment_id": 61,
				"body": "version 0.2.0 is available with mini size binaries thus faster downloads at first load",
				"added": 1578580240
			},
			{
				"comment_id": 63,
				"body": "> [styromaniac](#comment_1656_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I get a black screen on my Moto G.\n\nOn App Start ? What is Your Android Version.",
				"added": 1578584226
			},
			{
				"comment_id": 66,
				"body": "> [6283822](#comment_64_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe):  but is app force closing ? or just black screen.\n\nWhat about this ?",
				"added": 1578584720
			},
			{
				"comment_id": 67,
				"body": "Are you updated to latest ?",
				"added": 1578584747
			},
			{
				"comment_id": 68,
				"body": "For Bugs/Issues & Feature Requests I created a Talk Site Here.\nhttp://127.0.0.1:43110/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk/",
				"added": 1578585718
			}
		],
		"1578060149_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 20,
				"body": "What does n't work ? I m currently using it for native apps",
				"added": 1578194263
			}
		],
		"1578361046_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [],
		"1578522999_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 59,
				"body": "> [robione](#comment_390_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): this you should not be finding a place in ZN to hide the key. (inside the box) [...]\n\nWill look into it, looks interesting to me, we can make account system for sites, this is same idea last night, but i don't about bitcoin mnemonic before.",
				"added": 1578538723
			}
		],
		"1578538583_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 60,
				"body": "> pkg install python3\npkg install python \nis enough default version is python3",
				"added": 1578542032
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 74,
				"body": "> [styromaniac](#comment_1705_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Try restarting ZeroNet.\n\ntried already",
				"added": 1578850091
			},
			{
				"comment_id": 78,
				"body": "which rev you are using ?",
				"added": 1578850298
			},
			{
				"comment_id": 80,
				"body": "now i will try it pc",
				"added": 1578850484
			},
			{
				"comment_id": 81,
				"body": "> [styromaniac](#comment_1709_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Don't forget the underscores.\n\nwhere are those",
				"added": 1578850551
			},
			{
				"comment_id": 82,
				"body": "> [6283822](#comment_81_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): where are those\n\nokay i was pasting on wrong field",
				"added": 1578850638
			},
			{
				"comment_id": 83,
				"body": "> [styromaniac](#comment_1710_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ...\n\nok, underscore you refers to 3 and 1 right ?",
				"added": 1578851498
			}
		],
		"1591963383_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [],
		"1594783453_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 85,
				"body": "https://www.tonymacx86.com/ see here for hardware supported by macs",
				"added": 1594786846
			}
		],
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 86,
				"body": "See this for android stuff.\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597198574_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe/ZeroNet+Mobile+is+an+Android+App+which+has+py3+support",
				"added": 1597198671
			}
		],
		"1601057110_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 87,
				"body": "> [spiritus](#comment_14_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN): or even just a percentage\n\ndid you meant for initial setup ?",
				"added": 1601086582
			}
		],
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": [
			{
				"comment_id": 89,
				"body": "i was currently drafting a next gen p2p network. code is not released yet but soon will be published with specs and white paper. \nlink useful to track project https://github.com/decentnetwork",
				"added": 1618332413
			},
			{
				"comment_id": 90,
				"body": "> [pelosis4jail](#comment_12_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q): with censorship embedded or individual moderation, like here, aka muting?\n\ncensorship is hard on p2p, but with some content filtering options like auto-use filters from trusted parties will block most of the spam, i was building an infrastructure instead of an application, so that devs can built services upon it, so a dev can make, an ai that can auto detect a spam and hide, but shown to user that post is hidden, thus giving the user power to show whats in it.",
				"added": 1618586657
			},
			{
				"comment_id": 91,
				"body": "soon i will publish a blog in zeronet about the project, even though i made a ZeroNet Mobile client, i didn't dive much into core itself, thus i was currently digging the ZeroNet core code, which helps in stated project, like cryptography used in ZeroNet.",
				"added": 1618586963
			},
			{
				"comment_id": 93,
				"body": "> [nohidie](#comment_107_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf): I just say that if you don't know who the AI bans, you may miss some interesting content to you :).\n\nthat's where show hidden posts comes into play, so that user can view, whether content is spam or not, problem of muting is content from a person is completely made invisible, but some may continue to use same id to post normal stuff in future, even though those post are not spam we cannot read those content because of muting. suppose user can config a weights for spam posts, if a spammer reaches such limit may completely hidden from discussions.  \nInitial implementation like for example in github issues/discussions some comments can be marked as irrelevant by author of issue/pull request/discussion, thus comment will be marked as non relevant for discussion, but user can view at his will, which is much powerful than muting here.",
				"added": 1618620180
			}
		],
		"1568464993_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": [
			{
				"comment_id": 92,
				"body": "!save",
				"added": 1618596894
			}
		],
		"1620715720_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 94,
				"body": "Hi, ZeroNet Mobile Developer Here. Current i was experimenting with zeronet rust implementation by @anshorei, since i was new to rust, it takes time to stable release, also i didn't get any funding from community even though, i was maintaining the project for 1.5 year lonely, because original python implementation requires python runner for mobile it almost takes 100MB+ for runner itself, thus users are uninstalling frequently if they need space in their mobile. so rust implementation is in need. hoping someone who benefits from project or thinks about project future can support me.",
				"added": 1620796896
			}
		],
		"1626208308_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 95,
				"body": "I can maintain the project, if you are willing to forward it to me and trust me as zeronet mobile dev.\nhttps://github.com/krzysztof113/ZeronetLink/issues/2#issuecomment-880520900",
				"added": 1626339434
			},
			{
				"comment_id": 96,
				"body": "> [moriposting](#comment_1_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf): I'll take it over. Email me at the contact address on MayVaneDay when you get the chance.\n\nMalware Alert Don't Open the Link in Comment.",
				"added": 1626354256
			},
			{
				"comment_id": 98,
				"body": "I'm Posting This because windows shows this as malware\n1MeeJWbbQHArbqD6UUHSjh9EVycvnTUBFa\\dl\\nook\\ratc.bin this is a malware file on Directory.\nwindows recognized as threat found.",
				"added": 1626490785
			},
			{
				"comment_id": 99,
				"body": "> [moriposting](#comment_4_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf): Gaslighting Alert Don't Trust This Comment I Am Quoting. It's a plaintext HTML file. GPG-signed text isn't going to hurt you, idiot.\n\n> [6283822](#comment_98_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): I'm Posting This because windows shows this as malware1MeeJWbbQHArbqD6UUHSjh9EVycvnTUBFa\\dl\\nook\\ratc.bin this is a malware file on Directory.windows recognized as threat found.\n\nsee this comment.",
				"added": 1626490808
			},
			{
				"comment_id": 100,
				"body": "> [letheposting](#comment_1_14ucz1QbvqijBX5KoD5dadxGvRBywLGoHD): It's part of a guide to root a Nook 1st Gen. Holy shit! Did you do any research?\n\nAt least make those as optional files, so that it doesn't download when not needed, will prevent false reporting.",
				"added": 1626668251
			},
			{
				"comment_id": 120,
				"body": "already sent my response on gmail.",
				"added": 1631205415
			}
		],
		"1626384487_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [],
		"1627161257_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 101,
				"body": "You should provide docs on how to use your plugin.",
				"added": 1627189450
			},
			{
				"comment_id": 102,
				"body": "> WebSocket handleRequest error: ...\n\nInstall Btn still shows after installation.",
				"added": 1627286678
			},
			{
				"comment_id": 103,
				"body": "Error Log on ZeroNet Start\n> ERROR PluginManager Plugin Torrent load error: /src/Plugin/PluginManager.py line 138 > ...",
				"added": 1627314210
			},
			{
				"comment_id": 117,
				"body": "wait a minute, i thiought i already compiled libtorrent.so for Android, long time ago. It might be useful.\nhttps://github.com/canewsin/LibTorrent-Android/tree/master/app/src/main/cpp/libtorrent",
				"added": 1629298356
			},
			{
				"comment_id": 118,
				"body": "i was not able to create kxoid.bit, \n> error: Was not able to register an id at the moment.\nand this id, is out of space to post on ZeroTalk.",
				"added": 1629299559
			}
		],
		"1627640020_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 104,
				"body": "i recently updated ZeroNet Mobile with ZeroTalk++, Code Migration was Successful, \nSteps I Followed are - \n1. First Clone ZeroTalk(Since ZeroNet Mobile is based on that.) for Temp Site Testing.\n2. Create Some Posts and Comments.\n3. Opened ZeroNet++ Site and Copied index.html, js/all.js, css/all.css, fonts/...\n4. Manually Modified content.json, mostly site settings.\n5. Upgraded Temp Site Code.\n6. Since There are some styling issues with site on dark mode.\n7. manually added or removed some styling and js etc.\n8. Once i was satisfied, i copied all code in step 3 to ZeroNet Mobile after modification and Upgrade Code on ZeroHello.\n\nResult: [ZeroNet Mobile](/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk)",
				"added": 1627665039
			},
			{
				"comment_id": 105,
				"body": "Also, I used ZeroTalk++ git repo at first, there are some issues with that, so this is the best solution, i found.",
				"added": 1627665207
			},
			{
				"comment_id": 106,
				"body": "```\n  \"cert_signers\": {\n   \"kxoid.bit\": [\"12F5SvxoPR128aiudte78h8pY7mobroG6V\",\"18Mt3CWBpiqJBLsPSu5JxB4B9MeaSwhyJ\"],\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n```\nyour site/data/users/content.json should be like this to allow other id providers.",
				"added": 1627711633
			}
		],
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 107,
				"body": "You can give your opinions here or on my ZeroNet Mobile Forum at below post\n[Had an Idea about creating fork of ZeroNet for ZeroNet Mobile.](/15UYrA7aXr2Nto1Gg4yWXpY3EAJwafMTNk/?Topic:1628323724_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe)",
				"added": 1628323818
			}
		],
		"1627760364_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 108,
				"body": "> [styromaniac](#comment_3189_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I guess I can confirm that this works. I don't know why my phone is able to reach it though. [...]\n\nsince tor, which is shipping with zeronet mobile is already new, it will support tor v3 addresses, thus zeronet just need to know address of v3 peers. it will communicate further, but to create it self as a tracker or suppose to communicate with other onion peers zeronet queries the tor to get own address to send to other peers, this is where tor v3 patch is required. currently i was planning to release v3 patch in next version, almost 60% clients will be patched, as data i collected form playstore, previously, i informed in other thread about [forking the project](/Talk.ZeroNetwork.bit/?Topic:1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe), if had positive response from community, i will further release other platform runners (eg: windows, linux etc.), thus upgrading the most of clients.",
				"added": 1628409139
			},
			{
				"comment_id": 109,
				"body": "> [styromaniac](#comment_3190_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Mac too?\n\nyes, in future though! but only if community adopt for changes.",
				"added": 1628414624
			},
			{
				"comment_id": 110,
				"body": "> [ssdifnskdjfnsdjk](#comment_1068_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think that it is needed to patch zeronet and then enable Bootstrapper plugin in /Plugins - this plugin is i am guessing rather for those who run ZN nonstop or for long periods daily.\n\nAlready planned that.",
				"added": 1628661096
			}
		],
		"1628395676_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 111,
				"body": "What a coincidence, currently working on CryptoNamingSystem from the past week, DNS like POW naming system, hope it will solve current problems, soon publish a post on ZeroTalk about it.",
				"added": 1628784343
			},
			{
				"comment_id": 112,
				"body": "> [gitcenter](#comment_1500_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Amazing! Is it based on blockchain as well? I'd love to test it, if you're going to run a beta test.\n\nIt doesn't require blockchain to work, but service provider like name.yo service may use blockchain to store the domains or ZeroName like service can store those domains in simple names.json file and serve them.\n\nit's like vanitygen but with mathematical patterns, instead of bitcoins, CryptoNS-gen mines bitcoin addresses to match domain with certain mathematical pattern(not limited, we can use any pattern) in address. once successful match is found, it gives domain/username based on service provider(ZeroName/ZeroId), private public key and pattern name. The user has to do himself all this process of mining and submit the domain, pattern, pubkey to service providers like ZeroName,Name.YO to register, The service providers have to ensure not to allow duplicate domains.",
				"added": 1628790507
			},
			{
				"comment_id": 113,
				"body": "> [gitcenter](#comment_1501_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ah, so the duplicate problem is not resolved? Unfortunate.\n\nuniqueness of public address and domain in linked with pattern, here is an example\n```\nresult : zero took : 56 secs, pattern: P\npattern : P\npublic key : 1KZeRrzouETELHti43jtCT2Xi4pqxgB6Su\nprivate key : 5KPZpcXvz3QkCAzPJM5fVapB677aTAkJM3BBFQibahTRiu8V7SM\n```\n\nservice provider has to use these details to add these to domain records.\n\nZeroName retrives domains from namecoin which is a blockchain, Name.Yo is like form to fill domains and address but we cannot determine a domain name from address with pattern, how do name.yo deals with conflicts, its just checks its db whether domain is registered or not, currently i was working on CNS-gen, thus generator part only, for current zeronet dns problems, i thought it would be better than other solutions.",
				"added": 1628791974
			},
			{
				"comment_id": 114,
				"body": "> [gitcenter](#comment_1501_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ah, so the duplicate problem is not resolved? Unfortunate.\n\nCould you elaborate your thought about, what \"duplicate problem\" you refer here?\n\nAs of my understading\n/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F\n/1NameSomeOtherAddressHere\n\nis this the duplicate problem you're refering ?",
				"added": 1628792281
			}
		],
		"1629038529_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 115,
				"body": "> [gitcenter](#comment_1513_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Here are a few fullstops for you, please use them wisely: . . . . . . . . . . . .\n\nyeah, thanks for the suggestion.",
				"added": 1629040608
			},
			{
				"comment_id": 116,
				"body": "> [gitcenter]: I too [...]\n\nI'm out of space for ZeroTalk, so i will give reply from other id 6283823.",
				"added": 1629041838
			}
		],
		"1630791791_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 119,
				"body": "already working on this plan. due to time constraints it's taking too long.",
				"added": 1630941574
			}
		],
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 121,
				"body": "> [halchair](#comment_3_1EBe7Vd6gbAUU4egHUGriHShgMtcx2oQKj): =.= [...]\n\nping me zeromail @6283822.",
				"added": 1634612849
			}
		],
		"1635566142_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 122,
				"body": "Google wants me to remove those options, You can send BTC if you want or I will provide other options.",
				"added": 1635568558
			}
		],
		"1632719590_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 123,
				"body": "Fixed!",
				"added": 1635687948
			}
		],
		"1636121010_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 124,
				"body": "> [xcape2net](#comment_994_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): And how are new ZeroNet users to read your suggestion when their download of ZeroNet does not work?\n\nyes, this is my point for this post. ZeroNet Mobile can be patched by me. what about main source ?",
				"added": 1636145267
			}
		],
		"1636121680_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 125,
				"body": "@reddthekitsune\nZeroMail : 628382",
				"added": 1636293417
			},
			{
				"comment_id": 126,
				"body": "> [zeroseed7b](#comment_5_1D7CCaZGcLek1xMaAfvDkc7pqM18orDKKr): This Will be compatible with actual zeronet protocol?\n\nYes, it will be extensible to any protocol, I'm making it as modular as possible. currently working on transport, once transport is done, there will be decent protocol(base), It can extended with other protocols like zeronet, tor etc., then there will be I/O stuff. After that apps/websites/services etc.",
				"added": 1636562290
			},
			{
				"comment_id": 127,
				"body": "> [irangeek](#comment_8_15PEof54VQE7mki8G8hYa5FgkCgpYgetSg): ZeroNet protocol ..\nIt's a new decentralised network with better features, network layer and lesser resource consumption, it can be compiled to IOT device level chips to servers, that may not be possible with current zeronet code.",
				"added": 1636732630
			}
		],
		"1636751716_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 128,
				"body": "> [musickiller](#comment_24_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Hi! I see that you allow new zites ..\nNew Sites can be Added for Now, but they cannot increase their size more than 10MB. No problem for now.",
				"added": 1636813045
			}
		],
		"1636861616_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 129,
				"body": "âœ”ï¸âœ”ï¸âœ”ï¸",
				"added": 1636864909
			}
		],
		"1636910648_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": [
			{
				"comment_id": 130,
				"body": "since you're using vps, you will get an ip address, enter that ip address with port + your site address in your browser, it will automatically load your website.",
				"added": 1636910769
			}
		],
		"1637164951_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 131,
				"body": "when zeronet.now.im is active, it grabbed as almost 45000+ seed for ZeroHello and 40000+ for ZeroNet Mobile. But don't know the reason, it was done few days back. To test this congestion I created a public proxy my self here http://zerolink.ml. ZeroNet is being used by people around world and more to come in coming days. Major issues are portability and lack of proper strategy in data sharing between peers. Due to this there are data lose issues occurred here and there.",
				"added": 1637169490
			}
		],
		"1637130220_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 132,
				"body": "> [xanadu](#comment_80_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH):  \n\nHe is talking about user post/comment limit, not size size allowed by user.",
				"added": 1637169562
			},
			{
				"comment_id": 133,
				"body": "@merithtk \nYou are on better side than me, I have 50kb limit still now, I was deleting the old posts and comments each time, I ran out of space, tried to reach @nofish few times, not responded.",
				"added": 1637169725
			}
		],
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 134,
				"body": "Lets see how others react!",
				"added": 1637234987
			},
			{
				"comment_id": 135,
				"body": "> [anonymoose](#comment_54_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): I would [...]\nYeah, It's same thought from my side, Unlike Other binary distribution formats python code can be updated on the run so, it's better to hold such type of development on ZeroNet itself, instead on clearnet. In decentnet project, I drafted a protocol that works in this way, since people can contribute to an open-source project unlike on clearnet sites where only code repo owner can set who can acts as contributors to the repo to auto merge changes, protocol handovers the power to the active community, suppose developers like nofish disappears into thin air, based on contributions made by the other users, they will get a score to proceed the work from there, without user need to change the project code source or if project is abandoned, developers can push their code to same repo, users are free to choose the these code updates, more users get their hands on them, better its distributions work.",
				"added": 1637319350
			},
			{
				"comment_id": 136,
				"body": "> [anonymoose](#comment_57_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): Do you have something to link / show?\n\nCurrently It's proprietary and will be released as commercial p2p solutions, so not able to show it. but I will integrate into ZeroNet transport protocol in future, I meant here is DecentNet Transport Protocol for better communication. Other things like Protocol Extensions(as mentioned here) will be released with in White Paper after Protocol Standardization.",
				"added": 1637352460
			}
		],
		"1631033012_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 137,
				"body": "zerolink.ml Torv3 tracker : qn65si4gtcwdiliq7vzrwu62qrweoxb6tx2cchwslaervj6szuje66qd.onion",
				"added": 1637385718
			},
			{
				"comment_id": 138,
				"body": "> [styromaniac@kxoid.bit](#comment_268_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): The port number is required. Edit it into your comment. [...]\n\nzero://qn65si4gtcwdiliq7vzrwu62qrweoxb6tx2cchwslaervj6szuje66qd.onion:26117",
				"added": 1637399376
			}
		],
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 139,
				"body": "> [styromaniac@kxoid.bit](#comment_276_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I approve!\n\nTag more users you know.",
				"added": 1637505267
			},
			{
				"comment_id": 140,
				"body": "> [styromaniac@kxoid.bit](#comment_277_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): ZeroMail needs mobile optimization.\n\n> Improved Versions of Default Sites.\nIt implies the same.",
				"added": 1637505390
			},
			{
				"comment_id": 141,
				"body": "@merithtk as you previously said, I am ready to take over zeronet.link, if you don't have any objections regarding.",
				"added": 1637506237
			},
			{
				"comment_id": 142,
				"body": "> [moriposting](#comment_6_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf): ...how exactly would you take over a domain/service that has already been transferred to someone else?\n\nI think zeronet.link is still owned by @merithtk",
				"added": 1637559175
			},
			{
				"comment_id": 143,
				"body": "> [obrien1984](#comment_20_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9): there is already this one https://github.com/zeronet-enhanced/ZeroNet\n\nThere are some issues with that fork, I will contact geekless to merge his commits into new fork as well, if he agree to do so.",
				"added": 1637675446
			}
		]
	},
	"comment_vote": {
		"33_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1573_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"56_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1
	}
}