{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1523223976,
			"title": "Intel and AMD Processors Contain Hardware Backdoors",
			"body": "If you compute on an Intel machine circa 2008 or later then you should know that part of your system contains proprietary code (encrypted by a master key at intel) running on a microprocessor that has power over the rest of the system, i.e. can access working memory, communicate with crypto over network interfaces and turn a computer on from hard off. This is called Active Management Technology (AMT) and successful exploits that target this backdoor exist. (See links 1, 2.) \n\nLibreboot (.org) has reverse engineered AMT and can even replace the BIOS of a few machines by reflashing an open source bootloader directly to the chip. Even so, Intel should still be considered a compromised computing platform as it has huge security flaws at a hardware level called Spectre and Meltdown. (link 3)\n\nUnfortunately, AMD seems to have a similar problem with it's Platform Secure Processing and while there is no solution at the time of this writing there is pressure on AMD from the community to release PSP's source. (link 4) AMD has less issues with Spectre/Meltdown than Intel but can be still effected. \n\nThe current best solution for those that care about strong security seems to be to computation on select ARM boards; chips such Allwinner A64 are just powerful enough to multitask on a graphical Linux desktop, are semi-open source and are not compromised by Spectre or Meltdown as they don't do branch processing. (link 5)\n\nThe future seems to look good for freedom of computation as a fully open CPU architecture, RISC-V is available now as development level hardware. Hopefully soon we will see a phenomenon something similar to the development and proliferation of GNU/Linux but for CPU architecture. (link 6)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n1 -https://en.wikipedia.org/wiki/Intel_Management_Engine\n\n2 -https://www.eff.org/deeplinks/2017/05/intels-management-engine-security-hazard-and-users-need-way-disable-it\n\n3 - spectreattack.com \n\n4- https://news.slashdot.org/story/17/03/10/2048236/message-for-amd-open-psp-will-improve-security-hinder-intel\n\n5- https://www.olimex.com/Products/DIY-Laptop/KITS/TERES-A64-BLACK/open-source-hardware\n\n6- https://riscv.org/risc-v-isa/",
			"added": 1523223975
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1523223976_1HR8rARGfHybpYKvFC9SSYM2bxvNWNnHB7": [
			{
				"comment_id": 1,
				"body": "Probably a lot of you know this already, apologies in advance if so but- more people need to know about this I think.",
				"added": 1523226785
			}
		]
	},
	"comment_vote": {}
}